{
  "id": "mil.9",
  "title": {
    "pali": "Abhejjavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Khuddānukhuddakapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘abhiññāyāhaṃ, bhikkhave, dhammaṃ desemi no anabhiññāyā’ti. Puna ca vinayapaññattiyā evaṃ bhaṇitaṃ ‘ākaṅkhamāno, ānanda, saṅgho mamaccayena khuddānukhuddakāni sikkhāpadāni samūhanatū’ti. Kiṃ nu kho, bhante nāgasena, khuddānukhuddakāni sikkhāpadāni duppaññattāni, udāhu avatthusmiṃ ajānitvā paññattāni, yaṃ bhagavā attano accayena khuddānukhuddakāni sikkhāpadāni samūhanāpeti? Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘abhiññāyāhaṃ, bhikkhave, dhammaṃ desemi no anabhiññāyā’ti, tena hi ‘ākaṅkhamāno, ānanda, saṅgho mamaccayena khuddānukhuddakāni sikkhāpadāni samūhanatū’ti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgate vinayapaññattiyā evaṃ bhaṇitaṃ ‘ākaṅkhamāno, ānanda, saṅgho mamaccayena khuddānukhuddakāni sikkhāpadāni samūhanatū’ti tena hi ‘abhiññāyāhaṃ, bhikkhave, dhammaṃ desemi no anabhiññāyā’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho sukhumo nipuṇo gambhīro sugambhīro dunnijjhāpayo, so tavānuppatto, tattha te ñāṇabalavipphāraṃ dassehī’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘abhiññāyāhaṃ, bhikkhave, dhammaṃ desemi no anabhiññāyā’ti, vinayapaññattiyāpi evaṃ bhaṇitaṃ ‘ākaṅkhamāno, ānanda, saṅgho mamaccayena khuddānukhuddakāni sikkhāpadāni samūhanatū’ti, taṃ pana, mahārāja, tathāgato bhikkhū vīmaṃsamāno āha ‘ukkalessanti [ukkaḍḍhissanti (sī.), ussakkissanti (syā.)] nu kho mama sāvakā mayā vissajjāpīyamānā mamaccayena khuddānukhuddakāni sikkhāpadāni, udāhu ādiyissantī’ti. ‘‘Yathā, mahārāja, cakkavattī rājā putte evaṃ vadeyya ‘ayaṃ kho, tātā, mahājanapado sabbadisāsu sāgarapariyanto, dukkaro, tātā, tāvatakena balena dhāretuṃ, etha tumhe, tātā, mamaccayena paccante paccante dese pajahathā’ti. Api nu kho te, mahārāja, kumārā pituaccayena hatthagate janapade sabbe te paccante paccante dese muñceyyu’’nti? ‘‘Na hi bhante, rājato [rājāno (sī. pī.)], bhante, luddhatarā [laddhatarā (ka.)] kumārā rajjalobhena taduttariṃ diguṇatiguṇaṃ janapadaṃ pariggaṇheyyuṃ [parikaḍḍheyyuṃ (sī. pī.)], kiṃ pana te hatthagataṃ janapadaṃ muñceyyu’’nti? ‘‘Evameva kho, mahārāja, tathāgato bhikkhū vīmaṃsamāno evamāha ‘ākaṅkhamāno, ānanda, saṅgho mamaccayena khuddānukhuddakāni sikkhāpadāni samūhanatū’ti. Dukkhaparimuttiyā, mahārāja, buddhaputtā dhammalobhena aññampi uttariṃ diyaḍḍhasikkhāpadasataṃ gopeyyuṃ, kiṃ pana pakatipaññattaṃ sikkhāpadaṃ muñceyyu’’nti? ‘‘Bhante nāgasena, yaṃ bhagavā āha ‘khuddānukhuddakāni sikkhāpadānī’ti, etthāyaṃ jano sammūḷho vimatijāto adhikato saṃsayapakkhando. Katamāni tāni khuddakāni sikkhāpadāni, katamāni anukhuddakāni sikkhāpadānīti? Dukkaṭaṃ, mahārāja, khuddakaṃ sikkhāpadaṃ, dubbhāsitaṃ anukhuddakaṃ sikkhāpadaṃ, imāni dve khuddānukhuddakāni sikkhāpadāni, pubbakehipi, mahārāja, mahātherehi ettha vimati uppāditā, tehipi ekajjhaṃ na kato dhammasaṇṭhitipariyāye bhagavatā eso pañho upadiṭṭhoti. Ciranikkhittaṃ, bhante nāgasena, jinarahassaṃ ajjetarahi loke vivaṭaṃ pākaṭaṃ kata’’nti. Khuddānukhuddakapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Abyākaraṇīyapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘natthānanda tathāgatassa dhammesu ācariyamuṭṭhī’ti, puna ca therena mālukyaputtena [māluṅkyaputtena (sī. syā. pī.) saṃ. ni. 4.95; a. ni. 1.4.257 passitabbaṃ] pañhaṃ puṭṭho na byākāsi. Eso kho, bhante nāgasena, pañho dvayanto [dvayato (sī.)] ekantanissito bhavissati ajānanena vā guyhakaraṇena vā. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘natthānanda tathāgatassa dhammesu ācariyamuṭṭhī’ti, tena hi therassa mālukyaputtassa ajānantena na byākataṃ. Yadi jānantena na byākataṃ, tena hi atthi tathāgatassa dhammesu ācariyamuṭṭhi. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘natthānanda tathāgatassa dhammesu ācariyamuṭṭhī’ti, abyākato ca therena mālukyaputtena pucchito pañho, tañca pana na ajānantena na guyhakaraṇena. Cattārimāni, mahārāja, pañhabyākaraṇāni. Katamāni cattāri? Ekaṃsabyākaraṇīyo pañho vibhajjabyākaraṇīyo pañho paṭipucchābyākaraṇīyo pañho ṭhapanīyo pañhoti. ‘‘Katamo ca, mahārāja, ekaṃsabyākaraṇīyo pañho? ‘Rūpaṃ anicca’nti ekaṃsabyākaraṇīyo pañho, ‘vedanā aniccā’ti…pe… ‘saññā aniccā’ti…pe… ‘saṅkhārā aniccā’ti…pe… ‘viññāṇaṃ anicca’’nti ekaṃsabyākaraṇīyo pañho, ayaṃ ekaṃsabyākaraṇīyo pañho. ‘‘Katamo vibhajjabyākaraṇīyo pañho? ‘Aniccaṃ pana rūpa’nti vibhajjabyākaraṇīyo pañho, ‘aniccā pana vedanā’ti…pe… ‘aniccā pana saññā’ti…pe… ‘aniccā pana saṅkhārā’ti…pe… ‘aniccaṃ pana viññāṇa’nti vibhajjabyākaraṇīyo pañho, ayaṃ vibhajjabyākaraṇīyo pañho. ‘‘Katamo paṭipucchābyākaraṇīyo pañho? ‘Kiṃ nu kho cakkhunā sabbaṃ vijānātī’ti ayaṃ paṭipucchābyākaraṇīyo pañho. ‘‘Katamo ṭhapanīyo pañho? ‘Sassato loko’ti ṭhapanīyo pañho, ‘asassato loko’ti. ‘Antavā loko’ti. ‘Anantavā loko’ti. ‘Antavā ca anantavā ca loko’ti. ‘Nevantavā nānantavā loko’ti. ‘Taṃ jīvaṃ taṃ sarīra’nti. ‘Aññaṃ jīvaṃ aññaṃ sarīra’nti. ‘Hoti tathāgato paraṃ maraṇā’ti. ‘Na hoti tathāgato paraṃ maraṇā’ti. ‘Hoti ca na ca hoti tathāgato paraṃ maraṇā’ti. ‘Neva hoti na na hoti tathāgato paraṃ maraṇā’ti ṭhapanīyo pañho, ayaṃ ṭhapanīyo pañho. ‘‘Bhagavā, mahārāja, therassa mālukyaputtassa taṃ ṭhapanīyaṃ pañhaṃ na byākāsi. So pana pañho kiṃ kāraṇā ṭhapanīyo? Na tassa dīpanāya hetu vā kāraṇaṃ vā atthi, tasmā so pañho ṭhapanīyo. Natthi buddhānaṃ bhagavantānaṃ akāraṇamahetukaṃ giramudīraṇa’’nti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Abyākaraṇīyapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Maccubhāyanābhāyanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘sabbe tasanti daṇḍassa, sabbe bhāyanti maccuno’ti, puna bhaṇitaṃ ‘arahā sabbabhayamatikkanto’ti. Kiṃ nu kho, bhante nāgasena, arahā daṇḍabhayā tasati, niraye vā nerayikā sattā jalitā kuthitā tattā santattā tamhā jalitaggijālakā mahānirayā cavamānā maccuno bhāyanti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘sabbe tasanti daṇḍassa, sabbe bhāyanti maccuno’ti, tena hi ‘arahā sabbabhayamatikkanto’ti yaṃ vacanaṃ, taṃ micchā. Yadi bhagavatā bhaṇitaṃ ‘arahā sabbabhayamatikkanto’ti, tena hi ‘sabbe tasanti daṇḍassa, sabbe bhāyanti maccuno’ti tampi vacanaṃ micchā. Ayaṃ ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Netaṃ, mahārāja, vacanaṃ bhagavatā arahante upādāya bhaṇitaṃ ‘sabbe tasanti daṇḍassa, sabbe bhāyanti maccuno’ti. Ṭhapito arahā tasmiṃ vatthusmiṃ, samūhato bhayahetu arahato. Ye te, mahārāja, sattā sakilesā, yesañca adhimattā attānudiṭṭhi, ye ca sukhadukkhesu unnatāvanatā, te upādāya bhagavatā bhaṇitaṃ ‘sabbe tasanti daṇḍassa, sabbe bhāyanti maccuno’ti. Arahato, mahārāja, sabbagati upacchinnā, yoni viddhaṃsitā, paṭisandhi upahatā, bhaggā phāsukā, samūhatā sabbabhavālayā, samucchinnā sabbasaṅkhārā, hataṃ kusalākusalaṃ, vihatā avijjā, abījaṃ viññāṇaṃ kataṃ, daḍḍhā sabbakilesā, ativattā lokadhammā, tasmā arahā na tasati sabbabhayehi. ‘‘Idha, mahārāja, rañño cattāro mahāmattā bhaveyyuṃ anurakkhā laddhayasā vissāsikā ṭhapitā mahati issariye ṭhāne. Atha rājā kismiñci deva karaṇīye samuppanne yāvatā sakavijite sabbajanassa āṇāpeyya ‘sabbeva me baliṃ karontu, sādhetha tumhe cattāro mahāmattā taṃ karaṇīya’nti. Api nu kho, mahārāja, tesaṃ catunnaṃ mahāmattānaṃ balibhayā santāso uppajjeyyā’’ti? ‘‘Na hi bhante’’ti. ‘‘Kena kāraṇena mahārājā’’ti. ‘‘Ṭhapitā te, bhante, raññā uttamaṭṭhāne, natthi tesaṃ bali, samatikkantabalino te, avasese upādāya raññā āṇāpitaṃ ‘sabbeva me baliṃ karontū’ti. ‘‘Evameva kho, mahārāja, netaṃ vacanaṃ bhagavatā arahante upādāya bhaṇitaṃ, ṭhapito arahā tasmiṃ vatthusmiṃ, samūhato bhayahetu arahato, ye te, mahārāja, sattā sakilesā, yesañca adhimattā attānudiṭṭhi, ye ca sukhadukkhesu unnatāvanatā, te upādāya bhagavatā bhaṇitaṃ ‘sabbe tasanti daṇḍassa, sabbe bhāyanti maccuno’ti. Tasmā arahā na tasati sabbabhayehī’’ti. ‘‘Netaṃ, bhante nāgasena, vacanaṃ sāvasesaṃ, niravasesavacanametaṃ ‘sabbe’ti. Tattha me uttariṃ kāraṇaṃ brūhi taṃ vacanaṃ patiṭṭhāpetu’’nti. ‘‘Idha, mahārāja, gāme gāmassāmiko āṇāpakaṃ āṇāpeyya ‘ehi, bho āṇāpaka, yāvatā gāme gāmikā, te sabbe sīghaṃ mama santike sannipātehī’ti. So ‘sādhu sāmī’ti sampaṭicchitvā gāmamajjhe ṭhatvā tikkhattuṃ saddamanussāveyya ‘yāvatā gāme gāmikā, te sabbe sīghasīghaṃ sāmino santike sannipatantū’ti. Tato te gāmikā āṇāpakassa vacanena turitaturitā sannipatitvā gāmassāmikassa ārocenti ‘sannipatitā, sāmi, sabbe gāmikā, yaṃ te karaṇīyaṃ taṃ karohī’ti. Iti so, mahārāja, gāmassāmiko kuṭipurise sannipātento sabbe gāmike āṇāpeti, te ca āṇattā na sabbe sannipatanti, kuṭipurisā yeva sannipatanti, ‘ettakā yeva me gāmikā’ti gāmassāmiko ca tathā sampaṭicchati, aññe bahutarā anāgatā itthipurisā dāsidāsā bhatakā kammakarā gāmikā gilānā gomahiṃsā ajeḷakā suvānā, ye anāgatā, sabbe te agaṇitā, kuṭipurise yeva upādāya āṇāpitattā ‘sabbe sannipatantū’ti. Evameva kho, mahārāja, netaṃ vacanaṃ bhagavatā arahante upādāya bhaṇitaṃ, ṭhapito arahā tasmiṃ vatthusmiṃ, samūhato bhayahetu arahato, ye te, mahārāja, sattā sakilesā, yesañca adhimattā attānudiṭṭhi, ye ca sukhadukkhesu unnatāvanatā, te upādāya bhagavatā bhaṇitaṃ ‘sabbe tasanti daṇḍassa, sabbe bhāyanti maccuno’ti. Tasmā arahā na tasati sabbabhayehi. ‘‘Atthi, mahārāja, sāvasesaṃ vacanaṃ sāvaseso attho, atthi sāvasesaṃ vacanaṃ niravaseso attho, atthi niravasesaṃ vacanaṃ sāvaseso attho, atthi niravasesaṃ vacanaṃ niravaseso attho. Tena tena attho sampaṭicchitabbo. ‘‘Pañcavidhehi, mahārāja, kāraṇehi attho sampaṭicchitabbo āhaccapadena rasena ācariyavaṃsena [ācariyavaṃsatāya (pī. ka.)] adhippāyā kāraṇuttariyatāya. Ettha hi āhaccapadanti suttaṃ adhippetaṃ. Rasoti suttānulomaṃ. Ācariyavaṃsoti ācariyavādo. Adhippāyoti attano mati. Kāraṇuttariyatāti imehi catūhi samentaṃ [sametaṃ (sī.)] kāraṇaṃ. Imehi kho, mahārāja, pañcahi kāraṇehi attho sampaṭicchitabbo. Evameso pañho suvinicchito hotī’’ti. ‘‘Hotu, bhante nāgasena, tathā taṃ sampaṭicchāmi. Ṭhapito hotu arahā tasmiṃ vatthusmiṃ, tasantu avasesā sattā, niraye pana nerayikā sattā dukkhā tibbā kaṭukā vedanā vedayamānā jalitapajjalitasabbaṅgapaccaṅgā ruṇṇakāruññakanditaparidevitalālappitamukhā asayhatibbadukkhābhibhūtā atāṇā asaraṇā asaraṇībhūtā anappasokāturā antimapacchimagatikā ekantasokaparāyaṇā uṇhatikhiṇacaṇḍakharatapanatejavanto bhīmabhayajanakaninādamahāsaddā saṃsibbitachabbidhajālāmālākulā samantā satayojanānupharaṇaccivegā kadariyā tapanā mahānirayā cavamānā maccuno bhāyantī’’ti? ‘‘Āma, mahārājā’’ti. ‘‘Nanu, bhante nāgasena, nirayo ekantadukkhavedanīyo, kissa pana te nerayikā sattā ekantadukkhavedanīyā nirayā cavamānā maccuno bhāyanti, kissa niraye ramantī’’ti? ‘‘Na te, mahārāja, nerayikā sattā niraye ramanti, muñcitukāmāva te nirayā. Maraṇasseva so [maraṇasseso (sī. pī.)], mahārāja, ānubhāvo, yena tesaṃ santāso uppajjatī’’ti. ‘‘Etaṃ kho, bhante nāgasena, na saddahāmi, yaṃ muccitukāmānaṃ cutiyā santāso uppajjatīti, hāsanīyaṃ, bhante nāgasena, taṃ ṭhānaṃ, yaṃ te patthitaṃ labhanti, kāraṇena maṃ saññāpehī’’ti. ‘‘Maraṇanti kho, mahārāja, etaṃ adiṭṭhasaccānaṃ tāsanīyaṭṭhānaṃ, etthāyaṃ jano tasati ca ubbijjati ca. Yo ca, mahārāja, kaṇhasappassa bhāyati, so maraṇassa bhāyanto kaṇhasappassa bhāyati. Yo ca hatthissa bhāyati…pe… sīhassa…pe… byagghassa…pe… dīpissa…pe… acchassa…pe… taracchassa…pe… mahiṃsassa…pe… gavayassa…pe… aggissa…pe… udakassa…pe… khāṇukassa…pe… kaṇṭakassa bhāyati. Yo ca sattiyā bhāyati, so maraṇassa bhāyanto sattiyā bhāyati. Maraṇasseva so [maraṇasseso (sī. pī.)], mahārāja, sarasasabhāvatejo [sarasabhāvatejo (sī. pī.)], tassa sarasasabhāvatejena sakilesā sattā maraṇassa tasanti bhāyanti, muccitukāmāpi, mahārāja, nerayikā sattā maraṇassa tasanti bhāyanti. ‘‘Idha, mahārāja, purisassa kāye medo gaṇṭhi uppajjeyya. So tena rogena dukkhito upaddavā parimuccitukāmo bhisakkaṃ sallakattaṃ āmantāpeyya. Tassa vacanaṃ so bhisakko sallakatto sampaṭicchitvā tassa rogassa uddharaṇāya upakaraṇaṃ upaṭṭhāpeyya, satthakaṃ tikhiṇaṃ kareyya, yamakasalākā [dahanasalākaṃ (ka.)] aggimhi pakkhipeyya, khāralavaṇaṃ nisadāya pisāpeyya, api nu kho, mahārāja, tassa āturassa tikhiṇasatthakacchedanena yamakasalākādahanena khāraloṇappavesanena tāso uppajjeyyā’’ti? ‘‘Āma bhante’’ti. ‘‘Iti, mahārāja, tassa āturassa rogā muccitukāmassāpi vedanābhayā santāso uppajjati. Evameva kho, mahārāja, nirayā muccitukāmānampi nerayikānaṃ sattānaṃ maraṇabhayā santāso uppajjati. ‘‘Idha, mahārāja, puriso issarāparādhiko baddho saṅkhalikabandhanena gabbhe pakkhitto parimuccitukāmo assa, tamenaṃ so issaro mocetukāmo pakkosāpeyya. Api nu kho, mahārāja, tassa issarāparādhikassa purisassa ‘katadoso aha’nti jānantassa issaradassanena santāso uppajjeyyā’’ti? ‘‘Āma bhante’’ti. ‘‘Iti, mahārāja, tassa issarāparādhikassa purisassa parimuccitukāmāssāpi issarabhayā santāso uppajjati. Evameva kho, mahārāja, nirayā muccitukāmānampi nerayikānaṃ sattānaṃ maraṇabhayā santāso uppajjatī’’ti. ‘‘Aparampi, bhante, uttariṃ kāraṇaṃ brūhi, yenāhaṃ kāraṇena okappeyya’’nti. ‘‘Idha, mahārāja, puriso daṭṭhavisena āsīvisena daṭṭho bhaveyya, so tena visavikārena pateyya uppateyya vaṭṭeyya pavaṭṭeyya, athaññataro puriso balavantena mantapadena taṃ daṭṭhavisaṃ āsīvisaṃ ānetvā taṃ daṭṭhavisaṃ paccācamāpeyya, api nu kho, mahārāja, tassa visagatassa purisassa tasmiṃ daṭṭhavise sappe sotthihetu upagacchante santāso uppajjeyyā’’ti? ‘‘Āma bhante’’ti. Iti, mahārāja, tathārūpe ahimhi sotthihetupi upagacchante tassa santāso uppajjati. Evameva kho, mahārāja, nirayā muccitukāmānampi nerayikānaṃ santānaṃ maraṇabhayā santāso uppajjati. Aniṭṭhaṃ, mahārāja, sabbasattānaṃ maraṇaṃ, tasmā nerayikā sattā nirayā parimuccitukāmāpi maccuno bhāyantī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Maccubhāyanābhāyanapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Maccupāsamuttipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā – ‘‘‘Na antalikkhe na samuddamajjhe, na pabbatānaṃ vivaraṃ pavissa; Na vijjatī so jagatippadeso, yatthaṭṭhito mucceyya maccupāsā’ti. ‘‘Puna bhagavatā parittā ca uddiṭṭhā. Seyyathidaṃ, ratanasuttaṃ mettasuttaṃ khandhaparittaṃ moraparittaṃ dhajaggaparittaṃ āṭānāṭiyaparittaṃ aṅgulimālaparittaṃ. Yadi, bhante nāgasena, ākāsagatopi samuddamajjhagatopi pāsādakuṭileṇaguhāpabbhāradaribilagiri vivarapabbatantaragatopi na muccati maccupāsā, tena hi parittakammaṃ micchā. Yadi parittakaraṇena maccupāsā parimutti bhavati, tena hi ‘na antalikkhe…pe… maccupāsā’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho gaṇṭhitopi gaṇṭhitaro tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘na antalikkhe…pe… maccupāsā’ti, parittā ca bhagavatā uddiṭṭhā, tañca pana sāvasesāyukassa vayasampannassa apetakammāvaraṇassa, natthi, mahārāja, khīṇāyukassa ṭhitiyā kiriyā vā upakkamo vā. ‘‘Yathā mahārāja matassa rukkhassa sukkhassa koḷāpassa nisnehassa uparuddhajīvitassa gatāyusaṅkhārassa kumbhasahassenapi udake ākirante allattaṃ vā pallavitaharitabhāvo vā na bhaveyya. Evameva kho, mahārāja, bhesajjaparittakammena natthi khīṇāyukassa ṭhitiyā kiriyā vā upakkamo vā, yāni tāni, mahārāja, mahiyā osadhāni bhesajjāni, tānipi khīṇāyukassa akiccakarāni bhavanti. Sāvasesāyukaṃ, mahārāja, vayasampannaṃ apetakammāvaraṇaṃ parittaṃ rakkhati gopeti, tassatthāya bhagavatā parittā uddiṭṭhā. ‘‘Yathā, mahārāja, kassako paripakke dhaññe mate sassanāḷe udakappavesanaṃ vāreyya, yaṃ pana sassaṃ taruṇaṃ meghasannibhaṃ vayasampannaṃ, taṃ udakavaḍḍhiyā vaḍḍhati. Evameva kho, mahārāja, khīṇāyukassa bhesajjaparittakiriyā ṭhapitā paṭikkhittā, ye pana te manussā sāvasesāyukā vayasampannā, tesaṃ atthāya parittabhesajjāni bhaṇitāni, te parittabhesajjehi vaḍḍhantī’’ti. ‘‘Yadi, bhante nāgasena, khīṇāyuko marati, sāvasesāyuko jīvati, tena hi parittabhesajjāni niratthakāni hontī’’ti? ‘‘Diṭṭhapubbo pana tayā, mahārāja, koci rogo bhesajjehi paṭinivattito’’ti? ‘‘Āma, bhante, anekasatāni diṭṭhānī’’ti. ‘‘Tena hi, mahārāja, ‘parittabhesajjakiriyā niratthakā’ti yaṃ vacanaṃ, taṃ micchā bhavatī’’ti. ‘‘Dissanti, bhante nāgasena, vejjānaṃ upakkamā bhesajjapānānulepā, tena tesaṃ upakkamena rogo paṭinivattatī’’ti. ‘‘Parittānampi, mahārāja, pavattīyamānānaṃ saddo suyyati, jivhā sukkhati, hadayaṃ byāvaṭṭati, kaṇṭho āturati. Tena tesaṃ pavattena sabbe byādhayo vūpasamanti, sabbā ītiyo apagacchantīti. ‘‘Diṭṭhapubbo pana tayā, mahārāja, koci ahinā daṭṭho mantapadena visaṃ pātīyamāno visaṃ cikkhassanto uddhamadho ācamayamāno’’ti? ‘‘Āma, bhante, ajjetarahipi taṃ loke vattatī’’ti. ‘‘Tena hi, mahārāja, ‘parittabhesajjakiriyā niratthakā’ti yaṃ vacanaṃ, taṃ micchā bhavati. Kataparittañhi, mahārāja, purisaṃ ḍaṃsitukāmo ahi na ḍaṃsati, vivaṭaṃ mukhaṃ pidahati, corānaṃ ukkhittalaguḷampi na sambhavati, te laguḷaṃ muñcitvā pemaṃ karonti, kupitopi hatthināgo samāgantvā uparamati, pajjalitamahāaggikkhandhopi upagantvā nibbāyati, visaṃ halāhalampi khāyitaṃ agadaṃ sampajjati, āhāratthaṃ vā pharati, vadhakā hantukāmā upagantvā dāsabhūtā sampajjanti, akkantopi pāso na saṃvarati [na saṃcarati (sī.)]. ‘‘Sutapubbaṃ pana tayā, mahārāja, ‘morassa kataparittassa sattavassasatāni luddako nāsakkhi pāsaṃ upanetuṃ, akataparittassa taṃ yeva divasaṃ pāsaṃ upanesī’’ti? ‘‘Āma, bhante, suyyati, abbhuggato so saddo sadevake loke’’ti. ‘‘Tena hi, mahārāja ‘parittabhesajjakiriyā niratthakā’ti yaṃ vacanaṃ, taṃ micchā bhavati. ‘‘Sutapubbaṃ pana tayā, mahārāja, ‘dānavo bhariyaṃ parirakkhanto samugge pakkhipitvā gilitvā kucchinā pariharati, atheko vijjādharo tassa dānavassa mukhena pavisitvā tāya saddhiṃ abhiramati, yadā so dānavo aññāsi, atha samuggaṃ vamitvā vivari, saha samugge vivaṭe vijjādharo yathākāmaṃ [yena kāmaṃ (ka.)] pakkāmī’’ti? ‘‘Āma, bhante, suyyati, abbhuggato sopi saddo sadevake loke’’ti. ‘‘Nanu so, mahārāja, vijjādharo parittabalena [mantabalena (?)] gahaṇā mutto’’ti. ‘‘Āma bhante’’ti. ‘‘Tena hi, mahārāja, atthi parittabalaṃ. ‘‘Sutapubbaṃ pana tayā, mahārāja, ‘aparopi vijjādharo bārāṇasirañño antepure mahesiyā saddhiṃ sampaduṭṭho [saṃsaṭṭho (sī.)] gahaṇappatto samāno khaṇena adassanaṃ gato mantabalenā’’ti. ‘‘Āma, bhante, suyyatī’’ti. ‘‘Nanu so, mahārāja, vijjādharo parittabalena gahaṇā mutto’’ti? ‘‘Āma bhante’’ti. ‘‘Tena hi, mahārāja, atthi parittabala’’nti. ‘‘Bhante nāgasena, ‘kiṃ sabbe yeva parittaṃ rakkhatī’ti? ‘‘Ekacce, mahārāja, rakkhati, ekacce na rakkhatī’’ti. ‘‘Tena hi, bhante nāgasena, parittaṃ na sabbatthika’’nti? ‘‘Api nu kho, mahārāja, bhojanaṃ sabbesaṃ jīvitaṃ rakkhatī’’ti? ‘‘Ekacce, bhante, rakkhati, ekacce na rakkhatī’’ti. ‘‘Kiṃ kāraṇā’’ti. ‘‘Yato, bhante, ekacce taṃ yeva bhojanaṃ atibhuñjitvā visūcikāya marantī’’ti. ‘‘Tena hi, mahārāja, bhojanaṃ na sabbesaṃ jīvitaṃ rakkhatī’’ti? ‘‘Dvīhi, bhante nāgasena, kāraṇehi bhojanaṃ jīvitaṃ harati atibhuttena vā usmādubbalatāya vā, āyudadaṃ, bhante nāgasena, bhojanaṃ durupacārena jīvitaṃ haratī’’ti. ‘‘Evameva kho, mahārāja, parittaṃ ekacce rakkhati, ekacce na rakkhati. ‘‘Tīhi, mahārāja, kāraṇehi parittaṃ na rakkhati kammāvaraṇena, kilesāvaraṇena, asaddahanatāya. Sattānurakkhaṇaṃ, mahārāja, parittaṃ attanā katena ārakkhaṃ jahati, yathā, mahārāja, mātā puttaṃ kucchigataṃ poseti, hitena upacārena janeti, janayitvā asucimalasiṅghāṇikamapanetvā uttamavarasugandhaṃ upalimpati, so aparena samayena paresaṃ putte akkosante vā paharante vā pahāraṃ deti. Te tassa kujjhitvā parisāya ākaḍḍhitvā taṃ gahetvā sāmino upanenti, yadi pana tassā putto aparaddho hoti velātivatto. Atha naṃ sāmino manussā ākaḍḍhayamānā daṇḍamuggarajāṇumuṭṭhīhi tāḷenti pothenti, api nu kho, mahārāja, tassa mātā labhati ākaḍḍhanaparikaḍḍhanaṃ gāhaṃ sāmino upanayanaṃ kātu’’nti? ‘‘Na hi bhante’’ti. ‘‘Kena kāraṇena, mahārājā’’ti. ‘‘Attano, bhante, aparādhenā’’ti. ‘‘Evameva kho, mahārāja, sattānaṃ ārakkhaṃ parittaṃ attano aparādhena vañjhaṃ karotī’’ti [kāretīti (sī.)]. ‘‘Sādhu, bhante nāgasena, suvinicchito pañho, gahanaṃ agahanaṃ kataṃ, andhakāro āloko kato, viniveṭhitaṃ diṭṭhijālaṃ, tvaṃ gaṇivarapavaramāsajjā’’ti. Maccupāsamuttipañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Buddhalābhantarāyapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, tumhe bhaṇatha ‘lābhī tathāgato cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārāna’nti. Puna ca tathāgato pañcasālaṃ brāhmaṇagāmaṃ piṇḍāya pavisitvā kiñcideva alabhitvā yathādhotena pattena nikkhantoti. Yadi, bhante nāgasena, tathāgato lābhī cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ, tena hi pañcasālaṃ brāhmaṇagāmaṃ piṇḍāya pavisitvā kiñcideva alabhitvā yathādhotena pattena nikkhantoti yaṃ vacanaṃ, taṃ micchā. Yadi pañcasālaṃ brāhmaṇagāmaṃ piṇḍāya pavisitvā kiñcideva alabhitvā yathādhotena pattena nikkhanto, tena hi lābhī tathāgato cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānanti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho sumahanto dunnibbeṭho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Lābhī, mahārāja, tathāgato cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ, pañcasālañca brāhmaṇagāmaṃ piṇḍāya pavisitvā kiñcideva alabhitvā yathādhotena pattena nikkhanto, tañca pana mārassa pāpimato kāraṇā’’ti. ‘‘Tena hi, bhante nāgasena, bhagavato gaṇanapathaṃ vītivattakappe [gaṇanapathavītivatte kappe (sī.)] abhisaṅkhataṃ kusalaṃ kinti niṭṭhitaṃ, adhunuṭṭhitena mārena pāpimatā tassa kusalassa balavegaṃ [taṃ kusalabalavegavipphāraṃ (sī.)] kinti pihitaṃ, tena hi, bhante nāgasena, tasmiṃ vatthusmiṃ dvīsu ṭhānesu upavādo āgacchati, kusalatopi akusalaṃ balavataraṃ hoti, buddhabalatopi mārabalaṃ balavataraṃ hotīti, tena hi rukkhassa mūlatopi aggaṃ bhārataraṃ hoti, guṇasamparikiṇṇatopi pāpiyaṃ balavataraṃ hotī’’ti. ‘‘Na, mahārāja, tāvatakena kusalatopi akusalaṃ balavataraṃ nāma hoti, na buddhabalatopi mārabalaṃ balavataraṃ nāma hoti. Api cettha kāraṇaṃ icchitabbaṃ. ‘‘Yathā, mahārāja, puriso rañño cakkavattissa madhuṃ vā madhupiṇḍikaṃ vā aññaṃ vā upāyanaṃ abhihareyya, tamenaṃ rañño dvārapālo evaṃ vadeyya ‘akālo, bho, ayaṃ rañño dassanāya, tena hi, bho, tava upāyanaṃ gahetvā sīghasīghaṃ paṭinivatta, pure tava rājā daṇḍaṃ dhāressatī’ti [mā te rājā daṇḍaṃ pāpeyyāti (sī.)]. Tato so puriso daṇḍabhayā tasito ubbiggo taṃ upāyanaṃ ādāya sīghasīghaṃ paṭinivatteyya, api nu kho so, mahārāja, rājā cakkavattī tāvatakena upāyanavikalamattakena dvārapālato dubbalataro nāma hoti, aññaṃ vā pana kiñci upāyanaṃ na labheyyā’’ti? ‘‘Na hi, bhante, issāpakato so, bhante, dvārapālo upāyanaṃ nivāresi, aññena pana dvārena satasahassaguṇampi rañño upāyanaṃ upetī’’ti. ‘‘Evameva kho, mahārāja, issāpakato māro pāpimā pañcasālake brāhmaṇagahapatike anvāvisi, aññāni pana anekāni devatāsatasahassāni amataṃ dibbaṃ ojaṃ gahetvā upagatāni ‘bhagavato kāye ojaṃ odahissāmā’ti bhagavantaṃ namassamānāni pañjalikāni ṭhitānī’’ti. ‘‘Hotu, bhante nāgasena, sulabhā bhagavato cattāro paccayā loke uttamapurisassa, yācitova bhagavā devamanussohi cattāro paccaye paribhuñjati, api ca kho pana mārassa yo adhippāyo, so tāvatakena siddho, yaṃ so bhagavato bhojanassa antarāyamakāsi. Ettha me, bhante, kaṅkhā na chijjati, vimatijātohaṃ tattha saṃsayapakkhando. Na me tattha mānasaṃ pakkhandati, yaṃ tathāgatassa arahato sammāsambuddhassa sadevake loke aggapuggalavarassa kusalavarapuññasambhavassa asamasamassa anupamassa appaṭisamassa chavakaṃ lāmakaṃ parittaṃ pāpaṃ anariyaṃ vipannaṃ māro lābhantarāyamakāsī’’ti. ‘‘Cattāro kho, mahārāja, antarāyā adiṭṭhantarāyo uddissa katantarāyo upakkhaṭantarāyo paribhogantarāyoti. Tattha katamo adiṭṭhantarāyo? Anodissa adassanena anabhisaṅkhataṃ koci antarāyaṃ karoti ‘kiṃ parassa dinnenā’ti, ayaṃ adiṭṭhantarāyo nāma. ‘‘Katamo uddissa katantarāyo? Idhekaccaṃ puggalaṃ upadisitvā uddissa bhojanaṃ paṭiyattaṃ hoti, taṃ koci antarāyaṃ karoti, ayaṃ uddissa katantarāyo nāma. ‘‘Katamo upakkhaṭantarāyo? Idha yaṃ kiñci upakkhaṭaṃ hoti appaṭiggahitaṃ, tattha koci antarāyaṃ karoti, ayaṃ upakkhaṭantarāyo nāma. ‘‘Katamo paribhogantarāyo? Idha yaṃ kiñci paribhogaṃ, tattha koci antarāyaṃ karoti, ayaṃ paribhogantarāyo nāma. Ime kho, mahārāja, cattāro antarāyā. ‘‘Yaṃ pana māro pāpimā pañcasālake brāhmaṇagahapatike anvāvisi, taṃ neva bhagavato paribhogaṃ na upakkhaṭaṃ na uddissakataṃ, anāgataṃ asampattaṃ adassanena antarāyaṃ kataṃ, taṃ pana nekassa bhagavato yeva, atha kho ye te tena samayena nikkhantā abbhāgatā, sabbepi te taṃ divasaṃ bhojanaṃ na labhiṃsu, nāhaṃ taṃ, mahārāja, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya, yo tassa bhagavato uddissa kataṃ upakkhaṭaṃ paribhogaṃ antarāyaṃ kareyya. Sace koci issāya uddissa kataṃ upakkhaṭaṃ paribhogaṃ antarāyaṃ kareyya, phaleyya tassa muddhā satadhā vā sahassadhā vā. ‘‘Cattārome, mahārāja, tathāgatassa kenaci anāvaraṇīyā guṇā. Katame cattāro? Lābho, mahārāja, bhagavato uddissa kato upakkhaṭo na sakkā kenaci antarāyaṃ kātuṃ; sarīrānugatā, mahārāja, bhagavato byāmappabhā na sakkā kenaci antarāyaṃ kātuṃ; sabbaññutaṃ, mahārāja, bhagavato ñāṇaratanaṃ na sakkā kenaci antarāyaṃ kātuṃ; jīvitaṃ, mahārāja, bhagavato na sakkā kenaci antarāyaṃ kātuṃ. Ime kho, mahārāja, cattāro tathāgatassa kenaci anāvaraṇīyā guṇā, sabbepete, mahārāja, guṇā ekarasā arogā akuppā aparūpakkamā aphusāni kiriyāni. Adassanena, mahārāja, māro pāpimā nilīyitvā pañcasālake brāhmaṇagahapatike anvāvisi. ‘‘Yathā, mahārāja, rañño paccante dese visame adassanena nilīyitvā corā panthaṃ dūsenti. Yadi pana rājā te core passeyya, api nu kho te corā sotthiṃ labheyyu’’nti? ‘‘Na hi, bhante, pharasunā phālāpeyya satadhā vā sahassadhā vā’’ti. ‘‘Evameva kho, mahārāja, adassanena māro pāpimā nilīyitvā pañcasālake brāhmaṇagahapatike anvāvisi. ‘‘Yathā vā pana, mahārāja, itthī sapatikā adassanena nilīyitvā parapurisaṃ sevati, evameva kho, mahārāja, adassanena māro pāpimā nilīyitvā pañcasālake brāhmaṇagahapatike anvāvisi. Yadi, mahārāja, itthī sāmikassa sammukhā parapurisaṃ sevati, api nu kho sā itthī sotthiṃ labheyyā’’ti? ‘‘Na hi, bhante, haneyyāpi taṃ, bhante, sāmiko vadheyyāpi bandheyyāpi dāsittaṃ vā upaneyyā’’ti. ‘‘Evameva kho, mahārāja, adassanena māro pāpimā nilīyitvā pañcasālake brāhmaṇagahapatike anvāvisi. Yadi, mahārāja, māro pāpimā bhagavato uddissa kataṃ upakkhaṭaṃ paribhogaṃ antarāyaṃ kareyya, phaleyya tassa muddhā satadhā vā sahassadhā vā’’ti. ‘‘Evametaṃ, bhante nāgasena, corikāya kataṃ mārena pāpimatā, nilīyitvā māro pāpimā pañcasālake brāhmaṇagahapatike anvāvisi. Sace so, bhante, māro pāpimā bhagavato uddissa kataṃ upakkhaṭaṃ paribhogaṃ antarāyaṃ kareyya, muddhā vāssa phaleyya satadhā vā sahassadhā vā, kāyo vāssa bhusamuṭṭhi viya vikireyya, sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Buddhalābhantarāyapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Apuññapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, tumhe bhaṇatha ‘yo ajānanto pāṇātipātaṃ karoti, so balavataraṃ apuññaṃ pasavatī’ti. Puna ca bhagavatā vinayapaññattiyā bhaṇitaṃ ‘anāpatti ajānantassā’ti. Yadi, bhante nāgasena, ajānitvā pāṇātipātaṃ karonto balavataraṃ apuññaṃ pasavati, tena hi ‘anāpatti ajānantassā’ti yaṃ vacanaṃ, taṃ micchā. Yadi anāpatti ajānantassa, tena hi ‘ajānitvā pāṇātipātaṃ karonto balavataraṃ apuññaṃ pasavatī’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho duruttaro duratikkamo tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘yo ajānanto pāṇātipātaṃ karoti, so balavataraṃ apuññaṃ pasavatī’ti. Puna ca vinayapaññattiyā bhagavatā bhaṇitaṃ ‘anāpatti ajānantassā’ti. Tattha atthantaraṃ atthi. Katamaṃ atthantaraṃ? Atthi, mahārāja, āpatti saññāvimokkhā, atthi āpatti nosaññāvimokkhā. Yāyaṃ, mahārāja, āpatti saññāvimokkhā, taṃ āpattiṃ ārabbha bhagavatā bhaṇitaṃ ‘anāpatti ajānantassā’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Apuññapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Bhikkhusaṅghapariharaṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘tathāgatassa kho, ānanda, na evaṃ hoti ‘‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’’’ti vā, ‘‘mamuddesiko bhikkhusaṅgho’’ti vā’ti. Puna ca metteyyassa bhagavato sabhāvaguṇaṃ paridīpayamānena bhagavatā evaṃ bhaṇitaṃ ‘‘so anekasahassaṃ bhikkhusaṅghaṃ pariharissati, seyyathāpi ahaṃ etarahi anekasataṃ bhikkhusaṅghaṃ pariharāmī’’ti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘tathāgatassa kho, ānanda, na evaṃ hoti ‘‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’’ti vā, ‘‘mamuddesiko bhikkhusaṅgho’’ti vā’ti, tena hi anekasataṃ bhikkhusaṅghaṃ pariharāmīti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatena bhaṇitaṃ ‘so anekasahassaṃ bhikkhusaṅghaṃ pariharissati, seyyathāpi ahaṃ etarahi anekasataṃ bhikkhusaṅghaṃ pariharāmī’ti, tena hi tathāgatassa kho, ānanda, na evaṃ hoti ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti vā, ‘mamuddesiko bhikkhusaṅgho’ti vāti tampi vacanaṃ micchā, ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘tathāgatassa kho, ānanda, na evaṃ hoti ‘‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’’ti vā, ‘‘mamuddesiko bhikkhusaṅgho’’ti vā’ti. Puna ca metteyyassāpi bhagavato sabhāvaguṇaṃ paridīpayamānena bhagavatā bhaṇitaṃ ‘so anekasahassaṃ bhikkhusaṅghaṃ pariharissati, seyyathāpi ahaṃ etarahi anekasataṃ bhikkhusaṅghaṃ pariharāmī’ti. Etasmiñca, mahārāja, pañhe eko attho sāvaseso, eko attho niravaseso. Na, mahārāja, tathāgato parisāya anugāmiko, parisā pana tathāgatassa anugāmikā. Sammuti, mahārāja, esā ‘aha’nti ‘mamā’ti, na paramattho eso, vigataṃ, mahārāja, tathāgatassa pemaṃ, vigato sineho, ‘mayha’ntipi tathāgatassa gahaṇaṃ natthi, upādāya pana avassayo hoti. ‘‘Yathā, mahārāja, pathavī bhūmaṭṭhānaṃ sattānaṃ patiṭṭhā hoti upassayaṃ, pathaviṭṭhā cete sattā, na ca mahāpathaviyā ‘mayhete’ti apekkhā hoti, evameva kho, mahārāja, tathāgato sabbasattānaṃ patiṭṭhā hoti upassayaṃ, tathāgataṭṭhā [tathāgatapatiṭṭhā eva (sī.)] cete sattā, na ca tathāgatassa ‘mayhete’ti apekkhā hoti. Yathā vā pana, mahārāja, mahatimahāmegho abhivassanto tiṇarukkhapasumanussānaṃ vuḍḍhiṃ deti santatiṃ anupāleti. Vuṭṭhūpajīvino cete sattā sabbe, na ca mahāmeghassa ‘mayhete’ti apekkhā hoti. Evameva kho, mahārāja, tathāgato sabbasattānaṃ kusaladhamme janeti anupāleti, satthūpajīvino cete sattā sabbe, na ca tathāgatassa ‘mayhete’ti apekkhā hoti. Taṃ kissa hetu? Attānudiṭṭhiyā pahīnattā’’ti. ‘‘Sādhu, bhante nāgasena, sunibbeṭhito pañho bahuvidhehi kāraṇehi, gambhīro uttānīkato, gaṇṭhi bhinno, gahanaṃ agahanaṃ kataṃ, andhakāro āloko kato, bhaggā paravādā, jinaputtānaṃ cakkhuṃ uppādita’’nti. Bhikkhusaṅghapariharaṇapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Abhejjaparisapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, tumhe bhaṇatha ‘tathāgato abhejjapariso’ti, puna ca bhaṇatha ‘devadattena ekappahāraṃ pañca bhikkhusatāni bhinnānī’ti. Yadi, bhante nāgasena, tathāgato abhejjapariso, tena hi devadattena ekappahāraṃ pañca bhikkhusatāni bhinnānīti yaṃ vacanaṃ, taṃ micchā. Yadi devadattena ekappahāraṃ pañca bhikkhusatāni bhinnāni, tena hi ‘tathāgato abhejjapariso’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, gambhīro dunniveṭhiyo, gaṇṭhitopi gaṇṭhitaro, etthāyaṃ jano āvaṭo nivuto ovuto pihito pariyonaddho, ettha tava ñāṇabalaṃ dassehi paravādesū’’ti. ‘‘Abhejjapariso, mahārāja, tathāgato, devadattena ca ekappahāraṃ pañca bhikkhusatāni bhinnāni, tañca pana bhedakassa balena, bhedake vijjamāne natthi, mahārāja, abhejjaṃ nāma. Bhedake sati mātāpi puttena bhijjati, puttopi mātarā bhijjati, pitāpi puttena bhijjati, puttopi pitarā bhijjati, bhātāpi bhaginiyā bhijjati, bhaginīpi bhātarā bhijjati, sahāyopi sahāyena bhijjati, nāvāpi nānādārusaṅghaṭitā ūmivegasampahārena bhijjati, rukkhopi madhukappasampannaphalo anilabalavegābhihato bhijjati, suvaṇṇampi jātimantaṃ [jātarūpampi (sī.)] lohena bhijjati. Api ca, mahārāja, neso adhippāyo viññūnaṃ, nesā buddhānaṃ adhimutti, neso paṇḍitānaṃ chando ‘tathāgato bhejjapariso’ti. Api cettha kāraṇaṃ atthi, yena kāraṇena tathāgato vuccati ‘abhejjapariso’ti. Katamaṃ ettha kāraṇaṃ? Tathāgatassa, mahārāja, katena adānena vā appiyavacanena vā anatthacariyāya vā asamānattatāya vā yato kutoci cariyaṃ carantassapi parisā bhinnāti na sutapubbaṃ, tena kāraṇena tathāgato vuccati ‘abhejjapariso’ti. Tayāpetaṃ, mahārāja, ñātabbaṃ ‘atthi kiñci navaṅge buddhavacane suttāgataṃ, iminā nāma kāraṇena bodhisattassa katena tathāgatassa parisā bhinnā’ti? ‘‘Natthi bhante, no cetaṃ loke dissati nopi suyyati. Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Abhejjaparisapañho aṭṭhamo. Abhejjavaggo dutiyo. Imasmiṃ vagge aṭṭha pañhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}