{
  "id": "mil.18",
  "title": {
    "pali": "Samuddavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Lābulataṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, ‘lābulatāya ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, lābulatā tiṇe vā kaṭṭhe vā latāya vā soṇḍikāhi ālambitvā tassūpari vaḍḍhati, evameva kho, mahārāja, yoginā yogāvacarena arahatte abhivaḍḍhitukāmena manasā ārammaṇaṃ ālambitvā arahatte abhivaḍḍhitabbaṃ. Idaṃ, mahārāja, lābulatāya ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Yathā lābulatā nāma, tiṇe kaṭṭhe latāya vā; Ālambitvā soṇḍikāhi, tato vaḍḍhati uppari. ‘‘‘Tatheva buddhaputtena, arahattaphalakāminā; Ārammaṇaṃ ālambitvā, vaḍḍhitabbaṃ asekkhaphale’’’ti. Lābulataṅgapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Padumaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, ‘padumassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, padumaṃ udake jātaṃ udake saṃvaddhaṃ anupalittaṃ udakena, evameva kho, mahārāja, yoginā yogāvacarena kule gaṇe lābhe yase sakkāre sammānanāya paribhogapaccayesu ca sabbattha anupalittena bhavitabbaṃ. Idaṃ, mahārāja, padumassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, padumaṃ udakā accuggamma ṭhāti. Evameva kho, mahārāja, yoginā yogāvacarena sabbalokaṃ abhibhavitvā accuggamma lokuttaradhamme ṭhātabbaṃ. Idaṃ, mahārāja, padumassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, padumaṃ appamattakenapi anilena eritaṃ calati. Evameva kho, mahārāja, yoginā yogāvacarena appamattakesupi kilesesu saṃyamo karaṇīyo, bhayadassāvinā viharitabbaṃ. Idaṃ, mahārāja, padumassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena ‘aṇumattesu vajjesu bhayadassāvī samādāya sikkhati sikkhāpadesū’ti. Padumaṅgapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Bījaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, ‘bījassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, bījaṃ appakampi samānaṃ bhaddake khette vuttaṃ deve sammā dhāraṃ pavecchante subahūni phalāni anudassati, evameva kho, mahārāja, yoginā yogāvacarena yathā paṭipāditaṃ sīlaṃ kevalaṃ sāmaññaphalamanudassati. Evaṃ sammā paṭipajjitabbaṃ. Idaṃ, mahārāja, bījassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, bījaṃ suparisodhite khette ropitaṃ khippameva saṃvirūhati, evameva kho, mahārāja, yoginā yogāvacarena mānasaṃ supariggahitaṃ suññāgāre parisodhitaṃ satipaṭṭhānakhettavare khittaṃ khippameva virūhati. Idaṃ, mahārāja, bījassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena anuruddhena – ‘‘‘Yathāpi khette [yathā khette (sī.)] parisuddhe, bījañcassa patiṭṭhitaṃ; Vipulaṃ tassa phalaṃ hoti, api toseti kassakaṃ. ‘‘‘Tatheva yogino cittaṃ, suññāgāre visodhitaṃ; Satipaṭṭhānakhettamhi, khippameva virūhatī’’’ti. Bījaṅgapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Sālakalyāṇikaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, ‘sālakalyāṇikāya ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, sālakalyāṇikā nāma antopathaviyaṃ yeva abhivaḍḍhati hatthasatampi bhiyyopi, evameva kho, mahārāja, yoginā yogāvacarena cattāri sāmaññaphalāni catasso paṭisambhidā chaḷabhiññāyo kevalañca samaṇadhammaṃ suññāgāre yeva paripūrayitabbaṃ. Idaṃ, mahārāja, sālakalyāṇikāya ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena rāhulena – ‘‘‘Sālakalyāṇikā nāma, pādapo dharaṇīruho; Antopathaviyaṃ yeva, satahatthopi vaḍḍhati. ‘‘‘Yathā kālamhi sampatte, paripākena so dumo; Uggañchitvāna ekāhaṃ, satahatthopi vaḍḍhati. ‘‘‘Evamevāhaṃ mahāvīra, sālakalyāṇikā viya; Abbhantare suññāgāre, dhammato abhivaḍḍhayi’’’nti. Sālakalyāṇikaṅgapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Nāvaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, ‘nāvāya tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, nāvā bahuvidhadārusaṅghāṭasamavāyena bahumpi janaṃ tārayati, evameva kho, mahārāja, yoginā yogāvacarena ācārasīlaguṇavattappaṭivattabahuvidhadhammasaṅghāṭasamavāyena sadevako loko tārayitabbo. Idaṃ, mahārāja, nāvāya paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, nāvā bahuvidhaūmitthanitavegavisaṭamāvaṭṭavegaṃ sahati, evameva kho, mahārāja, yoginā yogāvacarena bahuvidhakilesaūmivegaṃ lābhasakkārayasasilokapūjanavandanā parakulesu nindāpasaṃsāsukhadukkhasammānanavimānanabahuvidhadosaūmivegañca sahitabbaṃ. Idaṃ, mahārāja, nāvāya dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, nāvā aparimitamanantamapāramakkhobhitagambhīre mahatimahāghose timitimiṅgalamakaramacchagaṇākule mahatimahāsamudde carati, evameva kho, mahārāja, yoginā yogāvacarena tiparivaṭṭa dvādasākāra catusaccābhisamayappaṭivedhe mānasaṃ sañcārayitabbaṃ. Idaṃ, mahārāja, nāvāya tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavare saccasaṃyutte – ‘‘‘Vitakkentā ca kho tumhe, bhikkhave, ‘‘idaṃ dukkha’’nti vitakkeyyātha, ‘‘ayaṃ dukkhasamudayo’’ti vitakkeyyātha, ‘‘ayaṃ dukkhanirodho’’ti vitakkeyyātha, ‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti vitakkeyyāthā’’’ti. Nāvaṅgapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Nāvālagganakaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, ‘nāvālagganakassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, nāvālagganakaṃ bahuūmijālākulavikkhobhitasalilatale mahatimahāsamudde nāvaṃ laggeti ṭhapeti, na deti disāvidisaṃ harituṃ, evameva kho, mahārāja, yoginā yogāvacarena rāgadosamohūmijāle mahatimahāvitakkasampahāre cittaṃ laggetabbaṃ, na dātabbaṃ disāvidisaṃ harituṃ. Idaṃ, mahārāja, nāvālagganakassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, nāvālagganakaṃ na plavati [na pilavati (sī. pī.)] visīdati, hatthasatepi udake nāvaṃ laggeti ṭhānamupaneti, evameva kho, mahārāja, yoginā yogāvacarena lābhayasasakkāramānanavandanapūjanaapacitīsu lābhaggayasaggepi na plavitabbaṃ, sarīrayāpanamattake yeva cittaṃ ṭhapetabbaṃ. Idaṃ, mahārāja, nāvālagganakassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Yathā samudde lagganakaṃ, na plavati visīdati; Tatheva lābhasakkāre, mā plavatha visīdathā’’’ti. Nāvālagganakaṅgapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Kūpaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, ‘kūpassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, kūpo rajjuñca varattañca laṅkārañca dhāreti, evameva kho, mahārāja, yoginā yogāvacarena satisampajaññasamannāgatena bhavitabbaṃ, abhikkante paṭikkante ālokite vilokite samiñjite pasārite saṅghāṭipattacīvaradhāraṇe asite pīte khāyite sāyite uccārapassāvakamme gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārinā bhavitabbaṃ. Idaṃ, mahārāja, kūpassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena ‘sato, bhikkhave, bhikkhu vihareyya sampajāno, ayaṃ vo amhākaṃ anusāsanī’’’ti. Kūpaṅgapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Niyāmakaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, ‘niyāmakassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, niyāmako rattindivaṃ satataṃ samitaṃ appamatto yattappayatto nāvaṃ sāreti, evameva kho, mahārāja, yoginā yogāvacarena cittaṃ niyāmayamānena rattindivaṃ satataṃ samitaṃ appamattena yattappayattena yoniso manasikārena cittaṃ niyāmetabbaṃ. Idaṃ, mahārāja, niyāmakassa paṭhamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena dhammapade – ‘‘‘Appamādaratā hotha, sacittamanurakkhatha; Duggā uddharathattānaṃ, paṅke sannova [sattova (sī. pī.)] kuñjaro’ti. ‘‘Puna caparaṃ, mahārāja, niyāmakassa yaṃ kiñci mahāsamudde kalyāṇaṃ vā pāpakaṃ vā, sabbaṃ taṃ viditaṃ hoti, evameva kho, mahārāja, yoginā yogāvacarena kusalākusalaṃ sāvajjānavajjaṃ hīnappaṇītaṃ kaṇhasukkasappaṭibhāgaṃ vijānitabbaṃ. Idaṃ, mahārāja, niyāmakassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, niyāmako yante muddikaṃ deti ‘mā koci yantaṃ āmasitthā’ti, evameva kho, mahārāja, yoginā yogāvacarena citte saṃvaramuddikā dātabbā ‘mā kiñci pāpakaṃ akusalavitakkaṃ vitakkesī’ti, idaṃ, mahārāja, niyāmakassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavare ‘mā, bhikkhave, pāpake akusale vitakke vitakkeyyātha, seyyathīdaṃ, kāmavitakkaṃ byāpādavitakkaṃ vihiṃsāvitakka’’’nti. Niyāmakaṅgapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Kammakāraṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, ‘kammakārassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, kammakāro evaṃ cintayati ‘bhatako ahaṃ imāya nāvāya kammaṃ karomi, imāyāhaṃ nāvāya vāhasā bhattavetanaṃ labhāmi, na me pamādo karaṇīyo, appamādena me ayaṃ nāvā vāhetabbā’ti, evameva kho, mahārāja, yoginā yogāvacarena evaṃ cintayitabbaṃ ‘imaṃ kho ahaṃ cātumahābhūtikaṃ kāyaṃ sammasanto satataṃ samitaṃ appamatto upaṭṭhitassati sato sampajāno samāhito ekaggacitto jātijarābyādhimaraṇasokaparidevadukkhadomanassupāyāsehi parimuccissāmīti appamādo me karaṇīyo’ti, idaṃ, mahārāja, kammakārassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Kāyaṃ imaṃ sammasatha, parijānātha punappunaṃ; Kāye sabhāvaṃ disvāna, dukkhassantaṃ karissathā’ti. Kammakāraṅgapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Samuddaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, ‘samuddassa pañca aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni pañca aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, mahāsamuddo matena kuṇapena saddhiṃ na saṃvasati, evameva kho, mahārāja, yoginā yogāvacarena rāgadosamohamānadiṭṭhimakkhapaḷāsaissāmacchariyamāyāsāṭheyyakuṭilavisamaduccaritakilesamalehi saddhiṃ na saṃvasitabbaṃ. Idaṃ, mahārāja, samuddassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, mahāsamuddo muttāmaṇiveḷuriyasaṅkhasilāpavāḷaphalikamaṇivividharatananicayaṃ dhārento pidahati, na bahi vikirati. Evameva kho, mahārāja, yoginā yogāvacarena maggaphalajhānavimokkhasamādhisamāpattivipassanābhiññāvividhaguṇaratanāni adhigantvā pidahitabbāni, na bahi nīharitabbāni. Idaṃ, mahārāja, samuddassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, mahāsamuddo mahantehi mahābhūtehi saddhiṃ saṃvasati. Evameva kho, mahārāja, yoginā yogāvacarena appicchaṃ santuṭṭhaṃ dhutavādaṃ sallekhavuttiṃ ācārasampannaṃ lajjiṃ pesalaṃ garuṃ bhāvanīyaṃ vattāraṃ vacanakkhamaṃ codakaṃ pāpagarahiṃ ovādakaṃ anusāsakaṃ viññāpakaṃ sandassakaṃ samādapakaṃ samuttejakaṃ sampahaṃsakaṃ kalyāṇamittaṃ sabrahmacāriṃ nissāya vasitabbaṃ. Idaṃ, mahārāja, mahāsamuddassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, mahāsamuddo navasalilasampuṇṇāhi gaṅgāyamunāaciravatīsarabhūmahīādīhi nadīsatasahassehi antalikkhe saliladhārāhi ca pūritopi sakaṃ velaṃ nātivattati. Evameva kho, mahārāja, yoginā yogāvacarena lābhasakkārasilokavandanamānanapūjanakāraṇā jīvitahetupi sañcicca sikkhāpadavītikkamo na karaṇīyo. Idaṃ, mahārāja, mahāsamuddassa catutthaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena – ‘Seyyathāpi, mahārāja [pahārādha (sī. pī.)], mahāsamuddo ṭhitadhammo velaṃ nātikkamati, evameva kho, mahārāja, yaṃ mahā sāvakānaṃ sikkhāpadaṃ paññattaṃ, taṃ mama sāvakā jīvitahetupi nātikkamantī’ti. ‘‘Puna caparaṃ, mahārāja, mahāsamuddo sabbasavantīhi gaṅgāyamunāaciravatīsarabhūmahīhi antalikkhe udakadhārāhipi na paripūrati. Evameva kho, mahārāja, yoginā yogāvacarena uddesaparipucchāsavanadhāraṇavinicchayaabhidhammavinayagāḷhasuttantaviggahapadanikkhepapadasandhi padavibhattinavaṅgajinasāsanavaraṃ suṇantenāpi na tappitabbaṃ. Idaṃ, mahārāja, mahāsamuddassa pañcamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena sutasomajātake – ‘‘‘Aggi yathā tiṇakaṭṭhaṃ dahanto, na tappati sāgaro vā nadīhi; Evampi ce [evampi ve (syā.), evaṃ hi me (ka.) jā. 1 asītinipāte] paṇḍitā rājaseṭṭha, sutvā na tappanti subhāsitenā’’’ti. Samuddaṅgapañho dasamo.Samuddavaggo dutiyo. Tassuddānaṃ – Lābulatā ca padumaṃ, bījaṃ sālakalyāṇikā; Nāvā ca nāvālagganaṃ, kūpo niyāmako tathā; Kammakāro samuddo ca, vaggo tena pavuccatīti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}