{
  "id": "mil.20",
  "title": {
    "pali": "Upacikāvaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Upacikaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, ‘upacikāya ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, upacikā upari chadanaṃ katvā attānaṃ pidahitvā gocarāya carati, evameva kho, mahārāja, yoginā yogāvacarena sīlasaṃvarachadanaṃ katvā mānasaṃ pidahitvā piṇḍāya caritabbaṃ, sīlasaṃvarachadanena kho, mahārāja, yogī yogāvacaro sabbabhayasamatikkanto hoti. Idaṃ, mahārāja, upacikāya ekaṃ aṅgaṃ gahetabbaṃ, bhāsitampetaṃ, mahārāja, therena upasenena vaṅgantaputtena – ‘‘‘Sīlasaṃvarachadanaṃ, yogī katvāna mānasaṃ; Anupalitto lokena, bhayā ca parimuccatī’’’ti. Upacikaṅgapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Biḷāraṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, ‘biḷārassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, biḷāro guhāgatopi susiragatopi hammiyantaragatopi undūraṃ yeva pariyesati, evameva kho, mahārāja, yoginā yogāvacarena gāmagatenāpi araññagatenāpi rukkhamūlagatenāpi suññāgāragatenāpi satataṃ samitaṃ appamattena kāyagatāsatibhojanaṃ yeva pariyesitabbaṃ. Idaṃ, mahārāja, biḷārassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, biḷāro āsanne yeva gocaraṃ pariyesati, evameva kho, mahārāja, yoginā yogāvacarena imesu yeva pañcasu upādānakkhandhesu udayabbayānupassinā viharitabbaṃ ‘iti rūpaṃ iti rūpassa samudayo iti rūpassa atthaṅgamo, iti vedanā iti vedanāya samudayo iti vedanāya atthaṅgamo, iti saññā iti saññāya samudayo iti saññāya atthaṅgamo, iti saṅkhārā iti saṅkhārānaṃ samudayo iti saṅkhārānaṃ atthaṅgamo, iti viññāṇaṃ iti viññāṇassa samudayo iti viññāṇassa atthaṅgamo’ti. Idaṃ, mahārāja, biḷārassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena – ‘‘‘Na ito dūre bhavitabbaṃ, bhavaggaṃ kiṃ karissati; Paccuppannamhi vohāre, sake kāyamhi vindathā’’’ti. Biḷāraṅgapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Undūraṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, ‘undūrassa [undurassa (syā. ka.)] ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, undūro itocito ca vicaranto āhārūpāsīsako yeva carati, evameva kho, mahārāja, yoginā yogāvacarena itocito ca vicarantena yoniso manasikārūpāsīsakeneva bhavitabbaṃ. Idaṃ, mahārāja, undūrassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena upasenena vaṅgantaputtena – ‘‘‘Dhammāsīsaṃ [dhammasīsaṃ (sī. pī.)] karitvāna, viharanto vipassako; Anolīno viharati, upasanto sadā sato’’’ti. Undūraṅgapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Vicchikaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, ‘vicchikassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, vicchiko naṅgulāvudho naṅgulaṃ ussāpetvā carati, evameva kho, mahārāja, yoginā yogāvacarena ñāṇāvudhena bhavitabbaṃ, ñāṇaṃ ussāpetvā viharitabbaṃ. Idaṃ, mahārāja, vicchikassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena upasenena vaṅgantaputtena – ‘‘‘Ñāṇakhaggaṃ gahetvāna, viharanto vipassako; Parimuccati sabbabhayā, duppasaho ca so bhave’’’ti. Vicchikaṅgapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Nakulaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, ‘nakulassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, nakulo uragamupagacchanto bhesajjena kāyaṃ paribhāvetvā uragamupagacchati gahetuṃ, evameva kho, mahārāja, yoginā yogāvacarena kodhāghātabahulaṃ kalahaviggahavivādavirodhābhibhūtaṃ lokamupagacchantena mettābhesajjena mānasaṃ anulimpitabbaṃ. Idaṃ, mahārāja, nakulassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Tasmā sakaṃ paresampi, kātabbā mettabhāvanā; Mettacittena pharitabbaṃ, etaṃ buddhāna sāsana’’’nti. Nakulaṅgapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Jarasiṅgālaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, ‘jarasiṅgālassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, jarasiṅgālo bhojanaṃ paṭilabhitvā ajigucchamāno yāvadatthaṃ āharayati, evameva kho, mahārāja, yoginā yogāvacarena bhojanaṃ paṭilabhitvā ajigucchamānena sarīrayāpanamattameva paribhuñjitabbaṃ. Idaṃ, mahārāja, jarasiṅgālassa paṭhamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena mahākassapena – ‘‘‘Senāsanamhā oruyha, gāmaṃ piṇḍāya pāvisiṃ; Bhuñjantaṃ purisaṃ kuṭṭhiṃ, sakkacca naṃ upaṭṭhahiṃ. ‘‘‘So me pakkena hatthena, ālopaṃ upanāmayi; Ālopaṃ pakkhipantassa, aṅgulipettha chijjatha. ‘‘‘Kuṭṭamūlañca nissāya, ālopaṃ taṃ abhuñjisaṃ; Bhuñjamāne vā bhutte vā, jegucchaṃ me na vijjatī’ti. ‘‘Puna caparaṃ, mahārāja, jarasiṅgālo bhojanaṃ paṭilabhitvā na vicināti lūkhaṃ vā paṇītaṃ vāti, evameva kho, mahārāja, yoginā yogāvacarena bhojanaṃ paṭilabhitvā na vicinitabbaṃ ‘lūkhaṃ vā paṇītaṃ vā sampannaṃ vā asampannaṃ vā’ti, yathāladdhena santussitabbaṃ. Idaṃ, mahārāja, jarasiṅgālassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena upasenena vaṅgantaputtena – ‘‘‘Lūkhenapi ca santusse, nāññaṃ patthe rasaṃ bahuṃ; Rasesu anugiddhassa, jhāne na ramate [ramatī (sī. pī.)] mano; Itarītarena santuṭṭho [santuṭṭhe (sī. pī.)], sāmaññaṃ paripūratī’’’ti. Jarasiṅgālaṅgapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Migaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, ‘migassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, migo divā araññe carati, rattiṃ abbhokāse, evameva kho, mahārāja, yoginā yogāvacarena divā araññe viharitabbaṃ, rattiṃ abbhokāse. Idaṃ, mahārāja, migassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena lomahaṃsanapariyāye – ‘So kho ahaṃ, sāriputta, yā tā rattiyo sītā hemantikā antaraṭṭhakā himapātasamayā [antaraṭṭhake himapātasamaye (sī. pī. ka.)], tathārūpāsu rattīsu rattiṃ abbhokāse viharāmi, divā vanasaṇḍe. Gimhānaṃ pacchime māse divā abbhokāse viharāmi, rattiṃ vanasaṇḍe’ti. ‘‘Puna caparaṃ, mahārāja, migo sattimhi vā sare vā opatante vañceti [vajjeti (ka.)] palāyati, na kāyamupaneti, evameva kho, mahārāja, yoginā yogāvacarena kilesesu opatantesu vañcayitabbaṃ [vajjayitabbaṃ (ka.)] palāyitabbaṃ, na cittamupanetabbaṃ. Idaṃ, mahārāja, migassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, migo manusse disvā yena vā tena vā palāyati ‘mā maṃ te addasaṃsū’ti, evameva kho, mahārāja, yoginā yogāvacarena bhaṇḍanakalahaviggahavivādasīle dussīle kusīte saṅgaṇikārāme disvā yena vā tena vā palāyitabbaṃ ‘mā maṃ te addasaṃsu, ahañca te mā addasa’nti. Idaṃ, mahārāja, migassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Mā me kadāci pāpiccho, kusīto hīnavīriyo; Appassuto anācāro, sammato [sameto (sī. pī.)] ahu katthacī’’’ti. Migaṅgapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Gorūpaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, ‘gorūpassa cattāri aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni cattāri aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, gorūpo sakaṃ gehaṃ na vijahati, evameva kho, mahārāja, yoginā yogāvacarena sako kāyo na vijahitabbo ‘aniccucchādanaparimaddanabhedanavikiraṇaviddhaṃsanadhammo ayaṃ kāyo’ti. Idaṃ, mahārāja, gorūpassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, gorūpo ādinnadhuro sukhadukkhena dhuraṃ vahati, evameva kho, mahārāja, yoginā yogāvacarena ādinnabrahmacariyena sukhadukkhena yāva jīvitapariyādānā āpāṇakoṭikaṃ brahmacariyaṃ caritabbaṃ. Idaṃ, mahārāja, gorūpassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, gorūpo chandena ghāyamāno pānīyaṃ pivati, evameva kho, mahārāja, yoginā yogāvacarena ācariyupajjhāyānaṃ anusiṭṭhi chandena pemena pasādena ghāyamānena paṭiggahetabbā. Idaṃ, mahārāja, gorūpassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, gorūpo yena kenaci vāhiyamāno vahati, evameva kho, mahārāja, yoginā yogāvacarena theranavamajjhimabhikkhūnampi gihiupāsakassāpi ovādānusāsanī sirasā sampaṭicchitabbā. Idaṃ, mahārāja, gorūpassa catutthaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Tadahu pabbajito santo, jātiyā sattavassiko; Sopi maṃ anusāseyya, sampaṭicchāmi matthake [muddhanā (sī.)]. ‘‘‘Tibbaṃ chandañca pemañca, tasmiṃ disvā upaṭṭhape; Ṭhapeyyācariyaṭṭhāne, sakkacca naṃ punappuna’’’nti. Gorūpaṅgapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Varāhaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, ‘varāhassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, varāho santattakaṭhite [santattakaṭhine (sī. pī.)] gimhasamaye sampatte udakaṃ upagacchati, evameva kho, mahārāja, yoginā yogāvacarena dosena citte āluḷitakhalitavibbhantasantatte sītalāmatapaṇītamettābhāvanaṃ upagantabbaṃ. Idaṃ, mahārāja, varāhassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, varāho cikkhallamudakamupagantvā nāsikāya pathaviṃ khaṇitvā doṇiṃ katvā doṇikāya sayati, evameva kho, mahārāja, yoginā yogāvacarena mānase kāyaṃ nikkhipitvā ārammaṇantaragatena sayitabbaṃ. Idaṃ, mahārāja, varāhassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena piṇḍolabhāradvājena – ‘‘‘Kāye [kāyena (ka.)] sabhāvaṃ disvāna, vicinitvā vipassako; Ekākiyo adutiyo, seti ārammaṇantare’’’ti. Varāhaṅgapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Hatthiṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, ‘hatthissa pañca aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni pañca aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, hatthī nāma caranto yeva pathaviṃ dāleti, evameva kho, mahārāja, yoginā yogāvacarena kāyaṃ sammasamāneneva sabbe kilesā dāletabbā. Idaṃ, mahārāja, hatthissa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, hatthī sabbakāyeneva apaloketi, ujukaṃ yeva pekkhati, na disāvidisā viloketi, evameva kho, mahārāja, yoginā yogāvacarena sabbakāyena apalokinā bhavitabbaṃ, na disāvidisā viloketabbā, na uddhaṃ ulloketabbaṃ, na adho oloketabbaṃ, yugamattapekkhinā bhavitabbaṃ. Idaṃ, mahārāja, hatthissa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, hatthī anibaddhasayano gocarāyamanugantvā na tameva desaṃ vāsatthamupagacchati, na dhuvappatiṭṭhālayo, evameva kho, mahārāja, yoginā yogāvacarena anibaddhasayanena bhavitabbaṃ, nirālayena piṇḍāya gantabbaṃ, yadi passati vipassako manuññaṃ patirūpaṃ ruciradese bhavaṃ maṇḍapaṃ vā rukkhamūlaṃ vā guhaṃ vā pabbhāraṃ vā, tattheva vāsamupagantabbaṃ, dhuvappatiṭṭhālayo na kātabbo. Idaṃ, mahārāja, hatthissa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, hatthī udakaṃ ogāhitvā sucivimalasītalasalilaparipuṇṇaṃ kumuduppalapadumapuṇḍarīkasañchannaṃ mahatimahantaṃ padumasaraṃ ogāhitvā kīḷati gajavarakīḷaṃ, evameva kho, mahārāja, yoginā yogāvacarena sucivimalavippasannamanāviladhammavaravāripuṇṇaṃ vimuttikusumasañchannaṃ mahāsatipaṭṭhānapokkharaṇiṃ ogāhitvā ñāṇena saṅkhārā odhunitabbā vidhunitabbā, yogāvacarakīḷā kīḷitabbā. Idaṃ, mahārāja, hatthissa catutthaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, hatthī sato pādaṃ uddharati, sato pādaṃ nikkhipati, evameva kho, mahārāja, yoginā yogāvacarena satena sampajānena pādaṃ uddharitabbaṃ, satena sampajānena pādaṃ nikkhipitabbaṃ, abhikkamapaṭikkame samiñjanapasāraṇe sabbattha satena sampajānena bhavitabbaṃ. Idaṃ, mahārāja, hatthissa pañcamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavare – ‘‘‘Kāyena saṃvaro sādhu, sādhu vācāya saṃvaro; Manasā saṃvaro sādhu, sādhu sabbattha saṃvaro; Sabbattha saṃvuto lajjī, rakkhitoti pavuccatī’’’ti. Hatthiṅgapañho dasamo.Upacikāvaggo catuttho. Tassuddānaṃ – Upacikā biḷāro ca, undūro vicchikena ca; Nakulo siṅgālo migo, Gorūpo varāho hatthinā dasāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}