{
  "id": "mil.23",
  "title": {
    "pali": "Kumbhavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Kumbhaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, ‘kumbhassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, kumbho sampuṇṇo na saṇati, evameva kho, mahārāja, yoginā yogāvacarena āgame adhigame pariyattiyaṃ sāmaññe pāramiṃ patvā na saṇitabbaṃ, na tena māno karaṇīyo, na dabbo [dappo (sī.)] dassetabbo, nihatamānena nihatadabbena bhavitabbaṃ, ujukena amukharena avikatthinā. Idaṃ, mahārāja, kumbhassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena suttanipāte – ‘‘‘Yadūnakaṃ taṃ saṇati, yaṃ pūraṃ santameva taṃ; Aḍḍhakumbhūpamo [rittakumbhūpamo (sī.)] bālo, rahado pūrova paṇḍito’’’ti. Kumbhaṅgapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Kāḷāyasaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, ‘kāḷāyasassa [kāḷahaṃsassa (ka.)] dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, kāḷāyaso supīto [suthito (ka.)] vamati [vahati (syā. ka.)], evameva kho, mahārāja, yogino yogāvacarassa mānasaṃ yoniso manasikārena [yoniso manasikāre (sī. syā. ka.)] apītaṃ vamati. Idaṃ, mahārāja, kāḷāyasassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, kāḷāyaso sakiṃ pītaṃ udakaṃ na vamati, evameva kho, mahārāja, yoginā yogāvacarena yo sakiṃ uppanno pasādo, na puna so vamitabbo ‘uḷāro so bhagavā sammāsambuddho, svākkhāto dhammo, suppaṭipanno saṅgho’ti. ‘Rūpaṃ aniccaṃ, vedanā aniccā, saññā aniccā, saṅkhārā aniccā, viññāṇaṃ aniccanti yaṃ sakiṃ uppannaṃ ñāṇaṃ, na puna taṃ vamitabbaṃ. Idaṃ, mahārāja, kāḷāyasassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena – ‘‘‘Dassanamhi parisodhito [parisodhike (sī. ka.)] naro, ariyadhamme niyato visesagū; Nappavedhati anekabhāgaso, sabbaso ca mukhabhāvameva so’’’ti. Kāḷāyasaṅgapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Chattaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, ‘chattassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, chattaṃ upari muddhani carati, evameva kho, mahārāja, yoginā yogāvacarena kilesānaṃ upari muddhani carena bhavitabbaṃ. Idaṃ, mahārāja, chattassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, chattaṃ muddhanupatthambhaṃ hoti, evameva kho, mahārāja, yoginā yogāvacarena yoniso manasikārupatthambhena bhavitabbaṃ. Idaṃ, mahārāja, chattassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, chattaṃ vātātapameghavuṭṭhiyo paṭihanati, evameva kho, mahārāja, yoginā yogāvacarena nānāvidhadiṭṭhiputhusamaṇabrāhmaṇānaṃ [mahāvāta (ka.)] matavātatividhaggisantāpakilesavuṭṭhiyo paṭihantabbā. Idaṃ, mahārāja, chattassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Yathāpi chattaṃ vipulaṃ, acchiddaṃ thirasaṃhitaṃ; Vātātapaṃ nivāreti, mahatī meghavuṭṭhiyo. ‘‘‘Tatheva buddhaputtopi, sīlachattadharo suci; Kilesavuṭṭhiṃ vāreti, santāpatividhaggayo’’’ti. Chattaṅgapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Khettaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, ‘khettassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, khettaṃ mātikāsampannaṃ hoti, evameva kho, mahārāja, yoginā yogāvacarena sucaritavattappaṭivattamātikāsampannena bhavitabbaṃ. Idaṃ, mahārāja, khettassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, khettaṃ mariyādāsampannaṃ hoti, tāya ca mariyādāya udakaṃ rakkhitvā dhaññaṃ paripāceti, evameva kho, mahārāja, yoginā yogāvacarena sīlahirimariyādāsampannena bhavitabbaṃ, tāya ca sīlahirimariyādāya sāmaññaṃ rakkhitvā cattāri sāmaññaphalāni gahetabbāni. Idaṃ, mahārāja, khettassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, khettaṃ uṭṭhānasampannaṃ hoti, kassakassa hāsajanakaṃ appampi bījaṃ vuttaṃ bahu hoti, bahu vuttaṃ bahutaraṃ hoti, evameva kho, mahārāja, yoginā yogāvacarena uṭṭhānasampannena vipulaphaladāyinā bhavitabbaṃ, dāyakānaṃ hāsajanakena bhavitabbaṃ, yathā appaṃ dinnaṃ bahu hoti, bahu dinnaṃ bahutaraṃ hoti. Idaṃ, mahārāja, khettassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena upālinā vinayadharena – ‘‘‘Khettūpamena bhavitabbaṃ, uṭṭhānavipuladāyinā; Esa khettavaro nāma, yo dadāti vipulaṃ phala’’’nti. Khettaṅgapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Agadaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, ‘agadassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti. ‘‘Yathā, mahārāja, agade kimī na saṇṭhahanti, evameva kho, mahārāja, yoginā yogāvacarena mānase kilesā na saṇṭhapetabbā. Idaṃ, mahārāja, agadassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, agado daṭṭhaphuṭṭhadiṭṭhaasitapītakhāyitasāyitaṃ sabbaṃ visaṃ paṭihanati, evameva kho, mahārāja, yoginā yogāvacarena rāgadosamohamānadiṭṭhivisaṃ sabbaṃ paṭihanitabbaṃ. Idaṃ, mahārāja, agadassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena – ‘‘‘Saṅkhārānaṃ sabhāvatthaṃ, daṭṭhukāmena yoginā; Agadeneva hotabbaṃ, kilesavisanāsane’’’ti. Agadaṅgapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Bhojanaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, ‘bhojanassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, bhojanaṃ sabbasattānaṃ upatthambho, evameva kho, mahārāja, yoginā yogāvacarena sabbasattānaṃ maggupatthambhena bhavitabbaṃ. Idaṃ, mahārāja, bhojanassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, bhojanaṃ sabbasattānaṃ balaṃ vaḍḍheti, evameva kho, mahārāja, yoginā yogāvacarena puññavaḍḍhiyā vaḍḍhitabbaṃ. Idaṃ, mahārāja, bhojanassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, bhojanaṃ sabbasattānaṃ abhipatthitaṃ, evameva kho, mahārāja, yoginā yogāvacarena sabbalokābhipatthitena bhavitabbaṃ. Idaṃ, mahārāja, bhojanassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena mahāmoggallānena – ‘‘‘Saṃyamena niyamena, sīlena paṭipattiyā; Patthitena bhavitabbaṃ, sabbalokassa yoginā’’’ti. Bhojanaṅgapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Issāsaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, ‘issāsassa cattāri aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni cattāri aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, issāso sare pātayanto ubho pāde pathaviyaṃ daḷhaṃ patiṭṭhāpeti, jaṇṇuavekallaṃ karoti, sarakalāpaṃ kaṭisandhimhi ṭhapeti, kāyaṃ upatthaddhaṃ karoti, dve hatthe sandhiṭṭhānaṃ āropeti, muṭṭhiṃ pīḷayati, aṅguliyo nirantaraṃ karoti, gīvaṃ paggaṇhāti, cakkhūni mukhañca pidahati, nimittaṃ ujuṃ karoti, hāsamuppādeti ‘vijjhissāmī’ti, evameva kho, mahārāja, yoginā yogāvacarena sīlapathaviyaṃ vīriyapāde patiṭṭhāpetabbaṃ, khantisoraccaṃ avekallaṃ kātabbaṃ, saṃvare cittaṃ ṭhapetabbaṃ, saṃyamaniyame attā upanetabbo, icchā mucchā pīḷayitabbā, yoniso manasikāre cittaṃ nirantaraṃ kātabbaṃ, vīriyaṃ paggahetabbaṃ, cha dvārā pidahitabbā, sati upaṭṭhapetabbā, hāsamuppādetabbaṃ ‘sabbakilese ñāṇanārācena vijjhissāmī’ti. Idaṃ, mahārāja, issāsassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, issāso āḷakaṃ pariharati vaṅkajimhakuṭilanārācassa ujukaraṇāya. Evameva kho, mahārāja, yoginā yogāvacarena imasmiṃ kāye satipaṭṭhānaāḷakaṃ pariharitabbaṃ vaṅkajimhakuṭilacittassa ujukaraṇāya. Idaṃ, mahārāja, issāsassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, issāso lakkhe upāseti, evameva kho, mahārāja, yoginā yogāvacarena imasmiṃ kāye upāsitabbaṃ. Kathaṃ mahārāja yoginā yogāvacarena imasmiṃ kāye upāsitabbaṃ? Aniccato upāsitabbaṃ, dukkhato upāsitabbaṃ, anattato upāsitabbaṃ, rogato…pe… gaṇḍato…pe… sallato…pe… aghato…pe… ābādhato…pe… parato…pe… palokato…pe… ītito…pe… upaddavato…pe… bhayato…pe… upasaggato…pe… calato…pe… pabhaṅguto…pe… addhuvato…pe… atāṇato…pe… aleṇato…pe… asaraṇato…pe… rittato…pe… tucchato…pe… suññato…pe… ādīnavato…pe… vipariṇāmadhammato…pe… asārato …pe… aghamūlato…pe… vadhakato…pe… vibhavato…pe… sāsavato…pe… saṅkhatato…pe… mārāmisato…pe… jātidhammato…pe… jarādhammato…pe… byādhidhammato…pe… maraṇadhammato… pe… sokadhammato…pe… paridevadhammato…pe… upāyāsadhammato…pe… saṃkilesadhammato…pe… evaṃ kho, mahārāja, yoginā yogāvacarena imasmiṃ kāye upāsitabbaṃ. Idaṃ, mahārāja, issāsassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, issāso sāyaṃ pātaṃ upāsati. Evameva kho, mahārāja, yoginā yogāvacarena sāyaṃ pātaṃ ārammaṇe upāsitabbaṃ. Idaṃ, mahārāja, issāsassa catutthaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Yathā issāsako nāma, sāyaṃ pātaṃ upāsati; Upāsanaṃ ariñcanto [na ricchanto (sī. ka.)], labhate bhattavetanaṃ. ‘‘‘Tatheva buddhaputtopi, karoti kāyupāsanaṃ; Kāyupāsanaṃ ariñcanto, arahattamadhigacchatī’’’ti. Issāsaṅgapañho sattamo. Kumbhavaggo sattamo [ito paraṃ rājaṅgapañhādikā aṭṭhatiṃsa pañhā vinaṭṭhā, yehi tā diṭṭhā,§tehi no ārocetabbā puna muddāpanakāle pakkhipanatthāyāti (na, bu, sa)]. Tassuddānaṃ – Kumbho ca kāḷāyaso ca, chattaṃ khettañca agado; Bhojanena ca issāso, vuttaṃ dāni vidūhīti. Opammakathāpañho niṭṭhito. Nigamanaṃ Iti chasu kaṇḍesu bāvīsativaggapatimaṇḍitesu dvāsaṭṭhiadhikā dvesatā imasmiṃ potthake āgatā milindapañhā samattā, anāgatā ca pana dvācattālīsā honti, āgatā ca anāgatā ca sabbā samodhānetvā catūhi adhikā tisatapañhā honti, sabbāva milindapañhāti saṅkhaṃ gacchanti. Rañño ca therassa ca pucchāvisajjanāvasāne caturāsītisatasahassayojanabahalā udakapariyantaṃ katvā ayaṃ mahāpathavī chadhā kampittha, vijjullatā nicchariṃsu, devatā dibbapupphavassaṃ pavassiṃsu, mahābrahmā sādhukāramadāsi, mahāsamuddakucchiyaṃ meghatthanitanigghoso viya mahāghoso ahosi, iti so milindo rājā ca orodhagaṇā ca sirasā añjaliṃ paṇāmetvā vandiṃsu. Milindo rājā ativiya pamuditahadayo sumathitamānahadayo buddhasāsane sāramatino ratanattaye sunikkaṅkho niggumbo nitthaddho hutvā therassa guṇesu pabbajjāsu paṭipadāiriyāpathesu ca ativiya pasanno vissattho nirālayo nihatamānatthambho uddhaṭadāṭho viya bhujagindo evamāha ‘‘sādhu, bhante nāgasena, buddhavisayo pañho tayā visajjito, imasmiṃ buddhasāsane ṭhapetvā dhammasenāpatiṃ sāriputtattheraṃ añño tayā sadiso pañhavisajjane natthi, khamatha, bhante nāgasena, mama accayaṃ, upāsakaṃ maṃ, bhante nāgasena, dhāretha ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Tadā rājā saha balakāyehi nāgasenattheraṃ payirupāsitvā milindaṃ nāma vihāraṃ kāretvā therassa niyyātetvā catūhi paccayehi nāgasenaṃ koṭisatehi bhikkhūhi saddhiṃ paricari, punapi therassa paññāya pasīditvā puttassa rajjaṃ niyyātetvā agārasmā anagāriyaṃ pabbajitvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi, tena vuttaṃ – ‘‘Paññā pasatthā lokasmiṃ, katā saddhammaṭṭhitiyā; Paññāya vimatiṃ hantvā, santiṃ papponti paṇḍitā. Yasmiṃ khandhe ṭhitā paññā, sati tattha anūnakā; Pūjā visesassādhāro, aggo seṭṭho [so va (pī.)] anuttaro; Tasmā hi paṇḍito poso, sampassaṃ hitamattano [atthamattano (pī.)]; Paññavantaṃbhipūjeyya, cetiyaṃ viya sādaro’’ti [pūjiyanti (pī.) ito paraṃ tisso gāthāyo sī. pī. potthakesu natthi]. Laṅkāyaṃ doṇinagare, vasatā doṇināminā; Mahātherena lekhitvā, suṭṭhapitaṃ yathāsutaṃ; Milindarājapañho ca, nāgasenavisajjanaṃ; Milindo hi mahāpañño, nāgaseno supaṇḍito; Iminā puññakammena, ito gacchāmi tussitaṃ; Metteyyaṃnāgate passe, suṇeyyaṃ dhammamuttamanti. Milindapañho niṭṭhito.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}