{
  "id": "mil.21",
  "title": {
    "pali": "Sīhavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Sīhaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, ‘sīhassa satta aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni satta aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, sīho nāma setavimalaparisuddhapaṇḍaro, evameva kho, mahārāja, yoginā yogāvacarena setavimalaparisuddhapaṇḍaracittena byapagatakukkuccena bhavitabbaṃ. Idaṃ, mahārāja, sīhassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sīho catucaraṇo vikkantacārī, evameva kho, mahārāja, yoginā yogāvacarena caturiddhipādacaraṇena bhavitabbaṃ. Idaṃ, mahārāja, sīhassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sīho abhirūparucirakesarī, evameva kho, mahārāja, yoginā yogāvacarena abhirūparucirasīlakesarinā bhavitabbaṃ. Idaṃ, mahārāja, sīhassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sīho jīvitapariyādānepi na kassaci onamati, evameva kho, mahārāja, yoginā yogāvacarena cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārapariyādānepi na kassaci onamitabbaṃ. Idaṃ, mahārāja, sīhassa catutthaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sīho sapadānabhakkho yasmiṃ okāse nipatati, tattheva yāvadatthaṃ bhakkhayati, na varamaṃsaṃ vicināti, evameva kho, mahārāja, yoginā yogāvacarena sapadānabhakkhena bhavitabbaṃ, na kulāni vicinitabbāni, na pubbagehaṃ hitvā kulāni upasaṅkamitabbāni, na bhojanaṃ vicinitabbaṃ, yasmiṃ okāse kabaḷaṃ ādīyati, tasmiṃ yeva okāse bhuñjitabbaṃ sarīrayāpanatthaṃ [sarīrayāpanamattaṃ (sī. pī.)], na varabhojanaṃ vicinitabbaṃ. Idaṃ, mahārāja, sīhassa pañcamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sīho asannidhibhakkho, sakiṃ gocaraṃ bhakkhayitvā na puna taṃ upagacchati, evameva kho, mahārāja, yoginā yogāvacarena asannidhikāraparibhoginā bhavitabbaṃ. Idaṃ, mahārāja, sīhassa chaṭṭhaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sīho bhojanaṃ aladdhā na paritassati, laddhāpi bhojanaṃ agadhito [agathito (sī.)] amucchito anajjhosanno paribhuñjati, evameva kho, mahārāja, yoginā yogāvacarena bhojanaṃ aladdhā na paritassitabbaṃ, laddhāpi bhojanaṃ agadhitena amucchitena anajjhosannena ādīnavadassāvinā nissaraṇapaññena paribhuñjitabbaṃ. Idaṃ, mahārāja, sīhassa sattamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavare theraṃ mahākassapaṃ parikittayamānena – ‘Santuṭṭhoyaṃ, bhikkhave, kassapo itarītarena piṇḍapātena, itarītarapiṇḍapātasantuṭṭhiyā ca vaṇṇavādī, na ca piṇḍapātahetu anesanaṃ appatirūpaṃ āpajjati, aladdhā ca piṇḍapātaṃ na paritassati, laddhā ca piṇḍapātaṃ agadhito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjatī’’’ti. Sīhaṅgapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Cakkavākaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, ‘cakkavākassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānīti’’? ‘‘Yathā, mahārāja, cakkavāko yāva jīvitapariyādānā dutiyikaṃ na vijahati, evameva kho, mahārāja, yoginā yogāvacarena yāva jīvitapariyādānā yoniso manasikāro na vijahitabbo. Idaṃ, mahārāja, cakkavākassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, cakkavāko sevālapaṇakabhakkho, tena ca santuṭṭhiṃ āpajjati, tāya ca santuṭṭhiyā balena ca vaṇṇena ca na parihāyati, evameva kho, mahārāja, yoginā yogāvacarena yathālābhasantoso karaṇīyo, yathālābhasantuṭṭho kho, mahārāja, yogī yogāvacaro na parihāyati sīlena, na parihāyati samādhinā, na parihāyati paññāya, na parihāyati vimuttiyā, na parihāyati vimuttiñāṇadassanena, na parihāyati sabbehi kusalehi dhammehi. Idaṃ, mahārāja, cakkavākassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, cakkavāko pāṇe na viheṭhayati, evameva kho, mahārāja, yoginā yogāvacarena nihitadaṇḍena nihitasatthena lajjinā dayāpannena sabbapāṇabhūtahitānukampinā bhavitabbaṃ. Idaṃ, mahārāja, cakkavākassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsatampetaṃ, mahārāja, bhagavatā devātidevena cakkavākajātake – ‘‘‘Yo na hanti na ghāteti, na jināti na jāpaye; Mettaṃso [ahiṃsā (sī. pī.)] sabbabhūtesu, veraṃ tassa na kenacī’’’ti. Cakkavākaṅgapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Peṇāhikaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, ‘peṇāhikāya dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, peṇāhikā sakapatimhi usūyāya chāpake na posayati, evameva kho, mahārāja, yoginā yogāvacarena sakamane [sakamano (ka.)] kilese uppanne usūyāyitabbaṃ, satipaṭṭhānena sammāsaṃvarasusire pakkhipitvā manodvāre kāyagatāsati bhāvetabbā. Idaṃ, mahārāja, peṇāhikāya paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, peṇāhikā pavane divasaṃ gocaraṃ caritvā sāyaṃ pakkhigaṇaṃ upeti attano guttiyā, evameva kho, mahārāja, yoginā yogāvacarena ekakena pavivekaṃ sevitabbaṃ saṃyojanaparimuttiyā, tatra ratiṃ alabhamānena upavādabhayaparirakkhaṇāya saṅghaṃ osaritvā saṅgharakkhitena vasitabbaṃ. Idaṃ, mahārāja, peṇāhikāya dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, brahmunā sahampatinā bhagavato santike – ‘‘‘Sevetha pantāni senāsanāni, careyya saṃyojanavippamokkhā; Sace ratiṃ nādhigaccheyya tattha, saṅghe vase rakkhitatto satīmā’’’ti. Peṇāhikaṅgapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Gharakapotaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, ‘gharakapotassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, gharakapoto paragehe vasamāno na tesaṃ kiñci bhaṇḍassa nimittaṃ gaṇhāti, majjhatto vasati saññābahulo, evameva kho, mahārāja, yoginā yogāvacarena parakulaṃ upagatena tasmiṃ kule itthīnaṃ vā purisānaṃ vā mañce vā pīṭhe vā vatthe vā alaṅkāre vā upabhoge vā paribhoge vā bhojanavikatīsu vā na nimittaṃ gahetabbaṃ, majjhattena bhavitabbaṃ, samaṇasaññā paccupaṭṭhapetabbā. Idaṃ, mahārāja, gharakapotassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena cūḷanāradajātake – ‘‘‘Pavisitvā parakulaṃ, pānatthaṃ bhojanāya vā [pānesu bhojanesu vā (sī. pī.)]; Mitaṃ khāde mitaṃ bhuñje, na ca rūpe manaṃ kare’’’ti. Gharakapotaṅgapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Ulūkaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, ‘ulūkassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, ulūko kākehi paṭiviruddho, rattiṃ kākasaṅghaṃ gantvā bahūpi kāke hanati, evameva kho, mahārāja, yoginā yogāvacarena aññāṇena paṭiviruddho kātabbo, ekena raho nisīditvā aññāṇaṃ sampamadditabbaṃ, mūlato chinditabbaṃ. Idaṃ, mahārāja, ulūkassa paṭhamaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, ulūko suppaṭisallīno hoti, evameva kho, mahārāja, yoginā yogāvacarena paṭisallānārāmena bhavitabbaṃ paṭisallānaratena. Idaṃ, mahārāja, ulūkassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavare – ‘‘‘Idha, bhikkhave, bhikkhu paṭisallānārāmo paṭisallānarato ‘‘idaṃ dukkha’’nti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhasamudayo’’ti yathā bhūthaṃ pajānāti, ‘‘ayaṃ dukkhanirodho’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti yathābhūtaṃ pajānātī’’’ti. Ulūkaṅgapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Satapattaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, ‘satapattassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, satapatto ravitvā paresaṃ khemaṃ vā bhayaṃ vā ācikkhati, evameva kho, mahārāja, yoginā yogāvacarena paresaṃ dhammaṃ desayamānena vinipātaṃ bhayato dassayitabbaṃ, nibbānaṃ khemato dassayitabbaṃ. Idaṃ, mahārāja, satapattassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena piṇḍolabhāradvājena – ‘‘‘Niraye bhayasantāsaṃ, nibbāne vipulaṃ sukhaṃ; Ubhayānetānatthāni dassetabbāni yoginā’’’ti. Satapattaṅgapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Vagguliṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, ‘vaggulissa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, vagguli gehaṃ pavisitvā vicaritvā nikkhamati, na tattha palibuddhati, evameva kho, mahārāja, yoginā yogāvacarena gāmaṃ piṇḍāya pavisitvā sapadānaṃ vicaritvā paṭiladdhalābhena khippameva nikkhamitabbaṃ, na tattha palibuddhena bhavitabbaṃ. Idaṃ, mahārāja, vaggulissa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, vagguli paragehe vasamāno na tesaṃ parihāniṃ karoti, evameva kho, mahārāja, yoginā yogāvacarena kulāni upasaṅkamitvā atiyācanāya vā viññattibahulatāya vā kāyadosabahulatāya vā atibhāṇitāya vā samānasukhadukkhatāya vā na tesaṃ koci vippaṭisāro karaṇīyo, napi tesaṃ mūlakammaṃ parihāpetabbaṃ, sabbathā vaḍḍhi yeva icchitabbā. Idaṃ, mahārāja, vaggulissa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena dīghanikāyavare lakkhaṇasuttante – ‘‘‘Suddhāya sīlena sutena buddhiyā, cāgena dhammena bahūhi sādhuhi; Dhanena dhaññena ca khettavatthunā, puttehi dārehi catuppadehi ca. ‘‘‘Ñātīhi mittehi ca bandhavehi, balena vaṇṇena sukhena cūbhayaṃ; Kathaṃ na hāyeyyuṃ pareti icchati, atthasamiddhiñca panābhikaṅkhatī’’’ti. Vagguliṅgapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Jalūkaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, ‘jalūkāya ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, jalūkā yattha allīyati, tattheva daḷhaṃ allīyitvā ruhiraṃ pivati, evameva kho, mahārāja, yoginā yogāvacarena yasmiṃ ārammaṇe cittaṃ allīyati, taṃ ārammaṇaṃ vaṇṇato ca saṇṭhānato ca disato ca okāsato ca paricchedato ca liṅgato ca nimittato ca daḷhaṃ patiṭṭhāpetvā tenevārammaṇena vimuttirasamasecanakaṃ pātabbaṃ. Idaṃ, mahārāja, jalūkāya ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena anuruddhena – ‘‘‘Parisuddhena cittena, ārammaṇe patiṭṭhāya; Tena cittena pātabbaṃ, vimuttirasamasecana’’’nti. Jalūkaṅgapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Sappaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, ‘sappassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, sappo urena gacchati, evameva kho, mahārāja, yoginā yogāvacarena paññāya caritabbaṃ, paññāya caramānassa kho, mahārāja, yogino cittaṃ ñāye carati, vilakkhaṇaṃ vivajjeti, salakkhaṇaṃ bhāveti. Idaṃ, mahārāja, sappassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sappo caramāno osadhaṃ parivajjento carati, evameva kho, mahārāja, yoginā yogāvacarena duccaritaṃ parivajjentena caritabbaṃ. Idaṃ, mahārāja, sappassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, sappo manusse disvā tappati [manussaṃ disvā kampati (ka.)] socati cintayati, evameva kho mahārāja yoginā yogāvacarena kuvitakke, vitakketvā aratiṃ uppādayitvā tappitabbaṃ socitabbaṃ cintayitabbaṃ ‘pamādena me divaso vītināmito, na so puna sakkā laddhu’nti. Idaṃ, mahārāja, sappassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā bhallāṭiyajātake dvinnaṃ kinnarānaṃ – ‘‘‘Mayekarattaṃ [yamekarattiṃ (sī. pī.)] vippavasimha ludda, akāmakā aññamaññaṃ sarantā; Tamekarattaṃ [tamekarattiṃ (sī. pī.)] anutappamānā, socāma ‘sā ratti puna nahessatī’’’ti. Sappaṅgapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Ajagaraṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, ‘ajagarassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, ajagaro mahatimahākāyo bahūpi divase ūnūdaro dīnataro kucchipūraṃ āhāraṃ na labhati, aparipuṇṇo yeva yāvadeva sarīrayāpanamattakena yāpeti, evameva kho, mahārāja, yogino yogāvacarassa bhikkhācariyappasutassa parapiṇḍamupagatassa paradinnappāṭikaṅkhissa sayaṃgāhappaṭiviratassa dullabhaṃ udaraparipūraṃ āhāraṃ, api ca atthavasikena kulaputtena cattāro pañca ālope abhuñjitvā avasesaṃ udakena paripūretabbaṃ. Idaṃ, mahārāja, ajagarassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Allaṃ sukkhaṃ vā bhuñjanto, na bāḷhaṃ suhito siyā; Ūnūdaro mitāhāro, sato bhikkhu paribbaje. ‘‘‘Cattāro pañca ālope, abhutvā udakaṃ pive; Alaṃ phāsu vihārāya, pahitattassa bhikkhuno’’’ti. Ajagaraṅgapañho dasamo. Sīhavaggo pañcamo. Tassuddānaṃ – Kesarī cakkavāko ca, peṇāhi gharakapotako; Ulūko satapatto ca, vagguli ca jalūpikā; Sappo ajagaro ceva, vaggo tena pavuccatīti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}