{
  "id": "dn.2.2",
  "title": {
    "pali": "Mahānidānasuttaṃ",
    "english": "The Great Discourse on Causation",
    "sinhala": "මහා නිදාන සූත්‍රය"
  },
  "sections": [
    {
      "number": 95,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kurūsu viharati kammāsadhammaṃ nāma [kammāsadammaṃ nāma (syā.)] kurūnaṃ nigamo. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Yāva gambhīro cāyaṃ, bhante, paṭiccasamuppādo gambhīrāvabhāso ca, atha ca pana me uttānakuttānako viya khāyatī’’ti. ‘‘Mā hevaṃ, ānanda, avaca, mā hevaṃ, ānanda, avaca. Gambhīro cāyaṃ, ānanda, paṭiccasamuppādo gambhīrāvabhāso ca. Etassa, ānanda, dhammassa ananubodhā appaṭivedhā evamayaṃ pajā tantākulakajātā kulagaṇṭhikajātā [gulāguṇṭhikajātā (sī. pī.), guṇagaṇṭhikajātā (syā.)] muñjapabbajabhūtā apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattati.",
      "english": "Thus I have heard. At one time the Blessed One was staying among the Kurus, at a town of the Kurus named Kammāsadhamma. Then the Venerable Ānanda approached the Blessed One, and after paying homage to him, sat down to one side. Seated to one side, the Venerable Ānanda said to the Blessed One: “Venerable sir, it is wonderful! Venerable sir, it is amazing! This dependent origination is so deep, venerable sir, and its appearance is so deep, yet it seems to me as plain as can be.” “Do not say that, Ānanda! Do not say that, Ānanda! Dependent origination is deep, Ānanda, and it appears deep. It is because of not understanding and not penetrating this Dhamma, Ānanda, that this generation has become entangled like a skein of thread, knotted like a ball of string, and matted like muñja grass and reeds, unable to overcome the lower realms, bad destinations, downfall, and the cycle of existence.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ කුරු රටෙහි කම්මාසදම්ම නම් කුරු ජනපදයෙහි වැඩ වාසය කළ සේක. ඉක්බිති ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවත් බුදුරජාණන් වහන්සේ වැඩ සිටි තැනට පැමිණ, උන්වහන්සේට වන්දනා කොට එකත්පසෙක හිඳගත්හ. එකත්පසෙක හිඳගත් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවත් බුදුරජාණන් වහන්සේට මෙසේ කීහ: \"ස්වාමීනි, පුදුමයකි! ආශ්චර්යයකි! මේ පටිච්චසමුප්පාදය කොතරම් ගැඹුරු ද? ගැඹුරු අර්ථයක් ඇති දෙයක් ලෙස පෙනේ. එහෙත් එය මට ඉතා නොගැඹුරු දෙයක් මෙන් පෙනේ.\"\n\n\"ආනන්දය, එසේ නොකියන්න. ආනන්දය, එසේ නොකියන්න. මේ පටිච්චසමුප්පාදය, ආනන්දය, ගැඹුරුය. ගැඹුරු අර්ථයක් ඇති දෙයක් ලෙස පෙනේ. ආනන්දය, මේ ධර්මය අවබෝධ නොකිරීමෙන් හා එය නොදැනීමෙන් මේ සත්වයෝ පැටලුණු නූල් බෝලයක් මෙන්ද, පැටලුණු ගැට ගැසුණු නූල් මෙන්ද, මුං තණ හා පබ්බජ තණ මෙන්ද වෙති. ඔවුහු අපාය, දුගතිය, විනිපාතය, සංසාරය ඉක්මවා නොයති.\"",
      "paliTitle": "Paṭiccasamuppādo",
      "englishTitle": "Dependent Origination",
      "sinhalaTitle": "පටිච්චසමුප්පාදය"
    },
    {
      "number": 96,
      "pali": "‘‘‘Atthi idappaccayā jarāmaraṇa’nti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā jarāmaraṇa’nti iti ce vadeyya, ‘jātipaccayā jarāmaraṇa’nti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā jātī’ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā jātī’ti iti ce vadeyya, ‘bhavapaccayā jātī’ti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā bhavo’ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā bhavo’ti iti ce vadeyya, ‘upādānapaccayā bhavo’ti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā upādāna’nti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā upādāna’nti iti ce vadeyya, ‘taṇhāpaccayā upādāna’nti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā taṇhā’ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā taṇhā’ti iti ce vadeyya, ‘vedanāpaccayā taṇhā’ti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā vedanā’ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā vedanā’ti iti ce vadeyya, ‘phassapaccayā vedanā’ti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā phasso’ti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā phasso’ti iti ce vadeyya, ‘nāmarūpapaccayā phasso’ti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā nāmarūpa’nti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā nāmarūpa’nti iti ce vadeyya, ‘viññāṇapaccayā nāmarūpa’nti iccassa vacanīyaṃ. ‘‘‘Atthi idappaccayā viññāṇa’nti iti puṭṭhena satā, ānanda, atthītissa vacanīyaṃ. ‘Kiṃpaccayā viññāṇa’nti iti ce vadeyya, ‘nāmarūpapaccayā viññāṇa’nti iccassa vacanīyaṃ.",
      "english": "Ānanda, if asked, \"Is there old age and death conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for old age and death?\" one should answer, \"Birth is the condition for old age and death.\"\n\nĀnanda, if asked, \"Is there birth conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for birth?\" one should answer, \"Existence is the condition for birth.\"\n\nĀnanda, if asked, \"Is there existence conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for existence?\" one should answer, \"Clinging is the condition for existence.\"\n\nĀnanda, if asked, \"Is there clinging conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for clinging?\" one should answer, \"Craving is the condition for clinging.\"\n\nĀnanda, if asked, \"Is there craving conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for craving?\" one should answer, \"Feeling is the condition for craving.\"\n\nĀnanda, if asked, \"Is there feeling conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for feeling?\" one should answer, \"Contact is the condition for feeling.\"\n\nĀnanda, if asked, \"Is there contact conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for contact?\" one should answer, \"Name-and-form is the condition for contact.\"\n\nĀnanda, if asked, \"Is there name-and-form conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for name-and-form?\" one should answer, \"Consciousness is the condition for name-and-form.\"\n\nĀnanda, if asked, \"Is there consciousness conditioned by something?\" one should answer, \"Yes.\" If asked, \"What is the condition for consciousness?\" one should answer, \"Name-and-form is the condition for consciousness.\"",
      "sinhala": "ආනන්දය, ‘මේ හේතුව නිසා ජරාමරණ තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා ජරාමරණ තිබේදැ’යි විමසන්නේ නම්, ‘ජාතිය හේතුවෙන් ජරාමරණ ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා ජාතිය තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා ජාතිය තිබේදැ’යි විමසන්නේ නම්, ‘භවය හේතුවෙන් ජාතිය ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා භවය තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා භවය තිබේදැ’යි විමසන්නේ නම්, ‘උපාදානය හේතුවෙන් භවය ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා උපාදානය තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා උපාදානය තිබේදැ’යි විමසන්නේ නම්, ‘තෘෂ්ණාව හේතුවෙන් උපාදානය ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා තෘෂ්ණාව තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා තෘෂ්ණාව තිබේදැ’යි විමසන්නේ නම්, ‘වේදනාව හේතුවෙන් තෘෂ්ණාව ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා වේදනාව තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා වේදනාව තිබේදැ’යි විමසන්නේ නම්, ‘ස්පර්ශය හේතුවෙන් වේදනාව ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා ස්පර්ශය තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා ස්පර්ශය තිබේදැ’යි විමසන්නේ නම්, ‘නාමරූප හේතුවෙන් ස්පර්ශය ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා නාමරූප තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා නාමරූප තිබේදැ’යි විමසන්නේ නම්, ‘විඤ්ඤාණය හේතුවෙන් නාමරූප ඇත’ යයි පිළිතුරු දිය යුතුය.\n\nආනන්දය, ‘මේ හේතුව නිසා විඤ්ඤාණය තිබේදැ’යි විමසන කෙනෙකුට ‘ඇත’ යයි පිළිතුරු දිය යුතුය. ‘කුමන හේතුවක් නිසා විඤ්ඤාණය තිබේදැ’යි විමසන්නේ නම්, ‘නාමරූප හේතුවෙන් විඤ්ඤාණය ඇත’ යයි පිළිතුරු දිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 97,
      "pali": "‘‘Iti kho, ānanda, nāmarūpapaccayā viññāṇaṃ, viññāṇapaccayā nāmarūpaṃ, nāmarūpapaccayā phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṃ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti.",
      "english": "\"So it is, Ananda, that with name-and-form as condition, there is consciousness; with consciousness as condition, there is name-and-form. With name-and-form as condition, there is contact; with contact as condition, there is feeling; with feeling as condition, there is craving; with craving as condition, there is clinging; with clinging as condition, there is becoming; with becoming as condition, there is birth; with birth as condition, aging and death, sorrow, lamentation, pain, grief, and despair all arise. Thus is the origin of this entire mass of suffering.\"",
      "sinhala": "“ආනන්දය, මෙසේ නාමරූපය හේතුකොට විඤ්ඤාණය ද, විඤ්ඤාණය හේතුකොට නාමරූපය ද, නාමරූපය හේතුකොට ඵස්සය ද, ඵස්සය හේතුකොට වේදනාව ද, වේදනාව හේතුකොට තණ්හාව ද, තණ්හාව හේතුකොට උපාදානය ද, උපාදානය හේතුකොට භවය ද, භවය හේතුකොට ජාතිය ද, ජාතිය හේතුකොට ජරාව, මරණය, ශෝකය, පරිදේවය, දුක, දොම්නස, උපායාසය යන මේ සියල්ල හටගනී. මේ ආකාරයෙන් මුළු දුක්ඛස්කන්ධයේ හටගැනීම සිදුවේ.”",
      "paliTitle": ""
    },
    {
      "number": 98,
      "pali": "‘‘‘Jātipaccayā jarāmaraṇa’nti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā jātipaccayā jarāmaraṇaṃ. Jāti ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, seyyathidaṃ – devānaṃ vā devattāya, gandhabbānaṃ vā gandhabbattāya, yakkhānaṃ vā yakkhattāya, bhūtānaṃ vā bhūtattāya, manussānaṃ vā manussattāya, catuppadānaṃ vā catuppadattāya, pakkhīnaṃ vā pakkhittāya, sarīsapānaṃ vā sarīsapattāya [siriṃsapānaṃ siriṃsapattāya (sī. syā.)], tesaṃ tesañca hi, ānanda, sattānaṃ tadattāya jāti nābhavissa. Sabbaso jātiyā asati jātinirodhā api nu kho jarāmaraṇaṃ paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo jarāmaraṇassa, yadidaṃ jāti’’.",
      "english": "\"It has been said, 'Aging and death are conditioned by birth.' And Ānanda, this can also be understood in this way: that aging and death are conditioned by birth. If, Ānanda, birth were entirely and utterly absent for anyone, anywhere, in any way—that is, for devas in their state as devas, for gandhabbas in their state as gandhabbas, for yakkhas in their state as yakkhas, for bhūtas in their state as bhūtas, for humans in their state as humans, for quadrupeds in their state as quadrupeds, for birds in their state as birds, for serpents in their state as serpents—if birth into these respective states did not exist for those beings, then with the complete absence and cessation of birth, would aging and death be discernible?\" \"No, venerable sir.\" \"Therefore, Ānanda, this very thing—birth—is the cause, the origin, the source, the condition for aging and death.\"",
      "sinhala": "‘ජාතිය හේතුවෙන් ජරාව හා මරණය ඇති වේ’ යනු එසේ වදාළ දෙයකි. ආනන්ද, ජාතිය හේතුවෙන් ජරාව හා මරණය ඇති වන ආකාරය තේරුම්ගත යුත්තේ මේ ක්‍රමයෙනි. ආනන්ද, සම්පූර්ණයෙන්ම, සෑම අතින්ම, කිසිවකුට, කිසි තැනක හෝ කිසි ලෙසකින්වත් ජාතියක් හට නොගත්තේ නම්, එනම් දෙවියන්ට දෙවියන්ගේ භවය සඳහා, ගාන්ධර්වයන්ට ගාන්ධර්ව භවය සඳහා, යක්ෂයන්ට යක්ෂ භවය සඳහා, භූතයන්ට භූත භවය සඳහා, මනුෂ්‍යයන්ට මනුෂ්‍ය භවය සඳහා, සිව්පාවුන්ට සිව්පා භවය සඳහා, පක්ෂීන්ට පක්ෂි භවය සඳහා, සර්පයන්ට සර්ප භවය සඳහා, ආනන්ද, ඒ ඒ සත්වයන්ට ඒ ඒ භවයන් සඳහා ජාතියක් හට නොගන්නේ නම්, සම්පූර්ණයෙන්ම ජාතිය නැති වූ විට, ජාතිය නිරුද්ධ වීමෙන් ජරාව හා මරණය පෙනී යන්නේද?\"\n\n\"භාග්‍යවතුන් වහන්ස, එය එසේ නොවේ.\"\n\n\"එබැවින් ආනන්ද, ජාතිය යනු ජරාව හා මරණයට හේතුව, නිදානය, සමුදය සහ ප්‍රත්‍යය වේ.\"",
      "paliTitle": ""
    },
    {
      "number": 99,
      "pali": "‘‘‘Bhavapaccayā jātī’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā bhavapaccayā jāti. Bhavo ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, seyyathidaṃ – kāmabhavo vā rūpabhavo vā arūpabhavo vā, sabbaso bhave asati bhavanirodhā api nu kho jāti paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo jātiyā, yadidaṃ bhavo’’.",
      "english": "\"`Birth is conditioned by becoming.’ As it has been said, Ananda, this should be understood in this way: birth is conditioned by becoming. For if there were no becoming at all, Ananda—in any way, shape, or form; for anyone, in any respect; that is, no becoming in the realm of desire, the realm of form, or the formless realm—then with the complete absence and cessation of becoming, would birth be evident?\" \"No, venerable sir.\" \"Therefore, Ananda, becoming is the cause, the origin, the arising, and the condition for birth.\"",
      "sinhala": "‘‘‘භවය හේතුවෙන් ජාතිය ඇති වේ’ යැයි මෙසේ වදාළේය. ආනන්දය, එබැවින් භවය හේතුවෙන් ජාතිය ඇති වන බව මේ ආකාරයෙන් දත යුතුය. ආනන්දය, කාම භවය, රූප භවය හෝ අරූප භවය යන කිසිදු භවයක් කිසිවෙකුට කොතැනකදීවත් කිසි ආකාරයකින්වත් සම්පූර්ණයෙන්ම නොපවතින්නේ නම්, මුළුමනින්ම භවය නොමැති කල්හි භව නිරෝධයෙන් ජාතියක් පෙනේ දැයි?’’ ‘‘භාග්‍යවතුන් වහන්ස, එසේ නොවේ’’. ‘‘ආනන්දය, එබැවින් ජාතිය ඇතිවීමට හේතුව, ප්‍රභවය, හටගැනීම සහ ප්‍රත්‍යය භවයම වේ’’.",
      "paliTitle": ""
    },
    {
      "number": 100,
      "pali": "‘‘‘Upādānapaccayā bhavo’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā upādānapaccayā bhavo. Upādānañca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, seyyathidaṃ – kāmupādānaṃ vā diṭṭhupādānaṃ vā sīlabbatupādānaṃ vā attavādupādānaṃ vā, sabbaso upādāne asati upādānanirodhā api nu kho bhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo bhavassa, yadidaṃ upādānaṃ’’.",
      "english": "Ānanda, it has been said that clinging is a condition for becoming. And Ānanda, this can also be understood in this way: clinging is a condition for becoming. For if there were no clinging whatsoever, of any kind, for anyone, in any way—that is, no clinging to sensual pleasures, no clinging to views, no clinging to rites and rituals, and no clinging to a doctrine of self—then in the complete absence and cessation of clinging, would becoming be evident?\" \"No, venerable sir.\" \"Therefore, Ānanda, clinging is the cause, the origin, the arising, and the condition for becoming.",
      "sinhala": "‘උපාදාන ප්‍රත්‍යය නිසා භවය හටගනී’ යනුවෙන් මෙය වදාළ සේක. ආනන්ද, උපාදාන ප්‍රත්‍යය නිසා භවය හටගන්නා ආකාරය මේ අයුරින් ද තේරුම්ගත යුතුයි. ආනන්ද, යම් හෙයකින් කිසිවකුට කිසිම දෙයක, කිසිදු අයුරකින්, කිසිම ආකාරයකින් උපාදානයක් නොවන්නේ නම් – එනම්, කාමෝපාදානයක් වේවා, දිට්ඨුපාදානයක් වේවා, සීලබ්බතූපාදානයක් වේවා, අත්තවාදුපාදානයක් වේවා – මෙසේ සියලු ලෙසින්ම උපාදානයන් නැති වී, උපාදාන නිරෝධය සිදු වුවහොත් භවය ප්‍රකට වේද? භාග්‍යවතුන් වහන්ස, එසේ නොවේ. එබැවින් ආනන්ද, මේ උපාදානයම භවයට හේතුවයි, එයම නිදානයයි, එයම සමුදයයි, එයම ප්‍රත්‍යයයි.",
      "paliTitle": ""
    },
    {
      "number": 101,
      "pali": "‘‘‘Taṇhāpaccayā upādāna’nti iti kho panetaṃ vuttaṃ tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā taṇhāpaccayā upādānaṃ. Taṇhā ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, seyyathidaṃ – rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā, sabbaso taṇhāya asati taṇhānirodhā api nu kho upādānaṃ paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo upādānassa, yadidaṃ taṇhā’’.",
      "english": "\"‘Clinging is conditioned by craving’—as it has been said, Ānanda, this is how it should be understood: clinging is conditioned by craving. If there were no craving at all, Ānanda, in any way, for anything, such as craving for forms, craving for sounds, craving for smells, craving for tastes, craving for tactile sensations, craving for mental objects—if craving were entirely absent and had ceased, would clinging be found?” “No, venerable sir.” “Therefore, Ānanda, craving is indeed the cause, the origin, the arising, the condition for clinging.\"",
      "sinhala": "‘‘ආනන්ද, ‘තණ්හාව හේතුවෙන් උපාදානය හටගනී’ යැයි කියන ලදී. ආනන්ද, තණ්හාව හේතුවෙන් උපාදානය හටගන්නේ කෙසේද යන්න මෙලෙස ද තේරුම් ගත යුතුයි. යම් පුද්ගලයෙකුට රූප තණ්හා, ශබ්ද තණ්හා, ගන්ධ තණ්හා, රස තණ්හා, ස්පර්ශ තණ්හා, ධම්ම තණ්හා යන කිසිදු තණ්හාවක් කිසිම අයුරකින්, කිසිම දෙයක් කෙරෙහි, කිසිසේත්ම නැතිනම්, තණ්හාව මුළුමනින්ම නැති වූ විට, තණ්හාව නිරුද්ධ වූ විට, උපාදානයක් පැනනඟීදැ’’යි? ‘‘භාග්‍යවතුන් වහන්ස, එසේ නොවේ.’’ ‘‘ආනන්ද, එබැවින්, උපාදානයට මෙයම හේතුව වෙයි, මෙයම නිදානය වෙයි, මෙයම සමුදය වෙයි, මෙයම ප්‍රත්‍යය වෙයි. එනම්, තණ්හාවයි.’’",
      "paliTitle": ""
    },
    {
      "number": 102,
      "pali": "‘‘‘Vedanāpaccayā taṇhā’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā vedanāpaccayā taṇhā. Vedanā ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, seyyathidaṃ – cakkhusamphassajā vedanā sotasamphassajā vedanā ghānasamphassajā vedanā jivhāsamphassajā vedanā kāyasamphassajā vedanā manosamphassajā vedanā, sabbaso vedanāya asati vedanānirodhā api nu kho taṇhā paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo taṇhāya, yadidaṃ vedanā’’.",
      "english": "\"‘Feeling is the condition for craving’ – this has been said. And Ānanda, it should be understood in this way: that feeling is the condition for craving. For if feeling were entirely and utterly absent for anyone, in every way – that is, feeling born of eye-contact, feeling born of ear-contact, feeling born of nose-contact, feeling born of tongue-contact, feeling born of body-contact, feeling born of mind-contact – if feeling were completely absent, if feeling were to cease, would craving be discerned?” “No, venerable sir.” “Therefore, Ānanda, this very feeling is the cause, the source, the origin, the condition for craving.\"",
      "sinhala": "‘‘‘වේදනා ප්‍රත්‍යය නිසා තණ්හාව හටගනී’ යනු මෙසේ වදාළ දෙයකි. ආනන්දය, වේදනා ප්‍රත්‍යය නිසා තණ්හාව හටගන්නා ආකාරය මෙලෙසින් දත යුතුයි. ආනන්දය, යම්කිසි කෙනෙකුට කිසිම දෙයකින්, කිසිම ආකාරයකින්, මුළුමනින්ම වේදනාවක් නොපවතින්නේ නම්, එනම් චක්ඛු සම්ඵස්සයෙන් හටගන්නා වේදනාව, සෝත සම්ඵස්සයෙන් හටගන්නා වේදනාව, ඝාණ සම්ඵස්සයෙන් හටගන්නා වේදනාව, ජිව්හා සම්ඵස්සයෙන් හටගන්නා වේදනාව, කාය සම්ඵස්සයෙන් හටගන්නා වේදනාව, මනෝ සම්ඵස්සයෙන් හටගන්නා වේදනාව යන වේදනා සම්පූර්ණයෙන්ම නොපවතී නම්, වේදනාව නිරුද්ධ වූ කල්හි, තණ්හාව පැනනඟීදැ’’යි? ‘‘භාග්‍යවතුන් වහන්ස, එසේ නොවේ.’’ ‘‘ආනන්දය, එහෙයින් මෙයම හේතුවයි, මෙයම නිදානයයි, මෙයම සමුදයයි, මෙයම තණ්හාවට ප්‍රත්‍යයයි. එනම් වේදනාවයි.’’",
      "paliTitle": ""
    },
    {
      "number": 103,
      "pali": "‘‘Iti kho panetaṃ, ānanda, vedanaṃ paṭicca taṇhā, taṇhaṃ paṭicca pariyesanā, pariyesanaṃ paṭicca lābho, lābhaṃ paṭicca vinicchayo, vinicchayaṃ paṭicca chandarāgo, chandarāgaṃ paṭicca ajjhosānaṃ, ajjhosānaṃ paṭicca pariggaho, pariggahaṃ paṭicca macchariyaṃ, macchariyaṃ paṭicca ārakkho. Ārakkhādhikaraṇaṃ daṇḍādānasatthādānakalahaviggahavivādatuvaṃtuvaṃpesuññamusāvādā aneke pāpakā akusalā dhammā sambhavanti.",
      "english": "\"And so, Ānanda, conditioned by feeling comes craving; conditioned by craving, seeking; conditioned by seeking, acquisition; conditioned by acquisition, ascertainment; conditioned by ascertainment, desire and lust; conditioned by desire and lust, attachment; conditioned by attachment, possessiveness; conditioned by possessiveness, miserliness; conditioned by miserliness, guarding. Based on guarding, many evil and unwholesome things arise: taking up sticks and weapons, quarrels, conflicts, disputes, accusations, divisive speech, and false speech.\"",
      "sinhala": "ආනන්දය, මෙසේ වේදනාව හේතු කොට ගෙන තෘෂ්ණාව ද, තෘෂ්ණාව හේතු කොට ගෙන සෙවීම ද, සෙවීම හේතු කොට ගෙන ලාභය ද, ලාභය හේතු කොට ගෙන විනිශ්චය ද, විනිශ්චය හේතු කොට ගෙන ඡන්දරාගය ද, ඡන්දරාගය හේතු කොට ගෙන අධ්‍යවසානය ද, අධ්‍යවසානය හේතු කොට ගෙන පරිග්‍රහය ද, පරිග්‍රහය හේතු කොට ගෙන මසුරුකම ද, මසුරුකම හේතු කොට ගෙන ආරක්ෂාව ද ඇති වේ.\n\nආරක්ෂාව හේතු කොට ගෙන දඬු මුගුරු ගැනීම, ආයුධ ගැනීම, කලහ කිරීම, විග්‍රහ කිරීම, විවාද කිරීම, තෝ තෝ යැයි බැන වැදීම, කේලාම් කීම, මුසාවාද කීම වැනි බොහෝ පාපී අකුසල ධර්ම හට ගනී.",
      "paliTitle": ""
    },
    {
      "number": 104,
      "pali": "‘‘‘Ārakkhādhikaraṇaṃ [ārakkhaṃ paṭicca ārakkhādhikaraṇaṃ (syā.)] daṇḍādānasatthādānakalahaviggahavivādatuvaṃtuvaṃpesuññamusāvādā aneke pāpakā akusalā dhammā sambhavantī’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā ārakkhādhikaraṇaṃ daṇḍādānasatthādānakalahaviggahavivādatuvaṃtuvaṃpesuññamusāvādā aneke pāpakā akusalā dhammā sambhavanti. Ārakkho ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso ārakkhe asati ārakkhanirodhā api nu kho sambhaveyyu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo daṇḍādānasatthādānakalahaviggahavivādatuvaṃtuvaṃpesuññamusāvādānaṃ anekesaṃ pāpakānaṃ akusalānaṃ dhammānaṃ sambhavāya yadidaṃ ārakkho.",
      "english": "\"It has been said that 'conditioned by protection, the taking up of sticks, the taking up of weapons, quarrels, strife, disputes, mutual accusations, malicious gossip, and false speech – many evil, unwholesome states arise.' Therefore, Ananda, by this line of reasoning, it should also be understood how, conditioned by protection, the taking up of sticks, the taking up of weapons, quarrels, strife, disputes, mutual accusations, malicious gossip, and false speech – many evil, unwholesome states arise. Indeed, Ananda, if protection did not exist at all, in any way, for anyone, concerning anything, with the complete absence of protection, with the cessation of protection, would they arise?” “No, Bhante.” “Therefore, Ananda, this protection itself is the cause, this is the origin, this is the source, this is the condition for the arising of the taking up of sticks, the taking up of weapons, quarrels, strife, disputes, mutual accusations, malicious gossip, and false speech – many evil, unwholesome states.\"",
      "sinhala": "‘‘‘ආරක්ෂාව හේතුකොටගෙන දඬු අතට ගැනීම, ආයුධ අතට ගැනීම, කලහ කිරීම්, භේද ඇති කිරීම්, විවාද කිරීම්, එකිනෙකාට චෝදනා කිරීම්, කේලාම් කීම, බොරු කීම යන අනේකවිධ පාපී අකුසල ධර්මයන් හටගනී’ යැයි මෙසේ වදාළ සේක. ආනන්දය, ආරක්ෂාව හේතුකොටගෙන දඬු අතට ගැනීම, ආයුධ අතට ගැනීම, කලහ කිරීම්, භේද ඇති කිරීම්, විවාද කිරීම්, එකිනෙකාට චෝදනා කිරීම්, කේලාම් කීම, බොරු කීම යන අනේකවිධ පාපී අකුසල ධර්මයන් හටගන්නා බව මේ ආකාරයෙන් දත යුතුයි.\n\nආනන්දය, යම් හෙයකින් කිසිවෙකුට, කිසිම දෙයක් සම්බන්ධයෙන්, කිසිම අයුරකින් ආරක්ෂාවක් නොතිබුණේ නම්, ආරක්ෂාව මුළුමනින්ම නැති වූ කල්හි, ආරක්ෂාව නිරුද්ධ වීමෙන් ඒවා හටගනීවිද?” “නැත, භාග්‍යවතුන් වහන්ස.”\n\nඑහෙයින් ආනන්දය, දඬු අතට ගැනීම්, ආයුධ අතට ගැනීම්, කලහ කිරීම්, භේද ඇති කිරීම්, විවාද කිරීම්, එකිනෙකාට චෝදනා කිරීම්, කේලාම් කීම, බොරු කීම යන අනේකවිධ පාපී අකුසල ධර්මයන් හටගැනීමට හේතුව, නිදානය, සමුදය සහ ප්‍රත්‍යය වන්නේ යම් මේ ආරක්ෂාවද එයයි.",
      "paliTitle": ""
    },
    {
      "number": 105,
      "pali": "‘‘‘Macchariyaṃ paṭicca ārakkho’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā macchariyaṃ paṭicca ārakkho. Macchariyañca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso macchariye asati macchariyanirodhā api nu kho ārakkho paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo ārakkhassa, yadidaṃ macchariyaṃ’’.",
      "english": "\"‘Protection arises dependent on stinginess’—this has been said. Therefore, Ānanda, through this line of reasoning, it should also be understood how protection arises dependent on stinginess. Now, Ānanda, if stinginess did not exist at all, in every way, for anyone, regarding anything whatsoever, then with the complete absence of stinginess, with the cessation of stinginess, would protection be apparent?” “No, venerable sir.” “Therefore, Ānanda, stinginess is the cause, the source, the origin, and the condition for protection.\"",
      "sinhala": "‘මසුරුකම හේතුවෙන් ආරක්ෂාව ඇති වේ’ යැයි මෙය වදාළ සේක. ආනන්ද, මසුරුකම හේතුවෙන් ආරක්ෂාව ඇති වන ආකාරය මෙලෙසද දත යුතුයි. ආනන්ද, යම් කිසිවෙකුට කිසිවක් කෙරෙහි කිසිම ආකාරයකින් මසුරුකමක් කිසිසේත් නොපවතී නම්, මසුරුකම සම්පූර්ණයෙන් නැති වූ විට, මසුරුකම නැතිවීම හේතුවෙන් ආරක්ෂාවක් පැනනඟීද?” “නැත, භාග්‍යවතුන් වහන්ස.” “එහෙයින් ආනන්ද, මේ මසුරුකම ම ආරක්ෂාවට හේතුව වෙයි, නිදානය වෙයි, හටගැනීම වෙයි, ප්‍රත්‍යය වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 106,
      "pali": "‘‘‘Pariggahaṃ paṭicca macchariya’nti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā pariggahaṃ paṭicca macchariyaṃ. Pariggaho ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso pariggahe asati pariggahanirodhā api nu kho macchariyaṃ paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo macchariyassa, yadidaṃ pariggaho’’.",
      "english": "\"It is said, 'Greed arises dependent on possessiveness.' And so, Ānanda, through this line of reasoning, it should be understood how greed arises dependent on possessiveness. For if, Ānanda, there were no possessiveness at all, in any way, shape or form, belonging to anyone regarding anything, and possessiveness were entirely absent, with the cessation of possessiveness, would greed be perceived?\" \"No, venerable sir.\" \"Therefore, Ānanda, this is the reason, this is the source, this is the origin, this is the condition for greed, namely, possessiveness.\"",
      "sinhala": "‘‘‘පරිග්ගහය(අයත් කොට ගැනීම) හේතුකොටගෙන මසුරුකම ඇති වේ’ යැයි මෙසේ වදාළ සේක. ආනන්දය, පරිග්ගහය හේතුකොටගෙන මසුරුකම ඇති වන්නේ කෙසේදැයි මෙලෙස තේරුම්ගත යුතුයි. ආනන්දය, යම්කිසි කෙනෙකුට කිසිම දෙයක්, කිසිම අයුරකින්, කිසිම ආකාරයකින්, සම්පූර්ණයෙන්ම පරිග්ගහයක් නොතිබුණේ නම්, සියලු පරිග්ගහයන් නැති කල්හි, පරිග්ගහය නිරුද්ධ වීමෙන් මසුරුකම දැනේද?’’ \"නැත, භාග්‍යවතුන් වහන්ස.\" ‘‘එබැවින් ආනන්දය, පරිග්ගහයම මසුරුකමට හේතුවයි, නිදානයයි, සමුදයයි, ප්‍රත්‍යයයි.’’",
      "paliTitle": ""
    },
    {
      "number": 107,
      "pali": "‘‘‘Ajjhosānaṃ paṭicca pariggaho’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā ajjhosānaṃ paṭicca pariggaho. Ajjhosānañca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso ajjhosāne asati ajjhosānanirodhā api nu kho pariggaho paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo pariggahassa – yadidaṃ ajjhosānaṃ’’.",
      "english": "It has been said, 'Appropriation arises dependent on prepossession.' And Ānanda, this can also be understood in this way: appropriation arises dependent on prepossession. For if there were absolutely no prepossession whatsoever for anyone, regarding anything, if prepossession were entirely absent, with the cessation of prepossession, would appropriation be discernible at all?\n\n\"No, venerable sir.\"\n\nTherefore, Ānanda, prepossession is the cause, the origin, the arising, the condition for appropriation.",
      "sinhala": "‘‘ඇලුම්කිරීම හේතුවෙන් පරිග්‍රහය හටගනී’’ යැයි මෙසේ කියන ලදී. ආනන්දය, ඇලුම්කිරීම හේතුවෙන් පරිග්‍රහය හටගන්නා ආකාරය මෙලෙසින් ද තේරුම්ගත යුතුයි. ආනන්දය, යම් කිසිවෙකුට කිසිම දෙයකට කිසි ආකාරයකින්වත් ඇලුම්කිරීමක් මුළුමනින්ම නැතිනම්, මුළුමනින්ම ඇලුම්කිරීමක් නොමැති වූ කල, ඇලුම්කිරීම නිරුද්ධ වීමෙන් පරිග්‍රහය පැනනැ‍ඟේද? \"නැත, භාග්‍යවතුන් වහන්ස.\" එහෙයින් ආනන්දය, පරිග්‍රහයට හේතුව, නිදානය, සමුදය සහ ප්‍රත්‍යය වන්නේ මේ ඇලුම්කිරීමමය.",
      "paliTitle": ""
    },
    {
      "number": 108,
      "pali": "‘‘‘Chandarāgaṃ paṭicca ajjhosāna’nti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā chandarāgaṃ paṭicca ajjhosānaṃ. Chandarāgo ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso chandarāge asati chandarāganirodhā api nu kho ajjhosānaṃ paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo ajjhosānassa, yadidaṃ chandarāgo’’.",
      "english": "\"‘Clinging arises dependent on passionate desire’—this has been said. And so, Ānanda, in this way too it should be understood how clinging arises dependent on passionate desire. For if, Ānanda, passionate desire did not exist at all, in any way, for anyone, regarding anything whatsoever; if passionate desire were completely absent, through the cessation of passionate desire, would clinging be discerned?”\n“No, venerable sir.”\n“Therefore, Ānanda, this—namely, passionate desire—is the cause, this is the origin, this is the arising, this is the condition for clinging.\"",
      "sinhala": "‘‘‘ඡන්දරාගය හේතුකොටගෙන අධ්‍යවසානය (ඇලීම) වේ’ යැයි ඒකාන්තයෙන්ම මෙය කියන ලදී. ආනන්දය, ඡන්දරාගය හේතුකොටගෙන අධ්‍යවසානය ඇතිවන ආකාරය මෙම ක්‍රමයෙන්ද තේරුම්ගත යුතුයි. මක්නිසාද යත්, ආනන්දය, යම්කිසි කෙනෙකුට කිසිම දෙයක කෙරෙහි කිසි ආකාරයකින්වත් ඡන්දරාගය මුළුමනින්ම නැතිනම්, එනම් ඡන්දරාගය සම්පූර්ණයෙන්ම නැති වූ විට, ඡන්දරාගය නිරුද්ධ වීමෙන් අධ්‍යවසානයක් දක්නට ලැබේවිද?\" \"නැත, භාග්‍යවතුන් වහන්ස.\" \"එහෙයින් ආනන්දය, ඡන්දරාගයම අධ්‍යවසානයට හේතුව වේ, එය නිදානය වේ, එය සමුදය වේ, එය ප්‍රත්‍යය වේ.\"",
      "paliTitle": ""
    },
    {
      "number": 109,
      "pali": "‘‘‘Vinicchayaṃ paṭicca chandarāgo’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā vinicchayaṃ paṭicca chandarāgo. Vinicchayo ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso vinicchaye asati vinicchayanirodhā api nu kho chandarāgo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo chandarāgassa, yadidaṃ vinicchayo’’.",
      "english": "\"Indeed,\" it was said, \"passionate desire arises dependent on judgment.\" Therefore, Ananda, through this line of reasoning, it should be understood how passionate desire arises dependent on judgment. For if, Ananda, there were absolutely no judgment at all, in any way, in any respect, for anyone, about anything—if judgment were completely absent and had ceased—would passionate desire be found?\" \"No, venerable sir.\" \"Therefore, Ananda, judgment itself is the cause, the origin, the arising, and the condition for passionate desire.\"",
      "sinhala": "\"‘විනිශ්චය හේතුකොටගෙන ඡන්දරාගය හටගනී’ යනුවෙන් මෙය කියන ලදී. ආනන්ද, විනිශ්චය හේතුකොටගෙන ඡන්දරාගය හටගන්නා ආකාරය මේ පර්යායෙන්ද දත යුතුයි. ආනන්ද, යම් හෙයකින් කිසිවෙකුට කිසිම දෙයක් ගැන කිසිම ආකාරයකින් සම්පූර්ණයෙන් විනිශ්චයක් නැතිනම්, විනිශ්චය සම්පූර්ණයෙන් නැති කල්හි, විනිශ්චය නිරුද්ධ වීමෙන් ඡන්දරාගය පෙනෙන්නට තිබේද?\"\n\"නැත, භාග්‍යවතුන් වහන්ස.\"\n\"එහෙයින් ආනන්ද, විනිශ්චය යනු ඡන්දරාගය හටගැනීමට හේතුව, නිදානය, සමුදය සහ ප්‍රත්‍යය වෙයි.\"",
      "paliTitle": ""
    },
    {
      "number": 110,
      "pali": "‘‘‘Lābhaṃ paṭicca vinicchayo’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā lābhaṃ paṭicca vinicchayo. Lābho ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso lābhe asati lābhanirodhā api nu kho vinicchayo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo vinicchayassa, yadidaṃ lābho’’.",
      "english": "“‘Discernment arises dependent on gain’—this is what was said. And Ānanda, in this way also, it should be understood how discernment arises dependent on gain. For if, Ānanda, gain were altogether and utterly nonexistent, in every way, for anyone, from anything, if gain were completely absent, with the cessation of gain, would discernment be evident?”\n\n“No, venerable sir.”\n\n“Therefore, Ānanda, this is the cause, this is the basis, this is the origin, this is the condition for discernment, that is, gain.”",
      "sinhala": "‘ලාභය හේතු කොට ගෙන විනිශ්චය ඇති වේ’ යනුවෙන් වදාරන ලද්දේ මෙයයි. ආනන්ද, ලාභය හේතු කොට ගෙන විනිශ්චය ඇති වන ආකාරය මෙම කරුණින් ද තේරුම් ගත යුතුයි. ආනන්ද, යම් හෙයකින් කිසිවෙකුට කිසි දෙයකින් කිසි ලෙසකින් වත් ලාභයක් නොතිබුණා නම්, එසේ ලාභය මුළුමනින්ම නැති වූ විට, ලාභය නිරුද්ධ වීම නිසා විනිශ්චයක් ඇති වේ ද? \"නැත, ස්වාමීනි.\" එහෙයින් ආනන්ද, විනිශ්චයට හේතුව, නිදානය, සමුදය සහ ප්‍රත්‍යය වන්නේ මේ ලාභයමයි.",
      "paliTitle": ""
    },
    {
      "number": 111,
      "pali": "‘‘‘Pariyesanaṃ paṭicca lābho’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā pariyesanaṃ paṭicca lābho. Pariyesanā ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, sabbaso pariyesanāya asati pariyesanānirodhā api nu kho lābho paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo lābhassa, yadidaṃ pariyesanā’’.",
      "english": "\"‘Acquisition arises dependent on seeking.’ This, Ananda, has indeed been said. And in this way it should also be understood how acquisition arises dependent on seeking. For if, Ananda, there were absolutely no seeking at all by anyone, in any way, about anything, if seeking were completely absent, if seeking ceased, would acquisition be apparent?” “No, venerable sir.” “Therefore, Ananda, seeking itself is the cause, the origin, the arising, the condition for acquisition.\"",
      "sinhala": "‘පරියේෂණය හේතුවෙන් ලාභය ඇති වේ’ යනුවෙන් මෙය වදාරන ලදී. එහෙයින් ආනන්ද, පරියේෂණය හේතුවෙන් ලාභය ඇති වන ආකාරය මේ ක්‍රමයෙන් ද තේරුම් ගත යුතුයි. ආනන්ද, කිසිවෙකුට කිසිම දෙයක් ගැන සම්පූර්ණයෙන් ම, කිසිම අයුරකින් පරියේෂණයක් නොතිබුණා නම්, එනම් පරියේෂණය මුළුමනින් ම නැති වූ විට, පරියේෂණය නිරුද්ධ වීමෙන් ලාභයක් ඇති වේ ද?\" \"භාග්‍යවතුන් වහන්ස, එසේ නොවේ.\" \"එහෙයින් ආනන්ද, ලාභය ඇති වීමට හේතුව මෙයම ය, නිදානය මෙයම ය, සමුදය මෙයම ය, ප්‍රත්‍යය මෙයම ය. එනම්, පරියේෂණයයි.\"",
      "paliTitle": ""
    },
    {
      "number": 112,
      "pali": "‘‘‘Taṇhaṃ paṭicca pariyesanā’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā taṇhaṃ paṭicca pariyesanā. Taṇhā ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, seyyathidaṃ – kāmataṇhā bhavataṇhā vibhavataṇhā, sabbaso taṇhāya asati taṇhānirodhā api nu kho pariyesanā paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo pariyesanāya, yadidaṃ taṇhā. Iti kho, ānanda, ime dve dhammā [ime dhammā (ka.)] dvayena vedanāya ekasamosaraṇā bhavanti’’.",
      "english": "\"The statement, 'seeking is conditioned by craving,' has indeed been made. Therefore, Ananda, you should understand through this reasoning how seeking is conditioned by craving. For if, Ananda, craving were not to exist at all, in every way, entirely, for anyone, in anything—that is to say, craving for sensual pleasures, craving for existence, craving for non-existence—if craving were completely absent, if craving ceased, would seeking be found?\"\n\n\"No, venerable sir.\"\n\n\"Therefore, Ananda, craving is truly the cause, the origin, the arising, the condition for seeking. Thus, Ananda, these two phenomena converge through a duality of feeling.\"",
      "sinhala": "‘තණ්හාව හේතු කොට ගෙන සෙවීමක් ඇතැ’යි යන්න මෙසේ කියන ලද්දේ ය. ආනන්දය, තණ්හාව හේතු කොට ගෙන සෙවීම සිදුවන්නේ කෙසේදැයි ඔබ මේ ආකාරයෙන් දැනගත යුතුයි. ආනන්දය, යම් කෙනෙකුට කවර දෙයක් කෙරෙහි හෝ, කිසිම ආකාරයකින් හෝ, කිසිදු තණ්හාවක්, එනම් කාම තණ්හා, භව තණ්හා, විභව තණ්හා යන තණ්හා, මුළුමනින්ම සර්වප්‍රකාරයෙන්ම නැතිනම්, තණ්හාව මුළුමනින්ම නැති වී, නිරුද්ධ වූ විට සෙවීමක් පෙනේද?\"\n\n\"නැත, භාග්‍යවතුන් වහන්ස.\"\n\n\"එහෙයින් ආනන්දය, සෙවීමට හේතුව මෙයයි. නිදානය මෙයයි. සමුදය මෙයයි. ප්‍රත්‍යය මෙයයි. එනම් තණ්හාවයි. ඉතින් ආනන්දය, මේ ධර්ම දෙක වේදනාව සමඟ යුගලක් ලෙස එක තැනකට එක්වෙයි.\"",
      "paliTitle": ""
    },
    {
      "number": 113,
      "pali": "‘‘‘Phassapaccayā vedanā’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā ‘phassapaccayā vedanā. Phasso ca hi, ānanda, nābhavissa sabbena sabbaṃ sabbathā sabbaṃ kassaci kimhici, seyyathidaṃ – cakkhusamphasso sotasamphasso ghānasamphasso jivhāsamphasso kāyasamphasso manosamphasso, sabbaso phasse asati phassanirodhā api nu kho vedanā paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo vedanāya, yadidaṃ phasso’’.",
      "english": "\"’Contact is the condition for feeling’ – this has indeed been stated. Therefore, Ananda, it should also be understood in this way how ‘contact is the condition for feeling.’ For if contact were completely, in every way, and universally non-existent for anyone in anything – that is, eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, and mind-contact – with contact being entirely absent and with the cessation of contact, would feeling be discernible?”\n\n“No, venerable sir.”\n\n“Therefore, Ananda, this alone is the cause, this the source, this the origin, this the condition for feeling; namely, contact.”",
      "sinhala": "‘‘‘ඵස්සපච්චයා වේදනා’ යැයි මෙසේ වදාළහ. ආනන්ද, ‘ඵස්සපච්චයා වේදනා’ යන මේ කරුණ ද මෙලෙසින් ම තේරුම් ගත යුතුයි. ආනන්ද, යම් හෙයකින් කිසිවෙකුට කිසිම දෙයකින් හෝ කිසිම ආකාරයකින් හෝ ඵස්සය, එනම් චක්ඛුසම්ඵස්ස, සෝතසම්ඵස්ස, ඝානසම්ඵස්ස, ජිව්හාසම්ඵස්ස, කායසම්ඵස්ස, මනෝසම්ඵස්ස යන ඵස්සයන් මුළුමනින් ම, සියලු අයුරින් ම, සියලු ආකාරයෙන් ම නොපවතින්නේ නම්, සම්පූර්ණයෙන් ම ඵස්සය නොමැති කල්හි ඵස්ස නිරෝධය හේතුවෙන් වේදනාව පැන නඟී ද?\" \"භාග්‍යවතුන් වහන්ස, එසේ නොවේ.\" \"ආනන්ද, එබැවින් ඵස්සය වේදනාවට හේතුව ය, නිධානය ය, හටගැනීම ය, ප්‍රත්‍යය ය.\"",
      "paliTitle": ""
    },
    {
      "number": 114,
      "pali": "‘‘‘Nāmarūpapaccayā phasso’ti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā nāmarūpapaccayā phasso. Yehi, ānanda, ākārehi yehi liṅgehi yehi nimittehi yehi uddesehi nāmakāyassa paññatti hoti, tesu ākāresu tesu liṅgesu tesu nimittesu tesu uddesesu asati api nu kho rūpakāye adhivacanasamphasso paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yehi, ānanda, ākārehi yehi liṅgehi yehi nimittehi yehi uddesehi rūpakāyassa paññatti hoti, tesu ākāresu…pe… tesu uddesesu asati api nu kho nāmakāye paṭighasamphasso paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yehi, ānanda, ākārehi…pe… yehi uddesehi nāmakāyassa ca rūpakāyassa ca paññatti hoti, tesu ākāresu…pe… tesu uddesesu asati api nu kho adhivacanasamphasso vā paṭighasamphasso vā paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yehi, ānanda, ākārehi…pe… yehi uddesehi nāmarūpassa paññatti hoti, tesu ākāresu …pe… tesu uddesesu asati api nu kho phasso paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo phassassa, yadidaṃ nāmarūpaṃ’’.",
      "english": "“‘Contact is conditioned by name-and-form’—as it has been said. Therefore, Ānanda, it should be understood in this way: that contact is conditioned by name-and-form. Ānanda, if those aspects, features, signs, and designations by which a concept of the name-body is defined were absent, would cognitive contact be discernible in the form-body?” “No, venerable sir.” “Ānanda, if those aspects, features, signs, and designations by which a concept of the form-body is defined were absent, would sensory contact be discernible in the name-body?” “No, venerable sir.” “Ānanda, if those aspects, features, signs, and designations by which a concept of both the name-body and the form-body is defined were absent, would either cognitive contact or sensory contact be discernible?” “No, venerable sir.” “Ānanda, if those aspects, features, signs, and designations by which a concept of name-and-form is defined were absent, would contact be discernible?” “No, venerable sir.” “Therefore, Ānanda, this is the cause, this is the origin, this is the arising, this is the condition for contact, that is, name-and-form.”",
      "sinhala": "‘නාමරූප ප්‍රත්‍යයෙන් ස්පර්ශය හටගනී’ යැයි මෙසේ කියන ලද්දකි. ආනන්දය, නාමරූපය ප්‍රත්‍යවීමෙන් ස්පර්ශය ඇති වන බව මෙලෙස දත යුතුයි. ආනන්දය, යම් ආකාර, ලිංග, නිමිති හා අදහස්වලින් නාමකාය හඳුන්වනු ලැබේද, එම ආකාර, ලිංග, නිමිති හා අදහස් නොමැති විට රූපකායෙහි අධිවචන ස්පර්ශයක් දක්නට ලැබේද?\" \"නැත, ස්වාමීනි.\"\n\n\"ආනන්දය, යම් ආකාර, ලිංග, නිමිති හා අදහස්වලින් රූපකාය හඳුන්වනු ලැබේද, එම ආකාර, ලිංග, නිමිති හා අදහස් නොමැති විට නාමකායෙහි ප්‍රතිඝ ස්පර්ශයක් දක්නට ලැබේද?\" \"නැත, ස්වාමීනි.\"\n\n\"ආනන්දය, යම් ආකාර, ලිංග, නිමිති හා අදහස්වලින් නාමකාය සහ රූපකාය හඳුන්වනු ලැබේද, එම ආකාර, ලිංග, නිමිති හා අදහස් නොමැති විට අධිවචන ස්පර්ශයක් හෝ ප්‍රතිඝ ස්පර්ශයක් දක්නට ලැබේද?\" \"නැත, ස්වාමීනි.\"\n\n\"ආනන්දය, යම් ආකාර, ලිංග, නිමිති හා අදහස්වලින් නාමරූපය හඳුන්වනු ලැබේද, එම ආකාර, ලිංග, නිමිති හා අදහස් නොමැති විට ස්පර්ශය දක්නට ලැබේද?\" \"නැත, ස්වාමීනි.\"\n\n\"එහෙයින් ආනන්දය, ස්පර්ශය හටගැනීමට හේතුව, නිදානය, සමුදය සහ ප්‍රත්‍යය වන්නේ නාමරූපයයි.\"",
      "paliTitle": ""
    },
    {
      "number": 115,
      "pali": "‘‘‘Viññāṇapaccayā nāmarūpa’nti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā viññāṇapaccayā nāmarūpaṃ. Viññāṇañca hi, ānanda, mātukucchismiṃ na okkamissatha, api nu kho nāmarūpaṃ mātukucchismiṃ samuccissathā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Viññāṇañca hi, ānanda, mātukucchismiṃ okkamitvā vokkamissatha, api nu kho nāmarūpaṃ itthattāya abhinibbattissathā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Viññāṇañca hi, ānanda, daharasseva sato vocchijjissatha kumārakassa vā kumārikāya vā, api nu kho nāmarūpaṃ vuddhiṃ virūḷhiṃ vepullaṃ āpajjissathā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo nāmarūpassa – yadidaṃ viññāṇaṃ’’.",
      "english": "\"‘Dependent on consciousness is name-and-form’—this is what has been said. And so, Ananda, it should be understood in this way: name-and-form is dependent on consciousness.\n\n\"If, Ananda, consciousness were not to descend into a mother's womb, would name-and-form take shape in that womb?\" \"No, venerable sir.\"\n\n\"And if, Ananda, after descending into a mother's womb, consciousness were to depart, would name-and-form develop into this state of being?\" \"No, venerable sir.\"\n\n\"And if, Ananda, consciousness were to be cut off from a young boy or girl, would name-and-form attain growth, increase, or fullness?\" \"No, venerable sir.\"\n\n\"Therefore, Ananda, this is the cause, this is the origin, this is the arising, this is the condition for name-and-form: that is, consciousness.\"",
      "sinhala": "‘‘‘විඤ්ඤාණය ප්‍රත්‍යය වීමෙන් නාමරූප හටගනී’ යැයි වදාළ සේක. ආනන්ද, විඤ්ඤාණය ප්‍රත්‍යය වීමෙන් නාමරූප හටගන්නා ආකාරය මෙලෙස දැනගත යුතුයි.\n\nආනන්ද, විඤ්ඤාණය මවගේ කුස තුළට ඇතුළු නොවන්නේ නම්, නාමරූප මවගේ කුස තුළ හටගන්නේ ද?\" \"නැත, භාග්‍යවතුන් වහන්ස.\"\n\nආනන්ද, විඤ්ඤාණය මවගේ කුස තුළට ඇතුළු වී ඉන්පසු ඉවත්ව යන්නේ නම්, නාමරූප මෙලෙස ඇතිවන්නේ ද?\" \"නැත, භාග්‍යවතුන් වහන්ස.\"\n\nආනන්ද, කුඩා දරුවකුගේ හෝ දැරියකගේ විඤ්ඤාණය ඉක්මනින්ම සිඳී යන්නේ නම්, නාමරූප වර්ධනයට, ප්‍රවර්ධනයට හා විශාලත්වයට පැමිණෙන්නේ ද?\" \"නැත, භාග්‍යවතුන් වහන්ස.\"\n\nආනන්ද, එබැවින් නාමරූපවලට හේතුව මෙයයි. නිධානය මෙයයි. හටගැනීම මෙයයි. ප්‍රත්‍යය මෙයයි. එනම් විඤ්ඤාණයයි.\"",
      "paliTitle": ""
    },
    {
      "number": 116,
      "pali": "‘‘‘Nāmarūpapaccayā viññāṇa’nti iti kho panetaṃ vuttaṃ, tadānanda, imināpetaṃ pariyāyena veditabbaṃ, yathā nāmarūpapaccayā viññāṇaṃ. Viññāṇañca hi, ānanda, nāmarūpe patiṭṭhaṃ na labhissatha, api nu kho āyatiṃ jātijarāmaraṇaṃ dukkhasamudayasambhavo [jātijarāmaraṇadukkhasamudayasambhavo (sī. syā. pī.)] paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, eseva hetu etaṃ nidānaṃ esa samudayo esa paccayo viññāṇassa yadidaṃ nāmarūpaṃ. Ettāvatā kho, ānanda, jāyetha vā jīyetha [jiyyetha (ka.)] vā mīyetha [miyyetha (ka.)] vā cavetha vā upapajjetha vā. Ettāvatā adhivacanapatho, ettāvatā niruttipatho, ettāvatā paññattipatho, ettāvatā paññāvacaraṃ, ettāvatā vaṭṭaṃ vattati itthattaṃ paññāpanāya yadidaṃ nāmarūpaṃ saha viññāṇena aññamaññapaccayatā pavattati.",
      "english": "\"‘Consciousness is conditioned by name-and-form’ – this has indeed been stated. And thus, Ananda, it should also be understood in this way how consciousness is conditioned by name-and-form. For if consciousness, Ananda, did not find a foundation in name-and-form, would there be a manifestation of future birth, aging, and death, the arising and origin of suffering?\" \"No, venerable sir.\" \"Therefore, Ananda, this is the cause, this is the origin, this is the arising, this is the condition for consciousness, that is, name-and-form. To this extent, Ananda, one might be born, age, die, pass away, or be reborn. To this extent extends the path of designation, to this extent extends the path of language, to this extent extends the path of conceptualization, to this extent is the range of wisdom, to this extent does the cycle of existence turn for the establishing of this ‘individuality’, that is, name-and-form together with consciousness proceed in mutual conditionality.\"",
      "sinhala": "‘‘‘නාමරූප ප්‍රත්‍යය නිසා විඤ්ඤාණය හටගනී’ යනුවෙන් මෙය වදාළ සේක. ආනන්ද, නාමරූප ප්‍රත්‍යය හේතුවෙන් විඤ්ඤාණය හටගන්නා ආකාරය මෙයින් දත යුතුයි. ආනන්ද, විඤ්ඤාණය නාමරූපයෙහි පිහිටීමක් නොලැබුණහොත්, අනාගතයේදී ජාති, ජරා, මරණ දුක්ඛ සමුදාය පැනනැඟේද?” “නැත, භාග්‍යවතුන් වහන්ස.” “එහෙයින් ආනන්ද, විඤ්ඤාණයට හේතුව මෙයමයි. එනම් මේ නාමරූපයමයි. නිදානය මෙයමයි. සමුදය මෙයමයි. ප්‍රත්‍යය මෙයමයි. ආනන්ද, මෙපමණකින්ම ඉපදීම, ජරාවට පත්වීම, මිය යාම, චුත වීම, නැවත ඉපදීම සිදුවේ. අධිවචන මාර්ගය වන්නේ මෙපමණකි. නිරුක්ති මාර්ගය වන්නේ මෙපමණකි. ප්‍රඥප්ති මාර්ගය වන්නේ මෙපමණකි. ප්‍රඥාවේ විෂය වන්නේ මෙපමණකි. සත්ත්වයාගේ ස්වභාවය හෙළි කිරීම පිණිස, නාමරූපය විඤ්ඤාණය හා සමඟ අන්‍යෝන්‍ය ප්‍රත්‍යයෙන් පවතින බව වූ මේ සසර මෙපමණකින් පවතී.”",
      "paliTitle": ""
    },
    {
      "number": 117,
      "pali": "‘‘Kittāvatā ca, ānanda, attānaṃ paññapento paññapeti? Rūpiṃ vā hi, ānanda, parittaṃ attānaṃ paññapento paññapeti – ‘‘rūpī me paritto attā’’ti. Rūpiṃ vā hi, ānanda, anantaṃ attānaṃ paññapento paññapeti – ‘rūpī me ananto attā’ti. Arūpiṃ vā hi, ānanda, parittaṃ attānaṃ paññapento paññapeti – ‘arūpī me paritto attā’ti. Arūpiṃ vā hi, ānanda, anantaṃ attānaṃ paññapento paññapeti – ‘arūpī me ananto attā’ti.",
      "english": "And how, Ananda, does one define a self? It is when, Ananda, one defines a self as material and limited, thinking, 'My self is material and limited.' Or when, Ananda, one defines a self as material and infinite, thinking, 'My self is material and infinite.' Or when, Ananda, one defines a self as immaterial and limited, thinking, 'My self is immaterial and limited.' Or when, Ananda, one defines a self as immaterial and infinite, thinking, 'My self is immaterial and infinite.'",
      "sinhala": "ආනන්ද, කෙසේ නම් තමා ප්‍රකාශ කරන්නේද? ආනන්ද, රූපී වූ, කුඩා ආත්මයක් ලෙස තමා ප්‍රකාශ කරන්නේ 'මාගේ ආත්මය රූපී, කුඩා' යනුවෙනි. ආනන්ද, රූපී වූ, අනන්ත ආත්මයක් ලෙස තමා ප්‍රකාශ කරන්නේ 'මාගේ ආත්මය රූපී, අනන්ත' යනුවෙනි. ආනන්ද, අරූපී වූ, කුඩා ආත්මයක් ලෙස තමා ප්‍රකාශ කරන්නේ 'මාගේ ආත්මය අරූපී, කුඩා' යනුවෙනි. ආනන්ද, අරූපී වූ, අනන්ත ආත්මයක් ලෙස තමා ප්‍රකාශ කරන්නේ 'මාගේ ආත්මය අරූපී, අනන්ත' යනුවෙනි.",
      "paliTitle": "Attapaññatti",
      "englishTitle": "Definition of Self",
      "sinhalaTitle": "අර්ථප්‍රඥප්තිය"
    },
    {
      "number": 118,
      "pali": "‘‘Tatrānanda, yo so rūpiṃ parittaṃ attānaṃ paññapento paññapeti. Etarahi vā so rūpiṃ parittaṃ attānaṃ paññapento paññapeti, tattha bhāviṃ vā so rūpiṃ parittaṃ attānaṃ paññapento paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa hoti. Evaṃ santaṃ kho, ānanda, rūpiṃ [rūpī (ka.)] parittattānudiṭṭhi anusetīti iccālaṃ vacanāya. ‘‘Tatrānanda, yo so rūpiṃ anantaṃ attānaṃ paññapento paññapeti. Etarahi vā so rūpiṃ anantaṃ attānaṃ paññapento paññapeti, tattha bhāviṃ vā so rūpiṃ anantaṃ attānaṃ paññapento paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa hoti. Evaṃ santaṃ kho, ānanda, rūpiṃ [rūpī (ka.)] anantattānudiṭṭhi anusetīti iccālaṃ vacanāya. ‘‘Tatrānanda, yo so arūpiṃ parittaṃ attānaṃ paññapento paññapeti. Etarahi vā so arūpiṃ parittaṃ attānaṃ paññapento paññapeti, tattha bhāviṃ vā so arūpiṃ parittaṃ attānaṃ paññapento paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa hoti. Evaṃ santaṃ kho, ānanda, arūpiṃ [arūpī (ka.)] parittattānudiṭṭhi anusetīti iccālaṃ vacanāya. ‘‘Tatrānanda, yo so arūpiṃ anantaṃ attānaṃ paññapento paññapeti. Etarahi vā so arūpiṃ anantaṃ attānaṃ paññapento paññapeti, tattha bhāviṃ vā so arūpiṃ anantaṃ attānaṃ paññapento paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa hoti. Evaṃ santaṃ kho, ānanda, arūpiṃ [arūpī (ka.)] anantattānudiṭṭhi anusetīti iccālaṃ vacanāya. Ettāvatā kho, ānanda, attānaṃ paññapento paññapeti. ",
      "english": "There, Ananda, whoever conceives of a self as material and finite, conceives of it either in the present, or projects it into the future, or thinks, ‘I will make what is not so, to be so.’ In such a case, Ananda, the underlying tendency to view the self as material and finite is present. It is fitting to say so.\n\nThere, Ananda, whoever conceives of a self as material and infinite, conceives of it either in the present, or projects it into the future, or thinks, ‘I will make what is not so, to be so.’ In such a case, Ananda, the underlying tendency to view the self as material and infinite is present. It is fitting to say so.\n\nThere, Ananda, whoever conceives of a self as immaterial and finite, conceives of it either in the present, or projects it into the future, or thinks, ‘I will make what is not so, to be so.’ In such a case, Ananda, the underlying tendency to view the self as immaterial and finite is present. It is fitting to say so.\n\nThere, Ananda, whoever conceives of a self as immaterial and infinite, conceives of it either in the present, or projects it into the future, or thinks, ‘I will make what is not so, to be so.’ In such a case, Ananda, the underlying tendency to view the self as immaterial and infinite is present. It is fitting to say so. This is the extent, Ananda, to which one conceives of a self.",
      "sinhala": "එහිදී, ආනන්දයෙනි, යමෙක් රූපී වූ, සීමා සහිත වූ ආත්මයක් පනවමින් පනවයිද. ඒ ඔහු දැනට රූපී වූ, සීමා සහිත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත්, අනාගතයේ ඇතිවන රූපී වූ, සීමා සහිත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත් ‘නොපවතින දෙයක් පවතින සේ සලකමි’ යැයි ඔහුගේ සිතට ඇතිවෙයි. ආනන්දයෙනි, මෙසේ ඇති කල්හි රූපී වූ, සීමා සහිත වූ ආත්ම දෘෂ්ටිය (යටින්) අනුසයනය කරයි යැයි කීමට මෙය ප්රමාණවත් වේ.\n\nඑහිදී, ආනන්දයෙනි, යමෙක් රූපී වූ, අනන්ත වූ ආත්මයක් පනවමින් පනවයිද. ඒ ඔහු දැනට රූපී වූ, අනන්ත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත්, අනාගතයේ ඇතිවන රූපී වූ, අනන්ත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත් ‘නොපවතින දෙයක් පවතින සේ සලකමි’ යැයි ඔහුගේ සිතට ඇතිවෙයි. ආනන්දයෙනි, මෙසේ ඇති කල්හි රූපී වූ, අනන්ත වූ ආත්ම දෘෂ්ටිය (යටින්) අනුසයනය කරයි යැයි කීමට මෙය ප්රමාණවත් වේ.\n\nඑහිදී, ආනන්දයෙනි, යමෙක් අරූපී වූ, සීමා සහිත වූ ආත්මයක් පනවමින් පනවයිද. ඒ ඔහු දැනට අරූපී වූ, සීමා සහිත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත්, අනාගතයේ ඇතිවන අරූපී වූ, සීමා සහිත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත් ‘නොපවතින දෙයක් පවතින සේ සලකමි’ යැයි ඔහුගේ සිතට ඇතිවෙයි. ආනන්දයෙනි, මෙසේ ඇති කල්හි අරූපී වූ, සීමා සහිත වූ ආත්ම දෘෂ්ටිය (යටින්) අනුසයනය කරයි යැයි කීමට මෙය ප්රමාණවත් වේ.\n\nඑහිදී, ආනන්දයෙනි, යමෙක් අරූපී වූ, අනන්ත වූ ආත්මයක් පනවමින් පනවයිද. ඒ ඔහු දැනට අරූපී වූ, අනන්ත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත්, අනාගතයේ ඇතිවන අරූපී වූ, අනන්ත වූ ආත්මයක් පනවමින් පනවයි, නැතහොත් ‘නොපවතින දෙයක් පවතින සේ සලකමි’ යැයි ඔහුගේ සිතට ඇතිවෙයි. ආනන්දයෙනි, මෙසේ ඇති කල්හි අරූපී වූ, අනන්ත වූ ආත්ම දෘෂ්ටිය (යටින්) අනුසයනය කරයි යැයි කීමට මෙය ප්රමාණවත් වේ.\n\nආනන්දයෙනි, ආත්මය පනවන්නේ මෙපමණකින්මය.",
      "paliTitle": ""
    },
    {
      "number": 119,
      "pali": "‘‘Kittāvatā ca, ānanda, attānaṃ na paññapento na paññapeti? Rūpiṃ vā hi, ānanda, parittaṃ attānaṃ na paññapento na paññapeti – ‘rūpī me paritto attā’ti. Rūpiṃ vā hi, ānanda, anantaṃ attānaṃ na paññapento na paññapeti – ‘rūpī me ananto attā’ti. Arūpiṃ vā hi, ānanda, parittaṃ attānaṃ na paññapento na paññapeti – ‘arūpī me paritto attā’ti. Arūpiṃ vā hi, ānanda, anantaṃ attānaṃ na paññapento na paññapeti – ‘arūpī me ananto attā’ti.",
      "english": "And in what way, Ananda, does one not identify with a self? It is when, Ananda, one does not identify with a limited material self, thinking, ‘My self is a limited material being.’ Or when one does not identify with an infinite material self, thinking, ‘My self is an infinite material being.’ Or when one does not identify with a limited immaterial self, thinking, ‘My self is a limited immaterial being.’ Or when one does not identify with an infinite immaterial self, thinking, ‘My self is an infinite immaterial being.’",
      "sinhala": "ආනන්ද, කෙසේ නම් තමා ප්‍රඥප්ත නොකරමින් තමා ප්‍රඥප්ත නොකරයි ද? ආනන්ද, රූපී වූ ද, පරිමිත වූ ද ආත්මයක් ප්‍රඥප්ත නොකරමින්, ‘මාගේ ආත්මය රූපී ය, පරිමිත ය’ යැයි ප්‍රඥප්ත නොකරයි. ආනන්ද, රූපී වූ ද, අනන්ත වූ ද ආත්මයක් ප්‍රඥප්ත නොකරමින්, ‘මාගේ ආත්මය රූපී ය, අනන්ත ය’ යැයි ප්‍රඥප්ත නොකරයි. ආනන්ද, අරූපී වූ ද, පරිමිත වූ ද ආත්මයක් ප්‍රඥප්ත නොකරමින්, ‘මාගේ ආත්මය අරූපී ය, පරිමිත ය’ යැයි ප්‍රඥප්ත නොකරයි. ආනන්ද, අරූපී වූ ද, අනන්ත වූ ද ආත්මයක් ප්‍රඥප්ත නොකරමින්, ‘මාගේ ආත්මය අරූපී ය, අනන්ත ය’ යැයි ප්‍රඥප්ත නොකරයි.",
      "paliTitle": "Naattapaññatti",
      "englishTitle": "Designation of Relatives",
      "sinhalaTitle": "ඥාතී ප්‍රඥප්තිය"
    },
    {
      "number": 120,
      "pali": "‘‘Tatrānanda, yo so rūpiṃ parittaṃ attānaṃ na paññapento na paññapeti. Etarahi vā so rūpiṃ parittaṃ attānaṃ na paññapento na paññapeti, tattha bhāviṃ vā so rūpiṃ parittaṃ attānaṃ na paññapento na paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa na hoti. Evaṃ santaṃ kho, ānanda, rūpiṃ parittattānudiṭṭhi nānusetīti iccālaṃ vacanāya. ‘‘Tatrānanda, yo so rūpiṃ anantaṃ attānaṃ na paññapento na paññapeti. Etarahi vā so rūpiṃ anantaṃ attānaṃ na paññapento na paññapeti, tattha bhāviṃ vā so rūpiṃ anantaṃ attānaṃ na paññapento na paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa na hoti. Evaṃ santaṃ kho, ānanda, rūpiṃ anantattānudiṭṭhi nānusetīti iccālaṃ vacanāya. ‘‘Tatrānanda, yo so arūpiṃ parittaṃ attānaṃ na paññapento na paññapeti. Etarahi vā so arūpiṃ parittaṃ attānaṃ na paññapento na paññapeti, tattha bhāviṃ vā so arūpiṃ parittaṃ attānaṃ na paññapento na paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa na hoti. Evaṃ santaṃ kho, ānanda, arūpiṃ parittattānudiṭṭhi nānusetīti iccālaṃ vacanāya. ‘‘Tatrānanda, yo so arūpiṃ anantaṃ attānaṃ na paññapento na paññapeti. Etarahi vā so arūpiṃ anantaṃ attānaṃ na paññapento na paññapeti, tattha bhāviṃ vā so arūpiṃ anantaṃ attānaṃ na paññapento na paññapeti, ‘atathaṃ vā pana santaṃ tathattāya upakappessāmī’ti iti vā panassa na hoti. Evaṃ santaṃ kho, ānanda, arūpiṃ anantattānudiṭṭhi nānusetīti iccālaṃ vacanāya. Ettāvatā kho, ānanda, attānaṃ na paññapento na paññapeti. ",
      "english": "Ānanda, when someone does not identify with a self that is material and limited, neither identifies with such a self now, nor will identify with such a self in the future, nor does the thought arise, \"I will fabricate reality from what is unreal,\" then, Ānanda, it is fitting to say that the underlying tendency to identify with a material and limited self does not persist.\n\nĀnanda, when someone does not identify with a self that is material and infinite, neither identifies with such a self now, nor will identify with such a self in the future, nor does the thought arise, \"I will fabricate reality from what is unreal,\" then, Ānanda, it is fitting to say that the underlying tendency to identify with a material and infinite self does not persist.\n\nĀnanda, when someone does not identify with a self that is immaterial and limited, neither identifies with such a self now, nor will identify with such a self in the future, nor does the thought arise, \"I will fabricate reality from what is unreal,\" then, Ānanda, it is fitting to say that the underlying tendency to identify with an immaterial and limited self does not persist.\n\nĀnanda, when someone does not identify with a self that is immaterial and infinite, neither identifies with such a self now, nor will identify with such a self in the future, nor does the thought arise, \"I will fabricate reality from what is unreal,\" then, Ānanda, it is fitting to say that the underlying tendency to identify with an immaterial and infinite self does not persist.\n\nIn this way, Ānanda, one does not identify with a self.",
      "sinhala": "ආනන්දය, යමෙක් රූපවත් වූ, සීමිත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, වර්තමානයේ දී හෝ ඔහු රූපවත් වූ, සීමිත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, අනාගතයේ දී හෝ ඔහු රූපවත් වූ, සීමිත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, තවද \"නොපවතින දෙයක් පවතින දෙයක් බවට පත් කරගන්නෙමි\" යන අදහසක් ඔහුට නැති වේ ද, ආනන්දය, මෙසේ වූ කල්හි රූපවත් වූ, සීමිත වූ ආත්මය පිළිබඳ අනුදිට්ඨියක් ඇති නොවේ යැයි කීම සෑහේ.\n\nආනන්දය, යමෙක් රූපවත් වූ, අනන්ත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, වර්තමානයේ දී හෝ ඔහු රූපවත් වූ, අනන්ත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, අනාගතයේ දී හෝ ඔහු රූපවත් වූ, අනන්ත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, තවද \"නොපවතින දෙයක් පවතින දෙයක් බවට පත් කරගන්නෙමි\" යන අදහසක් ඔහුට නැති වේ ද, ආනන්දය, මෙසේ වූ කල්හි රූපවත් වූ, අනන්ත වූ ආත්මය පිළිබඳ අනුදිට්ඨියක් ඇති නොවේ යැයි කීම සෑහේ.\n\nආනන්දය, යමෙක් අරූපවත් වූ, සීමිත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, වර්තමානයේ දී හෝ ඔහු අරූපවත් වූ, සීමිත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, අනාගතයේ දී හෝ ඔහු අරූපවත් වූ, සීමිත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, තවද \"නොපවතින දෙයක් පවතින දෙයක් බවට පත් කරගන්නෙමි\" යන අදහසක් ඔහුට නැති වේ ද, ආනන්දය, මෙසේ වූ කල්හි අරූපවත් වූ, සීමිත වූ ආත්මය පිළිබඳ අනුදිට්ඨියක් ඇති නොවේ යැයි කීම සෑහේ.\n\nආනන්දය, යමෙක් අරූපවත් වූ, අනන්ත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, වර්තමානයේ දී හෝ ඔහු අරූපවත් වූ, අනන්ත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, අනාගතයේ දී හෝ ඔහු අරූපවත් වූ, අනන්ත වූ ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද, තවද \"නොපවතින දෙයක් පවතින දෙයක් බවට පත් කරගන්නෙමි\" යන අදහසක් ඔහුට නැති වේ ද, ආනන්දය, මෙසේ වූ කල්හි අරූපවත් වූ, අනන්ත වූ ආත්මය පිළිබඳ අනුදිට්ඨියක් ඇති නොවේ යැයි කීම සෑහේ.\n\nආනන්දය, මෙපමණකින් ආත්මයක් ප්‍රකාශ නොකරයි ද, (එසේ) නොපවත්වයි ද.",
      "paliTitle": ""
    },
    {
      "number": 121,
      "pali": "‘‘Kittāvatā ca, ānanda, attānaṃ samanupassamāno samanupassati? Vedanaṃ vā hi, ānanda, attānaṃ samanupassamāno samanupassati – ‘vedanā me attā’ti. ‘Na heva kho me vedanā attā, appaṭisaṃvedano me attā’ti iti vā hi, ānanda, attānaṃ samanupassamāno samanupassati. ‘Na heva kho me vedanā attā, nopi appaṭisaṃvedano me attā, attā me vediyati, vedanādhammo hi me attā’ti iti vā hi, ānanda, attānaṃ samanupassamāno samanupassati.",
      "english": "And how, Ānanda, does someone regard themselves as self? It is when, Ānanda, regarding feeling, one sees it as self: ‘Feeling is my self.’ Or again, Ānanda, one regards themself thus: ‘Feeling is certainly not my self; my self is without feeling.’ Or again, Ānanda, one regards themself thus: ‘Feeling is certainly not my self, nor is my self without feeling; my self feels, for my self is by nature to feel.’",
      "sinhala": "ආනන්ද, පුද්ගලයෙක් කෙසේ නම් තමා ආත්මයක් ලෙස සලකන්නේ ද? ආනන්ද, වේදනාව තමාගේ ආත්මය ලෙස සලකමින් – ‘වේදනාව මගේ ආත්මයයි’ යැයි තමා ආත්මයක් ලෙස සලකයි. නැතහොත්, ‘වේදනාව මගේ ආත්මය නොවේ; මගේ ආත්මය වේදනාවෙන් තොරය’ යැයි තමා ආත්මයක් ලෙස සලකයි. නැතහොත්, ‘වේදනාව මගේ ආත්මය නොවේ; එසේම, මගේ ආත්මය වේදනාවෙන් තොර වූවක් ද නොවේ. මගේ ආත්මය විඳියි. මන්ද මගේ ආත්මය වේදනාව ස්වභාව කොට ඇත්තකි’ යැයි තමා ආත්මයක් ලෙස සලකයි.",
      "paliTitle": "Attasamanupassanā",
      "englishTitle": "Contemplation of Self",
      "sinhalaTitle": "ආත්ම සමනුපස්සනාව"
    },
    {
      "number": 122,
      "pali": "‘‘Tatrānanda, yo so evamāha – ‘vedanā me attā’ti, so evamassa vacanīyo – ‘tisso kho imā, āvuso, vedanā – sukhā vedanā dukkhā vedanā adukkhamasukhā vedanā. Imāsaṃ kho tvaṃ tissannaṃ vedanānaṃ katamaṃ attato samanupassasī’ti? Yasmiṃ, ānanda, samaye sukhaṃ vedanaṃ vedeti, neva tasmiṃ samaye dukkhaṃ vedanaṃ vedeti, na adukkhamasukhaṃ vedanaṃ vedeti; sukhaṃyeva tasmiṃ samaye vedanaṃ vedeti. Yasmiṃ, ānanda, samaye dukkhaṃ vedanaṃ vedeti, neva tasmiṃ samaye sukhaṃ vedanaṃ vedeti, na adukkhamasukhaṃ vedanaṃ vedeti; dukkhaṃyeva tasmiṃ samaye vedanaṃ vedeti. Yasmiṃ, ānanda, samaye adukkhamasukhaṃ vedanaṃ vedeti, neva tasmiṃ samaye sukhaṃ vedanaṃ vedeti, na dukkhaṃ vedanaṃ vedeti; adukkhamasukhaṃyeva tasmiṃ samaye vedanaṃ vedeti.",
      "english": "Ananda, if someone says, \"Feeling is my self,\" they should be asked: \"Friend, there are these three kinds of feeling: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. Of these three, which do you identify as self?\"\n\nAnanda, when one experiences a pleasant feeling, one does not experience a painful or a neither-painful-nor-pleasant feeling. At that time, one experiences only a pleasant feeling. Ananda, when one experiences a painful feeling, one does not experience a pleasant or a neither-painful-nor-pleasant feeling. At that time, one experiences only a painful feeling. Ananda, when one experiences a neither-painful-nor-pleasant feeling, one does not experience a pleasant or a painful feeling. At that time, one experiences only a neither-painful-nor-pleasant feeling.",
      "sinhala": "ආනන්දය, යමෙක් \"වේදනාව මගේ ආත්මය\" යැයි කියයි නම්, ඔහුගෙන් මෙසේ ඇසිය යුතුයි: \"ඇවැත්නි, වේදනා තුනක් ඇත. එනම්, සුඛ වේදනාව, දුක්ඛ වේදනාව, සහ අදුක්ඛමසුඛ වේදනාව යනුයි. ඔබ මේ වේදනා තුනෙන් කුමන වේදනාව ආත්මය ලෙස සලකනවාද?\"\n\nආනන්දය, යම් මොහොතක සුඛ වේදනාවක් විඳින විට, එම මොහොතේ දුක්ඛ වේදනාවක් හෝ අදුක්ඛමසුඛ වේදනාවක් විඳින්නේ නැත. විඳින්නේ සුඛ වේදනාව පමණි. ආනන්දය, යම් මොහොතක දුක්ඛ වේදනාවක් විඳින විට, එම මොහොතේ සුඛ වේදනාවක් හෝ අදුක්ඛමසුඛ වේදනාවක් විඳින්නේ නැත. විඳින්නේ දුක්ඛ වේදනාව පමණි. ආනන්දය, යම් මොහොතක අදුක්ඛමසුඛ වේදනාවක් විඳින විට, එම මොහොතේ සුඛ වේදනාවක් හෝ දුක්ඛ වේදනාවක් විඳින්නේ නැත. විඳින්නේ අදුක්ඛමසුඛ වේදනාව පමණි.",
      "paliTitle": ""
    },
    {
      "number": 123,
      "pali": "‘‘Sukhāpi kho, ānanda, vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Dukkhāpi kho, ānanda, vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Adukkhamasukhāpi kho, ānanda, vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Tassa sukhaṃ vedanaṃ vediyamānassa ‘eso me attā’ti hoti. Tassāyeva sukhāya vedanāya nirodhā ‘byagā [byaggā (sī. ka.)] me attā’ti hoti. Dukkhaṃ vedanaṃ vediyamānassa ‘eso me attā’ti hoti. Tassāyeva dukkhāya vedanāya nirodhā ‘byagā me attā’ti hoti. Adukkhamasukhaṃ vedanaṃ vediyamānassa ‘eso me attā’ti hoti. Tassāyeva adukkhamasukhāya vedanāya nirodhā ‘byagā me attā’ti hoti. Iti so diṭṭheva dhamme aniccasukhadukkhavokiṇṇaṃ uppādavayadhammaṃ attānaṃ samanupassamāno samanupassati, yo so evamāha – ‘vedanā me attā’ti. Tasmātihānanda, etena petaṃ nakkhamati – ‘vedanā me attā’ti samanupassituṃ.",
      "english": "Ananda, even pleasant feeling is impermanent, conditioned, dependently originated, subject to decay, subject to passing away, subject to fading away, and subject to cessation. Ananda, even painful feeling is impermanent, conditioned, dependently originated, subject to decay, subject to passing away, subject to fading away, and subject to cessation. Ananda, even neutral feeling is impermanent, conditioned, dependently originated, subject to decay, subject to passing away, subject to fading away, and subject to cessation.\n\nWhen experiencing a pleasant feeling, one thinks, 'This is my self.' With the cessation of that very pleasant feeling, one thinks, 'My self has vanished.' When experiencing a painful feeling, one thinks, 'This is my self.' With the cessation of that very painful feeling, one thinks, 'My self has vanished.' When experiencing a neutral feeling, one thinks, 'This is my self.' With the cessation of that very neutral feeling, one thinks, 'My self has vanished.'\n\nThus, someone who says, 'Feeling is my self,' directly observes in this very life a self that is impermanent, mixed with pleasure and pain, and subject to arising and passing away. Therefore, Ananda, it is not fitting to regard feeling as 'my self.'",
      "sinhala": "ආනන්දය, සැප වේදනාව පවා අනිත්ය ය, සංඛත ය, පටිච්චසමුප්පන්නය, ක්ෂය වීමේ ස්වභාවය ඇත්තේ ය, වය වීමේ ස්වභාවය ඇත්තේ ය, විරාග වීමේ ස්වභාවය ඇත්තේ ය, නිරෝධ වීමේ ස්වභාවය ඇත්තේ ය. ආනන්දය, දුක් වේදනාව පවා අනිත්ය ය, සංඛත ය, පටිච්චසමුප්පන්න ය, ක්ෂය වීමේ ස්වභාවය ඇත්තේ ය, වය වීමේ ස්වභාවය ඇත්තේ ය, විරාග වීමේ ස්වභාවය ඇත්තේ ය, නිරෝධ වීමේ ස්වභාවය ඇත්තේ ය. ආනන්දය, දුක් ද නොවූ සැප ද නොවූ වේදනාව පවා අනිත්ය ය, සංඛත ය, පටිච්චසමුප්පන්න ය, ක්ෂය වීමේ ස්වභාවය ඇත්තේ ය, වය වීමේ ස්වභාවය ඇත්තේ ය, විරාග වීමේ ස්වභාවය ඇත්තේ ය, නිරෝධ වීමේ ස්වභාවය ඇත්තේ ය.\n\nයමෙක් සැප වේදනාවක් විඳින විට \"මෙය මාගේ ආත්මය\" යැයි සිතයි. ඒ සැප වේදනාව නිරුද්ධ වූ විට \"මාගේ ආත්මය විනාශ විය\" යැයි සිතයි. දුක් වේදනාවක් විඳින විට \"මෙය මාගේ ආත්මය\" යැයි සිතයි. ඒ දුක් වේදනාව නිරුද්ධ වූ විට \"මාගේ ආත්මය විනාශ විය\" යැයි සිතයි. දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳින විට \"මෙය මාගේ ආත්මය\" යැයි සිතයි. ඒ දුක් ද නොවූ සැප ද නොවූ වේදනාව නිරුද්ධ වූ විට \"මාගේ ආත්මය විනාශ විය\" යැයි සිතයි.\n\nයමෙක් \"වේදනාව මාගේ ආත්මය\" යැයි මෙසේ කියන්නේ නම්, හෙතෙම මේ ජීවිතයේදීම අනිත්ය වූ, සැප දුක් මිශ්ර වූ, ඉපදීමේ හා නැතිවීමේ ස්වභාවය ඇති ආත්මයක් දකී. එහෙයින්, ආනන්දය, \"වේදනාව මාගේ ආත්මය\" යැයි සැලකීම මේ කරුණින් ද නොගැලපේ.",
      "paliTitle": ""
    },
    {
      "number": 124,
      "pali": "‘‘Tatrānanda, yo so evamāha – ‘na heva kho me vedanā attā, appaṭisaṃvedano me attā’ti, so evamassa vacanīyo – ‘yattha panāvuso, sabbaso vedayitaṃ natthi api nu kho, tattha ‘‘ayamahamasmī’’ti siyā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, etena petaṃ nakkhamati – ‘na heva kho me vedanā attā, appaṭisaṃvedano me attā’ti samanupassituṃ.",
      "english": "Ananda, if someone were to say, \"Feeling is certainly not my self; my self is without feeling,\" they should be asked: \"Friend, where there is utterly no experience of feeling, could the thought 'I am' arise?\" \"No, venerable sir.\" Therefore, Ananda, it is untenable to regard it as 'Feeling is certainly not my self; my self is without feeling.'",
      "sinhala": "ආනන්දය, යමෙක් මෙසේ කියන්නේ නම්, “වේදනාව මාගේ ආත්මය නොවේ. මාගේ ආත්මය වේදනාවන්ගෙන් තොර” කියා, ඔහුගෙන් මෙසේ ඇසිය යුතුයි. “ඇවැත්නි, යම් තැනක කිසිඳු වේදනාවක් විඳීමක් නැද්ද, එහි ‘මම වෙමි’ කියා යමක් තිබිය හැකිද?” “ස්වාමීනි, එසේ විය නොහැකිය.” ආනන්දය, එබැවින් “වේදනාව මාගේ ආත්මය නොවේ. මාගේ ආත්මය වේදනාවන්ගෙන් තොර” යනුවෙන් සැලකීම සුදුසු නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 125,
      "pali": "‘‘Tatrānanda, yo so evamāha – ‘na heva kho me vedanā attā, nopi appaṭisaṃvedano me attā, attā me vediyati, vedanādhammo hi me attā’ti. So evamassa vacanīyo – vedanā ca hi, āvuso, sabbena sabbaṃ sabbathā sabbaṃ aparisesā nirujjheyyuṃ. Sabbaso vedanāya asati vedanānirodhā api nu kho tattha ‘ayamahamasmī’ti siyā’’ti? ‘No hetaṃ, bhante’’. ‘‘Tasmātihānanda, etena petaṃ nakkhamati – ‘‘na heva kho me vedanā attā, nopi appaṭisaṃvedano me attā, attā me vediyati, vedanādhammo hi me attā’ti samanupassituṃ.",
      "english": "Ananda, if someone says, 'Feeling is not my self, nor is my self without feeling; my self feels, for my self is of the nature of feeling,' they should be questioned: 'Friend, if all feelings were to cease entirely, completely, and without any remainder, would there then, with the complete absence and cessation of feeling, be any basis for the thought, \"I am\"?' 'No, venerable sir.' 'Therefore, Ananda, it is not tenable to regard thus: \"Feeling is not my self, nor is my self without feeling; my self feels, for my self is of the nature of feeling.\"'\"",
      "sinhala": "ආනන්දය, එහිලා යමෙක් මෙසේ කියන්නේ නම්, ‘වේදනාව මාගේ ආත්මය නොවේ. වේදනාව නොදන්නා ආත්මයක් ද මට නැත. මාගේ ආත්මය වේදනාව විඳියි. වේදනාවේ ස්වභාවය ඇති ආත්මයක් මට ඇතැ’යි පවසන්නේ නම්, ඔහුට මෙසේ පැවසිය යුතුයි. ‘ඇවැත්නි, වේදනාවන් සියල්ල, සෑම අයුරකින්ම, කිසිවක් ඉතිරි නොවී නිරුද්ධ වුවහොත්, වේදනාව සම්පූර්ණයෙන්ම නැති වී යාමෙන්, වේදනා නිරෝධය නිසා ‘මේ මම වෙමි’ යැයි යමක් එහි පවතීද?’ ‘භාග්‍යවතුන් වහන්ස, එසේ නොවේ.’ ආනන්දය, එහෙයින් ‘වේදනාව මාගේ ආත්මය නොවේ. වේදනාව නොදන්නා ආත්මයක් ද මට නැත. මාගේ ආත්මය වේදනාව විඳියි. වේදනාවේ ස්වභාවය ඇති ආත්මයක් මට ඇතැ’යි සිතීම මේ හේතුවෙන් ද නොගැලපෙයි.",
      "paliTitle": ""
    },
    {
      "number": 126,
      "pali": "‘‘Yato kho, ānanda, bhikkhu neva vedanaṃ attānaṃ samanupassati, nopi appaṭisaṃvedanaṃ attānaṃ samanupassati, nopi ‘attā me vediyati, vedanādhammo hi me attā’ti samanupassati. So evaṃ na samanupassanto na ca kiñci loke upādiyati, anupādiyaṃ na paritassati, aparitassaṃ [aparitassanaṃ (ka.)] paccattaññeva parinibbāyati, ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Evaṃ vimuttacittaṃ kho, ānanda, bhikkhuṃ yo evaṃ vadeyya – ‘hoti tathāgato paraṃ maraṇā itissa [iti sā (aṭṭhakathāyaṃ pāṭhantaraṃ)] diṭṭhī’ti, tadakallaṃ. ‘Na hoti tathāgato paraṃ maraṇā itissa diṭṭhī’ti, tadakallaṃ. ‘Hoti ca na ca hoti tathāgato paraṃ maraṇā itissa diṭṭhī’ti, tadakallaṃ. ‘Neva hoti na na hoti tathāgato paraṃ maraṇā itissa diṭṭhī’ti, tadakallaṃ. Taṃ kissa hetu? Yāvatā, ānanda, adhivacanaṃ yāvatā adhivacanapatho, yāvatā nirutti yāvatā niruttipatho, yāvatā paññatti yāvatā paññattipatho, yāvatā paññā yāvatā paññāvacaraṃ, yāvatā vaṭṭaṃ [yāvatā vaṭṭaṃ vaṭṭati (ka. sī.)], yāvatā vaṭṭati [yāvatā vaṭṭaṃ vaṭṭati (ka. sī.)], tadabhiññāvimutto bhikkhu, tadabhiññāvimuttaṃ bhikkhuṃ ‘na jānāti na passati itissa diṭṭhī’ti, tadakallaṃ.",
      "english": "Ānanda, when a monk does not regard feeling as self, nor non-feeling as self, nor 'my self feels; my self is of the nature to feel,' then, not regarding thus, he clings to nothing in the world. Not clinging, he is not agitated. Not being agitated, he attains Nibbāna right within himself, understanding: ‘Birth is destroyed, the holy life has been lived, what needed to be done has been done, there is nothing further for this state of being.’ Ānanda, if someone were to assert of a monk whose mind is thus liberated: ‘The Tathāgata exists after death,’ that would be unsuitable. ‘The Tathāgata does not exist after death,’ that would be unsuitable. ‘The Tathāgata both exists and does not exist after death,’ that would be unsuitable. ‘The Tathāgata neither exists nor does not exist after death,’ that would be unsuitable. Why is that? Ānanda, to the extent that there is designation, to the extent that there is a range of designation, to the extent that there is expression, to the extent that there is a range of expression, to the extent that there is concept, to the extent that there is a range of concept, to the extent that there is wisdom, to the extent that there is a scope of wisdom, to the extent that there is the round, to the extent that the round revolves—the monk is liberated by direct knowledge beyond all that. To say of a monk thus liberated by direct knowledge: ‘He does not know, he does not see,’ that would be unsuitable.",
      "sinhala": "ආනන්දය, යම් භික්ෂුවක් වේදනාව ආත්මය ලෙස හෝ වේදනාව රහිත බව ආත්මය ලෙස හෝ ‘මාගේ ආත්මය වේදනාව විඳියි. මන්ද මාගේ ආත්මය වේදනා ස්වභාවයෙන් යුක්තය’ යැයි හෝ නොදකී ද, එසේ නොදක්නා හෙතෙම ලෝකයෙහි කිසිවක් උපාදානය නොකරයි. උපාදානය නොකරන හෙතෙම තැති නොගනියි. තැති නොගන්නා හෙතෙම තමා තුළම පිරිනිවන් පායි. ‘ජාතිය ක්ෂය විය, බඹසර වැස නිම කරන ලදී, කළ යුතු දේ කරන ලදී, මින් මතු මෙවන් බවක් නැතැ’යි ප්රඥාවෙන් දනියි. ආනන්දය, මෙසේ විමුක්ති සිතක් ඇති භික්ෂුවක් ගැන යමෙක් ‘තථාගතයන් වහන්සේ මරණින් මතු උපදී යන මතය ඇත්තේ ය’යි කියන්නේ නම් එය නුසුදුසුය. ‘තථාගතයන් වහන්සේ මරණින් මතු උපදින්නේ නැත යන මතය ඇත්තේ ය’යි කියන්නේ නම් එය ද නුසුදුසුය. ‘තථාගතයන් වහන්සේ මරණින් මතු උපදී ද, නො උපදී ද යන මතය ඇත්තේ ය’යි කියන්නේ නම් එය ද නුසුදුසුය. ‘තථාගතයන් වහන්සේ මරණින් මතු උපදින්නේද නොවේ, නොඋපදින්නේද නොවේ යන මතය ඇත්තේ ය’යි කියන්නේ නම් එය ද නුසුදුසුය. එයට හේතුව කුමක් ද? ආනන්දය, යම් පමණකින් වචන තිබේද, යම් පමණකින් වචන භාවිතයේ මාර්ග තිබේද, යම් පමණකින් නිරුක්ති තිබේද, යම් පමණකින් වචනවල මාර්ග තිබේද, යම් පමණකින් ප්රඥප්ති තිබේද, යම් පමණකින් ප්රඥප්තිවල මාර්ග තිබේද, යම් පමණකින් ප්රඥාව තිබේද, යම් පමණකින් ප්රඥාවට අයත් ක්ෂේත්රයක් තිබේද, යම් පමණකින් භව චක්රය පවතින්නේද, ඒ සියල්ල අභිඥාවෙන් අවබෝධ කරගෙන මිදුණු භික්ෂුවක් ගැන ‘ඔහු දන්නේ නැත, දකින්නේ නැත යන මතය ඇත්තේ ය’යි යමෙක් කියන්නේ නම්, එය ද නුසුදුසුය.",
      "paliTitle": ""
    },
    {
      "number": 127,
      "pali": "‘‘Satta kho, ānanda [satta kho imā ānanda (ka. sī. syā.)], viññāṇaṭṭhitiyo, dve āyatanāni. Katamā satta? Santānanda, sattā nānattakāyā nānattasaññino, seyyathāpi manussā, ekacce ca devā, ekacce ca vinipātikā. Ayaṃ paṭhamā viññāṇaṭṭhiti. Santānanda, sattā nānattakāyā ekattasaññino, seyyathāpi devā brahmakāyikā paṭhamābhinibbattā. Ayaṃ dutiyā viññāṇaṭṭhiti. Santānanda, sattā ekattakāyā nānattasaññino, seyyathāpi devā ābhassarā. Ayaṃ tatiyā viññāṇaṭṭhiti. Santānanda, sattā ekattakāyā ekattasaññino, seyyathāpi devā subhakiṇhā. Ayaṃ catutthī viññāṇaṭṭhiti. Santānanda, sattā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanūpagā. Ayaṃ pañcamī viññāṇaṭṭhiti. Santānanda, sattā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanūpagā. Ayaṃ chaṭṭhī viññāṇaṭṭhiti. Santānanda, sattā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanūpagā. Ayaṃ sattamī viññāṇaṭṭhiti. Asaññasattāyatanaṃ nevasaññānāsaññāyatanameva dutiyaṃ.",
      "english": "Ānanda, there are seven stations of consciousness and two abodes. What are the seven?\n\nĀnanda, there are beings with diverse bodies and diverse perceptions, such as humans, some gods, and some beings in the realms of woe. This is the first station of consciousness.\n\nĀnanda, there are beings with diverse bodies but unified perceptions, such as the gods of the Brahma host who are reborn after the first absorption. This is the second station of consciousness.\n\nĀnanda, there are beings with unified bodies but diverse perceptions, such as the Ābhassara gods. This is the third station of consciousness.\n\nĀnanda, there are beings with unified bodies and unified perceptions, such as the Subhakiṇha gods. This is the fourth station of consciousness.\n\nĀnanda, there are beings who, with the complete transcending of perceptions of form, with the passing away of perceptions of resistance, and not attending to perceptions of diversity, attain to the base of the infinity of space, thinking, ‘Space is infinite.’ This is the fifth station of consciousness.\n\nĀnanda, there are beings who, with the complete transcending of the base of the infinity of space, attain to the base of the infinity of consciousness, thinking, ‘Consciousness is infinite.’ This is the sixth station of consciousness.\n\nĀnanda, there are beings who, with the complete transcending of the base of the infinity of consciousness, attain to the base of nothingness, thinking, ‘There is nothing.’ This is the seventh station of consciousness.\n\nThe realm of non-percipient beings and the base of neither-perception-nor-non-perception are the two abodes.",
      "sinhala": "ආනන්දය, විඤ්ඤාණස්ථිති හතක් හා ආයතන දෙකක් ඇත. ඒ හත මොනවාද? ආනන්දය, නානාවිධ ශරීර හා නානාවිධ සංඥා ඇති සත්වයෝ සිටිති. එනම් මනුෂ්යයෝ, ඇතැම් දෙවිවරු හා ඇතැම් විනිපාතකයෝ වෙති. මෙය පළමුවන විඤ්ඤාණස්ථිතියයි. ආනන්දය, නානාවිධ ශරීර ඇති නමුත් ඒකාකාර සංඥා ඇති සත්වයෝ සිටිති. එනම් පළමුව උපන් බ්රහ්මකායික දෙවිවරු වැනි අයයි. මෙය දෙවන විඤ්ඤාණස්ථිතියයි. ආනන්දය, ඒකාකාර ශරීර ඇති නමුත් නානාවිධ සංඥා ඇති සත්වයෝ සිටිති. එනම් ආභස්සර දෙවිවරු වැනි අයයි. මෙය තුන්වන විඤ්ඤාණස්ථිතියයි. ආනන්දය, ඒකාකාර ශරීර හා ඒකාකාර සංඥා ඇති සත්වයෝ සිටිති. එනම් සුභකිණ්හ දෙවිවරු වැනි අයයි. මෙය සතරවන විඤ්ඤාණස්ථිතියයි. ආනන්දය, ඇතැම් සත්වයෝ සියලු රූප සංඥා ඉක්මවා, ප්රතිඝ සංඥා නැතිකර, නානත්ත සංඥා මෙනෙහි නොකර 'අනන්ත වූයේ ආකාශය' යැයි සිතා ආකාශානන්ත්ය ආයතනයට පැමිණෙති. මෙය පස්වන විඤ්ඤාණස්ථිතියයි. ආනන්දය, ඇතැම් සත්වයෝ සියලු ආකාශානන්ත්ය ආයතන ඉක්මවා 'අනන්ත වූයේ විඤ්ඤාණය' යැයි සිතා විඤ්ඤාණානන්ත්ය ආයතනයට පැමිණෙති. මෙය සයවන විඤ්ඤාණස්ථිතියයි. ආනන්දය, ඇතැම් සත්වයෝ සියලු විඤ්ඤාණානන්ත්ය ආයතන ඉක්මවා 'කිසිවක් නැත' යැයි සිතා ආකිඤ්චඤ්ඤායතනයට පැමිණෙති. මෙය සත්වන විඤ්ඤාණස්ථිතියයි. අසඤ්ඤසත්ත ආයතනය හා නේවසඤ්ඤානාසඤ්ඤායතනය යන මේවා දෙකයි.",
      "paliTitle": "Satta viññāṇaṭṭhiti",
      "englishTitle": "Seven stations of consciousness",
      "sinhalaTitle": "සත්ත විඤ්ඤාණට්ඨිති"
    },
    {
      "number": 128,
      "pali": "‘‘Tatrānanda, yāyaṃ paṭhamā viññāṇaṭṭhiti nānattakāyā nānattasaññino, seyyathāpi manussā, ekacce ca devā, ekacce ca vinipātikā. Yo nu kho, ānanda, tañca pajānāti, tassā ca samudayaṃ pajānāti, tassā ca atthaṅgamaṃ pajānāti, tassā ca assādaṃ pajānāti, tassā ca ādīnavaṃ pajānāti, tassā ca nissaraṇaṃ pajānāti, kallaṃ nu tena tadabhinanditu’’nti? ‘‘No hetaṃ, bhante’’…pe… ‘‘tatrānanda, yamidaṃ asaññasattāyatanaṃ. Yo nu kho, ānanda, tañca pajānāti, tassa ca samudayaṃ pajānāti, tassa ca atthaṅgamaṃ pajānāti, tassa ca assādaṃ pajānāti, tassa ca ādīnavaṃ pajānāti, tassa ca nissaraṇaṃ pajānāti, kallaṃ nu tena tadabhinanditu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Tatrānanda, yamidaṃ nevasaññānāsaññāyatanaṃ. Yo nu kho, ānanda, tañca pajānāti, tassa ca samudayaṃ pajānāti, tassa ca atthaṅgamaṃ pajānāti, tassa ca assādaṃ pajānāti, tassa ca ādīnavaṃ pajānāti, tassa ca nissaraṇaṃ pajānāti, kallaṃ nu tena tadabhinanditu’’nti? ‘‘No hetaṃ, bhante’’. Yato kho, ānanda, bhikkhu imāsañca sattannaṃ viññāṇaṭṭhitīnaṃ imesañca dvinnaṃ āyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādā vimutto hoti, ayaṃ vuccatānanda, bhikkhu paññāvimutto.",
      "english": "Ānanda, there is the first station of consciousness: beings with diverse bodies and diverse perceptions, such as humans, some gods, and some beings in the realm of woe. Ānanda, if one understands it, its origin, its cessation, its allure, its drawback, and its escape, is it proper to delight in it? \"No, venerable sir.\"\n\nĀnanda, there is the realm of non-percipient beings. Ānanda, if one understands it, its origin, its cessation, its allure, its drawback, and its escape, is it proper to delight in it? \"No, venerable sir.\"\n\nĀnanda, there is the realm of neither perception nor non-perception. Ānanda, if one understands it, its origin, its cessation, its allure, its drawback, and its escape, is it proper to delight in it? \"No, venerable sir.\"\n\nĀnanda, when a monk truly understands the origin, cessation, allure, drawback, and escape regarding these seven stations of consciousness and these two realms, and is liberated without clinging, that monk, Ānanda, is said to be liberated by wisdom.",
      "sinhala": "“ආනන්දය, මෙහි පළමු විඤ්ඤාණස්ථිතිය නම් නානා ආකාර ශරීර ඇති, නානා ආකාර සංඥා ඇති සත්වයෝ වෙති. එනම් මනුෂ්යයෝ, ඇතැම් දෙවියෝ සහ ඇතැම් විනිපාතික සත්වයෝ ය. ආනන්ද, යමෙක් එය ද, එහි හටගැනීම ද, එහි නැතිවීම ද, එහි ආස්වාදය ද, එහි ආදීනවය ද, එහි නිස්සරණය ද දන්නේ නම්, ඔහු එය අනුමත කිරීම සුදුසු ද?”\n\n“නැත, ස්වාමීනි.”\n\n“ආනන්දය, යම් අසඤ්ඤසත්තායතනයක් වේ ද, ආනන්ද, යමෙක් එය ද, එහි හටගැනීම ද, එහි නැතිවීම ද, එහි ආස්වාදය ද, එහි ආදීනවය ද, එහි නිස්සරණය ද දන්නේ නම්, ඔහු එය අනුමත කිරීම සුදුසු ද?”\n\n“නැත, ස්වාමීනි.”\n\n“ආනන්දය, යම් නේවසඤ්ඤානාසඤ්ඤායතනයක් වේ ද, ආනන්ද, යමෙක් එය ද, එහි හටගැනීම ද, එහි නැතිවීම ද, එහි ආස්වාදය ද, එහි ආදීනවය ද, එහි නිස්සරණය ද දන්නේ නම්, ඔහු එය අනුමත කිරීම සුදුසු ද?”\n\n“නැත, ස්වාමීනි.”\n\n“ආනන්ද, යම් භික්ෂුවක් මේ සත් විඤ්ඤාණස්ථිති සහ ආයතන දෙකෙහි හටගැනීම, නැතිවීම, ආස්වාදය, ආදීනවය සහ නිස්සරණය තත් වූ පරිදි දැන, කිසිවක් උපාදානය කර නොගෙන විමුක්ත වන්නේ ද, ආනන්ද, ඔහු ප්රඥාවෙන් විමුක්ත වූ භික්ෂුවක් ලෙස සැලකේ.”",
      "paliTitle": ""
    },
    {
      "number": 129,
      "pali": "‘‘Aṭṭha kho ime, ānanda, vimokkhā. Katame aṭṭha? Rūpī rūpāni passati ayaṃ paṭhamo vimokkho. Ajjhattaṃ arūpasaññī bahiddhā rūpāni passati, ayaṃ dutiyo vimokkho. Subhanteva adhimutto hoti, ayaṃ tatiyo vimokkho. Sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati, ayaṃ catuttho vimokkho. Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati, ayaṃ pañcamo vimokkho. Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati, ayaṃ chaṭṭho vimokkho. Sabbaso ākiñcaññāyatanaṃ samatikkamma ‘nevasaññānāsaññā’yatanaṃ upasampajja viharati, ayaṃ sattamo vimokkho. Sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, ayaṃ aṭṭhamo vimokkho. Ime kho, ānanda, aṭṭha vimokkhā.",
      "english": "Ānanda, there are these eight liberations. Which eight? Possessing form, one sees forms; this is the first liberation. Being inwardly without perception of form, one sees external forms; this is the second liberation. One is focused solely on beauty; this is the third liberation. By completely transcending perceptions of form, with the disappearance of perceptions of resistance, and by not attending to perceptions of diversity, one enters and abides in the sphere of infinite space, thinking, ‘space is infinite;’ this is the fourth liberation. By completely transcending the sphere of infinite space, one enters and abides in the sphere of infinite consciousness, thinking, ‘consciousness is infinite;’ this is the fifth liberation. By completely transcending the sphere of infinite consciousness, one enters and abides in the sphere of nothingness, thinking, ‘there is nothing;’ this is the sixth liberation. By completely transcending the sphere of nothingness, one enters and abides in the sphere of neither perception nor non-perception; this is the seventh liberation. By completely transcending the sphere of neither perception nor non-perception, one enters and abides in the cessation of perception and feeling; this is the eighth liberation. Ānanda, these are the eight liberations.",
      "sinhala": "ආනන්දය, මේ විමෝක්ෂ අටකි. කවර අටද යත්: රූප ඇති පුද්ගලයා රූප දකී. මෙය පළමුවන විමෝක්ෂයයි. තමා තුළ අරූප සංඥා ඇතිව පිටත රූප දකී. මෙය දෙවන විමෝක්ෂයයි. ශුභ සංඥාවෙහි ඇලී සිටී. මෙය තෙවන විමෝක්ෂයයි. සියලු රූප සංඥා ඉක්මවා, ප්‍රතිඝ සංඥා නැතිවී යාමෙන්, නානත්ව සංඥා මෙනෙහි නොකර, ‘ආකාශය අනන්තය’යි සිතමින් ආකාශානඤ්චායතනයට පැමිණ වාසය කරයි. මෙය සිව්වන විමෝක්ෂයයි. සියලු ආකාශානඤ්චායතනය ඉක්මවා, ‘විඤ්ඤාණය අනන්තය’යි සිතමින් විඤ්ඤාණානඤ්චායතනයට පැමිණ වාසය කරයි. මෙය පස්වන විමෝක්ෂයයි. සියලු විඤ්ඤාණානඤ්චායතනය ඉක්මවා, ‘කිසිවක් නැත’යි සිතමින් ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. මෙය සයවන විමෝක්ෂයයි. සියලු ආකිඤ්චඤ්ඤායතනය ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරයි. මෙය සත්වන විමෝක්ෂයයි. සියලු නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා සංඥා වේදනාවන්ගේ නිරෝධයට පැමිණ වාසය කරයි. මෙය අටවන විමෝක්ෂයයි. ආනන්දය, මේ විමෝක්ෂ අටයි.",
      "paliTitle": "Aṭṭha vimokkhā",
      "englishTitle": "The Eight Deliverances",
      "sinhalaTitle": "අෂ්ට විමෝක්ෂ"
    },
    {
      "number": 130,
      "pali": "‘‘Yato kho, ānanda, bhikkhu ime aṭṭha vimokkhe anulomampi samāpajjati, paṭilomampi samāpajjati, anulomapaṭilomampi samāpajjati, yatthicchakaṃ yadicchakaṃ yāvaticchakaṃ samāpajjatipi vuṭṭhātipi. Āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, ayaṃ vuccatānanda, bhikkhu ubhatobhāgavimutto. Imāya ca ānanda ubhatobhāgavimuttiyā aññā ubhatobhāgavimutti uttaritarā vā paṇītatarā vā natthī’’ti. Idamavoca bhagavā. Attamano āyasmā ānando bhagavato bhāsitaṃ abhinandīti.",
      "english": "\"Ānanda, when a monk can enter and emerge from these eight liberations in direct order, in reverse order, and in both direct and reverse order, as he wishes, when he wishes, and for as long as he wishes; and through the ending of the corruptions, realizes and dwells in the taintless liberation of mind and liberation by wisdom, having directly known it for himself in this very life, he is called, Ānanda, liberated in both ways. And Ānanda, there is no other liberation in both ways that is higher or more sublime than this.\"\n\nThat is what the Blessed One said. Venerable Ānanda was pleased and rejoiced at the Blessed One's words.",
      "sinhala": "ආනන්දය, යම් භික්ෂුවක් මෙම අෂ්ට විමෝක්ෂයන්හි අනුලෝමව, ප්‍රතිලෝමව, අනුලෝමප්‍රතිලෝමව, කැමති පරිදි, කැමති මොහොතක, කැමති තාක් කල් සමාධිගතව සිටීමටත්, එයින් නැගී සිටීමටත් සමත් වේ ද, එමෙන්ම ආශ්‍රව ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ජීවිතයේදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කරගෙන වාසය කරයි ද, ආනන්දය, ඔහු උභතෝභාගවිමුක්ත භික්ෂුවක් ලෙස හැඳින්වේ. ආනන්දය, මේ උභතෝභාගවිමුක්තියට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් උභතෝභාගවිමුක්තියක් නැත.’’\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ආයුෂ්මත් ආනන්ද තෙරණුවෝ සතුටු සිතින් භාග්‍යවතුන් වහන්සේගේ මෙම දේශනාව අනුමෝදන් වූහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahānidānasuttaṃ niṭṭhitaṃ dutiyaṃ",
    "english": "The Great Causes Discourse, second, finished.",
    "sinhala": "මහානිදාන සූත්‍රය නිමි. දෙවන කොටස."
  }
}