{
  "id": "dn.2.6",
  "title": {
    "pali": "Mahāgovindasuttaṃ",
    "english": "The Great Steward Discourse.",
    "sinhala": "මහා ගෝවින්ද සූත්‍රය"
  },
  "sections": [
    {
      "number": 293,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho pañcasikho gandhabbaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ gijjhakūṭaṃ pabbataṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho pañcasikho gandhabbaputto bhagavantaṃ etadavoca – ‘‘yaṃ kho me, bhante, devānaṃ tāvatiṃsānaṃ sammukhā sutaṃ sammukhā paṭiggahitaṃ, ārocemi taṃ bhagavato’’ti. ‘‘Ārocehi me tvaṃ, pañcasikhā’’ti bhagavā avoca.",
      "english": "Thus I have heard. At one time the Blessed One was dwelling in Rajagaha, on Vulture Peak Mountain. Then, when the night was far advanced, Pañcasikha the Gandhabba's son, radiant in appearance, lit up the entirety of Vulture Peak Mountain and approached the Blessed One. Having approached, he paid homage to the Blessed One and stood to one side. Standing to one side, Pañcasikha the Gandhabba's son, said this to the Blessed One: \"Bhante, I will announce to the Blessed One that which I have heard and directly received in the presence of the Tavatimsa gods.\" \"Announce it to me, Pañcasikha,\" said the Blessed One.",
      "sinhala": "මෙසේ මා අසා ඇත. එක් කලෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ රජගහ නුවර ගිජ්ඣකූට පර්වතයේ වැඩ වාසය කළ සේක. ඉක්බිති පඤ්චසිඛ නම් ගාන්ධර්ව පුත්‍රයා රාත්‍රිය බොහෝ සෙයින් ගෙවී ගිය කල්හි, දිදුලන වර්ණයෙන් මුළු ගිජ්ඣකූට පර්වතයම ආලෝකවත් කර භාග්‍යවත් බුදුරජාණන් වහන්සේ වෙත පැමිණියේය. පැමිණ උන්වහන්සේට වන්දනා කොට එකත්පසෙක සිට ගත්තේය. එකත්පසෙක සිටි පඤ්චසිඛ ගාන්ධර්ව පුත්‍රයා භාග්‍යවත් බුදුරජාණන් වහන්සේට මෙසේ කීවේය. \"ස්වාමීනි, තාවතිංස දෙවියන්ගේ සන්නිධානයේදී මා විසින් අසන ලද, සෘජුවම පිළිගන්නා ලද යම් කරුණක් වේ නම්, එය භාග්‍යවත් බුදුරජාණන් වහන්සේට දැන්වීමට කැමැත්තෙමි.\" එවිට භාග්‍යවත් බුදුරජාණන් වහන්සේ, \"පඤ්චසිඛය, නුඹ එය මට දන්වන්න\" යැයි වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 294,
      "pali": "‘‘Purimāni, bhante, divasāni purimatarāni tadahuposathe pannarase pavāraṇāya puṇṇāya puṇṇamāya rattiyā kevalakappā ca devā tāvatiṃsā sudhammāyaṃ sabhāyaṃ sannisinnā honti sannipatitā; mahatī ca dibbaparisā samantato nisinnā honti, cattāro ca mahārājāno catuddisā nisinnā honti; puratthimāya disāya dhataraṭṭho mahārājā pacchimābhimukho nisinno hoti deve purakkhatvā; dakkhiṇāya disāya virūḷhako mahārājā uttarābhimukho nisinno hoti deve purakkhatvā; pacchimāya disāya virūpakkho mahārājā puratthābhimukho nisinno hoti deve purakkhatvā; uttarāya disāya vessavaṇo mahārājā dakkhiṇābhimukho nisinno hoti deve purakkhatvā. Yadā bhante, kevalakappā ca devā tāvatiṃsā sudhammāyaṃ sabhāyaṃ sannisinnā honti sannipatitā, mahatī ca dibbaparisā samantato nisinnā honti, cattāro ca mahārājāno catuddisā nisinnā honti, idaṃ nesaṃ hoti āsanasmiṃ; atha pacchā amhākaṃ āsanaṃ hoti. ‘‘Ye te, bhante, devā bhagavati brahmacariyaṃ caritvā adhunūpapannā tāvatiṃsakāyaṃ, te aññe deve atirocanti vaṇṇena ceva yasasā ca. Tena sudaṃ, bhante, devā tāvatiṃsā attamanā honti pamuditā pītisomanassajātā; ‘dibbā vata, bho, kāyā paripūrenti, hāyanti asurakāyā’ti.",
      "english": "\"Venerable sir, in times past, on the Uposatha day, the fifteenth, on the Pavarana day, on the full-moon night, all the Tavatimsa gods would assemble in the Sudhamma Hall; a great divine assembly would be seated all around, and the four Great Kings would be seated in the four directions. To the east, Dhatarattha, the Great King, facing west, would be seated with the gods before him; to the south, Virulhaka, the Great King, facing north, would be seated with the gods before him; to the west, Virupakkha, the Great King, facing east, would be seated with the gods before him; to the north, Vessavana, the Great King, facing south, would be seated with the gods before him. When, venerable sir, all the Tavatimsa gods assemble in the Sudhamma Hall, and a great divine assembly is seated all around, and the four Great Kings are seated in the four directions, that is their place; afterward is our place. Those gods, venerable sir, who, having lived the holy life under the Blessed One, have recently arisen in the Tavatimsa host, outshine the other gods in both beauty and glory. Therefore, venerable sir, the Tavatimsa gods are pleased, delighted, filled with joy and happiness, saying, 'Truly, the divine hosts are being filled, and the Asura hosts are dwindling!'\"",
      "sinhala": "‘‘ස්වාමීනි, පෙර දිනවල, මීට බොහෝ කලකට පෙර එක් උපෝසථ දිනයක, පසළොස්වක පොහෝ දිනයක, පුර සඳ ඇති රාත්‍රියක තාවතිංස දෙවියෝ සියල්ලෝම සුධර්මා සභාවෙහි රැස්වී සිටියහ; ඒකරාශී වී සිටියහ. මහත් දිව්‍ය පිරිසක් ද සව දෙසින් හිඳගෙන සිටියහ. සතර මහා රාජවරු ද සිව් දිසාවෙහි හිඳගෙන සිටියහ. නැගෙනහිර දිසාවෙහි ධෘතරාෂ්ට්‍ර මහරජු දෙවියන් පෙරටු කරගෙන බටහිර දිශාව බලා හිඳගෙන සිටියේය. දකුණු දිසාවෙහි විරූඪක මහරජු දෙවියන් පෙරටු කරගෙන උතුරු දිශාව බලා හිඳගෙන සිටියේය. බටහිර දිසාවෙහි විරූපාක්ෂ මහරජු දෙවියන් පෙරටු කරගෙන නැගෙනහිර දිශාව බලා හිඳගෙන සිටියේය. උතුරු දිසාවෙහි වෛශ්‍රවණ මහරජු දෙවියන් පෙරටු කරගෙන දකුණු දිශාව බලා හිඳගෙන සිටියේය. ස්වාමීනි, යම් කලෙක තාවතිංස දෙවියෝ සියල්ලෝම සුධර්මා සභාවෙහි රැස් වෙත් ද, ඒකරාශී වෙත් ද, මහත් දිව්‍ය පිරිසක් සව දෙසින් හිඳ ගනිත් ද, සතර මහා රාජවරු සිව් දිසාවෙහි හිඳ ගනිත් ද, ඔවුන්ට අසුන් ලැබෙන්නේ මෙලෙස ය. ඉන්පසු අපට අසුන් ලැබේ. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කෙරෙහි බ්‍රහ්මචර්යාවෙහි හැසිරීමෙන් යම් දෙවියන් පිරිසක් අලුතෙන් තාවතිංස දෙව්ලොවෙහි උපන්නෝ ද, ඔවුහු වර්ණයෙන් හා යසසින් අනෙක් දෙවියන් ඉක්මවා බබළති. ස්වාමීනි, එහෙයින් තාවතිංස දෙවියෝ සතුටු වෙති, ප්‍රීති වෙති, ප්‍රීතියෙන් හා සොම්නසින් පිරී සිටිති. 'දිව්‍ය කායයන් සම්පූර්ණ වේ; අසුර කායයන් පිරිහී යයි' කියා ඔවුහු ප්‍රීති වෙති.\"",
      "paliTitle": "Devasabhā",
      "englishTitle": "The Assembly of Gods",
      "sinhalaTitle": "දේව සභාව"
    },
    {
      "number": 295,
      "pali": "‘‘Atha kho, bhante, sakko devānamindo devānaṃ tāvatiṃsānaṃ sampasādaṃ viditvā imāhi gāthāhi anumodi – ‘Modanti vata bho devā, tāvatiṃsā sahindakā; Tathāgataṃ namassantā, dhammassa ca sudhammataṃ. Nave deve ca passantā, vaṇṇavante yasassine; Sugatasmiṃ brahmacariyaṃ, caritvāna idhāgate. Te aññe atirocanti, vaṇṇena yasasāyunā; Sāvakā bhūripaññassa, visesūpagatā idha. Idaṃ disvāna nandanti, tāvatiṃsā sahindakā; Tathāgataṃ namassantā, dhammassa ca sudhammata’nti. ‘‘Tena sudaṃ, bhante, devā tāvatiṃsā bhiyyoso mattāya attamanā honti pamuditā pītisomanassajātā; ‘dibbā vata, bho, kāyā paripūrenti, hāyanti asurakāyā’’’ti. ",
      "english": "\"Then, venerable sir, Sakka, lord of the gods, understanding the satisfaction of the Tāvatiṃsa gods, expressed his approval with these verses: 'Indeed, the Tāvatiṃsa gods, together with Indra, rejoice as they honor the Tathāgata and the supreme excellence of the Dhamma. Seeing these new, handsome, and glorious gods who have come here after living the holy life under the Blessed One, they outshine the others in beauty, glory, and longevity. Disciples of the one with vast wisdom, they have attained distinction here. Seeing this, the Tāvatiṃsa gods, together with Indra, rejoice as they honor the Tathāgata and the supreme excellence of the Dhamma.' It is said, venerable sir, that the Tāvatiṃsa gods became exceedingly delighted, joyful, and filled with happiness and gladness, thinking, 'Truly, the divine hosts are increasing, while the hosts of the Asuras are diminishing!'\"",
      "sinhala": "‘‘එකල්හි භාග්‍යවතුන් වහන්ස, දේವೇಂದ್ರ වූ සක් දෙවිඳු තාවතිංස දෙවියන්ගේ සතුට දැන මේ ගාථාවලින් අනුමෝදනා කළේය. ‘සක් දෙවිඳු සහිත තාවතිංස දෙවියෝ, තථාගතයන් වහන්සේට ද, ධර්මයේ සුධර්මතාවයට ද නමස්කාර කරමින් සතුටු වෙති. අලුත් දෙවියන් ද, ශෝභන වූ, යසස් ඇති දෙවියන් ද දකිමින්, සුගතයන් වහන්සේගේ බ්‍රහ්මචරියාවෙහි හැසිර මෙහි පැමිණියහ. ඔවුහු අනෙක් අයට වඩා වර්ණයෙන් ද, යසසින් ද, ආයුෂයෙන් ද ඉක්මවති. ඒ භූරි ප්‍රඥාවන්තයන්ගේ ශ්‍රාවකයෝ මෙහි විශිෂ්ටත්වයට පැමිණියහ. මෙය දැක සක් දෙවිඳු සහිත තාවතිංස දෙවියෝ, තථාගතයන් වහන්සේට ද, ධර්මයේ සුධර්මතාවයට ද නමස්කාර කරමින් සතුටු වෙතියි.’ භාග්‍යවතුන් වහන්ස, ඒ හේතුවෙන් තාවතිංස දෙවියෝ බොහෝ සෙයින් සතුටු වූහ. ප්‍රීතියෙන් හා සොම්නසින් යුක්ත වූහ. ‘දෙව් සිරුරු සම්පූර්ණ වෙයි. අසුර සිරුරු පිරිහෙයි’යි පැවසූහ.’’",
      "paliTitle": ""
    },
    {
      "number": 296,
      "pali": "‘‘Atha kho, bhante, sakko devānamindo devānaṃ tāvatiṃsānaṃ sampasādaṃ viditvā deve tāvatiṃse āmantesi – ‘iccheyyātha no tumhe, mārisā, tassa bhagavato aṭṭha yathābhucce vaṇṇe sotu’nti? ‘Icchāma mayaṃ, mārisa, tassa bhagavato aṭṭha yathābhucce vaṇṇe sotu’nti. Atha kho, bhante, sakko devānamindo devānaṃ tāvatiṃsānaṃ bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi – ‘taṃ kiṃ maññanti, bhonto devā tāvatiṃsā? Yāvañca so bhagavā bahujanahitāya paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Evaṃ bahujanahitāya paṭipannaṃ bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Svākkhāto kho pana tena bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhi. Evaṃ opaneyyikassa dhammassa desetāraṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Idaṃ kusalanti kho pana tena bhagavatā supaññattaṃ, idaṃ akusalanti supaññattaṃ. Idaṃ sāvajjaṃ idaṃ anavajjaṃ, idaṃ sevitabbaṃ idaṃ na sevitabbaṃ, idaṃ hīnaṃ idaṃ paṇītaṃ, idaṃ kaṇhasukkasappaṭibhāganti supaññattaṃ. Evaṃ kusalākusalasāvajjānavajjasevitabbāsevitabbahīna- paṇītakaṇhasukkasappaṭibhāgānaṃ dhammānaṃ paññapetāraṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Supaññattā kho pana tena bhagavatā sāvakānaṃ nibbānagāminī paṭipadā, saṃsandati nibbānañca paṭipadā ca. Seyyathāpi nāma gaṅgodakaṃ yamunodakena saṃsandati sameti, evameva supaññattā tena bhagavatā sāvakānaṃ nibbānagāminī paṭipadā, saṃsandati nibbānañca paṭipadā ca. Evaṃ nibbānagāminiyā paṭipadāya paññapetāraṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Abhinipphanno [abhinippanno (pī. ka.)] kho pana tassa bhagavato lābho abhinipphanno siloko, yāva maññe khattiyā sampiyāyamānarūpā viharanti, vigatamado kho pana so bhagavā āhāraṃ āhāreti. Evaṃ vigatamadaṃ āhāraṃ āharayamānaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Laddhasahāyo kho pana so bhagavā sekhānañceva paṭipannānaṃ khīṇāsavānañca vusitavataṃ. Te bhagavā apanujja ekārāmataṃ anuyutto viharati. Evaṃ ekārāmataṃ anuyuttaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Yathāvādī kho pana so bhagavā tathākārī, yathākārī tathāvādī, iti yathāvādī tathākārī, yathākārī tathāvādī. Evaṃ dhammānudhammappaṭipannaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Tiṇṇavicikiccho kho pana so bhagavā vigatakathaṃkatho pariyositasaṅkappo ajjhāsayaṃ ādibrahmacariyaṃ. Evaṃ tiṇṇavicikicchaṃ vigatakathaṃkathaṃ pariyositasaṅkappaṃ ajjhāsayaṃ ādibrahmacariyaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā’ti.",
      "english": "\"Then, venerable sir, Sakka, lord of the gods, knowing the satisfaction of the gods of Tāvatiṃsa, addressed them, saying: 'Venerable sirs, would you like to hear the eight truly remarkable qualities of that Blessed One?' 'Yes, venerable sir, we would like to hear the eight truly remarkable qualities of that Blessed One.' Thereupon, venerable sir, Sakka, lord of the gods, proclaimed to the gods of Tāvatiṃsa the eight truly remarkable qualities of the Blessed One: 'What do you, gods of Tāvatiṃsa, think? In that the Blessed One is committed to the welfare of the many, to the happiness of the many, out of compassion for the world, for the benefit, well-being, and happiness of gods and humans, we see no other teacher, past or present, endowed with this quality, except for that Blessed One.\n\n'Furthermore, the Dhamma is well-proclaimed by that Blessed One: visible here and now, timeless, inviting verification, leading onward, and to be personally experienced by the wise. We see no other teacher, past or present, endowed with this quality of teaching such a Dhamma, except for that Blessed One.\n\n'Moreover, 'this is skillful' is well-defined by that Blessed One, 'this is unskillful' is well-defined; 'this is blameworthy,' 'this is blameless;' 'this should be cultivated,' 'this should not be cultivated;' 'this is inferior,' 'this is superior;' 'this is the counterpart of dark and bright' is well-defined. We see no other teacher, past or present, endowed with this quality of defining what is skillful and unskillful, blameworthy and blameless, what should and should not be cultivated, what is inferior and superior, and the distinction between dark and bright, except for that Blessed One.\n\n'Furthermore, the path leading to Nibbāna for the disciples is well-expounded by that Blessed One, and Nibbāna and the path converge. Just as the water of the Ganges converges and unites with the water of the Yamuna, so too, the path leading to Nibbāna for the disciples is well-expounded by that Blessed One, and Nibbāna and the path converge. We see no other teacher, past or present, endowed with this quality of expounding the path leading to Nibbāna, except for that Blessed One.\n\n'Moreover, the gain and renown of that Blessed One are fully realized. Even kings live respectfully towards him, and the Blessed One consumes food without vanity. We see no other teacher, past or present, endowed with this quality of consuming food without vanity, except for that Blessed One.\n\n'Furthermore, that Blessed One has found worthy companions, both among those still training and among arahants who have completed their training. The Blessed One, having renounced distractions, lives devoted to solitude. We see no other teacher, past or present, endowed with this quality of being devoted to solitude, except for that Blessed One.\n\n'Furthermore, that Blessed One speaks as he acts, and acts as he speaks; thus, he speaks as he acts, and acts as he speaks. We see no other teacher, past or present, endowed with this quality of practicing in accordance with the Dhamma, except for that Blessed One.\n\n'Furthermore, that Blessed One has overcome doubt, dispelled uncertainty, perfected his understanding, and has unwavering conviction in the value of the holy life from its very beginning. We see no other teacher, past or present, endowed with this quality of having overcome doubt, dispelled uncertainty, perfected his understanding, and having unwavering conviction in the value of the holy life from its very beginning, except for that Blessed One.'\"",
      "sinhala": "‘‘අනතුරුව, භාග්‍යවතුන් වහන්සේ කෙරෙහි දෙවියන්ගේ පැහැදීමක් ඇති බව දැනගත් සක් දෙවිඳු, තව්තිසා දෙවියන්ට මෙසේ ඇමතුවේය: ‘පින්වත්නි, ඒ භාග්‍යවතුන් වහන්සේගේ සැබෑ ගුණ අටක් අසන්නට ඔබ කැමතිද?’ ‘පින්වත, අපි ඒ භාග්‍යවතුන් වහන්සේගේ සැබෑ ගුණ අටක් අසන්නට කැමැත්තෙමු.’\n\nඉක්බිති සක් දෙවිඳු තව්තිසා දෙවියන්ට භාග්‍යවතුන් වහන්සේගේ සැබෑ ගුණ අට මෙසේ පැහැදිලි කළේය: ‘තව්තිසා දෙවියනි, ඔබ සිතන්නේ කුමක්ද? ඒ භාග්‍යවතුන් වහන්සේ බොහෝ දෙනාගේ හිත සුව පිණිසත්, බොහෝ දෙනාගේ සතුට පිණිසත්, ලෝකයාට අනුකම්පාවෙන් දෙවියන්ටත් මිනිසුන්ටත් වැඩ පිණිසත්, හිත සුව පිණිසත් පිළිපන්නාහ. මෙසේ බොහෝ දෙනාගේ හිතසුව පිණිස පිළිපන්නාවූ, බොහෝ දෙනාගේ සතුට පිණිස, ලෝකයාට අනුකම්පාවෙන් දෙවියන්ටත් මිනිසුන්ටත් වැඩ පිණිස, හිත සුව පිණිස පිළිපන්නාවූ මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.\n\n‘‘ඒ භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය ස්වාක්ඛාතය. සන්දිට්ඨිකය. අකාලිකය. ඒහිපස්සිකය. ඕපනෙය්‍යිකය. විඤ්ඤූන් විසින් පෞද්ගලිකවම දැනගත යුත්තකි. මෙසේ ඕපනෙය්‍යික ධර්මයක් දේශනා කරන මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.\n\n‘‘‘මෙය කුසලයයි’ කියාත්, ‘මෙය අකුසලයයි’ කියාත් ඒ භාග්‍යවතුන් වහන්සේ විසින් මැනවින් ප්‍රකාශ කරන ලදී. ‘මෙය සාවද්‍යය’ ‘මෙය අනවද්‍යය’ ‘මෙය සේවනය කළ යුතුය’ ‘මෙය සේවනය නොකළ යුතුය’ ‘මෙය හීනය’ ‘මෙය ප්‍රණීතය’ ‘මෙය කළු සුදු මිශ්‍ර පැත්තයි’ කියාත් මැනවින් ප්‍රකාශ කරන ලදී. මෙසේ කුසල අකුසල, සාවද්‍ය අනවද්‍ය, සේවනය කළ යුතු නොකළ යුතු, හීන ප්‍රණීත, කළු සුදු මිශ්‍ර පැත්ත යන ධර්මයන් ප්‍රකාශ කරන මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.\n\n‘‘ඒ භාග්‍යවතුන් වහන්සේ විසින් ශ්‍රාවකයන්ට නිවනට යන මාර්ගය මැනවින් ප්‍රකාශ කරන ලද්දේය. ඒ නිවනත් මාර්ගයත් එකට ගැළපේ. ගංගා නම් ගඟේ වතුර යමුනා නම් ගඟේ වතුර හා එකට ගැළපෙන්නාක් මෙන්, ඒ භාග්‍යවතුන් වහන්සේ විසින් ශ්‍රාවකයන්ට නිවනට යන මාර්ගය මැනවින් ප්‍රකාශ කරන ලද්දේය. ඒ නිවනත් මාර්ගයත් එකට ගැළපේ. මෙසේ නිවනට යන මාර්ගය ප්‍රකාශ කරන මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.\n\n‘‘ඒ භාග්‍යවතුන් වහන්සේට ලාභය උපන්නා. කීර්තිය උපන්නා. රජවරු පවා ප්‍රියමනාප ස්වරූපයෙන් වාසය කරති. ඒ භාග්‍යවතුන් වහන්සේ කිසිම මදයක් නැතිව ආහාර වළඳති. මෙසේ කිසිම මදයක් නැතිව ආහාර වළඳන මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.\n\n‘‘ඒ භාග්‍යවතුන් වහන්සේ ශික්ෂාපදයෙහි හික්මෙමින් සිටින අයටත්, කෙලෙස් නසා නිමවූ අයටත්, බඹසර වැස නිම කළ අයටත් යහළුවූ සේක. ඒ භාග්‍යවතුන් වහන්සේ ඔවුන්ව ඈත්කර තනිවම වාසය කිරීමට ඇලුම් කරමින් වාසය කරති. මෙසේ තනිවම වාසය කිරීමට ඇලුම් කරන මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.\n\n‘‘ඒ භාග්‍යවතුන් වහන්සේ යම් දෙයක් වදාරණ සේක්ද, එය එසේම කරණ සේක. යම් දෙයක් කරණ සේක්ද, එය එසේම වදාරණ සේක. එබැවින් යමක් වදාරන්නේ එය කරන්නේය. යමක් කරන්නේ එය වදාරන්නේය. මෙසේ ධර්මයට අනුව ධර්මයෙහි හැසිරෙන මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.\n\n‘‘ඒ භාග්‍යවතුන් වහන්සේ සැකය දුරු කළ සේක. කිසිම කුකුසක් නැති සේක. සියලු කල්පනා නිම කළ සේක. මුල් බඹසරෙහිම අධ්‍යාශයෙන් යුක්ත සේක. මෙසේ සැකය දුරු කළාවූ, කිසිම කුකුසක් නැත්තාවූ, සියලු කල්පනා නිම කළාවූ, මුල් බඹසරෙහිම අධ්‍යාශයෙන් යුක්ත මේ ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී හෝ අප දැක නැත. දැන්වත් දකින්නට නැත.’’’",
      "paliTitle": "Aṭṭha yathābhuccavaṇṇā",
      "englishTitle": "Eight descriptions according to reality",
      "sinhalaTitle": "අට යථාභූත වර්ණනා"
    },
    {
      "number": 297,
      "pali": "‘‘Ime kho, bhante, sakko devānamindo devānaṃ tāvatiṃsānaṃ bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi. Tena sudaṃ, bhante, devā tāvatiṃsā bhiyyoso mattāya attamanā honti pamuditā pītisomanassajātā bhagavato aṭṭha yathābhucce vaṇṇe sutvā. Tatra, bhante, ekacce devā evamāhaṃsu – ‘aho vata, mārisā, cattāro sammāsambuddhā loke uppajjeyyuṃ dhammañca deseyyuṃ yathariva bhagavā. Tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’nti. Ekacce devā evamāhaṃsu – ‘tiṭṭhantu, mārisā, cattāro sammāsambuddhā, aho vata, mārisā, tayo sammāsambuddhā loke uppajjeyyuṃ dhammañca deseyyuṃ yathariva bhagavā. Tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’nti. Ekacce devā evamāhaṃsu – ‘tiṭṭhantu, mārisā, tayo sammāsambuddhā, aho vata, mārisā, dve sammāsambuddhā loke uppajjeyyuṃ dhammañca deseyyuṃ yathariva bhagavā. Tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’nti.",
      "english": "Venerable sir, Sakka, the king of the gods, recited these eight accurate descriptions of the Blessed One to the gods of Tāvatiṃsa. As a result, venerable sir, upon hearing these eight accurate descriptions of the Blessed One, the gods of Tāvatiṃsa became exceedingly glad, joyful, and filled with delight and happiness. Then, venerable sir, some of the gods said, ‘Oh, if only four Fully Awakened Buddhas would arise in the world and teach the Dhamma just as the Blessed One does! That would be for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans.’ Other gods said, ‘Never mind four Fully Awakened Buddhas! Oh, if only three Fully Awakened Buddhas would arise in the world and teach the Dhamma just as the Blessed One does! That would be for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans.’ Still other gods said, ‘Never mind three Fully Awakened Buddhas! Oh, if only two Fully Awakened Buddhas would arise in the world and teach the Dhamma just as the Blessed One does! That would be for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans.’",
      "sinhala": "භාග්‍යවතුන් වහන්ස, දෙවියන්ගේ අධිපති වූ ශක්‍රයා තව්තිසා දෙවියන්ට භාග්‍යවතුන් වහන්සේගේ යථාභූත වූ ගුණ අටක් පැවසුවේය. භාග්‍යවතුන් වහන්ස, ඒ නිසාම තව්තිසා දෙවියෝ භාග්‍යවතුන් වහන්සේගේ යථාභූත වූ ගුණ අට අසා අතිශයින් සතුටු වූවාහු, ප්‍රීති ප්‍රමෝදයට පත් වූවාහු, ප්‍රීති සෝමනස්සයෙන් උපන්නාහු වූහ.\n\nභාග්‍යවතුන් වහන්ස, එහි සිටි ඇතැම් දෙවියෝ මෙසේ කීහ: ‘පින්වත්නි, භාග්‍යවතුන් වහන්සේ මෙන් සතර සම්‍යක් සම්බුදුවරුන් ලෝකයේ පහළ වී ධර්මය දේශනා කරන්නේ නම්, එය බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, ලෝකයා කෙරෙහි අනුකම්පාව පිණිස, දෙවිමිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස වන්නේය.’\n\nතවත් ඇතැම් දෙවියෝ මෙසේ කීහ: ‘පින්වත්නි, සම්‍යක් සම්බුදුවරුන් සිව් නමක් පහළ වීම ගැන කීම නවතමු. ආශ්චර්යයකි, පින්වත්නි, සම්‍යක් සම්බුදුවරුන් තිදෙනෙක් ලෝකයේ පහළ වී භාග්‍යවතුන් වහන්සේ මෙන් ධර්මය දේශනා කරන්නේ නම්, එය බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, ලෝකයා කෙරෙහි අනුකම්පාව පිණිස, දෙවිමිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස වන්නේය.’\n\nතවත් ඇතැම් දෙවියෝ මෙසේ කීහ: ‘පින්වත්නි, සම්‍යක් සම්බුදුවරුන් තිදෙනෙකු පහළ වීම ගැන කීම නවතමු. ආශ්චර්යයකි, පින්වත්නි, සම්‍යක් සම්බුදුවරුන් දෙදෙනෙක් ලෝකයේ පහළ වී භාග්‍යවතුන් වහන්සේ මෙන් ධර්මය දේශනා කරන්නේ නම්, එය බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, ලෝකයා කෙරෙහි අනුකම්පාව පිණිස, දෙවිමිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස වන්නේය.’",
      "paliTitle": ""
    },
    {
      "number": 298,
      "pali": "‘‘Evaṃ vutte, bhante, sakko devānamindo deve tāvatiṃse etadavoca – ‘aṭṭhānaṃ kho etaṃ, mārisā, anavakāso, yaṃ ekissā lokadhātuyā dve arahanto sammāsambuddhā apubbaṃ acarimaṃ uppajjeyyuṃ, netaṃ ṭhānaṃ vijjati. Aho vata, mārisā, so bhagavā appābādho appātaṅko ciraṃ dīghamaddhānaṃ tiṭṭheyya. Tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’nti. Atha kho, bhante, yenatthena devā tāvatiṃsā sudhammāyaṃ sabhāyaṃ sannisinnā honti sannipatitā, taṃ atthaṃ cintayitvā taṃ atthaṃ mantayitvā vuttavacanāpi taṃ cattāro mahārājāno tasmiṃ atthe honti. Paccānusiṭṭhavacanāpi taṃ cattāro mahārājāno tasmiṃ atthe honti, sakesu sakesu āsanesu ṭhitā avipakkantā. Te vuttavākyā rājāno, paṭiggayhānusāsaniṃ; Vippasannamanā santā, aṭṭhaṃsu samhi āsaneti.",
      "english": "“When this was said, Venerable Sir, Sakka, the lord of devas, spoke to the Tāvatiṃsa devas: ‘Indeed, friends, it is an impossibility, an occasion that cannot be, that in one world system two Arahants, Fully Self-Awakened Ones, would arise simultaneously, without one preceding or following the other. Such a situation does not exist. Oh, if only, friends, that Blessed One would remain healthy and free from ailment for a long, extended period! That would be for the welfare of many, for the happiness of many, out of compassion for the world, for the good, welfare, and happiness of devas and humans.’\n\nThen, Venerable Sir, concerning the matter for which the Tāvatiṃsa devas were assembled and gathered in the Sudhammā assembly hall, having reflected on that matter and having deliberated on that matter, the Four Great Kings also expressed their agreement regarding that matter. The Four Great Kings also gave their assent regarding that matter, remaining in their respective seats and not having departed. Those kings, having expressed their agreement, accepted the instruction, and being with greatly gladdened minds, remained in their seats.",
      "sinhala": "භාග්‍යවතුන් වහන්ස, මෙසේ පැවසූ කල්හි සක් දෙවිඳු තව්තිසා දෙවියන්ට මෙසේ කීවේ ය: “ඇවැත්නි, එකම ලෝකධාතුවක එකවර අරහත් සම්මා සම්බුදුවරුන් දෙදෙනෙකු පහළ වීම අස්ථානයකි. එයට අවකාශයක් නැත. එබඳු දෙයක් සිදු විය නොහැකිය. අහෝ, ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ රෝගාබාධවලින් තොරව, කායික පීඩාවලින් තොරව බොහෝ කලක් වැඩ සිටිය මැනව! එය බොහෝ දෙනාගේ හිත සුව පිණිස ද, ලෝකයාට අනුකම්පාව පිණිස ද, දෙවි මිනිසුන්ගේ යහපත පිණිස ද හේතු වේවා!”\n\nභාග්‍යවතුන් වහන්ස, තව්තිසා දෙවියෝ යම් කරුණක් සඳහා සුධර්මා සභාවෙහි රැස්ව සිටියේ ද, ඒ කරුණ ගැන සිතා මන්ත්‍රණය කළ පසු, සිව් මහා දිව්‍ය රාජවරු ද ඒ පිළිබඳව වචන ප්‍රකාශ කළහ. තමන්ගේ ආසනවලම සිටිමින්, ඉවත්ව නොගිය එම සිව් මහා දිව්‍ය රාජවරු ද ඒ කරුණ සම්බන්ධයෙන් උපදෙස් දුන්හ.\n\nඑම රජවරු වචන පවසා,\nඅනුශාසනා පිළිගෙන සතුටු සිත් ඇතිව,\nතමන්ගේ ආසනවලම සිටියහ.",
      "paliTitle": ""
    },
    {
      "number": 299,
      "pali": "‘‘Atha kho, bhante, uttarāya disāya uḷāro āloko sañjāyi, obhāso pāturahosi atikkammeva devānaṃ devānubhāvaṃ. Atha kho, bhante, sakko devānamindo deve tāvatiṃse āmantesi – ‘yathā kho, mārisā, nimittāni dissanti, uḷāro āloko sañjāyati, obhāso pātubhavati, brahmā pātubhavissati; brahmuno hetaṃ pubbanimittaṃ pātubhāvāya, yadidaṃ āloko sañjāyati obhāso pātubhavatīti. ‘Yathā nimittā dissanti, brahmā pātubhavissati; Brahmuno hetaṃ nimittaṃ, obhāso vipulo mahā’ti.",
      "english": "Then, venerable sir, from the northern direction, a grand light arose and a radiance appeared, surpassing even the divine power of the gods.\n\nThen, venerable sir, Sakka, the lord of the gods, addressed the Tāvatiṃsa gods: 'Indeed, friends, just as these signs are seen – a grand light arises and a radiance appears – Brahmā will appear. This is a preliminary sign of Brahmā's appearance: the arising of light and the appearance of radiance.' 'Just as the signs are seen, Brahmā will appear; this is a sign of Brahmā, a vast and magnificent radiance.'",
      "sinhala": "භාග්‍යවතුන් වහන්ස, එකල්හි උතුරු දිශාවෙන් දෙවියන්ගේ ආනුභාවය ඉක්මවා යන මහත් ආලෝකයක් හටගත්තේය. දීප්තියක් ද පහළ විය. භාග්‍යවතුන් වහන්ස, සක් දෙවිඳු තාවතිංසයෙහි දෙවියන්ට මෙසේ ඇමතුවේය: “පින්වත්නි, යම් පරිදි පෙර නිමිති පෙනේද, මහත් ආලෝකයක් හටගන්නේද, දීප්තියක් පහළ වන්නේද, බ්‍රහ්මයා පහළ වනු ඇත. ආලෝකය හටගැනීමත්, දීප්තිය පහළ වීමත් බ්‍රහ්මයාගේ පහළ වීමට පෙර නිමිත්තකි. පෙර නිමිති පෙනෙන පරිදි බ්‍රහ්මයා පහළ වනු ඇත. මෙය බ්‍රහ්මයාගේ නිමිත්තකි. එය මහත් වූ, විශාල වූ දීප්තියකි.”",
      "paliTitle": ""
    },
    {
      "number": 300,
      "pali": "‘‘Atha kho, bhante, devā tāvatiṃsā yathāsakesu āsanesu nisīdiṃsu – ‘obhāsametaṃ ñassāma, yaṃvipāko bhavissati, sacchikatvāva naṃ gamissāmā’ti. Cattāropi mahārājāno yathāsakesu āsanesu nisīdiṃsu – ‘obhāsametaṃ ñassāma, yaṃvipāko bhavissati, sacchikatvāva naṃ gamissāmā’ti. Idaṃ sutvā devā tāvatiṃsā ekaggā samāpajjiṃsu – ‘obhāsametaṃ ñassāma, yaṃvipāko bhavissati, sacchikatvāva naṃ gamissāmā’ti. ‘‘Yadā, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, oḷārikaṃ attabhāvaṃ abhinimminitvā pātubhavati. Yo kho pana, bhante, brahmuno pakativaṇṇo, anabhisambhavanīyo so devānaṃ tāvatiṃsānaṃ cakkhupathasmiṃ. Yadā, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, so aññe deve atirocati vaṇṇena ceva yasasā ca. Seyyathāpi, bhante, sovaṇṇo viggaho mānusaṃ viggahaṃ atirocati, evameva kho, bhante, yadā brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, so aññe deve atirocati vaṇṇena ceva yasasā ca. Yadā, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, na tassaṃ parisāyaṃ koci devo abhivādeti vā paccuṭṭheti vā āsanena vā nimanteti. Sabbeva tuṇhībhūtā pañjalikā pallaṅkena nisīdanti – ‘yassadāni devassa pallaṅkaṃ icchissati brahmā sanaṅkumāro, tassa devassa pallaṅke nisīdissatī’ti. Yassa kho pana, bhante, devassa brahmā sanaṅkumāro pallaṅke nisīdati, uḷāraṃ so labhati devo vedapaṭilābhaṃ, uḷāraṃ so labhati devo somanassapaṭilābhaṃ. Seyyathāpi, bhante, rājā khattiyo muddhāvasitto adhunābhisitto rajjena, uḷāraṃ so labhati vedapaṭilābhaṃ, uḷāraṃ so labhati somanassapaṭilābhaṃ, evameva kho, bhante, yassa devassa brahmā sanaṅkumāro pallaṅke nisīdati, uḷāraṃ so labhati devo vedapaṭilābhaṃ, uḷāraṃ so labhati devo somanassapaṭilābhaṃ. Atha, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ sampasādaṃ viditvā antarahito imāhi gāthāhi anumodi – ‘Modanti vata bho devā, tāvatiṃsā sahindakā; Tathāgataṃ namassantā, dhammassa ca sudhammataṃ. ‘Nave deve ca passantā, vaṇṇavante yasassine; Sugatasmiṃ brahmacariyaṃ, caritvāna idhāgate. ‘Te aññe atirocanti, vaṇṇena yasasāyunā; Sāvakā bhūripaññassa, visesūpagatā idha. ‘Idaṃ disvāna nandanti, tāvatiṃsā sahindakā; Tathāgataṃ namassantā, dhammassa ca sudhammata’nti.",
      "english": "Then, venerable sir, the Tāvatiṃsa gods sat down on their respective seats, thinking, \"We will understand this radiance, what its result will be; having directly realized it, we will go.\" The Four Great Kings also sat down on their respective seats, thinking, \"We will understand this radiance, what its result will be; having directly realized it, we will go.\" Having heard this, the Tāvatiṃsa gods became unified in mind, thinking, \"We will understand this radiance, what its result will be; having directly realized it, we will go.\"\n\nWhen Brahmā Sanaṅkumāra appears to the Tāvatiṃsa gods, venerable sir, he does so by creating a coarse, material form. For the natural radiance of Brahmā, venerable sir, is beyond the range of vision of the Tāvatiṃsa gods. When Brahmā Sanaṅkumāra appears to the Tāvatiṃsa gods, venerable sir, he surpasses the other gods in both beauty and glory. Just as a golden statue surpasses a human figure, so too, venerable sir, when Brahmā Sanaṅkumāra appears to the Tāvatiṃsa gods, he surpasses the other gods in both beauty and glory. When Brahmā Sanaṅkumāra appears to the Tāvatiṃsa gods, venerable sir, no god in that assembly greets him, rises for him, or invites him to a seat. Instead, all remain silent, with hands clasped, seated cross-legged, thinking, \"On whichever god's seat Brahmā Sanaṅkumāra wishes to sit, on that god's seat he will sit.\" And the god on whose seat Brahmā Sanaṅkumāra sits, venerable sir, obtains great joy and great satisfaction. Just as a khattiya king, anointed and newly consecrated to the kingship, obtains great joy and great satisfaction, so too, venerable sir, the god on whose seat Brahmā Sanaṅkumāra sits obtains great joy and great satisfaction.\n\nThen, venerable sir, Brahmā Sanaṅkumāra, knowing the faith and devotion of the Tāvatiṃsa gods, disappeared and expressed his approval with these verses:\n\n\"Truly, the Tāvatiṃsa gods, together with Indra, rejoice,\nRevering the Tathāgata and the well-taught nature of the Dhamma.\n\nSeeing the new gods, beautiful and glorious,\nWho, having lived the holy life in the Sugata's dispensation, have come here.\n\nThey outshine the others in beauty, glory, and lifespan,\nThese disciples of vast wisdom, who have attained distinction here.\n\nSeeing this, the Tāvatiṃsa gods, together with Indra, rejoice,\nRevering the Tathāgata and the well-taught nature of the Dhamma.\"",
      "sinhala": "භාග්‍යවතුන් වහන්ස, ඉක්බිති තාවතිංස දෙවියෝ, \"මේ ආලෝකය කුමක්ද, එහි විපාකය කෙසේ වේදැයි අපි දැනගනිමු. එය ඇසින් දැක නිසැකවම අවබෝධ කර ගනිමු\" යි සිතා තම තමන්ගේ ආසනවල හිඳ ගත්හ. සිව්මහ රාජ දෙවිවරු ද, \"මේ ආලෝකය කුමක්ද, එහි විපාකය කෙසේ වේදැයි අපි දැනගනිමු. එය ඇසින් දැක නිසැකවම අවබෝධ කර ගනිමු\" යි සිතා තම තමන්ගේ ආසනවල හිඳ ගත්හ. මෙය ඇසූ තාවතිංස දෙවියෝ, \"මේ ආලෝකය කුමක්ද, එහි විපාකය කෙසේ වේදැයි අපි දැනගනිමු. එය ඇසින් දැක නිසැකවම අවබෝධ කර ගනිමු\" යි සිතා එකඟ සිත් ඇතිව කල්පනා කළහ.\n\nභාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට දර්ශනය වන විට, විශිෂ්ට රූපකායක් මවාගෙන දර්ශනය වෙයි. භාග්‍යවතුන් වහන්ස, බ්‍රහ්මයාගේ ස්වභාවික රූපය තාවතිංස දෙවියන්ගේ ඇස්වලට ගෝචර නොවේ. භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට දර්ශනය වන විට, වර්ණයෙන් හා යසසින් අනෙකුත් දෙවියන්ට වඩා උසස් වෙයි. භාග්‍යවතුන් වහන්ස, රන් පිළිමයක් මිනිස් රුවකට වඩා ශෝභාමත් වන්නා සේම, සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට දර්ශනය වන විට, වර්ණයෙන් හා යසසින් අනෙකුත් දෙවියන්ට වඩා උසස් වෙයි.\n\nභාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට දර්ශනය වන විට, කිසිදු දෙවියෙක් ඔහුට ආචාර කිරීමක්, නැඟී සිටීමක් හෝ ආසනයක් පිරිනැමීමක් නොකරයි. සියලු දෙනාම නිහඬව, දොහොත් මුදුන් දී, පර්යංක බැඳගෙන හිඳිති. \"දැන් සනංකුමාර බ්‍රහ්මයා කුමන දෙවියාගේ ආසනයක හිඳ ගැනීමට කැමති වේද, ඒ දෙවියාගේ ආසනයේ හිඳ ගනීවි\" යි සිතති. භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා යම් දෙවියාගේ ආසනයේ හිඳ ගනීද, ඒ දෙවියා උතුම් ප්‍රීතියක් හා සොම්නසක් ලබයි. භාග්‍යවතුන් වහන්ස, අභිෂේක ලැබූ ක්ෂත්‍රීය රජෙක් රාජ්‍යත්වයෙන් උදාර ප්‍රීතියක් හා සොම්නසක් ලබන්නා සේම, සනංකුමාර බ්‍රහ්මයා යම් දෙවියාගේ ආසනයේ හිඳ ගනීද, ඒ දෙවියා උතුම් ප්‍රීතියක් හා සොම්නසක් ලබයි.\n\nභාග්‍යවතුන් වහන්ස, ඉක්බිති සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ගේ සතුට දැන, අතුරුදහන් වී, මෙම ගාථා වලින් අනුමෝදනා කළේය:\n\n\"ඉන්ද්‍ර දෙවියන් ඇතුළු තාවතිංස දෙවියෝ සතුටු වෙති. තථාගතයන් වහන්සේට නමස්කාර කරමින්, ධර්මයේ යහපත් ස්වභාවය අගය කරමින් ප්‍රීති වෙති.\nසුගතයන් වහන්සේගේ ධර්මයෙහි බඹසර හැසිර මෙහි පැමිණි, වර්ණවත්, යසස් ඇති නව දෙවියන් ද දකිමින් ඔවුහු ප්‍රීති වෙති.\nඔවුහු වර්ණයෙන්, යසසින් හා ආයුෂයෙන් අන්‍යයන් ඉක්මවති. භූරි ප්‍රඥාවන්තයාණන්ගේ ශ්‍රාවකයෝ මෙහි විශේෂත්වයට පැමිණියහ.\nමෙය දැක ඉන්ද්‍ර දෙවියන් ඇතුළු තාවතිංස දෙවියෝ ප්‍රීති වෙති. තථාගතයන් වහන්සේට නමස්කාර කරමින්, ධර්මයේ යහපත් ස්වභාවය අගය කරමින් ප්‍රීති වෙති.\"",
      "paliTitle": "Sanaṅkumārakathā",
      "englishTitle": "The Story of Sanankumara",
      "sinhalaTitle": "සනංකුමාර කථාව"
    },
    {
      "number": 301,
      "pali": "‘‘Imamatthaṃ, bhante, brahmā sanaṅkumāro abhāsittha. Imamatthaṃ, bhante, brahmuno sanaṅkumārassa bhāsato aṭṭhaṅgasamannāgato saro hoti vissaṭṭho ca viññeyyo ca mañju ca savanīyo ca bindu ca avisārī ca gambhīro ca ninnādī ca. Yathāparisaṃ kho pana, bhante, brahmā sanaṅkumāro sarena viññāpeti, na cassa bahiddhā parisāya ghoso niccharati. Yassa kho pana, bhante, evaṃ aṭṭhaṅgasamannāgato saro hoti, so vuccati ‘brahmassaro’ti. Atha kho, bhante, devā tāvatiṃsā brahmānaṃ sanaṅkumāraṃ etadavocuṃ – ‘sādhu, mahābrahme, etadeva mayaṃ saṅkhāya modāma; atthi ca sakkena devānamindena tassa bhagavato aṭṭha yathābhuccā vaṇṇā bhāsitā; te ca mayaṃ saṅkhāya modāmā’ti. ",
      "english": "Venerable Sir, Brahma Sanankumara spoke on this matter. Venerable Sir, as Brahma Sanankumara spoke, his voice possessed eight qualities: it was distinct, intelligible, pleasant, audible, connected, unscattered, deep, and resonant. Moreover, Venerable Sir, Brahma Sanankumara made himself understood with his voice according to the assembly present, yet his voice did not carry beyond that assembly. Indeed, Venerable Sir, a voice endowed with these eight qualities is called a 'Brahma-voice'. Then, Venerable Sir, the Tavatimsa gods said to Brahma Sanankumara: 'Excellent, Great Brahma! We rejoice in reflecting on this very matter. Furthermore, Sakka, the king of the gods, has spoken eight true virtues of that Blessed One, and we also rejoice in reflecting on them.'",
      "sinhala": "වහන්ස, මේ කාරණය සනංකුමාර බ්‍රහ්මයා විසින් ප්‍රකාශ කරන ලදී. වහන්ස, සනංකුමාර බ්‍රහ්මයා මෙය ප්‍රකාශ කරන විට ඔහුගේ හඬ අංග අටකින් යුක්ත විය. එනම්, එය පැහැදිලි, වටහාගත හැකි, මනරම්, ශ්‍රවණයට ප්‍රිය, සංක්ෂිප්ත, විසිරී නොයන, ගාම්භීර, සහ නාද සහිත විය. තවද, වහන්ස, සනංකුමාර බ්‍රහ්මයා තම හඬින් සභාවට සුදුසු පරිදි කරුණු පැහැදිලි කරන අතර ඔහුගේ හඬ සභාවෙන් පිටතට පැතිරෙන්නේ නැත. වහන්ස, යමෙකුගේ හඬ මෙසේ අංග අටකින් යුක්ත වේ නම්, එය 'බ්‍රහ්ම ස්වරයක්' ලෙස හැඳින්වේ. එවිට, වහන්ස, තව්තිසා දෙවියෝ සනංකුමාර බ්‍රහ්මයාට මෙසේ කීහ: 'මහ බ්‍රහ්මයාණෙනි, එය මැනවි! අපි මේ කාරණය සිහිපත් කරමින් සතුටු වෙමු. තවද, දෙවියන්ගේ අධිපති සක්‍රයා විසින් භාග්‍යවතුන් වහන්සේගේ සැබෑ ගුණ අටක් දේශනා කර ඇත. අපි ඒවා සිහිපත් කරමින් සතුටු වෙමු.'",
      "paliTitle": ""
    },
    {
      "number": 302,
      "pali": "‘‘Atha, bhante, brahmā sanaṅkumāro sakkaṃ devānamindaṃ etadavoca – ‘sādhu, devānaminda, mayampi tassa bhagavato aṭṭha yathābhucce vaṇṇe suṇeyyāmā’ti. ‘Evaṃ mahābrahme’ti kho, bhante, sakko devānamindo brahmuno sanaṅkumārassa bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi. ‘‘Taṃ kiṃ maññati, bhavaṃ mahābrahmā? Yāvañca so bhagavā bahujanahitāya paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Evaṃ bahujanahitāya paṭipannaṃ bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Svākkhāto kho pana tena bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhi. Evaṃ opaneyyikassa dhammassa desetāraṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Idaṃ kusala’nti kho pana tena bhagavatā supaññattaṃ, ‘idaṃ akusala’nti supaññattaṃ, ‘idaṃ sāvajjaṃ idaṃ anavajjaṃ, idaṃ sevitabbaṃ idaṃ na sevitabbaṃ, idaṃ hīnaṃ idaṃ paṇītaṃ, idaṃ kaṇhasukkasappaṭibhāga’nti supaññattaṃ. Evaṃ kusalākusalasāvajjānavajjasevitabbāsevitabbahīnapaṇītakaṇhasukkasappaṭibhāgānaṃ dhammānaṃ paññāpetāraṃ. Imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Supaññattā kho pana tena bhagavatā sāvakānaṃ nibbānagāminī paṭipadā saṃsandati nibbānañca paṭipadā ca. Seyyathāpi nāma gaṅgodakaṃ yamunodakena saṃsandati sameti, evameva supaññattā tena bhagavatā sāvakānaṃ nibbānagāminī paṭipadā saṃsandati nibbānañca paṭipadā ca. Evaṃ nibbānagāminiyā paṭipadāya paññāpetāraṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Abhinipphanno kho pana tassa bhagavato lābho abhinipphanno siloko, yāva maññe khattiyā sampiyāyamānarūpā viharanti. Vigatamado kho pana so bhagavā āhāraṃ āhāreti. Evaṃ vigatamadaṃ āhāraṃ āharayamānaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Laddhasahāyo kho pana so bhagavā sekhānañceva paṭipannānaṃ khīṇāsavānañca vusitavataṃ, te bhagavā apanujja ekārāmataṃ anuyutto viharati. Evaṃ ekārāmataṃ anuyuttaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Yathāvādī kho pana so bhagavā tathākārī, yathākārī tathāvādī; iti yathāvādī tathākārī, yathākārī tathāvādī. Evaṃ dhammānudhammappaṭippannaṃ imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā. ‘‘Tiṇṇavicikiccho kho pana so bhagavā vigatakathaṃkatho pariyositasaṅkappo ajjhāsayaṃ ādibrahmacariyaṃ. Evaṃ tiṇṇavicikicchaṃ vigatakathaṃkathaṃ pariyositasaṅkappaṃ ajjhāsayaṃ ādibrahmacariyaṃ. Imināpaṅgena samannāgataṃ satthāraṃ neva atītaṃse samanupassāma, na panetarahi, aññatra tena bhagavatā’ti.",
      "english": "Then, venerable sir, Brahmā Sanankumāra said to Sakka, lord of the devas: ‘Excellent, lord of devas! We, too, would like to hear the Blessed One's eight true virtues.’ ‘Yes, great Brahmā,’ venerable sir, Sakka, lord of the devas, replied to Brahmā Sanankumāra by reciting the Blessed One's eight true virtues:\n\n‘What do you think, great Brahmā? The Blessed One is dedicated to the welfare of the many, to the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans. We see no teacher in the past, nor do we see one now, endowed with this quality of dedication to the welfare of the many, to the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans, other than that Blessed One.’\n\n‘Furthermore, the Dhamma declared by that Blessed One is well-proclaimed, visible here and now, timeless, inviting investigation, leading onward, and to be personally experienced by the wise. We see no teacher in the past, nor do we see one now, endowed with this quality of proclaiming such a Dhamma that leads onward, other than that Blessed One.’\n\n‘Furthermore, that Blessed One has well-defined: \"This is skillful,\" and \"This is unskillful.\" He has well-defined: \"This is blameworthy, this is blameless; this should be cultivated, this should not be cultivated; this is inferior, this is superior; this is with a dark counterpart, this is with a bright counterpart.\" We see no teacher in the past, nor do we see one now, endowed with this quality of defining such qualities of skillful and unskillful, blameworthy and blameless, what should be cultivated and what should not, inferior and superior, and what has a dark or bright counterpart, other than that Blessed One.’\n\n‘Furthermore, the path leading to Nibbāna, well-declared by that Blessed One for his disciples, converges with Nibbāna, and Nibbāna with the path. Just as the waters of the Ganges merge and mingle with the waters of the Yamunā, so too does the path leading to Nibbāna, well-declared by that Blessed One for his disciples, converge with Nibbāna, and Nibbāna with the path. We see no teacher in the past, nor do we see one now, endowed with this quality of declaring such a path leading to Nibbāna, other than that Blessed One.’\n\n‘Furthermore, gain has been fully attained by that Blessed One, and renown has been fully attained, so much so that even kings live favorably disposed towards him. Furthermore, that Blessed One partakes of food without intoxication. We see no teacher in the past, nor do we see one now, endowed with this quality of partaking of food without intoxication, other than that Blessed One.’\n\n‘Furthermore, that Blessed One has companions among both trainees and arahants who have completed their training. Yet, he lives devoted to solitude, having dismissed the need for their company. We see no teacher in the past, nor do we see one now, endowed with this quality of living devoted to solitude, other than that Blessed One.’\n\n‘Furthermore, that Blessed One's actions match his words, and his words match his actions; thus, his actions match his words, and his words match his actions. We see no teacher in the past, nor do we see one now, endowed with this quality of practicing in accordance with the Dhamma, other than that Blessed One.’\n\n‘Furthermore, that Blessed One has overcome doubt, is free from uncertainty, has finalized his intentions, and has the holy life as his ultimate goal. We see no teacher in the past, nor do we see one now, endowed with this quality of having overcome doubt, being free from uncertainty, having finalized his intentions, and having the holy life as his ultimate goal, other than that Blessed One.’",
      "sinhala": "එසමයෙහි, වහන්ස, සනංකුමාර බ්‍රහ්මයා දෙවියන්ගේ අධිපති වූ සක්‍රයාට මෙසේ කීවේය: ‘දෙවියන්ගේ අධිපතීනි, ඒ භාග්‍යවතුන් වහන්සේගේ සැබෑ ගුණ අටක් අපටත් අසන්නට ලැබුණොත් මැනවි.’ ‘මහ බ්‍රහ්මයාණෙනි, එසේය’යි සක්‍ර දෙවියන් සනංකුමාර බ්‍රහ්මයාට භාග්‍යවතුන් වහන්සේගේ සැබෑ ගුණ අට විස්තර කළේය.\n\n‘මහ බ්‍රහ්මයාණෙනි, ඔබ ඒ ගැන කුමක් සිතන්නේද? ඒ භාග්‍යවතුන් වහන්සේ බොහෝ දෙනාගේ හිත සුව පිණිසත්, ලෝකයාට අනුකම්පා කිරීම පිණිසත්, දෙවි මිනිසුන්ගේ යහපත උදෙසාත් පිළිපන්නාහ. මෙසේ බොහෝ දෙනාගේ හිත සුව පිණිසත්, ලෝකයාට අනුකම්පා කිරීම පිණිසත්, දෙවි මිනිසුන්ගේ යහපත උදෙසාත් පිළිපන්, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.\n\nඒ භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය ස්වාක්ඛාතය (මැනවින් දේශනා කරන ලද්දකි), සන්දිට්ඨිකය (තමා විසින්ම දැකිය හැක්කකි), අකාලිකය (කල් නොගෙන ඵල දෙන්නකි), ඒහිපස්සිකය (එව, බලව යැයි පැවසිය හැක්කකි), ඕපනයිකය (නිර්වාණයට පමුණුවන්නකි), විඤ්ඤූන් විසින් පසක් කළ යුත්තකි. මෙසේ ඕපනයික වූ ධර්මය දේශනා කරන, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.\n\nඒ භාග්‍යවතුන් වහන්සේ විසින් ‘මෙය කුසලය’ යැයිද, ‘මෙය අකුසලය’ යැයිද, ‘මෙය සාවද්‍යය, මෙය අනවද්‍යය’ යැයිද, ‘මෙය සේවනය කළ යුතුය, මෙය සේවනය නොකළ යුතුය’ යැයිද, ‘මෙය හීනය, මෙය ප්‍රණීතය’ යැයිද, ‘මෙය කළු සුදු වශයෙන් කොටස් කළ හැක්කකි’ යැයිද මැනවින් පනවන ලදී. මෙසේ කුසල, අකුසල, සාවද්‍ය, අනවද්‍ය, සේවනය කළ යුතු, සේවනය නොකළ යුතු, හීන, ප්‍රණීත, කළු සුදු වශයෙන් කොටස් කළ හැකි ධර්මයන් පනවන්නා වූ, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.\n\nඒ භාග්‍යවතුන් වහන්සේ විසින් ශ්‍රාවකයන්ට නිවනට යන මාර්ගය මැනවින් පනවන ලද අතර, නිවන හා මාර්ගය එකට ගැළපේ. ගංගා නදියේ ජලය යමුනා නදියේ ජලය සමඟ එක්වන්නා සේම, භාග්‍යවතුන් වහන්සේ විසින් ශ්‍රාවකයන්ට මැනවින් පනවන ලද නිවනට යන මාර්ගය නිවනත් සමඟ ගැළපී එක්වේ. මෙසේ නිවනට යන මාර්ගය පනවන්නා වූ, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.\n\nඒ භාග්‍යවතුන් වහන්සේගේ ලාභය මැනවින් සිද්ධ වී ඇත, කීර්තිය මැනවින් ප්‍රකට වී ඇත. රාජ්‍ය පාලකයෝ පවා උන්වහන්සේට ප්‍රියශීලීව වාසය කරති. උන්වහන්සේ මානය දුරු කොට ආහාර වළඳති. මෙසේ මානය දුරු කොට ආහාර වළඳන, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.\n\nඒ භාග්‍යවතුන් වහන්සේට ශික්ෂණයෙහි යෙදුණු, මාර්ගඵලලාභී, ක්ෂීණාශ්‍රව වූ, බඹසර වැසූ ශ්‍රාවකයෝ සිටිති. එහෙත් උන්වහන්සේ ඔවුන්ගෙන් වෙන්ව තනිව වාසය කිරීමට ඇලුම් කරති. මෙසේ තනිව වාසය කිරීමට ඇලුම් කරන, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.\n\nඒ භාග්‍යවතුන් වහන්සේ යම් දෙයක් වදාරන සේක්ද, එය එසේම කරති. යම් දෙයක් කරන සේක්ද, එය එසේම වදාරන සේක. එනම්, යම්සේ වදාරන සේක්ද, එසේම කරති; යම්සේ කරන සේක්ද, එසේම වදාරන සේක. මෙසේ ධර්මයට අනුව පිළිපදින, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.\n\nඒ භාග්‍යවතුන් වහන්සේ සැකයෙන් එතෙර වූ සේක, විචිකිච්ඡාව දුරු කළ සේක, සියලු සංකල්පයන් අවසන් කළ සේක, සිතෙහි මුලික බඹසර සම්පූර්ණ කළ සේක. මෙසේ සැකයෙන් එතෙර වූ, විචිකිච්ඡාව දුරු කළ, සංකල්පයන් අවසන් කළ, සිතෙහි මුලික බඹසර සම්පූර්ණ කළ, මෙම ගුණයෙන් යුත් ශාස්තෘවරයෙකු ඒ භාග්‍යවතුන් වහන්සේ හැර අතීතයේදී අප දැක නැත. දැනුදු දකින්නට නැත.’",
      "paliTitle": "Aṭṭha yathābhuccavaṇṇā",
      "englishTitle": "Eight descriptions according to reality.",
      "sinhalaTitle": "අට යථාභූත වර්ණනා"
    },
    {
      "number": 303,
      "pali": "‘‘Ime kho, bhante, sakko devānamindo brahmuno sanaṅkumārassa bhagavato aṭṭha yathābhucce vaṇṇe payirudāhāsi. Tena sudaṃ, bhante, brahmā sanaṅkumāro attamano hoti pamudito pītisomanassajāto bhagavato aṭṭha yathābhucce vaṇṇe sutvā. Atha, bhante, brahmā sanaṅkumāro oḷārikaṃ attabhāvaṃ abhinimminitvā kumāravaṇṇī hutvā pañcasikho devānaṃ tāvatiṃsānaṃ pāturahosi. So vehāsaṃ abbhuggantvā ākāse antalikkhe pallaṅkena nisīdi. Seyyathāpi, bhante, balavā puriso supaccatthate vā pallaṅke same vā bhūmibhāge pallaṅkena nisīdeyya, evameva kho, bhante, brahmā sanaṅkumāro vehāsaṃ abbhuggantvā ākāse antalikkhe pallaṅkena nisīditvā deve tāvatiṃse āmantesi –",
      "english": "Venerable sir, Sakka, the lord of devas, indeed recited these eight true qualities of the Blessed One to Brahmā Sanaṅkumāra. On hearing these eight true qualities of the Blessed One, Brahmā Sanaṅkumāra was delighted, overjoyed, and filled with rapture and happiness. Then, venerable sir, Brahmā Sanaṅkumāra manifested a gross form, appearing as a youth with five topknots, and appeared before the Tāvatiṃsa gods. He rose into the sky and sat cross-legged in the open air. Just as a strong man sits cross-legged on a well-covered couch or a level ground, so too, venerable sir, Brahmā Sanaṅkumāra rose into the sky, sat cross-legged in the open air, and addressed the Tāvatiṃsa gods:",
      "sinhala": "මේවා වහන්ස, දෙවියන්ගේ අධිපති ශක්‍රයා සනංකුමාර බ්‍රහ්මයාට භාග්‍යවතුන් වහන්සේගේ සැබෑ ගුණ අට මැනවින් කියා පෑවේය. ඒ නිසා වහන්ස, සනංකුමාර බ්‍රහ්මයා භාග්‍යවතුන් වහන්සේගේ ඒ සැබෑ ගුණ අට අසා, සතුටු වූයේ ප්‍රීතියෙන් හා සෝමනස්සයෙන් පූර්ණවය. ඉක්බිති වහන්ස, සනංකුමාර බ්‍රහ්මයා භෞතික ශරීරයක් මවා, පස් කෙස් රොදක් ඇති කුමාරයකුගේ ස්වරූපයෙන් තව්තිසා දෙවියන්ට දර්ශනය විය. හෙතෙම අහසට නැඟී අහස් කුසෙහි පලක් බැඳ හිඳගත්තේය. වහන්ස, බලවත් පුරුෂයෙක් හොඳින් අතුරන ලද යහනක හෝ සම භූමි භාගයක පලක් බැඳ හිඳගන්නා ආකාරයටම, එසේම වහන්ස, සනංකුමාර බ්‍රහ්මයා අහසට නැඟී අහස් කුසෙහි පලක් බැඳ හිඳගෙන තව්තිසා දෙවියන්ට කතා කළේය –",
      "paliTitle": ""
    },
    {
      "number": 304,
      "pali": "‘‘Taṃ kiṃ maññanti, bhonto devā tāvatiṃsā, yāva dīgharattaṃ mahāpaññova so bhagavā ahosi. Bhūtapubbaṃ, bho, rājā disampati nāma ahosi. Disampatissa rañño govindo nāma brāhmaṇo purohito ahosi. Disampatissa rañño reṇu nāma kumāro putto ahosi. Govindassa brāhmaṇassa jotipālo nāma māṇavo putto ahosi. Iti reṇu ca rājaputto jotipālo ca māṇavo aññe ca cha khattiyā iccete aṭṭha sahāyā ahesuṃ. Atha kho, bho, ahorattānaṃ accayena govindo brāhmaṇo kālamakāsi. Govinde brāhmaṇe kālaṅkate rājā disampati paridevesi – ‘‘yasmiṃ vata, bho, mayaṃ samaye govinde brāhmaṇe sabbakiccāni sammā vossajjitvā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārema, tasmiṃ no samaye govindo brāhmaṇo kālaṅkato’’ti. Evaṃ vutte bho reṇu rājaputto rājānaṃ disampatiṃ etadavoca – ‘‘mā kho tvaṃ, deva, govinde brāhmaṇe kālaṅkate atibāḷhaṃ paridevesi. Atthi, deva, govindassa brāhmaṇassa jotipālo nāma māṇavo putto paṇḍitataro ceva pitarā, alamatthadasataro ceva pitarā; yepissa pitā atthe anusāsi, tepi jotipālasseva māṇavassa anusāsaniyā’’ti. ‘‘Evaṃ kumārā’’ti? ‘‘Evaṃ devā’’ti.",
      "english": "What do you think, venerable Tāvatiṃsa devas? For a very long time, that Blessed One was truly greatly wise. Once, venerable sirs, there was a king named Disampati. King Disampati had a brahmin chaplain named Govinda. King Disampati had a son named Prince Reṇu, and the brahmin Govinda had a son named the young Jotipāla. Thus, Prince Reṇu, the young Jotipāla, and six other nobles – these eight were friends. Then, venerable sirs, after some time, the brahmin Govinda passed away. When the brahmin Govinda had passed away, King Disampati lamented: \"Alas, venerable sirs, at the very time when we had properly entrusted all our affairs to the brahmin Govinda and were fully absorbed and indulging in the five strands of sensual pleasure, the brahmin Govinda passed away!\" When this was said, Prince Reṇu said to King Disampati, \"Do not, O King, lament so excessively over the passing of the brahmin Govinda. O King, the brahmin Govinda has a son named Jotipāla, a young man, who is wiser and more discerning in matters of welfare than his father. Even those matters his father advised on are now within the scope of young Jotipāla's counsel.\" \"Is that so, Prince?\" \"Indeed, O King.\"",
      "sinhala": "“භවත්නි, තාවතිංස දෙවියෝ, ඒ භාග්‍යවතුන්වහන්සේ බොහෝ කලක් මහා ප්‍රඥා ඇතිව වැඩසිටියහයි ඔබ සිතන්නේ කුමක් ද? භවත්නි, පෙර දිසම්පති නම් රජෙක් විය. දිසම්පති රජුට ගෝවින්ද නම් බ්‍රාහ්මණයෙක් පුරෝහිත වූයේ ය. දිසම්පති රජුට රේණු නම් කුමාර පුත්‍රයෙක් විය. ගෝවින්ද බ්‍රාහ්මණයාට ජෝතිපාල නම් මානවක පුත්‍රයෙක් විය. මෙසේ රේණු කුමරු ද, ජෝතිපාල මානවකයා ද, අනෙක් ක්ෂත්‍රියයන් හය දෙනෙක් ද යන මොහු අට දෙනා මිත්‍රයෝ වූහ. අනතුරුව, භවත්නි, බොහෝ දිනක් ගත වීමෙන් ගෝවින්ද බ්‍රාහ්මණයා මිය ගියේ ය. ගෝවින්ද බ්‍රාහ්මණයා මිය ගිය කල්හි දිසම්පති රජ තැවුලට පත් ව මෙසේ වැලපුණේ ය: “අහෝ, භවත්නි, යම් කලෙක අපි ගෝවින්ද බ්‍රාහ්මණයාට සියලු කටයුතු මැනවින් පවරා, පස්කම් සැපතින් යුක්ත ව, එකමුතුව සතුටු වූයෙමු ද, ඒ අපගේ ගෝවින්ද බ්‍රාහ්මණයා මිය ගියේ ය.” මෙසේ කී කල්හි රේණු කුමරු දිසම්පති රජුට මෙසේ කීවේ ය: “දේවයන් වහන්ස, ගෝවින්ද බ්‍රාහ්මණයා මිය යාම ගැන ඔබ එතරම් ශෝක නොකරන්න. දේවයන් වහන්ස, ගෝවින්ද බ්‍රාහ්මණයාට ජෝතිපාල නම් මානවකයෙක් සිටී. ඔහු පියාට වඩා ප්‍රඥාවන්ත ය, පියාට වඩා අර්ථ දකී. ඔහුගේ පියා යම් කරුණක් ගැන උපදෙස් දුන්නේ ද, ඒ සියල්ල ජෝතිපාල මානවකයාගේ ම අවවාද පරිදි සිදු වේ.” “කුමාරය, එසේ ද?” “දේවයන් වහන්ස, එසේ ය.”",
      "paliTitle": "Govindabrāhmaṇavatthu",
      "englishTitle": "The Story of the Brahmin Govinda",
      "sinhalaTitle": "ගෝවින්ද බ්‍රාහ්මණ වස්තුව"
    },
    {
      "number": 305,
      "pali": "‘‘Atha kho, bho, rājā disampati aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa, yena jotipālo nāma māṇavo tenupasaṅkama; upasaṅkamitvā jotipālaṃ māṇavaṃ evaṃ vadehi – ‘bhavamatthu bhavantaṃ jotipālaṃ, rājā disampati bhavantaṃ jotipālaṃ māṇavaṃ āmantayati, rājā disampati bhoto jotipālassa māṇavassa dassanakāmo’’’ti. ‘‘Evaṃ, devā’’ti kho, bho, so puriso disampatissa rañño paṭissutvā yena jotipālo māṇavo tenupasaṅkami; upasaṅkamitvā jotipālaṃ māṇavaṃ etadavoca – ‘‘bhavamatthu bhavantaṃ jotipālaṃ, rājā disampati bhavantaṃ jotipālaṃ māṇavaṃ āmantayati, rājā disampati bhoto jotipālassa māṇavassa dassanakāmo’’ti. ‘‘Evaṃ, bho’’ti kho bho jotipālo māṇavo tassa purisassa paṭissutvā yena rājā disampati tenupasaṅkami; upasaṅkamitvā disampatinā raññā saddhiṃ sammodi; sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho, bho, jotipālaṃ māṇavaṃ rājā disampati etadavoca – ‘‘anusāsatu no bhavaṃ jotipālo, mā no bhavaṃ jotipālo anusāsaniyā paccabyāhāsi. Pettike taṃ ṭhāne ṭhapessāmi, govindiye abhisiñcissāmī’’ti. ‘‘Evaṃ, bho’’ti kho, bho, so jotipālo māṇavo disampatissa rañño paccassosi. Atha kho, bho, rājā disampati jotipālaṃ māṇavaṃ govindiye abhisiñci, taṃ pettike ṭhāne ṭhapesi. Abhisitto jotipālo māṇavo govindiye pettike ṭhāne ṭhapito yepissa pitā atthe anusāsi tepi atthe anusāsati, yepissa pitā atthe nānusāsi, tepi atthe anusāsati; yepissa pitā kammante abhisambhosi, tepi kammante abhisambhoti, yepissa pitā kammante nābhisambhosi, tepi kammante abhisambhoti. Tamenaṃ manussā evamāhaṃsu – ‘‘govindo vata, bho, brāhmaṇo, mahāgovindo vata, bho, brāhmaṇo’’ti. Iminā kho evaṃ, bho, pariyāyena jotipālassa māṇavassa govindo mahāgovindotveva samaññā udapādi. ",
      "english": "Then, sir, King Disampati addressed a certain man: \"Go, good man, to the young man named Jotipāla. When you have approached him, speak to him thus: 'Greetings, Jotipāla! King Disampati invites you. King Disampati wishes to see you.'\"\n\n\"Yes, Your Majesty,\" the man replied to King Disampati. He went to where the young man Jotipāla was and, approaching him, said: \"Greetings, Jotipāla! King Disampati invites you. King Disampati wishes to see you.\"\n\n\"Yes, sir,\" the young man Jotipāla replied to the man. He went to where King Disampati was and exchanged courteous greetings with him. After this polite and memorable conversation, he sat down to one side.\n\nThen, sir, King Disampati said to the young man Jotipāla, who was seated to one side: \"May you, Jotipāla, instruct us. Please do not refuse to instruct us. I will place you in your ancestral position; I will consecrate you to the office of Govinda.\"\n\n\"Yes, sir,\" the young man Jotipāla replied to King Disampati.\n\nThen, sir, King Disampati consecrated the young man Jotipāla to the office of Govinda and placed him in his ancestral position. Consecrated to the office of Govinda and placed in his ancestral position, Jotipāla instructed on matters that his father had instructed upon, and also on matters that his father had not instructed upon. He carried out tasks that his father had carried out, and also carried out tasks that his father had not carried out.\n\nPeople then said of him: \"Indeed, this brahmin is Govinda! Indeed, this brahmin is Mahāgovinda!\" In this way, the name Govinda and Mahāgovinda arose for the young man Jotipāla.",
      "sinhala": "භවත්නි, දිසම්පති රජතුමා එක් පුරුෂයෙකු අමතා, “එම්බා පුරුෂය, ඔබ ජෝතිපාල නම් මානවකයා සිටින තැනට ගොස්, ‘භවත් ජෝතිපාලතුමනි, ඔබට මගේ ආශිර්වාදය! දිසම්පති රජතුමා ඔබ හමුවීමට කැමැත්තෙන් සිටින බැවින් ඔබතුමාට ආරාධනා කරයි’ යැයි පවසන්න” කියා කීවේය.\n\nභවත්නි, එම පුරුෂයා, “දේවයන් වහන්ස, එසේය” කියා දිසම්පති රජුට පිළිතුරු දී ජෝතිපාල මානවකයා සිටින තැනට ගියේ ය. එහි ගොස් ජෝතිපාල මානවකයාට, “භවත් ජෝතිපාලතුමනි, ඔබට මගේ ආශිර්වාදය! දිසම්පති රජතුමා ඔබ හමුවීමට කැමැත්තෙන් සිටින බැවින් ඔබතුමාට ආරාධනා කරයි” යැයි කීවේය. භවත්නි, ජෝතිපාල මානවකයා, “භවත්නි, එසේය” කියා එම පුරුෂයාට පිළිතුරු දී දිසම්පති රජු සිටින තැනට ගියේ ය. එහි ගොස් දිසම්පති රජු සමඟ සුහද කථාබහක නිරත වී, සතුටු විය යුතු, සිහිපත් කළ යුතු කරුණු සාකච්ඡා කර එකත්පසෙක වාඩි විය. භවත්නි, එකත්පසෙක වාඩි වී සිටි ජෝතිපාල මානවකයාට දිසම්පති රජු මෙසේ කීවේය: “භවත් ජෝතිපාලතුමා අපට අවවාද අනුශාසනා කරන සේක්වා! අනුශාසනා කිරීම ප්‍රතික්ෂේප නොකරන මෙන් මම ඔබෙන් ඉල්ලා සිටිමි. මම ඔබතුමාව පිය පරම්පරාගත තනතුරෙහි පිහිටුවන්නෙමි. ගෝවින්ද තනතුරට ද ඔබතුමාව අභිෂේක කරවන්නෙමි.” භවත්නි, ජෝතිපාල මානවකයා, “භවත්නි, එසේය” කියා දිසම්පති රජුට පිළිතුරු දුන්නේය.\n\nභවත්නි, දිසම්පති රජතුමා ජෝතිපාල මානවකයා ගෝවින්ද තනතුරෙහි අභිෂේක කර, පිය පරම්පරාගත තනතුරෙහි ද ඔහුව පිහිටුවීය. ගෝවින්ද තනතුරෙහි අභිෂේක ලැබූ, පිය පරම්පරාගත තනතුරෙහි පිහිටුවනු ලැබූ ජෝතිපාල මානවකයා, ඔහුගේ පියා යම් කාරණා සම්බන්ධයෙන් අනුශාසනා කළේද, ඒ කාරණා සම්බන්ධයෙන් ද අනුශාසනා කළේය. ඔහුගේ පියා යම් කාරණා සම්බන්ධයෙන් අනුශාසනා නොකළේද, ඒ කාරණා සම්බන්ධයෙන් ද අනුශාසනා කළේය. ඔහුගේ පියා යම් කටයුතු සම්පූර්ණ කළේද, ඒ කටයුතු ද සම්පූර්ණ කළේය. ඔහුගේ පියා යම් කටයුතු සම්පූර්ණ නොකළේද, ඒ කටයුතු ද සම්පූර්ණ කළේය. මිනිසුන් ඔහු ගැන මෙසේ කීහ: “අහෝ, මේ බමුණා ගෝවින්ද! අහෝ, මේ බමුණා මහා ගෝවින්ද!” භවත්නි, මේ ආකාරයෙන් ජෝතිපාල මානවකයාට ගෝවින්ද, මහා ගෝවින්ද යන නාමය ඇති විය.",
      "paliTitle": "Mahāgovindavatthu",
      "englishTitle": "The Story of Mahāgovinda",
      "sinhalaTitle": "මහාගෝවින්දවත්ථු"
    },
    {
      "number": 306,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca – ‘‘disampati kho, bho, rājā jiṇṇo vuddho mahallako addhagato vayoanuppatto, ko nu kho pana, bho, jānāti jīvitaṃ? Ṭhānaṃ kho panetaṃ vijjati, yaṃ disampatimhi raññe kālaṅkate rājakattāro reṇuṃ rājaputtaṃ rajje abhisiñceyyuṃ. Āyantu, bhonto, yena reṇu rājaputto tenupasaṅkamatha; upasaṅkamitvā reṇuṃ rājaputtaṃ evaṃ vadetha – ‘‘mayaṃ kho bhoto reṇussa sahāyā piyā manāpā appaṭikūlā, yaṃsukho bhavaṃ taṃsukhā mayaṃ, yaṃdukkho bhavaṃ taṃdukkhā mayaṃ. Disampati kho, bho, rājā jiṇṇo vuddho mahallako addhagato vayoanuppatto, ko nu kho pana, bho, jānāti jīvitaṃ? Ṭhānaṃ kho panetaṃ vijjati, yaṃ disampatimhi raññe kālaṅkate rājakattāro bhavantaṃ reṇuṃ rajje abhisiñceyyuṃ. Sace bhavaṃ reṇu rajjaṃ labhetha, saṃvibhajetha no rajjenā’’ti. ‘‘Evaṃ bho’’ti kho, bho, te cha khattiyā mahāgovindassa brāhmaṇassa paṭissutvā yena reṇu rājaputto tenupasaṅkamiṃsu; upasaṅkamitvā reṇuṃ rājaputtaṃ etadavocuṃ – ‘‘mayaṃ kho bhoto reṇussa sahāyā piyā manāpā appaṭikūlā; yaṃsukho bhavaṃ taṃsukhā mayaṃ, yaṃdukkho bhavaṃ taṃdukkhā mayaṃ. Disampati kho, bho, rājā jiṇṇo vuddho mahallako addhagato vayoanuppatto, ko nu kho pana bho jānāti jīvitaṃ? Ṭhānaṃ kho panetaṃ vijjati, yaṃ disampatimhi raññe kālaṅkate rājakattāro bhavantaṃ reṇuṃ rajje abhisiñceyyuṃ. Sace bhavaṃ reṇu rajjaṃ labhetha, saṃvibhajetha no rajjenā’’ti. ‘‘Ko nu kho, bho, añño mama vijite sukho bhavetha [sukhā bhaveyyātha (ka.), sukhaṃ bhaveyyātha, sukhamedheyyātha (sī. pī.),sukha medhetha (?)], aññatra bhavantebhi? Sacāhaṃ, bho, rajjaṃ labhissāmi, saṃvibhajissāmi vo rajjenā’’’ti.",
      "english": "Then, Mahāgovinda the Brahmin approached those six nobles. He approached them and said, \"Friends, King Disampati is old, aged, advanced in years, and has reached the end of his life. Who knows how long he will live? It is possible that when King Disampati dies, the royal ministers will consecrate Prince Reṇu as king. Come, friends, let us approach Prince Reṇu and say to him, 'We are your friends, Reṇu, dear, agreeable, and well-disposed towards you. We share your happiness and your suffering. King Disampati is old, aged, advanced in years, and has reached the end of his life. Who knows how long he will live? It is possible that when King Disampati dies, the royal ministers will consecrate you, Reṇu, as king. If you, Reṇu, obtain the kingship, share it with us.'\"\n\n\"Yes, sir,\" the six nobles replied to Mahāgovinda the Brahmin, and they approached Prince Reṇu. Approaching him, they said, \"We are your friends, Reṇu, dear, agreeable, and well-disposed towards you. We share your happiness and your suffering. King Disampati is old, aged, advanced in years, and has reached the end of his life. Who knows how long he will live? It is possible that when King Disampati dies, the royal ministers will consecrate you, Reṇu, as king. If you, Reṇu, obtain the kingship, share it with us.\"\n\n\"Who else but you could be happy in my kingdom?\" Reṇu replied. \"If I obtain the kingship, I will share it with you.\"",
      "sinhala": "භවත්නි, ඉක්බිති මහාගෝවින්ද බමුණා ඒ ක්ෂත්‍රියයන් සය දෙනා වෙත එළඹියේය. එළඹ ඒ ක්ෂත්‍රියයන් සය දෙනාට මෙය කීවේය – ‘‘භවත්නි, දිසම්පති රජු මහලු වියට පත්ව, වයෝවෘද්ධව, ගිලන්ව, ආයුෂ ගෙවා අවසන්ව සිටී. භවත්නි, ජීවිතයෙහි ස්ථිර බව කවුරුන් දනීද? දිසම්පති රජු කාලක්‍රියා කළ කල්හි, රජුගේ ඇමතිවරු රේණු කුමරුට රාජ්‍යයෙහි අභිෂේක කරනවා යනු සිදුවිය හැකි කරුණකි. භවත්නි, එන්න, රේණු කුමරු වෙත එළඹෙන්න; එළඹ රේණු කුමරුට මෙසේ කියන්න – ‘‘අපි භවත් රේණු කුමරුගේ ප්‍රිය, මනාප, අප්‍රතිකූල වූ මිතුරෝ වෙමු. භවත් ඔබ යම් සැපතකින් යුක්තනම්, අපිද ඒ සැපතින් යුක්ත වෙමු. භවත් ඔබ යම් දුකකින් යුක්තනම්, අපිද ඒ දුකෙන් යුක්ත වෙමු. භවත්නි, දිසම්පති රජු මහලු වියට පත්ව, වයෝවෘද්ධව, ගිලන්ව, ආයුෂ ගෙවා අවසන්ව සිටී. භවත්නි, ජීවිතයෙහි ස්ථිර බව කවුරුන් දනීද? දිසම්පති රජු කාලක්‍රියා කළ කල්හි, රජුගේ ඇමතිවරු භවත් රේණු කුමරුට රාජ්‍යයෙහි අභිෂේක කරනවා යනු සිදුවිය හැකි කරුණකි. භවත් රේණු රාජ්‍යය ලබන්නේ නම්, අපටත් රාජ්‍යයෙන් කොටසක් ලබා දෙන්නැයි’’.\n\n‘‘එසේය, භවත්නි’’යි, භවත්නි, ඒ ක්ෂත්‍රියයන් සය දෙනා මහාගෝවින්ද බමුණාට පිළිතුරු දී රේණු කුමරු වෙත එළඹියහ; එළඹ රේණු කුමරුට මෙය කීහ – ‘‘අපි භවත් රේණු කුමරුගේ ප්‍රිය, මනාප, අප්‍රතිකූල වූ මිතුරෝ වෙමු. භවත් ඔබ යම් සැපතකින් යුක්තනම්, අපිද ඒ සැපතින් යුක්ත වෙමු. භවත් ඔබ යම් දුකකින් යුක්තනම්, අපිද ඒ දුකෙන් යුක්ත වෙමු. භවත්නි, දිසම්පති රජු මහලු වියට පත්ව, වයෝවෘද්ධව, ගිලන්ව, ආයුෂ ගෙවා අවසන්ව සිටී. භවත්නි, ජීවිතයෙහි ස්ථිර බව කවුරුන් දනීද? දිසම්පති රජු කාලක්‍රියා කළ කල්හි, රජුගේ ඇමතිවරු භවත් රේණු කුමරුට රාජ්‍යයෙහි අභිෂේක කරනවා යනු සිදුවිය හැකි කරුණකි. භවත් රේණු රාජ්‍යය ලබන්නේ නම්, අපටත් රාජ්‍යයෙන් කොටසක් ලබා දෙන්නැයි’’. ‘‘භවත්නි, මාගේ රාජ්‍යයෙහි ඔබ භවතුන් හැර වෙන කවුරුන් සතුටින් සිටීද? භවත්නි, සැබවින්ම මම රාජ්‍යය ලබන්නේ නම්, මම ඔබට රාජ්‍යයෙන් කොටසක් ලබා දෙන්නෙමි’’යි.",
      "paliTitle": "Rajjasaṃvibhajanaṃ",
      "englishTitle": "The Division of the Kingdom",
      "sinhalaTitle": "රාජ්‍යය බෙදා දීම"
    },
    {
      "number": 307,
      "pali": "‘‘Atha kho, bho, ahorattānaṃ accayena rājā disampati kālamakāsi. Disampatimhi raññe kālaṅkate rājakattāro reṇuṃ rājaputtaṃ rajje abhisiñciṃsu. Abhisitto reṇu rajjena pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca – ‘‘disampati kho, bho, rājā kālaṅkato. Abhisitto reṇu rajjena pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Ko nu kho pana, bho, jānāti, madanīyā kāmā? Āyantu, bhonto, yena reṇu rājā tenupasaṅkamatha; upasaṅkamitvā reṇuṃ rājānaṃ evaṃ vadetha – disampati kho, bho, rājā kālaṅkato, abhisitto bhavaṃ reṇu rajjena, sarati bhavaṃ taṃ vacana’’’nti?",
      "english": "Then, sirs, after the passing of days and nights, King Disampati died. With the death of King Disampati, the royal officials consecrated Prince Reṇu as king. Once consecrated, Reṇu, now king, indulged in and was replete with the five sense pleasures. Then, sirs, the Brahmin Mahāgovinda approached those six Khattiyas and said to them: \"Indeed, sirs, King Disampati has died. Reṇu has been consecrated as king and is indulging in and replete with the five sense pleasures. Who among you knows the allure of those sense pleasures? Come, noble sirs, approach King Reṇu and say to him: 'Indeed, King Disampati has died, and your majesty, Reṇu, has been consecrated as king. Does your majesty remember that promise?'\"",
      "sinhala": "එතකොට, ඇවැත්නි, දවස් කිහිපයකට පසුව දිසම්පති රජු මිය ගියේය. දිසම්පති රජු මිය ගිය පසු රාජපුරුෂයෝ රේණු කුමරු රාජ්‍යයට අභිෂේක කළහ. රාජ්‍යයට අභිෂේක ලැබූ රේණු රජු පංචකාම සම්පත්තීන්ගෙන් සමන්විතව, ඒවායේ ඇලී ගැලී සතුටු වෙමින් රාජ්‍ය පාලනය කරයි. එතකොට, ඇවැත්නි, මහාගෝවින්ද බ්‍රාහ්මණයා ඒ ක්‍ෂත්‍රියවරුන් හය දෙනා සිටින තැනට පැමිණියේය; පැමිණ ඒ ක්‍ෂත්‍රියවරුන් හය දෙනාට මෙසේ කීවේය – “ඇවැත්නි, දිසම්පති රජු මිය ගියේය. රේණු රාජ්‍යයට අභිෂේක ලැබූ අතර, පංචකාම සම්පත්තීන්ගෙන් සමන්විතව ඒවායේ ඇලී ගැලී සතුටු වෙමින් රාජ්‍ය පාලනය කරයි. ඇවැත්නි, කාමයන් මත් කරවන සුලු බව කවුරුන් නම් නොදන්නේද? ඇවැත්නි, එන්න, රේණු රජු සිටින තැනට ගොස්, රේණු රජුට මෙසේ කියන්න – ‘ඇවැත්නි, දිසම්පති රජු මිය ගියේය, ඔබ රේණු රාජ්‍යයට අභිෂේක ලැබුවේය, ඔබ ඒ වචනය සිහි කරන්නේද?’”",
      "paliTitle": ""
    },
    {
      "number": 308,
      "pali": "‘‘‘Evaṃ, bho’’ti kho, bho, te cha khattiyā mahāgovindassa brāhmaṇassa paṭissutvā yena reṇu rājā tenupasaṅkamiṃsu; upasaṅkamitvā reṇuṃ rājānaṃ etadavocuṃ – ‘‘disampati kho, bho, rājā kālaṅkato, abhisitto bhavaṃ reṇu rajjena, sarati bhavaṃ taṃ vacana’’nti? ‘‘Sarāmahaṃ, bho, taṃ vacanaṃ [vacananti (syā. ka.)]. Ko nu kho, bho, pahoti imaṃ mahāpathaviṃ uttarena āyataṃ dakkhiṇena sakaṭamukhaṃ sattadhā samaṃ suvibhattaṃ vibhajitu’’nti? ‘‘Ko nu kho, bho, añño pahoti, aññatra mahāgovindena brāhmaṇenā’’ti? Atha kho, bho, reṇu rājā aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa, yena mahāgovindo brāhmaṇo tenupasaṅkama; upasaṅkamitvā mahāgovindaṃ brāhmaṇaṃ evaṃ vadehi – ‘rājā taṃ, bhante, reṇu āmantetī’’’ti. ‘‘Evaṃ devā’’ti kho, bho, so puriso reṇussa rañño paṭissutvā yena mahāgovindo brāhmaṇo tenupasaṅkami; upasaṅkamitvā mahāgovindaṃ brāhmaṇaṃ etadavoca – ‘‘rājā taṃ, bhante, reṇu āmantetī’’ti. ‘‘Evaṃ, bho’’ti kho, bho, mahāgovindo brāhmaṇo tassa purisassa paṭissutvā yena reṇu rājā tenupasaṅkami; upasaṅkamitvā reṇunā raññā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho, bho, mahāgovindaṃ brāhmaṇaṃ reṇu rājā etadavoca – ‘‘etu, bhavaṃ govindo, imaṃ mahāpathaviṃ uttarena āyataṃ dakkhiṇena sakaṭamukhaṃ sattadhā samaṃ suvibhattaṃ vibhajatū’’ti. ‘‘Evaṃ, bho’’ti kho mahāgovindo brāhmaṇo reṇussa rañño paṭissutvā imaṃ mahāpathaviṃ uttarena āyataṃ dakkhiṇena sakaṭamukhaṃ sattadhā samaṃ suvibhattaṃ vibhaji. Sabbāni sakaṭamukhāni paṭṭhapesi [aṭṭhapesi (sī. pī.)]. Tatra sudaṃ majjhe reṇussa rañño janapado hoti.",
      "english": "\"Yes, revered sir,\" the six Khattiyas replied to the brahmin Mahāgovinda and then approached King Reṇu. Approaching him, they said, \"Revered sir, the king, the lord of the land, has passed away. May your reverence, Reṇu, be consecrated as king. Do you remember that promise?\"\n\n\"Yes, revered sir, I remember the promise,\" he replied. \"But who, revered sir, is able to divide this great earth, which is broad in the north and shaped like a cart-face in the south, into seven equal and well-divided portions?\"\n\n\"Who else is able, revered sir, other than the brahmin Mahāgovinda?\" they responded.\n\nThen King Reṇu addressed a man, saying, \"Go, good man, to the brahmin Mahāgovinda and tell him, 'King Reṇu summons you, sir.'\"\n\n\"Yes, Your Majesty,\" the man replied and went to Mahāgovinda the brahmin. Approaching him, he said, \"King Reṇu summons you, sir.\"\n\n\"Yes, revered sir,\" Mahāgovinda the brahmin replied and went to King Reṇu. Approaching him, he exchanged courteous and memorable remarks. Then, sitting down to one side, King Reṇu said to him, \"May your reverence, Govinda, divide this great earth, which is broad in the north and shaped like a cart-face in the south, into seven equal and well-divided portions.\"\n\n\"Yes, revered sir,\" Mahāgovinda the brahmin replied, and then divided the great earth, which is broad in the north and shaped like a cart-face in the south, into seven equal and well-divided portions, establishing all the cart-face shaped divisions. The territory of King Reṇu was in the middle of these.",
      "sinhala": "\"එසේය, භවත්නි,\" යැයි ඒ ක්ෂත්‍රියවරු සය දෙනා මහා ගෝවින්ද බ්‍රාහ්මණයාට පිළිතුරු දී රේණු රජු වෙත පැමිණියහ. පැමිණ රේණු රජුට මෙසේ කීහ: \"භවත්නි, අධිපති රජු මිය ගියේ ය. භවත් රේණු රජු රාජ්‍යයේ අභිෂේකය ලැබී ය. ඔබ ඒ වචනය සිහිපත් කරනවාද?\"\n\n\"භවත්නි, මම ඒ වචනය සිහිපත් කරමි. භවත්නි, උතුරින් දික් වූ ද, දකුණින් ගැලක මුඛයක් වැනි වූ ද මේ මහපොළොව සත් කොටසකට සමසේ මැනවින් බෙදීමට වෙන කවරෙකුට හැකි වේ ද? \"\n\n\"භවත්නි, මහා ගෝවින්ද බ්‍රාහ්මණයාට හැර වෙන කවරෙකුට හැකි වේ ද?\"\n\nඉක්බිති රේණු රජු එක්තරා පුරුෂයෙකු අමතා, \"අම්බෝ පුරුෂය, ඔබ මහා ගෝවින්ද බ්‍රාහ්මණයා වෙත ගොස්, 'රේණු රජතුමා ඔබ කැඳවයි' යැයි කියන්න\" කී ය.\n\n\"එසේය, දේවයන් වහන්ස,\" යැයි ඒ පුරුෂයා රේණු රජුට පිළිතුරු දී මහා ගෝවින්ද බ්‍රාහ්මණයා වෙත ගියේ ය. ගොස් මහා ගෝවින්ද බ්‍රාහ්මණයාට, \"ස්වාමීනි, රේණු රජතුමා ඔබ කැඳවයි\" කී ය.\n\n\"එසේය, භවත්නි,\" යැයි මහා ගෝවින්ද බ්‍රාහ්මණයා ඒ පුරුෂයාට පිළිතුරු දී රේණු රජු වෙත ගියේ ය. ගොස් රේණු රජු සමඟ සතුටු සාමීචියෙහි යෙදුණේ ය. සතුටු සාමීචි කථා නිමවා එක් පසෙක වාඩි විය.\n\nඑක් පසෙක වාඩි වී සිටි මහා ගෝවින්ද බ්‍රාහ්මණයාට රේණු රජු මෙසේ කී ය: \"භවත් ගෝවින්ද, පැමිණ උතුරින් දික් වූ ද, දකුණින් ගැලක මුඛයක් වැනි වූ ද මේ මහපොළොව සත් කොටසකට සමසේ මැනවින් බෙදන්න.\"\n\n\"එසේය, භවත්නි,\" යැයි මහා ගෝවින්ද බ්‍රාහ්මණයා රේණු රජුට පිළිතුරු දී උතුරින් දික් වූ ද, දකුණින් ගැලක මුඛයක් වැනි වූ ද මේ මහපොළොව සත් කොටසකට සමසේ මැනවින් බෙදුවේ ය. ඔහු සියලු ගැලක මුඛයන් පිහිටුවී ය. එහි මැද රේණු රජුගේ ජනපදය විය.",
      "paliTitle": ""
    },
    {
      "number": 309,
      "pali": "Dantapuraṃ kaliṅgānaṃ [kāliṅgānaṃ (syā. pī. ka.)], assakānañca potanaṃ. Mahesayaṃ [māhissati (sī. syā. pī.)] avantīnaṃ, sovīrānañca rorukaṃ. Mithilā ca videhānaṃ, campā aṅgesu māpitā; Bārāṇasī ca kāsīnaṃ, ete govindamāpitāti.",
      "english": "Dantapura belonged to the Kalingas, and Potana to the Assakas. Mahesaya belonged to the Avantis, and Roruka to the Soviras. Mithila belonged to the Videhas, Campa was established in the land of the Angas, and Baranasi belonged to the Kasis. All of these were established by Govinda.",
      "sinhala": "කාලිංගයන්ගේ දන්තපුරයද, අස්සකයන්ගේ පෝතනද, අවන්තීන්ට මහේස්සයද, සෝවීරයන්ට රෝරුකයද, විදේහයන්ගේ මිථිලාවද, අංග දේශයෙහි පිහිටුවන ලද චම්පාවද, කාසීන්ගේ බරණැසද යන මේ සියල්ල ගෝවින්ද විසින් පිහිටුවන ලදී.",
      "paliTitle": ""
    },
    {
      "number": 310,
      "pali": "‘‘Atha kho, bho, te cha khattiyā yathāsakena lābhena attamanā ahesuṃ paripuṇṇasaṅkappā – ‘‘yaṃ vata no ahosi icchitaṃ, yaṃ ākaṅkhitaṃ, yaṃ adhippetaṃ, yaṃ abhipatthitaṃ, taṃ no laddha’’nti. ‘‘Sattabhū brahmadatto ca, vessabhū bharato saha; Reṇu dve dhataraṭṭhā ca, tadāsuṃ satta bhāradhā’ti. Paṭhamabhāṇavāro niṭṭhito. ",
      "english": "Then, esteemed sirs, those six nobles of warrior lineage, content with their individual shares and with their aims fulfilled, rejoiced, thinking, \"What we desired, what we longed for, what we intended, what we hoped for—that we have now received!\"\n\nSattabhū and Brahmadatta, Vessabhū together with Bharata, Reṇu, and the two Dhataraṭṭhas—these were the seven who bore the burden. The first chapter for recitation is complete.",
      "sinhala": "‘‘එවිට, භවත්නි, ඒ ක්ෂත්‍රියවරු සය දෙනා තම තමන්ගේ ලාභයෙන් සතුටු වූහ. ඔවුන්ගේ අභිලාෂයන් සම්පූර්ණ වූයේය. \"අපට යමක් අවශ්‍ය වී තිබුණේද, යමක් අපේක්ෂා කර තිබුණේද, යමක් අදහස් කර තිබුණේද, යමක් ප්‍රාර්ථනා කර තිබුණේද, එය අපට ලැබුණි\" යැයි ඔවුහු සිතූහ. සත්තභූ බ්‍රහ්මදත්ත, වෙස්සභූ භරත, රේණු සහ ධතරට්ඨ යන දෙදෙනා යන සත් දෙනා එකල භාරධාරීහු වූහ. පළමු භාණවාරය නිමි.",
      "paliTitle": ""
    },
    {
      "number": 311,
      "pali": "‘‘Atha kho, bho, te cha khattiyā yena mahāgovindo brāhmaṇo tenupasaṅkamiṃsu; upasaṅkamitvā mahāgovindaṃ brāhmaṇaṃ etadavocuṃ – ‘‘yathā kho bhavaṃ govindo reṇussa rañño sahāyo piyo manāpo appaṭikūlo. Evameva kho bhavaṃ govindo amhākampi sahāyo piyo manāpo appaṭikūlo, anusāsatu no bhavaṃ govindo; mā no bhavaṃ govindo anusāsaniyā paccabyāhāsī’’ti. ‘‘Evaṃ, bho’’ti kho mahāgovindo brāhmaṇo tesaṃ channaṃ khattiyānaṃ paccassosi. Atha kho, bho, mahāgovindo brāhmaṇo satta ca rājāno khattiye muddhāvasitte rajje [muddhābhisitte rajjena (syā.)] anusāsi, satta ca brāhmaṇamahāsāle satta ca nhātakasatāni mante vācesi.",
      "english": "Then, sirs, those six nobles approached the brahmin Mahāgovinda, and upon approaching, said to him: “Just as Master Govinda is a companion to King Reṇu—dear, pleasing, and agreeable—so too, Master Govinda is a companion to us—dear, pleasing, and agreeable. May Master Govinda instruct us; may he not deny us instruction.” “Very well, sirs,” the brahmin Mahāgovinda replied to those six nobles. Then, sirs, Mahāgovinda instructed seven royal nobles, consecrated with sovereignty, and he recited the mantras to seven great brahmin households and seven hundred Snātaka brahmins.",
      "sinhala": "පින්වත්නි, අනතුරුව ඒ ක්ෂත්‍රීයවරු සයදෙනා මහාගෝවින්ද බ්‍රාහ්මණයා වෙත පැමිණ, මහාගෝවින්ද බ්‍රාහ්මණයාට මෙසේ කීහ: “ගෝවින්ද ඔබ රේණු රජතුමාගේ මිත්‍රයා ය. ප්‍රිය, මනාප, අප්‍රතික්‍රීය කෙනෙකි. එලෙසම ඔබ අපගේ ද මිත්‍රයා ය. ප්‍රිය, මනාප, අප්‍රතික්‍රීය කෙනෙකි. එබැවින් අපට අනුශාසනා කරන්න. අනුශාසනා කිරීමෙන් අපව ප්‍රතික්ෂේප නොකරන්න.” මහාගෝවින්ද බ්‍රාහ්මණයා, “එසේය, පින්වත්නි,” යැයි ඒ ක්ෂත්‍රීයවරු සයදෙනාට පිළිතුරු දුන්නේ ය. පින්වත්නි, අනතුරුව මහාගෝවින්ද බ්‍රාහ්මණයා අභිෂේක ලැබූ ක්ෂත්‍රීය රජවරුන් සත්දෙනෙකුට ද, බ්‍රාහ්මණ මහාසල්වරුන් සත්දෙනෙකුට ද, ස්නාතක බ්‍රාහ්මණයන් හත්සියයකට ද මන්ත්‍ර ඉගැන්වී ය.",
      "paliTitle": "Kittisaddaabbhuggamanaṃ",
      "englishTitle": "The Rising of Favorable Reputation",
      "sinhalaTitle": "කීර්ති ඝෝෂා නැගීම"
    },
    {
      "number": 312,
      "pali": "‘‘Atha kho, bho, mahāgovindassa brāhmaṇassa aparena samayena evaṃ kalyāṇo kittisaddo abbhuggacchi [abbhuggañchi (sī. pī.)] – ‘‘sakkhi mahāgovindo brāhmaṇo brahmānaṃ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī’’ti. Atha kho, bho, mahāgovindassa brāhmaṇassa etadahosi – ‘‘mayhaṃ kho evaṃ kalyāṇo kittisaddo abbhuggato – ‘sakkhi mahāgovindo brāhmaṇo brahmānaṃ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī’ti. Na kho panāhaṃ brahmānaṃ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṃ kho pana metaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘yo vassike cattāro māse paṭisallīyati, karuṇaṃ jhānaṃ jhāyati, so brahmānaṃ passati brahmunā sākaccheti brahmunā sallapati brahmunā mantetī’ti. Yaṃnūnāhaṃ vassike cattāro māse paṭisallīyeyyaṃ, karuṇaṃ jhānaṃ jhāyeyya’’nti.",
      "english": "Then, good sirs, in time a favorable rumor spread about the brahmin Mahāgovinda: \"The brahmin Mahāgovinda has directly seen Brahmā! The brahmin Mahāgovinda converses, discusses, and consults with Brahmā!\"\n\nThen, good sirs, it occurred to the brahmin Mahāgovinda: \"Such a favorable rumor has indeed spread about me: 'The brahmin Mahāgovinda has directly seen Brahmā! The brahmin Mahāgovinda converses, discusses, and consults with Brahmā!' But I do not actually see Brahmā, nor converse with Brahmā, nor discuss with Brahmā, nor consult with Brahmā. However, I have heard this said by old and venerable brahmins, teachers and their teachers: 'Whoever secludes themselves for the four months of the rainy season and cultivates the jhāna of compassion, that person sees Brahmā, converses with Brahmā, discusses with Brahmā, and consults with Brahmā.' Therefore, I shall seclude myself for the four months of the rainy season and cultivate the jhāna of compassion.\"",
      "sinhala": "භවත්නි, ඉක්බිති මහාගෝවින්ද බ්‍රාහ්මණයා පිළිබඳව පසුකලෙක මෙබඳු යහපත් කීර්තිඝෝෂාවක් පැතිර ගියේ ය: “මහාගෝවින්ද බ්‍රාහ්මණයා සැබැවින්ම බ්‍රහ්මයා දකියි. මහාගෝවින්ද බ්‍රාහ්මණයා බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි, කථා කරයි, මන්ත්‍රණය කරයි.”\n\nභවත්නි, එවිට මහාගෝවින්ද බ්‍රාහ්මණයාට මෙවැනි සිතක් ඇති විය: “මා ගැන මෙවැනි යහපත් කීර්තිඝෝෂාවක් පැතිර ඇත: ‘මහාගෝවින්ද බ්‍රාහ්මණයා සැබැවින්ම බ්‍රහ්මයා දකියි. මහාගෝවින්ද බ්‍රාහ්මණයා බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි, කථා කරයි, මන්ත්‍රණය කරයි.’ නමුත් මම නම් බ්‍රහ්මයා දකින්නේ නැත. බ්‍රහ්මයා සමඟ සාකච්ඡා කරන්නේ ද නැත. බ්‍රහ්මයා සමඟ කථා කරන්නේ ද නැත. බ්‍රහ්මයා සමඟ මන්ත්‍රණය කරන්නේ ද නැත. එහෙත් වයෝවෘද්ධ, මහලු ආචාර්ය පාචාර්ය බ්‍රාහ්මණයන් මෙසේ කියනු මට අසන්නට ලැබී ඇත: ‘යමෙක් වස් කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වඩයි නම්, ඔහු බ්‍රහ්මයා දකියි. බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි. බ්‍රහ්මයා සමඟ කථා කරයි. බ්‍රහ්මයා සමඟ මන්ත්‍රණය කරයි.’ එබැවින් මම වස් කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වඩන්නෙමි.”",
      "paliTitle": ""
    },
    {
      "number": 313,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena reṇu rājā tenupasaṅkami; upasaṅkamitvā reṇuṃ rājānaṃ etadavoca – ‘‘mayhaṃ kho, bho, evaṃ kalyāṇo kittisaddo abbhuggato – ‘sakkhi mahāgovindo brāhmaṇo brahmānaṃ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī’ti. Na kho panāhaṃ, bho, brahmānaṃ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṃ kho pana metaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘yo vassike cattāro māse paṭisallīyati, karuṇaṃ jhānaṃ jhāyati, so brahmānaṃ passati, brahmunā sākaccheti brahmunā sallapati brahmunā mantetī’ti. Icchāmahaṃ, bho, vassike cattāro māse paṭisallīyituṃ, karuṇaṃ jhānaṃ jhāyituṃ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā’’ti. ‘‘Yassadāni bhavaṃ govindo kālaṃ maññatī’’ti.",
      "english": "Then, revered sirs, the brahmin Mahāgovinda approached King Reṇu. Having approached him, he said: \"Revered sirs, a favorable reputation has spread about me, saying, 'The brahmin Mahāgovinda truly sees Brahmā; he truly converses, speaks, and consults with Brahmā.' But, revered sirs, I do not see Brahmā, nor do I converse, speak, or consult with him. However, I have heard elder and senior brahmins, my teachers and their teachers, say: 'Whoever secludes themselves for the four months of the rainy season and practices the meditative absorption of compassion, sees Brahmā, converses with Brahmā, speaks with Brahmā, and consults with Brahmā.' Therefore, revered sirs, I wish to seclude myself for the four months of the rainy season and practice the meditative absorption of compassion. I should not be approached by anyone, except for one bringing a single offering of food.\"\n\nKing Reṇu replied, \"Venerable Govinda, you may now do as you see fit.\"",
      "sinhala": "එකල්හි මහගොවින්ද බ්‍රාහ්මණයා රේණු රජු වෙත පැමිණ මෙසේ කීවේය: “භවත් රජතුමනි, ‘මහගොවින්ද බ්‍රාහ්මණයා බ්‍රහ්මයා සාක්ෂාත් කොට දකී, බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි, කථාබස් කරයි, මන්ත්‍රණය කරයි’ යන යහපත් කීර්ති නාමයක් මා ගැන පැතිරී තිබේ. එහෙත් භවත්නි, මම බ්‍රහ්මයා දකින්නේ නැත. බ්‍රහ්මයා සමඟ සාකච්ඡා කරන්නේත් නැත. කථාබස් කරන්නේත් නැත. මන්ත්‍රණය කරන්නේත් නැත. එහෙත් වයෝවෘද්ධ, මහලු ආචාර්ය ප්‍රාචාර්ය බ්‍රාහ්මණයන් ‘යමෙක් වස් කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වඩයි නම් ඔහු බ්‍රහ්මයා දකී, බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි, කථාබස් කරයි, මන්ත්‍රණය කරයි’ යැයි කියනු මම අසා ඇත්තෙමි. භවත්නි, මම වස් කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වැඩීමට කැමැත්තෙමි. ආහාර වේලක් ගෙන එන්නෙකු හැර වෙන කිසිවෙකු මා වෙත නොපැමිණිය යුතුය.”\nරේණු රජු පිළිවදන් දුන්නේ, “ගොවින්ද භවත්නි, ඔබ සුදුසු යැයි සිතන පරිදි කරන්න.”",
      "paliTitle": ""
    },
    {
      "number": 314,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca – ‘‘mayhaṃ kho, bho, evaṃ kalyāṇo kittisaddo abbhuggato – ‘sakkhi mahāgovindo brāhmaṇo brahmānaṃ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī’ti. Na kho panāhaṃ, bho, brahmānaṃ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṃ kho pana metaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ, ‘yo vassike cattāro māse paṭisallīyati, karuṇaṃ jhānaṃ jhāyati, so brahmānaṃ passati brahmunā sākaccheti brahmunā sallapati brahmunā mantetī’ti. Icchāmahaṃ, bho, vassike cattāro māse paṭisallīyituṃ, karuṇaṃ jhānaṃ jhāyituṃ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā’’ti. ‘‘Yassadāni bhavaṃ govindo kālaṃ maññatī’’’ti.",
      "english": "Then, revered sirs, the brahmin Mahāgovinda went to those six nobles and said to them: \"Revered sirs, a favorable rumor about me has spread: 'The brahmin Mahāgovinda has directly seen Brahmā; the brahmin Mahāgovinda discusses, converses, and advises with Brahmā.' But truly, revered sirs, I have not seen Brahmā, nor have I discussed with Brahmā, nor conversed with Brahmā, nor advised with Brahmā. However, I have heard this said by old and elderly brahmins, my teachers and their teachers: 'Whoever secludes themselves for the four months of the rainy season and cultivates the meditation of compassion, they see Brahmā, discuss with Brahmā, converse with Brahmā, and advise with Brahmā.' I wish, revered sirs, to seclude myself for the four months of the rainy season and cultivate the meditation of compassion. I should not be approached by anyone except to bring me a single meal.\" \"Venerable Govinda, do as you see fit.\"",
      "sinhala": "“ඉන්පසු මහා ගෝවින්ද බ්‍රාහ්මණයා ඒ ක්ෂත්‍රියවරු හයදෙනා වෙත පැමිණ මෙසේ කීවේය: “පින්වතුනි, ‘මහා ගෝවින්ද බ්‍රාහ්මණයා බ්‍රහ්මයා දකින බවත්, බ්‍රහ්මයා සමඟ කථා කරන බවත්, සාකච්ඡා කරන බවත්, උපදෙස් ගන්නා බවත්’ යන යහපත් කීර්ති නාමයක් මට ලැබී තිබේ. එහෙත්, පින්වතුනි, මම බ්‍රහ්මයා දකින්නේ නැත. බ්‍රහ්මයා සමඟ කථා කරන්නේවත්, සාකච්ඡා කරන්නේවත්, උපදෙස් ගන්නේවත් නැත. එහෙත් වයෝවෘද්ධ, මහලු, ආචාර්ය පාචාර්ය බ්‍රාහ්මණයන් මෙසේ කියනු මට අසන්නට ලැබී ඇත. ‘යමෙක් වස්සාන කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වඩයි නම්, ඔහු බ්‍රහ්මයා දකියි. බ්‍රහ්මයා සමඟ කථා කරයි. සාකච්ඡා කරයි. උපදෙස් ගනී.’ පින්වතුනි, මම වස්සාන කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වැඩීමට කැමැත්තෙමි. ආහාර ගෙන එන එක් අයෙකු හැර වෙන කිසිවෙකු මා වෙත නොපැමිණිය යුතුය.” එවිට ඔවුහු, “ගෝවින්දයන් වහන්සේට සුදුසු යැයි හැඟෙන පරිදි කළ මැනව” යැයි කීහ.",
      "paliTitle": ""
    },
    {
      "number": 315,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena te satta ca brāhmaṇamahāsālā satta ca nhātakasatāni tenupasaṅkami; upasaṅkamitvā te satta ca brāhmaṇamahāsāle satta ca nhātakasatāni etadavoca – ‘‘mayhaṃ kho, bho, evaṃ kalyāṇo kittisaddo abbhuggato – ‘sakkhi mahāgovindo brāhmaṇo brahmānaṃ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī’ti. Na kho panāhaṃ, bho, brahmānaṃ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṃ kho pana metaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘yo vassike cattāro māse paṭisallīyati, karuṇaṃ jhānaṃ jhāyati, so brahmānaṃ passati, brahmunā sākaccheti, brahmunā sallapati, brahmunā mantetī’ti. Tena hi, bho, yathāsute yathāpariyatte mante vitthārena sajjhāyaṃ karotha, aññamaññañca mante vācetha; icchāmahaṃ, bho, vassike cattāro māse paṭisallīyituṃ, karuṇaṃ jhānaṃ jhāyituṃ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā’’ti. ‘‘Yassa dāni bhavaṃ govindo kālaṃ maññatī’’ti.",
      "english": "Then, venerable sirs, the Brahmin Mahāgovinda approached those seven great Brahmin elders and seven hundred initiates. Approaching them, he said:\n\n\"Venerable sirs, a favorable reputation has arisen about me, namely: 'The Brahmin Mahāgovinda directly sees Brahmā, the Brahmin Mahāgovinda directly converses with Brahmā, talks with Brahmā, and consults with Brahmā.' However, venerable sirs, I do not directly see Brahmā, nor do I directly converse with Brahmā, talk with Brahmā, or consult with Brahmā. But I have heard it said by Brahmins who are old, aged, and teachers of teachers: 'Whoever secludes themselves for the four months of the rainy season, meditating on the jhāna of compassion, sees Brahmā, converses with Brahmā, talks with Brahmā, and consults with Brahmā.' Therefore, venerable sirs, extensively recite and study the mantras as you have heard and mastered them, and teach the mantras to one another. I wish to seclude myself for the four months of the rainy season to meditate on the jhāna of compassion. I am not to be approached by anyone, except for one person bringing food.\"\n\n\"Venerable Govinda, do as you see fit.\"",
      "sinhala": "‘‘භවත්නි, ඉක්බිති මහාගෝවින්ද බ්‍රාහ්මණ තෙමේ, ඒ බ්‍රාහ්මණ මහාසල්වරු සත් දෙනා සහ ස්නාතක බ්‍රාහ්මණයන් සත්සියය වෙත එළඹියේ ය. එළඹ ඔවුන්ට මෙසේ කීයේ ය: “භවත්නි, ‘මහාගෝවින්ද බ්‍රාහ්මණ තෙමේ බ්‍රහ්මයා සක්ෂාත් දකී. බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි. බ්‍රහ්මයා සමඟ කථා බස් කරයි. බ්‍රහ්මයා සමඟ මන්ත්‍රණය කරයි’ යන යහපත් කීර්ති රාවයක් මා ගැන පැතිරී ඇත. එහෙත් භවත්නි, මම බ්‍රහ්මයා නොදකිමි. බ්‍රහ්මයා සමඟ සාකච්ඡා නොකරමි. බ්‍රහ්මයා සමඟ කථා බස් නොකරමි. බ්‍රහ්මයා සමඟ මන්ත්‍රණය නොකරමි. එසේ වුව ද, ‘යමෙක් වස්සාන කාලයේ සිව් මසක් තුළ හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වඩන්නේ ද, ඔහු බ්‍රහ්මයා දකී. බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි. බ්‍රහ්මයා සමඟ කථා බස් කරයි. බ්‍රහ්මයා සමඟ මන්ත්‍රණය කරයි’ යනුවෙන් වැඩිහිටි, මහලු, ආචාර්ය පාචාර්ය බ්‍රාහ්මණයන් කියනු මම අසා ඇත්තෙමි. එබැවින් භවත්නි, ඔබලා අසා ඇති, ඉගෙන ගෙන ඇති මන්ත්‍ර විස්තර සහිතව සජ්ඣායනා කරන්න. එකිනෙකාට මන්ත්‍ර උගන්වන්න. භවත්නි, මම වස්සාන කාලයේ සිව් මසක් තුළ හුදෙකලාව වාසය කිරීමටත්, කරුණා ධ්‍යානය වැඩීමටත් කැමැත්තෙමි. ආහාරයක් ගෙන එන එක් අයෙකු හැර වෙන කිසිවෙකු මා වෙත පැමිණිය යුතු නැත.” එවිට ඔවුහු, “ගෝවින්ද භවත් තෙමේ සුදුසු යැයි සිතන පරිදි දැන් කළ මැනව” යි කීහ.",
      "paliTitle": ""
    },
    {
      "number": 316,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena cattārīsā bhariyā sādisiyo tenupasaṅkami; upasaṅkamitvā cattārīsā bhariyā sādisiyo etadavoca – ‘‘mayhaṃ kho, bhotī, evaṃ kalyāṇo kittisaddo abbhuggato – ‘sakkhi mahāgovindo brāhmaṇo brahmānaṃ passati, sakkhi mahāgovindo brāhmaṇo brahmunā sākaccheti sallapati mantetī’ti. Na kho panāhaṃ, bhotī, brahmānaṃ passāmi, na brahmunā sākacchemi, na brahmunā sallapāmi, na brahmunā mantemi. Sutaṃ kho pana metaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ ‘yo vassike cattāro māse paṭisallīyati, karuṇaṃ jhānaṃ jhāyati, so brahmānaṃ passati, brahmunā sākaccheti, brahmunā sallapati, brahmunā mantetīti, icchāmahaṃ, bhotī, vassike cattāro māse paṭisallīyituṃ, karuṇaṃ jhānaṃ jhāyituṃ; namhi kenaci upasaṅkamitabbo aññatra ekena bhattābhihārenā’’ti. ‘‘Yassa dāni bhavaṃ govindo kālaṃ maññatī’’’ti.",
      "english": "Then, the brahmin Mahāgovinda approached his forty wives who shared his views. Approaching them, he said: \"Ladies, this fine reputation has spread about me: 'The brahmin Mahāgovinda truly sees Brahmā; the brahmin Mahāgovinda truly discusses, converses, and consults with Brahmā.' But, ladies, I do not see Brahmā, nor do I discuss with Brahmā, converse with Brahmā, or consult with Brahmā.\"\n\n\"However, I have heard the elder and senior brahmins, my teachers and their teachers, say that 'Whoever secludes themselves for the four months of the rainy season, cultivating the meditation of compassion, sees Brahmā, discusses with Brahmā, converses with Brahmā, and consults with Brahmā.' Therefore, ladies, I wish to seclude myself for the four months of the rainy season to cultivate the meditation of compassion. I am not to be approached by anyone except for a single delivery of food.\"\n\n\"Venerable Govinda, do what you think is best.\"",
      "sinhala": "“එවිට මහාගෝවින්ද බ්‍රාහ්මණ තෙමේ තමා හා සමාන බිරින්දෑවරුන් හතළිස් දෙනා වෙත එළඹ මෙසේ කීවේය: “භවත්නි, මහාගෝවින්ද බ්‍රාහ්මණයා බ්‍රහ්මයා දකින බවත්, බ්‍රහ්මයා සමග සාකච්ඡා කරන, කථාබස් කරන, මන්ත්‍රණය කරන බවටත් මට යහපත් කීර්තිඝෝෂාවක් පැතිරී ඇත. එහෙත්, භවත්නි, මම බ්‍රහ්මයෙකු නොදකිමි. බ්‍රහ්මයා සමග සාකච්ඡා නොකරමි. කථාබස් නොකරමි. මන්ත්‍රණය නොකරමි. එහෙත් වයෝවෘද්ධ, මහලු ආචාර්ය ප්‍රාචාර්ය බ්‍රාහ්මණයන්, ‘යමෙක් වස්සාන කාලයේ සිව් මසක් හුදෙකලාව කරුණා ධ්‍යානය වඩයි ද, ඔහු බ්‍රහ්මයා දකී. බ්‍රහ්මයා සමග සාකච්ඡා කරයි. කථාබස් කරයි. මන්ත්‍රණය කරයි’ යැයි කියනු මට අසන්නට ලැබී ඇත. භවත්නි, මම වස්සාන කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වැඩීමට කැමැත්තෙමි. එක් වේලක් සඳහා ආහාර ගෙන එන්නා හැර වෙන කිසිවෙකු මා වෙත නොපැමිණිය යුතුය.”\n\nඑවිට එම භාර්යාවරු, “ගෝවින්දයන් වහන්සේ යමක් සුදුසු යැයි සිතන සේක් නම්, එය එසේම වේවා!” යි පැවසූහ.",
      "paliTitle": ""
    },
    {
      "number": 317,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo puratthimena nagarassa navaṃ sandhāgāraṃ kārāpetvā vassike cattāro māse paṭisallīyi, karuṇaṃ jhānaṃ jhāyi; nāssudha koci upasaṅkamati [upasaṅkami (pī.)] aññatra ekena bhattābhihārena. Atha kho, bho, mahāgovindassa brāhmaṇassa catunnaṃ māsānaṃ accayena ahudeva ukkaṇṭhanā ahu paritassanā – ‘‘sutaṃ kho pana metaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘yo vassike cattāro māse paṭisallīyati, karuṇaṃ jhānaṃ jhāyati, so brahmānaṃ passati, brahmunā sākaccheti brahmunā sallapati brahmunā mantetī’ti. Na kho panāhaṃ brahmānaṃ passāmi, na brahmunā sākacchemi na brahmunā sallapāmi na brahmunā mantemī’’’ti. ",
      "english": "Then, revered sirs, the brahmin Mahāgovinda, having built a new assembly hall east of the city, secluded himself there for the four months of the rainy season, cultivating the meditation of compassion. No one approached him except the one who brought his meals.\n\nThen, revered sirs, after those four months had passed, weariness and distress arose in the brahmin Mahāgovinda. He thought: \"I have heard it said by old and venerable brahmins, teachers of teachers: 'Whoever secludes himself for the four months of the rainy season, cultivating the meditation of compassion, sees Brahmā, converses with Brahmā, speaks with Brahmā, and consults with Brahmā.' But I do not see Brahmā, I do not converse with Brahmā, I do not speak with Brahmā, and I do not consult with Brahmā.\"",
      "sinhala": "එවිට, පින්වත, මහාගෝවින්ද බ්‍රාහ්මණයා නගරයට නැගෙනහිර දෙසින් නව සන්‍ථාගාරයක් කරවා වස් කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වැඩුවේය. ආහාර ගෙන එන්නෙකු හැර වෙන කිසිවෙක් ඔහු වෙත නොපැමිණියේය.\n\nපසුව, පින්වත, මහාගෝවින්ද බ්‍රාහ්මණයාට සිව් මසක් ගත වූ පසු නො සන්සුන් බවක් හා දැඩි කැළඹීමක් ඇති විය. \"වෘද්ධ වූ, මහලු වූ, ආචාර්ය ප්‍රාචාර්යවරුන් වූ බ්‍රාහ්මණයන් කියනු මම අසා ඇත්තෙමි. 'යමෙක් වස් කාලයේ සිව් මසක් හුදෙකලාව වාසය කරමින් කරුණා ධ්‍යානය වඩයි නම්, ඔහු බ්‍රහ්මයා දකී. බ්‍රහ්මයා සමඟ සාකච්ඡා කරයි. බ්‍රහ්මයා සමඟ කථා බස් කරයි. බ්‍රහ්මයා සමඟ මන්ත්‍රණය කරයි.' නමුත් මම බ්‍රහ්මයා නොදකිමි. බ්‍රහ්මයා සමඟ සාකච්ඡා නොකරමි. බ්‍රහ්මයා සමඟ කථා බස් නොකරමි. බ්‍රහ්මයා සමඟ මන්ත්‍රණය නොකරමි\" යනුවෙන් ඔහු කීවේය.",
      "paliTitle": ""
    },
    {
      "number": 318,
      "pali": "‘‘Atha kho, bho, brahmā sanaṅkumāro mahāgovindassa brāhmaṇassa cetasā cetoparivitakkamaññāya seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva, brahmaloke antarahito mahāgovindassa brāhmaṇassa sammukhe pāturahosi. Atha kho, bho, mahāgovindassa brāhmaṇassa ahudeva bhayaṃ ahu chambhitattaṃ ahu lomahaṃso yathā taṃ adiṭṭhapubbaṃ rūpaṃ disvā. Atha kho, bho, mahāgovindo brāhmaṇo bhīto saṃviggo lomahaṭṭhajāto brahmānaṃ sanaṅkumāraṃ gāthāya ajjhabhāsi – ‘‘‘Vaṇṇavā yasavā sirimā, ko nu tvamasi mārisa; Ajānantā taṃ pucchāma, kathaṃ jānemu taṃ maya’’nti. ‘‘Maṃ ve kumāraṃ jānanti, brahmaloke sanantanaṃ [sanantica (ka.)]; Sabbe jānanti maṃ devā, evaṃ govinda jānahi’’. ‘‘‘Āsanaṃ udakaṃ pajjaṃ, madhusākañca [madhupākañca (sī. syā. pī.)] brahmuno; Agghe bhavantaṃ pucchāma, agghaṃ kurutu no bhavaṃ’’. ‘‘Paṭiggaṇhāma te agghaṃ, yaṃ tvaṃ govinda bhāsasi; Diṭṭhadhammahitatthāya, samparāya sukhāya ca; Katāvakāso pucchassu, yaṃ kiñci abhipatthita’’nti.",
      "english": "Then, venerable sirs, Brahmā Sanaṅkumāra, knowing the brahmin Mahāgovinda's thoughts, just as a strong person might extend a bent arm or bend an extended arm, vanished from the Brahmā-world and appeared before the brahmin Mahāgovinda. Then, venerable sirs, the brahmin Mahāgovinda experienced fear, agitation, and hair-raising fright, seeing a form he had never seen before. Then, venerable sirs, terrified, agitated, and with his hair standing on end, the brahmin Mahāgovinda addressed Brahmā Sanaṅkumāra in verse: \"'Of glorious appearance, renowned, and splendid, who are you, dear sir? We ask, not knowing you; how should we recognize you?'\" \"'Indeed, they know me as Kumāra, the eternal one in the Brahmā-world; all the devas know me; understand this, Govinda.'\" \"'A seat, water for the feet, and a honey-drink for the Exalted One; we ask you for a worthy offering; please accept our offering, venerable sir.'\" \"'We accept your offering, Govinda, which you speak of; for your benefit in this very life and for happiness in the life to come. Now that the opportunity is given, ask whatever you desire.'\"",
      "sinhala": "එවිට, භවත්නි, සනංකුමාර බ්‍රහ්මයා මහාගෝවින්ද බ්‍රාහ්මණයාගේ සිතේ ඇති කල්පනාව දැන, බලවත් පුරුෂයෙක් හැකිළු අතක් දිගහරින්නාක් මෙන් හෝ දිගහැර තිබූ අතක් හකුළුවා ගන්නාක් මෙන්, බ්‍රහ්ම ලෝකයෙන් අතුරුදන් වී මහාගෝවින්ද බ්‍රාහ්මණයා ඉදිරියේ පහළ විය.\n\nභවත්නි, මහාගෝවින්ද බ්‍රාහ්මණයා පෙර නොවූ විරූ රූපයක් දැකීමෙන් භීතියට, තැතිගැන්මට හා ලොමු දහගැන්මට පත්විය.\n\nභවත්නි, මහාගෝවින්ද බ්‍රාහ්මණයා භීතියට පත්ව, සංවේගයට ගොස්, ලොමු දැහැගත් සිතින් සනංකුමාර බ්‍රහ්මයාට ගාථාවකින් මෙසේ ඇමතුවේය: “වර්ණවත්, යසස් ඇති, ශ්‍රීයෙන් පිරිපුන් ඔබ කවරෙක්ද, මාර්ෂය? අපි ඔබ නොදන්නා බැවින් විමසමු. ඔබ කවුරුන්දැයි අපට කෙසේ දැනගත හැකිද?”\n\n“බ්‍රහ්ම ලෝකයේ මා සදාතනික කුමාරයා (සනංකුමාර) ලෙස දනිති. සියලු දෙවියෝ මා හඳුනති. ගෝවින්ද, ඔබත් එසේ දැනගන්න.”\n\n“අප සතුව අසුන්, පානීය ජලය, පාද සේදීමට ජලය හා මධුපාකය බ්‍රහ්මයා උදෙසා ඇත. අපි ඔබට පූජාවක් පිරිනැමීමට කැමැත්තෙමු. භවත් ඔබ අප වෙනුවෙන් එය පිළිගන්න.”\n\n“ගෝවින්ද, ඔබ පවසන ඔබගේ පූජාව අපි පිළිගනිමු. එය මෙලොව යහපතට ද පරලොව සුවයට ද හේතු වේවා! ඔබට අවස්ථාව සලසා ඇත, ඔබ යමක් ප්‍රාර්ථනා කරන්නේ නම් විමසන්න.”",
      "paliTitle": "Brahmunā sākacchā",
      "englishTitle": "Conversation with Brahmā",
      "sinhalaTitle": "බ්‍රාහ්මණයෙකු සමග සාකච්ඡාව"
    },
    {
      "number": 319,
      "pali": "‘‘Atha kho, bho, mahāgovindassa brāhmaṇassa etadahosi – ‘‘katāvakāso khomhi brahmunā sanaṅkumārena. Kiṃ nu kho ahaṃ brahmānaṃ sanaṅkumāraṃ puccheyyaṃ diṭṭhadhammikaṃ vā atthaṃ samparāyikaṃ vā’ti? Atha kho, bho, mahāgovindassa brāhmaṇassa etadahosi – ‘kusalo kho ahaṃ diṭṭhadhammikānaṃ atthānaṃ, aññepi maṃ diṭṭhadhammikaṃ atthaṃ pucchanti. Yaṃnūnāhaṃ brahmānaṃ sanaṅkumāraṃ samparāyikaññeva atthaṃ puccheyya’nti. Atha kho, bho, mahāgovindo brāhmaṇo brahmānaṃ sanaṅkumāraṃ gāthāya ajjhabhāsi – ‘‘Pucchāmi brahmānaṃ sanaṅkumāraṃ, Kaṅkhī akaṅkhiṃ paravediyesu; Katthaṭṭhito kimhi ca sikkhamāno, Pappoti macco amataṃ brahmaloka’’nti. ‘‘Hitvā mamattaṃ manujesu brahme, Ekodibhūto karuṇedhimutto [karuṇādhimutto (sī. syā. pī.)]; Nirāmagandho virato methunasmā, Etthaṭṭhito ettha ca sikkhamāno; Pappoti macco amataṃ brahmaloka’’nti.",
      "english": "Then, revered sirs, the brahmin Mahāgovinda had this thought: \"I have been given an opportunity by Brahmā Sanaṅkumāra. What should I ask Brahmā Sanaṅkumāra? About something related to this present life, or something related to the future life?\" Then, revered sirs, the brahmin Mahāgovinda had this thought: \"I am skilled in matters related to this present life, and others also ask me about them. Why don't I ask Brahmā Sanaṅkumāra only about something related to the future life?\" Then, revered sirs, the brahmin Mahāgovinda addressed Brahmā Sanaṅkumāra in verse: \"I, full of doubt, ask you, Brahmā Sanaṅkumāra, the one free from doubt regarding the knowledge of others: Where must one abide, and in what must one train, to attain the deathless Brahma-world?\"\n\n\"O brahmin, having abandoned possessiveness among humans, having become unified, liberated through compassion, free from the defilement of sensuality, abstaining from sexual activity—by abiding in this, and by training in this, a mortal attains the deathless Brahma-world.\"",
      "sinhala": "භවත්නි, එකල මහාගෝවින්ද බ්‍රාහ්මණයාට මෙවැනි අදහසක් ඇති විය: \"සනංකුමාර බ්‍රහ්මයා මට අවසර දුන්නේය. මා සනංකුමාර බ්‍රහ්මයාගෙන් විෂය දෙකෙන් කුමක් විමසිය යුතුද? මේ ජීවිතයට අදාළ කරුණක්ද, නැතහොත් මතු ජීවිතයට අදාළ කරුණක්ද?\"\n\nභවත්නි, එකල මහාගෝවින්ද බ්‍රාහ්මණයාට නැවත මෙවැනි අදහසක් ඇති විය: \"මම මේ ජීවිතයට අදාළ කරුණු සම්බන්ධයෙන් දක්ෂයෙක් වෙමි. අන්‍යයන් පවා මාගෙන් විමසන්නේ එවැනි කරුණුය. එබැවින් මම සනංකුමාර බ්‍රහ්මයාගෙන් මතු ජීවිතයට අදාළ කරුණක්ම විමසන්නෙමි.\"\n\nභවත්නි, ඉක්බිති මහාගෝවින්ද බ්‍රාහ්මණයා සනංකුමාර බ්‍රහ්මයාට ගාථාවක් මගින් මෙසේ පැවසීය:\n\n\"සනංකුමාර බ්‍රහ්මයාණෙනි, පරලොව කරුණු ගැන සැක සහිත වූ මම, සැක රහිත වූ ඔබගෙන් විමසමි.\nමිනිසෙකු කොහි පිහිටා, කුමන ගුණයෙහි හික්මෙමින්, අමරණීය බ්‍රහ්ම ලෝකය ලබන්නේද?\"\n\n\"බ්‍රහ්මයාණෙනි, මිනිසුන් කෙරෙහි ඇති මමත්වය දුරු කර, සිත එකඟ කරගෙන, කරුණාවෙන් යුක්තව, කාම ගන්ධයෙන් තොරව, මෛථුනයෙන් වැළකී, මෙහි පිහිටා, මෙහිම හික්මෙමින්, මිනිසා අමරණීය බ්‍රහ්ම ලෝකය ලබයි.\"",
      "paliTitle": ""
    },
    {
      "number": 320,
      "pali": "‘‘Hitvā mamatta’nti ahaṃ bhoto ājānāmi. Idhekacco appaṃ vā bhogakkhandhaṃ pahāya mahantaṃ vā bhogakkhandhaṃ pahāya appaṃ vā ñātiparivaṭṭaṃ pahāya mahantaṃ vā ñātiparivaṭṭaṃ pahāya kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati, ‘iti hitvā mamatta’nti ahaṃ bhoto ājānāmi. ‘Ekodibhūto’ti ahaṃ bhoto ājānāmi. Idhekacco vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ, iti ekodibhūto’ti ahaṃ bhoto ājānāmi. ‘Karuṇedhimutto’ti ahaṃ bhoto ājānāmi. Idhekacco karuṇāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadhotiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ karuṇāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Iti ‘karuṇedhimutto’ti ahaṃ bhoto ājānāmi. Āmagandhe ca kho ahaṃ bhoto bhāsamānassa na ājānāmi. ‘‘Ke āmagandhā manujesu brahme, Ete avidvā idha brūhi dhīra; Kenāvaṭā [kenāvuṭā (syā.)] vāti pajā kurutu [kururū (syā.), kuruṭṭharū (pī.), kurūru (?)], Āpāyikā nivutabrahmalokā’’ti. ‘‘Kodho mosavajjaṃ nikati ca dubbho, Kadariyatā atimāno usūyā; Icchā vivicchā paraheṭhanā ca, Lobho ca doso ca mado ca moho; Etesu yuttā anirāmagandhā, Āpāyikā nivutabrahmalokā’’ti. ‘‘Yathā kho ahaṃ bhoto āmagandhe bhāsamānassa ājānāmi. Te na sunimmadayā agāraṃ ajjhāvasatā. Pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. ‘‘Yassadāni bhavaṃ govindo kālaṃ maññatī’’ti. ",
      "english": "I understand your statement, \"Having abandoned possessiveness.\" In this case, someone abandons a small or large amount of possessions, abandons a small or large circle of relatives, shaves their hair and beard, puts on saffron robes, and goes forth from home into homelessness. This is how I understand your statement, \"Having abandoned possessiveness.\" I understand your statement, \"Being secluded.\" In this case, someone resorts to a secluded dwelling place: a forest, the foot of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open space, or a heap of straw. This is how I understand your statement, \"Being secluded.\" I understand your statement, \"Immersed in compassion.\" In this case, someone dwells having pervaded one direction with a mind imbued with compassion, and likewise the second direction, and likewise the third direction, and likewise the fourth direction. Thus, upward, downward, and across, everywhere, in every way, they dwell having pervaded the entire world with a mind imbued with compassion, a mind that is vast, exalted, immeasurable, free from enmity, and free from ill will. This is how I understand your statement, \"Immersed in compassion.\" However, I do not understand what you mean by \"raw stench\" when you speak of it.\n\n\"What are the raw stenches among humans, O Brahmin? Explain them here to us who are ignorant, O wise one. By what are beings obstructed, and why do they lament? Who are destined for states of woe, kept far from Brahma worlds?\"\n\n\"Anger, false speech, treachery, and deceit; stinginess, excessive pride, and envy; desire, doubt, and harming of others; greed and hatred, conceit and delusion—those engaged in these are truly raw-smelling, destined for states of woe, kept far from Brahma worlds.\"\n\nNow I understand what you mean by \"raw stench\" when you speak of it. These are not easily overcome by someone living at home. Therefore, good sir, I shall go forth from home into homelessness. \"Let Master Govinda do as he now sees fit.\"",
      "sinhala": "‘මමත්වය දුරු කිරීම’ යනු මෙය යැයි මම දනිමි, භවත්නි. මෙලොව ඇතැම් කෙනෙක් සුළු හෝ මහත් භෝග සම්භාරයක් අත්හැර, සුළු හෝ මහත් ඥාති පිරිසක් අත්හැර, හිසකෙස් හා රැවුල බූ ගා, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වෙයි. ‘මමත්වය දුරු කිරීම’ යනු මෙය යැයි මම දනිමි, භවත්නි.\n\n‘ඒකාන්ත වූ තැනැත්තා’ යනු මෙය යැයි මම දනිමි, භවත්නි. මෙලොව ඇතැම් කෙනෙක් විවේකී වන සෙනස්, එනම් අරණ්‍යය, රුක්මුල, පර්වතය, කන්දරාව, ගිරිගුහාව, සුසානය, වනාන්තරය, එළිමහන, පිදුරු ගොඩවල් ආදිය සෙවනය කරයි. ‘ඒකාන්ත වූ තැනැත්තා’ යනු මෙය යැයි මම දනිමි, භවත්නි.\n\n‘කරුණාවෙන් මුදුන් පත් වූ තැනැත්තා’ යනු මෙය යැයි මම දනිමි, භවත්නි. මෙලොව ඇතැම් කෙනෙක් කරුණාව සහගත සිතින් එක් දිශාවක් පුරා වෙසෙයි. එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සිව්වන දිශාව ද පුරා වෙසෙයි. මෙසේ උඩ, යට, සරස, සෑම අතින් ම, මුළු ලොවම මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ක්‍රෝධ රහිත වූ කරුණා සහගත සිතින් පුරවාගෙන වෙසෙයි. ‘කරුණාවෙන් මුදුන් පත් වූ තැනැත්තා’ යනු මෙය යැයි මම දනිමි, භවත්නි.\n\nඑහෙත්, ‘ආමගන්ධය’ ගැන ඔබ වහන්සේ දේශනා කරන දෙය මම නොදනිමි. \"පණ්ඩිත බ්‍රාහ්මණය, මිනිසුන් කෙරෙහි පවත්නා මේ ආමගන්ධයෝ කවරහු ද? මම ඒවා නොදනිමි. මට මෙහිලා පවසන්න. කවර කරුණකින් වැසී ගත් සත්ත්වයෝ අපායගාමී වී බ්‍රහ්ම ලෝකයෙන් වළකනු ලබත් ද?\"\n\n\"ක්‍රෝධය, බොරු කීම, වංචාව, ද්‍රෝහීකම, මසුරුකම, අතිමානය, ඊර්ෂ්‍යාව, ආශාව, දැඩි ආශාව, අනුන්ට හිංසා කිරීම, ලෝභය, ද්වේශය, මදය, මෝහය යන මේවායෙහි ඇලී ගැලී සිටින අය ආමගන්ධයෙන් තොර නොවෙති. ඔවුහු අපායගාමී වෙති. බ්‍රහ්ම ලෝකයෙන් වළකනු ලබති.\"\n\n\"ඔබ වහන්සේ ‘ආමගන්ධය’ ගැන දේශනා කරන දෙය මම දැන් අවබෝධ කරගනිමි. ගිහිගෙයි වසන අයට නම් මේවා සම්පූර්ණයෙන් ම යටපත් කිරීම අපහසු ය. භවත්නි, මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමි.\" \"ගොවින්දයන් වහන්ස, දැන් ඔබට සුදුසු යැයි හැඟෙන වේලාව එළඹ ඇත.\"",
      "paliTitle": ""
    },
    {
      "number": 321,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena reṇu rājā tenupasaṅkami; upasaṅkamitvā reṇuṃ rājānaṃ etadavoca – ‘‘aññaṃ dāni bhavaṃ purohitaṃ pariyesatu, yo bhoto rajjaṃ anusāsissati. Icchāmahaṃ, bho, agārasmā anagāriyaṃ pabbajituṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā. Pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. ‘‘Āmantayāmi rājānaṃ, reṇuṃ bhūmipatiṃ ahaṃ; Tvaṃ pajānassu rajjena, nāhaṃ porohicce rame’’. ‘‘Sace te ūnaṃ kāmehi, ahaṃ paripūrayāmi te; Yo taṃ hiṃsati vāremi, bhūmisenāpati ahaṃ; Tuvaṃ pitā ahaṃ putto, mā no govinda pājahi’’ [pājehi (aṭṭhakathāyaṃ saṃvaṇṇitapāṭhantaraṃ)]. ‘‘Namatthi ūnaṃ kāmehi, hiṃsitā me na vijjati; Amanussavaco sutvā, tasmāhaṃ na gahe rame’’. ‘‘Amanusso kathaṃvaṇṇo, kiṃ te atthaṃ abhāsatha; Yañca sutvā jahāsi no, gehe amhe ca kevalī’’. ‘‘Upavutthassa me pubbe, yiṭṭhukāmassa me sato; Aggi pajjalito āsi, kusapattaparitthato’’. ‘‘Tato me brahmā pāturahu, brahmalokā sanantano; So me pañhaṃ viyākāsi, taṃ sutvā na gahe rame’’. ‘‘Saddahāmi ahaṃ bhoto, yaṃ tvaṃ govinda bhāsasi; Amanussavaco sutvā, kathaṃ vattetha aññathā. ‘‘Te taṃ anuvattissāma, satthā govinda no bhavaṃ; Maṇi yathā veḷuriyo, akāco vimalo subho; Evaṃ suddhā carissāma, govindassānusāsane’’ti. ‘‘‘Sace bhavaṃ govindo agārasmā anagāriyaṃ pabbajissati, mayampi agārasmā anagāriyaṃ pabbajissāma. Atha yā te gati, sā no gati bhavissatī’’ti. ",
      "english": "Then, venerable sir, the brahmin Mahāgovinda approached King Reṇu. Having approached, he said to King Reṇu: \"Your Majesty should now seek another chaplain to instruct your kingdom. I wish to go forth from the householder's life into homelessness. For I have heard Brahmā speak of the stench of sensual pleasures, which cannot be overcome while dwelling in a home. I shall go forth, venerable sir, from the householder's life into homelessness.\"\n\n\"I address you, King Reṇu, lord of the land: Understand this concerning the kingdom: I no longer delight in the role of chaplain.\" Reṇu responded: \"If you lack anything in terms of pleasures, I will fulfill it for you. Whoever harms you, I will prevent it, for I am the lord of the land and commander of the army. You are like a father to me, and I like a son; Govinda, do not abandon us.\"\n\n\"I lack nothing in terms of pleasures, and no one harms me. Having heard the words of a non-human being, I therefore no longer delight in the household life.\"\n\n\"What was the nature of this non-human being? What benefit did he declare to you? What did you hear that made you abandon us, both the household and us entirely?\"\n\n\"Formerly, when I was observing vows, desiring to perform a sacrifice, my fire was burning, surrounded by kusa grass.\"\n\n\"Then Brahmā, the eternal one from the Brahmā-world, appeared to me. He explained a question to me, and having heard that, I no longer delight in household life.\"\n\n\"I trust what you say, Govinda. Having heard the words of a non-human being, how could it be otherwise? We shall follow you; you, Govinda, are our teacher. Just as a beryl jewel is without flaw, pure, and beautiful, so too shall we live purely according to Govinda's instruction.\"\n\n\"If your majesty Govinda goes forth from the householder's life into homelessness, we too shall go forth from the householder's life into homelessness. Then whatever your destination, that shall be our destination.\"",
      "sinhala": "එවිට මහාගෝවින්ද බ්‍රාහ්මණයා රේණු රජු වෙත ගියේය. ගොස් රේණු රජුට මෙසේ කීවේය: \"භවත් රජතුමනි, ඔබගේ රාජ්‍යය පාලනය කිරීමට වෙනත් පුරෝහිතයෙකු සොයාගන්න. මම ගිහි ජීවිතයෙන් අත් මිදී අනගාරික ජීවිතයකට ඇතුළු වීමට කැමැත්තෙමි. බ්‍රහ්මයා ආමගන්ධය ගැන දේශනා කරනු මට ඇසිණි. ගිහි ජීවිතයේ වසන කෙනෙකුට එම ආමගන්ධ පහසුවෙන් දුරු කළ නොහැකි බව මට වැටහිණි. එබැවින් මම ගිහි ජීවිතයෙන් නික්ම අනගාරිකව පැවිදි වන්නෙමි.\"\n\n\"රේණු නම් භූමිපති රජුට මම ආරාධනා කරමි. ඔබ රාජ්‍යය පරිපාලනය කරන්න. මම පුරෝහිත තනතුරෙහි ඇලී ගැලී සිටීමට කැමති නැත.\"\n\n\"ඔබට යම් කාම සම්පතක් අඩු නම්, මම එය සම්පූර්ණ කර දෙන්නම්. ඔබට හිංසා කරන්නන්ගෙන් මම ඔබව ආරක්ෂා කරමි. මම භූමියේ සේනාධිපති වෙමි. ඔබ මගේ පියා මෙන් වන අතර මම ඔබගේ පුත්‍රයා වෙමි. ගෝවින්ද ඔබ අප හැර නොයන්න!\"\n\n\"මට කිසිදු කාම සම්පතක් අඩු නැත. මට හිංසා කරන්නෙකු ද නැත. මම අමනුෂ්‍යයෙකුගේ වචන ඇසීම නිසා ගිහි ජීවිතයේ නොරැඳෙමි.\"\n\n\"ඒ අමනුෂ්‍යයාගේ ස්වරූපය කෙබඳුද? ඔහු ඔබට කුමක් කීවේද? ඔබ එය අසා ගිහිගෙය සහ අප සියල්ලන්ම අත්හරින්නේ මන්ද?\"\n\n\"මම උපවාස කරමින්, යඥයක් කිරීමට අපේක්ෂාවෙන් සිටියදී, කුස තණවලින් වට වූ ගින්නක් ඇවිළුණි.\"\n\n\"එවිට සදාකාලික බ්‍රහ්ම ලෝකයෙන් බ්‍රහ්මයෙක් මට දර්ශනය විය. ඔහු මාගේ ප්‍රශ්නයට පිළිතුරු දුන්නේය. එය ඇසූ මම ගිහිගෙයි නොරැඳෙමි.\"\n\n\"ගෝවින්දය ඔබ පවසන දෙය මම විශ්වාස කරමි. අමනුෂ්‍යයෙකුගේ වචන ඇසූ පසු වෙනස් ලෙස ක්‍රියා කරන්නේ කෙසේද?\"\n\n\"ගෝවින්දය, ඔබ අපගේ ශාස්තෘවරයාය. අපි ඔබව අනුගමනය කරන්නෙමු. කැළැල් රහිත, නිර්මල, ශුභදායක වෛඪූර්ය මාණික්‍යයක් මෙන්, අපි ඔබගේ අනුශාසනා අනුව පිරිසිදුව ජීවත් වන්නෙමු.\"\n\n\"ගෝවින්ද භවතාණන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නේ නම්, අපි ද ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමු. එවිට ඔබට ඇති ගතියම අපට ද අත්වනු ඇත.\"",
      "paliTitle": "Reṇurājaāmantanā",
      "englishTitle": "Renuraja's Address",
      "sinhalaTitle": "රේණුරාජ ආමන්ත්‍රණය"
    },
    {
      "number": 322,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena te cha khattiyā tenupasaṅkami; upasaṅkamitvā te cha khattiye etadavoca – ‘‘aññaṃ dāni bhavanto purohitaṃ pariyesantu, yo bhavantānaṃ rajje anusāsissati. Icchāmahaṃ, bho, agārasmā anagāriyaṃ pabbajituṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā. Pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. Atha kho, bho, te cha khattiyā ekamantaṃ apakkamma evaṃ samacintesuṃ – ‘‘ime kho brāhmaṇā nāma dhanaluddhā; yaṃnūna mayaṃ mahāgovindaṃ brāhmaṇaṃ dhanena sikkheyyāmā’’ti. Te mahāgovindaṃ brāhmaṇaṃ upasaṅkamitvā evamāhaṃsu – ‘‘saṃvijjati kho, bho, imesu sattasu rajjesu pahūtaṃ sāpateyyaṃ, tato bhoto yāvatakena attho, tāvatakaṃ āharīyata’’nti. ‘‘Alaṃ, bho, mamapidaṃ pahūtaṃ sāpateyyaṃ bhavantānaṃyeva vāhasā. Tamahaṃ sabbaṃ pahāya agārasmā anagāriyaṃ pabbajissāmi. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā, pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. Atha kho, bho, te cha khattiyā ekamantaṃ apakkamma evaṃ samacintesuṃ – ‘‘ime kho brāhmaṇā nāma itthiluddhā; yaṃnūna mayaṃ mahāgovindaṃ brāhmaṇaṃ itthīhi sikkheyyāmā’’ti. Te mahāgovindaṃ brāhmaṇaṃ upasaṅkamitvā evamāhaṃsu – ‘‘saṃvijjanti kho, bho, imesu sattasu rajjesu pahūtā itthiyo, tato bhoto yāvatikāhi attho, tāvatikā ānīyata’’nti. ‘‘Alaṃ, bho, mamapimā [mamapitā (ka.), mamapi (sī.)] cattārīsā bhariyā sādisiyo. Tāpāhaṃ sabbā pahāya agārasmā anagāriyaṃ pabbajissāmi. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā, pabbajissāmahaṃ, bho, agārasmā anagāriyanti’’.",
      "english": "Then, venerable sirs, the brahmin Mahāgovinda approached those six nobles. Having approached them, he said: \"Now, venerable sirs, you should seek another chaplain, one who can guide you in your kingdoms. I wish to go forth from the household life into homelessness. For I have heard that the Great Brahma, when speaking of the raw stench (of sensuality), says that those who dwell in a house cannot easily overcome it. Therefore, venerable sirs, I shall go forth from the household life into homelessness.”\n\nThen, venerable sirs, those six nobles withdrew to one side and considered: \"These brahmins are, in truth, greedy for wealth. What if we were to try to tempt Mahāgovinda with wealth?\" They approached Mahāgovinda and said: \"Indeed, venerable sir, in these seven kingdoms there is abundant property. Take as much as you need from it.\" \"Enough, venerable sirs. I already have abundant property, thanks to you. I shall abandon all of it and go forth from the household life into homelessness. For I have heard that the Great Brahma, when speaking of the raw stench (of sensuality), says that those who dwell in a house cannot easily overcome it. Therefore, venerable sirs, I shall go forth from the household life into homelessness.”\n\nThen, venerable sirs, those six nobles withdrew to one side and considered: \"These brahmins are, in truth, greedy for women. What if we were to try to tempt Mahāgovinda with women?\" They approached Mahāgovinda and said: \"Indeed, venerable sir, in these seven kingdoms there are abundant women. Take as many as you need from them.\" \"Enough, venerable sirs. I myself have forty wives, all of equal standing. I shall abandon all of them and go forth from the household life into homelessness. For I have heard that the Great Brahma, when speaking of the raw stench (of sensuality), says that those who dwell in a house cannot easily overcome it. Therefore, venerable sirs, I shall go forth from the household life into homelessness.\"",
      "sinhala": "‘‘ඉක්බිති, භවත්නි, මහාගෝවින්ද බ්‍රාහ්මණ තෙමේ යම් තැනක ඒ ක්ෂත්‍රියවරු සය දෙනා සිටියාහු ද, එතැනට පැමිණියේ ය. පැමිණ ඒ ක්ෂත්‍රියවරු සය දෙනාට මෙසේ කීයේ ය: ‘‘භවත්හු දැන් වෙනත් පුරෝහිතයෙකු සොයා ගනිත්වා. ඔහු භවත්හුගේ රාජ්‍යය පාලනය කරන්නේ ය. භවත්නි, මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයකට පැවිදි වීමට කැමැත්තෙමි. මක්නිසා ද යත්, බ්‍රහ්මයා විසින් ආමගන්ධය ගැන දේශනා කරනු ලැබූ පරිදි, ගිහිගෙයි වාසය කරන්නන්ට එය පහසුවෙන් දුරු කළ නොහැකි බව මට අසන්නට ලැබුණි. භවත්නි, මම ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමි.’’\n\nඉක්බිති, භවත්නි, ඒ ක්ෂත්‍රියවරු සය දෙනා එක් පසෙකට ගොස් මෙසේ කල්පනා කළහ: ‘‘මේ බ්‍රාහ්මණවරු ධනයට ලොල් වූවෝ වෙති. අපි මහාගෝවින්ද බ්‍රාහ්මණයා ධනයෙන් පොළඹවා ගැනීමට උත්සාහ කරමු ද?’’ ඔවුහු මහාගෝවින්ද බ්‍රාහ්මණයා වෙත පැමිණ මෙසේ කීහ: ‘‘භවත්නි, මේ රාජ්‍යයන් සතෙහි බොහෝ ධන සම්පත් තිබේ. එබැවින් භවතාට අවශ්‍ය පමණ ගෙන එනු ලැබේවා.’’ ‘‘භවත්නි, මට ද ඇති තරම් ධන සම්පත් තිබේ. ඒවා භවත්හුට ම වේවා! මම ඒ සියල්ල අත්හැර ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමි. මක්නිසා ද යත්, බ්‍රහ්මයා විසින් ආමගන්ධය ගැන දේශනා කරනු ලැබූ පරිදි, ගිහිගෙයි වාසය කරන්නන්ට එය පහසුවෙන් දුරු කළ නොහැකි බව මට අසන්නට ලැබුණි. භවත්නි, මම ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමි.’’\n\nඉක්බිති, භවත්නි, ඒ ක්ෂත්‍රියවරු සය දෙනා එක් පසෙකට ගොස් මෙසේ කල්පනා කළහ: ‘‘මේ බ්‍රාහ්මණවරු ස්ත්‍රීන්ට ලොල් වූවෝ වෙති. අපි මහාගෝවින්ද බ්‍රාහ්මණයා ස්ත්‍රීන්ගෙන් පොළඹවා ගැනීමට උත්සාහ කරමු ද?’’ ඔවුහු මහාගෝවින්ද බ්‍රාහ්මණයා වෙත පැමිණ මෙසේ කීහ: ‘‘භවත්නි, මේ රාජ්‍යයන් සතෙහි බොහෝ ස්ත්‍රීහු සිටිති. එබැවින් භවතාට අවශ්‍ය පමණ ගෙන එනු ලැබේවා.’’ ‘‘භවත්නි, මට සම තරුණ වයසේ භාර්යාවන් හතළිස් දෙනෙක් සිටිති. මම ඒ සියලු දෙනා අත්හැර ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමි. මක්නිසා ද යත්, බ්‍රහ්මයා විසින් ආමගන්ධය ගැන දේශනා කරනු ලැබූ පරිදි, ගිහිගෙයි වාසය කරන්නන්ට එය පහසුවෙන් දුරු කළ නොහැකි බව මට අසන්නට ලැබුණි. භවත්නි, මම ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමි.’’",
      "paliTitle": "Cha khattiyaāmantanā",
      "englishTitle": "Six Royal Invocations",
      "sinhalaTitle": "ක්ෂත්‍රිය ආරාධනා හය"
    },
    {
      "number": 323,
      "pali": "‘‘Sace bhavaṃ govindo agārasmā anagāriyaṃ pabbajissati, mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatīti. ‘‘Sace jahatha kāmāni, yattha satto puthujjano; Ārambhavho daḷhā hotha, khantibalasamāhitā. ‘‘Esa maggo ujumaggo, esa maggo anuttaro; Saddhammo sabbhi rakkhito, brahmalokūpapattiyāti. ‘‘Tena hi bhavaṃ govindo satta vassāni āgametu. Sattannaṃ vassānaṃ accayena mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatī’’ti. ‘‘‘Aticiraṃ kho, bho, satta vassāni, nāhaṃ sakkomi, bhavante, satta vassāni āgametuṃ. Ko nu kho pana, bho, jānāti jīvitānaṃ! Gamanīyo samparāyo, mantāyaṃ [mantāya (bahūsu)] boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā, pabbajissāmahaṃ, bho, agārasmā anagāriya’’’nti. ‘‘Tena hi bhavaṃ govindo chabbassāni āgametu…pe… pañca vassāni āgametu… cattāri vassāni āgametu… tīṇi vassāni āgametu… dve vassāni āgametu… ekaṃ vassaṃ āgametu, ekassa vassassa accayena mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatī’’ti. ‘‘‘Aticiraṃ kho, bho, ekaṃ vassaṃ, nāhaṃ sakkomi bhavante ekaṃ vassaṃ āgametuṃ. Ko nu kho pana, bho, jānāti jīvitānaṃ! Gamanīyo samparāyo, mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā, pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. ‘‘Tena hi bhavaṃ govindo satta māsāni āgametu, sattannaṃ māsānaṃ accayena mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatī’’ti. ‘‘‘Aticiraṃ kho, bho, satta māsāni, nāhaṃ sakkomi bhavante satta māsāni āgametuṃ. Ko nu kho pana, bho, jānāti jīvitānaṃ. Gamanīyo samparāyo, mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā, pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. ‘‘‘Tena hi bhavaṃ govindo cha māsāni āgametu…pe… pañca māsāni āgametu… cattāri māsāni āgametu… tīṇi māsāni āgametu… dve māsāni āgametu… ekaṃ māsaṃ āgametu… addhamāsaṃ āgametu, addhamāsassa accayena mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatī’’ti. ‘‘‘Aticiraṃ kho, bho, addhamāso, nāhaṃ sakkomi bhavante addhamāsaṃ āgametuṃ. Ko nu kho pana, bho, jānāti jīvitānaṃ! Gamanīyo samparāyo, mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā, pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. ‘‘Tena hi bhavaṃ govindo sattāhaṃ āgametu, yāva mayaṃ sake puttabhātaro rajjena [rajje (syā.)] anusāsissāma, sattāhassa accayena mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatī’’ti. ‘‘Na ciraṃ kho, bho, sattāhaṃ, āgamessāmahaṃ bhavante sattāha’’nti. ",
      "english": "\"If Venerable Govinda goes forth from the householder's life to homelessness, we too will go forth from the householder's life to homelessness, and whatever your destination, that will be our destination.\"\n\n\"If you abandon sensual pleasures, to which ordinary people are attached, be firm in your endeavor, possessing the strength of patience and equanimity. This is the direct path, this is the unsurpassed path; the true Dhamma is protected by the good, leading to rebirth in the Brahma world.\"\n\n\"In that case, let Venerable Govinda wait for seven years. After seven years have passed, we too will go forth from the householder's life to homelessness, and whatever your destination, that will be our destination.\"\n\n\"Indeed, good sirs, seven years is too long. I am unable to wait seven years. Who knows the span of life? The next world is to be reached; counsel is to be understood; merit is to be made; the holy life is to be lived; there is no deathlessness for one who is born. As I have heard Brahma proclaim regarding the raw stench, these things cannot be utterly suppressed while living in a house. I shall go forth, good sirs, from the householder's life to homelessness.\"\n\n\"In that case, let Venerable Govinda wait for six years… five years… four years… three years… two years… one year. After one year has passed, we too will go forth from the householder's life to homelessness, and whatever your destination, that will be our destination.\"\n\n\"Indeed, good sirs, one year is too long. I am unable to wait one year. Who knows the span of life? The next world is to be reached; counsel is to be understood; merit is to be made; the holy life is to be lived; there is no deathlessness for one who is born. As I have heard Brahma proclaim regarding the raw stench, these things cannot be utterly suppressed while living in a house. I shall go forth, good sirs, from the householder's life to homelessness.\"\n\n\"In that case, let Venerable Govinda wait for seven months. After seven months have passed, we too will go forth from the householder's life to homelessness, and whatever your destination, that will be our destination.\"\n\n\"Indeed, good sirs, seven months is too long. I am unable to wait seven months. Who knows the span of life? The next world is to be reached; counsel is to be understood; merit is to be made; the holy life is to be lived; there is no deathlessness for one who is born. As I have heard Brahma proclaim regarding the raw stench, these things cannot be utterly suppressed while living in a house. I shall go forth, good sirs, from the householder's life to homelessness.\"\n\n\"In that case, let Venerable Govinda wait for six months… five months… four months… three months… two months… one month… half a month. After half a month has passed, we too will go forth from the householder's life to homelessness, and whatever your destination, that will be our destination.\"\n\n\"Indeed, good sirs, half a month is too long. I am unable to wait half a month. Who knows the span of life? The next world is to be reached; counsel is to be understood; merit is to be made; the holy life is to be lived; there is no deathlessness for one who is born. As I have heard Brahma proclaim regarding the raw stench, these things cannot be utterly suppressed while living in a house. I shall go forth, good sirs, from the householder's life to homelessness.\"\n\n\"In that case, let Venerable Govinda wait for seven days, until we can instruct our sons and brothers regarding the kingdom. After seven days have passed, we too will go forth from the householder's life to homelessness, and whatever your destination, that will be our destination.\"\n\n\"Indeed, good sirs, seven days is not long. I will wait seven days.\"",
      "sinhala": "භවත් ගෝවින්දයන් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නේ නම්, අපි ද ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමු. එවිට ඔබට යම් ගතියක් වේ ද, එය අපට ද අත්වනු ඇත. පෘථග්ජනයා යම් කාමයන්හි ඇලී ගැලී සිටී නම්, ඒවා අත්හරින්න. උත්සාහයෙහි දැඩි වන්න. ක්ෂාන්තියෙන් හා බලයෙන් යුක්ත ව සිත එකඟ කරගන්න. මේ සෘජු මාර්ගයයි. මේ අනුත්තර මාර්ගයයි. සත්පුරුෂයන් විසින් ආරක්ෂා කරන ලද මේ සද්ධර්මය බ්‍රහ්ම ලෝකයේ උපත ලැබීම පිණිස පවතී.\n\nඑසේ නම් භවත් ගෝවින්දයන් වසර සතක් ඉවසන්න. වසර සතක් ඇවෑමෙන් අපි ද ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමු. එවිට ඔබට යම් ගතියක් වේ ද, එය අපට ද අත්වනු ඇත.\n\n'භවත්නි, වසර සතක් යනු බොහෝ කාලයකි. භවත්නි, මට වසර සතක් ඉවසිය නොහැකිය. භවත්නි, ජීවිත ගැන දන්නේ කවුරුන් ද? පරලොව ගමනට සූදානම් විය යුතු ය. මේ ගැන මනසින් දැනගත යුතු ය. කුසල් කළ යුතු ය. බ්‍රහ්මචාරී ජීවිතය ගත කළ යුතු ය. උපන් කෙනෙකුට මරණයෙන් මිදීමක් නැත. භවත්නි, බ්‍රහ්මයා ආමගන්ධය ගැන දේශනා කළ ආකාරය මම අසා ඇත්තෙමි. ගිහි ජීවිතයක් ගත කරන කෙනෙකුට ඒවා පහසුවෙන් සම්පූර්ණයෙන්ම මැඩපැවැත්විය නොහැක. භවත්නි, එහෙයින් මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමි.'\n\nඑසේ නම් භවත් ගෝවින්දයන් වසර හයක් ඉවසන්න. පසුව වසර පහක් ඉවසන්න. සිව් වසරක් ඉවසන්න. තෙවසරක් ඉවසන්න. දෙවසරක් ඉවසන්න. එක් වසරක් ඉවසන්න. එක් වසරක් ඇවෑමෙන් අපි ද ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමු. එවිට ඔබට යම් ගතියක් වේ ද, එය අපට ද අත්වනු ඇත.\n\n'භවත්නි, එක් වසරක් යනු බොහෝ කාලයකි. භවත්නි, මට එක් වසරක් ඉවසිය නොහැකිය. භවත්නි, ජීවිත ගැන දන්නේ කවුරුන් ද? පරලොව ගමනට සූදානම් විය යුතු ය. මෙය මනසින් දැනගත යුතු ය. කුසල් කළ යුතු ය. බ්‍රහ්මචාරී ජීවිතය ගත කළ යුතු ය. උපන් කෙනෙකුට මරණයෙන් මිදීමක් නැත. භවත්නි, බ්‍රහ්මයා ආමගන්ධය ගැන දේශනා කළ ආකාරය මම අසා ඇත්තෙමි. ගිහි ජීවිතයක් ගත කරන කෙනෙකුට ඒවා පහසුවෙන් සම්පූර්ණයෙන්ම මැඩපැවැත්විය නොහැක. භවත්නි, එහෙයින් මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමි.'\n\nඑසේ නම් භවත් ගෝවින්දයන් මාස සතක් ඉවසන්න. මාස සතක් ඇවෑමෙන් අපි ද ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමු. එවිට ඔබට යම් ගතියක් වේ ද, එය අපට ද අත්වනු ඇත.\n\n'භවත්නි, මාස සතක් යනු බොහෝ කාලයකි. භවත්නි, මට මාස සතක් ඉවසිය නොහැකිය. භවත්නි, ජීවිත ගැන දන්නේ කවුරුන් ද? පරලොව ගමනට සූදානම් විය යුතු ය. මෙය මනසින් දැනගත යුතු ය. කුසල් කළ යුතු ය. බ්‍රහ්මචාරී ජීවිතය ගත කළ යුතු ය. උපන් කෙනෙකුට මරණයෙන් මිදීමක් නැත. භවත්නි, බ්‍රහ්මයා ආමගන්ධය ගැන දේශනා කළ ආකාරය මම අසා ඇත්තෙමි. ගිහි ජීවිතයක් ගත කරන කෙනෙකුට ඒවා පහසුවෙන් සම්පූර්ණයෙන්ම මැඩපැවැත්විය නොහැක. භවත්නි, එහෙයින් මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමි.'\n\n'එසේ නම් භවත් ගෝවින්දයන් මාස හයක් ඉවසන්න. පසුව මාස පහක් ඉවසන්න. සිව් මසක් ඉවසන්න. තෙමසක් ඉවසන්න. දෙමසක් ඉවසන්න. එක් මසක් ඉවසන්න. අඩ මසක් ඉවසන්න. අඩ මසක් ඇවෑමෙන් අපි ද ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමු. එවිට ඔබට යම් ගතියක් වේ ද, එය අපට ද අත්වනු ඇත.'\n\n'භවත්නි, අඩ මසක් යනු බොහෝ කාලයකි. භවත්නි, මට අඩ මසක් ඉවසිය නොහැකිය. භවත්නි, ජීවිත ගැන දන්නේ කවුරුන් ද? පරලොව ගමනට සූදානම් විය යුතු ය. මෙය මනසින් දැනගත යුතු ය. කුසල් කළ යුතු ය. බ්‍රහ්මචාරී ජීවිතය ගත කළ යුතු ය. උපන් කෙනෙකුට මරණයෙන් මිදීමක් නැත. භවත්නි, බ්‍රහ්මයා ආමගන්ධය ගැන දේශනා කළ ආකාරය මම අසා ඇත්තෙමි. ගිහි ජීවිතයක් ගත කරන කෙනෙකුට ඒවා පහසුවෙන් සම්පූර්ණයෙන්ම මැඩපැවැත්විය නොහැක. භවත්නි, එහෙයින් මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමි.'\n\nඑසේ නම් භවත් ගෝවින්දයන් සත් දිනක් ඉවසන්න. අපි අපගේ පුත්‍රයන්ට හා සහෝදරයන්ට රාජ්‍යය ගැන අවවාද කරන තුරු ඉවසන්න. සත් දිනක් ඇවෑමෙන් අපි ද ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නෙමු. එවිට ඔබට යම් ගතියක් වේ ද, එය අපට ද අත්වනු ඇත.\n\n'භවත්නි, සත් දිනක් යනු වැඩි කාලයක් නොවේ. භවත්නි, මම සත් දිනක් ඉවසන්නෙමි.'",
      "paliTitle": ""
    },
    {
      "number": 324,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena te satta ca brāhmaṇamahāsālā satta ca nhātakasatāni tenupasaṅkami; upasaṅkamitvā te satta ca brāhmaṇamahāsāle satta ca nhātakasatāni etadavoca – ‘‘aññaṃ dāni bhavanto ācariyaṃ pariyesantu, yo bhavantānaṃ mante vācessati. Icchāmahaṃ, bho, agārasmā anagāriyaṃ pabbajituṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa. Te na sunimmadayā agāraṃ ajjhāvasatā, pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. ‘‘Mā bhavaṃ govindo agārasmā anagāriyaṃ pabbaji. Pabbajjā, bho, appesakkhā ca appalābhā ca; brahmaññaṃ mahesakkhañca mahālābhañcā’’ti. ‘‘Mā bhavanto evaṃ avacuttha – ‘‘pabbajjā appesakkhā ca appalābhā ca, brahmaññaṃ mahesakkhañca mahālābhañcā’’ti. Ko nu kho, bho, aññatra mayā mahesakkhataro vā mahālābhataro vā! Ahañhi, bho, etarahi rājāva raññaṃ brahmāva brāhmaṇānaṃ [brahmānaṃ (sī. pī. ka.)] devatāva gahapatikānaṃ. Tamahaṃ sabbaṃ pahāya agārasmā anagāriyaṃ pabbajissāmi. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā. Pabbajissāmahaṃ, bho, agārasmā anagāriya’’nti. ‘‘Sace bhavaṃ govindo agārasmā anagāriyaṃ pabbajissati, mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatī’’ti. ",
      "english": "Then, revered sirs, the Brahmin Mahāgovinda went to those seven great Brahmin householders and seven hundred initiated Brahmins. Upon arriving, he said to them: \"Now, gentlemen, you must seek another teacher who will recite the mantras for you. For I desire, sirs, to go forth from the household life into homelessness. Indeed, I have heard Brahmā speak of impurities that are not easily overcome while living at home. I shall go forth, sirs, from the household life into homelessness.\"\n\nThey replied, \"Govinda, do not go forth from the household life into homelessness. Renunciation, sirs, offers little influence and little gain, while the life of a Brahmin offers great influence and great gain.\"\n\nMahāgovinda responded, \"Do not speak thus, gentlemen, saying that renunciation offers little influence and little gain, and that the life of a Brahmin offers great influence and great gain. Who, sirs, is of greater influence or greater gain than I? For I, sirs, am now like a king to kings, like Brahmā to Brahmins, and like a deity to householders. I shall abandon all of that and go forth from the household life into homelessness. Indeed, I have heard Brahmā speak of impurities that are not easily overcome while living at home. I shall go forth, sirs, from the household life into homelessness.\"\n\nThey then said, \"If you, Govinda, go forth from the household life into homelessness, we too will go forth from the household life into homelessness, and whatever path you take, that will be our path as well.\"",
      "sinhala": "එවිට, පින්වත්නි, මහා ගෝවින්ද බ්‍රාහ්මණයා යම් තැනෙක ඒ බ්‍රාහ්මණ මහාසාලවරු සත් දෙනා ද, ස්නාතක සිය ගණනක් ද සිටියෝ ද, එතැනට පැමිණියේ ය. පැමිණ, ඒ බ්‍රාහ්මණ මහාසාලවරුන් සත් දෙනාට ද, ස්නාතක සිය ගණනට ද මෙසේ කීවේ ය: “පින්වතුන් වහන්සේලාට මන්ත්‍ර උගන්වන වෙනත් ආචාර්යවරයකු දැන් සොයා ගන්න. මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වීමට කැමැත්තෙමි. බ්‍රහ්මයා ලෝකයේ අශුචි ස්වභාවය ගැන දේශනා කරනු මට ඇසිණි. ගිහිගෙයි වාසය කරන්නන්ට ඒවා පහසුවෙන් සමනය කළ නොහැකි ය. එබැවින්, පින්වත්නි, මම ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වන්නෙමි.”\n\n“ගෝවින්ද භවත්නි, ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි නොවන්න. පැවිද්ද අල්පේක්ෂාකය, අල්පලාභය. බ්‍රාහ්මණ්‍යය මහේශාක්‍යය, මහලාභය.”\n\n“පැවිද්ද අල්පේක්ෂාකය, අල්පලාභය, බ්‍රාහ්මණ්‍යය මහේශාක්‍යය, මහලාභය යැයි පින්වතුන් වහන්සේලා එසේ නොකියන්න. පින්වත්නි, මා හැර වෙන කවරෙක් නම් මහේශාක්‍ය හෝ මහලාභී හෝ වන්නේ ද? පින්වත්නි, මම දැන් රජුන්ට රජෙක් වැනිය, බ්‍රාහ්මණයන්ට බ්‍රහ්මයෙක් වැනිය, ගෘහපතියන්ට දෙවියෙක් වැනිය. ඒ සියල්ල අත්හැර මම ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වන්නෙමි. බ්‍රහ්මයා ලෝකයේ අශුචි ස්වභාවය ගැන දේශනා කරනු මට ඇසිණි. ගිහිගෙයි වාසය කරන්නන්ට ඒවා පහසුවෙන් සමනය කළ නොහැකි ය. එබැවින්, පින්වත්නි, මම ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වන්නෙමි.”\n\n“ගෝවින්ද භවත්නි, ඔබ ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වන්නේ නම්, අපි ද ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වන්නෙමු. ඔබට යම් ගතියක් වේ ද, ඒ ගතිය අපට ද වන්නේ ය.”",
      "paliTitle": "Brāhmaṇamahāsālādīnaṃ āmantanā",
      "englishTitle": "Addresses to eminent brahmins",
      "sinhalaTitle": "බ්‍රාහ්මණ මහාසාල ආදීන්ට ඇමතීම"
    },
    {
      "number": 325,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo yena cattārīsā bhariyā sādisiyo tenupasaṅkami; upasaṅkamitvā cattārīsā bhariyā sādisiyo etadavoca – ‘‘yā bhotīnaṃ icchati, sakāni vā ñātikulāni gacchatu aññaṃ vā bhattāraṃ pariyesatu. Icchāmahaṃ, bhotī, agārasmā anagāriyaṃ pabbajituṃ. Yathā kho pana me sutaṃ brahmuno āmagandhe bhāsamānassa, te na sunimmadayā agāraṃ ajjhāvasatā. Pabbajissāmahaṃ, bhotī, agārasmā anagāriya’’nti. ‘‘Tvaññeva no ñāti ñātikāmānaṃ, tvaṃ pana bhattā bhattukāmānaṃ. Sace bhavaṃ govindo agārasmā anagāriyaṃ pabbajissati, mayampi agārasmā anagāriyaṃ pabbajissāma, atha yā te gati, sā no gati bhavissatī’’ti. ",
      "english": "Then, Mahāgovinda the Brahmin approached his forty identical wives and said to them, “Any of you who wish may return to your own family or seek another husband. I, ladies, desire to go forth from the household life into homelessness. For I have heard the Great Brahma speak, saying that defilements cannot be completely overcome by one who dwells in a home. Therefore, I, ladies, will go forth from the household life into homelessness.”\n\nThe wives replied, “You are our family for those who desire family, and you are our husband for those who desire a husband. If you, Master Govinda, go forth from the household life into homelessness, we too will go forth from the household life into homelessness. Whatever your path, that will be our path.”",
      "sinhala": "එවිට, පින්වත්නි, මහා ගෝවින්ද බ්‍රාහ්මණයා තමාට සමාන භාර්යාවන් සතළිස් දෙනා වෙත පැමිණියේය. පැමිණ, භාර්යාවන් සතළිස් දෙනාට මෙසේ කීවේය: \"ඔබලාගෙන් කැමති අයෙකුට තම ඥාති කුලයකට යා හැකිය. නැතහොත් වෙනත් ස්වාමිපුරුෂයෙකු සොයාගත හැකිය. පින්වත්නි, මම ගිහිගෙයින් නික්ම අනගාරික ජීවිතයකට ඇතුළු වීමට කැමැත්තෙමි. මම අසා ඇති පරිදි, බ්‍රහ්මයා ආමගන්ධය ගැන දේශනා කළේ ගිහි ජීවිතයේ සිටින කෙනෙකුට එය සම්පූර්ණයෙන් ඉවත් කළ නොහැකි බවයි. පින්වත්නි, මම ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමි.\"\n\n\"ඥාතීන් අවශ්‍ය අපට ඔබම ඥාතියා වෙයි. ස්වාමිපුරුෂයෙකු අවශ්‍ය අපට ඔබම ස්වාමිපුරුෂයා වෙයි. භවත් ගෝවින්දයන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නේ නම්, අපි ද ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමු. ඔබට යම් ගතියක් වේ ද, එයම අපගේ ද ගතිය වන්නේය.\"",
      "paliTitle": "Bhariyānaṃ āmantanā",
      "englishTitle": "Address to the Wives",
      "sinhalaTitle": "භාර්යාවන්ට ඇමතීම"
    },
    {
      "number": 326,
      "pali": "‘‘Atha kho, bho, mahāgovindo brāhmaṇo tassa sattāhassa accayena kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbaji. Pabbajitaṃ pana mahāgovindaṃ brāhmaṇaṃ satta ca rājāno khattiyā muddhāvasittā satta ca brāhmaṇamahāsālā satta ca nhātakasatāni cattārīsā ca bhariyā sādisiyo anekāni ca khattiyasahassāni anekāni ca brāhmaṇasahassāni anekāni ca gahapatisahassāni anekehi ca itthāgārehi itthiyo kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā mahāgovindaṃ brāhmaṇaṃ agārasmā anagāriyaṃ pabbajitaṃ anupabbajiṃsu. Tāya sudaṃ, bho, parisāya parivuto mahāgovindo brāhmaṇo gāmanigamarājadhānīsu cārikaṃ carati. Yaṃ kho pana, bho, tena samayena mahāgovindo brāhmaṇo gāmaṃ vā nigamaṃ vā upasaṅkamati, tattha rājāva hoti raññaṃ, brahmāva brāhmaṇānaṃ, devatāva gahapatikānaṃ. Tena kho pana samayena manussā khipanti vā upakkhalanti vā te evamāhaṃsu – ‘‘namatthu mahāgovindassa brāhmaṇassa, namatthu satta purohitassā’’’ti.",
      "english": "Then, after that seven-day period, the Brahmin Mahāgovinda shaved his head and beard, donned saffron robes, and went forth from the householder's life into homelessness. When the Brahmin Mahāgovinda had gone forth, seven anointed Khattiya kings, seven wealthy Brahmin householders, seven hundred graduates, forty wives of equal status, many thousands of Khattiyas, many thousands of Brahmins, many thousands of householders, and women from many harems, shaved their heads and beards, donned saffron robes, and followed the Brahmin Mahāgovinda from the householder's life into homelessness. Surrounded by this assembly, the Brahmin Mahāgovinda traveled through villages, towns, and capital cities. Whenever the Brahmin Mahāgovinda approached a village or town, he was like a king among kings, like Brahmā among Brahmins, and like a deity among householders. At that time, people, whether hurrying or stumbling, would say, \"Homage to the Brahmin Mahāgovinda! Homage to the chief priest of the seven!\"",
      "sinhala": "භවත්නි, මහාගෝවින්ද බ්‍රාහ්මණයා අනතුරුව සත් දවසක් ඇවෑමෙන් කෙස් හා රැවුල් ඉවත් කොට, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරික ජීවිතයකට පැවිදි විය. මහාගෝවින්ද බ්‍රාහ්මණයා පැවිදි වූ පසු, අභිෂේක ලැබූ ක්ෂත්‍රීය රජවරු සත් දෙනෙක්, මහා ධනවත් බ්‍රාහ්මණවරු සත් දෙනෙක්, ස්නාතක බ්‍රාහ්මණයන් හත් සියයක්, සම තරාතිරමේ භාර්යාවන් හතළිස් දෙනෙක්, ක්ෂත්‍රීයයන් දහස් ගණනක්, බ්‍රාහ්මණයන් දහස් ගණනක්, ගෘහපතියන් දහස් ගණනක් සහ අන්තඃපුරවල සිටි බොහෝ ස්ත්‍රීන් ද කෙස් හා රැවුල් ඉවත් කොට, කසාවත් හැඳ, ගිහිගෙයින් නික්ම මහාගෝවින්ද බ්‍රාහ්මණයා අනුව පැවිදි වූහ. භවත්නි, මහාගෝවින්ද බ්‍රාහ්මණයා ඒ පිරිස සමඟ ගම්, නියම්ගම් හා රාජධානිවල සැරිසරමින් චාරිකාවේ යෙදුණේය. භවත්නි, මහාගෝවින්ද බ්‍රාහ්මණයා ඒ සමයෙහි යම් ගමකට හෝ නියම්ගමකට හෝ පිවිසියේ නම්, එහිදී ඔහු රජුන්ට රජෙකු මෙන් ද, බ්‍රාහ්මණයන්ට බ්‍රහ්මයෙකු මෙන් ද, ගෘහපතියන්ට දෙවියෙකු මෙන් ද විය. ඒ සමයෙහි මිනිසුන් ඉක්මන් වන විට හෝ පැකිලෙන විට, \"මහාගෝවින්ද බ්‍රාහ්මණයාට නමස්කාර වේවා! සත්පුරුෂ පූජකයාට නමස්කාර වේවා!\" යැයි කියමින් වැන්දෝය.",
      "paliTitle": "Mahāgovindapabbajjā",
      "englishTitle": "The Great Govinda's Renunciation",
      "sinhalaTitle": "මහාගෝවින්ද පබ්බජ්ජා"
    },
    {
      "number": 327,
      "pali": "‘‘Mahāgovindo, bho, brāhmaṇo mettāsahagatena cetasā ekaṃ disaṃ pharitvā vihāsi, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihāsi. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā…pe… abyāpajjena pharitvā vihāsi sāvakānañca brahmalokasahabyatāya maggaṃ desesi.",
      "english": "The Brahmin Mahāgovinda, sirs, abided pervading one direction with a heart filled with loving-kindness, and so too the second direction, and so too the third, and so too the fourth. Thus, above, below, across, everywhere, completely, he abided pervading the entire world with a heart filled with loving-kindness—vast, exalted, immeasurable, without hostility, and without ill-will. In the same way, he pervaded the world with a heart filled with compassion—vast, exalted, immeasurable, without hostility, and without ill-will; with a heart filled with sympathetic joy—vast, exalted, immeasurable, without hostility, and without ill-will; and with a heart filled with equanimity—vast, exalted, immeasurable, without hostility, and without ill-will. And he taught his disciples the path to fellowship with the Brahmā realm.",
      "sinhala": "භවත්නි, මහා ගෝවින්ද නම් බ්‍රාහ්මණය තෙමේ මෛත්‍රී සහගත සිතින් එක් දිශාවක් පුරා පැතිර වාසය කළේ ය. එලෙස ම දෙවන දිශාවක්, එලෙස ම තෙවන දිශාවක්, එලෙස ම සිව්වන දිශාවක් පුරා ද පැතිර වාසය කළේ ය. මෙසේ ඉහළ, පහළ, හරස් අතට යන සියලු දිශාවන්හි ම සර්වප්‍රකාරයෙන් මුළු ලෝකය ම මෛත්‍රී සහගත, විශාල, උදාර, අප්‍රමාණ, වෛර රහිත, ව්‍යාපාද රහිත සිතින් පුරවා වාසය කළේ ය. එසේ ම කරුණා සහගත, විශාල, උදාර, අප්‍රමාණ, වෛර රහිත, ව්‍යාපාද රහිත සිතින් ද (පුරවා වාසය කළේ ය). එසේ ම මුදිතා සහගත, විශාල, උදාර, අප්‍රමාණ, වෛර රහිත, ව්‍යාපාද රහිත සිතින් ද (පුරවා වාසය කළේ ය). එසේ ම උපේක්ෂා සහගත, විශාල, උදාර, අප්‍රමාණ, වෛර රහිත, ව්‍යාපාද රහිත සිතින් ද (පුරවා වාසය කළේ ය). තව ද ඔහු තම ශ්‍රාවකයන්ට බ්‍රහ්ම ලෝකයේ උපත ලැබීම සඳහා මාර්ගය දේශනා කළේ ය.",
      "paliTitle": ""
    },
    {
      "number": 328,
      "pali": "‘‘Ye kho pana, bho, tena samayena mahāgovindassa brāhmaṇassa sāvakā sabbena sabbaṃ sāsanaṃ ājāniṃsu. Te kāyassa bhedā paraṃ maraṇā sugatiṃ brahmalokaṃ upapajjiṃsu. Ye na sabbena sabbaṃ sāsanaṃ ājāniṃsu, te kāyassa bhedā paraṃ maraṇā appekacce paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjiṃsu; appekacce nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjiṃsu; appekacce tusitānaṃ devānaṃ sahabyataṃ upapajjiṃsu; appekacce yāmānaṃ devānaṃ sahabyataṃ upapajjiṃsu; appekacce tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjiṃsu; appekacce cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjiṃsu; ye sabbanihīnaṃ kāyaṃ paripūresuṃ te gandhabbakāyaṃ paripūresuṃ. Iti kho, bho [pana (syā. ka.)], sabbesaṃyeva tesaṃ kulaputtānaṃ amoghā pabbajjā ahosi avañjhā saphalā saudrayā’’’ti.",
      "english": "And indeed, O sirs, those disciples of the brahmin Mahāgovinda at that time who fully understood the teaching, upon the dissolution of the body, after death, were reborn in a good destination, the Brahma world. Those who did not fully understand the teaching, upon the dissolution of the body, after death, some were reborn in companionship with the devas who control the creations of others; some were reborn in companionship with the devas who delight in creation; some were reborn in companionship with the Tusita devas; some were reborn in companionship with the Yama devas; some were reborn in companionship with the Tāvatiṃsa devas; some were reborn in companionship with the Cātumahārājika devas; and those who fulfilled the most inferior destiny, they fulfilled the destiny of a Gandhabba. Thus, indeed, O sirs, for all those young men of good families, their renunciation was not in vain, not fruitless, but beneficial and productive.",
      "sinhala": "භවත්නි, ඒ කාලයේ මහාගෝවින්ද බ්‍රාහ්මණයාගේ ශ්‍රාවකයින් අතුරින් යම් අයෙක් සම්පූර්ණයෙන්ම ශාසනය අවබෝධ කර ගත්තාහු ද, ඔවුහු කය බිඳී, මරණින් පසු සුගතියෙහි, එනම් බ්‍රහ්ම ලෝකයේ උපත ලැබූහ. යම් අයෙක් ශාසනය සම්පූර්ණයෙන් අවබෝධ කර නොගත්තාහු ද, ඔවුහු කය බිඳී, මරණින් පසු ඇතැම්හු පරනිර්මිතවශවර්තී දෙවියන් අතරෙහි ද, ඇතැම්හු නිර්මාණරතී දෙවියන් අතරෙහි ද, ඇතැම්හු තුසිත දෙවියන් අතරෙහි ද, ඇතැම්හු යාම දෙවියන් අතරෙහි ද, ඇතැම්හු තාවතිංස දෙවියන් අතරෙහි ද, ඇතැම්හු චාතුර්මහාරාජික දෙවියන් අතරෙහි ද උපත ලැබූහ. පහත් තත්ත්වයේ කය සම්පූර්ණ කළ අය ගන්ධබ්බ කයෙහි උපත ලැබූහ. භවත්නි, ඒ සියලු කුලපුත්‍රයන්ගේ පැවිද්ද නිෂ්ඵල නොවූ අතර එය සාර්ථක හා යහපත් ප්‍රතිඵල ගෙන දෙන ලද්දක් විය.",
      "paliTitle": ""
    },
    {
      "number": 329,
      "pali": "‘‘Sarati taṃ bhagavā’’ti? ‘‘Sarāmahaṃ, pañcasikha. Ahaṃ tena samayena mahāgovindo brāhmaṇo ahosiṃ. Ahaṃ tesaṃ sāvakānaṃ brahmalokasahabyatāya maggaṃ desesiṃ. Taṃ kho pana me, pañcasikha, brahmacariyaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati, yāvadeva brahmalokūpapattiyā. Idaṃ kho pana me, pañcasikha, brahmacariyaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Katamañca taṃ, pañcasikha, brahmacariyaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati? Ayameva ariyo aṭṭhaṅgiko maggo. Seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Idaṃ kho taṃ, pañcasikha, brahmacariyaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati.",
      "english": "“Does the Blessed One recall that?”\n\n“I recall, Pañcasikha. At that time, I was the great Brahmin Mahāgovinda. I taught my disciples the path to fellowship with Brahmā in the Brahmā-world. But that spiritual life of mine, Pañcasikha, did not lead to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, or Nibbāna; it led only to rebirth in the Brahmā-world. However, this spiritual life of mine, Pañcasikha, leads solely to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna. And what, Pañcasikha, is that spiritual life that leads solely to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna? It is this Noble Eightfold Path: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This, Pañcasikha, is that spiritual life that leads solely to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna.”",
      "sinhala": "“භාග්‍යවතුන් වහන්සේ එය සිහි කරනවාද?” “පංචසිඛය, මම සිහි කරමි. මම ඒ කාලයේ මහා ගෝවින්ද නම් බ්‍රාහ්මණයෙක් වීමි. මම ඒ ශ්‍රාවකයන්ට බ්‍රහ්ම ලෝකයේ සහභාගීත්වයට යන මාර්ගය දේශනා කළෙමි. එහෙත් පංචසිඛය, මාගේ ඒ බ්‍රහ්මචර්යාව කලකිරීමට, විරාගයට, නිරෝධයට, සන්සිඳීමට, අභිඥා ලැබීමට, සම්බෝධියට හෝ නිර්වාණයට හේතු වූයේ නැත. එය හුදෙක් බ්‍රහ්ම ලෝකයේ උපතක් ලැබීම දක්වා පමණක් විය. එහෙත් පංචසිඛය, මාගේ මේ බ්‍රහ්මචර්යාව ඒකාන්තයෙන්ම කලකිරීමට, විරාගයට, නිරෝධයට, සන්සිඳීමට, අභිඥා ලැබීමට, සම්බෝධියට හා නිර්වාණයට හේතු වේ. පංචසිඛය, ඒකාන්තයෙන්ම කලකිරීමට, විරාගයට, නිරෝධයට, සන්සිඳීමට, අභිඥා ලැබීමට, සම්බෝධියට හා නිර්වාණයට හේතු වන ඒ බ්‍රහ්මචර්යාව කුමක්ද? එය නම් ආර්ය අෂ්ටාංගික මාර්ගයයි. එනම්: සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යන මේවායි. පංචසිඛය, ඒකාන්තයෙන්ම කලකිරීමට, විරාගයට, නිරෝධයට, සන්සිඳීමට, අභිඥා ලැබීමට, සම්බෝධියට හා නිර්වාණයට හේතු වන බ්‍රහ්මචර්යාව මෙයයි.”",
      "paliTitle": ""
    },
    {
      "number": 330,
      "pali": "‘‘Ye kho pana me, pañcasikha, sāvakā sabbena sabbaṃ sāsanaṃ ājānanti, te āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti; ye na sabbena sabbaṃ sāsanaṃ ājānanti, te pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātikā honti tattha parinibbāyino anāvattidhammā tasmā lokā. Ye na sabbena sabbaṃ sāsanaṃ ājānanti, appekacce tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmino honti sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissanti [karonti (sī. pī.)]. Ye na sabbena sabbaṃ sāsanaṃ ājānanti, appekacce tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpannā honti avinipātadhammā niyatā sambodhiparāyaṇā. Iti kho, pañcasikha, sabbesaṃyeva imesaṃ kulaputtānaṃ amoghā pabbajjā [pabbajā ahosi (ka.)] avañjhā saphalā saudrayā’’ti. Idamavoca bhagavā. Attamano pañcasikho gandhabbaputto bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyīti.",
      "english": "Pañcasikha, those of my disciples who fully understand the Teaching, through the ending of the taints, realize for themselves, through direct knowledge, and abide in the taintless liberation of mind and liberation through wisdom, here and now. Those who do not fully understand the Teaching, through the destruction of the five lower fetters, are reborn spontaneously and attain final Nibbana there, never to return from that world. Those who do not fully understand the Teaching, some, through the destruction of the three fetters and the weakening of greed, hatred, and delusion, become once-returners, returning to this world only once more to end suffering. Those who do not fully understand the Teaching, some, through the destruction of the three fetters, become stream-enterers, no longer subject to states of woe, certain, and destined for full enlightenment. Thus, Pañcasikha, for all these noble sons, their going forth is not in vain, but fruitful, beneficial, and yields good results.\n\nThat is what the Blessed One said. Pleased, Pañcasikha the gandhabba son, delighted and approving of the Blessed One’s words, paid homage to him, respectfully circumambulated him, and vanished on the spot.",
      "sinhala": "පඤ්චසිඛය, මාගේ යම් ශ්‍රාවකයෝ මුළුමහත් ශාසනය මැනවින් අවබෝධ කරගනිත් ද, ඔවුහු ආශ්‍රව ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මෙලොවදීම තමන් විසින් ම සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරති. යම් අයෙක් මුළුමහත් ශාසනය අවබෝධ කර නොගනිත් ද, ඔවුහු පහළ සංයෝජන පහ ක්ෂය කිරීමෙන් ඕපපාතිකව උපත ලබන්නෝ වෙති. එහි දී ම පිරිනිවන් පාන්නෝ වෙති. ඔවුන් ඒ ලෝකයෙන් නැවත නො එන්නෝ ය. යම් අයෙක් මුළුමහත් ශාසනය අවබෝධ කර නොගනිත් ද, ඇතැම්හු සංයෝජන තුනක් ක්ෂය කිරීමෙන් රාග, ද්වේෂ, මෝහ තුනී වීම හේතුවෙන් සකෘදාගාමී වෙති. ඔවුහු එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුක් කෙළවර කරති. යම් අයෙක් මුළුමහත් ශාසනය අවබෝධ කර නොගනිත් ද, ඇතැම්හු සංයෝජන තුනක් ක්ෂය කිරීමෙන් සෝවාන් වෙති. ඔවුහු අපායට නො වැටෙන ස්වභාව ඇත්තෝ ය. සම්බෝධිය පරම කොට ඇත්තෝ ය. පඤ්චසිඛය, මේ සියලු කුලපුත්‍රයන්ගේ පැවිද්ද නිෂ්ඵල නො වේ. වඳ නො වේ. සඵල වේ. යහපත් ඵල විපාක සහිත වේ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ගාන්ධර්ව පුත්‍ර වූ පඤ්චසිඛ තෙමේ සතුටු සිතින් භාග්‍යවතුන් වහන්සේගේ වචනය අභිනන්දනය කර, අනුමෝදන් වී, භාග්‍යවතුන් වහන්සේට වැඳ, පැදකුණු කොට එතැනම අතුරුදහන් විය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahāgovindasuttaṃ niṭṭhitaṃ chaṭṭhaṃ.",
    "english": "The Mahāgovinda Sutta: Sixth and Concluded.",
    "sinhala": "මහාගෝවින්ද සූත්‍රය නිමි, හයවැන්න."
  }
}