{
  "id": "dn.2.1",
  "title": {
    "pali": "Mahāpadānasuttaṃ",
    "english": "The Great Discourse on the Legends",
    "sinhala": "මහාපදානසූත්‍රය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme karerikuṭikāyaṃ. Atha kho sambahulānaṃ bhikkhūnaṃ pacchābhattaṃ piṇḍapātapaṭikkantānaṃ karerimaṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ pubbenivāsapaṭisaṃyuttā dhammī kathā udapādi – ‘‘itipi pubbenivāso, itipi pubbenivāso’’ti.",
      "english": "Thus I have heard. At one time the Blessed One was staying in Sāvatthī, in Jeta's Grove, at Anāthapiṇḍika's monastery, in the Kareri hut. Then, after the meal, as they returned from alms gathering, a large number of monks assembled and sat together in the Kareri pavilion. A Dhamma discussion arose among them concerning past lives, as they spoke, \"Such was a past life, such was a past life.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවනාරාමයෙහි වූ අනාථපිණ්ඩික සිටුතුමාගේ ආරාමයෙහි කරේරිකුටියෙහි වැඩවසන සේක. එවිට බොහෝ භික්ෂූන් වහන්සේලා දන් වළඳා අවසන් වී, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, කරේරීමණ්ඩල මාලයෙහි රැස්වී වැඩසිටියදී, ‘මෙයද පෙර විසූ කඳ පිළිවෙළකි, මෙයද පෙර විසූ කඳ පිළිවෙළකි’ යැයි කියමින් පෙර විසූ කඳ පිළිවෙළ හා සම්බන්ධ ධර්ම කථාවක් ඇති විය.",
      "paliTitle": "Pubbenivāsapaṭisaṃyuttakathā",
      "englishTitle": "Stories Connected with Past Lives",
      "sinhalaTitle": "පුබ්බෙනිවාසානුස්සති කථා"
    },
    {
      "number": 2,
      "pali": "Assosi kho bhagavā dibbāya sotadhātuyā visuddhāya atikkantamānusikāya tesaṃ bhikkhūnaṃ imaṃ kathāsallāpaṃ. Atha kho bhagavā uṭṭhāyāsanā yena karerimaṇḍalamāḷo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi, nisajja kho bhagavā bhikkhū āmantesi – ‘‘kāyanuttha, bhikkhave, etarahi kathāya sannisinnā; kā ca pana vo antarākathā vippakatā’’ti? Evaṃ vutte te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, amhākaṃ pacchābhattaṃ piṇḍapātapaṭikkantānaṃ karerimaṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ pubbenivāsapaṭisaṃyuttā dhammī kathā udapādi – ‘itipi pubbenivāso itipi pubbenivāso’ti. Ayaṃ kho no, bhante, antarākathā vippakatā. Atha bhagavā anuppatto’’ti.",
      "english": "The Blessed One heard, with the divine ear-element, purified and surpassing that of humans, this conversation of those monks. Then the Blessed One, having risen from his seat, approached the Kāreri-maṇḍala hall; having approached, he sat down on the prepared seat. Having sat down, the Blessed One addressed the monks: \"Monks, what is the topic of your present conversation, sitting here? And what was the discussion that was interrupted among you?\"\n\nWhen this was said, those monks replied to the Blessed One: \"Here, Venerable Sir, for us, after our meal and return from alms-round, sitting together, assembled in the Kāreri-maṇḍala hall, a discussion arose concerning the Dhamma, connected with past existences, saying: 'This too is a past existence, this too is a past existence.' This, Venerable Sir, was our interrupted discussion. Then the Blessed One arrived.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ පිරිසිදු වූ, මිනිසුන්ගේ (ශ්‍රවණයට) ඉක්මවා ගිය දිව්‍යමය ශ්‍රවණ ධාතුවෙන් ඒ භික්ෂූන්ගේ මේ කථාව ඇසූ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආසනයෙන් නැගිට කරේරිමණ්ඩල මාලකය වෙත එළඹි සේක. එළඹ, පනවන ලද ආසනයෙහි වැඩහුන් සේක. වැඩහිඳ, භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: \"මහණෙනි, දැන් නුඹලා කවර කථාවකින් එක්ව හිඳීද? නුඹලාගේ අතරමැද අත්හැර දැමුණු කථාව කුමක්ද?\" මෙසේ කී කල්හි, ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: \"ස්වාමීනි, මෙහි අප දානය වැළඳීමෙන් පසු, පිණ්ඩපාතය ගෙන ආපසු පැමිණ, කරේරිමණ්ඩල මාලකයෙහි එක්ව හිඳගෙන සිටියදී, රැස්ව සිටියදී, 'මෙයද පෙර විසූ කඳපිළිවෙලකි, මෙයද පෙර විසූ කඳපිළිවෙලකි' කියා, පෙර විසූ කඳපිළිවෙල හා සම්බන්ධ ධර්ම කථාවක් ඇතිවිය. ස්වාමීනි, මෙය අපගේ අතරමැද අත්හැර දැමුණු කථාවයි. ඉක්බිති භාග්‍යවතුන් වහන්සේ (එහි) පැමිණි සේක.\"",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Iccheyyātha no tumhe, bhikkhave, pubbenivāsapaṭisaṃyuttaṃ dhammiṃ kathaṃ sotu’’nti? ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo; yaṃ bhagavā pubbenivāsapaṭisaṃyuttaṃ dhammiṃ kathaṃ kareyya, bhagavato sutvā [bhagavato vacanaṃ sutvā (syā.)] bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha,sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –",
      "english": "\"Monks, would you like to hear a Dhamma talk connected with past lives?\"\n\n\"Blessed One, now is the opportune time, Fortunate One, to deliver a Dhamma talk connected with past lives. Having heard it from you, the monks will remember it.\"\n\n\"Then listen carefully, monks, and pay close attention. I will speak.\"\n\n\"Yes, venerable sir,\" those monks responded to the Blessed One. The Blessed One then said this:",
      "sinhala": "‘‘මහණෙනි, ඔබ පෙර විසූ ජීවිත සම්බන්ධ ධර්ම කථාවක් ඇසීමට කැමතිද?’’\n‘‘භාග්‍යවතුන් වහන්ස, එයට මෙය සුදුසු කාලයයි. සුගතයන් වහන්ස, එයට මෙය සුදුසු කාලයයි. භාග්‍යවතුන් වහන්සේ පෙර විසූ ජීවිත සම්බන්ධ ධර්ම කථාවක් දේශනා කරන සේක්වා! භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේගෙන් අසා එය සිත්හි ධාරණය කරගනු ඇත.’’\n‘‘එසේ නම් මහණෙනි, අසන්න. හොඳින් සිතට ගන්න. මම දේශනා කරන්නෙමි.’’\n‘‘එසේය ස්වාමීනී,’’ යි එම භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක –",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Ito so, bhikkhave, ekanavutikappe yaṃ [ekanavuto kappo (syā. kaṃ. pī.)] vipassī bhagavā arahaṃ sammāsambuddho loke udapādi. Ito so, bhikkhave, ekatiṃse kappe [ekatiṃ sakappo (sī.) ekatiṃ so kappo (syā. kaṃ. pī.)] yaṃ sikhī bhagavā arahaṃ sammāsambuddho loke udapādi. Tasmiññeva kho, bhikkhave, ekatiṃse kappe vessabhū bhagavā arahaṃ sammāsambuddho loke udapādi. Imasmiññeva [imasmiṃ (katthacī)] kho, bhikkhave, bhaddakappe kakusandho bhagavā arahaṃ sammāsambuddho loke udapādi. Imasmiññeva kho, bhikkhave, bhaddakappe koṇāgamano bhagavā arahaṃ sammāsambuddho loke udapādi. Imasmiññeva kho, bhikkhave, bhaddakappe kassapo bhagavā arahaṃ sammāsambuddho loke udapādi. Imasmiññeva kho, bhikkhave, bhaddakappe ahaṃ etarahi arahaṃ sammāsambuddho loke uppanno.",
      "english": "Monks, it was ninety-one eons ago that the Blessed One Vipassī, the Arahant, the Perfectly Self-Awakened One, arose in the world. Monks, it was thirty-one eons ago that the Blessed One Sikhī, the Arahant, the Perfectly Self-Awakened One, arose in the world. Monks, in that very same thirty-first eon, the Blessed One Vessabhū, the Arahant, the Perfectly Self-Awakened One, arose in the world. Monks, in this very same auspicious eon, the Blessed One Kakusandha, the Arahant, the Perfectly Self-Awakened One, arose in the world. Monks, in this very same auspicious eon, the Blessed One Koṇāgamana, the Arahant, the Perfectly Self-Awakened One, arose in the world. Monks, in this very same auspicious eon, the Blessed One Kassapa, the Arahant, the Perfectly Self-Awakened One, arose in the world. Monks, in this very same auspicious eon, I myself, as the Arahant, the Perfectly Self-Awakened One, have now appeared in the world.",
      "sinhala": "මහණෙනි, මෙයින් අනූඑක් කල්පයකට පෙර විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. මහණෙනි, මෙයින් තිස්එක් කල්පයකට පෙර සිඛී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. මහණෙනි, ඒ තිස්එක් වන කල්පයේදීම වෙස්සභූ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. මහණෙනි, මේ භද්‍ර කල්පයේ කකුසන්ධ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. මහණෙනි, මේ භද්‍ර කල්පයේ කෝණාගමන භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. මහණෙනි, මේ භද්‍ර කල්පයේ කාශ්‍යප භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. මහණෙනි, මේ භද්‍ර කල්පයේ මම දැන් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලෙස ලොව පහළ වී සිටිමි.",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Vipassī, bhikkhave, bhagavā arahaṃ sammāsambuddho khattiyo jātiyā ahosi, khattiyakule udapādi. Sikhī, bhikkhave, bhagavā arahaṃ sammāsambuddho khattiyo jātiyā ahosi, khattiyakule udapādi. Vessabhū, bhikkhave, bhagavā arahaṃ sammāsambuddho khattiyo jātiyā ahosi, khattiyakule udapādi. Kakusandho, bhikkhave, bhagavā arahaṃ sammāsambuddho brāhmaṇo jātiyā ahosi, brāhmaṇakule udapādi. Koṇāgamano, bhikkhave, bhagavā arahaṃ sammāsambuddho brāhmaṇo jātiyā ahosi, brāhmaṇakule udapādi. Kassapo, bhikkhave, bhagavā arahaṃ sammāsambuddho brāhmaṇo jātiyā ahosi, brāhmaṇakule udapādi. Ahaṃ, bhikkhave, etarahi arahaṃ sammāsambuddho khattiyo jātiyā ahosiṃ, khattiyakule uppanno.",
      "english": "Monks, the Blessed One Vipassī, the Arahant, the Perfectly Enlightened Buddha, was born a kshatriya, into a kshatriya family. Monks, the Blessed One Sikhī, the Arahant, the Perfectly Enlightened Buddha, was born a kshatriya, into a kshatriya family. Monks, the Blessed One Vessabhū, the Arahant, the Perfectly Enlightened Buddha, was born a kshatriya, into a kshatriya family. Monks, the Blessed One Kakusandha, the Arahant, the Perfectly Enlightened Buddha, was born a brahmin, into a brahmin family. Monks, the Blessed One Koṇāgamana, the Arahant, the Perfectly Enlightened Buddha, was born a brahmin, into a brahmin family. Monks, the Blessed One Kassapa, the Arahant, the Perfectly Enlightened Buddha, was born a brahmin, into a brahmin family. Monks, I now, the Arahant, the Perfectly Enlightened Buddha, was born a kshatriya, into a kshatriya family.",
      "sinhala": "මහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ක්ෂත්‍රිය කුලයක උපත ලද ක්ෂත්‍රිය වංශිකයෙක් වූ සේක. මහණෙනි, සිඛී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ක්ෂත්‍රිය කුලයක උපත ලද ක්ෂත්‍රිය වංශිකයෙක් වූ සේක. මහණෙනි, වෙස්සභූ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ක්ෂත්‍රිය කුලයක උපත ලද ක්ෂත්‍රිය වංශිකයෙක් වූ සේක. මහණෙනි, කකුසඳ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ බ්‍රාහ්මණ කුලයක උපත ලද බ්‍රාහ්මණ වංශිකයෙක් වූ සේක. මහණෙනි, කෝණාගමන භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ බ්‍රාහ්මණ කුලයක උපත ලද බ්‍රාහ්මණ වංශිකයෙක් වූ සේක. මහණෙනි, කාශ්‍යප භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ බ්‍රාහ්මණ කුලයක උපත ලද බ්‍රාහ්මණ වංශිකයෙක් වූ සේක. මහණෙනි, දැන් අරහත් සම්මා සම්බුදු වූ මම ක්ෂත්‍රිය කුලයක උපත ලද ක්ෂත්‍රිය වංශිකයෙක් වීමි.",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Vipassī, bhikkhave, bhagavā arahaṃ sammāsambuddho koṇḍañño gottena ahosi. Sikhī, bhikkhave, bhagavā arahaṃ sammāsambuddho koṇḍañño gottena ahosi. Vessabhū, bhikkhave, bhagavā arahaṃ sammāsambuddho koṇḍañño gottena ahosi. Kakusandho, bhikkhave, bhagavā arahaṃ sammāsambuddho kassapo gottena ahosi. Koṇāgamano, bhikkhave, bhagavā arahaṃ sammāsambuddho kassapo gottena ahosi. Kassapo, bhikkhave, bhagavā arahaṃ sammāsambuddho kassapo gottena ahosi. Ahaṃ, bhikkhave, etarahi arahaṃ sammāsambuddho gotamo gottena ahosiṃ.",
      "english": "Monks, the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, was of the Koṇḍañña clan. Monks, the Blessed One Sikhī, the Arahant, the Perfectly Enlightened One, was of the Koṇḍañña clan. Monks, the Blessed One Vessabhū, the Arahant, the Perfectly Enlightened One, was of the Koṇḍañña clan. Monks, the Blessed One Kakusandha, the Arahant, the Perfectly Enlightened One, was of the Kassapa clan. Monks, the Blessed One Koṇāgamana, the Arahant, the Perfectly Enlightened One, was of the Kassapa clan. Monks, the Blessed One Kassapa, the Arahant, the Perfectly Enlightened One, was of the Kassapa clan. And I, monks, am now the Arahant, the Perfectly Enlightened One, of the Gotama clan.",
      "sinhala": "භික්ෂූනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කෝණ්ඩඤ්ඤ ගෝත්‍රයෙහි වූ සේක. භික්ෂූනි, සිඛී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කෝණ්ඩඤ්ඤ ගෝත්‍රයෙහි වූ සේක. භික්ෂූනි, වෙස්සභූ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කෝණ්ඩඤ්ඤ ගෝත්‍රයෙහි වූ සේක. භික්ෂූනි, කකුසන්ධ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කාශ්‍යප ගෝත්‍රයෙහි වූ සේක. භික්ෂූනි, කෝණාගමන භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කාශ්‍යප ගෝත්‍රයෙහි වූ සේක. භික්ෂූනි, කාශ්‍යප භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කාශ්‍යප ගෝත්‍රයෙහි වූ සේක. භික්ෂූනි, මම මේ වන විට අරහත් සම්මා සම්බුදු වූ ගෞතම ගෝත්‍රයෙහි වූවෙමි.",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa asītivassasahassāni āyuppamāṇaṃ ahosi. Sikhissa, bhikkhave, bhagavato arahato sammāsambuddhassa sattativassasahassāni āyuppamāṇaṃ ahosi. Vessabhussa, bhikkhave, bhagavato arahato sammāsambuddhassa saṭṭhivassasahassāni āyuppamāṇaṃ ahosi. Kakusandhassa, bhikkhave, bhagavato arahato sammāsambuddhassa cattālīsavassasahassāni āyuppamāṇaṃ ahosi. Koṇāgamanassa, bhikkhave, bhagavato arahato sammāsambuddhassa tiṃsavassasahassāni āyuppamāṇaṃ ahosi. Kassapassa, bhikkhave, bhagavato arahato sammāsambuddhassa vīsativassasahassāni āyuppamāṇaṃ ahosi. Mayhaṃ, bhikkhave, etarahi appakaṃ āyuppamāṇaṃ parittaṃ lahukaṃ; yo ciraṃ jīvati, so vassasataṃ appaṃ vā bhiyyo.",
      "english": "Monks, the lifespan of Vipassi, the Blessed One, the Arahant, the Fully Awakened One, was eighty thousand years. Monks, the lifespan of Sikhi, the Blessed One, the Arahant, the Fully Awakened One, was seventy thousand years. Monks, the lifespan of Vessabhu, the Blessed One, the Arahant, the Fully Awakened One, was sixty thousand years. Monks, the lifespan of Kakusandha, the Blessed One, the Arahant, the Fully Awakened One, was forty thousand years. Monks, the lifespan of Koṇāgamana, the Blessed One, the Arahant, the Fully Awakened One, was thirty thousand years. Monks, the lifespan of Kassapa, the Blessed One, the Arahant, the Fully Awakened One, was twenty thousand years. Monks, my lifespan at present is short, little, and swift; whoever lives long, lives a hundred years, or a little more.",
      "sinhala": "මහණෙනි, භාග්‍යවත් අරහත් සම්මා සම්බුද්ධ විපස්සීගේ ආයුෂ ප්‍රමාණය අවුරුදු අසූ දහසක් විය. මහණෙනි, භාග්‍යවත් අරහත් සම්මා සම්බුද්ධ සිඛීගේ ආයුෂ ප්‍රමාණය අවුරුදු සැත්තෑ දහසක් විය. මහණෙනි, භාග්‍යවත් අරහත් සම්මා සම්බුද්ධ වෙස්සභූගේ ආයුෂ ප්‍රමාණය අවුරුදු සැට දහසක් විය. මහණෙනි, භාග්‍යවත් අරහත් සම්මා සම්බුද්ධ කකුසඳගේ ආයුෂ ප්‍රමාණය අවුරුදු හතළිස් දහසක් විය. මහණෙනි, භාග්‍යවත් අරහත් සම්මා සම්බුද්ධ කෝණාගමනගේ ආයුෂ ප්‍රමාණය අවුරුදු තිස් දහසක් විය. මහණෙනි, භාග්‍යවත් අරහත් සම්මා සම්බුද්ධ කස්සපගේ ආයුෂ ප්‍රමාණය අවුරුදු විසි දහසක් විය. මහණෙනි, දැනට මාගේ ආයුෂ ප්‍රමාණය ඉතා ස්වල්පය, කෙටිය, සුළුය. යමෙක් බොහෝ කල් ජීවත් වේ නම්, ඔහු වසර සියයක් හෝ ඊට ටිකක් වැඩියෙන් ජීවත් වේ.",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Vipassī, bhikkhave, bhagavā arahaṃ sammāsambuddho pāṭaliyā mūle abhisambuddho. Sikhī, bhikkhave, bhagavā arahaṃ sammāsambuddho puṇḍarīkassa mūle abhisambuddho. Vessabhū, bhikkhave, bhagavā arahaṃ sammāsambuddho sālassa mūle abhisambuddho. Kakusandho, bhikkhave, bhagavā arahaṃ sammāsambuddho sirīsassa mūle abhisambuddho. Koṇāgamano, bhikkhave, bhagavā arahaṃ sammāsambuddho udumbarassa mūle abhisambuddho. Kassapo, bhikkhave, bhagavā arahaṃ sammāsambuddho nigrodhassa mūle abhisambuddho. Ahaṃ, bhikkhave, etarahi arahaṃ sammāsambuddho assatthassa mūle abhisambuddho.",
      "english": "Monks, the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, attained full enlightenment at the foot of a pāṭali tree. Monks, the Blessed One Sikhī, the Arahant, the Perfectly Enlightened One, attained full enlightenment at the foot of a white lotus tree. Monks, the Blessed One Vessabhū, the Arahant, the Perfectly Enlightened One, attained full enlightenment at the foot of a sal tree. Monks, the Blessed One Kakusandha, the Arahant, the Perfectly Enlightened One, attained full enlightenment at the foot of a sirisa tree. Monks, the Blessed One Koṇāgamana, the Arahant, the Perfectly Enlightened One, attained full enlightenment at the foot of an udumbara tree. Monks, the Blessed One Kassapa, the Arahant, the Perfectly Enlightened One, attained full enlightenment at the foot of a banyan tree. I, monks, the Arahant, the Perfectly Enlightened One, have now attained full enlightenment at the foot of an assattha tree.",
      "sinhala": "භික්ෂූනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ පාටලී වෘක්ෂය මුල අභිසම්බුද්ධ වූ සේක. භික්ෂූනි, සිඛී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ පුණ්ඩරීක වෘක්ෂය මුල අභිසම්බුද්ධ වූ සේක. භික්ෂූනි, වෙස්සභූ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ සල් වෘක්ෂය මුල අභිසම්බුද්ධ වූ සේක. භික්ෂූනි, කකුසන්ධ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ සිරිස්ස වෘක්ෂය මුල අභිසම්බුද්ධ වූ සේක. භික්ෂූනි, කෝණාගමන භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ උදුම්බර වෘක්ෂය මුල අභිසම්බුද්ධ වූ සේක. භික්ෂූනි, කාශ්යප භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ නුග වෘක්ෂය මුල අභිසම්බුද්ධ වූ සේක. භික්ෂූනි, වර්තමානයේ අරහත් සම්මා සම්බුද්ධ වූ මම ඇසතු වෘක්ෂය මුල අභිසම්බුද්ධ වූයෙමි.",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa khaṇḍatissaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Sikhissa, bhikkhave, bhagavato arahato sammāsambuddhassa abhibhūsambhavaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Vessabhussa, bhikkhave, bhagavato arahato sammāsambuddhassa soṇuttaraṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Kakusandhassa, bhikkhave, bhagavato arahato sammāsambuddhassa vidhurasañjīvaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Koṇāgamanassa, bhikkhave, bhagavato arahato sammāsambuddhassa bhiyyosuttaraṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Kassapassa, bhikkhave, bhagavato arahato sammāsambuddhassa tissabhāradvājaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Mayhaṃ, bhikkhave, etarahi sāriputtamoggallānaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ.",
      "english": "Monks, for the Blessed One Vipassī, the Arahant, the Perfectly Enlightened Buddha, the foremost excellent pair of disciples was named Khaṇḍa and Tissa. Monks, for the Blessed One Sikhī, the Arahant, the Perfectly Enlightened Buddha, the foremost excellent pair of disciples was named Abhibhū and Sambhava. Monks, for the Blessed One Vessabhū, the Arahant, the Perfectly Enlightened Buddha, the foremost excellent pair of disciples was named Soṇa and Uttara. Monks, for the Blessed One Kakusandha, the Arahant, the Perfectly Enlightened Buddha, the foremost excellent pair of disciples was named Vidhura and Sañjīva. Monks, for the Blessed One Koṇāgamana, the Arahant, the Perfectly Enlightened Buddha, the foremost excellent pair of disciples was named Bhiyyosa and Uttara. Monks, for the Blessed One Kassapa, the Arahant, the Perfectly Enlightened Buddha, the foremost excellent pair of disciples was named Tissa and Bhāradvāja. Monks, for me at present, the foremost excellent pair of disciples was named Sāriputta and Moggallāna.",
      "sinhala": "මහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට ඛණ්ඩ හා තිස්ස නම් වූ අග්‍ර හා උතුම් ශ්‍රාවක යුගලයක් විය. මහණෙනි, සිඛී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට අභිභූ හා සම්භව නම් වූ අග්‍ර හා උතුම් ශ්‍රාවක යුගලයක් විය. මහණෙනි, වෙස්සභූ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට සෝණ හා උත්තර නම් වූ අග්‍ර හා උතුම් ශ්‍රාවක යුගලයක් විය. මහණෙනි, කකුසඳ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට විධුර හා සංජීව නම් වූ අග්‍ර හා උතුම් ශ්‍රාවක යුගලයක් විය. මහණෙනි, කෝණාගමන භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට භිය්යෝස හා උත්තර නම් වූ අග්‍ර හා උතුම් ශ්‍රාවක යුගලයක් විය. මහණෙනි, කස්සප භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට තිස්ස හා භාරද්වාජ නම් වූ අග්‍ර හා උතුම් ශ්‍රාවක යුගලයක් විය. මහණෙනි, දැන් මා හට සාරිපුත්ත හා මොග්ගල්ලාන නම් වූ අග්‍ර හා උතුම් ශ්‍රාවක යුගලයක් විය.",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa tayo sāvakānaṃ sannipātā ahesuṃ. Eko sāvakānaṃ sannipāto ahosi aṭṭhasaṭṭhibhikkhusatasahassaṃ, eko sāvakānaṃ sannipāto ahosi bhikkhusatasahassaṃ, eko sāvakānaṃ sannipāto ahosi asītibhikkhusahassāni. Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa ime tayo sāvakānaṃ sannipātā ahesuṃ sabbesaṃyeva khīṇāsavānaṃ. ‘‘Sikhissa, bhikkhave, bhagavato arahato sammāsambuddhassa tayo sāvakānaṃ sannipātā ahesuṃ. Eko sāvakānaṃ sannipāto ahosi bhikkhusatasahassaṃ, eko sāvakānaṃ sannipāto ahosi asītibhikkhusahassāni, eko sāvakānaṃ sannipāto ahosi sattatibhikkhusahassāni. Sikhissa, bhikkhave, bhagavato arahato sammāsambuddhassa ime tayo sāvakānaṃ sannipātā ahesuṃ sabbesaṃyeva khīṇāsavānaṃ. ‘‘Vessabhussa, bhikkhave, bhagavato arahato sammāsambuddhassa tayo sāvakānaṃ sannipātā ahesuṃ. Eko sāvakānaṃ sannipāto ahosi asītibhikkhusahassāni, eko sāvakānaṃ sannipāto ahosi sattatibhikkhusahassāni, eko sāvakānaṃ sannipāto ahosi saṭṭhibhikkhusahassāni. Vessabhussa, bhikkhave, bhagavato arahato sammāsambuddhassa ime tayo sāvakānaṃ sannipātā ahesuṃ sabbesaṃyeva khīṇāsavānaṃ. ‘‘Kakusandhassa, bhikkhave, bhagavato arahato sammāsambuddhassa eko sāvakānaṃ sannipāto ahosi cattālīsabhikkhusahassāni. Kakusandhassa, bhikkhave, bhagavato arahato sammāsambuddhassa ayaṃ eko sāvakānaṃ sannipāto ahosi sabbesaṃyeva khīṇāsavānaṃ. ‘‘Koṇāgamanassa, bhikkhave, bhagavato arahato sammāsambuddhassa eko sāvakānaṃ sannipāto ahosi tiṃsabhikkhusahassāni. Koṇāgamanassa, bhikkhave, bhagavato arahato sammāsambuddhassa ayaṃ eko sāvakānaṃ sannipāto ahosi sabbesaṃyeva khīṇāsavānaṃ. ‘‘Kassapassa, bhikkhave, bhagavato arahato sammāsambuddhassa eko sāvakānaṃ sannipāto ahosi vīsatibhikkhusahassāni. Kassapassa, bhikkhave, bhagavato arahato sammāsambuddhassa ayaṃ eko sāvakānaṃ sannipāto ahosi sabbesaṃyeva khīṇāsavānaṃ. ‘‘Mayhaṃ, bhikkhave, etarahi eko sāvakānaṃ sannipāto ahosi aḍḍhateḷasāni bhikkhusatāni. Mayhaṃ, bhikkhave, ayaṃ eko sāvakānaṃ sannipāto ahosi sabbesaṃyeva khīṇāsavānaṃ.",
      "english": "Monks, the Blessed One, the Arahant, the Perfectly Enlightened Vipassī, had three gatherings of disciples. One gathering of disciples consisted of six million, eight hundred thousand monks, one gathering consisted of one hundred thousand monks, and one gathering consisted of eighty thousand monks. These three gatherings of disciples of the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, all consisted entirely of monks whose defilements were extinguished.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened Sikhī, had three gatherings of disciples. One gathering consisted of one hundred thousand monks, one gathering consisted of eighty thousand monks, and one gathering consisted of seventy thousand monks. These three gatherings of disciples of the Blessed One Sikhī, the Arahant, the Perfectly Enlightened One, all consisted entirely of monks whose defilements were extinguished.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened Vessabhū, had three gatherings of disciples. One gathering consisted of eighty thousand monks, one gathering consisted of seventy thousand monks, and one gathering consisted of sixty thousand monks. These three gatherings of disciples of the Blessed One Vessabhū, the Arahant, the Perfectly Enlightened One, all consisted entirely of monks whose defilements were extinguished.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened Kakusandha, had one gathering of disciples, consisting of forty thousand monks. This one gathering of disciples of the Blessed One Kakusandha, the Arahant, the Perfectly Enlightened One, consisted entirely of monks whose defilements were extinguished.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened Koṇāgamana, had one gathering of disciples, consisting of thirty thousand monks. This one gathering of disciples of the Blessed One Koṇāgamana, the Arahant, the Perfectly Enlightened One, consisted entirely of monks whose defilements were extinguished.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened Kassapa, had one gathering of disciples, consisting of twenty thousand monks. This one gathering of disciples of the Blessed One Kassapa, the Arahant, the Perfectly Enlightened One, consisted entirely of monks whose defilements were extinguished.\n\nMonks, at present, I have one gathering of disciples, consisting of twelve hundred and fifty monks. This one gathering of my disciples consists entirely of monks whose defilements were extinguished.",
      "sinhala": "භික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ විපස්සී බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සන්නිපාත තුනක් විය. එක් ශ්‍රාවක සන්නිපාතයක් හැට අට ලක්ෂයක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක සන්නිපාතයක් ලක්ෂයක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක සන්නිපාතයක් අසූ දහසක් භික්ෂූන්ගෙන් සමන්විත විය. භික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ විපස්සී බුදුරජාණන් වහන්සේගේ මෙම ශ්‍රාවක සන්නිපාත තුනම ක්ෂීණාශ්‍රවයන්ගෙන් සමන්විත විය.\n\nභික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ සිඛී බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සන්නිපාත තුනක් විය. එක් ශ්‍රාවක සන්නිපාතයක් ලක්ෂයක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක සන්නිපාතයක් අසූ දහසක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක සන්නිපාතයක් හැත්තෑ දහසක් භික්ෂූන්ගෙන් සමන්විත විය. භික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ සිඛී බුදුරජාණන් වහන්සේගේ මෙම ශ්‍රාවක සන්නිපාත තුනම ක්ෂීණාශ්‍රවයන්ගෙන් සමන්විත විය.\n\nභික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ වෙස්සභූ බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සන්නිපාත තුනක් විය. එක් ශ්‍රාවක සන්නිපාතයක් අසූ දහසක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක සන්නිපාතයක් හැත්තෑ දහසක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක සන්නිපාතයක් සැට දහසක් භික්ෂූන්ගෙන් සමන්විත විය. භික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ වෙස්සභූ බුදුරජාණන් වහන්සේගේ මෙම ශ්‍රාවක සන්නිපාත තුනම ක්ෂීණාශ්‍රවයන්ගෙන් සමන්විත විය.\n\nභික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ කකුසඳ බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සන්නිපාතයක් විය. එය හතළිස් දහසක් භික්ෂූන්ගෙන් සමන්විත විය. භික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ කකුසඳ බුදුරජාණන් වහන්සේගේ මෙම ශ්‍රාවක සන්නිපාතය ක්ෂීණාශ්‍රවයන්ගෙන් සමන්විත විය.\n\nභික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ කෝණාගමන බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සන්නිපාතයක් විය. එය තිස් දහසක් භික්ෂූන්ගෙන් සමන්විත විය. භික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ කෝණාගමන බුදුරජාණන් වහන්සේගේ මෙම ශ්‍රාවක සන්නිපාතය ක්ෂීණාශ්‍රවයන්ගෙන් සමන්විත විය.\n\nභික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ කාශ්‍යප බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සන්නිපාතයක් විය. එය විසි දහසක් භික්ෂූන්ගෙන් සමන්විත විය. භික්ෂූනි, අරහත් සම්මා සම්බුද්ධ භාග්‍යවත් වූ කාශ්‍යප බුදුරජාණන් වහන්සේගේ මෙම ශ්‍රාවක සන්නිපාතය ක්ෂීණාශ්‍රවයන්ගෙන් සමන්විත විය.\n\nභික්ෂූනි, දැන් මට ශ්‍රාවක සන්නිපාතයක් විය. එය එක්දහස් දෙසිය පනහක් භික්ෂූන්ගෙන් සමන්විත විය. භික්ෂූනි, මගේ මෙම ශ්‍රාවක සන්නිපාතය ක්ෂීණාශ්‍රවයන්ගෙන් සමන්විත විය.",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "‘‘Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa asoko nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Sikhissa, bhikkhave, bhagavato arahato sammāsambuddhassa khemaṅkaro nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Vessabhussa, bhikkhave, bhagavato arahato sammāsambuddhassa upasanto nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Kakusandhassa, bhikkhave, bhagavato arahato sammāsambuddhassa buddhijo nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Koṇāgamanassa, bhikkhave, bhagavato arahato sammāsambuddhassa sotthijo nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Kassapassa, bhikkhave, bhagavato arahato sammāsambuddhassa sabbamitto nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Mayhaṃ, bhikkhave, etarahi ānando nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko.",
      "english": "Monks, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Vipassi had a monk named Asoka as his attendant, his foremost attendant. Monks, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhi had a monk named Khemaṅkara as his attendant, his foremost attendant. Monks, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Vessabhu had a monk named Upasanta as his attendant, his foremost attendant. Monks, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Kakusandha had a monk named Buddhijo as his attendant, his foremost attendant. Monks, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Konagamana had a monk named Sotthijo as his attendant, his foremost attendant. Monks, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Kassapa had a monk named Sabbamitta as his attendant, his foremost attendant. Monks, at present, I have the monk Ananda as my attendant, my foremost attendant.",
      "sinhala": "මහණෙනි, අරහත් සම්මා සම්බුද්ධ විපස්සී භාග්‍යවතුන් වහන්සේගේ උපස්ථායක වූයේත්, අග්‍ර උපස්ථායක වූයේත් අසෝක නම් භික්ෂුවයි. මහණෙනි, අරහත් සම්මා සම්බුද්ධ සිඛී භාග්‍යවතුන් වහන්සේගේ උපස්ථායක වූයේත්, අග්‍ර උපස්ථායක වූයේත් ඛේමංකර නම් භික්ෂුවයි. මහණෙනි, අරහත් සම්මා සම්බුද්ධ වෙස්සභූ භාග්‍යවතුන් වහන්සේගේ උපස්ථායක වූයේත්, අග්‍ර උපස්ථායක වූයේත් උපශාන්ත නම් භික්ෂුවයි. මහණෙනි, අරහත් සම්මා සම්බුද්ධ කකුසඳ භාග්‍යවතුන් වහන්සේගේ උපස්ථායක වූයේත්, අග්‍ර උපස්ථායක වූයේත් බුද්ධිජ නම් භික්ෂුවයි. මහණෙනි, අරහත් සම්මා සම්බුද්ධ කෝණාගමන භාග්‍යවතුන් වහන්සේගේ උපස්ථායක වූයේත්, අග්‍ර උපස්ථායක වූයේත් සොත්ථිජ නම් භික්ෂුවයි. මහණෙනි, අරහත් සම්මා සම්බුද්ධ කස්සප භාග්‍යවතුන් වහන්සේගේ උපස්ථායක වූයේත්, අග්‍ර උපස්ථායක වූයේත් සබ්බමිත්ත නම් භික්ෂුවයි. මහණෙනි, දැනට මාගේ උපස්ථායක වූයේත්, අග්‍ර උපස්ථායක වූයේත් ආනන්ද නම් භික්ෂුවයි.",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "‘‘Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa bandhumā nāma rājā pitā ahosi. Bandhumatī nāma devī mātā ahosi janetti [janettī (syā.)]. Bandhumassa rañño bandhumatī nāma nagaraṃ rājadhānī ahosi. ‘‘Sikhissa, bhikkhave, bhagavato arahato sammāsambuddhassa aruṇo nāma rājā pitā ahosi. Pabhāvatī nāma devī mātā ahosi janetti. Aruṇassa rañño aruṇavatī nāma nagaraṃ rājadhānī ahosi. ‘‘Vessabhussa, bhikkhave, bhagavato arahato sammāsambuddhassa suppatito nāma [suppatīto nāma (syā.)] rājā pitā ahosi. Vassavatī nāma [yasavatī nāma (syā. pī.)] devī mātā ahosi janetti. Suppatitassa rañño anomaṃ nāma nagaraṃ rājadhānī ahosi. ‘‘Kakusandhassa, bhikkhave, bhagavato arahato sammāsambuddhassa aggidatto nāma brāhmaṇo pitā ahosi. Visākhā nāma brāhmaṇī mātā ahosi janetti. Tena kho pana, bhikkhave, samayena khemo nāma rājā ahosi. Khemassa rañño khemavatī nāma nagaraṃ rājadhānī ahosi. ‘‘Koṇāgamanassa, bhikkhave, bhagavato arahato sammāsambuddhassa yaññadatto nāma brāhmaṇo pitā ahosi. Uttarā nāma brāhmaṇī mātā ahosi janetti. Tena kho pana, bhikkhave, samayena sobho nāma rājā ahosi. Sobhassa rañño sobhavatī nāma nagaraṃ rājadhānī ahosi. ‘‘Kassapassa, bhikkhave, bhagavato arahato sammāsambuddhassa brahmadatto nāma brāhmaṇo pitā ahosi. Dhanavatī nāma brāhmaṇī mātā ahosi janetti. Tena kho pana, bhikkhave, samayena kikī nāma [kiṃ kī nāma (syā.)] rājā ahosi. Kikissa rañño bārāṇasī nāma nagaraṃ rājadhānī ahosi. ‘‘Mayhaṃ, bhikkhave, etarahi suddhodano nāma rājā pitā ahosi. Māyā nāma devī mātā ahosi janetti. Kapilavatthu nāma nagaraṃ rājadhānī ahosī’’ti. Idamavoca bhagavā, idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi.",
      "english": "Monks, the Blessed One, the Arahant, the Perfectly Enlightened One, Vipassī, had a father named King Bandhumā and a mother, the queen, named Bandhumatī, his birth-mother. The royal capital of King Bandhumā was named Bandhumatī.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened One, Sikhī, had a father named King Aruṇo and a mother, the queen, named Pabhāvatī, his birth-mother. The royal capital of King Aruṇo was named Aruṇavatī.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened One, Vessabhū, had a father named King Suppatito and a mother, the queen, named Vassavatī, his birth-mother. The royal capital of King Suppatito was named Anoma.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened One, Kakusandha, had a father named the brahmin Aggidatta and a mother named the brahmin woman Visākhā, his birth-mother. Furthermore, monks, at that time there was a king named Khemo, whose royal capital city was named Khemavatī.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened One, Koṇāgamana, had a father named the brahmin Yaññadatta and a mother named the brahmin woman Uttarā, his birth-mother. Furthermore, monks, at that time there was a king named Sobho, whose royal capital city was named Sobhavatī.\n\nMonks, the Blessed One, the Arahant, the Perfectly Enlightened One, Kassapa, had a father named the brahmin Brahmadatta and a mother named the brahmin woman Dhanavatī, his birth-mother. Furthermore, monks, at that time there was a king named Kikī, whose royal capital city was named Bārāṇasī.\n\nMonks, in the present era, my father was King Suddhodano, and my mother, the queen, was named Māyā, my birth-mother. The royal capital city was named Kapilavatthu.\n\nThis the Blessed One said. Having said this, the Fortunate One rose from his seat and entered his dwelling.",
      "sinhala": "මහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා බන්ධුමා නම් රජු විය. මව බන්ධුමතී නම් දේවිය විය. බන්ධුමා රජුගේ රාජධානිය බන්ධුමතී නම් නගරය විය.\n\nමහණෙනි, සිඛී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා අරුණ නම් රජු විය. මව ප්‍රභාවතී නම් දේවිය විය. අරුණ රජුගේ රාජධානිය අරුණවතී නම් නගරය විය.\n\nමහණෙනි, වෙස්සභූ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා සුප්‍රතීත නම් රජු විය. මව වස්සවතී නම් දේවිය විය. සුප්‍රතීත රජුගේ රාජධානිය අනෝම නම් නගරය විය.\n\nමහණෙනි, කකුසඳ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා අග්ගිදත්ත නම් බ්‍රාහ්මණයා විය. මව විශාඛා නම් බ්‍රාහ්මණිය විය. මහණෙනි, ඒ කාලයෙහි ඛේම නම් රජෙක් විය. ඛේම රජුගේ රාජධානිය ඛේමවතී නම් නගරය විය.\n\nමහණෙනි, කෝණාගමන භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා යඤ්ඤදත්ත නම් බ්‍රාහ්මණයා විය. මව උත්තරා නම් බ්‍රාහ්මණිය විය. මහණෙනි, ඒ කාලයෙහි සෝභ නම් රජෙක් විය. සෝභ රජුගේ රාජධානිය සෝභාවතී නම් නගරය විය.\n\nමහණෙනි, කාශ්‍යප භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා බ්‍රහ්මදත්ත නම් බ්‍රාහ්මණයා විය. මව ධනවතී නම් බ්‍රාහ්මණිය විය. මහණෙනි, ඒ කාලයෙහි කිකී නම් රජෙක් විය. කිකී රජුගේ රාජධානිය බරණැස නම් නගරය විය.\n\nමහණෙනි, මට මේ දැන් පියා ශුද්ධෝදන නම් රජු ය. මව මායා නම් දේවිය ය. රාජධානිය කපිලවස්තු නම් නගරය ය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගතයන් වහන්සේ මෙය වදාරා අසුනෙන් නැගිට විහාරයට පිවිසියේය.",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "Atha kho tesaṃ bhikkhūnaṃ acirapakkantassa bhagavato ayamantarākathā udapādi – ‘‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, tathāgatassa mahiddhikatā mahānubhāvatā. Yatra hi nāma tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarissati, nāmatopi anussarissati, gottatopi anussarissati, āyuppamāṇatopi anussarissati, sāvakayugatopi anussarissati, sāvakasannipātatopi anussarissati – ‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’’’ti. ‘‘Kiṃ nu kho, āvuso, tathāgatasseva nu kho esā dhammadhātu suppaṭividdhā, yassā dhammadhātuyā suppaṭividdhattā tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati – ‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’ti, udāhu devatā tathāgatassa etamatthaṃ ārocesuṃ, yena tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati – ‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’’’ti. Ayañca hidaṃ tesaṃ bhikkhūnaṃ antarākathā vippakatā hoti.",
      "english": "Then, not long after the Blessed One had left, this discussion arose among the monks: \"It's amazing, friends! It's astounding, friends! Such is the great power and might of the Tathagata! He remembers past Buddhas who have attained final Nibbana, who have cut off proliferation, severed the cycle, exhausted the round, and overcome all suffering. He remembers their birth, their names, their clans, their lifespans, their chief disciples in pairs, and their assemblies of disciples, saying: 'Those Blessed Ones were of such a birth, such a name, such a clan, such virtue, such teaching, such wisdom, such a way of life, and such liberation.'\"\n\n\"What do you think, friends? Is it that the Tathagata himself has thoroughly understood the Dhamma element? And because of his thorough understanding of that Dhamma element, he remembers past Buddhas who have attained final Nibbana, who have cut off proliferation, severed the cycle, exhausted the round, and overcome all suffering, remembering their birth, their names, their clans, their lifespans, their chief disciples in pairs, and their assemblies of disciples, saying: 'Those Blessed Ones were of such a birth, such a name, such a clan, such virtue, such teaching, such wisdom, such a way of life, and such liberation'? Or did deities inform the Tathagata of this, so that he remembers past Buddhas who have attained final Nibbana, who have cut off proliferation, severed the cycle, exhausted the round, and overcome all suffering, remembering their birth, their names, their clans, their lifespans, their chief disciples in pairs, and their assemblies of disciples, saying: 'Those Blessed Ones were of such a birth, such a name, such a clan, such virtue, such teaching, such wisdom, such a way of life, and such liberation'?\" And this discussion among the monks remained unresolved.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ වැඩම කර වැඩි වේලාවක් ඉක්මවීමට පෙර, ඒ භික්ෂූන් අතර මෙවැනි කථාවක් ඇති විය: “ආයුෂ්මතුනි, මෙය පුදුම සහගතයි! ආයුෂ්මතුනි, මෙය අද්භූතයි! තථාගතයන් වහන්සේගේ මහත් ඍද්ධිය හා අනුභාවය කෙතරම්ද යත්, උන්වහන්සේ අතීතයේ පිරිනිවන් පෑ, ප්‍රපංචයන් දුරු කළ, සංසාර චක්‍රය බිඳ දැමූ, කෙළවර කළ, සියලු දුකින් මිදුණු බුදුවරුන්ගේ ජාතිය, නාමය, ගෝත්‍රය, ආයුෂ ප්‍රමාණය, ප්‍රධාන ශ්‍රාවක යුගලය සහ ශ්‍රාවක සමූහය පවා සිහිපත් කරන සේක. ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි ජාතියක් ඇත්තෝ වූහ, මෙවැනි නමක් ඇත්තෝ වූහ, මෙවැනි ගෝත්‍රයක් ඇත්තෝ වූහ, මෙවැනි සීලයක් ඇත්තෝ වූහ, මෙවැනි ධර්මයක් ඇත්තෝ වූහ, මෙවැනි ප්‍රඥාවක් ඇත්තෝ වූහ, මෙවැනි විහරණයක් ඇත්තෝ වූහ, මෙවැනි විමුක්තියක් ඇත්තෝ වූහ’ යනුවෙනි.”\n\n“ආයුෂ්මතුනි, තථාගතයන් වහන්සේටම මෙම ධර්ම ධාතුව මනාව වැටහී ඇති නිසාද, එසේ නැතහොත් දෙවියන් විසින් උන්වහන්සේට මේ කරුණ දැන්වූ නිසාද, තථාගතයන් වහන්සේ අතීතයේ පිරිනිවන් පෑ, ප්‍රපංචයන් දුරු කළ, සංසාර චක්‍රය බිඳ දැමූ, කෙළවර කළ, සියලු දුකින් මිදුණු බුදුවරුන්ගේ ජාතිය, නාමය, ගෝත්‍රය, ආයුෂ ප්‍රමාණය, ප්‍රධාන ශ්‍රාවක යුගලය සහ ශ්‍රාවක සමූහය පවා සිහිපත් කරන්නේ? ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි ජාතියක් ඇත්තෝ වූහ, මෙවැනි නමක් ඇත්තෝ වූහ, මෙවැනි ගෝත්‍රයක් ඇත්තෝ වූහ, මෙවැනි සීලයක් ඇත්තෝ වූහ, මෙවැනි ධර්මයක් ඇත්තෝ වූහ, මෙවැනි ප්‍රඥාවක් ඇත්තෝ වූහ, මෙවැනි විහරණයක් ඇත්තෝ වූහ, මෙවැනි විමුක්තියක් ඇත්තෝ වූහ’ යනුවෙනි.”\n\nඒ භික්ෂූන්ගේ මේ කථාව අතරමග නතර විය.",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena karerimaṇḍalamāḷo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘kāyanuttha, bhikkhave, etarahi kathāya sannisinnā; kā ca pana vo antarākathā vippakatā’’ti? Evaṃ vutte te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, amhākaṃ acirapakkantassa bhagavato ayaṃ antarākathā udapādi – ‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, tathāgatassa mahiddhikatā mahānubhāvatā, yatra hi nāma tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarissati, nāmatopi anussarissati, gottatopi anussarissati, āyuppamāṇatopi anussarissati, sāvakayugatopi anussarissati, sāvakasannipātatopi anussarissati – ‘‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’’ti. Kiṃ nu kho, āvuso, tathāgatasseva nu kho esā dhammadhātu suppaṭividdhā, yassā dhammadhātuyā suppaṭividdhattā tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati – ‘‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’’ti. Udāhu devatā tathāgatassa etamatthaṃ ārocesuṃ, yena tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati – ‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’ti? Ayaṃ kho no, bhante, antarākathā vippakatā, atha bhagavā anuppatto’’ti.",
      "english": "Then, in the evening, the Blessed One rose from seclusion and went to the Karerimaṇḍala hall. On arrival, he sat down on the prepared seat. Seated, he addressed the monks: \"What discussion were you engaged in just now, monks? And what was the unfinished topic that you were discussing when I arrived?\"\n\nWhen he said this, the monks replied to the Blessed One: \"Just a short while after the Blessed One had left, venerable sir, this discussion arose among us: 'It's amazing and wonderful, friends, how the Tathagata possesses such great power and influence! He remembers past Buddhas who have attained complete Nibbana, whose mental proliferation is cut off, whose entanglement is severed, whose cycle of existence is ended, and who have gone beyond all suffering. He remembers them by birth, by name, by clan, by lifespan, by their chief pair of disciples, and by their assemblies of disciples, saying: \"Those Blessed Ones were of such birth, such name, such clan, such virtue, such teaching, such wisdom, such dwelling, and such liberation.\" So, friends, is it that the Tathagata has personally and thoroughly understood this element of the Dhamma? And is it through this thorough understanding that he remembers past Buddhas who have attained complete Nibbana, whose mental proliferation is cut off, whose entanglement is severed, whose cycle of existence is ended, and who have gone beyond all suffering, remembering them by birth, by name, by clan, by lifespan, by their chief pair of disciples, and by their assemblies of disciples, saying: \"Those Blessed Ones were of such birth, such name, such clan, such virtue, such teaching, such wisdom, such dwelling, and such liberation\"? Or did deities inform the Tathagata of these details, allowing him to remember past Buddhas who have attained complete Nibbana, whose mental proliferation is cut off, whose entanglement is severed, whose cycle of existence is ended, and who have gone beyond all suffering, remembering them by birth, by name, by clan, by lifespan, by their chief pair of disciples, and by their assemblies of disciples, saying: \"Those Blessed Ones were of such birth, such name, such clan, such virtue, such teaching, such wisdom, such dwelling, and such liberation\"?' This, venerable sir, was our unfinished discussion when the Blessed One arrived.\"",
      "sinhala": "ඉක්බිති භාග්‍යවත් බුදුරජාණන් වහන්සේ සවස් යාමයේ භාවනානුයෝගයෙන් නැගිට කරේරිමණ්ඩල මාලකය වෙත වැඩම කොට, එහි පනවා තිබූ අසුනෙහි වැඩසිටි සේක. අනතුරුව භික්ෂූන් අමතා මෙසේ වදාළ සේක: \"මහණෙනි, ඔබ දැන් කුමන කථාවකට රැස්ව සිටින්නේද? ඔබ අතරතුර නතර වූ කථාව කුමක්ද?\"\n\nඑවිට භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ වැඩම කළ මඳ වේලාවකට පසු අපට මෙවැනි කථාවක් ඇති විය. 'ආයුෂ්මතුනි, මෙය පුදුම සහගතය! ආයුෂ්මතුනි, මෙය අද්භූතය! තථාගතයන් වහන්සේගේ මහා ඉර්ධි බලය හා මහා ආනුභාවය කෙතරම්ද යත්, උන්වහන්සේ පිරිනිවන් පෑ, පපංචයන් සිඳ දැමූ, සංසාර චක්‍රය සිඳලූ, සම්පූර්ණයෙන් අවසන් කළ, සියලු දුක්ඛයන්ගෙන් මිදුණු අතීත බුදුවරුන්ගේ ජාතිය, නාමය, ගෝත්‍රය, ආයුෂ ප්‍රමාණය, ශ්‍රාවක යුගලය සහ ශ්‍රාවක සමූහය පවා සිහිපත් කරන සේක. එනම්, 'ඒ භාග්‍යවත් බුදුවරු මෙවැනි ජාතියක් ඇත්තාහු වූහ, මෙවැනි නමක් ඇත්තාහු වූහ, මෙවැනි ගෝත්‍රයක් ඇත්තාහු වූහ, මෙවැනි ශීලයක් ඇත්තාහු වූහ, මෙවැනි ධර්මයක් ඇත්තාහු වූහ, මෙවැනි ප්‍රඥාවක් ඇත්තාහු වූහ, මෙවැනි විහරණයන්ගෙන් යුක්ත වූහ, මෙවැනි විමුක්තියක් ලැබූහ' යනුවෙනි.'\n\n'ආයුෂ්මතුනි, තථාගතයන් වහන්සේට පමණක් මේ ධර්ම ධාතුව මැනවින් අවබෝධ වී තිබේද? එසේ නම්, යම් ධර්ම ධාතුවක් මැනවින් අවබෝධ කිරීමෙන් තථාගතයන් වහන්සේ පිරිනිවන් පෑ, පපංචයන් සිඳ දැමූ, සංසාර චක්‍රය සිඳලූ, සම්පූර්ණයෙන් අවසන් කළ, සියලු දුක්ඛයන්ගෙන් මිදුණු අතීත බුදුවරුන්ගේ ජාතිය, නාමය, ගෝත්‍රය, ආයුෂ ප්‍රමාණය, ශ්‍රාවක යුගලය සහ ශ්‍රාවක සමූහය සිහිපත් කරන සේක්ද? එනම්, 'ඒ භාග්‍යවත් බුදුවරු මෙවැනි ජාතියක් ඇත්තාහු වූහ, මෙවැනි නමක් ඇත්තාහු වූහ, මෙවැනි ගෝත්‍රයක් ඇත්තාහු වූහ, මෙවැනි ශීලයක් ඇත්තාහු වූහ, මෙවැනි ධර්මයක් ඇත්තාහු වූහ, මෙවැනි ප්‍රඥාවක් ඇත්තාහු වූහ, මෙවැනි විහරණයන්ගෙන් යුක්ත වූහ, මෙවැනි විමුක්තියක් ලැබූහ' යනුවෙනි. නැතහොත් දෙවියන් විසින් තථාගතයන් වහන්සේට මේ කරුණ දැනුම් දුන්නාහුද? එසේ නම්, යම් කරුණක් නිසා තථාගතයන් වහන්සේ පිරිනිවන් පෑ, පපංචයන් සිඳ දැමූ, සංසාර චක්‍රය සිඳලූ, සම්පූර්ණයෙන් අවසන් කළ, සියලු දුක්ඛයන්ගෙන් මිදුණු අතීත බුදුවරුන්ගේ ජාතිය, නාමය, ගෝත්‍රය, ආයුෂ ප්‍රමාණය, ශ්‍රාවක යුගලය සහ ශ්‍රාවක සමූහය සිහිපත් කරන සේක්ද? එනම්, 'ඒ භාග්‍යවත් බුදුවරු මෙවැනි ජාතියක් ඇත්තාහු වූහ, මෙවැනි නමක් ඇත්තාහු වූහ, මෙවැනි ගෝත්‍රයක් ඇත්තාහු වූහ, මෙවැනි ශීලයක් ඇත්තාහු වූහ, මෙවැනි ධර්මයක් ඇත්තාහු වූහ, මෙවැනි ප්‍රඥාවක් ඇත්තාහු වූහ, මෙවැනි විහරණයන්ගෙන් යුක්ත වූහ, මෙවැනි විමුක්තියක් ලැබූහ' යනුවෙනි. ස්වාමීනි, අපගේ කථාව එතැනින් නතර වූ අතර, භාග්‍යවතුන් වහන්සේ මේ දැන් වැඩම කළ සේක.\"",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "‘‘Tathāgatassevesā, bhikkhave, dhammadhātu suppaṭividdhā, yassā dhammadhātuyā suppaṭividdhattā tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati – ‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’ti. Devatāpi tathāgatassa etamatthaṃ ārocesuṃ, yena tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati – ‘evaṃjaccā te bhagavanto ahesuṃ itipi, evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ itipī’ti. ‘‘Iccheyyātha no tumhe, bhikkhave, bhiyyosomattāya pubbenivāsapaṭisaṃyuttaṃ dhammiṃ kathaṃ sotu’’nti? ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo; yaṃ bhagavā bhiyyosomattāya pubbenivāsapaṭisaṃyuttaṃ dhammiṃ kathaṃ kareyya, bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –",
      "english": "Monks, the Tathagata has thoroughly realized this element of truth. Through the thorough realization of this element of truth, the Tathagata remembers past Buddhas who have attained final Nibbana, who have cut off proliferation, whose paths are cut off, who have exhausted the round, who have overcome all suffering. He remembers their birth, their names, their lineage, their lifespan, their pairs of chief disciples, and their assemblies of disciples, recalling: 'Those Blessed Ones were born in this way, were named thus, belonged to that lineage, possessed such virtue, such Dhamma, such wisdom, lived thus, and were liberated thus.'\n\nEven devas reported this matter to the Tathagata, enabling the Tathagata to remember past Buddhas who have attained final Nibbana, who have cut off proliferation, whose paths are cut off, who have exhausted the round, who have overcome all suffering. He remembers their birth, their names, their lineage, their lifespan, their pairs of chief disciples, and their assemblies of disciples, recalling: 'Those Blessed Ones were born in this way, were named thus, belonged to that lineage, possessed such virtue, such Dhamma, such wisdom, lived thus, and were liberated thus.'\n\n'Monks, would you like to hear even more Dhamma relating to past lives?' 'Now is the time for that, Blessed One; now is the time, Fortunate One, for the Blessed One to give a further Dhamma talk relating to past lives. Having heard it from the Blessed One, the monks will remember it.' 'Then, monks, listen and pay close attention. I will speak.' 'Yes, venerable sir,' those monks replied to the Blessed One. The Blessed One said this:",
      "sinhala": "භික්ෂූනි, තථාගතයන් වහන්සේ විසින් මේ ධර්ම ධාතුව මනාව ප්‍රත්‍යක්ෂ කර ඇත. යම් ධර්ම ධාතුවක් මනාව ප්‍රත්‍යක්ෂ කළ හෙයින් තථාගතයන් වහන්සේ අතීතයේ පිරිනිවන් පෑමට ගිය, ප්‍රපංචයන් සිඳලූ, සසර වටය සිඳලූ, සසර කෙළවර කළ, සියලු දුකින් මිදුණු බුදුවරුන්ගේ ජාතිය, නම, ගෝත්‍රය, ආයු ප්‍රමාණය, ශ්‍රාවක යුගය සහ ශ්‍රාවක සමූහය සිහිපත් කරති. එනම්, ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි ජාතියකින් යුක්ත වූහ’, ‘මෙවැනි නමකින්, මෙවැනි ගෝත්‍රයකින්, මෙවැනි සීලයකින්, මෙවැනි ධර්මයකින්, මෙවැනි ප්‍රඥාවකින්, මෙවැනි විහරණයකින් හා මෙවැනි විමුක්තියකින් යුක්ත වූහ’ යනුවෙනි.\n\nතථාගතයන් වහන්සේ අතීතයේ පිරිනිවන් පෑමට ගිය, ප්‍රපංචයන් සිඳලූ, සසර වටය සිඳලූ, සසර කෙළවර කළ, සියලු දුකින් මිදුණු බුදුවරුන්ගේ ජාතිය, නම, ගෝත්‍රය, ආයු ප්‍රමාණය, ශ්‍රාවක යුගය සහ ශ්‍රාවක සමූහය සිහිපත් කරන මේ කාරණය දේවතාවෝ ද තථාගතයන් වහන්සේට දැන්වූහ. එනම්, ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි ජාතියකින් යුක්ත වූහ’, ‘මෙවැනි නමකින්, මෙවැනි ගෝත්‍රයකින්, මෙවැනි සීලයකින්, මෙවැනි ධර්මයකින්, මෙවැනි ප්‍රඥාවකින්, මෙවැනි විහරණයකින් හා මෙවැනි විමුක්තියකින් යුක්ත වූහ’ යනුවෙනි.\n\n“භික්ෂූනි, පෙර විසූ කඳපිළිවෙළ සම්බන්ධ ධර්ම කථාවක් තවදුරටත් අසන්නට ඔබ කැමතිද?”\n\n“භාග්‍යවතුන් වහන්ස, එයට මෙය කාලයයි. සුගතයන් වහන්ස, එයට මෙය කාලයයි. භාග්‍යවතුන් වහන්සේ පෙර විසූ කඳපිළිවෙළ සම්බන්ධ ධර්ම කථාවක් කරන්නේ නම්, භික්ෂූන් වහන්සේලා එය අසා සිහිතබා ගනිති.”\n\n“එසේ නම් භික්ෂූනි, අසන්න. හොඳින් මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි.”\n\n“එසේය ස්වාමීනි,” කියා ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "‘‘Ito so, bhikkhave, ekanavutikappe yaṃ vipassī bhagavā arahaṃ sammāsambuddho loke udapādi. Vipassī, bhikkhave, bhagavā arahaṃ sammāsambuddho khattiyo jātiyā ahosi, khattiyakule udapādi. Vipassī, bhikkhave, bhagavā arahaṃ sammāsambuddho koṇḍañño gottena ahosi. Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa asītivassasahassāni āyuppamāṇaṃ ahosi. Vipassī, bhikkhave, bhagavā arahaṃ sammāsambuddho pāṭaliyā mūle abhisambuddho. Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa khaṇḍatissaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa tayo sāvakānaṃ sannipātā ahesuṃ. Eko sāvakānaṃ sannipāto ahosi aṭṭhasaṭṭhibhikkhusatasahassaṃ, eko sāvakānaṃ sannipāto ahosi bhikkhusatasahassaṃ, eko sāvakānaṃ sannipāto ahosi asītibhikkhusahassāni. Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa ime tayo sāvakānaṃ sannipātā ahesuṃ sabbesaṃyeva khīṇāsavānaṃ. Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa asoko nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Vipassissa, bhikkhave, bhagavato arahato sammāsambuddhassa bandhumā nāma rājā pitā ahosi. Bandhumatī nāma devī mātā ahosi janetti. Bandhumassa rañño bandhumatī nāma nagaraṃ rājadhānī ahosi.",
      "english": "Monks, it was ninety-one eons ago that the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, appeared in the world. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, was by birth a khattiya, and arose in a khattiya family. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, was of the Koṇḍañña clan. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, had a lifespan of eighty thousand years. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, became fully enlightened at the foot of a Pāṭali tree. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, had a pair of chief disciples named Khaṇḍa and Tissa, who were the foremost excellent pair. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, had three assemblies of disciples. One assembly of disciples was six million eight hundred thousand monks, one assembly of disciples was one hundred thousand monks, and one assembly of disciples was eighty thousand monks. Monks, these three assemblies of disciples of the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, were all composed entirely of those whose defilements were destroyed. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, had a bhikkhu named Asoka as his attendant, who was his chief attendant. Monks, the Blessed One, the Arahant, the Fully Enlightened One, Vipassī, had a king named Bandhumā as his father. Queen Bandhumatī was his mother, the one who gave him birth. King Bandhumā had a city named Bandhumatī as his capital.",
      "sinhala": "භික්ෂූණෙනි, මේ කල්පයේ සිට අනූඑක් කල්පයකට පෙර විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. භික්ෂූණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ක්ෂත්‍රිය කුලයක උපත ලැබූ ක්ෂත්‍රිය වංශිකයෙක් වූ සේක. භික්ෂූණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කොණ්ඩඤ්ඤ ගෝත්‍රයට අයත් වූ සේක. භික්ෂූණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ආයුෂ ප්‍රමාණය වසර අසූ දහසක් විය. භික්ෂූණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ පාටලී වෘක්ෂය මුලදී සම්බුද්ධත්වයට පත් වූ සේක. භික්ෂූණෙනි, ඛණ්ඩ සහ තිස්ස යන අග්‍ර ශ්‍රාවකයන් යුගලක් විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට සිටියහ. භික්ෂූණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සමිති තුනක් විය. අටසැට ලක්ෂයක් භික්ෂූන්ගෙන් සමන්විත එක් ශ්‍රාවක සමිතියක්ද, ලක්ෂයක් භික්ෂූන්ගෙන් සමන්විත එක් ශ්‍රාවක සමිතියක්ද, අසූ දහසක් භික්ෂූන්ගෙන් සමන්විත එක් ශ්‍රාවක සමිතියක්ද විය. භික්ෂූණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ මේ ශ්‍රාවක සමිති තුනම ක්ෂීණාශ්‍රවී භික්ෂූන්ගෙන් පමණක් සමන්විත විය. භික්ෂූණෙනි, අශෝක නම් භික්ෂුව විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ අග්‍ර උපස්ථායක වූයේය. බන්ධුමා නම් රජු විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා වූ අතර බන්ධුමතී නම් දේවිය මව වූවාය. බන්ධුමා රජුගේ අගනුවර බන්ධුමතී නම් නගරයයි.",
      "paliTitle": ""
    },
    {
      "number": 17,
      "pali": "‘‘Atha kho, bhikkhave, vipassī bodhisatto tusitā kāyā cavitvā sato sampajāno mātukucchiṃ okkami. Ayamettha dhammatā.",
      "english": "Then, monks, the Bodhisatta Vipassī, passing away from the Tusita heaven, mindfully and with full awareness entered his mother's womb. This is the natural law.",
      "sinhala": "එකල, මහණෙනි, විපස්සී බෝධිසත්වයන් වහන්සේ තුසිත දෙව්ලොවින් චුතව සිහියෙන් හා මනා අවබෝධයෙන් යුක්තව මව් කුසට පිවිසියේය. මෙය එහි ස්වභාවයයි.",
      "paliTitle": "Bodhisattadhammatā",
      "englishTitle": "Qualities Befitting a Bodhisatta",
      "sinhalaTitle": "බෝධිසත්ව ධර්මතාවය"
    },
    {
      "number": 18,
      "pali": "‘‘Dhammatā, esā, bhikkhave, yadā bodhisatto tusitā kāyā cavitvā mātukucchiṃ okkamati. Atha sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yāpi tā lokantarikā aghā asaṃvutā andhakārā andhakāratimisā, yattha pime candimasūriyā evaṃmahiddhikā evaṃmahānubhāvā ābhāya nānubhonti, tatthapi appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yepi tattha sattā upapannā, tepi tenobhāsena aññamaññaṃ sañjānanti – ‘aññepi kira, bho, santi sattā idhūpapannā’ti. Ayañca dasasahassī lokadhātu saṅkampati sampakampati sampavedhati. Appamāṇo ca uḷāro obhāso loke pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Ayamettha dhammatā.",
      "english": "Monks, this is the natural law: when a Bodhisatta departs from the Tusita heaven and descends into his mother's womb, then in this world – with its deities, Mara, Brahma, ascetics and brahmins, and its people including gods and humans – an immeasurable, magnificent radiance appears, surpassing even the divine power of the gods. Even in those dark, boundless, inter-cosmic voids, enveloped in utter darkness – where the moon and sun, so mighty and powerful, cannot illuminate with their light – even there an immeasurable, magnificent radiance appears, surpassing even the divine power of the gods. And the beings born there recognize each other by that radiance, thinking, 'Good sirs, other beings have been born here too!' And this ten-thousandfold world system trembles, quakes, and violently shakes. And an immeasurable, magnificent radiance appears in the world, surpassing even the divine power of the gods. This is the natural law in this instance.",
      "sinhala": "මහණෙනි, මෙය ධර්මතාවකි. බෝධිසත්ත්වයන් වහන්සේ තුසිත දෙව්ලොවින් චුතව මව් කුස පිළිසිඳ ගන්නා කල්හි, දෙවියන්, මරුන්, බඹුන්, ශ්‍රමණ බ්‍රාහ්මණයන් හා දෙවි මිනිසුන් සහිත වූ මේ ලෝකයෙහි, දෙවියන්ගේ ආනුභාවය ඉක්මවන, අප්‍රමාණ වූ උදාර ආලෝකයක් පහළ වෙයි. ලෝකාන්තරික නිරයන්හි, අගාධ වූ, ආවරණ රහිත, අන්ධකාරයෙන් පිරුණු, ඝන අඳුර පවතින තැන්වල පවා, සඳ හිරු දෙදෙනාගේ මහත් වූ ඉර්ධි බලයෙන් හා ආනුභාවයෙන් ආලෝකය විහිදුවාලිය නොහැකි වුවද, දෙවියන්ගේ ආනුභාවය ඉක්මවන, අප්‍රමාණ වූ උදාර ආලෝකයක් පහළ වෙයි. එහි උපත ලබා සිටින සත්වයෝ, ඒ ආලෝකයෙන් එකිනෙකා හඳුනාගෙන, 'අහෝ, මෙහි වෙනත් සත්වයෝද උපත ලබා සිටිති' යැයි දැන ගනිති. මේ දස දහසක් ලෝක ධාතුව කම්පා වෙයි, මැනවින් කම්පා වෙයි, මුළුමනින්ම කම්පා වෙයි. දෙවියන්ගේ ආනුභාවය ඉක්මවන, අප්‍රමාණ වූ උදාර ආලෝකයක් ලෝකයෙහි පහළ වෙයි. මෙය එහි ස්වභාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 19,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchiṃ okkanto hoti, cattāro naṃ devaputtā catuddisaṃ [cātuddisaṃ (syā.)] rakkhāya upagacchanti – ‘mā naṃ bodhisattaṃ vā bodhisattamātaraṃ vā manusso vā amanusso vā koci vā viheṭhesī’ti. Ayamettha dhammatā.",
      "english": "Monks, this is the natural law: when a Bodhisatta descends into his mother's womb, four divine beings come from the four directions to guard him, thinking, 'Let no human or non-human, or anyone at all, harm this Bodhisatta or his mother.' This is the natural law in this instance.",
      "sinhala": "භික්ෂූනි, මෙය ධර්මතාවයකි. යම් විටෙක බෝධිසත්ත්වයෙක් මව් කුස පිළිසිඳ ගන්නේද, මිනිසෙකු හෝ අමනුෂ්‍යයෙකු හෝ වෙනත් කිසිවෙකු විසින් බෝධිසත්ත්වයන්ට හෝ බෝධිසත්ව මවට හෝ හිරිහැරයක් නොකරන ලෙස සතර දිශාවෙන් දේවපුත්‍රයෝ සතර දෙනෙක් ආරක්ෂාව සඳහා පැමිණෙති. මෙය එහි ධර්මතාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 20,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchiṃ okkanto hoti, pakatiyā sīlavatī bodhisattamātā hoti, viratā pāṇātipātā, viratā adinnādānā, viratā kāmesumicchācārā, viratā musāvādā, viratā surāmerayamajjappamādaṭṭhānā. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: When a Bodhisatta descends into his mother's womb, his mother naturally becomes virtuous, refraining from killing living beings, refraining from taking what is not given, refraining from sexual misconduct, refraining from false speech, and refraining from intoxicants—liquor and drugs—that cause carelessness. This is the natural order in this matter.",
      "sinhala": "භික්ෂූන් වහන්ස, මෙය ස්වභාවයයි. යම් කලෙක බෝධිසත්වයෙක් මවකගේ කුස පිළිසිඳ ගන්නේ ද, බෝධිසත්ව මව ස්වභාවයෙන්ම සිල්වත් වන්නී ය. ඇය ප්රාණඝාතයෙන්, අදත්තාදානයෙන්, කාමමිථ්යාචාරයෙන්, මුසාවාදයෙන් හා සුරාමේරය ආදී ප්‍රමාදයට හේතුවන මත්ද්‍රව්‍ය භාවිතයෙන් වැළකී සිටින්නී ය. මෙය එහි ස්වභාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 21,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchiṃ okkanto hoti, na bodhisattamātu purisesu mānasaṃ uppajjati kāmaguṇūpasaṃhitaṃ, anatikkamanīyā ca bodhisattamātā hoti kenaci purisena rattacittena. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: when a Bodhisatta enters his mother's womb, his mother no longer has thoughts of men driven by sensual pleasures. Furthermore, no man with lustful intentions can violate the Bodhisatta's mother. This is the norm.",
      "sinhala": "මහණෙනි, යම් කලෙක බෝධිසත්ත්වයෙක් මව් කුස පිළිසිඳ ගන්නේ ද, එකල්හි බෝධිසත්ව මවට කාම ගුණයන් හා බැඳුණු සිත් පුරුෂයන් කෙරෙහි ඇති නොවේ. තවද රාගයෙන් පෙළෙන කිසිදු පුරුෂයෙකුට බෝධිසත්ව මව අභිභවනය කළ නොහැක. මෙය ධර්මතාවයකි.",
      "paliTitle": ""
    },
    {
      "number": 22,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchiṃ okkanto hoti, lābhinī bodhisattamātā hoti pañcannaṃ kāmaguṇānaṃ. Sā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricāreti. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: when a Bodhisatta enters his mother's womb, his mother gains the five strands of sensual pleasure. Provided and endowed with the five strands of sensual pleasure, she enjoys and is served by them. This is the natural order in this case.",
      "sinhala": "භික්ෂූනි, මෙය ධර්මතාවයකි. යම් කලෙක බෝධිසත්ත්වයන් මව් කුස පිළිසිඳ ගන්නේ ද, එකල්හි බෝධිසත්ත්ව මව පස්කම් සැප ලබන්නී වේ. ඇය පස්කම් සැපයෙන් සපිරිව, මනා සේ ඒවා අත්විඳින්නීය. මෙය ධර්මතාවයකි.",
      "paliTitle": ""
    },
    {
      "number": 23,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchiṃ okkanto hoti, na bodhisattamātu kocideva ābādho uppajjati. Sukhinī bodhisattamātā hoti akilantakāyā, bodhisattañca bodhisattamātā tirokucchigataṃ passati sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Seyyathāpi, bhikkhave, maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato accho vippasanno anāvilo sabbākārasampanno. Tatrāssa [tatrassa (syā.)] suttaṃ āvutaṃ nīlaṃ vā pītaṃ vā lohitaṃ vā odātaṃ vā paṇḍusuttaṃ vā. Tamenaṃ cakkhumā puriso hatthe karitvā paccavekkheyya – ‘ayaṃ kho maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato accho vippasanno anāvilo sabbākārasampanno. Tatridaṃ suttaṃ āvutaṃ nīlaṃ vā pītaṃ vā lohitaṃ vā odātaṃ vā paṇḍusuttaṃ vā’ti. Evameva kho, bhikkhave, yadā bodhisatto mātukucchiṃ okkanto hoti, na bodhisattamātu kocideva ābādho uppajjati, sukhinī bodhisattamātā hoti akilantakāyā, bodhisattañca bodhisattamātā tirokucchigataṃ passati sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Ayamettha dhammatā.",
      "english": "Monks, it is a natural law that when a Bodhisatta descends into his mother's womb, his mother experiences no illness whatsoever. She is comfortable and free from physical weariness, and she sees the Bodhisatta within her womb, complete in every limb, both major and minor, and with unimpaired faculties.\n\nJust as, monks, a beryl gem, beautiful and of excellent origin, with eight facets, well-polished, clear, radiant, unclouded, and perfect in every way, might have a thread strung through it—blue, yellow, red, white, or pale yellow—a keen-sighted person, holding it in their hand, would examine it and say, ‘This is a beryl gem, beautiful and of excellent origin, with eight facets, well-polished, clear, radiant, unclouded, and perfect in every way. And through it is strung this thread, blue, yellow, red, white, or pale yellow.’\n\nIn the same way, monks, when a Bodhisatta descends into his mother's womb, his mother experiences no illness whatsoever. She is comfortable and free from physical weariness, and she sees the Bodhisatta within her womb, complete in every limb, both major and minor, and with unimpaired faculties. This is the natural law in this instance.",
      "sinhala": "මහණෙනි, මෙය ස්වභාවධර්මතාවයකි. බෝධිසත්ත්වයන් මව් කුස පිළිසිඳ ගන්නා විට බෝසත් මවට කිසිදු රෝගයක් හට නොගනී. බෝසත් මව සැපවත් වේ. වෙහෙසක් නොදැනෙන ශරීරයකින් යුක්ත වේ. තවද බෝසත් මව, කුස තුළ වැඩෙන බෝධිසත්ත්වයන් සියලු අංගෝපාංගයන්ගෙන් හා පිරිපුන් ඉන්ද්‍රියන්ගෙන් යුක්තව දකියි. මහණෙනි, යම් සේ උසස් කුලීනත්වයෙන් හෙබි, අටපට්ටම් කර මනා ඔප දැමූ, පැහැදිලි, නිර්මල, කිසිදු කැළලක් රහිත, සියලු අංගවලින් සම්පූර්ණ වූ වෛඩූර්ය මාණික්යයක් තිබේද, එහි නිල්, කහ, රතු, සුදු හෝ ලා කහ පැහැති නූලක් අමුණා තිබේද, ඇස් ඇති පුරුෂයෙක් එය අතට ගෙන මෙසේ විමසයි. ‘මෙම වෛඩූර්ය මාණික්යය උසස් කුලීනත්වයෙන් හෙබි, අටපට්ටම් කර මනා ඔප දැමූ, පැහැදිලි, නිර්මල, කිසිදු කැළලක් රහිත, සියලු අංගවලින් සම්පූර්ණය. තවද එහි නිල්, කහ, රතු, සුදු හෝ ලා කහ පැහැති නූලක් අමුණා ඇත’ යනුවෙනි. මහණෙනි, ඒ ආකාරයෙන්ම, බෝධිසත්ත්වයන් මව් කුස පිළිසිඳ ගන්නා විට බෝසත් මවට කිසිදු රෝගයක් හට නොගනී. බෝසත් මව සැපවත් වේ. වෙහෙසක් නොදැනෙන ශරීරයකින් යුක්ත වේ. තවද බෝසත් මව, කුස තුළ වැඩෙන බෝධිසත්ත්වයන් සියලු අංගෝපාංගයන්ගෙන් හා පිරිපුන් ඉන්ද්‍රියන්ගෙන් යුක්තව දකියි. මෙය එහි ස්වභාවධර්මතාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 24,
      "pali": "‘‘Dhammatā esā, bhikkhave, sattāhajāte bodhisatte bodhisattamātā kālaṅkaroti tusitaṃ kāyaṃ upapajjati. Ayamettha dhammatā.",
      "english": "Monks, it is a natural law that when the Bodhisatta is seven days old, his mother dies and is reborn in the Tusita realm. This is the natural order of things.",
      "sinhala": "භික්ෂූන් වහන්ස, මෙය ධර්මතාවයකි. බෝධිසත්වයන් උපත ලබා සත් දිනක් ඇවෑමෙන් බෝධිසත්ව මව මිය ගොස් තුසිත දිව්ය ලෝකයේ උත්පත්තිය ලබයි. මෙහි ධර්මතාවය මෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 25,
      "pali": "‘‘Dhammatā esā, bhikkhave, yathā aññā itthikā nava vā dasa vā māse gabbhaṃ kucchinā pariharitvā vijāyanti, na hevaṃ bodhisattaṃ bodhisattamātā vijāyati. Daseva māsāni bodhisattaṃ bodhisattamātā kucchinā pariharitvā vijāyati. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: ordinary women carry a child in the womb for nine or ten months before giving birth, but the mother of a Bodhisatta does not give birth to a Bodhisatta in that way. The Bodhisatta's mother carries the Bodhisatta in her womb for exactly ten months before giving birth. This is the natural order here.",
      "sinhala": "මහණෙනි, මෙය ධර්මතාවයකි. අන්ය ස්ත්රීන් නව මසක් හෝ දස මසක් කුස තුළ ගැබ දරාගෙන දරුවන් වදන්නා සේ බෝධිසත්ව මව බෝධිසත්වයන් වහන්සේව එසේ නො වදයි. බෝධිසත්ව මව දස මසක් මුළුල්ලේ කුස තුළ බෝධිසත්වයන් වහන්සේව දරාගෙන වදයි. මෙය එහි ධර්මතාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 26,
      "pali": "‘‘Dhammatā esā, bhikkhave, yathā aññā itthikā nisinnā vā nipannā vā vijāyanti, na hevaṃ bodhisattaṃ bodhisattamātā vijāyati. Ṭhitāva bodhisattaṃ bodhisattamātā vijāyati. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: other women give birth sitting or lying down, but the Bodhisatta's mother does not give birth to the Bodhisatta in that way. The Bodhisatta's mother gives birth to the Bodhisatta standing. This is the natural order in this case.",
      "sinhala": "භික්ෂූන් වහන්ස, මෙය ධර්මතාවයකි. අන් ස්ත්රීන් වාඩි වී හෝ වැතිරී හෝ දරු උපත් සිදු කරන්නා සේ නොව, බෝධිසත්ව මව බෝධිසත්වයන් වහන්සේ බිහි කරන්නේ සිටගෙන සිටියදීය. මෙය එහි ධර්මතාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 27,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchimhā nikkhamati, devā paṭhamaṃ paṭiggaṇhanti, pacchā manussā. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: when a Bodhisatta emerges from his mother's womb, the devas receive him first, and then humans. This is the natural order in this case.",
      "sinhala": "මහණෙනි, මෙය ධර්මතාවයකි. බෝධිසත්වයන් මව් කුසින් නික්මෙන විට, පළමුව දෙවියෝ ද, පසුව මිනිසුන් ද පිළිගනිති. මෙය එහි ධර්මතාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 28,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchimhā nikkhamati, appattova bodhisatto pathaviṃ hoti, cattāro naṃ devaputtā paṭiggahetvā mātu purato ṭhapenti – ‘attamanā, devi, hohi; mahesakkho te putto uppanno’ti. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: when the Bodhisatta emerges from his mother's womb, he does not touch the earth. Four divine beings receive him and place him before his mother, saying, \"Rejoice, queen! A son of great power has been born to you.\" This is the natural order in this case.",
      "sinhala": "“මහණෙනි, මෙය ධර්මතාවකි. බෝධිසත්ත්වයන් මව් කුසින් නික්මෙන විට, බෝධිසත්ත්වයන් පොළොවෙහි පය ගැසීමට පෙරම, දෙවිපුතුන් සතර දෙනෙක් උන්වහන්සේ පිළිගෙන ‘දේවියනි, සතුටු වන්න; ඔබට මහේශාක්ය පුත්රයෙක් උපන’ යනුවෙන් මව ඉදිරියෙහි තබති. මෙය එහි ධර්මතාවයි.”",
      "paliTitle": ""
    },
    {
      "number": 29,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchimhā nikkhamati, visadova nikkhamati amakkhito udena [uddena (syā.), udarena (katthaci)] amakkhito semhena amakkhito ruhirena amakkhito kenaci asucinā suddho [visuddho (syā.)] visado. Seyyathāpi, bhikkhave, maṇiratanaṃ kāsike vatthe nikkhittaṃ neva maṇiratanaṃ kāsikaṃ vatthaṃ makkheti, nāpi kāsikaṃ vatthaṃ maṇiratanaṃ makkheti. Taṃ kissa hetu? Ubhinnaṃ suddhattā. Evameva kho, bhikkhave, yadā bodhisatto mātukucchimhā nikkhamati, visadova nikkhamati amakkhito, udena amakkhito semhena amakkhito ruhirena amakkhito kenaci asucinā suddho visado. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: when a Bodhisatta emerges from his mother's womb, he emerges pure and unblemished. He is unstained by fluid, unstained by phlegm, unstained by blood, unstained by any impurity; he is perfectly pure and undefiled. Just as, monks, a precious jewel placed on a cloth from Kasi neither stains the cloth, nor is stained by it. Why is that? Because both are pure. In the same way, monks, when a Bodhisatta emerges from his mother's womb, he emerges pure and unblemished—unstained by fluid, unstained by phlegm, unstained by blood, unstained by any impurity; he is perfectly pure and undefiled. This is the natural order of things in this case.",
      "sinhala": "භික්ෂූනි, මෙය ධර්මතාවයකි. යම් කලෙක බෝධිසත්ත්වයන් මව් කුසින් නික්මෙන්නේ, මුත්රාවන්ගෙන්, සෙමෙන්, ලෙයින් හෝ කිසිදු අපිරිසිදු දෙයකින් තැවරීමක් රහිතව, පිරිසිදුව නික්මෙයි. භික්ෂූනි, යම් සේ කාසික වස්ත්රයක තැබූ මැණික් රුවනක් කාසික වස්ත්රය කිළිටි නොකරයිද, එමෙන්ම කාසික වස්ත්රයද මැණික් රුවන කිළිටි නොකරයි. එයට හේතුව කුමක්ද? දෙකෙහිම පිරිසිදු භාවයයි. භික්ෂූනි, එලෙසම, යම් කලෙක බෝධිසත්ත්වයන් මව් කුසින් නික්මෙන්නේ, මුත්රාවන්ගෙන්, සෙමෙන්, ලෙයින් හෝ කිසිදු අපිරිසිදු දෙයකින් තැවරීමක් රහිතව, පිරිසිදුව නික්මෙයි. මෙය එහි ධර්මතාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 30,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchimhā nikkhamati, dve udakassa dhārā antalikkhā pātubhavanti – ekā sītassa ekā uṇhassa yena bodhisattassa udakakiccaṃ karonti mātu ca. Ayamettha dhammatā.",
      "english": "Monks, this is the natural order: when a Bodhisatta emerges from his mother's womb, two streams of water appear from the sky – one cold and one hot – to perform the bathing for both the Bodhisatta and the mother. This is the natural order in this case.",
      "sinhala": "මහණෙනි, බෝධිසත්ත්වයෙක් මව් කුසින් නික්මෙන විට අහසින් දිය දහර දෙකක් පහළ වීම ධර්මතාවයකි. ඉන් එකක් සිසිල් දිය දහරක් වන අතර අනෙක උණුසුම් දිය දහරකි. එමගින් බෝධිසත්වයන්ට සහ මවට ජල ස්නානය කරනු ලැබේ. මෙය ධර්මතාවයකි.",
      "paliTitle": ""
    },
    {
      "number": 31,
      "pali": "‘‘Dhammatā esā, bhikkhave, sampatijāto bodhisatto samehi pādehi patiṭṭhahitvā uttarābhimukho [uttarenābhimukho (syā.) uttarenamukho (ka.)] sattapadavītihārena gacchati setamhi chatte anudhāriyamāne, sabbā ca disā anuviloketi, āsabhiṃ vācaṃ bhāsati ‘aggohamasmi lokassa, jeṭṭhohamasmi lokassa, seṭṭhohamasmi lokassa, ayamantimā jāti, natthidāni punabbhavo’ti. Ayamettha dhammatā.",
      "english": "Monks, such is the natural order of things: the Bodhisatta, immediately upon birth, standing firmly on both feet, walks seven paces facing north, while a white canopy is held over him, surveys all directions, and then utters a lion's roar: ‘I am the foremost in the world! I am the chief in the world! I am the highest in the world! This is my last birth! There is no more renewed existence now!’ This is the natural order of things here.",
      "sinhala": "මහණෙනි, මෙය ධර්මතාවකි. බෝසත්තුමා ඉපදුණු සැනින් සම පාදවලින් ස්ථාවරව උතුරු දිශාව බලා සුදු ඡත්රයක් ඉහළින් දරනු ලබද්දී සත් පියවරක් ඉදිරියට ගමන් කරයි. උන්වහන්සේ සියලු දිශාවන් දෙස බලමින් ආසභ වචනයක් ප්රකාශ කරති: \"මම ලෝකයේ අග්ර වෙමි, මම ලෝකයේ ජ්යෙෂ්ඨ වෙමි, මම ලෝකයේ ශ්රේෂ්ඨ වෙමි. මෙය අවසාන ජාතියයි. මින් පසු පුනර්භවයක් නැත.\" මෙය එහි ධර්මතාවයි.",
      "paliTitle": ""
    },
    {
      "number": 32,
      "pali": "‘‘Dhammatā esā, bhikkhave, yadā bodhisatto mātukucchimhā nikkhamati, atha sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya appamāṇo uḷāro obhāso pātubhavati, atikkammeva devānaṃ devānubhāvaṃ. Yāpi tā lokantarikā aghā asaṃvutā andhakārā andhakāratimisā, yattha pime candimasūriyā evaṃmahiddhikā evaṃmahānubhāvā ābhāya nānubhonti, tatthapi appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yepi tattha sattā upapannā, tepi tenobhāsena aññamaññaṃ sañjānanti – ‘aññepi kira, bho, santi sattā idhūpapannā’ti. Ayañca dasasahassī lokadhātu saṅkampati sampakampati sampavedhati appamāṇo ca uḷāro obhāso loke pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Ayamettha dhammatā.",
      "english": "Monks, it is the nature of things that when the Bodhisatta emerges from his mother's womb, an immeasurable, magnificent radiance appears in the world, with its devas, Maras, and Brahmas, its population of ascetics and brahmins, and its devas and humans, surpassing even the divine power of the devas. Even in those inter-world spaces that are wretched, unprotected, dark, and intensely gloomy, where the moon and sun, so mighty and powerful, cannot illuminate with their radiance, an immeasurable, magnificent radiance appears, surpassing even the divine power of the devas. And the beings reborn there recognize each other by that radiance, saying, \"Good sirs, other beings are also reborn here!\" Furthermore, this ten-thousandfold world-system quakes, intensely quakes, and trembles, and an immeasurable, magnificent radiance appears in the world, surpassing even the divine power of the devas. This is the nature of things in this instance.",
      "sinhala": "මහණෙනි, මෙය ධර්මතාවකි. යම් කලෙක බෝධිසත්ත්වයන් වහන්සේ මව් කුසින් නික්මෙද්ද, එවිට දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත වූ ලෝකයාට අප්‍රමාණ, උදාර ආලෝකයක් පහළ වෙයි. එය දෙවියන්ගේ ආනුභාවය පවා ඉක්මවා යයි. ලෝකාන්තරික නම් වූ යම් අගාධ, අසංවෘත, අන්ධකාර, මහා අන්ධකාරයෙන් ගහන ස්ථාන ඇත් ද, යම් තැනක මෙතරම් මහත් සෘද්ධි හා ආනුභාව ඇති චන්ද්‍රයා සහ සූර්යයා පවා එළියෙන් බැබළෙන්නේ නැද්ද, එහි ද අප්‍රමාණ, උදාර ආලෝකයක් පහළ වෙයි. එය දෙවියන්ගේ ආනුභාවය පවා ඉක්මවා යයි. එහි උපත ලැබූ යම් සත්වයෝ වෙත් ද, ඔවුහු ඒ ආලෝකයෙන් එකිනෙකා හඳුනා ගනිමින්, 'භවත්නි, මෙහි උපන් වෙනත් සත්වයෝ ද සිටිති' යැයි දැන ගනිති. තවද, මේ දස දහසක් ලෝක ධාතුව කම්පා වෙයි, මහා ලෙස කම්පා වෙයි, දැඩි ලෙස කම්පා වෙයි. අප්‍රමාණ වූ, උදාර වූ ආලෝකයක් ලොවෙහි පහළ වෙයි. එය දෙවියන්ගේ ආනුභාවය පවා ඉක්මවා යයි. මෙය එහි ධර්මතාවයයි.",
      "paliTitle": ""
    },
    {
      "number": 33,
      "pali": "‘‘Jāte kho pana, bhikkhave, vipassimhi kumāre bandhumato rañño paṭivedesuṃ – ‘putto te, deva [deva te (ka.)], jāto, taṃ devo passatū’ti. Addasā kho, bhikkhave, bandhumā rājā vipassiṃ kumāraṃ, disvā nemitte brāhmaṇe āmantāpetvā etadavoca – ‘passantu bhonto nemittā brāhmaṇā kumāra’nti. Addasaṃsu kho, bhikkhave, nemittā brāhmaṇā vipassiṃ kumāraṃ, disvā bandhumantaṃ rājānaṃ etadavocuṃ – ‘attamano, deva, hohi, mahesakkho te putto uppanno, lābhā te, mahārāja, suladdhaṃ te, mahārāja, yassa te kule evarūpo putto uppanno. Ayañhi, deva, kumāro dvattiṃsamahāpurisalakkhaṇehi samannāgato, yehi samannāgatassa mahāpurisassa dveva gatiyo bhavanti anaññā. Sace agāraṃ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni sattaratanāni bhavanti. Seyyathidaṃ – cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭacchado.",
      "english": "Monks, when Prince Vipassi was born, a report was made to King Bandhuma: \"Your Majesty, a son has been born to you; may Your Majesty see him.\" So King Bandhuma saw Prince Vipassi. After seeing him, he summoned the soothsayer brahmins and said to them, \"Venerable soothsayer brahmins, examine the prince.\" The soothsayer brahmins examined Prince Vipassi, and after examining him, they told King Bandhuma: \"Be glad, Your Majesty! A son of great power has been born to you. It is a gain for you, Great King, a truly fortunate acquisition, Great King, that such a son has been born into your family. Your Majesty, this prince possesses the thirty-two marks of a Great Man, and for a Great Man possessing these, there are only two possible destinies, no other. If he lives the household life, he will become a Wheel-Turning Monarch, a righteous king, a ruler of righteousness, victorious in the four quarters, establishing stability in his country, and possessing the seven treasures. These are his seven treasures: the Wheel Treasure, the Elephant Treasure, the Horse Treasure, the Gem Treasure, the Woman Treasure, the Householder Treasure, and the Counselor Treasure as the seventh. He will have more than a thousand sons, valiant and heroic, who will crush the armies of his foes. He will conquer and rule this earth, bounded by the ocean, not by force or by arms, but by righteousness. But if he goes forth from the household life into homelessness, he will become an Arahant, a Fully Enlightened Buddha, one who has removed the veil from the world.\"",
      "sinhala": "මහණෙනි, විපස්සී කුමරු උපන් බව බන්ධුමා රජුට දැන්වූයේ, ‘දේවයන් වහන්ස, ඔබට පුත්රයෙක් උපත ලැබී ඇත. දේවයන් වහන්සේ ඔහු දැකීමට මැනව’ යනුවෙනි. මහණෙනි, බන්ධුමා රජු විපස්සී කුමරු දුටුවේය. දැක නිමිති කියන බමුණන් ගෙන්වා මෙසේ කීවේය – ‘පින්වත් නිමිති කියන බමුණෙනි, කුමරු පරීක්ෂා කර බලනු මැනව’යි. මහණෙනි, නිමිති කියන බමුණෝ විපස්සී කුමරු පරීක්ෂා කර බලා බන්ධුමා රජුට මෙසේ කීහ: ‘දේවයන් වහන්ස, සතුටු වන්න! ඔබට මහත් ඉර්ධිමත් පුත්රයෙක් උපත ලැබී ඇත. මහරජ, එය ඔබට ලාභයකි! මහරජ, එය ඔබට යහපතකි! මෙවන් පුත්රයෙක් යම් කුලයක උපදී නම්, එය මහත් භාග්‍යයකි. දේවයන් වහන්ස, මේ කුමරු මහා පුරුෂ ලක්ෂණ තිස් දෙකෙන් යුක්තය. එම ලක්ෂණවලින් යුක්ත මහා පුරුෂයෙකුට තවත් ගතියක් නැත. ඔහුට ඇත්තේ ගති දෙකක් පමණි. එනම්, ඔහු ගිහිගෙයි වාසය කරන්නේ නම්, ධර්මිෂ්ඨ වූ, දහමින් රාජ්‍යය කරන, සතර දිග්විජය කළ, ජනපදවල ස්ථාවරත්වය ඇති කළ සක්විති රජෙක් වන්නේය. ඔහු සත් රුවනින් යුක්ත වන්නේය. එනම්: චක්‍ර රත්නය, හස්ති රත්නය, අශ්ව රත්නය, මාණික්‍ය රත්නය, ස්ත්‍රී රත්නය, ගෘහපති රත්නය සහ සත්වන පරිනායක රත්නය යන මේ සත් රුවනයි. ඔහුට දහසකට අධික වීර පුත්‍රයෝ සිටිති. ඔවුහු සතුරු සේනා පරාජය කිරීමට සමත් වෙති. ඔහු මේ මුළු පොළොව සාගරය දක්වාම කිසිදු දණ්ඩක් හෝ ආයුධයක් නොමැතිව ධර්මයෙන් ජයගෙන වාසය කරයි. එසේ නොවී ඔහු ගිහිගෙන් නික්ම අනගාරික ජීවිතයට පැමිණෙන්නේ නම්, ලෝකයේ සියලු වැස්ම දුරු කළ අරහත් සම්මා සම්බුද්ධයෙක් වන්නේය.’",
      "paliTitle": "Dvattiṃsamahāpurisalakkhaṇā",
      "englishTitle": "The 32 marks of a great man.",
      "sinhalaTitle": "මහා පුරිස ලකුණු තිස් දෙක"
    },
    {
      "number": 34,
      "pali": "‘Katamehi cāyaṃ, deva, kumāro dvattiṃsamahāpurisalakkhaṇehi samannāgato, yehi samannāgatassa mahāpurisassa dveva gatiyo bhavanti anaññā. Sace agāraṃ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāpī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni sattaratanāni bhavanti. Seyyathidaṃ – cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭacchado.",
      "english": "\"And with which of the thirty-two marks of a Great Man, O deity, is this prince endowed, by virtue of which a Great Man has only two possible destinies, and no other? If he lives the householder's life, he becomes a Wheel-Turning Monarch, a righteous king ruling by Dhamma, sovereign of the four quarters of the earth, a conqueror who has established his country's security, endowed with the seven treasures.\n\nThese are his seven treasures: the Wheel Treasure, the Elephant Treasure, the Horse Treasure, the Jewel Treasure, the Woman Treasure, the Householder Treasure, and the Counselor Treasure as the seventh. Furthermore, he will have more than a thousand sons, brave and heroic in stature, destroyers of enemy armies. He will conquer and rule this earth, extending to the ocean shore, not by force of arms, but by Dhamma. But if he goes forth from the household life into homelessness, he becomes an Arahant, a Fully Enlightened Buddha, one who has unveiled the world.\"",
      "sinhala": "දේවයිනි, මේ කුමාරයා තිස්දෙක මහා පුරුෂ ලක්ෂණයන්ගෙන් සමන්විත වන්නේ ය. එම ලක්ෂණවලින් සමන්විත මහා පුරුෂයාට ගති දෙකක් මිස අන්ය ගතියක් නැත. ඔහු ගිහිගෙයි වාසය කරන්නේ නම්, ධර්මිෂ්ඨ වූ, ධර්ම රාජ්යයක් ගෙන යන, සතර දිග්විජය කළ, ජනපදවල ස්ථාවරත්වය ඇති කළ, සප්ත රත්නයන්ගෙන් සමන්විත සක්විති රජෙක් වන්නේ ය. ඔහුට හිමි සප්ත රත්නයන් වනුයේ චක්ර රත්නය, හස්ති රත්නය, අශ්ව රත්නය, මණි රත්නය, ස්ත්රී රත්නය, ගෘහපති රත්නය, සහ පරිනායක රත්නය යන මේවා ය. තවද, ඔහුට වීරත්වයෙන් හෙබි, සතුරු සේනා මඩින දහසකට අධික පුත්රයන් සිටිනු ඇත. ඔහු මුහුදින් සීමා වූ මේ පොළොව දඬු මුගුරු හෝ අවි ආයුධ වලින් තොරව, ධර්මයෙන් ජයගෙන වාසය කරයි. එහෙත්, ඔහු ගිහිගෙයින් නික්ම අනගාරික ජීවිතයකට පැවිදි වන්නේ නම්, ලෝකයේ වැස්ම ඉවත් කළ අරහත් වූ සම්මා සම්බුද්ධත්වයට පත් වන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 35,
      "pali": "‘Ayañhi, deva, kumāro suppatiṭṭhitapādo. Yaṃ pāyaṃ, deva, kumāro suppatiṭṭhitapādo. Idampissa mahāpurisassa mahāpurisalakkhaṇaṃ bhavati. ‘Imassa, deva [imassa hi deva (?)], kumārassa heṭṭhā pādatalesu cakkāni jātāni sahassārāni sanemikāni sanābhikāni sabbākāraparipūrāni. Yampi, imassa deva, kumārassa heṭṭhā pādatalesu cakkāni jātāni sahassārāni sanemikāni sanābhikāni sabbākāraparipūrāni, idampissa mahāpurisassa mahāpurisalakkhaṇaṃ bhavati. ‘Ayañhi deva, kumāro āyatapaṇhī…pe… ‘Ayañhi, deva, kumāro dīghaṅgulī… ‘Ayañhi, deva, kumāro mudutalunahatthapādo… ‘Ayañhi, deva kumāro jālahatthapādo… ‘Ayañhi, deva, kumāro ussaṅkhapādo… ‘Ayañhi, deva, kumāro eṇijaṅgho… ‘Ayañhi, deva, kumāro ṭhitakova anonamanto ubhohi pāṇitalehi jaṇṇukāni parimasati [parāmasati (ka.)] parimajjati… ‘Ayañhi, deva, kumāro kosohitavatthaguyho… ‘Ayañhi, deva, kumāro suvaṇṇavaṇṇo kañcanasannibhattaco… ‘Ayañhi, deva, kumāro sukhumacchavī; sukhumattā chaviyā rajojallaṃ kāye na upalimpati [upalippati (syā.)] … ‘Ayañhi, deva, kumāro ekekalomo; ekekāni lomāni lomakūpesu jātāni… ‘Ayañhi, deva, kumāro uddhaggalomo; uddhaggāni lomāni jātāni nīlāni añjanavaṇṇāni kuṇḍalāvaṭṭāni dakkhiṇāvaṭṭakajātāni… ‘Ayañhi, deva, kumāro brahmujugatto… ‘Ayañhi, deva, kumāro sattussado… ‘Ayañhi, deva, kumāro sīhapubbaddhakāyo… ‘Ayañhi, deva, kumāro citantaraṃso [pitantaraṃso (syā.)] … ‘Ayañhi, deva, kumāro nigrodhaparimaṇḍalo yāvatakvassa kāyo tāvatakvassa byāmo, yāvatakvassa byāmo, tāvatakvassa kāyo… ‘Ayañhi, deva, kumāro samavaṭṭakkhandho… ‘Ayañhi, deva, kumāro rasaggasaggī… ‘Ayañhi, deva, kumāro sīhahanu… ‘Ayañhi, deva, kumāro cattālīsadanto… ‘Ayañhi, deva, kumāro samadanto… ‘Ayañhi, deva, kumāro aviraḷadanto… ‘Ayañhi, deva, kumāro susukkadāṭho… ‘Ayañhi, deva, kumāro pahūtajivho… ‘Ayañhi, deva, kumāro brahmassaro karavīkabhāṇī… ‘Ayañhi, deva, kumāro abhinīlanetto… ‘Ayañhi, deva, kumāro gopakhumo… Imassa, deva, kumārassa uṇṇā bhamukantare jātā odātā mudutūlasannibhā. Yampi imassa deva kumārassa uṇṇā bhamukantare jātā odātā mudutūlasannibhā, idampimassa mahāpurisassa mahāpurisalakkhaṇaṃ bhavati. ‘Ayañhi, deva, kumāro uṇhīsasīso. Yaṃ pāyaṃ, deva, kumāro uṇhīsasīso, idampissa mahāpurisassa mahāpurisalakkhaṇaṃ bhavati.",
      "english": "Indeed, O king, this prince has well-planted feet. That the prince has well-planted feet, O king, is a characteristic of a Great Man. Indeed, O king, on the soles of this prince's feet, wheels have appeared with a thousand spokes, complete with felloes and naves, perfect in every way. That on the soles of this prince's feet, wheels have appeared with a thousand spokes, complete with felloes and naves, perfect in every way, O king, is a characteristic of a Great Man. Indeed, O king, this prince has long heels. Indeed, O king, this prince has long fingers and toes. Indeed, O king, this prince has soft and tender hands and feet. Indeed, O king, this prince has webbed hands and feet. Indeed, O king, this prince has a high instep. Indeed, O king, this prince has antelope-like calves. Indeed, O king, this prince, while standing upright without bending over, can touch and rub his knees with both hands. Indeed, O king, this prince's private parts are concealed in a sheath. Indeed, O king, this prince is golden-skinned, with a complexion like refined gold. Indeed, O king, this prince has delicate skin; because of his delicate skin, dust and dirt do not cling to his body. Indeed, O king, this prince has one hair per pore; each hair grows singly from a pore. Indeed, O king, this prince has hairs growing upwards; the hairs grow upwards, dark blue like collyrium, curling in spirals to the right. Indeed, O king, this prince has a body as straight as Brahma's. Indeed, O king, this prince has seven convexities. Indeed, O king, this prince has the front part of his body like a lion's. Indeed, O king, this prince is well-filled between the shoulder blades. Indeed, O king, this prince has the girth of a banyan tree; his body is as tall as his arm-span, and his arm-span is as tall as his body. Indeed, O king, this prince has evenly rounded shoulders. Indeed, O king, this prince has the most excellent sense of taste. Indeed, O king, this prince has a jaw like a lion's. Indeed, O king, this prince has forty teeth. Indeed, O king, this prince has even teeth. Indeed, O king, this prince has teeth without gaps. Indeed, O king, this prince has very white fangs. Indeed, O king, this prince has a very long tongue. Indeed, O king, this prince has a voice like Brahma's, speaking with the tone of a karavīka bird. Indeed, O king, this prince has deep blue eyes. Indeed, O king, this prince has eyelashes like a cow's. On this prince, O king, a tuft of hair has appeared between his eyebrows, white and soft like cotton wool. That on this prince, O king, a tuft of hair has appeared between his eyebrows, white and soft like cotton wool, is a characteristic of a Great Man. Indeed, O king, this prince has a head like a turban. That the prince has a head like a turban, O king, is a characteristic of a Great Man.",
      "sinhala": "දේවයන් වහන්ස, මේ කුමාරයා මනාව පිහිටි පාද ඇති අයෙකි. දේවයන් වහන්ස, කුමාරයාගේ පාද මනාව පිහිටා තිබීම මහා පුරිස ලක්ෂණයකි. දේවයන් වහන්ස, මේ කුමාරයාගේ පාද යටි පතුල්වල දහසක් අර ඇති, නේමිවලින් යුක්ත, නාභිවලින් යුක්ත, සියලු ආකාරවලින් පරිපූර්ණ චක්‍ර සලකුණු පහළ වී ඇත. දේවයන් වහන්ස, මේ කුමාරයාගේ පාද යටි පතුල්වල දහසක් අර ඇති, නේමිවලින් යුක්ත, නාභිවලින් යුක්ත, සියලු ආකාරවලින් පරිපූර්ණ චක්‍ර සලකුණු පහළ වී තිබීම මහා පුරිස ලක්ෂණයකි. දේවයන් වහන්ස, මේ කුමාරයා දික් වූ විලුඹ ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා දිගු ඇඟිලි ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා මෘදු, සිහින් අත් පා ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා දැල් ආකාර වූ අත් පා ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා උස් වූ වළලුකර ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා මුවකුගේ මෙන් සිහින් කලවා ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා නැමීමකින් තොරව සිටගෙන දෙඅත්ලෙන් දණහිස් පිරිමැදිය හැකි අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා කෝෂයකින් වැසුණු රහස් අවයව ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා රන්වන් පැහැති, රන්වන් පැහැයෙන් බැබළෙන සමක් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා සියුම් සමක් ඇති අයෙකි. එම සියුම් සම නිසා දූවිලි හා මඩ ශරීරයේ නොගෑවෙයි. දේවයන් වහන්ස, මේ කුමාරයා එක රෝම කූපයකට එක බැගින් රෝම ඇති අයෙකි. එනම්, එක් එක් රෝම කූපයේ එක් රෝමයක් බැගින් හට ගෙන ඇත. දේවයන් වහන්ස, මේ කුමාරයාගේ රෝම ඉහළට නැඟී සිටියි. එම රෝම නිල් පැහැතිය. අඳුන් පැහැතිය. කැරලි ගැසී ඇත. දකුණට ඇඹරී හට ගෙන ඇත. දේවයන් වහන්ස, මේ කුමාරයා බ්‍රහ්මයා මෙන් ඍජු ශරීරයක් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා සත් උස් තැන් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා සිංහයෙකුගේ ඉදිරිපස සිරුරක් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා උරහිස් අතර මනා ලෙස පළල් වූ පෘෂ්ඨයක් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා නුග ගසක පරිමාව මෙන් වූ ශරීරයක් ඇති අයෙකි. එනම්, ඔහුගේ සිරුරේ උස ඔහුගේ බාහු විදාමයට සමාන වන අතර ඔහුගේ බාහු විදාමය ඔහුගේ සිරුරේ උසට සමාන වේ. දේවයන් වහන්ස, මේ කුමාරයා සම වටකුරු උරහිස් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා ප්‍රණීත රසයන් මැනවින් විඳීමේ හැකියාව ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා සිංහයෙකුගේ හනුවක් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා සතළිස් දත් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා සම දත් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා හිදැස් රහිත දත් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා ඉතා සුදු දළ දත් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා විශාල දිවක් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා බ්‍රහ්ම ස්වරයෙන් යුක්ත වූ, කරවීක පක්ෂියාගේ හඬ මෙන් මිහිරි හඬක් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා ඉතා නිල් පැහැති ඇස් ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයා ගවයෙකුගේ ඇස් මෙන් ඇස් පිහාටු ඇති අයෙකි. දේවයන් වහන්ස, මේ කුමාරයාගේ ඇස් දෙක අතර සුදු පැහැති, මෘදු, නූල් පුළුන් වැනි ඌර්ණ රෝමයක් හට ගෙන ඇත. දේවයන් වහන්ස, මේ කුමාරයාගේ ඇස් දෙක අතර සුදු පැහැති, මෘදු, නූල් පුළුන් වැනි ඌර්ණ රෝමයක් හට ගෙන තිබීම මහා පුරිස ලක්ෂණයකි. දේවයන් වහන්ස, මේ කුමාරයා උෂ්ණීෂයක් වැනි හිසක් ඇති අයෙකි. දේවයන් වහන්ස, කුමාරයාට උෂ්ණීෂයක් වැනි හිසක් පිහිටා තිබීම මහා පුරිස ලක්ෂණයකි.",
      "paliTitle": ""
    },
    {
      "number": 36,
      "pali": "‘Imehi kho ayaṃ, deva, kumāro dvattiṃsamahāpurisalakkhaṇehi samannāgato, yehi samannāgatassa mahāpurisassa dveva gatiyo bhavanti anaññā. Sace agāraṃ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni sattaratanāni bhavanti. Seyyathidaṃ – cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena [dhammena samena (syā.)] abhivijiya ajjhāvasati. Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭacchado’ti. ",
      "english": "This young prince, O divine one, possesses the thirty-two marks of a Great Man. A Great Man possessing these marks has only two possible destinies, and no other. If he remains in the household life, he will become a Wheel-Turning Monarch, a righteous King of Dhamma, conquering to the four corners of the earth, establishing stability in his realm, and possessing the seven treasures. These are his seven treasures: the Wheel Treasure, the Elephant Treasure, the Horse Treasure, the Jewel Treasure, the Woman Treasure, the Householder Treasure, and the Chief Advisor Treasure as the seventh. Furthermore, he will have over a thousand sons, brave and heroic in stature, who will subdue enemy armies. He will conquer and rule this earth, bounded by the ocean, not by force or weapons, but by righteousness.\n\nHowever, if he goes forth from the household life into homelessness, he will become an Arahant, a Fully Enlightened One, one who has removed the veil from the world.",
      "sinhala": "දේවයන් වහන්ස, මේ කුමාරයා මහපුරුෂ ලක්ෂණ තිස් දෙකකින් යුක්ත වේ. එබඳු ලක්ෂණවලින් හෙබි මහා පුරුෂයෙකුට ගති දෙකක් පමණක් ඇත, වෙනත් ගතියක් නැත.\n\nහෙතෙම ගිහිගෙයි වාසය කරන්නේ නම්, ධර්මිෂ්ඨ වූ, ධර්මරාජයා වූ, සිව්දිග ජයගත්, ජනපදවල ස්ථාවරත්වය ලබාසිටින, සප්ත රත්නයන්ගෙන් සමන්විත සක්විති රජෙක් වන්නේ ය. ඔහුට මේ සප්ත රත්නයන් හිමි වේ: එනම්, චක්ර රත්නය, හස්ති රත්නය, අශ්ව රත්නය, මාණික්ය රත්නය, ස්ත්රී රත්නය, ගෘහපති රත්නය සහ සත්වන පරිණායක රත්නයයි. දහසකට අධික වීර ශූර දරුවන් ඔහුට සිටින අතර ඔවුන් සතුරු සේනා මර්දනය කරන්නන් වේ. ඔහු දණ්ඩක් හෝ ආයුධයක් නොමැතිව, ධර්මයෙන් පමණක් සාගරය කෙළවර කොට ඇති මෙම පෘථිවිය ජයගෙන වාසය කරයි.\n\nයම් හෙයකින් ඔහු ගිහි ජීවිතයෙන් නික්ම අනගාරික ජීවිතයකට පැවිදි වන්නේ නම්, ලෝකයේ වැස්ම ඉවත් කළ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ නමක් බවට පත් වේ.",
      "paliTitle": ""
    },
    {
      "number": 37,
      "pali": "‘‘Atha kho, bhikkhave, bandhumā rājā nemitte brāhmaṇe ahatehi vatthehi acchādāpetvā [acchādetvā (syā.)] sabbakāmehi santappesi. Atha kho, bhikkhave, bandhumā rājā vipassissa kumārassa dhātiyo upaṭṭhāpesi. Aññā khīraṃ pāyenti, aññā nhāpenti, aññā dhārenti, aññā aṅkena pariharanti. Jātassa kho pana, bhikkhave, vipassissa kumārassa setacchattaṃ dhārayittha divā ceva rattiñca – ‘mā naṃ sītaṃ vā uṇhaṃ vā tiṇaṃ vā rajo vā ussāvo vā bādhayitthā’ti. Jāto kho pana, bhikkhave, vipassī kumāro bahuno janassa piyo ahosi manāpo. Seyyathāpi, bhikkhave, uppalaṃ vā padumaṃ vā puṇḍarīkaṃ vā bahuno janassa piyaṃ manāpaṃ; evameva kho, bhikkhave, vipassī kumāro bahuno janassa piyo ahosi manāpo. Svāssudaṃ aṅkeneva aṅkaṃ parihariyati.",
      "english": "Then, monks, King Bandhuma had the Brahmin soothsayers clothed in fresh garments and satisfied them with every kind of pleasure. He appointed nurses for Prince Vipassi: some gave him milk, some bathed him, some carried him, and some held him in their arms. And as soon as Prince Vipassi was born, a white parasol was held over him day and night, so that he would be protected from cold, heat, blades of grass, dust, and dew. The newborn Prince Vipassi was beloved and pleasing to many, just as a blue lotus, a red lotus, or a white lotus is beloved and pleasing. He was passed from lap to lap.",
      "sinhala": "“මහණෙනි, අනතුරුව බන්ධුමා රජතුමා නිමිති කියන බ්රාහ්මණයන්ට නොපැළඳි වස්ත්‍රවලින් සරසා, සියලු සැප සම්පත්වලින් සතුටු කළේය. මහණෙනි, බන්ධුමා රජතුමා විපස්සි කුමරු වෙනුවෙන් කිරි මව්වරුන් පත් කළේය. ඇතැම් කිරි මව්වරු කුමරුට කිරි පෙවූහ. ඇතැම් කිරි මව්වරු නාවා සෝදා පිරිසිදු කළහ. ඇතැම් කිරි මව්වරු කුමරුන් දරාගෙන සිටියහ. ඇතැම් කිරි මව්වරු උකුලෙහි තුරුළු කරගෙන රැක බලා ගත්හ. මහණෙනි, විපස්සි කුමරු උපන් දා පටන් ‘උන්වහන්සේට සීතල, උණුසුම, තණකොළ, දූවිලි, පිනි හෝ කිසිදු පීඩාවක් ඇති නොවේවා’ යන අදහසින් දිවා රෑ නොකඩවා සුදු ඡත්‍රයක් දරනු ලැබීය. මහණෙනි, විපස්සි කුමරු උපන්දා සිට බොහෝ දෙනාට ප්‍රියමනාප වූයේය. මහණෙනි, උපුල් මලක්, පියුම් මලක් හෝ නෙළුම් මලක් බොහෝ දෙනාට ප්‍රියමනාප වන්නා සේම විපස්සි කුමරුද බොහෝ දෙනාට ප්‍රියමනාප වූයේය. කුමරු උකුලෙන් උකුලට මාරු කරමින් රැක බලා ගනු ලැබීය.”",
      "paliTitle": "Vipassīsamaññā",
      "englishTitle": "Vipassi Buddha's designation",
      "sinhalaTitle": "විපස්සිසඤ්ඤා"
    },
    {
      "number": 38,
      "pali": "‘‘Jāto kho pana, bhikkhave, vipassī kumāro mañjussaro ca [kumāro brahmassaro mañjussaro ca (sī. ka.)] ahosi vaggussaro ca madhurassaro ca pemaniyassaro ca. Seyyathāpi, bhikkhave, himavante pabbate karavīkā nāma sakuṇajāti mañjussarā ca vaggussarā ca madhurassarā ca pemaniyassarā ca; evameva kho, bhikkhave, vipassī kumāro mañjussaro ca ahosi vaggussaro ca madhurassaro ca pemaniyassaro ca.",
      "english": "Monks, upon the birth of Prince Vipassī, he possessed a voice that was lovely, harmonious, sweet, and endearing. Just as, monks, in the Himalayan mountains there exists a species of bird called the karavīka, renowned for its lovely, harmonious, sweet, and endearing voice, so too did Prince Vipassī possess such qualities of voice.",
      "sinhala": "මහණෙනි, විපස්සී කුමරු උපත ලැබුවේ මියුරු, පැහැදිලි, මධුර, ප්‍රියමනාප හඬකින් යුක්තවයි. මහණෙනි, හිමාල කඳුකරයේ කරවීක නම් පක්ෂියෙකුගේ හඬ මෙන් මියුරු, පැහැදිලි, මධුර, ප්‍රියමනාප වූ හඬක් විපස්සී කුමරුට තිබුණේය.",
      "paliTitle": ""
    },
    {
      "number": 39,
      "pali": "‘‘Jātassa kho pana, bhikkhave, vipassissa kumārassa kammavipākajaṃ dibbacakkhu pāturahosi yena sudaṃ [yena dūraṃ (syā.)] samantā yojanaṃ passati divā ceva rattiñca.",
      "english": "Monks, when Prince Vipassi was born, a divine eye arose in him as a result of past karma. With it, he could see a league in every direction, both day and night.",
      "sinhala": "මහණෙනි, විපස්සි කුමාරයා උපන් කල්හි, කර්ම විපාක හේතුවෙන් දිව්යමය ඇසක් පහළ විය. එමඟින් දිවා රෑ දෙකෙහිම සෑම අතටම යොදුනක් දුර ඔහු දකියි.",
      "paliTitle": ""
    },
    {
      "number": 40,
      "pali": "‘‘Jāto kho pana, bhikkhave, vipassī kumāro animisanto pekkhati seyyathāpi devā tāvatiṃsā. ‘Animisanto kumāro pekkhatī’ti kho, bhikkhave [animisanto pekkhati, jātassa kho pana bhikkhave (ka.)], vipassissa kumārassa ‘vipassī vipassī’ tveva samaññā udapādi.",
      "english": "Monks, when the boy Vipassi was born, he gazed without blinking, like the gods of Tavatimsa. Because he gazed without blinking, monks, the name \"Vipassi Vipassi\" itself arose for the boy Vipassi.",
      "sinhala": "භික්ෂූනි, විපස්සී කුමාරයා උපන් අවස්ථාවේදී තව්තිසා දෙවියන් මෙන් ඇසිපිය නොහෙළා බැලුවේය. “කුමාරයා ඇසිපිය නොහෙළා බලයි” යන කාරණය නිසා, භික්ෂූනි, විපස්සී කුමාරයාට \"විපස්සී, විපස්සී\" යන නම භාවිතයට ඒමට එය හේතුවක් විය.",
      "paliTitle": ""
    },
    {
      "number": 41,
      "pali": "‘‘Atha kho, bhikkhave, bandhumā rājā atthakaraṇe [aṭṭa karaṇe (syā.)] nisinno vipassiṃ kumāraṃ aṅke nisīdāpetvā atthe anusāsati. Tatra sudaṃ, bhikkhave, vipassī kumāro pituaṅke nisinno viceyya viceyya atthe panāyati ñāyena [aṭṭe panāyati ñāṇena (syā.)]. Viceyya viceyya kumāro atthe panāyati ñāyenāti kho, bhikkhave, vipassissa kumārassa bhiyyosomattāya ‘vipassī vipassī’ tveva samaññā udapādi.",
      "english": "Then, monks, King Bandhuma, while seated in the court of justice, would have Prince Vipassi sit on his lap and instruct him in legal matters. And there, monks, Prince Vipassi, seated on his father's lap, would carefully examine and analyze those matters, deciding them with wisdom. Because the prince carefully examined and analyzed the legal matters, deciding them with wisdom, monks, the designation 'Vipassi, Vipassi' arose increasingly for Prince Vipassi.",
      "sinhala": "එකල්හි මහණෙනි, බන්දුමා රජු අත්ථකරණයෙහි වාඩි වී සිටියදී, විපස්සී කුමරු තම උකුළෙහි හිඳුවාගෙන කාරණා අනුශාසනා කරයි. එහි මහණෙනි, විපස්සී කුමරු පියාගේ උකුළෙහි හිඳගෙන, විමසා විමසා නුවණින් කාරණා අවබෝධ කරගනියි. මහණෙනි, කුමරු විමසා විමසා නුවණින් කාරණා අවබෝධ කරගන්නා බැවින්ම, විපස්සී කුමරුට ‘විපස්සී විපස්සී’ යන නාමය තව තවත් ප්රකට විය.",
      "paliTitle": ""
    },
    {
      "number": 42,
      "pali": "‘‘Atha kho, bhikkhave, bandhumā rājā vipassissa kumārassa tayo pāsāde kārāpesi, ekaṃ vassikaṃ ekaṃ hemantikaṃ ekaṃ gimhikaṃ; pañca kāmaguṇāni upaṭṭhāpesi. Tatra sudaṃ, bhikkhave, vipassī kumāro vassike pāsāde cattāro māse [vassike pāsāde vassike] nippurisehi tūriyehi paricārayamāno na heṭṭhāpāsādaṃ orohatī’’ti. Paṭhamabhāṇavāro.",
      "english": "Then, monks, King Bandhuma had three palaces built for Prince Vipassi: one for the rainy season, one for the cold season, and one for the hot season. He provided him with the five kinds of sensual pleasures.\n\nThere, monks, Prince Vipassi lived in the rainy season palace for four months, attended by musicians playing instruments without male involvement, and he did not descend from that palace.",
      "sinhala": "“මහණෙනි, එකල්හි බන්ධුමා රජතුමා විපස්සි කුමරුට වස්සාන, හේමන්ත, ගිම්හාන යන ඍතු සඳහා වූ ප්‍රාසාද තුනක් කරවීය. තවද පස්කම් සැප සම්පත් ද සපයන ලදී. එහිලා මහණෙනි, විපස්සි කුමරු වස්සාන ප්‍රාසාදයේ පුරුෂයන් රහිත තූර්ය වාදන වලින් පිරිවරා ගනිමින් මාස හතරක් පහළ මාලයට නොබැස වාසය කළේය.” පළමුවන භාණවාරයයි.",
      "paliTitle": ""
    },
    {
      "number": 43,
      "pali": "‘‘Atha kho, bhikkhave, vipassī kumāro bahūnaṃ vassānaṃ bahūnaṃ vassasatānaṃ bahūnaṃ vassasahassānaṃ accayena sārathiṃ āmantesi – ‘yojehi, samma sārathi, bhaddāni bhaddāni yānāni uyyānabhūmiṃ gacchāma subhūmidassanāyā’ti. ‘Evaṃ, devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā bhaddāni bhaddāni yānāni yojetvā vipassissa kumārassa paṭivedesi – ‘yuttāni kho te, deva, bhaddāni bhaddāni yānāni, yassa dāni kālaṃ maññasī’ti. Atha kho, bhikkhave, vipassī kumāro bhaddaṃ bhaddaṃ yānaṃ [bhadraṃ yānaṃ (syā.), bhaddaṃ yānaṃ (pī.) cattāro māse (sī. pī.)] abhiruhitvā bhaddehi bhaddehi yānehi uyyānabhūmiṃ niyyāsi.",
      "english": "Then, monks, after the passage of many years, many hundreds of years, many thousands of years, Prince Vipassī addressed his charioteer: \"Harness the finest chariots, good charioteer! Let us go to the pleasure garden to see the beautiful grounds.\"\n\n\"Yes, my lord,\" then, monks, the charioteer replied to Prince Vipassī. Having harnessed the finest chariots, he reported to the Prince: \"My lord, the finest chariots are ready for you. Now is the time to do as you see fit.\"\n\nThen, monks, Prince Vipassī mounted a fine chariot and set out for the pleasure garden in the splendid chariots.",
      "sinhala": "මහණෙනි, විපස්සි කුමාරයා බොහෝ වසර ගණනක්, බොහෝ සිය ගණන් වසර ගණනක්, බොහෝ දහස් ගණන් වසර ගණනක් ඇවෑමෙන් පසු සාරථිය අමතා මෙසේ කීවේය: 'සාරථිය, මිත්‍රය, අලංකාර රථ යොදවන්න. අපි මනරම් භූමි දර්ශන නැරඹීමට උයනට යමු.' 'එසේය, දේවයන් වහන්ස,' යැයි සාරථි විපස්සි කුමාරයාට පිළිවදන් දී අලංකාර රථ සූදානම් කොට, 'දේවයන් වහන්ස, ඔබ වෙනුවෙන් අලංකාර රථ සූදානම් කර ඇත. දැන් ඔබ කැමති වේලාවක ගමන් කළ හැකිය' යැයි දැන්වීය. ඉක්බිති මහණෙනි, විපස්සි කුමාරයා අලංකාර රථයක නැගී අලංකාර රථ පෙළ සමඟ උයන බලා පිටත්ව ගියේය.",
      "paliTitle": "Jiṇṇapuriso",
      "englishTitle": "The Old Man",
      "sinhalaTitle": "ජිණ්ණපුරිසො"
    },
    {
      "number": 44,
      "pali": "‘‘Addasā kho, bhikkhave, vipassī kumāro uyyānabhūmiṃ niyyanto purisaṃ jiṇṇaṃ gopānasivaṅkaṃ bhoggaṃ [bhaggaṃ (syā.)] daṇḍaparāyanaṃ pavedhamānaṃ gacchantaṃ āturaṃ gatayobbanaṃ. Disvā sārathiṃ āmantesi – ‘ayaṃ pana, samma sārathi, puriso kiṃkato? Kesāpissa na yathā aññesaṃ, kāyopissa na yathā aññesa’nti. ‘Eso kho, deva, jiṇṇo nāmā’ti. ‘Kiṃ paneso, samma sārathi, jiṇṇo nāmā’ti? ‘Eso kho, deva, jiṇṇo nāma. Na dāni tena ciraṃ jīvitabbaṃ bhavissatī’ti. ‘Kiṃ pana, samma sārathi, ahampi jarādhammo, jaraṃ anatīto’ti? ‘Tvañca, deva, mayañcamha sabbe jarādhammā, jaraṃ anatītā’ti. ‘Tena hi, samma sārathi, alaṃ dānajja uyyānabhūmiyā. Itova antepuraṃ paccaniyyāhī’ti. ‘Evaṃ, devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā tatova antepuraṃ paccaniyyāsi. Tatra sudaṃ, bhikkhave, vipassī kumāro antepuraṃ gato dukkhī dummano pajjhāyati – ‘dhiratthu kira, bho, jāti nāma, yatra hi nāma jātassa jarā paññāyissatī’ti!",
      "english": "Monks, as Prince Vipassī was going to the pleasure garden, he saw an old man, stooped over like a house gable, bent and leaning on a staff, trembling as he walked, afflicted and past his youth. Seeing him, he asked his charioteer, \"Friend charioteer, what has happened to this man? His hair and body are unlike those of others.\" \"My lord, he is called an old man.\" \"And what, friend charioteer, is an old man?\" \"My lord, that is an old man. He will not live much longer.\" \"Friend charioteer, am I also subject to old age, not beyond it?\" \"My lord, you and all of us are subject to old age, not beyond it.\" \"In that case, friend charioteer, enough of the pleasure garden for today. Turn back to the palace.\" \"Yes, my lord,\" the charioteer replied, and turned the chariot back to the palace. There, monks, Prince Vipassī, back in the palace, was unhappy and disheartened, reflecting, \"Alas, birth is truly wretched, if old age is the inevitable fate of the born!\"",
      "sinhala": "භික්ෂූනි, විපස්සි කුමාරයා උයනට යන අතරමගදී ගෝපානසයක් මෙන් වක් වූ, නැමුණු ශරීර ඇති, සැරයටියක ආධාරයෙන් වෙවුලමින් ගමන් කරන, දුර්වල වූ, යොවුන් විය ඉක්මවූ වයෝවෘද්ධ පුරුෂයෙකු දුටුවේය. දැක ඔහු සාරථිගෙන් මෙසේ ඇසුවේය: \"සාරථිය, මේ පුරුෂයාට කුමක් වීද? ඔහුගේ කෙස් අන් අයගේ මෙන් නොවන්නේ මන්ද? ඔහුගේ ශරීරයද අන් අයගේ මෙන් නොවේ.\" \"දේවයන් වහන්ස, ඔහු ජරාවට පත් වූ අයෙකි.\" \"සාරථිය, ජරාවට පත් වූවා යනු කුමක්ද?\" \"දේවයන් වහන්ස, ජරාවට පත් වූවා යනු ඔහුට වැඩි කලක් ජීවත් වීමට නොහැකි වීමයි.\" \"සාරථිය, මා ද ජරාවට පත්වන ස්වභාවය ඇත්තෙක්ද? ජරාවෙන් මිදුණු කෙනෙක් නොවෙම්ද?\" \"දේවයන් වහන්ස, ඔබත්, අපත් සියල්ලෝම ජරාවට පත්වන ස්වභාවය ඇත්තෝ වෙමු. ජරාවෙන් මිදුණු අයෙක් නැත.\" \"එසේ නම් සාරථිය, අද උයනට යාමෙන් පලක් නැත. මෙතැනින්ම අන්තඃපුරයට ආපසු යමු.\" භික්ෂූනි, සාරථියා විපස්සි කුමාරයාට \"එසේය, දේවයන් වහන්ස\" යැයි පවසා එතැනින්ම අන්තඃපුරයට ආපසු ගියේය. භික්ෂූනි, විපස්සි කුමාරයා අන්තඃපුරයට ගොස් දුකට හා කණගාටුවට පත්ව මෙසේ කල්පනා කළේය: \"ඉපදීම නිසා ජරාව අත්විඳීමට සිදුවනවා නම්, ජාතියට ධික් වේවා!\"",
      "paliTitle": ""
    },
    {
      "number": 45,
      "pali": "‘‘Atha kho, bhikkhave, bandhumā rājā sārathiṃ āmantāpetvā etadavoca – ‘kacci, samma sārathi, kumāro uyyānabhūmiyā abhiramittha? Kacci, samma sārathi, kumāro uyyānabhūmiyā attamano ahosī’ti? ‘Na kho, deva, kumāro uyyānabhūmiyā abhiramittha, na kho, deva, kumāro uyyānabhūmiyā attamano ahosī’ti. ‘Kiṃ pana, samma sārathi, addasa kumāro uyyānabhūmiṃ niyyanto’ti? ‘Addasā kho, deva, kumāro uyyānabhūmiṃ niyyanto purisaṃ jiṇṇaṃ gopānasivaṅkaṃ bhoggaṃ daṇḍaparāyanaṃ pavedhamānaṃ gacchantaṃ āturaṃ gatayobbanaṃ. Disvā maṃ etadavoca – ‘‘ayaṃ pana, samma sārathi, puriso kiṃkato, kesāpissa na yathā aññesaṃ, kāyopissa na yathā aññesa’’nti? ‘‘Eso kho, deva, jiṇṇo nāmā’’ti. ‘‘Kiṃ paneso, samma sārathi, jiṇṇo nāmā’’ti? ‘‘Eso kho, deva, jiṇṇo nāma na dāni tena ciraṃ jīvitabbaṃ bhavissatī’’ti. ‘‘Kiṃ pana, samma sārathi, ahampi jarādhammo, jaraṃ anatīto’’ti? ‘‘Tvañca, deva, mayañcamha sabbe jarādhammā, jaraṃ anatītā’’ti. ‘‘‘Tena hi, samma sārathi, alaṃ dānajja uyyānabhūmiyā, itova antepuraṃ paccaniyyāhī’’’ti. ‘‘Evaṃ, devā’’ti kho ahaṃ, deva, vipassissa kumārassa paṭissutvā tatova antepuraṃ paccaniyyāsiṃ. So kho, deva, kumāro antepuraṃ gato dukkhī dummano pajjhāyati – ‘‘dhiratthu kira bho jāti nāma, yatra hi nāma jātassa jarā paññāyissatī’’’ti. ",
      "english": "Then, monks, King Bandhuma summoned his charioteer and asked, \"Did the prince enjoy the pleasure garden, good charioteer? Was he pleased with the pleasure garden?\"\n\n\"No, lord,\" the charioteer replied, \"the prince did not enjoy the pleasure garden, nor was he pleased with it.\"\n\n\"But what did the prince see on the way to the pleasure garden, good charioteer?\" the king inquired.\n\n\"On the way to the pleasure garden, lord,\" the charioteer said, \"the prince saw an old man, bent over like a roof gable, frail, leaning on a staff, trembling as he walked, afflicted, his youth long gone. Seeing him, the prince asked me, 'What has happened to this man, good charioteer? His hair is not like that of others, nor is his body like that of others.’\"\n\n\" 'That, lord, is called an old man,' I replied.\"\n\n\" 'What is this 'old man,' good charioteer?' the prince asked.\"\n\n\" 'That, lord, is an old man, and he will not live much longer,' I explained.\"\n\n\" 'Then, good charioteer, am I also subject to old age, unable to escape old age?' the prince inquired.\"\n\n\" 'You, lord, and we all are subject to old age, unable to escape it,' I answered.\"\n\n\" 'In that case, good charioteer,' the prince said, 'enough of the pleasure garden for today; turn back to the palace from here.'\"\n\n\"So, lord,\" the charioteer concluded, \"having replied, 'Yes, lord,' to Prince Vipassi, I turned the chariot back to the palace from there. The prince, lord, upon returning to the palace, was distressed and sad, pondering, 'Indeed, woe to birth, since old age becomes apparent in one who is born!'\"",
      "sinhala": "‘‘එවිට, භික්ෂූනි, බන්ධුමා රජතුමා සාරථි අමතා මෙසේ කීවේය: ‘සාරථිය, කුමාරයා උයන බිමේ සතුටු වුණාද? සාරථිය, කුමාරයා උයන බිමේ සතුටින් සිටියාද?’ ‘දේවයන් වහන්ස, කුමාරයා උයන බිමේ සතුටු වූයේ නැත. දේවයන් වහන්ස, කුමාරයා උයන බිමේ සතුටින් සිටියේ ද නැත’යි කීවේය. ‘එසේ නම් සාරථිය, කුමාරයා උයන බිමට යන විට කුමක් දුටුවාද?’ ‘දේවයන් වහන්ස, කුමාරයා උයන බිමට යන විට, ගොපලු දණ්ඩක් මෙන් නැවී ගිය, දණ්ඩක් ආධාර කරගෙන වෙවුලමින් යන, රෝගී වූ, යොවුන් විය ඉක්මවූ මහලු පුරුෂයෙකු දුටුවේය. එය දුටු කුමාරයා මගෙන් මෙසේ ඇසුවේය: ‘‘සාරථිය, මේ පුරුෂයාට මොකද වෙලා තියෙන්නේ? ඔහුගේ හිසකෙස් අනිත් අයගේ වගේ නොවේ. ඔහුගේ ශරීරයත් අනිත් අයගේ වගේ නොවේනේ’’යි? ‘‘දේවයන් වහන්ස, ඔහු මහලු මිනිසෙකි’’යි මම කීවෙමි. ‘‘සාරථිය, මහලු මිනිසෙක් කියන්නේ මොන වගේ කෙනෙකුටද?’’යි කුමාරයා ඇසුවේය. ‘‘දේවයන් වහන්ස, මහලු මිනිසෙකුට වැඩි කාලයක් ජීවත් වෙන්න ලැබෙන්නේ නැහැ’’යි මම කීවෙමි. ‘‘සාරථිය, මමත් ජරාවට පත්වෙන ස්වභාවය තියෙන, ජරාවෙන් මිදෙන්න බැරි කෙනෙක්ද?’’යි කුමාරයා ඇසුවේය. ‘‘දේවයන් වහන්ස, ඔබත්, අපිත්, හැමෝම ජරාවට පත්වෙන ස්වභාවය තියෙන, ජරාවෙන් මිදෙන්න බැරි අයයි’’ මම කීවෙමි. ‘‘‘එහෙනම් සාරථිය, අද උයනට යන එක නවත්තමු. මෙතනින්ම ආපහු අන්තඃපුරයට යමු’’’යි කුමාරයා කීවේය. ‘දේවයන් වහන්ස, එහෙමයි’ කියා මම විපස්සී කුමරුට පිළිතුරු දී එතැනින්ම අන්තඃපුරයට ගියෙමි. දේවයන් වහන්ස, කුමාරයා අන්තඃපුරයට ගොස් දුකින් හා කම්පාවෙන් මෙසේ කල්පනා කළේය: ‘‘ඉපදීම කියන්නේ හරිම නරක දෙයක්. මොකද ඉපදුන කෙනෙකුට ජරාව පෙනෙන්න තියෙනවානේ!’’’",
      "paliTitle": ""
    },
    {
      "number": 46,
      "pali": "‘‘Atha kho, bhikkhave, bandhumassa rañño etadahosi – ‘Mā heva kho vipassī kumāro na rajjaṃ kāresi, mā heva vipassī kumāro agārasmā anagāriyaṃ pabbaji, mā heva nemittānaṃ brāhmaṇānaṃ saccaṃ assa vacana’nti. Atha kho, bhikkhave, bandhumā rājā vipassissa kumārassa bhiyyosomattāya pañca kāmaguṇāni upaṭṭhāpesi – ‘yathā vipassī kumāro rajjaṃ kareyya, yathā vipassī kumāro na agārasmā anagāriyaṃ pabbajeyya, yathā nemittānaṃ brāhmaṇānaṃ micchā assa vacana’nti. ‘‘Tatra sudaṃ, bhikkhave, vipassī kumāro pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Atha kho, bhikkhave, vipassī kumāro bahūnaṃ vassānaṃ…pe…",
      "english": "Then, monks, King Bandhuma had this thought: ‘I hope Prince Vipassi does not refuse to rule the kingdom, does not go forth from the household life to homelessness, and that the diviner brahmins' words prove untrue.’ So, monks, King Bandhuma provided even more of the five strands of sensual pleasure for Prince Vipassi, thinking: ‘May Prince Vipassi rule the kingdom, may he not go forth from the household life to homelessness, and may the diviner brahmins' words be proven false.’\n\nThere, monks, Prince Vipassi, fully provided with and immersed in the five strands of sensual pleasure, lived indulging in them. Then, monks, for many years, Prince Vipassi continued to indulge in those pleasures.",
      "sinhala": "එකල්හි, මහණෙනි, බන්ධුමා රජුට මෙසේ සිතුණි: ‘විපස්සී කුමරු රාජ්‍යය පාලනය නොකරයි දෝ, විපස්සී කුමරු ගිහිගෙයින් නික්ම අනගාරික දිවියට පැවිදි වෙයි දෝ, නිමිති කියන බ්‍රාහ්මණයන්ගේ වචනය සත්‍ය වෙයි දෝ’ යි. එකල්හි, මහණෙනි, බන්ධුමා රජු විපස්සී කුමරු උදෙසා තවදුරටත් අධිකව පස්කම් ගුණයන් පිළියෙල කළේය. ඒ මෙසේය: ‘විපස්සී කුමරු රාජ්‍යය පාලනය කරනු පිණිසත්, විපස්සී කුමරු ගිහිගෙයින් නික්ම අනගාරික දිවියට නොපැවිදි කරනු පිණිසත්, නිමිති කියන බ්‍රාහ්මණයන්ගේ වචනය බොරු කරනු පිණිසත්.’ එහිදී, මහණෙනි, විපස්සී කුමරු පස්කම් ගුණයන්ගෙන් මනා ලෙස යුක්තව, සමගි වී ඒවා පරිභෝග කළේය. එකල්හි, මහණෙනි, විපස්සී කුමරු බොහෝ වසර ගණනක්…පෙ…",
      "paliTitle": "Byādhitapuriso",
      "englishTitle": "The Sick Man",
      "sinhalaTitle": "ව්‍යාධිත පුරුෂයා"
    },
    {
      "number": 47,
      "pali": "‘‘Addasā kho, bhikkhave, vipassī kumāro uyyānabhūmiṃ niyyanto purisaṃ ābādhikaṃ dukkhitaṃ bāḷhagilānaṃ sake muttakarīse palipannaṃ semānaṃ [sayamānaṃ (syā. ka.)] aññehi vuṭṭhāpiyamānaṃ aññehi saṃvesiyamānaṃ. Disvā sārathiṃ āmantesi – ‘ayaṃ pana, samma sārathi, puriso kiṃkato? Akkhīnipissa na yathā aññesaṃ, saropissa [siropissa (syā.)] na yathā aññesa’nti? ‘Eso kho, deva, byādhito nāmā’ti. ‘Kiṃ paneso, samma sārathi, byādhito nāmā’ti? ‘Eso kho, deva, byādhito nāma appeva nāma tamhā ābādhā vuṭṭhaheyyā’ti. ‘Kiṃ pana, samma sārathi, ahampi byādhidhammo, byādhiṃ anatīto’ti? ‘Tvañca, deva, mayañcamha sabbe byādhidhammā, byādhiṃ anatītā’ti. ‘Tena hi, samma sārathi, alaṃ dānajja uyyānabhūmiyā, itova antepuraṃ paccaniyyāhī’ti. ‘Evaṃ devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā tatova antepuraṃ paccaniyyāsi. Tatra sudaṃ, bhikkhave, vipassī kumāro antepuraṃ gato dukkhī dummano pajjhāyati – ‘dhiratthu kira bho jāti nāma, yatra hi nāma jātassa jarā paññāyissati, byādhi paññāyissatī’ti.",
      "english": "Monks, Prince Vipassī, on his way to the pleasure garden, saw a man who was afflicted, suffering, and gravely ill. He was lying in his own urine and feces, being helped up by some and laid down by others. Seeing this, he asked his charioteer, “Friend charioteer, what has befallen this man? His eyes and voice are unlike those of others.” “My lord, he is what is called a sick person.” “But friend charioteer, what is a ‘sick person’?” “My lord, a ‘sick person’ is one who may perhaps recover from this affliction.” “Friend charioteer, am I also subject to sickness, not exempt from it?” “You, my lord, and we all are subject to sickness, not exempt from it.” “Then, friend charioteer, enough of the pleasure garden today; let us return to the palace from here.” “As you wish, my lord,” the charioteer replied to Prince Vipassī, and turned back to the palace. There, monks, Prince Vipassī, having returned to the palace, was sorrowful and disheartened, reflecting, “Truly wretched is birth, if old age and sickness become apparent to one who is born!”",
      "sinhala": "භික්ෂූනි, විපස්සී කුමාරයා උයන බලා යන අතරතුර, රෝගාතුර වූ, දුක්ඛිත වූ, දැඩි ලෙස ගිලන් වූ, තමන්ගේම මුත්ර හා මළපහෙහි වැටී සිටි, සයනය කරමින් සිටි, අන්යයන් විසින් ඔසවනු ලබන, අන්යයන් විසින් සයනය කරවනු ලබන පුරුෂයෙකු දුටුවේය. දැක, ඔහු සාරථි අමතා මෙසේ ඇසීය: “ඇවැත් සාරථිය, මේ පුරුෂයාට කුමක් වීද? ඔහුගේ ඇස් අන් අයගේ ඇස් මෙන් නොවේ. ඔහුගේ හිස ද අන් අයගේ හිස් මෙන් නොවේද?” සාරථි පිළිතුරු දුන්නේ, “දේවයන් වහන්ස, මොහු රෝගියෙකි” කියාය. “ඇවැත් සාරථිය, රෝගියෙක් යනු කුමක්ද?” විපස්සී කුමාරයා ඇසීය. සාරථි කීවේ, “දේවයන් වහන්ස, රෝගියෙක් යනු, සමහරවිට මෙම රෝගයෙන් සුවය ලැබීමට හැකි අයෙකි” කියාය. “ඇවැත් සාරථිය, මාත් රෝගයට යටත් වූ අයෙක්ද? රෝගයෙන් මිදිය නොහැකි අයෙක්ද?” කුමාරයා විමසීය. “දේවයන් වහන්ස, ඔබත්, අපත් සියල්ලෝම රෝගයට යටත් වූවෝ වෙමු. රෝගයෙන් මිදිය නොහැකි අය වෙමු”යි සාරථි පිළිතුරු දුන්නේය. “එසේ නම්, ඇවැත් සාරථිය, අද උයනට යාමෙන් වැඩක් නැත. මෙතැනින්ම අන්තඃපුරයට ආපසු යමු”යි විපස්සී කුමාරයා පැවසීය. භික්ෂූනි, සාරථි, “එසේය, දේවයන් වහන්ස” යි විපස්සී කුමාරයාට පිළිතුරු දී එතැනින්ම අන්තඃපුරයට ආපසු ගියේය. භික්ෂූනි, විපස්සී කුමාරයා අන්තඃපුරයට ගොස් දුකින් හා කම්පාවෙන් මෙසේ කල්පනා කළේය: “ජාතිය කෙතරම් ශෝචනීයද! මක්නිසාද යත්, ඉපදුණු කල්හි ජරාවත්, ව්යාධියත් පෙනෙන්නේය.”",
      "paliTitle": ""
    },
    {
      "number": 48,
      "pali": "‘‘Atha kho, bhikkhave, bandhumā rājā sārathiṃ āmantāpetvā etadavoca – ‘kacci, samma sārathi, kumāro uyyānabhūmiyā abhiramittha, kacci, samma sārathi, kumāro uyyānabhūmiyā attamano ahosī’ti? ‘Na kho, deva, kumāro uyyānabhūmiyā abhiramittha, na kho, deva, kumāro uyyānabhūmiyā attamano ahosī’ti. ‘Kiṃ pana, samma sārathi, addasa kumāro uyyānabhūmiṃ niyyanto’ti? ‘Addasā kho, deva, kumāro uyyānabhūmiṃ niyyanto purisaṃ ābādhikaṃ dukkhitaṃ bāḷhagilānaṃ sake muttakarīse palipannaṃ semānaṃ aññehi vuṭṭhāpiyamānaṃ aññehi saṃvesiyamānaṃ. Disvā maṃ etadavoca – ‘‘ayaṃ pana, samma sārathi, puriso kiṃkato, akkhīnipissa na yathā aññesaṃ, saropissa na yathā aññesa’’nti? ‘‘Eso kho, deva, byādhito nāmā’’ti. ‘‘Kiṃ paneso, samma sārathi, byādhito nāmā’’ti? ‘‘Eso kho, deva, byādhito nāma appeva nāma tamhā ābādhā vuṭṭhaheyyā’’ti. ‘‘Kiṃ pana, samma sārathi, ahampi byādhidhammo, byādhiṃ anatīto’’ti? ‘‘Tvañca, deva, mayañcamha sabbe byādhidhammā, byādhiṃ anatītā’’ti. ‘‘Tena hi, samma sārathi, alaṃ dānajja uyyānabhūmiyā, itova antepuraṃ paccaniyyāhī’’ti. ‘‘Evaṃ, devā’’ti kho ahaṃ, deva, vipassissa kumārassa paṭissutvā tatova antepuraṃ paccaniyyāsiṃ. So kho, deva, kumāro antepuraṃ gato dukkhī dummano pajjhāyati – ‘‘‘dhiratthu kira bho jāti nāma, yatra hi nāma jātassa jarā paññāyissati, byādhi paññāyissatī’’’ti.",
      "english": "Then, monks, King Bandhuma summoned his charioteer and asked him, \"Tell me, good charioteer, did the prince enjoy the pleasure garden? Tell me, good charioteer, was the prince pleased with the pleasure garden?\"\n\n\"No, sire, the prince did not enjoy the pleasure garden; no, sire, the prince was not pleased with the pleasure garden.\"\n\n\"Well then, good charioteer, what did the prince see on the way to the pleasure garden?\"\n\n\"Sire, on the way to the pleasure garden, the prince saw a man who was afflicted, suffering, and gravely ill. He was lying in his own urine and feces, being lifted up and laid down by others. Seeing this, he asked me, 'Good charioteer, what is the matter with this man? His eyes and voice are different from those of others.'\"\n\n\"'That, sire, is called a sick person.'\"\n\n\"'What is a sick person, good charioteer?'\"\n\n\"'A sick person, sire, is someone who may or may not recover from their illness.'\"\n\n\"'What, good charioteer, am I also subject to sickness, not having transcended it?'\"\n\n\"'You, sire, and all of us, are subject to sickness; we have not transcended it.'\"\n\n\"'In that case, good charioteer, enough of the pleasure garden for today. Turn back to the palace from here.'\"\n\n\"'Yes, sire,' I replied to Prince Vipassi and turned back to the palace. Once back at the palace, sire, the prince, sorrowful and dejected, reflected, 'Alas for birth! Where there is birth, there will be old age and sickness!'\"",
      "sinhala": "භික්ෂූනි, එකල්හි බන්ධුමා රජතුමා සාරථි කැඳවා මෙසේ ඇසීය: \"සාරථි, කුමාරයා උද්‍යාන භූමියෙහි සතුටු වූවාද? උද්‍යාන භූමියෙහි සතුටක් ලැබුවාද?\". \"දේවයන් වහන්ස, කුමාරයා උද්‍යාන භූමියෙහි සතුටු වූයේ නැත. උද්‍යාන භූමියෙහි සතුටක් ලැබුවේද නැත\" යනුවෙන් සාරථි පිළිතුරු දුන්නේය. \"එසේ නම්, කුමාරයා උද්‍යාන භූමියට යන අතරමගදී කුමක් දුටුවාද?\" රජතුමා විමසීය. \"දේවයන් වහන්ස, කුමාරයා උද්‍යාන භූමියට යන අතරමගදී, තමාගේම මූත්‍ර හා අසූචි වල වැටී, සැතපී සිටින, අනුන් විසින් ඔසවනු ලබන, අනුන් විසින් සයනය කරවනු ලබන, රෝගී වූ, දුක්ඛිත වූ, ඉතා අසාධ්‍ය වූ මිනිසෙකු දුටුවේය. එය දුටු කුමාරයා මාගෙන් 'සාරථි, මොහුට කුමක් වීද? මොහුගේ ඇස් සහ හඬ අන් අයගේ මෙන් නොවන්නේ මන්ද?' යැයි ඇසීය\". \"දේවයන් වහන්ස, ඔහු රෝගියෙකි\" මා පිළිතුරු දුනිමි. \"රෝගියෙක් යනු කුමක්ද?\" කුමාරයා ඇසීය. \"දේවයන් වහන්ස, රෝගියෙක් යනු, සමහරවිට රෝගයෙන් සුවය ලැබීමට හැකි කෙනෙකි\" මම කීවෙමි. \"සාරථි, මාත් රෝගයට යටත් වන ස්වභාවයෙන් යුතුද? මම රෝගයෙන් මිදුණු කෙනෙක් නොවෙම්ද?\" කුමාරයා විමසීය. \"දේවයන් වහන්ස, ඔබත්, අප සියල්ලන්මත් රෝගයට යටත් වන ස්වභාවයෙන් යුක්ත වෙමු. රෝගයෙන් මිදුණු අය නොවෙමු\" මම පැවසුවෙමි. \"එසේ නම් සාරථි, අද උද්‍යාන භූමියට යාමෙන් වැඩක් නැත. මෙතැනින්ම අන්තඃපුරයට ආපසු යමු\" කුමාරයා කීවේය. \"එසේය, දේවයන් වහන්ස\" කියා මම විපස්සී කුමාරයාට පිළිතුරු දී එතැනින්ම අන්තඃපුරයට ආපසු ගියෙමි. දේවයන් වහන්ස, කුමාරයා අන්තඃපුරයට ගොස් දුකට පත්ව, කනස්සල්ලෙන් මෙසේ කල්පනා කළේය: \"උපත යනු හෙළා දැකිය යුත්තකි. මක්නිසාද යත්, උපන් කෙනෙකුට ජරාව සහ ව්‍යාධිය ඇති වන්නේය\".",
      "paliTitle": ""
    },
    {
      "number": 49,
      "pali": "‘‘Atha kho, bhikkhave, bandhumassa rañño etadahosi – ‘mā heva kho vipassī kumāro na rajjaṃ kāresi, mā heva vipassī kumāro agārasmā anagāriyaṃ pabbaji, mā heva nemittānaṃ brāhmaṇānaṃ saccaṃ assa vacana’nti. Atha kho, bhikkhave, bandhumā rājā vipassissa kumārassa bhiyyosomattāya pañca kāmaguṇāni upaṭṭhāpesi – ‘yathā vipassī kumāro rajjaṃ kareyya, yathā vipassī kumāro na agārasmā anagāriyaṃ pabbajeyya, yathā nemittānaṃ brāhmaṇānaṃ micchā assa vacana’nti. ‘‘Tatra sudaṃ, bhikkhave, vipassī kumāro pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Atha kho, bhikkhave, vipassī kumāro bahūnaṃ vassānaṃ…pe…",
      "english": "Now, bhikkhus, this thought occurred to King Bandhuma: \"I must prevent Prince Vipassi from failing to rule, from going forth from the householder's life into homelessness, and from fulfilling the diviner brahmins' prediction.\"\n\nSo, bhikkhus, King Bandhuma provided Prince Vipassi with even more of the five strands of sensual pleasure, thinking, \"This will ensure that Prince Vipassi rules the kingdom, that he does not go forth from the householder's life into homelessness, and that the diviner brahmins' prediction proves false.\"\n\nThere, bhikkhus, Prince Vipassi lived immersed in, fully endowed and equipped with, the five strands of sensual pleasure. Now, bhikkhus, many years passed for Prince Vipassi.",
      "sinhala": "මහණෙනි, එකල බන්ධුම රජුට මෙවැනි සැකයක් ඇති විය: ‘විපස්සී කුමාරයා රාජ්‍යය නොකරනු ඇතැයි ද, විපස්සී කුමාරයා ගිහි ගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වනු ඇතැයි ද, නිමිති කියන බ්‍රාහ්මණවරුන්ගේ වචනය සත්‍ය වනු ඇතැයි ද.’\n\nමහණෙනි, බන්ධුම රජු විපස්සී කුමාරයා රාජ්‍යය කිරීමටත්, ගිහි ජීවිතයෙන් නික්ම අනගාරික ජීවිතයට නොපැමිණීමටත්, නිමිති කියන බ්‍රාහ්මණවරුන්ගේ වචනය අසත්‍ය කිරීමටත්, ඔහුට පස්කම් සැපයන් වඩාත් අධික ලෙස සපයා දුන්නේය.\n\nමහණෙනි, විපස්සී කුමාරයා එහිදී පස්කම් සැපයන්ගෙන් සමන්විතව ඒවා පරිභෝග කරමින් වාසය කළේය. මහණෙනි, විපස්සී කුමාරයා බොහෝ වසර ගණනක්…",
      "paliTitle": "Kālaṅkatapuriso",
      "englishTitle": "The One Who Has Completed His Time",
      "sinhalaTitle": "කාලංකතපුරිසො"
    },
    {
      "number": 50,
      "pali": "‘‘Addasā kho, bhikkhave, vipassī kumāro uyyānabhūmiṃ niyyanto mahājanakāyaṃ sannipatitaṃ nānārattānañca dussānaṃ vilātaṃ kayiramānaṃ. Disvā sārathiṃ āmantesi – ‘kiṃ nu kho, so, samma sārathi, mahājanakāyo sannipatito nānārattānañca dussānaṃ vilātaṃ kayiratī’ti? ‘Eso kho, deva, kālaṅkato nāmā’ti. ‘Tena hi, samma sārathi, yena so kālaṅkato tena rathaṃ pesehī’ti. ‘Evaṃ, devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā yena so kālaṅkato tena rathaṃ pesesi. Addasā kho, bhikkhave, vipassī kumāro petaṃ kālaṅkataṃ, disvā sārathiṃ āmantesi – ‘kiṃ panāyaṃ, samma sārathi, kālaṅkato nāmā’ti? ‘Eso kho, deva, kālaṅkato nāma. Na dāni taṃ dakkhanti mātā vā pitā vā aññe vā ñātisālohitā, sopi na dakkhissati mātaraṃ vā pitaraṃ vā aññe vā ñātisālohite’ti. ‘Kiṃ pana, samma sārathi, ahampi maraṇadhammo maraṇaṃ anatīto; mampi na dakkhanti devo vā devī vā aññe vā ñātisālohitā; ahampi na dakkhissāmi devaṃ vā deviṃ vā aññe vā ñātisālohite’ti? ‘Tvañca, deva, mayañcamha sabbe maraṇadhammā maraṇaṃ anatītā; tampi na dakkhanti devo vā devī vā aññe vā ñātisālohitā; tvampi na dakkhissasi devaṃ vā deviṃ vā aññe vā ñātisālohite’ti. ‘Tena hi, samma sārathi, alaṃ dānajja uyyānabhūmiyā, itova antepuraṃ paccaniyyāhī’ti. ‘Evaṃ, devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā tatova antepuraṃ paccaniyyāsi. Tatra sudaṃ, bhikkhave, vipassī kumāro antepuraṃ gato dukkhī dummano pajjhāyati – ‘dhiratthu kira, bho, jāti nāma, yatra hi nāma jātassa jarā paññāyissati, byādhi paññāyissati, maraṇaṃ paññāyissatī’ti.",
      "english": "Monks, as Prince Vipassī was proceeding to the pleasure garden, he saw a large crowd gathered, and colorful cloths were being prepared as decorations. Seeing this, he asked his charioteer, \"Good charioteer, why has this large crowd gathered, and why are these colorful cloths being prepared?\"\n\n\"Your Highness,\" the charioteer replied, \"that is someone who has died.\"\n\n\"Then, good charioteer, drive the chariot to where this deceased person is.\"\n\n\"As you wish, Your Highness,\" the charioteer replied, and drove the chariot to where the deceased person was.\n\nMonks, Prince Vipassī saw the deceased person and asked his charioteer, \"What does it mean to be 'deceased'?\"\n\n\"Your Highness, this is called 'deceased.' Now, neither his mother nor his father nor any other relatives will see him, and he will not see his mother, his father, or any other relatives.\"\n\n\"Good charioteer,\" Prince Vipassī asked, \"am I also subject to death, unable to escape it? Will neither my father the King, nor my mother the Queen, nor any other relatives see me again, and will I not see them?\"\n\n\"Your Highness, you and I, we are all subject to death, unable to escape it. Neither your father the King, nor your mother the Queen, nor any other relatives will see you again, and you will not see them.\"\n\n\"In that case, good charioteer, enough of the pleasure garden for today. Turn the chariot back to the palace.\"\n\n\"As you wish, Your Highness,\" the charioteer replied, and turned the chariot back to the palace.\n\nThere, monks, Prince Vipassī, having returned to the palace, was sorrowful and depressed, reflecting, \"Alas, what a wretched thing is birth, that where there is birth, old age, sickness, and death will become evident!\"",
      "sinhala": "භික්ෂූණී, විපස්සී කුමාරයා උයන බිමට යන අතරමග මහත් ජනකායක් රැස්ව සිටිනුත්, නානා වර්ණ වස්ත්ර විහිදුවා ඇති අයුරුත් දුටුවේ ය. දැක සාරථි අමතා මෙසේ ඇසී ය: 'මිත්ර සාරථිය, මේ මහජනකාය රැස්ව සිටින්නේ කුමක් නිසා ද? නානා වර්ණ වස්ත්ර එලා ඇත්තේ කුමක් නිසා ද?'\n\n'දේවයන් වහන්ස, මොහු මියගිය පුද්ගලයෙකි.' සාරථි පිළිවදන් දුන්නේ ය.\n\n'එසේ නම්, මිත්ර සාරථිය, රථය මියගිය පුද්ගලයා සිටින තැනට පදවන්න.' කුමාරයා කීවේ ය.\n\nභික්ෂූණී, සාරථි 'එසේ ය, දේවයන් වහන්ස' යි පවසා රථය මියගිය පුද්ගලයා සිටින තැනට පැදවී ය. භික්ෂූණී, විපස්සී කුමාරයා මියගිය පුද්ගලයා දුටුවේ ය. දැක සාරථිගෙන් මෙසේ විමසී ය: 'මිත්ර සාරථිය, මියගිය පුද්ගලයා යනු කවරෙක් ද?'\n\n'දේවයන් වහන්ස, මොහු මියගිය පුද්ගලයෙකි. මව හෝ පියා හෝ අනෙකුත් ඥාති හිතමිතුරන් හෝ දැන් මොහුව නො දකිති. ඔහු ද මව හෝ පියා හෝ අනෙකුත් ඥාති හිතමිතුරන් හෝ නො දකී.' සාරථි පැවසී ය.\n\n'මිත්ර සාරථිය, එසේ නම් මාත් මරණයට යටත් වූ, මරණය ඉක්මවා නො ගිය කෙනෙක් ද? දෙවියන් හෝ දේවතාවියන් හෝ අනෙකුත් ඥාති හිතමිතුරන් හෝ මාත් නො දකී ද? මාත් දෙවියන් හෝ දේවතාවියන් හෝ අනෙකුත් ඥාති හිතමිතුරන් හෝ නො දකිම් ද?' කුමාරයා විමසී ය.\n\n'දේවයන් වහන්ස, ඔබත්, අපිත් සියල්ලෝ ම මරණයට යටත් වූ, මරණය ඉක්මවා නො ගිය අය වෙමු. ඔබවත් දෙවියන් හෝ දේවතාවියන් හෝ අනෙකුත් ඥාති හිතමිතුරන් හෝ නො දකිති. ඔබ ද දෙවියන් හෝ දේවතාවියන් හෝ අනෙකුත් ඥාති හිතමිතුරන් හෝ නො දකින්නෙහි ය.' සාරථි කීවේ ය.\n\n'එසේ නම්, මිත්ර සාරථිය, අද උයනට ගොස් වැඩක් නැත. මෙතැනින් ම අන්තඃපුරයට ආපසු යමු.' කුමාරයා පැවසී ය.\n\nභික්ෂූණී, සාරථි 'එසේ ය, දේවයන් වහන්ස' යි පිළිතුරු දී එතැනින් ම අන්තඃපුරයට ආපසු ගියේ ය. භික්ෂූණී, විපස්සී කුමාරයා අන්තඃපුරයට ගොස් දුකින්, කලකිරීමෙන් මෙසේ කල්පනා කළේ ය: 'අහෝ! ඉපදීම හෙළා දැකිය යුත්තකි. මන්ද යත්, ඉපදුණු කෙනෙකුට ජරාව, ව්යාධිය, මරණය යන මේවා ඇති වන්නේ ය.'",
      "paliTitle": ""
    },
    {
      "number": 51,
      "pali": "‘‘Atha kho, bhikkhave, bandhumā rājā sārathiṃ āmantāpetvā etadavoca – ‘kacci, samma sārathi, kumāro uyyānabhūmiyā abhiramittha, kacci, samma sārathi, kumāro uyyānabhūmiyā attamano ahosī’ti? ‘Na kho, deva, kumāro uyyānabhūmiyā abhiramittha, na kho, deva, kumāro uyyānabhūmiyā attamano ahosī’ti. ‘Kiṃ pana, samma sārathi, addasa kumāro uyyānabhūmiṃ niyyanto’ti? ‘Addasā kho, deva, kumāro uyyānabhūmiṃ niyyanto mahājanakāyaṃ sannipatitaṃ nānārattānañca dussānaṃ vilātaṃ kayiramānaṃ. Disvā maṃ etadavoca – ‘‘kiṃ nu kho, so, samma sārathi, mahājanakāyo sannipatito nānārattānañca dussānaṃ vilātaṃ kayiratī’’ti? ‘‘Eso kho, deva, kālaṅkato nāmā’’ti. ‘‘Tena hi, samma sārathi, yena so kālaṅkato tena rathaṃ pesehī’’ti. ‘‘Evaṃ devā’’ti kho ahaṃ, deva, vipassissa kumārassa paṭissutvā yena so kālaṅkato tena rathaṃ pesesiṃ. Addasā kho, deva, kumāro petaṃ kālaṅkataṃ, disvā maṃ etadavoca – ‘‘kiṃ panāyaṃ, samma sārathi, kālaṅkato nāmā’’ti? ‘‘Eso kho, deva, kālaṅkato nāma. Na dāni taṃ dakkhanti mātā vā pitā vā aññe vā ñātisālohitā, sopi na dakkhissati mātaraṃ vā pitaraṃ vā aññe vā ñātisālohite’’ti. ‘‘Kiṃ pana, samma sārathi, ahampi maraṇadhammo maraṇaṃ anatīto; mampi na dakkhanti devo vā devī vā aññe vā ñātisālohitā; ahampi na dakkhissāmi devaṃ vā deviṃ vā aññe vā ñātisālohite’’ti? ‘‘Tvañca, deva, mayañcamha sabbe maraṇadhammā maraṇaṃ anatītā; tampi na dakkhanti devo vā devī vā aññe vā ñātisālohitā, tvampi na dakkhissasi devaṃ vā deviṃ vā aññe vā ñātisālohite’’ti. ‘‘Tena hi, samma sārathi, alaṃ dānajja uyyānabhūmiyā, itova antepuraṃ paccaniyyāhī’ti. ‘‘‘Evaṃ, devā’’ti kho ahaṃ, deva, vipassissa kumārassa paṭissutvā tatova antepuraṃ paccaniyyāsiṃ. So kho, deva, kumāro antepuraṃ gato dukkhī dummano pajjhāyati – ‘‘dhiratthu kira bho jāti nāma, yatra hi nāma jātassa jarā paññāyissati, byādhi paññāyissati, maraṇaṃ paññāyissatī’’’ti.",
      "english": "Then, monks, King Bandhumā had his charioteer summoned and said to him: ‘I hope, good charioteer, the prince enjoyed the park? I hope, good charioteer, the prince was pleased in the park?’ ‘No, your Majesty, the prince did not enjoy the park, nor was the prince pleased in the park.’ ‘Then what, good charioteer, did the prince see while going out to the park?’ ‘Your Majesty, while going out to the park, the prince saw a large gathering of people, and cloths of various colors being laid out. Having seen this, he said to me: ‘‘What, good charioteer, is this large gathering of people doing, laying out cloths of various colors?’’ ‘‘That, your Majesty, is what is called a dead person.’’ ‘‘In that case, good charioteer, direct the chariot to where that dead person is.’’ ‘‘Yes, your Majesty,’’ I replied to Prince Vipassī, and directed the chariot to where that dead person was. Your Majesty, the prince then saw that dead person, and having seen him, he said to me: ‘‘What, good charioteer, is this person called who is dead?’’ ‘‘That, your Majesty, is called a dead person. Now his mother or father or other relatives will not see him, nor will he see his mother or father or other relatives.’’ ‘‘But good charioteer, am I also subject to death, not having overcome death? Will the king or queen or other relatives not see me? And will I not see the king or queen or other relatives?’’ ‘‘You, your Majesty, and we all are subject to death, not having overcome death. Neither will the king or queen or other relatives see you, nor will you see the king or queen or other relatives.’’ ‘‘In that case, good charioteer, enough of the park for today. Let us return to the palace from here.’’ ‘‘Yes, your Majesty,’’ I replied to Prince Vipassī, and from there I returned to the palace. Having returned to the palace, your Majesty, the prince was sorrowful and dejected, pondering: ‘‘Alas for birth, for it is because of birth that old age will appear, illness will appear, and death will appear!’’",
      "sinhala": "එවිට, භික්ෂූන් වහන්ස, බන්ධුමා රජතුමා තම රියැදුරු කැඳවා මෙසේ ඇසුවේය: \"රියැදුරුතුමනි, කුමාරයා උයනේ සතුටු වුණාද? රියැදුරුතුමනි, කුමාරයා උයනට ගොස් සතුටට පත්වුණාද?\"\n\n\"දේවයන් වහන්ස, කුමාරයා උයනේ සතුටු වූයේ නැහැ. දේවයන් වහන්ස, කුමාරයා උයනට ගොස් සතුටට පත්වුණේත් නැහැ.\"\n\n\"එසේ නම්, රියැදුරුතුමනි, කුමාරයා උයනට යන අතරමගදී මොනවද දුටුවේ?\"\n\n\"දේවයන් වහන්ස, කුමාරයා උයනට යන අතරමගදී රැස්ව සිටින විශාල පිරිසක් සහ නානා වර්ණ වස්ත්‍ර අතුරා සකස් කරමින් සිටිනු දුටුවා. දැකලා මට මෙහෙම කිව්වා: 'රියැදුරුතුමනි, මේ රැස්වෙලා ඉන්න විශාල පිරිස මොකටද? මේ නානා වර්ණ වස්ත්‍ර අතුරන්නේ කුමක් කරන්නද?' කියලා ඇසුවා.\"\n\n\"එවිට මම, 'දේවයන් වහන්ස, ඒ මියගිය කෙනෙක් වෙනුවෙන්' කීවෙමි.\"\n\n\"එවිට කුමාරයා, 'එසේ නම්, රියැදුරුතුමනි, රථය ඒ මියගිය පුද්ගලයා ඉන්න තැනට යොමු කරන්න' කීවා.\"\n\n\" 'එසේය, දේවයන් වහන්ස' කියා මම විපස්සි කුමාරයාට පිළිතුරු දී, රථය ඒ මියගිය පුද්ගලයා සිටින තැනට යොමු කළා. දේවයන් වහන්ස, කුමාරයා ඒ මියගිය පුද්ගලයා දැක්කා. දැකලා මගෙන් මෙහෙම ඇහුවා: 'රියැදුරුතුමනි, මේ මියගිය පුද්ගලයා කියන්නේ මොකක්ද?' \"\n\n\"මම කිව්වා, 'දේවයන් වහන්ස, මේ මියගිය පුද්ගලයෙක්. දැන් එයාගේ අම්මා, තාත්තා, නැත්නම් වෙනත් ඥාතීන් එයා දකින්නේ නැහැ. එයාටත් අම්මාව, තාත්තාව, නැත්නම් වෙනත් ඥාතීන්ව දකින්න ලැබෙන්නේ නැහැ' කියලා.\"\n\n\"එතකොට කුමාරයා ඇහුවා, 'රියැදුරුතුමනි, මාත් මරණයට යටත් වෙන කෙනෙක්ද? මරණයෙන් මිදෙන්න බැරි කෙනෙක්ද? මාවත් රජතුමා, බිසව, නැත්නම් වෙනත් ඥාතීන් දකින්නේ නැද්ද? මටත් රජතුමාව, බිසවව, නැත්නම් වෙනත් ඥාතීන්ව දකින්න බැරි වෙනවද?' කියලා.\"\n\n\"මම කිව්වා, 'දේවයන් වහන්ස, ඔබතුමාත්, අපිත් හැමෝම මරණයට යටත් වෙන අය. මරණයෙන් මිදෙන්න කාටවත් බැහැ. ඔබතුමාගේ රජතුමා, බිසව, නැත්නම් වෙනත් ඥාතීන් ඔබතුමාව දකින්නේ නැහැ. ඔබතුමාටත් රජතුමාව, බිසවව, නැත්නම් වෙනත් ඥාතීන්ව දකින්න ලැබෙන්නේ නැහැ' කියලා.\"\n\n\"එවිට කුමාරයා කිව්වා, 'එසේ නම්, රියැදුරුතුමනි, අද උයනට යන එකෙන් වැඩක් නැහැ. මෙතනින්ම ආපහු අන්තඃපුරයට යමු' කියලා.\"\n\n\" 'එසේය, දේවයන් වහන්ස' කියා මම විපස්සි කුමාරයාට පිළිතුරු දී එතනින්ම අන්තඃපුරයට ආපසු ගියා. දේවයන් වහන්ස, ඒ කුමාරයා අන්තඃපුරයට ගිහින් දුකින්, කනස්සල්ලෙන් මෙහෙම කල්පනා කළා: 'අනේ! මේ ඉපදීම කොච්චර නරක දෙයක්ද! ඉපදුනාම ජරාව, ලෙඩ, මරණය කියන දේවල් වලටත් මුහුණ දෙන්න වෙනවනේ' කියලා.\"",
      "paliTitle": ""
    },
    {
      "number": 52,
      "pali": "‘‘Atha kho, bhikkhave, bandhumassa rañño etadahosi – ‘mā heva kho vipassī kumāro na rajjaṃ kāresi, mā heva vipassī kumāro agārasmā anagāriyaṃ pabbaji, mā heva nemittānaṃ brāhmaṇānaṃ saccaṃ assa vacana’nti. Atha kho, bhikkhave, bandhumā rājā vipassissa kumārassa bhiyyosomattāya pañca kāmaguṇāni upaṭṭhāpesi – ‘yathā vipassī kumāro rajjaṃ kareyya, yathā vipassī kumāro na agārasmā anagāriyaṃ pabbajeyya, yathā nemittānaṃ brāhmaṇānaṃ micchā assa vacana’nti. ‘‘Tatra sudaṃ, bhikkhave, vipassī kumāro pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Atha kho, bhikkhave, vipassī kumāro bahūnaṃ vassānaṃ bahūnaṃ vassasatānaṃ bahūnaṃ vassasahassānaṃ accayena sārathiṃ āmantesi – ‘yojehi, samma sārathi, bhaddāni bhaddāni yānāni, uyyānabhūmiṃ gacchāma subhūmidassanāyā’ti. ‘Evaṃ, devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā bhaddāni bhaddāni yānāni yojetvā vipassissa kumārassa paṭivedesi – ‘yuttāni kho te, deva, bhaddāni bhaddāni yānāni, yassa dāni kālaṃ maññasī’ti. Atha kho, bhikkhave, vipassī kumāro bhaddaṃ bhaddaṃ yānaṃ abhiruhitvā bhaddehi bhaddehi yānehi uyyānabhūmiṃ niyyāsi.",
      "english": "Then, monks, it occurred to King Bandhumā: \"I must prevent Prince Vipassī from failing to rule the kingdom, from going forth from the household life to homelessness, and from proving the divining brahmins' words to be true.\" So, monks, King Bandhumā arranged even more of the five strands of sensual pleasure for Prince Vipassī, so that Prince Vipassī would rule the kingdom, would not go forth from the household life to homelessness, and so that the divining brahmins' words would be false.\n\nThereupon, monks, Prince Vipassī, fully provided with and deeply immersed in the five strands of sensual pleasure, indulged in them. Then, monks, after the passing of many years, many hundreds of years, many thousands of years, Prince Vipassī addressed his charioteer: \"Harness the finest carriages, good charioteer! Let us go to the pleasure park to enjoy a pleasant view.\" \"Yes, my lord,\" the charioteer, monks, replied to Prince Vipassī. Having harnessed the finest carriages, he reported to Prince Vipassī: \"Your finest carriages are ready, my lord. Please proceed as you see fit.\" Then, monks, Prince Vipassī, mounting a fine carriage, set out for the pleasure park in the fine carriages.",
      "sinhala": "ඉක්බිති මහණෙනි, බන්ධුමා රජුට මෙබඳු සිතක් පහළ විය: ‘විපස්සී කුමරු රජකම් නොකරනු ඇතැයි, විපස්සී කුමරු ගිහිගෙන් නික්ම පැවිදි වනු ඇතැයි, සලකුණු බලා පල කියන බමුණන්ගේ වචනය සත්ය වනු ඇතැයි!’ ඉක්බිති මහණෙනි, බන්ධුමා රජු, විපස්සී කුමරු රජකම් කරන පිණිසත්, විපස්සී කුමරු ගිහිගෙන් නික්ම පැවිදි නොවන පිණිසත්, සලකුණු බලා පල කියන බමුණන්ගේ වචනය බොරු වන පිණිසත්, ඔහු වෙනුවෙන් වඩාත් වැඩියෙන් පස්කම් ගුණ සපයා දුන්නේය.\n\nඑහිදී මහණෙනි, විපස්සී කුමරු පස්කම් ගුණයන්ගෙන් යුක්තව සතුටින් කල් ගෙවීය.\n\nඉක්බිති මහණෙනි, විපස්සී කුමරු බොහෝ වර්ෂ, සිය ගණන් වර්ෂ, දහස් ගණන් වර්ෂ ගෙවී ගිය කල්හි, සැරැදියා අමතා මෙසේ කීවේය: ‘අනේ සැරැදියා, අලංකාර රථ යොදවන්න. අපි මනරම් බිමක් දැකීම පිණිස උයනට යමු.’ ‘එසේය, දේවයන් වහන්සැ’යි මහණෙනි, සැරැදියා විපස්සී කුමරුට ප්රතිඥා දී, අලංකාර රථ යොදවා, විපස්සී කුමරුට මෙසේ දැන්වීය: ‘දේවයන් වහන්ස, අලංකාර රථ යොදා ඇත. දැන් ගමනට සුදුසු කාලයයි.’ ඉක්බිති මහණෙනි, විපස්සී කුමරු අලංකාර රථයකට නැඟී, අලංකාර රථවලින් උයන බලා පිටත් විය.",
      "paliTitle": "Pabbajito",
      "englishTitle": "The One Gone Forth",
      "sinhalaTitle": "පැවිද්දා"
    },
    {
      "number": 53,
      "pali": "‘‘Addasā kho, bhikkhave, vipassī kumāro uyyānabhūmiṃ niyyanto purisaṃ bhaṇḍuṃ pabbajitaṃ kāsāyavasanaṃ. Disvā sārathiṃ āmantesi – ‘ayaṃ pana, samma sārathi, puriso kiṃkato? Sīsaṃpissa na yathā aññesaṃ, vatthānipissa na yathā aññesa’nti? ‘Eso kho, deva, pabbajito nāmā’ti. ‘Kiṃ paneso, samma sārathi, pabbajito nāmā’ti? ‘Eso kho, deva, pabbajito nāma sādhu dhammacariyā sādhu samacariyā [sammacariyā (ka.)] sādhu kusalakiriyā [kusalacariyā (syā.)] sādhu puññakiriyā sādhu avihiṃsā sādhu bhūtānukampā’ti. ‘Sādhu kho so, samma sārathi, pabbajito nāma, sādhu dhammacariyā sādhu samacariyā sādhu kusalakiriyā sādhu puññakiriyā sādhu avihiṃsā sādhu bhūtānukampā. Tena hi, samma sārathi, yena so pabbajito tena rathaṃ pesehī’ti. ‘Evaṃ, devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā yena so pabbajito tena rathaṃ pesesi. Atha kho, bhikkhave, vipassī kumāro taṃ pabbajitaṃ etadavoca – ‘tvaṃ pana, samma, kiṃkato, sīsampi te na yathā aññesaṃ, vatthānipi te na yathā aññesa’nti? ‘Ahaṃ kho, deva, pabbajito nāmā’ti. ‘Kiṃ pana tvaṃ, samma, pabbajito nāmā’ti? ‘Ahaṃ kho, deva, pabbajito nāma, sādhu dhammacariyā sādhu samacariyā sādhu kusalakiriyā sādhu puññakiriyā sādhu avihiṃsā sādhu bhūtānukampā’ti. ‘Sādhu kho tvaṃ, samma, pabbajito nāma sādhu dhammacariyā sādhu samacariyā sādhu kusalakiriyā sādhu puññakiriyā sādhu avihiṃsā sādhu bhūtānukampā’ti.",
      "english": "Indeed, monks, as Prince Vipassī was going out to the pleasure garden, he saw a person, shaven-headed, a renunciant, wearing ochre robes. Having seen him, he addressed the charioteer: ‘But my good charioteer, what kind of person is this man? His head is not like others, and his clothes are not like others.’ ‘Indeed, my lord, that is called a renunciant,’ replied the charioteer. ‘But my good charioteer, what does a renunciant do?’ ‘Indeed, my lord, a renunciant is one for whom good conduct in the Dhamma, good balanced conduct, good skillful action, good meritorious action, good non-harming, and good compassion for living beings are hallmarks.’ ‘Indeed, my good charioteer, excellent is that renunciant; excellent is his conduct in the Dhamma, excellent his balanced conduct, excellent his skillful action, excellent his meritorious action, excellent his non-harming, and excellent his compassion for living beings. Therefore, my good charioteer, drive the chariot towards that renunciant.’ ‘Yes, my lord,’ replied the charioteer to Prince Vipassī, monks, and he drove the chariot towards that renunciant. Then, monks, Prince Vipassī said to that renunciant: ‘But my good sir, what kind of person are you? Your head is not like others, and your clothes are not like others.’ ‘Indeed, my lord, I am called a renunciant,’ he replied. ‘But my good sir, what do you do as a renunciant?’ ‘Indeed, my lord, I am a renunciant, and my practice is characterized by good conduct in the Dhamma, good balanced conduct, good skillful action, good meritorious action, good non-harming, and good compassion for living beings.’ ‘Indeed, my good sir, excellent are you as a renunciant; excellent is your conduct in the Dhamma, excellent your balanced conduct, excellent your skillful action, excellent your meritorious action, excellent your non-harming, and excellent your compassion for living beings.’",
      "sinhala": "භික්ෂූනි, විපස්සී කුමාරයා උයන බිමට යන අතරමගදී හිස මුඩු කළ, කහ පැහැති වස්ත්ර හැඳ සිටි පැවිදි පුරුෂයෙකු දුටුවේය. දැක ඔහු සාරථි අමතා මෙසේ ඇසීය: “සාරථිය, මේ පුරුෂයා කවුරුන්ද? මොහුගේ හිස අන් අයගේ හිස් මෙන් නොවන්නේ ඇයි? මොහුගේ වස්ත්ර ද අන් අයගේ වස්ත්ර මෙන් නොවන්නේ ඇයි?”\n\n“දේවයන් වහන්ස, ඔහු පැවිද්දෙකි” යැයි සාරථි පිළිතුරු දුන්නේය.\n\n“සාරථිය, පැවිද්දා යනු කුමක්ද?”\n\n“දේවයන් වහන්ස, පැවිද්දා යනු යහපත් ධර්මචර්යාව, යහපත් සමචර්යාව, යහපත් කුසල ක්රියා, යහපත් පුණ්ය ක්රියා, යහපත් අවිහිංසාව සහ යහපත් සත්ව අනුකම්පාව යන ගුණයන්ගෙන් හෙබි අයෙකි.”\n\n“සාරථිය, ඒ පැවිද්දා ඉතා යහපත් කෙනෙකි. ඔහු යහපත් ධර්මචර්යාව, යහපත් සමචර්යාව, යහපත් කුසල ක්රියා, යහපත් පුණ්ය ක්රියා, යහපත් අවිහිංසාව සහ යහපත් සත්ව අනුකම්පාවෙන් යුක්තය. එහෙයින්, සාරථිය, රථය ඒ පැවිද්දා සිටින දෙසටම පදවන්න.”\n\n“එසේය, දේවයන් වහන්ස,” යැයි පවසා සාරථි විපස්සී කුමාරයාගේ අණට අවනත වෙමින් රථය පැවිද්දා සිටි දෙසට පැදවීය. අනතුරුව විපස්සී කුමාරයා එම පැවිද්දාගෙන් මෙසේ විමසීය: “ඇවැත්නි, ඔබ කවුරුන්ද? ඔබගේ හිස අන් අයගේ හිස් මෙන් නොවන්නේ ඇයි? ඔබගේ වස්ත්ර ද අන් අයගේ වස්ත්ර මෙන් නොවන්නේ ඇයි?”\n\n“දේවයන් වහන්ස, මම පැවිද්දෙක් වෙමි,” යැයි පැවිද්දා පිළිතුරු දුන්නේය.\n\n“ඇවැත්නි, පැවිද්දා යනු කුමක්ද?”\n\n“දේවයන් වහන්ස, පැවිද්දා යනු යහපත් ධර්මචර්යාව, යහපත් සමචර්යාව, යහපත් කුසල ක්රියා, යහපත් පුණ්ය ක්රියා, යහපත් අවිහිංසාව සහ යහපත් සත්ව අනුකම්පාව යන ගුණයන්ගෙන් හෙබි අයෙකි.”\n\n“ඇවැත්නි, ඔබ ඉතා යහපත් පැවිද්දෙකි. ඔබ යහපත් ධර්මචර්යාව, යහපත් සමචර්යාව, යහපත් කුසල ක්රියා, යහපත් පුණ්ය ක්රියා, යහපත් අවිහිංසාව සහ යහපත් සත්ව අනුකම්පාවෙන් යුක්තය.”",
      "paliTitle": ""
    },
    {
      "number": 54,
      "pali": "‘‘Atha kho, bhikkhave, vipassī kumāro sārathiṃ āmantesi – ‘tena hi, samma sārathi, rathaṃ ādāya itova antepuraṃ paccaniyyāhi. Ahaṃ pana idheva kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajissāmī’ti. ‘Evaṃ, devā’ti kho, bhikkhave, sārathi vipassissa kumārassa paṭissutvā rathaṃ ādāya tatova antepuraṃ paccaniyyāsi. Vipassī pana kumāro tattheva kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbaji.",
      "english": "Then, monks, Prince Vipassi addressed the charioteer: \"Well then, good charioteer, take the chariot and return to the palace from here. I, however, will right here shave off my hair and beard, don the saffron robes, and go forth from the house life into homelessness.\" \"As you say, my lord,\" monks, the charioteer replied to Prince Vipassi, and taking the chariot, he returned to the palace from that spot. Prince Vipassi, however, right there, shaved off his hair and beard, donned the saffron robes, and went forth from the house life into homelessness.",
      "sinhala": "එවිට, භික්ෂූනි, විපස්සී කුමාරයා සාරථියාට ඇමතුවේය – ‘එසේනම්, මිත්‍ර සාරථි, රථය ගෙන මෙතැන් සිටම අන්තඃපුරයට ආපසු යන්න. මම නම් මෙතැනදීම කෙස් රැවුල් බා කසාවත් හැඳ ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වන්නෙමි’යි. ‘එසේය, දේවයන් වහන්ස’යි භික්ෂූනි, සාරථියා විපස්සී කුමාරයාගේ බස පිළිගෙන රථය ගෙන එතැනින්ම අන්තඃපුරයට ආපසු ගියේය. විපස්සී කුමාරයා නම් එතැනදීම කෙස් රැවුල් බා කසාවත් හැඳ ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි විය.",
      "paliTitle": "Bodhisattapabbajjā",
      "englishTitle": "The Bodhisatta's Going Forth",
      "sinhalaTitle": "බෝධිසත්ව පැවිද්ද"
    },
    {
      "number": 55,
      "pali": "‘‘Assosi kho, bhikkhave, bandhumatiyā rājadhāniyā mahājanakāyo caturāsīti pāṇasahassāni – ‘vipassī kira kumāro kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito’ti. Sutvāna tesaṃ etadahosi – ‘na hi nūna so orako dhammavinayo, na sā orakā [orikā (sī. syā.)] pabbajjā, yattha vipassī kumāro kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito. Vipassīpi nāma kumāro kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajissati, kimaṅgaṃ [kimaṅga (sī.)] pana maya’nti. ‘‘Atha kho, so bhikkhave, mahājanakāyo [mahājanakāyo (syā.)] caturāsīti pāṇasahassāni kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā vipassiṃ bodhisattaṃ agārasmā anagāriyaṃ pabbajitaṃ anupabbajiṃsu. Tāya sudaṃ, bhikkhave, parisāya parivuto vipassī bodhisatto gāmanigamajanapadarājadhānīsu cārikaṃ carati.",
      "english": "Monks, a great multitude of eighty-four thousand beings in the royal capital of Bandhumatī heard: ‘It is said that Prince Vipassī has shaved off his hair and beard, put on saffron robes, and gone forth from home into homelessness.’ Having heard this, they thought: ‘Surely, that is no ordinary Dhamma and Discipline, no ordinary going forth, where Prince Vipassī has shaved off his hair and beard, put on saffron robes, and gone forth from home into homelessness. If even Prince Vipassī, having shaved off his hair and beard, put on saffron robes, and gone forth from home into homelessness, then how much more so should we?’ Then, monks, that great multitude of eighty-four thousand beings, having shaved off their hair and beard, put on saffron robes, followed the Bodhisatta Vipassī who had gone forth from home into homelessness, and went forth themselves. Monks, surrounded by that assembly, the Bodhisatta Vipassī wandered on tour through villages, towns, districts, and royal capitals.",
      "sinhala": "භික්ෂූනි, බන්ධුමතී නම් රාජධානියේ අසූහාරදහසක් ප්‍රාණීන්ගෙන් යුත් මහත් ජනකායක්, “විපස්සී කුමාරයා කෙස් රැවුල් ඉවත් කොට, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරික ජීවිතයකට පැවිදි වූ බව” ඇසූහ. එය ඇසූ ඔවුන්ට මෙසේ සිතුණි: “විපස්සී කුමාරයා කෙස් රැවුල් ඉවත් කොට, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වූයේ නම්, එය සුළුපටු ධර්ම විනයක් හෝ සුළුපටු පැවිද්දක් විය නොහැකිය. විපස්සී කුමාරයාට පවා කෙස් රැවුල් ඉවත් කොට, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි විය හැකි නම්, අප ගැන කුමන කතාද?”\n\nඅනතුරුව, භික්ෂූනි, ඒ අසූහාරදහසක් ප්‍රාණීන්ගෙන් යුත් මහත් ජනකාය, කෙස් රැවුල් ඉවත් කොට, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වූ විපස්සී බෝධිසත්වයන් පසුපස පැවිදි වූහ. භික්ෂූනි, විපස්සී බෝධිසත්වයෝ ඒ පිරිස පිරිවරා ගෙන ගම්, නියම්ගම්, ජනපද සහ රාජධානිවල සැරිසරමින් චාරිකාවේ වැඩියහ.",
      "paliTitle": "Mahājanakāyaanupabbajjā",
      "englishTitle": "The Going Forth of a Great Crowd",
      "sinhalaTitle": "මහාජනකාය අනුපබ්බජ්ජා"
    },
    {
      "number": 56,
      "pali": "‘‘Atha kho, bhikkhave, vipassissa bodhisattassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘na kho metaṃ [na kho panetaṃ (syā.)] patirūpaṃ yohaṃ ākiṇṇo viharāmi, yaṃnūnāhaṃ eko gaṇamhā vūpakaṭṭho vihareyya’nti. Atha kho, bhikkhave, vipassī bodhisatto aparena samayena eko gaṇamhā vūpakaṭṭho vihāsi, aññeneva tāni caturāsīti pabbajitasahassāni agamaṃsu, aññena maggena vipassī bodhisatto.",
      "english": "Then, monks, while the Bodhisatta Vipassī was alone in seclusion, this thought arose in his mind: \"It is not appropriate for me to live in a crowd. I should live alone, withdrawn from the group.\" Then, monks, later Vipassī Bodhisatta lived alone, withdrawn from the group. Those eighty-four thousand ascetics went one way, and Vipassī Bodhisatta went another.",
      "sinhala": "ඉක්බිති, මහණෙනි, විපස්සී බෝධිසත්වයන් හුදෙකලාව, නිශ්ශබ්දව කල් ගත කරමින් සිටියදී, උන්වහන්සේගේ සිතෙහි මෙවැනි කල්පනාවක් පහළ විය: \"මම මෙලෙස ජනයා සමග ගැවසෙමින් වාසය කිරීම සුදුසු නොවේ. මා තනිව, සමූහයාගෙන් වෙන්ව වාසය කළ හැකි නම් එය යහපත් වේ.\"\n\nඉක්බිති, මහණෙනි, විපස්සී බෝධිසත්වයන් පසුව සමූහයාගෙන් වෙන්ව තනිව වාසය කළහ. අසූහාරදහසක් වූ එම පැවිද්දෝ වෙනත් මාර්ගයක ගමන් කළහ. විපස්සී බෝධිසත්වයන් ද වෙනත් මාර්ගයක ගමන් කළහ.",
      "paliTitle": ""
    },
    {
      "number": 57,
      "pali": "‘‘Atha kho, bhikkhave, vipassissa bodhisattassa vāsūpagatassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘kicchaṃ vatāyaṃ loko āpanno, jāyati ca jīyati ca mīyati ca [jiyyati ca miyyati ca (ka.)] cavati ca upapajjati ca, atha ca panimassa dukkhassa nissaraṇaṃ nappajānāti jarāmaraṇassa, kudāssu nāma imassa dukkhassa nissaraṇaṃ paññāyissati jarāmaraṇassā’ti? ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati jarāmaraṇaṃ hoti, kiṃpaccayā jarāmaraṇa’nti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘jātiyā kho sati jarāmaraṇaṃ hoti, jātipaccayā jarāmaraṇa’nti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati jāti hoti, kiṃpaccayā jātī’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘bhave kho sati jāti hoti, bhavapaccayā jātī’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati bhavo hoti, kiṃpaccayā bhavo’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘upādāne kho sati bhavo hoti, upādānapaccayā bhavo’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati upādānaṃ hoti, kiṃpaccayā upādāna’nti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘taṇhāya kho sati upādānaṃ hoti, taṇhāpaccayā upādāna’nti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati taṇhā hoti, kiṃpaccayā taṇhā’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘vedanāya kho sati taṇhā hoti, vedanāpaccayā taṇhā’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati vedanā hoti, kiṃpaccayā vedanā’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘phasse kho sati vedanā hoti, phassapaccayā vedanā’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati phasso hoti, kiṃpaccayā phasso’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘saḷāyatane kho sati phasso hoti, saḷāyatanapaccayā phasso’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati saḷāyatanaṃ hoti, kiṃpaccayā saḷāyatana’nti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘nāmarūpe kho sati saḷāyatanaṃ hoti, nāmarūpapaccayā saḷāyatana’nti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati nāmarūpaṃ hoti, kiṃpaccayā nāmarūpa’nti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘viññāṇe kho sati nāmarūpaṃ hoti, viññāṇapaccayā nāmarūpa’nti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho sati viññāṇaṃ hoti, kiṃpaccayā viññāṇa’nti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘nāmarūpe kho sati viññāṇaṃ hoti, nāmarūpapaccayā viññāṇa’nti.",
      "english": "Then, monks, to the Bodhisatta Vipassī, who had retired for retreat, gone into solitude, and was secluded, this thought arose in his mind: ‘Oh, how distressing this world has become! It is born, it ages, it dies, it passes away, and it reappears. Yet, it does not understand the escape from this suffering, from aging-and-death. When, indeed, will the escape from this suffering, from aging-and-death, become known?’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does aging-and-death come to be? What is the condition for aging-and-death?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When birth exists, aging-and-death comes to be; birth is the condition for aging-and-death.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does birth come to be? What is the condition for birth?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When existence exists, birth comes to be; existence is the condition for birth.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does existence come to be? What is the condition for existence?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When clinging exists, existence comes to be; clinging is the condition for existence.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does clinging come to be? What is the condition for clinging?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When craving exists, clinging comes to be; craving is the condition for clinging.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does craving come to be? What is the condition for craving?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When feeling exists, craving comes to be; feeling is the condition for craving.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does feeling come to be? What is the condition for feeling?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When contact exists, feeling comes to be; contact is the condition for feeling.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does contact come to be? What is the condition for contact?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When the six sense bases exist, contact comes to be; the six sense bases are the condition for contact.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, do the six sense bases come to be? What is the condition for the six sense bases?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When mentality-materiality exists, the six sense bases come to be; mentality-materiality is the condition for the six sense bases.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does mentality-materiality come to be? What is the condition for mentality-materiality?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When consciousness exists, mentality-materiality comes to be; consciousness is the condition for mentality-materiality.’\n\nThen, monks, this thought occurred to the Bodhisatta Vipassī: ‘When what exists, does consciousness come to be? What is the condition for consciousness?’ Then, monks, to the Bodhisatta Vipassī, through careful attention, there arose a breakthrough of wisdom: ‘When mentality-materiality exists, consciousness comes to be; mentality-materiality is the condition for consciousness.’",
      "sinhala": "එකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ හුදෙකලාව, තන්පත් වී, භාවනා කරමින් සිටියදී උන්වහන්සේගේ සිතට මෙවන් කල්පනාවක් ඇතිවිය: ‘මෙලොව දුකට පත්වී ඇත. උපදී, දිරයි, මියයයි, චුතවී නැවත උපදී. එහෙත් මේ ජරා මරණයෙන් වන දුකින් මිදීමට මාර්ගයක් නොදන්නේය. කවදා නම් මේ ජරා මරණයෙන් වන දුකින් මිදීම අවබෝධ වේදැ’යි.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල ජරා මරණය වේද? කුමක් නිසා ජරා මරණය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘ජාතිය ඇතිකල් ජරා මරණය වේ, ජාතිය නිසා ජරා මරණය වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල ජාතිය වේද? කුමක් නිසා ජාතිය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘භවය ඇතිකල් ජාතිය වේ, භවය නිසා ජාතිය වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල භවය වේද? කුමක් නිසා භවය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘උපාදානය ඇතිකල් භවය වේ, උපාදානය නිසා භවය වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල උපාදානය වේද? කුමක් නිසා උපාදානය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘තණ්හාව ඇතිකල් උපාදානය වේ, තණ්හාව නිසා උපාදානය වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල තණ්හාව වේද? කුමක් නිසා තණ්හාව වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘වේදනාව ඇතිකල් තණ්හාව වේ, වේදනාව නිසා තණ්හාව වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල වේදනාව වේද? කුමක් නිසා වේදනාව වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘ස්පර්ශය ඇතිකල් වේදනාව වේ, ස්පර්ශය නිසා වේදනාව වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල ස්පර්ශය වේද? කුමක් නිසා ස්පර්ශය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘සළායතනය ඇතිකල් ස්පර්ශය වේ, සළායතනය නිසා ස්පර්ශය වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල සළායතනය වේද? කුමක් නිසා සළායතනය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘නාමරූපය ඇතිකල් සළායතනය වේ, නාමරූපය නිසා සළායතනය වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල නාමරූපය වේද? කුමක් නිසා නාමරූපය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘විඤ්ඤාණය ඇතිකල් නාමරූපය වේ, විඤ්ඤාණය නිසා නාමරූපය වේ’ කියා.\n\nඑකල්හි භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘කුමක් ඇති කල විඤ්ඤාණය වේද? කුමක් නිසා විඤ්ඤාණය වේද?’ එවිට භික්ෂූනි, විපස්සී බෝධිසත්වයන් වහන්සේ මනාකොට මෙනෙහි කිරීමෙන් ප්‍රඥාවෙන් අවබෝධයක් ඇතිවිය: ‘නාමරූපය ඇතිකල් විඤ්ඤාණය වේ, නාමරූපය නිසා විඤ්ඤාණය වේ’ කියා.",
      "paliTitle": "Bodhisattaabhiniveso",
      "englishTitle": "The Bodhisattva's Resolve",
      "sinhalaTitle": "බෝධිසත්ත්ව අභිනිවේශය"
    },
    {
      "number": 58,
      "pali": "‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘paccudāvattati kho idaṃ viññāṇaṃ nāmarūpamhā, nāparaṃ gacchati. Ettāvatā jāyetha vā jiyyetha vā miyyetha vā cavetha vā upapajjetha vā, yadidaṃ nāmarūpapaccayā viññāṇaṃ, viññāṇapaccayā nāmarūpaṃ, nāmarūpapaccayā saḷāyatanaṃ, saḷāyatanapaccayā phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṃ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti’.",
      "english": "Then, monks, Vipassī the Bodhisatta considered: ‘Indeed, this consciousness turns back from name and form; it does not go further. To this extent, one is born, ages, dies, passes away, or is reborn—that is, with name and form as condition, there is consciousness; with consciousness as condition, name and form; with name and form as condition, the six sense bases; with the six sense bases as condition, contact; with contact as condition, feeling; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, becoming; with becoming as condition, birth; and with birth as condition, aging and death, sorrow, lamentation, pain, distress, and despair come to be. Thus is the arising of this entire mass of suffering.’",
      "sinhala": "එවිට, මහණෙනි, විපස්සී බෝධිසත්වයන් වහන්සේට මෙසේ සිතුණි: ‘මේ විඤ්ඤාණය නාමරූපයෙන් ඔබ්බට නොයයි, නැවත හැරී එයි. මේ ප්‍රමාණයෙන් හටගන්නේය, දිරාපත් වන්නේය, මියයන්නේය, චුතවන්නේය, උපදින්නේය. ඒ කවරේද යත්: නාමරූපය හේතුකොටගෙන විඤ්ඤාණය ඇතිවේ, විඤ්ඤාණය හේතුකොටගෙන නාමරූපය ඇතිවේ, නාමරූපය හේතුකොටගෙන සළායතනය ඇතිවේ, සළායතනය හේතුකොටගෙන ස්පර්ශය ඇතිවේ, ස්පර්ශය හේතුකොටගෙන වේදනාව ඇතිවේ, වේදනාව හේතුකොටගෙන තෘෂ්ණාව ඇතිවේ, තෘෂ්ණාව හේතුකොටගෙන උපාදානය ඇතිවේ, උපාදානය හේතුකොටගෙන භවය ඇතිවේ, භවය හේතුකොටගෙන ජාතිය ඇතිවේ, ජාතිය හේතුකොටගෙන ජරා-මරණ, ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස හටගනී. මෙසේ මේ සියලු දුක් සමූහයේ හටගැනීම සිදුවේ.’",
      "paliTitle": ""
    },
    {
      "number": 59,
      "pali": "‘‘‘Samudayo samudayo’ti kho, bhikkhave, vipassissa bodhisattassa pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi.",
      "english": "Monks, while the Bodhisatta Vipassi contemplated, 'Origin, origin,' in reference to teachings previously unknown, vision arose, knowledge arose, wisdom arose, understanding arose, and light arose.",
      "sinhala": "මහණෙනි, විපස්සී බෝධිසත්වයන්ට ‘සමුදය, සමුදය’ යැයි, මින් පෙර අසන්නට නොලැබුණු දහම් ගැන චක්ඛුවක් පහළ විය. ඥානය, ප්‍රඥාව, විද්‍යාව හා ආලෝකය ද පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 60,
      "pali": "‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati jarāmaraṇaṃ na hoti, kissa nirodhā jarāmaraṇanirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘jātiyā kho asati jarāmaraṇaṃ na hoti, jātinirodhā jarāmaraṇanirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati jāti na hoti, kissa nirodhā jātinirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘bhave kho asati jāti na hoti, bhavanirodhā jātinirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati bhavo na hoti, kissa nirodhā bhavanirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘upādāne kho asati bhavo na hoti, upādānanirodhā bhavanirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati upādānaṃ na hoti, kissa nirodhā upādānanirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘taṇhāya kho asati upādānaṃ na hoti, taṇhānirodhā upādānanirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati taṇhā na hoti, kissa nirodhā taṇhānirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘vedanāya kho asati taṇhā na hoti, vedanānirodhā taṇhānirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati vedanā na hoti, kissa nirodhā vedanānirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘phasse kho asati vedanā na hoti, phassanirodhā vedanānirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati phasso na hoti, kissa nirodhā phassanirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘saḷāyatane kho asati phasso na hoti, saḷāyatananirodhā phassanirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati saḷāyatanaṃ na hoti, kissa nirodhā saḷāyatananirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘nāmarūpe kho asati saḷāyatanaṃ na hoti, nāmarūpanirodhā saḷāyatananirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati nāmarūpaṃ na hoti, kissa nirodhā nāmarūpanirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘viññāṇe kho asati nāmarūpaṃ na hoti, viññāṇanirodhā nāmarūpanirodho’ti. ‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘kimhi nu kho asati viññāṇaṃ na hoti, kissa nirodhā viññāṇanirodho’ti? Atha kho, bhikkhave, vipassissa bodhisattassa yoniso manasikārā ahu paññāya abhisamayo – ‘nāmarūpe kho asati viññāṇaṃ na hoti, nāmarūpanirodhā viññāṇanirodho’ti.",
      "english": "Monks, the Bodhisatta Vipassī considered: \"When what does not exist, does old age and death not exist? With the cessation of what, is there cessation of old age and death?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When birth does not exist, old age and death do not exist; with the cessation of birth, there is cessation of old age and death.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does birth not exist? With the cessation of what, is there cessation of birth?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When existence does not exist, birth does not exist; with the cessation of existence, there is cessation of birth.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does existence not exist? With the cessation of what, is there cessation of existence?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When clinging does not exist, existence does not exist; with the cessation of clinging, there is cessation of existence.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does clinging not exist? With the cessation of what, is there cessation of clinging?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When craving does not exist, clinging does not exist; with the cessation of craving, there is cessation of clinging.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does craving not exist? With the cessation of what, is there cessation of craving?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When feeling does not exist, craving does not exist; with the cessation of feeling, there is cessation of craving.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does feeling not exist? With the cessation of what, is there cessation of feeling?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When contact does not exist, feeling does not exist; with the cessation of contact, there is cessation of feeling.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does contact not exist? With the cessation of what, is there cessation of contact?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When the six sense bases do not exist, contact does not exist; with the cessation of the six sense bases, there is cessation of contact.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, do the six sense bases not exist? With the cessation of what, is there cessation of the six sense bases?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When name-and-form does not exist, the six sense bases do not exist; with the cessation of name-and-form, there is cessation of the six sense bases.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does name-and-form not exist? With the cessation of what, is there cessation of name-and-form?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When consciousness does not exist, name-and-form does not exist; with the cessation of consciousness, there is cessation of name-and-form.\"\n\nThen, monks, the Bodhisatta Vipassī considered: \"When what does not exist, does consciousness not exist? With the cessation of what, is there cessation of consciousness?\" Then, monks, through wise reflection, insight arose in the Bodhisatta Vipassī: \"When name-and-form does not exist, consciousness does not exist; with the cessation of name-and-form, there is cessation of consciousness.\"",
      "sinhala": "එකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට ජරාමරණ ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් ජරාමරණ නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘ජාතිය නැති විට ජරාමරණ ඇති නොවේ. ජාතිය නිරුද්ධ වීමෙන් ජරාමරණ නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට ජාතිය ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් ජාතිය නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘භවය නැති විට ජාතිය ඇති නොවේ. භවය නිරුද්ධ වීමෙන් ජාතිය නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට භවය ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් භවය නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘උපාදානය නැති විට භවය ඇති නොවේ. උපාදානය නිරුද්ධ වීමෙන් භවය නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට උපාදානය ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් උපාදානය නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘තෘෂ්ණාව නැති විට උපාදානය ඇති නොවේ. තෘෂ්ණාව නිරුද්ධ වීමෙන් උපාදානය නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට තෘෂ්ණාව ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් තෘෂ්ණාව නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘වේදනාව නැති විට තෘෂ්ණාව ඇති නොවේ. වේදනාව නිරුද්ධ වීමෙන් තෘෂ්ණාව නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට වේදනාව ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් වේදනාව නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘ස්පර්ශය නැති විට වේදනාව ඇති නොවේ. ස්පර්ශය නිරුද්ධ වීමෙන් වේදනාව නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට ස්පර්ශය ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් ස්පර්ශය නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘සළායතනය නැති විට ස්පර්ශය ඇති නොවේ. සළායතනය නිරුද්ධ වීමෙන් ස්පර්ශය නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට සළායතනය ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් සළායතනය නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘නාමරූපය නැති විට සළායතනය ඇති නොවේ. නාමරූපය නිරුද්ධ වීමෙන් සළායතනය නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට නාමරූපය ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් නාමරූපය නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘විඤ්ඤාණය නැති විට නාමරූපය ඇති නොවේ. විඤ්ඤාණය නිරුද්ධ වීමෙන් නාමරූපය නිරුද්ධ වේ.’\n\nඑකල්හි, භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘කුමක් නැති විට විඤ්ඤාණය ඇති නොවේ ද? කුමක් නිරුද්ධ වීමෙන් විඤ්ඤාණය නිරුද්ධ වේ ද?’ භික්ෂූනි, විපස්සී බෝධිසත්වයන්ට මනාව මෙනෙහි කිරීම හේතුවෙන් ප්රඥාවෙන් අවබෝධයක් ඇති විය: ‘නාමරූපය නැති විට විඤ්ඤාණය ඇති නොවේ. නාමරූපය නිරුද්ධ වීමෙන් විඤ්ඤාණය නිරුද්ධ වේ.’",
      "paliTitle": ""
    },
    {
      "number": 61,
      "pali": "‘‘Atha kho, bhikkhave, vipassissa bodhisattassa etadahosi – ‘adhigato kho myāyaṃ maggo sambodhāya yadidaṃ – nāmarūpanirodhā viññāṇanirodho, viññāṇanirodhā nāmarūpanirodho, nāmarūpanirodhā saḷāyatananirodho, saḷāyatananirodhā phassanirodho, phassanirodhā vedanānirodho, vedanānirodhā taṇhānirodho, taṇhānirodhā upādānanirodho, upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hoti’.",
      "english": "Then, monks, it occurred to the Bodhisatta Vipassi: 'This path to full awakening has been realized by me, specifically: with the cessation of name and form, consciousness ceases; with the cessation of consciousness, name and form ceases; with the cessation of name and form, the six sense bases cease; with the cessation of the six sense bases, contact ceases; with the cessation of contact, feeling ceases; with the cessation of feeling, craving ceases; with the cessation of craving, clinging ceases; with the cessation of clinging, becoming ceases; with the cessation of becoming, birth ceases; with the cessation of birth, aging, death, sorrow, lamentation, pain, grief, and despair cease. Thus, there is the cessation of this entire mass of suffering.'",
      "sinhala": "මහණෙනි, එකල්හි විපස්සි බෝධිසත්වයන්ට මෙවැනි අදහසක් ඇති විය: ‘සම්බෝධිය පිණිස මා විසින් අවබෝධ කරගන්නා ලද මේ මාර්ගය මෙයයි: නාමරූප නිරුද්ධ වීමෙන් විඤ්ඤාණය නිරුද්ධ වේ. විඤ්ඤාණය නිරුද්ධ වීමෙන් නාමරූපය නිරුද්ධ වේ. නාමරූපය නිරුද්ධ වීමෙන් සළායතනය නිරුද්ධ වේ. සළායතනය නිරුද්ධ වීමෙන් ස්පර්ශය නිරුද්ධ වේ. ස්පර්ශය නිරුද්ධ වීමෙන් වේදනාව නිරුද්ධ වේ. වේදනාව නිරුද්ධ වීමෙන් තෘෂ්ණාව නිරුද්ධ වේ. තෘෂ්ණාව නිරුද්ධ වීමෙන් උපාදානය නිරුද්ධ වේ. උපාදානය නිරුද්ධ වීමෙන් භවය නිරුද්ධ වේ. භවය නිරුද්ධ වීමෙන් ජාතිය නිරුද්ධ වේ. ජාතිය නිරුද්ධ වීමෙන් ජරා, මරණ, ශෝක, පරිදේව, දුක්ඛ, දෝමනස්ස, උපායාස යන මේ සියල්ල නිරුද්ධ වෙයි. මෙලෙස මේ සියලු දුක්ඛස්කන්ධය නිරුද්ධ වන්නේ ය.’",
      "paliTitle": ""
    },
    {
      "number": 62,
      "pali": "‘‘‘Nirodho nirodho’ti kho, bhikkhave, vipassissa bodhisattassa pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi.",
      "english": "\"‘Cessation! Cessation!’ Indeed, monks, concerning previously unheard teachings, for Bodhisatta Vipassi there arose the eye, knowledge, wisdom, true knowledge, and light.\"",
      "sinhala": "‘නිරෝධය, නිරෝධය’ යැයි ඇත්තෙන්ම, මහණෙනි, විපස්සී බෝධිසත්වයන්ට මීට පෙර අසන්නට නොලැබුණු දහම්හි දැකීම පහළ විය. ඥානය පහළ විය. ප්‍රඥාව පහළ විය. විද්‍යාව පහළ විය. ආලෝකය පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 63,
      "pali": "‘‘Atha kho, bhikkhave, vipassī bodhisatto aparena samayena pañcasu upādānakkhandhesu udayabbayānupassī vihāsi – ‘iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā, iti vedanāya samudayo, iti vedanāya atthaṅgamo; iti saññā, iti saññāya samudayo, iti saññāya atthaṅgamo; iti saṅkhārā, iti saṅkhārānaṃ samudayo, iti saṅkhārānaṃ atthaṅgamo; iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti, tassa pañcasu upādānakkhandhesu udayabbayānupassino viharato na cirasseva anupādāya āsavehi cittaṃ vimuccī’’ti. Dutiyabhāṇavāro.",
      "english": "Then, monks, the Bodhisatta Vipassī, after some time, lived contemplating the arising and passing away of the five aggregates of clinging: 'Such is form, such is the arising of form, such is the passing away of form; such is feeling, such is the arising of feeling, such is the passing away of feeling; such is perception, such is the arising of perception, such is the passing away of perception; such are mental formations, such is the arising of mental formations, such is the passing away of mental formations; such is consciousness, such is the arising of consciousness, such is the passing away of consciousness.' As he lived contemplating the arising and passing away of these five aggregates of clinging, before long, his mind was liberated from the taints, without clinging.",
      "sinhala": "මහණෙනි, අනතුරුව විපස්සී බෝධිසත්වයන් වහන්සේ පසුව පඤ්ච උපාදානස්කන්ධයන්ගේ උදය හා වැය දකිමින් මෙසේ වාසය කළහ: ‘මෙය රූපයයි, මෙය රූපයේ හටගැනීමයි, මෙය රූපයේ නැතිවීමයි; මෙය වේදනාවයි, මෙය වේදනාවේ හටගැනීමයි, මෙය වේදනාවේ නැතිවීමයි; මෙය සඤ්ඤාවයි, මෙය සඤ්ඤාවේ හටගැනීමයි, මෙය සඤ්ඤාවේ නැතිවීමයි; මෙය සංස්කාරයෝය, මෙය සංස්කාරයන්ගේ හටගැනීමයි, මෙය සංස්කාරයන්ගේ නැතිවීමයි; මෙය විඤ්ඤාණයයි, මෙය විඤ්ඤාණයේ හටගැනීමයි, මෙය විඤ්ඤාණයේ නැතිවීමයි.’ මෙලෙස පඤ්ච උපාදානස්කන්ධයන්ගේ උදය වැය දකිමින් වාසය කරන උන්වහන්සේගේ සිත නොබෝ කලකින්ම නොගැනීම හේතුවෙන් ආශ්‍රවයන්ගෙන් මිදුණේය.\n\nදෙවැනි භාණවාරයයි.",
      "paliTitle": ""
    },
    {
      "number": 64,
      "pali": "‘‘Atha kho, bhikkhave, vipassissa bhagavato arahato sammāsambuddhassa etadahosi – ‘yaṃnūnāhaṃ dhammaṃ deseyya’nti. Atha kho, bhikkhave, vipassissa bhagavato arahato sammāsambuddhassa etadahosi – ‘adhigato kho myāyaṃ dhammo gambhīro duddaso duranubodho santo paṇīto atakkāvacaro nipuṇo paṇḍitavedanīyo. Ālayarāmā kho panāyaṃ pajā ālayaratā ālayasammuditā. Ālayarāmāya kho pana pajāya ālayaratāya ālayasammuditāya duddasaṃ idaṃ ṭhānaṃ yadidaṃ idappaccayatāpaṭiccasamuppādo. Idampi kho ṭhānaṃ duddasaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ. Ahañceva kho pana dhammaṃ deseyyaṃ, pare ca me na ājāneyyuṃ; so mamassa kilamatho, sā mamassa vihesā’ti.",
      "english": "Then, monks, this thought occurred to Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha: \"What if I were to teach the Dhamma?\"\n\nThen again, monks, this thought occurred to Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha: \"This Dhamma that I have realized is profound, difficult to see, difficult to understand, peaceful, sublime, beyond the reach of reasoning, subtle, and discernible only by the wise. But this generation delights in attachment, is devoted to attachment, and rejoices in attachment. For a generation delighting in, devoted to, and rejoicing in attachment, this principle is difficult to see: namely, conditionality and dependent origination. Difficult to see also is this principle: the stilling of all formations, the relinquishing of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna. If I were to teach the Dhamma and others were not to understand me, that would be a weariness to me, that would be a vexation to me.\"",
      "sinhala": "මහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට මෙසේ සිතුණි: \"මා විසින් ධර්මය දේශනා කරන්නේ නම් යෙහෙකැ\"යි.\n\nමහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට නැවත මෙසේ සිතුණි: \"මා විසින් අවබෝධ කරන ලද මේ ධර්මය ගැඹුරුය, දැකීමට අපහසුය, අවබෝධ කිරීමට දුෂ්කරය, ශාන්තය, ප්‍රණීතය, තර්කයෙන් ග්‍රහණය කළ නොහැකිය, සියුම්ය, ප්‍රඥාවන්තයන්ට පමණක් දැනගත හැකි ධර්මයකි.\n\nමේ සත්වයන් ආලයෙහි ඇලී, ආලයෙහිම සතුටු වෙමින්, ආලයම පදනම් කරගෙන ජීවත් වෙති. ආලයෙහි ඇලී, ආලයෙහිම සතුටු වන මේ සත්වයන්ට, මෙය නිසා මෙය හටගනී යන හේතුඵල දහම හෙවත් පටිච්චසමුප්පාදය දැකීම දුෂ්කරය.\n\nඑසේම සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපාදානයන්ගෙන් මිදීම, තෘෂ්ණාව ක්ෂය කිරීම, විරාගය, නිරෝධය, නිර්වාණය යන මේ ධර්මය ද දැකීම දුෂ්කරය.\n\nමම ධර්මය දේශනා කළත්, අන්‍යයන්ට එය අවබෝධ කරගත නොහැකි වුවහොත්, එය මට මහත් වෙහෙසක් හා පීඩාවක් වනු ඇත.\"",
      "paliTitle": "Brahmayācanakathā",
      "englishTitle": "The Request of Brahma",
      "sinhalaTitle": "බ්‍රහ්මයාචනා කථාව"
    },
    {
      "number": 65,
      "pali": "‘‘Apissu, bhikkhave, vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ imā anacchariyā gāthāyo paṭibhaṃsu pubbe assutapubbā – ‘Kicchena me adhigataṃ, halaṃ dāni pakāsituṃ; Rāgadosaparetehi, nāyaṃ dhammo susambudho. ‘Paṭisotagāmiṃ nipuṇaṃ, gambhīraṃ duddasaṃ aṇuṃ; Rāgarattā na dakkhanti, tamokhandhena āvuṭā’ti. ‘‘Itiha, bhikkhave, vipassissa bhagavato arahato sammāsambuddhassa paṭisañcikkhato appossukkatāya cittaṃ nami, no dhammadesanāya.",
      "english": "And indeed, bhikkhus, these unremarkable verses, previously unheard, spontaneously arose in the mind of Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One:\n\n‘With difficulty I attained this; enough now of proclaiming it. This Dhamma is not easily understood by those overcome with lust and hatred.\nGoing against the stream, subtle, profound, hard to see and very fine, those consumed by lust will not see it, shrouded as they are by a mass of darkness.’\n\nThus, bhikkhus, as Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, reflected in this way, his mind inclined towards disinclination, not towards teaching the Dhamma.",
      "sinhala": "භික්ෂූණි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට, මීට පෙර කිසි දිනෙක අසන්නට නොලැබුණු මෙම අසාමාන්‍ය ගාථා සිහිපත් විය:\n\n'මා විසින් දුෂ්කරව අවබෝධ කරගත් මෙම ධර්මය දැන් ප්‍රකාශ කිරීමෙන් ඇති ඵලය කුමක් ද? රාග, ද්වේෂයන්ගෙන් මත්වූවන්ට මෙය පහසුවෙන් අවබෝධ කළ නොහැකිය.\n\nමෙය ප්‍රතිවිරුද්ධ දිශාවට ගමන් කරන්නකි. සියුම් ය. ගැඹුරු ය. දැකීමට අපහසු ය. අතිශයින් සියුම් ය. රාගයෙන් ඇලී ගැලී සිටින, අවිද්‍යාවෙන් වැසී ගිය පුද්ගලයෝ මෙය නොදකිති.'\n\nභික්ෂූණි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ මෙසේ මෙනෙහි කිරීම නිසා ධර්මය දේශනා කිරීමට වඩා උන්වහන්සේගේ සිත උත්සාහය අත්හැරීමට නැඹුරු විය.",
      "paliTitle": ""
    },
    {
      "number": 66,
      "pali": "‘‘Atha kho, bhikkhave, aññatarassa mahābrahmuno vipassissa bhagavato arahato sammāsambuddhassa cetasā cetoparivitakkamaññāya etadahosi – ‘nassati vata bho loko, vinassati vata bho loko, yatra hi nāma vipassissa bhagavato arahato sammāsambuddhassa appossukkatāya cittaṃ namati [nami (syā. ka.), namissati (?)], no dhammadesanāyā’ti. Atha kho so, bhikkhave, mahābrahmā seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evameva brahmaloke antarahito vipassissa bhagavato arahato sammāsambuddhassa purato pāturahosi. Atha kho so, bhikkhave, mahābrahmā ekaṃsaṃ uttarāsaṅgaṃ karitvā dakkhiṇaṃ jāṇumaṇḍalaṃ pathaviyaṃ nihantvā [nidahanto (syā.)] yena vipassī bhagavā arahaṃ sammāsambuddho tenañjaliṃ paṇāmetvā vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavoca – ‘desetu, bhante, bhagavā dhammaṃ, desetu sugato dhammaṃ, santi [santī (syā.)] sattā apparajakkhajātikā; assavanatā dhammassa parihāyanti, bhavissanti dhammassa aññātāro’ti.",
      "english": "Then, bhikkhus, a certain Great Brahma, knowing Vipassi Buddha's thoughts with his own mind, considered: 'Alas, the world is truly lost, the world is truly perishing, since the mind of Vipassi Buddha inclines towards inaction, not towards teaching the Dhamma!' Then, bhikkhus, just as easily as a strong man might extend a bent arm or bend an extended arm, that Great Brahma vanished from the Brahma-world and appeared before Vipassi Buddha. Arranging his upper robe over one shoulder, kneeling on his right knee on the ground, and reverently saluting Vipassi Buddha with joined hands, the Great Brahma said to him: 'Venerable sir, may the Blessed One teach the Dhamma! May the Fortunate One teach the Dhamma! There are beings with little dust in their eyes who are falling away through not hearing the Dhamma. There will be those who understand the Dhamma.'",
      "sinhala": "එකල්හි, මහණෙනි, එක් මහා බ්‍රහ්මයා විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ සිතුවිලි සිතින් දැන මෙසේ සිතුණි: \"අහෝ, ලෝකය නැසේ! අහෝ, ලෝකය සම්පූර්ණයෙන් නැසේ! යම් හෙයකින් විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ සිත ධර්ම දේශනා කිරීමට නොව, අල්පෝත්සුක භාවයට නැමේ නම්.\"\n\nඑකල්හි, මහණෙනි, ඒ මහා බ්‍රහ්මයා බලවත් පුරුෂයෙක් හැකිලූ බාහුවක් දික් කරන්නාක් මෙන් හෝ දික් කළ බාහුවක් හකුලුවන්නාක් මෙන්, එසේම බ්‍රහ්ම ලෝකයෙන් අතුරුදහන් වී විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඉදිරියේ පහළ විය.\n\nඑකල්හි, මහණෙනි, ඒ මහා බ්‍රහ්මයා එක් උරහිසකින් උතුරුසළුව පොරවා, දකුණු දණහිස පොළොවෙහි පිහිටුවා, යම් තැනක විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වැඩසිටියේද, ඒ දෙසට ඇඳිලි බැඳ, විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට මෙය පැවසීය: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ ධර්මය දේශනා කරන සේක්වා! සුගතයන් වහන්සේ ධර්මය දේශනා කරන සේක්වා! අල්ප ක්ලේශයන් ඇති සත්වයෝ සිටිති; ධර්මය නොඇසීමෙන් ඔවුහු පිරිහී යති, ධර්මය අවබෝධ කරන්නෝද ඇතිවන්නාහ.\"",
      "paliTitle": ""
    },
    {
      "number": 67,
      "pali": "‘‘Evaṃ vutte [atha kho (ka.)], bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho taṃ mahābrahmānaṃ etadavoca – ‘mayhampi kho, brahme, etadahosi – ‘‘yaṃnūnāhaṃ dhammaṃ deseyya’’nti. Tassa mayhaṃ, brahme, etadahosi – ‘‘adhigato kho myāyaṃ dhammo gambhīro duddaso duranubodho santo paṇīto atakkāvacaro nipuṇo paṇḍitavedanīyo. Ālayarāmā kho panāyaṃ pajā ālayaratā ālayasammuditā. Ālayarāmāya kho pana pajāya ālayaratāya ālayasammuditāya duddasaṃ idaṃ ṭhānaṃ yadidaṃ idappaccayatāpaṭiccasamuppādo. Idampi kho ṭhānaṃ duddasaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ. Ahañceva kho pana dhammaṃ deseyyaṃ, pare ca me na ājāneyyuṃ; so mamassa kilamatho, sā mamassa vihesā’’ti. Apissu maṃ, brahme, imā anacchariyā gāthāyo paṭibhaṃsu pubbe assutapubbā – ‘‘Kicchena me adhigataṃ, halaṃ dāni pakāsituṃ; Rāgadosaparetehi, nāyaṃ dhammo susambudho. ‘‘Paṭisotagāmiṃ nipuṇaṃ, gambhīraṃ duddasaṃ aṇuṃ; Rāgarattā na dakkhanti, tamokhandhena āvuṭā’’ti. ‘Itiha me, brahme, paṭisañcikkhato appossukkatāya cittaṃ nami, no dhammadesanāyā’ti.",
      "english": "Monks, when Vipassī, the Blessed One, the Arahant, the Fully Awakened One, had spoken thus, he said to that Great Brahmā: ‘Brahmā, it also occurred to me: “What if I were to teach the Dhamma?” Then, Brahmā, this thought arose in me: “This Dhamma that I have attained is profound, difficult to see, difficult to understand, peaceful, sublime, beyond the reach of reasoning, subtle, and comprehensible only to the wise. But this generation delights in attachment, is devoted to attachment, and revels in attachment. For a generation delighting in, devoted to, and reveling in attachment, this principle is difficult to grasp: namely, dependent origination and its conditionality. And this principle too is difficult to grasp: namely, the stilling of all formations, the relinquishing of all acquisitions, the destruction of craving, detachment, cessation, and Nibbāna. If I were to teach the Dhamma and others did not understand me, that would be tiresome and vexing for me.” Furthermore, Brahmā, these verses, never before heard, spontaneously came to mind: “With difficulty I attained this; enough of proclaiming it now! This Dhamma is not easily understood by those consumed by lust and hatred. Going against the stream, subtle, profound, difficult to see, and refined, those immersed in lust will not see it, shrouded as they are by a mass of darkness.” Thus, Brahmā, reflecting in this way, my mind inclined toward disinclination, not toward teaching the Dhamma.’",
      "sinhala": "මහණෙනි, මෙසේ කී කල්හි විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඒ මහා බ්‍රහ්මයාට මෙසේ වදාළ සේක: “බ්‍රහ්මයාණෙනි, මටත් මෙවැනි අදහසක් ඇති විය. ‘කෙසේ නම් මම ධර්මය දේශනා කරන්නද?’ යන්නයි ඒ. බ්‍රහ්මයාණෙනි, එවිට මට මෙසේ සිතුණි. ‘මා විසින් අවබෝධ කරන ලද මෙම ධර්මය ගැඹුරුය, දැකීමට අපහසුය, අවබෝධ කිරීමට දුෂ්කරය. එය ශාන්තය, ප්‍රණීතය, තර්කයෙන් දැනගත නොහැකිය, සියුම්ය, පණ්ඩිතයන්ට පමණක් දැනගත හැකි ධර්මයකි. මේ සත්වයෝ ආලයෙහි ඇලී ගැලී සිටින්නාහ. ආලයෙහිම සතුටු වෙති. ආලයෙහි ඇලී, ආලයෙහිම රමණය කරමින්, ආලයෙන් සතුටු වන මේ සත්වයන්ට, පටිච්චසමුප්පාදය දැකීම පවා දුෂ්කරය. එසේම සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු කෙලෙස් අත්හැරීම, තණ්හාව නැති කිරීම, විරාගය, නිරෝධය, නිවන යන මේ තත්ත්වයද දැකීමට දුෂ්කරය. මම ධර්මය දේශනා කළත්, අනුන් එය අවබෝධ කර නොගත්තොත්, එය මට වෙහෙසක් මෙන්ම හිංසාවක්ද වන්නේය.’\n\n“බ්‍රහ්මයාණෙනි, මීට පෙර කිසි දිනක අසා නැති, මේ ගාථා එකවරම මගේ සිතට නැඟුණි.\n\n“මා විසින් දුක් මහන්සියෙන් අවබෝධ කරගත් ධර්මය, දැන් ප්‍රකාශ කිරීමෙන් ඇති ඵලයක් නැත. රාග, ද්වේශ වලින් මත්වූවන්ට මෙම ධර්මය අවබෝධ කළ නොහැක.\n\n“එය උඩුගං බලා යන ගමනක් වැනිය. එය සියුම්ය. ගැඹුරුය. දැකීමට අපහසුය. අංශු මාත්‍රයකි. රාගයෙන් ඇලුණාවූවන්ටත්, අවිද්‍යාවෙන් අන්ධ වූවන්ටත් එය නොපෙනෙන්නේය.”\n\nබ්‍රහ්මයාණෙනි, මෙසේ සිතා බැලූ මට, ධර්මය දේශනා කිරීමට වඩා උදාසීන වීමට සිත නැඹුරු විය.”",
      "paliTitle": ""
    },
    {
      "number": 68,
      "pali": "‘‘Dutiyampi kho, bhikkhave, so mahābrahmā…pe… tatiyampi kho, bhikkhave, so mahābrahmā vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavoca – ‘desetu, bhante, bhagavā dhammaṃ, desetu sugato dhammaṃ, santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti, bhavissanti dhammassa aññātāro’ti.",
      "english": "Monks, a second time that Great Brahma… and a third time, monks, that Great Brahma said to the Blessed One, Vipassi, the Arahant, the Perfectly Enlightened Buddha: ‘Venerable sir, let the Blessed One teach the Dhamma; let the Fortunate One teach the Dhamma. There are beings with little dust in their eyes who are declining through not hearing the Dhamma; there will be those who understand the Dhamma.’",
      "sinhala": "දෙවෙනි වරටත්, මහණෙනි, තෙවෙනි වරටත්, ඒ මහා බ්‍රහ්මයා විපස්සී භාග්‍යවතුන් වහන්සේට, අරහත් වූ, සම්මා සම්බුදුන් වහන්සේට මෙසේ කීවේය: \"භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ ධර්මය දේශනා කරන සේක්වා! සුගතයන් වහන්සේ ධර්මය දේශනා කරන සේක්වා! අල්ප රාගාදී කෙලෙස් ඇති සත්වයෝ සිටිත්. ඔවුන් ධර්මය නොඇසීමෙන් පිරිහෙති. ධර්මය අවබෝධ කරගන්නාහු සිටින්නෝය.\"",
      "paliTitle": ""
    },
    {
      "number": 69,
      "pali": "‘‘Atha kho, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho brahmuno ca ajjhesanaṃ viditvā sattesu ca kāruññataṃ paṭicca buddhacakkhunā lokaṃ volokesi. Addasā kho, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho buddhacakkhunā lokaṃ volokento satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye [duviññāpaye bhabbe abhabbe (syā.)] appekacce paralokavajjabhayadassāvine [dassāvino (sī. syā. kaṃ. ka.)] viharante, appekacce na paralokavajjabhayadassāvine [dassāvino (sī. syā. kaṃ. ka.)] viharante. Seyyathāpi nāma uppaliniyaṃ vā paduminiyaṃ vā puṇḍarīkiniyaṃ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakānuggatāni anto nimuggaposīni. Appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni samodakaṃ ṭhitāni. Appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakā accuggamma ṭhitāni anupalittāni udakena. Evameva kho, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho buddhacakkhunā lokaṃ volokento addasa satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye appekacce paralokavajjabhayadassāvine viharante, appekacce na paralokavajjabhayadassāvine viharante.",
      "english": "Then, monks, the Blessed One Vipassī, the Arahant, the Fully Awakened One, having understood Brahmā’s request and out of compassion for beings, surveyed the world with his Buddha-eye. As he surveyed the world with his Buddha-eye, he saw beings with little dust of defilement and with much dust of defilement, with keen faculties and with dull faculties, of good disposition and of bad disposition, easy to teach and difficult to teach; some living seeing danger in blameworthy actions concerning the next world, and some living not seeing danger in blameworthy actions concerning the next world. Just as in a pond of blue, red, or white lotuses, some lotuses—blue, red, or white—born in the water, grown in the water, remain submerged, nourished beneath the surface. Some lotuses—blue, red, or white—born in the water, grown in the water, stand even with the water’s surface. And some lotuses—blue, red, or white—born in the water, grown in the water, stand above the water, undefiled by the water. In the same way, monks, the Blessed One Vipassī, the Arahant, the Fully Awakened One, as he surveyed the world with his Buddha-eye, saw beings with little dust of defilement and with much dust of defilement, with keen faculties and with dull faculties, of good disposition and of bad disposition, easy to teach and difficult to teach; some living seeing danger in blameworthy actions concerning the next world, and some living not seeing danger in blameworthy actions concerning the next world.",
      "sinhala": "මහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ බ්‍රහ්මයාගේ ආරාධනය දැන, සත්වයන් කෙරෙහි කරුණාවෙන් යුතුව බුදු ඇසින් ලෝකය දෙස බැලූ සේක. මහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ බුදු ඇසින් ලෝකය දෙස බලන විට, අඩු කෙලෙස් ඇති, වැඩි කෙලෙස් ඇති, තියුණු ඉන්ද්‍රියන් ඇති, මෘදු ඉන්ද්‍රියන් ඇති, යහපත් ගති ඇති, අයහපත් ගති ඇති, පහසුවෙන් අවබෝධ කරගත හැකි, දුෂ්කරව අවබෝධ කරගත හැකි, පරලොවට බියෙන් වෙසෙන සමහර සත්වයන් ද, පරලොවට බියෙන් නොවසන සමහර සත්වයන් ද දැක වදාළ සේක.\n\nමහණෙනි, එය කෙසේද යත්, යම්සේ නෙළුම් පොකුණක, ඕලු පොකුණක හෝ පුන්ඩරීක පොකුණක, ඇතැම් නෙළුම්, ඕලු හෝ පුන්ඩරීක මල් දියෙහි උපත ලබා, දියෙහිම වැඩී, දියෙන් යට වී, දිය තුළම පෝෂණය වෙමින් පවතියි. ඇතැම් නෙළුම්, ඕලු හෝ පුන්ඩරීක මල් දියෙහි උපත ලබා, දියෙහිම වැඩී, දිය මට්ටමට සමානව පවතියි. ඇතැම් නෙළුම්, ඕලු හෝ පුන්ඩරීක මල් දියෙහි උපත ලබා, දියෙහිම වැඩී, දියෙන් ඉහළට නැඟී, දියෙන් නොකිලිටිව පවතියි.\n\nමහණෙනි, එපරිද්දෙන්ම විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ බුදු ඇසින් ලෝකය දෙස බලන විට, අඩු කෙලෙස් ඇති, වැඩි කෙලෙස් ඇති, තියුණු ඉන්ද්‍රියන් ඇති, මෘදු ඉන්ද්‍රියන් ඇති, යහපත් ගති ඇති, අයහපත් ගති ඇති, පහසුවෙන් අවබෝධ කරගත හැකි, දුෂ්කරව අවබෝධ කරගත හැකි, පරලොවට බියෙන් වෙසෙන සමහර සත්වයන් ද, පරලොවට බියෙන් නොවසන සමහර සත්වයන් ද දැක වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 70,
      "pali": "‘‘Atha kho so, bhikkhave, mahābrahmā vipassissa bhagavato arahato sammāsambuddhassa cetasā cetoparivitakkamaññāya vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ gāthāhi ajjhabhāsi – ‘Sele yathā pabbatamuddhaniṭṭhito, yathāpi passe janataṃ samantato; Tathūpamaṃ dhammamayaṃ sumedha, pāsādamāruyha samantacakkhu. ‘Sokāvatiṇṇaṃ [sokāvakiṇṇaṃ (syā.)] janatamapetasoko, Avekkhassu jātijarābhibhūtaṃ; Uṭṭhehi vīra vijitasaṅgāma, Satthavāha aṇaṇa vicara loke. Desassu [desetu (syā. pī.)] bhagavā dhammaṃ, Aññātāro bhavissantī’ti.",
      "english": "Then, monks, that Great Brahmā, having understood with his mind the thought-process of the mind of the Blessed One, Arahant, Fully Awakened Buddha Vipassī, addressed the Blessed One, Arahant, Fully Awakened Buddha Vipassī with verses:\n\n“Just as one standing on a mountain peak might see the people all around, so too, O wise one, O all-seeing one, having ascended the Dhamma-made palace.\n\nYou, who are free from sorrow, look upon the people overwhelmed by sorrow; look upon those overcome by birth and old age. Arise, O hero, O conqueror of battles, O leader of the caravan, O debtless one, wander in the world. May the Blessed One teach the Dhamma; there will be those who understand.”",
      "sinhala": "එවිට, මහණෙනි, ඒ මහා බ්රහ්මයා විපස්සී භාග්යවතුන් වහන්සේගේ, අරහත් වූ, සම්මා සම්බුදුන් වහන්සේගේ සිතෙහි වූ විතර්කය තම සිතින්ම දැනගෙන, විපස්සී භාග්යවතුන් වහන්සේට, අරහත් වූ, සම්මා සම්බුදුන් වහන්සේට ගාථාවලින් මෙසේ පැවසුවේය –\n‘යම්සේ පර්වත මුදුනෙහි සිටින්නෙක් අවට සිටින ජනතාව දකින්නේද, එලෙසම, මහා ප්රඥා ඇති, සමන්තචක්ඛු ඇති ඔබ, ධර්මය නම් වූ ප්රාසාදයට නැඟී, ශෝක රහිත වූ ඔබ, ශෝකයෙන් පෙළෙන ජනතාව දෙසත්, ජාතියෙන් හා ජරාවෙන් පීඩිත වූ ජනතාව දෙසත් බලනු මැනව. යුද්ධය ජයගත් වීරයාණන් වහන්ස, නැඟිටිනු මැනව! සත්ථවාහයාණන් වහන්ස, ණය නැත්තාණන් වහන්ස, ලොවෙහි හැසිරෙනු මැනව. භාග්යවතුන් වහන්ස, ධර්මය දේශනා කරනු මැනව. අවබෝධ කරන්නෝ ද වන්නාහ.’",
      "paliTitle": ""
    },
    {
      "number": 71,
      "pali": "‘‘Atha kho, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho taṃ mahābrahmānaṃ gāthāya ajjhabhāsi – ‘Apārutā tesaṃ amatassa dvārā, Ye sotavanto pamuñcantu saddhaṃ; Vihiṃsasaññī paguṇaṃ na bhāsiṃ, Dhammaṃ paṇītaṃ manujesu brahme’ti. ‘‘Atha kho so, bhikkhave, mahābrahmā ‘katāvakāso khomhi vipassinā bhagavatā arahatā sammāsambuddhena dhammadesanāyā’ti vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ abhivādetvā padakkhiṇaṃ katvā tattheva antaradhāyi. ",
      "english": "Then, monks, the Blessed One Vipassī, the Worthy One, the Perfectly Enlightened One, addressed that Great Brahmā with this verse: \"Open are the doors to the Deathless for those with ears; let them express their faith. Perceiving trouble, Brahmā, I did not readily proclaim the excellent Dhamma among humankind.\"\n\nThen, monks, that Great Brahmā, thinking, \"An opportunity has been created for the teaching of the Dhamma by the Blessed One Vipassī, the Worthy One, the Perfectly Enlightened One,\" venerated the Blessed One Vipassī, the Worthy One, the Perfectly Enlightened One, circumambulated him respectfully, and vanished from that very spot.",
      "sinhala": "\"එවිට, මහණෙනි, විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ ඒ මහා බ්‍රහ්මයාට ගාථාවකින් මෙසේ වදාළ සේක – ‘ඔවුන්ට අමෘතයේ ද්වාර විවෘත වී ඇත; යම් කෙනෙක් ඇසීමට සමත්ද, ඔවුහු ශ්‍රද්ධාවෙන් යුක්ත වෙත්වා. බ්‍රහ්මයාණෙනි, පීඩාවක් වේ යැයි සිතා, මම මිනිසුන් අතර වූ ප්‍රණීත ධර්මය දේශනා නොකළෙමි.’\n\nඑවිට, මහණෙනි, ඒ මහා බ්‍රහ්මයා ‘ධර්මය දේශනා කිරීම සඳහා විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ විසින් මට අවස්ථාව සලසා දෙන ලදී’ යි සිතා, විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේට වැඳ නමස්කාර කොට, ප්‍රදක්ෂිණා කොට, එතනම අතුරුදහන් විය.\"",
      "paliTitle": ""
    },
    {
      "number": 72,
      "pali": "‘‘Atha kho, bhikkhave, vipassissa bhagavato arahato sammāsambuddhassa etadahosi – ‘kassa nu kho ahaṃ paṭhamaṃ dhammaṃ deseyyaṃ, ko imaṃ dhammaṃ khippameva ājānissatī’ti? Atha kho, bhikkhave, vipassissa bhagavato arahato sammāsambuddhassa etadahosi – ‘ayaṃ kho khaṇḍo ca rājaputto tisso ca purohitaputto bandhumatiyā rājadhāniyā paṭivasanti paṇḍitā viyattā medhāvino dīgharattaṃ apparajakkhajātikā. Yaṃnūnāhaṃ khaṇḍassa ca rājaputtassa, tissassa ca purohitaputtassa paṭhamaṃ dhammaṃ deseyyaṃ, te imaṃ dhammaṃ khippameva ājānissantī’ti.",
      "english": "Then, bhikkhus, it occurred to Vipassī the Blessed One, the Arahant, the Perfectly Enlightened Buddha: ‘To whom now should I teach the Dhamma first? Who will quickly understand this Dhamma?’\n\nThen, bhikkhus, it occurred to Vipassī the Blessed One, the Arahant, the Perfectly Enlightened Buddha: ‘Indeed, Prince Khanda and Tissa, the brahmin’s son, are dwelling in the capital city of Bandhumatī. They are wise, experienced, intelligent, and have been of a nature with little dust in their eyes for a long time. What if I were to teach the Dhamma first to Prince Khanda and Tissa, the brahmin’s son? They will quickly understand this Dhamma.’",
      "sinhala": "භික්ෂූණී, ඉක්බිති විපස්සී භාග්‍යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට මෙබඳු අදහසක් පහළ විය: \"මා විසින් පළමුව කාහට දහම් දෙසිය යුතු ද? කවරෙක් මෙම දහම ඉක්මනින් අවබෝධ කර ගන්නේ ද?\" භික්ෂූණී, ඉක්බිති විපස්සී භාග්‍යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට මෙබඳු අදහසක් පහළ විය: \"ඛණ්ඩ නම් රාජකුමාරයා සහ තිස්ස නම් පුත්‍රයා බන්ධුමතී රාජධානියේ වෙසෙති. ඔවුහු පණ්ඩිතයෝ ය, විචක්ෂණශීලී ය, මනා නුවණින් හෙබි, බොහෝ කලක් තිස්සේ කෙලෙස් රහිත ස්වභාව ඇත්තෝ ය. එහෙයින් මම පළමුව ඛණ්ඩ රාජකුමාරයාටත්, තිස්ස පුත්‍රයාටත් දහම් දෙසන්නෙමි. ඔවුන් මෙම දහම ඉක්මනින් අවබෝධ කරගනු ඇත.\"",
      "paliTitle": "Aggasāvakayugaṃ",
      "englishTitle": "The Foremost Pair of Disciples",
      "sinhalaTitle": "අග්‍රශ්‍රාවක යුගය"
    },
    {
      "number": 73,
      "pali": "‘‘Atha kho, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evameva bodhirukkhamūle antarahito bandhumatiyā rājadhāniyā kheme migadāye pāturahosi. Atha kho, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho dāyapālaṃ [migadāyapālaṃ (syā.)] āmantesi – ‘ehi tvaṃ, samma dāyapāla, bandhumatiṃ rājadhāniṃ pavisitvā khaṇḍañca rājaputtaṃ tissañca purohitaputtaṃ evaṃ vadehi – vipassī, bhante, bhagavā arahaṃ sammāsambuddho bandhumatiṃ rājadhāniṃ anuppatto kheme migadāye viharati, so tumhākaṃ dassanakāmo’ti. ‘Evaṃ, bhante’ti kho, bhikkhave, dāyapālo vipassissa bhagavato arahato sammāsambuddhassa paṭissutvā bandhumatiṃ rājadhāniṃ pavisitvā khaṇḍañca rājaputtaṃ tissañca purohitaputtaṃ etadavoca – ‘vipassī, bhante, bhagavā arahaṃ sammāsambuddho bandhumatiṃ rājadhāniṃ anuppatto kheme migadāye viharati; so tumhākaṃ dassanakāmo’ti.",
      "english": "Then, monks, just as a strong man might extend a bent arm or bend an extended arm, so too, the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, vanished from the foot of the Bodhi tree and appeared in the Khema Deer Park of Bandhumatī, the royal capital. Then, monks, the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, addressed the park-keeper: \"Come, good park-keeper, go to Bandhumatī, the royal capital, and tell Prince Khaṇḍa and Tissa, the son of the chief priest, this: 'The Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, has arrived in Bandhumatī, the royal capital, and is staying in the Khema Deer Park; he wishes to see you both.'\" \"Yes, venerable sir,\" monks, replied the park-keeper to the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One. Then he went to Bandhumatī, the royal capital, and told Prince Khaṇḍa and Tissa, the son of the chief priest: \"The Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, has arrived in Bandhumatī, the royal capital, and is staying in the Khema Deer Park; he wishes to see you both.\"",
      "sinhala": "එසමයෙහි, මහණෙනි, විපස්සී භාග්යවතුන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ, යම්සේ බලවතෙක් හකුළුවන ලද අතක් දිග හරින්නේද, දිග හරින ලද අතක් හකුළුවන්නේද, එසේම, බෝධි වෘක්ෂය මුලින් අතුරුදහන් වී, බන්ධුමතී රාජධානියට අයත් ඛේම නම් මෘගදායෙහි පහළ වූ සේක. එවිට, මහණෙනි, විපස්සී භාග්යවතුන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ, දායපාලයා අමතා මෙසේ වදාළ සේක: ‘එව, යහළු දායපාලය, බන්ධුමතී රාජධානියට පිවිස, ඛණ්ඩ නම් රාජපුත්රයාටද, තිස්ස නම් පුරෝහිත පුත්රයාටද මෙසේ කියව: “පින්වත්නි, විපස්සී භාග්යවතුන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ, බන්ධුමතී රාජධානියට වැඩමකර, ඛේම නම් මෘගදායෙහි වැඩවසන සේක. උන්වහන්සේ ඔබලා දකින්නට කැමැති සේක”’යි. ‘එසේය, ස්වාමීනී’ යි, මහණෙනි, දායපාලයා විපස්සී භාග්යවතුන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට ප්රතිඥා දී, බන්ධුමතී රාජධානියට පිවිස, ඛණ්ඩ නම් රාජපුත්රයාටද, තිස්ස නම් පුරෝහිත පුත්රයාටද මෙසේ කීවේය: ‘පින්වත්නි, විපස්සී භාග්යවතුන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ, බන්ධුමතී රාජධානියට වැඩමකර ඛේම නම් මෘගදායෙහි වැඩවසන සේක. උන්වහන්සේ ඔබලා දකින්නට කැමැති සේක’ යි.",
      "paliTitle": ""
    },
    {
      "number": 74,
      "pali": "‘‘Atha kho, bhikkhave, khaṇḍo ca rājaputto tisso ca purohitaputto bhaddāni bhaddāni yānāni yojāpetvā bhaddaṃ bhaddaṃ yānaṃ abhiruhitvā bhaddehi bhaddehi yānehi bandhumatiyā rājadhāniyā niyyiṃsu. Yena khemo migadāyo tena pāyiṃsu. Yāvatikā yānassa bhūmi, yānena gantvā yānā paccorohitvā pattikāva [padikāva (syā.)] yena vipassī bhagavā arahaṃ sammāsambuddho tenupasaṅkamiṃsu. Upasaṅkamitvā vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ abhivādetvā ekamantaṃ nisīdiṃsu.",
      "english": "Then, monks, Prince Khaṇḍa and Tissa, the chaplain’s son, had splendid vehicles made ready. Having mounted their splendid vehicles, they set out in them from the royal capital of Bandhumatī. They proceeded to where the Khemaka deer park was. As far as their vehicles could go, they traveled by vehicle, then dismounted from their vehicles, and on foot, approached the Blessed One, Arahant, the Perfectly Self-Awakened One, Vipassī. Having approached, they paid homage to the Blessed One, Arahant, the Perfectly Self-Awakened One, Vipassī, and sat down to one side.",
      "sinhala": "එවිට, භික්ෂූනි, ඛණ්ඩ නම් රාජපුත්‍රයාත්, තිස්ස නම් පුරෝහිත පුත්‍රයාත් අලංකාරවත් රථ යොදවා, අලංකාරවත් රථවලට නැඟී, එම අලංකාරවත් රථවලින් බන්ධුමතී රාජධානියෙන් පිටත් වූහ. ඔවුහු ඛේමක මෘගදාය වෙතට ගියහ. රථයෙන් ගමන් කළ හැකි දුරක් රථයෙන් ගොස්, රථවලින් බැස, පයින්ම යම් තැනක අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වූ විපස්සී භාග්‍යවතුන් වහන්සේ වැඩසිටියේද, එතැනට එළඹියහ. එළඹ, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වූ විපස්සී භාග්‍යවතුන් වහන්සේට වැඳ නමස්කාර කොට, එක් පසෙක වාඩි වූහ.",
      "paliTitle": ""
    },
    {
      "number": 75,
      "pali": "‘‘Tesaṃ vipassī bhagavā arahaṃ sammāsambuddho anupubbiṃ kathaṃ [ānupubbikathaṃ (sī. pī.)] kathesi, seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nekkhamme ānisaṃsaṃ pakāsesi. Yadā te bhagavā aññāsi kallacitte muducitte vinīvaraṇacitte udaggacitte pasannacitte, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā, taṃ pakāsesi – dukkhaṃ samudayaṃ nirodhaṃ maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya, evameva khaṇḍassa ca rājaputtassa tissassa ca purohitaputtassa tasmiṃyeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’nti.",
      "english": "The Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, gave them a step-by-step teaching, that is, a talk on giving, a talk on morality, a talk on heaven. He revealed the danger, worthlessness, and defilement of sensual pleasures, and the benefit of renunciation. When the Blessed One knew that their minds were pliable, receptive, free from hindrances, uplifted, and serene, he then revealed the Buddhas' own profound teaching: suffering, its origin, its cessation, and the path. Just as a clean and unstained cloth easily takes dye, so too, while seated there, the stainless, immaculate Dhamma-eye arose in Prince Khanda and Tissa, the son of the chief chaplain: \"Whatever is subject to arising is subject to ceasing.\"",
      "sinhala": "ඒ විපස්සී භාග්‍යවතුන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඔවුන්ට අනුපිළිවෙළින් ධර්මය දේශනා කළ සේක. එනම් දානය පිළිබඳ කථාව, සීලය පිළිබඳ කථාව, ස්වර්ගය පිළිබඳ කථාව, කාමයන්හි ආදීනව, ඒවායේ පහත් බව, ඒවා කෙලෙසන ආකාරය සහ නෙක්ඛම්මයේ ආනිසංස ප්‍රකාශ කළ සේක.\n\nභාග්‍යවතුන් වහන්සේ ඔවුන්ගේ සිත් සකස් වී ඇති බවත්, මෘදු බවත්, නීවරණ වලින් තොර බවත්, ප්‍රීතියෙන් පිරිපුන් බවත්, පැහැදිලි බවත් දුටු විට, බුදුවරුන්ගේ උතුම්ම ධර්ම දේශනාව වන දුක, දුකට හේතුව, දුක නැති කිරීම සහ දුක නැති කරන මාර්ගය දේශනා කළ සේක.\n\nයම් සේ කිලිටු නැති, පිරිසිදු රෙදි කැබැල්ලක් සායම් මැනවින් උරා ගන්නේ ද, එම පරිද්දෙන්ම ඛණ්ඩ නම් කුමාරයාට සහ තිස්ස නම් පුත්‍රයාට ඒ මොහොතේම, කෙලෙස් රහිත, නිර්මල ධර්ම චක්ෂුස පහළ විය. එනම්, “යම් දෙයක් හට ගැනීමේ ස්වභාවය ඇත්නම්, ඒ සියල්ල නිරුද්ධ වීමේ ස්වභාවය ද ඇත” යන අවබෝධයයි.",
      "paliTitle": ""
    },
    {
      "number": 76,
      "pali": "‘‘Te diṭṭhadhammā pattadhammā viditadhammā pariyogāḷhadhammā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavocuṃ – ‘abhikkantaṃ, bhante, abhikkantaṃ, bhante. Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘‘cakkhumanto rūpāni dakkhantī’’ti. Evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Ete mayaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāma dhammañca. Labheyyāma mayaṃ, bhante, bhagavato santike pabbajjaṃ, labheyyāma upasampada’nti.",
      "english": "Having seen the truth, attained the truth, understood the truth, deeply penetrated the truth, having crossed over doubt, dispelled indecision, attained confidence, and being independent of others in the Teacher's Dispensation, they said this to the Blessed One, the Arahant, the Perfectly Self-Awakened One, Vipassī:\n\n“Excellent, venerable sir, excellent, venerable sir! Just as, venerable sir, one might set upright what was overturned, or reveal what was hidden, or point out the path to one who is lost, or hold up an oil lamp in the darkness so that those with sight may see forms; in the same way, the Dhamma has been made clear by the Blessed One in manifold ways. Therefore we, venerable sir, go for refuge to the Blessed One and to the Dhamma. May we receive the going forth in the presence of the Blessed One, venerable sir, may we receive the full ordination.”",
      "sinhala": "“ඔවුහු දිට්ඨධර්ම, පත්තධර්ම, විදිතධර්ම, පරියෝගාඪධර්ම වූහ; විචිකිච්ඡාව ඉක්මවා, කථංකථා භාවයෙන් මිදී; විශාරදත්වයට පැමිණියහ; අන්‍යයන් මත රඳා නොපවතිමින් ශාස්තෘන්ගේ ශාසනයෙහි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට මෙසේ පැවසූහ:\n‘ස්වාමීනි, ඉතා යහපත්! ස්වාමීනි, ඉතා යහපත්! ස්වාමීනි, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වැසූ දෙයක් විවෘත කරන්නේ ද, මං මුළාවූවකුට මඟ පෙන්වන්නේ ද, අන්ධකාරයේ ඇස් ඇති අය රූප දකිත්වායි තෙල් පහනක් දල්වන්නේ ද, එමෙන් භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කළ සේක.\nස්වාමීනි, අපි භාග්‍යවතුන් වහන්සේව ද ධර්මය ද සරණ යමු. ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ සන්නිධානයේ දී අපට පැවිද්ද ලැබුණොත් මැනව! උපසම්පදාව ලැබුණොත් මැනව!’”",
      "paliTitle": ""
    },
    {
      "number": 77,
      "pali": "‘‘Alatthuṃ kho, bhikkhave, khaṇḍo ca rājaputto, tisso ca purohitaputto vipassissa bhagavato arahato sammāsambuddhassa santike pabbajjaṃ alatthuṃ upasampadaṃ. Te vipassī bhagavā arahaṃ sammāsambuddho dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi; saṅkhārānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nibbāne [nekkhamme (syā.)] ānisaṃsaṃ pakāsesi. Tesaṃ vipassinā bhagavatā arahatā sammāsambuddhena dhammiyā kathāya sandassiyamānānaṃ samādapiyamānānaṃ samuttejiyamānānaṃ sampahaṃsiyamānānaṃ nacirasseva anupādāya āsavehi cittāni vimucciṃsu.",
      "english": "Bhikkhus, Prince Khaṇḍa and Tissa, the chief priest's son, received the going forth and full ordination in the presence of Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha, instructed, encouraged, inspired, and delighted them with a Dhamma talk, revealing the danger, worthlessness, and defilement of conditioned phenomena, and the benefit of Nibbāna. As they were being instructed, encouraged, inspired, and delighted by Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha, through a Dhamma talk, before long their minds were liberated from defilements, without clinging.",
      "sinhala": "මහණෙනි, ඛණ්ඩ නම් රාජ පුත්රයා සහ තිස්ස නම් පුරෝහිත පුත්රයා විපස්සී භාග්යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගෙන් පැවිද්ද හා උපසම්පදාව ලැබූහ. විපස්සී භාග්යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඔවුන්ට ධර්ම කථාවකින් කරුණු පැහැදිලි කර දුන් සේක. සමාදන් කරවූ සේක. උනන්දු කරවූ සේක. සතුටු කරවූ සේක. උන්වහන්සේ සංස්කාරයන්ගේ ආදීනව, නින්දිත බව, කිලිටි සහිත බව සහ නිර්වාණයේ ආනිසංස ප්රකාශ කළ සේක. විපස්සී භාග්යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ විසින් ධර්ම කථාවකින් කරුණු පැහැදිලි කර දෙනු ලබමින්, සමාදන් කරවනු ලබමින්, උනන්දු කරවනු ලබමින්, සතුටු කරවනු ලබමින් සිටියදී ඔවුන්ගේ සිත් නොබෝ කලකින්ම උපාදානයන්ගෙන් තොරව ආශ්රවයන්ගෙන් මිදී ගියහ.",
      "paliTitle": ""
    },
    {
      "number": 78,
      "pali": "‘‘Assosi kho, bhikkhave, bandhumatiyā rājadhāniyā mahājanakāyo caturāsītipāṇasahassāni – ‘vipassī kira bhagavā arahaṃ sammāsambuddho bandhumatiṃ rājadhāniṃ anuppatto kheme migadāye viharati. Khaṇḍo ca kira rājaputto tisso ca purohitaputto vipassissa bhagavato arahato sammāsambuddhassa santike kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajitā’ti. Sutvāna nesaṃ etadahosi – ‘na hi nūna so orako dhammavinayo, na sā orakā pabbajjā, yattha khaṇḍo ca rājaputto tisso ca purohitaputto kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajitā. Khaṇḍo ca rājaputto tisso ca purohitaputto kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajissanti, kimaṅgaṃ pana maya’nti. Atha kho so, bhikkhave, mahājanakāyo caturāsītipāṇasahassāni bandhumatiyā rājadhāniyā nikkhamitvā yena khemo migadāyo yena vipassī bhagavā arahaṃ sammāsambuddho tenupasaṅkamiṃsu; upasaṅkamitvā vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ abhivādetvā ekamantaṃ nisīdiṃsu.",
      "english": "Monks, in the capital city of Bandhumatī, eighty-four thousand people heard: \"The Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, has arrived in Bandhumatī and is staying at the Khema Deer Park. Prince Khaṇḍa and Tissa, the son of the chief priest, have shaved their heads and beards, put on saffron robes, and gone forth from the householder's life to homelessness in the presence of the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One.\"\n\nHearing this, they thought: \"Surely this Dhamma and Discipline is no ordinary one, nor is this an insignificant going forth, if Prince Khaṇḍa and Tissa, the son of the chief priest, have shaved their heads and beards, put on saffron robes, and gone forth from the householder's life to homelessness! If even Prince Khaṇḍa and Tissa, the son of the chief priest, would do this, how much more should we!\"\n\nThen, monks, that great crowd of eighty-four thousand people left Bandhumatī and went to the Khema Deer Park, where the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, was. Approaching him, they paid homage to the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, and sat down to one side.",
      "sinhala": "භික්ෂූණි, බන්ධුමතී රාජධානියේ අසූහාරදහසක් වූ මහජනතාව මෙසේ ඇසූහ: ‘භාග්‍යවත් අරහත් සම්මා සම්බුදු විපස්සී බුදුරජාණන් වහන්සේ බන්ධුමතී රාජධානියට පැමිණ ඛේම නම් මිගදායෙහි වාසය කරන සේක. ඛණ්ඩ කුමරුත්, තිස්ස නම් පුරෝහිත පුත්රයාත් භාග්‍යවත් අරහත් සම්මා සම්බුදු විපස්සී බුදුරජාණන් වහන්සේ සමීපයෙහි කෙස් රැවුල් බා දමා, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරික ප්‍රවෘජ්යාවට පැමිණියෝය.’ එය අසා ඔවුනට මෙසේ සිතුණි: ‘නියත වශයෙන්ම, ඛණ්ඩ කුමරුත්, තිස්ස නම් පුරෝහිත පුත්රයාත් කෙස් රැවුල් බා දමා, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරික ප්‍රවෘජ්යාවට පැමිණි ඒ ධර්ම විනය ලාමක එකක් නොවේ, ඒ පැවිද්ද ලාමක එකක් නොවේ. ඛණ්ඩ කුමරුත්, පුරෝහිත පුත්ර තිස්සත් කෙස් රැවුල් බා දමා, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරික ප්‍රවෘජ්යාවට පැමිණෙන්නේ නම්, අපි කවරෙක්ද?’ භික්ෂූණි, ඉක්බිති බන්ධුමතී රාජධානියේ අසූහාරදහසක් වූ ඒ මහජනතාව බන්ධුමතී රාජධානියෙන් නික්ම ඛේම නම් මිගදාය දෙසටත්, භාග්‍යවත් අරහත් සම්මා සම්බුදු විපස්සී බුදුරජාණන් වහන්සේ වැඩසිටින තැනටත් පැමිණියෝය; පැමිණ, භාග්‍යවත් අරහත් සම්මා සම්බුදු විපස්සී බුදුරජාණන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි වූහ.",
      "paliTitle": "Mahājanakāyapabbajjā",
      "englishTitle": "The Great Crowd's Renunciation",
      "sinhalaTitle": "මහාජනකයාගේ පැවිද්ද"
    },
    {
      "number": 79,
      "pali": "‘‘Tesaṃ vipassī bhagavā arahaṃ sammāsambuddho anupubbiṃ kathaṃ kathesi. Seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nekkhamme ānisaṃsaṃ pakāsesi. Yadā te bhagavā aññāsi kallacitte muducitte vinīvaraṇacitte udaggacitte pasannacitte, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā, taṃ pakāsesi – dukkhaṃ samudayaṃ nirodhaṃ maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya, evameva tesaṃ caturāsītipāṇasahassānaṃ tasmiṃyeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’nti.",
      "english": "To them, the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, delivered a step-by-step discourse. Specifically, he explained generosity, morality, heaven, the drawbacks, degradation, and defilement of sensual pleasures, and the advantages of renunciation. When the Blessed One perceived that their minds were receptive, malleable, unhindered, uplifted, and serene, he then revealed the Buddhas' own unique teaching: suffering, its origin, its cessation, and the path leading to its cessation. Just as a clean and unstained cloth readily takes dye, so too, in that very assembly, to those eighty-four thousand beings arose the stainless, immaculate Eye of the Dhamma, with the realization: \"Whatever is subject to arising is all subject to cessation.\"",
      "sinhala": "විපස්සී අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඔවුන්ට අනුපුබ්බිකථාව දේශනා කළ සේක. එනම් – දාන කථාව, ශීල කථාව, ස්වර්ග කථාව, කාමයන්ගේ ආදීනවය, එහි පහත් බව, කෙලෙසුම් ස්වභාවය සහ නෛෂ්ක්‍රම්යයේ ආනිසංසය ප්‍රකාශ කළ සේක. භාග්‍යවතුන් වහන්සේ ඔවුන්ගේ සිත් සූදානම් වූ බව, මෘදු වූ බව, නීවරණ රහිත වූ බව, උද්දාමයට පත් වූ බව, පැහැදුණු බව දැනගත් කල, බුදුවරුන්ගේ සුවිශේෂී වූ ධර්ම දේශනාව වන දුක, දුක හටගැනීම, දුක නැතිකිරීම සහ දුක නැතිකරන මාර්ගය යන සත්‍යයන් පහදා දුන් සේක. යම් සේ කිලිටි රහිත පිරිසිදු වස්ත්‍රයක් මනා සේ සායම් උරාගන්නේද, එපරිද්දෙන්ම ඒ අසූහාර දහසක් ප්‍රාණීන්ට ඒ ආසනයේම, ‘යම් කිසිවක් හටගන්නා ස්වභාවය ඇත්තේද, ඒ සියල්ල නැතිවන ස්වභාවය ඇත්තේය’ යනුවෙන් කිලිටි රහිත වූ, මල රහිත වූ ධර්ම චක්ෂුස පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 80,
      "pali": "‘‘Te diṭṭhadhammā pattadhammā viditadhammā pariyogāḷhadhammā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavocuṃ – ‘abhikkantaṃ, bhante, abhikkantaṃ, bhante. Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘‘cakkhumanto rūpāni dakkhantī’’ti. Evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Ete mayaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca [( ) natthi aṭṭhakathāyaṃ, pāḷiyaṃ pana sabbatthapi dissati]. Labheyyāma mayaṃ, bhante, bhagavato santike pabbajjaṃ labheyyāma upasampada’’nti.",
      "english": "They, having seen, attained, understood, and thoroughly penetrated the Dhamma, with their perplexities overcome, their indecision vanished, having attained confidence, and being independent of others in the Teacher's dispensation, said this to Vipassī the Blessed One, the Arahant, the Fully Self-Awakened One: ‘Magnificent, Venerable Sir! Magnificent, Venerable Sir! Just as, Venerable Sir, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms—in the same way, the Dhamma has been made clear in many ways by the Blessed One. Therefore, Venerable Sir, we go to the Blessed One for refuge, and to the Dhamma and to the community of bhikkhus. May we, Venerable Sir, receive the going forth in the presence of the Blessed One, and receive the full ordination.’",
      "sinhala": "ධර්මය අවබෝධ කරගත්, ධර්මය ලබාගත්, ධර්මය දැනගත්, ධර්මයෙහි ගැඹුරට පිවිසි, සැකයෙන් එතෙර වූ, විමතිය දුරු කළ, නිර්භීතභාවයට පත් වූ, ශාස්තෘන් වහන්සේගේ ශාසනයෙහි අන්‍යයන් මත නොරැඳී සිටි ඒ පිරිස, විපස්සී භාග්‍යවතුන් වහන්සේ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේට මෙසේ පැවසූහ: \"අතිශයින් ම මනහර ය, ස්වාමීනී, අතිශයින් ම මනහර ය, ස්වාමීනී. ස්වාමීනී, යම්සේ යටිකුරු කරන ලද දෙයක් උඩුකුරු කරන්නේ ද, වසන ලද දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේ ද, ඇස් ඇති අයට රූප දැකගැනීම පිණිස අන්ධකාරයේ තෙල් පහනක් දරන්නේ ද; එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙකුත් ක්‍රමවලින් ධර්මය ප්‍රකාශ කරන ලදී. ස්වාමීනී, අපි භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමු. ස්වාමීනී, භාග්‍යවතුන් වහන්සේ සමීපයෙහි අපට පැවිද්ද ලැබීමටත්, උපසම්පදාව ලැබීමටත් අවස්ථාව ලැබේවා!\"",
      "paliTitle": ""
    },
    {
      "number": 81,
      "pali": "‘‘Alatthuṃ kho, bhikkhave, tāni caturāsītipāṇasahassāni vipassissa bhagavato arahato sammāsambuddhassa santike pabbajjaṃ, alatthuṃ upasampadaṃ. Te vipassī bhagavā arahaṃ sammāsambuddho dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi; saṅkhārānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nibbāne ānisaṃsaṃ pakāsesi. Tesaṃ vipassinā bhagavatā arahatā sammāsambuddhena dhammiyā kathāya sandassiyamānānaṃ samādapiyamānānaṃ samuttejiyamānānaṃ sampahaṃsiyamānānaṃ nacirasseva anupādāya āsavehi cittāni vimucciṃsu. ",
      "english": "Monks, those eighty-four thousand beings obtained the going forth and full ordination in the presence of Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, instructed, inspired, gladdened, and encouraged them with a Dhamma talk, revealing the drawbacks, inferiority, and defilement of conditioned phenomena, and the benefit of Nibbāna. Thus instructed, inspired, gladdened, and encouraged by Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, through a Dhamma talk, their minds were liberated from the defilements without attachment, before long.",
      "sinhala": "මහණෙනි, ඒ ප්‍රාණීන් අසූහාරදහසක් විපස්සී භාග්‍යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ සந்නිධානයේදී පැවිද්ද හා උපසම්පදාව ලැබූහ. විපස්සී භාග්‍යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඔවුන්ට ධර්ම කථාවකින් කරුණු පැහැදිලි කර දුන් සේක, සමාදන් කරවූ සේක, උද්යෝගිමත් කරවූ සේක, සතුටු කළ සේක. එමෙන්ම සංස්කාරයන්ගේ ආදීනව, නින්දිත බව, කිලිටි සහිත බව සහ නිර්වාණයේ ආනිසංස ප්‍රකාශ කළ සේක. විපස්සී භාග්‍යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ විසින් ධර්ම කථාවකින් කරුණු පැහැදිලි කර දෙනු ලබන්නාවූ, සමාදන් කරවනු ලබන්නාවූ, උද්යෝගිමත් කරවනු ලබන්නාවූ, සතුටු කරවනු ලබන්නාවූ ඔවුන්ගේ සිත්, වැඩි කල් නොගොස්ම උපාදානයන්ගෙන් තොරව ආශ්‍රවයන්ගෙන් මිදුණි.",
      "paliTitle": ""
    },
    {
      "number": 82,
      "pali": "‘‘Assosuṃ kho, bhikkhave, tāni purimāni caturāsītipabbajitasahassāni – ‘vipassī kira bhagavā arahaṃ sammāsambuddho bandhumatiṃ rājadhāniṃ anuppatto kheme migadāye viharati, dhammañca kira desetī’ti. Atha kho, bhikkhave, tāni caturāsītipabbajitasahassāni yena bandhumatī rājadhānī yena khemo migadāyo yena vipassī bhagavā arahaṃ sammāsambuddho tenupasaṅkamiṃsu; upasaṅkamitvā vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ abhivādetvā ekamantaṃ nisīdiṃsu.",
      "english": "Monks, the eighty-four thousand renunciants of old heard, \"The Blessed One, Vipassī, the Arahant, the Perfectly Enlightened Buddha, has arrived at the royal capital Bandhumatī and is staying in the Khema Deer Park, teaching the Dhamma.\" Then, monks, those eighty-four thousand renunciants went to the royal capital Bandhumatī, to the Khema Deer Park, and to Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha. Having approached and paid homage to Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha, they sat down to one side.",
      "sinhala": "භික්ෂූනි, අසූහාරදහසක් වූ ඒ පැරණි පැවිදි පිරිස, “විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ බන්ධුමතී රාජධානියට වැඩමවා ඛේම මුව උයනේ වැඩ වාසය කරමින් ධර්මය දේශනා කරන සේකැ”යි ඇසූහ. ඉක්බිති, භික්ෂූනි, ඒ අසූහාරදහසක් වූ පැවිදි පිරිස බන්ධුමතී රාජධානියත්, ඛේම මුව උයනත් වෙත එනම් විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වැඩ සිටි තැනට පැමිණියහ. පැමිණ, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට ආචාර කොට එකත්පසකින් වාඩි වූහ.",
      "paliTitle": "Purimapabbajitānaṃ dhammābhisamayo",
      "englishTitle": "The First Wanderers' Understanding of Dhamma",
      "sinhalaTitle": "පෙර පැවිද්දන්ගේ ධර්මාභිසමය"
    },
    {
      "number": 83,
      "pali": "‘‘Tesaṃ vipassī bhagavā arahaṃ sammāsambuddho anupubbiṃ kathaṃ kathesi. Seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nekkhamme ānisaṃsaṃ pakāsesi. Yadā te bhagavā aññāsi kallacitte muducitte vinīvaraṇacitte udaggacitte pasannacitte, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā, taṃ pakāsesi – dukkhaṃ samudayaṃ nirodhaṃ maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya, evameva tesaṃ caturāsītipabbajitasahassānaṃ tasmiṃyeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’nti.",
      "english": "The Blessed One Vipassī, the Arahant, the Perfectly Awakened One, then delivered a progressive discourse to them, specifically: a talk on generosity, a talk on morality, a talk on heavens, the drawbacks, inferiority, and defilement of sensual pleasures, and the benefit of renunciation.\n\nWhen the Blessed One perceived that their minds were receptive, pliable, free from hindrances, uplifted, and clear, he then expounded the Buddhas' own special teaching: suffering, its origin, its cessation, and the path to its cessation.\n\nJust as a clean cloth, free from stains, readily takes dye, so too, for those eighty-four thousand renunciants, while seated right there, arose the stainless, immaculate Dhamma-eye, (realizing) ‘Whatever is subject to arising is all subject to ceasing.’",
      "sinhala": "විපස්සී භාග්‍යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඔවුන්ට අනුපිළිවෙළින් ධර්මය දේශනා කළ සේක. එනම්, දාන කථාව, සීල කථාව, ස්වර්ග කථාව, කාමයන්හි ආදීනව, ඒවායේ නින්දිත බව සහ කිලිටි ස්වභාවය, නෛෂ්ක්‍රම්‍යයේ ආනිසංස යන කරුණු පැහැදිලි කළ සේක. භාග්‍යවතුන් වහන්සේ ඔවුන්ගේ සිත් යෝග්‍ය බවත්, මෘදු බවත්, නීවරණ වලින් තොර බවත්, ප්‍රීතිමත් බවත්, පැහැදිලි බවත් දුටු විට, බුදුවරුන්ගේ උතුම් ධර්ම දේශනාව වන දුක්ඛ, සමුදය, නිරෝධ, මාර්ග යන සත්‍යයන් ප්‍රකාශ කළ සේක. කිළුටු නැති පිරිසිදු රෙදි කැබැල්ලක් හොඳින් සායම් උරාගන්නාක් මෙන්, ඒ අසූහාරදහසක් පැවිද්දන්ට ඒ ආසනයේම, \"යම් දෙයක් හටගැනීමේ ස්වභාවය ඇත්තේද, ඒ සියල්ල නිරුද්ධ වීමේ ස්වභාවය ඇත්තේය\" යනුවෙන් කෙලෙස් රහිත, මල රහිත වූ ධර්ම චක්ෂුස පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 84,
      "pali": "‘‘Te diṭṭhadhammā pattadhammā viditadhammā pariyogāḷhadhammā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavocuṃ – ‘abhikkantaṃ, bhante, abhikkantaṃ, bhante. Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘‘cakkhumanto rūpāni dakkhantī’’ti. Evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Ete mayaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Labheyyāma mayaṃ, bhante, bhagavato santike pabbajjaṃ labheyyāma upasampada’’nti.",
      "english": "They, having seen the Dhamma, attained the Dhamma, understood the Dhamma, and deeply immersed themselves in the Dhamma—having overcome doubt, being free from perplexity, having gained complete confidence, and being independent of others in the Teacher's Dispensation—said to the Blessed Vipassi, the Arahant, the Perfectly Enlightened One: \"Excellent, venerable sir! Excellent, venerable sir! Just as, venerable sir, one might right what was overturned, or uncover what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness, so that those with eyes might see; even so has the Dhamma been made clear by the Blessed One in various ways. We go to the Blessed One for refuge, to the Dhamma, and to the Sangha of bhikkhus. May we receive the going forth, venerable sir, in the presence of the Blessed One; may we receive full ordination.\"",
      "sinhala": "“ඒ පිරිස ධර්මය දැක, ධර්මය අවබෝධ කරගෙන, ධර්මයට ගැඹුරින් පිවිස, සැක දුරු කර, විමතියෙන් මිදී, නිර්භීතව ශාස්තෘවරයාගේ ශාසනයෙහි වෙනත් පිළිසරණක් නැතිව විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට මෙසේ කීහ: “ස්වාමීනි, ඉතාම ශෝභනයි! ස්වාමීනි, ඉතාම ශෝභනයි! ස්වාමීනි, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වසා තිබූ දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මග පෙන්වන්නේ ද, අඳුරෙහි ඇස් ඇති අය රූප දකීවා යි තෙල් පහනක් දල්වන්නේ ද, එලෙසම භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කළ සේක.\n\nස්වාමීනි, අපි භාග්‍යවතුන් වහන්සේව ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමු. ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ අනුග්‍රහයෙන් පැවිද්ද හා උපසම්පදාව ලැබීමට අපට අවසර ලැබේවා!”",
      "paliTitle": ""
    },
    {
      "number": 85,
      "pali": "‘‘Alatthuṃ kho, bhikkhave, tāni caturāsītipabbajitasahassāni vipassissa bhagavato arahato sammāsambuddhassa santike pabbajjaṃ alatthuṃ upasampadaṃ. Te vipassī bhagavā arahaṃ sammāsambuddho dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi; saṅkhārānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nibbāne ānisaṃsaṃ pakāsesi. Tesaṃ vipassinā bhagavatā arahatā sammāsambuddhena dhammiyā kathāya sandassiyamānānaṃ samādapiyamānānaṃ samuttejiyamānānaṃ sampahaṃsiyamānānaṃ nacirasseva anupādāya āsavehi cittāni vimucciṃsu.",
      "english": "Monks, those eighty-four thousand who had gone forth received both the going forth and full ordination in the presence of the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One. The Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, instructed, encouraged, roused, and delighted them with a Dhamma talk, revealing the drawbacks, inferiority, and defilement of conditioned things, and the benefit of Nibbana. Instructed, encouraged, roused, and delighted by the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, with a Dhamma talk, their minds were soon liberated from the taints, without clinging.",
      "sinhala": "මහණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ සන්නිධානයේදී අසූහාරදහසක් පැවිද්දෝ පැවිද්ද හා උපසම්පදාව ලැබූහ. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඔවුන්ට ධර්ම කථාවෙන් කරුණු පහදා දී, සමාදන් කරවා, උද්දීපනය කර, සතුටු කළ සේක. එමෙන්ම සංස්කාරයන්ගේ ආදීනව, නීච බව, කෙලෙස් සහිත බව හා නිර්වාණයේ ආනිසංස ද ප්‍රකාශ කළ සේක. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ විසින් ධර්ම කථාවෙන් කරුණු දක්වනු ලැබ, සමාදන් කරවනු ලැබ, උද්දීපනය කරනු ලැබ, සතුටු කරනු ලැබූ ඔවුන්ගේ සිත්, වැඩි කලක් ගත වීමට පෙර උපාදානයන්ගෙන් තොරව ආශ්‍රවයන්ගෙන් මිදුණි.",
      "paliTitle": ""
    },
    {
      "number": 86,
      "pali": "‘‘Tena kho pana, bhikkhave, samayena bandhumatiyā rājadhāniyā mahābhikkhusaṅgho paṭivasati aṭṭhasaṭṭhibhikkhusatasahassaṃ. Atha kho, bhikkhave, vipassissa bhagavato arahato sammāsambuddhassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘mahā kho etarahi bhikkhusaṅgho bandhumatiyā rājadhāniyā paṭivasati aṭṭhasaṭṭhibhikkhusatasahassaṃ, yaṃnūnāhaṃ bhikkhū anujāneyyaṃ – ‘caratha, bhikkhave, cārikaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ; mā ekena dve agamittha; desetha, bhikkhave, dhammaṃ ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsetha. Santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti, bhavissanti dhammassa aññātāro. Api ca channaṃ channaṃ vassānaṃ accayena bandhumatī rājadhānī upasaṅkamitabbā pātimokkhuddesāyā’’’ti.",
      "english": "At that time, monks, a great Saṅgha of six million eight hundred thousand monastics was dwelling in the royal capital of Bandhumatī. Then, while Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, was in seclusion and retreat, this thought arose in his mind: ‘Indeed, a great Saṅgha of six million eight hundred thousand monastics is now dwelling in the royal capital of Bandhumatī. What if I were to instruct the monks: “Go forth, monks, on a journey for the benefit of the many, for the happiness of the many, out of compassion for the world, for the good, benefit, and happiness of gods and humans. Do not travel in pairs. Teach the Dhamma, monks, which is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with its meaning and phrasing. Proclaim the completely perfect and pure spiritual life. There are beings with little dust in their eyes who are falling away through not hearing the Dhamma; they will become knowers of the Dhamma.” Furthermore, the royal capital of Bandhumatī should be visited every six years for the recitation of the Pātimokkha.’",
      "sinhala": "භික්ෂූනි, එකල බන්ධුමතී රාජධානියේ අටසැට ලක්ෂයක් භික්ෂූන්ගෙන් යුත් මහත් භික්ෂු සංඝයෙක් වැඩ වාසය කළහ.\n\nභික්ෂූනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ එක් තැනක වැඩ සිට භාවනානුයෝගීව කල් ගත කරමින් සිටියදී මෙවැනි කල්පනාවක් පහළ විය:\n\n\"මේ වන විට බන්ධුමතී රාජධානියේ අටසැට ලක්ෂයක් භික්ෂූන්ගෙන් යුත් මහත් භික්ෂු සංඝයෙක් වැඩ වාසය කරති. එබැවින් මම භික්ෂූන්ට මෙසේ අවසර දෙන්නෙමි: 'භික්ෂූනි, බොහෝ දෙනාගේ හිත සුව පිණිස, ලෝකානුකම්පාව පිණිස, දෙව් මිනිසුන්ගේ යහපත පිණිස චාරිකාවේ හැසිරෙන්න. එක මඟක දෙදෙනා නොයන්න. භික්ෂූනි, මුල, මැද, අග මනාවූ, අර්ථ සහිත, ව්යංජන සහිත, මුළුමනින්ම පිරිපුන් වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන ධර්මය දේශනා කරන්න. ස්වල්ප රජස් ඇති සත්ත්වයෝ සිටිති. ඔවුහු ධර්මය නො ඇසීම නිසා පිරිහී යති. ධර්මය අවබෝධ කරන්නෝ ද වෙති. එමෙන්ම, සෑම වසර හයකට වරක් පාතිමොක්ඛ දේශනාව සඳහා බන්ධුමතී රාජධානියට පැමිණිය යුතුය.'\"",
      "paliTitle": "Cārikāanujānanaṃ",
      "englishTitle": "Authorizing Wandering",
      "sinhalaTitle": "චාරිකානුජානනං"
    },
    {
      "number": 87,
      "pali": "‘‘Atha kho, bhikkhave, aññataro mahābrahmā vipassissa bhagavato arahato sammāsambuddhassa cetasā cetoparivitakkamaññāya seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya. Evameva brahmaloke antarahito vipassissa bhagavato arahato sammāsambuddhassa purato pāturahosi. Atha kho so, bhikkhave, mahābrahmā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena vipassī bhagavā arahaṃ sammāsambuddho tenañjaliṃ paṇāmetvā vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavoca – ‘evametaṃ, bhagavā, evametaṃ, sugata. Mahā kho, bhante, etarahi bhikkhusaṅgho bandhumatiyā rājadhāniyā paṭivasati aṭṭhasaṭṭhibhikkhusatasahassaṃ, anujānātu, bhante, bhagavā bhikkhū – ‘‘caratha, bhikkhave, cārikaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ; mā ekena dve agamittha; desetha, bhikkhave, dhammaṃ ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsetha. Santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti, bhavissanti dhammassa aññātāro’’ti [aññātāro (ssabbattha)]. Api ca, bhante, mayaṃ tathā karissāma yathā bhikkhū channaṃ channaṃ vassānaṃ accayena bandhumatiṃ rājadhāniṃ upasaṅkamissanti pātimokkhuddesāyā’ti. Idamavoca, bhikkhave, so mahābrahmā, idaṃ vatvā vipassiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ abhivādetvā padakkhiṇaṃ katvā tattheva antaradhāyi.",
      "english": "Then, monks, a certain Great Brahma, understanding with his mind the thought in the mind of Vipassī, the Blessed One, Arahant, Perfectly Enlightened One, vanished from the Brahma-world and appeared before Vipassī, the Blessed One, Arahant, Perfectly Enlightened One—as easily as a strong man might extend a bent arm or bend an extended arm. Then, monks, that Great Brahma, arranging his upper robe over one shoulder and reverently saluting Vipassī, the Blessed One, Arahant, Perfectly Enlightened One, with joined hands, said to him: “So it is, Blessed One! So it is, Fortunate One! Venerable sir, a great community of monks, numbering six million eight hundred thousand, is currently residing in the royal capital of Bandhumatī. May the Blessed One permit the monks: ‘Go forth, monks, on pilgrimage for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans. Do not go two together. Teach the Dhamma, monks, which is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with its meaning and phrasing. Proclaim the life of purity, entirely complete and perfectly pure. There are beings with little dust in their eyes who are falling away through not hearing the Dhamma; they will be those who understand the Dhamma.’ Furthermore, venerable sir, we will arrange for the monks to visit the royal capital of Bandhumatī every six years for the recitation of the Pātimokkha.” This is what that Great Brahma said, monks. Having said this, he paid homage to Vipassī, the Blessed One, Arahant, Perfectly Enlightened One, circumambulated him respectfully, and vanished right there.",
      "sinhala": "‘‘මහණෙනි, ඉක්බිති එක්තරා මහා බ්‍රහ්මයෙක් විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ සිතින් සිත දැන, බලවතෙකු හැකිළු අතක් දිගුකරන්නාක් මෙන් හෝ දිගුකළ අතක් හකුළුවන්නාක් මෙන් බඹලොවින් අතුරුදහන්ව විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ඉදිරියෙහි පහළ විය. ඉක්බිති ඒ මහා බ්‍රහ්මයා එක්පසෙකින් උතුරු සළුව පොරවාගෙන විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වැඩසිටි දෙසට දොහොත් මුදුන් දී, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට මෙසේ කීවේය: ‘භාග්‍යවතුන් වහන්ස, එසේය, සුගතයන් වහන්ස, එසේය. භාග්‍යවතුන් වහන්ස, මේ වන විට බන්ධුමතී රාජධානියේ හැට අට ලක්ෂයක් භික්ෂූන් වහන්සේලා වාසය කරති. භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලාට මෙසේ අනුදැන වදාළ මැනව: “මහණෙනි, බොහෝ දෙනාගේ හිතසුව පිණිස, බොහෝ දෙනාගේ සැප පිණිස, ලෝකයාට අනුකම්පා පිණිස, දෙවිමිනිසුන්ගේ යහපත පිණිස චාරිකාවේ හැසිරෙව්. එක් මගක දෙදෙනෙක් නොයව්. මහණෙනි, මුල, මැද, අග යහපත් වූ, අර්ථ සහිත, ව්‍යංජන සහිත, සියලු අංගයන්ගෙන් පරිපූර්ණ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරව්. ස්වල්ප රජස් ඇති සත්වයෝ සිටිති. ඔවුහු ධර්මය නොඇසීම නිසා පිරිහෙති. ධර්මය අවබෝධ කරන්නෝ ද වෙති.” තවද, භාග්‍යවතුන් වහන්ස, භික්ෂූන් වහන්සේලා වසර හයකට වරක් ප්‍රාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණෙන පරිදි අපි කටයුතු කරන්නෙමු.’ මහණෙනි, ඒ මහා බ්‍රහ්මයා මෙය කීවේය. මෙය කියා විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට වැඳ පැදකුණු කොට එතැනම අතුරුදහන් විය.’’",
      "paliTitle": ""
    },
    {
      "number": 88,
      "pali": "‘‘Atha kho, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho sāyanhasamayaṃ paṭisallānā vuṭṭhito bhikkhū āmantesi – ‘idha mayhaṃ, bhikkhave, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – mahā kho etarahi bhikkhusaṅgho bandhumatiyā rājadhāniyā paṭivasati aṭṭhasaṭṭhibhikkhusatasahassaṃ. Yaṃnūnāhaṃ bhikkhū anujāneyyaṃ – ‘caratha, bhikkhave, cārikaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ; mā ekena dve agamittha; desetha, bhikkhave, dhammaṃ ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsetha. Santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti, bhavissanti dhammassa aññātāro. Api ca, channaṃ channaṃ vassānaṃ accayena bandhumatī rājadhānī upasaṅkamitabbā pātimokkhuddesāyāti. ‘‘‘Atha kho, bhikkhave, aññataro mahābrahmā mama cetasā cetoparivitakkamaññāya seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva brahmaloke antarahito mama purato pāturahosi. Atha kho so, bhikkhave, mahābrahmā ekaṃsaṃ uttarāsaṅgaṃ karitvā yenāhaṃ tenañjaliṃ paṇāmetvā maṃ etadavoca – ‘‘evametaṃ, bhagavā, evametaṃ, sugata. Mahā kho, bhante, etarahi bhikkhusaṅgho bandhumatiyā rājadhāniyā paṭivasati aṭṭhasaṭṭhibhikkhusatasahassaṃ. Anujānātu, bhante, bhagavā bhikkhū – ‘caratha, bhikkhave, cārikaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ; mā ekena dve agamittha; desetha, bhikkhave, dhammaṃ…pe… santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti, bhavissanti dhammassa aññātāro’ti. Api ca, bhante, mayaṃ tathā karissāma, yathā bhikkhū channaṃ channaṃ vassānaṃ accayena bandhumatiṃ rājadhāniṃ upasaṅkamissanti pātimokkhuddesāyā’’ti. Idamavoca, bhikkhave, so mahābrahmā, idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tattheva antaradhāyi’. ‘‘‘Anujānāmi, bhikkhave, caratha cārikaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ; mā ekena dve agamittha; desetha, bhikkhave, dhammaṃ ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsetha. Santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti, bhavissanti dhammassa aññātāro. Api ca, bhikkhave, channaṃ channaṃ vassānaṃ accayena bandhumatī rājadhānī upasaṅkamitabbā pātimokkhuddesāyā’ti. Atha kho, bhikkhave, bhikkhū yebhuyyena ekāheneva janapadacārikaṃ pakkamiṃsu.",
      "english": "Then, bhikkhus, the Blessed One Vipassī, the Arahant, the Perfectly Enlightened One, having risen from solitary meditation in the evening, addressed the bhikkhus: ‘Here, bhikkhus, while I was alone in retreat, this thought arose in my mind: “Truly, a great Saṅgha of bhikkhus now dwells in the royal capital of Bandhumatī, numbering sixty-eight hundred thousand. Suppose I were to authorize the bhikkhus: ‘Go forth, bhikkhus, on pilgrimage for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of devas and humans. Let not two go together. Teach the Dhamma, bhikkhus, which is beautiful in the beginning, beautiful in the middle, beautiful in the end, with its meaning and phrasing complete. Proclaim the perfectly complete and pure holy life. There are beings with little dust in their eyes who are declining through not hearing the Dhamma. They will be those who understand the Dhamma. Furthermore, after every six years, the royal capital of Bandhumatī should be visited for the recitation of the Pātimokkha.’”’\n\n‘Then, bhikkhus, a certain Great Brahmā, knowing my thoughts, as easily as a strong man might extend a contracted arm or contract an extended arm, vanished from the Brahma-world and appeared before me. Then, bhikkhus, that Great Brahmā, arranging his upper robe over one shoulder, and reverently saluting me with joined hands, said this to me: “So it is, Blessed One! So it is, Accomplished One! Indeed, venerable sir, a great Saṅgha of bhikkhus now dwells in the royal capital of Bandhumatī, numbering sixty-eight hundred thousand. May the Blessed One, venerable sir, authorize the bhikkhus: ‘Go forth, bhikkhus, on pilgrimage for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of devas and humans. Let not two go together. Teach the Dhamma, bhikkhus, which is beautiful in the beginning, beautiful in the middle, beautiful in the end, with its meaning and phrasing complete. Proclaim the perfectly complete and pure holy life. There are beings with little dust in their eyes who are declining through not hearing the Dhamma. They will be those who understand the Dhamma.’ Moreover, venerable sir, we will ensure that the bhikkhus visit the royal capital of Bandhumatī after every six years for the recitation of the Pātimokkha.”’ This is what that Great Brahmā said, bhikkhus. Having said this, he paid homage to me, circumambulated me keeping his right side towards me, and vanished right there.’\n\n‘I grant permission, bhikkhus: Go forth on pilgrimage for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of devas and humans. Let not two go together. Teach the Dhamma, bhikkhus, which is beautiful in the beginning, beautiful in the middle, beautiful in the end, with its meaning and phrasing complete. Proclaim the perfectly complete and pure holy life. There are beings with little dust in their eyes who are declining through not hearing the Dhamma. They will be those who understand the Dhamma. Furthermore, bhikkhus, after every six years, the royal capital of Bandhumatī should be visited for the recitation of the Pātimokkha.’ Then, bhikkhus, for the most part, the bhikkhus departed on their tour through the countryside on that very day.",
      "sinhala": "භික්ෂූණෙනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ සවස් කාලයේ භාවනාවෙන් නැගිට භික්ෂූන් අමතා මෙසේ වදාළ සේක: “භික්ෂූණෙනි, මම තනිව භාවනා කරමින් සිටියදී මෙබඳු කල්පනාවක් ඇති විය. එනම්, බන්ධුමතී රාජධානියේ භික්ෂූන් හැටඅට ලක්ෂයකින් යුත් මහත් භික්ෂු සංඝයා මේ වන විට වැඩ වෙසෙයි. එබැවින්, මම භික්ෂූන්ට මෙසේ අවසර දෙන්නෙමි. ‘භික්ෂූණෙනි, බොහෝ දෙනාගේ හිත සුව පිණිසත්, ලෝකයා කෙරෙහි අනුකම්පාවෙන් දෙව් මිනිසුන්ගේ යහපත පිණිසත් චාරිකාවේ හැසිරෙන්න. දෙදෙනෙක් එක මඟක නොයන්න. භික්ෂූණෙනි, මුල, මැද, අග යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, සියලු අංගයන්ගෙන් පිරිපුන් වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්න. ස්වල්ප වශයෙන් කෙලෙස් ඇති සත්වයෝ සිටිති. ඔවුහු ධර්මය නොඇසීම නිසා පිරිහෙති. ධර්මය අවබෝධ කරන්නෝ ද වෙති. තවද, සෑම වසර හයකට වරක් පාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණිය යුතුය.’\n\nභික්ෂූණෙනි, එකල්හි එක්තරා මහා බ්‍රහ්මයෙක් මාගේ සිතේ ඇති සිතුවිල්ල දැනගෙන, බලවත් පුරුෂයෙක් හැකිලූ අතක් දිගහරින්නාක් මෙන්, දිගු කළ අතක් හැකිලුවාක් මෙන්, බ්‍රහ්ම ලෝකයෙන් අතුරුදන්ව මා ඉදිරියේ පහළ විය. භික්ෂූණෙනි, ඒ මහා බ්‍රහ්මයා එක් උරහිසක් වසාගෙන මා සිටි දෙසට දොහොත් මුදුන් දී මෙසේ කීවේය: ‘භාග්‍යවතුන් වහන්ස, එසේය, සුගතයන් වහන්ස, එසේය. ස්වාමීනි, දැන් බන්ධුමතී රාජධානියේ භික්ෂූන් හැටඅට ලක්ෂයකින් යුත් මහත් භික්ෂු සංඝයා වැඩ වෙසෙයි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට අවසර දෙනු මැනව. එනම්, ‘භික්ෂූණෙනි, බොහෝ දෙනාගේ හිත සුව පිණිසත්, ලෝකයා කෙරෙහි අනුකම්පාවෙන් දෙව් මිනිසුන්ගේ යහපත පිණිසත් චාරිකාවේ හැසිරෙන්න. දෙදෙනෙක් එක මඟක නොයන්න. භික්ෂූණෙනි, මුල, මැද, අග යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, සියලු අංගයන්ගෙන් පිරිපුන් වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්න. ස්වල්ප වශයෙන් කෙලෙස් ඇති සත්වයෝ සිටිති. ඔවුහු ධර්මය නොඇසීම නිසා පිරිහෙති. ධර්මය අවබෝධ කරන්නෝ ද වෙති.’ තවද, ස්වාමීනි, භික්ෂූන් සෑම වසර හයකට වරක් පාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණෙන පරිදි අපි කරන්නෙමු.’ භික්ෂූණෙනි, ඒ මහා බ්‍රහ්මයා මෙය කියා මා වැඳ පැදකුණු කොට එතැනම අතුරුදන් විය.”\n\n“භික්ෂූණෙනි, මම අවසර දෙමි. බොහෝ දෙනාගේ හිත සුව පිණිසත්, ලෝකයා කෙරෙහි අනුකම්පාවෙන් දෙව් මිනිසුන්ගේ යහපත පිණිසත් චාරිකාවේ හැසිරෙන්න. දෙදෙනෙක් එක මඟක නොයන්න. භික්ෂූණෙනි, මුල, මැද, අග යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, සියලු අංගයන්ගෙන් පිරිපුන් වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්න. ස්වල්ප වශයෙන් කෙලෙස් ඇති සත්වයෝ සිටිති. ඔවුහු ධර්මය නොඇසීම නිසා පිරිහෙති. ධර්මය අවබෝධ කරන්නෝ ද වෙති. තවද, භික්ෂූණෙනි, සෑම වසර හයකට වරක් පාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණිය යුතුය.” භික්ෂූණෙනි, එකල්හි බොහෝ භික්ෂූන් එක දිනකින්ම ගම් නියම් ගම් කරා චාරිකාවට පිටත්ව ගියහ.",
      "paliTitle": ""
    },
    {
      "number": 89,
      "pali": "‘‘Tena kho pana samayena jambudīpe caturāsīti āvāsasahassāni honti. Ekamhi hi vasse nikkhante devatā saddamanussāvesuṃ – ‘nikkhantaṃ kho, mārisā, ekaṃ vassaṃ; pañca dāni vassāni sesāni; pañcannaṃ vassānaṃ accayena bandhumatī rājadhānī upasaṅkamitabbā pātimokkhuddesāyā’ti. Dvīsu vassesu nikkhantesu… tīsu vassesu nikkhantesu… catūsu vassesu nikkhantesu… pañcasu vassesu nikkhantesu devatā saddamanussāvesuṃ – ‘nikkhantāni kho, mārisā, pañcavassāni; ekaṃ dāni vassaṃ sesaṃ; ekassa vassassa accayena bandhumatī rājadhānī upasaṅkamitabbā pātimokkhuddesāyā’ti. Chasu vassesu nikkhantesu devatā saddamanussāvesuṃ – ‘nikkhantāni kho, mārisā, chabbassāni, samayo dāni bandhumatiṃ rājadhāniṃ upasaṅkamituṃ pātimokkhuddesāyā’ti. Atha kho te, bhikkhave, bhikkhū appekacce sakena iddhānubhāvena appekacce devatānaṃ iddhānubhāvena ekāheneva bandhumatiṃ rājadhāniṃ upasaṅkamiṃsu pātimokkhuddesāyāti [pātimokkhuddesāya (?)].",
      "english": "At that time, there were eighty-four thousand monasteries in Jambudīpa. When one year had passed, the devas announced: \"Friends, one year has passed; five years now remain. In five years, the royal city of Bandhumatī must be visited for the recitation of the Pātimokkha.\" When two years had passed… when three years had passed… when four years had passed… when five years had passed… the devas announced: \"Friends, five years have passed; one year now remains. In one year, the royal city of Bandhumatī must be visited for the recitation of the Pātimokkha.\" When six years had passed, the devas announced: \"Friends, six years have passed; now is the time to visit the royal city of Bandhumatī for the recitation of the Pātimokkha.\" Then, mendicants, some of those bhikkhus, through their own psychic power, and others through the psychic power of the devas, visited the royal city of Bandhumatī in a single day for the recitation of the Pātimokkha.",
      "sinhala": "ඒ කාලයෙහි ජම්බුද්වීපයෙහි ආවාස අසූහාරදහසක් විය. එක් වසරක් ඉක්ම ගිය පසු දෙවියෝ හඬ නඟා මෙසේ දැනුම් දුන්හ: “ඇවැත්නි, එක් වසරක් ගෙවී ගියේය. දැන් තවත් වසර පහක් ඉතිරිව ඇත. වසර පහක් ඇවෑමෙන් ප්‍රාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණිය යුතුය.” වසර දෙකක් ඉක්ම ගිය පසු... වසර තුනක් ඉක්ම ගිය පසු... වසර හතරක් ඉක්ම ගිය පසු... වසර පහක් ඉක්ම ගිය පසු දෙවියෝ හඬ නඟා මෙසේ දැනුම් දුන්හ: “ඇවැත්නි, වසර පහක් ගෙවී ගියේය. දැන් තවත් එක් වසරක් ඉතිරිව ඇත. එක් වසරක් ඇවෑමෙන් ප්‍රාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණිය යුතුය.” වසර හයක් ඉක්ම ගිය පසු දෙවියෝ හඬ නඟා මෙසේ දැනුම් දුන්හ: “ඇවැත්නි, වසර හයක් ගෙවී ගියේය. දැන් ප්‍රාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණීමට කාලයයි.” මහණෙනි, එකල්හි ඒ භික්ෂූන් අතුරෙන් ඇතැම්හු තමන්ගේ ඍද්ධි බලයෙන් ද, ඇතැම්හු දෙවියන්ගේ ඍද්ධි බලයෙන් ද එක් දිනකින්ම ප්‍රාතිමෝක්ෂය උදෙසා බන්ධුමතී රාජධානියට පැමිණියහ.",
      "paliTitle": ""
    },
    {
      "number": 90,
      "pali": "‘‘Tatra sudaṃ, bhikkhave, vipassī bhagavā arahaṃ sammāsambuddho bhikkhusaṅghe evaṃ pātimokkhaṃ uddisati – ‘Khantī paramaṃ tapo titikkhā, Nibbānaṃ paramaṃ vadanti buddhā; Na hi pabbajito parūpaghātī, Na samaṇo [samaṇo (sī. syā. pī.)] hoti paraṃ viheṭhayanto. ‘Sabbapāpassa akaraṇaṃ, kusalassa upasampadā; Sacittapariyodapanaṃ, etaṃ buddhānasāsanaṃ. ‘Anūpavādo anūpaghāto [anupavādo anupaghāto (pī. ka.)], pātimokkhe ca saṃvaro; Mattaññutā ca bhattasmiṃ, pantañca sayanāsanaṃ; Adhicitte ca āyogo, etaṃ buddhānasāsana’nti. ",
      "english": "Monks, it is said that Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened Buddha, recited the following Pāṭimokkha to the Saṅgha of monks:\n\n‘Patience, forbearance, is the highest austerity. The Buddhas say that Nibbāna is supreme. A renunciant does not harm others; one who troubles others is no ascetic.\n\n‘To avoid all evil, to cultivate good, to purify one's mind: this is the teaching of the Buddhas.\n\n‘Not reviling, not injuring, restraint according to the Pāṭimokkha, moderation in food, dwelling in secluded lodgings, and devotion to higher thought: this is the teaching of the Buddhas.’",
      "sinhala": "භික්ෂූනි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ භික්ෂු සංඝයා හමුවේ ප්‍රාතිමෝක්ෂය මෙසේ උදෙසා වදාළ සේක:\n\n“ඉවසීම උතුම්ම තපසයි, දරාගැනීමයි. නිවන උතුම් යැයි බුදුවරු වදාරති. අනුන්ට හිංසා කරන්නා පැවිද්දෙකු නොවෙයි. අනුන් පීඩාවට පත් කරන්නා ශ්‍රමණෙකු නොවෙයි.\n\nසියලු පව් නොකිරීම, කුසල් රැස් කිරීම, තම සිත පිරිසිදු කර ගැනීම බුදුවරුන්ගේ අනුශාසනාවයි.\n\nඅනුන්ට අවලාද නොනැගීම, අනුන්ට හිංසා නොකිරීම, ප්‍රාතිමෝක්ෂ ශික්ෂා පදවලට අනුව සංවර වීම, ආහාර ගැනීමෙහි පමණ දැනීම, හුදෙකලා සෙනසුන්වල වාසය කිරීම, සිත දියුණු කිරීමෙහි නිරත වීම බුදුවරුන්ගේ අනුශාසනාවයි.\"",
      "paliTitle": ""
    },
    {
      "number": 91,
      "pali": "‘‘Ekamidāhaṃ, bhikkhave, samayaṃ ukkaṭṭhāyaṃ viharāmi subhagavane sālarājamūle. Tassa mayhaṃ, bhikkhave, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘na kho so sattāvāso sulabharūpo, yo mayā anāvutthapubbo [anajjhāvuṭṭhapubbo (ka. sī. ka.)] iminā dīghena addhunā aññatra suddhāvāsehi devehi. Yaṃnūnāhaṃ yena suddhāvāsā devā tenupasaṅkameyya’nti. Atha khvāhaṃ, bhikkhave, seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva ukkaṭṭhāyaṃ subhagavane sālarājamūle antarahito avihesu devesu pāturahosiṃ. Tasmiṃ, bhikkhave, devanikāye anekāni devatāsahassāni anekāni devatāsatasahassāni [anekāni devatāsatāni anekāni devatāsahassāni (syā.)] yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘ito so, mārisā, ekanavutikappe yaṃ vipassī bhagavā arahaṃ sammāsambuddho loke udapādi. Vipassī, mārisā, bhagavā arahaṃ sammāsambuddho khattiyo jātiyā ahosi, khattiyakule udapādi. Vipassī, mārisā, bhagavā arahaṃ sammāsambuddho koṇḍañño gottena ahosi. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa asītivassasahassāni āyuppamāṇaṃ ahosi. Vipassī, mārisā, bhagavā arahaṃ sammāsambuddho pāṭaliyā mūle abhisambuddho. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa khaṇḍatissaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa tayo sāvakānaṃ sannipātā ahesuṃ. Eko sāvakānaṃ sannipāto ahosi aṭṭhasaṭṭhibhikkhusatasahassaṃ. Eko sāvakānaṃ sannipāto ahosi bhikkhusatasahassaṃ. Eko sāvakānaṃ sannipāto ahosi asītibhikkhusahassāni. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa ime tayo sāvakānaṃ sannipātā ahesuṃ sabbesaṃyeva khīṇāsavānaṃ. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa asoko nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Vipassissa, mārisa, bhagavato arahato sammāsambuddhassa bandhumā nāma rājā pitā ahosi. Bandhumatī nāma devī mātā ahosi janetti. Bandhumassa rañño bandhumatī nāma nagaraṃ rājadhānī ahosi. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa evaṃ abhinikkhamanaṃ ahosi evaṃ pabbajjā evaṃ padhānaṃ evaṃ abhisambodhi evaṃ dhammacakkappavattanaṃ. Te mayaṃ, mārisā, vipassimhi bhagavati brahmacariyaṃ caritvā kāmesu kāmacchandaṃ virājetvā idhūpapannā’ti …pe… ‘‘Tasmiṃyeva kho, bhikkhave, devanikāye anekāni devatāsahassāni anekāni devatāsatasahassāni [anekāni devatāsatāni anekāni devatāsahassāni (syā. evamuparipi)] yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘imasmiṃyeva kho, mārisā, bhaddakappe bhagavā etarahi arahaṃ sammāsambuddho loke uppanno. Bhagavā, mārisā, khattiyo jātiyā khattiyakule uppanno. Bhagavā, mārisā, gotamo gottena. Bhagavato, mārisā, appakaṃ āyuppamāṇaṃ parittaṃ lahukaṃ yo ciraṃ jīvati, so vassasataṃ appaṃ vā bhiyyo. Bhagavā, mārisā, assatthassa mūle abhisambuddho. Bhagavato, mārisā, sāriputtamoggallānaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Bhagavato, mārisā, eko sāvakānaṃ sannipāto ahosi aḍḍhateḷasāni bhikkhusatāni. Bhagavato, mārisā, ayaṃ eko sāvakānaṃ sannipāto ahosi sabbesaṃyeva khīṇāsavānaṃ. Bhagavato, mārisā, ānando nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Bhagavato, mārisā, suddhodano nāma rājā pitā ahosi. Māyā nāma devī mātā ahosi janetti. Kapilavatthu nāma nagaraṃ rājadhānī ahosi. Bhagavato, mārisā, evaṃ abhinikkhamanaṃ ahosi evaṃ pabbajjā evaṃ padhānaṃ evaṃ abhisambodhi evaṃ dhammacakkappavattanaṃ. Te mayaṃ, mārisā, bhagavati brahmacariyaṃ caritvā kāmesu kāmacchandaṃ virājetvā idhūpapannā’ti.",
      "english": "Monks, on one occasion, I was staying in Ukkaṭṭhā, in the Subhaga Forest, at the foot of a royal sal tree. While I was alone in seclusion, this thought arose in my mind: \"Except for the Pure Abodes, there is no realm of beings that I have not inhabited at some point during this long journey. Suppose I were to visit the devas of the Pure Abodes?\"\n\nThen, monks, just as easily as a strong person extends or retracts their arm, I vanished from the Subhaga Forest in Ukkaṭṭhā, at the foot of the royal sal tree, and appeared among the Aviha devas. Thousands upon thousands of devas approached me; they paid homage and stood to one side. Standing there, they said to me: \"Venerable sir, ninety-one eons ago, the Blessed Vipassī, the Arahant, the Perfectly Enlightened One, arose in the world. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, was a Khattiya by birth, born into a Khattiya family. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, was of the Koṇḍañña clan. The lifespan of Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, was eighty thousand years. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, attained enlightenment at the foot of a Pāṭalī tree. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, had a foremost pair of disciples named Khaṇḍa and Tissa. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, had three gatherings of disciples. One gathering consisted of six million, eight hundred thousand monks. One gathering consisted of one hundred thousand monks. One gathering consisted of eighty thousand monks. All three gatherings of Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, were composed entirely of monks who had eradicated their defilements. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, had a chief attendant named the monk Asoka. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, had a father named King Bandhumā, and his mother was Queen Bandhumatī. King Bandhumā's capital was named Bandhumatī. Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, had such a Great Renunciation, such an ordination, such striving, such an enlightenment, and such a turning of the Wheel of Dhamma. Having lived the holy life under Vipassī, and having become dispassionate towards sensual desire, we have been reborn here.\"\n\nMonks, in that same assembly of devas, thousands upon thousands of devas approached me; they paid homage and stood to one side. Standing there, they said to me: \"Venerable sir, in this very auspicious eon, the Blessed One, the Arahant, the Perfectly Enlightened One, has now arisen in the world. The Blessed One is a Khattiya by birth, born into a Khattiya family. The Blessed One is of the Gotama clan. The lifespan of the Blessed One is short, limited, and fleeting; one who lives long lives for a hundred years, or a little more. The Blessed One attained enlightenment at the foot of an Assattha tree. The Blessed One has a foremost pair of disciples named Sāriputta and Moggallāna. The Blessed One had one gathering of disciples consisting of twelve hundred and fifty monks. This gathering was composed entirely of monks who had eradicated their defilements. The Blessed One has a chief attendant named the monk Ānanda. The Blessed One had a father named King Suddhodana, and his mother was Queen Māyā. His capital was the city of Kapilavatthu. The Blessed One had such a Great Renunciation, such an ordination, such striving, such an enlightenment, and such a turning of the Wheel of Dhamma. Having lived the holy life under the Blessed One, and having become dispassionate towards sensual desire, we have been reborn here.\"",
      "sinhala": "මහණෙනි, එක් කලෙක මම උක්කට්ඨා නම් නගරයෙහි, සුභග වනයෙහි, සල් රජ ගසක් මුල වාසය කළෙමි. මහණෙනි, එසේ රහසිගතව, තනිව කල් ගත කරමින් සිටින මට මෙබඳු කල්පනාවක් ඇති විය: ‘ශුද්ධාවාසී දෙවියන් හැර, මම මේ දීර්ඝ කාලය තුළ වෙනත් සත්ත්ව වාසයක ඉපදී නැත. එබැවින් මම ශුද්ධාවාසී දෙවියන් වෙතට යන්නෙම් නම් යෙහෙකි.’\nමහණෙනි, බලවත් පුරුෂයෙක් හැකිළූ අතක් දිගු කරන්නාක් මෙන් හෝ දිගු කළ අතක් හකුළුවන්නාක් මෙන්, මම උක්කට්ඨා නුවර, සුභග වනයේ, සල් රජ ගස මුල අතුරුදහන් වී, ක්ෂණයකින් අවිහ නම් දෙව්ලොවෙහි පහළ වීමි.\nමහණෙනි, එහි දහස් ගණන් දෙවිවරු, සිය දහස් ගණන් දෙවිවරු මා වෙත පැමිණ මා වැඳ එකත්පසෙක සිට ගත්හ. එකත්පසෙක සිටි ඒ දෙවිවරු මට මෙසේ කීහ: ‘පින්වත්නි, මීට අනූ එක කල්පයකට පෙර විපස්සී නම් භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූ සේක. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ක්ෂත්‍රිය කුලයක උපත ලැබූහ. උන්වහන්සේ ගෝත්‍රයෙන් කොණ්ඩඤ්ඤ නම් වූහ. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ආයුෂ ප්‍රමාණය අවුරුදු අසූ දහසක් විය. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ පාඨලී වෘක්ෂය මුලදී බුද්ධත්වය ලබා ගත් සේක. උන්වහන්සේගේ අග්‍ර ශ්‍රාවකයන් වූ ඛණ්ඩ සහ තිස්ස නම් යුවළක් විය. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ශ්‍රාවක සමුළු තුනක් විය. එක් සමුළුවකට අට සැට ලක්ෂයක් භික්ෂූන් සහභාගී වූහ. තවත් සමුළුවකට ලක්ෂයක් භික්ෂූන් සහභාගී වූහ. තවත් සමුළුවකට අසූ දහසක් භික්ෂූන් සහභාගී වූහ. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ මේ ශ්‍රාවක සමුළු තුනටම සහභාගී වූ සියලු දෙනාම ක්ෂීණාශ්‍රවී වූහ. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ අග්‍ර උපස්ථායකයා අශෝක නම් භික්ෂුවක් විය. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා බන්ධුමා නම් රජෙක් විය. මව බන්ධුමතී නම් දේවිය විය. බන්ධුමා රජුගේ රාජධානිය බන්ධුමතී නම් නගරය විය. විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ අභිනිෂ්ක්‍රමණය, පැවිද්ද, වීර්යය, අභිසම්බෝධිය, ධර්ම චක්‍රය පැවැත්වීම ආදී සියල්ල මෙලෙස සිදු විය. පින්වත්නි, අපි විපස්සී භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචර්යාවෙහි හැසිර, කාමයන් කෙරෙහි ඇති ඇල්ම දුරු කොට මෙහි උපන්නෙමු.’\nමහණෙනි, ඒ දෙව්සමූහයා අතර තවත් දහස් ගණන් දෙවිවරු, සිය දහස් ගණන් දෙවිවරු මා වෙත පැමිණ මා වැඳ එකත්පසෙක සිට ගත්හ. එකත්පසෙක සිටි ඒ දෙවිවරු මට මෙසේ කීහ: ‘පින්වත්නි, මේ භද්‍ර කල්පයෙහිම භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වී සිටින සේක. භාග්‍යවතුන් වහන්සේ ක්ෂත්‍රිය කුලයක උපත ලැබූ සේක. උන්වහන්සේ ගෝත්‍රයෙන් ගෞතම නම් වන සේක. භාග්‍යවතුන් වහන්සේගේ ආයුෂ ප්‍රමාණය ඉතා අල්පය. යමෙක් වැඩි කලක් ජීවත් වේ නම් ඔහු අවුරුදු සියයක් හෝ ඊට මඳක් වැඩියෙන් ජීවත් වේ. භාග්‍යවතුන් වහන්සේ ඇසතු වෘක්ෂය මුලදී බුද්ධත්වය ලබා ගත් සේක. උන්වහන්සේගේ අග්‍ර ශ්‍රාවකයන් වූ සාරිපුත්ත සහ මොග්ගල්ලාන නම් යුවළක් විය. භාග්‍යවතුන් වහන්සේගේ එක් ශ්‍රාවක සමුළුවකට දොළොස්සිය පනහක් භික්ෂූන් සහභාගී වූහ. භාග්‍යවතුන් වහන්සේගේ මේ ශ්‍රාවක සමුළුවට සහභාගී වූ සියලු දෙනාම ක්ෂීණාශ්‍රවී වූහ. භාග්‍යවතුන් වහන්සේගේ අග්‍ර උපස්ථායකයා ආනන්ද නම් භික්ෂුවක් විය. භාග්‍යවතුන් වහන්සේගේ පියා සුද්ධෝදන නම් රජෙක් විය. මව මායා නම් දේවිය විය. රාජධානිය කපිලවස්තු නම් නගරය විය. භාග්‍යවතුන් වහන්සේගේ අභිනිෂ්ක්‍රමණය, පැවිද්ද, වීර්යය, අභිසම්බෝධිය, ධර්ම චක්‍රය පැවැත්වීම ආදී සියල්ල මෙලෙස සිදු විය. පින්වත්නි, අපි භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචර්යාවෙහි හැසිර, කාමයන් කෙරෙහි ඇති ඇල්ම දුරු කොට මෙහි උපන්නෙමු.’",
      "paliTitle": "Devatārocanaṃ",
      "englishTitle": "The Declaration to the Devas",
      "sinhalaTitle": "දේවතාවරෝචනය"
    },
    {
      "number": 92,
      "pali": "‘‘Atha khvāhaṃ, bhikkhave, avihehi devehi saddhiṃ yena atappā devā tenupasaṅkamiṃ…pe… atha khvāhaṃ, bhikkhave, avihehi ca devehi atappehi ca devehi saddhiṃ yena sudassā devā tenupasaṅkamiṃ. Atha khvāhaṃ, bhikkhave, avihehi ca devehi atappehi ca devehi sudassehi ca devehi saddhiṃ yena sudassī devā tenupasaṅkamiṃ. Atha khvāhaṃ, bhikkhave, avihehi ca devehi atappehi ca devehi sudassehi ca devehi sudassīhi ca devehi saddhiṃ yena akaniṭṭhā devā tenupasaṅkamiṃ. Tasmiṃ, bhikkhave, devanikāye anekāni devatāsahassāni anekāni devatāsatasahassāni yenāhaṃ tenupasaṅkamiṃsu, upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. ‘‘Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘ito so, mārisā, ekanavutikappe yaṃ vipassī bhagavā arahaṃ sammāsambuddho loke udapādi. Vipassī, mārisā, bhagavā arahaṃ sammāsambuddho khattiyo jātiyā ahosi. Khattiyakule udapādi. Vipassī, mārisā, bhagavā arahaṃ sammāsambuddho koṇḍañño gottena ahosi. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa asītivassasahassāni āyuppamāṇaṃ ahosi. Vipassī, mārisā, bhagavā arahaṃ sammāsambuddho pāṭaliyā mūle abhisambuddho. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa khaṇḍatissaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa tayo sāvakānaṃ sannipātā ahesuṃ. Eko sāvakānaṃ sannipāto ahosi aṭṭhasaṭṭhibhikkhusatasahassaṃ. Eko sāvakānaṃ sannipāto ahosi bhikkhusatasahassaṃ. Eko sāvakānaṃ sannipāto ahosi asītibhikkhusahassāni. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa ime tayo sāvakānaṃ sannipātā ahesuṃ sabbesaṃyeva khīṇāsavānaṃ. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa asoko nāma bhikkhu upaṭṭhāko ahosi aggupaṭṭhāko. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa bandhumā nāma rājā pitā ahosi bandhumatī nāma devī mātā ahosi janetti. Bandhumassa rañño bandhumatī nāma nagaraṃ rājadhānī ahosi. Vipassissa, mārisā, bhagavato arahato sammāsambuddhassa evaṃ abhinikkhamanaṃ ahosi evaṃ pabbajjā evaṃ padhānaṃ evaṃ abhisambodhi, evaṃ dhammacakkappavattanaṃ. Te mayaṃ, mārisā, vipassimhi bhagavati brahmacariyaṃ caritvā kāmesu kāmacchandaṃ virājetvā idhūpapannā’ti. Tasmiṃyeva kho, bhikkhave, devanikāye anekāni devatāsahassāni anekāni devatāsatasahassāni yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘ito so, mārisā, ekatiṃse kappe yaṃ sikhī bhagavā…pe… te mayaṃ, mārisā, sikhimhi bhagavati tasmiññeva kho mārisā, ekatiṃse kappe yaṃ vessabhū bhagavā…pe… te mayaṃ, mārisā, vessabhumhi bhagavati…pe… imasmiṃyeva kho, mārisā, bhaddakappe kakusandho koṇāgamano kassapo bhagavā…pe… te mayaṃ, mārisā, kakusandhamhi koṇāgamanamhi kassapamhi bhagavati brahmacariyaṃ caritvā kāmesu kāmacchandaṃ virājetvā idhūpapannā’ti.",
      "english": "Then, bhikkhus, accompanied by the Avihā devas, I approached the Atappā devas. Then, bhikkhus, accompanied by the Avihā and Atappā devas, I approached the Sudassā devas. Then, bhikkhus, accompanied by the Avihā, Atappā, and Sudassā devas, I approached the Sudassī devas. Then, bhikkhus, accompanied by the Avihā, Atappā, Sudassā, and Sudassī devas, I approached the Akaniṭṭha devas.\n\nIn that assembly of devas, bhikkhus, many thousands, many hundreds of thousands of devas came to me. Having approached, they saluted me and stood to one side. Standing to one side, bhikkhus, those devas said to me: \"Good sirs, ninety-one aeons ago, Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, arose in the world. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, was born into the Khattiya caste, arising in a Khattiya family. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, was of the Koṇḍañña clan. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, had a lifespan of eighty thousand years. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, attained perfect enlightenment under a pāṭalī tree. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, had Khaṇḍa and Tissa as his foremost pair of excellent disciples. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, had three assemblies of disciples: one of six million eight hundred thousand bhikkhus, one of one hundred thousand bhikkhus, and one of eighty thousand bhikkhus. All three assemblies of Vipassī, the Blessed One, the Arahant, the Perfectly Enlightened One, consisted entirely of arahants, free from defilements. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, had the bhikkhu Asoka as his foremost attendant. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, had King Bandhumā as his father and Queen Bandhumatī as his mother. King Bandhumā's capital city was named Bandhumatī. Vipassī, good sirs, the Blessed One, the Arahant, the Perfectly Enlightened One, had such a going forth, such an ordination, such exertion, such perfect enlightenment, such a setting in motion of the Wheel of Dhamma. We, good sirs, having lived the holy life under Vipassī, the Blessed One, having eradicated sensual desire, were reborn here.\"\n\nIn that very assembly of devas, bhikkhus, many thousands, many hundreds of thousands of devas came to me. Having approached, they saluted me and stood to one side. Standing to one side, bhikkhus, those devas said to me: \"Good sirs, thirty-one aeons ago, Sikhī, the Blessed One... We, good sirs, having lived the holy life under Sikhī, the Blessed One, having eradicated sensual desire, were reborn here. In that same thirty-first aeon, good sirs, Vessabhū, the Blessed One... We, good sirs, having lived the holy life under Vessabhū, the Blessed One, having eradicated sensual desire, were reborn here. In this very auspicious aeon, good sirs, Kakusandha, Koṇāgamana, and Kassapa, the Blessed Ones... We, good sirs, having lived the holy life under Kakusandha, Koṇāgamana, and Kassapa, the Blessed Ones, having eradicated sensual desire, were reborn here.\"",
      "sinhala": "මහණෙනි, අනතුරුව මම අවිහ දෙවියන් සමඟ අතප්ප දෙවියන් වෙතටත්, අවිහ සහ අතප්ප දෙවියන් සමඟ සුදස්ස දෙවියන් වෙතටත්, අවිහ, අතප්ප, සුදස්ස යන දෙවියන් සමඟ සුදස්සී දෙවියන් වෙතටත්, අවිහ, අතප්ප, සුදස්ස, සුදස්සී යන දෙවියන් සමඟ අකනිට්ඨ දෙවියන් වෙතටත් පැමිණියෙමි. මහණෙනි, ඒ දෙව් නිකායෙහි දහස් ගණන් දෙවිවරුද, ලක්ෂ ගණන් දෙවිවරුද මා වෙත පැමිණ මා වැඳ එකත්පසින් සිට ගත්හ.\n\nමහණෙනි, එකත්පසින් සිටි ඒ දෙවිවරු මට මෙසේ කීහ: “පින්වත්නි, මීට අනූ එක කල්පයකට පෙර විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වූහ. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ක්ෂත්‍රිය කුලයක උපන් ක්ෂත්‍රිය වංශිකයෙකි. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ කොණ්ඩඤ්ඤ ගෝත්‍රයට අයත් වූහ. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ආයුෂ ප්‍රමාණය වසර අසූ දහසකි. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ පාටලී වෘක්ෂය මුලදී සම්බුද්ධත්වය ලබා ගත්හ. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේට අග්‍ර ශ්‍රාවකයන් වූ ඛණ්ඩ සහ තිස්ස යන ශ්‍රාවක යුගලක් විය. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ශ්‍රාවකයන්ගේ රැස්වීම් තුනක් විය. එක් ශ්‍රාවක රැස්වීමක් හැට අට ලක්ෂයක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක රැස්වීමක් ලක්ෂයක් භික්ෂූන්ගෙන් සමන්විත විය. එක් ශ්‍රාවක රැස්වීමක් අසූ දහසක් භික්ෂූන්ගෙන් සමන්විත විය. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ඒ ශ්‍රාවක රැස්වීම් තුනම ක්ෂීණාශ්‍රවයන්ගෙන් යුක්ත විය. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ අශෝක නම් භික්ෂුව අග්‍ර උපස්ථායක විය. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ පියා බන්ධුමා නම් රජතුමා වූ අතර මව බන්ධුමතී නම් දේවිය විය. බන්ධුමා රජතුමාගේ රාජධානිය බන්ධුමතී නම් නගරය විය. පින්වත්නි, විපස්සී භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේගේ ගිහිගෙයින් නික්ම යාම, පැවිදි වීම, වීර්යය කිරීම, සම්බෝධිය ලැබීම සහ ධර්ම චක්‍රය පැවැත්වීම මෙලෙස සිදු විය. පින්වත්නි, අපි විපස්සී භාග්‍යවතුන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාවෙහි හැසිර, කාමයන් කෙරෙහි ඇති කාමච්ඡන්දය දුරු කොට මෙහි උපන්නෙමු.”\n\nමහණෙනි, ඒ දෙව් නිකායෙහිම දහස් ගණන් දෙවිවරුද, ලක්ෂ ගණන් දෙවිවරුද මා වෙත පැමිණ මා වැඳ එකත්පසින් සිට ගත්හ. මහණෙනි, එකත්පසින් සිටි ඒ දෙවිවරු මට මෙසේ කීහ: “පින්වත්නි, මීට තිස් එක් කල්පයකට පෙර සිඛී භාග්‍යවතුන් වහන්සේ ලොව පහළ වූහ… (පෙ)… පින්වත්නි, අපි සිඛී භාග්‍යවතුන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාවෙහි හැසිර, කාමයන් කෙරෙහි ඇති කාමච්ඡන්දය දුරු කොට මෙහි උපන්නෙමු.” පින්වත්නි, ඒ තිස් එක්වන කල්පයේම වෙස්සභූ භාග්‍යවතුන් වහන්සේද ලොව පහළ වූහ… (පෙ)… පින්වත්නි, අපි වෙස්සභූ භාග්‍යවතුන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාවෙහි හැසිර, කාමයන් කෙරෙහි ඇති කාමච්ඡන්දය දුරු කොට මෙහි උපන්නෙමු… (පෙ)… පින්වත්නි, මේ භද්‍ර කල්පයෙහි කකුසන්ධ, කෝණාගමන, කාශ්‍යප යන භාග්‍යවතුන් වහන්සේලා ලොව පහළ වූහ… (පෙ)… පින්වත්නි, අපි කකුසන්ධ, කෝණාගමන, කාශ්‍යප යන භාග්‍යවතුන් වහන්සේලාගේ ශාසනයෙහි බ්‍රහ්මචර්යාවෙහි හැසිර, කාමයන් කෙරෙහි ඇති කාමච්ඡන්දය දුරු කොට මෙහි උපන්නෙමු.”",
      "paliTitle": ""
    },
    {
      "number": 93,
      "pali": "‘‘Tasmiṃyeva kho, bhikkhave, devanikāye anekāni devatāsahassāni anekāni devatāsatasahassāni yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘imasmiṃyeva kho, mārisā, bhaddakappe bhagavā etarahi arahaṃ sammāsambuddho loke uppanno. Bhagavā, mārisā, khattiyo jātiyā, khattiyakule uppanno. Bhagavā, mārisā, gotamo gottena. Bhagavato, mārisā, appakaṃ āyuppamāṇaṃ parittaṃ lahukaṃ yo ciraṃ jīvati, so vassasataṃ appaṃ vā bhiyyo. Bhagavā, mārisā, assatthassa mūle abhisambuddho. Bhagavato, mārisā, sāriputtamoggallānaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Bhagavato, mārisā, eko sāvakānaṃ sannipāto ahosi aḍḍhateḷasāni bhikkhusatāni. Bhagavato, mārisā, ayaṃ eko sāvakānaṃ sannipāto ahosi sabbesaṃyeva khīṇāsavānaṃ. Bhagavato, mārisā, ānando nāma bhikkhu upaṭṭhāko aggupaṭṭhāko ahosi. Bhagavato, mārisā, suddhodano nāma rājā pitā ahosi. Māyā nāma devī mātā ahosi janetti. Kapilavatthu nāma nagaraṃ rājadhānī ahosi. Bhagavato, mārisā, evaṃ abhinikkhamanaṃ ahosi, evaṃ pabbajjā, evaṃ padhānaṃ, evaṃ abhisambodhi, evaṃ dhammacakkappavattanaṃ. Te mayaṃ, mārisā, bhagavati brahmacariyaṃ caritvā kāmesu kāmacchandaṃ virājetvā idhūpapannā’ti.",
      "english": "Indeed, bhikkhus, in that very assembly of deities, many thousands and hundreds of thousands of deities approached me. Having approached, they paid homage to me and stood to one side. Standing to one side, bhikkhus, those deities said this to me: ‘Indeed, venerable sirs, in this auspicious eon, the Blessed One, the Arahant, the Perfectly Enlightened One, has now arisen in the world. The Blessed One, venerable sirs, is a khattiya by birth, born into a khattiya family. The Blessed One, venerable sirs, is of the Gotama clan. The Blessed One’s lifespan, venerable sirs, is short, limited, and fleeting; whoever lives long, lives for a hundred years or a little more. The Blessed One, venerable sirs, attained full enlightenment at the foot of an Assattha tree. The Blessed One, venerable sirs, had a pair of disciples named Sariputta and Moggallana, the foremost and most auspicious pair. The Blessed One, venerable sirs, had one assembly of disciples numbering twelve hundred and fifty monks. This assembly of disciples, venerable sirs, was composed entirely of those whose corruptions were destroyed. The Blessed One, venerable sirs, had a monk named Ananda, the foremost attendant. The Blessed One, venerable sirs, had a father named King Suddhodana. His mother, who gave him birth, was Queen Maya. The city of Kapilavatthu was his royal capital. Such, venerable sirs, was the Blessed One’s renunciation, such his going forth, such his striving, such his enlightenment, such his turning of the Wheel of Dhamma. We, venerable sirs, having lived the holy life under the Blessed One and shed desire for sensual pleasures, have been reborn here.’",
      "sinhala": "මහණෙනි, එම දෙව්ලොවෙහි දෙවියන් දහස් ගණනක්, ලක්ෂ ගණනක් මා වෙත පැමිණියහ. පැමිණ මට ආචාර කොට එකත්පසෙකින් සිට ගත්හ. මහණෙනි, එකත්පසෙකින් සිටි ඒ දෙවතාවෝ මට මෙසේ කීහ: ‘පින්වත්නි, මේ භද්‍ර කල්පයෙහිම භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ලොව පහළ වී සිටින සේක. පින්වත්නි, භාග්‍යවතුන් වහන්සේ ජාතියෙන් ක්ෂත්‍රියය, ක්ෂත්‍රිය කුලයක උපන් සේක. භාග්‍යවතුන් වහන්සේ ගෝතම ගෝත්‍රයට අයත් සේක. පින්වත්නි, භාග්‍යවතුන් වහන්සේගේ ආයුෂ ප්‍රමාණය ඉතා ස්වල්පය. යමෙක් බොහෝ කල් ජීවත් වේ නම් ඔහු අවුරුදු සියයක් හෝ ඊට ටිකක් වැඩියෙන් ජීවත් වෙයි. පින්වත්නි, භාග්‍යවතුන් වහන්සේ ඇසතු රුක් මුලදී සම්බුද්ධත්වයට පත් වූ සේක. පින්වත්නි, සැරියුත් මුගලන් යන අග්‍ර ශ්‍රාවක යුගල භාග්‍යවතුන් වහන්සේට වූහ. උන්වහන්සේලා අග්‍ර වූ භද්‍ර යුගලයකි. පින්වත්නි, භාග්‍යවතුන් වහන්සේගේ එක් ශ්‍රාවක සමූහයක් විය. දොළොස්සිය පනහක් භික්ෂූන් එහි වූහ. පින්වත්නි, භාග්‍යවතුන් වහන්සේට එක් ශ්‍රාවක සමූහයක් විය, එහි සිටි සියලු දෙනාම ක්ෂීණාශ්‍රවයෝ වූහ. පින්වත්නි, ආනන්ද නම් භික්ෂුව භාග්‍යවතුන් වහන්සේගේ අග්‍ර උපස්ථායක වූහ. පින්වත්නි, සුද්ධෝදන රජතුමා පියා වූ අතර මායා දේවිය මව වූවාය. කපිලවස්තුව නම් නගරය රාජධානිය විය. පින්වත්නි, භාග්‍යවතුන් වහන්සේගේ මහාභිනිෂ්ක්‍රමණය මෙසේ විය. පැවිද්ද මෙසේ විය. උන්වහන්සේගේ වීර්යය මෙසේ විය. අභිසම්බෝධිය හා ධර්මචක්‍රය පැවැත්වීම මෙසේ විය. පින්වත්නි, අපි භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචර්යාවෙහි හැසිර, කාමයන් කෙරෙහි ඇති ඇල්ම දුරු කොට මෙහි ඉපදුනෙමු.’",
      "paliTitle": ""
    },
    {
      "number": 94,
      "pali": "‘‘Iti kho, bhikkhave, tathāgatassevesā dhammadhātu suppaṭividdhā, yassā dhammadhātuyā suppaṭividdhattā tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati ‘evaṃjaccā te bhagavanto ahesuṃ’ itipi. ‘Evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ’ itipīti. ‘‘Devatāpi tathāgatassa etamatthaṃ ārocesuṃ, yena tathāgato atīte buddhe parinibbute chinnapapañce chinnavaṭume pariyādinnavaṭṭe sabbadukkhavītivatte jātitopi anussarati, nāmatopi anussarati, gottatopi anussarati, āyuppamāṇatopi anussarati, sāvakayugatopi anussarati, sāvakasannipātatopi anussarati ‘evaṃjaccā te bhagavanto ahesuṃ’ itipi. ‘Evaṃnāmā evaṃgottā evaṃsīlā evaṃdhammā evaṃpaññā evaṃvihārī evaṃvimuttā te bhagavanto ahesuṃ’ itipī’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Mahāpadānasuttaṃ niṭṭhitaṃ paṭhamaṃ.",
      "english": "Thus, monks, it is this very fundamental nature of reality that the Tathāgata has thoroughly penetrated. Due to the thorough penetration of this fundamental nature of reality, the Tathāgata recollects the Buddhas of the past, who were fully extinguished, whose mental proliferation was cut off, whose rounds of defilements were cut off, whose cycle of existence was exhausted, and who transcended all suffering. He recollects their birth, recollects their name, recollects their clan, recollects their lifespan, recollects their pair of chief disciples, and recollects their assembly of disciples, remembering: ‘Such was the birth of those Blessed Ones.’ And he remembers: ‘Of such a name, of such a clan, of such morality, of such teachings, of such wisdom, of such a way of living, of such liberation were those Blessed Ones.’\n\nEven devas reported this matter to the Tathāgata, by which the Tathāgata recollects the Buddhas of the past, who were fully extinguished, whose mental proliferation was cut off, whose rounds of defilements were cut off, whose cycle of existence was exhausted, and who transcended all suffering. He recollects their birth, recollects their name, recollects their clan, recollects their lifespan, recollects their pair of chief disciples, and recollects their assembly of disciples, remembering: ‘Such was the birth of those Blessed Ones.’ And he remembers: ‘Of such a name, of such a clan, of such morality, of such teachings, of such wisdom, of such a way of living, of such liberation were those Blessed Ones.’\n\nThe Blessed One said this. Those monks, delighted, rejoiced in the Blessed One's words. The first Mahāpadāna Sutta is concluded.",
      "sinhala": "මහණෙනි, තථාගතයන් වහන්සේ විසින් මේ ධර්ම ධාතුව මැනවින් අවබෝධ කරගෙන ඇත. යම් ධර්ම ධාතුවක් මැනවින් අවබෝධ කරගැනීම හේතුවෙන් තථාගතයන් වහන්සේ අතීතයේ පිරිනිවන් පෑ, ප්‍රපංච රහිත, මුල් සිඳී ගිය, සංසාර චක්‍රය අවසන් කළ, සියලු දුක්ඛයන්ගෙන් මිදුණු බුදුවරුන්ගේ ජාතිය, නාමය, ගෝත්‍රය, ආයුෂ ප්‍රමාණය, ශ්‍රාවක යුගය සහ ශ්‍රාවක සමූහය මෙලෙස සිහිපත් කරති. ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි ජාතිවල උපන් අය වූහ’. ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි නාමයන්ගෙන්, මෙවැනි ගෝත්‍රයන්ගෙන්, මෙවැනි සීලයන්ගෙන්, මෙවැනි ධර්මයන්ගෙන්, මෙවැනි ප්‍රඥාවන්ගෙන්, මෙවැනි විහරණයන්ගෙන් හා මෙවැනි විමුක්තීන්ගෙන් යුක්ත වූහ’.\n\nදේවතාවෝද තථාගතයන් වහන්සේට මේ කාරණය සැල කළහ. එබැවින් තථාගතයන් වහන්සේ අතීතයේ පිරිනිවන් පෑ, ප්‍රපංච රහිත, මුල් සිඳී ගිය, සංසාර චක්‍රය අවසන් කළ, සියලු දුක්ඛයන්ගෙන් මිදුණු බුදුවරුන්ගේ ජාතිය, නාමය, ගෝත්‍රය, ආයුෂ ප්‍රමාණය, ශ්‍රාවක යුගය සහ ශ්‍රාවක සමූහය මෙලෙස සිහිපත් කරති. ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි ජාතිවල උපන් අය වූහ’. ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවැනි නාමයන්ගෙන්, මෙවැනි ගෝත්‍රයන්ගෙන්, මෙවැනි සීලයන්ගෙන්, මෙවැනි ධර්මයන්ගෙන්, මෙවැනි ප්‍රඥාවන්ගෙන්, මෙවැනි විහරණයන්ගෙන් හා මෙවැනි විමුක්තීන්ගෙන් යුක්ත වූහ’. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ඒ භික්ෂූන් වහන්සේලා සතුටු සිත් ඇතිව භාග්‍යවතුන් වහන්සේගේ වචනය අනුමෝදන් වූහ. මහාපදාන සූත්‍රය, පළමුවැන්න, නිමා විය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahāpadānasuttaṃ niṭṭhitaṃ paṭhamaṃ",
    "english": "The Great Legend Discourse: First [section] concluded.",
    "sinhala": "මහාපදාන සූත්‍රය නිමි. පළමුවන."
  }
}