{
  "id": "dn.2.9",
  "title": {
    "pali": "Mahāsatipaṭṭhānasuttaṃ",
    "english": "The Great Discourse on the Foundations of Mindfulness",
    "sinhala": "මහාසතිපට්ඨාන සූත්‍රය"
  },
  "sections": [
    {
      "number": 372,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kurūsu viharati kammāsadhammaṃ nāma kurūnaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhaddante’’ti [bhadanteti (sī. syā. pī.)] te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca",
      "english": "Thus I have heard. On one occasion the Blessed One was living among the Kurus, at the Kuru market town named Kammāsadhamma. There, the Blessed One addressed the monks: \"Monks.\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this:",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. භාග්‍යවතුන් වහන්සේ එක් කලෙක කුරු රටෙහි, කුරු රටවැසියන්ගේ කම්මාසදම්ම නම් නියම් ගමෙහි වැඩ වාසය කළ සේක. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා, \"මහණෙනි,\" යැයි වදාළ සේක. \"එසේය, භාග්‍යවතුන් වහන්ස,\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 373,
      "pali": "‘‘Ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā, sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ cattāro satipaṭṭhānā. ‘‘Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ, vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ, citte cittānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ, dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Uddeso niṭṭhito.",
      "english": "Monks, this is the direct path for the purification of beings, for the surmounting of sorrow and lamentation, for the cessation of pain and displeasure, for the attainment of right knowledge, and for the realization of Nibbana: that is, the four establishments of mindfulness.\n\nAnd what are the four? Here, monks, a monk dwells contemplating the body as body, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating feelings as feelings, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating mind as mind, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure in regard to the world. He dwells contemplating phenomena as phenomena, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure in regard to the world. The introduction is finished.",
      "sinhala": "මහණෙනි, සත්වයන්ගේ පිරිසිදු බව පිණිසත්, ශෝක වැළපීම් දුරු කිරීම පිණිසත්, දුක් දොම්නස් නැති කිරීම පිණිසත්, ඤායධර්මය අවබෝධ කර ගැනීම පිණිසත්, නිවන සාක්ෂාත් කිරීම පිණිසත් ඇති එකම මාර්ගය සතර සතිපට්ඨානයන් ය.\n\nඒ සතර කවරේද යත්: මහණෙනි, මෙහි භික්ෂුව කායෙහි කායානුපස්සීව, වීර්යය ඇතිව, මනා සිහියෙන් හා නුවණින් යුතුව ලෝකය කෙරෙහි ඇති ආශාව හා දොම්නස දුරු කරමින් වාසය කරයි. වේදනාවන්හි වේදනානුපස්සීව, වීර්යය ඇතිව, මනා සිහියෙන් හා නුවණින් යුතුව ලෝකය කෙරෙහි ඇති ආශාව හා දොම්නස දුරු කරමින් වාසය කරයි. සිතෙහි චිත්තානුපස්සීව, වීර්යය ඇතිව, මනා සිහියෙන් හා නුවණින් යුතුව ලෝකය කෙරෙහි ඇති ආශාව හා දොම්නස දුරු කරමින් වාසය කරයි. ධර්මයන්හි ධම්මානුපස්සීව, වීර්යය ඇතිව, මනා සිහියෙන් හා නුවණින් යුතුව ලෝකය කෙරෙහි ඇති ආශාව හා දොම්නස දුරු කරමින් වාසය කරයි. දේශනාවේ සාරාංශය මෙයින් නිම වේ.",
      "paliTitle": "Uddeso",
      "englishTitle": "Summary",
      "sinhalaTitle": "උද්දේසය"
    },
    {
      "number": 374,
      "pali": "‘‘Kathañca pana, bhikkhave, bhikkhu kāye kāyānupassī viharati? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati. Dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti, dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti. Rassaṃ vā assasanto ‘rassaṃ assasāmī’ti pajānāti, rassaṃ vā passasanto ‘rassaṃ passasāmī’ti pajānāti. ‘Sabbakāyapaṭisaṃvedī assasissāmī’ti sikkhati, ‘sabbakāyapaṭisaṃvedī passasissāmī’ti sikkhati. ‘Passambhayaṃ kāyasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ kāyasaṅkhāraṃ passasissāmī’ti sikkhati. ‘‘Seyyathāpi, bhikkhave, dakkho bhamakāro vā bhamakārantevāsī vā dīghaṃ vā añchanto ‘dīghaṃ añchāmī’ti pajānāti, rassaṃ vā añchanto ‘rassaṃ añchāmī’ti pajānāti evameva kho, bhikkhave, bhikkhu dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti, dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti, rassaṃ vā assasanto ‘rassaṃ assasāmī’ti pajānāti, rassaṃ vā passasanto ‘rassaṃ passasāmī’ti pajānāti. ‘Sabbakāyapaṭisaṃvedī assasissāmī’ti sikkhati, ‘sabbakāyapaṭisaṃvedī passasissāmī’ti sikkhati, ‘passambhayaṃ kāyasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ kāyasaṅkhāraṃ passasissāmī’ti sikkhati. Iti ajjhattaṃ vā kāye kāyānupassī viharati, bahiddhā vā kāye kāyānupassī viharati, ajjhattabahiddhā vā kāye kāyānupassī viharati. Samudayadhammānupassī vā kāyasmiṃ viharati, vayadhammānupassī vā kāyasmiṃ viharati, samudayavayadhammānupassī vā kāyasmiṃ viharati. ‘Atthi kāyo’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho [evampi (sī. syā. pī.)], bhikkhave, bhikkhu kāye kāyānupassī viharati. Ānāpānapabbaṃ niṭṭhitaṃ. ",
      "english": "How, monks, does a monk dwell contemplating the body in the body? Here, monks, a monk, having gone to a forest, to the foot of a tree, or to an empty dwelling, sits down cross-legged, keeping his body erect, and establishing mindfulness in front of him. Always mindful, he breathes in; always mindful, he breathes out. Breathing in long, he understands, ‘I am breathing in long’; breathing out long, he understands, ‘I am breathing out long.’ Breathing in short, he understands, ‘I am breathing in short’; breathing out short, he understands, ‘I am breathing out short.’ He trains himself, ‘I will breathe in experiencing the whole body’; he trains himself, ‘I will breathe out experiencing the whole body.’ He trains himself, ‘I will breathe in calming the bodily formation’; he trains himself, ‘I will breathe out calming the bodily formation.’\n\nJust as, monks, a skilled turner or a turner’s apprentice, when making a long turn, understands, ‘I am making a long turn’; or when making a short turn, understands, ‘I am making a short turn’—so too, monks, a monk, breathing in long, understands, ‘I am breathing in long’; breathing out long, he understands, ‘I am breathing out long.’ Breathing in short, he understands, ‘I am breathing in short’; breathing out short, he understands, ‘I am breathing out short.’ He trains himself, ‘I will breathe in experiencing the whole body’; he trains himself, ‘I will breathe out experiencing the whole body.’ He trains himself, ‘I will breathe in calming the bodily formation’; he trains himself, ‘I will breathe out calming the bodily formation.’\n\nThus, he dwells contemplating the body in the body internally, or he dwells contemplating the body in the body externally, or he dwells contemplating the body in the body both internally and externally. He dwells contemplating the nature of arising in the body, or he dwells contemplating the nature of passing away in the body, or he dwells contemplating the nature of both arising and passing away in the body. Or his mindfulness that ‘there is a body’ is established in him to the extent necessary for knowledge and remembrance only. And he dwells detached, and he clings to nothing in the world. In this way, monks, a monk dwells contemplating the body in the body. The section on mindfulness of breathing is complete.",
      "sinhala": "මහණෙනි, භික්ෂුවක් කයෙහි කය අනුපස්සනා කරමින් වාසය කරන්නේ කෙසේද? මහණෙනි, මේ සස්නෙහි භික්ෂුවක් වනයට ගොස් හෝ, රුක් මුලකට ගොස් හෝ, හිස් ගෙයකට ගොස් හෝ, පර්‍යංකයක් බැඳ, කය ඍජුව තබා, සිහිය එළඹ සිටුවා වාඩි වෙයි. හෙතෙම සිහියෙන් යුතුව ආශ්වාස කරයි; සිහියෙන් යුතුව ප්‍රශ්වාස කරයි. දිගු ආශ්වාසයක් කරන්නේ නම්, ‘මම දිගු ආශ්වාසයක් කරමි’යි දැන ගනී. දිගු ප්‍රශ්වාසයක් කරන්නේ නම්, ‘මම දිගු ප්‍රශ්වාසයක් කරමි’යි දැන ගනී. කෙටි ආශ්වාසයක් කරන්නේ නම්, ‘මම කෙටි ආශ්වාසයක් කරමි’යි දැන ගනී. කෙටි ප්‍රශ්වාසයක් කරන්නේ නම්, ‘මම කෙටි ප්‍රශ්වාසයක් කරමි’යි දැන ගනී. ‘මුළු කයම විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘මුළු කයම විඳිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘කය සංසිඳුවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘කය සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි.\n\nමහණෙනි, දක්ෂ වඩුවෙක් හෝ වඩු සහායකයෙක් හෝ දිගට අදින විට ‘මම දිගට අදින්නෙමි’යි දන්නාක් මෙන්, කොටට අදින විට ‘මම කොටට අදින්නෙමි’යි දන්නාක් මෙන්, මහණෙනි, භික්ෂුව දිගු ආශ්වාසයක් කරන්නේ නම්, ‘මම දිගු ආශ්වාසයක් කරමි’යි දැන ගනී. දිගු ප්‍රශ්වාසයක් කරන්නේ නම්, ‘මම දිගු ප්‍රශ්වාසයක් කරමි’යි දැන ගනී. කෙටි ආශ්වාසයක් කරන්නේ නම්, ‘මම කෙටි ආශ්වාසයක් කරමි’යි දැන ගනී. කෙටි ප්‍රශ්වාසයක් කරන්නේ නම්, ‘මම කෙටි ප්‍රශ්වාසයක් කරමි’යි දැන ගනී. ‘මුළු කයම විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘මුළු කයම විඳිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘කය සංසිඳුවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘කය සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි.\n\nමෙසේ ඔහු තමාගේ කයෙහි කය අනුපස්සනා කරමින් වාසය කරයි. නැතහොත් අනුන්ගේ කයෙහි කය අනුපස්සනා කරමින් වාසය කරයි. නැතහොත් තමාගේ සහ අනුන්ගේ කයෙහි කය අනුපස්සනා කරමින් වාසය කරයි. කයෙහි හටගැනීමේ ස්වභාවය දකිමින් වාසය කරයි. කයෙහි නැතිවී යාමේ ස්වභාවය දකිමින් වාසය කරයි. කයෙහි හටගැනීමේ හා නැතිවී යාමේ ස්වභාවය දකිමින් වාසය කරයි. ‘කය ඇත’ යන සිහිය ඔහුට පිහිටන්නේ ඥානය පිණිස පමණක් ද සිහිය පිණිස පමණක් ද වේ. ඔහු තෘෂ්ණාවෙන් තොරව වාසය කරයි. ලෝකයේ කිසිවක් තෘෂ්ණාවෙන් නොගනී. මහණෙනි, මෙලෙස ද භික්ෂුව කයෙහි කය අනුපස්සනා කරමින් වාසය කරයි.\n\nආනාපාන පබ්බය නිමි.",
      "paliTitle": "Kāyānupassanā ānāpānapabbaṃ",
      "englishTitle": "Contemplation of the Body: Breath Section",
      "sinhalaTitle": "කායානුපස්සනා ආනාපාන පබ්බය"
    },
    {
      "number": 375,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu gacchanto vā ‘gacchāmī’ti pajānāti, ṭhito vā ‘ṭhitomhī’ti pajānāti, nisinno vā ‘nisinnomhī’ti pajānāti, sayāno vā ‘sayānomhī’ti pajānāti, yathā yathā vā panassa kāyo paṇihito hoti, tathā tathā naṃ pajānāti. Iti ajjhattaṃ vā kāye kāyānupassī viharati, bahiddhā vā kāye kāyānupassī viharati, ajjhattabahiddhā vā kāye kāyānupassī viharati. Samudayadhammānupassī vā kāyasmiṃ viharati, vayadhammānupassī vā kāyasmiṃ viharati, samudayavayadhammānupassī vā kāyasmiṃ viharati. ‘Atthi kāyo’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu kāye kāyānupassī viharati. Iriyāpathapabbaṃ niṭṭhitaṃ. ",
      "english": "Furthermore, monks, when walking, a monk understands, 'I am walking.' When standing, he understands, 'I am standing.' When sitting, he understands, 'I am sitting.' When lying down, he understands, 'I am lying down.' However his body is disposed, he understands it accordingly. Thus, he dwells contemplating the body in the body internally, or he dwells contemplating the body in the body externally, or he dwells contemplating the body in the body both internally and externally. He dwells contemplating the nature of arising in the body, or he dwells contemplating the nature of passing away in the body, or he dwells contemplating the nature of both arising and passing away in the body. Or, mindfulness that 'there is a body' is established in him just for the sake of knowledge and remembrance. And he dwells detached, clinging to nothing in the world. In this way, too, monks, a monk dwells contemplating the body in the body. The section on bodily postures is complete.",
      "sinhala": "නැවතත්, මහණෙනි, භික්ෂුවක් ගමන් කරද්දී 'මම ගමන් කරමි'යි දැන ගනී. සිටින විට 'මම සිටිමි'යි දැන ගනී. හිඳින විට 'මම හිඳිමි'යි දැන ගනී. සයනය කරද්දී 'මම සයනය කරමි'යි දැන ගනී. ඔහුගේ කය යම් යම් ආකාරයකින් පිහිටා ඇත්නම්, ඒ ඒ ආකාරයට එය දැන ගනී. මෙසේ තමා තුළ වූ කයෙහි කය අනුව බලමින් වාසය කරයි. එසේත් නැත්නම් බාහිර වශයෙන් කයෙහි කය අනුව බලමින් වාසය කරයි. නැතහොත් තමා තුළ හා පිටත කයෙහි කය අනුව බලමින් වාසය කරයි. කයෙහි හටගැනීමේ ස්වභාවය දකිමින් වාසය කරයි. නැතිවීමේ ස්වභාවය දකිමින් වාසය කරයි. හටගැනීමේ හා නැතිවීමේ ස්වභාවය දකිමින් වාසය කරයි. 'කය පවතී' යනුවෙන් ඔහුට සිහිය පිහිටා ඇත්තේ දැනගැනීම පිණිසත්, සිහිය පැවතීම පිණිසත් පමණි. ඔහු කිසිදු ඇලීමකින් තොරව වාසය කරයි. ලෝකයේ කිසිවක් අල්ලාගන්නේ නැත. මහණෙනි, භික්ෂුවක් මෙලෙස කයෙහි කය අනුව බලමින් වාසය කරයි. ඉරියව් පිළිබඳ පරිච්ඡේදය නිමා විය.",
      "paliTitle": "Kāyānupassanā iriyāpathapabbaṃ",
      "englishTitle": "Contemplation of the Body: Posture Section",
      "sinhalaTitle": "කායානුපස්සනා ඉරියාපථ පබ්බය"
    },
    {
      "number": 376,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. Iti ajjhattaṃ vā…pe… evampi kho, bhikkhave, bhikkhu kāye kāyānupassī viharati. Sampajānapabbaṃ niṭṭhitaṃ. ",
      "english": "Furthermore, monks, a monk practices with clear comprehension in going forward and returning; in looking straight ahead and looking around; in bending and extending his limbs; in wearing his outer robe, bowl, and other robes; in eating, drinking, chewing, and tasting; in defecating and urinating; in walking, standing, sitting, sleeping, waking, speaking, and being silent. In this way, he dwells contemplating the body in the body internally, or he dwells contemplating the body in the body externally, or he dwells contemplating the body in the body both internally and externally. He dwells contemplating the phenomenon of arising in the body, or he dwells contemplating the phenomenon of passing away in the body, or he dwells contemplating the phenomenon of both arising and passing away in the body. Or mindfulness is established in him just to the extent necessary for knowledge and continued mindfulness, thinking, ‘There is a body.’ And he dwells independent, clinging to nothing in the world. In this way, monks, a monk dwells contemplating the body in the body. The section on clear comprehension is concluded.",
      "sinhala": "තවද මහණෙනි, භික්ෂුවක් ඉදිරියට යාමේදී හා ආපසු පැමිණීමේදී සිහිනුවණින් යුක්තව කටයුතු කරයි. බැලීමේදී හා වටපිට බැලීමේදී සිහිනුවණින් යුක්තව කටයුතු කරයි. අත් පා හැකිළීමේදී හා දිග හැරීමේදී සිහිනුවණින් යුක්තව කටයුතු කරයි. සඟළ සිවුර, පාත්‍රය හා සිවුරු දැරීමේදී සිහිනුවණින් යුක්තව කටයුතු කරයි. ආහාර ගැනීමේදී, පානය කිරීමේදී, අනුභව කිරීමේදී හා රස විඳීමේදී සිහිනුවණින් යුක්තව කටයුතු කරයි. මලපහ කිරීමේදී හා මුත්‍රා කිරීමේදී සිහිනුවණින් යුක්තව කටයුතු කරයි. ගමන් කිරීමේදී, සිටීමේදී, හිඳ ගැනීමේදී, නිදා ගැනීමේදී, පිබිද සිටීමේදී, කථා කිරීමේදී හා නිහඬව සිටීමේදී සිහිනුවණින් යුක්තව කටයුතු කරයි. මෙලෙස අභ්‍යන්තරයෙහි කය අනුව හෝ බාහිරයෙහි කය අනුව හෝ අභ්‍යන්තර-බාහිරයෙහි කය අනුව භික්ෂුව කෙලෙස් තවන වීරියෙන් යුක්තව, සිහිනුවණින් යුක්තව, සිහියෙන් යුක්තව, ලෝකය පිළිබඳ ආශාවන් හා දොම්නස් දුරුකොට වාසය කරයි. මහණෙනි, මෙලෙස භික්ෂුව කයෙහි කය අනුව බලමින් වාසය කරයි. සිහිනුවණ පිළිබඳ පරිච්ඡේදය නිමා විය.",
      "paliTitle": "Kāyānupassanā sampajānapabbaṃ",
      "englishTitle": "Mindful Awareness of the Body",
      "sinhalaTitle": "කායානුපස්සනා සම්පජාන පබ්බය"
    },
    {
      "number": 377,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco, maṃsaṃ nhāru aṭṭhi aṭṭhimiñjaṃ vakkaṃ, hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ, antaṃ antaguṇaṃ udariyaṃ karīsaṃ [karīsaṃ matthaluṅgaṃ (ka.)], pittaṃ semhaṃ pubbo lohitaṃ sedo medo, assu vasā kheḷo siṅghāṇikā lasikā mutta’nti. ‘‘Seyyathāpi, bhikkhave, ubhatomukhā putoḷi [mūtoḷī (syā.), mutoli (pī.)] pūrā nānāvihitassa dhaññassa, seyyathidaṃ sālīnaṃ vīhīnaṃ muggānaṃ māsānaṃ tilānaṃ taṇḍulānaṃ. Tamenaṃ cakkhumā puriso muñcitvā paccavekkheyya – ‘ime sālī, ime vīhī ime muggā ime māsā ime tilā ime taṇḍulā’ti. Evameva kho, bhikkhave, bhikkhu imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… mutta’nti. Iti ajjhattaṃ vā…pe… evampi kho, bhikkhave, bhikkhu kāye kāyānupassī viharati. Paṭikūlamanasikārapabbaṃ niṭṭhitaṃ. ",
      "english": "Furthermore, monks, a monk reflects on this very body, from the soles of the feet up and from the crown of the head down, bounded by skin, and full of various kinds of impurities, contemplating: ‘In this body, there are head-hairs, body-hairs, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, mesentery, stomach, feces, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, synovial fluid, and urine.’\n\nJust as if there were a bag with openings at both ends, filled with various kinds of grain – such as rice, paddy, mung beans, black lentils, sesame seeds, and husked rice – and a person with good eyesight were to open it and reflect: ‘This is rice, this is paddy, these are mung beans, these are black lentils, these are sesame seeds, this is husked rice.’ In the same way, monks, a monk reflects on this very body, from the soles of the feet up and from the crown of the head down, bounded by skin, and full of various kinds of impurities, contemplating: ‘In this body, there are head-hairs, body-hairs, nails, teeth, skin… and urine.’ Thus, he dwells contemplating the body in the body internally, or he dwells contemplating the body in the body externally, or he dwells contemplating the body in the body both internally and externally. He dwells contemplating the nature of arising in the body, or he dwells contemplating the nature of passing away in the body, or he dwells contemplating the nature of both arising and passing away in the body. Or, mindfulness that ‘there is a body’ is established in him just to the extent necessary for knowledge and remembrance. And he dwells detached, grasping at nothing in the world. Thus, monks, a monk dwells contemplating the body in the body. The section on the contemplation of loathsomeness is concluded.",
      "sinhala": "නැවතත්, මහණෙනි, භික්ෂුවක් මේ ශරීරයම යටිපතුල්වලින් ඉහළටත් කෙස් අගින් පහළටත් සමින් වැසී ඇති ආකාරයට නොයෙක් අපිරිසිදු දේවලින් පිරී පවතින බව මෙසේ මෙනෙහි කරයි: ‘මේ ශරීරයෙහි කෙස්, ලොම්, නිය, දත්, සම, මස්, නහර, ඇට, ඇටමිදුළු, වකුගඩු, හදවත, අක්මාව, දලබුව, ප්ලීහාව, පෙනහලු, අන්ත්‍රය, අන්ත්‍ර ගුණය, කුස, අසූචි, පිත, සෙම, සැරව, ලේ, දහඩිය, මේදය, කඳුළු, වුරුණු තෙල්, කෙළ, සොටු, කැඳරස, මුත්‍ර යන දේ ඇතැ’යි කියායි.\n\nමහණෙනි, යම් සේ දෙපස විවෘත කළ හැකි විවිධ ධාන්‍ය වර්ගවලින් පිරුණු මල්ලක් ඇත්ද, එනම්: සාලි වී, වී, මුං, මෑ, තල, සහ සහල් යනාදියෙන් පිරුණු මල්ලක් වේ. එය ඇස් ඇති නුවණැති පුරුෂයෙක් ලිහා, ‘මේවා සාලි වී, මේවා වී, මේවා මුං, මේවා මෑ, මේවා තල, මේවා සහල්’ යැයි විමසා බලයි.\n\nඒ ආකාරයෙන්ම, මහණෙනි, භික්ෂුවක් මේ ශරීරයම යටිපතුල්වලින් ඉහළටත් කෙස් අගින් පහළටත් සමින් වැසී ඇති ආකාරයට නොයෙක් අපිරිසිදු දේවලින් පිරී පවතින බව මෙසේ මෙනෙහි කරයි: ‘මේ ශරීරයෙහි කෙස්, ලොම්, නිය, දත්, සම, මස්, නහර, ඇට, ඇටමිදුළු, වකුගඩු, හදවත, අක්මාව, දලබුව, ප්ලීහාව, පෙනහලු, අන්ත්‍රය, අන්ත්‍ර ගුණය, කුස, අසූචි, පිත, සෙම, සැරව, ලේ, දහඩිය, මේදය, කඳුළු, වුරුණු තෙල්, කෙළ, සොටු, කැඳරස, මුත්‍ර යන දේ ඇතැ’යි කියායි.\n\nමෙලෙස තමා තුළ හෝ යනාදී වශයෙන් මහණෙනි, භික්ෂුව කයෙහි කය අනුව දකිමින් වාසය කරයි. පිළිකුල් මෙනෙහි කිරීමේ පරිච්ඡේදය නිම විය.",
      "paliTitle": "Kāyānupassanā paṭikūlamanasikārapabbaṃ",
      "englishTitle": "Contemplation of Repulsiveness section",
      "sinhalaTitle": "කායානුපස්සනා පටික්කූලමනසිකාර පබ්බය"
    },
    {
      "number": 378,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu imameva kāyaṃ yathāṭhitaṃ yathāpaṇihitaṃ dhātuso paccavekkhati – ‘atthi imasmiṃ kāye pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti. ‘‘Seyyathāpi, bhikkhave, dakkho goghātako vā goghātakantevāsī vā gāviṃ vadhitvā catumahāpathe bilaso vibhajitvā nisinno assa, evameva kho, bhikkhave, bhikkhu imameva kāyaṃ yathāṭhitaṃ yathāpaṇihitaṃ dhātuso paccavekkhati – ‘atthi imasmiṃ kāye pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti. ‘‘Iti ajjhattaṃ vā kāye kāyānupassī viharati…pe… evampi kho, bhikkhave, bhikkhu kāye kāyānupassī viharati. Dhātumanasikārapabbaṃ niṭṭhitaṃ. ",
      "english": "Furthermore, monks, a monk contemplates this very body – however it is placed, however it is disposed – by way of its elements: 'In this body, there is the earth element, the water element, the fire element, and the air element.'\n\nJust as a skilled butcher or a butcher's apprentice, having slaughtered a cow, would divide it into portions and sit at a crossroads, so too, monks, a monk contemplates this very body – however it is placed, however it is disposed – by way of its elements: 'In this body, there is the earth element, the water element, the fire element, and the air element.'\n\nThus, he dwells contemplating the body as a body internally, or he dwells contemplating the body as a body externally, or he dwells contemplating the body as a body both internally and externally. He dwells contemplating the phenomenon of origination in the body, or he dwells contemplating the phenomenon of dissolution in the body, or he dwells contemplating the phenomenon of both origination and dissolution in the body. His mindfulness is established with the thought, 'The body exists,' just for knowledge and remembrance. And he dwells detached, clinging to nothing in the world. In this way, monks, a monk dwells contemplating the body as a body. The section on contemplation of the elements is concluded.",
      "sinhala": "තවද මහණෙනි, භික්ෂුව මේ ශරීරය පිහිටි ආකාරයටත්, තැන්පත් කොට ඇති ආකාරයටත්, ධාතු වශයෙන් මෙසේ විමසා බලයි: ‘මේ ශරීරයෙහි පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව ඇතැ’යි.\n\nමහණෙනි, දක්ෂ ගවඝාතකයෙක් හෝ ගවඝාතක ශිෂ්‍යයෙක් ගවයෙකු මරා සතරමංසන්ධියක දී කොටස් වශයෙන් වෙන් කොට හිඳිනා ආකාරය මෙනි. එපරිද්දෙන්ම මහණෙනි, භික්ෂුව මේ ශරීරය පිහිටි ආකාරයටත්, තැන්පත් කොට ඇති ආකාරයටත්, ධාතු වශයෙන් මෙසේ විමසා බලයි: ‘මේ ශරීරයෙහි පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව ඇතැ’යි.\n\nමෙසේ ඔහු තුළ හෝ කයෙහි කය අනුව බලමින් වාසය කරයි...පෙ... එපරිද්දෙන්ම මහණෙනි, භික්ෂුව කයෙහි කය අනුව බලමින් වාසය කරයි. ධාතු මෙනෙහි කිරීමේ පරිච්ඡේදය නිම විය.",
      "paliTitle": "Kāyānupassanā dhātumanasikārapabbaṃ",
      "englishTitle": "Contemplation of the Body: Element Consideration",
      "sinhalaTitle": "කායානුපස්සනා ධාතුමනසිකාර පබ්බය"
    },
    {
      "number": 379,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu seyyathāpi passeyya sarīraṃ sivathikāya chaḍḍitaṃ ekāhamataṃ vā dvīhamataṃ vā tīhamataṃ vā uddhumātakaṃ vinīlakaṃ vipubbakajātaṃ. So imameva kāyaṃ upasaṃharati – ‘ayampi kho kāyo evaṃdhammo evaṃbhāvī evaṃanatīto’ti. ‘‘Iti ajjhattaṃ vā …pe… evampi kho, bhikkhave, bhikkhu kāye kāyānupassī viharati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu seyyathāpi passeyya sarīraṃ sivathikāya chaḍḍitaṃ kākehi vā khajjamānaṃ kulalehi vā khajjamānaṃ gijjhehi vā khajjamānaṃ kaṅkehi vā khajjamānaṃ sunakhehi vā khajjamānaṃ byagghehi vā khajjamānaṃ dīpīhi vā khajjamānaṃ siṅgālehi vā [gijjhehi vā khajjamānaṃ, suvānehi vā khajjamānaṃ, sigālehi vā khajjamānaṃ, (syā. pī.)] khajjamānaṃ vividhehi vā pāṇakajātehi khajjamānaṃ. So imameva kāyaṃ upasaṃharati – ‘ayampi kho kāyo evaṃdhammo evaṃbhāvī evaṃanatīto’ti. ‘‘Iti ajjhattaṃ vā…pe… evampi kho, bhikkhave, bhikkhu kāye kāyānupassī viharati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu seyyathāpi passeyya sarīraṃ sivathikāya chaḍḍitaṃ aṭṭhikasaṅkhalikaṃ samaṃsalohitaṃ nhārusambandhaṃ…pe… aṭṭhikasaṅkhalikaṃ nimaṃsalohitamakkhitaṃ nhārusambandhaṃ…pe… aṭṭhikasaṅkhalikaṃ apagatamaṃsalohitaṃ nhārusambandhaṃ…pe… aṭṭhikāni apagatasambandhāni [apagatanhārusambandhāni (syā.)] disā vidisā vikkhittāni, aññena hatthaṭṭhikaṃ aññena pādaṭṭhikaṃ aññena gopphakaṭṭhikaṃ [‘‘aññena gopphakaṭṭhika’’nti idaṃ sī. syā. pī. potthakesu natthi] aññena jaṅghaṭṭhikaṃ aññena ūruṭṭhikaṃ aññena kaṭiṭṭhikaṃ [aññena kaṭaṭṭhikaṃ aññena piṭṭhaṭṭhikaṃ aññena kaṇḍakaṭṭhikaṃ aññena phāsukaṭṭhikaṃ aññena uraṭṭhikaṃ aññena aṃsaṭṭhikaṃ aññena bāhuṭṭhikaṃ (syā.)] aññena phāsukaṭṭhikaṃ aññena piṭṭhiṭṭhikaṃ aññena khandhaṭṭhikaṃ [aññena kaṭaṭṭhikaṃ aññena piṭṭhaṭṭhikaṃ aññena kaṇḍakaṭṭhikaṃ aññena phāsukaṭṭhikaṃ aññena uraṭṭhikaṃ aññena aṃsaṭṭhikaṃ aññena bāhuṭṭhikaṃ (syā.)] aññena gīvaṭṭhikaṃ aññena hanukaṭṭhikaṃ aññena dantaṭṭhikaṃ aññena sīsakaṭāhaṃ. So imameva kāyaṃ upasaṃharati – ‘ayampi kho kāyo evaṃdhammo evaṃbhāvī evaṃanatīto’ti. ‘‘Iti ajjhattaṃ vā …pe… viharati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu seyyathāpi passeyya sarīraṃ sivathikāya chaḍḍitaṃ aṭṭhikāni setāni saṅkhavaṇṇapaṭibhāgāni…pe… aṭṭhikāni puñjakitāni terovassikāni …pe… aṭṭhikāni pūtīni cuṇṇakajātāni. So imameva kāyaṃ upasaṃharati – ‘ayampi kho kāyo evaṃdhammo evaṃbhāvī evaṃanatīto’ti. Iti ajjhattaṃ vā kāye kāyānupassī viharati, bahiddhā vā kāye kāyānupassī viharati, ajjhattabahiddhā vā kāye kāyānupassī viharati. Samudayadhammānupassī vā kāyasmiṃ viharati, vayadhammānupassī vā kāyasmiṃ viharati, samudayavayadhammānupassī vā kāyasmiṃ viharati. ‘Atthi kāyo’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu kāye kāyānupassī viharati. Navasivathikapabbaṃ niṭṭhitaṃ. Cuddasa kāyānupassanā niṭṭhitā. ",
      "english": "Furthermore, bhikkhus, a bhikkhu might see a body discarded in a charnel ground, dead for one, two, or three days, bloated, discolored, and festering. He applies this very observation to his own body: ‘This body, too, is of the same nature; it will become like that and is not exempt from that fate.’ Thus, he dwells contemplating the body internally, or he dwells contemplating the body externally, or he dwells contemplating the body internally and externally. In this way, bhikkhus, a bhikkhu dwells contemplating the body in the body.\n\nFurthermore, bhikkhus, a bhikkhu might see a body discarded in a charnel ground, being eaten by crows, kites, vultures, herons, dogs, tigers, leopards, jackals, or various kinds of small creatures. He applies this very observation to his own body: ‘This body, too, is of the same nature; it will become like that and is not exempt from that fate.’ Thus, he dwells contemplating the body internally, or he dwells contemplating the body externally, or he dwells contemplating the body internally and externally. In this way, bhikkhus, a bhikkhu dwells contemplating the body in the body.\n\nFurthermore, bhikkhus, a bhikkhu might see a body discarded in a charnel ground, consisting of a skeleton with flesh and blood, held together by sinews; or a skeleton fleshless, smeared with blood, held together by sinews; or a skeleton from which the flesh and blood have fallen away, still held together by sinews; or bones detached from their connections, scattered in all directions – a hand bone here, a foot bone there, an ankle bone there, a shin bone there, a thigh bone there, a hip bone there, a rib bone there, a spine bone there, a shoulder bone there, a neck bone there, a jaw bone there, a tooth there, a skull. He applies this very observation to his own body: ‘This body, too, is of the same nature; it will become like that and is not exempt from that fate.’ Thus, he dwells contemplating the body internally, or he dwells contemplating the body externally, or he dwells contemplating the body internally and externally. In this way, bhikkhus, a bhikkhu dwells contemplating the body in the body.\n\nFurthermore, bhikkhus, a bhikkhu might see a body discarded in a charnel ground, consisting of white bones, resembling a conch shell; or bones piled up, more than a year old; or bones decayed and crumbled into dust. He applies this very observation to his own body: ‘This body, too, is of the same nature; it will become like that and is not exempt from that fate.’ Thus, he dwells contemplating the body internally, or he dwells contemplating the body externally, or he dwells contemplating the body internally and externally. He dwells contemplating the nature of arising in the body, or he dwells contemplating the nature of passing away in the body, or he dwells contemplating the nature of both arising and passing away in the body. Or mindfulness that \"there is a body\" is established in him just to the extent necessary for knowledge and remembrance. And he dwells independent, and clings to nothing in the world. In this way, bhikkhus, a bhikkhu dwells contemplating the body in the body.",
      "sinhala": "නැවත ද, මහණෙනි, භික්ෂුවක් මිනී පිට්ටනියක දමා තිබූ දිනක්, දෙදිනක් හෝ තුන් දිනක් ගත වූ ඉදිමුණු, නිල් පැහැ ගැන්වුණු, සැරව ගලන මළ සිරුරක් දකී. ඔහු මෙසේ තම ශරීරය ද උපමාවට ගනී: ‘මාගේ මේ ශරීරය ද මෙවැනි ස්වභාවයෙන් යුක්ත ය, මෙවැනි තත්ත්වයකට පත්වන්නේ ය, මෙයින් මිදී යා නොහැකි ය.’ මෙලෙස ඔහු තමා තුළ හෝ පිටත හෝ දෙඅංශයේ ම ශරීරයෙහි කය පිළිබඳ ව සිහියෙන් යුතුව වාසය කරයි. ඔහු ශරීරය හටගන්නා ආකාරය ද, නැති වී යන ආකාරය ද, හටගෙන නැති වී යන ආකාරය ද නිරීක්ෂණය කරමින් වාසය කරයි. ‘ශරීරයක් ඇත’ යන සිහිය ඔහුට දැනුම පිණිස මෙන් ම සිහි කිරීම පිණිස ද උපකාරී වේ. ඔහු කිසිවකට නො ඇලී වාසය කරන අතර ලෝකයේ කිසිවක් උපාදානය කර නොගනී. මහණෙනි, භික්ෂුව කයෙහි කයානුපස්සීව වාසය කරන්නේ මෙලෙස ය.\n\nනැවත ද, මහණෙනි, භික්ෂුවක් මිනී පිට්ටනියක දමා තිබූ මළ සිරුරක් කපුටන් විසින් හෝ උකුස්සන් විසින් හෝ ගිජු ලිහිණියන් විසින් හෝ කොකුන් විසින් හෝ බල්ලන් විසින් හෝ ව්‍යාඝ්‍රයන් විසින් හෝ දිවියන් විසින් හෝ හිවලුන් විසින් හෝ විවිධ කුඩා සතුන් විසින් ආහාරයට ගනු ලබන අයුරු දකී. ඔහු මෙසේ තම ශරීරය ද උපමාවට ගනී: ‘මාගේ මේ ශරීරය ද මෙවැනි ස්වභාවයෙන් යුක්ත ය, මෙවැනි තත්ත්වයකට පත්වන්නේ ය, මෙයින් මිදී යා නොහැකි ය.’ මෙලෙස ඔහු තමා තුළ හෝ පිටත හෝ දෙඅංශයේ ම ශරීරයෙහි කය පිළිබඳ ව සිහියෙන් යුතුව වාසය කරයි. ඔහු ශරීරය හටගන්නා ආකාරය ද, නැති වී යන ආකාරය ද, හටගෙන නැති වී යන ආකාරය ද නිරීක්ෂණය කරමින් වාසය කරයි. ‘ශරීරයක් ඇත’ යන සිහිය ඔහුට දැනුම පිණිස මෙන් ම සිහි කිරීම පිණිස ද උපකාරී වේ. ඔහු කිසිවකට නො ඇලී වාසය කරන අතර ලෝකයේ කිසිවක් උපාදානය කර නොගනී. මහණෙනි, භික්ෂුව කයෙහි කයානුපස්සීව වාසය කරන්නේ මෙලෙස ය.\n\nනැවත ද, මහණෙනි, භික්ෂුවක් මිනී පිට්ටනියක දමා තිබූ මස් හා ලේ සහිත, ස්නායු වලින් බැඳුණු ඇටසැකිල්ලක් දකී. එසේත් නැතහොත්, මස් හා ලේ ස්වල්පයක් ඉතිරිව තිබූ, ස්නායු වලින් බැඳුණු ඇටසැකිල්ලක් දකී. එසේත් නැතහොත්, මස් හා ලේ සම්පූර්ණයෙන් ම ඉවත් වූ, ස්නායු වලින් බැඳුණු ඇටසැකිල්ලක් දකී. එසේත් නැතහොත්, බන්ධන ගැලවී, අත් ඇට, පා ඇට, වළලුකර ඇට, කෙණ්ඩා ඇට, කලවා ඇට, ඉඟටිය ඇට, ඉළ ඇට, පිට කොන්ද ඇට, උරහිස් ඇට, ගෙල ඇට, හනු ඇට, දත් ඇට, හිස් කබල ආදී වශයෙන් විවිධ දිශාවන්ට විසිරී ගිය ඇට දකී. ඔහු මෙසේ තම ශරීරය ද උපමාවට ගනී: ‘මාගේ මේ ශරීරය ද මෙවැනි ස්වභාවයෙන් යුක්ත ය, මෙවැනි තත්ත්වයකට පත්වන්නේ ය, මෙයින් මිදී යා නොහැකි ය.’ මෙලෙස ඔහු තමා තුළ හෝ පිටත හෝ දෙඅංශයේ ම ශරීරයෙහි කය පිළිබඳ ව සිහියෙන් යුතුව වාසය කරයි. ඔහු ශරීරය හටගන්නා ආකාරය ද, නැති වී යන ආකාරය ද, හටගෙන නැති වී යන ආකාරය ද නිරීක්ෂණය කරමින් වාසය කරයි. ‘ශරීරයක් ඇත’ යන සිහිය ඔහුට දැනුම පිණිස මෙන් ම සිහි කිරීම පිණිස ද උපකාරී වේ. ඔහු කිසිවකට නො ඇලී වාසය කරන අතර ලෝකයේ කිසිවක් උපාදානය කර නොගනී. මහණෙනි, භික්ෂුව කයෙහි කයානුපස්සීව වාසය කරන්නේ මෙලෙස ය.\n\nනැවත ද, මහණෙනි, භික්ෂුවක් මිනී පිට්ටනියක දමා තිබූ හක්ගෙඩියක පැහැයට සමාන සුදු පැහැති ඇට දකී. එසේත් නැතහොත්, වසරකට වඩා පැරණි, ගොඩ ගැසී තිබූ ඇට දකී. එසේත් නැතහොත්, කුණු වී කුඩු බවට පත් වූ ඇට දකී. ඔහු මෙසේ තම ශරීරය ද උපමාවට ගනී: ‘මාගේ මේ ශරීරය ද මෙවැනි ස්වභාවයෙන් යුක්ත ය, මෙවැනි තත්ත්වයකට පත්වන්නේ ය, මෙයින් මිදී යා නොහැකි ය.’ මෙලෙස ඔහු තමා තුළ හෝ පිටත හෝ දෙඅංශයේ ම ශරීරයෙහි කය පිළිබඳ ව සිහියෙන් යුතුව වාසය කරයි. ඔහු ශරීරය හටගන්නා ආකාරය ද, නැති වී යන ආකාරය ද, හටගෙන නැති වී යන ආකාරය ද නිරීක්ෂණය කරමින් වාසය කරයි. ‘ශරීරයක් ඇත’ යන සිහිය ඔහුට දැනුම පිණිස මෙන් ම සිහි කිරීම පිණිස ද උපකාරී වේ. ඔහු කිසිවකට නො ඇලී වාසය කරන අතර ලෝකයේ කිසිවක් උපාදානය කර නොගනී. මහණෙනි, භික්ෂුව කයෙහි කයානුපස්සීව වාසය කරන්නේ මෙලෙස ය.",
      "paliTitle": "Kāyānupassanā navasivathikapabbaṃ",
      "englishTitle": "Contemplation of the Body: The Nine Cemetery Stages",
      "sinhalaTitle": "කායානුපස්සනා නවසීවථික පබ්බය"
    },
    {
      "number": 380,
      "pali": "‘‘Kathañca pana, bhikkhave, bhikkhu vedanāsu vedanānupassī viharati? Idha, bhikkhave, bhikkhu sukhaṃ vā vedanaṃ vedayamāno ‘sukhaṃ vedanaṃ vedayāmī’ti pajānāti. Dukkhaṃ vā vedanaṃ vedayamāno ‘dukkhaṃ vedanaṃ vedayāmī’ti pajānāti. Adukkhamasukhaṃ vā vedanaṃ vedayamāno ‘adukkhamasukhaṃ vedanaṃ vedayāmī’ti pajānāti. Sāmisaṃ vā sukhaṃ vedanaṃ vedayamāno ‘sāmisaṃ sukhaṃ vedanaṃ vedayāmī’ti pajānāti, nirāmisaṃ vā sukhaṃ vedanaṃ vedayamāno ‘nirāmisaṃ sukhaṃ vedanaṃ vedayāmī’ti pajānāti. Sāmisaṃ vā dukkhaṃ vedanaṃ vedayamāno ‘sāmisaṃ dukkhaṃ vedanaṃ vedayāmī’ti pajānāti, nirāmisaṃ vā dukkhaṃ vedanaṃ vedayamāno ‘nirāmisaṃ dukkhaṃ vedanaṃ vedayāmī’ti pajānāti. Sāmisaṃ vā adukkhamasukhaṃ vedanaṃ vedayamāno ‘sāmisaṃ adukkhamasukhaṃ vedanaṃ vedayāmī’ti pajānāti, nirāmisaṃ vā adukkhamasukhaṃ vedanaṃ vedayamāno ‘nirāmisaṃ adukkhamasukhaṃ vedanaṃ vedayāmī’ti pajānāti. Iti ajjhattaṃ vā vedanāsu vedanānupassī viharati, bahiddhā vā vedanāsu vedanānupassī viharati, ajjhattabahiddhā vā vedanāsu vedanānupassī viharati. Samudayadhammānupassī vā vedanāsu viharati, vayadhammānupassī vā vedanāsu viharati, samudayavayadhammānupassī vā vedanāsu viharati. ‘Atthi vedanā’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu vedanāsu vedanānupassī viharati. Vedanānupassanā niṭṭhitā. ",
      "english": "And how, mendicants, does a mendicant remain focused on feelings by observing feelings? It’s when a mendicant feels a pleasant feeling, they understand: ‘I feel a pleasant feeling.’ When they feel a painful feeling, they understand: ‘I feel a painful feeling.’ When they feel a neutral feeling, they understand: ‘I feel a neutral feeling.’ When they feel a pleasant feeling connected with worldly things, they understand: ‘I feel a pleasant feeling connected with worldly things.’ When they feel a pleasant feeling disconnected from worldly things, they understand: ‘I feel a pleasant feeling disconnected from worldly things.’ When they feel a painful feeling connected with worldly things, they understand: ‘I feel a painful feeling connected with worldly things.’ When they feel a painful feeling disconnected from worldly things, they understand: ‘I feel a painful feeling disconnected from worldly things.’ When they feel a neutral feeling connected with worldly things, they understand: ‘I feel a neutral feeling connected with worldly things.’ When they feel a neutral feeling disconnected from worldly things, they understand: ‘I feel a neutral feeling disconnected from worldly things.’\n\nIn this way, they remain focused on feelings by observing feelings internally, or they remain focused on feelings by observing feelings externally, or they remain focused on feelings by observing feelings both internally and externally. They remain focused on feelings by observing their origin, or they remain focused on feelings by observing their dissolution, or they remain focused on feelings by observing both their origin and dissolution. Mindfulness that ‘There is feeling’ is established in them to the extent necessary for knowledge and remembrance. And they remain independent, not clinging to anything in the world. That is how a mendicant remains focused on feelings by observing feelings. The mindfulness of feelings is complete.",
      "sinhala": "මහණෙනි, භික්ෂුවක් වේදනාවන්හි වේදනානුපස්සීව වාසය කරන්නේ කෙසේද? මහණෙනි, මේ ලෝකයෙහි භික්ෂුවක් සැප වේදනාවක් විඳින විට, ‘මම සැප වේදනාවක් විඳිමි’ යැයි දනී. දුක් වේදනාවක් විඳින විට, ‘මම දුක් වේදනාවක් විඳිමි’ යැයි දනී. දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳින විට, ‘මම දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳිමි’ යැයි දනී. ආමිස සහිත සැප වේදනාවක් විඳින විට, ‘මම ආමිස සහිත සැප වේදනාවක් විඳිමි’ යැයි දනී. නිරාමිස සැප වේදනාවක් විඳින විට, ‘මම නිරාමිස සැප වේදනාවක් විඳිමි’ යැයි දනී. ආමිස සහිත දුක් වේදනාවක් විඳින විට, ‘මම ආමිස සහිත දුක් වේදනාවක් විඳිමි’ යැයි දනී. නිරාමිස දුක් වේදනාවක් විඳින විට, ‘මම නිරාමිස දුක් වේදනාවක් විඳිමි’ යැයි දනී. ආමිස සහිත දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳින විට, ‘මම ආමිස සහිත දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳිමි’ යැයි දනී. නිරාමිස දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳින විට, ‘මම නිරාමිස දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳිමි’ යැයි දනී.\n\nඔහු මෙසේ තමා තුළ වේදනාවන්හි වේදනානුපස්සීව වාසය කරයි. එසේම, අනුන් තුළ වේදනාවන්හි වේදනානුපස්සීව වාසය කරයි. තවද, තමා තුළත් අනුන් තුළත් වේදනාවන්හි වේදනානුපස්සීව වාසය කරයි. වේදනාවන්ගේ හටගැනීමේ ස්වභාවය දකිමින් වාසය කරයි. නැතිවීමේ ස්වභාවය දකිමින් වාසය කරයි. හටගැනීමේ හා නැතිවීමේ ස්වභාවය දකිමින් වාසය කරයි. ‘වේදනාවක් ඇත’ යන සිහිය දැනුම පිණිස මෙනෙහි කිරීම පිණිස පමණක් පවතියි. ඔහු තෘෂ්ණාවෙන් තොරව වාසය කරයි. ලෝකයේ කිසිවක් තමන්ගේ යැයි නොගනී. මහණෙනි, භික්ෂුවක් මෙලෙස වේදනාවන්හි වේදනානුපස්සීව වාසය කරයි. වේදනානුපස්සනාව නිමි.",
      "paliTitle": "Vedanānupassanā",
      "englishTitle": "Contemplation of Feelings",
      "sinhalaTitle": "වේදනානුපස්සනා"
    },
    {
      "number": 381,
      "pali": "‘‘Kathañca pana, bhikkhave, bhikkhu citte cittānupassī viharati? Idha, bhikkhave, bhikkhu sarāgaṃ vā cittaṃ ‘sarāgaṃ citta’nti pajānāti, vītarāgaṃ vā cittaṃ ‘vītarāgaṃ citta’nti pajānāti. Sadosaṃ vā cittaṃ ‘sadosaṃ citta’nti pajānāti, vītadosaṃ vā cittaṃ ‘vītadosaṃ citta’nti pajānāti. Samohaṃ vā cittaṃ ‘samohaṃ citta’nti pajānāti, vītamohaṃ vā cittaṃ ‘vītamohaṃ citta’nti pajānāti. Saṅkhittaṃ vā cittaṃ ‘saṅkhittaṃ citta’nti pajānāti, vikkhittaṃ vā cittaṃ ‘vikkhittaṃ citta’nti pajānāti. Mahaggataṃ vā cittaṃ ‘mahaggataṃ citta’nti pajānāti, amahaggataṃ vā cittaṃ ‘amahaggataṃ citta’nti pajānāti. Sauttaraṃ vā cittaṃ ‘sauttaraṃ citta’nti pajānāti, anuttaraṃ vā cittaṃ ‘anuttaraṃ citta’nti pajānāti. Samāhitaṃ vā cittaṃ ‘samāhitaṃ citta’nti pajānāti, asamāhitaṃ vā cittaṃ ‘asamāhitaṃ citta’nti pajānāti. Vimuttaṃ vā cittaṃ ‘vimuttaṃ citta’nti pajānāti. Avimuttaṃ vā cittaṃ ‘avimuttaṃ citta’nti pajānāti. Iti ajjhattaṃ vā citte cittānupassī viharati, bahiddhā vā citte cittānupassī viharati, ajjhattabahiddhā vā citte cittānupassī viharati. Samudayadhammānupassī vā cittasmiṃ viharati, vayadhammānupassī vā cittasmiṃ viharati, samudayavayadhammānupassī vā cittasmiṃ viharati, ‘atthi citta’nti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu citte cittānupassī viharati. Cittānupassanā niṭṭhitā. ",
      "english": "And how, monks, does a monk abide observing the mind in the mind? Here, a monk understands a mind with lust as ‘a mind with lust,’ and a mind without lust as ‘a mind without lust.’ He understands a mind with hatred as ‘a mind with hatred,’ and a mind without hatred as ‘a mind without hatred.’ He understands a mind with delusion as ‘a mind with delusion,’ and a mind without delusion as ‘a mind without delusion.’ He understands a contracted mind as ‘a contracted mind,’ and a scattered mind as ‘a scattered mind.’ He understands an exalted mind as ‘an exalted mind,’ and an unexalted mind as ‘an unexalted mind.’ He understands a surpassed mind as ‘a surpassed mind,’ and an unsurpassed mind as ‘an unsurpassed mind.’ He understands a concentrated mind as ‘a concentrated mind,’ and an unconcentrated mind as ‘an unconcentrated mind.’ He understands a liberated mind as ‘a liberated mind,’ and an unliberated mind as ‘an unliberated mind.’ Thus, he abides observing the mind in the mind internally, or he abides observing the mind in the mind externally, or he abides observing the mind in the mind both internally and externally. He abides observing the nature of arising in the mind, or he abides observing the nature of passing away in the mind, or he abides observing the nature of both arising and passing away in the mind. Or, mindfulness that ‘there is a mind’ is established in him to the extent necessary for mere knowledge and remembrance. And he abides detached, grasping nothing in the world. In this way, monks, a monk abides observing the mind in the mind.\n\nThe contemplation of mind is complete.",
      "sinhala": "මහණෙනි, භික්ෂුවක් කෙසේ නම් සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරන්නේ ද? මහණෙනි, මෙහිලා භික්ෂුව රාග සහිත සිත, 'රාග සහිත සිත' යැයි දනී. රාග රහිත සිත, 'රාග රහිත සිත' යැයි දනී. ද්වේෂ සහිත සිත, 'ද්වේෂ සහිත සිත' යැයි දනී. ද්වේෂ රහිත සිත, 'ද්වේෂ රහිත සිත' යැයි දනී. මෝහ සහිත සිත, 'මෝහ සහිත සිත' යැයි දනී. මෝහ රහිත සිත, 'මෝහ රහිත සිත' යැයි දනී. හැකිළුණු සිත, 'හැකිළුණු සිත' යැයි දනී. විසිරුණු සිත, 'විසිරුණු සිත' යැයි දනී. මහග්ගත සිත, 'මහග්ගත සිත' යැයි දනී. අමහග්ගත සිත, 'අමහග්ගත සිත' යැයි දනී. සඋත්තර සිත, 'සඋත්තර සිත' යැයි දනී. අනුත්තර සිත, 'අනුත්තර සිත' යැයි දනී. සමාහිත සිත, 'සමාහිත සිත' යැයි දනී. අසමාහිත සිත, 'අසමාහිත සිත' යැයි දනී. විමුක්ත සිත, 'විමුක්ත සිත' යැයි දනී. අවිමුක්ත සිත, 'අවිමුක්ත සිත' යැයි දනී.\n\nමෙසේ ඔහු තමා තුළ වූ සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරයි. නැතහොත් බාහිර වූ සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරයි. නැතහොත් තමා තුළ හා බාහිර වූ සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරයි. සිතේ හටගැනීමේ ස්වභාවය අනුපස්සනා කරමින් වාසය කරයි. සිතේ නැතිවීමේ ස්වභාවය අනුපස්සනා කරමින් වාසය කරයි. සිතේ හටගැනීමේ හා නැතිවීමේ ස්වභාවය අනුපස්සනා කරමින් වාසය කරයි. තවද ඔහුට 'සිතක් ඇත' යන සිහිය දැනුම පිණිස මෙන්ම සිහිය පිණිස ම එළඹ සිටී. ඔහු තෘෂ්ණාවෙන් තොරව වාසය කරයි. ලෝකයේ කිසිම දෙයකට ඇලෙන්නේ නැත. මහණෙනි, භික්ෂුවක් මෙලෙස සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරයි. සිත අනුපස්සනා කිරීම නිමි.",
      "paliTitle": "Cittānupassanā",
      "englishTitle": "Contemplation of Mind",
      "sinhalaTitle": "චිත්තානුපස්සනා"
    },
    {
      "number": 382,
      "pali": "‘‘Kathañca pana, bhikkhave, bhikkhu dhammesu dhammānupassī viharati? Idha, bhikkhave, bhikkhu dhammesu dhammānupassī viharati pañcasu nīvaraṇesu. Kathañca pana, bhikkhave, bhikkhu dhammesu dhammānupassī viharati pañcasu nīvaraṇesu? ‘‘Idha, bhikkhave, bhikkhu santaṃ vā ajjhattaṃ kāmacchandaṃ ‘atthi me ajjhattaṃ kāmacchando’ti pajānāti, asantaṃ vā ajjhattaṃ kāmacchandaṃ ‘natthi me ajjhattaṃ kāmacchando’ti pajānāti, yathā ca anuppannassa kāmacchandassa uppādo hoti tañca pajānāti, yathā ca uppannassa kāmacchandassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa kāmacchandassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ byāpādaṃ ‘atthi me ajjhattaṃ byāpādo’ti pajānāti, asantaṃ vā ajjhattaṃ byāpādaṃ ‘natthi me ajjhattaṃ byāpādo’ti pajānāti, yathā ca anuppannassa byāpādassa uppādo hoti tañca pajānāti, yathā ca uppannassa byāpādassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa byāpādassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ thinamiddhaṃ ‘atthi me ajjhattaṃ thinamiddha’nti pajānāti, asantaṃ vā ajjhattaṃ thinamiddhaṃ ‘natthi me ajjhattaṃ thinamiddha’nti pajānāti, yathā ca anuppannassa thinamiddhassa uppādo hoti tañca pajānāti, yathā ca uppannassa thinamiddhassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa thinamiddhassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ uddhaccakukkuccaṃ ‘atthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti, asantaṃ vā ajjhattaṃ uddhaccakukkuccaṃ ‘natthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti, yathā ca anuppannassa uddhaccakukkuccassa uppādo hoti tañca pajānāti, yathā ca uppannassa uddhaccakukkuccassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa uddhaccakukkuccassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ vicikicchaṃ ‘atthi me ajjhattaṃ vicikicchā’ti pajānāti, asantaṃ vā ajjhattaṃ vicikicchaṃ ‘natthi me ajjhattaṃ vicikicchā’ti pajānāti, yathā ca anuppannāya vicikicchāya uppādo hoti tañca pajānāti, yathā ca uppannāya vicikicchāya pahānaṃ hoti tañca pajānāti, yathā ca pahīnāya vicikicchāya āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Iti ajjhattaṃ vā dhammesu dhammānupassī viharati, bahiddhā vā dhammesu dhammānupassī viharati, ajjhattabahiddhā vā dhammesu dhammānupassī viharati samudayadhammānupassī vā dhammesu viharati, vayadhammānupassī vā dhammesu viharati, samudayavayadhammānupassī vā dhammesu viharati ‘atthi dhammā’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu dhammesu dhammānupassī viharati pañcasu nīvaraṇesu. Nīvaraṇapabbaṃ niṭṭhitaṃ. ",
      "english": "And how, monks, does a monk dwell contemplating phenomena as phenomena? Here, monks, a monk dwells contemplating phenomena as phenomena with regard to the five hindrances. And how, monks, does a monk dwell contemplating phenomena as phenomena with regard to the five hindrances?\n\nHere, monks, when sensual desire is present within, a monk understands, 'Sensual desire is present within me.' When sensual desire is not present within, he understands, 'Sensual desire is not present within me.' He understands how unarisen sensual desire arises, he understands how arisen sensual desire is abandoned, and he understands how abandoned sensual desire does not arise again in the future.\n\nWhen ill will is present within, he understands, 'Ill will is present within me.' When ill will is not present within, he understands, 'Ill will is not present within me.' He understands how unarisen ill will arises, he understands how arisen ill will is abandoned, and he understands how abandoned ill will does not arise again in the future.\n\nWhen sloth and torpor are present within, he understands, 'Sloth and torpor are present within me.' When sloth and torpor are not present within, he understands, 'Sloth and torpor are not present within me.' He understands how unarisen sloth and torpor arise, he understands how arisen sloth and torpor are abandoned, and he understands how abandoned sloth and torpor do not arise again in the future.\n\nWhen restlessness and remorse are present within, he understands, 'Restlessness and remorse are present within me.' When restlessness and remorse are not present within, he understands, 'Restlessness and remorse are not present within me.' He understands how unarisen restlessness and remorse arise, he understands how arisen restlessness and remorse are abandoned, and he understands how abandoned restlessness and remorse do not arise again in the future.\n\nWhen doubt is present within, he understands, 'Doubt is present within me.' When doubt is not present within, he understands, 'Doubt is not present within me.' He understands how unarisen doubt arises, he understands how arisen doubt is abandoned, and he understands how abandoned doubt does not arise again in the future.\n\nThus, he dwells contemplating phenomena as phenomena internally, or he dwells contemplating phenomena as phenomena externally, or he dwells contemplating phenomena as phenomena both internally and externally. He dwells contemplating the phenomenon of arising in phenomena, or he dwells contemplating the phenomenon of passing away in phenomena, or he dwells contemplating the phenomenon of both arising and passing away in phenomena. Or mindfulness that 'there are phenomena' is established in him to the extent necessary for knowledge and remembrance. And he dwells detached, clinging to nothing in the world. This is how, monks, a monk dwells contemplating phenomena as phenomena with regard to the five hindrances. The section on the hindrances is complete.",
      "sinhala": "මහණෙනි, භික්ෂුව ධර්මයන්හි ධර්මානුපස්සීව වාසය කරන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව පංච නීවරණයන්හි ධර්මානුපස්සීව වාසය කරයි. මහණෙනි, භික්ෂුව පංච නීවරණයන්හි ධර්මානුපස්සීව වාසය කරන්නේ කෙසේද?\n\nමහණෙනි, මෙහිලා භික්ෂුව තුළ කාමච්ඡන්දය ඇත්නම්, ‘මා තුළ කාමච්ඡන්දය ඇත’ යැයි ද, කාමච්ඡන්දය නැත්නම්, ‘මා තුළ කාමච්ඡන්දය නැත’ යැයි ද දැන ගනී. තවද නූපන් කාමච්ඡන්දය උපදින්නේ කෙසේදැයි ද, උපන් කාමච්ඡන්දය දුරු කරන්නේ කෙසේදැයි ද, දුරු කළ කාමච්ඡන්දය නැවත නූපදින්නේ කෙසේදැයි ද දැන ගනී.\n\nතවද භික්ෂුව තුළ ව්‍යාපාදය ඇත්නම්, ‘මා තුළ ව්‍යාපාදය ඇත’ යැයි ද, ව්‍යාපාදය නැත්නම්, ‘මා තුළ ව්‍යාපාදය නැත’ යැයි ද දැන ගනී. තවද නූපන් ව්‍යාපාදය උපදින්නේ කෙසේදැයි ද, උපන් ව්‍යාපාදය දුරු කරන්නේ කෙසේදැයි ද, දුරු කළ ව්‍යාපාදය නැවත නූපදින්නේ කෙසේදැයි ද දැන ගනී.\n\nතවද භික්ෂුව තුළ ථීනමිද්ධය ඇත්නම්, ‘මා තුළ ථීනමිද්ධය ඇත’ යැයි ද, ථීනමිද්ධය නැත්නම්, ‘මා තුළ ථීනමිද්ධය නැත’ යැයි ද දැන ගනී. තවද නූපන් ථීනමිද්ධය උපදින්නේ කෙසේදැයි ද, උපන් ථීනමිද්ධය දුරු කරන්නේ කෙසේදැයි ද, දුරු කළ ථීනමිද්ධය නැවත නූපදින්නේ කෙසේදැයි ද දැන ගනී.\n\nතවද භික්ෂුව තුළ උද්ධච්චකුක්කුච්චය ඇත්නම්, ‘මා තුළ උද්ධච්චකුක්කුච්චය ඇත’ යැයි ද, උද්ධච්චකුක්කුච්චය නැත්නම්, ‘මා තුළ උද්ධච්චකුක්කුච්චය නැත’ යැයි ද දැන ගනී. තවද නූපන් උද්ධච්චකුක්කුච්චය උපදින්නේ කෙසේදැයි ද, උපන් උද්ධච්චකුක්කුච්චය දුරු කරන්නේ කෙසේදැයි ද, දුරු කළ උද්ධච්චකුක්කුච්චය නැවත නූපදින්නේ කෙසේදැයි ද දැන ගනී.\n\nතවද භික්ෂුව තුළ විචිකිච්ඡාව ඇත්නම්, ‘මා තුළ විචිකිච්ඡාව ඇත’ යැයි ද, විචිකිච්ඡාව නැත්නම්, ‘මා තුළ විචිකිච්ඡාව නැත’ යැයි ද දැන ගනී. තවද නූපන් විචිකිච්ඡාව උපදින්නේ කෙසේදැයි ද, උපන් විචිකිච්ඡාව දුරු කරන්නේ කෙසේදැයි ද, දුරු කළ විචිකිච්ඡාව නැවත නූපදින්නේ කෙසේදැයි ද දැන ගනී.\n\nමෙසේ ඔහු තමා තුළ හෝ පිටත ධර්මයන්හි ධර්මානුපස්සීව වාසය කරයි. නැතහොත් තමා තුළත් පිටතත් ධර්මයන්හි ධර්මානුපස්සීව වාසය කරයි. ධර්මයන්ගේ හටගැනීම දකිමින් වාසය කරයි. නැතහොත් ධර්මයන්ගේ නැතිවීම දකිමින් වාසය කරයි. නැතහොත් ධර්මයන්ගේ හටගැනීම හා නැතිවීම දකිමින් වාසය කරයි. ‘ධර්ම ඇත’ යන සිහිය ඔහුට දැනුම පිණිසත්, සිහිය පිණිසත් පමණක් පිහිටයි. ඔහු ලෝකයේ කිසිවකට නොඇලී උපාදාන නොකරයි. මහණෙනි, භික්ෂුව පංච නීවරණයන්හි ධර්මානුපස්සීව වාසය කරන්නේ මෙසේ ය. නීවරණ පබ්බය නිමි.",
      "paliTitle": "Dhammānupassanā nīvaraṇapabbaṃ",
      "englishTitle": "Contemplation of mental objects: Hindrance section",
      "sinhalaTitle": "ධම්මානුපස්සනා නීවරණ පබ්බය"
    },
    {
      "number": 383,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammesu dhammānupassī viharati pañcasu upādānakkhandhesu. Kathañca pana, bhikkhave, bhikkhu dhammesu dhammānupassī viharati pañcasu upādānakkhandhesu? Idha, bhikkhave, bhikkhu – ‘iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā, iti vedanāya samudayo, iti vedanāya atthaṅgamo; iti saññā, iti saññāya samudayo, iti saññāya atthaṅgamo; iti saṅkhārā, iti saṅkhārānaṃ samudayo, iti saṅkhārānaṃ atthaṅgamo, iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti, iti ajjhattaṃ vā dhammesu dhammānupassī viharati, bahiddhā vā dhammesu dhammānupassī viharati, ajjhattabahiddhā vā dhammesu dhammānupassī viharati. Samudayadhammānupassī vā dhammesu viharati, vayadhammānupassī vā dhammesu viharati, samudayavayadhammānupassī vā dhammesu viharati. ‘Atthi dhammā’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya, anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu dhammesu dhammānupassī viharati pañcasu upādānakkhandhesu. Khandhapabbaṃ niṭṭhitaṃ. ",
      "english": "Furthermore, monks, a monk dwells contemplating phenomena in the five aggregates subject to clinging. And how, monks, does a monk dwell contemplating phenomena in the five aggregates subject to clinging? Here, monks, a monk: 'This is form, this is the arising of form, this is the cessation of form; this is feeling, this is the arising of feeling, this is the cessation of feeling; this is perception, this is the arising of perception, this is the cessation of perception; these are mental formations, this is the arising of mental formations, this is the cessation of mental formations; this is consciousness, this is the arising of consciousness, this is the cessation of consciousness.' Thus, he dwells contemplating phenomena in phenomena internally, or externally, or both internally and externally. He dwells contemplating phenomena observing their arising, or contemplating phenomena observing their passing away, or contemplating phenomena observing both their arising and passing away. Or, mindfulness that 'there are phenomena' is established in him to the extent necessary for mere knowledge and remembrance, and he dwells detached, clinging to nothing in the world. In this way too, monks, a monk dwells contemplating phenomena in the five aggregates subject to clinging. The section on the aggregates is concluded.",
      "sinhala": "තවද, මහණෙනි, භික්ෂුව පංච උපාදානස්කන්ධයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. මහණෙනි, භික්ෂුව කෙසේ නම් පංච උපාදානස්කන්ධයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරන්නේද? මහණෙනි, මෙහිලා භික්ෂුව ‘මෙය රූපයයි, මෙය රූපයේ හටගැනීමයි, මෙය රූපයේ නැතිවීමයි; මෙය වේදනාවයි, මෙය වේදනාවේ හටගැනීමයි, මෙය වේදනාවේ නැතිවීමයි; මෙය සංඥාවයි, මෙය සංඥාවේ හටගැනීමයි, මෙය සංඥාවේ නැතිවීමයි; මේවා සංඛාරයෝය, මේවා සංඛාරයන්ගේ හටගැනීමයි, මේවා සංඛාරයන්ගේ නැතිවීමයි; මෙය විඤ්ඤාණයයි, මෙය විඤ්ඤාණයේ හටගැනීමයි, මෙය විඤ්ඤාණයේ නැතිවීමයි’යි යනුවෙන් අධ්‍යාත්මිකව හෝ ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. බාහිරව හෝ ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. අධ්‍යාත්මිකව හා බාහිරව හෝ ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. හටගැනීමේ ධර්මයන් අනුපස්සනා කරමින් වාසය කරයි. නැතිවීමේ ධර්මයන් අනුපස්සනා කරමින් වාසය කරයි. හටගැනීම හා නැතිවීම යන ධර්මයන් දෙකම අනුපස්සනා කරමින් වාසය කරයි. ‘ධර්මයෝ ඇත’ යන සිහිය ඔහුට දැනුම ලබාගැනීම සඳහා පමණක් ද සිහිය පිහිටුවා ගැනීම සඳහා පමණක් ද පවතී. ඔහු තෘෂ්ණාවෙන් තොරව වාසය කරයි. ලෝකයේ කිසිවක් උපාදානය නොකරයි. මහණෙනි, මෙසේද භික්ෂුව පංච උපාදානස්කන්ධයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. ඛන්ධක පබ්බය නිමයි.",
      "paliTitle": "Dhammānupassanā khandhapabbaṃ",
      "englishTitle": "Contemplation of Phenomena: Aggregate Section",
      "sinhalaTitle": "ධම්මානුපස්සනා ඛන්ධපබ්බං"
    },
    {
      "number": 384,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammesu dhammānupassī viharati chasu ajjhattikabāhiresu āyatanesu. Kathañca pana, bhikkhave, bhikkhu dhammesu dhammānupassī viharati chasu ajjhattikabāhiresu āyatanesu? ‘‘Idha, bhikkhave, bhikkhu cakkhuñca pajānāti, rūpe ca pajānāti, yañca tadubhayaṃ paṭicca uppajjati saṃyojanaṃ tañca pajānāti, yathā ca anuppannassa saṃyojanassa uppādo hoti tañca pajānāti, yathā ca uppannassa saṃyojanassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa saṃyojanassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Sotañca pajānāti, sadde ca pajānāti, yañca tadubhayaṃ paṭicca uppajjati saṃyojanaṃ tañca pajānāti, yathā ca anuppannassa saṃyojanassa uppādo hoti tañca pajānāti, yathā ca uppannassa saṃyojanassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa saṃyojanassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Ghānañca pajānāti, gandhe ca pajānāti, yañca tadubhayaṃ paṭicca uppajjati saṃyojanaṃ tañca pajānāti, yathā ca anuppannassa saṃyojanassa uppādo hoti tañca pajānāti, yathā ca uppannassa saṃyojanassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa saṃyojanassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Jivhañca pajānāti, rase ca pajānāti, yañca tadubhayaṃ paṭicca uppajjati saṃyojanaṃ tañca pajānāti, yathā ca anuppannassa saṃyojanassa uppādo hoti tañca pajānāti, yathā ca uppannassa saṃyojanassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa saṃyojanassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Kāyañca pajānāti, phoṭṭhabbe ca pajānāti, yañca tadubhayaṃ paṭicca uppajjati saṃyojanaṃ tañca pajānāti, yathā ca anuppannassa saṃyojanassa uppādo hoti tañca pajānāti, yathā ca uppannassa saṃyojanassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa saṃyojanassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Manañca pajānāti, dhamme ca pajānāti, yañca tadubhayaṃ paṭicca uppajjati saṃyojanaṃ tañca pajānāti, yathā ca anuppannassa saṃyojanassa uppādo hoti tañca pajānāti, yathā ca uppannassa saṃyojanassa pahānaṃ hoti tañca pajānāti, yathā ca pahīnassa saṃyojanassa āyatiṃ anuppādo hoti tañca pajānāti. ‘‘Iti ajjhattaṃ vā dhammesu dhammānupassī viharati, bahiddhā vā dhammesu dhammānupassī viharati, ajjhattabahiddhā vā dhammesu dhammānupassī viharati. Samudayadhammānupassī vā dhammesu viharati, vayadhammānupassī vā dhammesu viharati, samudayavayadhammānupassī vā dhammesu viharati. ‘Atthi dhammā’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya, anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu dhammesu dhammānupassī viharati chasu ajjhattikabāhiresu āyatanesu. Āyatanapabbaṃ niṭṭhitaṃ. ",
      "english": "Furthermore, bhikkhus, a bhikkhu dwells contemplating phenomena in phenomena with regard to the six internal and external sense bases. And how, bhikkhus, does a bhikkhu dwell contemplating phenomena in phenomena with regard to the six internal and external sense bases?\n\nHere, bhikkhus, a bhikkhu understands the eye, and he understands forms, and he understands the fetter that arises dependent on both; he understands how an unarisen fetter arises; he understands how an arisen fetter is abandoned; and he understands how an abandoned fetter does not arise again in the future.\n\nHe understands the ear, and he understands sounds, and he understands the fetter that arises dependent on both; he understands how an unarisen fetter arises; he understands how an arisen fetter is abandoned; and he understands how an abandoned fetter does not arise again in the future.\n\nHe understands the nose, and he understands odors, and he understands the fetter that arises dependent on both; he understands how an unarisen fetter arises; he understands how an arisen fetter is abandoned; and he understands how an abandoned fetter does not arise again in the future.\n\nHe understands the tongue, and he understands tastes, and he understands the fetter that arises dependent on both; he understands how an unarisen fetter arises; he understands how an arisen fetter is abandoned; and he understands how an abandoned fetter does not arise again in the future.\n\nHe understands the body, and he understands tactile objects, and he understands the fetter that arises dependent on both; he understands how an unarisen fetter arises; he understands how an arisen fetter is abandoned; and he understands how an abandoned fetter does not arise again in the future.\n\nHe understands the mind, and he understands mental objects, and he understands the fetter that arises dependent on both; he understands how an unarisen fetter arises; he understands how an arisen fetter is abandoned; and he understands how an abandoned fetter does not arise again in the future.\n\nThus, he dwells contemplating phenomena in phenomena internally, or he dwells contemplating phenomena in phenomena externally, or he dwells contemplating phenomena in phenomena both internally and externally. He dwells contemplating the phenomenon of origination in phenomena, or he dwells contemplating the phenomenon of passing away in phenomena, or he dwells contemplating the phenomenon of both origination and passing away in phenomena. Or mindfulness that ‘there are phenomena’ is established in him to the extent necessary for mere knowledge and continued mindfulness. And he dwells detached, and clings to nothing in the world. In this way, bhikkhus, a bhikkhu dwells contemplating phenomena in phenomena with regard to the six internal and external sense bases. The section on the sense bases is concluded.",
      "sinhala": "තවද මහණෙනි, භික්ෂුව සය වැදෑරුම් අභ්‍යන්තර හා බාහිර ආයතනයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. මහණෙනි, භික්ෂුව සය වැදෑරුම් අභ්‍යන්තර හා බාහිර ආයතනයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරන්නේ කෙසේද?\n\nමහණෙනි, මෙහිලා භික්ෂුව ඇස ද රූප ද හඳුනා ගනී. එම දෙක හේතු කොටගෙන යම් සංයෝජනයක් උපදී නම් එය ද හඳුනා ගනී. නූපන් සංයෝජනයක උපත කෙසේ වේද එය ද හඳුනා ගනී. උපන් සංයෝජනයක ප්‍රහාණය කෙසේ වේද එය ද හඳුනා ගනී. ප්‍රහීණ වූ සංයෝජනයක අනාගතයෙහි නූපදීම කෙසේ වේද එය ද හඳුනා ගනී.\nකන ද ශබ්ද ද හඳුනා ගනී. එම දෙක හේතු කොටගෙන යම් සංයෝජනයක් උපදී නම් එය ද හඳුනා ගනී. නූපන් සංයෝජනයක උපත කෙසේ වේද එය ද හඳුනා ගනී. උපන් සංයෝජනයක ප්‍රහාණය කෙසේ වේද එය ද හඳුනා ගනී. ප්‍රහීණ වූ සංයෝජනයක අනාගතයෙහි නූපදීම කෙසේ වේද එය ද හඳුනා ගනී.\nනාසය ද ගන්ධ ද හඳුනා ගනී. එම දෙක හේතු කොටගෙන යම් සංයෝජනයක් උපදී නම් එය ද හඳුනා ගනී. නූපන් සංයෝජනයක උපත කෙසේ වේද එය ද හඳුනා ගනී. උපන් සංයෝජනයක ප්‍රහාණය කෙසේ වේද එය ද හඳුනා ගනී. ප්‍රහීණ වූ සංයෝජනයක අනාගතයෙහි නූපදීම කෙසේ වේද එය ද හඳුනා ගනී.\nදිව ද රස ද හඳුනා ගනී. එම දෙක හේතු කොටගෙන යම් සංයෝජනයක් උපදී නම් එය ද හඳුනා ගනී. නූපන් සංයෝජනයක උපත කෙසේ වේද එය ද හඳුනා ගනී. උපන් සංයෝජනයක ප්‍රහාණය කෙසේ වේද එය ද හඳුනා ගනී. ප්‍රහීණ වූ සංයෝජනයක අනාගතයෙහි නූපදීම කෙසේ වේද එය ද හඳුනා ගනී.\nකය ද ස්පර්ශ ද හඳුනා ගනී. එම දෙක හේතු කොටගෙන යම් සංයෝජනයක් උපදී නම් එය ද හඳුනා ගනී. නූපන් සංයෝජනයක උපත කෙසේ වේද එය ද හඳුනා ගනී. උපන් සංයෝජනයක ප්‍රහාණය කෙසේ වේද එය ද හඳුනා ගනී. ප්‍රහීණ වූ සංයෝජනයක අනාගතයෙහි නූපදීම කෙසේ වේද එය ද හඳුනා ගනී.\nමනස ද ධර්මයන් ද හඳුනා ගනී. එම දෙක හේතු කොටගෙන යම් සංයෝජනයක් උපදී නම් එය ද හඳුනා ගනී. නූපන් සංයෝජනයක උපත කෙසේ වේද එය ද හඳුනා ගනී. උපන් සංයෝජනයක ප්‍රහාණය කෙසේ වේද එය ද හඳුනා ගනී. ප්‍රහීණ වූ සංයෝජනයක අනාගතයෙහි නූපදීම කෙසේ වේද එය ද හඳුනා ගනී.\n\nමෙසේ අභ්‍යන්තර ධර්මයන්හි ධර්මානුපස්සීව වාසය කරයි. එසේම බාහිර ධර්මයන්හි ධර්මානුපස්සීව වාසය කරයි. තවද අභ්‍යන්තර හා බාහිර ධර්මයන්හි ධර්මානුපස්සීව වාසය කරයි. හටගන්නා ස්වභාවය ඇති ධර්මයන් නුවණින් බලමින් වාසය කරයි. නැති වී යන ස්වභාවය ඇති ධර්මයන් නුවණින් බලමින් වාසය කරයි. හටගන්නා හා නැති වී යන ස්වභාවය ඇති ධර්මයන් නුවණින් බලමින් වාසය කරයි. 'ධර්ම ඇත' යන සිහිය ඔහුගේ නුවණ පිණිස පමණක් ද, සිහි කිරීම පිණිස පමණක් ද පිහිටා පවතී. ඔහු ඇල්මක් රහිතව වාසය කරයි. ලෝකයෙහි කිසිවක් උපාදානය නොකරයි. මහණෙනි, භික්ෂුව මෙසේ සය වැදෑරුම් අභ්‍යන්තර හා බාහිර ආයතනයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. ආයතන පරිච්ඡේදය නිමි.",
      "paliTitle": "Dhammānupassanā āyatanapabbaṃ",
      "englishTitle": "Contemplation of dhammas: sense-base section",
      "sinhalaTitle": "ධම්මානුපස්සනා ආයතන පබ්බය"
    },
    {
      "number": 385,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammesu dhammānupassī viharati sattasu bojjhaṅgesu. Kathañca pana, bhikkhave, bhikkhu dhammesu dhammānupassī viharati sattasu bojjhaṅgesu? Idha, bhikkhave, bhikkhu santaṃ vā ajjhattaṃ satisambojjhaṅgaṃ ‘atthi me ajjhattaṃ satisambojjhaṅgo’ti pajānāti, asantaṃ vā ajjhattaṃ satisambojjhaṅgaṃ ‘natthi me ajjhattaṃ satisambojjhaṅgo’ti pajānāti, yathā ca anuppannassa satisambojjhaṅgassa uppādo hoti tañca pajānāti, yathā ca uppannassa satisambojjhaṅgassa bhāvanāya pāripūrī hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ dhammavicayasambojjhaṅgaṃ ‘atthi me ajjhattaṃ dhammavicayasambojjhaṅgo’ti pajānāti, asantaṃ vā ajjhattaṃ dhammavicayasambojjhaṅgaṃ ‘natthi me ajjhattaṃ dhammavicayasambojjhaṅgo’ti pajānāti, yathā ca anuppannassa dhammavicayasambojjhaṅgassa uppādo hoti tañca pajānāti, yathā ca uppannassa dhammavicayasambojjhaṅgassa bhāvanāya pāripūrī hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ vīriyasambojjhaṅgaṃ ‘atthi me ajjhattaṃ vīriyasambojjhaṅgo’ti pajānāti, asantaṃ vā ajjhattaṃ vīriyasambojjhaṅgaṃ ‘natthi me ajjhattaṃ vīriyasambojjhaṅgo’ti pajānāti, yathā ca anuppannassa vīriyasambojjhaṅgassa uppādo hoti tañca pajānāti, yathā ca uppannassa vīriyasambojjhaṅgassa bhāvanāya pāripūrī hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ pītisambojjhaṅgaṃ ‘atthi me ajjhattaṃ pītisambojjhaṅgo’ti pajānāti, asantaṃ vā ajjhattaṃ pītisambojjhaṅgaṃ ‘natthi me ajjhattaṃ pītisambojjhaṅgo’ti pajānāti, yathā ca anuppannassa pītisambojjhaṅgassa uppādo hoti tañca pajānāti, yathā ca uppannassa pītisambojjhaṅgassa bhāvanāya pāripūrī hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ passaddhisambojjhaṅgaṃ ‘atthi me ajjhattaṃ passaddhisambojjhaṅgo’ti pajānāti, asantaṃ vā ajjhattaṃ passaddhisambojjhaṅgaṃ ‘natthi me ajjhattaṃ passaddhisambojjhaṅgo’ti pajānāti, yathā ca anuppannassa passaddhisambojjhaṅgassa uppādo hoti tañca pajānāti, yathā ca uppannassa passaddhisambojjhaṅgassa bhāvanāya pāripūrī hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ samādhisambojjhaṅgaṃ ‘atthi me ajjhattaṃ samādhisambojjhaṅgo’ti pajānāti, asantaṃ vā ajjhattaṃ samādhisambojjhaṅgaṃ ‘natthi me ajjhattaṃ samādhisambojjhaṅgo’ti pajānāti, yathā ca anuppannassa samādhisambojjhaṅgassa uppādo hoti tañca pajānāti, yathā ca uppannassa samādhisambojjhaṅgassa bhāvanāya pāripūrī hoti tañca pajānāti. ‘‘Santaṃ vā ajjhattaṃ upekkhāsambojjhaṅgaṃ ‘atthi me ajjhattaṃ upekkhāsambojjhaṅgo’ti pajānāti, asantaṃ vā ajjhattaṃ upekkhāsambojjhaṅgaṃ ‘natthi me ajjhattaṃ upekkhāsambojjhaṅgo’ti pajānāti, yathā ca anuppannassa upekkhāsambojjhaṅgassa uppādo hoti tañca pajānāti, yathā ca uppannassa upekkhāsambojjhaṅgassa bhāvanāya pāripūrī hoti tañca pajānāti. ‘‘Iti ajjhattaṃ vā dhammesu dhammānupassī viharati, bahiddhā vā dhammesu dhammānupassī viharati, ajjhattabahiddhā vā dhammesu dhammānupassī viharati. Samudayadhammānupassī vā dhammesu viharati, vayadhammānupassī vā dhammesu viharati, samudayavayadhammānupassī vā dhammesu viharati ‘atthi dhammā’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu dhammesu dhammānupassī viharati sattasu bojjhaṅgesu. Bojjhaṅgapabbaṃ niṭṭhitaṃ. [bojjhaṅgapabbaṃ niṭṭhitaṃ, paṭhamabhāṇavāraṃ (syā.)] ",
      "english": "Furthermore, monks, a bhikkhu dwells contemplating phenomena in phenomena with regard to the seven factors of awakening. And how does a bhikkhu dwell contemplating phenomena in phenomena with regard to the seven factors of awakening?\n\nHere, monks, when the mindfulness factor of awakening is present within, a bhikkhu knows, \"The mindfulness factor of awakening is present within me.\" When the mindfulness factor of awakening is not present within, he knows, \"The mindfulness factor of awakening is not present within me.\" He also understands how the unarisen mindfulness factor of awakening arises, and how the arisen mindfulness factor of awakening is brought to fulfillment through development.\n\nWhen the investigation of phenomena factor of awakening is present within, he knows, \"The investigation of phenomena factor of awakening is present within me.\" When the investigation of phenomena factor of awakening is not present within, he knows, \"The investigation of phenomena factor of awakening is not present within me.\" He also understands how the unarisen investigation of phenomena factor of awakening arises, and how the arisen investigation of phenomena factor of awakening is brought to fulfillment through development.\n\nWhen the energy factor of awakening is present within, he knows, \"The energy factor of awakening is present within me.\" When the energy factor of awakening is not present within, he knows, \"The energy factor of awakening is not present within me.\" He also understands how the unarisen energy factor of awakening arises, and how the arisen energy factor of awakening is brought to fulfillment through development.\n\nWhen the rapture factor of awakening is present within, he knows, \"The rapture factor of awakening is present within me.\" When the rapture factor of awakening is not present within, he knows, \"The rapture factor of awakening is not present within me.\" He also understands how the unarisen rapture factor of awakening arises, and how the arisen rapture factor of awakening is brought to fulfillment through development.\n\nWhen the tranquility factor of awakening is present within, he knows, \"The tranquility factor of awakening is present within me.\" When the tranquility factor of awakening is not present within, he knows, \"The tranquility factor of awakening is not present within me.\" He also understands how the unarisen tranquility factor of awakening arises, and how the arisen tranquility factor of awakening is brought to fulfillment through development.\n\nWhen the concentration factor of awakening is present within, he knows, \"The concentration factor of awakening is present within me.\" When the concentration factor of awakening is not present within, he knows, \"The concentration factor of awakening is not present within me.\" He also understands how the unarisen concentration factor of awakening arises, and how the arisen concentration factor of awakening is brought to fulfillment through development.\n\nWhen the equanimity factor of awakening is present within, he knows, \"The equanimity factor of awakening is present within me.\" When the equanimity factor of awakening is not present within, he knows, \"The equanimity factor of awakening is not present within me.\" He also understands how the unarisen equanimity factor of awakening arises, and how the arisen equanimity factor of awakening is brought to fulfillment through development.\n\nThus, he dwells contemplating phenomena in phenomena internally, or he dwells contemplating phenomena in phenomena externally, or he dwells contemplating phenomena in phenomena both internally and externally. He dwells contemplating the phenomenon of arising in phenomena, or he dwells contemplating the phenomenon of passing away in phenomena, or he dwells contemplating the phenomenon of both arising and passing away in phenomena. Or, mindfulness that \"there are phenomena\" is established in him to the extent necessary for knowledge and remembrance, and he dwells independent, not clinging to anything in the world. In this way, too, monks, a bhikkhu dwells contemplating phenomena in phenomena with regard to the seven factors of awakening. The section on the factors of awakening is complete.",
      "sinhala": "මහණෙනි, තවද භික්ෂුව ධර්මයන්හි ධර්මානුපස්සීව සප්ත බොජ්ඣංගයන්හි වාසය කරයි. මහණෙනි, භික්ෂුව කෙසේ නම් ධර්මයන්හි ධර්මානුපස්සීව සප්ත බොජ්ඣංගයන්හි වාසය කරන්නේ ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව තමා තුළ සති සම්බොජ්ඣංගය ඇත්නම්, ‘මා තුළ සති සම්බොජ්ඣංගය ඇත’ යි දැන ගනී. තමා තුළ සති සම්බොජ්ඣංගය නැත්නම්, ‘මා තුළ සති සම්බොජ්ඣංගය නැත’ යි දැන ගනී. නූපන් සති සම්බොජ්ඣංගය ඇති වීම කෙසේ දැයි එය ද දැන ගනී. උපන් සති සම්බොජ්ඣංගය වැඩීමෙන් සම්පූර්ණ වීම කෙසේ දැයි එය ද දැන ගනී.\n\nතමා තුළ ධම්මවිචය සම්බොජ්ඣංගය ඇත්නම්, ‘මා තුළ ධම්මවිචය සම්බොජ්ඣංගය ඇත’ යි දැන ගනී. තමා තුළ ධම්මවිචය සම්බොජ්ඣංගය නැත්නම්, ‘මා තුළ ධම්මවිචය සම්බොජ්ඣංගය නැත’ යි දැන ගනී. නූපන් ධම්මවිචය සම්බොජ්ඣංගය ඇති වීම කෙසේ දැයි එය ද දැන ගනී. උපන් ධම්මවිචය සම්බොජ්ඣංගය වැඩීමෙන් සම්පූර්ණ වීම කෙසේ දැයි එය ද දැන ගනී.\n\nතමා තුළ වීරිය සම්බොජ්ඣංගය ඇත්නම්, ‘මා තුළ වීරිය සම්බොජ්ඣංගය ඇත’ යි දැන ගනී. තමා තුළ වීරිය සම්බොජ්ඣංගය නැත්නම්, ‘මා තුළ වීරිය සම්බොජ්ඣංගය නැත’ යි දැන ගනී. නූපන් වීරිය සම්බොජ්ඣංගය ඇති වීම කෙසේ දැයි එය ද දැන ගනී. උපන් වීරිය සම්බොජ්ඣංගය වැඩීමෙන් සම්පූර්ණ වීම කෙසේ දැයි එය ද දැන ගනී.\n\nතමා තුළ පීති සම්බොජ්ඣංගය ඇත්නම්, ‘මා තුළ පීති සම්බොජ්ඣංගය ඇත’ යි දැන ගනී. තමා තුළ පීති සම්බොජ්ඣංගය නැත්නම්, ‘මා තුළ පීති සම්බොජ්ඣංගය නැත’ යි දැන ගනී. නූපන් පීති සම්බොජ්ඣංගය ඇති වීම කෙසේ දැයි එය ද දැන ගනී. උපන් පීති සම්බොජ්ඣංගය වැඩීමෙන් සම්පූර්ණ වීම කෙසේ දැයි එය ද දැන ගනී.\n\nතමා තුළ පස්සද්ධි සම්බොජ්ඣංගය ඇත්නම්, ‘මා තුළ පස්සද්ධි සම්බොජ්ඣංගය ඇත’ යි දැන ගනී. තමා තුළ පස්සද්ධි සම්බොජ්ඣංගය නැත්නම්, ‘මා තුළ පස්සද්ධි සම්බොජ්ඣංගය නැත’ යි දැන ගනී. නූපන් පස්සද්ධි සම්බොජ්ඣංගය ඇති වීම කෙසේ දැයි එය ද දැන ගනී. උපන් පස්සද්ධි සම්බොජ්ඣංගය වැඩීමෙන් සම්පූර්ණ වීම කෙසේ දැයි එය ද දැන ගනී.\n\nතමා තුළ සමාධි සම්බොජ්ඣංගය ඇත්නම්, ‘මා තුළ සමාධි සම්බොජ්ඣංගය ඇත’ යි දැන ගනී. තමා තුළ සමාධි සම්බොජ්ඣංගය නැත්නම්, ‘මා තුළ සමාධි සම්බොජ්ඣංගය නැත’ යි දැන ගනී. නූපන් සමාධි සම්බොජ්ඣංගය ඇති වීම කෙසේ දැයි එය ද දැන ගනී. උපන් සමාධි සම්බොජ්ඣංගය වැඩීමෙන් සම්පූර්ණ වීම කෙසේ දැයි එය ද දැන ගනී.\n\nතමා තුළ උපේක්ඛා සම්බොජ්ඣංගය ඇත්නම්, ‘මා තුළ උපේක්ඛා සම්බොජ්ඣංගය ඇත’ යි දැන ගනී. තමා තුළ උපේක්ඛා සම්බොජ්ඣංගය නැත්නම්, ‘මා තුළ උපේක්ඛා සම්බොජ්ඣංගය නැත’ යි දැන ගනී. නූපන් උපේක්ඛා සම්බොජ්ඣංගය ඇති වීම කෙසේ දැයි එය ද දැන ගනී. උපන් උපේක්ඛා සම්බොජ්ඣංගය වැඩීමෙන් සම්පූර්ණ වීම කෙසේ දැයි එය ද දැන ගනී.\n\nමෙසේ තමා තුළ හෝ බාහිර ධර්මයන්හි ධර්මානුපස්සීව වාසය කරයි. එසේම, තමා තුළ සහ බාහිර ධර්මයන්හි ධර්මානුපස්සීව වාසය කරයි. ධර්මයන්ගේ හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. නැතහොත් නැතිවීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. එසේත් නැතහොත් හටගැනීමේ හා නැතිවීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. ‘ධර්මයෝ ඇත්තාහ’ යි ඔහුගේ සිහිය එළඹ සිටී. ඒ ඥානය පිණිස පමණක් ද, සිහිය පිණිස පමණක් ද වේ. ඔහු කිසිදු ඇලීමක් නැතිව වාසය කරයි. ලෝකයෙහි කිසිවක් උපාදානය නොකරයි. මහණෙනි, මෙසේ ද භික්ෂුව ධර්මයන්හි ධර්මානුපස්සීව සප්ත බොජ්ඣංගයන්හි වාසය කරයි.\n\nබොජ්ඣංග පරිච්ඡේදය නිම විය.",
      "paliTitle": "Dhammānupassanā bojjhaṅgapabbaṃ",
      "englishTitle": "Contemplation of Dhammas: Factors of Enlightenment",
      "sinhalaTitle": "ධම්මානුපස්සනා බොජ්ඣංග පබ්බය"
    },
    {
      "number": 386,
      "pali": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammesu dhammānupassī viharati catūsu ariyasaccesu. Kathañca pana, bhikkhave, bhikkhu dhammesu dhammānupassī viharati catūsu ariyasaccesu? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Paṭhamabhāṇavāro niṭṭhito. ",
      "english": "Furthermore, monks, a monk dwells observing phenomena in phenomena with regard to the four noble truths. And how, monks, does a monk dwell observing phenomena in phenomena with regard to the four noble truths? In this case, monks, a monk understands as it actually is: 'This is suffering.' He understands as it actually is: 'This is the origin of suffering.' He understands as it actually is: 'This is the cessation of suffering.' He understands as it actually is: 'This is the path leading to the cessation of suffering.'\n\nThe first recitation section is finished.",
      "sinhala": "තවද මහණෙනි, භික්ෂුව සතර ආර්ය සත්‍යයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරයි. මහණෙනි, භික්ෂුව සතර ආර්ය සත්‍යයන්හි ධර්මයන් කෙරෙහි ධර්මානුපස්සීව වාසය කරන්නේ කෙසේද යත්: මහණෙනි, මෙහි භික්ෂුව 'මෙය දුකයි' කියා යථාභූතව දනී. 'මෙය දුකට හේතුවයි' කියා යථාභූතව දනී. 'මෙය දුක නැති කිරීමයි' කියා යථාභූතව දනී. 'මෙය දුක නැති කිරීමට යන මාර්ගයයි' කියා යථාභූතව දනී. පළමුවන භාණවාරය නිම විය.",
      "paliTitle": "Dhammānupassanā saccapabbaṃ",
      "englishTitle": "Contemplation of Truths Section",
      "sinhalaTitle": "ධම්මානුපස්සනා සච්ච පබ්බය"
    },
    {
      "number": 387,
      "pali": "‘‘Katamañca, bhikkhave, dukkhaṃ ariyasaccaṃ? Jātipi dukkhā, jarāpi dukkhā, maraṇampi dukkhaṃ, sokaparidevadukkhadomanassupāyāsāpi dukkhā, appiyehi sampayogopi dukkho, piyehi vippayogopi dukkho [appiyehi…pe… vippayogo dukkhotipāṭho ceva taṃniddeso ca katthaci na dissati, aṭṭhakathāyaṃpi taṃsaṃvaṇṇanā natthi], yampicchaṃ na labhati tampi dukkhaṃ, saṅkhittena pañcupādānakkhandhā [pañcupādānakkhandhāpi (ka.)] dukkhā.",
      "english": "And what, bhikkhus, is the noble truth of suffering? Birth is suffering; aging is suffering; death is suffering; sorrow, lamentation, pain, grief, and despair are suffering; association with the disliked is suffering; separation from the liked is suffering; not getting what one wants is suffering. In brief, the five aggregates subject to clinging are suffering.",
      "sinhala": "මහණෙනි, දුක්ඛ ආර්යසත්‍යය යනු කුමක්ද? ඉපදීම දුකකි, ජරාව දුකකි, මරණය දුකකි, ශෝකය, වැළපීම, කායික දුක්, මානසික දුක් සහ සුසුම්ලෑම් දුක් වෙති. අප්‍රියයන් හා එක්වීම දුකය, ප්‍රියයන්ගෙන් වෙන්වීම දුකය, යමක් ප්‍රාර්ථනා කළත් එය නොලැබීම දුකය. කෙටියෙන් කියතොත් පංච උපාදානස්කන්ධයෝ දුක්හ.",
      "paliTitle": "Dukkhasaccaniddeso",
      "englishTitle": "Explanation of the Truth of Suffering",
      "sinhalaTitle": "දුක්ඛ සච්ච නිද්දේසය"
    },
    {
      "number": 388,
      "pali": "‘‘Katamā ca, bhikkhave, jāti? Yā tesaṃ tesaṃ sattānaṃ tamhi tamhi sattanikāye jāti sañjāti okkanti abhinibbatti khandhānaṃ pātubhāvo āyatanānaṃ paṭilābho, ayaṃ vuccati, bhikkhave, jāti.",
      "english": "And what, monks, is birth? It is the birth, coming-into-being, conception, arising, appearance of the aggregates, and acquisition of the sense bases of the various beings in their respective groups of beings. This, monks, is called birth.",
      "sinhala": "මහණෙනි, ජාතිය යනු කුමක් ද? යම් ඒ ඒ සත්වයන් ඒ ඒ සත්ව නිකායෙහි ඉපදීම, නැවත ඉපදීම, පිළිසිඳගැනීම, මැනවින් පහළ වීම, ස්කන්ධයන්ගේ ප්‍රාදුර්භූත වීම, ආයතනයන් ලැබීම යන මෙය ජාතිය යැයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 389,
      "pali": "‘‘Katamā ca, bhikkhave, jarā? Yā tesaṃ tesaṃ sattānaṃ tamhi tamhi sattanikāye jarā jīraṇatā khaṇḍiccaṃ pāliccaṃ valittacatā āyuno saṃhāni indriyānaṃ paripāko, ayaṃ vuccati, bhikkhave, jarā.",
      "english": "And what, monks, is aging? It is the aging, wearing out, brokenness, graying, wrinkling, decline of vitality, and weakening of the senses of various beings in their respective groups of beings. This, monks, is called aging.",
      "sinhala": "භික්ෂූණෙනි, ජරාව යනු කුමක් ද? යම් ඒ ඒ සත්ව නිකායෙහි වූ ඒ ඒ සත්වයන්ගේ ජරාව, ජීර්ණතාව, දත් බිඳී යාම, කෙස් පැසීම, සම රැලි වැටීම, ආයුෂ ක්ෂය වීම, ඉන්ද්‍රියයන්ගේ පරිහානිය වේ ද, භික්ෂූණෙනි, මෙය ජරාව යයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 390,
      "pali": "‘‘Katamañca, bhikkhave, maraṇaṃ? Yaṃ [aṭṭhakathā oloketabbā] tesaṃ tesaṃ sattānaṃ tamhā tamhā sattanikāyā cuti cavanatā bhedo antaradhānaṃ maccu maraṇaṃ kālakiriyā khandhānaṃ bhedo kaḷevarassa nikkhepo jīvitindriyassupacchedo, idaṃ vuccati, bhikkhave, maraṇaṃ.",
      "english": "And what, monks, is death? It is the passing away, ceasing, dissolution, disappearance, death, demise, the end of life, the dissolution of the aggregates, the discarding of the body, and the cutting off of the life-faculty, of various beings from this or that group of beings. This, monks, is called death.",
      "sinhala": "මහණෙනි, මරණය යනු කුමක්ද? යම් ඒ ඒ සත්වයන් ඒ ඒ සත්ව කායයන්ගෙන් චුත වීමද, ච්‍යුත වීමද, බිඳී යාමද, අතුරුදහන් වීමද, මච්චුද, මරණයද, කාලක්‍රියාවද, ස්කන්ධයන්ගේ බිඳීයාමද, කය අත්හැරීමද, ජීවිතේන්ද්‍රිය නිරුද්ධ වීමද වේද, මහණෙනි, මෙය මරණය යයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 391,
      "pali": "‘‘Katamo ca, bhikkhave, soko? Yo kho, bhikkhave, aññataraññatarena byasanena samannāgatassa aññataraññatarena dukkhadhammena phuṭṭhassa soko socanā socitattaṃ antosoko antoparisoko, ayaṃ vuccati, bhikkhave, soko.",
      "english": "And what, monks, is sorrow? Monks, whatever sorrow, grieving, state of sorrow, inner grief, or profound inner grief arises in one afflicted by this or that misfortune, touched by this or that painful condition—this is called sorrow.",
      "sinhala": "මහණෙනි, ශෝකය යනු කුමක් ද?\nමහණෙනි, යම් විපතකින් හෝ දුක්ඛ දහමකින් ස්පර්ශ වූවෙකු තුළ හටගන්නා ශෝකය, වැළපීම, ශෝකී බව, අභ්‍යන්තර ශෝකය සහ දැඩි අභ්‍යන්තර ශෝකය යන මේ සියල්ල ශෝකය ලෙස හැඳින්වේ.",
      "paliTitle": ""
    },
    {
      "number": 392,
      "pali": "‘‘Katamo ca, bhikkhave, paridevo? Yo kho, bhikkhave, aññataraññatarena byasanena samannāgatassa aññataraññatarena dukkhadhammena phuṭṭhassa ādevo paridevo ādevanā paridevanā ādevitattaṃ paridevitattaṃ, ayaṃ vuccati, bhikkhave paridevo.",
      "english": "And what, bhikkhus, is lamentation? Bhikkhus, that which is wailing, lamenting, the state of wailing, the state of lamenting, for one afflicted by this or that misfortune, touched by this or that painful condition—this is called lamentation.",
      "sinhala": "භික්ෂුවෙනි, පරිදේවය යනු කුමක් ද? භික්ෂුවෙනි, යම්කිසි විපතකින් යුක්ත වූ, යම්කිසි දුක්ඛ ධර්මයකින් ස්පර්ශ වූ පුද්ගලයෙකුගේ ආදේවය, පරිදේවය, ආදේවනා කිරීම, පරිදේවනා කිරීම, ආදේවිත බව සහ පරිදේවිත බව යන මේ සියල්ල පරිදේවය යැයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 393,
      "pali": "‘‘Katamañca, bhikkhave, dukkhaṃ? Yaṃ kho, bhikkhave, kāyikaṃ dukkhaṃ kāyikaṃ asātaṃ kāyasamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ, idaṃ vuccati, bhikkhave, dukkhaṃ.",
      "english": "And what, monks, is suffering? Monks, that which is bodily suffering, bodily unpleasantness, the suffering and unpleasant feeling born of bodily contact—this, monks, is called suffering.",
      "sinhala": "භික්ෂූන් වහන්ස, දුක යනු කුමක් ද? භික්ෂූන් වහන්ස, යම් ශාරීරික දුකක් වේ ද, ශාරීරික අප්‍රියතාවක් වේ ද, කය හා ස්පර්ශ වීමෙන් හටගන්නා යම් දුකක් වේ ද, අප්‍රිය වේදනාවක් වේ ද, භික්ෂූන් වහන්ස, එය දුක යැයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 394,
      "pali": "‘‘Katamañca, bhikkhave, domanassaṃ? Yaṃ kho, bhikkhave, cetasikaṃ dukkhaṃ cetasikaṃ asātaṃ manosamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ, idaṃ vuccati, bhikkhave, domanassaṃ.",
      "english": "And what, bhikkhus, is displeasure? It is, bhikkhus, the mental pain, the mental unpleasantness, the painful and unpleasant feeling born of mind-contact. This is called displeasure.",
      "sinhala": "මහණෙනි, දෝමනස්සය යනු කුමක් ද? මහණෙනි, යම් චෛතසික දුකක්, චෛතසික අසාතයක්, මනෝසම්ඵස්සය හේතුවෙන් හටගන්නා දුක්ඛ සහගත, අසාත සහගත වේදනාවක් වේ ද, මහණෙනි, එය දෝමනස්සය යැයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 395,
      "pali": "‘‘Katamo ca, bhikkhave, upāyāso? Yo kho, bhikkhave, aññataraññatarena byasanena samannāgatassa aññataraññatarena dukkhadhammena phuṭṭhassa āyāso upāyāso āyāsitattaṃ upāyāsitattaṃ, ayaṃ vuccati, bhikkhave, upāyāso.",
      "english": "And what, monks, is distress? Monks, it is the agitation, the anguish, the condition of being agitated, and the condition of being anguished that arises in one beset by one or another misfortune and touched by one or another painful experience. This, monks, is called distress.",
      "sinhala": "මහණෙනි, උපායාසය යනු කුමක් ද? මහණෙනි, යම් පුද්ගලයෙක් යම් යම් විපත්තිවලට හෝ දුක්ඛ ධර්මතාවලට පත්වීම නිසා ඇතිවන වෙහෙස, උපායාසය, වෙහෙසට පත්වීම හා උපායාසයට පත්වීම යන මේ සියල්ල උපායාසය යැයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 396,
      "pali": "‘‘Katamo ca, bhikkhave, appiyehi sampayogo dukkho? Idha yassa te honti aniṭṭhā akantā amanāpā rūpā saddā gandhā rasā phoṭṭhabbā dhammā, ye vā panassa te honti anatthakāmā ahitakāmā aphāsukakāmā ayogakkhemakāmā, yā tehi saddhiṃ saṅgati samāgamo samodhānaṃ missībhāvo, ayaṃ vuccati, bhikkhave, appiyehi sampayogo dukkho.",
      "english": "And what, monks, is the suffering of associating with what is disliked? It is this: encountering forms, sounds, smells, tastes, tactile objects, and mental objects that are unwanted, disagreeable, and displeasing. Or it is encountering those who wish one harm, wish one ill, wish one discomfort, and wish one insecurity. Fellowship, communion, intimacy, and mingling with such things or people: this, monks, is called the suffering of associating with what is disliked.",
      "sinhala": "මහණෙනි, අප්‍රියයන් හා සම්ප්‍රයෝගය දුක යනු කවරේද? මහණෙනි, යම් කෙනෙකුට අනිෂ්ට, අකාන්ත, අමනාප රූප, ශබ්ද, ගන්ධ, රස, ස්පර්ශ, ධර්මයන් ඇත්නම්, හෝ යම් අනර්ථය, අහිතය, අපහසුව, අයෝගක්‍ෂේමය පතන්නෝ වෙත් ද, ඔවුන් හා ඇතිවන සංගමය, සමාගමය, සමෝධානවීම, මිශ්‍රවීම යන මේ, මහණෙනි, අප්‍රියයන් හා සම්ප්‍රයෝගය දුක නම් වේ.",
      "paliTitle": ""
    },
    {
      "number": 397,
      "pali": "‘‘Katamo ca, bhikkhave, piyehi vippayogo dukkho? Idha yassa te honti iṭṭhā kantā manāpā rūpā saddā gandhā rasā phoṭṭhabbā dhammā, ye vā panassa te honti atthakāmā hitakāmā phāsukakāmā yogakkhemakāmā mātā vā pitā vā bhātā vā bhaginī vā mittā vā amaccā vā ñātisālohitā vā, yā tehi saddhiṃ asaṅgati asamāgamo asamodhānaṃ amissībhāvo, ayaṃ vuccati, bhikkhave, piyehi vippayogo dukkho.",
      "english": "And what, monks, is the suffering of separation from the beloved? It is this: when someone experiences the loss of desired, agreeable, and pleasing sights, sounds, smells, tastes, tactile sensations, or thoughts; or when separated from those who wish one well, who seek one's benefit, comfort, and security—whether mother, father, brother, sister, friends, companions, or relatives—the lack of meeting, the lack of coming together, the lack of concord, the lack of fellowship with them, this, monks, is called the suffering of separation from the beloved.",
      "sinhala": "භික්ෂූන් වහන්ස, ප්‍රියයන්ගෙන් වෙන්වීම දුක යනු කුමක් ද? යම් කෙනෙකුට ප්‍රිය, මනාප, ඉෂ්ට වූ රූප, ශබ්ද, ගන්ධ, රස, ස්පර්ශ, ධර්මයන් වෙත් නම්, හෝ යම් කෙනෙකුට හිතකාමී, අර්ථකාමී, සුවපහසුව කැමති, යෝගක්ෂේම කැමති මව, පියා, සහෝදරයා, සහෝදරිය, මිත්‍රයා, අමාත්‍යවරයා, නෑදෑ හිතමිතුරන් වෙත් නම්, ඔවුන් සමඟ ඇසුරු නොකිරීම, හමු නොවීම, එක්ව කටයුතු නොකිරීම, මිශ්‍ර නොවී සිටීම, භික්ෂූන් වහන්ස, මෙය ප්‍රියයන්ගෙන් වෙන්වීම දුක නම් වේ.",
      "paliTitle": ""
    },
    {
      "number": 398,
      "pali": "‘‘Katamañca, bhikkhave, yampicchaṃ na labhati tampi dukkhaṃ? Jātidhammānaṃ, bhikkhave, sattānaṃ evaṃ icchā uppajjati – ‘aho vata mayaṃ na jātidhammā assāma, na ca vata no jāti āgaccheyyā’ti. Na kho panetaṃ icchāya pattabbaṃ, idampi yampicchaṃ na labhati tampi dukkhaṃ. Jarādhammānaṃ, bhikkhave, sattānaṃ evaṃ icchā uppajjati – ‘aho vata mayaṃ na jarādhammā assāma, na ca vata no jarā āgaccheyyā’ti. Na kho panetaṃ icchāya pattabbaṃ, idampi yampicchaṃ na labhati tampi dukkhaṃ. Byādhidhammānaṃ, bhikkhave, sattānaṃ evaṃ icchā uppajjati ‘aho vata mayaṃ na byādhidhammā assāma, na ca vata no byādhi āgaccheyyā’ti. Na kho panetaṃ icchāya pattabbaṃ, idampi yampicchaṃ na labhati tampi dukkhaṃ. Maraṇadhammānaṃ, bhikkhave, sattānaṃ evaṃ icchā uppajjati ‘aho vata mayaṃ na maraṇadhammā assāma, na ca vata no maraṇaṃ āgaccheyyā’ti. Na kho panetaṃ icchāya pattabbaṃ, idampi yampicchaṃ na labhati tampi dukkhaṃ. Sokaparidevadukkhadomanassupāyāsadhammānaṃ, bhikkhave, sattānaṃ evaṃ icchā uppajjati ‘aho vata mayaṃ na sokaparidevadukkhadomanassupāyāsadhammā assāma, na ca vata no sokaparidevadukkhadomanassupāyāsadhammā āgaccheyyu’nti. Na kho panetaṃ icchāya pattabbaṃ, idampi yampicchaṃ na labhati tampi dukkhaṃ.",
      "english": "And what, monks, is suffering as 'not getting what one wants'? Monks, beings subject to birth have this desire: 'Oh, that we were not subject to birth, and that birth would not come to us!' But this is not attainable by wishing; this too is suffering as 'not getting what one wants'. Monks, beings subject to aging have this desire: 'Oh, that we were not subject to aging, and that aging would not come to us!' But this is not attainable by wishing; this too is suffering as 'not getting what one wants'. Monks, beings subject to illness have this desire: 'Oh, that we were not subject to illness, and that illness would not come to us!' But this is not attainable by wishing; this too is suffering as 'not getting what one wants'. Monks, beings subject to death have this desire: 'Oh, that we were not subject to death, and that death would not come to us!' But this is not attainable by wishing; this too is suffering as 'not getting what one wants'. Monks, beings subject to sorrow, lamentation, pain, displeasure, and despair have this desire: 'Oh, that we were not subject to sorrow, lamentation, pain, displeasure, and despair, and that sorrow, lamentation, pain, displeasure, and despair would not come to us!' But this is not attainable by wishing; this too is suffering as 'not getting what one wants'.",
      "sinhala": "මහණෙනි, කැමති දෙය නොලැබීම දුක වන්නේ කෙසේද? මහණෙනි, ජාතියට යටත් වූ සත්ත්වයන්ට මෙවැනි ආශාවක් ඇති වේ. ‘අහෝ, අපි ජාතියට යටත් නොවන්නට හැකි නම්! අපට නැවත ඉපදීමක් සිදු නොවන්නට හැකි නම්!’ යනුවෙනි. නමුත් ඒ ආශාවෙන් එය ලබාගත නොහැකිය. එබැවින් කැමති දෙය නොලැබීම දුකකි. මහණෙනි, ජරාවට යටත් වූ සත්ත්වයන්ට මෙවැනි ආශාවක් ඇති වේ. ‘අහෝ, අපි ජරාවට යටත් නොවන්නට හැකි නම්! අපට ජරාව පැමිණීමක් සිදු නොවන්නට හැකි නම්!’ යනුවෙනි. නමුත් ඒ ආශාවෙන් එය ලබාගත නොහැකිය. එබැවින් කැමති දෙය නොලැබීම දුකකි. මහණෙනි, ව්‍යාධියට යටත් වූ සත්ත්වයන්ට මෙවැනි ආශාවක් ඇති වේ. ‘අහෝ, අපි ව්‍යාධියට යටත් නොවන්නට හැකි නම්! අපට රෝගයක් වැළඳීමක් සිදු නොවන්නට හැකි නම්!’ යනුවෙනි. නමුත් ඒ ආශාවෙන් එය ලබාගත නොහැකිය. එබැවින් කැමති දෙය නොලැබීම දුකකි. මහණෙනි, මරණයට යටත් වූ සත්ත්වයන්ට මෙවැනි ආශාවක් ඇති වේ. ‘අහෝ, අපි මරණයට යටත් නොවන්නට හැකි නම්! අපට මරණය පැමිණීමක් සිදු නොවන්නට හැකි නම්!’ යනුවෙනි. නමුත් ඒ ආශාවෙන් එය ලබාගත නොහැකිය. එබැවින් කැමති දෙය නොලැබීම දුකකි. මහණෙනි, ශෝක, වැළපීම්, දුක්, දොම්නස්, සුසුම් හෙළීම්වලට යටත් වූ සත්ත්වයන්ට මෙවැනි ආශාවක් ඇති වේ. ‘අහෝ, අපි ශෝක, වැළපීම්, දුක්, දොම්නස්, සුසුම් හෙළීම්වලට යටත් නොවන්නට හැකි නම්! අපට ශෝක, වැළපීම්, දුක්, දොම්නස්, සුසුම් හෙළීම් ඇති නොවන්නට හැකි නම්!’ යනුවෙනි. නමුත් ඒ ආශාවෙන් එය ලබාගත නොහැකිය. එබැවින් කැමති දෙය නොලැබීම දුකකි.",
      "paliTitle": ""
    },
    {
      "number": 399,
      "pali": "‘‘Katame ca, bhikkhave, saṅkhittena pañcupādānakkhandhā dukkhā? Seyyathidaṃ – rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ime vuccanti, bhikkhave, saṅkhittena pañcupādānakkhandhā dukkhā. Idaṃ vuccati, bhikkhave, dukkhaṃ ariyasaccaṃ. ",
      "english": "Monks, what, in brief, are the five aggregates of clinging that are suffering? They are the aggregate of clinging to form, the aggregate of clinging to feeling, the aggregate of clinging to perception, the aggregate of clinging to mental formations, and the aggregate of clinging to consciousness. These, monks, are called the five aggregates of clinging that are suffering, in brief. This, monks, is called the noble truth of suffering.",
      "sinhala": "මහණෙනි, කෙටියෙන් දුක් සහිත පඤ්ච උපාදානස්කන්ධයෝ කවරහුද? එනම් රූප උපාදානස්කන්ධය, වේදනා උපාදානස්කන්ධය, සංඥා උපාදානස්කන්ධය, සංඛාර උපාදානස්කන්ධය, විඤ්ඤාණ උපාදානස්කන්ධය යන මේවාය. මහණෙනි, කෙටියෙන් දුක් සහිත පඤ්ච උපාදානස්කන්ධයෝ යැයි කියනු ලබන්නේ මේවාය. මහණෙනි, මෙය දුක්ඛ ආර්ය සත්‍යය යැයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 400,
      "pali": "‘‘Katamañca, bhikkhave, dukkhasamudayaṃ [dukkhasamudayo (syā.)] ariyasaccaṃ? Yāyaṃ taṇhā ponobbhavikā [ponobhavikā (sī. pī.)] nandīrāgasahagatā [nandirāgasahagatā (sī. syā. pī.)] tatratatrābhinandinī, seyyathidaṃ – kāmataṇhā bhavataṇhā vibhavataṇhā. ‘‘Sā kho panesā, bhikkhave, taṇhā kattha uppajjamānā uppajjati, kattha nivisamānā nivisati? Yaṃ loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Kiñca loke piyarūpaṃ sātarūpaṃ? Cakkhu loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. Sotaṃ loke…pe… ghānaṃ loke… jivhā loke… kāyo loke… mano loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Rūpā loke… saddā loke… gandhā loke… rasā loke… phoṭṭhabbā loke… dhammā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Cakkhuviññāṇaṃ loke… sotaviññāṇaṃ loke… ghānaviññāṇaṃ loke… jivhāviññāṇaṃ loke… kāyaviññāṇaṃ loke… manoviññāṇaṃ loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Cakkhusamphasso loke… sotasamphasso loke… ghānasamphasso loke… jivhāsamphasso loke… kāyasamphasso loke… manosamphasso loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Cakkhusamphassajā vedanā loke… sotasamphassajā vedanā loke… ghānasamphassajā vedanā loke… jivhāsamphassajā vedanā loke… kāyasamphassajā vedanā loke… manosamphassajā vedanā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Rūpasaññā loke… saddasaññā loke… gandhasaññā loke… rasasaññā loke… phoṭṭhabbasaññā loke… dhammasaññā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Rūpasañcetanā loke… saddasañcetanā loke… gandhasañcetanā loke… rasasañcetanā loke… phoṭṭhabbasañcetanā loke… dhammasañcetanā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Rūpataṇhā loke… saddataṇhā loke… gandhataṇhā loke… rasataṇhā loke… phoṭṭhabbataṇhā loke… dhammataṇhā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Rūpavitakko loke… saddavitakko loke… gandhavitakko loke… rasavitakko loke… phoṭṭhabbavitakko loke… dhammavitakko loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. ‘‘Rūpavicāro loke… saddavicāro loke… gandhavicāro loke… rasavicāro loke… phoṭṭhabbavicāro loke… dhammavicāro loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjati, ettha nivisamānā nivisati. Idaṃ vuccati, bhikkhave, dukkhasamudayaṃ ariyasaccaṃ. ",
      "english": "And what, mendicants, is the noble truth of the origin of suffering? It is this craving that leads to renewed existence, accompanied by delight and attachment, finding pleasure here and there; that is, craving for sensual pleasures, craving for existence, and craving for non-existence.\n\nBut where, mendicants, does this craving arise and settle? Wherever in the world there is what is pleasing and agreeable, there this craving arises and settles.\n\nAnd what in the world is pleasing and agreeable? The eye is pleasing and agreeable. There this craving arises and settles.\n\nThe ear is pleasing and agreeable. There this craving arises and settles.\n\nThe nose is pleasing and agreeable. There this craving arises and settles.\n\nThe tongue is pleasing and agreeable. There this craving arises and settles.\n\nThe body is pleasing and agreeable. There this craving arises and settles.\n\nThe mind is pleasing and agreeable. There this craving arises and settles.\n\nForms are pleasing and agreeable. There this craving arises and settles.\n\nSounds are pleasing and agreeable. There this craving arises and settles.\n\nSmells are pleasing and agreeable. There this craving arises and settles.\n\nTastes are pleasing and agreeable. There this craving arises and settles.\n\nTangible things are pleasing and agreeable. There this craving arises and settles.\n\nMental phenomena are pleasing and agreeable. There this craving arises and settles.\n\nEye-consciousness is pleasing and agreeable. There this craving arises and settles.\n\nEar-consciousness is pleasing and agreeable. There this craving arises and settles.\n\nNose-consciousness is pleasing and agreeable. There this craving arises and settles.\n\nTongue-consciousness is pleasing and agreeable. There this craving arises and settles.\n\nBody-consciousness is pleasing and agreeable. There this craving arises and settles.\n\nMind-consciousness is pleasing and agreeable. There this craving arises and settles.\n\nEye-contact is pleasing and agreeable. There this craving arises and settles.\n\nEar-contact is pleasing and agreeable. There this craving arises and settles.\n\nNose-contact is pleasing and agreeable. There this craving arises and settles.\n\nTongue-contact is pleasing and agreeable. There this craving arises and settles.\n\nBody-contact is pleasing and agreeable. There this craving arises and settles.\n\nMind-contact is pleasing and agreeable. There this craving arises and settles.\n\nFeeling born of eye-contact is pleasing and agreeable. There this craving arises and settles.\n\nFeeling born of ear-contact is pleasing and agreeable. There this craving arises and settles.\n\nFeeling born of nose-contact is pleasing and agreeable. There this craving arises and settles.\n\nFeeling born of tongue-contact is pleasing and agreeable. There this craving arises and settles.\n\nFeeling born of body-contact is pleasing and agreeable. There this craving arises and settles.\n\nFeeling born of mind-contact is pleasing and agreeable. There this craving arises and settles.\n\nPerception of forms is pleasing and agreeable. There this craving arises and settles.\n\nPerception of sounds is pleasing and agreeable. There this craving arises and settles.\n\nPerception of smells is pleasing and agreeable. There this craving arises and settles.\n\nPerception of tastes is pleasing and agreeable. There this craving arises and settles.\n\nPerception of tangible things is pleasing and agreeable. There this craving arises and settles.\n\nPerception of mental phenomena is pleasing and agreeable. There this craving arises and settles.\n\nVolition regarding forms is pleasing and agreeable. There this craving arises and settles.\n\nVolition regarding sounds is pleasing and agreeable. There this craving arises and settles.\n\nVolition regarding smells is pleasing and agreeable. There this craving arises and settles.\n\nVolition regarding tastes is pleasing and agreeable. There this craving arises and settles.\n\nVolition regarding tangible things is pleasing and agreeable. There this craving arises and settles.\n\nVolition regarding mental phenomena is pleasing and agreeable. There this craving arises and settles.\n\nCraving for forms is pleasing and agreeable. There this craving arises and settles.\n\nCraving for sounds is pleasing and agreeable. There this craving arises and settles.\n\nCraving for smells is pleasing and agreeable. There this craving arises and settles.\n\nCraving for tastes is pleasing and agreeable. There this craving arises and settles.\n\nCraving for tangible things is pleasing and agreeable. There this craving arises and settles.\n\nCraving for mental phenomena is pleasing and agreeable. There this craving arises and settles.\n\nInitial thought regarding forms is pleasing and agreeable. There this craving arises and settles.\n\nInitial thought regarding sounds is pleasing and agreeable. There this craving arises and settles.\n\nInitial thought regarding smells is pleasing and agreeable. There this craving arises and settles.\n\nInitial thought regarding tastes is pleasing and agreeable. There this craving arises and settles.\n\nInitial thought regarding tangible things is pleasing and agreeable. There this craving arises and settles.\n\nInitial thought regarding mental phenomena is pleasing and agreeable. There this craving arises and settles.\n\nSustained thought regarding forms is pleasing and agreeable. There this craving arises and settles.\n\nSustained thought regarding sounds is pleasing and agreeable. There this craving arises and settles.\n\nSustained thought regarding smells is pleasing and agreeable. There this craving arises and settles.\n\nSustained thought regarding tastes is pleasing and agreeable. There this craving arises and settles.\n\nSustained thought regarding tangible things is pleasing and agreeable. There this craving arises and settles.\n\nSustained thought regarding mental phenomena is pleasing and agreeable. There this craving arises and settles.\n\nThis, mendicants, is called the noble truth of the origin of suffering.",
      "sinhala": "මහණෙනි, දුක්ඛ සමුදය ආර්ය සත්‍යය යනු කුමක් ද? පුනර්භවය ඇති කරන, ඇලීම හා තෘෂ්ණාවෙන් යුක්ත වූ, ඒ ඒ අරමුණෙහි ඇලී ගැලී සිටින යම් තෘෂ්ණාවක් වේ ද, එනම් කාම තෘෂ්ණාව, භව තෘෂ්ණාව, විභව තෘෂ්ණාව යි.\n\nමහණෙනි, මේ තෘෂ්ණාව උපදින්නේ කොහි ද? නැවතී සිටින්නේ කොහි ද? ලෝකයෙහි යම් ප්‍රිය හා සුවදායක රූපයක් වේ ද, මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nලෝකයෙහි ප්‍රිය හා සුවදායක රූපය කුමක් ද? ඇස ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී. කණ ලෝකයෙහි... නාසය ලෝකයෙහි... දිව ලෝකයෙහි... ශරීරය ලෝකයෙහි... මනස ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nරූප ලෝකයෙහි... ශබ්ද ලෝකයෙහි... ගන්ධ ලෝකයෙහි... රස ලෝකයෙහි... ස්පර්ශ ලෝකයෙහි... ධර්ම ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nචක්ඛු විඤ්ඤාණය ලෝකයෙහි... සෝත විඤ්ඤාණය ලෝකයෙහි... ඝාන විඤ්ඤාණය ලෝකයෙහි... ජිව්හා විඤ්ඤාණය ලෝකයෙහි... කාය විඤ්ඤාණය ලෝකයෙහි... මනෝ විඤ්ඤාණය ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nචක්ඛු සම්ඵස්සය ලෝකයෙහි... සෝත සම්ඵස්සය ලෝකයෙහි... ඝාන සම්ඵස්සය ලෝකයෙහි... ජිව්හා සම්ඵස්සය ලෝකයෙහි... කාය සම්ඵස්සය ලෝකයෙහි... මනෝ සම්ඵස්සය ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nචක්ඛු සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... සෝත සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... ඝාන සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... ජිව්හා සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... කාය සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... මනෝ සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nරූප සංඥාව ලෝකයෙහි... ශබ්ද සංඥාව ලෝකයෙහි... ගන්ධ සංඥාව ලෝකයෙහි... රස සංඥාව ලෝකයෙහි... ස්පර්ශ සංඥාව ලෝකයෙහි... ධර්ම සංඥාව ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nරූප සංචේතනාව ලෝකයෙහි... ශබ්ද සංචේතනාව ලෝකයෙහි... ගන්ධ සංචේතනාව ලෝකයෙහි... රස සංචේතනාව ලෝකයෙහි... ස්පර්ශ සංචේතනාව ලෝකයෙහි... ධර්ම සංචේතනාව ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nරූප තෘෂ්ණාව ලෝකයෙහි... ශබ්ද තෘෂ්ණාව ලෝකයෙහි... ගන්ධ තෘෂ්ණාව ලෝකයෙහි... රස තෘෂ්ණාව ලෝකයෙහි... ස්පර්ශ තෘෂ්ණාව ලෝකයෙහි... ධර්ම තෘෂ්ණාව ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nරූප විතර්කය ලෝකයෙහි... ශබ්ද විතර්කය ලෝකයෙහි... ගන්ධ විතර්කය ලෝකයෙහි... රස විතර්කය ලෝකයෙහි... ස්පර්ශ විතර්කය ලෝකයෙහි... ධර්ම විතර්කය ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nරූප විචාරය ලෝකයෙහි... ශබ්ද විචාරය ලෝකයෙහි... ගන්ධ විචාරය ලෝකයෙහි... රස විචාරය ලෝකයෙහි... ස්පර්ශ විචාරය ලෝකයෙහි... ධර්ම විචාරය ලෝකයෙහි ප්‍රිය හා සුවදායක ය. මේ තෘෂ්ණාව උපදින විට එහි උපදී. නැවතී සිටින විට එහි නැවතී සිටී.\n\nමහණෙනි, මෙය දුක්ඛ සමුදය ආර්ය සත්‍යය යැයි කියනු ලැබේ.",
      "paliTitle": "Samudayasaccaniddeso",
      "englishTitle": "Explanation of the Truth of Origin",
      "sinhalaTitle": "සමුදයසච්චනිද්දේසය"
    },
    {
      "number": 401,
      "pali": "‘‘Katamañca, bhikkhave, dukkhanirodhaṃ [dukkhanirodho (syā.)] ariyasaccaṃ? Yo tassāyeva taṇhāya asesavirāganirodho cāgo paṭinissaggo mutti anālayo. ‘‘Sā kho panesā, bhikkhave, taṇhā kattha pahīyamānā pahīyati, kattha nirujjhamānā nirujjhati? Yaṃ loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Kiñca loke piyarūpaṃ sātarūpaṃ? Cakkhu loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. Sotaṃ loke…pe… ghānaṃ loke… jivhā loke… kāyo loke… mano loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Rūpā loke… saddā loke… gandhā loke… rasā loke… phoṭṭhabbā loke… dhammā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Cakkhuviññāṇaṃ loke… sotaviññāṇaṃ loke… ghānaviññāṇaṃ loke… jivhāviññāṇaṃ loke… kāyaviññāṇaṃ loke… manoviññāṇaṃ loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Cakkhusamphasso loke… sotasamphasso loke… ghānasamphasso loke… jivhāsamphasso loke… kāyasamphasso loke… manosamphasso loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Cakkhusamphassajā vedanā loke… sotasamphassajā vedanā loke … ghānasamphassajā vedanā loke… jivhāsamphassajā vedanā loke… kāyasamphassajā vedanā loke… manosamphassajā vedanā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Rūpasaññā loke… saddasaññā loke… gandhasaññā loke… rasasaññā loke… phoṭṭhabbasaññā loke… dhammasaññā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Rūpasañcetanā loke… saddasañcetanā loke… gandhasañcetanā loke… rasasañcetanā loke… phoṭṭhabbasañcetanā loke… dhammasañcetanā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Rūpataṇhā loke… saddataṇhā loke… gandhataṇhā loke… rasataṇhā loke… phoṭṭhabbataṇhā loke… dhammataṇhā loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Rūpavitakko loke… saddavitakko loke… gandhavitakko loke… rasavitakko loke… phoṭṭhabbavitakko loke… dhammavitakko loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. ‘‘Rūpavicāro loke… saddavicāro loke… gandhavicāro loke… rasavicāro loke… phoṭṭhabbavicāro loke… dhammavicāro loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā pahīyamānā pahīyati, ettha nirujjhamānā nirujjhati. Idaṃ vuccati, bhikkhave, dukkhanirodhaṃ ariyasaccaṃ. ",
      "english": "And what, monks, is the noble truth of the cessation of suffering? It is the complete fading away and cessation of that very craving: relinquishing it, giving it up, being released from it, and non-attachment to it.\n\nBut where, monks, is this craving abandoned when it is being abandoned? Where does it cease when it is ceasing? Wherever in the world there is what is beloved and agreeable, there this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nAnd what in the world is beloved and agreeable? The eye, the ear, the nose, the tongue, the body, and the mind in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nForms, sounds, smells, tastes, tactile objects, and mental phenomena in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nEye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, and mind-consciousness in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nEye-contact, ear-contact, nose-contact, tongue-contact, body-contact, and mind-contact in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nFeeling born of eye-contact, feeling born of ear-contact, feeling born of nose-contact, feeling born of tongue-contact, feeling born of body-contact, and feeling born of mind-contact in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nPerception of forms, perception of sounds, perception of smells, perception of tastes, perception of tactile objects, and perception of mental phenomena in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nVolition regarding forms, volition regarding sounds, volition regarding smells, volition regarding tastes, volition regarding tactile objects, and volition regarding mental phenomena in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nCraving for forms, craving for sounds, craving for smells, craving for tastes, craving for tactile objects, and craving for mental phenomena in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nInitial thought about forms, initial thought about sounds, initial thought about smells, initial thought about tastes, initial thought about tactile objects, and initial thought about mental phenomena in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nSustained thought about forms, sustained thought about sounds, sustained thought about smells, sustained thought about tastes, sustained thought about tactile objects, and sustained thought about mental phenomena in the world are beloved and agreeable. There this craving is abandoned when it is being abandoned; there it ceases when it is ceasing.\n\nThis, monks, is called the noble truth of the cessation of suffering.",
      "sinhala": "මහණෙනි, දුක්ඛ නිරෝධය නම් ආර්ය සත්‍යය කවරේද? එය යම් තෘෂ්ණාවක් ඇත්ද, එය මුළුමනින්ම නැති කිරීමෙන්, දුරු කිරීමෙන්, අත්හැරීමෙන්, මිදීමෙන් හා ඇල්ම නැති කිරීමෙන් සිදුවේ.\n\nමහණෙනි, මේ තෘෂ්ණාව දුරු කරනු ලබන්නේ කොහිද? නිරුද්ධ කරනු ලබන්නේ කොහිද? ලෝකයෙහි යම් දෙයක් ප්‍රියජනක හා සතුටුදායක වේද, එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nලෝකයෙහි ප්‍රියජනක හා සතුටුදායක දේ කවරේද? ඇස ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි. කණ ලෝකයෙහි... නාසය ලෝකයෙහි... දිව ලෝකයෙහි... කය ලෝකයෙහි... මනස ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nරූප ලෝකයෙහි... ශබ්ද ලෝකයෙහි... ගන්ධ ලෝකයෙහි... රස ලෝකයෙහි... ස්පර්ශ ලෝකයෙහි... ධර්ම ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nචක්ඛු විඤ්ඤාණය ලෝකයෙහි... සෝත විඤ්ඤාණය ලෝකයෙහි... ඝාණ විඤ්ඤාණය ලෝකයෙහි... ජිව්හා විඤ්ඤාණය ලෝකයෙහි... කාය විඤ්ඤාණය ලෝකයෙහි... මනෝ විඤ්ඤාණය ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nචක්ඛු සම්ඵස්සය ලෝකයෙහි... සෝත සම්ඵස්සය ලෝකයෙහි... ඝාණ සම්ඵස්සය ලෝකයෙහි... ජිව්හා සම්ඵස්සය ලෝකයෙහි... කාය සම්ඵස්සය ලෝකයෙහි... මනෝ සම්ඵස්සය ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nචක්ඛු සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... සෝත සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... ඝාණ සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... ජිව්හා සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... කාය සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි... මනෝ සම්ඵස්සයෙන් හටගන්නා වේදනාව ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nරූප සංඥාව ලෝකයෙහි... ශබ්ද සංඥාව ලෝකයෙහි... ගන්ධ සංඥාව ලෝකයෙහි... රස සංඥාව ලෝකයෙහි... ස්පර්ශ සංඥාව ලෝකයෙහි... ධම්ම සංඥාව ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nරූප සංචේතනාව ලෝකයෙහි... ශබ්ද සංචේතනාව ලෝකයෙහි... ගන්ධ සංචේතනාව ලෝකයෙහි... රස සංචේතනාව ලෝකයෙහි... ස්පර්ශ සංචේතනාව ලෝකයෙහි... ධම්ම සංචේතනාව ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nරූප තෘෂ්ණාව ලෝකයෙහි... ශබ්ද තෘෂ්ණාව ලෝකයෙහි... ගන්ධ තෘෂ්ණාව ලෝකයෙහි... රස තෘෂ්ණාව ලෝකයෙහි... ස්පර්ශ තෘෂ්ණාව ලෝකයෙහි... ධම්ම තෘෂ්ණාව ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nරූප විතර්කය ලෝකයෙහි... ශබ්ද විතර්කය ලෝකයෙහි... ගන්ධ විතර්කය ලෝකයෙහි... රස විතර්කය ලෝකයෙහි... ස්පර්ශ විතර්කය ලෝකයෙහි... ධම්ම විතර්කය ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nරූප විචාරය ලෝකයෙහි... ශබ්ද විචාරය ලෝකයෙහි... ගන්ධ විචාරය ලෝකයෙහි... රස විචාරය ලෝකයෙහි... ස්පර්ශ විචාරය ලෝකයෙහි... ධම්ම විචාරය ලෝකයෙහි ප්‍රියජනක හා සතුටුදායකය. එහිදී මේ තෘෂ්ණාව දුරු කරනු ලබයි, එහිදී නිරුද්ධ කරනු ලබයි.\n\nමහණෙනි, මෙය දුක්ඛ නිරෝධය නම් ආර්ය සත්‍යය යැයි කියනු ලැබේ.",
      "paliTitle": "Nirodhasaccaniddeso",
      "englishTitle": "Explanation of the Truth of Cessation",
      "sinhalaTitle": "නිරෝධ සත්‍ය නිද්දෙසය"
    },
    {
      "number": 402,
      "pali": "‘‘Katamañca, bhikkhave, dukkhanirodhagāminī paṭipadā ariyasaccaṃ? Ayameva ariyo aṭṭhaṅgiko maggo seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. ‘‘Katamā ca, bhikkhave, sammādiṭṭhi? Yaṃ kho, bhikkhave, dukkhe ñāṇaṃ, dukkhasamudaye ñāṇaṃ, dukkhanirodhe ñāṇaṃ, dukkhanirodhagāminiyā paṭipadāya ñāṇaṃ, ayaṃ vuccati, bhikkhave, sammādiṭṭhi. ‘‘Katamo ca, bhikkhave, sammāsaṅkappo? Nekkhammasaṅkappo abyāpādasaṅkappo avihiṃsāsaṅkappo, ayaṃ vuccati bhikkhave, sammāsaṅkappo. ‘‘Katamā ca, bhikkhave, sammāvācā? Musāvādā veramaṇī [veramaṇi (ka.)] pisuṇāya vācāya veramaṇī pharusāya vācāya veramaṇī samphappalāpā veramaṇī, ayaṃ vuccati, bhikkhave, sammāvācā. ‘‘Katamo ca, bhikkhave, sammākammanto? Pāṇātipātā veramaṇī adinnādānā veramaṇī kāmesumicchācārā veramaṇī, ayaṃ vuccati, bhikkhave, sammākammanto. ‘‘Katamo ca, bhikkhave, sammāājīvo? Idha, bhikkhave, ariyasāvako micchāājīvaṃ pahāya sammāājīvena jīvitaṃ kappeti, ayaṃ vuccati, bhikkhave, sammāājīvo. ‘‘Katamo ca, bhikkhave, sammāvāyāmo? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ayaṃ vuccati, bhikkhave, sammāvāyāmo. ‘‘Katamā ca, bhikkhave, sammāsati? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu vedanānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; citte cittānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Ayaṃ vuccati, bhikkhave, sammāsati. ‘‘Katamo ca, bhikkhave, sammāsamādhi? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati, sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, sammāsamādhi. Idaṃ vuccati, bhikkhave, dukkhanirodhagāminī paṭipadā ariyasaccaṃ.",
      "english": "And what, monks, is the Noble Truth of the path leading to the cessation of suffering? It is precisely this Noble Eightfold Path: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, and Right Concentration.\n\nAnd what, monks, is Right View? It is, monks, the knowledge of suffering, the knowledge of the origin of suffering, the knowledge of the cessation of suffering, and the knowledge of the path leading to the cessation of suffering. This, monks, is called Right View.\n\nAnd what, monks, is Right Intention? It is the intention of renunciation, the intention of goodwill, and the intention of harmlessness. This, monks, is called Right Intention.\n\nAnd what, monks, is Right Speech? It is abstaining from false speech, abstaining from divisive speech, abstaining from harsh speech, and abstaining from idle chatter. This, monks, is called Right Speech.\n\nAnd what, monks, is Right Action? It is abstaining from killing, abstaining from taking what is not given, and abstaining from sexual misconduct. This, monks, is called Right Action.\n\nAnd what, monks, is Right Livelihood? Here, monks, a noble disciple abandons wrong livelihood and maintains life by Right Livelihood. This, monks, is called Right Livelihood.\n\nAnd what, monks, is Right Effort? Here, monks, a monk generates zeal, endeavors, arouses energy, strengthens his mind, and strives to prevent the arising of unarisen evil and unwholesome states. He generates zeal, endeavors, arouses energy, strengthens his mind, and strives to abandon arisen evil and unwholesome states. He generates zeal, endeavors, arouses energy, strengthens his mind, and strives to generate unarisen wholesome states. He generates zeal, endeavors, arouses energy, strengthens his mind, and strives to maintain, not to decay, to increase, to proliferate, to develop, and to perfect arisen wholesome states. This, monks, is called Right Effort.\n\nAnd what, monks, is Right Mindfulness? Here, monks, a monk dwells contemplating the body as body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure in regard to the world. He dwells contemplating feelings as feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure in regard to the world. He dwells contemplating mind as mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure in regard to the world. He dwells contemplating mental phenomena as mental phenomena, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure in regard to the world. This, monks, is called Right Mindfulness.\n\nAnd what, monks, is Right Concentration? Here, monks, secluded from sensual pleasures, secluded from unwholesome states, a monk enters and remains in the first jhana, which is accompanied by thought and examination, born of seclusion, and filled with rapture and pleasure. With the stilling of thought and examination, he enters and remains in the second jhana, which has internal tranquility and unification of mind, without thought and examination, born of concentration, and filled with rapture and pleasure. With the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body. This is what the Noble Ones call: ‘Dwelling in equanimity, mindful, and at ease.’ Thus, he enters and remains in the third jhana. With the abandoning of pleasure and pain, and with the previous disappearance of joy and sorrow, he enters and remains in the fourth jhana, which is neither painful nor pleasant, and purified by equanimity and mindfulness. This, monks, is called Right Concentration. This, monks, is called the Noble Truth of the path leading to the cessation of suffering.",
      "sinhala": "භික්ෂූනි, දුක්ඛ නිරෝධයට පමුණුවන මාර්ගය වන ආර්ය සත්‍යය කුමක්ද? එනම්, සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යන ආර්ය අෂ්ටාංගික මාර්ගයයි.\n\nභික්ෂූනි, සම්මා දිට්ඨිය යනු කුමක්ද? භික්ෂූනි, දුක පිළිබඳ ඥානය, දුක හටගැනීම පිළිබඳ ඥානය, දුක නැති කිරීම පිළිබඳ ඥානය, දුක නැති කිරීමේ මාර්ගය පිළිබඳ ඥානයයි. භික්ෂූනි, මෙය සම්මා දිට්ඨිය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම්මා සංකප්ප යනු කුමක්ද? නෛෂ්ක්‍රම්‍ය සංකල්පය, අව්‍යාපාද සංකල්පය, අවිහිංසා සංකල්පයයි. භික්ෂූනි, මෙය සම්මා සංකප්ප යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම්මා වාචාව යනු කුමක්ද? බොරු කීමෙන් වැළකීම, කේලාම් කීමෙන් වැළකීම, රළු වචන කීමෙන් වැළකීම, හිස් වචන කීමෙන් වැළකීමයි. භික්ෂූනි, මෙය සම්මා වාචාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම්මා කම්මන්තය යනු කුමක්ද? ප්‍රාණඝාතයෙන් වැළකීම, සොරකම් කිරීමෙන් වැළකීම, කාමයේ වරදවා හැසිරීමෙන් වැළකීමයි. භික්ෂූනි, මෙය සම්මා කම්මන්තය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම්මා ආජීවය යනු කුමක්ද? භික්ෂූනි, මෙහි ආර්ය ශ්‍රාවකයා මිථ්‍යා ආජීවය අත්හැර, සම්මා ආජීවයෙන් ජීවිකාව ගෙන යයි. භික්ෂූනි, මෙය සම්මා ආජීවය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම්මා වායාමය යනු කුමක්ද? භික්ෂූනි, මෙහි භික්ෂුව නූපන් පව්කාර අකුසල ධර්මයන් නූපදවීමට කැමැත්ත ඇති කරයි, උත්සාහ කරයි, වීර්යය වඩයි, සිත දිරිමත් කරයි, වෙහෙසෙයි. උපන් පව්කාර අකුසල ධර්මයන් දුරු කිරීමට කැමැත්ත ඇති කරයි, උත්සාහ කරයි, වීර්යය වඩයි, සිත දිරිමත් කරයි, වෙහෙසෙයි. නූපන් කුසල ධර්මයන් ඉපදවීමට කැමැත්ත ඇති කරයි, උත්සාහ කරයි, වීර්යය වඩයි, සිත දිරිමත් කරයි, වෙහෙසෙයි. උපන් කුසල ධර්මයන් පවත්වා ගැනීමට, අමතක නොකිරීමට, වඩා දියුණු කිරීමට, වර්ධනය කිරීමට, පරිපූර්ණ කිරීමට කැමැත්ත ඇති කරයි, උත්සාහ කරයි, වීර්යය වඩයි, සිත දිරිමත් කරයි, වෙහෙසෙයි. භික්ෂූනි, මෙය සම්මා වායාමය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම්මා සතිය යනු කුමක්ද? භික්ෂූනි, මෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුක්තව, හොඳ සිහියෙන් හා නුවණින් යුක්තව, ලෝකය කෙරෙහි ඇති ආශාව හා ද්වේෂය දුරු කරමින් කයෙහි කය අනුව බලමින් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුක්තව, හොඳ සිහියෙන් හා නුවණින් යුක්තව, ලෝකය කෙරෙහි ඇති ආශාව හා ද්වේෂය දුරු කරමින් වේදනාවන්හි වේදනාවන් අනුව බලමින් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුක්තව, හොඳ සිහියෙන් හා නුවණින් යුක්තව, ලෝකය කෙරෙහි ඇති ආශාව හා ද්වේෂය දුරු කරමින් සිතෙහි සිත අනුව බලමින් වාසය කරයි. කෙලෙස් තවන වීර්යයෙන් යුක්තව, හොඳ සිහියෙන් හා නුවණින් යුක්තව, ලෝකය කෙරෙහි ඇති ආශාව හා ද්වේෂය දුරු කරමින් ධර්මයන්හි ධර්මයන් අනුව බලමින් වාසය කරයි. භික්ෂූනි, මෙය සම්මා සතිය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම්මා සමාධිය යනු කුමක්ද? භික්ෂූනි, මෙහි භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සුවය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක හා විචාරයන් සංසිඳීම නිසා සිත තුළ පැහැදීම ඇතිව, සිතේ එකඟ බව ඇතිව, විතර්ක රහිතව, විචාර රහිතව, සමාධියෙන් හටගත් ප්‍රීතිය හා සුවය ඇති දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතිය කෙරෙහි ඇති ඇල්ම දුරු කිරීමෙන් උපේක්ෂාවෙන් යුක්තව වාසය කරයි, සිහියෙන් හා නුවණින් යුක්තව කයින් සුවය විඳියි. ආර්යයන් වහන්සේලා යම් ධ්‍යානයක් \"උපේක්ෂාවෙන් යුක්තය, සිහියෙන් යුක්තය, සැප විහරණයෙන් යුක්තය\" යැයි පවසත්ද, එවන් තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. සුවය දුරු කිරීමෙන්ද, දුක දුරු කිරීමෙන්ද, පෙර පැවති සතුටු හා අසතුටු ස්වභාවයන් නැති කිරීමෙන්ද, දුකක්ද නොවූ සුවයක්ද නොවූ, උපේක්ෂාව හා සිහිය පිරිසිදු වූ සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. භික්ෂූනි, මෙය සම්මා සමාධිය යැයි කියනු ලැබේ. භික්ෂූනි, මෙය දුක්ඛ නිරෝධයට පමුණුවන මාර්ගය වන ආර්ය සත්‍යය යැයි කියනු ලැබේ.",
      "paliTitle": "Maggasaccaniddeso",
      "englishTitle": "Explanation of the Truth of the Path",
      "sinhalaTitle": "මාර්ග සත්‍ය නිද්දේසය"
    },
    {
      "number": 403,
      "pali": "‘‘Iti ajjhattaṃ vā dhammesu dhammānupassī viharati, bahiddhā vā dhammesu dhammānupassī viharati, ajjhattabahiddhā vā dhammesu dhammānupassī viharati. Samudayadhammānupassī vā dhammesu viharati, vayadhammānupassī vā dhammesu viharati, samudayavayadhammānupassī vā dhammesu viharati. ‘Atthi dhammā’ti vā panassa sati paccupaṭṭhitā hoti yāvadeva ñāṇamattāya paṭissatimattāya anissito ca viharati, na ca kiñci loke upādiyati. Evampi kho, bhikkhave, bhikkhu dhammesu dhammānupassī viharati catūsu ariyasaccesu. Saccapabbaṃ niṭṭhitaṃ. Dhammānupassanā niṭṭhitā.",
      "english": "Thus, one dwells contemplating phenomena in phenomena internally, or externally, or both internally and externally. One dwells contemplating phenomena as arising, or as vanishing, or as arising and vanishing. Or else, mindfulness that \"there are phenomena\" is simply established in him to the extent necessary for knowledge and continued mindfulness. And one dwells independent, clinging to nothing in the world. In this way, monks, a monk dwells contemplating phenomena in phenomena, with regard to the Four Noble Truths. The section on the Truths is complete. The contemplation of phenomena is complete.",
      "sinhala": "මෙලෙස ඔහු තමා තුළ ධර්මයන්ගේ ධර්මානුපස්සනාවෙහි යෙදී වාසය කරයි. එසේම, ඔහු බාහිර ධර්මයන්ගේ ධර්මානුපස්සනාවෙහි යෙදී වාසය කරයි. තවද, ඔහු තමා තුළ මෙන්ම බාහිර ධර්මයන්ගේද ධර්මානුපස්සනාවෙහි යෙදී වාසය කරයි.\n\nඔහු ධර්මයන්ගේ හටගැනීම (සමුදය) අනුපිළිවෙළින් දකිමින් වාසය කරයි. නැතහොත් ධර්මයන්ගේ නැතිවීම (වය) අනුපිළිවෙළින් දකිමින් වාසය කරයි. එසේත් නැතහොත් ධර්මයන්ගේ හටගැනීම හා නැතිවීම යන දෙකම අනුපිළිවෙළින් දකිමින් වාසය කරයි.\n\n'ධර්මයන් පවතී' යන සිහිය දැනුම පිණිස මෙන්ම සිහිකිරීම පිණිස පමණක් ඔහුට පිහිටා ඇත. ඔහු ලෝකයේ කිසිම දෙයකට නොඇලී වාසය කරයි, කිසිවක් උපාදානය කර නොගනී.\n\nමහණෙනි, මේ ආකාරයට භික්ෂුව සතර ආර්ය සත්‍යයන්හි ධර්මයන්ගේ ධර්මානුපස්සනාවෙහි යෙදී වාසය කරයි.\n\nසත්‍ය පබ්බය නිමා විය. ධර්මානුපස්සනාව නිමා විය.",
      "paliTitle": ""
    },
    {
      "number": 404,
      "pali": "‘‘Yo hi koci, bhikkhave, ime cattāro satipaṭṭhāne evaṃ bhāveyya sattavassāni, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ diṭṭheva dhamme aññā; sati vā upādisese anāgāmitā. ‘‘Tiṭṭhantu, bhikkhave, sattavassāni. Yo hi koci, bhikkhave, ime cattāro satipaṭṭhāne evaṃ bhāveyya cha vassāni…pe… pañca vassāni… cattāri vassāni… tīṇi vassāni… dve vassāni… ekaṃ vassaṃ… tiṭṭhatu, bhikkhave, ekaṃ vassaṃ. Yo hi koci, bhikkhave, ime cattāro satipaṭṭhāne evaṃ bhāveyya sattamāsāni, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ diṭṭheva dhamme aññā; sati vā upādisese anāgāmitā. ‘‘Tiṭṭhantu, bhikkhave, satta māsāni. Yo hi koci, bhikkhave, ime cattāro satipaṭṭhāne evaṃ bhāveyya cha māsāni…pe… pañca māsāni… cattāri māsāni… tīṇi māsāni … dve māsāni… ekaṃ māsaṃ… aḍḍhamāsaṃ… tiṭṭhatu, bhikkhave, aḍḍhamāso. Yo hi koci, bhikkhave, ime cattāro satipaṭṭhāne evaṃ bhāveyya sattāhaṃ, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ diṭṭheva dhamme aññā; sati vā upādisese anāgāmitāti.",
      "english": "Monks, if anyone would cultivate these four foundations of mindfulness in this way for seven years, one of two results can be expected: either direct knowledge in this very life, or, if there is any remaining clinging, the state of non-returning.\n\nLet alone seven years, monks. If anyone would cultivate these four foundations of mindfulness in this way for six years… for five years… for four years… for three years… for two years… for one year… let alone one year, monks. If anyone would cultivate these four foundations of mindfulness in this way for seven months, one of two results can be expected: either direct knowledge in this very life, or, if there is any remaining clinging, the state of non-returning.\n\nLet alone seven months, monks. If anyone would cultivate these four foundations of mindfulness in this way for six months… for five months… for four months… for three months… for two months… for one month… for half a month… let alone half a month, monks. If anyone would cultivate these four foundations of mindfulness in this way for seven days, one of two results can be expected: either direct knowledge in this very life, or, if there is any remaining clinging, the state of non-returning.",
      "sinhala": "“මහණෙනි, යම් කිසිවෙක් මේ සතර සතිපට්ඨානයන් මෙසේ සත් වසරක් පුරුදු කරන්නේ නම්, ඔහුට ප්‍රතිඵල දෙකෙන් එකක් අපේක්ෂා කළ හැකිය. එනම්, මේ ජීවිතයේදීම රහත් ඵලය හෝ උපාදාන ඉතිරිව තිබේ නම් අනාගාමී ඵලයයි. මහණෙනි, සත් වසරක් පසෙක තබමු! යම් කිසිවෙක් මේ සතර සතිපට්ඨානයන් මෙසේ හය වසරක්... පහ වසරක්... සිව් වසරක්... තුන් වසරක්... දෙ වසරක්... එක් වසරක් පුරුදු කරන්නේ නම්... මහණෙනි, එක් වසරක් පසෙක තබමු! යම් කිසිවෙක් මේ සතර සතිපට්ඨානයන් මෙසේ සත් මසක් පුරුදු කරන්නේ නම්, ඔහුට ප්‍රතිඵල දෙකෙන් එකක් අපේක්ෂා කළ හැකිය. එනම්, මේ ජීවිතයේදීම රහත් ඵලය හෝ උපාදාන ඉතිරිව තිබේ නම් අනාගාමී ඵලයයි. මහණෙනි, සත් මසක් පසෙක තබමු! යම් කිසිවෙක් මේ සතර සතිපට්ඨානයන් මෙසේ හය මසක්... පහ මසක්... සිව් මසක්... තුන් මසක්... දෙ මසක්... එක් මසක්... අඩ මසක් පුරුදු කරන්නේ නම්... මහණෙනි, අඩ මසක් පසෙක තබමු! යම් කිසිවෙක් මේ සතර සතිපට්ඨානයන් මෙසේ සත් දවසක් පුරුදු කරන්නේ නම්, ඔහුට ප්‍රතිඵල දෙකෙන් එකක් අපේක්ෂා කළ හැකිය. එනම්, මේ ජීවිතයේදීම රහත් ඵලය හෝ උපාදාන ඉතිරිව තිබේ නම් අනාගාමී ඵලයයි.”",
      "paliTitle": ""
    },
    {
      "number": 405,
      "pali": "‘‘Ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya yadidaṃ cattāro satipaṭṭhānāti. Iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. ",
      "english": "Bhikkhus, this is the direct path for the purification of beings, for transcending sorrow and lamentation, for the cessation of pain and distress, for attaining the right method, and for realizing Nibbana: that is, the four foundations of mindfulness. Thus, what was said was said in reference to this.\"\n\nThe Blessed One spoke thus. The bhikkhus, delighted, rejoiced in the Blessed One's words.",
      "sinhala": "මහණෙනි, සත්වයන්ගේ පිරිසිදුභාවය පිණිසත්, ශෝක වැළපීම් දුරු කිරීම පිණිසත්, දුක් දොම්නස් නැති කිරීම පිණිසත්, ඥානය අවබෝධ කර ගැනීම පිණිසත්, නිවන සාක්ෂාත් කිරීම පිණිසත් ඇති එකම මාර්ගය නම් සතර සතිපට්ඨානයන් ය. යම් දෙයක් පවසන ලද්දේ ද, එය මෙම කරුණ හේතුවෙන් පවසන ලදී. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ දේශනය සතුටින් පිළිගත්තාහු ය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahāsatipaṭṭhānasuttaṃ niṭṭhitaṃ navamaṃ.",
    "english": "The Great Frames of Reference Discourse: The Ninth is Finished.",
    "sinhala": "මහා සතිපට්ඨාන සූත්‍රය නිමි. නවවෙනි."
  }
}