{
  "id": "dn17",
  "title": {
    "pali": "Mahāsudassanasuttaṃ",
    "english": "The Great Sudassana Discourse",
    "sinhala": "මහාසුදස්සන සූත්‍රය"
  },
  "sections": [
    {
      "number": 241,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kusinārāyaṃ viharati upavattane mallānaṃ sālavane antarena yamakasālānaṃ parinibbānasamaye. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘mā, bhante, bhagavā imasmiṃ khuddakanagarake ujjaṅgalanagarake sākhānagarake parinibbāyi. Santi, bhante, aññāni mahānagarāni. Seyyathidaṃ – campā, rājagahaṃ, sāvatthi, sāketaṃ, kosambī, bārāṇasī; ettha bhagavā parinibbāyatu. Ettha bahū khattiyamahāsālā brāhmaṇamahāsālā gahapatimahāsālā tathāgate abhippasannā, te tathāgatassa sarīrapūjaṃ karissantī’’ti.",
      "english": "Thus I have heard: At one time the Blessed One was staying in Kusinārā, in the Upavattana Sāla Grove of the Mallas, between the twin sāla trees, at the time of his final passing.\n\nThen the Venerable Ānanda approached the Blessed One, and after paying homage, sat down to one side. Seated to one side, the Venerable Ānanda said to the Blessed One: \"Venerable Sir, please do not attain final Nibbāna in this small, insignificant, backwater town. There are, Venerable Sir, other great cities, such as Campā, Rājagaha, Sāvatthī, Sāketa, Kosambī, and Bārāṇasī. Let the Blessed One attain final Nibbāna there. In those cities, many wealthy nobles, brahmins, and householders are devoted to the Tathāgata, and they will perform the proper rites for the Tathāgata's remains.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. භාග්‍යවතුන් වහන්සේ එක් කලෙක කුසිනාරා නුවර මල්ලවරුන්ගේ උපවත්තන සල් උයනේ, යමක සල් ගස් අතර පිරිනිවන් පාන මොහොතේ වැඩ වාසය කළ සේක.\n\nඑවිට ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, උන්වහන්සේට වන්දනා කොට එකත්පසෙකින් හිඳ ගත්හ. එකත්පසෙකින් හිඳගත් ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ කීහ:\n\n“ස්වාමීනී, භාග්‍යවතුන් වහන්සේ මෙවන් කුඩා, පාළු, අගනුවරක් නොවන නගරයක පිරිනිවන් පෑමට සුදුසු නොවේ. ස්වාමීනී, චම්පා, රජගහ, සැවැත්, සාකේත, කෝසම්බි, බරණැස් වැනි මහත් නගර බොහෝ ඇත. භාග්‍යවතුන් වහන්සේ එහි පිරිනිවන් පා වදාළ මැනව. එහි ක්ෂත්‍රිය, බ්‍රාහ්මණ, ගෘහපති යන මහාසාලවරු බොහෝ දෙනෙක් තථාගතයන් වහන්සේ කෙරෙහි බලවත් සේ පැහැදී සිටිති. ඔවුහු තථාගතයන් වහන්සේගේ ශරීර පූජාව පවත්වනු ඇත.”",
      "paliTitle": ""
    },
    {
      "number": 242,
      "pali": "‘‘Mā hevaṃ, ānanda, avaca; mā hevaṃ, ānanda, avaca – khuddakanagarakaṃ ujjaṅgalanagarakaṃ sākhānagaraka’’nti. Kusāvatīrājadhānī ‘‘Bhūtapubbaṃ, ānanda, rājā mahāsudassano nāma ahosi khattiyo muddhāvasitto [khattiyo muddhābhisitto (ka.), cakkavattīdhammiko dhammarājā (mahāparinibbānasutta)] cāturanto vijitāvī janapadatthāvariyappatto. Rañño, ānanda, mahāsudassanassa ayaṃ kusinārā kusāvatī nāma rājadhānī ahosi. Puratthimena ca pacchimena ca dvādasayojanāni āyāmena, uttarena ca dakkhiṇena ca sattayojanāni vitthārena. Kusāvatī, ānanda, rājadhānī iddhā ceva ahosi phītā ca bahujanā ca ākiṇṇamanussā ca subhikkhā ca. Seyyathāpi, ānanda, devānaṃ āḷakamandā nāma rājadhānī iddhā ceva hoti phītā ca [iddhā ceva ahosi phītā ca (syā.)] bahujanā ca ākiṇṇayakkhā ca subhikkhā ca; evameva kho, ānanda, kusāvatī rājadhānī iddhā ceva ahosi phītā ca bahujanā ca ākiṇṇamanussā ca subhikkhā ca. Kusāvatī, ānanda, rājadhānī dasahi saddehi avivittā ahosi divā ceva rattiñca, seyyathidaṃ – hatthisaddena assasaddena rathasaddena bherisaddena mudiṅgasaddena vīṇāsaddena gītasaddena saṅkhasaddena sammasaddena pāṇitāḷasaddena ‘asnātha pivatha khādathā’ti dasamena saddena. ‘‘Kusāvatī, ānanda, rājadhānī sattahi pākārehi parikkhittā ahosi. Eko pākāro sovaṇṇamayo, eko rūpiyamayo, eko veḷuriyamayo, eko phalikamayo, eko lohitaṅkamayo [lohitaṅgamayo (ka.), lohitakamayo (byākaraṇesu)], eko masāragallamayo, eko sabbaratanamayo. Kusāvatiyā, ānanda, rājadhāniyā catunnaṃ vaṇṇānaṃ dvārāni ahesuṃ. Ekaṃ dvāraṃ sovaṇṇamayaṃ, ekaṃ rūpiyamayaṃ, ekaṃ veḷuriyamayaṃ, ekaṃ phalikamayaṃ. Ekekasmiṃ dvāre satta satta esikā nikhātā ahesuṃ tiporisaṅgā tiporisanikhātā dvādasaporisā ubbedhena. Ekā esikā sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā, ekā lohitaṅkamayā, ekā masāragallamayā, ekā sabbaratanamayā. Kusāvatī, ānanda, rājadhānī sattahi tālapantīhi parikkhittā ahosi. Ekā tālapanti sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā, ekā lohitaṅkamayā, ekā masāragallamayā, ekā sabbaratanamayā. Sovaṇṇamayassa tālassa sovaṇṇamayo khandho ahosi, rūpiyamayāni pattāni ca phalāni ca. Rūpiyamayassa tālassa rūpiyamayo khandho ahosi, sovaṇṇamayāni pattāni ca phalāni ca. Veḷuriyamayassa tālassa veḷuriyamayo khandho ahosi, phalikamayāni pattāni ca phalāni ca. Phalikamayassa tālassa phalikamayo khandho ahosi, veḷuriyamayāni pattāni ca phalāni ca. Lohitaṅkamayassa tālassa lohitaṅkamayo khandho ahosi, masāragallamayāni pattāni ca phalāni ca. Masāragallamayassa tālassa masāragallamayo khandho ahosi, lohitaṅkamayāni pattāni ca phalāni ca. Sabbaratanamayassa tālassa sabbaratanamayo khandho ahosi, sabbaratanamayāni pattāni ca phalāni ca. Tāsaṃ kho panānanda, tālapantīnaṃ vāteritānaṃ saddo ahosi vaggu ca rajanīyo ca khamanīyo [kamanīyo (sī. syā. pī.)] ca madanīyo ca. Seyyathāpi, ānanda, pañcaṅgikassa tūriyassa suvinītassa suppaṭitāḷitassa sukusalehi samannāhatassa saddo hoti vaggu ca rajanīyo ca khamanīyo ca madanīyo ca, evameva kho, ānanda, tāsaṃ tālapantīnaṃ vāteritānaṃ saddo ahosi vaggu ca rajanīyo ca khamanīyo ca madanīyo ca. Ye kho panānanda, tena samayena kusāvatiyā rājadhāniyā dhuttā ahesuṃ soṇḍā pipāsā, te tāsaṃ tālapantīnaṃ vāteritānaṃ saddena paricāresuṃ.",
      "english": "2. The count and description of the ten sounds were inconsistent with the Pali, implying eleven sounds instead of ten.\n3. The translation of \"khādathā\" was interpretative (\"be merry!\") rather than literal (\"consume!\").\n\nDo not speak thus, Ananda; do not speak thus, Ananda, that it is a small, insignificant, branch-town. In the past, Ananda, there was a king named Mahasudassana, a noble warrior king who conquered the four quarters and established peace in his realm. For King Mahasudassana, Ananda, this Kusinara was known as the royal capital Kusavati. It was twelve leagues in length from east to west and seven leagues in width from north to south.\n\nKusavati, Ananda, was a prosperous and flourishing royal capital, populous with many people and abundant in food. Just as, Ananda, the capital city of the gods, named Alakamanda, is prosperous and flourishing, populous with many yakkhas, and abundant in food, even so, Ananda, the royal capital Kusavati was prosperous and flourishing, populous with many people, and abundant in food. Kusavati, Ananda, the royal capital, was never without ten sounds, day and night: the sound of elephants, the sound of horses, the sound of chariots, the sound of drums, the sound of tabors, the sound of lutes, the sound of singing, the sound of conch shells, the sound of cymbals; and the tenth sound, which was hand-clapping accompanied by the call: \"Eat, drink, and consume!\"\n\nKusavati, Ananda, the royal capital, was surrounded by seven ramparts. One rampart was made of gold, one of silver, one of beryl, one of crystal, one of ruby, one of cat's-eye gem, and one of all kinds of gems. The royal capital of Kusavati, Ananda, had gates of four colors. One gate was made of gold, one of silver, one of beryl, and one of crystal. At each gate, seven pillars were fixed, each buried three times a man's height in the ground and twelve times a man's height above ground. One pillar was made of gold, one of silver, one of beryl, one of crystal, one of ruby, one of cat's-eye gem, and one of all kinds of gems.\n\nKusavati, Ananda, the royal capital, was surrounded by seven rows of palm trees. One row of palm trees was made of gold, one of silver, one of beryl, one of crystal, one of ruby, one of cat's-eye gem, and one of all kinds of gems. The golden palm tree had a golden trunk with silver leaves and fruits. The silver palm tree had a silver trunk with golden leaves and fruits. The beryl palm tree had a beryl trunk with crystal leaves and fruits. The crystal palm tree had a crystal trunk with beryl leaves and fruits. The ruby palm tree had a ruby trunk with cat's-eye gem leaves and fruits. The cat's-eye gem palm tree had a cat's-eye gem trunk with ruby leaves and fruits. The all-gem palm tree had an all-gem trunk with all-gem leaves and fruits.\n\nIndeed, Ananda, when those rows of palm trees were stirred by the wind, their sound was delightful, captivating, pleasing, and intoxicating. Just as, Ananda, the sound of a well-tuned five-piece orchestra, skillfully played by experts, is delightful, captivating, pleasing, and intoxicating, even so, Ananda, the sound of those rows of palm trees, when stirred by the wind, was delightful, captivating, pleasing, and intoxicating. Those rogues, drunkards, and pleasure-seekers, Ananda, who were in the royal capital of Kusavati at that time, would amuse themselves with the sound of those palm trees stirred by the wind.",
      "sinhala": "‘‘ආනන්දය, එසේ නොකියන්න; ආනන්දය, එසේ නොකියන්න. ‘කුඩා නගරයක්, පාළු නගරයක්, අතුරු නගරයක්’ යැයි නොකියන්න.’’\n\n‘‘ආනන්දය, පෙර කාලයක මහා සුදස්සන නම් රජෙක් සිටියේ ය. ඔහු ක්ෂත්‍රිය අභිෂේකයෙන් පත් වූ, සතර දිග්විජය කළ, ජනපදයේ ස්ථාවරත්වය ලබා සිටි රජෙකි. ආනන්දය, මහා සුදස්සන රජුගේ රාජධානිය වූයේ මේ කුසිනාරා නුවර, කුසාවතී නම් නුවරයි. එය නැගෙනහිර හා බටහිර දිශාවට යොදුන් දොළසක් දිගින් යුක්ත වූ අතර, උතුර හා දකුණ දිශාවට යොදුන් හතක් පළලින් යුක්ත විය.\n\nආනන්දය, කුසාවතී රාජධානිය සශ්‍රීක වූ, සමෘද්ධිමත් වූ, බොහෝ ජනයාගෙන් පිරුණු, මිනිසුන්ගෙන් පිරී ඉතිරී ගිය, ආහාර බහුල නගරයක් විය. ආනන්දය, දෙවියන්ගේ ආළකමන්දා රාජධානිය සශ්‍රීක වූ, සමෘද්ධිමත් වූ, බොහෝ ජනයාගෙන් පිරුණු, යක්ෂයන්ගෙන් පිරී ඉතිරී ගිය, ආහාර බහුල නගරයක් වූවා සේම, කුසාවතී රාජධානිය ද සශ්‍රීක වූ, සමෘද්ධිමත් වූ, බොහෝ ජනයාගෙන් පිරුණු, මිනිසුන්ගෙන් පිරී ඉතිරී ගිය, ආහාර බහුල නගරයක් විය. ආනන්දය, කුසාවතී රාජධානිය දිවා රෑ දෙකෙහි ම දස වැදෑරුම් ශබ්දයන්ගෙන් පිරී පැවතුණි. එනම්: හස්ති ශබ්ද, අශ්ව ශබ්ද, රථ ශබ්ද, බෙර ශබ්ද, මුද්‍රිංග ශබ්ද, වීණා ශබ්ද, ගීත ශබ්ද, සක් ශබ්ද, සම්මා ශබ්ද, අත්පොළසන් ශබ්ද සහ ‘අනුභව කරව්, පානය කරව්, කාදනය කරව්’ යන දසවැනි ශබ්දයයි.\n\nආනන්දය, කුසාවතී රාජධානිය ප්‍රාකාර සතකින් වට වී තිබුණි. එක් ප්‍රාකාරයක් රන්මය, අනෙක රිදීමය, තවත් ප්‍රාකාරයක් වෛඩූර්යමය, එකක් පළිඟුමය, තව ප්‍රාකාරයක් ලෝහිතාංකමය, එකක් මසාරගල්මය සහ අන්තිම ප්‍රාකාරය සකල රත්නයන්ගෙන් නිර්මාණය වී තිබුණි.\n\nආනන්දය, කුසාවතී රාජධානියෙහි වර්ණ සතරකින් යුත් දොරටු සතරක් විය. එක් දොරටුවක් රන්මය, අනෙක රිදීමය, තවත් දොරටුවක් වෛඩූර්යමය, අනෙක් දොරටුව පළිඟුමය විය. එක් එක් දොරටුවේ පුරුෂයන් තිදෙනෙකුගේ වට ප්‍රමාණයෙන් හා පුරුෂයන් තිදෙනෙකුගේ ගැඹුරට සිටුවා, පුරුෂයන් දොළොස් දෙනෙකුගේ උසින් යුත් කණු සත බැගින් විය. ඒ කණු සත අතුරින් එකක් රන්මය, එකක් රිදීමය, එකක් වෛඩූර්යමය, එකක් පළිඟුමය, එකක් ලෝහිතාංකමය, එකක් මසාරගල්මය සහ අන්තිම කණුව සකල රත්නයන්ගෙන් නිර්මාණය වී තිබුණි.\n\nආනන්දය, කුසාවතී රාජධානිය තල් ගස් පේළි සතකින් වට වී තිබුණි. එක් තල් ගස් පේළියක් රන්මය, අනෙක රිදීමය, තවත් පේළියක් වෛඩූර්යමය, එකක් පළිඟුමය, තව පේළියක් ලෝහිතාංකමය, එකක් මසාරගල්මය සහ අන්තිම පේළිය සකල රත්නයන්ගෙන් නිර්මාණය වී තිබුණි.\n\nරන්මය තල් ගසෙහි රන්මය කඳක් වූ අතර පත්‍ර සහ ඵල රිදීමය විය. රිදීමය තල් ගසෙහි රිදීමය කඳක් වූ අතර පත්‍ර සහ ඵල රන්මය විය. වෛඩූර්යමය තල් ගසෙහි වෛඩූර්යමය කඳක් වූ අතර පත්‍ර සහ ඵල පළිඟුමය විය. පළිඟුමය තල් ගසෙහි පළිඟුමය කඳක් වූ අතර පත්‍ර සහ ඵල වෛඩූර්යමය විය. ලෝහිතාංකමය තල් ගසෙහි ලෝහිතාංකමය කඳක් වූ අතර පත්‍ර සහ ඵල මසාරගල්මය විය. මසාරගල්මය තල් ගසෙහි මසාරගල්මය කඳක් වූ අතර පත්‍ර සහ ඵල ලෝහිතාංකමය විය. සකල රත්නමය තල් ගසෙහි සකල රත්නමය කඳක් වූ අතර පත්‍ර සහ ඵල ද සකල රත්නයන්ගෙන් නිර්මාණය වී තිබුණි.\n\nආනන්දය, සුළඟින් සැලෙන ඒ තල් ගස් පේළිවලින් නැගෙන හඬ මනහර වූ, සිත්ගන්නාසුළු වූ, ප්‍රියමනාප වූ, මත් කරවන සුළු වූ ශබ්දයක් විය. ආනන්දය, මනා ලෙස සකස් කරන ලද, මනා ලෙස හසුරුවන ලද, දක්ෂ ශිල්පීන් විසින් වාදනය කරනු ලබන පංචාංගික තූර්ය භාණ්ඩයක හඬ මනහර වූ, සිත්ගන්නාසුළු වූ, ප්‍රියමනාප වූ, මත් කරවන සුළු වූවා සේම, ඒ තල් ගස් පේළිවල සුළඟින් නැගෙන හඬ ද මනහර වූ, සිත්ගන්නාසුළු වූ, ප්‍රියමනාප වූ, මත් කරවන සුළු ශබ්දයක් විය. ආනන්දය, ඒ කාලයෙහි කුසාවතී රාජධානියේ කාමභෝගී, බේබදු, තෘෂ්ණාවෙන් පෙළුණු අය ඒ සුළඟින් සැලෙන තල් ගස්වල හඬින් සතුටු වූහ.",
      "paliTitle": ""
    },
    {
      "number": 243,
      "pali": "‘‘Rājā, ānanda, mahāsudassano sattahi ratanehi samannāgato ahosi catūhi ca iddhīhi. Katamehi sattahi? Idhānanda, rañño mahāsudassanassa tadahuposathe pannarase sīsaṃnhātassa uposathikassa uparipāsādavaragatassa dibbaṃ cakkaratanaṃ pāturahosi sahassāraṃ sanemikaṃ sanābhikaṃ sabbākāraparipūraṃ. Disvā rañño mahāsudassanassa etadahosi – ‘sutaṃ kho panetaṃ – ‘‘yassa rañño khattiyassa muddhāvasittassa tadahuposathe pannarase sīsaṃnhātassa uposathikassa uparipāsādavaragatassa dibbaṃ cakkaratanaṃ pātubhavati sahassāraṃ sanemikaṃ sanābhikaṃ sabbākāraparipūraṃ, so hoti rājā cakkavattī’’ti. Assaṃ nu kho ahaṃ rājā cakkavattī’ti.",
      "english": "Ānanda, King Mahāsudassana possessed seven jewels and four accomplishments. Which seven? Ānanda, on the fifteenth Uposatha day, King Mahāsudassana, having bathed his head, observing the Uposatha, and having ascended to the upper terrace of his palace, a divine wheel-treasure appeared to him. It had a thousand spokes, a complete rim and nave, perfect in every way. Seeing it, King Mahāsudassana thought: \"I have heard that if a divine wheel-treasure appears to a Khattiya king, anointed as sovereign, on the fifteenth Uposatha day, when he has bathed his head, is observing the Uposatha, and has ascended to the upper terrace of his palace—a wheel-treasure with a thousand spokes, a complete rim and nave, perfect in every way—that king becomes a Wheel-turning Monarch. Could I be a Wheel-turning Monarch?\"",
      "sinhala": "ආනන්දය, මහා සුදස්සන රජතුමා සත් රුවනින් හා සතර ඉර්ධීන්ගෙන් යුක්ත විය. ඒ සත් රුවන කවරේද? ආනන්දය, මහා සුදස්සන රජතුමා පොහොය දිනයක් වූ පසළොස්වක පොහෝ දිනයේ හිස සෝදා උපෝසථ සමාදන් වී ප්‍රාසාදයේ උඩුමහලට ගිය අවස්ථාවේ, දහසක් අර ඇති, නෙමියෙන් යුක්ත, නාභියෙන් යුක්ත, සියලු අංග සම්පූර්ණ දිව්‍ය චක්‍රරත්නයක් පහළ විය. එය දුටු මහා සුදස්සන රජතුමාට මෙසේ සිතුණි: \"අභිෂේක ලැබූ යම් ක්ෂත්‍රීය රජෙකු පසළොස්වක පොහෝ දිනයක හිස සෝදා උපෝසථ සමාදන් වී ප්‍රාසාදයේ උඩුමහලට ගිය කල්හි දහසක් අර ඇති, නෙමියෙන් යුත්, නාභියෙන් යුත්, සියලු අංග සම්පූර්ණ දිව්‍ය චක්‍රරත්නයක් පහළ වේ නම්, ඔහු චක්‍රවර්ති රජෙක් වන්නේය' කියා මම අසා ඇත්තෙමි. මම චක්‍රවර්ති රජෙක් වන්නෙම්ද?\"",
      "paliTitle": "Cakkaratanaṃ",
      "englishTitle": "The Wheel Treasure",
      "sinhalaTitle": "චක්ක රතනං"
    },
    {
      "number": 244,
      "pali": "‘‘Atha kho, ānanda, rājā mahāsudassano uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā vāmena hatthena suvaṇṇabhiṅkāraṃ gahetvā dakkhiṇena hatthena cakkaratanaṃ abbhukkiri – ‘pavattatu bhavaṃ cakkaratanaṃ, abhivijinātu bhavaṃ cakkaratana’nti. Atha kho taṃ, ānanda, cakkaratanaṃ puratthimaṃ disaṃ pavatti [pavattati (syā. ka.)], anvadeva [anudeva (syā.)] rājā mahāsudassano saddhiṃ caturaṅginiyā senāya, yasmiṃ kho panānanda, padese cakkaratanaṃ patiṭṭhāsi, tattha rājā mahāsudassano vāsaṃ upagacchi saddhiṃ caturaṅginiyā senāya. Ye kho panānanda, puratthimāya disāya paṭirājāno, te rājānaṃ mahāsudassanaṃ upasaṅkamitvā evamāhaṃsu – ‘ehi kho mahārāja, svāgataṃ te mahārāja, sakaṃ te mahārāja, anusāsa mahārājā’ti. Rājā mahāsudassano evamāha – ‘pāṇo na hantabbo, adinnaṃ na ādātabbaṃ, kāmesu micchā na caritabbā, musā na bhaṇitabbā, majjaṃ na pātabbaṃ, yathābhuttañca bhuñjathā’ti. Ye kho panānanda, puratthimāya disāya paṭirājāno, te rañño mahāsudassanassa anuyantā ahesuṃ. Atha kho taṃ, ānanda, cakkaratanaṃ puratthimaṃ samuddaṃ ajjhogāhetvā paccuttaritvā dakkhiṇaṃ disaṃ pavatti…pe… dakkhiṇaṃ samuddaṃ ajjhogāhetvā paccuttaritvā pacchimaṃ disaṃ pavatti…pe… pacchimaṃ samuddaṃ ajjhogāhetvā paccuttaritvā uttaraṃ disaṃ pavatti, anvadeva rājā mahāsudassano saddhiṃ caturaṅginiyā senāya. Yasmiṃ kho panānanda, padese cakkaratanaṃ patiṭṭhāsi, tattha rājā mahāsudassano vāsaṃ upagacchi saddhiṃ caturaṅginiyā senāya. Ye kho panānanda, uttarāya disāya paṭirājāno, te rājānaṃ mahāsudassanaṃ upasaṅkamitvā evamāhaṃsu – ‘ehi kho mahārāja, svāgataṃ te mahārāja, sakaṃ te mahārāja, anusāsa mahārājā’ti. Rājā mahāsudassano evamāha – ‘pāṇo na hantabbo, adinnaṃ na ādātabbaṃ, kāmesu micchā na caritabbā, musā na bhaṇitabbā, majjaṃ na pātabbaṃ, yathābhuttañca bhuñjathā’ti. Ye kho panānanda, uttarāya disāya paṭirājāno, te rañño mahāsudassanassa anuyantā ahesuṃ.",
      "english": "Then, Ananda, King Mahasudassana rose from his seat, arranged his upper robe over one shoulder, and, taking a golden ewer in his left hand, sprinkled the Wheel Jewel with his right, proclaiming, \"Let the Wheel Jewel advance! Let the Wheel Jewel conquer!\"\n\nThereupon, Ananda, that Wheel Jewel advanced eastward, with King Mahasudassana following closely behind with his fourfold army. Wherever the Wheel Jewel stopped, Ananda, King Mahasudassana would reside there with his fourfold army. And the rival kings of the eastern region would approach King Mahasudassana and say, \"Come, Great King, welcome! All is yours, Great King! Instruct us, Great King!\"\n\nKing Mahasudassana would then say, \"No living being is to be harmed. Nothing not given is to be taken. No misconduct in sensual pleasures is to be committed. No false speech is to be uttered. No intoxicating drink is to be consumed. And live off what is rightfully yours.\" And so, Ananda, the rival kings of the eastern region became followers of King Mahasudassana.\n\nThen, Ananda, that Wheel Jewel, after plunging into the eastern sea and resurfacing, advanced southward… after plunging into the southern sea and resurfacing, advanced westward… and after plunging into the western sea and resurfacing, advanced northward, with King Mahasudassana following closely behind with his fourfold army. Wherever the Wheel Jewel stopped, Ananda, King Mahasudassana would reside there with his fourfold army. And the rival kings of the northern region would approach King Mahasudassana and say, \"Come, Great King, welcome! All is yours, Great King! Instruct us, Great King!\"\n\nKing Mahasudassana would then say, \"No living being is to be harmed. Nothing not given is to be taken. No misconduct in sensual pleasures is to be committed. No false speech is to be uttered. No intoxicating drink is to be consumed. And live off what is rightfully yours.\" And so, Ananda, the rival kings of the northern region became followers of King Mahasudassana.",
      "sinhala": "ඉක්බිති ආනන්දයෙනි, මහා සුදස්සන රජතුමා අසුනෙන් නැගිට, උතුරු සළුව තනි උරහිසට දමා, වම් අතින් රන් කෙණ්ඩිය ගෙන, දකුණු අතින් චක්කරත්නයට පැන් ඉස ‘භවත් චක්කරත්නය ඉදිරියට යනු මැනවි, භවත් චක්කරත්නය ජයග්‍රහණය කරනු මැනවි’ යි කීයේය. ඉක්බිති ආනන්දයෙනි, ඒ චක්කරත්නය පෙර දිශාවට ගමන් කළේය. මහා සුදස්සන රජතුමා ද සිව් රඟ සෙනග සමඟ එය පසුපසින් ගමන් කළේය. ආනන්දයෙනි, චක්කරත්නය කුමන ප්‍රදේශයක පිහිටියේද, මහා සුදස්සන රජතුමා සිව් රඟ සෙනග සමඟ එහි වාසය කළේය. ආනන්දයෙනි, පෙර දිශාවේ සිටි පරදෙස් රජවරු, මහා සුදස්සන රජු වෙත එළඹ මෙසේ කීහ: ‘මහරජ, එනු මැනවි. මහරජ, ඔබට සුබ පැතුම්! මහරජ, මේ ඔබගේ රාජ්‍යයයි! මහරජ, අපට අනුශාසනා කරනු මැනවි.’ මහා සුදස්සන රජතුමා මෙසේ කීවේය: ‘පණ නැසිය යුතු නැත. අනුන් සතු දේ නොගත යුතුය. කාමයන්හි වරදවා නොහැසිරිය යුතුය. බොරු නොකළ යුතුය. මත්පැන් නොබිය යුතුය. තමන්ට අයත් දේ පරිභෝග කරත්වා.’ ආනන්දයෙනි, පෙර දිශාවේ සිටි පරදෙස් රජවරු මහා සුදස්සන රජුට අනුගාමිකයෝ වූහ.\n\nඉක්බිති ආනන්දයෙනි, ඒ චක්කරත්නය පෙරදිග සාගරයට බැස, නැවත ගොඩට අවුත්, දකුණු දිශාවට ගමන් කළේය. දකුණු දිශාවේදී ද දකුණු සාගරයට බැස, නැවත ගොඩට අවුත්, බස්නාහිර දිශාවට ගමන් කළේය. බස්නාහිර දිශාවේදී ද බස්නාහිර සාගරයට බැස, නැවත ගොඩට අවුත්, උතුරු දිශාවට ගමන් කළේය. මහා සුදස්සන රජතුමා ද සිව් රඟ සෙනග සමඟ එය පසුපසින් ගමන් කළේය. ආනන්දයෙනි, චක්කරත්නය කුමන ප්‍රදේශයක පිහිටියේද, මහා සුදස්සන රජතුමා සිව් රඟ සෙනග සමඟ එහි වාසය කළේය. ආනන්දයෙනි, උතුරු දිශාවේ සිටි පරදෙස් රජවරු, මහා සුදස්සන රජු වෙත එළඹ මෙසේ කීහ: ‘මහරජ, එනු මැනවි. මහරජ, ඔබට සුබ පැතුම්! මහරජ, මේ ඔබගේ රාජ්‍යයයි! මහරජ, අපට අනුශාසනා කරනු මැනවි.’ මහා සුදස්සන රජතුමා මෙසේ කීවේය: ‘පණ නැසිය යුතු නැත. අනුන් සතු දේ නොගත යුතුය. කාමයන්හි වරදවා නොහැසිරිය යුතුය. බොරු නොකළ යුතුය. මත්පැන් නොබිය යුතුය. තමන්ට අයත් දේ පරිභෝග කරත්වා.’ ආනන්දයෙනි, උතුරු දිශාවේ සිටි පරදෙස් රජවරු මහා සුදස්සන රජුට අනුගාමිකයෝ වූහ.",
      "paliTitle": ""
    },
    {
      "number": 245,
      "pali": "‘‘Atha kho taṃ, ānanda, cakkaratanaṃ samuddapariyantaṃ pathaviṃ abhivijinitvā kusāvatiṃ rājadhāniṃ paccāgantvā rañño mahāsudassanassa antepuradvāre atthakaraṇapamukhe akkhāhataṃ maññe aṭṭhāsi rañño mahāsudassanassa antepuraṃ upasobhayamānaṃ. Rañño, ānanda, mahāsudassanassa evarūpaṃ cakkaratanaṃ pāturahosi.",
      "english": "Then, Ananda, that wheel-jewel, having conquered the earth to its ocean boundaries and returned to the royal capital Kusavati, stood, it seems, fixed by an axle at the main court by the inner gate of King Mahasudassana's palace, illuminating the king's inner palace. Such a wheel-jewel, Ananda, appeared to King Mahasudassana.",
      "sinhala": "ආනන්ද, අනතුරුව ඒ චක්‍රරත්නය සමුද්‍රය අන්තයෙහි ඇති පොළොව ජයගෙන කුසාවතී රාජධානියට නැවත පැමිණ මහාසුදස්සන රජුගේ අන්තඃපුර ද්වාරයෙහි, අර්ථ විනිශ්චය කරන ප්‍රධාන ස්ථානයෙහි අක්ෂයකින් සවි කළාක් මෙන් රජුගේ අන්තඃපුරය බබළවමින් පිහිටියේය. ආනන්ද, මහාසුදස්සන රජුට මෙවැනි චක්‍රරත්නයක් පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 246,
      "pali": "‘‘Puna caparaṃ, ānanda, rañño mahāsudassanassa hatthiratanaṃ pāturahosi sabbaseto sattappatiṭṭho iddhimā vehāsaṅgamo uposatho nāma nāgarājā. Taṃ disvā rañño mahāsudassanassa cittaṃ pasīdi – ‘bhaddakaṃ vata bho hatthiyānaṃ, sace damathaṃ upeyyā’ti. Atha kho taṃ, ānanda, hatthiratanaṃ – seyyathāpi nāma gandhahatthājāniyo dīgharattaṃ suparidanto, evameva damathaṃ upagacchi. Bhūtapubbaṃ, ānanda, rājā mahāsudassano tameva hatthiratanaṃ vīmaṃsamāno pubbaṇhasamayaṃ abhiruhitvā samuddapariyantaṃ pathaviṃ anuyāyitvā kusāvatiṃ rājadhāniṃ paccāgantvā pātarāsamakāsi. Rañño, ānanda, mahāsudassanassa evarūpaṃ hatthiratanaṃ pāturahosi. ",
      "english": "Furthermore, Ananda, a jewel-elephant appeared to King Mahāsudassana: entirely white, with seven points of support, possessing psychic powers, capable of traveling through the air, and named Uposatha, king of elephants. Seeing it, King Mahāsudassana’s mind was pleased: \"Truly, what a magnificent elephant mount, if only it could be trained!\" Then, Ananda, that jewel-elephant, like a well-trained thoroughbred for a long time, submitted to training. Once, Ananda, King Mahāsudassana, wanting to test this very jewel-elephant, mounted it in the morning, traveled around the earth to its oceanic boundary, returned to the royal capital of Kusavati, and ate his breakfast. Such a jewel-elephant appeared to King Mahāsudassana",
      "sinhala": "ආනන්දයෙනි, තවද මහා සුදස්සන රජුට සියල්ල සුදු පැහැ වූ, සත් තැනක පිහිටි, ඍද්ධිමත්, අහසෙහි ගමන් කළ හැකි උපෝසථ නම් නාගරාජයා හස්ති රත්නයක් වශයෙන් පහළ විය. එය දුටු මහා සුදස්සන රජුගේ සිත පහන් විය. \"මෙම හස්ති යානය ඉතා යහපත්ය. මෙය හික්මවා ගත හැකි නම් කොතරම් හොඳද\" යැයි සිතුවේය. ආනන්දයෙනි, ඒ හස්ති රත්නය, බොහෝ කලක් මනා ලෙස හික්මවන ලද ගන්ධහස්තී ආජානීයෙක් මෙන් හික්මීමකට පත් විය. ආනන්දයෙනි, මහා සුදස්සන රජු පෙර දිනෙක එම හස්ති රත්නය පරීක්ෂා කරමින් පෙරවරු සමයේ නැගී මුහුදෙන් වට වූ මුළු පොළොවෙහි සැරිසැරුවේය. පසුව කුසාවතී රාජධානියට පැමිණ උදෑසන ආහාරය ගත්තේය. ආනන්දයෙනි, මහා සුදස්සන රජුට මෙවැනි හස්ති රත්නයක් පහළ විය.",
      "paliTitle": "Hatthiratanaṃ",
      "englishTitle": "The Elephant Jewel",
      "sinhalaTitle": "හත්ථිරතනං"
    },
    {
      "number": 247,
      "pali": "‘‘Puna caparaṃ, ānanda, rañño mahāsudassanassa assaratanaṃ pāturahosi sabbaseto kāḷasīso muñjakeso iddhimā vehāsaṅgamo valāhako nāma assarājā. Taṃ disvā rañño mahāsudassanassa cittaṃ pasīdi – ‘bhaddakaṃ vata bho assayānaṃ sace damathaṃ upeyyā’ti. Atha kho taṃ, ānanda, assaratanaṃ seyyathāpi nāma bhaddo assājāniyo dīgharattaṃ suparidanto, evameva damathaṃ upagacchi. Bhūtapubbaṃ, ānanda, rājā mahāsudassano tameva assaratanaṃ vīmaṃsamāno pubbaṇhasamayaṃ abhiruhitvā samuddapariyantaṃ pathaviṃ anuyāyitvā kusāvatiṃ rājadhāniṃ paccāgantvā pātarāsamakāsi. Rañño, ānanda, mahāsudassanassa evarūpaṃ assaratanaṃ pāturahosi. ",
      "english": "Furthermore, Ananda, a treasure of a horse appeared to King Mahasudassana: a horse-king named Valāhaka, entirely white with a black head and a mane like muñja grass, endowed with psychic powers and able to travel through the air. Seeing it, King Mahasudassana's mind was pleased, thinking, \"Truly, this is an excellent horse, if only it would submit to training.\" Then, Ananda, that horse-treasure submitted to training just as a noble, well-trained thoroughbred horse would after a long time.\n\nOnce, Ananda, King Mahasudassana, testing this very horse-treasure, mounted it in the morning and traveled around the earth as far as the ocean boundaries. Returning to the royal capital, Kusavati, he took his breakfast. Such a horse-treasure, Ananda, appeared to King Mahasudassana.",
      "sinhala": "ආනන්දය, තවද මහා සුදස්සන රජුට සියල්ල සුදු පැහැති, කළු හිසක් ඇති, මුඤ්ජ තණ පතක් බඳු කෙස් ඇති, සෘද්ධිමත්, අහසේ ගමන් කළ හැකි වළාහක නම් අශ්ව රාජයා වූ අශ්වරත්නය පහළ විය. එය දුටු මහා සුදස්සන රජුගේ සිත පහන් විය. \"අහෝ, මේ භද්‍ර අශ්වයා දමනය කළ හැකි නම් කොතරම් හොඳදැ\"යි ඔහු සිතුවේය. ආනන්දය, ඒ අශ්වරත්නය බොහෝ කලක් මනාව පුහුණු කරන ලද භද්‍ර ආජානීය අශ්වයෙකු මෙන් දමනයට පත්විය. ආනන්දය, මහා සුදස්සන රජු වරක් එම අශ්වරත්නය පරීක්ෂා කරමින්, පෙරවරු කාලයේ නැගී, මුහුදින් වට වූ පොළොව පුරා ගමන් කොට, කුසාවතී රාජධානියට නැවත පැමිණ උදෑසන ආහාරය ගත්තේය. ආනන්දය, මහා සුදස්සන රජුට මෙවැනි අශ්වරත්නයක් පහළ විය.",
      "paliTitle": "Assaratanaṃ",
      "englishTitle": "The Discourse on Horses",
      "sinhalaTitle": "අස්සරතනං"
    },
    {
      "number": 248,
      "pali": "‘‘Puna caparaṃ, ānanda, rañño mahāsudassanassa maṇiratanaṃ pāturahosi. So ahosi maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato accho vippasanno anāvilo sabbākārasampanno. Tassa kho panānanda, maṇiratanassa ābhā samantā yojanaṃ phuṭā ahosi. Bhūtapubbaṃ, ānanda, rājā mahāsudassano tameva maṇiratanaṃ vīmaṃsamāno caturaṅginiṃ senaṃ sannayhitvā maṇiṃ dhajaggaṃ āropetvā rattandhakāratimisāya pāyāsi. Ye kho panānanda, samantā gāmā ahesuṃ, te tenobhāsena kammante payojesuṃ divāti maññamānā. Rañño, ānanda, mahāsudassanassa evarūpaṃ maṇiratanaṃ pāturahosi. Itthiratanaṃ",
      "english": "Furthermore, Ananda, another jewel-treasure appeared to King Mahasudassana. That jewel was a beryl, beautiful, of noble origin, eight-faceted, perfectly cut, clear, pure, untroubled, and complete in all its aspects. Indeed, Ananda, the radiance of that jewel-treasure spread for a league all around.\n\nIt happened once, Ananda, that King Mahasudassana, wishing to test that very jewel-treasure, assembled his four-fold army, placed the jewel at the tip of his banner, and set out into the intense darkness of the night. Indeed, Ananda, the villages all around, illuminated by that light, engaged in their work, thinking it was daytime. Such a jewel-treasure, Ananda, appeared to King Mahasudassana.",
      "sinhala": "ආනන්දය, තවද මහාසුදස්සන රජුට මැණික් රුවනක් පහළ විය. එය වෛදූර්ය වර්ගයේ, දීප්තිමත්, උසස් ජාතියේ, අටපට්ටම් වූ, මනා ඔපයක් ඇති, පැහැදිලි, ප්‍රසන්න, නිර්මල, සියලු අංගයන්ගෙන් පරිපූර්ණ මැණිකක් විය. ආනන්දය, එම මැණික් රුවනේ ආලෝකය වටින් යොදුනක් දුර පැතිර ගියේය.\n\nආනන්දය, පෙර එක් කලෙක මහාසුදස්සන රජු එම මැණික් රුවන පරීක්ෂා කර බැලීමට සතරඟ සේනාව සූදානම් කරවා, මැණික කොඩියේ අග තබා රාත්‍රියේ අන්ධකාරයෙහි ගමන් කළේය. ආනන්දය, අවට ගම්වල වැසියන් එම ආලෝකය නිසා එය දහවලක් යැයි සිතා තම වැඩකටයුතු කර ගත්හ. ආනන්දය, මහාසුදස්සන රජුට මෙවැනි මැණික් රුවනක් පහළ විය. ඉත්ථිරුවන",
      "paliTitle": "Maṇiratanaṃ",
      "englishTitle": "The Jewel Discourse",
      "sinhalaTitle": "මණිරතනං"
    },
    {
      "number": 249,
      "pali": "‘‘Puna caparaṃ, ānanda, rañño mahāsudassanassa itthiratanaṃ pāturahosi abhirūpā dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā nātidīghā nātirassā nātikisā nātithūlā nātikāḷikā nāccodātā atikkantā mānusivaṇṇaṃ [mānussivaṇṇaṃ (syā.)] appattā dibbavaṇṇaṃ. Tassa kho panānanda, itthiratanassa evarūpo kāyasamphasso hoti, seyyathāpi nāma tūlapicuno vā kappāsapicuno vā. Tassa kho panānanda, itthiratanassa sīte uṇhāni gattāni honti, uṇhe sītāni. Tassa kho panānanda, itthiratanassa kāyato candanagandho vāyati, mukhato uppalagandho. Taṃ kho panānanda, itthiratanaṃ rañño mahāsudassanassa pubbuṭṭhāyinī ahosi pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī. Taṃ kho panānanda, itthiratanaṃ rājānaṃ mahāsudassanaṃ manasāpi no aticari [aticarī (ka.), aticārī (sī. syā. pī.)], kuto pana kāyena. Rañño, ānanda, mahāsudassanassa evarūpaṃ itthiratanaṃ pāturahosi. ",
      "english": "Furthermore, Ananda, a jewel-woman appeared to King Mahasudassana. She was beautiful, lovely to see, charming, and possessed the utmost beauty of complexion. She was neither too tall nor too short, neither too thin nor too stout, neither too dark nor too fair; she surpassed human beauty, yet did not attain divine beauty.\n\nThat jewel-woman, Ananda, had a bodily touch as soft as a wad of cotton or a tuft of kapok. That jewel-woman, Ananda, felt warm to the touch when it was cold and cool when it was hot. That jewel-woman, Ananda, exuded the scent of sandalwood from her body and the scent of a water lily from her mouth.\n\nThat jewel-woman, Ananda, would rise before King Mahasudassana, retire after him, listen for his commands, act pleasantly, and speak kindly. That jewel-woman, Ananda, never transgressed against King Mahasudassana even in thought, much less in deed. Such a jewel-woman appeared to King Mahasudassana.",
      "sinhala": "ආනන්දයෙනි, තවද මහා සුදස්සන රජතුමාට අතිශයින් රූමත්, දැකීමට ප්‍රියජනක, ප්‍රසාදජනක, ඉතා උතුම් වර්ණ සම්පත්තියෙන් යුක්ත වූ, වැඩි උසක් හෝ මිටි බවක් නැති, කෙට්ටු හෝ මහත නැති, කළු පැහැ හෝ සුදු පැහැ නැති, මනුෂ්‍ය වර්ණය ඉක්මවූ නමුත් දිව්‍ය වර්ණයට නොපැමිණි ඉත්ථී රත්නයක් පහළ විය. ආනන්දයෙනි, එම ඉත්ථී රත්නයේ ශරීර ස්පර්ශය කපු පුළුන් හෝ කපු පිංජු මෙන් මෘදු විය. ආනන්දයෙනි, එම ඉත්ථී රත්නයේ ශරීරය සීත කාලයේදී උණුසුම් ද, උණුසුම් කාලයේදී සිසිල් ද විය. ආනන්දයෙනි, එම ඉත්ථී රත්නයේ ශරීරයෙන් සඳුන් සුවඳ ද, මුඛයෙන් නෙළුම් සුවඳ ද හමයි. ආනන්දයෙනි, එම ඉත්ථී රත්නය මහා සුදස්සන රජතුමාට පළමුව නැගිටින්නී ද, පසුව නින්දට යන්නී ද, කුමක් කළ යුතු දැයි විමසන්නී ද, රජුගේ සිතට ප්‍රිය ලෙස හැසිරෙන්නී ද, ප්‍රිය වචන කථා කරන්නී ද වූවා ය. ආනන්දයෙනි, එම ඉත්ථී රත්නය මහා සුදස්සන රජතුමා සිතින් පවා ඉක්මවා නොගියා ය; කයින් ඉක්මවා යෑම ගැන කවර කථා ද? ආනන්දයෙනි, මහා සුදස්සන රජතුමාට මෙබඳු ඉත්ථී රත්නයක් පහළ විය.",
      "paliTitle": "Itthiratanaṃ",
      "englishTitle": "The Jewel of Woman",
      "sinhalaTitle": "ඉත්ථිරතනං"
    },
    {
      "number": 250,
      "pali": "‘‘Puna caparaṃ, ānanda, rañño mahāsudassanassa gahapatiratanaṃ pāturahosi. Tassa kammavipākajaṃ dibbacakkhu pāturahosi yena nidhiṃ passati sassāmikampi assāmikampi. So rājānaṃ mahāsudassanaṃ upasaṅkamitvā evamāha – ‘appossukko tvaṃ, deva, hohi, ahaṃ te dhanena dhanakaraṇīyaṃ karissāmī’ti. Bhūtapubbaṃ, ānanda, rājā mahāsudassano tameva gahapatiratanaṃ vīmaṃsamāno nāvaṃ abhiruhitvā majjhe gaṅgāya nadiyā sotaṃ ogāhitvā gahapatiratanaṃ etadavoca – ‘attho me, gahapati, hiraññasuvaṇṇenā’ti. ‘Tena hi, mahārāja, ekaṃ tīraṃ nāvā upetū’ti. ‘Idheva me, gahapati, attho hiraññasuvaṇṇenā’ti. Atha kho taṃ, ānanda, gahapatiratanaṃ ubhohi hatthehi udakaṃ omasitvā pūraṃ hiraññasuvaṇṇassa kumbhiṃ uddharitvā rājānaṃ mahāsudassanaṃ etadavoca – ‘alamettāvatā mahārāja, katamettāvatā mahārāja, pūjitamettāvatā mahārājā’ti? Rājā mahāsudassano evamāha – ‘alamettāvatā gahapati, katamettāvatā gahapati, pūjitamettāvatā gahapatī’ti. Rañño, ānanda, mahāsudassanassa evarūpaṃ gahapatiratanaṃ pāturahosi. ",
      "english": "Again, Ananda, a householder-treasure appeared to King Mahasudassana. This one possessed a divine eye, the result of past kamma, which allowed him to see treasures, whether owned or ownerless. He approached King Mahasudassana and said, \"Your Majesty, be without worry. I will manage all your financial affairs with wealth.\"\n\nOnce, Ananda, King Mahasudassana, testing this householder-treasure, boarded a boat and, going into the current in the middle of the Ganges River, said to him, \"Householder, I need gold and silver.\" The householder-treasure replied, \"Then, great king, let the boat go to one of the banks.\" But the king said, \"My need for gold and silver, householder, is right here.\" Then, Ananda, that householder-treasure stirred the water with both hands, brought forth a jar full of gold and silver, and said to King Mahasudassana, \"Is this enough, great king? Is this fully done, great king? Is this completely satisfactory, great king?\" King Mahasudassana replied, \"It is enough, householder. It is fully done, householder. It is completely satisfactory, householder.\" Ananda, such a householder-treasure appeared to King Mahasudassana.",
      "sinhala": "ආනන්දයෙනි, මහා සුදස්සන රජතුමාට ගහපති රත්නය පහළ විය. ඔහුගේ කර්ම විපාකයෙන් දිව්‍යමය ඇසක් පහළ වූ අතර, එමගින් ඔහුට හිමිකරුවන් සහිත සහ රහිත නිධාන දැකගත හැකි විය. ඔහු මහා සුදස්සන රජු හමුවී, ‘දේවයන් වහන්ස, ඔබ කිසිඳු කරදරයකට පත් නොවන්න. ඔබ වෙනුවෙන් ධනයෙන් කළ යුතු සියල්ල මම කරන්නෙමි’යි කීවේය.\n\nආනන්දයෙනි, පෙර කලෙක මහා සුදස්සන රජතුමා එම ගහපති රත්නය පරීක්ෂා කර බැලීමට ගඟ මැදට ඔරුවකින් ගොස්, ගහපති රත්නයට මෙසේ කීවේය: ‘ගහපතිය, මට රන් රිදී අවශ්‍යයි.’ එවිට ගහපති රත්නය, ‘මහරජතුමනි, එසේ නම් ඔරුව ගොඩබිමට ගෙන යමුදැ’යි ඇසීය. රජතුමා, ‘ගහපතිය, මට රන් රිදී අවශ්‍ය වන්නේ මෙතැනදී මයි’ කීවේය. එවිට ආනන්දයෙනි, එම ගහපති රත්නය දෑතින් දිය සිඳ රන් රිදී පිරුණු කළයක් ගොඩට ගෙන මහා සුදස්සන රජතුමාට මෙසේ කීවේය: ‘මහරජතුමනි, මෙපමණ ප්‍රමාණවත්ද? මහරජතුමනි, මෙපමණ කිරීම සෑහේද? මහරජතුමනි, මෙපමණ පූජා කිරීම සෑහේද?’ මහා සුදස්සන රජතුමා මෙසේ කීවේය: ‘ගහපතිය, මෙපමණ ප්‍රමාණවත්. ගහපතිය, මෙපමණ කිරීම සෑහේ. ගහපතිය, මෙපමණ පූජා කිරීම සෑහේ.’ ආනන්දයෙනි, මහා සුදස්සන රජතුමාට මෙවැනි ගහපති රත්නයක් පහළ විය.",
      "paliTitle": "Gahapatiratanaṃ",
      "englishTitle": "The Jewel of the Householder",
      "sinhalaTitle": "ගහපතිරතනං"
    },
    {
      "number": 251,
      "pali": "‘‘Puna caparaṃ, ānanda, rañño mahāsudassanassa pariṇāyakaratanaṃ pāturahosi paṇḍito viyatto medhāvī paṭibalo rājānaṃ mahāsudassanaṃ upayāpetabbaṃ upayāpetuṃ, apayāpetabbaṃ apayāpetuṃ, ṭhapetabbaṃ ṭhapetuṃ. So rājānaṃ mahāsudassanaṃ upasaṅkamitvā evamāha – ‘appossukko tvaṃ, deva, hohi, ahamanusāsissāmī’ti. Rañño, ānanda, mahāsudassanassa evarūpaṃ pariṇāyakaratanaṃ pāturahosi. ‘‘Rājā, ānanda, mahāsudassano imehi sattahi ratanehi samannāgato ahosi.",
      "english": "Furthermore, Ananda, an advisor-jewel appeared for King Mahasudassana. He was wise, experienced, intelligent, and capable of advising King Mahasudassana on what to do, what to avoid, and what to establish. He approached King Mahasudassana and said: ‘Be at ease, Sire, I will instruct you.’ In this way, Ananda, such an advisor-jewel appeared for King Mahasudassana.\nKing Mahasudassana, Ananda, possessed these seven jewels.",
      "sinhala": "ආනන්දයෙනි, තවද මහාසුදස්සන රජතුමාට පරිණායක රුවනක් පහළ විය. එය පණ්ඩිත, විචක්ෂණ, ඥානවන්ත, හා සමර්ථ විය. එම රුවන රජුට ළං කළ යුතු දෑ ළං කිරීමටත්, ඉවත් කළ යුතු දෑ ඉවත් කිරීමටත්, තැබිය යුතු දෑ තැබීමටත් සමත් විය. ඔහු මහාසුදස්සන රජතුමා වෙත එළඹ, 'දේවයන් වහන්ස, ඔබ උත්සුක නොවන්න. මම අනුශාසනා කරන්නෙමි' යි කීවේය. ආනන්දයෙනි, මහාසුදස්සන රජතුමාට මෙබඳු පරිණායක රුවනක් පහළ විය.\n\nආනන්දයෙනි, මහාසුදස්සන රජතුමා මේ සත් රුවනින් යුක්ත වූයේ සේක.",
      "paliTitle": "Pariṇāyakaratanaṃ",
      "englishTitle": "The Jewel of the Guide",
      "sinhalaTitle": "පරිණායක රතනය"
    },
    {
      "number": 252,
      "pali": "‘‘Rājā, ānanda, mahāsudassano catūhi iddhīhi samannāgato ahosi. Katamāhi catūhi iddhīhi? Idhānanda, rājā mahāsudassano abhirūpo ahosi dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato ativiya aññehi manussehi. Rājā, ānanda, mahāsudassano imāya paṭhamāya iddhiyā samannāgato ahosi. ‘‘Puna caparaṃ, ānanda, rājā mahāsudassano dīghāyuko ahosi ciraṭṭhitiko ativiya aññehi manussehi. Rājā, ānanda, mahāsudassano imāya dutiyāya iddhiyā samannāgato ahosi. ‘‘Puna caparaṃ, ānanda, rājā mahāsudassano appābādho ahosi appātaṅko samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya ativiya aññehi manussehi. Rājā, ānanda, mahāsudassano imāya tatiyāya iddhiyā samannāgato ahosi. ‘‘Puna caparaṃ, ānanda, rājā mahāsudassano brāhmaṇagahapatikānaṃ piyo ahosi manāpo. Seyyathāpi, ānanda, pitā puttānaṃ piyo hoti manāpo, evameva kho, ānanda, rājā mahāsudassano brāhmaṇagahapatikānaṃ piyo ahosi manāpo. Raññopi, ānanda, mahāsudassanassa brāhmaṇagahapatikā piyā ahesuṃ manāpā. Seyyathāpi, ānanda, pitu puttā piyā honti manāpā, evameva kho, ānanda, raññopi mahāsudassanassa brāhmaṇagahapatikā piyā ahesuṃ manāpā. ‘‘Bhūtapubbaṃ, ānanda, rājā mahāsudassano caturaṅginiyā senāya uyyānabhūmiṃ niyyāsi. Atha kho, ānanda, brāhmaṇagahapatikā rājānaṃ mahāsudassanaṃ upasaṅkamitvā evamāhaṃsu – ‘ataramāno, deva, yāhi, yathā taṃ mayaṃ cirataraṃ passeyyāmā’ti. Rājāpi, ānanda, mahāsudassano sārathiṃ āmantesi – ‘ataramāno, sārathi, rathaṃ pesehi, yathā ahaṃ brāhmaṇagahapatike cirataraṃ passeyya’nti. Rājā, ānanda, mahāsudassano imāya catutthiyā [catutthāya (syā.)] iddhiyā samannāgato ahosi. Rājā, ānanda, mahāsudassano imāhi catūhi iddhīhi samannāgato ahosi. ",
      "english": "Ānanda, King Mahāsudassana possessed four extraordinary qualities. Which four? Firstly, Ānanda, King Mahāsudassana was exceptionally handsome, a delight to behold, charming, and blessed with the most beautiful complexion, far surpassing that of ordinary people. Ānanda, King Mahāsudassana possessed this first extraordinary quality.\n\nFurthermore, Ānanda, King Mahāsudassana was long-lived and enjoyed a great lifespan, far exceeding that of ordinary people. Ānanda, King Mahāsudassana possessed this second extraordinary quality.\n\nFurthermore, Ānanda, King Mahāsudassana was free from sickness and disease, possessing a digestive system that functioned smoothly and was neither too cold nor too hot, far surpassing that of ordinary people. Ānanda, King Mahāsudassana possessed this third extraordinary quality.\n\nFurthermore, Ānanda, King Mahāsudassana was beloved and pleasing to Brahmins and householders. Just as a father is beloved and pleasing to his children, so too, Ānanda, King Mahāsudassana was beloved and pleasing to Brahmins and householders. And the Brahmins and householders were also beloved and pleasing to King Mahāsudassana. Just as children are beloved and pleasing to their father, so too, Ānanda, the Brahmins and householders were beloved and pleasing to King Mahāsudassana.\n\nOnce, Ānanda, King Mahāsudassana went to the royal park accompanied by his four divisions of troops. Then, Ānanda, the Brahmins and householders approached King Mahāsudassana and said to him, \"O King, proceed slowly, so that we may have a longer opportunity to see you.\" Thereupon, Ānanda, King Mahāsudassana addressed his charioteer, saying, \"Drive the chariot slowly, charioteer, so that I may have a longer opportunity to see the Brahmins and householders.\" Ānanda, King Mahāsudassana possessed this fourth extraordinary quality. Ānanda, King Mahāsudassana possessed these four extraordinary qualities.",
      "sinhala": "ආනන්දයෙනි, මහාසුදස්සන රජු සතර ඍද්ධීන්ගෙන් සමන්විත විය. කවර සතර ඍද්ධීන්ගෙන් ද යත්: ආනන්දයෙනි, මහාසුදස්සන රජු අන්‍ය මිනිසුන්ට වඩා අතිශයින් රූපශ්‍රීයෙන් යුක්ත වූයේ, දැකුම්කලු වූයේ, ප්‍රියමනාප වූයේ, උසස් වර්ණ සම්පත්තියෙන් හෙබිණ. ආනන්දයෙනි, මහාසුදස්සන රජු මේ පළමු ඍද්ධියෙන් සමන්විත විය.\n\nතවද ආනන්දයෙනි, මහාසුදස්සන රජු අන්‍ය මිනිසුන්ට වඩා අතිශයින් දීර්ඝායුෂ ඇත්තෙක් වූයේ, බොහෝ කලක් ජීවත් විය. ආනන්දයෙනි, මහාසුදස්සන රජු මේ දෙවැනි ඍද්ධියෙන් සමන්විත විය.\n\nතවද ආනන්දයෙනි, මහාසුදස්සන රජු අන්‍ය මිනිසුන්ට වඩා අතිශයින් නිරෝගී වූයේ, රෝගාබාධවලින් තොර වූයේ, සමව ක්‍රියාකරන ආහාර ජීර්ණ ශක්තියෙන් යුක්ත වූයේ, අධික ශීතල හෝ අධික උණුසුම් නොවූ ස්වභාවයක් ගත්තේ විය. ආනන්දයෙනි, මහාසුදස්සන රජු මේ තෙවැනි ඍද්ධියෙන් සමන්විත විය.\n\nතවද ආනන්දයෙනි, මහාසුදස්සන රජු බ්‍රාහ්මණ ගෘහපතියන්ට ප්‍රිය වූයේ, මනාප වූයේ ය. ආනන්දයෙනි, පියෙක් තම දරුවන්ට ප්‍රිය මනාප වන්නා සේම, මහාසුදස්සන රජු බ්‍රාහ්මණ ගෘහපතියන්ට ප්‍රිය මනාප විය. ආනන්දයෙනි, මහාසුදස්සන රජුට ද බ්‍රාහ්මණ ගෘහපතියෝ ප්‍රිය මනාප වූහ. ආනන්දයෙනි, පියෙකුට දරුවෝ ප්‍රිය මනාප වන්නා සේම, මහාසුදස්සන රජුට ද බ්‍රාහ්මණ ගෘහපතියෝ ප්‍රිය මනාප වූහ.\n\nආනන්දයෙනි, පෙර කලෙක මහාසුදස්සන රජු සතර අංගවලින් යුත් සේනාව සමඟ උයනට ගියේ ය. එකල්හි ආනන්දයෙනි, බ්‍රාහ්මණ ගෘහපතියෝ මහාසුදස්සන රජු වෙත පැමිණ මෙසේ කීහ: ‘දේවයන් වහන්ස, අපට ඔබ වහන්සේ බොහෝ වේලා දැකගත හැකි වන පරිදි සෙමින් වැඩම කරන්න.’ එවිට ආනන්දයෙනි, මහාසුදස්සන රජු සාරථී අමතා, ‘සාරථී, බ්‍රාහ්මණ ගෘහපතියන්ට මාව බොහෝ වේලා දැකගත හැකි වන පරිදි සෙමින් රථය පදවන්න’ යැයි කීවේ ය. ආනන්දයෙනි, මහාසුදස්සන රජු මේ සිව්වැනි ඍද්ධියෙන් සමන්විත විය. ආනන්දයෙනි, මහාසුදස්සන රජු මේ සතර ඍද්ධියෙන් සමන්විත විය.",
      "paliTitle": "Catuiddhisamannāgato",
      "englishTitle": "Possessed of the Four Psychic Powers",
      "sinhalaTitle": "චතුඉද්ධිසමන්නාගතො"
    },
    {
      "number": 253,
      "pali": "‘‘Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘yaṃnūnāhaṃ imāsu tālantarikāsu dhanusate dhanusate pokkharaṇiyo māpeyya’nti. ‘‘Māpesi kho, ānanda, rājā mahāsudassano tāsu tālantarikāsu dhanusate dhanusate pokkharaṇiyo. Tā kho panānanda, pokkharaṇiyo catunnaṃ vaṇṇānaṃ iṭṭhakāhi citā ahesuṃ – ekā iṭṭhakā sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā. ‘‘Tāsu kho panānanda, pokkharaṇīsu cattāri cattāri sopānāni ahesuṃ catunnaṃ vaṇṇānaṃ, ekaṃ sopānaṃ sovaṇṇamayaṃ ekaṃ rūpiyamayaṃ ekaṃ veḷuriyamayaṃ ekaṃ phalikamayaṃ. Sovaṇṇamayassa sopānassa sovaṇṇamayā thambhā ahesuṃ, rūpiyamayā sūciyo ca uṇhīsañca. Rūpiyamayassa sopānassa rūpiyamayā thambhā ahesuṃ, sovaṇṇamayā sūciyo ca uṇhīsañca. Veḷuriyamayassa sopānassa veḷuriyamayā thambhā ahesuṃ, phalikamayā sūciyo ca uṇhīsañca. Phalikamayassa sopānassa phalikamayā thambhā ahesuṃ, veḷuriyamayā sūciyo ca uṇhīsañca. Tā kho panānanda, pokkharaṇiyo dvīhi vedikāhi parikkhittā ahesuṃ ekā vedikā sovaṇṇamayā, ekā rūpiyamayā. Sovaṇṇamayāya vedikāya sovaṇṇamayā thambhā ahesuṃ, rūpiyamayā sūciyo ca uṇhīsañca. Rūpiyamayāya vedikāya rūpiyamayā thambhā ahesuṃ, sovaṇṇamayā sūciyo ca uṇhīsañca. Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘yaṃnūnāhaṃ imāsu pokkharaṇīsu evarūpaṃ mālaṃ ropāpeyyaṃ uppalaṃ padumaṃ kumudaṃ puṇḍarīkaṃ sabbotukaṃ sabbajanassa anāvaṭa’nti. Ropāpesi kho, ānanda, rājā mahāsudassano tāsu pokkharaṇīsu evarūpaṃ mālaṃ uppalaṃ padumaṃ kumudaṃ puṇḍarīkaṃ sabbotukaṃ sabbajanassa anāvaṭaṃ.",
      "english": "Then, Ānanda, King Mahāsudassana thought: ‘I should have ponds built in these avenues of palm trees, spaced every hundred bow-lengths.’ And so, Ānanda, King Mahāsudassana had ponds built in those avenues of palm trees, spaced every hundred bow-lengths. These ponds, Ānanda, were constructed with bricks of four kinds: some bricks were golden, some silver, some beryl, and some crystal.\n\nIn each of those ponds, Ānanda, there were four stairways, each of a different material: one stairway was golden, one silver, one beryl, and one crystal. The golden stairway had golden pillars, with silver crossbars and coping stones. The silver stairway had silver pillars, with golden crossbars and coping stones. The beryl stairway had beryl pillars, with crystal crossbars and coping stones. The crystal stairway had crystal pillars, with beryl crossbars and coping stones. Those ponds, Ānanda, were enclosed by two railings: one railing was golden, and the other silver. The golden railing had golden pillars, with silver crossbars and coping stones. The silver railing had silver pillars, with golden crossbars and coping stones.\n\nThen, Ānanda, King Mahāsudassana thought: ‘I should have these ponds planted with various flowers—blue lotuses, pink lotuses, white water lilies, and white lotuses—blooming in every season, and accessible to all.’ And so, Ānanda, King Mahāsudassana had those ponds planted with such flowers—blue lotuses, pink lotuses, white water lilies, and white lotuses—blooming in every season, and accessible to all.",
      "sinhala": "ආනන්දය, ඉක්බිති මහා සුදස්සන රජතුමාට මෙවැනි අදහසක් ඇති විය. ‘මා විසින් මේ තල් ගස් අතර දුනු සියයක් දුරින් දුනු සියයක් දුරින් පොකුණු කරවන්නේ නම් යෙහෙකි.’ ආනන්දය, මහා සුදස්සන රජතුමා ඒ තල් ගස් අතර දුනු සියයක් දුරින් දුනු සියයක් දුරින් පොකුණු කරවූහ. ආනන්දය, ඒ පොකුණු සතර වර්ණයෙන් යුත් ගඩොලින් බැඳ තිබුණි. එනම්, එක් ගඩොලක් රන්වන් පාටින් ද, එක් ගඩොලක් රිදීවන් පාටින් ද, එක් ගඩොලක් වෛඩූර්ය වර්ණයෙන් ද, එක් ගඩොලක් පළිඟු වර්ණයෙන් ද යුක්ත විය.\n\nආනන්දය, ඒ පොකුණුවලට සතර වර්ණයෙන්ම සෑදූ පඩි හතරක් බැගින් තිබුණි. එනම්, එක් පඩියක් රන්වන් පාටින් ද, එක් පඩියක් රිදීවන් පාටින් ද, එක් පඩියක් වෛඩූර්ය වර්ණයෙන් ද, එක් පඩියක් පළිඟු වර්ණයෙන් ද යුක්ත විය. රන්වන් පඩියේ කුළුණු රන්වන් පාටින් ද, රිදීවන් සූචි හා උණ්හීස ද විය. රිදීවන් පඩියේ කුළුණු රිදීවන් පාටින් ද, රන්වන් සූචි හා උණ්හීස ද විය. වෛඩූර්යමය පඩියේ කුළුණු වෛඩූර්ය වර්ණයෙන් ද, පළිඟුමය සූචි හා උණ්හීස ද විය. පළිඟුමය පඩියේ කුළුණු පළිඟු වර්ණයෙන් ද, වෛඩූර්යමය සූචි හා උණ්හීස ද විය. ආනන්දය, ඒ පොකුණු වැටවල් දෙකකින් වට වී තිබුණි. එක් වැටක් රන්වන් පාටින් ද, අනෙක් වැට රිදීවන් පාටින් ද යුක්ත විය. රන්වන් වැටේ කුළුණු රන්වන් පාටින් ද, රිදීවන් සූචි හා උණ්හීස ද විය. රිදීවන් වැටේ කුළුණු රිදීවන් පාටින් ද, රන්වන් සූචි හා උණ්හීස ද විය.\n\nආනන්දය, ඉක්බිති මහා සුදස්සන රජතුමාට මෙවැනි අදහසක් ඇති විය. ‘මේ පොකුණුවල සෑම ඍතුවකම පිපෙන, සියල්ලන්ටම විවෘත නෙළුම්, ඕලු, කුමුදු, පුණ්ඩරික මල් වවන්නේ නම් යෙහෙකි.’ ආනන්දය, මහා සුදස්සන රජතුමා ඒ පොකුණුවල සෑම ඍතුවකම පිපෙන, සියල්ලන්ටම විවෘත නෙළුම්, ඕලු, කුමුදු, පුණ්ඩරික මල් වගා කරවූහ.",
      "paliTitle": "Dhammapāsādapokkharaṇī",
      "englishTitle": "The Dhamma Palace Pond",
      "sinhalaTitle": "ධම්මපාසාද පොක්කුණ"
    },
    {
      "number": 254,
      "pali": "‘‘Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘yaṃnūnāhaṃ imāsaṃ pokkharaṇīnaṃ tīre nhāpake purise ṭhapeyyaṃ, ye āgatāgataṃ janaṃ nhāpessantī’ti. Ṭhapesi kho, ānanda, rājā mahāsudassano tāsaṃ pokkharaṇīnaṃ tīre nhāpake purise, ye āgatāgataṃ janaṃ nhāpesuṃ. ‘‘Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘yaṃnūnāhaṃ imāsaṃ pokkharaṇīnaṃ tīre evarūpaṃ dānaṃ paṭṭhapeyyaṃ – annaṃ annaṭṭhikassa [annatthitassa (sī. syā. kaṃ. pī.), evaṃ sabbattha pakabhirūpeneva dissati], pānaṃ pānaṭṭhikassa, vatthaṃ vatthaṭṭhikassa, yānaṃ yānaṭṭhikassa, sayanaṃ sayanaṭṭhikassa, itthiṃ itthiṭṭhikassa, hiraññaṃ hiraññaṭṭhikassa, suvaṇṇaṃ suvaṇṇaṭṭhikassā’ti. Paṭṭhapesi kho, ānanda, rājā mahāsudassano tāsaṃ pokkharaṇīnaṃ tīre evarūpaṃ dānaṃ – annaṃ annaṭṭhikassa, pānaṃ pānaṭṭhikassa, vatthaṃ vatthaṭṭhikassa, yānaṃ yānaṭṭhikassa, sayanaṃ sayanaṭṭhikassa, itthiṃ itthiṭṭhikassa, hiraññaṃ hiraññaṭṭhikassa, suvaṇṇaṃ suvaṇṇaṭṭhikassa.",
      "english": "Then, Ānanda, it occurred to King Mahāsudassana: \"I should appoint bath attendants on the banks of these ponds to bathe those who come.\" And so, Ānanda, King Mahāsudassana appointed bath attendants on the banks of those ponds, and they bathed those who came.\n\nThen, Ānanda, it occurred to King Mahāsudassana: \"I should establish a charity on the banks of these ponds, providing food for those who want food, drink for those who want drink, clothing for those who want clothing, vehicles for those who want vehicles, beds for those who want beds, women for those who want women, silver for those who want silver, and gold for those who want gold.\" And so, Ānanda, King Mahāsudassana established such a charity on the banks of those ponds, providing food for those who wanted food, drink for those who wanted drink, clothing for those who wanted clothing, vehicles for those who wanted vehicles, beds for those who wanted beds, women for those who wanted women, silver for those who wanted silver, and gold for those who wanted gold.",
      "sinhala": "ආනන්දය, එකල්හි මහාසුදස්සන රජුට මෙබඳු අදහසක් ඇති විය. ‘මම මේ පොකුණු ඉවුරෙහි ස්නානය කරවන පුරුෂයන් පිරිසක් යොදවන්නෙම් නම්, ඔවුහු එන එන ජනයා ස්නානය කරවන්නාහ’ යි සිතුවේය. ආනන්දය, මහාසුදස්සන රජ ඒ පොකුණු ඉවුරෙහි ස්නානය කරවන පුරුෂයන් යෙදවීය. ඔවුහු පැමිණෙන සියලු දෙනා ස්නානය කරවූහ.\n\nආනන්දය, නැවත මහාසුදස්සන රජුට මෙබඳු අදහසක් ඇති විය. ‘මම මේ පොකුණු ඉවුරෙහි මෙවැනි දානයක් පවත්වන්නෙම් නම් මැනවැ’යි සිතුවේය. එනම්, බත් අවශ්‍ය අයට බත්, පැන් අවශ්‍ය අයට පැන්, වස්ත්‍ර අවශ්‍ය අයට වස්ත්‍ර, යාන වාහන අවශ්‍ය අයට යාන වාහන, සයනයන් අවශ්‍ය අයට සයනයන්, ස්ත්‍රීන් අවශ්‍ය අයට ස්ත්‍රීන්, රිදී අවශ්‍ය අයට රිදී, රන් අවශ්‍ය අයට රන් යන පරිද්දෙනි. ආනන්දය, මහාසුදස්සන රජ ඒ පොකුණු ඉවුරෙහි මෙවැනි දානයක් පැවැත්වූයේ ය. එනම්, බත් අවශ්‍ය අයට බත්, පැන් අවශ්‍ය අයට පැන්, වස්ත්‍ර අවශ්‍ය අයට වස්ත්‍ර, යාන වාහන අවශ්‍ය අයට යාන වාහන, සයනයන් අවශ්‍ය අයට සයනයන්, ස්ත්‍රීන් අවශ්‍ය අයට ස්ත්‍රීන්, රිදී අවශ්‍ය අයට රිදී, රන් අවශ්‍ය අයට රන් පරිත්‍යාග කළේය.",
      "paliTitle": ""
    },
    {
      "number": 255,
      "pali": "‘‘Atha kho, ānanda, brāhmaṇagahapatikā pahūtaṃ sāpateyyaṃ ādāya rājānaṃ mahāsudassanaṃ upasaṅkamitvā evamāhaṃsu – ‘idaṃ, deva, pahūtaṃ sāpateyyaṃ devaññeva uddissa ābhataṃ, taṃ devo paṭiggaṇhatū’ti. ‘Alaṃ bho, mamapidaṃ pahūtaṃ sāpateyyaṃ dhammikena balinā abhisaṅkhataṃ, tañca vo hotu, ito ca bhiyyo harathā’ti. Te raññā paṭikkhittā ekamantaṃ apakkamma evaṃ samacintesuṃ – ‘na kho etaṃ amhākaṃ patirūpaṃ, yaṃ mayaṃ imāni sāpateyyāni punadeva sakāni gharāni paṭihareyyāma. Yaṃnūna mayaṃ rañño mahāsudassanassa nivesanaṃ māpeyyāmā’ti. Te rājānaṃ mahāsudassanaṃ upasaṅkamitvā evamāhaṃsu – ‘nivesanaṃ te deva, māpessāmā’ti. Adhivāsesi kho, ānanda, rājā mahāsudassano tuṇhībhāvena.",
      "english": "Then, Ananda, the brahmins and householders, taking abundant wealth, approached King Mahasudassana and said, 'This abundant wealth, Your Majesty, has been brought solely for you; may Your Majesty accept it.' 'Enough, friends, this abundant wealth of mine has also been acquired through righteous power; let that be for you, and take even more from this.' Being refused by the king, they withdrew to one side and reflected thus: 'It is not proper for us to take this wealth back to our own homes again. What if we were to construct a palace for King Mahasudassana?' They then approached King Mahasudassana and said, 'We will construct a palace for you, Your Majesty.' King Mahasudassana, Ananda, consented by his silence.",
      "sinhala": "ඉතින් ආනන්දයෙනි, බ්‍රාහ්මණ ගෘහපතිවරු මහත් ධන සම්භාරයක් රැගෙන මහා සුදස්සන රජු වෙත එළඹ මෙසේ කීහ: “දේවයන් වහන්ස, මේ මහත් ධන සම්භාරය දේවයන් වහන්සේ උදෙසාම ගෙන එන ලද්දකි. එය දේවයන් වහන්සේ පිළිගන්නා සේක්වා!”\n\n“පින්වත්නි, එපා! මටත් ධර්මානුකූල බලයකින් රැස්කරගත් මහත් ධන සම්භාරයක් ඇත. එය ඔබටම අයිති වේවා! මෙයටත් වඩා ඔබලා රැගෙන යන්න.”\n\nඔවුහු රජු විසින් ප්‍රතික්ෂේප කරනු ලැබ, එකත්පස්ව සිට මෙසේ කල්පනා කළහ: “මේ ධන සම්භාරයන් නැවත අපගේ නිවෙස් කරා ගෙන යාම අපට සුදුසු නැත. කෙසේ හෝ අපි මහා සුදස්සන රජුට මාළිගාවක් කරවමු!”\n\nඔවුහු මහා සුදස්සන රජු වෙත එළඹ මෙසේ කීහ: “දේවයන් වහන්ස, අපි ඔබට මාළිගාවක් තනවා දෙන්නෙමු!”\n\nආනන්දයෙනි, මහා සුදස්සන රජු නිහඬව සිටීමෙන් එයට අවසර දුන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 256,
      "pali": "‘‘Atha kho, ānanda, sakko devānamindo rañño mahāsudassanassa cetasā cetoparivitakkamaññāya vissakammaṃ [visukammaṃ (ka.)] devaputtaṃ āmantesi – ‘ehi tvaṃ, samma vissakamma, rañño mahāsudassanassa nivesanaṃ māpehi dhammaṃ nāma pāsāda’nti. ‘Evaṃ bhaddantavā’ti kho, ānanda, vissakammo devaputto sakkassa devānamindassa paṭissutvā seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya pasāritaṃ vā bāhaṃ samiñjeyya, evameva devesu tāvatiṃsesu antarahito rañño mahāsudassanassa purato pāturahosi. Atha kho, ānanda, vissakammo devaputto rājānaṃ mahāsudassanaṃ etadavoca – ‘nivesanaṃ te deva, māpessāmi dhammaṃ nāma pāsāda’nti. Adhivāsesi kho, ānanda, rājā mahāsudassano tuṇhībhāvena. ‘‘Māpesi kho, ānanda, vissakammo devaputto rañño mahāsudassanassa nivesanaṃ dhammaṃ nāma pāsādaṃ. Dhammo, ānanda, pāsādo puratthimena pacchimena ca yojanaṃ āyāmena ahosi. Uttarena dakkhiṇena ca aḍḍhayojanaṃ vitthārena. Dhammassa, ānanda, pāsādassa tiporisaṃ uccatarena vatthu citaṃ ahosi catunnaṃ vaṇṇānaṃ iṭṭhakāhi – ekā iṭṭhakā sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā. ‘‘Dhammassa, ānanda, pāsādassa caturāsīti thambhasahassāni ahesuṃ catunnaṃ vaṇṇānaṃ – eko thambho sovaṇṇamayo, eko rūpiyamayo, eko veḷuriyamayo, eko phalikamayo. Dhammo, ānanda, pāsādo catunnaṃ vaṇṇānaṃ phalakehi santhato ahosi – ekaṃ phalakaṃ sovaṇṇamayaṃ, ekaṃ rūpiyamayaṃ, ekaṃ veḷuriyamayaṃ, ekaṃ phalikamayaṃ. ‘‘Dhammassa, ānanda, pāsādassa catuvīsati sopānāni ahesuṃ catunnaṃ vaṇṇānaṃ – ekaṃ sopānaṃ sovaṇṇamayaṃ, ekaṃ rūpiyamayaṃ, ekaṃ veḷuriyamayaṃ, ekaṃ phalikamayaṃ. Sovaṇṇamayassa sopānassa sovaṇṇamayā thambhā ahesuṃ rūpiyamayā sūciyo ca uṇhīsañca. Rūpiyamayassa sopānassa rūpiyamayā thambhā ahesuṃ sovaṇṇamayā sūciyo ca uṇhīsañca. Veḷuriyamayassa sopānassa veḷuriyamayā thambhā ahesuṃ phalikamayā sūciyo ca uṇhīsañca. Phalikamayassa sopānassa phalikamayā thambhā ahesuṃ veḷuriyamayā sūciyo ca uṇhīsañca. ‘‘Dhamme, ānanda, pāsāde caturāsīti kūṭāgārasahassāni ahesuṃ catunnaṃ vaṇṇānaṃ – ekaṃ kūṭāgāraṃ sovaṇṇamayaṃ, ekaṃ rūpiyamayaṃ, ekaṃ veḷuriyamayaṃ, ekaṃ phalikamayaṃ. Sovaṇṇamaye kūṭāgāre rūpiyamayo pallaṅko paññatto ahosi, rūpiyamaye kūṭāgāre sovaṇṇamayo pallaṅko paññatto ahosi, veḷuriyamaye kūṭāgāre dantamayo pallaṅko paññatto ahosi, phalikamaye kūṭāgāre sāramayo pallaṅko paññatto ahosi. Sovaṇṇamayassa kūṭāgārassa dvāre rūpiyamayo tālo ṭhito ahosi, tassa rūpiyamayo khandho sovaṇṇamayāni pattāni ca phalāni ca. Rūpiyamayassa kūṭāgārassa dvāre sovaṇṇamayo tālo ṭhito ahosi, tassa sovaṇṇamayo khandho, rūpiyamayāni pattāni ca phalāni ca. Veḷuriyamayassa kūṭāgārassa dvāre phalikamayo tālo ṭhito ahosi, tassa phalikamayo khandho, veḷuriyamayāni pattāni ca phalāni ca. Phalikamayassa kūṭāgārassa dvāre veḷuriyamayo tālo ṭhito ahosi, tassa veḷuriyamayo khandho, phalikamayāni pattāni ca phalāni ca.",
      "english": "Then, Ananda, Sakka, king of the devas, knowing by his mind the thoughts of King Mahāsudassana, addressed the deva-son Vissakamma, saying, ‘Come, friend Vissakamma, construct a residence for King Mahāsudassana, a palace named Dhamma.’ ‘Yes, noble sir,’ Ananda, the deva-son Vissakamma, having assented to Sakka, king of the devas, vanished from among the Tāvatiṃsa devas and appeared before King Mahāsudassana, just as a strong man might extend a flexed arm or flex an extended arm. Then, Ananda, the deva-son Vissakamma said to King Mahāsudassana, ‘Your Majesty, I shall construct a residence for you, a palace named Dhamma.’ Ananda, King Mahāsudassana assented by his silence.\n\nAnanda, the deva-son Vissakamma constructed for King Mahāsudassana a residence, a palace named Dhamma. Ananda, the Dhamma Palace was a league in length from east to west and half a league in width from north to south. Ananda, the foundation of the Dhamma Palace was built up to a height of three men's lengths with bricks of four kinds: one brick was of gold, one of silver, one of cat's eye gem, and one of crystal.\n\nAnanda, the Dhamma Palace had eighty-four thousand pillars of four kinds: one pillar was of gold, one of silver, one of cat's eye gem, and one of crystal. Ananda, the Dhamma Palace was covered with planks of four kinds: one plank was of gold, one of silver, one of cat's eye gem, and one of crystal.\n\nAnanda, the Dhamma Palace had twenty-four staircases of four kinds: one staircase was of gold, one of silver, one of cat's eye gem, and one of crystal. For the golden staircase, there were golden pillars with silver cross-bars and capitals. For the silver staircase, there were silver pillars with golden cross-bars and capitals. For the cat's eye gem staircase, there were cat's eye gem pillars with crystal cross-bars and capitals. For the crystal staircase, there were crystal pillars with cat's eye gem cross-bars and capitals. Ananda, in the Dhamma Palace there were eighty-four thousand pinnacled chambers of four kinds: one pinnacled chamber was of gold, one of silver, one of cat's eye gem, and one of crystal. In the golden pinnacled chamber, a silver couch was arranged; in the silver pinnacled chamber, a golden couch was arranged; in the cat's eye gem pinnacled chamber, an ivory couch was arranged; in the crystal pinnacled chamber, a couch of heartwood was arranged. At the door of the golden pinnacled chamber, a silver palm tree stood, its trunk of silver, its leaves and fruits of gold. At the door of the silver pinnacled chamber, a golden palm tree stood, its trunk of gold, its leaves and fruits of silver. At the door of the cat's eye gem pinnacled chamber, a crystal palm tree stood, its trunk of crystal, its leaves and fruits of cat's eye gem. At the door of the crystal pinnacled chamber, a cat's eye gem palm tree stood, its trunk of cat's eye gem, its leaves and fruits of crystal.",
      "sinhala": "ආනන්දය, අනතුරුව දෙවියන්ගේ අධිපති වූ සක්‍රයා මහාසුදස්සන රජුගේ සිතේ ඇති කල්පනාව දැන, විශ්වකර්ම නම් දෙව්පුත්‍රයාට කතා කොට, ‘මිත්‍ර විශ්වකර්මය, ඔබ මහාසුදස්සන රජුට ධම්ම නම් ප්‍රාසාදයක් ගොඩනඟන්න’යි කීවේය. ආනන්දය, විශ්වකර්ම නම් දෙව්පුත්‍රයා ‘එසේය, ස්වාමීනි’යි සක්‍ර දෙවියන් හට පිළිතුරු දී, බලවත් පුරුෂයෙක් හැකිළු අතක් දිගු කරන්නාක් මෙන් හෝ දිගු කළ අතක් හකුළුවන්නාක් මෙන්, ක්ෂණයකින් තව්තිසා දෙව්ලොවින් අතුරුදහන් වී මහාසුදස්සන රජු ඉදිරියේ පෙනී සිටියේය. ඉක්බිති විශ්වකර්ම නම් දෙව්පුත්‍රයා මහාසුදස්සන රජුට, ‘දේවයන් වහන්ස, මම ඔබට ධම්ම නම් ප්‍රාසාදයක් ගොඩනඟා දෙන්නෙමි’යි කීවේය. මහාසුදස්සන රජතුමා නිශ්ශබ්දව සිටීමෙන් එය අනුමත කළේය.\n\nආනන්දය, විශ්වකර්ම නම් දෙව්පුත්‍රයා මහාසුදස්සන රජු වෙනුවෙන් ධම්ම නම් ප්‍රාසාදය ගොඩනැගුවේය. ආනන්දය, ඒ ධම්ම ප්‍රාසාදය නැගෙනහිර සිට බටහිරට යොදුනක් දිග වූ අතර උතුරේ සිට දකුණට අඩ යොදුනක් පළල විය. ආනන්දය, ධම්ම ප්‍රාසාදයේ අත්තිවාරම පුරුෂයන් තිදෙනෙකුගේ උස ප්‍රමාණයට සිව් වර්ණයෙන් යුතු ගඩොලින් නිමවා තිබුණි. එනම්, එක් ගඩොලක් රන්වන් පාටින්ද, අනෙක් ගඩොල රිදීවන් පාටින්ද, තවත් ගඩොලක් වෛදූර්ය වර්ණයෙන්ද, අනික් ගඩොල ස්ඵටික වර්ණයෙන්ද යුක්ත විය.\n\nආනන්දය, ධම්ම ප්‍රාසාදයේ සිව් වර්ණයෙන් යුතු කණු අසූහාර දහසක් තිබුණි. එනම්, එක් කණුවක් රන්වන් පාටින්ද, අනෙක් කණුව රිදීවන් පාටින්ද, තවත් කණුවක් වෛදූර්ය වර්ණයෙන්ද, අනික් කණුව ස්ඵටික වර්ණයෙන්ද යුක්ත විය. ආනන්දය, ධම්ම ප්‍රාසාදය සිව් වර්ණයෙන් යුතු ලෑලි වලින් අතුරා තිබුණි. එනම්, එක් ලෑල්ලක් රන්වන් පාටින්ද, අනෙක් ලෑල්ල රිදීවන් පාටින්ද, තවත් ලෑල්ලක් වෛදූර්ය වර්ණයෙන්ද, අනික් ලෑල්ල ස්ඵටික වර්ණයෙන්ද යුක්ත විය.\n\nආනන්දය, ධම්ම ප්‍රාසාදයේ සිව් වර්ණයෙන් යුතු පඩි විසි හතරක් තිබුණි. එනම්, එක් පඩියක් රන්වන් පාටින්ද, අනෙක් පඩිය රිදීවන් පාටින්ද, තවත් පඩියක් වෛදූර්ය වර්ණයෙන්ද, අනික් පඩිය ස්ඵටික වර්ණයෙන්ද යුක්ත විය. රන්වන් පඩියට රන්වන් කණුද, රිදීවන් සූචි හා උෂ්ණීෂද විය. රිදීවන් පඩියට රිදීවන් කණුද, රන්වන් සූචි හා උෂ්ණීෂද විය. වෛදූර්යමය පඩියට වෛදූර්යමය කණුද, ස්ඵටිකමය සූචි හා උෂ්ණීෂද විය. ස්ඵටිකමය පඩියට ස්ඵටිකමය කණුද, වෛදූර්යමය සූචි හා උෂ්ණීෂද විය.\n\nආනන්දය, ධම්ම ප්‍රාසාදයේ සිව් වර්ණයෙන් යුතු කූටාගාර අසූහාර දහසක් තිබුණි. එනම්, එක් කූටාගාරයක් රන්වන් පාටින්ද, අනෙක් කූටාගාරය රිදීවන් පාටින්ද, තවත් කූටාගාරයක් වෛදූර්ය වර්ණයෙන්ද, අනික් කූටාගාරය ස්ඵටික වර්ණයෙන්ද යුක්ත විය. රන්වන් කූටාගාරයේ රිදීවන් පළඟක් තබා තිබුණි. රිදීවන් කූටාගාරයේ රන්වන් පළඟක් තබා තිබුණි. වෛදූර්යමය කූටාගාරයේ ඇත්දත් පළඟක් තබා තිබුණි. ස්ඵටිකමය කූටාගාරයේ සාර දැවයෙන් කළ පළඟක් තබා තිබුණි. රන්වන් කූටාගාරයේ දොරටුවේ රිදීවන් තල් ගසක් සිටුවා තිබුණි. එහි රිදීවන් කඳෙහි රන්වන් කොළ හා ගෙඩි විය. රිදීවන් කූටාගාරයේ දොරටුවේ රන්වන් තල් ගසක් සිටුවා තිබුණි. එහි රන්වන් කඳෙහි රිදීවන් කොළ හා ගෙඩි විය. වෛදූර්යමය කූටාගාරයේ දොරටුවේ ස්ඵටිකමය තල් ගසක් සිටුවා තිබුණි. එහි ස්ඵටිකමය කඳෙහි වෛදූර්යමය කොළ හා ගෙඩි විය. ස්ඵටිකමය කූටාගාරයේ දොරටුවේ වෛදූර්යමය තල් ගසක් සිටුවා තිබුණි. එහි වෛදූර්යමය කඳෙහි ස්ඵටිකමය කොළ හා ගෙඩි විය.",
      "paliTitle": ""
    },
    {
      "number": 257,
      "pali": "‘‘Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘yaṃnūnāhaṃ mahāviyūhassa kūṭāgārassa dvāre sabbasovaṇṇamayaṃ tālavanaṃ māpeyyaṃ, yattha divāvihāraṃ nisīdissāmī’ti. Māpesi kho, ānanda, rājā mahāsudassano mahāviyūhassa kūṭāgārassa dvāre sabbasovaṇṇamayaṃ tālavanaṃ, yattha divāvihāraṃ nisīdi. Dhammo, ānanda, pāsādo dvīhi vedikāhi parikkhitto ahosi, ekā vedikā sovaṇṇamayā, ekā rūpiyamayā. Sovaṇṇamayāya vedikāya sovaṇṇamayā thambhā ahesuṃ, rūpiyamayā sūciyo ca uṇhīsañca. Rūpiyamayāya vedikāya rūpiyamayā thambhā ahesuṃ, sovaṇṇamayā sūciyo ca uṇhīsañca.",
      "english": "Then, Ānanda, King Mahāsudassana thought: ‘I should have an entirely golden palm grove made at the entrance of the Great Array Pavilion, where I can sit and relax during the day.’ And so, Ānanda, King Mahāsudassana had an entirely golden palm grove made at the entrance of the Great Array Pavilion, where he would sit and relax during the day.\n\nThe Dhamma Palace, Ānanda, was surrounded by two railings: one golden and one silver. The golden railing had golden pillars with silver pinnacles and coping. The silver railing had silver pillars with golden pinnacles and coping.",
      "sinhala": "‘‘ආනන්ද, අනතුරුව මහාසුදස්සන රජුට මෙවැනි අදහසක් ඇති විය. ‘මා විසින් මහා වියූහ නම් වූ ප්‍රාසාදයේ දොරටුව අසල සම්පූර්ණයෙන්ම රනින් කළ තල් වනයක් කරවනු ලබන්නේ නම් මැනව. එහි මම දහවල් කාලයෙහි විවේක සුවයෙන් වාසය කරමි’ යනුවෙනි. ආනන්ද, මහාසුදස්සන රජු මහා වියූහ නම් වූ ප්‍රාසාදයේ දොරටුව අසල සම්පූර්ණයෙන්ම රනින් කළ තල් වනයක් කරවූයේ, එහි දහවල් කාලයෙහි විවේක සුවයෙන් වාසය කිරීම සඳහා ය.\n\nආනන්ද, ධම්ම නම් වූ ප්‍රාසාදය වේදිකා දෙකකින් වට වී තිබුණි. එක් වේදිකාවක් රන්වන් වූ අතර අනෙක් වේදිකාව රිදීවන් විය. රන්වන් වේදිකාවෙහි රන්වන් කුළුණු ද, රිදීවන් සූචි හා උච්චි ද විය. රිදීවන් වේදිකාවෙහි රිදීවන් කුළුණු ද, රන්වන් සූචි හා උච්චි ද විය.’’",
      "paliTitle": ""
    },
    {
      "number": 258,
      "pali": "‘‘Dhammo, ānanda, pāsādo dvīhi kiṅkiṇikajālehi [kiṅkaṇikajālehi (syā. ka.)] parikkhitto ahosi – ekaṃ jālaṃ sovaṇṇamayaṃ ekaṃ rūpiyamayaṃ. Sovaṇṇamayassa jālassa rūpiyamayā kiṅkiṇikā ahesuṃ, rūpiyamayassa jālassa sovaṇṇamayā kiṅkiṇikā ahesuṃ. Tesaṃ kho panānanda, kiṅkiṇikajālānaṃ vāteritānaṃ saddo ahosi vaggu ca rajanīyo ca khamanīyo ca madanīyo ca. Seyyathāpi, ānanda, pañcaṅgikassa tūriyassa suvinītassa suppaṭitāḷitassa sukusalehi [kusalehi (sī. syā. kaṃ. pī.)] samannāhatassa saddo hoti, vaggu ca rajanīyo ca khamanīyo ca madanīyo ca, evameva kho, ānanda, tesaṃ kiṅkiṇikajālānaṃ vāteritānaṃ saddo ahosi vaggu ca rajanīyo ca khamanīyo ca madanīyo ca. Ye kho panānanda, tena samayena kusāvatiyā rājadhāniyā dhuttā ahesuṃ soṇḍā pipāsā, te tesaṃ kiṅkiṇikajālānaṃ vāteritānaṃ saddena paricāresuṃ. Niṭṭhito kho panānanda, dhammo pāsādo duddikkho ahosi musati cakkhūni. Seyyathāpi, ānanda, vassānaṃ pacchime māse saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno [abbhuggamamāno (sī. pī. ka.)] duddikkho [dudikkho (pī.)] hoti musati cakkhūni; evameva kho, ānanda, dhammo pāsādo duddikkho ahosi musati cakkhūni.",
      "english": "The Dhamma Palace, Ananda, was enclosed by two nets of small bells: one net was made of gold, the other of silver. The golden net had silver bells, and the silver net had golden bells. When stirred by the wind, the sound of these bell-nets, Ananda, was pleasing, delightful, agreeable, and intoxicating. Just as the sound of a well-trained, skillfully played five-piece orchestra is pleasing, delightful, agreeable, and intoxicating, so too was the sound of these bell-nets when stirred by the wind. At that time in the royal capital of Kusavati, the dissipated, drunken, and thirsty rogues would amuse themselves with the sound of these bell-nets in the wind. When completed, the Dhamma Palace was so dazzling it hurt the eyes. Just as the sun rising in the clear, cloudless autumn sky during the last month of the rainy season is dazzling and hurts the eyes, so too was the Dhamma Palace dazzling and hurt the eyes.",
      "sinhala": "ආනන්දයෙනි, ධම්ම නම් ප්‍රාසාදය කිංකිණි ජාල දෙකකින් වට වී තිබුණි. එක ජාලයක් රන්වන් වූ අතර අනෙක රිදීවන් විය. රන් ජාලයේ රිදී කිංකිණි ද, රිදී ජාලයේ රන් කිංකිණි ද විය. ආනන්දයෙනි, සුළඟින් සෙලවෙන ඒ කිංකිණි ජාලවලින් නැඟෙන හඬ මිහිරි, සිත් ඇදගන්නා සුළු, ප්‍රියමනාප මෙන්ම මදනීය ද විය. ආනන්දයෙනි, මනා ලෙස පුහුණු කරන ලද, මනා ලෙස වාදනය කරන ලද, දක්ෂයින් විසින් යුක්ත වූ පංචාංගික සංගීත භාණ්ඩයකින් නැඟෙන හඬ මෙන් එය මිහිරි, සිත් ඇදගන්නා සුළු, ප්‍රියමනාප මෙන්ම මදනීය විය. ආනන්දයෙනි, ඒ කාලයේ කුසාවතී නුවර විසූ සූදූවන්, බේබද්දන් හා පිපාසිත අය ඒ සුළඟින් සෙලවෙන කිංකිණි ජාලවල හඬින් සතුටු වූහ. ආනන්දයෙනි, නිම කරන ලද ධම්ම නම් ප්‍රාසාදය දෙස බැලීමට අපහසු වූ අතර එය ඇස්වලට වේදනාවක් ගෙන දුන්නේය. ආනන්දයෙනි, වස්සාන කාලය අවසානයේ, සරත් සෘතුවේ වලාකුළු රහිත පැහැදිලි අහසෙහි ඉහළට නැඟෙන හිරු දෙස බැලීමට අපහසු වන්නා සේම, එය ඇස්වලට වේදනාවක් ගෙන දෙන්නා සේම, ආනන්දයෙනි, ධම්ම නම් ප්‍රාසාදය දෙස බැලීමට අපහසු වූ අතර එය ඇස්වලට වේදනාවක් ගෙන දුන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 259,
      "pali": "‘‘Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘yaṃnūnāhaṃ dhammassa pāsādassa purato dhammaṃ nāma pokkharaṇiṃ māpeyya’nti. Māpesi kho, ānanda, rājā mahāsudassano dhammassa pāsādassa purato dhammaṃ nāma pokkharaṇiṃ. Dhammā, ānanda, pokkharaṇī puratthimena pacchimena ca yojanaṃ āyāmena ahosi, uttarena dakkhiṇena ca aḍḍhayojanaṃ vitthārena. Dhammā, ānanda, pokkharaṇī catunnaṃ vaṇṇānaṃ iṭṭhakāhi citā ahosi – ekā iṭṭhakā sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā. ‘‘Dhammāya, ānanda, pokkharaṇiyā catuvīsati sopānāni ahesuṃ catunnaṃ vaṇṇānaṃ – ekaṃ sopānaṃ sovaṇṇamayaṃ, ekaṃ rūpiyamayaṃ, ekaṃ veḷuriyamayaṃ, ekaṃ phalikamayaṃ. Sovaṇṇamayassa sopānassa sovaṇṇamayā thambhā ahesuṃ rūpiyamayā sūciyo ca uṇhīsañca. Rūpiyamayassa sopānassa rūpiyamayā thambhā ahesuṃ sovaṇṇamayā sūciyo ca uṇhīsañca. Veḷuriyamayassa sopānassa veḷuriyamayā thambhā ahesuṃ phalikamayā sūciyo ca uṇhīsañca. Phalikamayassa sopānassa phalikamayā thambhā ahesuṃ veḷuriyamayā sūciyo ca uṇhīsañca. ‘‘Dhammā, ānanda, pokkharaṇī dvīhi vedikāhi parikkhittā ahosi – ekā vedikā sovaṇṇamayā, ekā rūpiyamayā. Sovaṇṇamayāya vedikāya sovaṇṇamayā thambhā ahesuṃ rūpiyamayā sūciyo ca uṇhīsañca. Rūpiyamayāya vedikāya rūpiyamayā thambhā ahesuṃ sovaṇṇamayā sūciyo ca uṇhīsañca. ‘‘Dhammā, ānanda, pokkharaṇī sattahi tālapantīhi parikkhittā ahosi – ekā tālapanti sovaṇṇamayā, ekā rūpiyamayā, ekā veḷuriyamayā, ekā phalikamayā, ekā lohitaṅkamayā, ekā masāragallamayā, ekā sabbaratanamayā. Sovaṇṇamayassa tālassa sovaṇṇamayo khandho ahosi rūpiyamayāni pattāni ca phalāni ca. Rūpiyamayassa tālassa rūpiyamayo khandho ahosi sovaṇṇamayāni pattāni ca phalāni ca. Veḷuriyamayassa tālassa veḷuriyamayo khandho ahosi phalikamayāni pattāni ca phalāni ca. Phalikamayassa tālassa phalikamayo khandho ahosi veḷuriyamayāni pattāni ca phalāni ca. Lohitaṅkamayassa tālassa lohitaṅkamayo khandho ahosi masāragallamayāni pattāni ca phalāni ca. Masāragallamayassa tālassa masāragallamayo khandho ahosi lohitaṅkamayāni pattāni ca phalāni ca. Sabbaratanamayassa tālassa sabbaratanamayo khandho ahosi, sabbaratanamayāni pattāni ca phalāni ca. Tāsaṃ kho panānanda, tālapantīnaṃ vāteritānaṃ saddo ahosi, vaggu ca rajanīyo ca khamanīyo ca madanīyo ca. Seyyathāpi, ānanda, pañcaṅgikassa tūriyassa suvinītassa suppaṭitāḷitassa sukusalehi samannāhatassa saddo hoti vaggu ca rajanīyo ca khamanīyo ca madanīyo ca, evameva kho, ānanda, tāsaṃ tālapantīnaṃ vāteritānaṃ saddo ahosi vaggu ca rajanīyo ca khamanīyo ca madanīyo ca. Ye kho panānanda, tena samayena kusāvatiyā rājadhāniyā dhuttā ahesuṃ soṇḍā pipāsā, te tāsaṃ tālapantīnaṃ vāteritānaṃ saddena paricāresuṃ. ‘‘Niṭṭhite kho panānanda, dhamme pāsāde niṭṭhitāya dhammāya ca pokkharaṇiyā rājā mahāsudassano ‘ye [ye ko panānanda (syā. ka.)] tena samayena samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā’, te sabbakāmehi santappetvā dhammaṃ pāsādaṃ abhiruhi. Paṭhamabhāṇavāro.",
      "english": "Then, Ānanda, the thought occurred to King Mahāsudassana: 'I should have a lotus pond named Dhamma constructed in front of the Dhamma Palace.' So, Ānanda, King Mahāsudassana had a lotus pond named Dhamma constructed in front of the Dhamma Palace. This Dhamma lotus pond, Ānanda, was one league long from east to west and half a league wide from north to south. The Dhamma lotus pond, Ānanda, was built with bricks of four colours: one brick of gold, one of silver, one of beryl, and one of crystal.\n\nThe Dhamma lotus pond, Ānanda, had twenty-four staircases, consisting of four types of materials: one of gold, one of silver, one of beryl, and one of crystal. The golden staircase had golden pillars with silver crossbars and coping stones. The silver staircase had silver pillars with golden crossbars and coping stones. The beryl staircase had beryl pillars with crystal crossbars and coping stones. The crystal staircase had crystal pillars with beryl crossbars and coping stones.\n\nThe Dhamma lotus pond, Ānanda, was surrounded by two railings: one railing of gold and one of silver. The golden railing had golden pillars with silver crossbars and coping stones. The silver railing had silver pillars with golden crossbars and coping stones.\n\nThe Dhamma lotus pond, Ānanda, was surrounded by seven rows of palm trees: one row of gold, one of silver, one of beryl, one of crystal, one of ruby, one of red coral, and one of all kinds of gems. The golden palm tree had a golden trunk with silver leaves and silver fruits. The silver palm tree had a silver trunk with golden leaves and golden fruits. The beryl palm tree had a beryl trunk with crystal leaves and crystal fruits. The crystal palm tree had a crystal trunk with beryl leaves and beryl fruits. The ruby palm tree had a ruby trunk with red coral leaves and red coral fruits. The red coral palm tree had a red coral trunk with ruby leaves and ruby fruits. The palm tree of all kinds of gems had a trunk, leaves, and fruits all made of every kind of gem. And when those rows of palm trees were stirred by the wind, Ānanda, they made a sound that was lovely, delightful, pleasing, and intoxicating. Just as the sound of a well-tuned five-piece orchestra, expertly played, is lovely, delightful, pleasing, and intoxicating, so too, Ānanda, was the sound of those rows of palm trees when stirred by the wind: lovely, delightful, pleasing, and intoxicating. And at that time, Ānanda, the rogues, drunkards, and those parched with thirst in the royal capital of Kusāvati indulged themselves in the sound of those rows of palm trees swaying in the wind.\n\nNow, Ānanda, when the Dhamma Palace and the Dhamma lotus pond were completed, King Mahāsudassana, having satisfied with all their desires those who were considered ascetics among ascetics, or brahmins among brahmins at that time, ascended the Dhamma Palace.",
      "sinhala": "අනඳ, එවේලෙහි මහාසුදස්සන රජුට මේ අදහස ඇතිවිය: ‘මම ධර්ම ප්‍රාසාදය ඉදිරිපිට ධර්ම නම් පොකුණක් සාදවා නම් හොඳ යැ’යි. අනඳ, මහාසුදස්සන රජු ධර්ම ප්‍රාසාදය ඉදිරිපිට ධර්ම නම් පොකුණක් සාදවීය. අනඳ, ඒ ධර්ම නම් පොකුණ නැගෙනහිරින් බටහිරට යොදුනක් දිග වූයේය. උතුරින් දකුණට අඩ යොදුනක් පළල වූයේය. අනඳ, ඒ ධර්ම නම් පොකුණ සිව්වණක් ගඩොලින් බැඳ තිබුණේය. එක් ගඩොලක් රනින් වූයේය, එක් ගඩොලක් රිදින් වූයේය, එක් ගඩොලක් වෛවූරිය මැණිකින් වූයේය, එක් ගඩොලක් පළිඟු මැණිකින් වූයේය.\n\nඅනඳ, ඒ ධර්ම පොකුණෙහි සිව්වණක් පඩිපෙල් විසිහතරක් වූයේය. එක් පඩිපෙලක් රනින් වූයේය, එක් පඩිපෙලක් රිදින් වූයේය, එක් පඩිපෙලක් වෛවූරිය මැණිකින් වූයේය, එක් පඩිපෙලක් පළිඟු මැණිකින් වූයේය. රන් පඩිපෙලෙහි රන් කුළුණු ද රිදී අගුළු ද ඉහත්තල ද විය. රිදී පඩිපෙලෙහි රිදී කුළුණු ද රන් අගුළු ද ඉහත්තල ද විය. වෛවූරිය මැණික් පඩිපෙලෙහි වෛවූරිය මැණික් කුළුණු ද පළිඟු අගුළු ද ඉහත්තල ද විය. පළිඟු මැණික් පඩිපෙලෙහි පළිඟු මැණික් කුළුණු ද වෛවූරිය මැණික් අගුළු ද ඉහත්තල ද විය.\n\nඅනඳ, ඒ ධර්ම පොකුණ දෙවණක් වූ වේදිකාවලින් වටව තිබුණේය. එක් වේදිකාවක් රනින් වූයේය, එක් වේදිකාවක් රිදින් වූයේය. රන් වේදිකාවෙහි රන් කුළුණු ද රිදී අගුළු ද ඉහත්තල ද විය. රිදී වේදිකාවෙහි රිදී කුළුණු ද රන් අගුළු ද ඉහත්තල ද විය.\n\nඅනඳ, ඒ ධර්ම පොකුණ සත් වණක් තල් ගස් පේළිවලින් වටව තිබුණේය. එක් තල් ගස් පේළියක් රනින් වූයේය, එක් පේළියක් රිදින් වූයේය, එක් පේළියක් වෛවූරිය මැණිකින් වූයේය, එක් පේළියක් පළිඟු මැණිකින් වූයේය, එක් පේළියක් ලෝහිතංක මැණිකින් වූයේය, එක් පේළියක් මසාරගල්ල මැණිකින් වූයේය, එක් පේළියක් සියලු මැණික්වලින් වූයේය. රන් තල් ගසෙහි රන් කඳ ද රිදී පත් ද ඵල ද විය. රිදී තල් ගසෙහි රිදී කඳ ද රන් පත් ද ඵල ද විය. වෛවූරිය මැණික් තල් ගසෙහි වෛවූරිය මැණික් කඳ ද පළිඟු පත් ද ඵල ද විය. පළිඟු මැණික් තල් ගසෙහි පළිඟු මැණික් කඳ ද වෛවූරිය මැණික් පත් ද ඵල ද විය. ලෝහිතංක මැණික් තල් ගසෙහි ලෝහිතංක මැණික් කඳ ද මසාරගල්ල මැණික් පත් ද ඵල ද විය. මසාරගල්ල මැණික් තල් ගසෙහි මසාරගල්ල මැණික් කඳ ද ලෝහිතංක මැණික් පත් ද ඵල ද විය. සියලු මැණික් තල් ගසෙහි සියලු මැණික් කඳ ද සියලු මැණික් පත් ද ඵල ද විය. අනඳ, ඒ තල් ගස් පේළි සුළඟින් සැලෙන කල්හි මනහර වූ, සිත් අලවන, ප්‍රියජනක වූ, මත්කරවන හඬක් විය. අනඳ, යම්සේ මනා කොට පුහුණු කරන ලද, මනා කොට ගයන ලද, දක්ෂ ශිල්පීන් විසින් මනා කොට නාද කරන ලද පංචාංගික තූර්යයක ශබ්දය මනහර ද, සිත් අලවන සුළු ද, ප්‍රියජනක ද, මත්කරවන සුළු ද, එසේම අනඳ, ඒ තල් ගස් පේළි සුළඟින් සැලෙන කල්හි මනහර වූ, සිත් අලවන, ප්‍රියජනක වූ, මත්කරවන හඬක් විය. අනඳ, ඒ සමයෙහි කුසාවතී රාජධානියෙහි යම් මත්පැන් බොන්නා වූ, පිපාසිත වූ ධූර්තයෝ වූවාහු ද, ඔවුහු ඒ තල් ගස් පේළිවල සුළඟින් සැලෙන ශබ්දයෙන් මත් වූහ.\n\nඅනඳ, ධර්ම ප්‍රාසාදය නිම වූ කල්හි, ධර්ම පොකුණ ද නිම වූ කල්හි, මහාසුදස්සන රජු, ඒ සමයෙහි යම් මහණ දම්හි පිහිටි මහණ සේ සැලකූ, හෝ බමුණු දම්හි පිහිටි බමුණු සේ සැලකූ අය වූවාහු ද, ඔවුනට සියලු කාම සම්පත්වලින් සතුටු කරවා ධර්ම ප්‍රාසාදයට නැංගේය.",
      "paliTitle": ""
    },
    {
      "number": 260,
      "pali": "‘‘Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘kissa nu kho me idaṃ kammassa phalaṃ kissa kammassa vipāko, yenāhaṃ etarahi evaṃmahiddhiko evaṃmahānubhāvo’ti? Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘tiṇṇaṃ kho me idaṃ kammānaṃ phalaṃ tiṇṇaṃ kammānaṃ vipāko, yenāhaṃ etarahi evaṃmahiddhiko evaṃmahānubhāvo, seyyathidaṃ dānassa damassa saṃyamassā’ti. ‘‘Atha kho, ānanda, rājā mahāsudassano yena mahāviyūhaṃ kūṭāgāraṃ tenupasaṅkami; upasaṅkamitvā mahāviyūhassa kūṭāgārassa dvāre ṭhito udānaṃ udānesi – ‘tiṭṭha, kāmavitakka, tiṭṭha, byāpādavitakka, tiṭṭha, vihiṃsāvitakka. Ettāvatā kāmavitakka, ettāvatā byāpādavitakka, ettāvatā vihiṃsāvitakkā’ti.",
      "english": "Then, Ananda, it occurred to King Mahāsudassana: ‘Of what deed is this the fruit for me? Of what deed is this the result, that I am now so mighty, so powerful?’ Then, Ananda, it occurred to King Mahāsudassana: ‘This is indeed the fruit for me of three deeds, the result of three deeds, by which I am now so mighty, so powerful, namely, of generosity, self-control, and restraint.’\n\nThen, Ananda, King Mahāsudassana approached the Great Arrayed Mansion. Having approached, and standing at the door of the Great Arrayed Mansion, he uttered an inspired utterance: ‘Stand still, thought of sensual desire! Stand still, thought of ill-will! Stand still, thought of harm! So far, thought of sensual desire! So far, thought of ill-will! So far, thought of harm!’",
      "sinhala": "එවිට ආනන්දයෙනි, මහාසුදස්සන රජුට මෙවැනි සිතක් පහළ විය: ‘යම් හෙයකින් මම දැන් මෙසේ මහත් ඍද්ධිමත්ව, මහත් ආනුභාව සම්පන්නව සිටින්නෙම්ද, මේ කුමන කර්මයක ඵලයක්ද, කුමන කර්මයක විපාකයක්ද?’\nඑවිට ආනන්දයෙනි, මහාසුදස්සන රජුට මෙවැනි සිතක් පහළ විය: ‘යම් හෙයකින් මම දැන් මෙසේ මහත් ඍද්ධිමත්ව, මහත් ආනුභාව සම්පන්නව සිටින්නෙම්ද, මෙය මාගේ කර්ම තුනක ඵලයක් සහ කර්ම තුනක විපාකයක් වන්නේය. ඒ කර්ම තුන නම්: දානය, දමනය සහ සංයමය වේ.’\nඑවිට ආනන්දයෙනි, මහාසුදස්සන රජු මහා ප්‍රාසාදය වෙත එළඹියේය. එළඹ, මහා ප්‍රාසාදයේ දොරටුව අසල සිටගෙන, මේ උදානය පැවසුවේය: ‘කාමවිතර්කය, නවතිනු! ව්‍යාපාදවිතර්කය, නවතිනු! විහිංසාවිතර්කය, නවතිනු! කාමවිතර්කය, මෙතෙකින් අවසන් වේවා! ව්‍යාපාදවිතර්කය, මෙතෙකින් අවසන් වේවා! විහිංසාවිතර්කය, මෙතෙකින් අවසන් වේවා!’",
      "paliTitle": "Jhānasampatti",
      "englishTitle": "Attainment of the Jhanas",
      "sinhalaTitle": "ඣාන සම්පත්තිය"
    },
    {
      "number": 261,
      "pali": "‘‘Atha kho, ānanda, rājā mahāsudassano mahāviyūhaṃ kūṭāgāraṃ pavisitvā sovaṇṇamaye pallaṅke nisinno vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja vihāsi. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihāsi. Pītiyā ca virāgā upekkhako ca vihāsi, sato ca sampajāno sukhañca kāyena paṭisaṃvedesi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja vihāsi. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja vihāsi.",
      "english": "Then, Ānanda, King Mahāsudassana, having entered the Great Array Hall and sat on a golden couch, quite secluded from sense pleasures and unwholesome states, entered and remained in the first jhāna, which is accompanied by applied and sustained thought, born of seclusion, and filled with rapture and pleasure. With the subsiding of applied and sustained thought, and with inner tranquility and unification of mind, he entered and remained in the second jhāna, which is without applied and sustained thought, born of concentration, and filled with rapture and pleasure. With the fading away of rapture, remaining equanimous, mindful, and clearly comprehending, he experienced in his body that pleasure of which the Noble Ones declare, \"Equanimous and mindful, he dwells in pleasure.\" He then entered and remained in the third jhāna. With the abandoning of pleasure and pain, and the previous disappearance of joy and sorrow, he entered and remained in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness.",
      "sinhala": "එවිට ආනන්දයෙනි, මහාසුදස්සන රජතුමා මහා විචිත්‍ර වූ මාලිගයට පිවිස, රන්මය යහනක හිඳගෙන, කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුවය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කළේය.\n\nවිතර්ක හා විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මික ප්‍රසාදයක් ඇතිව, සිතෙහි එකඟතාව ඇතිව, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුවය ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කළේය.\n\nප්‍රීතියෙන්ද වෙන්වීමෙන්, උපේක්ෂාවෙන් යුක්තව වාසය කළේය. සිහියෙන් හා මනා දැනීමෙන් යුක්තව, ශරීරයෙන් සුවය අත්විඳිමින්, යමක් ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්ත වූ, සිහි ඇති, සුවයෙන් වාසය කරන තැනැත්තා’ යැයි හඳුන්වත්ද, එවැනි වූ තුන්වෙනි ධ්‍යානයට පැමිණ වාසය කළේය.\n\nසුවයද පහ කිරීමෙන්, දුකද පහ කිරීමෙන්, පෙර පැවති සතුට හා දුක (සෝමනස්ස-දෝමනස්ස) අතුරුදහන් වීමෙන්, දුක් නොවන, සුව නොවන, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ හතරවෙනි ධ්‍යානයට පැමිණ වාසය කළේය.",
      "paliTitle": ""
    },
    {
      "number": 262,
      "pali": "‘‘Atha kho, ānanda, rājā mahāsudassano mahāviyūhā kūṭāgārā nikkhamitvā sovaṇṇamayaṃ kūṭāgāraṃ pavisitvā rūpiyamaye pallaṅke nisinno mettāsahagatena cetasā ekaṃ disaṃ pharitvā vihāsi. Tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihāsi. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā vihāsi tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā vihāsi.",
      "english": "Then, Ānanda, King Mahāsudassana, having left the great, elaborate pavilions, entered a golden pavilion and sat on a silver couch. He then dwelt pervading one direction with a mind imbued with loving-kindness; likewise the second direction, likewise the third, likewise the fourth. Thus, above, below, and across, everywhere, in every way, he dwelt pervading the entire world with a mind imbued with loving-kindness—vast, exalted, immeasurable, without animosity, and without ill will.\n\nHe also dwelt pervading one direction with a mind imbued with compassion; likewise the second direction, likewise the third, likewise the fourth. Thus, above, below, and across, everywhere, in every way, he dwelt pervading the entire world with a mind imbued with compassion—vast, exalted, immeasurable, without animosity, and without ill will.\n\nHe also dwelt pervading one direction with a mind imbued with sympathetic joy; likewise the second direction, likewise the third, likewise the fourth. Thus, above, below, and across, everywhere, in every way, he dwelt pervading the entire world with a mind imbued with sympathetic joy—vast, exalted, immeasurable, without animosity, and without ill will.\n\nAnd he dwelt pervading one direction with a mind imbued with equanimity; likewise the second direction, likewise the third, likewise the fourth. Thus, above, below, and across, everywhere, in every way, he dwelt pervading the entire world with a mind imbued with equanimity—vast, exalted, immeasurable, without animosity, and without ill will.",
      "sinhala": "එවිට, ආනන්දයෙනි, මහාසුදස්සන රජු මනාව සැකසූ විශාල මාලිගාවලින් නික්ම රන් මාලිගාවට පිවිස, රිදී පලංකයේ වාඩි වී, මෛත්‍රී සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කළේය. එසේම දෙවෙනි දිශාවද, එසේම තුන්වෙනි දිශාවද, එසේම හතරවෙනි දිශාවද (පතුරුවා වාසය කළේය). මෙසේ උඩ, යට, හරහට, හැම තැනම, හැම අතින්ම, මුළු ලෝකයම මෛත්‍රී සහගත සිතින්, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කළේය.\n\nකරුණා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කළේය. එසේම දෙවෙනි දිශාවද, එසේම තුන්වෙනි දිශාවද, එසේම හතරවෙනි දිශාවද (පතුරුවා වාසය කළේය). මෙසේ උඩ, යට, හරහට, හැම තැනම, හැම අතින්ම, මුළු ලෝකයම කරුණා සහගත සිතින්, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කළේය.\n\nමුදිතා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කළේය. එසේම දෙවෙනි දිශාවද, එසේම තුන්වෙනි දිශාවද, එසේම හතරවෙනි දිශාවද (පතුරුවා වාසය කළේය). මෙසේ උඩ, යට, හරහට, හැම තැනම, හැම අතින්ම, මුළු ලෝකයම මුදිතා සහගත සිතින්, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කළේය.\n\nඋපේක්ෂා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කළේය. එසේම දෙවෙනි දිශාවද, එසේම තුන්වෙනි දිශාවද, එසේම හතරවෙනි දිශාවද (පතුරුවා වාසය කළේය). මෙසේ උඩ, යට, හරහට, හැම තැනම, හැම අතින්ම, මුළු ලෝකයම උපේක්ෂා සහගත සිතින්, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කළේය.",
      "paliTitle": ""
    },
    {
      "number": 263,
      "pali": "‘‘Rañño, ānanda, mahāsudassanassa caturāsīti nagarasahassāni ahesuṃ kusāvatīrājadhānippamukhāni; caturāsīti pāsādasahassāni ahesuṃ dhammapāsādappamukhāni; caturāsīti kūṭāgārasahassāni ahesuṃ mahāviyūhakūṭāgārappamukhāni; caturāsīti pallaṅkasahassāni ahesuṃ sovaṇṇamayāni rūpiyamayāni dantamayāni sāramayāni gonakatthatāni paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni; caturāsīti nāgasahassāni ahesuṃ sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni uposathanāgarājappamukhāni; caturāsīti assasahassāni ahesuṃ sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni valāhakaassarājappamukhāni; caturāsīti rathasahassāni ahesuṃ sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni vejayantarathappamukhāni; caturāsīti maṇisahassāni ahesuṃ maṇiratanappamukhāni; caturāsīti itthisahassāni ahesuṃ subhaddādevippamukhāni; caturāsīti gahapatisahassāni ahesuṃ gahapatiratanappamukhāni; caturāsīti khattiyasahassāni ahesuṃ anuyantāni pariṇāyakaratanappamukhāni; caturāsīti dhenusahassāni ahesuṃ duhasandanāni [dukūlasandanāni(pī.)] dukūlasandānāni [dukūlasandanāni (pī.) dukūlasandānāni (saṃ. ni. 3.96)] kaṃsūpadhāraṇāni; caturāsīti vatthakoṭisahassāni ahesuṃ khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ; (rañño, ānanda, mahāsudassanassa) [( ) sī. ipotthakesu natthi] caturāsīti thālipākasahassāni ahesuṃ sāyaṃ pātaṃ bhattābhihāro abhihariyittha.",
      "english": "Ānanda, King Mahāsudassana possessed eighty-four thousand cities, with Kusāvatī as the principal royal capital. He had eighty-four thousand palaces, with the Dhamma Palace as the foremost. He had eighty-four thousand gabled pavilions, with the Great Array Pavilion as the foremost. He had eighty-four thousand couches made of gold, silver, ivory, or heartwood. These were covered with long-fleeced rugs, white rugs, patchwork rugs, or the finest antelope-hide coverings, and had canopies and crimson cushions at both ends. He had eighty-four thousand elephants adorned with golden ornaments and golden banners, and covered with nets of gold, with Uposatha, the elephant king, as the foremost. He had eighty-four thousand horses adorned with golden ornaments and golden banners, and covered with nets of gold, with Valāhaka, the horse king, as the foremost. He had eighty-four thousand chariots draped with lion skins, tiger skins, leopard skins, or yellow woolen blankets, adorned with golden ornaments and golden banners, and covered with nets of gold, with the Vejayanta chariot as the foremost. He had eighty-four thousand jewels, with the Mani Jewel as the foremost. He had eighty-four thousand women, with Subhaddā Devī as the chief. He had eighty-four thousand householders, with the Householder Jewel as the foremost. He had eighty-four thousand nobles/warriors in his retinue, with the Adviser Jewel as the foremost. He had eighty-four thousand milch cows that yielded streams of milk collected in bronze pails, as easily as if drawn from fine cloth. He had eighty-four thousand myriads of pieces of fine cloth made of linen, cotton, silk, and wool. Eighty-four thousand dishes of cooked food were brought to him every morning and evening for his meals.",
      "sinhala": "ආනන්දයෙනි, මහා සුදස්සන රජතුමාට කුසාවතී රාජධානිය ඇතුළු නගර අසූහාරදහසක් තිබුණි. ධම්ම ප්‍රාසාදය ඇතුළු ප්‍රාසාද අසූහාරදහසක් ද, මහා වියූහ කූටාගාරය ඇතුළු කූටාගාර අසූහාරදහසක් ද විය. රන්, රිදී, ඇත්දත් හා සාර දැවයෙන් නිමවූ, ගෝණක ඇතිරිලි, පටිකා ඇතිරිලි, පටලිකා ඇතිරිලි යොදා, කදලි මුවන්ගේ උත්තරීතර හම් අතුරා, උඩුවියන් බැඳ, දෙපස රතු කොට්ට තැබූ පලං අසූහාරදහසක් තිබුණි. රන් ආභරණවලින් සරසන ලද, රන් කොඩි ඔසවන ලද, රන් දැල්වලින් වසා තිබූ උපෝසථ නාගරාජයා ඇතුළු ඇතුන් අසූහාරදහසක් ද, රන් ආභරණවලින් සරසන ලද, රන් කොඩි ඔසවන ලද, රන් දැල්වලින් වසා තිබූ වලාහක අශ්වරාජයා ඇතුළු අශ්වයන් අසූහාරදහසක් ද විය. සිංහ හම්වලින්, ව්‍යාඝ්‍ර හම්වලින්, දිවි හම්වලින් හා සුදු කම්බිලිවලින් සරසන ලද, රන් ආභරණවලින් අලංකාර කරන ලද, රන් කොඩි ඔසවන ලද, රන් දැල්වලින් වසා තිබූ වෛජයන්ත රථය ඇතුළු රථ අසූහාරදහසක් ද විය. මැණික් රත්නය ඇතුළු මැණික් අසූහාරදහසක් ද, සුභද්‍රා දේවිය ඇතුළු ස්ත්‍රීන් අසූහාරදහසක් ද, ගෘහපති රත්නය ඇතුළු ගෘහපතියන් අසූහාරදහසක් ද, පරිණායක රත්නය ඇතුළු රජු අනුගමනය කරන ක්ෂත්‍රීයයන් අසූහාරදහසක් ද විය. දුහුල් වස්ත්‍ර බඳුන්වලට ද, ලෝහ බඳුන්වලට ද කිරි දොවන ධේනුන් අසූහාරදහසක් ද විය. සියුම් ඛෝම, සියුම් කපු, සියුම් සේද, සියුම් කම්බිලි ආදී වස්ත්‍ර අසූහාරදහසක් ද විය. උදේ සවස පිළිගැන්වීම සඳහා ථාළිපාක අසූහාරදහසක් පිළියෙල කරන ලදී.",
      "paliTitle": "Caturāsīti nagarasahassādi",
      "englishTitle": "Eighty-four thousand cities, etc.",
      "sinhalaTitle": "චතුරාසීති නගර සහස්සාදි"
    },
    {
      "number": 264,
      "pali": "‘‘Tena kho panānanda, samayena rañño mahāsudassanassa caturāsīti nāgasahassāni sāyaṃ pātaṃ upaṭṭhānaṃ āgacchanti. Atha kho, ānanda, rañño mahāsudassanassa etadahosi – ‘imāni kho me caturāsīti nāgasahassāni sāyaṃ pātaṃ upaṭṭhānaṃ āgacchanti, yaṃnūna vassasatassa vassasatassa accayena dvecattālīsaṃ dvecattālīsaṃ nāgasahassāni sakiṃ sakiṃ upaṭṭhānaṃ āgaccheyyu’nti. Atha kho, ānanda, rājā mahāsudassano pariṇāyakaratanaṃ āmantesi – ‘imāni kho me, samma pariṇāyakaratana, caturāsīti nāgasahassāni sāyaṃ pātaṃ upaṭṭhānaṃ āgacchanti, tena hi, samma pariṇāyakaratana, vassasatassa vassasatassa accayena dvecattālīsaṃ dvecattālīsaṃ nāgasahassāni sakiṃ sakiṃ upaṭṭhānaṃ āgacchantū’ti. ‘Evaṃ, devā’ti kho, ānanda, pariṇāyakaratanaṃ rañño mahāsudassanassa paccassosi. Atha kho, ānanda, rañño mahāsudassanassa aparena samayena vassasatassa vassasatassa accayena dvecattālīsaṃ dvecattālīsaṃ nāgasahassāni sakiṃ sakiṃ upaṭṭhānaṃ āgamaṃsu.",
      "english": "And at that time, Ānanda, eighty-four thousand elephants would attend upon King Mahāsudassana morning and evening. Then, Ānanda, this thought occurred to King Mahāsudassana: ‘These eighty-four thousand elephants attend upon me morning and evening. Suppose that, after the passing of a century, forty-two thousand elephants were to attend just once.’ Then, Ānanda, King Mahāsudassana addressed his Chief Minister: ‘My dear Chief Minister, these eighty-four thousand elephants attend upon me morning and evening. Therefore, my dear Chief Minister, after the passing of a century, let forty-two thousand elephants attend just once.’ ‘Yes, your majesty,’ the Chief Minister replied to King Mahāsudassana. Then, Ānanda, after some time, after a century had passed, forty-two thousand elephants attended upon King Mahāsudassana just once.",
      "sinhala": "ආනන්දය, ඒ කාලයෙහි මහා සුදස්සන රජුන් හට අසූහාර දහසක් නාගයන් සවස සහ උදෑසන උපස්ථානය සඳහා පැමිණියහ. ඉක්බිති, ආනන්ද, මහා සුදස්සන රජුට මෙවැනි අදහසක් ඇති විය: \"මා හට මේ අසූහාර දහසක් නාගයන් සවස සහ උදෑසන උපස්ථානයට පැමිණෙති. සියවසක් පාසා හතළිස් දෙදහස බැගින් නාගයන් වරක් පමණක් උපස්ථානයට පැමිණෙන්නට සලස්වන්නේ නම් කොතරම් හොඳ ද?\" ඉක්බිති, ආනන්ද, මහා සුදස්සන රජු පරිණායක රත්නය අමතා මෙසේ කීය: \"පරිණායක රත්නය, මාගේ මේ අසූහාර දහසක් නාගයන් සවස සහ උදෑසන උපස්ථානයට පැමිණෙති. එබැවින්, පරිණායක රත්නය, සියවසක් පාසා හතළිස් දෙදහස බැගින් නාගයන් වරක් පමණක් උපස්ථානයට පැමිණෙත්වා!\" ආනන්ද, \"එසේය, දේවයන් වහන්ස,\" යැයි පරිණායක රත්නය මහා සුදස්සන රජුට පිළිතුරු දුන්නේය. ඉන්පසු, ආනන්ද, මහා සුදස්සන රජුගේ පසු කලෙක, සියවසක් පාසා හතළිස් දෙදහස බැගින් නාගයන් වරක් පමණක් උපස්ථානයට පැමිණියහ.",
      "paliTitle": ""
    },
    {
      "number": 265,
      "pali": "‘‘Atha kho, ānanda, subhaddāya deviyā bahunnaṃ vassānaṃ bahunnaṃ vassasatānaṃ bahunnaṃ vassasahassānaṃ accayena etadahosi – ‘ciraṃ diṭṭho kho me rājā mahāsudassano. Yaṃnūnāhaṃ rājānaṃ mahāsudassanaṃ dassanāya upasaṅkameyya’nti. Atha kho, ānanda, subhaddā devī itthāgāraṃ āmantesi – ‘etha tumhe sīsāni nhāyatha pītāni vatthāni pārupatha. Ciraṃ diṭṭho no rājā mahāsudassano, rājānaṃ mahāsudassanaṃ dassanāya upasaṅkamissāmā’ti. ‘Evaṃ, ayye’ti kho, ānanda, itthāgāraṃ subhaddāya deviyā paṭissutvā sīsāni nhāyitvā pītāni vatthāni pārupitvā yena subhaddā devī tenupasaṅkami. Atha kho, ānanda, subhaddā devī pariṇāyakaratanaṃ āmantesi – ‘kappehi, samma pariṇāyakaratana, caturaṅginiṃ senaṃ, ciraṃ diṭṭho no rājā mahāsudassano, rājānaṃ mahāsudassanaṃ dassanāya upasaṅkamissāmā’ti. ‘Evaṃ, devī’ti kho, ānanda, pariṇāyakaratanaṃ subhaddāya deviyā paṭissutvā caturaṅginiṃ senaṃ kappāpetvā subhaddāya deviyā paṭivedesi – ‘kappitā kho, devi, caturaṅginī senā, yassadāni kālaṃ maññasī’ti. Atha kho, ānanda, subhaddā devī caturaṅginiyā senāya saddhiṃ itthāgārena yena dhammo pāsādo tenupasaṅkami; upasaṅkamitvā dhammaṃ pāsādaṃ abhiruhitvā yena mahāviyūhaṃ kūṭāgāraṃ tenupasaṅkami. Upasaṅkamitvā mahāviyūhassa kūṭāgārassa dvārabāhaṃ ālambitvā aṭṭhāsi. Atha kho, ānanda, rājā mahāsudassano saddaṃ sutvā – ‘kiṃ nu kho mahato viya janakāyassa saddo’ti mahāviyūhā kūṭāgārā nikkhamanto addasa subhaddaṃ deviṃ dvārabāhaṃ ālambitvā ṭhitaṃ, disvāna subhaddaṃ deviṃ etadavoca – ‘ettheva, devi, tiṭṭha mā pāvisī’ti. Atha kho, ānanda, rājā mahāsudassano aññataraṃ purisaṃ āmantesi – ‘ehi tvaṃ, ambho purisa, mahāviyūhā kūṭāgārā sovaṇṇamayaṃ pallaṅkaṃ nīharitvā sabbasovaṇṇamaye tālavane paññapehī’ti. ‘Evaṃ, devā’ti kho, ānanda, so puriso rañño mahāsudassanassa paṭissutvā mahāviyūhā kūṭāgārā sovaṇṇamayaṃ pallaṅkaṃ nīharitvā sabbasovaṇṇamaye tālavane paññapesi. Atha kho, ānanda, rājā mahāsudassano dakkhiṇena passena sīhaseyyaṃ kappesi pāde pādaṃ accādhāya sato sampajāno.",
      "english": "Then, Ānanda, after many years, many hundreds of years, many thousands of years had passed, Queen Subhaddā thought, ‘It has been a long time since I last saw King Mahāsudassana. I should go and see him.’ So, Ānanda, Queen Subhaddā addressed the women in her quarters: ‘Come, wash your heads and put on yellow garments. It has been a long time since we last saw King Mahāsudassana; we will go and see him.’ ‘Yes, lady,’ the women in the quarters replied to Queen Subhaddā. They washed their heads, put on yellow garments, and approached Queen Subhaddā.\n\nThen, Ānanda, Queen Subhaddā addressed the chief minister jewel: ‘Prepare the fourfold army, good chief minister jewel. It has been a long time since we last saw King Mahāsudassana; we will go and see him.’ ‘Yes, Your Majesty,’ the chief minister jewel replied to Queen Subhaddā. He prepared the fourfold army and reported to Queen Subhaddā: ‘The fourfold army is ready, Your Majesty; now you may proceed as you see fit.’\n\nThen, Ānanda, Queen Subhaddā, together with the fourfold army and the women from her quarters, approached the Dhamma Palace. Having approached and ascended the Dhamma Palace, she approached the Great Array pinnacled chamber. She leaned against the doorpost of the Great Array pinnacled chamber and stood there. Then, Ānanda, King Mahāsudassana heard a sound. ‘What is that loud noise like a crowd?’ he wondered. As he emerged from the Great Array pinnacled chamber, he saw Queen Subhaddā standing and leaning against the doorpost. Seeing her, King Mahāsudassana said, ‘Stay right there, Your Majesty. Do not enter.’\n\nThen, Ānanda, King Mahāsudassana addressed a certain man: ‘Go, good man, take the golden couch from the Great Array pinnacled chamber and set it up in the all-golden palm grove.’ ‘Yes, Your Majesty,’ the man replied to King Mahāsudassana. He took the golden couch from the Great Array pinnacled chamber and set it up in the all-golden palm grove. Then, Ānanda, King Mahāsudassana lay down on his right side in the lion's posture, placing one foot over the other, mindful and fully aware.",
      "sinhala": "අනඳ, සුභද්දා දේවියට බොහෝ වසර ගණනක්, බොහෝ සියවස් ගණනක්, බොහෝ දහස් වසර ගණනක් ඇවෑමෙන් මෙවැනි සිතක් පහළ විය. ‘මහා සුදස්සන රජතුමා දුටු බොහෝ කල්ය. මම මහා සුදස්සන රජතුමා බැහැදැකීමට යා යුතු නොවේද?’ එවිට සුභද්දා දේවිය අන්තඃපුර ස්ත්‍රීන්ට කතා කොට, ‘එම්බලා හිස සෝදා කහ පැහැති වස්ත්‍ර අඳින්න. අප මහා සුදස්සන රජතුමා නොදැක බොහෝ කල්ය. අපි මහා සුදස්සන රජතුමා බැහැදැකීමට යමු’ යැයි පැවසුවාය. ‘එසේය ආර්යාව’ යැයි අන්තඃපුර ස්ත්‍රීහු සුභද්දා දේවියට පිළිවදන් දී, හිස සෝදා කහ පැහැති වස්ත්‍ර හැඳ සුභද්දා දේවිය වෙත පැමිණියහ. අනතුරුව සුභද්දා දේවිය පරිනායක රුවන අමතා, ‘පරිනායක රුවන, සිව් අඟ සේනාව සූදානම් කරව. අප මහා සුදස්සන රජතුමා නොදැක බොහෝ කල්ය. අපි මහා සුදස්සන රජතුමා බැහැදැකීමට යමු’ යැයි කීවාය. ‘එසේය දේවිය’ යැයි පරිනායක රුවන සුභද්දා දේවියට පිළිවදන් දී සිව් අඟ සේනාව සූදානම් කරවා, ‘දේවිය, සිව් අඟ සේනාව සූදානම් කර ඇත. දැන් සුදුසු වේලාව ඔබ දන්නෙහිය’ යැයි සුභද්දා දේවියට දැන්වීය. ඉක්බිති අනඳ, සුභද්දා දේවිය සිව් අඟ සේනාව හා අන්තඃපුර ස්ත්‍රීන් සමඟ ධර්ම ප්‍රාසාදය වෙත ගොස්, ධර්ම ප්‍රාසාදයට නැඟී මහා වියූහ කූටාගාරය වෙත ගියාය. එහි ගොස් මහා වියූහ කූටාගාරයේ දොර අල්ලගෙන සිටියාය. එවිට මහා සුදස්සන රජතුමා ශබ්දය අසා, ‘මේ කුමක්ද? මහත් ජනකායකගේ ශබ්දයක් මෙන්’ යැයි සිතා මහා වියූහ කූටාගාරයෙන් එළියට පැමිණ දොර අල්ලාගෙන සිටින සුභද්දා දේවිය දුටුවේය. දැක සුභද්දා දේවියට මෙසේ කීවේය. ‘දේවිය, මෙතැනම සිටින්න. ඇතුළට එන්න එපා’. අනතුරුව මහා සුදස්සන රජතුමා එක් පුරුෂයෙකුට කතා කොට, ‘අහෝ පුරුෂය, ඔබ මහා වියූහ කූටාගාරයෙන් රන් යහනක් ගෙනැවිත් සියලු රන් තල්වනයේ අතුරන්න’ යැයි කීවේය. ‘එසේය දෙවියනි’ යැයි ඒ පුරුෂයා මහා සුදස්සන රජුට පිළිවදන් දී, මහා වියූහ කූටාගාරයෙන් රන් යහනක් ගෙනැවිත් සියලු රන් තල්වනයේ ඇතුරුවේය. ඉක්බිති අනඳ, මහා සුදස්සන රජතුමා සිහියෙන් හා නුවණින් යුක්තව දකුණු ඇලයෙන් සිංහ සෙයියාවෙන් පාදයක් මත පාදයක් තබාගෙන සැතපුණේය.",
      "paliTitle": "Subhaddādeviupasaṅkamanaṃ",
      "englishTitle": "Subhaddādevi's Approaching",
      "sinhalaTitle": "සුභද්දා දේවියගේ පැමිණීම"
    },
    {
      "number": 266,
      "pali": "‘‘Atha kho, ānanda, subhaddāya deviyā etadahosi – ‘vippasannāni kho rañño mahāsudassanassa indriyāni, parisuddho chavivaṇṇo pariyodāto, mā heva kho rājā mahāsudassano kālamakāsī’ti rājānaṃ mahāsudassanaṃ etadavoca – ‘Imāni te, deva, caturāsīti nagarasahassāni kusāvatīrājadhānippamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti pāsādasahassāni dhammapāsādappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti kūṭāgārasahassāni mahāviyūhakūṭāgārappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti pallaṅkasahassāni sovaṇṇamayāni rūpiyamayāni dantamayāni sāramayāni gonakatthatāni paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni. Ettha, deva, chandaṃ janehi, jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti nāgasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni uposathanāgarājappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti assasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni valāhakaassarājappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva caturāsīti rathasahassāni sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni vejayantarathappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti maṇisahassāni maṇiratanappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti itthisahassāni itthiratanappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti gahapatisahassāni gahapatiratanappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti khattiyasahassāni anuyantāni pariṇāyakaratanappamukhāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti dhenusahassāni duhasandanāni kaṃsūpadhāraṇāni. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti vatthakoṭisahassāni khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ. Ettha, deva, chandaṃ janehi, jīvite apekkhaṃ karohi. Imāni te, deva, caturāsīti thālipākasahassāni sāyaṃ pātaṃ bhattābhihāro abhihariyati. Ettha, deva, chandaṃ janehi jīvite apekkhaṃ karohī’ti.",
      "english": "Then, Ānanda, it occurred to Queen Subhaddā – ‘Indeed, the faculties of King Mahāsudassana are extremely clear, his complexion is pure and radiant. May King Mahāsudassana not pass away!’ She then spoke to King Mahāsudassana thus: ‘These, my lord, are your eighty-four thousand cities, with Kusāvatī as the foremost capital. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand palaces, with the Dhamma Palace as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand mansions with pinnacles, with the Great Observation Mansion as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand couches: made of gold, made of silver, made of ivory, made of heartwood; covered with woollen rugs, with white woollen rugs, with embroidered woollen rugs, with deer-skin spreads of the finest quality, with canopies, and with red cushions at both ends. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand elephants, adorned with gold, with golden banners, covered with golden nets, with Uposatha, the king of elephants, as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand horses, adorned with gold, with golden banners, covered with golden nets, with Valāhaka, the king of horses, as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand chariots, adorned with lion-skins, tiger-skins, leopard-skins, or yellow blankets; adorned with gold, with golden banners, covered with golden nets, with Vejayanta, the foremost chariot. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand jewels, with the Wish-Fulfilling Gem as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand women, with the Jewel-Woman as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand householders, with the Jewel-Householder as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand nobles who attend you, with the Jewel-Counselor as the foremost. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand milking cows, yielding ample milk, with bronze pails for collection. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand millions of garments: fine linen, fine cotton, fine silk, and fine wool. Here, my lord, cultivate a longing for life, and cherish it. These, my lord, are your eighty-four thousand kinds of cooked food, offered morning and evening as meals. Here, my lord, cultivate a longing for life, and cherish it.’",
      "sinhala": "අනඳ, එකල්හි සුභද්‍රා දේවියට මෙසේ සිතුණි: ‘මහාසුදස්සන රජුගේ ඉන්ද්‍රියයන් ඉතා ප්‍රසන්න ය. සමේ වර්ණය පිරිසිදු ය, දීප්තිමත් ය. මහාසුදස්සන රජු කලුරිය නොකළා වේවා!’ යැයි සිතා මහාසුදස්සන රජුට මෙසේ කීවා ය: ‘දේවයන් වහන්ස, කුසාවතී රාජධානිය ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් නගරයන් ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, ධර්ම ප්‍රාසාදය ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් ප්‍රාසාදයන් ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, මහා වියූහ කූටාගාරය ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් කූටාගාරයන් ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, රන්මය, රිදීමය, දන්තමය, සාරමය වූ, ගෝණක ඇතිරියන්ගෙන්, පටි ඇතිරියන්ගෙන්, සිනිඳු ඇතිරියන්ගෙන්, කදලි මෘගයාගේ උසස් ලොම් ඇතිරියන්ගෙන් යුක්ත වූ, උඩු වියන් සහිත වූ, දෙපස රතු කොට්ට සහිත වූ මේ අසූහාර දහසක් පලංකයන් ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, රන් ආභරණවලින්, රන් ධජයන්ගෙන්, රන් දැල්වලින් වැසූ, උපෝසථ නාගරාජයා ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් ඇත්තු ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, රන් ආභරණවලින්, රන් ධජයන්ගෙන්, රන් දැල්වලින් වැසූ, වලාහක අශ්වරාජයා ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් අශ්වයෝ ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, සිංහ සමින්, ව්‍යාඝ්‍ර සමින්, දිවි සමින්, සුදු කම්බලවලින් ආවරණය කරන ලද, රන් ආභරණවලින්, රන් ධජයන්ගෙන්, රන් දැල්වලින් වැසූ, වෛජයන්ත රථය ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් රථයෝ ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, මණිරත්නය ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් මාණික්‍යයෝ ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, ස්ත්‍රී රත්නය ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් ස්ත්‍රීහු ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, ගෘහපති රත්නය ප්‍රමුඛ කොට ඇති මේ අසූහාර දහසක් ගෘහපතියෝ ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, පරිණායක රත්නය ප්‍රමුඛ කොට ඇති, ඔබ අනුගමනය කරන මේ අසූහාර දහසක් ක්ෂත්‍රියයෝ ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, ලෝභාජනවලට දොවන, මේ අසූහාර දහසක් එළදෙනුන් ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, ක්‍ෂෞම, කපු, සේද, කම්බල යන සියුම් වස්ත්‍ර කෝටි අසූහාර දහසක් ඔබ සතු ය. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න. දේවයන් වහන්ස, සවස් වරුවේත් උදෑසනත් භෝජන අසූහාර දහසක් ඉදිරිපත් කරනු ලැබේ. දේවයන් වහන්ස, මේවා කෙරෙහි කැමැත්ත ඇති කරගන්න, ජීවිතය කෙරෙහි ඇල්ම ඇති කරගන්න.’",
      "paliTitle": ""
    },
    {
      "number": 267,
      "pali": "‘‘Evaṃ vutte, ānanda, rājā mahāsudassano subhaddaṃ deviṃ etadavoca – ‘Dīgharattaṃ kho maṃ tvaṃ, devi, iṭṭhehi kantehi piyehi manāpehi samudācarittha; atha ca pana maṃ tvaṃ pacchime kāle aniṭṭhehi akantehi appiyehi amanāpehi samudācarasī’ti. ‘Kathaṃ carahi taṃ, deva, samudācarāmī’ti? ‘Evaṃ kho maṃ tvaṃ, devi, samudācara – ‘‘sabbeheva, deva, piyehi manāpehi nānābhāvo vinābhāvo aññathābhāvo, mā kho tvaṃ, deva, sāpekkho kālamakāsi, dukkhā sāpekkhassa kālaṅkiriyā, garahitā ca sāpekkhassa kālaṅkiriyā. Imāni te, deva, caturāsīti nagarasahassāni kusāvatīrājadhānippamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti pāsādasahassāni dhammapāsādappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti kūṭāgārasahassāni mahāviyūhakūṭāgārappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti pallaṅkasahassāni sovaṇṇamayāni rūpiyamayāni dantamayāni sāramayāni gonakatthatāni paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti nāgasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni uposathanāgarājappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti assasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni valāhakaassarājappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti rathasahassāni sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni vejayantarathappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti maṇisahassāni maṇiratanappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti itthisahassāni subhaddādevippamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti gahapatisahassāni gahapatiratanappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti khattiyasahassāni anuyantāni pariṇāyakaratanappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti dhenusahassāni duhasandanāni kaṃsūpadhāraṇāni. Ettha deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti vatthakoṭisahassāni khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te deva caturāsīti thālipākasahassāni sāyaṃ pātaṃ bhattābhihāro abhihariyati. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsī’’’ti.",
      "english": "When this was said, Ānanda, King Mahāsudassana addressed Queen Subhaddā: ‘For a long time, Queen, you have treated me with what is agreeable, desirable, beloved, and pleasing. But now, in my final moments, you treat me with what is disagreeable, undesirable, unloved, and displeasing.’\n\n‘How then, O King, should I treat you?’\n\n‘You should treat me thus, Queen: \"O King, separation, disunion, and change are inherent in all that is beloved and pleasing. Do not die with clinging, for a death with clinging is sorrowful, and a death with clinging is blameworthy. These, O King, are your eighty-four thousand cities, with Kusāvatī as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand palaces, with the Dhamma Palace as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand gabled mansions, with the Great-Vista Gabled Mansion as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand couches: made of gold, made of silver, made of ivory, made of heartwood; spread with long-fleeced rugs, spread with white woolen rugs, spread with embroidered rugs, covered with the finest antelope hides; canopied, and with crimson cushions at both ends. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand elephants: adorned with golden ornaments, with golden banners, covered with golden nets, with Uposatha, king of elephants, as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand horses: adorned with golden ornaments, with golden banners, covered with golden nets, with Valāhaka, king of horses, as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand chariots: with sides covered in lion skins, tiger skins, panther skins, and woolen blankets; adorned with golden ornaments, with golden banners, covered with golden nets, with the Vaijayanta chariot as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand jewels, with the Jewel Treasure as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand women, with Queen Subhaddā as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand householders, with the Householder Treasure as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand warrior princes, the royal retinue, with the Commander Treasure as the foremost. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand milch cows, yielding abundant milk, collected in bronze vessels. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand fine cloths: of linen, of cotton, of silk, and of wool. In these, O King, abandon desire; do not cling to life. These, O King, are your eighty-four thousand platters of food, brought morning and evening. In these, O King, abandon desire; do not cling to life.\"’",
      "sinhala": "ආනන්දයෙනි, මෙසේ කී කල්හි මහාසුදස්සන රජු සුභද්දා දේවියට මෙසේ කීවේය: “දේවිය, ඔබ බොහෝ කලක් මා සතුටු කළේ ප්‍රියමනාප දේවලිනි. එහෙත් දැන්, මේ අවසාන කාලයේදී, ඔබ මට සලකන්නේ අප්‍රියමනාප දේවලිනි.”\n\n“එසේ නම්, දේවයන් වහන්ස, මම ඔබට කෙසේ සැලකිය යුතුද?”\n\n“දේවිය, ඔබ මට මෙසේ සලකන්න: ‘දේවයන් වහන්ස, සියලු ප්‍රිය දේවලුත් මන වඩන දේවලුත් වෙනස් වීමටත්, විනාශ වීමටත්, අනිත්‍ය වීමටත් නියමිතය. එබැවින්, දේවයන් වහන්ස, කිසිම දෙයකට ඇලුම් නොකර මිය යන්න. ඇල්මෙන් මිය යාම දුක්ඛිතය. ඇල්මෙන් මිය යාම නින්දිතය. දේවයන් වහන්ස, කුසාවතී නුවර ඇතුළු නගර අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. ධම්මපාසාදය ඇතුළු ප්‍රාසාද අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. මහා වියූහ කූටාගාරය ඇතුළු ගිමන්හල් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. රන්, රිදී, ඇත්දත්, සාර දැව යොදා කළ, ගොනාගේ ලොම් ඇතිරිලි, විසිතුරු ලොම් ඇතිරිලි, කදිම මුව හම් ඇතිරිලි ඇති, වියන් යෙදූ, දෙපස රතු කොට්ට තැබූ යහන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. රන් ආභරණවලින් සරසන ලද, රන් ධජ පතාකවලින් විසිතුරු කරන ලද, රන් දැල්වලින් වසන ලද උපෝසථ ඇත් රජ ඇතුළු ඇතුන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. රන් ආභරණවලින් සරසන ලද, රන් ධජ පතාකවලින් විසිතුරු කරන ලද, රන් දැල්වලින් වසන ලද වලාහක අශ්ව රජ ඇතුළු අශ්වයන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. සිංහ හම්වලින්, ව්‍යාඝ්‍ර හම්වලින්, දිවි හම්වලින් හා පඬු කම්බලවලින් සරසන ලද, රන් ආභරණවලින් සරසන ලද, රන් ධජ පතාකවලින් විසිතුරු කරන ලද, රන් දැල්වලින් වසන ලද වෛජයන්ත රථය ඇතුළු රථ අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. මැණික් රත්නය ඇතුළු මැණික් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. සුභද්දා දේවිය ඇතුළු අන්තඃපුර ස්ත්‍රීන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඔවුන් කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. ගෘහපති රත්නය ඇතුළු ගෘහපතියන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඔවුන් කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. පරිනායක රත්නය ඇතුළු ඔබ පසුපස යන ක්ෂත්‍රියයන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඔවුන් කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. පහසුවෙන් කිරි දෙන, ලෝහ බඳුන්වලට කිරි දෙන එළදෙනුන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඔවුන් කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. ක්ෂෝම වස්ත්‍ර, කපු වස්ත්‍ර, සේද වස්ත්‍ර, කම්බල වස්ත්‍ර යන සියුම් වස්ත්‍ර අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න. සවස හා උදෑසන ආහාර පිළිගන්වන භෝජන තැටි අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, ඒවා කෙරෙහි ඇති ආශාව අත්හරින්න. ජීවිතය ගැන තණ්හාවෙන් නොමියෙන්න.’\"",
      "paliTitle": ""
    },
    {
      "number": 268,
      "pali": "‘‘Evaṃ vutte, ānanda, subhaddā devī parodi assūni pavattesi. Atha kho, ānanda, subhaddā devī assūni puñchitvā [pamajjitvā (sī. syā. pī.), puñjitvā (ka.)] rājānaṃ mahāsudassanaṃ etadavoca – ‘Sabbeheva, deva, piyehi manāpehi nānābhāvo vinābhāvo aññathābhāvo, mā kho tvaṃ, deva, sāpekkho kālamakāsi, dukkhā sāpekkhassa kālaṅkiriyā, garahitā ca sāpekkhassa kālaṅkiriyā. Imāni te, deva, caturāsīti nagarasahassāni kusāvatīrājadhānippamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti pāsādasahassāni dhammapāsādappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti kūṭāgārasahassāni mahāviyūhakūṭāgārappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti pallaṅkasahassāni sovaṇṇamayāni rūpiyamayāni dantamayāni sāramayāni gonakatthatāni paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti nāgasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni uposathanāgarājappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti assasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni valāhakaassarājappamukhāni. Ettha, deva, chandaṃ pajaha, jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti rathasahassāni sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni vejayantarathappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti maṇisahassāni maṇiratanappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti itthisahassāni itthiratanappamukhāni. Ettha, deva, chandaṃ pajaha, jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti gahapatisahassāni gahapatiratanappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti khattiyasahassāni anuyantāni pariṇāyakaratanappamukhāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti dhenusahassāni duhasandanāni kaṃsūpadhāraṇāni. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti vatthakoṭisahassāni khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsi. Imāni te, deva, caturāsīti thālipākasahassāni sāyaṃ pātaṃ bhattābhihāro abhihariyati. Ettha, deva, chandaṃ pajaha jīvite apekkhaṃ mākāsī’ti.",
      "english": "When this was said, Ānanda, Queen Subhaddā wept and shed tears. Then, Ānanda, Queen Subhaddā wiped away her tears and said to King Mahāsudassana: ‘Indeed, O Divine one, separation, parting, and change are inherent in all things dear and pleasing. Therefore, O Divine one, do not die with clinging. Death with clinging is painful and blameworthy. These, O Divine one, are your eighty-four thousand cities, with Kusāvatī as the foremost royal capital. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand palaces, with the Palace of Dhamma as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand multi-storied mansions, with the Great Grand Mansion as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand couches: made of gold, made of silver, made of ivory, made of heartwood; spread with long-haired rugs, white wool rugs, flower-embroidered wool rugs, and exquisite deer-skin covers; canopied and with crimson pillows at both ends. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand elephants, adorned with golden ornaments, carrying golden banners, covered with golden nets, with Uposatha the elephant-king as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand horses, adorned with golden ornaments, carrying golden banners, covered with golden nets, with Valāhaka the horse-king as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand chariots, draped with lion skins, tiger skins, leopard skins, and yellow blankets; adorned with golden ornaments, carrying golden banners, covered with golden nets, with the Vaijayanta Chariot as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand jewels, with the Jewel of a Gem as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand women, with the Jewel of a Woman as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand householders, with the Jewel of a Householder as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand warrior nobles who attend you, with the Jewel of a General as the foremost. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand cows that yield abundant milk, with bronze milk pails to receive it. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand crore bundles of fine Benares cloth, fine cotton cloth, fine silk cloth, and fine woolen blankets. In these, O Divine one, abandon desire and do not cling to life. These, O Divine one, are your eighty-four thousand platters of food, offered morning and evening. In these, O Divine one, abandon desire and do not cling to life.’",
      "sinhala": "ආනන්දය, මෙසේ ඇසූ කල්හි සුභද්‍රා දේවිය හඬා වැලපෙමින් කඳුළු සැලුවාය. ඉක්බිති ආනන්දය, සුභද්‍රා දේවිය කඳුළු පිසදමා මහා සුදස්සන රජුට මෙසේ කීවාය: “දේවයන් වහන්ස, සියලු ප්‍රිය මනාප දේවලින් වෙන්වීම, වෙනස්වීම හා නැතිවීම ස්වභාවයයි. එබැවින්, දේවයන් වහන්ස, ඔබ තෘෂ්ණාවෙන් මිය නොයන්න. තෘෂ්ණාවෙන් මිය යෑම දුක්ඛිතය, නින්දිතය. දේවයන් වහන්ස, කුසාවතී රාජධානිය ප්‍රධාන කොට ඇති නගර අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, ධම්මප්‍රාසාදය ප්‍රධාන කොට ඇති ප්‍රාසාද අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, මහා වියුහය නම් කුළුගෙය ප්‍රධාන කොට ඇති කුළුගෙවල් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, රන්, රිදී, ඇත්දත් හා වටිනා දැවයෙන් කළ, ගෝණ ලොම්, ලොම්, සියුම් ලොම්, කදලි මුව සම් ඇතිරිලිවලින් යුත්, උඩු වියන් හා දෙපස රතු කොට්ට සහිත යහන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, උපෝසථ නාගරාජයා ප්‍රධාන කොට ඇති, රන් ආභරණවලින් සැරසුණු, රන් කොඩිවලින් යුත්, රන් දැල්වලින් වැසුණු හස්තීන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, වලාහක අශ්වරාජයා ප්‍රධාන කොට ඇති, රන් ආභරණවලින් සැරසුණු, රන් කොඩිවලින් යුත්, රන් දැල්වලින් වැසුණු අශ්වයන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, වෛජයන්ත රථය ප්‍රධාන කොට ඇති, සිංහ හම්, ව්‍යාඝ්‍ර හම්, දිවි හම් හා සුදු කම්බිලිවලින් සරසන ලද, රන් ආභරණවලින් සැරසුණු, රන් කොඩිවලින් යුත්, රන් දැල්වලින් වැසුණු රථ අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, මණිරත්නය ප්‍රධාන කොට ඇති මැණික් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, ස්ත්‍රීරත්නය ප්‍රධාන කොට ඇති ස්ත්‍රීන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, ගෘහපති රත්නය ප්‍රධාන කොට ඇති ගෘහපතියන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, පරිනායක රත්නය ප්‍රධාන කොට ඇති, ඔබ අනුගමනය කරන ක්ෂත්‍රියයන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, ලෝකඩ කිරි භාජන පුරවන කිරි දෙනුන් අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, සියුම් හණ වස්ත්‍ර, සියුම් පුළුන් වස්ත්‍ර, සියුම් සේද වස්ත්‍ර හා සියුම් ලොම් වස්ත්‍ර වශයෙන් වස්ත්‍ර කෝටි අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න. දේවයන් වහන්ස, උදේ සවස පිළිගන්වන ආහාර පිණිස බත් පිසින ලද භාජන අසූහාරදහසක් ඔබට ඇත. දේවයන් වහන්ස, මෙහි ලෝභය දුරු කොට ජීවිතය කෙරෙහි ඇල්ම අත්හරින්න.”",
      "paliTitle": ""
    },
    {
      "number": 269,
      "pali": "‘‘Atha kho, ānanda, rājā mahāsudassano nacirasseva kālamakāsi. Seyyathāpi, ānanda, gahapatissa vā gahapatiputtassa vā manuññaṃ bhojanaṃ bhuttāvissa bhattasammado hoti, evameva kho, ānanda, rañño mahāsudassanassa māraṇantikā vedanā ahosi. Kālaṅkato ca, ānanda, rājā mahāsudassano sugatiṃ brahmalokaṃ upapajji. Rājā, ānanda, mahāsudassano caturāsīti vassasahassāni kumārakīḷaṃ [kīḷitaṃ (ka.), kīḷikaṃ (sī. pī.)] kīḷi. Caturāsīti vassasahassāni oparajjaṃ kāresi. Caturāsīti vassasahassāni rajjaṃ kāresi. Caturāsīti vassasahassāni gihibhūto [gihībhūto (sī. pī.)] dhamme pāsāde brahmacariyaṃ cari [brahmacariyamacari (ka.)]. So cattāro brahmavihāre bhāvetvā kāyassa bhedā paraṃ maraṇā brahmalokūpago ahosi.",
      "english": "Then, Ananda, not long after, King Mahasudassana passed away. Just as, Ananda, a householder or a householder's son feels satiety after enjoying a pleasant meal, so too, Ananda, was King Mahasudassana's experience of the pain of death. And upon passing away, Ananda, King Mahasudassana was reborn in a good destination, the Brahma realm. Ananda, King Mahasudassana sported as a prince for eighty-four thousand years. He served as viceroy for eighty-four thousand years. He reigned as king for eighty-four thousand years. For eighty-four thousand years, as a layman, he lived the holy life in the Dhamma Palace. Having cultivated the four Brahmaviharas, upon the dissolution of his body, after death, he was reborn in the Brahma realm.",
      "sinhala": "‘‘ආනන්ද, මහසුදස්සන රජු වැඩි කලක් නොගොස් මරණයට පත්විය. ආනන්ද, ගෘහපතියෙකු හෝ ගෘහපති පුත්‍රයෙකු රසවත් භෝජනයක් අනුභව කළ පසු ආහාර ජීර්ණය නොවී අපහසුවක් දැනෙනවා සේම, මහසුදස්සන රජුට මරණාසන්න වේදනාවක් ඇතිවිය. ආනන්ද, මහසුදස්සන රජු මියගොස් සුගතියෙහි බ්‍රහ්ම ලෝකයේ උපත ලැබීය. ආනන්ද, මහසුදස්සන රජු වසර අසූහාරදහසක් කුමාර ක්‍රීඩා කරමින් ගත කළේය. වසර අසූහාරදහසක් උපරාජ පදවියෙහි සිට කටයුතු කළේය. වසර අසූහාරදහසක් රාජ්‍යය පාලනය කළේය. වසර අසූහාරදහසක් ගිහි ජීවිත ගත කරමින් ධර්ම ප්‍රාසාදයේ බ්‍රහ්මචාරීව වාසය කළේය. ඔහු සතර බ්‍රහ්ම විහරණ වැඩීමෙන් පසු කය බිඳී මරණින් මතු බ්‍රහ්ම ලෝකයේ උපත ලැබීය.’’",
      "paliTitle": "Brahmalokūpagamaṃ",
      "englishTitle": "Going to the Brahma World",
      "sinhalaTitle": "බ්‍රහ්මලෝකයට පැමිණීම"
    },
    {
      "number": 270,
      "pali": "‘‘Siyā kho panānanda, evamassa – ‘añño nūna tena samayena rājā mahāsudassano ahosī’ti, na kho panetaṃ, ānanda, evaṃ daṭṭhabbaṃ. Ahaṃ tena samayena rājā mahāsudassano ahosiṃ. Mama tāni caturāsīti nagarasahassāni kusāvatīrājadhānippamukhāni, mama tāni caturāsīti pāsādasahassāni dhammapāsādappamukhāni, mama tāni caturāsīti kūṭāgārasahassāni mahāviyūhakūṭāgārappamukhāni, mama tāni caturāsīti pallaṅkasahassāni sovaṇṇamayāni rūpiyamayāni dantamayāni sāramayāni gonakatthatāni paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni, mama tāni caturāsīti nāgasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni uposathanāgarājappamukhāni, mama tāni caturāsīti assasahassāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni valāhakaassarājappamukhāni, mama tāni caturāsīti rathasahassāni sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālapaṭicchannāni vejayantarathappamukhāni, mama tāni caturāsīti maṇisahassāni maṇiratanappamukhāni, mama tāni caturāsīti itthisahassāni subhaddādevippamukhāni, mama tāni caturāsīti gahapatisahassāni gahapatiratanappamukhāni, mama tāni caturāsīti khattiyasahassāni anuyantāni pariṇāyakaratanappamukhāni, mama tāni caturāsīti dhenusahassāni duhasandanāni kaṃsūpadhāraṇāni, mama tāni caturāsīti vatthakoṭisahassāni khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ, mama tāni caturāsīti thālipākasahassāni sāyaṃ pātaṃ bhattābhihāro abhihariyittha.",
      "english": "It is possible, Ananda, that you might think, \"Surely, a different King Mahāsudassana existed at that time.\" But, Ananda, that is not how it should be regarded.\n\nI myself was King Mahāsudassana at that time. I possessed those eighty-four thousand cities, with Kusāvatī as the foremost royal capital; those eighty-four thousand palaces, with the Dhamma Palace as the foremost; those eighty-four thousand storied mansions, with the Great Array Mansion as the foremost; those eighty-four thousand couches made of gold, silver, ivory, or heartwood, spread with long-haired rugs, white woolen rugs, embroidered rugs, and the finest antelope hide rugs, complete with canopies and crimson cushions at both ends; those eighty-four thousand elephants adorned with gold, bearing gold banners, and covered with gold nets, with the elephant king Uposatha as the foremost; those eighty-four thousand horses adorned with gold, bearing gold banners, and covered with gold nets, with the horse king Valāhaka as the foremost; those eighty-four thousand chariots draped with lion skins, tiger skins, leopard skins, and yellow blankets, adorned with gold, bearing gold banners, and covered with gold nets, with the Vejayanta chariot as the foremost; those eighty-four thousand jewels, with the jewel-treasure as the foremost; those eighty-four thousand women, with Queen Subhaddā as the foremost; those eighty-four thousand householders, with the householder-treasure as the foremost; those eighty-four thousand warrior princes in my retinue, with the general-treasure as the foremost; those eighty-four thousand milk cows yielding abundant milk, collected in bronze pails; those eighty-four thousand million sets of garments of fine linen, fine cotton, fine silk, and fine wool; and those eighty-four thousand varieties of meals that were brought to me each morning and evening.",
      "sinhala": "ආනන්දය, ඔබට මෙවැනි සිතුවිල්ලක් ඇතිවිය හැකිය: ‘එකල මහාසුදස්සන නමින් වෙනත් රජ කෙනෙක් සිටින්නට ඇතැ’යි කියා. එහෙත් ආනන්දය, එය එසේ නොවිය යුතුය. ඒ මහාසුදස්සන රජු වූයේ මමයි.\n\nකුසාවතී නුවර ප්‍රධාන කොටගත් නගර අසූහාරදහසක් මා සතුව තිබුණි. ධම්මපාසාදය ප්‍රධාන කොටගත් ප්‍රාසාද අසූහාරදහසක් මා සතුව තිබුණි. මහා වියූහ මාලිගය ප්‍රධාන කොටගත් මාලිගා අසූහාරදහසක් මා සතුව තිබුණි. රන්, රිදී, ඇත්දත් හා සාර දැවයෙන් නිමවූ, දිගු ලොම් ඇති රෝම කම්බිලි ඇතිරිලි, සුදු ලොම් ඇතිරිලි, රටා සහිත ලොම් ඇතිරිලි, කදලි මුව සම් ඇතිරිලි යෙදූ, උඩු වියන් හා දෙපස රතු කොට්ට සහිත යහන් අසූහාරදහසක් මා සතුව තිබුණි. රන් ආභරණවලින් සරසන ලද, රන් ධජවලින් යුත්, රන් දැල්වලින් වසන ලද උපෝසථ නම් ඇත් රජු ප්‍රධාන කරගත් ඇතන් අසූහාරදහසක් මා සතුව තිබුණි. රන් ආභරණවලින් සරසන ලද, රන් ධජවලින් යුත්, රන් දැල්වලින් වසන ලද වලාහක නම් අශ්ව රජු ප්‍රධාන කරගත් අශ්වයන් අසූහාරදහසක් මා සතුව තිබුණි. සිංහ හම්වලින්, ව්‍යාඝ්‍ර හම්වලින්, දිවි හම්වලින් හා කහ පැහැති කම්බිලිවලින් සරසන ලද, රන් ආභරණවලින් සරසන ලද, රන් ධජවලින් යුත්, රන් දැල්වලින් වසන ලද වෛජයන්ත රථය ප්‍රධාන කරගත් රථ අසූහාරදහසක් මා සතුව තිබුණි. මාණික්‍ය රත්නය ප්‍රධාන කරගත් මාණික්‍යයන් අසූහාරදහසක් මා සතුව තිබුණි. සුභද්‍රා දේවිය ප්‍රධාන කරගත් ස්ත්‍රීන් අසූහාරදහසක් මා සතුව තිබුණි. ගෘහපති රත්නය ප්‍රධාන කරගත් ගෘහපතියන් අසූහාරදහසක් මා සතුව තිබුණි. පරිණායක රත්නය ප්‍රධාන කරගත්, මා පසුපස ගමන් කළ ක්ෂත්‍රියයන් අසූහාරදහසක් මා සතුව තිබුණි. කිරි වගුරුවන, ලෝකඩ කිරි කටාරම් සහිත එළදෙනුන් අසූහාරදහසක් මා සතුව තිබුණි. හණ, කපු, පట్టు හා ලොම්වලින් සිනිඳුවූ සියුම් වස්ත්‍ර අසූහාරදහසක් මා සතුව තිබුණි. උදේ සවස ආහාර වේලට පිළිගැන්වූ භෝජන තැටි අසූහාරදහසක් මා සතුව තිබුණි.",
      "paliTitle": ""
    },
    {
      "number": 271,
      "pali": "‘‘Tesaṃ kho panānanda, caturāsītinagarasahassānaṃ ekaññeva taṃ nagaraṃ hoti, yaṃ tena samayena ajjhāvasāmi yadidaṃ kusāvatī rājadhānī. Tesaṃ kho panānanda, caturāsītipāsādasahassānaṃ ekoyeva so pāsādo hoti, yaṃ tena samayena ajjhāvasāmi yadidaṃ dhammo pāsādo. Tesaṃ kho panānanda, caturāsītikūṭāgārasahassānaṃ ekaññeva taṃ kūṭāgāraṃ hoti, yaṃ tena samayena ajjhāvasāmi yadidaṃ mahāviyūhaṃ kūṭāgāraṃ. Tesaṃ kho panānanda, caturāsītipallaṅkasahassānaṃ ekoyeva so pallaṅko hoti, yaṃ tena samayena paribhuñjāmi yadidaṃ sovaṇṇamayo vā rūpiyamayo vā dantamayo vā sāramayo vā. Tesaṃ kho panānanda, caturāsītināgasahassānaṃ ekoyeva so nāgo hoti, yaṃ tena samayena abhiruhāmi yadidaṃ uposatho nāgarājā. Tesaṃ kho panānanda, caturāsītiassasahassānaṃ ekoyeva so asso hoti, yaṃ tena samayena abhiruhāmi yadidaṃ valāhako assarājā. Tesaṃ kho panānanda, caturāsītirathasahassānaṃ ekoyeva so ratho hoti, yaṃ tena samayena abhiruhāmi yadidaṃ vejayantaratho. Tesaṃ kho panānanda, caturāsītiitthisahassānaṃ ekāyeva sā itthī hoti, yā tena samayena paccupaṭṭhāti khattiyānī vā vessinī [vessāyinī (syā.), velāmikānī (ka. sī. pī.) velāmikā (saṃ. ni. 3.96)] vā. Tesaṃ kho panānanda, vā. Tesaṃ kho panānanda, caturāsītivatthakoṭisahassānaṃ ekaṃyeva taṃ dussayugaṃ hoti, yaṃ tena samayena paridahāmi khomasukhumaṃ vā kappāsikasukhumaṃ vā koseyyasukhumaṃ vā kambalasukhumaṃ vā. Tesaṃ kho panānanda, caturāsītithālipākasahassānaṃ ekoyeva so thālipāko hoti, yato nāḷikodanaparamaṃ bhuñjāmi tadupiyañca sūpeyyaṃ.",
      "english": "Ananda, of those eighty-four thousand cities, just one was the city I dwelled in at that time, namely Kusāvatī, the royal capital. Ananda, of those eighty-four thousand palaces, just one was the palace I dwelled in at that time, namely the Dhamma Palace. Ananda, of those eighty-four thousand peaked mansions, just one was the peaked mansion I dwelled in at that time, namely the Mahāviyūha peaked mansion. Ananda, of those eighty-four thousand couches, just one was the couch I used at that time, namely one made of gold, silver, ivory, or heartwood. Ananda, of those eighty-four thousand elephants, just one was the elephant I rode at that time, namely Uposatha, the king of elephants. Ananda, of those eighty-four thousand horses, just one was the horse I rode at that time, namely Valāhaka, the king of horses. Ananda, of those eighty-four thousand chariots, just one was the chariot I rode in at that time, namely the Vejayanta chariot. Ananda, of those eighty-four thousand women, just one was the woman who attended me at that time, whether she was a noblewoman or a merchant's daughter. Ananda, of those eighty-four thousand kinds of garments, just one was the pair of robes I wore at that time: fine linen, fine cotton, fine silk, or fine wool. Ananda, of those eighty-four thousand kinds of prepared meals, just one was the meal from which I ate at most one nāḷi of cooked rice, accompanied by suitable curries.",
      "sinhala": "ආනන්දය, ඒ අසූහාරදහසක් නගර අතරින්, මා ඒ කාලයෙහි වාසය කළ කුසාවතී රාජධානිය එකම නගරය විය. ආනන්දය, ඒ අසූහාරදහසක් ප්‍රාසාද අතරින්, මා ඒ කාලයෙහි වාසය කළ ධම්ම නම් ප්‍රාසාදය එකම ප්‍රාසාදය විය. ආනන්දය, ඒ අසූහාරදහසක් කූටාගාර අතරින්, මා ඒ කාලයෙහි වාසය කළ මහා වියූහ නම් කූටාගාරය එකම කූටාගාරය විය. ආනන්දය, ඒ අසූහාරදහසක් පලංක අතරින්, මා ඒ කාලයෙහි පරිභෝග කළ රන්මුවා, රිදීමුවා, දත්මුවා, හෝ සාර දැවමුවා පලංකය එකම පලංකය විය. ආනන්දය, ඒ අසූහාරදහසක් ඇතුන් අතරින්, මා ඒ කාලයෙහි පිට නැගී ගිය උපෝසථ නම් ඇත් රජු එකම ඇතා විය. ආනන්දය, ඒ අසූහාරදහසක් අශ්වයන් අතරින්, මා ඒ කාලයෙහි පිට නැගී ගිය වලාහක නම් අශ්වරාජයා එකම අශ්වයා විය. ආනන්දය, ඒ අසූහාරදහසක් රථ අතරින්, මා ඒ කාලයෙහි නැගී ගිය වෛජයන්ත නම් රථය එකම රථය විය. ආනන්දය, ඒ අසූහාරදහසක් ස්ත්‍රීන් අතරින්, ඒ කාලයෙහි මට උපස්ථාන කළ ක්ෂත්‍රිය හෝ වෛශ්‍ය කුලයේ ස්ත්‍රිය එකම ස්ත්‍රිය වූවාය. ආනන්දය, ඒ අසූහාරදහසක් කෝටි ගණන් වස්ත්‍ර අතරින්, මා ඒ කාලයෙහි ඇඳගත් සියුම් හණ රෙදි, කපු රෙදි, සේද රෙදි, හෝ කම්බිලි රෙදිවලින් සෑදූ වස්ත්‍ර යුගලය එකම විය. ආනන්දය, ඒ අසූහාරදහසක් ථාලිපාක අතරින්, මා නාලියක් පමණ බත් සහ එයට සුදුසු ව්‍යංජන සමග අනුභව කළ ථාලිපාකය එකම ථාලිපාකය විය.",
      "paliTitle": ""
    },
    {
      "number": 272,
      "pali": "‘‘Passānanda, sabbete saṅkhārā atītā niruddhā vipariṇatā. Evaṃ aniccā kho, ānanda, saṅkhārā; evaṃ addhuvā kho, ānanda, saṅkhārā; evaṃ anassāsikā kho, ānanda, saṅkhārā! Yāvañcidaṃ, ānanda, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccituṃ. ‘‘Chakkhattuṃ kho panāhaṃ, ānanda, abhijānāmi imasmiṃ padese sarīraṃ nikkhipitaṃ, tañca kho rājāva samāno cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyapatto sattaratanasamannāgato, ayaṃ sattamo sarīranikkhepo. Na kho panāhaṃ, ānanda, taṃ padesaṃ samanupassāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yattha tathāgato aṭṭhamaṃ sarīraṃ nikkhipeyyā’’ti. Idamavoca bhagavā, idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Aniccā vata saṅkhārā, uppādavayadhammino; Uppajjitvā nirujjhanti, tesaṃ vūpasamo sukho’’ti.",
      "english": "\"Ananda, observe that all these formations are gone, ceased, and transformed. Thus, Ananda, are formations impermanent; thus, Ananda, are formations unstable; thus, Ananda, are formations unreliable! Therefore, Ananda, it is quite enough to become disenchanted with all formations, enough to become dispassionate, enough to be liberated.\n\n\"Indeed, Ananda, I recall laying down my body in this very place six times, each time as a righteous Wheel-Turning Monarch, a just king who ruled by Dhamma, a conqueror of the four corners of the earth, who had attained stability in the land, and was endowed with the seven treasures. This is the seventh laying down of my body. But, Ananda, I do not perceive any place in this world with its devas, Maras, and Brahmas, among this generation of ascetics and brahmins, devas and humans, where the Tathagata would lay down an eighth body.\"\n\nThis the Blessed One said. Having said this, the Well-Gone One, the Teacher, then added:\n\n\"Impermanent, indeed, are formations,\nSubject to arising and passing away.\nHaving arisen, they cease;\nTheir stilling is bliss.\"",
      "sinhala": "ආනන්දය, අතීත වූ, නිරුද්ධ වූ, විපරිණාමයට පත් වූ සියලු සංස්කාරයන් දෙස බලන්න. ආනන්දය, සංස්කාරයන් මෙසේ අනිත්‍ය ය. ආනන්දය, සංස්කාරයන් මෙසේ අස්ථිර ය. ආනන්දය, සංස්කාරයන් මෙසේ විශ්වාස කළ නොහැකි ය. ආනන්දය, සියලු සංස්කාරයන් කෙරෙහි කලකිරීමටත්, විරාගී වීමටත්, මිදීමටත් මෙය සෑහේ.\n\nආනන්දය, මම මේ ප්‍රදේශයේ සය වරක් ශරීරය අත්හැර ඇති බව දනිමි. ඒ සෑම අවස්ථාවකදීම, මම ධර්මිෂ්ඨ වූ, ධර්මරාජ වූ, සතර දිග්විජය කළ, ජනපදයන්හි ස්ථාවරත්වය පත් වූ, සත් රුවනින් සමන්විත සක්විති රජෙක් වීමි. මෙය සත්වන වරට ශරීරය අත්හැරීමයි. ආනන්දය, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත මේ ලෝකයේ තථාගතයන් වහන්සේ අටවන වරට ශරීරය අත්හැරීමට සුදුසු ස්ථානයක් මම නොදකිමි.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගතයන් වහන්සේ මෙසේ වදාරා ශාස්තෘන් වහන්සේ තවදුරටත් මෙසේ වදාළ සේක: \"සංස්කාරයෝ අනිත්‍ය වෙති. හටගැනීමත්, නැතිවීමත් ඔවුන්ගේ ස්වභාවයයි. හටගෙන නිරුද්ධ වෙති. ඔවුන්ගේ සංසිඳීම සැපයකි.\"",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahāsudassanasuttaṃ niṭṭhitaṃ catutthaṃ.",
    "english": "The Great Vision Discourse: The Fourth, Finished.",
    "sinhala": "මහාසුදස්සන සූත්‍රය නිමි. හතරවන සූත්‍රය."
  }
}