{
  "id": "dn18",
  "title": {
    "pali": "Janavasabhasuttaṃ",
    "english": "The Janavasabha Discourse",
    "sinhala": "ජනවසභ සූත්‍රය"
  },
  "sections": [
    {
      "number": 273,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā nātike [nādike (sī. syā. pī.)] viharati giñjakāvasathe. Tena kho pana samayena bhagavā parito parito janapadesu paricārake abbhatīte kālaṅkate upapattīsu byākaroti kāsikosalesu vajjimallesu cetivaṃsesu [cetiyavaṃsesu (ka.)] kurupañcālesu majjhasūrasenesu [macchasurasenesu (syā.), macchasūrasenesu (sī. pī.)] – ‘‘asu amutra upapanno, asu amutra upapanno [upapannoti (ka.)]. Paropaññāsa nātikiyā paricārakā abbhatītā kālaṅkatā tasmā lokā. Sādhikā navuti nātikiyā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmino, sakideva [sakiṃdeva (ka.)] imaṃ lokaṃ āgantvā dukkhassantaṃ karissanti. Sātirekāni pañcasatāni nātikiyā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpannā avinipātadhammā niyatā sambodhiparāyaṇā’’ti.",
      "english": "Thus I have heard. At one time the Blessed One was staying at Nātika, in the Brick Hall.\n\nAt that time, the Blessed One was declaring throughout the surrounding countryside the destinies of departed attendants, saying: \"So-and-so has been reborn there, so-and-so has been reborn there,\" specifying those in the regions of Kāsi-Kosala, Vajji-Malla, Ceti, Kuru-Pañcāla, and Mathurā.\n\nMore than fifty attendants from Nātika have passed away, deceased from this world. More than ninety attendants from Nātika have passed away and, with the destruction of the three fetters and the weakening of lust, hatred, and delusion, are once-returners, destined to return to this world only once more before making an end to suffering. More than five hundred attendants from Nātika have passed away and, with the destruction of the three fetters, are stream-enterers, no longer subject to downfall, assured, destined for enlightenment.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ නාථික නම් ග්‍රාමයේ ගිඤ්ජකාවසථ නම් ස්ථානයෙහි වැඩ වාසය කළහ. එකල්හි භාග්‍යවතුන් වහන්සේ වටින් වටින් පිහිටි ජනපදයන්හි මියගිය පරිචාරකයන් නැවත උපන් තැන් ගැන මෙසේ වදාළ සේක: \"කාසි, කොසල, වජ්ජි, මල්ල, චේති වංශයන්හි, කුරු, පංචාල, මධ්‍යසූරසේන යන ජනපදවල, 'අසවලා මෙහි උපන්නේය, අසවලා එහි උපන්නේය' (යනුවෙනි).\" නාථික ග්‍රාමයේ පරිචාරකයෝ පනස්දෙනෙකුට අධික සංඛ්‍යාවක් මිය පරලොව ගියහ. අනූවකට අධික නාථික ග්‍රාමයේ පරිචාරකයෝ තුන් සංයෝජන දුරු කිරීමෙන් රාග, ද්වේෂ, මෝහ තුනී කර සකෘදාගාමී වූවෝ, එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුක් කෙළවර කරති. පන්සියයකට අධික නාථික ග්‍රාමයේ පරිචාරකයෝ තුන් සංයෝජන දුරු කිරීමෙන් සෝතාපන්න වූවෝ, අපායට නොවැටෙන සුලු ස්වභාව ඇත්තෝ, නිත්‍ය වූවෝ, සම්බෝධිය පරායණ කොට ඇත්තෝ වෙති.",
      "paliTitle": "Nātikiyādibyākaraṇaṃ",
      "englishTitle": "Predictions regarding the Nātika clan.",
      "sinhalaTitle": "ඤාතිකියාදිව්‍යාකරණය"
    },
    {
      "number": 274,
      "pali": "Assosuṃ kho nātikiyā paricārakā – ‘‘bhagavā kira parito parito janapadesu paricārake abbhatīte kālaṅkate upapattīsu byākaroti kāsikosalesu vajjimallesu cetivaṃsesu kurupañcālesu majjhasūrasenesu – ‘asu amutra upapanno, asu amutra upapanno. Paropaññāsa nātikiyā paricārakā abbhatītā kālaṅkatā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātikā tattha parinibbāyino anāvattidhammā tasmā lokā. Sādhikā navuti nātikiyā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmino sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissanti. Sātirekāni pañcasatāni nātikiyā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpannā avinipātadhammā niyatā sambodhiparāyaṇā’ti. Tena ca nātikiyā paricārakā attamanā ahesuṃ pamuditā pītisomanassajātā bhagavato pañhaveyyākaraṇaṃ [pañhāveyyākaraṇaṃ (syā. ka.)] sutvā.",
      "english": "The Nātika lay devotees heard: \"The Blessed One, it seems, is declaring throughout the regions the fate of deceased lay devotees from Kasi-Kosala, Vajji-Malla, Ceti-Vamsa, Kuru-Pañcāla, and Majjha-Sūrasena, saying, 'So-and-so has been reborn there, so-and-so has been reborn there.' More than fifty Nātika lay devotees have passed away and, with the ending of the five lower fetters, have arisen spontaneously in the Pure Abodes, there to be extinguished, never to return from that world. More than ninety Nātika lay devotees have passed away and, with the ending of the three fetters and the attenuation of greed, hatred, and delusion, are once-returners, who, returning to this world only once more, will make an end of suffering. More than five hundred Nātika lay devotees have passed away and, with the ending of the three fetters, are stream-enterers, no longer subject to decline, assured, destined for enlightenment.\" Hearing this detailed explanation by the Blessed One, the Nātika lay devotees were pleased, delighted, filled with joy and gladness.",
      "sinhala": "නාතිකාවාසී පරිචාරකයෝ මෙසේ ඇසූහ: “භාග්‍යවතුන් වහන්සේ ජනපදයෙන් ජනපදයට සැරිසරමින් මියගිය පරිචාරකයන් පිළිබඳව ඔවුන්ගේ උපපත්ති ගැන මෙසේ වදාරන සේක: ‘කාසිකයන්හි, කෝසලයන්හි, වජ්ජි මල්ලවයන්හි, චේතියවංශයන්හි, කුරුපඤ්චාලයන්හි, මධ්‍ය සූරසේනයන්හි මෙසේ මියගිය අසවලා අසුවල් තැන ඉපදුණා, අසවලා අසුවල් තැන ඉපදුණා.’ පනස් දෙනෙකුට අධික නාතිකාවාසී පරිචාරකයෝ පහළ සංයෝජන පහක් දුරු කිරීමෙන් ඔපපාතිකව උපත ලබා එහිම පිරිනිවන් පා නැවත ඒ ලෝකයට නොඑන්නාහු වෙති. අනූ දෙනෙකුට අධික නාතිකාවාසී පරිචාරකයෝ සංයෝජන තුනක් දුරු කිරීමෙන් රාග, ද්වේශ, මෝහ තුනී කර සකෘදාගාමීව එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුක් කෙළවර කරන්නාහු වෙති. පන්සියයකට අධික නාතිකාවාසී පරිචාරකයෝ සංයෝජන තුනක් දුරු කිරීමෙන් සෝතාපන්නව අපායට නොවැටෙන ස්වභාවයෙන් යුක්තව නිවනට නැඹුරු වූවෝ වෙති.” භාග්‍යවතුන් වහන්සේගේ ඒ ප්‍රශ්න විසඳීම අසා නාතිකාවාසී පරිචාරකයෝ සතුටු වූහ, ප්‍රීතියට පත් වූහ, ප්‍රීතියෙන් හා සතුටින් ඔද වැඩුණාහුය.",
      "paliTitle": ""
    },
    {
      "number": 275,
      "pali": "Assosi kho āyasmā ānando – ‘‘bhagavā kira parito parito janapadesu paricārake abbhatīte kālaṅkate upapattīsu byākaroti kāsikosalesu vajjimallesu cetivaṃsesu kurupañcālesu majjhasūrasenesu – ‘asu amutra upapanno, asu amutra upapanno. Paropaññāsa nātikiyā paricārakā abbhatītā kālaṅkatā tasmā lokā. Sādhikā navuti nātikiyā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmino sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissanti. Sātirekāni pañcasatāni nātikiyā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpannā avinipātadhammā niyatā sambodhiparāyaṇā’ti. Tena ca nātikiyā paricārakā attamanā ahesuṃ pamuditā pītisomanassajātā bhagavato pañhaveyyākaraṇaṃ sutvā’’ti.",
      "english": "Venerable Ānanda heard that the Blessed One, truly, traveling from place to place in various regions—in Kasi-Kosala, among the Vajji-Mallas, among the Cetiya clans, among the Kuru-Pañcalas, and among the Majjha-Surasenas—was declaring the rebirths of attendants who had passed away, saying: \"So-and-so has been reborn there, and so-and-so has been reborn there.\" More than fifty Nātika attendants who had passed away from that world. More than ninety Nātika attendants who had passed away, with the destruction of the three fetters and the weakening of greed, hatred, and delusion, are once-returners, who will return to this world only once more and make an end of suffering. More than five hundred Nātika attendants who had passed away, with the destruction of the three fetters, are stream-enterers, no longer subject to falling away, assured, destined for enlightenment.\" Having heard the Blessed One's declaration, those Nātika attendants were delighted, gladdened, filled with joy and happiness.",
      "sinhala": "ආයුෂ්මත් ආනන්ද තෙරුන්ට මෙය ඇසිණි: \"භාග්‍යවත් බුදුරජාණන් වහන්සේ, විවිධ ජනපදවල සැරිසරමින්, මියගිය ඥාති පරිචාරකයන්ගේ නැවත උපන් තැන් ගැන මෙසේ පවසන සේක: 'කාසි, කොසල, වජ්ජි, මල්ල, චේතිය, වංශ, කුරු, පංචාල, මජ්ඣසූරසේන යන රටවල, අසවලා මෙතැන උපන්නා, අසවලා අහවල් තැන උපන්නා. පනස් දෙනෙකුට අධික ඥාති පරිචාරකයෝ මියගොස් මේ ලෝකයෙන් චුත වූහ. අනූ දෙනෙකුට අධික ඥාති පරිචාරකයෝ සංයෝජන තුන දුරු කොට, රාග, ද්වේෂ, මෝහ සිහින් කර සකෘදාගාමී වී එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුකට කෙළවර කරති. පන්සියයකට අධික ඥාති පරිචාරකයෝ, මියගොස් පරලොව ගිය අය අතරින්, සංයෝජන තුන දුරු කොට සෝතාපන්න වූවෝ, අපායට නොවැටෙනසුලු ස්වභාවයෙන් යුක්තව, නියත වශයෙන්ම සම්බෝධිය පරමාර්ථ කොට සිටිති.' මේ නිසා, එම ඥාති පරිචාරකයෝ භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්න විසඳීම අසා සතුටු වූහ. ප්‍රීතියෙන් හා සතුටින් ඔද වැඩී ගියහ.\"",
      "paliTitle": ""
    },
    {
      "number": 276,
      "pali": "Atha kho āyasmato ānandassa etadahosi – ‘‘ime kho panāpi ahesuṃ māgadhakā paricārakā bahū ceva rattaññū ca abbhatītā kālaṅkatā. Suññā maññe aṅgamagadhā aṅgamāgadhakehi [aṅgamāgadhikehi (syā.)] paricārakehi abbhatītehi kālaṅkatehi. Te kho panāpi [tena kho panāpi (syā.)] ahesuṃ buddhe pasannā dhamme pasannā saṅghe pasannā sīlesu paripūrakārino. Te abbhatītā kālaṅkatā bhagavatā abyākatā; tesampissa sādhu veyyākaraṇaṃ, bahujano pasīdeyya, tato gaccheyya sugatiṃ. Ayaṃ kho panāpi ahosi rājā māgadho seniyo bimbisāro dhammiko dhammarājā hito brāhmaṇagahapatikānaṃ negamānañceva jānapadānañca. Apissudaṃ manussā kittayamānarūpā viharanti – ‘evaṃ no so dhammiko dhammarājā sukhāpetvā kālaṅkato, evaṃ mayaṃ tassa dhammikassa dhammarañño vijite phāsu [phāsukaṃ (syā.)] viharimhā’ti. So kho panāpi ahosi buddhe pasanno dhamme pasanno saṅghe pasanno sīlesu paripūrakārī. Apissudaṃ manussā evamāhaṃsu – ‘yāva maraṇakālāpi rājā māgadho seniyo bimbisāro bhagavantaṃ kittayamānarūpo kālaṅkato’ti. So abbhatīto kālaṅkato bhagavatā abyākato. Tassapissa sādhu veyyākaraṇaṃ bahujano pasīdeyya, tato gaccheyya sugatiṃ. Bhagavato kho pana sambodhi magadhesu. Yattha kho pana bhagavato sambodhi magadhesu, kathaṃ tatra bhagavā māgadhake paricārake abbhatīte kālaṅkate upapattīsu na byākareyya. Bhagavā ce kho pana māgadhake paricārake abbhatīte kālaṅkate upapattīsu na byākareyya, dīnamanā [ninnamanā (syā.), dīnamānā (sī. pī.)] tenassu māgadhakā paricārakā; yena kho panassu dīnamanā māgadhakā paricārakā kathaṃ te bhagavā na byākareyyā’’ti?",
      "english": "Then it occurred to the Venerable Ananda: \"So many Magadhan attendants of the past, experienced and long-lived, have passed away and died. Anga and Magadha, I imagine, are now empty of Anga and Magadhan attendants who have passed away and died. Yet, these people were devoted to the Buddha, devoted to the Dhamma, devoted to the Sangha, and perfect in their morality. They have passed away and died, but the Blessed One has not made any pronouncement about them. It would be good if he made a pronouncement about them, so that many people would be pleased and would then go to a good destination. Furthermore, King Seniya Bimbisara of Magadha was righteous, a king of the Dhamma, a benefactor to brahmins, householders, townsfolk, and country people. Even now, people still praise him, saying: ‘That righteous king of the Dhamma made us happy before he died, and in the domain of that righteous king of the Dhamma, we lived comfortably.’ He was devoted to the Buddha, devoted to the Dhamma, devoted to the Sangha, and perfect in his morality. And people still say: ‘Even until the time of his death, King Seniya Bimbisara of Magadha died while praising the Blessed One.’ He has passed away and died, but the Blessed One has not made any pronouncement about him. It would be good if he made a pronouncement about him, so that many people would be pleased and would then go to a good destination. Moreover, the Blessed One’s enlightenment took place in Magadha. Since the Blessed One’s enlightenment was in Magadha, how can the Blessed One not declare the destiny of the Magadhan attendants who have passed away and died there? But if the Blessed One does not declare the destiny of the Magadhan attendants who have passed away and died, those Magadhan attendants will be disheartened. And how could the Blessed One not declare about them when those Magadhan attendants are disheartened?\"",
      "sinhala": "එකල්හි ආයුෂ්මත් ආනන්දයන්ට මෙසේ සිතිවිල්ලක් පහළ විය: \"පෙර විසූ, බොහෝ වූ, පළපුරුදු මාගධක උපස්ථායකයෝ කාලයාගේ ඇවෑමෙන් මිය පරලොව ගියහ. මා සිතන පරිදි, අංග මගධ දේශය, මිය පරලොව ගිය අංගමගධක උපස්ථායකයන් නිසා පාළු වී ඇත. ඒ අය බුදුන් කෙරෙහි පැහැදුණාහුය, දහම් කෙරෙහි පැහැදුණාහුය, සඟ කෙරෙහි පැහැදුණාහුය, සිල්වලින් පරිපූර්ණ වූහ. එහෙත් ඔවුන් මිය පරලොව ගිය පසු භාග්‍යවතුන් වහන්සේ ඔවුන් ගැන කිසිවක් නොදෙසූහ. ඔවුන් ගැන යමක් දේශනා කළේ නම් එය යහපත්ය. බොහෝ දෙනා සතුටු වන්නාහුය. එය සුගතියට හේතු වන්නාහ. සේනිය බිම්බිසාර රජතුමා ධර්මිෂ්ඨ වූ ධර්මරාජයෙක් විය. ඔහු බ්‍රාහ්මණ, ගෘහපතියන්ට මෙන්ම නගරවාසීන්ටත්, ජනපදවාසීන්ටත් හිතකර විය. තවද මනුෂ්‍යයෝ මෙසේ ප්‍රකාශ කරති: ‘ඒ ධර්මිෂ්ඨ ධර්මරාජයා අප සතුටු කරවා මිය ගියේය. අපි ඒ ධර්මිෂ්ඨ ධර්මරාජයාගේ රාජ්‍යයේ සුවසේ විසුවෙමු’ යැයි. ඔහු බුදුන් කෙරෙහි පැහැදුණේය, දහම් කෙරෙහි පැහැදුණේය, සඟ කෙරෙහි පැහැදුණේය, සිල්වලින් පරිපූර්ණ විය. තවද මනුෂ්‍යයෝ මෙසේ කීහ: ‘මාගධ සේනිය බිම්බිසාර රජතුමා මරණාසන්න මොහොත දක්වා භාග්‍යවතුන් වහන්සේව කීර්තිමත් කරමින් මිය ගියේය’ කියාය. ඔහු මිය පරලොව ගිය පසු භාග්‍යවතුන් වහන්සේ ඔහු ගැන කිසිවක් නොදෙසූහ. ඔහු ගැන යමක් දේශනා කළේ නම් එය යහපත්ය. බොහෝ දෙනා සතුටු වන්නාහුය. එය සුගතියට හේතු වන්නාහ. භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය මගධ දේශයේදී සිදු විය. භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය මගධ දේශයේදී සිදු වූ විට, එහිදී භාග්‍යවතුන් වහන්සේ මිය පරලොව ගිය මාගධක උපස්ථායකයන්ගේ ඉපදීම් ගැන නොපවසන්නේ කෙසේද? භාග්‍යවතුන් වහන්සේ මිය පරලොව ගිය මාගධක උපස්ථායකයන්ගේ ඉපදීම් ගැන නොපැවසුවහොත්, මාගධක උපස්ථායකයෝ සිත් තැවුලට පත් වන්නාහ. ඔවුන් සිත් තැවුලට පත් වුවහොත් භාග්‍යවතුන් වහන්සේ ඔවුන් ගැන නොපවසන්නේ කෙසේද?\"",
      "paliTitle": "Ānandaparikathā",
      "englishTitle": "Ananda's Discourse",
      "sinhalaTitle": "ආනන්දයන්ගේ කථාව"
    },
    {
      "number": 277,
      "pali": "Idamāyasmā ānando māgadhake paricārake ārabbha eko raho anuvicintetvā rattiyā paccūsasamayaṃ paccuṭṭhāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante – ‘bhagavā kira parito parito janapadesu paricārake abbhatīte kālaṅkate upapattīsu byākaroti kāsikosalesu vajjimallesu cetivaṃsesu kurupañcālesu majjhasūrasenesu – ‘‘asu amutra upapanno, asu amutra upapanno. Paropaññāsa nātikiyā paricārakā abbhatītā kālaṅkatā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātikā tattha parinibbāyino anāvattidhammā tasmā lokā. Sādhikā navuti nātikiyā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmino, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissanti. Sātirekāni pañcasatāni niyatā sambodhiparāyaṇāti. Tena ca nātikiyā paricārakā attamanā ahesuṃ pamuditā pītisomanassajātā bhagavato pañhaveyyākaraṇaṃ sutvā’’ti. Ime kho panāpi, bhante, ahesuṃ māgadhakā paricārakā bahū ceva rattaññū ca abbhatītā kālaṅkatā. Suññā maññe aṅgamagadhā aṅgamāgadhakehi paricārakehi abbhatītehi kālaṅkatehi. Te kho panāpi, bhante, ahesuṃ buddhe pasannā dhamme pasannā saṅghe pasannā sīlesu paripūrakārino, te abbhatītā kālaṅkatā bhagavatā abyākatā. Tesampissa sādhu veyyākaraṇaṃ, bahujano pasīdeyya, tato gaccheyya sugatiṃ. Ayaṃ kho panāpi, bhante, ahosi rājā māgadho seniyo bimbisāro dhammiko dhammarājā hito brāhmaṇagahapatikānaṃ negamānañceva jānapadānañca. Apissudaṃ manussā kittayamānarūpā viharanti – ‘evaṃ no so dhammiko dhammarājā sukhāpetvā kālaṅkato. Evaṃ mayaṃ tassa dhammikassa dhammarañño vijite phāsu viharimhā’ti. So kho panāpi, bhante, ahosi buddhe pasanno dhamme pasanno saṅghe pasanno sīlesu paripūrakārī. Apissudaṃ manussā evamāhaṃsu – ‘yāva maraṇakālāpi rājā māgadho seniyo bimbisāro bhagavantaṃ kittayamānarūpo kālaṅkato’ti. So abbhatīto kālaṅkato bhagavatā abyākato; tassapissa sādhu veyyākaraṇaṃ, bahujano pasīdeyya, tato gaccheyya sugatiṃ. Bhagavato kho pana, bhante, sambodhi magadhesu. Yattha kho pana, bhante, bhagavato sambodhi magadhesu, kathaṃ tatra bhagavā māgadhake paricārake abbhatīte kālaṅkate upapattīsu na byākareyya? Bhagavā ce kho pana, bhante, māgadhake paricārake abbhatīte kālaṅkate upapattīsu na byākareyya dīnamanā tenassu māgadhakā paricārakā; yena kho panassu dīnamanā māgadhakā paricārakā kathaṃ te bhagavā na byākareyyā’’ti. Idamāyasmā ānando māgadhake paricārake ārabbha bhagavato sammukhā parikathaṃ katvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi.",
      "english": "Then, venerable Ānanda, having gone into seclusion and contemplated the fate of the attendants from Magadha, arose early in the morning and went to the Blessed One. Approaching, he bowed to the Blessed One and sat to one side. Seated to one side, venerable Ānanda said to the Blessed One: \"Venerable sir, I have heard that the Blessed One declares the rebirth destinations of attendants who have passed away in various regions: in Kasi, Kosala, among the Vajjis, the Mallas, the Cetis, the Vamsas, the Kurus, the Pancalas, and the Majjhasurasenas, saying, ‘So-and-so has been reborn there, so-and-so has been reborn there.’ I heard that more than fifty attendants have passed away and, with the destruction of the five lower fetters, have been reborn spontaneously, attaining final Nibbāna in those realms, no longer subject to return to this world. Further, more than ninety attendants have passed away and, with the destruction of the three fetters and the weakening of lust, hatred, and delusion, are once-returners, destined to return to this world only once more to make an end of suffering. And more than five hundred are assured, destined for full enlightenment.\" And those attendants, having heard the Blessed One’s explanation, were delighted, joyful, and glad.\"\n\n\"But venerable sir, the attendants of Magadha were numerous, had long been devoted, and have also passed away. I fear Anga and Magadha are now bereft of those attendants from Anga and Magadha who have passed away. And these attendants, venerable sir, had faith in the Buddha, faith in the Dhamma, and faith in the Saṅgha, and were dedicated to upholding virtue. They have passed away, yet the Blessed One has not declared their fate. It would be good if he did, so that many people would be heartened and go to a good destination. Furthermore, venerable sir, King Seniya Bimbisāra of Magadha was a righteous king, a king who ruled according to Dhamma, and he was a benefactor to brahmins, householders, townspeople, and villagers alike. Even now, people remember him with praise, saying, ‘That righteous king of Dhamma made us happy, and then he passed away. We lived comfortably in the realm of that righteous king of Dhamma.’ And venerable sir, he had faith in the Buddha, faith in the Dhamma, and faith in the Saṅgha, and was dedicated to upholding virtue. Even now, people say, ‘King Seniya Bimbisāra of Magadha, praising the Blessed One until his death, passed away.’ He has passed away, yet the Blessed One has not declared his fate. It would be good if he did, so that many people would be heartened and go to a good destination. Venerable sir, the Blessed One’s enlightenment occurred in Magadha. Since the Blessed One’s enlightenment was in Magadha, how could he not declare the rebirth destinations of the attendants of Magadha who have passed away? If the Blessed One does not declare the rebirth destinations of the attendants of Magadha who have passed away, they would be disheartened. And how could the Blessed One fail to declare the fate of those attendants of Magadha, knowing they would be disheartened?\"\n\nThen, venerable Ānanda, having completed this discussion about the attendants of Magadha in the presence of the Blessed One, rose from his seat, bowed to the Blessed One, circumambulated him, and departed.",
      "sinhala": "ආයුෂ්මත් ආනන්දයන් වහන්සේ මාගධක පරිචාරකයන් අරභයා තනිවම රහසෙහි කල්පනා කොට රාත්‍රියෙහි අලුයම අවදිව භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් ආයුෂ්මත් ආනන්දයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කීහ. “ස්වාමීනි, මම මෙසේ අසා ඇත්තෙමි: ‘භාග්‍යවතුන් වහන්සේ දනව් පුරා මියගිය පරිචාරකයන්ගේ ඉපදීම් ගැන මෙසේ ව්‍යාකරණය කරති: කාසික, කෝසල, වජ්ජි, මල්ල, චේති, වංශ, කුරු, පංචාල, මජ්ඣ සුරසේන යන රටවල අසවලා අසුවල් තැන උපන්නේය’ යනුවෙනි. පනස් දෙනෙකුට වැඩි පරිචාරකයෝ පහළ සංයෝජන ධර්මයන්ගේ ක්ෂය වීමෙන් ඕපපාතිකව උපත ලබා එහිම පිරිනිවන් පාන්නාහ. ඔවුන් නැවත එම ලෝකයට නොඑන්නාහ. අනූවකට වැඩි පරිචාරකයෝ තුන් සංයෝජනයන්ගේ ක්ෂය වීමෙන්, රාග, ද්වේෂ, මෝහ සිහින් වීමෙන් සකෘදාගාමී වෙති. ඔවුන් මේ ලෝකයට එක් වරක් පමණක් පැමිණ දුකට කෙළවර කරන්නාහ. පන්සියයකට අධික පිරිසක් නිසැකවම සම්බෝධියට නැඹුරු වූවෝ වෙති.’ එමෙන්ම එම පරිචාරකයෝ භාග්‍යවතුන් වහන්සේගේ ව්‍යාකරණය අසා සතුටු වූහ. ප්‍රීතිය හා සතුට උපදවා ගත්තාහුය.”\n\n“ස්වාමීනි, මේ මාගධක පරිචාරකයෝද බොහෝ දෙනෙක් වූ, පැරණි පිරිසක් ලෙස මිය පරලොව ගියහ. මම සිතන්නේ අංග මගධ රටවල් මිය පරලොව ගිය අංග මගධක පරිචාරකයන්ගෙන් හිස් වූවාක් මෙනි. ස්වාමීනි, ඔවුහු බුදුන් කෙරෙහි පැහැදුණහ. දහම් කෙරෙහි පැහැදුණහ. සඟ කෙරෙහි පැහැදුණහ. සිල්වලින් පිරිපුන් වූහ. එහෙත් ඔවුන් මිය පරලොව ගිය පසු භාග්‍යවතුන් වහන්සේ විසින් ව්‍යාකරණය නොකරන ලදහ. ඔවුන් ගැනද ව්‍යාකරණය කිරීම යහපත්ය. බොහෝ දෙනා සතුටු වෙති. එහෙයින් සුගතියට යති.\n\nස්වාමීනී, සේනිය බිම්බිසාර රජතුමා ධර්මිෂ්ඨ, ධර්මරාජ වූ අතර බ්‍රාහ්මණ ගෘහපතියන්ටද, නෛගම ජනපදවාසීන්ටද හිතැති විය. ‘ඒ ධර්මිෂ්ඨ, ධර්මරාජ රජතුමා අප සතුටු කරවා මිය ගියේය. අපි ඔහුගේ ධර්මිෂ්ඨ රාජ්‍යයේ සුවසේ විසුවෙමු’ යැයි මිනිස්සු පවසති. ස්වාමීනී, ඔහු බුදුන් කෙරෙහි පැහැදුණේය. දහම් කෙරෙහි පැහැදුණේය. සඟ කෙරෙහි පැහැදුණේය. සිල්වලින් පිරිපුන් විය. ‘සේනිය බිම්බිසාර රජතුමා මරණාසන්න මොහොත දක්වා භාග්‍යවතුන් වහන්සේගේ ගුණ වර්ණනා කරමින් මිය ගියේය’ යැයි මිනිස්සු කියති. ඔහු මිය පරලොව ගිය පසු භාග්‍යවතුන් වහන්සේ විසින් ව්‍යාකරණය නොකරන ලදී. ඔහු ගැනද ව්‍යාකරණය කිරීම යහපත්ය. බොහෝ දෙනා සතුටු වෙති. එහෙයින් සුගතියට යති.\n\nස්වාමීනී, භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය ලැබුවේ මගධ දේශයේදීය. භාග්‍යවතුන් වහන්සේගේ සම්බෝධිය මගධ දේශයේදී ලැබුවේ නම්, එහිදී භාග්‍යවතුන් වහන්සේ මිය පරලොව ගිය මාගධක පරිචාරකයන්ගේ ඉපදීම් ගැන ව්‍යාකරණය නොකරන්නේ කෙසේද? ස්වාමීනී, භාග්‍යවතුන් වහන්සේ මිය පරලොව ගිය මාගධක පරිචාරකයන්ගේ ඉපදීම් ගැන ව්‍යාකරණය නොකරන්නේ නම්, මාගධක පරිචාරකයෝ කණගාටු වෙති. මාගධක පරිචාරකයෝ කණගාටු වන්නේ නම්, භාග්‍යවතුන් වහන්සේ ඔවුන් ගැන ව්‍යාකරණය නොකරන්නේ කෙසේද?”\n\nආයුෂ්මත් ආනන්දයන් වහන්සේ මාගධක පරිචාරකයන් අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ කථා කොට අසුනෙන් නැගිට භාග්‍යවතුන් වහන්සේට වැඳ පැදකුණු කොට නික්ම ගියහ.",
      "paliTitle": ""
    },
    {
      "number": 278,
      "pali": "Atha kho bhagavā acirapakkante āyasmante ānande pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya nātikaṃ piṇḍāya pāvisi. Nātike piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto pāde pakkhāletvā giñjakāvasathaṃ pavisitvā māgadhake paricārake ārabbha aṭṭhiṃ katvā [aṭṭhikatvā (sī. syā. pī.)] manasikatvā sabbaṃ cetasā [sabbacetasā (pī.)] samannāharitvā paññatte āsane nisīdi – ‘‘gatiṃ nesaṃ jānissāmi abhisamparāyaṃ, yaṃgatikā te bhavanto yaṃabhisamparāyā’’ti. Addasā kho bhagavā māgadhake paricārake ‘‘yaṃgatikā te bhavanto yaṃabhisamparāyā’’ti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito giñjakāvasathā nikkhamitvā vihārapacchāyāyaṃ paññatte āsane nisīdi.",
      "english": "Soon after the Venerable Ānanda departed, the Blessed One, in the forenoon, dressed, took his bowl and robe, and entered Nātika for alms. After walking for alms in Nātika, and after his meal, returning from his alms-round, he washed his feet and entered the Giñjaka Rest House. Regarding the Magadhan attendants, he focused on them, applied his mind to them in every way, reflected on them in his heart, and sat down on the prepared seat, thinking, \"I will know their destiny and future destination—what their destiny is, and what their future destination will be.\" The Blessed One saw the Magadhan attendants and knew \"what their destiny is, and what their future destination will be.\" Then, in the late afternoon, the Blessed One, rising from seclusion, left the Giñjaka Rest House and sat down on the prepared seat in the shade behind the monastery.",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ, ආයුෂ්මත් ආනන්දයන් වහන්සේ පිටත්ව ගොස් වැඩි වේලාවක් ගත වීමට මත්තෙන්, පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු ගෙන නාථික ග්‍රාමයට පිණ්ඩපාතය සඳහා වැඩම කළ සේක. නාථික ග්‍රාමයේ පිණ්ඩපාතයේ හැසිර, දානය වැළඳීමෙන් පසු පිණ්ඩපාත්‍රය පසෙක තබා, පාද සෝදා ගිඤ්ජකාවසථ නම් ආරාමයට පිවිස, මාගධක පරිචාරකයන් පිළිබඳව අධිෂ්ඨාන කොට, මනසින් කල්පනා කොට, සියල්ල සිතින් ඒකරාශි කොට, පනවන ලද අසුනෙහි වැඩ හිඳ මෙසේ කල්පනා කළ සේක: \"ඒ මාගධක පරිචාරකයන්ගේ ගති හා මරණින් මතු ඔවුන් ලබන උපත මම දැන ගන්නෙමි. ඒ භවත්හු කුමන ගතියක් ඇත්තාහුද? ඔවුන්ගේ මරණින් මතු උපත කුමක් වේද?\". භාග්‍යවතුන් වහන්සේ ඒ මාගධක පරිචාරකයන්ගේ ගති හා මරණින් මතු ලබන උපත දුටු සේක. අනතුරුව භාග්‍යවතුන් වහන්සේ සවස් කාලයේ විවේකයෙන් නැගිට ගිඤ්ජකාවසථයෙන් පිටතට වැඩම කොට විහාරයේ පසුපස සෙවණෙහි පනවන ලද අසුනෙහි වැඩ හිඳි සේක.",
      "paliTitle": ""
    },
    {
      "number": 279,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘upasantapadisso [upasantapatiso (ka.)] bhante bhagavā bhātiriva bhagavato mukhavaṇṇo vippasannattā indriyānaṃ. Santena nūnajja bhante bhagavā vihārena vihāsī’’ti? ‘‘Yadeva kho me tvaṃ, ānanda, māgadhake paricārake ārabbha sammukhā parikathaṃ katvā uṭṭhāyāsanā pakkanto, tadevāhaṃ nātike piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto pāde pakkhāletvā giñjakāvasathaṃ pavisitvā māgadhake paricārake ārabbha aṭṭhiṃ katvā manasikatvā sabbaṃ cetasā samannāharitvā paññatte āsane nisīdiṃ – ‘gatiṃ nesaṃ jānissāmi abhisamparāyaṃ, yaṃgatikā te bhavanto yaṃabhisamparāyā’ti. Addasaṃ kho ahaṃ, ānanda, māgadhake paricārake ‘yaṃgatikā te bhavanto yaṃabhisamparāyā’’’ti.",
      "english": "Then venerable Ānanda approached the Blessed One, and after paying homage, sat down to one side. Seated to one side, venerable Ānanda said to the Blessed One: \"Venerable sir, the Blessed One appears peaceful; the complexion of the Blessed One's face is radiant due to the serenity of the senses. Surely, venerable sir, the Blessed One has been dwelling in a peaceful state today?\"\n\n\"Just as you, Ānanda, concluded our discussion about the Magadhan wanderers and left your seat, I, without delaying, went for alms, and after returning from the alms round after the meal, I washed my feet and entered the Giñjaka Hall. There, focusing on the Magadhan wanderers, attending to the matter, and considering everything in my mind, I sat down on the prepared seat, thinking, 'I will know their destiny, their future state—what their destiny is, what their future state will be.' And I saw, Ānanda, the Magadhan wanderers: what their destiny is, what their future state will be.\"",
      "sinhala": "ඉක්බිති ආයුෂ්මත් ආනන්දයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක හිඳගත්හ. එකත්පසෙක හිඳගත් ආයුෂ්මත් ආනන්දයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සන්සුන් පෙනුමකින් යුක්තය. භාග්‍යවතුන් වහන්සේගේ මුහුණේ පැහැය ඉතා පැහැදිලිය. ඉන්ද්‍රියයන් ප්‍රසන්නව පවතියි. ස්වාමීනි, අද භාග්‍යවතුන් වහන්සේ සන්සුන් විහරණයකින් වැඩ සිටියා විය යුතුයි.”\n\n“ආනන්දය, මාගධක පරිචාරකයන් ගැන ඔබ මා ඉදිරියේ සාකච්ඡා කර, අසුනෙන් නැගිට ගිය මොහොතේම, මම වැඩි ඈතකට නොගොස් පිණ්ඩපාතයෙන් ආපසු පැමිණ, දානයෙන් පසු පාද සෝදා ගිඤ්ජකාවසථයට පිවිස මාගධක පරිචාරකයන් ගැන සිත යොමු කොට, මනසින් මෙනෙහි කොට, සියල්ල සිතට නඟා පිළියෙල කළ අසුනෙහි හිඳගතිමි. ‘ඔවුන්ගේ ගතිය හා මරණින් මතු උපත මම දැනගන්නෙමි. ඒ භවත්හු කිනම් ගතියක් ඇත්තෝද, කිනම් මරණින් මතු උපතක් ඇත්තෝදැ’යි සිතුවෙමි. ආනන්දය, ‘ඒ භවත් මාගධක පරිචාරකයෝ කිනම් ගතියක් ඇත්තෝද, කිනම් මරණින් මතු උපතක් ඇත්තෝද’ යනු මම දුටුවෙමි.”",
      "paliTitle": ""
    },
    {
      "number": 280,
      "pali": "‘‘Atha kho, ānanda, antarahito yakkho saddamanussāvesi – ‘janavasabho ahaṃ bhagavā; janavasabho ahaṃ sugatā’ti. Abhijānāsi no tvaṃ, ānanda, ito pubbe evarūpaṃ nāmadheyyaṃ sutaṃ [sutvā (pī.)] yadidaṃ janavasabho’’ti? ‘‘Na kho ahaṃ, bhante, abhijānāmi ito pubbe evarūpaṃ nāmadheyyaṃ sutaṃ yadidaṃ janavasabhoti, api ca me, bhante, lomāni haṭṭhāni ‘janavasabho’ti nāmadheyyaṃ sutvā. Tassa mayhaṃ, bhante, etadahosi – ‘na hi nūna so orako yakkho bhavissati yadidaṃ evarūpaṃ nāmadheyyaṃ supaññattaṃ yadidaṃ janavasabho’’ti. ‘‘Anantarā kho, ānanda, saddapātubhāvā uḷāravaṇṇo me yakkho sammukhe pāturahosi. Dutiyampi saddamanussāvesi – ‘bimbisāro ahaṃ bhagavā; bimbisāro ahaṃ sugatāti. Idaṃ sattamaṃ kho ahaṃ, bhante, vessavaṇassa mahārājassa sahabyataṃ upapajjāmi, so tato cuto manussarājā bhavituṃ pahomi [so tato cuto manussarājā, amanussarājā divi homi (sī. pī.)]. Ito satta tato satta, saṃsārāni catuddasa; Nivāsamabhijānāmi, yattha me vusitaṃ pure.",
      "english": "Then, Ānanda, a spirit, having vanished from sight, made his voice heard, saying, \"I am Janavasabha, Blessed One; I am Janavasabha, Well-Gone One.\" Ānanda, do you recall ever having heard a name like Janavasabha before?\" \"No, venerable sir, I do not recall ever having heard a name like Janavasabha. But, venerable sir, the hairs on my body stood on end when I heard the name 'Janavasabha.' It occurred to me, venerable sir, 'Surely this cannot be an ordinary spirit, so well-known by a name like Janavasabha.'\" Immediately after the voice arose, Ānanda, a spirit of great radiance appeared before me. A second time he made his voice heard, saying, \"I am Bimbisāra, Blessed One; I am Bimbisāra, Well-Gone One.\" This is the seventh time, venerable sir, that I have been reborn into association with the great King Vessavaṇa. Having passed away from there, I am able to become a human king. From here seven, from there seven, fourteen rebirths: I remember the dwellings where I lived in the past.\"",
      "sinhala": "‘‘ආනන්දය, ඉක්බිති අතුරුදහන් වූ යක්ෂයෙක් හඬක් නඟා මෙසේ පැවසීය. ‘භාග්‍යවතුන් වහන්ස, මම ජනවසභ වෙමි. සුගතයන් වහන්ස, මම ජනවසභ වෙමි.’ ආනන්දය, ‘ජනවසභ’ යන මේ නම මීට පෙර ඔබ අසා තිබේදැ’’යි විමසීය. ‘‘ස්වාමීනි, මම මීට පෙර ‘ජනවසභ’ යන නම අසා නැත. එහෙත්, ස්වාමීනි, ‘ජනවසභ’ යන නම ඇසූ පමණින් මගේ ලොම් දහ ගැන්වුණි. ස්වාමීනි, එවිට මට මෙබඳු අදහසක් ඇති විය. ‘ජනවසභ යන මෙතරම් උතුම් නමක් ඇති යක්ෂයා සුළු යක්ෂයෙකු විය නොහැකැ’යි මට සිතිණි.’’ ‘‘ආනන්දය, හඬ ඇසී ටික වේලාවකින් උතුම් වර්ණ ඇති යක්ෂයෙක් මා ඉදිරියේ පෙනී සිටියේය. දෙවන වරටත් හඬක් නඟා මෙසේ පැවසීය. ‘භාග්‍යවතුන් වහන්ස, මම බිම්බිසාර වෙමි. සුගතයන් වහන්ස, මම බිම්බිසාර වෙමි.’ ස්වාමීනි, මම මේ වෛශ්‍රවණ මහරජුන්ගේ ඇසුරට පැමිණෙන්නේ සත්වන වරටයි. එතැනින් චුත වීමෙන් මම මිනිස් රජ වීමට සුදුස්සෙක් වෙමි. මෙතැන් සිට හත් වරක්ද, එතැන් සිට හත් වරක්ද වශයෙන් සංසාර ගමන් දාහතරක් ඇත. මම පෙර විසූ වාසස්ථාන හොඳින් දනිමි.’’",
      "paliTitle": "Janavasabhayakkho",
      "englishTitle": "Janavasabha the Yakkha",
      "sinhalaTitle": "ජනවසභයක්ඛෝ"
    },
    {
      "number": 281,
      "pali": "‘Dīgharattaṃ kho ahaṃ, bhante, avinipāto avinipātaṃ sañjānāmi, āsā ca pana me santiṭṭhati sakadāgāmitāyā’ti. ‘Acchariyamidaṃ āyasmato janavasabhassa yakkhassa, abbhutamidaṃ āyasmato janavasabhassa yakkhassa. ‘‘Dīgharattaṃ kho ahaṃ, bhante, avinipāto avinipātaṃ sañjānāmī’’ti ca vadesi, ‘‘āsā ca pana me santiṭṭhati sakadāgāmitāyā’’ti ca vadesi, kutonidānaṃ panāyasmā janavasabho yakkho evarūpaṃ uḷāraṃ visesādhigamaṃ sañjānātīti? Na aññatra, bhagavā, tava sāsanā, na aññatra [aññattha (sī. pī.)], sugata, tava sāsanā; yadagge ahaṃ, bhante, bhagavati ekantikato [ekantato (syā.), ekantagato (pī.)] abhippasanno, tadagge ahaṃ, bhante, dīgharattaṃ avinipāto avinipātaṃ sañjānāmi, āsā ca pana me santiṭṭhati sakadāgāmitāya. Idhāhaṃ, bhante, vessavaṇena mahārājena pesito virūḷhakassa mahārājassa santike kenacideva karaṇīyena addasaṃ bhagavantaṃ antarāmagge giñjakāvasathaṃ pavisitvā māgadhake paricārake ārabbha aṭṭhiṃ katvā manasikatvā sabbaṃ cetasā samannāharitvā nisinnaṃ – ‘‘gatiṃ nesaṃ jānissāmi abhisamparāyaṃ, yaṃgatikā te bhavanto yaṃabhisamparāyā’’ti. Anacchariyaṃ kho panetaṃ, bhante, yaṃ vessavaṇassa mahārājassa tassaṃ parisāyaṃ bhāsato sammukhā sutaṃ sammukhā paṭiggahitaṃ – ‘‘yaṃgatikā te bhavanto yaṃabhisamparāyā’’ti. Tassa mayhaṃ, bhante, etadahosi – bhagavantañca dakkhāmi, idañca bhagavato ārocessāmīti. Ime kho me, bhante, dvepaccayā bhagavantaṃ dassanāya upasaṅkamituṃ’.",
      "english": "'For a long time, venerable sir, I have known no descent into states of woe, and hope remains in me for becoming a once-returner.'\n\n'It is astounding, venerable Janavasabha the Yakkha, it is amazing! You say, \"For a long time, venerable sir, I have known no descent into states of woe,\" and you say, \"Hope remains in me for becoming a once-returner.\" From what cause, venerable Janavasabha the Yakkha, do you know such an eminent and extraordinary attainment?'\n\n'From nothing other, Blessed One, than your teaching; from nothing other, Well-Gone One, than your teaching. From the time, venerable sir, I became utterly devoted to the Blessed One, from that time, venerable sir, I have known no descent into states of woe, and hope remains in me for becoming a once-returner. Here, venerable sir, sent by King Vessavana to King Virūḷhaka for some matter, I saw the Blessed One on the road. He had entered the Giñjaka Rest House and was focusing his mind entirely—attending to and considering—the Māgadhaka attendants, thinking, \"I will know their destiny, their future state, what their destiny is and what their future state will be.\" But it is not astonishing, venerable sir, that I heard and received in the presence of King Vessavana, speaking in that assembly, about \"what their destiny is and what their future state will be.\" Then it occurred to me, venerable sir, \"I will see the Blessed One and report this to him.\" These, venerable sir, are the two reasons I have approached the Blessed One for an audience.'",
      "sinhala": "‘ස්වාමීනි, මම බොහෝ කලක් තිස්සේ අපායට පත් නොවී සිටින බව දනිමි. එමෙන්ම සකෘදාගාමී වීමේ බලාපොරොත්තුවක් ද මට තිබේ.’ ‘ජනවසභ නම් යක්ෂයාගේ මෙය පුදුම සහගතය. ජනවසභ නම් යක්ෂයාගේ මෙය අද්භූතයකි. ‘ස්වාමීනි, මම බොහෝ කලක් තිස්සේ අපායට පත් නොවී සිටින බව දනිමි,’ යැයි ඔබ පවසන අතර, ‘එමෙන්ම සකෘදාගාමී වීමේ බලාපොරොත්තුවක් ද මට තිබේ,’ යැයි ඔබ පවසන්නේ නම්, ජනවසභ නම් යක්ෂයා මෙවැනි උසස් විශේෂ දැනුමක් ලබාගත්තේ කෙසේද?’ ‘භාග්‍යවතුන් වහන්ස, එය ඔබ වහන්සේගේ ශාසනයෙන් මිස වෙනත් තැනකින් නොවේ. සුගතයන් වහන්ස, ඔබ වහන්සේගේ ශාසනයෙන් මිස වෙනත් තැනකින් නොවේ. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ කෙරෙහි ඒකාන්ත වශයෙන් පැහැදුණු දා පටන් බොහෝ කලක් තිස්සේ අපායට පත් නොවී සිටින බව දනිමි. එමෙන්ම සකෘදාගාමී වීමේ බලාපොරොත්තුවක් ද මට තිබේ. ස්වාමීනි, වෙසමුණි මහරජතුමා විසින් විරූඪක මහරජුගේ සමීපයට යම් කාරණයක් සඳහා මා යවන ලදී. එසේ යන අතරමගදී ගිඤ්ජකාවසථයට ඇතුළු වූ භාග්‍යවතුන් වහන්සේ, මාගධක උපස්ථායකයන් අරභයා ඇටසැකිල්ලක් මෙනෙහි කරමින්, සිත ඒකාග්‍ර කරගෙන, ‘මේ අයගේ මරණින් මතු ගතිය කුමක්ද, ඔවුන් යන්නේ කුමන ගතියකටද, කුමන උපතකටදැ’යි විමසමින් වැඩ සිටිනු දුටුවෙමි. ස්වාමීනි, වෙසමුණි මහරජතුමා ඒ පිරිසට කථා කරන විට මුඛයෙන් අසා, මුඛයෙන්ම පිළිගත්තා වූ ‘මේ අයගේ මරණින් මතු ගතිය කුමක්ද, ඔවුන් යන්නේ කුමන ආකාරයකටද’ යන මේ කාරණය පුදුමයක් නොවේ. ස්වාමීනි, එවිට මට මෙවැනි අදහසක් ඇති විය. භාග්‍යවතුන් වහන්සේව ද දකිමි, භාග්‍යවතුන් වහන්සේට මේ කාරණය ද දැන්වෙමි’යි සිතුවෙමි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ දැකීමට පැමිණීමට මේ කරුණු දෙක මට හේතු විය.’",
      "paliTitle": ""
    },
    {
      "number": 282,
      "pali": "‘Purimāni, bhante, divasāni purimatarāni tadahuposathe pannarase vassūpanāyikāya puṇṇāya puṇṇamāya rattiyā kevalakappā ca devā tāvatiṃsā sudhammāyaṃ sabhāyaṃ sannisinnā honti sannipatitā. Mahatī ca dibbaparisā [dibbā parisā (sī. pī.)] samantato nisinnā honti [nisinnā hoti (sī.), sannisinnā honti sannipatitā (ka.)], cattāro ca mahārājāno catuddisā nisinnā honti. Puratthimāya disāya dhataraṭṭho mahārājā pacchimābhimukho [pacchābhimukho (ka.)] nisinno hoti deve purakkhatvā; dakkhiṇāya disāya virūḷhako mahārājā uttarābhimukho nisinno hoti deve purakkhatvā; pacchimāya disāya virūpakkho mahārājā puratthābhimukho nisinno hoti deve purakkhatvā; uttarāya disāya vessavaṇo mahārājā dakkhiṇābhimukho nisinno hoti deve purakkhatvā. Yadā, bhante, kevalakappā ca devā tāvatiṃsā sudhammāyaṃ sabhāyaṃ sannisinnā honti sannipatitā, mahatī ca dibbaparisā samantato nisinnā honti, cattāro ca mahārājāno catuddisā nisinnā honti. Idaṃ nesaṃ hoti āsanasmiṃ; atha pacchā amhākaṃ āsanaṃ hoti. Ye te, bhante, devā bhagavati brahmacariyaṃ caritvā adhunūpapannā tāvatiṃsakāyaṃ, te aññe deve atirocanti vaṇṇena ceva yasasā ca. Tena sudaṃ, bhante, devā tāvatiṃsā attamanā honti pamuditā pītisomanassajātā ‘‘dibbā vata bho kāyā paripūrenti, hāyanti asurakāyā’’ti. Atha kho, bhante, sakko devānamindo devānaṃ tāvatiṃsānaṃ sampasādaṃ viditvā imāhi gāthāhi anumodi – ‘‘Modanti vata bho devā, tāvatiṃsā sahindakā [saindakā (sī.)]; Tathāgataṃ namassantā, dhammassa ca sudhammataṃ. Nave deve ca passantā, vaṇṇavante yasassine [yasassino (syā.)]; Sugatasmiṃ brahmacariyaṃ, caritvāna idhāgate. Te aññe atirocanti, vaṇṇena yasasāyunā; Sāvakā bhūripaññassa, visesūpagatā idha. Idaṃ disvāna nandanti, tāvatiṃsā sahindakā; Tathāgataṃ namassantā, dhammassa ca sudhammata’’nti. ‘Tena sudaṃ, bhante, devā tāvatiṃsā bhiyyosomattāya attamanā honti pamuditā pītisomanassajātā ‘‘dibbā vata, bho, kāyā paripūrenti, hāyanti asurakāyā’’ti. Atha kho, bhante, yenatthena devā tāvatiṃsā sudhammāyaṃ sabhāyaṃ sannisinnā honti sannipatitā, taṃ atthaṃ cintayitvā taṃ atthaṃ mantayitvā vuttavacanāpi taṃ [vuttavacanā nāmidaṃ (ka.)] cattāro mahārājāno tasmiṃ atthe honti. Paccānusiṭṭhavacanāpi taṃ [paccānusiṭṭhavacanā nāmidaṃ (ka.)] cattāro mahārājāno tasmiṃ atthe honti, sakesu sakesu āsanesu ṭhitā avipakkantā [adhipakkantā (ka.)]. Te vuttavākyā rājāno, paṭiggayhānusāsaniṃ; Vippasannamanā santā, aṭṭhaṃsu samhi āsaneti.",
      "english": "'Venerable sir, in days of old, on the fifteenth day of the rains retreat, on the full-moon night of the Vassūpanāyika, the Kevalakappa gods of the Tāvatiṃsa heaven were assembled and gathered together in the Sudhammā assembly hall. A vast heavenly retinue was seated all around, and the four Great Kings were seated in the four directions. King Dhataraṭṭha, facing west, was seated in the eastern direction, with the gods before him; King Virūḷhaka, facing north, was seated in the southern direction, with the gods before him; King Virūpakkha, facing east, was seated in the western direction, with the gods before him; King Vessavaṇa, facing south, was seated in the northern direction, with the gods before him. When, venerable sir, the Kevalakappa gods of the Tāvatiṃsa heaven were assembled and gathered together in the Sudhammā assembly hall, and a vast heavenly retinue was seated all around, and the four Great Kings were seated in the four directions, that was their seating arrangement; only then were we seated. Those gods, venerable sir, who had practiced the holy life under the Blessed One and had recently arisen in the Tāvatiṃsa heaven, outshone the other gods in both beauty and splendor. Therefore, venerable sir, the Tāvatiṃsa gods were delighted, joyful, and filled with gladness and happiness, thinking, \"Truly, the divine hosts are increasing, while the hosts of the asuras are diminishing!\" Then, venerable sir, Sakka, the lord of the gods, knowing the satisfaction of the Tāvatiṃsa gods, approved of it with these verses: \"The gods rejoice, indeed, the Tāvatiṃsa gods, together with Indra; they honor the Tathāgata and the true Dhamma. Seeing the new gods, beautiful and glorious, who, having practiced the holy life under the Well-gone One, have come here, they outshine the others in beauty, splendor, and longevity, disciples of the wise one, who have attained distinction here. Seeing this, the Tāvatiṃsa gods rejoice, together with Indra; they honor the Tathāgata and the true Dhamma.\" Therefore, venerable sir, the Tāvatiṃsa gods were even more delighted, joyful, and filled with gladness and happiness, thinking, \"Truly, the divine hosts are increasing, while the hosts of the asuras are diminishing!\" Then, venerable sir, whatever matter the Tāvatiṃsa gods had assembled and gathered together in the Sudhammā assembly hall to discuss, the four Great Kings were present in that matter, considering it and deliberating on it; even those who had already spoken were present regarding that matter. The four Great Kings were present in that matter, even those who were asked to give further explanation, standing in their respective seats, without departing. Those kings, having spoken their words, having received the instruction, with serene and calm minds, stood firmly in their seats.'",
      "sinhala": "ස්වාමීනි, මීට පෙර දිනවල, එනම් වස් එළඹෙන පුර පසළොස්වක පොහෝ දිනයේදී, සියලු තව්තිසා දෙවියෝ සුධර්මා සභාවේ රැස්වී සිටියහ. මහත් වූ දිව්‍ය පිරිසක් ද වටපිටෙහි රැස්වී සිටියහ. සතර මහා රාජවරු සිව් දිසාවන්හි හිඳගෙන සිටියහ. නැගෙනහිර දිසාවේ ධෘතරාෂ්ට්‍ර මහරජු දෙවියන් ඉදිරියෙහි තබා බටහිර දෙසට මුහුණලා හිඳගෙන සිටියේය. දකුණු දිසාවේ විරූඪ මහරජු දෙවියන් ඉදිරියෙහි තබා උතුරු දෙසට මුහුණලා හිඳගෙන සිටියේය. බටහිර දිසාවේ විරූපාක්ෂ මහරජු දෙවියන් ඉදිරියෙහි තබා නැගෙනහිර දෙසට මුහුණලා හිඳගෙන සිටියේය. උතුරු දිසාවේ වෛශ්‍රවණ මහරජු දෙවියන් ඉදිරියෙහි තබා දකුණු දෙසට මුහුණලා හිඳගෙන සිටියේය. ස්වාමීනි, යම් කලෙක සියලු තව්තිසා දෙවියෝ සුධර්මා සභාවේ රැස්වී සිටිද්දී, මහත් වූ දිව්‍ය පිරිසක් වටපිටෙහි රැස්වී සිටිද්දී, සතර මහා රාජවරු සිව් දිසාවන්හි හිඳගෙන සිටිද්දී, ඔවුන්ට අසුන් පනවන ලදී. ඉන්පසු අපට අසුන් ලැබුණි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාවෙහි හැසිරීමෙන් පසු යම් දෙවියන් පිරිසක් මේ වන විට තව්තිසා දෙව්ලොවෙහි උපත ලබා ඇත්ද, ඔවුහු වර්ණයෙන් හා යසසින් අනෙක් දෙවියන්ට වඩා බැබළෙති. ස්වාමීනි, එහෙයින් තව්තිසා දෙවියෝ සතුටු වූවෝ ද, ප්‍රමුදිත වූවෝ ද, ප්‍රීතියෙන් හා සෝමනස්සයෙන් පිරී ගියාවූවෝ ද, 'ඇත්තෙන්ම දිව්‍ය කායයන් පිරිලා, අසුර කායයන් පිරිහෙමින් පවතී' යැයි ප්‍රීතිඝෝෂා කළහ. ස්වාමීනි, එවිට දෙවියන්ට අධිපති ශක්‍රයා තව්තිසා දෙවියන්ගේ සතුට දැන මෙම ගාථාවන්ගෙන් අනුමෝදනා කළේය.\n\n'සක් දෙවිඳුන් සහිත තව්තිසා දෙවියෝ ප්‍රීති වෙති. තථාගතයන් වහන්සේටත්, ධර්මයේ යහපත් බවටත් නමස්කාර කරමින්, වර්ණවත් වූ, යසස් ඇති අලුත් දෙවියන් දකිමින්, සුගතයන් වහන්සේ කෙරෙහි බ්‍රහ්මචර්යාවෙහි හැසිරීමෙන් මෙහි පැමිණියෝය. ඔවුහු වර්ණයෙන් ද, යසසින් ද, ආයුෂයෙන් ද අනෙක් දෙවියන්ට වඩා බැබළෙති. භූරි ප්‍රඥාවන්තයන්ගේ ශ්‍රාවකයෝ මෙහි විශිෂ්ටත්වයට පැමිණියහ. මෙය දැක සක් දෙවිඳුන් සහිත තව්තිසා දෙවියෝ සතුටු වෙති. තථාගතයන් වහන්සේටත්, ධර්මයේ යහපත් බවටත් නමස්කාර කරමින්'.\"\n\n\"ස්වාමීනි, එහෙයින් තව්තිසා දෙවියෝ බොහෝ සෙයින් සතුටු වූවෝ ද, ප්‍රමුදිත වූවෝ ද, ප්‍රීතියෙන් හා සෝමනස්සයෙන් පිරී ගියාවූවෝ ද, 'ඇත්තෙන්ම දිව්‍ය කායයන් පිරිලා, අසුර කායයන් පිරිහෙමින් පවතී' යැයි මහත් ප්‍රීතියෙන් ප්‍රකාශ කළහ. ස්වාමීනි, තව්තිසා දෙවියෝ යම් කාරණයක් සඳහා සුධර්මා සභාවේ රැස්වී සිටියාහු ද, එම කාරණය සිතා මෙනෙහි කර සාකච්ඡා කිරීමෙන් පසු සතර මහා රාජවරු ද එම කාරණය සම්බන්ධයෙන් තම අදහස් පළ කළහ. නැවත නැවතත් අනුශාසනා ලැබූ සතර මහා රාජවරු ද එම කාරණය සම්බන්ධයෙන් තම අදහස් පළ කළහ. ඔවුහු තම තමන්ගේ අසුන්වලින් නොසැලී සිටියහ. තම අදහස් පළ කළ ඒ රජවරු, අනුශාසනා පිළිගෙන, ප්‍රසන්න සිත් ඇතිව, තම අසුන්වල නොසැලී සිටියහ.\"",
      "paliTitle": "Devasabhā",
      "englishTitle": "The Assembly of Gods",
      "sinhalaTitle": "දේව සභාව"
    },
    {
      "number": 283,
      "pali": "‘Atha kho, bhante, uttarāya disāya uḷāro āloko sañjāyi, obhāso pāturahosi atikkammeva devānaṃ devānubhāvaṃ. Atha kho, bhante, sakko devānamindo deve tāvatiṃse āmantesi – ‘‘yathā kho, mārisā, nimittāni dissanti, uḷāro āloko sañjāyati, obhāso pātubhavati, brahmā pātubhavissati. Brahmuno hetaṃ pubbanimittaṃ pātubhāvāya yadidaṃ āloko sañjāyati obhāso pātubhavatīti. ‘‘Yathā nimittā dissanti, brahmā pātubhavissati; Brahmuno hetaṃ nimittaṃ, obhāso vipulo mahā’’ti.",
      "english": "Then, venerable sir, a great light arose in the northern direction, an illumination appeared surpassing even the divine power of the gods. Then, venerable sir, Sakka, lord of the gods, addressed the gods of Tāvatiṃsa: \"Good sirs, as these signs appear—a great light arising, an illumination manifesting—Brahmā will appear. This is the preliminary sign of Brahmā's appearance: a light arises, an illumination manifests.\" \"As these signs appear, Brahmā will appear; this is the sign of Brahmā, a vast and extensive illumination.\"",
      "sinhala": "ස්වාමීනි, අනතුරුව උතුරු දිශාවෙන් මහත් ආලෝකයක් හටගත්තේය. එය දෙවියන්ගේ ආනුභාවය පවා ඉක්මවා බබළන ආලෝකයක් විය. එවිට දේවේන්ද්‍ර ශක්‍රයා තව්තිසා දෙවියන්ට මෙසේ කීවේය: “පින්වත්නි, යම් ආකාරයකින් නිමිති පෙනේද, මහත් ආලෝකයක් හටගනීද, බබළන ආලෝකයක් පහළ වේද, බ්‍රහ්මයා පහළ වනු ඇත. ආලෝකය හටගැනීමත්, බබළන ආලෝකය පහළ වීමත් බ්‍රහ්මයාගේ පහළ වීමට පෙර නිමිත්තකි.” “යම් සේ නිමිති පෙනේද, බ්‍රහ්මයා පහළ වන්නේය; මෙය බ්‍රහ්මයාගේ නිමිත්තකි, එය මහත් වූ බබළන ආලෝකයකි.”",
      "paliTitle": ""
    },
    {
      "number": 284,
      "pali": "‘Atha kho, bhante, devā tāvatiṃsā yathāsakesu āsanesu nisīdiṃsu – ‘‘obhāsametaṃ ñassāma, yaṃvipāko bhavissati, sacchikatvāva naṃ gamissāmā’’ti. Cattāropi mahārājāno yathāsakesu āsanesu nisīdiṃsu – ‘‘obhāsametaṃ ñassāma yaṃvipāko bhavissati, sacchikatvāva naṃ gamissāmā’’ti. Idaṃ sutvā devā tāvatiṃsā ekaggā samāpajjiṃsu – ‘‘obhāsametaṃ ñassāma, yaṃvipāko bhavissati, sacchikatvāva naṃ gamissāmā’’ti. ‘Yadā, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, oḷārikaṃ attabhāvaṃ abhinimminitvā pātubhavati. Yo kho pana, bhante, brahmuno pakativaṇṇo anabhisambhavanīyo so devānaṃ tāvatiṃsānaṃ cakkhupathasmiṃ. Yadā, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, so aññe deve atirocati vaṇṇena ceva yasasā ca. Seyyathāpi, bhante, sovaṇṇo viggaho mānusaṃ viggahaṃ atirocati; evameva kho, bhante, yadā brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, so aññe deve atirocati vaṇṇena ceva yasasā ca. Yadā, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ pātubhavati, na tassaṃ parisāyaṃ koci devo abhivādeti vā paccuṭṭheti vā āsanena vā nimanteti. Sabbeva tuṇhībhūtā pañjalikā pallaṅkena nisīdanti – ‘‘yassadāni devassa pallaṅkaṃ icchissati brahmā sanaṅkumāro, tassa devassa pallaṅke nisīdissatī’’ti. ‘Yassa kho pana, bhante, devassa brahmā sanaṅkumāro pallaṅke nisīdati, uḷāraṃ so labhati devo vedapaṭilābhaṃ; uḷāraṃ so labhati devo somanassapaṭilābhaṃ. Seyyathāpi, bhante, rājā khattiyo muddhāvasitto adhunābhisitto rajjena, uḷāraṃ so labhati vedapaṭilābhaṃ, uḷāraṃ so labhati somanassapaṭilābhaṃ. Evameva kho, bhante, yassa devassa brahmā sanaṅkumāro pallaṅke nisīdati, uḷāraṃ so labhati devo vedapaṭilābhaṃ, uḷāraṃ so labhati devo somanassapaṭilābhaṃ. Atha, bhante, brahmā sanaṅkumāro oḷārikaṃ attabhāvaṃ abhinimminitvā kumāravaṇṇī [kumāravaṇṇo (syā. ka.)] hutvā pañcasikho devānaṃ tāvatiṃsānaṃ pāturahosi. So vehāsaṃ abbhuggantvā ākāse antalikkhe pallaṅkena nisīdi. Seyyathāpi, bhante, balavā puriso supaccatthate vā pallaṅke same vā bhūmibhāge pallaṅkena nisīdeyya; evameva kho, bhante, brahmā sanaṅkumāro vehāsaṃ abbhuggantvā ākāse antalikkhe pallaṅkena nisīditvā devānaṃ tāvatiṃsānaṃ sampasādaṃ viditvā imāhi gāthāhi anumodi – ‘‘Modanti vata bho devā, tāvatiṃsā sahindakā; Tathāgataṃ namassantā, dhammassa ca sudhammataṃ. ‘‘Nave deve ca passantā, vaṇṇavante yasassine; Sugatasmiṃ brahmacariyaṃ, caritvāna idhāgate. ‘‘Te aññe atirocanti, vaṇṇena yasasāyunā; Sāvakā bhūripaññassa, visesūpagatā idha. ‘‘Idaṃ disvāna nandanti, tāvatiṃsā sahindakā; Tathāgataṃ namassantā, dhammassa ca sudhammata’’nti.",
      "english": "Venerable sir, the gods of Tāvatiṃsa then sat down on their respective seats, thinking, \"We will understand this radiance, what its result will be, and only after realizing it will we depart.\" The four Great Kings also sat down on their respective seats, thinking, \"We will understand this radiance, what its result will be, and only after realizing it will we depart.\" Having heard this, the gods of Tāvatiṃsa became focused, thinking, \"We will understand this radiance, what its result will be, and only after realizing it will we depart.\"\n\nVenerable sir, when Brahmā Sanankumāra appears to the gods of Tāvatiṃsa, he manifests a coarse form before appearing. For the natural appearance of Brahmā is imperceptible to the gods of Tāvatiṃsa. Venerable sir, when Brahmā Sanankumāra appears to the gods of Tāvatiṃsa, he surpasses the other gods in beauty and glory. Just as a golden statue surpasses a human figure, so too, venerable sir, when Brahmā Sanankumāra appears to the gods of Tāvatiṃsa, he surpasses the other gods in beauty and glory. Venerable sir, when Brahmā Sanankumāra appears to the gods of Tāvatiṃsa, no god in that assembly greets him, rises to meet him, or invites him to a seat. All remain silent, with hands clasped in reverence, seated cross-legged, thinking, \"Brahmā Sanankumāra will sit on whichever god's seat he chooses.\"\n\nVenerable sir, the god upon whose seat Brahmā Sanankumāra sits, that god obtains great joy and great happiness. Just as a Khattiya king, consecrated with water and newly anointed to the kingship, obtains great joy and great happiness, so too, venerable sir, the god upon whose seat Brahmā Sanankumāra sits, that god obtains great joy and great happiness.\n\nThen, venerable sir, Brahmā Sanankumāra, having manifested a coarse form, appeared to the gods of Tāvatiṃsa as a youth with five topknots. He rose up into the sky and sat cross-legged in the air. Just as a strong man might sit cross-legged on a well-cushioned seat or on level ground, so too, venerable sir, Brahmā Sanankumāra, having risen up into the sky and sat cross-legged in the air, knowing the satisfaction of the gods of Tāvatiṃsa, expressed his approval with these verses:\n\n\"Indeed, the gods of Tāvatiṃsa rejoice, along with Indra, paying homage to the Tathāgata and to the Dhamma's true nature.\n\nSeeing new gods, beautiful and glorious, who, having lived the holy life in the Sugata's dispensation, have come here.\n\nThey surpass the others in beauty, glory, and lifespan, disciples of the one with vast wisdom, they have attained distinction here.\n\nHaving seen this, the Tāvatiṃsa gods rejoice, along with Indra, paying homage to the Tathāgata and to the Dhamma's true nature.\"",
      "sinhala": "‘එවිට, භාග්‍යවතුන් වහන්ස, තාවතිංස දෙවියෝ, \"මේ ආලෝකය කුමක්දැයි දැනගනිමු. එයින් ලැබෙන විපාකය කුමක් වන්නේදැයි අවබෝධ කරගෙනම යමු\" යි සිතා තම තමන්ගේ අසුන්වල හිඳගත්හ. සිව්මහා රජවරුද, \"මේ ආලෝකය කුමක්දැයි දැනගනිමු. එයින් ලැබෙන විපාකය කුමක් වන්නේදැයි අවබෝධ කරගෙනම යමු\" යි සිතා තම තමන්ගේ අසුන්වල හිඳගත්හ. මෙය ඇසූ තාවතිංස දෙවියෝ, \"මේ ආලෝකය කුමක්දැයි දැනගනිමු. එයින් ලැබෙන විපාකය කුමක් වන්නේදැයි අවබෝධ කරගෙනම යමු\" යි සිතා ඒකාග්‍රව සමාධියට පැමිණියහ.\n\n‘භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට යම් කලෙක පහළ වන්නේද, ඕලාරික ස්වරූපයක් මවාගෙන පහළ වන්නේය. භාග්‍යවතුන් වහන්ස, බ්‍රහ්මයාගේ යම් සැබෑ ස්වරූපයක් ඇද්ද, එය තාවතිංස දෙවියන්ට දැකීමට නොහැකිය. භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට යම් කලෙක පහළ වන්නේද, ඔහු වර්ණයෙන්ද, යසසින්ද අනෙක් දෙවියන් ඉක්මවා බබළයි. භාග්‍යවතුන් වහන්ස, යම්සේ රන් පිළිමයක් මනුෂ්‍ය රූපයක් ඉක්මවා බබළන්නේද, භාග්‍යවතුන් වහන්ස, එපරිද්දෙන්ම සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට යම් කලෙක පහළ වන්නේද, ඔහු වර්ණයෙන්ද, යසසින්ද අනෙක් දෙවියන් ඉක්මවා බබළයි.\n\nභාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට යම් කලෙක පහළ වන්නේද, ඒ පිරිසෙහි කිසිම දෙවියෙක් ආචාර කරන්නේ හෝ පිළිගන්නේ හෝ අසුනෙන් ඉඳගන්නට ආරාධනා කරන්නේ හෝ නැත. සියල්ලෝම නිශ්ශබ්දව අත් බැඳගෙන පර්යංකයකින් හිඳගනිති. \"සනංකුමාර බ්‍රහ්මයා දැන් කුමන දෙවියෙකුගේ පර්යංකයෙහි හිඳගැනීමට කැමති වේද, ඒ දෙවියාගේ පර්යංකයෙහි හිඳගන්නේය\" යි සිතති.\n\n‘භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා යම් දෙවියෙකුගේ පර්යංකයෙහි හිඳගන්නේද, ඒ දෙවියා උතුම් දැනුමක් ලබයි. ඒ දෙවියා උතුම් සතුටක් ලබයි. භාග්‍යවතුන් වහන්ස, යම්සේ මෞලි මංගල්‍යයෙන් අභිෂේක ලැබූ ක්‍ෂත්‍රිය රජෙක් අභිෂේක ලැබූ වහාම උතුම් දැනුමක් ලබන්නේද, උතුම් සතුටක් ලබන්නේද, භාග්‍යවතුන් වහන්ස, එපරිද්දෙන්ම සනංකුමාර බ්‍රහ්මයා යම් දෙවියෙකුගේ පර්යංකයෙහි හිඳගන්නේද, ඒ දෙවියා උතුම් දැනුමක් ලබයි. ඒ දෙවියා උතුම් සතුටක් ලබයි.\n\nඉක්බිති, භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා ඕලාරික ස්වරූපයක් මවාගෙන කුමාර ස්වරූපයෙන්, පස්කෙස් කළඹක් ඇතිව තාවතිංස දෙවියන්ට පහළ විය. ඔහු අහසට නැඟී අහස් ගැබෙහි පර්යංකයකින් හිඳගත්තේය. භාග්‍යවතුන් වහන්ස, යම්සේ බලවත් පුරුෂයෙක් හොඳින් සකස් කළ පර්යංකයක හෝ සම භූමිභාගයක හෝ පර්යංකයකින් හිඳගන්නේද, භාග්‍යවතුන් වහන්ස, එපරිද්දෙන්ම සනංකුමාර බ්‍රහ්මයා අහසට නැඟී අහස් ගැබෙහි පර්යංකයකින් හිඳගෙන තාවතිංස දෙවියන්ගේ සතුට දැක, මේ ගාථාවන්ගෙන් අනුමෝදනා කළේය.\n\n\"සහින්දක වූ තාවතිංස දෙවියෝ සතුටු වෙති! තථාගතයන් වහන්සේට නමස්කාර කරමින්, ධර්මයේ මනා ස්වභාවයටද නමස්කාර කරමින්,\nනව දෙවියන් ද දකිමින්, වර්ණවත් වූ යසස් ඇති සුගතයන් වහන්සේ කෙරෙහි බ්‍රහ්මචර්යාවෙහි හැසිර මෙහි පැමිණියෝය.\nඔවුහු අනෙක් දෙවියන් ඉක්මවා බබළති. වර්ණයෙන්, යසසින් හා ආයුෂින්ද භූරි ප්‍රඥා ඇති බුදුරජාණන් වහන්සේගේ ශ්‍රාවකයෝ විශේෂයෙන් මෙහි පැමිණියහ.\nමෙය දැක සහින්දක වූ තාවතිංස දෙවියෝ සතුටු වෙති. තථාගතයන් වහන්සේට නමස්කාර කරමින් ධර්මයේ මනා ස්වභාවයටද නමස්කාර කරමින්.\"",
      "paliTitle": "Sanaṅkumārakathā",
      "englishTitle": "The Story of Sanankumara",
      "sinhalaTitle": "සනංකුමාර කථාව"
    },
    {
      "number": 285,
      "pali": "‘Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsittha; imamatthaṃ, bhante, brahmuno sanaṅkumārassa bhāsato aṭṭhaṅgasamannāgato saro hoti vissaṭṭho ca viññeyyo ca mañju ca savanīyo ca bindu ca avisārī ca gambhīro ca ninnādī ca. Yathāparisaṃ kho pana, bhante, brahmā sanaṅkumāro sarena viññāpeti; na cassa bahiddhā parisāya ghoso niccharati. Yassa kho pana, bhante, evaṃ aṭṭhaṅgasamannāgato saro hoti, so vuccati ‘‘brahmassaro’’ti. ‘Atha kho, bhante, brahmā sanaṅkumāro tettiṃse attabhāve abhinimminitvā devānaṃ tāvatiṃsānaṃ paccekapallaṅkesu pallaṅkena [paccekapallaṅkena (ka.)] nisīditvā deve tāvatiṃse āmantesi – ‘‘taṃ kiṃ maññanti, bhonto devā tāvatiṃsā, yāvañca so bhagavā bahujanahitāya paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Ye hi keci, bho, buddhaṃ saraṇaṃ gatā dhammaṃ saraṇaṃ gatā saṅghaṃ saraṇaṃ gatā sīlesu paripūrakārino te kāyassa bhedā paraṃ maraṇā appekacce paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjanti, appekacce nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjanti, appekacce tusitānaṃ devānaṃ sahabyataṃ upapajjanti, appekacce yāmānaṃ devānaṃ sahabyataṃ upapajjanti, appekacce tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjanti, appekacce cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjanti. Ye sabbanihīnaṃ kāyaṃ paripūrenti, te gandhabbakāyaṃ paripūrentī’’’ti.",
      "english": "\"Venerable sir, Brahmā Sanankumāra spoke on this matter. When Brahmā Sanankumāra speaks, his voice possesses eight qualities: it is distinct, intelligible, pleasing, audible, clear, non-diffuse, deep, and resonant. Brahmā Sanankumāra makes himself known by his voice only to those assembled; its sound does not extend beyond the assembly. A voice possessing these eight qualities is called 'the voice of Brahmā.'\n\n\"Then, venerable sir, Brahmā Sanankumāra manifested thirty-three apparitions of himself. He sat cross-legged on individual couches, one for each of the gods of the Thirty-three, and addressed them: 'What do you think, good sirs, gods of the Thirty-three? The Blessed One has set forth for the benefit of the many, for the happiness of the many, out of compassion for the world, for the good, benefit, and happiness of gods and humans. Indeed, those beings who have gone for refuge to the Buddha, gone for refuge to the Dhamma, gone for refuge to the Sangha, and are perfect in fulfilling the precepts, at the breaking up of the body, after death, some are reborn into companionship with the gods of Paranimmitavasavattī, some with the gods of Nimmānarati, some with the gods of Tusita, some with the gods of Yāma, some with the gods of Tāvatiṃsa, and some with the gods of Cātumahārājika. Those who perfect the lowest kind of body perfect the body of the Gandharvas.'\"",
      "sinhala": "\"ස්වාමීනි\" (bhante) was omitted in the second paragraph's opening.\nThe last sentence, \"යම් කෙනෙක් සියලු නීච ක්‍රියාවන්ගෙන් වැළකී සිටිමින් කය පුරවද්ද, ඔහු ගන්ධබ්බ කාය පුරවන්නේය”යි කීවේය\", misinterprets \"sabbanihīnaṃ kāyaṃ paripūrenti\". \"sabbanihīnaṃ\" refers to the *lowest/most inferior* type of body/existence among the divine realms, not abstaining from \"low actions.\" The corrected version reflects this meaning of attaining the lowest divine existence, which is the Gandhabba realm.\n\n“ස්වාමීනි, සනංකුමාර බ්‍රහ්මයා මේ අර්ථය ප්‍රකාශ කළේය. ස්වාමීනි, සනංකුමාර බ්‍රහ්මයා විසින් මෙම අර්ථය ප්‍රකාශ කරන විට, අංග අටකින් සමන්විත හඬක් විහිදේ. එය පැහැදිලි සහ තේරුම්ගත හැකි අතර, මිහිරි මෙන්ම ඇසීමට ප්‍රියජනක වෙයි. තවද එය ලක්ෂණවලින් පිරිපුන්, විසිරී නොයන, ගැඹුරු සහ නාද වන සුළුය. ස්වාමීනි, සනංකුමාර බ්‍රහ්මයා හඬ මගින් රැස්ව සිටින පිරිසට කරුණු දන්වයි. එහෙත් ඔහුගේ හඬ පිරිසෙන් පිටතට නික්මෙන්නේ නැත. ස්වාමීනි, යම් කෙනෙකුට මෙලෙස අංග අටකින් යුත් හඬක් ඇත්නම්, ඔහු \"බ්‍රහ්ම ස්වරය\" යනුවෙන් කියනු ලැබේ.\n\n“ඉක්බිති ස්වාමීනි, සනංකුමාර බ්‍රහ්මයා තව්තිසා දෙවියන් අතරෙහි තම රූප තිස්තුනක් මවා, එකිනෙකා වෙනුවෙන් වෙන්වූ අසුන්වල (පළඟවල) වාඩි වී, තව්තිසා දෙවියන්ට මෙසේ කීවේය: “භවත් තව්තිසා දෙවියනි, භාග්‍යවතුන් වහන්සේ බොහෝ දෙනාගේ හිත සුව පිණිස, බොහෝ දෙනාගේ සතුට පිණිස, ලෝකයා කෙරෙහි අනුකම්පාවෙන්, දෙව් මිනිසුන්ගේ යහපත පිණිස, හිතසුව පිණිස පිළිපැදීම ගැන ඔබ කුමක් සිතන්නේද? යම් කෙනෙක් බුදුන් සරණ ගියාහුද, දහම් සරණ ගියාහුද, සඟ සරණ ගියාහුද, සිල්වලින් පරිපූර්ණ වූවාහුද, ඔවුන් කය බිඳී මරණින් මතු ඇතැම් පිරිසක් පරනිර්මිත වසවර්ති දෙවියන්ගේ සහභාගීත්වයට පැමිණෙති. තවත් පිරිසක් නිර්මාණරතී දෙවියන්ගේ සහභාගීත්වයට පැමිණෙති. තවත් පිරිසක් තුසිත දෙවියන්ගේ සහභාගීත්වයට පැමිණෙති. තවත් පිරිසක් යාම දෙවියන්ගේ සහභාගීත්වයට පැමිණෙති. තවත් පිරිසක් තව්තිසා දෙවියන්ගේ සහභාගීත්වයට පැමිණෙති. තවත් පිරිසක් චාතුම්මහාරාජික දෙවියන්ගේ සහභාගීත්වයට පැමිණෙති. යම් කෙනෙක් (මෙම දෙව්ලෝ අතුරින්) පහත්ම ආත්මභාවය ලබත් ද, ඔවුහු ගන්ධබ්බ ආත්මභාවය ලබති”යි කීවේය.\"",
      "paliTitle": ""
    },
    {
      "number": 286,
      "pali": "‘Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsittha; imamatthaṃ, bhante, brahmuno sanaṅkumārassa bhāsato ghosoyeva devā maññanti – ‘‘yvāyaṃ mama pallaṅke svāyaṃ ekova bhāsatī’’ti. Ekasmiṃ bhāsamānasmiṃ, sabbe bhāsanti nimmitā; Ekasmiṃ tuṇhimāsīne, sabbe tuṇhī bhavanti te. Tadāsu devā maññanti, tāvatiṃsā sahindakā; Yvāyaṃ mama pallaṅkasmiṃ, svāyaṃ ekova bhāsatīti. ‘Atha kho, bhante, brahmā sanaṅkumāro ekattena attānaṃ upasaṃharati, ekattena attānaṃ upasaṃharitvā sakkassa devānamindassa pallaṅke pallaṅkena nisīditvā deve tāvatiṃse āmantesi",
      "english": "\"Venerable sir, Brahma Sanankumara spoke on this matter. And while Brahma Sanankumara was speaking, the gods perceived it as a single voice, thinking, 'He who is upon my throne, he alone is speaking.' When he speaks, all the emanated forms speak; when he is silent, all of them become silent. Then the gods, the Thirty-three together with Indra, think, 'He who is upon my throne, he alone is speaking.'\"\n\n\"Then, venerable sir, Brahma Sanankumara consolidated himself into a single form. Having done so, he sat cross-legged upon the throne of Sakka, lord of the gods, and addressed the gods of the Thirty-three.\"",
      "sinhala": "‘ස්වාමීනි, මේ කරුණ සනංකුමාර නම් බ්‍රහ්මයා විසින් දේශනා කරන ලදී. ස්වාමීනි, සනංකුමාර බ්‍රහ්මයා දේශනා කරද්දී දෙවියෝ ඔහුගේ හඬ පමණක් අසා මෙසේ සිතති: \"මාගේ ආසනයෙහි හිඳගෙන සිටින්නේ යමෙක් ද, ඔහු පමණක් කථා කරයි.\"\n\nඔහු කථා කරන විට, මවන ලද සියල්ලෝ ම කථා කරති. ඔහු නිශ්ශබ්දව සිටින විට, ඔවුන් සියල්ලෝ ම නිශ්ශබ්ද වෙති. එකල සක් දෙවිඳුන් සහිත තව්තිසා දෙවියෝ මෙසේ සිතති: \"මාගේ ආසනයෙහි හිඳගෙන සිටින්නේ යමෙක් ද, ඔහු පමණක් කථා කරයි.\"\n\nස්වාමීනි, අනතුරුව සනංකුමාර බ්‍රහ්මයා ඒකාත්ම ස්වභාවයෙන් යුතුව පැමිණ, සක් දෙවිඳුන්ගේ ආසනයෙහි පර්යංකයෙන් හිඳ තව්තිසා දෙවියන්ට ආමන්ත්‍රණය කළේ ය.",
      "paliTitle": ""
    },
    {
      "number": 287,
      "pali": "‘‘‘Taṃ kiṃ maññanti, bhonto devā tāvatiṃsā, yāva supaññattā cime tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro iddhipādā paññattā iddhipahutāya [iddhibahulīkatāya (syā.)] iddhivisavitāya [iddhivisevitāya (syā.)] iddhivikubbanatāya. Katame cattāro? Idha bho bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Vīriyasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Cittasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bho, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro iddhipādā paññattā iddhipahutāya iddhivisavitāya iddhivikubbanatāya. ‘‘‘Ye hi keci bho atītamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhosuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Yepi hi keci bho anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhossanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Yepi hi keci bho etarahi samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhonti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Passanti no bhonto devā tāvatiṃsā mamapimaṃ evarūpaṃ iddhānubhāva’’nti? ‘‘Evaṃ mahābrahme’’ti. ‘‘Ahampi kho bho imesaṃyeva catunnañca iddhipādānaṃ bhāvitattā bahulīkatattā evaṃ mahiddhiko evaṃmahānubhāvo’’ti. Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsittha. Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsitvā deve tāvatiṃse āmantesi",
      "english": "\"What do you think, good sirs, gods of Tāvatiṃsa? These four bases of power have been declared by that Blessed One—the knowing, the seeing, the worthy, the rightly self-awakened one—for the attainment of great power, for the mastery of power, for the display of power. Which four? Here, a bhikkhu develops the basis of power that possesses concentration founded on zeal and sustained by striving. He develops the basis of power that possesses concentration founded on energy and sustained by striving. He develops the basis of power that possesses concentration founded on mind and sustained by striving. He develops the basis of power that possesses concentration founded on investigation and sustained by striving. These, good sirs, are the four bases of power declared by that Blessed One—the knowing, the seeing, the worthy, the rightly self-awakened one—for the attainment of great power, for the mastery of power, for the display of power.\n\n\"Indeed, whatever ascetics or brahmins in the past experienced diverse displays of psychic power, all did so because these four bases of power were developed and cultivated. And whatever ascetics or brahmins in the future will experience diverse displays of psychic power, all will do so because these four bases of power will be developed and cultivated. And whatever ascetics or brahmins now experience diverse displays of psychic power, all do so because these four bases of power are developed and cultivated. Do you, worthy gods of Tāvatiṃsa, see this kind of power of mine?\" \"Yes, Great Brahmā.\" \"I, too, good sirs, am so powerful and mighty because these four bases of power are developed and cultivated.\"\n\nThis meaning, venerable sir, was spoken by Brahmā Sanankumāra. Having spoken this meaning, venerable sir, Brahmā Sanankumāra addressed the gods of Tāvatiṃsa.",
      "sinhala": "‘‘භවත් තාවතිංස දෙවියෝ ඒ පිළිබඳව කුමක් සිතන සේක් ද? ඒ භාග්‍යවත් වූ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් සෘද්ධිමත් බව පිණිස, සෘද්ධිය ප්‍රගුණ කිරීම පිණිස, සෘද්ධි විකුබ්බනය කිරීම පිණිස පණවන ලද මේ සතර සෘද්ධිපාද කෙතරම් මනාව ප්‍රඥප්ත වී ඇත්තේ ද? ඒ සතර කුමක් ද?\n\nභවත්නි, මෙහි දී භික්ෂුව ඡන්දය ප්‍රධාන කොට ඇති සමාධියෙන් හා සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. වීර්යය ප්‍රධාන කොට ඇති සමාධියෙන් හා සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. සිත ප්‍රධාන කොට ඇති සමාධියෙන් හා සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. විමංසාව ප්‍රධාන කොට ඇති සමාධියෙන් හා සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. භවත්නි, ඒ භාග්‍යවත් වූ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් සෘද්ධිමත් බව පිණිස, සෘද්ධිය ප්‍රගුණ කිරීම පිණිස, සෘද්ධි විකුබ්බනය කිරීම පිණිස මේ සතර සෘද්ධිපාද පණවන ලද්දේ ය.\n\nභවත්නි, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ අතීත කාලයෙහි නානාප්‍රකාර සෘද්ධි විධි අනුභව කළේ නම්, ඒ සියල්ලෝ ම මේ සතර සෘද්ධිපාදයන් වැඩූ බැවින්, බහුල කළ බැවිනි. භවත්නි, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ අනාගත කාලයෙහි නානාප්‍රකාර සෘද්ධි විධි අනුභව කරන්නේ නම්, ඒ සියල්ලෝ ම මේ සතර සෘද්ධිපාදයන් වැඩූ බැවින්, බහුල කළ බැවිනි. භවත්නි, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දැන් නානාප්‍රකාර සෘද්ධි විධි අනුභව කරන්නේ නම්, ඒ සියල්ලෝ ම මේ සතර සෘද්ධිපාදයන් වැඩූ බැවින්, බහුල කළ බැවිනි. තාවතිංස දෙවියනි, මාගේ මෙබඳු සෘද්ධි ආනුභාවයක් ඔබ දකිනවා ද?\" \"මහබ්‍රහ්මයාණෙනි, එසේ ය\"යි (දෙවියෝ කීහ). \"භවත්නි, මමත් මේ සතර සෘද්ධිපාදයන් වැඩූ බැවින්, බහුල කළ බැවින් මෙසේ මහත් සෘද්ධි ඇත්තෙක්, මෙසේ මහත් ආනුභාව ඇත්තෙක් වෙමි\"යි වදාළ සේක. භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා විසින් මේ අර්ථය ප්‍රකාශ කරන ලදී. භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා විසින් මේ අර්ථය ප්‍රකාශ කොට තාවතිංස දෙවියන්ට ආමන්ත්‍රණය කරන ලදී.",
      "paliTitle": "Bhāvitaiddhipādo",
      "englishTitle": "The Developed Bases of Psychic Power",
      "sinhalaTitle": "භාවිතඉද්ධිපාදො"
    },
    {
      "number": 288,
      "pali": "‘‘‘Taṃ kiṃ maññanti, bhonto devā tāvatiṃsā, yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena tayo okāsādhigamā anubuddhā sukhassādhigamāya. Katame tayo? Idha bho ekacco saṃsaṭṭho viharati kāmehi saṃsaṭṭho akusalehi dhammehi. So aparena samayena ariyadhammaṃ suṇāti, yoniso manasi karoti, dhammānudhammaṃ paṭipajjati. So ariyadhammassavanaṃ āgamma yonisomanasikāraṃ dhammānudhammappaṭipattiṃ asaṃsaṭṭho viharati kāmehi asaṃsaṭṭho akusalehi dhammehi. Tassa asaṃsaṭṭhassa kāmehi asaṃsaṭṭhassa akusalehi dhammehi uppajjati sukhaṃ, sukhā bhiyyo somanassaṃ. Seyyathāpi, bho, pamudā pāmojjaṃ [pāmujjaṃ (pī. ka.)] jāyetha, evameva kho, bho, asaṃsaṭṭhassa kāmehi asaṃsaṭṭhassa akusalehi dhammehi uppajjati sukhaṃ, sukhā bhiyyo somanassaṃ. Ayaṃ kho, bho, tena bhagavatā jānatā passatā arahatā sammāsambuddhena paṭhamo okāsādhigamo anubuddho sukhassādhigamāya. ‘‘‘Puna caparaṃ, bho, idhekaccassa oḷārikā kāyasaṅkhārā appaṭippassaddhā honti, oḷārikā vacīsaṅkhārā appaṭippassaddhā honti, oḷārikā cittasaṅkhārā appaṭippassaddhā honti. So aparena samayena ariyadhammaṃ suṇāti, yoniso manasi karoti, dhammānudhammaṃ paṭipajjati. Tassa ariyadhammassavanaṃ āgamma yonisomanasikāraṃ dhammānudhammappaṭipattiṃ oḷārikā kāyasaṅkhārā paṭippassambhanti, oḷārikā vacīsaṅkhārā paṭippassambhanti, oḷārikā cittasaṅkhārā paṭippassambhanti. Tassa oḷārikānaṃ kāyasaṅkhārānaṃ paṭippassaddhiyā oḷārikānaṃ vacīsaṅkhārānaṃ paṭippassaddhiyā oḷārikānaṃ cittasaṅkhārānaṃ paṭippassaddhiyā uppajjati sukhaṃ, sukhā bhiyyo somanassaṃ. Seyyathāpi, bho, pamudā pāmojjaṃ jāyetha, evameva kho bho oḷārikānaṃ kāyasaṅkhārānaṃ paṭippassaddhiyā oḷārikānaṃ vacīsaṅkhārānaṃ paṭippassaddhiyā oḷārikānaṃ cittasaṅkhārānaṃ paṭippassaddhiyā uppajjati sukhaṃ, sukhā bhiyyo somanassaṃ. Ayaṃ kho, bho, tena bhagavatā jānatā passatā arahatā sammāsambuddhena dutiyo okāsādhigamo anubuddho sukhassādhigamāya. ‘‘‘Puna caparaṃ, bho, idhekacco ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. ‘Idaṃ sāvajjaṃ idaṃ anavajjaṃ, idaṃ sevitabbaṃ idaṃ na sevitabbaṃ, idaṃ hīnaṃ idaṃ paṇītaṃ, idaṃ kaṇhasukkasappaṭibhāga’nti yathābhūtaṃ nappajānāti. So aparena samayena ariyadhammaṃ suṇāti, yoniso manasi karoti, dhammānudhammaṃ paṭipajjati. So ariyadhammassavanaṃ āgamma yonisomanasikāraṃ dhammānudhammappaṭipattiṃ, ‘idaṃ kusala’nti yathābhūtaṃ pajānāti, ‘idaṃ akusala’nti yathābhūtaṃ pajānāti. Idaṃ sāvajjaṃ idaṃ anavajjaṃ, idaṃ sevitabbaṃ idaṃ na sevitabbaṃ, idaṃ hīnaṃ idaṃ paṇītaṃ, idaṃ kaṇhasukkasappaṭibhāga’nti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato avijjā pahīyati, vijjā uppajjati. Tassa avijjāvirāgā vijjuppādā uppajjati sukhaṃ, sukhā bhiyyo somanassaṃ. Seyyathāpi, bho, pamudā pāmojjaṃ jāyetha, evameva kho, bho, avijjāvirāgā vijjuppādā uppajjati sukhaṃ, sukhā bhiyyo somanassaṃ. Ayaṃ kho, bho, tena bhagavatā jānatā passatā arahatā sammāsambuddhena tatiyo okāsādhigamo anubuddho sukhassādhigamāya. Ime kho, bho, tena bhagavatā jānatā passatā arahatā sammāsambuddhena tayo okāsādhigamā anubuddhā sukhassādhigamāyā’’ti. Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsittha, imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsitvā deve tāvatiṃse āmantesi",
      "english": "\"Good sirs, what do the gods of the Thirty-three think? The Blessed One—the knowing, seeing, worthy, fully awakened one—has realized three opportunities for attaining happiness. What are these three? In one case, a person dwells entangled with sensual pleasures and unwholesome states. Later, they hear the noble Dhamma, attend to it closely, and practice the Dhamma in accordance with the Dhamma. Having heard the noble Dhamma, attending to it closely, and practicing the Dhamma in accordance with the Dhamma, they dwell unentangled with sensual pleasures and unwholesome states. For them, unentangled with sensual pleasures and unwholesome states, happiness arises, and even more so, gladness. Just as delight and joy might arise, so too, for one unentangled with sensual pleasures and unwholesome states, happiness arises, and even more so, gladness. This, good sirs, is the first opportunity for attaining happiness realized by the Blessed One—the knowing, seeing, worthy, fully awakened one.\n\n\"Furthermore, good sirs, in another case, a person's gross bodily, verbal, and mental fabrications are uncalmed. Later, they hear the noble Dhamma, attend to it closely, and practice the Dhamma in accordance with the Dhamma. Having heard the noble Dhamma, attending to it closely, and practicing the Dhamma in accordance with the Dhamma, their gross bodily, verbal, and mental fabrications become calmed. For them, with the calming of gross bodily, verbal, and mental fabrications, happiness arises, and even more so, gladness. Just as delight and joy might arise, so too, with the calming of gross bodily, verbal, and mental fabrications, happiness arises, and even more so, gladness. This, good sirs, is the second opportunity for attaining happiness realized by the Blessed One—the knowing, seeing, worthy, fully awakened one.\n\n\"Furthermore, good sirs, in another case, a person does not truly understand what is skillful and unskillful. They do not truly understand what is blameworthy and blameless, what should and should not be cultivated, what is inferior and superior, what has a dark and bright counterpart. Later, they hear the noble Dhamma, attend to it closely, and practice the Dhamma in accordance with the Dhamma. Having heard the noble Dhamma, attending to it closely, and practicing the Dhamma in accordance with the Dhamma, they truly understand what is skillful and unskillful. They truly understand what is blameworthy and blameless, what should and should not be cultivated, what is inferior and superior, what has a dark and bright counterpart. For them, knowing and seeing thus, ignorance is abandoned, and knowledge arises. With the fading away of ignorance and the arising of knowledge, happiness arises, and even more so, gladness. Just as delight and joy might arise, so too, with the fading away of ignorance and the arising of knowledge, happiness arises, and even more so, gladness. This, good sirs, is the third opportunity for attaining happiness realized by the Blessed One—the knowing, seeing, worthy, fully awakened one. These, good sirs, are the three opportunities for attaining happiness realized by the Blessed One—the knowing, seeing, worthy, fully awakened one.\"\n\nVenerable sir, Brahmā Sanankumāra spoke this meaning; venerable sir, having spoken this meaning, Brahmā Sanankumāra addressed the gods of the Thirty-three.",
      "sinhala": "‘‘භවත්නි, තාවතිංස දෙවියෝ, ඒ භාග්‍යවත් වූ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් සැපය අධිගමනය කිරීම සඳහා අවබෝධ කරන ලද අවකාශ අධිගම තුනක් ඇතැයි සිතන සේක්ද? කවර තුනක්ද? භවත්නි, මෙහි ඇතැම් පුද්ගලයෙක් කාමයන් හා සංසර්ගව, අකුසල ධර්මයන් හා සංසර්ගව වාසය කරයි. ඔහු පසු කලෙක ආර්ය ධර්මය අසයි, මනාව මෙනෙහි කරයි, ධර්මානුධර්ම ප්‍රතිපදාවේ හැසිරෙයි. ඔහු ආර්ය ධර්මය ඇසීමෙන්, මනාව මෙනෙහි කිරීමෙන් හා ධර්මානුධර්ම ප්‍රතිපදාවෙන් කාමයන්ගෙන් හා අකුසල ධර්මයන්ගෙන් අසංසර්ගව වාසය කරයි. කාමයන්ගෙන් හා අකුසල ධර්මයන්ගෙන් අසංසර්ග වූ ඔහුට සැපය උපදී. එම සැපයට වඩා සෝමනස්සය උපදී. භවත්නි, යම්සේ ප්‍රමුදිත බවක්, ප්‍රාමෝද්‍යයක් උපදීද, භවත්නි, එපරිද්දෙන්ම කාමයන්ගෙන් හා අකුසල ධර්මයන්ගෙන් අසංසර්ග වූ ඔහුට සැපය උපදී. එම සැපයට වඩා සෝමනස්සය උපදී. භවත්නි, සැපය අධිගමනය කිරීම සඳහා ඒ භාග්‍යවත් වූ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් අවබෝධ කරන ලද පළමුවන අවකාශ අධිගමය මෙයයි.\n‘‘භවත්නි, තවද මෙහි ඇතැමෙකුගේ ඕලාරික කාය සංස්කාර සංසිඳී නැත. ඕලාරික වාචී සංස්කාර සංසිඳී නැත. ඕලාරික චිත්ත සංස්කාර සංසිඳී නැත. ඔහු පසු කලෙක ආර්ය ධර්මය අසයි, මනාව මෙනෙහි කරයි, ධර්මානුධර්ම ප්‍රතිපදාවේ හැසිරෙයි. ඔහු ආර්ය ධර්මය ඇසීමෙන්, මනාව මෙනෙහි කිරීමෙන් හා ධර්මානුධර්ම ප්‍රතිපදාවෙන් ඕලාරික කාය සංස්කාර සංසිඳෙයි. ඕලාරික වාචී සංස්කාර සංසිඳෙයි. ඕලාරික චිත්ත සංස්කාර සංසිඳෙයි. ඕලාරික කාය සංස්කාර සංසිඳීමෙන්, ඕලාරික වාචී සංස්කාර සංසිඳීමෙන් හා ඕලාරික චිත්ත සංස්කාර සංසිඳීමෙන් ඔහුට සැපය උපදී. එම සැපයට වඩා සෝමනස්සය උපදී. භවත්නි, යම්සේ ප්‍රමුදිත බවක්, ප්‍රාමෝද්‍යයක් උපදීද, භවත්නි, එපරිද්දෙන්ම ඕලාරික කාය සංස්කාර සංසිඳීමෙන්, ඕලාරික වාචී සංස්කාර සංසිඳීමෙන් හා ඕලාරික චිත්ත සංස්කාර සංසිඳීමෙන් ඔහුට සැපය උපදී. එම සැපයට වඩා සෝමනස්සය උපදී. භවත්නි, සැපය අධිගමනය කිරීම සඳහා ඒ භාග්‍යවත් වූ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් අවබෝධ කරන ලද දෙවන අවකාශ අධිගමය මෙයයි.\n‘‘භවත්නි, තවද මෙහි ඇතැමෙක් ‘මෙය කුසලය’යි යථා පරිදි නොදනී. ‘මෙය අකුසලය’යි යථා පරිදි නොදනී. ‘මෙය සාවද්‍යය, මෙය අනවද්‍යය, මෙය සේවනය කළ යුතුය, මෙය සේවනය නොකළ යුතුය, මෙය හීනය, මෙය ප්‍රණීතය, මෙය කළු සුදු මිශ්‍රය’යි යථා පරිදි නොදනී. ඔහු පසු කලෙක ආර්ය ධර්මය අසයි, මනාව මෙනෙහි කරයි, ධර්මානුධර්ම ප්‍රතිපදාවේ හැසිරෙයි. ඔහු ආර්ය ධර්මය ඇසීමෙන්, මනාව මෙනෙහි කිරීමෙන් හා ධර්මානුධර්ම ප්‍රතිපදාවෙන් ‘මෙය කුසලය’යි යථා පරිදි දනී. ‘මෙය අකුසලය’යි යථා පරිදි දනී. ‘මෙය සාවද්‍යය, මෙය අනවද්‍යය, මෙය සේවනය කළ යුතුය, මෙය සේවනය නොකළ යුතුය, මෙය හීනය, මෙය ප්‍රණීතය, මෙය කළු සුදු මිශ්‍රය’යි යථා පරිදි දනී. මෙසේ දන්නා වූ, මෙසේ දක්නා වූ ඔහුගේ අවිද්‍යාව පහවෙයි. විද්‍යාව උපදී. ඔහුගේ අවිද්‍යාව පහවීමෙන් විද්‍යාව ඉපදීම හේතුවෙන් සැපය උපදී. එම සැපයට වඩා සෝමනස්සය උපදී. භවත්නි, යම්සේ ප්‍රමුදිත බවක්, ප්‍රාමෝද්‍යයක් උපදීද, භවත්නි, එපරිද්දෙන්ම අවිද්‍යාව පහවීමෙන් විද්‍යාව ඉපදීම හේතුවෙන් සැපය උපදී. එම සැපයට වඩා සෝමනස්සය උපදී. භවත්නි, සැපය අධිගමනය කිරීම සඳහා ඒ භාග්‍යවත් වූ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් අවබෝධ කරන ලද තෙවන අවකාශ අධිගමය මෙයයි. භවත්නි, සැපය අධිගමනය කිරීම සඳහා ඒ භාග්‍යවත් වූ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් අවබෝධ කරන ලද අවකාශ අධිගම තුන මෙයයි.’’\nභාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා විසින් මේ අර්ථය වදාරන ලදී. භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා විසින් මේ අර්ථය වදාරා තාවතිංස දෙවියන්ට ආමන්ත්‍රණය කරන ලදී.",
      "paliTitle": "Tividho okāsādhigamo",
      "englishTitle": "Three kinds of opportunity for access.",
      "sinhalaTitle": "ත්‍රිවිධ අවකාශාධිගමය"
    },
    {
      "number": 289,
      "pali": "‘‘‘Taṃ kiṃ maññanti, bhonto devā tāvatiṃsā, yāva supaññattā cime tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro satipaṭṭhānā paññattā kusalassādhigamāya. Katame cattāro? Idha, bho, bhikkhu ajjhattaṃ kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ kāye kāyānupassī viharanto tattha sammā samādhiyati, sammā vippasīdati. So tattha sammā samāhito sammā vippasanno bahiddhā parakāye ñāṇadassanaṃ abhinibbatteti. Ajjhattaṃ vedanāsu vedanānupassī viharati…pe… bahiddhā paravedanāsu ñāṇadassanaṃ abhinibbatteti. Ajjhattaṃ citte cittānupassī viharati…pe… bahiddhā paracitte ñāṇadassanaṃ abhinibbatteti. Ajjhattaṃ dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Ajjhattaṃ dhammesu dhammānupassī viharanto tattha sammā samādhiyati, sammā vippasīdati. So tattha sammā samāhito sammā vippasanno bahiddhā paradhammesu ñāṇadassanaṃ abhinibbatteti. Ime kho, bho, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro satipaṭṭhānā paññattā kusalassādhigamāyā’’ti. Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsittha. Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsitvā deve tāvatiṃse āmantesi",
      "english": "\"What do you think, venerable gods of Tāvatiṃsa? The Blessed One—the Knower, the Seer, the Worthy One, the Perfectly Enlightened One—has taught these four foundations of mindfulness for the attainment of skillful qualities. Which four? Here, venerable sirs, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having removed longing and displeasure regarding the world. Dwelling thus, contemplating the body in the body, he becomes rightly concentrated and rightly clarified. Being rightly concentrated and rightly clarified in this way, he brings forth knowledge and vision regarding the external body, the body of another. He dwells contemplating feelings in feelings…pe… he brings forth knowledge and vision regarding external feelings, the feelings of another. He dwells contemplating mind in mind…pe… he brings forth knowledge and vision regarding the external mind, the mind of another. He dwells contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having removed longing and displeasure regarding the world. Dwelling thus, contemplating phenomena in phenomena, he becomes rightly concentrated and rightly clarified. Being rightly concentrated and rightly clarified in this way, he brings forth knowledge and vision regarding external phenomena, the phenomena of another. These, venerable sirs, are the four foundations of mindfulness taught by the Blessed One—the Knower, the Seer, the Worthy One, the Perfectly Enlightened One—for the attainment of skillful qualities.\" Venerable sir, Brahmā Sanankumāra spoke this meaning. Having spoken this meaning, venerable sir, Brahmā Sanankumāra addressed the gods of Tāvatiṃsa.",
      "sinhala": "‘‘පින්වත් තාවතිංස දෙවියනි, සියල්ල දන්නා, සියල්ල දක්නා වූ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ විසින් කුසල් අත්පත් කර ගැනීම පිණිස මැනවින් දේශනා කරන ලද මේ සතර සතිපට්ඨානයන් ගැන ඔබ කුමක් සිතන්නෙහිද? එම සතර සතිපට්ඨානයන් මොනවාද?\n\nපින්වත, මෙහි භික්ෂුව තමාගේ කායෙහි කායානුපස්සනාව කරමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, නුවණින් හා සිහියෙන් යුක්තව ලෝකයෙහි අභිධ්‍යා සහ දෝමනස්සයන් දුරු කරමින් වාසය කරයි. තමාගේ කායෙහි කායානුපස්සනාව කරමින් වාසය කරන ඔහු එහි මැනවින් සමාධිගත වෙයි, මැනවින් පැහැදෙයි. එසේ මැනවින් සමාධිගත වූ, මැනවින් පැහැදුණු ඔහු බාහිර වශයෙන් අනුන්ගේ කායෙහි ඥාන දර්ශනය උපදවයි.\n\nපින්වත, මෙහි භික්ෂුව තමාගේ වේදනාවන්හි වේදනානුපස්සනාව කරමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, නුවණින් හා සිහියෙන් යුක්තව ලෝකයෙහි අභිධ්‍යා සහ දෝමනස්සයන් දුරු කරමින් වාසය කරයි. තමාගේ වේදනාවන්හි වේදනානුපස්සනාව කරමින් වාසය කරන ඔහු එහි මැනවින් සමාධිගත වෙයි, මැනවින් පැහැදෙයි. එසේ මැනවින් සමාධිගත වූ, මැනවින් පැහැදුණු ඔහු බාහිර වශයෙන් අනුන්ගේ වේදනාවන්හි ඥාන දර්ශනය උපදවයි.\n\nපින්වත, මෙහි භික්ෂුව තමාගේ සිතෙහි චිත්තානුපස්සනාව කරමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, නුවණින් හා සිහියෙන් යුක්තව ලෝකයෙහි අභිධ්‍යා සහ දෝමනස්සයන් දුරු කරමින් වාසය කරයි. තමාගේ සිතෙහි චිත්තානුපස්සනාව කරමින් වාසය කරන ඔහු එහි මැනවින් සමාධිගත වෙයි, මැනවින් පැහැදෙයි. එසේ මැනවින් සමාධිගත වූ, මැනවින් පැහැදුණු ඔහු බාහිර වශයෙන් අනුන්ගේ සිතෙහි ඥාන දර්ශනය උපදවයි.\n\nපින්වත, මෙහි භික්ෂුව තමාගේ ධර්මයන්හි ධම්මානුපස්සනාව කරමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, නුවණින් හා සිහියෙන් යුක්තව ලෝකයෙහි අභිධ්‍යා සහ දෝමනස්සයන් දුරු කරමින් වාසය කරයි. තමාගේ ධර්මයන්හි ධම්මානුපස්සනාව කරමින් වාසය කරන ඔහු එහි මැනවින් සමාධිගත වෙයි, මැනවින් පැහැදෙයි. එසේ මැනවින් සමාධිගත වූ, මැනවින් පැහැදුණු ඔහු බාහිර වශයෙන් අනුන්ගේ ධර්මයන්හි ඥාන දර්ශනය උපදවයි.\n\nපින්වත්නි, සියල්ල දන්නා, සියල්ල දක්නා වූ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ විසින් කුසල් අත්පත් කර ගැනීම පිණිස මේ සතර සතිපට්ඨානයන් දේශනා කරන ලදහ.’’\n\nවහන්ස, සනංකුමාර බ්‍රහ්මයාණන් වහන්සේ මෙම අර්ථය වදාළ සේක. වහන්ස, සනංකුමාර බ්‍රහ්මයාණන් වහන්සේ මෙම අර්ථය වදාරා තාවතිංස දෙවියන්ට ආමන්ත්‍රණය කළ සේක.",
      "paliTitle": "Catusatipaṭṭhānaṃ",
      "englishTitle": "The Four Foundations of Mindfulness",
      "sinhalaTitle": "චතුසතිපට්ඨානය"
    },
    {
      "number": 290,
      "pali": "‘‘‘Taṃ kiṃ maññanti, bhonto devā tāvatiṃsā, yāva supaññattā cime tena bhagavatā jānatā passatā arahatā sammāsambuddhena satta samādhiparikkhārā sammāsamādhissa paribhāvanāya sammāsamādhissa pāripūriyā. Katame satta? Sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati. Yā kho, bho, imehi sattahaṅgehi cittassa ekaggatā parikkhatā, ayaṃ vuccati, bho, ariyo sammāsamādhi saupaniso itipi saparikkhāro itipi. Sammādiṭṭhissa bho, sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammāvācassa sammākammanto pahoti. Sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa sammāñāṇaṃ pahoti, sammāñāṇassa sammāvimutti pahoti. Yañhi taṃ, bho, sammā vadamāno vadeyya – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhi apārutā amatassa dvārā’ti idameva taṃ sammā vadamāno vadeyya. Svākkhāto hi, bho, bhagavatā dhammo sandiṭṭhiko, akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhi apārutā amatassa dvārā [dvārāti (syā. ka.)]. ‘‘‘Ye hi keci, bho, buddhe aveccappasādena samannāgatā, dhamme aveccappasādena samannāgatā, saṅghe aveccappasādena samannāgatā, ariyakantehi sīlehi samannāgatā, ye cime opapātikā dhammavinītā sātirekāni catuvīsatisatasahassāni māgadhakā paricārakā abbhatītā kālaṅkatā tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpannā avinipātadhammā niyatā sambodhiparāyaṇā. Atthi cevettha sakadāgāmino. ‘‘Atthāyaṃ [athāyaṃ (sī. syā.)] itarā pajā, puññābhāgāti me mano; Saṅkhātuṃ nopi sakkomi, musāvādassa ottappa’’nti.",
      "english": "\"Friends, what do the Tāvatiṃsa gods think? The Blessed One, the knowing and seeing one, the worthy one, the fully awakened one, has well-proclaimed these seven constituents for developing right concentration, for perfecting right concentration. What seven? Right view, right intention, right speech, right action, right livelihood, right effort, and right mindfulness. Friends, the singleness of mind furnished by these seven constituents is called noble right concentration, with its supports and equipment.\n\n\"For right view, right intention is helpful; for right intention, right speech is helpful; for right speech, right action is helpful; for right action, right livelihood is helpful; for right livelihood, right effort is helpful; for right effort, right mindfulness is helpful; for right mindfulness, right concentration is helpful; for right concentration, right knowledge is helpful; for right knowledge, right liberation is helpful.\n\n\"Indeed, friends, whoever speaks correctly might say: ‘The Dhamma is well-proclaimed by the Blessed One, directly visible, immediate, inviting one to come and see, leading onward, to be personally experienced by the wise; the doors to the Deathless are opened.’ This is precisely what someone speaking correctly might say. For truly, friends, the Dhamma is well-proclaimed by the Blessed One: directly visible, immediate, inviting one to come and see, leading onward, to be personally experienced by the wise; the doors to the Deathless are opened.\n\n\"Furthermore, friends, those endowed with unwavering confidence in the Buddha, unwavering confidence in the Dhamma, unwavering confidence in the Sangha, and endowed with virtues prized by the noble ones—these beings, reborn spontaneously and trained in the Dhamma and Discipline, exceed two million four hundred thousand Magadhan attendants who have passed away, completed their lives, and, through the destruction of the three fetters, are stream-enterers, no longer subject to states of woe, assured, and destined for enlightenment. And there are also some who are once-returners. 'The remaining populace is insignificant; I consider them lacking in merit; I am not even able to count them, for fear of speaking falsely.'\"",
      "sinhala": "‘‘පින්වත්නි, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් සම්මා සමාධිය වැඩීම පිණිස, සම්මා සමාධිය සම්පූර්ණ කිරීම පිණිස මැනවින් පනවන ලද සප්ත සමාධි පරිෂ්කාරයන් ගැන තාවතිංස දෙවියෝ කෙසේ සිතත් ද? එම සප්ත සමාධි පරිෂ්කාර කවරේද? සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති යන මේවාය. පින්වත්නි, යම් හෙයකින් මේ සප්ත අංගයන්ගෙන් සිතේ ඒකාග්‍රතාවය පිරිසිදු වේ නම්, එය හේතු සහිත ආර්ය සම්මා සමාධිය ලෙසත්, පරිෂ්කාර සහිත ලෙසත් කියනු ලැබේ. පින්වත්නි, සම්මා දිට්ඨිය ඇති තැනැත්තාට සම්මා සංකප්ප උපකාරී වේ. සම්මා සංකප්ප ඇති තැනැත්තාට සම්මා වාචා උපකාරී වේ. සම්මා වාචා ඇති තැනැත්තාට සම්මා කම්මන්ත උපකාරී වේ. සම්මා කම්මන්ත ඇති තැනැත්තාට සම්මා ආජීව උපකාරී වේ. සම්මා ආජීව ඇති තැනැත්තාට සම්මා වායාම උපකාරී වේ. සම්මා වායාම ඇති තැනැත්තාට සම්මා සති උපකාරී වේ. සම්මා සති ඇති තැනැත්තාට සම්මා සමාධිය උපකාරී වේ. සම්මා සමාධිය ඇති තැනැත්තාට සම්මා ඤාණය උපකාරී වේ. සම්මා ඤාණය ඇති තැනැත්තාට සම්මා විමුක්තිය උපකාරී වේ. යමෙක් මනා කොට කථා කරමින්, ‘භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය ස්වයං දෘෂ්ටික ය, ක්ෂණික ය, එන්න, බලන්න කිව හැකි ය, මෙනෙහි කිරීමට සුදුසු ය, නුවණැත්තන් විසින් තම තමන් තුළින් ම දැනගත යුතු ය, අමෘත ද්වාරය විවෘත කර ඇත’ යැයි කියන්නේ නම්, ඔහු මනා කොට කථා කරයි. පින්වත්නි, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය ස්වයං දෘෂ්ටික ය, ක්ෂණික ය, එන්න, බලන්න කිව හැකි ය, මෙනෙහි කිරීමට සුදුසු ය, නුවණැත්තන් විසින් තම තමන් තුළින් ම දැනගත යුතු ය, අමෘත ද්වාරය විවෘත කර ඇත.\n\nපින්වත්නි, යම් කෙනෙක් බුදුන් කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත ව, ධර්මය කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත ව, සංඝයා කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත ව, ආර්යයන් කැමති සිල්වලින් යුක්ත ව, යම් ධර්ම විනයක ඕපපාතික ව ඉපදුනාවූ විසිහතර ලක්ෂයකට අධික මගධක පිරිසක් කලින් මියගිය කල්හි සංයෝජන තුනක් දුරු කිරීමෙන් සෝතාපන්න වූවෝ නම්, ඔවුන් නැවත නපුරු ගතිවලට නොවැටෙන ස්වභාව ඇත්තාහු නිවනට නියත වූවාහු ය. මෙහි සකෘදාගාමී වූවෝ ද වෙති.\n\nඒ අනෙක් සත්වයෝ පින් නැත්තෝ යැයි මම සිතමි. මුසාවාදයට ලැජ්ජා බිය ඇත්තවුන් ගණන් කිරීමට මට නොහැකි ය.",
      "paliTitle": "Satta samādhiparikkhārā",
      "englishTitle": "Seven factors of concentration.",
      "sinhalaTitle": "සත්ත සමාධි පරික්ඛාර"
    },
    {
      "number": 291,
      "pali": "‘Imamatthaṃ, bhante, brahmā sanaṅkumāro bhāsittha, imamatthaṃ, bhante, brahmuno sanaṅkumārassa bhāsato vessavaṇassa mahārājassa evaṃ cetaso parivitakko udapādi – ‘‘acchariyaṃ vata bho, abbhutaṃ vata bho, evarūpopi nāma uḷāro satthā bhavissati, evarūpaṃ uḷāraṃ dhammakkhānaṃ, evarūpā uḷārā visesādhigamā paññāyissantī’’ti. Atha, bhante, brahmā sanaṅkumāro vessavaṇassa mahārājassa cetasā cetoparivitakkamaññāya vessavaṇaṃ mahārājānaṃ etadavoca – ‘‘taṃ kiṃ maññati bhavaṃ vessavaṇo mahārājā atītampi addhānaṃ evarūpo uḷāro satthā ahosi, evarūpaṃ uḷāraṃ dhammakkhānaṃ, evarūpā uḷārā visesādhigamā paññāyiṃsu. Anāgatampi addhānaṃ evarūpo uḷāro satthā bhavissati, evarūpaṃ uḷāraṃ dhammakkhānaṃ, evarūpā uḷārā visesādhigamā paññāyissantī’’’ti.",
      "english": "\"Venerable sir, Brahma Sanankumara spoke about this matter. While Brahma Sanankumara was speaking, this thought arose in the mind of King Vessavana: 'Truly wonderful! Truly amazing! Such a remarkable teacher will exist, such a remarkable discourse on the Dhamma, such remarkable attainments of special insight will be evident!' Then, venerable sir, Brahma Sanankumara, knowing King Vessavana's thoughts, said to him: 'What do you think, King Vessavana? In the past, did such a remarkable teacher exist, such a remarkable discourse on the Dhamma, such remarkable attainments of special insight become evident? And in the future, will such a remarkable teacher exist, such a remarkable discourse on the Dhamma, such remarkable attainments of special insight be evident?'\"",
      "sinhala": "භාග්‍යවතුන් වහන්ස, මේ කරුණ සනංකුමාර බ්‍රහ්මයා විසින් ප්‍රකාශ කරන ලදී. භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා මෙය ප්‍රකාශ කරද්දී වෛශ්‍රවණ මහාරාජයාගේ සිතෙහි මෙවැනි කල්පනාවක් ඇති විය: ‘අහෝ පුදුමයකි! අහෝ ආශ්චර්යයකි! මෙවැනි උදාර ශාස්තෘවරයෙක් පහළ වනු ඇත! මෙවැනි උදාර ධර්ම කථාවක් ද, මෙවැනි උදාර විශේෂාධිගමයන් ද ප්‍රකට වනු ඇත!’ අනතුරුව, භාග්‍යවතුන් වහන්ස, සනංකුමාර බ්‍රහ්මයා වෛශ්‍රවණ මහරජුගේ සිතේ ඇති කල්පනාව දැන, වෛශ්‍රවණ මහරජුට මෙසේ කීවේය: ‘වෛශ්‍රවණ මහරජ, ඔබ කුමක් සිතනවා ද? අතීත කාලයේත් මෙවැනි උදාර ශාස්තෘවරයෙක් සිටියා ද? මෙවැනි උදාර ධර්ම කථාවක් ද, මෙවැනි උදාර විශේෂාධිගමයන් ද ප්‍රකට වූවා ද? අනාගත කාලයේත් මෙවැනි උදාර ශාස්තෘවරයෙක් සිටිනු ඇත ද? මෙවැනි උදාර ධර්ම කථාවක් ද, මෙවැනි උදාර විශේෂාධිගමයන් ද ප්‍රකට වනු ඇත ද?’",
      "paliTitle": ""
    },
    {
      "number": 292,
      "pali": "‘‘‘Imamatthaṃ, bhante, brahmā sanaṅkumāro devānaṃ tāvatiṃsānaṃ abhāsi, imamatthaṃ vessavaṇo mahārājā brahmuno sanaṅkumārassa devānaṃ tāvatiṃsānaṃ bhāsato sammukhā sutaṃ [sutvā (sī. pī.)] sammukhā paṭiggahitaṃ sayaṃ parisāyaṃ ārocesi’’. Imamatthaṃ janavasabho yakkho vessavaṇassa mahārājassa sayaṃ parisāyaṃ bhāsato sammukhā sutaṃ sammukhā paṭiggahitaṃ [paṭiggahetvā (sī. pī.)] bhagavato ārocesi. Imamatthaṃ bhagavā janavasabhassa yakkhassa sammukhā sutvā sammukhā paṭiggahetvā sāmañca abhiññāya āyasmato ānandassa ārocesi, imamatthamāyasmā ānando bhagavato sammukhā sutvā sammukhā paṭiggahetvā ārocesi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Tayidaṃ brahmacariyaṃ iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitanti.",
      "english": "\"Venerable Sir, Brahmā Sanankumāra spoke of this matter to the Tāvatiṃsa gods. Mahārāja Vessavaṇa heard this matter directly from Brahmā Sanankumāra as he spoke to the Tāvatiṃsa gods, received it directly, and proclaimed it himself in his assembly.\"\n\n\"The Yaksha Janavasabha heard this matter directly from Mahārāja Vessavaṇa as he proclaimed it himself in his assembly, received it directly, and reported it to the Blessed One. Having heard this matter directly from the Yaksha Janavasabha and received it directly, the Blessed One, having known it for himself, reported it to the venerable Ānanda. Having heard this matter directly from the Blessed One and received it directly, the venerable Ānanda reported it to the monks, nuns, male lay followers, and female lay followers. Thus, this holy life is prosperous, flourishing, widespread, well-known to many, universally established, and well-proclaimed among gods and humans.\"",
      "sinhala": "‘‘ස්වාමීනි, සනංකුමාර බ්‍රහ්මයා මේ කාරණය තාවතිංස දෙවියන්ට පැවසුවා. වෙසවණ මහරජතුමා සනංකුමාර බ්‍රහ්මයා තාවතිංස දෙවියන්ට පවසන මේ කාරණය සෘජුව ම අසා, සෘජුව ම පිළිගෙන තමාගේ පිරිසට ප්‍රකාශ කළා.’’ ජනවසභ යක්ෂයා වෙසවණ මහරජතුමා තමාගේ පිරිසට පවසන මේ කාරණය සෘජුව ම අසා, සෘජුව ම පිළිගෙන භාග්‍යවතුන් වහන්සේට ප්‍රකාශ කළා. භාග්‍යවතුන් වහන්සේ ජනවසභ යක්ෂයාගෙන් සෘජුව ම අසා, සෘජුව ම පිළිගෙන, තමන්ගේ විශිෂ්ඨ ඥානයෙන් දැන ආයුෂ්මත් ආනන්දයන් වහන්සේට ප්‍රකාශ කළ සේක. ආයුෂ්මත් ආනන්දයන් වහන්සේ භාග්‍යවතුන් වහන්සේගෙන් සෘජුව ම අසා, සෘජුව ම පිළිගෙන භික්ෂූන්ට, භික්ෂුණීන්ට, උපාසකයන්ට හා උපාසිකාවන්ට ප්‍රකාශ කළහ. මේ බ්‍රහ්මචරියාව සෞභාග්‍යමත් ය; වර්ධනය වූවක් ය; විස්තීරණ වූවක් ය; බොහෝ දෙනා දන්නා දෙයක් ය; මහත් වූවක් ය; දෙවියන් හා මිනිසුන් විසින් මැනවින් ප්‍රකාශිත වූවක් ද වේ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Janavasabhasuttaṃ niṭṭhitaṃ pañcamaṃ.",
    "english": "The Janavasabha Sutta: The Fifth is Finished.",
    "sinhala": "ජාණවස්සභ සූත්‍රය නිමයි - පස්වන."
  }
}