{
  "id": "dn21",
  "title": {
    "pali": "Sakkapañhasuttaṃ",
    "english": "The Discourse on Sakka's Questions",
    "sinhala": "ශක්‍රප්‍රශ්න සූත්‍රය"
  },
  "sections": [
    {
      "number": 344,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā magadhesu viharati, pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṃ. Tena kho pana samayena sakkassa devānamindassa ussukkaṃ udapādi bhagavantaṃ dassanāya. Atha kho sakkassa devānamindassa etadahosi – ‘‘kahaṃ nu kho bhagavā etarahi viharati arahaṃ sammāsambuddho’’ti? Addasā kho sakko devānamindo bhagavantaṃ magadhesu viharantaṃ pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṃ. Disvāna deve tāvatiṃse āmantesi – ‘‘ayaṃ, mārisā, bhagavā magadhesu viharati, pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṃ. Yadi pana, mārisā, mayaṃ taṃ bhagavantaṃ dassanāya upasaṅkameyyāma arahantaṃ sammāsambuddha’’nti? ‘‘Evaṃ bhaddantavā’’ti kho devā tāvatiṃsā sakkassa devānamindassa paccassosuṃ.",
      "english": "Thus I have heard. At one time, the Blessed One was staying in Magadha, in the brahmin village named Ambasanda, east of Rajagaha, north of which lies Vediyaka mountain, in the Indasala Cave. Now, Sakka, the lord of the devas, felt eagerness to see the Blessed One. Then, this thought occurred to Sakka, the lord of the devas: \"Where is the Blessed One, the Arahant, the Perfectly Enlightened One, currently staying?\" Sakka, the lord of the devas, saw the Blessed One staying in Magadha, in the brahmin village named Ambasanda, east of Rajagaha, north of which lies Vediyaka mountain, in the Indasala Cave. Seeing this, he addressed the Tavatimsa devas: \"Friends, the Blessed One is staying in Magadha, in the brahmin village named Ambasanda, east of Rajagaha, north of which lies Vediyaka mountain, in the Indasala Cave. Friends, what if we were to approach the Blessed One, the Arahant, the Perfectly Enlightened One, for an audience?\" \"Very well, sir,\" the Tavatimsa devas replied to Sakka, the lord of the devas.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ මගධ දේශයෙහි, රජගහ නුවරට නැගෙනහිරින් පිහිටි අම්බසණ්ඩ නම් බ්‍රාහ්මණ ග්‍රාමයට උතුරින් වූ වේදියක පර්වතයෙහි ඉන්දසාල ගුහාවේ වැඩ වාසය කළ සේක. එකල්හි දෙවියන්ට අධිපති ශක්‍රයාට භාග්‍යවත් බුදුරජාණන් වහන්සේ දැකීමට උනන්දුවක් ඇති විය. ඉක්බිති දෙවියන්ට අධිපති ශක්‍රයාට මෙවැනි සිතක් පහළ විය: \"අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ දැන් කොහි වැඩ වසන සේක් දැ?\" දෙවියන්ට අධිපති ශක්‍රයා මගධ දේශයෙහි, රජගහ නුවරට නැගෙනහිරින් පිහිටි අම්බසණ්ඩ නම් බ්‍රාහ්මණ ග්‍රාමයට උතුරින් වූ වේදියක පර්වතයෙහි ඉන්දසාල ගුහාවේ භාග්‍යවත් බුදුරජාණන් වහන්සේ වැඩ වසන බව දුටුවේය. දැක, තව්තිසා දෙවියන් අමතා මෙසේ කීවේය: \"පින්වත්නි, භාග්‍යවත් බුදුරජාණන් වහන්සේ මගධ දේශයෙහි, රජගහ නුවරට නැගෙනහිරින් පිහිටි අම්බසණ්ඩ නම් බ්‍රාහ්මණ ග්‍රාමයට උතුරින් වූ වේදියක පර්වතයෙහි ඉන්දසාල ගුහාවේ වැඩ වසන සේක. අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ බැහැදැකීමට අපි එතැනට යමු ද?\" \"එසේය ස්වාමීනි,\" යැයි තව්තිසා දෙවියෝ දෙවියන්ට අධිපති ශක්‍රයාට පිළිතුරු දුන්හ.",
      "paliTitle": ""
    },
    {
      "number": 345,
      "pali": "Atha kho sakko devānamindo pañcasikhaṃ gandhabbadevaputtaṃ [gandhabbaputtaṃ (syā.)] āmantesi – ‘‘ayaṃ, tāta pañcasikha, bhagavā magadhesu viharati pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate indasālaguhāyaṃ. Yadi pana, tāta pañcasikha, mayaṃ taṃ bhagavantaṃ dassanāya upasaṅkameyyāma arahantaṃ sammāsambuddha’’nti? ‘‘Evaṃ bhaddantavā’’ti kho pañcasikho gandhabbadevaputto sakkassa devānamindassa paṭissutvā beluvapaṇḍuvīṇaṃ ādāya sakkassa devānamindassa anucariyaṃ upāgami.",
      "english": "Then Sakka, lord of the devas, addressed Pañcasikha, the divine musician: \"My dear Pañcasikha, the Blessed One is staying in Magadha near the brahmin village of Ambasaṇḍā, which is east of Rajagaha, and specifically north of that village on Vediyaka Mountain, in Indasāla Cave. What do you say, Pañcasikha, to our visiting the Blessed One, the Arahant, the Perfectly Enlightened One?\"\n\n\"Yes, venerable sir,\" replied Pañcasikha, the divine musician, agreeing with Sakka, lord of the devas. He took up his Beluva-Paṇḍu lute and followed behind Sakka, lord of the devas.",
      "sinhala": "එවිට සක් දෙවිඳු, පංචසිඛ නම් ගාන්ධර්ව දේවපුත්‍රයා අමතා මෙසේ පැවසීය: \"පින්වත් පංචසිඛ, භාග්‍යවත් බුදුරජාණන් වහන්සේ මගධ දේශයේ, රාජගහ නුවරට නැගෙනහිර දෙසින් පිහිටි අම්බසණ්ඩ නම් බ්‍රාහ්මණ ග්‍රාමයට උතුරින්, වේදියක පර්වතයේ ඉන්දසාල ගුහාවේ වැඩ වාසය කරන සේක. පින්වත් පංචසිඛ, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වන උන්වහන්සේ බැහැදැකීමට අපි එතැනට යමුද?\" \"එසේය ස්වාමීනි,\" යැයි පංචසිඛ ගාන්ධර්ව දේවපුත්‍රයා සක් දෙවිඳුට පිළිතුරු දී, බෙලුවපණ්ඩු වීණාව රැගෙන සක් දෙවිඳුන් අනුව ගියේය.",
      "paliTitle": ""
    },
    {
      "number": 346,
      "pali": "Atha kho sakko devānamindo devehi tāvatiṃsehi parivuto pañcasikhena gandhabbadevaputtena purakkhato seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya pasāritaṃ vā bāhaṃ samiñjeyya; evameva devesu tāvatiṃsesu antarahito magadhesu pācīnato rājagahassa ambasaṇḍā nāma brāhmaṇagāmo, tassuttarato vediyake pabbate paccuṭṭhāsi. Tena kho pana samayena vediyako pabbato atiriva obhāsajāto hoti ambasaṇḍā ca brāhmaṇagāmo yathā taṃ devānaṃ devānubhāvena. Apissudaṃ parito gāmesu manussā evamāhaṃsu – ‘‘ādittassu nāmajja vediyako pabbato jhāyatisu [jhāyatassu (syā.), pajjhāyitassu (sī. pī.)] nāmajja vediyako pabbato jalatisu [jalatassu (syā.), jalitassu (sī. pī.)] nāmajja vediyako pabbato kiṃsu nāmajja vediyako pabbato atiriva obhāsajāto ambasaṇḍā ca brāhmaṇagāmo’’ti saṃviggā lomahaṭṭhajātā ahesuṃ.",
      "english": "Then Sakka, the king of the devas, surrounded by the Tāvatiṃsa devas and preceded by Pañcasikha, the gandhabba-deva, vanished from among the Tāvatiṃsa devas as quickly as a strong man might extend a bent arm or bend an extended arm. He reappeared on Vediyaka mountain, north of Ambasaṇḍā, a brahmin village in Magadha, east of Rājagaha. At that time, Vediyaka mountain and the brahmin village of Ambasaṇḍā became extraordinarily luminous through the power of the devas. People in the surrounding villages exclaimed, \"Indeed, Vediyaka mountain is ablaze today! Indeed, Vediyaka mountain is burning today! Indeed, Vediyaka mountain is glowing today! Why are Vediyaka mountain and the brahmin village of Ambasaṇḍā so extraordinarily luminous today?\" Disturbed, they experienced hair-raising awe.",
      "sinhala": "ඉක්බිති දෙවියන්ට අධිපති ශක්‍රයා, තව්තිසා දෙවියන් පිරිවරාගත් පිරිස සමඟ, පඤ්චසිඛ නම් ගාන්ධර්ව දෙව්පුත්‍රයා පෙරටු කරගෙන, බලවත් පුරුෂයෙක් හැකිලූ අතක් දිගහරින්නාක් මෙන් හෝ දිගහැරිය අතක් හකුළාගන්නාක් මෙන් ඒ අයුරින්ම තව්තිසා දෙව්ලොවින් අතුරුදන්ව, මගධ දේශයේ රජගහ නුවරට නැගෙනහිර දෙසින් පිහිටි අම්බසණ්ඩ නම් බ්‍රාහ්මණ ගමට උතුරින් වූ වේදියක පර්වතය මත පහළ විය. එකල්හි වේදියක පර්වතයත්, අම්බසණ්ඩ බ්‍රාහ්මණ ග්‍රාමයත් දෙවියන්ගේ ආනුභාවයෙන් අතිශයින්ම බැබළෙන්නට විය. එවිට අවට ගම්වල මිනිස්සු, \"අද වේදියක පර්වතය ගිනිගන්නවාද? අද වේදියක පර්වතය දැවෙනවාද? අද වේදියක පර්වතය ඇවිලෙනවාද? අද වේදියක පර්වතයත් අම්බසණ්ඩ බ්‍රාහ්මණ ග්‍රාමයත් මෙතරම් දීප්තිමත්ව බැබළෙන්නේ කුමක් නිසාද?\" යැයි විමතියට පත්ව, භීතියෙන් ලොමු දැහැගැන්වී ගියහ.",
      "paliTitle": ""
    },
    {
      "number": 347,
      "pali": "Atha kho sakko devānamindo pañcasikhaṃ gandhabbadevaputtaṃ āmantesi – ‘‘durupasaṅkamā kho, tāta pañcasikha, tathāgatā mādisena, jhāyī jhānaratā, tadantaraṃ [tadanantaraṃ (sī. syā. pī. ka.)] paṭisallīnā. Yadi pana tvaṃ, tāta pañcasikha, bhagavantaṃ paṭhamaṃ pasādeyyāsi, tayā, tāta, paṭhamaṃ pasāditaṃ pacchā mayaṃ taṃ bhagavantaṃ dassanāya upasaṅkameyyāma arahantaṃ sammāsambuddha’’nti. ‘‘Evaṃ bhaddantavā’’ti kho pañcasikho gandhabbadevaputto sakkassa devānamindassa paṭissutvā beluvapaṇḍuvīṇaṃ ādāya yena indasālaguhā tenupasaṅkami; upasaṅkamitvā ‘‘ettāvatā me bhagavā neva atidūre bhavissati nāccāsanne, saddañca me sossatī’’ti ekamantaṃ aṭṭhāsi. ",
      "english": "Then Sakka, the king of the devas, addressed Pañcasikha, the gandhabba deva-son: \"Truly, Pañcasikha, Tathāgatas are difficult for one such as myself to approach, being meditative, delighting in meditation, and deeply secluded. If you, Pañcasikha, could first win the Blessed One's favor, then after you have pleased him, we could approach that Blessed One, the Arahant, the Perfectly Enlightened One, for an audience.\" \"Yes, venerable sir,\" Pañcasikha, the gandhabba deva-son, agreed with Sakka, the king of the devas. Taking his beluva-wood lute, he went to the Indasala Cave and, upon arriving, stood to one side, thinking, \"From here, the Blessed One will be neither too far nor too near, and he will hear my voice.\"",
      "sinhala": "එවිට ශක්‍ර දේවේන්ද්‍රයා පංචසිඛ නම් ගාන්ධර්ව දේවපුත්‍රයා අමතා මෙසේ පැවසීය: \"පංචසිඛය, මා වැනි අයට තථාගතයන් වහන්සේලා වෙත ළඟා වීම දුෂ්කරය. උන්වහන්සේලා ධ්‍යාන වඩන්නන්ය, ධ්‍යානයෙහි ඇලී ගැලී වාසය කරන්නන්ය, තවද හුදෙකලාව වැඩ වසන්නන්ය. එහෙත් පංචසිඛය, ඔබ පළමුව භාග්‍යවතුන් වහන්සේ ප්‍රසාදයට පත් කරන්නේ නම්, ඔබගේ ප්‍රසාදය ලැබීමෙන් පසු අපි අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ දැකීමට පැමිණෙන්නෙමු.\" \"එසේය ස්වාමීනි,\" යැයි පංචසිඛ ගාන්ධර්ව දේවපුත්‍රයා ශක්‍ර දේවේන්ද්‍රයාට පිළිතුරු දී බෙලුවපණ්ඩු වීණාව රැගෙන ඉන්දසාල ගුහාව දෙසට ගියේය. එහි ගොස් \"භාග්‍යවතුන් වහන්සේ මට වැඩි දුරකින් හෝ වැඩි ළඟකින් තොරව වැඩ සිටින සේක. එමෙන්ම මගේ හඬ ඇසෙනු ඇත\" යනුවෙන් සිතා එක් පසෙකින් සිට ගත්තේය.",
      "paliTitle": ""
    },
    {
      "number": 348,
      "pali": "Ekamantaṃ ṭhito kho pañcasikho gandhabbadevaputto beluvapaṇḍuvīṇaṃ [veḷuvapaṇḍuvīṇaṃ ādāya (syā.)] assāvesi, imā ca gāthā abhāsi buddhūpasañhitā dhammūpasañhitā saṅghūpasañhitā arahantūpasañhitā kāmūpasañhitā – ‘‘Vande te pitaraṃ bhadde, timbaruṃ sūriyavacchase; Yena jātāsi kalyāṇī, ānandajananī mama. ‘‘Vātova sedataṃ kanto, pānīyaṃva pipāsato; Aṅgīrasi piyāmesi, dhammo arahatāmiva. ‘‘Āturasseva bhesajjaṃ, bhojanaṃva jighacchato; Parinibbāpaya maṃ bhadde, jalantamiva vārinā. ‘‘Sītodakaṃ pokkharaṇiṃ, yuttaṃ kiñjakkhareṇunā; Nāgo ghammābhitattova, ogāhe te thanūdaraṃ. ‘‘Accaṅkusova nāgova, jitaṃ me tuttatomaraṃ; Kāraṇaṃ nappajānāmi, sammatto lakkhaṇūruyā. ‘‘Tayi gedhitacittosmi, cittaṃ vipariṇāmitaṃ; Paṭigantuṃ na sakkomi, vaṅkaghastova ambujo. ‘‘Vāmūru saja maṃ bhadde, saja maṃ mandalocane; Palissaja maṃ kalyāṇi, etaṃ me abhipatthitaṃ. ‘‘Appako vata me santo, kāmo vellitakesiyā; Anekabhāvo samuppādi, arahanteva dakkhiṇā. ‘‘Yaṃ me atthi kataṃ puññaṃ, arahantesu tādisu; Taṃ me sabbaṅgakalyāṇi, tayā saddhiṃ vipaccataṃ. ‘‘Yaṃ me atthi kataṃ puññaṃ, asmiṃ pathavimaṇḍale; Taṃ me sabbaṅgakalyāṇi, tayā saddhiṃ vipaccataṃ. ‘‘Sakyaputtova jhānena, ekodi nipako sato; Amataṃ muni jigīsāno [jigiṃsāno (sī. syā. pī.)], tamahaṃ sūriyavacchase. ‘‘Yathāpi muni nandeyya, patvā sambodhimuttamaṃ; Evaṃ nandeyyaṃ kalyāṇi, missībhāvaṃ gato tayā. ‘‘Sakko ce me varaṃ dajjā, tāvatiṃsānamissaro; Tāhaṃ bhadde vareyyāhe, evaṃ kāmo daḷho mama. ‘‘Sālaṃva na ciraṃ phullaṃ, pitaraṃ te sumedhase; Vandamāno namassāmi, yassā setādisī pajā’’ti.",
      "english": "Pañcasikha, the gandhabba-deva, stood to one side, played his Beluvapaṇḍu lute, and sang these verses, which praised the Buddha, the Dhamma, the Saṅgha, and the Arahants, and also expressed sensual love:\n\n\"I salute your father Timbara. O fair one, radiant as the sun, O beautiful one, my joy-bringer, you were born through him.\n\nLike a cool breeze to one sweating, like water to one thirsty, so am I devoted to you, Angirasi, as the Dhamma is dear to the Arahants.\n\nLike medicine to the sick, like food to the hungry, soothe me, fair one, as water extinguishes a fire.\n\nLike a cool lotus pond filled with pollen, like an elephant overcome by heat, I long to plunge into your breasts and belly.\n\nLike an elephant beyond the goad's control, my urging is overcome. Intoxicated by your beautiful thighs, I know no reason.\n\nMy mind is consumed with longing for you; my heart is transformed. I cannot turn back, like a fish caught on a curved hook.\n\nEmbrace me, fair one with beautiful thighs; embrace me, soft-eyed one. Embrace me, beautiful one; this is my desire.\n\nMy desire for the curly-haired one, which was once slight, has now grown manifold, like offerings given to Arahants.\n\nWhatever merit I have gained through such Arahants, may that, O beautiful one in every limb, ripen together with you.\n\nWhatever merit I have gained in this earthly realm, may that, O beautiful one in every limb, ripen together with you.\n\nLike a Sakyan son absorbed in meditation—focused, discerning, and mindful—a sage striving for the Deathless, so I am with you, radiant one.\n\nJust as a sage would rejoice upon attaining supreme enlightenment, so would I rejoice, beautiful one, having become one with you.\n\nIf Sakka, lord of the Tāvatiṃsa gods, were to grant me a boon, I would choose you, fair one; so strong is my desire.\n\nLike a Sāla tree freshly in bloom, I salute and revere your father, wise one, who has such a beautiful child.\"",
      "sinhala": "එක් පසෙක සිටි පංචසිඛ නම් ගාන්ධර්ව දිව්‍ය පුත්‍රයා බෙළුවපණ්ඩු වීණාව වාදනය කරමින්, බුදුන්, දහම්, සඟුන්, අරහතුන් හා කාමය පිළිබඳ මේ ගාථා ගායනා කළේය:\n\n\"භාග්‍යවතිය, සූර්යවච්ඡසා, ඔබට වාසනාව ගෙන දුන්, මට ප්‍රීතිය උදා කළ ඔබ උපන් තිම්බරු පියාණන්ට මම වන්දනා කරමි.\n\nදහදියෙන් වෙහෙස වූවෙකුට සිසිල් සුළඟ මෙන් ද, පිපාසිතයෙකුට ජලය මෙන් ද, අංගීරසී, ඔබ මට ප්‍රියයි. එය අරහතුන්හට ධර්මය ප්‍රිය වීම හා සමානය.\n\nරෝගියෙකුට බෙහෙතක් මෙන් ද, කුසගින්නෙන් පෙළෙන්නෙකුට ආහාර මෙන් ද, වාසනාවන්තිය, ගින්නක් නිවා දමන්නා සේ මාව සන්සුන් කරන්න.\n\nඋණුසුමෙන් පෙළෙන ඇත් රජෙකු නෙළුම් රේණු පිරුණු සිසිල් පොකුණකට බසින්නාක් මෙන්, ඔබගේ ළමැදට හා උදරයට ඇතුළු වීමට මම කැමැත්තෙමි.\n\nඇත්ගොවෙකුගේ අංකුසයෙන් මිදුණු ඇතෙකු මෙන් මගේ සංවරය බිඳී ගොස් ඇත. ඔබගේ මනහර කලවා මාව මත් කර ඇති බැවින් කුමක් කළ යුතු දැයි මම නොදනිමි.\n\nමාගේ සිත ඔබ කෙරෙහි ඇලී ගැලී විපරීත වී ඇත. වක්‍ර වූ දියසුළියකට හසුවූ නෙළුම් දණ්ඩක් මෙන් ආපසු හැරී යාමට මට නොහැකිය.\n\nසුන්දර කලවා ඇති භාග්‍යවතිය, මා බදා ගන්න. මන්ද්‍රාක්ෂී, මා වැළඳ ගන්න. ප්‍රියමනාපිය, මා තුරුළු කර ගන්න. එය මගේ එකම ප්‍රාර්ථනයයි.\n\nකැරලි ගැසුණු කෙස් කළඹ ඇති ඔබ කෙරෙහි මා තුළ වූ ආශාව මුලින් සුළු වුව ද, අරහතුන් උදෙසා කරන දක්ෂිණාවක් මෙන් එය බොහෝ ආකාරයෙන් වර්ධනය විය.\n\nමම යම් පිනක් අරහතුන් උදෙසා සිදු කර ඇත්නම්, සර්වාංගයෙන්ම සුන්දරිය, එම පින ඔබ සමඟ මට විපාක දේවා.\n\nමේ මිහිමත මා විසින් යම් කුසලයක් සිදු කර ඇත්නම්, සර්වාංගයෙන්ම සුන්දරිය, එම කුසලය ඔබ සමඟ මට විපාක දේවා.\n\nසක්ය පුත්‍රයෙකු මෙන් ධ්‍යානයෙන් සිත එකඟ කරගත්, නුවණැති, සිහියෙන් යුත්, අමෘතය සොයන මුනිවරයෙකු මෙන්, සූර්යවච්ඡසා, මම ඔබව ප්‍රාර්ථනා කරමි.\n\nමුනිවරයෙක් උතුම් සම්බෝධිය ලබා ප්‍රීති වන්නා සේම, භාග්‍යවතිය, ඔබ හා එක්වීමෙන් මම අතිශයින් ප්‍රීති වන්නෙමි.\n\nදෙව්ලොව අධිපති ශක්‍රයා මට වරයක් දෙන්නේ නම්, භාග්‍යවතිය, මම ඔබවම තෝරා ගන්නෙමි. මාගේ ආශාව එතරම් දැඩි වේ.\n\nඅලංකාර සල් ගසක් මෙන් නොබෝ කලකින් මැලවී යන, සුමේධසී, මෙවන් දරුවෙකුගේ පියා වන ඔබට මම වන්දනා කරමි.\"",
      "paliTitle": "Pañcasikhagītagāthā",
      "englishTitle": "Pañcasikha's Song",
      "sinhalaTitle": "පඤ්චසිඛ ගීත ගාථා"
    },
    {
      "number": 349,
      "pali": "Evaṃ vutte bhagavā pañcasikhaṃ gandhabbadevaputtaṃ etadavoca – ‘‘saṃsandati kho te, pañcasikha, tantissaro gītassarena, gītassaro ca tantissarena; na ca pana [neva pana (syā.)] te pañcasikha, tantissaro gītassaraṃ ativattati, gītassaro ca tantissaraṃ. Kadā saṃyūḷhā pana te, pañcasikha, imā gāthā buddhūpasañhitā dhammūpasañhitā saṅghūpasañhitā arahantūpasañhitā kāmūpasañhitā’’ti? ‘‘Ekamidaṃ, bhante, samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Tena kho panāhaṃ, bhante, samayena bhaddā nāma sūriyavacchasā timbaruno gandhabbarañño dhītā, tamabhikaṅkhāmi. Sā kho pana, bhante, bhaginī parakāminī hoti; sikhaṇḍī nāma mātalissa saṅgāhakassa putto, tamabhikaṅkhati. Yato kho ahaṃ, bhante, taṃ bhaginiṃ nālatthaṃ kenaci pariyāyena. Athāhaṃ beluvapaṇḍuvīṇaṃ ādāya yena timbaruno gandhabbarañño nivesanaṃ tenupasaṅkamiṃ; upasaṅkamitvā beluvapaṇḍuvīṇaṃ assāvesiṃ, imā ca gāthā abhāsiṃ buddhūpasañhitā dhammūpasañhitā saṅghūpasañhitā arahantūpasañhitā kāmūpasañhitā – ‘‘Vande te pitaraṃ bhadde, timbaruṃ sūriyavacchase; Yena jātāsi kalyāṇī, ānandajananī mama. …pe… Sālaṃva na ciraṃ phullaṃ, pitaraṃ te sumedhase; Vandamāno namassāmi, yassā setādisī pajā’’ti. ‘‘Evaṃ vutte, bhante, bhaddā sūriyavacchasā maṃ etadavoca – ‘na kho me, mārisa, so bhagavā sammukhā diṭṭho api ca sutoyeva me so bhagavā devānaṃ tāvatiṃsānaṃ sudhammāyaṃ sabhāyaṃ upanaccantiyā. Yato kho tvaṃ, mārisa, taṃ bhagavantaṃ kittesi, hotu no ajja samāgamo’ti. Soyeva no, bhante, tassā bhaginiyā saddhiṃ samāgamo ahosi. Na ca dāni tato pacchā’’ti. ",
      "english": "\"So spoken, the Blessed One said to Pañcasikha, the gandhabba divine son: “Pañcasikha, the sound of your lute blends harmoniously with the sound of your singing, and the sound of your singing blends harmoniously with the sound of your lute. Indeed, Pañcasikha, the sound of your lute doesn't overpower the sound of your singing, nor does the sound of your singing overpower the sound of your lute. When, Pañcasikha, did you compose these verses connected with the Buddha, connected with the Dhamma, connected with the Sangha, connected with the Arahants, and connected with sensual pleasures?”\n\n“Venerable Sir, on one occasion the Blessed One was dwelling in Uruvela, on the bank of the Nerañjara River, under the Ajapala Banyan tree, just after his full enlightenment. At that time, Venerable Sir, there was a maiden named Bhaddā Sūriyavacchasā, the daughter of Timbaru, king of the gandhabbas, and I desired her. However, Venerable Sir, that maiden was in love with another; she desired Sikhaṇḍī, the son of Matali the charioteer. Since I couldn't win her by any means, Venerable Sir, I took my beluva-wood lute and went to the dwelling of Timbaru, the king of the gandhabbas. Having arrived, I played my beluva-wood lute and sang these verses connected with the Buddha, connected with the Dhamma, connected with the Sangha, connected with the Arahants, and connected with sensual pleasures:\n\n‘I pay homage to your father, gracious Bhaddā, O Sūriyavacchasā, by whom you were born, fair one, my source of joy! ... Like a sala tree freshly in bloom, I bow and worship your father, O wise one, whose progeny is so radiant!’\n\n“When I had spoken thus, Venerable Sir, Bhaddā Sūriyavacchasā said to me: ‘Dear sir, I have not seen the Blessed One face to face, but I have heard about him while dancing in the Sudhamma assembly hall of the Tāvatiṃsa gods. Since you praise the Blessed One, dear sir, let us meet today.’ Venerable Sir, that was our only meeting with that maiden. There has been none since then.”",
      "sinhala": "මෙසේ වදාළ පසු භාග්‍යවත් බුදුරජාණන් වහන්සේ පංචසිඛ නම් ගාන්ධර්ව දේවපුත්‍රයාට මෙසේ වදාළහ: “පංචසිඛය, නුඹේ වීණාවේ ස්වරය ගීතයේ ස්වරය සමඟ මැනවින් ගැලපෙයි. ගීතයේ ස්වරයද වීණාවේ ස්වරය සමඟ මැනවින් ගැලපෙයි. පංචසිඛය, නුඹේ වීණාවේ ස්වරය ගීතයේ ස්වරය ඉක්මවා නොයයි. ගීතයේ ස්වරයද වීණාවේ ස්වරය ඉක්මවා නොයයි. පංචසිඛය, බුදුන්, දහම්, සඟ යන තෙරුවන් කෙරෙහි පැහැදීමෙන් මෙන්ම, අරහතුන් හා කාමය පිළිබඳ හැඟීම්වලින් උපන් මේ ගාථා නුඹ විසින් ගායනා කරනු ලැබුවේ කවදාද?”\n\n“ස්වාමීනි, එක් කලෙක භාග්‍යවත් බුදුරජාණන් වහන්සේ පළමු බුද්ධත්වයෙන් පසු උරුවෙල ජනපදයෙහි නේරංජරා නදී තීරයේ අජපාල නුග රුක් සෙවණෙහි වැඩ වාසය කළහ. ස්වාමීනි, ඒ කාලයෙහි මම තිම්බරු ගාන්ධර්ව රජුගේ දියණිය වූ සූරියවච්ඡසා නම් භද්‍රාව කෙරෙහි ආශාවක් ඇති කර ගතිමි. ස්වාමීනි, ඒ සොයුරිය අන් පුරුෂයන් කෙරෙහි ඇලූම් කරන්නියක් වූවාය. ඇය මාතලී නම් සංග්‍රාහකයාගේ පුත්‍රයා වූ සිඛණ්ඩී කෙරෙහි ආශා කළාය. ස්වාමීනි, මට කිසිම ආකාරයකින් ඇයව ලබා ගැනීමට නොහැකි වූ හෙයින්, මම බෙලුවපණ්ඩුවීණාව රැගෙන තිම්බරු ගාන්ධර්ව රජුගේ නිවසට ගියෙමි. එහි ගොස් බෙලුවපණ්ඩුවීණාව වාදනය කරමින්, බුදුන්, දහම්, සඟ යන තෙරුවන් කෙරෙහි පැහැදීමෙන් මෙන්ම, අරහතුන් හා කාමය පිළිබඳ හැඟීම්වලින් උපන් මේ ගාථා ගායනා කළෙමි:\n\n‘භද්‍රාවිය, සූරියවච්ඡසා, මට ප්‍රීතිය ගෙන දෙන්නී වූ සුරූපිනී, නුඹ යම් පියෙකු විසින් බිහි කරනු ලැබුවේ ද, ඒ නුඹේ පියා වන තිම්බරුට මම වන්දනා කරමි. ... ප්‍රඥාවන්තිය, අලුතින් පිපුණු සල් රුකකට මෙන් නුඹේ පියාට මම වන්දනා කරමි, නමස්කාර කරමි. මෙබඳු දරුවෙක් යමෙකුට සිටී නම්, ඔහු කෙතරම් භාග්‍යවන්තද!’”\n\n“ස්වාමීනි, මෙසේ කී විට සූරියවච්ඡසා නම් භද්‍රාව මට මෙසේ කීවාය: ‘පින්වත, මම ඒ භාග්‍යවත් බුදුරජාණන් වහන්සේ මුණගැසී නැත. එහෙත් තව්තිසා දෙවියන්ගේ සුධර්මා සභාවෙහි උන්වහන්සේ ගැන කතාබහ වන විට අසා ඇත්තෙමි. පින්වත, ඔබ ඒ භාග්‍යවත් බුදුරජාණන් වහන්සේගේ ගුණ වර්ණනා කරන බැවින් අද අපට හමුවීමක් වේවා!’ ස්වාමීනි, ඒ සොයුරිය සමඟ මට තිබූ එකම හමුවීම එයයි. ඉන්පසු අප හමු වී නැත.”",
      "paliTitle": ""
    },
    {
      "number": 350,
      "pali": "Atha kho sakkassa devānamindassa etadahosi – ‘‘paṭisammodati pañcasikho gandhabbadevaputto bhagavatā, bhagavā ca pañcasikhenā’’ti. Atha kho sakko devānamindo pañcasikhaṃ gandhabbadevaputtaṃ āmantesi – ‘‘abhivādehi me tvaṃ, tāta pañcasikha, bhagavantaṃ – ‘sakko, bhante, devānamindo sāmacco saparijano bhagavato pāde sirasā vandatī’ti’’. ‘‘Evaṃ bhaddantavā’’ti kho pañcasikho gandhabbadevaputto sakkassa devānamindassa paṭissutvā bhagavantaṃ abhivādeti – ‘‘sakko, bhante, devānamindo sāmacco saparijano bhagavato pāde sirasā vandatī’’ti. ‘‘Evaṃ sukhī hotu, pañcasikha, sakko devānamindo sāmacco saparijano; sukhakāmā hi devā manussā asurā nāgā gandhabbā ye caññe santi puthukāyā’’ti.",
      "english": "Then it occurred to Sakka, the deva-lord: \"Pañcasikha, the Gandhabba deva-son, is conversing with the Blessed One, and the Blessed One with Pañcasikha.\" Thereupon, Sakka, the deva-lord, addressed Pañcasikha, the Gandhabba deva-son: \"Please, dear Pañcasikha, pay homage to the Blessed One on my behalf, saying: 'Venerable sir, Sakka, the deva-lord, together with his ministers and retinue, bows his head at the Blessed One's feet.'\" \"As you wish, good sir,\" responded Pañcasikha, the Gandhabba deva-son, to Sakka, the deva-lord, and then he paid homage to the Blessed One, saying: \"Venerable sir, Sakka, the deva-lord, together with his ministers and retinue, bows his head at the Blessed One's feet.\" \"May Sakka, the deva-lord, together with his ministers and retinue, be happy, Pañcasikha; for devas, humans, asuras, nāgas, gandhabbas, and whatever other diverse beings there are, desire happiness.\"",
      "sinhala": "එවිට දෙවියන්ට අධිපති සක් දෙවිඳුට මේ අදහස ඇති විය: \"පංචසිඛ නම් ගන්ධබ්බ දේව පුත්‍රයා භාග්‍යවතුන් වහන්සේ සමඟ ප්‍රීති සංවාදයේ යෙදේ, භාග්‍යවතුන් වහන්සේද පංචසිඛ සමඟ ප්‍රීති සංවාදයේ යෙදේ.\" එවිට දෙවියන්ට අධිපති සක් දෙවිඳු පංචසිඛ ගන්ධබ්බ දේව පුත්‍රයාට මෙසේ ඇමතීය: \"දරුව, පංචසිඛ, ඔබ මා වෙනුවෙන් භාග්‍යවතුන් වහන්සේට මෙසේ වන්දනා කරන්න: 'ස්වාමීනි, අමාත්‍ය මණ්ඩලය සහ පිරිවර සමඟ දෙවියන්ට අධිපති සක් දෙවිඳු භාග්‍යවතුන් වහන්සේගේ පාදයන් සිරසින් වඳී.'\" \"යහපති ස්වාමීනි!\" යි පංචසිඛ ගන්ධබ්බ දේව පුත්‍රයා දෙවියන්ට අධිපති සක් දෙවිඳුට පිළිවදන් දී, භාග්‍යවතුන් වහන්සේට මෙසේ වන්දනා කළේය: \"ස්වාමීනි, අමාත්‍ය මණ්ඩලය සහ පිරිවර සමඟ දෙවියන්ට අධිපති සක් දෙවිඳු භාග්‍යවතුන් වහන්සේගේ පාදයන් සිරසින් වඳී.\" \"පංචසිඛය, අමාත්‍ය මණ්ඩලය සහ පිරිවර සමඟ දෙවියන්ට අධිපති සක් දෙවිඳු එසේ සැපවත් වේවා! මක්නිසාද යත් දෙවිවරු, මිනිසුන්, අසුරයන්, නාගයන්, ගන්ධබ්බයන් සහ යම් අන්‍ය විවිධ සත්වයෝ ඇත්ද, ඔවුහු සැප කැමති වෙති.\"",
      "paliTitle": "Sakkūpasaṅkama",
      "englishTitle": "Approaching Sakka",
      "sinhalaTitle": "සක්කුපසඞ්කමනය"
    },
    {
      "number": 351,
      "pali": "Evañca pana tathāgatā evarūpe mahesakkhe yakkhe abhivadanti. Abhivadito sakko devānamindo bhagavato indasālaguhaṃ pavisitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Devāpi tāvatiṃsā indasālaguhaṃ pavisitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Pañcasikhopi gandhabbadevaputto indasālaguhaṃ pavisitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Tena kho pana samayena indasālaguhā visamā santī samā samapādi, sambādhā santī urundā [uruddā (ka.)] samapādi, andhakāro guhāyaṃ antaradhāyi, āloko udapādi yathā taṃ devānaṃ devānubhāvena.",
      "english": "And indeed, this is how the Tathagatas greet such mighty yakkhas. Having been greeted, Sakka, the king of the gods, entered the Blessed One's Indasala Cave, paid homage to the Blessed One, and stood to one side. The Tāvatiṃsa gods also entered the Indasala Cave, paid homage to the Blessed One, and stood to one side. Pañcasikha, the gandhabba divine son, also entered the Indasala Cave, paid homage to the Blessed One, and stood to one side. Then, at that time, the Indasala Cave, though uneven, became even; though cramped, it became spacious; the darkness in the cave vanished, and light arose, just as it does through the divine power of the gods.",
      "sinhala": "තථාගතයන් වහන්සේලා මෙබඳු මහේශාක්‍ය යක්ෂයන් අමතති.\n\nඑලෙස අමතනු ලැබූ දෙවියන්ගේ අධිපති සක්‍ර දේවේන්ද්‍රයා භාග්‍යවතුන් වහන්සේ වැඩසිටි ඉන්දසාල ගුහාවට පිවිස භාග්‍යවතුන් වහන්සේට অভিবාදනය කොට එකත්පසෙකින් සිට ගත්තේය.\n\nතව්තිසා දෙවියෝ ද ඉන්දසාල ගුහාවට පිවිස භාග්‍යවතුන් වහන්සේට অভিবාදනය කොට එකත්පසෙකින් සිට ගත්හ.\n\nපඤ්චසික නම් ගාන්ධර්ව දිව්‍ය පුත්‍රයා ද ඉන්දසාල ගුහාවට පිවිස භාග්‍යවතුන් වහන්සේට অভিবාදනය කොට එකත්පසෙකින් සිට ගත්තේය.\n\nඑකල්හි ඉන්දසාල ගුහාවෙහි අසම වූ තැන් සම විය. පටු වූ තැන් පළල් විය. ගුහාවේ අන්ධකාරය පහව ගොස් දෙවියන්ගේ ආනුභාවයෙන් ආලෝකය පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 352,
      "pali": "Atha kho bhagavā sakkaṃ devānamindaṃ etadavoca – ‘‘acchariyamidaṃ āyasmato kosiyassa, abbhutamidaṃ āyasmato kosiyassa tāva bahukiccassa bahukaraṇīyassa yadidaṃ idhāgamana’’nti. ‘‘Cirapaṭikāhaṃ, bhante, bhagavantaṃ dassanāya upasaṅkamitukāmo; api ca devānaṃ tāvatiṃsānaṃ kehici kehici [kehici (syā.)] kiccakaraṇīyehi byāvaṭo; evāhaṃ nāsakkhiṃ bhagavantaṃ dassanāya upasaṅkamituṃ. Ekamidaṃ, bhante, samayaṃ bhagavā sāvatthiyaṃ viharati salaḷāgārake. Atha khvāhaṃ, bhante, sāvatthiṃ agamāsiṃ bhagavantaṃ dassanāya. Tena kho pana, bhante, samayena bhagavā aññatarena samādhinā nisinno hoti, bhūjati [bhuñjatī ca (sī. pī.), bhujagī (syā.)] ca nāma vessavaṇassa mahārājassa paricārikā bhagavantaṃ paccupaṭṭhitā hoti, pañjalikā namassamānā tiṭṭhati. Atha khvāhaṃ, bhante, bhūjatiṃ etadavocaṃ – ‘abhivādehi me tvaṃ, bhagini, bhagavantaṃ – ‘‘sakko, bhante, devānamindo sāmacco saparijano bhagavato pāde sirasā vandatī’’ti. Evaṃ vutte, bhante, sā bhūjati maṃ etadavoca – ‘akālo kho, mārisa, bhagavantaṃ dassanāya; paṭisallīno bhagavā’ti. ‘Tena hī, bhagini, yadā bhagavā tamhā samādhimhā vuṭṭhito hoti, atha mama vacanena bhagavantaṃ abhivādehi – ‘‘sakko, bhante, devānamindo sāmacco saparijano bhagavato pāde sirasā vandatī’’ti. Kacci me sā, bhante, bhaginī bhagavantaṃ abhivādesi? Sarati bhagavā tassā bhaginiyā vacana’’nti? ‘‘Abhivādesi maṃ sā, devānaminda, bhaginī, sarāmahaṃ tassā bhaginiyā vacanaṃ. Api cāhaṃ āyasmato nemisaddena [cakkanemisaddena (syā.)] tamhā samādhimhā vuṭṭhito’’ti. ‘‘Ye te, bhante, devā amhehi paṭhamataraṃ tāvatiṃsakāyaṃ upapannā, tesaṃ me sammukhā sutaṃ sammukhā paṭiggahitaṃ – ‘yadā tathāgatā loke uppajjanti arahanto sammāsambuddhā, dibbā kāyā paripūrenti, hāyanti asurakāyā’ti. Taṃ me idaṃ, bhante, sakkhidiṭṭhaṃ yato tathāgato loke uppanno arahaṃ sammāsambuddho, dibbā kāyā paripūrenti, hāyanti asurakāyāti.",
      "english": "Then the Blessed One said to Sakka, the king of the devas: \"It is astonishing, Venerable Kosiya, truly remarkable that you, Venerable Kosiya, so burdened with duties and responsibilities, have come here.\"\n\n\"For a long time, venerable sir, I have wished to visit the Blessed One. However, I have been preoccupied with various affairs of the Tāvatiṃsa devas and unable to do so. Once, venerable sir, the Blessed One was staying in Sāvatthī, at the Salaḷa mansion. I went to Sāvatthī, venerable sir, intending to see the Blessed One. At that time, venerable sir, the Blessed One was seated, absorbed in a certain meditation, and Bhūjati, a serving woman of King Vessavaṇa the Great, was in attendance, standing with hands clasped in reverence. Then, venerable sir, I said to Bhūjati, 'Sister, please convey my respects to the Blessed One: \"Sakka, king of the devas, together with his ministers and retinue, bows his head at the feet of the Blessed One.\"' When I said this, venerable sir, Bhūjati replied, 'Sir, this is not a suitable time to see the Blessed One; the Blessed One is in seclusion.' 'In that case, sister, when the Blessed One emerges from that meditation, please convey my respects with these words: \"Sakka, king of the devas, together with his ministers and retinue, bows his head at the feet of the Blessed One.\"' Venerable sir, did that sister convey my greetings to the Blessed One? Does the Blessed One recall her message?\"\n\n\"That sister did convey your greetings to me, King of the Devas, and I remember her message. Furthermore, I emerged from that meditation because of the sound of the wheel-rim of your chariot.\"\n\n\"Venerable sir, I have heard and directly received this teaching from those devas who were reborn into the Tāvatiṃsa realm before us: 'When Tathāgatas, Arahants, Perfectly Enlightened Ones, arise in the world, the ranks of the devas are filled, and the ranks of the asuras decline.' And now, venerable sir, I have witnessed this myself: since the Tathāgata, the Arahant, the Perfectly Enlightened One, has arisen in the world, the ranks of the devas are filled, and the ranks of the asuras decline.\"",
      "sinhala": "එවිට භාග්‍යවත් බුදුරජාණන් වහන්සේ දෙවියන්ගේ අධිපති ශක්‍රයාට මෙසේ වදාළහ: “ආයුෂ්මත් කෝසියගේ පැමිණීම පුදුම සහගතය. ආයුෂ්මත් කෝසියගේ පැමිණීම අද්භූතය. මක්නිසාද යත්, බොහෝ කටයුතු සහ බොහෝ කළ යුතු දේ ඇති ඔබ මෙහි පැමිණීමයි.”\n\n“භාග්‍යවතුන් වහන්ස, මම බොහෝ කලක සිට භාග්‍යවතුන් වහන්සේ දැක බලා ගැනීමට කැමැත්තෙන් සිටියෙමි. එහෙත් තව්තිසා දෙවියන්ගේ නොයෙකුත් කටයුතුවල නිරතව සිටි නිසා, භාග්‍යවතුන් වහන්සේ දැකීමට පැමිණීමට මට නොහැකි විය.\n\nභාග්‍යවතුන් වහන්ස, එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර සළළාගාරයේ වැඩ වාසය කළහ. එවිට මම භාග්‍යවතුන් වහන්සේ දැකීම සඳහා සැවැත් නුවරට ගියෙමි. භාග්‍යවතුන් වහන්ස, ඒ සමයෙහි භාග්‍යවතුන් වහන්සේ කිසියම් සමාධියකට සමවැදී වැඩ සිටියහ. වෛශ්‍රවණ මහරජුගේ භූජතී නම් උපස්ථායිකාව භාග්‍යවතුන් වහන්සේට උපස්ථාන කරමින්, දෑත් එකට තබා නමස්කාර කරමින් සිටියාය.\n\nඑවිට මම භූජතීට මෙසේ කීවෙමි: ‘නංගියේ, ඔබ මා වෙනුවෙන් භාග්‍යවතුන් වහන්සේට ආචාර කර මෙසේ කියන්න. “භාග්‍යවතුන් වහන්ස, දෙවියන්ගේ අධිපති ශක්‍රයා, ඇමතිවරුන් සහ පිරිවර සමඟ භාග්‍යවතුන් වහන්සේගේ පාදයන් හිසින් වඳියි” කියායි.’ භාග්‍යවතුන් වහන්ස, මෙසේ කී විට, භූජතී මට මෙසේ කීවාය: ‘පින්වත, භාග්‍යවතුන් වහන්සේ දැකීමට මෙය සුදුසු වේලාවක් නොවේ. භාග්‍යවතුන් වහන්සේ සමාධියෙන් වැඩ සිටින සේකැ’යි කීවාය.\n\n‘එසේ නම්, නංගියේ, භාග්‍යවතුන් වහන්සේ ඒ සමාධියෙන් නැගිට්ට පසු, මාගේ වචනයෙන් භාග්‍යවතුන් වහන්සේට ආචාර කර මෙසේ කියන්න. “භාග්‍යවතුන් වහන්ස, දෙවියන්ගේ අධිපති ශක්‍රයා, ඇමතිවරුන් සහ පිරිවර සමඟ භාග්‍යවතුන් වහන්සේගේ පාදයන් හිසින් වඳියි” කියායි.’ භාග්‍යවතුන් වහන්ස, ඒ නංගිය මා වෙනුවෙන් භාග්‍යවතුන් වහන්සේට ආචාර කළාද? භාග්‍යවතුන් වහන්සේ ඇයගේ වචනය සිහිපත් කරන සේක්ද?”\n\n“දෙවියන්ගේ අධිපතීනි, ඒ නංගිය මට ආචාර කළාය. මම ඇයගේ වචනය සිහිපත් කරමි. එපමණක් නොව, මම ආයුෂ්මතුන්ගේ රථයේ හඬ ඇසීමෙන් ඒ සමාධියෙන් නැගිට්ටෙමි.”\n\n“භාග්‍යවතුන් වහන්ස, අපට පළමුව තව්තිසා භවයට පැමිණි දෙවියන්ගෙන් මම අසා ඇත්තෙමි, ඔවුන් ඉදිරියේ මම පිළිගෙන ඇත්තෙමි. එනම් ‘ලෝකයේ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේලා පහළ වන විට, දිව්‍ය ශරීර පිරී යයි, අසුර ශරීර අඩු වේ’ කියායි. භාග්‍යවතුන් වහන්ස, තථාගතයන් වහන්සේ ලොව පහළ වූ දා පටන් දිව්‍ය ශරීර පිරී යන බවත්, අසුර ශරීර අඩු වන බවත් මා විසින් සත්‍ය වශයෙන්ම දැක ඇත.”",
      "paliTitle": ""
    },
    {
      "number": 353,
      "pali": "‘‘Idheva, bhante, kapilavatthusmiṃ gopikā nāma sakyadhītā ahosi buddhe pasannā dhamme pasannā saṅghe pasannā sīlesu paripūrakārinī. Sā itthittaṃ [itthicittaṃ (syā.)] virājetvā purisattaṃ [purisacittaṃ (syā.)] bhāvetvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā. Devānaṃ tāvatiṃsānaṃ sahabyataṃ amhākaṃ puttattaṃ ajjhupagatā. Tatrapi naṃ evaṃ jānanti – ‘gopako devaputto, gopako devaputto’ti. Aññepi, bhante, tayo bhikkhū bhagavati brahmacariyaṃ caritvā hīnaṃ gandhabbakāyaṃ upapannā. Te pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārayamānā amhākaṃ upaṭṭhānaṃ āgacchanti amhākaṃ pāricariyaṃ. Te amhākaṃ upaṭṭhānaṃ āgate amhākaṃ pāricariyaṃ gopako devaputto paṭicodesi – ‘kutomukhā nāma tumhe, mārisā, tassa bhagavato dhammaṃ assuttha [āyuhittha (syā.)] – ahañhi nāma itthikā samānā buddhe pasannā dhamme pasannā saṅghe pasannā sīlesu paripūrakārinī itthittaṃ virājetvā purisattaṃ bhāvetvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā, devānaṃ tāvatiṃsānaṃ sahabyataṃ sakkassa devānamindassa puttattaṃ ajjhupagatā. Idhāpi maṃ evaṃ jānanti ‘‘gopako devaputto gopako devaputto’ti. Tumhe pana, mārisā, bhagavati brahmacariyaṃ caritvā hīnaṃ gandhabbakāyaṃ upapannā. Duddiṭṭharūpaṃ vata, bho, addasāma, ye mayaṃ addasāma sahadhammike hīnaṃ gandhabbakāyaṃ upapanne’ti. Tesaṃ, bhante, gopakena devaputtena paṭicoditānaṃ dve devā diṭṭheva dhamme satiṃ paṭilabhiṃsu kāyaṃ brahmapurohitaṃ, eko pana devo kāme ajjhāvasi. ",
      "english": "Here, venerable sir, in Kapilavatthu, there was a Sakyan woman named Gopikā. She had faith in the Buddha, faith in the Dhamma, faith in the Saṅgha, and perfectly fulfilled the precepts. Having eradicated her female tendencies and cultivated male qualities, upon the dissolution of her body and after death, she was reborn in a good destination, in the heavenly world. She attained companionship with the Tāvatiṃsa devas, becoming one of their sons. There, they know him as 'Gopaka, the deva-son; Gopaka, the deva-son.'\n\nFurthermore, venerable sir, three other monks, having practiced the holy life under the Blessed One, were reborn into a lower order of devas, the Gandhabba-devas. Endowed and fully provided with the five strands of sensual pleasure, they attend upon us, serving us. When they come to attend upon us and serve us, Gopaka, the deva-son, admonished them, saying: 'From where, sirs, did you learn the Dhamma of that Blessed One? I, who was a woman, having faith in the Buddha, faith in the Dhamma, faith in the Saṅgha, and perfectly fulfilling the precepts, eradicated my female tendencies and cultivated male qualities, and upon the dissolution of my body and after death, was reborn in a good destination, in the heavenly world. I attained companionship with the Tāvatiṃsa devas, becoming a son of Sakka, king of the devas. Even here, they know me as \"Gopaka, the deva-son; Gopaka, the deva-son.\" But you, sirs, having practiced the holy life under the Blessed One, were reborn into a lower order of Gandhabba-devas. Indeed, what a wretched sight it is to see fellow practitioners reborn into a lower order of Gandhabba-devas!'\n\nVenerable sir, of those thus admonished by Gopaka, the deva-son, two devas regained mindfulness right here in this very life, aspiring to the state of Brahmapurohita. But one deva remained attached to sensual pleasures.",
      "sinhala": "භාග්‍යවතුන් වහන්ස, කපිලවස්තුවෙහි ගෝපිකා නම් ශාක්‍ය දියණියක් විසුවාය. ඇය බුදුන් කෙරෙහි පැහැදී, දහම් කෙරෙහි පැහැදී, සඟුන් කෙරෙහි පැහැදී, සිල්වත් වූවාය. ඇය ස්ත්‍රී භාවය දුරු කොට පුරුෂ භාවය වර්ධනය කර, කය බිඳී මරණින් මතු සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපත ලැබුවාය. ඇය තව්තිසා දෙවියන් හා එක්ව, අපගේ පුත්‍රත්වය ලබා, එහිදීද ‘ගෝපක දෙව්පුත්, ගෝපක දෙව්පුත්’ යනුවෙන් ප්‍රසිද්ධ වූවාය.\n\nභාග්‍යවතුන් වහන්ස, තවත් භික්ෂූන් තිදෙනෙක් භාග්‍යවතුන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාවෙහි හැසිරී, පහත් ගාන්ධර්ව ආත්මයක උපත ලැබූහ. ඔවුහු පංචකාම සම්පතින් පිරිපුන්ව, සතුටින් කාලය ගත කරමින් අපගේ සේවයට, අපගේ උපස්ථානයට පැමිණෙති.\n\nඑසේ අපගේ සේවයට පැමිණි ඔවුන්ට ගෝපක දෙව්පුත් මෙසේ චෝදනා කළේය: ‘මිත්‍රවරුනි, ඔබලා ඒ භාග්‍යවතුන් වහන්සේගේ ධර්මය ඇසුවේ කෙසේද? මම ස්ත්‍රියකව සිටියදී බුදුන් කෙරෙහි පැහැදී, දහම් කෙරෙහි පැහැදී, සඟුන් කෙරෙහි පැහැදී, සිල්වත් වීමි. ස්ත්‍රී භාවය දුරු කොට පුරුෂ භාවය වර්ධනය කර, කය බිඳී මරණින් මතු සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපත ලැබුවෙමි. තව්තිසා දෙවියන් හා එක්ව, දෙවියන්ට අධිපති සක්දෙවිඳුගේ පුත්‍රත්වය ලබා, මෙහිදීද මාව ‘ගෝපක දෙව්පුත්, ගෝපක දෙව්පුත්’ යනුවෙන් හඳුන්වයි. එහෙත් ඔබලා භාග්‍යවතුන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාවෙහි හැසිරී, පහත් ගාන්ධර්ව ආත්මයක උපත ලැබුවාහුය. සහෝදරවරුනි, පහත් ගාන්ධර්ව ආත්මයක උපන් ඔබ දැකීම දුක්ඛදායකය!’\n\nභාග්‍යවතුන් වහන්ස, ගෝපක දෙව්පුත්ගේ චෝදනාවෙන් පසු ඒ දෙවිවරුන් දෙදෙනාට මේ ජීවිතයේදීම බ්‍රහ්මපුරෝහිත තලයට සිහිය පිහිටුවා ගැනීමට හැකි විය. එක් දෙවියෙක් කාමයන් කෙරෙහිම ඇලී ගැලී වාසය කළේය.\n\n",
      "paliTitle": "Gopakavatthu",
      "englishTitle": "Gopaka's Story",
      "sinhalaTitle": "ගෝපක වත්ථුව"
    },
    {
      "number": 354,
      "pali": "‘‘‘Upāsikā cakkhumato ahosiṃ, Nāmampi mayhaṃ ahu ‘gopikā’ti; Buddhe ca dhamme ca abhippasannā, Saṅghañcupaṭṭhāsiṃ pasannacittā. ‘‘‘Tasseva buddhassa sudhammatāya, Sakkassa puttomhi mahānubhāvo; Mahājutīko tidivūpapanno, Jānanti maṃ idhāpi ‘gopako’ti. ‘‘‘Athaddasaṃ bhikkhavo diṭṭhapubbe, Gandhabbakāyūpagate vasīne; Imehi te gotamasāvakāse, Ye ca mayaṃ pubbe manussabhūtā. ‘‘‘Annena pānena upaṭṭhahimhā, Pādūpasaṅgayha sake nivesane; Kutomukhā nāma ime bhavanto, Buddhassa dhammāni paṭiggahesuṃ [buddhassa dhammaṃ na paṭiggahesuṃ (syā.)]. ‘‘‘Paccattaṃ veditabbo hi dhammo, Sudesito cakkhumatānubuddho; Ahañhi tumheva upāsamāno, Sutvāna ariyāna subhāsitāni. ‘‘‘Sakkassa puttomhi mahānubhāvo, Mahājutīko tidivūpapanno; Tumhe pana seṭṭhamupāsamānā, Anuttaraṃ brahmacariyaṃ caritvā. ‘‘‘Hīnaṃ kāyaṃ upapannā bhavanto, Anānulomā bhavatūpapatti; Duddiṭṭharūpaṃ vata addasāma, Sahadhammike hīnakāyūpapanne. ‘‘‘Gandhabbakāyūpagatā bhavanto, Devānamāgacchatha pāricariyaṃ; Agāre vasato mayhaṃ, Imaṃ passa visesataṃ. ‘‘‘Itthī hutvā svajja pumomhi devo, Dibbehi kāmehi samaṅgibhūto’; Te coditā gotamasāvakena, Saṃvegamāpādu samecca gopakaṃ. ‘‘‘Handa viyāyāma [vigāyāma (syā.), vitāyāma (pī.)] byāyāma [viyāyamāma (sī. pī.)], Mā no mayaṃ parapessā ahumhā’; Tesaṃ duve vīriyamārabhiṃsu, Anussaraṃ gotamasāsanāni. ‘‘Idheva cittāni virājayitvā, Kāmesu ādīnavamaddasaṃsu; Te kāmasaṃyojanabandhanāni, Pāpimayogāni duraccayāni. ‘‘Nāgova sannāni guṇāni [sandānaguṇāni (sī. pī.), santāni guṇāni (syā.)] chetvā, Deve tāvatiṃse atikkamiṃsu; Saindā devā sapajāpatikā, Sabbe sudhammāya sabhāyupaviṭṭhā. ‘‘Tesaṃ nisinnānaṃ abhikkamiṃsu, Vīrā virāgā virajaṃ karontā; Te disvā saṃvegamakāsi vāsavo, Devābhibhū devagaṇassa majjhe. ‘‘‘Imehi te hīnakāyūpapannā, Deve tāvatiṃse abhikkamanti’; Saṃvegajātassa vaco nisamma, So gopako vāsavamajjhabhāsi. ‘‘‘Buddho janindatthi manussaloke, Kāmābhibhū sakyamunīti ñāyati; Tasseva te puttā satiyā vihīnā, Coditā mayā te satimajjhalatthuṃ. ‘‘‘Tiṇṇaṃ tesaṃ āvasinettha [avasīnettha (pī.)] eko, Gandhabbakāyūpagato vasīno; Dve ca sambodhipathānusārino, Devepi hīḷenti samāhitattā. ‘‘‘Etādisī dhammappakāsanettha, Na tattha kiṃkaṅkhati koci sāvako; Nitiṇṇaoghaṃ vicikicchachinnaṃ, Buddhaṃ namassāma jinaṃ janindaṃ’. ‘‘Yaṃ te dhammaṃ idhaññāya, Visesaṃ ajjhagaṃsu [ajjhagamaṃsu (syā.)] te; Kāyaṃ brahmapurohitaṃ, Duve tesaṃ visesagū. ‘‘Tassa dhammassa pattiyā, Āgatamhāsi mārisa; Katāvakāsā bhagavatā, Pañhaṃ pucchemu mārisā’’ti.",
      "english": "'I was a female lay follower of the Buddha, and my name was Gopikā. Firmly devoted to the Buddha and the Dhamma, I attended upon the Saṅgha with a serene mind. Through the excellence of that Buddha's Dhamma, I am now a powerful son of Sakka, resplendent, reborn in the heavens; they know me here as \"Gopaka.\" Then I saw monks whom I had known before, ascetics reborn in the Gandhabba-deva realm. These are those disciples of Gotama, who, like us, were formerly human beings. We attended upon them with food and drink, reverently approaching their feet in our own homes. From what source did you, sirs, receive the Buddha's teachings?'\n\n'For the Dhamma is to be realized individually, well-taught and fully understood by the Buddha. While I was attending upon you, I heard the well-spoken words of the noble ones. I am a powerful son of Sakka, resplendent, reborn in the heavens. But you, though having attended upon the Supreme One, and having practiced the unsurpassed holy life, were reborn into a lower realm. How incongruous is such a rebirth! Indeed, what a wretched sight it is to see fellow practitioners reborn into a lower realm! Having been reborn in the Gandhabba-deva realm, you come to perform service for the devas. Look at the difference between us, considering that I dwelt as a householder. Having been a woman, today I am a male deva, endowed with divine sensual pleasures.' Thus admonished by the disciple of Gotama, they felt a sense of urgency upon meeting Gopaka.\n\n'Come now, let us strive and exert ourselves, lest we become servants to others!' Two of them then aroused energy, recalling the teachings of Gotama. Right there, they became dispassionate in their minds and perceived the danger in sensual pleasures. They cut off the bonds of sensual attachment, the ties to evil, which are difficult to overcome. Like an elephant breaking free from its bonds, they surpassed the Tāvatiṃsa devas. All the devas, with Sakka and his consort, were seated in the Sudhammā assembly hall. As they were seated, those heroes, freed from passion and purified, appeared. Seeing them, Sakka, the lord of devas, became deeply stirred in the midst of the assembly of devas.\n\n'These are those who were reborn in a lower realm, yet they surpass the Tāvatiṃsa devas!' Hearing the words of Sakka, who was thus stirred, Gopaka then spoke in the midst of the devas.\n\n'There is a Buddha, lord of men, in the human world; he is known as the Sakyan Sage, who has overcome sensual pleasures. Those sons of his, lacking mindfulness, regained it when admonished by me. Of those three ascetics, one remained in the Gandhabba-deva realm. But two, following the path to enlightenment, with their minds composed, even scorn the devas. Such is the proclamation of the Dhamma, concerning which no disciple has any doubt. We pay homage to the Buddha, the Conqueror, the Lord of humankind, who has crossed over the flood and cut off all doubt.'\n\nHaving understood that Dhamma here, they attained distinction. Two of them, experts in distinction, attained the state of Brahmapurohita. For the attainment of that Dhamma, we have come, sirs. Having been granted an opportunity by the Blessed One, we shall now ask questions, sirs.",
      "sinhala": "‘මම චක්ඛුමා බුදුරජාණන් වහන්සේගේ උපාසිකාවක් වීමි. මාගේ නම ගෝපිකා විය. බුදුන් කෙරෙහිද, දහම් කෙරෙහිද ඉමහත් සේ පැහැදුණෙමි. සතුටු සිතින් සංඝයාට උපස්ථාන කළෙමි.\n\nඒ බුදුරදුන්ගේ ශ්‍රේෂ්ඨ ධර්මය හේතුවෙන් මම සක්දෙවිඳුන්ගේ මහත් බල ඇති පුත්‍රයෙක් වීමි. මහත් තේජසින් බැබළෙමින් දෙව්ලොව උපත ලැබුවෙමි. මෙහිදීද මාව ‘ගෝපක’ යනුවෙන් හඳුනති.\n\nඑවිට මම පෙර දුටු භික්ෂූන් දුටුවෙමි. ඔවුන් ගාන්ධර්ව ආත්මයක ඉපදී සිටිනු දුටුවෙමි. අපි මීට පෙර මිනිසුන්ව සිටියදී, ඔබ ගෞතම බුදුන්ගේ ශ්‍රාවකයෝ වූහ.\n\nඅපි ඔවුන්ට ආහාර පානවලින් සංග්‍රහ කළෙමු. අපගේ නිවෙස්වලදී ඔවුන්ගේ පාද වන්දනා කරමින් ඇප උපස්ථාන කළෙමු. එසේ නම් ඔබ බුදුන්ගේ ධර්මය ඉගෙන ගත්තේ කෙසේද?\n\nධර්මය නම් තමා විසින්ම අවබෝධ කරගත යුත්තකි. එය චක්ඛුමා බුදුරජාණන් වහන්සේ විසින් මනාව දේශනා කරන ලද්දකි. මම ඔබලාට උපස්ථාන කරමින් ආර්යයන්ගේ සුභාෂිතයන් අසා මේ තත්වයට පත් වීමි.\n\nමම සක්දෙවිඳුන්ගේ මහත් අනුභාව ඇති පුත්‍රයෙක් වෙමි. මහත් තේජසින් බැබළෙමින් දෙව්ලොව උපත ලැබුවෙමි. ඔබලා ශ්‍රේෂ්ඨ බුදුරජාණන් වහන්සේට උපස්ථාන කරමින්, අනුත්තර බ්‍රහ්මචර්යාවෙහි හැසිරී.\n\nඑහෙත් ඔබලා පහත් ආත්මයක උපත ලැබුවාහුය. ඔබලාගේ ඉපදීම යහපත් නැත. පහත් ආත්මයක උපන් සහෝදරයන් දැකීම ශෝකජනකය.\n\nඔබලා ගාන්ධර්ව ආත්මයකට පැමිණ, දෙවියන්ට සේවය කිරීමට පැමිණෙයි. ගිහි ජීවිතයක් ගත කළ මාගේ මේ උසස් බව බලන්න!\n\nස්ත්‍රියක්ව සිටි මම අද පුරුෂ දෙවියෙක් වී දිව්‍ය සැප සම්පත් විඳිමි.’ ගෝපක දෙව්පුත්ගේ මෙම වදන් ඇසූ ඔවුහු, ගෝපක හමුවීමෙන් පසු සංවේගයට පත් වූහ.\n\n‘අපි වීර්යය කරමු! තවත් අයෙකුගේ අණසකට යටත් නොවෙමු!’ ඔවුන්ගෙන් දෙදෙනෙක් ගෞතම බුදුන්ගේ අවවාද සිහි කරමින් වීර්යය වඩන්නට වූහ.\n\nඔවුන් මේ ජීවිතයේදීම සිතේ ඇති රාගාදී කෙලෙස් දුරු කොට, කාමයන්ගේ ආදීනව දුටුවාහුය. කාම සංයෝජන හා පාපී බන්ධනයන් සිඳ බිඳ දැමූහ.\n\nඅලියෙකු ලණු කඩා දමන්නා සේ, ඔවුහු තව්තිසා දෙවියන්ගේ ලෝකය ඉක්මවා ගියහ. ඉන්ද්‍ර දෙවියන් ඇතුළු සියලු දෙවියෝ සුධර්මා සභාවේ රැස්ව සිටියහ.\n\nඑය දුටු, දෙවි සමූහයා මැද සිටි දෙවියන්ට අධිපති වූ සක්දෙවිඳු සංවේගයට පත් වූහ.\n\n‘පහත් ආත්මයක ඉපදුන මොවුන් තව්තිසා දෙවියන් පවා ඉක්මවා යයි.’ සක්දෙවිඳුන්ගේ වදනට පිළිතුරු දුන් ගෝපක මෙසේ කීවේය.\n\n‘මනුලොව ජනයාට අධිපති බුදුරජාණන් වහන්සේ වැඩ වසති. උන්වහන්සේ කාමයන් ජයගත් ශාක්‍යමුණි නමින් ප්‍රකටය. උන්වහන්සේගේම පුත්‍රයන් වූ මොවුන් සිහියෙන් තොරව සිටියදී මාගේ වදන් ඇසී සිහිය ලබා ගත්හ.\n\nඔවුන් තිදෙනාගෙන් එක් අයෙක් තවමත් ගාන්ධර්ව ආත්මයක වාසය කරයි. අනෙක් දෙදෙනා බෝධි මාර්ගයට අනුව යමින් සමාධිගත සිතින් දෙවියන් පවා පිළිකුල් කරති.\n\nමෙහි මෙවැනි ධර්ම ප්‍රකාශනයක් ඇත. එහි කිසිදු ශ්‍රාවකයෙක් සැක නොකරයි. සියලු බාධක ජයගත්, විචිකිච්ඡාව දුරු කළ ජිනේන්ද්‍ර බුදුරජාණන් වහන්සේට අපි නමස්කාර කරමු.’\n\nයම් ධර්මයක් මෙහි අවබෝධ කරගැනීමෙන් ඔවුහු විශේෂත්වයක් ලැබුවාහුද, ඒ දෙදෙනා බ්‍රහ්මපුරෝහිත තලයට පත් වූ උසස් තත්ත්වයට පත් වූවෝ වූහ.\n\nමිත්‍රය, ඒ ධර්මය පිළිබඳ දැනුම ලබාගැනීමට අපි මෙහි පැමිණියෙමු. භාග්‍යවතුන් වහන්සේ අවසර ලබා දෙන්නේ නම් අපි ප්‍රශ්නයක් විමසන්නෙමු."
    },
    {
      "number": 355,
      "pali": "Atha kho bhagavato etadahosi – ‘‘dīgharattaṃ visuddho kho ayaṃ yakkho [sakko (sī. syā. pī.)], yaṃ kiñci maṃ pañhaṃ pucchissati, sabbaṃ taṃ atthasañhitaṃyeva pucchissati, no anatthasañhitaṃ. Yañcassāhaṃ puṭṭho byākarissāmi, taṃ khippameva ājānissatī’’ti.",
      "english": "Then this thought occurred to the Blessed One: \"This yakkhā has truly been pure for a long time. Whatever question he will ask me, all of it will be solely beneficial, not unbeneficial. And what I explain to him when asked, he will understand very quickly.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේට මෙසේ සිතක් පහළ විය: \"මේ යක්ෂයා බොහෝ කලක් තිස්සේ පිරිසිදු වී සිටින්නෙකි. ඔහු මාගෙන් කුමන ප්‍රශ්නයක් ඇසුවත්, එය සැමවිටම අර්ථවත් ප්‍රශ්නයක්ම වනු ඇත. අනර්ථවත් ප්‍රශ්නයක් අසන්නේ නැත. මා විසින් පිළිතුරු දුන් විට, ඔහු එය ක්ෂණිකවම අවබෝධ කරගනු ඇත.\"",
      "paliTitle": ""
    },
    {
      "number": 356,
      "pali": "Atha kho bhagavā sakkaṃ devānamindaṃ gāthāya ajjhabhāsi – ‘‘Puccha vāsava maṃ pañhaṃ, yaṃ kiñci manasicchasi; Tassa tasseva pañhassa, ahaṃ antaṃ karomi te’’ti. Paṭhamabhāṇavāro niṭṭhito.",
      "english": "Then the Blessed One addressed Sakka, the deva-lord, in verse: \"Ask me, Vasava, any question you desire; I will bring each and every one of your questions to resolution.\" The first recitation section is complete.",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ, සක්‍ර දේවේන්ද්‍රයා හට ගාථාවකින් මෙසේ අමතා වදාළ සේක: \"වාසව, ඔබගේ සිතට රිසි යම් ප්‍රශ්නයක් වේ නම් එය මාගෙන් විමසන්න. ඒ ඒ ප්‍රශ්නයට මම ඔබට පිළිතුරු දෙන්නෙමි.\"\nපළමු භාණවාරය නිම විය.",
      "paliTitle": ""
    },
    {
      "number": 357,
      "pali": "Katāvakāso sakko devānamindo bhagavatā imaṃ bhagavantaṃ [devānamindo bhagavantaṃ imaṃ (sī. pī.)] paṭhamaṃ pañhaṃ apucchi – ‘‘Kiṃ saṃyojanā nu kho, mārisa, devā manussā asurā nāgā gandhabbā ye caññe santi puthukāyā, te – ‘averā adaṇḍā asapattā abyāpajjā viharemu averino’ti iti ca nesaṃ hoti, atha ca pana saverā sadaṇḍā sasapattā sabyāpajjā viharanti saverino’’ti? Itthaṃ sakko devānamindo bhagavantaṃ pañhaṃ [imaṃ paṭhamaṃ pañhaṃ (sī. pī.)] apucchi. Tassa bhagavā pañhaṃ puṭṭho byākāsi – ‘‘Issāmacchariyasaṃyojanā kho, devānaminda, devā manussā asurā nāgā gandhabbā ye caññe santi puthukāyā, te – ‘averā adaṇḍā asapattā abyāpajjā viharemu averino’ti iti ca nesaṃ hoti, atha ca pana saverā sadaṇḍā sasapattā sabyāpajjā viharanti saverino’’ti. Itthaṃ bhagavā sakkassa devānamindassa pañhaṃ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṃ abhinandi anumodi – ‘‘evametaṃ, bhagavā, evametaṃ, sugata. Tiṇṇā mettha kaṅkhā vigatā kathaṃkathā bhagavato pañhaveyyākaraṇaṃ sutvā’’ti.",
      "english": "Having been given leave, Sakka, the lord of devas, asked the Blessed One this first question: \"Venerable sir, by what fetter are devas, humans, asuras, nagas, gandhabbas, and other beings of diverse forms bound, that although they wish, 'May we live without enmity, without violence, without adversaries, without affliction, free from animosity,' they nevertheless live with enmity, with violence, with adversaries, with affliction, and full of animosity?\" Thus, Sakka, the lord of devas, posed the question to the Blessed One.\n\nThe Blessed One, questioned in this way, replied: \"It is by the fetter of jealousy and stinginess, O lord of devas, that devas, humans, asuras, nagas, gandhabbas, and other beings of diverse forms are bound, so that although they wish, 'May we live without enmity, without violence, without adversaries, without affliction, free from animosity,' they nevertheless live with enmity, with violence, with adversaries, with affliction, and full of animosity.\" Thus, the Blessed One answered the question posed by Sakka, the lord of devas.\n\nDelighted, Sakka, the lord of devas, approved and rejoiced in the Blessed One's words, saying: \"So it is, Blessed One! So it is, Fortunate One! My doubt is dispelled, my perplexity is resolved, having heard the Blessed One's explanation to the question.\"",
      "sinhala": "අවසර ලැබූ ශක්‍ර දේවේන්ද්‍රයා භාග්‍යවතුන් වහන්සේගෙන් මෙම පළමු ප්‍රශ්නය විමසීය: \"පින්වත් මාරිස, දෙවියන්, මිනිසුන්, අසුරයන්, නාගයන්, ගන්ධර්වයන් ඇතුළු අනෙකුත් විවිධ කායයන්ගෙන් යුත් සත්වයන් 'අපි වෛර නැත්තෝ වෙමු. දඬුවම් නැත්තෝ වෙමු. සතුරුකම් නැත්තෝ වෙමු. හිංසා නැත්තෝ වෙමු. වෛර රහිතව වාසය කරමු' යැයි සිතුවත්, වෛර සහිතව, දඬු සහිතව, සතුරුකම් සහිතව, හිංසා කරමින් වෛර සහිතව වාසය කරන්නේ කුමන සංයෝජන නිසාද?\" මෙසේ ශක්‍ර දේවේන්ද්‍රයා භාග්‍යවතුන් වහන්සේගෙන් එම ප්‍රශ්නය ඇසීය.\n\nඑයට පිළිතුරු දුන් භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: \"දේවේන්ද්‍රය, ඊර්ෂ්‍යාව හා මසුරුකම යන සංයෝජන නිසා දෙවියන්, මිනිසුන්, අසුරයන්, නාගයන්, ගන්ධර්වයන් ඇතුළු අනෙකුත් විවිධ කායයන්ගෙන් යුත් සත්වයන් 'අපි වෛර නැත්තෝ වෙමු. දඬුවම් නැත්තෝ වෙමු. සතුරුකම් නැත්තෝ වෙමු. හිංසා නැත්තෝ වෙමු. වෛර රහිතව වාසය කරමු' යැයි සිතුවත්, වෛර සහිතව, දඬු සහිතව, සතුරුකම් සහිතව, හිංසා කරමින් වෛර සහිතව වාසය කරති.\" භාග්‍යවතුන් වහන්සේ ශක්‍ර දේවේන්ද්‍රයාගේ ප්‍රශ්නයට මෙලෙස පිළිතුරු දුන් සේක.\n\nප්‍රීතිමත් සිතින් යුතුව ශක්‍ර දේවේන්ද්‍රයා භාග්‍යවතුන් වහන්සේගේ වචන අනුමත කරමින් මෙසේ පැවසීය: \"භාග්‍යවතුන් වහන්ස, එය එසේමය. සුගතයන් වහන්ස, එය එසේමය. භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්න විසඳීම අසා මගේ සැකය දුරු වී අවිනිශ්චිතභාවය පහව ගියේය.\"",
      "paliTitle": ""
    },
    {
      "number": 358,
      "pali": "Itiha sakko devānamindo bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttariṃ [uttariṃ (sī. syā. pī.)] pañhaṃ apucchi – ‘‘Issāmacchariyaṃ pana, mārisa, kiṃnidānaṃ kiṃsamudayaṃ kiṃjātikaṃ kiṃpabhavaṃ; kismiṃ sati issāmacchariyaṃ hoti; kismiṃ asati issāmacchariyaṃ na hotī’’ti? ‘‘Issāmacchariyaṃ kho, devānaminda, piyāppiyanidānaṃ piyāppiyasamudayaṃ piyāppiyajātikaṃ piyāppiyapabhavaṃ; piyāppiye sati issāmacchariyaṃ hoti, piyāppiye asati issāmacchariyaṃ na hotī’’ti. ‘‘Piyāppiyaṃ kho pana, mārisa, kiṃnidānaṃ kiṃsamudayaṃ kiṃjātikaṃ kiṃpabhavaṃ; kismiṃ sati piyāppiyaṃ hoti; kismiṃ asati piyāppiyaṃ na hotī’’ti? ‘‘Piyāppiyaṃ kho, devānaminda, chandanidānaṃ chandasamudayaṃ chandajātikaṃ chandapabhavaṃ; chande sati piyāppiyaṃ hoti; chande asati piyāppiyaṃ na hotī’’ti. ‘‘Chando kho pana, mārisa, kiṃnidāno kiṃsamudayo kiṃjātiko kiṃpabhavo; kismiṃ sati chando hoti; kismiṃ asati chando na hotī’’ti? ‘‘Chando kho, devānaminda, vitakkanidāno vitakkasamudayo vitakkajātiko vitakkapabhavo; vitakke sati chando hoti; vitakke asati chando na hotī’’ti. ‘‘Vitakko kho pana, mārisa, kiṃnidāno kiṃsamudayo kiṃjātiko kiṃpabhavo; kismiṃ sati vitakko hoti; kismiṃ asati vitakko na hotī’’ti? ‘‘Vitakko kho, devānaminda, papañcasaññāsaṅkhānidāno papañcasaññāsaṅkhāsamudayo papañcasaññāsaṅkhājātiko papañcasaññāsaṅkhāpabhavo; papañcasaññāsaṅkhāya sati vitakko hoti; papañcasaññāsaṅkhāya asati vitakko na hotī’’ti. ‘‘Kathaṃ paṭipanno pana, mārisa, bhikkhu papañcasaññāsaṅkhānirodhasāruppagāminiṃ paṭipadaṃ paṭipanno hotī’’ti? ",
      "english": "Then Sakka, lord of devas, pleased and delighted by the Blessed One's words, asked him a further question: \"Venerable sir, what is the origin, source, birth, and cause of envy and stinginess? Under what conditions are envy and stinginess present? Under what conditions are they absent?\"\n\n\"Envy and stinginess, lord of devas, originate, arise, are born from, and are caused by what is liked and disliked. When there is what is liked and disliked, envy and stinginess are present; when there is no what is liked and disliked, envy and stinginess are not present.\"\n\n\"But venerable sir, what is the origin, source, birth, and cause of what is liked and disliked? Under what conditions is what is liked and disliked present? Under what conditions is it absent?\"\n\n\"What is liked and disliked, lord of devas, originates, arises, is born from, and is caused by desire. When there is desire, what is liked and disliked is present; when there is no desire, what is liked and disliked is not present.\"\n\n\"But venerable sir, what is the origin, source, birth, and cause of desire? Under what conditions is desire present? Under what conditions is it absent?\"\n\n\"Desire, lord of devas, originates, arises, is born from, and is caused by thinking. When there is thinking, desire is present; when there is no thinking, desire is not present.\"\n\n\"But venerable sir, what is the origin, source, birth, and cause of thinking? Under what conditions is thinking present? Under what conditions is it absent?\"\n\n\"Thinking, lord of devas, originates, arises, is born from, and is caused by the proliferation of perceptions and concepts. When the proliferation of perceptions and concepts is present, thinking is present; when the proliferation of perceptions and concepts is not present, thinking is not present.\"\n\n\"But venerable sir, how should a monk practice in order to follow the path that leads to the cessation of the proliferation of perceptions and concepts?\"",
      "sinhala": "ශක්‍ර දේවේන්ද්‍රයා භාග්‍යවතුන් වහන්සේගේ දේශනාව සතුටින් පිළිගෙන අනුමෝදන් වී භාග්‍යවතුන් වහන්සේගෙන් තවදුරටත් මෙසේ ඇසීය. \"පින්වත් ආයුෂ්මතුන් වහන්ස, ඊර්ෂ්‍යාව හා මසුරුකම හටගන්නේ කුමක් නිසාද? එහි සමුදය කුමක්ද? එය කුමන ආකාරයේද? එහි ප්‍රභවය කුමක්ද? කුමක් තිබීම නිසා ඊර්ෂ්‍යාව හා මසුරුකම ඇතිවේද? කුමක් නොතිබීම නිසා ඊර්ෂ්‍යාව හා මසුරුකම නැතිවේද?\"\n\n\"දේවානම්ඉන්ද, ඊර්ෂ්‍යාව හා මසුරුකම ප්‍රිය හා අප්‍රිය දේ නිසා හටගනී. එහි සමුදය ප්‍රිය හා අප්‍රිය දේය. එය ප්‍රිය හා අප්‍රිය ආකාරයේ වේ. එහි ප්‍රභවය ප්‍රිය හා අප්‍රිය දේය. ප්‍රිය හා අප්‍රිය දේ තිබීම නිසා ඊර්ෂ්‍යාව හා මසුරුකම ඇතිවේ. ප්‍රිය හා අප්‍රිය දේ නොතිබීම නිසා ඊර්ෂ්‍යාව හා මසුරුකම නැතිවේ.\"\n\n\"පින්වත් ආයුෂ්මතුන් වහන්ස, ප්‍රිය හා අප්‍රිය දේ හටගන්නේ කුමක් නිසාද? එහි සමුදය කුමක්ද? එය කුමන ආකාරයේද? එහි ප්‍රභවය කුමක්ද? කුමක් තිබීම නිසා ප්‍රිය හා අප්‍රිය දේ ඇතිවේද? කුමක් නොතිබීම නිසා ප්‍රිය හා අප්‍රිය දේ නැතිවේද?\"\n\n\"දේවානම්ඉන්ද, ප්‍රිය හා අප්‍රිය දේ ඡන්දය (කැමැත්ත) නිසා හටගනී. එහි සමුදය ඡන්දයයි. එය ඡන්දය ආකාරයේ වේ. එහි ප්‍රභවය ඡන්දයයි. ඡන්දය තිබීම නිසා ප්‍රිය හා අප්‍රිය දේ ඇතිවේ. ඡන්දය නොතිබීම නිසා ප්‍රිය හා අප්‍රිය දේ නැතිවේ.\"\n\n\"පින්වත් ආයුෂ්මතුන් වහන්ස, ඡන්දය හටගන්නේ කුමක් නිසාද? එහි සමුදය කුමක්ද? එය කුමන ආකාරයේද? එහි ප්‍රභවය කුමක්ද? කුමක් තිබීම නිසා ඡන්දය ඇතිවේද? කුමක් නොතිබීම නිසා ඡන්දය නැතිවේද?\"\n\n\"දේවානම්ඉන්ද, ඡන්දය විතර්ක නිසා හටගනී. එහි සමුදය විතර්කයයි. එය විතර්ක ආකාරයේ වේ. එහි ප්‍රභවය විතර්කයයි. විතර්ක තිබීම නිසා ඡන්දය ඇතිවේ. විතර්ක නොතිබීම නිසා ඡන්දය නැතිවේ.\"\n\n\"පින්වත් ආයුෂ්මතුන් වහන්ස, විතර්ක හටගන්නේ කුමක් නිසාද? එහි සමුදය කුමක්ද? එය කුමන ආකාරයේද? එහි ප්‍රභවය කුමක්ද? කුමක් තිබීම නිසා විතර්ක ඇතිවේද? කුමක් නොතිබීම නිසා විතර්ක නැතිවේද?\"\n\n\"දේවානම්ඉන්ද, විතර්ක ප්‍රපංච සංඥා සංඛ්‍යා නිසා හටගනී. එහි සමුදය ප්‍රපංච සංඥා සංඛ්‍යාය. එය ප්‍රපංච සංඥා සංඛ්‍යා ආකාරයේ වේ. එහි ප්‍රභවය ප්‍රපංච සංඥා සංඛ්‍යාය. ප්‍රපංච සංඥා සංඛ්‍යා තිබීම නිසා විතර්ක ඇතිවේ. ප්‍රපංච සංඥා සංඛ්‍යා නොතිබීම නිසා විතර්ක නැතිවේ.\"\n\n\"පින්වත් ආයුෂ්මතුන් වහන්ස, ප්‍රපංච සංඥා සංඛ්‍යා නිරුද්ධ කිරීම සඳහා පිළිපැදිය යුතු මාර්ගයෙහි භික්ෂුවක් කෙසේ පිළිපැදිය යුතුද?\"",
      "paliTitle": ""
    },
    {
      "number": 359,
      "pali": "‘‘Somanassaṃpāhaṃ [pahaṃ (sī. pī.), cāhaṃ (syā. kaṃ.)], devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Domanassaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Upekkhaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi.",
      "english": "And I, Lord of Devas, declare mental pleasure to be of two kinds: that which should be cultivated, and that which should not be cultivated. And I, Lord of Devas, declare mental pain to be of two kinds: that which should be cultivated, and that which should not be cultivated. And I, Lord of Devas, declare equanimity to be of two kinds: that which should be cultivated, and that which should not be cultivated.",
      "sinhala": "දේවේන්ද්‍රයෙනි, මම සෝමනස්සය ගැනත් දෙයාකාරයකින් පවසමි: සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් ලෙසයි. දේවේන්ද්‍රය, මම දෝමනස්සය ගැනත් දෙයාකාරයකින් පවසමි: සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් ලෙසයි. දේවේන්ද්‍රය, මම උපේක්ෂාව ගැනත් දෙයාකාරයකින් පවසමි: සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් ලෙසයි.",
      "paliTitle": "Vedanākammaṭṭhānaṃ",
      "englishTitle": "The contemplation of feeling.",
      "sinhalaTitle": "වේදනා කම්මට්ඨානය"
    },
    {
      "number": 360,
      "pali": "‘‘Somanassaṃpāhaṃ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā somanassaṃ ‘imaṃ kho me somanassaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṃ somanassaṃ na parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṃ somanassaṃ sevitabbaṃ. Tattha yaṃ ce savitakkaṃ savicāraṃ, yaṃ ce avitakkaṃ avicāraṃ, ye avitakke avicāre, te [se (sī. pī.)] paṇītatare. Somanassaṃpāhaṃ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti. Iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ.",
      "english": "\"Lord of the Devas, I say that joy is of two kinds: that which should be cultivated and that which should not. Why do I say this?\n\nIt is because if someone knows, 'By cultivating this joy, unwholesome qualities increase and wholesome qualities decrease,' then that kind of joy should not be cultivated. But if someone knows, 'By cultivating this joy, unwholesome qualities decrease and wholesome qualities increase,' then that kind of joy should be cultivated. And of those joys, the one with directed thought and evaluation and the one without directed thought and evaluation, the latter, without directed thought and evaluation, is the more refined.\n\nLord of the Devas, I say that joy is of two kinds: that which should be cultivated and that which should not. This is the reason for what I said.\"",
      "sinhala": "දේවේන්ද්‍රයෙනි, මම සෝමනස්සය දෙයාකාරයකින් පවසමි: සේවනය කළ යුතු සහ සේවනය නොකළ යුතු යනුවෙනි. එසේ කීවේ කුමක් නිසාද?\n\nයම් සෝමනස්සයක් සේවනය කිරීමෙන් අකුසල ධර්ම වර්ධනය වන අතර කුසල ධර්ම පිරිහී යයි ද, එවැනි සෝමනස්සයක් සේවනය නොකළ යුතුය. යම් සෝමනස්සයක් සේවනය කිරීමෙන් කුසල ධර්ම පිරිහෙන්නේ නැතිව වර්ධනය වේ ද, එවැනි සෝමනස්සයක් සේවනය කළ යුතුය.\n\nසවිතර්ක සවිචාර සෝමනස්සයට වඩා අවිතර්ක අවිචාර සෝමනස්සය ප්‍රණීත වේ.\n\nදේවේන්ද්‍රය, මම සෝමනස්සය දෙයාකාරයකින් පවසමි: සේවනය කළ යුතු සහ සේවනය නොකළ යුතු යනුවෙනි. මා විසින් එසේ කීවේ මේ කරුණු නිසාය.",
      "paliTitle": ""
    },
    {
      "number": 361,
      "pali": "‘‘Domanassaṃpāhaṃ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti. Iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā domanassaṃ ‘imaṃ kho me domanassaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṃ domanassaṃ na parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṃ domanassaṃ sevitabbaṃ. Tattha yaṃ ce savitakkaṃ savicāraṃ, yaṃ ce avitakkaṃ avicāraṃ, ye avitakke avicāre, te paṇītatare. Domanassaṃpāhaṃ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampī’ti iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ.",
      "english": "Chief of devas, I say that distress is of two kinds: that which should be cultivated, and that which should not. Now, what is the basis for this statement? It is this: When one knows, regarding a particular distress, \"Resorting to this distress causes unwholesome qualities to increase and wholesome qualities to decrease,\" that kind of distress should not be cultivated. But when one knows, regarding a particular distress, \"Resorting to this distress causes unwholesome qualities to decrease and wholesome qualities to increase,\" that kind of distress should be cultivated. Of these, that which is accompanied by initial and sustained thought, and that which is without initial and sustained thought—the latter, that without initial and sustained thought, is more refined. So, what was said—\"Chief of devas, I say that distress is of two kinds: that which should be cultivated, and that which should not\"—was said with reference to this.",
      "sinhala": "දේවේන්ද්‍රයෙනි, මම දොම්නස දෙයාකාරයකින් පවසමි: සේවනය කළ යුතු ද සහ සේවනය නොකළ යුතු ද යන්නයි. එය මෙසේ පවසන ලදී. එය කුමක් පදනම් කරගෙන පවසන ලද්දේද? යම් දොම්නසක් සේවනය කිරීමෙන් අකුසල ධර්ම වර්ධනය වන අතර කුසල ධර්ම පිරිහී යයි ද යමෙක් දන්නේ නම්, එවැනි දොම්නසක් සේවනය නොකළ යුතුය. යම් දොම්නසක් සේවනය කිරීමෙන් අකුසල ධර්ම පිරිහී කුසල ධර්ම වර්ධනය වේ ද යමෙක් දන්නේ නම්, එවැනි දොම්නසක් සේවනය කළ යුතුය. එහි විතර්ක සහිත විචාර සහිත දොම්නසක් ද, විතර්ක රහිත විචාර රහිත දොම්නසක් ද ඇත. විතර්ක රහිත විචාර රහිත ඒවා වඩා ප්‍රණීතය. දේවේන්ද්‍රයෙනි, මම දොම්නස දෙයාකාරයකින් පවසමි: සේවනය කළ යුතු ද සහ සේවනය නොකළ යුතු ද යන්නයි’ යැයි යමක් පවසන ලද්දේ ද, එය මේ කරුණු පදනම් කරගෙන පවසන ලදී.",
      "paliTitle": ""
    },
    {
      "number": 362,
      "pali": "‘‘Upekkhaṃpāhaṃ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā upekkhaṃ ‘imaṃ kho me upekkhaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpā upekkhā na sevitabbā. Tattha yaṃ jaññā upekkhaṃ ‘imaṃ kho me upekkhaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpā upekkhā sevitabbā. Tattha yaṃ ce savitakkaṃ savicāraṃ, yaṃ ce avitakkaṃ avicāraṃ, ye avitakke avicāre, te paṇītatare. Upekkhaṃpāhaṃ, devānaminda, duvidhena vadāmi sevitabbampi, asevitabbampīti iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ.",
      "english": "\"Equanimity, Lord of Gods, I describe as twofold: that which should be cultivated, and that which should not. That is what was said. And with what in mind was it said? In the case where one knows of equanimity, 'When I cultivate this equanimity, unwholesome qualities increase and wholesome qualities decrease,' such equanimity should not be cultivated. In the case where one knows of equanimity, 'When I cultivate this equanimity, unwholesome qualities decrease and wholesome qualities increase,' such equanimity should be cultivated. Furthermore, of equanimity that is with applied and sustained thought, and that which is without applied and sustained thought, that which is without applied and sustained thought is the more refined. 'Equanimity, Lord of Gods, I describe as twofold: that which should be cultivated, and that which should not.' This is what was said, and it was said with this in mind.\"",
      "sinhala": "දේවේන්ද්‍රය, මම උපේක්ෂාව සේවනය කළ යුතු ආකාරය සහ සේවනය නොකළ යුතු ආකාරය වශයෙන් දෙයාකාරයකින් පවසමි. එසේ පවසන ලද්දේ කුමක් පදනම් කරගෙනද?\n\nයම් උපේක්ෂාවක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩි වන බවත්, කුසල ධර්මයන් පිරිහී යන බවත් දන්නේ නම්, එවැනි උපේක්ෂාවක් සේවනය නොකළ යුතුය.\n\nයම් උපේක්ෂාවක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහී යන බවත්, කුසල ධර්මයන් වැඩි වන බවත් දන්නේ නම්, එවැනි උපේක්ෂාවක් සේවනය කළ යුතුය.\n\nවිතර්ක සහිත විචාර සහිත උපේක්ෂාවට වඩා, අවිතර්ක අවිචාරී උපේක්ෂාව ප්‍රණීතය.\n\nදේවේන්ද්‍රය, මම උපේක්ෂාව සේවනය කළ යුතු ආකාරය සහ සේවනය නොකළ යුතු ආකාරය වශයෙන් දෙයාකාරයකින් පවසමි යැයි මා කීවේ යම් කරුණක් නිසාද, එය මේ කරුණ පදනම් කරගෙනයි.",
      "paliTitle": ""
    },
    {
      "number": 363,
      "pali": "‘‘Evaṃ paṭipanno kho, devānaminda, bhikkhu papañcasaññāsaṅkhānirodhasāruppagāminiṃ paṭipadaṃ paṭipanno hotī’’ti. Itthaṃ bhagavā sakkassa devānamindassa pañhaṃ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṃ abhinandi anumodi – ‘‘evametaṃ, bhagavā, evametaṃ, sugata, tiṇṇā mettha kaṅkhā vigatā kathaṃkathā bhagavato pañhaveyyākaraṇaṃ sutvā’’ti. ",
      "english": "\"In this way of practice, O Sakka, lord of gods, a bhikkhu is practicing the path leading to the stilling of perceptions and categorizations born of proliferation.\" Thus, when questioned by Sakka, lord of gods, the Blessed One explained this. Sakka, lord of gods, pleased in mind, approved of and rejoiced at the Blessed One's words, saying, \"So it is, Blessed One! So it is, Fortunate One! Having heard the Blessed One's explanation of the question, my doubt is overcome, my perplexity is dispelled.\"",
      "sinhala": "දේවේන්ද්‍රය, මෙලෙස පිළිවෙත් පුරන භික්ෂුව පපඤ්ච සංඥා සංඛ්‍යා නිරෝධයට මඟ පෙන්වන ප්‍රතිපදාවෙහි පිහිටයි.\n\nභාග්‍යවතුන් වහන්සේ දෙවියන්ගේ අධිපති සක් දෙවිඳුන්ගේ ප්‍රශ්නයට මෙලෙස පිළිතුරු දුන් සේක. සක් දෙවිඳුන් සතුටු සිතින් භාග්‍යවතුන් වහන්සේගේ දේශනාව අනුමෝදන් වෙමින් මෙසේ පැවසීය: \"භාග්‍යවතුන් වහන්ස, එසේමය! සුගතයන් වහන්ස, එසේමය! භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්නෝත්තරය ඇසීමෙන් මාගේ සැක දුරු විය, විමතිය පහ විය.\"",
      "paliTitle": ""
    },
    {
      "number": 364,
      "pali": "Itiha sakko devānamindo bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttariṃ pañhaṃ apucchi – ‘‘Kathaṃ paṭipanno pana, mārisa, bhikkhu pātimokkhasaṃvarāya paṭipanno hotī’’ti? ‘‘Kāyasamācāraṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Vacīsamācāraṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Pariyesanaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabba’’mpi. ‘‘Kāyasamācāraṃpāhaṃ, devānaminda, duvidhena vadāmi sevitabbampi asevitabbampīti iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā kāyasamācāraṃ ‘imaṃ kho me kāyasamācāraṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo kāyasamācāro na sevitabbo. Tattha yaṃ jaññā kāyasamācāraṃ ‘imaṃ kho me kāyasamācāraṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo kāyasamācāro sevitabbo. Kāyasamācāraṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampīti iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Vacīsamācāraṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampī’ti. Iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā vacīsamācāraṃ ‘imaṃ kho me vacīsamācāraṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo vacīsamācāro na sevitabbo. Tattha yaṃ jaññā vacīsamācāraṃ ‘imaṃ kho me vacīsamācāraṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo vacīsamācāro sevitabbo. Vacīsamācāraṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampīti iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Pariyesanaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampīti iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā pariyesanaṃ ‘imaṃ kho me pariyesanaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpā pariyesanā na sevitabbā. Tattha yaṃ jaññā pariyesanaṃ ‘imaṃ kho me pariyesanaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpā pariyesanā sevitabbā. Pariyesanaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampīti iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Evaṃ paṭipanno kho, devānaminda, bhikkhu pātimokkhasaṃvarāya paṭipanno hotī’’ti. Itthaṃ bhagavā sakkassa devānamindassa pañhaṃ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṃ abhinandi anumodi – ‘‘evametaṃ, bhagavā, evametaṃ, sugata. Tiṇṇā mettha kaṅkhā vigatā kathaṃkathā bhagavato pañhaveyyākaraṇaṃ sutvā’’ti. ",
      "english": "Then Sakka, lord of the devas, having rejoiced and approved of the Blessed One's words, asked him a further question: “Venerable sir, how does a monk practice restraint according to the Pātimokkha?\"\n\n\"Lord of the devas, I say that bodily conduct is of two kinds: that which should be cultivated and that which should not. Lord of the devas, I say that verbal conduct is of two kinds: that which should be cultivated and that which should not. Lord of the devas, I say that seeking is of two kinds: that which should be cultivated and that which should not.\"\n\n\"Now, as to what was said, 'Lord of the devas, I say that bodily conduct is of two kinds: that which should be cultivated and that which should not,' with reference to what was this said? It was said with reference to this: If one knows, 'By cultivating this bodily conduct, unwholesome qualities increase within me, and wholesome qualities decrease,' then such bodily conduct should not be cultivated. But if one knows, 'By cultivating this bodily conduct, unwholesome qualities decrease within me, and wholesome qualities increase,' then such bodily conduct should be cultivated. It is with reference to this that I said, 'Lord of the devas, I say that bodily conduct is of two kinds: that which should be cultivated and that which should not.'\"\n\n\"Now, as to what was said, 'Lord of the devas, I say that verbal conduct is of two kinds: that which should be cultivated and that which should not,' with reference to what was this said? It was said with reference to this: If one knows, 'By cultivating this verbal conduct, unwholesome qualities increase within me, and wholesome qualities decrease,' then such verbal conduct should not be cultivated. But if one knows, 'By cultivating this verbal conduct, unwholesome qualities decrease within me, and wholesome qualities increase,' then such verbal conduct should be cultivated. It is with reference to this that I said, 'Lord of the devas, I say that verbal conduct is of two kinds: that which should be cultivated and that which should not.'\"\n\n\"Now, as to what was said, 'Lord of the devas, I say that seeking is of two kinds: that which should be cultivated and that which should not,' with reference to what was this said? It was said with reference to this: If one knows, 'By cultivating this seeking, unwholesome qualities increase within me, and wholesome qualities decrease,' then such seeking should not be cultivated. But if one knows, 'By cultivating this seeking, unwholesome qualities decrease within me, and wholesome qualities increase,' then such seeking should be cultivated. It is with reference to this that I said, 'Lord of the devas, I say that seeking is of two kinds: that which should be cultivated and that which should not.'\"\n\n\"It is in this way, lord of the devas, that a monk practices restraint according to the Pātimokkha.\"\n\nIn this way, the Blessed One, being questioned by Sakka, lord of the devas, explained. Sakka, lord of the devas, delighted, rejoiced and approved of the Blessed One's words: \"So it is, Blessed One! So it is, Fortunate One! My doubts are dispelled, my uncertainty is gone, having heard the Blessed One's explanation to my question.”",
      "sinhala": "මෙසේ දෙවියන්ගේ අධිපති වූ ශක්‍රයා භාග්‍යවතුන් වහන්සේගේ වචනයට සතුටු වී, අනුමෝදන් වී, භාග්‍යවතුන් වහන්සේගෙන් තවත් ප්‍රශ්නයක් මෙසේ විමසීය: \"ස්වාමීනි, භික්ෂුවක් ප්‍රාතිමෝක්ෂ සංවරයට අනුකූලව කෙසේ පිළිපැදිය යුතුද?\"\n\n\"දෙවියන්ගේ අධිපතීනි, මම කාය සමාචාරය දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ. වචී සමාචාරයත් එසේම දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ. එසේම පර්යේෂණයත් දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ.\"\n\n\"දෙවියන්ගේ අධිපතීනි, කාය සමාචාරය දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ\" යැයි මා කීවේ කුමක් අරභයාද? යම් කාය සමාචාරයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩි වී කුසල ධර්මයන් පිරිහී යයි දත හොත්, එවැනි කාය සමාචාරයක් සේවනය නොකළ යුතුය. යම් කාය සමාචාරයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහී කුසල ධර්මයන් වැඩි වේ නම්, එවැනි කාය සමාචාරයක් සේවනය කළ යුතුය. \"දෙවියන්ගේ අධිපතීනි, කාය සමාචාරය දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ\" යැයි මා කීවේ ඒ කරුණ අරභයාය.\n\n\"දෙවියන්ගේ අධිපතීනි, වචී සමාචාරය දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ\" යැයි මා කීවේ කුමක් අරභයාද? යම් වචී සමාචාරයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩි වී කුසල ධර්මයන් පිරිහී යයි දත හොත්, එවැනි වචී සමාචාරයක් සේවනය නොකළ යුතුය. යම් වචී සමාචාරයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහී කුසල ධර්මයන් වැඩි වේ නම්, එවැනි වචී සමාචාරයක් සේවනය කළ යුතුය. \"දෙවියන්ගේ අධිපතීනි, වචී සමාචාරය දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ\" යැයි මා කීවේ ඒ කරුණ අරභයාය.\n\n\"දෙවියන්ගේ අධිපතීනි, පර්යේෂණය දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ\" යැයි මා කීවේ කුමක් අරභයාද? යම් පර්යේෂණයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩි වී කුසල ධර්මයන් පිරිහී යයි දත හොත්, එවැනි පර්යේෂණයක් සේවනය නොකළ යුතුය. යම් පර්යේෂණයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහී කුසල ධර්මයන් වැඩි වේ නම්, එවැනි පර්යේෂණයක් සේවනය කළ යුතුය. \"දෙවියන්ගේ අධිපතීනි, පර්යේෂණය දෙයාකාරයකින් විස්තර කරමි - සේවනය කළ යුතු දේ සහ සේවනය නොකළ යුතු දේ\" යැයි මා කීවේ ඒ කරුණ අරභයාය.\n\n\"දෙවියන්ගේ අධිපතීනි, මෙසේ පිළිපදින භික්ෂුව ප්‍රාතිමෝක්ෂ සංවරයට අනුකූලව පිළිපදින්නේය.\" භාග්‍යවතුන් වහන්සේ දෙවියන්ගේ අධිපති වූ ශක්‍රයාගේ ප්‍රශ්නයට මෙලෙස පිළිතුරු දුන් සේක.\n\nසතුටු සිත් ඇති ශක්‍ර දෙවියන් භාග්‍යවතුන් වහන්සේගේ වචනයට සතුටු වී අනුමෝදන් විය: \"භාග්‍යවතුන් වහන්ස, එය එසේමය. සුගතයන් වහන්ස, එය එසේමය. භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්න විසඳීම ඇසීමෙන් මාගේ සැක දුරු විය. මගේ කුමක් කළ යුතුද යන විචිකිච්ඡාව දුරු විය.\"",
      "paliTitle": "Pātimokkhasaṃvaro",
      "englishTitle": "Restraint by the Patimokkha",
      "sinhalaTitle": "පාතිමොක්ඛ සංවරය"
    },
    {
      "number": 365,
      "pali": "Itiha sakko devānamindo bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttariṃ pañhaṃ apucchi – ‘‘Kathaṃ paṭipanno pana, mārisa, bhikkhu indriyasaṃvarāya paṭipanno hotī’’ti? ‘‘Cakkhuviññeyyaṃ rūpaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Sotaviññeyyaṃ saddaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Ghānaviññeyyaṃ gandhaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Jivhāviññeyyaṃ rasaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Kāyaviññeyyaṃ phoṭṭhabbaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampi. Manoviññeyyaṃ dhammaṃpāhaṃ, devānaminda, duvidhena vadāmi – sevitabbampi, asevitabbampī’’ti. Evaṃ vutte, sakko devānamindo bhagavantaṃ etadavoca – ‘‘Imassa kho ahaṃ, bhante, bhagavatā saṅkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmi. Yathārūpaṃ, bhante, cakkhuviññeyyaṃ rūpaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ cakkhuviññeyyaṃ rūpaṃ na sevitabbaṃ. Yathārūpañca kho, bhante, cakkhuviññeyyaṃ rūpaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṃ cakkhuviññeyyaṃ rūpaṃ sevitabbaṃ. Yathārūpañca kho, bhante, sotaviññeyyaṃ saddaṃ sevato…pe… ghānaviññeyyaṃ gandhaṃ sevato… jivhāviññeyyaṃ rasaṃ sevato… kāyaviññeyyaṃ phoṭṭhabbaṃ sevato… manoviññeyyaṃ dhammaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpo manoviññeyyo dhammo na sevitabbo. Yathārūpañca kho, bhante, manoviññeyyaṃ dhammaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpo manoviññeyyo dhammo sevitabbo. ‘‘Imassa kho me, bhante, bhagavatā saṅkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānato tiṇṇā mettha kaṅkhā vigatā kathaṃkathā bhagavato pañhaveyyākaraṇaṃ sutvā’’ti.",
      "english": "Thus, Sakka, the ruler of devas, having rejoiced and approved of the Blessed One's words, asked him a further question: \"But how, revered sir, does a bhikkhu practice for sense restraint?\"\n\n\"Forms cognizable by the eye, O ruler of devas, I declare to be of two kinds: those that should be cultivated and those that should not. Sounds cognizable by the ear, O ruler of devas, I declare to be of two kinds: those that should be cultivated and those that should not. Odors cognizable by the nose, O ruler of devas, I declare to be of two kinds: those that should be cultivated and those that should not. Tastes cognizable by the tongue, O ruler of devas, I declare to be of two kinds: those that should be cultivated and those that should not. Tactile sensations cognizable by the body, O ruler of devas, I declare to be of two kinds: those that should be cultivated and those that should not. Mental phenomena cognizable by the mind, O ruler of devas, I declare to be of two kinds: those that should be cultivated and those that should not.\"\n\nWhen this was said, Sakka, the ruler of devas, said to the Blessed One: \"Venerable sir, I understand the detailed meaning of this concise statement by the Blessed One in this way: A form cognizable by the eye, venerable sir, when cultivated, leads to an increase of unwholesome qualities and a decrease of wholesome qualities; such a form cognizable by the eye should not be cultivated. But a form cognizable by the eye, venerable sir, when cultivated, leads to a decrease of unwholesome qualities and an increase of wholesome qualities; such a form cognizable by the eye should be cultivated. A sound cognizable by the ear… an odor cognizable by the nose… a taste cognizable by the tongue… a tactile sensation cognizable by the body… A mental phenomenon cognizable by the mind, venerable sir, when cultivated, leads to an increase of unwholesome qualities and a decrease of wholesome qualities; such a mental phenomenon should not be cultivated. But a mental phenomenon cognizable by the mind, venerable sir, when cultivated, leads to a decrease of unwholesome qualities and an increase of wholesome qualities; such a mental phenomenon should be cultivated.\n\n\"Venerable sir, having understood the detailed meaning of this concise statement by the Blessed One in this way, my three doubts are eliminated, my uncertainty is dispelled, having heard the Blessed One's answer to the question.\"",
      "sinhala": "එවිට සක් දෙව් රජු භාග්‍යවතුන් වහන්සේගේ දේශනාව අනුමත කොට සතුටු සිතින් භාග්‍යවතුන් වහන්සේගෙන් තවත් ප්‍රශ්නයක් ඇසුවේය: \"ස්වාමීනි, භික්ෂුවක් ඉන්ද්‍රිය සංවරයෙහි පිහිටා කෙසේ පිළිපදියි ද?\"\n\n\"දේවේන්ද්‍රය, මම චක්ඛු විඤ්ඤාණයෙන් දැනගත යුතු රූපයන් දෙයාකාර බව කියමි. එනම්, සේවනය කළ යුතු රූප සහ සේවනය නොකළ යුතු රූප වශයෙනි. දේවේන්ද්‍රය, සෝත විඤ්ඤාණයෙන් දැනගත යුතු ශබ්දයන් දෙයාකාර බව කියමි. එනම්, සේවනය කළ යුතු ශබ්ද සහ සේවනය නොකළ යුතු ශබ්ද වශයෙනි. දේවේන්ද්‍රය, ඝාණ විඤ්ඤාණයෙන් දැනගත යුතු ගන්ධයන් දෙයාකාර බව කියමි. එනම්, සේවනය කළ යුතු ගන්ධ සහ සේවනය නොකළ යුතු ගන්ධ වශයෙනි. දේවේන්ද්‍රය, ජිව්හා විඤ්ඤාණයෙන් දැනගත යුතු රසයන් දෙයාකාර බව කියමි. එනම්, සේවනය කළ යුතු රස සහ සේවනය නොකළ යුතු රස වශයෙනි. දේවේන්ද්‍රය, කාය විඤ්ඤාණයෙන් දැනගත යුතු ස්පර්ශයන් දෙයාකාර බව කියමි. එනම්, සේවනය කළ යුතු ස්පර්ශ සහ සේවනය නොකළ යුතු ස්පර්ශ වශයෙනි. දේවේන්ද්‍රය, මනෝ විඤ්ඤාණයෙන් දැනගත යුතු ධර්මයන් දෙයාකාර බව කියමි. එනම්, සේවනය කළ යුතු ධර්ම සහ සේවනය නොකළ යුතු ධර්ම වශයෙනි.\"\n\nමෙසේ වදාළ කල්හි සක් දෙව් රජු භාග්‍යවතුන් වහන්සේට මෙසේ කීය: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂේපයෙන් දේශනා කරන ලද මේ දේශනයේ අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි. ස්වාමීනි, යම් රූපයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩෙත් ද, කුසල ධර්මයන් පිරිහෙත් ද, එබඳු චක්ඛු විඤ්ඤාණයෙන් දැනගත යුතු රූප සේවනය නොකළ යුතුය. ස්වාමීනි, යම් රූපයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහෙත් ද, කුසල ධර්මයන් වැඩෙත් ද, එබඳු චක්ඛු විඤ්ඤාණයෙන් දැනගත යුතු රූප සේවනය කළ යුතුය. ස්වාමීනි, යම් ශබ්දයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩෙත් ද, කුසල ධර්මයන් පිරිහෙත් ද, එබඳු සෝත විඤ්ඤාණයෙන් දැනගත යුතු ශබ්ද සේවනය නොකළ යුතුය. ස්වාමීනි, යම් ශබ්දයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහෙත් ද, කුසල ධර්මයන් වැඩෙත් ද, එබඳු සෝත විඤ්ඤාණයෙන් දැනගත යුතු ශබ්ද සේවනය කළ යුතුය. ස්වාමීනි, යම් ගන්ධයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩෙත් ද, කුසල ධර්මයන් පිරිහෙත් ද, එබඳු ඝාණ විඤ්ඤාණයෙන් දැනගත යුතු ගන්ධ සේවනය නොකළ යුතුය. ස්වාමීනි, යම් ගන්ධයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහෙත් ද, කුසල ධර්මයන් වැඩෙත් ද, එබඳු ඝාණ විඤ්ඤාණයෙන් දැනගත යුතු ගන්ධ සේවනය කළ යුතුය. ස්වාමීනි, යම් රසයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩෙත් ද, කුසල ධර්මයන් පිරිහෙත් ද, එබඳු ජිව්හා විඤ්ඤාණයෙන් දැනගත යුතු රස සේවනය නොකළ යුතුය. ස්වාමීනි, යම් රසයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහෙත් ද, කුසල ධර්මයන් වැඩෙත් ද, එබඳු ජිව්හා විඤ්ඤාණයෙන් දැනගත යුතු රස සේවනය කළ යුතුය. ස්වාමීනි, යම් ස්පර්ශයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩෙත් ද, කුසල ධර්මයන් පිරිහෙත් ද, එබඳු කාය විඤ්ඤාණයෙන් දැනගත යුතු ස්පර්ශ සේවනය නොකළ යුතුය. ස්වාමීනි, යම් ස්පර්ශයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහෙත් ද, කුසල ධර්මයන් වැඩෙත් ද, එබඳු කාය විඤ්ඤාණයෙන් දැනගත යුතු ස්පර්ශ සේවනය කළ යුතුය. ස්වාමීනි, යම් ධර්මයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් වැඩෙත් ද, කුසල ධර්මයන් පිරිහෙත් ද, එබඳු මනෝ විඤ්ඤාණයෙන් දැනගත යුතු ධර්ම සේවනය නොකළ යුතුය. ස්වාමීනි, යම් ධර්මයක් සේවනය කිරීමෙන් අකුසල ධර්මයන් පිරිහෙත් ද, කුසල ධර්මයන් වැඩෙත් ද, එබඳු මනෝ විඤ්ඤාණයෙන් දැනගත යුතු ධර්ම සේවනය කළ යුතුය.\"\n\n\"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂේපයෙන් දේශනා කරන ලද මේ දේශනයේ අර්ථය මෙසේ විස්තර වශයෙන් දැනගත් මට ඒ පිළිබඳව තිබූ සැක දුරු විය. භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්න විසඳීම ඇසීමෙන් මාගේ විචිකිච්ඡාව දුරු විය.\"",
      "paliTitle": "Indriyasaṃvaro",
      "englishTitle": "Restraint of the Senses",
      "sinhalaTitle": "ඉන්ද්‍රිය සංවරය"
    },
    {
      "number": 366,
      "pali": "Itiha sakko devānamindo bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttariṃ pañhaṃ apucchi – ‘‘Sabbeva nu kho, mārisa, samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā’’ti? ‘‘Na kho, devānaminda, sabbe samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā’’ti. ‘‘Kasmā pana, mārisa, na sabbe samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā’’ti? ‘‘Anekadhātu nānādhātu kho, devānaminda, loko. Tasmiṃ anekadhātunānādhātusmiṃ loke yaṃ yadeva sattā dhātuṃ abhinivisanti, taṃ tadeva thāmasā parāmāsā abhinivissa voharanti – ‘idameva saccaṃ moghamañña’nti. Tasmā na sabbe samaṇabrāhmaṇā ekantavādā ekantasīlā ekantachandā ekantaajjhosānā’’ti. ‘‘Sabbeva nu kho, mārisa, samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā’’ti? ‘‘Na kho, devānaminda, sabbe samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā’’ti. ‘‘Kasmā pana, mārisa, na sabbe samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā’’ti? ‘‘Ye kho, devānaminda, bhikkhū taṇhāsaṅkhayavimuttā te accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā. Tasmā na sabbe samaṇabrāhmaṇā accantaniṭṭhā accantayogakkhemī accantabrahmacārī accantapariyosānā’’ti. Itthaṃ bhagavā sakkassa devānamindassa pañhaṃ puṭṭho byākāsi. Attamano sakko devānamindo bhagavato bhāsitaṃ abhinandi anumodi – ‘‘evametaṃ, bhagavā, evametaṃ, sugata. Tiṇṇā mettha kaṅkhā vigatā kathaṃkathā bhagavato pañhaveyyākaraṇaṃ sutvā’’ti.",
      "english": "Thus, Sakka, the king of the devas, having rejoiced in and approved of the Blessed One's words, asked him a further question:\n\n“Venerable sir, are all ascetics and brahmins invariably of one doctrine, one practice, one aspiration, and one resolve?”\n\n“No, King of devas, not all ascetics and brahmins are invariably of one doctrine, one practice, one aspiration, and one resolve.”\n\n“Why then, venerable sir, are not all ascetics and brahmins invariably of one doctrine, one practice, one aspiration, and one resolve?”\n\n“The world, King of devas, is composed of many and diverse elements. In this world of many and diverse elements, whatever element beings cling to, that very thing they dogmatically assert, maintaining: ‘This alone is the truth; anything else is worthless.’ Therefore, not all ascetics and brahmins are invariably of one doctrine, one practice, one aspiration, and one resolve.”\n\n“Venerable sir, have all ascetics and brahmins indeed attained the ultimate consummation, the ultimate security from bondage, the ultimate holy life, and the ultimate final end?”\n\n“No, King of devas, not all ascetics and brahmins have attained the ultimate consummation, the ultimate security from bondage, the ultimate holy life, or the ultimate final end.”\n\n“Why then, venerable sir, have not all ascetics and brahmins attained the ultimate consummation, the ultimate security from bondage, the ultimate holy life, or the ultimate final end?”\n\n“Those monks, King of devas, who are liberated through the extinction of craving have attained the ultimate consummation, the ultimate security from bondage, the ultimate holy life, and the ultimate final end. Therefore, not all ascetics and brahmins have attained the ultimate consummation, the ultimate security from bondage, the ultimate holy life, or the ultimate final end.”\n\nIn this way, the Blessed One, having been asked a question by Sakka, the king of devas, answered it. Sakka, the king of devas, delighted in mind, rejoiced in and approved of the Blessed One's words, saying:\n\n“So it is, Blessed One! So it is, Fortunate One! My doubts are dispelled, my uncertainty is removed, having heard the Blessed One's explanation to the question.”",
      "sinhala": "දෙවියන්ට අධිපති ශක්‍රයා භාග්‍යවතුන් වහන්සේගේ දේශනාව අභිනන්දනය කර අනුමෝදන් වී, උන්වහන්සේගෙන් තවදුරටත් මෙසේ ප්‍රශ්න කළේය: “ස්වාමීනි, සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් ඒකාන්තවාදීන්ද, ඒකාන්තශීලීන්ද, ඒකාන්ත කැමැත්තක් ඇත්තේද, ඒකාන්ත අධ්‍යාසයකින් යුක්තද?”\n“දෙවියන්ට අධිපතී, සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් ඒකාන්තවාදීන් නොවෙති. ඒකාන්තශීලීන් නොවෙති. ඒකාන්ත කැමැත්තක් ඇත්තෝ නොවෙති. ඒකාන්ත අධ්‍යාසයකින් යුක්ත නොවෙති.”\n“එසේ නම් ස්වාමීනි, සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් ඒකාන්තවාදීන් නොවන්නේ මන්ද? ඒකාන්තශීලීන් නොවන්නේ මන්ද? ඒකාන්ත කැමැත්තක් ඇත්තෝ නොවන්නේ මන්ද? ඒකාන්ත අධ්‍යාසයකින් යුක්ත නොවන්නේ මන්ද?”\n“දෙවියන්ට අධිපතී, ලෝකය අනේක ධාතුකය, නානා ධාතුකය. ඒ අනේක ධාතුක, නානා ධාතුක ලෝකයෙහි යම් යම් ධාතුවකට සත්ත්වයෝ ඇලී ගනිත්ද, ඔවුහු ඒ ඒ ධාතුව දැඩිව අල්ලාගෙන, තදින් ග්‍රහණය කරගෙන ‘මෙයම පමණක් සත්‍යය, අන් සියල්ල හිස්’ යැයි වාද කරති. එනිසා සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් ඒකාන්තවාදීන් නොවෙති. ඒකාන්තශීලීන් නොවෙති. ඒකාන්ත කැමැත්තක් ඇත්තෝ නොවෙති. ඒකාන්ත අධ්‍යාසයකින් යුක්ත නොවෙති.”\n“ස්වාමීනි, සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් අත්‍යන්ත වූ නිමාවක් ඇත්තෝද, අත්‍යන්ත යෝගක්‍ෂේම ඇත්තෝද, අත්‍යන්ත බ්‍රහ්මචර්යාවෙහි යෙදුනෝද, අත්‍යන්ත පරියෝසානය ඇත්තෝද?”\n“දෙවියන්ට අධිපතී, සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් අත්‍යන්ත වූ නිමාවක් ඇත්තෝ නොවෙති. අත්‍යන්ත යෝගක්‍ෂේම ඇත්තෝ නොවෙති. අත්‍යන්ත බ්‍රහ්මචර්යාවෙහි යෙදුනෝ නොවෙති. අත්‍යන්ත පරියෝසානය ඇත්තෝ නොවෙති.”\n“එසේ නම් ස්වාමීනි, සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් අත්‍යන්ත වූ නිමාවක් ඇත්තෝ නොවන්නේ මන්ද? අත්‍යන්ත යෝගක්‍ෂේම ඇත්තෝ නොවන්නේ මන්ද? අත්‍යන්ත බ්‍රහ්මචර්යාවෙහි යෙදුනෝ නොවන්නේ මන්ද? අත්‍යන්ත පරියෝසානය ඇත්තෝ නොවන්නේ මන්ද?”\n“දෙවියන්ට අධිපතී, යම් භික්ෂූන් වහන්සේලා තෘෂ්ණාව නැති කිරීමෙන් විමුක්ත වූවාහුද, උන්වහන්සේලා අත්‍යන්ත වූ නිමාවක් ඇත්තෝ වෙති. අත්‍යන්ත යෝගක්‍ෂේම ඇත්තෝ වෙති. අත්‍යන්ත බ්‍රහ්මචර්යාවෙහි යෙදුනෝ වෙති. අත්‍යන්ත පරියෝසානය ඇත්තෝ වෙති. එනිසා සියලුම ශ්‍රමණ බ්‍රාහ්මණයන් අත්‍යන්ත වූ නිමාවක් ඇත්තෝ නොවෙති. අත්‍යන්ත යෝගක්‍ෂේම ඇත්තෝ නොවෙති. අත්‍යන්ත බ්‍රහ්මචර්යාවෙහි යෙදුනෝ නොවෙති. අත්‍යන්ත පරියෝසානය ඇත්තෝ නොවෙති.”\nමෙලෙස භාග්‍යවතුන් වහන්සේ දෙවියන්ට අධිපති ශක්‍රයා විසින් අසන ලද ප්‍රශ්නයට පිළිතුරු දුන් සේක. දෙවියන්ට අධිපති ශක්‍රයා සතුටු සිතින් භාග්‍යවතුන් වහන්සේගේ දේශනාව අභිනන්දනය කර අනුමෝදන් වී මෙසේ කීවේය: “භාග්‍යවතුන් වහන්ස, එය එසේමය. සුගතයන් වහන්ස, එය එසේමය. භාග්‍යවතුන් වහන්සේගේ ප්‍රශ්න විසඳීම ඇසීමෙන් මාගේ සැක දුරු විය, විචිකිච්ඡාව නැති විය.”",
      "paliTitle": ""
    },
    {
      "number": 367,
      "pali": "Itiha sakko devānamindo bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ etadavoca – ‘‘Ejā, bhante, rogo, ejā gaṇḍo, ejā sallaṃ, ejā imaṃ purisaṃ parikaḍḍhati tassa tasseva bhavassa abhinibbattiyā. Tasmā ayaṃ puriso uccāvacamāpajjati. Yesāhaṃ, bhante, pañhānaṃ ito bahiddhā aññesu samaṇabrāhmaṇesu okāsakammampi nālatthaṃ, te me bhagavatā byākatā. Dīgharattānusayitañca pana [dīgharattānupassatā, yañca pana (syā.), dīgharattānusayino, yañca pana (sī. pī.)] me vicikicchākathaṃkathāsallaṃ, tañca bhagavatā abbuḷha’’nti. ‘‘Abhijānāsi no tvaṃ, devānaminda, ime pañhe aññe samaṇabrāhmaṇe pucchitā’’ti? ‘‘Abhijānāmahaṃ, bhante, ime pañhe aññe samaṇabrāhmaṇe pucchitā’’ti. ‘‘Yathā kathaṃ pana te, devānaminda, byākaṃsu? Sace te agaru bhāsassū’’ti. ‘‘Na kho me, bhante, garu yatthassa bhagavā nisinno bhagavantarūpo vā’’ti. ‘‘Tena hi, devānaminda, bhāsassū’’ti. ‘‘Yesvāhaṃ [yesāhaṃ (sī. syā. pī.)], bhante, maññāmi samaṇabrāhmaṇā āraññikā pantasenāsanāti, tyāhaṃ upasaṅkamitvā ime pañhe pucchāmi, te mayā puṭṭhā na sampāyanti, asampāyantā mamaṃyeva paṭipucchanti – ‘ko nāmo āyasmā’ti? Tesāhaṃ puṭṭho byākaromi – ‘ahaṃ kho, mārisa, sakko devānamindo’ti. Te mamaṃyeva uttari paṭipucchanti – ‘kiṃ panāyasmā, devānaminda [devānamindo (sī. pī.)], kammaṃ katvā imaṃ ṭhānaṃ patto’ti? Tesāhaṃ yathāsutaṃ yathāpariyattaṃ dhammaṃ desemi. Te tāvatakeneva attamanā honti – ‘sakko ca no devānamindo diṭṭho, yañca no apucchimhā, tañca no byākāsī’ti. Te aññadatthu mamaṃyeva sāvakā sampajjanti, na cāhaṃ tesaṃ. Ahaṃ kho pana, bhante, bhagavato sāvako sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti.",
      "english": "Thus, Sakka, the ruler of the devas, having rejoiced in and approved of the Blessed One's words, said to him: \"Truly, venerable sir, craving is a disease, craving is a tumor, craving is a dart; craving pulls this person towards the arising of this or that existence. Therefore, this person experiences various states of being. Venerable sir, the questions for which I could not even find an opportunity for discussion with other ascetics and brahmins outside [your dispensation], those have been explained to me by the Blessed One. And the dart of doubt and uncertainty that has long lain within me, that too has been extracted by the Blessed One.\"\n\n\"Do you recall, ruler of the devas, having asked these questions of other ascetics and brahmins?\" \"Yes, venerable sir, I recall having asked these questions of other ascetics and brahmins.\" \"How, then, ruler of the devas, did they answer you? If it is not a burden for you, please tell me.\" \"Indeed, venerable sir, it is no burden for me in a place where the Blessed One is seated, or where the likeness of the Blessed One is present.\" \"Then, ruler of the devas, tell me.\"\n\n\"Venerable sir, I approach those ascetics and brahmins whom I consider to be forest dwellers and living in secluded hermitages, and I ask them these questions. When questioned by me, they are unable to answer, and being unable to answer, they ask me in return: 'What is your name, venerable sir?' When asked, I reply to them: 'Indeed, good sirs, I am Sakka, ruler of the devas.' They then question me further: 'What action, venerable sir, O ruler of the devas, did you perform to attain this station?' To them, I teach the Dhamma according to what I have heard and learned. They are satisfied with just that, thinking: 'We have seen Sakka, the ruler of the devas, and he has answered our questions!' They, in fact, become my disciples, but I do not become theirs. But I, venerable sir, am a disciple of the Blessed One, a stream-enterer, not subject to falling away, assured, destined for enlightenment.\"",
      "sinhala": "ඉක්බිති දෙවියන්ගේ අධිපති වූ ශක්‍රයා භාග්‍යවතුන් වහන්සේගේ දේශනාව සතුටින් පිළිගෙන අනුමෝදන් වී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, ඇලීම රෝගයකි, ඇලීම ගෙඩියකි, ඇලීම හීලයක් වැනිය. ඇලීම මේ පුද්ගලයා ඒ ඒ භවයන්හි නැවත ඉපදීම සඳහා ඇදගෙන යයි. එබැවින් මේ පුද්ගලයා උස් පහත් විවිධ තත්ත්වයන්ට පත්වේ. ස්වාමීනි, මා විසින් වෙනත් ශ්‍රමණ බ්‍රාහ්මණයන්ගෙන් විමසීමට අවස්ථාවක් පවා නොලැබුණු ප්‍රශ්න භාග්‍යවතුන් වහන්සේ මට පැහැදිලි කළ සේක. තවද මාගේ සිතෙහි බොහෝ කලක් මුළුල්ලේ පැවති සැකය හා දෝලනය නමැති හීලය ද භාග්‍යවතුන් වහන්සේ විසින් උදුරා දමන ලදී.”\n\n“දෙවියන්ගේ අධිපතීනි, ඔබ මෙම ප්‍රශ්න වෙනත් ශ්‍රමණ බ්‍රාහ්මණයන්ගෙන් විමසූ බව ඔබට මතකද?”\n\n“ස්වාමීනි, මට මතකයි, මම මෙම ප්‍රශ්න වෙනත් ශ්‍රමණ බ්‍රාහ්මණයන්ගෙන් විමසුවා.”\n\n“දෙවියන්ගේ අධිපතීනි, එසේ නම් ඔවුන් ඔබට පිළිතුරු දුන්නේ කෙසේද? ඔබට අපහසුවක් නැත්නම් කියන්න.”\n\n“ස්වාමීනි, භාග්‍යවතුන් වහන්සේ වැඩ සිටින මෙවන් තැනක මට කිසිම අපහසුවක් නැත.”\n\n“එසේ නම්, දෙවියන්ගේ අධිපතීනි, කියන්න.”\n\n“ස්වාමීනි, වනවාසී වූ දුර බැහැර සේනාසනවල වසන යම් ශ්‍රමණ බ්‍රාහ්මණයන් පිරිසක් වෙත මම ගොස් මෙම ප්‍රශ්න විමසමි. මා විසින් ප්‍රශ්න කරන ලද ඔවුන්ට පිළිතුරු දීමට නොහැකි වන අතර, ඔවුන් මගෙන්ම නැවත මෙසේ අසති: ‘ඔබ කවුද?’ එවිට මම ඔවුන්ට මෙසේ කියමි: ‘මම දෙවියන්ගේ අධිපති ශක්‍රයා වෙමි.’ එවිට ඔවුන් නැවතත් මගෙන්ම මෙසේ අසති: ‘දෙවියන්ගේ අධිපති ඔබ, කුමන කර්මයක් කිරීමෙන් මේ තනතුරට පැමිණියේද?’ එවිට මම අසා ඇති, ඉගෙන ගෙන ඇති පරිදි ඔවුන්ට ධර්මය දේශනා කරමි. එවිට ඔවුන් සතුටට පත්ව මෙසේ කියති: ‘අපට ශක්‍ර දෙවියන්ව දැක ගැනීමට ලැබුණා. එමෙන්ම අපි ඇසූ ප්‍රශ්නවලට ඔහු පිළිතුරු දුන්නා.’ ඒ අනුව ඔවුන් මාගේම ශ්‍රාවකයෝ බවට පත් වෙති. නමුත් මම ඔවුන්ගේ ශ්‍රාවකයෙක් නොවෙමි. එහෙත් ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයෙක්මි. සෝවාන් වූවෙක්මි. විනාශ නොවෙන ස්වභාවය ඇත්තෙක්මි. නිවන් මාර්ගයට එළඹ සිටින්නෙක්මි.”",
      "paliTitle": ""
    },
    {
      "number": 368,
      "pali": "‘‘Abhijānāsi no tvaṃ, devānaminda, ito pubbe evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābha’’nti? ‘‘Abhijānāmahaṃ, bhante, ito pubbe evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābha’’nti. ‘‘Yathā kathaṃ pana tvaṃ, devānaminda, abhijānāsi ito pubbe evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābha’’nti? ‘‘Bhūtapubbaṃ, bhante, devāsurasaṅgāmo samupabyūḷho [samūpabbuḷho (sī. pī.)] ahosi. Tasmiṃ kho pana, bhante, saṅgāme devā jiniṃsu, asurā parājayiṃsu [parājiṃsu (sī. pī.)]. Tassa mayhaṃ, bhante, taṃ saṅgāmaṃ abhivijinitvā vijitasaṅgāmassa etadahosi – ‘yā ceva dāni dibbā ojā yā ca asurā ojā, ubhayametaṃ [ubhayamettha (syā.)] devā paribhuñjissantī’ti. So kho pana me, bhante, vedapaṭilābho somanassapaṭilābho sadaṇḍāvacaro sasatthāvacaro na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Yo kho pana me ayaṃ, bhante, bhagavato dhammaṃ sutvā vedapaṭilābho somanassapaṭilābho, so adaṇḍāvacaro asatthāvacaro ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattatī’’ti.",
      "english": "“Do you recall, King of Gods, ever before experiencing such a gain of feeling, such a gain of joy?”\n\n“I do recall, venerable sir, ever before experiencing such a gain of feeling, such a gain of joy.”\n\n“How then, King of Gods, do you recall ever before experiencing such a gain of feeling, such a gain of joy?”\n\n“Once, venerable sir, a battle between the gods and the asuras was joined. In that battle, venerable sir, the gods were victorious, and the asuras were defeated. To me, venerable sir, having completely conquered in that battle, as one victorious in battle, it occurred to me: ‘Now the gods will partake of both the divine essence and the essence of the asuras.’ But that gain of feeling, that gain of joy, venerable sir, was connected with punishment and weapons; it did not conduce to disillusionment, to dispassion, to cessation, to peace, to direct knowledge, to awakening, or to Nibbana. But this gain of feeling, this gain of joy, venerable sir, that I have attained by hearing the Dhamma from the Blessed One, is not connected with punishment or weapons; it conduces solely to disillusionment, to dispassion, to cessation, to peace, to direct knowledge, to awakening, and to Nibbana.”",
      "sinhala": "දේවේන්ද්‍රයෙනි, ඔබ මීට පෙර මෙවැනි ප්‍රීතියක් හෝ සතුටක් ලැබූ බව මතක තිබේද?\nභාග්‍යවතුන් වහන්ස, මට මීට පෙර මෙවැනි ප්‍රීතියක් හෝ සතුටක් ලැබූ බව මතකය.\nදේවේන්ද්‍රයෙනි, ඔබ මීට පෙර මෙවැනි ප්‍රීතියක් හෝ සතුටක් ලැබූ බව මතක තබාගන්නේ කෙසේද?\n\nභාග්‍යවතුන් වහන්ස, පෙර කාලයක දෙවියන් හා අසුරයන් අතර යුද්ධයක් ඇති විය. භාග්‍යවතුන් වහන්ස, එම යුද්ධයේදී දෙවියන් ජයග්‍රහණය කළ අතර අසුරයන් පරාජය විය. භාග්‍යවතුන් වහන්ස, එම යුද්ධය ජයග්‍රහණය කිරීමෙන් පසු, ජයගත් මට මෙවැනි සිතුවිල්ලක් ඇති විය: 'දැන් දිව්‍යමය වූ ඕජස සහ අසුර ඕජස යන මේ දෙකම දෙවියන් විසින් පරිභෝජනය කරනු ඇත.' භාග්‍යවතුන් වහන්ස, එහෙත්, මා ලද ඒ ප්‍රීතිය හෝ සතුට දඬුවම් දීම හා ආයුධ භාවිතය හා සම්බන්ධ විය. එය කලකිරීමට, විරාගයට, නිරෝධයට, උපසමයට, අභිඥානයට, සම්බෝධියට හෝ නිර්වාණයට හේතු වූයේ නැත. භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේගේ ධර්මය ඇසීමෙන් පසු මා ලද මේ ප්‍රීතිය හෝ සතුට දඬුවම් දීම හා ආයුධ භාවිතය හා සම්බන්ධ නොවේ. එය ඒකාන්තයෙන්ම කලකිරීමට, විරාගයට, නිරෝධයට, උපසමයට, අභිඥානයට, සම්බෝධියට හා නිර්වාණයට හේතු වේ.",
      "paliTitle": "Somanassapaṭilābhakathā",
      "englishTitle": "The Discourse on Regaining Gladness",
      "sinhalaTitle": "සෝමනස්ස පටිලාභ කථා"
    },
    {
      "number": 369,
      "pali": "‘‘Kiṃ pana tvaṃ, devānaminda, atthavasaṃ sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedesī’’ti? ‘‘Cha kho ahaṃ, bhante, atthavase sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ‘‘Idheva tiṭṭhamānassa, devabhūtassa me sato; Punarāyu ca me laddho, evaṃ jānāhi mārisa. ‘‘Imaṃ kho ahaṃ, bhante, paṭhamaṃ atthavasaṃ sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ‘‘Cutāhaṃ diviyā kāyā, āyuṃ hitvā amānusaṃ; Amūḷho gabbhamessāmi, yattha me ramatī mano. ‘‘Imaṃ kho ahaṃ, bhante, dutiyaṃ atthavasaṃ sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ‘‘Svāhaṃ amūḷhapaññassa [amūḷhapañhassa (?)], viharaṃ sāsane rato; Ñāyena viharissāmi, sampajāno paṭissato. ‘‘Imaṃ kho ahaṃ, bhante, tatiyaṃ atthavasaṃ sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ‘‘Ñāyena me carato ca, sambodhi ce bhavissati; Aññātā viharissāmi, sveva anto bhavissati. ‘‘Imaṃ kho ahaṃ, bhante, catutthaṃ atthavasaṃ sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ‘‘Cutāhaṃ mānusā kāyā, āyuṃ hitvāna mānusaṃ; Puna devo bhavissāmi, devalokamhi uttamo. ‘‘Imaṃ kho ahaṃ, bhante, pañcamaṃ atthavasaṃ sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ‘‘Te [ye (?)] paṇītatarā devā, akaniṭṭhā yasassino; Antime vattamānamhi, so nivāso bhavissati. ‘‘Imaṃ kho ahaṃ, bhante, chaṭṭhaṃ atthavasaṃ sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ‘‘Ime kho ahaṃ, bhante, cha atthavase sampassamāno evarūpaṃ vedapaṭilābhaṃ somanassapaṭilābhaṃ pavedemi. ",
      "english": "“What advantage did you foresee, Lord of Gods, that you announced such a state of joy and satisfaction?”\n\n“Venerable sir, I foresaw six advantages, and because of them, I announced such a state of joy and satisfaction.\n\n“Remaining right here as a divine being, know that I have obtained renewed life, dear sir.” Venerable sir, I foresaw this first advantage, and because of it, I announced such a state of joy and satisfaction.\n\n“Having passed away from a divine body, relinquishing a non-human existence, I shall enter a womb unconfused, wherever my mind finds delight.” Venerable sir, I foresaw this second advantage, and because of it, I announced such a state of joy and satisfaction.\n\n“Possessing unconfused wisdom, dwelling delightedly in the Dispensation, I shall live righteously, fully aware and mindful.” Venerable sir, I foresaw this third advantage, and because of it, I announced such a state of joy and satisfaction.\n\n“And if, as I live righteously, enlightenment should arise, then I shall live with direct knowledge, and that will be the end of suffering.” Venerable sir, I foresaw this fourth advantage, and because of it, I announced such a state of joy and satisfaction.\n\n“Having passed away from a human body, relinquishing human existence, I shall again become a god, supreme in the realm of gods.” Venerable sir, I foresaw this fifth advantage, and because of it, I announced such a state of joy and satisfaction.\n\n“Among the most excellent and glorious gods, the Akanishthas, that will be my dwelling place in my final existence.” Venerable sir, I foresaw this sixth advantage, and because of it, I announced such a state of joy and satisfaction.\n\nVenerable sir, I foresaw these six advantages, and because of them, I announced such a state of joy and satisfaction.",
      "sinhala": "‘‘දේවේන්ද්‍රයෙනි, ඔබ කුමන අර්ථයක් සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කළේද?’’\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ කරුණු හයක් සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.\n\n‘‘මෙහිම දෙවියකු ලෙස සිටින මට නැවත ආයුෂ ලැබුණි. පින්වත, මෙය දැනගන්න.\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ පළමු අර්ථය සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.\n\n‘‘දිව්‍ය ශරීරයෙන් චුත වූ මම, අමනුෂ්‍ය ආයුෂ අත්හැර, සිහිමුළා නොවී මාගේ සිත කැමති තැනක ගැබ් ගන්නෙමි.\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ දෙවන අර්ථය සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.\n\n‘‘මම නොමුළා වූ ප්‍රඥාවෙන් යුතුව, ශාසනයෙහි ඇලී වාසය කරමින්, සිහියෙන් හා නුවණින් යුක්තව ධර්මය අනුව වාසය කරන්නෙමි.\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ තුන්වන අර්ථය සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.\n\n‘‘මම ධර්මයෙහි හැසිරෙන කල්හි සම්බෝධිය ලැබුවහොත්, අන්‍යයන්ට නොදැනී අරහත්වයෙන් වාසය කරන්නෙමි. එය දුකේ අවසානය වනු ඇත.\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ සිව්වන අර්ථය සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.\n\n‘‘මනුෂ්‍ය ශරීරයෙන් චුත වූ මම, මනුෂ්‍ය ආයුෂ අත්හැර, නැවත දෙව්ලොවෙහි උතුම් දෙවියෙක් වන්නෙමි.\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ පස්වන අර්ථය සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.\n\n‘‘යම් ඒ උතුම් වූ, කීර්තිමත් වූ අකනිට්ඨ බ්‍රහ්මයෝ වෙත්ද, මාගේ අවසන් ආත්මභාවයෙහි එම වාසස්ථානය වනු ඇත.\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ සයවන අර්ථය සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.\n\n‘‘භාග්‍යවතුන් වහන්ස, මම මේ අර්ථ හය සලකා මෙවැනි ප්‍රීතියක් හා සතුටක් ලැබීම ප්‍රකාශ කරමි.",
      "paliTitle": ""
    },
    {
      "number": 370,
      "pali": "‘‘Apariyositasaṅkappo, vicikiccho kathaṃkathī. Vicariṃ dīghamaddhānaṃ, anvesanto tathāgataṃ. ‘‘Yassu maññāmi samaṇe, pavivittavihārino; Sambuddhā iti maññāno, gacchāmi te upāsituṃ. ‘‘‘Kathaṃ ārādhanā hoti, kathaṃ hoti virādhanā’; Iti puṭṭhā na sampāyanti [sambhonti (syā.)], magge paṭipadāsu ca. ‘‘Tyassu yadā maṃ jānanti, sakko devānamāgato; Tyassu mameva pucchanti, ‘kiṃ katvā pāpuṇī idaṃ’. ‘‘Tesaṃ yathāsutaṃ dhammaṃ, desayāmi jane sutaṃ [janesuta (ka. sī.)]; Tena attamanā honti, ‘diṭṭho no vāsavoti ca’. ‘‘Yadā ca buddhamaddakkhiṃ, vicikicchāvitāraṇaṃ; Somhi vītabhayo ajja, sambuddhaṃ payirupāsiya [payirupāsayiṃ (syā. ka.)]. ‘‘Taṇhāsallassa hantāraṃ, buddhaṃ appaṭipuggalaṃ; Ahaṃ vande mahāvīraṃ, buddhamādiccabandhunaṃ. ‘‘Yaṃ karomasi brahmuno, samaṃ devehi mārisa; Tadajja tuyhaṃ kassāma [dassāma (syā. ka.)], handa sāmaṃ karoma te. ‘‘Tvameva asi [tuvamevasi (pī.)] sambuddho, tuvaṃ satthā anuttaro; Sadevakasmiṃ lokasmiṃ, natthi te paṭipuggalo’’ti.",
      "english": "With unresolved intentions, filled with doubt and uncertainty, I wandered for a long time, searching for the Tathagata.\n\nWhenever I thought certain ascetics dwelling in solitude were fully enlightened, I would go to attend upon them.\n\nWhen asked, “How does one succeed? How does one fail?” they could not answer concerning the path and its practices.\n\nBut when they recognized that I, Sakka, lord of the gods, had arrived, they would ask me, “By doing what did you attain this?”\n\nTo them, I would teach the Dhamma as I had heard it, as people know it. By that, they would be gladdened, saying, “We have seen Vasava!”\n\nBut when I saw the Buddha, the dispeller of doubt, today I became free from fear, having attended upon the Perfectly Awakened One.\n\nI pay homage to the Buddha, the peerless one, the remover of the dart of craving; I revere the Great Hero, the Buddha, kinsman of the sun.\n\nWhatever we do for Brahma, together with the gods, dear sir, that very thing we shall do for you today. Come, we shall perform it ourselves for you.\n\nYou alone are the Fully Awakened One, you are the unsurpassed Teacher. In the world with its gods, there is no one comparable to you.\"",
      "sinhala": "සංකල්පනා නිම නොකොට, විචිකිච්ඡාවෙන් හා සැකයෙන් යුක්තව, තථාගතයන් වහන්සේ සොයමින් බොහෝ කාලයක් සැරිසැරුවෙමි.\nයම් ශ්‍රමණයන් හුදකලාව වාසය කරත් නම්, ඔවුන් සම්බුද්ධයෝ යැයි සිතා මම ඔවුන් වෙත ගියෙමි.\n‘(මාර්ගය) සකස් කරගන්නේ කෙසේද, (මාර්ගය) මගහරින්නේ කෙසේද’ යැයි මාර්ගය සහ ප්‍රතිපදාව ගැන විමසූ විට ඔවුන්ට පිළිතුරු දීමට නොහැකි විය.\nදෙවියන්ගේ අධිපති සක් දෙවිඳු පැමිණ ඇතැයි ඔවුන් දැනගත් විට, ‘කුමක් කිරීමෙන් ඔබ මෙය ලබාගත්තේද’ යි මගෙන්ම ඇසූහ.\nමම ඔවුන්ට ඇසූ පරිදි ධර්මය දේශනා කළෙමි. ‘අපි වාසව දුටුවෙමු’ යි පවසමින් ඔවුහු සතුටු වූහ.\nයම් කලෙක සැක දුරුකරන බුදුරදුන් දුටුවෙම් ද, එදා පටන් සම්බුදුරදුන් සේවනය කිරීමෙන් මම භය රහිත වූවෙමි.\nතණ්හා නම් වූ සල්‍යය නසන, අනුපම පුද්ගලයාණන් වන බුදුරදුන්ටත්, හිරු කුලයට නෑකම් ඇති මහාවීරයාණන් වන බුදුරදුන්ටත් මම වඳිමි.\nපින්වත, දෙවියන් හා එක්ව බ්‍රහ්මයාට යම් උපහාරයක් කරන්නෙමු ද, අද අපි එය ඔබට දෙන්නෙමු. එම්බා, අපි එය ඔබ වෙනුවෙන්ම කරන්නෙමු.\nඔබම සම්බුද්ධයෙක්ය, ඔබ අනුත්තර ශාස්තෘවරයාය. දෙවියන් සහිත මේ ලෝකයෙහි ඔබට සම කළ හැකි පුද්ගලයෙක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 371,
      "pali": "Atha kho sakko devānamindo pañcasikhaṃ gandhabbaputtaṃ āmantesi – ‘‘bahūpakāro kho mesi tvaṃ, tāta pañcasikha, yaṃ tvaṃ bhagavantaṃ paṭhamaṃ pasādesi. Tayā, tāta, paṭhamaṃ pasāditaṃ pacchā mayaṃ taṃ bhagavantaṃ dassanāya upasaṅkamimhā arahantaṃ sammāsambuddhaṃ. Pettike vā ṭhāne ṭhapayissāmi, gandhabbarājā bhavissasi, bhaddañca te sūriyavacchasaṃ dammi, sā hi te abhipatthitā’’ti. Atha kho sakko devānamindo pāṇinā pathaviṃ parāmasitvā tikkhattuṃ udānaṃ udānesi – ‘‘namo tassa bhagavato arahato sammāsambuddhassā’’ti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne sakkassa devānamindassa virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’’nti. Aññesañca asītiyā devatāsahassānaṃ, iti ye sakkena devānamindena ajjhiṭṭhapañhā puṭṭhā, te bhagavatā byākatā. Tasmā imassa veyyākaraṇassa sakkapañhātveva adhivacananti.",
      "english": "Then Sakka, the lord of devas, addressed Pañcasikha, the gandhabba-son, saying, \"Indeed, Pañcasikha, you have been of great service to me because you were the first to please the Blessed One. It was only after you had pleased the Blessed One that we approached him, the Arahant, the Perfectly Self-Awakened One, for an audience. I will establish you in your father's position, making you king of the gandhabbas. And I will give you Bhaddā Sūriyavacchasā, for she is truly your heart's desire.\"\n\nThen Sakka, the lord of devas, touching the earth with his hand, exclaimed three times, \"Homage to that Blessed One, the Arahant, the Perfectly Self-Awakened One!\"\n\nAnd as this explanation was being spoken, the dust-free, stainless Eye of the Dhamma arose in Sakka, the lord of devas: \"Whatever is subject to origination is all subject to cessation.\" This also arose in eighty thousand other devas. Therefore, because these questions, posed by Sakka, the lord of devas, were answered by the Blessed One, this exposition is known as \"The Questions of Sakka.\"",
      "sinhala": "එවිට ශක්‍ර දේවේන්ද්‍රයා පංචසිඛ ගාන්ධර්ව පුත්‍රයා අමතා මෙසේ පැවසීය: “පංචසිඛ, ඔබ භාග්‍යවතුන් වහන්සේව පළමුවෙන් සතුටු කිරීමෙන් මට මහත් උපකාරයක් කළා. ඔබ විසින් පළමුව සතුටු කරනු ලැබූ උන්වහන්සේ දැකීමට පසුව අපි රහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ වෙත පැමිණියෙමු. එබැවින් මම ඔබව පිය තනතුරෙහි පිහිටුවන්නෙමි. ඔබ ගාන්ධර්ව රාජයෙක් වන්නෙහිය. තවද ඔබට සූරියවච්චසා නම් සුරූපිනිය දෙන්නෙමි. ඇය ඔබට බොහෝ සෙයින් ප්‍රිය වූ තැනැත්තියකි.”\n\nඉන්පසු ශක්‍ර දේවේන්ද්‍රයා සිය අතින් පොළොව ස්පර්ශ කර, තුන් වරක් “නමෝ තස්ස භගවතෝ අරහතෝ සම්මා සම්බුද්ධස්ස” යන උදන් වාක්‍යය ප්‍රකාශ කළේය. මෙම විස්තරය ප්‍රකාශ කරන විට, ශක්‍ර දේවේන්ද්‍රයාට සහ අසූ දහසක් වූ අනෙකුත් දෙවියන්ට “යම් කිසිවක් හටගැනීමේ ස්වභාවය ඇත්තේද, ඒ සියල්ල නිරුද්ධ වීමේ ස්වභාවය ඇත්තේය” යන විරජස්, කෙලෙස් රහිත ධර්ම චක්ෂුස පහළ විය. ශක්‍ර දේවේන්ද්‍රයා විසින් විමසන ලද ප්‍රශ්න මෙසේ භාග්‍යවතුන් වහන්සේ විසින් විස්තර කරන ලදී. එහෙයින් මෙම විස්තරය ‘සක්කපඤ්හය’ යන නමින් හැඳින්වේ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Sakkapañhasuttaṃ niṭṭhitaṃ aṭṭhamaṃ.",
    "english": "The Sakkapanha Sutta, eighth, is complete.",
    "sinhala": "සක්කපඤ්හ සූත්‍රය නිමි. අටවෙනි."
  }
}