{
  "id": "dn18",
  "title": {
    "pali": "Pāyāsisuttaṃ",
    "english": "Pāyāsi Sutta",
    "sinhala": "පායාසි සූත්‍රය"
  },
  "sections": [
    {
      "number": 406,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā kumārakassapo kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena setabyā nāma kosalānaṃ nagaraṃ tadavasari. Tatra sudaṃ āyasmā kumārakassapo setabyāyaṃ viharati uttarena setabyaṃ siṃsapāvane [sīsapāvane (syā.)]. Tena kho pana samayena pāyāsi rājañño setabyaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā pasenadinā kosalena dinnaṃ rājadāyaṃ brahmadeyyaṃ.",
      "english": "Thus I have heard. At one time, the Venerable Kumārakassapa was wandering in the Kosala region with a large Saṅgha of monks, about five hundred in number, and arrived at Setabyā, a town of the Kosalas.\n\nThere, the Venerable Kumārakassapa resided in the Siṃsapā Grove north of Setabyā.\n\nAt that time, Pāyāsi, a chieftain, governed Setabyā. It was a populous and prosperous town, well-supplied with grass, wood, water, and grain. This royal domain had been granted by King Pasenadi of Kosala as a royal gift and a rent-free endowment.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි ආයුෂ්මත් කුමාරකස්සප තෙරුන් වහන්සේ, පන්සියයක් පමණ භික්ෂූන්ගෙන් සමන්විත මහත් භික්ෂු සංඝයාවක් සමඟ කෝසල දනව්වෙහි සැරිසරමින්, සේතබ්‍යා නම් කෝසල නගරයට වැඩම කළහ. එකල ආයුෂ්මත් කුමාරකස්සප තෙරුන් වහන්සේ සේතබ්‍යා නගරයට උතුරින් පිහිටි සින්සපා වනයෙහි වැඩ වාසය කළහ. ඒ කාලයෙහි, පායාසි නම් රජතුමා, සත්ත්වයන්ගෙන් පිරුණු, තණ, දර, ජලය හා ධාන්‍ය බහුල වූ, රජුගේ භුක්තියට අයත් වූ, කෝසලයේ පසේනදී රජු විසින් දෙන ලද රාජ දායාදයක් හා බ්‍රහ්මදෙය දායාදයක් වූ සේතබ්‍යා නගරයෙහි අධිපතිව විසීය.",
      "paliTitle": ""
    },
    {
      "number": 407,
      "pali": "Tena kho pana samayena pāyāsissa rājaññassa evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ hoti – ‘‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ [sukaṭakkaṭānaṃ (sī. pī.)] kammānaṃ phalaṃ vipāko’’ti. Assosuṃ kho setabyakā brāhmaṇagahapatikā – ‘‘samaṇo khalu bho kumārakassapo samaṇassa gotamassa sāvako kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi setabyaṃ anuppatto setabyāyaṃ viharati uttarena setabyaṃ siṃsapāvane. Taṃ kho pana bhavantaṃ kumārakassapaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘paṇḍito byatto medhāvī bahussuto cittakathī kalyāṇapaṭibhāno vuddho [buddho (syā. ka.)] ceva arahā ca. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’’ti. Atha kho setabyakā brāhmaṇagahapatikā setabyāya nikkhamitvā saṅghasaṅghī gaṇībhūtā uttarenamukhā gacchanti yena siṃsapāvanaṃ [yena siṃsapāvanaṃ, tenupasaṅkamanti (sī. pī.)].",
      "english": "At that time, Prince Payasi held this wicked view: \"There is no afterlife, no spontaneously born beings, and no fruit or result of good and bad actions.\" The Brahmin householders of Setabya heard, \"The ascetic Kumarakassapa, a disciple of the ascetic Gotama, is wandering in Kosala and has arrived in Setabya with a large community of five hundred monks. He is now staying north of Setabya in the Simsapa Grove.\" A favorable report about the venerable Kumarakassapa had spread: \"He is wise, clever, intelligent, learned, an eloquent speaker, possessing excellent wit, experienced, and an Arahant. It is good to see such Arahants.\" Then the Brahmin householders of Setabya, having left the city, went in groups and crowds northwards towards the Simsapa Grove.",
      "sinhala": "එකල පායාසි නම් රජුට මෙවැනි පාපී මිථ්‍යා දෘෂ්ටියක් ඇති විය: \"පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හෝ අයහපත් ක්‍රියාවන්ගේ විපාක නැත.\"\n\nසේතබ්‍යයේ බ්‍රාහ්මණ ගෘහපතියෝ මෙසේ අසා දැන ගත්හ: \"ගෞතම ශ්‍රමණයාණන්ගේ ශ්‍රාවකයෙකු වන කුමාරකාශ්‍යප නම් ශ්‍රමණයා පන්සියයක් පමණ භික්ෂූන් පිරිවරාගෙන කෝසල දේශයේ සැරිසරමින් සේතබ්‍යයට පැමිණ සේතබ්‍යයට උතුරින් පිහිටි සිංසපා වනයේ වැඩවසන බව දැනගන්නට ලැබුණි. එම කුමාරකාශ්‍යපයන් වහන්සේ පිළිබඳව මෙවැනි යහපත් කීර්තිඝෝෂාවක් පැතිර පවතී: 'උන්වහන්සේ පණ්ඩිතයෙකි, දක්ෂයෙකි, බුද්ධිමතෙකි, බොහෝ ඇසූ පිරූ තැන් ඇත්තෙකි, චතුර ලෙස කථා කිරීමට දක්ෂයෙකි, යහපත් ප්‍රතිභානයක් ඇත්තෙකි, ප්‍රඥාවන්තයෙකි, එමෙන්ම රහතන් වහන්සේ නමකි. එවැනි රහතන් වහන්සේලා දැකීම යහපත්ය.' \"\n\nඉක්බිති සේතබ්‍යයේ බ්‍රාහ්මණ ගෘහපතියෝ සේතබ්‍යයෙන් පිටත්ව, කණ්ඩායම් වශයෙන් රැස්ව, උතුරු දිශාව බලා සිංසපා වනය වෙත ගියහ.",
      "paliTitle": "Pāyāsirājaññavatthu",
      "englishTitle": "The story of Payasi the ruler",
      "sinhalaTitle": "පායාසි රාජඤ්ඤ වත්ථුව"
    },
    {
      "number": 408,
      "pali": "Tena kho pana samayena pāyāsi rājañño uparipāsāde divāseyyaṃ upagato hoti. Addasā kho pāyāsi rājañño setabyake brāhmaṇagahapatike setabyāya nikkhamitvā saṅghasaṅghī gaṇībhūte uttarenamukhe gacchante yena siṃsapāvanaṃ [yena siṃsapāvanaṃ, tenupasaṅkamante (sī. pī.)], disvā khattaṃ āmantesi – ‘‘kiṃ nu kho, bho khatte, setabyakā brāhmaṇagahapatikā setabyāya nikkhamitvā saṅghasaṅghī gaṇībhūtā uttarenamukhā gacchanti yena siṃsapāvana’’nti [ettha pana sabbatthapi evameva dissati, natthi pāṭhantaraṃ]? ‘‘Atthi kho, bho, samaṇo kumārakassapo, samaṇassa gotamassa sāvako kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi setabyaṃ anuppatto setabyāyaṃ viharati uttarena setabyaṃ siṃsapāvane. Taṃ kho pana bhavantaṃ kumārakassapaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘paṇḍito byatto medhāvī bahussuto cittakathī kalyāṇapaṭibhāno vuddho ceva arahā cā’ti [arahā ca (syā. ka.)]. Tamete [tamenaṃ te (sī. ka.), tamenaṃ (pī.)] bhavantaṃ kumārakassapaṃ dassanāya upasaṅkamantī’’ti. ‘‘Tena hi, bho khatte, yena setabyakā brāhmaṇagahapatikā tenupasaṅkama; upasaṅkamitvā setabyake brāhmaṇagahapatike evaṃ vadehi – ‘pāyāsi, bho, rājañño evamāha – āgamentu kira bhavanto, pāyāsipi rājañño samaṇaṃ kumārakassapaṃ dassanāya upasaṅkamissatī’ti. Purā samaṇo kumārakassapo setabyake brāhmaṇagahapatike bāle abyatte saññāpeti – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’ti. Natthi hi, bho khatte, paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’ti. ‘‘Evaṃ bho’’ti kho so khattā pāyāsissa rājaññassa paṭissutvā yena setabyakā brāhmaṇagahapatikā tenupasaṅkami; upasaṅkamitvā setabyake brāhmaṇagahapatike etadavoca – ‘‘pāyāsi, bho, rājañño evamāha, āgamentu kira bhavanto, pāyāsipi rājañño samaṇaṃ kumārakassapaṃ dassanāya upasaṅkamissatī’’ti.",
      "english": "At that time, Prince Pāyāsi was taking his midday rest on the upper floor of his palace. He saw the Brahmins and householders of Setabyā leaving Setabyā and heading north in large groups toward the Siṃsapā Grove. Seeing this, he asked his attendant, \"Tell me, attendant, why are the Brahmins and householders of Setabyā leaving Setabyā and going north in such crowds toward the Siṃsapā Grove?\"\n\n\"Sir,\" the attendant replied, \"the ascetic Kumārakassapa, a disciple of the ascetic Gotama, is currently staying in the Siṃsapā Grove, north of Setabyā. He has been traveling through Kosala with a large following of about five hundred monks. A glowing reputation precedes the venerable Kumārakassapa: 'He is wise, learned, intelligent, eloquent, quick-witted, experienced, and an Arahant.' These people are going to see him.\"\n\n\"In that case, attendant, go to those Brahmins and householders of Setabyā. Tell them, 'Prince Pāyāsi asks that you wait for him. Prince Pāyāsi will also be coming to see the ascetic Kumārakassapa.' I must prevent the ascetic Kumārakassapa from convincing these foolish and ignorant Brahmins and householders of Setabyā that 'there is an afterlife, that there are beings who are born spontaneously, and that good and bad actions have consequences.' Because, in truth, attendant, there is no afterlife, there are no spontaneously born beings, and good and bad actions have no consequences.\"\n\n\"Yes, sir,\" the attendant replied to Prince Pāyāsi. He went to the Brahmins and householders of Setabyā and said to them, \"Prince Pāyāsi asks that you wait for him. Prince Pāyāsi will also be coming to see the ascetic Kumārakassapa.\"",
      "sinhala": "එකල පයාසි රජතුමා දහවල් කාලයේ ප්‍රාසාදයේ උඩුමහලේ සැතපී සිටියේය. සේතබ්‍ය බ්‍රාහ්මණ ගෘහපතියන් පිරිසක් සේතබ්‍යාවෙන් පිටත්ව කණ්ඩායම් වශයෙන් උතුරු දිශාවට සිංසපා වනය දෙසට යන අයුරු දුටු පයාසි රජතුමා සිය සේවකයා අමතා, “සේවකය, මේ සේතබ්‍ය බ්‍රාහ්මණ ගෘහපතියන් කණ්ඩායම් වශයෙන් සේතබ්‍යාවෙන් පිටත්ව උතුරු දිශාවට සිංසපා වනයට යන්නේ කුමක් නිසා දැ”යි ඇසීය.\n\nසේවකයා, “ස්වාමීනි, ශ්‍රමණ ගෞතමයන්ගේ ශ්‍රාවකයෙකු වන කුමාරකාශ්‍යප නම් ශ්‍රමණවරයෙක් පන්සියයක් පමණ භික්ෂූන් පිරිවරා කෝසල දේශයේ සැරිසරමින් සේතබ්‍යාවට පැමිණ සේතබ්‍යාවට උතුරින් පිහිටි සිංසපා වනයේ වැඩ වාසය කරයි. ‘ඒ කුමාරකාශ්‍යපයන් පණ්ඩිතයෙකි, බුද්ධිමත්යෙකි, නුවණැත්තෙකි, බොහෝ ඇසූ පිරූ ත ඇති අයෙකි, චතුර ලෙස කථා කරන්නෙකි, යහපත් ප්‍රතිභා ඇත්තෙකි, වයෝවෘද්ධ මෙන්ම රහත් වූ අයෙකි’ යන යහපත් කීර්ති නාමයක් ඔහු පිළිබඳව පැතිරී තිබේ. ඔවුන් ඒ කුමාරකාශ්‍යපයන් දැක බලා ගැනීමට එහි යති” යැයි කීවේය.\n\n“එසේ නම්, සේවකය, ඔබ සේතබ්‍ය බ්‍රාහ්මණ ගෘහපතියන් සිටින තැනට ගොස් ඔවුන්ට මෙසේ කියන්න. ‘පයාසි රජතුමා මෙසේ පවසයි. ඔබ මොහොතක් මෙහි රැඳී සිටින්න. පයාසි රජතුමාද කුමාරකාශ්‍යප ශ්‍රමණවරයා බැහැ දකින්නට එනු ඇත.’ මන්ද, කුමාරකාශ්‍යප ශ්‍රමණවරයා සේතබ්‍යාවේ අඥාන, අව්‍යක්ත බ්‍රාහ්මණ ගෘහපතියන්ට ‘පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, යහපත් හා අයහපත් ක්‍රියාවන්ගේ විපාක ඇත’ යැයි ඒත්තු ගැන්වීමට පෙර, සේවකය, පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හා අයහපත් ක්‍රියාවන්ගේ විපාකද නැත” යැයි රජු පැවසීය.\n\n“එසේය, ස්වාමීනි,” කියා සේවකයා පයාසි රජුට පිළිතුරු දී සේතබ්‍ය බ්‍රාහ්මණ ගෘහපතියන් සිටි තැනට ගොස් ඔවුන්ට මෙසේ කීවේය: “පයාසි රජතුමා මෙසේ පවසයි. ඔබ මොහොතක් මෙහි රැඳී සිටින්න. පයාසි රජතුමාද කුමාරකාශ්‍යප ශ්‍රමණවරයා බැහැ දකින්නට එනු ඇත.”",
      "paliTitle": ""
    },
    {
      "number": 409,
      "pali": "Atha kho pāyāsi rājañño setabyakehi brāhmaṇagahapatikehi parivuto yena siṃsapāvanaṃ yenāyasmā kumārakassapo tenupasaṅkami; upasaṅkamitvā āyasmatā kumārakassapena saddhiṃ sammodi, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Setabyakāpi kho brāhmaṇagahapatikā appekacce āyasmantaṃ kumārakassapaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce āyasmatā kumārakassapena saddhiṃ sammodiṃsu; sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Appekacce yenāyasmā kumārakassapo tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu. Appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu. Appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. ",
      "english": "Then King Pāyāsi, accompanied by the Brahmins and householders of Setabyā, went to the Simsapa Grove to see the Venerable Kumārakassapa. On arrival, he exchanged polite greetings with the Venerable Kumārakassapa, engaged in courteous and memorable conversation, and then sat down to one side.\n\nThe Brahmins and householders of Setabyā also: some paid homage to the Venerable Kumārakassapa and sat down to one side; some exchanged polite greetings with him, engaged in courteous and memorable conversation, and sat down to one side; some raised their hands in respectful Añjali towards the Venerable Kumārakassapa and sat down to one side; some announced their names and clans and sat down to one side; and some sat down silently to one side.",
      "sinhala": "ඉන්පසු පායාසි රාජඤ්ඤ, සේතබ්‍ය වැසි බමුණු-ගැහැවියන් පිරිවරාගෙන, සිංසපා වනයට, ආයුෂ්මත් කුමාරකස්සප ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් කුමාරකස්සප ස්ථවිරයන් වහන්සේ හා සමඟ සතුටු විය; සතුටු විය යුතු, සිහිපත් කළ යුතු කථා පැවැත්වීමෙන් පසු, එකත්පසෙකින් වාඩි විය. සේතබ්‍ය වැසි බමුණු-ගැහැවියෝද, සමහරු ආයුෂ්මත් කුමාරකස්සප ස්ථවිරයන් වහන්සේට වැඳ, එකත්පසෙකින් වාඩි වූහ. සමහරු ආයුෂ්මත් කුමාරකස්සප ස්ථවිරයන් වහන්සේ හා සමඟ සතුටු වූහ; සතුටු විය යුතු, සිහිපත් කළ යුතු කථා පැවැත්වීමෙන් පසු, එකත්පසෙකින් වාඩි වූහ. සමහරු ආයුෂ්මත් කුමාරකස්සප ස්ථවිරයන් වහන්සේ දෙසට ඇඳිලි බැඳ, එකත්පසෙකින් වාඩි වූහ. සමහරු තමන්ගේ නම ගොත්‍රය කියා, එකත්පසෙකින් වාඩි වූහ. සමහරු නිහඬව සිට, එකත්පසෙකින් වාඩි වූහ.",
      "paliTitle": ""
    },
    {
      "number": 410,
      "pali": "Ekamantaṃ nisinno kho pāyāsi rājañño āyasmantaṃ kumārakassapaṃ etadavoca – ‘‘ahañhi, bho kassapa, evaṃvādī evaṃdiṭṭhī – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Nāhaṃ, rājañña, evaṃvādiṃ evaṃdiṭṭhiṃ addasaṃ vā assosiṃ vā. Kathañhi nāma evaṃ vadeyya – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’ti? ",
      "english": "Having sat down to one side, Prince Pāyāsi said this to the venerable Kumārakassapa: \"Venerable Kassapa, I hold this view and teaching: 'There is no afterlife, no spontaneously born beings, and no fruit or consequence of good and bad actions.'\"\n\n\"Your Highness,\" replied Kumārakassapa, \"I have neither seen nor heard of anyone holding such a view or teaching. How could anyone say, 'There is no afterlife, no spontaneously born beings, and no fruit or consequence of good and bad actions'?\"",
      "sinhala": "එක් පසෙක අසුන් ගෙන සිටි පායාසි රජු ආයුෂ්මත් කුමාරකස්සප හිමියන්ට මෙසේ කීවේය: \"පින්වත් කස්සප, මම මෙවැනි මතයක් හා දෘෂ්ටියක් දරන්නෙමි. එනම්, 'පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මවල විපාකයක් නැත' යන්නයි.\"\n\n\"රජතුමනි, මෙවැනි මතයක් හා දෘෂ්ටියක් ඇති අයෙකු මම දැක හෝ අසා නැත. 'පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මවල විපාකයක් නැත' යැයි කෙසේ නම් කියන්නද?\"",
      "paliTitle": "Natthikavādo",
      "englishTitle": "The Doctrine of Non-Existence",
      "sinhalaTitle": "නත්ථික වාදය"
    },
    {
      "number": 411,
      "pali": "‘‘Tena hi, rājañña, taññevettha paṭipucchissāmi, yathā te khameyya, tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, rājañña, ime candimasūriyā imasmiṃ vā loke parasmiṃ vā, devā vā te manussā vā’’ti? ‘‘Ime, bho kassapa, candimasūriyā parasmiṃ loke, na imasmiṃ; devā te na manussā’’ti. ‘‘Imināpi kho te, rājañña, pariyāyena evaṃ hotu – itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’ti.",
      "english": "“Well then, Khattiya, I will question you about this, and you may answer as you see fit. What do you think, Khattiya? Are the moon and sun in this world or another? Are they gods or humans?”\n\n“Good Kassapa, the moon and sun are in another world, not this one; they are gods, not humans.”\n\n“By this reasoning, Khattiya, it should be clear to you that there is another world, that beings arise spontaneously, and that there are fruits and results of good and bad deeds.”",
      "sinhala": "එසේ නම් ක්ෂත්‍රියය, මම ඔබගෙන්ම ඒ ගැන විමසන්නෙමි. ඔබට රිසි පරිදි එය විස්තර කරන්න. ක්ෂත්‍රියය, ඔබ සිතන්නේ කුමක්ද? මේ චන්ද්‍රයා සහ සූර්යයා මේ ලෝකයේද, නැතහොත් පරලෝකයේද? ඔවුන් දෙවිවරුන්ද, නැතහොත් මිනිසුන්ද?\nභවත් කාශ්‍යපයන් වහන්ස, මේ චන්ද්‍රයා සහ සූර්යයා පරලෝකයේය. මේ ලෝකයේ නොවෙයි. ඔවුන් දෙවිවරුය, මිනිසුන් නොවෙයි.\nක්ෂත්‍රියය, මේ කරුණින් පවා ඔබට මෙසේ වැටහේවා: පරලොවක් ඇත. ඕපපාතික සත්වයෝ සිටිති. කුසල හා අකුසල කර්මයන්ගේ ඵල විපාක ඇත.",
      "paliTitle": "Candimasūriyaupamā",
      "englishTitle": "The Simile of the Moon and Sun",
      "sinhalaTitle": "චන්ද්‍රසූර්ය උපමා"
    },
    {
      "number": 412,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Atthi pana, rājañña, pariyāyo, yena te pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti? ‘‘Atthi, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Yathā kathaṃ viya, rājaññā’’ti? ‘‘Idha me, bho kassapa, mittāmaccā ñātisālohitā pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavācā pharusavācā samphappalāpī abhijjhālū byāpannacittā micchādiṭṭhī. Te aparena samayena ābādhikā honti dukkhitā bāḷhagilānā. Yadāhaṃ jānāmi – ‘na dānime imamhā ābādhā vuṭṭhahissantī’ti tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘santi kho, bho, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ye te pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavācā pharusavācā samphappalāpī abhijjhālū byāpannacittā micchādiṭṭhī, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’ti. Bhavanto kho pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavācā pharusavācā samphappalāpī abhijjhālū byāpannacittā micchādiṭṭhī. Sace tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ saccaṃ vacanaṃ, bhavanto kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjissanti. Sace, bho, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyyātha, yena me āgantvā āroceyyātha – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’ti. Bhavanto kho pana me saddhāyikā paccayikā, yaṃ bhavantehi diṭṭhaṃ, yathā sāmaṃ diṭṭhaṃ evametaṃ bhavissatī’ti. Te me ‘sādhū’ti paṭissutvā neva āgantvā ārocenti, na pana dūtaṃ pahiṇanti. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "Even though Master Kassapa says this, it still occurs to me: ‘There is no afterlife, there are no spontaneously born beings, and there is no fruit or result of good and bad actions.’\n\n“But, chieftain, is there a way in which you arrive at this view: ‘There is no afterlife, there are no spontaneously born beings, and there is no fruit or result of good and bad actions’?”\n\n“Yes, Master Kassapa, there is a way in which I arrive at this view: ‘There is no afterlife, there are no spontaneously born beings, and there is no fruit or result of good and bad actions.’”\n\n“In what way, chieftain?”\n\n“Here, Master Kassapa, my friends, companions, relatives, and kin are those who kill living beings, take what is not given, engage in sexual misconduct, speak falsely, speak divisively, speak harshly, engage in idle chatter, are covetous, have ill will, and hold wrong views. Later, they become afflicted, suffering, and gravely ill. When I realize, ‘They will not recover from this illness,’ I approach them and say: ‘Friends, there are some ascetics and brahmins who say and believe that those who kill living beings, take what is not given, engage in sexual misconduct, speak falsely, speak divisively, speak harshly, engage in idle chatter, are covetous, have ill will, and hold wrong views—they, upon the dissolution of the body, after death, are reborn in a state of deprivation, a bad destination, a lower realm, hell. You, friends, kill living beings, take what is not given, engage in sexual misconduct, speak falsely, speak divisively, speak harshly, engage in idle chatter, are covetous, have ill will, and hold wrong views. If the words of those venerable ascetics and brahmins are true, then you, upon the dissolution of the body, after death, will be reborn in a state of deprivation, a bad destination, a lower realm, hell. Therefore, friends, if upon the dissolution of the body, after death, you are reborn in a state of deprivation, a bad destination, a lower realm, hell, then come back to me and tell me: \"There is indeed an afterlife, there are spontaneously born beings, and there is a fruit and result of good and bad actions.\" For you, friends, are trustworthy and reliable; what you have seen will be as if I had seen it myself.’ They agree, saying, ‘Very well,’ but they neither come back to tell me nor send a messenger. This, Master Kassapa, is also the way in which I arrive at this view: ‘There is no afterlife, there are no spontaneously born beings, and there is no fruit or result of good and bad actions.’”",
      "sinhala": "‘‘කස්සප භවත්තුමා එසේ පැවසුවද, මට මෙවැනි හැඟීමක් ඇති වෙනවා. එනම්, ‘පරලොවක් නැත, ඕපපාතික සත්ත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මවල විපාකයක් නැත’ යන්නයි.’’\n\n‘‘රාජඤ්ඤ, ඔබට ‘පරලොවක් නැත, ඕපපාතික සත්ත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මවල විපාකයක් නැත’ යන හැඟීම ඇතිවීමට හේතුවක් තිබේද?’’\n\n‘‘කස්සප භවත්තුමනි, මට ‘පරලොවක් නැත, ඕපපාතික සත්ත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මවල විපාකයක් නැත’ යන හැඟීම ඇතිවීමට හේතුවක් තිබේ.’’\n\n‘‘රාජඤ්ඤ, එය කෙසේද?’’\n\n‘‘කස්සප භවත්තුමනි, මෙහිදී මගේ මිත්‍රයන්, අමාත්‍යවරුන්, ඥාතීන් සහ ලේ ඥාතීන් ප්‍රාණඝාත කරන්නන්, අදත්තාදානයෙහි යෙදෙන්නන්, කාමයේ වරදවා හැසිරෙන්නන්, බොරු කියන්නන්, කේලාම් කියන්නන්, රළු වචන කථා කරන්නන්, හිස් වචන කියමින් කාලය නාස්ති කරන්නන්, අභිධ්‍යා ඇත්තන්, ද්වේෂ සහගත සිත් ඇත්තන් හා මිථ්‍යා දෘෂ්ටි ඇත්තන් වෙති. ඔවුන් ටික කලකට පසු රෝගී වෙති, දුක් විඳිති, දැඩි ලෙස රෝගාතුර වෙති. ‘දැන් මොවුන් මේ රෝගයෙන් සුව නොවනු ඇත’යි මා දන්නා විට, මම ඔවුන් වෙතට ගොස් මෙසේ කියමි: ‘භවත්නි, සමහර ශ්‍රමණ බ්‍රාහ්මණයන් මෙසේ කියමින්, මෙවැනි මත දරමින් සිටිති. එනම්, ‘යම් අයෙක් ප්‍රාණඝාත කරන්නන්, අදත්තාදානයෙහි යෙදෙන්නන්, කාමයේ වරදවා හැසිරෙන්නන්, බොරු කියන්නන්, කේලාම් කියන්නන්, රළු වචන කථා කරන්නන්, හිස් වචන කියමින් කාලය නාස්ති කරන්නන්, අභිධ්‍යා ඇත්තන්, ද්වේෂ සහගත සිත් ඇත්තන් හා මිථ්‍යා දෘෂ්ටි ඇත්තන් වෙත්ද, ඔවුන් කය බිඳී, මරණින් පසු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට යති’ කියායි. ඔබ භවත්හු ප්‍රාණඝාත කරන්නන්, අදත්තාදානයෙහි යෙදෙන්නන්, කාමයේ වරදවා හැසිරෙන්නන්, බොරු කියන්නන්, කේලාම් කියන්නන්, රළු වචන කථා කරන්නන්, හිස් වචන කියමින් කාලය නාස්ති කරන්නන්, අභිධ්‍යා ඇත්තන්, ද්වේෂ සහගත සිත් ඇත්තන් හා මිථ්‍යා දෘෂ්ටි ඇත්තන් වෙති. ඒ ශ්‍රමණ බ්‍රාහ්මණයන්ගේ වචනය සත්‍ය නම්, ඔබ භවත්හු කය බිඳී, මරණින් පසු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට යනු ඇත. භවත්නි, ඔබ කය බිඳී, මරණින් පසු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට ගියහොත්, ‘පරලොවක් ඇත, ඕපපාතික සත්ත්වයෝ ඇත, යහපත් හෝ අයහපත් කර්මවල විපාකයක් ඇත’ කියා මට පැමිණ දන්වන්න. මක්නිසාද ඔබ මට විශ්වාසවන්තය, ඔබ විසින් දකින ලද්දක් මා විසින්ම දකිනවා හා සමානයි’ කියායි. ඔවුන් ‘එසේය’ කියා පිළිගත් නමුත්, මා වෙත පැමිණ දැනුම් දෙන්නෙත් නැත, පණිවිඩකරුවෙකු එවන්නෙත් නැත. කස්සප භවත්තුමනි, ‘පරලොවක් නැත, ඕපපාතික සත්ත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මවල විපාකයක් නැත’ යැයි මට සිතීමට මෙයද හේතුවකි.’’",
      "paliTitle": ""
    },
    {
      "number": 413,
      "pali": "‘‘Tena hi, rājañña, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, rājañña, idha te purisā coraṃ āgucāriṃ gahetvā dasseyyuṃ – ‘ayaṃ te, bhante, coro āgucārī; imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’ti. Te tvaṃ evaṃ vadeyyāsi – ‘tena hi, bho, imaṃ purisaṃ daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā [kāretvā (syā. ka.)] kharassarena paṇavena rathikāya rathikaṃ [rathiyāya rathiyaṃ (bahūsū)] siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhamitvā dakkhiṇato nagarassa āghātane sīsaṃ chindathā’ti. Te ‘sādhū’ti paṭissutvā taṃ purisaṃ daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhamitvā dakkhiṇato nagarassa āghātane nisīdāpeyyuṃ. Labheyya nu kho so coro coraghātesu – ‘āgamentu tāva bhavanto coraghātā, amukasmiṃ me gāme vā nigame vā mittāmaccā ñātisālohitā, yāvāhaṃ tesaṃ uddisitvā āgacchāmī’ti, udāhu vippalapantasseva coraghātā sīsaṃ chindeyyu’’nti? ‘‘Na hi so, bho kassapa, coro labheyya coraghātesu – ‘āgamentu tāva bhavanto coraghātā amukasmiṃ me gāme vā nigame vā mittāmaccā ñātisālohitā, yāvāhaṃ tesaṃ uddisitvā āgacchāmī’ti. Atha kho naṃ vippalapantasseva coraghātā sīsaṃ chindeyyu’’nti. ‘‘So hi nāma, rājañña, coro manusso manussabhūtesu coraghātesu na labhissati – ‘āgamentu tāva bhavanto coraghātā, amukasmiṃ me gāme vā nigame vā mittāmaccā ñātisālohitā, yāvāhaṃ tesaṃ uddisitvā āgacchāmī’ti. Kiṃ pana te mittāmaccā ñātisālohitā pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavācā pharusavācā samphappalāpī abhijjhālū byāpannacittā micchādiṭṭhī, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā labhissanti nirayapālesu – ‘āgamentu tāva bhavanto nirayapālā, yāva mayaṃ pāyāsissa rājaññassa gantvā ārocema – ‘‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti? Imināpi kho te, rājañña, pariyāyena evaṃ hotu – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti.",
      "english": "Therefore, O king, I will question you on this matter. Please answer it as you see fit. What do you think, O king? Suppose your men were to seize a criminal, a wrongdoer, and present him to you, saying, ‘Venerable sir, this man is a criminal, a wrongdoer; inflict upon him whatever punishment you wish.’ You would then say to them, ‘Well then, sirs, bind this man tightly with strong ropes with his arms twisted behind his back, shave his head, parade him from street to street and crossroad to crossroad with a harsh-sounding drum, lead him out through the southern gate, and cut off his head to the south of the city at the place of execution.’ And they, assenting with ‘So be it,’ would bind that man tightly with strong ropes with his arms twisted behind his back, shave his head, parade him from street to street and crossroad to crossroad with a harsh-sounding drum, lead him out through the southern gate, and seat him to the south of the city at the place of execution. Would that criminal then get permission from the executioners, saying, ‘Please wait a moment, sirs, the executioners, my friends, ministers, relatives, and kinsmen are in such-and-such a village or town; let me go and take leave of them and then I will return’? Or would the executioners cut off his head while he was still lamenting?\n\n‘No, indeed, Venerable Kassapa, that criminal would not get permission from the executioners, saying, \"Please wait a moment, sirs, the executioners, my friends, ministers, relatives, and kinsmen are in such-and-such a village or town; let me go and take leave of them and then I will return.\" Rather, the executioners would cut off his head while he was still lamenting.’\n\n‘Indeed, O king, if that criminal, a human being, will not get such permission from the executioners, who are also human beings, saying, \"Please wait a moment, sirs, the executioners, my friends, ministers, relatives, and kinsmen are in such-and-such a village or town; let me go and take leave of them and then I will return,\" how much less will those friends, ministers, relatives, and kinsmen – who are killers of living beings, who take what is not given, who engage in sexual misconduct, who speak falsely, who speak maliciously, who speak harshly, who engage in frivolous talk, who are covetous, who have malevolent minds, and who hold wrong views – having, upon the breakdown of the body and after death, reappeared in a state of deprivation, a bad destination, a downward fall, in hell – get permission from the guardians of hell, saying, \"Please wait a moment, sirs, the guardians of hell, until we go and inform King Payasi: ‘There is indeed another world, there are spontaneously arisen beings, and there is fruit and result of good and bad deeds’\"? By this reasoning, O king, let it be clear to you that there is indeed another world, there are spontaneously arisen beings, and there is fruit and result of good and bad deeds.’",
      "sinhala": "එසේ නම්, රජතුමනි, මම ඔබගෙන්ම මේ පිළිබඳව පෙරළා විමසන්නෙමි. ඔබට යමක් සුදුසු යැයි හැඟේද, එලෙස එය විස්තර කරන්න. රජතුමනි, ඔබ මේ කුමක් සිතන්නෙහිද? මෙහිදී ඔබේ මිනිසුන් වරදක් කළ සොරා අල්ලාගෙන ඔබට පෙන්වමින් මෙසේ කියනු ඇත: ‘ස්වාමීනි, මේ ඔබේ වරදක් කළ සොරා ය; ඔබ කැමති දඬුවමක් මේ සොරාට නියම කරන්න’යි. ඔබ ඔවුන්ට මෙසේ කියනු ඇත: ‘එසේ නම්, පින්වතුනි, මේ පුරුෂයාගේ දෑත් පිටුපසට කර තද කඹවලින් මනාසේ බැඳ, හිස මුඩු කරවා, රළු හඬ නගන බෙරයක් සමග වීදියෙන් වීදියටත්, සිව්මංසලෙන් සිව්මංසලටත් ගෙනගොස්, දකුණු දොරටුවෙන් නගරයෙන් පිටතට ගෙන ගොස්, නගරයට දකුණු පසින් ඇති මරණීය දණ්ඩන භූමියේදී හිස සිඳ දමන්න’යි. ඔවුන්, ‘එසේය’යි පිළිගෙන, ඒ පුරුෂයාගේ දෑත් පිටුපසට කර තද කඹවලින් මනාසේ බැඳ, හිස මුඩු කරවා, රළු හඬ නගන බෙරයක් සමග වීදියෙන් වීදියටත්, සිව්මංසලෙන් සිව්මංසලටත් ගෙනගොස්, දකුණු දොරටුවෙන් නගරයෙන් පිටතට ගෙන ගොස්, නගරයට දකුණු පසින් ඇති මරණීය දණ්ඩන භූමියේදී හිඳුවනු ඇත. එවිට ඒ සොරාට, සොරුන් ඝාතනය කරන්නන්ගෙන් මේ අවසරය ලැබෙයිද: ‘මරණ දඬුවම ක්‍රියාත්මක කරන මහත්වරුනි, පොඩ්ඩක් ඉවසන්න! මට අසවල් ගමේ හෝ නගරයේ මිතුරන්, ඇමතිවරුන්, නෑදෑයන්, හා ලේ ඥාතීන් සිටිති. මම ඔවුන්ට සමුදී එනතුරු ඉවසන්න’ කියා, නැතහොත් ඔහු එලෙස විලාප නගද්දීම මරණ දඬුවම ක්‍රියාත්මක කරන්නන් ඔහුගේ හිස සිඳ දමනු ඇතැයි ඔබ සිතන්නෙහිද?\n\n‘නැත, භවත් කාශ්‍යප, ඒ සොරාට මරණ දඬුවම ක්‍රියාත්මක කරන්නන්ගෙන්: ‘මරණ දඬුවම ක්‍රියාත්මක කරන මහත්වරුනි, පොඩ්ඩක් ඉවසන්න! මට අසවල් ගමේ හෝ නගරයේ මිතුරන්, ඇමතිවරුන්, නෑදෑයන්, හා ලේ ඥාතීන් සිටිති. මම ඔවුන්ට සමුදී එනතුරු ඉවසන්න’ කියා අවසරයක් නොලැබෙන්නේය. ඇත්ත වශයෙන්ම, ඔහු එලෙස විලාප නගද්දීම මරණ දඬුවම ක්‍රියාත්මක කරන්නන් ඔහුගේ හිස සිඳ දමනු ඇත’යි.\n\nරජතුමනි, එසේ නම්, ඒ මනුෂ්‍ය සොරාට මනුෂ්‍ය ස්වභාවයෙන් යුතු මරණ දඬුවම ක්‍රියාත්මක කරන්නන්ගෙන්: ‘මරණ දඬුවම ක්‍රියාත්මක කරන මහත්වරුනි, පොඩ්ඩක් ඉවසන්න! මට අසවල් ගමේ හෝ නගරයේ මිතුරන්, ඇමතිවරුන්, නෑදෑයන්, හා ලේ ඥාතීන් සිටිති. මම ඔවුන්ට සමුදී එනතුරු ඉවසන්න’ කියා අවසරයක් නොලැබෙන්නේ නම්, ප්‍රාණඝාත කරන්නාවූ, අදත්තාදානය කරන්නාවූ, කාමයන්හි වරදවා හැසිරෙන්නාවූ, මුසාවාදීවූ, පිසුනාවාචා ඇතිවූ, ඵරුසාවාචා ඇතිවූ, සම්ප්‍රප්පලාපීවූ, අභිජ්ඣා ඇතිවූ, ව්‍යාපාද සිත් ඇතිවූ, මිථ්‍යාදෘෂ්ටිකවූ ඔබේ මිතුරන්, ඇමතිවරුන්, නෑදෑයන්, හා ලේ ඥාතීන්, ශරීරය බිඳී මරණින් පසු අපාය, දුර්ගති, විනිපාත, නිරයෙහි උපත ලබා, නිරයපාලයන්ගෙන් මේ අවසරය ලබනු ඇතැයි ඔබ සිතන්නෙහිද: ‘ස්වාමීනි, නිරයපාලවරුනි, පොඩ්ඩක් ඉවසන්න! අපි ගොස් පායාසි රජතුමාට දන්වා එමු: ‘‘පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, කුසල් අකුසල් කර්මයන්ගේ ඵලවිපාක ඇත’’’ කියා? රජතුමනි, මේ කාරණයෙනුත් ඔබට මෙසේ සිතෙන්නේය: ‘පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, කුසල් අකුසල් කර්මයන්ගේ ඵලවිපාක ඇත’ කියා.",
      "paliTitle": "Coraupamā",
      "englishTitle": "Simile of the Thief",
      "sinhalaTitle": "චෝර උපමා"
    },
    {
      "number": 414,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’ti. ‘‘Atthi pana, rājañña, pariyāyo yena te pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti? ‘‘Atthi, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Yathā kathaṃ viya, rājaññā’’ti? ‘‘Idha me, bho kassapa, mittāmaccā ñātisālohitā pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā pisuṇāya vācāya paṭiviratā pharusāya vācāya paṭiviratā samphappalāpā paṭiviratā anabhijjhālū abyāpannacittā sammādiṭṭhī. Te aparena samayena ābādhikā honti dukkhitā bāḷhagilānā. Yadāhaṃ jānāmi – ‘na dānime imamhā ābādhā vuṭṭhahissantī’ti tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘santi kho, bho, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ye te pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā pisuṇāya vācāya paṭiviratā pharusāya vācāya paṭiviratā samphappalāpā paṭiviratā anabhijjhālū abyāpannacittā sammādiṭṭhī te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantīti. Bhavanto kho pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā pisuṇāya vācāya paṭiviratā pharusāya vācāya paṭiviratā samphappalāpā paṭiviratā anabhijjhālū abyāpannacittā sammādiṭṭhī. Sace tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ saccaṃ vacanaṃ, bhavanto kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissanti. Sace, bho, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyātha, yena me āgantvā āroceyyātha – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’ti. Bhavanto kho pana me saddhāyikā paccayikā, yaṃ bhavantehi diṭṭhaṃ, yathā sāmaṃ diṭṭhaṃ evametaṃ bhavissatī’ti. Te me ‘sādhū’ti paṭissutvā neva āgantvā ārocenti, na pana dūtaṃ pahiṇanti. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "Although the venerable Kassapa says this, yet this thought occurs to me: ‘Indeed, there is no other world, there are no spontaneously arisen beings, there is no fruit or result of good and bad deeds.’\n\n“Is there, O King's Son, a reason by which this thought occurs to you: ‘Indeed, there is no other world, there are no spontaneously arisen beings, there is no fruit or result of good and bad deeds’?”\n\n“There is, Venerable Kassapa, a reason by which this thought occurs to me: ‘Indeed, there is no other world, there are no spontaneously arisen beings, there is no fruit or result of good and bad deeds.’”\n\n“How so, O King's Son?”\n\n“Here, Venerable Kassapa, my friends, associates, relatives, and kin are refrained from taking life, refrained from taking what is not given, refrained from sexual misconduct, refrained from false speech, refrained from malicious speech, refrained from harsh speech, refrained from frivolous talk; they are not covetous, not ill-willed, and have right view. At a later time, they become afflicted, suffering, gravely ill. When I know, ‘they will not recover from this illness,’ I go to them and say this: ‘There are, sirs, some ascetics and brahmins who speak thus and hold this view: — those who are refrained from taking life, refrained from taking what is not given, refrained from sexual misconduct, refrained from false speech, refrained from malicious speech, refrained from harsh speech, refrained from frivolous talk, not covetous, not ill-willed, and have right view — they, upon the breaking up of the body, after death, reappear in a good destination, a heavenly world. Indeed, you sirs are refrained from taking life, refrained from taking what is not given, refrained from sexual misconduct, refrained from false speech, refrained from malicious speech, refrained from harsh speech, refrained from frivolous talk, not covetous, not ill-willed, and have right view. If the words of those venerable ascetics and brahmins are true, then you sirs, upon the breaking up of the body, after death, will reappear in a good destination, a heavenly world. If, sirs, upon the breaking up of the body, after death, you reappear in a good destination, a heavenly world, then you should come back and report to me: “Indeed, there is another world, there are spontaneously arisen beings, there is fruit and result of good and bad deeds.” Indeed, you sirs are trustworthy and reliable to me; what you yourselves have seen will be as if I had seen it myself.’ They, having assented to me with ‘Yes,’ neither come back to report, nor do they send a messenger. This, too, Venerable Kassapa, is a reason by which this thought occurs to me: ‘Indeed, there is no other world, there are no spontaneously arisen beings, there is no fruit or result of good and bad deeds.’”",
      "sinhala": "පූජ්‍ය කස්සපයන් වහන්සේ එසේ පැවසුවත්, එහෙත් මට නම් මෙසේ සිතේ – ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල ඵල විපාක නැත’ කියායි. “රාජාඥය, ඔබට ක්‍රමයක් තිබේද යම් ක්‍රමයකින් ඔබට මෙසේ සිතෙන ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල ඵල විපාක නැත’ කියා?” “පූජ්‍ය කස්සපයන් වහන්ස, ක්‍රමයක් තිබේ, යම් ක්‍රමයකින් මට මෙසේ සිතෙන ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල ඵල විපාක නැත’ කියායි.” “රාජාඥය, කෙසේද එය?” “පූජ්‍ය කස්සපයන් වහන්ස, මෙහි මාගේ මිත්‍රයන්, ඇමතියන්, නෑදෑයන්, ලේ ඥාතීන් සිටිති. ඔවුහු ප්‍රාණඝාතයෙන් වැළකුණාහුය, අදත්තාදානයෙන් වැළකුණාහුය, කාමයේ වරදවා හැසිරීමෙන් වැළකුණාහුය, මුසාවාදයෙන් වැළකුණාහුය, පිසුනු වචනයෙන් වැළකුණාහුය, ඵරුෂ වචනයෙන් වැළකුණාහුය, සම්ඵප්පලාපයෙන් වැළකුණාහුය, අභිධ්‍යාව රහිත වූවාහුය, ව්‍යාපාද රහිත සිත් ඇති වූවාහුය, සම්මා දිට්ඨික වූවාහුය. ඔවුහු කලකට පසු රෝගී වෙති, දුක් විඳිති, දැඩි ලෙස ගිලන් වෙති. මා යම් විටක දන්නවාද ‘මෙම ආබාධයෙන් මොවුන් දැන් නැගිටින්නේ නැතැ’යි, එවිට මම ඔවුන් වෙත ගොස් මෙසේ කියමි – ‘භවත්නි, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ මෙසේ කියන, මෙවන් දෘෂ්ටියක් ඇති අය සිටිති – යම් අයෙක් ප්‍රාණඝාතයෙන් වැළකුණාද, අදත්තාදානයෙන් වැළකුණාද, කාමයේ වරදවා හැසිරීමෙන් වැළකුණාද, මුසාවාදයෙන් වැළකුණාද, පිසුනු වචනයෙන් වැළකුණාද, ඵරුෂ වචනයෙන් වැළකුණාද, සම්ඵප්පලාපයෙන් වැළකුණාද, අභිධ්‍යාව රහිතද, ව්‍යාපාද රහිත සිත් ඇතිද, සම්මා දිට්ඨිකද, ඔවුහු කය බිඳී මරණින් පසු සුගතියක් වූ ස්වර්ග ලෝකයක උපදිති’ කියායි. භවතුන් ද ප්‍රාණඝාතයෙන් වැළකුණාහුය, අදත්තාදානයෙන් වැළකුණාහුය, කාමයේ වරදවා හැසිරීමෙන් වැළකුණාහුය, මුසාවාදයෙන් වැළකුණාහුය, පිසුනු වචනයෙන් වැළකුණාහුය, ඵරුෂ වචනයෙන් වැළකුණාහුය, සම්ඵප්පලාපයෙන් වැළකුණාහුය, අභිධ්‍යාව රහිත වූවාහුය, ව්‍යාපාද රහිත සිත් ඇති වූවාහුය, සම්මා දිට්ඨිකයෝය. යම් හෙයකින් ඒ භවත් ශ්‍රමණ බ්‍රාහ්මණයන්ගේ වචනය සත්‍ය නම්, භවතුන් කය බිඳී මරණින් පසු සුගතියක් වූ ස්වර්ග ලෝකයක උපදිනු ඇත. භවත්නි, යම් හෙයකින් ඔබලා කය බිඳී මරණින් පසු සුගතියක් වූ ස්වර්ග ලෝකයක උපදින්නේ නම්, එවිට මා වෙත පැමිණ දන්වන්න – ‘පරලොවක් තිබේ, ඕපපාතික සත්වයෝ සිටිති, හොඳ නරක කර්මවල ඵල විපාක තිබේ’ කියා. භවතුන් නම් මගේ විශ්වාසවන්ත අයයි, පිළිගත යුතු අයයි. භවතුන් විසින් යමක් දැක්කොත්, තමන් විසින්ම දුටුවාක් මෙන් එය සත්‍ය වනු ඇත’ කියා. ඔවුහු මට ‘එසේය’ කියා පිළිගෙන, මා වෙත පැමිණ දන්වන්නේද නැත, දූතයෙකු එවන්නේද නැත. පූජ්‍ය කස්සපයන් වහන්ස, මෙම ක්‍රමයත් තිබේ, යම් ක්‍රමයකින් මට මෙසේ සිතෙන ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල ඵල විපාක නැත’ කියායි.”",
      "paliTitle": ""
    },
    {
      "number": 415,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi. Upamāya midhekacce [upamāyapidhekacce (sī. syā.), upamāyapiidhekacce (pī.)] viññū purisā bhāsitassa atthaṃ ājānanti. Seyyathāpi, rājañña, puriso gūthakūpe sasīsakaṃ [sasīsako (syā.)] nimuggo assa. Atha tvaṃ purise āṇāpeyyāsi – ‘tena hi, bho, taṃ purisaṃ tamhā gūthakūpā uddharathā’ti. Te ‘sādhū’ti paṭissutvā taṃ purisaṃ tamhā gūthakūpā uddhareyyuṃ. Te tvaṃ evaṃ vadeyyāsi – ‘tena hi, bho, tassa purisassa kāyā veḷupesikāhi gūthaṃ sunimmajjitaṃ nimmajjathā’ti. Te ‘sādhū’ti paṭissutvā tassa purisassa kāyā veḷupesikāhi gūthaṃ sunimmajjitaṃ nimmajjeyyuṃ. Te tvaṃ evaṃ vadeyyāsi – ‘tena hi, bho, tassa purisassa kāyaṃ paṇḍumattikāya tikkhattuṃ subbaṭṭitaṃ ubbaṭṭethā’ti [suppaṭṭitaṃ uppaṭṭethāti (ka.)]. Te tassa purisassa kāyaṃ paṇḍumattikāya tikkhattuṃ subbaṭṭitaṃ ubbaṭṭeyyuṃ. Te tvaṃ evaṃ vadeyyāsi – ‘tena hi, bho, taṃ purisaṃ telena abbhañjitvā sukhumena cuṇṇena tikkhattuṃ suppadhotaṃ karothā’ti. Te taṃ purisaṃ telena abbhañjitvā sukhumena cuṇṇena tikkhattuṃ suppadhotaṃ kareyyuṃ. Te tvaṃ evaṃ vadeyyāsi – ‘tena hi, bho, tassa purisassa kesamassuṃ kappethā’ti. Te tassa purisassa kesamassuṃ kappeyyuṃ. Te tvaṃ evaṃ vadeyyāsi – ‘tena hi, bho, tassa purisassa mahagghañca mālaṃ mahagghañca vilepanaṃ mahagghāni ca vatthāni upaharathā’ti. Te tassa purisassa mahagghañca mālaṃ mahagghañca vilepanaṃ mahagghāni ca vatthāni upahareyyuṃ. Te tvaṃ evaṃ vadeyyāsi – ‘tena hi, bho, taṃ purisaṃ pāsādaṃ āropetvā pañcakāmaguṇāni upaṭṭhāpethā’ti. Te taṃ purisaṃ pāsādaṃ āropetvā pañcakāmaguṇāni upaṭṭhāpeyyuṃ. ‘‘Taṃ kiṃ maññasi, rājañña, api nu tassa purisassa sunhātassa suvilittassa sukappitakesamassussa āmukkamālābharaṇassa odātavatthavasanassa uparipāsādavaragatassa pañcahi kāmaguṇehi samappitassa samaṅgībhūtassa paricārayamānassa punadeva tasmiṃ gūthakūpe nimujjitukāmatā [nimujjitukāmyatā (syā. ka.)] assā’’ti? ‘‘No hidaṃ, bho kassapa’’. ‘‘Taṃ kissa hetu’’? ‘‘Asuci, bho kassapa, gūthakūpo asuci ceva asucisaṅkhāto ca duggandho ca duggandhasaṅkhāto ca jeguccho ca jegucchasaṅkhāto ca paṭikūlo ca paṭikūlasaṅkhāto cā’’ti. ‘‘Evameva kho, rājañña, manussā devānaṃ asucī ceva asucisaṅkhātā ca, duggandhā ca duggandhasaṅkhātā ca, jegucchā ca jegucchasaṅkhātā ca, paṭikūlā ca paṭikūlasaṅkhātā ca. Yojanasataṃ kho, rājañña, manussagandho deve ubbādhati. Kiṃ pana te mittāmaccā ñātisālohitā pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā pisuṇāya vācāya paṭiviratā pharusāya vācāya paṭiviratā samphappalāpā paṭiviratā anabhijjhālū abyāpannacittā sammādiṭṭhī, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā te āgantvā ārocessanti – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’ti? Imināpi kho te, rājañña, pariyāyena evaṃ hotu – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti.",
      "english": "Therefore, O noble one, I will give you a simile. By means of a simile, some wise people understand the meaning of what is said. Suppose, O noble one, there was a man submerged headfirst in a cesspit. Then you would order your men, saying, ‘Come, sirs, pull that man out of that cesspit.’ They, having assented, saying ‘Yes, sir,’ would pull that man out of that cesspit. Then you would tell them, ‘Come, sirs, thoroughly scrape the excrement from that man’s body with bamboo splinters.’ They, having assented, saying ‘Yes, sir,’ would thoroughly scrape the excrement from that man’s body with bamboo splinters. Then you would tell them, ‘Come, sirs, scrub that man’s body thoroughly three times with yellow clay.’ They would scrub that man’s body thoroughly three times with yellow clay. Then you would tell them, ‘Come, sirs, anoint that man with oil and wash him thoroughly three times with fine powder.’ They would anoint that man with oil and wash him thoroughly three times with fine powder. Then you would tell them, ‘Come, sirs, cut that man’s hair and beard.’ They would cut that man’s hair and beard. Then you would tell them, ‘Come, sirs, bring that man an expensive garland, an expensive perfume, and expensive clothes.’ They would bring that man an expensive garland, an expensive perfume, and expensive clothes. Then you would tell them, ‘Come, sirs, lead that man to the palace and provide him with the five strands of sensual pleasure.’ They would lead that man to the palace and provide him with the five strands of sensual pleasure.\n\nWhat do you think, O noble one, would that man, having been well-bathed, well-anointed, with hair and beard well-trimmed, adorned with garlands and ornaments, dressed in clean white clothes, having ascended to the top of the excellent palace, being endowed with and fully enjoying the five strands of sensual pleasure, wish to plunge into that cesspit again? Certainly not, Reverend Kassapa. Why is that? Because, Reverend Kassapa, a cesspit is impure and considered impure, foul-smelling and considered foul-smelling, repulsive and considered repulsive, disgusting and considered disgusting. Just so, O noble one, humans are impure and considered impure to devas, foul-smelling and considered foul-smelling, repulsive and considered repulsive, disgusting and considered disgusting. Indeed, O noble one, the human smell repels devas for a hundred leagues. What then, are your friends, ministers, relatives, and kinsmen—those who have abstained from taking life, abstained from taking what is not given, abstained from sexual misconduct, abstained from false speech, abstained from divisive speech, abstained from harsh speech, abstained from idle chatter, who are not covetous, whose minds are free from ill-will, who hold right view—who have been reborn after the dissolution of the body, subsequent to death, in a good destination, in the heavenly world—would they come and announce, ‘Indeed, there is another world, there are spontaneously arisen beings, there is fruit and result of good and bad actions’? By this line of reasoning too, O noble one, you should be convinced that ‘indeed, there is another world, there are spontaneously arisen beings, there is fruit and result of good and bad actions.’",
      "sinhala": "‘‘එසේ නම්, රාජන්‍යය, මම ඔබට උපමාවක් කියන්නම්. සමහර ඥානවන්ත පුද්ගලයෝ උපමාවකින් කියන ලද අර්ථය තේරුම් ගනිති. රාජන්‍යය, යම් සේ පුරුෂයෙක් අපවිත්‍ර වළක හිස තෙක් ගිලී සිටින්නේද, එවිට ඔබ මිනිසුන්ට අණ කරන්නේය – ‘එසේ නම්, භවත්නි, ඒ පුරුෂයා ඒ අපවිත්‍ර වළෙන් ගොඩගන්නැ’යි කියා. ඔවුහු ‘එසේය’යි පිළිගෙන ඒ පුරුෂයා ඒ අපවිත්‍ර වළෙන් ගොඩගන්නාහ. ඔබ ඔවුන්ට මෙසේ කියන්නේය – ‘එසේ නම්, භවත්නි, ඒ පුරුෂයාගේ ශරීරයෙන් උණ පතුරු වලින් මැනවින් අපවිත්‍ර දේ ඉවත් කරන්නැ’යි කියා. ඔවුහු ‘එසේය’යි පිළිගෙන ඒ පුරුෂයාගේ ශරීරයෙන් උණ පතුරු වලින් මැනවින් අපවිත්‍ර දේ ඉවත් කරනවා ඇත. ඔබ ඔවුන්ට මෙසේ කියන්නේය – ‘එසේ නම්, භවත්නි, ඒ පුරුෂයාගේ ශරීරය කහ මැටි වලින් තුන් වරක් මැනවින් පිරිසිදු කරන්නැ’යි කියා. ඔවුහු ඒ පුරුෂයාගේ ශරීරය කහ මැටි වලින් තුන් වරක් මැනවින් පිරිසිදු කරනවා ඇත. ඔබ ඔවුන්ට මෙසේ කියන්නේය – ‘එසේ නම්, භවත්නි, ඒ පුරුෂයා තෙලෙන් අභ්‍යංග කොට, සියුම් කුඩු වලින් තුන් වරක් මැනවින් සෝදා පිරිසිදු කරන්නැ’යි කියා. ඔවුහු ඒ පුරුෂයා තෙලෙන් අභ්‍යංග කොට, සියුම් කුඩු වලින් තුන් වරක් මැනවින් සෝදා පිරිසිදු කරනවා ඇත. ඔබ ඔවුන්ට මෙසේ කියන්නේය – ‘එසේ නම්, භවත්නි, ඒ පුරුෂයාගේ කෙස් රැවුල් කපන්නැ’යි කියා. ඔවුහු ඒ පුරුෂයාගේ කෙස් රැවුල් කපනවා ඇත. ඔබ ඔවුන්ට මෙසේ කියන්නේය – ‘එසේ නම්, භවත්නි, ඒ පුරුෂයාට අගනා මල් මාලාවක්ද, අගනා සුවඳ විලවුන්ද, අගනා වස්ත්‍රද ගෙන දෙන්නැ’යි කියා. ඔවුහු ඒ පුරුෂයාට අගනා මල් මාලාවක්ද, අගනා සුවඳ විලවුන්ද, අගනා වස්ත්‍රද ගෙන දෙනවා ඇත. ඔබ ඔවුන්ට මෙසේ කියන්නේය – ‘එසේ නම්, භවත්නි, ඒ පුරුෂයා ප්‍රාසාදයක් මතට නංවා, පස්කම් ගුණවලින් සත්කාර කරන්නැ’යි කියා. ඔවුහු ඒ පුරුෂයා ප්‍රාසාදයක් මතට නංවා, පස්කම් ගුණවලින් සත්කාර කරනවා ඇත.\n\nරාජන්‍යය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මැනවින් නාගත්, මැනවින් සුවඳ විලවුන් ගල්වාගත්, මැනවින් කෙස් රැවුල් කපාගත්, මල්මාලා ආභරණ පැලඳගත්, සුදු වස්ත්‍ර හැඳගත්, උතුම් ප්‍රාසාදයෙහි සිටිනා, පස්කම් ගුණයන්ගෙන් උපස්ථාන ලබමින් සිටිනා ඒ පුරුෂයාට නැවත ඒ අපවිත්‍ර වළටම කිමිදීමට කැමැත්තක් ඇති වේද?” “භවත් කාශ්‍යප, එසේ නොවන්නේය.” “එයට හේතුව කුමක්ද?” “භවත් කාශ්‍යප, අපවිත්‍ර වළ අපවිත්‍රය, අපවිත්‍ර යැයි සැලකේ. දුර්ගන්ධය, දුර්ගන්ධ යැයි සැලකේ. පිළිකුල්ය, පිළිකුල් යැයි සැලකේ. අප්‍රියය, අප්‍රිය යැයි සැලකේ.”\n\nරාජන්‍යය, ඒ අයුරින්ම මිනිස්සු දෙවියන්ට අපවිත්‍රය, අපවිත්‍ර යැයි සැලකේ. දුර්ගන්ධය, දුර්ගන්ධ යැයි සැලකේ. පිළිකුල්ය, පිළිකුල් යැයි සැලකේ. අප්‍රියය, අප්‍රිය යැයි සැලකේ. රාජන්‍යය, මිනිස් සුවඳ යොදුන් සියයක් ඈතට වුවත් දෙවියන්ට දුර්ගන්ධයක් වේ. එසේ නම්, රාජන්‍යය, ඔබේ මිත්‍රවරුන්, ඇමතිවරුන්, ඥාති සබඳයන්, ලේ ඥාතීන්, ප්‍රාණඝාතයෙන් වැළකුණු, අදත්තාදානයෙන් වැළකුණු, කාමමිථ්‍යාචාරයෙන් වැළකුණු, මුසාවාදයෙන් වැළකුණු, පිසුනු වචනයෙන් වැළකුණු, ඵරුෂ වචනයෙන් වැළකුණු, සම්ඵප්පලාපයෙන් වැළකුණු, අන් සතු දේට ආශා නොකරන, ව්‍යාපාද සිත් නැති, සම්මා දිට්ඨියෙන් යුක්තව, කය බිඳී මරණින් පසු සුගතිය, ස්වර්ග ලෝකයෙහි උපන් අය පැමිණ ඔබට කියාවිද – ‘පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, කරන ලද සුචරිත දුශ්චරිත කර්මයන්ගේ ඵල විපාක ඇත’ කියා? රාජන්‍යය, මේ කරුණෙනුත් ඔබට මෙසේ සිතෙන්නට ඉඩ හරින්න – ‘පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, කරන ලද සුචරිත දුශ්චරිත කර්මයන්ගේ ඵල විපාක ඇත’ කියා.”",
      "paliTitle": "Gūthakūpapurisaupamā",
      "englishTitle": "The Simile of the Man in the Dung Pit",
      "sinhalaTitle": "ගූථකූපපුරිසූපමා"
    },
    {
      "number": 416,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Atthi pana, rājañña, pariyāyo …pe… ‘‘atthi, bho kassapa, pariyāyo…pe… ``yathā kathaṃ viya, rājaññāti? ‘‘Idha me, bho kassapa, mittāmaccā ñātisālohitā pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā surāmerayamajjapamādaṭṭhānā paṭiviratā, te aparena samayena ābādhikā honti dukkhitā bāḷhagilānā. Yadāhaṃ jānāmi – ‘na dānime imamhā ābādhā vuṭṭhahissantī’ti tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘santi kho, bho, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ye te pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā surāmerayamajjapamādaṭṭhānā paṭiviratā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti devānaṃ tāvatiṃsānaṃ sahabyatanti. Bhavanto kho pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā surāmerayamajjapamādaṭṭhānā paṭiviratā. Sace tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ saccaṃ vacanaṃ, bhavanto kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissanti, devānaṃ tāvatiṃsānaṃ sahabyataṃ. Sace, bho, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyātha devānaṃ tāvatiṃsānaṃ sahabyataṃ, yena me āgantvā āroceyyātha – `itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipākoti. Bhavanto kho pana me saddhāyikā paccayikā, yaṃ bhavantehi diṭṭhaṃ, yathā sāmaṃ diṭṭhaṃ evametaṃ bhavissatīti. Te me ‘sādhū’ti paṭissutvā neva āgantvā ārocenti, na pana dūtaṃ pahiṇanti. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "\"Although Venerable Kassapa speaks thus, it still occurs to me like this: 'Indeed, there is no other world, there are no beings who are spontaneously born, there is no fruit or result of good and bad deeds.'\"\n\n\"Is there, O king, a way...?\"\n\n\"There is, Venerable Kassapa, a way...\"\n\n\"How is that, O king?\"\n\n\"Here, Venerable Kassapa, my friends, companions, relatives, and kin are abstaining from killing living beings, abstaining from taking what is not given, abstaining from sexual misconduct, abstaining from false speech, abstaining from intoxicants that cause negligence. Then, after some time, they become afflicted, suffering, and seriously ill. When I know, 'Now they will not recover from this illness,' I approach them and say thus: 'There are, good sirs, some ascetics and brahmins who speak thus, who hold such a view: \"Those who abstain from killing living beings, abstain from taking what is not given, abstain from sexual misconduct, abstain from false speech, abstain from intoxicants that cause negligence, upon the dissolution of the body, after death, are reborn in a good destination, in a heavenly world, in companionship with the Tāvatiṃsa gods.\" You, good sirs, are abstaining from killing living beings, abstaining from taking what is not given, abstaining from sexual misconduct, abstaining from false speech, abstaining from intoxicants that cause negligence. If what those ascetics and brahmins say is true, you, upon the dissolution of the body, after death, will be reborn in a good destination, in a heavenly world, in companionship with the Tāvatiṃsa gods. If, good sirs, upon the dissolution of the body, after death, you are reborn in a good destination, in a heavenly world, in companionship with the Tāvatiṃsa gods, you should come and inform me: \"Indeed, there is another world, there are beings who are spontaneously born, there is fruit and result of good and bad deeds.\" You, moreover, are trustworthy and reliable to me; what is seen by you, as seen by yourselves, will be so.' They, having promised me, 'Good,' neither come and inform me, nor do they send a messenger. This also, Venerable Kassapa, is a way, by which it occurs to me like this: 'Indeed, there is no other world, there are no beings who are spontaneously born, there is no fruit or result of good and bad deeds.'\"",
      "sinhala": "‘‘කස්සප ස්වාමීනි, ඔබ මෙසේ පවසන නමුදු, එහිලා මට මෙබඳු සිතුවිල්ලක් ඇති වේ: ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හා අයහපත් කර්මවල විපාකයක් නැත’ යනුයි.’’ ‘‘රාජාණෙනි, එහි යම් කරුණක් තිබේද? …පෙ…. ‘‘කස්සප ස්වාමීනි, එහි කරුණක් ඇත…පෙ… ``රාජාණෙනි, කෙසේ වැනිද? ‘‘කස්සප ස්වාමීනි, මෙහි මාගේ මිත්‍රයන්, ඇමතියන්, ඥාතීන්, ලේ ඥාතීන් ප්‍රාණඝාතයෙන් වැළකී, අදත්තාදානයෙන් වැළකී, කාමමිථ්‍යාචාරයෙන් වැළකී, මුසාවාදයෙන් වැළකී, සුරාමේරයමජ්ජපමාදට්ඨානයෙන් වැළකී සිටිති. පසු කලෙක ඔවුහු රෝගී වෙති, දුක්ඛිත වෙති, දැඩි ලෙස ගිලන් වෙති. ‘මොවුන් දැන් මේ රෝගයෙන් සුව නොවන්නේය’යි මම දන්නා විට, මම ඔවුන් වෙත එළඹ මෙසේ කියමි: ‘යම් අයෙක් ප්‍රාණඝාතයෙන් වැළකී, අදත්තාදානයෙන් වැළකී, කාමමිථ්‍යාචාරයෙන් වැළකී, මුසාවාදයෙන් වැළකී, සුරාමේරයමජ්ජපමාදට්ඨානයෙන් වැළකී සිටිත් ද, ඔවුහු කය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට, තාවතිංස දෙවියන්ගේ සහභාගීත්වයට පැමිණෙති’ යන මතයක් දරන ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ වෙති. ඔබලා ප්‍රාණඝාතයෙන් වැළකී, අදත්තාදානයෙන් වැළකී, කාමමිථ්‍යාචාරයෙන් වැළකී, මුසාවාදයෙන් වැළකී, සුරාමේරයමජ්ජපමාදට්ඨානයෙන් වැළකී සිටින්නහුය. ඒ ශ්‍රමණ බ්‍රාහ්මණයන්ගේ වචනය සත්‍ය නම්, ඔබලා කය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට, තාවතිංස දෙවියන්ගේ සහභාගීත්වයට පැමිණෙනු ඇත. ස්වාමීනි, ඔබලා කය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට, තාවතිංස දෙවියන්ගේ සහභාගීත්වයට පැමිණෙන්නේ නම්, මට පැමිණ මෙසේ දන්වන්න: ‘පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, යහපත් හා අයහපත් කර්මවල විපාකයක් ඇත’ යනුවෙනි. ඔබලා මාගේ විශ්වාසවන්තයෝය, පිළිගත යුත්තෝය. ඔබලා විසින් යමක් දකින ලද්දේ ද, තමන් විසින් ම දුටු ආකාරයෙන් ම මෙය වන්නේය. ‘එසේය’ යි ඔවුහු මට පිළිතුරු දී, පැමිණ දන්වන්නේ ද නැත, දූතයෙකු වත් එවන්නේ ද නැත. කස්සප ස්වාමීනි, මේ ද මා හට ඇති කරුණකි. යම් කරුණකින් මට මෙබඳු සිතුවිල්ලක් ඇති වේ: ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හා අයහපත් කර්මවල විපාකයක් නැත’ යනුයි.",
      "paliTitle": ""
    },
    {
      "number": 417,
      "pali": "‘‘Tena hi, rājañña, taññevettha paṭipucchissāmi; yathā te khameyya, tathā naṃ byākareyyāsi. Yaṃ kho pana, rājañña, mānussakaṃ vassasataṃ, devānaṃ tāvatiṃsānaṃ eso eko rattindivo [rattidivo (ka.)], tāya rattiyā tiṃsarattiyo māso, tena māsena dvādasamāsiyo saṃvaccharo, tena saṃvaccharena dibbaṃ vassasahassaṃ devānaṃ tāvatiṃsānaṃ āyuppamāṇaṃ. Ye te mittāmaccā ñātisālohitā pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā surāmerayamajjapamādaṭṭhānā paṭiviratā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā devānaṃ tāvatiṃsānaṃ sahabyataṃ. Sace pana tesaṃ evaṃ bhavissati – ‘yāva mayaṃ dve vā tīṇi vā rattindivā dibbehi pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārema, atha mayaṃ pāyāsissa rājaññassa gantvā āroceyyāma – ‘‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’ti. Api nu te āgantvā āroceyyuṃ – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti? ‘‘No hidaṃ, bho kassapa. Api hi mayaṃ, bho kassapa, ciraṃ kālaṅkatāpi bhaveyyāma. Ko panetaṃ bhoto kassapassa āroceti – ‘atthi devā tāvatiṃsā’ti vā ‘evaṃdīghāyukā devā tāvatiṃsā’ti vā. Na mayaṃ bhoto kassapassa saddahāma – ‘atthi devā tāvatiṃsā’ti vā ‘evaṃdīghāyukā devā tāvatiṃsā’ti vā’’ti. ",
      "english": "\"In that case, Royal One, I will question you on that very matter; answer as you see fit. Royal One, what is a hundred human years is one day and night for the gods of the Thirty-three. Thirty of those days make a month, twelve of those months make a year, and a thousand of those divine years is the life-span of the gods of the Thirty-three. Those friends, companions, relatives, and kin of yours who abstain from killing living beings, abstain from taking what is not given, abstain from sexual misconduct, abstain from false speech, abstain from intoxicants that cause negligence, upon the dissolution of the body, after death, have been reborn in a good destination, a heavenly world, into companionship with the gods of the Thirty-three. If they were to think, 'After we have spent two or three days and nights enjoying the divine five strands of sense pleasure, we will then go and inform King Pāyāsi, saying, \"Indeed, there is another world; there are beings who are reborn spontaneously; there is fruit and result of good and bad actions,\" would they come and inform you, saying, 'Indeed, there is another world; there are beings who are reborn spontaneously; there is fruit and result of good and bad actions'?\" \"No, Venerable Kassapa. Indeed, Venerable Kassapa, we would be long dead. Who informs Venerable Kassapa that 'there are gods of the Thirty-three,' or that 'the gods of the Thirty-three have such a long lifespan'? We do not believe Venerable Kassapa that 'there are gods of the Thirty-three,' or that 'the gods of the Thirty-three have such a long lifespan.'\"",
      "sinhala": "‘‘එසේ නම්, රාජඤ්ඤ, මම මේ ගැන ඔබෙන්ම විමසන්නෙමි; ඔබට රුචි පරිදි එය පැහැදිලි කරන්න. රාජඤ්ඤ, මිනිසුන්ගේ සියවසක් යනු දෙවියන්ගේ තාවතිංස ලෝකයේ එක් දවසක් හා රාත්‍රියකි. එම රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයක් වේ. එම මාසයෙන් මාස දොළහක් වසරක් වේ. එම වසරෙන් දිව්‍ය වසර දහසක් දෙවියන්ගේ තාවතිංස ලෝකයේ ආයුෂ ප්‍රමාණය වේ. ඔබගේ මිත්‍රයන්, ඇමැතියන්, ඥාතීන්, ලේ ඥාතීන්, ප්‍රාණඝාතයෙන් වැළකී, සොරකමින් වැළකී, කාමමිථ්‍යාචාරයෙන් වැළකී, බොරු කීමෙන් වැළකී, මත්පැනින් හා ප්‍රමාදයට හේතුවන දේවලින් වැළකී සිටින්නේ නම්, ඔවුන් මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට එනම් තාවතිංස දෙවියන්ගේ සහභාගීත්වයට පැමිණෙයි. ඔවුන්ට මෙවැනි අදහසක් ඇති වුවහොත්, ‘අපි දෙතුන් දවසක් දිව්‍යමය පංචකාම ගුණයන්ගෙන් පිරිපුන්ව, ඒකාත්මත්ව සතුටු වෙමු. ඉන්පසු පයාසි රජු වෙත ගොස් ‘පරලොවක් ඇත, උපතින්ම ඇතිවන සත්වයෝ ඇත, යහපත් හා අයහපත් කර්මවල විපාක ඇත’ යැයි දැන්වමු’ යැයි සිතුවොත්, ඔවුන් පැමිණ ‘පරලොවක් ඇත, උපතින්ම ඇතිවන සත්වයෝ ඇත, යහපත් හා අයහපත් කර්මවල විපාක ඇත’ යැයි ඔබට දන්වාවිද?” ‘‘නැත, භවත් කාශ්‍යපයෙනි. භවත් කාශ්‍යපයෙනි, අපි බොහෝ කාලයක් මියගිය අය වුවත් විය හැකිය. ‘තාවතිංස දෙවියෝ ඇත’ කියා හෝ ‘තාවතිංස දෙවියෝ මෙපමණ දීර්ඝායුෂ ඇත්තාහුය’ කියා හෝ ඔබ කාශ්‍යපයන්ට කවුරු පැවසුවාද? ‘තාවතිංස දෙවියෝ ඇත’ කියා හෝ ‘තාවතිංස දෙවියෝ මෙපමණ දීර්ඝායුෂ ඇත්තාහුය’ කියා හෝ අපි භවත් කාශ්‍යපයන්ව විශ්වාස නොකරමු.’’",
      "paliTitle": "Tāvatiṃsadevaupamā",
      "englishTitle": "The Simile of the Gods of Tāvatiṃsa",
      "sinhalaTitle": "තාවතිංස දෙව් උපමා"
    },
    {
      "number": 418,
      "pali": "‘‘Seyyathāpi, rājañña, jaccandho puriso na passeyya kaṇha – sukkāni rūpāni, na passeyya nīlakāni rūpāni, na passeyya pītakāni [mañjeṭṭhakāni (syā.)] rūpāni, na passeyya lohitakāni rūpāni, na passeyya mañjiṭṭhakāni rūpāni, na passeyya samavisamaṃ, na passeyya tārakāni rūpāni, na passeyya candimasūriye. So evaṃ vadeyya – ‘natthi kaṇhasukkāni rūpāni, natthi kaṇhasukkānaṃ rūpānaṃ dassāvī. Natthi nīlakāni rūpāni, natthi nīlakānaṃ rūpānaṃ dassāvī. Natthi pītakāni rūpāni, natthi pītakānaṃ rūpānaṃ dassāvī. Natthi lohitakāni rūpāni, natthi lohitakānaṃ rūpānaṃ dassāvī. Natthi mañjiṭṭhakāni rūpāni, natthi mañjiṭṭhakānaṃ rūpānaṃ dassāvī. Natthi samavisamaṃ, natthi samavisamassa dassāvī. Natthi tārakāni rūpāni, natthi tārakānaṃ rūpānaṃ dassāvī. Natthi candimasūriyā, natthi candimasūriyānaṃ dassāvī. Ahametaṃ na jānāmi, ahametaṃ na passāmi, tasmā taṃ natthī’ti. Sammā nu kho so, rājañña, vadamāno vadeyyā’’ti? ‘‘No hidaṃ, bho kassapa. Atthi kaṇhasukkāni rūpāni, atthi kaṇhasukkānaṃ rūpānaṃ dassāvī. Atthi nīlakāni rūpāni, atthi nīlakānaṃ rūpānaṃ dassāvī…pe… atthi samavisamaṃ, atthi samavisamassa dassāvī. Atthi tārakāni rūpāni, atthi tārakānaṃ rūpānaṃ dassāvī. Atthi candimasūriyā, atthi candimasūriyānaṃ dassāvī. ‘Ahametaṃ na jānāmi, ahametaṃ na passāmi, tasmā taṃ natthī’ti. Na hi so, bho kassapa, sammā vadamāno vadeyyā’’ti. ‘‘Evameva kho tvaṃ, rājañña, jaccandhūpamo maññe paṭibhāsi yaṃ maṃ tvaṃ evaṃ vadesi’’. ‘‘Ko panetaṃ bhoto kassapassa āroceti – ‘atthi devā tāvatiṃsā’’ti vā, ‘evaṃdīghāyukā devā tāvatiṃsā’ti vā? Na mayaṃ bhoto kassapassa saddahāma – ‘atthi devā tāvatiṃsā’ti vā ‘evaṃdīghāyukā devā tāvatiṃsā’ti vā’’ti. ‘‘Na kho, rājañña, evaṃ paro loko daṭṭhabbo, yathā tvaṃ maññasi iminā maṃsacakkhunā. Ye kho te rājañña samaṇabrāhmaṇā araññavanapatthāni pantāni senāsanāni paṭisevanti, te tattha appamattā ātāpino pahitattā viharantā dibbacakkhuṃ visodhenti. Te dibbena cakkhunā visuddhena atikkantamānusakena imaṃ ceva lokaṃ passanti parañca satte ca opapātike. Evañca kho, rājañña, paro loko daṭṭhabbo; natveva yathā tvaṃ maññasi iminā maṃsacakkhunā. Imināpi kho te, rājañña, pariyāyena evaṃ hotu – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti.",
      "english": "\"Just as, O king, a man born blind might not see black and white forms, might not see blue forms, might not see yellow forms, might not see red forms, might not see crimson forms, might not see straight and crooked, might not see the stars, might not see the moon and sun. And he might say this: ‘There are no black and white forms, there is no one who sees black and white forms. There are no blue forms, there is no one who sees blue forms. There are no yellow forms, there is no one who sees yellow forms. There are no red forms, there is no one who sees red forms. There are no crimson forms, there is no one who sees crimson forms. There is nothing straight and crooked, there is no one who sees straight and crooked. There are no stars, there is no one who sees the stars. There are no moon and sun, there is no one who sees the moon and sun. I do not know this, I do not see this, therefore it does not exist.’ In saying this, would he be speaking rightly, O king?\"\n\n\"No, venerable Kassapa. There are black and white forms, there are those who see black and white forms. There are blue forms, there are those who see blue forms. There are yellow forms, there are those who see yellow forms. There are red forms, there are those who see red forms. There are crimson forms, there are those who see crimson forms. There is straight and crooked, there are those who see straight and crooked. There are stars, there are those who see stars. There are moon and sun, there are those who see moon and sun. ‘I do not know this, I do not see this, therefore it does not exist.’ In saying this, he would not be speaking rightly, venerable Kassapa.\"\n\n\"Just so, O king, you seem to me like a person born blind, in that you speak to me thus.\"\n\n\"But who has informed venerable Kassapa that ‘there are gods of the Thirty-three’ or ‘the gods of the Thirty-three are of such and such long life’? We do not believe venerable Kassapa that ‘there are gods of the Thirty-three’ or ‘the gods of the Thirty-three are of such and such long life.’\"\n\n\"The next world, O king, is not to be seen in this way, as you suppose, with this physical eye. Those ascetics and brahmins, O king, who frequent secluded forest and woodland thickets, dwell there diligent, ardent, and resolute, and purify the divine eye. With the divine eye, thus purified and surpassing human vision, they see both this world and the next, and beings that are reborn spontaneously. In this way, O king, is the next world to be seen; not at all as you suppose, with this physical eye. Even by this line of reasoning, O king, it should be thus with you: ‘Thus indeed there is another world, there are beings reborn spontaneously, there is the fruit and result of deeds well done and ill done.'\"",
      "sinhala": "‘‘රජතුමනි, යම්සේ උපතින්ම අන්ධ වූ මිනිසෙක් කළු සුදු රූපයන් නොදකීද, නිල් පැහැති රූපයන් නොදකීද, කහ පැහැති රූපයන් නොදකීද, රතු පැහැති රූපයන් නොදකීද, තද රතු පැහැති රූපයන් නොදකීද, උස් පහත් දේ නොදකීද, තරු රූපයන් නොදකීද, හිරු සඳු නොදකීද, ඔහු මෙසේ කියයි. ‘කළු සුදු රූප නැත, කළු සුදු රූප දකින්නෙක් ද නැත. නිල් පැහැති රූප නැත, නිල් පැහැති රූප දකින්නෙක් ද නැත. කහ පැහැති රූප නැත, කහ පැහැති රූප දකින්නෙක් ද නැත. රතු පැහැති රූප නැත, රතු පැහැති රූප දකින්නෙක් ද නැත. තද රතු පැහැති රූප නැත, තද රතු පැහැති රූප දකින්නෙක් ද නැත. උස් පහත් දේ නැත, උස් පහත් දේ දකින්නෙක් ද නැත. තරු රූප නැත, තරු රූප දකින්නෙක් ද නැත. හිරු සඳු නැත, හිරු සඳු දකින්නෙක් ද නැත. මම මෙය නොදනිමි, මම මෙය නොදකිමි, එබැවින් එය නැතැ’යි කියයි. රජතුමනි, ඔහු එසේ කියමින් නිවැරදිව කතා කරයිදැ’’යි ඇසීය. ‘‘නැත, භවත් කාශ්‍යපයෙනි. කළු සුදු රූප ඇත, කළු සුදු රූප දකින්නෙක් ද ඇත. නිල් පැහැති රූප ඇත, නිල් පැහැති රූප දකින්නෙක් ද ඇත... උස් පහත් දේ ඇත, උස් පහත් දේ දකින්නෙක් ද ඇත. තරු රූප ඇත, තරු රූප දකින්නෙක් ද ඇත. හිරු සඳු ඇත, හිරු සඳු දකින්නෙක් ද ඇත. ‘මම මෙය නොදනිමි, මම මෙය නොදකිමි, එබැවින් එය නැතැ’යි කියයි නම්, භවත් කාශ්‍යපයෙනි, ඔහු නිවැරදිව කතා කරන්නෙක් නොවෙයි’’ කීහ.\n\n‘‘රජතුමනි, එපරිද්දෙන්ම ඔබ උපතින්ම අන්ධ වූවකු වැනිය. ඔබ මා හට එසේ කියන්නේ එබැවිනි’’. ‘‘භවත් කාශ්‍යපයන් වහන්සේට ‘තව්තිසා දෙවියෝ ඇත’ කියා හෝ ‘තව්තිසා දෙවියෝ මෙපමණ දීර්ඝායුෂ ඇත්තෝය’ කියා හෝ කවුරුන් කීවද? භවත් කාශ්‍යපයන් වහන්සේට ‘තව්තිසා දෙවියෝ ඇත’ කියා හෝ ‘තව්තිසා දෙවියෝ මෙපමණ දීර්ඝායුෂ ඇත්තෝය’ කියා හෝ අපි විශ්වාස නොකරමු’’ කීහ. ‘‘රජතුමනි, ඔබ සිතන ආකාරයට මේ මාංසමය ඇසින් පරලොව දැකිය නොහැකිය. රජතුමනි, යම් ශ්‍රමණ බ්‍රාහ්මණයෝ අරණ්‍යවල වනයන්හි හුදෙකලා වූ විවේකී ආසනයන්හි වාසය කරත්ද, ඔවුහු එහිදී අප්‍රමාදීව වීර්යය වඩමින් මනස මෙහෙයවා දිව්‍යමය ඇස පිරිසිදු කර ගනිති. ඔවුහු පිරිසිදු වූ මනුෂ්‍ය ඇස ඉක්මවූ දිව්‍යමය ඇසින් මේ ලෝකයත් පරලොවත්, උපතින්ම දිව්‍ය වූ සත්ත්වයනුත් දකිති. රජතුමනි, පරලොව දැකිය යුත්තේ එලෙසය. ඔබ සිතන ආකාරයට මේ මාංසමය ඇසින් දැකිය නොහැකිය. රජතුමනි, මේ ආකාරයෙන් වුවද ඔබට ‘පරලොව ඇත, උපතින්ම දිව්‍ය වූ සත්වයෝ ඇත, හොඳ නරක කර්මවල විපාක ඇත’ යන්න සිදුවිය යුතුය’’.",
      "paliTitle": "Jaccandhaupamā",
      "englishTitle": "The Simile of the Blind-Born",
      "sinhalaTitle": "ජාත්‍යන්ධ උපමා"
    },
    {
      "number": 419,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’ti. ‘‘Atthi pana, rājañña, pariyāyo…pe… atthi, bho kassapa, pariyāyo…pe… yathā kathaṃ viya, rājaññā’’ti? ‘‘Idhāhaṃ, bho kassapa, passāmi samaṇabrāhmaṇe sīlavante kalyāṇadhamme jīvitukāme amaritukāme sukhakāme dukkhapaṭikūle. Tassa mayhaṃ, bho kassapa, evaṃ hoti – sace kho ime bhonto samaṇabrāhmaṇā sīlavanto kalyāṇadhammā evaṃ jāneyyuṃ – ‘ito no matānaṃ seyyo bhavissatī’ti. Idānime bhonto samaṇabrāhmaṇā sīlavanto kalyāṇadhammā visaṃ vā khādeyyuṃ, satthaṃ vā āhareyyuṃ, ubbandhitvā vā kālaṅkareyyuṃ, papāte vā papateyyuṃ. Yasmā ca kho ime bhonto samaṇabrāhmaṇā sīlavanto kalyāṇadhammā na evaṃ jānanti – ‘ito no matānaṃ seyyo bhavissatī’ti, tasmā ime bhonto samaṇabrāhmaṇā sīlavanto kalyāṇadhammā jīvitukāmā amaritukāmā sukhakāmā dukkhapaṭikūlā attānaṃ na mārenti [( ) natthi (syā. pī.)]. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "\"Even though the venerable Kassapa says this, it still occurs to me: 'Indeed, there is no other world, there are no beings who are reborn spontaneously, there is no fruit or result of good or bad actions.'\"\n\n\"Is there, royal one, a way...?\" \"There is, venerable Kassapa, a way...\" \"How is that, royal one?\"\n\n\"Here, venerable Kassapa, I see ascetics and Brahmins who are virtuous, of good character, desiring to live, desiring not to die, desiring happiness, averse to suffering. It occurs to me, venerable Kassapa: 'If these venerable ascetics and Brahmins, virtuous and of good character, knew that 'after death, it will be better for us,' then these venerable ascetics and Brahmins, virtuous and of good character, would either eat poison, or take a weapon, or hang themselves and die, or throw themselves into a ravine.' But because these venerable ascetics and Brahmins, virtuous and of good character, do not know that 'after death, it will be better for us,' therefore these venerable ascetics and Brahmins, virtuous and of good character, desiring to live, desiring not to die, desiring happiness, averse to suffering, do not kill themselves. This too, venerable Kassapa, is a way by which it occurs to me: 'Indeed, there is no other world, there are no beings who are reborn spontaneously, there is no fruit or result of good or bad actions.'\"",
      "sinhala": "‘‘කස්සප භවත මෙසේ පැවසුවද, මට මෙහි මෙවැනි හැඟීමක් ඇති වේ: ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හා අයහපත් කර්මවල විපාක නැත’ යනුවෙනි.’’ ‘‘රාජඤ්ඤ, එසේ වීමට කරුණක් තිබේද? ...පෙ... කස්සප භවත, එසේ වීමට කරුණක් තිබේද? ...පෙ... රාජඤ්ඤ, ඒ කෙසේද?’’ ‘‘කස්සප භවත, මෙහිලා මම සිල්වත්, යහපත් ගුණ ඇති, ජීවත් වීමට කැමති, නොමැරී සිටීමට කැමති, සැප කැමති, දුකට අකමැති ශ්‍රමණ බ්‍රාහ්මණයන් දකිමි. කස්සප භවත, මට මෙවැනි හැඟීමක් ඇති වේ: ‘මේ සිල්වත්, යහපත් ගුණ ඇති ශ්‍රමණ බ්‍රාහ්මණයන් ‘මැරුණායින් පසුව අපට යහපතක් වේවි’ යැයි දැන සිටියා නම්, දැන් මේ සිල්වත්, යහපත් ගුණ ඇති ශ්‍රමණ බ්‍රාහ්මණයන් වස කෑමට හෝ ආයුධවලින් තුවාල කර ගැනීමට හෝ ගෙල වැළලාගෙන මැරීමට හෝ හෙලකට වැටීමට හෝ පෙළඹෙනු ඇත. නමුත් මේ සිල්වත්, යහපත් ගුණ ඇති ශ්‍රමණ බ්‍රාහ්මණයන් ‘මැරුණායින් පසුව අපට යහපතක් වේවි’ යැයි නොදන්නා හෙයින්, මේ සිල්වත්, යහපත් ගුණ ඇති ශ්‍රමණ බ්‍රාහ්මණයන් ජීවත් වීමට කැමතිව, නොමැරී සිටීමට කැමතිව, සැප කැමතිව, දුකට අකමැතිව තමාව මරා නොගනිති. කස්සප භවත, මේ කරුණ නිසාද මට මෙවැනි හැඟීමක් ඇති වේ: ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හා අයහපත් කර්මවල විපාක නැත’ යනුවෙනි.’’",
      "paliTitle": ""
    },
    {
      "number": 420,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Bhūtapubbaṃ, rājañña, aññatarassa brāhmaṇassa dve pajāpatiyo ahesuṃ. Ekissā putto ahosi dasavassuddesiko vā dvādasavassuddesiko vā, ekā gabbhinī upavijaññā. Atha kho so brāhmaṇo kālamakāsi. Atha kho so māṇavako mātusapattiṃ [mātusapatiṃ (syā.)] etadavoca – ‘yamidaṃ, bhoti, dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā, sabbaṃ taṃ mayhaṃ; natthi tuyhettha kiñci. Pitu me [pitu me santako (syā.)] bhoti, dāyajjaṃ niyyādehī’ti [nīyyātehīti (sī. pī.)]. Evaṃ vutte sā brāhmaṇī taṃ māṇavakaṃ etadavoca – ‘āgamehi tāva, tāta, yāva vijāyāmi. Sace kumārako bhavissati, tassapi ekadeso bhavissati; sace kumārikā bhavissati, sāpi te opabhoggā [upabhoggā (syā.)] bhavissatī’ti. Dutiyampi kho so māṇavako mātusapattiṃ etadavoca – ‘yamidaṃ, bhoti, dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā, sabbaṃ taṃ mayhaṃ; natthi tuyhettha kiñci. Pitu me, bhoti, dāyajjaṃ niyyādehī’ti. Dutiyampi kho sā brāhmaṇī taṃ māṇavakaṃ etadavoca – ‘āgamehi tāva, tāta, yāva vijāyāmi. Sace kumārako bhavissati, tassapi ekadeso bhavissati; sace kumārikā bhavissati sāpi te opabhoggā [upabhoggā (syā.)] bhavissatī’ti. Tatiyampi kho so māṇavako mātusapattiṃ etadavoca – ‘yamidaṃ, bhoti, dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā, sabbaṃ taṃ mayhaṃ; natthi tuyhettha kiñci. Pitu me, bhoti, dāyajjaṃ niyyādehī’ti. ‘‘Atha kho sā brāhmaṇī satthaṃ gahetvā ovarakaṃ pavisitvā udaraṃ opādesi [uppātesi (syā.)] – ‘yāva vijāyāmi yadi vā kumārako yadi vā kumārikā’ti. Sā attānaṃ ceva jīvitañca gabbhañca sāpateyyañca vināsesi. Yathā taṃ bālā abyattā anayabyasanaṃ āpannā ayoniso dāyajjaṃ gavesantī, evameva kho tvaṃ, rājañña, bālo abyatto anayabyasanaṃ āpajjissasi ayoniso paralokaṃ gavesanto; seyyathāpi sā brāhmaṇī bālā abyattā anayabyasanaṃ āpannā ayoniso dāyajjaṃ gavesantī. Na kho, rājañña, samaṇabrāhmaṇā sīlavanto kalyāṇadhammā apakkaṃ paripācenti; api ca paripākaṃ āgamenti. Paṇḍitānaṃ attho hi, rājañña, samaṇabrāhmaṇānaṃ sīlavantānaṃ kalyāṇadhammānaṃ jīvitena. Yathā yathā kho, rājañña, samaṇabrāhmaṇā sīlavanto kalyāṇadhammā ciraṃ dīghamaddhānaṃ tiṭṭhanti, tathā tathā bahuṃ puññaṃ pasavanti, bahujanahitāya ca paṭipajjanti bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Imināpi kho te, rājañña, pariyāyena evaṃ hotu – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti.",
      "english": "\"Then, your majesty, I will give you a simile. Here, some intelligent people understand the meaning of what is said through a simile. Once, your majesty, a certain brahmin had two wives. One had a son who was about ten or twelve years old, and the other was pregnant, close to giving birth. Then that brahmin died. Then that boy said to his stepmother, 'Whatever there is, lady, whether wealth or grain or silver or gold, all of it is mine; you have no share in it. Lady, give me my inheritance from my father.' When this was said, that brahmin woman said to the boy, 'Wait a little, dear, until I give birth. If it is a boy, he too will have a share; if it is a girl, she will be yours to enjoy.' A second time, that boy said to his stepmother, 'Whatever there is, lady, whether wealth or grain or silver or gold, all of it is mine; you have no share in it. Lady, give me my inheritance from my father.' A second time, that brahmin woman said to the boy, 'Wait a little, dear, until I give birth. If it is a boy, he too will have a share; if it is a girl, she will be yours to enjoy.' A third time, that boy said to his stepmother, 'Whatever there is, lady, whether wealth or grain or silver or gold, all of it is mine; you have no share in it. Lady, give me my inheritance from my father.'\"\n\n\"Then that brahmin woman, taking a knife, went into her private room and cut open her belly, thinking, 'I will give birth, be it a boy or a girl.' She destroyed herself and her life and the fetus and her claim to the inheritance. Just as that foolish, unwise woman met with disaster, searching for an inheritance in the wrong way, so too, your majesty, you, being foolish and unwise, will meet with disaster, searching for the next world in the wrong way, just like that foolish, unwise brahmin woman who met with disaster, searching for an inheritance in the wrong way. Indeed, your majesty, monks and brahmins who are virtuous and of good character do not prematurely ripen what is unripe; rather, they bring it to maturity. For the wise, your majesty, there is a purpose in the life of monks and brahmins who are virtuous and of good character. The longer that monks and brahmins who are virtuous and of good character live, the more merit they generate, and they act for the welfare of many, for the happiness of many, out of compassion for the world, for the benefit, welfare, and happiness of gods and humans. In this way too, your majesty, you may have it be so: 'Indeed, there is another world, there are beings who are reborn spontaneously, there is fruit and result of good and bad deeds.'\"",
      "sinhala": "‘‘එසේ නම්, රාජඤ්ඤ, මම ඔබට උපමාවක් කරන්නෙමි. නුවණැති ඇතැම් පුරුෂයෝ මෙහි උපමාවකින් කියන ලද දෙයෙහි අර්ථය දනිති. රාජඤ්ඤ, පෙර කලෙක එක්තරා බ්‍රාහ්මණයෙකුට භාර්යාවන් දෙදෙනෙක් සිටියාහු. එක් භාර්යාවකට දස වසරක් හෝ දොළොස් වසරක් පමණ වයසැති පුතෙක් සිටියේ ය, අනෙක් බිරිඳ ගැබ්ගෙන සිටින බව දැනගන්නට ලැබුණි. අනතුරුව එම බ්‍රාහ්මණයා මිය ගියේ ය. එවිට එම කුඩා පුතා මවගේ ප්‍රතිවාදියාට මෙසේ කීවේ ය: ‘මෙහි ඇති ධනය, ධාන්‍ය, රිදී හෝ රන් සියල්ල මගේ ය; එහි ඔබට කිසිවක් නැත. මගේ පියා සතු දායාදය මට දෙන්න.’ මෙසේ කී විට එම බ්‍රාහ්මණිය එම කුඩා පුතාට මෙසේ කීවා ය: ‘පුත, මම දරුවෙකු වදන්නා තෙක් ඉවසන්න. පුතෙකු වුවහොත් ඔහුටත් කොටසක් ලැබෙනු ඇත; දුවක් වුවහොත් ඇය ද ඔබට පරිභෝග කිරීමට ලැබෙනු ඇත.’ දෙවන වරට ද එම කුඩා පුතා මවගේ ප්‍රතිවාදියාට මෙසේ කීවේ ය: ‘මෙහි ඇති ධනය, ධාන්‍ය, රිදී හෝ රන් සියල්ල මගේ ය; එහි ඔබට කිසිවක් නැත. මගේ පියා සතු දායාදය මට දෙන්න.’ දෙවන වරට ද එම බ්‍රාහ්මණිය එම කුඩා පුතාට මෙසේ කීවා ය: ‘පුත, මම දරුවෙකු වදන්නා තෙක් ඉවසන්න. පුතෙකු වුවහොත් ඔහුටත් කොටසක් ලැබෙනු ඇත; දුවක් වුවහොත් ඇය ද ඔබට පරිභෝග කිරීමට ලැබෙනු ඇත.’ තුන්වන වරට ද එම කුඩා පුතා මවගේ ප්‍රතිවාදියාට මෙසේ කීවේ ය: ‘මෙහි ඇති ධනය, ධාන්‍ය, රිදී හෝ රන් සියල්ල මගේ ය; එහි ඔබට කිසිවක් නැත. මගේ පියා සතු දායාදය මට දෙන්න.’\n\n‘‘එවිට එම බ්‍රාහ්මණිය පිහියක් ගෙන කාමරයකට ඇතුළු වී ‘මම දරුවෙකු වදන්නා තෙක්, පුතෙකු හෝ දුවක වේවා’යි සිතා උදරය පලා ගත්තා ය. ඇය තමාගේ ජීවිතය, ගර්භය සහ දායාදය යන සියල්ල විනාශ කර ගත්තා ය. ඒ මෝඩ කාන්තාව නොසැලකිලිමත් ලෙස විපතට පත් වී අයථා ලෙස දායාදය සෙවූවාක් මෙන්, රාජඤ්ඤ, ඔබ ද මෝඩයෙක් සහ නොසැලකිලිමත් අයෙක් වී අයථා ලෙස පරලොව සොයමින් විපතට පත් වනු ඇත; ඒ බ්‍රාහ්මණිය මෝඩ ලෙස නොසැලකිලිමත් වී අයථා ලෙස දායාදය සෙවීම වැනිය. රාජඤ්ඤ, සිල්වත් ගුණවත් ශ්‍රමණ බ්‍රාහ්මණයන් නොපැසුණු දේ පසවන්නේ නැත; එහෙත් පරිණත භාවය අපේක්ෂා කරති. රාජඤ්ඤ, සිල්වත් ගුණවත් ශ්‍රමණ බ්‍රාහ්මණයන්ගේ ජීවිතය ප්‍රඥාවන්තයින්ට යහපතකි. රාජඤ්ඤ, සිල්වත් ගුණවත් ශ්‍රමණ බ්‍රාහ්මණයන් කොපමණ කාලයක් ජීවත් වේ ද, ඔවුන් එතරම්ම පින් රැස් කරගෙන බොහෝ දෙනාගේ යහපත උදෙසා ද බොහෝ දෙනාගේ සතුට උදෙසා ද ලෝකයා කෙරෙහි අනුකම්පාවෙන් දෙවියන්ට සහ මිනිසුන්ට වැඩ පිණිස, හිත සුව පිණිස කටයුතු කරති. රාජඤ්ඤ, මේ ආකාරයෙන් ද ‘පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, සුකෘත දුෂ්කෘත කර්මවල විපාක ඇත’ යන අදහස ඔබට ඇති වේවා.’’",
      "paliTitle": "Gabbhinīupamā",
      "englishTitle": "The Simile of the Pregnant Woman",
      "sinhalaTitle": "ගබ්බිනී උපමා"
    },
    {
      "number": 421,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Atthi pana, rājañña, pariyāyo…pe… atthi, bho kassapa, pariyāyo…pe… yathā kathaṃ viya, rājaññā’’ti? ‘‘Idha me, bho kassapa, purisā coraṃ āgucāriṃ gahetvā dassenti – ‘ayaṃ te, bhante, coro āgucārī; imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’ti. Tyāhaṃ evaṃ vadāmi – ‘tena hi, bho, imaṃ purisaṃ jīvantaṃyeva kumbhiyā pakkhipitvā mukhaṃ pidahitvā allena cammena onandhitvā allāya mattikāya bahalāvalepanaṃ [bahalavilepanaṃ (syā. ka.)] karitvā uddhanaṃ āropetvā aggiṃ dethā’ti. Te me ‘sādhū’ti paṭissutvā taṃ purisaṃ jīvantaṃyeva kumbhiyā pakkhipitvā mukhaṃ pidahitvā allena cammena onandhitvā allāya mattikāya bahalāvalepanaṃ karitvā uddhanaṃ āropetvā aggiṃ denti. Yadā mayaṃ jānāma ‘kālaṅkato so puriso’ti, atha naṃ kumbhiṃ oropetvā ubbhinditvā mukhaṃ vivaritvā saṇikaṃ nillokema [vilokema (syā.)] – ‘appeva nāmassa jīvaṃ nikkhamantaṃ passeyyāmā’ti. Nevassa mayaṃ jīvaṃ nikkhamantaṃ passāma. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "\"Even though Master Kassapa says this, it still occurs to me like this: 'Indeed, there is no afterlife, there are no beings who are spontaneously born, there is no fruit or result of good or bad actions.'\" \"Is there, royal one, a way…? Is there, Master Kassapa, a way…? How is it, royal one?\" \"Here, Master Kassapa, men seize a thief, an evildoer, and show him to me, saying, 'This, sir, is a thief, an evildoer; impose on him whatever penalty you wish.' Then I say this: 'Then, sirs, put this man alive into a pot, cover his mouth, bind it with wet leather, make a thick coating of wet clay, place it on a fire stand, and light a fire.' They, agreeing with me, put that man alive into a pot, cover his mouth, bind it with wet leather, make a thick coating of wet clay, place it on a fire stand, and light a fire. When we know, 'That man has died,' then, taking the pot down and breaking it open, we open the mouth and carefully look in—'Perhaps we might see his life escaping.' But we do not see his life escaping. This too, Master Kassapa, is a way, by which it occurs to me like this: 'Indeed, there is no afterlife, there are no beings who are spontaneously born, there is no fruit or result of good or bad actions.'\"",
      "sinhala": "‘‘කස්සප භවත් මෙසේ කීවත්, එහිලා මට මෙබඳු හැඟීමක් ඇති වේ: ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල විපාක නැත’ කියායි.’’ ‘‘රාජඤ්ඤයෙනි, යම් කරුණක් තිබේද?... කස්සප භවත්නි, යම් කරුණක් තිබේද?... රාජඤ්ඤයෙනි, එය කෙසේද?’’ ‘‘කස්සප භවත්නි, මෙහිදී මාගේ සේවකයෝ සොරකම් කරන සොරුන් අල්ලාගෙන මා වෙත පැමිණෙති. ‘ස්වාමීනි, මේ ඔබගේ සොරාය, වැරදි කළ අයෙකි. මොහුට ඔබ කැමති දඬුවමක් දෙන්නැ’යි කියති. එවිට මම මෙසේ කියමි: ‘එසේ නම්, පින්වතුනි, මේ මිනිසා ජීවත්ව සිටියදීම කළයක දමා, මුඛය වසා, තෙත් හම්වලින් ආවරණය කර, තෙත් මැටිවලින් තදින් ආලේප කර, ළිප උඩ තබා ගිනි දල්වන්නැ’යි කියමි. ඔවුහු ‘එසේය’යි පිළිතුරු දී, ඒ මිනිසා ජීවත්ව සිටියදීම කළයක දමා, මුඛය වසා, තෙත් හම්වලින් ආවරණය කර, තෙත් මැටිවලින් තදින් ආලේප කර, ළිප උඩ තබා ගිනි දල්වති. ‘ඒ මිනිසා මිය ගියා’යි අප දැනගත් පසු, අපි ඒ කළය බිම බා, බිඳ විවෘත කර, සෙමින් ඇතුළත බලමු. ‘සමහර විට ඔහුගේ ජීවිතය පිටතට එනවා දකින්නට හැකි වේදැ’යි සිතමිනි. අපට ඔහුගේ ජීවිතය පිටතට එනවා දකින්නට නොලැබේ. කස්සප භවත්නි, පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල විපාක නැත යන හැඟීම ඇතිවීමට මෙයද මා සතුව ඇති තවත් කරුණකි.’’",
      "paliTitle": ""
    },
    {
      "number": 422,
      "pali": "‘‘Tena hi, rājañña, taññevettha paṭipucchissāmi, yathā te khameyya, tathā naṃ byākareyyāsi. Abhijānāsi no tvaṃ, rājañña, divā seyyaṃ upagato supinakaṃ passitā ārāmarāmaṇeyyakaṃ vanarāmaṇeyyakaṃ bhūmirāmaṇeyyakaṃ pokkharaṇīrāmaṇeyyaka’’nti? ‘‘Abhijānāmahaṃ, bho kassapa, divāseyyaṃ upagato supinakaṃ passitā ārāmarāmaṇeyyakaṃ vanarāmaṇeyyakaṃ bhūmirāmaṇeyyakaṃ pokkharaṇīrāmaṇeyyaka’’nti. ‘‘Rakkhanti taṃ tamhi samaye khujjāpi vāmanakāpi velāsikāpi [celāvikāpi (syā.), keḷāyikāpi (sī.)] komārikāpī’’ti? ‘‘Evaṃ, bho kassapa, rakkhanti maṃ tamhi samaye khujjāpi vāmanakāpi velāsikāpi [celāvikāpi (syā.), keḷāyikāpi (sī.)] komārikāpī’’ti. ‘‘Api nu tā tuyhaṃ jīvaṃ passanti pavisantaṃ vā nikkhamantaṃ vā’’ti? ‘‘No hidaṃ, bho kassapa’’. ‘‘Tā hi nāma, rājañña, tuyhaṃ jīvantassa jīvantiyo jīvaṃ na passissanti pavisantaṃ vā nikkhamantaṃ vā. Kiṃ pana tvaṃ kālaṅkatassa jīvaṃ passissasi pavisantaṃ vā nikkhamantaṃ vā. Imināpi kho te, rājañña, pariyāyena evaṃ hotu – ‘‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti.",
      "english": "\"Then, Rajanna, I will ask you about that very thing; answer as it seems fit to you. Do you recall, Rajanna, having taken a midday rest and seeing in a dream delightful gardens, delightful groves, delightful ground, and delightful lotus ponds?\" \"Yes, venerable Kassapa, I recall having taken a midday rest and seeing in a dream delightful gardens, delightful groves, delightful ground, and delightful lotus ponds.\" \"And at that time, were you guarded by hunchbacks, dwarfs, attendants, or young girls?\" \"Yes, venerable Kassapa, at that time I was guarded by hunchbacks, dwarfs, attendants, or young girls.\" \"And did they see your life entering or leaving?\" \"No, venerable Kassapa.\" \"So then, Rajanna, while you are alive, living people do not see your life entering or leaving. How then, when you are dead, will you see life entering or leaving? By this method too, Rajanna, it may be so for you—'Thus, there is another world; there are beings born spontaneously; there is fruit and result of good and bad deeds.'\"",
      "sinhala": "‘‘එසේ නම්, රාජඤ්ඤ, මම ඔබගෙන්ම ඒ ගැන විමසන්නම්. ඔබට රිසි පරිදි එය පැහැදිලි කරන්න. රාජඤ්ඤ, ඔබ දවාලේ සැතපී සිහිනයක් දකින විට මනරම් උයන්, මනරම් වන, මනරම් භූමි, මනරම් පොකුණු දුටු බව මතකද?’’ ‘‘එසේය, භවත් කාශ්‍යප, මට මතකය. මම දවාලේ සැතපී සිහිනයක් දකින විට මනරම් උයන්, මනරම් වන, මනරම් භූමි, මනරම් පොකුණු දුටුවෙමි.’’ ‘‘ඒ මොහොතේ කුදු වූවන්, වාමනයන්, වේලාසිකාවන්, කුමාරිකාවන් ඔබ ආරක්ෂා කරනවාද?’’ ‘‘එසේය, භවත් කාශ්‍යප, ඒ මොහොතේ කුදු වූවන්, වාමනයන්, වේලාසිකාවන්, කුමාරිකාවන් මාව ආරක්ෂා කරති.’’ ‘‘ඔවුන් ඔබේ ජීවය ඇතුළට යනවා හෝ පිටතට එනවා දකිනවාද?’’ ‘‘නැත, භවත් කාශ්‍යප.’’ ‘‘රාජඤ්ඤ, ඔබ ජීවත්ව සිටියදීම ඔවුන්ට ඔබේ ජීවය ඇතුළට යනවා හෝ පිටතට එනවා දැකගැනීමට නොහැකියි. ඔබ මිය ගියායින් පසු ඔබේ ජීවය ඇතුළට යනවා හෝ පිටතට එනවා දකින්න ඔබ බලාපොරොත්තු වෙනවාද? රාජඤ්ඤ, මේ ආකාරයෙන්ද ඔබට මෙසේ සිතිය හැකියි – ‘මෙසේ පරලොවක් ඇත, ඕපපාතික සත්වයෝ ඇත, සුකෘත හා දුෂ්කෘත කර්මයන්ගේ ඵල විපාක ඇත’ යැයි.’’",
      "paliTitle": "Supinakaupamā",
      "englishTitle": "The Simile of Dreams",
      "sinhalaTitle": "සුපිනක උපමා"
    },
    {
      "number": 423,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Atthi pana, rājañña, pariyāyo…pe… ‘‘atthi, bho kassapa, pariyāyo…pe… yathā kathaṃ viya rājaññā’’ti? ‘‘Idha me, bho kassapa, purisā coraṃ āgucāriṃ gahetvā dassenti – ‘ayaṃ te, bhante, coro āgucārī; imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’ti. Tyāhaṃ evaṃ vadāmi – ‘tena hi, bho, imaṃ purisaṃ jīvantaṃyeva tulāya tuletvā jiyāya anassāsakaṃ māretvā punadeva tulāya tulethā’ti. Te me ‘sādhū’ti paṭissutvā taṃ purisaṃ jīvantaṃyeva tulāya tuletvā jiyāya anassāsakaṃ māretvā punadeva tulāya tulenti. Yadā so jīvati, tadā lahutaro ca hoti mudutaro ca kammaññataro ca. Yadā pana so kālaṅkato hoti tadā garutaro ca hoti patthinnataro ca akammaññataro ca. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "\"Even though the esteemed Kassapa says this, it still occurs to me in this way: 'Indeed, there is no other world, there are no beings who are spontaneously born, there is no fruit or result of good or bad actions.'\"\n\n\"Is there, royal sir, a way...\"\n\n\"There is, esteemed Kassapa, a way...how is that, royal sir?\"\n\n\"Here, esteemed Kassapa, my men apprehend a thief, a wrongdoer, and show him to me, saying, 'This, sir, is a thief, a wrongdoer; inflict on him whatever penalty you wish.' Then I say to them, 'In that case, sirs, weigh this man on the scales while he is still alive, then kill him without allowing him to breathe, and then weigh him again on the scales.' They agree, saying, 'Very well,' and weighing that man on the scales while he is still alive, they kill him without allowing him to breathe, and then they weigh him again on the scales. When he is alive, he is lighter, more pliable, and more workable. But when he has died, he is heavier, stiffer, and less workable. This too, esteemed Kassapa, is a way, by which it occurs to me in this way: 'Indeed, there is no other world, there are no beings who are spontaneously born, there is no fruit or result of good or bad actions.'\"",
      "sinhala": "‘‘කස්සප භවත් මෙසේ කීවද, එහෙත් මට මෙහි මෙසේ සිතේ – ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල ඵල විපාක නැත’ කියායි.’’ ‘‘රාජාණෙනි, ඒ සඳහා කරුණක් තිබේද…පෙ… ‘‘කස්සප භවත, කරුණක් ඇත…පෙ… රාජාණෙනෙනි, කෙසේ මෙන්ද?’’ ‘‘කස්සප භවත, මෙහි මාගේ මිනිසුන් වැරදි කරන සොරෙකු අල්ලාගෙනවිත්, ‘ස්වාමීනි, මේ තොපගේ සොරා, වැරදි කරන්නාය; මොහුට ඔබ කැමති දඬුවමක් දෙන්නැ’යි කියති. එවිට මම මෙසේ කියමි – ‘එසේ නම්, මේ පුරුෂයා ජීවත්ව සිටියදීම තරාදියකින් කිරා, දුනුදියකින් හුස්ම හිරකර මරවා නැවතත් තරාදියකින් කිරන්නැ’යි කියමි. ඔවුහු ‘එසේය’ කියා මා පිළිගෙන ඒ පුරුෂයා ජීවත්ව සිටියදීම තරාදියකින් කිරා, දුනුදියකින් හුස්ම හිරකර මරවා නැවතත් තරාදියකින් කිරති. ඔහු ජීවත්ව සිටින විට සැහැල්ලුද, මෘදුද, වැඩ කිරීමට සුදුසුද වෙයි. නමුත් ඔහු මියගිය පසු බරද, දැඩිද, වැඩ කිරීමට නුසුදුසුද වෙයි. කස්සප භවත, මට මෙසේ සිතීමට හේතුවන කරුණක් මෙයද වන්නේය – ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, හොඳ නරක කර්මවල ඵල විපාක නැත’ කියායි.’’",
      "paliTitle": ""
    },
    {
      "number": 424,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Seyyathāpi, rājañña, puriso divasaṃ santattaṃ ayoguḷaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ tulāya tuleyya. Tamenaṃ aparena samayena sītaṃ nibbutaṃ tulāya tuleyya. Kadā nu kho so ayoguḷo lahutaro vā hoti mudutaro vā kammaññataro vā, yadā vā āditto sampajjalito sajotibhūto, yadā vā sīto nibbuto’’ti? ‘‘Yadā so, bho kassapa, ayoguḷo tejosahagato ca hoti vāyosahagato ca āditto sampajjalito sajotibhūto, tadā lahutaro ca hoti mudutaro ca kammaññataro ca. Yadā pana so ayoguḷo neva tejosahagato hoti na vāyosahagato sīto nibbuto, tadā garutaro ca hoti patthinnataro ca akammaññataro cā’’ti. ‘‘Evameva kho, rājañña, yadāyaṃ kāyo āyusahagato ca hoti usmāsahagato ca viññāṇasahagato ca, tadā lahutaro ca hoti mudutaro ca kammaññataro ca. Yadā panāyaṃ kāyo neva āyusahagato hoti na usmāsahagato na viññāṇasahagato tadā garutaro ca hoti patthinnataro ca akammaññataro ca. Imināpi kho te, rājañña, pariyāyena evaṃ hotu – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti.",
      "english": "\"Well then, O king, I will give you an analogy. It is through an analogy that some wise people here understand the meaning of what is said. Just as, O king, if a man were to weigh a heated iron ball, glowing, blazing, and radiant, during the day, and then at another time were to weigh it when it was cold and extinguished, when would that iron ball be lighter, softer, and more workable, when it was blazing and radiant, or when it was cold and extinguished?\"\n\n\"When that iron ball, venerable Kassapa, is accompanied by heat and wind, blazing and radiant, then it is lighter, softer, and more workable. But when that iron ball is not accompanied by heat or wind, and is cold and extinguished, then it is heavier, harder, and less workable.\"\n\n\"Just so, O king, when this body is accompanied by life, heat, and consciousness, then it is lighter, softer, and more workable. But when this body is not accompanied by life, heat, or consciousness, then it is heavier, harder, and less workable. By this line of reasoning too, O king, let there be this conviction in you: ‘Thus, there is another world, there are beings born spontaneously, there is fruit and result of good and bad actions.’\"",
      "sinhala": "‘‘එසේ නම්, රජතුමනි, මම ඔබට උපමාවක් කරන්නෙමි. නුවණැති ඇතැම් පුරුෂයෝ මෙහි උපමාවකින් කියන ලද අර්ථය දනිති. රජතුමනි, යම් පුරුෂයෙක් දවස මුළුල්ලේ රත් වූ, දැල්වූ, මනාව දැල්වූ, බබළන ගිනි ගුලියක් තරාදියකින් කිරා බලන්නේ නම්, පසුව යම් කලෙක එය නිවුණු පසු තරාදියකින් කිරා බලන්නේ නම්, ඒ ගිනි ගුලිය සැහැල්ලු වන්නේ හෝ මෘදු වන්නේ හෝ වැඩ කිරීමට සුදුසු වන්නේ කවදාද? එය දැල්වී, මනාව දැල්වී, බබළමින් තිබූ විටද? නැතහොත් නිවී ගිය විටදැ’’යි ඇසීය. ‘‘ස්වාමීනි, කාශ්‍යපයන් වහන්ස, යම් විටෙක ඒ ගිනි ගුලිය තේජස හා වාතය යන දෙකින්ම යුක්තව දැල්වී, මනාව දැල්වී, බබළමින් තිබේද, එවිට එය සැහැල්ලු වේ. මෘදු වේ. වැඩ කිරීමට සුදුසු වේ. යම් විටෙක ඒ ගිනි ගුලිය තේජස හා වාතය යන දෙකින්ම තොරව නිවී තිබේද, එවිට එය බර වේ. දැඩි වේ. වැඩ කිරීමට නුසුදුසු වේ’’යි කීවේය. ‘‘රජතුමනි, ඒ ආකාරයෙන්ම යම් කලෙක මේ ශරීරය ආයුෂය හා උණුසුම හා විඤ්ඤාණය යන තුනෙන්ම යුක්ත වේද, එවිට එය සැහැල්ලු වේ. මෘදු වේ. වැඩ කිරීමට සුදුසු වේ. රජතුමනි, යම් කලෙක මේ ශරීරය ආයුෂයෙන් තොර වේද, උණුසුමෙන් තොර වේද, විඤ්ඤාණයෙන් තොර වේද, එවිට එය බර වේ. දැඩි වේ. වැඩ කිරීමට නුසුදුසු වේ. රජතුමනි, මේ ආකාරයෙන්ද ඔබට මෙසේ වන්නේය. ‘මෙසේ පරලොවක් ඇත. ඕපපාතික සත්වයෝ ඇත. හොඳ නරක කර්මවල විපාක ඇත’ යනුයි.’’",
      "paliTitle": "Santattaayoguḷaupamā",
      "englishTitle": "The Simile of the Hot Iron Ball",
      "sinhalaTitle": "සන්තත්තායොගුළූපමා"
    },
    {
      "number": 425,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Atthi pana, rājañña, pariyāyo…pe… atthi, bho kassapa, pariyāyo…pe… yathā kathaṃ viya rājaññā’’ti? ‘‘Idha me, bho kassapa, purisā coraṃ āgucāriṃ gahetvā dassenti – ‘ayaṃ te, bhante, coro āgucārī; imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’ti. Tyāhaṃ evaṃ vadāmi – ‘tena hi, bho, imaṃ purisaṃ anupahacca chaviñca cammañca maṃsañca nhāruñca aṭṭhiñca aṭṭhimiñjañca jīvitā voropetha, appeva nāmassa jīvaṃ nikkhamantaṃ passeyyāmā’ti. Te me ‘sādhū’ti paṭissutvā taṃ purisaṃ anupahacca chaviñca…pe… jīvitā voropenti. Yadā so āmato hoti, tyāhaṃ evaṃ vadāmi – ‘tena hi, bho, imaṃ purisaṃ uttānaṃ nipātetha, appeva nāmassa jīvaṃ nikkhamantaṃ passeyyāmā’ti. Te taṃ purisaṃ uttānaṃ nipātenti. Nevassa mayaṃ jīvaṃ nikkhamantaṃ passāma. Tyāhaṃ evaṃ vadāmi – ‘tena hi, bho, imaṃ purisaṃ avakujjaṃ nipātetha… passena nipātetha… dutiyena passena nipātetha… uddhaṃ ṭhapetha… omuddhakaṃ ṭhapetha… pāṇinā ākoṭetha… leḍḍunā ākoṭetha… daṇḍena ākoṭetha… satthena ākoṭetha… odhunātha sandhunātha niddhunātha, appeva nāmassa jīvaṃ nikkhamantaṃ passeyyāmā’ti. Te taṃ purisaṃ odhunanti sandhunanti niddhunanti. Nevassa mayaṃ jīvaṃ nikkhamantaṃ passāma. Tassa tadeva cakkhu hoti te rūpā, tañcāyatanaṃ nappaṭisaṃvedeti. Tadeva sotaṃ hoti te saddā, tañcāyatanaṃ nappaṭisaṃvedeti. Tadeva ghānaṃ hoti te gandhā, tañcāyatanaṃ nappaṭisaṃvedeti. Sāva jivhā hoti te rasā, tañcāyatanaṃ nappaṭisaṃvedeti. Sveva kāyo hoti te phoṭṭhabbā, tañcāyatanaṃ nappaṭisaṃvedeti. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "\"Even though Master Kassapa says this, nevertheless, it occurs to me in this way: 'Indeed, there is no other world, there are no beings reborn spontaneously, there is no fruit or result of good or bad actions.'\" \"Is there, Your Majesty, a way...? Is there, Master Kassapa, a way...? How is it, Your Majesty?\" \"Here, Master Kassapa, men bring to me a thief, a wrongdoer, saying, 'This, Your Honor, is a thief, a wrongdoer; inflict on him whatever penalty you wish.' Then I say to them, 'In that case, without harming this man’s skin, hide, flesh, sinews, bones, and marrow, deprive him of life, so that perhaps we might see his life departing.' They promise me, 'Very well,' and without harming that man’s skin... deprive him of life. When he is dead, then I say this: 'In that case, men, lay this man flat on his back, so that perhaps we might see his life departing.' They lay that man flat on his back. But we do not see his life departing. Then I say this: 'In that case, men, lay this man face down... lay him on his side... lay him on his other side... set him upright... set him upside down... strike him with the hand... strike him with a clod... strike him with a stick... strike him with a knife... shake him, agitate him, thrash him about, so that perhaps we might see his life departing.' They shake that man, agitate him, thrash him about. But we do not see his life departing. He still has the same eye and those forms, but that sense-sphere no longer experiences. He still has the same ear and those sounds, but that sense-sphere no longer experiences. He still has the same nose and those odors, but that sense-sphere no longer experiences. He still has the same tongue and those flavors, but that sense-sphere no longer experiences. He still has the same body and those tactile objects, but that sense-sphere no longer experiences. This too, Master Kassapa, is a way by which it occurs to me: 'Indeed, there is no other world, there are no beings reborn spontaneously, there is no fruit or result of good or bad actions.'\"",
      "sinhala": "‘‘කස්සප භවත් මෙසේ පැවසුවත්, මට මෙහි මෙසේ සිතේ. ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, කරන ලද කුසල අකුසල කර්මයන්ගේ ඵල විපාක නැත’ කියායි.’’ ‘‘මහරජ, ඒ ගැන යම් කරුණක් තිබේද?’’ ‘‘කස්සප ස්වාමීනි, කරුණක් ඇත.’’ ‘‘මහරජතුමනි, ඔබ මෙය කෙසේ සිතනවාද?’’ ‘‘කස්සප ස්වාමීනි, මෙහි මාගේ සේවකයෝ සොරකම් කරන සොරෙකු අල්ලාගෙන ඇවිත් මට මෙසේ පෙන්වති. ‘ස්වාමීනි, මොහු සොරකම් කළ සොරෙකි. මොහුට ඔබ කැමති දඬුවමක් දෙන්නැ’යි කියති. එවිට මම මෙසේ කියමි. ‘එසේ නම් මේ මිනිසාට කිසිම හානියක් නොකර සම, චර්මය, මස්, නහර, ඇට, ඇට මිදුලු වලට හානියක් නොකර ජීවිතයෙන් පහකරන්න. එවිට මොහුගේ ජීවිතය පිටතට එනවා දකින්නට ලැබෙයිදැ’යි කියමි. ඔවුහු ‘එසේය’ කියා පිළිගෙන සම, චර්මය, මස්, නහර, ඇට, ඇට මිදුලු වලට කිසිම හානියක් නොකර ජීවිතයෙන් පහකරති. ඔහු මිය ගිය පසු මම මෙසේ කියමි. ‘එසේ නම් මේ මිනිසා උඩු අතට හරවා නිදිකරවන්න. එවිට මොහුගේ ජීවිතය පිටතට එනවා දකින්නට ලැබෙයිදැ’යි කියමි. ඔවුහු එම මිනිසා උඩු අතට හරවා නිදි කරවති. නමුත් අපට ඔහුගේ ජීවිතය පිටතට එනවා දකින්නට ලැබෙන්නේ නැත. එවිට මම මෙසේ කියමි. ‘එසේ නම් මේ මිනිසා යටිකුරු කර නිදිකරවන්න... පැත්තකට හරවා නිදිකරවන්න... අනෙක් පැත්තට හරවා නිදිකරවන්න... උඩ අතට තබන්න... හිස පහළට තබන්න... අතින් තට්ටු කරන්න... මැටි කැටයකින් තට්ටු කරන්න... පොල්ලකින් තට්ටු කරන්න... ආයුධයකින් තට්ටු කරන්න... සොලවන්න, හොල්ලන්න, හොඳින් හොල්ලන්න. එවිට මොහුගේ ජීවිතය පිටතට එනවා දකින්නට ලැබෙයිදැ’යි කියමි. ඔවුහු එම මිනිසා සොලවති, හොල්ලති, හොඳින් හොල්ලති. නමුත් අපට ඔහුගේ ජීවිතය පිටතට එනවා දකින්නට ලැබෙන්නේ නැත. ඔහුට ඒ ඇස ඇත, ඒ රූපද ඇත. එහෙත් ඔහු ඒ ආයතනය සංවේදනය නොකරයි. ඔහුට ඒ කන ඇත, ඒ ශබ්දද ඇත. එහෙත් ඔහු ඒ ආයතනය සංවේදනය නොකරයි. ඔහුට ඒ නාසය ඇත, ඒ ගඳ සුවඳද ඇත. එහෙත් ඔහු ඒ ආයතනය සංවේදනය නොකරයි. ඔහුට ඒ දිව ඇත, ඒ රසද ඇත. එහෙත් ඔහු ඒ ආයතනය සංවේදනය නොකරයි. ඔහුට ඒ කය ඇත, ඒ පහසද ඇත. එහෙත් ඔහු ඒ ආයතනය සංවේදනය නොකරයි. කස්සප ස්වාමීනි, මේ කරුණ නිසා මට මෙසේ සිතේ. ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, කරන ලද කුසල අකුසල කර්මයන්ගේ ඵල විපාක නැත’ කියායි.’’",
      "paliTitle": ""
    },
    {
      "number": 426,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Bhūtapubbaṃ, rājañña, aññataro saṅkhadhamo saṅkhaṃ ādāya paccantimaṃ janapadaṃ agamāsi. So yena aññataro gāmo tenupasaṅkami; upasaṅkamitvā majjhe gāmassa ṭhito tikkhattuṃ saṅkhaṃ upalāpetvā saṅkhaṃ bhūmiyaṃ nikkhipitvā ekamantaṃ nisīdi. Atha kho, rājañña, tesaṃ paccantajanapadānaṃ [paccantajānaṃ (sī.)] manussānaṃ etadahosi – ‘ambho kassa nu kho [etadahosi ‘‘kissa dukho (pī.)] eso saddo evaṃrajanīyo evaṃkamanīyo evaṃmadanīyo evaṃbandhanīyo evaṃmucchanīyo’ti. Sannipatitvā taṃ saṅkhadhamaṃ etadavocuṃ – ‘ambho, kassa nu kho eso saddo evaṃrajanīyo evaṃkamanīyo evaṃmadanīyo evaṃbandhanīyo evaṃmucchanīyo’ti. ‘Eso kho, bho, saṅkho nāma yasseso saddo evaṃrajanīyo evaṃkamanīyo evaṃmadanīyo evaṃbandhanīyo evaṃmucchanīyo’ti. Te taṃ saṅkhaṃ uttānaṃ nipātesuṃ – ‘vadehi, bho saṅkha, vadehi, bho saṅkhā’ti. Neva so saṅkho saddamakāsi. Te taṃ saṅkhaṃ avakujjaṃ nipātesuṃ, passena nipātesuṃ, dutiyena passena nipātesuṃ, uddhaṃ ṭhapesuṃ, omuddhakaṃ ṭhapesuṃ, pāṇinā ākoṭesuṃ, leḍḍunā ākoṭesuṃ, daṇḍena ākoṭesuṃ, satthena ākoṭesuṃ, odhuniṃsu sandhuniṃsu niddhuniṃsu – ‘vadehi, bho saṅkha, vadehi, bho saṅkhā’ti. Neva so saṅkho saddamakāsi. ‘‘Atha kho, rājañña, tassa saṅkhadhamassa etadahosi – ‘yāva bālā ime paccantajanapadāmanussā, kathañhi nāma ayoniso saṅkhasaddaṃ gavesissantī’ti. Tesaṃ pekkhamānānaṃ saṅkhaṃ gahetvā tikkhattuṃ saṅkhaṃ upalāpetvā saṅkhaṃ ādāya pakkāmi. Atha kho, rājañña, tesaṃ paccantajanapadānaṃ manussānaṃ etadahosi – ‘yadā kira, bho, ayaṃ saṅkho nāma purisasahagato ca hoti vāyāmasahagato [vāyosahagato (syā.)] ca vāyusahagato ca, tadāyaṃ saṅkho saddaṃ karoti, yadā panāyaṃ saṅkho neva purisasahagato hoti na vāyāmasahagato na vāyusahagato, nāyaṃ saṅkho saddaṃ karotī’ti. Evameva kho, rājañña, yadāyaṃ kāyo āyusahagato ca hoti usmāsahagato ca viññāṇasahagato ca, tadā abhikkamatipi paṭikkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti, cakkhunāpi rūpaṃ passati, sotenapi saddaṃ suṇāti, ghānenapi gandhaṃ ghāyati, jivhāyapi rasaṃ sāyati, kāyenapi phoṭṭhabbaṃ phusati, manasāpi dhammaṃ vijānāti. Yadā panāyaṃ kāyo neva āyusahagato hoti, na usmāsahagato, na viññāṇasahagato, tadā neva abhikkamati na paṭikkamati na tiṭṭhati na nisīdati na seyyaṃ kappeti, cakkhunāpi rūpaṃ na passati, sotenapi saddaṃ na suṇāti, ghānenapi gandhaṃ na ghāyati, jivhāyapi rasaṃ na sāyati, kāyenapi phoṭṭhabbaṃ na phusati, manasāpi dhammaṃ na vijānāti. Imināpi kho te, rājañña, pariyāyena evaṃ hotu – ‘itipi atthi paro loko, atthi sattā opapātikā, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’ti [vipākoti, paṭhamabhāṇavāraṃ (syā.)].",
      "english": "\"Well then, prince, I will give you a simile. It is through similes that some intelligent people here understand the meaning of what is said. Once upon a time, prince, a conch-blower took a conch and went to a border region. He approached a certain village, stood in the middle of the village, blew the conch three times, placed the conch on the ground, and sat down to one side. Then, prince, those people of the border region thought, 'My goodness, what is this sound that is so delightful, so desirable, so intoxicating, so captivating, so enthralling?' Gathering together, they said to the conch-blower, 'My goodness, what is this sound that is so delightful, so desirable, so intoxicating, so captivating, so enthralling?' 'This, good sirs, is called a conch, and that is its sound, so delightful, so desirable, so intoxicating, so captivating, so enthralling.' They laid that conch on its back, saying, 'Speak, good conch, speak, good conch!' But the conch made no sound. They laid that conch face down, they laid it on its side, they laid it on its other side, they stood it upright, they stood it upside down, they struck it with their hands, they struck it with clods, they struck it with sticks, they struck it with knives, they shook it, they rattled it, they banged it, saying, 'Speak, good conch, speak, good conch!' But the conch made no sound.\n\n\"Then, prince, the conch-blower thought, 'These border people are so foolish; how could they possibly seek the sound of a conch in the wrong way?' As they looked on, he took the conch, blew the conch three times, and went away with the conch. Then, prince, those people of the border region thought, 'Indeed, when this conch is associated with a person, associated with effort, and associated with air, then this conch makes a sound. But when this conch is not associated with a person, not associated with effort, and not associated with air, then this conch does not make a sound.' Just so, prince, when this body is associated with life, associated with heat, and associated with consciousness, then it moves forward, moves backward, stands, sits, lies down, sees form with the eye, hears sound with the ear, smells odor with the nose, tastes flavor with the tongue, feels touch with the body, and knows a phenomenon with the mind. But when this body is not associated with life, not associated with heat, and not associated with consciousness, then it neither moves forward, nor moves backward, nor stands, nor sits, nor lies down, nor sees form with the eye, nor hears sound with the ear, nor smells odor with the nose, nor tastes flavor with the tongue, nor feels touch with the body, nor knows a phenomenon with the mind. By this method also, prince, may you be certain: 'Thus, there is another world, there are beings reborn spontaneously, there is fruit and result of good and bad actions.'\"",
      "sinhala": "‘‘එසේ නම්, රජතුමනි, මම ඔබට උපමාවක් කරන්නෙමි. නුවණැති ඇතැම් පුරුෂයෝ මෙහි උපමාවකින් කියන ලද අර්ථය දනිති. රජතුමනි, පෙර කලෙක එක් ශංඛධම නම් පුරුෂයෙක් ශංඛයක් රැගෙන දුර බැහැර පළාතකට ගියේය. ඔහු යම් ගමකට පැමිණියේ ද, එහි ගොස් ගම මැද සිට තුන් වරක් ශංඛය නාද කර ශංඛය බිම තබා එක පැත්තකට වී වාඩි විය. රජතුමනි, එවිට එම දුර බැහැර පළාතේ මිනිසුන්ට මෙවැනි සිතක් ඇති විය. ‘අහෝ, මේ මොන හඬක් ද? මෙතරම් ඇලුම් උපදවන, මෙතරම් ප්‍රිය උපදවන, මෙතරම් මත් කරවන, මෙතරම් බැඳ තබන, මෙතරම් මුලා කරවන හඬක් ද?’ ඔවුහු රැස් වී එම ශංඛධම නම් පුරුෂයාට මෙසේ කීහ. ‘අහෝ, මේ මොන හඬක් ද? මෙතරම් ඇලුම් උපදවන, මෙතරම් ප්‍රිය උපදවන, මෙතරම් මත් කරවන, මෙතරම් බැඳ තබන, මෙතරම් මුලා කරවන හඬක් ද?’ ‘භවත්නි, මේ ශංඛය නමින් හඳුන්වන දෙයෙහි හඬයි. එම හඬ මෙතරම් ඇලුම් උපදවයි, මෙතරම් ප්‍රිය උපදවයි, මෙතරම් මත් කරවයි, මෙතරම් බැඳ තබයි, මෙතරම් මුලා කරවයි’ කියා ඔහු කීවේය. එවිට ඔවුහු එම ශංඛය උඩු අතට හරවා බිම තබා ‘අහෝ ශංඛය, නාද කරන්න, අහෝ ශංඛය, නාද කරන්නැ’යි කීහ. නමුත් එම ශංඛය කිසිදු හඬක් නොනැගුවේය. ඔවුහු එම ශංඛය යටිකුරු කර බිම තැබූහ. පැත්තකට හරවා බිම තැබූහ. අනෙක් පැත්තට හරවා බිම තැබූහ. උඩ අතට තැබූහ. යටිකුරු කර තැබූහ. අතින් තට්ටු කළහ. මැටි කැටයකින් තට්ටු කළහ. දණ්ඩකින් තට්ටු කළහ. ආයුධයකින් තට්ටු කළහ. සොලවා බැලූහ. හෙළවා බැලූහ. සොලවමින් හෙළවා බැලූහ. ‘අහෝ ශංඛය, නාද කරන්න, අහෝ ශංඛය, නාද කරන්නැ’යි කීහ. නමුත් එම ශංඛය කිසිදු හඬක් නොනැගුවේය.\n\n‘‘රජතුමනි, එවිට එම ශංඛධම නම් පුරුෂයාට මෙවැනි සිතක් ඇති විය. ‘මේ දුර බැහැර පළාතේ මිනිසුන් කොතරම් නම් අඥාන ද? මොවුන් ශංඛයේ හඬක් අයෝනිසෝ මනසිකාරයෙන් සොයන්නේ කෙසේදැ?’ ඔහු ඔවුන් බලා සිටියදී ශංඛය රැගෙන තුන් වරක් නාද කර ශංඛය රැගෙන පිටත්ව ගියේය. රජතුමනි, එවිට එම දුර බැහැර පළාතේ මිනිසුන්ට මෙවැනි සිතක් ඇති විය. ‘අහෝ, මේ ශංඛය පුරුෂයා සමඟ සම්බන්ධ වූ විටත්, උත්සාහය සමඟ සම්බන්ධ වූ විටත්, වාතය සමඟ සම්බන්ධ වූ විටත් හඬ නගයි. නමුත් මේ ශංඛය පුරුෂයා සමඟ සම්බන්ධ නොවූ විටත්, උත්සාහය සමඟ සම්බන්ධ නොවූ විටත්, වාතය සමඟ සම්බන්ධ නොවූ විටත් හඬ නගන්නේ නැතැ’යි කීහ. රජතුමනි, ඒ ආකාරයෙන්ම මේ ශරීරය ආයුෂ සමඟ සම්බන්ධ වූ විටත්, උණුසුම සමඟ සම්බන්ධ වූ විටත්, විඤ්ඤාණය සමඟ සම්බන්ධ වූ විටත් ඉදිරියට යයි. ආපසු හැරෙයි. සිටියි. වාඩි වෙයි. නිදා ගනියි. ඇසෙන් රූප දකියි. කනෙන් ශබ්ද අසයි. නාසයෙන් ගඳ සුවඳ දැනෙයි. දිවෙන් රස විඳියි. කයින් ස්පර්ශය දැනෙයි. මනසින් අරමුණු දනියි. රජතුමනි, මේ ශරීරය ආයුෂ සමඟ සම්බන්ධ නොවූ විටත්, උණුසුම සමඟ සම්බන්ධ නොවූ විටත්, විඤ්ඤාණය සමඟ සම්බන්ධ නොවූ විටත් ඉදිරියට යන්නේ ද නැත. ආපසු හැරෙන්නේ ද නැත. සිටින්නේ ද නැත. වාඩි වන්නේ ද නැත. නිදා ගන්නේ ද නැත. ඇසෙන් රූප දකින්නේ ද නැත. කනෙන් ශබ්ද අසන්නේ ද නැත. නාසයෙන් ගඳ සුවඳ ද දැනෙන්නේ ද නැත. දිවෙන් රස විඳින්නේ ද නැත. කයින් ස්පර්ශය දැනෙන්නේ ද නැත. මනසින් අරමුණු දන්නේ ද නැත. රජතුමනි, මේ ආකාරයෙන් ද ඔබට මෙසේ වේවා. ‘මෙසේ පරලොවක් ඇත. ඕපපාතික සත්වයෝ ඇත. හොඳ නරක කර්මවල විපාක ඇත’ යැයි දැනගන්න.",
      "paliTitle": "Saṅkhadhamaupamā",
      "englishTitle": "The Simile of the Conch Blower",
      "sinhalaTitle": "සංඛධමූපමා"
    },
    {
      "number": 427,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho evaṃ me ettha hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ‘‘Atthi pana, rājañña, pariyāyo…pe… atthi, bho kassapa, pariyāyo…pe… yathā kathaṃ viya rājaññā’’ti? ‘‘Idha me, bho kassapa, purisā coraṃ āgucāriṃ gahetvā dassenti – ‘ayaṃ te, bhante, coro āgucārī, imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’ti. Tyāhaṃ evaṃ vadāmi – ‘tena hi, bho, imassa purisassa chaviṃ chindatha, appeva nāmassa jīvaṃ passeyyāmā’ti. Te tassa purisassa chaviṃ chindanti. Nevassa mayaṃ jīvaṃ passāma. Tyāhaṃ evaṃ vadāmi – ‘tena hi, bho, imassa purisassa cammaṃ chindatha, maṃsaṃ chindatha, nhāruṃ chindatha, aṭṭhiṃ chindatha, aṭṭhimiñjaṃ chindatha, appeva nāmassa jīvaṃ passeyyāmā’ti. Te tassa purisassa aṭṭhimiñjaṃ chindanti, nevassa mayaṃ jīvaṃ passeyyāma. Ayampi kho, bho kassapa, pariyāyo, yena me pariyāyena evaṃ hoti – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti. ",
      "english": "\"Even though Master Kassapa says this, it still occurs to me thus: 'Indeed, there is no other world, there are no beings who arise spontaneously, there is no fruit or result of good or bad actions.'\"\n\n\"But, is there, royal sir, a way…pe… Is there, Master Kassapa, a way…pe… How is that, royal sir?\"\n\n\"Here, Master Kassapa, men catch a criminal and show him to me, saying, 'This, your honor, is a criminal, punish him with whatever penalty you wish.' Then I say thus: 'Then, sirs, cut the skin of this man, perhaps we might see his life.' They cut the skin of that man. We do not see his life. Then I say thus: 'Then, sirs, cut the hide of this man, cut the flesh, cut the sinews, cut the bones, cut the bone marrow, perhaps we might see his life.' They cut the bone marrow of that man, we do not see his life. This too, Master Kassapa, is a way, by which way it occurs to me thus: 'Indeed, there is no other world, there are no beings who arise spontaneously, there is no fruit or result of good or bad actions.'\"",
      "sinhala": "‘‘කස්සප භවත් මෙසේ කීවත්, එහිලා මට මෙබඳු සිතක් ඇති වේ: ‘පරලොවක් නැත්තේ ය, ඕපපාතික සත්ත්වයෝ නැත්තේ ය, මනා කොට කරන ලද හා නරක ලෙස කරන ලද කර්මයන්ගේ ඵල විපාක නැත්තේ ය’ කියා ය. ‘‘රාජඤ්ඤ, එහෙත් කරුණක් ඇත…පෙ… කස්සප භවත්නි, කරුණක් ඇත…පෙ… රාජඤ්ඤ කෙලෙස ද කීව මැනව’’? ‘‘කස්සප භවත්නි, මෙහි මාගේ මිනිසුන් වැරදි කරන සොරෙකු අල්ලාගෙන මට පෙන්වති: ‘ස්වාමීනි, මේ තොපගේ වැරදි කරන සොරා ය, මොහුට යම් දඬුවමක් කැමැත්තෙහි නම්, ඒ දඬුවම පනවව’ යි. මම ඔවුන්ට මෙසේ කියමි: ‘එසේ නම්, භවත්නි, මේ පුරුෂයාගේ සම කපන්න, සමහරවිට අපි මොහුගේ ජීවිතය දකිමු’යි. ඔවුහු ඒ පුරුෂයාගේ සම කපති. අපි ඔහුගේ ජීවිතය නොදකිමු. මම ඔවුන්ට මෙසේ කියමි: ‘එසේ නම්, භවත්නි, මේ පුරුෂයාගේ සම් කපන්න, මස කපන්න, ස්නායු කපන්න, ඇට කපන්න, ඇටමිදුළු කපන්න, සමහරවිට අපි මොහුගේ ජීවිතය දකිමු’යි. ඔවුහු ඒ පුරුෂයාගේ ඇටමිදුළු කපති, අපි ඔහුගේ ජීවිතය නොදකිමු. කස්සප භවත්නි, යම් කරුණකින් මට මෙබඳු සිතක් ඇති වේ නම්, ඒ කරුණ මෙය යි: ‘පරලොවක් නැත්තේ ය, ඕපපාතික සත්ත්වයෝ නැත්තේ ය, මනා කොට කරන ලද හා නරක ලෙස කරන ලද කර්මයන්ගේ ඵල විපාක නැත්තේ ය’ කියා ය.",
      "paliTitle": ""
    },
    {
      "number": 428,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Bhūtapubbaṃ, rājañña, aññataro aggiko jaṭilo araññāyatane paṇṇakuṭiyā sammati [vasati (sī. pī.)]. Atha kho, rājañña, aññataro janapade sattho [sattho janapadapadesā (sī.), janapado satthavāso (syā.), janapadapadeso (pī.)] vuṭṭhāsi. Atha kho so sattho [satthavāso (syā.)] tassa aggikassa jaṭilassa assamassa sāmantā ekarattiṃ vasitvā pakkāmi. Atha kho, rājañña, tassa aggikassa jaṭilassa etadahosi – ‘yaṃnūnāhaṃ yena so satthavāso tenupasaṅkameyyaṃ, appeva nāmettha kiñci upakaraṇaṃ adhigaccheyya’nti. Atha kho so aggiko jaṭilo kālasseva vuṭṭhāya yena so satthavāso tenupasaṅkami; upasaṅkamitvā addasa tasmiṃ satthavāse daharaṃ kumāraṃ mandaṃ uttānaseyyakaṃ chaḍḍitaṃ. Disvānassa etadahosi – ‘na kho me taṃ patirūpaṃ yaṃ me pekkhamānassa manussabhūto kālaṅkareyya; yaṃnūnāhaṃ imaṃ dārakaṃ assamaṃ netvā āpādeyyaṃ poseyyaṃ vaḍḍheyya’nti. Atha kho so aggiko jaṭilo taṃ dārakaṃ assamaṃ netvā āpādesi posesi vaḍḍhesi. Yadā so dārako dasavassuddesiko vā hoti [ahosi (?)] dvādasavassuddesiko vā, atha kho tassa aggikassa jaṭilassa janapade kañcideva karaṇīyaṃ uppajji. Atha kho so aggiko jaṭilo taṃ dārakaṃ etadavoca – ‘icchāmahaṃ, tāta, janapadaṃ [nagaraṃ (ka.)] gantuṃ; aggiṃ, tāta, paricareyyāsi. Mā ca te aggi nibbāyi. Sace ca te aggi nibbāyeyya, ayaṃ vāsī imāni kaṭṭhāni idaṃ araṇisahitaṃ, aggiṃ nibbattetvā aggiṃ paricareyyāsī’ti. Atha kho so aggiko jaṭilo taṃ dārakaṃ evaṃ anusāsitvā janapadaṃ agamāsi. Tassa khiḍḍāpasutassa aggi nibbāyi. ‘‘Atha kho tassa dārakassa etadahosi – ‘pitā kho maṃ evaṃ avaca – ‘‘aggiṃ, tāta, paricareyyāsi. Mā ca te aggi nibbāyi. Sace ca te aggi nibbāyeyya, ayaṃ vāsī imāni kaṭṭhāni idaṃ araṇisahitaṃ, aggiṃ nibbattetvā aggiṃ paricareyyāsī’’ti. Yaṃnūnāhaṃ aggiṃ nibbattetvā aggiṃ paricareyya’nti. Atha kho so dārako araṇisahitaṃ vāsiyā tacchi – ‘appeva nāma aggiṃ adhigaccheyya’nti. Neva so aggiṃ adhigacchi. Araṇisahitaṃ dvidhā phālesi, tidhā phālesi, catudhā phālesi, pañcadhā phālesi, dasadhā phālesi, satadhā [vīsatidhā (syā.)] phālesi, sakalikaṃ sakalikaṃ akāsi, sakalikaṃ sakalikaṃ karitvā udukkhale koṭṭesi, udukkhale koṭṭetvā mahāvāte opuni [ophuni (syā. ka.)] – ‘appeva nāma aggiṃ adhigaccheyya’nti. Neva so aggiṃ adhigacchi. ‘‘Atha kho so aggiko jaṭilo janapade taṃ karaṇīyaṃ tīretvā yena sako assamo tenupasaṅkami; upasaṅkamitvā taṃ dārakaṃ etadavoca – ‘kacci te, tāta, aggi na nibbuto’ti? ‘Idha me, tāta, khiḍḍāpasutassa aggi nibbāyi. Tassa me etadahosi – ‘‘pitā kho maṃ evaṃ avaca aggiṃ, tāta, paricareyyāsi. Mā ca te, tāta, aggi nibbāyi. Sace ca te aggi nibbāyeyya, ayaṃ vāsī imāni kaṭṭhāni idaṃ araṇisahitaṃ, aggiṃ nibbattetvā aggiṃ paricareyyāsīti. Yaṃnūnāhaṃ aggiṃ nibbattetvā aggiṃ paricareyya’’nti. Atha khvāhaṃ, tāta, araṇisahitaṃ vāsiyā tacchiṃ – ‘‘appeva nāma aggiṃ adhigaccheyya’’nti. Nevāhaṃ aggiṃ adhigacchiṃ. Araṇisahitaṃ dvidhā phālesiṃ, tidhā phālesiṃ, catudhā phālesiṃ, pañcadhā phālesiṃ, dasadhā phālesiṃ, satadhā phālesiṃ, sakalikaṃ sakalikaṃ akāsiṃ, sakalikaṃ sakalikaṃ karitvā udukkhale koṭṭesiṃ, udukkhale koṭṭetvā mahāvāte opuniṃ – ‘‘appeva nāma aggiṃ adhigaccheyya’’nti. Nevāhaṃ aggiṃ adhigacchi’’’nti. Atha kho tassa aggikassa jaṭilassa etadahosi – ‘yāva bālo ayaṃ dārako abyatto, kathañhi nāma ayoniso aggiṃ gavesissatī’ti. Tassa pekkhamānassa araṇisahitaṃ gahetvā aggiṃ nibbattetvā taṃ dārakaṃ etadavoca – ‘evaṃ kho, tāta, aggi nibbattetabbo. Na tveva yathā tvaṃ bālo abyatto ayoniso aggiṃ gavesī’ti. Evameva kho tvaṃ, rājañña, bālo abyatto ayoniso paralokaṃ gavesissasi. Paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ, paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ, mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’ti.",
      "english": "\"Then, royal one, I will make an analogy for you. Here, some intelligent people understand the meaning of what is said through an analogy. Once, royal one, there was a fire-worshipping ascetic who lived in a hermitage in the forest. Then, royal one, a caravan arose in a certain district. Then that caravan, royal one, stayed one night near the fire-worshipping ascetic's hermitage and departed. Then, royal one, it occurred to that fire-worshipping ascetic: 'Why don't I go to where that caravan stayed, perhaps I might acquire some equipment there?' Then that fire-worshipping ascetic got up early and went to where that caravan had stayed; having gone there, he saw in that caravan's resting place a young boy, weak, lying on his back, abandoned. Having seen him, it occurred to him: 'It is not proper for me that a human being should die while I am watching; why don't I take this child to the hermitage and care for him, nourish him, and raise him?' Then that fire-worshipping ascetic took that child to the hermitage and cared for him, nourished him, and raised him. When that boy was about ten years old or twelve years old, a certain task arose for that fire-worshipping ascetic in the district. Then that fire-worshipping ascetic said to that boy: 'I wish to go to the district; tend the fire, dear. And don't let the fire go out. And if the fire should go out, here is an axe, these are the pieces of wood, and this is the fire-stick; produce fire and tend the fire.' Then that fire-worshipping ascetic, having instructed the boy in this way, went to the district. While he was engrossed in playing, the fire went out.\n\nThen it occurred to that boy: 'My father told me thus: \"Tend the fire, dear. And don't let the fire go out. And if the fire should go out, here is an axe, these are the pieces of wood, and this is the fire-stick; produce fire and tend the fire.\" Why don't I produce fire and tend the fire?' Then that boy chopped the fire-stick with the axe, thinking, 'Perhaps I might obtain fire.' He did not obtain fire. He split the fire-stick in two, split it in three, split it in four, split it in five, split it in ten, split it in a hundred pieces, made it into tiny fragments, and having made it into tiny fragments, he pounded it in a mortar, and having pounded it in a mortar, he winnowed it in the great wind, thinking, 'Perhaps I might obtain fire.' He did not obtain fire.\n\nThen that fire-worshipping ascetic, having finished that task in the district, went to his hermitage; having gone there, he said to that boy: 'Dear, did the fire not go out?' 'Here, dear, while I was engrossed in playing, the fire went out. Then it occurred to me: \"My father told me thus: 'Tend the fire, dear. And don't let the fire go out. And if the fire should go out, here is an axe, these are the pieces of wood, and this is the fire-stick; produce fire and tend the fire.' Why don't I produce fire and tend the fire?'\" Then, dear, I chopped the fire-stick with the axe, thinking, \"Perhaps I might obtain fire.\" I did not obtain fire. I split the fire-stick in two, split it in three, split it in four, split it in five, split it in ten, split it in a hundred pieces, made it into tiny fragments, and having made it into tiny fragments, I pounded it in a mortar, and having pounded it in a mortar, I winnowed it in the great wind, thinking, \"Perhaps I might obtain fire.\" I did not obtain fire.'\" Then it occurred to that fire-worshipping ascetic: 'This boy is foolish and inexperienced; how indeed could he search for fire in an improper way?' While he was watching, he took the fire-stick, produced fire, and said to that boy: 'Fire should be produced in this way, dear. But not as you, foolish and inexperienced, searched for fire in an improper way.' In the same way, royal one, you are foolish and inexperienced, and you search for the afterlife in an improper way. Give up this evil view, royal one, give up this evil view, royal one, lest it be for your long-term harm and suffering.\"",
      "sinhala": "‘‘එසේ නම් රජතුමනි, මම ඔබට උපමාවක් කරන්නෙමි. මෙහි සමහර නුවණ ඇති පුරුෂයෝ උපමාවකින් කියන ලද දෙයෙහි අර්ථය දැනගනිති. රජතුමනි, අතීතයෙහි එක්තරා ගිනි පූජා කරන ජටිල තාපසයෙක් අරණ්‍යයක පන්සලක වාසය කළේය. රජතුමනි, අනතුරුව එක්තරා ජනපදයක වෙළඳ පිරිසක් නැවතුණාහ. අනතුරුව ඒ වෙළඳ පිරිස ඒ ගිනි පූජා කරන ජටිල තාපසයාගේ ආශ්‍රමය අසල එක් රාත්‍රියක් නැවතී පිටත්ව ගියහ. රජතුමනි, අනතුරුව ඒ ගිනි පූජා කරන ජටිල තාපසයාට මෙබඳු සිතක් ඇති විය. ‘මම ඒ වෙළඳ පිරිස නැවතුණු තැනට ගියොත් හොඳයි. සමහරවිට මට එහි යම් උපකරණයක් ලැබෙන්නට පුළුවනැ’යි සිතුවේය. අනතුරුව ඒ ගිනි පූජා කරන ජටිල තාපසයා අලුයම නැඟිට ඒ වෙළඳ පිරිස නැවතුණු තැනට ගියේය. ගොස් ඒ වෙළඳ පිරිස නැවතුණු තැන කුඩා දරුවෙක් උඩුබැලි අතට දමා ගොස් තිබෙනු දුටුවේය. දැක ඔහුට මෙබඳු සිතක් ඇති විය. ‘මම බලා සිටියදී මනුෂ්‍යයෙක් මිය යාම මට සුදුසු නොවේ. මම මේ දරුවා ආශ්‍රමයට ගෙන ගොස් රැක බලා ගනිමින්, පෝෂණය කරමින්, වැඩීමට සලස්වන්නෙමි’යි සිතුවේය. අනතුරුව ඒ ගිනි පූජා කරන ජටිල තාපසයා ඒ දරුවා ආශ්‍රමයට ගෙන ගොස් රැක බලා ගනිමින්, පෝෂණය කරමින්, වැඩීමට සලස්වා ගත්තේය. ඒ දරුවා දස වසරක් පමණ වයස ඇති වූ විට හෝ දොළොස් වසරක් පමණ වයස ඇති වූ විට, ඒ ගිනි පූජා කරන ජටිල තාපසයාට ජනපදයේ යම් කටයුත්තක් ඇති විය. අනතුරුව ඒ ගිනි පූජා කරන ජටිල තාපසයා ඒ දරුවාට මෙසේ කීවේය. ‘මම ජනපදයට යන්නට කැමැත්තෙමි. පුත, ඔබ ගින්දර හොඳින් බලා ගත යුතුයි. ඔබගේ ගින්දර නිවී නොයා යුතුය. ඔබගේ ගින්දර නිවී ගියහොත්, මෙන්න මේ පොරොව, මේ දර, මේ අරණ සහිත දඬු කැබැල්ල ඇත. ගින්දර මතු කර ගෙන ගින්දර හොඳින් බලා ගන්නැ’යි කීවේය. අනතුරුව ඒ ගිනි පූජා කරන ජටිල තාපසයා ඒ දරුවාට මෙසේ අවවාද කර ජනපදයට ගියේය. සෙල්ලමට ලොල් වූ ඒ දරුවාගේ ගින්දර නිවී ගියේය.\n\n‘‘අනතුරුව ඒ දරුවාට මෙබඳු සිතක් ඇති විය. ‘පියා මට මෙසේ කීවේය. පුත, ගින්දර හොඳින් බලා ගත යුතුයි. ඔබගේ ගින්දර නිවී නොයා යුතුය. ඔබගේ ගින්දර නිවී ගියහොත්, මෙන්න මේ පොරොව, මේ දර, මේ අරණ සහිත දඬු කැබැල්ල ඇත. ගින්දර මතු කර ගෙන ගින්දර හොඳින් බලා ගන්නැ’යි කීවේය. මම ගින්දර මතු කර ගෙන ගින්දර හොඳින් බලා ගතහොත් හොඳයි’ සිතුවේය. අනතුරුව ඒ දරුවා අරණ සහිත දඬු කැබැල්ල පොරොවෙන් කොටා ගත්තේය. ‘සමහරවිට මට ගින්දර ලබා ගන්නට හැකි වේවි’ සිතුවේය. ඔහුට ගින්දර ලබා ගන්නට නොහැකි විය. අරණ සහිත දඬු කැබැල්ල දෙකට පැළුවේය. තුනකට පැළුවේය. හතරකට පැළුවේය. පහකට පැළුවේය. දහයකට පැළුවේය. සියයකට පැළුවේය. කැබලි කැබලිවලට කැඩුවේය. කැබලි කැබලිවලට කඩා මෝල් ගහෙන් කොටා ගත්තේය. මෝල් ගහෙන් කොටා මහා සුළඟට විසිකළේය. ‘සමහරවිට මට ගින්දර ලබා ගන්නට හැකි වේවි’ සිතුවේය. ඔහුට ගින්දර ලබා ගන්නට නොහැකි විය.\n\n‘‘අනතුරුව ඒ ගිනි පූජා කරන ජටිල තාපසයා ජනපදයේ ඒ කටයුත්ත අවසන් කර තමාගේ ආශ්‍රමයට ගියේය. ගොස් ඒ දරුවාට මෙසේ කීවේය. ‘පුත, ඔබගේ ගින්දර නිවී ගියේ නැද්දැ’යි ඇසුවේය. ‘පියාණෙනි, මෙහි සෙල්ලමට ලොල් වූ මගේ ගින්දර නිවී ගියේය. එවිට මට මෙබඳු සිතක් ඇති විය. පියා මට මෙසේ කීවේය. පුත, ගින්දර හොඳින් බලා ගත යුතුයි. ඔබගේ ගින්දර නිවී නොයා යුතුය. ඔබගේ ගින්දර නිවී ගියහොත්, මෙන්න මේ පොරොව, මේ දර, මේ අරණ සහිත දඬු කැබැල්ල ඇත. ගින්දර මතු කර ගෙන ගින්දර හොඳින් බලා ගන්නැ’යි කීවේය. මම ගින්දර මතු කර ගෙන ගින්දර හොඳින් බලා ගතහොත් හොඳයි’ සිතුවෙමි. පියාණෙනි, අනතුරුව මම අරණ සහිත දඬු කැබැල්ල පොරොවෙන් කොටා ගතිමි. ‘සමහරවිට මට ගින්දර ලබා ගන්නට හැකි වේවි’ සිතුවෙමි. මට ගින්දර ලබා ගන්නට නොහැකි විය. අරණ සහිත දඬු කැබැල්ල දෙකට පැළුවෙමි. තුනකට පැළුවෙමි. හතරකට පැළුවෙමි. පහකට පැළුවෙමි. දහයකට පැළුවෙමි. සියයකට පැළුවෙමි. කැබලි කැබලිවලට කැඩුවෙමි. කැබලි කැබලිවලට කඩා මෝල් ගහෙන් කොටා ගතිමි. මෝල් ගහෙන් කොටා මහා සුළඟට විසිකළෙමි. ‘සමහරවිට මට ගින්දර ලබා ගන්නට හැකි වේවි’ සිතුවෙමි. මට ගින්දර ලබා ගන්නට නොහැකි විය’යි කීවේය. අනතුරුව ඒ ගිනි පූජා කරන ජටිල තාපසයාට මෙබඳු සිතක් ඇති විය. ‘මේ දරුවා තවමත් බාලය. තවමත් නුවණ මෝරා නැත. මොහු අයුතු ආකාරයෙන් ගින්දර සොයන්නේ කෙසේදැ’යි සිතුවේය. බලා සිටි ඔහු අරණ සහිත දඬු කැබැල්ල ගෙන ගින්දර මතු කර ගෙන ඒ දරුවාට මෙසේ කීවේය. ‘පුත, ගින්දර මතු කර ගත යුත්තේ මෙලෙසයි. එහෙත් නුඹ බාලයෙක් නිසා, නුවණ මෝරා නැති නිසා, අයුතු ආකාරයෙන් ගින්දර සෙවූවා මෙන් නොවේ’යි කීවේය. රජතුමනි, එපරිද්දෙන්ම ඔබ බාලයෙක් නිසා, නුවණ මෝරා නැති නිසා, අයුතු ආකාරයෙන් පරලොව සොයන්නෙහි. රජතුමනි, මේ පාපී දෘෂ්ටිගතය දුරු කරව. රජතුමනි, මේ පාපී දෘෂ්ටිගතය දුරු කරව. එය ඔබට බොහෝ කල් දුක් පිණිස, අහිත පිණිස නොවේවා’’යි වදාළේය.",
      "paliTitle": "Aggikajaṭilaupamā",
      "englishTitle": "The Simile of the Fire-haired Ascetic",
      "sinhalaTitle": "අග්ගිකජටිල උපමා"
    },
    {
      "number": 429,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho nevāhaṃ sakkomi idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjituṃ. Rājāpi maṃ pasenadi kosalo jānāti tirorājānopi – ‘pāyāsi rājañño evaṃvādī evaṃdiṭṭhī – ‘‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’ti. Sacāhaṃ, bho kassapa, idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjissāmi, bhavissanti me vattāro – ‘yāva bālo pāyāsi rājañño abyatto duggahitagāhī’ti. Kopenapi naṃ harissāmi, makkhenapi naṃ harissāmi, palāsenapi naṃ harissāmī’’ti. ",
      "english": "\"Even though the esteemed Kassapa says this, still, I am unable to relinquish this evil view. King Pasenadi of Kosala knows me, and even the tributary kings know me, that 'King Pāyāsi is one who speaks thus, who holds this view: \"Indeed, there is no other world; there are no beings who arise spontaneously; there is no fruit or result of good or bad deeds.\" If, venerable Kassapa, I were to relinquish this evil view, there would be those who would say of me, \"King Pāyāsi is foolish and inept, holding on to something poorly grasped.\" Even by anger I will maintain it, even by disparagement I will maintain it, even by deception I will maintain it.\"",
      "sinhala": "‘‘කෙසේ වෙතත්, භවත් කාශ්‍යපයන් වහන්ස, ඔබ මෙසේ පවසන නමුත්, මට මේ පාපී දෘෂ්ටිගතය අත්හැරීමට නොහැකිය. කෝසලයේ පසේනදී රජතුමා මෙන්ම අනෙක් රජවරු ද මා දන්නවා. ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, කුසල් අකුසල් කර්මයන්ගේ ඵල විපාක නැත’ යනුවෙන් පවසන, මෙවැනි වචන කියන, මෙවැනි දෘෂ්ටියක් දරන පායාසි රජතුමා බව ඔවුන් දන්නවා. භවත් කාශ්‍යපයන් වහන්ස, මම මේ පාපී දෘෂ්ටිගතය අත්හැරියහොත්, ‘පායාසි රජතුමා ඉතා බාලයෙකි, අව්‍යක්තයෙකි, වැරදි ලෙස ග්‍රහණය කරන්නෙකි’ යැයි මට කියන්නෝ සිටිනු ඇත. මම එය ක්‍රෝධයෙන් හෝ මානයෙන් හෝ ඊර්ෂ්‍යාවෙන් හෝ රැකගන්නෙමි.’’",
      "paliTitle": ""
    },
    {
      "number": 430,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Bhūtapubbaṃ, rājañña, mahāsakaṭasattho sakaṭasahassaṃ puratthimā janapadā pacchimaṃ janapadaṃ agamāsi. So yena yena gacchi, khippaṃyeva pariyādiyati tiṇakaṭṭhodakaṃ haritakapaṇṇaṃ. Tasmiṃ kho pana satthe dve satthavāhā ahesuṃ eko pañcannaṃ sakaṭasatānaṃ, eko pañcannaṃ sakaṭasatānaṃ. Atha kho tesaṃ satthavāhānaṃ etadahosi – ‘ayaṃ kho mahāsakaṭasattho sakaṭasahassaṃ; te mayaṃ yena yena gacchāma, khippameva pariyādiyati tiṇakaṭṭhodakaṃ haritakapaṇṇaṃ. Yaṃnūna mayaṃ imaṃ satthaṃ dvidhā vibhajeyyāma – ekato pañca sakaṭasatāni ekato pañca sakaṭasatānī’ti. Te taṃ satthaṃ dvidhā vibhajiṃsu [vibhajesuṃ (ka.)] ekato pañca sakaṭasatāni, ekato pañca sakaṭasatāni. Eko satthavāho bahuṃ tiṇañca kaṭṭhañca udakañca āropetvā satthaṃ payāpesi [pāyāpesi (sī. pī.)]. Dvīhatīhapayāto kho pana so sattho addasa purisaṃ kāḷaṃ lohitakkhaṃ [lohitakkhiṃ (syā.)] sannaddhakalāpaṃ [āsannaddhakalāpaṃ (syā.)] kumudamāliṃ allavatthaṃ allakesaṃ kaddamamakkhitehi cakkehi bhadrena rathena paṭipathaṃ āgacchantaṃ’, disvā etadavoca – ‘kuto, bho, āgacchasī’ti? ‘Amukamhā janapadā’ti. ‘Kuhiṃ gamissasī’ti? ‘Amukaṃ nāma janapada’nti. ‘Kacci, bho, purato kantāre mahāmegho abhippavuṭṭho’ti? ‘Evaṃ, bho, purato kantāre mahāmegho abhippavuṭṭho, āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṃ sīghaṃ gacchatha, mā yoggāni kilamitthā’ti. ‘‘Atha kho so satthavāho satthike āmantesi – ‘ayaṃ, bho, puriso evamāha – ‘‘purato kantāre mahāmegho abhippavuṭṭho, āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṃ sīghaṃ gacchatha, mā yoggāni kilamitthā’’ti. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi satthaṃ payāpethā’ti. ‘Evaṃ, bho’ti kho te satthikā tassa satthavāhassa paṭissutvā chaḍḍetvā purāṇāni tiṇāni kaṭṭhāni udakāni lahubhārehi sakaṭehi satthaṃ payāpesuṃ. Te paṭhamepi satthavāse na addasaṃsu tiṇaṃ vā kaṭṭhaṃ vā udakaṃ vā. Dutiyepi satthavāse… tatiyepi satthavāse… catutthepi satthavāse… pañcamepi satthavāse… chaṭṭhepi satthavāse… sattamepi satthavāse na addasaṃsu tiṇaṃ vā kaṭṭhaṃ vā udakaṃ vā. Sabbeva anayabyasanaṃ āpajjiṃsu. Ye ca tasmiṃ satthe ahesuṃ manussā vā pasū vā, sabbe so yakkho amanusso bhakkhesi. Aṭṭhikāneva sesāni. ‘‘Yadā aññāsi dutiyo satthavāho – ‘bahunikkhanto kho, bho, dāni so sattho’ti bahuṃ tiṇañca kaṭṭhañca udakañca āropetvā satthaṃ payāpesi. Dvīhatīhapayāto kho pana so sattho addasa purisaṃ kāḷaṃ lohitakkhaṃ sannaddhakalāpaṃ kumudamāliṃ allavatthaṃ allakesaṃ kaddamamakkhitehi cakkehi bhadrena rathena paṭipathaṃ āgacchantaṃ, disvā etadavoca – ‘kuto, bho, āgacchasī’ti? ‘Amukamhā janapadā’ti. ‘Kuhiṃ gamissasī’ti? ‘Amukaṃ nāma janapada’nti. ‘Kacci, bho, purato kantāre mahāmegho abhippavuṭṭho’ti? ‘Evaṃ, bho, purato kantāre mahāmegho abhippavuṭṭho. Āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṃ sīghaṃ gacchatha, mā yoggāni kilamitthā’ti. ‘‘Atha kho so satthavāho satthike āmantesi – ‘ayaṃ, bho, ‘‘puriso evamāha – purato kantāre mahāmegho abhippavuṭṭho, āsittodakāni vaṭumāni, bahu tiṇañca kaṭṭhañca udakañca. Chaḍḍetha, bho, purāṇāni tiṇāni kaṭṭhāni udakāni, lahubhārehi sakaṭehi sīghaṃ sīghaṃ gacchatha; mā yoggāni kilamitthā’’ti. Ayaṃ bho puriso neva amhākaṃ mitto, na ñātisālohito, kathaṃ mayaṃ imassa saddhāya gamissāma. Na vo chaḍḍetabbāni purāṇāni tiṇāni kaṭṭhāni udakāni, yathābhatena bhaṇḍena satthaṃ payāpetha. Na no purāṇaṃ chaḍḍessāmā’ti. ‘Evaṃ, bho’ti kho te satthikā tassa satthavāhassa paṭissutvā yathābhatena bhaṇḍena satthaṃ payāpesuṃ. Te paṭhamepi satthavāse na addasaṃsu tiṇaṃ vā kaṭṭhaṃ vā udakaṃ vā. Dutiyepi satthavāse… tatiyepi satthavāse… catutthepi satthavāse… pañcamepi satthavāse… chaṭṭhepi satthavāse… sattamepi satthavāse na addasaṃsu tiṇaṃ vā kaṭṭhaṃ vā udakaṃ vā. Tañca satthaṃ addasaṃsu anayabyasanaṃ āpannaṃ. Ye ca tasmiṃ satthepi ahesuṃ manussā vā pasū vā, tesañca aṭṭhikāneva addasaṃsu tena yakkhena amanussena bhakkhitānaṃ. ‘‘Atha kho so satthavāho satthike āmantesi – ‘ayaṃ kho, bho, sattho anayabyasanaṃ āpanno, yathā taṃ tena bālena satthavāhena pariṇāyakena. Tena hi, bho, yānamhākaṃ satthe appasārāni paṇiyāni, tāni chaḍḍetvā, yāni imasmiṃ satthe mahāsārāni paṇiyāni, tāni ādiyathā’ti. ‘Evaṃ, bho’ti kho te satthikā tassa satthavāhassa paṭissutvā yāni sakasmiṃ satthe appasārāni paṇiyāni, tāni chaḍḍetvā yāni tasmiṃ satthe mahāsārāni paṇiyāni, tāni ādiyitvā sotthinā taṃ kantāraṃ nitthariṃsu, yathā taṃ paṇḍitena satthavāhena pariṇāyakena. Evameva kho tvaṃ, rājañña, bālo abyatto anayabyasanaṃ āpajjissasi ayoniso paralokaṃ gavesanto seyyathāpi so purimo satthavāho. Yepi tava [te (ka.)] sotabbaṃ saddhātabbaṃ [saddahātabbaṃ (pī. ka.)] maññissanti, tepi anayabyasanaṃ āpajjissanti, seyyathāpi te satthikā. Paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ; paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’ti.",
      "english": "\"Therefore, O prince, I will give you an analogy. Here, some intelligent people understand the meaning of what is said through an analogy. In the past, O prince, a great caravan of a thousand carts went from the eastern region to the western region. Wherever it went, the grass, wood, water, and green leaves were quickly exhausted. In that caravan, there were two caravan leaders, one with five hundred carts, and the other with five hundred carts. Then it occurred to those caravan leaders: 'This great caravan has a thousand carts; and wherever we go, the grass, wood, water, and green leaves are quickly exhausted. Suppose we divide this caravan into two parts—five hundred carts in one, five hundred carts in the other.’ They divided the caravan into two parts, five hundred carts in one, five hundred carts in the other.\n\nOne caravan leader loaded up plenty of grass, wood, and water and set out. After traveling for two or three days, he saw a man coming on the road in a fine chariot with muddy wheels, dark, with bloodshot eyes, wearing a quiver, a garland of water lilies, damp clothes, and damp hair. Seeing him, he said, 'Where are you coming from, sir?' 'From such and such a region.' 'Where are you going?' 'To such and such a region.' 'Sir, has a great cloud burst in the desert ahead?' 'Yes, sir, a great cloud has burst in the desert ahead, the cart tracks are soaked with water, and there is plenty of grass, wood, and water. Throw away your old grass, wood, and water, and go quickly with lightly laden carts, so that the bullocks will not get tired.'\n\nThen that caravan leader addressed his caravan men: 'This man says this: \"A great cloud has burst in the desert ahead, the cart tracks are soaked with water, and there is plenty of grass, wood, and water. Throw away your old grass, wood, and water, and go quickly with lightly laden carts, so that the bullocks will not get tired.\" Throw away your old grass, wood, and water, and drive the caravan with lightly laden carts.' 'Yes, sir,' those caravan men agreed with that caravan leader, and throwing away the old grass, wood, and water, they drove the caravan with lightly laden carts. In the first resting place, they did not find grass, wood, or water. In the second resting place… in the third resting place… in the fourth resting place… in the fifth resting place… in the sixth resting place… in the seventh resting place, they did not find grass, wood, or water. All of them met with ruin and disaster. And whatever people or animals were in that caravan, that non-human demon devoured them all. Only their bones remained.\n\nWhen the second caravan leader knew, 'That caravan has now gone a long way,' he loaded up plenty of grass, wood, and water and set out. After traveling for two or three days, he saw a man coming on the road in a fine chariot with muddy wheels, dark, with bloodshot eyes, wearing a quiver, a garland of water lilies, damp clothes, and damp hair. Seeing him, he said, 'Where are you coming from, sir?' 'From such and such a region.' 'Where are you going?' 'To such and such a region.' 'Sir, has a great cloud burst in the desert ahead?' 'Yes, sir, a great cloud has burst in the desert ahead, the cart tracks are soaked with water, and there is plenty of grass, wood, and water. Throw away your old grass, wood, and water, and go quickly with lightly laden carts, so that the bullocks will not get tired.'\n\nThen that caravan leader addressed his caravan men: 'This man says this: \"A great cloud has burst in the desert ahead, the cart tracks are soaked with water, and there is plenty of grass, wood, and water. Throw away your old grass, wood, and water, and go quickly with lightly laden carts, so that the bullocks will not get tired.\" This man is neither our friend nor a relative; how can we go on his word? You should not throw away the old grass, wood, and water, but drive the caravan with the goods you have brought. We will not throw away the old supplies.' 'Yes, sir,' those caravan men agreed with that caravan leader, and they drove the caravan with the goods they had brought. In the first resting place, they did not find grass, wood, or water. In the second resting place… in the third resting place… in the fourth resting place… in the fifth resting place… in the sixth resting place… in the seventh resting place, they did not find grass, wood, or water. And they saw that caravan fallen into ruin and disaster. And whatever people or animals were in that caravan, they saw only their bones, eaten by that non-human demon.\n\nThen that caravan leader addressed his caravan men: 'This caravan has fallen into ruin and disaster, just as it was led by that foolish caravan leader. Therefore, throw away the less valuable goods from our caravan and take the more valuable goods from that caravan.' 'Yes, sir,' those caravan men agreed with that caravan leader, and throwing away the less valuable goods from their own caravan, they took the more valuable goods from that caravan, and they crossed that desert safely, just as they were led by that wise caravan leader. In the same way, O prince, being foolish and unwise, you will fall into ruin and disaster while seeking the next world wrongly, just like that former caravan leader. And those who think that what you say should be heard and believed will also fall into ruin and disaster, just like those caravan men. Renounce this evil view, O prince; renounce this evil view, O prince. May it not be for your harm and suffering for a long time.\"",
      "sinhala": "‘‘එසේ නම්, රාජඤ්ඤ, මම ඔබට උපමාවක් කරන්නෙමි. මෙහිලා ඇතැම් නුවණැති පුරුෂයෝ උපමාවකින් කියන ලද දෙයෙහි අර්ථය දැනගනිති. රාජඤ්ඤ, පෙර කලෙක මහත් වෙළෙඳ පිරිසක්, කරත්ත දහසක් සහිතව නැගෙනහිර ජනපදයෙන් බටහිර ජනපදයට ගියහ. ඒ පිරිස යම් යම් තැනකට ගියෝ ද, තණ, දර, ජලය හා කොළ වර්ග ඉක්මනින්ම අවසන් විය. ඒ වෙළෙඳ පිරිසෙහි නායකයෝ දෙදෙනෙක් වූහ. එක් අයෙක් කරත්ත පන්සියයකට ද, අනෙකා කරත්ත පන්සියයකට ද නායකත්වය දුන්නේය. එකල්හි ඒ වෙළෙඳ නායකයන්ට මෙබඳු අදහසක් ඇතිවිය. ‘මේ මහත් වෙළෙඳ පිරිස කරත්ත දහසකින් යුක්තය. අපි යම් යම් තැනකට යමු ද, තණ, දර, ජලය හා කොළ වර්ග ඉක්මනින්ම අවසන් වෙයි. එබැවින් අපි මේ වෙළෙඳ පිරිස දෙකට බෙදමු. එනම්, එක පැත්තකට කරත්ත පන්සියයකුත්, අනෙක් පැත්තට කරත්ත පන්සියයකුත් වන සේ බෙදමු’යි සිතූහ. ඔව්හු ඒ වෙළෙඳ පිරිස දෙකට බෙදා, එක පැත්තකට කරත්ත පන්සියයකුත්, අනෙක් පැත්තට කරත්ත පන්සියයකුත් වශයෙන් වෙන් කළහ. එක් වෙළෙඳ නායකයෙක් බොහෝ තණ, දර හා ජලය පටවාගෙන වෙළෙඳ පිරිස පිටත් කර යැවීය. දින දෙක තුනක් ගිය පසු ඒ වෙළෙඳ පිරිස කළු පැහැති, රතු ඇස් ඇති, සන්නාහයෙන් සැරසුණු, නෙළුම් මල් මාලාවක් පැළඳි, තෙත් වස්ත්‍ර හා තෙත් කෙස් ඇති, මඩ ගෑවුණු රෝද සහිත, යහපත් රථයකින් ඉදිරියට එන පුරුෂයෙකු දුටුහ. දැක මෙසේ ඇසීය. ‘ඔබ කොහෙන්ද එන්නේ?’ කියා විමසීය. ‘අසවල් ජනපදයෙන්’ යැයි ඔහු කීවේය. ‘ඔබ කොහාටද යන්නේ?’ කියා ඇසීය. ‘අසවල් නම් ජනපදයට’ යැයි ඔහු කීවේය. ‘පින්වත, ඉදිරියෙන් ඇති කාන්තාරයේ මහ වැසි වැස්සේද?’ කියා ඇසීය. ‘එසේය, පින්වත, ඉදිරියෙන් ඇති කාන්තාරයේ මහ වැසි වැස්සා. මාර්ග ජලයෙන් තෙත්වී ඇත. බොහෝ තණ, දර හා ජලය ඇත. පින්වතුනි, පරණ තණ, දර හා ජලය අත්හැර සැහැල්ලු කරත්තවලින් ඉක්මනින් ඉක්මනින් යන්න. ඔබේ ගැලුම් සතුන් වෙහෙසට පත් නොවන්නට වගබලා ගන්න’ යැයි කීවේය. ‘‘එවිට ඒ වෙළෙඳ නායකයා වෙළෙන්දන් ඇමතුවේය. ‘පින්වතුනි, මේ පුරුෂයා මෙසේ කියයි. ‘‘ඉදිරියෙන් ඇති කාන්තාරයේ මහ වැසි වැස්සා. මාර්ග ජලයෙන් තෙත්වී ඇත. බොහෝ තණ, දර හා ජලය ඇත. පින්වතුනි, පරණ තණ, දර හා ජලය අත්හැර සැහැල්ලු කරත්තවලින් ඉක්මනින් ඉක්මනින් යන්න. ඔබේ ගැලුම් සතුන් වෙහෙසට පත් නොවන්නට වගබලා ගන්න’’ කියා කියයි. පින්වතුනි, පරණ තණ, දර හා ජලය අත්හැර සැහැල්ලු කරත්තවලින් වෙළෙඳ පිරිස ගෙන යන්න’ යැයි කීවේය. ‘එසේය, පින්වත’ කියා ඒ වෙළෙන්දෝ ඒ වෙළෙඳ නායකයාට පිළිතුරු දී පරණ තණ, දර හා ජලය අත්හැර සැහැල්ලු කරත්තවලින් වෙළෙඳ පිරිස ගෙන ගියෝය. ඔව්හු පළමු නැවතුම් පොළේද තණ, දර හෝ ජලය දුටුවේ නැත. දෙවන නැවතුම් පොළේද... තුන්වන නැවතුම් පොළේද... සිව්වන නැවතුම් පොළේද... පස්වන නැවතුම් පොළේද... හයවන නැවතුම් පොළේද... සත්වන නැවතුම් පොළේද තණ, දර හෝ ජලය දුටුවේ නැත. ඔව්හු සියල්ලෝම විපතට පත් වූහ. ඒ වෙළෙඳ පිරිසෙහි සිටි මිනිසුන් හෝ සතුන් යම් පමණ සිටියේද, ඒ සියල්ල ඒ අමනුෂ්‍ය යක්ෂයා විසින් භක්ෂණය කරන ලදී. ඉතිරි වූයේ ඇට පමණි. ‘‘අනෙක් වෙළෙඳ නායකයා ‘ඒ වෙළෙඳ පිරිස දැන් බොහෝ දුර ගියා ඇත’ යැයි දැන, බොහෝ තණ, දර හා ජලය පටවාගෙන වෙළෙඳ පිරිස පිටත් කර යැවීය. දින දෙක තුනක් ගිය පසු ඒ වෙළෙඳ පිරිස කළු පැහැති, රතු ඇස් ඇති, සන්නාහයෙන් සැරසුණු, නෙළුම් මල් මාලාවක් පැළඳි, තෙත් වස්ත්‍ර හා තෙත් කෙස් ඇති, මඩ ගෑවුණු රෝද සහිත, යහපත් රථයකින් ඉදිරියට එන පුරුෂයෙකු දුටුහ. දැක මෙසේ ඇසීය. ‘ඔබ කොහෙන්ද එන්නේ?’ කියා විමසීය. ‘අසවල් ජනපදයෙන්’ යැයි ඔහු කීවේය. ‘ඔබ කොහාටද යන්නේ?’ කියා ඇසීය. ‘අසවල් නම් ජනපදයට’ යැයි ඔහු කීවේය. ‘පින්වත, ඉදිරියෙන් ඇති කාන්තාරයේ මහ වැසි වැස්සේද?’ කියා ඇසීය. ‘එසේය, පින්වත, ඉදිරියෙන් ඇති කාන්තාරයේ මහ වැසි වැස්සා. මාර්ග ජලයෙන් තෙත්වී ඇත. බොහෝ තණ, දර හා ජලය ඇත. පින්වතුනි, පරණ තණ, දර හා ජලය අත්හැර සැහැල්ලු කරත්තවලින් ඉක්මනින් ඉක්මනින් යන්න. ඔබේ ගැලුම් සතුන් වෙහෙසට පත් නොවන්නට වගබලා ගන්න’ යැයි කීවේය. ‘‘එවිට ඒ වෙළෙඳ නායකයා වෙළෙන්දන් ඇමතුවේය. ‘පින්වතුනි, මේ පුරුෂයා මෙසේ කියයි. ‘‘ඉදිරියෙන් ඇති කාන්තාරයේ මහ වැසි වැස්සා. මාර්ග ජලයෙන් තෙත්වී ඇත. බොහෝ තණ, දර හා ජලය ඇත. පින්වතුනි, පරණ තණ, දර හා ජලය අත්හැර සැහැල්ලු කරත්තවලින් ඉක්මනින් ඉක්මනින් යන්න; ඔබේ ගැලුම් සතුන් වෙහෙසට පත් නොවන්නට වගබලා ගන්න’’ කියා කියයි. මේ පුරුෂයා අපේ මිතුරෙක් හෝ ඥාතියෙක් නොවේ. අපි කොහොමද ඔහු විශ්වාස කරන්නේ? පරණ තණ, දර හා ජලය අත් නොහැර, පටවාගත් බඩු එලෙසින්ම තබාගෙන වෙළෙඳ පිරිස ගෙන යන්න. අපි පරණ දේවල් අත් නොහරින්නෙමු’ යැයි කීවේය. ‘එසේය, පින්වත’ කියා ඒ වෙළෙන්දෝ ඒ වෙළෙඳ නායකයාට පිළිතුරු දී පටවාගත් බඩු එලෙසින්ම තබාගෙන වෙළෙඳ පිරිස ගෙන ගියෝය. ඔව්හු පළමු නැවතුම් පොළේද තණ, දර හෝ ජලය දුටුවේ නැත. දෙවන නැවතුම් පොළේද... තුන්වන නැවතුම් පොළේද... සිව්වන නැවතුම් පොළේද... පස්වන නැවතුම් පොළේද... හයවන නැවතුම් පොළේද... සත්වන නැවතුම් පොළේද තණ, දර හෝ ජලය දුටුවේ නැත. ඒ වෙළෙඳ පිරිස විපතට පත් වූ බව ඔව්හු දුටුවෝය. ඒ වෙළෙඳ පිරිසෙහි සිටි මිනිසුන් හෝ සතුන් යම් පමණ සිටියේද, ඒ සියල්ල ඒ අමනුෂ්‍ය යක්ෂයා විසින් භක්ෂණය කරන ලද ඇට පමණක් ඔව්හු දුටුවෝය. ‘‘එවිට ඒ වෙළෙඳ නායකයා වෙළෙන්දන් ඇමතුවේය. ‘පින්වතුනි, මේ වෙළෙඳ පිරිස විපතට පත්ව ඇත්තේ, ඒ අනුවණ නායකයාගේ මඟපෙන්වීම නිසාය. එබැවින් පින්වතුනි, අපේ කරත්තවල ඇති වටිනාකම අඩු බඩු අත්හැර, මේ වෙළෙඳ පිරිසෙහි ඇති වටිනාකම වැඩි බඩු ගන්න’ යැයි කීවේය. ‘එසේය, පින්වත’ කියා ඒ වෙළෙන්දෝ ඒ වෙළෙඳ නායකයාට පිළිතුරු දී තමන්ගේ කරත්තවල ඇති වටිනාකම අඩු බඩු අත්හැර, ඒ වෙළෙඳ පිරිසෙහි ඇති වටිනාකම වැඩි බඩු ගෙන ඒ කාන්තාරය සුවසේ තරණය කළෝය. ඒ නුවණැති නායකයාගේ මඟපෙන්වීම නිසාය. රාජඤ්ඤ, ඔබත් එලෙසමය. ඔබත් නුවණ නැති, අනුවණ පුද්ගලයෙක් වශයෙන් වැරදි මාර්ගයක ගමන් කරමින් පරලොව සොයන්නෙහු නම්, ඒ පළමු වෙළෙඳ නායකයා මෙන් විපතට පත් වන්නෙහිය. ඔබ කියන දේ අසන්නට කැමති, ඔබ විශ්වාස කරන දේ විශ්වාස කරන්නට කැමති අයත්, ඒ වෙළෙන්දන් මෙන් විපතට පත් වන්නෝය. රාජඤ්ඤ, මේ පාපී අදහස් දුරු කරන්න. රාජඤ්ඤ, මේ පාපී අදහස් දුරු කරන්න. එය ඔබට බොහෝ කාලයක් අහිත පිණිස, දුක් පිණිස නොවේවා.’’",
      "paliTitle": "Dve satthavāhaupamā",
      "englishTitle": "The Simile of Two Caravans",
      "sinhalaTitle": "සත්ථවාහ උපමා දෙක"
    },
    {
      "number": 431,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho nevāhaṃ sakkomi idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjituṃ. Rājāpi maṃ pasenadi kosalo jānāti tirorājānopi – ‘pāyāsi rājañño evaṃvādī evaṃdiṭṭhī – ‘‘itipi natthi paro loko…pe… vipāko’’’ti. Sacāhaṃ, bho kassapa, idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjissāmi, bhavissanti me vattāro – ‘yāva bālo pāyāsi rājañño, abyatto duggahitagāhī’ti. Kopenapi naṃ harissāmi, makkhenapi naṃ harissāmi, palāsenapi naṃ harissāmī’’ti. ",
      "english": "\"Even though the esteemed Kassapa says this, I am still unable to relinquish this evil viewpoint. King Pasenadi of Kosala knows me, and so do the tributary kings, as 'King Payasi holds this view, he maintains that \"There is no afterlife… no result of good and bad actions.\"' If I, esteemed Kassapa, were to relinquish this evil viewpoint, there will be those who will say of me, 'King Payasi is foolish, inexperienced, grasping poorly.' I will take them up with anger, I will take them up with disparagement, I will take them up with contempt.\"",
      "sinhala": "‘‘කස්සප ස්වාමීනි, ඔබ මෙසේ පැවසුවද, මට නම් මේ පාපී දෘෂ්ටිගතය අත්හැරීමට නොහැකිය. කොසලයේ පසේනදී රජුත්, අනෙකුත් රජවරුත් මා හඳුනන්නේ පායාසි රජු මෙවැනි මත දරන්නෙක්, මෙවැනි දෘෂ්ටියක් ඇත්තෙක් ලෙසයි. එනම්, ‘පරලොවක් නැත... විපාකයක් නැත’ යනුවෙනි. කස්සප ස්වාමීනි, මම මේ පාපී දෘෂ්ටිගතය අත්හැරියහොත්, ‘පායාසි රජු කොතරම් අඥානද, නොදන්නාකම නිසා වැරදි දේ තදින් ග්‍රහණය කරගෙන සිටින්නේද’ යැයි මට නින්දා කරන්නෝ ඇතිවනු ඇත. කෝපයෙන් හෝ කුහකත්වයෙන් හෝ ඊර්ෂ්‍යාවෙන් හෝ මම එය රැකගන්නෙමි.’’",
      "paliTitle": ""
    },
    {
      "number": 432,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Bhūtapubbaṃ, rājañña, aññataro sūkaraposako puriso sakamhā gāmā aññaṃ gāmaṃ agamāsi. Tattha addasa pahūtaṃ sukkhagūthaṃ chaḍḍitaṃ. Disvānassa etadahosi – ‘ayaṃ kho pahuto sukkhagūtho chaḍḍito, mama ca sūkarabhattaṃ [sūkarānaṃ bhakkho (syā.)]; yaṃnūnāhaṃ ito sukkhagūthaṃ hareyya’nti. So uttarāsaṅgaṃ pattharitvā pahūtaṃ sukkhagūthaṃ ākiritvā bhaṇḍikaṃ bandhitvā sīse ubbāhetvā [uccāropetvā (ka. sī. ka.)] agamāsi. Tassa antarāmagge mahāakālamegho pāvassi. So uggharantaṃ paggharantaṃ yāva agganakhā gūthena makkhito gūthabhāraṃ ādāya agamāsi. Tamenaṃ manussā disvā evamāhaṃsu – ‘kacci no tvaṃ, bhaṇe, ummatto, kacci viceto, kathañhi nāma uggharantaṃ paggharantaṃ yāva agganakhā gūthena makkhito gūthabhāraṃ harissasī’ti. ‘Tumhe khvettha, bhaṇe, ummattā, tumhe vicetā, tathā hi pana me sūkarabhatta’nti. Evameva kho tvaṃ, rājañña, gūthabhārikūpamo [gūthahārikūpamo (sī. pī.)] maññe paṭibhāsi. Paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ. Paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’ti.",
      "english": "\"Well then, king, I will make a simile for you. For with a simile some wise people here understand the meaning of what is said. Once upon a time, king, a certain pig farmer went from his own village to another village. There he saw a great heap of dry dung thrown away. Having seen it, this occurred to him: ‘This great heap of dry dung has been thrown away, and it is food for my pigs; suppose I were to carry dry dung from here.’ So, spreading out his upper robe, he gathered a great heap of dry dung, tied it into a bundle, and lifted it onto his head and went on. On the road between, a great rain cloud poured down. So, dripping and oozing, smeared with dung up to his fingernails, he went carrying the dung burden. Seeing him, people said to him: ‘Surely, good sir, you are mad, surely deranged, for how indeed will you go carrying a burden of dung, dripping and oozing, smeared with dung up to your fingernails?’ ‘You are the mad ones here, good sirs, you are deranged, for it is food for my pigs.’ Just so, king, I think you appear like someone carrying a burden of dung. Renounce this evil viewpoint, king. Renounce this evil viewpoint, king. May it not be for your harm and suffering for a long time.\"",
      "sinhala": "‘‘එසේ නම් රාජඤ්ඤ, මම ඔබට උපමාවක් කරන්නෙමි. නුවණැති ඇතැම් පුරුෂයෝ මෙහි උපමාවකින් කියන ලද දෙයෙහි අර්ථය දනිති. රාජඤ්ඤ, පෙර කලෙක එක්තරා ඌරන් පෝෂණය කරන්නෙක් තම ගමෙන් වෙනත් ගමකට ගියේය. එහිදී ඔහු බොහෝ වියළි අසූචි ගොඩගසා තිබෙනු දුටුවේය. දැක ඔහුට මෙවැනි අදහසක් ඇතිවිය – ‘මේ බොහෝ වියළි අසූචි ගොඩගසා තිබේ, මෙය මාගේ ඌරන්ගේ ආහාරය වේ; මම මෙතැනින් වියළි අසූචි ගෙන යන්නෙම් නම් මැනවැ’යි සිතුවේය. හෙතෙම උතුරු සළුව එළා බොහෝ වියළි අසූචි පුරවා මිටියක් බැඳ හිස මත තබාගෙන ගමන් කළේය. ඔහු ගමන් කරමින් සිටියදී අතරමග මහත් වූ අකල් වැස්සක් වැස්සේය. ඔහු ගලන, වැගිරෙන, නියපොතු අග දක්වා අසූචියෙන් තෙත් වූයේ අසූචි බර උසුලාගෙන ගමන් කළේය. මිනිස්සු ඔහු දැක මෙසේ කීහ – ‘අහෝ, ඔබ පිස්සෙක්ද, සිහි විකල් වූවෙක්ද, ගලන, වැගිරෙන, නියපොතු අග දක්වා අසූචියෙන් තෙත් වී අසූචි බරක් ගෙන යන්නේ කෙසේදැ’යි ඇසූහ. ‘අහෝ, මෙහි සිටින ඔබ පිස්සෝය, ඔබ සිහි විකල් වූවෝය, මන්ද මෙය මාගේ ඌරන්ගේ ආහාරය වේ’ යයි ඔහු කීවේය. රාජඤ්ඤ, ඔබත් එලෙසම අසූචි බරක් ගෙන යන්නෙකු හා සමාන යයි මම සිතමි. රාජඤ්ඤ, මේ පාපී දෘෂ්ටිගතය දුරු කරව. රාජඤ්ඤ, මේ පාපී දෘෂ්ටිගතය දුරු කරව. එය ඔබට බොහෝ කලක් අහිත පිණිස දුක් පිණිස නොවේවා.’’",
      "paliTitle": "Gūthabhārikaupamā",
      "englishTitle": "The Burden of Dung Simile",
      "sinhalaTitle": "ගූථභාරික උපමාව"
    },
    {
      "number": 433,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho nevāhaṃ sakkomi idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjituṃ. Rājāpi maṃ pasenadi kosalo jānāti tirorājānopi – ‘pāyāsi rājañño evaṃvādī evaṃdiṭṭhī – ‘‘itipi natthi paro loko…pe… vipāko’’ti. Sacāhaṃ, bho kassapa, idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjissāmi, bhavissanti me vattāro – ‘yāva bālo pāyāsi rājañño abyatto duggahitagāhī’ti. Kopenapi naṃ harissāmi, makkhenapi naṃ harissāmi, palāsenapi naṃ harissāmī’’ti. ",
      "english": "\"Even though the venerable Kassapa speaks thus, still, I am not able to relinquish this evil view. King Pasenadi of Kosala knows me, and so do the tributary kings, that 'King Payasi holds this view and speaks thus: \"There is no other world...nor is there any result of good and bad actions.\"' If I, venerable Kassapa, were to relinquish this evil view, I would have those who would speak against me, saying, 'Indeed, King Payasi is foolish and inexperienced, holding on to things wrongly.' I will take them by anger, I will take them by detraction, I will take them by malice.\"",
      "sinhala": "‘‘කෙසේ වුවද භවත් කාශ්‍යපයන් මෙසේ පවසන නමුත්, මට මේ පාපී දෘෂ්ටිගතය බැහැර කිරීමට නොහැකිය. මහරජ කොසල පසේනදී රජතුමා ද මා හඳුනයි, අනෙක් රජවරු ද හඳුනති. ‘පායාසි රජතුමා මෙබඳු මත දරන, මෙබඳු දෘෂ්ටියක් ඇති කෙනෙකි. එනම්, මෙලොව හැර පරලොවක් නැත... විපාකයක් නැත’ යනුවෙනි. භවත් කාශ්‍යපයෙනි, මම මේ පාපී දෘෂ්ටිගතය බැහැර කළහොත්, මට මෙසේ කියන්නෝ සිටිනු ඇත. ‘පායාසි රජතුමා කොතරම් නම් බාලද, අව්‍යක්ත ද, වැරදි ලෙස ග්‍රහණය කරගත්තාද’ කියා මට කියනු ඇත. මම කෝපයෙන් හෝ එය දරන්නෙමි, ගුණමකුකමෙන් හෝ එය දරන්නෙමි, වංචාවෙන් හෝ එය දරන්නෙමි.’’",
      "paliTitle": ""
    },
    {
      "number": 434,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi, upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Bhūtapubbaṃ, rājañña, dve akkhadhuttā akkhehi dibbiṃsu. Eko akkhadhutto āgatāgataṃ kaliṃ gilati. Addasā kho dutiyo akkhadhutto taṃ akkhadhuttaṃ āgatāgataṃ kaliṃ gilantaṃ, disvā taṃ akkhadhuttaṃ etadavoca – ‘tvaṃ kho, samma, ekantikena jināsi, dehi me, samma, akkhe pajohissāmī’ti. ‘Evaṃ sammā’ti kho so akkhadhutto tassa akkhadhuttassa akkhe pādāsi. Atha kho so akkhadhutto akkhe visena paribhāvetvā taṃ akkhadhuttaṃ etadavoca – ‘ehi kho, samma, akkhehi dibbissāmā’ti. ‘Evaṃ sammā’ti kho so akkhadhutto tassa akkhadhuttassa paccassosi. Dutiyampi kho te akkhadhuttā akkhehi dibbiṃsu. Dutiyampi kho so akkhadhutto āgatāgataṃ kaliṃ gilati. Addasā kho dutiyo akkhadhutto taṃ akkhadhuttaṃ dutiyampi āgatāgataṃ kaliṃ gilantaṃ, disvā taṃ akkhadhuttaṃ etadavoca – ‘‘Littaṃ paramena tejasā, gilamakkhaṃ puriso na bujjhati; Gila re gila pāpadhuttaka [gili re pāpadhuttaka (ka.)], pacchā te kaṭukaṃ bhavissatīti. ‘‘Evameva kho tvaṃ, rājañña, akkhadhuttakūpamo maññe paṭibhāsi. Paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ; paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’ti.",
      "english": "\"Then, O king, I will give you an analogy; for through an analogy some intelligent people here understand the meaning of what is said. Once upon a time, O king, two dice players were gambling with dice. One dice player swallowed the losing throw each time it came. The second dice player saw that dice player swallowing the losing throw each time it came, and having seen this, he said to him: ‘Friend, you are winning in a one-sided way; give me the dice, friend, I will play.’ ‘Very well, friend,’ that dice player gave the dice to that other dice player. Then that dice player, having treated the dice with poison, said to that dice player: ‘Come, friend, let us gamble with dice.’ ‘Very well, friend,’ that dice player agreed with that dice player. For the second time those dice players gambled with dice. For the second time that dice player swallowed the losing throw each time it came. The second dice player saw that dice player swallowing the losing throw for the second time each time it came, and having seen this, he said to that dice player: ‘Anointed with supreme intensity, a man does not realize he is swallowing the dice-throw; Swallow, indeed, swallow, you wicked gambler, afterward it will be bitter for you.’ Just so, O king, you seem to me to be like that dice player. Relinquish this, O king, this evil viewpoint; relinquish this, O king, this evil viewpoint. May it not be for your long-term harm and suffering.\"",
      "sinhala": "‘‘එසේ නම්, රජතුමනි, මම ඔබට උපමාවක් කරන්නෙමි. නුවණැති ඇතැම් පුරුෂයෝ මෙහි උපමාවකින් කියන ලද දෙයෙහි අර්ථය දනිති. රජතුමනි, පෙර කලෙක අක්ෂ ක්‍රීඩාවෙහි දක්ෂ සූදුකාරයෝ දෙදෙනෙක් අක්ෂයෙන් සූදක්‍රීඩා කළහ. එක් සූදුකාරයෙක් පැමිණෙන පැමිණෙන දාදු කැටය ගිල දමයි. එවිට දෙවෙනි සූදුකාරයා ඒ සූදුකාරයා පැමිණෙන පැමිණෙන දාදු කැටය ගිල දමනු දැක, ඒ සූදුකාරයාට මෙසේ කීවේය. ‘සහෝදරය, ඔබ එකහෙළාම ජය ලබනවා. මට දෙන්න, සහෝදරය, අක්ෂය දමන්නෙමි’ කියායි. ‘එසේ වේවා සහෝදරය’ කියා ඒ සූදුකාරයා අක්ෂය ඒ සූදුකාරයාට දුන්නේය. ඉක්බිති ඒ සූදුකාරයා අක්ෂය විෂෙන් තවරා ඒ සූදුකාරයාට මෙසේ කීවේය. ‘එන්න සහෝදරය, අක්ෂයෙන් සූදක්‍රීඩා කරමු’ කියායි. ‘එසේ වේවා සහෝදරය’ කියා ඒ සූදුකාරයා ඒ සූදුකාරයාට පිළිතුරු දුන්නේය. දෙවෙනි වරටත් ඒ සූදුකාරයෝ අක්ෂයෙන් සූදක්‍රීඩා කළහ. දෙවෙනි වරටත් ඒ සූදුකාරයා පැමිණෙන පැමිණෙන දාදු කැටය ගිල දමයි. එවිට දෙවෙනි සූදුකාරයා ඒ සූදුකාරයා දෙවෙනි වරටත් පැමිණෙන පැමිණෙන දාදු කැටය ගිල දමනු දැක, ඒ සූදුකාරයාට මෙසේ කීවේය. ‘ඉතා තෙද ඇති විෂෙන් තවරා ගිලින අක්ෂය පුරුෂයා නොදනී. ගිලින්න ගිලින්න පාපී සූදුකාරය, පසුව එය ඔබට කටුක වන්නේය’ කියායි. රජතුමනි, ඔබත් ඒ අක්ෂ සූදුකාරයා වැනියයි මම සිතමි. රජතුමනි, මේ පාපී දෘෂ්ටිගතය අත්හරින්න. රජතුමනි, මේ පාපී දෘෂ්ටිගතය අත්හරින්න. එය ඔබට බොහෝ කලක් අවැඩ පිණිස දුක් පිණිස නොවේවා.’’",
      "paliTitle": "Akkhadhuttakaupamā",
      "englishTitle": "The Simile of the Dice Gambler",
      "sinhalaTitle": "අක්ඛධුත්තක උපමාව"
    },
    {
      "number": 435,
      "pali": "‘‘Kiñcāpi bhavaṃ kassapo evamāha, atha kho nevāhaṃ sakkomi idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjituṃ. Rājāpi maṃ pasenadi kosalo jānāti tirorājānopi – ‘pāyāsi rājañño evaṃvādī evaṃdiṭṭhī – ‘‘itipi natthi paro loko…pe… vipāko’’ti. Sacāhaṃ, bho kassapa, idaṃ pāpakaṃ diṭṭhigataṃ paṭinissajjissāmi, bhavissanti me vattāro – ‘yāva bālo pāyāsi rājañño abyatto duggahitagāhī’ti. Kopenapi naṃ harissāmi, makkhenapi naṃ harissāmi, palāsenapi naṃ harissāmī’’ti. ",
      "english": "\"Even though the venerable Kassapa speaks thus, I am not able to relinquish this evil viewpoint. King Pasenadi of Kosala knows me, and so do the rulers of outlying districts, that ‘King Payasi holds such views and says: \"There is no other world… and there is no result of good or bad actions.\"’ If I, venerable Kassapa, were to relinquish this evil viewpoint, there will be those who would say of me, ‘So foolish and inexperienced is King Payasi, he has grasped wrongly.’ I will uphold it with anger, I will uphold it with contempt, I will uphold it with stubbornness.\"",
      "sinhala": "‘‘කස්සප භවත් මෙසේ කීවත්, මම මේ පාපී දෘෂ්ටිගතය අත්හැරීමට නොහැකි වෙමි. පසේනදි කොසොල රජු ද මා දන්නේ ය, අනෙක් රජවරු ද මා දන්නේ ය. ‘පායාසි රජ්ජු මෙබඳු මත ඇත්තේ ය, මෙබඳු දෘෂ්ටි ඇත්තේ ය. ‘මෙලොවක් නැත... විපාක නැත’ යනුවෙන් ද කියන්නේ ය. කස්සප භවත්, මම මේ පාපී දෘෂ්ටිගතය අත්හැරියහොත්, ‘පායාසි රජ්ජු තවමත් බාල ය, අව්‍යක්ත ය, වැරදි ලෙස ග්‍රහණය කරගත්තේ ය’ යැයි මට කියන්නෝ සිටිති. මම එය ක්‍රෝධයෙන් දරාගන්නෙමි, මම එය මානයෙන් දරාගන්නෙමි, මම එය ඊර්ෂ්‍යාවෙන් දරාගන්නෙමි.’’",
      "paliTitle": ""
    },
    {
      "number": 436,
      "pali": "‘‘Tena hi, rājañña, upamaṃ te karissāmi, upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Bhūtapubbaṃ, rājañña, aññataro janapado vuṭṭhāsi. Atha kho sahāyako sahāyakaṃ āmantesi – ‘āyāma, samma, yena so janapado tenupasaṅkamissāma, appeva nāmettha kiñci dhanaṃ adhigaccheyyāmā’ti. ‘Evaṃ sammā’ti kho sahāyako sahāyakassa paccassosi. Te yena so janapado, yena aññataraṃ gāmapaṭṭaṃ [gāmapajjaṃ (syā.), gāmapattaṃ (sī.)] tenupasaṅkamiṃsu, tattha addasaṃsu pahūtaṃ sāṇaṃ chaḍḍitaṃ, disvā sahāyako sahāyakaṃ āmantesi – ‘idaṃ kho, samma, pahūtaṃ sāṇaṃ chaḍḍitaṃ, tena hi, samma, tvañca sāṇabhāraṃ bandha, ahañca sāṇabhāraṃ bandhissāmi, ubho sāṇabhāraṃ ādāya gamissāmā’ti. ‘Evaṃ sammā’ti kho sahāyako sahāyakassa paṭissutvā sāṇabhāraṃ bandhitvā te ubho sāṇabhāraṃ ādāya yena aññataraṃ gāmapaṭṭaṃ tenupasaṅkamiṃsu. Tattha addasaṃsu pahūtaṃ sāṇasuttaṃ chaḍḍitaṃ, disvā sahāyako sahāyakaṃ āmantesi – ‘yassa kho, samma, atthāya iccheyyāma sāṇaṃ, idaṃ pahūtaṃ sāṇasuttaṃ chaḍḍitaṃ. Tena hi, samma, tvañca sāṇabhāraṃ chaḍḍehi, ahañca sāṇabhāraṃ chaḍḍessāmi, ubho sāṇasuttabhāraṃ ādāya gamissāmā’ti. ‘Ayaṃ kho me, samma, sāṇabhāro dūrābhato ca susannaddho ca, alaṃ me tvaṃ pajānāhī’ti. Atha kho so sahāyako sāṇabhāraṃ chaḍḍetvā sāṇasuttabhāraṃ ādiyi. ‘‘Te yena aññataraṃ gāmapaṭṭaṃ tenupasaṅkamiṃsu. Tattha addasaṃsu pahūtā sāṇiyo chaḍḍitā, disvā sahāyako sahāyakaṃ āmantesi – ‘yassa kho, samma, atthāya iccheyyāma sāṇaṃ vā sāṇasuttaṃ vā, imā pahūtā sāṇiyo chaḍḍitā. Tena hi, samma, tvañca sāṇabhāraṃ chaḍḍehi, ahañca sāṇasuttabhāraṃ chaḍḍessāmi, ubho sāṇibhāraṃ ādāya gamissāmā’ti. ‘Ayaṃ kho me, samma, sāṇabhāro dūrābhato ca susannaddho ca, alaṃ me, tvaṃ pajānāhī’ti. Atha kho so sahāyako sāṇasuttabhāraṃ chaḍḍetvā sāṇibhāraṃ ādiyi. ‘‘Te yena aññataraṃ gāmapaṭṭaṃ tenupasaṅkamiṃsu. Tattha addasaṃsu pahūtaṃ khomaṃ chaḍḍitaṃ, disvā…pe… pahūtaṃ khomasuttaṃ chaḍḍitaṃ, disvā… pahūtaṃ khomadussaṃ chaḍḍitaṃ, disvā… pahūtaṃ kappāsaṃ chaḍḍitaṃ, disvā… pahūtaṃ kappāsikasuttaṃ chaḍḍitaṃ, disvā… pahūtaṃ kappāsikadussaṃ chaḍḍitaṃ, disvā… pahūtaṃ ayaṃ [ayasaṃ (syā.)] chaḍḍitaṃ, disvā… pahūtaṃ lohaṃ chaḍḍitaṃ, disvā… pahūtaṃ tipuṃ chaḍḍitaṃ, disvā… pahūtaṃ sīsaṃ chaḍḍitaṃ, disvā… pahūtaṃ sajjhaṃ [sajjhuṃ (sī. syā. pī.)] chaḍḍitaṃ, disvā… pahūtaṃ suvaṇṇaṃ chaḍḍitaṃ, disvā sahāyako sahāyakaṃ āmantesi – ‘yassa kho, samma, atthāya iccheyyāma sāṇaṃ vā sāṇasuttaṃ vā sāṇiyo vā khomaṃ vā khomasuttaṃ vā khomadussaṃ vā kappāsaṃ vā kappāsikasuttaṃ vā kappāsikadussaṃ vā ayaṃ vā lohaṃ vā tipuṃ vā sīsaṃ vā sajjhaṃ vā, idaṃ pahūtaṃ suvaṇṇaṃ chaḍḍitaṃ. Tena hi, samma, tvañca sāṇabhāraṃ chaḍḍehi, ahañca sajjhabhāraṃ [sajjhubhāraṃ (sī. syā. pī.)] chaḍḍessāmi, ubho suvaṇṇabhāraṃ ādāya gamissāmā’ti. ‘Ayaṃ kho me, samma, sāṇabhāro dūrābhato ca susannaddho ca, alaṃ me tvaṃ pajānāhī’ti. Atha kho so sahāyako sajjhabhāraṃ chaḍḍetvā suvaṇṇabhāraṃ ādiyi. ‘‘Te yena sako gāmo tenupasaṅkamiṃsu. Tattha yo so sahāyako sāṇabhāraṃ ādāya agamāsi, tassa neva mātāpitaro abhinandiṃsu, na puttadārā abhinandiṃsu, na mittāmaccā abhinandiṃsu, na ca tatonidānaṃ sukhaṃ somanassaṃ adhigacchi. Yo pana so sahāyako suvaṇṇabhāraṃ ādāya agamāsi, tassa mātāpitaropi abhinandiṃsu, puttadārāpi abhinandiṃsu, mittāmaccāpi abhinandiṃsu, tatonidānañca sukhaṃ somanassaṃ adhigacchi. ‘‘Evameva kho tvaṃ, rājañña, sāṇabhārikūpamo maññe paṭibhāsi. Paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ; paṭinissajjetaṃ, rājañña, pāpakaṃ diṭṭhigataṃ. Mā te ahosi dīgharattaṃ ahitāya dukkhāyā’’ti. ",
      "english": "\"Then, Royal One, I will make a simile for you; for through a simile some intelligent people here understand the meaning of what is said. In the past, Royal One, a certain district prospered. Then a companion addressed a companion: ‘Come, friend, let us go to that district, perhaps we might acquire some wealth there.’ ‘Yes, friend,’ the companion replied to his companion. They went to that district, to a certain village boundary, and there they saw much hemp discarded. Seeing this, one companion addressed the other: ‘Friend, much hemp has been discarded; therefore, friend, you bind a load of hemp, and I will bind a load of hemp, and both of us, taking a load of hemp, will go on.’ ‘Yes, friend,’ the companion agreed to his companion, and having bound a load of hemp, both of them, taking a load of hemp, went to a certain village boundary. There they saw much hemp fiber discarded. Seeing this, one companion addressed the other: ‘Friend, for the sake of which we might desire hemp, much hemp fiber has been discarded. Therefore, friend, you discard your load of hemp, and I will discard my load of hemp, and both of us, taking a load of hemp fiber, will go on.’ ‘Friend, this load of hemp of mine has been brought from afar and is well-bound; enough for me, you may do as you think fit.’ Then that companion discarded his load of hemp and took up a load of hemp fiber.\n\n\"They went to a certain village boundary. There they saw much woven hemp cloth discarded. Seeing this, one companion addressed the other: ‘Friend, for the sake of which we might desire hemp or hemp fiber, much woven hemp cloth has been discarded. Therefore, friend, you discard your load of hemp, and I will discard my load of hemp fiber, and both of us, taking a load of woven hemp cloth, will go on.’ ‘Friend, this load of hemp of mine has been brought from afar and is well-bound; enough for me, you may do as you think fit.’ Then that companion discarded his load of hemp fiber and took up a load of woven hemp cloth.\n\n\"They went to a certain village boundary. There they saw much flax discarded… much flax fiber discarded… much flax cloth discarded… much cotton discarded… much cotton fiber discarded… much cotton cloth discarded… much iron discarded… much copper discarded… much tin discarded… much lead discarded… much silver discarded… much gold discarded. Seeing this, one companion addressed the other: ‘Friend, for the sake of which we might desire hemp or hemp fiber or woven hemp cloth or flax or flax fiber or flax cloth or cotton or cotton fiber or cotton cloth or iron or copper or tin or lead or silver, much gold has been discarded. Therefore, friend, you discard your load of hemp, and I will discard my load of silver, and both of us, taking a load of gold, will go on.’ ‘Friend, this load of hemp of mine has been brought from afar and is well-bound; enough for me, you may do as you think fit.’ Then that companion discarded his load of silver and took up a load of gold.\n\n\"They went to their own village. There, that companion who had gone with a load of hemp, neither his mother and father welcomed him, nor his children and wife welcomed him, nor his friends and associates welcomed him, and he did not obtain happiness and joy on that account. But that companion who had gone with a load of gold, his mother and father welcomed him, his children and wife welcomed him, his friends and associates welcomed him, and he obtained happiness and joy on that account.\n\n\"Just so, Royal One, you seem to me to be like the one carrying a load of hemp. Abandon, Royal One, that evil view; abandon, Royal One, that evil view. Let it not be for your long-term harm and suffering.\"",
      "sinhala": "‘‘එසේ නම්, රාජඤ්ඤ, මම ඔබට උපමාවක් කරන්නෙමි. මෙහි සමහර නුවණැති පුරුෂයෝ උපමාවකින් කියන ලද දෙයෙහි අර්ථය දැන ගනිති. රාජඤ්ඤ, පෙර කලෙක එක්තරා ජනපදයක් විය. ඉක්බිති යහළුවෙක් යහළුවෙකුට කතා කොට ‘යහළුව, එන්න, යම් ජනපදයක් වේ ද, එහි යමු. අපට එහි කිසියම් ධනයක් ලැබෙන්නටත් පුළුවනැ’යි කී ය. ‘එසේ යහළුව’යි යහළුවා, යහළුවාට පිළිවදන් දුන්නේ ය. ඔවුහු යම් ජනපදයක් වෙතට ද, යම් ගම් දොරකඩක් වෙතට ද පැමිණියෝ, එහි විසිකරන ලද සණ බොහෝ දැක, යහළුවා යහළුවෙකුට කතා කෙළේ ය. ‘යහළුව, මෙහි සණ බොහෝ විසිකර තිබේ. එහෙයින්, යහළුව, ඔබත් සණ මිටියක් බඳින්න. මමත් සණ මිටියක් බඳින්නෙමි. අපි දෙදෙනා ම සණ මිටි ගෙන යමු’යි කී ය. ‘එසේ යහළුව’යි යහළුවා, යහළුවාට පිළිතුරු දී සණ මිටියක් බැඳ, ඒ දෙදෙනා ම සණ මිටි ගෙන යම් ගම් දොරකඩක් වෙතට පැමිණියෝ ය. එහි විසිකරන ලද සණ නූල් බොහෝ දැක, යහළුවා යහළුවෙකුට කතා කෙළේ ය. ‘යහළුව, අපි යම් දෙයක් සඳහා සණ පතමු නම්, මේ සණ නූල් බොහෝ විසිකර තිබේ. එහෙයින්, යහළුව, ඔබත් සණ මිටිය අත්හරින්න. මමත් සණ මිටිය අත්හරින්නෙමි. අපි දෙදෙනා ම සණ නූල් මිටියක් ගෙන යමු’යි කී ය. ‘යහළුව, මේ මාගේ සණ මිටිය දුරින් ගෙනෙන ලද්දේ ද, මැනවින් බඳින ලද්දේ ද වේ. මට එය සෑහේ. ඔබ දන ගන්න’යි කී ය. ඉක්බිති ඒ යහළුවා සණ මිටිය අත්හැර සණ නූල් මිටිය ගත්තේ ය.\n\n‘‘ඔවුහු යම් ගම් දොරකඩක් වෙතට පැමිණියෝ ය. එහි විසිකරන ලද සණ රෙදි බොහෝ දැක, යහළුවා යහළුවෙකුට කතා කෙළේ ය. ‘යහළුව, අපි යම් දෙයක් සඳහා සණ හෝ සණ නූල් හෝ පතමු නම්, මේ සණ රෙදි බොහෝ විසිකර තිබේ. එහෙයින්, යහළුව, ඔබත් සණ මිටිය අත්හරින්න. මමත් සණ නූල් මිටිය අත්හරින්නෙමි. අපි දෙදෙනා ම සණ රෙදි මිටියක් ගෙන යමු’යි කී ය. ‘යහළුව, මේ මාගේ සණ මිටිය දුරින් ගෙනෙන ලද්දේ ද, මැනවින් බඳින ලද්දේ ද වේ. මට එය සෑහේ. ඔබ දන ගන්න’යි කී ය. ඉක්බිති ඒ යහළුවා සණ නූල් මිටිය අත්හැර සණ රෙදි මිටිය ගත්තේ ය.\n\n‘‘ඔවුහු යම් ගම් දොරකඩක් වෙතට පැමිණියෝ ය. එහි විසිකරන ලද කෝම රෙදි බොහෝ දැක... කෝම නූල් බොහෝ දැක... කෝම වස්ත්‍ර බොහෝ දැක... කපු බොහෝ දැක... කපු නූල් බොහෝ දැක... කපු වස්ත්‍ර බොහෝ දැක... යකඩ බොහෝ දැක... ලෝහ බොහෝ දැක... ටින් බොහෝ දැක... ඊයම් බොහෝ දැක... රිදී බොහෝ දැක... රන් බොහෝ දැක, යහළුවා යහළුවෙකුට කතා කෙළේ ය. ‘යහළුව, අපි යම් දෙයක් සඳහා සණ හෝ සණ නූල් හෝ සණ රෙදි හෝ කෝම රෙදි හෝ කෝම නූල් හෝ කෝම වස්ත්‍ර හෝ කපු හෝ කපු නූල් හෝ කපු වස්ත්‍ර හෝ යකඩ හෝ ලෝහ හෝ ටින් හෝ ඊයම් හෝ රිදී හෝ පතමු නම්, මේ රන් බොහෝ විසිකර තිබේ. එහෙයින්, යහළුව, ඔබත් සණ මිටිය අත්හරින්න. මමත් රිදී මිටිය අත්හරින්නෙමි. අපි දෙදෙනා ම රන් මිටියක් ගෙන යමු’යි කී ය. ‘යහළුව, මේ මාගේ සණ මිටිය දුරින් ගෙනෙන ලද්දේ ද, මැනවින් බඳින ලද්දේ ද වේ. මට එය සෑහේ. ඔබ දන ගන්න’යි කී ය. ඉක්බිති ඒ යහළුවා රිදී මිටිය අත්හැර රන් මිටිය ගත්තේ ය.\n\n‘‘ඔවුහු තම ගමට පැමිණියෝ ය. එහි යම් යහළුවෙක් සණ මිටිය ගෙන ගියේ ද, ඔහුගේ මවුපියෝ ද සතුටු නොවූ හ. පුත්‍ර භාර්යාවෝ ද සතුටු නොවූ හ. මිත්‍ර ඇමතියෝ ද සතුටු නොවූ හ. ඔහු එයින් සතුටක් හෝ සෝමනස්සයක් හෝ නොලැබී ය. යම් යහළුවෙක් රන් මිටිය ගෙන ගියේ ද, ඔහුගේ මවුපියෝ ද සතුටු වූ හ. පුත්‍ර භාර්යාවෝ ද සතුටු වූ හ. මිත්‍ර ඇමතියෝ ද සතුටු වූ හ. ඔහු එයින් සතුටක් හා සෝමනස්සයක් ලැබී ය.\n\n‘‘රාජඤ්ඤ, එපරිද්දෙන් ම ඔබ සණ මිටි ගත් පුද්ගලයා වැනි යැයි මට හැඟේ. රාජඤ්ඤ, මේ පාපී දෘෂ්ටිගතය අත්හරින්න. රාජඤ්ඤ, මේ පාපී දෘෂ්ටිගතය අත්හරින්න. එය ඔබට බොහෝ කල් අනර්ථයට දුකට හේතු නොවන්නේ වා.’’",
      "paliTitle": "Sāṇabhārikaupamā",
      "englishTitle": "The Burden-Bearer Simile",
      "sinhalaTitle": "සණභාරික උපමා"
    },
    {
      "number": 437,
      "pali": "‘‘Purimeneva ahaṃ opammena bhoto kassapassa attamano abhiraddho. Api cāhaṃ imāni vicitrāni pañhāpaṭibhānāni sotukāmo evāhaṃ bhavantaṃ kassapaṃ paccanīkaṃ kātabbaṃ amaññissaṃ. Abhikkantaṃ, bho kassapa, abhikkantaṃ, bho kassapa. Seyyathāpi, bho kassapa, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti evamevaṃ bhotā kassapena anekapariyāyena dhammo pakāsito. Esāhaṃ, bho kassapa, taṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ kassapo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gataṃ. ‘‘Icchāmi cāhaṃ, bho kassapa, mahāyaññaṃ yajituṃ, anusāsatu maṃ bhavaṃ kassapo, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’’ti.",
      "english": "\"Even before this, I was pleased and delighted by the venerable Kassapa's simile. However, I considered that I should dispute with the venerable Kassapa, being desirous of hearing these varied displays of wisdom. Excellent, venerable Kassapa! Excellent, venerable Kassapa! Just as, venerable Kassapa, one might set upright what was overturned, or reveal what was hidden, or point out the path to one who is lost, or hold up an oil lamp in the dark, so that those with eyes might see forms, even so has the Dhamma been made clear in many ways by the venerable Kassapa. I, venerable Kassapa, go to the venerable Gotama for refuge, and to the Dhamma, and to the Sangha of monks. May the venerable Kassapa accept me as a lay follower who has gone for refuge from this day forward, for as long as life lasts. And I wish, venerable Kassapa, to perform a great sacrifice. Let the venerable Kassapa instruct me as to what will be for my long-term benefit and happiness.\"",
      "sinhala": "‘‘පූර්වයෙහි ම මම ඔබ කස්සපයන්ගේ උපමාවෙන් සතුටු වූයෙමි, ඇලුම් කළෙමි. එහෙත් මම මේ විචිත්‍ර ප්‍රශ්න විසඳුම් අසන්නට කැමැත්තෙමි. එබැවින් මම ඔබ කස්සපයන් ප්‍රතිවාදියෙකු ලෙස නොසැලකුවෙමි. අතිශයින් මැනවි කස්සපයෙනි, අතිශයින් මැනවි කස්සපයෙනි. කස්සපයෙනි, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වැසූ දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මාර්ගය කියන්නේ ද, ‘ඇස් ඇත්තෝ රූප දකිත්’ යි අඳුරෙහි තෙල් පහනක් දරන්නේ ද, එලෙසින් ම කස්සපයන් විසින් බොහෝ ආකාරයෙන් ධර්මය ප්‍රකාශ කරන ලදී. කස්සපයෙනි, මම ඒ භවත් ගෞතමයන් වහන්සේ සරණ යමි, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි. කස්සපයන් වහන්ස, අද පටන් දිවි ඇති තෙක් සරණ ගිය මා උපාසකයෙකු ලෙස දරනු මැනව. කස්සපයෙනි, මම මහත් යාගයක් කිරීමට කැමැත්තෙමි. මට අනුශාසනා කරනු මැනව, එය මට බොහෝ කලක් හිතසුව පිණිස වන සේ’’යි.",
      "paliTitle": "Saraṇagamanaṃ",
      "englishTitle": "Going for Refuge",
      "sinhalaTitle": "සරණාගමනය"
    },
    {
      "number": 438,
      "pali": "‘‘Yathārūpe kho, rājañña, yaññe gāvo vā haññanti ajeḷakā vā haññanti, kukkuṭasūkarā vā haññanti, vividhā vā pāṇā saṃghātaṃ āpajjanti, paṭiggāhakā ca honti micchādiṭṭhī micchāsaṅkappā micchāvācā micchākammantā micchāājīvā micchāvāyāmā micchāsatī micchāsamādhī, evarūpo kho, rājañña, yañño na mahapphalo hoti na mahānisaṃso na mahājutiko na mahāvipphāro. Seyyathāpi, rājañña, kassako bījanaṅgalaṃ ādāya vanaṃ paviseyya. So tattha dukkhette dubbhūme avihatakhāṇukaṇṭake bījāni patiṭṭhāpeyya khaṇḍāni pūtīni vātātapahatāni asāradāni asukhasayitāni. Devo ca na kālena kālaṃ sammādhāraṃ anuppaveccheyya. Api nu tāni bījāni vuddhiṃ virūḷhiṃ [viruḷhiṃ (moggalāne)] vepullaṃ āpajjeyyuṃ, kassako vā vipulaṃ phalaṃ adhigaccheyyā’’ti? ‘‘No hidaṃ [na evaṃ (syā. ka.)] bho kassapa’’. ‘‘Evameva kho, rājañña, yathārūpe yaññe gāvo vā haññanti, ajeḷakā vā haññanti, kukkuṭasūkarā vā haññanti, vividhā vā pāṇā saṃghātaṃ āpajjanti, paṭiggāhakā ca honti micchādiṭṭhī micchāsaṅkappā micchāvācā micchākammantā micchāājīvā micchāvāyāmā micchāsatī micchāsamādhī, evarūpo kho, rājañña, yañño na mahapphalo hoti na mahānisaṃso na mahājutiko na mahāvipphāro. ‘‘Yathārūpe ca kho, rājañña, yaññe neva gāvo haññanti, na ajeḷakā haññanti, na kukkuṭasūkarā haññanti, na vividhā vā pāṇā saṃghātaṃ āpajjanti, paṭiggāhakā ca honti sammādiṭṭhī sammāsaṅkappā sammāvācā sammākammantā sammāājīvā sammāvāyāmā sammāsatī sammāsamādhī, evarūpo kho, rājañña, yañño mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Seyyathāpi, rājañña, kassako bījanaṅgalaṃ ādāya vanaṃ paviseyya. So tattha sukhette subhūme suvihatakhāṇukaṇṭake bījāni patiṭṭhapeyya akhaṇḍāni apūtīni avātātapahatāni sāradāni sukhasayitāni. Devo ca kālena kālaṃ sammādhāraṃ anuppaveccheyya. Api nu tāni bījāni vuddhiṃ virūḷhiṃ vepullaṃ āpajjeyyuṃ, kassako vā vipulaṃ phalaṃ adhigaccheyyā’’ti? ‘‘Evaṃ, bho kassapa’’. ‘‘Evameva kho, rājañña, yathārūpe yaññe neva gāvo haññanti, na ajeḷakā haññanti, na kukkuṭasūkarā haññanti, na vividhā vā pāṇā saṃghātaṃ āpajjanti, paṭiggāhakā ca honti sammādiṭṭhī sammāsaṅkappā sammāvācā sammākammantā sammāājīvā sammāvāyāmā sammāsatī sammāsamādhī, evarūpo kho, rājañña, yañño mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’ti.",
      "english": "\"Your Majesty, a sacrifice of the kind where cows are killed, or goats and sheep are killed, or chickens and pigs are killed, or various living beings meet their death, and the recipients hold wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong concentration, Your Majesty, a sacrifice of this kind is not of great fruit, not of great benefit, not of great splendor, not of great extent. It is just as, Your Majesty, if a farmer, taking seeds and a plough, should enter a forest. There he might plant seeds in a bad field, in bad soil, where stumps and thorns have not been removed, seeds that are broken, rotten, damaged by wind and sun, without substance, badly placed. And the god does not send proper rain at the right time. Would those seeds attain growth, increase, and abundance, or would the farmer gain abundant fruit?\"\n\n\"No, Venerable Kassapa.\"\n\n\"Just so, Your Majesty, a sacrifice of the kind where cows are killed, or goats and sheep are killed, or chickens and pigs are killed, or various living beings meet their death, and the recipients hold wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong concentration, Your Majesty, a sacrifice of this kind is not of great fruit, not of great benefit, not of great splendor, not of great extent.\n\n\"And Your Majesty, a sacrifice of the kind where neither cows are killed, nor goats and sheep are killed, nor chickens and pigs are killed, nor various living beings meet their death, and the recipients hold right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration, Your Majesty, a sacrifice of this kind is of great fruit, of great benefit, of great splendor, of great extent. It is just as, Your Majesty, if a farmer, taking seeds and a plough, should enter a forest. There he might plant seeds in a good field, in good soil, where stumps and thorns have been well removed, seeds that are unbroken, unrotten, undamaged by wind and sun, with substance, well placed. And the god sends proper rain at the right time. Would those seeds attain growth, increase, and abundance, or would the farmer gain abundant fruit?\"\n\n\"Yes, Venerable Kassapa.\"\n\n\"Just so, Your Majesty, a sacrifice of the kind where neither cows are killed, nor goats and sheep are killed, nor chickens and pigs are killed, nor various living beings meet their death, and the recipients hold right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration, Your Majesty, a sacrifice of this kind is of great fruit, of great benefit, of great splendor, of great extent.\"",
      "sinhala": "‘‘මහරජ, යම් ආකාර වූ යාගයක ගවයන් මරනු ලබත් ද, එළුවන් බැටළුවන් මරනු ලබත් ද, කුකුළන් ඌරන් මරනු ලබත් ද, නොයෙක් ආකාර සත්වයෝ විනාශයට පත් වෙත් ද, පිළිගන්නෝ ද මිථ්‍යා දෘෂ්ටිකයෝ ද, මිථ්‍යා සංකල්ප ඇත්තෝ ද, මිථ්‍යා වචන ඇත්තෝ ද, මිථ්‍යා කර්මාන්ත ඇත්තෝ ද, මිථ්‍යා ජීවිකා ඇත්තෝ ද, මිථ්‍යා ව්‍යායාම ඇත්තෝ ද, මිථ්‍යා සිහි ඇත්තෝ ද, මිථ්‍යා සමාධි ඇත්තෝ ද වෙත් නම්, මහරජ, එබඳු වූ යාගය මහත්ඵල දායක නො වේ, මහත් ආනිසංස දායක නො වේ, මහත් දීප්තිමත් නො වේ, මහත් විපුල බවක් ඇති නො වේ. මහරජ, යම් සේ ගොවියෙක් බීජ නගුල රැගෙන වනයට පිවිසෙයි ද, හේ එහි දුර්වල භූමියෙහි, නරක බිම්වල, ඉවත් නොකළ කටු සහිත බිම්වල හානියට පත් වූ, කුණුවූ, සුළඟින් අව්වෙන් තැළුණු, හරයක් නැති, සුවසේ වැඩීමට නුසුදුසු බීජ රෝපණය කරයි ද, දෙවියන් වහන්සේ ද කලට වේලාවට නිසි පරිදි වර්ෂාව නො වස්සවයි ද, ඒ බීජ වර්ධනයට, ප්‍රරෝහණයට, විපුලත්වයට පැමිණෙයි ද, ගොවියා මහත් ඵලයක් ලබයි දැ’’යි ඇසූ විට, ‘‘එසේ නො වේ, කාශ්‍යපයන් වහන්ස’’යි කීය. මහරජ, එපරිද්දෙන්ම යම් ආකාර යාගයක ගවයන් මරනු ලබත් ද, එළුවන් බැටළුවන් මරනු ලබත් ද, කුකුළන් ඌරන් මරනු ලබත් ද, නොයෙක් ආකාර සත්වයෝ විනාශයට පත් වෙත් ද, පිළිගන්නෝ ද මිථ්‍යා දෘෂ්ටිකයෝ ද, මිථ්‍යා සංකල්ප ඇත්තෝ ද, මිථ්‍යා වචන ඇත්තෝ ද, මිථ්‍යා කර්මාන්ත ඇත්තෝ ද, මිථ්‍යා ජීවිකා ඇත්තෝ ද, මිථ්‍යා ව්‍යායාම ඇත්තෝ ද, මිථ්‍යා සිහි ඇත්තෝ ද, මිථ්‍යා සමාධි ඇත්තෝ ද වෙත් නම්, මහරජ, එබඳු වූ යාගය මහත්ඵල දායක නො වේ, මහත් ආනිසංස දායක නො වේ, මහත් දීප්තිමත් නො වේ, මහත් විපුල බවක් ඇති නො වේ.\n\nමහරජ, යම් ආකාර වූ යාගයක ගවයන් නො මරනු ලබත් ද, එළුවන් බැටළුවන් නො මරනු ලබත් ද, කුකුළන් ඌරන් නො මරනු ලබත් ද, නොයෙක් ආකාර සත්වයෝ විනාශයට පත් නො වෙත් ද, පිළිගන්නෝ ද සම්මා දිට්ඨි ඇත්තෝ ද, සම්මා සංකල්ප ඇත්තෝ ද, සම්මා වචන ඇත්තෝ ද, සම්මා කර්මාන්ත ඇත්තෝ ද, සම්මා ජීවිකා ඇත්තෝ ද, සම්මා ව්‍යායාම ඇත්තෝ ද, සම්මා සිහි ඇත්තෝ ද, සම්මා සමාධි ඇත්තෝ ද වෙත් නම්, මහරජ, එබඳු වූ යාගය මහත්ඵල දායක වේ, මහත් ආනිසංස දායක වේ, මහත් දීප්තිමත් වේ, මහත් විපුල බවක් ඇති වේ. මහරජ, යම් සේ ගොවියෙක් බීජ නගුල රැගෙන වනයට පිවිසෙයි ද, හේ එහි හොඳ භූමියෙහි, යහපත් බිම්වල, මනාව ඉවත් කළ කටු සහිත බිම්වල හානියට පත් නො වූ, නො කුණුවූ, සුළඟින් අව්වෙන් නො තැළුණු, හරයක් ඇති, සුවසේ වැඩීමට සුදුසු බීජ රෝපණය කරයි ද, දෙවියන් වහන්සේ ද කලට වේලාවට නිසි පරිදි වර්ෂාව වස්සවයි ද, ඒ බීජ වර්ධනයට, ප්‍රරෝහණයට, විපුලත්වයට පැමිණෙයි ද, ගොවියා මහත් ඵලයක් ලබයි දැ’’යි ඇසූ විට, ‘‘එසේ ය, කාශ්‍යපයන් වහන්ස’’යි කීය. මහරජ, එපරිද්දෙන්ම යම් ආකාර යාගයක ගවයන් නො මරනු ලබත් ද, එළුවන් බැටළුවන් නො මරනු ලබත් ද, කුකුළන් ඌරන් නො මරනු ලබත් ද, නොයෙක් ආකාර සත්වයෝ විනාශයට පත් නො වෙත් ද, පිළිගන්නෝ ද සම්මා දිට්ඨි ඇත්තෝ ද, සම්මා සංකල්ප ඇත්තෝ ද, සම්මා වචන ඇත්තෝ ද, සම්මා කර්මාන්ත ඇත්තෝ ද, සම්මා ජීවිකා ඇත්තෝ ද, සම්මා ව්‍යායාම ඇත්තෝ ද, සම්මා සිහි ඇත්තෝ ද, සම්මා සමාධි ඇත්තෝ ද වෙත් නම්, මහරජ, එබඳු වූ යාගය මහත්ඵල දායක වේ, මහත් ආනිසංස දායක වේ, මහත් දීප්තිමත් වේ, මහත් විපුල බවක් ඇති වේ.",
      "paliTitle": "Yaññakathā",
      "englishTitle": "Discourse on Offerings",
      "sinhalaTitle": "යාඤ්ඤා කථා"
    },
    {
      "number": 439,
      "pali": "Atha kho pāyāsi rājañño dānaṃ paṭṭhapesi samaṇabrāhmaṇakapaṇaddhikavaṇibbakayācakānaṃ. Tasmiṃ kho pana dāne evarūpaṃ bhojanaṃ dīyati kaṇājakaṃ bilaṅgadutiyaṃ, dhorakāni [thorakāni (sī. pī.), corakāni (syā.)] ca vatthāni guḷavālakāni [guḷagāḷakāni (ka.)]. Tasmiṃ kho pana dāne uttaro nāma māṇavo vāvaṭo [byāvaṭo (sī. pī.)] ahosi. So dānaṃ datvā evaṃ anuddisati – ‘‘imināhaṃ dānena pāyāsiṃ rājaññameva imasmiṃ loke samāgacchiṃ, mā parasmi’’nti. Assosi kho pāyāsi rājañño – ‘‘uttaro kira māṇavo dānaṃ datvā evaṃ anuddisati – ‘imināhaṃ dānena pāyāsiṃ rājaññameva imasmiṃ loke samāgacchiṃ, mā parasmi’’’nti. Atha kho pāyāsi rājañño uttaraṃ māṇavaṃ āmantāpetvā etadavoca – ‘‘saccaṃ kira tvaṃ, tāta uttara, dānaṃ datvā evaṃ anuddisasi – ‘imināhaṃ dānena pāyāsiṃ rājaññameva imasmiṃ loke samāgacchiṃ, mā parasmi’’’nti? ‘‘Evaṃ, bho’’. ‘‘Kissa pana tvaṃ, tāta uttara, dānaṃ datvā evaṃ anuddisasi – ‘imināhaṃ dānena pāyāsiṃ rājaññameva imasmiṃ loke samāgacchiṃ, mā parasmi’nti? Nanu mayaṃ, tāta uttara, puññatthikā dānasseva phalaṃ pāṭikaṅkhino’’ti? ‘‘Bhoto kho dāne evarūpaṃ bhojanaṃ dīyati kaṇājakaṃ bilaṅgadutiyaṃ, yaṃ bhavaṃ pādāpi [pādāsi (ka.)] na iccheyya samphusituṃ [chupituṃ (pī. ka.)], kuto bhuñjituṃ, dhorakāni ca vatthāni guḷavālakāni, yāni bhavaṃ pādāpi [acittikataṃ (ka.)] na iccheyya samphusituṃ, kuto paridahituṃ. Bhavaṃ kho panamhākaṃ piyo manāpo, kathaṃ mayaṃ manāpaṃ amanāpena saṃyojemā’’ti? ‘‘Tena hi tvaṃ, tāta uttara, yādisāhaṃ bhojanaṃ bhuñjāmi, tādisaṃ bhojanaṃ paṭṭhapehi. Yādisāni cāhaṃ vatthāni paridahāmi, tādisāni ca vatthāni paṭṭhapehī’’ti. ‘‘Evaṃ, bho’’ti kho uttaro māṇavo pāyāsissa rājaññassa paṭissutvā yādisaṃ bhojanaṃ pāyāsi rājañño bhuñjati, tādisaṃ bhojanaṃ paṭṭhapesi. Yādisāni ca vatthāni pāyāsi rājañño paridahati, tādisāni ca vatthāni paṭṭhapesi.",
      "english": "Then King Pāyāsi established a donation for ascetics, brahmins, the poor, travelers, beggars, and petitioners. In that donation, food of such a kind was given: broken rice with split beans as a second dish, and ragged cloths of coarse woolen material. And in that donation, a young man named Uttara was in charge. Having given the donation, he made this dedication: \"By this donation, may I meet King Pāyāsi in this world, and not in the next.\" King Pāyāsi heard, \"It seems that the young man Uttara, having given a donation, makes this dedication: 'By this donation, may I meet King Pāyāsi in this world, and not in the next.'\" Then King Pāyāsi had Uttara summoned and said to him, \"Is it true, young Uttara, that having given a donation, you make this dedication: 'By this donation, may I meet King Pāyāsi in this world, and not in the next'?\" \"Yes, sir.\" \"But why, young Uttara, having given a donation, do you make this dedication: 'By this donation, may I meet King Pāyāsi in this world, and not in the next'? Surely, young Uttara, we are those who desire merit, who anticipate the fruit of generosity.\" \"Sir, in your donation food of such a kind is given: broken rice with split beans as a second dish, which you would not wish even to touch with your foot, let alone eat; and ragged cloths of coarse woolen material, which you would not wish even to touch with your foot, let alone wear. You, sir, are dear and beloved to us; how could we connect someone beloved with something unlikable?\" \"Then, young Uttara, establish food of the kind that I eat. And establish cloths of the kind that I wear.\" \"Yes, sir,\" the young man Uttara replied to King Pāyāsi, and he established food of the kind that King Pāyāsi ate. And he established cloths of the kind that King Pāyāsi wore.",
      "sinhala": "ඉක්බිතිව පයාසි රජු ශ්‍රමණ බ්‍රාහ්මණයන්ට, දුගීන්ට, මගීන්ට, වෙළෙන්දන්ට, යාචකයන්ට දන් දීමක් ආරම්භ කළේය. එහෙත් එම දානයේ දී දෙනු ලබන්නේ දහයියා මිශ්‍ර රළු සහල් බත් ද, රළු වූ ද ගුලි ගැසුණු නූල් ඇති ද වස්ත්‍ර ද වේ. එහිදී උත්තර නම් වූ තරුණයා මෙහෙකරුවෙකු ලෙස කටයුතු කළේය. ඔහු දන් දී මෙසේ ප්‍රාර්ථනා කළේය: “මේ දානයෙන් මම පයාසි රජු මෙන් මේ ලෝකයේම උපදින්නෙමි, පරලොව නොවෙමි” කියායි. පයාසි රජුට ආරංචි විය: “උත්තර නම් තරුණයා දන් දී ‘මේ දානයෙන් මම පයාසි රජු මෙන් මේ ලෝකයේම උපදින්නෙමි, පරලොව නොවෙමි’ කියා ප්‍රාර්ථනා කරනවාලු” කියායි. ඉක්බිතිව පයාසි රජු උත්තර තරුණයා ගෙන්වා මෙසේ ඇසීය: “ඇත්තද, පුතා උත්තර, ඔබ දන් දී ‘මේ දානයෙන් මම පයාසි රජු මෙන් මේ ලෝකයේම උපදින්නෙමි, පරලොව නොවෙමි’ කියා ප්‍රාර්ථනා කරනවාද?” “එසේය, ස්වාමීනි”. “එසේනම්, පුතා උත්තර, ඔබ දන් දී ‘මේ දානයෙන් මම පයාසි රජු මෙන් මේ ලෝකයේම උපදින්නෙමි, පරලොව නොවෙමි’ කියා ප්‍රාර්ථනා කරන්නේ කුමක් නිසාද? අපි පින් කැමැත්තෝ නොවෙමුද? දානයේ ඵලය අපේක්ෂා කරන්නෝ නොවෙමුද?” “ස්වාමීනි, ඔබගේ දානයේ දී දෙනු ලබන්නේ දහයියා මිශ්‍ර රළු සහල් බත් වැනි ආහාරයකි. ඔබ පාදයෙන්වත් ස්පර්ශ කිරීමට අකමැති ආහාරයක් කෙසේ නම් භුක්ති විඳින්නද? රළු වූ ගුලි ගැසුණු නූල් ඇති වස්ත්‍ර ඔබ පාදයෙන්වත් ස්පර්ශ කිරීමට අකමැති නම් කෙසේ නම් අඳින්නද? ඔබ අපට ප්‍රියමනාපය, අපි ප්‍රියමනාපය අප්‍රියමනාපයකට සම්බන්ධ කරන්නේ කෙසේද?” “එසේනම්, පුතා උත්තර, මම යම් ආකාරයක ආහාරයක් භුක්ති විඳින්නෙම්ද, ඒ ආකාරයේ ආහාර පිළියෙල කරන්න. මම යම් ආකාරයක වස්ත්‍ර අඳින්නෙම්ද, ඒ ආකාරයේ වස්ත්‍ර පිළියෙල කරන්න”. “එසේය, ස්වාමීනි” කියා උත්තර තරුණයා පයාසි රජුට පිළිතුරු දී පයාසි රජු යම් ආකාරයක ආහාරයක් භුක්ති විඳින්නේද, ඒ ආකාරයේ ආහාර පිළියෙල කළේය. පයාසි රජු යම් ආකාරයක වස්ත්‍ර අඳින්නේද, ඒ ආකාරයේ වස්ත්‍ර පිළියෙල කළේය.",
      "paliTitle": "Uttaramāṇavavatthu",
      "englishTitle": "Uttara the Student's Story",
      "sinhalaTitle": "උත්තර මානවක වත්ථුව"
    },
    {
      "number": 440,
      "pali": "Atha kho pāyāsi rājañño asakkaccaṃ dānaṃ datvā asahatthā dānaṃ datvā acittīkataṃ dānaṃ datvā apaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajji suññaṃ serīsakaṃ vimānaṃ. Yo pana tassa dāne vāvaṭo ahosi uttaro nāma māṇavo. So sakkaccaṃ dānaṃ datvā sahatthā dānaṃ datvā cittīkataṃ dānaṃ datvā anapaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajji devānaṃ tāvatiṃsānaṃ sahabyataṃ. ",
      "english": "Then, King Pāyāsi, having given alms carelessly, having given alms without his own hand, having given alms thoughtlessly, having given alms of what was discarded, upon the breakup of the body, after death, was reborn into the company of the Four Great Kings, in an empty and desolate Serīsaka mansion. But the young Brahmin named Uttara, who was engaged in that giving of alms, having given alms carefully, having given alms with his own hand, having given alms thoughtfully, having given alms of what was not discarded, upon the breakup of the body, after death, was reborn into a good destination, a heavenly world, into the company of the Tāvatiṃsa gods.",
      "sinhala": "ඉක්බිති පයාසි රජ තෙමේ නොසැලකිල්ලෙන් යුතුව දන් දී, අතින් තොරව දන් දී, සිත පහදවා නොගෙන දන් දී, පහත් කොට දන් දී, කය බිඳී මරණින් මතු චාතුම්මහාරාජික දෙවියන්ගේ සහභාගීත්වයට පැමිණියේ හිස් වූ සේරිස්සක නම් විමානයකය. යමෙක් ඒ දානයෙහි නියැළුණේ ද, උත්තර නම් වූ මානවකයෙක් විය. ඔහු සැලකිල්ලෙන් යුතුව දන් දී, අතින් ම දන් දී, සිත පහදවා ගෙන දන් දී, පහත් නොකොට දන් දී, කය බිඳී මරණින් මතු සුගතියකට, ස්වර්ග ලෝකයකට පැමිණියේ තාවතිංස දෙවියන්ගේ සහභාගීත්වයෙනි.",
      "paliTitle": ""
    },
    {
      "number": 441,
      "pali": "Tena kho pana samayena āyasmā gavampati abhikkhaṇaṃ suññaṃ serīsakaṃ vimānaṃ divāvihāraṃ gacchati. Atha kho pāyāsi devaputto yenāyasmā gavampati tenupasaṅkami; upasaṅkamitvā āyasmantaṃ gavampatiṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho pāyāsiṃ devaputtaṃ āyasmā gavampati etadavoca – ‘‘kosi tvaṃ, āvuso’’ti? ‘‘Ahaṃ, bhante, pāyāsi rājañño’’ti. ‘‘Nanu tvaṃ, āvuso, evaṃdiṭṭhiko ahosi – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’’’ti? ‘‘Saccāhaṃ, bhante, evaṃdiṭṭhiko ahosiṃ – ‘itipi natthi paro loko, natthi sattā opapātikā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko’ti. Api cāhaṃ ayyena kumārakassapena etasmā pāpakā diṭṭhigatā vivecito’’ti. ‘‘Yo pana te, āvuso, dāne vāvaṭo ahosi uttaro nāma māṇavo, so kuhiṃ upapanno’’ti? ‘‘Yo me, bhante, dāne vāvaṭo ahosi uttaro nāma māṇavo, so sakkaccaṃ dānaṃ datvā sahatthā dānaṃ datvā cittīkataṃ dānaṃ datvā anapaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapanno devānaṃ tāvatiṃsānaṃ sahabyataṃ. Ahaṃ pana, bhante, asakkaccaṃ dānaṃ datvā asahatthā dānaṃ datvā acittīkataṃ dānaṃ datvā apaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapanno suññaṃ serīsakaṃ vimānaṃ. Tena hi, bhante gavampati, manussalokaṃ gantvā evamārocehi – ‘sakkaccaṃ dānaṃ detha, sahatthā dānaṃ detha, cittīkataṃ dānaṃ detha, anapaviddhaṃ dānaṃ detha. Pāyāsi rājañño asakkaccaṃ dānaṃ datvā asahatthā dānaṃ datvā acittīkataṃ dānaṃ datvā apaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapanno suññaṃ serīsakaṃ vimānaṃ. Yo pana tassa dāne vāvaṭo ahosi uttaro nāma māṇavo, so sakkaccaṃ dānaṃ datvā sahatthā dānaṃ datvā cittīkataṃ dānaṃ datvā anapaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapanno devānaṃ tāvatiṃsānaṃ sahabyata’’’nti. Atha kho āyasmā gavampati manussalokaṃ āgantvā evamārocesi – ‘‘sakkaccaṃ dānaṃ detha, sahatthā dānaṃ detha, cittīkataṃ dānaṃ detha, anapaviddhaṃ dānaṃ detha. Pāyāsi rājañño asakkaccaṃ dānaṃ datvā asahatthā dānaṃ datvā acittīkataṃ dānaṃ datvā apaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapanno suññaṃ serīsakaṃ vimānaṃ. Yo pana tassa dāne vāvaṭo ahosi uttaro nāma māṇavo, so sakkaccaṃ dānaṃ datvā sahatthā dānaṃ datvā cittīkataṃ dānaṃ datvā anapaviddhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapanno devānaṃ tāvatiṃsānaṃ sahabyata’’nti. ",
      "english": "Now at that time, the venerable Gavampati frequently went to the empty Serīsaka mansion for the day's abiding. Then Payāsi, a young deva, approached the venerable Gavampati; having approached, he bowed down to the venerable Gavampati and stood to one side. As he stood to one side, the venerable Gavampati said this to Payāsi, the young deva: \"Who are you, friend?\" \"Venerable sir, I am Payāsi the ruler.\" \"But, friend, were you not of such a view as this: 'There is no other world, there are no beings who are reborn spontaneously, there is no fruit or result of good and bad deeds'?\" \"It is true, venerable sir, I was of such a view as this: 'There is no other world, there are no beings who are reborn spontaneously, there is no fruit or result of good and bad deeds.' However, I was freed from that evil thicket of views by the venerable Kumārakassapa.\" \"But where has that young man named Uttara, who was engaged in your giving, been reborn?\" \"Venerable sir, that young man named Uttara, who was engaged in my giving, having given a gift respectfully, having given a gift with his own hand, having given a considered gift, having given an unrejected gift, upon the breakup of his body, after death, has been reborn in a good destination, in a heavenly world, into companionship with the Tāvatiṃsa devas. But I, venerable sir, having given a gift disrespectfully, having given a gift not with my own hand, having given an unconsidered gift, having given a rejected gift, upon the breakup of my body, after death, have been reborn into companionship with the devas of the Four Great Kings in the empty Serīsaka mansion. Therefore, venerable Gavampati, go to the human world and announce this: 'Give a gift respectfully, give a gift with your own hand, give a considered gift, give an unrejected gift. Payāsi the ruler, having given a gift disrespectfully, having given a gift not with his own hand, having given an unconsidered gift, having given a rejected gift, upon the breakup of his body, after death, has been reborn into companionship with the devas of the Four Great Kings in the empty Serīsaka mansion. But that young man named Uttara, who was engaged in his giving, having given a gift respectfully, having given a gift with his own hand, having given a considered gift, having given an unrejected gift, upon the breakup of his body, after death, has been reborn in a good destination, in a heavenly world, into companionship with the Tāvatiṃsa devas.'\" Then the venerable Gavampati, having come to the human world, announced this: \"Give a gift respectfully, give a gift with your own hand, give a considered gift, give an unrejected gift. Payāsi the ruler, having given a gift disrespectfully, having given a gift not with his own hand, having given an unconsidered gift, having given a rejected gift, upon the breakup of his body, after death, has been reborn into companionship with the devas of the Four Great Kings in the empty Serīsaka mansion. But that young man named Uttara, who was engaged in his giving, having given a gift respectfully, having given a gift with his own hand, having given a considered gift, having given an unrejected gift, upon the breakup of his body, after death, has been reborn in a good destination, in a heavenly world, into companionship with the Tāvatiṃsa devas.\"",
      "sinhala": "එසමයෙහි ආයුෂ්මත් ගවම්පති තෙරණුවෝ නිතරම පාළු සේරිසක විමානයට දිවා විහාරයට වැඩම කරති. ඉක්බිති පයාසි දෙව්පුත්‍රයා යම් තැනක ආයුෂ්මත් ගවම්පති තෙරණුවෝ වැඩ සිටිත් ද එතැනට පැමිණියේ ය. පැමිණ ආයුෂ්මත් ගවම්පති තෙරණුවන්ට වැඳ එකත්පසෙක සිටියේ ය. එකත්පසෙක සිටි පයාසි දෙව්පුත්‍රයාට ආයුෂ්මත් ගවම්පති තෙරණුවෝ මෙය වදාළහ: “ඇවැත්, ඔබ කවරෙක් දැ”යි ඇසූහ. “ස්වාමීන් වහන්ස, මම පයාසි රජ්ජුරුවෝ වෙමි”යි කී ය. “ඇවැත්, ඔබ මෙබඳු මත ඇත්තෙක් නොවූහු ද: ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මයන්ගේ විපාක නැතැ’යි කියා”යි ඇසූහ. “ස්වාමීන් වහන්ස, මම සැබවින්ම මෙබඳු මත ඇත්තෙක් වීමි: ‘පරලොවක් නැත, ඕපපාතික සත්වයෝ නැත, යහපත් හෝ අයහපත් කර්මයන්ගේ විපාක නැතැ’යි කියා ය. එහෙත් මම ආර්ය කුමාරකාශ්‍යපයන් වහන්සේ විසින් මේ පාපී මිථ්‍යා දෘෂ්ටියෙන් මුදවන ලදිමි”යි කී ය. “ඇවැත්, ඔබගේ දානයෙහි නියුක්ත වූ උත්තර නම් වූ මානවකයා කොහි උපන්නේ දැ”යි ඇසූහ. “ස්වාමීන් වහන්ස, යම් මගේ දානයෙහි නියුක්ත වූ උත්තර නම් වූ මානවකයෙක් වී ද, ඔහු සැලකිල්ලෙන් දන් දී, තමන් අතින් ම දන් දී, සිත පහන් කර දන් දී, ඉවත නොදමන ලද දන් දී කය බිඳීමෙන් මරණින් මතු සුගතියෙහි ස්වර්ග ලෝකයෙහි තාවතිංස දෙවියන්ගේ සහභාගීත්වයට පැමිණියේ ය. ස්වාමීන් වහන්ස, මම නොසැලකිල්ලෙන් දන් දී, තමන් අතින් නො දී, සිත පහන් නොකර දන් දී, ඉවත දමන ලද දන් දී කය බිඳීමෙන් මරණින් මතු චාතුම්මහාරාජික දෙවියන්ගේ සහභාගීත්වයට පැමිණ පාළු සේරිසක විමානයෙහි උපන්නෙමි. එහෙයින් ගවම්පති ස්වාමීන් වහන්ස, මනුෂ්‍ය ලෝකයට ගොස් මෙසේ ප්‍රකාශ කරන්න: ‘සැලකිල්ලෙන් දන් දෙන්න, තමන් අතින් ම දන් දෙන්න, සිත පහන් කර දන් දෙන්න, ඉවත නොදමන ලද දන් දෙන්න. පයාසි රජ්ජුරුවෝ නොසැලකිල්ලෙන් දන් දී, තමන් අතින් නො දී, සිත පහන් නොකර දන් දී, ඉවත දමන ලද දන් දී කය බිඳීමෙන් මරණින් මතු චාතුම්මහාරාජික දෙවියන්ගේ සහභාගීත්වයට පැමිණ පාළු සේරිසක විමානයෙහි උපන්නේ ය. යම් ඔහුගේ දානයෙහි නියුක්ත වූ උත්තර නම් වූ මානවකයෙක් වී ද, ඔහු සැලකිල්ලෙන් දන් දී, තමන් අතින් ම දන් දී, සිත පහන් කර දන් දී, ඉවත නොදමන ලද දන් දී කය බිඳීමෙන් මරණින් මතු සුගතියෙහි ස්වර්ග ලෝකයෙහි තාවතිංස දෙවියන්ගේ සහභාගීත්වයට පැමිණියේ’ යයි කීහ.” ඉක්බිති ආයුෂ්මත් ගවම්පති තෙරණුවෝ මනුෂ්‍ය ලෝකයට පැමිණ මෙසේ ප්‍රකාශ කළහ: “සැලකිල්ලෙන් දන් දෙන්න, තමන් අතින් ම දන් දෙන්න, සිත පහන් කර දන් දෙන්න, ඉවත නොදමන ලද දන් දෙන්න. පයාසි රජ්ජුරුවෝ නොසැලකිල්ලෙන් දන් දී, තමන් අතින් නො දී, සිත පහන් නොකර දන් දී, ඉවත දමන ලද දන් දී කය බිඳීමෙන් මරණින් මතු චාතුම්මහාරාජික දෙවියන්ගේ සහභාගීත්වයට පැමිණ පාළු සේරිසක විමානයෙහි උපන්නේ ය. යම් ඔහුගේ දානයෙහි නියුක්ත වූ උත්තර නම් වූ මානවකයෙක් වී ද, ඔහු සැලකිල්ලෙන් දන් දී, තමන් අතින් ම දන් දී, සිත පහන් කර දන් දී, ඉවත නොදමන ලද දන් දී කය බිඳීමෙන් මරණින් මතු සුගතියෙහි ස්වර්ග ලෝකයෙහි තාවතිංස දෙවියන්ගේ සහභාගීත්වයට පැමිණියේ” යයි වදාළහ.",
      "paliTitle": "Pāyāsidevaputto",
      "englishTitle": "Pāyāsi the God-Son",
      "sinhalaTitle": "පායාසිදේවපුත්තො"
    }
  ],
  "footer": {
    "pali": "Pāyāsisuttaṃ niṭṭhitaṃ dasamaṃ. ",
    "english": "The Pāyāsi Discourse: Tenth and Concluded.",
    "sinhala": "පායාසි සූත්‍රය නිමි. දසවෙනි."
  }
}