{
  "id": "an11.1",
  "title": {
    "pali": "Nissayavaggo",
    "english": "The Chapter on Supports",
    "sinhala": "ආශ්‍රය වග්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "[a. ni. 10.1] Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘kimatthiyāni, bhante, kusalāni sīlāni kimānisaṃsānī’’ti? ‘‘Avippaṭisāratthāni kho, ānanda, kusalāni sīlāni avippaṭisārānisaṃsānī’’ti. ‘‘Avippaṭisāro pana, bhante, kimatthiyo kimānisaṃso’’? ‘‘Avippaṭisāro kho, ānanda, pāmojjattho pāmojjānisaṃso’’. ‘‘Pāmojjaṃ pana, bhante, kimatthiyaṃ kimānisaṃsaṃ’’? ‘‘Pāmojjaṃ kho, ānanda, pītatthaṃ pītānisaṃsaṃ’’. ‘‘Pīti pana, bhante, kimatthiyā kimānisaṃsā’’? ‘‘Pīti kho, ānanda, passaddhatthā passaddhānisaṃsā’’. ‘‘Passaddhi pana, bhante, kimatthiyā kimānisaṃsā’’? ‘‘Passaddhi kho, ānanda, sukhatthā sukhānisaṃsā’’. ‘‘Sukhaṃ pana, bhante, kimatthiyaṃ kimānisaṃsaṃ’’? ‘‘Sukhaṃ kho, ānanda, samādhatthaṃ samādhānisaṃsaṃ’’. ‘‘Samādhi pana, bhante, kimatthiyo kimānisaṃso’’? ‘‘Samādhi kho, ānanda, yathābhūtañāṇadassanattho yathābhūtañāṇadassanānisaṃso’’. ‘‘Yathābhūtañāṇadassanaṃ pana, bhante, kimatthiyaṃ kimānisaṃsaṃ’’? ‘‘Yathābhūtañāṇadassanaṃ kho, ānanda, nibbidatthaṃ nibbidānisaṃsaṃ’’. ‘‘Nibbidā, pana, bhante, kimatthiyā kimānisaṃsā’’? ‘‘Nibbidā kho, ānanda, virāgatthā virāgānisaṃsā ’’. ‘‘Virāgo pana, bhante, kimatthiyo kimānisaṃso’’? ‘‘Virāgo kho, ānanda, vimuttiñāṇadassanattho vimuttiñāṇadassanānisaṃso. ‘‘Iti kho, ānanda, kusalāni sīlāni avippaṭisāratthāni avippaṭisārānisaṃsāni, avippaṭisāro pāmojjattho pāmojjānisaṃso, pāmojjaṃ pītatthaṃ pītānisaṃsaṃ, pīti passaddhatthā passaddhānisaṃsā, passaddhi sukhatthā sukhānisaṃsā, sukhaṃ samādhatthaṃ samādhānisaṃsaṃ, samādhi yathābhūtañāṇadassanattho yathābhūtañāṇadassanānisaṃso, yathābhūtañāṇadassanaṃ nibbidatthaṃ nibbidānisaṃsaṃ, nibbidā virāgatthā virāgānisaṃsā, virāgo vimuttiñāṇadassanattho vimuttiñāṇadassanānisaṃso. Iti kho, ānanda, kusalāni sīlāni anupubbena aggāya parentī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Sāvatthī, at Jetavana, in Anāthapiṇḍika's Park. Then the Venerable Ānanda approached the Blessed One, paid homage to him, and sat down to one side. As he sat to one side, the Venerable Ānanda said to the Blessed One: \"For what purpose, Venerable Sir, is skillful virtuous conduct? What is its benefit?\" \"Skillful virtuous conduct, Ānanda, has freedom from regret as its purpose; freedom from regret is its benefit.\" \"But, Venerable Sir, for what purpose is freedom from regret? What is its benefit?\" \"Freedom from regret, Ānanda, has delight as its purpose; delight is its benefit.\" \"But, Venerable Sir, for what purpose is delight? What is its benefit?\" \"Delight, Ānanda, has rapture as its purpose; rapture is its benefit.\" \"But, Venerable Sir, for what purpose is rapture? What is its benefit?\" \"Rapture, Ānanda, has tranquility as its purpose; tranquility is its benefit.\" \"But, Venerable Sir, for what purpose is tranquility? What is its benefit?\" \"Tranquility, Ānanda, has happiness as its purpose; happiness is its benefit.\" \"But, Venerable Sir, for what purpose is happiness? What is its benefit?\" \"Happiness, Ānanda, has concentration as its purpose; concentration is its benefit.\" \"But, Venerable Sir, for what purpose is concentration? What is its benefit?\" \"Concentration, Ānanda, has knowledge and vision of things as they truly are as its purpose; knowledge and vision of things as they truly are is its benefit.\" \"But, Venerable Sir, for what purpose is knowledge and vision of things as they truly are? What is its benefit?\" \"Knowledge and vision of things as they truly are, Ānanda, has disenchantment as its purpose; disenchantment is its benefit.\" \"But, Venerable Sir, for what purpose is disenchantment? What is its benefit?\" \"Disenchantment, Ānanda, has dispassion as its purpose; dispassion is its benefit.\" \"But, Venerable Sir, for what purpose is dispassion? What is its benefit?\" \"Dispassion, Ānanda, has knowledge and vision of liberation as its purpose; knowledge and vision of liberation is its benefit. Thus, Ānanda, skillful virtuous conduct has freedom from regret as its purpose and freedom from regret as its benefit; freedom from regret has delight as its purpose and delight as its benefit; delight has rapture as its purpose and rapture as its benefit; rapture has tranquility as its purpose and tranquility as its benefit; tranquility has happiness as its purpose and happiness as its benefit; happiness has concentration as its purpose and concentration as its benefit; concentration has knowledge and vision of things as they truly are as its purpose and knowledge and vision of things as they truly are as its benefit; knowledge and vision of things as they truly are has disenchantment as its purpose and disenchantment as its benefit; disenchantment has dispassion as its purpose and dispassion as its benefit; dispassion has knowledge and vision of liberation as its purpose and knowledge and vision of liberation as its benefit. In this way, Ānanda, skillful virtuous conduct gradually leads to the highest goal.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍ය​වතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේ වැඩසිටින තැනට එළඹුණේය; එළඹ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේට මෙය පැවසීය: ‘‘වහන්ස, කුසල සීලයෝ කුමක් පිණිස පවතීද? කුමක් විපාක කොට ඇත්තාහුද?’’ ‘‘ආනන්දය, කුසල සීලයෝ නොපසුතැවීම පිණිස පවතී, නොපසුතැවීම විපාක කොට ඇත්තාහුය.’’ ‘‘නොපසුතැවීම නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, නොපසුතැවීම ප්‍රීති ප්‍රමෝදය පිණිස පවතී, ප්‍රීති ප්‍රමෝදය විපාක කොට ඇත්තේය.’’ ‘‘ප්‍රීති ප්‍රමෝදය නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, ප්‍රීති ප්‍රමෝදය පීතිය පිණිස පවතී, පීතිය විපාක කොට ඇත්තේය.’’ ‘‘පීතිය නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, පීතිය ප්‍රශාන්තිය පිණිස පවතී, ප්‍රශාන්තිය විපාක කොට ඇත්තේය.’’ ‘‘ප්‍රශාන්තිය නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, ප්‍රශාන්තිය සැපය පිණිස පවතී, සැපය විපාක කොට ඇත්තේය.’’ ‘‘සැපය නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, සැපය සමාධිය පිණිස පවතී, සමාධිය විපාක කොට ඇත්තේය.’’ ‘‘සමාධිය නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, සමාධිය යථාභූත ඥාන දර්ශනය පිණිස පවතී, යථාභූත ඥාන දර්ශනය විපාක කොට ඇත්තේය.’’ ‘‘යථාභූත ඥාන දර්ශනය නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, යථාභූත ඥාන දර්ශනය කලකිරීම පිණිස පවතී, කලකිරීම විපාක කොට ඇත්තේය.’’ ‘‘කලකිරීම නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, කලකිරීම නොඇලීම පිණිස පවතී, නොඇලීම විපාක කොට ඇත්තේය.’’ ‘‘නොඇලීම නම්, වහන්ස, කුමක් පිණිසද? කුමක් විපාක කොට ඇත්තේද?’’ ‘‘ආනන්දය, නොඇලීම විමුක්ති ඥාන දර්ශනය පිණිස පවතී, විමුක්ති ඥාන දර්ශනය විපාක කොට ඇත්තේය.’’ ‘‘ආනන්දය, මෙසේ කුසල සීලයෝ නොපසුතැවීම පිණිස පවතී, නොපසුතැවීම විපාක කොට ඇත්තාහුය. නොපසුතැවීම ප්‍රීති ප්‍රමෝදය පිණිස පවතී, ප්‍රීති ප්‍රමෝදය විපාක කොට ඇත්තේය. ප්‍රීති ප්‍රමෝදය පීතිය පිණිස පවතී, පීතිය විපාක කොට ඇත්තේය. පීතිය ප්‍රශාන්තිය පිණිස පවතී, ප්‍රශාන්තිය විපාක කොට ඇත්තේය. ප්‍රශාන්තිය සැපය පිණිස පවතී, සැපය විපාක කොට ඇත්තේය. සැපය සමාධිය පිණිස පවතී, සමාධිය විපාක කොට ඇත්තේය. සමාධිය යථාභූත ඥාන දර්ශනය පිණිස පවතී, යථාභූත ඥාන දර්ශනය විපාක කොට ඇත්තේය. යථාභූත ඥාන දර්ශනය කලකිරීම පිණිස පවතී, කලකිරීම විපාක කොට ඇත්තේය. කලකිරීම නොඇලීම පිණිස පවතී, නොඇලීම විපාක කොට ඇත්තේය. නොඇලීම විමුක්ති ඥාන දර්ශනය පිණිස පවතී, විමුක්ති ඥාන දර්ශනය විපාක කොට ඇත්තේය. ආනන්දය, මෙසේ කුසල සීලයෝ අනුක්‍රමයෙන් උසස්ම ඵලය කරා ගෙන යයි.’’",
      "paliTitle": "Kimatthiyasuttaṃ",
      "englishTitle": "Discourse on What Purpose",
      "sinhalaTitle": "කිමත්‍ථිය සූත්‍රය"
    },
    {
      "number": 2,
      "pali": "[a. ni. 10.2] ‘‘Sīlavato, bhikkhave, sīlasampannassa na cetanāya karaṇīyaṃ – ‘avippaṭisāro me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṃ sīlavato sīlasampannassa avippaṭisāro uppajjati. ‘‘Avippaṭisārissa, bhikkhave, na cetanāya karaṇīyaṃ – ‘pāmojjaṃ me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṃ avippaṭisārissa pāmojjaṃ uppajjati. ‘‘Pamuditassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘pīti me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṃ pamuditassa pīti uppajjati. ‘‘Pītimanassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘kāyo me passambhatū’ti. Dhammatā esā, bhikkhave, yaṃ pītimanassa kāyo passambhati. ‘‘Passaddhakāyassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘sukhaṃ vediyāmī’ti. Dhammatā esā, bhikkhave, yaṃ passaddhakāyo sukhaṃ vediyati. ‘‘Sukhino, bhikkhave, na cetanāya karaṇīyaṃ – ‘cittaṃ me samādhiyatū’ti. Dhammatā esā, bhikkhave, yaṃ sukhino cittaṃ samādhiyati. ‘‘Samāhitassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘yathābhūtaṃ jānāmi passāmī’ti. Dhammatā esā, bhikkhave, yaṃ samāhito yathābhūtaṃ jānāti passati. ‘‘Yathābhūtaṃ, bhikkhave, jānato passato na cetanāya karaṇīyaṃ – ‘nibbindāmī’ti. Dhammatā esā, bhikkhave, yaṃ yathābhūtaṃ jānaṃ passaṃ nibbindati. ‘‘Nibbinnassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘virajjāmī’ti. Dhammatā esā, bhikkhave, yaṃ nibbinno virajjati. ‘‘Virattassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘vimuttiñāṇadassanaṃ sacchikaromī’ti. Dhammatā esā, bhikkhave, yaṃ viratto vimuttiñāṇadassanaṃ sacchikaroti. ‘‘Iti kho, bhikkhave, virāgo vimuttiñāṇadassanattho vimuttiñāṇadassanānisaṃso, nibbidā virāgatthā virāgānisaṃsā, yathābhūtañāṇadassanaṃ nibbidatthaṃ nibbidānisaṃsaṃ, samādhi yathābhūtañāṇadassanattho yathābhūtañāṇadassanānisaṃso, sukhaṃ samādhatthaṃ samādhānisaṃsaṃ, passaddhi sukhatthā sukhānisaṃsā, pīti passaddhatthā passaddhānisaṃsā, pāmojjaṃ pītatthaṃ pītānisaṃsaṃ, avippaṭisāro pāmojjattho pāmojjānisaṃso, kusalāni sīlāni avippaṭisāratthāni avippaṭisārānisaṃsāni. Iti kho, bhikkhave, dhammā dhamme abhisandenti, dhammā dhamme paripūrenti apārā pāraṃ gamanāyā’’ti. Dutiyaṃ.",
      "english": "Monks, for one who is virtuous, accomplished in virtue, there is no need to intend, 'May freedom from remorse arise in me.' It is the natural consequence, Monks, that freedom from remorse arises for one who is virtuous, accomplished in virtue. Monks, for one free from remorse, there is no need to intend, 'May joy arise in me.' It is the natural consequence, Monks, that joy arises for one free from remorse. Monks, for one who is joyful, there is no need to intend, 'May rapture arise in me.' It is the natural consequence, Monks, that rapture arises for one who is joyful. Monks, for one whose mind is filled with rapture, there is no need to intend, 'May my body be tranquil.' It is the natural consequence, Monks, that the body of one filled with rapture becomes tranquil. Monks, for one whose body is tranquil, there is no need to intend, 'May I experience happiness.' It is the natural consequence, Monks, that one whose body is tranquil experiences happiness. Monks, for one who is happy, there is no need to intend, 'May my mind be concentrated.' It is the natural consequence, Monks, that the mind of one who is happy becomes concentrated. Monks, for one whose mind is concentrated, there is no need to intend, 'May I know and see things as they really are.' It is the natural consequence, Monks, that one whose mind is concentrated knows and sees things as they really are. Monks, for one who knows and sees things as they really are, there is no need to intend, 'May I become disenchanted.' It is the natural consequence, Monks, that one who knows and sees things as they really are becomes disenchanted. Monks, for one who is disenchanted, there is no need to intend, 'May I become dispassionate.' It is the natural consequence, Monks, that one who is disenchanted becomes dispassionate. Monks, for one who is dispassionate, there is no need to intend, 'May I realize the knowledge and vision of liberation.' It is the natural consequence, Monks, that one who is dispassionate realizes the knowledge and vision of liberation. Thus, Monks, dispassion is for the purpose of the knowledge and vision of liberation, and its benefit is the knowledge and vision of liberation. Disenchantment is for the purpose of dispassion, and its benefit is dispassion. The knowledge and vision of things as they really are is for the purpose of disenchantment, and its benefit is disenchantment. Concentration is for the purpose of the knowledge and vision of things as they really are, and its benefit is the knowledge and vision of things as they really are. Happiness is for the purpose of concentration, and its benefit is concentration. Tranquility is for the purpose of happiness, and its benefit is happiness. Rapture is for the purpose of tranquility, and its benefit is tranquility. Joy is for the purpose of rapture, and its benefit is rapture. Freedom from remorse is for the purpose of joy, and its benefit is joy. Wholesome virtue is for the purpose of freedom from remorse, and its benefit is freedom from remorse. Thus, Monks, these states flow into one another, these states fulfill one another, for the purpose of reaching the far shore from this near shore.",
      "sinhala": "භික්‍ෂූණි, සිල්වත් වූ, සිල් සම්පූර්ණ කළ කෙනෙකුට ‘මට අවිප්පටිසාරය පහළ වේවා’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සිල්වත් වූ, සිල් සම්පූර්ණ කළ කෙනෙකුට අවිප්පටිසාරය පහළ වීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, අවිප්පටිසාරය ඇති කෙනෙකුට ‘මට ප්‍රමෝදය පහළ වේවා’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, අවිප්පටිසාරය ඇති කෙනෙකුට ප්‍රමෝදය පහළ වීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, ප්‍රමුදිත වූ කෙනෙකුට ‘මට ප්‍රීතිය පහළ වේවා’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, ප්‍රමුදිත වූ කෙනෙකුට ප්‍රීතිය පහළ වීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, ප්‍රීතිමත් වූ කෙනෙකුට ‘මගේ කය සංසිඳේවා’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, ප්‍රීතිමත් වූ කෙනෙකුට කය සංසිඳීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, සංසිඳුණු කයක් ඇති කෙනෙකුට ‘මම සැප විඳිමි’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සංසිඳුණු කයක් ඇති කෙනෙකු සැප විඳීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, සුවයෙන් සිටින කෙනෙකුට ‘මගේ සිත සමාධිමත් වේවා’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සුවයෙන් සිටින කෙනෙකුගේ සිත සමාධිමත් වීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, සමාධිමත් වූ කෙනෙකුට ‘මම යථාභූත ඥානයෙන් දනිමි, දකිමි’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සමාධිමත් වූ කෙනෙකු යථාභූත ඥානයෙන් දැනීම, දැකීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, යථාභූත ඥානයෙන් දන්නා, දකින කෙනෙකුට ‘මම කලකිරෙමි’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, යථාභූත ඥානයෙන් දන්නා, දකින කෙනෙකු කලකිරීමට පත්වීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, කලකිරුණු කෙනෙකුට ‘මම නොඇලෙමි’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, කලකිරුණු කෙනෙකු නොඇලීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, නොඇලුණු කෙනෙකුට ‘මම විමුක්ති ඥානදර්ශනය ප්‍රත්‍යක්ෂ කරමි’යි යන චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, නොඇලුණු කෙනෙකු විමුක්ති ඥානදර්ශනය ප්‍රත්‍යක්ෂ කිරීම ස්වභාවික ධර්මතාවයකි.\n\nභික්‍ෂූණි, මෙසේ නොඇලීම විමුක්ති ඥානදර්ශනය පිණිස පවතී, විමුක්ති ඥානදර්ශනයේ ආනිසංස ඇති කරයි. කලකිරීම නොඇලීම පිණිස පවතී, නොඇලීමේ ආනිසංස ඇති කරයි. යථාභූත ඥානදර්ශනය කලකිරීම පිණිස පවතී, කලකිරීමේ ආනිසංස ඇති කරයි. සමාධිය යථාභූත ඥානදර්ශනය පිණිස පවතී, යථාභූත ඥානදර්ශනයේ ආනිසංස ඇති කරයි. සැපය සමාධිය පිණිස පවතී, සමාධියේ ආනිසංස ඇති කරයි. පස්සද්ධිය සැපය පිණිස පවතී, සැපයේ ආනිසංස ඇති කරයි. ප්‍රීතිය පස්සද්ධිය පිණිස පවතී, පස්සද්ධියේ ආනිසංස ඇති කරයි. ප්‍රමෝදය ප්‍රීතිය පිණිස පවතී, ප්‍රීතියේ ආනිසංස ඇති කරයි. අවිප්පටිසාරය ප්‍රමෝදය පිණිස පවතී, ප්‍රමෝදයේ ආනිසංස ඇති කරයි. කුසල සිල් අවිප්පටිසාරය පිණිස පවතී, අවිප්පටිසාරයේ ආනිසංස ඇති කරයි. භික්‍ෂූණි, මෙසේ ධර්මයන් ධර්මයන් වෙතට ගලා යයි. ධර්මයන් ධර්මයන් සම්පූර්ණ කරයි, මෙතෙරින් එතෙරට යෑම පිණිස.",
      "paliTitle": "Cetanākaraṇīyasuttaṃ",
      "englishTitle": "The Sutta on Volitional Duty",
      "sinhalaTitle": "චේතනා කටයුතු සූත්‍‌රය"
    },
    {
      "number": 3,
      "pali": "[a. ni. 5.24; 10.3] ‘‘Dussīlassa, bhikkhave, sīlavipannassa hatūpaniso hoti avippaṭisāro. Avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ. Pāmojje asati pāmojjavipannassa hatūpanisā hoti pīti. Pītiyā asati pītivipannassa hatūpanisā hoti passaddhi. Passaddhiyā asati passaddhivipannassa hatūpanisaṃ hoti sukhaṃ. Sukhe asati sukhavipannassa hatūpaniso hoti sammāsamādhi. Sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ. Yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpanisā hoti nibbidā. Nibbidāya asati nibbidāvipannassa hatūpaniso hoti virāgo. Virāge asati virāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Seyyathāpi, bhikkhave, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, dussīlassa sīlavipannassa hatūpaniso hoti avippaṭisāro, avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ…pe… vimuttiñāṇadassanaṃ. ‘‘Sīlavato, bhikkhave, sīlasampannassa upanisasampanno hoti avippaṭisāro, avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti pāmojjaṃ, pāmojje sati pāmojjasampannassa upanisasampannā hoti pīti, pītiyā sati pītisampannassa upanisasampannā hoti passaddhi, passaddhiyā sati passaddhisampannassa upanisasampannaṃ hoti sukhaṃ, sukhe sati sukhasampannassa upanisasampanno hoti sammāsamādhi, sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ, yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampannā hoti nibbidā, nibbidāya sati nibbidāsampannassa upanisasampanno hoti virāgo, virāge sati virāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Seyyathāpi, bhikkhave, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, sīlavato sīlasampannassa upanisasampanno hoti avippaṭisāro, avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti…pe… vimuttiñāṇadassana’’nti. Tatiyaṃ.",
      "english": "Monastics, for one who is immoral, for one deficient in virtue, the prerequisite for freedom from remorse is lost. When freedom from remorse is absent, for one deficient in freedom from remorse, the prerequisite for joy is lost. When joy is absent, for one deficient in joy, the prerequisite for rapture is lost. When rapture is absent, for one deficient in rapture, the prerequisite for tranquility is lost. When tranquility is absent, for one deficient in tranquility, the prerequisite for happiness is lost. When happiness is absent, for one deficient in happiness, the prerequisite for right concentration is lost. When right concentration is absent, for one deficient in right concentration, the prerequisite for knowledge and vision of things as they truly are is lost. When knowledge and vision of things as they truly are is absent, for one deficient in knowledge and vision of things as they truly are, the prerequisite for disenchantment is lost. When disenchantment is absent, for one deficient in disenchantment, the prerequisite for dispassion is lost. When dispassion is absent, for one deficient in dispassion, the prerequisite for knowledge and vision of liberation is lost.\n\nMonastics, just as a tree devoid of branches and leaves, its outer bark does not come to full development, nor does its inner bark, nor its sapwood, nor its heartwood come to full development. In the same way, monastics, for one who is immoral, for one deficient in virtue, the prerequisite for freedom from remorse is lost. When freedom from remorse is absent, for one deficient in freedom from remorse, the prerequisite for joy is lost. When joy is absent, for one deficient in joy, the prerequisite for rapture is lost. When rapture is absent, for one deficient in rapture, the prerequisite for tranquility is lost. When tranquility is absent, for one deficient in tranquility, the prerequisite for happiness is lost. When happiness is absent, for one deficient in happiness, the prerequisite for right concentration is lost. When right concentration is absent, for one deficient in right concentration, the prerequisite for knowledge and vision of things as they truly are is lost. When knowledge and vision of things as they truly are is absent, for one deficient in knowledge and vision of things as they truly are, the prerequisite for disenchantment is lost. When disenchantment is absent, for one deficient in disenchantment, the prerequisite for dispassion is lost. When dispassion is absent, for one deficient in dispassion, the prerequisite for knowledge and vision of liberation is lost.\n\nMonastics, for one who is virtuous, for one accomplished in virtue, the prerequisite for freedom from remorse is fulfilled. When freedom from remorse is present, for one accomplished in freedom from remorse, the prerequisite for joy is fulfilled. When joy is present, for one accomplished in joy, the prerequisite for rapture is fulfilled. When rapture is present, for one accomplished in rapture, the prerequisite for tranquility is fulfilled. When tranquility is present, for one accomplished in tranquility, the prerequisite for happiness is fulfilled. When happiness is present, for one accomplished in happiness, the prerequisite for right concentration is fulfilled. When right concentration is present, for one accomplished in right concentration, the prerequisite for knowledge and vision of things as they truly are is fulfilled. When knowledge and vision of things as they truly are is present, for one accomplished in knowledge and vision of things as they truly are, the prerequisite for disenchantment is fulfilled. When disenchantment is present, for one accomplished in disenchantment, the prerequisite for dispassion is fulfilled. When dispassion is present, for one accomplished in dispassion, the prerequisite for knowledge and vision of liberation is fulfilled.\n\nMonastics, just as a tree endowed with branches and leaves, its outer bark comes to full development, and its inner bark, its sapwood, and its heartwood come to full development. In the same way, monastics, for one who is virtuous, for one accomplished in virtue, the prerequisite for freedom from remorse is fulfilled. When freedom from remorse is present, for one accomplished in freedom from remorse, the prerequisite for joy is fulfilled. When joy is present, for one accomplished in joy, the prerequisite for rapture is fulfilled. When rapture is present, for one accomplished in rapture, the prerequisite for tranquility is fulfilled. When tranquility is present, for one accomplished in tranquility, the prerequisite for happiness is fulfilled. When happiness is present, for one accomplished in happiness, the prerequisite for right concentration is fulfilled. When right concentration is present, for one accomplished in right concentration, the prerequisite for knowledge and vision of things as they truly are is fulfilled. When knowledge and vision of things as they truly are is present, for one accomplished in knowledge and vision of things as they truly are, the prerequisite for disenchantment is fulfilled. When disenchantment is present, for one accomplished in disenchantment, the prerequisite for dispassion is fulfilled. When dispassion is present, for one accomplished in dispassion, the prerequisite for knowledge and vision of liberation is fulfilled.",
      "sinhala": "මහණෙනි, දුශ්ශීල වූ, ශීලයෙන් පිරිහී ගිය පුද්ගලයාට නොපැසුළුණුවත්කම ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. නොපැසුළුණුවත්කම නැති කල්හි, එනම් නොපැසුළුණුවත්කමින් පිරිහී ගිය පුද්ගලයාට ප්‍රීති ප්‍රමෝදය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. ප්‍රීති ප්‍රමෝදය නැති කල්හි, එනම් ප්‍රීති ප්‍රමෝදයෙන් පිරිහී ගිය පුද්ගලයාට ප්‍රීතිය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. ප්‍රීතිය නැති කල්හි, එනම් ප්‍රීතියෙන් පිරිහී ගිය පුද්ගලයාට පස්සද්ධිය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. පස්සද්ධිය නැති කල්හි, එනම් පස්සද්ධියෙන් පිරිහී ගිය පුද්ගලයාට සුවය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. සුවය නැති කල්හි, එනම් සුවයෙන් පිරිහී ගිය පුද්ගලයාට සම්මාසමාධිය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. සම්මාසමාධිය නැති කල්හි, එනම් සම්මාසමාධියෙන් පිරිහී ගිය පුද්ගලයාට යථාභූතඥාණදර්ශනය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. යථාභූතඥාණදර්ශනය නැති කල්හි, එනම් යථාභූතඥාණදර්ශනයෙන් පිරිහී ගිය පුද්ගලයාට නිබ්බිදාව (කම් සැප කෙරෙහි කලකිරීම) ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. නිබ්බිදාව නැති කල්හි, එනම් නිබ්බිදාවෙන් පිරිහී ගිය පුද්ගලයාට විරාගය (තෘෂ්ණාව දුරු කිරීම) ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. විරාගය නැති කල්හි, එනම් විරාගයෙන් පිරිහී ගිය පුද්ගලයාට විමුක්තිඥාණදර්ශනය (විමුක්තිය පිළිබඳ ඥාණය හා දර්ශනය) ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත.\n\nමහණෙනි, යම් සේ අතුපතරින් හා පත්‍රවලින් හීන වූ ගසක පිටපොත්තද, ඇතුළු පොත්තද, ඵෙග්ගුවද, සාරයද සම්පූර්ණයෙන් වැඩීම සිදු නොවන්නේද; එසෙවම මහණෙනි, දුශ්ශීල වූ, ශීලයෙන් පිරිහී ගිය පුද්ගලයාට නොපැසුළුණුවත්කම ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. නොපැසුළුණුවත්කම නැති කල්හි, එනම් නොපැසුළුණුවත්කමින් පිරිහී ගිය පුද්ගලයාට ප්‍රීති ප්‍රමෝදය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. ප්‍රීති ප්‍රමෝදය නැති කල්හි, එනම් ප්‍රීති ප්‍රමෝදයෙන් පිරිහී ගිය පුද්ගලයාට ප්‍රීතිය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. ප්‍රීතිය නැති කල්හි, එනම් ප්‍රීතියෙන් පිරිහී ගිය පුද්ගලයාට පස්සද්ධිය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. පස්සද්ධිය නැති කල්හි, එනම් පස්සද්ධියෙන් පිරිහී ගිය පුද්ගලයාට සුවය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. සුවය නැති කල්හි, එනම් සුවයෙන් පිරිහී ගිය පුද්ගලයාට සම්මාසමාධිය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. සම්මාසමාධිය නැති කල්හි, එනම් සම්මාසමාධියෙන් පිරිහී ගිය පුද්ගලයාට යථාභූතඥාණදර්ශනය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. යථාභූතඥාණදර්ශනය නැති කල්හි, එනම් යථාභූතඥාණදර්ශනයෙන් පිරිහී ගිය පුද්ගලයාට නිබ්බිදාව ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. නිබ්බිදාව නැති කල්හි, එනම් නිබ්බිදාවෙන් පිරිහී ගිය පුද්ගලයාට විරාගය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත. විරාගය නැති කල්හි, එනම් විරාගයෙන් පිරිහී ගිය පුද්ගලයාට විමුක්තිඥාණදර්ශනය ඇතිවීමට හේතු වූ පදනම විනාශ වී ඇත.\n\nමහණෙනි, ශීලවන්ත වූ, ශීලයෙන් යුක්ත වූ පුද්ගලයාට නොපැසුළුණුවත්කම ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. නොපැසුළුණුවත්කම ඇති කල්හි, එනම් නොපැසුළුණුවත්කමෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීති ප්‍රමෝදය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. ප්‍රීති ප්‍රමෝදය ඇති කල්හි, එනම් ප්‍රීති ප්‍රමෝදයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීතිය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. ප්‍රීතිය ඇති කල්හි, එනම් ප්‍රීතියෙන් යුක්ත වූ පුද්ගලයාට පස්සද්ධිය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. පස්සද්ධිය ඇති කල්හි, එනම් පස්සද්ධියෙන් යුක්ත වූ පුද්ගලයාට සුවය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. සුවය ඇති කල්හි, එනම් සුවයෙන් යුක්ත වූ පුද්ගලයාට සම්මාසමාධිය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. සම්මාසමාධිය ඇති කල්හි, එනම් සම්මාසමාධියෙන් යුක්ත වූ පුද්ගලයාට යථාභූතඥාණදර්ශනය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. යථාභූතඥාණදර්ශනය ඇති කල්හි, එනම් යථාභූතඥාණදර්ශනයෙන් යුක්ත වූ පුද්ගලයාට නිබ්බිදාව ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. නිබ්බිදාව ඇති කල්හි, එනම් නිබ්බිදාවෙන් යුක්ත වූ පුද්ගලයාට විරාගය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. විරාගය ඇති කල්හි, එනම් විරාගයෙන් යුක්ත වූ පුද්ගලයාට විමුක්තිඥාණදර්ශනය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත.\n\nමහණෙනි, යම් සේ අතුපතරින් හා පත්‍රවලින් යුක්ත වූ ගසක පිටපොත්තද, ඇතුළු පොත්තද, ඵෙග්ගුවද, සාරයද සම්පූර්ණයෙන් වැඩීම සිදු වන්නේද; එසෙවම මහණෙනි, ශීලවන්ත වූ, ශීලයෙන් යුක්ත වූ පුද්ගලයාට නොපැසුළුණුවත්කම ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. නොපැසුළුණුවත්කම ඇති කල්හි, එනම් නොපැසුළුණුවත්කමෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීති ප්‍රමෝදය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. ප්‍රීති ප්‍රමෝදය ඇති කල්හි, එනම් ප්‍රීති ප්‍රමෝදයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීතිය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. ප්‍රීතිය ඇති කල්හි, එනම් ප්‍රීතියෙන් යුක්ත වූ පුද්ගලයාට පස්සද්ධිය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. පස්සද්ධිය ඇති කල්හි, එනම් පස්සද්ධියෙන් යුක්ත වූ පුද්ගලයාට සුවය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. සුවය ඇති කල්හි, එනම් සුවයෙන් යුක්ත වූ පුද්ගලයාට සම්මාසමාධිය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. සම්මාසමාධිය ඇති කල්හි, එනම් සම්මාසමාධියෙන් යුක්ත වූ පුද්ගලයාට යථාභූතඥාණදර්ශනය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. යථාභූතඥාණදර්ශනය ඇති කල්හි, එනම් යථාභූතඥාණදර්ශනයෙන් යුක්ත වූ පුද්ගලයාට නිබ්බිදාව ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. නිබ්බිදාව ඇති කල්හි, එනම් නිබ්බිදාවෙන් යුක්ත වූ පුද්ගලයාට විරාගය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත. විරාගය ඇති කල්හි, එනම් විරාගයෙන් යුක්ත වූ පුද්ගලයාට විමුක්තිඥාණදර්ශනය ඇතිවීමට හේතු වූ පදනම සම්පූර්ණ වී ඇත.",
      "paliTitle": "Paṭhamaupanisāsuttaṃ",
      "englishTitle": "First Discourse on Conditions",
      "sinhalaTitle": "ප්‍ර‍ථම උපනිසා සූත්‍‍රය"
    },
    {
      "number": 4,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti [bhikkhavoti (sī. syā. pī.) evaṃ sabbattha a. ni. 10.4]. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Dussīlassa, āvuso, sīlavipannassa hatūpaniso hoti avippaṭisāro, avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ, pāmojje asati pāmojjavipannassa hatūpanisā hoti pīti, pītiyā asati pītivipannassa hatūpanisā hoti passaddhi, passaddhiyā asati passaddhivipannassa hatūpanisaṃ hoti sukhaṃ, sukhe asati sukhavipannassa hatūpaniso hoti sammāsamādhi, sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ, yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpanisā hoti nibbidā, nibbidāya asati nibbidāvipannassa hatūpaniso hoti virāgo, virāge asati virāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Seyyathāpi, āvuso, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, āvuso, dussīlassa sīlavipannassa hatūpaniso hoti avippaṭisāro, avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ…pe… vimuttiñāṇadassanaṃ. ‘‘Sīlavato, āvuso, sīlasampannassa upanisasampanno hoti avippaṭisāro, avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti pāmojjaṃ, pāmojje sati pāmojjasampannassa upanisasampannā hoti pīti, pītiyā sati pītisampannassa upanisasampannā hoti passaddhi, passaddhiyā sati passaddhisampannassa upanisasampannaṃ hoti sukhaṃ, sukhe sati sukhasampannassa upanisasampanno hoti sammāsamādhi, sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ, yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampannā hoti nibbidā, nibbidāya sati nibbidāsampannassa upanisasampanno hoti virāgo, virāge sati virāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Seyyathāpi, āvuso, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, āvuso, sīlavato sīlasampannassa upanisasampanno hoti avippaṭisāro, avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti pāmojjaṃ…pe… vimuttiñāṇadassana’’nti. Catutthaṃ.",
      "english": "Then, indeed, the Venerable Sāriputta addressed the bhikkhus, saying, \"Friends, monastics!\" \"Friend!\" those bhikkhus replied to the Venerable Sāriputta. The Venerable Sāriputta spoke this: \"Friends, for one who is immoral, who is deficient in virtue, freedom from remorse lacks the foundation for its arising. When freedom from remorse is absent, when freedom from remorse has been lost, joy lacks the foundation for its arising. When joy is absent, when joy has been lost, rapture lacks the foundation for its arising. When rapture is absent, when rapture has been lost, tranquility lacks the foundation for its arising. When tranquility is absent, when tranquility has been lost, happiness lacks the foundation for its arising. When happiness is absent, when happiness has been lost, right concentration lacks the foundation for its arising. When right concentration is absent, when right concentration has been lost, knowledge and vision of things as they truly are lacks the foundation for its arising. When knowledge and vision of things as they truly are is absent, when knowledge and vision of things as they truly are has been lost, disenchantment lacks the foundation for its arising. When disenchantment is absent, when disenchantment has been lost, dispassion lacks the foundation for its arising. When dispassion is absent, when dispassion has been lost, knowledge and vision of liberation lacks the foundation for its arising.\"\n\n\"Just as, friends, a tree that is deficient in branches and foliage—its outer bark does not reach full development, nor does its inner bark, nor its sapwood, nor its heartwood reach full development. In the same way, friends, for one who is immoral, who is deficient in virtue, freedom from remorse lacks the foundation for its arising. When freedom from remorse is absent, when freedom from remorse has been lost, joy lacks the foundation for its arising. When joy is absent, when joy has been lost, rapture lacks the foundation for its arising. When rapture is absent, when rapture has been lost, tranquility lacks the foundation for its arising. When tranquility is absent, when tranquility has been lost, happiness lacks the foundation for its arising. When happiness is absent, when happiness has been lost, right concentration lacks the foundation for its arising. When right concentration is absent, when right concentration has been lost, knowledge and vision of things as they truly are lacks the foundation for its arising. When knowledge and vision of things as they truly are is absent, when knowledge and vision of things as they truly are has been lost, disenchantment lacks the foundation for its arising. When disenchantment is absent, when disenchantment has been lost, dispassion lacks the foundation for its arising. When dispassion is absent, when dispassion has been lost, knowledge and vision of liberation lacks the foundation for its arising.\"\n\n\"For one who is virtuous, friends, who is complete in virtue, freedom from remorse has the foundation for its arising. When freedom from remorse is present, when freedom from remorse is complete, joy has the foundation for its arising. When joy is present, when joy is complete, rapture has the foundation for its arising. When rapture is present, when rapture is complete, tranquility has the foundation for its arising. When tranquility is present, when tranquility is complete, happiness has the foundation for its arising. When happiness is present, when happiness is complete, right concentration has the foundation for its arising. When right concentration is present, when right concentration is complete, knowledge and vision of things as they truly are has the foundation for its arising. When knowledge and vision of things as they truly are is present, when knowledge and vision of things as they truly are is complete, disenchantment has the foundation for its arising. When disenchantment is present, when disenchantment is complete, dispassion has the foundation for its arising. When dispassion is present, when dispassion is complete, knowledge and vision of liberation has the foundation for its arising.\"\n\n\"Just as, friends, a tree that is complete with branches and foliage—its outer bark reaches full development, and its inner bark, and its sapwood, and its heartwood reach full development. In the same way, friends, for one who is virtuous, who is complete in virtue, freedom from remorse has the foundation for its arising. When freedom from remorse is present, when freedom from remorse is complete, joy has the foundation for its arising. When joy is present, when joy is complete, rapture has the foundation for its arising. When rapture is present, when rapture is complete, tranquility has the foundation for its arising. When tranquility is present, when tranquility is complete, happiness has the foundation for its arising. When happiness is present, when happiness is complete, right concentration has the foundation for its arising. When right concentration is present, when right concentration is complete, knowledge and vision of things as they truly are has the foundation for its arising. When knowledge and vision of things as they truly are is present, when knowledge and vision of things as they truly are is complete, disenchantment has the foundation for its arising. When disenchantment is present, when disenchantment is complete, dispassion has the foundation for its arising. When dispassion is present, when dispassion is complete, knowledge and vision of liberation has the foundation for its arising.\"",
      "sinhala": "එවිට ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවීරයන් වහන්සේ භික්‍ෂූන් ඇමතූහ – \"ඇවැත්නි භික්‍ෂූනි\" යනුවෙන්. \"ඇවැත්නි\" යි ඒ භික්‍ෂූහු ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවීරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවීරයන් වහන්සේ මෙය වදාළහ – \"ඇවැත්නි, දුශ්ශීල වූ, සීලයෙන් පිරිහුණූ පුද්ගලයාට නොපසුතැවීම නමැති උපනිශ්‍රය නැති වී යයි. නොපසුතැවීම නොමැති කල්හි, නොපසුතැවීමෙන් පිරිහුණූ පුද්ගලයාට ප්‍රමෝදය නමැති උපනිශ්‍රය නැති වී යයි. ප්‍රමෝදය නොමැති කල්හි, ප්‍රමෝදයෙන් පිරිහුණූ පුද්ගලයාට ප්‍රීතිය නමැති උපනිශ්‍රය නැති වී යයි. ප්‍රීතිය නොමැති කල්හි, ප්‍රීතියෙන් පිරිහුණූ පුද්ගලයාට ප්‍රශ්‍රබ්ධිය (කාය-චිත්ත සංසිඳීම) නමැති උපනිශ්‍රය නැති වී යයි. ප්‍රශ්‍රබ්ධිය නොමැති කල්හි, ප්‍රශ්‍රබ්ධියෙන් පිරිහුණූ පුද්ගලයාට සැපය නමැති උපනිශ්‍රය නැති වී යයි. සැපය නොමැති කල්හි, සැපයෙන් පිරිහුණූ පුද්ගලයාට සම්මාසමාධිය නමැති උපනිශ්‍රය නැති වී යයි. සම්මාසමාධිය නොමැති කල්හි, සම්මාසමාධියෙන් පිරිහුණූ පුද්ගලයාට යථාභූත ඥානදර්ශනය නමැති උපනිශ්‍රය නැති වී යයි. යථාභූත ඥානදර්ශනය නොමැති කල්හි, යථාභූත ඥානදර්ශනයෙන් පිරිහුණූ පුද්ගලයාට නිබ්බිදාව (ලෝකයෙන් කලකිරීම) නමැති උපනිශ්‍රය නැති වී යයි. නිබ්බිදාව නොමැති කල්හි, නිබ්බිදාවෙන් පිරිහුණූ පුද්ගලයාට විරාගය (තෘෂ්ණා ආදියෙන් වෙන්වීම) නමැති උපනිශ්‍රය නැති වී යයි. විරාගය නොමැති කල්හි, විරාගයෙන් පිරිහුණූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය නමැති උපනිශ්‍රය නැති වී යයි.\n\nඇවැත්නි, අතුපතරින් හා පත්‍රවලින් රහිත වූ වෘක්‍ෂයක් යම්සේ ද, එහි පිට පොත්ත ද සම්පූර්ණ නොවෙයි, ඇතුළු පොත්ත ද සම්පූර්ණ නොවෙයි, මෘදු ලී කොටස ද සම්පූර්ණ නොවෙයි, සාරවත් ලී කොටස ද සම්පූර්ණ නොවෙයි. ඇවැත්නි, එලෙසම දුශ්ශීල වූ, සීලයෙන් පිරිහුණූ පුද්ගලයාට නොපසුතැවීම නමැති උපනිශ්‍රය නැති වී යයි. නොපසුතැවීම නොමැති කල්හි, නොපසුතැවීමෙන් පිරිහුණූ පුද්ගලයාට ප්‍රමෝදය නමැති උපනිශ්‍රය නැති වී යයි. ප්‍රමෝදය නොමැති කල්හි, ප්‍රමෝදයෙන් පිරිහුණූ පුද්ගලයාට ප්‍රීතිය නමැති උපනිශ්‍රය නැති වී යයි. ප්‍රීතිය නොමැති කල්හි, ප්‍රීතියෙන් පිරිහුණූ පුද්ගලයාට ප්‍රශ්‍රබ්ධිය නමැති උපනිශ්‍රය නැති වී යයි. ප්‍රශ්‍රබ්ධිය නොමැති කල්හි, ප්‍රශ්‍රබ්ධියෙන් පිරිහුණූ පුද්ගලයාට සැපය නමැති උපනිශ්‍රය නැති වී යයි. සැපය නොමැති කල්හි, සැපයෙන් පිරිහුණූ පුද්ගලයාට සම්මාසමාධිය නමැති උපනිශ්‍රය නැති වී යයි. සම්මාසමාධිය නොමැති කල්හි, සම්මාසමාධියෙන් පිරිහුණූ පුද්ගලයාට යථාභූත ඥානදර්ශනය නමැති උපනිශ්‍රය නැති වී යයි. යථාභූත ඥානදර්ශනය නොමැති කල්හි, යථාභූත ඥානදර්ශනයෙන් පිරිහුණූ පුද්ගලයාට නිබ්බිදාව නමැති උපනිශ්‍රය නැති වී යයි. නිබ්බිදාව නොමැති කල්හි, නිබ්බිදාවෙන් පිරිහුණූ පුද්ගලයාට විරාගය නමැති උපනිශ්‍රය නැති වී යයි. විරාගය නොමැති කල්හි, විරාගයෙන් පිරිහුණූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය නමැති උපනිශ්‍රය නැති වී යයි.\n\nඇවැත්නි, සීලවන්ත වූ, සීලයෙන් යුක්ත වූ පුද්ගලයාට නොපසුතැවීම නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. නොපසුතැවීම ඇති කල්හි, නොපසුතැවීමෙන් යුක්ත වූ පුද්ගලයාට ප්‍රමෝදය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. ප්‍රමෝදය ඇති කල්හි, ප්‍රමෝදයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීතිය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. ප්‍රීතිය ඇති කල්හි, ප්‍රීතියෙන් යුක්ත වූ පුද්ගලයාට ප්‍රශ්‍රබ්ධිය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. ප්‍රශ්‍රබ්ධිය ඇති කල්හි, ප්‍රශ්‍රබ්ධියෙන් යුක්ත වූ පුද්ගලයාට සැපය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. සැපය ඇති කල්හි, සැපයෙන් යුක්ත වූ පුද්ගලයාට සම්මාසමාධිය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. සම්මාසමාධිය ඇති කල්හි, සම්මාසමාධියෙන් යුක්ත වූ පුද්ගලයාට යථාභූත ඥානදර්ශනය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. යථාභූත ඥානදර්ශනය ඇති කල්හි, යථාභූත ඥානදර්ශනයෙන් යුක්ත වූ පුද්ගලයාට නිබ්බිදාව නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. නිබ්බිදාව ඇති කල්හි, නිබ්බිදාවෙන් යුක්ත වූ පුද්ගලයාට විරාගය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. විරාගය ඇති කල්හි, විරාගයෙන් යුක්ත වූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි.\n\nඇවැත්නි, අතුපතරින් හා පත්‍රවලින් යුක්ත වූ වෘක්‍ෂයක් යම්සේ ද, එහි පිට පොත්ත ද සම්පූර්ණ වෙයි, ඇතුළු පොත්ත ද සම්පූර්ණ වෙයි, මෘදු ලී කොටස ද සම්පූර්ණ වෙයි, සාරවත් ලී කොටස ද සම්පූර්ණ වෙයි. ඇවැත්නි, එලෙසම සීලවන්ත වූ, සීලයෙන් යුක්ත වූ පුද්ගලයාට නොපසුතැවීම නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. නොපසුතැවීම ඇති කල්හි, නොපසුතැවීමෙන් යුක්ත වූ පුද්ගලයාට ප්‍රමෝදය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. ප්‍රමෝදය ඇති කල්හි, ප්‍රමෝදයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීතිය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. ප්‍රීතිය ඇති කල්හි, ප්‍රීතියෙන් යුක්ත වූ පුද්ගලයාට ප්‍රශ්‍රබ්ධිය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. ප්‍රශ්‍රබ්ධිය ඇති කල්හි, ප්‍රශ්‍රබ්ධියෙන් යුක්ත වූ පුද්ගලයාට සැපය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. සැපය ඇති කල්හි, සැපයෙන් යුක්ත වූ පුද්ගලයාට සම්මාසමාධිය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. සම්මාසමාධිය ඇති කල්හි, සම්මාසමාධියෙන් යුක්ත වූ පුද්ගලයාට යථාභූත ඥානදර්ශනය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. යථාභූත ඥානදර්ශනය ඇති කල්හි, යථාභූත ඥානදර්ශනයෙන් යුක්ත වූ පුද්ගලයාට නිබ්බිදාව නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. නිබ්බිදාව ඇති කල්හි, නිබ්බිදාවෙන් යුක්ත වූ පුද්ගලයාට විරාගය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි. විරාගය ඇති කල්හි, විරාගයෙන් යුක්ත වූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය නමැති උපනිශ්‍රය සම්පූර්ණ වෙයි.",
      "paliTitle": "Dutiyaupanisāsuttaṃ",
      "englishTitle": "Second Foundation Discourse",
      "sinhalaTitle": "දෙවන උපනිසා සූත්‍රය"
    },
    {
      "number": 5,
      "pali": "[a. ni. 10.5] Tatra kho āyasmā ānando bhikkhū āmantesi…pe… ‘‘dussīlassa, āvuso, sīlavipannassa hatūpaniso hoti avippaṭisāro, avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ, pāmojje asati pāmojjavipannassa hatūpanisā hoti pīti, pītiyā asati pītivipannassa hatūpanisā hoti passaddhi, passaddhiyā asati passaddhivipannassa hatūpanisaṃ hoti sukhaṃ, sukhe asati sukhavipannassa hatūpaniso hoti sammāsamādhi, sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ, yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpanisā hoti nibbidā, nibbidāya asati nibbidāvipannassa hatūpaniso hoti virāgo, virāge asati virāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Seyyathāpi, āvuso, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, āvuso, dussīlassa sīlavipannassa hatūpaniso hoti avippaṭisāro, avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ…pe… vimuttiñāṇadassanaṃ. ‘‘Sīlavato, āvuso, sīlasampannassa upanisasampanno hoti avippaṭisāro, avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti pāmojjaṃ, pāmojje sati pāmojjasampannassa upanisasampannā hoti pīti, pītiyā sati pītisampannassa upanisasampannā hoti passaddhi, passaddhiyā sati passaddhisampannassa upanisasampannaṃ hoti sukhaṃ, sukhe sati sukhasampannassa upanisasampanno hoti sammāsamādhi, sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ, yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampannā hoti nibbidā, nibbidāya sati nibbidāsampannassa upanisasampanno hoti virāgo, virāge sati virāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Seyyathāpi, āvuso, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, āvuso, sīlavato sīlasampannassa upanisasampanno hoti avippaṭisāro, avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti pāmojjaṃ…pe… vimuttiñāṇadassana’’nti. Pañcamaṃ.",
      "english": "Friends, for one who is immoral, deficient in virtue, the supportive condition for lack of remorse is lost. When lack of remorse is absent, for one deficient in lack of remorse, the supportive condition for joy is lost. When joy is absent, for one deficient in joy, the supportive condition for rapture is lost. When rapture is absent, for one deficient in rapture, the supportive condition for tranquility is lost. When tranquility is absent, for one deficient in tranquility, the supportive condition for happiness is lost. When happiness is absent, for one deficient in happiness, the supportive condition for right concentration is lost. When right concentration is absent, for one deficient in right concentration, the supportive condition for knowledge and vision of things as they truly are is lost. When knowledge and vision of things as they truly are is absent, for one deficient in knowledge and vision of things as they truly are, the supportive condition for disenchantment is lost. When disenchantment is absent, for one deficient in disenchantment, the supportive condition for fading away is lost. When fading away is absent, for one deficient in fading away, the supportive condition for knowledge and vision of liberation is lost.\n\nJust as, friends, a tree deficient in branches and leaves. Its outer bark does not grow to fullness, nor does its inner bark, its sapwood, or its heartwood. Even so, friends, for one who is immoral, deficient in virtue, the supportive condition for lack of remorse is lost; when lack of remorse is absent, for one deficient in lack of remorse, the supportive condition for joy is lost... and so on, up to the knowledge and vision of liberation.\n\nFriends, for one who is virtuous, accomplished in virtue, lack of remorse is an accomplished supportive condition. When lack of remorse is present, for one accomplished in lack of remorse, joy is an accomplished supportive condition. When joy is present, for one accomplished in joy, rapture is an accomplished supportive condition. When rapture is present, for one accomplished in rapture, tranquility is an accomplished supportive condition. When tranquility is present, for one accomplished in tranquility, happiness is an accomplished supportive condition. When happiness is present, for one accomplished in happiness, right concentration is an accomplished supportive condition. When right concentration is present, for one accomplished in right concentration, knowledge and vision of things as they truly are is an accomplished supportive condition. When knowledge and vision of things as they truly are is present, for one accomplished in knowledge and vision of things as they truly are, disenchantment is an accomplished supportive condition. When disenchantment is present, for one accomplished in disenchantment, fading away is an accomplished supportive condition. When fading away is present, for one accomplished in fading away, knowledge and vision of liberation is an accomplished supportive condition.\n\nJust as, friends, a tree endowed with branches and leaves. Its outer bark grows to fullness, and its inner bark, its sapwood, and its heartwood grow to fullness. Even so, friends, for one who is virtuous, accomplished in virtue, lack of remorse is an accomplished supportive condition; when lack of remorse is present, for one accomplished in lack of remorse, joy is an accomplished supportive condition... and so on, up to the knowledge and vision of liberation.",
      "sinhala": "එහිදී ආයුෂ්මත් ආනන්ද ස්ථ\\u200Dවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: \"ඇවැත්නි, දුස්සීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයාට නොපැළැඳීම (පශ්චාත්තාප රහිත බව) සඳහා වූ හේතුව නැතිව යයි. නොපැළැඳීම නැති කල, නොපැළැඳීමෙන් පිරිහී ගිය පුද්ගලයාට ප්\\u200Dරමෝදය (ප්\\u200Dරීතිමත් බව) සඳහා වූ හේතුව නැතිව යයි. ප්\\u200Dරමෝදය නැති කල, ප්\\u200Dරමෝදයෙන් පිරිහී ගිය පුද්ගලයාට ප්\\u200Dරීතිය (ප්\\u200Dරීතිමත් විදීම) සඳහා වූ හේතුව නැතිව යයි. ප්\\u200Dරීතිය නැති කල, ප්\\u200Dරීතියෙන් පිරිහී ගිය පුද්ගලයාට පස්සද්ධිය (කයේ හා සිතේ සන්සුන් බව) සඳහා වූ හේතුව නැතිව යයි. පස්සද්ධිය නැති කල, පස්සද්ධියෙන් පිරිහී ගිය පුද්ගලයාට සැපය සඳහා වූ හේතුව නැතිව යයි. සැපය නැති කල, සැපයෙන් පිරිහී ගිය පුද්ගලයාට සම්මාසමාධිය (නිරවුල් සිතේ එකඟ බව) සඳහා වූ හේතුව නැතිව යයි. සම්මාසමාධිය නැති කල, සම්මාසමාධියෙන් පිරිහී ගිය පුද්ගලයාට යථාභූත ඥානදර්ශනය (යථාර්ථය අවබෝධ වන ඥානය හා දැකීම) සඳහා වූ හේතුව නැතිව යයි. යථාභූත ඥානදර්ශනය නැති කල, යථාභූත ඥානදර්ශනයෙන් පිරිහී ගිය පුද්ගලයාට නිර්වේදය (කම්මැළිකම, කලකිරීම) සඳහා වූ හේතුව නැතිව යයි. නිර්වේදය නැති කල, නිර්වේදයෙන් පිරිහී ගිය පුද්ගලයාට විරාගය (රාගය දුරු කිරීම) සඳහා වූ හේතුව නැතිව යයි. විරාගය නැති කල, විරාගයෙන් පිරිහී ගිය පුද්ගලයාට විමුක්ති ඥානදර්ශනය (විමුක්තිය පිළිබඳ ඥානය හා දැකීම) සඳහා වූ හේතුව නැතිව යයි.\"\n\n\"ඇවැත්නි, අතුපතරින් හා පත්‍රවලින් හීන වූ ගසක් යම්සේද, එහි ලියවැල් ද, පොත්ත ද, සප්තසාර ද, අරටුව ද සම්පූර්ණ නොවන්නේය. එසේම ඇවැත්නි, දුස්සීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයාට නොපැළැඳීම සඳහා වූ හේතුව නැතිව යයි. නොපැළැඳීම නැති කල, නොපැළැඳීමෙන් පිරිහී ගිය පුද්ගලයාට ප්\\u200Dරමෝදය සඳහා වූ හේතුව නැතිව යයි. ප්\\u200Dරමෝදය නැති කල, ප්\\u200Dරමෝදයෙන් පිරිහී ගිය පුද්ගලයාට ප්\\u200Dරීතිය සඳහා වූ හේතුව නැතිව යයි. ප්\\u200Dරීතිය නැති කල, ප්\\u200Dරීතියෙන් පිරිහී ගිය පුද්ගලයාට පස්සද්ධිය සඳහා වූ හේතුව නැතිව යයි. පස්සද්ධිය නැති කල, පස්සද්ධියෙන් පිරිහී ගිය පුද්ගලයාට සැපය සඳහා වූ හේතුව නැතිව යයි. සැපය නැති කල, සැපයෙන් පිරිහී ගිය පුද්ගලයාට සම්මාසමාධිය සඳහා වූ හේතුව නැතිව යයි. සම්මාසමාධිය නැති කල, සම්මාසමාධියෙන් පිරිහී ගිය පුද්ගලයාට යථාභූත ඥානදර්ශනය සඳහා වූ හේතුව නැතිව යයි. යථාභූත ඥානදර්ශනය නැති කල, යථාභූත ඥානදර්ශනයෙන් පිරිහී ගිය පුද්ගලයාට නිර්වේදය සඳහා වූ හේතුව නැතිව යයි. නිර්වේදය නැති කල, නිර්වේදයෙන් පිරිහී ගිය පුද්ගලයාට විරාගය සඳහා වූ හේතුව නැතිව යයි. විරාගය නැති කල, විරාගයෙන් පිරිහී ගිය පුද්ගලයාට විමුක්ති ඥානදර්ශනය සඳහා වූ හේතුව ද නැතිව යයි.\n\n\"ඇවැත්නි, සීලවන්ත වූ, සීලයෙන් සම්පූර්ණ වූ පුද්ගලයාට නොපැළැඳීම සඳහා වූ හේතුව සම්පූර්ණ වේ. නොපැළැඳීම ඇති කල, නොපැළැඳීමෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්\\u200Dරමෝදය සඳහා වූ හේතුව සම්පූර්ණ වේ. ප්\\u200Dරමෝදය ඇති කල, ප්\\u200Dරමෝදයෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්\\u200Dරීතිය සඳහා වූ හේතුව සම්පූර්ණ වේ. ප්\\u200Dරීතිය ඇති කල, ප්\\u200Dරීතියෙන් සම්පූර්ණ වූ පුද්ගලයාට පස්සද්ධිය සඳහා වූ හේතුව සම්පූර්ණ වේ. පස්සද්ධිය ඇති කල, පස්සද්ධියෙන් සම්පූර්ණ වූ පුද්ගලයාට සැපය සඳහා වූ හේතුව සම්පූර්ණ වේ. සැපය ඇති කල, සැපයෙන් සම්පූර්ණ වූ පුද්ගලයාට සම්මාසමාධිය සඳහා වූ හේතුව සම්පූර්ණ වේ. සම්මාසමාධිය ඇති කල, සම්මාසමාධියෙන් සම්පූර්ණ වූ පුද්ගලයාට යථාභූත ඥානදර්ශනය සඳහා වූ හේතුව සම්පූර්ණ වේ. යථාභූත ඥානදර්ශනය ඇති කල, යථාභූත ඥානදර්ශනයෙන් සම්පූර්ණ වූ පුද්ගලයාට නිර්වේදය සඳහා වූ හේතුව සම්පූර්ණ වේ. නිර්වේදය ඇති කල, නිර්වේදයෙන් සම්පූර්ණ වූ පුද්ගලයාට විරාගය සඳහා වූ හේතුව සම්පූර්ණ වේ. විරාගය ඇති කල, විරාගයෙන් සම්පූර්ණ වූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය සඳහා වූ හේතුව ද සම්පූර්ණ වේ.\n\n\"ඇවැත්නි, අතුපතරින් හා පත්‍රවලින් යුක්ත වූ ගසක් යම්සේද, එහි ලියවැල් ද, පොත්ත ද, සප්තසාර ද, අරටුව ද සම්පූර්ණ වන්නේය. එසේම ඇවැත්නි, සීලවන්ත වූ, සීලයෙන් සම්පූර්ණ වූ පුද්ගලයාට නොපැළැඳීම සඳහා වූ හේතුව සම්පූර්ණ වේ. නොපැළැඳීම ඇති කල, නොපැළැඳීමෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්\\u200Dරමෝදය සඳහා වූ හේතුව සම්පූර්ණ වේ. ප්\\u200Dරමෝදය ඇති කල, ප්\\u200Dරමෝදයෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්\\u200Dරීතිය සඳහා වූ හේතුව සම්පූර්ණ වේ. ප්\\u200Dරීතිය ඇති කල, ප්\\u200Dරීතියෙන් සම්පූර්ණ වූ පුද්ගලයාට පස්සද්ධිය සඳහා වූ හේතුව සම්පූර්ණ වේ. පස්සද්ධිය ඇති කල, පස්සද්ධියෙන් සම්පූර්ණ වූ පුද්ගලයාට සැපය සඳහා වූ හේතුව සම්පූර්ණ වේ. සැපය ඇති කල, සැපයෙන් සම්පූර්ණ වූ පුද්ගලයාට සම්මාසමාධිය සඳහා වූ හේතුව සම්පූර්ණ වේ. සම්මාසමාධිය ඇති කල, සම්මාසමාධියෙන් සම්පූර්ණ වූ පුද්ගලයාට යථාභූත ඥානදර්ශනය සඳහා වූ හේතුව සම්පූර්ණ වේ. යථාභූත ඥානදර්ශනය ඇති කල, යථාභූත ඥානදර්ශනයෙන් සම්පූර්ණ වූ පුද්ගලයාට නිර්වේදය සඳහා වූ හේතුව සම්පූර්ණ වේ. නිර්වේදය ඇති කල, නිර්වේදයෙන් සම්පූර්ණ වූ පුද්ගලයාට විරාගය සඳහා වූ හේතුව සම්පූර්ණ වේ. විරාගය ඇති කල, විරාගයෙන් සම්පූර්ණ වූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය සඳහා වූ හේතුව ද සම්පූර්ණ වේ.\"",
      "paliTitle": "Tatiyaupanisāsuttaṃ",
      "englishTitle": "The Third Condition Sutta",
      "sinhalaTitle": "තෙවන උපනිසා සූත්‍රය"
    },
    {
      "number": 6,
      "pali": "‘‘Yo so, bhikkhave, bhikkhu akkosako paribhāsako ariyūpavādo sabrahmacārīnaṃ, ṭhānametaṃ avakāso yaṃ so ekādasannaṃ byasanānaṃ aññataraṃ byasanaṃ nigaccheyya. Katamesaṃ ekādasannaṃ? Anadhigataṃ nādhigacchati, adhigatā parihāyati, saddhammassa na vodāyanti, saddhammesu vā adhimāniko hoti, anabhirato vā brahmacariyaṃ carati, aññataraṃ vā saṃkiliṭṭhaṃ āpattiṃ āpajjati, sikkhaṃ vā paccakkhāya hīnāyāvattati, gāḷhaṃ vā rogātaṅkaṃ phusati, ummādaṃ vā pāpuṇāti cittakkhepaṃ vā, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati – yo so, bhikkhave, bhikkhu akkosako paribhāsako ariyūpavādo sabrahmacārīnaṃ, ṭhānametaṃ avakāso yaṃ so imesaṃ ekādasannaṃ byasanānaṃ aññataraṃ byasanaṃ nigaccheyya. [( ) etthantare pāṭho sī. syā. kaṃ. pī. potthakesu na dissati] ‘‘Yo so, bhikkhave, bhikkhu akkosako paribhāsako ariyūpavādo sabrahmacārīnaṃ, aṭṭhānametaṃ anavakāso yaṃ so ekādasannaṃ byasanānaṃ aññataraṃ byasanaṃ na nigaccheyya. Katamesaṃ ekādasannaṃ? Anadhigataṃ nādhigacchati, adhigatā parihāyati, saddhammassa na vodāyanti, saddhammesu vā adhimāniko hoti, anabhirato vā brahmacariyaṃ carati, aññataraṃ vā saṃkiliṭṭhaṃ āpattiṃ āpajjati, sikkhaṃ vā paccakkhāya hīnāyāvattati, gāḷhaṃ vā rogātaṅkaṃ phusati, ummādaṃ vā pāpuṇāti cittakkhepaṃ vā, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati – yo so, bhikkhave, bhikkhu akkosako paribhāsako ariyūpavādo sabrahmacārīnaṃ, aṭṭhānametaṃ anavakāso yaṃ so imesaṃ ekādasannaṃ byasanānaṃ aññataraṃ byasanaṃ na nigaccheyyā’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, it is certainly possible and to be expected that a monk who is abusive and reviling, and who disparages the Noble Ones among his fellow practitioners of the holy life, will meet with one of eleven misfortunes. Which eleven? He does not attain what he has not yet attained; he declines from what he has already attained; his insight into the True Dhamma does not become clear; or he becomes conceited regarding the True Dhamma; or he lives the holy life discontentedly; or he commits some defiling offense; or, having renounced the training, he returns to a lower state; or he contracts a severe disease; or he falls into madness or mental derangement; he dies utterly deluded; or, upon the dissolution of the body, after death, he reappears in a state of woe, a bad destination, a place of ruin, in hell. Bhikkhus, it is certainly possible and to be expected that a monk who is abusive and reviling, and who disparages the Noble Ones among his fellow practitioners of the holy life, will meet with one of these eleven misfortunes.\n\nBhikkhus, it is certainly impossible and not to be expected that a monk who is abusive and reviling, and who disparages the Noble Ones among his fellow practitioners of the holy life, would not meet with one of eleven misfortunes. Which eleven? He does not attain what he has not yet attained; he declines from what he has already attained; his insight into the True Dhamma does not become clear; or he becomes conceited regarding the True Dhamma; or he lives the holy life discontentedly; or he commits some defiling offense; or, having renounced the training, he returns to a lower state; or he contracts a severe disease; or he falls into madness or mental derangement; he dies utterly deluded; or, upon the dissolution of the body, after death, he reappears in a state of woe, a bad destination, a place of ruin, in hell. Bhikkhus, it is certainly impossible and not to be expected that a monk who is abusive and reviling, and who disparages the Noble Ones among his fellow practitioners of the holy life, would not meet with one of these eleven misfortunes.",
      "sinhala": "භික්ෂූනි, යම් භික්ෂුවක් අන් අයට අපහාස කරන, නින්දා කරන, එකම බ්‍රහ්මචර්යාවේ යෙදෙන ආර්යයන්ට චෝදනා කරන කෙනෙක් වේද, ඔහු එකොළොස් විපතක් අතුරින් යම්කිසි විපතකට පත්වීමට ඉඩ ඇත, මෙය හේතුවකි. ඒ එකොළොස කුමක්ද? තමා විසින් නොලැබූ (අධිගම) නොලැබීම, තමා විසින් ලැබූ (අධිගම) නැති වී යාම, සද‍්ධර්මයට ඔහුගේ සිත පහදා නොගැනීම, නැතහොත් සද‍්ධර්මය පිළිබඳව අධිමානයෙන් යුක්ත වීම, නැතහොත් බ්‍රහ‍්මචාරීව විසීමට නොකැමැති වීම, නැතහොත් යම්කිසි කිලිටි වූ ආපත්තියකට පත්වීම, නැතහොත් ශික්‍ෂාව අත්හැර හීන තත්වයකට පත්වීම, නැතහොත් දරුණු රෝගාබාධයකින් පෙළීම, උන‍්මත්තක භාවයට පත්වීම හෝ සිහි විකල් වීම, සිහිමුළාවෙන් මරණයට පත්වීම, කය බිඳී මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපත ලැබීම – භික්ෂූනි, යම් භික්ෂුවක් අන් අයට අපහාස කරන, නින්දා කරන, එකම බ්‍රහ්මචර්යාවේ යෙදෙන ආර්යයන්ට චෝදනා කරන කෙනෙක් වේද, ඔහු මෙම එකොළොස් විපතක් අතුරින් යම්කිසි විපතකට පත්වීමට ඉඩ ඇත, මෙය හේතුවකි.\n\nභික්ෂූනි, යම් භික්ෂුවක් අන් අයට අපහාස කරන, නින්දා කරන, එකම බ්‍රහ්මචර්යාවේ යෙදෙන ආර්යයන්ට චෝදනා කරන කෙනෙක් වේද, ඔහු එකොළොස් විපතක් අතුරින් යම්කිසි විපතකට පත් නොවීම සිදුවීමට හේතුවක් නැත, මෙයට ඉඩක් නැත. ඒ එකොළොස කුමක්ද? තමා විසින් නොලැබූ (අධිගම) නොලැබීම, තමා විසින් ලැබූ (අධිගම) නැති වී යාම, සද‍්ධර්මයට ඔහුගේ සිත පහදා නොගැනීම, නැතහොත් සද‍්ධර්මය පිළිබඳව අධිමානයෙන් යුක්ත වීම, නැතහොත් බ්‍රහ‍්මචාරීව විසීමට නොකැමැති වීම, නැතහොත් යම්කිසි කිලිටි වූ ආපත්තියකට පත්වීම, නැතහොත් ශික්‍ෂාව අත්හැර හීන තත්වයකට පත්වීම, නැතහොත් දරුණු රෝගාබාධයකින් පෙළීම, උන‍්මත්තක භාවයට පත්වීම හෝ සිහි විකල් වීම, සිහිමුළාවෙන් මරණයට පත්වීම, කය බිඳී මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපත ලැබීම – භික්ෂූනි, යම් භික්ෂුවක් අන් අයට අපහාස කරන, නින්දා කරන, එකම බ්‍රහ්මචර්යාවේ යෙදෙන ආර්යයන්ට චෝදනා කරන කෙනෙක් වේද, ඔහු මෙම එකොළොස් විපතක් අතුරින් යම්කිසි විපතකට පත් නොවීම සිදුවීමට හේතුවක් නැත, මෙයට ඉඩක් නැත.",
      "paliTitle": "Byasanasuttaṃ",
      "englishTitle": "Discourse on Misfortunes",
      "sinhalaTitle": "ව්‍යසන සූත්‍රය"
    },
    {
      "number": 7,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Siyā nu kho, bhante, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa; saññī ca pana assāti? ‘‘Siyā, ānanda, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa; saññī ca pana assā’’ti. ‘‘Yathā kathaṃ pana, bhante, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa, saññī ca pana assāti. ‘‘Idhānanda, bhikkhu evaṃsaññī hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, ānanda, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa, saññī ca pana assā’’ti. Atha kho āyasmā ānando bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Siyā nu kho, āvuso sāriputta, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa, saññī pana assāti. ‘‘Siyā, āvuso ānanda, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa, saññī ca pana assā’’ti. ‘‘Yathā kathaṃ panāvuso sāriputta, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa, saññī ca pana assā’’ti? ‘‘Idha, āvuso ānanda, bhikkhu evaṃsaññī hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, āvuso ānanda, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa… pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi na saññī assa, saññī ca pana assā’’ti. ‘‘Acchariyaṃ, āvuso, abbhutaṃ, āvuso! Yatra hi nāma satthu ceva sāvakassa ca atthena attho byañjanena byañjanaṃ saṃsandissati samessati na viggayhissati, yadidaṃ aggapadasmiṃ! Idānāhaṃ, āvuso, bhagavantaṃ upasaṅkamitvā etamatthaṃ apucchiṃ. Bhagavāpi me etehi akkharehi etehi padehi etehi byañjanehi etamatthaṃ byākāsi, seyyathāpi āyasmā sāriputto. Acchariyaṃ, āvuso, abbhutaṃ, āvuso, yatra hi nāma satthu ceva sāvakassa ca atthena attho byañjanena byañjanaṃ saṃsandissati samessati na viggayhissati, yadidaṃ aggapadasmi’’nti! Sattamaṃ.",
      "english": "Then the Venerable Ānanda approached the Blessed One. Having approached, he saluted the Blessed One and sat down to one side. Sitting to one side, the Venerable Ānanda said to the Blessed One: \"Venerable Sir, is it possible for a bhikkhu to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, or mentally explored, he would not perceive that, and yet he would still be endowed with perception?\"\n\n\"It is possible, Ānanda, for a bhikkhu to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, or mentally explored, he would not perceive that, and yet he would still be endowed with perception.\"\n\n\"But how, Venerable Sir, would a bhikkhu attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, or mentally explored, he would not perceive that, and yet he would still be endowed with perception?\"\n\n\"Here, Ānanda, a bhikkhu perceives thus: 'This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishment of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.' It is in this way, Ānanda, that a bhikkhu would attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, or mentally explored, he would not perceive that, and yet he would still be endowed with perception.\"\n\nThen the Venerable Ānanda, having delighted in and approved of the Blessed One’s words, rose from his seat, saluted the Blessed One, and circumambulated him clockwise, then approached the Venerable Sāriputta. Having approached, he exchanged greetings with the Venerable Sāriputta. After exchanging polite and amiable conversation, he sat down to one side.\n\nSitting to one side, the Venerable Ānanda said to the Venerable Sāriputta: \"Friend Sāriputta, is it possible for a bhikkhu to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, or mentally explored, he would not perceive that, and yet he would still be endowed with perception?\"\n\n\"It is possible, friend Ānanda, for a bhikkhu to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, or mentally explored, he would not perceive that, and yet he would still be endowed with perception.\"\n\n\"But how, friend Sāriputta, would a bhikkhu attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, or mentally explored, he would not perceive that, and yet he would still be endowed with perception?\"\n\n\"Here, friend Ānanda, a bhikkhu perceives thus: 'This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishment of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.'\"\n\nThus, friend Ānanda, a bhikkhu might attain such a state of concentration whereby he would not perceive earth as earth, and similarly for the other elements and formless attainments; and even for that which is seen, heard, sensed, cognized, attained, sought, and pondered by the mind, he would have no perception, yet he would still be perceiving. Wondrous, friend, amazing, friend! For where indeed the Teacher's meaning and the disciple's meaning are in perfect accord, and their expressions correspond perfectly, without any disagreement – this is truly the highest doctrine! Just now, friend, I approached the Blessed One and asked about this matter. And the Blessed One also explained this matter to me with these very letters, these very words, these very expressions, just as Venerable Sāriputta did. Wondrous, friend, amazing, friend! For where indeed the Teacher's meaning and the disciple's meaning are in perfect accord, and their expressions correspond perfectly, without any disagreement – this is truly the highest doctrine!",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"ස්වාමීන් වහන්ස, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් ලැබිය හැකිද, යමක් නිසා ඔහු පඨවි ධාතුවෙහි පඨවි සංඥාවක් නොපවත්වයිද, ආපෝ ධාතුවෙහි ආපෝ සංඥාවක් නොපවත්වයිද, තේජෝ ධාතුවෙහි තේජෝ සංඥාවක් නොපවත්වයිද, වායෝ ධාතුවෙහි වායෝ සංඥාවක් නොපවත්වයිද, ආකාශානන්ත්‍ය ආයතනයෙහි ආකාශානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, විඤ්ඤාණානන්ත්‍ය ආයතනයෙහි විඤ්ඤාණානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවක් නොපවත්වයිද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවක් නොපවත්වයිද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් නොපවත්වයිද, පරලෝකයෙහි පරලෝක සංඥාවක් නොපවත්වයිද, යම් දුටු, ඇසූ, විඳින ලද, විඤ්ඤාණයෙන් දැනගත්, ලැබූ, සොයාගත්, මනසින් විමසා බැලූ දෙයක් වේද, එහිද ඔහු සංඥාවක් නොපවත්වයිද? එහෙත්, සංඥා සහිතවම සිටියිද?\"\n\n\"ආනන්දය, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් ලැබිය හැකිය, යමක් නිසා ඔහු පඨවි ධාතුවෙහි පඨවි සංඥාවක් නොපවත්වයි, ආපෝ ධාතුවෙහි ආපෝ සංඥාවක් නොපවත්වයි, තේජෝ ධාතුවෙහි තේජෝ සංඥාවක් නොපවත්වයි, වායෝ ධාතුවෙහි වායෝ සංඥාවක් නොපවත්වයි, ආකාශානන්ත්‍ය ආයතනයෙහි ආකාශානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයි, විඤ්ඤාණානන්ත්‍ය ආයතනයෙහි විඤ්ඤාණානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයි, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවක් නොපවත්වයි, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවක් නොපවත්වයි, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් නොපවත්වයි, පරලෝකයෙහි පරලෝක සංඥාවක් නොපවත්වයි, යම් දුටු, ඇසූ, විඳින ලද, විඤ්ඤාණයෙන් දැනගත්, ලැබූ, සොයාගත්, මනසින් විමසා බැලූ දෙයක් වේද, එහිද ඔහු සංඥාවක් නොපවත්වයි; එහෙත්, සංඥා සහිතවම සිටියි.\"\n\n\"ස්වාමීන් වහන්ස, එසේනම් භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් ලැබිය හැක්කේ කෙසේද, යමක් නිසා ඔහු පඨවි ධාතුවෙහි පඨවි සංඥාවක් නොපවත්වයිද, ආපෝ ධාතුවෙහි ආපෝ සංඥාවක් නොපවත්වයිද, තේජෝ ධාතුවෙහි තේජෝ සංඥාවක් නොපවත්වයිද, වායෝ ධාතුවෙහි වායෝ සංඥාවක් නොපවත්වයිද, ආකාශානන්ත්‍ය ආයතනයෙහි ආකාශානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, විඤ්ඤාණානන්ත්‍ය ආයතනයෙහි විඤ්ඤාණානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවක් නොපවත්වයිද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවක් නොපවත්වයිද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් නොපවත්වයිද, පරලෝකයෙහි පරලෝක සංඥාවක් නොපවත්වයිද, යම් දුටු, ඇසූ, විඳින ලද, විඤ්ඤාණයෙන් දැනගත්, ලැබූ, සොයාගත්, මනසින් විමසා බැලූ දෙයක් වේද, එහිද ඔහු සංඥාවක් නොපවත්වයිද? එහෙත්, සංඥා සහිතවම සිටියිද?\"\n\n\"ආනන්දය, මෙහිලා භික්ෂුව මෙසේ සංඥා පවත්වයි – 'මෙය ශාන්තය, මෙය ප්‍රණීතය, එනම් සියලු සංස්කාරයන්ගේ සංසිඳීමය, සියලු උපධීන් අත්හැරීමය, තණ්හාව ක්ෂය කිරීමය, විරාගයය, නිරෝධයය, නිබ්බානයය' යනුවෙනි. ආනන්දය, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් ලැබිය හැක්කේ මෙලෙසිනි, යමක් නිසා ඔහු පඨවි ධාතුවෙහි පඨවි සංඥාවක් නොපවත්වයි, ආපෝ ධාතුවෙහි ආපෝ සංඥාවක් නොපවත්වයි, තේජෝ ධාතුවෙහි තේජෝ සංඥාවක් නොපවත්වයි, වායෝ ධාතුවෙහි වායෝ සංඥාවක් නොපවත්වයි, ආකාශානන්ත්‍ය ආයතනයෙහි ආකාශානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයි, විඤ්ඤාණානන්ත්‍ය ආයතනයෙහි විඤ්ඤාණානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයි, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවක් නොපවත්වයි, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවක් නොපවත්වයි, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් නොපවත්වයි, පරලෝකයෙහි පරලෝක සංඥාවක් නොපවත්වයි, යම් දුටු, ඇසූ, විඳින ලද, විඤ්ඤාණයෙන් දැනගත්, ලැබූ, සොයාගත්, මනසින් විමසා බැලූ දෙයක් වේද, එහිද ඔහු සංඥාවක් නොපවත්වයි; එහෙත්, සංඥා සහිතවම සිටියි.\"\n\nඑවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේගේ වචනයට සතුටු වී, අනුමෝදන් වී, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කර, පැදකුණු කොට, ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ වෙත එළඹියහ; එළඹ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ සමඟ ප්‍රීති ප්‍රමෝදයෙන් කතා කළහ. ප්‍රීති ප්‍රමෝදයට කරුණුවූ, සිහි කටයුතු වූ කතා බහ නිමවා එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: \"ඇවැත් සාරිපුත්තය, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් ලැබිය හැකිද, යමක් නිසා ඔහු පඨවි ධාතුවෙහි පඨවි සංඥාවක් නොපවත්වයිද, ආපෝ ධාතුවෙහි ආපෝ සංඥාවක් නොපවත්වයිද, තේජෝ ධාතුවෙහි තේජෝ සංඥාවක් නොපවත්වයිද, වායෝ ධාතුවෙහි වායෝ සංඥාවක් නොපවත්වයිද, ආකාශානන්ත්‍ය ආයතනයෙහි ආකාශානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, විඤ්ඤාණානන්ත්‍ය ආයතනයෙහි විඤ්ඤාණානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවක් නොපවත්වයිද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවක් නොපවත්වයිද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් නොපවත්වයිද, පරලෝකයෙහි පරලෝක සංඥාවක් නොපවත්වයිද, යම් දුටු, ඇසූ, විඳින ලද, විඤ්ඤාණයෙන් දැනගත්, ලැබූ, සොයාගත්, මනසින් විමසා බැලූ දෙයක් වේද, එහිද ඔහු සංඥාවක් නොපවත්වයිද? එහෙත්, සංඥා සහිතවම සිටියිද?\"\n\n\"ඇවැත් ආනන්දය, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් ලැබිය හැකිය, යමක් නිසා ඔහු පඨවි ධාතුවෙහි පඨවි සංඥාවක් නොපවත්වයි, ආපෝ ධාතුවෙහි ආපෝ සංඥාවක් නොපවත්වයි, තේජෝ ධාතුවෙහි තේජෝ සංඥාවක් නොපවත්වයි, වායෝ ධාතුවෙහි වායෝ සංඥාවක් නොපවත්වයි, ආකාශානන්ත්‍ය ආයතනයෙහි ආකාශානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයි, විඤ්ඤාණානන්ත්‍ය ආයතනයෙහි විඤ්ඤාණානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයි, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවක් නොපවත්වයි, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවක් නොපවත්වයි, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් නොපවත්වයි, පරලෝකයෙහි පරලෝක සංඥාවක් නොපවත්වයි, යම් දුටු, ඇසූ, විඳින ලද, විඤ්ඤාණයෙන් දැනගත්, ලැබූ, සොයාගත්, මනසින් විමසා බැලූ දෙයක් වේද, එහිද ඔහු සංඥාවක් නොපවත්වයි; එහෙත්, සංඥා සහිතවම සිටියි.\"\n\n\"එසේනම් ඇවැත් සාරිපුත්තය, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් ලැබිය හැක්කේ කෙසේද, යමක් නිසා ඔහු පඨවි ධාතුවෙහි පඨවි සංඥාවක් නොපවත්වයිද, ආපෝ ධාතුවෙහි ආපෝ සංඥාවක් නොපවත්වයිද, තේජෝ ධාතුවෙහි තේජෝ සංඥාවක් නොපවත්වයිද, වායෝ ධාතුවෙහි වායෝ සංඥාවක් නොපවත්වයිද, ආකාශානන්ත්‍ය ආයතනයෙහි ආකාශානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, විඤ්ඤාණානන්ත්‍ය ආයතනයෙහි විඤ්ඤාණානන්ත්‍ය ආයතන සංඥාවක් නොපවත්වයිද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවක් නොපවත්වයිද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවක් නොපවත්වයිද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් නොපවත්වයිද, පරලෝකයෙහි පරලෝක සංඥාවක් නොපවත්වයිද, යම් දුටු, ඇසූ, විඳින ලද, විඤ්ඤාණයෙන් දැනගත්, ලැබූ, සොයාගත්, මනසින් විමසා බැලූ දෙයක් වේද, එහිද ඔහු සංඥාවක් නොපවත්වයිද? එහෙත්, සංඥා සහිතවම සිටියිද?\"\n\n\"ඇවැත් ආනන්දය, මෙහිලා භික්ෂුව මෙසේ සංඥා පවත්වයි – 'මෙය ශාන්තය, මෙය ප්‍රණීතය, එනම් සියලු සංස්කාරයන්ගේ සංසිඳීමය, සියලු උපධීන් අත්හැරීමය, තණ්හාව ක්ෂය කිරීමය, විරාගයය, නිරෝධයය, නිබ්බානයය' යනුවෙනි.\"\n\nආනන්ද ආයුෂ්මතුනි, යම් භික්ෂුවක් පෘථිවියෙහි පෘථිවි සංඥාවක් ඇති කර නොගන්නා සේත්, ...යමක් දක්නා ලද, අසන ලද, අත්විඳින ලද, විඤ්ඤාණයෙන් දැනගන්නා ලද, ලබන ලද, සොයන ලද, සිතින් විමසන ලදද, ඒ කිසිවක හෝ සංඥාවක් ඇති කර නොගන්නා සේත්, එහෙත් සංඥාවක් ඇතිව සිටීද, එබඳු සමාධියක් ලබාගත හැකි වෙයි.\n\nආයුෂ්මතුනි, පුදුමයකි! ආයුෂ්මතුනි, ආශ්චර්යයකි! යම් තැනක ශාස්තෘන් වහන්සේගේද, ශ්‍රාවකයාගේද අර්ථය, අර්ථයට සමපාත වෙයිද, ව්‍යඤ්ජනය, ව්‍යඤ්ජනයට සමපාත වෙයිද, විරුද්ධ නොවේද, ඒ මේ අග්‍ර පදය පිළිබඳවයි. ආයුෂ්මතුනි, මම දැන් භාග්‍යවතුන් වහන්සේ වෙත එළඹ මේ කරුණ ඇසුවෙමි. භාග්‍යවතුන් වහන්සේද මට මේ අක්ෂරවලින්, මේ පදවලින්, මේ ව්‍යඤ්ජනවලින්ම මේ කරුණ පැහැදිලි කළ සේක; යම් සේ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ (පැහැදිලි කළ සේක්ද) එසේමය. ආයුෂ්මතුනි, පුදුමයකි! ආයුෂ්මතුනි, ආශ්චර්යයකි! යම් තැනක ශාස්තෘන් වහන්සේගේද, ශ්‍රාවකයාගේද අර්ථය, අර්ථයට සමපාත වෙයිද, ව්‍යඤ්ජනය, ව්‍යඤ්ජනයට සමපාත වෙයිද, විරුද්ධ නොවේද, ඒ මේ අග්‍ර පදය පිළිබඳවයි!",
      "paliTitle": "Saññāsuttaṃ",
      "englishTitle": "Discourse on Perception",
      "sinhalaTitle": "සඤ්ඤා සූත්‍රය"
    },
    {
      "number": 8,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Siyā nu kho, bhante, bhikkhuno tathārūpo samādhipaṭilābho yathā na cakkhuṃ manasi kareyya, na rūpaṃ manasi kareyya, na sotaṃ manasi kareyya, na saddaṃ manasi kareyya, na ghānaṃ manasi kareyya, na gandhaṃ manasi kareyya, na jivhaṃ manasi kareyya, na rasaṃ manasi kareyya, na kāyaṃ manasi kareyya, na phoṭṭhabbaṃ manasi kareyya, na pathaviṃ manasi kareyya, na āpaṃ manasi kareyya, na tejaṃ manasi kareyya, na vāyaṃ manasi kareyya, na ākāsānañcāyatanaṃ manasi kareyya, na viññāṇañcāyatanaṃ manasi kareyya, na ākiñcaññāyatanaṃ manasi kareyya, na nevasaññānāsaññāyatanaṃ manasi kareyya, na idhalokaṃ manasi kareyya, na paralokaṃ manasi kareyya, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi na manasi kareyya; manasi ca pana kareyyā’’ti? ‘‘Siyā, ānanda, bhikkhuno tathārūpo samādhipaṭilābho yathā na cakkhuṃ manasi kareyya, na rūpaṃ manasi kareyya, na sotaṃ manasi kareyya, na saddaṃ manasi kareyya, na ghānaṃ manasi kareyya, na gandhaṃ manasi kareyya, na jivhaṃ manasi kareyya, na rasaṃ manasi kareyya, na kāyaṃ manasi kareyya, na phoṭṭhabbaṃ manasi kareyya, na pathaviṃ manasi kareyya, na āpaṃ manasi kareyya, na tejaṃ manasi kareyya, na vāyaṃ manasi kareyya, na ākāsānañcāyatanaṃ manasi kareyya, na viññāṇañcāyatanaṃ manasi kareyya, na ākiñcaññāyatanaṃ manasi kareyya, na nevasaññānāsaññāyatanaṃ manasi kareyya, na idhalokaṃ manasi kareyya, na paralokaṃ manasi kareyya, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi na manasi kareyya; manasi ca pana kareyyā’’ti. ‘‘Yathā kathaṃ pana, bhante, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā na cakkhuṃ manasi kareyya, na rūpaṃ manasi kareyya… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi na manasi kareyya; manasi ca pana kareyyā’’ti? ‘‘Idhānanda, bhikkhu evaṃ manasi karoti – ‘etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, ānanda, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā na cakkhuṃ manasi kareyya, na rūpaṃ manasi kareyya…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi na manasi kareyya; manasi ca pana kareyyā’’ti. Aṭṭhamaṃ.",
      "english": "Then Venerable Ananda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side.\n\nSeated to one side, Venerable Ananda said to the Blessed One: \"Is it possible, Venerable Sir, for a monk to attain such a state of meditative concentration that he would not advert to the eye, would not advert to forms, would not advert to the ear, would not advert to sounds, would not advert to the nose, would not advert to odors, would not advert to the tongue, would not advert to tastes, would not advert to the body, would not advert to tactile objects, would not advert to the earth element, would not advert to the water element, would not advert to the fire element, would not advert to the wind element, would not advert to the dimension of infinite space, would not advert to the dimension of infinite consciousness, would not advert to the dimension of nothingness, would not advert to the dimension of neither perception nor non-perception, would not advert to this world, would not advert to the other world, and even that which is seen, heard, sensed, cognized, attained, searched into, and considered by the mind—he would not advert to that, yet he would still be adverting to something?\"\n\n\"Yes, Ananda, it is possible for a monk to attain such a state of meditative concentration that he would not advert to the eye, would not advert to forms, would not advert to the ear, would not advert to sounds, would not advert to the nose, would not advert to odors, would not advert to the tongue, would not advert to tastes, would not advert to the body, would not advert to tactile objects, would not advert to the earth element, would not advert to the water element, would not advert to the fire element, would not advert to the wind element, would not advert to the dimension of infinite space, would not advert to the dimension of infinite consciousness, would not advert to the dimension of nothingness, would not advert to the dimension of neither perception nor non-perception, would not advert to this world, would not advert to the other world, and even that which is seen, heard, sensed, cognized, attained, searched into, and considered by the mind—he would not advert to that, yet he would still be adverting to something.\"\n\n\"But how, Venerable Sir, is it possible for a monk to attain such a state of meditative concentration that he would not advert to the eye, would not advert to forms, would not advert to the ear, would not advert to sounds, would not advert to the nose, would not advert to odors, would not advert to the tongue, would not advert to tastes, would not advert to the body, would not advert to tactile objects, would not advert to the earth element, would not advert to the water element, would not advert to the fire element, would not advert to the wind element, would not advert to the dimension of infinite space, would not advert to the dimension of infinite consciousness, would not advert to the dimension of nothingness, would not advert to the dimension of neither perception nor non-perception, would not advert to this world, would not advert to the other world, and even that which is seen, heard, sensed, cognized, attained, searched into, and considered by the mind—he would not advert to that, yet he would still be adverting to something?\"\n\n\"Here, Ananda, a monk adverts to this: 'This is peaceful, this is sublime—namely, the stilling of all formations, the relinquishing of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.' It is in this way, Ananda, that a monk attains such a state of meditative concentration that he would not advert to the eye, would not advert to forms, would not advert to the ear, would not advert to sounds, would not advert to the nose, would not advert to odors, would not advert to the tongue, would not advert to tastes, would not advert to the body, would not advert to tactile objects, would not advert to the earth element, would not advert to the water element, would not advert to the fire element, would not advert to the wind element, would not advert to the dimension of infinite space, would not advert to the dimension of infinite consciousness, would not advert to the dimension of nothingness, would not advert to the dimension of neither perception nor non-perception, would not advert to this world, would not advert to the other world, and even that which is seen, heard, sensed, cognized, attained, searched into, and considered by the mind—he would not advert to that, yet he would still be adverting to something.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද තෙරුන් භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – \"වහන්ස, භික්ෂුවකට මෙබඳු සමාධි ලාභයක් ඇති විය හැකිද, යම් සමාධියකින් ඔහු ඇසට මනසිකාරය නොකරන්නේද, රූපයන්ට මනසිකාරය නොකරන්නේද, කනට මනසිකාරය නොකරන්නේද, ශබ්දයන්ට මනසිකාරය නොකරන්නේද, නාසයට මනසිකාරය නොකරන්නේද, ගන්ධයන්ට මනසිකාරය නොකරන්නේද, දිවට මනසිකාරය නොකරන්නේද, රසයන්ට මනසිකාරය නොකරන්නේද, කයට මනසිකාරය නොකරන්නේද, ස්පර්ශයන්ට මනසිකාරය නොකරන්නේද, පඨවි ධාතුවට මනසිකාරය නොකරන්නේද, ආපෝ ධාතුවට මනසිකාරය නොකරන්නේද, තේජෝ ධාතුවට මනසිකාරය නොකරන්නේද, වායෝ ධාතුවට මනසිකාරය නොකරන්නේද, ආකාශානඤ්චායතනයට මනසිකාරය නොකරන්නේද, විඤ්ඤාණඤ්චායතනයට මනසිකාරය නොකරන්නේද, ආකිඤ්චඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, මේ ලොවට මනසිකාරය නොකරන්නේද, පරලොවට මනසිකාරය නොකරන්නේද, යමක් මේ දැක ඇසී, අසා, දැන, විඳ, ලබා, සොයා, මනසින් විමසා බලා ඇත්ද, එයටද මනසිකාරය නොකරන්නේද? එහෙත් යම්කිසිවකට මනසිකාරය කරන්නේද?\"\n\n\"ආනන්දය, භික්ෂුවකට මෙබඳු සමාධි ලාභයක් ඇති විය හැක. යම් සමාධියකින් ඔහු ඇසට මනසිකාරය නොකරන්නේද, රූපයන්ට මනසිකාරය නොකරන්නේද, කනට මනසිකාරය නොකරන්නේද, ශබ්දයන්ට මනසිකාරය නොකරන්නේද, නාසයට මනසිකාරය නොකරන්නේද, ගන්ධයන්ට මනසිකාරය නොකරන්නේද, දිවට මනසිකාරය නොකරන්නේද, රසයන්ට මනසිකාරය නොකරන්නේද, කයට මනසිකාරය නොකරන්නේද, ස්පර්ශයන්ට මනසිකාරය නොකරන්නේද, පඨවි ධාතුවට මනසිකාරය නොකරන්නේද, ආපෝ ධාතුවට මනසිකාරය නොකරන්නේද, තේජෝ ධාතුවට මනසිකාරය නොකරන්නේද, වායෝ ධාතුවට මනසිකාරය නොකරන්නේද, ආකාශානඤ්චායතනයට මනසිකාරය නොකරන්නේද, විඤ්ඤාණඤ්චායතනයට මනසිකාරය නොකරන්නේද, ආකිඤ්චඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, මේ ලොවට මනසිකාරය නොකරන්නේද, පරලොවට මනසිකාරය නොකරන්නේද, යමක් මේ දැක ඇසී, අසා, දැන, විඳ, ලබා, සොයා, මනසින් විමසා බලා ඇත්ද, එයටද මනසිකාරය නොකරන්නේද? එහෙත් යම්කිසිවකට මනසිකාරය කරන්නේය.\"\n\n\"එසේනම් වහන්ස, භික්ෂුවකට මෙබඳු සමාධි ලාභයක් ඇති විය හැක්කේ කෙසේද, යම් සමාධියකින් ඔහු ඇසට මනසිකාරය නොකරන්නේද, රූපයන්ට මනසිකාරය නොකරන්නේද, කනට මනසිකාරය නොකරන්නේද, ශබ්දයන්ට මනසිකාරය නොකරන්නේද, නාසයට මනසිකාරය නොකරන්නේද, ගන්ධයන්ට මනසිකාරය නොකරන්නේද, දිවට මනසිකාරය නොකරන්නේද, රසයන්ට මනසිකාරය නොකරන්නේද, කයට මනසිකාරය නොකරන්නේද, ස්පර්ශයන්ට මනසිකාරය නොකරන්නේද, පඨවි ධාතුවට මනසිකාරය නොකරන්නේද, ආපෝ ධාතුවට මනසිකාරය නොකරන්නේද, තේජෝ ධාතුවට මනසිකාරය නොකරන්නේද, වායෝ ධාතුවට මනසිකාරය නොකරන්නේද, ආකාශානඤ්චායතනයට මනසිකාරය නොකරන්නේද, විඤ්ඤාණඤ්චායතනයට මනසිකාරය නොකරන්නේද, ආකිඤ්චඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, මේ ලොවට මනසිකාරය නොකරන්නේද, පරලොවට මනසිකාරය නොකරන්නේද, යමක් මේ දැක ඇසී, අසා, දැන, විඳ, ලබා, සොයා, මනසින් විමසා බලා ඇත්ද, එයටද මනසිකාරය නොකරන්නේද? එහෙත් යම්කිසිවකට මනසිකාරය කරන්නේද?\"\n\n\"ආනන්දය, මේ ශාසනයෙහි භික්ෂුව මෙසේ මනසිකාරය කරයි – 'සියලු සංස්කාරයන්ගේ සංසිඳීමද, සියලු උපාධීන් අත්හැරීමද, තෘෂ්ණාව ක්ෂය කිරීමද, විරාගයද, නිරෝධයද, එනම් නිවනද යන මෙය ශාන්තය, මෙය ප්‍රණීතය'යි. ආනන්දය, භික්ෂුවකට මෙබඳු සමාධි ලාභයක් ඇති විය හැක්කේ මෙසේය, යම් සමාධියකින් ඔහු ඇසට මනසිකාරය නොකරන්නේද, රූපයන්ට මනසිකාරය නොකරන්නේද, කනට මනසිකාරය නොකරන්නේද, ශබ්දයන්ට මනසිකාරය නොකරන්නේද, නාසයට මනසිකාරය නොකරන්නේද, ගන්ධයන්ට මනසිකාරය නොකරන්නේද, දිවට මනසිකාරය නොකරන්නේද, රසයන්ට මනසිකාරය නොකරන්නේද, කයට මනසිකාරය නොකරන්නේද, ස්පර්ශයන්ට මනසිකාරය නොකරන්නේද, පඨවි ධාතුවට මනසිකාරය නොකරන්නේද, ආපෝ ධාතුවට මනසිකාරය නොකරන්නේද, තේජෝ ධාතුවට මනසිකාරය නොකරන්නේද, වායෝ ධාතුවට මනසිකාරය නොකරන්නේද, ආකාශානඤ්චායතනයට මනසිකාරය නොකරන්නේද, විඤ්ඤාණඤ්චායතනයට මනසිකාරය නොකරන්නේද, ආකිඤ්චඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයට මනසිකාරය නොකරන්නේද, මේ ලොවට මනසිකාරය නොකරන්නේද, පරලොවට මනසිකාරය නොකරන්නේද, යමක් මේ දැක ඇසී, අසා, දැන, විඳ, ලබා, සොයා, මනසින් විමසා බලා ඇත්ද, එයටද මනසිකාරය නොකරන්නේද? එහෙත් යම්කිසිවකට මනසිකාරය කරන්නේය.",
      "paliTitle": "Manasikārasuttaṃ",
      "englishTitle": "The Discourse on Attention",
      "sinhalaTitle": "මනසිකාර සූත්‍රය"
    },
    {
      "number": 9,
      "pali": "Ekaṃ samayaṃ bhagavā nātike viharati giñjakāvasathe. Atha kho āyasmā saddho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ saddhaṃ bhagavā etadavoca – ‘‘Ājānīyajhāyitaṃ kho, saddha, jhāya; mā khaḷuṅkajhāyitaṃ [ājānīyajjhāyitaṃ kho saddha jhāyatha, mā khaḷuṅkajjhāyitaṃ (sī. pī.)]. Kathañca, khaḷuṅkajhāyitaṃ hoti? Assakhaḷuṅko hi, saddha, doṇiyā baddho [bandho (syā. ka.)] ‘yavasaṃ yavasa’nti jhāyati. Taṃ kissa hetu? Na hi, saddha, assakhaḷuṅkassa doṇiyā baddhassa evaṃ hoti – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ [kammassāhaṃ (ka.)] paṭikaromī’ti. So doṇiyā baddho ‘yavasaṃ yavasa’nti jhāyati. Evamevaṃ kho, saddha, idhekacco purisakhaḷuṅko araññagatopi rukkhamūlagatopi suññāgāragatopi kāmarāgapariyuṭṭhitena cetasā viharati kāmarāgaparetena uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ nappajānāti. So kāmarāgaṃyeva antaraṃ katvā jhāyati pajjhāyati nijjhāyati avajjhāyati, byāpādapariyuṭṭhitena cetasā viharati… thinamiddhapariyuṭṭhitena cetasā viharati… uddhaccakukkuccapariyuṭṭhitena cetasā viharati… vicikicchāpariyuṭṭhitena cetasā viharati vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ nappajānāti. So vicikicchaṃyeva antaraṃ katvā jhāyati pajjhāyati nijjhāyati avajjhāyati. So pathavimpi nissāya jhāyati, āpampi nissāya jhāyati, tejampi nissāya jhāyati, vāyampi nissāya jhāyati, ākāsānañcāyatanampi nissāya jhāyati, viññāṇañcāyatanampi nissāya jhāyati, ākiñcaññāyatanampi nissāya jhāyati, nevasaññānāsaññāyatanampi nissāya jhāyati, idhalokampi nissāya jhāyati, paralokampi nissāya jhāyati, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi nissāya jhāyati. Evaṃ kho, saddha, purisakhaḷuṅkajhāyitaṃ hoti. ‘‘Kathañca, saddha, ājānīyajhāyitaṃ hoti? Bhadro hi, saddha, assājānīyo doṇiyā baddho na ‘yavasaṃ yavasa’nti jhāyati. Taṃ kissa hetu? Bhadrassa hi, saddha, assājānīyassa doṇiyā baddhassa evaṃ hoti – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti. So doṇiyā baddho na ‘yavasaṃ yavasa’nti jhāyati. Bhadro hi, saddha, assājānīyo yathā iṇaṃ yathā bandhaṃ yathā jāniṃ yathā kaliṃ evaṃ patodassa ajjhoharaṇaṃ samanupassati. Evamevaṃ kho, saddha, bhadro purisājānīyo araññagatopi rukkhamūlagatopi suññāgāragatopi na kāmarāgapariyuṭṭhitena cetasā viharati na kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ pajānāti, na byāpādapariyuṭṭhitena cetasā viharati… na thinamiddhapariyuṭṭhitena cetasā viharati… na uddhaccakukkuccapariyuṭṭhitena cetasā viharati… na vicikicchāpariyuṭṭhitena cetasā viharati na vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ pajānāti. So neva pathaviṃ nissāya jhāyati, na āpaṃ nissāya jhāyati, na tejaṃ nissāya jhāyati, na vāyaṃ nissāya jhāyati, na ākāsānañcāyatanaṃ nissāya jhāyati, na viññāṇañcāyatanaṃ nissāya jhāyati, na ākiñcaññāyatanaṃ nissāya jhāyati, na nevasaññānāsaññāyatanaṃ nissāya jhāyati, na idhalokaṃ nissāya jhāyati, na paralokaṃ nissāya jhāyati, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi nissāya na jhāyati; jhāyati ca pana. Evaṃ jhāyiñca pana, saddha, bhadraṃ purisājānīyaṃ saindā devā sabrahmakā sapajāpatikā ārakāva namassanti – ‘‘Namo te purisājañña, namo te purisuttama; Yassa te nābhijānāma, yampi nissāya jhāyasī’’ti. Evaṃ vutte āyasmā saddho bhagavantaṃ etadavoca – ‘‘kathaṃ jhāyī pana, bhante, bhadro purisājānīyo [purisājānīyo jhāyati, so (sī. syā. pī.), purisājānīyo, so (ka.)] neva pathaviṃ nissāya jhāyati, na āpaṃ nissāya jhāyati, na tejaṃ nissāya jhāyati, na vāyaṃ nissāya jhāyati, na ākāsānañcāyatanaṃ nissāya jhāyati, na viññāṇañcāyatanaṃ nissāya jhāyati, na ākiñcaññāyatanaṃ nissāya jhāyati, na nevasaññānāsaññāyatanaṃ nissāya jhāyati, na idhalokaṃ nissāya jhāyati, na paralokaṃ nissāya jhāyati, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi nissāya na jhāyati; jhāyati ca pana? Kathaṃ jhāyiñca pana, bhante, bhadraṃ purisājānīyaṃ saindā devā sabrahmakā sapajāpatikā ārakāva namassanti – ‘‘Namo te purisājañña, namo te purisuttama; Yassa te nābhijānāma, yampi nissāya jhāyasī’’ti. ‘‘Idha, saddha, bhadrassa purisājānīyassa pathaviyaṃ pathavisaññā vibhūtā hoti, āpasmiṃ āposaññā vibhūtā hoti, tejasmiṃ tejosaññā vibhūtā hoti, vāyasmiṃ vāyosaññā vibhūtā hoti, ākāsānañcāyatane ākāsānañcāyatanasaññā vibhūtā hoti, viññāṇañcāyatane viññāṇañcāyatanasaññā vibhūtā hoti, ākiñcaññāyatane ākiñcaññāyatanasaññā vibhūtā hoti, nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññā vibhūtā hoti, idhaloke idhalokasaññā vibhūtā hoti, paraloke paralokasaññā vibhūtā hoti, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tatrāpi saññā vibhūtā hoti. Evaṃ jhāyī kho, saddha, bhadro purisājānīyo neva pathaviṃ nissāya jhāyati…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tampi nissāya na jhāyati; jhāyati ca pana. Evaṃ jhāyiñca pana, saddha, bhadraṃ purisājānīyaṃ saindā devā sabrahmakā sapajāpatikā ārakāva namassanti – ‘‘Namo te purisājañña, namo te purisuttama; Yassa te nābhijānāma, yampi nissāya jhāyasī’’ti. navamaṃ;",
      "english": "At one time, the Blessed One was staying in Nātika, in the Brick House. Then, the Venerable Saddha approached the Blessed One, paid homage to him, and sat down to one side. As the Venerable Saddha sat there to one side, the Blessed One said to him, “Saddha, meditate with the meditation of a noble steed, not with the meditation of a common hack.”\n\n“And how, Saddha, is there the meditation of a common hack? An ordinary horse, Saddha, tied to the manger, contemplates 'fodder, fodder.' Why is that? Because, Saddha, it does not occur to an ordinary horse tied to the manger: ‘What task will the horse-trainer make me perform today? How shall I respond to him?’ So, tied to the manger, it contemplates 'fodder, fodder.'\n\n“In the same way, Saddha, some common person, even if they have gone to the wilderness, to the root of a tree, or to an empty dwelling, dwells with a mind obsessed by sensual desire, overwhelmed by sensual desire, and does not truly understand the escape from arisen sensual desire. They fix their attention solely on sensual desire, pondering, deeply contemplating, intensely observing, and dwelling on it. They dwell with a mind obsessed by ill will... they dwell with a mind obsessed by sloth and torpor... they dwell with a mind obsessed by restlessness and remorse... they dwell with a mind obsessed by doubt, overwhelmed by doubt, and do not truly understand the escape from arisen doubt. They fix their attention solely on doubt, pondering, deeply contemplating, intensely observing, and dwelling on it. They meditate relying on earth, they meditate relying on water, they meditate relying on fire, they meditate relying on air. They meditate relying on the base of infinite space, they meditate relying on the base of infinite consciousness, they meditate relying on the base of nothingness, they meditate relying on the base of neither perception nor non-perception. They meditate relying on this world, they meditate relying on the other world. And whatever is seen, heard, sensed, cognized, attained, sought, and explored by the mind, they meditate relying on that too. This, Saddha, is how the meditation of a common person occurs.\n\n“And how, Saddha, is there the meditation of a noble steed? A noble horse, Saddha, tied to the manger, does not contemplate 'fodder, fodder.' Why is that? Because, Saddha, it occurs to a noble horse tied to the manger: ‘What task will the horse-trainer make me perform today? How shall I respond to him?’ So, tied to the manger, it does not contemplate 'fodder, fodder.' A noble horse, Saddha, regards the goad's piercing as if it were a debt, a bond, a loss, a stain.\n\n“In the same way, Saddha, a noble person, even if they have gone to the wilderness, to the root of a tree, or to an empty dwelling, does not dwell with a mind obsessed by sensual desire, nor overwhelmed by sensual desire, but truly understands the escape from arisen sensual desire. They do not dwell with a mind obsessed by ill will... they do not dwell with a mind obsessed by sloth and torpor... they do not dwell with a mind obsessed by restlessness and remorse... they do not dwell with a mind obsessed by doubt, nor overwhelmed by doubt, but truly understand the escape from arisen doubt. They do not meditate relying on earth, nor do they meditate relying on water, nor do they meditate relying on fire, nor do they meditate relying on air. They do not meditate relying on the base of infinite space, nor do they meditate relying on the base of infinite consciousness, nor do they meditate relying on the base of nothingness, nor do they meditate relying on the base of neither perception nor non-perception. They do not meditate relying on this world, nor do they meditate relying on the other world. And whatever is seen, heard, sensed, cognized, attained, sought, and explored by the mind, they do not meditate relying on that either; yet they do meditate. Indeed, Saddha, the gods, including Indra, Brahmā, and Prajāpati, pay homage from afar to such a noble person who meditates in this way, saying: ‘Homage to you, O noble person, homage to you, O supreme person! We do not comprehend by what you meditate.’\n\nWhen this was said, the Venerable Saddha said to the Blessed One, “How then, Venerable Sir, does a noble person meditate such that they do not meditate relying on earth, nor do they meditate relying on water, nor do they meditate relying on fire, nor do they meditate relying on air? They do not meditate relying on the base of infinite space, nor do they meditate relying on the base of infinite consciousness, nor do they meditate relying on the base of nothingness, nor do they meditate relying on the base of neither perception nor non-perception. They do not meditate relying on this world, nor do they meditate relying on the other world. And whatever is seen, heard, sensed, cognized, attained, sought, and explored by the mind, they do not meditate relying on that either; yet they do meditate?”\n\nHow, Venerable Sir, do the devas, including Sakka, Brahma, and Prajāpati, pay homage from afar to that noble thoroughbred meditator, saying: 'Homage to you, O noble person, homage to you, O supreme person! We do not comprehend your foundation, nor that upon which you meditate.'\n\nHere, friend, for a noble thoroughbred meditator, the perception of earth in earth is completely transcended; the perception of water in water is completely transcended; the perception of fire in fire is completely transcended; the perception of wind in wind is completely transcended; the perception of the dimension of infinite space in the dimension of infinite space is completely transcended; the perception of the dimension of infinite consciousness in the dimension of infinite consciousness is completely transcended; the perception of the dimension of nothingness in the dimension of nothingness is completely transcended; the perception of the dimension of neither perception nor non-perception in the dimension of neither perception nor non-perception is completely transcended; the perception of this world in this world is completely transcended; the perception of the other world in the other world is completely transcended; and even in what has been seen, heard, sensed, cognized, attained, sought, and pondered by the mind, the perception of that too is completely transcended. Indeed, friend, such a noble thoroughbred meditator does not meditate dependent on earth, does not meditate dependent on water, does not meditate dependent on fire, does not meditate dependent on wind, does not meditate dependent on the dimension of infinite space, does not meditate dependent on the dimension of infinite consciousness, does not meditate dependent on the dimension of nothingness, does not meditate dependent on the dimension of neither perception nor non-perception, does not meditate dependent on this world, does not meditate dependent on the other world; and not even dependent on what has been seen, heard, sensed, cognized, attained, sought, and pondered by the mind, does he meditate; yet he does meditate. Indeed, friend, such a noble thoroughbred meditator is one whom the devas, including Sakka, Brahma, and Prajāpati, pay homage to from afar, saying: 'Homage to you, O noble person, homage to you, O supreme person! We do not comprehend your foundation, nor that upon which you meditate.'",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ ඤාති නගරයෙහි ගිඤ්ජකාවසථ නම් විහාරයෙහි වැඩසිටින සේක.\n\nඉක්බිති ආයුෂ්මත් සද්ධ මහ රහතන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් සද්ධ මහ රහතන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ‘‘සද්ධ, ආජානීය අශ්වයෙකු මෙන් ධ්‍යාන වඩන්න; කළුංක අශ්වයෙකු මෙන් ධ්‍යාන නොවඩන්න.\n\nසද්ධ, කළුංක අශ්වයාගේ ධ්‍යාන වැඩීම කෙසේ වන්නේද? සද්ධ, කළුංක අශ්වයෙක් ආහාර ද්‍රෝණියට (ගොමනුදුරට) බඳින ලද්දේ ‘තණකොළ, තණකොළ’ යැයි කල්පනා කරයි. එයට හේතුව කුමක්ද? සද්ධ, ආහාර ද්‍රෝණියට බඳින ලද කළුංක අශ්වයාට ‘අද මාගේ අශ්වදමක තැනැත්තා මගෙන් කුමන කටයුත්තක් කරවන්නේද? ඒ සඳහා මා කුමක් කළ යුතුද?’ යි මෙසේ සිතක් ඇති නොවේ. ඔහු ආහාර ද්‍රෝණියට බඳින ලද්දේ ‘තණකොළ, තණකොළ’ යැයි කල්පනා කරයි.\n\nසද්ධ, එපරිද්දෙන්ම මෙහි ඇතැම් නොහික්මුණු පුද්ගලයෙක් අරණ්‍යයට ගියත්, රුක්මුලකට ගියත්, ශුන්‍යාගාරයකට ගියත්, කාමරාගයෙන් යටපත් වූ සිතින් යුක්තව, කාමරාගයෙන් මුළා වූ සිතින් යුක්තව වාසය කරයි. හටගත් කාමරාගයෙන් මිදීම යථාභූත ඥානයෙන් නොදනී. ඔහු කාමරාගයම මූලික කොටගෙන නොමනා ලෙස ධ්‍යාන වඩයි, විපිළිසර වෙයි, දැවෙයි, නොසලකා හරියි. ව්‍යාපාදයෙන් යටපත් වූ සිතින් වාසය කරයි... ථීනමිද්ධයෙන් යටපත් වූ සිතින් වාසය කරයි... උද්ධච්චකුක්කුච්චයෙන් යටපත් වූ සිතින් වාසය කරයි... විචිකිච්ඡාවෙන් යටපත් වූ සිතින්, විචිකිච්ඡාවෙන් මුළා වූ සිතින් වාසය කරයි. හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූත ඥානයෙන් නොදනී. ඔහු විචිකිච්ඡාවම මූලික කොටගෙන නොමනා ලෙස ධ්‍යාන වඩයි, විපිළිසර වෙයි, දැවෙයි, නොසලකා හරියි. ඔහු පඨවිය ඇසුරු කොටගෙන ධ්‍යාන වඩයි, ආපෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන වඩයි, තේජෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන වඩයි, වායෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන වඩයි, ආකාශානන්ත්‍ය ආයතනය ඇසුරු කොටගෙන ධ්‍යාන වඩයි, විඤ්ඤාණානන්ත්‍ය ආයතනය ඇසුරු කොටගෙන ධ්‍යාන වඩයි, ආකිඤ්චන්‍යායතනය ඇසුරු කොටගෙන ධ්‍යාන වඩයි, නේවසඤ්ඤානාසඤ්ඤායතනය ඇසුරු කොටගෙන ධ්‍යාන වඩයි, මේ ලෝකය ඇසුරු කොටගෙන ධ්‍යාන වඩයි, පරලෝකය ඇසුරු කොටගෙන ධ්‍යාන වඩයි, යමක් දකින ලද්දේද, අසන ලද්දේද, ස්පර්ශයෙන් දැනෙන ලද්දේද, සිතින් දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් විමසන ලද්දේද, ඒ සියල්ලද ඇසුරු කොටගෙන ධ්‍යාන වඩයි. සද්ධ, මෙසේය නොහික්මුණු පුරුෂයාගේ ධ්‍යාන වැඩීම වන්නේ.\n\n‘‘සද්ධ, ආජානීය අශ්වයෙකු මෙන් ධ්‍යාන වැඩීම කෙසේ වන්නේද? සද්ධ, උතුම් ආජානීය අශ්වයෙක් ආහාර ද්‍රෝණියට බඳින ලද්දේ ‘තණකොළ, තණකොළ’ යැයි කල්පනා නොකරයි. එයට හේතුව කුමක්ද? සද්ධ, ආහාර ද්‍රෝණියට බඳින ලද උතුම් ආජානීය අශ්වයාට ‘අද මාගේ අශ්වදමක තැනැත්තා මගෙන් කුමන කටයුත්තක් කරවන්නේද? ඒ සඳහා මා කුමක් කළ යුතුද?’ යි මෙසේ සිතක් ඇතිවේ. ඔහු ආහාර ද්‍රෝණියට බඳින ලද්දේ ‘තණකොළ, තණකොළ’ යැයි කල්පනා නොකරයි. සද්ධ, උතුම් ආජානීය අශ්වයා තෝමර පහරක් තම සිරුරට පත්වීම, ණයකට මෙන්ද, බන්ධනයකට මෙන්ද, විපතකට මෙන්ද, අපකීර්තියකට මෙන්ද සලකයි.\n\nසද්ධ, එපරිද්දෙන්ම උතුම් පුරුෂ-ආජානීය තෙමේ අරණ්‍යයට ගියත්, රුක්මුලකට ගියත්, ශුන්‍යාගාරයකට ගියත්, කාමරාගයෙන් යටපත් වූ සිතින් වාසය නොකරයි, කාමරාගයෙන් මුළා වූ සිතින් වාසය නොකරයි. හටගත් කාමරාගයෙන් මිදීම යථාභූත ඥානයෙන් දනී. ව්‍යාපාදයෙන් යටපත් වූ සිතින් වාසය නොකරයි... ථීනමිද්ධයෙන් යටපත් වූ සිතින් වාසය නොකරයි... උද්ධච්චකුක්කුච්චයෙන් යටපත් වූ සිතින් වාසය නොකරයි... විචිකිච්ඡාවෙන් යටපත් වූ සිතින්, විචිකිච්ඡාවෙන් මුළා වූ සිතින් වාසය නොකරයි. හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූත ඥානයෙන් දනී. ඔහු පඨවිය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, ආපෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, තේජෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, වායෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, ආකාශානන්ත්‍ය ආයතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, විඤ්ඤාණානන්ත්‍ය ආයතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, ආකිඤ්චන්‍යායතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, නේවසඤ්ඤානාසඤ්ඤායතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, මේ ලෝකය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, පරලෝකය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, යමක් දකින ලද්දේද, අසන ලද්දේද, ස්පර්ශයෙන් දැනෙන ලද්දේද, සිතින් දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් විමසන ලද්දේද, ඒ සියල්ලද ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි. එහෙත් ධ්‍යාන වඩයි. සද්ධ, මෙසේ ධ්‍යාන වඩන උතුම් පුරුෂ-ආජානීයයාට ඉන්ද්‍ර, බ්‍රහ්ම, ප්‍රජාපති යන දෙවියෝ ද දුර සිටම නමස්කාර කරති: ‘‘පුරුෂාජානීය වන ඔබට නමස්කාර වේවා! පුරුෂෝත්තම වන ඔබට නමස්කාර වේවා! ඔබ යමක් ඇසුරු කොටගෙන ධ්‍යාන වඩන්නේද, ඒ කුමක්දැයි අපි නොදනිමු.’’\n\nමෙසේ වදාළ කල්හි ආයුෂ්මත් සද්ධ මහ රහතන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘වහන්ස, උතුම් පුරුෂ-ආජානීයයා කෙසේ ධ්‍යාන වඩන්නේද යත්, ඔහු පඨවිය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, ආපෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, තේජෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, වායෝ ධාතුව ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, ආකාශානන්ත්‍ය ආයතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, විඤ්ඤාණානන්ත්‍ය ආයතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, ආකිඤ්චන්‍යායතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, නේවසඤ්ඤානාසඤ්ඤායතනය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, මේ ලෝකය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, පරලෝකය ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි, යමක් දකින ලද්දේද, අසන ලද්දේද, ස්පර්ශයෙන් දැනෙන ලද්දේද, සිතින් දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් විමසන ලද්දේද, ඒ සියල්ලද ඇසුරු කොටගෙන ධ්‍යාන නොවඩයි; එහෙත් ධ්‍යාන වඩයි?’’\n\nස්වාමීනි, සක්‍රයා සහිත දෙවියන්, බ්‍රහ්මයන් සහිත දෙවියන්, ප්‍රජාපතීන් සහිත දෙවියන්, මෙබඳු ශ්‍රේෂ්ඨ ආජානීය භාවනායෝගී පුරුෂයාට දුර සිටම නමස්කාර කරන්නේ \"ආජානීය පුරුෂෝත්තමයාණෙනි, ඔබට නමස්කාර වේවා! පුරුෂයන් අතර උතුමාණෙනි, ඔබට නමස්කාර වේවා! ඔබ යමක් ඇසුරු කොට ධ්‍යාන කරන සේක් ද, එය අපි නොදනිමු\" යනුවෙන් කෙසේද?\n\nශ්‍රද්ධාවන්තය, මෙහිලා ශ්‍රේෂ්ඨ ආජානීය පුරුෂයාහට පඨවියේ ඇති පඨවි සංඥාව පහව ගොස් ඇත. ආපෝ මූලධර්මයේ ඇති ආපෝ සංඥාව පහව ගොස් ඇත. තේජෝ මූලධර්මයේ ඇති තේජෝ සංඥාව පහව ගොස් ඇත. වායෝ මූලධර්මයේ ඇති වායෝ සංඥාව පහව ගොස් ඇත. ආකාශානන්ත්‍යායතනයේ ඇති ආකාශානන්ත්‍යායතන සංඥාව පහව ගොස් ඇත. විඤ්ඤාණානන්ත්‍යායතනයේ ඇති විඤ්ඤාණානන්ත්‍යායතන සංඥාව පහව ගොස් ඇත. ආකිඤ්චඤ්ඤායතනයේ ඇති ආකිඤ්චඤ්ඤායතන සංඥාව පහව ගොස් ඇත. නේවසංඥානාසංඥායතනයේ ඇති නේවසංඥානාසංඥායතන සංඥාව පහව ගොස් ඇත. මේ ලෝකයේ ඇති මේ ලෝක සංඥාව පහව ගොස් ඇත. පරලෝකයේ ඇති පරලෝක සංඥාව පහව ගොස් ඇත. යම්කිසිවක් දැක ඇද්ද, අසා ඇද්ද, විඳ දැන ඇද්ද, විශේෂයෙන් දැන ඇද්ද, ලබා ඇද්ද, සොයා ඇද්ද, මනසින් විමසා ඇද්ද, එහි ද සංඥාව පහව ගොස් ඇත. ශ්‍රද්ධාවන්තය, මෙසේ ධ්‍යාන කරන ශ්‍රේෂ්ඨ ආජානීය පුරුෂයා පඨවිය ඇසුරු කොට ධ්‍යාන නොකරයි. එලෙසම ආපෝ, තේජෝ, වායෝ, ආකාශානන්ත්‍යායතන, විඤ්ඤාණානන්ත්‍යායතන, ආකිඤ්චඤ්ඤායතන, නේවසංඥානාසංඥායතන, මේ ලෝකය හෝ පරලෝකය ඇසුරු කොට ධ්‍යාන නොකරයි. යම්කිසිවක් දැක ඇද්ද, අසා ඇද්ද, විඳ දැන ඇද්ද, විශේෂයෙන් දැන ඇද්ද, ලබා ඇද්ද, සොයා ඇද්ද, මනසින් විමසා ඇද්ද, එය ද ඇසුරු කොට ධ්‍යාන නොකරයි. එහෙත් ඔහු ධ්‍යාන කරයි.\n\nශ්‍රද්ධාවන්තය, මෙසේ ධ්‍යාන කරන ශ්‍රේෂ්ඨ ආජානීය භාවනායෝගී පුරුෂයාට සක්‍රයා සහිත දෙවියන්, බ්‍රහ්මයන් සහිත දෙවියන්, ප්‍රජාපතීන් සහිත දෙවියන්, දුර සිටම නමස්කාර කරන්නේ \"ආජානීය පුරුෂෝත්තමයාණෙනි, ඔබට නමස්කාර වේවා! පුරුෂයන් අතර උතුමාණෙනි, ඔබට නමස්කාර වේවා! ඔබ යමක් ඇසුරු කොට ධ්‍යාන කරන සේක් ද, එය අපි නොදනිමු\" යනුවෙනි.",
      "paliTitle": "Saddhasuttaṃ",
      "englishTitle": "The Discourse on Faith",
      "sinhalaTitle": "ශ‍්‍රද්ධා සූත්‍රය"
    },
    {
      "number": 10,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati moranivāpe paribbājakārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Katamehi tīhi? Asekhena sīlakkhandhena, asekhena samādhikkhandhena, asekhena paññākkhandhena – imehi, kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. ‘‘Aparehipi, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Katamehi tīhi? Iddhipāṭihāriyena, ādesanāpāṭihāriyena, anusāsanīpāṭihāriyena – imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti, accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. ‘‘Aparehipi, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Katamehi tīhi? Sammādiṭṭhiyā, sammāñāṇena, sammāvimuttiyā – imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. ‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Katamehi dvīhi? Vijjāya, caraṇena – imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Brahmunā pesā, bhikkhave, sanaṅkumārena gāthā bhāsitā – ‘‘Khattiyo seṭṭho janetasmiṃ, ye gottapaṭisārino; Vijjācaraṇasampanno, so seṭṭho devamānuse’’ti [dī. ni. 1.277; saṃ. ni. 1.182; 2.245]. ‘‘Sā kho panesā, bhikkhave, sanaṅkumārena gāthā bhāsitā subhāsitā, no dubbhāsitā; atthasaṃhitā, no anatthasaṃhitā; anumatā mayā. Ahampi, bhikkhave, evaṃ vadāmi – ‘‘Khattiyo seṭṭho janetasmiṃ, ye gottapaṭisārino; Vijjācaraṇasampanno, so seṭṭho devamānuse’’ti. dasamaṃ; ",
      "english": "Once the Blessed One was dwelling in Rājagaha, at the Wanderers' Park called Moranivāpa. There the Blessed One addressed the bhikkhus, saying, \"Bhikkhus!\" \"Venerable Sir,\" those bhikkhus replied to the Blessed One. The Blessed One spoke thus: \"Bhikkhus, a bhikkhu endowed with three qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans. With which three? With the aggregate of unexcelled virtue, the aggregate of unexcelled concentration, and the aggregate of unexcelled wisdom. Bhikkhus, a bhikkhu endowed with these three qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans.\"\n\n\"Furthermore, bhikkhus, a bhikkhu endowed with three other qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans. With which three? With the miracle of psychic power, the miracle of telepathy, and the miracle of instruction. Bhikkhus, a bhikkhu endowed with these three qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans.\"\n\n\"Furthermore, bhikkhus, a bhikkhu endowed with three other qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans. With which three? With right view, right knowledge, and right liberation. Bhikkhus, a bhikkhu endowed with these three qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans.\"\n\n\"Bhikkhus, a bhikkhu endowed with two qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans. With which two? With true knowledge and conduct. Bhikkhus, a bhikkhu endowed with these two qualities is utterly perfected, utterly secure from bondage, one who has reached the ultimate goal of the holy life, and one who has reached the final end; such a one is supreme among devas and humans.\"\n\n\"Bhikkhus, this verse was spoken by Brahmā Sanaṅkumāra: 'Among people, the warrior is supreme for those who value lineage; but one complete in knowledge and conduct is supreme among devas and humans.' That verse, bhikkhus, spoken by Sanaṅkumāra, was well-spoken, not ill-spoken; it was connected with meaning, not disconnected with meaning; and I approve of it. I too, bhikkhus, say this: 'Among people, the warrior is supreme for those who value lineage; but one complete in knowledge and conduct is supreme among devas and humans.'\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර මෝරනිවාප නම් පරිබ්‍රාජකාරාමයේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"ස්වාමීනී\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, කරුණු තුනකින් යුක්ත වූ භික්ෂුව අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය. කවර තුනකින් ද? අශෛක්ෂ ශීලස්කන්ධයෙන් ද, අශෛක්ෂ සමාධිස්කන්ධයෙන් ද, අශෛක්ෂ ප්‍රඥාස්කන්ධයෙන් ද යන මෙවැනි කරුණු තුනකින් යුක්ත වූ භික්ෂුව අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය.\n\n\"මහණෙනි, තවත් කරුණු තුනකින් යුක්ත වූ භික්ෂුව ද අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය. කවර තුනකින් ද? ඉද්ධි ප්‍රාතිහාර්යයෙන් ද, ආදේශනා ප්‍රාතිහාර්යයෙන් ද, අනුශාසනී ප්‍රාතිහාර්යයෙන් ද යන මෙවැනි කරුණු තුනකින් යුක්ත වූ භික්ෂුව ද අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය.\n\n\"මහණෙනි, තවත් කරුණු තුනකින් යුක්ත වූ භික්ෂුව ද අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය. කවර තුනකින් ද? සම්මා දිට්ඨියෙන් ද, සම්මා ඥානයෙන් ද, සම්මා විමුක්තියෙන් ද යන මෙවැනි කරුණු තුනකින් යුක්ත වූ භික්ෂුව ද අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය.\n\n\"මහණෙනි, කරුණු දෙකකින් යුක්ත වූ භික්ෂුව ද අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය. කවර දෙකකින් ද? විද්‍යාවෙන් ද, චරණයෙන් ද යන මෙවැනි කරුණු දෙකකින් යුක්ත වූ භික්ෂුව ද අතිශයින් නිශ්ඨාවට පැමිණියේ වෙයි, අතිශයින් යෝගක්ෂේමයට පත් වූයේ වෙයි, අතිශයින් බ්‍රහ්මචාරී වූයේ වෙයි, අතිශයින් කෙළවරට පැමිණියේ වෙයි, දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය.\n\n\"මහණෙනි, සනංකුමාර බ්‍රහ්මයා විසින් මේ ගාථාව දේශනා කරන ලද්දේය: 'යම් ක්‍ෂත්‍රියෝ වංශ පරම්පරා අනුගමනය කරද්ද, ඔවුනතර ක්‍ෂත්‍රියයා ශ්‍රේෂ්ඨ ය. එහෙත් විද්‍යාචරණ සම්පන්න වූ ඔහු දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය.'\n\n\"මහණෙනි, සනංකුමාර බ්‍රහ්මයා විසින් දේශනා කරන ලද ඒ ගාථාව සුභාෂිත ය, දුර්භාෂිත නොවේ; අර්ථ සහිත ය, අනර්ථ සහිත නොවේ; මා විසින් අනුමත කරන ලද්දේ ය. මහණෙනි, මම ද මෙසේ කියමි: 'යම් ක්‍ෂත්‍රියෝ වංශ පරම්පරා අනුගමනය කරද්ද, ඔවුනතර ක්‍ෂත්‍රියයා ශ්‍රේෂ්ඨ ය. එහෙත් විද්‍යාචරණ සම්පන්න වූ ඔහු දෙවිමිනිසුනට ශ්‍රේෂ්ඨ වන්නේ ය.\"",
      "paliTitle": "Moranivāpasuttaṃ",
      "englishTitle": "Peacock's Fodder Sutta",
      "sinhalaTitle": "මොරණිවාප සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Nissayavaggo [nissāyavaggo (syā. kaṃ.)] paṭhamo. Tassuddānaṃ – Kimatthiyā cetanā tayo, upanisā byasanena ca; Dve saññā manasikāro, saddho moranivāpakanti.",
    "english": "The First Section on Reliance",
    "sinhala": "පළමු නිස්සය වග්ගය"
  }
}