{
  "id": "an11.2",
  "title": {
    "pali": "Anussativaggo",
    "english": "The Chapter on Recollections",
    "sinhala": "අනුස්සති වග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Tena kho pana samayena sambahulā bhikkhū bhagavato cīvarakammaṃ karonti – ‘‘niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’’ti. Assosi kho mahānāmo sakko – ‘‘sambahulā kira bhikkhū bhagavato cīvarakammaṃ karonti – ‘niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’’’ti. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo sakko bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante – ‘sambahulā kira bhikkhū bhagavato cīvarakammaṃ karonti – niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’ti. Tesaṃ no, bhante, nānāvihārehi viharataṃ kenassa [kena (syā. kaṃ.)] vihārena vihātabba’’nti? ‘‘Sādhu sādhu, mahānāma! Etaṃ kho, mahānāma, tumhākaṃ patirūpaṃ kulaputtānaṃ, yaṃ tumhe tathāgataṃ upasaṅkamitvā puccheyyātha – ‘tesaṃ no, bhante, nānāvihārehi viharataṃ kenassa vihārena vihātabba’’’nti? Saddho kho, mahānāma, ārādhako hoti, no assaddho; āraddhavīriyo ārādhako hoti, no kusīto; upaṭṭhitassati ārādhako hoti, no muṭṭhassati; samāhito ārādhako hoti, no asamāhito; paññavā ārādhako hoti, no duppañño. Imesu kho tvaṃ, mahānāma, pañcasu dhammesu patiṭṭhāya cha dhamme uttari [uttariṃ (sī. syā. kaṃ. pī.)] bhāveyyāsi. [a. ni. 6.10] ‘‘Idha tvaṃ, mahānāma, tathāgataṃ anussareyyāsi – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Yasmiṃ, mahānāma, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti tathāgataṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma, ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotasamāpanno buddhānussatiṃ bhāveti. ‘‘Puna caparaṃ tvaṃ, mahānāma, dhammaṃ anussareyyāsi – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko [opanayiko (sī. syā. kaṃ. pī.)] paccattaṃ veditabbo viññūhī’ti. Yasmiṃ, mahānāma, samaye ariyasāvako dhammaṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti dhammaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma, ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotasamāpanno dhammānussatiṃ bhāveti. ‘‘Puna caparaṃ tvaṃ, mahānāma, saṅghaṃ anussareyyāsi – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā, esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Yasmiṃ, mahānāma, samaye ariyasāvako saṅghaṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti saṅghaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma, ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotasamāpanno saṅghānussatiṃ bhāveti. ‘‘Puna caparaṃ tvaṃ, mahānāma, attano sīlāni anussareyyāsi akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni. Yasmiṃ, mahānāma, samaye ariyasāvako sīlaṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti sīlaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma, ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotasamāpanno sīlānussatiṃ bhāveti. ‘‘Puna caparaṃ tvaṃ, mahānāma, attano cāgaṃ anussareyyāsi – ‘lābhā vata me, suladdhaṃ vata me, yohaṃ maccheramalapariyuṭṭhitāya pajāya vigatamalamaccherena cetasā agāraṃ ajjhāvasāmi muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’ti. Yasmiṃ, mahānāma, samaye ariyasāvako cāgaṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti cāgaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma, ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotasamāpanno cāgānussatiṃ bhāveti. ‘‘Puna caparaṃ tvaṃ, mahānāma, devatā anussareyyāsi – ‘santi devā cātumahārājikā, santi devā tāvatiṃsā, santi devā yāmā, santi devā tusitā, santi devā nimmānaratino, santi devā paranimmitavasavattino, santi devā brahmakāyikā, santi devā tatuttari. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tatthūpapannā, mayhampi tathārūpā saddhā saṃvijjati. Yathārūpena sīlena samannāgatā tā devatā ito cutā tatthūpapannā, mayhampi tathārūpaṃ sīlaṃ saṃvijjati. Yathārūpena sutena samannāgatā tā devatā ito cutā tatthūpapannā, mayhampi tathārūpaṃ sutaṃ saṃvijjati. Yathārūpena cāgena samannāgatā tā devatā ito cutā tatthūpapannā, mayhampi tathārūpo cāgo saṃvijjati. Yathārūpāya paññāya samannāgatā tā devatā ito cutā tatthūpapannā, mayhampi tathārūpā paññā saṃvijjatī’ti. Yasmiṃ, mahānāma, samaye ariyasāvako attano ca tāsañca devatānaṃ saddhañca sīlañca sutañca cāgañca paññañca anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti devatā ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma, ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotasamāpanno devatānussatiṃ bhāvetī’’ti. Paṭhamaṃ.",
      "english": "One time the Blessed One was dwelling among the Sakyans at Kapilavatthu in Nigrodha’s Park. Now at that time, many bhikkhus were making robes for the Blessed One, thinking: \"When the Blessed One has completed his robes, he will set out on a wandering tour after three months.\" Mahānāma the Sakyan heard: \"It is said that many bhikkhus are making robes for the Blessed One, thinking: 'When the Blessed One has completed his robes, he will set out on a wandering tour after three months.'\" Then Mahānāma the Sakyan approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, Mahānāma the Sakyan said to the Blessed One: \"I have heard, Venerable Sir, that many bhikkhus are making robes for the Blessed One, thinking: 'When the Blessed One has completed his robes, he will set out on a wandering tour after three months.' For us, Venerable Sir, who live in various ways, by what mode of dwelling should we dwell?\" \"Good, good, Mahānāma! It is fitting for you, Mahānāma, as sons of noble families, that you should approach the Tathāgata and ask: 'For us, Venerable Sir, who live in various ways, by what mode of dwelling should we dwell?' One who has faith, Mahānāma, is a successful practitioner, not one who is faithless. One who has aroused energy is a successful practitioner, not one who is lazy. One who has established mindfulness is a successful practitioner, not one who is unmindful. One who is concentrated is a successful practitioner, not one who is unconcentrated. One who is wise is a successful practitioner, not one who is unwise. Established in these five qualities, Mahānāma, you should further develop six qualities.\n\n\"Here, Mahānāma, you should recollect the Tathāgata: 'Indeed, the Blessed One is an Arahant, a Fully Enlightened One, accomplished in knowledge and conduct, fortunate, knower of the world, unsurpassed guide of individuals to be tamed, teacher of gods and humans, the Buddha, the Blessed One.' At whatever time, Mahānāma, a noble disciple recollects the Tathāgata, at that time their mind is not overcome by lust, not overcome by hatred, not overcome by delusion; at that time their mind is made straight with reference to the Tathāgata. When their mind is straight, Mahānāma, the noble disciple gains a sense of the goal, gains a sense of the Dhamma, and gains joy associated with the Dhamma. With joy, delight arises; with a delighted mind, the body becomes tranquil; with a tranquil body, one experiences happiness; with happiness, the mind becomes concentrated. This, Mahānāma, is called a noble disciple who dwells in concord with a discordant generation, who dwells without affliction with an afflicted generation, who has entered the stream of the Dhamma, and who develops recollection of the Buddha.\n\n\"Furthermore, Mahānāma, you should recollect the Dhamma: 'The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, leading inwards, to be personally experienced by the wise.' At whatever time, Mahānāma, a noble disciple recollects the Dhamma, at that time their mind is not overcome by lust, not overcome by hatred, not overcome by delusion; at that time their mind is made straight with reference to the Dhamma. When their mind is straight, Mahānāma, the noble disciple gains a sense of the goal, gains a sense of the Dhamma, and gains joy associated with the Dhamma. With joy, delight arises; with a delighted mind, the body becomes tranquil; with a tranquil body, one experiences happiness; with happiness, the mind becomes concentrated. This, Mahānāma, is called a noble disciple who dwells in concord with a discordant generation, who dwells without affliction with an afflicted generation, who has entered the stream of the Dhamma, and who develops recollection of the Dhamma.\n\n\"Furthermore, Mahānāma, you should recollect the Saṅgha: 'The Saṅgha of the Blessed One's disciples is practicing well, the Saṅgha of the Blessed One's disciples is practicing uprightly, the Saṅgha of the Blessed One's disciples is practicing for the sake of true knowledge, the Saṅgha of the Blessed One's disciples is practicing properly; that is, the four pairs of individuals, the eight types of noble persons — this Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unsurpassed field of merit for the world.' At whatever time, Mahānāma, a noble disciple recollects the Saṅgha, at that time their mind is not overcome by lust, not overcome by hatred, not overcome by delusion; at that time their mind is made straight with reference to the Saṅgha. When their mind is straight, Mahānāma, the noble disciple gains a sense of the goal, gains a sense of the Dhamma, and gains joy associated with the Dhamma. With joy, delight arises; with a delighted mind, the body becomes tranquil; with a tranquil body, one experiences happiness; with happiness, the mind becomes concentrated. This, Mahānāma, is called a noble disciple who dwells in concord with a discordant generation, who dwells without affliction with an afflicted generation, who has entered the stream of the Dhamma, and who develops recollection of the Saṅgha.\"\n\nFurthermore, Mahānāma, you should recollect your own virtues, which are unbroken, untorn, unblemished, unspotted, liberating, praised by the wise, ungrasped, and conducive to concentration. At the time, Mahānāma, when a noble disciple recollects virtue, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; rather, at that time, their mind is made straight with regard to virtue. Indeed, Mahānāma, a noble disciple whose mind is made straight gains inspiration regarding the goal, gains inspiration regarding the Dhamma, and gains joy associated with the Dhamma. When joyful, rapture arises in them; when rapturous in mind, their body becomes tranquil; one whose body is tranquil experiences happiness; when happy, their mind becomes concentrated. This, Mahānāma, is said to be a noble disciple who dwells in evenness amidst an uneven generation, who dwells without ill-will amidst an ill-willed generation, and who, having entered the stream of Dhamma, develops the recollection of virtue.\n\nFurthermore, Mahānāma, you should recollect your own generosity: ‘Indeed, it is a gain for me, indeed it is well-gained for me, that I dwell in a home with a mind free from the stain of stinginess amidst a generation overcome by the stain of stinginess, having given up, with hands outstretched, delighting in relinquishment, amenable to requests, delighting in sharing gifts.’ At the time, Mahānāma, when a noble disciple recollects generosity, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; rather, at that time, their mind is made straight with regard to generosity. Indeed, Mahānāma, a noble disciple whose mind is made straight gains inspiration regarding the goal, gains inspiration regarding the Dhamma, and gains joy associated with the Dhamma. When joyful, rapture arises in them; when rapturous in mind, their body becomes tranquil; one whose body is tranquil experiences happiness; when happy, their mind becomes concentrated. This, Mahānāma, is said to be a noble disciple who dwells in evenness amidst an uneven generation, who dwells without ill-will amidst an ill-willed generation, and who, having entered the stream of Dhamma, develops the recollection of generosity.\n\nFurthermore, Mahānāma, you should recollect the devas: ‘There are devas of the Four Great Kings, there are devas of the Thirty-three, there are Yāma devas, there are Tusita devas, there are Nimmānaratī devas, there are Paranimmitavasavattī devas, there are Brahmā devas, and there are devas superior to these. With whatever kind of faith those devas, having passed away from here, were reborn there, such faith is also found in me. With whatever kind of virtue those devas, having passed away from here, were reborn there, such virtue is also found in me. With whatever kind of learning those devas, having passed away from here, were reborn there, such learning is also found in me. With whatever kind of generosity those devas, having passed away from here, were reborn there, such generosity is also found in me. With whatever kind of wisdom those devas, having passed away from here, were reborn there, such wisdom is also found in me.’ At the time, Mahānāma, when a noble disciple recollects their own faith, virtue, learning, generosity, and wisdom, as well as those of the devas, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; rather, at that time, their mind is made straight with regard to the devas. Indeed, Mahānāma, a noble disciple whose mind is made straight gains inspiration regarding the goal, gains inspiration regarding the Dhamma, and gains joy associated with the Dhamma. When joyful, rapture arises in them; when rapturous in mind, their body becomes tranquil; one whose body is tranquil experiences happiness; when happy, their mind becomes concentrated. This, Mahānāma, is said to be a noble disciple who dwells in evenness amidst an uneven generation, who dwells without ill-will amidst an ill-willed generation, and who, having entered the stream of Dhamma, develops the recollection of the devas.",
      "sinhala": "එක් සමයෙක්හි භාග්‍ය#zwj;වතුන් වහන්සේ ශාක්‍ය#zwj; දේශයෙහි කපිලවස්තු නුවර නිග්‍රෝධාරාමයෙහි වැඩවසන සේක. ඒ සමයෙහි බොහෝ භික්ෂූන් වහන්සේලා භාග්‍ය#zwj;වතුන් වහන්සේගේ චීවර කර්මය කරමින් සිටියහ – “භාග්‍ය#zwj;වතුන් වහන්සේගේ සිවුරු කටයුතු නිම වූ පසු තෙමසක් ඇවෑමෙන් චාරිකාවේ වඩින සේක” යනුවෙන්.\nමහානාම නම් ශාක්‍ය#zwj; රජතුමාට මේ පුවත ඇසිණි – “බොහෝ භික්ෂූන් වහන්සේලා භාග්‍ය#zwj;වතුන් වහන්සේගේ චීවර කර්මය කරමින් සිටිනවා. භාග්‍ය#zwj;වතුන් වහන්සේගේ සිවුරු කටයුතු නිම වූ පසු තෙමසක් ඇවෑමෙන් චාරිකාවේ වඩින සේක” යනුවෙන්.\nඑවිට මහානාම ශාක්‍ය#zwj; රජතුමා භාග්‍ය#zwj;වතුන් වහන්සේ වෙත පැමිණියේ ය. පැමිණ භාග්‍ය#zwj;වතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි මහානාම ශාක්‍ය#zwj; රජතුමා භාග්‍ය#zwj;වතුන් වහන්සේට මෙසේ පැවසුවේ ය: “ස්වාමීනි, මට මේ පුවත අසන්නට ලැබුණි – ‘බොහෝ භික්ෂූන් වහන්සේලා භාග්‍ය#zwj;වතුන් වහන්සේගේ චීවර කර්මය කරමින් සිටිනවා. භාග්‍ය#zwj;වතුන් වහන්සේගේ සිවුරු කටයුතු නිම වූ පසු තෙමසක් ඇවෑමෙන් භාග්‍ය#zwj;වතුන් වහන්සේ චාරිකාවේ වඩින සේක’ යනුවෙන්. ස්වාමීනි, නානාවිධ විහරණයන්ගෙන් වාසය කරන අප විසින් කුමන විහරණයකින් වාසය කළ යුතු දැ?”\n“සාධු, සාධු, මහානාම! මහානාම, තථාගතයන් වහන්සේ වෙත පැමිණ, ‘ස්වාමීනි, නානාවිධ විහරණයන්ගෙන් වාසය කරන අප විසින් කුමන විහරණයකින් වාසය කළ යුතු දැ?’ යි ඔබ විමසීම කුලපුත්‍ර#zwj;යන්ට සුදුසු ය.\nමහානාම, ශ්‍ර#zwj;ද්ධා ඇත්තා ඵලදායක වේ, අශ්‍ර#zwj;ද්ධාවන්තයා ඵලදායක නොවෙයි. වීර්යවන්තයා ඵලදායක වේ, අලසයා ඵලදායක නොවෙයි. සිහි නුවණින් යුක්ත තැනැත්තා ඵලදායක වේ, මුලාවට පත් සිහි ඇත්තා ඵලදායක නොවෙයි. සමාධිමත් තැනැත්තා ඵලදායක වේ, අසමාහිතයා ඵලදායක නොවෙයි. ප්‍ර#zwj;ඥාවන්තයා ඵලදායක වේ, ප්‍ර#zwj;ඥාවක් නැත්තා ඵලදායක නොවෙයි. මහානාම, ඔබ මේ පංච ධර්මයන්හි පිහිටා තවදුරටත් ධර්ම#zwj; සයක් භාවනා කළ යුතු ය.\n\n“මහානාම, මෙහිලා ඔබ තථාගතයන් වහන්සේ අනුස්මරණය කළ යුතු ය – ‘ඒ භාග්‍ය#zwj;වතුන් වහන්සේ අරහත් වන සේක, සම්‍යක් සම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තර පුරිසදම්මසාරථී වන සේක, දෙවි මිනිසුන්ට ශාස්තෘ වන සේක, බුද්ධ වන සේක, භාග්‍ය#zwj;වත් වන සේක’ යනුවෙන්.\nමහානාම, යම් සමයෙක්හි ආර්ය ශ්‍ර#zwj;ාවකයා තථාගතයන් වහන්සේ අනුස්මරණය කරන්නේ ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් වෙළීගත් සිතක් නොවෙයි, ද්වේෂයෙන් වෙළීගත් සිතක් නොවෙයි, මෝහයෙන් වෙළීගත් සිතක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත තථාගතයන් වහන්සේ අරභයා සෘජු බවට පත් වූවක් ම වෙයි.\nමහානාම, සෘජු වූ සිත් ඇති ආර්ය ශ්‍ර#zwj;ාවකයා අර්ථ රසය ලබයි, ධර්ම#zwj; රසය ලබයි, ධර්ම#zwj;යට අනුව උපදින ප්‍ර#zwj;මෝදය ලබයි. ප්‍ර#zwj;මුදිත වූ තැනැත්තාට ප්‍ර#zwj;ීතිය උපදියි. ප්‍ර#zwj;ීතියෙන් යුත් සිත් ඇති තැනැත්තාගේ ශරීරය සංසිඳෙයි. සංසිඳුණු ශරීරය ඇති තැනැත්තා සැප විඳියි. සැප විඳින තැනැත්තාගේ සිත සමාධිමත් වෙයි.\nමහානාම, මේ ආර්ය ශ්‍ර#zwj;ාවකයා විෂමතාවයෙන් යුත් ප්‍ර#zwj;ජාව අතරේ සමබවින් යුක්තව වාසය කරයි, ව්‍යාපාද සහිත ප්‍ර#zwj;ජාව අතරේ ව්‍යාපාද රහිතව වාසය කරයි, ධර්ම#zwj; සෝතයට පත් වූවෙක් ලෙස බුද්ධානුස්සතිය වඩයි යි කියනු ලැබේ.\n\n“මහානාම, තවද ඔබ ධර්ම#zwj;ය අනුස්මරණය කළ යුතු ය – ‘භාග්‍ය#zwj;වතුන් වහන්සේ විසින් ධර්ම#zwj;ය ස්වාක්ඛ්‍යාත ය. එය සන්දිට්ඨික ය, අකාලික ය, ඒහිපස්සික ය, ඕපනෙය්‍යික ය, නුවණැත්තන් විසින් තමන් තුළින් ම අත්දැකිය යුතු ය’ යනුවෙන්.\nමහානාම, යම් සමයෙක්හි ආර්ය ශ්‍ර#zwj;ාවකයා ධර්ම#zwj;ය අනුස්මරණය කරන්නේ ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් වෙළීගත් සිතක් නොවෙයි, ද්වේෂයෙන් වෙළීගත් සිතක් නොවෙයි, මෝහයෙන් වෙළීගත් සිතක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත ධර්ම#zwj;ය අරභයා සෘජු බවට පත් වූවක් ම වෙයි.\nමහානාම, සෘජු වූ සිත් ඇති ආර්ය ශ්‍ර#zwj;ාවකයා අර්ථ රසය ලබයි, ධර්ම#zwj; රසය ලබයි, ධර්ම#zwj;යට අනුව උපදින ප්‍ර#zwj;මෝදය ලබයි. ප්‍ර#zwj;මුදිත වූ තැනැත්තාට ප්‍ර#zwj;ීතිය උපදියි. ප්‍ර#zwj;ීතියෙන් යුත් සිත් ඇති තැනැත්තාගේ ශරීරය සංසිඳෙයි. සංසිඳුණු ශරීරය ඇති තැනැත්තා සැප විඳියි. සැප විඳින තැනැත්තාගේ සිත සමාධිමත් වෙයි.\nමහානාම, මේ ආර්ය ශ්‍ර#zwj;ාවකයා විෂමතාවයෙන් යුත් ප්‍ර#zwj;ජාව අතරේ සමබවින් යුක්තව වාසය කරයි, ව්‍යාපාද සහිත ප්‍ර#zwj;ජාව අතරේ ව්‍යාපාද රහිතව වාසය කරයි, ධර්ම#zwj; සෝතයට පත් වූවෙක් ලෙස ධම්මානුස්සතිය වඩයි යි කියනු ලැබේ.\n\n“මහානාම, තවද ඔබ සංඝයා අනුස්මරණය කළ යුතු ය – ‘භාග්‍ය#zwj;වතුන් වහන්සේගේ ශ්‍ර#zwj;ාවක සංඝයා සුපටිපන්න ය, උජුපටිපන්න ය, ඤායපටිපන්න ය, සාමීචිපටිපන්න ය. එනම් සතර පුරිස යුගයෝ ය, අට මහා පුරිස පුද්ගලයෝ ය. ඒ භාග්‍ය#zwj;වතුන් වහන්සේගේ ශ්‍ර#zwj;ාවක සංඝයා ආහුණෙය්‍ය ය, පාහුණෙය්‍ය ය, දක්ඛිණෙය්‍ය ය, අඤ්ජලිකරණීය ය, ලෝකයාට අනුත්තර වූ පින් කෙත ය’ යනුවෙන්.\nමහානාම, යම් සමයෙක්හි ආර්ය ශ්‍ර#zwj;ාවකයා සංඝයා අනුස්මරණය කරන්නේ ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් වෙළීගත් සිතක් නොවෙයි, ද්වේෂයෙන් වෙළීගත් සිතක් නොවෙයි, මෝහයෙන් වෙළීගත් සිතක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත සංඝයා අරභයා සෘජු බවට පත් වූවක් ම වෙයි.\nමහානාම, සෘජු වූ සිත් ඇති ආර්ය ශ්‍ර#zwj;ාවකයා අර්ථ රසය ලබයි, ධර්ම#zwj; රසය ලබයි, ධර්ම#zwj;යට අනුව උපදින ප්‍ර#zwj;මෝදය ලබයි. ප්‍ර#zwj;මුදිත වූ තැනැත්තාට ප්‍ර#zwj;ීතිය උපදියි. ප්‍ර#zwj;ීතියෙන් යුත් සිත් ඇති තැනැත්තාගේ ශරීරය සංසිඳෙයි. සංසිඳුණු ශරීරය ඇති තැනැත්තා සැප විඳියි. සැප විඳින තැනැත්තාගේ සිත සමාධිමත් වෙයි.\nමහානාම, මේ ආර්ය ශ්‍ර#zwj;ාවකයා විෂමතාවයෙන් යුත් ප්‍ර#zwj;ජාව අතරේ සමබවින් යුක්තව වාසය කරයි, ව්‍යාපාද සහිත ප්‍ර#zwj;ජාව අතරේ ව්‍යාපාද රහිතව වාසය කරයි, ධර්ම#zwj; සෝතයට පත් වූවෙක් ලෙස සංඝානුස්සතිය වඩයි යි කියනු ලැබේ.\n\nමහණාම, තවද ඔබ කැඩීම් නැති, සිදුරු නැති, කිළුටු නැති, අඳුරු බව නැති, නිදහස් වූ, ප්‍රඥාවන්තයන් විසින් ප්‍රශංසා කරන ලද, තෘෂ්ණා දෘෂ්ටීන්ගෙන් අල්ලා නොගත්, සමාධියට උපකාරී වන තම සීලය සිහි කළ යුතු ය. මහණාම, යම් කලෙක ආර්ය ශ්‍රාවකයා සීලය සිහි කරන්නේද, ඒ කලෙක ඔහුගේ සිත රාගයෙන් පිරිහෙන්නේ නැත, ද්වේෂයෙන් පිරිහෙන්නේ නැත, මෝහයෙන් පිරිහෙන්නේ නැත; සීලය අරමුණු කොට ඔහුගේ සිත ඒ කලෙක ඍජු භාවයටම පත් වේ. මහණාම, ඍජු වූ සිතැති ආර්ය ශ්‍රාවකයා අර්ථය අවබෝධ කරයි, ධර්මය අවබෝධ කරයි, ධර්මය හා සම්බන්ධ ප්‍රමෝදය ලබයි. ප්‍රීතිමත් වූ තැනැත්තාට ප්‍රීතිය උපදියි, ප්‍රීතිමත් මනසක් ඇති තැනැත්තාගේ කය සංසිඳෙයි, කය සංසිඳුණු තැනැත්තාට සැපය දැනෙයි, සැප විඳින්නාගේ සිත සමාධිමත් වේ. මහණාම, මේ ආර්ය ශ්‍රාවකයා විෂම ගති ඇති සත්ව සමූහයා අතර සම භාවයට පත් ව වාසය කරයි, ව්‍යාපාද සහිත සත්ව සමූහයා අතර ව්‍යාපාද රහිත ව වාසය කරයි, ධර්ම ධාරාවට (සෝවාන් මාර්ගයට) පැමිණ සීල අනුස්සතිය වඩයි යැයි කියනු ලැබේ.\n\nමහණාම, තවද ඔබ තමාගේ ත්‍යාගය (ත්‍යාගශීලී බව) සිහි කළ යුතු ය – ‘මම ලාභ ඇත්තෙමි, මම මනාකොට ලද්දෙමි, යම් හෙයකින් මම මසුරු මලයෙන් පිරිහෙලන ලද සත්ව සමූහයා අතර මසුරු මල පහ කළ සිතකින් ගිහි ගෙය වාසය කරමි, මුදා හැරීම පුරුදු කළ, පිවිතුරු අත් ඇති, අත්හැරීමෙහි ඇලුණු, යාචකයන්ට සුදුසු, දානය බෙදා දීමෙහි ඇලුණු කෙනෙක් වෙමි’යි. මහණාම, යම් කලෙක ආර්ය ශ්‍රාවකයා ත්‍යාගය සිහි කරන්නේද, ඒ කලෙක ඔහුගේ සිත රාගයෙන් පිරිහෙන්නේ නැත, ද්වේෂයෙන් පිරිහෙන්නේ නැත, මෝහයෙන් පිරිහෙන්නේ නැත; ත්‍යාගය අරමුණු කොට ඔහුගේ සිත ඒ කලෙක ඍජු භාවයටම පත් වේ. මහණාම, ඍජු වූ සිතැති ආර්ය ශ්‍රාවකයා අර්ථය අවබෝධ කරයි, ධර්මය අවබෝධ කරයි, ධර්මය හා සම්බන්ධ ප්‍රමෝදය ලබයි. ප්‍රීතිමත් වූ තැනැත්තාට ප්‍රීතිය උපදියි, ප්‍රීතිමත් මනසක් ඇති තැනැත්තාගේ කය සංසිඳෙයි, කය සංසිඳුණු තැනැත්තාට සැපය දැනෙයි, සැප විඳින්නාගේ සිත සමාධිමත් වේ. මහණාම, මේ ආර්ය ශ්‍රාවකයා විෂම ගති ඇති සත්ව සමූහයා අතර සම භාවයට පත් ව වාසය කරයි, ව්‍යාපාද සහිත සත්ව සමූහයා අතර ව්‍යාපාද රහිත ව වාසය කරයි, ධර්ම ධාරාවට (සෝවාන් මාර්ගයට) පැමිණ ත්‍යාග අනුස්සතිය වඩයි යැයි කියනු ලැබේ.\n\nමහණාම, තවද ඔබ දෙවියන් සිහි කළ යුතු ය – ‘චාතුර්මහාරාජික දෙවියෝ වෙති, තාවතිංස දෙවියෝ වෙති, යාම දෙවියෝ වෙති, තුසිත දෙවියෝ වෙති, නිර්මාණරතී දෙවියෝ වෙති, පරනිම්මිතවසවත්ති දෙවියෝ වෙති, බ්‍රහ්මකායික දෙවියෝ වෙති, ඊටත් වඩා උසස් දෙවියෝ වෙති. යම් ආකාරයක ශ්‍රද්ධාවකින් යුක්ත ව ඒ දෙවියෝ මෙයින් චුත ව එහි උපන්නාහුද, මටද එවැනි ශ්‍රද්ධාවක් ඇත. යම් ආකාරයක සීලයකින් යුක්ත ව ඒ දෙවියෝ මෙයින් චුත ව එහි උපන්නාහුද, මටද එවැනි සීලයක් ඇත. යම් ආකාරයක ශ්‍රවණයකින් (ධර්ම දැනුමකින්) යුක්ත ව ඒ දෙවියෝ මෙයින් චුත ව එහි උපන්නාහුද, මටද එවැනි ශ්‍රවණයක් (ධර්ම දැනුමක්) ඇත. යම් ආකාරයක ත්‍යාගයකින් යුක්ත ව ඒ දෙවියෝ මෙයින් චුත ව එහි උපන්නාහුද, මටද එවැනි ත්‍යාගයක් ඇත. යම් ආකාරයක ප්‍රඥාවකින් යුක්ත ව ඒ දෙවියෝ මෙයින් චුත ව එහි උපන්නාහුද, මටද එවැනි ප්‍රඥාවක් ඇත’යි. මහණාම, යම් කලෙක ආර්ය ශ්‍රාවකයා තමාගේ සහ ඒ දෙවියන්ගේ ශ්‍රද්ධාවද, සීලයද, ශ්‍රවණයද (ධර්ම දැනුමද), ත්‍යාගයද, ප්‍රඥාවද සිහි කරන්නේද, ඒ කලෙක ඔහුගේ සිත රාගයෙන් පිරිහෙන්නේ නැත, ද්වේෂයෙන් පිරිහෙන්නේ නැත, මෝහයෙන් පිරිහෙන්නේ නැත; දෙවියන් අරමුණු කොට ඔහුගේ සිත ඒ කලෙක ඍජු භාවයටම පත් වේ. මහණාම, ඍජු වූ සිතැති ආර්ය ශ්‍රාවකයා අර්ථය අවබෝධ කරයි, ධර්මය අවබෝධ කරයි, ධර්මය හා සම්බන්ධ ප්‍රමෝදය ලබයි. ප්‍රීතිමත් වූ තැනැත්තාට ප්‍රීතිය උපදියි, ප්‍රීතිමත් මනසක් ඇති තැනැත්තාගේ කය සංසිඳෙයි, කය සංසිඳුණු තැනැත්තාට සැපය දැනෙයි, සැප විඳින්නාගේ සිත සමාධිමත් වේ. මහණාම, මේ ආර්ය ශ්‍රාවකයා විෂම ගති ඇති සත්ව සමූහයා අතර සම භාවයට පත් ව වාසය කරයි, ව්‍යාපාද සහිත සත්ව සමූහයා අතර ව්‍යාපාද රහිත ව වාසය කරයි, ධර්ම ධාරාවට (සෝවාන් මාර්ගයට) පැමිණ දෙවතා අනුස්සතිය වඩයි යැයි කියනු ලැබේ.",
      "paliTitle": "Paṭhamamahānāmasuttaṃ"
    },
    {
      "number": 12,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Tena kho pana samayena mahānāmo sakko gilānā vuṭṭhito hoti aciravuṭṭhito gelaññā. Tena kho pana samayena sambahulā bhikkhū bhagavato cīvarakammaṃ karonti – ‘‘niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’’ti. Assosi kho mahānāmo sakko – ‘‘sambahulā kira bhikkhū bhagavato cīvarakammaṃ karonti – ‘niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’’’ti. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo sakko bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante – ‘sambahulā kira bhikkhū bhagavato cīvarakammaṃ karonti – niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’ti. Tesaṃ no, bhante, nānāvihārehi viharataṃ kenassa vihārena vihātabba’’nti? ‘‘Sādhu sādhu, mahānāma! Etaṃ kho, mahānāma, tumhākaṃ patirūpaṃ kulaputtānaṃ yaṃ tumhe tathāgataṃ upasaṅkamitvā puccheyyātha – ‘tesaṃ no, bhante, nānāvihārehi viharataṃ kenassa vihārena vihātabba’nti? Saddho kho, mahānāma, ārādhako hoti, no assaddho; āraddhavīriyo ārādhako hoti, no kusīto; upaṭṭhitassati ārādhako hoti, no muṭṭhassati; samāhito ārādhako hoti, no asamāhito; paññavā ārādhako hoti, no duppañño. Imesu kho tvaṃ, mahānāma, pañcasu dhammesu patiṭṭhāya cha dhamme uttari bhāveyyāsi. [a. ni. 6.9] ‘‘Idha tvaṃ, mahānāma, tathāgataṃ anussareyyāsi – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Yasmiṃ, mahānāma, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti tathāgataṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Imaṃ kho tvaṃ, mahānāma, buddhānussatiṃ gacchantopi bhāveyyāsi, ṭhitopi bhāveyyāsi, nisinnopi bhāveyyāsi, sayānopi bhāveyyāsi, kammantaṃ adhiṭṭhahantopi bhāveyyāsi, puttasambādhasayanaṃ ajjhāvasantopi bhāveyyāsi. ‘‘Puna caparaṃ tvaṃ, mahānāma, dhammaṃ anussareyyāsi…pe… saṅghaṃ anussareyyāsi…pe… attano sīlāni anussareyyāsi…pe… attano cāgaṃ anussareyyāsi…pe… devatā anussareyyāsi – ‘santi devā cātumahārājikā…pe… santi devā tatuttari. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tatthūpapannā, mayhampi tathārūpā saddhā saṃvijjati. Yathārūpena sīlena… sutena… cāgena… paññāya samannāgatā tā devatā ito cutā tatthūpapannā, mayhampi tathārūpā paññā saṃvijjatī’ti. Yasmiṃ, mahānāma, samaye ariyasāvako attano ca tāsañca devatānaṃ saddhañca sīlañca sutañca cāgañca paññañca anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti devatā ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Imaṃ kho tvaṃ, mahānāma, devatānussatiṃ gacchantopi bhāveyyāsi, ṭhitopi bhāveyyāsi, nisinnopi bhāveyyāsi, sayānopi bhāveyyāsi, kammantaṃ adhiṭṭhahantopi bhāveyyāsi, puttasambādhasayanaṃ ajjhāvasantopi bhāveyyāsī’’ti. Dutiyaṃ.",
      "english": "At one time the Blessed One was dwelling among the Sakyans, in Kapilavatthu, at the Nigrodha Park. Now at that time, Mahānāma the Sakyan had just recovered from an illness, having recently arisen from sickness. At that time, a number of monks were making robes for the Blessed One, thinking: \"When the Blessed One's robes are finished, he will set out on a wandering tour after three months.\" Mahānāma the Sakyan heard: \"It is said that a number of monks are making robes for the Blessed One, thinking: 'When the Blessed One's robes are finished, he will set out on a wandering tour after three months.'\" Then Mahānāma the Sakyan approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he was sitting to one side, Mahānāma the Sakyan said to the Blessed One: \"Venerable sir, I have heard that a number of monks are making robes for the Blessed One, thinking: 'When the Blessed One's robes are finished, he will set out on a wandering tour after three months.' For us, Venerable sir, who dwell in various abodes, by what abiding should we abide?\" \"Good, good, Mahānāma! It is fitting for you, Mahānāma, as sons of good families, that you should approach the Tathāgata and ask: 'For us, Venerable sir, who dwell in various abodes, by what abiding should we abide?' Mahānāma, one who has faith is successful, not one without faith; one who has aroused energy is successful, not one who is lazy; one who has established mindfulness is successful, not one who is unmindful; one who is concentrated is successful, not one who is unconcentrated; one who is wise is successful, not one who is unwise. Mahānāma, establishing yourself in these five qualities, you should further develop six contemplations.\"\n\n\"Here, Mahānāma, you should recollect the Tathāgata: 'Indeed, the Blessed One is thus: he is an Arahant, perfectly enlightened, endowed with clear knowledge and conduct, sublime, the knower of worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.' Mahānāma, at whatever time a noble disciple recollects the Tathāgata, at that time his mind is not beset by lust, not beset by hatred, not beset by delusion; at that time his mind is made straight with respect to the Tathāgata. Mahānāma, a noble disciple whose mind is made straight gains inspiration concerning the goal, gains inspiration concerning the Dhamma, gains joy connected with the Dhamma. When joyful, rapture arises; for one whose mind is rapturous, the body becomes tranquil; one whose body is tranquil experiences happiness; for one who is happy, the mind becomes concentrated. Mahānāma, you should develop this recollection of the Buddha whether you are walking, standing, sitting, lying down, attending to your work, or dwelling in a crowded home with children.\"\n\n\"Furthermore, Mahānāma, you should recollect the Dhamma: 'The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, relevant, to be personally experienced by the wise.' You should recollect the Saṅgha: 'The Saṅgha of the Blessed One's disciples is practicing the good way, practicing the straight way, practicing the judicious way, practicing the proper way; that is, the four pairs of noble persons, the eight types of individuals – this Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unsurpassed field of merit for the world.' You should recollect your own virtues: 'My virtues are unbroken, untorn, unblemished, unblotched, liberating, praised by the wise, untainted, conducive to concentration.' You should recollect your own generosity: 'It is a gain for me, a great gain for me, that I have a generous nature, living with mind devoid of the stain of stinginess, open-handed, delighting in giving, responsive to requests, delighting in sharing gifts.' You should recollect the devas: 'There are the devas of the Four Great Kings, the Tāvatiṃsa devas, the Yāma devas, the Tusita devas, the Nimmānaratī devas, the Paranimmita­vasavattī devas, and there are devas superior to them. With such faith endowed, those devas, having passed away from here, were reborn there. Such faith is present in me too. With such virtue endowed, such learning, such generosity, such wisdom, those devas, having passed away from here, were reborn there. Such wisdom is present in me too.' Mahānāma, at whatever time a noble disciple recollects his own faith, virtue, learning, generosity, and wisdom, and those of the devas, at that time his mind is not beset by lust, not beset by hatred, not beset by delusion; at that time his mind is made straight with respect to the devas. Mahānāma, a noble disciple whose mind is made straight gains inspiration concerning the goal, gains inspiration concerning the Dhamma, gains joy connected with the Dhamma. When joyful, rapture arises; for one whose mind is rapturous, the body becomes tranquil; one whose body is tranquil experiences happiness; for one who is happy, the mind becomes concentrated. Mahānāma, you should develop this recollection of the devas whether you are walking, standing, sitting, lying down, attending to your work, or dwelling in a crowded home with children.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශාක්‍ය දේශයෙහි කපිලවස්තු නුවර නිග්‍රෝධාරාමයෙහි වැඩවසන සේක. එවිට මහානාම ශාක්‍යයා රෝගයෙන් නැගිට සිටියේ, රෝගයෙන් සුවය ලබා වැඩි කලක් නොගිය කෙනෙක් විය. එවිට බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ සිවුරු මැසීමේ කර්මාන්තය කරමින් සිටියහ – “භාග්‍යවතුන් වහන්සේ සිවුරු නිම කළ සේක් නම්, තුන් මසකින් චාරිකාවේ වඩින සේක” යන අදහසිනි. මහානාම ශාක්‍යයා මෙය ඇසීය – “බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ සිවුරු මැසීමේ කර්මාන්තය කරති – ‘භාග්‍යවතුන් වහන්සේ සිවුරු නිම කළ සේක් නම්, තුන් මසකින් චාරිකාවේ වඩින සේක’” යනුවෙනි. එවිට මහානාම ශාක්‍යයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි මහානාම ශාක්‍යයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – “ස්වාමීනි, මට අසන්නට ලැබුණි – ‘බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ සිවුරු මැසීමේ කර්මාන්තය කරති – භාග්‍යවතුන් වහන්සේ සිවුරු නිම කළ සේක් නම්, තුන් මසකින් චාරිකාවේ වඩින සේක’ යනුවෙනි. ස්වාමීනි, නොයෙක් විහරණයන්ගෙන් වාසය කරන අප විසින් කුමන විහරණයකින් වාසය කළ යුතු දැ?”යි.\n\n“සාධු සාධු, මහානාමය! මහානාමය, මේ ඔබ වැනි කුලපුත්‍රයන්ට සුදුසු යි – යම්හෙයකින් ඔබ තථාගතයන් වහන්සේ වෙත පැමිණ ‘ස්වාමීනි, නොයෙක් විහරණයන්ගෙන් වාසය කරන අප විසින් කුමන විහරණයකින් වාසය කළ යුතු දැ’යි විමසන්නේ නම්. මහානාමය, ශ්‍රද්ධාවන්තයා (අරමුණ) සාර්ථක කරගන්නා කෙනෙක් වේ, ශ්‍රද්ධාව නැත්තා සාර්ථක කරගන්නා කෙනෙක් නොවේ; වීර්යය ආරම්භ කළ තැනැත්තා සාර්ථක කරගන්නා කෙනෙක් වේ, අලසයා නොවේ; සිහි නුවණ ඇති තැනැත්තා සාර්ථක කරගන්නා කෙනෙක් වේ, අමතක කරන්නේ නොවේ; සමාධිමත් වූ තැනැත්තා සාර්ථක කරගන්නා කෙනෙක් වේ, සමාධිය නැත්තා නොවේ; ප්‍රඥාවන්තයා සාර්ථක කරගන්නා කෙනෙක් වේ, දුර්ප්‍රඥයා නොවේ. මහානාමය, ඔබ මේ ධර්මයන් පහෙහි පිහිටා තවදුරටත් ධර්මයන් සය දෙනා වර්ධනය කළ යුතු ය.\n\nමහානාමය, මෙහිලා ඔබ තථාගතයන් වහන්සේ සිහි කළ යුතු ය – ‘ඒ භාග්‍යවතුන් වහන්සේ... (යනාදී වශයෙන්) ... දෙවි මිනිසුන්ගේ ශාස්තෘ වූ, බුදු වූ, භාග්‍යවතුන් වහන්සේ’ යනුවෙනි. මහානාමය, යම් සමයෙක ආර්ය ශ්‍රාවකයා තථාගතයන් වහන්සේ සිහි කරයි ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පිරුණු සිතක් නොවේ, ද්වේෂයෙන් පිරුණු සිතක් නොවේ, මෝහයෙන් පිරුණු සිතක් නොවේ; ඒ සමයෙහි ඔහුගේ සිත තථාගතයන් වහන්සේ අරභයා ඍජු භාවයට පත් වූවක් ම වේ. මහානාමය, ඍජු භාවයට පත් වූ සිත් ඇති ආර්ය ශ්‍රාවකයා අර්ථය අවබෝධ කිරීම ලබයි, ධර්මය අවබෝධ කිරීම ලබයි, ධර්මයෙන් යුක්ත වූ ප්‍රමෝදය ලබයි. ප්‍රමුදිත වූවහුට ප්‍රීතිය උපදී, ප්‍රීතිමත් සිත් ඇතිවූවහුගේ කය සංහිඳේ, සංහිඳුණු කය ඇතිවූවහු සැපය විඳියි, සැපයෙන් යුතු වූවහුගේ සිත සමාධිමත් වේ. මහානාමය, ඔබ මේ බුද්ධානුස්සතිය ගමන් කරමින් සිටියදී ද, සිටගෙන සිටියදී ද, වාඩි වී සිටියදී ද, නිදාගෙන සිටියදී ද, කාර්යයක යෙදී සිටියදී ද, දරුවන් සමග ගෘහ ජීවිතය ගත කරමින් සිටියදී ද, වර්ධනය කළ යුතු ය.\n\nතවද, මහානාමය, ඔබ ධර්මය සිහි කළ යුතු ය... (යනාදී වශයෙන්) ... සංඝයා සිහි කළ යුතු ය... (යනාදී වශයෙන්) ... තමන්ගේ සීලය සිහි කළ යුතු ය... (යනාදී වශයෙන්) ... තමන්ගේ ත්‍යාගය සිහි කළ යුතු ය... (යනාදී වශයෙන්) ... දෙවියන් සිහි කළ යුතු ය – ‘චාතුමහාරාජික දෙවිවරු වෙති... (යනාදී වශයෙන්) ... ඊට ඉහළින් ද දෙවිවරු වෙති. යම් ආකාරයක ශ්‍රද්ධාවකින් යුක්ත වූ ඒ දෙවිවරු මෙයින් චුත වී එහි උපන්නාහු ද, මා තුළ ද එවැනි ශ්‍රද්ධාවක් පවතී. යම් ආකාරයක සීලයකින්... ශ්‍රැතයකින්... ත්‍යාගයකින්... ප්‍රඥාවකින් යුක්ත වූ ඒ දෙවිවරු මෙයින් චුත වී එහි උපන්නාහු ද, මා තුළ ද එවැනි ප්‍රඥාවක් පවතී’ යනුවෙනි. මහානාමය, යම් සමයෙක ආර්ය ශ්‍රාවකයා තමන්ගේ ද, ඒ දෙවිවරුන්ගේ ද ශ්‍රද්ධාව ද, සීලය ද, ශ්‍රැතය ද, ත්‍යාගය ද, ප්‍රඥාව ද සිහි කරයි ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පිරුණු සිතක් නොවේ, ද්වේෂයෙන් පිරුණු සිතක් නොවේ, මෝහයෙන් පිරුණු සිතක් නොවේ; ඒ සමයෙහි ඔහුගේ සිත දෙවියන් අරභයා ඍජු භාවයට පත් වූවක් ම වේ. මහානාමය, ඍජු භාවයට පත් වූ සිත් ඇති ආර්ය ශ්‍රාවකයා අර්ථය අවබෝධ කිරීම ලබයි, ධර්මය අවබෝධ කිරීම ලබයි, ධර්මයෙන් යුක්ත වූ ප්‍රමෝදය ලබයි. ප්‍රමුදිත වූවහුට ප්‍රීතිය උපදී, ප්‍රීතිමත් සිත් ඇතිවූවහුගේ කය සංහිඳේ, සංහිඳුණු කය ඇතිවූවහු සැපය විඳියි, සැපයෙන් යුතු වූවහුගේ සිත සමාධිමත් වේ. මහානාමය, ඔබ මේ දෙවතානුස්සතිය ගමන් කරමින් සිටියදී ද, සිටගෙන සිටියදී ද, වාඩි වී සිටියදී ද, නිදාගෙන සිටියදී ද, කාර්යයක යෙදී සිටියදී ද, දරුවන් සමග ගෘහ ජීවිතය ගත කරමින් සිටියදී ද, වර්ධනය කළ යුතු ය.”",
      "paliTitle": "Dutiyamahānāmasuttaṃ"
    },
    {
      "number": 13,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Tena kho pana samayena bhagavā sāvatthiyaṃ vassāvāsaṃ upagantukāmo hoti [ahosi (ka.)]. Assosi kho nandiyo sakko – ‘‘bhagavā kira sāvatthiyaṃ vassāvāsaṃ upagantukāmo’’ti. Atha kho nandiyassa sakkassa etadahosi – ‘‘yaṃnūnāhampi sāvatthiyaṃ vassāvāsaṃ upagaccheyyaṃ. Tattha kammantañceva adhiṭṭhahissāmi, bhagavantañca lacchāmi kālena kālaṃ dassanāyā’’ti. Atha kho bhagavā sāvatthiyaṃ vassāvāsaṃ upagacchi [upagañchi (sī. pī.)]. Nandiyopi kho sakko sāvatthiyaṃ vassāvāsaṃ upagacchi. Tattha kammantañceva adhiṭṭhāsi [adhiṭṭhāya (syā.), adhiṭṭhāti (ka.)], bhagavantañca labhi [lacchati (syā. ka.)] kālena kālaṃ dassanāya. Tena kho pana samayena sambahulā bhikkhū bhagavato cīvarakammaṃ karonti – ‘‘niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’’ti. Assosi kho nandiyo sakko – ‘‘sambahulā kira bhikkhū bhagavato cīvarakammaṃ karonti – ‘niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’’’ti. Atha kho nandiyo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho nandiyo sakko bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante – ‘sambahulā kira bhikkhū bhagavato cīvarakammaṃ karonti – niṭṭhitacīvaro bhagavā temāsaccayena cārikaṃ pakkamissatī’ti. Tesaṃ no, bhante, nānāvihārehi viharataṃ kenassa vihārena vihātabba’’nti? ‘‘Sādhu sādhu, nandiya! Etaṃ kho, nandiya, tumhākaṃ patirūpaṃ kulaputtānaṃ, yaṃ tumhe tathāgataṃ upasaṅkamitvā puccheyyātha – ‘tesaṃ no, bhante, nānāvihārehi viharataṃ kenassa vihārena vihātabba’nti? Saddho kho, nandiya, ārādhako hoti, no assaddho; sīlavā ārādhako hoti, no dussīlo; āraddhavīriyo ārādhako hoti, no kusīto; upaṭṭhitassati ārādhako hoti, no muṭṭhassati; samāhito ārādhako hoti, no asamāhito; paññavā ārādhako hoti, no duppañño. Imesu kho te, nandiya, chasu dhammesu patiṭṭhāya pañcasu dhammesu ajjhattaṃ sati upaṭṭhāpetabbā. ‘‘Idha tvaṃ, nandiya, tathāgataṃ anussareyyāsi – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi, satthā devamanussānaṃ buddho bhagavā’ti. Iti kho te, nandiya, tathāgataṃ ārabbha ajjhattaṃ sati upaṭṭhāpetabbā. ‘‘Puna caparaṃ tvaṃ, nandiya, dhammaṃ anussareyyāsi – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Iti kho te, nandiya, dhammaṃ ārabbha ajjhattaṃ sati upaṭṭhāpetabbā. ‘‘Puna caparaṃ tvaṃ, nandiya, kalyāṇamitte anussareyyāsi – ‘lābhā vata me, suladdhaṃ vata me, yassa me kalyāṇamittā anukampakā atthakāmā ovādakā anusāsakā’ti. Iti kho te, nandiya, kalyāṇamitte ārabbha ajjhattaṃ sati upaṭṭhāpetabbā. ‘‘Puna caparaṃ tvaṃ, nandiya, attano cāgaṃ anussareyyāsi – ‘lābhā vata me, suladdhaṃ vata me, yohaṃ maccheramalapariyuṭṭhitāya pajāya vigatamalamaccherena cetasā agāraṃ ajjhāvasāmi muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’ti. Iti kho te, nandiya, cāgaṃ ārabbha ajjhattaṃ sati upaṭṭhāpetabbā. ‘‘Puna caparaṃ tvaṃ, nandiya, devatā anussareyyāsi – ‘yā devatā atikkammeva kabaḷīkārāhārabhakkhānaṃ [kabaḷiṃkārabhakkhānaṃ (sī.), kabaḷīkārabhakkhānaṃ (syā. kaṃ. pī.)] devatānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapannā, tā karaṇīyaṃ attano na samanupassanti katassa vā paticayaṃ. Seyyathāpi, nandiya, bhikkhu asamayavimutto karaṇīyaṃ attano na samanupassati katassa vā paticayaṃ; evamevaṃ kho, nandiya, yā tā devatā atikkammeva kabaḷīkārāhārabhakkhānaṃ devatānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapannā, tā karaṇīyaṃ attano na samanupassanti katassa vā paticayaṃ. Iti kho te, nandiya, devatā ārabbha ajjhattaṃ sati upaṭṭhāpetabbā. ‘‘Imehi kho, nandiya, ekādasahi dhammehi samannāgato ariyasāvako pajahateva pāpake akusale dhamme, na upādiyati. Seyyathāpi, nandiya, kumbho nikkujjo [nikujjo (ka.)] vamateva udakaṃ, no vantaṃ paccāvamati [paccāmasati (syā.)]; seyyathāpi vā pana, nandiya, sukkhe tiṇadāye aggi mutto ḍahaññeva gacchati, no daḍḍhaṃ paccudāvattati; evamevaṃ kho, nandiya, imehi ekādasahi dhammehi samannāgato ariyasāvako pajahateva pāpake akusale dhamme, na upādiyatī’’ti. Tatiyaṃ.",
      "english": "At one time, the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Nigrodha Park. Now at that time, the Blessed One intended to undertake the Rains Retreat in Sāvatthī. Nandiya the Sakyan heard: ‘Indeed, the Blessed One intends to undertake the Rains Retreat in Sāvatthī.’ Then it occurred to Nandiya the Sakyan: ‘What if I too were to undertake the Rains Retreat in Sāvatthī? There I could attend to my affairs, and I would also get to see the Blessed One from time to time.’ Then the Blessed One undertook the Rains Retreat in Sāvatthī. And Nandiya the Sakyan also undertook the Rains Retreat in Sāvatthī. There he attended to his affairs and also got to see the Blessed One from time to time. Now at that time, many bhikkhus were making robes for the Blessed One, thinking: ‘Once the Blessed One has finished his robes, he will set out on tour after three months.’ Nandiya the Sakyan heard: ‘Indeed, many bhikkhus are making robes for the Blessed One, thinking: \"Once the Blessed One has finished his robes, he will set out on tour after three months.\"’ Then Nandiya the Sakyan approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, Nandiya the Sakyan said to the Blessed One: ‘I have heard, Venerable Sir, that many bhikkhus are making robes for the Blessed One, thinking: \"Once the Blessed One has finished his robes, he will set out on tour after three months.\" Venerable Sir, for those of us who dwell in various abodes, by what abiding should we abide?’\n\n‘Good, good, Nandiya! It is fitting for you, as sons of noble families, that you should approach the Tathāgata and ask: \"Venerable Sir, for those of us who dwell in various abodes, by what abiding should we abide?\" Nandiya, one who has faith is a successful practitioner, not one without faith; one who is virtuous is a successful practitioner, not one who is unvirtuous; one who has aroused energy is a successful practitioner, not one who is lazy; one who has established mindfulness is a successful practitioner, not one who is heedless; one who is concentrated is a successful practitioner, not one who is unconcentrated; one who is wise is a successful practitioner, not one who is unwise. Nandiya, having established yourself in these six qualities, mindfulness should be established inwardly regarding five further qualities.\n\n‘Here, Nandiya, you should recollect the Tathāgata thus: “Indeed, the Blessed One is an Arahant, perfectly enlightened, endowed with knowledge and conduct, the Fortunate One, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Buddha, the Blessed One.” Thus, Nandiya, mindfulness should be established inwardly with regard to the Tathāgata.\n\n‘Furthermore, Nandiya, you should recollect the Dhamma thus: “The Dhamma proclaimed by the Blessed One is well-expounded, visible here and now, immediate, inviting one to come and see, onward-leading, to be personally realized by the wise.” Thus, Nandiya, mindfulness should be established inwardly with regard to the Dhamma.\n\n‘Furthermore, Nandiya, you should recollect your noble friends thus: “It is indeed my gain, truly well-obtained for me, that I have noble friends who are compassionate, welfare-seeking, advising, and instructing.” Thus, Nandiya, mindfulness should be established inwardly with regard to noble friends.\n\n‘Furthermore, Nandiya, you should recollect your own generosity thus: “It is indeed my gain, truly well-obtained for me, that I, though dwelling in a householder’s life among a populace engrossed in the defilement of stinginess, dwell with a mind free from the defilement of stinginess, being open-handed, pure-handed, delighting in relinquishing, responsive to requests, and delighting in the distribution of gifts.” Thus, Nandiya, mindfulness should be established inwardly with regard to your generosity.\n\n‘Furthermore, Nandiya, you should recollect the devas thus: “Those devas who have surpassed the companionship of devas who feed on gross food, and have reappeared in a mind-made body, they do not perceive any duty for themselves, nor any accumulation of what has been done.” Just as, Nandiya, a bhikkhu liberated from defilements at the opportune moment does not perceive any duty for himself, nor any accumulation of what has been done; in the same way, Nandiya, those devas who have surpassed the companionship of devas who feed on gross food and have reappeared in a mind-made body, they do not perceive any duty for themselves, nor any accumulation of what has been done. Thus, Nandiya, mindfulness should be established inwardly with regard to devas.\n\n‘Nandiya, an noble disciple endowed with these eleven qualities abandons unwholesome deeds and does not acquire them.’\n\nJust as, O Nandiya, an overturned pot simply pours out water, and does not draw back what it has poured out; or again, O Nandiya, a fire, once released into a dry grass thicket, simply burns and moves on, and does not return to what it has burnt; in the same way, O Nandiya, a noble disciple endowed with these eleven qualities simply abandons evil, unwholesome states, and does not take them up again.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ ශාක්‍ය දේශයේ කපිලවස්තු නුවර නිග්‍රෝධාරාමයේ වැඩසිටියාහ. එම අවස්ථාවේ දී භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැසි සමය ගත කිරීමට අපේක්ෂාවෙන් සිටියාහ. නන්දිය නම් ශාක්‍යයාට \"භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැසි සමය ගත කිරීමට අපේක්ෂාවෙන් සිටින සේකැයි\" අසන්නට ලැබුණි. එවිට නන්දිය ශාක්‍යයාට මෙවැනි අදහසක් ඇති විය: \"කවර හෙයින් මම ද සැවැත් නුවර වැසි සමය ගත කිරීමට නොයන්නෙම් ද? එහිදී මගේ කටයුතු ද ඉටු කර ගන්නෙමි. කලින් කලට භාග්‍යවතුන් වහන්සේ ද දැකබලා ගැනීමට අවස්ථාව ද ලබන්නෙමි.\" ඉන්පසු භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැසි සමය ගත කිරීමට වැඩම කළ සේක. නන්දිය ශාක්‍යයා ද සැවැත් නුවර වැසි සමය ගත කිරීමට ගියේය. ඔහු එහිදී සිය කටයුතු ද ඉටු කර ගත් අතර, කලින් කලට භාග්‍යවතුන් වහන්සේ දැකබලා ගැනීමට අවස්ථාව ද ලැබුවේය. එම අවස්ථාවේ දී බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේගේ සිවුරු කටයුතු කරමින් සිටියේ \"භාග්‍යවතුන් වහන්සේ සිවුරු කටයුතු නිමවා තෙමසකින් චාරිකාවේ වඩින සේකැයි\" සිතාගෙනය. නන්දිය ශාක්‍යයාට \"බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේගේ සිවුරු කටයුතු කරමින් සිටින්නේ ‘භාග්‍යවතුන් වහන්සේ සිවුරු කටයුතු නිමවා තෙමසකින් චාරිකාවේ වඩින සේකැයි’ යන අදහසින් බව\" අසන්නට ලැබුණි.\n\nඉන්පසු නන්දිය ශාක්‍යයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි නන්දිය ශාක්‍යයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, මට අසන්නට ලැබුණි ‘බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේගේ සිවුරු කටයුතු කරමින් සිටින්නේ, භාග්‍යවතුන් වහන්සේ සිවුරු කටයුතු නිමවා තෙමසකින් චාරිකාවේ වඩින සේකැයි’ යන අදහසින් බව. ස්වාමීනි, නානාවිධ විහරණයන්ගෙන් වාසය කරන අප විසින් කවර විහරණයකින් වාසය කළ යුතු දැයි?\"\n\n\"හොඳයි, හොඳයි නන්දිය! නන්දිය, යම් හෙයකින් නුඹලා තථාගතයන් වහන්සේ වෙත පැමිණ, 'ස්වාමීනි, නානාවිධ විහරණයන්ගෙන් වාසය කරන අප විසින් කවර විහරණයකින් වාසය කළ යුතු දැයි?' විචාරන්නාහු නම්, එය කුලපුත්‍රයන් වන නුඹලාට සුදුසු වන්නේය. නන්දිය, ශ්‍රද්ධාවන්ත තැනැත්තා (මාර්ග ඵල) අවබෝධ කරගන්නෙකු වේ. ශ්‍රද්ධාව නැති තැනැත්තා (අවබෝධ කරගන්නෙකු) නොවේ. සීලවන්ත තැනැත්තා (මාර්ග ඵල) අවබෝධ කරගන්නෙකු වේ. දුශ්ශීල තැනැත්තා (අවබෝධ කරගන්නෙකු) නොවේ. ආරම්භ කරන ලද වීර්යය ඇති තැනැත්තා (මාර්ග ඵල) අවබෝධ කරගන්නෙකු වේ. අලස තැනැත්තා (අවබෝධ කරගන්නෙකු) නොවේ. මනා සිහියෙන් යුක්ත තැනැත්තා (මාර්ග ඵල) අවබෝධ කරගන්නෙකු වේ. සිහිමුළා වූ තැනැත්තා (අවබෝධ කරගන්නෙකු) නොවේ. සමාධිගත තැනැත්තා (මාර්ග ඵල) අවබෝධ කරගන්නෙකු වේ. අසමාධිගත තැනැත්තා (අවබෝධ කරගන්නෙකු) නොවේ. ප්‍රඥාවන්ත තැනැත්තා (මාර්ග ඵල) අවබෝධ කරගන්නෙකු වේ. දුෂ්ප්‍රඥා ඇති තැනැත්තා (අවබෝධ කරගන්නෙකු) නොවේ. නන්දිය, නුඹ විසින් මේ ධර්මයන් සයෙහි පිහිටා, ධර්මයන් පසක් අරමුණු කරගෙන අධ්‍යාත්මික සිහිය පිහිටුවා ගත යුතුය.\"\n\n\"නන්දිය, මෙහිදී නුඹ තථාගතයන් වහන්සේ අනුස්මරණය කළ යුතුය – ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර, පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භගවා යන ගුණාංගවලින් යුක්ත සේක’ යනුවෙනි. නන්දිය, මෙසේ නුඹ විසින් තථාගතයන් වහන්සේ අරමුණු කරගෙන අධ්‍යාත්මික සිහිය පිහිටුවා ගත යුතුය.\"\n\n\"නන්දිය, තවද නුඹ ධර්මය අනුස්මරණය කළ යුතුය – ‘භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ, මේ අත්බැව්හිදීම දැකිය හැකි වූ, කල් නොයල් නැති වූ, ‘එව බලව’ යැයි කැඳවිය හැකි වූ, නිවනට පමුණුවනසුලු වූ, ප්‍රඥාවන්තයන් විසින් තම තමා තුළින්ම අවබෝධ කරගත යුතු වූ ධර්මයයි’ යනුවෙනි. නන්දිය, මෙසේ නුඹ විසින් ධර්මය අරමුණු කරගෙන අධ්‍යාත්මික සිහිය පිහිටුවා ගත යුතුය.\"\n\n\"නන්දිය, තවද නුඹ කල්‍යාණමිත්‍රයන් අනුස්මරණය කළ යුතුය – ‘මාගේ කල්‍යාණමිත්‍රයෝ අනුකම්පාවෙන් යුක්ත වෙති, හිතසුව කැමති වෙති, අවවාද දෙන්නාහු වෙති, අනුශාසනා කරන්නාහු වෙති. සැබවින්ම මට ලාභයකි, මට මනා කොට ලැබුණකි’ යනුවෙනි. නන්දිය, මෙසේ නුඹ විසින් කල්‍යාණමිත්‍රයන් අරමුණු කරගෙන අධ්‍යාත්මික සිහිය පිහිටුවා ගත යුතුය.\"\n\n\"නන්දිය, තවද නුඹ තමාගේ ත්‍යාගශීලී භාවය අනුස්මරණය කළ යුතුය – ‘සැබවින්ම මට ලාභයකි, මට මනා කොට ලැබුණකි! මම මසුරු මලයෙන් වෙලී ගිය බොහෝ මිනිසුන් අතර, මසුරු මලයෙන් තොර වූ සිත් ඇතිව, ගිහිගෙයි වාසය කරමි. මම පරිත්‍යාගශීලී වෙමි, පිරිසිදු අත් ඇති වෙමි, දන් දීමෙහි ප්‍රිය වෙමි, ඉල්ලා සිටීමට සුදුසු වෙමි, දානය බෙදා දීමෙහි ප්‍රිය වෙමි’ යනුවෙනි. නන්දිය, මෙසේ නුඹ විසින් තමාගේ ත්‍යාගශීලී භාවය අරමුණු කරගෙන අධ්‍යාත්මික සිහිය පිහිටුවා ගත යුතුය.\"\n\n\"නන්දිය, තවද නුඹ දෙවියන් අනුස්මරණය කළ යුතුය – ‘යම් දෙවියෝ කබලිංකාරාහාරය වළඳන දෙවියන්ගේ සහභාගිත්වය ඉක්මවා, වෙනත් මනෝමය ශරීරයක් උපදවා ගත්තාහු ද, ඔවුහු තමාගේ කළයුත්තක් (වටිනා දේ) හෝ කරන ලද දේවලින් ලැබිය යුතු ප්‍රතිලාභයක් (ඵලයක්) හෝ නොදකිති. නන්දිය, යම් සේ විමුක්තිය නොලැබූ භික්ෂුවක් තමාගේ කළයුත්තක් හෝ කරන ලද දේවලින් ලැබිය යුතු ප්‍රතිලාභයක් හෝ නොදකින්නේ ද, එපරිද්දෙන්ම නන්දිය, යම් දෙවියෝ කබලිංකාරාහාරය වළඳන දෙවියන්ගේ සහභාගිත්වය ඉක්මවා, වෙනත් මනෝමය ශරීරයක් උපදවා ගත්තාහු ද, ඔවුහු තමාගේ කළයුත්තක් හෝ කරන ලද දේවලින් ලැබිය යුතු ප්‍රතිලාභයක් හෝ නොදකිති. නන්දිය, මෙසේ නුඹ විසින් දෙවියන් අරමුණු කරගෙන අධ්‍යාත්මික සිහිය පිහිටුවා ගත යුතුය.\"\n\n\"නන්දිය, මේ එකොළොස් ධර්මයන්ගෙන් යුක්ත වූ ආර්ය ශ්‍රාවකයා පවිටු අකුසල ධර්මයන් අත්හරින්නේම ය, ඒවා උපදවා නොගනී.\"\n\nනන්දිය, යම්සේ පෙරළා තැබූ භාජනයක් ඇතුළේ ඇති ජලය ඉවතට වමාරා දමන්නේද, වමාරා දැමූ ජලය ආපසු ඇතුළට උරා නොගන්නේද; එසේම, නන්දිය, වියළි තණ ගොඩකට මුදාහළ ගින්නක් දවාගෙනම ඉදිරියට යන්නේද, දවා දැමූ දෙය ආපසු නොහැරීද; ඒ ආකාරයෙන්ම, නන්දිය, මෙකී එකොළොස් ධර්මයන්ගෙන් යුක්ත වූ ආර්යශ‍්‍රාවකයා පවිටු අකුසල ධර්මයන් ප‍්‍රහීණ කරන්නේමයි, ඒවා යළි අත් නොපතන්නේය.",
      "paliTitle": "Nandiyasuttaṃ"
    },
    {
      "number": 14,
      "pali": "Atha kho āyasmā subhūti saddhena bhikkhunā saddhiṃ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ subhūtiṃ bhagavā etadavoca – ‘‘ko nāmāyaṃ [ko nāmo ayaṃ (sī. ka.), ko nāma ayaṃ (syā. kaṃ.)], subhūti, bhikkhū’’ti? ‘‘Saddho nāmāyaṃ, bhante, bhikkhu, sudattassa [saddhassa (sī. syā. kaṃ. pī.)] upāsakassa putto, saddhā agārasmā anagāriyaṃ pabbajito’’ti. ‘‘Kacci panāyaṃ, subhūti, saddho bhikkhu sudattassa upāsakassa putto saddhā agārasmā anagāriyaṃ pabbajito sandissati saddhāpadānesū’’ti? ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo, yaṃ bhagavā saddhassa saddhāpadānāni bhāseyya. Idānāhaṃ jānissāmi yadi vā ayaṃ bhikkhu sandissati saddhāpadānesu yadi vā no’’ti. ‘‘Tena hi, subhūti, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā subhūti bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha, subhūti, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Yampi, subhūti, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu bahussuto hoti sutadharo sutasannicayo; ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Yampi, subhūti, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. Yampi, subhūti, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato khamo padakkhiṇaggāhī anusāsaniṃ. Yampi, subhūti, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato khamo padakkhiṇaggāhī anusāsaniṃ, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tatra dakkho hoti analaso tatrupāyāya vīmaṃsāya samannāgato alaṃ kātuṃ alaṃ saṃvidhātuṃ. Yampi, subhūti, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tatra dakkho hoti analaso tatrupāyāya vīmaṃsāya samannāgato alaṃ kātuṃ alaṃ saṃvidhātuṃ, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu dhammakāmo hoti piyasamudāhāro abhidhamme abhivinaye uḷārapāmojjo. Yampi, subhūti, bhikkhu dhammakāmo hoti piyasamudāhāro abhidhamme abhivinaye uḷārapāmojjo, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yampi, subhūti, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Yampi, subhūti, bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattārīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi, subhūti, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ, ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Yampi, subhūti, bhikkhu dibbena cakkhunā visuddhena…pe… yathākammūpage satte pajānāti, idampi, subhūti, saddhassa saddhāpadānaṃ hoti. ‘‘Puna caparaṃ, subhūti, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampi, subhūti, bhikkhu āsavānaṃ khayā… pe… sacchikatvā upasampajja viharati, idampi, subhūti, saddhassa saddhāpadānaṃ hotī’’ti. Evaṃ vutte āyasmā subhūti bhagavantaṃ etadavoca – ‘‘yānimāni, bhante, bhagavatā saddhassa saddhāpadānāni bhāsitāni, saṃvijjanti tāni imassa bhikkhuno, ayañca bhikkhu etesu sandissati. ‘‘Ayaṃ, bhante, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. ‘‘Ayaṃ, bhante, bhikkhu bahussuto hoti sutadharo sutasannicayo; ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. ‘‘Ayaṃ, bhante, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. ‘‘Ayaṃ, bhante, bhikkhu suvaco hoti…pe… anusāsaniṃ. ‘‘Ayaṃ, bhante, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tattha dakkho hoti analaso tatrupāyāya vīmaṃsāya samannāgato alaṃ kātuṃ alaṃ saṃvidhātuṃ. ‘‘Ayaṃ, bhante, bhikkhu dhammakāmo hoti piyasamudāhāro abhidhamme abhivinaye uḷārapāmojjo. ‘‘Ayaṃ, bhante, bhikkhu āraddhavīriyo viharati…pe… thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. ‘‘Ayaṃ, bhante, bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. ‘‘Ayaṃ, bhante, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘Ayaṃ, bhante, bhikkhu dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti. ‘‘Ayaṃ, bhante, bhikkhu āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Yānimāni, bhante, bhagavatā saddhassa saddhāpadānāni bhāsitāni, saṃvijjanti tāni imassa bhikkhuno, ayañca bhikkhu etesu sandissatī’’ti. ‘‘Sādhu sādhu, subhūti! Tena hi tvaṃ, subhūti, iminā ca saddhena bhikkhunā saddhiṃ vihareyyāsi. Yadā ca tvaṃ, subhūti, ākaṅkheyyāsi tathāgataṃ dassanāya, iminā saddhena bhikkhunā saddhiṃ upasaṅkameyyāsi tathāgataṃ dassanāyā’’ti. Catutthaṃ.",
      "english": "Then, the venerable Subhuti, together with the monk named Saddha, approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As the venerable Subhuti was sitting to one side, the Blessed One said to him: \"What is the name of this monk, Subhuti?\" \"Venerable sir, this monk's name is Saddha. He is the son of the lay follower Sudatta, and out of faith, he went forth from the home life into homelessness.\" \"Does this monk, Subhuti, Saddha by name, son of the lay follower Sudatta, who went forth out of faith from the home life into homelessness, correspond to the descriptions of qualities that inspire faith?\" \"Now is the time, Blessed One! Now is the time, Fortunate One, for the Blessed One to speak of the qualities of Saddha that inspire faith. Then I will know whether this monk corresponds to the descriptions of qualities that inspire faith or not.\" \"In that case, Subhuti, listen, attend carefully; I shall speak.\" \"Yes, Venerable sir,\" replied the venerable Subhuti to the Blessed One. The Blessed One spoke thus:\n\n\"Here, Subhuti, a monk is virtuous. He dwells restrained by the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, and undertaking the training rules. That a monk is virtuous, dwells restrained by the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, and undertaking the training rules – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, a monk is learned, retaining what he has heard and accumulating what he has heard. Those teachings that are beautiful in the beginning, beautiful in the middle, beautiful in the end, conveying the meaning and the letter, proclaiming a wholly complete and purified holy life – such teachings are well-learned by him, retained, familiar through speech, mentally examined, and well-penetrated by understanding. That a monk is learned, retaining what he has heard and accumulating what he has heard, and those teachings that are beautiful in the beginning, beautiful in the middle, beautiful in the end, conveying the meaning and the letter, proclaiming a wholly complete and purified holy life, are well-learned by him, retained, familiar through speech, mentally examined, and well-penetrated by understanding – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, a monk has good friends, good companions, and good associates. That a monk has good friends, good companions, and good associates – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, a monk is easy to admonish, endowed with qualities that make him easy to admonish, patient, and receptive to instruction. That a monk is easy to admonish, endowed with qualities that make him easy to admonish, patient, and receptive to instruction – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, regarding the various duties of his fellow practitioners, he is skillful and not lazy; he is endowed with a discerning inquiry into the means, able to perform and able to arrange them. That a monk regarding the various duties of his fellow practitioners, is skillful and not lazy, endowed with a discerning inquiry into the means, able to perform and able to arrange them – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, a monk is fond of the Dhamma, delightful in discourse, and has great joy in the Abhidhamma and Abhivinaya. That a monk is fond of the Dhamma, delightful in discourse, and has great joy in the Abhidhamma and Abhivinaya – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, a monk dwells with aroused energy for the abandonment of unskillful states and for the acquisition of skillful states; he is strong, firm in exertion, and does not lay aside the burden in skillful states. That a monk dwells with aroused energy for the abandonment of unskillful states and for the acquisition of skillful states, strong, firm in exertion, and not laying aside the burden in skillful states – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, a monk is a regular obtainer, an obtainer without difficulty, an obtainer without trouble, of the four jhānas, which are mental attainments and a pleasant abiding in this very life. That a monk is a regular obtainer, an obtainer without difficulty, an obtainer without trouble, of the four jhānas, which are mental attainments and a pleasant abiding in this very life – this too, Subhuti, is a quality of Saddha that inspires faith.\n\n\"Furthermore, Subhuti, a monk recalls his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. He recalls: ‘There I was named thus, of such a clan, with such a complexion, such was my food, such was my experience of pleasure and pain, such was the end of my life. Passing away from there, I reappeared yonder. There too I was named thus, of such a clan, with such a complexion, such was my food, such was my experience of pleasure and pain, such was the end of my life. Passing away from there, I have reappeared here.’\"\n\nThus, he recollects his manifold past lives with all their aspects and details. And furthermore, Subhūti, that a monk recollects his manifold past lives – that is to say, one birth, two births, and so forth, thus recollecting his manifold past lives with all their aspects and details. This too, Subhūti, is a ground for the faith of one who has faith.\n\n\"Furthermore, Subhūti, a monk, with the divine eye, purified and surpassing human sight, sees beings dying and being reborn, inferior and superior, beautiful and ugly, well-faring and ill-faring, and he understands beings according to their deeds: ‘Indeed, these good sirs, these beings are endowed with bodily misconduct, verbal misconduct, mental misconduct; they are revilers of the Noble Ones; they hold wrong views, and undertake actions based on wrong views. With the breakup of the body, after death, they are reborn in a state of deprivation, a bad destination, a lower realm, hell. Or again, these good sirs, these beings are endowed with bodily good conduct, verbal good conduct, mental good conduct; they are not revilers of the Noble Ones; they hold right views, and undertake actions based on right views. With the breakup of the body, after death, they are reborn in a good destination, a heavenly world.’\" Thus, with the divine eye, purified and surpassing human sight, he sees beings dying and being reborn, inferior and superior, beautiful and ugly, well-faring and ill-faring, and he understands beings according to their deeds. And furthermore, Subhūti, that a monk, with the divine eye, purified and surpassing human sight, sees beings dying and being reborn, inferior and superior, beautiful and ugly, well-faring and ill-faring, and understands beings according to their deeds – this too, Subhūti, is a ground for the faith of one who has faith.\n\n\"Furthermore, Subhūti, a monk, by the destruction of the taints, enters and dwells in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life. And furthermore, Subhūti, that a monk, by the destruction of the taints, enters and dwells in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life – this too, Subhūti, is a ground for the faith of one who has faith.\"\n\nWhen this was said, Venerable Subhūti said to the Blessed One: \"Venerable sir, these grounds for faith that the Blessed One has spoken of for one who has faith – they are found in this monk, and this monk corresponds to them.\n\n\"Venerable sir, this monk is virtuous; he dwells restrained by the Pātimokkha rules, accomplished in conduct and resort, seeing danger even in the slightest faults, and trains himself by undertaking the training precepts.\n\n\"Venerable sir, this monk is learned, a preserver of what he has heard, one who has accumulated what he has heard; those teachings which are good in the beginning, good in the middle, and good in the end, conveying the meaning and the letter, proclaiming a perfectly complete and purified holy life – such teachings he has learned thoroughly, preserved, recited by word of mouth, pondered over in his mind, and penetrated well by direct view.\n\n\"Venerable sir, this monk has noble friends, noble companions, noble associates.\n\n\"Venerable sir, this monk is amenable to correction, possessing qualities that make it easy to give instruction, accepting instruction with patience.\n\n\"Venerable sir, this monk, regarding the various duties of his fellow practitioners, is skillful and not lazy in them, endowed with a method of inquiry suitable for the task, capable of doing and capable of arranging.\n\n\"Venerable sir, this monk is fond of the Dhamma, delighting in discourse, taking great joy in the Abhidhamma and Abhivinaya.\n\n\"Venerable sir, this monk dwells with aroused energy, vigorously striving to overcome unwholesome states and cultivate wholesome ones, possessing strength, firm in exertion, not laying aside the burden in regard to wholesome states.\n\n\"Venerable sir, this monk is a frequent obtainer of the four jhānas – those pertaining to the higher mind, a pleasant dwelling in this very life – obtaining them whenever he wishes, without difficulty, without trouble.\n\n\"Venerable sir, this monk recollects his manifold past lives – that is to say, one birth, two births, and so forth, thus he recollects manifold past lives with all their aspects and details.\n\n\"Venerable sir, this monk, with the divine eye, purified and surpassing human sight, sees beings dying and being reborn, inferior and superior, beautiful and ugly, well-faring and ill-faring, and understands beings according to their deeds.\n\n\"Venerable sir, this monk, by the destruction of the taints, enters and dwells in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life. These grounds for faith, Venerable sir, that the Blessed One has spoken of for one who has faith – they are found in this monk, and this monk corresponds to them.\"\n\n\"Excellent, excellent, Subhūti! Therefore, Subhūti, you should dwell with this monk of faith. And whenever you, Subhūti, wish to see the Tathāgata, you should approach the Tathāgata accompanied by this monk of faith.\"",
      "sinhala": "එවිට ආයුෂ්මත් සුභූති තෙරණුවෝ සද්ධ නම් භික්ෂුව සමඟ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ආයුෂ්මත් සුභූති තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “සුභූතිය, මේ භික්ෂුවගේ නම කවරේද?” “වහන්ස, මේ භික්ෂුව සද්ධ නම් වේ. ඔහු සුදත්ත නම් උපාසකගේ පුත්‍රයා වන අතර, ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වූවෙකි.”\n\n“සුභූතිය, මේ සද්ධ නම් භික්ෂුව, සුදත්ත උපාසකගේ පුත්‍රයා, ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වූවා, ශ්‍රද්ධාවේ ගුණාංග අතර පෙනී සිටීද?” “භාග්‍යවතුන් වහන්ස, මේ සඳහා මෙය සුදුසුම කාලයයි; සුගතයන් වහන්ස, භාග්‍යවතුන් වහන්සේ සද්ධ නම් භික්ෂුවගේ ශ්‍රද්ධාවේ ගුණාංග දේශනා කරන පිණිස මෙය සුදුසුම කාලයයි. එවිට මම දැනගන්නෙමි, මේ භික්ෂුව ශ්‍රද්ධාවේ ගුණාංග අතර පෙනී සිටීද නැද්ද කියා.” “එසේ නම්, සුභූතිය, අසන්න, මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.” “එසේය, වහන්ස” යි ආයුෂ්මත් සුභූති තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“මෙහිලා, සුභූතිය, භික්ෂුව සීලවන්ත වේ. හෙතෙම ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර සම්පන්න ගෝචර සම්පන්න වූයේ, අණු මාත්‍ර වූ වරදෙහිද භය දක්නා සුළු වූයේ, ශික්ෂා පද සමාදන්ව හික්මෙමින් වාසය කරයි. සුභූතිය, යම් මේ භික්ෂුව සීලවන්ත වේද, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර සම්පන්න ගෝචර සම්පන්න වූයේ, අණු මාත්‍ර වූ වරදෙහිද භය දක්නා සුළු වූයේ, ශික්ෂා පද සමාදන්ව හික්මෙමින් වාසය කරයිද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව බහුශ්‍රැත වේ. ඇසූ දේ දරාගන්නා සුළුය. ඇසූ දේ රැස්කරගන්නා සුළුය. යම් ධර්ම දේශනා මුල මැනවිද, මැද මැනවිද, කෙළවර මැනවිද, අර්ථ සහිතව, ව්‍යංජන සහිතව, මුළුමනින්ම පිරිපුන් වූ පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරයිද, එවැනි ධර්මයන් ඔහු විසින් බහුල වශයෙන් අසන ලද්දාහු වෙති, ධාරණය කර ගන්නා ලද්දාහු වෙති, වචනයෙන් පුරුදු කරන ලද්දාහු වෙති, සිතින් මෙනෙහි කරන ලද්දාහු වෙති, දෘෂ්ටියෙන් (ප්‍රඥාවෙන්) මනාව විනිවිදින ලද්දාහු වෙති. සුභූතිය, යම් මේ භික්ෂුව බහුශ්‍රැත වේද, ඇසූ දේ දරාගන්නා සුළුය, ඇසූ දේ රැස්කරගන්නා සුළුය, යම් ධර්ම දේශනා මුල මැනවිද, මැද මැනවිද, කෙළවර මැනවිද, අර්ථ සහිතව, ව්‍යංජන සහිතව, මුළුමනින්ම පිරිපුන් වූ පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරයිද, එවැනි ධර්මයන් ඔහු විසින් බහුල වශයෙන් අසන ලද්දාහු වෙති, ධාරණය කර ගන්නා ලද්දාහු වෙති, වචනයෙන් පුරුදු කරන ලද්දාහු වෙති, සිතින් මෙනෙහි කරන ලද්දාහු වෙති, දෘෂ්ටියෙන් (ප්‍රඥාවෙන්) මනාව විනිවිදින ලද්දාහු වේද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව කල්‍යාණ මිත්‍රයන් ඇත්තෙක් වේ. කල්‍යාණ සහායන් ඇත්තෙක් වේ. කල්‍යාණ සම්පවංකයන් (නොහොත් හොඳ ඇසුරක්) ඇත්තෙක් වේ. සුභූතිය, යම් මේ භික්ෂුව කල්‍යාණ මිත්‍රයන් ඇත්තෙක් වේද, කල්‍යාණ සහායන් ඇත්තෙක් වේද, කල්‍යාණ සම්පවංකයන් (නොහොත් හොඳ ඇසුරක්) ඇත්තෙක් වේද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව කීකරු වේ. පහසුවෙන් අවවාද කළ හැකි ගුණාංගවලින් යුක්ත වේ. ඉවසිලිවන්ත වේ. අනුශාසනාව දකුණු කොට පිළිගන්නා සුළු වේ. සුභූතිය, යම් මේ භික්ෂුව කීකරු වේද, පහසුවෙන් අවවාද කළ හැකි ගුණාංගවලින් යුක්ත වේද, ඉවසිලිවන්ත වේද, අනුශාසනාව දකුණු කොට පිළිගන්නා සුළු වේද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව තමාගේ සබ්‍රහ්මචාරීන්ගේ යම් නොයෙක් කටයුතු ඇද්ද, ඒවායෙහි දක්ෂ වේ. කම්මැලි නොවේ. ඒ කටයුතු කිරීමට සුදුසු ක්‍රමයක් විමසා බැලීමට සමත් ප්‍රඥාවෙන් යුක්ත වේ. ඒවා කිරීමට ද සමර්ථ වේ. ඒවා සංවිධානය කිරීමට ද සමර්ථ වේ. සුභූතිය, යම් මේ භික්ෂුව තමාගේ සබ්‍රහ්මචාරීන්ගේ යම් නොයෙක් කටයුතු ඇද්ද, ඒවායෙහි දක්ෂ වේද, කම්මැලි නොවේද, ඒ කටයුතු කිරීමට සුදුසු ක්‍රමයක් විමසා බැලීමට සමත් ප්‍රඥාවෙන් යුක්ත වේද, ඒවා කිරීමට ද සමර්ථ වේද, ඒවා සංවිධානය කිරීමට ද සමර්ථ වේද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව ධර්මයට කැමති වේ. ප්‍රිය වූ සාකච්ඡා ඇත්තේ වේ. අභිධර්මයෙහිද, අභිවිනයෙහිද, මහත් ප්‍රීතියෙන් යුක්ත වේ. සුභූතිය, යම් මේ භික්ෂුව ධර්මයට කැමති වේද, ප්‍රිය වූ සාකච්ඡා ඇත්තේ වේද, අභිධර්මයෙහිද, අභිවිනයෙහිද, මහත් ප්‍රීතියෙන් යුක්ත වේද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසද, කුසල ධර්මයන් සම්පූර්ණ කර ගැනීම පිණිසද, ආරම්භ කළ වීර්යයෙන් යුතුව වාසය කරයි. ශක්තිමත් වේ. දැඩි පරාක්‍රමයකින් යුක්ත වේ. කුසල ධර්මයන් සම්බන්ධයෙන් බර නොහලූයේ (අත් නොහළ වීර්යයෙන් යුක්ත වූයේ) වාසය කරයි. සුභූතිය, යම් මේ භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසද, කුසල ධර්මයන් සම්පූර්ණ කර ගැනීම පිණිසද, ආරම්භ කළ වීර්යයෙන් යුතුව වාසය කරයිද, ශක්තිමත් වේද, දැඩි පරාක්‍රමයකින් යුක්ත වේද, කුසල ධර්මයන් සම්බන්ධයෙන් බර නොහලූයේ වාසය කරයිද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව අභිචෛතසික වූ, දැහැමි සැප විහරණ වූ සිව් ධ්‍යානයන් කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නේ වේ. සුභූතිය, යම් මේ භික්ෂුව අභිචෛතසික වූ, දැහැමි සැප විහරණ වූ සිව් ධ්‍යානයන් කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නේ වේද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවේ ගුණාංගයක් වේ.\n\nතවද, සුභූතිය, භික්ෂුව නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි. එනම්: එක් ආත්ම භවයක්, ආත්ම භවයන් දෙකක්, ආත්ම භවයන් තුනක්, ආත්ම භවයන් හතරක්, ආත්ම භවයන් පහක්, ආත්ම භවයන් දහයක්, ආත්ම භවයන් විස්සක්, ආත්ම භවයන් තිහක්, ආත්ම භවයන් හතළිහක්, ආත්ම භවයන් පනහක්, ආත්ම භවයන් සියයක්, ආත්ම භවයන් දහසක්, ආත්ම භවයන් ලක්ෂයක්, නොයෙක් සංවට්ට කල්පයන්, නොයෙක් විවට්ට කල්පයන්, නොයෙක් සංවට්ට-විවට්ට කල්පයන් මෙසේ සිහි කරයි: ‘එහි මම මෙවැනි නමක් ඇති, මෙවැනි ගෝත්‍රයක් ඇති, මෙවැනි වර්ණයක් ඇති, මෙවැනි ආහාරයක් අනුභව කළ, මෙවැනි සැප දුක් විඳි, මෙවැනි ආයුෂ කෙළවරක් ඇතිව සිටියෙමි. එතැනින් චුත වී අසුවල් තැන උපන්නෙමි; එහිද මම මෙවැනි නමක් ඇති, මෙවැනි ගෝත්‍රයක් ඇති, මෙවැනි වර්ණයක් ඇති, මෙවැනි ආහාරයක් අනුභව කළ, මෙවැනි සැප දුක් විඳි, මෙවැනි ආයුෂ කෙළවරක් ඇතිව සිටියෙමි. එතැනින් චුත වී මෙහි උපන්නෙමි’ යැයි.\n\nමේ අයුරින් ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පූර්ව නිවාසයන් සිහි කරයි. සුභූතිය, යම් භික්‍ෂුවක් බොහෝ ආකාරයෙන්, එනම්, එක් ආත්මයක්, දෙආත්මයක්... ආදී වශයෙන් ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පූර්ව නිවාසයන් සිහි කරයිද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවට පාදක වීමට හේතුවක් වේ.\n\nතවද, සුභූතිය, යම් භික්‍ෂුවක් පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින්, චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, මනා පැහැයක් ඇති, දුර්වර්ණ වූ, සුගතියට ගිය, දුගතියට ගිය, තමන්ගේ කර්මයන්ට අනුරූපව ගමන් කරන සත්වයන් දැක, ඔවුන් හඳුනා ගනී – ‘අහෝ, මේ පින්වත් සත්වයෝ කාය දුශ්චරිතයෙන්, වචී දුශ්චරිතයෙන්, මනෝ දුශ්චරිතයෙන් යුක්ත වූවෝය, ආර්යයන්ට අපහාස කරන්නෝය, මිත්‍යා දෘෂ්ටිකයෝය, මිත්‍යා දෘෂ්ටික කර්ම සමාදානයෙන් යුක්ත වූවෝය. ඔවුහු කයින් භේද වී, මරණයෙන් පසුව අපාය, දුර්ගති, විනිපාත, නිරය යන තැන්වල උපන්නාහුය. මේ පින්වත් සත්වයෝ නම් කාය සුචරිතයෙන්, වචී සුචරිතයෙන්, මනෝ සුචරිතයෙන් යුක්ත වූවෝය, ආර්යයන්ට අපහාස නොකරන්නෝය, සම්මා දෘෂ්ටිකයෝය, සම්මා දෘෂ්ටික කර්ම සමාදානයෙන් යුක්ත වූවෝය. ඔවුහු කයින් භේද වී, මරණයෙන් පසුව සුගති, ස්වර්ග ලෝකයන්හි උපන්නාහුය’ යනුවෙනි. මේ අයුරින් පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, මනා පැහැයක් ඇති, දුර්වර්ණ වූ, සුගතියට ගිය, දුගතියට ගිය, තමන්ගේ කර්මයන්ට අනුරූපව ගමන් කරන සත්වයන් දැක, හඳුනා ගනී. සුභූතිය, යම් භික්‍ෂුවක් පිරිසිදු වූ දිවැසින් කර්මානුරූපව ගමන් කරන සත්වයන් හඳුනා ගනීද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවට පාදක වීමට හේතුවක් වේ.\n\nතවද, සුභූතිය, යම් භික්‍ෂුවක් ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය, ප්‍රඥා විමුක්තිය මෙලොවදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කරයිද, සුභූතිය, යම් භික්‍ෂුවක් ආශ්‍රවයන් ක්ෂය කිරීමෙන් ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කරයිද, සුභූතිය, මෙයද ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවට පාදක වීමට හේතුවක් වේ.\n\nමෙසේ පැවසූ කල්හි, ආයුෂ්මත් සුභූති භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – ‘‘භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවට පාදක වන බවට දේශනා කරන ලද මේ කරුණු මේ භික්‍ෂුව තුළ පවතී. මේ භික්‍ෂුව ඒ කරුණු වලට අනුරූප වේ. භාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව සීලවන්තයෙකි, ප්‍රාතිමෝක්‍ෂ සංවරයෙන් සංවර වූයේ වාසය කරයි, ආචාර සම්පන්නයෙකි, ගෝචර සම්පන්නයෙකි, අණු මාත්‍ර වරදෙහිද බිය දකින්නේය, ශික්‍ෂා පදයන් සමාදන්ව හික්මෙයි.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව බහුශ්‍රැතයෙකි, ඇසූ දේ සිහි කරන්නෙකි, ඇසූ දේ රැස් කර තබා ගන්නෙකි; යම් ඒ ධර්මයන් මුලින් යහපත්ද, මැදින් යහපත්ද, අවසානයෙන් යහපත්ද, අර්ථ සහිතද, ව්‍යංජන සහිතද, කෙලෙවරක් නොමැතිව පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේද, ඒ ධර්මයන් මේ භික්‍ෂුව විසින් බොහෝ සේ අසන ලද්දාහුය, දරා ගන්නා ලද්දාහුය, වචනයෙන් හුරු පුරුදු කරන ලද්දාහුය, මනසින් මෙනෙහි කරන ලද්දාහුය, දෘෂ්ටියෙන් මනාව විනිවිද දකින ලද්දාහුය.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව කල්‍යාණ මිත්‍රයෙකි, කල්‍යාණ සහාය ඇත්තෙකි, කල්‍යාණවන්තයන් හා සමඟ මිත්‍රශීලීව හැසිරෙන්නෙකි.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව යහපත් ලෙස අවවාද කළ හැකි තැනැත්තෙකි, අවවාද පිළිගන්නා ස්වභාවයෙන් යුක්තය, අනුශාසනා ප්‍රතිග්‍රහණය කරන්නෙකි.\n\nභාග්‍යවතුන් වහන්ස, යම් ඒ උස් පහත් වූ, නොයෙක් දේ කළ යුතු කරුණු සහ බ්‍රහ්මචාරීන්ගේ කටයුතු ඇත්නම්, ඒ කරුණු සම්බන්ධයෙන් මේ භික්‍ෂුව දක්ෂයෙකි, කම්මැලි නැත්තෙකි, ඒ සඳහා ඇති උපාය මාර්ග විමසීමෙන් යුක්තය, ඒවා කිරීමට සමර්ථය, ඒවා මනා ලෙස සංවිධානය කිරීමට සමර්ථය.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව ධර්මයට කැමති කෙනෙකි, ප්‍රියමනාප ලෙස ධර්මය කතා කරන්නෙකි, අභිධර්මය සහ අභිවිනය පිළිබඳව මහත් ප්‍රමෝදයෙන් යුක්තය.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව වීර්යය ආරම්භ කොට වාසය කරයි, දුර්වලකම් අත්හල තැනැත්තෙකි, ස්ථීර භාවයෙන් යුක්තය, දැඩි පරාක්‍රමයෙන් යුක්තය, කුසල ධර්මයන්හි බර අත් නොහළ තැනැත්තෙකි.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව සිතෙහි උසස් බව ඇති කරන, මේ අත් භවයේදීම සැප විහරණය ලබා දෙන සිව්වෙනි ධ්‍යාන වලට කැමති ලෙසින්ද, අපහසුවකින් තොරවද, වෙහෙසකින් තොරවද ලාභය ලබා ගත්තෙකි.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව බොහෝ ආකාරයෙන්, එනම්, එක් ආත්මයක්, දෙආත්මයක්... ආදී වශයෙන් ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පූර්ව නිවාසයන් සිහි කරයි.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් කර්මානුරූපව ගමන් කරන සත්වයන් හඳුනා ගනී.\n\nභාග්‍යවතුන් වහන්ස, මේ භික්‍ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන් ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කරයි. භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ශ්‍රද්ධාවන්තයාගේ ශ්‍රද්ධාවට පාදක වන බවට දේශනා කරන ලද මේ කරුණු මේ භික්‍ෂුව තුළ පවතී, මේ භික්‍ෂුව ඒ කරුණු වලට අනුරූප වේ’’ යනුවෙනි.\n\n‘‘සාධු! සාධු, සුභූතිය! එහෙයින්, සුභූතිය, ඔබ මේ ශ්‍රද්ධාවන්ත භික්‍ෂුව සමඟ වාසය කළ යුතුය. සුභූතිය, ඔබ යම් කලක තථාගතයන් වහන්සේ දකින්නට කැමති වන්නේද, මේ ශ්‍රද්ධාවන්ත භික්‍ෂුව සමඟ තථාගතයන් වහන්සේ බැහැදැකීමට පැමිණිය යුතුය’’ යනුවෙනි.",
      "paliTitle": "Subhūtisuttaṃ"
    },
    {
      "number": 15,
      "pali": "[paṭi. ma. 2.22; mi. pa. 4.4.6] ‘‘Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ekādasānisaṃsā pāṭikaṅkhā. Katame ekādasa? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, manussānaṃ piyo hoti, amanussānaṃ piyo hoti, devatā rakkhanti, nāssa aggi vā visaṃ vā satthaṃ vā kamati, tuvaṭaṃ cittaṃ samādhiyati, mukhavaṇṇo vippasīdati, asammūḷho kālaṃ karoti, uttari appaṭivijjhanto brahmalokūpago hoti. Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ime ekādasānisaṃsā pāṭikaṅkhā’’ti. Pañcamaṃ.",
      "english": "Monastics, when the liberation of mind through loving-kindness is cultivated, developed, made much of, made a vehicle, made a basis, established, familiarized, and well-accomplished, eleven benefits are to be expected. Which eleven?\n\nOne sleeps peacefully, one wakes peacefully, one does not see bad dreams, one is dear to humans, one is dear to non-humans, devas protect one, fire or poison or weapon does not harm one, the mind quickly becomes concentrated, the countenance brightens, one dies unconfused, and if one does not penetrate further, one is reborn in the Brahma world.\n\nMonastics, when the liberation of mind through loving-kindness is cultivated, developed, made much of, made a vehicle, made a basis, established, familiarized, and well-accomplished, these eleven benefits are to be expected.",
      "sinhala": "මහණෙනි, මෛත්‍රී චේතෝවිමුක්තිය සේවනය කළ කල්හි, වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි, යානාවක් කොට ගත් කල්හි, වස්තුවක් කොට ගත් කල්හි, අනුෂ්ඨානයක් කොට පිහිටුවා ගත් කල්හි, හොඳින් හඳුනාගත් කල්හි, මනාකොට ආරම්භ කළ කල්හි එකොළොස් අනුසස් අපේක්ෂා කළ හැකිය.\n\nඒ එකොළොස කවරේද?\n\nසුවසේ නිදයි; සුවසේ පිබිදෙයි; නපුරු සිහින නොදකියි; මිනිසුන්ට ප්‍රිය වෙයි; අමනුෂ්‍යයන්ටද ප්‍රිය වෙයි; දෙවිවරු රකිති; ගින්නක් හෝ විෂක් හෝ ශස්ත්‍රයක් ඔහුට බලපාන්නේ නැත; සිත ඉක්මනින් සමාධිගත වෙයි; මුහුණේ පැහැය පැහැපත් වෙයි; මුළා නොවී කලුරිය කරයි; උත්තරීතර අවබෝධයක් නොලබන්නේ නම්, බ්‍රහ්මලෝකයට උපදී.\n\nමහණෙනි, මෛත්‍රී චේතෝවිමුක්තිය සේවනය කළ කල්හි, වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි, යානාවක් කොට ගත් කල්හි, වස්තුවක් කොට ගත් කල්හි, අනුෂ්ඨානයක් කොට පිහිටුවා ගත් කල්හි, හොඳින් හඳුනාගත් කල්හි, මනාකොට ආරම්භ කළ කල්හි, මේ එකොළොස් අනුසස් අපේක්ෂා කළ හැකිය.",
      "paliTitle": "Mettāsuttaṃ"
    },
    {
      "number": 16,
      "pali": "Ekaṃ samayaṃ āyasmā ānando vesāliyaṃ viharati beluvagāmake [veḷuvagāmake (syā. kaṃ. ka.)]. Tena kho pana samayena dasamo gahapati aṭṭhakanāgaro pāṭaliputtaṃ anuppatto hoti kenacideva karaṇīyena. Atha kho dasamo gahapati aṭṭhakanāgaro yena kukkuṭārāmo yena aññataro bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘kahaṃ nu kho, bhante, āyasmā ānando etarahi viharati? Dassanakāmā hi mayaṃ, bhante, āyasmantaṃ ānanda’’nti. ‘‘Eso, gahapati, āyasmā ānando vesāliyaṃ viharati beluvagāmake’’ti. Atha kho dasamo gahapati aṭṭhakanāgaro pāṭaliputte taṃ karaṇīyaṃ tīretvā yena vesālī beluvagāmako yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho dasamo gahapati aṭṭhakanāgaro āyasmantaṃ ānandaṃ etadavoca – ‘‘atthi nu kho, bhante ānanda, tena bhagavatā jānatā passatā arahatā sammāsambuddhena ekadhammo sammadakkhāto, yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇātī’’ti? ‘‘Atthi kho, gahapati, tena bhagavatā jānatā passatā arahatā sammāsambuddhena ekadhammo sammadakkhāto, yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇātī’’ti. ‘‘Katamo pana, bhante ānanda, tena bhagavatā jānatā passatā arahatā sammāsambuddhena ekadhammo sammadakkhāto, yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇātī’’ti? ‘‘Idha, gahapati, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. So iti paṭisañcikkhati – ‘idampi kho paṭhamaṃ jhānaṃ abhisaṅkhataṃ abhisañcetayitaṃ’. ‘Yaṃ kho pana kiñci abhisaṅkhataṃ abhisañcetayitaṃ, tadaniccaṃ nirodhadhamma’nti pajānāti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti; no ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayampi kho, gahapati, tena bhagavatā jānatā passatā arahatā sammāsambuddhena ekadhammo sammadakkhāto, yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, gahapati, bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ… pe… catutthaṃ jhānaṃ upasampajja viharati. So iti paṭisañcikkhati – ‘idampi kho catutthaṃ jhānaṃ abhisaṅkhataṃ abhisañcetayitaṃ’. ‘Yaṃ kho pana kiñci abhisaṅkhataṃ abhisañcetayitaṃ tadaniccaṃ nirodhadhamma’nti pajānāti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti; no ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayampi kho, gahapati, tena bhagavatā jānatā passatā arahatā sammāsambuddhena ekadhammo sammadakkhāto, yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, gahapati, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘ayampi kho mettā cetovimutti abhisaṅkhatā abhisañcetayitā’. ‘Yaṃ kho pana kiñci abhisaṅkhataṃ abhisañcetayitaṃ tadaniccaṃ nirodhadhamma’nti pajānāti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti; no ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayampi kho, gahapati, tena bhagavatā jānatā…pe. … ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, gahapati, bhikkhu karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘ayampi kho upekkhācetovimutti abhisaṅkhatā abhisañcetayitā’. ‘Yaṃ kho pana kiñci abhisaṅkhataṃ abhisañcetayitaṃ tadaniccaṃ nirodhadhamma’nti pajānāti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti; no ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayampi kho, gahapati, tena bhagavatā jānatā…pe… ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, gahapati, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. So iti paṭisañcikkhati – ‘ayampi kho ākāsānañcāyatanasamāpatti abhisaṅkhatā abhisañcetayitā’. ‘Yaṃ kho pana kiñci abhisaṅkhataṃ abhisañcetayitaṃ tadaniccaṃ nirodhadhamma’nti pajānāti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti; no ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayampi kho, gahapati, tena bhagavatā jānatā…pe… ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, gahapati, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati…pe… sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. So iti paṭisañcikkhati – ‘ayampi kho ākiñcaññāyatanasamāpatti abhisaṅkhatā abhisañcetayitā’. ‘Yaṃ kho pana kiñci abhisaṅkhataṃ abhisañcetayitaṃ tadaniccaṃ nirodhadhamma’nti pajānāti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti; no ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayampi kho, gahapati, tena bhagavatā jānatā…pe… ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇātī’’ti. Evaṃ vutte dasamo gahapati aṭṭhakanāgaro āyasmantaṃ ānandaṃ etadavoca – ‘‘seyyathāpi, bhante ānanda, puriso ekaṃ nidhimukhaṃ gavesanto sakideva [sabbatthapi evameva dissati] ekādasa nidhimukhāni adhigaccheyya; evamevaṃ kho ahaṃ, bhante, ekaṃ amatadvāraṃ gavesanto sakideva ekādasa amatadvārāni [ekādasannaṃ amatadvārānaṃ (sabbattha) ma. ni. 2.21 passitabbaṃ] alatthaṃ sevanāya [savanāya (syā.) sī. pī. majjhimapaṇṇāsakadutiyasuttepi, bhāvanāya (ma. ni. 2.21)]. Seyyathāpi, bhante, purisassa agāraṃ ekādasa dvāraṃ. So tasmiṃ agāre āditte ekamekenapi dvārena sakkuṇeyya attānaṃ sotthiṃ kātuṃ; evamevaṃ kho ahaṃ, bhante, imesaṃ ekādasannaṃ amatadvārānaṃ ekamekenapi amatadvārena sakkuṇissāmi attānaṃ sotthiṃ kātuṃ. Ime hi nāma, bhante, aññatitthiyā ācariyassa ācariyadhanaṃ pariyesissanti. Kiṃ [kimaṅgaṃ (ma. ni. 2.21)] panāhaṃ āyasmato ānandassa pūjaṃ na karissāmī’’ti! Atha kho dasamo gahapati aṭṭhakanāgaro vesālikañca pāṭaliputtakañca bhikkhusaṅghaṃ sannipātāpetvā paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Ekamekañca bhikkhuṃ paccekaṃ dussayugena acchādesi, āyasmantañca ānandaṃ ticīvarena. Āyasmato ānandassa pañcasataṃ vihāraṃ kārāpesīti. Chaṭṭhaṃ.",
      "english": "At one time, the Venerable Ananda was dwelling in Beluvagāmaka, near Vesālī. Now at that time, Dasama, the householder of Aṭṭhakanagara, had arrived in Pāṭaliputta for some business. Then Dasama, the householder of Aṭṭhakanagara, approached a certain monk at the Kukkuṭārāma. Having approached, he said to that monk: \"Venerable sir, where is the Venerable Ananda currently dwelling? We wish to see the Venerable Ananda.\" \"Householder, the Venerable Ananda is dwelling in Beluvagāmaka, near Vesālī,\" he replied. Then Dasama, the householder of Aṭṭhakanagara, having completed his business in Pāṭaliputta, approached the Venerable Ananda in Beluvagāmaka, near Vesālī. Having approached and paid homage to the Venerable Ananda, he sat down to one side. As he sat to one side, Dasama, the householder of Aṭṭhakanagara, said to the Venerable Ananda: \"Venerable Ananda, has the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, expounded a single teaching whereby a monk dwelling heedfully, ardently, and resolutely might have his unliberated mind liberated, his unexhausted defilements exhausted, or attain the unsurpassed security from bondage he has not yet attained?\" \"Indeed, householder, the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, has expounded a single teaching whereby a monk dwelling heedfully, ardently, and resolutely might have his unliberated mind liberated, his unexhausted defilements exhausted, or attain the unsurpassed security from bondage he has not yet attained,\" replied the Venerable Ananda. \"But what, Venerable Ananda, is that single teaching expounded by the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, whereby a monk dwelling heedfully, ardently, and resolutely might have his unliberated mind liberated, his unexhausted defilements exhausted, or attain the unsurpassed security from bondage he has not yet attained?\"\n\n\"Here, householder, a monk — quite secluded from sensual pleasures, secluded from unwholesome states — enters and remains in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and pleasure. He reflects thus: 'This first jhāna is indeed fabricated and mentally willed.' 'Whatever is fabricated and mentally willed is impermanent and subject to cessation,' he understands. Remaining in that state, he attains the exhaustion of the defilements. If he does not attain the exhaustion of the defilements, then through that very delight in the Dhamma and that joy in the Dhamma, with the destruction of the five lower fetters, he arises spontaneously in a pure abode, and there attains final Nibbāna without ever returning from that world. This, too, householder, is a single teaching expounded by the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, whereby a monk dwelling heedfully, ardently, and resolutely might have his unliberated mind liberated, his unexhausted defilements exhausted, or attain the unsurpassed security from bondage he has not yet attained.\n\n\"Furthermore, householder, with the appeasement of initial and sustained application, he enters and remains in the second jhāna, which has internal assurance and unification of mind, is without initial application and sustained application, born of concentration, filled with rapture and pleasure. He also enters and remains in the third jhāna... and the fourth jhāna. He reflects thus: 'This fourth jhāna is indeed fabricated and mentally willed.' 'Whatever is fabricated and mentally willed is impermanent and subject to cessation,' he understands. Remaining in that state, he attains the exhaustion of the defilements. If he does not attain the exhaustion of the defilements, then through that very delight in the Dhamma and that joy in the Dhamma, with the destruction of the five lower fetters, he arises spontaneously in a pure abode, and there attains final Nibbāna without ever returning from that world. This, too, householder, is a single teaching expounded by the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, whereby a monk dwelling heedfully, ardently, and resolutely might have his unliberated mind liberated, his unexhausted defilements exhausted, or attain the unsurpassed security from bondage he has not yet attained.\n\n\"Furthermore, householder, a monk dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, around, everywhere, to all as all, he dwells pervading the entire world with a mind imbued with loving-kindness — expansive, exalted, measureless, free from hostility, free from ill will. He reflects thus: 'This liberation of mind by loving-kindness is indeed fabricated and mentally willed.' 'Whatever is fabricated and mentally willed is impermanent and subject to cessation,' he understands.\n\nStanding in that state, he attains the destruction of the taints. If he does not attain the destruction of the taints, then due to that attachment to Dhamma and delight in Dhamma, with the utter destruction of the five lower fetters, he becomes one reborn spontaneously, there to attain final Nibbāna, not liable to return from that world. This too, householder, is the Dhamma taught by the Blessed One, who knows and sees, the Arahant, the Perfectly Self-Awakened One; and by this right practice, one attains the supreme security from bondage which was previously unattained.\n\nFurthermore, householder, a bhikkhu dwells pervading one direction with a mind imbued with compassion, so too the second, so too the third, so too the fourth. He dwells pervading one direction with a mind imbued with sympathetic joy, so too the second, so too the third, so too the fourth. Thus, above, below, around, everywhere, to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility and without ill will. He reflects thus: ‘This liberation of mind through equanimity is also conditioned and volitionally produced.’ He understands: ‘Whatever is conditioned and volitionally produced is impermanent and subject to cessation.’ Standing in that state, he attains the destruction of the taints. If he does not attain the destruction of the taints, then due to that attachment to Dhamma and delight in Dhamma, with the utter destruction of the five lower fetters, he becomes one reborn spontaneously, there to attain final Nibbāna, not liable to return from that world. This too, householder, is the Dhamma taught by the Blessed One, who knows and sees, the Arahant, the Perfectly Self-Awakened One; and by this right practice, one attains the supreme security from bondage which was previously unattained.\n\nFurthermore, householder, a bhikkhu, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of diversity, thinking ‘Space is infinite,’ enters and dwells in the sphere of infinite space. He reflects thus: ‘This attainment of the sphere of infinite space is also conditioned and volitionally produced.’ He understands: ‘Whatever is conditioned and volitionally produced is impermanent and subject to cessation.’ Standing in that state, he attains the destruction of the taints. If he does not attain the destruction of the taints, then due to that attachment to Dhamma and delight in Dhamma, with the utter destruction of the five lower fetters, he becomes one reborn spontaneously, there to attain final Nibbāna, not liable to return from that world. This too, householder, is the Dhamma taught by the Blessed One, who knows and sees, the Arahant, the Perfectly Self-Awakened One; and by this right practice, one attains the supreme security from bondage which was previously unattained.\n\nFurthermore, householder, a bhikkhu, by completely transcending the sphere of infinite space, thinking ‘Consciousness is infinite,’ enters and dwells in the sphere of infinite consciousness. By completely transcending the sphere of infinite consciousness, thinking ‘There is nothing,’ he enters and dwells in the sphere of nothingness. He reflects thus: ‘This attainment of the sphere of nothingness is also conditioned and volitionally produced.’ He understands: ‘Whatever is conditioned and volitionally produced is impermanent and subject to cessation.’ Standing in that state, he attains the destruction of the taints. If he does not attain the destruction of the taints, then due to that attachment to Dhamma and delight in Dhamma, with the utter destruction of the five lower fetters, he becomes one reborn spontaneously, there to attain final Nibbāna, not liable to return from that world. This too, householder, is the Dhamma taught by the Blessed One, who knows and sees, the Arahant, the Perfectly Self-Awakened One; and by this right practice, one attains the supreme security from bondage which was previously unattained.\n\nWhen this was said, Dasama the householder from Aṭṭhaka-nagara said to Venerable Ānanda: \"Just as, Venerable Ānanda, a man seeking one hidden treasure might discover eleven hidden treasures at once; even so, Venerable Sir, seeking one door to the Deathless, I have found eleven doors to the Deathless for cultivation. Just as, Venerable Sir, a man's house might have eleven doors. If that house were on fire, he could save himself through any one of those doors. Even so, Venerable Sir, through any one of these eleven doors to the Deathless, I shall be able to save myself. Indeed, Venerable Sir, followers of other sects might seek a teacher's fee for their teacher. What then, should I not offer veneration to Venerable Ānanda?!\" Then Dasama the householder from Aṭṭhaka-nagara gathered the community of bhikkhus from Vesālī and Pāṭaliputta, and with his own hands satisfied and invited them with choice solid and soft food. He presented each bhikkhu individually with a pair of robes, and Venerable Ānanda with the three robes. He also had five hundred monasteries built for Venerable Ānanda.",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වෛශාලියෙහි බෙළුවග්‍රාමයේ වාසය කළහ. එවිට අට්ඨක නගරයේ දසම නම් ගෘහපතියා යම්කිසි කරුණක් සඳහා පාඨලීපුත්‍රයට පැමිණ සිටියේය. එවිට අට්ඨක නගරයේ දසම ගෘහපතියා කුක්කුටාරාමය වෙත ද යම්කිසි භික්‍ෂුවක් වෙත ද පැමිණියේය. පැමිණ ඒ භික්‍ෂුවට මෙසේ කීවේය: “ස්වාමීනි, දැන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කොහි වාසය කරන සේක් ද? ස්වාමීනි, අපි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ දකින්නට කැමැත්තෙමු.” “පින්වත, ඒ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වෛශාලියෙහි බෙළුවග්‍රාමයේ වාසය කරන සේකැයි” (ඒ භික්‍ෂුව කීවේය). ඉක්බිති අට්ඨක නගරයේ දසම ගෘහපතියා පාඨලීපුත්‍රයෙහි තමාට තිබූ ඒ කටයුත්ත නිමවා වෛශාලියේ බෙළුවග්‍රාමය වෙත ද ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වෙත ද පැමිණියේය. පැමිණ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි අට්ඨක නගරයේ දසම ගෘහපතියා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි ආනන්ද, සර්වඥ වූ, දැක්කා වූ, අරහත් වූ, සම්මාසම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් එක ධර්මයක් මැනවින් දේශනා කොට වදාළා ද, යම් ධර්මයක් හේතුවෙන් අප්‍රමාදීව, වීර්යවත්ව, යොදන ලද සිත් ඇත්තේ වාසය කරන භික්‍ෂුවකගේ නොවිමුක්ත වූ සිත විමුක්තියට පත් වේ ද, ක්‍ෂය නොවූ ආශ්‍රවයන් ක්‍ෂය භාවයට පත් වේ ද, නොලද අනුත්තර වූ යෝගක්‍ෂේමය ලබා ගනී ද?” “පින්වත, සර්වඥ වූ, දැක්කා වූ, අරහත් වූ, සම්මාසම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් එක ධර්මයක් මැනවින් දේශනා කොට වදාළ සේක. යම් ධර්මයක් හේතුවෙන් අප්‍රමාදීව, වීර්යවත්ව, යොදන ලද සිත් ඇත්තේ වාසය කරන භික්‍ෂුවකගේ නොවිමුක්ත වූ සිත විමුක්තියට පත් වේ ද, ක්‍ෂය නොවූ ආශ්‍රවයන් ක්‍ෂය භාවයට පත් වේ ද, නොලද අනුත්තර වූ යෝගක්‍ෂේමය ලබා ගනී ද” (ආනන්ද ස්ථවිරයන් වහන්සේ කීහ). “එසේ නම් ස්වාමීනි ආනන්ද, සර්වඥ වූ, දැක්කා වූ, අරහත් වූ, සම්මාසම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මැනවින් දේශනා කොට වදාළා වූ, යම් ධර්මයක් හේතුවෙන් අප්‍රමාදීව, වීර්යවත්ව, යොදන ලද සිත් ඇත්තේ වාසය කරන භික්‍ෂුවකගේ නොවිමුක්ත වූ සිත විමුක්තියට පත් වේ ද, ක්‍ෂය නොවූ ආශ්‍රවයන් ක්‍ෂය භාවයට පත් වේ ද, නොලද අනුත්තර වූ යෝගක්‍ෂේමය ලබා ගනී ද, ඒ එක ධර්මය කුමක් ද?” “පින්වත, මෙහි ලා භික්‍ෂුව කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මෙසේ නුවණින් විමසයි: ‘මේ පළමු ධ්‍යානය ද ඇත්තෙන්ම හටගත් දෙයකි, සිතා මතා කළ දෙයකි.’ ‘යම් කිසිවක් හටගත් දෙයක් ද, සිතා මතා කළ දෙයක් ද, එය අනිත්‍ය ය, නිරෝධයට පත් වන ස්වභාවය ඇත්තේ ය’ යි අවබෝධ කරයි. ඔහු එහි පිහිටා ආශ්‍රවයන් ක්‍ෂය කිරීම කරා පැමිණේ. යම් හෙයකින් ආශ්‍රවයන් ක්‍ෂය කිරීම කරා නොපැමිණේ නම්, ඒ ධර්මය කෙරෙහි වූ දැඩි ආශාවෙන් ද, ඒ ධර්මය කෙරෙහි වූ සතුටෙන් ද, ඕරම්භාගීය සංයෝජන පහ ක්‍ෂය වීම හේතුවෙන් ඔහු ඕපපාතිකව උපත ලබා, එහිදී ම පිරිනිවන් පාන්නෙක් වී, ඒ ලෝකයෙන් නැවත නොඑන ස්වභාවය ඇත්තෙක් වේ. පින්වත, සර්වඥ වූ, දැක්කා වූ, අරහත් වූ, සම්මාසම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මැනවින් දේශනා කොට වදාළ එක ධර්මයක් මෙය ද වේ. යම් ධර්මයක් හේතුවෙන් අප්‍රමාදීව, වීර්යවත්ව, යොදන ලද සිත් ඇත්තේ වාසය කරන භික්‍ෂුවකගේ නොවිමුක්ත වූ සිත විමුක්තියට පත් වේ ද, ක්‍ෂය නොවූ ආශ්‍රවයන් ක්‍ෂය භාවයට පත් වේ ද, නොලද අනුත්තර වූ යෝගක්‍ෂේමය ලබා ගනී ද යන්න ඒ ධර්මයයි.\n\nනැවත ද, පින්වත, භික්‍ෂුව විතර්ක හා විචාරයන් සන්සිඳුවීමෙන්, අධ්‍යාත්මිකව පහදවා ගැනීමෙන්, සිත එක අරමුණක පිහිටුවා, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට ද... (පෙය්‍යාලය) ...තෙවන ධ්‍යානයට ද... (පෙය්‍යාලය) ...සතරවන ධ්‍යානයට ද පැමිණ වාසය කරයි. ඔහු මෙසේ නුවණින් විමසයි: ‘මේ සතරවන ධ්‍යානය ද ඇත්තෙන්ම හටගත් දෙයකි, සිතා මතා කළ දෙයකි.’ ‘යම් කිසිවක් හටගත් දෙයක් ද, සිතා මතා කළ දෙයක් ද, එය අනිත්‍ය ය, නිරෝධයට පත් වන ස්වභාවය ඇත්තේ ය’ යි අවබෝධ කරයි. ඔහු එහි පිහිටා ආශ්‍රවයන් ක්‍ෂය කිරීම කරා පැමිණේ. යම් හෙයකින් ආශ්‍රවයන් ක්‍ෂය කිරීම කරා නොපැමිණේ නම්, ඒ ධර්මය කෙරෙහි වූ දැඩි ආශාවෙන් ද, ඒ ධර්මය කෙරෙහි වූ සතුටෙන් ද, ඕරම්භාගීය සංයෝජන පහ ක්‍ෂය වීම හේතුවෙන් ඔහු ඕපපාතිකව උපත ලබා, එහිදී ම පිරිනිවන් පාන්නෙක් වී, ඒ ලෝකයෙන් නැවත නොඑන ස්වභාවය ඇත්තෙක් වේ. පින්වත, සර්වඥ වූ, දැක්කා වූ, අරහත් වූ, සම්මාසම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මැනවින් දේශනා කොට වදාළ එක ධර්මයක් මෙය ද වේ. යම් ධර්මයක් හේතුවෙන් අප්‍රමාදීව, වීර්යවත්ව, යොදන ලද සිත් ඇත්තේ වාසය කරන භික්‍ෂුවකගේ නොවිමුක්ත වූ සිත විමුක්තියට පත් වේ ද, ක්‍ෂය නොවූ ආශ්‍රවයන් ක්‍ෂය භාවයට පත් වේ ද, නොලද අනුත්තර වූ යෝගක්‍ෂේමය ලබා ගනී ද යන්න ඒ ධර්මයයි.\n\nනැවත ද, පින්වත, භික්‍ෂුව මෛත්‍රියෙන් යුක්ත වූ සිතින් එක දිශාවක් පතුරුවා වාසය කරයි. එසේම දෙවන දිශාව ද, එසේම තෙවන දිශාව ද, එසේම සතරවන දිශාව ද පතුරුවයි. මෙලෙස උඩුකුරු, යටිකුරු, හරස් අතට, සෑම තැනම, සර්ව ආත්ම භාවයන්හි, මෛත්‍රියෙන් යුක්ත වූ සිතින් මුළු ලෝකයම මහත් වූ, උතුම් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කරයි. ඔහු මෙසේ නුවණින් විමසයි: ‘මේ මෛත්‍රී චේතෝවිමුක්තිය ද ඇත්තෙන්ම හටගත් දෙයකි, සිතා මතා කළ දෙයකි.’ ‘යම් කිසිවක් හටගත් දෙයක් ද, සිතා මතා කළ දෙයක් ද, එය අනිත්‍ය ය, නිරෝධයට පත් වන ස්වභාවය ඇත්තේ ය’ යි අවබෝධ කරයි.\n\nඔහු එහි පිහිටා ආශ්‍රවයන්ගේ ක්ෂය ලබයි. යම් හෙයකින් ආශ්‍රවයන්ගේ ක්ෂය නොලබන්නේ නම්, ඒ ධර්මය කෙරෙහි ඇති රාගයෙන් ද, ඒ ධර්මයෙන් ලබන නන්දියෙන් ද, පංච ඕරම්භාගීය සං‍යෝජන​යන්ගේ පරික්ෂය හේතුවෙන්, ඕපපාතිකව උපත ලබා, ඒ ලෝකයේ දී පිරිනිවන් පානසුළු බවට පත්වෙයි. ඔහු ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වේ. ගෘහපතිය, මෙය ද ඒ භාග්‍යවතුන් වහන්සේ විසින් අවබෝධයෙන් හා ප්‍රඥාවෙන් දුටු, අරහත් සම්මා සම්බුද්ධ වූ උන්වහන්සේ විසින් දේශනා කරන ලද ධර්මයයි. යමෙක් මේ ධර්මය අනුගමනය කිරීමෙන් නුලැබූ අනුත්තර වූ යෝගක්‍ෂේමය ලබන්නේය.\n\nගෘහපතිය, නැවත ද භික්‍ෂුව කරුණා සහගත වූ සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එසේම දෙවන දිශාව ද, තෙවන දිශාව ද, සිව්වන දිශාව ද පතුරුවා වාසය කරයි. මෙසේ උඩ, යට, හරහට, හැමතැන්හි, සියලු ආකාරයෙන්, සියලු ලෝකය, කරුණා සහගත වූ සිතින්, විපුල වූ, මහාර්ග වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ ආකාරයෙන් පතුරුවා වාසය කරයි. නැවත ද ගෘහපතිය, භික්‍ෂුව මුදිතා සහගත වූ සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එසේම දෙවන දිශාව ද, තෙවන දිශාව ද, සිව්වන දිශාව ද පතුරුවා වාසය කරයි. මෙසේ උඩ, යට, හරහට, හැමතැන්හි, සියලු ආකාරයෙන්, සියලු ලෝකය, මුදිතා සහගත වූ සිතින්, විපුල වූ, මහාර්ග වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ ආකාරයෙන් පතුරුවා වාසය කරයි. නැවත ද ගෘහපතිය, භික්‍ෂුව උපේක්‍ෂා සහගත වූ සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එසේම දෙවන දිශාව ද, තෙවන දිශාව ද, සිව්වන දිශාව ද පතුරුවා වාසය කරයි. මෙසේ උඩ, යට, හරහට, හැමතැන්හි, සියලු ආකාරයෙන්, සියලු ලෝකය, උපේක්‍ෂා සහගත වූ සිතින්, විපුල වූ, මහාර්ග වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ ආකාරයෙන් පතුරුවා වාසය කරයි. හෙතෙම මෙසේ සිහි කරයි – ‘මේ උපේක්‍ෂා චේතෝවිමුක්තිය ද අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ’. ‘යමක් නම් අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ ද, එය අනිත්‍ය වූ ද, නිරෝධ ධර්ම වූ ද වේ’යි ඔහු ප්‍රඥාවෙන් දනී. ඔහු එහි පිහිටා ආශ්‍රවයන්ගේ ක්ෂය ලබයි. යම් හෙයකින් ආශ්‍රවයන්ගේ ක්ෂය නොලබන්නේ නම්, ඒ ධර්මය කෙරෙහි ඇති රාගයෙන් ද, ඒ ධර්මයෙන් ලබන නන්දියෙන් ද, පංච ඕරම්භාගීය සං‍යෝජන​යන්ගේ පරික්ෂය හේතුවෙන්, ඕපපාතිකව උපත ලබා, ඒ ලෝකයේ දී පිරිනිවන් පානසුළු බවට පත්වෙයි. ඔහු ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වේ. ගෘහපතිය, මෙය ද ඒ භාග්‍යවතුන් වහන්සේ විසින් අවබෝධයෙන් හා ප්‍රඥාවෙන් දුටු, අරහත් සම්මා සම්බුද්ධ වූ උන්වහන්සේ විසින් දේශනා කරන ලද ධර්මයයි. යමෙක් මේ ධර්මය අනුගමනය කිරීමෙන් නුලැබූ අනුත්තර වූ යෝගක්‍ෂේමය ලබන්නේය.\n\nගෘහපතිය, නැවත ද භික්‍ෂුව සියලු රූප සංඥාවන් සම්පූර්ණයෙන් ඉක්මවා, ප්‍රතිඝ සංඥාවන් අස්ථංගත වීමෙන්, නානත්ව සංඥාවන් අමනසිකාර කිරීමෙන්, ‘අනන්ත වූ ආකාශය’ යැයි සිතා ආකාසානඤ්චායතනයට එළඹ වාසය කරයි. හෙතෙම මෙසේ සිහි කරයි – ‘මේ ආකාසානඤ්චායතන සමාපත්තිය ද අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ’. ‘යමක් නම් අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ ද, එය අනිත්‍ය වූ ද, නිරෝධ ධර්ම වූ ද වේ’යි ඔහු ප්‍රඥාවෙන් දනී. ඔහු එහි පිහිටා ආශ්‍රවයන්ගේ ක්ෂය ලබයි. යම් හෙයකින් ආශ්‍රවයන්ගේ ක්ෂය නොලබන්නේ නම්, ඒ ධර්මය කෙරෙහි ඇති රාගයෙන් ද, ඒ ධර්මයෙන් ලබන නන්දියෙන් ද, පංච ඕරම්භාගීය සං‍යෝජන​යන්ගේ පරික්ෂය හේතුවෙන්, ඕපපාතිකව උපත ලබා, ඒ ලෝකයේ දී පිරිනිවන් පානසුළු බවට පත්වෙයි. ඔහු ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වේ. ගෘහපතිය, මෙය ද ඒ භාග්‍යවතුන් වහන්සේ විසින් අවබෝධයෙන් හා ප්‍රඥාවෙන් දුටු, අරහත් සම්මා සම්බුද්ධ වූ උන්වහන්සේ විසින් දේශනා කරන ලද ධර්මයයි. යමෙක් මේ ධර්මය අනුගමනය කිරීමෙන් නුලැබූ අනුත්තර වූ යෝගක්‍ෂේමය ලබන්නේය.\n\nගෘහපතිය, නැවත ද භික්‍ෂුව සියලු ආකාසානඤ්චායතනය සම්පූර්ණයෙන් ඉක්මවා, ‘අනන්ත වූ විඤ්ඤාණය’ යැයි සිතා විඤ්ඤාණඤ්චායතනයට එළඹ වාසය කරයි. හෙතෙම මෙසේ සිහි කරයි – ‘මේ විඤ්ඤාණඤ්චායතන සමාපත්තිය ද අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ’. ‘යමක් නම් අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ ද, එය අනිත්‍ය වූ ද, නිරෝධ ධර්ම වූ ද වේ’යි ඔහු ප්‍රඥාවෙන් දනී. ඔහු එහි පිහිටා ආශ්‍රවයන්ගේ ක්ෂය ලබයි. යම් හෙයකින් ආශ්‍රවයන්ගේ ක්ෂය නොලබන්නේ නම්, ඒ ධර්මය කෙරෙහි ඇති රාගයෙන් ද, ඒ ධර්මයෙන් ලබන නන්දියෙන් ද, පංච ඕරම්භාගීය සං‍යෝජන​යන්ගේ පරික්ෂය හේතුවෙන්, ඕපපාතිකව උපත ලබා, ඒ ලෝකයේ දී පිරිනිවන් පානසුළු බවට පත්වෙයි. ඔහු ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වේ. ගෘහපතිය, මෙය ද ඒ භාග්‍යවතුන් වහන්සේ විසින් අවබෝධයෙන් හා ප්‍රඥාවෙන් දුටු, අරහත් සම්මා සම්බුද්ධ වූ උන්වහන්සේ විසින් දේශනා කරන ලද ධර්මයයි. යමෙක් මේ ධර්මය අනුගමනය කිරීමෙන් නුලැබූ අනුත්තර වූ යෝගක්‍ෂේමය ලබන්නේය.\nසියලු විඤ්ඤාණඤ්චායතනය සම්පූර්ණයෙන් ඉක්මවා, ‘කිසිවක් නැතැයි’ සිතා ආකිඤ්චඤ්ඤායතනයට එළඹ වාසය කරයි. හෙතෙම මෙසේ සිහි කරයි – ‘මේ ආකිඤ්චඤ්ඤායතන සමාපත්තිය ද අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ’. ‘යමක් නම් අභිසංස්කෘත වූ ද, සිතින් මවන ලද්දක් වූ ද වේ ද, එය අනිත්‍ය වූ ද, නිරෝධ ධර්ම වූ ද වේ’යි ඔහු ප්‍රඥාවෙන් දනී. ඔහු එහි පිහිටා ආශ්‍රවයන්ගේ ක්ෂය ලබයි. යම් හෙයකින් ආශ්‍රවයන්ගේ ක්ෂය නොලබන්නේ නම්, ඒ ධර්මය කෙරෙහි ඇති රාගයෙන් ද, ඒ ධර්මයෙන් ලබන නන්දියෙන් ද, පංච ඕරම්භාගීය සං‍යෝජන​යන්ගේ පරික්ෂය හේතුවෙන්, ඕපපාතිකව උපත ලබා, ඒ ලෝකයේ දී පිරිනිවන් පානසුළු බවට පත්වෙයි. ඔහු ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වේ. ගෘහපතිය, මෙය ද ඒ භාග්‍යවතුන් වහන්සේ විසින් අවබෝධයෙන් හා ප්‍රඥාවෙන් දුටු, අරහත් සම්මා සම්බුද්ධ වූ උන්වහන්සේ විසින් දේශනා කරන ලද ධර්මයයි. යමෙක් මේ ධර්මය අනුගමනය කිරීමෙන් නුලැබූ අනුත්තර වූ යෝගක්‍ෂේමය ලබන්නේය.\n\nමෙසේ පැවසූ විට අට්ඨක නාගර දසම ගෘහපතියා ආයුෂ්මත් ආනන්දයන් වහන්සේට මෙය පැවසීය – “වහන්ස, ආනන්දයන් වහන්ස, යම් සේ පුරුෂයෙක් එක් නිධන් මුවදොරක් සොයමින් එකවරම එකොළොස් නිධන් මුවදොරක් සොයාගනී ද, එසේම වහන්ස, මම ද එක් අමෘත ද්වාරයක් සොයමින් එකවරම එකොළොස් අමෘත ද්වාරයක් භාවනාව පිණිස ලැබගත්තෙමි. වහන්ස, යම් සේ පුරුෂයෙකුට එකොළොස් දොරක් සහිත ගෙයක් ඇත. ඒ ගෙය ගිනි ගත් විට ඔහුට එක් එක් දොරකින් වුව ද තමාව ආරක්‍ෂා කරගත හැකිය. එසේම වහන්ස, මම ද මේ එකොළොස් අමෘත ද්වාරයන්ගෙන් එක එක අමෘත ද්වාරයකින් වුව ද මාව ආරක්‍ෂා කරගැනීමට සමත් වන්නෙමි. වහන්ස, මේ අන්‍ය තීර්ථකයෝ ගුරුවරයාට ආචාර්ය ධනය සොයති. ආයුෂ්මත් ආනන්දයන් වහන්සේට මම පූජාවක් නොකරන්නේ මන්ද?”\n\nඉක්බිති අට්ඨක නාගර දසම ගෘහපතියා වෛශාලි සහ පාටලීපුත්‍ර භික්‍ෂු සංඝයා රැස්කරවා, ප්‍රණීත වූ කෑම වර්ග හා බීම වර්ගවලින් සියතින්ම සන්තර්පණය කර, සංග්‍රහ කළේය. එක් එක් භික්‍ෂුවකට වස්ත්‍ර යුගල බැගින් ද, ආයුෂ්මත් ආනන්දයන් වහන්සේට තිචීවරයක් ද පිළිගැන්වීය. ආයුෂ්මත් ආනන්දයන් වහන්සේට පන්සියයක් විහාර ද ඉදිකරවීය.",
      "paliTitle": "Aṭṭhakanāgarasuttaṃ"
    },
    {
      "number": 17,
      "pali": "‘‘Ekādasahi, bhikkhave, aṅgehi samannāgato gopālako abhabbo gogaṇaṃ pariharituṃ phātiṃ kātuṃ [phātikattuṃ (sī.), phātikātuṃ (syā. pī.)]. Katamehi ekādasahi? Idha, bhikkhave, gopālako na rūpaññū hoti, na lakkhaṇakusalo hoti, na āsāṭikaṃ hāretā [sāṭetā (sī. syā. pī.)] hoti, na vaṇaṃ paṭicchādetā hoti, na dhūmaṃ kattā hoti, na titthaṃ jānāti, na pītaṃ jānāti, na vīthiṃ jānāti, na gocarakusalo hoti, anavasesadohī ca hoti, ye te usabhā gopitaro gopariṇāyakā te na atirekapūjāya pūjetā hoti. Imehi kho, bhikkhave, ekādasahi aṅgehi samannāgato gopālako abhabbo gogaṇaṃ pariharituṃ phātiṃ kātuṃ. ‘‘Evamevaṃ kho, bhikkhave, ekādasahi dhammehi samannāgato bhikkhu abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Katamehi ekādasahi? Idha, bhikkhave, bhikkhu na rūpaññū hoti, na lakkhaṇakusalo hoti, na āsāṭikaṃ hāretā hoti, na vaṇaṃ paṭicchādetā hoti, na dhūmaṃ kattā hoti, na titthaṃ jānāti, na pītaṃ jānāti, na vīthiṃ jānāti, na gocarakusalo hoti, anavasesadohī ca hoti, ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā te na atirekapūjāya pūjetā hoti. ‘‘Kathañca, bhikkhave, bhikkhu na rūpaññū hoti? Idha, bhikkhave, bhikkhu yaṃ kiñci rūpaṃ ( ) [(sabbaṃ rūpaṃ) ma. ni. 1.347 ( ) katthaci dissati] ‘cattāri mahābhūtāni, catunnañca mahābhūtānaṃ upādāyarūpa’nti yathābhūtaṃ nappajānāti. Evaṃ kho, bhikkhave, bhikkhu na rūpaññū hoti. ‘‘Kathañca, bhikkhave, bhikkhu na lakkhaṇakusalo hoti? Idha, bhikkhave, bhikkhu ‘kammalakkhaṇo bālo, kammalakkhaṇo paṇḍito’ti yathābhūtaṃ nappajānāti. Evaṃ kho, bhikkhave, bhikkhu na lakkhaṇakusalo hoti. ‘‘Kathañca, bhikkhave, bhikkhu na āsāṭikaṃ hāretā hoti? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ adhivāseti nappajahati na vinodeti na byantīkaroti na anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme adhivāseti nappajahati na vinodeti na byantīkaroti na anabhāvaṃ gameti. Evaṃ kho, bhikkhave, bhikkhu na āsāṭikaṃ hāretā hoti. ‘‘Kathañca, bhikkhave, bhikkhu na vaṇaṃ paṭicchādetā hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā nimittaggāhī hoti anubyañjanaggāhī; yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya na paṭipajjati; na rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ nāpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya nimittaggāhī hoti anubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya na paṭipajjati; na rakkhati manindriyaṃ, manindriye saṃvaraṃ nāpajjati. Evaṃ kho, bhikkhave, bhikkhu na vaṇaṃ paṭicchādetā hoti. ‘‘Kathañca, bhikkhave, bhikkhu na dhūmaṃ kattā hoti? Idha, bhikkhave, bhikkhu na [ma. ni. 1.346-347 pana ayaṃ nakāro dhammantipadassa anantaraṃ dissati] yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ desetā hoti. Evaṃ kho, bhikkhave, bhikkhu na dhūmaṃ kattā hoti. ‘‘Kathañca, bhikkhave, bhikkhu na titthaṃ jānāti? Idha, bhikkhave, bhikkhu ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te kālena kālaṃ upasaṅkamitvā na paripucchati na paripañhati – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva na vivaranti, anuttānīkatañca na uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ na paṭivinodenti. Evaṃ kho, bhikkhave, bhikkhu na titthaṃ jānāti. ‘‘Kathañca, bhikkhave, bhikkhu na pītaṃ jānāti? Idha, bhikkhave, bhikkhu tathāgatappavedite dhammavinaye desiyamāne na labhati atthavedaṃ, na labhati dhammavedaṃ, na labhati dhammūpasaṃhitaṃ pāmojjaṃ. Evaṃ kho, bhikkhave, bhikkhu na pītaṃ jānāti. ‘‘Kathañca, bhikkhave, bhikkhu na vīthiṃ jānāti? Idha, bhikkhave, bhikkhu ariyaṃ aṭṭhaṅgikaṃ maggaṃ yathābhūtaṃ nappajānāti. Evaṃ kho, bhikkhave, bhikkhu na vīthiṃ jānāti. ‘‘Kathañca, bhikkhave, bhikkhu na gocarakusalo hoti? Idha, bhikkhave, bhikkhu cattāro satipaṭṭhāne yathābhūtaṃ nappajānāti. Evaṃ kho, bhikkhave, bhikkhu na gocarakusalo hoti. ‘‘Kathañca, bhikkhave, bhikkhu anavasesadohī hoti? Idha, bhikkhave, bhikkhuṃ saddhā gahapatikā abhihaṭṭhuṃ pavārenti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārehi. Tatra bhikkhu mattaṃ na jānāti paṭiggahaṇāya. Evaṃ kho, bhikkhave, bhikkhu anavasesadohī hoti. ‘‘Kathañca, bhikkhave, bhikkhu ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā, te na atirekapūjāya pūjetā hoti? Idha, bhikkhave, bhikkhu ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā, tesu na mettaṃ kāyakammaṃ paccupaṭṭhāpeti āvi ceva raho ca, na mettaṃ vacīkammaṃ… na mettaṃ manokammaṃ paccupaṭṭhāpeti āvi ceva raho ca. Evaṃ kho, bhikkhave, bhikkhu ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā, na te atirekapūjāya pūjetā hoti. ‘‘Imehi kho, bhikkhave, ekādasahi dhammehi samannāgato bhikkhu abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. ‘‘Ekādasahi, bhikkhave, aṅgehi samannāgato gopālako bhabbo gogaṇaṃ pariharituṃ phātiṃ kātuṃ. Katamehi ekādasahi? Idha, bhikkhave, gopālako rūpaññū hoti, lakkhaṇakusalo hoti, āsāṭikaṃ hāretā hoti, vaṇaṃ paṭicchādetā hoti, dhūmaṃ kattā hoti, titthaṃ jānāti, pītaṃ jānāti, vīthiṃ jānāti, gocarakusalo hoti, sāvasesadohī ca hoti, ye te usabhā gopitaro gopariṇāyakā te atirekapūjāya pūjetā hoti – imehi kho, bhikkhave, ekādasahi aṅgehi samannāgato gopālako bhabbo gogaṇaṃ pariharituṃ phātiṃ kātuṃ. ‘‘Evamevaṃ kho, bhikkhave, ekādasahi dhammehi samannāgato bhikkhu bhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Katamehi ekādasahi? Idha, bhikkhave, bhikkhu rūpaññū hoti, lakkhaṇakusalo hoti, āsāṭikaṃ hāretā hoti, vaṇaṃ paṭicchādetā hoti, dhūmaṃ kattā hoti, titthaṃ jānāti, pītaṃ jānāti, vīthiṃ jānāti, gocarakusalo hoti, sāvasesadohī ca hoti, ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā te atirekapūjāya pūjetā hoti. ‘‘Kathañca, bhikkhave, bhikkhu rūpaññū hoti? Idha, bhikkhave, bhikkhu yaṃ kiñci rūpaṃ ‘cattāri mahābhūtāni, catunnañca mahābhūtānaṃ upādāyarūpa’nti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu rūpaññū hoti. ‘‘Kathañca, bhikkhave, bhikkhu lakkhaṇakusalo hoti? Idha, bhikkhave, bhikkhu ‘kammalakkhaṇo bālo, kammalakkhaṇo paṇḍito’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu lakkhaṇakusalo hoti. ‘‘Kathañca, bhikkhave, bhikkhu āsāṭikaṃ hāretā hoti? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Evaṃ kho, bhikkhave, bhikkhu āsāṭikaṃ hāretā hoti. ‘‘Kathañca, bhikkhave, bhikkhu vaṇaṃ paṭicchādetā hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. Evaṃ kho, bhikkhave, bhikkhu vaṇaṃ paṭicchādetā hoti. ‘‘Kathañca, bhikkhave, bhikkhu dhūmaṃ kattā hoti? Idha, bhikkhave, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ desetā hoti. Evaṃ kho, bhikkhave, bhikkhu dhūmaṃ kattā hoti. ‘‘Kathañca, bhikkhave, bhikkhu titthaṃ jānāti? Idha, bhikkhave, bhikkhu ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, bhikkhu titthaṃ jānāti. ‘‘Kathañca, bhikkhave, bhikkhu pītaṃ jānāti? Idha, bhikkhave, bhikkhu tathāgatappavedite dhammavinaye desiyamāne labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Evaṃ kho, bhikkhave, bhikkhu pītaṃ jānāti. ‘‘Kathañca, bhikkhave, bhikkhu vīthiṃ jānāti? Idha, bhikkhave, bhikkhu ariyaṃ aṭṭhaṅgikaṃ maggaṃ yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu vīthiṃ jānāti. ‘‘Kathañca, bhikkhave, bhikkhu gocarakusalo hoti? Idha, bhikkhave, bhikkhu cattāro satipaṭṭhāne yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu gocarakusalo hoti. ‘‘Kathañca, bhikkhave, bhikkhu sāvasesadohī hoti? Idha, bhikkhave, bhikkhuṃ saddhā gahapatikā abhihaṭṭhuṃ pavārenti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārehi. Tatra bhikkhu mattaṃ jānāti paṭiggahaṇāya. Evaṃ kho, bhikkhave, bhikkhu sāvasesadohī hoti. ‘‘Kathañca, bhikkhave, bhikkhu ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā, te atirekapūjāya pūjetā hoti? Idha, bhikkhave, bhikkhu ye te therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā, tesu mettaṃ kāyakammaṃ paccupaṭṭhāpeti āvi ceva raho ca, mettaṃ vacīkammaṃ… mettaṃ manokammaṃ paccupaṭṭhāpeti āvi ceva raho ca. Evaṃ kho, bhikkhave, bhikkhu ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā, te atirekapūjāya pūjetā hoti. ‘‘Imehi kho, bhikkhave, ekādasahi dhammehi samannāgato bhikkhu bhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjitu’’nti. Sattamaṃ.",
      "english": "Monks, a cowherd endowed with eleven qualities is incapable of looking after the herd and making it prosper. Which eleven? Here, monks, a cowherd is not one who knows forms, not skilled in characteristics, not one who drives away pests, not one who covers wounds, not one who makes smoke, does not know the ford, does not know the drinking place, does not know the path, is not skilled in pasturage, milks dry, and does not honor with special reverence those bulls who are the fathers of the herd and its leaders. Monks, a cowherd endowed with these eleven qualities is incapable of looking after the herd and making it prosper.\n\nIn the same way, monks, a monk endowed with eleven qualities is incapable of growth, increase, and full development in this Dhamma and Discipline. Which eleven? Here, monks, a monk is not one who knows forms, not skilled in characteristics, not one who drives away pests, not one who covers wounds, not one who makes smoke, does not know the ford, does not know the drinking place, does not know the path, is not skilled in pasturage, milks dry, and does not honor with special reverence those elder monks who are long-experienced, long-ordained, fathers of the Sangha, and leaders of the Sangha.\n\nAnd how, monks, is a monk not one who knows forms? Here, monks, a monk does not understand as it actually is whatever form there is, saying: 'This is the four great elements, and form derived from the four great elements.' This is how, monks, a monk is not one who knows forms.\n\nAnd how, monks, is a monk not skilled in characteristics? Here, monks, a monk does not understand as it actually is that 'the characteristic of a fool is his actions, the characteristic of a wise person is his actions.' This is how, monks, a monk is not skilled in characteristics.\n\nAnd how, monks, is a monk not one who drives away pests? Here, monks, a monk tolerates arisen sensual thoughts, does not abandon them, does not dispel them, does not make an end of them, does not bring them to cessation; he tolerates arisen thoughts of ill-will... he tolerates arisen thoughts of harming... he tolerates whatever evil unwholesome states have arisen, does not abandon them, does not dispel them, does not make an end of them, does not bring them to cessation. This is how, monks, a monk is not one who drives away pests.\n\nAnd how, monks, is a monk not one who covers wounds? Here, monks, having seen a form with the eye, a monk apprehends its general appearance and its specific features. Because the eye-faculty is left unguarded, evil unwholesome states of covetousness and distress might assail him; he does not practice for its restraint; he does not guard the eye-faculty, he does not undertake the restraint of the eye-faculty. Having heard a sound with the ear... having smelled an odor with the nose... having tasted a flavor with the tongue... having felt a tactile sensation with the body... having cognized a mental phenomenon with the mind, he apprehends its general appearance and its specific features. Because the mind-faculty is left unguarded, evil unwholesome states of covetousness and distress might assail him; he does not practice for its restraint; he does not guard the mind-faculty, he does not undertake the restraint of the mind-faculty. This is how, monks, a monk is not one who covers wounds.\n\nAnd how, monks, is a monk not one who makes smoke? Here, monks, a monk does not teach in detail to others the Dhamma as he has heard and learned it. This is how, monks, a monk is not one who makes smoke.\n\nAnd how, monks, is a monk not one who knows the ford? Here, monks, a monk does not approach from time to time those monks who are learned, who have mastered the traditions, who uphold the Dhamma, who uphold the Vinaya, who uphold the summaries, and question them, nor query them, saying: 'Venerable Sir, how is this? What is the meaning of this?' As a result, those venerables do not reveal what is unrevealed to him, nor make plain what is unclear, nor dispel his doubts about various points of doubt in the Dhamma. This is how, monks, a monk is not one who knows the ford.\n\nAnd how, monks, is a monk not one who knows the drinking place? Here, monks, when the Dhamma and Discipline proclaimed by the Tathāgata are being taught, a monk does not obtain a sense of the goal, does not obtain a sense of the Dhamma, and does not obtain delight connected with the Dhamma. This is how, monks, a monk is not one who knows the drinking place.\n\nAnd how, monks, is a monk not one who knows the path? Here, monks, a monk does not understand the Noble Eightfold Path as it actually is. This is how, monks, a monk is not one who knows the path.\n\nAnd how, monks, is a monk not skilled in pasturage? Here, monks, a monk does not understand the four foundations of mindfulness as they actually are.\n\nThus, monks, a monk is not skilled in his field. \"And how, monks, is a monk one who milks dry?\" Here, monks, faithful householders readily invite a monk with robes, almsfood, lodgings, medicines for the sick, and other requisites. Yet, the monk does not know the proper measure for receiving them. Thus, monks, a monk is one who milks dry. \"And how, monks, is a monk one who does not honor with special veneration those monks who are elders, long-experienced, long-ordained, fathers of the Saṅgha, leaders of the Saṅgha?\" Here, monks, a monk does not show a kindly bodily act towards those monks who are elders, long-experienced, long-ordained, fathers of the Saṅgha, leaders of the Saṅgha, whether openly or in private; he does not show a kindly verbal act... he does not show a kindly mental act, whether openly or in private. Thus, monks, a monk is one who does not honor with special veneration those monks who are elders, long-experienced, long-ordained, fathers of the Saṅgha, leaders of the Saṅgha. Monks, a monk endowed with these eleven qualities is incapable of attaining growth, increase, and abundance in this Dhamma and Discipline.\n\nMonks, a cowherd endowed with eleven qualities is capable of tending his herd and making it flourish. With which eleven? Here, monks, the cowherd knows forms (of cattle), is skilled in characteristics (of cattle), is one who removes parasites (from cattle), is one who bandages wounds (of cattle), is one who makes smoke (to ward off insects), knows the ford (watering place), knows the drinking place, knows the path, is skilled in pasture (or discerning suitable grazing grounds), is one who milks leaving a remnant (not milking dry), and is one who honors with special veneration those bull leaders who are fathers of the herd and leaders of the herd. Monks, a cowherd endowed with these eleven qualities is capable of tending his herd and making it flourish.\n\nIn the same way, monks, a monk endowed with eleven qualities is capable of attaining growth, increase, and abundance in this Dhamma and Discipline. With which eleven? Here, monks, the monk knows forms, is skilled in characteristics, is one who removes parasites, is one who bandages wounds, is one who makes smoke, knows the ford, knows the drinking place, knows the path, is skilled in his field, is one who milks leaving a remnant, and is one who honors with special veneration those monks who are elders, long-experienced, long-ordained, fathers of the Saṅgha, leaders of the Saṅgha.\n\n\"And how, monks, is a monk one who knows forms?\" Here, monks, a monk truly understands any kind of form thus: 'This is the four great elements, and form derived from the four great elements.' Thus, monks, a monk is one who knows forms. \"And how, monks, is a monk skilled in characteristics?\" Here, monks, a monk truly understands thus: 'The foolish one is characterized by his actions, the wise one is characterized by his actions.' Thus, monks, a monk is skilled in characteristics. \"And how, monks, is a monk one who removes parasites?\" Here, monks, a monk does not tolerate an arisen thought of sensual desire; he abandons it, dispels it, makes an end of it, brings it to nought. He does not tolerate an arisen thought of ill-will... he does not tolerate an arisen thought of harm... he does not tolerate any arisen unwholesome states; he abandons them, dispels them, makes an end of them, brings them to nought. Thus, monks, a monk is one who removes parasites. \"And how, monks, is a monk one who bandages wounds?\" Here, monks, having seen a form with the eye, a monk does not grasp at its signs or its details. Since unwholesome and evil states of covetousness and distress might assail him if his eye-faculty were unguarded, he practices for its restraint; he guards the eye-faculty, he undertakes the restraint of the eye-faculty. Having heard a sound with the ear... having smelt an odor with the nose... having tasted a flavor with the tongue... having felt a tactile sensation with the body... having cognized a mental phenomenon with the mind, he does not grasp at its signs or its details. Since unwholesome and evil states of covetousness and distress might assail him if his mind-faculty were unguarded, he practices for its restraint; he guards the mind-faculty, he undertakes the restraint of the mind-faculty. Thus, monks, a monk is one who bandages wounds. \"And how, monks, is a monk one who makes smoke?\" Here, monks, a monk teaches the Dhamma to others in detail, just as he has heard it and just as he has learned it. Thus, monks, a monk is one who makes smoke. \"And how, monks, is a monk one who knows the ford?\" Here, monks, a monk approaches those monks who are learned, who have studied the tradition, who are custodians of the Dhamma, custodians of the Discipline, custodians of the main points (of the teachings), and from time to time he questions them and inquires of them thus: 'Venerable Sir, how is this? What is the meaning of this?'\n\nThose venerable ones of his clarify what was unclear, reveal what was unrevealed, and dispel doubt regarding various doctrines that give rise to doubt. Thus, bhikkhus, a bhikkhu knows the ford.\n\n“And how, bhikkhus, does a bhikkhu know the draught? Here, bhikkhus, when the Dhamma and Vinaya proclaimed by the Tathāgata are taught, a bhikkhu gains understanding of the meaning, gains understanding of the Dhamma, and gains joy connected with the Dhamma. Thus, bhikkhus, a bhikkhu knows the draught.\n\n“And how, bhikkhus, does a bhikkhu know the path? Here, bhikkhus, a bhikkhu understands the Noble Eightfold Path as it truly is. Thus, bhikkhus, a bhikkhu knows the path.\n\n“And how, bhikkhus, is a bhikkhu skilled in the pasture? Here, bhikkhus, a bhikkhu understands the four establishments of mindfulness as they truly are. Thus, bhikkhus, a bhikkhu is skilled in the pasture.\n\n“And how, bhikkhus, is a bhikkhu one who milks with a remainder? Here, bhikkhus, faithful householders eagerly invite a bhikkhu with robes, almsfood, lodgings, and medicinal requisites for the sick. There, the bhikkhu knows the measure for receiving. Thus, bhikkhus, a bhikkhu is one who milks with a remainder.\n\n“And how, bhikkhus, does a bhikkhu honor with extra reverence those bhikkhus who are elders, long-experienced, long-ordained, fathers of the Saṅgha, leaders of the Saṅgha? Here, bhikkhus, regarding those elders, long-experienced, long-ordained, fathers of the Saṅgha, leaders of the Saṅgha, he establishes bodily acts of loving-kindness towards them, both openly and in private; he establishes verbal acts of loving-kindness towards them, both openly and in private; he establishes mental acts of loving-kindness towards them, both openly and in private. Thus, bhikkhus, a bhikkhu honors with extra reverence those bhikkhus who are elders, long-experienced, long-ordained, fathers of the Saṅgha, leaders of the Saṅgha.\n\n“A bhikkhu endowed with these eleven qualities, bhikkhus, is capable of achieving growth, increase, and fullness in this Dhamma and Vinaya.”",
      "sinhala": "‘‘මහණෙනි, එකොලොස් අංගයන්ගෙන් යුක්ත ගොපලුවා ගව සමූහයා පෝෂණය කිරීමටත්, දියුණු කිරීමටත් අසමත් වේ. ඒ මොන එකොලොස් අංගයන්ගෙන්ද? මහණෙනි, මෙහිලා ගොපලුවා රූපය නොහඳුනයි, ලක්‍ෂණ දැනීමෙහි දක්‍ෂ නැත, හිරිවැටීම් (ආසාටිකා) දුරු කරන්නෙක් නොවේ, තුවාල වසන්නෙක් නොවේ, දුම් දමන්නෙක් නොවේ, තොටුපළ නොදනී, පානය කරන තැන් නොදනී, මාර්ගය නොදනී, ගොදුරු බිමෙහි දක්‍ෂ නැත, ඉතිරි නොකර සියල්ල දොවන්නෙකි, යම් ඒ වැඩිමහලු ගවයෝ, ගව රංචුවේ පියවරු වූ, ගව රංචුවේ නායකයෝ වෙත්ද, ඒ ගවයන්ට අතිරේක පූජා කරන්නෙක් නොවේ. මහණෙනි, මෙන්න මේ එකොලොස් අංගයන්ගෙන් යුක්ත ගොපලුවා ගව සමූහයා පෝෂණය කිරීමටත්, දියුණු කිරීමටත් අසමත් වේ.\n\n‘‘මහණෙනි, එලෙසින්ම එකොලොස් ධර්මයන්ගෙන් යුක්ත භික්‍ෂුව මේ ධර්ම විනයෙහි වර්ධනයට, දියුණුවට, විපුල බවට පැමිණීමට අසමත් වේ. ඒ මොන එකොලොස් ධර්මයන්ගෙන්ද? මහණෙනි, මෙහිලා භික්‍ෂුව රූපය නොහඳුනයි, ලක්‍ෂණ දැනීමෙහි දක්‍ෂ නැත, (ඉපදුණු අකුසල්) දුරු කරන්නෙක් නොවේ, තුවාල වසන්නෙක් නොවේ, දුම් දමන්නෙක් නොවේ, තොටුපළ නොදනී, පානය කරන තැන් නොදනී, මාර්ගය නොදනී, ගොදුරු බිමෙහි දක්‍ෂ නැත, ඉතිරි නොකර සියල්ල පරිභෝජනය කරන්නෙකි, යම් ඒ භික්‍ෂූහු තෙරවරු වූ, බොහෝ කලක් පැවිදි වූ, සංඝ පියවරු වූ, සංඝ නායකයෝ වෙත්ද, ඒ භික්‍ෂූන්ට අතිරේක පූජා කරන්නෙක් නොවේ.\n\n‘‘මහණෙනි, භික්‍ෂුව රූපය නොහඳුනන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව යම් කිසි රූපයක් වේද, ‘මේවා සතර මහාභූතයෝය, සතර මහාභූතයන්ගෙන් හටගත් රූපයෝය’ කියා ඇති සැටියෙන් නොදනී. මහණෙනි, භික්‍ෂුව රූපය නොහඳුනන්නේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව ලක්‍ෂණ දැනීමෙහි දක්‍ෂ නැත්තේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව ‘කර්මය බාලයාගේ ලක්‍ෂණයයි, කර්මය පණ්ඩිතයාගේ ලක්‍ෂණයයි’ කියා ඇති සැටියෙන් නොදනී. මහණෙනි, භික්‍ෂුව ලක්‍ෂණ දැනීමෙහි දක්‍ෂ නැත්තේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව ඉපදුණු අකුසල් දුරු කරන්නෙක් නොවන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව ඉපදුණු කාම විතර්කය ඉවසයි, දුරු නොකරයි, විනෝද නොකරයි, නැති නොකරයි, නැවත නූපදනා සේ නොකරයි. ඉපදුණු ව්‍යාපාද විතර්කය ඉවසයි, දුරු නොකරයි, විනෝද නොකරයි, නැති නොකරයි, නැවත නූපදනා සේ නොකරයි. ඉපදුණු හිංසා විතර්කය ඉවසයි, දුරු නොකරයි, විනෝද නොකරයි, නැති නොකරයි, නැවත නූපදනා සේ නොකරයි. ඉපදුණු ඉපදුණු පාපී අකුසල ධර්මයන් ඉවසයි, දුරු නොකරයි, විනෝද නොකරයි, නැති නොකරයි, නැවත නූපදනා සේ නොකරයි. මහණෙනි, භික්‍ෂුව ඉපදුණු අකුසල් දුරු කරන්නෙක් නොවන්නේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව තුවාල වසන්නෙක් නොවන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව ඇසින් රූපයක් දැක සාමාන්‍ය ලක්‍ෂණ ග්‍රහණය කරයි, අනුලක්‍ෂණ ග්‍රහණය කරයි. යම් හෙයකින්, නොසංවරව වාසය කරන ඔහුගේ චක්ඛුන්ද්‍රියට අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්මයන් ඇතුළු විය හැකිද, ඔහුගේ ඒ සංවරය පිණිස පිළිපදින්නේ නැත. ඇසින්ද්‍රිය රකින්නේ නැත, ඇසින්ද්‍රියෙහි සංවරය ඇති කරගන්නේ නැත. කනින් ශබ්දයක් අසා සාමාන්‍ය ලක්‍ෂණ ග්‍රහණය කරයි, අනුලක්‍ෂණ ග්‍රහණය කරයි. යම් හෙයකින්, නොසංවරව වාසය කරන ඔහුගේ සෝතින්ද්‍රියට අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්මයන් ඇතුළු විය හැකිද, ඔහුගේ ඒ සංවරය පිණිස පිළිපදින්නේ නැත. කනින්ද්‍රිය රකින්නේ නැත, කනින්ද්‍රියෙහි සංවරය ඇති කරගන්නේ නැත. නාසයෙන් ගඳක් ආඝ්‍රාණය කොට සාමාන්‍ය ලක්‍ෂණ ග්‍රහණය කරයි, අනුලක්‍ෂණ ග්‍රහණය කරයි. යම් හෙයකින්, නොසංවරව වාසය කරන ඔහුගේ ඝානින්ද්‍රියට අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්මයන් ඇතුළු විය හැකිද, ඔහුගේ ඒ සංවරය පිණිස පිළිපදින්නේ නැත. නාසින්ද්‍රිය රකින්නේ නැත, නාසින්ද්‍රියෙහි සංවරය ඇති කරගන්නේ නැත. දිවෙන් රසයක් විඳ සාමාන්‍ය ලක්‍ෂණ ග්‍රහණය කරයි, අනුලක්‍ෂණ ග්‍රහණය කරයි. යම් හෙයකින්, නොසංවරව වාසය කරන ඔහුගේ ජිව්හින්ද්‍රියට අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්මයන් ඇතුළු විය හැකිද, ඔහුගේ ඒ සංවරය පිණිස පිළිපදින්නේ නැත. දිවෙන්ද්‍රිය රකින්නේ නැත, දිවෙන්ද්‍රියෙහි සංවරය ඇති කරගන්නේ නැත. කයින් ස්පර්ශයක් ස්පර්ශ කොට සාමාන්‍ය ලක්‍ෂණ ග්‍රහණය කරයි, අනුලක්‍ෂණ ග්‍රහණය කරයි. යම් හෙයකින්, නොසංවරව වාසය කරන ඔහුගේ කායින්ද්‍රියට අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්මයන් ඇතුළු විය හැකිද, ඔහුගේ ඒ සංවරය පිණිස පිළිපදින්නේ නැත. කයින්ද්‍රිය රකින්නේ නැත, කයින්ද්‍රියෙහි සංවරය ඇති කරගන්නේ නැත. මනසින් ධර්මයක් දැන සාමාන්‍ය ලක්‍ෂණ ග්‍රහණය කරයි, අනුලක්‍ෂණ ග්‍රහණය කරයි. යම් හෙයකින්, නොසංවරව වාසය කරන ඔහුගේ මනින්ද්‍රියට අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්මයන් ඇතුළු විය හැකිද, ඔහුගේ ඒ සංවරය පිණිස පිළිපදින්නේ නැත. මනසින්ද්‍රිය රකින්නේ නැත, මනසින්ද්‍රියෙහි සංවරය ඇති කරගන්නේ නැත. මහණෙනි, භික්‍ෂුව තුවාල වසන්නෙක් නොවන්නේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව දුම් දමන්නෙක් නොවන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව තමන් අසා දරාගත් ධර්මය විස්තර වශයෙන් අනුන්ට දේශනා කරන්නෙක් නොවේ. මහණෙනි, භික්‍ෂුව දුම් දමන්නෙක් නොවන්නේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව තොටුපළ නොදන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව යම් ඒ බොහෝ ඇසූ පිරූ තැන් ඇති, සම්ප්‍රදායයෙන් පැමිණි, ධර්මය දන්නා, විනය දන්නා, මාතිකා දන්නා භික්‍ෂූහු වෙත්ද, ඔවුන් වෙත කලින් කල පැමිණ, ‘පින්වත් ස්වාමීනි, මේ ධර්මය කෙසේද, මෙහි තේරුම කුමක්දැයි’ විමසන්නේ නැත, ප්‍රශ්න කරන්නේ නැත. ඔහුට ඒ ආයුෂ්මතුන් විසින් හෙළි නොකළ දේ හෙළි නොකරති, නොපැහැදිලි කළ දේ පැහැදිලි නොකරති, නොයෙක් ආකාර වූ සැක සහිත ධර්මයන්හි සැකය දුරු නොකරති. මහණෙනි, භික්‍ෂුව තොටුපළ නොදන්නේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව පානය කරන තැන් නොදන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරන කල්හි අර්ථය පිළිබඳ ප්‍රීතිය නොලබයි, ධර්මය පිළිබඳ ප්‍රීතිය නොලබයි, ධර්මයට අදාළ ප්‍රීතිය නොලබයි. මහණෙනි, භික්‍ෂුව පානය කරන තැන් නොදන්නේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව මාර්ගය නොදන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව ආර්ය අෂ්ටාංගික මාර්ගය ඇති සැටියෙන් නොදනී. මහණෙනි, භික්‍ෂුව මාර්ගය නොදන්නේ එලෙසිනි.\n\n‘‘මහණෙනි, භික්‍ෂුව ගොදුරු බිමෙහි දක්‍ෂ නැත්තේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව සතර සතිපට්ඨානයන් ඇති සැටියෙන් නොදනී.\n\nමහණෙනි, මෙලෙස භික්ෂුව තමන්ගේ විෂය පිළිබඳ දක්ෂ නොවේ.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව ඉතිරි නොකර දොවා ගන්නා කෙනෙක් වේද? මහණෙනි, මෙහිලා ශ්‍රද්ධාවන්ත ගෘහපතියෝ භික්ෂුවට සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් සහ පිරිකර ගෙනැවිත් පූජා කරති. එහිදී භික්ෂුව දානය පිළිගැනීමේ මාත්‍රාව නොදනී. මහණෙනි, මෙලෙස භික්ෂුව ඉතිරි නොකර දොවා ගන්නා කෙනෙක් වෙයි.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව යම් ඒ ස්ථවිර වූ, බොහෝ කල් පැවිදි වූ, රත්තිඥූ වූ, සංඝයාට පියවරු බඳු වූ, සංඝයාට නායකවරු බඳු වූ භික්ෂූන් වහන්සේලාට සුවිශේෂී ගෞරවයකින් පුද නොකරන්නේ වේද? මහණෙනි, මෙහිලා යම් ඒ ස්ථවිර වූ, බොහෝ කල් පැවිදි වූ, රත්තිඥූ වූ, සංඝයාට පියවරු බඳු වූ, සංඝයාට නායකවරු බඳු වූ භික්ෂූන් වහන්සේලා කෙරෙහි භික්ෂුව ප්‍රසිද්ධියේ හෝ රහසින් හෝ මෛත්‍රී සහගත කාය කර්මයක් නොපවත්වයි, ප්‍රසිද්ධියේ හෝ රහසින් හෝ මෛත්‍රී සහගත වචී කර්මයක් නොපවත්වයි, ප්‍රසිද්ධියේ හෝ රහසින් හෝ මෛත්‍රී සහගත මනෝ කර්මයක් නොපවත්වයි. මහණෙනි, මෙලෙස භික්ෂුව යම් ඒ ස්ථවිර වූ, බොහෝ කල් පැවිදි වූ, රත්තිඥූ වූ, සංඝයාට පියවරු බඳු වූ, සංඝයාට නායකවරු බඳු වූ භික්ෂූන් වහන්සේලාට සුවිශේෂී ගෞරවයකින් පුද නොකරන්නේ වෙයි.\n\nමහණෙනි, මේ එකොළොස් කරුණෙන් යුක්ත වූ භික්ෂුව මේ ධර්ම විනයෙහි වර්ධනයට, වැඩි දියුණුවට, මහත් බවට පත්වීමට නුසුදුසුය.\n\nමහණෙනි, එකොළොස් අංගයකින් යුක්ත වූ ගොපලුවා ගව සමූහයා රැකබලා ගැනීමටත්, දියුණු කිරීමටත් සමර්ථ වෙයි. කවර නම් එකොළොසකින් ද? මහණෙනි, මෙහිලා ගොපලුවා ගවයන්ගේ රූපය (පෙනුම) දන්නේ වෙයි, ලක්ෂණ පිළිබඳ දක්ෂ වෙයි, මැසි මදුරු කරදර දුරු කරන්නේ වෙයි, තුවාල වසන්නේ වෙයි, දුම් අල්ලන්නේ වෙයි, ජලය බීමට සුදුසු තැන් දන්නේ වෙයි, බීමට සුදුසු ජලය දන්නේ වෙයි, ගමන් මාර්ග දන්නේ වෙයි, තණබිම් පිළිබඳ දක්ෂ වෙයි, ඉතිරි කර දොවා ගන්නා කෙනෙක් වෙයි, යම් ඒ ගවයන්ට පියවරු බඳු වූ, ගවයන්ට නායකවරු බඳු වූ වෘෂභයන්ට සුවිශේෂී ගෞරවයකින් පුද කරන්නේ වෙයි – මහණෙනි, මේ එකොළොස් අංගයෙන් යුක්ත වූ ගොපලුවා ගව සමූහයා රැකබලා ගැනීමටත්, දියුණු කිරීමටත් සමර්ථ වෙයි.\n\nමහණෙනි, එපරිද්දෙන්ම එකොළොස් ධර්මයකින් යුක්ත වූ භික්ෂුව මේ ධර්ම විනයෙහි වර්ධනයට, වැඩි දියුණුවට, මහත් බවට පත්වීමට සමර්ථ වෙයි. කවර නම් එකොළොසකින් ද? මහණෙනි, මෙහිලා භික්ෂුව රූපය දන්නේ වෙයි, ලක්ෂණ පිළිබඳ දක්ෂ වෙයි, කෙලෙස් ආසාදන දුරු කරන්නේ වෙයි, තුවාල වසන්නේ වෙයි, දුම් අල්ලන්නේ වෙයි, තිත්ථය දන්නේ වෙයි, පානය කළ යුත්ත දන්නේ වෙයි, මාර්ගය දන්නේ වෙයි, තමන්ගේ විෂය පිළිබඳ දක්ෂ වෙයි, ඉතිරි කර දොවා ගන්නා කෙනෙක් වෙයි, යම් ඒ ස්ථවිර වූ, බොහෝ කල් පැවිදි වූ, රත්තිඥූ වූ, සංඝයාට පියවරු බඳු වූ, සංඝයාට නායකවරු බඳු වූ භික්ෂූන් වහන්සේලාට සුවිශේෂී ගෞරවයකින් පුද කරන්නේ වෙයි.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව රූපය දන්නේ වේද? මහණෙනි, මෙහිලා භික්ෂුව යම් කිසි රූපයක් වේද, එය ‘සිව් මහා භූතයන්ගෙන් හටගත්, සිව් මහා භූතයන් උපාදාන කොටගත් රූපයකි’ යැයි යථාර්ථය පරිදි දනී. මහණෙනි, මෙලෙස භික්ෂුව රූපය දන්නේ වෙයි.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව ලක්ෂණ පිළිබඳ දක්ෂ වෙයිද? මහණෙනි, මෙහිලා භික්ෂුව ‘කර්මය අඥානයාගේ ලක්ෂණයයි, කර්මය පණ්ඩිතයාගේ ලක්ෂණයයි’ යැයි යථාර්ථය පරිදි දනී. මහණෙනි, මෙලෙස භික්ෂුව ලක්ෂණ පිළිබඳ දක්ෂ වෙයි.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව කෙලෙස් ආසාදන දුරු කරන්නේ වේද? මහණෙනි, මෙහිලා භික්ෂුව උපන් කාම විතර්කය නොඉවසයි, එය පහකරයි, දුරු කරයි, නැතිකරයි, නැති භාවයට පත් කරයි. උපන් ව්‍යාපාද විතර්කය නොඉවසයි, පහකරයි, දුරු කරයි, නැතිකරයි, නැති භාවයට පත් කරයි. උපන් විහිංසා විතර්කය නොඉවසයි, පහකරයි, දුරු කරයි, නැතිකරයි, නැති භාවයට පත් කරයි. උපන් උපන් සියලු පාපී අකුසල ධර්මයන් නොඉවසයි, පහකරයි, දුරු කරයි, නැතිකරයි, නැති භාවයට පත් කරයි. මහණෙනි, මෙලෙස භික්ෂුව කෙලෙස් ආසාදන දුරු කරන්නේ වෙයි.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව තුවාල (ඉන්ද්‍රියන්ගේ දුර්වලතා) වසන්නේ (රැක ගන්නේ) වේද? මහණෙනි, මෙහිලා භික්ෂුව ඇසෙන් රූපයක් දැක එහි නිමිති නොගනී, අනු ව්‍යංජන නොගනී; යම් හේතුවකින් මේ චක්ෂු ඉන්ද්‍රිය අසංවරව වාසය කරන්නහු කෙරෙහි ලෝභය හා ද්වේශය මුල්කරගත් පාපී අකුසල ධර්මයන් ඇතුළු වීමට ඉඩ ඇත්ද, එනිසා ඔහු එය සංවර කිරීම පිණිස පිළිපදී; චක්ෂු ඉන්ද්‍රිය ආරක්ෂා කරයි, චක්ෂු ඉන්ද්‍රියෙහි සංවරය ඇතිකරයි. කණින් ශබ්දයක් අසා එහි නිමිති නොගනී, අනු ව්‍යංජන නොගනී; යම් හේතුවකින් මේ ශ්‍රෝත ඉන්ද්‍රිය අසංවරව වාසය කරන්නහු කෙරෙහි ලෝභය හා ද්වේශය මුල්කරගත් පාපී අකුසල ධර්මයන් ඇතුළු වීමට ඉඩ ඇත්ද, එනිසා ඔහු එය සංවර කිරීම පිණිස පිළිපදී; ශ්‍රෝත ඉන්ද්‍රිය ආරක්ෂා කරයි, ශ්‍රෝත ඉන්ද්‍රියෙහි සංවරය ඇතිකරයි. නාසයෙන් ගන්ධයක් ආඝ්‍රාණය කර එහි නිමිති නොගනී, අනු ව්‍යංජන නොගනී; යම් හේතුවකින් මේ ඝ්‍රාණ ඉන්ද්‍රිය අසංවරව වාසය කරන්නහු කෙරෙහි ලෝභය හා ද්වේශය මුල්කරගත් පාපී අකුසල ධර්මයන් ඇතුළු වීමට ඉඩ ඇත්ද, එනිසා ඔහු එය සංවර කිරීම පිණිස පිළිපදී; ඝ්‍රාණ ඉන්ද්‍රිය ආරක්ෂා කරයි, ඝ්‍රාණ ඉන්ද්‍රියෙහි සංවරය ඇතිකරයි. දිවෙන් රසයක් විඳ එහි නිමිති නොගනී, අනු ව්‍යංජන නොගනී; යම් හේතුවකින් මේ ජිහ්වා ඉන්ද්‍රිය අසංවරව වාසය කරන්නහු කෙරෙහි ලෝභය හා ද්වේශය මුල්කරගත් පාපී අකුසල ධර්මයන් ඇතුළු වීමට ඉඩ ඇත්ද, එනිසා ඔහු එය සංවර කිරීම පිණිස පිළිපදී; ජිහ්වා ඉන්ද්‍රිය ආරක්ෂා කරයි, ජිහ්වා ඉන්ද්‍රියෙහි සංවරය ඇතිකරයි. කයින් ස්පර්ශයක් දැන එහි නිමිති නොගනී, අනු ව්‍යංජන නොගනී; යම් හේතුවකින් මේ කාය ඉන්ද්‍රිය අසංවරව වාසය කරන්නහු කෙරෙහි ලෝභය හා ද්වේශය මුල්කරගත් පාපී අකුසල ධර්මයන් ඇතුළු වීමට ඉඩ ඇත්ද, එනිසා ඔහු එය සංවර කිරීම පිණිස පිළිපදී; කාය ඉන්ද්‍රිය ආරක්ෂා කරයි, කාය ඉන්ද්‍රියෙහි සංවරය ඇතිකරයි. මනසින් ධර්මයක් දැනගෙන එහි නිමිති නොගනී, අනු ව්‍යංජන නොගනී; යම් හේතුවකින් මේ මනෝ ඉන්ද්‍රිය අසංවරව වාසය කරන්නහු කෙරෙහි ලෝභය හා ද්වේශය මුල්කරගත් පාපී අකුසල ධර්මයන් ඇතුළු වීමට ඉඩ ඇත්ද, එනිසා ඔහු එය සංවර කිරීම පිණිස පිළිපදී; මනෝ ඉන්ද්‍රිය ආරක්ෂා කරයි, මනෝ ඉන්ද්‍රියෙහි සංවරය ඇතිකරයි. මහණෙනි, මෙලෙස භික්ෂුව තුවාල (ඉන්ද්‍රියන්ගේ දුර්වලතා) වසන්නේ (රැක ගන්නේ) වෙයි.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව දුම් අල්ලන්නේ (ධර්ම දේශනා කරන්නේ) වේද? මහණෙනි, මෙහිලා භික්ෂුව යම් සේ ධර්මය අසා ඇත්ද, යම් සේ ධර්මය ඉගෙන ගෙන ඇත්ද, ඒ ධර්මය අන්‍යයන්ට විස්තරාත්මකව දේශනා කරයි. මහණෙනි, මෙලෙස භික්ෂුව දුම් අල්ලන්නේ (ධර්ම දේශනා කරන්නේ) වෙයි.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව තිත්ථය (ධර්ම ගංගාවෙහි තොටුපළ) දන්නේ වේද? මහණෙනි, මෙහිලා භික්ෂුව යම් ඒ බොහෝ ඇසූ පිරූ තැන් ඇති, ආගමයන්හි කෙළවරට පැමිණි (ග්‍රන්ථධාරී), ධර්මය දරන්නා වූ, විනය දරන්නා වූ, මාතිකා දරන්නා වූ භික්ෂූන් වහන්සේලා වේද, ඒ උතුමන් වෙත කලින් කලට එළඹ, ‘ස්වාමීනි, මෙය කෙසේද, මෙහි අර්ථය කුමක්දැ’යි විමසයි, ප්‍රශ්න කරයි.\n\nඒ ආයුෂ්මත්හු ඔහුට නොවැසූ දේ විවෘත කරති, නොපැහැදිලි කළ දේ පැහැදිලි කරති, නොයෙක් ආකාර වූ සැක ඇතිවන ධර්මයන්හි සැකය දුරු කරති. මහණෙනි, මෙසේ මහණ තොට හඳුනාගනියි.\n\nමහණෙනි, මහණ කෙසේ නම් පානය කරන ලද්ද හඳුනාගනියි ද? මහණෙනි, මෙහිලා මහණ තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනය දේශනා කරනු ලබන කල්හි, ඔහුට අර්ථය පිළිබඳ අවබෝධය ලැබේ, ධර්මය පිළිබඳ අවබෝධය ලැබේ, ධර්මයට සම්බන්ධ ප්‍රමෝදය ලැබේ. මහණෙනි, මෙසේ මහණ පානය කරන ලද්ද හඳුනාගනියි.\n\nමහණෙනි, මහණ කෙසේ නම් මඟ හඳුනාගනියි ද? මහණෙනි, මෙහිලා මහණ ආර්ය අෂ්ටාංගික මාර්ගය ඇති සැටියෙන් අවබෝධ කරගනියි. මහණෙනි, මෙසේ මහණ මඟ හඳුනාගනියි.\n\nමහණෙනි, මහණ කෙසේ නම් ගෝචරයට දක්ෂ වේ ද? මහණෙනි, මෙහිලා මහණ සිහිනුවණ පිහිටුවාගන්නා ස්ථාන සතර (සතර සතිපට්ඨාන) ඇති සැටියෙන් අවබෝධ කරගනියි. මහණෙනි, මෙසේ මහණ ගෝචරයට දක්ෂ වේ.\n\nමහණෙනි, මහණ කෙසේ නම් ඉතිරි කොට දොවන සුලු වේ ද? මහණෙනි, මෙහිලා සැදැහැති ගෘහපතියෝ සිව්රු, පිණ්ඩපාතය, සෙනසුන්, ගිලන්පස බෙහෙත් පරිස්කාර ආදියෙන් මහණහට ගෙනත් පවරති. එහිලා මහණ ඒවා පිළිගැනීමේ පමණ දනියි. මහණෙනි, මෙසේ මහණ ඉතිරි කොට දොවන සුලු වේ.\n\nමහණෙනි, මහණ කෙසේ නම් යම් ඒ තෙරවරු, දීර්ඝ කාලීන වූ, බොහෝ කලක් පැවිදි වූ, සංඝයාගේ පියවරු වූ, සංඝයා මෙහෙයවන්නා වූ භික්ෂූහු වෙත් ද, ඒ භික්ෂූන්ට අතිරේක පූජාවෙන් පුදන්නේ වේ ද? මහණෙනි, මෙහිලා යම් ඒ තෙරවරු, දීර්ඝ කාලීන වූ, බොහෝ කලක් පැවිදි වූ, සංඝයාගේ පියවරු වූ, සංඝයා මෙහෙයවන්නා වූ භික්ෂූහු වෙත් ද, ඔහු ඔවුන් කෙරෙහි ප්‍රසිද්ධියේ ද රහසින් ද මෛත්‍රී සහගත කාය කර්මයක් ඉටු කරයි, ප්‍රසිද්ධියේ ද රහසින් ද මෛත්‍රී සහගත වචී කර්මයක් ඉටු කරයි, ප්‍රසිද්ධියේ ද රහසින් ද මෛත්‍රී සහගත මනෝ කර්මයක් ඉටු කරයි. මහණෙනි, මෙසේ මහණ යම් ඒ තෙරවරු, දීර්ඝ කාලීන වූ, බොහෝ කලක් පැවිදි වූ, සංඝයාගේ පියවරු වූ, සංඝයා මෙහෙයවන්නා වූ භික්ෂූහු වෙත් ද, ඒ භික්ෂූන්ට අතිරේක පූජාවෙන් පුදන්නේ වේ.\n\nමහණෙනි, මේ එකොළොස් ධර්මයන්ගෙන් යුක්ත වූ මහණ මේ ධර්මවිනයෙහි වැඩීම, වර්ධනය වීම සහ සම්පූර්ණත්වය ලබා ගැනීමට සමර්ථ වේ.",
      "paliTitle": "Gopālasuttaṃ"
    },
    {
      "number": 18,
      "pali": "[a. ni. 10.6] Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘Siyā nu kho, bhante, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Siyā, bhikkhave, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe. … yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. ‘‘Yathā kathaṃ pana, bhante, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Idha, bhikkhave, bhikkhu evaṃsaññī hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, bhikkhave, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. Aṭṭhamaṃ.",
      "english": "Then, many monks approached the Blessed One; having approached, they saluted the Blessed One and sat down to one side.\n\nSeated to one side, those monks said to the Blessed One: \"Venerable Sir, is it possible for a monk to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the sphere of infinite space as the sphere of infinite space, nor the sphere of infinite consciousness as the sphere of infinite consciousness, nor the sphere of nothingness as the sphere of nothingness, nor the sphere of neither perception nor non-perception as the sphere of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; and he would not perceive that which is seen, heard, sensed, cognized, attained, sought, and investigated by the mind; yet still be perceiving?\"\n\n\"It is possible, monks, for a monk to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the sphere of infinite space as the sphere of infinite space, nor the sphere of infinite consciousness as the sphere of infinite consciousness, nor the sphere of nothingness as the sphere of nothingness, nor the sphere of neither perception nor non-perception as the sphere of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; and he would not perceive that which is seen, heard, sensed, cognized, attained, sought, and investigated by the mind; yet still be perceiving,\" said the Blessed One.\n\n\"But how, Venerable Sir, is it possible for a monk to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the sphere of infinite space as the sphere of infinite space, nor the sphere of infinite consciousness as the sphere of infinite consciousness, nor the sphere of nothingness as the sphere of nothingness, nor the sphere of neither perception nor non-perception as the sphere of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; and he would not perceive that which is seen, heard, sensed, cognized, attained, sought, and investigated by the mind; yet still be perceiving?\"\n\n\"Here, monks, a monk perceives thus: 'This is peaceful, this is sublime: namely, the calming of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna.' It is in this way, monks, that a monk attains such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the sphere of infinite space as the sphere of infinite space, nor the sphere of infinite consciousness as the sphere of infinite consciousness, nor the sphere of nothingness as the sphere of nothingness, nor the sphere of neither perception nor non-perception as the sphere of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; and he would not perceive that which is seen, heard, sensed, cognized, attained, sought, and investigated by the mind; yet still be perceiving.\"",
      "sinhala": "එවිට බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක වාඩිවූහ. එක් පසෙක වාඩිවී සිටි ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ:\n\n\"ස්වාමීනි, භික්ෂුවකට එවන් සමාධි ප්‍රතිලාභයක් ලැබිය හැකිද? යම් ආකාරයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාශානන්ත්‍යායතනයෙහි ආකාශානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණානන්ත්‍යායතනයෙහි විඤ්ඤාණානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, මෙලොවෙහි මෙලොව සංඥාවෙන් යුක්ත නොවන්නේද, පරලොවෙහි පරලොව සංඥාවෙන් යුක්ත නොවන්නේද, යම් යම් දේ දක්නා ලද, ශ්‍රවණය කරන ලද, අත්විඳින ලද, දැනගන්නා ලද, අත්කරගන්නා ලද, සොයන ලද, සිතින් විමසන ලද වේද, එහිද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් සංඥාවෙන් යුක්ත වන්නේද?\"\n\n\"මහණෙනි, භික්ෂුවකට එවන් සමාධි ප්‍රතිලාභයක් ලැබිය හැකිය. යම් ආකාරයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාශානන්ත්‍යායතනයෙහි ආකාශානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණානන්ත්‍යායතනයෙහි විඤ්ඤාණානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, මෙලොවෙහි මෙලොව සංඥාවෙන් යුක්ත නොවන්නේද, පරලොවෙහි පරලොව සංඥාවෙන් යුක්ත නොවන්නේද, යම් යම් දේ දක්නා ලද, ශ්‍රවණය කරන ලද, අත්විඳින ලද, දැනගන්නා ලද, අත්කරගන්නා ලද, සොයන ලද, සිතින් විමසන ලද වේද, එහිද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් සංඥාවෙන් යුක්ත වන්නේය.\"\n\n\"ස්වාමීනි, එසේනම් භික්ෂුවකට එවන් සමාධි ප්‍රතිලාභයක් ලැබෙන්නේ කෙසේද? යම් ආකාරයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාශානන්ත්‍යායතනයෙහි ආකාශානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණානන්ත්‍යායතනයෙහි විඤ්ඤාණානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, මෙලොවෙහි මෙලොව සංඥාවෙන් යුක්ත නොවන්නේද, පරලොවෙහි පරලොව සංඥාවෙන් යුක්ත නොවන්නේද, යම් යම් දේ දක්නා ලද, ශ්‍රවණය කරන ලද, අත්විඳින ලද, දැනගන්නා ලද, අත්කරගන්නා ලද, සොයන ලද, සිතින් විමසන ලද වේද, එහිද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් සංඥාවෙන් යුක්ත වන්නේද?\"\n\n\"මහණෙනි, මෙහිදී භික්ෂුව මෙසේ සංඥා කරන්නේය: ‘මෙය ශාන්තය, මෙය ප්‍රණීතය. එනම්, සියලු සංස්කාරයන් සංහිඳවීමය, සියලු උපධීන් අත්හැරීමය, තණ්හාව ක්ෂය කිරීමය, විරාගයය, නිරෝධයය, නිර්වාණයය.’ මහණෙනි, මෙසේය භික්ෂුවකට එවන් සමාධි ප්‍රතිලාභයක් ලැබිය හැක්කේ. යම් ආකාරයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාශානන්ත්‍යායතනයෙහි ආකාශානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණානන්ත්‍යායතනයෙහි විඤ්ඤාණානන්ත්‍යායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, මෙලොවෙහි මෙලොව සංඥාවෙන් යුක්ත නොවන්නේද, පරලොවෙහි පරලොව සංඥාවෙන් යුක්ත නොවන්නේද, යම් යම් දේ දක්නා ලද, ශ්‍රවණය කරන ලද, අත්විඳින ලද, දැනගන්නා ලද, අත්කරගන්නා ලද, සොයන ලද, සිතින් විමසන ලද වේද, එහිද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් සංඥාවෙන් යුක්ත වන්නේය.\"",
      "paliTitle": "Paṭhamasamādhisuttaṃ"
    },
    {
      "number": 19,
      "pali": "Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Siyā nu kho bhikkhave, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa…pe… na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Siyā, bhikkhave, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. ‘‘Yathā kathaṃ pana, bhante, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Idha, bhikkhave, bhikkhu evaṃsaññī hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, bhikkhave, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe. … yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. Navamaṃ.",
      "english": "Then, indeed, the Blessed One addressed the monks, \"Monks!\"\n\n\"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"Is it possible, monks, for a monk to attain such a state of concentration that he is not percipient of earth as earth, not percipient of water as water, not percipient of fire as fire, not percipient of wind as wind, not percipient of the dimension of space as the dimension of space, not percipient of the dimension of consciousness as the dimension of consciousness, not percipient of the dimension of nothingness as the dimension of nothingness, not percipient of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, not percipient of this world as this world, not percipient of the other world as the other world; and regarding whatever is seen, heard, sensed, cognized, attained, searched for, and pondered upon by the mind, he is not percipient of that either; yet still, he is percipient?\"\n\n\"For us, Venerable Sir, the teachings have the Blessed One as their root, the Blessed One as their guide, the Blessed One as their refuge. It would be good, Venerable Sir, if the Blessed One himself would reveal the meaning of this statement. Having heard it from the Blessed One, the monks will bear it in mind.\"\n\n\"Then, monks, listen, attend carefully; I will speak.\"\n\n\"Yes, Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"It is possible, monks, for a monk to attain such a state of concentration that he is not percipient of earth as earth, not percipient of water as water, not percipient of fire as fire, not percipient of wind as wind, not percipient of the dimension of space as the dimension of space, not percipient of the dimension of consciousness as the dimension of consciousness, not percipient of the dimension of nothingness as the dimension of nothingness, not percipient of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, not percipient of this world as this world, not percipient of the other world as the other world; and regarding whatever is seen, heard, sensed, cognized, attained, searched for, and pondered upon by the mind, he is not percipient of that either; yet still, he is percipient.\"\n\n\"But how then, Venerable Sir, is it possible for a monk to attain such a state of concentration that he is not percipient of earth as earth, not percipient of water as water, not percipient of fire as fire, not percipient of wind as wind, not percipient of the dimension of space as the dimension of space, not percipient of the dimension of consciousness as the dimension of consciousness, not percipient of the dimension of nothingness as the dimension of nothingness, not percipient of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, not percipient of this world as this world, not percipient of the other world as the other world; and regarding whatever is seen, heard, sensed, cognized, attained, searched for, and pondered upon by the mind, he is not percipient of that either; yet still, he is percipient?\"\n\n\"Here, monks, a monk perceives thus: 'This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishment of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.' It is in this way, monks, that a monk can attain such a state of concentration that he is not percipient of earth as earth, not percipient of water as water, not percipient of fire as fire, not percipient of wind as wind, not percipient of the dimension of space as the dimension of space, not percipient of the dimension of consciousness as the dimension of consciousness, not percipient of the dimension of nothingness as the dimension of nothingness, not percipient of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, not percipient of this world as this world, not percipient of the other world as the other world; and regarding whatever is seen, heard, sensed, cognized, attained, searched for, and pondered upon by the mind, he is not percipient of that either; yet still, he is percipient.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා “භික්ෂූනි” යැයි වදාළ සේක. “වහන්සැ” යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “භික්ෂූනි, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් තිබිය හැකිද, යම් හෙයකින් ඔහු පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවෙන් යුක්ත නොවන්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් යුක්ත නොවන්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් යුක්ත නොවන්නේද, යම් මේ දකින ලද්දක්, අසන ලද්දක්, අත්විඳින ලද්දක්, දන්නා ලද්දක්, ලබන ලද්දක්, සොයන ලද්දක්, මනසින් විමසන ලද්දක් ඇත්ද, එතැනද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් ඔහු සංඥාවෙන් යුක්තව සිටින්නේයැයි කීමද හැකිද?”\n\n“වහන්ස, අපගේ ධර්මයන්ට භාග්‍යවතුන් වහන්සේම මුලය, භාග්‍යවතුන් වහන්සේම නායකත්වය සපයයි, භාග්‍යවතුන් වහන්සේම පිහිටය. වහන්ස, මේ දේශනාවේ තේරුම භාග්‍යවතුන් වහන්සේටම පැහැදිලි කිරීමට සුදුසුය. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහ.”\n\n“එසේ නම්, භික්ෂූනි, අසන්න. මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි”යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. “එසේය, වහන්සැ” යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“භික්ෂූනි, භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් තිබිය හැකිය, යම් හෙයකින් ඔහු පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවෙන් යුක්ත නොවන්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් යුක්ත නොවන්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් යුක්ත නොවන්නේද, යම් මේ දකින ලද්දක්, අසන ලද්දක්, අත්විඳින ලද්දක්, දන්නා ලද්දක්, ලබන ලද්දක්, සොයන ලද්දක්, මනසින් විමසන ලද්දක් ඇත්ද, එතැනද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් ඔහු සංඥාවෙන් යුක්තව සිටින්නේය.”\n\n“වහන්ස, එසේනම් භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් තිබිය හැක්කේ කෙසේද, යම් හෙයකින් ඔහු පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවෙන් යුක්ත නොවන්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් යුක්ත නොවන්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් යුක්ත නොවන්නේද, යම් මේ දකින ලද්දක්, අසන ලද්දක්, අත්විඳින ලද්දක්, දන්නා ලද්දක්, ලබන ලද්දක්, සොයන ලද්දක්, මනසින් විමසන ලද්දක් ඇත්ද, එතැනද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් ඔහු සංඥාවෙන් යුක්තව සිටින්නේයැයි කීමද හැකිද?”\n\n“භික්ෂූනි, මෙහිලා භික්ෂුව මෙසේ සංඥා කරන්නේය – ‘මෙය ශාන්තය, මෙය ප්‍රණීතය, එනම් සියලු සංස්කාරයන්ගේ සංසිඳීමය, සියලු උපධීන් අත්හැරීමය, තණ්හාව ක්ෂය කිරීමය, විරාගයය, නිරෝධයය, නිර්වාණයය’ යනුවෙනි. භික්ෂූනි, මෙසේ භික්ෂුවකට මෙවැනි සමාධි ප්‍රතිලාභයක් තිබිය හැකිය, යම් හෙයකින් ඔහු පෘථිවියෙහි පෘථිවි සංඥාවෙන් යුක්ත නොවන්නේද, ජලයෙහි ජල සංඥාවෙන් යුක්ත නොවන්නේද, තේජසෙහි තේජස් සංඥාවෙන් යුක්ත නොවන්නේද, වායුවෙහි වායු සංඥාවෙන් යුක්ත නොවන්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් යුක්ත නොවන්නේද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවෙන් යුක්ත නොවන්නේද, නේවසංඥානාසංඥායතනයෙහි නේවසංඥානාසංඥායතන සංඥාවෙන් යුක්ත නොවන්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් යුක්ත නොවන්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් යුක්ත නොවන්නේද, යම් මේ දකින ලද්දක්, අසන ලද්දක්, අත්විඳින ලද්දක්, දන්නා ලද්දක්, ලබන ලද්දක්, සොයන ලද්දක්, මනසින් විමසන ලද්දක් ඇත්ද, එතැනද සංඥාවෙන් යුක්ත නොවන්නේද; එහෙත් ඔහු සංඥාවෙන් යුක්තව සිටින්නේය.”",
      "paliTitle": "Dutiyasamādhisuttaṃ"
    },
    {
      "number": 20,
      "pali": "[a. ni. 10.7] Atha kho sambahulā bhikkhū yenāyasmā sāriputto tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū āyasmantaṃ sāriputtaṃ etadavocuṃ – ‘‘Siyā nu kho, āvuso sāriputta, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Siyā, āvuso, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. ‘‘Yathā kathaṃ pana, āvuso sāriputta, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Idha, āvuso, bhikkhu evaṃsaññī hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, āvuso, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. Dasamaṃ.",
      "english": "Then many bhikkhus approached Venerable Sāriputta; having approached, they exchanged greetings with Venerable Sāriputta. Having concluded their courteous and memorable talk, they sat down to one side. Seated to one side, those bhikkhus said this to Venerable Sāriputta: “Friend Sāriputta, is it possible for a bhikkhu to attain such a concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; nor that which is seen, heard, sensed, cognized, attained, sought, or investigated by the mind; yet he would still be percipient?” “Yes, friend, it is possible for a bhikkhu to attain such a concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; nor that which is seen, heard, sensed, cognized, attained, sought, or investigated by the mind; yet he would still be percipient.” “But how, friend Sāriputta, is it possible for a bhikkhu to attain such a concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; nor that which is seen, heard, sensed, cognized, attained, sought, or investigated by the mind; yet he would still be percipient?” “Here, friend, a bhikkhu perceives thus: ‘This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishing of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.’ It is in this way, friend, that a bhikkhu can attain such a concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world; nor that which is seen, heard, sensed, cognized, attained, sought, or investigated by the mind; yet he would still be percipient.”",
      "sinhala": "එකල්හි බොහෝ භික්ෂූහු ආයුෂ්මත් ශ්‍රී‍රාවතුන් වහන්සේ වෙත පැමිණියහ; පැමිණ, ආයුෂ්මත් ශ්‍රී‍රාවතුන් වහන්සේ සමඟ සතුටු සාමිචි කතා පවත්වමින් සතුටු වූහ. සිත් ඇදගන්නාසුළු පිළිසඳර කතා අවසන් කොට ඔවුහු එක් පසෙකින් වාඩි වූහ.\n\nඑක් පසෙකින් වාඩි වී සිටි ඒ භික්ෂූහු ආයුෂ්මත් ශ්‍රී‍රාවතුන් වහන්සේට මෙසේ කීහ: “ඇවැත් ශ්‍රී‍රාවත, භික්ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකිද, යම් සමාධියකින් පෘථිවියෙහි පෘථිවි සංඥාවක් නොපවතීද, ජලයෙහි ජල සංඥාවක් නොපවතීද, තේජසෙහි තේජස් සංඥාවක් නොපවතීද, වායුවෙහි වායු සංඥාවක් නොපවතීද, ආකාශානන්ත්‍යයෙහි ආකාශානන්ත්‍ය සංඥාවක් නොපවතීද, විඥාණානන්ත්‍යයෙහි විඥාණානන්ත්‍ය සංඥාවක් නොපවතීද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් නොපවතීද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ද නොපවතීද; එසේම යම් මේ දක්නා ලද, අසන ලද, අත්විඳින ලද, විඥානයෙන් දන්නා ලද, අත්පත් කරගත්, සොයන ලද, සිතින් විමසන ලද යමක් ඇත්ද, ඒ පිළිබඳව ද සංඥාවක් නොපවතීද; එනමුත් සංඥාවක් පවතීද?”\n\n“ඇවැත්නි, භික්ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකිය, යම් සමාධියකින් පෘථිවියෙහි පෘථිවි සංඥාවක් නොපවතීද, ජලයෙහි ජල සංඥාවක් නොපවතීද, තේජසෙහි තේජස් සංඥාවක් නොපවතීද, වායුවෙහි වායු සංඥාවක් නොපවතීද, ආකාශානන්ත්‍යයෙහි ආකාශානන්ත්‍ය සංඥාවක් නොපවතීද, විඥාණානන්ත්‍යයෙහි විඥාණානන්ත්‍ය සංඥාවක් නොපවතීද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් නොපවතීද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ද නොපවතීද; එසේම යම් මේ දක්නා ලද, අසන ලද, අත්විඳින ලද, විඥානයෙන් දන්නා ලද, අත්පත් කරගත්, සොයන ලද, සිතින් විමසන ලද යමක් ඇත්ද, ඒ පිළිබඳව ද සංඥාවක් නොපවතීද; එනමුත් සංඥාවක් පවතී.”\n\n“ඇවැත් ශ්‍රී‍රාවත, කෙසේ නම් භික්ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකිද, යම් සමාධියකින් පෘථිවියෙහි පෘථිවි සංඥාවක් නොපවතීද, ජලයෙහි ජල සංඥාවක් නොපවතීද, තේජසෙහි තේජස් සංඥාවක් නොපවතීද, වායුවෙහි වායු සංඥාවක් නොපවතීද, ආකාශානන්ත්‍යයෙහි ආකාශානන්ත්‍ය සංඥාවක් නොපවතීද, විඥාණානන්ත්‍යයෙහි විඥාණානන්ත්‍ය සංඥාවක් නොපවතීද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් නොපවතීද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ද නොපවතීද; එසේම යම් මේ දක්නා ලද, අසන ලද, අත්විඳින ලද, විඥානයෙන් දන්නා ලද, අත්පත් කරගත්, සොයන ලද, සිතින් විමසන ලද යමක් ඇත්ද, ඒ පිළිබඳව ද සංඥාවක් නොපවතීද; එනමුත් සංඥාවක් පවතීද?”\n\n“ඇවැත්නි, මෙහිලා භික්ෂුව මෙසේ සංඥා කරයි: ‘සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපාධීන් අත්හැරීම, තණ්හාව ක්ෂය කිරීම, වෛරාග්‍යය, නිරෝධය, නිර්වාණය යනු මේ ශාන්තය, මේ ප්‍රණීතය’යි.”\n\n“ඇවැත්නි, මෙසේ නම් භික්ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකිය, යම් සමාධියකින් පෘථිවියෙහි පෘථිවි සංඥාවක් නොපවතීද, ජලයෙහි ජල සංඥාවක් නොපවතීද, තේජසෙහි තේජස් සංඥාවක් නොපවතීද, වායුවෙහි වායු සංඥාවක් නොපවතීද, ආකාශානන්ත්‍යයෙහි ආකාශානන්ත්‍ය සංඥාවක් නොපවතීද, විඥාණානන්ත්‍යයෙහි විඥාණානන්ත්‍ය සංඥාවක් නොපවතීද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් නොපවතීද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ද නොපවතීද; එසේම යම් මේ දක්නා ලද, අසන ලද, අත්විඳින ලද, විඥානයෙන් දන්නා ලද, අත්පත් කරගත්, සොයන ලද, සිතින් විමසන ලද යමක් ඇත්ද, ඒ පිළිබඳව ද සංඥාවක් නොපවතීද; එනමුත් සංඥාවක් පවතී.”",
      "paliTitle": "Tatiyasamādhisuttaṃ"
    },
    {
      "number": 21,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘siyā nu kho, āvuso, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Dūratopi kho mayaṃ, āvuso, āgaccheyyāma āyasmato sāriputtassa santike etassa bhāsitassa atthamaññātuṃ. Sādhu vatāyasmantaṃyeva sāriputtaṃ paṭibhātu etassa bhāsitassa attho. Āyasmato sāriputtassa sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahāvuso, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Siyā, āvuso bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa… pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. ‘‘Yathā kathaṃ panāvuso, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti? ‘‘Idha, āvuso, bhikkhu evaṃsaññī hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, āvuso, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa, yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tatrāpi na saññī assa; saññī ca pana assā’’ti. Ekādasamaṃ. ",
      "english": "There, indeed, the Venerable Sāriputta addressed the monks: \"Is it possible, friends, for a monk to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, and investigated by the mind, he would not perceive that; yet he would still be conscious?\"\n\"Even from afar, friends, we would come to the Venerable Sāriputta to understand the meaning of this statement. It would be good if the Venerable Sāriputta himself would clarify the meaning of this statement. Having heard from the Venerable Sāriputta, the monks will remember it.\"\n\"Therefore, friends, listen, pay close attention; I will speak.\" \"Yes, venerable sir,\" those monks replied to the Venerable Sāriputta. The Venerable Sāriputta said this: \"It is possible, friends, for a monk to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, and investigated by the mind, he would not perceive that; yet he would still be conscious.\"\n\"But how, friends, would it be possible for a monk to attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, and investigated by the mind, he would not perceive that; yet he would still be conscious?\"\n\"Here, friends, a monk has this perception: 'This is peaceful, this is excellent, namely the stilling of all formations, the relinquishing of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.' It is in this way, friends, that a monk would attain such a state of concentration that he would not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind, nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor this world as this world, nor the other world as the other world, and even regarding what is seen, heard, sensed, cognized, attained, sought, and investigated by the mind, he would not perceive that; yet he would still be conscious.\"",
      "sinhala": "එවිට ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්‍ෂූන් ඇමතූහ: \"ආයුෂ්මතුනි, යම් භික්‍ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකිද? යම් හෙයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් නොසිටින්නේද, ආපයෙහි ආපෝ සංඥාවෙන් නොසිටින්නේද, තේජසෙහි තේජෝ සංඥාවෙන් නොසිටින්නේද, වායුවෙහි වායෝ සංඥාවෙන් නොසිටින්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් නොසිටින්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් නොසිටින්නේද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් නොසිටින්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් නොසිටින්නේද, යම් දෙයක් දක්නට ලැබුණේද, ඇසුණේද, දැනුණේද, අවබෝධ කරගත්තේද, අත්පත් කරගත්තේද, සොයාගත්තේද, සිතින් විමසන ලද්දේද, එබඳු කිසිවකදු සංඥාවෙන් නොසිටින්නේද; එහෙත් (නිවන පිළිබඳ) සංඥාවෙන් යුක්තව සිටින්නේද?\"\n\n\"ආයුෂ්මතුනි, මේ කියමනෙහි අර්ථය දැනගැනීම සඳහා අපි දුර සිට වුවද ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ වෙතට එන්නෙමු. ඉතා යෙහෙකි! මේ කියමනෙහි අර්ථය ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේටම වැටහේවා. ආයුෂ්මත් ශාරිපුත්‍රයන් වහන්සේගෙන් අසා භික්‍ෂූහු එය ධාරණය කරගන්නාහුය.\"\n\n\"එසේ නම් ආයුෂ්මතුනි, අසන්න, මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි\"යි. \"එසේය ආයුෂ්මතුනි\"යි ඒ භික්‍ෂූහු ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: \"ආයුෂ්මතුනි, යම් භික්‍ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකියි. යම් හෙයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් නොසිටින්නේද, ආපයෙහි ආපෝ සංඥාවෙන් නොසිටින්නේද, තේජසෙහි තේජෝ සංඥාවෙන් නොසිටින්නේද, වායුවෙහි වායෝ සංඥාවෙන් නොසිටින්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් නොසිටින්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් නොසිටින්නේද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් නොසිටින්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් නොසිටින්නේද, යම් දෙයක් දක්නට ලැබුණේද, ඇසුණේද, දැනුණේද, අවබෝධ කරගත්තේද, අත්පත් කරගත්තේද, සොයාගත්තේද, සිතින් විමසන ලද්දේද, එබඳු කිසිවකදු සංඥාවෙන් නොසිටින්නේද; එහෙත් (නිවන පිළිබඳ) සංඥාවෙන් යුක්තව සිටින්නේද?\"\n\n\"එසේ නම් ආයුෂ්මතුනි, කෙසේ නම් භික්‍ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකිද? යම් හෙයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් නොසිටින්නේද, ආපයෙහි ආපෝ සංඥාවෙන් නොසිටින්නේද, තේජසෙහි තේජෝ සංඥාවෙන් නොසිටින්නේද, වායුවෙහි වායෝ සංඥාවෙන් නොසිටින්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් නොසිටින්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් නොසිටින්නේද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් නොසිටින්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් නොසිටින්නේද, යම් දෙයක් දක්නට ලැබුණේද, ඇසුණේද, දැනුණේද, අවබෝධ කරගත්තේද, අත්පත් කරගත්තේද, සොයාගත්තේද, සිතින් විමසන ලද්දේද, එබඳු කිසිවකදු සංඥාවෙන් නොසිටින්නේද; එහෙත් (නිවන පිළිබඳ) සංඥාවෙන් යුක්තව සිටින්නේද?\"\n\n\"ආයුෂ්මතුනි, මෙහිලා භික්‍ෂුව මෙසේ සංඥා කරයි – 'මේ ශාන්තයි, මේ ප්‍රණීතයි. එනම්, සියලු සංස්කාරයන්ගේ සංසිඳීමයි, සියලු උපධීන් අත්හැරීමයි, තණ්හාව ක්ෂය කිරීමයි, විරාගයයි, නිරෝධයයි, නිර්වාණයයි.' ආයුෂ්මතුනි, මෙලෙසින් භික්‍ෂුවකට මෙබඳු සමාධියක් ලැබිය හැකියි. යම් හෙයකින් පෘථිවියෙහි පෘථිවි සංඥාවෙන් නොසිටින්නේද, ආපයෙහි ආපෝ සංඥාවෙන් නොසිටින්නේද, තේජසෙහි තේජෝ සංඥාවෙන් නොසිටින්නේද, වායුවෙහි වායෝ සංඥාවෙන් නොසිටින්නේද, ආකාසානංචායතනයෙහි ආකාසානංචායතන සංඥාවෙන් නොසිටින්නේද, විඤ්ඤාණංචායතනයෙහි විඤ්ඤාණංචායතන සංඥාවෙන් නොසිටින්නේද, ආකිංචඤ්ඤායතනයෙහි ආකිංචඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවෙන් නොසිටින්නේද, මේ ලෝකයෙහි මේ ලෝක සංඥාවෙන් නොසිටින්නේද, පරලෝකයෙහි පරලෝක සංඥාවෙන් නොසිටින්නේද, යම් දෙයක් දක්නට ලැබුණේද, ඇසුණේද, දැනුණේද, අවබෝධ කරගත්තේද, අත්පත් කරගත්තේද, සොයාගත්තේද, සිතින් විමසන ලද්දේද, එබඳු කිසිවකදු සංඥාවෙන් නොසිටින්නේද; එහෙත් (නිවන පිළිබඳ) සංඥාවෙන් යුක්තව සිටින්නේද?\"",
      "paliTitle": "Catutthasamādhisuttaṃ."
    }
  ],
  "footer": {
    "pali": "Anussativaggo dutiyo. Tassuddānaṃ – Dve vuttā mahānāmena, nandiyena subhūtinā; Mettā aṭṭhako gopālo, cattāro ca samādhināti.",
    "english": "",
    "sinhala": ""
  }
}