{
  "id": "an11.4",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Discourse on Lust, and so forth.",
    "sinhala": "රාග පෙළ"
  },
  "sections": [
    {
      "number": 502,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya ekādasa dhammā bhāvetabbā. Katame ekādasa? Paṭhamaṃ jhānaṃ, dutiyaṃ jhānaṃ, tatiyaṃ jhānaṃ, catutthaṃ jhānaṃ, mettācetovimutti, karuṇācetovimutti, muditācetovimutti, upekkhācetovimutti, ākāsānañcāyatanaṃ, viññāṇañcāyatanaṃ, ākiñcaññāyatanaṃ – rāgassa, bhikkhave, abhiññāya ime ekādasa dhammā bhāvetabbā.",
      "english": "Monks, for the direct knowledge of lust, eleven qualities are to be cultivated. Which eleven? The first jhāna, the second jhāna, the third jhāna, the fourth jhāna; the liberation of mind through loving-kindness, the liberation of mind through compassion, the liberation of mind through appreciative joy, the liberation of mind through equanimity; the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothingness. Monks, for the direct knowledge of lust, these eleven qualities are to be cultivated.",
      "sinhala": "මහණෙනි, රාගය මුළුමනින් අවබෝධ කරගැනීම පිණිස එකොළොස් ධර්මයක් වැඩිය යුතු ය. ඒ එකොළොස කවරේද? ප්‍රථම ධ්‍යානය, ද්විතීය ධ්‍යානය, තෘතීය ධ්‍යානය, චතුර්ථ ධ්‍යානය, මෛත්‍රී චේතෝවිමුක්තිය, කරුණා චේතෝවිමුක්තිය, මුදිතා චේතෝවිමුක්තිය, උපේක්ඛා චේතෝවිමුක්තිය, ආකාසානඤ්චායතනය, විඤ්ඤාණඤ්චායතනය, ආකිංචඤ්ඤායතනය යි. මහණෙනි, රාගය මුළුමනින් අවබෝධ කරගැනීම පිණිස මේ එකොළොස් ධර්මයෝ වැඩිය යුතු ය.",
      "paliTitle": ""
    },
    {
      "number": 503,
      "numberRange": "503-511",
      "pali": "‘‘Rāgassa, bhikkhave, pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya… ime ekādasa dhammā bhāvetabbā.",
      "english": "Monks, for the complete comprehension of lust, for its utter eradication, for its abandonment, for its wearing away, for its fading away, for its dispassion, for its cessation, for its relinquishment, and for its total renunciation—these eleven principles should be developed.",
      "sinhala": "රාගයෙහි, මහණෙනි, පිරිසිඳ දැකීම පිණිස, මුළුමනින්ම ක්ෂය කිරීම පිණිස, ප්‍ර‍හාණය කිරීම පිණිස, ක්ෂය කිරීම පිණිස, නැතිවීම පිණිස, නොඇලීම පිණිස, නිරෝධය පිණිස, පරිත්‍යාගය පිණිස, සම්පූර්ණයෙන් අත්හැරීම පිණිස, මේ එකොළොස් ධර්මයන් වැඩිය යුත්තාහ.",
      "paliTitle": ""
    },
    {
      "number": 512,
      "numberRange": "512-671",
      "pali": "‘‘Dosassa …pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa abhiññāya…pe… pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya ime ekādasa dhammā bhāvetabbā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. ",
      "english": "For the sake of direct knowledge, for the sake of complete understanding, for the sake of utter destruction, for the sake of abandoning, for the sake of the wearing away, for the sake of the passing away, for the sake of dispassion, for the sake of cessation, for the sake of relinquishment, and for the sake of letting go of aversion, of delusion, of anger, of hostility, of denigration, of rivalry, of envy, of stinginess, of deceit, of fraud, of obstinacy, of contention, of conceit, of excessive arrogance, of intoxication, and of heedlessness – these eleven qualities are to be developed.\n\nThis the Blessed One said. Delighted, those monks rejoiced in the Blessed One's words.",
      "sinhala": "ද්වේෂය, මෝහය, ක්‍රෝධය, උපනාහය, මක්ඛය, පළාසය, ඊර්ෂ්‍යාව, මාත්සර්‍යය, මායාව, සාඨෙය්‍යය, ථම්භය, සාරම්භය, මානය, අතිමානය, මදය, ප්‍රමාදය යන මේ ධර්මයන් ප්‍රත්‍යක්ෂයෙන් දැනගැනීම පිණිස, සම්පූර්ණ අවබෝධය පිණිස, මුළුමනින්ම ක්ෂය කිරීම පිණිස, ප්‍රහාණය කිරීම පිණිස, (තවදුරටත්) ක්ෂය කිරීම පිණිස, වියෝව පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, ත්‍යාගය පිණිස, ප්‍රතිනිස්සර්ගය පිණිස මේ එකොළොස් ධර්මයන් භාවනා කළ යුත්තේය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. එම භික්ෂූහු සතුටු සිත් ඇතිව භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කළහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ. Nava suttasahassāni, bhiyyo pañcasatāni ca [pañca suttasatāni ca (aṭṭha.)]; Sattapaññāsa suttantā [suttāni (aṭṭha.)], aṅguttarasamāyutā [honti aṅguttarāgame (aṭṭha.)] ti.",
    "english": "The Section on Craving Concluded",
    "sinhala": "රාගපෙය්‍යාලය නිමයි."
  }
}