{
  "id": "an11.3",
  "title": {
    "pali": "Sāmaññavaggo",
    "english": "The Section on the Recluse",
    "sinhala": "සාමණ්‍ය වග්ගය"
  },
  "sections": [
    {
      "number": 22,
      "numberRange": "22-29",
      "pali": "‘‘Ekādasahi, bhikkhave, aṅgehi samannāgato gopālako abhabbo gogaṇaṃ pariharituṃ phātiṃ kātuṃ. Katamehi ekādasahi? Idha, bhikkhave, gopālako na rūpaññū hoti, na lakkhaṇakusalo hoti, na āsāṭikaṃ hāretā hoti, na vaṇaṃ paṭicchādetā hoti, na dhūmaṃ kattā hoti, na titthaṃ jānāti, na pītaṃ jānāti, na vīthiṃ jānāti, na gocarakusalo hoti, anavasesadohī ca hoti, ye te usabhā gopitaro gopariṇāyakā te na atirekapūjāya pūjetā hoti – imehi kho, bhikkhave, ekādasahi aṅgehi samannāgato gopālako abhabbo gogaṇaṃ pariharituṃ phātiṃ kātuṃ. ‘‘Evamevaṃ kho, bhikkhave, ekādasahi dhammehi samannāgato bhikkhu abhabbo cakkhusmiṃ aniccānupassī viharituṃ…pe… abhabbo cakkhusmiṃ dukkhānupassī viharituṃ… abhabbo cakkhusmiṃ anattānupassī viharituṃ… abhabbo cakkhusmiṃ khayānupassī viharituṃ… abhabbo cakkhusmiṃ vayānupassī viharituṃ… abhabbo cakkhusmiṃ virāgānupassī viharituṃ… abhabbo cakkhusmiṃ nirodhānupassī viharituṃ… abhabbo cakkhusmiṃ paṭinissaggānupassī viharituṃ’’.",
      "english": "Monks, a herdsman endowed with eleven factors is unable to tend the herd and make it prosper. What are these eleven? Here, monks, the herdsman is not skilled in discerning the form of cattle, is not skilled in their characteristics, does not remove biting insects, does not cover wounds, does not make smoke, does not know the watering place, does not know the ford, does not know the path, is not skilled in pasturage, milks completely dry leaving nothing, and does not pay special honor to the lead bulls who are the fathers and leaders of the herd. Monks, a herdsman endowed with these eleven factors is unable to tend the herd and make it prosper.\n\nMonks, in the same way, a monk endowed with eleven qualities is unable to dwell contemplating impermanence in the eye, unable to dwell contemplating unsatisfactoriness in the eye, unable to dwell contemplating non-self in the eye, unable to dwell contemplating dissolution in the eye, unable to dwell contemplating vanishing in the eye, unable to dwell contemplating dispassion in the eye, unable to dwell contemplating cessation in the eye, and unable to dwell contemplating relinquishment in the eye.",
      "sinhala": "එකොළොස් අංගයකින් යුක්ත වූ ගොපල්ලා ගව පිරිස රැකබලා ගැනීමටත් දියුණු කිරීමටත්, මහණෙනි, අපොහොසත් වෙයි. ඒ එකොළොස් අංග කවරේද? මහණෙනි, මෙහිලා ගොපල්ලා ගවයන්ගේ ස්වභාවය නොහඳුනයි, ඔවුන්ගේ ලක්ෂණ පිළිබඳ දක්ෂ නැත, ගවයන්ගෙන් වන හිරිහැර ඉවසන්නේ නැත, තුවාල වසන්නේ නැත, දුම් දමන්නේ නැත, තොටුපළ නොදනී, (පානයට) සුදුසු ජලය නොදනී, මාර්ගය නොදනී, තණබිම් පිළිබඳ දක්ෂයෙක් නොවේ, ඉතිරි නොකර කිරි දොවයි, රංචුවේ ප්‍රධානියා වන ගව පියවරුන්ට, නායක ගවයන්ට අතිරේක ගෞරවයෙන් සලකන්නේ නැත. මහණෙනි, මෙන්න මේ එකොළොස් අංගයන්ගෙන් යුක්ත වූ ගොපල්ලා ගව පිරිස රැකබලා ගැනීමටත් දියුණු කිරීමටත් අපොහොසත් වෙයි.\n\nඒ අයුරින්ම, මහණෙනි, එකොළොස් ධර‍්මයකින් යුක්ත වූ භික්ෂුවක් ඇස කෙරෙහි අනිත්‍ය වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි; ඇස කෙරෙහි දුක් වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි; ඇස කෙරෙහි අනාත්ම වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි; ඇස කෙරෙහි ක්ෂය වීම වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි; ඇස කෙරෙහි වියැකී යාම වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි; ඇස කෙරෙහි විරාගය වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි; ඇස කෙරෙහි නිරෝධය වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි; ඇස කෙරෙහි අත්හැරීම වශයෙන් අනුපස්සනා කරමින් වාසය කිරීමට අපොහොසත් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 30,
      "numberRange": "30-69",
      "pali": "…Sotasmiṃ… ghānasmiṃ… jivhāya… kāyasmiṃ… manasmiṃ….",
      "english": "…in the ear…in the nose…in the tongue…in the body…in the mind.",
      "sinhala": "...කනෙහි... නාසයෙහි... දිවෙහි... කයෙහි... මනසෙහි....",
      "paliTitle": ""
    },
    {
      "number": 70,
      "numberRange": "70-117",
      "pali": "…Rūpesu… saddesu… gandhesu… rasesu… phoṭṭhabbesu… dhammesu….",
      "english": "...in visible forms, in sounds, in odors, in tastes, in tactile objects, in mental objects....",
      "sinhala": "රූපයන්හි... ශබ්දයන්හි... ගන්ධයන්හි... රසයන්හි... ඵොට්ඨබ්බයන්හි... ධර‍්මයන්හි.",
      "paliTitle": ""
    },
    {
      "number": 118,
      "numberRange": "118-165",
      "pali": "…Cakkhuviññāṇe… sotaviññāṇe… ghānaviññāṇe… jivhāviññāṇe… kāyaviññāṇe… manoviññāṇe….",
      "english": "It occurs in eye-consciousness, in ear-consciousness, in nose-consciousness, in tongue-consciousness, in body-consciousness, and in mind-consciousness.",
      "sinhala": "…චක්ඛු විඤ්ඤාණය... ශ්‍රවණ විඤ්ඤාණය... ඝ්‍රාණ විඤ්ඤාණය... ජිහ්වා විඤ්ඤාණය... කාය විඤ්ඤාණය... මනෝ විඤ්ඤාණය....",
      "paliTitle": ""
    },
    {
      "number": 166,
      "numberRange": "166-213",
      "pali": "…Cakkhusamphasse… sotasamphasse… ghānasamphasse… jivhāsamphasse … kāyasamphasse… manosamphasse….",
      "english": "Contact through the eye, contact through the ear, contact through the nose, contact through the tongue, contact through the body, contact through the mind.",
      "sinhala": "...චක්ඛු සම්ඵස්සයෙන්... සෝත සම්ඵස්සයෙන්... ඝාන සම්ඵස්සයෙන්... ජිව්හා සම්ඵස්සයෙන්... කාය සම්ඵස්සයෙන්... මනෝ සම්ඵස්සයෙන්...",
      "paliTitle": ""
    },
    {
      "number": 214,
      "numberRange": "214-261",
      "pali": "…Cakkhusamphassajāya vedanāya… sotasamphassajāya vedanāya… ghānasamphassajāya vedanāya… jivhāsamphassajāya vedanāya… kāyasamphassajāya vedanāya… manosamphassajāya vedanāya….",
      "english": "…the feeling arising from eye-contact… the feeling arising from ear-contact… the feeling arising from nose-contact… the feeling arising from tongue-contact… the feeling arising from body-contact… the feeling arising from mind-contact….",
      "sinhala": "ඇසෙහි ස්පර්ශය නිසා හටගන්නා වූ වේදනාව පිළිබඳව යි.\nකනෙහි ස්පර්ශය නිසා හටගන්නා වූ වේදනාව පිළිබඳව යි.\nනාසයෙහි ස්පර්ශය නිසා හටගන්නා වූ වේදනාව පිළිබඳව යි.\nදිවෙහි ස්පර්ශය නිසා හටගන්නා වූ වේදනාව පිළිබඳව යි.\nකයෙහි ස්පර්ශය නිසා හටගන්නා වූ වේදනාව පිළිබඳව යි.\nමනසෙහි ස්පර්ශය නිසා හටගන්නා වූ වේදනාව පිළිබඳව යි.",
      "paliTitle": ""
    },
    {
      "number": 262,
      "numberRange": "262-309",
      "pali": "…Rūpasaññāya… saddasaññāya… gandhasaññāya… rasasaññāya… phoṭṭhabbasaññāya … dhammasaññāya….",
      "english": "The perception of forms, the perception of sounds, the perception of odors, the perception of tastes, the perception of tangibles, the perception of mental phenomena.",
      "sinhala": "…රූප සංඥාව… ශබ්ද සංඥාව… ගන්ධ සංඥාව… රස සංඥාව… ස්පර්ශ සංඥාව… ධර්‍ම සංඥාව….",
      "paliTitle": ""
    },
    {
      "number": 310,
      "numberRange": "310-357",
      "pali": "…Rūpasañcetanāya… saddasañcetanāya… gandhasañcetanāya… rasasañcetanāya… phoṭṭhabbasañcetanāya… dhammasañcetanāya….",
      "english": "Volition concerning forms, volition concerning sounds, volition concerning odors, volition concerning tastes, volition concerning tangibles, volition concerning mental phenomena.",
      "sinhala": "... රූපය පිළිබඳ වූ සංචේතනාවෙන්... ශබ්දය පිළිබඳ වූ සංචේතනාවෙන්... ගන්ධය පිළිබඳ වූ සංචේතනාවෙන්... රසය පිළිබඳ වූ සංචේතනාවෙන්... ස්පර්ශය පිළිබඳ වූ සංචේතනාවෙන්... ධර්මය පිළිබඳ වූ සංචේතනාවෙන්....",
      "paliTitle": ""
    },
    {
      "number": 358,
      "numberRange": "358-405",
      "pali": "…Rūpataṇhāya… saddataṇhāya… gandhataṇhāya… rasataṇhāya… phoṭṭhabbataṇhāya… dhammataṇhāya….",
      "english": "…craving for forms… craving for sounds… craving for odors… craving for tastes… craving for tactile objects… craving for mind-objects.",
      "sinhala": "…රූපතණ්හාවෙන්… ශබ්දතණ්හාවෙන්… ගන්ධතණ්හාවෙන්… රසතණ්හාවෙන්… ඵොට්ඨබ්බතණ්හාවෙන්… ධම්මතණ්හාවෙන්….",
      "paliTitle": ""
    },
    {
      "number": 406,
      "numberRange": "406-453",
      "pali": "…Rūpavitakke… saddavitakke… gandhavitakke… rasavitakke… phoṭṭhabbavitakke… dhammavitakke….",
      "english": "Discursive thoughts concerning form, discursive thoughts concerning sound, discursive thoughts concerning odor, discursive thoughts concerning taste, discursive thoughts concerning tangibles, and discursive thoughts concerning mental phenomena.",
      "sinhala": "...රූපය හා සම්බන්ධ විතර්ක... ශබ්දය හා සම්බන්ධ විතර්ක... ගන්ධය හා සම්බන්ධ විතර්ක... රසය හා සම්බන්ධ විතර්ක... ස්පර්ශය හා සම්බන්ධ විතර්ක... ධර්‍මයන් හා සම්බන්ධ විතර්ක....",
      "paliTitle": ""
    },
    {
      "number": 454,
      "numberRange": "454-501",
      "pali": "…Rūpavicāre… saddavicāre… gandhavicāre… rasavicāre… phoṭṭhabbavicāre… dhammavicāre aniccānupassī viharituṃ… dukkhānupassī viharituṃ… anattānupassī viharituṃ… khayānupassī viharituṃ… vayānupassī viharituṃ… virāgānupassī viharituṃ… nirodhānupassī viharituṃ… paṭinissaggānupassī viharituṃ…pe….",
      "english": "In the investigation of forms, one should dwell contemplating impermanence; one should dwell contemplating suffering; one should dwell contemplating non-self; one should dwell contemplating decay; one should dwell contemplating vanishing; one should dwell contemplating dispassion; one should dwell contemplating cessation; one should dwell contemplating relinquishment.\n\nIn the investigation of sounds, one should dwell contemplating impermanence; one should dwell contemplating suffering; one should dwell contemplating non-self; one should dwell contemplating decay; one should dwell contemplating vanishing; one should dwell contemplating dispassion; one should dwell contemplating cessation; one should dwell contemplating relinquishment.\n\nIn the investigation of smells, one should dwell contemplating impermanence; one should dwell contemplating suffering; one should dwell contemplating non-self; one should dwell contemplating decay; one should dwell contemplating vanishing; one should dwell contemplating dispassion; one should dwell contemplating cessation; one should dwell contemplating relinquishment.\n\nIn the investigation of tastes, one should dwell contemplating impermanence; one should dwell contemplating suffering; one should dwell contemplating non-self; one should dwell contemplating decay; one should dwell contemplating vanishing; one should dwell contemplating dispassion; one should dwell contemplating cessation; one should dwell contemplating relinquishment.\n\nIn the investigation of tactile objects, one should dwell contemplating impermanence; one should dwell contemplating suffering; one should dwell contemplating non-self; one should dwell contemplating decay; one should dwell contemplating vanishing; one should dwell contemplating dispassion; one should dwell contemplating cessation; one should dwell contemplating relinquishment.\n\nIn the investigation of mental phenomena, one should dwell contemplating impermanence; one should dwell contemplating suffering; one should dwell contemplating non-self; one should dwell contemplating decay; one should dwell contemplating vanishing; one should dwell contemplating dispassion; one should dwell contemplating cessation; one should dwell contemplating relinquishment.",
      "sinhala": "රූපය විමර්ශනය කරමින් අනිත්‍ය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රූපය විමර්ශනය කරමින් දුක්ඛ වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රූපය විමර්ශනය කරමින් අනාත්ම වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රූපය විමර්ශනය කරමින් ක්‍ෂය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රූපය විමර්ශනය කරමින් වය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රූපය විමර්ශනය කරමින් විරාගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රූපය විමර්ශනය කරමින් නිරෝධය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රූපය විමර්ශනය කරමින් ප්‍රතිනිස්සර්ගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් අනිත්‍ය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් දුක්ඛ වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් අනාත්ම වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් ක්‍ෂය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් වය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් විරාගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් නිරෝධය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ශබ්දය විමර්ශනය කරමින් ප්‍රතිනිස්සර්ගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් අනිත්‍ය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් දුක්ඛ වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් අනාත්ම වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් ක්‍ෂය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් වය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් විරාගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් නිරෝධය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ගන්ධය විමර්ශනය කරමින් ප්‍රතිනිස්සර්ගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් අනිත්‍ය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් දුක්ඛ වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් අනාත්ම වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් ක්‍ෂය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් වය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් විරාගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් නිරෝධය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; රසය විමර්ශනය කරමින් ප්‍රතිනිස්සර්ගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් අනිත්‍ය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් දුක්ඛ වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් අනාත්ම වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් ක්‍ෂය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් වය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් විරාගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් නිරෝධය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ස්පර්ශය විමර්ශනය කරමින් ප්‍රතිනිස්සර්ගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් අනිත්‍ය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් දුක්ඛ වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් අනාත්ම වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් ක්‍ෂය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් වය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් විරාගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් නිරෝධය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට; ධර්මය විමර්ශනය කරමින් ප්‍රතිනිස්සර්ගය වශයෙන් නිතර නිතර මෙනෙහි කරමින් විහරණය කිරීමට.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}