{
  "id": "an4.26",
  "title": {
    "pali": "Abhiññāvaggo",
    "english": "The Chapter on Higher Knowledges",
    "sinhala": "අභිඥා වග්ගය"
  },
  "sections": [
    {
      "number": 254,
      "pali": "‘‘Cattārome, bhikkhave, dhammā. Katame cattāro? Atthi, bhikkhave, dhammā abhiññā pariññeyyā; atthi, bhikkhave, dhammā abhiññā pahātabbā; atthi, bhikkhave, dhammā abhiññā bhāvetabbā; atthi, bhikkhave, dhammā abhiññā sacchikātabbā. ‘‘Katame ca, bhikkhave, dhammā abhiññā pariññeyyā? Pañcupādānakkhandhā [pañcupādānakkhandhātissa vacanīyaṃ (ka.)] – ime vuccanti, bhikkhave, dhammā abhiññā pariññeyyā. ‘‘Katame ca, bhikkhave, dhammā abhiññā pahātabbā? Avijjā ca bhavataṇhā ca – ime vuccanti, bhikkhave, dhammā abhiññā pahātabbā. ‘‘Katame ca, bhikkhave, dhammā abhiññā bhāvetabbā? Samatho ca vipassanā ca – ime vuccanti, bhikkhave, dhammā abhiññā bhāvetabbā. ‘‘Katame ca, bhikkhave, dhammā abhiññā sacchikātabbā? Vijjā ca vimutti ca – ime vuccanti, bhikkhave, dhammā abhiññā sacchikātabbā. Ime kho, bhikkhave, cattāro dhammā’’ti. Paṭhamaṃ.",
      "english": "“Monks, there are these four phenomena. Which four?\n\nMonks, there are phenomena that are to be fully understood through direct knowledge; there are phenomena that are to be abandoned through direct knowledge; there are phenomena that are to be developed through direct knowledge; there are phenomena that are to be realized through direct knowledge.\n\nAnd what, monks, are the phenomena to be fully understood through direct knowledge? The five aggregates of clinging – these, monks, are called the phenomena to be fully understood through direct knowledge.\n\nAnd what, monks, are the phenomena to be abandoned through direct knowledge? Ignorance and craving for existence – these, monks, are called the phenomena to be abandoned through direct knowledge.\n\nAnd what, monks, are the phenomena to be developed through direct knowledge? Tranquillity and insight – these, monks, are called the phenomena to be developed through direct knowledge.\n\nAnd what, monks, are the phenomena to be realized through direct knowledge? True knowledge and liberation – these, monks, are called the phenomena to be realized through direct knowledge.\n\nThese, monks, are those four phenomena.”",
      "sinhala": "භික්ෂූණි, මේ ධර්ම සතරක් වෙති. ඒ සතර කවරේද? භික්ෂූණි, ඇතැම් ධර්ම ඇත, ඒවා පූර්ණ අවබෝධයෙන් පිරිසිඳ දැනගත යුතුයි. භික්ෂූණි, ඇතැම් ධර්ම ඇත, ඒවා ප\\u0DCA\\u200Dරහාණය කළ යුතුයි. භික්ෂූණි, ඇතැම් ධර්ම ඇත, ඒවා පූර්ණ අවබෝධයෙන් වර්ධනය කළ යුතුයි. භික්ෂූණි, ඇතැම් ධර්ම ඇත, ඒවා පූර්ණ අවබෝධයෙන් සාක්ෂාත් කළ යුතුයි.\n\nභික්ෂූණි, පූර්ණ අවබෝධයෙන් පිරිසිඳ දැනගත යුතු ධර්ම කවරේද? උපාදානස්කන්ධ පස – භික්ෂූණි, මේවා පූර්ණ අවබෝධයෙන් පිරිසිඳ දැනගත යුතු ධර්ම යැයි කියනු ලැබේ.\n\nභික්ෂූණි, පූර්ණ අවබෝධයෙන් ප\\u0DCA\\u200Dරහාණය කළ යුතු ධර්ම කවරේද? අවිද්‍යාව සහ භවතණ්හාව – භික්ෂූණි, මේවා පූර්ණ අවබෝධයෙන් ප\\u0DCA\\u200Dරහාණය කළ යුතු ධර්ම යැයි කියනු ලැබේ.\n\nභික්ෂූණි, පූර්ණ අවබෝධයෙන් වර්ධනය කළ යුතු ධර්ම කවරේද? සමථය සහ විපස්සනාව – භික්ෂූණි, මේවා පූර්ණ අවබෝධයෙන් වර්ධනය කළ යුතු ධර්ම යැයි කියනු ලැබේ.\n\nභික්ෂූණි, පූර්ණ අවබෝධයෙන් සාක්ෂාත් කළ යුතු ධර්ම කවරේද? විද්‍යාව සහ විමුක්තිය – භික්ෂූණි, මේවා පූර්ණ අවබෝධයෙන් සාක්ෂාත් කළ යුතු ධර්ම යැයි කියනු ලැබේ.\n\nභික්ෂූණි, මේ ධර්ම සතර නම් මේවාමයි.",
      "paliTitle": "Abhiññāsuttaṃ"
    },
    {
      "number": 255,
      "pali": "‘‘Catasso imā, bhikkhave, anariyapariyesanā. Katamā catasso? Idha, bhikkhave, ekacco attanā jarādhammo samāno jarādhammaṃyeva pariyesati; attanā byādhidhammo samāno byādhidhammaṃyeva pariyesati; attanā maraṇadhammo samāno maraṇadhammaṃyeva pariyesati; attanā saṃkilesadhammo samāno saṃkilesadhammaṃyeva pariyesati. Imā kho, bhikkhave, catasso anariyapariyesanā. ‘‘Catasso imā, bhikkhave, ariyapariyesanā. Katamā catasso? Idha, bhikkhave, ekacco attanā jarādhammo samāno jarādhamme ādīnavaṃ viditvā ajaraṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā byādhidhammo samāno byādhidhamme ādīnavaṃ viditvā abyādhiṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā maraṇadhammo samāno maraṇadhamme ādīnavaṃ viditvā amataṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā saṃkilesadhammo samāno saṃkilesadhamme ādīnavaṃ viditvā asaṃkiliṭṭhaṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati. Imā kho, bhikkhave, catasso ariyapariyesanā’’ti. Dutiyaṃ.",
      "english": "Monks, these are four ignoble quests. Which four? Here, monks, someone, himself being subject to aging, seeks what is subject to aging; himself being subject to illness, seeks what is subject to illness; himself being subject to death, seeks what is subject to death; himself being subject to defilement, seeks what is subject to defilement. These, monks, are the four ignoble quests.\n\nMonks, these are four noble quests. Which four? Here, monks, someone, himself being subject to aging, having understood the danger in what is subject to aging, seeks the unaging, the unsurpassed supreme security from bondage, Nibbāna; himself being subject to illness, having understood the danger in what is subject to illness, seeks the unailing, the unsurpassed supreme security from bondage, Nibbāna; himself being subject to death, having understood the danger in what is subject to death, seeks the deathless, the unsurpassed supreme security from bondage, Nibbāna; himself being subject to defilement, having understood the danger in what is subject to defilement, seeks the undefiled, the unsurpassed supreme security from bondage, Nibbāna. These, monks, are the four noble quests.",
      "sinhala": "මහණෙනි, සිව් වැදෑරුම් වූ මේ අනාරිය පර්යේෂණයෝ වෙති. ඒ සිව් වැදෑරුම් පර්යේෂණයෝ කවරහු ද? මහණෙනි, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් තෙමේ ජරාවට පත් වන ස්වභාවය ඇත්තෙක් වෙමින්, ජරාවට පත් වන දේම සොයයි; තෙමේ ව්‍යක්ති ඌනතාවයට, ව්‍යාධියට පත් වන ස්වභාවය ඇත්තෙක් වෙමින්, ව්‍යාධියට පත් වන දේම සොයයි; තෙමේ මරණයට පත් වන ස්වභාවය ඇත්තෙක් වෙමින්, මරණයට පත් වන දේම සොයයි; තෙමේ කෙලෙස්වලින් කිලිටි වන ස්වභාවය ඇත්තෙක් වෙමින්, කෙලෙස්වලින් කිලිටි වන දේම සොයයි. මහණෙනි, මේවා සතර අනාරිය පර්යේෂණයෝ වෙති.\n\nමහණෙනි, සිව් වැදෑරුම් වූ මේ ආරිය පර්යේෂණයෝ වෙති. ඒ සිව් වැදෑරුම් පර්යේෂණයෝ කවරහු ද? මහණෙනි, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් තෙමේ ජරාවට පත් වන ස්වභාවය ඇත්තෙක් වෙමින්, ජරාවට පත් වන දේවල්හි ආදීනවය දැක, අජර වූ, අනුත්තර වූ, යෝගක්ෂේම වූ නිවන සොයයි; තෙමේ ව්‍යාධියට පත් වන ස්වභාවය ඇත්තෙක් වෙමින්, ව්‍යාධියට පත් වන දේවල්හි ආදීනවය දැක, අව්‍යාධි වූ, අනුත්තර වූ, යෝගක්ෂේම වූ නිවන සොයයි; තෙමේ මරණයට පත් වන ස්වභාවය ඇත්තෙක් වෙමින්, මරණයට පත් වන දේවල්හි ආදීනවය දැක, අමත වූ, අනුත්තර වූ, යෝගක්ෂේම වූ නිවන සොයයි; තෙමේ කෙලෙස්වලින් කිලිටි වන ස්වභාවය ඇත්තෙක් වෙමින්, කෙලෙස්වලින් කිලිටි වන දේවල්හි ආදීනවය දැක, අසංකිලිට්ඨ වූ, අනුත්තර වූ, යෝගක්ෂේම වූ නිවන සොයයි. මහණෙනි, මේවා සතර ආරිය පර්යේෂණයෝ වෙති.",
      "paliTitle": "Pariyesanāsuttaṃ"
    },
    {
      "number": 256,
      "pali": "‘‘Cattārimāni, bhikkhave, saṅgahavatthūni. Katamāni cattāri? Dānaṃ, peyyavajjaṃ [piyavācā (ka.) a. ni. 4.32 passitabbaṃ], atthacariyā, samānattatā – imāni kho, bhikkhave, cattāri saṅgahavatthūnī’’ti.",
      "english": "Monks, there are these four principles of integration. Which four? Generosity, pleasant speech, beneficial conduct, and equality of treatment – these, monks, are the four principles of integration.",
      "sinhala": "භික්ෂූනි, මේවා සංග්‍රහ වස්තූන් සතරකි. ඒ කවර සතරක්ද? දානය, ප්‍රියවචනය, අර්ථචර්යාව, සමානාත්මතාවයි. භික්ෂූනි, මේවා සංග්‍රහ වස්තූන් සතර යි.",
      "paliTitle": "Saṅgahavatthusuttaṃ"
    },
    {
      "number": 257,
      "pali": "Atha kho āyasmā mālukyaputto [māluṅkyaputto (sī. syā. kaṃ. pī.)] yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mālukyaputto bhagavantaṃ etadavoca – ‘‘Sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Ettha idāni, mālukyaputta, kiṃ dahare bhikkhū vakkhāma; yatra hi nāma tvaṃ jiṇṇo vuddho mahallako tathāgatassa saṃkhittena ovādaṃ yācasī’’ti! ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ; desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ ājāneyyaṃ; appeva nāmāhaṃ bhagavato bhāsitassa dāyādo [bhagavato sāvako (ka.)] assa’’nti. ‘‘Cattārome, mālukyaputta, taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjati. Katame cattāro? Cīvarahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Piṇḍapātahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Senāsanahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Itibhavābhavahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Ime kho, mālukyaputta, cattāro taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjati. Yato kho, mālukyaputta, bhikkhuno taṇhā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, ayaṃ vuccati, mālukyaputta, ‘bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’’ti. Atha kho āyasmā mālukyaputto bhagavatā iminā ovādena ovadito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho āyasmā mālukyaputto eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā mālukyaputto arahataṃ ahosīti. Catutthaṃ.",
      "english": "Then Venerable Mālukyaputta approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, Venerable Mālukyaputta said to the Blessed One: “It would be good, venerable sir, if the Blessed One would teach me the Dhamma in brief, so that, having heard the Dhamma from the Blessed One, I might dwell alone, secluded, diligent, ardent, and resolute.” [The Blessed One responded:] “At this point, Mālukyaputta, what can we say to young monks? For you are old, aged, and advanced in years, yet you ask the Tathāgata for a brief instruction!” [Venerable Mālukyaputta replied:] “Let the Blessed One, venerable sir, teach me the Dhamma in brief; let the Fortunate One teach me the Dhamma in brief. Perhaps I might understand the meaning of what the Blessed One says; perhaps I might be an heir to what the Blessed One says.”\n\n“There are these four origins of craving, Mālukyaputta, where craving arises for a monk when it arises. What are these four? Craving arises for a monk when it arises, Mālukyaputta, in dependence on robes. Craving arises for a monk when it arises, Mālukyaputta, in dependence on almsfood. Craving arises for a monk when it arises, Mālukyaputta, in dependence on dwellings. Craving arises for a monk when it arises, Mālukyaputta, in dependence on the desire for existence or non-existence. These, Mālukyaputta, are the four origins of craving where craving arises for a monk when it arises. When, Mālukyaputta, a monk's craving has been abandoned, uprooted, made like a palm-stump, brought to non-existence, and is no longer subject to future arising, then that monk, Mālukyaputta, is called ‘one who has cut off craving, undone the fetters, and, through the right comprehension of conceit, has made an end of suffering.’”\n\nThen Venerable Mālukyaputta, having been exhorted by the Blessed One with this instruction, rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed. Then Venerable Mālukyaputta, dwelling alone, secluded, diligent, ardent, and resolute, before long, by his own direct knowledge, realized and entered upon the unsurpassed culmination of the holy life—that for the sake of which noble sons rightly go forth from home into homelessness—here and now. He directly knew: “Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.” And Venerable Mālukyaputta became one of the Arahants.",
      "sinhala": "ඉන්පසු ආයුෂ්මත් මාලුක්‍යපුත්ත භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි ආයුෂ්මත් මාලුක්‍යපුත්ත භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට සංක්‍ෂිප්තව ධර්මය දේශනා කරන්නේ නම් මැනවි. එවිට මම භාග්‍යවතුන් වහන්සේගේ ධර්මය අසා, තනිව, වෙන් ව, අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් යුක්තව වාසය කරන්නෙමි.\" \"මාලුක්‍යපුත්තය, දැන් අපි මෙහි සිටින තරුණ භික්‍ෂූන්ට කුමක් කියමුද? යමක් නිසා නුඹ දිරූ, මහලු, වියපත් වූවෙක්ව සිටිමින් තථාගතයන් වහන්සේගෙන් සංක්‍ෂිප්ත ඕවාදයක් ඉල්ලා සිටිනවාද!\" \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට සංක්‍ෂිප්තව ධර්මය දේශනා කරන සේක්වා! සුගතයන් වහන්සේ සංක්‍ෂිප්තව ධර්මය දේශනා කරන සේක්වා! සමහර විට මම භාග්‍යවතුන් වහන්සේගේ වචනයේ අර්ථය අවබෝධ කර ගනිමි; සමහර විට මම භාග්‍යවතුන් වහන්සේගේ ධර්මයට දායාදකරුවෙක් (ශ්‍රාවකයෙක්) වන්නෙමි.\"\n\n\"මාලුක්‍යපුත්තය, භික්‍ෂුවකට තෘෂ්ණාව උපදින විට, එය උපදින තෘෂ්ණාව ඇතිවන ස්ථාන සතරක් ඇත. ඒ සතර කුමක්ද? මාලුක්‍යපුත්තය, භික්‍ෂුවකට තෘෂ්ණාව උපදින විට, එය සිවුරු හේතුවෙන් උපදී. මාලුක්‍යපුත්තය, භික්‍ෂුවකට තෘෂ්ණාව උපදින විට, එය පිණ්ඩපාතය හේතුවෙන් උපදී. මාලුක්‍යපුත්තය, භික්‍ෂුවකට තෘෂ්ණාව උපදින විට, එය සේනාසන හේතුවෙන් උපදී. මාලුක්‍යපුත්තය, භික්‍ෂුවකට තෘෂ්ණාව උපදින විට, එය භවය (පවතින බව) හෝ විභවය (නොපවතින බව) හේතුවෙන් උපදී. මාලුක්‍යපුත්තය, භික්‍ෂුවකට තෘෂ්ණාව උපදින විට, එය උපදින තෘෂ්ණාව ඇතිවන ස්ථාන සතර මේවාය. මාලුක්‍යපුත්තය, යම් කලෙක භික්‍ෂුවකගේ තෘෂ්ණාව ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් නෂ්ටප්‍රාප්ත වී, නැවත හට නොගන්නා ස්වභාවයට පත්වී, අනාගතයේදී නූපදින ස්වභාවයට පත් වේද, මාලුක්‍යපුත්තය, එවිට ඒ භික්‍ෂුව 'තෘෂ්ණාව සිඳලීය, සංයෝජන දුරු කළේය, මානය සම්‍යග් ආකාරයෙන් අවබෝධ කොට දුකට කෙළවර කළේය' යි කියනු ලැබේ.\"\n\nඉන්පසු ආයුෂ්මත් මාලුක්‍යපුත්ත භාග්‍යවතුන් වහන්සේ විසින් මේ ඕවාදයෙන් අවවාද ලබා, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කර, ප්‍රදක්‍ෂිණා කොට පිටත්ව ගියේය. ඉන්පසු ආයුෂ්මත් මාලුක්‍යපුත්ත තනිව, වෙන් ව, අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් යුක්තව වාසය කරමින් වැඩි කලක් නොගොස්, යම් අර්ථයක් සඳහා කුලපුත්‍රයෝ මනාකොට ගිහිගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට පැමිණෙත්ද, ඒ අනුත්තර බ්‍රහ්මචාරී ජීවිතයේ අවසානය වූ අරහත්භාවය, මේ අත්මභාවය තුළදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කරගෙන වාසය කළේය. ඔහු \"ජාතිය ක්ෂය විය, බඹසර වැස නිම විය, කළ යුතු දේ කෙළේය, මේ සඳහා (සංසාරය පිණිස) තවත් කිසිවක් නැතැ\"යි අවබෝධ කළේය. තවද, ආයුෂ්මත් මාලුක්‍යපුත්ත රහතුන් වහන්සේ නමක් බවට පත් විය.",
      "paliTitle": "Mālukyaputtasuttaṃ"
    },
    {
      "number": 258,
      "pali": "‘‘Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni na ciraṭṭhitikāni bhavanti, sabbāni tāni catūhi ṭhānehi, etesaṃ vā aññatarena. Katamehi catūhi? Naṭṭhaṃ na gavesanti, jiṇṇaṃ na paṭisaṅkharonti, aparimitapānabhojanā honti, dussīlaṃ itthiṃ vā purisaṃ vā ādhipacce ṭhapenti. Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni na ciraṭṭhitikāni bhavanti, sabbāni tāni imehi catūhi ṭhānehi, etesaṃ vā aññatarena. ‘‘Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni ciraṭṭhitikāni bhavanti, sabbāni tāni catūhi ṭhānehi, etesaṃ vā aññatarena. Katamehi catūhi? Naṭṭhaṃ gavesanti, jiṇṇaṃ paṭisaṅkharonti, parimitapānabhojanā honti, sīlavantaṃ itthiṃ vā purisaṃ vā ādhipacce ṭhapenti. Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni ciraṭṭhitikāni bhavanti, sabbāni tāni imehi catūhi ṭhānehi, etesaṃ vā aññatarenā’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, whatever families that have attained great prosperity do not endure for long, all of them do so due to these four reasons, or one of them. Which four? They do not search for what is lost; they do not repair what is dilapidated; they are immoderate in food and drink; they appoint an immoral woman or man to positions of authority. Whatever families, bhikkhus, that have attained great prosperity do not endure for long, all of them do so due to these four reasons, or one of them.\n\nBhikkhus, whatever families that have attained great prosperity do endure for long, all of them do so due to these four reasons, or one of them. Which four? They search for what is lost; they repair what is dilapidated; they are moderate in food and drink; they appoint a virtuous woman or man to positions of authority. Whatever families, bhikkhus, that have attained great prosperity do endure for long, all of them do so due to these four reasons, or one of them.",
      "sinhala": "මහණෙනි, යම්කිසි කුලයක් භෝග සම්පත්වලින් මහත් බවට පැමිණ බොහෝ කල් නොපවතී ද, ඒ සියල්ල සතර කරුණකින් හෝ ඒවායින් එකකින් හෝ සිදුවෙයි. කවර සතර කරුණකින් ද? නැති වූ දෙය නොසොයති. දිරාගිය දෙය පිළිසකර නොකරති. අප්‍රමාණ පානභෝජන ඇත්තෝ වෙති. දුශ්ශීල වූ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අධිපති තනතුරේ තබති. මහණෙනි, යම්කිසි කුලයක් භෝග සම්පත්වලින් මහත් බවට පැමිණ බොහෝ කල් නොපවතී ද, ඒ සියල්ල මේ සතර කරුණෙන් හෝ ඒ කරුණුවලින් එකකින් හෝ සිදුවෙයි.\n\nමහණෙනි, යම්කිසි කුලයක් භෝග සම්පත්වලින් මහත් බවට පැමිණ බොහෝ කල් පවතී ද, ඒ සියල්ල සතර කරුණකින් හෝ ඒවායින් එකකින් හෝ සිදුවෙයි. කවර සතර කරුණකින් ද? නැති වූ දෙය සොයති. දිරාගිය දෙය පිළිසකර කරති. ප්‍රමාණවත් පානභෝජන ඇත්තෝ වෙති. සිල්වත් වූ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අධිපති තනතුරේ තබති. මහණෙනි, යම්කිසි කුලයක් භෝග සම්පත්වලින් මහත් බවට පැමිණ බොහෝ කල් පවතී ද, ඒ සියල්ල මේ සතර කරුණෙන් හෝ ඒ කරුණුවලින් එකකින් හෝ සිදුවෙයි.",
      "paliTitle": "Kulasuttaṃ"
    },
    {
      "number": 259,
      "pali": "‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca ārohapariṇāhasampanno ca. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti? Idha, bhikkhave, bhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Evaṃ kho, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti. ‘‘Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, a king’s excellent thoroughbred horse, endowed with four qualities, is worthy of a king, fit for a king’s use, and is reckoned as a king’s asset. Which four? Here, monks, a king’s excellent thoroughbred horse is endowed with good appearance, endowed with strength, endowed with swiftness, and endowed with stature and girth. Indeed, monks, a king’s excellent thoroughbred horse, endowed with these four qualities, is worthy of a king, fit for a king’s use, and is reckoned as a king’s asset.\n\n“Even so, monks, a monk endowed with four qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and is an unsurpassed field of merit for the world. Which four? Here, monks, a monk is endowed with spiritual beauty, endowed with spiritual strength, endowed with penetrative understanding, and endowed with spiritual eminence and widespread influence.\n\n“And how, monks, is a monk endowed with spiritual beauty? Here, monks, a monk is virtuous; he dwells restrained by the Pātimokkha rules, endowed with proper conduct and resort, seeing danger in the slightest faults, and undertaking the training in the precepts. It is in this way, monks, that a monk is endowed with spiritual beauty.\n\n“And how, monks, is a monk endowed with spiritual strength? Here, monks, a monk dwells with aroused energy for the abandonment of unwholesome states and for the acquisition of wholesome states; he is strong, firm in exertion, and does not lay down the burden in regard to wholesome states. It is in this way, monks, that a monk is endowed with spiritual strength.\n\n“And how, monks, is a monk endowed with penetrative understanding? Here, monks, a monk understands ‘This is suffering’ as it actually is; he understands ‘This is the origin of suffering’ as it actually is; he understands ‘This is the cessation of suffering’ as it actually is; he understands ‘This is the path leading to the cessation of suffering’ as it actually is. It is in this way, monks, that a monk is endowed with penetrative understanding.\n\n“And how, monks, is a monk endowed with spiritual eminence and widespread influence? Here, monks, a monk is a recipient of robes, alms-food, lodgings, and medicinal requisites for the sick. It is in this way, monks, that a monk is endowed with spiritual eminence and widespread influence.\n\n“Indeed, monks, a monk endowed with these four qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and is an unsurpassed field of merit for the world.”",
      "sinhala": "මහණෙනි, කරුණු සතරකින් යුක්ත වූ රජුගේ යහපත් වූ ආජානීය අශ්වයා රජුට සුදුසු වේ, රජුගේ භෝගයක් වේ, රජුගේම අංගයක් ලෙසට ගණන් ගැනේ. කවර සතරකින්ද? මහණෙනි, මෙහිලා රජුගේ යහපත් වූ ආජානීය අශ්වයා වර්ණ සම්පන්න ද වේ, බල සම්පන්න ද වේ, ජව සම්පන්න ද වේ, ආරෝහ-පරිණාහ සම්පන්න ද වේ. මහණෙනි, මේ සතර කරුණෙන් යුක්ත වූ රජුගේ යහපත් ආජානීය අශ්වයා රජුට සුදුසු වේ, රජුගේ භෝගයක් වේ, රජුගේම අංගයක් ලෙසට ගණන් ගැනේ.\n\nඑපරිද්දෙන්ම මහණෙනි, කරුණු සතරකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ෂිණෙය්‍ය වේ, ඇඳිලි කළ යුතු වේ, ලෝකයාට අනුත්තර වූ පින්කෙතක් වේ. කවර සතරකින්ද? මහණෙනි, මෙහිලා භික්ෂුව වර්ණ සම්පන්න ද වේ, බල සම්පන්න ද වේ, ජව සම්පන්න ද වේ, ආරෝහ-පරිණාහ සම්පන්න ද වේ.\n\nමහණෙනි, කෙසේද භික්ෂුව වර්ණ සම්පන්න වන්නේ? මහණෙනි, මෙහිලා භික්ෂුව සිල්වත් වේ, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි, ආචාර සම්පන්න ගෝචර සම්පන්න වේ, අල්පමාත්‍ර වරදෙහි ද භය දක්නා සුළු වේ, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. මහණෙනි, මෙපරිද්දෙන්ම භික්ෂුව වර්ණ සම්පන්න වේ.\n\nමහණෙනි, කෙසේද භික්ෂුව බල සම්පන්න වන්නේ? මහණෙනි, මෙහිලා භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස ද, කුසල ධර්මයන් උපදවා ගැනීම පිණිස ද වීර්යය ආරම්භ කොට වාසය කරයි. තීව්‍ර වීර්යයෙන්, දැඩි පරාක්‍රමයෙන්, කුසල ධර්මයන්හි තම වගකීම අත්නොහරිනසුලු වේ. මහණෙනි, මෙපරිද්දෙන්ම භික්ෂුව බල සම්පන්න වේ.\n\nමහණෙනි, කෙසේද භික්ෂුව ජව සම්පන්න වන්නේ? මහණෙනි, මෙහිලා භික්ෂුව ‘මෙය දුක යි’ කියා යථාර්ථය අවබෝධ කරයි, ‘මෙය දුක ඇතිවීමට හේතුව යි’ කියා යථාර්ථය අවබෝධ කරයි, ‘මෙය දුක නැතිකිරීම යි’ කියා යථාර්ථය අවබෝධ කරයි, ‘මෙය දුක් නිරෝධයට ගමන් කරන ප්‍රතිපදාව යි’ කියා යථාර්ථය අවබෝධ කරයි. මහණෙනි, මෙපරිද්දෙන්ම භික්ෂුව ජව සම්පන්න වේ.\n\nමහණෙනි, කෙසේද භික්ෂුව ආරෝහ-පරිණාහ සම්පන්න වන්නේ? මහණෙනි, මෙහිලා භික්ෂුව සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන මේවා ලබන්නෙක් වේ. මහණෙනි, මෙපරිද්දෙන්ම භික්ෂුව ආරෝහ-පරිණාහ සම්පන්න වේ.\n\nමහණෙනි, මේ කරුණු සතරකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ෂිණෙය්‍ය වේ, ඇඳිලි කළ යුතු වේ, ලෝකයාට අනුත්තර වූ පින්කෙතක් වේ යි.",
      "paliTitle": "Paṭhamaājānīyasuttaṃ"
    },
    {
      "number": 260,
      "pali": "‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti, balasampanno ca, javasampanno ca, ārohapariṇāhasampanno ca. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti, balasampanno ca, javasampanno ca, ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā… pe… sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti? Idha, bhikkhave, bhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Evaṃ kho, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti. ‘‘Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ.",
      "english": "“Monks, a king's excellent thoroughbred horse, endowed with four qualities, is worthy of a king, fit for a king, and is considered a royal asset. Which four? Here, monks, a king's excellent thoroughbred horse is endowed with beauty, endowed with strength, endowed with speed, and endowed with stature and girth. Indeed, monks, a king's excellent thoroughbred horse, endowed with these four qualities, is worthy of a king, fit for a king, and is considered a royal asset.\n\n“Just so, monks, a monk endowed with four qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of salutation with joined hands, an unsurpassed field of merit for the world. Which four? Here, monks, a monk is endowed with beauty of conduct, endowed with strength, endowed with swiftness, and endowed with stature and girth.\n\n“And how, monks, is a monk endowed with beauty of conduct? Here, monks, a monk is virtuous; he dwells restrained by the Pāṭimokkha rules, perfect in conduct and resort, seeing danger in the slightest faults, he trains himself by undertaking the training rules. Thus, monks, is a monk endowed with beauty of conduct.\n\n“And how, monks, is a monk endowed with strength? Here, monks, a monk dwells with aroused energy for the abandoning of unwholesome states and for the acquiring of wholesome states; he is steadfast, firm in exertion, and does not abandon the burden in wholesome states. Thus, monks, is a monk endowed with strength.\n\n“And how, monks, is a monk endowed with swiftness? Here, monks, a monk, through the destruction of the taints, having directly realized it for himself, enters and dwells in the taintless liberation of mind and liberation through wisdom. Thus, monks, is a monk endowed with swiftness.\n\n“And how, monks, is a monk endowed with stature and girth? Here, monks, a monk is a recipient of robes, almsfood, lodgings, and medicinal requisites for the sick. Thus, monks, is a monk endowed with stature and girth.\n\n“Indeed, monks, a monk endowed with these four qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of salutation with joined hands, an unsurpassed field of merit for the world.”",
      "sinhala": "භික්ෂූණි, අංග සතරකින් යුත් රජුගේ උසස් අශ්ව ජාතිය රජුට සුදුසු වේ, රජු විසින් පරිභෝජනයට සුදුසු වේ, රජුගේ අංගයක් ලෙසම සැලකේ. ඒ අංග සතර කවරේද? භික්ෂූණි, මෙහිලා රජුගේ උසස් ජාතියේ අශ්වයා වර්ණසම්පන්න ද වේ, බලසම්පන්න ද වේ, ජවසම්පන්න ද වේ, ආරෝහ-පරිනාහ සම්පන්න ද වේ. භික්ෂූණි, මේ සතර අංගයෙන් යුක්ත වූ රජුගේ උසස් ජාතියේ අශ්වයා රජුට සුදුසු වේ, රජු විසින් පරිභෝජනයට සුදුසු වේ, රජුගේ අංගයක් ලෙසම සැලකේ.\n\nභික්ෂූණි, එසේම ධර්ම සතරකින් යුක්ත වූ භික්ෂුව ආහුනෙය්‍ය වේ, පාහුනෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අංජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් ද වේ. ඒ ධර්ම සතර කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව වර්ණසම්පන්න ද වේ, බලසම්පන්න ද වේ, ජවසම්පන්න ද වේ, ආරෝහ-පරිනාහ සම්පන්න ද වේ.\n\nභික්ෂූණි, භික්ෂුව කෙසේ නම් වර්ණසම්පන්න වේද? භික්ෂූණි, මෙහිලා භික්ෂුව සීලවන්ත වේ, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි, ආචාර ගෝචර සම්පන්න වේ, අනුමාත්‍ර වූ වරදෙහි ද භය දක්නා සුළු වේ, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. භික්ෂූණි, භික්ෂුව මෙසේ වර්ණසම්පන්න වේ.\n\nභික්ෂූණි, භික්ෂුව කෙසේ නම් බලසම්පන්න වේද? භික්ෂූණි, මෙහිලා භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස ද, කුසල ධර්මයන් සම්පාදනය කිරීම පිණිස ද ආරම්භ කළ වීර්යයෙන් යුතුව වාසය කරයි, ශක්තිමත්, දැඩි පරාක්‍රම ඇති, කුසල ධර්මයන් පිළිබඳව තමාගේ බර අත්නොහළ තැනැත්තෙකු වේ. භික්ෂූණි, භික්ෂුව මෙසේ බලසම්පන්න වේ.\n\nභික්ෂූණි, භික්ෂුව කෙසේ නම් ජවසම්පන්න වේද? භික්ෂූණි, මෙහිලා භික්ෂුව ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන්, අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමා විසින්ම අභිඥාපූර්වකව ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරයි. භික්ෂූණි, භික්ෂුව මෙසේ ජවසම්පන්න වේ.\n\nභික්ෂූණි, භික්ෂුව කෙසේ නම් ආරෝහ-පරිනාහ සම්පන්න වේද? භික්ෂූණි, මෙහිලා භික්ෂුව සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර ලාභී වේ. භික්ෂූණි, භික්ෂුව මෙසේ ආරෝහ-පරිනාහ සම්පන්න වේ.\n\nභික්ෂූණි, මේ ධර්ම සතරින් යුක්ත වූ භික්ෂුව ආහුනෙය්‍ය වේ, පාහුනෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අංජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් ද වේ.",
      "paliTitle": "Dutiyaājānīyasuttaṃ"
    },
    {
      "number": 261,
      "pali": "‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – imāni kho, bhikkhave, cattāri balānī’’ti. Aṭṭhamaṃ.",
      "english": "Bhikkhus, there are these four powers. Which four? The power of energy, the power of mindfulness, the power of concentration, and the power of wisdom – indeed, Bhikkhus, these are the four powers.",
      "sinhala": "මහණෙනි, මේ බලධර්ම සතරකි. ඒ සතර කවරේද? වීර්ය_බලය, සති_බලය, සමාධි_බලය, ප්‍රඥා_බලය යන මේවාය. මහණෙනි, මේ බලධර්ම සතර නම් මේවාමයි.",
      "paliTitle": "Balasuttaṃ"
    },
    {
      "number": 262,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu nālaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ. Katamehi catūhi? Kāmavitakkena, byāpādavitakkena, vihiṃsāvitakkena, duppañño hoti jaḷo elamūgo – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu nālaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ. ‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ. Katamehi catūhi? Nekkhammavitakkena, abyāpādavitakkena, avihiṃsāvitakkena, paññavā hoti ajaḷo anelamūgo – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ araññavanappatthāni pantāni senāsanāni paṭisevitu’’nti. Navamaṃ.",
      "english": "Monks, a bhikkhu endowed with four qualities is not fit to resort to remote forest and jungle dwellings. Which four? One who is given to thoughts of sensual desire, to thoughts of ill-will, to thoughts of harm; and one who is unwise, dull-witted, and foolish like a dumb animal. Monks, a bhikkhu endowed with these four qualities is not fit to resort to remote forest and jungle dwellings.\n\nMonks, a bhikkhu endowed with four qualities is fit to resort to remote forest and jungle dwellings. Which four? One who is given to thoughts of renunciation, to thoughts of non-ill-will, to thoughts of non-harm; and one who is discerning, not dull-witted, and not foolish like a dumb animal. Monks, a bhikkhu endowed with these four qualities is fit to resort to remote forest and jungle dwellings.",
      "sinhala": "මහණෙනි, ධර්ම සතරකින් යුත් භික්ෂුවක් වනගත වූ, ජනශූන්‍ය වූ, දුරස්ථ සෙනසුන් සේවනය කිරීමට සුදුසු නොවේ. කවර සතරකින්ද? කාම විතර්කයෙන්, ව්‍යාපාද විතර්කයෙන්, විහිංසා විතර්කයෙන් යුක්ත වූවෙක් වන නිසාත්, නුවණින් හීන වූ, අඥාන වූ, මන්දබුද්ධික වූවෙක් වන නිසාත් ය. මහණෙනි, මේ සතර ධර්මයන්ගෙන් යුත් භික්ෂුවක් වනගත වූ, ජනශූන්‍ය වූ, දුරස්ථ සෙනසුන් සේවනය කිරීමට සුදුසු නොවේ.\n\nමහණෙනි, ධර්ම සතරකින් යුත් භික්ෂුවක් වනගත වූ, ජනශූන්‍ය වූ, දුරස්ථ සෙනසුන් සේවනය කිරීමට සුදුසු වේ. කවර සතරකින්ද? නෛෂ්ක්‍රම්‍ය විතර්කයෙන්, අව්‍යාපාද විතර්කයෙන්, අවිහිංසා විතර්කයෙන් යුක්ත වූවෙක් වන නිසාත්, ප්‍රඥාවන්ත වූ, අඥාන නොවන, මන්දබුද්ධික නොවන වූවෙක් වන නිසාත් ය. මහණෙනි, මේ සතර ධර්මයන්ගෙන් යුත් භික්ෂුවක් වනගත වූ, ජනශූන්‍ය වූ, දුරස්ථ සෙනසුන් සේවනය කිරීමට සුදුසු වේ.",
      "paliTitle": "Araññasuttaṃ"
    },
    {
      "number": 263,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi catūhi? Sāvajjena kāyakammena, sāvajjena vacīkammena, sāvajjena manokammena, sāvajjāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati. ‘‘Catūhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi catūhi? Anavajjena kāyakammena, anavajjena vacīkammena, anavajjena manokammena, anavajjāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. Dasamaṃ. ",
      "english": "Monks, a fool, an unskillful and ignoble person, endowed with four qualities, brings ruin and injury upon himself, is blameworthy and censurable by the discerning, and generates much demerit. Which four? By blameworthy bodily action, by blameworthy verbal action, by blameworthy mental action, and by blameworthy view. Monks, it is with these four qualities that a fool, an unskillful and ignoble person, brings ruin and injury upon himself, is blameworthy and censurable by the discerning, and generates much demerit.\n\nMonks, a wise, skillful, and noble person, endowed with four qualities, preserves himself from ruin and injury, is blameless and beyond reproach by the discerning, and generates much merit. Which four? By blameless bodily action, by blameless verbal action, by blameless mental action, and by blameless view. Monks, it is with these four qualities that a wise, skillful, and noble person preserves himself from ruin and injury, is blameless and beyond reproach by the discerning, and generates much merit.",
      "sinhala": "මහණෙනි, බාල, නොදැමුණු, අසත්පුරුෂ පුද්ගලයා කරුණු සතරකින් යුක්තව, තමා විනාශයට හා පිරිහීමට ලක්කර ගනිමින් හැසිරෙයි. ඔහු විඥානවන්තයන් විසින් දොස් නගන ලද, නින්දාවට ලක් වූ තැනැත්තෙකු වෙයි. බොහෝ අකුසල්ද රැස්කර ගනී.\n\nඒ කරුණු සතර කවරේද?\n\nදෝෂ සහිත කාය කර්මයෙන්, දෝෂ සහිත වචී කර්මයෙන්, දෝෂ සහිත මනෝ කර්මයෙන්, දෝෂ සහිත දෘෂ්ටියෙන්ය.\n\nමහණෙනි, මේ කරුණු සතරින් යුක්ත වූ බාල, නොදැමුණු, අසත්පුරුෂ පුද්ගලයා, තමා විනාශයට හා පිරිහීමට ලක්කර ගනිමින් හැසිරෙයි. ඔහු විඥානවන්තයන් විසින් දොස් නගන ලද, නින්දාවට ලක් වූ තැනැත්තෙකු වෙයි. බොහෝ අකුසල්ද රැස්කර ගනී.\n\nමහණෙනි, පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා කරුණු සතරකින් යුක්තව, තමා විනාශයට හා පිරිහීමට ලක්නොකර ගනිමින් හැසිරෙයි. ඔහු විඥානවන්තයන් විසින් දොස් නැඟිය නොහැකි, නින්දාවට ලක්විය යුතු නොවන තැනැත්තෙකු වෙයි. බොහෝ පින්ද රැස්කර ගනී.\n\nඒ කරුණු සතර කවරේද?\n\nදොස් නැඟිය නොහැකි කාය කර්මයෙන්, දොස් නැඟිය නොහැකි වචී කර්මයෙන්, දොස් නැඟිය නොහැකි මනෝ කර්මයෙන්, දොස් නැඟිය නොහැකි දෘෂ්ටියෙන්ය.\n\nමහණෙනි, මේ කරුණු සතරින් යුක්ත වූ පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා, තමා විනාශයට හා පිරිහීමට ලක්නොකර ගනිමින් හැසිරෙයි. ඔහු විඥානවන්තයන් විසින් දොස් නැඟිය නොහැකි, නින්දාවට ලක්විය යුතු නොවන තැනැත්තෙකු වෙයි. බොහෝ පින්ද රැස්කර ගනී.",
      "paliTitle": "Kammasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Abhiññāvaggo chaṭṭho. Tassuddānaṃ – Abhiññā pariyesanā, saṅgahaṃ mālukyaputto; Kulaṃ dve ca ājānīyā, balaṃ araññakammunāti.",
    "english": "",
    "sinhala": ""
  }
}