{
  "id": "an4.15",
  "title": {
    "pali": "Ābhāvaggo",
    "english": "The Chapter on Radiance",
    "sinhala": "ආලෝක වග්ගය"
  },
  "sections": [
    {
      "number": 141,
      "pali": "‘‘Catasso imā, bhikkhave, ābhā. Katamā catasso? Candābhā, sūriyābhā, aggābhā, paññābhā – imā kho, bhikkhave, catasso ābhā. Etadaggaṃ, bhikkhave, imāsaṃ catunnaṃ [catassannaṃ (syā. kaṃ.) saddanītipadamālā passitabbā] ābhānaṃ yadidaṃ paññābhā’’ti. Paṭhamaṃ.",
      "english": "Monks, these four are kinds of radiance. Which four? The radiance of the moon, the radiance of the sun, the radiance of fire, and the radiance of wisdom. These, monks, are the four kinds of radiance. Among these four kinds of radiance, monks, the foremost is the radiance of wisdom.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ආලෝක හතරකි. ඒ කවරේද?\n\nචන්ද්‍රාලෝකය, සූර්යාලෝකය, අග්නි ආලෝකය, ප්‍ර‌ඥාලෝකය – භික්ෂූන් වහන්ස, මේවා ඒ ආලෝක සතරයි.\n\nභික්ෂූන් වහන්ස, මේ ආලෝක සතර අතුරින් ප්‍ර‌ඥාලෝකය අග්‍ර වන්නේය.",
      "paliTitle": "Ābhāsuttaṃ",
      "englishTitle": "The Light Discourse",
      "sinhalaTitle": "ආභා සූත‍්‍රය"
    },
    {
      "number": 142,
      "pali": "‘‘Catasso imā, bhikkhave, pabhā. Katamā catasso? Candappabhā, sūriyappabhā, aggippabhā, paññāpabhā – imā kho, bhikkhave, catasso pabhā. Etadaggaṃ, bhikkhave, imāsaṃ catunnaṃ pabhānaṃ yadidaṃ paññāpabhā’’ti. Dutiyaṃ.",
      "english": "“Monks, there are these four kinds of radiance. Which four? Moonlight, sunlight, firelight, and the radiance of wisdom – these, monks, are the four kinds of radiance. Among these four kinds of radiance, monks, the radiance of wisdom is indeed the foremost.”",
      "sinhala": "භික්ෂූණි, මේ ආලෝක සතරකි. ඒවා කවරේද? සඳෙහි ආලෝකය, හිරුගේ ආලෝකය, ගින්නේ ආලෝකය, ප්‍රඥාවෙහි ආලෝකය – භික්ෂූණි, මේ ආලෝක සතරයි. භික්ෂූණි, මේ ආලෝක සතර අතුරින් ප්‍රඥාවෙහි ආලෝකය අග්‍රයයි.",
      "paliTitle": "Pabhāsuttaṃ",
      "englishTitle": "The Discourse on Light",
      "sinhalaTitle": "ප්‍රභා සූත්‍රය"
    },
    {
      "number": 143,
      "pali": "‘‘Cattārome, bhikkhave, ālokā. Katame cattāro? Candāloko, sūriyāloko, aggāloko, paññāloko – ime kho, bhikkhave, cattāro ālokā. Etadaggaṃ, bhikkhave, imesaṃ catunnaṃ ālokānaṃ yadidaṃ paññāloko’’ti. Tatiyaṃ.",
      "english": "Monks, there are these four lights. Which four? The light of the moon, the light of the sun, the light of fire, and the light of wisdom – these, monks, are the four lights. Among these four lights, monks, the light of wisdom is the foremost.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ආලෝක සතරක් ඇත. ඒ කවර සතරක්ද? චන්ද්‍රාලෝකය, සූර්‍ය්‍යා​ලෝකය, අග්නි ආලෝකය, ප්‍රඥා​ලෝකය වශයෙනි. භික්ෂූන් වහන්ස, මේවා ඒ ආලෝක සතරයි. භික්ෂූන් වහන්ස, මේ ආලෝක සතර අතුරින් ප්‍රඥා​ලෝකයම අග්‍ර වන්නේය.",
      "paliTitle": "Ālokasuttaṃ",
      "englishTitle": "The Discourse on Light",
      "sinhalaTitle": "ආලෝක සූත්‍රය"
    },
    {
      "number": 144,
      "pali": "‘‘Cattārome, bhikkhave, obhāsā. Katame cattāro? Candobhāso, sūriyobhāso, aggobhāso, paññobhāso – ime kho, bhikkhave, cattāro obhāsā. Etadaggaṃ, bhikkhave, imesaṃ catunnaṃ obhāsānaṃ yadidaṃ paññobhāso’’ti. Catutthaṃ.",
      "english": "“Monks, there are these four kinds of radiance. Which four? The radiance of the moon, the radiance of the sun, the radiance of fire, and the radiance of wisdom – these, monks, are the four kinds of radiance. Of these four kinds of radiance, monks, the radiance of wisdom is supreme.”",
      "sinhala": "භික්ෂූනි, මේ ආලෝක සතරක් ඇත. ඒ කවරවා ද? චන්ද්‍රයාගේ ආලෝකය, සූර්යයාගේ ආලෝකය, ගින්නෙහි ආලෝකය, ප‍්‍රඥාවේ ආලෝකය – භික්ෂූනි, මේ ආලෝක සතරයි. භික්ෂූනි, මේ ආලෝක සතර අතුරින් ප‍්‍රඥාවේ ආලෝකය අග්‍ර ය.",
      "paliTitle": "Obhāsasuttaṃ",
      "englishTitle": "The Sutta on Radiance",
      "sinhalaTitle": "ඕභාස සූත්‍රය"
    },
    {
      "number": 145,
      "pali": "‘‘Cattārome, bhikkhave, pajjotā. Katame cattāro? Candapajjoto, sūriyapajjoto, aggipajjoto, paññāpajjoto – ime kho, bhikkhave, cattāro pajjotā. Etadaggaṃ, bhikkhave, imesaṃ catunnaṃ pajjotānaṃ yadidaṃ paññāpajjoto’’ti. Pañcamaṃ.",
      "english": "Monastics, there are these four luminaries. Which four? The luminary of the moon, the luminary of the sun, the luminary of fire, and the luminary of wisdom – these, monastics, are the four luminaries. Among these four luminaries, monastics, the luminary of wisdom is the foremost.",
      "sinhala": "භික්ෂූණි, මේ ආලෝක සතරක් ඇත. කවරේද ඒ සතර? චන්ද්‍රාලෝකය, සූර්යාලෝකය, අග්නි ආලෝකය, ප්‍රඥාලෝකය යන මේ ආලෝක සතර වේ. භික්ෂූණි, මේ සතර ආලෝක අතුරින් ප්‍රඥාලෝකය අග්‍ර වන්නේය.",
      "paliTitle": "Pajjotasuttaṃ",
      "englishTitle": "Discourse on Light",
      "sinhalaTitle": "පජ්ජෝත සූත්‍රය"
    },
    {
      "number": 146,
      "pali": "‘‘Cattārome, bhikkhave, kālā. Katame cattāro? Kālena dhammassavanaṃ, kālena dhammasākacchā, kālena sammasanā [kālena samatho (sī. syā. kaṃ. pī.)], kālena vipassanā – ime kho, bhikkhave, cattāro kālā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these four opportune times. What are these four? The timely hearing of the Dhamma, the timely discussion of the Dhamma, timely thorough comprehension, and timely insight development – these, monks, are the four opportune times.",
      "sinhala": "මහණෙනි, මේ කාලවල් සතරකි. කවරේද ඒ සතර?\n\nකාලෝචිත ධර්ම ශ්‍රවණය, කාලෝචිත ධර්ම සාකච්ඡා කිරීම, කාලෝචිතව ධර්මය සම්මර්ශනය කිරීම, කාලෝචිත විදර්ශනා කිරීම – මහණෙනි, මේවා නම් ඒ සතර කාලවල් යි.",
      "paliTitle": "Paṭhamakālasuttaṃ",
      "englishTitle": "The First Time Discourse",
      "sinhalaTitle": "පළමු කාල සූත්‍රය"
    },
    {
      "number": 147,
      "pali": "‘‘Cattārome, bhikkhave, kālā sammā bhāviyamānā sammā anuparivattiyamānā anupubbena āsavānaṃ khayaṃ pāpenti. Katame cattāro? Kālena dhammassavanaṃ, kālena dhammasākacchā, kālena sammasanā, kālena vipassanā – ime kho, bhikkhave, cattāro kālā sammā bhāviyamānā sammā anuparivattiyamānā anupubbena āsavānaṃ khayaṃ pāpenti. ‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūreti; pabbatakandarapadarasākhā paripūrā kusobbhe paripūrenti; kusobbhā paripūrā mahāsobbhe paripūrenti; mahāsobbhā paripūrā kunnadiyo paripūrenti; kunnadiyo paripūrā mahānadiyo paripūrenti; mahānadiyo paripūrā samuddaṃ [samuddaṃ sāgaraṃ (sī. pī. ka.), samuddasāgaraṃ (syā. kaṃ.)] paripūrenti. Evamevaṃ kho, bhikkhave, ime cattāro kālā sammā bhāviyamānā sammā anuparivattiyamānā anupubbena āsavānaṃ khayaṃ pāpentī’’ti. Sattamaṃ.",
      "english": "Monks, there are these four opportune practices which, when rightly cultivated and rightly carried out in succession, gradually lead to the destruction of the taints. Which four? Timely listening to the Dhamma, timely discussion of the Dhamma, timely contemplation, and timely insight. Indeed, Monks, these four opportune practices, when rightly cultivated and rightly carried out in succession, gradually lead to the destruction of the taints.\n\nMonks, just as when a heavy rain falls on a mountaintop, that water, flowing down according to the incline, fills the mountain clefts, fissures, and gullies. When the mountain clefts, fissures, and gullies are full, they fill the small pools. When the small pools are full, they fill the large pools. When the large pools are full, they fill the small rivers. When the small rivers are full, they fill the great rivers. When the great rivers are full, they fill the ocean. Even so, Monks, these four opportune practices, when rightly cultivated and rightly carried out in succession, gradually lead to the destruction of the taints.",
      "sinhala": "මහණෙනි, මේ කාල සතරක් මැනවින් ප්‍රගුණ කරනු ලබන විට, මැනවින් අනුක්‍රමයෙන් පිළිපදිනු ලබන විට, අනුපිළිවෙලින් ආසවයන්ගේ ක්ෂය කරා පමුණුවයි. ඒ කවර සතරක්ද? කලට ධර්ම ශ්‍රවණය, කලට ධර්ම සාකච්ඡා කිරීම, කලට ධර්මය නුවණින් විමර්ශනය කිරීම, කලට විදර්ශනා කිරීම – මහණෙනි, මේ කාල සතර මැනවින් ප්‍රගුණ කරනු ලබන විට, මැනවින් අනුක්‍රමයෙන් පිළිපදිනු ලබන විට, අනුපිළිවෙලින් ආසවයන්ගේ ක්ෂය කරා පමුණුවයි.\n\nමහණෙනි, යම් සේ උස් පර්වතයක මහ වැසි වසින කල්හි, ඒ ජලය පහත් බිම් කරා ගලමින් පර්වත වල කඳුරු, විවර සහ අතු දිය පහරවල් පුරවයි. පර්වත කඳුරු, විවර, සහ අතු දිය පහරවල් පිරී ගිය කල්හි, කුඩා විල් පුරවයි. කුඩා විල් පිරී ගිය කල්හි, මහා විල් පුරවයි. මහා විල් පිරී ගිය කල්හි, කුඩා ගංගා පුරවයි. කුඩා ගංගා පිරී ගිය කල්හි, මහා ගංගා පුරවයි. මහා ගංගා පිරී ගිය කල්හි, සාගරය පුරවයි. මහණෙනි, එපරිද්දෙන්ම මේ සතර අවස්ථාවන් මැනවින් ප්‍රගුණ කරනු ලබන විට, මැනවින් අනුක්‍රමයෙන් පිළිපදිනු ලබන විට, අනුපිළිවෙලින් ආසවයන්ගේ ක්ෂය කරා පමුණුවයි.",
      "paliTitle": "Dutiyakālasuttaṃ",
      "englishTitle": "Second Discourse on Time",
      "sinhalaTitle": "දෙවන කාල සූත්‍රය"
    },
    {
      "number": 148,
      "pali": "‘‘Cattārimāni, bhikkhave, vacīduccaritāni. Katamāni cattāri? Musāvādo, pisuṇā vācā, pharusā vācā, samphappalāpo – imāni kho, bhikkhave, cattāri vacīduccaritānī’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, these are the four unwholesome verbal actions. Which four? False speech, slanderous speech, harsh speech, and idle chatter – these, monks, are the four unwholesome verbal actions.”",
      "sinhala": "මහණෙනි, මේ වචී දුශ්චරිත සතරක් වෙති. ඒ සතර කවරේද? මුසාවාදය, පිසුනු බස්, පරුෂ වචන, සම්ඵප්පලාපය – මහණෙනි, මේවාය අර වචී දුශ්චරිත සතර. අටවැන්නයි.",
      "paliTitle": "Duccaritasuttaṃ",
      "englishTitle": "Discourse on Misconduct",
      "sinhalaTitle": "දුශ්චරිත සූත්‍රය"
    },
    {
      "number": 149,
      "pali": "‘‘Cattārimāni, bhikkhave, vacīsucaritāni. Katamāni cattāri? Saccavācā, apisuṇā vācā, saṇhā vācā, mantabhāsā – imāni kho, bhikkhave, cattāri vacīsucaritānī’’ti. Navamaṃ.",
      "english": "Monks, there are these four virtuous conducts of speech. Which four? Truthful speech, non-slanderous speech, gentle speech, and meaningful speech – these, monks, are the four virtuous conducts of speech.",
      "sinhala": "භික්ෂූන් වහන්ස, මේවා වචී සුචරිත සතරකි.\nඒ සතර කවරේද?\nසත්‍ය කථා කිරීම, පේසුණ්‍ය රහිත කථාව, ප්‍රිය වචනය කථා කිරීම, සහ අර්ථවත් හා ප්‍රයෝජනවත් කථාවයි. භික්ෂූන් වහන්ස, මේවා වචී සුචරිත සතර වේ.",
      "paliTitle": "Sucaritasuttaṃ",
      "englishTitle": "Discourse on Good Conduct",
      "sinhalaTitle": "සුචරිත සූත්‍රය"
    },
    {
      "number": 150,
      "pali": "‘‘Cattārome, bhikkhave, sārā. Katame cattāro? Sīlasāro, samādhisāro, paññāsāro, vimuttisāro – ime kho, bhikkhave, cattāro sārā’’ti. Dasamaṃ. ",
      "english": "Monks, these are the four essences. What are these four? They are the essence of moral conduct, the essence of concentration, the essence of wisdom, and the essence of liberation. Monks, these are indeed the four essences.",
      "sinhala": "භික්ෂූනි, මේ සාරධර්ම සතරක් වෙති. කවර සතරක්ද යත්: සීලසාරය, සමාධිසාරය, ප්‍රඥාසාරය, විමුක්තිසාරය යන මේවා ය. භික්ෂූනි, සැබවින්ම මේ සතර සාරධර්මයෝ වෙති.",
      "paliTitle": "Sārasuttaṃ",
      "englishTitle": "The Essence Discourse",
      "sinhalaTitle": "සාර සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "Catutthapaṇṇāsakaṃ",
      "english": "The Fourth Fifty",
      "sinhala": "සතරවැනි පණස්වග",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Ābhāvaggo pañcamo. Tassuddānaṃ – Ābhā pabhā ca ālokā, obhāsā ceva pajjotā; Dve kālā caritā dve ca, honti sārena te dasāti. Tatiyapaṇṇāsakaṃ samattaṃ.",
    "english": "The Fifth Chapter on Radiance",
    "sinhala": "පස්වන ආභා වග්ගය"
  }
}