{
  "id": "an4.10",
  "title": {
    "pali": "Asuravaggo",
    "english": "The Chapter on Asuras",
    "sinhala": "අසුර වග්ගය"
  },
  "sections": [
    {
      "number": 91,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Asuro asuraparivāro, asuro devaparivāro, devo asuraparivāro, devo devaparivāro. ‘‘Kathañca, bhikkhave, puggalo asuro hoti asuraparivāro? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo, parisāpissa hoti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, puggalo asuro hoti asuraparivāro. ‘‘Kathañca, bhikkhave, puggalo asuro hoti devaparivāro? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo, parisā ca khvassa hoti sīlavatī kalyāṇadhammā. Evaṃ kho, bhikkhave, puggalo asuro hoti devaparivāro. ‘‘Kathañca, bhikkhave, puggalo devo hoti asuraparivāro? Idha, bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo, parisā ca khvassa hoti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, puggalo devo hoti asuraparivāro. ‘‘Kathañca, bhikkhave, puggalo devo hoti devaparivāro? Idha, bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo, parisāpissa hoti sīlavatī kalyāṇadhammā. Evaṃ kho, bhikkhave, puggalo devo hoti, devaparivāro. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Paṭhamaṃ.",
      "english": "Bhikkhus, these four types of individuals are present and found in the world. Which four? An 'asura' individual with an 'asura' following, an 'asura' individual with a 'deva' following, a 'deva' individual with an 'asura' following, a 'deva' individual with a 'deva' following.\n\nAnd how, bhikkhus, is an individual an 'asura' with an 'asura' following? Here, bhikkhus, a certain individual is unvirtuous and of ignoble character, and his associates are also unvirtuous and of ignoble character. That is how, bhikkhus, an individual is an 'asura' with an 'asura' following.\n\nAnd how, bhikkhus, is an individual an 'asura' with a 'deva' following? Here, bhikkhus, a certain individual is unvirtuous and of ignoble character, but his associates are virtuous and of noble character. That is how, bhikkhus, an individual is an 'asura' with a 'deva' following.\n\nAnd how, bhikkhus, is an individual a 'deva' with an 'asura' following? Here, bhikkhus, a certain individual is virtuous and of noble character, but his associates are unvirtuous and of ignoble character. That is how, bhikkhus, an individual is a 'deva' with an 'asura' following.\n\nAnd how, bhikkhus, is an individual a 'deva' with a 'deva' following? Here, bhikkhus, a certain individual is virtuous and of noble character, and his associates are also virtuous and of noble character. That is how, bhikkhus, an individual is a 'deva' with a 'deva' following.\n\nThese, bhikkhus, are the four types of individuals that are present and found in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සත්‍ය වශයෙන්ම පවතින්නාහුය, සම්පූර්ණයෙන්ම විද්‍යමානයෝ වෙති. ඒ සතර දෙනා කවරහුද? අසුරයෙක් අසුර පිරිවර ඇතිවද, අසුරයෙක් දෙවි පිරිවර ඇතිවද, දෙවියෙක් අසුර පිරිවර ඇතිවද, දෙවියෙක් දෙවි පිරිවර ඇතිවද යන මේ සතර දෙනායි.\n\nමහණෙනි, පුද්ගලයෙක් අසුරයෙක්ව, අසුර පිරිවර ඇතිව සිටින්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් දුශ්ශීල වූයේද, පවිටු ගති පැවතුම් ඇත්තෙක් වූයේද වෙයි. ඔහුගේ පිරිසද දුශ්ශීල වූවාය, පවිටු ගති පැවතුම් ඇත්තී වූවාය. මහණෙනි, පුද්ගලයෙක් අසුරයෙක්ව, අසුර පිරිවර ඇතිව සිටින්නේ මෙසේය.\n\nමහණෙනි, පුද්ගලයෙක් අසුරයෙක්ව, දෙවි පිරිවර ඇතිව සිටින්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් දුශ්ශීල වූයේද, පවිටු ගති පැවතුම් ඇත්තෙක් වූයේද වෙයි. ඔහුගේ පිරිස නම් සිල්වත් වූවාය, යහපත් ගති පැවතුම් ඇත්තී වූවාය. මහණෙනි, පුද්ගලයෙක් අසුරයෙක්ව, දෙවි පිරිවර ඇතිව සිටින්නේ මෙසේය.\n\nමහණෙනි, පුද්ගලයෙක් දෙවියෙක්ව, අසුර පිරිවර ඇතිව සිටින්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සිල්වත් වූයේද, යහපත් ගති පැවතුම් ඇත්තෙක් වූයේද වෙයි. ඔහුගේ පිරිස නම් දුශ්ශීල වූවාය, පවිටු ගති පැවතුම් ඇත්තී වූවාය. මහණෙනි, පුද්ගලයෙක් දෙවියෙක්ව, අසුර පිරිවර ඇතිව සිටින්නේ මෙසේය.\n\nමහණෙනි, පුද්ගලයෙක් දෙවියෙක්ව, දෙවි පිරිවර ඇතිව සිටින්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් සිල්වත් වූයේද, යහපත් ගති පැවතුම් ඇත්තෙක් වූයේද වෙයි. ඔහුගේ පිරිසද සිල්වත් වූවාය, යහපත් ගති පැවතුම් ඇත්තී වූවාය. මහණෙනි, පුද්ගලයෙක් දෙවියෙක්ව, දෙවි පිරිවර ඇතිව සිටින්නේ මෙසේය. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සත්‍ය වශයෙන්ම පවතින්නාහුය, සම්පූර්ණයෙන්ම විද්‍යමානයෝ වෙති.",
      "paliTitle": "Asurasuttaṃ",
      "englishTitle": "The Asura Sutta",
      "sinhalaTitle": "අසුර සූත්‍රය"
    },
    {
      "number": 92,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Dutiyaṃ.",
      "english": "Monks, these four types of individuals are found existing in the world. Which four? Here, monks, a certain individual attains internal mental tranquility but does not attain higher wisdom through insight into phenomena. Here again, monks, a certain individual attains higher wisdom through insight into phenomena but does not attain internal mental tranquility. Here again, monks, a certain individual neither attains internal mental tranquility nor attains higher wisdom through insight into phenomena. Here again, monks, a certain individual both attains internal mental tranquility and attains higher wisdom through insight into phenomena. These, monks, are the four types of individuals found existing in the world.\n\nThe Second.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි පවතින්නාහ. ඒ සතර දෙනා කවරහුද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නේය, එහෙත් අධිප්‍රඥා ධර්ම විපස්සනාව ලබන්නේ නැත. එහෙත් මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අධිප්‍රඥා ධර්ම විපස්සනාව ලබන්නේය, එහෙත් අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නේ නැත. තවද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමාධියද නොලබන්නේය, අධිප්‍රඥා ධර්ම විපස්සනාවද නොලබන්නේය. තවද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමාධියද ලබන්නේය, අධිප්‍රඥා ධර්ම විපස්සනාවද ලබන්නේය. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි පවතින්නාහ.",
      "paliTitle": "Paṭhamasamādhisuttaṃ",
      "englishTitle": "First Concentration Sutta",
      "sinhalaTitle": "ප්‍රථම සමාධි සූත්‍රය"
    },
    {
      "number": 93,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī hoti ajjhattaṃ cetosamathassa na lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena ajjhattaṃ cetosamathe patiṭṭhāya adhipaññādhammavipassanāya yogo karaṇīyo. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya na lābhī ajjhattaṃ cetosamathassa, tena, bhikkhave, puggalena adhipaññādhammavipassanāya patiṭṭhāya ajjhattaṃ cetosamathe yogo karaṇīyo. So aparena samayena lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṃ cetosamathassa. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ceva lābhī ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva [tassa tasseva (sī. syā. kaṃ.)] celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena puggalena tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya, tena, bhikkhave, puggalena tesuyeva kusalesu dhammesu patiṭṭhāya uttari [uttariṃ (sī. syā. kaṃ. pī.)] āsavānaṃ khayāya yogo karaṇīyo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ.",
      "english": "Monks, these four types of individuals are found existing in the world. Which four?\n\nHere, monks, a certain individual is an obtainer of inner mental tranquility, but not an obtainer of higher wisdom regarding phenomena. However, monks, a certain individual is an obtainer of higher wisdom regarding phenomena, but not an obtainer of inner mental tranquility. However, monks, a certain individual is neither an obtainer of inner mental tranquility nor an obtainer of higher wisdom regarding phenomena. However, monks, a certain individual is both an obtainer of inner mental tranquility and an obtainer of higher wisdom regarding phenomena.\n\nAmong these, monks, for that individual who is an obtainer of inner mental tranquility but not an obtainer of higher wisdom regarding phenomena, that individual, monks, having established themselves in inner mental tranquility, should exert themselves in higher wisdom regarding phenomena. Later, they become both an obtainer of inner mental tranquility and an obtainer of higher wisdom regarding phenomena.\n\nAmong these, monks, for that individual who is an obtainer of higher wisdom regarding phenomena but not an obtainer of inner mental tranquility, that individual, monks, having established themselves in higher wisdom regarding phenomena, should exert themselves in inner mental tranquility. Later, they become both an obtainer of higher wisdom regarding phenomena and an obtainer of inner mental tranquility.\n\nAmong these, monks, for that individual who is neither an obtainer of inner mental tranquility nor an obtainer of higher wisdom regarding phenomena, that individual, monks, should make an intense wish, effort, exertion, endeavor, unflagging energy, mindfulness, and clear comprehension for the acquisition of these wholesome qualities. Just as, monks, if one's clothes were ablaze or one's head was aflame, they would make an intense wish, effort, exertion, endeavor, unflagging energy, mindfulness, and clear comprehension to extinguish those clothes or head; in the same way, monks, that individual should make an intense wish, effort, exertion, endeavor, unflagging energy, mindfulness, and clear comprehension for the acquisition of these wholesome qualities. Later, they become both an obtainer of inner mental tranquility and an obtainer of higher wisdom regarding phenomena.\n\nAmong these, monks, for that individual who is both an obtainer of inner mental tranquility and an obtainer of higher wisdom regarding phenomena, that individual, monks, having established themselves in these wholesome qualities, should exert themselves further for the destruction of the taints. These, monks, are the four types of individuals found existing in the world.",
      "sinhala": "භික්‍ෂූනි, ලෝකයෙහි සතර ආකාර පුද්ගලයෝ සිටිති, පවතිති. කවරහුද ඒ සතර දෙනා? භික්‍ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමථය ලබන්නේය, එහෙත් අධිප්‍රඥා ධර්ම විපස්සනාව නොලබන්නේය. භික්‍ෂූනි, මෙහිලා තවත් ඇතැම් පුද්ගලයෙක් අධිප්‍රඥා ධර්ම විපස්සනාව ලබන්නේය, එහෙත් අධ්‍යාත්මික චිත්ත සමථය නොලබන්නේය. භික්‍ෂූනි, මෙහිලා තවත් ඇතැම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමථයද නොලබන්නේය, අධිප්‍රඥා ධර්ම විපස්සනාවද නොලබන්නේය. භික්‍ෂූනි, මෙහිලා තවත් ඇතැම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමථයද ලබන්නේය, අධිප්‍රඥා ධර්ම විපස්සනාවද ලබන්නේය.\n\nභික්‍ෂූනි, එහිලා යම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමථය ලබන්නේය, එහෙත් අධිප්‍රඥා ධර්ම විපස්සනාව නොලබන්නේද, භික්‍ෂූනි, ඒ පුද්ගලයා විසින් අධ්‍යාත්මික චිත්ත සමථයෙහි පිහිටා අධිප්‍රඥා ධර්ම විපස්සනාව සඳහා යෝගය (ව්‍යායාමය) කළ යුත්තේය. ඔහු පසු කලෙක අධ්‍යාත්මික චිත්ත සමථයද ලබන්නේය, අධිප්‍රඥා ධර්ම විපස්සනාවද ලබන්නේය.\n\nභික්‍ෂූනි, එහිලා යම් පුද්ගලයෙක් අධිප්‍රඥා ධර්ම විපස්සනාව ලබන්නේය, එහෙත් අධ්‍යාත්මික චිත්ත සමථය නොලබන්නේද, භික්‍ෂූනි, ඒ පුද්ගලයා විසින් අධිප්‍රඥා ධර්ම විපස්සනාවෙහි පිහිටා අධ්‍යාත්මික චිත්ත සමථය සඳහා යෝගය කළ යුත්තේය. ඔහු පසු කලෙක අධිප්‍රඥා ධර්ම විපස්සනාවද ලබන්නේය, අධ්‍යාත්මික චිත්ත සමථයද ලබන්නේය.\n\nභික්‍ෂූනි, එහිලා යම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමථයද නොලබන්නේද, අධිප්‍රඥා ධර්ම විපස්සනාවද නොලබන්නේද, භික්‍ෂූනි, ඒ පුද්ගලයා විසින් ඒ කුසල ධර්මයන් ලැබීම පිණිස අතිශයින්ම ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සුකත්වයද, නොපසුබට බවද, සතියද, සම්පජඤ්ඤයද කළ යුත්තේය. භික්‍ෂූනි, යම්සේ ද දැවෙන වස්ත්‍ර ඇත්තෙක් හෝ දැවෙන හිස ඇත්තෙක් හෝ ඒ වස්ත්‍රය හෝ හිස නිවා දැමීම පිණිස අතිශයින්ම ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සුකත්වයද, නොපසුබට බවද, සතියද, සම්පජඤ්ඤයද කරන්නේද; භික්‍ෂූනි, එපරිද්දෙන්ම ඒ පුද්ගලයා විසින් ඒ කුසල ධර්මයන් ලැබීම පිණිස අතිශයින්ම ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සුකත්වයද, නොපසුබට බවද, සතියද, සම්පජඤ්ඤයද කළ යුත්තේය. ඔහු පසු කලෙක අධ්‍යාත්මික චිත්ත සමථයද ලබන්නේය, අධිප්‍රඥා ධර්ම විපස්සනාවද ලබන්නේය.\n\nභික්‍ෂූනි, එහිලා යම් පුද්ගලයෙක් අධ්‍යාත්මික චිත්ත සමථයද ලබන්නේය, අධිප්‍රඥා ධර්ම විපස්සනාවද ලබන්නේද, භික්‍ෂූනි, ඒ පුද්ගලයා විසින් ඒ කුසල ධර්මයන්හිම පිහිටා ආශ්‍රවයන්ගේ ක්ෂය කිරීම පිණිස තවදුරටත් යෝගය (ව්‍යායාමය) කළ යුත්තේය. භික්‍ෂූනි, ලෝකයෙහි සිටින, පවතින මේ සිව් ආකාර පුද්ගලයෝ මේ වෙති.",
      "paliTitle": "Dutiyasamādhisuttaṃ",
      "englishTitle": "The Second Concentration Discourse",
      "sinhalaTitle": "ද්විතීය සමාධි සූත්‍රය"
    },
    {
      "number": 94,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī ajjhattaṃ cetosamathassa na lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, saṅkhārā daṭṭhabbā? Kathaṃ saṅkhārā sammasitabbā? Kathaṃ saṅkhārā vipassitabbā’ [passitabbā (ka.)] ti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, saṅkhārā daṭṭhabbā, evaṃ saṅkhārā sammasitabbā, evaṃ saṅkhārā vipassitabbā’ti. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya na lābhī ajjhattaṃ cetosamathassa, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī ajjhattaṃ cetosamathassa so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, cittaṃ saṇṭhapetabbaṃ? Kathaṃ cittaṃ sannisādetabbaṃ? Kathaṃ cittaṃ ekodi kātabbaṃ? Kathaṃ cittaṃ samādahātabba’nti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, cittaṃ saṇṭhapetabbaṃ, evaṃ cittaṃ sannisādetabbaṃ, evaṃ cittaṃ ekodi kātabbaṃ [ekodi kattabbaṃ (pī.)], evaṃ cittaṃ samādahātabba’nti. So aparena samaye lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṃ cetosamathassa. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ceva lābhī ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī ceva ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, cittaṃ saṇṭhapetabbaṃ? Kathaṃ cittaṃ sannisādetabbaṃ? Kathaṃ cittaṃ ekodi kātabbaṃ? Kathaṃ cittaṃ samādahātabbaṃ? Kathaṃ saṅkhārā daṭṭhabbā? Kathaṃ saṅkhārā sammasitabbā? Kathaṃ saṅkhārā vipassitabbā’ti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, cittaṃ saṇṭhapetabbaṃ, evaṃ cittaṃ sannisādetabbaṃ, evaṃ cittaṃ ekodi kātabbaṃ, evaṃ cittaṃ samādahātabbaṃ, evaṃ saṅkhārā daṭṭhabbā, evaṃ saṅkhārā sammasitabbā, evaṃ saṅkhārā vipassitabbā’ti. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena tesu ceva kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Catutthaṃ.",
      "english": "Monks, these four types of individuals are present, existing in the world. Which four? Here, monks, a certain individual is a recipient of inner mental tranquility, but not a recipient of insight into phenomena leading to higher wisdom. But here, monks, a certain individual is a recipient of insight into phenomena leading to higher wisdom, but not a recipient of inner mental tranquility. But here, monks, a certain individual is neither a recipient of inner mental tranquility nor a recipient of insight into phenomena leading to higher wisdom. But here, monks, a certain individual is both a recipient of inner mental tranquility and a recipient of insight into phenomena leading to higher wisdom.\n\nAmong these, monks, the individual who is a recipient of inner mental tranquility but not a recipient of insight into phenomena leading to higher wisdom should approach the individual who is a recipient of insight into phenomena leading to higher wisdom and say to them: ‘How, friend, are conditioned phenomena to be seen? How are conditioned phenomena to be examined? How are conditioned phenomena to be observed with insight?’ That person then explains to them exactly as they have seen and understood: ‘This is how, friend, conditioned phenomena are to be seen; this is how conditioned phenomena are to be examined; this is how conditioned phenomena are to be observed with insight.’ Later, that individual becomes a recipient of both inner mental tranquility and insight into phenomena leading to higher wisdom.\n\nAmong these, monks, the individual who is a recipient of insight into phenomena leading to higher wisdom but not a recipient of inner mental tranquility should approach the individual who is a recipient of inner mental tranquility and say to them: ‘How, friend, is the mind to be established? How is the mind to be calmed? How is the mind to be unified? How is the mind to be concentrated?’ That person then explains to them exactly as they have seen and understood: ‘This is how, friend, the mind is to be established; this is how the mind is to be calmed; this is how the mind is to be unified; this is how the mind is to be concentrated.’ Later, that individual becomes a recipient of both insight into phenomena leading to higher wisdom and inner mental tranquility.\n\nAmong these, monks, the individual who is neither a recipient of inner mental tranquility nor a recipient of insight into phenomena leading to higher wisdom should approach the individual who is both a recipient of inner mental tranquility and a recipient of insight into phenomena leading to higher wisdom and say to them: ‘How, friend, is the mind to be established? How is the mind to be calmed? How is the mind to be unified? How is the mind to be concentrated? How are conditioned phenomena to be seen? How are conditioned phenomena to be examined? How are conditioned phenomena to be observed with insight?’ That person then explains to them exactly as they have seen and understood: ‘This is how, friend, the mind is to be established; this is how the mind is to be calmed; this is how the mind is to be unified; this is how the mind is to be concentrated; this is how conditioned phenomena are to be seen; this is how conditioned phenomena are to be examined; this is how conditioned phenomena are to be observed with insight.’ Later, that individual becomes a recipient of both inner mental tranquility and insight into phenomena leading to higher wisdom.\n\nAmong these, monks, the individual who is both a recipient of inner mental tranquility and a recipient of insight into phenomena leading to higher wisdom, should establish themselves in those wholesome states and strive further for the destruction of the taints. These, monks, are the four types of individuals present, existing in the world.",
      "sinhala": "භික්ෂූණි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටින්නාහ, විද්‍යමාන වන්නාහ. කවර සතර දෙනෙක්ද?\n\nභික්ෂූණි, මෙහිලා එක්තරා පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධිය ලාභී වේ. නමුත් අධිප්‍ර​ඥා ධර්ම විදර්ශනාව ලාභී නොවේ. භික්ෂූණි, තවද මෙහිලා එක්තරා පුද්ගලයෙක් අධිප්‍ර​ඥා ධර්ම විදර්ශනාව ලාභී වේ. නමුත් තමන් තුළ චිත්ත සමාධිය ලාභී නොවේ. භික්ෂූණි, තවද මෙහිලා එක්තරා පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධියද ලාභී නොවේ, අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී නොවේ. භික්ෂූණි, තවද මෙහිලා එක්තරා පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධියද ලාභී වේ, අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී වේ.\n\nභික්ෂූණි, එහිලා යම් පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධිය ලාභී වේ. නමුත් අධිප්‍ර​ඥා ධර්ම විදර්ශනාව ලාභී නොවේද, ඒ පුද්ගලයා විසින්, භික්ෂූණි, යම් පුද්ගලයෙක් අධිප්‍ර​ඥා ධර්ම විදර්ශනාව ලාභී වේද, ඔහු කරා එළඹ මෙසේ පැවසිය යුතුය: ‘ඇවැත්නි, සංස්කාර ධර්මයෝ කෙසේ දැක්ක යුතුද? කෙසේ මෙනෙහි කළ යුතුද? කෙසේ විදර්ශනා කළ යුතුද?’ කියා. ඔහුට, ඒ පුද්ගලයා තමන් දුටු ආකාරයට, තමන් අවබෝධ කළ ආකාරයට, මෙසේ පැහැදිලි කරයි: ‘ඇවැත්නි, සංස්කාර ධර්මයෝ මෙසේ දැක්ක යුතුයි, මෙසේ මෙනෙහි කළ යුතුයි, මෙසේ විදර්ශනා කළ යුතුයි’ කියා. පසුව ඔහුද තමන් තුළ චිත්ත සමාධියද ලාභී වේ, අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී වේ.\n\nභික්ෂූණි, එහිලා යම් පුද්ගලයෙක් අධිප්‍ර​ඥා ධර්ම විදර්ශනාව ලාභී වේ. නමුත් තමන් තුළ චිත්ත සමාධිය ලාභී නොවේද, ඒ පුද්ගලයා විසින්, භික්ෂූණි, යම් පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධිය ලාභී වේද, ඔහු කරා එළඹ මෙසේ පැවසිය යුතුය: ‘ඇවැත්නි, සිත කෙසේ පිහිටුවිය යුතුද? කෙසේ සංසිඳවිය යුතුද? කෙසේ එකඟ කළ යුතුද? කෙසේ සමාධිගත කළ යුතුද?’ කියා. ඔහුට, ඒ පුද්ගලයා තමන් දුටු ආකාරයට, තමන් අවබෝධ කළ ආකාරයට, මෙසේ පැහැදිලි කරයි: ‘ඇවැත්නි, සිත මෙසේ පිහිටුවිය යුතුයි, මෙසේ සංසිඳවිය යුතුයි, මෙසේ එකඟ කළ යුතුයි, මෙසේ සමාධිගත කළ යුතුයි’ කියා. පසුව ඔහුද අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී වේ, තමන් තුළ චිත්ත සමාධියද ලාභී වේ.\n\nභික්ෂූණි, එහිලා යම් පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධියද ලාභී නොවේ, අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී නොවේද, ඒ පුද්ගලයා විසින්, භික්ෂූණි, යම් පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධියද ලාභී වේද, අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී වේද, ඔහු කරා එළඹ මෙසේ පැවසිය යුතුය: ‘ඇවැත්නි, සිත කෙසේ පිහිටුවිය යුතුද? කෙසේ සංසිඳවිය යුතුද? කෙසේ එකඟ කළ යුතුද? කෙසේ සමාධිගත කළ යුතුද? සංස්කාර ධර්මයෝ කෙසේ දැක්ක යුතුද? කෙසේ මෙනෙහි කළ යුතුද? කෙසේ විදර්ශනා කළ යුතුද?’ කියා. ඔහුට, ඒ පුද්ගලයා තමන් දුටු ආකාරයට, තමන් අවබෝධ කළ ආකාරයට, මෙසේ පැහැදිලි කරයි: ‘ඇවැත්නි, සිත මෙසේ පිහිටුවිය යුතුයි, මෙසේ සංසිඳවිය යුතුයි, මෙසේ එකඟ කළ යුතුයි, මෙසේ සමාධිගත කළ යුතුයි. සංස්කාර ධර්මයෝ මෙසේ දැක්ක යුතුයි, මෙසේ මෙනෙහි කළ යුතුයි, මෙසේ විදර්ශනා කළ යුතුයි’ කියා. පසුව ඔහුද තමන් තුළ චිත්ත සමාධියද ලාභී වේ, අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී වේ.\n\nභික්ෂූණි, එහිලා යම් පුද්ගලයෙක් තමන් තුළ චිත්ත සමාධියද ලාභී වේ, අධිප්‍ර​ඥා ධර්ම විදර්ශනාවද ලාභී වේද, ඒ පුද්ගලයා විසින්, භික්ෂූණි, ඒ කුසල ධර්මයන්හි පිහිටා, තවදුරටත් ආශ්‍ර​වයන් ක්ෂය කිරීම පිණිස යෝගය කළ යුතුය. භික්ෂූණි, මේ සතර පුද්ගලයෝ ලෝකයෙහි සිටින්නාහ, විද්‍යමාන වන්නාහ.",
      "paliTitle": "Tatiyasamādhisuttaṃ",
      "englishTitle": "The Third Concentration Discourse",
      "sinhalaTitle": "තෘතීය සමාධි සූත්‍රය"
    },
    {
      "number": 95,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Nevattahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, attahitāya paṭipanno no parahitāya, attahitāya ceva [attahitāya ca (sī. syā. kaṃ. pī.)] paṭipanno parahitāya ca. ‘‘Seyyathāpi, bhikkhave, chavālātaṃ ubhato padittaṃ [ādittaṃ (ka.)], majjhe gūthagataṃ, neva gāme kaṭṭhatthaṃ pharati na araññe ( ) [(kaṭṭhatthaṃ pharati) katthaci]; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi yvāyaṃ puggalo nevattahitāya paṭipanno no parahitāya. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo parahitāya paṭipanno no attahitāya, ayaṃ imesaṃ dvinnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Tatra, bhikkhave, yvāyaṃ puggalo attahitāya paṭipanno no parahitāya, ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Tatra, bhikkhave, yvāyaṃ puggalo attahitāya ceva paṭipanno parahitāya ca, ayaṃ imesaṃ catunnaṃ puggalānaṃ aggo ca seṭṭho ca pāmokkho [mokkho (pī.) saṃ. ni. 3.662-663; a. ni. 5.181] ca uttamo ca pavaro ca. ‘‘Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo, sappimaṇḍo [sappimhā sappimaṇḍo (ka.)] tattha [tatra (saṃ. ni. 3.662-662)] aggamakkhāyati; evamevaṃ kho, bhikkhave, yvāyaṃ puggalo attahitāya ceva paṭipanno parahitāya ca, ayaṃ imesaṃ catunnaṃ puggalānaṃ aggo ca seṭṭho ca pāmokkho ca uttamo ca pavaro ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Pañcamaṃ.",
      "english": "Monks, these four individuals are found existing in the world. Which four? One who practices neither for their own benefit nor for the benefit of others; one who practices for the benefit of others but not for their own benefit; one who practices for their own benefit but not for the benefit of others; and one who practices both for their own benefit and for the benefit of others.\n\nMonks, just as a charred log, burning at both ends and soiled with excrement in the middle, is not useful as firewood in a village nor in a wilderness; likewise, Monks, I declare this individual to be like that: one who practices neither for their own benefit nor for the benefit of others.\n\nMonks, among these, the individual who practices for the benefit of others but not for their own benefit, is more excellent and more refined than these two individuals. Monks, among these, the individual who practices for their own benefit but not for the benefit of others, is more excellent and more refined than these three individuals. Monks, among these, the individual who practices both for their own benefit and for the benefit of others, is the foremost, the best, the chief, the highest, and the supreme among these four individuals.\n\nMonks, just as from a cow comes milk, from milk comes curds, from curds comes fresh butter, from fresh butter comes ghee, and from ghee comes the cream of ghee, which is declared the foremost of them; even so, Monks, the individual who practices both for their own benefit and for the benefit of others is the foremost, the best, the chief, the highest, and the supreme among these four individuals. These, Monks, are the four individuals found existing in the world.",
      "sinhala": "භික්ෂුන් වහන්ස, මේ පුද්ගලයන් සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. ඒ සතර දෙනා කවරහුද? තමන්ගේ යහපත පිණිස ද නොපිළිපන්නා වූ, අනුන්ගේ යහපත පිණිස ද නොපිළිපන්නා වූ පුද්ගලයා; අනුන්ගේ යහපත පිණිස පිළිපන්නා වූ, තමන්ගේ යහපත පිණිස නොපිළිපන්නා වූ පුද්ගලයා; තමන්ගේ යහපත පිණිස පිළිපන්නා වූ, අනුන්ගේ යහපත පිණිස නොපිළිපන්නා වූ පුද්ගලයා; තමන්ගේ යහපත පිණිසත්, අනුන්ගේ යහපත පිණිසත් පිළිපන්නා වූ පුද්ගලයා යන මොවුහු ය.\n\nභික්ෂුන් වහන්ස, යම්සේ දෙපැත්තෙන් දැල්වී මැදින් ගොම ගෑවී ගිය දර කැබැල්ලක් ගමෙහි දර පිණිසත් නොපවතින්නේද, ආරණ්‍යයෙහි දර පිණිසත් නොපවතින්නේද; භික්ෂුන් වහන්ස, තමන්ගේ යහපත පිණිස ද නොපිළිපන්නා වූ, අනුන්ගේ යහපත පිණිස ද නොපිළිපන්නා වූ යම් පුද්ගලයෙක් ඇත්ද, ඔහු මෙබඳු උපමාවකින් මම කියමි.\n\nභික්ෂුන් වහන්ස, එහිලා අනුන්ගේ යහපත පිණිස පිළිපන්නා වූ, තමන්ගේ යහපත පිණිස නොපිළිපන්නා වූ යම් පුද්ගලයෙක් ඇත්ද, ඔහු මේ පුද්ගලයන් දෙදෙනා අතුරින් උසස් ද, ප්‍රණීත ද වේ. භික්ෂුන් වහන්ස, එහිලා තමන්ගේ යහපත පිණිස පිළිපන්නා වූ, අනුන්ගේ යහපත පිණිස නොපිළිපන්නා වූ යම් පුද්ගලයෙක් ඇත්ද, ඔහු මේ පුද්ගලයන් තිදෙනා අතුරින් උසස් ද, ප්‍රණීත ද වේ. භික්ෂුන් වහන්ස, එහිලා තමන්ගේ යහපත පිණිසත්, අනුන්ගේ යහපත පිණිසත් පිළිපන්නා වූ යම් පුද්ගලයෙක් ඇත්ද, ඔහු මේ පුද්ගලයන් සතර දෙනා අතුරින් අග්‍ර ද, ශ්‍රේෂ්ඨ ද, ප්‍රධාන ද, උත්තම ද, ප්‍රවර ද වේ.\n\nභික්ෂුන් වහන්ස, යම්සේ ගවයාගෙන් කිරි ද, කිරෙන් දී කිරි ද, දී කිරෙන් අලුතින් ගත් බටර් ද, අලුතින් ගත් බටර් වලින් ගිතෙල් ද, ගිතෙලින් ගිතෙල් සාරය ද (ලැබේද), එහිලා ඒ ගිතෙල් සාරය අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂුන් වහන්ස, එසේම තමන්ගේ යහපත පිණිසත්, අනුන්ගේ යහපත පිණිසත් පිළිපන්නා වූ යම් පුද්ගලයෙක් ඇත්ද, ඔහු මේ පුද්ගලයන් සතර දෙනා අතුරින් අග්‍ර ද, ශ්‍රේෂ්ඨ ද, ප්‍රධාන ද, උත්තම ද, ප්‍රවර ද වේ. භික්ෂුන් වහන්ස, මේ පුද්ගලයන් සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Chavālātasuttaṃ",
      "englishTitle": "Discourse on the Corpse Firebrand",
      "sinhalaTitle": "ඡවාලාත සූත්‍රය"
    },
    {
      "number": 96,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca. ‘‘Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti no parahitāya? Idha, bhikkhave, ekacco puggalo attanā rāgavinayāya paṭipanno hoti, no paraṃ rāgavinayāya samādapeti; attanā dosavinayāya paṭipanno hoti, no paraṃ dosavinayāya samādapeti; attanā mohavinayāya paṭipanno hoti, no paraṃ mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya. ‘‘Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo attanā na rāgavinayāya paṭipanno hoti, paraṃ rāgavinayāya samādapeti; attanā na dosavinayāya paṭipanno hoti, paraṃ dosavinayāya samādapeti; attanā na mohavinayāya paṭipanno hoti, paraṃ mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya. ‘‘Kathañca, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo attanā na rāgavinayāya paṭipanno hoti, no paraṃ rāgavinayāya samādapeti; attanā na dosavinayāya paṭipanno hoti, no paraṃ dosavinayāya samādapeti; attanā na mohavinayāya paṭipanno hoti, no paraṃ mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya. ‘‘Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo attanā ca rāgavinayāya paṭipanno hoti, parañca rāgavinayāya samādapeti; attanā ca dosavinayāya paṭipanno hoti, parañca dosavinayāya samādapeti; attanā ca mohavinayāya paṭipanno hoti, parañca mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, these four types of individuals are found existing in the world. Which four? One who practices for their own welfare but not for the welfare of others; one who practices for the welfare of others but not for their own welfare; one who practices neither for their own welfare nor for the welfare of others; one who practices both for their own welfare and for the welfare of others.\n\nAnd how, bhikkhus, is an individual engaged in practice for their own welfare but not for the welfare of others? Here, bhikkhus, a certain individual is engaged in practice for the eradication of their own lust, but does not inspire others to practice for the eradication of lust; they are engaged in practice for the eradication of their own hatred, but does not inspire others to practice for the eradication of hatred; they are engaged in practice for the eradication of their own delusion, but does not inspire others to practice for the eradication of delusion. This is how, bhikkhus, an individual is engaged in practice for their own welfare but not for the welfare of others.\n\nAnd how, bhikkhus, is an individual engaged in practice for the welfare of others but not for their own welfare? Here, bhikkhus, a certain individual is not engaged in practice for the eradication of their own lust, yet they inspire others to practice for the eradication of lust; they are not engaged in practice for the eradication of their own hatred, yet they inspire others to practice for the eradication of hatred; they are not engaged in practice for the eradication of their own delusion, yet they inspire others to practice for the eradication of delusion. This is how, bhikkhus, an individual is engaged in practice for the welfare of others but not for their own welfare.\n\nAnd how, bhikkhus, is an individual engaged in practice neither for their own welfare nor for the welfare of others? Here, bhikkhus, a certain individual is not engaged in practice for the eradication of their own lust, nor do they inspire others to practice for the eradication of lust; they are not engaged in practice for the eradication of their own hatred, nor do they inspire others to practice for the eradication of hatred; they are not engaged in practice for the eradication of their own delusion, nor do they inspire others to practice for the eradication of delusion. This is how, bhikkhus, an individual is engaged in practice neither for their own welfare nor for the welfare of others.\n\nAnd how, bhikkhus, is an individual engaged in practice both for their own welfare and for the welfare of others? Here, bhikkhus, a certain individual is engaged in practice for the eradication of their own lust, and also inspires others to practice for the eradication of lust; they are engaged in practice for the eradication of their own hatred, and also inspires others to practice for the eradication of hatred; they are engaged in practice for the eradication of their own delusion, and also inspires others to practice for the eradication of delusion. This is how, bhikkhus, an individual is engaged in practice both for their own welfare and for the welfare of others. These, bhikkhus, are the four types of individuals found existing in the world.",
      "sinhala": "මහණෙනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි සිටිති, පවතී. කවරහුද ඒ සතර දෙනා? තම යහපත පිණිස පිළිපදින්නා මිස අනුන්ගේ යහපත පිණිස නොපිළිපදින්නා, අනුන්ගේ යහපත පිණිස පිළිපදින්නා මිස තම යහපත පිණිස නොපිළිපදින්නා, තම යහපත පිණිසද නොපිළිපදින්නා, අනුන්ගේ යහපත පිණිසද නොපිළිපදින්නා, තම යහපත පිණිසද, අනුන්ගේ යහපත පිණිසද පිළිපදින්නා යන සතර දෙනාය.\n\nමහණෙනි, පුද්ගලයෙක් තම යහපත පිණිස පිළිපදින්නෙක් මිස අනුන්ගේ යහපත පිණිස නොපිළිපදින්නෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් තමා විසින් රාගය දුරු කිරීම පිණිස පිළිපදින්නේ වේ, නමුත් අනුන් රාගය දුරු කිරීම පිණිස සම්‍යක් ප්‍රේරණය නොකරයි; තමා විසින් ද්වේෂය දුරු කිරීම පිණිස පිළිපදින්නේ වේ, නමුත් අනුන් ද්වේෂය දුරු කිරීම පිණිස සම්‍යක් ප්‍රේරණය නොකරයි; තමා විසින් මෝහය දුරු කිරීම පිණිස පිළිපදින්නේ වේ, නමුත් අනුන් මෝහය දුරු කිරීම පිණිස සම්‍යක් ප්‍රේරණය නොකරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් තම යහපත පිණිස පිළිපදින්නෙක් මිස අනුන්ගේ යහපත පිණිස නොපිළිපදින්නෙක් වේ.\n\nමහණෙනි, පුද්ගලයෙක් අනුන්ගේ යහපත පිණිස පිළිපදින්නෙක් මිස තම යහපත පිණිස නොපිළිපදින්නෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් තමා විසින් රාගය දුරු කිරීම පිණිස නොපිළිපදින්නේ වේ, නමුත් අනුන් රාගය දුරු කිරීම පිණිස සම්‍යක් ප්‍රේරණය කරයි; තමා විසින් ද්වේෂය දුරු කිරීම පිණිස නොපිළිපදින්නේ වේ, නමුත් අනුන් ද්වේෂය දුරු කිරීම පිණිස සම්‍යක් ප්‍රේරණය කරයි; තමා විසින් මෝහය දුරු කිරීම පිණිස නොපිළිපදින්නේ වේ, නමුත් අනුන් මෝහය දුරු කිරීම පිණිස සම්‍යක් ප්‍රේරණය කරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් අනුන්ගේ යහපත පිණිස පිළිපදින්නෙක් මිස තම යහපත පිණිස නොපිළිපදින්නෙක් වේ.\n\nමහණෙනි, පුද්ගලයෙක් තම යහපත පිණිසද නොපිළිපදින්නෙක්, අනුන්ගේ යහපත පිණිසද නොපිළිපදින්නෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් තමා විසින් රාගය දුරු කිරීම පිණිස නොපිළිපදින්නේ වේ, අනුන් රාගය දුරු කිරීම පිණිසද සම්‍යක් ප්‍රේරණය නොකරයි; තමා විසින් ද්වේෂය දුරු කිරීම පිණිස නොපිළිපදින්නේ වේ, අනුන් ද්වේෂය දුරු කිරීම පිණිසද සම්‍යක් ප්‍රේරණය නොකරයි; තමා විසින් මෝහය දුරු කිරීම පිණිස නොපිළිපදින්නේ වේ, අනුන් මෝහය දුරු කිරීම පිණිසද සම්‍යක් ප්‍රේරණය නොකරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් තම යහපත පිණිසද නොපිළිපදින්නෙක්, අනුන්ගේ යහපත පිණිසද නොපිළිපදින්නෙක් වේ.\n\nමහණෙනි, පුද්ගලයෙක් තම යහපත පිණිසද, අනුන්ගේ යහපත පිණිසද පිළිපදින්නෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් තමා විසින් රාගය දුරු කිරීම පිණිසද පිළිපදින්නේ වේ, අනුන් රාගය දුරු කිරීම පිණිසද සම්‍යක් ප්‍රේරණය කරයි; තමා විසින් ද්වේෂය දුරු කිරීම පිණිසද පිළිපදින්නේ වේ, අනුන් ද්වේෂය දුරු කිරීම පිණිසද සම්‍යක් ප්‍රේරණය කරයි; තමා විසින් මෝහය දුරු කිරීම පිණිසද පිළිපදින්නේ වේ, අනුන් මෝහය දුරු කිරීම පිණිසද සම්‍යක් ප්‍රේරණය කරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් තම යහපත පිණිසද, අනුන්ගේ යහපත පිණිසද පිළිපදින්නෙක් වේ. මහණෙනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි සිටිති, පවතී.",
      "paliTitle": "Rāgavinayasuttaṃ",
      "englishTitle": "Discourse on Subduing Desire",
      "sinhalaTitle": "රාග විනය සූත්‍‌රය"
    },
    {
      "number": 97,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca. ‘‘Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṃ dhārakajātiko [dhāraṇajātiko (ka.)] hoti, dhātānañca [dhatānañca (sī. syā. kaṃ. pī.)] dhammānaṃ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako [samādāpako (?)] samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya. ‘‘Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṃ dhammānaṃ dhārakajātiko hoti, no ca dhātānaṃ dhammānaṃ atthūpaparikkhī hoti, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya. ‘‘Kathañca, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṃ dhammānaṃ dhārakajātiko hoti, no ca dhātānaṃ dhammānaṃ atthūpaparikkhī hoti, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya. ‘‘Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṃ dhārakajātiko hoti, dhātānañca dhammānaṃ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Sattamaṃ.",
      "english": "Monks, these four types of persons exist and are found in the world. Which four? One who practices for their own benefit but not for the benefit of others; one who practices for the benefit of others but not for their own benefit; one who practices neither for their own benefit nor for the benefit of others; and one who practices for both their own benefit and the benefit of others.\n\nAnd how, monks, is a person one who practices for their own benefit but not for the benefit of others? Here, monks, a certain person is quick to comprehend wholesome states, is of a nature to retain the teachings they have heard, examines the meaning of the teachings they have retained by understanding both the meaning and the Dhamma, and practices in conformity with the Dhamma. But they are not skilled in speech, not endowed with good articulation, not possessing clear and fluent speech capable of explaining the meaning, nor are they one who instructs, encourages, inspires, and gladdens their fellow practitioners. It is in this way, monks, that a person practices for their own benefit but not for the benefit of others.\n\nAnd how, monks, is a person one who practices for the benefit of others but not for their own benefit? Here, monks, a certain person is not quick to comprehend wholesome states, is not of a nature to retain the teachings they have heard, does not examine the meaning of the teachings they have retained, does not understand the meaning or the Dhamma, and does not practice in conformity with the Dhamma. However, they are skilled in speech, endowed with good articulation, possessing clear and fluent speech capable of explaining the meaning, and they are one who instructs, encourages, inspires, and gladdens their fellow practitioners. It is in this way, monks, that a person practices for the benefit of others but not for their own benefit.\n\nAnd how, monks, is a person one who practices neither for their own benefit nor for the benefit of others? Here, monks, a certain person is not quick to comprehend wholesome states, is not of a nature to retain the teachings they have heard, does not examine the meaning of the teachings they have retained, does not understand the meaning or the Dhamma, and does not practice in conformity with the Dhamma. Furthermore, they are not skilled in speech, not endowed with good articulation, not possessing clear and fluent speech capable of explaining the meaning, nor are they one who instructs, encourages, inspires, and gladdens their fellow practitioners. It is in this way, monks, that a person practices neither for their own benefit nor for the benefit of others.\n\nAnd how, monks, is a person one who practices for both their own benefit and the benefit of others? Here, monks, a certain person is quick to comprehend wholesome states, is of a nature to retain the teachings they have heard, examines the meaning of the teachings they have retained by understanding both the meaning and the Dhamma, and practices in conformity with the Dhamma. Furthermore, they are skilled in speech, endowed with good articulation, possessing clear and fluent speech capable of explaining the meaning, and they are one who instructs, encourages, inspires, and gladdens their fellow practitioners. It is in this way, monks, that a person practices for both their own benefit and the benefit of others. These, monks, are the four types of persons existing and found in the world.",
      "sinhala": "භික්ෂූනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි පවත්නාහ, සිටිනාහ. කවරහුද ඒ සතර දෙනා? තමාගේ අර්ථය පිණිස පිළිපදින, අනුන්ගේ අර්ථය පිණිස නොපිළිපදින පුද්ගලයාය; අනුන්ගේ අර්ථය පිණිස පිළිපදින, තමාගේ අර්ථය පිණිස නොපිළිපදින පුද්ගලයාය; තමාගේ අර්ථය පිණිසද නොපිළිපදින, අනුන්ගේ අර්ථය පිණිසද නොපිළිපදින පුද්ගලයාය; තමාගේ අර්ථය පිණිසද, අනුන්ගේ අර්ථය පිණිසද පිළිපදින පුද්ගලයාය.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් තමාගේ අර්ථය පිණිස පිළිපදින්නෙක් වන අතර අනුන්ගේ අර්ථය පිණිස නොපිළිපදින්නෙක් වන්නේ? භික්ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් කුසල ධර්​මයන්හි ඉක්මනින් අවබෝධ කරගන්නෙක් වෙයි. ඇසූ ධර්​මයන් සිත්හි දරා සිටීමේ ස්වභාවයෙන් යුක්ත වෙයි. දරාගත් ධර්​මයන්හි අර්ථය විමසන්නෙක් වෙයි, අර්ථයද ධර්​මයද තේරුම් ගනිමින්, ධර්​මයට අනුකූලව පිළිපදින්නෙක් වෙයි. එහෙත් ඔහු යහපත් වචන ඇත්තෙක් නොවේ, යහපත් ලෙස කතා කරන්නෙක් නොවේ, ව්‍යවහාරයට සුදුසු, පැහැදිලි, නොතැටලෙන, අර්ථය ප්‍රකාශ කරන වචනයකින් යුක්ත නොවේ. එසේම අන්‍ය බ්‍රහ්මචාරීන් (සම්බ්‍රහ්මචාරීන්) හට ධර්​මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උත්සාහවත් කරවන්නෙක්, සතුටු කරවන්නෙක්ද නොවේ. භික්ෂූනි, මෙසේ පුද්ගලයෙක් තමාගේ අර්ථය පිණිස පිළිපදින්නෙක් වන අතර අනුන්ගේ අර්ථය පිණිස නොපිළිපදින්නෙක් වෙයි.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් අනුන්ගේ අර්ථය පිණිස පිළිපදින්නෙක් වන අතර තමාගේ අර්ථය පිණිස නොපිළිපදින්නෙක් වන්නේ? භික්ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් කුසල ධර්​මයන්හි ඉක්මනින් අවබෝධ කරගන්නෙක් නොවේ. ඇසූ ධර්​මයන් සිත්හි දරා සිටීමේ ස්වභාවයෙන් යුක්ත නොවේ. දරාගත් ධර්​මයන්හි අර්ථය විමසන්නෙක්ද නොවේ. අර්ථයද ධර්​මයද තේරුම් ගන්නෙක්ද නොවේ. ධර්​මයට අනුකූලව පිළිපදින්නෙක්ද නොවේ. එහෙත් ඔහු යහපත් වචන ඇත්තෙක් වෙයි, යහපත් ලෙස කතා කරන්නෙක් වෙයි, ව්‍යවහාරයට සුදුසු, පැහැදිලි, නොතැටලෙන, අර්ථය ප්‍රකාශ කරන වචනයකින් යුක්ත වෙයි. එසේම අන්‍ය බ්‍රහ්මචාරීන් හට ධර්​මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උත්සාහවත් කරවන්නෙක්, සතුටු කරවන්නෙක්ද වෙයි. භික්ෂූනි, මෙසේ පුද්ගලයෙක් අනුන්ගේ අර්ථය පිණිස පිළිපදින්නෙක් වන අතර තමාගේ අර්ථය පිණිස නොපිළිපදින්නෙක් වෙයි.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් තමාගේ අර්ථය පිණිසද නොපිළිපදින, අනුන්ගේ අර්ථය පිණිසද නොපිළිපදින්නෙක් වන්නේ? භික්ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් කුසල ධර්​මයන්හි ඉක්මනින් අවබෝධ කරගන්නෙක් නොවේ. ඇසූ ධර්​මයන් සිත්හි දරා සිටීමේ ස්වභාවයෙන් යුක්ත නොවේ. දරාගත් ධර්​මයන්හි අර්ථය විමසන්නෙක්ද නොවේ. අර්ථයද ධර්​මයද තේරුම් ගන්නෙක්ද නොවේ. ධර්​මයට අනුකූලව පිළිපදින්නෙක්ද නොවේ. එසේම ඔහු යහපත් වචන ඇත්තෙක් නොවේ, යහපත් ලෙස කතා කරන්නෙක් නොවේ, ව්‍යවහාරයට සුදුසු, පැහැදිලි, නොතැටලෙන, අර්ථය ප්‍රකාශ කරන වචනයකින් යුක්ත නොවේ. එසේම අන්‍ය බ්‍රහ්මචාරීන් හට ධර්​මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උත්සාහවත් කරවන්නෙක්, සතුටු කරවන්නෙක්ද නොවේ. භික්ෂූනි, මෙසේ පුද්ගලයෙක් තමාගේ අර්ථය පිණිසද නොපිළිපදින, අනුන්ගේ අර්ථය පිණිසද නොපිළිපදින්නෙක් වෙයි.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් තමාගේ අර්ථය පිණිසද, අනුන්ගේ අර්ථය පිණිසද පිළිපදින්නෙක් වන්නේ? භික්ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් කුසල ධර්​මයන්හි ඉක්මනින් අවබෝධ කරගන්නෙක් වෙයි. ඇසූ ධර්​මයන් සිත්හි දරා සිටීමේ ස්වභාවයෙන් යුක්ත වෙයි. දරාගත් ධර්​මයන්හි අර්ථය විමසන්නෙක් වෙයි, අර්ථයද ධර්​මයද තේරුම් ගනිමින්, ධර්​මයට අනුකූලව පිළිපදින්නෙක් වෙයි. එසේම ඔහු යහපත් වචන ඇත්තෙක් වෙයි, යහපත් ලෙස කතා කරන්නෙක් වෙයි, ව්‍යවහාරයට සුදුසු, පැහැදිලි, නොතැටලෙන, අර්ථය ප්‍රකාශ කරන වචනයකින් යුක්ත වෙයි. එසේම අන්‍ය බ්‍රහ්මචාරීන් හට ධර්​මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උත්සාහවත් කරවන්නෙක්, සතුටු කරවන්නෙක්ද වෙයි. භික්ෂූනි, මෙසේ පුද්ගලයෙක් තමාගේ අර්ථය පිණිසද, අනුන්ගේ අර්ථය පිණිසද පිළිපදින්නෙක් වෙයි. භික්ෂූනි, මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි පවත්නාහ, සිටිනාහ.",
      "paliTitle": "Khippanisantisuttaṃ",
      "englishTitle": "Discourse on Swift Insight",
      "sinhalaTitle": "ශීඝ‍්‍ර අවබෝධ සූත‍්‍රය"
    },
    {
      "number": 98,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ.",
      "english": "Monks, these four types of persons exist and are found in the world. Which four?\n\nOne who practices for their own welfare, but not for the welfare of others.\nOne who practices for the welfare of others, but not for their own welfare.\nOne who practices neither for their own welfare nor for the welfare of others.\nOne who practices both for their own welfare and for the welfare of others.\n\nIndeed, Monks, these four types of persons exist and are found in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිති, පවතිති. කවරහුද ඒ සතර දෙනා?\n\nතමන්ගේ යහපත පිණිස පිළිපදින නමුත් අනුන්ගේ යහපත පිණිස නොපිළිපදින තැනැත්තා, අනුන්ගේ යහපත පිණිස පිළිපදින නමුත් තමන්ගේ යහපත පිණිස නොපිළිපදින තැනැත්තා, තමන්ගේ යහපත පිණිසද නොපිළිපදින, අනුන්ගේ යහපත පිණිසද නොපිළිපදින තැනැත්තා, තමන්ගේ යහපත පිණිසත් පිළිපදින, අනුන්ගේ යහපත පිණිසත් පිළිපදින තැනැත්තා.\n\nමහණෙනි, මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි සිටිති, පවතිති.",
      "paliTitle": "Attahitasuttaṃ",
      "englishTitle": "Discourse on Self-Welfare",
      "sinhalaTitle": "තමාට අහිත සූත‍්‍රය"
    },
    {
      "number": 99,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca. ‘‘Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā paṭivirato hoti, no paraṃ pāṇātipātā veramaṇiyā samādapeti; attanā adinnādānā paṭivirato hoti, no paraṃ adinnādānā veramaṇiyā samādapeti; attanā kāmesumicchācārā paṭivirato hoti, no paraṃ kāmesumicchācārā veramaṇiyā samādapeti; attanā musāvādā paṭivirato hoti, no paraṃ musāvādā veramaṇiyā samādapeti; attanā surāmerayamajjapamādaṭṭhānā paṭivirato hoti, no paraṃ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya. ‘‘Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā appaṭivirato hoti, paraṃ pāṇātipātā veramaṇiyā samādapeti; attanā adinnādānā appaṭivirato hoti, paraṃ adinnādānā veramaṇiyā samādapeti; attanā kāmesumicchācārā appaṭivirato hoti, paraṃ kāmesumicchācārā veramaṇiyā samādapeti; attanā musāvādā appaṭivirato hoti, paraṃ musāvādā veramaṇiyā samādapeti; attanā surāmerayamajjapamādaṭṭhānā appaṭivirato hoti, paraṃ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya. ‘‘Kathañca, bhikkhave, puggalo nevattahitāya paṭipanno hoti no parahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā appaṭivirato hoti, no paraṃ pāṇātipātā veramaṇiyā samādapeti…pe… attanā surāmerayamajjapamādaṭṭhānā appaṭivirato hoti, no paraṃ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya. ‘‘Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti…pe… attanā ca surāmerayamajjapamādaṭṭhānā paṭivirato hoti, parañca surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ.",
      "english": "Monks, these four types of individuals exist and are found in the world. Which four?\n\nOne who practices for their own welfare, but not for the welfare of others; one who practices for the welfare of others, but not for their own welfare; one who practices neither for their own welfare nor for the welfare of others; and one who practices both for their own welfare and for the welfare of others.\n\nAnd how, monks, is an individual one who practices for their own welfare, but not for the welfare of others? Here, monks, a certain individual personally abstains from the destruction of life, but does not encourage others to abstain from the destruction of life; they personally abstain from taking what is not given, but do not encourage others to abstain from taking what is not given; they personally abstain from sexual misconduct, but do not encourage others to abstain from sexual misconduct; they personally abstain from false speech, but do not encourage others to abstain from false speech; they personally abstain from intoxicating drinks and drugs that lead to heedlessness, but do not encourage others to abstain from intoxicating drinks and drugs that lead to heedlessness. In this way, monks, is an individual one who practices for their own welfare, but not for the welfare of others.\n\nAnd how, monks, is an individual one who practices for the welfare of others, but not for their own welfare? Here, monks, a certain individual personally does not abstain from the destruction of life, but encourages others to abstain from the destruction of life; they personally do not abstain from taking what is not given, but encourage others to abstain from taking what is not given; they personally do not abstain from sexual misconduct, but encourage others to abstain from sexual misconduct; they personally do not abstain from false speech, but encourage others to abstain from false speech; they personally do not abstain from intoxicating drinks and drugs that lead to heedlessness, but encourage others to abstain from intoxicating drinks and drugs that lead to heedlessness. In this way, monks, is an individual one who practices for the welfare of others, but not for their own welfare.\n\nAnd how, monks, is an individual one who practices neither for their own welfare nor for the welfare of others? Here, monks, a certain individual personally does not abstain from the destruction of life, and does not encourage others to abstain from the destruction of life; they personally do not abstain from taking what is not given, and do not encourage others to abstain from taking what is not given; they personally do not abstain from sexual misconduct, and do not encourage others to abstain from sexual misconduct; they personally do not abstain from false speech, and do not encourage others to abstain from false speech; they personally do not abstain from intoxicating drinks and drugs that lead to heedlessness, and do not encourage others to abstain from intoxicating drinks and drugs that lead to heedlessness. In this way, monks, is an individual one who practices neither for their own welfare nor for the welfare of others.\n\nAnd how, monks, is an individual one who practices both for their own welfare and for the welfare of others? Here, monks, a certain individual personally abstains from the destruction of life, and encourages others to abstain from the destruction of life; they personally abstain from taking what is not given, and encourage others to abstain from taking what is not given; they personally abstain from sexual misconduct, and encourage others to abstain from sexual misconduct; they personally abstain from false speech, and encourage others to abstain from false speech; they personally abstain from intoxicating drinks and drugs that lead to heedlessness, and encourage others to abstain from intoxicating drinks and drugs that lead to heedlessness. In this way, monks, is an individual one who practices both for their own welfare and for the welfare of others. These, monks, are the four types of individuals existing and found in the world.",
      "sinhala": "භික්ෂූනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි සිටිත්, විද්‍යමාන වෙත්. ඒ සතර දෙනා කවරහුද? තමන්ගේ යහපත පිණිස පිළිපදින්නා මිස, අනුන්ගේ යහපත පිණිස නොපිළිපදින්නා; අනුන්ගේ යහපත පිණිස පිළිපදින්නා මිස, තමන්ගේ යහපත පිණිස නොපිළිපදින්නා; තමන්ගේ යහපත පිණිසද නොපිළිපදින්නා, අනුන්ගේ යහපත පිණිසද නොපිළිපදින්නා; තමන්ගේ යහපත පිණිසද පිළිපදින්නා, අනුන්ගේ යහපත පිණිසද පිළිපදින්නා.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් තමන්ගේ යහපත පිණිස පිළිපදින්නේ, අනුන්ගේ යහපත පිණිස නොපිළිපදින්නේ? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තෙම තමා ප්‍රාණඝාතයෙන් වැළකී සිටියි, එහෙත් අනුන් ප්‍රාණඝාතයෙන් වළක්වා නොදමයි; තමා අදත්තාදානයෙන් වැළකී සිටියි, එහෙත් අනුන් අදත්තාදානයෙන් වළක්වා නොදමයි; තමා කාමයන්හි මිස්‍යාචාරයෙන් වැළකී සිටියි, එහෙත් අනුන් කාමයන්හි මිස්‍යාචාරයෙන් වළක්වා නොදමයි; තමා මුසාවාදයෙන් වැළකී සිටියි, එහෙත් අනුන් මුසාවාදයෙන් වළක්වා නොදමයි; තමා සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන් වැළකී සිටියි, එහෙත් අනුන් සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන් වළක්වා නොදමයි. භික්ෂූනි, මෙසේ පුද්ගලයෙක් තමන්ගේ යහපත පිණිස පිළිපදින්නේ, අනුන්ගේ යහපත පිණිස නොපිළිපදින්නේ වේ.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් අනුන්ගේ යහපත පිණිස පිළිපදින්නේ, තමන්ගේ යහපත පිණිස නොපිළිපදින්නේ? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තෙම තමා ප්‍රාණඝාතයෙන් නොවැළකී සිටියි, එහෙත් අනුන් ප්‍රාණඝාතයෙන් වළක්වා දමයි; තමා අදත්තාදානයෙන් නොවැළකී සිටියි, එහෙත් අනුන් අදත්තාදානයෙන් වළක්වා දමයි; තමා කාමයන්හි මිස්‍යාචාරයෙන් නොවැළකී සිටියි, එහෙත් අනුන් කාමයන්හි මිස්‍යාචාරයෙන් වළක්වා දමයි; තමා මුසාවාදයෙන් නොවැළකී සිටියි, එහෙත් අනුන් මුසාවාදයෙන් වළක්වා දමයි; තමා සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන් නොවැළකී සිටියි, එහෙත් අනුන් සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන් වළක්වා දමයි. භික්ෂූනි, මෙසේ පුද්ගලයෙක් අනුන්ගේ යහපත පිණිස පිළිපදින්නේ, තමන්ගේ යහපත පිණිස නොපිළිපදින්නේ වේ.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් තමන්ගේ යහපත පිණිසද නොපිළිපදින්නේ, අනුන්ගේ යහපත පිණිසද නොපිළිපදින්නේ? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තෙම තමා ප්‍රාණඝාතයෙන් නොවැළකී සිටියි, අනුන් ප්‍රාණඝාතයෙන් වළක්වාද නොදමයි; තමා අදත්තාදානයෙන් නොවැළකී සිටියි, අනුන් අදත්තාදානයෙන් වළක්වාද නොදමයි; තමා කාමයන්හි මිස්‍යාචාරයෙන් නොවැළකී සිටියි, අනුන් කාමයන්හි මිස්‍යාචාරයෙන් වළක්වාද නොදමයි; තමා මුසාවාදයෙන් නොවැළකී සිටියි, අනුන් මුසාවාදයෙන් වළක්වාද නොදමයි; තමා සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන් නොවැළකී සිටියි, අනුන් සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන් වළක්වාද නොදමයි. භික්ෂූනි, මෙසේ පුද්ගලයෙක් තමන්ගේ යහපත පිණිසද නොපිළිපදින්නේ, අනුන්ගේ යහපත පිණිසද නොපිළිපදින්නේ වේ.\n\nභික්ෂූනි, කෙසේද පුද්ගලයෙක් තමන්ගේ යහපත පිණිසද පිළිපදින්නේ, අනුන්ගේ යහපත පිණිසද පිළිපදින්නේ? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තෙම තමා ප්‍රාණඝාතයෙන්ද වැළකී සිටියි, අනුන්ද ප්‍රාණඝාතයෙන් වළක්වාද දමයි; තමා අදත්තාදානයෙන්ද වැළකී සිටියි, අනුන්ද අදත්තාදානයෙන් වළක්වාද දමයි; තමා කාමයන්හි මිස්‍යාචාරයෙන්ද වැළකී සිටියි, අනුන්ද කාමයන්හි මිස්‍යාචාරයෙන් වළක්වාද දමයි; තමා මුසාවාදයෙන්ද වැළකී සිටියි, අනුන්ද මුසාවාදයෙන් වළක්වාද දමයි; තමා සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන්ද වැළකී සිටියි, අනුන්ද සුරා-මේරය මත්පැන් පානයෙන් හටගන්නා ප්‍රමාදයට හේතුවන කාරණයෙන් වළක්වාද දමයි. භික්ෂූනි, මෙසේ පුද්ගලයෙක් තමන්ගේ යහපත පිණිසද පිළිපදින්නේ, අනුන්ගේ යහපත පිණිසද පිළිපදින්නේ වේ.\n\nභික්ෂූනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි සිටිත්, විද්‍යමාන වෙත්.",
      "paliTitle": "Sikkhāpadasuttaṃ",
      "englishTitle": "The Discourse on Training Rules",
      "sinhalaTitle": "සික්ඛාපද සූත්‍‌රය"
    },
    {
      "number": 100,
      "pali": "Atha kho potaliyo paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho potaliyaṃ paribbājakaṃ bhagavā etadavoca – ‘‘Cattārome, potaliya, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, potaliya, ekacco puggalo [pu. pa. 165] avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Ime kho, potaliya, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ kho, potaliya, catunnaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti? ‘‘Cattārome, bho gotama, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bho gotama, ekacco puggalo avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Ime kho, bho gotama, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, bho gotama, catunnaṃ puggalānaṃ yvāyaṃ puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena; ayaṃ me puggalo khamati imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā [abhikkantatarā (ka.)] hesā, bho gotama, yadidaṃ upekkhā’’ti. ‘‘Cattārome, potaliya, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro…pe… ime kho, potaliya, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ kho, potaliya, catunnaṃ puggalānaṃ yvāyaṃ puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena; ayaṃ imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā hesā, potaliya, yadidaṃ tattha tattha kālaññutā’’ti. ‘‘Cattārome, bho gotama, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro…pe… ime kho, bho gotama, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, bho gotama, catunnaṃ puggalānaṃ yvāyaṃ puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā bhūtaṃ tacchaṃ kālena; ayaṃ me puggalo khamati imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā hesā, bho gotama, yadidaṃ tattha tattha kālaññutā. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti, evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ. ",
      "english": "Then the wanderer Potaliya approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the courteous and memorable talk, he sat down to one side. As the wanderer Potaliya sat to one side, the Blessed One said this to him: “Potaliya, there are these four types of individuals existing and found in the world. Which four? Here, Potaliya, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, but does not speak praise of one who deserves praise, truly, factually, and at the opportune time. Then again, Potaliya, one individual speaks praise of one who deserves praise, truly, factually, and at the opportune time, but does not speak dispraise of one who deserves dispraise, truly, factually, and at the opportune time. Then again, Potaliya, one individual neither speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, nor speaks praise of one who deserves praise, truly, factually, and at the opportune time. Then again, Potaliya, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, and also speaks praise of one who deserves praise, truly, factually, and at the opportune time. Potaliya, these are the four types of individuals existing and found in the world. Among these four types of individuals, which one do you find to be more excellent and more sublime?”\n\n“Revered Gotama, there are these four types of individuals existing and found in the world. Which four? Here, revered Gotama, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, but does not speak praise of one who deserves praise, truly, factually, and at the opportune time. Then again, revered Gotama, one individual speaks praise of one who deserves praise, truly, factually, and at the opportune time, but does not speak dispraise of one who deserves dispraise, truly, factually, and at the opportune time. Then again, revered Gotama, one individual neither speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, nor speaks praise of one who deserves praise, truly, factually, and at the opportune time. Then again, revered Gotama, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, and also speaks praise of one who deserves praise, truly, factually, and at the opportune time. Revered Gotama, these are the four types of individuals existing and found in the world. Among these four types of individuals, the one who neither speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, nor speaks praise of one who deserves praise, truly, factually, and at the opportune time—this individual is to me the most excellent and most sublime among these four types. And why is that? Because, revered Gotama, this quality of equanimity is indeed excellent.”\n\n“Potaliya, there are these four types of individuals existing and found in the world. Which four? Here, Potaliya, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, but does not speak praise of one who deserves praise, truly, factually, and at the opportune time. Then again, Potaliya, one individual speaks praise of one who deserves praise, truly, factually, and at the opportune time, but does not speak dispraise of one who deserves dispraise, truly, factually, and at the opportune time. Then again, Potaliya, one individual neither speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, nor speaks praise of one who deserves praise, truly, factually, and at the opportune time. Then again, Potaliya, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, and also speaks praise of one who deserves praise, truly, factually, and at the opportune time. Potaliya, these are the four types of individuals existing and found in the world. Among these four types of individuals, the one who speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, and also speaks praise of one who deserves praise, truly, factually, and at the opportune time—this individual is the most excellent and most sublime among these four types. And why is that? Because, Potaliya, this quality of knowing the opportune time in each specific instance is indeed excellent.”\n\n“Revered Gotama, there are these four types of individuals existing and found in the world. Which four? Here, revered Gotama, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, but does not speak praise of one who deserves praise, truly, factually, and at the opportune time. Then again, revered Gotama, one individual speaks praise of one who deserves praise, truly, factually, and at the opportune time, but does not speak dispraise of one who deserves dispraise, truly, factually, and at the opportune time. Then again, revered Gotama, one individual neither speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, nor speaks praise of one who deserves praise, truly, factually, and at the opportune time. Then again, revered Gotama, one individual speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, and also speaks praise of one who deserves praise, truly, factually, and at the opportune time. Revered Gotama, these are the four types of individuals existing and found in the world. Among these four types of individuals, the one who speaks dispraise of one who deserves dispraise, truly, factually, and at the opportune time, and also speaks praise of one who deserves praise, truly, factually, and at the opportune time—this individual is to me the most excellent and most sublime among these four types. And why is that? Because, revered Gotama, this quality of knowing the opportune time in each specific instance is indeed excellent.\n\nExcellent, revered Gotama, excellent, revered Gotama! Just as, revered Gotama, one might set upright what was overturned, reveal what was concealed, show the way to one who was lost, or carry an oil lamp in the darkness so that those with eyes might see forms, even so has the Dhamma been made clear by the revered Gotama in many ways. I go for refuge to the revered Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May the revered Gotama remember me as a lay follower who has gone for refuge from this day forth as long as life lasts.”",
      "sinhala": "අථ​ ඛො​ පොතලියො​ පරිබ්බාජකො​ යෙන​ භගවා​ තෙනුපසඞ්කමි; උපසඞ්කමිත්වා​ භගවතා​ සද්ධිං​ සම්මොදි. සම්මොදනීයං​ කථං​ සාරණීයං​ වීතිසාරෙත්වා​ එකමන්තං​ නිසීදි. එකමන්තං​ නිසින්නං​ ඛො​ පොතලියං​ පරිබ්බාජකං​ භගවා​ එතදවොච – ‘‘චත්තාරොමෙ, පොතලිය, පුග්ගලා​ සන්තො​ සංවිජ්ජමානා​ ලොකස්මිං. කතමෙ​ චත්තාරො? ඉද, පොතලිය, එකච්චො​ පුග්ගලො​ [පු. ප. 165] අ​වණ්ණාරහස්ස​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, නො​ ච​ ඛො​ වණ්ණාරහස්ස​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉද​ පන, පොතලිය, එකච්චො​ පුග්ගලො​ වණ්ණාරහස්ස​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, නො​ ච​ ඛො​ අ​වණ්ණාරහස්ස​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉද​ පන, පොතලිය, එකච්චො​ පුග්ගලො​ නෙව​ අ​වණ්ණාරහස්ස​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, නො​ ච​ වණ්ණාරහස්ස​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉද​ පන, පොතලිය, එකච්චො​ පුග්ගලො​ අ​වණ්ණාරහස්ස​ ච​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, වණ්ණාරහස්ස​ ච​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉමෙ​ ඛො, පොතලිය, චත්තාරො​ පුග්ගලා​ සන්තො​ සංවිජ්ජමානා​ ලොකස්මිං. ඉමෙසං​ ඛො, පොතලිය, චතුන්නං​ පුග්ගලානං​ කතමො​ තෙ​ පුග්ගලො​ ඛමති​ අභික්කන්තතරො​ ච​ පණීතතරො​ චා’’ති?\n\nඑවිට පොතලිය පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු සාමිචි කතා පැවැත්වීය. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා කතා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි පොතලිය පරිබ්‍රාජකයාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “පොතලිය, මේ ලෝකයේ සතර දෙනෙක් සිටිති, පෙනී සිටිති. කවරහුද ඒ සතර දෙනා? පොතලිය, මෙහි ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියයි. එහෙත් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියන්නේ නැත. පොතලිය, මෙහි තවත් ඇතැම් පුද්ගලයෙක් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියයි. එහෙත් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියන්නේ නැත. පොතලිය, මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් නොකියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් නොකියයි. පොතලිය, මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් කියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් කියයි. පොතලිය, මේ සතර දෙනා මේ ලෝකයේ සිටිති, පෙනී සිටිති. පොතලිය, මේ සතර දෙනාගෙන් කුමන පුද්ගලයා ඔබට වඩාත් ප්‍රිය වන්නේද, වඩාත් ශ්‍රේෂ්ඨ වන්නේද, වඩාත් ප්‍රණීත වන්නේද?”\n\n‘‘චත්තාරොමෙ, භො​ ගොතම, පුග්ගලා​ සන්තො​ සංවිජ්ජමානා​ ලොකස්මිං. කතමෙ​ චත්තාරො? ඉද, භො​ ගොතම, එකච්චො​ පුග්ගලො​ අ​වණ්ණාරහස්ස​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, නො​ ච​ ඛො​ වණ්ණාරහස්ස​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉද​ පන, භො​ ගොතම, එකච්චො​ පුග්ගලො​ වණ්ණාරහස්ස​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, නො​ ච​ ඛො​ අ​වණ්ණාරහස්ස​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉද​ පන, භො​ ගොතම, එකච්චො​ පුග්ගලො​ නෙව​ අ​වණ්ණාරහස්ස​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, නො​ ච​ වණ්ණාරහස්ස​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉද​ පන, භො​ ගොතම, එකච්චො​ පුග්ගලො​ අ​වණ්ණාරහස්ස​ ච​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, වණ්ණාරහස්ස​ ච​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉමෙ​ ඛො, භො​ ගොතම, චත්තාරො​ පුග්ගලා​ සන්තො​ සංවිජ්ජමානා​ ලොකස්මිං. ඉමෙසං, භො​ ගොතම, චතුන්නං​ පුග්ගලානං​ ය්වායං​ පුග්ගලො​ නෙව​ අ​වණ්ණාරහස්ස​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, නො​ ච​ වණ්ණාරහස්ස​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන; අයං​ මෙ​ පුග්ගලො​ ඛමති​ ඉමෙසං​ චතුන්නං​ පුග්ගලානං​ අභික්කන්තතරො​ ච​ පණීතතරො​ ච. තං​ කිස්ස​ හෙතු? අභික්කන්තා​ [අභික්කන්තතරා​ (ක.)] හෙසා, භො​ ගොතම, යදිදං​ උපෙක්ඛා’’ති.\n\n“භවත් ගෞතමයින් වහන්ස, මේ ලෝකයේ සතර දෙනෙක් සිටිති, පෙනී සිටිති. කවරහුද ඒ සතර දෙනා? භවත් ගෞතමයින් වහන්ස, මෙහි ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියයි. එහෙත් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියන්නේ නැත. භවත් ගෞතමයින් වහන්ස, මෙහි තවත් ඇතැම් පුද්ගලයෙක් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියයි. එහෙත් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියන්නේ නැත. භවත් ගෞතමයින් වහන්ස, මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් නොකියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් නොකියයි. භවත් ගෞතමයින් වහන්ස, මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් කියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් කියයි. භවත් ගෞතමයින් වහන්ස, මේ සතර දෙනා මේ ලෝකයේ සිටිති, පෙනී සිටිති. භවත් ගෞතමයින් වහන්ස, මේ සතර දෙනාගෙන් යම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් නොකියයි, ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් නොකියයි නම්, ඒ පුද්ගලයා මේ සතර දෙනාගෙන් මට වඩාත් ප්‍රිය වන්නේය, වඩාත් ශ්‍රේෂ්ඨ වන්නේය, වඩාත් ප්‍රණීත වන්නේය. ඊට හේතුව කුමක්ද? භවත් ගෞතමයින් වහන්ස, මේ උපේක්ෂාව ඉතා ශ්‍රේෂ්ඨ දෙයකි.”\n\n‘‘චත්තාරොමෙ, පොතලිය, පුග්ගලා​ සන්තො​ සංවිජ්ජමානා​ ලොකස්මිං. කතමෙ​ චත්තාරො… අ​වණ්ණාරහස්ස​ ච​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, වණ්ණාරහස්ස​ ච​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන. ඉමෙ​ ඛො, පොතලිය, චත්තාරො​ පුග්ගලා​ සන්තො​ සංවිජ්ජමානා​ ලොකස්මිං. ඉමෙසං​ ඛො, පොතලිය, චතුන්නං​ පුග්ගලානං​ ය්වායං​ පුග්ගලො​ අ​වණ්ණාරහස්ස​ ච​ අ​වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන, වණ්ණාරහස්ස​ ච​ වණ්ණං​ භාසිතා​ හොති​ භූතං​ තච්ඡං​ කාලෙන; අයං​ ඉමෙසං​ චතුන්නං​ පුග්ගලානං​ අභික්කන්තතරො​ ච​ පණීතතරො​ ච. තං​ කිස්ස​ හෙතු? අභික්කන්තා​ හෙසා, පොතලිය, යදිදං​ තත්ථ​ තත්ථ​ කාලඤ්ඤුතා’’ති.\n\n“පොතලිය, මේ ලෝකයේ සතර දෙනෙක් සිටිති, පෙනී සිටිති. කවරහුද ඒ සතර දෙනා? මෙහි ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියයි. එහෙත් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියන්නේ නැත. මෙහි තවත් ඇතැම් පුද්ගලයෙක් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියයි. එහෙත් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියන්නේ නැත. මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් නොකියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් නොකියයි. මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් කියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් කියයි. පොතලිය, මේ සතර දෙනා මේ ලෝකයේ සිටිති, පෙනී සිටිති. පොතලිය, මේ සතර දෙනාගෙන් යම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් කියයි, ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් කියයි නම්, මේ පුද්ගලයා මේ සතර දෙනාගෙන් වඩාත් ශ්‍රේෂ්ඨ වන්නේය, වඩාත් ප්‍රණීත වන්නේය. ඊට හේතුව කුමක්ද? පොතලිය, එතැන එතැන කල් දැනගැනීම (කාලඥතාව) ඉතා ශ්‍රේෂ්ඨ දෙයකි.”\n\n‘‘චත්තාරොමෙ, භො​ ගොතම, පුග්ගලා​ සන්තො​ සංවිජ්ජමානා​ ලොකස්මිං. කතමෙ​ චත්තාරො… අ​වණ්ණාරහස්ස​ ච​ අ​වණ්ණං​ භාසිතා​ භූතං​ තච්ඡං​ කාලෙන, වණ්ණාරහස්ස​ ච​ වණ්ණං​ භාසිතා​ භූතං​ තච්ඡං​ කාලෙන; අයං​ මෙ​ පුග්ගලො​ ඛමති​ ඉමෙසං​ චතුන්නං​ පුග්ගලානං​ අභික්කන්තතරො​ ච​ පණීතතරො​ ච. තං​ කිස්ස​ හෙතු? අභික්කන්තා​ හෙසා, භො​ ගොතම, යදිදං​ තත්ථ​ තත්ථ​ කාලඤ්ඤුතා.\n\n“භවත් ගෞතමයින් වහන්ස, මේ ලෝකයේ සතර දෙනෙක් සිටිති, පෙනී සිටිති. කවරහුද ඒ සතර දෙනා? මෙහි ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියයි. එහෙත් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියන්නේ නැත. මෙහි තවත් ඇතැම් පුද්ගලයෙක් ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාව කියයි. එහෙත් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාව කියන්නේ නැත. මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් නොකියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් නොකියයි. මෙහි තවත් ඇතැම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් කියයි. ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් කියයි. භවත් ගෞතමයින් වහන්ස, මේ සතර දෙනා මේ ලෝකයේ සිටිති, පෙනී සිටිති. භවත් ගෞතමයින් වහන්ස, මේ සතර දෙනාගෙන් යම් පුද්ගලයෙක් අප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි අප්‍රශංසාවත් කියයි, ප්‍රශංසනීය පුද්ගලයකුට නියම වශයෙන්, සත්‍ය වශයෙන්, සුදුසු කල්හි ප්‍රශංසාවත් කියයි නම්, ඒ පුද්ගලයා මේ සතර දෙනාගෙන් මට වඩාත් ප්‍රිය වන්නේය, වඩාත් ශ්‍රේෂ්ඨ වන්නේය, වඩාත් ප්‍රණීත වන්නේය. ඊට හේතුව කුමක්ද? භවත් ගෞතමයින් වහන්ස, එතැන එතැන කල් දැනගැනීම (කාලඥතාව) ඉතා ශ්‍රේෂ්ඨ දෙයකි.”\n\n‘‘අභික්කන්තං, භො​ ගොතම, අභික්කන්තං, භො​ ගොතම! සෙය්‍යථාපි, භො​ ගොතම, නික්කුජ්ජිතං​ වා​ උක්කුජ්ජෙය්‍ය, පටිච්ඡන්නං​ වා​ විවරෙය්‍ය, මූළ්හස්ස​ වා​ මග්ගං​ ආචික්ඛෙය්‍ය, අන්ධකාරෙ​ වා​ තෙලපජ්ජොතං​ ධාරෙය්‍ය​ – චක්ඛුමන්තො​ රූපානි​ දක්ඛන්තීති, එවමෙවං​ භොතා​ ගොතමෙන​ අනෙකපරියායෙන​ ධම්මො​ පකාසිතො. එසාහං​ භවන්තං​ ගොතමං​ සරණං​ ගච්ඡාමි​ ධම්මඤ්ච​ භික්ඛුසඞ්ඝඤ්ච. උපාසකං​ මං​ භවං​ ගොතමො​ ධාරෙතු​ අජ්ජතග්ගෙ​ පාණුපෙතං​ සරණං​ ගතා’’න්ති. දසමං.\n\n“භවත් ගෞතමයින් වහන්ස, ඉතා ශ්‍රේෂ්ඨයි, භවත් ගෞතමයින් වහන්ස, ඉතා ශ්‍රේෂ්ඨයි! භවත් ගෞතමයින් වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා ඇති දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මග පෙන්වන්නේද, අඳුරේ තෙල් පහනක් දල්වන්නේද – ඇස් ඇති අය රූප දකින්නාක් මෙන් – එපරිද්දෙන්ම භවත් ගෞතමයින් වහන්සේ විසින් නොයෙකුත් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. මම භවත් ගෞතමයින් වහන්සේද, ධර්මයද, භික්ෂුසංඝයාද සරණ යමි. භවත් ගෞතමයින් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Potaliyasuttaṃ",
      "englishTitle": "Potaliya Sutta",
      "sinhalaTitle": "පෝතලිය සූත්‍රය"
    },
    {
      "number": 3,
      "pali": "Tatiyapaṇṇāsakaṃ",
      "english": "The Third Fifty",
      "sinhala": "තෙවැනි පණ්ණාසකය",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Asuravaggo pañcamo. Tassuddānaṃ – Asuro tayo samādhī, chavālātena pañcamaṃ; Rāgo nisanti attahitaṃ, sikkhā potaliyena cāti. Dutiyapaṇṇāsakaṃ samattaṃ.",
    "english": "The Fifth Asura Section",
    "sinhala": "පස්වන අසුර වග්ගය"
  }
}