{
  "id": "an4.7",
  "title": {
    "pali": "Pattakammavaggo",
    "english": "The Chapter on Accomplished Deeds",
    "sinhala": "පුණ්‍යකර්ම වග්ගය"
  },
  "sections": [
    {
      "number": 61,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Cattārome, gahapati, dhammā iṭṭhā kantā manāpā dullabhā lokasmiṃ. Katame cattāro? Bhogā me uppajjantu sahadhammenāti, ayaṃ paṭhamo dhammo iṭṭho kanto manāpo dullabho lokasmiṃ. ‘‘Bhoge laddhā sahadhammena yaso me āgacchatu saha ñātīhi saha upajjhāyehīti, ayaṃ dutiyo dhammo iṭṭho kanto manāpo dullabho lokasmiṃ. ‘‘Bhoge laddhā sahadhammena yasaṃ laddhā saha ñātīhi saha upajjhāyehi ciraṃ jīvāmi dīghamāyuṃ pālemīti, ayaṃ tatiyo dhammo iṭṭho kanto manāpo dullabho lokasmiṃ. ‘‘Bhoge laddhā sahadhammena yasaṃ laddhā saha ñātīhi saha upajjhāyehi ciraṃ jīvitvā dīghamāyuṃ pāletvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjāmīti, ayaṃ catuttho dhammo iṭṭho kanto manāpo dullabho lokasmiṃ. Ime kho, gahapati, cattāro dhammā iṭṭhā kantā manāpā dullabhā lokasmiṃ. ‘‘Imesaṃ kho, gahapati, catunnaṃ dhammānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ cattāro dhammā paṭilābhāya saṃvattanti. Katame cattāro? Saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā. ‘‘Katamā ca, gahapati, saddhāsampadā? Idha, gahapati, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi, satthā devamanussānaṃ buddho bhagavā’ti. Ayaṃ vuccati, gahapati, saddhāsampadā. ‘‘Katamā ca, gahapati, sīlasampadā? Idha, gahapati, ariyasāvako pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṃ vuccati, gahapati, sīlasampadā. ‘‘Katamā ca, gahapati, cāgasampadā? Idha, gahapati, ariyasāvako vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vosaggarato yācayogo dānasaṃvibhāgarato. Ayaṃ vuccati, gahapati, cāgasampadā. ‘‘Katamā ca, gahapati, paññāsampadā? Abhijjhāvisamalobhābhibhūtena, gahapati, cetasā viharanto akiccaṃ karoti, kiccaṃ aparādheti. Akiccaṃ karonto kiccaṃ aparādhento yasā ca sukhā ca dhaṃsati. Byāpādābhibhūtena, gahapati, cetasā viharanto akiccaṃ karoti, kiccaṃ aparādheti. Akiccaṃ karonto kiccaṃ aparādhento yasā ca sukhā ca dhaṃsati. Thinamiddhābhibhūtena, gahapati, cetasā viharanto akiccaṃ karoti kiccaṃ aparādheti. Akiccaṃ karonto kiccaṃ aparādhento yasā ca sukhā ca dhaṃsati. Uddhaccakukkuccābhibhūtena, gahapati, cetasā viharanto akiccaṃ karoti, kiccaṃ aparādheti. Akiccaṃ karonto kiccaṃ aparādhento yasā ca sukhā ca dhaṃsati. Vicikicchābhibhūtena, gahapati, cetasā viharanto akiccaṃ karoti, kiccaṃ aparādheti. Akiccaṃ karonto kiccaṃ aparādhento yasā ca sukhā ca dhaṃsati. ‘‘Sa kho so, gahapati, ariyasāvako abhijjhāvisamalobho cittassa upakkilesoti, iti viditvā abhijjhāvisamalobhaṃ cittassa upakkilesaṃ pajahati. Byāpādo cittassa upakkilesoti, iti viditvā byāpādaṃ cittassa upakkilesaṃ pajahati. Thinamiddhaṃ cittassa upakkilesoti, iti viditvā thinamiddhaṃ cittassa upakkilesaṃ pajahati. Uddhaccakukkuccaṃ cittassa upakkilesoti, iti viditvā uddhaccakukkuccaṃ cittassa upakkilesaṃ pajahati. Vicikicchā cittassa upakkilesoti, iti viditvā vicikicchaṃ cittassa upakkilesaṃ pajahati. ‘‘Yato ca kho, gahapati, ariyasāvakassa abhijjhāvisamalobho cittassa upakkilesoti, iti viditvā abhijjhāvisamalobho cittassa upakkileso pahīno hoti. Byāpādo cittassa upakkilesoti, iti viditvā byāpādo cittassa upakkileso pahīno hoti. Thinamiddhaṃ cittassa upakkilesoti, iti viditvā thinamiddhaṃ cittassa upakkileso pahīno hoti. Uddhaccakukkuccaṃ cittassa upakkilesoti, iti viditvā uddhaccakukkuccaṃ cittassa upakkileso pahīno hoti. Vicikicchā cittassa upakkilesoti, iti viditvā vicikicchā cittassa upakkileso pahīno hoti. Ayaṃ vuccati, gahapati, ariyasāvako mahāpañño puthupañño āpātadaso [āpāthadaso (sī. syā. kaṃ. pī.)] paññāsampanno [hāsapañño (ka.)]. Ayaṃ vuccati, gahapati, paññāsampadā. Imesaṃ kho, gahapati, catunnaṃ dhammānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ ime cattāro dhammā paṭilābhāya saṃvattanti. ‘‘Sa kho so, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi cattāri pattakammāni kattā hoti. Katamāni cattāri? Idha gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi attānaṃ sukheti pīṇeti sammā sukhaṃ pariharati. Mātāpitaro sukheti pīṇeti sammā sukhaṃ pariharati. Puttadāradāsakammakaraporise sukheti pīṇeti sammā sukhaṃ pariharati. Mittāmacce sukheti pīṇeti sammā sukhaṃ pariharati. Idamassa paṭhamaṃ ṭhānagataṃ hoti pattagataṃ āyatanaso paribhuttaṃ. ‘‘Puna caparaṃ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi yā tā honti āpadā aggito vā udakato vā rājato vā corato vā appiyato vā dāyādato [a. ni. 5.41], tathārūpāsu āpadāsu pariyodhāya saṃvattati. Sotthiṃ attānaṃ karoti. Idamassa dutiyaṃ ṭhānagataṃ hoti pattagataṃ āyatanaso paribhuttaṃ. ‘‘Puna caparaṃ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi pañcabaliṃ kattā hoti – ñātibaliṃ, atithibaliṃ, pubbapetabaliṃ, rājabaliṃ, devatābaliṃ. Idamassa tatiyaṃ ṭhānagataṃ hoti pattagataṃ āyatanaso paribhuttaṃ. ‘‘Puna caparaṃ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi ye te samaṇabrāhmaṇā madappamādā paṭiviratā khantisoracce niviṭṭhā ekamattānaṃ damenti, ekamattānaṃ samenti, ekamattānaṃ parinibbāpenti, tathārūpesu samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpeti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Idamassa catutthaṃ ṭhānagataṃ hoti pattagataṃ āyatanaso paribhuttaṃ. ‘‘Sa kho so, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi imāni cattāri pattakammāni kattā hoti. Yassa kassaci, gahapati, aññatra imehi catūhi pattakammehi bhogā parikkhayaṃ gacchanti, ime vuccanti, gahapati, bhogā aṭṭhānagatā apattagatā anāyatanaso paribhuttā. Yassa kassaci, gahapati, imehi catūhi pattakammehi bhogā parikkhayaṃ gacchanti, ime vuccanti, gahapati, bhogā ṭhānagatā pattagatā āyatanaso paribhuttā’’ti. ‘‘Bhuttā bhogā bhatā bhaccā [gatā bhūtā (ka.) bhaṭā bhaccā (syā. kaṃ.)], vitiṇṇā āpadāsu me; Uddhaggā dakkhiṇā dinnā, atho pañcabalī katā; Upaṭṭhitā sīlavanto, saññatā brahmacārayo. ‘‘Yadatthaṃ bhogaṃ iccheyya, paṇḍito gharamāvasaṃ; So me attho anuppatto, kataṃ ananutāpiyaṃ. ‘‘Etaṃ [evaṃ (ka.)] anussaraṃ macco, ariyadhamme ṭhito naro; Idheva naṃ pasaṃsanti, pecca sagge pamodatī’’ti. paṭhamaṃ;",
      "english": "Then the householder Anāthapiṇḍika approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Blessed One said to the householder Anāthapiṇḍika: “Householder, there are these four things that are desirable, agreeable, pleasing, and difficult to obtain in the world. Which four? ‘May wealth arise for me in a righteous way’ – this is the first thing that is desirable, agreeable, pleasing, and difficult to obtain in the world. ‘Having obtained wealth in a righteous way, may renown come to me, together with my relatives and teachers’ – this is the second thing that is desirable, agreeable, pleasing, and difficult to obtain in the world. ‘Having obtained wealth in a righteous way and having obtained renown together with my relatives and teachers, may I live long, sustaining a lengthy lifespan’ – this is the third thing that is desirable, agreeable, pleasing, and difficult to obtain in the world. ‘Having obtained wealth in a righteous way and having obtained renown together with my relatives and teachers, having lived long and sustained a lengthy lifespan, upon the breaking up of the body, after death, may I reappear in a good destination, in the heavenly world’ – this is the fourth thing that is desirable, agreeable, pleasing, and difficult to obtain in the world. These, householder, are the four things that are desirable, agreeable, pleasing, and difficult to obtain in the world.\n\nFor the acquisition of these four things – which are desirable, agreeable, pleasing, and difficult to obtain in the world – there are four other things that lead to their attainment. Which four? Accomplishment in conviction, accomplishment in virtue, accomplishment in generosity, and accomplishment in wisdom.\n\nAnd what, householder, is accomplishment in conviction? Here, householder, a noble disciple is convinced, having conviction in the Tathāgata’s Awakening thus: ‘Indeed, the Blessed One is an Arahant, perfectly enlightened, endowed with knowledge and conduct, sublime, knower of the worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.’ This is called accomplishment in conviction.\n\nAnd what, householder, is accomplishment in virtue? Here, householder, a noble disciple abstains from taking life… and abstains from distilled and fermented intoxicants that are a basis for heedlessness. This is called accomplishment in virtue.\n\nAnd what, householder, is accomplishment in generosity? Here, householder, a noble disciple dwells at home with a mind devoid of the stain of stinginess, open-handed, pure in intention, delighting in relinquishing, responsive to requests, and delighting in the distribution of gifts. This is called accomplishment in generosity.\n\nAnd what, householder, is accomplishment in wisdom? Householder, one who dwells with a mind overcome by covetousness and unrighteous greed does what should not be done and neglects what should be done. Doing what should not be done and neglecting what should be done, one falls away from renown and happiness. Householder, one who dwells with a mind overcome by ill will does what should not be done and neglects what should be done. Doing what should not be done and neglecting what should be done, one falls away from renown and happiness. Householder, one who dwells with a mind overcome by sloth and torpor does what should not be done and neglects what should be done. Doing what should not be done and neglecting what should be done, one falls away from renown and happiness. Householder, one who dwells with a mind overcome by restlessness and remorse does what should not be done and neglects what should be done. Doing what should not be done and neglecting what should be done, one falls away from renown and happiness. Householder, one who dwells with a mind overcome by doubt does what should not be done and neglects what should be done. Doing what should not be done and neglecting what should be done, one falls away from renown and happiness.\n\nThat noble disciple, householder, knowing that covetousness and unrighteous greed are a defilement of the mind, abandons covetousness and unrighteous greed, that defilement of the mind. Knowing that ill will is a defilement of the mind, he abandons ill will, that defilement of the mind. Knowing that sloth and torpor are a defilement of the mind, he abandons sloth and torpor, that defilement of the mind. Knowing that restlessness and remorse are a defilement of the mind, he abandons restlessness and remorse, that defilement of the mind. Knowing that doubt is a defilement of the mind, he abandons doubt, that defilement of the mind.\n\nWhen, householder, a noble disciple, knowing that covetousness and unrighteous greed are a defilement of the mind, has abandoned covetousness and unrighteous greed, that defilement of the mind; knowing that ill will is a defilement of the mind, has abandoned ill will, that defilement of the mind; knowing that sloth and torpor are a defilement of the mind, has abandoned sloth and torpor, that defilement of the mind; knowing that restlessness and remorse are a defilement of the mind, has abandoned restlessness and remorse, that defilement of the mind; and knowing that doubt is a defilement of the mind, has abandoned doubt, that defilement of the mind—such a noble disciple, householder, is called greatly wise, widely wise, with insight that penetrates directly, accomplished in wisdom. This is called accomplishment in wisdom. For the acquisition of these four things – which are desirable, agreeable, pleasing, and difficult to obtain in the world – these four things lead to their attainment.\n\nIndeed, householder, that noble disciple, with wealth acquired through energetic striving, accumulated by the strength of his arms, earned with sweat, righteously gained, and obtained by righteous means, performs four worthy deeds. Which four?\n\nHere, householder, the noble disciple, with wealth acquired through energetic striving, accumulated by the strength of his arms, earned with sweat, righteously gained, and obtained by righteous means, makes himself happy and pleased, and maintains himself properly and comfortably. He makes his mother and father happy and pleased, and maintains them properly and comfortably. He makes his children, wife, servants, and workers happy and pleased, and maintains them properly and comfortably. He makes his friends and associates happy and pleased, and maintains them properly and comfortably. This is his first proper use of wealth, a worthy use, consumed in an appropriate manner.\n\nFurthermore, householder, the noble disciple, with wealth acquired through energetic striving, accumulated by the strength of his arms, earned with sweat, righteously gained, and obtained by righteous means, regarding any misfortunes that may arise from fire, or water, or rulers, or thieves, or unloved heirs, he protects himself from such misfortunes. He makes himself secure. This is his second proper use of wealth, a worthy use, consumed in an appropriate manner.\n\nFurthermore, householder, the noble disciple, with wealth acquired through energetic striving, accumulated by the strength of his arms, earned with sweat, righteously gained, and obtained by righteous means, performs the five offerings: offerings to relatives, offerings to guests, offerings to ancestors, offerings to the king, and offerings to deities. This is his third proper use of wealth, a worthy use, consumed in an appropriate manner.\n\nFurthermore, householder, the noble disciple, with wealth acquired through energetic striving, accumulated by the strength of his arms, earned with sweat, righteously gained, and obtained by righteous means, to those ascetics and brahmins who abstain from intoxication and heedlessness, who are established in patience and gentleness, who tame themselves, who calm themselves, who attain final nirvana for themselves—to such ascetics and brahmins he establishes an elevated offering, leading to heaven, with a pleasant result, conducive to heavenly rebirth. This is his fourth proper use of wealth, a worthy use, consumed in an appropriate manner.\n\nIndeed, householder, that noble disciple, with wealth acquired through energetic striving, accumulated by the strength of his arms, earned with sweat, righteously gained, and obtained by righteous means, performs these four worthy deeds. Householder, for whomever wealth perishes apart from these four worthy deeds, such wealth is said, householder, to be improperly placed, unworthily used, and consumed in an inappropriate manner. But for whomever wealth perishes through these four worthy deeds, such wealth is said, householder, to be properly placed, worthily used, and consumed in an appropriate manner.\n\nWealth has been enjoyed, dependents have been supported, and I have overcome misfortunes. Elevated offerings have been given, and the five offerings have been made. The virtuous, the self-controlled, and those leading the holy life have been attended to.\n\nThat for which a wise householder desires wealth, that purpose has been achieved by me, and what I have done will not bring regret.\n\nReflecting on this, a mortal, a person established in the Noble Dhamma, is praised right here in this world, and after passing away, rejoices in heaven.",
      "sinhala": "එවිට අනේපිඬු සිටුතුමා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි අනේපිඬු සිටුතුමාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"ගෘහපතිය, ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ මේ ධර්ම සතරක් වෙති. ඒ කවර සතරක්ද? 'මට ධර්මානුකූලව භෝග සම්පත් ඇතිවේවා!' යනු ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ පළමු වන ධර්මයයි. 'ධර්මානුකූලව භෝග සම්පත් ලබා, නෑදෑයන් සමඟත්, ගුරුවරුන් සමඟත් මට යසස ලැබේවා!' යනු ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ දෙවන ධර්මයයි. 'ධර්මානුකූලව භෝග සම්පත් ලබා, නෑදෑයන් සමඟත්, ගුරුවරුන් සමඟත් යසස ලබා, මම දිගු කලක් ජීවත් වෙම්වා, දීර්ඝ ආයුෂ රකිම්වා!' යනු ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ තුන්වන ධර්මයයි. 'ධර්මානුකූලව භෝග සම්පත් ලබා, නෑදෑයන් සමඟත්, ගුරුවරුන් සමඟත් යසස ලබා, දිගු කලක් ජීවත් වී, දීර්ඝ ආයුෂ රැක, කය බිඳී මරණයෙන් පසු සුගති ස්වර්ග ලෝකයට උපදිම්වා!' යනු ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ සතරවන ධර්මයයි. ගෘහපතිය, ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ මේ ධර්ම සතර නම් මේවාය.\n\nගෘහපතිය, ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ මේ සතර ධර්මයන් ලැබීම සඳහා හේතු වන ධර්ම සතරක් වෙති. ඒ කවර සතරක්ද? ඒවා නම් ශ්‍රද්ධා සම්පදාව, ශීල සම්පදාව, ත්‍යාග සම්පදාව සහ ප්‍රඥා සම්පදාව යි.\n\nගෘහපතිය, ශ්‍රද්ධා සම්පදාව යනු කවරේද? ගෘහපතිය, මෙහිලා ආර්ය ශ්‍රාවකයා ශ්‍රද්ධාවෙන් යුක්ත වේ. හෙතෙම තථාගතයන් වහන්සේගේ බෝධිය මෙසේ අදහා ගනියි: 'ඒ භාග්‍යවතුන් වහන්සේ කෙලෙසුන් කෙරෙන් දුරු වූ, සම්‍යක් සම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලෝකය දන්නා වූ, අනුත්තර වූ දමනය කළ යුතු පුරුෂයන් දමනය කරන්නා වූ, දෙවි මිනිසුන්ට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ නමකි' යනු යි. ගෘහපතිය, මෙය ශ්‍රද්ධා සම්පදාව යැයි කියනු ලැබේ.\n\nගෘහපතිය, ශීල සම්පදාව යනු කවරේද? ගෘහපතිය, මෙහිලා ආර්ය ශ්‍රාවකයා පණ නැසීමෙන් වැළකුණේ වේ... සුරාමේරය මද්‍යපානයෙන් හා ප්‍රමාදයට හේතු වන සියලු කරුණුවලින් වැළකුණේ වේ. ගෘහපතිය, මෙය ශීල සම්පදාව යැයි කියනු ලැබේ.\n\nගෘහපතිය, ත්‍යාග සම්පදාව යනු කවරේද? ගෘහපතිය, මෙහිලා ආර්ය ශ්‍රාවකයා පහ වූ මසුරුමල සහිත සිතකින් ගෘහ ජීවිතය ගත කරයි. හෙතෙම මුදා හරින ලද ත්‍යාගයෙන්, පිරිසුදු අත් ඇතිව, කැප කිරීමෙහි ඇලුනේ, ඉල්ලීම්වලට සුදුසු වූ, දන් බෙදා දීමෙහි ඇලුනේ වේ. ගෘහපතිය, මෙය ත්‍යාග සම්පදාව යැයි කියනු ලැබේ.\n\nගෘහපතිය, ප්‍රඥා සම්පදාව යනු කවරේද? ගෘහපතිය, අභිධ්‍යා-විෂම-ලෝභයෙන් (නොමනා ලෝභයෙන්) යටපත් වූ සිතකින් වසන තැනැත්තා නොකළ යුතු දේ කරයි, කළ යුතු දේ මඟහරියි. නොකළ යුතු දේ කරමින්, කළ යුතු දේ මඟහරිමින්, හෙතෙම යසසින් සහ සැපයෙන් පිරිහී යයි. ව්‍යාපාදයෙන් (ක්‍රෝධයෙන්) යටපත් වූ සිතකින් වසන තැනැත්තා නොකළ යුතු දේ කරයි, කළ යුතු දේ මඟහරියි. නොකළ යුතු දේ කරමින්, කළ යුතු දේ මඟහරිමින්, හෙතෙම යසසින් සහ සැපයෙන් පිරිහී යයි. ථීනමිද්ධයෙන් (අලස බව හා නිදිමතෙන්) යටපත් වූ සිතකින් වසන තැනැත්තා නොකළ යුතු දේ කරයි, කළ යුතු දේ මඟහරියි. නොකළ යුතු දේ කරමින්, කළ යුතු දේ මඟහරිමින්, හෙතෙම යසසින් සහ සැපයෙන් පිරිහී යයි. උද්ධච්ච-කුක්කුච්චයෙන් (උද්දච්ච බව හා පසුතැවිල්ලෙන්) යටපත් වූ සිතකින් වසන තැනැත්තා නොකළ යුතු දේ කරයි, කළ යුතු දේ මඟහරියි. නොකළ යුතු දේ කරමින්, කළ යුතු දේ මඟහරිමින්, හෙතෙම යසසින් සහ සැපයෙන් පිරිහී යයි. විචිකිච්ඡාවෙන් (සැකයෙන්) යටපත් වූ සිතකින් වසන තැනැත්තා නොකළ යුතු දේ කරයි, කළ යුතු දේ මඟහරියි. නොකළ යුතු දේ කරමින්, කළ යුතු දේ මඟහරිමින්, හෙතෙම යසසින් සහ සැපයෙන් පිරිහී යයි.\n\nගෘහපතිය, ඒ ආර්ය ශ්‍රාවකයා අභිධ්‍යා-විෂම-ලෝභය සිතේ කෙලෙසක් බව මෙසේ දැන, අභිධ්‍යා-විෂම-ලෝභය නම් සිතේ කෙලෙස දුරු කරයි. ව්‍යාපාදය සිතේ කෙලෙසක් බව මෙසේ දැන, ව්‍යාපාදය නම් සිතේ කෙලෙස දුරු කරයි. ථීනමිද්ධය සිතේ කෙලෙසක් බව මෙසේ දැන, ථීනමිද්ධය නම් සිතේ කෙලෙස දුරු කරයි. උද්ධච්ච-කුක්කුච්චය සිතේ කෙලෙසක් බව මෙසේ දැන, උද්ධච්ච-කුක්කුච්චය නම් සිතේ කෙලෙස දුරු කරයි. විචිකිච්ඡාව සිතේ කෙලෙසක් බව මෙසේ දැන, විචිකිච්ඡාව නම් සිතේ කෙලෙස දුරු කරයි.\n\nගෘහපතිය, යම් හෙයකින් ආර්ය ශ්‍රාවකයාට අභිධ්‍යා-විෂම-ලෝභය සිතේ කෙලෙසක් බව මෙසේ දැන, අභිධ්‍යා-විෂම-ලෝභය නම් සිතේ කෙලෙස ප්‍රහීණ වන්නේද; ව්‍යාපාදය සිතේ කෙලෙසක් බව මෙසේ දැන, ව්‍යාපාදය නම් සිතේ කෙලෙස ප්‍රහීණ වන්නේද; ථීනමිද්ධය සිතේ කෙලෙසක් බව මෙසේ දැන, ථීනමිද්ධය නම් සිතේ කෙලෙස ප්‍රහීණ වන්නේද; උද්ධච්ච-කුක්කුච්චය සිතේ කෙලෙසක් බව මෙසේ දැන, උද්ධච්ච-කුක්කුච්චය නම් සිතේ කෙලෙස ප්‍රහීණ වන්නේද; විචිකිච්ඡාව සිතේ කෙලෙසක් බව මෙසේ දැන, විචිකිච්ඡාව නම් සිතේ කෙලෙස ප්‍රහීණ වන්නේද; ගෘහපතිය, මේ ආර්ය ශ්‍රාවකයා මහා ප්‍රඥා ඇත්තෙක්, පුළුල් නුවණැත්තෙක්, ක්ෂණිකව දැකීමේ නුවණ ඇත්තෙක්, ප්‍රඥා සම්පන්නයෙක් යැයි කියනු ලැබේ. ගෘහපතිය, මෙය ප්‍රඥා සම්පදාව යැයි කියනු ලැබේ. ගෘහපතිය, ලෝකයෙහි කැමති වූ, ප්‍රිය වූ, මනාප වූ, දුර්ලභ වූ මේ සතර ධර්මයන් ලැබීම සඳහා හේතු වන ධර්ම සතර නම් මේවාය.\n\nගෘහපතිය, ඒ ආර්‍ය්‍ය ශ්‍රාවකයා උත්සාහය හා වීර්‍ය්‍යයෙන් උපයාගත්, තම බාහු බලයෙන් හා දහදිය හෙලීමෙන් උපයාගත්, ධර්මානුකූලව ලද භෝග සම්පත් වලින් සිව් වැදෑරුම් ප්‍රයෝජනදායක ක්‍රියා සිදු කරන්නෙක් වේ. ඒ සිව් වැදෑරුම් ක්‍රියා මොනවාද?\nගෘහපතිය, මෙහිලා ආර්‍ය්‍ය ශ්‍රාවකයා උත්සාහය හා වීර්‍ය්‍යයෙන් උපයාගත්, තම බාහු බලයෙන් හා දහදිය හෙලීමෙන් උපයාගත්, ධර්මානුකූලව ලද භෝග සම්පත් වලින් තමන්වම සුවපත් කරයි, සතුටු කරයි, මනාකොට සුවසේ ජීවත් කරවයි. මවට හා පියාටද සුවපත් කරයි, සතුටු කරයි, මනාකොට සුවසේ ජීවත් කරවයි. දරුවන්ට, භාර්‍ය්‍යාවට, දාසයන්ට, කම්කරුවන්ට හා අනුගාමිකයන්ටද සුවපත් කරයි, සතුටු කරයි, මනාකොට සුවසේ ජීවත් කරවයි. මිත්‍රයන්ට හා අමාත්‍යයන්ටද සුවපත් කරයි, සතුටු කරයි, මනාකොට සුවසේ ජීවත් කරවයි. මෙය ඔහුගේ භෝග සම්පත් නිසි අයුරින් යොදාගත්, නිසි ප්‍රයෝජනයට පත්කළ, නිසි පරිදි පරිභෝග කරන ලද පළමු ක්‍රියාවයි.\n\nනැවතද ගෘහපතිය, ආර්‍ය්‍ය ශ්‍රාවකයා උත්සාහය හා වීර්‍ය්‍යයෙන් උපයාගත්, තම බාහු බලයෙන් හා දහදිය හෙලීමෙන් උපයාගත්, ධර්මානුකූලව ලද භෝග සම්පත් වලින්, යම් විපත් ගින්නෙන් හෝ, ජලයෙන් හෝ, රජුන්ගෙන් හෝ, සොරුන්ගෙන් හෝ, අප්‍රිය පුද්ගලයන්ගෙන් හෝ, දායාදයන්ගෙන් (අහිමිවීම්වලින්) හෝ ඇතිවේද, එවැනි විපත්ති අවස්ථාවලදී ඒවායින් ආරක්ෂා වීමට ක්‍රියා කරයි. තමාගේ ආරක්ෂාව සලසා ගනී. මෙය ඔහුගේ භෝග සම්පත් නිසි අයුරින් යොදාගත්, නිසි ප්‍රයෝජනයට පත්කළ, නිසි පරිදි පරිභෝග කරන ලද දෙවන ක්‍රියාවයි.\n\nනැවතද ගෘහපතිය, ආර්‍ය්‍ය ශ්‍රාවකයා උත්සාහය හා වීර්‍ය්‍යයෙන් උපයාගත්, තම බාහු බලයෙන් හා දහදිය හෙලීමෙන් උපයාගත්, ධර්මානුකූලව ලද භෝග සම්පත් වලින් පස් වැදෑරුම් බිලි පූජා (පරිත්‍යාග) සිදුකරන්නෙක් වේ. එනම්; ඥාතීන් උදෙසා දානය, ආගන්තුකයන් උදෙසා දානය, පෙර පරලොව ගිය ඥාතීන් උදෙසා පිදීම, රජයට බදු ගෙවීම සහ දෙවියන්ට පිදීමයි. මෙය ඔහුගේ භෝග සම්පත් නිසි අයුරින් යොදාගත්, නිසි ප්‍රයෝජනයට පත්කළ, නිසි පරිදි පරිභෝග කරන ලද තෙවන ක්‍රියාවයි.\n\nනැවතද ගෘහපතිය, ආර්‍ය්‍ය ශ්‍රාවකයා උත්සාහය හා වීර්‍ය්‍යයෙන් උපයාගත්, තම බාහු බලයෙන් හා දහදිය හෙලීමෙන් උපයාගත්, ධර්මානුකූලව ලද භෝග සම්පත් වලින්, යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ මදයෙන් හා ප්‍රමාදයෙන් වැළකී සිටිත්ද, ක්ෂාන්තියෙන් හා සෝරච්චයෙන් යුතුව පිහිටා සිටිත්ද, තමන්වම හික්මවද්ද, තමන්වම සංසිඳුවද්ද, තමන්වම සන්සුන් කරද්ද (කෙලෙස් ගිනි නිවාලද්ද), එවැනි ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි උසස් වූ දක්ෂිණාවක් පූජා කරයි. එය ස්වර්ගයට පමුණුවන, සුවදායක විපාක ඇති, ස්වර්ගය කරා ගෙන යන දානයකි. මෙය ඔහුගේ භෝග සම්පත් නිසි අයුරින් යොදාගත්, නිසි ප්‍රයෝජනයට පත්කළ, නිසි පරිදි පරිභෝග කරන ලද සිව්වන ක්‍රියාවයි.\n\nගෘහපතිය, ඒ ආර්‍ය්‍ය ශ්‍රාවකයා උත්සාහය හා වීර්‍ය්‍යයෙන් උපයාගත්, තම බාහු බලයෙන් හා දහදිය හෙලීමෙන් උපයාගත්, ධර්මානුකූලව ලද භෝග සම්පත් වලින් මේ සිව් වැදෑරුම් ප්‍රයෝජනදායක ක්‍රියා සිදු කරන්නෙක් වේ. ගෘහපතිය, යම් කෙනෙකුගේ භෝග සම්පත් මේ සිව් වැදෑරුම් ප්‍රයෝජනදායක ක්‍රියා හැර වෙනත් ආකාරයකින් ක්ෂය වී යයිද, ගෘහපතිය, ඒවා අනුචිත ස්ථානවලට යොදාගත්, ප්‍රයෝජනවත් නොවන, අනිසි පරිදි පරිභෝග කළ භෝග සම්පත් යැයි කියනු ලැබේ. ගෘහපතිය, යම් කෙනෙකුගේ භෝග සම්පත් මේ සිව් වැදෑරුම් ප්‍රයෝජනදායක ක්‍රියා මගින් ක්ෂය වී යයිද, ගෘහපතිය, ඒවා යෝග්‍ය ස්ථානවලට යොදාගත්, ප්‍රයෝජනවත් වූ, නිසි පරිදි පරිභෝග කළ භෝග සම්පත් යැයි කියනු ලැබේ.\n\nභෝග පරිභෝග කරන ලදී, යැපෙන්නන් නඩත්තු කරන ලදී. මාගේ විපත්ති දුරු කරන ලදී. උසස් දක්ෂිණා පූජා කරන ලදී, එසේම පස් වැදෑරුම් බිලි පූජාද සිදු කරන ලදී. සිල්වත් වූ, සංවර වූ, බ්‍රහ්මචාරීන්ට උපස්ථාන කරන ලදී.\n\nගෘහ ජීවිතය ගත කරන පණ්ඩිතයෙක් භෝග සම්පත් යම් අර්ථයක් පිණිස පතන්නේද, ඒ අර්ථය මට ලැබී ඇත. කිසිදු පසුතැවීමක් නැති ක්‍රියාවක් මා විසින් සිදු කරන ලදී.\n\nආර්‍ය්‍ය ධර්මයෙහි පිහිටි ඒ මනුෂ්‍යයා මෙය සිහිපත් කරමින්, මෙලොවදීම ඔහුව ප්‍රශංසා කරති. පරලොවදී ස්වර්ගයෙහි සතුටු වේ.",
      "paliTitle": "Pattakammasuttaṃ"
    },
    {
      "number": 62,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Cattārimāni, gahapati, sukhāni adhigamanīyāni gihinā kāmabhoginā kālena kālaṃ samayena samayaṃ upādāya. Katamāni cattāri? Atthisukhaṃ, bhogasukhaṃ, ānaṇyasukhaṃ [aṇaṇasukhaṃ (sī. syā. kaṃ. pī.)], anavajjasukhaṃ. ‘‘Katamañca, gahapati, atthisukhaṃ? Idha, gahapati, kulaputtassa bhogā honti uṭṭhānavīriyādhigatā bāhābalaparicitā sedāvakkhittā dhammikā dhammaladdhā. So ‘bhogā me atthi uṭṭhānavīriyādhigatā bāhābalaparicitā sedāvakkhittā dhammikā dhammaladdhā’ti adhigacchati sukhaṃ, adhigacchati somanassaṃ. Idaṃ vuccati, gahapati, atthisukhaṃ. ‘‘Katamañca, gahapati, bhogasukhaṃ? Idha, gahapati, kulaputto uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi paribhuñjati puññāni ca karoti. So ‘uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi paribhuñjāmi puññāni ca karomī’ti adhigacchati sukhaṃ, adhigacchati somanassaṃ. Idaṃ vuccati, gahapati, bhogasukhaṃ. ‘‘Katamañca, gahapati, ānaṇyasukhaṃ? Idha, gahapati, kulaputto na kassaci kiñci dhāreti appaṃ vā bahuṃ vā. So ‘na kassaci kiñci dhāremi [kiñci vā deti (ka.)] appaṃ vā bahuṃ vā’ti adhigacchati sukhaṃ, adhigacchati somanassaṃ. Idaṃ vuccati, gahapati, ānaṇyasukhaṃ. ‘‘Katamañca, gahapati, anavajjasukhaṃ? Idha, gahapati, ariyasāvako anavajjena kāyakammena samannāgato hoti, anavajjena vacīkammena samannāgato hoti, anavajjena manokammena samannāgato hoti. So ‘anavajjenamhi kāyakammena samannāgato, anavajjena vacīkammena samannāgato, anavajjena manokammena samannāgato’ti adhigacchati sukhaṃ, adhigacchati somanassaṃ. Idaṃ vuccati, gahapati, anavajjasukhaṃ. Imāni kho, gahapati, cattāri sukhāni adhigamanīyāni gihinā kāmabhoginā kālena kālaṃ samayena samayaṃ upādāyā’’ti. ‘‘Ānaṇyasukhaṃ ñatvāna, atho atthisukhaṃ paraṃ; Bhuñjaṃ bhogasukhaṃ macco, tato paññā vipassati. ‘‘Vipassamāno jānāti, ubho bhoge sumedhaso; Anavajjasukhassetaṃ, kalaṃ nāgghati soḷasi’’nti. dutiyaṃ;",
      "english": "Then indeed, the householder Anāthapiṇḍika approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. To the householder Anāthapiṇḍika, as he sat to one side, the Blessed One spoke this:\n\n“Householder, there are these four kinds of happiness to be realized by a householder who enjoys sense pleasures, from time to time. Which four? The happiness of possession, the happiness of enjoyment, the happiness of being debt-free, and the happiness of blamelessness.\n\n“And what, householder, is the happiness of possession? Here, householder, a son of good family has wealth acquired through energetic effort, amassed through the strength of his arms, stained by his sweat, righteous and obtained by righteous means. He, reflecting ‘I have wealth acquired through energetic effort, amassed through the strength of my arms, stained by my sweat, righteous and obtained by righteous means,’ attains happiness and attains joy. This, householder, is called the happiness of possession.\n\n“And what, householder, is the happiness of enjoyment? Here, householder, a son of good family, with wealth acquired through energetic effort, amassed through the strength of his arms, stained by his sweat, righteous and obtained by righteous means, enjoys it and performs meritorious deeds. He, reflecting ‘I enjoy wealth acquired through energetic effort, amassed through the strength of my arms, stained by my sweat, righteous and obtained by righteous means, and I perform meritorious deeds,’ attains happiness and attains joy. This, householder, is called the happiness of enjoyment.\n\n“And what, householder, is the happiness of being debt-free? Here, householder, a son of good family owes nothing to anyone, whether little or much. He, reflecting ‘I owe nothing to anyone, whether little or much,’ attains happiness and attains joy. This, householder, is called the happiness of being debt-free.\n\n“And what, householder, is the happiness of blamelessness? Here, householder, a noble disciple is endowed with blameless bodily action, endowed with blameless verbal action, and endowed with blameless mental action. He, reflecting ‘I am endowed with blameless bodily action, with blameless verbal action, and with blameless mental action,’ attains happiness and attains joy. This, householder, is called the happiness of blamelessness.\n\n“These, householder, are the four kinds of happiness to be realized by a householder who enjoys sense pleasures, from time to time.”\n\nHaving understood the happiness of being debt-free, and then the happiness of possession, a mortal enjoying the happiness of enjoyment, thereafter gains insight through wisdom. A discerning person, seeing clearly, knows both forms of well-being. Yet, these (the first three happinesses) are not worth a sixteenth part of the happiness of blamelessness.",
      "sinhala": "එවිට අනාථපිණ්ඩික ගෘහපතියා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අනාථපිණ්ඩික ගෘහපතියාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"ගෘහපතිය, මේ සැප සතරක් ඇත. කාමභෝගී ගිහියාට කලින් කලට, වරින් වර උදාකර ගත යුතු, අත්පත් කරගත යුතු සැප සතරකි මේ. ඒ කවර සතරක් ද? ඒවා නම්, අත්ථිසැපය, භෝගසැපය, ආණණ්‍යසැපය, අනවද්‍යසැපය යන සතරයි.\"\n\n\"ගෘහපතිය, අත්ථිසැපය යනු කවරේද? ගෘහපතිය, මේ ලෝකයේ යම් කුලපුත්‍රයෙකුට ස්වකීය උත්සාහයත් වීර්යයත් නිසා උපදවාගත්, තමන්ගේම බාහුබලයෙන් ලබාගත්, ධර්මානුකූලව දහඩිය මහන්සියෙන් රැස්කරගත්, සාධාරණව ලද භෝග සම්පත් තිබේ නම්, ඔහු ‘මට ස්වකීය උත්සාහයත් වීර්යයත් නිසා උපදවාගත්, තමන්ගේම බාහුබලයෙන් ලබාගත්, ධර්මානුකූලව දහඩිය මහන්සියෙන් රැස්කරගත්, සාධාරණව ලද භෝග සම්පත් ඇතැ’යි සිතා සැපයට පත් වේ; සොම්නසට පත් වේ. ගෘහපතිය, මෙය අත්ථිසැපය යැයි කියනු ලැබේ.\"\n\n\"ගෘහපතිය, භෝගසැපය යනු කවරේද? ගෘහපතිය, මේ ලෝකයේ යම් කුලපුත්‍රයෙක් ස්වකීය උත්සාහයත් වීර්යයත් නිසා උපදවාගත්, තමන්ගේම බාහුබලයෙන් ලබාගත්, ධර්මානුකූලව දහඩිය මහන්සියෙන් රැස්කරගත්, සාධාරණව ලද භෝග සම්පත් භුක්ති විඳින්නේ ද, පින්කම් කරන්නේ ද, ඔහු ‘මම ස්වකීය උත්සාහයත් වීර්යයත් නිසා උපදවාගත්, තමන්ගේම බාහුබලයෙන් ලබාගත්, ධර්මානුකූලව දහඩිය මහන්සියෙන් රැස්කරගත්, සාධාරණව ලද භෝග සම්පත් භුක්ති විඳිමි, පින්කම් කරමි’යි සිතා සැපයට පත් වේ; සොම්නසට පත් වේ. ගෘහපතිය, මෙය භෝගසැපය යැයි කියනු ලැබේ.\"\n\n\"ගෘහපතිය, ආණණ්‍යසැපය යනු කවරේද? ගෘහපතිය, මේ ලෝකයේ යම් කුලපුත්‍රයෙක් කිසිවෙකුට අල්ප මාත්‍ර වූ හෝ මහත් වූ හෝ කිසිදු ණයක් නැතිව ජීවත් වේ ද, ඔහු ‘මම කිසිවෙකුට අල්ප මාත්‍ර වූ හෝ මහත් වූ හෝ කිසිදු ණයක් නැතිව ජීවත් වෙමි’යි සිතා සැපයට පත් වේ; සොම්නසට පත් වේ. ගෘහපතිය, මෙය ආණණ්‍යසැපය යැයි කියනු ලැබේ.\"\n\n\"ගෘහපතිය, අනවද්‍යසැපය යනු කවරේද? ගෘහපතිය, මේ ලෝකයේ යම් ආර්ය ශ්‍රාවකයෙක් නිර්දෝෂ වූ කායික කර්මයකින් යුක්ත වේ ද, නිර්දෝෂ වූ වාචසික කර්මයකින් යුක්ත වේ ද, නිර්දෝෂ වූ මානසික කර්මයකින් යුක්ත වේ ද, ඔහු ‘මම නිර්දෝෂ වූ කායික කර්මයකින් යුක්ත වෙමි, නිර්දෝෂ වූ වාචසික කර්මයකින් යුක්ත වෙමි, නිර්දෝෂ වූ මානසික කර්මයකින් යුක්ත වෙමි’යි සිතා සැපයට පත් වේ; සොම්නසට පත් වේ. ගෘහපතිය, මෙය අනවද්‍යසැපය යැයි කියනු ලැබේ. ගෘහපතිය, කාමභෝගී ගිහියාට කලින් කලට, වරින් වර උදාකර ගත යුතු, අත්පත් කරගත යුතු සැප සතරක් නම් මේවාම වේ.\"\n\nආණණ්‍යසැපය දැනගෙන, ඊට අමතරව අත්ථිසැපය ද දැන,\nමිනිසා භෝගසැපය භුක්ති විඳිමින්, ඉන්පසු ප්‍රඥාවෙන් විදර්ශනා කරයි.\nමනා නුවණැති පුද්ගලයා විදර්ශනා කරමින්, ඒ භෝගයන්ගේ ස්වභාවය දෙයාකාරයකින්ම (ලැබීම හා පරිභෝගය) දනී.\nඑහෙත් මේ (අනෙක් සැප) අනවද්‍යසැපයේ දහසයෙන් කොටසකටවත් වටින්නේ නැත.",
      "paliTitle": "Ānaṇyasuttaṃ"
    },
    {
      "number": 63,
      "pali": "‘‘Sabrahmakāni, bhikkhave [itivu. 106], tāni kulāni yesaṃ puttānaṃ mātāpitaro ajjhāgāre pūjitā honti. Sapubbācariyakāni, bhikkhave, tāni kulāni, yesaṃ puttānaṃ mātāpitaro ajjhāgāre pūjitā honti. Sapubbadevatāni [sapubbadevāni (syā. kaṃ.)], bhikkhave, tāni kulāni yesaṃ puttānaṃ mātāpitaro ajjhāgāre pūjitā honti. Sāhuneyyakāni, bhikkhave, tāni kulāni yesaṃ puttānaṃ mātāpitaro ajjhāgāre pūjitā honti. ‘‘Brahmāti, bhikkhave, mātāpitūnaṃ [mātāpitunnaṃ (sī. pī.)] etaṃ adhivacanaṃ. Pubbācariyāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacanaṃ. Pubbadevatāti [pubbadevāti (sī. syā. kaṃ.)], bhikkhave, mātāpitūnaṃ etaṃ adhivacanaṃ. Āhuneyyāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacanaṃ. Taṃ kissa hetu? Bahukārā, bhikkhave, mātāpitaro, puttānaṃ āpādakā posakā imassa lokassa dassetāro’’ti. ‘‘Brahmāti mātāpitaro, pubbācariyāti vuccare; Āhuneyyā ca puttānaṃ, pajāya anukampakā. ‘‘Tasmā hi ne namasseyya, sakkareyya ca paṇḍito; Annena atha pānena, vatthena sayanena ca; Ucchādanena nhāpanena, pādānaṃ dhovanena ca. ‘‘Tāya naṃ pāricariyāya, mātāpitūsu paṇḍitā; Idheva naṃ pasaṃsanti, pecca sagge pamodatī’’ti. tatiyaṃ;",
      "english": "Monks, those families where children honor their mothers and fathers in the home are families that possess the qualities of Brahma. Monks, those families where children honor their mothers and fathers in the home are families that possess the qualities of former teachers. Monks, those families where children honor their mothers and fathers in the home are families that possess the qualities of former deities. Monks, those families where children honor their mothers and fathers in the home are families that possess the qualities of those worthy of offerings. Monks, \"Brahma\" is a designation for mothers and fathers. Monks, \"former teachers\" is a designation for mothers and fathers. Monks, \"former deities\" is a designation for mothers and fathers. Monks, \"those worthy of offerings\" is a designation for mothers and fathers. For what reason? Monks, mothers and fathers are great benefactors to their children, as they are their procreators, nurturers, and those who introduce them to this world.\n\nParents are called Brahma, they are called former teachers. They are worthy of offerings to their children, compassionate towards their progeny. Therefore, an intelligent person should indeed pay homage to them and honor them: with food and with drink, with clothes and with bedding; with anointing and bathing, and with the washing of their feet. By such service to their mothers and fathers, the wise praise them right here in this world, and after passing away, they rejoice in a heavenly realm.",
      "sinhala": "භික්ෂූනි, යම් දරුවන්ගේ මව්පියන් නිවස තුළදී පුදනු ලබත්ද, ඒ පවුල් බ්‍රහ්මයන් සහිත පවුල්ය. භික්ෂූනි, යම් දරුවන්ගේ මව්පියන් නිවස තුළදී පුදනු ලබත්ද, ඒ පවුල් පෙර ආචාර්යවරුන් සහිත පවුල්ය. භික්ෂූනි, යම් දරුවන්ගේ මව්පියන් නිවස තුළදී පුදනු ලබත්ද, ඒ පවුල් පෙර දෙවිවරුන් සහිත පවුල්ය. භික්ෂූනි, යම් දරුවන්ගේ මව්පියන් නිවස තුළදී පුදනු ලබත්ද, ඒ පවුල් ආහුණෙය්‍යයන් සහිත පවුල්ය.\n\nභික්ෂූනි, 'බ්‍රහ්මයා' යනු මව්පියන්ට කියන නමකි. භික්ෂූනි, 'පෙර ආචාර්යවරු' යනු මව්පියන්ට කියන නමකි. භික්ෂූනි, 'පෙර දෙවිවරු' යනු මව්පියන්ට කියන නමකි. භික්ෂූනි, 'ආහුණෙය්‍යයෝ' යනු මව්පියන්ට කියන නමකි. එයට හේතුව කුමක්ද? භික්ෂූනි, මව්පියෝ දරුවන්ට මහත් උපකාර ඇත්තෝය. ඔවුහු දරුවන් ඇති කරන්නෝය, පෝෂණය කරන්නෝය, මේ ලෝකය දරුවන්ට පෙන්වන්නෝය.\n\nමව්පියන් බ්‍රහ්මයෝ යැයිද, පෙර ආචාර්යවරු යැයිද කියනු ලැබේ; ඔවුහු දරුවන්ට ආහුණෙය්‍ය වූද, තමන්ගේ ප්‍රජාවට අනුකම්පා ඇත්තෝද වෙති. එබැවින් පණ්ඩිතයා ඔවුන්ට වැඳිය යුතුය, සත්කාර කළ යුතුය; ආහාරයෙන්ද, පානයෙන්ද, වස්ත්‍රයෙන්ද, සයනයෙන්ද; ශරීරය මර්දනයෙන්ද, ස්නානයෙන්ද, පාද සේදීමෙන්ද උපස්ථාන කළ යුතුය. මව්පියන්ට කරන ඒ උපස්ථානයෙන්, පණ්ඩිතයෝ මෙලොවදීද ඔහුට ප්‍රශංසා කරති, පරලොවදී ස්වර්ගයෙහි සතුටු වන්නාහ.",
      "paliTitle": "Brahmasuttaṃ"
    },
    {
      "number": 64,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye’’ti. ‘‘Pāṇātipāto adinnādānaṃ, musāvādo ca vuccati; Paradāragamanañcāpi, nappasaṃsanti paṇḍitā’’ti. catutthaṃ;",
      "english": "Monks, whoever is endowed with four qualities is, as it were, taken and directly placed in hell. Which four? One takes life; one takes what is not given; one engages in sexual misconduct; and one speaks falsely. Monks, whoever is endowed with these four qualities is, as it were, taken and directly placed in hell.\n\nTaking life, taking what is not given, and speaking falsely are declared. And going with another’s spouse – these the wise do not praise.",
      "sinhala": "භික්ෂූනි, ධර්ම සතරකින් යුක්ත වූ පුද්ගලයා, ගෙනවිත් හෙළුවාක් මෙන් නිරයට පත්වෙයි. කවර සතරකින්ද? ප්‍රාණඝාතකයා වෙයි, අදත්තාදායී වෙයි, කාමයන්හි වරදවා හැසිරෙන්නා වෙයි, මුසාවාදී වෙයි. භික්ෂූනි, මේ ධර්ම සතරින් යුක්ත වූ පුද්ගලයා, ගෙනවිත් හෙළුවාක් මෙන් නිරයට පත්වෙයි.\n\nප්‍රාණඝාතය, අදත්තාදානය, මුසාවාදයත් කියනු ලැබේ; පරදාරගමනයත් නුවණැත්තෝ ප්‍රශංසා නොකරති.",
      "paliTitle": "Nirayasuttaṃ"
    },
    {
      "number": 65,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Rūpappamāṇo rūpappasanno, ghosappamāṇo ghosappasanno, lūkhappamāṇo lūkhappasanno, dhammappamāṇo dhammappasanno – ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. ‘‘Ye ca rūpe pamāṇiṃsu [ye ca rūpena pāmiṃsu (sī. syā. kaṃ. pī.)], ye ca ghosena anvagū; Chandarāgavasūpetā, nābhijānanti te janā [na te jānanti taṃ janā (sī. syā. kaṃ. pī.)]. ‘‘Ajjhattañca na jānāti, bahiddhā ca na passati; Samantāvaraṇo bālo, sa ve ghosena vuyhati. ‘‘Ajjhattañca na jānāti, bahiddhā ca vipassati; Bahiddhā phaladassāvī, sopi ghosena vuyhati. ‘‘Ajjhattañca pajānāti, bahiddhā ca vipassati; Vinīvaraṇadassāvī, na so ghosena vuyhatī’’ti. pañcamaṃ;",
      "english": "Monks, these four individuals exist, are found in the world. Which four? One who takes form as their standard and is pleased by form; one who takes sound as their standard and is pleased by sound; one who takes harshness/austerity as their standard and is pleased by harshness/austerity; one who takes the Dhamma as their standard and is pleased by the Dhamma. These four individuals, monks, exist, are found in the world.\n\nThose who take form as their standard, and those who pursue sound, overwhelmed by desire and lust, those people do not fully understand.\n\nHe does not know inwardly, nor does he see outwardly. A fool, completely veiled on all sides, he is truly carried away by sound.\n\nHe does not know inwardly, but he sees outwardly. One who sees results only externally, he too is carried away by sound.\n\nHe knows inwardly, and he sees outwardly. One who sees with hindrances removed, he is not carried away by sound.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයන් සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. කවර සතර දෙනෙක්ද? රූපය ප්‍ර[ZWJ]මාණ කොටගෙන රූපයෙහි පැහැදී සිටින්නා, ශබ්දය ප්‍ර[ZWJ]මාණ කොටගෙන ශබ්දයෙහි පැහැදී සිටින්නා, රළු බව (දුෂ්කර ක්‍රියා) ප්‍ර[ZWJ]මාණ කොටගෙන රළු බවෙහි පැහැදී සිටින්නා, ධර්ම[ZWJ]ය ප්‍ර[ZWJ]මාණ කොටගෙන ධර්ම[ZWJ]යෙහි පැහැදී සිටින්නා. මහණෙනි, මේ පුද්ගලයන් සතර දෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.\n\nයම් කෙනෙක් රූපය ප්‍ර[ZWJ]මාණය කොට ගත්තාහුද, යම් කෙනෙක් ශබ්දය අනුව ගියාහුද, ඔවුහු ඡන්දරාගයෙන් යටපත් වූවෝ, (සත්‍ය) ධර්ම[ZWJ]ය නොදනිති.\n\nඅභ්‍යන්තරයද නොදන්නේ, බාහිරයද නොදක්නේය. සව් අතින් වැසීගිය ඒ අනුවණ තැනැත්තා ශබ්දයෙන් (ප්‍ර[ZWJ]ශංසා, නින්දාදියෙන්) ඇදී යයි.\n\nඅභ්‍යන්තරය නොදන්නේ, බාහිරය පමණක් දක්නේය. බාහිර ඵලයන් දක්නාවූ ඒ තැනැත්තාද ශබ්දයෙන් ඇදී යයි.\n\nඅභ්‍යන්තරයද ප්‍ර[ZWJ]ඥාවෙන් දනී, බාහිරයද ප්‍ර[ZWJ]ඥාවෙන් දක්නේය. නීවරණ රහිතව දකිනා ඒ තැනැත්තා ශබ්දයෙන් ඇදී නොයයි.",
      "paliTitle": "Rūpasuttaṃ"
    },
    {
      "number": 66,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Sarāgo, sadoso, samoho, samāno – ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. ‘‘Sārattā rajanīyesu, piyarūpābhinandino; Mohena āvutā [adhamā (sī. syā. kaṃ. pī.)] sattā, baddhā [bandhā (ka.)] vaḍḍhenti bandhanaṃ. ‘‘Rāgajaṃ dosajañcāpi, mohajaṃ cāpaviddasū; Karontākusalaṃ kammaṃ [dhammaṃ (ka.)], savighātaṃ dukhudrayaṃ. ‘‘Avijjānivutā posā, andhabhūtā acakkhukā; Yathā dhammā tathā santā, na tassevanti [nassevanti (sī.)] maññare’’ti. chaṭṭhaṃ;",
      "english": "Monks, these four types of individuals are present and found in the world. Which four? One with greed, one with hatred, one with delusion, one with conceit. Monks, these are the four types of individuals present and found in the world.\n\nDeeply attached to what excites passion, delighting in pleasant forms, beings enveloped by delusion, being bound, they increase their bondage.\n\nThey commit unwholesome deeds born of greed, hatred, and delusion—deeds that are to be rejected—deeds that are harmful and lead to suffering.\n\nPeople shrouded by ignorance, becoming blind and eyeless, though they exist according to the nature of phenomena, do not think, 'We shall perish.'",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. කවර සතර දෙනෙක්ද? රාගය සහිත තැනැත්තා, ද්වේෂය සහිත තැනැත්තා, මෝහය සහිත තැනැත්තා, මානය සහිත තැනැත්තා – මහණෙනි, මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.\n\nරාගය උපදවන අරමුණුවල දැඩි ලෙස ඇලී, ප්‍රිය රූපයන්හි සතුටු වන, මෝහයෙන් වැසී ගිය සත්වයෝ, බැඳී සිටිමින් තව තවත් බන්ධන වඩති.\n\nරාගයෙන් හටගත්, ද්වේෂයෙන් හටගත්, මෝහයෙන් හටගත් (අකුසලයන්ගේ විපාක) නොදකින ඔවුහු, විඝාත සහිත වූ, දුක් විපාක ඇති අකුසල කර්ම කරති.\n\nඅවිද්‍යාවෙන් වැසීගත්, අන්ධ වූ, ප්‍රඥාචක්ෂුසක් නැති පුද්ගලයෝ, යථා ස්වභාවය නොදකිමින්, තමන් විනාශ නොවන බව සිතති.",
      "paliTitle": "Sarāgasuttaṃ"
    },
    {
      "number": 67,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena sāvatthiyaṃ aññataro bhikkhu ahinā daṭṭho kālaṅkato hoti. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, sāvatthiyaṃ aññataro bhikkhu ahinā daṭṭho kālaṅkato’’ti. ‘‘Na hi nūna [na ha nūna (sī. syā. kaṃ. pī.)] so, bhikkhave, bhikkhu cattāri ahirājakulāni mettena cittena phari. Sace hi so, bhikkhave, bhikkhu cattāri ahirājakulāni mettena cittena phareyya, na hi so, bhikkhave, bhikkhu ahinā daṭṭho kālaṅkareyya. ‘‘Katamāni cattāri? Virūpakkhaṃ ahirājakulaṃ, erāpathaṃ ahirājakulaṃ, chabyāputtaṃ ahirājakulaṃ, kaṇhāgotamakaṃ ahirājakulaṃ. Na hi nūna so, bhikkhave, bhikkhu imāni cattāri ahirājakulāni mettena cittena phari. Sace hi so, bhikkhave, bhikkhu imāni cattāri ahirājakulāni mettena cittena phareyya, na hi so, bhikkhave, bhikkhu ahinā daṭṭho kālaṅkareyya. ‘‘Anujānāmi, bhikkhave, imāni cattāri ahirājakulāni mettena cittena pharituṃ attaguttiyā attarakkhāya attaparittāyā’’ti. [cūḷava. 251; jā. 1.2.105 passitabbaṃ] ‘‘Virūpakkhehi me mettaṃ, mettaṃ erāpathehi me; Chabyāputtehi me mettaṃ, mettaṃ kaṇhāgotamakehi ca. ‘‘Apādakehi me mettaṃ, mettaṃ dvipādakehi [dipādakehi (sī. syā. kaṃ. pī.)] me; Catuppadehi me mettaṃ, mettaṃ bahuppadehi me. ‘‘Mā maṃ apādako hiṃsi, mā maṃ hiṃsi dvipādako [dipādako (sī. syā. kaṃ. pī.)]; Mā maṃ catuppado hiṃsi, mā maṃ hiṃsi bahuppado. ‘‘Sabbe sattā sabbe pāṇā, sabbe bhūtā ca kevalā; Sabbe bhadrāni passantu, mā kañci [kiñci (syā. kaṃ. ka.)] pāpamāgamā. ‘‘Appamāṇo buddho, appamāṇo dhammo; Appamāṇo saṅgho, pamāṇavantāni sarīsapāni [siriṃsapāni (sī. syā. kaṃ. pī.)]. ‘‘Ahivicchikā satapadī, uṇṇanābhī sarabū mūsikā; Katā me rakkhā katā me parittā [kataṃ me parittaṃ (?)], paṭikkamantu bhūtāni; Sohaṃ namo bhagavato, namo sattannaṃ sammāsambuddhāna’’nti. sattamaṃ;",
      "english": "Once, the Blessed One was dwelling in Sāvatthī, at Jetavana, in Anāthapiṇḍika’s monastery. Now at that time, in Sāvatthī, a certain monk had been bitten by a snake and had died. Then a number of monks approached the Blessed One; having approached and paid homage to the Blessed One, they sat down to one side. Seated to one side, those monks said to the Blessed One: “Here, venerable sir, in Sāvatthī, a certain monk was bitten by a snake and has died.”\n\n“Surely, monks, that monk did not pervade the four royal families of snakes with a mind of loving-kindness. If, monks, that monk had pervaded the four royal families of snakes with a mind of loving-kindness, he would not have been bitten by a snake and died. What are these four? The royal family of snakes named Virūpakkhā, the royal family of snakes named Erāpathā, the royal family of snakes named Chabyāputtā, and the royal family of snakes named Kaṇhāgotamakā. Surely, monks, that monk did not pervade these four royal families of snakes with a mind of loving-kindness. If, monks, that monk had pervaded these four royal families of snakes with a mind of loving-kindness, he would not have been bitten by a snake and died. I allow, monks, that these four royal families of snakes be pervaded with a mind of loving-kindness, for one’s own protection, for one’s own safeguarding, for one’s own defense.”\n\nMy loving-kindness is for the Virūpakkhās, my loving-kindness is for the Erāpathās;\nMy loving-kindness is for the Chabyāputtās, and my loving-kindness is for the Kaṇhāgotamakās.\nMy loving-kindness is for those without feet, my loving-kindness is for those with two feet;\nMy loving-kindness is for those with four feet, my loving-kindness is for those with many feet.\nMay those without feet not harm me, may those with two feet not harm me;\nMay those with four feet not harm me, may those with many feet not harm me.\nMay all beings, all living creatures, all individual existences;\nMay all see what is auspicious, may no evil come to anyone.\n\nImmeasurable is the Buddha, immeasurable is the Dhamma;\nImmeasurable is the Saṅgha, but finite are creeping creatures.\nSnakes, scorpions, centipedes, spiders, geckos, and mice;\nProtection has been made by me, a safeguard has been established by me; may these beings retreat.\nTherefore, I bow to the Blessed One, I bow to the seven Fully Awakened Ones.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි සැවැත් නුවර එක්තරා භික්ෂුවක් සර්පයකු විසින් දෂ්ට කොට කාලක්‍රියා කර තිබුණේය. ඉක්බිති බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වාඩිවූහ. එකත්පසෙක වාඩිවී සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය කීහ: \"වහන්ස, මෙහි සැවැත් නුවර එක්තරා භික්ෂුවක් සර්පයකු විසින් දෂ්ට කොට කාලක්‍රියා කළේය.\"\n\n\"මහණෙනි, නියත වශයෙන්ම ඒ භික්ෂුව සතර සර්පරාජ කුලයන් කෙරෙහි මෛත්‍රී චිත්තයෙන් පතුරුවා නොමැත. යම් හෙයකින් මහණෙනි, ඒ භික්ෂුව සතර සර්පරාජ කුලයන් කෙරෙහි මෛත්‍රී චිත්තයෙන් පතුරුවන්නේ නම්, නියත වශයෙන්ම ඒ භික්ෂුව සර්පයකු විසින් දෂ්ට කොට කාලක්‍රියා නොකරන්නේය.\" \"කවරේද ඒ සතර? විරූපක්ෂ සර්පරාජ කුලය, එරාපථ සර්පරාජ කුලය, ඡබ්‍යාපුත්ත සර්පරාජ කුලය, කණ්හාගෝතමක සර්පරාජ කුලයයි. මහණෙනි, නියත වශයෙන්ම ඒ භික්ෂුව මේ සතර සර්පරාජ කුලයන් කෙරෙහි මෛත්‍රී චිත්තයෙන් පතුරුවා නොමැත. යම් හෙයකින් මහණෙනි, ඒ භික්ෂුව මේ සතර සර්පරාජ කුලයන් කෙරෙහි මෛත්‍රී චිත්තයෙන් පතුරුවන්නේ නම්, නියත වශයෙන්ම ඒ භික්ෂුව සර්පයකු විසින් දෂ්ට කොට කාලක්‍රියා නොකරන්නේය. මහණෙනි, තමන්ගේ ආරක්‍ෂාව පිණිස, තමන්ගේ රැකවරණය පිණිස, තමන්ගේ පිරිත පිණිස, මේ සතර සර්පරාජ කුලයන් කෙරෙහි මෛත්‍රී චිත්තයෙන් පැතිරවීමට මම අනුදනිමි.\"\n\nවිරූපක්ෂයන් සමඟ මගේ මෛත්‍රිය වේවා, එරාපථයන් සමඟ මගේ මෛත්‍රිය වේවා;\nඡබ්‍යාපුත්තයන් සමඟ මගේ මෛත්‍රිය වේවා, කණ්හාගෝතමකයන් සමඟද මගේ මෛත්‍රිය වේවා.\n\nපාද රහිත සත්වයන් සමඟ මගේ මෛත්‍රිය වේවා, දෙපා ඇති සත්වයන් සමඟ මගේ මෛත්‍රිය වේවා;\nසිව්පා සත්වයන් සමඟ මගේ මෛත්‍රිය වේවා, බොහෝ පා ඇති සත්වයන් සමඟ මගේ මෛත්‍රිය වේවා.\n\nපාද රහිත සත්වයා මට හිංසා නොකරත්වා, දෙපා ඇති සත්වයා මට හිංසා නොකරත්වා;\nසිව්පා සත්වයා මට හිංසා නොකරත්වා, බොහෝ පා ඇති සත්වයා මට හිංසා නොකරත්වා.\n\nසියලු සත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝද ඒ සියල්ලෝම;\nසියලු සුභ දැකත්වා, කිසිවකුටත් පාපයක් නොපැමිණේවා.\n\nබුදුන් වහන්සේ අප්‍රමාණ වන සේක, ධර්මය අප්‍රමාණ වන සේක;\nසංඝයා වහන්සේ අප්‍රමාණ වන සේක, සර්පයෝ ප්‍රමාණවත් වෙති.\n\nසර්ප, වෘශ්චික, ශතපදී, උණ්ණනාභී, සරභූ, මූසිකා;\nමා විසින් ආරක්‍ෂාව කරණ ලදී, මා විසින් පිරිත කරණ ලදී, භූතයෝ පලා යත්වා;\nඒ මම භාග්‍යවතුන් වහන්සේට නමස්කාර කරමි, සත් සම්‍යක් සම්බුදුවරයන් වහන්සේලාට නමස්කාර වේවා!",
      "paliTitle": "Ahirājasuttaṃ"
    },
    {
      "number": 68,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra kho bhagavā devadattaṃ ārabbha bhikkhū āmantesi – ‘‘attavadhāya, bhikkhave [cūḷava. 252; saṃ. ni. 2.184], devadattassa lābhasakkārasiloko udapādi. Parābhavāya, bhikkhave, devadattassa lābhasakkārasiloko udapādi. ‘‘Seyyathāpi, bhikkhave, kadalī attavadhāya phalaṃ deti, parābhavāya phalaṃ deti; evamevaṃ kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi. ‘‘Seyyathāpi, bhikkhave, veḷu attavadhāya phalaṃ deti, parābhavāya phalaṃ deti; evamevaṃ kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi. ‘‘Seyyathāpi, bhikkhave, naḷo attavadhāya phalaṃ deti, parābhavāya phalaṃ deti; evamevaṃ kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi. ‘‘Seyyathāpi, bhikkhave, assatarī attavadhāya gabbhaṃ gaṇhāti, parābhavāya gabbhaṃ gaṇhāti; evamevaṃ kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādī’’ti. ‘‘Phalaṃ ve kadaliṃ hanti, phalaṃ veḷuṃ phalaṃ naḷaṃ; Sakkāro kāpurisaṃ hanti, gabbho assatariṃ yathā’’ti [cūḷava. 335; saṃ. ni. 1.183; 2.184; netti. 90]. aṭṭhamaṃ;",
      "english": "On one occasion, the Blessed One was dwelling at Rājagaha, on Gijjhakūṭa Mountain, shortly after Devadatta had departed.\n\nThere, concerning Devadatta, the Blessed One addressed the monastics: “Monastics, gain, honor, and fame arose for Devadatta leading to his own destruction and ruin.\n\nJust as, monastics, a plantain tree bears fruit for its own destruction and ruin; so too, monastics, gain, honor, and fame arose for Devadatta leading to his own destruction and ruin.\n\nJust as, monastics, a bamboo plant bears fruit for its own destruction and ruin; so too, monastics, gain, honor, and fame arose for Devadatta leading to his own destruction and ruin.\n\nJust as, monastics, a reed bears fruit for its own destruction and ruin; so too, monastics, gain, honor, and fame arose for Devadatta leading to his own destruction and ruin.\n\nJust as, monastics, a she-mule conceives a foetus for its own destruction and ruin; so too, monastics, gain, honor, and fame arose for Devadatta leading to his own destruction and ruin.”\n\nIndeed, fruit kills the plantain, fruit kills the bamboo, fruit kills the reed; honor kills the ignoble person, just as a foetus kills the she-mule.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි, දේවදත්ත තෙරුන් වහන්සේ (සංඝ භේදය ඇති කර) වෙන්ව ගොස් වැඩි කලක් ගතවී නොතිබුණු සමයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ දේවදත්ත තෙරුන් වහන්සේ අරභයා භික්‍ෂූන් වහන්සේලා අමතා වදාළ සේක: “මහණෙනි, දේවදත්තට ලෞකික ලාභ, සත්කාර හා කීර්තිය ඇති වූයේ තමාගේම විනාශය පිණිසය. මහණෙනි, දේවදත්තට ලෞකික ලාභ, සත්කාර හා කීර්තිය ඇති වූයේ පරම පිරිහීම පිණිසය.”\n\n“මහණෙනි, යම්සේ කෙසෙල් ගස තමාගේම විනාශය පිණිස ඵල දරයිද, පරම පිරිහීම පිණිස ඵල දරයිද; එසේම මහණෙනි, දේවදත්තට ලෞකික ලාභ, සත්කාර හා කීර්තිය ඇති වූයේ තමාගේම විනාශය පිණිසය, පරම පිරිහීම පිණිසය.”\n\n“මහණෙනි, යම්සේ උණ ගස තමාගේම විනාශය පිණිස ඵල දරයිද, පරම පිරිහීම පිණිස ඵල දරයිද; එසේම මහණෙනි, දේවදත්තට ලෞකික ලාභ, සත්කාර හා කීර්තිය ඇති වූයේ තමාගේම විනාශය පිණිසය, පරම පිරිහීම පිණිසය.”\n\n“මහණෙනි, යම්සේ බට ගස තමාගේම විනාශය පිණිස ඵල දරයිද, පරම පිරිහීම පිණිස ඵල දරයිද; එසේම මහණෙනි, දේවදත්තට ලෞකික ලාභ, සත්කාර හා කීර්තිය ඇති වූයේ තමාගේම විනාශය පිණිසය, පරම පිරිහීම පිණිසය.”\n\n“මහණෙනි, යම්සේ වේසරී (වැදිරිය) තමාගේම විනාශය පිණිස ගැබ් ගනියිද, පරම පිරිහීම පිණිස ගැබ් ගනියිද; එසේම මහණෙනි, දේවදත්තට ලෞකික ලාභ, සත්කාර හා කීර්තිය ඇති වූයේ තමාගේම විනාශය පිණිසය, පරම පිරිහීම පිණිසය.”\n\n“කෙසෙල් ගස, උණ ගස, බට ගස විනාශ කරන්නේ ඒවායේ ඵලයන්ම යි. යම්සේ ගැබ් ගැනීම වේසරිය විනාශ කරන්නේද, එසේම (ලෞකික) සත්කාරය දුර්ජනයා විනාශ කරන්නේය.”",
      "paliTitle": "Devadattasuttaṃ"
    },
    {
      "number": 69,
      "pali": "‘‘Cattārimāni, bhikkhave, padhānāni. Katamāni cattāri? Saṃvarappadhānaṃ, pahānappadhānaṃ, bhāvanāppadhānaṃ, anurakkhaṇāppadhānaṃ. Katamañca, bhikkhave, saṃvarappadhānaṃ? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Idaṃ vuccati, bhikkhave, saṃvarappadhānaṃ. ‘‘Katamañca, bhikkhave, pahānappadhānaṃ? Idha, bhikkhave, bhikkhu uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Idaṃ vuccati, bhikkhave, pahānappadhānaṃ. ‘‘Katamañca, bhikkhave, bhāvanāppadhānaṃ? Idha, bhikkhave, bhikkhu anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Idaṃ vuccati, bhikkhave, bhāvanāppadhānaṃ. ‘‘Katamañca, bhikkhave, anurakkhaṇāppadhānaṃ? Idha, bhikkhave, bhikkhu uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Idaṃ vuccati, bhikkhave, anurakkhaṇāppadhānaṃ. Imāni kho, bhikkhave, cattāri padhānānī’’ti. ‘‘Saṃvaro ca pahānañca, bhāvanā anurakkhaṇā; Ete padhānā cattāro, desitādiccabandhunā; Yo hi [yehi (?)] bhikkhu idhātāpī, khayaṃ dukkhassa pāpuṇe’’ti. navamaṃ;",
      "english": "Monks, there are these four exertions. What are these four? The exertion of restraint, the exertion of abandoning, the exertion of development, and the exertion of preservation.\n\nAnd what, monks, is the exertion of restraint? Here, monks, a monk generates desire, strives, arouses energy, directs his mind, and exerts himself for the non-arising of unwholesome states that have not yet arisen. This, monks, is called the exertion of restraint.\n\nAnd what, monks, is the exertion of abandoning? Here, monks, a monk generates desire, strives, arouses energy, directs his mind, and exerts himself for the abandoning of unwholesome states that have already arisen. This, monks, is called the exertion of abandoning.\n\nAnd what, monks, is the exertion of development? Here, monks, a monk generates desire, strives, arouses energy, directs his mind, and exerts himself for the arising of wholesome states that have not yet arisen. This, monks, is called the exertion of development.\n\nAnd what, monks, is the exertion of preservation? Here, monks, a monk generates desire, strives, arouses energy, directs his mind, and exerts himself for the maintenance, non-decline, increase, abundance, development, and fulfillment of wholesome states that have already arisen. This, monks, is called the exertion of preservation.\n\nThese, monks, are the four right exertions.\n\nRestraint and abandoning, development and preservation: these four exertions were taught by the Kinsman of the Sun. Indeed, the monk who is ardent in this teaching attains the destruction of suffering.",
      "sinhala": "මහණෙනි, මේ ප්‍රධානයෝ සතර දෙනෙක් වෙත්. කවරහුද ඒ සතර දෙනා?\n\nසංවර ප්‍රධානය, ප්‍රහාණ ප්‍රධානය, භාවනා ප්‍රධානය, අනුරක්ෂණ ප්‍රධානය.\n\nමහණෙනි, සංවර ප්‍රධානය නම් කවරේද? මහණෙනි, මෙහිලා භික්ෂුවක් ඉපදී නැති පව්කාර අකුසල ධර්මයන් නූපදවා ගැනීම පිණිස කැමැත්ත උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත මනාකොට දරා ගනී, දැඩිව වෙහෙසෙයි. මහණෙනි, මෙය සංවර ප්‍රධානය යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රහාණ ප්‍රධානය නම් කවරේද? මහණෙනි, මෙහිලා භික්ෂුවක් ඉපදී ඇති පව්කාර අකුසල ධර්මයන් ප්‍රහාණය කිරීම පිණිස කැමැත්ත උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත මනාකොට දරා ගනී, දැඩිව වෙහෙසෙයි. මහණෙනි, මෙය ප්‍රහාණ ප්‍රධානය යැයි කියනු ලැබේ.\n\nමහණෙනි, භාවනා ප්‍රධානය නම් කවරේද? මහණෙනි, මෙහිලා භික්ෂුවක් ඉපදී නැති කුසල ධර්මයන් ඇති කර ගැනීම පිණිස කැමැත්ත උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත මනාකොට දරා ගනී, දැඩිව වෙහෙසෙයි. මහණෙනි, මෙය භාවනා ප්‍රධානය යැයි කියනු ලැබේ.\n\nමහණෙනි, අනුරක්ෂණ ප්‍රධානය නම් කවරේද? මහණෙනි, මෙහිලා භික්ෂුවක් ඉපදී ඇති කුසල ධර්මයන්ගේ ස්ථිර පැවැත්ම පිණිස, නොපිරිහීම පිණිස, වැඩි දියුණු වීම පිණිස, ප්‍රබල වීම පිණිස, භාවනාවට පත් කිරීම පිණිස, පූර්ණත්වයට පත් කිරීම පිණිස කැමැත්ත උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත මනාකොට දරා ගනී, දැඩිව වෙහෙසෙයි. මහණෙනි, මෙය අනුරක්ෂණ ප්‍රධානය යැයි කියනු ලැබේ.\n\nමහණෙනි, මේ ප්‍රධානයෝ සතර දෙනා වනාහි මෙසේය.\n\nසංවරය ද ප්‍රහාණය ද, භාවනාව ද අනුරක්ෂණය ද යන මේ සතර ප්‍රධානයෝ, සූර්ය වංශයට නෑකම් ඇති භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද්දාහුය. යම් භික්ෂුවක් මෙහි දැඩි වීර්යයෙන් යුක්තව කටයුතු කරයිද, හෙතෙම දුක ක්ෂය කර ගනී.",
      "paliTitle": "Padhānasuttaṃ"
    },
    {
      "number": 70,
      "pali": "‘‘Yasmiṃ, bhikkhave, samaye rājāno adhammikā honti, rājāyuttāpi tasmiṃ samaye adhammikā honti. Rājāyuttesu adhammikesu brāhmaṇagahapatikāpi tasmiṃ samaye adhammikā honti. Brāhmaṇagahapatikesu adhammikesu negamajānapadāpi tasmiṃ samaye adhammikā honti. Negamajānapadesu adhammikesu visamaṃ candimasūriyā parivattanti. Visamaṃ candimasūriyesu parivattantesu visamaṃ nakkhattāni tārakarūpāni parivattanti. Visamaṃ nakkhattesu tārakarūpesu parivattantesu visamaṃ rattindivā [rattidivā (ka.)] parivattanti. Visamaṃ rattindivesu parivattantesu visamaṃ māsaddhamāsā parivattanti. Visamaṃ māsaddhamāsesu parivattantesu visamaṃ utusaṃvaccharā parivattanti. Visamaṃ utusaṃvaccharesu parivattantesu visamaṃ vātā vāyanti visamā apañjasā. Visamaṃ vātesu vāyantesu visamesu apañjasesu devatā parikupitā bhavanti. Devatāsu parikupitāsu devo na sammā dhāraṃ anuppavecchati. Deve na sammā dhāraṃ anuppavecchante visamapākāni [visamapākīni (sī. syā. kaṃ.), visamaṃ pākāni (ka.)] sassāni bhavanti. Visamapākāni, bhikkhave, sassāni manussā paribhuñjantā appāyukā honti dubbaṇṇā ca bavhābādhā [bahvābādhā (ka.)] ca. ‘‘Yasmiṃ, bhikkhave, samaye rājāno dhammikā honti, rājāyuttāpi tasmiṃ samaye dhammikā honti. Rājāyuttesu dhammikesu brāhmaṇagahapatikāpi tasmiṃ samaye dhammikā honti. Brāhmaṇagahapatikesu dhammikesu negamajānapadāpi tasmiṃ samaye dhammikā honti. Negamajānapadesu dhammikesu samaṃ candimasūriyā parivattanti. Samaṃ candimasūriyesu parivattantesu samaṃ nakkhattāni tārakarūpāni parivattanti. Samaṃ nakkhattesu tārakarūpesu parivattantesu samaṃ rattindivā parivattanti. Samaṃ rattindivesu parivattantesu samaṃ māsaddhamāsā parivattanti. Samaṃ māsaddhamāsesu parivattantesu samaṃ utusaṃvaccharā parivattanti. Samaṃ utusaṃvaccharesu parivattantesu samaṃ vātā vāyanti samā pañjasā. Samaṃ vātesu vāyantesu samesu pañjasesu devatā aparikupitā bhavanti. Devatāsu aparikupitāsu devo sammā dhāraṃ anuppavecchati. Deve sammā dhāraṃ anuppavecchante samapākāni sassāni bhavanti. Samapākāni, bhikkhave, sassāni manussā paribhuñjantā dīghāyukā ca honti vaṇṇavanto ca balavanto ca appābādhā cā’’ti. ‘‘Gunnaṃ ce taramānānaṃ, jimhaṃ gacchati puṅgavo; Sabbā tā jimhaṃ gacchanti, nette jimhaṃ gate sati. ‘‘Evamevaṃ manussesu, yo hoti seṭṭhasammato; So ce adhammaṃ carati, pageva itarā pajā; Sabbaṃ raṭṭhaṃ dukkhaṃ seti, rājā ce hoti adhammiko. ‘‘Gunnaṃ ce taramānānaṃ, ujuṃ gacchati puṅgavo; Sabbā tā ujuṃ gacchanti, nette ujuṃ gate sati. ‘‘Evamevaṃ manussesu, yo hoti seṭṭhasammato; So sace [so ceva (sī. pī.), so ce (syā.)] dhammaṃ carati, pageva itarā pajā; Sabbaṃ raṭṭhaṃ sukhaṃ seti, rājā ce hoti dhammiko’’ti. dasamaṃ; ",
      "english": "Monks, when kings are unrighteous, the king's officials are also unrighteous at that time. When the king's officials are unrighteous, at that time brahmins and householders are also unrighteous. When brahmins and householders are unrighteous, at that time the people of the towns and countryside are also unrighteous. When the people of the towns and countryside are unrighteous, the moon and sun revolve erratically. When the moon and sun revolve erratically, the constellations and starry forms revolve erratically. When the constellations and starry forms revolve erratically, days and nights revolve erratically. When days and nights revolve erratically, months and half-months revolve erratically. When months and half-months revolve erratically, seasons and years revolve erratically. When seasons and years revolve erratically, winds blow erratically and without proper channels. When winds blow erratically and without proper channels, the devas become agitated. When the devas are agitated, the sky god does not provide rain properly. When the sky god does not provide rain properly, the crops ripen unevenly. Monks, when people consume these unevenly ripened crops, they become short-lived, unattractive, and afflicted with many diseases.\n\nMonks, when kings are righteous, the king's officials are also righteous at that time. When the king's officials are righteous, at that time brahmins and householders are also righteous. When brahmins and householders are righteous, at that time the people of the towns and countryside are also righteous. When the people of the towns and countryside are righteous, the moon and sun revolve evenly. When the moon and sun revolve evenly, the constellations and starry forms revolve evenly. When the constellations and starry forms revolve evenly, days and nights revolve evenly. When days and nights revolve evenly, months and half-months revolve evenly. When months and half-months revolve evenly, seasons and years revolve evenly. When seasons and years revolve evenly, winds blow evenly and with proper channels. When winds blow evenly and with proper channels, the devas do not become agitated. When the devas are not agitated, the sky god provides rain properly. When the sky god provides rain properly, the crops ripen evenly. Monks, when people consume these evenly ripened crops, they become long-lived, attractive, strong, and afflicted with few diseases.\n\nIf, among a herd of cattle crossing a stream, the lead bull goes crookedly, all of them go crookedly, when the leader has gone crookedly. Just so, among human beings, if whoever is esteemed as chief practices unrighteousness, then how much more will the other people. The entire realm lives in suffering, if the king is unrighteous.\n\nIf, among a herd of cattle crossing a stream, the lead bull goes straight, all of them go straight, when the leader has gone straight. Just so, among human beings, if whoever is esteemed as chief practices righteousness, then how much more will the other people. The entire realm lives in happiness, if the king is righteous.",
      "sinhala": "භික්ෂූනි, යම් කලෙක රජවරු අධාර්මික වෙත්ද, ඒ කලට රාජ්‍ය නිලධාරීහුද අධාර්මික වෙත්. රාජ්‍ය නිලධාරීන් අධාර්මික වන විට, බ්‍රාහ්මණ ගෘහපතියෝද ඒ කලට අධාර්මික වෙත්. බ්‍රාහ්මණ ගෘහපතියන් අධාර්මික වන විට, නගර වැසියෝද, ගම්වැසියෝද ඒ කලට අධාර්මික වෙත්. නගර වැසියන් හා ගම්වැසියන් අධාර්මික වන විට, හිරු සඳු විෂම ලෙස හැසිරෙත්. හිරු සඳු විෂම ලෙස හැසිරෙන විට, තාරකා හා තාරකා මණ්ඩල විෂම ලෙස හැසිරෙත්. තාරකා හා තාරකා මණ්ඩල විෂම ලෙස හැසිරෙන විට, දිවා රෑ විෂම ලෙස හැසිරෙත්. දිවා රෑ විෂම ලෙස හැසිරෙන විට, මාස හා අඩමාස (පක්ෂ) විෂම ලෙස හැසිරෙත්. මාස හා අඩමාස විෂම ලෙස හැසිරෙන විට, ඍතු හා අවුරුදු විෂම ලෙස හැසිරෙත්. ඍතු හා අවුරුදු විෂම ලෙස හැසිරෙන විට, විෂම වූ, අනුකූල නොවන සුළං හමයි. විෂම වූ, අනුකූල නොවන සුළං හමන විට, දෙවිවරු කෝපයට පත් වෙත්. දෙවිවරු කෝපයට පත් වූ විට, දෙවියෝ නිසි පරිදි වැසි නොදෙත්. දෙවියෝ නිසි පරිදි වැසි නොදෙන විට, අනිසි ලෙස ඉදුණු, විෂම ඵල ඇති ධාන්‍ය වෙත්. භික්ෂූනි, අනිසි ලෙස ඉදුණු ධාන්‍ය මනුෂ්‍යයෝ පරිභෝග කරන විට, ඔවුන් අල්පායුෂ ඇත්තෝද, දුර්වර්ණ ඇත්තෝද, බොහෝ රෝගාබාධ ඇත්තෝද වෙත්.\n\nභික්ෂූනි, යම් කලෙක රජවරු ධාර්මික වෙත්ද, ඒ කලට රාජ්‍ය නිලධාරීහුද ධාර්මික වෙත්. රාජ්‍ය නිලධාරීන් ධාර්මික වන විට, බ්‍රාහ්මණ ගෘහපතියෝද ඒ කලට ධාර්මික වෙත්. බ්‍රාහ්මණ ගෘහපතියන් ධාර්මික වන විට, නගර වැසියෝද, ගම්වැසියෝද ඒ කලට ධාර්මික වෙත්. නගර වැසියන් හා ගම්වැසියන් ධාර්මික වන විට, හිරු සඳු සම ලෙස හැසිරෙත්. හිරු සඳු සම ලෙස හැසිරෙන විට, තාරකා හා තාරකා මණ්ඩල සම ලෙස හැසිරෙත්. තාරකා හා තාරකා මණ්ඩල සම ලෙස හැසිරෙන විට, දිවා රෑ සම ලෙස හැසිරෙත්. දිවා රෑ සම ලෙස හැසිරෙන විට, මාස හා අඩමාස (පක්ෂ) සම ලෙස හැසිරෙත්. මාස හා අඩමාස සම ලෙස හැසිරෙන විට, ඍතු හා අවුරුදු සම ලෙස හැසිරෙත්. ඍතු හා අවුරුදු සම ලෙස හැසිරෙන විට, සම වූ, අනුකූල සුළං හමයි. සම වූ, අනුකූල සුළං හමන විට, දෙවිවරු කෝපයට පත් නො‌වෙත්. දෙවිවරු කෝපයට පත් නො‌වූ විට, දෙවියෝ නිසි පරිදි වැසි දෙත්. දෙවියෝ නිසි පරිදි වැසි දෙන විට, නිසි ලෙස ඉදුණු, සම ඵල ඇති ධාන්‍ය වෙත්. භික්ෂූනි, නිසි ලෙස ඉදුණු ධාන්‍ය මනුෂ්‍යයෝ පරිභෝග කරන විට, ඔවුන් දීර්ඝායුෂ ඇත්තෝද, වර්ණවත් ඇත්තෝද, බලවත් ඇත්තෝද, අල්ප රෝගාබාධ ඇත්තෝද වෙත්.\n\nගවයන් රැළක් ගමන් කරන විට, පෙරමුණේ යන ගවයා වංක ලෙස ගියහොත්, ඒ නායක ගවයා වංකව යන හෙයින්, සියලුම ගවයෝ වංකව යත්. එලෙසම, මනුෂ්‍යයන් අතර යම් කෙනෙක් ශ්‍රේෂ්ඨ යැයි සම්මත වී ඇත්ද, ඔහු අධාර්මික නම්, අනිවාර්යයෙන්ම අනෙක් ජනයාද එසේම වෙත්. රජු අධාර්මික නම්, මුළු රටම දුකසේ පවතී.\n\nගවයන් රැළක් ගමන් කරන විට, පෙරමුණේ යන ගවයා ඍජුව ගියහොත්, ඒ නායක ගවයා ඍජුව යන හෙයින්, සියලුම ගවයෝ ඍජුව යත්. එලෙසම, මනුෂ්‍යයන් අතර යම් කෙනෙක් ශ්‍රේෂ්ඨ යැයි සම්මත වී ඇත්ද, ඔහු ධාර්මික නම්, අනිවාර්යයෙන්ම අනෙක් ජනයාද එසේම වෙත්. රජු ධාර්මික නම්, මුළු රටම සුවසේ පවතී.",
      "paliTitle": "Adhammikasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Pattakammavaggo dutiyo. Tassuddānaṃ – Pattakammaṃ ānaṇyako [anaṇako (sī. pī.), anaṇyako (ka.)], sabrahmanirayā rūpena pañcamaṃ; Sarāgaahirājā devadatto, padhānaṃ adhammikena cāti.",
    "english": "",
    "sinhala": ""
  }
}