{
  "id": "an4.9",
  "title": {
    "pali": "Macalavaggo",
    "english": "The Chapter on the Unwavering",
    "sinhala": "අචල වග්ගය"
  },
  "sections": [
    {
      "number": 81,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ.",
      "english": "Monks, endowed with four qualities, one is consigned to hell as if carried there. Which four? One is a killer of living beings, a taker of what is not given, a wrongdoer in sensual pleasures, and a speaker of falsehood. Monks, endowed with these four qualities, one is consigned to hell as if carried there.\n\nMonks, endowed with four qualities, one is consigned to heaven as if carried there. Which four? One abstains from killing living beings, abstains from taking what is not given, abstains from wrongdoing in sensual pleasures, and abstains from false speech. Monks, endowed with these four qualities, one is consigned to heaven as if carried there.",
      "sinhala": "මහණෙනි, ධර්ම හතරකින් යුක්ත වූ තැනැත්තා යම් සේ කෙනෙකුන් රැගෙන ගොස් යම් තැනක තබන්නේද, එසේම කෙලින්ම නිරයට පත්වෙයි. කවර සතරකින්ද? ඔහු ප්‍රාණඝාතයෙහි යෙදෙයි, නොදුන් දෙය ගැනීමෙහි යෙදෙයි, කාමමිථ්‍යාචාරයෙහි යෙදෙයි, බොරු කීමෙහි යෙදෙයි. මහණෙනි, මේ ධර්ම හතරකින් යුක්ත වූ තැනැත්තා යම් සේ කෙනෙකුන් රැගෙන ගොස් යම් තැනක තබන්නේද, එසේම කෙලින්ම නිරයට පත්වෙයි.\n\nමහණෙනි, ධර්ම හතරකින් යුක්ත වූ තැනැත්තා යම් සේ කෙනෙකුන් රැගෙන ගොස් යම් තැනක තබන්නේද, එසේම කෙලින්ම ස්වර්ගයෙහි උපදී. කවර සතරකින්ද? ඔහු ප්‍රාණඝාතයෙන් වැළකී සිටියි, නොදුන් දෙය ගැනීමෙන් වැළකී සිටියි, කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි, බොරු කීමෙන් වැළකී සිටියි. මහණෙනි, මේ ධර්ම හතරකින් යුක්ත වූ තැනැත්තා යම් සේ කෙනෙකුන් රැගෙන ගොස් යම් තැනක තබන්නේද, එසේම කෙලින්ම ස්වර්ගයෙහි උපදී.",
      "paliTitle": "Pāṇātipātasuttaṃ"
    },
    {
      "number": 82,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Dutiyaṃ.",
      "english": "Monks, endowed with four qualities, one is cast into hell as if carried there. What are these four? He speaks falsehoods, he speaks divisive words, he speaks harsh words, and he speaks idle chatter. Indeed, monks, one endowed with these four qualities is cast into hell as if carried there.\n\nMonks, endowed with four qualities, one is cast into heaven as if carried there. What are these four? He refrains from falsehoods, he refrains from divisive words, he refrains from harsh words, and he refrains from idle chatter. Indeed, monks, one endowed with these four qualities is cast into heaven as if carried there.",
      "sinhala": "මහණෙනි, කරුණු සතරකින් යුක්ත වූ පුද්ගලයා ගෙන ගොස් තැබුවාක් මෙන් නිරයට පත්වෙයි. කුමන සතරකින්ද? ඔහු මුසාවාදයේ නිරත වෙයි, පිසුණු වචන කීමෙහි නිරත වෙයි, පරුෂ වචන කීමෙහි නිරත වෙයි, නිෂ්‍ඵල කතාවේ නිරත වෙයි. මහණෙනි, සැබැවින්ම මේ කරුණු සතරින් යුක්ත වූ පුද්ගලයා ගෙන ගොස් තැබුවාක් මෙන් නිරයට පත්වෙයි.\n\nමහණෙනි, කරුණු සතරකින් යුක්ත වූ පුද්ගලයා ගෙන ගොස් තැබුවාක් මෙන් ස්ව‍ර්ගයට පත්වෙයි. කුමන සතරකින්ද? ඔහු මුසාවාදයෙන් වැළකී සිටියි, පිසුණු වචන කීමෙන් වැළකී සිටියි, පරුෂ වචන කීමෙන් වැළකී සිටියි, නිෂ්‍ඵල කතාවෙන් වැළකී සිටියි. මහණෙනි, සැබැවින්ම මේ කරුණු සතරින් යුක්ත වූ පුද්ගලයා ගෙන ගොස් තැබුවාක් මෙන් ස්ව‍ර්ගයට පත්වෙයි.",
      "paliTitle": "Musāvādasuttaṃ"
    },
    {
      "number": 83,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā appasādanīye ṭhāne pasādaṃ upadaṃseti, ananuvicca apariyogāhetvā pasādanīye ṭhāne appasādaṃ upadaṃseti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati, anuvicca pariyogāhetvā appasādanīye ṭhāne appasādaṃ upadaṃseti anuvicca pariyogāhetvā pasādanīye ṭhāne pasādaṃ upadaṃseti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, endowed with four qualities, one is consigned to hell just as if they were carried there. Which four? Without investigating, without examining thoroughly, one speaks praise of one who deserves dispraise; without investigating, without examining thoroughly, one speaks dispraise of one who deserves praise; without investigating, without examining thoroughly, one shows approval in a situation that is not worthy of approval; without investigating, without examining thoroughly, one shows disapproval in a situation that is worthy of approval. Bhikkhus, endowed with these four qualities, one is consigned to hell just as if they were carried there.\n\nBhikkhus, endowed with four qualities, one is consigned to heaven just as if they were carried there. Which four? Having investigated, having examined thoroughly, one speaks dispraise of one who deserves dispraise; having investigated, having examined thoroughly, one speaks praise of one who deserves praise; having investigated, having examined thoroughly, one shows disapproval in a situation that is not worthy of approval; having investigated, having examined thoroughly, one shows approval in a situation that is worthy of approval. Bhikkhus, endowed with these four qualities, one is consigned to heaven just as if they were carried there.",
      "sinhala": "‘‘මහණෙනි, ධර්‍මයන් සතරකින් යුක්ත වූ තැනැත්තා, යම් ලෙසින් ගෙන එනු ලැබූ කෙනෙක් එලෙසින්ම (ගමනාන්තයට) දමනු ලැබේද, එලෙසින්ම නිරයට දමනු ලැබෙයි. කවර සතරකින් ද?\n\nහොඳින් විමසා නොබලා, ගැඹුරින් පරීක්ෂා කර නොබලා, අවලාද ලැබිය යුතු කෙනෙකුට ප්‍රශංසා කරයි. හොඳින් විමසා නොබලා, ගැඹුරින් පරීක්ෂා කර නොබලා, ප්‍රශංසා ලැබිය යුතු කෙනෙකුට අවලාද කරයි. හොඳින් විමසා නොබලා, ගැඹුරින් පරීක්ෂා කර නොබලා, ශ්‍රද්ධාව ඇති නොවන තැනක ශ්‍රද්ධාව ඇති කරගනී. හොඳින් විමසා නොබලා, ගැඹුරින් පරීක්ෂා කර නොබලා, ශ්‍රද්ධාව ඇතිවන තැනක අශ්‍රද්ධාව ඇති කරගනී. මහණෙනි, මෙවන් ධර්‍මයන් සතරකින් යුක්ත වූ තැනැත්තා, යම් ලෙසින් ගෙන එනු ලැබූ කෙනෙක් එලෙසින්ම (ගමනාන්තයට) දමනු ලැබේද, එලෙසින්ම නිරයට දමනු ලැබෙයි.\n\nමහණෙනි, ධර්‍මයන් සතරකින් යුක්ත වූ තැනැත්තා, යම් ලෙසින් ගෙන එනු ලැබූ කෙනෙක් එලෙසින්ම (ගමනාන්තයට) දමනු ලැබේද, එලෙසින්ම ස්වර්ගයට දමනු ලැබෙයි. කවර සතරකින් ද?\n\nහොඳින් විමසා බලා, ගැඹුරින් පරීක්ෂා කර බලා, අවලාද ලැබිය යුතු කෙනෙකුට අවලාද කරයි. හොඳින් විමසා බලා, ගැඹුරින් පරීක්ෂා කර බලා, ප්‍රශංසා ලැබිය යුතු කෙනෙකුට ප්‍රශංසා කරයි. හොඳින් විමසා බලා, ගැඹුරින් පරීක්ෂා කර බලා, ශ්‍රද්ධාව ඇති නොවන තැනක අශ්‍රද්ධාව ඇති කරගනී. හොඳින් විමසා බලා, ගැඹුරින් පරීක්ෂා කර බලා, ශ්‍රද්ධාව ඇතිවන තැනක ශ්‍රද්ධාව ඇති කරගනී. මහණෙනි, මෙවන් ධර්‍මයන් සතරකින් යුක්ත වූ තැනැත්තා, යම් ලෙසින් ගෙන එනු ලැබූ කෙනෙක් එලෙසින්ම (ගමනාන්තයට) දමනු ලැබේද, එලෙසින්ම ස්වර්ගයට දමනු ලැබෙයි.",
      "paliTitle": "Avaṇṇārahasuttaṃ"
    },
    {
      "number": 84,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Kodhagaru hoti na saddhammagaru, makkhagaru hoti na saddhammagaru, lābhagaru hoti na saddhammagaru, sakkāragaru hoti na saddhammagaru – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Saddhammagaru hoti na kodhagaru, saddhammagaru hoti na makkhagaru, saddhammagaru hoti na lābhagaru, saddhammagaru hoti na sakkāragaru – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Catutthaṃ.",
      "english": "Monks, endowed with four qualities, one is indeed placed in hell, just as if picked up and put down. Which four? One prioritizes anger over the True Dhamma; one prioritizes denigration over the True Dhamma; one prioritizes material gain over the True Dhamma; one prioritizes honor over the True Dhamma. Indeed, monks, endowed with these four qualities, one is indeed placed in hell, just as if picked up and put down.\n\nMonks, endowed with four qualities, one is indeed placed in heaven, just as if picked up and put down. Which four? One prioritizes the True Dhamma over anger; one prioritizes the True Dhamma over denigration; one prioritizes the True Dhamma over material gain; one prioritizes the True Dhamma over honor. Indeed, monks, endowed with these four qualities, one is indeed placed in heaven, just as if picked up and put down.",
      "sinhala": "මහණෙනි, සතර ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා ගෙන ආ පරිද්දෙන්ම නිරයේ පිහිටුවනු ලැබේ. කවර සතරකින්ද? කෝධය ප්‍රමුඛ කොට ගන්නේය, සද්ධර්මය ප්‍රමුඛ කොට නොගන්නේය. මක්ඛය ප්‍රමුඛ කොට ගන්නේය, සද්ධර්මය ප්‍රමුඛ කොට නොගන්නේය. ලාභය ප්‍රමුඛ කොට ගන්නේය, සද්ධර්මය ප්‍රමුඛ කොට නොගන්නේය. සක්කාරය ප්‍රමුඛ කොට ගන්නේය, සද්ධර්මය ප්‍රමුඛ කොට නොගන්නේය. මහණෙනි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා ගෙන ආ පරිද්දෙන්ම නිරයේ පිහිටුවනු ලැබේ.\n\nමහණෙනි, සතර ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා ගෙන ආ පරිද්දෙන්ම ස්වර්ගයේ පිහිටුවනු ලැබේ. කවර සතරකින්ද? සද්ධර්මය ප්‍රමුඛ කොට ගන්නේය, කෝධය ප්‍රමුඛ කොට නොගන්නේය. සද්ධර්මය ප්‍රමුඛ කොට ගන්නේය, මක්ඛය ප්‍රමුඛ කොට නොගන්නේය. සද්ධර්මය ප්‍රමුඛ කොට ගන්නේය, ලාභය ප්‍රමුඛ කොට නොගන්නේය. සද්ධර්මය ප්‍රමුඛ කොට ගන්නේය, සක්කාරය ප්‍රමුඛ කොට නොගන්නේය. මහණෙනි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා ගෙන ආ පරිද්දෙන්ම ස්වර්ගයේ පිහිටුවනු ලැබේ.",
      "paliTitle": "Kodhagarusuttaṃ"
    },
    {
      "number": 85,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Tamo tamaparāyaṇo [… parāyano (syā. kaṃ. pī.) pu. pa. 168; saṃ. ni. 1.132], tamo jotiparāyaṇo, joti tamaparāyaṇo, joti jotiparāyaṇo. ‘‘Kathañca, bhikkhave, puggalo tamo hoti tamaparāyaṇo? Idha, bhikkhave, ekacco puggalo nīce kule paccājāto hoti – caṇḍālakule vā venakule vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Evaṃ kho, bhikkhave, puggalo tamo hoti tamaparāyaṇo. ‘‘Kathañca, bhikkhave, puggalo tamo hoti jotiparāyaṇo? Idha, bhikkhave, ekacco puggalo nīce kule paccājāto hoti – caṇḍālakule vā venakule vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati; so ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho kāṇo vā kuṇī vā khañjo vā pakkhahato vā na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. So kāyena sucaritaṃ caritvā, vācāya sucaritaṃ caritvā, manasā sucaritaṃ caritvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Evaṃ kho, bhikkhave, puggalo tamo hoti jotiparāyaṇo. ‘‘Kathañca, bhikkhave, puggalo joti hoti tamaparāyaṇo? Idha, bhikkhave, ekacco puggalo ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe; so ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Evaṃ kho, bhikkhave, puggalo joti hoti tamaparāyaṇo. ‘‘Kathañca, bhikkhave, puggalo joti hoti jotiparāyaṇo? Idha, bhikkhave, ekacco puggalo ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe; so ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. So kāyena sucaritaṃ caritvā, vācāya sucaritaṃ caritvā, manasā sucaritaṃ caritvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Evaṃ kho, bhikkhave, puggalo joti hoti jotiparāyaṇo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Pañcamaṃ.",
      "english": "Monks, these four types of individuals exist, are found in the world. Which four? One who is dark with darkness as their destination; one who is dark with light as their destination; one who is luminous with darkness as their destination; and one who is luminous with light as their destination.\n\nAnd how, monks, is an individual dark with darkness as their destination? Here, monks, a certain individual is reborn into a low family—such as a Candala family, a bamboo-worker's family, a hunter's family, a cart-maker's family, or a scavenger's family—poor, with little food and drink, living a hard life where sustenance is obtained with difficulty. Furthermore, they are ill-favored, unpleasant to look at, disfigured, afflicted with many ailments, blind, crippled, lame, or paralyzed. They do not obtain food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, or lamps. They engage in unwholesome conduct by body, unwholesome conduct by speech, and unwholesome conduct by mind. Having engaged in unwholesome conduct by body, speech, and mind, upon the breakup of the body, after death, they are reborn in a state of woe, a miserable destination, a place of perdition, in hell. Thus, monks, is an individual dark with darkness as their destination.\n\nAnd how, monks, is an individual dark with light as their destination? Here, monks, a certain individual is reborn into a low family—such as a Candala family, a bamboo-worker's family, a hunter's family, a cart-maker's family, or a scavenger's family—poor, with little food and drink, living a hard life where sustenance is obtained with difficulty. Furthermore, they are ill-favored, unpleasant to look at, disfigured, afflicted with many ailments, blind, crippled, lame, or paralyzed. They do not obtain food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, or lamps. They engage in wholesome conduct by body, wholesome conduct by speech, and wholesome conduct by mind. Having engaged in wholesome conduct by body, speech, and mind, upon the breakup of the body, after death, they are reborn in a good destination, a heavenly world. Thus, monks, is an individual dark with light as their destination.\n\nAnd how, monks, is an individual luminous with darkness as their destination? Here, monks, a certain individual is reborn into a high family—such as a wealthy Khattiya family, a wealthy Brahmin family, or a wealthy householder family—rich, greatly wealthy, greatly prosperous, possessing abundant gold and silver, abundant assets and property, abundant grain and crops. Furthermore, they are good-looking, pleasant to behold, charming, endowed with supreme beauty of complexion. They obtain food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps. They engage in unwholesome conduct by body, unwholesome conduct by speech, and unwholesome conduct by mind. Having engaged in unwholesome conduct by body, speech, and mind, upon the breakup of the body, after death, they are reborn in a state of woe, a miserable destination, a place of perdition, in hell. Thus, monks, is an individual luminous with darkness as their destination.\n\nAnd how, monks, is an individual luminous with light as their destination? Here, monks, a certain individual is reborn into a high family—such as a wealthy Khattiya family, a wealthy Brahmin family, or a wealthy householder family—rich, greatly wealthy, greatly prosperous, possessing abundant gold and silver, abundant assets and property, abundant grain and crops. Furthermore, they are good-looking, pleasant to behold, charming, endowed with supreme beauty of complexion. They obtain food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps. They engage in wholesome conduct by body, wholesome conduct by speech, and wholesome conduct by mind. Having engaged in wholesome conduct by body, speech, and mind, upon the breakup of the body, after death, they are reborn in a good destination, a heavenly world. Thus, monks, is an individual luminous with light as their destination. These, monks, are the four types of individuals who exist and are found in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සත්‍ය වශයෙන්ම සිටිති, විද්‍යමාන වෙති. කවර සතර දෙනෙක්ද? අඳුරෙහි සිට අඳුර කරා යන පුද්ගලයා, අඳුරෙහි සිට ආලෝකය කරා යන පුද්ගලයා, ආලෝකයෙහි සිට අඳුර කරා යන පුද්ගලයා, ආලෝකයෙහි සිට ආලෝකය කරා යන පුද්ගලයා යන සතර දෙනාය.\n\nමහණෙනි, පුද්ගලයෙක් අඳුරෙහි සිට අඳුර කරා යන්නේ කෙසේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් පහත් කුලයක උපදින්නේය. එනම්, චණ්ඩාල කුලයක හෝ වේන කුලයක හෝ නේසාද කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ දරිද්‍ර වූ, අල්ප වූ ආහාර පාන භෝජන ඇති, දුක්ඛිත ජීවන වෘත්තියක් ඇති, යන්තමින් ජීවත් වීමට අහර වස්ත්‍ර ලැබෙන ස්ථානයක උපදින්නේය. ඒ පුද්ගලයා අවලක්ෂණ වෙයි, දැකීමට අප්‍රසන්න වෙයි, කොර වූ හෝ අංගවිකල වූ හෝ බොහෝ රෝගාබාධ ඇති, එක් ඇසක් අන්ධ වූ හෝ අතපය අඩපණ වූ හෝ කොර වූ හෝ අංශභාග රෝගයෙන් පෙළෙන්නෙක් හෝ වෙයි. ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය ලබන්නෙක් ද නොවෙයි. හෙතෙම කයින් දුසිරිත් කරන්නේය, වචනයෙන් දුසිරිත් කරන්නේය, සිතින් දුසිරිත් කරන්නේය. හෙතෙම කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, සිතින් දුසිරිත් කොට, කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුකට පත් වන තැනක උපදින්නේය. මහණෙනි, පුද්ගලයෙක් අඳුරෙහි සිට අඳුර කරා යන්නේ මෙපරිද්දෙනි.\n\nමහණෙනි, පුද්ගලයෙක් අඳුරෙහි සිට ආලෝකය කරා යන්නේ කෙසේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් පහත් කුලයක උපදින්නේය. එනම්, චණ්ඩාල කුලයක හෝ වේන කුලයක හෝ නේසාද කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ දරිද්‍ර වූ, අල්ප වූ ආහාර පාන භෝජන ඇති, දුක්ඛිත ජීවන වෘත්තියක් ඇති, යන්තමින් ජීවත් වීමට අහර වස්ත්‍ර ලැබෙන ස්ථානයක උපදින්නේය. ඒ පුද්ගලයා අවලක්ෂණ වෙයි, දැකීමට අප්‍රසන්න වෙයි, කොර වූ හෝ අංගවිකල වූ හෝ බොහෝ රෝගාබාධ ඇති, එක් ඇසක් අන්ධ වූ හෝ අතපය අඩපණ වූ හෝ කොර වූ හෝ අංශභාග රෝගයෙන් පෙළෙන්නෙක් හෝ වෙයි. ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය ලබන්නෙක් ද නොවෙයි. හෙතෙම කයින් සුසිරිත් කරන්නේය, වචනයෙන් සුසිරිත් කරන්නේය, සිතින් සුසිරිත් කරන්නේය. හෙතෙම කයින් සුසිරිත් කොට, වචනයෙන් සුසිරිත් කොට, සිතින් සුසිරිත් කොට, කය බිඳී මරණින් මතු සුගති, සග්ග යන දෙව්ලොව උපදින්නේය. මහණෙනි, පුද්ගලයෙක් අඳුරෙහි සිට ආලෝකය කරා යන්නේ මෙපරිද්දෙනි.\n\nමහණෙනි, පුද්ගලයෙක් ආලෝකයෙහි සිට අඳුර කරා යන්නේ කෙසේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් උසස් කුලයක උපදින්නේය. එනම්, ක්ෂත්‍රිය මහාසාල කුලයක හෝ බ්‍රාහ්මණ මහාසාල කුලයක හෝ ගෘහපති මහාසාල කුලයක හෝ ධනවත්, මහා ධනයෙන් යුක්ත, මහා භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති තැනක උපදින්නේය. ඒ පුද්ගලයා අතිශයින් රූප සම්පන්න වෙයි, දැකීමට ප්‍රිය වෙයි, අප්‍රසන්න නොවී ප්‍රසන්න වෙයි, අතිශය උතුම් වූ ශරීර වර්ණයකින් යුක්ත වෙයි, ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය ලබන්නෙක් ද වෙයි. හෙතෙම කයින් දුසිරිත් කරන්නේය, වචනයෙන් දුසිරිත් කරන්නේය, සිතින් දුසිරිත් කරන්නේය. හෙතෙම කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, සිතින් දුසිරිත් කොට, කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුකට පත් වන තැනක උපදින්නේය. මහණෙනි, පුද්ගලයෙක් ආලෝකයෙහි සිට අඳුර කරා යන්නේ මෙපරිද්දෙනි.\n\nමහණෙනි, පුද්ගලයෙක් ආලෝකයෙහි සිට ආලෝකය කරා යන්නේ කෙසේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් උසස් කුලයක උපදින්නේය. එනම්, ක්ෂත්‍රිය මහාසාල කුලයක හෝ බ්‍රාහ්මණ මහාසාල කුලයක හෝ ගෘහපති මහාසාල කුලයක හෝ ධනවත්, මහා ධනයෙන් යුක්ත, මහා භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති තැනක උපදින්නේය. ඒ පුද්ගලයා අතිශයින් රූප සම්පන්න වෙයි, දැකීමට ප්‍රිය වෙයි, අප්‍රසන්න නොවී ප්‍රසන්න වෙයි, අතිශය උතුම් වූ ශරීර වර්ණයකින් යුක්ත වෙයි, ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය ලබන්නෙක් ද වෙයි. හෙතෙම කයින් සුසිරිත් කරන්නේය, වචනයෙන් සුසිරිත් කරන්නේය, සිතින් සුසිරිත් කරන්නේය. හෙතෙම කයින් සුසිරිත් කොට, වචනයෙන් සුසිරිත් කොට, සිතින් සුසිරිත් කොට, කය බිඳී මරණින් මතු සුගති, සග්ග යන දෙව්ලොව උපදින්නේය. මහණෙනි, පුද්ගලයෙක් ආලෝකයෙහි සිට ආලෝකය කරා යන්නේ මෙපරිද්දෙනි.\n\nමහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සත්‍ය වශයෙන්ම සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Tamotamasuttaṃ"
    },
    {
      "number": 86,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Oṇatoṇato, oṇatuṇṇato, uṇṇatoṇato, uṇṇatuṇṇato. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti [pu. pa. 169]. Chaṭṭhaṃ.",
      "english": "Monastics, these four types of individuals exist, are found, in the world. Which four? One who is deficient in virtue and deficient in wisdom; one who is deficient in virtue but accomplished in wisdom; one who is accomplished in virtue but deficient in wisdom; and one who is accomplished in virtue and accomplished in wisdom. Indeed, monastics, these four types of individuals exist, are found, in the world.",
      "sinhala": "භික්ෂූණි, ලොවෙහි මෙවන් පුද්ගලයෝ සතර දෙනෙක් සිටිති.\nකවර සතර දෙනෙක් ද?\nදෘෂ්ටි වශයෙන් ද පහත් වූ, සිල් වශයෙන් ද පහත් වූ පුද්ගලයා ය.\nදෘෂ්ටි වශයෙන් පහත් වූ, සිල් වශයෙන් උසස් වූ පුද්ගලයා ය.\nදෘෂ්ටි වශයෙන් උසස් වූ, සිල් වශයෙන් පහත් වූ පුද්ගලයා ය.\nදෘෂ්ටි වශයෙන් ද උසස් වූ, සිල් වශයෙන් ද උසස් වූ පුද්ගලයා ය.\nභික්ෂූණි, ලොවෙහි මෙවන් පුද්ගලයෝ සතර දෙනෙක් සිටිති.",
      "paliTitle": "Oṇatoṇatasuttaṃ"
    },
    {
      "number": 87,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Samaṇamacalo, samaṇapuṇḍarīko, samaṇapadumo, samaṇesu samaṇasukhumālo. ‘‘Kathañca, bhikkhave, puggalo samaṇamacalo hoti? Idha, bhikkhave, bhikkhu sekho hoti pāṭipado [paṭipado (syā. kaṃ. pī.) ma. ni. 2 sekhasuttavaṇṇanā oloketabbā]; anuttaraṃ yogakkhemaṃ patthayamāno viharati. Seyyathāpi, bhikkhave, rañño khattiyassa muddhāvasittassa jeṭṭho putto ābhiseko anabhisitto macalappatto; evamevaṃ kho, bhikkhave, bhikkhu sekho hoti pāṭipado, anuttaraṃ yogakkhemaṃ patthayamāno viharati. Evaṃ kho, bhikkhave, puggalo samaṇamacalo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapuṇḍarīko hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, no ca kho aṭṭha vimokkhe kāyena phusitvā viharati [phassitvā (sī. pī.)]. Evaṃ kho, bhikkhave, puggalo samaṇapuṇḍarīko hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapadumo hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, aṭṭha ca vimokkhe kāyena phusitvā viharati. Evaṃ kho, bhikkhave, puggalo samaṇapadumo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇesu samaṇasukhumālo hoti? Idha, bhikkhave, bhikkhu yācitova bahulaṃ cīvaraṃ paribhuñjati, appaṃ ayācito; yācitova bahulaṃ piṇḍapātaṃ paribhuñjati, appaṃ ayācito; yācitova bahulaṃ senāsanaṃ paribhuñjati, appaṃ ayācito; yācitova bahulaṃ gilānappaccayabhesajjaparikkhāraṃ paribhuñjati, appaṃ ayācito. Yehi kho pana sabrahmacārīhi saddhiṃ viharati, tyassa [tyāssa (sī.) a. ni. 5.104] manāpeneva bahulaṃ kāyakammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ vacīkammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ manokammena samudācaranti, appaṃ amanāpena; manāpaṃyeva bahulaṃ upahāraṃ upaharanti, appaṃ amanāpaṃ. Yāni kho pana tāni vedayitāni pittasamuṭṭhānāni vā semhasamuṭṭhānāni vā vātasamuṭṭhānāni vā sannipātikāni vā utupariṇāmajāni vā visamaparihārajāni vā opakkamikāni vā kammavipākajāni vā, tāni panassa na bahudeva uppajjanti. Appābādho hoti. Catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, puggalo samaṇesu samaṇasukhumālo hoti. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya samaṇesu samaṇasukhumāloti, mameva taṃ, bhikkhave, sammā vadamāno vadeyya samaṇesu samaṇasukhumāloti. Ahañhi, bhikkhave, yācitova bahulaṃ cīvaraṃ paribhuñjāmi, appaṃ ayācito; yācitova bahulaṃ piṇḍapātaṃ paribhuñjāmi, appaṃ ayācito; yācitova bahulaṃ senāsanaṃ paribhuñjāmi, appaṃ ayācito; yācitova bahulaṃ gilānappaccayabhesajjaparikkhāraṃ paribhuñjāmi, appaṃ ayācito. Yehi kho pana bhikkhūhi saddhiṃ viharāmi te me manāpeneva bahulaṃ kāyakammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ vacīkammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ manokammena samudācaranti, appaṃ amanāpena; manāpaṃyeva bahulaṃ upahāraṃ upaharanti, appaṃ amanāpaṃ. Yāni kho pana tāni vedayitāni pittasamuṭṭhānāni vā semhasamuṭṭhānāni vā vātasamuṭṭhānāni vā sannipātikāni vā utupariṇāmajāni vā visamaparihārajāni vā opakkamikāni vā kammavipākajāni vā, tāni me na bahudeva uppajjanti. Appābādhohamasmi. Catunnaṃ kho panasmi jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya samaṇesu samaṇasukhumāloti, mameva taṃ, bhikkhave, sammā vadamāno vadeyya samaṇesu samaṇasukhumāloti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Sattamaṃ.",
      "english": "“Bhikkhus, these four types of individuals are found existing in the world. Which four? An unshakeable contemplative, a white lotus contemplative, a red lotus contemplative, and a tender contemplative among contemplatives.\n\n“And how, bhikkhus, is an individual an unshakeable contemplative? Here, bhikkhus, a bhikkhu is a trainee, one on the path; he dwells aspiring for the unsurpassed security from bondage. Just as, bhikkhus, the eldest son of a king, a consecrated warrior, though not yet consecrated as the heir apparent, has attained unshakeable status; even so, bhikkhus, a bhikkhu is a trainee, one on the path, dwelling aspiring for the unsurpassed security from bondage. This is how, bhikkhus, an individual is an unshakeable contemplative.\n\n“And how, bhikkhus, is an individual a white lotus contemplative? Here, bhikkhus, due to the destruction of the influxes, a bhikkhu dwells having directly realized and attained the liberation of mind and liberation through wisdom, without influxes, in this very life, but does not dwell having touched the eight liberations with the body. This is how, bhikkhus, an individual is a white lotus contemplative.\n\n“And how, bhikkhus, is an individual a red lotus contemplative? Here, bhikkhus, due to the destruction of the influxes, a bhikkhu dwells having directly realized and attained the liberation of mind and liberation through wisdom, without influxes, in this very life, and also dwells having touched the eight liberations with the body. This is how, bhikkhus, an individual is a red lotus contemplative.\n\n“And how, bhikkhus, is an individual a tender contemplative among contemplatives? Here, bhikkhus, a bhikkhu mostly uses robes when requested, rarely when unrequested; mostly uses almsfood when requested, rarely when unrequested; mostly uses lodging when requested, rarely when unrequested; mostly uses requisites for the sick and medicine when requested, rarely when unrequested. Furthermore, those fellow spiritual practitioners with whom he dwells mostly treat him with pleasant bodily action, rarely with unpleasant; mostly with pleasant verbal action, rarely with unpleasant; mostly with pleasant mental action, rarely with unpleasant; they mostly offer him pleasant gifts, rarely unpleasant. Moreover, those feelings that arise from bile, or from phlegm, or from wind, or from a combination of humours, or from seasonal change, or from improper care, or from sudden attack, or from the ripening of kamma—these do not arise very much for him. He is rarely ill. He is one who obtains the four jhānas—which belong to the higher mind and are a pleasant abiding in this very life—at will, without difficulty, without trouble. And due to the destruction of the influxes, he dwells having directly realized and attained the liberation of mind and liberation through wisdom, without influxes, in this very life. This is how, bhikkhus, an individual is a tender contemplative among contemplatives.\n\n“Indeed, bhikkhus, if one were to speak rightly, saying ‘a tender contemplative among contemplatives,’ it is of me that one would rightly speak, saying ‘a tender contemplative among contemplatives.’ For I, bhikkhus, mostly use robes when requested, rarely when unrequested; mostly use almsfood when requested, rarely when unrequested; mostly use lodging when requested, rarely when unrequested; mostly use requisites for the sick and medicine when requested, rarely when unrequested. Furthermore, those bhikkhus with whom I dwell mostly treat me with pleasant bodily action, rarely with unpleasant; mostly with pleasant verbal action, rarely with unpleasant; mostly with pleasant mental action, rarely with unpleasant; they mostly offer me pleasant gifts, rarely unpleasant. Moreover, those feelings that arise from bile, or from phlegm, or from wind, or from a combination of humours, or from seasonal change, or from improper care, or from sudden attack, or from the ripening of kamma—these do not arise very much for me. I am rarely ill. I am one who obtains the four jhānas—which belong to the higher mind and are a pleasant abiding in this very life—at will, without difficulty, without trouble. And due to the destruction of the influxes, I dwell having directly realized and attained the liberation of mind and liberation through wisdom, without influxes, in this very life.\n\n“Indeed, bhikkhus, if one were to speak rightly, saying ‘a tender contemplative among contemplatives,’ it is of me that one would rightly speak, saying ‘a tender contemplative among contemplatives.’ These, bhikkhus, are the four types of individuals found existing in the world.”",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයේ සිටිති, විද්‍යමාන වෙති. ඒ කවර සතර දෙනෙක්ද? සමණු-අචල, සමණු-පුණ්ඩරීක, සමණු-පදුම, සහ සමණයන් අතර සමණු-සුඛුමාල යන අයයි.\n\nමහණෙනි, පුද්ගලයෙක් සමණු-අචල වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් ශෛක්‍ෂ මාර්ගයට පැමිණ සිටින්නෙක් වෙයි. (හෙතෙම) අනුත්තර වූ යෝගක්‍ෂේමය (ක්ලේශ යෝගයන්ගෙන් නිදහස්වීම) පතමින් වාසය කරයි. මහණෙනි, යම්සේ අභිෂේකයෙන් තොර වූ, හිසට දිය ඉස අභිෂේක කළ ක්‍ෂත්‍රිය රජුගේ ජ්‍යෙෂ්ඨ පුත්‍රයා, අචල වූ (ස්ථිර වූ) අභිෂේකයට පැමිණෙන්නේද, එපරිද්දෙන්ම මහණෙනි, භික්ෂුව ශෛක්‍ෂ මාර්ගයට පැමිණ සිටින්නෙක් වෙයි, අනුත්තර වූ යෝගක්‍ෂේමය පතමින් වාසය කරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් සමණු-අචල වන්නේය.\n\nමහණෙනි, පුද්ගලයෙක් සමණු-පුණ්ඩරීක වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, මේ ද්දිට්ඨධම්මයේදීම, තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, (ක්ලේශයන්ගෙන්) තොර වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය උපදවාගෙන වාසය කරයි. එහෙත්, අෂ්ට විමෝක්‍ෂයන් කයින් ස්පර්ශ කොට වාසය නොකරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් සමණු-පුණ්ඩරීක වන්නේය.\n\nමහණෙනි, පුද්ගලයෙක් සමණු-පදුම වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, මේ ද්දිට්ඨධම්මයේදීම, තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, (ක්ලේශයන්ගෙන්) තොර වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය උපදවාගෙන වාසය කරයි. තවද, අෂ්ට විමෝක්‍ෂයන් කයින් ස්පර්ශ කොට වාසය කරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් සමණු-පදුම වන්නේය.\n\nමහණෙනි, පුද්ගලයෙක් සමණයන් අතර සමණු-සුඛුමාල වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් බොහෝ විට සිවුරු පරිභෝජනය කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. බොහෝ විට පිණ්ඩපාතය පරිභෝජනය කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. බොහෝ විට සේනාසන පරිභෝග කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. බොහෝ විට ගිලන්පස බෙහෙත් පිරිකර පරිභෝග කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. තවද, යම් බ්‍රහ්මචාරීන් සමඟ වාසය කරන්නේද, ඔවුහු ඔහුට බොහෝ විට ප්‍රිය මනාප ශාරීරික ක්‍රියාවලින් උපස්ථාන කරති, අප්‍රිය වූ ක්‍රියාවලින් ස්වල්පයකි. බොහෝ විට ප්‍රිය මනාප වචනයෙන් උපස්ථාන කරති, අප්‍රිය වූ වචනයෙන් ස්වල්පයකි. බොහෝ විට ප්‍රිය මනාප මනසින් උපස්ථාන කරති, අප්‍රිය වූ මනසින් ස්වල්පයකි. බොහෝ විට ප්‍රිය මනාප වූ උපහාර (ගෞරව) පුදති, අප්‍රිය වූ උපහාර ස්වල්පයකි. තවද, පිත නිසා හටගන්නා වූ හෝ සෙම නිසා හටගන්නා වූ හෝ වාතය නිසා හටගන්නා වූ හෝ ත්‍රිදෝෂ (පිත්, සෙම්, වාත) එක්වීමෙන් හටගන්නා වූ හෝ ඍතු විපර්යාසයෙන් හටගන්නා වූ හෝ විෂම විහාරයෙන් (නොගැළපෙන ජීවන රටාවෙන්) හටගන්නා වූ හෝ උපද්‍රව හේතුවෙන් හටගන්නා වූ හෝ කර්ම විපාකයෙන් හටගන්නා වූ හෝ යම් වේදනා ඇත්තේද, ඒවා ඔහුට බොහෝ සෙයින් නොහටගනියි. (හෙතෙම) අල්ප ආබාධ ඇත්තෙක් වෙයි. අභිචෛතසික වූ, මේ ආත්මභාවයේදීම සැප විහරණය පිණිස වූ, සිව් ධ්‍යාන කැමති සේ ලබන්නෙක්, අපහසුවකින් තොරව ලබන්නෙක්, දුෂ්කරතාවකින් තොරව ලබන්නෙක් වෙයි. ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, මේ ද්දිට්ඨධම්මයේදීම, තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, (ක්ලේශයන්ගෙන්) තොර වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය උපදවාගෙන වාසය කරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් සමණයන් අතර සමණු-සුඛුමාල වන්නේය.\n\nමහණෙනි, යමෙක් සමණයන් අතර සමණු-සුඛුමාල යැයි නිවැරදිව කියන්නේ නම්, මාමය මහණෙනි, සමණයන් අතර සමණු-සුඛුමාල යැයි නිවැරදිව කිව යුත්තේය. මහණෙනි, මා බොහෝ විට සිවුරු පරිභෝජනය කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. බොහෝ විට පිණ්ඩපාතය පරිභෝජනය කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. බොහෝ විට සේනාසන පරිභෝග කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. බොහෝ විට ගිලන්පස බෙහෙත් පිරිකර පරිභෝග කරන්නේ යැදුම් පිටමය, ස්වල්පයක් යැදුම් රහිතවය. තවද, මා යම් භික්ෂූන් සමඟ වාසය කරන්නේද, ඔවුහු මට බොහෝ විට ප්‍රිය මනාප ශාරීරික ක්‍රියාවලින් උපස්ථාන කරති, අප්‍රිය වූ ක්‍රියාවලින් ස්වල්පයකි. බොහෝ විට ප්‍රිය මනාප වචනයෙන් උපස්ථාන කරති, අප්‍රිය වූ වචනයෙන් ස්වල්පයකි. බොහෝ විට ප්‍රිය මනාප මනසින් උපස්ථාන කරති, අප්‍රිය වූ මනසින් ස්වල්පයකි. බොහෝ විට ප්‍රිය මනාප වූ උපහාර පුදති, අප්‍රිය වූ උපහාර ස්වල්පයකි. තවද, පිත නිසා හටගන්නා වූ හෝ සෙම නිසා හටගන්නා වූ හෝ වාතය නිසා හටගන්නා වූ හෝ ත්‍රිදෝෂ එක්වීමෙන් හටගන්නා වූ හෝ ඍතු විපර්යාසයෙන් හටගන්නා වූ හෝ විෂම විහාරයෙන් හටගන්නා වූ හෝ උපද්‍රව හේතුවෙන් හටගන්නා වූ හෝ කර්ම විපාකයෙන් හටගන්නා වූ හෝ යම් වේදනා ඇත්තේද, ඒවා මට බොහෝ සෙයින් නොහටගනියි. මා අල්ප ආබාධ ඇත්තෙක්මි. තවද, මා අභිචෛතසික වූ, මේ ආත්මභාවයේදීම සැප විහරණය පිණිස වූ, සිව් ධ්‍යාන කැමති සේ ලබන්නෙක්මි, අපහසුවකින් තොරව ලබන්නෙක්මි, දුෂ්කරතාවකින් තොරව ලබන්නෙක්මි. ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, මේ ද්දිට්ඨධම්මයේදීම, තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, (ක්ලේශයන්ගෙන්) තොර වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය උපදවාගෙන වාසය කරමි.\n\nමහණෙනි, යමෙක් සමණයන් අතර සමණු-සුඛුමාල යැයි නිවැරදිව කියන්නේ නම්, මාමය මහණෙනි, සමණයන් අතර සමණු-සුඛුමාල යැයි නිවැරදිව කිව යුත්තේය. මහණෙනි, ලෝකයේ සිටිනා, විද්‍යමාන වන මේ සතර දෙනා වූ පුද්ගලයෝ මොවුහුයි.",
      "paliTitle": "Puttasuttaṃ"
    },
    {
      "number": 88,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Samaṇamacalo, samaṇapuṇḍarīko, samaṇapadumo, samaṇesu samaṇasukhumālo. ‘‘Kathañca, bhikkhave, puggalo [pu. pa. 190 (thokaṃ visadisaṃ)] samaṇamacalo hoti? Idha, bhikkhave, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Evaṃ kho, bhikkhave, puggalo samaṇamacalo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapuṇḍarīko hoti? Idha bhikkhave, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā, rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Evaṃ kho, bhikkhave, puggalo samaṇapuṇḍarīko hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapadumo hoti? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Evaṃ kho, bhikkhave, puggalo samaṇapadumo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇesu samaṇasukhumālo hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, puggalo samaṇesu samaṇasukhumālo hoti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ.",
      "english": "“Monks, these four persons exist, are found in the world. Which four? The unshakable ascetic, the white-lotus ascetic, the red-lotus ascetic, and among ascetics, the most delicate ascetic.\n\n“And how, monks, is a person an unshakable ascetic? Here, monks, a monk, through the destruction of the three fetters, becomes a stream-enterer, one not subject to falling into lower states, assured, bound for full enlightenment. It is in this way, monks, that a person is an unshakable ascetic.\n\n“And how, monks, is a person a white-lotus ascetic? Here, monks, a monk, through the destruction of the three fetters, and with the attenuation of greed, hatred, and delusion, becomes a once-returner, returning to this world only one more time to make an end of suffering. It is in this way, monks, that a person is a white-lotus ascetic.\n\n“And how, monks, is a person a red-lotus ascetic? Here, monks, a monk, through the destruction of the five lower fetters, becomes a spontaneously reappearing being, one who attains final Nibbāna there, not returning from that world. It is in this way, monks, that a person is a red-lotus ascetic.\n\n“And how, monks, is a person, among ascetics, the most delicate ascetic? Here, monks, a monk, through the destruction of the taints, by his own direct knowledge, realizes and abides in the taintless liberation of mind and liberation through wisdom in this very life. It is in this way, monks, that a person, among ascetics, is the most delicate ascetic.\n\n“These, monks, are the four persons who exist, are found in the world.”",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. කවරහුද ඒ සතර දෙනා? චලනය නොවන ශ්‍රමණයෝද, පුන්ඩරීක නෙළුම් වැනි ශ්‍රමණයෝද, පදුම නෙළුම් වැනි ශ්‍රමණයෝද, ශ්‍රමණයන් අතර සියුම්තම ශ්‍රමණයෝද (යන මේ සතර දෙනාය).\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් චලනය නොවන ශ්‍රමණයෙක් වන්නේ? මහණෙනි, මේ ශාසනයෙහි මහණෙක් ත්‍රිවිධ සංයෝජන ප්‍රහීණ කිරීමෙන් සෝවාන් වූයේ, දුගතියට නොවැටෙන ස්වභාවය ඇත්තේ, නියත වශයෙන්ම සම්බෝධිය පරම කොට ඇත්තේ වෙයි. මහණෙනි, මෙලෙස පුද්ගලයෙක් චලනය නොවන ශ්‍රමණයෙක් වෙයි.\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් පුන්ඩරීක නෙළුම් වැනි ශ්‍රමණයෙක් වන්නේ? මහණෙනි, මේ ශාසනයෙහි මහණෙක් ත්‍රිවිධ සංයෝජන ප්‍රහීණ කිරීමෙන්ද, රාගය, ද්වේෂය, මෝහය යන මේවා තුනී වීමෙන්ද, සකදාගාමී වූයේ, එක්වරක්ම මේ ලෝකයට පැමිණ දුක කෙළවර කරයි. මහණෙනි, මෙලෙස පුද්ගලයෙක් පුන්ඩරීක නෙළුම් වැනි ශ්‍රමණයෙක් වෙයි.\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් පදුම නෙළුම් වැනි ශ්‍රමණයෙක් වන්නේ? මහණෙනි, මේ ශාසනයෙහි මහණෙක් අවර භාගීය සංයෝජන පහ ප්‍රහීණ කිරීමෙන්, ඕපපාතිකව උපදින සුළු වූයේ, එහිදී පිරිනිවන් පාන්නෙක් වූයේ, එම ලෝකයෙන් ආපසු නොපැමිණෙන ස්වභාවය ඇත්තේ වෙයි. මහණෙනි, මෙලෙස පුද්ගලයෙක් පදුම නෙළුම් වැනි ශ්‍රමණයෙක් වෙයි.\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් ශ්‍රමණයන් අතර සියුම්තම ශ්‍රමණයෙක් වන්නේ? මහණෙනි, මේ ශාසනයෙහි මහණෙක් ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තියද, ප්‍රඥාවිමුක්තියද, මේ ආත්මභාවයේදීම තෙමේම විශිෂ්ට ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොටගෙන, එයට ඇතුළුව වාසය කරයි. මහණෙනි, මෙලෙස පුද්ගලයෙක් ශ්‍රමණයන් අතර සියුම්තම ශ්‍රමණයෙක් වෙයි.\n\nමහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Saṃyojanasuttaṃ"
    },
    {
      "number": 89,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Samaṇamacalo, samaṇapuṇḍarīko, samaṇapadumo, samaṇesu samaṇasukhumālo. ‘‘Kathañca, bhikkhave, puggalo samaṇamacalo hoti? Idha, bhikkhave, bhikkhu sammādiṭṭhiko hoti, sammāsaṅkappo hoti, sammāvāco hoti, sammākammanto hoti, sammāājīvo hoti, sammāvāyāmo hoti, sammāsati [sammāsatī (sī. ka.)] hoti, sammāsamādhi [sammāsamādhī (sī. ka.)] hoti. Evaṃ kho, bhikkhave, puggalo samaṇamacalo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapuṇḍarīko hoti? Idha, bhikkhave, bhikkhu sammādiṭṭhiko hoti, sammāsaṅkappo hoti, sammāvāco hoti, sammākammanto hoti, sammāājīvo hoti, sammāvāyāmo hoti, sammāsati hoti, sammāsamādhi hoti, sammāñāṇī hoti, sammāvimutti [sammāvimuttī (sī. ka.)] hoti, no ca kho aṭṭha vimokkhe kāyena phusitvā viharati. Evaṃ kho, bhikkhave, puggalo samaṇapuṇḍarīko hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapadumo hoti? Idha, bhikkhave, bhikkhu sammādiṭṭhiko hoti…pe… sammāvimutti hoti, aṭṭha ca vimokkhe kāyena phusitvā viharati. Evaṃ kho, bhikkhave, puggalo samaṇapadumo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇesu samaṇasukhumālo hoti? Idha, bhikkhave, bhikkhu yācitova bahulaṃ cīvaraṃ paribhuñjati, appaṃ ayācito…pe… yañhi taṃ, bhikkhave, sammā vadamāno vadeyya samaṇesu samaṇasukhumāloti, mameva taṃ, bhikkhave, sammā vadamāno vadeyya samaṇesu samaṇasukhumāloti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ.",
      "english": "Bhikkhus, there are these four individuals existing, found in the world. Which four? The Immovable Ascetic, the White Lotus Ascetic, the Red Lotus Ascetic, and the Most Delicate Ascetic among ascetics.\n\nAnd how, bhikkhus, is an individual an Immovable Ascetic? Here, bhikkhus, a bhikkhu is endowed with Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, and Right Concentration. In this way, bhikkhus, an individual is an Immovable Ascetic.\n\nAnd how, bhikkhus, is an individual a White Lotus Ascetic? Here, bhikkhus, a bhikkhu is endowed with Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, and Right Liberation, but he does not dwell having experienced the eight liberations directly with the body. In this way, bhikkhus, an individual is a White Lotus Ascetic.\n\nAnd how, bhikkhus, is an individual a Red Lotus Ascetic? Here, bhikkhus, a bhikkhu is endowed with Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, and Right Liberation, and he dwells having experienced the eight liberations directly with the body. In this way, bhikkhus, an individual is a Red Lotus Ascetic.\n\nAnd how, bhikkhus, is an individual the Most Delicate Ascetic among ascetics? Here, bhikkhus, a bhikkhu consumes robes mostly when requested, rarely when not requested. If, bhikkhus, one were to rightly say of someone that he is the Most Delicate Ascetic among ascetics, it is of me that one would rightly say, \"He is the Most Delicate Ascetic among ascetics.\" These, bhikkhus, are the four individuals existing, found in the world.",
      "sinhala": "මහණෙනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි සිටිති, පවතිති. කවරහුද ඒ සතර දෙනා? ශ්‍රමණාචල තැනැත්තාය, ශ්‍රමණපුණ්ඩරීක තැනැත්තාය, ශ්‍රමණපදුම තැනැත්තාය, ශ්‍රමණයන් අතරින් ශ්‍රමණසුඛුමාල තැනැත්තාය.\n\nමහණෙනි, පුද්ගලයෙක් ශ්‍රමණාචල වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව සම්මා දිට්ඨියෙන් යුක්ත වෙයි, සම්මා සංකප්පයෙන් යුක්ත වෙයි, සම්මා වාචාවෙන් යුක්ත වෙයි, සම්මා කම්මන්තයෙන් යුක්ත වෙයි, සම්මා ආජීවයෙන් යුක්ත වෙයි, සම්මා වායාමයෙන් යුක්ත වෙයි, සම්මා සතියෙන් යුක්ත වෙයි, සම්මා සමාධියෙන් යුක්ත වෙයි. මහණෙනි, පුද්ගලයෙක් ශ්‍රමණාචල වන්නේ මෙසේය.\n\nමහණෙනි, පුද්ගලයෙක් ශ්‍රමණපුණ්ඩරීක වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව සම්මා දිට්ඨියෙන් යුක්ත වෙයි, සම්මා සංකප්පයෙන් යුක්ත වෙයි, සම්මා වාචාවෙන් යුක්ත වෙයි, සම්මා කම්මන්තයෙන් යුක්ත වෙයි, සම්මා ආජීවයෙන් යුක්ත වෙයි, සම්මා වායාමයෙන් යුක්ත වෙයි, සම්මා සතියෙන් යුක්ත වෙයි, සම්මා සමාධියෙන් යුක්ත වෙයි, සම්මා ඥානයෙන් යුක්ත වෙයි, සම්මා විමුක්තියෙන් යුක්ත වෙයි. එහෙත් අෂ්ට විමෝක්ෂයන් කයින් ස්පර්ශ කරමින් වාසය නොකරයි. මහණෙනි, පුද්ගලයෙක් ශ්‍රමණපුණ්ඩරීක වන්නේ මෙසේය.\n\nමහණෙනි, පුද්ගලයෙක් ශ්‍රමණපදුම වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව සම්මා දිට්ඨියෙන් යුක්ත වෙයි, සම්මා සංකප්පයෙන් යුක්ත වෙයි, සම්මා වාචාවෙන් යුක්ත වෙයි, සම්මා කම්මන්තයෙන් යුක්ත වෙයි, සම්මා ආජීවයෙන් යුක්ත වෙයි, සම්මා වායාමයෙන් යුක්ත වෙයි, සම්මා සතියෙන් යුක්ත වෙයි, සම්මා සමාධියෙන් යුක්ත වෙයි, සම්මා ඥානයෙන් යුක්ත වෙයි, සම්මා විමුක්තියෙන් යුක්ත වෙයි, අෂ්ට විමෝක්ෂයන්ද කයින් ස්පර්ශ කරමින් වාසය කරයි. මහණෙනි, පුද්ගලයෙක් ශ්‍රමණපදුම වන්නේ මෙසේය.\n\nමහණෙනි, පුද්ගලයෙක් ශ්‍රමණයන් අතරින් ශ්‍රමණසුඛුමාල වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව බොහෝ සෙයින් සිව්රු, පිණ්ඩපාත, සේනාසන සහ ගිලන්පස බෙහෙත් පිරිකර යන මෙකී සියල්ල අනුන් විසින් අයදීමෙන් ලබාගෙන පරිභෝග කරයි. අනුන් විසින් නොඅයදීමෙන් ලබන්නේ ස්වල්පයකි. යමෙක්, මහණෙනි, 'ශ්‍රමණයන් අතරින් ශ්‍රමණසුඛුමාලයා' යැයි නිවැරදිව කියන්නේ නම්, ඒ මා ගැනමයි, මහණෙනි, නිවැරදිව 'ශ්‍රමණයන් අතරින් ශ්‍රමණසුඛුමාලයා' යැයි කියන්නේ. මහණෙනි, මේ සතර පුද්ගලයෝ ලෝකයෙහි සිටිති, පවතිති.",
      "paliTitle": "Sammādiṭṭhisuttaṃ"
    },
    {
      "number": 90,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Samaṇamacalo, samaṇapuṇḍarīko, samaṇapadumo, samaṇesu samaṇasukhumālo. ‘‘Kathañca, bhikkhave, puggalo samaṇamacalo hoti? Idha, bhikkhave, bhikkhu sekho hoti appattamānaso, anuttaraṃ yogakkhemaṃ patthayamāno viharati. Evaṃ kho, bhikkhave, puggalo samaṇamacalo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapuṇḍarīko hoti? Idha, bhikkhave, bhikkhu pañcasu upādānakkhandhesu udayabbayānupassī viharati – ‘iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā…pe… iti saññā…pe… iti saṅkhārā…pe… iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti; no ca kho aṭṭha vimokkhe kāyena phusitvā viharati. Evaṃ kho, bhikkhave, puggalo samaṇapuṇḍarīko hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇapadumo hoti? Idha, bhikkhave, bhikkhu pañcasu upādānakkhandhesu udayabbayānupassī viharati – ‘iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā…pe… iti saññā…pe… iti saṅkhārā…pe… iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti; aṭṭha ca vimokkhe kāyena phusitvā viharati. Evaṃ kho, bhikkhave, puggalo samaṇapadumo hoti. ‘‘Kathañca, bhikkhave, puggalo samaṇesu samaṇasukhumālo hoti? Idha, bhikkhave, bhikkhu yācitova bahulaṃ cīvaraṃ paribhuñjati, appaṃ ayācito…pe… mameva taṃ, bhikkhave, sammā vadamāno vadeyya samaṇesu samaṇasukhumāloti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Dasamaṃ. ",
      "english": "“Monks, these four individuals are present, existing in the world. Which four? The unshakeable recluse, the lotus-like recluse, the water-lily-like recluse, and the most refined recluse among recluses.\n\n“And how, monks, is an individual an unshakeable recluse? Here, monks, a monk is a learner, whose mind has not yet reached its goal, dwelling, aspiring for the unsurpassed security from bondage. It is in this way, monks, that an individual is an unshakeable recluse.\n\n“And how, monks, is an individual a lotus-like recluse? Here, monks, a monk dwells observing the rise and fall of the five aggregates of clinging, thus: ‘This is form, this is the origination of form, this is the cessation of form; this is feeling, this is the origination of feeling, this is the cessation of feeling; this is perception, this is the origination of perception, this is the cessation of perception; this is mental formations, this is the origination of mental formations, this is the cessation of mental formations; this is consciousness, this is the origination of consciousness, this is the cessation of consciousness.’ Yet, he does not dwell having touched the eight liberations with the body. It is in this way, monks, that an individual is a lotus-like recluse.\n\n“And how, monks, is an individual a water-lily-like recluse? Here, monks, a monk dwells observing the rise and fall of the five aggregates of clinging, thus: ‘This is form, this is the origination of form, this is the cessation of form; this is feeling, this is the origination of feeling, this is the cessation of feeling; this is perception, this is the origination of perception, this is the cessation of perception; this is mental formations, this is the origination of mental formations, this is the cessation of mental formations; this is consciousness, this is the origination of consciousness, this is the cessation of consciousness.’ And he does dwell having touched the eight liberations with the body. It is in this way, monks, that an individual is a water-lily-like recluse.\n\n“And how, monks, is an individual the most refined recluse among recluses? Here, monks, a monk frequently partakes of robes only when asked, rarely when not asked; he frequently partakes of almsfood only when asked, rarely when not asked; he frequently partakes of lodgings only when asked, rarely when not asked; he frequently partakes of medicinal requisites for the sick only when asked, rarely when not asked. Rightly speaking, monks, one might call him the most refined recluse among recluses. These, monks, are the four individuals who exist and are found in the world.”",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිත්, විද්‍යමාන වෙත්. කවර සතර දෙනෙක්ද? අචල වූ ශ්‍රමණයෙක්, පුණ්ඩරීක ශ්‍රමණයෙක්, පදුම ශ්‍රමණයෙක්, ශ්‍රමණයන් අතර සුකුමාල ශ්‍රමණයෙක්.\n\nමහණෙනි, පුද්ගලයෙක් අචල ශ්‍රමණයෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් ශික්ෂාමාර්ගයේ සිටින, (අර්හත්වය නමැති) සිය මනසෙහි අරමුණට නොපැමිණි, අනුත්තර වූ යෝගක්ෂේමයට (නිවනට) පැතීමෙන් වාසය කරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් අචල ශ්‍රමණයෙක් වේ.\n\nමහණෙනි, පුද්ගලයෙක් පුණ්ඩරීක ශ්‍රමණයෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් පඤ්ච උපාදානස්කන්ධයන්ගේ උදයානුපස්සී හා වයානුපස්සී වශයෙන් වාසය කරයි – ‘මෙය රූපයයි, මෙය රූපයේ හටගැනීමයි, මෙය රූපයේ නැතිවීමයි; මේ වේදනාවයි... මේ සංඥාවයි... මේ සංස්කාරයෝය... මේ විඤ්ඤාණයයි, මෙය විඤ්ඤාණයේ හටගැනීමයි, මෙය විඤ්ඤාණයේ නැතිවීමයි’යි; නමුත් අෂ්ට විමෝක්ෂයන් කාය සාක්ෂාත් කරගෙන වාසය නොකරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් පුණ්ඩරීක ශ්‍රමණයෙක් වේ.\n\nමහණෙනි, පුද්ගලයෙක් පදුම ශ්‍රමණයෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් පඤ්ච උපාදානස්කන්ධයන්ගේ උදයානුපස්සී හා වයානුපස්සී වශයෙන් වාසය කරයි – ‘මෙය රූපයයි, මෙය රූපයේ හටගැනීමයි, මෙය රූපයේ නැතිවීමයි; මේ වේදනාවයි... මේ සංඥාවයි... මේ සංස්කාරයෝය... මේ විඤ්ඤාණයයි, මෙය විඤ්ඤාණයේ හටගැනීමයි, මෙය විඤ්ඤාණයේ නැතිවීමයි’යි; අෂ්ට විමෝක්ෂයන් කාය සාක්ෂාත් කරගෙන වාසය කරයි. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් පදුම ශ්‍රමණයෙක් වේ.\n\nමහණෙනි, පුද්ගලයෙක් ශ්‍රමණයන් අතර සුකුමාල ශ්‍රමණයෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් බොහෝ විට අනුන්ගේ විමසීමෙන් ලැබෙන සිවුරු පරිභෝජනය කරයි, එසේ නොවිමසා ලැබෙන සිවුරු අල්පය... මහණෙනි, මේ පුද්ගලයා ශ්‍රමණයන් අතර සුකුමාල ශ්‍රමණයෙක් යැයි නිවැරදිව කියන්නේ නම් මම කියමි. මහණෙනි, මේ සතර දෙනා වනාහි ලෝකයෙහි සිටින, විද්‍යමාන වන පුද්ගලයෝය.",
      "paliTitle": "Khandhasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Macalavaggo catuttho. Tassuddānaṃ – Pāṇātipāto ca musā, avaṇṇakodhatamoṇatā; Putto saṃyojanañceva, diṭṭhi khandhena te dasāti.",
    "english": "",
    "sinhala": ""
  }
}