{
  "id": "an4.14",
  "title": {
    "pali": "Puggalavaggo",
    "english": "Chapter on Individuals",
    "sinhala": "පුද්ගල වග්ගය"
  },
  "sections": [
    {
      "number": 131,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekaccassa puggalassa orambhāgiyāni saṃyojanāni appahīnāni honti, upapattipaṭilābhiyāni saṃyojanāni appahīnāni honti, bhavapaṭilābhiyāni saṃyojanāni appahīnāni honti. ‘‘Idha pana, bhikkhave, ekaccassa puggalassa orambhāgiyāni saṃyojanāni pahīnāni honti, upapattipaṭilābhiyāni saṃyojanāni appahīnāni honti, bhavapaṭilābhiyāni saṃyojanāni appahīnāni honti. ‘‘Idha pana, bhikkhave, ekaccassa puggalassa orambhāgiyāni saṃyojanāni pahīnāni honti, upapattipaṭilābhiyāni saṃyojanāni pahīnāni honti, bhavapaṭilābhiyāni saṃyojanāni appahīnāni honti. ‘‘Idha pana, bhikkhave, ekaccassa puggalassa orambhāgiyāni saṃyojanāni pahīnāni honti, upapattipaṭilābhiyāni saṃyojanāni pahīnāni honti, bhavapaṭilābhiyāni saṃyojanāni pahīnāni honti. ‘‘Katamassa, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni appahīnāni, upapattipaṭilābhiyāni saṃyojanāni appahīnāni, bhavapaṭilābhiyāni saṃyojanāni appahīnāni? Sakadāgāmissa. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni appahīnāni, upapattipaṭilābhiyāni saṃyojanāni appahīnāni, bhavapaṭilābhiyāni saṃyojanāni appahīnāni. ‘‘Katamassa, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni pahīnāni, upapattipaṭilābhiyāni saṃyojanāni appahīnāni, bhavapaṭilābhiyāni saṃyojanāni appahīnāni? Uddhaṃsotassa akaniṭṭhagāmino. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni pahīnāni, upapattipaṭilābhiyāni saṃyojanāni appahīnāni, bhavapaṭilābhiyāni saṃyojanāni appahīnāni. ‘‘Katamassa, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni pahīnāni, upapattipaṭilābhiyāni saṃyojanāni pahīnāni, bhavapaṭilābhiyāni saṃyojanāni appahīnāni? Antarāparinibbāyissa. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni pahīnāni, upapattipaṭilābhiyāni saṃyojanāni pahīnāni, bhavapaṭilābhiyāni saṃyojanāni appahīnāni. ‘‘Katamassa, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni pahīnāni, upapattipaṭilābhiyāni saṃyojanāni pahīnāni, bhavapaṭilābhiyāni saṃyojanāni pahīnāni? Arahato. Imassa kho, bhikkhave, puggalassa orambhāgiyāni saṃyojanāni pahīnāni, upapattipaṭilābhiyāni saṃyojanāni pahīnāni, bhavapaṭilābhiyāni saṃyojanāni pahīnāni. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Paṭhamaṃ.",
      "english": "“Monks, these four types of individuals exist and are found in the world. Which four?\n\nHere, monks, for a certain individual, the lower fetters are not abandoned, the fetters that procure renewed existence are not abandoned, and the fetters that procure further becoming are not abandoned.\n\nBut here, monks, for a certain individual, the lower fetters are abandoned, the fetters that procure renewed existence are not abandoned, and the fetters that procure further becoming are not abandoned.\n\nBut here, monks, for a certain individual, the lower fetters are abandoned, the fetters that procure renewed existence are abandoned, and the fetters that procure further becoming are not abandoned.\n\nBut here, monks, for a certain individual, the lower fetters are abandoned, the fetters that procure renewed existence are abandoned, and the fetters that procure further becoming are abandoned.\n\nMonks, for which individual are the lower fetters not abandoned, the fetters that procure renewed existence not abandoned, and the fetters that procure further becoming not abandoned? For the Once-returner. Indeed, monks, for this individual, the lower fetters are not abandoned, the fetters that procure renewed existence are not abandoned, and the fetters that procure further becoming are not abandoned.\n\nMonks, for which individual are the lower fetters abandoned, the fetters that procure renewed existence not abandoned, and the fetters that procure further becoming not abandoned? For the one bound for the Pure Abodes, heading upstream to Akaniṭṭha. Indeed, monks, for this individual, the lower fetters are abandoned, the fetters that procure renewed existence are not abandoned, and the fetters that procure further becoming are not abandoned.\n\nMonks, for which individual are the lower fetters abandoned, the fetters that procure renewed existence abandoned, and the fetters that procure further becoming not abandoned? For the one attaining Nibbāna in the interim. Indeed, monks, for this individual, the lower fetters are abandoned, the fetters that procure renewed existence are abandoned, and the fetters that procure further becoming are not abandoned.\n\nMonks, for which individual are the lower fetters abandoned, the fetters that procure renewed existence abandoned, and the fetters that procure further becoming abandoned? For the Arahat. Indeed, monks, for this individual, the lower fetters are abandoned, the fetters that procure renewed existence are abandoned, and the fetters that procure further becoming are abandoned.\n\nMonks, these are the four types of individuals who exist and are found in the world.",
      "sinhala": "මහණෙනි, ලෝකයෙහි පවත්නා, දැකිය හැකි පුද්ගලයන් සතර දෙනෙක් සිටිති. ඒ සතර දෙනා කවරහුද?\n\nමහණෙනි, මෙහි ඇතැම් පුද්ගලයෙකුට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී නැත. නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී නැත. භවය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී නැත.\n\nතවද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙකුට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත. එහෙත් නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත. භවය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී නැත.\n\nතවද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙකුට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත. නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත. එහෙත් භවය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත.\n\nතවද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙකුට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත. නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත. භවය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත.\n\nමහණෙනි, කවර නම් පුද්ගලයෙකුටද කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී නැත්තේ, නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත්තේ, භවය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත්තේ? ඒ සකදාගාමී පුද්ගලයාටය. මහණෙනි, මේ පුද්ගලයාට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී නැත. නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී නැත. භවය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී නැත.\n\nමහණෙනි, කවර නම් පුද්ගලයෙකුටද කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත්තේ, එහෙත් නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත්තේ, භවය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත්තේ? ඒ ඌර්ධවංසෝත අකනිට්ඨගාමී පුද්ගලයාටය. මහණෙනි, මේ පුද්ගලයාට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත. එහෙත් නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී නැත. භවය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී නැත.\n\nමහණෙනි, කවර නම් පුද්ගලයෙකුටද කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත්තේ, නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත්තේ, එහෙත් භවය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත්තේ? ඒ අන්තරාපරිනිබ්බායී පුද්ගලයාටය. මහණෙනි, මේ පුද්ගලයාට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත. නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත. එහෙත් භවය ලැබීමට හේතුවන සංයෝජන ප්‍රහීණ වී නැත.\n\nමහණෙනි, කවර නම් පුද්ගලයෙකුටද කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත්තේ, නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත්තේ, භවය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත්තේ? ඒ රහත් පුද්ගලයාටය. මහණෙනි, මේ පුද්ගලයාට කාමාවචර භවයට බැඳ තබන ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී ඇත. නැවත උත්පත්තිය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත. භවය ලැබීමට හේතුවන සංයෝජනද ප්‍රහීණ වී ඇත.\n\nමහණෙනි, ලෝකයෙහි පවත්නා, දැකිය හැකි පුද්ගලයන් මේ සතර දෙනාය.",
      "paliTitle": "Saṃyojanasuttaṃ",
      "englishTitle": "Discourse on the Fetters",
      "sinhalaTitle": "සංයෝජන සූත‍්‍රය"
    },
    {
      "number": 132,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Yuttappaṭibhāno, no muttappaṭibhāno; muttappaṭibhāno, no yuttappaṭibhāno; yuttappaṭibhāno ca muttappaṭibhāno ca; neva yuttappaṭibhāno na muttappaṭibhāno – ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti [pu. pa. 152 ādayo]. Dutiyaṃ.",
      "english": "Monks, these four types of individuals are found, exist in the world. Which four? One whose exposition is apt but not fluent; one whose exposition is fluent but not apt; one whose exposition is both apt and fluent; and one whose exposition is neither apt nor fluent. These, Monks, are the four types of individuals that are found, exist in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයන් සතර දෙනෙක් ලෝකයෙහි සිටිති, පවතී. ඒ සතර දෙනා කවරහුද? සුදුසු ප්‍රතිභානයෙන් යුක්ත වූවෙක්, චතුර ප්‍රතිභානයෙන් යුක්ත නොවූවෙක්; චතුර ප්‍රතිභානයෙන් යුක්ත වූවෙක්, සුදුසු ප්‍රතිභානයෙන් යුක්ත නොවූවෙක්; සුදුසු ප්‍රතිභානයෙන් ද, චතුර ප්‍රතිභානයෙන් ද යන දෙකෙන්ම යුක්ත වූවෙක්; සුදුසු ප්‍රතිභානයෙන් ද, චතුර ප්‍රතිභානයෙන් ද යන දෙකෙන්ම යුක්ත නොවූවෙක් – මහණෙනි, මේ පුද්ගලයන් සතර දෙනා ලෝකයෙහි සිටිති, පවතී.",
      "paliTitle": "Paṭibhānasuttaṃ",
      "englishTitle": "Discourse on Ready Wit",
      "sinhalaTitle": "ප්‍රතිභාන සූත්‍රය"
    },
    {
      "number": 133,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Ugghaṭitaññū, vipañcitaññū, neyyo, padaparamo – ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti [pu. pa. 152 ādayo]. Tatiyaṃ.",
      "english": "Monks, these four types of individuals exist and are found in the world. Which four? The one who comprehends the teaching after merely a hint, the one who comprehends the teaching after a detailed exposition, the trainable one, and the one for whom the ultimate understanding is merely the words – these four types of individuals, Monks, exist and are found in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලොවෙහි සිටිති, පවතින්නාහ. කවරහුද ඒ සතර දෙනා?\n\nවහා ධර්මාවබෝධය ලබන තැනැත්තා, විස්තර වශයෙන් දේශනා කළ කල්හි ධර්මාවබෝධය ලබන තැනැත්තා, මාර්ගෝපදේශය හා පුහුණුව තුළින් ධර්මාවබෝධයට පත් වන තැනැත්තා, සහ ධර්මයෙහි ගැඹුරු අර්ථය අවබෝධ කරගැනීමට නොහැකිව, වචනයෙහිම නතර වන තැනැත්තා යන මේ පුද්ගලයෝ සතර දෙනා ලොවෙහි සිටිති, පවතින්නාහ.",
      "paliTitle": "Ugghaṭitaññūsuttaṃ",
      "englishTitle": "Discourse on Immediate Understanding",
      "sinhalaTitle": "උග්ඝටිතඤ්ඤූ සූත්‍රය"
    },
    {
      "number": 134,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Uṭṭhānaphalūpajīvī na kammaphalūpajīvī, kammaphalūpajīvī na uṭṭhānaphalūpajīvī, uṭṭhānaphalūpajīvī ceva kammaphalūpajīvī ca, neva uṭṭhānaphalūpajīvī na kammaphalūpajīvī – ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti [pu. pa. 167]. Catutthaṃ.",
      "english": "Monks, these four types of individuals exist, are found in the world. Which are these four? One who subsists on the fruit of their own present exertion, but not on the fruit of past kamma; one who subsists on the fruit of past kamma, but not on the fruit of their own present exertion; one who subsists on both the fruit of their own present exertion and the fruit of past kamma; and one who subsists on neither the fruit of their own present exertion nor the fruit of past kamma. Monks, these are the four types of individuals who exist, who are found in the world.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිති, පවතින්නාහ. කවරහුද ඒ සතර දෙනා? උත්සාහයේ ඵලයෙන් යැපෙන්නා මිස කර්මයේ ඵලයෙන් නොයැපෙන්නා, කර්මයේ ඵලයෙන් යැපෙන්නා මිස උත්සාහයේ ඵලයෙන් නොයැපෙන්නා, උත්සාහයේ ඵලයෙන්ද, කර්මයේ ඵලයෙන්ද යන දෙකින්ම යැපෙන්නා, උත්සාහයේ ඵලයෙන්ද නොයැපෙන්නා, කර්මයේ ඵලයෙන්ද නොයැපෙන්නා යන මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි සිටිති, පවතින්නාහ.",
      "paliTitle": "Uṭṭhānaphalasuttaṃ",
      "englishTitle": "The Discourse on the Fruit of Exertion",
      "sinhalaTitle": "උත්ථාන ඵල සූත්‍‍රය"
    },
    {
      "number": 135,
      "pali": "‘‘Cattārome, bhikkhave, puggalā [pu. pa. 144 ādayo] santo saṃvijjamānā lokasmiṃ. Katame cattāro? Sāvajjo, vajjabahulo, appavajjo, anavajjo. ‘‘Kathañca, bhikkhave, puggalo sāvajjo hoti? Idha, bhikkhave, ekacco puggalo sāvajjena kāyakammena samannāgato hoti, sāvajjena vacīkammena samannāgato hoti, sāvajjena manokammena samannāgato hoti. Evaṃ kho, bhikkhave, puggalo sāvajjo hoti. ‘‘Kathañca, bhikkhave, puggalo vajjabahulo hoti? Idha, bhikkhave, ekacco puggalo sāvajjena bahulaṃ kāyakammena samannāgato hoti, appaṃ anavajjena; sāvajjena bahulaṃ vacīkammena samannāgato hoti, appaṃ anavajjena; sāvajjena bahulaṃ manokammena samannāgato hoti, appaṃ anavajjena. Evaṃ kho, bhikkhave, puggalo vajjabahulo hoti. ‘‘Kathañca, bhikkhave, puggalo appavajjo hoti? Idha, bhikkhave, ekacco puggalo anavajjena bahulaṃ kāyakammena samannāgato hoti, appaṃ sāvajjena; anavajjena bahulaṃ vacīkammena samannāgato hoti, appaṃ sāvajjena; anavajjena bahulaṃ manokammena samannāgato hoti, appaṃ sāvajjena. Evaṃ kho, bhikkhave, puggalo appavajjo hoti. ‘‘Kathañca, bhikkhave, puggalo anavajjo hoti? Idha, bhikkhave, ekacco puggalo anavajjena kāyakammena samannāgato hoti, anavajjena vacīkammena samannāgato hoti, anavajjena manokammena samannāgato hoti. Evaṃ kho, bhikkhave, puggalo anavajjo hoti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Pañcamaṃ.",
      "english": "“Monks, these four types of individuals are found existing in the world. Which four? The blameworthy, the predominantly blameworthy, the predominantly blameless, and the blameless.\n\nAnd how, monks, is a person blameworthy? Here, monks, a certain individual is endowed with blameworthy bodily action, endowed with blameworthy verbal action, and endowed with blameworthy mental action. In this way, monks, a person is blameworthy.\n\nAnd how, monks, is a person predominantly blameworthy? Here, monks, a certain individual is largely endowed with blameworthy bodily action and little with blameless; largely endowed with blameworthy verbal action and little with blameless; largely endowed with blameworthy mental action and little with blameless. In this way, monks, a person is predominantly blameworthy.\n\nAnd how, monks, is a person predominantly blameless? Here, monks, a certain individual is largely endowed with blameless bodily action and little with blameworthy; largely endowed with blameless verbal action and little with blameworthy; largely endowed with blameless mental action and little with blameworthy. In this way, monks, a person is predominantly blameless.\n\nAnd how, monks, is a person blameless? Here, monks, a certain individual is endowed with blameless bodily action, endowed with blameless verbal action, and endowed with blameless mental action. In this way, monks, a person is blameless.\n\nThese four types of individuals, monks, are found existing in the world.”",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි පවතිනවා, විද්‍යමාන වෙනවා. ඒ සතර දෙනා කවරහුද? වරද සහිත පුද්ගලයා, වරද බහුල පුද්ගලයා, වරද ස්වල්ප වූ පුද්ගලයා, වරද රහිත පුද්ගලයා.\n\nමහණෙනි, පුද්ගලයෙක් වරද සහිත වන්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් වරද සහිත කය කර්මයෙන් යුක්ත වෙනවා, වරද සහිත වචී කර්මයෙන් යුක්ත වෙනවා, වරද සහිත මනෝ කර්මයෙන් යුක්ත වෙනවා. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් වරද සහිත පුද්ගලයෙක් වෙනවා.\n\nමහණෙනි, පුද්ගලයෙක් වරද බහුල වන්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් වරද සහිත කය කර්මයෙන් බහුලව යුක්ත වෙනවා, වරද රහිත කය කර්මයෙන් ස්වල්ප වශයෙන් යුක්ත වෙනවා. වරද සහිත වචී කර්මයෙන් බහුලව යුක්ත වෙනවා, වරද රහිත වචී කර්මයෙන් ස්වල්ප වශයෙන් යුක්ත වෙනවා. වරද සහිත මනෝ කර්මයෙන් බහුලව යුක්ත වෙනවා, වරද රහිත මනෝ කර්මයෙන් ස්වල්ප වශයෙන් යුක්ත වෙනවා. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් වරද බහුල පුද්ගලයෙක් වෙනවා.\n\nමහණෙනි, පුද්ගලයෙක් වරද ස්වල්ප වූ පුද්ගලයෙක් වන්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් වරද රහිත කය කර්මයෙන් බහුලව යුක්ත වෙනවා, වරද සහිත කය කර්මයෙන් ස්වල්ප වශයෙන් යුක්ත වෙනවා. වරද රහිත වචී කර්මයෙන් බහුලව යුක්ත වෙනවා, වරද සහිත වචී කර්මයෙන් ස්වල්ප වශයෙන් යුක්ත වෙනවා. වරද රහිත මනෝ කර්මයෙන් බහුලව යුක්ත වෙනවා, වරද සහිත මනෝ කර්මයෙන් ස්වල්ප වශයෙන් යුක්ත වෙනවා. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් වරද ස්වල්ප වූ පුද්ගලයෙක් වෙනවා.\n\nමහණෙනි, පුද්ගලයෙක් වරද රහිත පුද්ගලයෙක් වන්නේ කෙසේද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් වරද රහිත කය කර්මයෙන් යුක්ත වෙනවා, වරද රහිත වචී කර්මයෙන් යුක්ත වෙනවා, වරද රහිත මනෝ කර්මයෙන් යුක්ත වෙනවා. මහණෙනි, මේ අයුරින් පුද්ගලයෙක් වරද රහිත පුද්ගලයෙක් වෙනවා.\n\nමහණෙනි, මේ සතර දෙනාම ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝය.",
      "paliTitle": "Sāvajjasuttaṃ",
      "englishTitle": "Discourse on Blameworthiness",
      "sinhalaTitle": "සාවද්‍ය සූත්‍රය"
    },
    {
      "number": 136,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo sīlesu na paripūrakārī hoti, samādhismiṃ na paripūrakārī, paññāya na paripūrakārī. ‘‘Idha pana, bhikkhave, ekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ na paripūrakārī, paññāya na paripūrakārī. ‘‘Idha pana, bhikkhave, ekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ paripūrakārī, paññāya na paripūrakārī. ‘‘Idha pana, bhikkhave, ekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ paripūrakārī, paññāya paripūrakārī. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Chaṭṭhaṃ.",
      "english": "Monastics, these four types of individuals exist and are found in the world. Which four?\n\nHere, monastics, a certain individual is not fully developed in moral conduct, not fully developed in concentration, and not fully developed in wisdom.\n\nBut here, monastics, a certain individual is fully developed in moral conduct, but not fully developed in concentration, and not fully developed in wisdom.\n\nBut here, monastics, a certain individual is fully developed in moral conduct and fully developed in concentration, but not fully developed in wisdom.\n\nBut here, monastics, a certain individual is fully developed in moral conduct, fully developed in concentration, and fully developed in wisdom.\n\nIndeed, monastics, these four types of individuals exist and are found in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි පවතිනවාත්, විද්‍යමාන වනවාත් ඇත. කවරහුද ඒ සතර දෙනා?\n\nමහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් සිල් පිරීම්හි සම්පූර්ණ කරන්නෙක් නොවෙයි, සමාධිය පිරීම්හි සම්පූර්ණ කරන්නෙක් නොවෙයි, ප්‍රඥාව පිරීම්හි සම්පූර්ණ කරන්නෙක් නොවෙයි.\n\nමහණෙනි, එහෙත් මෙහිලා එක්තරා පුද්ගලයෙක් සිල් පිරීම්හි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධිය පිරීම්හි සම්පූර්ණ කරන්නෙක් නොවෙයි, ප්‍රඥාව පිරීම්හි සම්පූර්ණ කරන්නෙක් නොවෙයි.\n\nමහණෙනි, එහෙත් මෙහිලා එක්තරා පුද්ගලයෙක් සිල් පිරීම්හි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධිය පිරීම්හි සම්පූර්ණ කරන්නෙක් වෙයි, ප්‍රඥාව පිරීම්හි සම්පූර්ණ කරන්නෙක් නොවෙයි.\n\nමහණෙනි, එහෙත් මෙහිලා එක්තරා පුද්ගලයෙක් සිල් පිරීම්හි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධිය පිරීම්හි සම්පූර්ණ කරන්නෙක් වෙයි, ප්‍රඥාව පිරීම්හි සම්පූර්ණ කරන්නෙක් වෙයි.\n\nමහණෙනි, මේ පුද්ගලයෝ සතර දෙනාම ලෝකයෙහි පවතිනවාත්, විද්‍යමාන වනවාත් ඇත.",
      "paliTitle": "Paṭhamasīlasuttaṃ",
      "englishTitle": "First Virtue Sutta",
      "sinhalaTitle": "පළමු සීල සූත‍්‍රය"
    },
    {
      "number": 137,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo na sīlagaru hoti na sīlādhipateyyo, na samādhigaru hoti na samādhādhipateyyo, na paññāgaru hoti na paññādhipateyyo. ‘‘Idha pana, bhikkhave, ekacco puggalo sīlagaru hoti sīlādhipateyyo, na samādhigaru hoti na samādhādhipateyyo, na paññāgaru hoti na paññādhipateyyo. ‘‘Idha pana, bhikkhave, ekacco puggalo sīlagaru hoti sīlādhipateyyo, samādhigaru hoti samādhādhipateyyo, na paññāgaru hoti na paññādhipateyyo. ‘‘Idha pana, bhikkhave, ekacco puggalo sīlagaru hoti sīlādhipateyyo, samādhigaru hoti samādhādhipateyyo, paññāgaru hoti paññādhipateyyo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Sattamaṃ.",
      "english": "Monastics, these four types of individuals are found existing in the world. Which four?\n\nHere, monastics, a certain individual does not value ethical conduct, nor does he make it his dominant influence; he does not value concentration, nor does he make it his dominant influence; he does not value wisdom, nor does he make it his dominant influence.\n\nBut here, monastics, a certain individual values ethical conduct and makes it his dominant influence; however, he does not value concentration, nor does he make it his dominant influence; he does not value wisdom, nor does he make it his dominant influence.\n\nBut here, monastics, a certain individual values ethical conduct and makes it his dominant influence, and he values concentration and makes it his dominant influence; however, he does not value wisdom, nor does he make it his dominant influence.\n\nBut here, monastics, a certain individual values ethical conduct and makes it his dominant influence, he values concentration and makes it his dominant influence, and he values wisdom and makes it his dominant influence.\n\nIndeed, monastics, these four types of individuals are found existing in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයන් සතර දෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. ඒ සතර දෙනා කවරහුද?\n\nමහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් සිල්හි ගරු නොකරයි, සිල්හි ආධිපත්‍යයක් නොදක්වයි. සමාධියෙහි ගරු නොකරයි, සමාධියෙහි ආධිපත්‍යයක් නොදක්වයි. ප්‍රඥාවෙහි ගරු නොකරයි, ප්‍රඥාවෙහි ආධිපත්‍යයක් නොදක්වයි.\n\nනැවතත් මහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් සිල්හි ගරු කරන්නේය, සිල්හි ආධිපත්‍යයක් දක්වන්නේය. එහෙත් සමාධියෙහි ගරු නොකරයි, සමාධියෙහි ආධිපත්‍යයක් නොදක්වයි. ප්‍රඥාවෙහි ගරු නොකරයි, ප්‍රඥාවෙහි ආධිපත්‍යයක් නොදක්වයි.\n\nනැවතත් මහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් සිල්හි ගරු කරන්නේය, සිල්හි ආධිපත්‍යයක් දක්වන්නේය. සමාධියෙහි ගරු කරන්නේය, සමාධියෙහි ආධිපත්‍යයක් දක්වන්නේය. එහෙත් ප්‍රඥාවෙහි ගරු නොකරයි, ප්‍රඥාවෙහි ආධිපත්‍යයක් නොදක්වයි.\n\nනැවතත් මහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් සිල්හි ගරු කරන්නේය, සිල්හි ආධිපත්‍යයක් දක්වන්නේය. සමාධියෙහි ගරු කරන්නේය, සමාධියෙහි ආධිපත්‍යයක් දක්වන්නේය. ප්‍රඥාවෙහි ගරු කරන්නේය, ප්‍රඥාවෙහි ආධිපත්‍යයක් දක්වන්නේය.\n\nමහණෙනි, මේ පුද්ගලයන් සතර දෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Dutiyasīlasuttaṃ",
      "englishTitle": "The Second Discourse on Moral Conduct",
      "sinhalaTitle": "දෙවන සීල සූත්‍\\u200Dරය"
    },
    {
      "number": 138,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Nikaṭṭhakāyo anikaṭṭhacitto, anikaṭṭhakāyo nikaṭṭhacitto, anikaṭṭhakāyo ca anikaṭṭhacitto ca, nikaṭṭhakāyo ca nikaṭṭhacitto ca. ‘‘Kathañca, bhikkhave, puggalo nikaṭṭhakāyo hoti anikaṭṭhacitto? Idha, bhikkhave, ekacco puggalo araññavanapatthāni [araññe vanapatthāni (sī. pī.)] pantāni senāsanāni paṭisevati. So tattha kāmavitakkampi vitakketi byāpādavitakkampi vitakketi vihiṃsāvitakkampi vitakketi. Evaṃ kho, bhikkhave, puggalo nikaṭṭhakāyo hoti anikaṭṭhacitto. ‘‘Kathañca, bhikkhave, puggalo anikaṭṭhakāyo hoti nikaṭṭhacitto? Idha, bhikkhave, ekacco puggalo naheva kho araññavanapatthāni pantāni senāsanāni paṭisevati. So tattha nekkhammavitakkampi vitakketi abyāpādavitakkampi vitakketi avihiṃsāvitakkampi vitakketi. Evaṃ kho, bhikkhave, puggalo anikaṭṭhakāyo hoti nikaṭṭhacitto. ‘‘Kathañca, bhikkhave, puggalo anikaṭṭhakāyo ca hoti anikaṭṭhacitto ca? Idha, bhikkhave, ekacco puggalo naheva kho araññavanapatthāni pantāni senāsanāni paṭisevati. So tattha kāmavitakkampi vitakketi byāpādavitakkampi vitakketi vihiṃsāvitakkampi vitakketi. Evaṃ kho, bhikkhave, puggalo anikaṭṭhakāyo ca hoti anikaṭṭhacitto ca. ‘‘Kathañca, bhikkhave, puggalo nikaṭṭhakāyo ca hoti nikaṭṭhacitto ca? Idha, bhikkhave, ekacco puggalo araññavanapatthāni pantāni senāsanāni paṭisevati. So tattha nekkhammavitakkampi vitakketi abyāpādavitakkampi vitakketi avihiṃsāvitakkampi vitakketi. Evaṃ kho, bhikkhave, puggalo nikaṭṭhakāyo ca hoti nikaṭṭhacitto ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ.",
      "english": "“Monks, these four types of individuals exist and are found in the world. Which four? One whose body is withdrawn but whose mind is not withdrawn; one whose body is not withdrawn but whose mind is withdrawn; one whose body is not withdrawn and whose mind is not withdrawn; and one whose body is withdrawn and whose mind is withdrawn.\n\n“And how, monks, is an individual one whose body is withdrawn but whose mind is not withdrawn? Here, monks, a certain individual resorts to remote abodes in forests and wildernesses. But there, they harbor thoughts of sensual desire, thoughts of ill-will, and thoughts of harming. In this way, monks, an individual is one whose body is withdrawn but whose mind is not withdrawn.\n\n“And how, monks, is an individual one whose body is not withdrawn but whose mind is withdrawn? Here, monks, a certain individual does not resort to remote abodes in forests and wildernesses. But there, they harbor thoughts of renunciation, thoughts of non-ill-will, and thoughts of non-harming. In this way, monks, an individual is one whose body is not withdrawn but whose mind is withdrawn.\n\n“And how, monks, is an individual one whose body is not withdrawn and whose mind is not withdrawn? Here, monks, a certain individual does not resort to remote abodes in forests and wildernesses. And there, they harbor thoughts of sensual desire, thoughts of ill-will, and thoughts of harming. In this way, monks, an individual is one whose body is not withdrawn and whose mind is not withdrawn.\n\n“And how, monks, is an individual one whose body is withdrawn and whose mind is withdrawn? Here, monks, a certain individual resorts to remote abodes in forests and wildernesses. And there, they harbor thoughts of renunciation, thoughts of non-ill-will, and thoughts of non-harming. In this way, monks, an individual is one whose body is withdrawn and whose mind is withdrawn. These, monks, are the four types of individuals who exist and are found in the world.”",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. කවරහුද ඒ සතර දෙනා? ශරීරයෙන් හුදකලා වූ, සිතින් හුදකලා නොවූ පුද්ගලයා; ශරීරයෙන් හුදකලා නොවූ, සිතින් හුදකලා වූ පුද්ගලයා; ශරීරයෙන්ද හුදකලා නොවූ, සිතින්ද හුදකලා නොවූ පුද්ගලයා; ශරීරයෙන්ද හුදකලා වූ, සිතින්ද හුදකලා වූ පුද්ගලයායි.\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් ශරීරයෙන් හුදකලා වූවෙක්, සිතින් හුදකලා නොවූවෙක් වන්නේ? මහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් දුරස්ථ වූ, ආරණ්‍ය සේනාසන, වනගත සේනාසන පරිභෝග කරයි. හෙතෙම එහිදී කාම විතර්කයද විතර්ක කරයි, ව්‍යාපාද විතර්කයද විතර්ක කරයි, විහිංසා විතර්කයද විතර්ක කරයි. මහණෙනි, මෙසේ පුද්ගලයෙක් ශරීරයෙන් හුදකලා වූවෙක්, සිතින් හුදකලා නොවූවෙක් වේ.\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් ශරීරයෙන් හුදකලා නොවූවෙක්, සිතින් හුදකලා වූවෙක් වන්නේ? මහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් දුරස්ථ වූ, ආරණ්‍ය සේනාසන, වනගත සේනාසන පරිභෝග නොකරයි. හෙතෙම එහිදී නෛෂ්ක්‍ර‍ම්‍ය විතර්කයද විතර්ක කරයි, අව්‍යාපාද විතර්කයද විතර්ක කරයි, අවිහිංසා විතර්කයද විතර්ක කරයි. මහණෙනි, මෙසේ පුද්ගලයෙක් ශරීරයෙන් හුදකලා නොවූවෙක්, සිතින් හුදකලා වූවෙක් වේ.\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් ශරීරයෙන්ද හuදකලා නොවූවෙක්, සිතින්ද හුදකලා නොවූවෙක් වන්නේ? මහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් දුරස්ථ වූ, ආරණ්‍ය සේනාසන, වනගත සේනාසන පරිභෝග නොකරයි. හෙතෙම එහිදී කාම විතර්කයද විතර්ක කරයි, ව්‍යාපාද විතර්කයද විතර්ක කරයි, විහිංසා විතර්කයද විතර්ක කරයි. මහණෙනි, මෙසේ පුද්ගලයෙක් ශරීරයෙන්ද හුදකලා නොවූවෙක්, සිතින්ද හුදකලා නොවූවෙක් වේ.\n\nමහණෙනි, කෙසේද පුද්ගලයෙක් ශරීරයෙන්ද හුදකලා වූවෙක්, සිතින්ද හුදකලා වූවෙක් වන්නේ? මහණෙනි, මෙහිලා යම්කිසි පුද්ගලයෙක් දුරස්ථ වූ, ආරණ්‍ය සේනාසන, වනගත සේනාසන පරිභෝග කරයි. හෙතෙම එහිදී නෛෂ්ක්‍ර‍ම්‍ය විතර්කයද විතර්ක කරයි, අව්‍යාපාද විතර්කයද විතර්ක කරයි, අවිහිංසා විතර්කයද විතර්ක කරයි. මහණෙනි, මෙසේ පුද්ගලයෙක් ශරීරයෙන්ද හුදකලා වූවෙක්, සිතින්ද හුදකලා වූවෙක් වේ. මහණෙනි, මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Nikaṭṭhasuttaṃ",
      "englishTitle": "The Discourse on Closeness",
      "sinhalaTitle": "නිකට්‍ඨ සූත්‍රය"
    },
    {
      "number": 139,
      "pali": "‘‘Cattārome, bhikkhave, dhammakathikā. Katame cattāro? Idha, bhikkhave, ekacco dhammakathiko appañca bhāsati asahitañca; parisā cassa [parisā ca (sī. syā. kaṃ. pī.) pu. pa. 156] na kusalā hoti sahitāsahitassa. Evarūpo, bhikkhave, dhammakathiko evarūpāya parisāya dhammakathikotveva saṅkhaṃ gacchati. ‘‘Idha pana, bhikkhave, ekacco dhammakathiko appañca bhāsati sahitañca; parisā cassa kusalā hoti sahitāsahitassa. Evarūpo, bhikkhave, dhammakathiko evarūpāya parisāya dhammakathikotveva saṅkhaṃ gacchati. ‘‘Idha pana, bhikkhave, ekacco dhammakathiko bahuñca bhāsati asahitañca; parisā cassa na kusalā hoti sahitāsahitassa. Evarūpo, bhikkhave, dhammakathiko evarūpāya parisāya dhammakathikotveva saṅkhaṃ gacchati. ‘‘Idha pana, bhikkhave, ekacco dhammakathiko bahuñca bhāsati sahitañca; parisā cassa kusalā hoti sahitāsahitassa. Evarūpo, bhikkhave, dhammakathiko evarūpāya parisāya dhammakathikotveva saṅkhaṃ gacchati. Ime kho, bhikkhave, cattāro dhammakathikā’’ti. Navamaṃ.",
      "english": "Monastics, there are these four types of Dhamma expounders. Which four?\n\nHere, monastics, a certain Dhamma expounder speaks little and what is not conducive to the Dhamma; and his audience is not skilled in discerning what is conducive to the Dhamma and what is not. Such a Dhamma expounder, monastics, is simply reckoned as a Dhamma expounder by such an audience.\n\nHowever, here, monastics, a certain Dhamma expounder speaks little and what is conducive to the Dhamma; and his audience is skilled in discerning what is conducive to the Dhamma and what is not. Such a Dhamma expounder, monastics, is simply reckoned as a Dhamma expounder by such an audience.\n\nHowever, here, monastics, a certain Dhamma expounder speaks much and what is not conducive to the Dhamma; and his audience is not skilled in discerning what is conducive to the Dhamma and what is not. Such a Dhamma expounder, monastics, is simply reckoned as a Dhamma expounder by such an audience.\n\nHowever, here, monastics, a certain Dhamma expounder speaks much and what is conducive to the Dhamma; and his audience is skilled in discerning what is conducive to the Dhamma and what is not. Such a Dhamma expounder, monastics, is simply reckoned as a Dhamma expounder by such an audience.\n\nThese, monastics, are the four types of Dhamma expounders.",
      "sinhala": "භික්ෂූනි, මේ ධර්‍ම කථිකයෝ සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද?\n\nභික්ෂූනි, මෙහිලා ඇතැම් ධර්‍ම කථිකයෙක් අල්ප වූද, අර්ථයට සම්බන්ධ නො වූද කරුණු කතා කරයි. අර්ථයට සම්බන්ධ හා සම්බන්ධ නො වූ කරුණු ගැන ඔහුගේ පිරිස දක්ෂ නොවෙයි. භික්ෂූනි, මෙබඳු ධර්‍ම කථිකයෙක් මෙබඳු පිරිසක් අතරෙහි ධර්‍ම කථිකයෙක් ලෙසින්ම ගණන් ගැනේ.\n\nභික්ෂූනි, තවද මෙහිලා ඇතැම් ධර්‍ම කථිකයෙක් අල්ප වූද, අර්ථයට සම්බන්ධ වූද කරුණු කතා කරයි. අර්ථයට සම්බන්ධ හා සම්බන්ධ නො වූ කරුණු ගැන ඔහුගේ පිරිස දක්ෂ වෙයි. භික්ෂූනි, මෙබඳු ධර්‍ම කථිකයෙක් මෙබඳු පිරිසක් අතරෙහි ධර්‍ම කථිකයෙක් ලෙසින්ම ගණන් ගැනේ.\n\nභික්ෂූනි, තවද මෙහිලා ඇතැම් ධර්‍ම කථිකයෙක් බහුල වූද, අර්ථයට සම්බන්ධ නො වූද කරුණු කතා කරයි. අර්ථයට සම්බන්ධ හා සම්බන්ධ නො වූ කරුණු ගැන ඔහුගේ පිරිස දක්ෂ නොවෙයි. භික්ෂූනි, මෙබඳු ධර්‍ම කථිකයෙක් මෙබඳු පිරිසක් අතරෙහි ධර්‍ම කථිකයෙක් ලෙසින්ම ගණන් ගැනේ.\n\nභික්ෂූනි, තවද මෙහිලා ඇතැම් ධර්‍ම කථිකයෙක් බහුල වූද, අර්ථයට සම්බන්ධ වූද කරුණු කතා කරයි. අර්ථයට සම්බන්ධ හා සම්බන්ධ නො වූ කරුණු ගැන ඔහුගේ පිරිස දක්ෂ වෙයි. භික්ෂූනි, මෙබඳු ධර්‍ම කථිකයෙක් මෙබඳු පිරිසක් අතරෙහි ධර්‍ම කථිකයෙක් ලෙසින්ම ගණන් ගැනේ.\n\nභික්ෂූනි, මේ සතර දෙනා ධර්‍ම කථිකයෝ වෙති.",
      "paliTitle": "Dhammakathikasuttaṃ",
      "englishTitle": "Discourse on the Dhamma Teacher",
      "sinhalaTitle": "ධර්‍මකථික සූත්‍රය"
    },
    {
      "number": 140,
      "pali": "‘‘Cattārome, bhikkhave, vādī. Katame cattāro? Atthi, bhikkhave, vādī atthato pariyādānaṃ gacchati, no byañjanato; atthi, bhikkhave, vādī byañjanato pariyādānaṃ gacchati, no atthato; atthi, bhikkhave, vādī atthato ca byañjanato ca pariyādānaṃ gacchati; atthi, bhikkhave, vādī nevatthato no byañjanato pariyādānaṃ gacchati. Ime kho, bhikkhave, cattāro vādī. Aṭṭhānametaṃ, bhikkhave, anavakāso yaṃ catūhi paṭisambhidāhi samannāgato [samannāgato bhikkhu (sī. syā. kaṃ.)] atthato vā byañjanato vā pariyādānaṃ gaccheyyā’’ti. Dasamaṃ. ",
      "english": "Monks, there are these four types of expounders. Which four? Monks, there is an expounder whose exposition of the meaning becomes exhausted, but not of the phrasing. Monks, there is an expounder whose exposition of the phrasing becomes exhausted, but not of the meaning. Monks, there is an expounder whose exposition of both meaning and phrasing becomes exhausted. Monks, there is an expounder whose exposition of neither meaning nor phrasing becomes exhausted. These, monks, are the four types of expounders. Monks, it is impossible, there is no occasion, for a monk endowed with the four analytical knowledges to have his exposition of meaning or phrasing become exhausted.",
      "sinhala": "මහණෙනි, මේ වාදීහු සිව්දෙනෙකි. ඒ සිව්දෙනා කවරහුද? මහණෙනි, ඇතැම් වාදීහු අර්ථයෙන් අවසනට යති, ව්‍යංජනයෙන් අවසනට නොයති; මහණෙනි, ඇතැම් වාදීහු ව්‍යංජනයෙන් අවසනට යති, අර්ථයෙන් අවසනට නොයති; මහණෙනි, ඇතැම් වාදීහු අර්ථයෙන්ද ව්‍යංජනයෙන්ද අවසනට යති; මහණෙනි, ඇතැම් වාදීහු අර්ථයෙන්ද ව්‍යංජනයෙන්ද අවසනට නොයති. මහණෙනි, මේ සිව්දෙන වාදීහු වෙති. මහණෙනි, සිව් පිළිසිඹියාවන්ගෙන් සමන්වාගත වූ තැනැත්තෙකු අර්ථයෙන් හෝ ව්‍යංජනයෙන් හෝ (තමන් දත් දේ) අවසනට පැමිණවීම අභව්‍යයකි, එයට අවකාශයක් නැත.",
      "paliTitle": "Vādīsuttaṃ",
      "englishTitle": "The Debater's Discourse",
      "sinhalaTitle": "වාදී සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Puggalavaggo catuttho. Tassuddānaṃ – Saṃyojanaṃ paṭibhāno, ugghaṭitaññu uṭṭhānaṃ; Sāvajjo dve ca sīlāni, nikaṭṭha dhamma vādī cāti.",
    "english": "Fourth Chapter on Persons: Summary",
    "sinhala": "සිවුවන පුද්ගල වග්ගය"
  }
}