{
  "id": "an4.20",
  "title": {
    "pali": "Mahāvaggo",
    "english": "The Great Section",
    "sinhala": "මහාවග්ගය"
  },
  "sections": [
    {
      "number": 191,
      "pali": "‘‘Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ cattāro ānisaṃsā pāṭikaṅkhā. Katame cattāro? Idha, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati [muṭṭhassatī (sī.)] kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha sukhino dhammapadā plavanti [pilapanti (sī. syā. kaṃ. pī.)]. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ paṭhamo ānisaṃso pāṭikaṅkho. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti; api ca kho bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippameva visesagāmī hoti. Seyyathāpi, bhikkhave, puriso kusalo bherisaddassa. So addhānamaggappaṭipanno bherisaddaṃ suṇeyya. Tassa na heva kho assa kaṅkhā vā vimati vā – ‘bherisaddo nu kho, na nu kho bherisaddo’ti! Atha kho bherisaddotveva niṭṭhaṃ gaccheyya. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti; api ca kho bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ dutiyo ānisaṃso pāṭikaṅkho. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti; api ca kho devaputto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Seyyathāpi, bhikkhave, puriso kusalo saṅkhasaddassa. So addhānamaggappaṭipanno saṅkhasaddaṃ suṇeyya. Tassa na heva kho assa kaṅkhā vā vimati vā – ‘saṅkhasaddo nu kho, na nu kho saṅkhasaddo’ti! Atha kho saṅkhasaddotveva niṭṭhaṃ gaccheyya. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti; api ca kho devaputto devaparisāyaṃ dhammaṃ deseti. Tassa evaṃ hoti – ‘ayaṃ vā so dhammavinayo, yatthāhaṃ pubbe brahmacariyaṃ acari’nti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ tatiyo ānisaṃso pāṭikaṅkho. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti, napi devaputto devaparisāyaṃ dhammaṃ deseti; api ca kho opapātiko opapātikaṃ sāreti – ‘sarasi tvaṃ, mārisa, sarasi tvaṃ, mārisa, yattha mayaṃ pubbe brahmacariyaṃ acarimhā’ti. So evamāha – ‘sarāmi, mārisa, sarāmi, mārisā’ti. Dandho, bhikkhave, satuppādo; atha so satto khippaṃyeva visesagāmī hoti. Seyyathāpi, bhikkhave, dve sahāyakā sahapaṃsukīḷikā [sahapaṃsukīḷakā (syā. kaṃ.)]. Te kadāci karahaci aññamaññaṃ samāgaccheyyuṃ. Añño pana [samāgaccheyyuṃ, tamenaṃ (sī. syā. kaṃ. pī.)] sahāyako sahāyakaṃ evaṃ vadeyya – ‘idampi, samma, sarasi, idampi, samma, sarasī’ti. So evaṃ vadeyya – ‘sarāmi, samma, sarāmi, sammā’ti. Evamevaṃ kho, bhikkhave, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Tassa te dhammā sotānugatā honti, vacasā paricitā, manasānupekkhitā, diṭṭhiyā suppaṭividdhā. So muṭṭhassati kālaṃ kurumāno aññataraṃ devanikāyaṃ upapajjati. Tassa tattha na heva kho sukhino dhammapadā plavanti, napi bhikkhu iddhimā cetovasippatto devaparisāyaṃ dhammaṃ deseti, napi devaputto devaparisāyaṃ dhammaṃ deseti; api ca kho opapātiko opapātikaṃ sāreti – ‘sarasi tvaṃ, mārisa, sarasi tvaṃ, mārisa, yattha mayaṃ pubbe brahmacariyaṃ acarimhā’ti. So evamāha – ‘sarāmi, mārisa, sarāmi, mārisā’ti. Dandho, bhikkhave, satuppādo; atha kho so satto khippaṃyeva visesagāmī hoti. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ, diṭṭhiyā suppaṭividdhānaṃ ayaṃ catuttho ānisaṃso pāṭikaṅkho. Sotānugatānaṃ, bhikkhave, dhammānaṃ, vacasā paricitānaṃ, manasānupekkhitānaṃ diṭṭhiyā suppaṭividdhānaṃ ime cattāro ānisaṃsā pāṭikaṅkhā’’ti. Paṭhamaṃ.",
      "english": "Monks, for those teachings that have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding, four benefits may be expected. What are these four? Here, monks, a monk learns the Dhamma – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'thus said', birth story, astonishing phenomenon, and question-and-answer. For him, those teachings have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding. When he passes away with mindfulness lost, he is reborn in a certain company of devas. There, the phrases of the Dhamma come to mind readily and pleasantly for him. Monks, the arising of mindfulness there is slow; yet, that being swiftly attains distinction. Monks, this is the first benefit to be expected from those teachings that have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding.\n\nFurthermore, monks, a monk learns the Dhamma – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'thus said', birth story, astonishing phenomenon, and question-and-answer. For him, those teachings have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding. When he passes away with mindfulness lost, he is reborn in a certain company of devas. There, the phrases of the Dhamma do not come to mind readily and pleasantly for him; however, the monk, being endowed with psychic power and mastery of the mind, teaches the Dhamma to the assembly of devas. It occurs to him, 'This is that very Dhamma-Vinaya in which I previously lived the holy life.' Monks, the arising of mindfulness there is slow; yet, that being swiftly attains distinction. Just as, monks, a man skilled in the sound of a drum, when he is travelling along a road, might hear the sound of a drum. He would have no doubt or perplexity, 'Is this the sound of a drum, or is it not the sound of a drum?' Rather, he would conclude, 'This is indeed the sound of a drum.' In the same way, monks, a monk learns the Dhamma – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'thus said', birth story, astonishing phenomenon, and question-and-answer. For him, those teachings have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding. When he passes away with mindfulness lost, he is reborn in a certain company of devas. There, the phrases of the Dhamma do not come to mind readily and pleasantly for him; however, the monk, being endowed with psychic power and mastery of the mind, teaches the Dhamma to the assembly of devas. It occurs to him, 'This is that very Dhamma-Vinaya in which I previously lived the holy life.' Monks, the arising of mindfulness there is slow; yet, that being swiftly attains distinction. Monks, this is the second benefit to be expected from those teachings that have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding.\n\nFurthermore, monks, a monk learns the Dhamma – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'thus said', birth story, astonishing phenomenon, and question-and-answer. For him, those teachings have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding. When he passes away with mindfulness lost, he is reborn in a certain company of devas. There, the phrases of the Dhamma do not come to mind readily and pleasantly for him, nor does the monk, being endowed with psychic power and mastery of the mind, teach the Dhamma to the assembly of devas; however, a deva-son teaches the Dhamma to the assembly of devas. It occurs to him, 'This is that very Dhamma-Vinaya in which I previously lived the holy life.' Monks, the arising of mindfulness there is slow; yet, that being swiftly attains distinction. Just as, monks, a man skilled in the sound of a conch shell, when he is travelling along a road, might hear the sound of a conch shell. He would have no doubt or perplexity, 'Is this the sound of a conch shell, or is it not the sound of a conch shell?' Rather, he would conclude, 'This is indeed the sound of a conch shell.' In the same way, monks, a monk learns the Dhamma – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'thus said', birth story, astonishing phenomenon, and question-and-answer. For him, those teachings have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding. When he passes away with mindfulness lost, he is reborn in a certain company of devas. There, the phrases of the Dhamma do not come to mind readily and pleasantly for him, nor does the monk, being endowed with psychic power and mastery of the mind, teach the Dhamma to the assembly of devas; however, a deva-son teaches the Dhamma to the assembly of devas. It occurs to him, 'This is that very Dhamma-Vinaya in which I previously lived the holy life.' Monks, the arising of mindfulness there is slow; yet, that being swiftly attains distinction. Monks, this is the third benefit to be expected from those teachings that have been absorbed through attentive listening, made familiar through verbal recitation, contemplated through mental reflection, and thoroughly penetrated through understanding.\n\nFurthermore, monks, a monk learns the Dhamma—discourses, mixed prose and verse, expositions, verses, inspired utterances, 'thus-saids', birth stories, wonderful phenomena, and question-and-answer texts. For him, those teachings are deeply ingrained by hearing, familiarized by recitation, contemplated mentally, and thoroughly penetrated by understanding. With mindfulness forgotten, he passes away and reappears in a certain company of devas. There, for him, the words of the Dhamma do not easily arise. Nor does a monk, accomplished in psychic power and mastery of mind, teach the Dhamma in that assembly of devas. Nor does a devaputta teach the Dhamma in that assembly of devas. But rather, a spontaneously arisen being reminds another spontaneously arisen being, saying: ‘Friend, do you remember? Friend, do you remember where we formerly practiced the holy life?’ He then says: ‘I remember, friend, I remember.’ Slow, monks, is the arising of mindfulness, yet that being swiftly attains distinction. Just as, monks, two childhood playmates might meet each other again at some time or another. One friend might say to the other friend: ‘Friend, do you remember this? Friend, do you remember this?’ He then might say: ‘I remember, friend, I remember.’ In the same way, monks, a monk learns the Dhamma—discourses, mixed prose and verse, expositions, verses, inspired utterances, 'thus-saids', birth stories, wonderful phenomena, and question-and-answer texts. For him, those teachings are deeply ingrained by hearing, familiarized by recitation, contemplated mentally, and thoroughly penetrated by understanding. With mindfulness forgotten, he passes away and reappears in a certain company of devas. There, for him, the words of the Dhamma do not easily arise. Nor does a monk, accomplished in psychic power and mastery of mind, teach the Dhamma in that assembly of devas. Nor does a devaputta teach the Dhamma in that assembly of devas. But rather, a spontaneously arisen being reminds another spontaneously arisen being, saying: ‘Friend, do you remember? Friend, do you remember where we formerly practiced the holy life?’ He then says: ‘I remember, friend, I remember.’ Slow, monks, is the arising of mindfulness, yet that being swiftly attains distinction.\n\nMonks, for teachings that are deeply ingrained by hearing, familiarized by recitation, contemplated mentally, and thoroughly penetrated by understanding, this fourth benefit is to be expected. Monks, for teachings that are deeply ingrained by hearing, familiarized by recitation, contemplated mentally, and thoroughly penetrated by understanding, these four benefits are to be expected.",
      "sinhala": "මහණෙනි, ශ්‍රවණය කොට ගත්, වචනයෙන් මනාකොට පුරුදු කළ, මනසින් මනාකොට විමසා බැලූ, ප්‍රඥාවෙන් මනාකොට විනිවිද දැකීමට සමත් වූ ධර්මයන්ට බලාපොරොත්තු විය යුතු ආනිසංස සතරක් ඇත. ඒ සතර කුමක්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව සූත්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන ධර්මය ඉගෙන ගනියි. ඔහුට ඒ ධර්මයන් ශ්‍රවණය කොට ගත්, වචනයෙන් පුරුදු කළ, මනසින් විමසූ, ප්‍රඥාවෙන් විනිවිද දැකීමට සමත් වූ ධර්මයන් වේ. ඔහු සිහිය නැතිව කාලක්‍රියා කරන්නේ යම්කිසි දෙව් ලොවක උපදී. ඔහුට එහිදී පහසුවෙන්ම ධර්ම පද සිහියට නැඟේ. මහණෙනි, සිහිය පහළවීම මන්දගාමී වුවද, එහෙත් ඒ සත්වයා ඉක්මනින්ම විශිෂ්ටත්වයට පැමිණෙන්නේය. මහණෙනි, ශ්‍රවණය කොට ගත්, වචනයෙන් මනාකොට පුරුදු කළ, මනසින් මනාකොට විමසා බැලූ, ප්‍රඥාවෙන් මනාකොට විනිවිද දැකීමට සමත් වූ ධර්මයන්ගේ මේ පළමුවන ආනිසංසය බලාපොරොත්තු විය යුතු යි.\n\nමහණෙනි, තවද, භික්ෂුව සූත්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන ධර්මය ඉගෙන ගනියි. ඔහුට ඒ ධර්මයන් ශ්‍රවණය කොට ගත්, වචනයෙන් පුරුදු කළ, මනසින් විමසූ, ප්‍රඥාවෙන් විනිවිද දැකීමට සමත් වූ ධර්මයන් වේ. ඔහු සිහිය නැතිව කාලක්‍රියා කරන්නේ යම්කිසි දෙව් ලොවක උපදී. ඔහුට එහිදී පහසුවෙන් ධර්ම පද සිහියට නැඟෙන්නේ නැත. එහෙත් ඒ භික්ෂුව ඍද්ධිමත් බවට පත් වී, චිත්ත වශීභාවයට පැමිණ, දෙව් පිරිස අතර ධර්මය දේශනා කරයි. ඔහුට මෙසේ සිතේ: 'මේ අර ධර්ම විනයමයි, යම් තැනක මම පෙර බඹසර හැසිරුණේ' කියා. මහණෙනි, සිහිය පහළවීම මන්දගාමී වුවද, එහෙත් ඒ සත්වයා ඉක්මනින්ම විශිෂ්ටත්වයට පැමිණෙන්නේය.\n\nමහණෙනි, යම්සේ බෙර හඬට දක්ෂ පුද්ගලයෙක් ගමනක යෙදෙද්දී බෙර හඬක් අසන්නේ නම්, ඔහුට 'මෙය බෙර හඬක්ද, බෙර හඬක් නොවේදැ'යි සැකයක් හෝ විමතියක් ඇති නොවන්නේ ය. එහෙත් එය බෙර හඬක්ම යැයි නිශ්චය කරන්නේ ය. එපරිද්දෙන්ම, මහණෙනි, භික්ෂුව සූත්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන ධර්මය ඉගෙන ගනියි. ඔහුට ඒ ධර්මයන් ශ්‍රවණය කොට ගත්, වචනයෙන් පුරුදු කළ, මනසින් විමසූ, ප්‍රඥාවෙන් විනිවිද දැකීමට සමත් වූ ධර්මයන් වේ. ඔහු සිහිය නැතිව කාලක්‍රියා කරන්නේ යම්කිසි දෙව් ලොවක උපදී. ඔහුට එහිදී පහසුවෙන් ධර්ම පද සිහියට නැඟෙන්නේ නැත. එහෙත් ඒ භික්ෂුව ඍද්ධිමත් බවට පත් වී, චිත්ත වශීභාවයට පැමිණ, දෙව් පිරිස අතර ධර්මය දේශනා කරයි. ඔහුට මෙසේ සිතේ: 'මේ අර ධර්ම විනයමයි, යම් තැනක මම පෙර බඹසර හැසිරුණේ' කියා. මහණෙනි, සිහිය පහළවීම මන්දගාමී වුවද, එහෙත් ඒ සත්වයා ඉක්මනින්ම විශිෂ්ටත්වයට පැමිණෙන්නේය. මහණෙනි, ශ්‍රවණය කොට ගත්, වචනයෙන් මනාකොට පුරුදු කළ, මනසින් මනාකොට විමසා බැලූ, ප්‍රඥාවෙන් මනාකොට විනිවිද දැකීමට සමත් වූ ධර්මයන්ගේ මේ දෙවෙනි ආනිසංසය බලාපොරොත්තු විය යුතු යි.\n\nමහණෙනි, තවද, භික්ෂුව සූත්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන ධර්මය ඉගෙන ගනියි. ඔහුට ඒ ධර්මයන් ශ්‍රවණය කොට ගත්, වචනයෙන් පුරුදු කළ, මනසින් විමසූ, ප්‍රඥාවෙන් විනිවිද දැකීමට සමත් වූ ධර්මයන් වේ. ඔහු සිහිය නැතිව කාලක්‍රියා කරන්නේ යම්කිසි දෙව් ලොවක උපදී. ඔහුට එහිදී පහසුවෙන් ධර්ම පද සිහියට නැඟෙන්නේ නැත. එමෙන්ම භික්ෂුව ඍද්ධිමත් බවට පත් වී, චිත්ත වශීභාවයට පැමිණ, දෙව් පිරිස අතර ධර්මය දේශනා කරන්නේ ද නැත. එහෙත් දෙව් පුතෙක් දෙව් පිරිස අතර ධර්මය දේශනා කරයි. ඔහුට මෙසේ සිතේ: 'මේ අර ධර්ම විනයමයි, යම් තැනක මම පෙර බඹසර හැසිරුණේ' කියා. මහණෙනි, සිහිය පහළවීම මන්දගාමී වුවද, එහෙත් ඒ සත්වයා ඉක්මනින්ම විශිෂ්ටත්වයට පැමිණෙන්නේය.\n\nමහණෙනි, යම්සේ ශංඛනාදයට දක්ෂ පුද්ගලයෙක් ගමනක යෙදෙද්දී ශංඛනාදයක් අසන්නේ නම්, ඔහුට 'මෙය ශංඛනාදයක්ද, ශංඛනාදයක් නොවේදැ'යි සැකයක් හෝ විමතියක් ඇති නොවන්නේ ය. එහෙත් එය ශංඛනාදයක්ම යැයි නිශ්චය කරන්නේ ය. එපරිද්දෙන්ම, මහණෙනි, භික්ෂුව සූත්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන ධර්මය ඉගෙන ගනියි. ඔහුට ඒ ධර්මයන් ශ්‍රවණය කොට ගත්, වචනයෙන් පුරුදු කළ, මනසින් විමසූ, ප්‍රඥාවෙන් විනිවිද දැකීමට සමත් වූ ධර්මයන් වේ. ඔහු සිහිය නැතිව කාලක්‍රියා කරන්නේ යම්කිසි දෙව් ලොවක උපදී. ඔහුට එහිදී පහසුවෙන් ධර්ම පද සිහියට නැඟෙන්නේ නැත. එමෙන්ම භික්ෂුව ඍද්ධිමත් බවට පත් වී, චිත්ත වශීභාවයට පැමිණ, දෙව් පිරිස අතර ධර්මය දේශනා කරන්නේ ද නැත. එහෙත් දෙව් පුතෙක් දෙව් පිරිස අතර ධර්මය දේශනා කරයි. ඔහුට මෙසේ සිතේ: 'මේ අර ධර්ම විනයමයි, යම් තැනක මම පෙර බඹසර හැසිරුණේ' කියා. මහණෙනි, සිහිය පහළවීම මන්දගාමී වුවද, එහෙත් ඒ සත්වයා ඉක්මනින්ම විශිෂ්ටත්වයට පැමිණෙන්නේය. මහණෙනි, ශ්‍රවණය කොට ගත්, වචනයෙන් මනාකොට පුරුදු කළ, මනසින් මනාකොට විමසා බැලූ, ප්‍රඥාවෙන් මනාකොට විනිවිද දැකීමට සමත් වූ ධර්මයන්ගේ මේ තෙවෙනි ආනිසංසය බලාපොරොත්තු විය යුතු යි.\n\nතවද, මහණෙනි, භික්ෂුවක් සූත්‍රය, ගේය්‍යය, වෛය්‍යාකරණය, ගාථාව, උදානය, ඉතිවුත්තකය, ජාතකය, අබ්භූතධර්මය, වේදල්ලය යන නව අංගයෙන් යුත් ධර්මය ප්‍රගුණ කරයි. ඔහුට ඒ ධර්මයන් හොඳින් ශ්‍රවණය කර තිබේ, වචනයෙන් හුරු පුරුදු කර ඇත, මනසින් මෙනෙහි කර ඇත, දෘෂ්ටියෙන් හොඳින් විනිවිද දැක ඇත. ඔහු සිහිය පිරිහී මිය පරලොව ගොස් යම්කිසි දෙව්ලොවක උපදී. එහිදී ඔහුට ධර්ම පද සුවසේ පහළ නොවේ, ඍද්ධිමත් වූ, චේතෝවසීභාවයට පැමිණි භික්ෂුවක් දේව පිරිස මැද ධර්මය දේශනා නොකරයි, දේව පුත්‍රයෙක් ද දේව පිරිස මැද ධර්මය දේශනා නොකරයි; එහෙත් යම් ඕපපාතික දේවතාවෙක් තවත් ඕපපාතික දේවතාවෙකුට සිහිපත් කරවයි: ‘මහත්මයාණෙනි, ඔබට මතකද, මහත්මයාණෙනි, ඔබට මතකද, අපි පෙර බ්‍රහ්මචාරී ජීවිතයක් ගත කළ ස්ථානය’ කියා. ඔහු මෙසේ කියයි: ‘මතකයි මහත්මයාණෙනි, මතකයි මහත්මයාණෙනි’ කියා. මහණෙනි, සිහිය පහළවීම මන්දගාමී වේ; එහෙත් ඒ සත්වයා ඉක්මනින්ම විශිෂ්ටත්වයට පත්වේ.\n\nමහණෙනි, යම්සේ පස් කෙළි කරමින් එකට හැදී වැඩුණු මිත්‍රයන් දෙදෙනෙක් සිටිති. ඔවුහු කලාතුරකින් යම් දිනක නැවත හමුවෙති. එක් මිත්‍රයෙක් අනිත් මිත්‍රයාට මෙසේ කියයි: ‘මිත්‍රය, ඔබට මෙය මතකද, මිත්‍රය, ඔබට මෙය මතකද’ කියා. ඔහු මෙසේ කියයි: ‘මතකයි මිත්‍රය, මතකයි මිත්‍රය’ කියා. එපරිද්දෙන්ම, මහණෙනි, භික්ෂුවක් සූත්‍රය, ගේය්‍යය, වෛය්‍යාකරණය, ගාථාව, උදානය, ඉතිවුත්තකය, ජාතකය, අබ්භූතධර්මය, වේදල්ලය යන නව අංගයෙන් යුත් ධර්මය ප්‍රගුණ කරයි. ඔහුට ඒ ධර්මයන් හොඳින් ශ්‍රවණය කර තිබේ, වචනයෙන් හුරු පුරුදු කර ඇත, මනසින් මෙනෙහි කර ඇත, දෘෂ්ටියෙන් හොඳින් විනිවිද දැක ඇත. ඔහු සිහිය පිරිහී මිය පරලොව ගොස් යම්කිසි දෙව්ලොවක උපදී. එහිදී ඔහුට ධර්ම පද සුවසේ පහළ නොවේ, ඍද්ධිමත් වූ, චේතෝවසීභාවයට පැමිණි භික්ෂුවක් දේව පිරිස මැද ධර්මය දේශනා නොකරයි, දේව පුත්‍රයෙක් ද දේව පිරිස මැද ධර්මය දේශනා නොකරයි; එහෙත් යම් ඕපපාතික දේවතාවෙක් තවත් ඕපපාතික දේවතාවෙකුට සිහිපත් කරවයි: ‘මහත්මයාණෙනි, ඔබට මතකද, මහත්මයාණෙනි, ඔබට මතකද, අපි පෙර බ්‍රහ්මචාරී ජීවිතයක් ගත කළ ස්ථානය’ කියා. ඔහු මෙසේ කියයි: ‘මතකයි මහත්මයාණෙනි, මතකයි මහත්මයාණෙනි’ කියා. මහණෙනි, සිහිය පහළවීම මන්දගාමී වේ; එහෙත් ඒ සත්වයා ඉක්මනින්ම විශිෂ්ටත්වයට පත්වේ.\n\nමහණෙනි, හොඳින් ශ්‍රවණය කරන ලද, වචනයෙන් හුරු පුරුදු කරන ලද, මනසින් මෙනෙහි කරන ලද, දෘෂ්ටියෙන් හොඳින් විනිවිද දැක ඇති ධර්මයන්ට මේ සිවුවන ආනිශංසය අපේක්ෂා කළ හැකිය. මහණෙනි, හොඳින් ශ්‍රවණය කරන ලද, වචනයෙන් හුරු පුරුදු කරන ලද, මනසින් මෙනෙහි කරන ලද, දෘෂ්ටියෙන් හොඳින් විනිවිද දැක ඇති ධර්මයන්ට මේ ආනිශංස සතර අපේක්ෂා කළ හැකිය.",
      "paliTitle": "Sotānugatasuttaṃ",
      "englishTitle": "Discourse on Having Listened",
      "sinhalaTitle": "ශ්‍රවණ අනුව ගිය සූත්‍රය"
    },
    {
      "number": 192,
      "pali": "‘‘Cattārimāni, bhikkhave, ṭhānāni catūhi ṭhānehi veditabbāni. Katamāni cattāri? Saṃvāsena, bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenāti. [saṃ. ni. 1.122] ‘‘‘Saṃvāsena, bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ saṃvasamāno evaṃ jānāti – ‘dīgharattaṃ kho ayamāyasmā khaṇḍakārī chiddakārī sabalakārī kammāsakārī, na santatakārī na santatavutti [satatavutti (syā. kaṃ.)]; sīlesu dussīlo ayamāyasmā, nāyamāyasmā sīlavā’’’ti. ‘‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ saṃvasamāno evaṃ jānāti – ‘dīgharattaṃ kho ayamāyasmā akhaṇḍakārī acchiddakārī asabalakārī akammāsakārī santatakārī santatavutti; sīlesu sīlavā ayamāyasmā, nāyamāyasmā dussīlo’ti. ‘Saṃvāsena, bhikkhave, sīlaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ saṃvoharamāno evaṃ jānāti – ‘aññathā kho ayamāyasmā ekena eko voharati, aññathā dvīhi, aññathā tīhi, aññathā sambahulehi; vokkamati ayamāyasmā purimavohārā pacchimavohāraṃ; aparisuddhavohāro ayamāyasmā, nāyamāyasmā parisuddhavohāro’’’ti. ‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ saṃvoharamāno evaṃ jānāti – ‘yatheva kho ayamāyasmā ekena eko voharati, tathā dvīhi, tathā tīhi, tathā sambahulehi. Nāyamāyasmā vokkamati purimavohārā pacchimavohāraṃ; parisuddhavohāro ayamāyasmā, nāyamāyasmā aparisuddhavohāro’ti. ‘Saṃvohārena, bhikkhave, soceyyaṃ veditabbaṃ, tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, ekacco ñātibyasanena vā phuṭṭho samāno, bhogabyasanena vā phuṭṭho samāno, rogabyasanena vā phuṭṭho samāno na iti paṭisañcikkhati – ‘tathābhūto kho ayaṃ lokasannivāso tathābhūto ayaṃ attabhāvapaṭilābho yathābhūte lokasannivāse yathābhūte attabhāvapaṭilābhe aṭṭha lokadhammā lokaṃ anuparivattanti loko ca aṭṭha lokadhamme anuparivattati – lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañcā’ti. So ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena vā phuṭṭho samāno socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. ‘‘Idha pana, bhikkhave, ekacco ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena vā phuṭṭho samāno iti paṭisañcikkhati – ‘tathābhūto kho ayaṃ lokasannivāso tathābhūto ayaṃ attabhāvapaṭilābho yathābhūte lokasannivāse yathābhūte attabhāvapaṭilābhe aṭṭha lokadhammā lokaṃ anuparivattanti loko ca aṭṭha lokadhamme anuparivattati – lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañcā’ti. So ñātibyasanena vā phuṭṭho samāno bhogabyasanena vā phuṭṭho samāno rogabyasanena vā phuṭṭho samāno na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. ‘Āpadāsu, bhikkhave, thāmo veditabbo, so ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, duppañño ayamāyasmā, nāyamāyasmā paññavā. Taṃ kissa hetu? Tathā hi ayamāyasmā na ceva gambhīraṃ atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati tassa ca nappaṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Duppañño ayamāyasmā, nāyamāyasmā paññavā’’’ti. ‘‘Seyyathāpi, bhikkhave, cakkhumā puriso udakarahadassa tīre ṭhito passeyya parittaṃ macchaṃ ummujjamānaṃ. Tassa evamassa – ‘yathā kho imassa macchassa ummaggo yathā ca ūmighāto yathā ca vegāyitattaṃ, paritto ayaṃ maccho, nāyaṃ maccho mahanto’ti. Evamevaṃ kho, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, duppañño ayamāyasmā, nāyamāyasmā paññavā. Taṃ kissa hetu? Tathā hi ayamāyasmā na ceva gambhīraṃ atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca na paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Duppañño ayamāyasmā, nāyamāyasmā paññavā’’’ti. ‘‘Idha pana, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, paññavā ayamāyasmā, nāyamāyasmā duppañño. Taṃ kissa hetu? Tathā hi ayamāyasmā gambhīrañceva atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Paññavā ayamāyasmā, nāyamāyasmā duppañño’’’ti. ‘‘Seyyathāpi, bhikkhave, cakkhumā puriso udakarahadassa tīre ṭhito passeyya mahantaṃ macchaṃ ummujjamānaṃ. Tassa evamassa – ‘yathā kho imassa macchassa ummaggo yathā ca ūmighāto yathā ca vegāyitattaṃ, mahanto ayaṃ maccho, nāyaṃ maccho paritto’ti. Evamevaṃ kho, bhikkhave, puggalo puggalena saddhiṃ sākacchāyamāno evaṃ jānāti – ‘yathā kho imassa āyasmato ummaggo yathā ca abhinīhāro yathā ca pañhāsamudāhāro, paññavā ayamāyasmā, nāyamāyasmā duppañño. Taṃ kissa hetu? Tathā hi ayamāyasmā gambhīrañceva atthapadaṃ udāharati santaṃ paṇītaṃ atakkāvacaraṃ nipuṇaṃ paṇḍitavedanīyaṃ. Yañca ayamāyasmā dhammaṃ bhāsati, tassa ca paṭibalo saṃkhittena vā vitthārena vā atthaṃ ācikkhituṃ desetuṃ paññāpetuṃ paṭṭhapetuṃ vivarituṃ vibhajituṃ uttānīkātuṃ. Paññavā ayamāyasmā, nāyamāyasmā duppañño’ti. ‘‘‘Sākacchāya, bhikkhave, paññā veditabbā, sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. Imāni kho, bhikkhave, cattāri ṭhānāni imehi catūhi ṭhānehi veditabbānī’’ti. Dutiyaṃ.",
      "english": "Monks, these four things are to be understood by means of four types of observation. Which four? Monks, moral conduct is to be understood by living together with someone, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom. Monks, purity of character is to be understood by interacting with someone, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom. Monks, steadfastness is to be understood in times of adversity, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom. Monks, wisdom is to be understood through discussion, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom.\n\nThat which was stated: \"Monks, moral conduct is to be understood by living together with someone, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom\" – in dependence on what was this said? Here, monks, when one person lives together with another person, he comes to know thus: \"For a long time, this venerable one has had broken, pierced, spotted, and blotched conduct; he has not acted continuously with purity nor maintained continuous good behavior. This venerable one is immoral in his conduct; this venerable one is not virtuous.\"\n\nHowever, monks, here when one person lives together with another person, he comes to know thus: \"For a long time, this venerable one has had unbroken, unpierced, unspotted, and unblotched conduct; he has acted continuously with purity and maintained continuous good behavior. This venerable one is virtuous in his conduct; this venerable one is not immoral.\" That which was stated: \"Monks, moral conduct is to be understood by living together with someone, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom\" – this was said in dependence on this.\n\nThat which was stated: \"Monks, purity of character is to be understood by interacting with someone, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom\" – in dependence on what was this said? Here, monks, when one person interacts with another person, he comes to know thus: \"This venerable one deals differently with one person, differently with two, differently with three, differently with many people; this venerable one deviates from his former way of dealing to a later way of dealing. This venerable one is impure in his dealings; this venerable one is not pure in his dealings.\"\n\nHowever, monks, here when one person interacts with another person, he comes to know thus: \"Just as this venerable one deals with one person, so too with two, so too with three, so too with many people. This venerable one does not deviate from his former way of dealing to a later way of dealing. This venerable one is pure in his dealings; this venerable one is not impure in his dealings.\" That which was stated: \"Monks, purity of character is to be understood by interacting with someone, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom\" – this was said in dependence on this.\n\nThat which was stated: \"Monks, steadfastness is to be understood in times of adversity, and that, moreover, through a long period, not a short one; by one who pays careful attention, not by one who doesn't; by one who has wisdom, not by one who lacks wisdom\" – in dependence on what was this said? Here, monks, when a certain person is afflicted by the loss of relatives, or afflicted by the loss of wealth, or afflicted by disease, he does not reflect thus: \"Such is the nature of this world, such is the nature of this individual existence, that in this mundane world and in this individual existence, the eight worldly conditions revolve around the world, and the world revolves around the eight worldly conditions – namely, gain and loss, fame and disrepute, blame and praise, pleasure and pain.\" Consequently, being afflicted by the loss of relatives, or afflicted by the loss of wealth, or afflicted by disease, he grieves, laments, suffers distress, beats his breast, and falls into confusion.\n\nHowever, monks, here when a certain person is afflicted by the loss of relatives, or afflicted by the loss of wealth, or afflicted by disease, he reflects thus: \"Such is the nature of this world, such is the nature of this individual existence, that in this mundane world and in this individual existence, the eight worldly conditions revolve around the world, and the world revolves around the eight worldly conditions – namely, gain and loss, fame and disrepute, blame and praise, pleasure and pain.\" Consequently, being afflicted by the loss of relatives, or afflicted by the loss of wealth, or afflicted by disease, he does not grieve, does not lament, does not suffer distress, does not beat his breast, and does not fall into confusion.\n\nMonks, endurance is to be known in adversities. And that endurance is known over a long period, not a short one; by one who attends carefully, not by one who does not attend carefully; by one who is discerning, not by one who lacks discernment. What was said thus, was said with this in mind.\n\nMonks, discernment is to be known through discussion. And that discernment is known over a long period, not a short one; by one who attends carefully, not by one who does not attend carefully; by one who is discerning, not by one who lacks discernment. Indeed, this was said thus. What was this said with reference to?\n\nHere, monks, a person, while discussing with another person, comes to know thus: \"The way this venerable one brings forth his understanding, the way he grasps meaning, and the way he elucidates questions—this venerable one lacks true discernment; he does not possess wisdom.\" \"What is the reason for this?\" \"Because this venerable one does not bring forth profound points of meaning, which are peaceful, excellent, beyond the scope of mere logic, subtle, and comprehensible only to the wise. And when this venerable one speaks on the Dhamma, he is not capable of explaining its meaning, teaching it, making it known, establishing it, clarifying it, analyzing it, or making it plain, whether in brief or in detail. This venerable one lacks true discernment; he does not possess wisdom.\"\n\nJust as, monks, a keen-sighted person standing on the bank of a lake might see a small fish emerging. It would occur to him: \"The way this fish emerges, the way it makes ripples, and the way it darts about—this fish is small; it is not large.\" In the same way, monks, a person, while discussing with another person, comes to know thus: \"The way this venerable one brings forth his understanding, the way he grasps meaning, and the way he elucidates questions—this venerable one lacks true discernment; he does not possess wisdom.\" \"What is the reason for this?\" \"Because this venerable one does not bring forth profound points of meaning, which are peaceful, excellent, beyond the scope of mere logic, subtle, and comprehensible only to the wise. And when this venerable one speaks on the Dhamma, he is not capable of explaining its meaning, teaching it, making it known, establishing it, clarifying it, analyzing it, or making it plain, whether in brief or in detail. This venerable one lacks true discernment; he does not possess wisdom.\"\n\nHere, however, monks, a person, while discussing with another person, comes to know thus: \"The way this venerable one brings forth his understanding, the way he grasps meaning, and the way he elucidates questions—this venerable one possesses true discernment; he does not lack wisdom.\" \"What is the reason for this?\" \"Because this venerable one brings forth profound points of meaning, which are peaceful, excellent, beyond the scope of mere logic, subtle, and comprehensible only to the wise. And when this venerable one speaks on the Dhamma, he is capable of explaining its meaning, teaching it, making it known, establishing it, clarifying it, analyzing it, or making it plain, whether in brief or in detail. This venerable one possesses true discernment; he does not lack wisdom.\"\n\nJust as, monks, a keen-sighted person standing on the bank of a lake might see a large fish emerging. It would occur to him: \"The way this fish emerges, the way it makes ripples, and the way it darts about—this fish is large; it is not small.\" In the same way, monks, a person, while discussing with another person, comes to know thus: \"The way this venerable one brings forth his understanding, the way he grasps meaning, and the way he elucidates questions—this venerable one possesses true discernment; he does not lack wisdom.\" \"What is the reason for this?\" \"Because this venerable one brings forth profound points of meaning, which are peaceful, excellent, beyond the scope of mere logic, subtle, and comprehensible only to the wise. And when this venerable one speaks on the Dhamma, he is capable of explaining its meaning, teaching it, making it known, establishing it, clarifying it, analyzing it, or making it plain, whether in brief or in detail. This venerable one possesses true discernment; he does not lack wisdom.\"\n\n\"Monks, discernment is to be known through discussion. And that discernment is known over a long period, not a short one; by one who attends carefully, not by one who does not attend carefully; by one who is discerning, not by one who lacks discernment.\" What was said thus, was said with this in mind. Indeed, monks, these four qualities are to be known by these four means.",
      "sinhala": "භික්ෂුනී, මේ කරුණු සතර, කරුණු සතරකින් දැනගත යුත්තාහ. කවරේද ඒ කරුණු සතර? භික්ෂුනී, සිල්වත් බව (පුද්ගලයාගේ) දැනගත යුත්තේ එක්ව වාසය කිරීමෙනි. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ. භික්ෂුනී, පිරිසිදු භාවය (පුද්ගලයාගේ) දැනගත යුත්තේ ගනුදෙනු කිරීමෙනි. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ. භික්ෂුනී, ධෛර්යය (පුද්ගලයාගේ) දැනගත යුත්තේ විපත්ති වලදී ය. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ. භික්ෂුනී, ප්‍ර‍ඥාව (පුද්ගලයාගේ) දැනගත යුත්තේ සාකච්ඡා කිරීමෙනි. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ.\n\n‘භික්ෂුනී, සිල්වත් බව (පුද්ගලයාගේ) දැනගත යුත්තේ එක්ව වාසය කිරීමෙනි. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ’ යැයි මෙය වදාරණ ලදී. කුමක් අරභයා ද මෙය වදාරණ ලදී? භික්ෂුනී, මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙක් සමඟ එක්ව වාසය කරද්දී මෙසේ දැන ගන්නේ ය: ‘මේ ආයුෂ්මත් දීර්ඝ කාලයක් තිස්සේ සිල් කඩන, සිල් බිඳින, සිල් තැනින් තැන අපිරිසිදු කරන, සිල් කළු කරගන්නා කෙනෙකි. නිරන්තරයෙන් (සිල්) නොකරන්නෙකි, නිරන්තරයෙන් නොපවත්වන්නෙකි. මේ ආයුෂ්මත් සීලයන් හි දූෂිත ය, මේ ආයුෂ්මත් සිල්වත් නොවේ.’\n\nභික්ෂුනී, එහෙත් මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙක් සමඟ එක්ව වාසය කරද්දී මෙසේ දැන ගන්නේ ය: ‘මේ ආයුෂ්මත් දීර්ඝ කාලයක් තිස්සේ සිල් නොකඩන, සිල් නොබිඳින, සිල් තැනින් තැන අපිරිසිදු නොකරන, සිල් කළු කර නොගන්නා කෙනෙකි. නිරන්තරයෙන් (සිල්) කරන්නෙකි, නිරන්තරයෙන් පවත්වන්නෙකි. මේ ආයුෂ්මත් සීලයන් හි සිල්වත් ය, මේ ආයුෂ්මත් දූෂිත නොවේ.’ ‘භික්ෂුනී, සිල්වත් බව (පුද්ගලයාගේ) දැනගත යුත්තේ එක්ව වාසය කිරීමෙනි. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ’ යැයි යමක් වදාරණ ලද්දේ ද, එය මේ කරුණ අරභයා වදාරණ ලදී.\n\n‘භික්ෂුනී, පිරිසිදු භාවය (පුද්ගලයාගේ) දැනගත යුත්තේ ගනුදෙනු කිරීමෙනි. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ’ යැයි මෙය වදාරණ ලදී. කුමක් අරභයා ද මෙය වදාරණ ලදී? භික්ෂුනී, මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙක් සමඟ ගනුදෙනු කරද්දී මෙසේ දැන ගන්නේ ය: ‘මේ ආයුෂ්මත් තනිව කෙනෙකු සමඟ එක් ආකාරයකට ගනුදෙනු කරයි, දෙදෙනෙකු සමඟ තව ආකාරයකට ගනුදෙනු කරයි, තිදෙනෙකු සමඟ තව ආකාරයකට ගනුදෙනු කරයි, බොහෝ දෙනෙකු සමඟ තව ආකාරයකට ගනුදෙනු කරයි. මේ ආයුෂ්මත් පෙර ගනුදෙනුවෙන් පසු ගනුදෙනුවට මාරු වේ. මේ ආයුෂ්මත් අපිරිසිදු ගනුදෙනු ඇත්තෙකි, මේ ආයුෂ්මත් පිරිසිදු ගනුදෙනු ඇත්තෙක් නොවේ.’\n\nභික්ෂුනී, එහෙත් මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙක් සමඟ ගනුදෙනු කරද්දී මෙසේ දැන ගන්නේ ය: ‘මේ ආයුෂ්මත් තනිව කෙනෙකු සමඟ කුමන ආකාරයකට ගනුදෙනු කරයි ද, දෙදෙනෙකු සමඟ ද ඒ ආකාරයට ගනුදෙනු කරයි, තිදෙනෙකු සමඟ ද ඒ ආකාරයට ගනුදෙනු කරයි, බොහෝ දෙනෙකු සමඟ ද ඒ ආකාරයට ගනුදෙනු කරයි. මේ ආයුෂ්මත් පෙර ගනුදෙනුවෙන් පසු ගනුදෙනුවට මාරු නොවේ. මේ ආයුෂ්මත් පිරිසිදු ගනුදෙනු ඇත්තෙකි, මේ ආයුෂ්මත් අපිරිසිදු ගනුදෙනු ඇත්තෙක් නොවේ.’ ‘භික්ෂුනී, පිරිසිදු භාවය (පුද්ගලයාගේ) දැනගත යුත්තේ ගනුදෙනු කිරීමෙනි. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ’ යැයි යමක් වදාරණ ලද්දේ ද, එය මේ කරුණ අරභයා වදාරණ ලදී.\n\n‘භික්ෂුනී, ධෛර්යය (පුද්ගලයාගේ) දැනගත යුත්තේ විපත්ති වලදී ය. එසේ දැනගත යුත්තේ කෙටි කලකින් නොව, දිගු කලකින් ය. මෙනෙහි කරමින් ය, මෙනෙහි නොකරමින් නොවේ. ප්‍ර‍ඥාවන්තයෙකු විසින් ය, ප්‍ර‍ඥා රහිතයෙකු විසින් නොවේ’ යැයි මෙය වදාරණ ලදී. කුමක් අරභයා ද මෙය වදාරණ ලදී? භික්ෂුනී, මෙහිලා ඇතැම් කෙනෙක් ඥාති විපතකින් හෝ ස්පර්ශ වූයේ (පීඩාවට පත් වූයේ), භෝග විපතකින් හෝ ස්පර්ශ වූයේ, රෝග විපතකින් හෝ ස්පර්ශ වූයේ මෙසේ මෙනෙහි නොකරයි: ‘මේ ලෝකයේ පැවැත්ම ද, මේ ආත්මභාවය ලැබීම ද මෙවැනි ය. මේ ආකාරයේ ලෝක පැවැත්මක, මේ ආකාරයේ ආත්මභාවයක් ලැබීමක දී අටලෝ දහම් ලෝකය අනුව හැසිරෙති, ලෝකය ද අටලෝ දහම් අනුව හැසිරේ. එනම්: ලාභය ද, අලාභය ද, යසස ද, අයසස ද, නින්දාව ද, ප්‍ර‍ශංසාව ද, සැපය ද, දුක ද යන මේවා ය.’ හෙතෙම ඥාති විපතකින් හෝ ස්පර්ශ වූයේ, භෝග විපතකින් හෝ ස්පර්ශ වූයේ, රෝග විපතකින් හෝ ස්පර්ශ වූයේ ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, පපුවට තලා ගෙන හඬයි, සිහිමඳ බවට පත්වෙයි.\n\nභික්ෂුනී, එහෙත් මෙහිලා ඇතැම් කෙනෙක් ඥාති විපතකින් හෝ ස්පර්ශ වූයේ, භෝග විපතකින් හෝ ස්පර්ශ වූයේ, රෝග විපතකින් හෝ ස්පර්ශ වූයේ මෙසේ මෙනෙහි කරයි: ‘මේ ලෝකයේ පැවැත්ම ද, මේ ආත්මභාවය ලැබීම ද මෙවැනි ය. මේ ආකාරයේ ලෝක පැවැත්මක, මේ ආකාරයේ ආත්මභාවයක් ලැබීමක දී අටලෝ දහම් ලෝකය අනුව හැසිරෙති, ලෝකය ද අටලෝ දහම් අනුව හැසිරේ. එනම්: ලාභය ද, අලාභය ද, යසස ද, අයසස ද, නින්දාව ද, ප්‍ර‍ශංසාව ද, සැපය ද, දුක ද යන මේවා ය.’ හෙතෙම ඥාති විපතකින් හෝ ස්පර්ශ වූයේ, භෝග විපතකින් හෝ ස්පර්ශ වූයේ, රෝග විපතකින් හෝ ස්පර්ශ වූයේ ශෝක නොකරයි, වෙහෙසට පත් නොවේ, වැළපෙන්නේ නැත, පපුවට තලා ගෙන නොහඬයි, සිහිමඳ බවට පත් නොවේ.\n\n‘ආපදාවන්හිදී, මහණෙනි, ස්ථීරභාවය (ධෛර්යය) දැනගත යුත්තේය. ඒද දිගු කලක් තිස්සේය, ක්ෂණිකව නොවේ; මනා අවධානයෙන් යුක්තවන්නෙකු විසින් මිස, මනා අවධානයෙන් තොරවන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ.’ මෙසේ යමක් කියන ලද්දේද, එය මේ කරුණ අරබයා කියන ලද්දකි. ‘‘මහණෙනි, සාකච්ඡාවෙන් ප්‍රඥාව දැනගත යුත්තේය. ඒද දිගු කලක් තිස්සේය, ක්ෂණිකව නොවේ; මනා අවධානයෙන් යුක්තවන්නෙකු විසින් මිස, මනා අවධානයෙන් තොරවන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ.’ මෙසේ මෙය කියන ලද්දේය. මේ කුමක් අරබයා කියන ලද්දේද? මහණෙනි, මෙහි යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකු සමඟ සාකච්ඡා කරමින් මෙසේ දනී: ‘මේ ආයුෂ්මතාගේ කරුණු ඉදිරිපත් කරන ආකාරයද, අර්ථය උකහා ගන්නා ආකාරයද, ගැටලු නිරාකරණය කරන ආකාරයද යම්සේද, මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙකි, මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙක් නොවේ. ඒ කුමන හේතුවක් නිසාද? එසේ වන්නේ, මේ ආයුෂ්මත් ගැඹුරු වූ, ශාන්ත වූ, ප්‍රණීත වූ, තර්කයෙන් අවබෝධ කළ නොහැකි, සියුම් වූ, පණ්ඩිතයන් විසින්ම දැනගත යුතු අර්ථ පදයක් හෝ දේශනා නොකරයි. මේ ආයුෂ්මත් යම් ධර්මයක් භාෂණය කරන්නේද, එහි අර්ථය සංක්ෂිප්තයෙන් හෝ විස්තර වශයෙන් පැහැදිලි කිරීමට හෝ දේශනා කිරීමට හෝ ප්‍රකාශ කිරීමට හෝ පිහිටුවීමට හෝ විවෘත කිරීමට හෝ විභාග කිරීමට හෝ ප්‍රකට කිරීමට හෝ සමත් නොවේ. මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙකි, මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙක් නොවේ’යි.\n\nමහණෙනි, යම්සේ ඇස් ඇති පුරුෂයෙක් ගැඹුරු ජලාශයක (රහදක) ඉවුරෙහි සිට කුඩා මාලුවෙක් මතුවනවා දකීද, ඔහුට මෙසේ සිතේ: ‘මේ මාලුවාගේ මතුවන ආකාරයද, දියරැළි බිඳින ආකාරයද, වේගයෙන් පිහිනන ආකාරයද යම්සේද, මේ මාලුවා කුඩාය, මේ මාලුවා විශාල නොවේ’ කියා. එසේම, මහණෙනි, යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකු සමඟ සාකච්ඡා කරමින් මෙසේ දනී: ‘මේ ආයුෂ්මතාගේ කරුණු ඉදිරිපත් කරන ආකාරයද, අර්ථය උකහා ගන්නා ආකාරයද, ගැටලු නිරාකරණය කරන ආකාරයද යම්සේද, මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙකි, මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙක් නොවේ. ඒ කුමන හේතුවක් නිසාද? එසේ වන්නේ, මේ ආයුෂ්මත් ගැඹුරු වූ, ශාන්ත වූ, ප්‍රණීත වූ, තර්කයෙන් අවබෝධ කළ නොහැකි, සියුම් වූ, පණ්ඩිතයන් විසින්ම දැනගත යුතු අර්ථ පදයක් හෝ දේශනා නොකරයි. මේ ආයුෂ්මත් යම් ධර්මයක් භාෂණය කරන්නේද, එහි අර්ථය සංක්ෂිප්තයෙන් හෝ විස්තර වශයෙන් පැහැදිලි කිරීමට හෝ දේශනා කිරීමට හෝ ප්‍රකාශ කිරීමට හෝ පිහිටුවීමට හෝ විවෘත කිරීමට හෝ විභාග කිරීමට හෝ ප්‍රකට කිරීමට හෝ සමත් නොවේ. මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙකි, මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙක් නොවේ’යි.\n\nනමුත් මහණෙනි, මෙහි යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකු සමඟ සාකච්ඡා කරමින් මෙසේ දනී: ‘මේ ආයුෂ්මතාගේ කරුණු ඉදිරිපත් කරන ආකාරයද, අර්ථය උකහා ගන්නා ආකාරයද, ගැටලු නිරාකරණය කරන ආකාරයද යම්සේද, මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙකි, මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙක් නොවේ. ඒ කුමන හේතුවක් නිසාද? එසේ වන්නේ, මේ ආයුෂ්මත් ගැඹුරු වූ, ශාන්ත වූ, ප්‍රණීත වූ, තර්කයෙන් අවබෝධ කළ නොහැකි, සියුම් වූ, පණ්ඩිතයන් විසින්ම දැනගත යුතු අර්ථ පදයක් දේශනා කරයි. මේ ආයුෂ්මත් යම් ධර්මයක් භාෂණය කරන්නේද, එහි අර්ථය සංක්ෂිප්තයෙන් හෝ විස්තර වශයෙන් පැහැදිලි කිරීමට හෝ දේශනා කිරීමට හෝ ප්‍රකාශ කිරීමට හෝ පිහිටුවීමට හෝ විවෘත කිරීමට හෝ විභාග කිරීමට හෝ ප්‍රකට කිරීමට හෝ සමත් වේ. මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙකි, මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙක් නොවේ’යි.\n\nමහණෙනි, යම්සේ ඇස් ඇති පුරුෂයෙක් ගැඹුරු ජලාශයක (රහදක) ඉවුරෙහි සිට විශාල මාලුවෙක් මතුවනවා දකීද, ඔහුට මෙසේ සිතේ: ‘මේ මාලුවාගේ මතුවන ආකාරයද, දියරැළි බිඳින ආකාරයද, වේගයෙන් පිහිනන ආකාරයද යම්සේද, මේ මාලුවා විශාලය, මේ මාලුවා කුඩා නොවේ’ කියා. එසේම, මහණෙනි, යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකු සමඟ සාකච්ඡා කරමින් මෙසේ දනී: ‘මේ ආයුෂ්මතාගේ කරුණු ඉදිරිපත් කරන ආකාරයද, අර්ථය උකහා ගන්නා ආකාරයද, ගැටලු නිරාකරණය කරන ආකාරයද යම්සේද, මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙකි, මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙක් නොවේ. ඒ කුමන හේතුවක් නිසාද? එසේ වන්නේ, මේ ආයුෂ්මත් ගැඹුරු වූ, ශාන්ත වූ, ප්‍රණීත වූ, තර්කයෙන් අවබෝධ කළ නොහැකි, සියුම් වූ, පණ්ඩිතයන් විසින්ම දැනගත යුතු අර්ථ පදයක් දේශනා කරයි. මේ ආයුෂ්මත් යම් ධර්මයක් භාෂණය කරන්නේද, එහි අර්ථය සංක්ෂිප්තයෙන් හෝ විස්තර වශයෙන් පැහැදිලි කිරීමට හෝ දේශනා කිරීමට හෝ ප්‍රකාශ කිරීමට හෝ පිහිටුවීමට හෝ විවෘත කිරීමට හෝ විභාග කිරීමට හෝ ප්‍රකට කිරීමට හෝ සමත් වේ. මේ ආයුෂ්මත් ප්‍රඥාවන්තයෙකි, මේ ආයුෂ්මත් දුෂ්ප්‍රඥයෙක් නොවේ’යි.\n\n‘මහණෙනි, සාකච්ඡාවෙන් ප්‍රඥාව දැනගත යුත්තේය. ඒද දිගු කලක් තිස්සේය, ක්ෂණිකව නොවේ; මනා අවධානයෙන් යුක්තවන්නෙකු විසින් මිස, මනා අවධානයෙන් තොරවන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ.’ මෙසේ යමක් කියන ලද්දේද, එය මේ කරුණ අරබයා කියන ලද්දකි. මහණෙනි, මේ කරුණු සතර, මේ කරුණු සතරින් දැනගත යුතු වේ.” දෙවෙනියයි.",
      "paliTitle": "Ṭhānasuttaṃ",
      "englishTitle": "The Discourse on Grounds",
      "sinhalaTitle": "ස්ථාන සූත්‍රය"
    },
    {
      "number": 193,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhaddiyo licchavi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhaddiyo licchavi bhagavantaṃ etadavoca – ‘‘Sutaṃ metaṃ, bhante – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ [āvaṭṭanīmāyaṃ (sī.), āvaṭṭanimāyaṃ (syā. kaṃ. ka.) ma. ni. 2.60 passitabbaṃ] jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’ti. Ye te, bhante, evamāhaṃsu – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’ti, kacci te, bhante, bhagavato vuttavādino, na ca bhagavantaṃ abhūtena abbhācikkhanti, dhammassa ca anudhammaṃ byākaronti, na ca koci sahadhammiko vādānupāto gārayhaṃ ṭhānaṃ āgacchati, anabbhakkhātukāmā hi mayaṃ, bhante, bhagavanta’’nti? ‘‘Etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantī’ti, atha tumhe, bhaddiya, pajaheyyātha. ‘‘Taṃ kiṃ maññatha, bhaddiya, lobho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Luddho panāyaṃ, bhaddiya, purisapuggalo lobhena abhibhūto pariyādinnacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya [tadatthāya (ka.) a. ni. 3.66] samādapeti yaṃsa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaddiya, doso purisassa…pe… moho purisassa…pe… sārambho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Sāraddho panāyaṃ, bhaddiya, purisapuggalo sārambhena abhibhūto pariyādinnacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya samādapeti yaṃsa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaddiya, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Akusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Sāvajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññugarahitā, bhante’’. ‘‘Samattā samādinnā ahitāya dukkhāya saṃvattanti, no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā ahitāya dukkhāya saṃvattanti. Evaṃ no ettha hotī’’ti. ‘‘Iti kho, bhaddiya, yaṃ taṃ te avocumhā – etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantīti, atha tumhe, bhaddiya, pajaheyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantī’ti, atha tumhe, bhaddiya, upasampajja vihareyyāthā’’ti. ‘‘Taṃ kiṃ maññatha, bhaddiya, alobho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Hitāya, bhante’’. ‘‘Aluddho panāyaṃ, bhaddiya, purisapuggalo lobhena anabhibhūto apariyādinnacitto neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati, parampi tathattāya na samādapeti yaṃ’sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaddiya, adoso purisassa…pe… amoho purisassa…pe… asārambho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Hitāya, bhante’’. ‘‘Asāraddho panāyaṃ, bhaddiya, purisapuggalo sārambhena anabhibhūto apariyādinnacitto neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati, parampi tathattāya na samādapeti yaṃ’sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhaddiya, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Kusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Anavajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññuppasatthā, bhante’’. ‘‘Samattā samādinnā hitāya sukhāya saṃvattanti no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā hitāya sukhāya saṃvattanti. Evaṃ no ettha hotī’’ti. ‘‘Iti kho, bhaddiya, yaṃ taṃ te avocumhā – etha tumhe, bhaddiya, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā ‘samaṇo no garū’ti. Yadā tumhe, bhaddiya, attanāva jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantīti, atha tumhe, bhaddiya, upasampajja vihareyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Ye kho te, bhaddiya, loke santo sappurisā te sāvakaṃ evaṃ samādapenti – ‘ehi tvaṃ, ambho purisa, lobhaṃ vineyya [vineyya vineyya (sī. syā. kaṃ.)] viharāhi. Lobhaṃ vineyya viharanto na lobhajaṃ kammaṃ karissasi kāyena vācāya manasā. Dosaṃ vineyya viharāhi. Dosaṃ vineyya viharanto na dosajaṃ kammaṃ karissasi kāyena vācāya manasā. Mohaṃ vineyya viharāhi. Mohaṃ vineyya viharanto na mohajaṃ kammaṃ karissasi kāyena vācāya manasā. Sārambhaṃ vineyya viharāhi. Sārambhaṃ vineyya viharanto na sārambhajaṃ kammaṃ karissasi kāyena vācāya manasā’’’ti. Evaṃ vutte bhaddiyo licchavi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. ‘‘Api nu tāhaṃ, bhaddiya, evaṃ avacaṃ – ‘ehi me tvaṃ, bhaddiya, sāvako hohi; ahaṃ satthā bhavissāmī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Evaṃvādiṃ kho maṃ, bhaddiya, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘māyāvī samaṇo gotamo āvaṭṭaniṃ māyaṃ jānāti yāya aññatitthiyānaṃ sāvake āvaṭṭetī’’’ti. ‘‘Bhaddikā, bhante, āvaṭṭanī māyā. Kalyāṇī, bhante, āvaṭṭanī māyā. Piyā me, bhante, ñātisālohitā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, piyānampi me assa ñātisālohitānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, khattiyā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, brāhmaṇā… vessā … suddā imāya āvaṭṭaniyā āvaṭṭeyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evametaṃ, bhaddiya, evametaṃ, bhaddiya! Sabbe cepi, bhaddiya, khattiyā imāya āvaṭṭaniyā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhaddiya, brāhmaṇā… vessā… suddā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāya. Sadevako cepi, bhaddiya, loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā imāya āvaṭṭaniyā āvaṭṭeyyuṃ [āvaṭṭeyya (?)] akusaladhammappahānāya kusaladhammūpasampadāya, sadevakassapissa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya dīgharattaṃ hitāya sukhāya. Ime cepi, bhaddiya, mahāsālā imāya āvaṭṭaniyā āvaṭṭeyyuṃ akusaladhammappahānāya kusaladhammūpasampadāya, imesampissa mahāsālānaṃ dīgharattaṃ hitāya sukhāya ( ) [(sace ceteyyuṃ) (sī. syā. kaṃ. pī.), (āvaṭṭeyyuṃ) (ka.) a. ni. 8.44]. Ko pana vādo manussabhūtassā’’ti! Tatiyaṃ.",
      "english": "At one time the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Then Bhaddiya the Licchavi approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side.\n\nSeated to one side, Bhaddiya the Licchavi said this to the Blessed One: \"Revered sir, I have heard this: 'The ascetic Gotama is a magician; he knows a magic spell by which he converts the disciples of other sects.' Revered sir, those who said this – 'The ascetic Gotama is a magician; he knows a magic spell by which he converts the disciples of other sects' – did they, revered sir, state what was said by the Blessed One? Do they not misrepresent the Blessed One with what is untrue? Do they declare the Dhamma in accordance with the Dhamma? And does no speaker adhering to the Dhamma incur a blameworthy position? For, revered sir, we do not wish to misrepresent the Blessed One.\"\n\n\"Come, Bhaddiya, you all, do not go by oral tradition, nor by lineage of tradition, nor by hearsay, nor by scriptural collection, nor by logical reasoning, nor by inferential reasoning, nor by reflection on appearances, nor by the approval of a view after pondering it, nor by the seeming competence of a speaker, nor by the thought 'The ascetic is our teacher.' When you, Bhaddiya, yourselves know: 'These things are unwholesome, these things are blameworthy, these things are censured by the wise, these things, when undertaken and practiced, lead to harm and suffering,' then, Bhaddiya, you should abandon them.\"\n\n\"What do you think, Bhaddiya? When greed arises within a person, does it arise for his welfare or for his harm?\" \"For his harm, revered sir.\"\n\n\"Indeed, Bhaddiya, a person overcome by greed, with his mind consumed, even takes life, even takes what is not given, even goes to another's wife, even speaks falsely, and even encourages others to do likewise, which leads to his harm and suffering for a long time.\" \"Yes, revered sir.\"\n\n\"What do you think, Bhaddiya? When hatred arises within a person... When delusion arises within a person... When contention arises within a person, does it arise for his welfare or for his harm?\" \"For his harm, revered sir.\"\n\n\"Indeed, Bhaddiya, a person overcome by contention, with his mind consumed, even takes life, even takes what is not given, even goes to another's wife, even speaks falsely, and even encourages others to do likewise, which leads to his harm and suffering for a long time.\" \"Yes, revered sir.\"\n\n\"What do you think, Bhaddiya? Are these things wholesome or unwholesome?\" \"Unwholesome, revered sir.\" \"Are they blameworthy or blameless?\" \"Blameworthy, revered sir.\" \"Are they censured by the wise or praised by the wise?\" \"Censured by the wise, revered sir.\" \"When undertaken and practiced, do they lead to harm and suffering, or not? Or how is it in this case?\" \"Revered sir, when undertaken and practiced, they lead to harm and suffering. That is how it is in this case for us.\"\n\n\"Thus, Bhaddiya, that which we told you – 'Come, Bhaddiya, you all, do not go by oral tradition, nor by lineage of tradition, nor by hearsay, nor by scriptural collection, nor by logical reasoning, nor by inferential reasoning, nor by reflection on appearances, nor by the approval of a view after pondering it, nor by the seeming competence of a speaker, nor by the thought \"The ascetic is our teacher.\" When you, Bhaddiya, yourselves know: \"These things are unwholesome, these things are blameworthy, these things are censured by the wise, these things, when undertaken and practiced, lead to harm and suffering,\" then, Bhaddiya, you should abandon them' – that which was spoken, was spoken with reference to this.\"\n\n\"Come, Bhaddiya, you all, do not go by oral tradition, nor by lineage of tradition, nor by hearsay, nor by scriptural collection, nor by logical reasoning, nor by inferential reasoning, nor by reflection on appearances, nor by the approval of a view after pondering it, nor by the seeming competence of a speaker, nor by the thought 'The ascetic is our teacher.' When you, Bhaddiya, yourselves know: 'These things are wholesome, these things are blameless, these things are praised by the wise, these things, when undertaken and practiced, lead to welfare and happiness,' then, Bhaddiya, you should undertake and abide in them.\"\n\n\"What do you think, Bhaddiya? When non-greed arises within a person, does it arise for his welfare or for his harm?\" \"For his welfare, revered sir.\"\n\n\"Indeed, Bhaddiya, a person not overcome by greed, with his mind not consumed, neither takes life, nor takes what is not given, nor goes to another's wife, nor speaks falsely, nor encourages others to do likewise, which leads to his welfare and happiness for a long time.\" \"Yes, revered sir.\"\n\n\"What do you think, Bhaddiya? When non-hatred arises within a person... When non-delusion arises within a person... When non-contention arises within a person, does it arise for his welfare or for his harm?\" \"For his welfare, revered sir.\"\n\nBut Bhaddiya, a person who is unagitated, not overcome by contentious striving, with a mind unperturbed, neither takes life, nor takes what is not given, nor goes to another’s wife, nor speaks falsehood, nor encourages others to perform such actions. And this (abstention from unwholesome actions and from encouraging them) leads to long-term welfare and happiness for them.\n\n“So it is, Venerable Sir.”\n\n“What do you think, Bhaddiya, are these qualities wholesome or unwholesome?”\n\n“They are wholesome, Venerable Sir.”\n\n“Are they blameworthy or blameless?”\n\n“They are blameless, Venerable Sir.”\n\n“Are they criticized by the wise or praised by the wise?”\n\n“They are praised by the wise, Venerable Sir.”\n\n“When undertaken and observed, do they conduce to welfare and happiness, or not? How is it in this regard?”\n\n“When undertaken and observed, Venerable Sir, they conduce to welfare and happiness. That is how it is in this regard.”\n\n“Thus, Bhaddiya, what we told you before was this: ‘Come, Bhaddiya, do not go by mere report, nor by tradition, nor by hearsay, nor by the authority of scriptural collections, nor by reasoning, nor by inference, nor by contemplating appearances, nor by the acceptance of a view after pondering it, nor by the impression of suitability, nor by thinking, “The recluse is our teacher.”’ When you yourselves, Bhaddiya, know: ‘These qualities are wholesome, these qualities are blameless, these qualities are praised by the wise, these qualities, when undertaken and observed, conduce to welfare and happiness,’ then, Bhaddiya, you should enter upon and abide in them. What was said, was said with reference to this.\n\n“Indeed, Bhaddiya, those truly good persons in the world exhort a disciple thus: ‘Come, good person, abide having abandoned greed. Abiding having abandoned greed, you will not perform actions born of greed by body, speech, or mind. Abide having abandoned hatred. Abiding having abandoned hatred, you will not perform actions born of hatred by body, speech, or mind. Abide having abandoned delusion. Abiding having abandoned delusion, you will not perform actions born of delusion by body, speech, or mind. Abide having abandoned contentious striving. Abiding having abandoned contentious striving, you will not perform actions born of contention by body, speech, or mind.’”\n\nWhen this was said, Bhaddiya the Licchavi spoke to the Blessed One thus: “Excellent, Venerable Sir! Excellent, Venerable Sir! Just as, Venerable Sir, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or carry a lamp in the darkness so that those with eyes might see forms, even so has the Dhamma been made clear in many ways by the Blessed One. May the Blessed One accept me, Venerable Sir, as a lay follower who has taken refuge from this day forth for as long as life lasts.”\n\n“Now, Bhaddiya, did I ever say to you: ‘Come, Bhaddiya, be my disciple; I will be your teacher’?”\n\n“No indeed, Venerable Sir.”\n\n“But, Bhaddiya, some recluses and brahmins falsely, vainly, untruthfully, and without basis, accuse me, who speaks and teaches thus, saying: ‘The recluse Gotama is a conjurer; he knows a converting magic by which he converts the disciples of other sects.’”\n\n“It is good magic, Venerable Sir, this converting magic. It is lovely magic, Venerable Sir, this converting magic. May my dear relatives and kinsmen be converted by this converting magic! That would be for the long-term welfare and happiness of my dear relatives and kinsmen. Even if all warriors, Venerable Sir, were converted by this converting magic, that would be for the long-term welfare and happiness of all warriors. Even if all brahmins, all merchants, all laborers, Venerable Sir, were converted by this converting magic, that would be for the long-term welfare and happiness of all laborers.”\n\n“So it is, Bhaddiya, so it is! Even if all warriors, Bhaddiya, were converted by this converting magic for the abandoning of unwholesome qualities and for the undertaking of wholesome qualities, that would be for the long-term welfare and happiness of all warriors. Even if all brahmins, all merchants, all laborers, Bhaddiya, were converted for the abandoning of unwholesome qualities and for the undertaking of wholesome qualities, that would be for the long-term welfare and happiness of all laborers. Even if the world with its devas, its Māra, its Brahmā, its population of recluses and brahmins, its devas and humans, Bhaddiya, were converted by this converting magic for the abandoning of unwholesome qualities and for the undertaking of wholesome qualities, that would be for the long-term welfare and happiness of that whole world with its devas, its Māra, its Brahmā, its population of recluses and brahmins, its devas and humans. Even if these great sal trees, Bhaddiya, were converted by this converting magic for the abandoning of unwholesome qualities and for the undertaking of wholesome qualities, that would be for the long-term welfare and happiness of these great sal trees. What then to speak of human beings!”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ විශාලා මහනුවර මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩසිටින සේක. එවිට භද්දිය නම් ලිච්ඡවී කුමාරයා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩිවිය. එක් පසෙක වාඩිවූ භද්දිය ලිච්ඡවී කුමාරයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"ස්වාමීනි, 'ශ්‍රමණ ගෞතමයන් වහන්සේ මායාවී ය, අන්‍ය තීර්ථකයන්ගේ ශ්‍රාවකයන් තම වෙත හරවා ගන්නා ආවර්තන මායාවක් දනී' යනුවෙන් මා අසා ඇත. ස්වාමීනි, 'ශ්‍රමණ ගෞතමයන් වහන්සේ මායාවී ය, අන්‍ය තීර්ථකයන්ගේ ශ්‍රාවකයන් තමා වෙත හරවා ගන්නා ආවර්තන මායාවක් දනී' යැයි යම් කෙනෙක් කියන්නාහුද, ස්වාමීනි, ඔවුහු භාග්‍යවතුන් වහන්සේගේ වචනයම කීවාහුද? භාග්‍යවතුන් වහන්සේට අසත්‍යයෙන් චෝදනා නොකළාහුද? ධර්මයට අනුකූලවම කරුණු ප්‍රකාශ කළාහුද? ධර්මයට අනුව සාකච්ඡා කරන කිසිවෙක් දොස් නැගිය යුතු තැනකට නොපැමිණියේද? ස්වාමීනි, අපි භාග්‍යවතුන් වහන්සේට චෝදනා කිරීමට අකමැත්තෙමු.\"\n\n\"භද්දිය, නුඹලා පැමිණෙව්. කටින් කට පැතිරෙන ආරංචිවලින් (අනුශ්‍රවයෙන්) නොගන්න. පරම්පරාගතව පැවත එන කරුණු නිසා නොගන්න. 'එසේ කීවා' යැයි කියන කතාවලින් නොගන්න. පිටක සම්ප්‍රදාය (තම ආගමික ග්‍රන්ථ) නිසා නොගන්න. තර්ක හේතු කොටගෙන නොගන්න. න්‍යාය හේතු කොටගෙන නොගන්න. ආකාර (පෙනුම) අනුව විතර්ක කිරීමෙන් නොගන්න. දෘෂ්ටීන්ගේ ක්‍ෂාන්තිය (තම දෘෂ්ටියට ඇති කැමැත්ත) නිසා නොගන්න. යම් පුද්ගලයකුගේ යහපත් රූපශෝභාව (භව්‍ය රූපය) නිසා නොගන්න. 'මේ ශ්‍රමණයෝ අපගේ ගුරුවරයෝය' යන කාරණය නිසා නොගන්න. භද්දිය, යම් කලෙක නුඹලාම දැනගන්නවා නම් 'මේ ධර්ම (ගුණධර්ම) අකුසල ධර්මයෝය, මේ ධර්ම සාපරාධී ය, මේ ධර්ම විඥානයන් (නුවණැත්තන්) විසින් ගැරහිය යුත්තෝ ය, මේ ධර්ම මැනවින් පිළිගෙන සමාදන් වූ කල්හි අහිත පිණිස දුක පිණිස පවතී' යැයි, එවිට භද්දිය, නුඹලා ඒවා අත්හරින්න.\"\n\n\"භද්දිය, මේ කුමක් සිතන්නෙහිද? පුද්ගලයකු තුළ ලෝභය ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද?\" \"අහිත පිණිසයි, ස්වාමීනි.\" \"භද්දිය, ලෝභයෙන් යටපත් වූ, සිත මුළා වූ ලෝභී පුද්ගලයා ප්‍රාණඝාතයද කරයි, නොදැක්කාද ගනී, පරදාර සේවනයද කරයි, මුසාවාදද කියයි. අන් අයවද එබඳු දෑ කිරීමට පොළඹවයි. මේවා බොහෝ කලක් තිස්සේ අහිත පිණිස දුක පිණිස පවතී.\" \"එසේය, ස්වාමීනි.\"\n\n\"භද්දිය, මේ කුමක් සිතන්නෙහිද? පුද්ගලයකු තුළ ද්වේෂය ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද? පුද්ගලයකු තුළ මෝහය ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද? පුද්ගලයකු තුළ ආරම්භය (සැරවීම) ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද?\" \"අහිත පිණිසයි, ස්වාමීනි.\" \"භද්දිය, සැරවීමෙන් යටපත් වූ, සිත මුළා වූ, සැරපරුෂ පුද්ගලයා ප්‍රාණඝාතයද කරයි, නොදැක්කාද ගනී, පරදාර සේවනයද කරයි, මුසාවාදද කියයි. අන් අයවද එබඳු දෑ කිරීමට පොළඹවයි. මේවා බොහෝ කලක් තිස්සේ අහිත පිණිස දුක පිණිස පවතී.\" \"එසේය, ස්වාමීනි.\"\n\n\"භද්දිය, මේ කුමක් සිතන්නෙහිද? මේ ධර්ම කුසලද අකුසලද?\" \"අකුසලයි, ස්වාමීනි.\" \"සාපරාධීද අනුපරාධීද?\" \"සාපරාධීයි, ස්වාමීනි.\" \"විඥානයන් විසින් ගැරහිය යුත්තාද ප්‍රශංසා කළ යුත්තාද?\" \"විඥානයන් විසින් ගැරහිය යුත්තායි, ස්වාමීනි.\" \"මැනවින් පිළිගෙන සමාදන් වූ කල්හි අහිත පිණිස දුක පිණිස පවතීද, නැද්ද? නැතහොත් මෙහිදී කුමක් සිදුවේද?\" \"ස්වාමීනි, මැනවින් පිළිගෙන සමාදන් වූ කල්හි අහිත පිණිස දුක පිණිස පවතී. මෙහිදී අපට එසේ සිදුවේ.\"\n\n\"භද්දිය, 'නුඹලා පැමිණෙව්. කටින් කට පැතිරෙන ආරංචිවලින් (අනුශ්‍රවයෙන්) නොගන්න. පරම්පරාගතව පැවත එන කරුණු නිසා නොගන්න. 'එසේ කීවා' යැයි කියන කතාවලින් නොගන්න. පිටක සම්ප්‍රදාය (තම ආගමික ග්‍රන්ථ) නිසා නොගන්න. තර්ක හේතු කොටගෙන නොගන්න. න්‍යාය හේතු කොටගෙන නොගන්න. ආකාර (පෙනුම) අනුව විතර්ක කිරීමෙන් නොගන්න. දෘෂ්ටීන්ගේ ක්‍ෂාන්තිය (තම දෘෂ්ටියට ඇති කැමැත්ත) නිසා නොගන්න. යම් පුද්ගලයකුගේ යහපත් රූපශෝභාව (භව්‍ය රූපය) නිසා නොගන්න. 'මේ ශ්‍රමණයෝ අපගේ ගුරුවරයෝය' යන කාරණය නිසා නොගන්න. භද්දිය, යම් කලෙක නුඹලාම දැනගන්නවා නම් 'මේ ධර්ම අකුසල ධර්මයෝය, මේ ධර්ම සාපරාධී ය, මේ ධර්ම විඥානයන් විසින් ගැරහිය යුත්තෝ ය, මේ ධර්ම මැනවින් පිළිගෙන සමාදන් වූ කල්හි අහිත පිණිස දුක පිණිස පවතී' යැයි, එවිට භද්දිය, නුඹලා ඒවා අත්හරින්න' යැයි යම් දෙයක් අපි ඔබට කීවෙමුද, එය මේ කරුණ අරබයා කීවකි.\"\n\n\"භද්දිය, නුඹලා පැමිණෙව්. කටින් කට පැතිරෙන ආරංචිවලින් (අනුශ්‍රවයෙන්) නොගන්න. පරම්පරාගතව පැවත එන කරුණු නිසා නොගන්න. 'එසේ කීවා' යැයි කියන කතාවලින් නොගන්න. පිටක සම්ප්‍රදාය (තම ආගමික ග්‍රන්ථ) නිසා නොගන්න. තර්ක හේතු කොටගෙන නොගන්න. න්‍යාය හේතු කොටගෙන නොගන්න. ආකාර (පෙනුම) අනුව විතර්ක කිරීමෙන් නොගන්න. දෘෂ්ටීන්ගේ ක්‍ෂාන්තිය (තම දෘෂ්ටියට ඇති කැමැත්ත) නිසා නොගන්න. යම් පුද්ගලයකුගේ යහපත් රූපශෝභාව (භව්‍ය රූපය) නිසා නොගන්න. 'මේ ශ්‍රමණයෝ අපගේ ගුරුවරයෝය' යන කාරණය නිසා නොගන්න. භද්දිය, යම් කලෙක නුඹලාම දැනගන්නවා නම් 'මේ ධර්ම කුසල ධර්මයෝය, මේ ධර්ම අනුපරාධී ය, මේ ධර්ම විඥානයන් විසින් ප්‍රශංසා කළ යුත්තෝ ය, මේ ධර්ම මැනවින් පිළිගෙන සමාදන් වූ කල්හි හිත පිණිස සුව පිණිස පවතී' යැයි, එවිට භද්දිය, නුඹලා ඒවා පිළිගෙන වාසය කරන්න.\"\n\n\"භද්දිය, මේ කුමක් සිතන්නෙහිද? පුද්ගලයකු තුළ අලෝභය (ලෝභ නැති බව) ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද?\" \"හිත පිණිසයි, ස්වාමීනි.\" \"භද්දිය, ලෝභයෙන් යටපත් නොවූ, සිත මුළා නොවූ, අලෝභී පුද්ගලයා ප්‍රාණඝාතය නොකරයි, නොදැක්කා නොගනී, පරදාර සේවනය නොකරයි, මුසාවාද නොකියයි. අන් අයවද එබඳු දෑ කිරීමට පොළඹවන්නේද නැත. මේවා බොහෝ කලක් තිස්සේ හිත පිණිස සුව පිණිස පවතී.\" \"එසේය, ස්වාමීනි.\"\n\n\"භද්දිය, මේ කුමක් සිතන්නෙහිද? පුද්ගලයකු තුළ අද්වේෂය ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද? පුද්ගලයකු තුළ අමෝහය ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද? පුද්ගලයකු තුළ අසාරම්භය (සැරවීමක් නැති බව) ඇතිවන කල්හි, එය හිත පිණිස හෝ අහිත පිණිස ඇතිවන්නේද?\" \"හිත පිණිසයි, ස්වාමීනි.\"\n\nභද්දිය, යම් පුරුෂ පුද්ගලයෙක් සංක්ෂෝභයකින් තොරව, සංක්ෂෝභයෙන් යට නොවී, නොකැළඹුණු සිතකින් යුක්තව ප්‍රාණඝාතය නොකරයි, අදත්තාදානය නොකරයි, කාමමිථ්‍යාචාරයෙහි නොයෙදෙයි, මුසාවාදයෙන් වැළකෙයි, අනුන්වත් ඒ සඳහා පොලඹවන්නේ නැත. එය දීර්ඝ කාලයක් ඔහුට හිතසුව පිණිස වන්නේය. භන්තේ, එසේය. භද්දිය, කුමක්ද ඔබ මේ ධර්මයන් කුසල් හෝ අකුසල් යැයි සිතන්නේ? භන්තේ, කුසල්ය. සාපරාධී හෝ නිරපරාධී යැයි? භන්තේ, නිරපරාධී ය. විඤ්ඤූන් විසින් ගැරහීමට ලක්වූවක් හෝ විඤ්ඤූන් විසින් ප්‍රශංසාවට ලක්වූවක් යැයි? භන්තේ, විඤ්ඤූන් විසින් ප්‍රශංසාවට ලක්වූවක් ය. සම්පූර්ණ කොට, සමාදන් කොට ගත් කළ හිතසුව පිණිස පවතීද නැද්ද? නැතිනම් මෙහි කෙසේද? භන්තේ, සම්පූර්ණ කොට, සමාදන් කොට ගත් කළ හිතසුව පිණිස පවතී. මෙහි එසේ වන්නේය. භද්දිය, ‘මෙසේ මා විසින් ඔබට කියන ලද්දේය: ‘භද්දිය, එන්න, ඔබලා අනුශ්‍රවයෙන් (පරපුරෙන් ඇසීමෙන්) නොපිළිගන්න, පරම්පරාගත කරුණු නිසා නොපිළිගන්න, මෙසේ යැයි කියන ලද දේ නිසා නොපිළිගන්න, පිටක සම්ප්‍රදානයෙන් නොපිළිගන්න, තර්ක හේතුවෙන් නොපිළිගන්න, න්‍යාය හේතුවෙන් නොපිළිගන්න, ආකාරය පිළිබඳ විතර්ක කිරීමෙන් නොපිළිගන්න, දෘෂ්ටි නිෂ්ඨාක්ෂාන්තියෙන් (තමන්ට රුචි දෘෂ්ටිය පිළිගැනීමෙන්) නොපිළිගන්න, භාව්‍ය රූපයෙන් (දක්ෂතා හෝ හැකියාව නිසා) නොපිළිගන්න, ‘ශ්‍රමණයන් අපේ ගුරුය’ යන කාරණයෙන් නොපිළිගන්න. භද්දිය, යම් කලක ඔබලා විසින්ම ‘මේ ධර්මයන් කුසල් ය, මේ ධර්මයන් නිරවද්‍ය ය, මේ ධර්මයන් විඤ්ඤූන් විසින් ප්‍රශංසාවට ලක්වූ ඒවා ය, මේ ධර්මයන් සම්පූර්ණ කොට සමාදන් වූ විට හිතසුව පිණිස පවතී’ යැයි දැනගන්නවා නම්, එවිට භද්දිය, ඔබලා ඒවා සමාදන්ව වාසය කරව්’ යැයි යමක් කියන ලද්දේ ද, ඒ කියන ලද්දේ මෙය අරමුණු කොට ය.\n\nභද්දිය, ලෝකයේ යම් සත්පුරුෂයෝ ඇත්තෝ ද, ඔව්හු ශ්‍රාවකයා මෙසේ සමාදන් කරවති: ‘අම්බෝ පුරුෂය, එන්න, තොප ලෝභය දුරුකොට වාසය කරව. ලෝභය දුරුකොට වාසය කරන්නා කාය, වාක්, මන යන තිදොරින් ලෝභය නිසා උපදින කර්ම නොකරන්නේය. ද්වේෂය දුරුකොට වාසය කරව. ද්වේෂය දුරුකොට වාසය කරන්නා කාය, වාක්, මන යන තිදොරින් ද්වේෂය නිසා උපදින කර්ම නොකරන්නේය. මෝහය දුරුකොට වාසය කරව. මෝහය දුරුකොට වාසය කරන්නා කාය, වාක්, මන යන තිදොරින් මෝහය නිසා උපදින කර්ම නොකරන්නේය. සංක්ෂෝභය දුරුකොට වාසය කරව. සංක්ෂෝභය දුරුකොට වාසය කරන්නා කාය, වාක්, මන යන තිදොරින් සංක්ෂෝභය නිසා උපදින කර්ම නොකරන්නේය’ කියා.\n\nමෙසේ වදාළ කල්හි භද්දිය නම් ලිච්ඡවී තෙම භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භන්තේ, ඉතා මැනවි... භන්තේ, අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයකු ලෙස භාග්‍යවතුන් වහන්සේ මා පිළිගන්නා සේක්වා.” “භද්දිය, ‘එන්න, භද්දිය, මාගේ ශ්‍රාවකයෙක් වන්න; මම ශාස්තෘ වන්නෙමි’ යැයි මම ඔබට කීවෙම්ද?” “භන්තේ, එසේ නොවේ.” “භද්දිය, මෙසේ කියන්නා වූ ද, මෙසේ දේශනා කරන්නා වූ ද මා සමහර ශ්‍රමණ බ්‍රාහ්මණයෝ අසත්‍යයෙන්, හිස් බවකින්, මුසාවාදයෙන්, අභූතයෙන් චෝදනා කරති, ‘ශ්‍රමණ ගෞතමයා මායාකාරයෙකි, ඔහු වෙනත් තීර්ථකයන්ගේ ශ්‍රාවකයන් තමා වෙත හරවා ගන්නා ආවර්තනී මායාවක් දන්නේය’ කියා.”\n\n“භන්තේ, ඒ ආවර්තනී මායාව යහපත්ය. භන්තේ, ඒ ආවර්තනී මායාව සුන්දරය. භන්තේ, මාගේ ප්‍රිය ඥාති සාලෝහිතයෝ ද මේ ආවර්තනී මායාවෙන් හැරෙත්වා! මාගේ ප්‍රිය ඥාති සාලෝහිතයන්ට ද එය දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේය. භන්තේ, සියලු ක්ෂත්‍රියයෝ ද මේ ආවර්තනී මායාවෙන් හැරෙත්වා නම්, ඒ සියලු ක්ෂත්‍රියයන්ට ද දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේය. භන්තේ, සියලු බ්‍රාහ්මණයෝ... වෛශ්‍යයෝ... ශුද්‍රයෝ ද මේ ආවර්තනී මායාවෙන් හැරෙත්වා නම්, ඒ සියලු ශුද්‍රයන්ට ද දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේය.”\n\n“භද්දිය, එසේමය, භද්දිය, එසේමය! භද්දිය, සියලු ක්ෂත්‍රියයෝ ද අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස, කුසල ධර්මයන් සමාදන් වීම පිණිස මේ ආවර්තනී මායාවෙන් හැරෙත්වා නම්, ඒ සියලු ක්ෂත්‍රියයන්ට ද දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේය. භද්දිය, සියලු බ්‍රාහ්මණයෝ... වෛශ්‍යයෝ... ශුද්‍රයෝ ද අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස, කුසල ධර්මයන් සමාදන් වීම පිණිස හැරෙත්වා නම්, ඒ සියලු ශුද්‍රයන්ට ද දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේය. භද්දිය, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත දෙවිමිනිසුන් සහිත සියලු ලෝක සත්ව සමූහය ද අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස, කුසල ධර්මයන් සමාදන් වීම පිණිස මේ ආවර්තනී මායාවෙන් හැරෙත්වා නම්, ඒ දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත දෙවිමිනිසුන් සහිත සියලු ලෝක සත්ව සමූහයාට ද දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේය. භද්දිය, මේ මහා සල් ගස් ද අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස, කුසල ධර්මයන් සමාදන් වීම පිණිස මේ ආවර්තනී මායාවෙන් හැරෙත්වා නම්, මේ මහා සල් ගස්වලට ද දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේය. මනුෂ්‍ය භාවයට පත් වූවන් ගැන කියනුම කවරේද!”",
      "paliTitle": "Bhaddiyasuttaṃ",
      "englishTitle": "Bhaddiya Sutta",
      "sinhalaTitle": "භද්දිය සූත්‍රය"
    },
    {
      "number": 194,
      "pali": "Ekaṃ samayaṃ āyasmā ānando koliyesu viharati sāmugaṃ nāma [sāpūgaṃ nāma (sī. syā. kaṃ. pī.)] koliyānaṃ nigamo. Atha kho sambahulā sāmugiyā koliyaputtā yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te sāmugiye koliyaputte āyasmā ānando etadavoca – ‘‘Cattārimāni, byagghapajjā, pārisuddhipadhāniyaṅgāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātāni sattānaṃ visuddhiyā sokaparidevānaṃ [sokapariddavānaṃ (sī.)] samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya. Katamāni cattāri? Sīlapārisuddhipadhāniyaṅgaṃ, cittapārisuddhipadhāniyaṅgaṃ, diṭṭhipārisuddhipadhāniyaṅgaṃ, vimuttipārisuddhipadhāniyaṅgaṃ. ‘‘Katamañca, byagghapajjā, sīlapārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Ayaṃ vuccati, byagghapajjā, sīlapārisuddhi. Iti evarūpiṃ sīlapārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, sīlapārisuddhipadhāniyaṅgaṃ. ‘‘Katamañca, byagghapajjā, cittapārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, byagghapajjā, cittapārisuddhi. Iti evarūpiṃ cittapārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, cittapārisuddhipadhāniyaṅgaṃ. ‘‘Katamañca, byagghapajjā, diṭṭhipārisuddhipadhāniyaṅgaṃ? Idha, byagghapajjā, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Ayaṃ vuccati, byagghapajjā, diṭṭhipārisuddhi. Iti evarūpiṃ diṭṭhipārisuddhiṃ aparipūraṃ vā…pe… tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, diṭṭhipārisuddhipadhāniyaṅgaṃ. ‘‘Katamañca, byagghapajjā, vimuttipārisuddhipadhāniyaṅgaṃ? Sa kho so, byagghapajjā, ariyasāvako iminā ca sīlapārisuddhipadhāniyaṅgena samannāgato iminā ca cittapārisuddhipadhāniyaṅgena samannāgato iminā ca diṭṭhipārisuddhipadhāniyaṅgena samannāgato rajanīyesu dhammesu cittaṃ virājeti, vimocanīyesu dhammesu cittaṃ vimoceti. So rajanīyesu dhammesu cittaṃ virājetvā, vimocanīyesu dhammesu cittaṃ vimocetvā sammāvimuttiṃ phusati. Ayaṃ vuccati, byagghapajjā, vimuttipārisuddhi. Iti evarūpiṃ vimuttipārisuddhiṃ aparipūraṃ vā paripūressāmi paripūraṃ vā tattha tattha paññāya anuggahessāmīti, yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca, idaṃ vuccati, byagghapajjā, vimuttipārisuddhipadhāniyaṅgaṃ. ‘‘Imāni kho, byagghapajjā, cattāri pārisuddhipadhāniyaṅgāni tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātāni sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā’’ti. Catutthaṃ.",
      "english": "At one time, the Venerable Ānanda was dwelling among the Koliyans, at a town of the Koliyans named Sāmuga. Then, a number of Koliyan youths from Sāmuga approached the Venerable Ānanda. Having approached, they paid homage to the Venerable Ānanda and sat down to one side. As those Koliyan youths from Sāmuga sat to one side, the Venerable Ānanda spoke to them thus:\n\n\"Byagghapajja, there are these four factors for purification and endeavor, which have been well-proclaimed by the Blessed One—the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One—for the purification of beings, for the surmounting of sorrow and lamentation, for the disappearance of pain and displeasure, for the attainment of the path, for the realization of Nibbāna. Which four? The factor for purification and endeavor of moral conduct, the factor for purification and endeavor of mind, the factor for purification and endeavor of view, and the factor for purification and endeavor of liberation.\"\n\n\"And what, Byagghapajja, is the factor for purification and endeavor of moral conduct? Here, Byagghapajja, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha rules, perfect in conduct and domain, seeing danger in the slightest faults, and undertaking the training in the precepts. This, Byagghapajja, is called the purification of moral conduct. 'As for this purification of moral conduct—if it is incomplete, I will fulfill it; if it is complete, I will assist it with wisdom in its various aspects.' The desire, effort, zeal, enthusiasm, unflagging persistence, mindfulness, and clear comprehension concerning this endeavor—this, Byagghapajja, is called the factor for purification and endeavor of moral conduct.\"\n\n\"And what, Byagghapajja, is the factor for purification and endeavor of mind? Here, Byagghapajja, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna, which is accompanied by applied and sustained thought, born of seclusion, and filled with rapture and pleasure. With the subsiding of applied and sustained thought, he enters and dwells in the second jhāna, which has internal serenity and unification of mind, is without applied and sustained thought, and is born of concentration, filled with rapture and pleasure. With the fading away of rapture, he dwells equanimous, mindful and clearly comprehending, and he experiences pleasure with the body; he enters and dwells in the third jhāna, concerning which the noble ones declare: 'He dwells equanimous and mindful, one who has a pleasurable abiding.' With the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, he enters and dwells in the fourth jhāna, which is neither painful nor pleasant, and includes purity of mindfulness due to equanimity. This, Byagghapajja, is called the purification of mind. 'As for this purification of mind—if it is incomplete, I will fulfill it; if it is complete, I will assist it with wisdom in its various aspects.' The desire, effort, zeal, enthusiasm, unflagging persistence, mindfulness, and clear comprehension concerning this endeavor—this, Byagghapajja, is called the factor for purification and endeavor of mind.\"\n\n\"And what, Byagghapajja, is the factor for purification and endeavor of view? Here, Byagghapajja, a bhikkhu understands 'this is suffering' as it actually is; he understands 'this is the origin of suffering' as it actually is; he understands 'this is the cessation of suffering' as it actually is; he understands 'this is the path leading to the cessation of suffering' as it actually is. This, Byagghapajja, is called the purification of view. 'As for this purification of view—if it is incomplete, I will fulfill it; if it is complete, I will assist it with wisdom in its various aspects.' The desire, effort, zeal, enthusiasm, unflagging persistence, mindfulness, and clear comprehension concerning this endeavor—this, Byagghapajja, is called the factor for purification and endeavor of view.\"\n\n\"And what, Byagghapajja, is the factor for purification and endeavor of liberation? That noble disciple, Byagghapajja, being endowed with this factor for purification and endeavor of moral conduct, with this factor for purification and endeavor of mind, and with this factor for purification and endeavor of view, disenchants the mind from things that arouse lust, and liberates the mind from things that are to be liberated from. Having disenchanted the mind from things that arouse lust, and having liberated the mind from things that are to be liberated from, he experiences right liberation. This, Byagghapajja, is called the purification of liberation. 'As for this purification of liberation—if it is incomplete, I will fulfill it; if it is complete, I will assist it with wisdom in its various aspects.' The desire, effort, zeal, enthusiasm, unflagging persistence, mindfulness, and clear comprehension concerning this endeavor—this, Byagghapajja, is called the factor for purification and endeavor of liberation.\"\n\n\"These, Byagghapajja, are the four factors for purification and endeavor, which have been well-proclaimed by the Blessed One—the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One—for the purification of beings, for the surmounting of sorrow and lamentation, for the disappearance of pain and displeasure, for the attainment of the path, for the realization of Nibbāna.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කෝලියවරුන් අතර සාමුග නමින් වූ කෝලිය ගම්මානයක වාසය කළහ. ඉක්බිති බොහෝ සාමුගිය කෝලිය පුත්‍රයෝ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට පැමිණියහ. පැමිණ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩහිඳින ඒ සාමුගිය කෝලිය පුත්‍රයන්ට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: \"ව්‍යාඝ්‍රපජ්ජයෙනි, මේ සතරක් පිරිසිදු භාවය පිණිස වූ ප්‍රධාන අංගයෝ වෙති. ඒ භාග්‍යවතුන් වහන්සේ විසින්, යමක් දන්නා වූ, දකිනා වූ, රහත් වූ, සම්‍යක් සම්බුද්ධ වූ (උන්වහන්සේ විසින්) සත්ත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක වැලපීම් ඉක්මවීම පිණිස, දුක් දොම්නස් නැති කිරීම පිණිස, ඥානය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය සාක්ෂාත් කිරීම පිණිස මැනවින් දේශනා කරන ලද්දාහුය. ඒ සතර කවරේද? ශීල විශුද්ධිය පිණිස ප්‍රධාන අංගය, චිත්ත විශුද්ධිය පිණිස ප්‍රධාන අංගය, දෘෂ්ටි විශුද්ධිය පිණිස ප්‍රධාන අංගය, විමුක්ති විශුද්ධිය පිණිස ප්‍රධාන අංගයයි.\n\n\"ව්‍යාඝ්‍රපජ්ජයෙනි, ශීල විශුද්ධිය පිණිස ප්‍රධාන අංගය කවරේද? ව්‍යාඝ්‍රපජ්ජයෙනි, මෙහි භික්ෂුව ශීලවන්ත වේ, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, හැසිරීමෙන් හා ගෝචර ස්ථානවලින් යුක්ත වූයේ, ඉතා සුළු වරදකද භය දකින්නේ, ශික්ෂා පදයන් සමාදන් වී හික්මෙයි. ව්‍යාඝ්‍රපජ්ජයෙනි, මේ ශීල විශුද්ධිය යැයි කියනු ලැබේ. 'මේ ආකාර වූ ශීල විශුද්ධිය අපරිපූර්ණ නම් එය පරිපූර්ණ කරමි, පරිපූර්ණ නම් ඒ ඒ අවස්ථාවන්හිදී ප්‍රඥාවෙන් (එය) රකිමි' යි, ඒ පිළිබඳව යම් කැමැත්තක් ද, උත්සාහයක් ද, උද්‍යෝගයක් ද, වීර්යයක් ද, පසුබට නොවීමක් ද, සිහියක් ද, මනා දැනීමක් ද (සම්පජඤ්ඤයක් ද) ඇත්නම්, ව්‍යාඝ්‍රපජ්ජයෙනි, මේ ශීල විශුද්ධිය පිණිස ප්‍රධාන අංගය යැයි කියනු ලැබේ.\n\n\"ව්‍යාඝ්‍රපජ්ජයෙනි, චිත්ත විශුද්ධිය පිණිස ප්‍රධාන අංගය කවරේද? ව්‍යාඝ්‍රපජ්ජයෙනි, මෙහි භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක විචාර ඇතුව, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක විචාරයන් සංසිඳවීමෙන්, තමා තුළ පැහැදීමක් හා සිතේ එකඟතාවක් ඇති, විතර්ක විචාර නැති, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති ද්විතීය ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියද දුරු කිරීමෙන්, උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව, සුවසේ වාසය කරමින්, ආර්යයන් වහන්සේලා 'උපේක්ෂාවෙන් යුක්තව සිහියෙන් වාසය කරයි' යැයි වදාළ තුන්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි. සැපයද දුරු කිරීමෙන්, දුකද දුරු කිරීමෙන්, පෙරදී සෝමනස්ස දෝමනස්සයන් අස්තංගමනය කිරීමෙන්, දුක් සැප නැති, උපේක්ෂා සිහියෙන් පිරිසිදු වූ සිව්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි. ව්‍යාඝ්‍රපජ්ජයෙනි, මේ චිත්ත විශුද්ධිය යැයි කියනු ලැබේ. 'මේ ආකාර වූ චිත්ත විශුද්ධිය අපරිපූර්ණ නම් එය පරිපූර්ණ කරමි, පරිපූර්ණ නම් ඒ ඒ අවස්ථාවන්හිදී ප්‍රඥාවෙන් (එය) රකිමි' යි, ඒ පිළිබඳව යම් කැමැත්තක් ද, උත්සාහයක් ද, උද්‍යෝගයක් ද, වීර්යයක් ද, පසුබට නොවීමක් ද, සිහියක් ද, මනා දැනීමක් ද (සම්පජඤ්ඤයක් ද) ඇත්නම්, ව්‍යාඝ්‍රපජ්ජයෙනි, මේ චිත්ත විශුද්ධිය පිණිස ප්‍රධාන අංගය යැයි කියනු ලැබේ.\n\n\"ව්‍යාඝ්‍රපජ්ජයෙනි, දෘෂ්ටි විශුද්ධිය පිණිස ප්‍රධාන අංගය කවරේද? ව්‍යාඝ්‍රපජ්ජයෙනි, මෙහි භික්ෂුව 'මේ දුකයි' යැයි යථාභූතව දනියි, 'මේ දුක ඇතිවීමට හේතුවයි' යැයි යථාභූතව දනියි, 'මේ දුක නැති කිරීමයි' යැයි යථාභූතව දනියි, 'මේ දුක් නිරෝධගාමිනී ප්‍රතිපදාවයි' යැයි යථාභූතව දනියි. ව්‍යාඝ්‍රපජ්ජයෙනි, මේ දෘෂ්ටි විශුද්ධිය යැයි කියනු ලැබේ. 'මේ ආකාර වූ දෘෂ්ටි විශුද්ධිය අපරිපූර්ණ නම් එය පරිපූර්ණ කරමි, පරිපූර්ණ නම් ඒ ඒ අවස්ථාවන්හිදී ප්‍රඥාවෙන් (එය) රකිමි' යැයි, ඒ පිළිබඳව යම් කැමැත්තක් ද, උත්සාහයක් ද, උද්‍යෝගයක් ද, වීර්යයක් ද, පසුබට නොවීමක් ද, සිහියක් ද, මනා දැනීමක් ද (සම්පජඤ්ඤයක් ද) ඇත්නම්, ව්‍යාඝ්‍රපජ්ජයෙනි, මේ දෘෂ්ටි විශුද්ධිය පිණිස ප්‍රධාන අංගය යැයි කියනු ලැබේ.\n\n\"ව්‍යාඝ්‍රපජ්ජයෙනි, විමුක්ති විශුද්ධිය පිණිස ප්‍රධාන අංගය කවරේද? ව්‍යාඝ්‍රපජ්ජයෙනි, ඒ ආර්ය ශ්‍රාවක තෙමේ මේ ශීල විශුද්ධිය පිණිස ප්‍රධාන අංගයෙන් යුක්ත වී, මේ චිත්ත විශුද්ධිය පිණිස ප්‍රධාන අංගයෙන් යුක්ත වී, මේ දෘෂ්ටි විශුද්ධිය පිණිස ප්‍රධාන අංගයෙන් යුක්ත වී, රාගය ඇති කරන ස්වභාවයන් කෙරෙහි සිත විරූපී කරයි (කැමැත්ත දුරු කරයි), නිදහස් විය යුතු ස්වභාවයන්ගෙන් සිත නිදහස් කරයි. හෙතෙම රාගය ඇති කරන ස්වභාවයන් කෙරෙහි සිත විරූපී කොට, නිදහස් විය යුතු ස්වභාවයන්ගෙන් සිත නිදහස් කොට සම්‍යක් විමුක්තිය ස්පර්ශ කරයි. ව්‍යාඝ්‍රපජ්ජයෙනි, මේ විමුක්ති විශුද්ධිය යැයි කියනු ලැබේ. 'මේ ආකාර වූ විමුක්ති විශුද්ධිය අපරිපූර්ණ නම් එය පරිපූර්ණ කරමි, පරිපූර්ණ නම් ඒ ඒ අවස්ථාවන්හිදී ප්‍රඥාවෙන් (එය) රකිමි' යි, ඒ පිළිබඳව යම් කැමැත්තක් ද, උත්සාහයක් ද, උද්‍යෝගයක් ද, වීර්යයක් ද, පසුබට නොවීමක් ද, සිහියක් ද, මනා දැනීමක් ද (සම්පජඤ්ඤයක් ද) ඇත්නම්, ව්‍යාඝ්‍රපජ්ජයෙනි, මේ විමුක්ති විශුද්ධිය පිණිස ප්‍රධාන අංගය යැයි කියනු ලැබේ.\n\n\"ව්‍යාඝ්‍රපජ්ජයෙනි, මේ සතරක් පිරිසිදු භාවය පිණිස වූ ප්‍රධාන අංගයෝ ඒ භාග්‍යවතුන් වහන්සේ විසින්, යමක් දන්නා වූ, දකිනා වූ, රහත් වූ, සම්‍යක් සම්බුද්ධ වූ (උන්වහන්සේ විසින්) සත්ත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක වැලපීම් ඉක්මවීම පිණිස, දුක් දොම්නස් නැති කිරීම පිණිස, ඥානය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය සාක්ෂාත් කිරීම පිණිස මැනවින් දේශනා කරන ලද්දාහුය.\"",
      "paliTitle": "Sāmugiyasuttaṃ",
      "englishTitle": "Sāmugiya Discourse",
      "sinhalaTitle": "සාමුගිය සූත්‍‍රය"
    },
    {
      "number": 195,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho vappo sakko nigaṇṭhasāvako yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho vappaṃ sakkaṃ nigaṇṭhasāvakaṃ āyasmā mahāmoggallāno etadavoca – ‘‘Idhassa, vappa, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto avijjāvirāgā vijjuppādā. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ [anvāssaveyyuṃ (ka.)] abhisamparāya’’nti? ‘‘Passāmahaṃ, bhante, taṃ ṭhānaṃ. Idhassa, bhante, pubbe pāpakammaṃ kataṃ avipakkavipākaṃ. Tatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti. Ayañceva kho pana āyasmato mahāmoggallānassa vappena sakkena nigaṇṭhasāvakena saddhiṃ antarākathā vippakatā hoti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘Kāya nuttha, moggallāna, etarahi kathāya sannisinnā; kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idhāhaṃ, bhante, vappaṃ sakkaṃ nigaṇṭhasāvakaṃ etadavocaṃ – ‘idhassa, vappa, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto avijjāvirāgā vijjuppādā. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’nti? Evaṃ vutte, bhante, vappo sakko nigaṇṭhasāvako maṃ etadavoca – ‘passāmahaṃ, bhante, taṃ ṭhānaṃ. Idhassa, bhante, pubbe pāpakammaṃ kataṃ avipakkavipākaṃ. Tatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’nti. Ayaṃ kho no, bhante, vappena sakkena nigaṇṭhasāvakena saddhiṃ antarākathā vippakatā; atha bhagavā anuppatto’’ti. Atha kho bhagavā vappaṃ sakkaṃ nigaṇṭhasāvakaṃ etadavoca – ‘‘sace me tvaṃ, vappa, anuññeyyañceva anujāneyyāsi, paṭikkositabbañca paṭikkoseyyāsi, yassa ca me bhāsitassa atthaṃ na jāneyyāsi mamevettha uttari paṭipuccheyyāsi – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti, siyā no ettha kathāsallāpo’’ti. ‘‘Anuññeyyañcevāhaṃ, bhante, bhagavato anujānissāmi, paṭikkositabbañca paṭikkosissāmi, yassa cāhaṃ bhagavato bhāsitassa atthaṃ na jānissāmi bhagavantaṃyevettha uttari paṭipucchissāmi – ‘idaṃ bhante, kathaṃ, imassa ko attho’ti? Hotu no ettha kathāsallāpo’’ti. ‘‘Taṃ kiṃ maññasi, vappa, ye kāyasamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, kāyasamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti, sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi [viññūhīti (sī. pī. ka.) saṃ. ni. 4.364 passitabbaṃ]. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, vappa, ye vacīsamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, vacīsamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, vappa, ye manosamārambhapaccayā uppajjanti āsavā vighātapariḷāhā, manosamārambhā paṭiviratassa evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, vappa, ye avijjāpaccayā uppajjanti āsavā vighātapariḷāhā, avijjāvirāgā vijjuppādā evaṃsa te āsavā vighātapariḷāhā na honti. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Passasi no tvaṃ, vappa, taṃ ṭhānaṃ yatonidānaṃ purisaṃ dukkhavedaniyā āsavā assaveyyuṃ abhisamparāya’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Evaṃ sammā vimuttacittassa kho, vappa, bhikkhuno cha satatavihārā adhigatā honti. So cakkhunā rūpaṃ disvā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…pe... jivhāya rasaṃ sāyitvā…pe… kāyena phoṭṭhabbaṃ phusitvā…pe… manasā dhammaṃ viññā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. So kāyapariyantikaṃ vedanaṃ vediyamāno ‘kāyapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; jīvitapariyantikaṃ vedanaṃ vediyamāno ‘jīvitapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītī bhavissantī’ti pajānāti’’. ‘‘Seyyathāpi, vappa, thūṇaṃ paṭicca chāyā paññāyati. Atha puriso āgaccheyya kuddālapiṭakaṃ ādāya. So taṃ thūṇaṃ mūle chindeyya; mūle chinditvā palikhaṇeyya; palikhaṇitvā mūlāni uddhareyya, antamaso usīranāḷimattānipi [usīranāḷamattānipi (sī.)]. So taṃ thūṇaṃ khaṇḍākhaṇḍikaṃ chindeyya. Khaṇḍākhaṇḍikaṃ chetvā phāleyya. Phāletvā sakalikaṃ sakalikaṃ kareyya. Sakalikaṃ sakalikaṃ katvā vātātape visoseyya. Vātātape visosetvā agginā ḍaheyya. Agginā ḍahetvā masiṃ kareyya. Masiṃ karitvā mahāvāte vā ophuṇeyya nadiyā vā sīghasotāya pavāheyya. Evaṃ hissa, vappa, yā thūṇaṃ paṭicca chāyā sā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. ‘‘Evamevaṃ kho, vappa, evaṃ sammā vimuttacittassa bhikkhuno cha satatavihārā adhigatā honti. So cakkhunā rūpaṃ disvā neva sumano hoti na dummano; upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…pe… jivhāya rasaṃ sāyitvā…pe… kāyena phoṭṭhabbaṃ phusitvā…pe… manasā dhammaṃ viññāya neva sumano hoti na dummano; upekkhako viharati sato sampajāno. So kāyapariyantikaṃ vedanaṃ vediyamāno ‘kāyapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; jīvitapariyantikaṃ vedanaṃ vediyamāno ‘jīvitapariyantikaṃ vedanaṃ vediyāmī’ti pajānāti; ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītī bhavissantī’ti pajānāti’’. Evaṃ vutte vappo sakko nigaṇṭhasāvako bhagavantaṃ etadavoca – ‘‘seyyathāpi, bhante, puriso udayatthiko assapaṇiyaṃ poseyya. So udayañceva nādhigaccheyya, uttariñca kilamathassa vighātassa bhāgī assa. Evamevaṃ kho ahaṃ, bhante, udayatthiko bāle nigaṇṭhe payirupāsiṃ. Svāhaṃ udayañceva nādhigacchiṃ, uttariñca kilamathassa vighātassa bhāgī ahosiṃ. Esāhaṃ, bhante, ajjatagge yo me bālesu nigaṇṭhesu pasādo taṃ mahāvāte vā ophuṇāmi nadiyā vā sīghasotāya pavāhemi. Abhikkantaṃ, bhante… pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ.",
      "english": "One time, the Blessed One was dwelling among the Sakyans in Kapilavatthu, in the Nigrodha Park. Then, Vappa the Sakyan, a follower of the Nigaṇṭhas, approached the venerable Mahāmoggallāna. Having approached and paid homage to the venerable Mahāmoggallāna, he sat down to one side. The venerable Mahāmoggallāna said this to Vappa the Sakyan, the Nigaṇṭha follower, who was sitting to one side: \"Here, Vappa, one is restrained in body, restrained in speech, restrained in mind, by the fading away of ignorance, by the arising of knowledge. Do you, Vappa, discern that condition from which a person's defilements, which bring about painful results, would flow in the next existence?\" \"I discern that condition, venerable sir,\" he replied. \"Here, venerable sir, someone has previously performed unwholesome actions whose results have not yet ripened. From that condition, a person's defilements, which bring about painful results, would flow in the next existence.\" Indeed, this conversation between the venerable Mahāmoggallāna and Vappa the Sakyan, the Nigaṇṭha follower, remained unfinished.\n\nThen, in the evening, the Blessed One arose from his seclusion, approached the service hall, and having approached, sat down on the seat that had been prepared. Having sat down, the Blessed One said this to the venerable Mahāmoggallāna: \"What was the subject of your discussion, Moggallāna, that you were engaged in just now? And what was the conversation that remained unfinished between you?\" \"Here, venerable sir, I said to Vappa the Sakyan, the Nigaṇṭha follower: 'Here, Vappa, one is restrained in body, restrained in speech, restrained in mind, by the fading away of ignorance, by the arising of knowledge. Do you, Vappa, discern that condition from which a person's defilements, which bring about painful results, would flow in the next existence?' When this was said, venerable sir, Vappa the Sakyan, the Nigaṇṭha follower, said to me: 'I discern that condition, venerable sir. Here, venerable sir, someone has previously performed unwholesome actions whose results have not yet ripened. From that condition, a person's defilements, which bring about painful results, would flow in the next existence.' Indeed, venerable sir, this conversation between us and Vappa the Sakyan, the Nigaṇṭha follower, remained unfinished, and then the Blessed One arrived.\"\n\nThen the Blessed One said to Vappa the Sakyan, the Nigaṇṭha follower: \"Vappa, if you would agree to what should be agreed to by me, and reject what should be rejected, and if you would further question me about the meaning of any of my statements that you do not understand, saying 'Venerable sir, how is this? What is the meaning of this?', then we could have a discussion here.\" \"Venerable sir, I will agree to what should be agreed to by the Blessed One, I will reject what should be rejected, and if I do not understand the meaning of any of the Blessed One's statements, I will question the Blessed One further about it, saying: 'Venerable sir, how is this? What is the meaning of this?' Let us indeed have a discussion here.\"\n\n\"What do you think, Vappa? Those defilements, with their associated distress and feverishness, that arise conditioned by bodily exertions – for one who refrains from bodily exertions, do those defilements with their distress and feverishness not arise? He performs no new actions and, by repeatedly touching and experiencing, he brings old actions to an end. This wearing away of defilements is visible here and now, immediate, inviting inspection, onward-leading, and to be directly experienced by the wise. Do you, Vappa, discern that condition from which a person's defilements, which bring about painful results, would flow in the next existence?\" \"No, venerable sir.\"\n\n\"What do you think, Vappa? Those defilements, with their associated distress and feverishness, that arise conditioned by verbal exertions – for one who refrains from verbal exertions, do those defilements with their distress and feverishness not arise? He performs no new actions and, by repeatedly touching and experiencing, he brings old actions to an end. This wearing away of defilements is visible here and now, immediate, inviting inspection, onward-leading, and to be directly experienced by the wise. Do you, Vappa, discern that condition from which a person's defilements, which bring about painful results, would flow in the next existence?\" \"No, venerable sir.\"\n\n\"What do you think, Vappa? Those defilements, with their associated distress and feverishness, that arise conditioned by mental exertions – for one who refrains from mental exertions, do those defilements with their distress and feverishness not arise? He performs no new actions and, by repeatedly touching and experiencing, he brings old actions to an end. This wearing away of defilements is visible here and now, immediate, inviting inspection, onward-leading, and to be directly experienced by the wise. Do you, Vappa, discern that condition from which a person's defilements, which bring about painful results, would flow in the next existence?\" \"No, venerable sir.\"\n\n\"What do you think, Vappa? Those defilements, with their associated distress and feverishness, that arise conditioned by ignorance – by the fading away of ignorance, by the arising of knowledge, do those defilements with their distress and feverishness not arise? He performs no new actions and, by repeatedly touching and experiencing, he brings old actions to an end. This wearing away of defilements is visible here and now, immediate, inviting inspection, onward-leading, and to be directly experienced by the wise. Do you, Vappa, discern that condition from which a person's defilements, which bring about painful results, would flow in the next existence?\"\n\n“No, venerable sir.” “Indeed, Vappa, for a monk whose mind is thus rightly liberated, six continuous abidings are attained. Having seen a form with the eye, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having heard a sound with the ear, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having smelled an odor with the nose, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having tasted a flavor with the tongue, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having felt a tactile sensation with the body, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having cognized a mental phenomenon with the mind, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Experiencing a bodily sensation that is limited by the body, he understands: ‘I am experiencing a bodily sensation limited by the body.’ Experiencing a life-limited sensation, he understands: ‘I am experiencing a sensation limited by life.’ He understands: ‘Upon the breakdown of the body and the exhaustion of the life-faculty, all these sensations, not delighted in, will become cool right here.’”\n\n“Just as, Vappa, a shadow appears dependent on a post. Then a man might come, bringing a hoe and a basket. He would cut down that post at its root; having cut it at its root, he would dig it up; having dug it up, he would extract the roots, even down to the size of a usīra grass fibre. He would cut that post into pieces. Having cut it into pieces, he would split it. Having split it, he would make it into splinters. Having made it into splinters, he would dry it in the wind and sun. Having dried it in the wind and sun, he would burn it with fire. Having burned it with fire, he would reduce it to ash. Having reduced it to ash, he would either scatter it in a strong wind or cast it into a swiftly flowing river. Thus, Vappa, that shadow which appeared dependent on the post, having its root cut off, rendered like a palm stump, made non-existent, is incapable of arising in the future.”\n\n“In the same way, Vappa, for such a monk whose mind is rightly liberated, these six continuous abidings are attained. Having seen a form with the eye, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having heard a sound with the ear, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having smelled an odor with the nose, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having tasted a flavor with the tongue, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having felt a tactile sensation with the body, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Having cognized a mental phenomenon with the mind, he is neither pleased nor displeased; he abides in equanimity, mindful and clearly comprehending. Experiencing a bodily sensation that is limited by the body, he understands: ‘I am experiencing a bodily sensation limited by the body.’ Experiencing a life-limited sensation, he understands: ‘I am experiencing a sensation limited by life.’ He understands: ‘Upon the breakdown of the body and the exhaustion of the life-faculty, all these sensations, not delighted in, will become cool right here.’”\n\nWhen this was said, Vappa the Sakyan, a disciple of the Jains, spoke to the Blessed One thus: “Just as, venerable sir, a man desiring growth might tend a horse-stable. But he would not achieve growth, and furthermore, he would be a partaker of weariness and vexation. In the same way, venerable sir, I, desiring growth, attended upon foolish Jains. But I did not achieve growth, and furthermore, I was a partaker of weariness and vexation. From this day forth, venerable sir, whatever faith I had in those foolish Jains, that I scatter in a strong wind or cast into a swiftly flowing river. Excellent, venerable sir! Excellent, venerable sir! Just as if one were to set upright what had been overthrown, or reveal what had been hidden, or point out the way to one who was lost, or bring a lamp into the darkness so that those with eyes might see forms—in the same way, the Dhamma has been made clear in many ways by the Blessed One. I go for refuge to the Blessed One, and to the Dhamma, and to the Sangha. May the Blessed One accept me as a lay follower, who has taken refuge from this day forth as long as life endures.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශාක්‍ය දේශයේ, කපිලවස්තු නුවර, නිග්‍රෝධාරාමයෙහි වැඩවසන සේක.\n\nඉක්බිති නිගණ්ඨ ශ්‍රාවකයෙකු වූ වප්ප ශාක්‍යයා ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ වෙත පැමිණියේය. පැමිණ, ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට වන්දනා කර, එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි ඒ වප්ප ශාක්‍ය නිගණ්ඨ ශ්‍රාවකයාට ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ මෙසේ වදාළ සේක: \"වප්ප, මෙහි යමෙක් කයින් සංවර වූයේ, වචනයෙන් සංවර වූයේ, සිතින් සංවර වූයේ, අවිද්‍යාව ක්ෂය කිරීමෙන්, විද්‍යාව උපදවා ගත්තේ නම්, වප්ප, යම් තැනක් නිසා පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා ඒ දැයි, ඔබ එවැනි තැනක් දකින්නෙහි ද?\" \"ස්වාමීනි, මම එවැනි තැනක් දකිමි. ස්වාමීනි, මෙහි යමෙක් පෙර නොමේරූ විපාක ඇති පාපකර්මයක් කර තිබේ නම්, ඒ හේතුවෙන් පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා එයි.\" එසේ කල්හි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සහ නිගණ්ඨ ශ්‍රාවක වප්ප ශාක්‍යයා අතර කතාව අඩක් කතා කොට නතර වූයේය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් වේලෙහි පටිසල්ලානයෙන් නැඟිට උවටැන් ශාලාව තිබූ තැනට වැඩම කළ සේක. වැඩම කර, පනවා තිබූ ආසනයක වැඩහුන් සේක. වැඩහිඳ භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට මෙසේ වදාළ සේක: \"මොග්ගල්ලාන, දැන් මේ ඔබලා කුමන කතාවකින් යුතුව රැස්ව සිටියාහු ද? ඔබලාගේ අඩක් කතා කොට නතර වූ කතාව කුමක් ද?\" \"ස්වාමීනි, මම නිගණ්ඨ ශ්‍රාවක වප්ප ශාක්‍යයාට මෙසේ කීවෙමි: 'වප්ප, මෙහි යමෙක් කයින් සංවර වූයේ, වචනයෙන් සංවර වූයේ, සිතින් සංවර වූයේ, අවිද්‍යාව ක්ෂය කිරීමෙන්, විද්‍යාව උපදවා ගත්තේ නම්, යම් තැනක් නිසා පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා ඒ දැයි, ඔබ එවැනි තැනක් දකින්නෙහි ද?' ස්වාමීනි, එසේ කී කල්හි, නිගණ්ඨ ශ්‍රාවක වප්ප ශාක්‍යයා මට මෙසේ කීවේය: 'ස්වාමීනි, මම එවැනි තැනක් දකිමි. ස්වාමීනි, මෙහි යමෙක් පෙර නොමේරූ විපාක ඇති පාපකර්මයක් කර තිබේ නම්, ඒ හේතුවෙන් පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා එයි.' ස්වාමීනි, නිගණ්ඨ ශ්‍රාවක වප්ප ශාක්‍යයා සමඟ අපගේ අඩක් කතා කොට නතර වූ කතාව මෙයයි. ඉක්බිති භාග්‍යවතුන් වහන්සේ වැඩම කළ සේක.\"\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ නිගණ්ඨ ශ්‍රාවක වප්ප ශාක්‍යයාට මෙසේ වදාළ සේක: \"වප්ප, යම් හෙයකින් ඔබ මා විසින් අනුදැන වදාළ දෙයක් අනුමත කරන්නේ නම්, ප්‍රතික්ෂේප කළ යුතු දෙයක් ප්‍රතික්ෂේප කරන්නේ නම්, මාගේ යම් වචනයක අර්ථය ඔබ නොදනී නම්, 'ස්වාමීනි, මෙය කෙසේද, මෙහි තේරුම කුමක්ද?' කියා නැවත මාගෙන්ම විමසන්නේ නම්, එවිට අප අතර කථා සල්ලාපයක් පැවැත්විය හැකියි.\" \"ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ විසින් අනුදැන වදාළ දෙයක් අනුමත කරමි, ප්‍රතික්ෂේප කළ යුතු දෙයක් ප්‍රතික්ෂේප කරමි. තවද, භාග්‍යවතුන් වහන්සේගේ යම් වචනයක අර්ථය මම නොදනිම් නම්, 'ස්වාමීනි, මෙය කෙසේද, මෙහි තේරුම කුමක්ද?' කියා නැවත භාග්‍යවතුන් වහන්සේගෙන්ම විමසමි. අප අතර කථා සල්ලාපයක් සිදු වේවා!\"\n\n\"වප්ප, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? යම් ආස්‍රවයන් සහ ක්ලේශ විඩාවන් කයෙහි ආරම්භක ක්‍රියා හේතුවෙන් උපදී ද, කයෙහි ආරම්භක ක්‍රියා වලින් වැළකුණු පුද්ගලයාට ඒ ආස්‍රව සහ ක්ලේශ විඩාවන් උපදින්නේ නැත. ඔහු අලුත් කර්ම නොකරයි. පැරණි කර්මයන්ද ස්පර්ශ කිරීමෙන් ස්පර්ශ කිරීමෙන් කෙළවර කරයි. එය සන්දිට්ඨික වූ, අකාලික වූ, ඒහිපස්සික වූ, ඕපනයික වූ, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැක්ක යුතු ක්ලේශ ක්ෂය කිරීමකි. වප්ප, යම් තැනක් නිසා පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා ඒ දැයි, ඔබ එවැනි තැනක් දකින්නෙහි ද?\" \"එසේ නොවේ ස්වාමීනි.\"\n\n\"වප්ප, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? යම් ආස්‍රවයන් සහ ක්ලේශ විඩාවන් වචනයෙහි ආරම්භක ක්‍රියා හේතුවෙන් උපදී ද, වචනයෙහි ආරම්භක ක්‍රියා වලින් වැළකුණු පුද්ගලයාට ඒ ආස්‍රව සහ ක්ලේශ විඩාවන් උපදින්නේ නැත. ඔහු අලුත් කර්ම නොකරයි. පැරණි කර්මයන්ද ස්පර්ශ කිරීමෙන් ස්පර්ශ කිරීමෙන් කෙළවර කරයි. එය සන්දිට්ඨික වූ, අකාලික වූ, ඒහිපස්සික වූ, ඕපනයික වූ, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැක්ක යුතු ක්ලේශ ක්ෂය කිරීමකි. වප්ප, යම් තැනක් නිසා පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා ඒ දැයි, ඔබ එවැනි තැනක් දකින්නෙහි ද?\" \"එසේ නොවේ ස්වාමීනි.\"\n\n\"වප්ප, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? යම් ආස්‍රවයන් සහ ක්ලේශ විඩාවන් සිතෙහි ආරම්භක ක්‍රියා හේතුවෙන් උපදී ද, සිතෙහි ආරම්භක ක්‍රියා වලින් වැළකුණු පුද්ගලයාට ඒ ආස්‍රව සහ ක්ලේශ විඩාවන් උපදින්නේ නැත. ඔහු අලුත් කර්ම නොකරයි. පැරණි කර්මයන්ද ස්පර්ශ කිරීමෙන් ස්පර්ශ කිරීමෙන් කෙළවර කරයි. එය සන්දිට්ඨික වූ, අකාලික වූ, ඒහිපස්සික වූ, ඕපනයික වූ, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැක්ක යුතු ක්ලේශ ක්ෂය කිරීමකි. වප්ප, යම් තැනක් නිසා පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා ඒ දැයි, ඔබ එවැනි තැනක් දකින්නෙහි ද?\" \"එසේ නොවේ ස්වාමීනි.\"\n\n\"වප්ප, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? යම් ආස්‍රවයන් සහ ක්ලේශ විඩාවන් අවිද්‍යාව හේතුවෙන් උපදී ද, අවිද්‍යාව ක්ෂය කිරීමෙන්, විද්‍යාව උපදවා ගත් කල්හි, ඒ ආස්‍රව සහ ක්ලේශ විඩාවන් උපදින්නේ නැත. ඔහු අලුත් කර්ම නොකරයි. පැරණි කර්මයන්ද ස්පර්ශ කිරීමෙන් ස්පර්ශ කිරීමෙන් කෙළවර කරයි. එය සන්දිට්ඨික වූ, අකාලික වූ, ඒහිපස්සික වූ, ඕපනයික වූ, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැක්ක යුතු ක්ලේශ ක්ෂය කිරීමකි. වප්ප, යම් තැනක් නිසා පුද්ගලයාට පරලොව දුක් විපාක ගෙන දෙන ආස්‍රවයන් ගලා ඒ දැයි, ඔබ එවැනි තැනක් දකින්නෙහි ද?\"\n\nඑසේ නොවේ, භාග්‍යවතුන් වහන්ස.\n\nවප්ප, මෙසේ නිරවුල්ව නිදහස් වූ සිතක් ඇති භික්ෂුවකට නිරන්තර විහර්ණ හයක් අත්පත් වී තිබේ. ඔහු ඇසින් රූපයක් දැක සතුටු ද නොවන්නේය, නොසතුටු ද නොවන්නේය; සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි. කනින් ශබ්දයක් අසා, නාසයෙන් ගඳක් ආඝ්‍රාණය කොට, දිවෙන් රසයක් විඳ, කයින් ස්පර්ශයක් ස්පර්ශ කොට, මනසින් ධර්මයක් දැන සතුටු ද නොවන්නේය, නොසතුටු ද නොවන්නේය; සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි. ඔහු කය කෙළවර කොට ඇති වේදනාවක් විඳින කල්හි 'කය කෙළවර කොට ඇති වේදනාවක් විඳිමි'යි දනී; ජීවිතය කෙළවර කොට ඇති වේදනාවක් විඳින කල්හි 'ජීවිතය කෙළවර කොට ඇති වේදනාවක් විඳිමි'යි දනී; 'කය බිඳී යාමෙන් පසු, ජීවිතය කෙළවර වීමෙන් පසු, මෙහිම සියලු වේදනා අත්හැර දමා, සිසිල් වන්නේය'යි දනී.\n\nවප්ප, යම්සේ කණුවක් නිසා සෙවණැල්ලක් පෙනේ ද, එවිට එක් පුරුෂයෙක් උදැල්ලක් සහ කූඩයක් රැගෙන එන්නේය. ඔහු ඒ කණුව මුලින් කපන්නේය; මුලින් කපා, පොළොව හාරා, උසීරු මුල් ප්‍රමාණයට හෝ සියලු මුල් ගලවා දමන්නේය. ඔහු ඒ කණුව කැබලි කැබලි වලට කපන්නේය. කැබලි කැබලි වලට කපා, පලන්නේය. පලා, සිහින් පතුරු බවට පත් කරන්නේය. සිහින් පතුරු බවට පත් කොට, හිරු රශ්මියෙන් හා සුළඟින් වියළන්නේය. හිරු රශ්මියෙන් හා සුළඟින් වියළා, ගින්නෙන් දවා අළු බවට පත් කරන්නේය. අළු බවට පත් කොට, මහා සුළඟේ පා කර හරින්නේය, නැතහොත් වේගවත් ගංගාවක පා කර හරින්නේය. වප්ප, මෙසේ කණුවක් නිසා වූ යම් සෙවණැල්ලක් වේ ද, එය මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, නැවත නොඇති වන ස්වභාවයට පත් කර, අනාගතයේදී හට නොගන්නා ස්වභාවයට පත් වන්නේය.\n\nවප්ප, එසේම, මෙසේ නිරවුල්ව නිදහස් වූ සිතක් ඇති භික්ෂුවකට නිරන්තර විහර්ණ හයක් අත්පත් වී තිබේ. ඔහු ඇසින් රූපයක් දැක සතුටු ද නොවන්නේය, නොසතුටු ද නොවන්නේය; සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි. කනින් ශබ්දයක් අසා, නාසයෙන් ගඳක් ආඝ්‍රාණය කොට, දිවෙන් රසයක් විඳ, කයින් ස්පර්ශයක් ස්පර්ශ කොට, මනසින් ධර්මයක් දැන සතුටු ද නොවන්නේය, නොසතුටු ද නොවන්නේය; සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි. ඔහු කය කෙළවර කොට ඇති වේදනාවක් විඳින කල්හි 'කය කෙළවර කොට ඇති වේදනාවක් විඳිමි'යි දනී; ජීවිතය කෙළවර කොට ඇති වේදනාවක් විඳින කල්හි 'ජීවිතය කෙළවර කොට ඇති වේදනාවක් විඳිමි'යි දනී; 'කය බිඳී යාමෙන් පසු, ජීවිතය කෙළවර වීමෙන් පසු, මෙහිම සියලු වේදනා අත්හැර දමා, සිසිල් වන්නේය'යි දනී.\n\nමෙසේ වදාළ කල්හි වප්ප නම් වූ ශාක්‍ය නිගණ්ඨ ශ්‍රාවකයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භාග්‍යවතුන් වහන්ස, යම්සේ මනුෂ්‍යයෙක් දියුණුවක් අපේක්ෂාවෙන් අශ්ව වෙළෙන්දෙකු ඇසුරු කරන්නේය. ඔහුට දියුණුවක් නොලැබෙන්නේය, තවද ඔහුට මහන්සියට හා විනාශයට භාගී වීමට සිදු වන්නේය. භාග්‍යවතුන් වහන්ස, එසේම, මම ද දියුණුවක් අපේක්ෂාවෙන් අඥාන නිගණ්ඨයන් ඇසුරු කළෙමි. එහෙත් මම දියුණුවක් නොලැබූයෙමි, තවද මහන්සියට හා විනාශයට භාගී වූයෙමි. භාග්‍යවතුන් වහන්ස, අද පටන් අඥාන නිගණ්ඨයන් කෙරෙහි මා තුළ තිබූ යම් පැහැදීමක් වේ ද, එය මහා සුළඟේ පා කර හරින්නෙමි, නැතහොත් වේගවත් ගංගාවක පා කර හරින්නෙමි. අතිශයින් ම අලංකාර ය, භාග්‍යවතුන් වහන්ස, අතිශයින් ම අලංකාර ය! යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වැසුණු දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මග පෙන්වන්නේ ද, ඇස් ඇත්තෝ රූප දකිත්වායි අඳුරෙහි තෙල් පහනක් දරන්නේ ද, එසේම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය දේශනා කරනු ලැබූ සේක. මම භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, සංඝයා ද සරණ යමි. භාග්‍යවතුන් වහන්ස, අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!\" පස්වෙනි සූත්‍රයයි.",
      "paliTitle": "Vappasuttaṃ",
      "englishTitle": "Vappa Sutta",
      "sinhalaTitle": "වප්ප සූත්‍රය"
    },
    {
      "number": 196,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho sāḷho ca licchavi abhayo ca licchavi yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho sāḷho licchavi bhagavantaṃ etadavoca – ‘‘Santi, bhante, eke samaṇabrāhmaṇā dvayena oghassa nittharaṇaṃ paññapenti – sīlavisuddhihetu ca tapojigucchāhetu ca. Idha, bhante, bhagavā kimāhā’’ti? ‘‘Sīlavisuddhiṃ kho ahaṃ, sāḷha, aññataraṃ sāmaññaṅganti vadāmi. Ye te, sāḷha, samaṇabrāhmaṇā tapojigucchāvādā tapojigucchāsārā tapojigucchāallīnā viharanti, abhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā aparisuddhakāyasamācārā aparisuddhavacīsamācārā aparisuddhamanosamācārā aparisuddhājīvā, abhabbā te ñāṇadassanāya anuttarāya sambodhāya. ‘‘Seyyathāpi, sāḷha, puriso nadiṃ taritukāmo tiṇhaṃ kuṭhāriṃ [kudhāriṃ (ka.)] ādāya vanaṃ paviseyya. So tattha passeyya mahatiṃ sālalaṭṭhiṃ ujuṃ navaṃ akukkuccakajātaṃ. Tamenaṃ mūle chindeyya; mūle chetvā agge chindeyya; agge chetvā sākhāpalāsaṃ suvisodhitaṃ visodheyya; sākhāpalāsaṃ suvisodhitaṃ visodhetvā kuṭhārīhi taccheyya; kuṭhārīhi tacchetvā vāsīhi taccheyya; vāsīhi tacchetvā lekhaṇiyā likheyya; lekhaṇiyā likhitvā pāsāṇaguḷena dhoveyya [dhopeyya (sī. syā. kaṃ. pī.)]; pāsāṇaguḷena dhovetvā nadiṃ patāreyya. ‘‘Taṃ kiṃ maññasi, sāḷha, bhabbo nu kho so puriso nadiṃ taritu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, sālalaṭṭhi bahiddhā suparikammakatā anto avisuddhā. Tassetaṃ pāṭikaṅkhaṃ – sālalaṭṭhi saṃsīdissati, puriso anayabyasanaṃ āpajjissatī’’ti. ‘‘Evamevaṃ kho, sāḷha, ye te samaṇabrāhmaṇā tapojigucchāvādā tapojigucchāsārā tapojigucchāallīnā viharanti, abhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā aparisuddhakāyasamācārā aparisuddhavacīsamācārā aparisuddhamanosamācārā aparisuddhājīvā, abhabbā te ñāṇadassanāya anuttarāya sambodhāya. ‘‘Ye ca kho te, sāḷha, samaṇabrāhmaṇā na tapojigucchāvādā na tapojigucchāsārā na tapojigucchāallīnā viharanti, bhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā parisuddhakāyasamācārā parisuddhavacīsamācārā parisuddhamanosamācārā parisuddhājīvā, bhabbā te ñāṇadassanāya anuttarāya sambodhāya. ‘‘Seyyathāpi, sāḷha, puriso nadiṃ taritukāmo tiṇhaṃ kuṭhāriṃ ādāya vanaṃ paviseyya. So tattha passeyya mahatiṃ sālalaṭṭhiṃ ujuṃ navaṃ akukkuccakajātaṃ. Tamenaṃ mūle chindeyya; mūle chinditvā agge chindeyya; agge chinditvā sākhāpalāsaṃ suvisodhitaṃ visodheyya; sākhāpalāsaṃ suvisodhitaṃ visodhetvā kuṭhārīhi taccheyya; kuṭhārīhi tacchetvā vāsīhi taccheyya; vāsīhi tacchetvā nikhādanaṃ ādāya anto suvisodhitaṃ visodheyya; anto suvisodhitaṃ visodhetvā lekhaṇiyā likheyya; lekhaṇiyā likhitvā pāsāṇaguḷena dhoveyya; pāsāṇaguḷena dhovetvā nāvaṃ kareyya; nāvaṃ katvā phiyārittaṃ [piyārittaṃ (sī. pī.)] bandheyya; phiyārittaṃ bandhitvā nadiṃ patāreyya. ‘‘Taṃ kiṃ maññasi, sāḷha, bhabbo nu kho so puriso nadiṃ taritu’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, sālalaṭṭhi bahiddhā suparikammakatā, anto suvisuddhā nāvākatā [suvisuddhakatā (ka.)] phiyārittabaddhā. Tassetaṃ pāṭikaṅkhaṃ – ‘nāvā na saṃsīdissati, puriso sotthinā pāraṃ gamissatī’’’ti. ‘‘Evamevaṃ kho, sāḷha, ye te samaṇabrāhmaṇā na tapojigucchāvādā na tapojigucchāsārā na tapojigucchāallīnā viharanti, bhabbā te oghassa nittharaṇāya. Yepi te, sāḷha, samaṇabrāhmaṇā parisuddhakāyasamācārā parisuddhavacīsamācārā parisuddhamanosamācārā parisuddhājīvā, bhabbā te ñāṇadassanāya anuttarāya sambodhāya. Seyyathāpi, sāḷha, yodhājīvo bahūni cepi kaṇḍacitrakāni jānāti; atha kho so tīhi ṭhānehi rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi tīhi? Dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā. ‘‘Seyyathāpi, sāḷha, yodhājīvo dūrepātī; evamevaṃ kho, sāḷha, ariyasāvako sammāsamādhi hoti. Sammāsamādhi, sāḷha, ariyasāvako yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. ‘‘Seyyathāpi, sāḷha, yodhājīvo akkhaṇavedhī; evamevaṃ kho, sāḷha, ariyasāvako sammādiṭṭhi hoti. Sammādiṭṭhi, sāḷha, ariyasāvako ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. ‘‘Seyyathāpi, sāḷha, yodhājīvo mahato kāyassa padāletā; evamevaṃ kho, sāḷha, ariyasāvako sammāvimutti hoti. Sammāvimutti, sāḷha, ariyasāvako mahantaṃ avijjākkhandhaṃ padāletī’’ti. Chaṭṭhaṃ.",
      "english": "At one time the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Then Sāḷha the Licchavi and Abhaya the Licchavi approached the Blessed One; having approached, they paid homage to the Blessed One and sat down to one side. As Sāḷha the Licchavi sat to one side, he said to the Blessed One: \"Venerable sir, some ascetics and brahmins declare the crossing of the flood to be by two means: by reason of purity of conduct and by reason of ascetic practices and self-mortification. What does the Blessed One say about this, venerable sir?\"\n\n\"Sāḷha, I declare purity of conduct to be one aspect of ascetical practice. Those ascetics and brahmins, Sāḷha, who advocate ascetic practices and self-mortification, who deem ascetic practices and self-mortification to be essential, and who are devoted to ascetic practices and self-mortification, are incapable of crossing the flood. And those ascetics and brahmins, Sāḷha, whose bodily conduct is impure, whose verbal conduct is impure, whose mental conduct is impure, and whose livelihood is impure, are incapable of profound insight and vision, and of unsurpassed perfect enlightenment.\"\n\n\"Just as, Sāḷha, a man wishing to cross a river might take a sharp axe and enter a forest. There he might see a large sāla-log, straight, fresh, and free from knots. He might cut it at the root; having cut it at the root, he might cut it at the top; having cut it at the top, he might thoroughly clear away its branches and leaves; having thoroughly cleared away its branches and leaves, he might trim it with axes; having trimmed it with axes, he might plane it with adzes; having planed it with adzes, he might smooth it with a scraping tool; having smoothed it with a scraping tool, he might polish it with a stone implement; having polished it with a stone implement, he might launch it into the river.\"\n\n\"What do you think, Sāḷha, would that man be able to cross the river?\" \"No, venerable sir.\" \"For what reason?\" \"Because, venerable sir, that sāla-log, though thoroughly worked on the outside, is impure within. It is to be expected that the sāla-log would sink, and the man would meet with misfortune and calamity.\"\n\n\"Even so, Sāḷha, those ascetics and brahmins who advocate ascetic practices and self-mortification, who deem ascetic practices and self-mortification to be essential, and who are devoted to ascetic practices and self-mortification, are incapable of crossing the flood. And those ascetics and brahmins, Sāḷha, whose bodily conduct is impure, whose verbal conduct is impure, whose mental conduct is impure, and whose livelihood is impure, are incapable of profound insight and vision, and of unsurpassed perfect enlightenment.\"\n\n\"However, Sāḷha, those ascetics and brahmins who do not advocate ascetic practices and self-mortification, who do not deem ascetic practices and self-mortification to be essential, and who are not devoted to ascetic practices and self-mortification, are capable of crossing the flood. And those ascetics and brahmins, Sāḷha, whose bodily conduct is pure, whose verbal conduct is pure, whose mental conduct is pure, and whose livelihood is pure, are capable of profound insight and vision, and of unsurpassed perfect enlightenment.\"\n\n\"Just as, Sāḷha, a man wishing to cross a river might take a sharp axe and enter a forest. There he might see a large sāla-log, straight, fresh, and free from knots. He might cut it at the root; having cut it at the root, he might cut it at the top; having cut it at the top, he might thoroughly clear away its branches and leaves; having thoroughly cleared away its branches and leaves, he might trim it with axes; having trimmed it with axes, he might plane it with adzes; having planed it with adzes, he might take a digging tool and thoroughly hollow out its interior; having thoroughly hollowed out its interior, he might smooth it with a scraping tool; having smoothed it with a scraping tool, he might polish it with a stone implement; having polished it with a stone implement, he might make a boat; having made a boat, he might fasten the rudder; having fastened the rudder, he might launch it into the river.\"\n\n\"What do you think, Sāḷha, would that man be able to cross the river?\" \"Yes, venerable sir.\" \"For what reason?\" \"Because, venerable sir, that sāla-log, thoroughly worked on the outside and thoroughly purified on the inside, has been made into a boat and has a rudder fastened. It is to be expected that the boat would not sink, and the man would reach the other shore safely.\"\n\n\"Even so, Sāḷha, those ascetics and brahmins who do not advocate ascetic practices and self-mortification, who do not deem ascetic practices and self-mortification to be essential, and who are not devoted to ascetic practices and self-mortification, are capable of crossing the flood. And those ascetics and brahmins, Sāḷha, whose bodily conduct is pure, whose verbal conduct is pure, whose mental conduct is pure, and whose livelihood is pure, are capable of profound insight and vision, and of unsurpassed perfect enlightenment.\" Just as, Sāḷha, an archer, even if he knows many elaborate tricks of archery, yet he is considered worthy of a king, fit for a king, and reckoned as an essential member of the king's retinue by three qualities. Which three? He shoots far, he shoots instantly, and he pierces a great body.\n\nJust as, Sāḷha, an archer shoots far; even so, Sāḷha, the noble disciple has right concentration.\n\nPossessing right concentration, Sāḷha, a noble disciple sees any form whatsoever—whether past, future, or present; internal or external; coarse or subtle; inferior or refined; far or near—all such form, as it really is, with right wisdom: ‘This is not mine, I am not this, this is not my self.’\nAny feeling whatsoever—whether past, future, or present; internal or external; coarse or subtle; inferior or refined; far or near—all such feeling, as it really is, with right wisdom: ‘This is not mine, I am not this, this is not my self.’\nAny perception whatsoever—whether past, future, or present; internal or external; coarse or subtle; inferior or refined; far or near—all such perception, as it really is, with right wisdom: ‘This is not mine, I am not this, this is not my self.’\nAny mental formations whatsoever—whether past, future, or present; internal or external; coarse or subtle; inferior or refined; far or near—all such mental formations, as they really are, with right wisdom: ‘This is not mine, I am not this, this is not my self.’\nAny consciousness whatsoever—whether past, future, or present; internal or external; coarse or subtle; inferior or refined; far or near—all such consciousness, as it really is, with right wisdom: ‘This is not mine, I am not this, this is not my self.’\n\nJust as, Sāḷha, a warrior is a sharp-shooter, even so, Sāḷha, a noble disciple possesses right view. Possessing right view, Sāḷha, a noble disciple understands as it really is: ‘This is suffering,’ ‘This is the origin of suffering,’ ‘This is the cessation of suffering,’ ‘This is the path leading to the cessation of suffering.’\nJust as, Sāḷha, a warrior is one who shatters a great host, even so, Sāḷha, a noble disciple possesses right liberation. Possessing right liberation, Sāḷha, a noble disciple shatters the great mass of ignorance.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි මහ වනයෙහි කූටාගාරශාලාවෙහි වැඩසිටින සේක. ඉන්පසු සැල්හ නම් ලිච්ඡවී කුමාරයා ද අභය නම් ලිච්ඡවී කුමාරයා ද භාග්‍යවතුන් වහන්සේ වෙත පැමිණියෝය. එසේ පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි සැල්හ නම් ලිච්ඡවී කුමාරයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘වහන්ස, සමහර ශ්‍රමණබ්‍රාහ්මණයෝ සසර ඕඝයෙන් එතෙර වීම දෙයාකාරයකින් පනවති – සීල විශුද්ධියත්, තපස් හා පවට පිළිකුලත් (හේතුකොටගෙන) වශයෙනි. වහන්ස, මේ සම්බන්ධයෙන් භාග්‍යවතුන් වහන්සේ කුමක් වදාළ සේක් ද?’’ ‘‘සැල්හ, සිල් පිරිසිදුකම යනු ශ්‍රමණත්වයට (අවශ්‍ය) එක් අංගයක් යැයි මම දේශනා කරමි. සැල්හ, යම් ශ්‍රමණබ්‍රාහ්මණයෝ තපස් හා පවට පිළිකුල දේශනා කරන්නෝ ද, තපස් හා පවට පිළිකුල සාර කොට ඇත්තෝ ද, තපස් හා පවට පිළිකුලට ඇලී සිටින්නෝ ද, ඔවුහු සසර ඕඝයෙන් එතෙර වීමට අභව්‍ය (නොහැකි) වෙති. සැල්හ, යම් ශ්‍රමණබ්‍රාහ්මණයෝ අපිරිසිදු කය හැසිරීම් ඇත්තෝ ද, අපිරිසිදු වචී හැසිරීම් ඇත්තෝ ද, අපිරිසිදු මනෝ හැසිරීම් ඇත්තෝ ද, අපිරිසිදු ආජීවය ඇත්තෝ ද, ඔවුහු (ආර්ය) ඥානදර්ශනයට ද, නිරුත්තර සම්බෝධියට ද අභව්‍ය (නොහැකි) වෙති.\n\n‘‘සැල්හ, යම්සේ පුරුෂයෙක් ගඟක් තරණය කිරීමට කැමැතිව තියුණු පොරවක් ගෙන වනයට පිවිසෙන්නේ ය. හෙතෙම එහිදී සෘජු වූ, නැවුම් වූ, අභ්‍යන්තරයේ දෝෂ රහිත (ගැට හෝ කුණුවීමක් නැති) විශාල සල් කඳක් දකිනු ඇත. හෙතෙම එය මුලින් කපන්නේය; මුලින් කපා අගින් කපන්නේය; අගින් කපා අතු සහ කොළ හොඳින් පිරිසිදු කරන්නේය; අතු සහ කොළ හොඳින් පිරිසිදු කර පොරෝවලින් ලී කොටය පට්ටම් කරන්නේය; පොරෝවලින් පට්ටම් කොට වෑවලින් පට්ටම් කරන්නේය; වෑවලින් පට්ටම් කොට ලේඛනීය නම් (මතුපිට සුමට කරන) උපකරණයකින් සුමට කරන්නේය; ලේඛනීය උපකරණයකින් සුමට කොට ගල් ගුලියකින් මදින්නේය; ගල් ගුලියකින් මැද එය ගඟට පා කර හරින්නේය. ‘‘සැල්හ, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? ඒ පුරුෂයාට ගඟ තරණය කිරීමට හැකි වේ ද?’’ ‘‘වහන්ස, එසේ නොවේ.’’ ‘‘එයට හේතුව කුමක් ද?’’ ‘‘වහන්ස, ඒ සල් කඳ පිටතින් හොඳින් සකස් කර ඇතත්, ඇතුළතින් පිරිසිදු කර නැත (කුහරයක් කර නැත). ඒ සල් කඳ ගිලී යනු ඇතැයි ද, පුරුෂයා විපතට පත්වනු ඇතැයි ද අපේක්ෂා කළ හැකිය.’’\n\n‘‘සැල්හ, එපරිද්දෙන්ම යම් ශ්‍රමණබ්‍රාහ්මණයෝ තපස් හා පවට පිළිකුල දේශනා කරන්නෝ ද, තපස් හා පවට පිළිකුල සාර කොට ඇත්තෝ ද, තපස් හා පවට පිළිකුලට ඇලී සිටින්නෝ ද, ඔවුහු සසර ඕඝයෙන් එතෙර වීමට අභව්‍ය (නොහැකි) වෙති. සැල්හ, යම් ශ්‍රමණබ්‍රාහ්මණයෝ අපිරිසිදු කය හැසිරීම් ඇත්තෝ ද, අපිරිසිදු වචී හැසිරීම් ඇත්තෝ ද, අපිරිසිදු මනෝ හැසිරීම් ඇත්තෝ ද, අපිරිසිදු ආජීවය ඇත්තෝ ද, ඔවුහු (ආර්ය) ඥානදර්ශනයට ද, නිරුත්තර සම්බෝධියට ද අභව්‍ය (නොහැකි) වෙති.\n\n‘‘සැල්හ, යම් ශ්‍රමණබ්‍රාහ්මණයෝ තපස් හා පවට පිළිකුල දේශනා නොකරන්නෝ ද, තපස් හා පවට පිළිකුල සාර කොට නොගත්තෝ ද, තපස් හා පවට පිළිකුලට ඇලී නොසිටින්නෝ ද, ඔවුහු සසර ඕඝයෙන් එතෙර වීමට භව්‍ය (හැකි) වෙති. සැල්හ, යම් ශ්‍රමණබ්‍රාහ්මණයෝ පිරිසිදු කය හැසිරීම් ඇත්තෝ ද, පිරිසිදු වචී හැසිරීම් ඇත්තෝ ද, පිරිසිදු මනෝ හැසිරීම් ඇත්තෝ ද, පිරිසිදු ආජීවය ඇත්තෝ ද, ඔවුහු (ආර්ය) ඥානදර්ශනයට ද, නිරුත්තර සම්බෝධියට ද භව්‍ය (හැකි) වෙති.\n\n‘‘සැල්හ, යම්සේ පුරුෂයෙක් ගඟක් තරණය කිරීමට කැමැතිව තියුණු පොරවක් ගෙන වනයට පිවිසෙන්නේ ය. හෙතෙම එහිදී සෘජු වූ, නැවුම් වූ, අභ්‍යන්තරයේ දෝෂ රහිත (ගැට හෝ කුණුවීමක් නැති) විශාල සල් කඳක් දකිනු ඇත. හෙතෙම එය මුලින් කපන්නේය; මුලින් කපා අගින් කපන්නේය; අගින් කපා අතු සහ කොළ හොඳින් පිරිසිදු කරන්නේය; අතු සහ කොළ හොඳින් පිරිසිදු කර පොරෝවලින් ලී කොටය පට්ටම් කරන්නේය; පොරෝවලින් පට්ටම් කොට වෑවලින් පට්ටම් කරන්නේය; වෑවලින් පට්ටම් කොට නිකාදන නම් (ඇතුළත කුහර කරන) උපකරණයක් ගෙන ඇතුළත හොඳින් පිරිසිදු කරන්නේය; ඇතුළත හොඳින් පිරිසිදු කර ලේඛනීය නම් උපකරණයකින් සුමට කරන්නේය; ලේඛනීය උපකරණයකින් සුමට කොට ගල් ගුලියකින් මදින්නේය; ගල් ගුලියකින් මැද එය බෝට්ටුවක් බවට පත් කරන්නේය; බෝට්ටුවක් බවට පත් කොට ඔරුවකට අවශ්‍ය හබලක් හෝ රුකේරුවක් බඳින්නේය; හබලක් හෝ රුකේරුවක් බැඳ එය ගඟට පා කර හරින්නේය. ‘‘සැල්හ, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? ඒ පුරුෂයාට ගඟ තරණය කිරීමට හැකි වේ ද?’’ ‘‘වහන්ස, එසේය.’’ ‘‘එයට හේතුව කුමක් ද?’’ ‘‘වහන්ස, ඒ සල් කඳ පිටතින් හොඳින් සකස් කර, ඇතුළතින් හොඳින් පිරිසිදු කර, බෝට්ටුවක් බවට පත් කර, හබලක් හෝ රුකේරුවක් ද බැඳ ඇත. ඒ බෝට්ටුව ගිලී නොයනු ඇතැයි ද, පුරුෂයා ආරක්ෂිතව එගොඩට යනු ඇතැයි ද අපේක්ෂා කළ හැකිය.’’\n\n‘‘සැල්හ, එපරිද්දෙන්ම යම් ශ්‍රමණබ්‍රාහ්මණයෝ තපස් හා පවට පිළිකුල දේශනා නොකරන්නෝ ද, තපස් හා පවට පිළිකුල සාර කොට නොගත්තෝ ද, තපස් හා පවට පිළිකුලට ඇලී නොසිටින්නෝ ද, ඔවුහු සසර ඕඝයෙන් එතෙර වීමට භව්‍ය (හැකි) වෙති. සැල්හ, යම් ශ්‍රමණබ්‍රාහ්මණයෝ පිරිසිදු කය හැසිරීම් ඇත්තෝ ද, පිරිසිදු වචී හැසිරීම් ඇත්තෝ ද, පිරිසිදු මනෝ හැසිරීම් ඇත්තෝ ද, පිරිසිදු ආජීවය ඇත්තෝ ද, ඔවුහු (ආර්ය) ඥානදර්ශනයට ද, නිරුත්තර සම්බෝධියට ද භව්‍ය (හැකි) වෙති. සැල්හ, යම්සේ යෝධයෙක් (සටන්කරුවෙක්) බොහෝ විසිතුරු ඊතල විදින (ශිල්ප) දන්නේ නමුදු, ඔහු කරුණු තුනකින් රජුට සුදුසු, රජුගේ භෝග (සත්කාර) ලැබීමට සුදුසු, රජුගේ අංගයක් ලෙස ගණන් ගනු ලැබේ. ඒ තුන කුමක් ද? හෙතෙම දුරට විදින්නේ ය, නිවැරදි ක්ෂණයෙහි ඉලක්කයට විදින්නේ ය, මහත් වූ සිරුරක් විදින්නේ ය (ගැඹුරට විනිවිද යන්නේ ය). ‘‘සැල්හ, යම්සේ යෝධයෙක් දුරට විදින්නේ ද; එපරිද්දෙන්ම, සැල්හ, ආර්යශ්‍රාවකයා සම්‍යක් සමාධියෙන් යුක්ත වන්නේය.\n\nසාළ්හය, සම්‍යක් සමාධියෙන් යුතු ආර්ය ශ්‍රාවක තෙමේ, යම් කිසි රූපයක් වේ ද, එය අතීත, අනාගත, වර්තමාන වේවා, ඇතුළත හෝ වේවා, පිටත හෝ වේවා, ස්ථූල හෝ වේවා, සියුම් හෝ වේවා, හීන හෝ වේවා, ප්‍රණීත හෝ වේවා, දුර හෝ වේවා, ළඟ හෝ වේවා, ඒ සියලු රූපය ‘මේ මාගේ නොවේ, මම මෙය නොවෙමි, මේ මාගේ ආත්මය නොවේ’ යනුවෙන් මෙය යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දකී. යම් කිසි වේදනාවක් වේ ද, එය අතීත, අනාගත, වර්තමාන වේවා, ඇතුළත හෝ වේවා, පිටත හෝ වේවා, ස්ථූල හෝ වේවා, සියුම් හෝ වේවා, හීන හෝ වේවා, ප්‍රණීත හෝ වේවා, දුර හෝ වේවා, ළඟ හෝ වේවා, ඒ සියලු වේදනාව ‘මේ මාගේ නොවේ, මම මෙය නොවෙමි, මේ මාගේ ආත්මය නොවේ’ යනුවෙන් මෙය යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දකී. යම් කිසි සංඥාවක් වේ ද, එය අතීත, අනාගත, වර්තමාන වේවා, ඇතුළත හෝ වේවා, පිටත හෝ වේවා, ස්ථූල හෝ වේවා, සියුම් හෝ වේවා, හීන හෝ වේවා, ප්‍රණීත හෝ වේවා, දුර හෝ වේවා, ළඟ හෝ වේවා, ඒ සියලු සංඥාව ‘මේ මාගේ නොවේ, මම මෙය නොවෙමි, මේ මාගේ ආත්මය නොවේ’ යනුවෙන් මෙය යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දකී. යම් කිසි සංස්කාර සමූහයක් වේ ද, එය අතීත, අනාගත, වර්තමාන වේවා, ඇතුළත හෝ වේවා, පිටත හෝ වේවා, ස්ථූල හෝ වේවා, සියුම් හෝ වේවා, හීන හෝ වේවා, ප්‍රණීත හෝ වේවා, දුර හෝ වේවා, ළඟ හෝ වේවා, ඒ සියලු සංස්කාර ‘මේ මාගේ නොවේ, මම මෙය නොවෙමි, මේ මාගේ ආත්මය නොවේ’ යනුවෙන් මෙය යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දකී. යම් කිසි විඤ්ඤාණයක් වේ ද, එය අතීත, අනාගත, වර්තමාන වේවා, ඇතුළත හෝ වේවා, පිටත හෝ වේවා, ස්ථූල හෝ වේවා, සියුම් හෝ වේවා, හීන හෝ වේවා, ප්‍රණීත හෝ වේවා, දුර හෝ වේවා, ළඟ හෝ වේවා, ඒ සියලු විඤ්ඤාණය ‘මේ මාගේ නොවේ, මම මෙය නොවෙමි, මේ මාගේ ආත්මය නොවේ’ යනුවෙන් මෙය යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දකී.\n\nසාළ්හය, යම් සේ විගසින් විදින යුද ශිල්පියෙක් ඇද්ද; එසේම සාළ්හය, ආර්ය ශ්‍රාවක තෙමේ සම්‍යක් දෘෂ්ටියෙන් යුක්ත වේ. සාළ්හය, සම්‍යක් දෘෂ්ටියෙන් යුතු ආර්ය ශ්‍රාවක තෙමේ ‘මෙය දුක ය’ යනුවෙන් යථාභූතව දනී. ‘මෙය දුක ඇතිවීම ය’ යනුවෙන් යථාභූතව දනී. ‘මෙය දුක නැතිකිරීම ය’ යනුවෙන් යථාභූතව දනී. ‘මෙය දුක නැතිකරන ප්‍රතිපදාව ය’ යනුවෙන් යථාභූතව දනී.\n\nසාළ්හය, යම් සේ මහත් සෙනඟක් භේද කරමින් ඉදිරියට යන යුද ශිල්පියෙක් ඇද්ද; එසේම සාළ්හය, ආර්ය ශ්‍රාවක තෙමේ සම්‍යක් විමුක්තියෙන් යුක්ත වේ. සාළ්හය, සම්‍යක් විමුක්තියෙන් යුතු ආර්ය ශ්‍රාවක තෙමේ මහත් වූ අවිද්‍යා ස්කන්ධය භේද කරයි.",
      "paliTitle": "Sāḷhasuttaṃ",
      "englishTitle": "Sāḷha's Discourse",
      "sinhalaTitle": "සාළ්හ සූත්‍රය"
    },
    {
      "number": 197,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho mallikā devī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho mallikā devī bhagavantaṃ etadavoca – ‘‘Ko nu kho, bhante, hetu ko paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā [syā. pī. potthakesu ‘‘dubbaṇo ca hoti durūpo supāpako’’ti evamādinā pulliṅgikavasena dissati] dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca? ‘‘Ko pana, bhante, hetu ko paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca? ‘‘Ko nu kho, bhante, hetu ko paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca? ‘‘Ko pana, bhante, hetu ko paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā, aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā cā’’ti? ‘‘Idha, mallike, ekacco mātugāmo kodhanā hoti upāyāsabahulā. Appampi vuttā samānā abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Sā [so (syā.)] na dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Issāmanikā [issāmanako (syā.)] kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu issati upadussati issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā [so (syā.)] yattha yattha paccājāyati dubbaṇṇā ca hoti durūpā supāpikā dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca. ‘‘Idha pana, mallike, ekacco mātugāmo kodhanā hoti upāyāsabahulā. Appampi vuttā samānā abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Sā dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu na issati na upadussati na issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha yattha paccājāyati dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca. ‘‘Idha pana, mallike, ekacco mātugāmo akkodhanā hoti anupāyāsabahulā. Bahumpi vuttā samānā nābhisajjati na kuppati na byāpajjati na patitthīyati, na kopañca dosañca appaccayañca pātukaroti. Sā na dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Issāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu issati upadussati issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha yattha paccājāyati abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca. ‘‘Idha pana, mallike, ekacco mātugāmo akkodhanā hoti anupāyāsabahulā. Bahumpi vuttā samānā nābhisajjati na kuppati na byāpajjati na patitthīyati, na kopañca dosañca appaccayañca pātukaroti. Sā dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā kho pana hoti; paralābhasakkāragarukāramānanavandanapūjanāsu na issati na upadussati na issaṃ bandhati. Sā ce tato cutā itthattaṃ āgacchati, sā yattha yattha paccājāyati abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca. ‘‘Ayaṃ kho, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; daliddā ca hoti appassakā appabhogā appesakkhā ca. Ayaṃ pana, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo dubbaṇṇā ca hoti durūpā supāpikā dassanāya; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā ca. Ayaṃ kho, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; daliddā ca hoti appassakā appabhogā appesakkhā ca. Ayaṃ pana, mallike, hetu ayaṃ paccayo, yena midhekacco mātugāmo abhirūpā ca hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā; aḍḍhā ca hoti mahaddhanā mahābhogā mahesakkhā cā’’ti. Evaṃ vutte mallikā devī bhagavantaṃ etadavoca – ‘‘yā nūnāhaṃ [sā nūnāhaṃ (syā.), yaṃ nūnāhaṃ (ka.)] bhante, aññaṃ jātiṃ [aññāya jātiyā (syā.)] kodhanā ahosiṃ upāyāsabahulā, appampi vuttā samānā abhisajjiṃ kuppiṃ byāpajjiṃ patitthīyiṃ kopañca dosañca appaccayañca pātvākāsiṃ, sāhaṃ, bhante, etarahi dubbaṇṇā durūpā supāpikā dassanāya. ‘‘Yā nūnāhaṃ, bhante, aññaṃ jātiṃ dātā ahosiṃ samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ, sāhaṃ, bhante, etarahi aḍḍhā [aḍḍhā ca (sī. pī. ka.)] mahaddhanā mahābhogā. ‘‘Yā nūnāhaṃ, bhante, aññaṃ jātiṃ anissāmanikā ahosiṃ, paralābhasakkāragarukāramānanavandanapūjanāsu na issiṃ na upadussiṃ na issaṃ bandhiṃ, sāhaṃ, bhante, etarahi mahesakkhā. Santi kho pana, bhante, imasmiṃ rājakule khattiyakaññāpi brāhmaṇakaññāpi gahapatikaññāpi, tāsāhaṃ issarādhipaccaṃ kāremi. Esāhaṃ, bhante, ajjatagge akkodhanā bhavissāmi anupāyāsabahulā, bahumpi vuttā samānā nābhisajjissāmi na kuppissāmi na byāpajjissāmi na patitthīyissāmi, kopañca dosañca appaccayañca na pātukarissāmi; dassāmi samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Anissāmanikā bhavissāmi, paralābhasakkāragarukāramānanavandanapūjanāsu na ississāmi na upadussissāmi na issaṃ bandhissāmi. Abhikkantaṃ, bhante…pe… upāsikaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Sattamaṃ.",
      "english": "At one time, the Blessed One was staying at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s Park. Then Queen Mallikā approached the Blessed One; having approached and paid homage to the Blessed One, she sat down to one side.\n\nSeated to one side, Queen Mallikā said to the Blessed One: \"Venerable Sir, what is the reason, what is the cause, why is it that in this world some woman is ill-favored, unattractive, and unpleasant to behold; and is poor, with little influence, few possessions, and little power?\n\n\"But Venerable Sir, what is the reason, what is the cause, why is it that in this world some woman is ill-favored, unattractive, and unpleasant to behold; yet is rich, with great wealth, many possessions, and great power?\n\n\"Venerable Sir, what is the reason, what is the cause, why is it that in this world some woman is beautiful, pleasing, charming, endowed with supreme beauty of complexion; yet is poor, with little influence, few possessions, and little power?\n\n\"But Venerable Sir, what is the reason, what is the cause, why is it that in this world some woman is beautiful, pleasing, charming, endowed with supreme beauty of complexion; and is rich, with great wealth, many possessions, and great power?\"\n\n\"Here, Mallikā, some woman is hot-tempered and prone to vexation. Even when spoken to a little, she becomes angry, irritated, hostile, and displays resentment, ill-will, and displeasure. She is not a giver of food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, lodging, or lamps to ascetics or brahmins. Furthermore, she is envious; she begrudges, becomes hostile, and harbors envy towards the gains, honors, respect, reverence, salutations, and offerings received by others. If, upon passing away from that state, she comes to this human existence, then wherever she is reborn, she is ill-favored, unattractive, and unpleasant to behold; and is poor, with little influence, few possessions, and little power.\n\n\"Here, Mallikā, some woman is hot-tempered and prone to vexation. Even when spoken to a little, she becomes angry, irritated, hostile, and displays resentment, ill-will, and displeasure. She is a giver of food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, lodging, and lamps to ascetics or brahmins. Furthermore, she is not envious; she does not begrudge, does not become hostile, and does not harbor envy towards the gains, honors, respect, reverence, salutations, and offerings received by others. If, upon passing away from that state, she comes to this human existence, then wherever she is reborn, she is ill-favored, unattractive, and unpleasant to behold; yet is rich, with great wealth, many possessions, and great power.\n\n\"Here, Mallikā, some woman is not hot-tempered and is not prone to vexation. Even when spoken to a lot, she does not become angry, does not get irritated, does not become hostile, does not show resentment, and does not display anger, ill-will, or displeasure. She is not a giver of food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, lodging, or lamps to ascetics or brahmins. Furthermore, she is envious; she begrudges, becomes hostile, and harbors envy towards the gains, honors, respect, reverence, salutations, and offerings received by others. If, upon passing away from that state, she comes to this human existence, then wherever she is reborn, she is beautiful, pleasing, charming, endowed with supreme beauty of complexion; yet is poor, with little influence, few possessions, and little power.\n\n\"Here, Mallikā, some woman is not hot-tempered and is not prone to vexation. Even when spoken to a lot, she does not become angry, does not get irritated, does not become hostile, does not show resentment, and does not display anger, ill-will, or displeasure. She is a giver of food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, lodging, and lamps to ascetics or brahmins. Furthermore, she is not envious; she does not begrudge, does not become hostile, and does not harbor envy towards the gains, honors, respect, reverence, salutations, and offerings received by others. If, upon passing away from that state, she comes to this human existence, then wherever she is reborn, she is beautiful, pleasing, charming, endowed with supreme beauty of complexion; and is rich, with great wealth, many possessions, and great power.\n\n\"This, Mallikā, is the reason, this is the cause, why in this world some woman is ill-favored, unattractive, and unpleasant to behold; and is poor, with little influence, few possessions, and little power. This, Mallikā, is the reason, this is the cause, why in this world some woman is ill-favored, unattractive, and unpleasant to behold; yet is rich, with great wealth, many possessions, and great power. This, Mallikā, is the reason, this is the cause, why in this world some woman is beautiful, pleasing, charming, endowed with supreme beauty of complexion; yet is poor, with little influence, few possessions, and little power.\"\n\nBut Mallikā, this is the cause, this is the condition, by which some woman in this world becomes beautiful, pleasing to the eye, attractive, endowed with supreme beauty of complexion, and becomes wealthy, possessing great riches and great possessions, and of great influence.\n\nWhen this was said, Queen Mallikā said to the Blessed One: \"Surely, venerable sir, in another birth I was prone to anger, full of vexation. Even when spoken to a little, I would become enraged, furious, hostile, and display anger, ill-will, and resentment. Therefore, venerable sir, in this life I am ill-favored, ugly, and exceedingly unpleasant to behold.\"\n\n\"Surely, venerable sir, in another birth I was a giver of food, drink, clothing, conveyances, garlands, perfumes, unguents, beds, dwellings, and lamps to ascetics or brahmins. Therefore, venerable sir, in this life I am wealthy, possessing great riches and great possessions.\"\n\n\"Surely, venerable sir, in another birth I was not envious. Regarding the gains, honor, respect, reverence, homage, and veneration of others, I was not jealous, did not become envious, nor did I harbor envy. Therefore, venerable sir, in this life I am of great influence. Indeed, venerable sir, in this royal household there are daughters of warriors, daughters of brahmins, and daughters of householders; over them, I exercise authority and supremacy.\"\n\n\"From this day forward, venerable sir, I will be free from anger, free from vexation. Even when spoken to much, I will not become enraged, not furious, not hostile, nor will I display anger, ill-will, or resentment. I will give food, drink, clothing, conveyances, garlands, perfumes, unguents, beds, dwellings, and lamps to ascetics or brahmins. I will be free from envy; regarding the gains, honor, respect, reverence, homage, and veneration of others, I will not be jealous, nor will I become envious, nor will I harbor envy. Excellent, venerable sir! Let the Blessed One accept me as a lay follower who has taken refuge from this day forth as long as life lasts.\"",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් අනේපිඬු සිටුහුගේ ආරාමයේ වැඩසිටින සේක. එසමයෙහි මල්ලිකා දේවිය භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි වූවාය. එකත්පස්ව වාඩි වී සිටි මල්ලිකා දේවිය භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවාය – ‘‘භාග්‍යවතුන් වහන්ස, කවර හේතුවක්ද, කවර ප්‍රත්‍යයක්ද යම් කරුණකින් මෙහි ඇතැම් කාන්තාවක් දුර්වර්ණව, රූමත් නොවන, දැකීමට අප්‍රිය උපදවන සුළු කාන්තාවක් වී, දිළින්දියක් ද, ස්වල්ප දේපල ඇත්තියක් ද, ස්වල්ප භෝග සම්පත් ඇත්තියක් ද, ස්වල්ප බලපෑම් ඇත්තියක් ද වන්නේද? ‘‘එසේම භාග්‍යවතුන් වහන්ස, කවර හේතුවක්ද, කවර ප්‍රත්‍යයක්ද යම් කරුණකින් මෙහි ඇතැම් කාන්තාවක් දුර්වර්ණව, රූමත් නොවන, දැකීමට අප්‍රිය උපදවන සුළු කාන්තාවක් වී, ධනවත් ද, මහත් ධනය ඇත්තියක් ද, මහත් භෝග සම්පත් ඇත්තියක් ද, මහත් බලපෑම් ඇත්තියක් ද වන්නේද? ‘‘භාග්‍යවතුන් වහන්ස, කවර හේතුවක්ද, කවර ප්‍රත්‍යයක්ද යම් කරුණකින් මෙහි ඇතැම් කාන්තාවක් අතිශයින් රූමත් ව, දැකීමට ප්‍රිය උපදවන සුළු ව, සිත් පහදවන සුළු ව, උත්තරීතර වූ ශරීර කාන්තියකින් හා අලංකාරයකින් යුක්ත ව, එසේම දිළින්දියක් ද, ස්වල්ප දේපල ඇත්තියක් ද, ස්වල්ප භෝග සම්පත් ඇත්තියක් ද, ස්වල්ප බලපෑම් ඇත්තියක් ද වන්නේද? ‘‘එසේම භාග්‍යවතුන් වහන්ස, කවර හේතුවක්ද, කවර ප්‍රත්‍යයක්ද යම් කරුණකින් මෙහි ඇතැම් කාන්තාවක් අතිශයින් රූමත් ව, දැකීමට ප්‍රිය උපදවන සුළු ව, සිත් පහදවන සුළු ව, උත්තරීතර වූ ශරීර කාන්තියකින් හා අලංකාරයකින් යුක්ත ව, ධනවත් ද, මහත් ධනය ඇත්තියක් ද, මහත් භෝග සම්පත් ඇත්තියක් ද, මහත් බලපෑම් ඇත්තියක් ද වන්නේදැ’’යි ඇසුවාය.\n\n‘‘මල්ලිකාවෙනි, මෙහි ඇතැම් කාන්තාවක් ක්‍රෝධයෙන් යුක්ත ව, අධිකව සිත් තැවුල් ඇත්තියක් වන්නේය. අල්ප මාත්‍ර වචනයක් කීවා වූ පමණින් ගැරහීම් කරයි, කෝප වෙයි, විරෝධී වෙයි, නොසන්සුන් වෙයි, ක්‍රෝධය ද, ද්වේෂය ද, අසතුට ද ප්‍රකට කරයි. ඇය ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, ගන්ධ, විලවුන්, සයනාසන, නවාතැන්, පහන් ආදිය නොදෙන්නියක් වන්නේය. එසේම ඇය ඊර්ෂ්‍යා සහගත ස්වභාවයෙන් යුක්ත වන්නීය; අනුන් ලබන ලාභ, සත්කාර, ගරුකාර, මානන, වන්දන, පූජන ආදිය දැක ඊර්ෂ්‍යා කරයි, ද්වේෂ කරයි, ඊර්ෂ්‍යාව බැඳගනියි. යම් හෙයකින් ඇය ඉන් චුත වී කාන්තා භාවයට පැමිණෙන්නේ නම්, ඇය යම් යම් තැනක නැවත උපදින්නීය, දුර්වර්ණව, රූමත් නොවන, දැකීමට අප්‍රිය උපදවන සුළු කාන්තාවක් වන්නීය; එසේම දිළින්දියක් ද, ස්වල්ප දේපල ඇත්තියක් ද, ස්වල්ප භෝග සම්පත් ඇත්තියක් ද, ස්වල්ප බලපෑම් ඇත්තියක් ද වන්නීය.\n\n‘‘එහෙත් මල්ලිකාවෙනි, මෙහි ඇතැම් කාන්තාවක් ක්‍රෝධයෙන් යුක්ත ව, අධිකව සිත් තැවුල් ඇත්තියක් වන්නේය. අල්ප මාත්‍ර වචනයක් කීවා වූ පමණින් ගැරහීම් කරයි, කෝප වෙයි, විරෝධී වෙයි, නොසන්සුන් වෙයි, ක්‍රෝධය ද, ද්වේෂය ද, අසතුට ද ප්‍රකට කරයි. ඇය ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, ගන්ධ, විලවුන්, සයනාසන, නවාතැන්, පහන් ආදිය දෙන්නියක් වන්නේය. එසේම ඇය ඊර්ෂ්‍යා රහිත ස්වභාවයෙන් යුක්ත වන්නීය; අනුන් ලබන ලාභ, සත්කාර, ගරුකාර, මානන, වන්දන, පූජන ආදිය දැක ඊර්ෂ්‍යා නොකරයි, ද්වේෂ නොකරයි, ඊර්ෂ්‍යාව බැඳ නොගනියි. යම් හෙයකින් ඇය ඉන් චුත වී කාන්තා භාවයට පැමිණෙන්නේ නම්, ඇය යම් යම් තැනක නැවත උපදින්නීය, දුර්වර්ණව, රූමත් නොවන, දැකීමට අප්‍රිය උපදවන සුළු කාන්තාවක් වන්නීය; එසේම ධනවත් ද, මහත් ධනය ඇත්තියක් ද, මහත් භෝග සම්පත් ඇත්තියක් ද, මහත් බලපෑම් ඇත්තියක් ද වන්නීය.\n\n‘‘එහෙත් මල්ලිකාවෙනි, මෙහි ඇතැම් කාන්තාවක් ක්‍රෝධ රහිත ව, අධිකව සිත් තැවුල් රහිත වන්නීය. බොහෝ සේ කීවා වූ පමණින් ද ගැරහීම් නොකරයි, කෝප නොවෙයි, විරෝධී නොවෙයි, නොසන්සුන් නොවෙයි, ක්‍රෝධය ද, ද්වේෂය ද, අසතුට ද ප්‍රකට නොකරයි. ඇය ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, ගන්ධ, විලවුන්, සයනාසන, නවාතැන්, පහන් ආදිය නොදෙන්නියක් වන්නේය. එසේම ඇය ඊර්ෂ්‍යා සහගත ස්වභාවයෙන් යුක්ත වන්නීය; අනුන් ලබන ලාභ, සත්කාර, ගරුකාර, මානන, වන්දන, පූජන ආදිය දැක ඊර්ෂ්‍යා කරයි, ද්වේෂ කරයි, ඊර්ෂ්‍යාව බැඳගනියි. යම් හෙයකින් ඇය ඉන් චුත වී කාන්තා භාවයට පැමිණෙන්නේ නම්, ඇය යම් යම් තැනක නැවත උපදින්නීය, අතිශයින් රූමත් ව, දැකීමට ප්‍රිය උපදවන සුළු ව, සිත් පහදවන සුළු ව, උත්තරීතර වූ ශරීර කාන්තියකින් හා අලංකාරයකින් යුක්ත ව; එසේම දිළින්දියක් ද, ස්වල්ප දේපල ඇත්තියක් ද, ස්වල්ප භෝග සම්පත් ඇත්තියක් ද, ස්වල්ප බලපෑම් ඇත්තියක් ද වන්නීය.\n\n‘‘එහෙත් මල්ලිකාවෙනි, මෙහි ඇතැම් කාන්තාවක් ක්‍රෝධ රහිත ව, අධිකව සිත් තැවුල් රහිත වන්නීය. බොහෝ සේ කීවා වූ පමණින් ද ගැරහීම් නොකරයි, කෝප නොවෙයි, විරෝධී නොවෙයි, නොසන්සුන් නොවෙයි, ක්‍රෝධය ද, ද්වේෂය ද, අසතුට ද ප්‍රකට නොකරයි. ඇය ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල්, ගන්ධ, විලවුන්, සයනාසන, නවාතැන්, පහන් ආදිය දෙන්නියක් වන්නේය. එසේම ඇය ඊර්ෂ්‍යා රහිත ස්වභාවයෙන් යුක්ත වන්නීය; අනුන් ලබන ලාභ, සත්කාර, ගරුකාර, මානන, වන්දන, පූජන ආදිය දැක ඊර්ෂ්‍යා නොකරයි, ද්වේෂ නොකරයි, ඊර්ෂ්‍යාව බැඳ නොගනියි. යම් හෙයකින් ඇය ඉන් චුත වී කාන්තා භාවයට පැමිණෙන්නේ නම්, ඇය යම් යම් තැනක නැවත උපදින්නීය, අතිශයින් රූමත් ව, දැකීමට ප්‍රිය උපදවන සුළු ව, සිත් පහදවන සුළු ව, උත්තරීතර වූ ශරීර කාන්තියකින් හා අලංකාරයකින් යුක්ත ව; එසේම ධනවත් ද, මහත් ධනය ඇත්තියක් ද, මහත් භෝග සම්පත් ඇත්තියක් ද, මහත් බලපෑම් ඇත්තියක් ද වන්නීය.\n\n‘‘මල්ලිකාවෙනි, මෙහි ඇතැම් කාන්තාවක් දුර්වර්ණව, රූමත් නොවන, දැකීමට අප්‍රිය උපදවන සුළු කාන්තාවක් වී, දිළින්දියක් ද, ස්වල්ප දේපල ඇත්තියක් ද, ස්වල්ප භෝග සම්පත් ඇත්තියක් ද, ස්වල්ප බලපෑම් ඇත්තියක් ද වීමට හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි. එහෙත් මල්ලිකාවෙනි, මෙහි ඇතැම් කාන්තාවක් දුර්වර්ණව, රූමත් නොවන, දැකීමට අප්‍රිය උපදවන සුළු කාන්තාවක් වී, ධනවත් ද, මහත් ධනය ඇත්තියක් ද, මහත් භෝග සම්පත් ඇත්තියක් ද, මහත් බලපෑම් ඇත්තියක් ද වීමට හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි. මල්ලිකාවෙනි, මෙහි ඇතැම් කාන්තාවක් අතිශයින් රූමත් ව, දැකීමට ප්‍රිය උපදවන සුළු ව, සිත් පහදවන සුළු ව, උත්තරීතර වූ ශරීර කාන්තියකින් හා අලංකාරයකින් යුක්ත ව, දිළින්දියක් ද, ස්වල්ප දේපල ඇත්තියක් ද, ස්වල්ප භෝග සම්පත් ඇත්තියක් ද, ස්වල්ප බලපෑම් ඇත්තියක් ද වීමට හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි.\n\nඑම්බා මල්ලිකාවෙනි, යම්කිසි කාන්තාවක් අතිශයින් රූපසම්පන්නව, දර්ශනීයව, ප්‍රසන්නව, උසස් වර්ණ සෞන්දර්යයකින් යුක්තව, ධනවත්, මහා ධනයෙන් යුක්තව, මහා භෝග සම්පත්තියෙන් යුක්තව, මහත් බලපරාක්‍රමයකින් යුක්තව මෙලොව උපදින්නට මේ හේතුව, මේ ප්‍රත්‍යය වේ.\n\nමෙසේ පැවසූ විට, මල්ලිකා දේවිය භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවාය: \"ස්වාමීනි, පෙර ආත්මයකදී මම ක්‍රෝධයෙන් යුක්තව, මහත් උපද්‍රව බහුලව සිටියා විය යුතුයි. ස්වල්පයක් හෝ කී විට මම අඩදබර කළා, කෝප වුණා, වෛර කළා, මුරණ්ඩු වුණා, ක්‍රෝධයත්, ද්වේෂයත්, අප්‍රසන්න බවත් ප්‍රකට කළා. ස්වාමීනි, ඒ නිසා මම දැන් වර්ණයෙන් දුර්වර්ණයි, රූපයෙන් දුර්වලයි, දැකීමට ඉතා අප්‍රියයි.\"\n\n\"ස්වාමීනි, පෙර ආත්මයකදී මම ශ්‍රමණයන්ට හෝ බ්‍රාහ්මණයන්ට අන්නපාන, වස්ත්‍ර, යානවාහන, මාලා, ගන්ධවිලේවන, සේනාසන, ආවාස සහ පහන් පූජා කළ දායිකාවක්ව සිටියා විය යුතුයි. ස්වාමීනි, ඒ නිසා මම දැන් ධනවත්, මහත් ධනයෙන් යුක්ත, මහත් භෝග සම්පත්තියෙන් යුක්ත වෙමි.\"\n\n\"ස්වාමීනි, පෙර ආත්මයකදී මම ඊර්ෂ්‍යාවෙන් තොරව සිටියා විය යුතුයි. අනුන්ගේ ලාභ සත්කාර ගරුකාර මානන වන්දන පූජාවන් කෙරෙහි මම ඊර්ෂ්‍යා නොකළෙමි, ද්වේෂ නොකළෙමි, ඊර්ෂ්‍යාව බැඳ තබා නොගත්තෙමි. ස්වාමීනි, ඒ නිසා මම දැන් මහත් බලපරාක්‍රමයකින් යුක්ත වෙමි. ස්වාමීනි, මේ රාජකීය පවුලෙහි ක්ෂත්‍රිය කුමරියන් ද, බ්‍රාහ්මණ කුමරියන් ද, ගෘහපති කුමරියන් ද සිටිති. ඔවුන් කෙරෙහි මම අධිපතිත්වය හා ආධිපත්‍යය දරමි. ස්වාමීනි, අද පටන් මම ක්‍රෝධයෙන් තොරව, උපද්‍රව බහුල නොවන කෙනෙක් වන්නෙමි. බොහෝ දේ කීවද මම අඩදබර නොකරමි, කෝප නොවෙමි, වෛර නොකරමි, මුරණ්ඩු නොවෙමි, ක්‍රෝධයත්, ද්වේෂයත්, අප්‍රසන්න බවත් ප්‍රකට නොකරමි. ශ්‍රමණයන්ට හෝ බ්‍රාහ්මණයන්ට අන්නපාන, වස්ත්‍ර, යානවාහන, මාලා, ගන්ධවිලේවන, සේනාසන, ආවාස සහ පහන් පූජා කරන්නෙමි. ඊර්ෂ්‍යාවෙන් තොර වන්නෙමි. අනුන්ගේ ලාභ සත්කාර ගරුකාර මානන වන්දන පූජාවන් කෙරෙහි ඊර්ෂ්‍යා නොකරමි, ද්වේෂ නොකරමි, ඊර්ෂ්‍යාව බැඳ තබා නොගන්නෙමි. ස්වාමීනි, ඉතා අලංකාරයි! ... ස්වාමීනි, අද පටන් දිවි තිබෙන තාක් තුනුරුවන් සරණ ගිය උපාසිකාවක් ලෙස මා භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Mallikādevīsuttaṃ",
      "englishTitle": "The Discourse on Mallikādevī",
      "sinhalaTitle": "මල්ලිකා දේවී සූත්‍රය"
    },
    {
      "number": 198,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco [pu. pa. 174; ma. ni. 2.7; dī. ni. 3.314; a. ni. 3.157-163] puggalo attantapo hoti attaparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo parantapo hoti paraparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto, parantapo ca paraparitāpanānuyogamanuyutto. Idha pana, bhikkhave, ekacco puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto. So neva attantapo na parantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati. ‘‘Kathañca, bhikkhave, puggalo attantapo hoti attaparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco acelako hoti muttācāro hatthāpalekhano naehibhaddantiko natiṭṭhabhaddantiko nābhihaṭaṃ na uddissakataṃ na nimantanaṃ sādiyati. So na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā paṭiggaṇhāti, na eḷakamantaraṃ na daṇḍamantaraṃ na musalamantaraṃ na dvinnaṃ bhuñjamānānaṃ na gabbhiniyā na pāyamānāya na purisantaragatāya na saṅkittīsu na yattha sā upaṭṭhito hoti na yattha makkhikā saṇḍasaṇḍacārinī na macchaṃ na maṃsaṃ na suraṃ na merayaṃ na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko dvāgāriko vā hoti dvālopiko…pe… sattāgāriko vā hoti sattālopiko; ekissāpi dattiyā yāpeti dvīhipi dattīhi yāpeti…pe… sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti dvāhikampi āhāraṃ āhāreti…pe… sattāhikampi āhāraṃ āhāreti. Iti evarūpaṃ aḍḍhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. ‘‘So sākabhakkhopi hoti sāmākabhakkhopi hoti nīvārabhakkhopi hoti daddulabhakkhopi hoti haṭabhakkhopi hoti kaṇabhakkhopi hoti ācāmabhakkhopi hoti piññākabhakkhopi hoti tiṇabhakkhopi hoti gomayabhakkhopi hoti; vanamūlaphalāhāropi yāpeti pavattaphalabhojī. ‘‘So sāṇānipi dhāreti masāṇānipi dhāreti chavadussānipi dhāreti paṃsukūlānipi dhāreti tirīṭānipi dhāreti ajinampi dhāreti ajinakkhipampi dhāreti kusacīrampi dhāreti vākacīrampi dhāreti phalakacīrampi dhāreti kesakambalampi dhāreti vāḷakambalampi dhāreti ulūkapakkhampi dhāreti; kesamassulocakopi hoti kesamassulocanānuyogamanuyutto; ubbhaṭṭhakopi hoti āsanappaṭikkhitto; ukkuṭikopi hoti ukkuṭikappadhānamanuyutto; kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti; sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto viharati. Evaṃ kho, bhikkhave, puggalo attantapo hoti attaparitāpanānuyogamanuyutto. ‘‘Kathañca, bhikkhave, puggalo parantapo hoti paraparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco puggalo orabbhiko hoti sūkariko sākuṇiko māgaviko luddo macchaghātako coro coraghātako goghātako bandhanāgāriko, ye vā panaññepi keci kurūrakammantā. Evaṃ kho, bhikkhave, puggalo parantapo hoti paraparitāpanānuyogamanuyutto. ‘‘Kathañca, bhikkhave, puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto parantapo ca paraparitāpanānuyogamanuyutto? Idha, bhikkhave, ekacco puggalo rājā vā hoti khattiyo muddhāvasitto, brāhmaṇo vā hoti mahāsālo. So puratthimena nagarassa navaṃ santhāgāraṃ kārāpetvā kesamassuṃ ohāretvā kharājinaṃ nivāsetvā sappitelena kāyaṃ abbhañjitvā magavisāṇena piṭṭhiṃ kaṇḍuvamāno navaṃ santhāgāraṃ pavisati, saddhiṃ mahesiyā brāhmaṇena ca purohitena. So tattha anantarahitāya bhūmiyā haritupalittāya seyyaṃ kappeti. Ekissāya gāviyā sarūpavacchāya yaṃ ekasmiṃ thane khīraṃ hoti tena rājā yāpeti; yaṃ dutiyasmiṃ thane khīraṃ hoti tena mahesī yāpeti; yaṃ tatiyasmiṃ thane khīraṃ hoti tena brāhmaṇo purohito yāpeti; yaṃ catutthasmiṃ thane khīraṃ hoti tena aggiṃ juhati [juhanti (sī. pī.)]; avasesena vacchako yāpeti. So evamāha – ‘ettakā usabhā haññantu yaññatthāya, ettakā vacchatarā haññantu yaññatthāya, ettakā vacchatariyo haññantu yaññatthāya, ettakā ajā haññantu yaññatthāya, ettakā urabbhā haññantu yaññatthāya, (ettakā assā haññantu yaññatthāya,) [( ) natthi sī. syā. kaṃ. pī. potthakesu] ettakā rukkhā chijjantu yūpatthāya, ettakā dabbhā lūyantu barihisatthāyā’ti [parikammatthāyāti (ka.)]. Yepissa te honti dāsāti vā pessāti vā kammakarāti vā tepi daṇḍatajjitā bhayatajjitā assumukhā rudamānā parikammāni karonti. Evaṃ kho, bhikkhave, puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto parantapo ca paraparitāpanānuyogamanuyutto. ‘‘Kathañca, bhikkhave, puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto? So anattantapo aparantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati. Idha, bhikkhave, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Taṃ dhammaṃ suṇāti gahapati vā gahapatiputto vā aññatarasmiṃ vā kule paccājāto. So taṃ dhammaṃ sutvā tathāgate saddhaṃ paṭilabhati. So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati – ‘sambādho gharāvāso rajāpatho, abbhokāso pabbajjā; nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ; yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So aparena samayena appaṃ vā bhogakkhandhaṃ pahāya, mahantaṃ vā bhogakkhandhaṃ pahāya, appaṃ vā ñātiparivaṭṭaṃ pahāya, mahantaṃ vā ñātiparivaṭṭaṃ pahāya, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati. ‘‘So evaṃ pabbajito samāno bhikkhūnaṃ sikkhāsājīvasamāpanno pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. Adinnādānaṃ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. Abrahmacariyaṃ pahāya brahmacārī hoti ārācārī virato asaddhammā gāmadhammā. Musāvādaṃ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti, na ito sutvā amutra akkhātā imesaṃ bhedāya, na amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya; iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī attavādī dhammavādī vinayavādī; nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. ‘‘So bījagāmabhūtagāmasamārambhā paṭivirato hoti. Ekabhattiko hoti rattūparato virato vikālabhojanā. Naccagītavāditavisūkadassanā paṭivirato hoti. Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. Uccāsayanamahāsayanā paṭivirato hoti. Jātarūparajatapaṭiggahaṇā paṭivirato hoti. Āmakadhaññapaṭiggahaṇā paṭivirato hoti. Āmakamaṃsapaṭiggahaṇā paṭivirato hoti. Itthikumārikapaṭiggahaṇā paṭivirato hoti. Dāsidāsapaṭiggahaṇā paṭivirato hoti. Ajeḷakapaṭiggahaṇā paṭivirato hoti. Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. Hatthigavāssavaḷavapaṭiggahaṇā paṭivirato hoti. Khettavatthupaṭiggahaṇā paṭivirato hoti. Dūteyyapahiṇagamanānuyogā paṭivirato hoti. Kayavikkayā paṭivirato hoti. Tulākūṭakaṃsakūṭamānakūṭā paṭivirato hoti. Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. ‘‘So santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati samādāyeva pakkamati. Seyyathāpi nāma pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; evamevaṃ bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṃ anavajjasukhaṃ paṭisaṃvedeti. ‘‘So cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. So iminā ariyena indriyasaṃvarena samannāgato ajjhattaṃ abyāsekasukhaṃ paṭisaṃvedeti. ‘‘So abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. ‘‘So iminā ca ariyena sīlakkhandhena samannāgato, (imāya ca ariyāya santuṭṭhiyā samannāgato,) [( ) natthi sī. syā. potthakesu. ma. ni. 1.296; ma. ni. 2.13 passitabbaṃ] iminā ca ariyena indriyasaṃvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato [samannāgato. so (ka.)] vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanappatthaṃ abbhokāsaṃ palālapuñjaṃ. So pacchābhattaṃ piṇḍapātapaṭikkanto nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti. So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya…pe… sattānaṃ cutūpapātañāṇāya…pe… (so evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte) āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. ‘Ime āsavā’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. ‘‘Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Evaṃ kho, bhikkhave, puggalo nevattantapo hoti nāttaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto. So na attantapo na parantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ.",
      "english": "Monks, these four types of individuals exist, are present in the world. Which four? Here, monks, a certain individual is one who tortures himself, devoted to the practice of self-mortification. But here, monks, a certain individual is one who tortures others, devoted to the practice of tormenting others. But here, monks, a certain individual is one who tortures himself, devoted to the practice of self-mortification, and also tortures others, devoted to the practice of tormenting others. But here, monks, a certain individual is neither one who tortures himself, nor devoted to the practice of self-mortification, nor one who tortures others, nor devoted to the practice of tormenting others. That one, being neither a self-tormentor nor an other-tormentor, is in this very life quenched, cooled, calmed, experiences happiness, and dwells with a sublime nature of self.\n\nAnd how, monks, is an individual one who tortures himself, devoted to the practice of self-mortification? Here, monks, a certain individual goes naked, follows unregulated conduct, licks his hands, does not accept food brought to him, does not accept food offered to him to stop, does not accept food specially prepared or offered by invitation. He does not accept food from the mouth of a pot, nor from the mouth of a bowl, nor from within a threshold, nor from between sticks, nor from between two persons eating, nor from a pregnant woman, nor from a nursing mother, nor from a woman with a man, nor from a place where dogs are waiting, nor where a dog has stopped, nor from a place where flies gather, nor fish, nor meat, nor liquor, nor intoxicants, nor fermented rice gruel. He eats from one house or takes one mouthful, from two houses or takes two mouthfuls, from three houses or takes three mouthfuls, from four houses or takes four mouthfuls, from five houses or takes five mouthfuls, from six houses or takes six mouthfuls, up to seven houses or takes seven mouthfuls; he sustains himself on one offering, on two offerings, on three offerings, on four offerings, on five offerings, on six offerings, up to seven offerings; he eats food once a day, once every two days, once every three days, once every four days, once every five days, once every six days, up to once every seven days. Thus, he dwells devoted to such a practice of eating at fixed intervals, even up to half a month.\n\nHe eats vegetables, eats millet, eats wild rice, eats scraps of skin, eats powder, eats rice bran, eats scum of rice gruel, eats oil cakes, eats grass, eats cow dung; he sustains himself on roots and fruits of the forest, eating fallen fruits.\n\nHe wears coarse hempen clothes, clothes of fine hemp, shrouds from charnel grounds, rag-robes, strips of bark, antelope skin, strips of antelope skin, kusa grass robes, bark fiber robes, wood-shaving robes, hair blankets, animal-hair blankets, or owl's wings; he is one who plucks out hair and beard, devoted to the practice of plucking out hair and beard; he stands erect, rejecting seats; he squats, devoted to the practice of squatting; he sleeps on a bed of thorns, making his bed on thorns; he dwells devoted to the practice of thrice daily descending into water. Thus, he dwells devoted to various kinds of practices of heating and tormenting the body. In this way, monks, an individual is one who tortures himself, devoted to the practice of self-mortification.\n\nAnd how, monks, is an individual one who tortures others, devoted to the practice of tormenting others? Here, monks, a certain individual is a sheep butcher, a pig butcher, a fowler, a hunter, a trapper, a fisherman, a thief, an executioner, a cattle butcher, a jailer, or anyone else who engages in cruel occupations. In this way, monks, an individual is one who tortures others, devoted to the practice of tormenting others.\n\nAnd how, monks, is an individual one who tortures himself, devoted to the practice of self-mortification, and also tortures others, devoted to the practice of tormenting others? Here, monks, a certain individual might be an anointed Kshatriya king or a wealthy Brahmin. He has a new assembly hall built to the east of the city. Then, after shaving his hair and beard, donning a rough antelope skin, anointing his body with ghee and oil, and scratching his back with a deer's horn, he enters the new assembly hall with his chief queen and his Brahmin priest. There, he makes his bed on the ground that has been smeared with green grass without any covering. From a single cow with a calf that resembles it, the king sustains himself on the milk from one udder; the chief queen sustains herself on the milk from the second udder; the Brahmin priest sustains himself on the milk from the third udder; the milk from the fourth udder is offered into the fire; and the calf sustains itself on the remainder. Then he says, ‘Let so many bulls be slaughtered for the sacrifice, let so many steer be slaughtered for the sacrifice, let so many heifers be slaughtered for the sacrifice, let so many goats be slaughtered for the sacrifice, let so many rams be slaughtered for the sacrifice, let so many horses be slaughtered for the sacrifice.’\n\nLet so many trees be cut down for the sacrificial post; let so many kusa grasses be plucked for the purpose of ritual preparation. And whoever are their slaves, their servants, or their workers, they, threatened by punishment, threatened by fear, with tearful faces, weeping, perform these preparations. Thus, monks, a person is one who torments himself, devoted to the practice of self-torment, and torments others, devoted to the practice of tormenting others.\n\nAnd how, monks, is a person one who neither torments himself nor is devoted to the practice of self-torment, neither torments others nor is devoted to the practice of tormenting others? Such a person, not tormenting himself, not tormenting others, is quenched, extinguished, cooled in this very life, experiencing happiness, dwelling with a mind that has become exalted. Here, monks, a Tathāgata arises in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, a Fortunate One, knower of the worlds, an unsurpassed guide for those to be tamed, a teacher of gods and humans, a Buddha, a Blessed One. He, this world with its gods, with its Māras, with its Brahmas, with its recluses and brahmins, its populace with gods and humans, having directly known and realized it for himself, proclaims it. He teaches the Dhamma, beautiful in the beginning, beautiful in the middle, beautiful in the end, with both meaning and expression; he proclaims the holy life in its entirety, perfectly complete and purified. A householder or a householder's son, or someone born into another family, hears that Dhamma. Having heard that Dhamma, he gains faith in the Tathāgata. Endowed with that acquired faith, he reflects thus: 'Confining is the household life, a path of dust; the going forth into homelessness is open space. It is not easy for one living in a home to practice the holy life in its completeness, in its perfect purity, like a polished conch shell. What if I were to shave off my hair and beard, put on saffron robes, and go forth from the home life into homelessness?' Later, at another time, having abandoned a small accumulation of wealth, or having abandoned a large accumulation of wealth, having abandoned a small circle of relatives, or having abandoned a large circle of relatives, he shaves off his hair and beard, puts on saffron robes, and goes forth from the home life into homelessness.\n\nHaving thus gone forth, he enters the training and way of life of the monks. He abandons the taking of life, abstains from taking life; having laid down rod and weapon, he is conscientious, full of kindness, dwelling with compassion for the welfare of all living beings. He abandons taking what is not given, abstains from taking what is not given; he takes what is given, expects what is given, dwelling with a self purified from theft. He abandons unchastity and is chaste; he lives apart, abstaining from unholy practices, from village ways. He abandons false speech, abstains from false speech; he is a speaker of truth, a unifier of truth, reliable, trustworthy, not a deceiver of the world. He abandons divisive speech, abstains from divisive speech; he does not repeat there what he has heard here in order to cause division, nor does he repeat here what he has heard there in order to cause division. Thus, he is a reconciler of those who are divided, a promoter of unity among those who are united, delighting in unity, rejoicing in unity, enjoying unity, speaking words that promote unity. He abandons harsh speech, abstains from harsh speech; he speaks words that are gentle, pleasing to the ear, affectionate, reaching the heart, courteous, cherished by many, agreeable to many. He abandons frivolous chatter, abstains from frivolous chatter; he speaks at the right time, speaks what is factual, speaks about the purpose, speaks about the Dhamma, speaks about the Vinaya; he speaks words that are treasured, opportune, reasoned, conclusive, and beneficial.\n\nHe abstains from harming seeds and plants. He eats only one meal a day, abstaining from food at night and from untimely eating. He abstains from seeing dancing, singing, music, and unseemly shows. He abstains from wearing garlands, using perfumes, and adorning himself with cosmetics and ornaments. He abstains from using high and luxurious beds. He abstains from accepting gold and silver. He abstains from accepting raw grain. He abstains from accepting raw meat. He abstains from accepting women and girls. He abstains from accepting male and female slaves. He abstains from accepting goats and sheep. He abstains from accepting chickens and pigs. He abstains from accepting elephants, cattle, horses, and mares. He abstains from accepting fields and lands. He abstains from engaging in messenger work and going on errands. He abstains from buying and selling. He abstains from cheating with scales, metals, or measures. He abstains from bribery, deception, fraud, and crookedness. He abstains from cutting, killing, binding, highway robbery, plunder, and violence. He is content with robes to protect his body and with almsfood to sustain his stomach. Wherever he goes, he goes taking only these. Just as a bird, wherever it flies, flies with only its wings as its burden; even so, a monk is content with robes to protect his body and with almsfood to sustain his stomach. Wherever he goes, he goes taking only these.\n\nHe, endowed with this noble aggregate of virtue, experiences blameless happiness within himself. Having seen a form with the eye, he is not a perceiver of its general appearance nor of its specific features. For as long as, due to his eye faculty remaining uncontrolled, evil unwholesome states of covetousness and distress might overwhelm him, he practices for its restraint; he guards the eye faculty; he undertakes the restraint of the eye faculty. Having heard a sound with the ear, having smelled a scent with the nose, having tasted a flavor with the tongue, having felt a tactile sensation with the body, having cognized a mental phenomenon with the mind, he is not a perceiver of its general appearance nor of its specific features. For as long as, due to his mind faculty remaining uncontrolled, evil unwholesome states of covetousness and distress might overwhelm him, he practices for its restraint; he guards the mind faculty; he undertakes the restraint of the mind faculty. He, endowed with this noble restraint of the faculties, experiences unperturbed happiness within himself.\n\nHe acts with full awareness when going forward and returning; he acts with full awareness when looking ahead and looking around; he acts with full awareness when flexing and extending his limbs; he acts with full awareness when wearing his outer robe, inner robe, and bowl; he acts with full awareness when eating, drinking, chewing, and tasting; he acts with full awareness when defecating and urinating; he acts with full awareness when walking, standing, sitting, sleeping, waking, speaking, and remaining silent.\n\nHe, endowed with this noble aggregate of virtue, endowed with this noble restraint of the faculties, and endowed with this noble mindfulness and full awareness, resorts to a secluded dwelling place: a wilderness, a root of a tree, a mountain, a ravine, a cave, a charnel ground, a forest grove, an open-air dwelling, or a heap of straw. After his meal, having returned from his alms round, he sits down, sitting cross-legged, holding his body erect, and establishing mindfulness in front of him. Having abandoned covetousness for the world, he dwells with a mind free from covetousness; he purifies his mind from covetousness. Having abandoned ill will and malice, he dwells with a mind free from ill will, sympathetic for the welfare of all living beings; he purifies his mind from ill will and malice. Having abandoned sloth and torpor, he dwells free from sloth and torpor, perceiving light, mindful and fully aware; he purifies his mind from sloth and torpor. Having abandoned restlessness and remorse, he dwells unagitated, with his mind inwardly peaceful; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having overcome doubt, without perplexity regarding wholesome states; he purifies his mind from doubt. Having abandoned these five hindrances, which are defilements of the mind that weaken wisdom, he, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna, and advancing through the second and third jhāna, finally enters and dwells in the fourth jhāna, which is neither painful nor pleasant, but purified by equanimity and mindfulness.\n\nWith his mind thus concentrated, purified, bright, unblemished, rid of defilements, malleable, wieldy, steady, and imperturbable, he directs and inclines his mind to the knowledge of past lives, to the knowledge of the passing away and reappearance of beings, and to the knowledge of the destruction of the taints. He understands, as it actually is, 'This is suffering.' He understands, as it actually is, 'This is the origin of suffering.' He understands, as it actually is, 'This is the cessation of suffering.' He understands, as it actually is, 'This is the path leading to the cessation of suffering.' He understands, as it actually is, 'These are the taints.' He understands, as it actually is, 'This is the origin of the taints.' He understands, as it actually is, 'This is the cessation of the taints.' He understands, as it actually is, 'This is the path leading to the cessation of the taints.'\n\nFor him, knowing and seeing thus, his mind is liberated from the taint of sensual desire, his mind is liberated from the taint of existence, and his mind is liberated from the taint of ignorance; and there arises in him the knowledge: 'Liberated is my liberation.' He understands: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.' It is in this way, bhikkhus, that a person is not an afflicter of self nor one devoted to the practice of self-affliction, nor an afflicter of others nor one devoted to the practice of afflicting others. Such a one, not afflicting self nor others, in this very life is cooled, extinguished, has become cool, and experiences happiness, dwelling with a mind that has become sublime. These four types of persons, bhikkhus, are found existing in the world.",
      "sinhala": "භික්‍ෂූනි, ලෝකයේ මේ පුද්ගලයන් සතර දෙනෙක් සිටිති, විද්‍යමාන වෙති. ඒ සතර දෙනා කවරහුද? භික්‍ෂූනි, මේ ලෝකයේ ඇතැම් පුද්ගලයෙක් තමාම තපස් වදින්නෙක් වේ, තමාට දුක් දීමෙහි, තමා පීඩා කිරීමෙහි යෙදී වාසය කරයි. භික්‍ෂූනි, මේ ලෝකයේ ඇතැම් පුද්ගලයෙක් අනුන්ට තපස් වදින්නෙක් වේ, අනුන්ට දුක් දීමෙහි, අනුන් පීඩා කිරීමෙහි යෙදී වාසය කරයි. භික්‍ෂූනි, මේ ලෝකයේ ඇතැම් පුද්ගලයෙක් තමාටත් තපස් වදින්නෙක් වේ, තමාට දුක් දීමෙහි, තමා පීඩා කිරීමෙහි යෙදී වාසය කරයි. අනුන්ටත් තපස් වදින්නෙක් වේ, අනුන්ට දුක් දීමෙහි, අනුන් පීඩා කිරීමෙහි යෙදී වාසය කරයි. භික්‍ෂූනි, මේ ලෝකයේ ඇතැම් පුද්ගලයෙක් තමාට දුක් දෙන්නෙක් හෝ තමා පීඩා කරන්නෙක් හෝ නොවේ, අනුන්ට දුක් දෙන්නෙක් හෝ අනුන් පීඩා කරන්නෙක් හෝ නොවේ. හෙතෙම තමාට දුක් දෙන්නෙක් හෝ අනුන්ට දුක් දෙන්නෙක් හෝ නොවේ, මේ දැක්කා වූ ධර්මයෙහිම තෘෂ්ණාව පහ කළ, කෙලෙස් නිවා දැමූ, සන්සිඳුණු සිත් ඇත්තේ, සැපය අත්විඳිමින්, උතුම් බවට පත් වූ සිතකින් යුතුව වාසය කරයි.\n\nභික්‍ෂූනි, පුද්ගලයෙක් තමාටම දුක් දෙන්නෙක්, තමා පීඩා කරන්නෙක් වන්නේ කෙසේද? භික්‍ෂූනි, මේ ලෝකයේ ඇතැම් පුද්ගලයෙක් වස්ත්‍ර රහිතව ජීවත් වේ, හැසිරීමෙන් මිදුණු (නිදහස්) වේ, අත ලෙවකමින් කෑම ගනී, ‘එන්න ස්වාමීනි’ කියා ගෙන්වූ විට නොගනී, ‘නවතින්න ස්වාමීනි’ කියා නැවැත්වූ විට නොගනී, තමා වෙත ගෙනා දෑ, තමා වෙනුවෙන් විශේෂයෙන් පිළියෙළ කළ දෑ, ආරාධනයකින් ලැබෙන දෑ නොපිළිගනී. හෙතෙම කළයක කටකින් නොගනී, වළඳක කටකින් නොගනී, එළු රැළක් අතරින් නොගනී, දඬු අතරින් නොගනී, මුගුරු අතරින් නොගනී, දෙදෙනෙකු කෑම කන අතරින් නොගනී, ගැබිණියකගෙන් නොගනී, දරුවන්ට කිරි දෙන මවකගෙන් නොගනී, පිරිමියන් අතර සිටින කාන්තාවකගෙන් නොගනී, එකතු වී කෑමට පිළියෙළ කර ඇති තැනකින් නොගනී, බලු කෑම පිණිස පිළියෙළ කර ඇති තැනකින් නොගනී, මැස්සන් රංචු වශයෙන් ගැවසෙන තැනකින් නොගනී, මාළු, මස්, සුරා, මේරය, දහයියා වතුර නොබොයි. හෙතෙම එක් ගෙයකින් එක් පිඬු සිඟා ජීවත් වේ, දෙගෙයකින් දෙපිඬු සිඟා ජීවත් වේ... සත්ගෙයකින් සත්පිඬු සිඟා ජීවත් වේ. එක් දානයකින් ජීවත් වේ, දෙදානයකින් ජීවත් වේ... සත්දානයකින් ජීවත් වේ. දිනකට වරක් ආහාර ගනී, දෙදිනකට වරක් ආහාර ගනී... සත්දිනකට වරක් ආහාර ගනී. මෙලෙස අඩමසකට වරක් හෝ ආහාර ගන්නා පුරුද්දෙහි යෙදී වාසය කරයි.\n\nහෙතෙම කොළ අනුභව කරයි, සප්පලම් අනුභව කරයි, නීවාර අනුභව කරයි, දද්දුල අනුභව කරයි, හැට අනුභව කරයි, කැඳ පෙරා ඉතිරිවන බත් අනුභව කරයි, කැඳ වතුර අනුභව කරයි, තලපිටි අනුභව කරයි, තණකොළ අනුභව කරයි, ගොම අනුභව කරයි; වනයේ මුල් හා පලතුරු අනුභව කරමින් ජීවත් වේ, බිම වැටුණු පලතුරු අනුභව කරයි. හෙතෙම හණ රෙදි අඳියි, (හණට වඩා) තද රෙදි අඳියි, මිනී ඔතන රෙදි අඳියි, කුණු රෙදි අඳියි, ලී කොට රෙදි අඳියි, මුව සම අඳියි, මුව සමෙන් සාදාගත් (සම්) කඩමාලු අඳියි, තණ කොළ වස්ත්‍ර අඳියි, පොතු වස්ත්‍ර අඳියි, ලී පතුරු වස්ත්‍ර අඳියි, කේශකම්බලි (කෙස් වලින් සාදාගත් පටල) අඳියි, (සත්ව) ලොම් වලින් සාදාගත් පටල අඳියි, බකමුණන්ගේ පිහාටු අඳියි. කෙස් රැවුල් උදුරන්නෙක් වේ, කෙස් රැවුල් උදුරමින් දුක් විඳීමෙහි යෙදේ. සිටගෙනම සිටින්නෙක් වේ, හිඳ ගැනීම ප්‍රතික්‍ෂේප කරයි. උක්කුටිකාසනයෙන් (කොරපොතු ගැසූ ආකාරයට) සිටින්නෙක් වේ, එසේ සිටිමින් වීර්ය කරයි. කටු ඇති ඇඳන් මත නිදන්නෙක් වේ, කටු ඇති තැනැක නිදයි. දිනකට තුන් වරක් සවස ජලයට බැස (ශරීරයට දුක් දෙමින්) වාසය කරයි. මෙලෙස නොයෙක් ආකාරයෙන් ශරීරය තපස් වදවා, පීඩා කරමින් වාසය කරයි. භික්‍ෂූනි, පුද්ගලයෙක් තමාටම දුක් දෙන්නෙක්, තමා පීඩා කරන්නෙක් වන්නේ එසේය.\n\nභික්‍ෂූනි, පුද්ගලයෙක් අනුන්ට දුක් දෙන්නෙක්, අනුන් පීඩා කරන්නෙක් වන්නේ කෙසේද? භික්‍ෂූනි, මේ ලෝකයේ ඇතැම් පුද්ගලයෙක් එළු මරන්නෙක් වේ, ඌරු මරන්නෙක් වේ, කුරුළු දඩයම් කරන්නෙක් වේ, මුවන් දඩයම් කරන්නෙක් වේ, මෘග මරන්නෙක් (දඩයක්කාරයෙක්) වේ, මසුන් මරන්නෙක් වේ, සොරෙක් වේ, සොර මරන්නෙක් (සොරුන් අල්ලා මරණ නිලධාරියෙක්) වේ, ගව ඝාතකයෙක් වේ, සිරකරන්නෙක් (බන්ධනාගාරිකයෙක්) වේ, යම් අන්‍ය කෲර කර්මාන්ත ඇත්තෙක් වේද, ඒ සියල්ලෝම (අනුන්ට දුක් දෙන්නෝ වෙති). භික්‍ෂූනි, පුද්ගලයෙක් අනුන්ට දුක් දෙන්නෙක්, අනුන් පීඩා කරන්නෙක් වන්නේ එසේය.\n\nභික්‍ෂූනි, පුද්ගලයෙක් තමාටත් අනුන්ටත් දුක් දෙන්නෙක්, තමාටත් අනුන්ටත් පීඩා කරන්නෙක් වන්නේ කෙසේද? භික්‍ෂූනි, මේ ලෝකයේ ඇතැම් පුද්ගලයෙක් අභිෂේක ලත් ක්ෂත්‍රිය රජෙක් වේ, නැතහොත් මහත් ධන සම්පත් ඇති බ්‍රාහ්මණයෙක් වේ. හෙතෙම නගරයට නැගෙනහිර දිශාවෙන් අලුත් යඥශාලාවක් සාදවා, කෙස් රැවුල් කප්පවා, ගොරහැඩි මුව සමක් හැඳ, ගිතෙල් වලින් ශරීරය ගල්වා, මුව අං වලින් පිට කසමින්, අලුත් යඥශාලාවට බිසව සහ බමුණු පුරෝහිතයා සමඟ ඇතුළු වේ. හෙතෙම එහි තණකොළ තැවරූ, කිසිදු බාධාවක් නැති බිමක නිදයි. එක් රූප සම්පන්න වස්සකු ඇති එළදෙනකගේ එක් තනකින් ලැබෙන කිරිවලින් රජු ජීවත් වේ, දෙවැනි තනකින් ලැබෙන කිරිවලින් බිසව ජීවත් වේ, තුන්වැනි තනකින් ලැබෙන කිරිවලින් බමුණු පුරෝහිතයා ජීවත් වේ, සතරවැනි තනකින් ලැබෙන කිරිවලින් ගින්නට හෝම කරයි; ඉතිරි කිරිවලින් වස්සා ජීවත් වේ. හෙතෙම මෙසේ කියයි: ‘මෙපමණ ගොනුන් යඥය සඳහා මරනු ලැබේවා! මෙපමණ වස්සන් යඥය සඳහා මරනු ලැබේවා! මෙපමණ වස්සීන් යඥය සඳහා මරනු ලැබේවා! මෙපමණ එළුවන් යඥය සඳහා මරනු ලැබේවා! මෙපමණ බැටළුවන් යඥය සඳහා මරනු ලැබේවා!’\n\n\"එතරම් ගස් යූපයන් සඳහා කපනු ලැබේවා! එතරම් දබ්භ තෘණ බරිහිස් (යඥාංග) සඳහා නෙලනු ලැබේවා!\" යි (කියා දීම) පොත්වල ඇත. යම් කිසිවෙක් ඔහුගේ දාසයෝ හෝ පේෂ කාරයෝ හෝ කම්කරුවෝ හෝ වෙත්ද, ඔවුහු ද දඬුවම් කරනවාට බිය වී, බියපත් වී, කඳුළු පිරි මුහුණින් හඬමින් (ඒ) පිරිසැකසුම් කරති. මහණෙනි, මෙසේ පුද්ගලයා තමාට දුක් දෙන්නෙක් ද වේ, තමාට දුක් දීමේ නිරත වූවෙක් ද වේ, අන්‍යයන්ට දුක් දෙන්නෙක් ද වේ, අන්‍යයන්ට දුක් දීමේ නිරත වූවෙක් ද වේ.\n\n\"මහණෙනි, පුද්ගලයා කෙසේ නම් තමාට දුක් දෙන්නෙක් ද නොවන්නේද, තමාට දුක් දීමේ නිරත වූවෙක් ද නොවන්නේද, අන්‍යයන්ට දුක් දෙන්නෙක් ද නොවන්නේද, අන්‍යයන්ට දුක් දීමේ නිරත වූවෙක් ද නොවන්නේද?\" හෙතෙම තමාට දුක් නොදෙන්නෙක් ද, අන්‍යයන්ට දුක් නොදෙන්නෙක් ද වී, මේ දිට්ඨධර්මයෙහි ම තෘෂ්ණාව නැති කරන ලදුව, (දුකින්) නිවුණේ, සිසිල් වූයේ, සැපය අත්දකින්නේ, බ්‍රහ්මභාවයට පත් වූ ආත්මභාවයකින් වාසය කරයි. මහණෙනි, මෙහි ලොව පහළ වන්නේ රහත් වූ, සම්මාසම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, නිරුත්තර වූ, පුරිසදම්මසාරථී වූ, දෙවි මිනිසුන්ගේ ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ ය.\n\nඋන්වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණයන් හා බ්‍රාහ්මණයන් සහිත වූ, දෙව් මිනිසුන් සහිත වූ මේ ලෝකය තමන් විසින් ම අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, (අන්‍යයන්ට) ප්‍රකාශ කරති. උන්වහන්සේ මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථයෙන් ද ව්‍යංජනයෙන් ද යුත් ධර්මය දේශනා කරති. උන්වහන්සේ අතිශයින් ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරති.\n\nගෘහපතියෙක් හෝ ගෘහපති පුත්‍රයෙක් හෝ යම්කිසි කුලයක උපන් කෙනෙක් හෝ ඒ ධර්මය අසයි. හෙතෙම ඒ ධර්මය අසා තථාගතයන් වහන්සේ කෙරෙහි ශ්‍රද්ධාව ලබයි. හෙතෙම ඒ ශ්‍රද්ධා ලාභයෙන් යුක්තව මෙසේ සිතයි: \"ගිහි ගෙය ගිරිකුළක් බඳු ය. කෙලෙස් රජසින් පිරි මගක් ය. පැවිද්ද එළිමහනක් බඳු ය. ගිහි ගෙයෙහි වසන කෙනෙකුට, අතිශයින් ම පිරිපුන් වූ, අතිශයින් ම පිරිසිදු වූ, හක්ගෙඩියක් මෙන් මදක් හෝ කිලුටක් නැති බ්‍රහ්මචර්යාව පිරීම පහසු නොවේ. යම් හෙයකින් මම කෙස් රැවුල් බා දමා, කහවත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වුවහොත් හොඳ ය.\"\n\nහෙතෙම වෙනත් කලක ස්වල්ප වූ හෝ භෝග සම්භාරයක් අත්හැර, මහත් වූ හෝ භෝග සම්භාරයක් අත්හැර, ස්වල්ප වූ හෝ ඥාති පිරිසක් අත්හැර, මහත් වූ හෝ ඥාති පිරිසක් අත්හැර, කෙස් රැවුල් බා දමා, කහවත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වෙයි.\n\n\"හෙතෙම මෙසේ පැවිදි වූයේ භික්ෂූන්ගේ ශික්ෂාව හා ජීවන ක්‍රමය අනුගමනය කරමින්, ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකුණේ වේ. දඬු මුගුරු පහත හෙළා, ආයුධ පහත හෙළා, ලජ්ජාශීලී වී, දයාවන්ත වී, සියලු ප්‍රාණ භූතයන්ට හිතානුකම්පීව වාසය කරයි. අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වැළකුණේ වේ. දෙන ලද දේ ගන්නෙක්, දෙන ලද දේ බලාපොරොත්තු වන්නෙක් වී, සොරකම් නොකළ, පිරිසිදු ආත්මභාවයකින් වාසය කරයි. අබ්‍රහ්මචර්යාව අත්හැර, බ්‍රහ්මචාරී වේ. දුරස්ථව හැසිරෙයි. අශ්‍රේෂ්ඨ වූ ලෞකික ධර්මයෙන් හා ග්‍රාම ධර්මයෙන් වැළකුණේ වේ. මුසාවාදය අත්හැර, මුසාවාදයෙන් වැළකුණේ වේ. සත්‍යවාදී වේ, සත්‍යයට බැඳී සිටින්නේ ය, ස්ථිර ය, විශ්වාස කටයුතු ය, ලෝකයා රවටන්නෙක් නොවේ. පිසුණු වචනය අත්හැර, පිසුණු වචනයෙන් වැළකුණේ වේ. මෙතැනින් අසා ඔවුන් බිඳුවනු පිණිස අසවල් තැන නොකියයි. අසවල් තැනින් අසා මොවුන් බිඳුවනු පිණිස මෙතැන නොකියයි. මෙසේ භේද වූවන් එක් කරන්නෙක් ද වේ, එක් වූවන් තව තවත් දිරිමත් කරන්නෙක් ද වේ, සමඟියට ඇළුම් කරන්නෙක් ද වේ, සමඟියෙහි රඳන්නේ ය, සමඟියෙන් සතුටු වන්නෙක් ද වේ, සමඟිය ඇති කරන්නාවූ වචන ම කතා කරන්නෙක් වේ. පරුෂ වචනය අත්හැර, පරුෂ වචනයෙන් වැළකුණේ වේ. යම් ඒ වචනයක් මෘදු ද, කනට සුවදායක ද, ප්‍රිය මනාප ද, හදවතට ගෝචර ද, නාගරිකයන්ගේ වචන මෙන් වටිනා ද, බොහෝ දෙනාට ප්‍රිය ද, බොහෝ දෙනාට මනාප ද, එවැනි වචන කතා කරන්නෙක් වේ. සම්ප්‍රප්පලාපය අත්හැර, සම්ප්‍රප්පලාපයෙන් වැළකුණේ වේ. කලට සුදුසු දේ කියන්නෙක්, සත්‍ය වූ දේ කියන්නෙක්, අර්ථවත් දේ කියන්නෙක්, ධර්මය කියන්නෙක්, විනය කියන්නෙක් වේ. නිධානයක් මෙන් වටිනා වූ, කලට සුදුසු වූ, හේතු සහිත වූ, සීමාවක් සහිත වූ, අර්ථයෙන් යුක්ත වූ වචන කතා කරන්නෙක් වේ.\n\n\"හෙතෙම බීජ ගම් (බීජ රෝපණ) හා භූත ගම් (වෘක්ෂ රෝපණ) ආරම්භ කිරීමෙන් වැළකුණේ වේ. එක් වේලක් වළඳයි. රාත්‍රී ආහාරයෙන් වැළකුණේ වේ. විකල් භෝජනයෙන් වැළකුණේ වේ. නැටුම්, ගීත, වාදන හා විසුක දර්ශන නැරඹීමෙන් වැළකුණේ වේ. මාලා, ගන්ධ, විලවුන් දැරීමෙන් හා මණ්ඩන විභූෂණ ස්ථානයන්ගෙන් (අලංකාර කිරීම් හා සැරසීම් වලින්) වැළකුණේ වේ. උසස් අසුන් හා මහා අසුන් (විශාල යහන්) වලින් වැළකුණේ වේ. රන් රිදී පිළිගැනීමෙන් වැළකුණේ වේ. අමු ධාන්‍ය පිළිගැනීමෙන් වැළකුණේ වේ. අමු මස් පිළිගැනීමෙන් වැළකුණේ වේ. ස්ත්‍රීන් හා කුමාරිකාවන් පිළිගැනීමෙන් වැළකුණේ වේ. දාස දාසියන් පිළිගැනීමෙන් වැළකුණේ වේ. එළු බැටළුවන් පිළිගැනීමෙන් වැළකුණේ වේ. කුකුළන් හා ඌරන් පිළිගැනීමෙන් වැළකුණේ වේ. ඇතුන්, ගවයන්, අශ්වයන් හා වෙළඹුන් පිළිගැනීමෙන් වැළකුණේ වේ. කුඹුරු හා ඉඩකඩම් පිළිගැනීමෙන් වැළකුණේ වේ. දූත කටයුතු හා පණිවිඩ ගෙන යෑමේ නිරත වීමෙන් වැළකුණේ වේ. මිල දී ගැනීමෙන් හා විකිණීමෙන් වැළකුණේ වේ. තරාදි කූට, ලෝහ කූට, ප්‍රමාණ කූට (කිරුම් මිනුම් වංචා) වලින් වැළකුණේ වේ. අල්ලස් ගැනීමෙන්, වංචා කිරීමෙන්, කූට ලෙස හැසිරීමෙන් හා ව්‍යාජ ක්‍රියා වලින් වැළකුණේ වේ. කප්පාදු කිරීමෙන්, ඝාතනය කිරීමෙන්, බැඳීමෙන්, කොල්ලකෑමෙන්, බලාත්කාරයෙන් පැහැර ගැනීමෙන් හා බලහත්කාරයෙන් ක්‍රියා කිරීමෙන් වැළකුණේ වේ.\n\n\"හෙතෙම ශරීරය වසා ගැනීමට සිවුරෙන් ද, කුස පිරවීමට පිණ්ඩපාතයෙන් ද සතුටු වෙයි. හෙතෙම යම් යම් තැනකට යයි ද, (ඒවා) රැගෙන ම යයි. කුරුල්ලෙක් හෝ සතෙක් හෝ යම් යම් තැනකට පියාසර කරන්නේ ද, තමන්ගේ පියාපත් බර පමණක් රැගෙන පියාසර කරන්නාක් මෙන් ම, භික්ෂුව ද ශරීරය වසා ගැනීමට සිවුරෙන් ද, කුස පිරවීමට පිණ්ඩපාතයෙන් ද සතුටු වෙයි. හෙතෙම යම් යම් තැනකට යයි ද, (ඒවා) රැගෙන ම යයි.\n\nඔහු මේ ආර්ය ශීලස්කන්ධයෙන් යුක්තව ඇතුළතින් නිරවද්‍ය සැපයක් අනුභව කරයි.\n\nඔහු ඇසින් රූපයක් දැක සාමාන්‍ය ස්වරූපය අල්ලන්නෙක් නොවෙයි, විශේෂ ලක්ෂණ අල්ලන්නෙක්ද නොවෙයි. යම් කරුණක් නිසා මේ ඇස් ඉන්ද්‍රිය අසංවරව පවතින්නහු කෙරෙහි අධිධ්‍යාව (තණ්හාව) සහ දෝමනස්සය (ද්වේශය) යන පාපී අකුසල ධර්මයන් හටගනීද, ඔහු ඒවා සංවර කරගැනීම පිණිස පිළිපදින්නේය; ඇස් ඉන්ද්‍රිය රකින්නේය; ඇස් ඉන්ද්‍රියෙහි සංවරයට පැමිණෙන්නේය. කනින් ශබ්දයක් අසා... නාසයෙන් ගඳක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් පහසක් ස්පර්ශ කොට... සිතින් ධර්මයක් (මනෝරූපයක්) දැන සාමාන්‍ය ස්වරූපය අල්ලන්නෙක් නොවෙයි, විශේෂ ලක්ෂණ අල්ලන්නෙක්ද නොවෙයි. යම් කරුණක් නිසා මේ මනෝ ඉන්ද්‍රිය අසංවරව පවතින්නහු කෙරෙහි අධිධ්‍යාව (තණ්හාව) සහ දෝමනස්සය (ද්වේශය) යන පාපී අකුසල ධර්මයන් හටගනීද, ඔහු ඒවා සංවර කරගැනීම පිණිස පිළිපදින්නේය; මනෝ ඉන්ද්‍රිය රකින්නේය; මනෝ ඉන්ද්‍රියෙහි සංවරයට පැමිණෙන්නේය. ඔහු මේ ආර්ය ඉන්ද්‍රිය සංවරයෙන් යුක්තව ඇතුළතින් නොකැළඹෙන සැපයක් අනුභව කරයි.\n\nඔහු ඉදිරියට යන විට, පසුපසට එන විට මනා සිහියෙන් යුතුව කටයුතු කරන්නේය; ඉදිරිපස බලන විට, සතර දිශාව බලන විට මනා සිහියෙන් යුතුව කටයුතු කරන්නේය; (අත්පා) හැකිලීමේදී, දිග හැරීමේදී මනා සිහියෙන් යුතුව කටයුතු කරන්නේය; සංඝාටිය, පාත්‍රය, සිවුරු දැරීමේදී මනා සිහියෙන් යුතුව කටයුතු කරන්නේය; අනුභව කිරීමේදී, පානය කිරීමේදී, සැපීමේදී, රස විඳීමේදී මනා සිහියෙන් යුතුව කටයුතු කරන්නේය; මලමූත්‍ර පිටකිරීමේදී මනා සිහියෙන් යුතුව කටයුතු කරන්නේය; යන විට, සිටින විට, හිඳින විට, නිදන විට, පිබිද සිටින විට, කතා කරන විට, නිශ්ශබ්දව සිටින විට මනා සිහියෙන් යුතුව කටයුතු කරන්නේය.\n\nඔහු මේ ආර්ය ශීලස්කන්ධයෙන් යුක්තව, මේ ආර්ය ඉන්ද්‍රිය සංවරයෙන් යුක්තව, මේ ආර්ය සිහි නුවණින් යුක්තව විවේක සේනාසන සෙවීමට යයි; අරණ්‍යක්, රුක්මුලක්, පර්වතයක්, ගල්ගුහාවක්, කදුරක්, සුසානයක්, වනපෙතක්, එළිමහනක්, පිදුරු ගොඩක් වැනි ස්ථාන භජනය කරයි. ඔහු දානය වැළඳීමෙන් පසු, පලක් බැඳගෙන, ශරීරය ඍජුව තබාගෙන, සිහිය ඉදිරියෙන් පිහිටුවාගෙන හිඳගනී. ඔහු ලෝකය කෙරෙහි ඇති අධිධ්‍යාව (තණ්හාව) ප්‍රහාණය කොට, අධිධ්‍යාව පහ වූ සිතින් වාසය කරයි; අධිධ්‍යාවෙන් සිත පිරිසිදු කරයි. ව්‍යාපාද ද්වේෂය ප්‍රහාණය කොට, සියලු සත්වයන්ගේ හිත සුව කැමතිව, අනුකම්පාවෙන් යුතුව ව්‍යාපාද රහිත සිතින් වාසය කරයි; ව්‍යාපාද ද්වේෂයෙන් සිත පිරිසිදු කරයි. ථිනමිද්ධය (අලසකම හා නින්ද) ප්‍රහාණය කොට, ථිනමිද්ධය පහ වූවෙක්ව, ආලෝක සංඥාව ඇතිව, සිහි නුවණින් යුක්තව වාසය කරයි; ථිනමිද්ධයෙන් සිත පිරිසිදු කරයි. උද්ධච්ච කුක්කුච්චය (සිත වික්ෂිප්ත වීම හා පසුතැවීම) ප්‍රහාණය කොට, නොසන්සුන් නොවී, ඇතුළතින් සංසිඳුණු සිතින් යුක්තව වාසය කරයි; උද්ධච්ච කුක්කුච්චයෙන් සිත පිරිසිදු කරයි. විචිකිච්ඡාව (සැකය) ප්‍රහාණය කොට, කුසල ධර්මයන් පිළිබඳ නොසැක ඇතිව, විචිකිච්ඡාවෙන් එතෙර වූවෙක්ව වාසය කරයි; විචිකිච්ඡාවෙන් සිත පිරිසිදු කරයි. ඔහු මේ පංච නීවරණයන් ප්‍රහාණය කොට, සිතෙහි කෙලෙස් වූ, ප්‍රඥාව දුබල කරන මේ (නීවරණ) ප්‍රහාණය කොට, කාමයන්ගෙන් වෙන්ව... සිව්වන ධ්‍යානයට එළඹ වාසය කරයි.\n\nඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පැහැදිලි වූ, කෙලෙස් රහිත වූ, උපක්ලේශ පහ වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, කම්පනයට පත් නොවන සිත පුබ්බේනිවාසානුස්සති ඥානය පිණිස... සත්වයන්ගේ චුති-උත්පත්ති ඥානය පිණිස... ආශ්‍රවයන්ගේ ක්ෂය ඥානය පිණිස නවනේය. ඔහු ‘මේ දුක’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී; ‘මේ දුකට හේතුව’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී; ‘මේ දුක නැතිකිරීම’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී; ‘මේ දුක නැතිකිරීමට මඟ’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී. ‘මේ ආශ්‍රවයෝ’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී; ‘මේ ආශ්‍රවයන් ඇතිවීමට හේතුව’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී; ‘මේ ආශ්‍රවයන් නැතිකිරීම’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී; ‘මේ ආශ්‍රවයන් නැතිකිරීමට මඟ’ යැයි යථාභූතව ප්‍රඥාවෙන් දනී.\n\nඑසේ දන්නා, එසේ දකින ඔහුට කාමාශ්‍රවයෙන්ද සිත නිදහස් වේ; භවාශ්‍රවයෙන්ද සිත නිදහස් වේ; අවිද්‍යාශ්‍රවයෙන්ද සිත නිදහස් වේ; නිදහස් වූ විට ‘නිදහස් විය’ යි ඥානය ඇතිවේ. ‘උපත ක්ෂය විය, බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කරන ලදී, කළ යුතු දේ කෙරී ඇත, මේ තත්වයෙන් පසු කළ යුතු අන් කිසිවක් නැත’ යැයි ප්‍රඥාවෙන් දනී. මහණෙනි, මෙසේ වූ පුද්ගලයා තමාට දුක් දෙන්නෙක් නොවෙයි, තමාට දුක් දීමේ නිරත වූවෙක්ද නොවෙයි; අනුන්ට දුක් දෙන්නෙක්ද නොවෙයි, අනුන්ට දුක් දීමේ නිරත වූවෙක්ද නොවෙයි. ඔහු තමාට දුක් නොදෙන්නෙක්, අනුන්ට දුක් නොදෙන්නෙක්ව, මේ දැක්කා වූ ධර්මයෙහිම ආශාවන් පහ කර, නිවී, සන්සිඳී, සැප විඳින්නෙක්ව, බ්‍රහ්මභාවයට පත් වූ උතුම් පුද්ගලයෙක් ලෙස වාසය කරයි. මහණෙනි, මේ සිව් පුද්ගලයෝ ලෝකයේ සිටිති, පවතින්නාහ.",
      "paliTitle": "Attantapasuttaṃ",
      "englishTitle": "Discourse on Self-Mortification",
      "sinhalaTitle": "ආත‍්\\u200dමතාපී සූත‍්\\u200dරය"
    },
    {
      "number": 199,
      "pali": "Bhagavā etadavoca – ‘‘taṇhaṃ vo, bhikkhave, desessāmi jāliniṃ saritaṃ visaṭaṃ visattikaṃ, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto [kulāguṇṭhikajāto (sī. syā. kaṃ. pī.) a. ni. aṭṭha. 2.4.199] muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattati. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamā ca sā, bhikkhave, taṇhā jālinī saritā visaṭā visattikā, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattati? Aṭṭhārasa kho panimāni, bhikkhave, taṇhāvicaritāni ajjhattikassa upādāya, aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya. ‘‘Katamāni aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya? Asmīti, bhikkhave, sati itthasmīti hoti, evaṃsmīti [evamasmi (sī.), evasmi (syā. kaṃ. pī.) vibha. 973 passitabbaṃ] hoti, aññathāsmīti hoti, asasmīti hoti, satasmīti hoti, santi hoti, itthaṃ santi hoti, evaṃ santi hoti, aññathā santi hoti, apihaṃ [apiha (sī. pī.), api (syā. kaṃ.)] santi hoti, apihaṃ [api (sī. syā. kaṃ. pī.)] itthaṃ santi hoti, apihaṃ [api (sī. syā. kaṃ. pī.)] evaṃ santi hoti, apihaṃ [api (sī. syā. kaṃ. pī.)] aññathā santi hoti, bhavissanti hoti, itthaṃ bhavissanti hoti, evaṃ bhavissanti hoti, aññathā bhavissanti hoti. Imāni aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya. ‘‘Katamāni aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya? Imināsmīti, bhikkhave, sati iminā itthasmīti hoti, iminā evaṃsmīti hoti, iminā aññathāsmīti hoti, iminā asasmīti hoti, iminā satasmīti hoti, iminā santi hoti, iminā itthaṃ santi hoti, iminā evaṃ santi hoti, iminā aññathā santi hoti, iminā apihaṃ santi hoti, iminā apihaṃ itthaṃ santi hoti, iminā apihaṃ evaṃ santi hoti, iminā apihaṃ aññathā santi hoti, iminā bhavissanti hoti, iminā itthaṃ bhavissanti hoti, iminā evaṃ bhavissanti hoti, iminā aññathā bhavissanti hoti. Imāni aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya. ‘‘Iti aṭṭhārasa taṇhāvicaritāni ajjhattikassa upādāya, aṭṭhārasa taṇhāvicaritāni bāhirassa upādāya. Imāni vuccanti, bhikkhave, chattiṃsa taṇhāvicaritāni. Iti evarūpāni atītāni chattiṃsa taṇhāvicaritāni, anāgatāni chattiṃsa taṇhāvicaritāni, paccuppannāni chattiṃsa taṇhāvicaritāni. Evaṃ aṭṭhasataṃ taṇhāvicaritaṃ honti. ‘‘Ayaṃ kho sā, bhikkhave, taṇhā jālinī saritā visaṭā visattikā, yāya ayaṃ loko uddhasto pariyonaddho tantākulakajāto gulāguṇṭhikajāto muñjapabbajabhūto apāyaṃ duggatiṃ vinipātaṃ saṃsāraṃ nātivattatī’’ti. Navamaṃ.",
      "english": "The Blessed One said this: “Monks, I will teach you about craving—which is a net, a stream, widely spread, and entangling—by which this world is torn apart, wrapped around, become a tangled skein of thread, a tangled ball of string, a thicket of reeds and bamboos, and does not transcend states of woe, unhappy destinies, ruin, or cyclic existence. Listen to it, attend carefully; I will speak.” “Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One said this:\n\n“And what, monks, is that craving—a net, a stream, widely spread, and entangling—by which this world is torn apart, wrapped around, become a tangled skein of thread, a tangled ball of string, a thicket of reeds and bamboos, and does not transcend states of woe, unhappy destinies, ruin, or cyclic existence? There are, monks, eighteen courses of craving relating to oneself, and eighteen courses of craving relating to external things.\n\n“What are the eighteen courses of craving relating to oneself? When, monks, there is the thought ‘I am,’ then there arise the thoughts ‘I am like this,’ ‘I am in such a way,’ ‘I am otherwise,’ ‘I am not,’ ‘I am existing.’ There arise the thoughts ‘I will be,’ ‘I will be like this,’ ‘I will be in such a way,’ ‘I will be otherwise.’ There arise the thoughts ‘Oh that I may be,’ ‘Oh that I may be like this,’ ‘Oh that I may be in such a way,’ ‘Oh that I may be otherwise.’ There arise the thoughts ‘I will become,’ ‘I will become like this,’ ‘I will become in such a way,’ ‘I will become otherwise.’ These are the eighteen courses of craving relating to oneself.\n\n“What are the eighteen courses of craving relating to external things? When, monks, there is the thought ‘I am because of this,’ then there arise the thoughts ‘I am thus because of this,’ ‘I am in such a way because of this,’ ‘I am otherwise because of this,’ ‘I am not because of this,’ ‘I am existing because of this.’ There arise the thoughts ‘I will be because of this,’ ‘I will be like this because of this,’ ‘I will be in such a way because of this,’ ‘I will be otherwise because of this.’ There arise the thoughts ‘Oh that I may be because of this,’ ‘Oh that I may be thus because of this,’ ‘Oh that I may be in such a way because of this,’ ‘Oh that I may be otherwise because of this.’ There arise the thoughts ‘I will become because of this,’ ‘I will become thus because of this,’ ‘I will become in such a way because of this,’ ‘I will become otherwise because of this.’ These are the eighteen courses of craving relating to external things.\n\n“Thus, there are eighteen courses of craving relating to oneself, and eighteen courses of craving relating to external things. These, monks, are called the thirty-six courses of craving. In this way, there are thirty-six such courses of craving in the past, thirty-six in the future, and thirty-six in the present. Thus, there are one hundred and eight courses of craving.\n\n“This, monks, is that craving—a net, a stream, widely spread, and entangling—by which this world is torn apart, wrapped around, become a tangled skein of thread, a tangled ball of string, a thicket of reeds and bamboos, and does not transcend states of woe, unhappy destinies, ruin, or cyclic existence.”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, දැල් බඳු වූ, ගංගාවක් මෙන් ගලායන, (ලොව පුරා) විහිදුනු, ඇලෙන සුළු වැලක් බඳු වූ තෘෂ්ණාව මම ඔබට දේශනා කරන්නෙමි. යම් තෘෂ්ණාවකින් මේ ලෝකය මුලුමනින්ම විනාශ වී, බැඳී, කඩාකුල් වූ නූල් ගුලියක් මෙන් වී, වළලනු ලැබූ ගුලාවක් මෙන් වී, මුං තණ පඳුරක් බඳු වී, අපාය, දුගති, විනිපාත සහ සංසාරය ඉක්මවා යාමට නොහැකි වේ. එය අසව්, මැනවින් මෙනෙහි කරව්; මම දේශනා කරන්නෙමි.” “එසේය, ස්වාමීනී” යි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, කවර නම් ඒ දැල් බඳු වූ, ගංගාවක් මෙන් ගලායන, විහිදුනු, ඇලෙන සුළු වැලක් බඳු වූ තෘෂ්ණාවද, යම් තෘෂ්ණාවකින් මේ ලෝකය මුලුමනින්ම විනාශ වී, බැඳී, කඩාකුල් වූ නූල් ගුලියක් මෙන් වී, වළලනු ලැබූ ගුලාවක් මෙන් වී, මුං තණ පඳුරක් බඳු වී, අපාය, දුගති, විනිපාත සහ සංසාරය ඉක්මවා යාමට නොහැකි වේද? මහණෙනි, අභ්‍යන්තරය අරමුණු කරගෙන ඇති තෘෂ්ණා විචාරයෝ අටළොසක් ද, බාහිරය අරමුණු කරගෙන ඇති තෘෂ්ණා විචාරයෝ අටළොසක් ද වෙත්.\n\nඅභ්‍යන්තරය අරමුණු කරගෙන ඇති අටළොසක් වූ තෘෂ්ණා විචාරයෝ කවරහුද? මහණෙනි, ‘මම වෙමි’ යි, ‘මම මෙසේ වෙමි’ යි, ‘මම මේ අයුරින් වෙමි’ යි, ‘මම වෙනත් අයුරින් වෙමි’ යි, ‘මම නොවෙමි’ යි, ‘මම පවතින්නෙමි’ යි යන අදහස් ඇති වේ. ‘පැවැත්මක් ඇත’ යි, ‘මෙසේ පැවැත්මක් ඇත’ යි, ‘මේ අයුරින් පැවැත්මක් ඇත’ යි, ‘වෙනත් අයුරින් පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට මෙසේ පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට මේ අයුරින් පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට වෙනත් අයුරින් පැවැත්මක් ඇත’ යි යන අදහස් ඇති වේ. ‘පැවැත්මක් ඇති වේ යයි’ යි, ‘මෙසේ පැවැත්මක් ඇති වේ යයි’ යි, ‘මේ අයුරින් පැවැත්මක් ඇති වේ යයි’ යි, ‘වෙනත් අයුරින් පැවැත්මක් ඇති වේ යයි’ යි යන අදහස් ඇති වේ. අභ්‍යන්තරය අරමුණු කරගෙන ඇති මේ අටළොසක් වූ තෘෂ්ණා විචාරයෝ වෙති. බාහිරය අරමුණු කරගෙන ඇති අටළොසක් වූ තෘෂ්ණා විචාරයෝ කවරහුද? මහණෙනි, ‘මම මෙයින් වෙමි’ යි, ‘මම මෙයින් මෙසේ වෙමි’ යි, ‘මම මෙයින් මේ අයුරින් වෙමි’ යි, ‘මම මෙයින් වෙනත් අයුරින් වෙමි’ යි, ‘මම මෙයින් නොවෙමි’ යි, ‘මම මෙයින් පවතින්නෙමි’ යි යන අදහස් ඇති වේ. ‘මෙයින් පැවැත්මක් ඇත’ යි, ‘මෙයින් මෙසේ පැවැත්මක් ඇත’ යි, ‘මෙයින් මේ අයුරින් පැවැත්මක් ඇත’ යි, ‘මෙයින් වෙනත් අයුරින් පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට මෙයින් පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට මෙයින් මෙසේ පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට මෙයින් මේ අයුරින් පැවැත්මක් ඇත’ යි, ‘ඇතැම්විට මෙයින් වෙනත් අයුරින් පැවැත්මක් ඇත’ යි යන අදහස් ඇති වේ. ‘මෙයින් පැවැත්මක් ඇති වේ යයි’ යි, ‘මෙයින් මෙසේ පැවැත්මක් ඇති වේ යයි’ යි, ‘මෙයින් මේ අයුරින් පැවැත්මක් ඇති වේ යයි’ යි, ‘මෙයින් වෙනත් අයුරින් පැවැත්මක් ඇති වේ යයි’ යි යන අදහස් ඇති වේ. බාහිරය අරමුණු කරගෙන ඇති මේ අටළොසක් වූ තෘෂ්ණා විචාරයෝ වෙති.\n\nමේ අයුරින් අභ්‍යන්තරය අරමුණු කරගෙන ඇති තෘෂ්ණා විචාරයෝ අටළොසක් ද, බාහිරය අරමුණු කරගෙන ඇති තෘෂ්ණා විචාරයෝ අටළොසක් ද වෙති. මහණෙනි, මේවා තිස් හයක් වූ තෘෂ්ණා විචාරයෝ යැයි කියනු ලැබේ. මේ අයුරින් අතීතයෙහි එවැනි තිස් හයක් වූ තෘෂ්ණා විචාරයෝ ද, අනාගතයෙහි තිස් හයක් වූ තෘෂ්ණා විචාරයෝ ද, වර්තමානයෙහි තිස් හයක් වූ තෘෂ්ණා විචාරයෝ ද වෙති. මෙසේ තෘෂ්ණා විචාර එකසිය අටක් වේ. “මහණෙනි, දැල් බඳු වූ, ගංගාවක් මෙන් ගලායන, විහිදුනු, ඇලෙන සුළු වැලක් බඳු වූ තෘෂ්ණාව නම් මේය. යම් තෘෂ්ණාවකින් මේ ලෝකය මුලුමනින්ම විනාශ වී, බැඳී, කඩාකුල් වූ නූල් ගුලියක් මෙන් වී, වළලනු ලැබූ ගුලාවක් මෙන් වී, මුං තණ පඳුරක් බඳු වී, අපාය, දුගති, විනිපාත සහ සංසාරය ඉක්මවා යාමට නොහැකි වේ” යි.",
      "paliTitle": "Taṇhāsuttaṃ",
      "englishTitle": "Discourse on Craving",
      "sinhalaTitle": "තණ්හා සූත්‍රය"
    },
    {
      "number": 200,
      "pali": "‘‘Cattārimāni, bhikkhave, (pemāni) [( ) natthi sī. syā. kaṃ. pī. potthakesu] jāyanti. Katamāni cattāri? Pemā pemaṃ jāyati, pemā doso jāyati, dosā pemaṃ jāyati, dosā doso jāyati. ‘‘Kathañca, bhikkhave, pemā pemaṃ jāyati? Idha, bhikkhave, puggalo puggalassa iṭṭho hoti kanto manāpo. Taṃ pare iṭṭhena kantena manāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo iṭṭho kanto manāpo, taṃ pare iṭṭhena kantena manāpena samudācarantī’ti. So tesu pemaṃ janeti. Evaṃ kho, bhikkhave, pemā pemaṃ jāyati. ‘‘Kathañca, bhikkhave, pemā doso jāyati? Idha, bhikkhave, puggalo puggalassa iṭṭho hoti kanto manāpo. Taṃ pare aniṭṭhena akantena amanāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo iṭṭho kanto manāpo, taṃ pare aniṭṭhena akantena amanāpena samudācarantī’ti. So tesu dosaṃ janeti. Evaṃ kho, bhikkhave, pemā doso jāyati. ‘‘Kathañca, bhikkhave, dosā pemaṃ jāyati? Idha, bhikkhave, puggalo puggalassa aniṭṭho hoti akanto amanāpo. Taṃ pare aniṭṭhena akantena amanāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo aniṭṭho akanto amanāpo, taṃ pare aniṭṭhena akantena amanāpena samudācarantī’ti. So tesu pemaṃ janeti. Evaṃ kho, bhikkhave, dosā pemaṃ jāyati. ‘‘Kathañca, bhikkhave, dosā doso jāyati? Idha, bhikkhave, puggalo puggalassa aniṭṭho hoti akanto amanāpo. Taṃ pare iṭṭhena kantena manāpena samudācaranti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo aniṭṭho akanto amanāpo, taṃ pare iṭṭhena kantena manāpena samudācarantī’ti. So tesu dosaṃ janeti. Evaṃ kho, bhikkhave, dosā doso jāyati. Imāni kho, bhikkhave, cattāri pemāni jāyanti. ‘‘Yasmiṃ, bhikkhave, samaye bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa pemā doso jāyati sopissa tasmiṃ samaye na hoti, yampissa dosā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa dosā doso jāyati sopissa tasmiṃ samaye na hoti. ‘‘Yasmiṃ, bhikkhave, samaye bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa pemā doso jāyati sopissa tasmiṃ samaye na hoti, yampissa dosā pemaṃ jāyati tampissa tasmiṃ samaye na hoti, yopissa dosā doso jāyati sopissa tasmiṃ samaye na hoti. ‘‘Yasmiṃ, bhikkhave, samaye bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, yampissa pemā pemaṃ jāyati tampissa pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ, yopissa pemā doso jāyati sopissa pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yampissa dosā pemaṃ jāyati tampissa pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ, yopissa dosā doso jāyati sopissa pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Ayaṃ vuccati, bhikkhave, bhikkhu neva usseneti na paṭiseneti [na paṭisseneti (sī. pī.)] na dhūpāyati na pajjalati na sampajjhāyati [na apajjhāyati (sī.), na pajjhāyati (syā. kaṃ. pī.)]. ‘‘Kathañca, bhikkhave, bhikkhu usseneti? Idha, bhikkhave, bhikkhu rūpaṃ attato samanupassati, rūpavantaṃ vā attānaṃ, attani vā rūpaṃ, rūpasmiṃ vā attānaṃ; vedanaṃ attato samanupassati, vedanāvantaṃ vā attānaṃ, attani vā vedanaṃ, vedanāya vā attānaṃ; saññaṃ attato samanupassati, saññāvantaṃ vā attānaṃ, attani vā saññaṃ, saññāya vā attānaṃ; saṅkhāre attato samanupassati, saṅkhāravantaṃ vā attānaṃ, attani vā saṅkhāre, saṅkhāresu vā attānaṃ; viññāṇaṃ attato samanupassati, viññāṇavantaṃ vā attānaṃ, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Evaṃ kho, bhikkhave, bhikkhu usseneti. ‘‘Kathañca, bhikkhave, bhikkhu na usseneti? Idha, bhikkhave, bhikkhu na rūpaṃ attato samanupassati, na rūpavantaṃ vā attānaṃ, na attani vā rūpaṃ, na rūpasmiṃ vā attānaṃ; na vedanaṃ attato samanupassati, na vedanāvantaṃ vā attānaṃ, na attani vā vedanaṃ, na vedanāya vā attānaṃ; na saññaṃ attato samanupassati, na saññāvantaṃ vā attānaṃ, na attani vā saññaṃ, na saññāya vā attānaṃ; na saṅkhāre attato samanupassati, na saṅkhāravantaṃ vā attānaṃ, na attani vā saṅkhāre, na saṅkhāresu vā attānaṃ; na viññāṇaṃ attato samanupassati, na viññāṇavantaṃ vā attānaṃ, na attani vā viññāṇaṃ, na viññāṇasmiṃ vā attānaṃ. Evaṃ kho, bhikkhave, bhikkhu na usseneti. ‘‘Kathañca, bhikkhave, bhikkhu paṭiseneti? Idha, bhikkhave, bhikkhu akkosantaṃ paccakkosati, rosantaṃ paṭirosati, bhaṇḍantaṃ paṭibhaṇḍati. Evaṃ kho, bhikkhave, bhikkhu paṭiseneti. ‘‘Kathañca, bhikkhave, bhikkhu na paṭiseneti? Idha, bhikkhave, bhikkhu akkosantaṃ na paccakkosati, rosantaṃ na paṭirosati, bhaṇḍantaṃ na paṭibhaṇḍati. Evaṃ kho, bhikkhave, bhikkhu na paṭiseneti. ‘‘Kathañca, bhikkhave, bhikkhu dhūpāyati? Asmīti, bhikkhave, sati itthasmīti hoti, evaṃsmīti hoti, aññathāsmīti hoti, asasmīti hoti, satasmīti hoti, santi hoti, itthaṃ santi hoti, evaṃ santi hoti, aññathā santi hoti, apihaṃ santi hoti, apihaṃ itthaṃ santi hoti, apihaṃ evaṃ santi hoti, apihaṃ aññathā santi hoti, bhavissanti hoti, itthaṃ bhavissanti hoti, evaṃ bhavissanti hoti, aññathā bhavissanti hoti. Evaṃ kho, bhikkhave, bhikkhu dhūpāyati. ‘‘Kathañca, bhikkhave, bhikkhu na dhūpāyati? Asmīti, bhikkhave, asati itthasmīti na hoti, evaṃsmīti na hoti, aññathāsmīti na hoti, asasmīti na hoti, satasmīti na hoti, santi na hoti, itthaṃ santi na hoti, evaṃ santi na hoti, aññathā santi na hoti, apihaṃ santi na hoti, apihaṃ itthaṃ santi na hoti, apihaṃ evaṃ santi na hoti, apihaṃ aññathā santi na hoti, bhavissanti na hoti, itthaṃ bhavissanti na hoti, evaṃ bhavissanti na hoti, aññathā bhavissanti na hoti. Evaṃ kho, bhikkhave, bhikkhu na dhūpāyati. ‘‘Kathañca, bhikkhave, bhikkhu pajjalati? Iminā asmīti, bhikkhave, sati iminā itthasmīti hoti, iminā evaṃsmīti hoti, iminā aññathāsmīti hoti, iminā asasmīti hoti, iminā satasmīti hoti, iminā santi hoti, iminā itthaṃ santi hoti, iminā evaṃ santi hoti, iminā aññathā santi hoti, iminā apihaṃ santi hoti, iminā apihaṃ itthaṃ santi hoti, iminā apihaṃ evaṃ santi hoti, iminā apihaṃ aññathā santi hoti, iminā bhavissanti hoti, iminā itthaṃ bhavissanti hoti, iminā evaṃ bhavissanti hoti, iminā aññathā bhavissanti hoti. Evaṃ kho, bhikkhave, bhikkhu pajjalati. ‘‘Kathañca, bhikkhave, bhikkhu na pajjalati? Iminā asmīti, bhikkhave, asati iminā itthasmīti na hoti, iminā evaṃsmīti na hoti, iminā aññathāsmīti na hoti, iminā asasmīti na hoti, iminā satasmīti na hoti, iminā santi na hoti, iminā itthaṃ santi na hoti, iminā evaṃ santi na hoti, iminā aññathā santi na hoti, iminā apihaṃ santi na hoti, iminā apihaṃ itthaṃ santi na hoti, iminā apihaṃ evaṃ santi na hoti, iminā apihaṃ aññathā santi na hoti, iminā bhavissanti na hoti, iminā itthaṃ bhavissanti na hoti, iminā evaṃ bhavissanti na hoti, iminā aññathā bhavissanti na hoti. Evaṃ kho, bhikkhave, bhikkhu na pajjalati. ‘‘Kathañca, bhikkhave, bhikkhu sampajjhāyati? Idha, bhikkhave, bhikkhuno asmimāno pahīno na hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu sampajjhāyati. ‘‘Kathañca, bhikkhave, bhikkhu na sampajjhāyati? Idha, bhikkhave, bhikkhuno asmimāno pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu na sampajjhāyatī’’ti. Dasamaṃ. ",
      "english": "These four patterns of response, bhikkhus, arise. Which four? From affection, affection arises; from affection, aversion arises; from aversion, affection arises; from aversion, aversion arises.\n\nAnd how, bhikkhus, does affection arise from affection? Here, bhikkhus, a certain person is agreeable, pleasing, and charming to another person. Others treat that person agreeably, pleasingly, and charmingly. Then it occurs to him: ‘That person who is agreeable, pleasing, and charming to me, others also treat him agreeably, pleasingly, and charmingly.’ He generates affection towards them. In this way, bhikkhus, affection arises from affection.\n\nAnd how, bhikkhus, does aversion arise from affection? Here, bhikkhus, a certain person is agreeable, pleasing, and charming to another person. Others treat that person disagreeably, unpleasantly, and uncharmingly. Then it occurs to him: ‘That person who is agreeable, pleasing, and charming to me, others treat him disagreeably, unpleasantly, and uncharmingly.’ He generates aversion towards them. In this way, bhikkhus, aversion arises from affection.\n\nAnd how, bhikkhus, does affection arise from aversion? Here, bhikkhus, a certain person is disagreeable, unpleasing, and uncharming to another person. Others treat that person disagreeably, unpleasantly, and uncharmingly. Then it occurs to him: ‘That person who is disagreeable, unpleasing, and uncharming to me, others also treat him disagreeably, unpleasantly, and uncharmingly.’ He generates affection towards them. In this way, bhikkhus, affection arises from aversion.\n\nAnd how, bhikkhus, does aversion arise from aversion? Here, bhikkhus, a certain person is disagreeable, unpleasing, and uncharming to another person. Others treat that person agreeably, pleasingly, and charmingly. Then it occurs to him: ‘That person who is disagreeable, unpleasing, and uncharming to me, others treat him agreeably, pleasingly, and charmingly.’ He generates aversion towards them. In this way, bhikkhus, aversion arises from aversion. These, bhikkhus, are the four patterns of response that arise.\n\nBhikkhus, at such a time as a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters and remains in the first absorption (jhāna), accompanied by initial application and sustained application, born of seclusion, filled with rapture and happiness, at that time, that affection arising from affection does not exist for him; at that time, that aversion arising from affection does not exist for him; at that time, that affection arising from aversion does not exist for him; at that time, that aversion arising from aversion does not exist for him.\n\nBhikkhus, at such a time as a bhikkhu, with the fading away of initial and sustained application, enters and remains in the second absorption (jhāna), with internal assurance and unification of mind, free from initial and sustained application, born of concentration, filled with rapture and happiness; or, with the fading away of rapture, he remains equanimous, mindful, and clearly comprehending, and experiences happiness with the body, and enters and remains in the third absorption (jhāna) of which the noble ones declare, ‘He is equanimous and mindful, he dwells happily’; or, with the abandonment of pleasure and pain, and with the previous disappearance of joy and grief, he enters and remains in the fourth absorption (jhāna), which is neither painful nor pleasant, and is purified by equanimity and mindfulness, at that time, that affection arising from affection does not exist for him; at that time, that aversion arising from affection does not exist for him; at that time, that affection arising from aversion does not exist for him; at that time, that aversion arising from aversion does not exist for him.\n\nBhikkhus, at such a time as a bhikkhu, by the destruction of the influxes (āsavas), enters and remains in the Stainless Liberation of Mind and Liberation by Wisdom, having realized it for himself with direct knowledge in this very life, at that time, that affection arising from affection has been abandoned by him, cut off at the root, made like a palm-stump, brought to non-existence, and is no longer subject to future arising; that aversion arising from affection has been abandoned by him, cut off at the root, made like a palm-stump, brought to non-existence, and is no longer subject to future arising; that affection arising from aversion has been abandoned by him, cut off at the root, made like a palm-stump, brought to non-existence, and is no longer subject to future arising; that aversion arising from aversion has been abandoned by him, cut off at the root, made like a palm-stump, brought to non-existence, and is no longer subject to future arising. This bhikkhu, bhikkhus, is said neither to inflate nor to retaliate, neither to smolder nor to blaze, nor to burn out.\n\nAnd how, bhikkhus, does a bhikkhu inflate himself? Here, bhikkhus, a bhikkhu regards form as self, or self as possessing form, or form as in self, or self as in form; he regards feeling as self, or self as possessing feeling, or feeling as in self, or self as in feeling; he regards perception as self, or self as possessing perception, or perception as in self, or self as in perception; he regards mental formations as self, or self as possessing mental formations, or mental formations as in self, or self as in mental formations; he regards consciousness as self, or self as possessing consciousness, or consciousness as in self, or self as in consciousness. In this way, bhikkhus, a bhikkhu inflates himself.\n\nAnd how, bhikkhus, does a bhikkhu not inflate himself?\n\nHere, monks, a monk does not regard form as self, nor the self as possessing form, nor form as being in the self, nor the self as being in form. He does not regard feeling as self, nor the self as possessing feeling, nor feeling as being in the self, nor the self as being in feeling. He does not regard perception as self, nor the self as possessing perception, nor perception as being in the self, nor the self as being in perception. He does not regard mental formations as self, nor the self as possessing mental formations, nor mental formations as being in the self, nor the self as being in mental formations. He does not regard consciousness as self, nor the self as possessing consciousness, nor consciousness as being in the self, nor the self as being in consciousness. It is in this way, monks, that a monk does not elevate himself.\n\nAnd how, monks, does a monk retaliate? Here, monks, if someone abuses him, a monk abuses him in return; if someone is angry with him, he is angry in return; if someone quarrels with him, he quarrels in return. It is in this way, monks, that a monk retaliates.\n\nAnd how, monks, does a monk not retaliate? Here, monks, if someone abuses him, a monk does not abuse him in return; if someone is angry with him, he is not angry in return; if someone quarrels with him, he does not quarrel in return. It is in this way, monks, that a monk does not retaliate.\n\nAnd how, monks, does a monk give off smoke? When, monks, there is the notion 'I am', there comes to be 'I am thus', there comes to be 'I am in this way', there comes to be 'I am otherwise', there comes to be 'I am not', there comes to be 'I am indeed', there comes to be 'I shall be', there comes to be 'I shall be thus', there comes to be 'I shall be in this way', there comes to be 'I shall be otherwise', there comes to be 'May I be', there comes to be 'May I be thus', there comes to be 'May I be in this way', there comes to be 'May I be otherwise', there comes to be 'I shall become', there comes to be 'I shall become thus', there comes to be 'I shall become in this way', there comes to be 'I shall become otherwise'. It is in this way, monks, that a monk gives off smoke.\n\nAnd how, monks, does a monk not give off smoke? When, monks, there is no notion 'I am', there does not come to be 'I am thus', there does not come to be 'I am in this way', there does not come to be 'I am otherwise', there does not come to be 'I am not', there does not come to be 'I am indeed', there does not come to be 'I shall be', there does not come to be 'I shall be thus', there does not come to be 'I shall be in this way', there does not come to be 'I shall be otherwise', there does not come to be 'May I be', there does not come to be 'May I be thus', there does not come to be 'May I be in this way', there does not come to be 'May I be otherwise', there does not come to be 'I shall become', there does not come to be 'I shall become thus', there does not come to be 'I shall become in this way', there does not come to be 'I shall become otherwise'. It is in this way, monks, that a monk does not give off smoke.\n\nAnd how, monks, does a monk blaze? When, monks, there is the notion 'I am because of this', there comes to be 'I am thus because of this', there comes to be 'I am in this way because of this', there comes to be 'I am otherwise because of this', there comes to be 'I am not because of this', there comes to be 'I am indeed because of this', there comes to be 'I shall be because of this', there comes to be 'I shall be thus because of this', there comes to be 'I shall be in this way because of this', there comes to be 'I shall be otherwise because of this', there comes to be 'May I be because of this', there comes to be 'May I be thus because of this', there comes to be 'May I be in this way because of this', there comes to be 'May I be otherwise because of this', there comes to be 'I shall become because of this', there comes to be 'I shall become thus because of this', there comes to be 'I shall become in this way because of this', there comes to be 'I shall become otherwise because of this'. It is in this way, monks, that a monk blazes.\n\nAnd how, monks, does a monk not blaze? When, monks, there is no notion 'I am because of this', there does not come to be 'I am thus because of this', there does not come to be 'I am in this way because of this', there does not come to be 'I am otherwise because of this', there does not come to be 'I am not because of this', there does not come to be 'I am indeed because of this', there does not come to be 'I shall be because of this', there does not come to be 'I shall be thus because of this', there does not come to be 'I shall be in this way because of this', there does not come to be 'I shall be otherwise because of this', there does not come to be 'May I be because of this', there does not come to be 'May I be thus because of this', there does not come to be 'May I be in this way because of this', there does not come to be 'May I be otherwise because of this', there does not come to be 'I shall become because of this', there does not come to be 'I shall become thus because of this', there does not come to be 'I shall become in this way because of this', there does not come to be 'I shall become otherwise because of this'. It is in this way, monks, that a monk does not blaze.\n\nAnd how, monks, does a monk smolder? Here, monks, a monk's 'I am' conceit is not abandoned, not uprooted, not made like a palm-stump, not brought to non-existence, not liable to arise again in the future. It is in this way, monks, that a monk smolders.\n\nAnd how, monks, does a monk not smolder? Here, monks, a monk's 'I am' conceit is abandoned, uprooted, made like a palm-stump, brought to non-existence, not liable to arise again in the future. It is in this way, monks, that a monk does not smolder.",
      "sinhala": "භික්ෂූනි, මේ සතරක් වූ ප්‍රේමයන් හටගනී. කවර සතරක්ද? ප්‍රේමයෙන් ප්‍රේමය හටගනී, ප්‍රේමයෙන් ද්වේෂය හටගනී, ද්වේෂයෙන් ප්‍රේමය හටගනී, ද්වේෂයෙන් ද්වේෂය හටගනී.\n\nභික්ෂූනි, ප්‍රේමයෙන් ප්‍රේමය හටගන්නේ කෙසේද? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකුට ප්‍රිය, මනාප, කාන්ත වේ. අන්‍යයෝද ඔහුට ප්‍රිය වූ, මනාප වූ, කාන්ත ආකාරයෙන් කටයුතු කරති. එවිට ඔහුට මෙසේ සිතේ: ‘මට ප්‍රිය වූ, මනාප වූ, කාන්ත වූ මේ පුද්ගලයාට අන්‍යයෝද ප්‍රිය වූ, මනාප වූ, කාන්ත ආකාරයෙන් කටයුතු කරති’ කියා. ඔහු ඔවුන් කෙරෙහි ප්‍රේමය ඇතිකරගනී. භික්ෂූනි, මෙසේ ප්‍රේමයෙන් ප්‍රේමය හටගනී.\n\nභික්ෂූනි, ප්‍රේමයෙන් ද්වේෂය හටගන්නේ කෙසේද? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකුට ප්‍රිය, මනාප, කාන්ත වේ. අන්‍යයෝද ඔහුට අප්‍රිය වූ, අමනාප වූ, අකාන්ත ආකාරයෙන් කටයුතු කරති. එවිට ඔහුට මෙසේ සිතේ: ‘මට ප්‍රිය වූ, මනාප වූ, කාන්ත වූ මේ පුද්ගලයාට අන්‍යයෝද අප්‍රිය වූ, අමනාප වූ, අකාන්ත ආකාරයෙන් කටයුතු කරති’ කියා. ඔහු ඔවුන් කෙරෙහි ද්වේෂය ඇතිකරගනී. භික්ෂූනි, මෙසේ ප්‍රේමයෙන් ද්වේෂය හටගනී.\n\nභික්ෂූනි, ද්වේෂයෙන් ප්‍රේමය හටගන්නේ කෙසේද? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකුට අප්‍රිය, අමනාප, අකාන්ත වේ. අන්‍යයෝද ඔහුට අප්‍රිය වූ, අමනාප වූ, අකාන්ත ආකාරයෙන් කටයුතු කරති. එවිට ඔහුට මෙසේ සිතේ: ‘මට අප්‍රිය වූ, අමනාප වූ, අකාන්ත වූ මේ පුද්ගලයාට අන්‍යයෝද අප්‍රිය වූ, අමනාප වූ, අකාන්ත ආකාරයෙන් කටයුතු කරති’ කියා. ඔහු ඔවුන් කෙරෙහි ප්‍රේමය ඇතිකරගනී. භික්ෂූනි, මෙසේ ද්වේෂයෙන් ප්‍රේමය හටගනී.\n\nභික්ෂූනි, ද්වේෂයෙන් ද්වේෂය හටගන්නේ කෙසේද? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් තවත් පුද්ගලයෙකුට අප්‍රිය, අමනාප, අකාන්ත වේ. අන්‍යයෝද ඔහුට ප්‍රිය වූ, මනාප වූ, කාන්ත ආකාරයෙන් කටයුතු කරති. එවිට ඔහුට මෙසේ සිතේ: ‘මට අප්‍රිය වූ, අමනාප වූ, අකාන්ත වූ මේ පුද්ගලයාට අන්‍යයෝද ප්‍රිය වූ, මනාප වූ, කාන්ත ආකාරයෙන් කටයුතු කරති’ කියා. ඔහු ඔවුන් කෙරෙහි ද්වේෂය ඇතිකරගනී. භික්ෂූනි, මෙසේ ද්වේෂයෙන් ද්වේෂය හටගනී. භික්ෂූනි, මේ සතරක් වූ ප්‍රේමයන් හටගනී.\n\nභික්ෂූනි, යම් සමයක භික්ෂුවක් සම්පූර්ණයෙන්ම කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයිද, එම සමයෙහි ඔහුට ප්‍රේමයෙන් හටගන්නා ප්‍රේමයද නැත, ප්‍රේමයෙන් හටගන්නා ද්වේෂයද නැත, ද්වේෂයෙන් හටගන්නා ප්‍රේමයද නැත, ද්වේෂයෙන් හටගන්නා ද්වේෂයද නැත.\n\nභික්ෂූනි, යම් සමයක භික්ෂුවක් විතර්ක විචාරයන් සංසිඳවීමෙන්, තමා තුළ පැහැදීම ඇතිකරගැනීමෙන්, සිත එකඟ වීමෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති දෙවෙනි ධ්‍යානයටද, ප්‍රීතියද වියැකී යාමෙන්, උපේක්ෂාවෙන් යුක්තව වාසය කරමින්, සිහියෙන් හා මනා දැනුමෙන් යුක්තව, ශරීරයෙන්ද සැපය අත්විඳිමින්, ආර්යයන් ‘උපේක්ෂාවෙන් යුක්ත වූ, සිහි ඇතිව වාසය කරන්නා’ යැයි වර්ණනා කරන තුන්වෙනි ධ්‍යානයටද, සැපයද අත්හැරීමෙන්, දුකද අත්හැරීමෙන්, පෙර සිටි සෝමනස්ස දෝමනස්සයන්ද අතුරුදන් වීමෙන්, දුක් රහිත වූ, සැප රහිත වූ, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ හතරවෙනි ධ්‍යානයටද පැමිණ වාසය කරයිද, එම සමයෙහි ඔහුට ප්‍රේමයෙන් හටගන්නා ප්‍රේමයද නැත, ප්‍රේමයෙන් හටගන්නා ද්වේෂයද නැත, ද්වේෂයෙන් හටගන්නා ප්‍රේමයද නැත, ද්වේෂයෙන් හටගන්නා ද්වේෂයද නැත.\n\nභික්ෂූනි, යම් සමයක භික්ෂුවක් ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමන් විසින්ම අභිඥාවෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරයිද, එවිට ඔහුට ප්‍රේමයෙන් හටගන්නා ප්‍රේමය ප්‍රහීණ කර ඇත, මුල් සිඳ දමා ඇත, තල්ගසක් කපා මුදුන සිඳ දැමුවා සේ වී ඇත, නැතිකර දමා ඇත, අනාගතයේ ඇති නොවන ස්වභාවයට පත් කර ඇත. ප්‍රේමයෙන් හටගන්නා ද්වේෂයද ප්‍රහීණ කර ඇත, මුල් සිඳ දමා ඇත, තල්ගසක් කපා මුදුන සිඳ දැමුවා සේ වී ඇත, නැතිකර දමා ඇත, අනාගතයේ ඇති නොවන ස්වභාවයට පත් කර ඇත. ද්වේෂයෙන් හටගන්නා ප්‍රේමයද ප්‍රහීණ කර ඇත, මුල් සිඳ දමා ඇත, තල්ගසක් කපා මුදුන සිඳ දැමුවා සේ වී ඇත, නැතිකර දමා ඇත, අනාගතයේ ඇති නොවන ස්වභාවයට පත් කර ඇත. ද්වේෂයෙන් හටගන්නා ද්වේෂයද ප්‍රහීණ කර ඇත, මුල් සිඳ දමා ඇත, තල්ගසක් කපා මුදුන සිඳ දැමුවා සේ වී ඇත, නැතිකර දමා ඇත, අනාගතයේ ඇති නොවන ස්වභාවයට පත් කර ඇත. භික්ෂූනි, මේ භික්ෂුව උසස් කොටද නොසලකයි, පහත් කොටද නොසලකයි, දුම් දමන්නේද නැත, දැවෙන්නේද නැත, ඇවිලෙන්නේද නැතැයි කියනු ලැබේ.\n\nභික්ෂූනි, භික්ෂුවක් උසස් කොට සලකන්නේ කෙසේද? භික්ෂූනි, මෙහිලා භික්ෂුවක් රූපය ආත්මය ලෙස සලකයි, නැතහොත් තමන් රූපය සහිත යැයි සලකයි, නැතහොත් තමන් තුළ රූපය ඇතැයි සලකයි, නැතහොත් රූපය තුළ තමන් ඇතැයි සලකයි; වේදනාව ආත්මය ලෙස සලකයි, නැතහොත් තමන් වේදනාව සහිත යැයි සලකයි, නැතහොත් තමන් තුළ වේදනාව ඇතැයි සලකයි, නැතහොත් වේදනාව තුළ තමන් ඇතැයි සලකයි; සංඥාව ආත්මය ලෙස සලකයි, නැතහොත් තමන් සංඥාව සහිත යැයි සලකයි, නැතහොත් තමන් තුළ සංඥාව ඇතැයි සලකයි, නැතහොත් සංඥාව තුළ තමන් ඇතැයි සලකයි; සංස්කාරයන් ආත්මය ලෙස සලකයි, නැතහොත් තමන් සංස්කාරයන් සහිත යැයි සලකයි, නැතහොත් තමන් තුළ සංස්කාරයන් ඇතැයි සලකයි, නැතහොත් සංස්කාරයන් තුළ තමන් ඇතැයි සලකයි; විඤ්ඤාණය ආත්මය ලෙස සලකයි, නැතහොත් තමන් විඤ්ඤාණය සහිත යැයි සලකයි, නැතහොත් තමන් තුළ විඤ්ඤාණය ඇතැයි සලකයි, නැතහොත් විඤ්ඤාණය තුළ තමන් ඇතැයි සලකයි. භික්ෂූනි, මෙසේ භික්ෂුවක් උසස් කොට සලකයි.\n\nභික්ෂූනි, භික්ෂුවක් උසස් කොට නොසලකන්නේ කෙසේද?\n\nමහණෙනි, මෙහිලා භික්ෂුව රූපය තමායැයි නොදකියි. තමා රූප ඇත්තේයැයි ද නොදකියි. තමා තුළ රූපය ඇතැයි ද නොදකියි. රූපය තුළ තමා ඇතැයි ද නොදකියි. වේදනාව තමායැයි නොදකියි. තමා වේදනා ඇත්තේයැයි ද නොදකියි. තමා තුළ වේදනාව ඇතැයි ද නොදකියි. වේදනාව තුළ තමා ඇතැයි ද නොදකියි. සංඥාව තමායැයි නොදකියි. තමා සංඥා ඇත්තේයැයි ද නොදකියි. තමා තුළ සංඥාව ඇතැයි ද නොදකියි. සංඥාව තුළ තමා ඇතැයි ද නොදකියි. සංස්කාර තමායැයි නොදකියි. තමා සංස්කාර ඇත්තේයැයි ද නොදකියි. තමා තුළ සංස්කාර ඇතැයි ද නොදකියි. සංස්කාර තුළ තමා ඇතැයි ද නොදකියි. විඤ්ඤාණය තමායැයි නොදකියි. තමා විඤ්ඤාණ ඇත්තේයැයි ද නොදකියි. තමා තුළ විඤ්ඤාණය ඇතැයි ද නොදකියි. විඤ්ඤාණය තුළ තමා ඇතැයි ද නොදකියි. මහණෙනි, මෙසේ භික්ෂුව (තමා පිළිබඳ උඩඟු හැඟීම්වලින්) උඩඟු නොවෙයි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (ප්‍රතිරෝධී ලෙස) ප්‍රතික්‍රියා කරයිද? මහණෙනි, මෙහිලා භික්ෂුව තර්ජනය කරන්නාට නැවත තර්ජනය කරයි. කිපෙන්නාට නැවත කිපෙයි. බණින්නාට නැවත බණියි. මහණෙනි, මෙසේ භික්ෂුව ප්‍රතික්‍රියා කරයි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (ප්‍රතිරෝධී ලෙස) ප්‍රතික්‍රියා නොකරයිද? මහණෙනි, මෙහිලා භික්ෂුව තර්ජනය කරන්නාට නැවත තර්ජනය නොකරයි. කිපෙන්නාට නැවත කිපෙන්නේ නැත. බණින්නාට නැවත බණින්නේ නැත. මහණෙනි, මෙසේ භික්ෂුව ප්‍රතික්‍රියා නොකරයි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (මානසික වශයෙන්) දුම් දමයිද? මහණෙනි, ‘මම වෙමි’ යන හැඟීම ඇති කල්හි, ‘මම මේ ආකාර වෙමි’ යනුවෙන් ඇතිවෙයි, ‘මම මෙසේ වෙමි’ යනුවෙන් ඇතිවෙයි, ‘මම අන් ආකාර වෙමි’ යනුවෙන් ඇතිවෙයි, ‘මම නොපවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘මම පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි. ‘අපි වෙමු’ යනුවෙන් ඇතිවෙයි, ‘අපි මේ ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි, ‘අපි මෙසේ වෙමු’ යනුවෙන් ඇතිවෙයි, ‘අපි අන් ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි, ‘අපි ද වෙමු’ යනුවෙන් ඇතිවෙයි, ‘අපි ද මේ ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි, ‘අපි ද මෙසේ වෙමු’ යනුවෙන් ඇතිවෙයි, ‘අපි ද අන් ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි. ‘අනාගතයේ පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘අනාගතයේ මේ ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘අනාගතයේ මෙසේ පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘අනාගතයේ අන් ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි. මහණෙනි, මෙසේ භික්ෂුව දුම් දමයි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (මානසික වශයෙන්) දුම් නොදමයිද? මහණෙනි, ‘මම වෙමි’ යන හැඟීම නැති කල්හි, ‘මම මේ ආකාර වෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මම මෙසේ වෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මම අන් ආකාර වෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මම නොපවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මම පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි. ‘අපි වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘අපි මේ ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘අපි මෙසේ වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘අපි අන් ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘අපි ද වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘අපි ද මේ ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘අපි ද මෙසේ වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘අපි ද අන් ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි. ‘අනාගතයේ පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘අනාගතයේ මේ ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘අනාගතයේ මෙසේ පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘අනාගතයේ අන් ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි. මහණෙනි, මෙසේ භික්ෂුව දුම් නොදමයි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (ක්ලේශයන්ගෙන්) දැවෙයිද? මහණෙනි, ‘මේ හේතුවෙන් මම වෙමි’ යන හැඟීම ඇති කල්හි, ‘මේ හේතුවෙන් මම මේ ආකාර වෙමි’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් මම මෙසේ වෙමි’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් මම අන් ආකාර වෙමි’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් මම නොපවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් මම පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි. ‘මේ හේතුවෙන් අපි වෙමු’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අපි මේ ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අපි මෙසේ වෙමු’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අපි අන් ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අපි ද වෙමු’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අපි ද මේ ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අපි ද මෙසේ වෙමු’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අපි ද අන් ආකාර වෙමු’ යනුවෙන් ඇතිවෙයි. ‘මේ හේතුවෙන් අනාගතයේ පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අනාගතයේ මේ ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අනාගතයේ මෙසේ පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි, ‘මේ හේතුවෙන් අනාගතයේ අන් ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇතිවෙයි. මහණෙනි, මෙසේ භික්ෂුව දැවෙයි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (ක්ලේශයන්ගෙන්) නොදැවෙයිද? මහණෙනි, ‘මේ හේතුවෙන් මම වෙමි’ යන හැඟීම නැති කල්හි, ‘මේ හේතුවෙන් මම මේ ආකාර වෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් මම මෙසේ වෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් මම අන් ආකාර වෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් මම නොපවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් මම පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි. ‘මේ හේතුවෙන් අපි වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අපි මේ ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අපි මෙසේ වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අපි අන් ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අපි ද වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අපි ද මේ ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අපි ද මෙසේ වෙමු’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අපි ද අන් ආකාර වෙමු’ යනුවෙන් ඇති නොවෙයි. ‘මේ හේතුවෙන් අනාගතයේ පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අනාගතයේ මේ ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අනාගතයේ මෙසේ පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි, ‘මේ හේතුවෙන් අනාගතයේ අන් ආකාරයෙන් පවතින්නෙමි’ යනුවෙන් ඇති නොවෙයි. මහණෙනි, මෙසේ භික්ෂුව නොදැවෙයි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (අඳුරේ) ගිනි ගනියිද? මහණෙනි, මෙහිලා භික්ෂුවට ‘මම වෙමි’ යන මානය ප්‍රහීණ වී නොමැත. එය මුල් සිඳ දමන ලද්දක් නොවේ. තල් ගසක කඳක් මෙන් (නැවත) නූපදින තත්ත්වයට පත් කරන ලද්දක් නොවේ. නැති කරන ලද්දක් නොවේ. අනාගතයේ (නැවත) නොපැමිණීමේ ස්වභාවයෙන් යුක්ත වූවක් බවට පත් වී නොමැත. මහණෙනි, මෙසේ භික්ෂුව ගිනි ගනියි.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් (අඳුරේ) ගිනි නොගනියිද? මහණෙනි, මෙහිලා භික්ෂුවට ‘මම වෙමි’ යන මානය ප්‍රහීණ වී ඇත. එය මුල් සිඳ දමන ලද්දකි. තල් ගසක කඳක් මෙන් (නැවත) නූපදින තත්ත්වයට පත් කරන ලද්දකි. නැති කරන ලද්දකි. අනාගතයේ (නැවත) නොපැමිණීමේ ස්වභාවයෙන් යුක්ත වූවකි. මහණෙනි, මෙසේ භික්ෂුව ගිනි නොගනියි.",
      "paliTitle": "Pemasuttaṃ",
      "englishTitle": "The Discourse on Love",
      "sinhalaTitle": "ප්‍ර‍‌ේම සූත්‍රය"
    },
    {
      "number": 5,
      "pali": "Pañcamapaṇṇāsakaṃ",
      "english": "The Fifth Fifty",
      "sinhala": "පස්වැනි පණ්ණාසකය",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahāvaggo pañcamo. Tassuddānaṃ – Sotānugataṃ ṭhānaṃ, bhaddiya sāmugiya vappa sāḷhā ca; Mallika attantāpo, taṇhā pemena ca dasā teti. Catutthamahāpaṇṇāsakaṃ samattaṃ.",
    "english": "The Fifth Great Section",
    "sinhala": "චතුත්‍ථ මහා පණ්‍ණාසකය සමාප්‍තයි."
  }
}