{
  "id": "an4.18",
  "title": {
    "pali": "Sañcetaniyavaggo",
    "english": "The Chapter on Volitional Actions",
    "sinhala": "චේතනා වග්ගය"
  },
  "sections": [
    {
      "number": 171,
      "pali": "[kathā. 539] ‘‘Kāye vā, bhikkhave, sati kāyasañcetanāhetu uppajjati ajjhattaṃ sukhadukkhaṃ. Vācāya vā, bhikkhave, sati vacīsañcetanāhetu uppajjati ajjhattaṃ sukhadukkhaṃ. Mane vā, bhikkhave, sati manosañcetanāhetu uppajjati ajjhattaṃ sukhadukkhaṃ avijjāpaccayāva. ‘‘Sāmaṃ vā taṃ, bhikkhave, kāyasaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ. Pare vāssa [pare vā tassa (ka.)] taṃ, bhikkhave, kāyasaṅkhāraṃ abhisaṅkharonti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ. Sampajāno vā taṃ, bhikkhave, kāyasaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ. Asampajāno vā taṃ, bhikkhave, kāyasaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ. ‘‘Sāmaṃ vā taṃ, bhikkhave, vacīsaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ; pare vāssa taṃ, bhikkhave, vacīsaṅkhāraṃ abhisaṅkharonti; yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ; sampajāno vā taṃ, bhikkhave, vacīsaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ; asampajāno vā taṃ, bhikkhave, vacīsaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ. ‘‘Sāmaṃ vā taṃ, bhikkhave, manosaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ; pare vāssa taṃ, bhikkhave, manosaṅkhāraṃ abhisaṅkharonti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ; sampajāno vā taṃ, bhikkhave, manosaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ; asampajāno vā taṃ, bhikkhave, manosaṅkhāraṃ abhisaṅkharoti, yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ. ‘‘Imesu, bhikkhave, dhammesu avijjā anupatitā, avijjāyatveva asesavirāganirodhā so kāyo na hoti yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ, sā vācā na hoti yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ, so mano na hoti yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkhaṃ, khettaṃ taṃ [vatthuṃ taṃ (sabbattha)] na hoti…pe… vatthuṃ taṃ na hoti…pe… āyatanaṃ taṃ na hoti…pe… adhikaraṇaṃ taṃ na hoti yaṃpaccayāssa taṃ uppajjati ajjhattaṃ sukhadukkha’’nti. ‘‘Cattārome, bhikkhave, attabhāvapaṭilābhā. Katame cattāro? Atthi, bhikkhave, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe attasañcetanā kamati, no parasañcetanā. Atthi, bhikkhave, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe parasañcetanā kamati, no attasañcetanā. Atthi, bhikkhave, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe attasañcetanā ca kamati parasañcetanā ca. Atthi, bhikkhave, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe nevattasañcetanā kamati, no parasañcetanā. Ime kho, bhikkhave, cattāro attabhāvapaṭilābhā’’ti. Evaṃ vutte āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘imassa kho ahaṃ, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmi – ‘tatra, bhante, yāyaṃ attabhāvapaṭilābho yasmiṃ attabhāvapaṭilābhe attasañcetanā kamati no parasañcetanā, attasañcetanāhetu tesaṃ sattānaṃ tamhā kāyā cuti hoti. Tatra, bhante, yāyaṃ attabhāvapaṭilābho yasmiṃ attabhāvapaṭilābhe parasañcetanā kamati no attasañcetanā, parasañcetanāhetu tesaṃ sattānaṃ tamhā kāyā cuti hoti. Tatra, bhante, yāyaṃ attabhāvapaṭilābho yasmiṃ attabhāvapaṭilābhe attasañcetanā ca kamati parasañcetanā ca, attasañcetanā ca parasañcetanā ca hetu tesaṃ sattānaṃ tamhā kāyā cuti hoti. Tatra, bhante, yāyaṃ attabhāvapaṭilābho yasmiṃ attabhāvapaṭilābhe neva attasañcetanā kamati no parasañcetanā, katame tena devā daṭṭhabbā’’’ti? ‘‘Nevasaññānāsaññāyatanūpagā, sāriputta, devā tena daṭṭhabbā’’ti. ‘‘Ko nu kho, bhante, hetu ko paccayo, yena midhekacce sattā tamhā kāyā cutā āgāmino honti āgantāro itthattaṃ? Ko pana, bhante, hetu ko paccayo, yena midhekacce sattā tamhā kāyā cutā anāgāmino honti anāgantāro itthatta’’nti? ‘‘Idha, sāriputta, ekaccassa puggalassa orambhāgiyāni saṃyojanāni appahīnāni honti, so diṭṭheva dhamme nevasaññānāsaññāyatanaṃ upasampajja viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati; tattha ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. So tato cuto āgāmī hoti āgantā itthattaṃ. ‘‘Idha pana, sāriputta, ekaccassa puggalassa orambhāgiyāni saṃyojanāni pahīnāni honti, so diṭṭheva dhamme nevasaññānāsaññāyatanaṃ upasampajja viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati; tattha ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno nevasaññānāsaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. So tato cuto anāgāmī hoti anāgantā itthattaṃ. ‘‘Ayaṃ kho, sāriputta, hetu ayaṃ paccayo, yena midhekacce sattā tamhā kāyā cutā āgāmino honti āgantāro itthattaṃ. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo, yena midhekacce sattā tamhā kāyā cutā anāgāmino honti anāgantāro itthatta’’nti. Paṭhamaṃ.",
      "english": "Monks, when there is a body, due to bodily volition, internal pleasure and pain arise. And, monks, when there is speech, due to verbal volition, internal pleasure and pain arise. And, monks, when there is mind, due to mental volition, internal pleasure and pain arise, conditioned by ignorance.\n\nMonks, one fabricates that bodily volitional formation oneself, due to which internal pleasure and pain arise for oneself. Or, others fabricate that bodily volitional formation for oneself, due to which internal pleasure and pain arise for oneself. Or, with full comprehension, one fabricates that bodily volitional formation, due to which internal pleasure and pain arise for oneself. Or, without full comprehension, one fabricates that bodily volitional formation, due to which internal pleasure and pain arise for oneself.\n\nMonks, one fabricates that verbal volitional formation oneself, due to which internal pleasure and pain arise for oneself; or, others fabricate that verbal volitional formation for oneself, due to which internal pleasure and pain arise for oneself; or, with full comprehension, one fabricates that verbal volitional formation, due to which internal pleasure and pain arise for oneself; or, without full comprehension, one fabricates that verbal volitional formation, due to which internal pleasure and pain arise for oneself.\n\nMonks, one fabricates that mental volitional formation oneself, due to which internal pleasure and pain arise for oneself; or, others fabricate that mental volitional formation for oneself, due to which internal pleasure and pain arise for oneself; or, with full comprehension, one fabricates that mental volitional formation, due to which internal pleasure and pain arise for oneself; or, without full comprehension, one fabricates that mental volitional formation, due to which internal pleasure and pain arise for oneself.\n\nMonks, ignorance underlies these phenomena. With the complete fading away and cessation of that very ignorance, that body, due to which internal pleasure and pain arise, no longer exists; that speech, due to which internal pleasure and pain arise, no longer exists; that mind, due to which internal pleasure and pain arise, no longer exists; that field, due to which internal pleasure and pain arise, no longer exists; that basis, due to which internal pleasure and pain arise, no longer exists; that sphere, due to which internal pleasure and pain arise, no longer exists; that support, due to which internal pleasure and pain arise, no longer exists.\n\nMonks, there are these four acquisitions of selfhood. Which four? Monks, there is an acquisition of selfhood in which one's own volition operates, but not the volition of others. Monks, there is an acquisition of selfhood in which the volition of others operates, but not one's own volition. Monks, there is an acquisition of selfhood in which both one's own volition and the volition of others operate. Monks, there is an acquisition of selfhood in which neither one's own volition nor the volition of others operates. These, monks, are the four acquisitions of selfhood.\n\nWhen this was said, Venerable Sāriputta addressed the Blessed One thus: \"Venerable sir, I understand the detailed meaning of this concise statement of the Blessed One as follows: 'Venerable sir, concerning that acquisition of selfhood in which one's own volition operates but not the volition of others, it is due to their own volition that those beings pass away from that body. Venerable sir, concerning that acquisition of selfhood in which the volition of others operates but not one's own volition, it is due to the volition of others that those beings pass away from that body. Venerable sir, concerning that acquisition of selfhood in which both one's own volition and the volition of others operate, it is due to both their own volition and the volition of others that those beings pass away from that body. Venerable sir, concerning that acquisition of selfhood in which neither one's own volition nor the volition of others operates, which deities are to be seen as such?'\"\n\n\"Sāriputta, the deities who have attained the sphere of neither perception nor non-perception are to be seen as such.\"\n\n\"Venerable sir, what is the cause, what is the condition, by which some beings, having passed away from that body, are bound for return to this state of existence? And what, Venerable sir, is the cause, what is the condition, by which some beings, having passed away from that body, are non-returners, not bound for return to this state of existence?\"\n\n\"Sāriputta, here, for a certain individual, the lower fetters are not abandoned, and in this very life, they attain and dwell in the sphere of neither perception nor non-perception.\n\nHe delights in that, he craves that, and through it, he experiences satisfaction. Having remained there, firmly determined on that, frequently dwelling in that, and without falling away, when he passes away, he is reborn into the companionship of the devas who have attained the sphere of neither perception nor non-perception. Having fallen from that state, he is one who comes again, one who is destined to return to this state of existence.\n\nBut here, Sāriputta, for a certain individual, the lower fetters are abandoned. He, right in this very life, enters upon and dwells in the sphere of neither perception nor non-perception. He delights in that, he craves that, and through it, he experiences satisfaction. Having remained there, firmly determined on that, frequently dwelling in that, and without falling away, when he passes away, he is reborn into the companionship of the devas who have attained the sphere of neither perception nor non-perception. Having fallen from that state, he is one who does not come again, one who is not destined to return to this state of existence.\n\nThis, Sāriputta, is the reason, this is the condition, whereby some beings here, having fallen from that body, are ones who come again, who are destined to return to this state of existence. But this, Sāriputta, is the reason, this is the condition, whereby some beings here, having fallen from that body, are ones who do not come again, who are not destined to return to this state of existence.",
      "sinhala": "මහණෙනි, කය පවතින කල්හි, කය පිළිබඳව ඇතිවන සංචේතනා හේතුකොටගෙන අභ්‍යන්තරයෙන් සැප දුක් හටගනී. මහණෙනි, වචනය පවතින කල්හි, වචනය පිළිබඳව ඇතිවන සංචේතනා හේතුකොටගෙන අභ්‍යන්තරයෙන් සැප දුක් හටගනී. මහණෙනි, මනස පවතින කල්හි, මනස පිළිබඳව ඇතිවන සංචේතනා හේතුකොටගෙන අවිද්‍යාව මුල්කොටගෙනම අභ්‍යන්තරයෙන් සැප දුක් හටගනී.\n\nමහණෙනි, යමක් හේතුකොටගෙන ඔහුට අභ්‍යන්තරයෙන් සැප දුක් හටගනී ද, ඒ කය පිළිබඳ සංස්කාරය තමන් විසින්ම ඇතිකර ගනී. නැතහොත් අනුන් විසින් ඔහුට ඒ කය පිළිබඳ සංස්කාරය ඇතිකරනු ලැබේ. නැතහොත් සිහි නුවණින් යුක්තව ඒ කය පිළිබඳ සංස්කාරය ඇතිකර ගනී. නැතහොත් සිහි නුවණින් තොරව ඒ කය පිළිබඳ සංස්කාරය ඇතිකර ගනී.\n\nමහණෙනි, යමක් හේතුකොටගෙන ඔහුට අභ්‍යන්තරයෙන් සැප දුක් හටගනී ද, ඒ වචනය පිළිබඳ සංස්කාරය තමන් විසින්ම ඇතිකර ගනී. නැතහොත් අනුන් විසින් ඔහුට ඒ වචනය පිළිබඳ සංස්කාරය ඇතිකරනු ලැබේ. නැතහොත් සිහි නුවණින් යුක්තව ඒ වචනය පිළිබඳ සංස්කාරය ඇතිකර ගනී. නැතහොත් සිහි නුවණින් තොරව ඒ වචනය පිළිබඳ සංස්කාරය ඇතිකර ගනී.\n\nමහණෙනි, යමක් හේතුකොටගෙන ඔහුට අභ්‍යන්තරයෙන් සැප දුක් හටගනී ද, ඒ මනස පිළිබඳ සංස්කාරය තමන් විසින්ම ඇතිකර ගනී. නැතහොත් අනුන් විසින් ඔහුට ඒ මනස පිළිබඳ සංස්කාරය ඇතිකරනු ලැබේ. නැතහොත් සිහි නුවණින් යුක්තව ඒ මනස පිළිබඳ සංස්කාරය ඇතිකර ගනී. නැතහොත් සිහි නුවණින් තොරව ඒ මනස පිළිබඳ සංස්කාරය ඇතිකර ගනී.\n\nමහණෙනි, මේ ධර්මයන් තුළ අවිද්‍යාව ඇතුළත් වී පවතී. අවිද්‍යාව මුළුමනින්ම නොඇල්මෙන් නිරුද්ධ කිරීමෙන්, යමක් හේතුකොටගෙන ඔහුට අභ්‍යන්තරයෙන් සැප දුක් හටගනී ද, ඒ කය නැති වී යයි, ඒ වචනය නැති වී යයි, ඒ මනස නැති වී යයි, ඒ ක්ෂේත්‍රය නැති වී යයි, ඒ වස්තුව නැති වී යයි, ඒ ආයතනය නැති වී යයි, ඒ අධිකරණය නැති වී යයි.\n\nමහණෙනි, මේ ආත්මභාව ප්‍රතිලාභ සතරකි. කවරේද ඒ සතර? මහණෙනි, යම් ආත්මභාව ප්‍රතිලාභයක තමන්ගේම සංචේතනාව ක්‍රියාත්මක වේ ද, අනුන්ගේ සංචේතනාව ක්‍රියාත්මක නොවේ ද, එබඳු ආත්මභාව ප්‍රතිලාභයක් ඇත. මහණෙනි, යම් ආත්මභාව ප්‍රතිලාභයක අනුන්ගේ සංචේතනාව ක්‍රියාත්මක වේ ද, තමන්ගේ සංචේතනාව ක්‍රියාත්මක නොවේ ද, එබඳු ආත්මභාව ප්‍රතිලාභයක් ඇත. මහණෙනි, යම් ආත්මභාව ප්‍රතිලාභයක තමන්ගේ සංචේතනාව ද, අනුන්ගේ සංචේතනාව ද යන දෙකම ක්‍රියාත්මක වේ ද, එබඳු ආත්මභාව ප්‍රතිලාභයක් ඇත. මහණෙනි, යම් ආත්මභාව ප්‍රතිලාභයක තමන්ගේ සංචේතනාව ද ක්‍රියාත්මක නොවේ ද, අනුන්ගේ සංචේතනාව ද ක්‍රියාත්මක නොවේ ද, එබඳු ආත්මභාව ප්‍රතිලාභයක් ඇත. මහණෙනි, මේ ආත්මභාව ප්‍රතිලාභ සතරය.\n\nමෙසේ වදාළ කල්හි ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ ධර්මයේ අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි: ස්වාමීනි, යම් ආත්මභාව ප්‍රතිලාභයක තමන්ගේම සංචේතනාව ක්‍රියාත්මක වේ ද, අනුන්ගේ සංචේතනාව ක්‍රියාත්මක නොවේ ද, ඒ ආත්මභාව ප්‍රතිලාභයෙන් ඒ සත්වයන්ගේ චුතිය සිදුවන්නේ තමන්ගේ සංචේතනාව හේතුකොටගෙනය. ස්වාමීනි, යම් ආත්මභාව ප්‍රතිලාභයක අනුන්ගේ සංචේතනාව ක්‍රියාත්මක වේ ද, තමන්ගේ සංචේතනාව ක්‍රියාත්මක නොවේ ද, ඒ ආත්මභාව ප්‍රතිලාභයෙන් ඒ සත්වයන්ගේ චුතිය සිදුවන්නේ අනුන්ගේ සංචේතනාව හේතුකොටගෙනය. ස්වාමීනි, යම් ආත්මභාව ප්‍රතිලාභයක තමන්ගේ සංචේතනාව ද, අනුන්ගේ සංචේතනාව ද යන දෙකම ක්‍රියාත්මක වේ ද, ඒ ආත්මභාව ප්‍රතිලාභයෙන් ඒ සත්වයන්ගේ චුතිය සිදුවන්නේ තමන්ගේ සංචේතනාව ද අනුන්ගේ සංචේතනාව ද යන දෙකම හේතුකොටගෙනය. ස්වාමීනි, යම් ආත්මභාව ප්‍රතිලාභයක තමන්ගේ සංචේතනාව ද ක්‍රියාත්මක නොවේ ද, අනුන්ගේ සංචේතනාව ද ක්‍රියාත්මක නොවේ ද, ඒ ආත්මභාව ප්‍රතිලාභයෙහිලා කවර දෙවියන් දැකිය යුතු ද?” “සාරිපුත්තය, නේවසංඥානාසංඥායතන භූමියට පැමිණි දෙවියන් ඒ තැනැත්තා විසින් දැකිය යුතුය.”\n\n“ස්වාමීනි, කවර නම් හේතුවකින් ද, කවර නම් ප්‍රත්‍යයකින් ද, මේ ඇතැම් සත්වයෝ ඒ කයින් චුතව මෙලොවට නැවත පැමිණෙන්නෝ වෙත් ද? ස්වාමීනි, කවර නම් හේතුවකින් ද, කවර නම් ප්‍රත්‍යයකින් ද, මේ ඇතැම් සත්වයෝ ඒ කයින් චුතව මෙලොවට නැවත නොපැමිණෙන්නෝ වෙත් ද?”\n\n“සාරිපුත්තය, මෙහිලා යම් පුද්ගලයෙකුට ඕරම්භාගීය සංයෝජන ප්‍රහීණ වී නැත් ද, ඔහු මේ ආත්මභාවයේදීම නේවසංඥානාසංඥායතන භාවනාව සම්පූර්ණ කොට වාසය කරයි.\n\nඑක් පුද්ගලයෙක් එය අස්වාදනය කරයි, එයට කැමති වෙයි, එයින් සතුටට පත් වෙයි. එහි පිහිටා, එයටම අධිමුක්තව, එයින් බහුලව වාසය කරමින්, නොපිරිහී කලුරිය කළ විට, නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණි දෙවියන්ගේ සහභාවයට පැමිණේ.\n\nඔහු එතනින් චුත වී මේ භවයට නැවත පැමිණෙන්නෙක් වෙයි.\n\n‘‘සාරිපුත්තයෙනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙකුට ඕරම්භාගීය සං‍යෝජන ප්‍රහීණ වී ඇත. ඔහු මේ ආත්මභාවයේදීම නේවසඤ්ඤානාසඤ්ඤායතනයට උපසම්පදා වී වාසය කරයි.\n\nඔහු එය අස්වාදනය කරයි, එයට කැමති වෙයි, එයින් සතුටට පත් වෙයි. එහි පිහිටා, එයටම අධිමුක්තව, එයින් බහුලව වාසය කරමින්, නොපිරිහී කලුරිය කළ විට, නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණි දෙවියන්ගේ සහභාවයට පැමිණේ.\n\nඔහු එතනින් චුත වී මේ භවයට නැවත නොපැමිණෙන අනාගාමී කෙනෙක් වෙයි.\n\n‘‘සාරිපුත්තයෙනි, මෙහි ඇතැම් සත්ත්වයෝ ඒ භවයෙන් චුත වී මේ භවයට නැවත පැමිණෙන්නෝ වෙත්ද, මෙයට හේතුවත්, මෙයට ප්‍රත්‍යයත් මෙයයි. සාරිපුත්තයෙනි, මෙහි ඇතැම් සත්ත්වයෝ ඒ භවයෙන් චුත වී මේ භවයට නැවත නොපැමිණෙන්නෝ වෙත්ද, මෙයට හේතුවත්, මෙයට ප්‍රත්‍යයත් මෙයයි.’’",
      "paliTitle": "Cetanāsuttaṃ",
      "englishTitle": "Discourse on Volition",
      "sinhalaTitle": "චේතනා සූත‍්‍රය"
    },
    {
      "number": 172,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Addhamāsūpasampannena me, āvuso, atthapaṭisambhidā sacchikatā odhiso byañjanaso. Tamahaṃ anekapariyāyena ācikkhāmi desemi paññāpemi paṭṭhapemi vivarāmi vibhajāmi uttānīkaromi. Yassa kho panassa kaṅkhā vā vimati vā, so maṃ pañhena. Ahaṃ veyyākaraṇena sammukhībhūto no satthā yo no dhammānaṃ sukusalo. ‘‘Addhamāsūpasampannena me, āvuso, dhammapaṭisambhidā sacchikatā odhiso byañjanaso. Tamahaṃ anekapariyāyena ācikkhāmi desemi paññāpemi paṭṭhapemi vivarāmi vibhajāmi uttānīkaromi. Yassa kho panassa kaṅkhā vā vimati vā, so maṃ pañhena. Ahaṃ veyyākaraṇena sammukhībhūto no satthā yo no dhammānaṃ sukusalo. ‘‘Addhamāsūpasampannena me, āvuso, niruttipaṭisambhidā sacchikatā odhiso byañjanaso. Tamahaṃ anekapariyāyena ācikkhāmi desemi paññāpemi paṭṭhapemi vivarāmi vibhajāmi uttānīkaromi. Yassa kho panassa kaṅkhā vā vimati vā, so maṃ pañhena. Ahaṃ veyyākaraṇena sammukhībhūto no satthā yo no dhammānaṃ sukusalo. ‘‘Addhamāsūpasampannena me, āvuso, paṭibhānapaṭisambhidā sacchikatā odhiso byañjanaso. Tamahaṃ anekapariyāyena ācikkhāmi desemi paññāpemi paṭṭhapemi vivarāmi vibhajāmi uttānīkaromi. Yassa kho panassa kaṅkhā vā vimati vā, so maṃ pañhena. Ahaṃ veyyākaraṇena sammukhībhūto no satthā yo no dhammānaṃ sukusalo’’ti. Dutiyaṃ.",
      "english": "Then indeed, the venerable Sāriputta addressed the monastics, saying, \"Friends, monastics!\" And those monastics replied to the venerable Sāriputta, \"Friend!\" The venerable Sāriputta spoke this: \"Friends, it has been half a month since my full ordination, and I have realized the analytical discernment of meaning, both comprehensively and in detail according to the wording. This I explain, teach, proclaim, establish, make clear, analyze, and reveal in various ways. If, indeed, anyone has doubt or perplexity, let him question me. I am present here as one who can provide answers, but I am not the Master who is supremely skilled in the Dhamma.\"\n\n\"Friends, it has been half a month since my full ordination, and I have realized the analytical discernment of the Dhamma, both comprehensively and in detail according to the wording. This I explain, teach, proclaim, establish, make clear, analyze, and reveal in various ways. If, indeed, anyone has doubt or perplexity, let him question me. I am present here as one who can provide answers, but I am not the Master who is supremely skilled in the Dhamma.\"\n\n\"Friends, it has been half a month since my full ordination, and I have realized the analytical discernment of language, both comprehensively and in detail according to the wording. This I explain, teach, proclaim, establish, make clear, analyze, and reveal in various ways. If, indeed, anyone has doubt or perplexity, let him question me. I am present here as one who can provide answers, but I am not the Master who is supremely skilled in the Dhamma.\"\n\n\"Friends, it has been half a month since my full ordination, and I have realized the analytical discernment of ready wit, both comprehensively and in detail according to the wording. This I explain, teach, proclaim, establish, make clear, analyze, and reveal in various ways. If, indeed, anyone has doubt or perplexity, let him question me. I am present here as one who can provide answers, but I am not the Master who is supremely skilled in the Dhamma.\"",
      "sinhala": "එහිදී ආයුෂ්මත් ශ්‍රී‍ ශාරිපුත්ත ස්ථවිරයන් වහන්සේ \"ඇවැත්නි භික්ෂූනි\" යනුවෙන් භික්ෂූන් වහන්සේලා ඇමතූ සේක. \"ඇවැත්නි\" කියා ඒ භික්ෂූහු ආයුෂ්මත් ශ්‍රී‍ ශාරිපුත්ත ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශ්‍රී‍ ශාරිපුත්ත ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක:\n\n\"ඇවැත්නි, මා උපසම්පදා වී අඩමසක් ගත වන විට, අර්ථප්‍රතිසම්භිදාව (ධර්මයේ අර්ථය, විපාක, ප්‍රතිඵල සහ ස්වභාවය පිළිබඳ ගැඹුරු ඥානය) සියලු වචන සමූහයන් හා අකුරු අනුව මැනවින් ප්‍රත්‍යක්ෂ කරන ලදී. එය මම නොයෙක් ක්‍රමවලින් ප්‍රකාශ කරමි, දේශනා කරමි, පනවමි, පිහිටුවමි, විවෘත කරමි, විභාග කරමි, පැහැදිලි කරමි. යමෙකුට සැකයක් හෝ විමතියක් වේද, ඔහු මාගෙන් ප්‍රශ්න කරත්වා. මම විස්තර සහිතව පිළිතුරු දීමට සූදානම්ව සිටිමි; මම නම් ධර්මයෙහි මනාකොට දක්ෂ වූ නුඹලාගේ ශාස්තෘවරයා නොවේ.\n\n\"ඇවැත්නි, මා උපසම්පදා වී අඩමසක් ගත වන විට, ධර්මප්‍රතිසම්භිදාව (ධර්මයම, එහි හේතු, ප්‍රත්‍යයන් සහ පටිච්චසමුප්පාද ධර්මය පිළිබඳ ගැඹුරු ඥානය) සියලු වචන සමූහයන් හා අකුරු අනුව මැනවින් ප්‍රත්‍යක්ෂ කරන ලදී. එය මම නොයෙක් ක්‍රමවලින් ප්‍රකාශ කරමි, දේශනා කරමි, පනවමි, පිහිටුවමි, විවෘත කරමි, විභාග කරමි, පැහැදිලි කරමි. යමෙකුට සැකයක් හෝ විමතියක් වේද, ඔහු මාගෙන් ප්‍රශ්න කරත්වා. මම විස්තර සහිතව පිළිතුරු දීමට සූදානම්ව සිටිමි; මම නම් ධර්මයෙහි මනාකොට දක්ෂ වූ නුඹලාගේ ශාස්තෘවරයා නොවේ.\n\n\"ඇවැත්නි, මා උපසම්පදා වී අඩමසක් ගත වන විට, නිරුත්තිප්‍රතිසම්භිදාව (ධර්මය ප්‍රකාශ කරන භාෂාව, ව්‍යාකරණ, යෙදුම් සහ වචනවල නිරුක්තිමය ගැඹුරු ඥානය) සියලු වචන සමූහයන් හා අකුරු අනුව මැනවින් ප්‍රත්‍යක්ෂ කරන ලදී. එය මම නොයෙක් ක්‍රමවලින් ප්‍රකාශ කරමි, දේශනා කරමි, පනවමි, පිහිටුවමි, විවෘත කරමි, විභාග කරමි, පැහැදිලි කරමි. යමෙකුට සැකයක් හෝ විමතියක් වේද, ඔහු මාගෙන් ප්‍රශ්න කරත්වා. මම විස්තර සහිතව පිළිතුරු දීමට සූදානම්ව සිටිමි; මම නම් ධර්මයෙහි මනාකොට දක්ෂ වූ නුඹලාගේ ශාස්තෘවරයා නොවේ.\n\n\"ඇවැත්නි, මා උපසම්පදා වී අඩමසක් ගත වන විට, ප්‍රතිභානප්‍රතිසම්භිදාව (ධර්මය විස්තර කිරීමේදී ඇතිවන ප්‍රඥාවන්ත, ඉක්මන්, විචිත්‍ර ප්‍රතිචාර දැක්වීමේ හැකියාව පිළිබඳ ගැඹුරු ඥානය) සියලු වචන සමූහයන් හා අකුරු අනුව මැනවින් ප්‍රත්‍යක්ෂ කරන ලදී. එය මම නොයෙක් ක්‍රමවලින් ප්‍රකාශ කරමි, දේශනා කරමි, පනවමි, පිහිටුවමි, විවෘත කරමි, විභාග කරමි, පැහැදිලි කරමි. යමෙකුට සැකයක් හෝ විමතියක් වේද, ඔහු මාගෙන් ප්‍රශ්න කරත්වා. මම විස්තර සහිතව පිළිතුරු දීමට සූදානම්ව සිටිමි; මම නම් ධර්මයෙහි මනාකොට දක්ෂ වූ නුඹලාගේ ශාස්තෘවරයා නොවේ.\"",
      "paliTitle": "Vibhattisuttaṃ",
      "englishTitle": "The Discourse on Analysis",
      "sinhalaTitle": "විභත්ති සූත්‍‍රය"
    },
    {
      "number": 173,
      "pali": "Atha kho āyasmā mahākoṭṭhiko yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthaññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā natthaññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthi ca natthi ca aññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā nevatthi no natthaññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthaññaṃ kiñcī’ti, iti puṭṭho samāno ‘mā hevaṃ, āvuso’ti vadesi. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā natthaññaṃ kiñcī’ti, iti puṭṭho samāno – ‘mā hevaṃ, āvuso’ti vadesi. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthi ca natthi ca aññaṃ kiñcī’ti, iti puṭṭho samāno – ‘mā hevaṃ, āvuso’ti vadesi. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā nevatthi no natthaññaṃ kiñcī’ti, iti puṭṭho samāno – ‘mā hevaṃ, āvuso’ti vadesi. Yathā kathaṃ pana, āvuso, imassa bhāsitassa attho daṭṭhabbo’’ti? ‘‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthaññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā natthaññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthi ca natthi ca aññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā nevatthi no natthaññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. Yāvatā, āvuso, channaṃ phassāyatanānaṃ gati tāvatā papañcassa gati; yāvatā papañcassa gati tāvatā channaṃ phassāyatanānaṃ gati. Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā papañcanirodho papañcavūpasamo’’ti. Tatiyaṃ.",
      "english": "Then the Venerable Mahākoṭṭhiko approached the Venerable Sāriputta. Having approached, he exchanged courteous and amiable greetings with the Venerable Sāriputta. When the exchange of polite conversation was concluded, he sat down to one side. Seated to one side, the Venerable Mahākoṭṭhiko said to the Venerable Sāriputta:\n\n“Friend, is there anything else beyond the utter fading away and cessation of the six sense bases?” “Not so, friend.” “Friend, is there nothing else beyond the utter fading away and cessation of the six sense bases?” “Not so, friend.” “Friend, is there both something and nothing else beyond the utter fading away and cessation of the six sense bases?” “Not so, friend.” “Friend, is there neither something nor nothing else beyond the utter fading away and cessation of the six sense bases?” “Not so, friend.”\n\n“Friend, when asked, ‘Is there anything else beyond the utter fading away and cessation of the six sense bases?’ you say, ‘Not so, friend.’ When asked, ‘Is there nothing else beyond the utter fading away and cessation of the six sense bases?’ you say, ‘Not so, friend.’ When asked, ‘Is there both something and nothing else beyond the utter fading away and cessation of the six sense bases?’ you say, ‘Not so, friend.’ When asked, ‘Is there neither something nor nothing else beyond the utter fading away and cessation of the six sense bases?’ you say, ‘Not so, friend.’ So how then, friend, is the meaning of this statement to be understood?”\n\n“Friend, when one says, ‘There is something else beyond the utter fading away and cessation of the six sense bases,’ one proliferates even that which is beyond proliferation. When one says, ‘There is nothing else beyond the utter fading away and cessation of the six sense bases,’ one proliferates even that which is beyond proliferation. When one says, ‘There is both something and nothing else beyond the utter fading away and cessation of the six sense bases,’ one proliferates even that which is beyond proliferation. When one says, ‘There is neither something nor nothing else beyond the utter fading away and cessation of the six sense bases,’ one proliferates even that which is beyond proliferation. Friend, as far as the scope of the six sense bases extends, so far does the scope of mental proliferation extend. As far as the scope of mental proliferation extends, so far does the scope of the six sense bases extend. Friend, with the utter fading away and cessation of the six sense bases, there is the cessation of mental proliferation and the subsiding of mental proliferation.”",
      "sinhala": "එසමයෙහි ආයුෂ්මත් මහාකොට්ඨික තෙරුන් ආයුෂ්මත් ශාරිපුත්ත තෙරුන් වහන්සේ වෙත පැමිණියේය. පැමිණ, ආයුෂ්මත් ශාරිපුත්ත තෙරුන් වහන්සේ සමඟ සතුටු සාමිචි කථා කළේය. සතුටු විය යුතු, සිහි කටයුතු වූ කථා පැවැත්වීමෙන් පසු එකත්පසෙකින් හිඳගත්තේය.\n\nඑකත්පසෙකින් හිඳගත් ආයුෂ්මත් මහාකොට්ඨික තෙරුන් ආයුෂ්මත් ශාරිපුත්ත තෙරුන් වහන්සේට මෙය කීවේය: “ඇවැත්නි, ඡස්පර්ශායතනයන්ගේ (ඇස, කන, නාසය, දිව, කය, මනස යන මේ ස්පර්ශායතන සයෙහි) අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසියම් දෙයක් ඇද්ද?”\n“ඇවැත්නි, එසේ නොකියන්න.”\n“ඇවැත්නි, ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් නැත්තේ ද?”\n“ඇවැත්නි, එසේ නොකියන්න.”\n“ඇවැත්නි, ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් ඇත්තේ ද, නැත්තේ ද?”\n“ඇවැත්නි, එසේ නොකියන්න.”\n“ඇවැත්නි, ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් ඇත්තේත් නැත්තේත් නොවේ ද?”\n“ඇවැත්නි, එසේ නොකියන්න.”\n“ඇවැත්නි, ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසියම් දෙයක් ඇද්දැ’යි මෙසේ විමසනු ලැබූ කල්හි ‘ඇවැත්නි, එසේ නොකියන්නැ’යි ඔබ වදාළ සේක. ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් නැත්තේ දැ’යි මෙසේ විමසනු ලැබූ කල්හි ‘ඇවැත්නි, එසේ නොකියන්නැ’යි ඔබ වදාළ සේක. ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් ඇත්තේ ද, නැත්තේ දැ’යි මෙසේ විමසනු ලැබූ කල්හි ‘ඇවැත්නි, එසේ නොකියන්නැ’යි ඔබ වදාළ සේක. ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් ඇත්තේත් නැත්තේත් නොවේ දැ’යි මෙසේ විමසනු ලැබූ කල්හි ‘ඇවැත්නි, එසේ නොකියන්නැ’යි ඔබ වදාළ සේක. එසේ නම්, ඇවැත්නි, කෙසේ නම් මේ ප්‍රකාශයේ අර්ථය දැක්විය යුතු ද?”\n\n“ඇවැත්නි, ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසියම් දෙයක් ඇද්දැ’යි මෙසේ පවසන්නේ, ප්‍රපඤ්චයක් නොවන දේ ප්‍රපඤ්ච බවට පත් කරයි. ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් නැත්තේ ය’යි මෙසේ පවසන්නේ, ප්‍රපඤ්චයක් නොවන දේ ප්‍රපඤ්ච බවට පත් කරයි. ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් ඇත්තේ ද නැත්තේ ද’යි මෙසේ පවසන්නේ, ප්‍රපඤ්චයක් නොවන දේ ප්‍රපඤ්ච බවට පත් කරයි. ‘ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන අන් කිසිවක් ඇත්තේත් නැත්තේත් නොවේ’යි මෙසේ පවසන්නේ, ප්‍රපඤ්චයක් නොවන දේ ප්‍රපඤ්ච බවට පත් කරයි. ඇවැත්නි, ඡස්පර්ශායතනයන්ගේ ගමන්මඟ යම්තාක් ද, ප්‍රපඤ්චයේ ගමන්මඟ ද එම්තාක් වේ; ප්‍රපඤ්චයේ ගමන්මඟ යම්තාක් ද, ඡස්පර්ශායතනයන්ගේ ගමන්මඟ ද එම්තාක් වේ. ඇවැත්නි, ඡස්පර්ශායතනයන්ගේ අශේෂ විරාගය සහ නිරෝධය හේතු කොටගෙන, ප්‍රපඤ්චයේ නිරෝධය ද ප්‍රපඤ්චයේ සංසිඳීම ද සිදුවේ.”",
      "paliTitle": "Mahākoṭṭhikasuttaṃ",
      "englishTitle": "The Discourse on Mahākoṭṭhika",
      "sinhalaTitle": "මහා කෝට්‍ඨික සූත්‍රය"
    },
    {
      "number": 174,
      "pali": "Atha kho āyasmā ānando yenāyasmā mahākoṭṭhiko tenupasaṅkami; upasaṅkamitvā āyasmatā mahākoṭṭhikena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ mahākoṭṭhikaṃ etadavoca – ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthaññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā natthaññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthi ca natthi ca aññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā nevatthi no natthaññaṃ kiñcī’’ti? ‘‘Mā hevaṃ, āvuso’’. ‘‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthaññaṃ kiñcī’ti, iti puṭṭho samāno – ‘mā hevaṃ, āvuso’ti vadesi. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā natthaññaṃ kiñcī’ti, iti puṭṭho samāno – ‘mā hevaṃ, āvuso’ti vadesi. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthi ca natthi ca aññaṃ kiñcī’ti, iti puṭṭho samāno – ‘mā hevaṃ, āvuso’ti vadesi. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā nevatthi no natthaññaṃ kiñcī’ti, iti puṭṭho samāno – ‘mā hevaṃ, āvuso’ti vadesi. Yathā kathaṃ panāvuso, imassa bhāsitassa attho daṭṭhabbo’’ti? ‘‘‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthaññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā natthaññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā atthi ca natthi ca aññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. ‘Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā nevatthi no natthaññaṃ kiñcī’ti, iti vadaṃ appapañcaṃ papañceti. Yāvatā, āvuso, channaṃ phassāyatanānaṃ gati tāvatā papañcassa gati. Yāvatā papañcassa gati tāvatā channaṃ phassāyatanānaṃ gati. Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā papañcanirodho papañcavūpasamo’’ti. Catutthaṃ.",
      "english": "Then, indeed, Venerable Ānanda approached Venerable Mahākoṭṭhika. Having approached, he exchanged friendly greetings with Venerable Mahākoṭṭhika. Having concluded the courteous and memorable conversation, he sat down to one side.\n\nAs he sat to one side, Venerable Ānanda said to Venerable Mahākoṭṭhika, \"Friend, with the complete fading away and cessation of the six bases of contact, is there anything else remaining?\" \"Do not speak thus, friend.\" \"Friend, with the complete fading away and cessation of the six bases of contact, is there nothing else remaining?\" \"Do not speak thus, friend.\" \"Friend, with the complete fading away and cessation of the six bases of contact, is there both something and nothing else remaining?\" \"Do not speak thus, friend.\" \"Friend, with the complete fading away and cessation of the six bases of contact, is there neither something nor nothing else remaining?\" \"Do not speak thus, friend.\" \"'Friend, when asked if, with the complete fading away and cessation of the six bases of contact, there is anything else remaining, you say, \"Do not speak thus, friend.\" When asked if, with the complete fading away and cessation of the six bases of contact, there is nothing else remaining, you say, \"Do not speak thus, friend.\" When asked if, with the complete fading away and cessation of the six bases of contact, there is both something and nothing else remaining, you say, \"Do not speak thus, friend.\" When asked if, with the complete fading away and cessation of the six bases of contact, there is neither something nor nothing else remaining, you say, \"Do not speak thus, friend.\" In what manner, then, friend, should the meaning of this statement be understood?\" \"Friend, by saying 'with the complete fading away and cessation of the six bases of contact, there is anything else remaining,' one proliferates what should not be proliferated. By saying 'with the complete fading away and cessation of the six bases of contact, there is nothing else remaining,' one proliferates what should not be proliferated. By saying 'with the complete fading away and cessation of the six bases of contact, there is both something and nothing else remaining,' one proliferates what should not be proliferated. By saying 'with the complete fading away and cessation of the six bases of contact, there is neither something nor nothing else remaining,' one proliferates what should not be proliferated. Friend, as far as the scope of the six bases of contact extends, so far extends the scope of conceptual proliferation. As far as the scope of conceptual proliferation extends, so far extends the scope of the six bases of contact. Friend, with the complete fading away and cessation of the six bases of contact, there is the cessation of conceptual proliferation, the calming of conceptual proliferation.\"",
      "sinhala": "එසමයෙහි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහාකෝට්ඨිත ස්ථවිරයන් වහන්සේ වෙත එළඹ, උන්වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු වූද, සිහි කළ යුතු වූද කථාවක් කථා කොට නිමවා, එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහාකෝට්ඨිත ස්ථවිරයන් වහන්සේට මෙය පැවසූහ – \"ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් තිබේදැයි?\" \"එසේ නොකියන්න, ඇවැත්නි.\" \"ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් නැද්දැයි?\" \"එසේ නොකියන්න, ඇවැත්නි.\" \"ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් තිබේද නැද්දැයි (එකවරම)?\" \"එසේ නොකියන්න, ඇවැත්නි.\" \"ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් ඇත්තේ ද නොවේ, නැත්තේ ද නොවේදැයි?\" \"එසේ නොකියන්න, ඇවැත්නි.\" \"'ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් තිබේදැයි' මෙසේ අසන ලද කල්හි ඔබ, 'එසේ නොකියන්න, ඇවැත්නි' යැයි කියන්නෙහි. 'ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් නැද්දැයි' මෙසේ අසන ලද කල්හි ඔබ, 'එසේ නොකියන්න, ඇවැත්නි' යැයි කියන්නෙහි. 'ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් තිබේද නැද්දැයි (එකවරම)' මෙසේ අසන ලද කල්හි ඔබ, 'එසේ නොකියන්න, ඇවැත්නි' යැයි කියන්නෙහි. 'ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් ඇත්තේ ද නොවේ, නැත්තේ ද නොවේදැයි' මෙසේ අසන ලද කල්හි ඔබ, 'එසේ නොකියන්න, ඇවැත්නි' යැයි කියන්නෙහි. ඇවැත්නි, එසේ නම් මේ ප්‍රකාශයේ අර්ථය කෙසේ තේරුම් ගත යුතුදැයි?\"\n\n\"ඇවැත්නි, 'සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් තිබේදැයි' මෙසේ කියන්නා ප්‍රපංචයෙන් තොර දේ ප්‍රපංචයට නගයි. 'සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් නැද්දැයි' මෙසේ කියන්නා ද ප්‍රපංචයෙන් තොර දේ ප්‍රපංචයට නගයි. 'සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් තිබේද නැද්දැයි (එකවරම)' මෙසේ කියන්නා ද ප්‍රපංචයෙන් තොර දේ ප්‍රපංචයට නගයි. 'සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් (පසුව) වෙන යමක් ඇත්තේ ද නොවේ, නැත්තේ ද නොවේදැයි' මෙසේ කියන්නා ද ප්‍රපංචයෙන් තොර දේ ප්‍රපංචයට නගයි. ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන කොතෙක් දුරට ගමන් කරයිද, ප්‍රපංචය ද ඒ තාක් දුරට ගමන් කරයි. ප්‍රපංචය කොතෙක් දුරට ගමන් කරයිද, සය වැදෑරුම් ස්පර්ශායතන ද ඒ තාක් දුරට ගමන් කරයි. ඇවැත්නි, සය වැදෑරුම් ස්පර්ශායතන අශේෂයෙන් විරාගයට පත්වීමෙන් හා නිරුද්ධ වීමෙන් ප්‍රපංචය නිරුද්ධ වේ; ප්‍රපංචය සංසිඳේ.\"",
      "paliTitle": "Ānandasuttaṃ",
      "englishTitle": "Ananda Sutta",
      "sinhalaTitle": "ආනන්ද සූත්‍රය"
    },
    {
      "number": 175,
      "pali": "Atha kho āyasmā upavāṇo yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upavāṇo āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Kiṃ nu kho, āvuso sāriputta, vijjāyantakaro hotī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ panāvuso sāriputta, caraṇenantakaro hotī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ panāvuso sāriputta, vijjācaraṇenantakaro hotī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ panāvuso sāriputta, aññatra vijjācaraṇenantakaro hotī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘‘Kiṃ nu kho, āvuso sāriputta, vijjāyantakaro hotī’ti, iti puṭṭho samāno – ‘no hidaṃ, āvuso’ti vadesi. ‘Kiṃ panāvuso sāriputta, caraṇenantakaro hotī’ti, iti puṭṭho samāno – ‘no hidaṃ, āvuso’ti vadesi. ‘Kiṃ panāvuso sāriputta, vijjācaraṇenantakaro hotī’ti, iti puṭṭho samāno – ‘no hidaṃ, āvuso’ti vadesi. ‘Kiṃ panāvuso sāriputta, aññatra vijjācaraṇenantakaro hotī’ti, iti puṭṭho samāno – ‘no hidaṃ, āvuso’ti vadesi. Yathā kathaṃ panāvuso, antakaro hotī’’ti? ‘‘Vijjāya ce, āvuso, antakaro abhavissa, saupādānova samāno antakaro abhavissa. Caraṇena ce, āvuso, antakaro abhavissa, saupādānova samāno antakaro abhavissa. Vijjācaraṇena ce, āvuso, antakaro abhavissa, saupādānova samāno antakaro abhavissa. Aññatra vijjācaraṇena ce, āvuso, antakaro abhavissa, puthujjano antakaro abhavissa. Puthujjano hi, āvuso, aññatra vijjācaraṇena. Caraṇavipanno kho, āvuso, yathābhūtaṃ na jānāti na passati. Caraṇasampanno yathābhūtaṃ jānāti passati. Yathābhūtaṃ jānaṃ passaṃ antakaro hotī’’ti. Pañcamaṃ.",
      "english": "Then indeed, Venerable Upavāṇa approached Venerable Sāriputta. Having approached, he exchanged greetings with Venerable Sāriputta. Having concluded their courteous and memorable conversation, he sat down to one side. As he was sitting to one side, Venerable Upavāṇa said this to Venerable Sāriputta: \"Now then, friend Sāriputta, is it by wisdom that one makes an end?\" \"No, friend.\" \"But then, friend Sāriputta, is it by conduct that one makes an end?\" \"No, friend.\" \"But then, friend Sāriputta, is it by wisdom and conduct that one makes an end?\" \"No, friend.\" \"But then, friend Sāriputta, is it apart from wisdom and conduct that one makes an end?\" \"No, friend.\" \"When asked, 'Now then, friend Sāriputta, is it by wisdom that one makes an end?' you replied, 'No, friend.' When asked, 'But then, friend Sāriputta, is it by conduct that one makes an end?' you replied, 'No, friend.' When asked, 'But then, friend Sāriputta, is it by wisdom and conduct that one makes an end?' you replied, 'No, friend.' When asked, 'But then, friend Sāriputta, is it apart from wisdom and conduct that one makes an end?' you replied, 'No, friend.' So in what way, friend, does one make an end?\" \"If, friend, it were by wisdom that one makes an end, then one who is still clinging would make an end. If, friend, it were by conduct that one makes an end, then one who is still clinging would make an end. If, friend, it were by wisdom and conduct that one makes an end, then one who is still clinging would make an end. If, friend, it were apart from wisdom and conduct that one makes an end, then an ordinary person would make an end. For an ordinary person, friend, is indeed apart from wisdom and conduct. One deficient in conduct, friend, does not know and see things as they actually are. One accomplished in conduct knows and sees things as they actually are. By knowing and seeing things as they actually are, one makes an end.\"",
      "sinhala": "එවිට ආයුෂ්මත් උපවාණ තෙරණුවෝ, ආයුෂ්මත් ශ්‍රීශාරිපුත්ත තෙරණුවන් වැඩසිටි තැනට එළඹියහ. එළඹ, ආයුෂ්මත් ශ්‍රීශාරිපුත්ත තෙරණුවන් සමඟ සතුටු වූහ. සතුටු විය යුතු, සිහි කටයුතු කථා බස් හුවමාරු කරගෙන, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් උපවාණ තෙරණුවෝ, ආයුෂ්මත් ශ්‍රීශාරිපුත්ත තෙරණුවන්ට මෙය පැවසූහ: “ඇවැත් ශ්‍රීශාරිපුත්ත, අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාව (විද්‍යාව) පමණකින් දුකට කෙළවර වන්නේද?” “ඇවැත්නි, එසේ නොවේ.” “ඇවැත් ශ්‍රීශාරිපුත්ත, යහපත් හැසිරීමෙන් (චරණයෙන්) පමණක් දුකට කෙළවර වන්නේද?” “ඇවැත්නි, එසේ නොවේ.” “ඇවැත් ශ්‍රීශාරිපුත්ත, අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාවෙන් (විද්‍යාවෙන්) සහ යහපත් හැසිරීමෙන් (චරණයෙන්) යන දෙකෙන්ම දුකට කෙළවර වන්නේද?” “ඇවැත්නි, එසේ නොවේ.” “ඇවැත් ශ්‍රීශාරිපුත්ත, අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාව (විද්‍යාව) සහ යහපත් හැසිරීම (චරණය) හැර වෙනත් දෙයකින් දුකට කෙළවර වන්නේද?” “ඇවැත්නි, එසේ නොවේ.” “‘ඇවැත් ශ්‍රීශාරිපුත්ත, අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාවෙන් (විද්‍යාවෙන්) පමණක් දුකට කෙළවර වන්නේදැයි’ ඇසූ විට, ‘ඇවැත්නි, එසේ නොවේ’ යැයි ඔබ වදාරන්නෙහි ය. ‘ඇවැත් ශ්‍රීශාරිපුත්ත, යහපත් හැසිරීමෙන් (චරණයෙන්) පමණක් දුකට කෙළවර වන්නේදැයි’ ඇසූ විට, ‘ඇවැත්නි, එසේ නොවේ’ යැයි ඔබ වදාරන්නෙහි ය. ‘ඇවැත් ශ්‍රීශාරිපුත්ත, අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාවෙන් (විද්‍යාවෙන්) සහ යහපත් හැසිරීමෙන් (චරණයෙන්) යන දෙකෙන්ම දුකට කෙළවර වන්නේදැයි’ ඇසූ විට, ‘ඇවැත්නි, එසේ නොවේ’ යැයි ඔබ වදාරන්නෙහි ය. ‘ඇවැත් ශ්‍රීශාරිපුත්ත, අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාව (විද්‍යාව) සහ යහපත් හැසිරීම (චරණය) හැර වෙනත් දෙයකින් දුකට කෙළවර වන්නේදැයි’ ඇසූ විට, ‘ඇවැත්නි, එසේ නොවේ’ යැයි ඔබ වදාරන්නෙහි ය. එසේ නම් ඇවැත්නි, දුකට කෙළවර වන්නේ කෙසේද?” “ඇවැත්නි, යම් හෙයකින් අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාවෙන් (විද්‍යාවෙන්) පමණක් දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණා නම්, (එය) උපාදාන සහිතවම දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණි. යම් හෙයකින් යහපත් හැසිරීමෙන් (චරණයෙන්) පමණක් දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණා නම්, (එය) උපාදාන සහිතවම දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණි. යම් හෙයකින් අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාවෙන් (විද්‍යාවෙන්) සහ යහපත් හැසිරීමෙන් (චරණයෙන්) යන දෙකෙන්ම දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණා නම්, (එය) උපාදාන සහිතවම දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණි. ඇවැත්නි, යම් හෙයකින් අවිද්‍යාව මුලින් උදුරා දැමීමේ ප්‍රඥාව (විද්‍යාව) සහ යහපත් හැසිරීම (චරණය) හැර වෙනත් දෙයකින් දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණා නම්, පෘථග්ජනයාට දුකට කෙළවර කරන්නකු වන්නට ඉඩ තිබුණි. මක්නිසාද ඇවැත්නි, පෘථග්ජනයා යනු විද්‍යාව හා චරණය නොමැති තැනැත්තා ය. ඇවැත්නි, යහපත් හැසිරීමෙන් (චරණයෙන්) හීන වූ තැනැත්තා යථාර්ථය දන්නේ නැත, දකින්නේ නැත. චරණයෙන් යුක්ත වූ තැනැත්තා යථාර්ථය දනී, දකී. යථාර්ථය දන්නා, දකින තැනැත්තා දුකට කෙළවර කරයි.”",
      "paliTitle": "Upavāṇasuttaṃ",
      "englishTitle": "The Upavāṇa Discourse",
      "sinhalaTitle": "උපවාණ සූත්‍රය"
    },
    {
      "number": 176,
      "pali": "‘‘Saddho, bhikkhave, bhikkhu evaṃ sammā āyācamāno āyāceyya – ‘tādiso homi yādisā sāriputtamoggallānā’ti [a. ni. 2.131 idaṃ suttaṃ āgataṃ]. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvakānaṃ bhikkhūnaṃ, yadidaṃ sāriputtamoggallānā. ‘‘Saddhā, bhikkhave, bhikkhunī evaṃ sammā āyācamānā āyāceyya – ‘tādisā homi yādisā khemā ca bhikkhunī uppalavaṇṇā cā’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvikānaṃ bhikkhunīnaṃ, yadidaṃ khemā ca bhikkhunī uppalavaṇṇā ca. ‘‘Saddho, bhikkhave, upāsako evaṃ sammā āyācamāno āyāceyya – ‘tādiso homi yādiso citto ca gahapati hatthako ca āḷavako’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvakānaṃ upāsakānaṃ, yadidaṃ citto ca gahapati hatthako ca āḷavako. ‘‘Saddhā, bhikkhave, upāsikā evaṃ sammā āyācamānā āyāceyya – ‘tādisā homi yādisā khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvikānaṃ upāsikānaṃ, yadidaṃ khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, a faithful monk, wishing correctly in this way, should make this wish: ‘May I be like Sāriputta and Moggallāna!’ Monks, this is the balance, this is the standard for my disciples who are monks, namely, Sāriputta and Moggallāna.\n\n“Monks, a faithful nun, wishing correctly in this way, should make this wish: ‘May I be like the nun Khemā and Uppalavaṇṇā!’ Monks, this is the balance, this is the standard for my disciples who are nuns, namely, the nun Khemā and Uppalavaṇṇā.\n\n“Monks, a faithful male lay follower, wishing correctly in this way, should make this wish: ‘May I be like Citta the householder and Hatthaka of Āḷavī!’ Monks, this is the balance, this is the standard for my disciples who are male lay followers, namely, Citta the householder and Hatthaka of Āḷavī.\n\n“Monks, a faithful female lay follower, wishing correctly in this way, should make this wish: ‘May I be like the lay follower Khujjuttarā and Nandamātā of Veḷukaṇḍakī!’ Monks, this is the balance, this is the standard for my disciples who are female lay followers, namely, the lay follower Khujjuttarā and Nandamātā of Veḷukaṇḍakī.”",
      "sinhala": "භික්‍ෂූණි, ශ්‍රද්ධාවන්ත භික්‍ෂුවක් මෙසේ නිවැරදිව ප්‍රාර්ථනා කරන්නේ නම් ප්‍රාර්ථනා කළ යුතුයි: ‘මම සාරිපුත්ත, මොග්ගල්ලාන වැනි කෙනෙක් වෙම්වා!’ කියා. භික්‍ෂූණි, මාගේ ශ්‍රාවක භික්‍ෂූන් සඳහා මෙයයි මිනුම, මෙයයි ප්‍රමාණය, ඒ නම් සාරිපුත්ත සහ මොග්ගල්ලාන යි.\n\nභික්‍ෂූණි, ශ්‍රද්ධාවන්ත භික්‍ෂුණියක් මෙසේ නිවැරදිව ප්‍රාර්ථනා කරන්නේ නම් ප්‍රාර්ථනා කළ යුතුයි: ‘මම ඛේමා භික්‍ෂුණිය සහ උප්පලවණ්ණා භික්‍ෂුණිය වැනි කෙනෙක් වෙම්වා!’ කියා. භික්‍ෂූණි, මාගේ ශ්‍රාවක භික්‍ෂුණීන් සඳහා මෙයයි මිනුම, මෙයයි ප්‍රමාණය, ඒ නම් ඛේමා භික්‍ෂුණිය සහ උප්පලවණ්ණා භික්‍ෂුණිය යි.\n\nභික්‍ෂූණි, ශ්‍රද්ධාවන්ත උපාසකයෙක් මෙසේ නිවැරදිව ප්‍රාර්ථනා කරන්නේ නම් ප්‍රාර්ථනා කළ යුතුයි: ‘මම චිත්ත ගෘහපති, හත්ථක සහ ආළවක වැනි කෙනෙක් වෙම්වා!’ කියා. භික්‍ෂූණි, මාගේ ශ්‍රාවක උපාසකවරුන් සඳහා මෙයයි මිනුම, මෙයයි ප්‍රමාණය, ඒ නම් චිත්ත ගෘහපති, හත්ථක සහ ආළවක යි.\n\nභික්‍ෂූණි, ශ්‍රද්ධාවන්ත උපාසිකාවක් මෙසේ නිවැරදිව ප්‍රාර්ථනා කරන්නේ නම් ප්‍රාර්ථනා කළ යුතුයි: ‘මම ඛුජ්ජුත්තරා උපාසිකාව සහ වේළුකණ්ඩකීය නන්දමාතා වැනි කෙනෙක් වෙම්වා!’ කියා. භික්‍ෂූණි, මාගේ ශ්‍රාවක උපාසිකාවන් සඳහා මෙයයි මිනුම, මෙයයි ප්‍රමාණය, ඒ නම් ඛුජ්ජුත්තරා උපාසිකාව සහ වේළුකණ්ඩකීය නන්දමාතා යි.",
      "paliTitle": "Āyācanasuttaṃ",
      "englishTitle": "The Entreaty Discourse",
      "sinhalaTitle": "ආයාචනා සූත්‍රය"
    },
    {
      "number": 177,
      "pali": "Atha kho āyasmā rāhulo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rāhulaṃ bhagavā etadavoca – ‘‘Yā ca, rāhula, ajjhattikā pathavīdhātu yā ca bāhirā pathavīdhātu, pathavīdhāturevesā. ‘Taṃ netaṃ mama, nesohamasmi, na meso attā’ti, evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. Evametaṃ yathābhūtaṃ sammappaññāya disvā pathavīdhātuyā nibbindati, pathavīdhātuyā cittaṃ virājeti. ‘‘Yā ca, rāhula, ajjhattikā āpodhātu yā ca bāhirā āpodhātu, āpodhāturevesā. ‘Taṃ netaṃ mama, nesohamasmi, na meso attā’ti, evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. Evametaṃ yathābhūtaṃ sammappaññāya disvā āpodhātuyā nibbindati, āpodhātuyā cittaṃ virājeti. ‘‘Yā ca, rāhula, ajjhattikā tejodhātu yā ca bāhirā tejodhātu, tejodhāturevesā. ‘Taṃ netaṃ mama, nesohamasmi, na meso attā’ti, evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. Evametaṃ yathābhūtaṃ sammappaññāya disvā tejodhātuyā nibbindati, tejodhātuyā cittaṃ virājeti. ‘‘Yā ca, rāhula, ajjhattikā vāyodhātu yā ca bāhirā vāyodhātu, vāyodhāturevesā. ‘Taṃ netaṃ mama, nesohamasmi, na meso attā’ti, evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. Evametaṃ yathābhūtaṃ sammappaññāya disvā vāyodhātuyā nibbindati, vāyodhātuyā cittaṃ virājeti. ‘‘Yato kho, rāhula, bhikkhu imāsu catūsu dhātūsu nevattānaṃ na attaniyaṃ samanupassati, ayaṃ vuccati, rāhula, bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’ti. Sattamaṃ.",
      "english": "Then Venerable Rāhula approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. As Venerable Rāhula sat to one side, the Blessed One said this:\n\n\"Whatever, Rāhula, is the internal earth element and whatever is the external earth element – that is simply the earth element. 'This is not mine, I am not this, this is not my self' – thus, this should be seen as it truly is, with perfect discernment. Having seen this as it truly is with perfect discernment, one becomes disenchanted with the earth element, and one's mind becomes dispassionate towards the earth element.\n\n\"Whatever, Rāhula, is the internal water element and whatever is the external water element – that is simply the water element. 'This is not mine, I am not this, this is not my self' – thus, this should be seen as it truly is, with perfect discernment. Having seen this as it truly is with perfect discernment, one becomes disenchanted with the water element, and one's mind becomes dispassionate towards the water element.\n\n\"Whatever, Rāhula, is the internal fire element and whatever is the external fire element – that is simply the fire element. 'This is not mine, I am not this, this is not my self' – thus, this should be seen as it truly is, with perfect discernment. Having seen this as it truly is with perfect discernment, one becomes disenchanted with the fire element, and one's mind becomes dispassionate towards the fire element.\n\n\"Whatever, Rāhula, is the internal wind element and whatever is the external wind element – that is simply the wind element. 'This is not mine, I am not this, this is not my self' – thus, this should be seen as it truly is, with perfect discernment. Having seen this as it truly is with perfect discernment, one becomes disenchanted with the wind element, and one's mind becomes dispassionate towards the wind element. But when, Rāhula, a bhikkhu does not perceive a self or anything pertaining to a self in these four elements, then, Rāhula, that bhikkhu is said to have cut off craving, removed the fetters, and by the perfect penetration of conceit, has made an end to suffering.\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් රාහුල තෙරුන් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙකින් වාඩිවිය. එක් පසෙකින් වාඩි වී සිටි ආයුෂ්මත් රාහුල තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක –\n\n\"රාහුල, යම් අභ්‍යන්තර පඨවි ධාතුවක් ඇද්ද, යම් බාහිර පඨවි ධාතුවක් ඇද්ද, ඒ සියල්ල පඨවි ධාතුවමයි. 'ඒ මෙය මාගේ නොවේ, මම මේ නොවේ, මේ මාගේ ආත්මය නොවේ' යැයි, මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක්ක යුතුයි. මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක, පඨවි ධාතුව කෙරෙහි කලකිරෙයි, පඨවි ධාතුව කෙරෙහි සිතෙහි ආශාව දුරු කරයි.\n\n\"රාහුල, යම් අභ්‍යන්තර ආපෝ ධාතුවක් ඇද්ද, යම් බාහිර ආපෝ ධාතුවක් ඇද්ද, ඒ සියල්ල ආපෝ ධාතුවමයි. 'ඒ මෙය මාගේ නොවේ, මම මේ නොවේ, මේ මාගේ ආත්මය නොවේ' යැයි, මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක්ක යුතුයි. මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක, ආපෝ ධාතුව කෙරෙහි කලකිරෙයි, ආපෝ ධාතුව කෙරෙහි සිතෙහි ආශාව දුරු කරයි.\n\n\"රාහුල, යම් අභ්‍යන්තර තේජෝ ධාතුවක් ඇද්ද, යම් බාහිර තේජෝ ධාතුවක් ඇද්ද, ඒ සියල්ල තේජෝ ධාතුවමයි. 'ඒ මෙය මාගේ නොවේ, මම මේ නොවේ, මේ මාගේ ආත්මය නොවේ' යැයි, මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක්ක යුතුයි. මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක, තේජෝ ධාතුව කෙරෙහි කලකිරෙයි, තේජෝ ධාතුව කෙරෙහි සිතෙහි ආශාව දුරු කරයි.\n\n\"රාහුල, යම් අභ්‍යන්තර වායෝ ධාතුවක් ඇද්ද, යම් බාහිර වායෝ ධාතුවක් ඇද්ද, ඒ සියල්ල වායෝ ධාතුවමයි. 'ඒ මෙය මාගේ නොවේ, මම මේ නොවේ, මේ මාගේ ආත්මය නොවේ' යැයි, මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක්ක යුතුයි. මෙසේ මෙය යථාභූතව මනා ප්‍රඥාවෙන් දැක, වායෝ ධාතුව කෙරෙහි කලකිරෙයි, වායෝ ධාතුව කෙරෙහි සිතෙහි ආශාව දුරු කරයි.\n\n\"රාහුල, යම් හෙයකින් භික්ෂුවක් මේ සතර මහා ධාතූන් කෙරෙහි තමන්වත්, තමන්ට අයත් දෙයක්වත් නොදකියි නම්, රාහුල, මේ භික්ෂුව තණ්හාව සිඳ දැමුවේය, සංයෝජන දුරු කළේය, මැනවින් මානය අවබෝධ කොට දුකට කෙළවර කළේයැයි කියනු ලැබේ.\"",
      "paliTitle": "Rāhulasuttaṃ",
      "englishTitle": "Rāhula Sutta",
      "sinhalaTitle": "රාහුල සූත්‍රය"
    },
    {
      "number": 178,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So sakkāyanirodhaṃ manasi karoti. Tassa sakkāyanirodhaṃ manasi karoto sakkāyanirodhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati nādhimuccati. Tassa kho evaṃ [tassa ko etaṃ (sī. syā. kaṃ. pī.), evaṃ kho tassa (?) ‘‘evaṃ hi tassā bhikkhave jambāliyā’’ti pāṭho viya], bhikkhave, bhikkhuno na sakkāyanirodho pāṭikaṅkho. Seyyathāpi, bhikkhave, puriso lepagatena [lasagatena (sī. pī.)] hatthena sākhaṃ gaṇheyya, tassa so hattho sajjeyyapi gaṇheyyapi [gayheyyapi (?)] bajjheyyapi [khajjeyyapi (sī.)]; evamevaṃ kho, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So sakkāyanirodhaṃ manasi karoti. Tassa sakkāyanirodhaṃ manasi karoto sakkāyanirodhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati nādhimuccati. Tassa kho evaṃ, bhikkhave, bhikkhuno na sakkāyanirodho pāṭikaṅkho. ‘‘Idha pana, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So sakkāyanirodhaṃ manasi karoti. Tassa sakkāyanirodhaṃ manasi karoto sakkāyanirodhe cittaṃ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṃ, bhikkhave, bhikkhuno sakkāyanirodho pāṭikaṅkho. Seyyathāpi, bhikkhave, puriso suddhena hatthena sākhaṃ gaṇheyya, tassa so hattho neva sajjeyya na gaṇheyya na bajjheyya; evamevaṃ kho, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So sakkāyanirodhaṃ manasi karoti. Tassa sakkāyanirodhaṃ manasi karoto sakkāyanirodhe cittaṃ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṃ, bhikkhave, bhikkhuno sakkāyanirodho pāṭikaṅkho. ‘‘Idha pana, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So avijjāppabhedaṃ manasi karoti. Tassa avijjāppabhedaṃ manasi karoto avijjāppabhede cittaṃ na pakkhandati nappasīdati na santiṭṭhati nādhimuccati. Tassa kho evaṃ, bhikkhave, bhikkhuno na avijjāppabhedo pāṭikaṅkho. Seyyathāpi, bhikkhave, jambālī anekavassagaṇikā. Tassā puriso yāni ceva āyamukhāni tāni pidaheyya, yāni ca apāyamukhāni tāni vivareyya, devo ca na sammā dhāraṃ anuppaveccheyya. Evañhi tassā, bhikkhave, jambāliyā na āḷippabhedo pāṭikaṅkho. Evamevaṃ kho, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So avijjāppabhedaṃ manasi karoti. Tassa avijjāppabhedaṃ manasi karoto avijjāppabhede cittaṃ na pakkhandati nappasīdati na santiṭṭhati nādhimuccati. Tassa kho evaṃ, bhikkhave, bhikkhuno na avijjāppabhedo pāṭikaṅkho. ‘‘Idha pana, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So avijjāppabhedaṃ manasi karoti. Tassa avijjāppabhedaṃ manasi karoto avijjāppabhede cittaṃ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṃ, bhikkhave, bhikkhuno avijjāppabhedo pāṭikaṅkho. Seyyathāpi, bhikkhave, jambālī anekavassagaṇikā. Tassā puriso yāni ceva āyamukhāni tāni vivareyya, yāni ca apāyamukhāni tāni pidaheyya, devo ca sammā dhāraṃ anuppaveccheyya. Evañhi tassā, bhikkhave, jambāliyā āḷippabhedo pāṭikaṅkho. Evamevaṃ kho, bhikkhave, bhikkhu aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So avijjāppabhedaṃ manasi karoti. Tassa avijjāppabhedaṃ manasi karoto avijjāppabhede cittaṃ pakkhandati pasīdati santiṭṭhati adhimuccati. Tassa kho evaṃ, bhikkhave, bhikkhuno avijjāppabhedo pāṭikaṅkho. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ.",
      "english": "Monks, these four individuals exist, are found in the world. Which four?\n\nHere, monks, a monk dwells having attained a certain existing liberation of mind. He brings to mind the cessation of self-identity. As he brings to mind the cessation of self-identity, his mind does not leap forward into it, does not become serene, does not settle, and does not become resolute regarding it. Indeed, for such a monk, monks, the cessation of self-identity is not to be expected. Just as, monks, a man might grasp a branch with a hand smeared with sticky grime, and his hand would stick to it, adhere to it, become bound to it; just so, monks, here a monk dwells having attained a certain existing liberation of mind. He brings to mind the cessation of self-identity. As he brings to mind the cessation of self-identity, his mind does not leap forward into it, does not become serene, does not settle, and does not become resolute regarding it. Indeed, for such a monk, monks, the cessation of self-identity is not to be expected.\n\nBut here, monks, a monk dwells having attained a certain existing liberation of mind. He brings to mind the cessation of self-identity. As he brings to mind the cessation of self-identity, his mind leaps forward into it, becomes serene, settles, and becomes resolute regarding it. Indeed, for such a monk, monks, the cessation of self-identity is to be expected. Just as, monks, a man might grasp a branch with a clean hand, and his hand would neither stick to it, nor grasp it tightly, nor become bound to it; just so, monks, here a monk dwells having attained a certain existing liberation of mind. He brings to mind the cessation of self-identity. As he brings to mind the cessation of self-identity, his mind leaps forward into it, becomes serene, settles, and becomes resolute regarding it. Indeed, for such a monk, monks, the cessation of self-identity is to be expected.\n\nBut here, monks, a monk dwells having attained a certain existing liberation of mind. He brings to mind the eradication of ignorance. As he brings to mind the eradication of ignorance, his mind does not leap forward into it, does not become serene, does not settle, and does not become resolute regarding it. Indeed, for such a monk, monks, the eradication of ignorance is not to be expected. Just as, monks, there might be a swampy pond many years old. A man might close its inlets and open its outlets, and the sky would not send down rain showers properly. In that way, monks, the purification of that swampy pond is not to be expected. Just so, monks, here a monk dwells having attained a certain existing liberation of mind. He brings to mind the eradication of ignorance. As he brings to mind the eradication of ignorance, his mind does not leap forward into it, does not become serene, does not settle, and does not become resolute regarding it. Indeed, for such a monk, monks, the eradication of ignorance is not to be expected.\n\nBut here, monks, a monk dwells having attained a certain existing liberation of mind. He brings to mind the eradication of ignorance. As he brings to mind the eradication of ignorance, his mind leaps forward into it, becomes serene, settles, and becomes resolute regarding it. Indeed, for such a monk, monks, the eradication of ignorance is to be expected. Just as, monks, there might be a swampy pond many years old. A man might open its inlets and close its outlets, and the sky would send down rain showers properly. In that way, monks, the purification of that swampy pond is to be expected. Just so, monks, here a monk dwells having attained a certain existing liberation of mind. He brings to mind the eradication of ignorance. As he brings to mind the eradication of ignorance, his mind leaps forward into it, becomes serene, settles, and becomes resolute regarding it. Indeed, for such a monk, monks, the eradication of ignorance is to be expected.\n\nIndeed, monks, these are the four individuals who exist, are found in the world.",
      "sinhala": "භික්ෂූනි, ලෝකයෙහි සිටිනා, විද්‍යමාන පුද්ගලයෝ මේ සතර දෙනා වෙති. ඒ සිව් දෙනා කවරහුද? මෙහිලා එක් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම සක්කායනිරෝධය (සංසාර දුක් සමුදාය නැති කිරීම) මෙනෙහි කරයි. සක්කායනිරෝධය මෙනෙහි කරන්නා වූ ඔහුගේ සිත සක්කායනිරෝධය කෙරෙහි නොඇලී පවතී, පැහැදීමක් ඇති නොවේ, එහි නොසිටී, අධිමුක්තියක් ඇති නොවේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට සක්කායනිරෝධය බලාපොරොත්තු විය හැක්කක් නොවේ. භික්ෂූනි, යම් සේ පුරුෂයෙක් ආලේප ගෑවී ඇති අතකින් අත්තක් අල්ලා ගනී ද, ඔහුගේ ඒ අත එහි බැඳී, ඇලී, පැටලී සිටී ද; භික්ෂූනි, එපරිද්දෙන්ම යම් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම සක්කායනිරෝධය මෙනෙහි කරයි. සක්කායනිරෝධය මෙනෙහි කරන්නා වූ ඔහුගේ සිත සක්කායනිරෝධය කෙරෙහි නොඇලී පවතී, පැහැදීමක් ඇති නොවේ, එහි නොසිටී, අධිමුක්තියක් ඇති නොවේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට සක්කායනිරෝධය බලාපොරොත්තු විය හැක්කක් නොවේ.\n\nභික්ෂූනි, එහෙත් මෙහිලා එක් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම සක්කායනිරෝධය මෙනෙහි කරයි. සක්කායනිරෝධය මෙනෙහි කරන්නා වූ ඔහුගේ සිත සක්කායනිරෝධය කෙරෙහි ඇලී පවතී, පැහැදීමක් ඇති වේ, එහි සිටී, අධිමුක්තියක් ඇති වේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට සක්කායනිරෝධය බලාපොරොත්තු විය හැක්කකි. භික්ෂූනි, යම් සේ පුරුෂයෙක් පිරිසිදු අතකින් අත්තක් අල්ලා ගනී ද, ඔහුගේ ඒ අත එහි බැඳී නොසිටී ද, ඇලී නොපවතී ද, පැටලී නොසිටී ද; භික්ෂූනි, එපරිද්දෙන්ම යම් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම සක්කායනිරෝධය මෙනෙහි කරයි. සක්කායනිරෝධය මෙනෙහි කරන්නා වූ ඔහුගේ සිත සක්කායනිරෝධය කෙරෙහි ඇලී පවතී, පැහැදීමක් ඇති වේ, එහි සිටී, අධිමුක්තියක් ඇති වේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට සක්කායනිරෝධය බලාපොරොත්තු විය හැක්කකි.\n\nභික්ෂූනි, එහෙත් මෙහිලා එක් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරයි. අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරන්නා වූ ඔහුගේ සිත අවිද්‍යා ප්‍රහීණය කෙරෙහි නොඇලී පවතී, පැහැදීමක් ඇති නොවේ, එහි නොසිටී, අධිමුක්තියක් ඇති නොවේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට අවිද්‍යාව ප්‍රහීණ කිරීම බලාපොරොත්තු විය හැක්කක් නොවේ. භික්ෂූනි, යම් සේ බොහෝ වර්ෂ ගණනක් පැරණි, දිරාපත් වූ පොකුණක් වේ ද; පුරුෂයෙක් එහි ජලය ඇතුල් වන මාර්ග වසා දමයි ද, ජලය පිටවන මාර්ග විවෘත කරයි ද, වැස්ස ද මනාව ජල ධාරාව නොයවයි ද; භික්ෂූනි, එසේ වූ කල ඒ පොකුණ පිරිසිදු වීම (වර්ෂාවෙන් මඩ දිය සේදී යාම) බලාපොරොත්තු විය හැක්කක් නොවේ. භික්ෂූනි, එපරිද්දෙන්ම යම් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරයි. අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරන්නා වූ ඔහුගේ සිත අවිද්‍යා ප්‍රහීණය කෙරෙහි නොඇලී පවතී, පැහැදීමක් ඇති නොවේ, එහි නොසිටී, අධිමුක්තියක් ඇති නොවේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට අවිද්‍යාව ප්‍රහීණ කිරීම බලාපොරොත්තු විය හැක්කක් නොවේ.\n\nභික්ෂූනි, එහෙත් මෙහිලා එක් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරයි. අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරන්නා වූ ඔහුගේ සිත අවිද්‍යා ප්‍රහීණය කෙරෙහි ඇලී පවතී, පැහැදීමක් ඇති වේ, එහි සිටී, අධිමුක්තියක් ඇති වේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට අවිද්‍යාව ප්‍රහීණ කිරීම බලාපොරොත්තු විය හැක්කකි. භික්ෂූනි, යම් සේ බොහෝ වර්ෂ ගණනක් පැරණි, දිරාපත් වූ පොකුණක් වේ ද; පුරුෂයෙක් එහි ජලය ඇතුල් වන මාර්ග විවෘත කරයි ද, ජලය පිටවන මාර්ග වසා දමයි ද, වැස්ස ද මනාව ජල ධාරාව යවයි ද; භික්ෂූනි, එසේ වූ කල ඒ පොකුණ පිරිසිදු වීම (වර්ෂාවෙන් මඩ දිය සේදී යාම) බලාපොරොත්තු විය හැක්කකි. භික්ෂූනි, එපරිද්දෙන්ම යම් භික්ෂුවක් යම්කිසි ශාන්ත චේතෝවිමුක්තියකට පැමිණ වාසය කරයි. හෙතෙම අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරයි. අවිද්‍යාව ප්‍රහීණ කිරීම මෙනෙහි කරන්නා වූ ඔහුගේ සිත අවිද්‍යා ප්‍රහීණය කෙරෙහි ඇලී පවතී, පැහැදීමක් ඇති වේ, එහි සිටී, අධිමුක්තියක් ඇති වේ. භික්ෂූනි, මේ ආකාර වූ භික්ෂුවට අවිද්‍යාව ප්‍රහීණ කිරීම බලාපොරොත්තු විය හැක්කකි. භික්ෂූනි, මේ සිව් දෙනා ලෝකයෙහි සිටිනා, විද්‍යමාන පුද්ගලයන් වෙති.",
      "paliTitle": "Jambālīsuttaṃ",
      "englishTitle": "The Jambālī Discourse",
      "sinhalaTitle": "ජම්බාලී සූත්‍රය"
    },
    {
      "number": 179,
      "pali": "Atha kho āyasmā ānando yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘ko nu kho, āvuso sāriputta, hetu ko paccayo, yena midhekacce sattā diṭṭheva dhamme na parinibbāyantī’’ti? ‘‘Idhāvuso ānanda, sattā imā hānabhāgiyā saññāti yathābhūtaṃ nappajānanti, imā ṭhitibhāgiyā saññāti yathābhūtaṃ nappajānanti, imā visesabhāgiyā saññāti yathābhūtaṃ nappajānanti, imā nibbedhabhāgiyā saññāti yathābhūtaṃ nappajānanti. Ayaṃ kho, āvuso ānanda, hetu ayaṃ paccayo, yena midhekacce sattā diṭṭheva dhamme na parinibbāyantī’’ti. ‘‘Ko panāvuso sāriputta, hetu ko paccayo, yena midhekacce sattā diṭṭheva dhamme parinibbāyantī’’ti? ‘‘Idhāvuso ānanda, sattā imā hānabhāgiyā saññāti yathābhūtaṃ pajānanti, imā ṭhitibhāgiyā saññāti yathābhūtaṃ pajānanti, imā visesabhāgiyā saññāti yathābhūtaṃ pajānanti, imā nibbedhabhāgiyā saññāti yathābhūtaṃ pajānanti. Ayaṃ kho, āvuso ānanda, hetu ayaṃ paccayo, yena midhekacce sattā diṭṭheva dhamme parinibbāyantī’’ti. Navamaṃ.",
      "english": "Then the Venerable Ānanda approached the Venerable Sāriputta, and having approached, he exchanged greetings with the Venerable Sāriputta. Having concluded the courteous and memorable conversation, he sat down to one side. As he sat to one side, the Venerable Ānanda said this to the Venerable Sāriputta: “What, indeed, friend Sāriputta, is the cause, what is the condition, by which some beings here do not attain final liberation in this very life?” “Here, friend Ānanda, beings do not understand as they really are these perceptions conducive to decline; they do not understand as they really are these perceptions conducive to stability; they do not understand as they really are these perceptions conducive to distinction; they do not understand as they really are these perceptions conducive to penetration. This, indeed, friend Ānanda, is the cause, this is the condition, by which some beings here do not attain final liberation in this very life.”\n\n“What then, friend Sāriputta, is the cause, what is the condition, by which some beings here do attain final liberation in this very life?” “Here, friend Ānanda, beings understand as they really are these perceptions conducive to decline; they understand as they really are these perceptions conducive to stability; they understand as they really are these perceptions conducive to distinction; they understand as they really are these perceptions conducive to penetration. This, indeed, friend Ānanda, is the cause, this is the condition, by which some beings here do attain final liberation in this very life.”",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්ද තෙරණුවෝ ආයුෂ්මත් ශ්‍රී​පුත්‍ර තෙරණුවන් වෙත එළඹියහ. එළඹ, ආයුෂ්මත් ශ්‍රී​පුත්‍ර තෙරණුවන් සමඟ සතුටු සාකච්ඡා කළහ. සතුටු විය යුතු සිහි කටයුතු කතාබහක් පවත්වා, එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහිඳි ආයුෂ්මත් ආනන්ද තෙරණුවෝ ආයුෂ්මත් ශ්‍රී​පුත්‍ර තෙරණුවන්ට මෙය පැවසූහ – “ඇවැත් සාරිපුත්ත, මෙලොව ඇතැම් සත්ත්වයෝ මේ ආත්මභාවයේදීම පිරිනිවන් නොපාන්නට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?”\n\n“ඇවැත් ආනන්ද, මෙහිලා සත්ත්වයෝ මේ හානියට පමුණුවන සංඥාවන්, මේ ස්ථාවරත්වයට පමුණුවන සංඥාවන්, මේ උසස් භාවයට පමුණුවන සංඥාවන්, මේ නිර්වේදයට පමුණුවන සංඥාවන් යථාභූත ඥානයෙන් නොදනිත්. ඇවැත් ආනන්ද, යම් හෙයකින් මෙලොව ඇතැම් සත්ත්වයෝ මේ ආත්මභාවයේදීම පිරිනිවන් නොපාත්ද, මේ (නොදන්නාකම) ඊට හේතුවයි, ඊට ප්‍රත්‍යයයි.”\n\n“ඇවැත් සාරිපුත්ත, එසේ නම් මෙලොව ඇතැම් සත්ත්වයෝ මේ ආත්මභාවයේදීම පිරිනිවන් පාන්නට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?”\n\n“ඇවැත් ආනන්ද, මෙහිලා සත්ත්වයෝ මේ හානියට පමුණුවන සංඥාවන්, මේ ස්ථාවරත්වයට පමුණුවන සංඥාවන්, මේ උසස් භාවයට පමුණුවන සංඥාවන්, මේ නිර්වේදයට පමුණුවන සංඥාවන් යථාභූත ඥානයෙන් දනිත්. ඇවැත් ආනන්ද, යම් හෙයකින් මෙලොව ඇතැම් සත්ත්වයෝ මේ ආත්මභාවයේදීම පිරිනිවන් පාත්ද, මේ (දන්නාකම) ඊට හේතුවයි, ඊට ප්‍රත්‍යයයි.”",
      "paliTitle": "Nibbānasuttaṃ",
      "englishTitle": "The Nirvana Sutta",
      "sinhalaTitle": "නිබ්බාන සූත්‍රය"
    },
    {
      "number": 180,
      "pali": "Ekaṃ samayaṃ bhagavā bhoganagare viharati ānandacetiye [ānande cetiye (dī. ni. 2.186) mahāva. 303 pana aññathā āgataṃ]. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘cattārome, bhikkhave, mahāpadese desessāmi, taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katame, bhikkhave, cattāro mahāpadesā? Idha, bhikkhave, bhikkhu evaṃ vadeyya – ‘sammukhā metaṃ, āvuso, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni [osāretabbāni], vinaye sandassetabbāni. Tāni ce sutte otāriyamānāni [osāriyamānāni] vinaye sandassiyamānāni na ceva sutte otaranti [osaranti (dī. ni. 2.188)] na vinaye sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ na ceva tassa bhagavato vacanaṃ arahato sammāsambuddhassa; imassa ca bhikkhuno duggahita’nti. Iti hetaṃ [iti hidaṃ (sī. syā. kaṃ. ka.)], bhikkhave, chaḍḍeyyātha. [ettako pāṭho dīghanikāye na dissati, peyyālamukhena dassito bhaveyya] ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘sammukhā metaṃ, āvuso, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni, vinaye sandassetabbāni [ettako pāṭho dīghanikāye na dissati, peyyālamukhena dassito bhaveyya]. Tāni ce sutte otāriyamānāni vinaye sandassiyamānāni sutte ceva otaranti vinaye ca sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa; imassa ca bhikkhuno suggahita’nti. Idaṃ, bhikkhave, paṭhamaṃ mahāpadesaṃ dhāreyyātha. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘asukasmiṃ nāma āvāse saṅgho viharati sathero sapāmokkho. Tassa me saṅghassa sammukhā sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni, vinaye sandassetabbāni. Tāni ce sutte otāriyamānāni vinaye sandassiyamānāni na ceva sutte otaranti na vinaye sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ na ceva tassa bhagavato vacanaṃ arahato sammāsambuddhassa; tassa ca saṅghassa duggahita’nti. Iti hetaṃ, bhikkhave, chaḍḍeyyātha. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘asukasmiṃ nāma āvāse saṅgho viharati sathero sapāmokkho. Tassa me saṅghassa sammukhā sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni, vinaye sandassetabbāni. Tāni ce sutte otāriyamānāni, vinaye sandassiyamānāni sutte ceva otaranti vinaye ca sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa; tassa ca saṅghassa suggahita’nti. Idaṃ, bhikkhave, dutiyaṃ mahāpadesaṃ dhāreyyātha. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘asukasmiṃ nāma āvāse sambahulā therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā. Tesaṃ me therānaṃ sammukhā sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni, vinaye sandassetabbāni. Tāni ce sutte otāriyamānāni vinaye sandassiyamānāni na ceva sutte otaranti na vinaye sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ na ceva tassa bhagavato vacanaṃ arahato sammāsambuddhassa; tesañca therānaṃ duggahita’nti. Iti hetaṃ, bhikkhave, chaḍḍeyyātha. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘asukasmiṃ nāma āvāse sambahulā therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā. Tesaṃ me therānaṃ sammukhā sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni, vinaye sandassetabbāni. Tāni ce sutte otāriyamānāni vinaye sandassiyamānāni sutte ceva otaranti vinaye ca sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa; tesañca therānaṃ suggahita’nti. Idaṃ, bhikkhave, tatiyaṃ mahāpadesaṃ dhāreyyātha. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘asukasmiṃ nāma āvāse eko thero bhikkhu viharati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo. Tassa me therassa sammukhā sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni, vinaye sandassetabbāni. Tāni ce sutte otāriyamānāni vinaye sandassiyamānāni na ceva sutte otaranti na vinaye sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ na ceva tassa bhagavato vacanaṃ arahato sammāsambuddhassa; tassa ca therassa duggahita’nti. Iti hetaṃ, bhikkhave, chaḍḍeyyātha. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘asukasmiṃ nāma āvāse eko thero bhikkhu viharati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo. Tassa me therassa sammukhā sutaṃ sammukhā paṭiggahitaṃ – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsana’nti. Tassa, bhikkhave, bhikkhuno bhāsitaṃ neva abhinanditabbaṃ nappaṭikkositabbaṃ. Anabhinanditvā appaṭikkositvā tāni padabyañjanāni sādhukaṃ uggahetvā sutte otāretabbāni, vinaye sandassetabbāni. Tāni ce sutte otāriyamānāni vinaye sandassiyamānāni sutte ceva otaranti vinaye ca sandissanti, niṭṭhamettha gantabbaṃ – ‘addhā, idaṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa; tassa ca therassa suggahita’nti. Idaṃ, bhikkhave, catutthaṃ mahāpadesaṃ dhāreyyātha. Ime kho, bhikkhave, cattāro mahāpadesā’’ti. Dasamaṃ. ",
      "english": "At one time, the Blessed One was dwelling in Bhoganagara at the Ānanda Shrine. There, the Blessed One addressed the monks, saying, “Monks.” “Venerable Sir,” those monks replied to the Blessed One. The Blessed One said this: “Monks, I shall teach you these four Great References. Listen to them, attend carefully, I shall speak.” “Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One said this: “What, Monks, are the four Great References?”\n\nHere, monks, a monk might speak thus: “Friends, I have heard this directly from the Blessed One himself, I have received this directly from him – this is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.” Monks, that monk’s statement should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then compared against the Discourses, and verified by the Discipline. If, when compared against the Discourses and verified by the Discipline, they do not conform to the Discourses and do not appear in the Discipline, then this conclusion should be reached: “Certainly, this is not the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One; and this monk has misunderstood it.” Therefore, monks, you should reject that.\n\nBut here, monks, a monk might speak thus: “Friends, I have heard this directly from the Blessed One himself, I have received this directly from him – this is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.” Monks, that monk’s statement should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then compared against the Discourses, and verified by the Discipline. If, when compared against the Discourses and verified by the Discipline, they do conform to the Discourses and do appear in the Discipline, then this conclusion should be reached: “Certainly, this is the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One; and this monk has correctly understood it.” Monks, you should hold this as the first Great Reference.\n\nAgain, monks, a monk might speak thus: “In a certain dwelling place, a Sangha resides with its elders and its leader. I have heard this directly from that Sangha, I have received this directly from them – this is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.” Monks, that monk’s statement should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then compared against the Discourses, and verified by the Discipline. If, when compared against the Discourses and verified by the Discipline, they do not conform to the Discourses and do not appear in the Discipline, then this conclusion should be reached: “Certainly, this is not the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One; and that Sangha has misunderstood it.” Therefore, monks, you should reject that.\n\nAgain, monks, a monk might speak thus: “In a certain dwelling place, a Sangha resides with its elders and its leader. I have heard this directly from that Sangha, I have received this directly from them – this is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.” Monks, that monk’s statement should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then compared against the Discourses, and verified by the Discipline. If, when compared against the Discourses and verified by the Discipline, they do conform to the Discourses and do appear in the Discipline, then this conclusion should be reached: “Certainly, this is the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One; and that Sangha has correctly understood it.” Monks, you should hold this as the second Great Reference.\n\nAgain, monks, a monk might speak thus: “In a certain dwelling place, many elder monks reside who are learned, well-versed in the received traditions, knowers of the Dhamma, knowers of the Vinaya, and knowers of the Mother-texts. I have heard this directly from those elders, I have received this directly from them – this is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.” Monks, that monk’s statement should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then compared against the Discourses, and verified by the Discipline. If, when compared against the Discourses and verified by the Discipline, they do not conform to the Discourses and do not appear in the Discipline, then this conclusion should be reached: “Certainly, this is not the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One; and those elders have misunderstood it.” Therefore, monks, you should reject that.\n\nHere, bhikkhus, a bhikkhu might say: ‘In such-and-such a dwelling, many elder bhikkhus reside who are learned, conversant with the teachings, upholders of the Dhamma, upholders of the Vinaya, and upholders of the summaries of principles. From the presence of those elders, I have heard it directly and received it directly: ‘This is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.’ Bhikkhus, the statement of that bhikkhu should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then referred to the Sutta, and compared with the Vinaya. If, when being referred to the Sutta and compared with the Vinaya, they align with the Sutta and correspond with the Vinaya, then this conclusion should be reached: ‘Certainly, this is the word of the Blessed One, the Arahant, the Perfectly Enlightened One; and those elders have grasped it well.’ Bhikkhus, you should uphold this as the third Great Standard.\n\nHere, bhikkhus, a bhikkhu might say: ‘In such-and-such a dwelling, one elder bhikkhu resides who is learned, conversant with the teachings, an upholder of the Dhamma, an upholder of the Vinaya, and an upholder of the summaries of principles.’ From the presence of that elder, I have heard it directly and received it directly: ‘This is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.’ Bhikkhus, the statement of that bhikkhu should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then referred to the Sutta, and compared with the Vinaya. If, when being referred to the Sutta and compared with the Vinaya, they neither align with the Sutta nor correspond with the Vinaya, then this conclusion should be reached: ‘Certainly, this is not the word of the Blessed One, the Arahant, the Perfectly Enlightened One; and that elder has grasped it poorly.’ In that case, bhikkhus, you should cast it aside.\n\nHere, bhikkhus, a bhikkhu might say: ‘In such-and-such a dwelling, one elder bhikkhu resides who is learned, conversant with the teachings, an upholder of the Dhamma, an upholder of the Vinaya, and an upholder of the summaries of principles.’ From the presence of that elder, I have heard it directly and received it directly: ‘This is the Dhamma, this is the Vinaya, this is the Teacher’s Dispensation.’ Bhikkhus, the statement of that bhikkhu should neither be applauded nor rejected. Without applauding or rejecting, those words and phrases should be thoroughly learned and then referred to the Sutta, and compared with the Vinaya. If, when being referred to the Sutta and compared with the Vinaya, they align with the Sutta and correspond with the Vinaya, then this conclusion should be reached: ‘Certainly, this is the word of the Blessed One, the Arahant, the Perfectly Enlightened One; and that elder has grasped it well.’ Bhikkhus, you should uphold this as the fourth Great Standard. These, bhikkhus, are the four Great Standards.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ භෝගනගරයෙහි ආනන්ද චේතියෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට ආමන්ත්‍රණය කළහ: \"භික්ෂූණි,\" \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"භික්ෂූණි, මේ මහාපදේශ සතර මම ඔබට දේශනා කරන්නෙමි. එය අසන්න, මැනවින් සිතට ගන්න; මම දේශනා කරන්නෙමි.\" \"එසේය, වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"භික්ෂූණි, ඒ මහාපදේශ සතර කවරේද? භික්ෂූණි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියයි නම්: 'ඇවැත්නි, මෙය මට භාග්‍යවතුන් වහන්සේ ඉදිරියේ අසන ලද්දකි, ඉදිරියේ පිළිගන්නා ලද්දකි – මෙය ධර්මයයි, මෙය විනයයි, මෙය ශාස්තෘන් වහන්සේගේ ශාසනයයි' කියා. භික්ෂූණි, ඒ භික්ෂුවගේ ප්‍රකාශය අභිනන්දනය නොකළ යුත්තකි, ප්‍රතික්ෂේප නොකළ යුත්තකි. එය අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද සහ අකුරු මැනවින් උගෙන සූත්‍රයට ඇතුළු කළ යුතුය, විනයට පෙන්විය යුතුය. ඒ ඒවා සූත්‍රයට ඇතුළු කරන කල්හි, විනයට පෙන්වන කල්හි, සූත්‍රයට නොගැළපේ නම්, විනයට නොගැළපේ නම්, මෙහිදී මේ නිගමනයට පැමිණිය යුතුය: 'සැබවින්ම මෙය අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයක් නොවේ; මේ භික්ෂුව විසින් වැරදියට ග්‍රහණය කරගත් දෙයකි' කියා. භික්ෂූණි, එසේ නම් ඔබ මෙය අත්හැර දමන්න.\n\nනමුත් භික්ෂූණි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියයි නම්: 'ඇවැත්නි, මෙය මට භාග්‍යවතුන් වහන්සේ ඉදිරියේ අසන ලද්දකි, ඉදිරියේ පිළිගන්නා ලද්දකි – මෙය ධර්මයයි, මෙය විනයයි, මෙය ශාස්තෘන් වහන්සේගේ ශාසනයයි' කියා. භික්ෂූණි, ඒ භික්ෂුවගේ ප්‍රකාශය අභිනන්දනය නොකළ යුත්තකි, ප්‍රතික්ෂේප නොකළ යුත්තකි. එය අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද සහ අකුරු මැනවින් උගෙන සූත්‍රයට ඇතුළු කළ යුතුය, විනයට පෙන්විය යුතුය. ඒ ඒවා සූත්‍රයට ඇතුළු කරන කල්හි, විනයට පෙන්වන කල්හි, සූත්‍රයට ගැළපේ නම්, විනයට ගැළපේ නම්, මෙහිදී මේ නිගමනයට පැමිණිය යුතුය: 'සැබවින්ම මෙය අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයකි; මේ භික්ෂුව විසින් මැනවින් ග්‍රහණය කරගත් දෙයකි' කියා. භික්ෂූණි, මෙය පළමුවන මහාපදේශය ලෙස සිහි තබාගන්න.\n\nනමුත් භික්ෂූණි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියයි නම්: 'ඇවැත්නි, අසවල් නම් ආවාසයෙහි ස්ථවිර භික්ෂූන් සහ ප්‍රධාන භික්ෂුව සහිත සංඝයා වහන්සේලා වැඩවසති. ඒ සංඝයා වහන්සේලා ඉදිරියේ මට අසන ලද්දකි, ඉදිරියේ පිළිගන්නා ලද්දකි – මෙය ධර්මයයි, මෙය විනයයි, මෙය ශාස්තෘන් වහන්සේගේ ශාසනයයි' කියා. භික්ෂූණි, ඒ භික්ෂුවගේ ප්‍රකාශය අභිනන්දනය නොකළ යුත්තකි, ප්‍රතික්ෂේප නොකළ යුත්තකි. එය අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද සහ අකුරු මැනවින් උගෙන සූත්‍රයට ඇතුළු කළ යුතුය, විනයට පෙන්විය යුතුය. ඒ ඒවා සූත්‍රයට ඇතුළු කරන කල්හි, විනයට පෙන්වන කල්හි, සූත්‍රයට නොගැළපේ නම්, විනයට නොගැළපේ නම්, මෙහිදී මේ නිගමනයට පැමිණිය යුතුය: 'සැබවින්ම මෙය අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයක් නොවේ; ඒ සංඝයා වහන්සේලා විසින් වැරදියට ග්‍රහණය කරගත් දෙයකි' කියා. භික්ෂූණි, එසේ නම් ඔබ මෙය අත්හැර දමන්න.\n\nනමුත් භික්ෂූණි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියයි නම්: 'ඇවැත්නි, අසවල් නම් ආවාසයෙහි ස්ථවිර භික්ෂූන් සහ ප්‍රධාන භික්ෂුව සහිත සංඝයා වහන්සේලා වැඩවසති. ඒ සංඝයා වහන්සේලා ඉදිරියේ මට අසන ලද්දකි, ඉදිරියේ පිළිගන්නා ලද්දකි – මෙය ධර්මයයි, මෙය විනයයි, මෙය ශාස්තෘන් වහන්සේගේ ශාසනයයි' කියා. භික්ෂූණි, ඒ භික්ෂුවගේ ප්‍රකාශය අභිනන්දනය නොකළ යුත්තකි, ප්‍රතික්ෂේප නොකළ යුත්තකි. එය අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද සහ අකුරු මැනවින් උගෙන සූත්‍රයට ඇතුළු කළ යුතුය, විනයට පෙන්විය යුතුය. ඒ ඒවා සූත්‍රයට ඇතුළු කරන කල්හි, විනයට පෙන්වන කල්හි, සූත්‍රයට ගැළපේ නම්, විනයට ගැළපේ නම්, මෙහිදී මේ නිගමනයට පැමිණිය යුතුය: 'සැබවින්ම මෙය අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයකි; ඒ සංඝයා වහන්සේලා විසින් මැනවින් ග්‍රහණය කරගත් දෙයකි' කියා. භික්ෂූණි, මෙය දෙවන මහාපදේශය ලෙස සිහි තබාගන්න.\n\nනමුත් භික්ෂූණි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියයි නම්: 'ඇවැත්නි, අසවල් නම් ආවාසයෙහි බොහෝ ස්ථවිර භික්ෂූහු වැඩවසති; ඒ භික්ෂූහු බහුශ්‍රැතයෝය, ආගම දන්නෝය, ධර්මධරයෝය, විනයධරයෝය, මාතිකාධරයෝය. ඒ ස්ථවිරවරුන් ඉදිරියේ මට අසන ලද්දකි, ඉදිරියේ පිළිගන්නා ලද්දකි – මෙය ධර්මයයි, මෙය විනයයි, මෙය ශාස්තෘන් වහන්සේගේ ශාසනයයි' කියා. භික්ෂූණි, ඒ භික්ෂුවගේ ප්‍රකාශය අභිනන්දනය නොකළ යුත්තකි, ප්‍රතික්ෂේප නොකළ යුත්තකි. එය අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද සහ අකුරු මැනවින් උගෙන සූත්‍රයට ඇතුළු කළ යුතුය, විනයට පෙන්විය යුතුය. ඒ ඒවා සූත්‍රයට ඇතුළු කරන කල්හි, විනයට පෙන්වන කල්හි, සූත්‍රයට නොගැළපේ නම්, විනයට නොගැළපේ නම්, මෙහිදී මේ නිගමනයට පැමිණිය යුතුය: 'සැබවින්ම මෙය අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයක් නොවේ; ඒ ස්ථවිරවරුන් විසින් වැරදියට ග්‍රහණය කරගත් දෙයකි' කියා. භික්ෂූණි, එසේ නම් ඔබ මෙය අත්හැර දමන්න.\n\nමහණෙනි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියන්නේ නම්: ‘අසවල් නම් ආවාසයක බොහෝ ථේර භික්ෂූහු වෙසෙති. ඔවුහු බහුශ්‍රැතයෝ, ත්‍රිපිටකය දන්නාහු, ධර්මය දරන්නාහු, විනය දරන්නාහු, මාතිකා දරන්නාහු වෙති. මට ඒ ථේරවරුන් හමුවෙහි අසා, හමුවෙහි පිළිගෙන ඇත – මේ ධර්මයයි, මේ විනයයි, මේ ශාස්තෘන් වහන්සේගේ ශාසනයයි’ කියාය. මහණෙනි, ඒ භික්ෂුවගේ වචනය අභිනන්දනය නොකළ යුතුය, ප්‍රතික්ෂේප නොකළ යුතුය. අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද ව්‍යංජන මැනවින් ඉගෙන ගෙන, සූත්‍රයට අනුව විමසා බැලිය යුතු ය, විනයට අනුව සසඳා බැලිය යුතු ය. යම් හෙයකින් ඒ පද සූත්‍රයට අනුව විමසන කල්හිත්, විනයට අනුව සසඳන කල්හිත්, සූත්‍රයටත් ගැළපේ නම්, විනයටත් ගැළපේ නම්, මේ පිළිබඳව ස්ථිර නිගමනයකට එළඹිය යුතුය: ‘සැබැවින්ම, මේ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ වන ඒ භාග්‍යවතුන් වහන්සේගේ වචනයකි; ඒ ථේරවරුන් විසින් මැනවින් ග්‍රහණය කරගෙන ඇත’ කියාය. මහණෙනි, මෙය තුන්වන මහාපදේශය ලෙස දරාගන්න.\n\nමහණෙනි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියන්නේ නම්: ‘අසවල් නම් ආවාසයක එක් ථේර භික්ෂුවක් වෙසෙති. හෙතෙම බහුශ්‍රැතය, ත්‍රිපිටකය දන්නාය, ධර්මය දරන්නාය, විනය දරන්නාය, මාතිකා දරන්නාය. මට ඒ ථේරයන් වහන්සේ හමුවෙහි අසා, හමුවෙහි පිළිගෙන ඇත – මේ ධර්මයයි, මේ විනයයි, මේ ශාස්තෘන් වහන්සේගේ ශාසනයයි’ කියාය. මහණෙනි, ඒ භික්ෂුවගේ වචනය අභිනන්දනය නොකළ යුතුය, ප්‍රතික්ෂේප නොකළ යුතුය. අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද ව්‍යංජන මැනවින් ඉගෙන ගෙන, සූත්‍රයට අනුව විමසා බැලිය යුතු ය, විනයට අනුව සසඳා බැලිය යුතු ය. යම් හෙයකින් ඒ පද සූත්‍රයට අනුව විමසන කල්හිත්, විනයට අනුව සසඳන කල්හිත්, සූත්‍රයටත් නොගැළපේ නම්, විනයටත් නොගැළපේ නම්, මේ පිළිබඳව ස්ථිර නිගමනයකට එළඹිය යුතුය: ‘සැබැවින්ම, මේ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ වන ඒ භාග්‍යවතුන් වහන්සේගේ වචනයක් නොවේ; ඒ ථේරයන් වහන්සේ විසින් වැරදි ලෙස ග්‍රහණය කරගෙන ඇත’ කියාය. මහණෙනි, මෙය එසේ නම්, ඔබ එය අත්හැරිය යුතුය.\n\nමහණෙනි, මෙහිලා යම් භික්ෂුවක් මෙසේ කියන්නේ නම්: ‘අසවල් නම් ආවාසයක එක් ථේර භික්ෂුවක් වෙසෙති. හෙතෙම බහුශ්‍රැතය, ත්‍රිපිටකය දන්නාය, ධර්මය දරන්නාය, විනය දරන්නාය, මාතිකා දරන්නාය. මට ඒ ථේරයන් වහන්සේ හමුවෙහි අසා, හමුවෙහි පිළිගෙන ඇත – මේ ධර්මයයි, මේ විනයයි, මේ ශාස්තෘන් වහන්සේගේ ශාසනයයි’ කියාය. මහණෙනි, ඒ භික්ෂුවගේ වචනය අභිනන්දනය නොකළ යුතුය, ප්‍රතික්ෂේප නොකළ යුතුය. අභිනන්දනය නොකොට, ප්‍රතික්ෂේප නොකොට, ඒ පද ව්‍යංජන මැනවින් ඉගෙන ගෙන, සූත්‍රයට අනුව විමසා බැලිය යුතු ය, විනයට අනුව සසඳා බැලිය යුතු ය. යම් හෙයකින් ඒ පද සූත්‍රයට අනුව විමසන කල්හිත්, විනයට අනුව සසඳන කල්හිත්, සූත්‍රයටත් ගැළපේ නම්, විනයටත් ගැළපේ නම්, මේ පිළිබඳව ස්ථිර නිගමනයකට එළඹිය යුතුය: ‘සැබැවින්ම, මේ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ වන ඒ භාග්‍යවතුන් වහන්සේගේ වචනයකි; ඒ ථේරයන් වහන්සේ විසින් මැනවින් ග්‍රහණය කරගෙන ඇත’ කියාය. මහණෙනි, මෙය සතරවන මහාපදේශය ලෙස දරාගන්න. මහණෙනි, මේවා ඒ සතර මහාපදේශයෝ යි. දසවැනිය.",
      "paliTitle": "Mahāpadesasuttaṃ",
      "englishTitle": "The Great References Discourse",
      "sinhalaTitle": "මහාපදේස සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sañcetaniyavaggo tatiyo. Tassuddānaṃ – Cetanā vibhatti koṭṭhiko, ānando upavāṇapañcamaṃ; Āyācana-rāhula-jambālī, nibbānaṃ mahāpadesenāti.",
    "english": "The Third Section on Intention",
    "sinhala": "තුන්වන සඤ්‍චේතනීය වග්ගය"
  }
}