{
  "id": "an4.4",
  "title": {
    "pali": "Cakkavaggo",
    "english": "The Chapter on Wheels",
    "sinhala": "චක්ක වග්ගය"
  },
  "sections": [
    {
      "number": 31,
      "pali": "‘‘Cattārimāni, bhikkhave, cakkāni, yehi samannāgatānaṃ devamanussānaṃ catucakkaṃ vattati, yehi samannāgatā devamanussā nacirasseva mahantattaṃ vepullattaṃ pāpuṇanti bhogesu. Katamāni cattāri? Patirūpadesavāso, sappurisāvassayo [sappurisūpassayo (sī. syā. kaṃ. pī.)], attasammāpaṇidhi, pubbe ca katapuññatā – imāni kho, bhikkhave, cattāri cakkāni, yehi samannāgatānaṃ devamanussānaṃ catucakkaṃ vattati, yehi samannāgatā devamanussā nacirasseva mahantattaṃ vepullattaṃ pāpuṇanti bhogesū’’ti. ‘‘Patirūpe vase dese, ariyamittakaro siyā; Sammāpaṇidhisampanno, pubbe puññakato naro; Dhaññaṃ dhanaṃ yaso kitti, sukhañcetaṃdhivattatī’’ti. paṭhamaṃ;",
      "english": "Monks, these are the four wheels, by possessing which, the four-wheeled chariot of devas and humans proceeds, by possessing which, devas and humans swiftly attain greatness and abundance in their resources. Which are these four? Residing in a suitable region, associating with admirable people, right self-application, and having performed meritorious deeds in the past. Monks, these are the four wheels, by possessing which, the four-wheeled chariot of devas and humans proceeds, by possessing which, devas and humans swiftly attain greatness and abundance in their resources.\n\nA person who dwells in a suitable region, who associates with noble friends, who is endowed with right self-application, and who has performed meritorious deeds in the past— for such a person, grain, wealth, fame, glory, and happiness all flourish and abound.",
      "sinhala": "භික්ෂූණි, මේ සතර චක්‍රයෝ වෙති. යම් චක්‍රයන්ගෙන් යුක්ත වූ දෙවි මිනිසුන්ට මේ සතර චක්‍රයෝ ක්‍රියාත්මක වෙත්ද, යම් චක්‍රයන්ගෙන් යුක්ත වූ දෙවි මිනිස්සු වැඩි කලක් නොගොස් භෝග සම්පත් වලින් මහත් බවටත්, විපුල බවටත් පැමිණෙත්ද. ඒ සතර කුමක්ද? ප්‍රතිරූප දේශයක වාසය කිරීම, සත්පුරුෂ ඇසුර, තමාම නිවැරදි ලෙස පිහිටුවා ගැනීම, පෙර කරන ලද පින්කම් යන මේවාය. භික්ෂූණි, මේ සතර චක්‍රයෝම වෙත්, යම් චක්‍රයන්ගෙන් යුක්ත වූ දෙවි මිනිසුන්ට මේ සතර චක්‍රයෝ ක්‍රියාත්මක වෙත්ද, යම් චක්‍රයන්ගෙන් යුක්ත වූ දෙවි මිනිස්සු වැඩි කලක් නොගොස් භෝග සම්පත් වලින් මහත් බවටත්, විපුල බවටත් පැමිණෙත්ද.\n\nසුදුසු දේශයක වාසය කරන, ආර්ය මිත්‍රයන් ඇති කරගත්, තමා මැනවින් පිහිටුවා ගත්, පෙර පින් කළ මිනිසාට ධාන්‍ය, ධනය, යසස, කීර්තිය සහ සැපයද යන මේ සියල්ල ඉහළ යයි.",
      "paliTitle": "Cakkasuttaṃ"
    },
    {
      "number": 32,
      "pali": "‘‘Cattārimāni, bhikkhave, saṅgahavatthūni. Katamāni cattāri? Dānaṃ, peyyavajjaṃ, atthacariyā, samānattatā – imāni kho, bhikkhave, cattāri saṅgahavatthūnī’’ti. ‘‘Dānañca peyyavajjañca [saṅgahe (aṭṭhakathāyaṃ pāṭhantaraṃ) dī. ni. 3.273 passitabbaṃ], atthacariyā ca yā idha; Samānattatā ca dhammesu, tattha tattha yathārahaṃ; Ete kho saṅgahā loke, rathassāṇīva yāyato. ‘‘Ete ca saṅgahā nāssu, na mātā puttakāraṇā; Labhetha mānaṃ pūjaṃ vā, pitā vā puttakāraṇā. ‘‘Yasmā ca saṅgahā [saṅgahe (aṭṭhakathāyaṃ pāṭhantaraṃ) dī. ni. 3.273 passitabbaṃ] ete, samavekkhanti paṇḍitā; Tasmā mahattaṃ papponti, pāsaṃsā ca bhavanti te’’ti. dutiyaṃ;",
      "english": "Monks, there are these four bases of social cohesion. Which four? Generosity, kind speech, conduct for others' welfare, and impartiality – these, monks, are the four bases of social cohesion.\n\nGenerosity, and kind speech, and that conduct for others' welfare which exists here, along with impartiality among beings, each according to what is appropriate: these indeed are the bases of cohesion in the world, like the linchpin of a moving chariot.\n\nIf these bases of cohesion were not present, a mother would not receive honor or respect from her child, nor would a father from his child.\n\nAnd because the wise carefully observe these bases of cohesion, therefore they attain greatness and become praiseworthy.",
      "sinhala": "භික්ෂූණි, මේ සංග්‍රහ වස්තු සතරකි. කවරේද ඒ සතර? දීම (දානය), ප්‍රිය වචන කතා කිරීම, අර්ථ චර්යාව (අනුන්ට අර්ථ වන ලෙස හැසිරීම), හා සමානත්වයෙන් කටයුතු කිරීම (සමහට සලකන ලෙස සැලකීම) – භික්ෂූණි, මේ සතර සංග්‍රහ වස්තූන්ය.\n\nමේ ලෝකයෙහි දානයත්, ප්‍රිය වචනයත්, යහපත කිරීමත්, ඒ ඒ තැන්හි යෝග්‍ය ලෙස (අනුන් සමග) සම බවත් යන මේ සංග්‍රහයන් ගමන් කරනා රථයක අක්ෂයට ඇණයක් බඳුය.\n\nමේ සංග්‍රහයන් නොවූයේ නම්, මවට පුතා නිසාද, පියාට පුතා නිසාද ගෞරවයක් හෝ පූජාවක් නොලැබෙන්නේය.\n\nයම් හෙයකින් පණ්ඩිතයෝ මේ සංග්‍රහයන් මනාව සලකා බලත්ද, එහෙයින් ඔවුහු මහත් බවට පැමිණෙත්, ප්‍රශංසා ලැබීමටද සුදුසු වෙත්.",
      "paliTitle": "Saṅgahasuttaṃ"
    },
    {
      "number": 33,
      "pali": "‘‘Sīho, bhikkhave, migarājā sāyanhasamayaṃ āsayā nikkhamati. Āsayā nikkhamitvā vijambhati. Vijambhitvā samantā catuddisā anuviloketi. Samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadati. Tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamati. Ye kho pana te, bhikkhave, tiracchānagatā pāṇā sīhassa migarañño nadato saddaṃ suṇanti, te yebhuyyena bhayaṃ saṃvegaṃ santāsaṃ āpajjanti. Bilaṃ bilāsayā pavisanti, dakaṃ dakāsayā [udakaṃ udakāsayā (ka.) saṃ. ni. 3.78; paṭi. ma. aṭṭha. 1.1.37 passitabbaṃ] pavisanti, vanaṃ vanāsayā pavisanti, ākāsaṃ pakkhino bhajanti. Yepi te, bhikkhave, rañño nāgā gāmanigamarājadhānīsu daḷhehi varattehi bandhanehi baddhā, tepi tāni bandhanāni sañchinditvā sampadāletvā bhītā muttakarīsaṃ cajamānā yena vā tena vā palāyanti. Evaṃ mahiddhiko kho, bhikkhave, sīho migarājā tiracchānagatānaṃ pāṇānaṃ, evaṃ mahesakkho evaṃ mahānubhāvo. ‘‘Evamevaṃ kho, bhikkhave, yadā tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā, so dhammaṃ deseti – ‘iti sakkāyo, iti sakkāyasamudayo, iti sakkāyanirodho [sakkāyassa atthaṅgamo (aṭṭha., saṃ. ni. 3.78) ‘‘sakkāyanirodhagāminī’’ti pacchimapadaṃ pana passitabbaṃ], iti sakkāyanirodhagāminī paṭipadā’ti. Yepi te, bhikkhave, devā dīghāyukā vaṇṇavanto sukhabahulā uccesu vimānesu ciraṭṭhitikā, tepi tathāgatassa dhammadesanaṃ sutvā yebhuyyena bhayaṃ saṃvegaṃ santāsaṃ āpajjanti – ‘aniccā vata kira, bho, mayaṃ samānā niccamhāti amaññimha; addhuvā vata kira, bho, mayaṃ samānā dhuvamhāti amaññimha; asassatā vata kira, bho, mayaṃ samānā sassatamhāti amaññimha. Mayaṃ kira, bho, aniccā addhuvā asassatā sakkāyapariyāpannā’ti. Evaṃ mahiddhiko kho, bhikkhave, tathāgato sadevakassa lokassa, evaṃ mahesakkho evaṃ mahānubhāvo’’ti. ‘‘Yadā buddho abhiññāya, dhammacakkaṃ pavattayī; Sadevakassa lokassa, satthā appaṭipuggalo. ‘‘Sakkāyañca nirodhañca, sakkāyassa ca sambhavaṃ; Ariyañcaṭṭhaṅgikaṃ maggaṃ, dukkhūpasamagāminaṃ. ‘‘Yepi dīghāyukā devā, vaṇṇavanto yasassino; Bhītā santāsamāpāduṃ, sīhassevi’taremigā. ‘‘Avītivattā sakkāyaṃ, aniccā kira bho mayaṃ; Sutvā arahato vākyaṃ, vippamuttassa tādino’’ti [saṃ. ni. 3.78]. tatiyaṃ;",
      "english": "Monks, the lion, king of beasts, emerges from its lair in the evening. Having emerged from its lair, it stretches. Having stretched, it surveys all four directions. Having surveyed all four directions, it lets out its lion's roar three times. Having roared three times, it sets out for its hunting ground. Indeed, monks, those creatures that are animals, when they hear the sound of the roaring lion, king of beasts, they are mostly overcome by fear, agitation, and terror. Those dwelling in holes enter their holes; those dwelling in water enter the water; those dwelling in the forest enter the forest; birds take to the sky. Even those royal elephants, monks, that are bound in villages, towns, and royal capitals with strong ropes and fetters, they too, terrified, break and tear apart those bonds, discharge their urine and dung, and flee in whatever direction they can. Such, monks, is the great power, the great might, and the great influence of the lion, king of beasts, over animals.\n\nJust so, monks, when a Tathāgata arises in the world – an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, a Fortunate One, knower of the worlds, an unsurpassed guide for those who wish to be trained, a teacher of gods and humans, the Buddha, the Blessed One – he teaches the Dhamma: ‘Such is self-identification, such is the origin of self-identification, such is the cessation of self-identification, and such is the path leading to the cessation of self-identification.’ Even those gods, monks, who are long-lived, beautiful, and abound in happiness, who abide for a long time in lofty celestial mansions, they too, having heard the Tathāgata’s teaching of the Dhamma, are mostly overcome by fear, agitation, and terror, thinking: ‘Alas, we who are truly impermanent imagined ourselves to be permanent; we who are truly unstable imagined ourselves to be stable; we who are truly non-eternal imagined ourselves to be eternal. Indeed, we are impermanent, unstable, non-eternal, and subject to self-identification!’ Such, monks, is the great power, the great might, and the great influence of the Tathāgata over the world with its deities.\n\nWhen the Buddha, having realized perfect knowledge, set in motion the Wheel of Dhamma,\nThe Teacher, unparalleled, for the world with its deities,\nTaught self-identification and its cessation, and the arising of self-identification,\nAnd the Noble Eightfold Path, leading to the calming of suffering.\nEven those long-lived gods, radiant and renowned,\nWere struck with fear and terror, just as other animals are by the lion.\n‘Alas, we are impermanent, unable to transcend self-identification!’ they thought,\nHaving heard the words of the Arahant, the Imperturbable One, who is fully liberated.",
      "sinhala": "භික්ෂූණි, මෘගරාජ සිංහයා සවස් කාලයෙහි තම වාසස්ථානයෙන් පිටතට පැමිණෙයි. තම වාසස්ථානයෙන් පිටතට පැමිණ ඇඟපත දිගහැර විහිදෙයි. ඇඟපත දිගහැර සිව් දිශාවම විමර්ශනය කරයි. සිව් දිශාවම විමර්ශනය කොට තුන් වරක් සිංහනාද නාද කරයි. තුන් වරක් සිංහනාද නාද කොට ගොදුරු සොයා පිටත්ව යයි. භික්ෂූණි, යම් තිරශ්චීනගත ප්‍රාණීහු මෘගරාජ සිංහයාගේ නාදය අසත්ද, ඔවුහු බොහෝ සෙයින් බියට, සංවේගයට, තැතිගැන්මකට පත් වෙති. බිලෙහි වසන්නෝ බිලට පිවිසෙති. දියෙහි වසන්නෝ දියට පිවිසෙති. වනයෙහි වසන්නෝ වනයට පිවිසෙති. පක්ෂීහු අහසට පියාසර කරති. භික්ෂූණි, ගම්, නියම්ගම්, රාජධානිවල තදින් තැලූම් කඹවලින් බැඳ සිටින යම් රජුන්ගේ ඇතෝ වෙත්ද, ඔවුහු ද ඒ බැඳුම් සිඳ බිඳ දමා, බියට පත්ව, මුත්‍රා මල පහ කරමින් ඒ මේ අත පලා යති. භික්ෂූණි, මෘගරාජ සිංහයා තිරශ්චීනගත ප්‍රාණීන් හට මෙසේ මහත් ඍද්ධි ඇත්තෝය, මෙසේ මහානුභාවසම්පන්නය, මෙසේ මහත් බල සම්පන්නය.\n\nභික්ෂූණි, එලෙසම යම් කලෙක ලොවෙහි රහත් වූ, සම්‍යක් සම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලෝකය අවබෝධ කළ, අනුත්තර වූ පුරුෂයන් දමනය කිරීමේ සාරථී වූ, දෙවි මිනිසුන්ට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ පහළ වෙත්ද, උන්වහන්සේ මෙසේ ධර්මය දේශනා කරති – ‘මෙය සක්කායයි, මෙය සක්කාය සමුදයයි, මෙය සක්කාය නිරෝධයයි, මෙය සක්කාය නිරෝධයට පමුණුවන ප්‍රතිපදාවයි’ කියා. භික්ෂූණි, යම් දීර්ඝායුෂ ඇති, වර්ණවත් වූ, බොහෝ සැප ඇති, උස් වූ විමානවල බොහෝ කල් සිටින දෙවිවරු වෙත්ද, ඔවුහු ද තථාගතයන් වහන්සේගේ ධර්ම දේශනාව අසා, බොහෝ සෙයින් බියට, සංවේගයට, තැතිගැන්මකට පත් වෙති – ‘අනේ, අපි අනිත්‍යව සිටියදී, නිත්‍යයි කියා සිතුවෙමු! අනේ, අපි අස්ථිරව සිටියදී, ස්ථිරයි කියා සිතුවෙමු! අනේ, අපි අශාශ්වතව සිටියදී, ශාශ්වතයි කියා සිතුවෙමු! අනේ, අපි අනිත්‍ය වූ, අස්ථිර වූ, අශාශ්වත වූ සක්කායයට අයත් වූවෝම වෙමු’යි. භික්ෂූණි, තථාගතයන් වහන්සේ දෙවියන් සහිත ලෝකයට මෙසේ මහත් ඍද්ධි ඇත්තෝය, මෙසේ මහානුභාවසම්පන්නය, මෙසේ මහත් බල සම්පන්නය.\n\nයම් කලෙක බුදුරජාණන් වහන්සේ සියලු දේ තමන් වහන්සේගේ අභිඥා ඥානයෙන් අවබෝධ කොට ධර්මචක්‍රය ප්‍රවර්තනය කළ සේක්ද, එකල්හි දෙවියන් සහිත ලෝකයට ශාස්තෘ වූ, උපමාවක් රහිත වූ උන්වහන්සේ සක්කායත් නිරෝධයත්, සක්කායයේ සමුදයත්, දුක්ඛෝපශමනයට යන ආර්ය අෂ්ටාංගික මාර්ගයත් දේශනා කළ සේක. දීර්ඝායුෂ ඇති, වර්ණවත් වූ, යසස් ඇති යම් දෙවිවරු වෙත්ද, ඔවුහු සිංහයාට අනිත් මෘගයන් මෙන් බියටත් තැතිගැන්මටත් පත් වූහ. සක්කාය ඉක්මවා නොගිය ඔවුන්, විප්‍රමුක්ත වූ, තථාගත වූ, රහතන් වහන්සේගේ වචනය අසා, ‘අනේ, අපි අනිත්‍යයෝ වෙමු’යි තේරුම් ගත්හ.",
      "paliTitle": "Sīhasuttaṃ"
    },
    {
      "number": 34,
      "pali": "‘‘Cattārome, bhikkhave, aggappasādā. Katame cattāro? Yāvatā, bhikkhave, sattā apadā vā dvipadā [dipadā (sī. pī.) a. ni. 5.32; itivu. 90] vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññināsaññino vā, tathāgato tesaṃ aggamakkhāyati arahaṃ sammāsambuddho. Ye, bhikkhave, buddhe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, bhikkhave, dhammā saṅkhatā, ariyo aṭṭhaṅgiko maggo tesaṃ aggamakkhāyati. Ye, bhikkhave, ariye aṭṭhaṅgike magge pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, bhikkhave, dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ aggamakkhāyati, yadidaṃ madanimmadano pipāsavinayo ālayasamugghāto vaṭṭupacchedo taṇhākkhayo virāgo nirodho nibbānaṃ. Ye, bhikkhave, virāge dhamme pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, bhikkhave, saṅghā vā gaṇā vā, tathāgatasāvakasaṅgho tesaṃ aggamakkhāyati, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Ye, bhikkhave, saṅghe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. Ime kho, bhikkhave, cattāro aggappasādā’’ti. ‘‘Aggato ve pasannānaṃ, aggaṃ dhammaṃ vijānataṃ; Agge buddhe pasannānaṃ, dakkhiṇeyye anuttare. ‘‘Agge dhamme pasannānaṃ, virāgūpasame sukhe; Agge saṅghe pasannānaṃ, puññakkhette anuttare. ‘‘Aggasmiṃ dānaṃ dadataṃ, aggaṃ puññaṃ pavaḍḍhati; Aggaṃ āyu ca vaṇṇo ca, yaso kitti sukhaṃ balaṃ. ‘‘Aggassa dātā medhāvī, aggadhammasamāhito; Devabhūto manusso vā, aggappatto pamodatī’’ti [itivu. 90]. catutthaṃ;",
      "english": "These four, monastics, are supreme acts of confidence. What are these four?\n\nAs far as beings exist, monastics, whether footless or two-footed, or four-footed, or many-footed; whether with form or formless; whether percipient or non-percipient, or neither-percipient-nor-non-percipient, the Tathagata, the Arahant, the Perfectly Self-Enlightened One, is declared to be the supreme among them. Those, monastics, who have confidence in the Buddha, have confidence in the Supreme. And for those who have confidence in the Supreme, a supreme result arises.\n\nAs far as fabricated phenomena exist, monastics, the Noble Eightfold Path is declared to be the supreme among them. Those, monastics, who have confidence in the Noble Eightfold Path, have confidence in the Supreme. And for those who have confidence in the Supreme, a supreme result arises.\n\nAs far as fabricated or unfabricated phenomena exist, monastics, dispassion is declared to be the supreme among them, namely, the subduing of intoxication, the removal of thirst, the uprooting of attachment, the cutting off of the cycle of existence, the destruction of craving, dispassion, cessation, Nibbāna. Those, monastics, who have confidence in the phenomenon of dispassion, have confidence in the Supreme. And for those who have confidence in the Supreme, a supreme result arises.\n\nAs far as communities or groups exist, monastics, the Community of the Tathagata's Disciples is declared to be the supreme among them, namely, the four pairs of men, the eight individual noble persons. This Community of the Blessed One's Disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and is the unsurpassed field of merit for the world. Those, monastics, who have confidence in the Sangha, have confidence in the Supreme. And for those who have confidence in the Supreme, a supreme result arises. These, monastics, are the four supreme acts of confidence.\n\nFor those who have confidence in the Supreme, who understand the supreme Dhamma,\nfor those who have confidence in the Supreme Buddha, the unsurpassed, worthy of offerings.\n\nFor those who have confidence in the Supreme Dhamma, which is dispassion, calm, and happiness,\nfor those who have confidence in the Supreme Sangha, the unsurpassed field of merit.\n\nGiving a gift to the Supreme, supreme merit increases;\nsupreme life and beauty, fame, renown, happiness, and strength.\n\nThe wise giver to the Supreme, endowed with the supreme Dhamma,\nwhether reborn as a deity or a human, attains the supreme and rejoices.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ උතුම් ප්‍රසාදයන් සතරක් ඇත. ඒ සතර කවරේද? භික්ෂූන් වහන්ස, පද රහිත හෝ ද්විපද හෝ සිව්පද හෝ බහුපද හෝ රූපී හෝ අරූපී හෝ සඥ්ඥී හෝ අසඥ්ඥී හෝ නේවසඥ්ඥානාසඥ්ඥී හෝ යම්තාක් සත්ත්වයෝ වෙත්ද, ඒ සියල්ලන් අතර අරහත් වූ සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ උතුම්ම යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, යමෙක් බුදුරජාණන් වහන්සේ කෙරෙහි ප්‍රසන්න වන්නේද, ඔහු උතුම් තැනැත්තා කෙරෙහි ප්‍රසන්න වෙයි. උතුම් තැනැත්තා කෙරෙහි ප්‍රසන්න වූවන්ට උතුම් විපාකයක් ලැබෙයි.\n\nභික්ෂූන් වහන්ස, යම්තාක් සංඛත ධර්මයන් ඇත්ද, ඒ සියල්ලන් අතර ආර්ය අෂ්ටාංගික මාර්ගය උතුම්ම යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, යමෙක් ආර්ය අෂ්ටාංගික මාර්ගය කෙරෙහි ප්‍රසන්න වන්නේද, ඔහු උතුම් ධර්මය කෙරෙහි ප්‍රසන්න වෙයි. උතුම් ධර්මය කෙරෙහි ප්‍රසන්න වූවන්ට උතුම් විපාකයක් ලැබෙයි.\n\nභික්ෂූන් වහන්ස, යම්තාක් සංඛත හෝ අසංඛත ධර්මයන් ඇත්ද, ඒ සියල්ලන් අතර විරාගය උතුම්ම යැයි කියනු ලැබේ. එනම්, මද මර්දනය කිරීම, පිපාසය දුරු කිරීම, ආලය සමුච්ඡේදනය කිරීම, වට්ට ප්‍රච්ඡේදනය කිරීම, තණ්හා ක්ෂය කිරීම, විරාගය, නිරෝධය, නිර්වාණයයි. භික්ෂූන් වහන්ස, යමෙක් විරාග ධර්මය කෙරෙහි ප්‍රසන්න වන්නේද, ඔහු උතුම් ධර්මය කෙරෙහි ප්‍රසන්න වෙයි. උතුම් ධර්මය කෙරෙහි ප්‍රසන්න වූවන්ට උතුම් විපාකයක් ලැබෙයි.\n\nභික්ෂූන් වහන්ස, යම්තාක් සංඝයෝ හෝ ගණ සමූහයෝ හෝ ඇත්ද, ඒ සියල්ලන් අතර තථාගතයන් වහන්සේගේ ශ්‍රාවක සංඝයා වහන්සේ උතුම්ම යැයි කියනු ලැබේ. එනම්, සතර පුරුෂ යුගලයෝද, අට පුරිස පුද්ගලයෝද වන භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා වහන්සේ ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අංජලිකරණීය වන අතර, ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රයක්ද වෙති. භික්ෂූන් වහන්ස, යමෙක් සංඝයා වහන්සේ කෙරෙහි ප්‍රසන්න වන්නේද, ඔහු උතුම් තැනැත්තන් කෙරෙහි ප්‍රසන්න වෙයි. උතුම් තැනැත්තන් කෙරෙහි ප්‍රසන්න වූවන්ට උතුම් විපාකයක් ලැබෙයි. භික්ෂූන් වහන්ස, මේ උතුම් ප්‍රසාදයන් සතරයි.\n\nඋතුම් වූ ධර්මය දන්නා වූ, උතුම් දේ කෙරෙහි ප්‍රසන්න වූවන්ට,\nඅනුත්තර වූ, දක්ෂිණාර්හ බුදුරජාණන් වහන්සේ කෙරෙහි ප්‍රසන්න වූවන්ට;\nවිරාගය හා උපශමයට හේතු වූ සුඛය ඇති උතුම් ධර්මය කෙරෙහි ප්‍රසන්න වූවන්ට;\nඅනුත්තර පුණ්‍යක්ෂේත්‍රය වූ උතුම් සංඝයා වහන්සේ කෙරෙහි ප්‍රසන්න වූවන්ට;\nඋතුම් දේට දන් දෙන්නන්ට උතුම් පින වර්ධනය වෙයි;\nඋතුම් ආයුෂද, වර්ණයද, යසසද, කීර්තියද, සැපයද, බලයද (ලැබෙයි).\nඋතුම් දේ දෙන්නා වූ ප්‍රඥාවන්තයා, උතුම් ධර්මයෙහි පිහිටි තැනැත්තා,\nදෙවියකු බවට පත් වී හෝ මිනිසකු බවට පත් වී හෝ උතුම් දේට පැමිණ ප්‍රමුදිත වෙයි.",
      "paliTitle": "Aggappasādasuttaṃ"
    },
    {
      "number": 35,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṃ etadavoca – ‘‘Catūhi kho mayaṃ, bho gotama, dhammehi samannāgataṃ mahāpaññaṃ mahāpurisaṃ paññāpema. Katamehi catūhi? Idha, bho gotama, bahussuto hoti tassa tasseva sutajātassa tassa tasseva kho pana bhāsitassa atthaṃ jānāti – ‘ayaṃ imassa bhāsitassa attho, ayaṃ imassa bhāsitassa attho’ti. Satimā kho pana hoti cirakatampi cirabhāsitampi saritā anussaritā yāni kho pana tāni gahaṭṭhakāni kiṃkaraṇīyāni, tattha dakkho hoti analaso, tatrupāyāya vīmaṃsāya samannāgato alaṃ kātuṃ alaṃ saṃvidhātuṃ. Imehi kho mayaṃ, bho gotama, catūhi dhammehi samannāgataṃ mahāpaññaṃ mahāpurisaṃ paññāpema. Sace me [sace pana me (sī. ka.), sace me pana (pī.)], bho gotama, anumoditabbaṃ anumodatu me bhavaṃ gotamo; sace pana me, bho gotama, paṭikkositabbaṃ paṭikkosatu me bhavaṃ gotamo’’ti. ‘‘Neva kho tyāhaṃ, brāhmaṇa, anumodāmi na paṭikkosāmi. Catūhi kho ahaṃ, brāhmaṇa, dhammehi samannāgataṃ mahāpaññaṃ mahāpurisaṃ paññāpemi. Katamehi catūhi? Idha, brāhmaṇa, bahujanahitāya paṭipanno hoti bahujanasukhāya; bahussa janatā ariye ñāye patiṭṭhāpitā, yadidaṃ kalyāṇadhammatā kusaladhammatā. So yaṃ vitakkaṃ ākaṅkhati vitakketuṃ taṃ vitakkaṃ vitakketi, yaṃ vitakkaṃ nākaṅkhati vitakketuṃ na taṃ vitakkaṃ vitakketi; yaṃ saṅkappaṃ ākaṅkhati saṅkappetuṃ taṃ saṅkappaṃ saṅkappeti, yaṃ saṅkappaṃ nākaṅkhati saṅkappetuṃ na taṃ saṅkappaṃ saṅkappeti. Iti cetovasippatto hoti vitakkapathe. Catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Neva kho tyāhaṃ, brāhmaṇa, anumodāmi na pana paṭikkosāmi. Imehi kho ahaṃ, brāhmaṇa, catūhi dhammehi samannāgataṃ mahāpaññaṃ mahāpurisaṃ paññāpemī’’ti. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāva subhāsitaṃ cidaṃ bhotā gotamena. Imehi ca mayaṃ, bho gotama, catūhi dhammehi samannāgataṃ bhavantaṃ gotamaṃ dhārema; bhavañhi gotamo bahujanahitāya paṭipanno bahujanasukhāya; bahu te [bahussa (syā. kaṃ. ka.)] janatā ariye ñāye patiṭṭhāpitā, yadidaṃ kalyāṇadhammatā kusaladhammatā. Bhavañhi gotamo yaṃ vitakkaṃ ākaṅkhati vitakketuṃ taṃ vitakkaṃ vitakketi, yaṃ vitakkaṃ nākaṅkhati vitakketuṃ na taṃ vitakkaṃ vitakketi, yaṃ saṅkappaṃ ākaṅkhati saṅkappetuṃ taṃ saṅkappaṃ saṅkappeti, yaṃ saṅkappaṃ nākaṅkhati saṅkappetuṃ na taṃ saṅkappaṃ saṅkappeti. Bhavañhi gotamo cetovasippatto vitakkapathe. Bhavañhi gotamo catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī. Bhavañhi gotamo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. ‘‘Addhā kho tyāhaṃ, brāhmaṇa, āsajja upanīya vācā bhāsitā. Api ca, tyāhaṃ byākarissāmi – ‘ahañhi, brāhmaṇa, bahujanahitāya paṭipanno bahujanasukhāya; bahu me [bahussa (syā. kaṃ. ka.)] janatā ariye ñāye patiṭṭhāpitā, yadidaṃ kalyāṇadhammatā kusaladhammatā. Ahañhi, brāhmaṇa, yaṃ vitakkaṃ ākaṅkhāmi vitakketuṃ taṃ vitakkaṃ vitakkemi, yaṃ vitakkaṃ nākaṅkhāmi vitakketuṃ na taṃ vitakkaṃ vitakkemi, yaṃ saṅkappaṃ ākaṅkhāmi saṅkappetuṃ taṃ saṅkappaṃ saṅkappemi, yaṃ saṅkappaṃ nākaṅkhāmi saṅkappetuṃ na taṃ saṅkappaṃ saṅkappemi. Ahañhi, brāhmaṇa, cetovasippatto vitakkapathe. Ahañhi, brāhmaṇa, catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī. Ahañhi, brāhmaṇa, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmī’’’ti. ‘‘Yo vedi sabbasattānaṃ, maccupāsappamocanaṃ; Hitaṃ devamanussānaṃ, ñāyaṃ dhammaṃ pakāsayi; Yaṃ ve disvā ca sutvā ca, pasīdanti bahū janā [pasīdati bahujjano (sī. syā. kaṃ. pī.)]. ‘‘Maggāmaggassa kusalo, katakicco anāsavo; Buddho antimasārīro [antimadhārito (ka.)], ‘‘(mahāpañño) [( ) syā. potthake natthi] mahāpurisoti vuccatī’’ti. pañcamaṃ;",
      "english": "At one time, the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. Then the brahmin Vassakāra, the chief minister of Magadha, approached the Blessed One; and having approached, he exchanged greetings with the Blessed One. Having concluded the customary and courteous talk, he sat down to one side.\n\nSeated to one side, the brahmin Vassakāra, the chief minister of Magadha, said to the Blessed One: \"Venerable Gotama, we define a great man of great wisdom as one endowed with four qualities. Which four? Here, Venerable Gotama, he is extensively learned, and he knows the meaning of what he has heard and what has been spoken, saying, 'This is the meaning of this statement, this is the meaning of that statement.' Furthermore, he is mindful, recalling and remembering what was done and said long ago. As for his household duties and responsibilities, he is skillful and diligent, not lazy, endowed with discerning inquiry into the means of carrying them out, capable of doing them and capable of organizing them. Venerable Gotama, we define a great man of great wisdom as one endowed with these four qualities. If, Venerable Gotama, this is to be approved, may Venerable Gotama approve of it; if, Venerable Gotama, it is to be rejected, may Venerable Gotama reject it.\"\n\n\"Brahmin, I neither approve of it nor reject it. Brahmin, I define a great man of great wisdom as one endowed with four qualities. Which four? Here, Brahmin, he is devoted to the welfare of many people, to the happiness of many people; many people are established by him in the noble method, that is to say, in the practice of wholesome and skillful qualities. He thinks whatever thought he wishes to think, and does not think whatever thought he does not wish to think; he resolves whatever intention he wishes to resolve, and does not resolve whatever intention he does not wish to resolve. Thus, he has attained mastery over the pathways of thought. He is one who obtains at will, without difficulty or trouble, the four jhānas, which are of the higher mind and are a pleasant dwelling in this very life. Through the destruction of the taints, he dwells having realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom. Brahmin, I neither approve of your definition nor reject it. Brahmin, I define a great man of great wisdom as one endowed with these four qualities.\"\n\n\"Amazing, Venerable Gotama! Astounding, Venerable Gotama! How well spoken this is by Venerable Gotama! And we hold Venerable Gotama to be endowed with these four qualities, Venerable Gotama. For Venerable Gotama is devoted to the welfare of many people, to the happiness of many people; many people are established by you in the noble method, that is to say, in the practice of wholesome and skillful qualities. For Venerable Gotama thinks whatever thought he wishes to think, and does not think whatever thought he does not wish to think; he resolves whatever intention he wishes to resolve, and does not resolve whatever intention he does not wish to resolve. For Venerable Gotama has attained mastery over the pathways of thought. For Venerable Gotama is one who obtains at will, without difficulty or trouble, the four jhānas, which are of the higher mind and are a pleasant dwelling in this very life. For Venerable Gotama, through the destruction of the taints, dwells having realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom.\"\n\n\"Indeed, Brahmin, you have spoken with deference and brought praise. Nevertheless, I shall declare to you: 'Brahmin, I am devoted to the welfare of many people, to the happiness of many people; many people are established by me in the noble method, that is to say, in the practice of wholesome and skillful qualities. Brahmin, I think whatever thought I wish to think, and do not think whatever thought I do not wish to think; I resolve whatever intention I wish to resolve, and do not resolve whatever intention I do not wish to resolve. Brahmin, I have attained mastery over the pathways of thought. Brahmin, I am one who obtains at will, without difficulty or trouble, the four jhānas, which are of the higher mind and are a pleasant dwelling in this very life. Brahmin, through the destruction of the taints, I dwell having realized for myself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom.'\"\n\nHe who knows the release from the snares of death for all beings;\nwho declared the Dharma, the method beneficial to gods and humans;\nhaving seen and heard which, many people become serene.\n\nOne who is skilled in discerning the path from the non-path, whose task is done, who is free from defilements – such a Buddha, bearing the final body, possessed of great wisdom, is called a Great Being.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලන්දකනිවාප නම් ස්ථානයේ වැඩසිටියහ. ඉක්බිති මගධ රාජ්‍යයේ මහාමාත්‍යවරයෙකු වූ වස්සකාර බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ පිළිසඳර කතා කළේය. ප්‍රියමනාප වූද, සිහි කටයුතු වූද පිළිසඳර කතා පවත්වා ඔහු එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි ඒ වස්සකාර බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භවත් ගෞතමයින් වහන්ස, අපි ධර්ම සතරකින් යුක්ත වූ මහා ප්‍රඥාවන්ත මහා පුරුෂයෙකු හඳුන්වා දෙමු. ඒ ධර්ම සතර කවරේද? භවත් ගෞතමයින් වහන්ස, මෙහිලා යම් කෙනෙක් බහුශ්‍රැත වේද, ඒ ඒ ශ්‍රවණය කළ දේ වල, ඒ ඒ කතා කරන ලද දේ වල අර්ථය දනී. ‘මේ දේශනාවේ මෙය අර්ථයයි, මේ දේශනාවේ මෙය අර්ථයයි’ යනුවෙන් (ඔහු දනී). තවද ඔහු සිහි කටයුතු පුද්ගලයෙකි. බොහෝ කලක් කරන ලද දේ වුවද, බොහෝ කලක් කතා කරන ලද දේ වුවද සිහි කරන්නේය, නැවත සිහිපත් කරන්නේය. ගෘහස්ථයන්ට කළ යුතු යම් යම් කටයුතු ඇත්තේද, ඒ කටයුතු සම්බන්ධයෙන් දක්ෂ වන්නේය, කම්මැලි නැත්තේය. ඒ කටයුතු කිරීමට සමත්, සංවිධානය කිරීමට සමත්, ඒ සඳහා යොමු වූ විමර්ශන ශක්තියකින් යුක්ත වන්නේය. භවත් ගෞතමයින් වහන්ස, අපි මේ ධර්ම සතරකින් යුක්ත වූ මහා ප්‍රඥාවන්ත මහා පුරුෂයෙකු හඳුන්වා දෙමු. භවත් ගෞතමයින් වහන්ස, මා අනුමත කළ යුතු නම්, භවත් ගෞතමයින් වහන්සේ මා අනුමත කරත්වා; මා ප්‍රතික්ෂේප කළ යුතු නම්, භවත් ගෞතමයින් වහන්සේ මා ප්‍රතික්ෂේප කරත්වා!”\n\n“බ්‍රාහ්මණය, මම ඔබ අනුමත කරන්නේද නැත, ප්‍රතික්ෂේප කරන්නේද නැත. බ්‍රාහ්මණය, මම නම් ධර්ම සතරකින් යුක්ත වූ මහා ප්‍රඥාවන්ත මහා පුරුෂයෙකු හඳුන්වා දෙමි. ඒ ධර්ම සතර කවරේද? බ්‍රාහ්මණය, මෙහිලා යම් කෙනෙක් බොහෝ ජනයාගේ යහපත පිණිස, බොහෝ ජනයාගේ සුවය පිණිස පිළිපදින්නේය. බොහෝ පිරිසක් ආර්ය ඤාණයෙහි පිහිටුවා ඇත, එනම් කල්‍යාණ ධර්මතාවයෙහිද, කුසල ධර්මතාවයෙහිද. ඔහු යම් විතර්කයක් විතර්ක කිරීමට කැමති වන්නේද, ඒ විතර්කය විතර්ක කරන්නේය. යම් විතර්කයක් විතර්ක කිරීමට කැමති නොවේද, ඒ විතර්කය විතර්ක නොකරන්නේය. යම් සංකල්පයක් සංකල්ප කිරීමට කැමති වන්නේද, ඒ සංකල්පය සංකල්ප කරන්නේය. යම් සංකල්පයක් සංකල්ප කිරීමට කැමති නොවේද, ඒ සංකල්පය සංකල්ප නොකරන්නේය. මේ අයුරින් ඔහු විතර්ක මාර්ගයෙහි සිතෙහි වසඟ බවට පැමිණියේ වෙයි. අභිචෛතසික වූද, මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිස පවතින සතර ධ්‍යානයන් කැමති පරිදි ලැබීමට සමත් වන්නේය, දුකකින් තොරව ලැබීමට සමත් වන්නේය, අපහසුවකින් තොරව ලැබීමට සමත් වන්නේය. ආශ්‍රවයන් ක්ෂය වීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තියද, ප්‍රඥා විමුක්තියද මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරන්නේය. බ්‍රාහ්මණය, මම ඔබ අනුමත කරන්නේද නැත, ප්‍රතික්ෂේප කරන්නේද නැත. බ්‍රාහ්මණය, මම නම් මේ ධර්ම සතරකින් යුක්ත වූ මහා ප්‍රඥාවන්ත මහා පුරුෂයෙකු හඳුන්වා දෙමි.”\n\n“භවත් ගෞතමයින් වහන්ස, ආශ්චර්යයකි! භවත් ගෞතමයින් වහන්ස, පුදුම සහගතය! භවත් ගෞතමයින් වහන්සේ විසින් කෙතරම් මනාව දේශනා කරනු ලැබුවාද! භවත් ගෞතමයින් වහන්ස, අපි නම් භවත් ගෞතමයින් වහන්සේ මේ ධර්ම සතරකින් යුක්ත යැයි සලකමු. මක්නිසාද යත්, භවත් ගෞතමයින් වහන්සේ බොහෝ ජනයාගේ යහපත පිණිස, බොහෝ ජනයාගේ සුවය පිණිස පිළිපදින්නෙකි. බොහෝ පිරිසක් ආර්ය ඤාණයෙහි පිහිටුවා ඇත, එනම් කල්‍යාණ ධර්මතාවයෙහිද, කුසල ධර්මතාවයෙහිද. භවත් ගෞතමයින් වහන්සේ යම් විතර්කයක් විතර්ක කිරීමට කැමති වන්නේද, ඒ විතර්කය විතර්ක කරන්නේය. යම් විතර්කයක් විතර්ක කිරීමට කැමති නොවේද, ඒ විතර්කය විතර්ක නොකරන්නේය. යම් සංකල්පයක් සංකල්ප කිරීමට කැමති වන්නේද, ඒ සංකල්පය සංකල්ප කරන්නේය. යම් සංකල්පයක් සංකල්ප කිරීමට කැමති නොවේද, ඒ සංකල්පය සංකල්ප නොකරන්නේය. භවත් ගෞතමයින් වහන්සේ විතර්ක මාර්ගයෙහි සිතෙහි වසඟ බවට පැමිණියේ වෙයි. භවත් ගෞතමයින් වහන්සේ අභිචෛතසික වූද, මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිස පවතින සතර ධ්‍යානයන් කැමති පරිදි, දුකකින් තොරව, අපහසුවකින් තොරව ලැබීමට සමත් වන්නේය. භවත් ගෞතමයින් වහන්සේ ආශ්‍රවයන් ක්ෂය වීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තියද, ප්‍රඥා විමුක්තියද මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරන්නේය.”\n\n“බ්‍රාහ්මණය, ඇත්ත වශයෙන්ම ඔබ මා අරභයා ගෞරවයෙන් හා උසස් කොට කතා කළේය. එසේ නමුත්, මම ඔබ වෙනුවෙන් ප්‍රකාශ කරමි - ‘බ්‍රාහ්මණය, ඇත්ත වශයෙන්ම මම බොහෝ ජනයාගේ යහපත පිණිස, බොහෝ ජනයාගේ සුවය පිණිස පිළිපදින්නෙක්මි. බොහෝ පිරිසක් මා විසින් ආර්ය ඤාණයෙහි පිහිටුවා ඇත, එනම් කල්‍යාණ ධර්මතාවයෙහිද, කුසල ධර්මතාවයෙහිද. බ්‍රාහ්මණය, ඇත්ත වශයෙන්ම මම යම් විතර්කයක් විතර්ක කිරීමට කැමති වන්නෙම්ද, ඒ විතර්කය විතර්ක කරමි. යම් විතර්කයක් විතර්ක කිරීමට කැමති නොවන්නෙම්ද, ඒ විතර්කය විතර්ක නොකරමි. යම් සංකල්පයක් සංකල්ප කිරීමට කැමති වන්නෙම්ද, ඒ සංකල්පය සංකල්ප කරමි. යම් සංකල්පයක් සංකල්ප කිරීමට කැමති නොවන්නෙම්ද, ඒ සංකල්පය සංකල්ප නොකරමි. බ්‍රාහ්මණය, ඇත්ත වශයෙන්ම මම විතර්ක මාර්ගයෙහි සිතෙහි වසඟ බවට පැමිණියෙම් වෙමි. බ්‍රාහ්මණය, ඇත්ත වශයෙන්ම මම අභිචෛතසික වූද, මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිස පවතින සතර ධ්‍යානයන් කැමති පරිදි, දුකකින් තොරව, අපහසුවකින් තොරව ලැබීමට සමත් වන්නෙම් වෙමි. බ්‍රාහ්මණය, ඇත්ත වශයෙන්ම මම ආශ්‍රවයන් ක්ෂය වීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තියද, ප්‍රඥා විමුක්තියද මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරන්නෙම් වෙමි.’\n\nසියලු සත්වයන් මරණ බන්ධනයෙන් මුදාලීම කුමක්දැයි අවබෝධ කරගත්, දෙවි මිනිසුන්ගේ යහපත පිණිස වූ ආර්ය ධර්මය ප්‍රකාශ කළ, යමක් දැකීමෙන්ද ශ්‍රවණය කිරීමෙන්ද බොහෝ ජනයා පහදින්නා වූ (ඒ භාග්‍යවතුන් වහන්සේ).\n\nමාර්ගය සහ අමාර්ගය පිළිබඳව කුසල වූ, සියලු කටයුතු නිම කළ, ආශ්‍ර‍වයන්ගෙන් තොර වූ, අවසාන ශරීරය දැරූ බුදුරජාණන් වහන්සේ මහපුරුෂයා යැයි කියනු ලැබේ.",
      "paliTitle": "Vassakārasuttaṃ"
    },
    {
      "number": 36,
      "pali": "Ekaṃ samayaṃ bhagavā antarā ca ukkaṭṭhaṃ antarā ca setabyaṃ addhānamaggappaṭipanno hoti. Doṇopi sudaṃ brāhmaṇo antarā ca ukkaṭṭhaṃ antarā ca setabyaṃ addhānamaggappaṭipanno hoti. Addasā kho doṇo brāhmaṇo bhagavato pādesu cakkāni sahassārāni sanemikāni sanābhikāni sabbākāraparipūrāni; disvānassa etadahosi – ‘‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Na vatimāni manussabhūtassa padāni bhavissantī’’ti!! Atha kho bhagavā maggā okkamma aññatarasmiṃ rukkhamūle nisīdi pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. Atha kho doṇo brāhmaṇo bhagavato padāni anugacchanto addasa bhagavantaṃ aññatarasmiṃ rukkhamūle nisinnaṃ pāsādikaṃ pasādanīyaṃ santindriyaṃ santamānasaṃ uttamadamathasamathamanuppattaṃ dantaṃ guttaṃ saṃyatindriyaṃ [yatindriyaṃ (mahāva. 257)] nāgaṃ. Disvāna yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘Devo no bhavaṃ bhavissatī’’ti? ‘‘Na kho ahaṃ, brāhmaṇa, devo bhavissāmī’’ti. ‘‘Gandhabbo no bhavaṃ bhavissatī’’ti? ‘‘Na kho ahaṃ, brāhmaṇa, gandhabbo bhavissāmī’’ti. ‘‘Yakkho no bhavaṃ bhavissatī’’ti? ‘‘Na kho ahaṃ, brāhmaṇa, yakkho bhavissāmī’’ti. ‘‘Manusso no bhavaṃ bhavissatī’’ti? ‘‘Na kho ahaṃ, brāhmaṇa, manusso bhavissāmī’’ti. ‘‘‘Devo no bhavaṃ bhavissatī’ti, iti puṭṭho samāno – ‘na kho ahaṃ, brāhmaṇa, devo bhavissāmī’ti vadesi. ‘Gandhabbo no bhavaṃ bhavissatī’ti, iti puṭṭho samāno – ‘na kho ahaṃ, brāhmaṇa, gandhabbo bhavissāmī’ti vadesi. ‘Yakkho no bhavaṃ bhavissatī’ti, iti puṭṭho samāno – ‘na kho ahaṃ, brāhmaṇa, yakkho bhavissāmī’ti vadesi. ‘Manusso no bhavaṃ bhavissatī’ti, iti puṭṭho samāno – ‘na kho ahaṃ, brāhmaṇa, manusso bhavissāmī’ti vadesi. Atha ko carahi bhavaṃ bhavissatī’’ti? ‘‘Yesaṃ kho ahaṃ, brāhmaṇa, āsavānaṃ appahīnattā devo bhaveyyaṃ, te me āsavā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Yesaṃ kho ahaṃ, brāhmaṇa, āsavānaṃ appahīnattā gandhabbo bhaveyyaṃ… yakkho bhaveyyaṃ… manusso bhaveyyaṃ, te me āsavā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Seyyathāpi, brāhmaṇa, uppalaṃ vā padumaṃ vā puṇḍarīkaṃ vā udake jātaṃ udake saṃvaḍḍhaṃ udakā accuggamma tiṭṭhati anupalittaṃ udakena; evamevaṃ kho ahaṃ, brāhmaṇa, loke jāto loke saṃvaḍḍho lokaṃ abhibhuyya viharāmi anupalitto lokena. Buddhoti maṃ, brāhmaṇa, dhārehī’’ti. ‘‘Yena devūpapatyassa, gandhabbo vā vihaṅgamo; Yakkhattaṃ yena gaccheyyaṃ, manussattañca abbaje; Te mayhaṃ, āsavā khīṇā, viddhastā vinaḷīkatā. ‘‘Puṇḍarīkaṃ yathā vaggu, toyena nupalippati [nupalimpati (ka.)]; Nupalippāmi [nupalimpāmi (ka.)] lokena, tasmā buddhosmi brāhmaṇā’’ti. chaṭṭhaṃ;",
      "english": "At one time, the Blessed One was traveling on the road between Ukkaṭṭhā and Setabyā. Indeed, Doṇa the brahmin was also traveling on the road between Ukkaṭṭhā and Setabyā. Then Doṇa the brahmin saw the wheel marks on the Blessed One's feet, complete with a thousand spokes, rims, and hubs, perfect in every detail. Seeing them, he thought: ‘How amazing, sirs! How wondrous, sirs! These cannot be the footprints of a human being!’\n\nThen the Blessed One turned off the road and sat down at the root of a certain tree, having folded his legs crosswise, set his body upright, and established mindfulness in front of him.\n\nThen Doṇa the brahmin, following the Blessed One’s footprints, saw the Blessed One sitting at the root of a certain tree, inspiring confidence, delightful to behold, with tranquil senses, with a tranquil mind, having attained the highest taming and tranquility, restrained, guarded, with his faculties utterly subdued, like a great elephant. Seeing him, he approached the Blessed One; having approached, he said to the Blessed One: ‘Will your good self be a deva (a god)?’\n\n‘I will not be a deva, brahmin,’ said the Blessed One.\n\n‘Will your good self be a gandhabba (a heavenly musician)?’\n\n‘I will not be a gandhabba, brahmin,’ said the Blessed One.\n\n‘Will your good self be a yakkha (a spirit/demon)?’\n\n‘I will not be a yakkha, brahmin,’ said the Blessed One.\n\n‘Will your good self be a man (a human being)?’\n\n‘I will not be a man, brahmin,’ said the Blessed One.\n\n‘When asked, “Will your good self be a deva?”, you said, “I will not be a deva, brahmin.” When asked, “Will your good self be a gandhabba?”, you said, “I will not be a gandhabba, brahmin.” When asked, “Will your good self be a yakkha?”, you said, “I will not be a yakkha, brahmin.” When asked, “Will your good self be a man?”, you said, “I will not be a man, brahmin.” Then what indeed will your good self be?’\n\n‘Brahmin, those defilements (āsavā) by virtue of whose not having been abandoned I would be a deva – those defilements have been abandoned by me, cut off at the root, made like a palm-stump, brought to non-existence, and are incapable of arising again in the future. Brahmin, those defilements by virtue of whose not having been abandoned I would be a gandhabba… a yakkha… a man – those defilements have been abandoned by me, cut off at the root, made like a palm-stump, brought to non-existence, and are incapable of arising again in the future. Just as, brahmin, a blue water-lily, or a lotus, or a white water-lily, born in water, grown in water, rises above the water and remains unsullied by the water; even so, brahmin, though born in the world, grown in the world, I have overcome the world and abide unsullied by the world. Remember me, brahmin, as the Buddha.’\n\n‘Those defilements by which one becomes a deva, or a gandhabba, a winged one; those by which one would reach the state of a yakkha, or attain humanity; those defilements are for me destroyed, shattered, uprooted. Just as a beautiful white water-lily is not stained by water; I am not stained by the world, therefore, brahmin, I am the Buddha.’",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ උක්කට්ඨා නගරයත්, සේතබ්‍යා නගරයත් අතර මහා මාර්ගයෙහි ගමන් කරමින් සිටියහ. ද්‍රෝණ බ්‍රාහ්මණයාද උක්කට්ඨා නගරයත්, සේතබ්‍යා නගරයත් අතර මහා මාර්ගයෙහි ගමන් කරමින් සිටියේය. ද්‍රෝණ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේගේ පාදවල දහසක් අර සහිත, නාභිය හා නෙමිය සහිත, සියලු අයුරින් සම්පූර්ණ වූ චක්‍ර ලක්ෂණ දුටුවේය. දැකීමෙන් ඔහුට මෙය සිතුණි: “ආශ්චර්යයකි, පුදුමයකි! මේවා මනුෂ්‍යයෙකුගේ පා සටහන් විය නොහැක!”\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ මාර්ගයෙන් ඉවත්ව එක්තරා ගස් මුලක පර්යංකයක් බැඳගෙන, සෘජු කය පිහිටුවා, සිහිය මුහුණට එළවාගෙන වැඩ හිඳ ගත්හ. ඉක්බිති ද්‍රෝණ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේගේ පා සටහන් අනුව යමින්, එක්තරා ගස් මුලක වැඩ හිඳ සිටි භාග්‍යවතුන් වහන්සේව දුටුවේය. උන්වහන්සේ දැකීමට ප්‍රිය උපදවන, පහන් කරවන ස්වභාවයෙන් යුක්ත වූ සේක. ඉඳුරන් සන්සුන් වූ සේක, සිත සන්සුන් වූ සේක. උතුම් දමනයෙන් හා සංසිඳවීමෙන් උපරිමයට පැමිණි, දමනය කරන ලද, ආරක්‍ෂා කරන ලද, ඉඳුරන් සංවර කරන ලද, ආශ්‍රව රහිත නාගයකු බඳු වූ සේක. දැක භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “පින්වත් ඔබ දෙවියෙක් වෙයිද?”\n\n“බ්‍රාහ්මණය, මම දෙවියෙක් නොවෙමි.”\n“පින්වත් ඔබ ගන්ධර්වයෙක් වෙයිද?”\n“බ්‍රාහ්මණය, මම ගන්ධර්වයෙක් නොවෙමි.”\n“පින්වත් ඔබ යක්ෂයෙක් වෙයිද?”\n“බ්‍රාහ්මණය, මම යක්ෂයෙක් නොවෙමි.”\n“පින්වත් ඔබ මනුෂ්‍යයෙක් වෙයිද?”\n“බ්‍රාහ්මණය, මම මනුෂ්‍යයෙක් නොවෙමි.”\n“‘පින්වත් ඔබ දෙවියෙක් වෙයිද?’ යි මෙසේ අසන ලද කල්හි, ‘බ්‍රාහ්මණය, මම දෙවියෙක් නොවෙමි’ යි ඔබ වදාරන්නෙහි ය. ‘පින්වත් ඔබ ගන්ධර්වයෙක් වෙයිද?’ යි මෙසේ අසන ලද කල්හි, ‘බ්‍රාහ්මණය, මම ගන්ධර්වයෙක් නොවෙමි’ යි ඔබ වදාරන්නෙහි ය. ‘පින්වත් ඔබ යක්ෂයෙක් වෙයිද?’ යි මෙසේ අසන ලද කල්හි, ‘බ්‍රාහ්මණය, මම යක්ෂයෙක් නොවෙමි’ යි ඔබ වදාරන්නෙහි ය. ‘පින්වත් ඔබ මනුෂ්‍යයෙක් වෙයිද?’ යි මෙසේ අසන ලද කල්හි, ‘බ්‍රාහ්මණය, මම මනුෂ්‍යයෙක් නොවෙමි’ යි ඔබ වදාරන්නෙහි ය. එසේනම් පින්වත් ඔබ කවරෙක් වෙයිද?”\n\n“බ්‍රාහ්මණය, යම් ආශ්‍රවයන් දුරු නොකළ කල්හි මම දෙවියෙක් වන්නේද, ඒ ආශ්‍රවයෝ මා විසින් ප්‍රහීණ කරන ලද්දාහුය, මුල් සිඳින ලද්දාහුය, තල් ගසක් මුලින් උදුරා දැමුවා සේ නැති කරන ලද්දාහුය, නැවත නූපදනා ස්වභාවයට පත් කරන ලද්දාහුය. බ්‍රාහ්මණය, යම් ආශ්‍රවයන් දුරු නොකළ කල්හි මම ගන්ධර්වයෙක් වන්නේද, ඒ ආශ්‍රවයෝ මා විසින් ප්‍රහීණ කරන ලද්දාහුය, මුල් සිඳින ලද්දාහුය, තල් ගසක් මුලින් උදුරා දැමුවා සේ නැති කරන ලද්දාහුය, නැවත නූපදනා ස්වභාවයට පත් කරන ලද්දාහුය. බ්‍රාහ්මණය, යම් ආශ්‍රවයන් දුරු නොකළ කල්හි මම යක්ෂයෙක් වන්නේද, ඒ ආශ්‍රවයෝ මා විසින් ප්‍රහීණ කරන ලද්දාහුය, මුල් සිඳින ලද්දාහුය, තල් ගසක් මුලින් උදුරා දැමුවා සේ නැති කරන ලද්දාහුය, නැවත නූපදනා ස්වභාවයට පත් කරන ලද්දාහුය. බ්‍රාහ්මණය, යම් ආශ්‍රවයන් දුරු නොකළ කල්හි මම මනුෂ්‍යයෙක් වන්නේද, ඒ ආශ්‍රවයෝ මා විසින් ප්‍රහීණ කරන ලද්දාහුය, මුල් සිඳින ලද්දාහුය, තල් ගසක් මුලින් උදුරා දැමුවා සේ නැති කරන ලද්දාහුය, නැවත නූපදනා ස්වභාවයට පත් කරන ලද්දාහුය.\n\nබ්‍රාහ්මණය, යම්සේ නෙළුමක් හෝ ඕලු මලක් හෝ පුණ්ඩරීකයක් (සුදු නෙළුමක්) හෝ දියෙහි ඉපිද, දියෙහි වැඩී, දියෙන් ඉහළට නැඟී, දියෙන් කිලිටි නොවී සිටින්නේද; එසේම බ්‍රාහ්මණය, මමද ලෝකයේ ඉපිද, ලෝකයෙහි වැඩී, ලෝකය ඉක්මවා, ලෝකයෙන් කිලිටි නොවී වාසය කරමි. බ්‍රාහ්මණය, මා ‘බුද්ධ’ යැයි දරනු මැනව.”\n\n“යම් (ආශ්‍රවයක්) හේතුවෙන් දෙව් බවට උපදින්නට සිදුවේද, ගන්ධබ්බයෙක් හෝ අහස්‌ ගාමී සත්වයෙක් වන්නේද, යක්ෂ භාවයට හෝ මනුෂ්‍ය භාවයට යම් ආශ්‍රවයක් හේතුවෙන් පැමිණිය යුතුද; මාගේ ඒ ආශ්‍රවයෝ ක්ෂය කරන ලද්දාහුය, වැනසූ ලද්දාහුය, වියලන ලද්දාහුය.\nයම්සේ මනරම් පුණ්ඩරීක මලක් ජලයෙන් කිලිටි නොවී පවතින්නේද; එසේම මම ලෝකයෙන් කිලිටි නොවෙමි. බ්‍රාහ්මණය, එහෙයින් මම 'බුද්ධ' වෙමි.”",
      "paliTitle": "Doṇasuttaṃ"
    },
    {
      "number": 37,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu abhabbo parihānāya nibbānasseva santike. Katamehi catūhi? Idha, bhikkhave, bhikkhu sīlasampanno hoti, indriyesu guttadvāro hoti, bhojane mattaññū hoti, jāgariyaṃ anuyutto hoti. ‘‘Kathañca, bhikkhave, bhikkhu sīlasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu sīlasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu indriyesu guttadvāro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. Evaṃ kho, bhikkhave, bhikkhu indriyesu guttadvāro hoti. ‘‘Kathañca, bhikkhave, bhikkhu bhojane mattaññū hoti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya; yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya. Iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati, anavajjatā ca phāsuvihāro cā’ti. Evaṃ kho, bhikkhave, bhikkhu bhojane mattaññū hoti. ‘‘Kathañca, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti? Idha, bhikkhave, bhikkhu divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti; rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti; rattiyā majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeti, pāde pādaṃ accādhāya, sato sampajāno uṭṭhānasaññaṃ manasi karitvā; rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti. Evaṃ kho, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu abhabbo parihānāya, nibbānasseva santiketi. ‘‘Sīle patiṭṭhito bhikkhu, indriyesu ca saṃvuto; Bhojanamhi ca mattaññū, jāgariyaṃ anuyuñjati. ‘‘Evaṃ vihārī ātāpī, ahorattamatandito; Bhāvayaṃ kusalaṃ dhammaṃ, yogakkhemassa pattiyā. ‘‘Appamādarato bhikkhu, pamāde bhayadassi vā [bhayadassāvī (ka.) dha. pa. 32 dhammapadepi]; Abhabbo parihānāya, nibbānasseva santike’’ti. sattamaṃ;",
      "english": "“Bhikkhus, a bhikkhu endowed with four qualities is incapable of decline; he is on the verge of Nibbana itself. Which four? Here, bhikkhus, a bhikkhu is endowed with virtue, guards the doors of his senses, knows moderation in food, and is devoted to wakefulness.\n\n“And how, bhikkhus, is a bhikkhu endowed with virtue? Here, bhikkhus, a bhikkhu is virtuous; he dwells restrained by the restraint of the Pāṭimokkha, perfect in conduct and domain, seeing danger in the slightest faults, and undertaking the training in the training rules. Thus, bhikkhus, is a bhikkhu endowed with virtue.\n\n“And how, bhikkhus, does a bhikkhu guard the doors of his senses? Here, bhikkhus, having seen a form with the eye, a bhikkhu does not grasp at its general appearance or its specific features. He undertakes the practice of restraint over that eye faculty through which evil, unwholesome states of covetousness and discontent might assail him if he were to dwell with it unrestrained. He guards the eye faculty; he undertakes the restraint of the eye faculty. Having heard a sound with the ear... having smelt a scent with the nose... having tasted a flavor with the tongue... having felt a tactile sensation with the body... having cognized a mental phenomenon with the mind, he does not grasp at its general appearance or its specific features. He undertakes the practice of restraint over that mind faculty through which evil, unwholesome states of covetousness and discontent might assail him if he were to dwell with it unrestrained. He guards the mind faculty; he undertakes the restraint of the mind faculty. Thus, bhikkhus, does a bhikkhu guard the doors of his senses.\n\n“And how, bhikkhus, does a bhikkhu know moderation in food? Here, bhikkhus, a bhikkhu partakes of food reflectively, not for amusement, not for intoxication, not for adornment, and not for beautification, but only for the maintenance and sustenance of this body, for ending harm, and for supporting the holy life. Thus, 'I shall put an end to the old feeling, and I shall not give rise to a new feeling. My life will be sustained, and I will be blameless, and I will dwell at ease.' Thus, bhikkhus, does a bhikkhu know moderation in food.\n\n“And how, bhikkhus, is a bhikkhu devoted to wakefulness? Here, bhikkhus, during the day, by walking up and down and by sitting, a bhikkhu purifies his mind from obstructive states. During the first watch of the night, by walking up and down and by sitting, he purifies his mind from obstructive states. During the middle watch of the night, he lies down on his right side in the lion's posture, placing one foot on the other, mindful and clearly comprehending, having set his mind on the thought of rising. During the last watch of the night, having risen, by walking up and down and by sitting, he purifies his mind from obstructive states. Thus, bhikkhus, is a bhikkhu devoted to wakefulness.\n\nIndeed, bhikkhus, a bhikkhu endowed with these four qualities is incapable of decline; he is on the verge of Nibbana itself.\n\nA bhikkhu established in virtue, restrained in the senses,\nAnd knowing moderation in food, dedicates himself to wakefulness.\n\nLiving thus, ardent, untiring day and night,\nDeveloping wholesome states for the attainment of security from bondage.\n\nA bhikkhu delighting in heedfulness, seeing danger in heedlessness,\nIs incapable of decline; he is on the verge of Nibbana itself.",
      "sinhala": "මහණෙනි, කරුණු සතරකින් යුත් භික්ෂුවක් පිරිහීමට සුදුසු නොවේ; නිවනටම ආසන්න වෙයි. කවර කරුණු සතරකින් ද? මහණෙනි, මෙහිලා භික්ෂුව සිල්වත් බවෙන් යුක්ත වෙයි. ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර ඇත්තේ වෙයි. භෝජනයෙහි පමණ දන්නේ වෙයි. නිරන්තරයෙන් ආධ්‍යාත්මික වීර්යයෙහි යෙදෙන්නේ වෙයි.\n\nමහණෙනි, භික්ෂුවක් සිල්වත් බවෙන් යුක්ත වන්නේ කෙසේ ද? මහණෙනි, මෙහිලා භික්ෂුව සිල්වත් වෙයි. ප‍්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ වාසය කරයි. ආචාර සම්පන්න වූයේ, ගෝචර සම්පන්න වූයේ, අණු මාත්‍ර වූ වරදක වුවද භය දකින්නේ වෙයි. ශික්ෂාපදයන් සමාදන්ව හික්මෙයි. මහණෙනි, භික්ෂුව සිල්වත් බවෙන් යුක්ත වන්නේ මෙසේ ය.\n\nමහණෙනි, භික්ෂුවක් ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර ඇත්තේ වන්නේ කෙසේ ද? මහණෙනි, මෙහිලා භික්ෂුව ඇසින් රූපයක් දැක, එහි සමස්තයක් හෝ කොටස් වශයෙන් හෝ අල්ලා ගන්නේ නොවේ. යම් හෙයකින් ඇස නමැති ඉන්ද්‍රිය අසංවරව වාසය කරන්නා වූ ඔහු කෙරෙහි අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්\\u200Dමයන් පහළ වනු ඇත් ද, එහි සංවරය සඳහා පිළිපදියි. ඇස නමැති ඉන්ද්‍රිය රකියි. ඇස නමැති ඉන්ද්‍රියෙහි සංවරය ඇති කරගනියි. කනින් ශබ්දයක් අසා... නාසයෙන් ගඳක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් ස්පර්ශයක් ස්පර්ශ කොට... මනසින් ධර්\\u200Dමයක් දැන, එහි සමස්තයක් හෝ කොටස් වශයෙන් හෝ අල්ලා ගන්නේ නොවේ. යම් හෙයකින් මනස නමැති ඉන්ද්‍රිය අසංවරව වාසය කරන්නා වූ ඔහු කෙරෙහි අභිධ්‍යා සහ දෝමනස්සය යන පාපී අකුසල ධර්\\u200Dමයන් පහළ වනු ඇත් ද, එහි සංවරය සඳහා පිළිපදියි. මනස නමැති ඉන්ද්‍රිය රකියි. මනස නමැති ඉන්ද්‍රියෙහි සංවරය ඇති කරගනියි. මහණෙනි, භික්ෂුව ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර ඇත්තේ වන්නේ මෙසේ ය.\n\nමහණෙනි, භික්ෂුවක් භෝජනයෙහි පමණ දන්නේ වන්නේ කෙසේ ද? මහණෙනි, මෙහිලා භික්ෂුව මනාකොට විමසා නුවණින් යුතුව ආහාර අනුභව කරයි. ‘මේ ආහාරය විනෝදය සඳහා හෝ ශක්තිය සඳහා හෝ රූපශ‍්‍රීය සඳහා හෝ අලංකාරය සඳහා නොවේ. මේ ශරීරයේ පැවැත්මට, ජීවනයට, හිංසාවෙන් මිදීමට, බ්‍රහ්මචර්යාවට අනුග‍්‍රහයක් පිණිස ය. මෙසේ පැරණි වේදනාව ද දුරු කරමි. අලුත් වේදනාවක් ද ඇති නොකරමි. මගේ ජීවනය ද සිදුවනු ඇත. නිර්දෝෂි බව ද පහසු විහරණය ද සිදුවනු ඇතැයි’ යනුවෙන් සිතා අනුභව කරයි. මහණෙනි, භික්ෂුව භෝජනයෙහි පමණ දන්නේ වන්නේ මෙසේ ය.\n\nමහණෙනි, භික්ෂුවක් නිරන්තරයෙන් ආධ්‍යාත්මික වීර්යයෙහි යෙදෙන්නේ වන්නේ කෙසේ ද? මහණෙනි, මෙහිලා භික්ෂුව දවල් කාලයෙහි සක්මන් කිරීමෙන් සහ හිඳීමෙන් නීවරණ ධර්\\u200Dමයන්ගෙන් සිත පිරිසිදු කරයි. රාත්‍රියේ පළමු ප‍්‍රහරයෙහි සක්මන් කිරීමෙන් සහ හිඳීමෙන් නීවරණ ධර්\\u200Dමයන්ගෙන් සිත පිරිසිදු කරයි. රාත්‍රියේ මැද ප‍්‍රහරයෙහි දකුණු පසින් සිංහ සෙය්‍යාවෙන් සයනය කරයි. පාදය පිට පාදය තබාගෙන, සිහි ඇතිව, මනා ප‍්‍රඥාවෙන් යුක්තව, නැවත අවදි වී භාවනා කිරීමේ අදහස සිතෙහි ඇති කරගනියි. රාත්‍රියේ අවසාන ප‍්‍රහරයෙහි නැගිට, සක්මන් කිරීමෙන් සහ හිඳීමෙන් නීවරණ ධර්\\u200Dමයන්ගෙන් සිත පිරිසිදු කරයි. මහණෙනි, භික්ෂුව නිරන්තරයෙන් ආධ්‍යාත්මික වීර්යයෙහි යෙදෙන්නේ වන්නේ මෙසේ ය.\n\nමහණෙනි, මේ සතර කරුණින් යුත් භික්ෂුව පිරිහීමට සුදුසු නොවේ; නිවනටම ආසන්න වෙයි.\n\nසිල්හි පිහිටියා වූ, ඉන්ද්‍රියයන්හි සංවර වූ, භෝජනයෙහි ද පමණ දන්නේ වූ භික්ෂුව නිරන්තරයෙන් ආධ්‍යාත්මික වීර්යයෙහි යෙදෙයි.\n\nමෙසේ වාසය කරන්නා වූ, තීව්‍ර වීර්යය ඇති, දිනපතාම අලස නොවන වූ භික්ෂුව යෝගක්ෂේමය (දුකින් මිදීම) පිණිස කුසල ධර්\\u200Dමයන් වඩයි.\n\nඅප‍්‍රමාදයෙහි ඇලුණා වූ, ප‍්‍රමාදයෙහි භය දකින්නේ වූ භික්ෂුව පිරිහීමට සුදුසු නොවේ; නිවනටම ආසන්න වෙයි.",
      "paliTitle": "Aparihāniyasuttaṃ"
    },
    {
      "number": 38,
      "pali": "‘‘Panuṇṇapaccekasacco [paṇunnapaccekasacco (?)], bhikkhave, bhikkhu ‘samavayasaṭṭhesano passaddhakāyasaṅkhāro patilīno’ti vuccati. Kathañca, bhikkhave, bhikkhu panuṇṇapaccekasacco hoti? Idha, bhikkhave, bhikkhuno yāni tāni puthusamaṇabrāhmaṇānaṃ puthupaccekasaccāni, seyyathidaṃ – sassato lokoti vā, asassato lokoti vā, antavā lokoti vā, anantavā lokoti vā, taṃ jīvaṃ taṃ sarīranti vā, aññaṃ jīvaṃ aññaṃ sarīranti vā, hoti tathāgato paraṃ maraṇāti vā, na hoti tathāgato paraṃ maraṇāti vā, hoti ca na ca hoti tathāgato paraṃ maraṇāti vā, neva hoti na na hoti tathāgato paraṃ maraṇāti vā; sabbāni tāni nuṇṇāni honti panuṇṇāni cattāni vantāni muttāni pahīnāni paṭinissaṭṭhāni. Evaṃ kho, bhikkhave, bhikkhu panuṇṇapaccekasacco hoti. ‘‘Kathañca, bhikkhave, bhikkhu samavayasaṭṭhesano hoti? Idha, bhikkhave, bhikkhuno kāmesanā pahīnā hoti, bhavesanā pahīnā hoti, brahmacariyesanā paṭippassaddhā. Evaṃ kho, bhikkhave, bhikkhu samavayasaṭṭhesano hoti. ‘‘Kathañca, bhikkhave, bhikkhu passaddhakāyasaṅkhāro hoti? Idha, bhikkhave, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu passaddhakāyasaṅkhāro hoti. ‘‘Kathañca, bhikkhave, bhikkhu patilīno hoti? Idha, bhikkhave, bhikkhuno asmimāno pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu patilīno hoti. Panuṇṇapaccekasacco, bhikkhave, bhikkhu ‘samavayasaṭṭhesano passaddhakāyasaṅkhāro patilīno’ti vuccatī’’ti. [itivu. 55 itivuttakepi] ‘‘Kāmesanā bhavesanā, brahmacariyesanā saha; Iti saccaparāmāso, diṭṭhiṭṭhānā samussayā. [itivu. 55 itivuttakepi] ‘‘Sabbarāgavirattassa, taṇhakkhayavimuttino; Esanā paṭinissaṭṭhā, diṭṭhiṭṭhānā samūhatā. ‘‘Sa ve santo sato bhikkhu, passaddho aparājito; Mānābhisamayā buddho, patilīnoti vuccatī’’ti. aṭṭhamaṃ;",
      "english": "Monks, a monk who has abandoned all personal speculative views is called 'one whose quests have subsided, whose bodily fabrications are tranquilized, and who has withdrawn from defilements'.\n\nAnd how, Monks, does a monk abandon all personal speculative views? Here, Monks, for a monk, those various personal speculative views held by various ascetics and brahmins—namely, 'the world is eternal' or 'the world is not eternal,' 'the world is finite' or 'the world is infinite,' 'the soul is the same as the body' or 'the soul is different from the body,' 'a Tathāgata exists after death' or 'a Tathāgata does not exist after death' or 'a Tathāgata both exists and does not exist after death' or 'a Tathāgata neither exists nor does not exist after death'—all such views are repelled, cast out, rejected, vomited forth, released, abandoned, and relinquished. It is in this way, Monks, that a monk abandons all personal speculative views.\n\nAnd how, Monks, are a monk's quests subsided? Here, Monks, for a monk, the quest for sensual pleasures is abandoned, the quest for existence is abandoned, and the quest for the holy life has subsided. It is in this way, Monks, that a monk's quests have subsided.\n\nAnd how, Monks, are a monk's bodily fabrications tranquilized? Here, Monks, by the abandoning of pleasure and the abandoning of pain, and by the prior passing away of joy and sorrow, a monk enters and abides in the fourth jhāna, which is neither painful nor pleasant, a state of pure equanimity and mindfulness. It is in this way, Monks, that a monk's bodily fabrications are tranquilized.\n\nAnd how, Monks, is a monk withdrawn from defilements? Here, Monks, for a monk, the conceit 'I am' is abandoned, uprooted, made like a palm tree stump, brought to non-existence, and not liable to arise again in the future. It is in this way, Monks, that a monk is withdrawn from defilements.\n\nMonks, a monk who has abandoned all personal speculative views is called 'one whose quests have subsided, whose bodily fabrications are tranquilized, and who has withdrawn from defilements'.\n\nThe quest for sensual pleasures, the quest for existence, and the quest for the holy life; and also the dogmatic clinging to 'truths', and the accumulated mass of wrong views and their bases.\n\nFor one dispassionate towards all passions, liberated through the destruction of craving, the quests are relinquished and the bases of wrong views are uprooted.\n\nThat monk, indeed, being tranquil and mindful, calm and unconquered, awakened through the complete understanding of conceit, is called 'withdrawn from defilements'.",
      "sinhala": "මහණෙනි, පන්උණ්ණපච්චේකසච්චෝ වූ භික්ෂුව ‘සමවයසට්ඨේසනෝ, පස්සද්ධකායසංඛාරෝ, පටිලීන’ යැයි කියනු ලැබේ. මහණෙනි, භික්ෂුව කෙසේ නම් පන්උණ්ණපච්චේකසච්චෝ (තමාටම විශේෂ වූ සියලු මිත්‍යා දෘෂ්ටීන් ප්‍රහාණය කළ කෙනෙක්) වේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුවකට පෘථග්ජන ශ්‍රමණ බ්‍රාහ්මණයන්ගේ යම් ඒ පෘථග්ජන වූ තමාටම විශේෂ වූ සියලු මිත්‍යා දෘෂ්ටීන් ඇත්ද, එනම් – ලෝකය සදාකාලිකයයි හෝ, ලෝකය අසදාකාලිකයයි හෝ, ලෝකයට අන්තයක් ඇතැයි හෝ, ලෝකයට අන්තයක් නැතැයි හෝ, ඒ ජීවයම ඒ ශරීරය යැයි හෝ, ජීවය එකක් ශරීරය අනිකකැයි හෝ, තථාගතයන් වහන්සේ මරණින් පසු සිටින සේකැයි හෝ, තථාගතයන් වහන්සේ මරණින් පසු නොසිටින සේකැයි හෝ, තථාගතයන් වහන්සේ මරණින් පසු සිටින සේකත් නොසිටින සේකත් යැයි හෝ, තථාගතයන් වහන්සේ මරණින් පසු සිටින සේකැයි කිව නොහැක්කත්, නොසිටින සේකැයි කිව නොහැක්කත් යැයි හෝ (යම් දෘෂ්ටීන් ඇත්ද); ඒ සියල්ල පහ කරන ලද්දාහු, දුරු කරන ලද්දාහු, බැහැර කරන ලද්දාහු, වමාරා දැමූවාහු, මුදා හරින ලද්දාහු, ප්‍රහාණය කරන ලද්දාහු, ප්‍රතිනිස්සර්ග කරන ලද්දාහු වෙති. මහණෙනි, භික්ෂුව මෙසේ නම් පන්උණ්ණපච්චේකසච්චෝ වේ.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් සමවයසට්ඨේසනෝ (සෙවීම් සමනය වූ කෙනෙක්) වේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුවකට කාමයන් සෙවීම ප්‍රහීණ වී ඇත, භවයන් සෙවීම ප්‍රහීණ වී ඇත, බ්‍රහ්මචරියාව සෙවීම සමනය වී ඇත. මහණෙනි, භික්ෂුව මෙසේ නම් සමවයසට්ඨේසනෝ වේ.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් පස්සද්ධකායසංඛාරෝ (කයෙහි සංස්කාරයන් සංසිඳුණා වූ කෙනෙක්) වේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව සැපය ප්‍රහීණය කිරීමෙන්ද, දුක ප්‍රහීණය කිරීමෙන්ද, පෙරදී ම සෝමනස්ස-දෝමනස්සයන් අතුරුදන්වීමෙන්ද, දුක් ද නොවන, සැප ද නොවන, උපේක්ෂාවෙන් හා ස්මරණයේ පිරිසිදු බවෙන් යුක්ත වූ සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරයි. මහණෙනි, භික්ෂුව මෙසේ නම් පස්සද්ධකායසංඛාරෝ වේ.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් පටිලීනෝ (මානය ප්‍රහීණ කළ කෙනෙක්) වේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුවකට ‘මම වෙමි’ යන මානය උදුරා දමන ලද, තල් ගසක මුදුන කපා දැමුවා සේ මුල් සිඳ දමන ලද, නැතිකර දමන ලද, අනාගතයේදී නැවත නූපදින ස්වභාවයට පත් කරන ලද එකක් ලෙස ප්‍රහීණ වී ඇත. මහණෙනි, භික්ෂුව මෙසේ නම් පටිලීනෝ වේ.\n\nමහණෙනි, පන්උණ්ණපච්චේකසච්චෝ වූ භික්ෂුව ‘සමවයසට්ඨේසනෝ, පස්සද්ධකායසංඛාරෝ, පටිලීන’ යැයි කියනු ලැබේ.\n\nකාමයන් සෙවීම, භවයන් සෙවීම, බ්‍රහ්මචරියාව සෙවීම සමඟ; මෙසේ සත්‍යයන්ට ඇලීම (දෘෂ්ටි පරාමාසය), දෘෂ්ටීන්ගේ සමුච්චයෝ (ගොඩගැසීම්) වෙති.\n\nසියලු රාගයන්ගෙන් විරාගී වූ, තෘෂ්ණාව ක්ෂය කිරීමෙන් විමුක්ත වූ තැනැත්තාට; සෙවීම් ප්‍රතිනිස්සර්ග කර ඇත, දෘෂ්ටීන්ගේ ස්ථානයන් මුලිනුපුටා දමා ඇත.\n\nඒ ශාන්ත වූ සිහි නුවණින් යුත් භික්ෂුව, සංසිඳුණු වූ, පරාජය නොලද; මානය ප්‍රඥාවෙන් සම්පූර්ණයෙන් අවබෝධ කරගත් අරහත් බුද්ධ වූ කෙනෙක්, ‘පටිලීන’ යැයි කියනු ලැබේ.",
      "paliTitle": "Patilīnasuttaṃ"
    },
    {
      "number": 39,
      "pali": "Atha kho ujjayo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho ujjayo brāhmaṇo bhagavantaṃ etadavoca – ‘‘bhavampi no gotamo yaññaṃ vaṇṇetī’’ti? ‘‘Na kho ahaṃ, brāhmaṇa, sabbaṃ yaññaṃ vaṇṇemi; na panāhaṃ, brāhmaṇa, sabbaṃ yaññaṃ na vaṇṇemi. Yathārūpe kho, brāhmaṇa, yaññe gāvo haññanti, ajeḷakā haññanti, kukkuṭasūkarā haññanti, vividhā pāṇā saṅghātaṃ āpajjanti; evarūpaṃ kho ahaṃ, brāhmaṇa, sārambhaṃ yaññaṃ na vaṇṇemi. Taṃ kissa hetu? Evarūpañhi, brāhmaṇa, sārambhaṃ yaññaṃ na upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā. ‘‘Yathārūpe ca kho, brāhmaṇa, yaññe neva gāvo haññanti, na ajeḷakā haññanti, na kukkuṭasūkarā haññanti, na vividhā pāṇā saṅghātaṃ āpajjanti; evarūpaṃ kho ahaṃ, brāhmaṇa, nirārambhaṃ yaññaṃ vaṇṇemi, yadidaṃ niccadānaṃ anukulayaññaṃ. Taṃ kissa hetu? Evarūpañhi, brāhmaṇa, nirārambhaṃ yaññaṃ upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā’’ti. ‘‘Assamedhaṃ purisamedhaṃ, sammāpāsaṃ vājapeyyaṃ niraggaḷaṃ; Mahāyaññā mahārambhā [sammāpāsaṃ vājapeyyaṃ; niraggaḷaṃ mahārambhā (pī.) saṃ. ni. 1.120], na te honti mahapphalā. ‘‘Ajeḷakā ca gāvo ca, vividhā yattha haññare; Na taṃ sammaggatā yaññaṃ, upayanti mahesino. ‘‘Ye ca yaññā nirārambhā, yajanti anukulaṃ sadā; Ajeḷakā ca gāvo ca, vividhā nettha haññare [nājeḷakā ca gāvo ca, vividhā yattha haññare (syā. kaṃ.)]; Tañca sammaggatā yaññaṃ, upayanti mahesino. ‘‘Etaṃ [evaṃ (syā. kaṃ.)] yajetha medhāvī, eso yañño mahapphalo; Etaṃ [evaṃ (syā. kaṃ. ka.)] hi yajamānassa, seyyo hoti na pāpiyo; Yañño ca vipulo hoti, pasīdanti ca devatā’’ti. navamaṃ;",
      "english": "Then the brahmin Ujjaya approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the courteous and memorable conversation, he sat down to one side. Sitting to one side, the brahmin Ujjaya said to the Blessed One, “Does Master Gotama also praise sacrifice?”\n\n“Indeed, brahmin, I do not praise every sacrifice; nor, brahmin, do I not praise every sacrifice. Brahmin, that kind of sacrifice where cattle are slaughtered, goats and sheep are slaughtered, chickens and pigs are slaughtered, and various living beings meet their demise – such a violent sacrifice, brahmin, I do not praise. Why is that? Because, brahmin, arahants or those who have entered the path to arahantship do not attend such violent sacrifices.\n\n“But, brahmin, that kind of sacrifice where neither cattle are slaughtered, nor goats and sheep are slaughtered, nor chickens and pigs are slaughtered, nor various living beings meet their demise – such a non-violent sacrifice, brahmin, I praise. This refers to a perpetual offering, a traditional offering. Why is that? Because, brahmin, arahants or those who have entered the path to arahantship attend such non-violent sacrifices.”\n\nHorse sacrifice, human sacrifice, the Sammāpāsa, the Vājapeyya, the unrestricted –\nThese great sacrifices, involving great violence, are not of great fruit.\nWhere goats and sheep, cattle, and various living beings are slaughtered,\nThe rightly-gone ones, the great sages, do not approach that sacrifice.\n\nBut those non-violent sacrifices, offered perpetually according to tradition,\nWhere neither goats and sheep, nor cattle, nor various living beings are slaughtered –\nThe rightly-gone ones, the great sages, attend that sacrifice.\nA wise person should offer such a sacrifice; this sacrifice yields great fruit.\nIndeed, for one who offers such a sacrifice, it leads to welfare, not harm.\nThe sacrifice becomes abundant, and the deities are pleased.",
      "sinhala": "එවිට උජ්ජය බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු සාමිචි කථා පැවැත්වූයේය. සතුටු විය යුතු සිහි කටයුතු කථා නිමවා එකත්පස්ව හිඳ ගත්තේය. එකත්පස්ව හිඳ ගත් උජ්ජය බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “භවත් ගෞතමයන් වහන්සේත් යඥය අගය කරන සේක්ද?”\n\n“බ්‍රාහ්මණ, මම සියලු යඥයන් අගය නොකරමි. බ්‍රාහ්මණ, එසේම මම සියලු යඥයන් අගය නොකරමි කියා ද නොවේ. බ්‍රාහ්මණ, යම් යඥයක ගවයෝ මැරෙත්ද, එළු බැටළුවෝ මැරෙත්ද, කුකුළු ඌරෝ මැරෙත්ද, නානාවිධ ප්‍රාණීහු විනාශයට පත් වෙත්ද; බ්‍රාහ්මණ, එබඳු ආරම්භ සහිත (හිංසා සහිත) යඥයක් මම අගය නොකරමි. ඊට හේතුව කුමක්ද? බ්‍රාහ්මණ, අරහත්හු හෝ අරහත් මාර්ගයට පැමිණි අය එබඳු ආරම්භ සහිත යඥයන්ට ළං නොවෙති.”\n\n“එහෙත්, බ්‍රාහ්මණ, යම් යඥයක ගවයෝ නොමැරෙත්ද, එළු බැටළුවෝ නොමැරෙත්ද, කුකුළු ඌරෝ නොමැරෙත්ද, නානාවිධ ප්‍රාණීහු විනාශයට පත් නොවෙත්ද; බ්‍රාහ්මණ, එබඳු ආරම්භ රහිත (හිංසා රහිත) යඥයක් මම අගය කරමි. එනම්, නිතර දීම, සිරිතට අනුකූල වූ යඥයයි. ඊට හේතුව කුමක්ද? බ්‍රාහ්මණ, අරහත්හු හෝ අරහත් මාර්ගයට පැමිණි අය එබඳු ආරම්භ රහිත යඥයන්ට ළං වෙති.”\n\nඅස්වමේධ, පුරිසමේධ, සම්මාපාස, වාජපෙය්‍ය, නිරග්ගළ යන මේවා මහත් ආරම්භ සහිත (මහත් හිංසා සහිත) මහා යඥයෝ වෙති. ඒවා මහත් ඵල දායක නොවෙති.\n\nයම් යඥයක එළු බැටළුවෝ ද ගවයෝ ද නානාවිධ ප්‍රාණීහු ද මැරෙත්ද; සත්‍ය මාර්ගයට පැමිණි මහා සෘෂීහු ඒ යඥයට නොඑළඹෙති.\n\nයම් යඥයෝ ආරම්භ රහිත වෙත්ද, නිතරම සිරිතට අනුකූලව පවත්වත්ද; එහි එළු බැටළුවෝ ද ගවයෝ ද නානාවිධ ප්‍රාණීහු ද නොමැරෙත්ද; සත්‍ය මාර්ගයට පැමිණි මහා සෘෂීහු ඒ යඥයට එළඹෙති.\n\nනුවණැත්තා මෙබඳු යඥයක් පැවැත්විය යුතුයි. මේ යඥය මහත් ඵල දායකයි. මේ යඥය පවත්වන්නාට ශ්‍රේෂ්ඨ වන්නේය, පාපී නොවන්නේය. යඥය ද මහත් වෙයි, දෙවියෝ ද පැහැදෙති.",
      "paliTitle": "Ujjayasuttaṃ"
    },
    {
      "number": 40,
      "pali": "Atha kho udāyī [udāyi (sabbattha)] brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā …pe… ekamantaṃ nisinno kho udāyī brāhmaṇo bhagavantaṃ etadavoca – ‘‘bhavampi no gotamo yaññaṃ vaṇṇetī’’ti? ‘‘Na kho ahaṃ, brāhmaṇa, sabbaṃ yaññaṃ vaṇṇemi; na panāhaṃ, brāhmaṇa, sabbaṃ yaññaṃ na vaṇṇemi. Yathārūpe kho, brāhmaṇa, yaññe gāvo haññanti, ajeḷakā haññanti, kukkuṭasūkarā haññanti, vividhā pāṇā saṅghātaṃ āpajjanti; evarūpaṃ kho ahaṃ, brāhmaṇa, sārambhaṃ yaññaṃ na vaṇṇemi. Taṃ kissa hetu? Evarūpañhi, brāhmaṇa, sārambhaṃ yaññaṃ na upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā. ‘‘Yathārūpe ca kho, brāhmaṇa, yaññe neva gāvo haññanti, na ajeḷakā haññanti, na kukkuṭasūkarā haññanti, na vividhā pāṇā saṅghātaṃ āpajjanti; evarūpaṃ kho ahaṃ, brāhmaṇa, nirārambhaṃ yaññaṃ vaṇṇemi, yadidaṃ niccadānaṃ anukulayaññaṃ. Taṃ kissa hetu? Evarūpañhi, brāhmaṇa, nirārambhaṃ yaññaṃ upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā’’ti. ‘‘Abhisaṅkhataṃ nirārambhaṃ, yaññaṃ kālena kappiyaṃ; Tādisaṃ upasaṃyanti, saññatā brahmacārayo. ‘‘Vivaṭacchadā [vivattacchadā (sī. pī.), vivaṭṭacchadā (ka.)] ye loke, vītivattā kulaṃ gatiṃ; Yaññametaṃ pasaṃsanti, buddhā yaññassa [puññassa (syā. kaṃ. pī.)] kovidā. ‘‘Yaññe vā yadi vā saddhe, habyaṃ [havyaṃ (sī. pī.), huññaṃ (syā. kaṃ.)] katvā yathārahaṃ; Pasannacitto yajati [pasannacittā yajanti (ka.)], sukhette brahmacārisu. ‘‘Suhutaṃ suyiṭṭhaṃ suppattaṃ [sampattaṃ (syā. kaṃ. ka.)], dakkhiṇeyyesu yaṃ kataṃ; Yañño ca vipulo hoti, pasīdanti ca devatā. ‘‘Evaṃ [etaṃ (ka.) a. ni. 6.37] yajitvā medhāvī, saddho muttena cetasā; Abyābajjhaṃ sukhaṃ lokaṃ, paṇḍito upapajjatī’’ti. dasamaṃ; ",
      "english": "Then, the brahmin Udāyī approached the Blessed One. Having approached and exchanged greetings with the Blessed One, and sat down to one side, the brahmin Udāyī said to the Blessed One: \"Does Master Gotama also praise sacrifice?\"\n\n\"No, brahmin, I do not praise every sacrifice; nor, brahmin, do I not praise every sacrifice. Brahmin, whatever sacrifice involves the slaughter of cattle, goats and sheep, fowls and pigs, and various living beings are subjected to violence; such a violent sacrifice, brahmin, I do not praise. For what reason? Because, brahmin, those who are Arahants or those who have entered upon the path to Arahantship do not approach such a violent sacrifice. But, brahmin, whatever sacrifice does not involve the slaughter of cattle, nor goats and sheep, nor fowls and pigs, nor are various living beings subjected to violence; such a non-violent sacrifice, brahmin, I praise, namely, a continuous customary offering. For what reason? Because, brahmin, those who are Arahants or those who have entered upon the path to Arahantship do approach such a non-violent sacrifice.\"\n\nA well-prepared, non-violent sacrifice, proper according to the time; to such a one, the self-controlled renunciants approach.\n\nThose in the world whose coverings are unveiled, who have transcended the cycle of rebirth into families and states of being; the Buddhas, expert in sacrifice, praise this sacrifice.\n\nWhether in a sacrifice or out of faith, having made an offering appropriately; with a mind filled with serene confidence, one offers to the renunciants who are good fields for merit.\n\nThat which is well-offered, well-sacrificed, well-given to those worthy of offerings; that offering becomes abundant, and the devas are pleased.\n\nHaving thus offered, the wise person, faithful and with a liberated mind; the discerning one attains a world of happiness free from harm.",
      "sinhala": "එවිට උදායී බ‍්‍රාහ්මණයා භාග්‍‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍‍යවතුන් වහන්සේට වන්දනා කොට... එක්පසෙක වාඩි වී භාග්‍‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ගෝතමයන් වහන්සේ ද යාගය වර්ණනා කරන සේක්ද?\"\n\n\"බ‍්‍රාහ්මණය, මම සියලු යාග වර්ණනා නොකරමි; එහෙත් බ‍්‍රාහ්මණය, මම සියලු යාග හෙළා නොදකිමි. බ‍්‍රාහ්මණය, යම් යාගයකදී ගවයන් මරනු ලැබේ ද, එළුවන්-බැටළුවන් මරනු ලැබේ ද, කුකුළන්-ඌරන් මරනු ලැබේ ද, විවිධ ප‍්‍රාණීහු සංහාරයට පත් වෙති ද; බ‍්‍රාහ්මණය, එබඳු ආරම්භ සහිත (හිංසා සහිත) යාගයක් මම වර්ණනා නොකරමි. එයට හේතුව කුමක්ද? බ‍්‍රාහ්මණය, එබඳු ආරම්භ සහිත යාගයන් වෙත අරහතුන් වහන්සේලා හෝ අරහත්ත මාර්ගයට සමවන් වූවන් හෝ සමීප නොවේ.\n\n\"බ‍්‍රාහ්මණය, යම් යාගයකදී ගවයෝ ද නොමරනු ලබති, එළුවෝ-බැටළුවෝ ද නොමරනු ලබති, කුකුළෝ-ඌරෝ ද නොමරනු ලබති, විවිධ ප‍්‍රාණීහු ද සංහාරයට පත් නොවෙති ද; බ‍්‍රාහ්මණය, එබඳු අහිංසක (ආරම්භ රහිත) යාගයක් මම වර්ණනා කරමි. එනම් නිරන්තර දානය, අනුකූල යාගයයි. එයට හේතුව කුමක්ද? බ‍්‍රාහ්මණය, එබඳු අහිංසක (ආරම්භ රහිත) යාගයන් වෙත අරහතුන් වහන්සේලා හෝ අරහත්ත මාර්ගයට සමවන් වූවන් හෝ සමීප වෙති.\"\n\nමනා කොට සකස් කරන ලද, අහිංසක, කාලයට සුදුසු යාගය වෙත සංයත වූ, බ‍්‍රහ්මචාරීහු සමීප වෙති.\n\nයම් අය මේ ලෝකයෙහි ආවරණ දුරු කළාහු ද, කුල ගති, පුනර්භවය ඉක්මවා සිටියාහු ද; යාගයෙහි දක්ෂ වූ බුදුවරු මේ යාගය වර්ණනා කරති.\n\nයාගයකදී වේවා, ශ‍්‍රද්ධාවෙන් දෙන දානයකදී වේවා, සුදුසු පරිදි දිය යුතු දේ පිළිගන්වා, පැහැදුණු සිත් ඇතිව, බ‍්‍රහ්මචාරීන් නමැති සත්පුරුෂ ක්ෂේත‍්‍රයෙහි පුද පූජා පවත්වන්නේය.\n\nදක්ෂිණාර්හයන් (පූජාවට සුදුසු උතුමන්) කෙරෙහි මනා කොට පුදන ලද්දා වූ, මනා කොට පිදූ වූ, මැනවින් පිළිගන්වන ලද යමක් සිදුකෙළේ ද; එම යාගය මහත් ඵල මහානිසංස ඇති වේ. දෙවියෝ ද ප‍්‍රසන්න වෙති.\n\nමෙසේ, බුද්ධිමත් වූ, ශ‍්‍රද්ධා සම්පන්න වූ පුද්ගලයා, බැඳීම්වලින් නිදහස් වූ සිතින් යාගය සිදු කොට, පණ්ඩිතයා වූ හෙතෙම, පීඩාවකින් තොර වූ සුඛිත වූ ලෝකයක (ස්වර්ග ලෝකයක) උපදී.",
      "paliTitle": "Udāyīsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Cakkavaggo catuttho. Tassuddānaṃ – Cakko saṅgaho sīho, pasādo vassakārena pañcamaṃ; Doṇo aparihāniyo patilīno, ujjayo udāyinā te dasāti.",
    "english": "",
    "sinhala": ""
  }
}