{
  "id": "an4.3",
  "title": {
    "pali": "Uruvelavaggo",
    "english": "The Uruvelā Chapter",
    "sinhala": "උරුවෙලා වග්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "Evaṃ me sutaṃ [saṃ. ni. 1.173 āgataṃ] – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Ekamidāhaṃ, bhikkhave, samayaṃ uruvelāyaṃ viharāmi najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Tassa mayhaṃ, bhikkhave, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘dukkhaṃ kho agāravo viharati appatisso. Kiṃ nu kho ahaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā [garukatvā (sī. pī.)] upanissāya vihareyya’’’nti? ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – aparipūrassa kho ahaṃ sīlakkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṃ samaṇaṃ vā brāhmaṇaṃ vā attanā sīlasampannataraṃ, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. ‘‘Aparipūrassa kho ahaṃ samādhikkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṃ samaṇaṃ vā brāhmaṇaṃ vā attanā samādhisampannataraṃ, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. ‘‘Aparipūrassa kho ahaṃ paññākkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṃ samaṇaṃ vā brāhmaṇaṃ vā attanā paññāsampannataraṃ, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. ‘‘Aparipūrassa kho ahaṃ vimuttikkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya aññaṃ samaṇaṃ vā brāhmaṇaṃ vā attanā vimuttisampannataraṃ, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyya’’nti. ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘yaṃnūnāhaṃ yvāyaṃ [yopāyaṃ (sī. syā. kaṃ. pī.)] dhammo mayā abhisambuddho tameva dhammaṃ sakkatvā garuṃ katvā upanissāya vihareyya’’’nti. ‘‘Atha kho, bhikkhave, brahmā sahampati mama cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ [sammiñjitaṃ (sī. syā. kaṃ. pī.)] vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ – brahmaloke antarahito mama purato pāturahosi. Atha kho, bhikkhave, brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā dakkhiṇaṃ jāṇumaṇḍalaṃ pathaviyaṃ nihantvā yenāhaṃ tenañjaliṃ paṇāmetvā maṃ etadavoca – ‘evametaṃ bhagavā, evametaṃ sugata! Yepi te, bhante, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā tepi bhagavanto dhammaṃyeva sakkatvā garuṃ katvā upanissāya vihariṃsu; yepi te, bhante, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā tepi bhagavanto dhammaṃyeva sakkatvā garuṃ katvā upanissāya viharissanti; bhagavāpi, bhante, etarahi arahaṃ sammāsambuddho dhammaṃyeva sakkatvā garuṃ katvā upanissāya viharatū’’’ti. Idamavoca brahmā sahampati. Idaṃ vatvā athāparaṃ etadavoca – ‘‘Ye ca atītā [ye cabbhatītā (sī. pī. ka.)] sambuddhā, ye ca buddhā anāgatā; Yo cetarahi sambuddho, bahūnaṃ [bahunnaṃ (sī. syā. kaṃ. pī.) saṃ. ni. 1.173] sokanāsano. ‘‘Sabbe saddhammagaruno, vihaṃsu [vihariṃsu (syā. kaṃ.)] viharanti ca; Athopi viharissanti, esā buddhāna dhammatā. ‘‘Tasmā hi attakāmena [atthakāmena (sī. ka.)], mahattamabhikaṅkhatā; Saddhammo garukātabbo, saraṃ buddhāna sāsana’’nti. ‘‘Idamavoca, bhikkhave, brahmā sahampati. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Atha khvāhaṃ, bhikkhave, brahmuno ca ajjhesanaṃ viditvā attano ca patirūpaṃ yvāyaṃ [yopāyaṃ (sabbattha)] dhammo mayā abhisambuddho tameva dhammaṃ sakkatvā garuṃ katvā upanissāya vihāsiṃ. Yato ca kho, bhikkhave, saṅghopi mahattena samannāgato, atha me saṅghepi gāravo’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Sāvatthī, at Jetavana, in Anāthapiṇḍika’s park. There the Blessed One addressed the bhikkhus, saying: “Bhikkhus!” “Venerable Sir!” those bhikkhus replied to the Blessed One. The Blessed One then said this:\n\n“Bhikkhus, on one occasion, I was dwelling in Uruvelā, on the bank of the Nerañjarā River, at the Ajapāla Banyan tree, having just attained full awakening. While I was dwelling there in seclusion, contemplating in solitude, this thought arose in my mind: ‘It is indeed painful to dwell without reverence and without deference. Who might I revere, honor, and depend upon?’\n\n“Then, bhikkhus, it occurred to me: ‘If I were to revere, honor, and depend upon another ascetic or brahmin for the fulfillment of any unfulfilled dimension of my moral conduct, I do not see any other ascetic or brahmin in this world with its deities, Māra, and Brahmā, among this generation with its ascetics and brahmins, its gods and humans, who is more accomplished in moral conduct than myself, and whom I could revere, honor, and depend upon.’\n\n“‘If I were to revere, honor, and depend upon another ascetic or brahmin for the fulfillment of any unfulfilled dimension of my concentration, I do not see any other ascetic or brahmin in this world with its deities, Māra, and Brahmā, among this generation with its ascetics and brahmins, its gods and humans, who is more accomplished in concentration than myself, and whom I could revere, honor, and depend upon.’\n\n“‘If I were to revere, honor, and depend upon another ascetic or brahmin for the fulfillment of any unfulfilled dimension of my wisdom, I do not see any other ascetic or brahmin in this world with its deities, Māra, and Brahmā, among this generation with its ascetics and brahmins, its gods and humans, who is more accomplished in wisdom than myself, and whom I could revere, honor, and depend upon.’\n\n“‘If I were to revere, honor, and depend upon another ascetic or brahmin for the fulfillment of any unfulfilled dimension of my liberation, I do not see any other ascetic or brahmin in this world with its deities, Māra, and Brahmā, among this generation with its ascetics and brahmins, its gods and humans, who is more accomplished in liberation than myself, and whom I could revere, honor, and depend upon.’\n\n“Then, bhikkhus, it occurred to me: ‘What if I were to revere, honor, and depend upon this very Dhamma that I have fully awakened to?’\n\n“Then, bhikkhus, Brahmā Sahampati, having understood the thought in my mind with his own mind – just as a strong man might extend his flexed arm or flex his extended arm – vanished from the Brahmā-world and appeared before me. Then, bhikkhus, Brahmā Sahampati, arranging his upper robe over one shoulder, kneeling with his right knee on the ground, and raising his hands in reverence towards me, said this: ‘It is indeed so, Blessed One! It is indeed so, Accomplished One! All those Blessed Ones who were Arahants, Perfectly Self-Awakened Ones, in the past, they too revered, honored, and depended upon the Dhamma. And all those Blessed Ones who will be Arahants, Perfectly Self-Awakened Ones, in the future, they too will revere, honor, and depend upon the Dhamma. May the Blessed One, Venerable Sir, who is presently an Arahant, a Perfectly Self-Awakened One, also revere, honor, and depend upon the Dhamma!’\n\nBrahmā Sahampati said this. Having said this, he further spoke these verses:\n\n“Those Fully Awakened Ones who have passed, and those Buddhas yet to come, and the Fully Awakened One present now, the dispeller of sorrow for many beings –\n\n“All of them revered the True Dhamma; they dwelt in such a way, and they will dwell in such a way. This is the nature of the Buddhas.\n\n“Therefore, one who desires their own true benefit and aspires to the highest spiritual state should revere the True Dhamma, remembering the teaching of the Buddhas.”\n\n“Bhikkhus, Brahmā Sahampati said this. Having said this, he paid homage to me, circumambulated me keeping his right side towards me, and then vanished right there. Then, bhikkhus, understanding the Brahmā’s request and recognizing it as fitting for myself, I revered, honored, and depended upon this very Dhamma that I had fully awakened to. And, bhikkhus, since the Saṅgha also possesses greatness, I now also have reverence for the Saṅgha.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩවාසය කරන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා ‘මහණෙනි’යි වදාළ සේක. ඒ භික්ෂූහු ‘වහන්ස’යි භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක: ‘මහණෙනි, එක් සමයෙක්හි මම මුල් වරට සම්බුදු වූවා වූයේ, නේරංජරා නදී තීරයෙහි අජපාල නුග රුක මුල, උරුවෙල් දනව්වෙහි වැඩවසමි.\n\nමහණෙනි, මම රහසට ගොස් (තනිව) භාවනාවෙහි යෙදී සිටියදී, මගේ සිතෙහි මෙවැනි කල්පනාවක් පහළ විය: ‘ඇත්තෙන්ම අගෞරවයෙන්, ගුරු භක්තියකින් තොරව විසීම දුකකි. කුමක් හෙයින් මම යම් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු සත්කාර කොට, ගරු කොට, ඇසුරු කරගෙන වාසය නොකරම්දැයි?’ මහණෙනි, එවිට මට මෙසේ සිතුණි: ‘යම් හෙයකින් මාගේ සීලස්කන්ධය නොපිරී තිබුණා නම්, එය පූර්ණය කර ගැනීම සඳහා වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු සත්කාර කොට, ගරු කොට, ඇසුරු කරගෙන මම වාසය කරන්නට තිබුණි. එහෙත්, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත මේ ලෝකයෙහි, ශ්‍රමණ බ්‍රාහ්මණ ප්‍රජාව සහිත, දෙවි මිනිසුන් සහිත ලෝකයෙහි, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කළ යුතු, මට වඩා සීල සම්පන්න වූ වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු මම නොදකිමි.’\n\n‘යම් හෙයකින් මාගේ සමාධිස්කන්ධය නොපිරී තිබුණා නම්, එය පූර්ණය කර ගැනීම සඳහා වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු සත්කාර කොට, ගරු කොට, ඇසුරු කරගෙන මම වාසය කරන්නට තිබුණි. එහෙත්, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත මේ ලෝකයෙහි, ශ්‍රමණ බ්‍රාහ්මණ ප්‍රජාව සහිත, දෙවි මිනිසුන් සහිත ලෝකයෙහි, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කළ යුතු, මට වඩා සමාධි සම්පන්න වූ වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු මම නොදකිමි.’\n\n‘යම් හෙයකින් මාගේ ප්‍රඥාස්කන්ධය නොපිරී තිබුණා නම්, එය පූර්ණය කර ගැනීම සඳහා වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු සත්කාර කොට, ගරු කොට, ඇසුරු කරගෙන මම වාසය කරන්නට තිබුණි. එහෙත්, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත මේ ලෝකයෙහි, ශ්‍රමණ බ්‍රාහ්මණ ප්‍රජාව සහිත, දෙවි මිනිසුන් සහිත ලෝකයෙහි, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කළ යුතු, මට වඩා ප්‍රඥා සම්පන්න වූ වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු මම නොදකිමි.’\n\n‘යම් හෙයකින් මාගේ විමුක්තිස්කන්ධය නොපිරී තිබුණා නම්, එය පූර්ණය කර ගැනීම සඳහා වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු සත්කාර කොට, ගරු කොට, ඇසුරු කරගෙන මම වාසය කරන්නට තිබුණි. එහෙත්, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත මේ ලෝකයෙහි, ශ්‍රමණ බ්‍රාහ්මණ ප්‍රජාව සහිත, දෙවි මිනිසුන් සහිත ලෝකයෙහි, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කළ යුතු, මට වඩා විමුක්ති සම්පන්න වූ වෙනත් ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු මම නොදකිමි’යි.\n\nමහණෙනි, එවිට මට මෙසේ සිතුණි: ‘කුමක් හෙයින් ම විසින් අවබෝධ කරන ලද මේ ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කරගෙන මම වාසය නොකරම්දැයි?’\n\nමහණෙනි, එකල්හි සහම්පති බ්‍රහ්මයා මගේ සිතේ පැවති මේ කල්පනාව තම සිතින්ම දැන, බලවත් පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැර සිටි අතක් හැකිලූවාක් මෙන්, බඹලොවෙන් අතුරුදන් වී මා ඉදිරියෙහි පහළ විය. මහණෙනි, එකල්හි සහම්පති බ්‍රහ්මයා උතුරු සළුව එක අංශයක් මත තබා, දකුණු දණ මණ්ඩලය පොළොවෙහි තබා, මා සිටි දෙසට දොහොත් මුදුන් දී, මට මෙසේ කීවේය: ‘භාග්‍යවතුන් වහන්ස, ඒ එසේමය. සුගතයන් වහන්ස, ඒ එසේමය! වහන්ස, අතීත කාලයෙහි යම් අරහත් සම්මා සම්බුදුවරුන් වහන්සේලා වැඩසිටියාහු නම්, ඒ භාග්‍යවතුන් වහන්සේලාද ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කොට වාසය කළ සේක. වහන්ස, අනාගත කාලයෙහි යම් අරහත් සම්මා සම්බුදුවරුන් වහන්සේලා වැඩසිටින්නාහු නම්, ඒ භාග්‍යවතුන් වහන්සේලාද ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කොට වාසය කරන්නාහුය. වහන්ස, මේ දැන් වැඩසිටින අරහත් සම්මා සම්බුදු වූ භාග්‍යවතුන් වහන්සේද ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කොට වාසය කරන සේක්වා!’\n\nසහම්පති බ්‍රහ්මයා මේ කාරණය කීවේය. මේ කාරණය කියා, තවදුරටත් මෙසේ කීවේය: ‘යම් අතීත සම්බුදුවරුන් වහන්සේලා වැඩසිටියාහුද, යම් අනාගත බුදුවරුන් වහන්සේලා පහළ වන්නාහුද, යම් සම්බුදු කෙනෙක් මේ දැන් බහුජනයාගේ ශෝකය නසමින් වැඩසිටින්නාහුද –\n\n‘ඒ සියලු දෙනාම සද්ධර්මයට ගරු කරන්නෝ වූහ, ගරු කරමින් වාසය කරති, එසේම ගරු කරමින් වාසය කරන්නාහුය. මෙය බුදුවරුන්ගේ ස්වභාවයයි.’\n\n‘එබැවින් යම් කිසිවෙක් තමාගේ යහපත කැමති නම්, ශ්‍රේෂ්ඨත්වය ප්‍රාර්ථනා කරන්නේ නම්, බුදුවරුන්ගේ ශාසනය සිහි කරමින්, සද්ධර්මයට ගරු කළ යුත්තේය.’\n\nමහණෙනි, සහම්පති බ්‍රහ්මයා මේ කාරණය කීවේය. මේ කාරණය කියා, මට ආචාර කොට, පැදකුණු කොට, එතැනම අතුරුදන් විය. මහණෙනි, එකල්හි මම බ්‍රහ්මයාගේ ආරාධනාවද දැන, තමන්ගේ සුදුසුකමද (නිවන් මඟට) අවබෝධ කොට, ම විසින් අවබෝධ කරන ලද මේ ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කරගෙන වාසය කළෙමි. මහණෙනි, යම් හෙයකින් සංඝයාද ශ්‍රේෂ්ඨත්වයෙන් යුක්ත වීද, එතැන් පටන් මට සංඝයා කෙරෙහිද ගෞරවයක් ඇති විය’යි.",
      "paliTitle": "Paṭhamauruvelasuttaṃ",
      "englishTitle": "First Uruvela Sutta",
      "sinhalaTitle": "පළමුවන උරුවේලා සූත්‍රය"
    },
    {
      "number": 22,
      "pali": "‘‘Ekamidāhaṃ, bhikkhave, samayaṃ uruvelāyaṃ viharāmi najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Atha kho, bhikkhave, sambahulā brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā mayā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho, bhikkhave, te brāhmaṇā maṃ etadavocuṃ – ‘sutaṃ netaṃ [metaṃ (sī. syā. kaṃ. ka.)], bho gotama – na samaṇo gotamo brāhmaṇe jiṇṇe vuddhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimantetīti. Tayidaṃ, bho gotama, tatheva. Na hi bhavaṃ gotamo brāhmaṇe jiṇṇe vuddhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimanteti. Tayidaṃ, bho gotama, na sampannamevā’’’ti. ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘nayime [na vata me (sī. pī.), na cayime (syā. kaṃ.), na vatime (?)] āyasmanto jānanti theraṃ vā therakaraṇe vā dhamme’ti. Vuddho cepi, bhikkhave, hoti āsītiko vā nāvutiko vā vassasatiko vā jātiyā. So ca hoti akālavādī abhūtavādī anatthavādī adhammavādī avinayavādī, anidhānavatiṃ vācaṃ bhāsitā akālena anapadesaṃ apariyantavatiṃ anatthasaṃhitaṃ. Atha kho so ‘bālo thero’tveva [teva (sī. pī.)] saṅkhaṃ gacchati. ‘‘Daharo cepi, bhikkhave, hoti yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā. So ca hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī nidhānavatiṃ vācaṃ bhāsitā kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Atha kho so ‘paṇḍito thero’tveva saṅkhaṃ gacchati. ‘‘Cattārome, bhikkhave, therakaraṇā dhammā. Katame cattāro? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [sātthā sabyañjanā (sī. pī.)] kevalaparipuṇṇaṃ [kevalaparipuṇṇā (sī.)] parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā [dhatā (sī. syā. kaṃ. pī.)] vacasā paricitā manasānupekkhitā, diṭṭhiyā suppaṭividdhā, catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ime kho, bhikkhave, cattāro therakaraṇā dhammā’’ti. ‘‘Yo uddhatena cittena, samphañca bahu bhāsati; Asamāhitasaṅkappo, asaddhammarato mago; Ārā so thāvareyyamhā, pāpadiṭṭhi anādaro. ‘‘Yo ca sīlena sampanno, sutavā paṭibhānavā; Saññato dhīro dhammesu [saññato dhīradhammesu (sī.), saṃyutto thiradhammesu (syā. kaṃ.)], paññāyatthaṃ vipassati. ‘‘Pāragū sabbadhammānaṃ, akhilo paṭibhānavā; Pahīnajātimaraṇo, brahmacariyassa kevalī. ‘‘Tamahaṃ vadāmi theroti, yassa no santi āsavā; Āsavānaṃ khayā bhikkhu, so theroti pavuccatī’’ti. dutiyaṃ;",
      "english": "Monks, on one occasion, when I was first fully enlightened, I was dwelling at Uruvelā, on the bank of the Nerañjarā River, at the Goatherd's Banyan Tree. Then, monks, many brahmins—aged, old, venerable, well-advanced in years, having reached the full measure of their lives—approached me. Having approached, they exchanged greetings with me. After exchanging courteous and memorable talk, they sat down to one side. Seated to one side, monks, those brahmins said to me: ‘We have heard this, Master Gotama, that the ascetic Gotama does not greet, nor rise up for, nor invite with a seat, brahmins who are aged, old, venerable, well-advanced in years, having reached the full measure of their lives.’ ‘And that, Master Gotama, is indeed true. For Master Gotama does not greet, nor rise up for, nor invite with a seat, brahmins who are aged, old, venerable, well-advanced in years, having reached the full measure of their lives. This, Master Gotama, is not proper behavior.’\n\nThen, monks, it occurred to me: ‘These venerable ones do not understand what makes one an elder, nor the qualities that make one an elder.’ Even if, monks, someone is old—eighty, ninety, or a hundred years of age by birth—and he is one who speaks at an inappropriate time, speaks what is untrue, speaks what is unbeneficial, speaks contrary to the Dhamma, speaks contrary to the Vinaya, and utters speech that is not worth storing, spoken at an inappropriate time, without reference, boundless, and unbeneficial. Then such a one is reckoned as ‘a foolish elder’.\n\nEven if, monks, someone is young—with fresh, jet-black hair, endowed with the fortune of youth, in the prime of life. And he is one who speaks at an appropriate time, speaks what is true, speaks what is beneficial, speaks in accordance with the Dhamma, speaks in accordance with the Vinaya, and utters speech that is worth storing, spoken at an appropriate time, with reference, bounded, and beneficial. Then such a one is reckoned as ‘a wise elder’.\n\nMonks, there are these four qualities that make one an elder. Which four? Here, monks, a bhikkhu is virtuous; he dwells restrained by the Pāṭimokkha restraint, perfect in conduct and domain, seeing danger in the slightest faults, undertaking and training in the training rules. He is learned, a preserver of what he has heard, a cumulative preserver of what he has heard. Those teachings that are good in the beginning, good in the middle, and good in the end, with their meaning and their phrasing, proclaiming a purely complete and purified holy life—such teachings are much heard by him, retained, familiarized verbally, contemplated mentally, and well-penetrated by understanding. He is a frequent obtainer, without difficulty, without trouble, of the four meditative absorptions (jhānas) which are of a higher mind and are dwellings in ease here and now. Through the destruction of the taints, he enters and dwells in the taintless liberation of mind and liberation by wisdom, having realized them for himself with direct knowledge in this very life. These, monks, are the four qualities that make one an elder.\n\nOne whose mind is agitated, who speaks much idle chatter;\nWhose resolves are unconcentrated, a deluded person who delights not in the good Dhamma;\nHe is far from steadiness, with wrong view, disrespectful.\n\nBut one who is endowed with virtue, learned, and discerning;\nRestrained and wise in the teachings, who sees the meaning with wisdom.\n\nOne who has gone beyond all phenomena, unhindered, discerning;\nOne who has abandoned birth and death, a complete practitioner of the holy life.\n\nHim I call an elder, in whom there are no taints;\nA bhikkhu whose taints are destroyed—he is called an elder.",
      "sinhala": "භික්ෂූනි, මම එකල උරුවෙල් දනව්වෙහි නේරංජරා නදී තීරයෙහි වූ අජපාල නුග රුක්මුල මුලින්ම සම්බුද්ධත්වයට පත් වූ අවස්ථාවේ වැඩසිටියෙමි. භික්ෂූනි, එසමයෙහි මහලු, වයෝවෘද්ධ, මහත් ගමනක් ගිය, ආයුෂයේ අවසානයට පැමිණි බොහෝ බ\\u200d්‍රාහ\\u200d්මණයෝ මා වෙත පැමිණියහ. ඔවුහු පැමිණ මා සමඟ සතුටු විය යුතු, සිහි කටයුතු කථා නිමවා එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ඒ බ\\u200d්‍රාහ\\u200d්මණයෝ භික්ෂූනි, මට මෙසේ කීහ: ‘භවත් ගෞතමයන් වහන්ස, අපට අසන්නට ලැබුණා, ශ\\u200d්‍රමණ ගෞතමයන් වහන්සේ වයෝවෘද්ධ, මහලු, වියපත්, ජීවිත ගමනේ අවසානයට පැමිණි බ\\u200d්‍රාහ\\u200d්මණයන්ට වන්දනා නොකරන බවත්, නැගිට පිළි නොගන්නා බවත්, ආසනයකින් ආරාධනා නොකරන බවත්. භවත් ගෞතමයන් වහන්ස, ඒ කාරණය එසේමය. භවත් ගෞතමයන් වහන්සේ වයෝවෘද්ධ, මහලු, වියපත්, ජීවිත ගමනේ අවසානයට පැමිණි බ\\u200d්‍රාහ\\u200d්මණයන්ට වන්දනා නොකරති, නැගිට පිළි නොගනිති, ආසනයකින් ආරාධනා නොකරති. භවත් ගෞතමයන් වහන්ස, මේ කාරණය එතරම් යහපත් නොවේ.’\n\nභික්ෂූනි, එවිට මට මෙසේ සිතුණි: ‘මේ ආයුෂ්මත් බ\\u200d්‍රාහ\\u200d්මණයෝ ථේරයකු (ආධ\\u200d්‍යාත්මික වශයෙන් පරිණත වූ කෙනෙකු) කවරෙක්දැයි හෝ ථේර බව ඇති කරවන ධර\\u200d්මයන් හෝ නොදනිති.’ භික්ෂූනි, යම් කෙනෙක් උපතින් අසූ හැවිරිදි වේවා, අනූ හැවිරිදි වේවා, සිය හැවිරිදි වේවා. එහෙත් ඔහු අකාලයේ කතා කරන්නෙක්, සත්‍ය නොකියන්නෙක්, අනර\\u200d්ථය කියන්නෙක්, ධර\\u200d්මයට පටහැනි දේ කියන්නෙක්, විනයට පටහැනි දේ කියන්නෙක් වේ නම්, නිධානයක් බඳු නොවූ, අකාලයේ, හේතු රහිතව, සීමා රහිතව, අනර\\u200d්ථය පිණිස පවතින වචන නුසුදුසු කලදී කතා කරන්නේ නම්, එවිට ඔහු ‘බාල ථේර’යෙක් ලෙසම ගණන් ගැනේ.\n\nභික්ෂූනි, යම් කෙනෙක් තරුණ වුවත්, ඉතා කළු කෙස් ඇති, යහපත් යොවුන් වියෙන් යුක්ත, ජීවිතයේ මුල් අවධියේ සිටින්නෙක් වුවත්, ඔහු කාලයට අනුව කතා කරන්නෙක්, සත්‍ය කතා කරන්නෙක්, අර\\u200d්ථවත් දේ කතා කරන්නෙක්, ධර\\u200d්මය කතා කරන්නෙක්, විනය කතා කරන්නෙක් වේ නම්, නිධානයක් බඳු වූ, කලට සුදුසු, හේතු සහිත, සීමා සහිත, අර\\u200d්ථවත් වචන කතා කරන්නේ නම්, එවිට ඔහු ‘පණ්ඩිත ථේර’යෙක් ලෙසම ගණන් ගැනේ.\n\nභික්ෂූනි, ථේර බව ඇති කරවන ධර\\u200d්ම සතරක් වෙති. ඒ සතර කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුව සිල්වතෙක් වේ. ප\\u200d්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාරයෙන් හා හැසිරෙන ස්ථානවලින් (ගෝචරයෙන්) යුක්ත වේ. අල්ප මාත\\u200d්‍ර වූ වරදක වුවද බිය දක්නෙක් වේ. ශික්\\u200dෂා පද සමාදන්ව හික්මෙයි. බහුශ\\u200d්‍රැත ඇත්තෙක් වේ, ඇසූ දේ දරාගන්නෙක් වේ, ඇසූ දේ රැස් කරගන්නෙක් වේ. යම් ඒ ධර\\u200d්මයන් මුල මැනවිද, මැද මැනවිද, කෙළවර මැනවිද, අර\\u200d්ථ සහිතව, ව්‍යංජන සහිතව, මුළුමනින්ම පිරිපුන්, පිරිසිදු බ\\u200d්‍රහ\\u200d්මචර්යාව ප\\u200d්‍රකාශ කරන්නේද, එවැනි ධර\\u200d්මයන් ඔහුට බොහෝ ඇසූ පිරූ තැන් ඇති වේ, වචනයෙන් මනාව ධාරණය කර ගත්තක් වේ, මනසින් නිතර මෙනෙහි කර ගත්තක් වේ, දෘෂ්ටියෙන් මනාව අවබෝධ කරගත්තක් වේ. අධිචෛතසික වූ, දැක්කා වූ මේ ආත්මභාවයේදීම සුඛ විහරණ පිණිස පවතින සතර ධ\\u200d්‍යාන කැමති සේ ලබන්නෙක්, දුකක් නැතිව ලබන්නෙක්, අපහසුවක් නැතිව ලබන්නෙක් වේ. ආශ\\u200d්‍රවයන්ගේ ක්\\u200dෂය කිරීමෙන්, ආශ\\u200d්‍රව රහිත චේතෝවිමුක්තිය හා ප\\u200d්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කරගෙන සාක්\\u200dෂාත් කරගෙන වාසය කරයි. භික්ෂූනි, ථේර බව ඇති කරවන මේ ධර\\u200d්ම සතර නම් මේවාය.\n\nයම් කෙනෙක් උද්ධච්ච වූ සිතකින් යුක්තව, බොහෝ ප\\u200d්‍රලාප කතා කරයිද, නොසන්සුන් සංකල්පනා ඇත්තෙක්ද, අසද\\u200d්ධර\\u200d්මයට (අසත්‍ය දහමට) ඇලුම් කරන මෘගයෙක් (අඥාන පුද්ගලයෙක්)ද, මිථ\\u200d්‍යා දෘෂ්ටියෙන් යුක්තව, කිසිදු ගරු සැලකිල්ලකින් තොරව කටයුතු කරන්නේද, ඔහු ස\\u200d්ථිර වූ ථේරත්වයෙන් ඉතා දුරින් සිටින්නේය.\n\nයම් කෙනෙක් සිල්වත් වේද, බහුශ\\u200d්‍රැත වේද, ප\\u200d්‍රතිභාන (ප\\u200d්‍රඥා) සම්පන්න වේද, ධර\\u200d්මයන්හි සංවර වූ, ස\\u200d්ථිර ප\\u200d්‍රඥාවෙන් යුක්ත වේද, ප\\u200d්‍රඥාවෙන් අර\\u200d්ථය විමසයිද,\n\nසියලු ධර\\u200d්මයන්ගේ පරතෙරට පැමිණි, අභිමානයෙන් තොර වූ, ප\\u200d්‍රඥා සම්පන්න වූ, ජාති-මරණ ප\\u200d්‍රහීණ කළ, බ\\u200d්‍රහ\\u200d්මචර්යාව සම්පූර්ණ කළ,\n\nඔහුට මම ථේරයෙක් යැයි කියමි. යමෙකුට ආශ\\u200d්‍රව නැද්ද, ආශ\\u200d්‍රවයන් ක්\\u200dෂය කිරීමෙන් ඒ භික්ෂුව ‘ථේර’ යැයි කියනු ලැබේ.",
      "paliTitle": "Dutiyauruvelasuttaṃ",
      "englishTitle": "Second Uruvela Sutta",
      "sinhalaTitle": "දෙවන උරුවෙල සූත‍්‍රය"
    },
    {
      "number": 23,
      "pali": "‘‘Loko, bhikkhave, tathāgatena abhisambuddho. Lokasmā tathāgato visaṃyutto. Lokasamudayo, bhikkhave, tathāgatena abhisambuddho. Lokasamudayo tathāgatassa pahīno. Lokanirodho, bhikkhave, tathāgatena abhisambuddho. Lokanirodho tathāgatassa sacchikato. Lokanirodhagāminī paṭipadā, bhikkhave, tathāgatena abhisambuddhā. Lokanirodhagāminī paṭipadā tathāgatassa bhāvitā. ‘‘Yaṃ, bhikkhave, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, sabbaṃ taṃ tathāgatena abhisambuddhaṃ. Tasmā ‘tathāgato’ti vuccati. ‘‘Yañca, bhikkhave, rattiṃ tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhati yañca rattiṃ anupādisesāya nibbānadhātuyā parinibbāyati, yaṃ etasmiṃ antare bhāsati lapati niddisati sabbaṃ taṃ tatheva hoti, no aññathā. Tasmā ‘tathāgato’ti vuccati. ‘‘Yathāvādī, bhikkhave, tathāgato tathākārī, yathākārī tathāvādī. Iti yathāvādī tathākārī, yathākārī tathāvādī. Tasmā ‘tathāgato’ti vuccati. ‘‘Sadevake, bhikkhave, loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato abhibhū anabhibhūto aññadatthu daso vasavattī. Tasmā ‘tathāgato’ti vuccati’’. ‘‘Sabbaṃ lokaṃ abhiññāya, sabbaṃ loke yathātathaṃ; Sabbaṃ lokaṃ [sabbaloka (sī. syā. kaṃ. pī.)] visaṃyutto, sabbaloke anūpayo. ‘‘Sa ve sabbābhibhū dhīro, sabbaganthappamocano; Phuṭṭha’ssa paramā santi, nibbānaṃ akutobhayaṃ. ‘‘Esa khīṇāsavo buddho, anīgho chinnasaṃsayo; Sabbakammakkhayaṃ patto, vimutto upadhisaṅkhaye. ‘‘Esa so bhagavā buddho, esa sīho anuttaro; Sadevakassa lokassa, brahmacakkaṃ pavattayī. ‘‘Iti devā manussā ca, ye buddhaṃ saraṇaṃ gatā; Saṅgamma taṃ namassanti, mahantaṃ vītasāradaṃ. ‘‘Danto damayataṃ seṭṭho, santo samayataṃ isi; Mutto mocayataṃ aggo, tiṇṇo tārayataṃ varo. ‘‘Iti hetaṃ namassanti, mahantaṃ vītasāradaṃ; Sadevakasmiṃ lokasmiṃ, natthi te [natthi te (sī. syā. kaṃ. pī.)] paṭipuggalo’’ti. tatiyaṃ;",
      "english": "Monks, the world has been fully awakened to by the Tathāgata. The Tathāgata is unbound from the world. Monks, the origin of the world has been fully awakened to by the Tathāgata. The origin of the world has been abandoned by the Tathāgata. Monks, the cessation of the world has been fully awakened to by the Tathāgata. The cessation of the world has been realized by the Tathāgata. Monks, the path leading to the cessation of the world has been fully awakened to by the Tathāgata. The path leading to the cessation of the world has been developed by the Tathāgata.\n\nMonks, whatever in the world, with its devas, Māras, Brahmās, and its host of ascetics, brahmins, devas, and humans, has been seen, heard, sensed, cognized, attained, searched for, and pondered upon by the mind—all of that has been fully awakened to by the Tathāgata. Therefore, he is called ‘Tathāgata’.\n\nMonks, the night the Tathāgata fully awakens to the unexcelled perfect enlightenment, and the night he attains final Nibbāna in the unconditioned element of Nibbāna—whatever he speaks, declares, and expounds between these two, all of that is just as it is, and not otherwise. Therefore, he is called ‘Tathāgata’.\n\nMonks, as the Tathāgata speaks, so he acts; as he acts, so he speaks. Thus, as he speaks, so he acts; as he acts, so he speaks. Therefore, he is called ‘Tathāgata’.\n\nMonks, in the world with its devas, Māras, Brahmās, and its host of ascetics, brahmins, devas, and humans, the Tathāgata is victorious and unconquered, indeed, he is the master and sovereign. Therefore, he is called ‘Tathāgata’.\n\nHaving directly known the entire world, having truly seen everything in the world as it is, he is disjoined from the entire world, and unattached in the entire world.\n\nIndeed, he is the wise one who overcomes all, released from all ties. He has realized the ultimate peace, Nibbāna, which is utterly fearless.\n\nHe is the Buddha whose taints are destroyed, without affliction, with doubts cut off. Having reached the destruction of all kamma, he is liberated with the complete ending of all acquisitions.\n\nHe is that Blessed One, the Buddha, he is the unexcelled lion. For the world with its devas, he set in motion the supreme wheel of Dharma.\n\nThus, devas and humans, who have gone for refuge to the Buddha, come together and pay homage to him, the great one, free from all anxiety.\n\nHe is the tamed one, supreme among those who tame; the peaceful one, the sage among those who calm; the liberated one, foremost among those who liberate; the one who has crossed over, excellent among those who help others cross.\n\nThus they pay homage to him, the great one, free from all anxiety. In the world with its devas, there is no one equal to him.",
      "sinhala": "භික්ෂූනි, ලෝකය තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද්දකි. තථාගතයන් වහන්සේ ලෝකයෙන් මුළුමනින්ම වෙන් වූ සේක. භික්ෂූනි, ලෝකයේ හටගැනීම තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද්දකි. ලෝකයේ හටගැනීම තථාගතයන් වහන්සේට ප්‍රහීණ වී ඇත. භික්ෂූනි, ලෝකයේ නිරෝධය තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද්දකි. ලෝකයේ නිරෝධය තථාගතයන් වහන්සේ විසින් ප්‍රත්‍යක්ෂ කරන ලද්දකි. භික්ෂූනි, ලෝක නිරෝධයට පමුණුවන ප්‍රතිපදාව තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද්දකි. ලෝක නිරෝධයට පමුණුවන ප්‍රතිපදාව තථාගතයන් වහන්සේ විසින් මනා කොට වඩා වර්ධනය කරන ලද්දකි.\n\nභික්ෂූනි, දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝකයා තුළ යමක් ඇසින් දුටු දෙයක් වේ ද, කනින් ඇසූ දෙයක් වේ ද, නාසයෙන් ආඝ්‍රාණය කළ, දිවෙන් රස වින්ද, කයින් ස්පර්ශ කළ දෙයක් වේ ද, මනසින් දැනගත් දෙයක් වේ ද, ලබන ලද දෙයක් වේ ද, සොයන ලද දෙයක් වේ ද, සිතින් විමසන ලද දෙයක් වේ ද, ඒ සියල්ල තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද්දකි. එහෙයින් උන්වහන්සේ 'තථාගත' යැයි වදාරනු ලැබේ.\n\nභික්ෂූනි, යම් රැයක තථාගතයන් වහන්සේ අනුත්තර වූ සම්‍යක් සම්බෝධියට පැමිණියා ද, යම් රැයක අනුපාදිශේෂ නිර්වාණ ධාතුවෙන් පිරිනිවන් පෑවා ද, ඒ අතරතුර කාලයෙහි යමක් උන්වහන්සේ දේශනා කරන සේක් ද, ප්‍රකාශ කරන සේක් ද, විස්තර කරන සේක් ද, ඒ සියල්ල ඒ අයුරින්ම වන්නේ ය, වෙනත් අයුරකින් නොවේ. එහෙයින් උන්වහන්සේ 'තථාගත' යැයි වදාරනු ලැබේ.\n\nභික්ෂූනි, තථාගතයන් වහන්සේ යමක් වදාළා ද, එය එලෙසින්ම ක්‍රියාත්මක කරන සේක; යමක් ක්‍රියාත්මක කළා ද, එය එලෙසින්ම වදාළ සේක. මෙලෙස, යමක් වදාළා ද, එය එලෙසින්ම ක්‍රියාත්මක කරන සේක; යමක් ක්‍රියාත්මක කළා ද, එය එලෙසින්ම වදාළ සේක. එහෙයින් උන්වහන්සේ 'තථාගත' යැයි වදාරනු ලැබේ.\n\nභික්ෂූනි, දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝකය තුළ, තථාගතයන් වහන්සේ සියල්ල අභිභවා සිටින සේක, කිසිවෙකුට අභිභවා ගත නොහැකි සේක, අන් කිසිවකුට නොදෙවෙනිව වසවර්තීව සිටින සේක. එහෙයින් උන්වහන්සේ 'තථාගත' යැයි වදාරනු ලැබේ.\n\nමුළු ලෝකයම අවබෝධ කොට,\nලෝකයෙහි ඇති සියල්ල එලෙසින්ම දැනගෙන,\nමුළු ලෝකයෙන්ම වෙන් වී,\nමුළු ලෝකය කෙරෙහි කිසිදු බැඳීමක් නැති තැනැත්තා ය.\n\nඒ ධීරයා සැබවින්ම සියල්ල ජයගත් තැනැත්තා ය,\nසියලු බැඳීම් මුදා හැරිය තැනැත්තා ය;\nඋන්වහන්සේ පරම ශාන්තිය ස්පර්ශ කර ඇත,\nබිය රහිත වූ නිවනට පත් වී ඇත.\n\nඋන්වහන්සේ ක්ෂීණාශ්‍රව වූ බුදුරදුන් ය,\nකිසිදු දුකක් නැති, සැක දුරු කළ තැනැත්තා ය;\nසියලු කර්මයන්ගේ ක්ෂය වීම ලබා ඇති,\nඋපධීන්ගේ සංඛය තුළින් විමුක්ත වූ තැනැත්තා ය.\n\nඋන්වහන්සේ භාග්‍යවතුන් වහන්සේ වන බුදුරදුන් ය,\nඋන්වහන්සේ අනුත්තර වූ සිංහයා ය;\nදෙවියන් සහිත ලෝකයා උදෙසා\nබ්‍රහ්ම චක්‍රය (උතුම් වූ ධර්ම චක්‍රය) ප්‍රවර්තනය කළ සේක.\n\nමෙලෙස දෙවියෝ ද, මනුෂ්‍යයෝ ද,\nයම් කෙනෙක් බුදුරදුන් සරණ ගියා ද;\nඔවුහු එක්ව, සාරද භාවයෙන් තොර වූ,\nමහත් වූ උන්වහන්සේට නමස්කාර කරති.\n\nදමනය වන්නන් අතර දමනය වූ ශ්‍රේෂ්ඨයා ය,\nශාන්තභාවයට පත්වන්නන් අතර ශාන්ත වූ ඍෂිවරයා ය;\nනිදහස් වන්නන් අතර අග්‍ර වූ මුක්තයා ය,\nඑතෙර වන්නන් අතර වර වූ එතෙර කළ තැනැත්තා ය.\n\nඑහෙයින්ම ඔවුහු සාරද භාවයෙන් තොර වූ,\nමහත් වූ උන්වහන්සේට නමස්කාර කරති;\nදෙවියන් සහිත මේ ලෝකයෙහි උන්වහන්සේට\nසම කළ හැකි කිසිදු පුද්ගලයෙක් නැත්තේ ය.",
      "paliTitle": "Lokasuttaṃ",
      "englishTitle": "The World Discourse",
      "sinhalaTitle": "ලෝක සූත්‍රය"
    },
    {
      "number": 24,
      "pali": "Ekaṃ samayaṃ bhagavā sākete viharati kāḷakārāme [koḷikārāme (ka.)]. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Yaṃ, bhikkhave, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tamahaṃ jānāmi. ‘‘Yaṃ, bhikkhave, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tamahaṃ abbhaññāsiṃ. Taṃ tathāgatassa viditaṃ, taṃ tathāgato na upaṭṭhāsi. ‘‘Yaṃ, bhikkhave, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tamahaṃ na jānāmīti vadeyyaṃ, taṃ mamassa musā. ‘‘Yaṃ, bhikkhave…pe… tamahaṃ jānāmi ca na ca jānāmīti vadeyyaṃ, taṃpassa [taṃ pissa (syā. kaṃ.), taṃ mamassa (ka.)] tādisameva. ‘‘Yaṃ, bhikkhave…pe… tamahaṃ neva jānāmi na na jānāmīti vadeyyaṃ, taṃ mamassa kali. ‘‘Iti kho, bhikkhave, tathāgato daṭṭhā daṭṭhabbaṃ, diṭṭhaṃ na maññati, adiṭṭhaṃ na maññati, daṭṭhabbaṃ na maññati, daṭṭhāraṃ na maññati; sutvā sotabbaṃ, sutaṃ na maññati, asutaṃ na maññati, sotabbaṃ na maññati, sotāraṃ na maññati; mutvā motabbaṃ, mutaṃ na maññati, amutaṃ na maññati, motabbaṃ na maññati, motāraṃ na maññati; viññatvā viññātabbaṃ, viññātaṃ na maññati, aviññātaṃ na maññati, viññātabbaṃ na maññati, viññātāraṃ na maññati. Iti kho, bhikkhave, tathāgato diṭṭhasutamutaviññātabbesu dhammesu tādīyeva tādī [tādisova tādī (syā. kaṃ.), tādise yeva tādī (pī.), tādīyeva tādīyevekā (ka.)]. Tamhā ca pana tādimhā [tāditamhā (sī. pī.)] añño tādī uttaritaro vā paṇītataro vā natthīti vadāmī’’ti. ‘‘Yaṃ kiñci diṭṭhaṃva sutaṃ mutaṃ vā, Ajjhositaṃ saccamutaṃ paresaṃ; Na tesu tādī sayasaṃvutesu, Saccaṃ musā vāpi paraṃ daheyya. ‘‘Etañca sallaṃ paṭikacca [paṭigacca (sī. pī.)] disvā, Ajjhositā yattha pajā visattā; Jānāmi passāmi tatheva etaṃ, Ajjhositaṃ natthi tathāgatāna’’ntntti. catutthaṃ;",
      "english": "At one time, the Blessed One was dwelling in Sāketa, at the Kālakarama Monastery. There, the Blessed One addressed the monks, saying: \"Monks!\" Those monks responded to the Blessed One, \"Venerable Sir!\" The Blessed One then spoke thus:\n\n\"Monks, whatever is seen, heard, sensed, cognized, attained, sought after, and investigated with the mind by the world with its devas, Māra, Brahmā, its ascetics and brahmins, its devas and humans – that I know. Monks, whatever is seen, heard, sensed, cognized, attained, sought after, and investigated with the mind by the world with its devas, Māra, Brahmā, its ascetics and brahmins, its devas and humans – that I have fully comprehended. That is known by the Tathāgata, yet the Tathāgata does not cling to it. Monks, if I were to say of that [same range of experience], 'I do not know that,' that would be a falsehood on my part. Monks, if I were to say of that [same range of experience], 'I both know it and do not know it,' that would likewise be similar. Monks, if I were to say of that [same range of experience], 'I neither know it nor do not know it,' that would be an impropriety on my part. Thus, Monks, having seen what is to be seen, the Tathāgata does not conceive of the seen, does not conceive of the unseen, does not conceive of what is to be seen, does not conceive of the seer; having heard what is to be heard, does not conceive of the heard, does not conceive of the unheard, does not conceive of what is to be heard, does not conceive of the hearer; having sensed what is to be sensed, does not conceive of the sensed, does not conceive of the unsensed, does not conceive of what is to be sensed, does not conceive of the sensor; having cognized what is to be cognized, does not conceive of the cognized, does not conceive of the uncognized, does not conceive of what is to be cognized, does not conceive of the cognizer. Thus, Monks, regarding phenomena seen, heard, sensed, and cognized, the Tathāgata is truly unperturbed. And I declare that there is no other unperturbed one more exalted or more sublime than this Unperturbed One.\"\n\n\"Whatever is seen, heard, or sensed,\nThat which others cling to as truth or falsity;\nAmong those, the Unperturbed One, fully restrained,\nDoes not incite another concerning truth or falsehood.\nAnd having seen this barb beforehand,\nBy which beings are clinging and entrapped;\nI know and see this just as it is;\nFor the Tathāgatas, there is no clinging.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සාකේත නුවර කාළකාරාමයෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍රජාව විසින් යමක් දකින ලද්දේද, අසන ලද්දේද, (නාසය, දිව, කය යන) අන් ඉන්ද්‍රියයන්ගෙන් විඳින ලද්දේද, (මනසින්) දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් නැවත නැවත විමසන ලද්දේද, ඒ සියල්ල මම දනිමි.\"\n\n\"මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍රජාව විසින් යමක් දකින ලද්දේද, අසන ලද්දේද, (නාසය, දිව, කය යන) අන් ඉන්ද්‍රියයන්ගෙන් විඳින ලද්දේද, (මනසින්) දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් නැවත නැවත විමසන ලද්දේද, එය මම අවබෝධ කළෙමි. එය තථාගතයාණන් වහන්සේට යථාර්ථයෙන්ම වැටහුණේය. තථාගතයන් වහන්සේ එයට (තෘෂ්ණාවෙන්) නොඇලුණේය.\"\n\n\"මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍රජාව විසින් යමක් දකින ලද්දේද, අසන ලද්දේද, (නාසය, දිව, කය යන) අන් ඉන්ද්‍රියයන්ගෙන් විඳින ලද්දේද, (මනසින්) දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් නැවත නැවත විමසන ලද්දේද, ඒ සියල්ල මම නොදනිමි යැයි මම කියන්නේ නම්, එය මට මුසාවක් වන්නේය.\"\n\n\"මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍රජාව විසින් යමක් දකින ලද්දේද, අසන ලද්දේද, (නාසය, දිව, කය යන) අන් ඉන්ද්‍රියයන්ගෙන් විඳින ලද්දේද, (මනසින්) දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් නැවත නැවත විමසන ලද්දේද, ඒ සියල්ල මම දනිමි ද නොදනිමි ද යැයි මම කියන්නේ නම්, එය ද එවැනිම (මුසාවක්) වන්නේය.\"\n\n\"මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍රජාව විසින් යමක් දකින ලද්දේද, අසන ලද්දේද, (නාසය, දිව, කය යන) අන් ඉන්ද්‍රියයන්ගෙන් විඳින ලද්දේද, (මනසින්) දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, මනසින් නැවත නැවත විමසන ලද්දේද, ඒ සියල්ල මම නොදනිමි ද නොදනිමි නොවේ ද යැයි මම කියන්නේ නම්, එය මට දොසක් වන්නේය.\"\n\n\"මහණෙනි, මෙසේ තථාගතයාණන් වහන්සේ දැකීමට සුදුසු දේ දැක, තමා විසින් දකින ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; නොදකින ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; දැකිය යුත්ත (ආත්මයක් වශයෙන්) නොසලකන සේක; දකින්නා ද (ආත්මයක් වශයෙන්) නොසලකන සේක. ඇසීමට සුදුසු දේ අසා, අසන ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; නොඅසන ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; ඇසිය යුත්ත (ආත්මයක් වශයෙන්) නොසලකන සේක; අසන්නා ද (ආත්මයක් වශයෙන්) නොසලකන සේක. (නාසය, දිව, කය යන) අන් ඉන්ද්‍රියයන්ගෙන් විඳීමට සුදුසු දේ විඳ, විඳින ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; නොවිඳින ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; විඳිය යුත්ත (ආත්මයක් වශයෙන්) නොසලකන සේක; විඳින්නා ද (ආත්මයක් වශයෙන්) නොසලකන සේක. (මනසින්) දැනගැනීමට සුදුසු දේ දැන, දැනගන්නා ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; නොදැනගන්නා ලද්ද (ආත්මයක් වශයෙන්) නොසලකන සේක; දැනගත යුත්ත (ආත්මයක් වශයෙන්) නොසලකන සේක; දැනගන්නා ද (ආත්මයක් වශයෙන්) නොසලකන සේක. මහණෙනි, මෙසේ තථාගතයාණන් වහන්සේ දකින ලද, අසන ලද, (අන් ඉන්ද්‍රියන්ගෙන්) විඳින ලද, (මනසින්) දැනගන්නා ලද මේ ධර්මයන් (ප්‍රපංචයන්) සම්බන්ධයෙන් එකාකාර ස්වභාවයෙන් යුක්ත වූ සේක. එබඳු තාදී ස්වභාවයෙන් වෙනත් උසස් වූ හෝ ප්‍රණීත වූ තාදී ස්වභාවයක් නොමැතැයි මම කියමි.\"\n\nයම් කිසි දැකීමක් හෝ ඇසීමක් හෝ විඳීමක් හෝ වේ ද, අන්‍යයන් විසින් සත්‍ය යැයි හෝ මුසාව යැයි හෝ දැඩිව අල්ලාගෙන සිටින යම් දෙයක් වේ ද, තමා විසින්ම (ඉන්ද්‍රියන්) සංවර කරගත් තාදී වූ (තථාගතයන් වහන්සේ) ඒවාට නොඇලෙති, ඒවායින් කම්පා නොවෙති. (තථාගතයන් වහන්සේ) සත්‍යයක් හෝ අසත්‍යයක් හෝ (පිළිබඳව ඇතිවන වාද විවාද මගින්) අන්‍යයන්ව පීඩාවට පත් නොකරති.\n\nයම් තැනක ප්‍රජාව දැඩි සේ ඇලී, බැඳී සිටිත් ද, ඒ තෘෂ්ණා හුළ පෙරදීම දැක, එය එලෙසම මම දනිමි, මම දකිමි. තථාගතයන් වහන්සේලාට (කිසිවකට) ඇලීමක් නැත.",
      "paliTitle": "Kāḷakārāmasuttaṃ",
      "englishTitle": "The Kāḷakārāma Discourse",
      "sinhalaTitle": "කාලකාරාම සූත්‍රය"
    },
    {
      "number": 25,
      "pali": "‘‘Nayidaṃ, bhikkhave, brahmacariyaṃ vussati janakuhanatthaṃ, na janalapanatthaṃ, na lābhasakkārasilokānisaṃsatthaṃ, na itivādappamokkhānisaṃsatthaṃ, na ‘iti maṃ jano jānātū’ti. Atha kho idaṃ, bhikkhave, brahmacariyaṃ vussati saṃvaratthaṃ pahānatthaṃ virāgatthaṃ nirodhattha’’nti. ‘‘Saṃvaratthaṃ pahānatthaṃ, brahmacariyaṃ anītihaṃ; Adesayi so bhagavā, nibbānogadhagāminaṃ; Esa maggo mahantehi [mahattebhi (ka.) itivu. 35], anuyāto mahesibhi. ‘‘Ye ca taṃ paṭipajjanti, yathā buddhena desitaṃ; Dukkhassantaṃ karissanti, satthusāsanakārino’’ti. pañcamaṃ;",
      "english": "Monks, this holy life is not lived for the purpose of deceiving people, nor for flattering people, nor for the advantage of gain, honor, or fame, nor for the advantage of being freed from blame or argument, nor for the thought, ‘May people know me thus.’ But rather, monks, this holy life is lived for the purpose of restraint, for abandoning, for dispassion, for cessation.\n\nThe unblemished holy life is for restraint, for abandoning. The Blessed One proclaimed it, leading to the depth of Nibbāna. This path has been followed by the great ones, by the great sages.\n\nAnd those who practice it, as taught by the Buddha, will make an end to suffering, being doers of the Teacher's instruction.",
      "sinhala": "භික්ෂූණි, මේ බ්‍රහ්මචර්යාව පවත්වනු ලබන්නේ මිනිසුන් රැවටීම සඳහා නොවේ, මිනිසුන්ට ප්‍‍රශංසා කරනු පිණිස ද නොවේ, ලාභ, සත්කාර, කීර්ති ප්‍‍රශංසා යන අනුසස් පිණිස ද නොවේ, අනුන්ගේ දෝෂාරෝපණයෙන් මිදීමේ අනුසස් පිණිස ද නොවේ, ‘මිනිසුන් මා මේ ආකාරයෙන් දැනගන්නවා වේවා’ යන අදහසින් ද නොවේ. එහෙත් භික්ෂූණි, මේ බ්‍රහ්මචර්යාව පවත්වනු ලබන්නේ සංවරය පිණිස, ප්‍‍රහාණය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස ය.\n\nසංවරය පිණිසත්, ප්‍‍රහාණය පිණිසත්, නිරුපද්‍රිත වූ බ්‍රහ්මචර්යාව නිර්වාණයට අවතීර්ණ කරවන ලෙස ඒ භාග්‍‍යවතුන් වහන්සේ දේශනා කළ සේක. මේ මාර්ගය මහත්වරුන් විසින් ද, මහා ඍෂිවරුන් විසින් ද අනුගමනය කරන ලද්දකි.\n\nයම් කෙනෙක් බුදුරජාණන් වහන්සේ විසින් දේශනා කරන ලද පරිදි එය පිළිපදින්නෝ ද, ශාස්තෘන් වහන්සේගේ ශාසනය අනුගමනය කරන්නාහු වූ ඒ අය දුක්ඛයාගේ කෙළවර කරනු ඇත.",
      "paliTitle": "Brahmacariyasuttaṃ",
      "englishTitle": "Discourse on the Holy Life",
      "sinhalaTitle": "බ්‍රහ්මචර්‍යාව සූත්‍රය"
    },
    {
      "number": 26,
      "pali": "[itivu. 108 itivuttakepi] ‘‘Ye te, bhikkhave, bhikkhū kuhā thaddhā lapā siṅgī unnaḷā asamāhitā, na me te, bhikkhave, bhikkhū māmakā. Apagatā ca te, bhikkhave, bhikkhū imasmā dhammavinayā, na ca te imasmiṃ dhammavinaye vuddhiṃ viruḷhiṃ vepullaṃ āpajjanti. Ye ca kho te, bhikkhave, bhikkhū nikkuhā nillapā dhīrā atthaddhā susamāhitā, te kho me, bhikkhave, bhikkhū māmakā. Anapagatā ca te, bhikkhave, bhikkhū imasmā dhammavinayā. Te ca imasmiṃ dhammavinaye vuddhiṃ viruḷhiṃ vepullaṃ āpajjantī’’ti. [itivu. 108 itivuttakepi] ‘‘Kuhā thaddhā lapā siṅgī, unnaḷā asamāhitā; Na te dhamme virūhanti, sammāsambuddhadesite. ‘‘Nikkuhā nillapā dhīrā, atthaddhā susamāhitā; Te ve dhamme virūhanti, sammāsambuddhadesite’’ti. chaṭṭhaṃ;",
      "english": "Those monks, O bhikkhus, who are deceitful, stubborn, boastful, showy, haughty, and unconcentrated—those monks, O bhikkhus, are not truly mine. And those monks, O bhikkhus, are alienated from this Dhamma and Discipline, and they do not attain growth, development, and maturity in this Dhamma and Discipline. But those monks, O bhikkhus, who are without deceit, not boastful, wise, not stubborn, and well-concentrated—indeed, those monks, O bhikkhus, are truly mine. And those monks, O bhikkhus, are not alienated from this Dhamma and Discipline. And they attain growth, development, and maturity in this Dhamma and Discipline.\n\nDeceitful, stubborn, boastful, showy, haughty, and unconcentrated;\nThey do not flourish in the Dhamma taught by the Perfectly Self-Awakened One.\nWithout deceit, not boastful, wise, not stubborn, and well-concentrated;\nIndeed, they flourish in the Dhamma taught by the Perfectly Self-Awakened One.",
      "sinhala": "භික්ෂූනි, යම් භික්ෂූහු කූට වෙත්ද, ස්ථද්ධ වෙත්ද, වාචාල වෙත්ද, ලාභ සත්කාර පිණිස අනුන් පිනවන්නෝ වෙත්ද, උඩඟු වෙත්ද, සමාධියෙන් තොර වෙත්ද, භික්ෂූනි, ඒ භික්ෂූහු මාගේ ශ්‍රාවකයෝ නොවෙති. භික්ෂූනි, ඒ භික්ෂූහු මේ ධර්ම විනයෙන් බැහැර වූවෝ වෙත්. තවද ඔවුහු මේ ධර්ම විනයෙහි වර්ධනයට, වැඩි දියුණුවට, විපුල බවට නොපැමිණෙත්. යම් භික්ෂූහු කූටකම් නැත්තෝ වෙත්ද, වාචාලකම් නැත්තෝ වෙත්ද, නුවණැත්තෝ වෙත්ද, නොඋඩඟු වෙත්ද, මැනවින් සමාධිමත් වූවෝ වෙත්ද, භික්ෂූනි, ඒ භික්ෂූහු මාගේ ශ්‍රාවකයෝ වෙත්. භික්ෂූනි, ඒ භික්ෂූහු මේ ධර්ම විනයෙන් බැහැර නොවූවෝ වෙත්. තවද ඔවුහු මේ ධර්ම විනයෙහි වර්ධනයට, වැඩි දියුණුවට, විපුල බවට පැමිණෙත්.\n\nකූට වංචනික වූ, ස්ථද්ධ වූ, වාචාල වූ, අනුන් පිනවන්නා වූ, උඩඟු වූ, සමාධියක් නැති වූ (යම් භික්ෂූහු වෙත්ද), සම්මාසම්බුදුරදුන් විසින් දේශනා කරන ලද ධර්මයෙහි ඔවුහු වැඩෙන්නේ නැත.\nකූටකම් නැති, වාචාලකම් නැති, නුවණැති, නොඋඩඟු වූ, මැනවින් සමාධිමත් වූ (යම් භික්ෂූහු වෙත්ද), සම්මාසම්බුදුරදුන් විසින් දේශනා කරන ලද ධර්මයෙහි ඔවුහු වැඩෙන්නාහ.",
      "paliTitle": "Kuhasuttaṃ",
      "englishTitle": "The Discourse on Deceit",
      "sinhalaTitle": "කුහ සූත්‍රය"
    },
    {
      "number": 27,
      "pali": "‘‘Cattārimāni, bhikkhave, appāni ca [ceva (ka.)] sulabhāni ca, tāni ca anavajjāni. Katamāni cattāri? Paṃsukūlaṃ, bhikkhave, cīvarānaṃ appañca sulabhañca, tañca anavajjaṃ. Piṇḍiyālopo, bhikkhave, bhojanānaṃ appañca sulabhañca, tañca anavajjaṃ. Rukkhamūlaṃ, bhikkhave, senāsanānaṃ appañca sulabhañca, tañca anavajjaṃ. Pūtimuttaṃ, bhikkhave, bhesajjānaṃ appañca sulabhañca, tañca anavajjaṃ. Imāni kho, bhikkhave, cattāri appāni ca sulabhāni ca, tāni ca anavajjāni. Yato kho, bhikkhave, bhikkhu appena ca tuṭṭho hoti sulabhena ca, idamassāhaṃ aññataraṃ sāmaññaṅganti [sāmaññanti (ka.)] vadāmī’’ti. ‘‘Anavajjena tuṭṭhassa, appena sulabhena ca; Na senāsanamārabbha, cīvaraṃ pānabhojanaṃ; Vighāto hoti cittassa, disā nappaṭihaññati. ‘‘Ye cassa dhammā akkhātā, sāmaññassānulomikā; Adhiggahitā tuṭṭhassa, appamattassa sikkhato’’ti. sattamaṃ;",
      "english": "Monks, these four things are meager and easily obtainable, and they are blameless. Which four? Monks, a rag-robe among robes is meager and easily obtainable, and it is blameless. Monks, alms food among foods is meager and easily obtainable, and it is blameless. Monks, dwelling at the foot of a tree among lodgings is meager and easily obtainable, and it is blameless. Monks, fermented urine among medicines is meager and easily obtainable, and it is blameless. These four things, monks, are indeed meager and easily obtainable, and they are blameless. When a monk, monks, is content with what is meager and easily obtainable, I declare this to be one of the factors of recluseship.\n\nFor one who is content with what is blameless, with what is meager and easily obtainable, no vexation arises in the mind concerning dwellings, robes, drinks, or food, and his direction is not impeded. And those teachings proclaimed conducive to recluseship are firmly grasped by one who is content, diligent, and training.",
      "sinhala": "මහණෙනි, මේ සතර දහම් අල්ප වූද, පහසුවෙන් ලැබිය හැකි වූද, නිර්දෝෂ වූවාහුද වෙති. කවර සතරක්ද?\n\nමහණෙනි, සිවුරු අතුරින් පංසූකූලය අල්ප වූද, පහසුවෙන් ලැබිය හැකි වූද, එය නිර්දෝෂ වූවකි. මහණෙනි, භෝජන අතුරින් පිණ්ඩපාතය අල්ප වූද, පහසුවෙන් ලැබිය හැකි වූද, එය නිර්දෝෂ වූවකි. මහණෙනි, සේනාසන අතුරින් රුක්මුල අල්ප වූද, පහසුවෙන් ලැබිය හැකි වූද, එය නිර්දෝෂ වූවකි. මහණෙනි, ඖෂධ අතුරින් පූතිමුත්තය අල්ප වූද, පහසුවෙන් ලැබිය හැකි වූද, එය නිර්දෝෂ වූවකි.\n\nමහණෙනි, මේවාමයි ඒ සතර, අල්ප වූද, පහසුවෙන් ලැබිය හැකි වූද, නිර්දෝෂ වූවාහු. මහණෙනි, යම් හෙයකින් භික්ෂුවක් අල්ප වූ දෙයින්ද, පහසුවෙන් ලැබෙන දෙයින්ද සතුටු වන්නේද, එය මා විසින් ශ්‍රමණ ධර්මයේ එක් අංගයක් ලෙස කියමි.\n\nනිර්දෝෂ වූ, අල්ප වූ, පහසුවෙන් ලැබිය හැකි දෙයින් සතුටු වන්නාගේ සිතට සේනාසන, සිවුරු, පාන වර්ග හෝ ආහාර හේතුවෙන් කිසිදු බාධාවක් හෝ දුකක් ඇති නොවේ. ඔහුට කිසිදු දිශාවක් අවහිර නොවේ.\nශ්‍රමණ ධර්මයට අනුලෝම වූ යම් ධර්මයන් ඔහුට දේශනා කරන ලද්දේද, ඒවා අප්‍රමාදීව හික්මෙන, එලෙස සතුටු වූ තැනැත්තා විසින් මැනවින් අවබෝධ කරගන්නා ලදී.",
      "paliTitle": "Santuṭṭhisuttaṃ",
      "englishTitle": "The Discourse on Contentment",
      "sinhalaTitle": "සන්තුට්ඨි සූත්‍\\u200Dරය"
    },
    {
      "number": 28,
      "pali": "‘‘Cattārome, bhikkhave, ariyavaṃsā aggaññā rattaññā vaṃsaññā porāṇā asaṃkiṇṇā asaṃkiṇṇapubbā, na saṃkīyanti na saṃkīyissanti, appaṭikuṭṭhā samaṇehi brāhmaṇehi viññūhi. Katame cattāro? Idha, bhikkhave, bhikkhu santuṭṭho hoti itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca vaṇṇavādī, na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjati, aladdhā ca cīvaraṃ na paritassati, laddhā ca cīvaraṃ agadhito [agathito (sī. pī.)] amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati; tāya ca pana itarītaracīvarasantuṭṭhiyā nevattānukkaṃseti, no [na (dī. ni. 3.309)] paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno patissato, ayaṃ vuccati, bhikkhave, bhikkhu porāṇe aggaññe ariyavaṃse ṭhito. ‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītarena piṇḍapātena, itarītarapiṇḍapātasantuṭṭhiyā ca vaṇṇavādī, na ca piṇḍapātahetu anesanaṃ appatirūpaṃ āpajjati, aladdhā ca piṇḍapātaṃ na paritassati, laddhā ca piṇḍapātaṃ agadhito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati; tāya ca pana itarītarapiṇḍapātasantuṭṭhiyā nevattānukkaṃseti, no paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno patissato, ayaṃ vuccati, bhikkhave, bhikkhu porāṇe aggaññe ariyavaṃse ṭhito. ‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītarena senāsanena, itarītarasenāsanasantuṭṭhiyā ca vaṇṇavādī, na ca senāsanahetu anesanaṃ appatirūpaṃ āpajjati, aladdhā ca senāsanaṃ na paritassati, laddhā ca senāsanaṃ agadhito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati; tāya ca pana itarītarasenāsanasantuṭṭhiyā nevattānukkaṃseti, no paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno patissato, ayaṃ vuccati, bhikkhave, bhikkhu porāṇe aggaññe ariyavaṃse ṭhito. ‘‘Puna caparaṃ, bhikkhave, bhikkhu bhāvanārāmo hoti bhāvanārato, pahānārāmo hoti pahānarato; tāya ca pana bhāvanārāmatāya bhāvanāratiyā pahānārāmatāya pahānaratiyā nevattānukkaṃseti, no paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno patissato, ayaṃ vuccati, bhikkhave, bhikkhu porāṇe aggaññe ariyavaṃse ṭhito. Ime kho, bhikkhave, cattāro ariyavaṃsā aggaññā rattaññā vaṃsaññā porāṇā asaṃkiṇṇā asaṃkiṇṇapubbā, na saṃkīyanti na saṃkīyissanti, appaṭikuṭṭhā samaṇehi brāhmaṇehi viññūhi. ‘‘Imehi ca pana, bhikkhave, catūhi ariyavaṃsehi samannāgato bhikkhu puratthimāya cepi disāya viharati sveva aratiṃ sahati, na taṃ arati sahati; pacchimāya cepi disāya viharati sveva aratiṃ sahati, na taṃ arati sahati; uttarāya cepi disāya viharati sveva aratiṃ sahati, na taṃ arati sahati; dakkhiṇāya cepi disāya viharati sveva aratiṃ sahati, na taṃ arati sahati. Taṃ kissa hetu? Aratiratisaho hi, bhikkhave, dhīro’’ti. ‘‘Nārati sahati dhīraṃ [vīraṃ (sī.)], nārati dhīraṃ sahati; Dhīrova aratiṃ sahati, dhīro hi aratissaho. ‘‘Sabbakammavihāyīnaṃ, panuṇṇaṃ [paṇunnaṃ (?)] ko nivāraye; Nekkhaṃ jambonadasseva, ko taṃ ninditumarahati; Devāpi naṃ pasaṃsanti, brahmunāpi pasaṃsito’’ti. aṭṭhamaṃ;",
      "english": "These four, bhikkhus, are the Noble Lineages: foremost, long-standing, traditional, and ancient; unadulterated, never before adulterated; not liable to be confused, nor will they be liable to be confused; not reproached by ascetics, brahmins, or the discerning. Which four?\n\nHere, bhikkhus, a bhikkhu is content with any sort of robe, and speaks in praise of contentment with any sort of robe. For the sake of robes, he does not pursue an unseemly quest. Not obtaining a robe, he does not fret. Obtaining a robe, he uses it unattached, uninfatuated, uncommitted, seeing its danger and with wisdom of escape. And with that contentment with any sort of robe, he neither exalts himself nor disparages others. Whoever in this matter is skillful, energetic, clearly comprehending, and mindful – that bhikkhu, bhikkhus, is said to be established in the ancient, foremost Noble Lineage.\n\nFurthermore, bhikkhus, a bhikkhu is content with any sort of almsfood, and speaks in praise of contentment with any sort of almsfood. For the sake of almsfood, he does not pursue an unseemly quest. Not obtaining almsfood, he does not fret. Obtaining almsfood, he uses it unattached, uninfatuated, uncommitted, seeing its danger and with wisdom of escape. And with that contentment with any sort of almsfood, he neither exalts himself nor disparages others. Whoever in this matter is skillful, energetic, clearly comprehending, and mindful – that bhikkhu, bhikkhus, is said to be established in the ancient, foremost Noble Lineage.\n\nFurthermore, bhikkhus, a bhikkhu is content with any sort of dwelling, and speaks in praise of contentment with any sort of dwelling. For the sake of a dwelling, he does not pursue an unseemly quest. Not obtaining a dwelling, he does not fret. Obtaining a dwelling, he uses it unattached, uninfatuated, uncommitted, seeing its danger and with wisdom of escape. And with that contentment with any sort of dwelling, he neither exalts himself nor disparages others. Whoever in this matter is skillful, energetic, clearly comprehending, and mindful – that bhikkhu, bhikkhus, is said to be established in the ancient, foremost Noble Lineage.\n\nFurthermore, bhikkhus, a bhikkhu delights in mental cultivation and is devoted to mental cultivation. He delights in abandonment and is devoted to abandonment. And with that delight in mental cultivation and devotion to mental cultivation, delight in abandonment and devotion to abandonment, he neither exalts himself nor disparages others. Whoever in this matter is skillful, energetic, clearly comprehending, and mindful – that bhikkhu, bhikkhus, is said to be established in the ancient, foremost Noble Lineage.\n\nThese, bhikkhus, are the four Noble Lineages: foremost, long-standing, traditional, and ancient; unadulterated, never before adulterated; not liable to be confused, nor will they be liable to be confused; not reproached by ascetics, brahmins, or the discerning.\n\nAnd furthermore, bhikkhus, a bhikkhu endowed with these four Noble Lineages, if he dwells in the eastern direction, he himself overcomes discontent; discontent does not overcome him. If he dwells in the western direction, he himself overcomes discontent; discontent does not overcome him. If he dwells in the northern direction, he himself overcomes discontent; discontent does not overcome him. If he dwells in the southern direction, he himself overcomes discontent; discontent does not overcome him. Why is that? Because, bhikkhus, the wise one is an overcomer of discontent.\n\nDiscontent does not overcome the wise one, discontent does not overcome the wise one.\nThe wise one alone overcomes discontent, for the wise one is an overcomer of discontent.\nWho can hinder those who have abandoned all actions, those who have cast off all defilements?\nWho is fit to blame him, who is like pure Jambu river gold?\nEven the devas praise him, and he is praised even by Brahmā.",
      "sinhala": "මහණෙනි, මේ ආර්ය වංශ සතරක් ඇත. ඒවා අග්‍ර වූවෝ ය, ප්‍රිය මනාප වූවෝ ය, වංශවත් වූවෝ ය, පෞරාණික වූවෝ ය, කිලිටි නැත්තාහ, පෙර කිලිටි නොවූවාහ, කිලිටි නොවන්නාහ, කිලිටි නොවන්නෝ ද වන්නාහ. ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නින්දා නොකරන ලද්දාහ. ඒ සතර කවරේ ද?\n\nමහණෙනි, මෙහිලා භික්ෂුවක් ඕනෑම සිවුරකින් සතුටු වන්නේ ය. ඕනෑම සිවුරකින් සතුටු වීම ප්‍රශංසා කරන්නේ ය. සිවුරු නිසා අනුචිත වූ සොයාගැනීමකට නොපෙළඹෙන්නේ ය. සිවුරු නොලැබීමෙන් නොතැවෙන්නේ ය. සිවුරු ලැබූ විට බැඳීම් රහිතව, මුසපත් නොවී, ඇලීම් රහිතව, ආදීනව දක්නා නුවණින්, නිදහස් වීමේ ප්‍රඥාවෙන් යුතුව පරිභෝග කරන්නේ ය. එසේම, ඕනෑම සිවුරකින් සතුටු වීම නිසා තමාට ප්‍රශංසා කර නොගන්නේ ය, අනුන් හෙළා නොදකිනේ ය. යම් කෙනෙක් එහිලා දක්ෂ වන්නේ ද, අලස නොවන්නේ ද, මනා සිහියෙන් යුක්ත වන්නේ ද, එබඳු භික්ෂුව මහණෙනි, පෞරාණික වූ අග්‍ර ආර්ය වංශයෙහි පිහිටියේ යැයි කියනු ලැබේ.\n\nමහණෙනි, තවද, භික්ෂුවක් ඕනෑම පිණ්ඩපාතයකින් සතුටු වන්නේ ය. ඕනෑම පිණ්ඩපාතයකින් සතුටු වීම ප්‍රශංසා කරන්නේ ය. පිණ්ඩපාතය නිසා අනුචිත වූ සොයාගැනීමකට නොපෙළඹෙන්නේ ය. පිණ්ඩපාතය නොලැබීමෙන් නොතැවෙන්නේ ය. පිණ්ඩපාතය ලැබූ විට බැඳීම් රහිතව, මුසපත් නොවී, ඇලීම් රහිතව, ආදීනව දක්නා නුවණින්, නිදහස් වීමේ ප්‍රඥාවෙන් යුතුව පරිභෝග කරන්නේ ය. එසේම, ඕනෑම පිණ්ඩපාතයකින් සතුටු වීම නිසා තමාට ප්‍රශංසා කර නොගන්නේ ය, අනුන් හෙළා නොදකිනේ ය. යම් කෙනෙක් එහිලා දක්ෂ වන්නේ ද, අලස නොවන්නේ ද, මනා සිහියෙන් යුක්ත වන්නේ ද, එබඳු භික්ෂුව මහණෙනි, පෞරාණික වූ අග්‍ර ආර්ය වංශයෙහි පිහිටියේ යැයි කියනු ලැබේ.\n\nමහණෙනි, තවද, භික්ෂුවක් ඕනෑම සෙනසුනකින් සතුටු වන්නේ ය. ඕනෑම සෙනසුනකින් සතුටු වීම ප්‍රශංසා කරන්නේ ය. සෙනසුන් නිසා අනුචිත වූ සොයාගැනීමකට නොපෙළඹෙන්නේ ය. සෙනසුන් නොලැබීමෙන් නොතැවෙන්නේ ය. සෙනසුන් ලැබූ විට බැඳීම් රහිතව, මුසපත් නොවී, ඇලීම් රහිතව, ආදීනව දක්නා නුවණින්, නිදහස් වීමේ ප්‍රඥාවෙන් යුතුව පරිභෝග කරන්නේ ය. එසේම, ඕනෑම සෙනසුනකින් සතුටු වීම නිසා තමාට ප්‍රශංසා කර නොගන්නේ ය, අනුන් හෙළා නොදකිනේ ය. යම් කෙනෙක් එහිලා දක්ෂ වන්නේ ද, අලස නොවන්නේ ද, මනා සිහියෙන් යුක්ත වන්නේ ද, එබඳු භික්ෂුව මහණෙනි, පෞරාණික වූ අග්‍ර ආර්ය වංශයෙහි පිහිටියේ යැයි කියනු ලැබේ.\n\nමහණෙනි, තවද, භික්ෂුවක් භාවනාවෙහි ඇලුණේ වන්නේ ය, භාවනාවෙහි සතුටු වන්නේ ය. ප්‍රහාණයෙහි ඇලුණේ වන්නේ ය, ප්‍රහාණයෙහි සතුටු වන්නේ ය. එසේම, භාවනාවෙහි ඇලීම, භාවනාවෙහි සතුටු වීම, ප්‍රහාණයෙහි ඇලීම, ප්‍රහාණයෙහි සතුටු වීම නිසා තමාට ප්‍රශංසා කර නොගන්නේ ය, අනුන් හෙළා නොදකිනේ ය. යම් කෙනෙක් එහිලා දක්ෂ වන්නේ ද, අලස නොවන්නේ ද, මනා සිහියෙන් යුක්ත වන්නේ ද, එබඳු භික්ෂුව මහණෙනි, පෞරාණික වූ අග්‍ර ආර්ය වංශයෙහි පිහිටියේ යැයි කියනු ලැබේ.\n\nමහණෙනි, මේ ආර්ය වංශ සතර අග්‍ර වූවෝ ය, ප්‍රිය මනාප වූවෝ ය, වංශවත් වූවෝ ය, පෞරාණික වූවෝ ය, කිලිටි නැත්තාහ, පෙර කිලිටි නොවූවාහ, කිලිටි නොවන්නාහ, කිලිටි නොවන්නෝ ද වන්නාහ. ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නින්දා නොකරන ලද්දාහ.\n\nමහණෙනි, මේ ආර්ය වංශ සතරෙන් යුක්ත වූ භික්ෂුවක් පෙර දිශාවෙහි වාසය කළත් ඔහුම අප්‍රිය බව දරාගන්නේ ය, අප්‍රිය බව ඔහුව දරා නොගන්නේ ය. බස්නා දිශාවෙහි වාසය කළත් ඔහුම අප්‍රිය බව දරාගන්නේ ය, අප්‍රිය බව ඔහුව දරා නොගන්නේ ය. උතුරු දිශාවෙහි වාසය කළත් ඔහුම අප්‍රිය බව දරාගන්නේ ය, අප්‍රිය බව ඔහුව දරා නොගන්නේ ය. දකුණු දිශාවෙහි වාසය කළත් ඔහුම අප්‍රිය බව දරාගන්නේ ය, අප්‍රිය බව ඔහුව දරා නොගන්නේ ය. එයට හේතුව කුමක්ද? මහණෙනි, ධීර වූ තැනැත්තා අප්‍රිය-ප්‍රිය දරාගන්නේ ය.\n\nඅරතිය ධීරයාව පීඩා නොකරයි, ධීරයා අරතියට යටත් නොවේ.\nධීරයාම අප්‍රිය බව දරාගනී, මක්නිසාද, ධීරයා අප්‍රිය බව දරාගන්නා සුලුය.\nසියලු කර්මයන් දුරු කළවුන්ට, (කිලිටි) බැහැර කළවුන්ට කවරෙක් බාධා කරන්නේ ද?\nජම්බුනද රත්‍රන් මෙන් බැබළෙන ඔහුට කවරෙක් නින්දා කරන්නේ ද?\nදෙවියෝ ද ඔහුට ප්‍රශංසා කරති, බ්‍රහ්මයා විසින් ද ඔහු ප්‍රශංසා කරනු ලැබුවේය.",
      "paliTitle": "Ariyavaṃsasuttaṃ",
      "englishTitle": "Discourse on the Noble Lineages",
      "sinhalaTitle": "ආර්‍ය වංශ සූත්‍රය"
    },
    {
      "number": 29,
      "pali": "‘‘Cattārimāni, bhikkhave, dhammapadāni aggaññāni rattaññāni vaṃsaññāni porāṇāni asaṃkiṇṇāni asaṃkiṇṇapubbāni, na saṃkīyanti na saṃkīyissanti, appaṭikuṭṭhāni samaṇehi brāhmaṇehi viññūhi. Katamāni cattāri? Anabhijjhā, bhikkhave, dhammapadaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkīyati na saṃkīyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. ‘‘Abyāpādo, bhikkhave, dhammapadaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkīyati na saṃkīyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. ‘‘Sammāsati, bhikkhave, dhammapadaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkīyati na saṃkīyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. ‘‘Sammāsamādhi, bhikkhave, dhammapadaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkīyati na saṃkīyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. Imāni kho, bhikkhave, cattāri dhammapadāni aggaññāni rattaññāni vaṃsaññāni porāṇāni asaṃkiṇṇāni asaṃkiṇṇapubbāni, na saṃkīyanti na saṃkīyissanti, appaṭikuṭṭhāni samaṇehi brāhmaṇehi viññūhī’’ti. ‘‘Anabhijjhālu vihareyya, abyāpannena cetasā; Sato ekaggacittassa [ekaggacittāyaṃ (ka.)], ajjhattaṃ susamāhito’’ti. navamaṃ;",
      "english": "Monks, these four principles of Dhamma are foremost, venerated, traditionally recognized, ancient, unadulterated, never previously corrupted; they are not corrupted and will not be corrupted; and they are unchallenged by wise recluses and brahmins. Which four?\n\nMonks, non-covetousness is a principle of Dhamma that is foremost, venerated, traditionally recognized, ancient, unadulterated, never previously corrupted; it is not corrupted and will not be corrupted; and it is unchallenged by wise recluses and brahmins.\n\nMonks, non-ill-will is a principle of Dhamma that is foremost, venerated, traditionally recognized, ancient, unadulterated, never previously corrupted; it is not corrupted and will not be corrupted; and it is unchallenged by wise recluses and brahmins.\n\nMonks, Right Mindfulness is a principle of Dhamma that is foremost, venerated, traditionally recognized, ancient, unadulterated, never previously corrupted; it is not corrupted and will not be corrupted; and it is unchallenged by wise recluses and brahmins.\n\nMonks, Right Concentration is a principle of Dhamma that is foremost, venerated, traditionally recognized, ancient, unadulterated, never previously corrupted; it is not corrupted and will not be corrupted; and it is unchallenged by wise recluses and brahmins.\n\nMonks, these are the four principles of Dhamma that are foremost, venerated, traditionally recognized, ancient, unadulterated, never previously corrupted; they are not corrupted and will not be corrupted; and they are unchallenged by wise recluses and brahmins.\n\nOne should dwell free from covetousness, with a mind free from ill-will, mindful, with a one-pointed mind, internally well-concentrated.",
      "sinhala": "මහණෙනි, මේ ධර්ම පද සතරක් ඇත. ඒවා උතුම් වූ, චිරාගත වූ, පරම්පරාගත වූ, පැරණි වූ, මිශ‍්‍ර නොවූ, පෙර කිසි දිනක මිශ‍්‍ර නොවූ, දැන් වාද විවාදයට ලක් නොවන, මතු වාද විවාදයට ලක් නොවන, ශ‍්‍රමණ, බ්‍රාහ්මණ, ප‍්‍රාඥයන් විසින් ප‍්‍රතික්ෂේප නොකරන ලද්දා වූ ධර්ම පද වේ. ඒ සතර මොනවා ද?\n\nමහණෙනි, අනභිජ්ඣාව යනු උතුම් වූ, චිරාගත වූ, පරම්පරාගත වූ, පැරණි වූ, මිශ‍්‍ර නොවූ, පෙර කිසි දිනක මිශ‍්‍ර නොවූ, දැන් වාද විවාදයට ලක් නොවන, මතු වාද විවාදයට ලක් නොවන, ශ‍්‍රමණ, බ්‍රාහ්මණ, ප‍්‍රාඥයන් විසින් ප‍්‍රතික්ෂේප නොකරන ලද්දා වූ ධර්ම පදයකි.\n\nමහණෙනි, අව්‍යාපාදය යනු උතුම් වූ, චිරාගත වූ, පරම්පරාගත වූ, පැරණි වූ, මිශ‍්‍ර නොවූ, පෙර කිසි දිනක මිශ‍්‍ර නොවූ, දැන් වාද විවාදයට ලක් නොවන, මතු වාද විවාදයට ලක් නොවන, ශ‍්‍රමණ, බ්‍රාහ්මණ, ප‍්‍රාඥයන් විසින් ප‍්‍රතික්ෂේප නොකරන ලද්දා වූ ධර්ම පදයකි.\n\nමහණෙනි, සම්මාසතිය යනු උතුම් වූ, චිරාගත වූ, පරම්පරාගත වූ, පැරණි වූ, මිශ‍්‍ර නොවූ, පෙර කිසි දිනක මිශ‍්‍ර නොවූ, දැන් වාද විවාදයට ලක් නොවන, මතු වාද විවාදයට ලක් නොවන, ශ‍්‍රමණ, බ්‍රාහ්මණ, ප‍්‍රාඥයන් විසින් ප‍්‍රතික්ෂේප නොකරන ලද්දා වූ ධර්ම පදයකි.\n\nමහණෙනි, සම්මාසමාධිය යනු උතුම් වූ, චිරාගත වූ, පරම්පරාගත වූ, පැරණි වූ, මිශ‍්‍ර නොවූ, පෙර කිසි දිනක මිශ‍්‍ර නොවූ, දැන් වාද විවාදයට ලක් නොවන, මතු වාද විවාදයට ලක් නොවන, ශ‍්‍රමණ, බ්‍රාහ්මණ, ප‍්‍රාඥයන් විසින් ප‍්‍රතික්ෂේප නොකරන ලද්දා වූ ධර්ම පදයකි.\n\nමහණෙනි, මේවා උතුම් වූ, චිරාගත වූ, පරම්පරාගත වූ, පැරණි වූ, මිශ‍්‍ර නොවූ, පෙර කිසි දිනක මිශ‍්‍ර නොවූ, දැන් වාද විවාදයට ලක් නොවන, මතු වාද විවාදයට ලක් නොවන, ශ‍්‍රමණ, බ්‍රාහ්මණ, ප‍්‍රාඥයන් විසින් ප‍්‍රතික්ෂේප නොකරන ලද්දා වූ ඒ ධර්ම පද සතර වේ.\n\nතණ්හා රහිතව, ව්‍යාපාද රහිත සිතකින්, සතිමත් ව, එක් සිත් ඇතිව, තමන් තුළ මනා කොට සමාධිගත ව වාසය කළ යුතුය.",
      "paliTitle": "Dhammapadasuttaṃ",
      "englishTitle": "The Dhammapada Discourse",
      "sinhalaTitle": "ධම්මපද සූත්‍රය"
    },
    {
      "number": 30,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena sambahulā abhiññātā abhiññātā paribbājakā sippinikātīre [sappiniyā tīre (sī. pī.), sippiniyā tīre (syā. kaṃ.), sippiniyā nadiyā tīre (ka.)] paribbājakārāme paṭivasanti, seyyathidaṃ annabhāro varadharo sakuludāyī ca paribbājako aññe ca abhiññātā abhiññātā paribbājakā. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena sippinikātīraṃ paribbājakārāmo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā te paribbājake etadavoca – ‘‘Cattārimāni, paribbājakā, dhammapadāni aggaññāni rattaññāni vaṃsaññāni porāṇāni asaṃkiṇṇāni asaṃkiṇṇapubbāni, na saṃkīyanti na saṃkīyissanti, appaṭikuṭṭhāni samaṇehi brāhmaṇehi viññūhi. Katamāni cattāri? Anabhijjhā, paribbājakā, dhammapadaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkīyati na saṃkīyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. Abyāpādo, paribbājakā, dhammapadaṃ…pe… sammāsati, paribbājakā, dhammapadaṃ…pe… sammāsamādhi, paribbājakā, dhammapadaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkīyati na saṃkīyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. Imāni kho, paribbājakā, cattāri dhammapadāni aggaññāni rattaññāni vaṃsaññāni porāṇāni asaṃkiṇṇāni asaṃkiṇṇapubbāni, na saṃkīyanti na saṃkīyissanti, appaṭikuṭṭhāni samaṇehi brāhmaṇehi viññūhi. ‘‘Yo kho, paribbājakā, evaṃ vadeyya – ‘ahametaṃ anabhijjhaṃ dhammapadaṃ paccakkhāya abhijjhāluṃ kāmesu tibbasārāgaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessāmī’ti, tamahaṃ tattha evaṃ vadeyyaṃ – ‘etu vadatu byāharatu passāmissānubhāva’nti. So vata, paribbājakā, anabhijjhaṃ dhammapadaṃ paccakkhāya abhijjhāluṃ kāmesu tibbasārāgaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessatīti netaṃ ṭhānaṃ vijjati. ‘‘Yo kho, paribbājakā, evaṃ vadeyya – ‘ahametaṃ abyāpādaṃ dhammapadaṃ paccakkhāya byāpannacittaṃ paduṭṭhamanasaṅkappaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessāmī’ti, tamahaṃ tattha evaṃ vadeyyaṃ – ‘etu vadatu byāharatu passāmissānubhāva’nti. So vata, paribbājakā, abyāpādaṃ dhammapadaṃ paccakkhāya byāpannacittaṃ paduṭṭhamanasaṅkappaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessatīti netaṃ ṭhānaṃ vijjati. ‘‘Yo kho, paribbājakā, evaṃ vadeyya – ‘ahametaṃ sammāsatiṃ dhammapadaṃ paccakkhāya muṭṭhassatiṃ asampajānaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessāmī’ti, tamahaṃ tattha evaṃ vadeyyaṃ – ‘etu vadatu byāharatu passāmissānubhāva’nti. So vata, paribbājakā, sammāsatiṃ dhammapadaṃ paccakkhāya muṭṭhassatiṃ asampajānaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessatīti netaṃ ṭhānaṃ vijjati. ‘‘Yo kho, paribbājakā, evaṃ vadeyya – ‘ahametaṃ sammāsamādhiṃ dhammapadaṃ paccakkhāya asamāhitaṃ vibbhantacittaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessāmī’ti, tamahaṃ tattha evaṃ vadeyyaṃ – ‘etu vadatu byāharatu passāmissānubhāva’nti. So vata, paribbājakā, sammāsamādhiṃ dhammapadaṃ paccakkhāya asamāhitaṃ vibbhantacittaṃ samaṇaṃ vā brāhmaṇaṃ vā paññāpessatīti netaṃ ṭhānaṃ vijjati. ‘‘Yo kho, paribbājakā, imāni cattāri dhammapadāni garahitabbaṃ paṭikkositabbaṃ maññeyya, tassa diṭṭheva dhamme cattāro sahadhammikā vādānupātā gārayhā ṭhānā [vādānuvādā gārayhaṃ ṭhānaṃ (ma. ni. 3.8)] āgacchanti. Katame cattāro? Anabhijjhaṃ ce bhavaṃ dhammapadaṃ garahati paṭikkosati, ye ca hi [ye ca (ma. ni. 3.142-143)] abhijjhālū kāmesu tibbasārāgā samaṇabrāhmaṇā te bhoto pujjā te bhoto pāsaṃsā. Abyāpādaṃ ce bhavaṃ dhammapadaṃ garahati paṭikkosati, ye ca hi byāpannacittā paduṭṭhamanasaṅkappā samaṇabrāhmaṇā te bhoto pujjā te bhoto pāsaṃsā. Sammāsatiṃ ce bhavaṃ dhammapadaṃ garahati paṭikkosati, ye ca hi muṭṭhassatī asampajānā samaṇabrāhmaṇā te bhoto pujjā te bhoto pāsaṃsā. Sammāsamādhiṃ ce bhavaṃ dhammapadaṃ garahati paṭikkosati, ye ca hi asamāhitā vibbhantacittā samaṇabrāhmaṇā te bhoto pujjā te bhoto pāsaṃsā. ‘‘Yo kho, paribbājakā, imāni cattāri dhammapadāni garahitabbaṃ paṭikkositabbaṃ maññeyya, tassa diṭṭheva dhamme ime cattāro sahadhammikā vādānupātā gārayhā ṭhānā āgacchanti. Yepi te paribbājakā ahesuṃ ukkalā vassabhaññā [vassabhiññā (ka.) saṃ. ni. 3.62 passitabbaṃ] ahetukavādā akiriyavādā natthikavādā, tepi imāni cattāri dhammapadāni na garahitabbaṃ na paṭikkositabbaṃ amaññiṃsu. Taṃ kissa hetu? Nindābyārosanaupārambhabhayā’’ti [upavādabhayāti (ka.) ma. ni. 3.150; saṃ. ni. 3.62 passitabbaṃ]. ‘‘Abyāpanno sadā sato, ajjhattaṃ susamāhito; Abhijjhāvinaye sikkhaṃ, appamattoti vuccatī’’ti. dasamaṃ; ",
      "english": "At one time the Blessed One was staying in Rājagaha, on Gijjhakūṭa Mountain. Now at that time, many well-known, well-regarded wanderers were staying in the wanderers’ park on the bank of the Sappiniyā river, namely, the wanderers Annabhāra, Varadhara, and Sakuludāyī, as well as other well-known, well-regarded wanderers. Then, in the evening, the Blessed One emerged from his seclusion and went to the wanderers’ park on the bank of the Sappiniyā river. Having approached, he sat down on the appointed seat.\n\nHaving sat down, the Blessed One addressed those wanderers thus: “Wanderers, there are these four principles of the Dhamma that are supreme, excellent, handed down through generations, ancient, unmixed, and never have been mixed; they are not mixed now nor will they ever be mixed, and they are not censured by recluses, brahmins, or the wise. Which four? Non-covetousness, wanderers, is a principle of the Dhamma that is supreme, excellent, handed down through generations, ancient, unmixed, and never has been mixed; it is not mixed now nor will it ever be mixed, and it is not censured by recluses, brahmins, or the wise. Non-ill-will, wanderers, is a principle of the Dhamma that is supreme, excellent, handed down through generations, ancient, unmixed, and never has been mixed; it is not mixed now nor will it ever be mixed, and it is not censured by recluses, brahmins, or the wise. Right mindfulness, wanderers, is a principle of the Dhamma that is supreme, excellent, handed down through generations, ancient, unmixed, and never has been mixed; it is not mixed now nor will it ever be mixed, and it is not censured by recluses, brahmins, or the wise. Right concentration, wanderers, is a principle of the Dhamma that is supreme, excellent, handed down through generations, ancient, unmixed, and never has been mixed; it is not mixed now nor will it ever be mixed, and it is not censured by recluses, brahmins, or the wise. These, wanderers, are the four principles of the Dhamma that are supreme, excellent, handed down through generations, ancient, unmixed, and never have been mixed; they are not mixed now nor will they ever be mixed, and they are not censured by recluses, brahmins, or the wise.”\n\n“Wanderers, if anyone were to say: ‘Having rejected this principle of non-covetousness, I will declare a recluse or a brahmin to be covetous and intensely passionate about sensual pleasures,’ I would say to them: ‘Come, speak, declare, I shall see your power.’ But for such a one, wanderers, to declare a recluse or a brahmin to be covetous and intensely passionate about sensual pleasures, having rejected the principle of non-covetousness—such a thing is impossible.\n\n“Wanderers, if anyone were to say: ‘Having rejected this principle of non-ill-will, I will declare a recluse or a brahmin to be malicious in mind and corrupted in thought,’ I would say to them: ‘Come, speak, declare, I shall see your power.’ But for such a one, wanderers, to declare a recluse or a brahmin to be malicious in mind and corrupted in thought, having rejected the principle of non-ill-will—such a thing is impossible.\n\n“Wanderers, if anyone were to say: ‘Having rejected this principle of right mindfulness, I will declare a recluse or a brahmin to be unmindful and without clear comprehension,’ I would say to them: ‘Come, speak, declare, I shall see your power.’ But for such a one, wanderers, to declare a recluse or a brahmin to be unmindful and without clear comprehension, having rejected the principle of right mindfulness—such a thing is impossible.\n\n“Wanderers, if anyone were to say: ‘Having rejected this principle of right concentration, I will declare a recluse or a brahmin to be unconcentrated and with a scattered mind,’ I would say to them: ‘Come, speak, declare, I shall see your power.’ But for such a one, wanderers, to declare a recluse or a brahmin to be unconcentrated and with a scattered mind, having rejected the principle of right concentration—such a thing is impossible.\n\n“Wanderers, if anyone were to consider these four principles of the Dhamma as things to be blamed or repudiated, then four consequential doctrines, worthy of censure, would arise for them in this very life. Which four? If that venerable one blames and repudiates the principle of non-covetousness, then those recluses and brahmins who are covetous and intensely passionate about sensual pleasures would be deemed worthy of honor and praise by that venerable one. If that venerable one blames and repudiates the principle of non-ill-will, then those recluses and brahmins who are malicious in mind and corrupted in thought would be deemed worthy of honor and praise by that venerable one. If that venerable one blames and repudiates the principle of right mindfulness, then those recluses and brahmins who are unmindful and without clear comprehension would be deemed worthy of honor and praise by that venerable one. If that venerable one blames and repudiates the principle of right concentration, then those recluses and brahmins who are unconcentrated and with a scattered mind would be deemed worthy of honor and praise by that venerable one.\n\n“Wanderers, if anyone were to consider these four principles of the Dhamma as things to be blamed or repudiated, then these four consequential doctrines, worthy of censure, would arise for them in this very life. And those wanderers who were Ukkalā Vassabhaññā...\n\nEven the advocates of causelessness, the advocates of the ineffectiveness of action, and the nihilists considered these four principles of Dhamma not to be blamed or repudiated. What was the reason for that? Because of the fear of censure, hostility, and criticism.\n\nOne who is without malevolence, ever mindful,\nInwardly well-concentrated;\nTraining in the restraint of covetousness,\nIs called 'diligent'.",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයේ වැඩසිටියාහ. එවිට බොහෝ ප්‍රසිද්ධ, කීර්තිමත් පරිබ්‍රාජකයෝ සිප්පිනී ගංතීරයේ වූ පරිබ්‍රාජකාරාමයේ වාසය කළහ. එනම්, අන්නභාර, වරධර, සකුලුදායී යන පරිබ්‍රාජකවරු සහ තවත් බොහෝ ප්‍රසිද්ධ, කීර්තිමත් පරිබ්‍රාජකයෝ ද එහි වූහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි භාවනානුයෝගීව වැඩසිටීමෙන් නැගිට, සිප්පිනී ගංතීරයේ වූ පරිබ්‍රාජකාරාමය වෙත වැඩම කළහ; එහි වැඩම කොට පනවන ලද ආසනයක වැඩසිටියාහ.\n\nවැඩසිටි භාග්‍යවතුන් වහන්සේ ඒ පරිබ්‍රාජකයන් අමතා මෙසේ වදාළහ: “පරිබ්‍රාජකවරුනි, මේ ධර්මපද සතරක් තිබේ. මේවා අග්‍ර වන්නේය, රාගය දුරු කරනසුලු වන්නේය, පරම්පරාගත වන්නේය, පුරාණ වන්නේය, මුසුවී නොගිය ඒවා වන්නේය, පෙර කිසි කලෙක මුසු නොවූ ඒවා වන්නේය, ශ්‍රමණ බ්‍රාහ්මණ විඥයන් විසින් අප්‍රතික්ෂේපිත ඒවා වන්නේය. ඒ සතර කවරේද? පරිබ්‍රාජකවරුනි, අභිජ්ඣාව නොමැති වීම, මේ ධර්මපදය අග්‍ර වන්නේය, රාගය දුරු කරනසුලු වන්නේය, පරම්පරාගත වන්නේය, පුරාණ වන්නේය, මුසුවී නොගිය ඒවා වන්නේය, පෙර කිසි කලෙක මුසු නොවූ ඒවා වන්නේය, ශ්‍රමණ බ්‍රාහ්මණ විඥයන් විසින් අප්‍රතික්ෂේපිත ඒවා වන්නේය. පරිබ්‍රාජකවරුනි, අව්‍යාපාදය (ක්‍රෝධ නොමැති වීම), මේ ධර්මපදය අග්‍ර වන්නේය, රාගය දුරු කරනසුලු වන්නේය, පරම්පරාගත වන්නේය, පුරාණ වන්නේය, මුසුවී නොගිය ඒවා වන්නේය, පෙර කිසි කලෙක මුසු නොවූ ඒවා වන්නේය, ශ්‍රමණ බ්‍රාහ්මණ විඥයන් විසින් අප්‍රතික්ෂේපිත ඒවා වන්නේය. පරිබ්‍රාජකවරුනි, සම්මාසතිය (නොපිරිහුණ සිහිය), මේ ධර්මපදය අග්‍ර වන්නේය, රාගය දුරු කරනසුලු වන්නේය, පරම්පරාගත වන්නේය, පුරාණ වන්නේය, මුසුවී නොගිය ඒවා වන්නේය, පෙර කිසි කලෙක මුසු නොවූ ඒවා වන්නේය, ශ්‍රමණ බ්‍රාහ්මණ විඥයන් විසින් අප්‍රතික්ෂේපිත ඒවා වන්නේය. පරිබ්‍රාජකවරුනි, සම්මාසමාධිය (නොකෙලෙසෙන සමාධිය), මේ ධර්මපදය අග්‍ර වන්නේය, රාගය දුරු කරනසුලු වන්නේය, පරම්පරාගත වන්නේය, පුරාණ වන්නේය, මුසුවී නොගිය ඒවා වන්නේය, පෙර කිසි කලෙක මුසු නොවූ ඒවා වන්නේය, ශ්‍රමණ බ්‍රාහ්මණ විඥයන් විසින් අප්‍රතික්ෂේපිත ඒවා වන්නේය. පරිබ්‍රාජකවරුනි, මේ ධර්මපද සතර අග්‍ර වන්නේය, රාගය දුරු කරනසුලු වන්නේය, පරම්පරාගත වන්නේය, පුරාණ වන්නේය, මුසුවී නොගිය ඒවා වන්නේය, පෙර කිසි කලෙක මුසු නොවූ ඒවා වන්නේය, ශ්‍රමණ බ්‍රාහ්මණ විඥයන් විසින් අප්‍රතික්ෂේපිත ඒවා වන්නේය.”\n\n“පරිබ්‍රාජකවරුනි, යමෙක් මෙසේ කියන්නේ නම්: ‘මම මේ අභිජ්ඣා රහිත ධර්මපදය ප්‍රතික්ෂේප කොට, දැඩි සේ කාමයන්හි ඇලුණු, අභිජ්ඣා සහිත වූ ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වන්නෙමි’ කියා, මම ඔහුට එතැනදීම මෙසේ කියන්නෙමි: ‘එනු, කථා කරනු, විස්තර කරනු, එවිට මම ඔහුගේ බලය දකින්නෙමි’ කියා. පරිබ්‍රාජකවරුනි, ඔහු අභිජ්ඣා රහිත ධර්මපදය ප්‍රතික්ෂේප කොට, දැඩි සේ කාමයන්හි ඇලුණු, අභිජ්ඣා සහිත වූ ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වීමට හැකි වීමක් නම් ඇති නොවේ.”\n\n“පරිබ්‍රාජකවරුනි, යමෙක් මෙසේ කියන්නේ නම්: ‘මම මේ අව්‍යාපාද ධර්මපදය ප්‍රතික්ෂේප කොට, ව්‍යාපාද සිත් ඇති, දූෂිත මනෝසංකල්ප ඇති ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වන්නෙමි’ කියා, මම ඔහුට එතැනදීම මෙසේ කියන්නෙමි: ‘එනු, කථා කරනු, විස්තර කරනු, එවිට මම ඔහුගේ බලය දකින්නෙමි’ කියා. පරිබ්‍රාජකවරුනි, ඔහු අව්‍යාපාද ධර්මපදය ප්‍රතික්ෂේප කොට, ව්‍යාපාද සිත් ඇති, දූෂිත මනෝසංකල්ප ඇති ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වීමට හැකි වීමක් නම් ඇති නොවේ.”\n\n“පරිබ්‍රාජකවරුනි, යමෙක් මෙසේ කියන්නේ නම්: ‘මම මේ සම්මාසති ධර්මපදය ප්‍රතික්ෂේප කොට, නැති වූ සිහිය ඇති, අවිචාරවත් ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වන්නෙමි’ කියා, මම ඔහුට එතැනදීම මෙසේ කියන්නෙමි: ‘එනු, කථා කරනු, විස්තර කරනු, එවිට මම ඔහුගේ බලය දකින්නෙමි’ කියා. පරිබ්‍රාජකවරුනි, ඔහු සම්මාසති ධර්මපදය ප්‍රතික්ෂේප කොට, නැති වූ සිහිය ඇති, අවිචාරවත් ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වීමට හැකි වීමක් නම් ඇති නොවේ.”\n\n“පරිබ්‍රාජකවරුනි, යමෙක් මෙසේ කියන්නේ නම්: ‘මම මේ සම්මාසමාධි ධර්මපදය ප්‍රතික්ෂේප කොට, සමාධි රහිත, විසිරුණු සිත් ඇති ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වන්නෙමි’ කියා, මම ඔහුට එතැනදීම මෙසේ කියන්නෙමි: ‘එනු, කථා කරනු, විස්තර කරනු, එවිට මම ඔහුගේ බලය දකින්නෙමි’ කියා. පරිබ්‍රාජකවරුනි, ඔහු සම්මාසමාධි ධර්මපදය ප්‍රතික්ෂේප කොට, සමාධි රහිත, විසිරුණු සිත් ඇති ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ පනවා පෙන්වීමට හැකි වීමක් නම් ඇති නොවේ.”\n\n“පරිබ්‍රාජකවරුනි, යමෙක් මේ ධර්මපද සතර ගැරහිය යුතු යැයි ද, ප්‍රතික්ෂේප කළ යුතු යැයි ද සිතන්නේ නම්, මේ දිට්ඨධම්මයේදීම, ශාසනයට අනුරූපී වූ, ගැරහිය යුතු කරුණු සතරක් ඔහුට ඇති වේ. ඒ සතර කවරේද? යම් හෙයකින් භවත් තැනැත්තා අභිජ්ඣා රහිත යන ධර්මපදයට ගැරහීමක් හෝ ප්‍රතික්ෂේප කිරීමක් කරන්නේ නම්, කාමයන්හි දැඩි සේ ඇලුණු, අභිජ්ඣා සහිත වූ යම් ශ්‍රමණ බ්‍රාහ්මණයෝ වෙත් ද, ඔවුහු භවත් තැනැත්තාට පූජනීය වෙත්, ප්‍රශංසනීය වෙත්. යම් හෙයකින් භවත් තැනැත්තා අව්‍යාපාද යන ධර්මපදයට ගැරහීමක් හෝ ප්‍රතික්ෂේප කිරීමක් කරන්නේ නම්, ව්‍යාපාද සිත් ඇති, දූෂිත මනෝසංකල්ප ඇති යම් ශ්‍රමණ බ්‍රාහ්මණයෝ වෙත් ද, ඔවුහු භවත් තැනැත්තාට පූජනීය වෙත්, ප්‍රශංසනීය වෙත්. යම් හෙයකින් භවත් තැනැත්තා සම්මාසති යන ධර්මපදයට ගැරහීමක් හෝ ප්‍රතික්ෂේප කිරීමක් කරන්නේ නම්, නැති වූ සිහිය ඇති, අවිචාරවත් යම් ශ්‍රමණ බ්‍රාහ්මණයෝ වෙත් ද, ඔවුහු භවත් තැනැත්තාට පූජනීය වෙත්, ප්‍රශංසනීය වෙත්. යම් හෙයකින් භවත් තැනැත්තා සම්මාසමාධි යන ධර්මපදයට ගැරහීමක් හෝ ප්‍රතික්ෂේප කිරීමක් කරන්නේ නම්, සමාධි රහිත, විසිරුණු සිත් ඇති යම් ශ්‍රමණ බ්‍රාහ්මණයෝ වෙත් ද, ඔවුහු භවත් තැනැත්තාට පූජනීය වෙත්, ප්‍රශංසනීය වෙත්.”\n\nපරිබ්‍රාජකවරුනි, යමෙක් මේ ධර්මපද සතර ගැරහිය යුතු යැයි ද, ප්‍රතික්ෂේප කළ යුතු යැයි ද සිතන්නේ නම්, මේ දිට්ඨධම්මයේදීම, ශාසනයට අනුරූපී වූ, ගැරහිය යුතු මේ කරුණු සතර ඔහුට ඇති වේ. උක්කලා වාසභඤ්ඤ නම් යම් පරිබ්‍රාජකයෝ වූවාහු ද, ඔවුහු ද සිටියහ.\n\nඅහෙතුකවාදීන්, අකිරියවාදීන්, නත්ථිකවාදීන් පවා, මේ ධර්‍ම‍පද සතර නින්දා නොකළ යුතු යැයිද, ප‍්‍රතික්‍ෂේප නොකළ යුතු යැයිද සැලකූහ. එයට හේතුව කුමක්ද? නින්දාවට, ව‍්‍යාපාදයට හා දෝෂාරෝපණයට ලක්වීමේ භය නිසාය.\n\nව‍්‍යාපාදයෙන් තොර වූ, නිරතුරුව සිහි නුවණින් යුක්ත වූ, තමා තුළ මනාකොට සමාධිගත වූ, අභිජ්‍ඣාව දුරු කිරීමෙහි හික්මෙන තැනැත්තා අප‍්‍රමාදී යැයි කියනු ලැබේ.",
      "paliTitle": "Paribbājakasuttaṃ",
      "englishTitle": "The Wanderer's Discourse",
      "sinhalaTitle": "පරිබ්බාජක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Uruvelavaggo tatiyo. Tassuddānaṃ – Dve uruvelā loko kāḷako [koḷiko (ka.)], brahmacariyena pañcamaṃ; Kuhaṃ santuṭṭhi vaṃso ca, dhammapadaṃ paribbājakena cāti.",
    "english": "The Third Uruvela Chapter",
    "sinhala": "ඌරුවෙල වග‍්ගය තෙවැනි"
  }
}