{
  "id": "an4.2",
  "title": {
    "pali": "Caravaggo",
    "english": "The Chapter on Conduct",
    "sinhala": "චර වග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "[itivu. 110] ‘‘Carato cepi, bhikkhave, bhikkhuno uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu adhivāseti, nappajahati na vinodeti na byantīkaroti [byantikaroti (pī.), byantiṃ karoti (ka.)] na anabhāvaṃ gameti, carampi, bhikkhave, bhikkhu evaṃbhūto ‘anātāpī anottāpī satataṃ samitaṃ kusīto hīnavīriyo’ti vuccati. ‘‘Ṭhitassa cepi, bhikkhave, bhikkhuno uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu adhivāseti, nappajahati na vinodeti na byantīkaroti na anabhāvaṃ gameti, ṭhitopi, bhikkhave, bhikkhu evaṃbhūto ‘anātāpī anottāpī satataṃ samitaṃ kusīto hīnavīriyo’ti vuccati. ‘‘Nisinnassa cepi, bhikkhave, bhikkhuno uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu adhivāseti, nappajahati na vinodeti na byantīkaroti na anabhāvaṃ gameti, nisinnopi, bhikkhave, bhikkhu evaṃbhūto ‘anātāpī anottāpī satataṃ samitaṃ kusīto hīnavīriyo’ti vuccati. ‘‘Sayānassa cepi, bhikkhave, bhikkhuno jāgarassa uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu adhivāseti, nappajahati na vinodeti na byantīkaroti na anabhāvaṃ gameti, sayānopi, bhikkhave, bhikkhu jāgaro evaṃbhūto ‘anātāpī anottāpī satataṃ samitaṃ kusīto hīnavīriyo’ti vuccati. ‘‘Carato cepi, bhikkhave, bhikkhuno uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu nādhivāseti, pajahati vinodeti byantīkaroti anabhāvaṃ gameti, carampi, bhikkhave, bhikkhu evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccati. ‘‘Ṭhitassa cepi, bhikkhave, bhikkhuno uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu nādhivāseti, pajahati vinodeti byantīkaroti anabhāvaṃ gameti, ṭhitopi, bhikkhave, bhikkhu evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccati. ‘‘Nisinnassa cepi, bhikkhave, bhikkhuno uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu nādhivāseti, pajahati vinodeti byantīkaroti anabhāvaṃ gameti, nisinnopi, bhikkhave, bhikkhu evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccati. ‘‘Sayānassa cepi, bhikkhave, bhikkhuno jāgarassa uppajjati kāmavitakko vā byāpādavitakko vā vihiṃsāvitakko vā. Taṃ ce bhikkhu nādhivāseti, pajahati vinodeti byantīkaroti anabhāvaṃ gameti, sayānopi, bhikkhave, bhikkhu jāgaro evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccatī’’ti. ‘‘Caraṃ vā yadi vā tiṭṭhaṃ, nisinno uda vā sayaṃ; Yo vitakkaṃ vitakketi, pāpakaṃ gehanissitaṃ. ‘‘Kummaggappaṭipanno so, mohaneyyesu mucchito; Abhabbo tādiso bhikkhu, phuṭṭhuṃ sambodhimuttamaṃ. ‘‘Yo ca caraṃ vā tiṭṭhaṃ vā, nisinno uda vā sayaṃ; Vitakkaṃ samayitvāna, vitakkūpasame rato; Bhabbo so tādiso bhikkhu, phuṭṭhuṃ sambodhimuttama’’nti. paṭhamaṃ;",
      "english": "“Monks, even when a monk is walking, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk tolerates them, does not abandon them, does not dispel them, does not eliminate them, and does not bring them to an end, then even when walking, such a monk is called ‘without ardent effort, without moral dread, constantly and continually lazy, of weak energy.’\n\n“Monks, even when a monk is standing, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk tolerates them, does not abandon them, does not dispel them, does not eliminate them, and does not bring them to an end, then even when standing, such a monk is called ‘without ardent effort, without moral dread, constantly and continually lazy, of weak energy.’\n\n“Monks, even when a monk is sitting, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk tolerates them, does not abandon them, does not dispel them, does not eliminate them, and does not bring them to an end, then even when sitting, such a monk is called ‘without ardent effort, without moral dread, constantly and continually lazy, of weak energy.’\n\n“Monks, even when a monk is lying down but awake, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk tolerates them, does not abandon them, does not dispel them, does not eliminate them, and does not bring them to an end, then even when lying down but awake, such a monk is called ‘without ardent effort, without moral dread, constantly and continually lazy, of weak energy.’\n\n“Monks, even when a monk is walking, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk does not tolerate them, but abandons them, dispels them, eliminates them, and brings them to an end, then even when walking, such a monk is called ‘with ardent effort, with moral dread, constantly and continually of aroused energy, with mind resolute.’\n\n“Monks, even when a monk is standing, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk does not tolerate them, but abandons them, dispels them, eliminates them, and brings them to an end, then even when standing, such a monk is called ‘with ardent effort, with moral dread, constantly and continually of aroused energy, with mind resolute.’\n\n“Monks, even when a monk is sitting, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk does not tolerate them, but abandons them, dispels them, eliminates them, and brings them to an end, then even when sitting, such a monk is called ‘with ardent effort, with moral dread, constantly and continually of aroused energy, with mind resolute.’\n\n“Monks, even when a monk is lying down but awake, if thoughts of sensual desire, ill-will, or harmfulness arise in him, and if that monk does not tolerate them, but abandons them, dispels them, eliminates them, and brings them to an end, then even when lying down but awake, such a monk is called ‘with ardent effort, with moral dread, constantly and continually of aroused energy, with mind resolute.’\n\nWhether walking or standing, sitting or lying down;\nHe who entertains unwholesome, worldly-based thoughts,\nSuch a one has embarked on the wrong path, infatuated with things that cause delusion;\nSuch a monk is incapable of touching the highest perfect enlightenment.\n\nBut he who, whether walking or standing, sitting or lying down,\nHaving calmed thoughts, delights in the calming of thoughts;\nSuch a monk is capable of touching the highest perfect enlightenment.",
      "sinhala": "භික්ෂූනි, ගමන් කරමින් සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය ඉවසයි නම්, අත්නොහරියි නම්, දුරු නොකරයි නම්, නැති නොකරයි නම්, අභාවයට පත් නොකරයි නම්, භික්ෂූනි, ගමන් කරමින් සිටින එබඳු භික්ෂුවක් 'තපස් නැති, පවට බිය නැති, නිරතුරුවම කම්මැලි වූ, හීන වීර්ය ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සිටගෙන සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය ඉවසයි නම්, අත්නොහරියි නම්, දුරු නොකරයි නම්, නැති නොකරයි නම්, අභාවයට පත් නොකරයි නම්, භික්ෂූනි, සිටගෙන සිටින එබඳු භික්ෂුවක් 'තපස් නැති, පවට බිය නැති, නිරතුරුවම කම්මැලි වූ, හීන වීර්ය ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, වාඩි වී සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය ඉවසයි නම්, අත්නොහරියි නම්, දුරු නොකරයි නම්, නැති නොකරයි නම්, අභාවයට පත් නොකරයි නම්, භික්ෂූනි, වාඩි වී සිටින එබඳු භික්ෂුවක් 'තපස් නැති, පවට බිය නැති, නිරතුරුවම කම්මැලි වූ, හීන වීර්ය ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සැතපී සිටින නමුත් අවදියෙන් සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය ඉවසයි නම්, අත්නොහරියි නම්, දුරු නොකරයි නම්, නැති නොකරයි නම්, අභාවයට පත් නොකරයි නම්, භික්ෂූනි, සැතපී සිටින නමුත් අවදියෙන් සිටින එබඳු භික්ෂුවක් 'තපස් නැති, පවට බිය නැති, නිරතුරුවම කම්මැලි වූ, හීන වීර්ය ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, ගමන් කරමින් සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය නොඉවසයි නම්, අත්හරියි නම්, දුරු කරයි නම්, නැති කරයි නම්, අභාවයට පත් කරයි නම්, භික්ෂූනි, ගමන් කරමින් සිටින එබඳු භික්ෂුවක් 'තපස් ඇති, පවට බිය ඇති, නිරතුරුවම වීර්යය අරඹා, ඉදිරියට යොමු කරන ලද සිත් ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සිටගෙන සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය නොඉවසයි නම්, අත්හරියි නම්, දුරු කරයි නම්, නැති කරයි නම්, අභාවයට පත් කරයි නම්, භික්ෂූනි, සිටගෙන සිටින එබඳු භික්ෂුවක් 'තපස් ඇති, පවට බිය ඇති, නිරතුරුවම වීර්යය අරඹා, ඉදිරියට යොමු කරන ලද සිත් ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, වාඩි වී සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය නොඉවසයි නම්, අත්හරියි නම්, දුරු කරයි නම්, නැති කරයි නම්, අභාවයට පත් කරයි නම්, භික්ෂූනි, වාඩි වී සිටින එබඳු භික්ෂුවක් 'තපස් ඇති, පවට බිය ඇති, නිරතුරුවම වීර්යය අරඹා, ඉදිරියට යොමු කරන ලද සිත් ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සැතපී සිටින නමුත් අවදියෙන් සිටින භික්ෂුවකට පවා කාම විතර්කයක් හෝ ව්‍යාපාද විතර්කයක් හෝ විහිංසා විතර්කයක් හෝ ඇතිවේ නම්, යම් හෙයකින් ඒ භික්ෂුව එය නොඉවසයි නම්, අත්හරියි නම්, දුරු කරයි නම්, නැති කරයි නම්, අභාවයට පත් කරයි නම්, භික්ෂූනි, සැතපී සිටින නමුත් අවදියෙන් සිටින එබඳු භික්ෂුවක් 'තපස් ඇති, පවට බිය ඇති, නිරතුරුවම වීර්යය අරඹා, ඉදිරියට යොමු කරන ලද සිත් ඇත්තෙක්' යැයි කියනු ලැබේ.\n\nගමන් කරමින් හෝ සිටගෙන හෝ වාඩි වී හෝ සැතපී හෝ, යම් තැනැත්තෙක් ගිහි ජීවිතය හා සම්බන්ධ වූ පාපී විතර්කයන් විතර්ක කරයිද;\n\nහෙතෙම වැරදි මාර්ගයට පිළිපන් කෙනෙකි. මුළා කරවනසුලු දේ කෙරෙහි මුසපත් වී සිටින්නේය. එබඳු භික්ෂුවකට උතුම් වූ සම්බෝධිය අවබෝධ කිරීමට නොහැකිය.\n\nයම් තැනැත්තෙක් ගමන් කරමින් හෝ සිටගෙන හෝ වාඩි වී හෝ සැතපී හෝ, විතර්කයන් සංසිඳුවා, විතර්ක සංසිඳුවීමෙහි ඇලී සිටින්නේ ද; එබඳු භික්ෂුවකට උතුම් වූ සම්බෝධිය අවබෝධ කිරීමට හැකිය.",
      "paliTitle": "Carasuttaṃ",
      "englishTitle": "Discourse on Conduct",
      "sinhalaTitle": "චර සූත‍්‍රය"
    },
    {
      "number": 12,
      "pali": "‘‘Sampannasīlā, bhikkhave, viharatha sampannapātimokkhā, pātimokkhasaṃvarasaṃvutā viharatha ācāragocarasampannā aṇumattesu vajjesu bhayadassāvino. Samādāya sikkhatha sikkhāpadesu. Sampannasīlānaṃ vo, bhikkhave, viharataṃ sampannapātimokkhānaṃ pātimokkhasaṃvarasaṃvutānaṃ viharataṃ ācāragocarasampannānaṃ aṇumattesu vajjesu bhayadassāvīnaṃ samādāya sikkhataṃ sikkhāpadesu kimassa uttari karaṇīyaṃ? ‘‘Carato cepi, bhikkhave, bhikkhuno abhijjhābyāpādo vigato hoti, thinamiddhaṃ… uddhaccakukkuccaṃ… vicikicchā pahīnā hoti, āraddhaṃ hoti vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ, carampi, bhikkhave, bhikkhu evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccati. ‘‘Ṭhitassa cepi, bhikkhave, bhikkhuno abhijjhābyāpādo vigato hoti, thinamiddhaṃ… uddhaccakukkuccaṃ… vicikicchā pahīnā hoti, āraddhaṃ hoti vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ, ṭhitopi, bhikkhave, bhikkhu evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccati. ‘‘Nisinnassa cepi, bhikkhave, bhikkhuno abhijjhābyāpādo vigato hoti, thinamiddhaṃ… uddhaccakukkuccaṃ… vicikicchā pahīnā hoti, āraddhaṃ hoti vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ, nisinnopi, bhikkhave, bhikkhu evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccati. ‘‘Sayānassa cepi, bhikkhave, bhikkhuno jāgarassa abhijjhābyāpādo vigato hoti, thinamiddhaṃ… uddhaccakukkuccaṃ… vicikicchā pahīnā hoti, āraddhaṃ hoti vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ, sayānopi, bhikkhave, bhikkhu jāgaro evaṃbhūto ‘ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitatto’ti vuccatī’’ti. ‘‘Yataṃ [yathā (ka.) itivu. 111] care yataṃ [yathā (ka.) itivu. 111] tiṭṭhe, yataṃ [yathā (ka.) itivu. 111] acche yataṃ [yathā (ka.) itivu. 111] saye; Yataṃ [yathā (ka.) itivu. 111] samiñjaye [sammiñjaye (sī. syā. kaṃ. pī.)] bhikkhu, yatamenaṃ [yatameva naṃ (sī.), yatametaṃ (syā. kaṃ.), yatameva (?)] pasāraye. ‘‘Uddhaṃ tiriyaṃ apācīnaṃ, yāvatā jagato gati; Samavekkhitā ca dhammānaṃ, khandhānaṃ udayabbayaṃ. ‘‘Cetosamathasāmīciṃ, sikkhamānaṃ sadā sataṃ; Satataṃ pahitattoti, āhu bhikkhuṃ tathāvidha’’nti. dutiyaṃ;",
      "english": "Monks, dwell perfected in moral conduct, perfected in the Pātimokkha. Dwell restrained by the Pātimokkha’s restraint, accomplished in good conduct and suitable resort, seeing danger even in the slightest faults. Undertake and train in the training rules. For you, monks, who dwell perfected in moral conduct, perfected in the Pātimokkha, restrained by the Pātimokkha’s restraint, accomplished in good conduct and suitable resort, seeing danger even in the slightest faults, undertaking and training in the training rules—what more is there to be done?\n\nEven when a monk is walking, monks, if covetousness and ill-will are gone, sloth and torpor are abandoned, restlessness and remorse are abandoned, doubt is abandoned, energy is aroused and unflagging, mindfulness is established and unconfused, the body is tranquil and not agitated, and the mind is concentrated and one-pointed – even such a monk, walking, monks, is called 'ardent, conscientious, constantly and continuously with aroused energy, self-resolute'.\n\nEven when a monk is standing, monks, if covetousness and ill-will are gone, sloth and torpor are abandoned, restlessness and remorse are abandoned, doubt is abandoned, energy is aroused and unflagging, mindfulness is established and unconfused, the body is tranquil and not agitated, and the mind is concentrated and one-pointed – even such a monk, standing, monks, is called 'ardent, conscientious, constantly and continuously with aroused energy, self-resolute'.\n\nEven when a monk is sitting, monks, if covetousness and ill-will are gone, sloth and torpor are abandoned, restlessness and remorse are abandoned, doubt is abandoned, energy is aroused and unflagging, mindfulness is established and unconfused, the body is tranquil and not agitated, and the mind is concentrated and one-pointed – even such a monk, sitting, monks, is called 'ardent, conscientious, constantly and continuously with aroused energy, self-resolute'.\n\nEven when a monk is lying down and awake, monks, if covetousness and ill-will are gone, sloth and torpor are abandoned, restlessness and remorse are abandoned, doubt is abandoned, energy is aroused and unflagging, mindfulness is established and unconfused, the body is tranquil and not agitated, and the mind is concentrated and one-pointed – even such a monk, lying down and awake, monks, is called 'ardent, conscientious, constantly and continuously with aroused energy, self-resolute'.\n\nWith self-control let him walk, with self-control let him stand, with self-control let him sit, with self-control let him lie down. With self-control let the monk contract, with self-control let him extend.\n\nAbove, across, and below, as far as the world’s movement extends; observing the arising and passing away of phenomena, of the aggregates.\n\nAlways mindful, training in the proper calming of the mind, such a monk is called 'constantly self-resolute'.",
      "sinhala": "භික්ෂූනි, මනාකොට සම්පූර්ණ කරන ලද ශීලයකින් යුක්තව, මනාකොට සම්පූර්ණ කරන ලද ප්‍රාතිමෝක්ෂයකින් යුක්තව, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූවන් ලෙස, ආචාර සම්පන්නව, ගෝචර සම්පන්නව, ඉතා කුඩා වැරදිවල පවා බිය දකින්නන් ලෙස වාසය කරන්න. ශික්ෂා පදයන් සමාදන්ව හික්මෙන්න. භික්ෂූනි, මනාකොට සම්පූර්ණ කරන ලද ශීලයකින් යුක්තව, මනාකොට සම්පූර්ණ කරන ලද ප්‍රාතිමෝක්ෂයකින් යුක්තව, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව, ආචාර සම්පන්නව, ගෝචර සම්පන්නව, ඉතා කුඩා වැරදිවල පවා බිය දකින්නන් ලෙස, ශික්ෂා පදයන් සමාදන්ව හික්මෙමින් වාසය කරන ඔබට මීට වඩා අතිරේකව කළ යුත්තේ කුමක්ද?\n\nභික්ෂූනි, ගමන් කරන භික්ෂුවකගේ වුවද, අභිධ්‍යා-ව්‍යාපාදය පහව ගොස් ඇත්නම්, ථීනමිද්ධය පහව ගොස් ඇත්නම්, උද්ධච්ච-කුක්කුච්චය පහව ගොස් ඇත්නම්, විචිකිච්ඡාව පහව ගොස් ඇත්නම්, පටන් ගන්නා ලද වීර්යය මුලුන් නොනැසී පවතී නම්, නොමුළා වූ සිහිය පිහිටා ඇත්නම්, ශරීරය සන්සුන්ව, නොසැලී ඇත්නම්, සිත එකඟව, සමාධිමත් වී ඇත්නම්, භික්ෂූනි, ගමන් කරන එවැනි භික්ෂුවක් පවා ‘තද වීර්යයෙන් යුතුව, පවින් බියවෙමින්, නිරතුරුවම නොකඩවා, දැඩි වීර්යයෙන් යුතුව, සියලු ක්ලේශයන් පහකිරීමට කැපවූ සිත් ඇත්තෙක්’ යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සිටගෙන සිටින භික්ෂුවකගේ වුවද, අභිධ්‍යා-ව්‍යාපාදය පහව ගොස් ඇත්නම්, ථීනමිද්ධය පහව ගොස් ඇත්නම්, උද්ධච්ච-කුක්කුච්චය පහව ගොස් ඇත්නම්, විචිකිච්ඡාව පහව ගොස් ඇත්නම්, පටන් ගන්නා ලද වීර්යය මුලුන් නොනැසී පවතී නම්, නොමුළා වූ සිහිය පිහිටා ඇත්නම්, ශරීරය සන්සුන්ව, නොසැලී ඇත්නම්, සිත එකඟව, සමාධිමත් වී ඇත්නම්, භික්ෂූනි, සිටගෙන සිටින එවැනි භික්ෂුවක් පවා ‘තද වීර්යයෙන් යුතුව, පවින් බියවෙමින්, නිරතුරුවම නොකඩවා, දැඩි වීර්යයෙන් යුතුව, සියලු ක්ලේශයන් පහකිරීමට කැපවූ සිත් ඇත්තෙක්’ යැයි කියනු ලැබේ.\n\nභික්ෂූනි, හිඳගෙන සිටින භික්ෂුවකගේ වුවද, අභිධ්‍යා-ව්‍යාපාදය පහව ගොස් ඇත්නම්, ථීනමිද්ධය පහව ගොස් ඇත්නම්, උද්ධච්ච-කුක්කුච්චය පහව ගොස් ඇත්නම්, විචිකිච්ඡාව පහව ගොස් ඇත්නම්, පටන් ගන්නා ලද වීර්යය මුලුන් නොනැසී පවතී නම්, නොමුළා වූ සිහිය පිහිටා ඇත්නම්, ශරීරය සන්සුන්ව, නොසැලී ඇත්නම්, සිත එකඟව, සමාධිමත් වී ඇත්නම්, භික්ෂූනි, හිඳගෙන සිටින එවැනි භික්ෂුවක් පවා ‘තද වීර්යයෙන් යුතුව, පවින් බියවෙමින්, නිරතුරුවම නොකඩවා, දැඩි වීර්යයෙන් යුතුව, සියලු ක්ලේශයන් පහකිරීමට කැපවූ සිත් ඇත්තෙක්’ යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සයනය කර සිටින, අවදිව සිටින භික්ෂුවකගේ වුවද, අභිධ්‍යා-ව්‍යාපාදය පහව ගොස් ඇත්නම්, ථීනමිද්ධය පහව ගොස් ඇත්නම්, උද්ධච්ච-කුක්කුච්චය පහව ගොස් ඇත්නම්, විචිකිච්ඡාව පහව ගොස් ඇත්නම්, පටන් ගන්නා ලද වීර්යය මුලුන් නොනැසී පවතී නම්, නොමුළා වූ සිහිය පිහිටා ඇත්නම්, ශරීරය සන්සුන්ව, නොසැලී ඇත්නම්, සිත එකඟව, සමාධිමත් වී ඇත්නම්, භික්ෂූනි, සයනය කර සිටින, අවදිව සිටින එවැනි භික්ෂුවක් පවා ‘තද වීර්යයෙන් යුතුව, පවින් බියවෙමින්, නිරතුරුවම නොකඩවා, දැඩි වීර්යයෙන් යුතුව, සියලු ක්ලේශයන් පහකිරීමට කැපවූ සිත් ඇත්තෙක්’ යැයි කියනු ලැබේ.\n\nභික්ෂුව ගමන් කරන්නේ ද සිහියෙන් යුතුවය, සිටගෙන සිටින්නේ ද සිහියෙන් යුතුවය, හිඳගෙන සිටින්නේ ද සිහියෙන් යුතුවය, සයනය කරන්නේ ද සිහියෙන් යුතුවය.\nභික්ෂුව අත් පා හකුලුවන්නේ ද සිහියෙන් යුතුවය, අත් පා දිගහරින්නේ ද සිහියෙන් යුතුවය.\n\nඉහළට, හරහට, පහළට, ලෝකයේ ගමන් කරන තාක් දුරට, ධර්මයන්ගේ ද, පංචස්කන්ධයන්ගේ ද හටගැනීම හා විනාශය මනාව විමසා බලයි.\n\nනිරතුරුවම සිහි ඇතිව, චිත්ත සමාධියට අනුකූල වූ සමථ භාවනාව පුරුදු කරන එවැනි භික්ෂුවක් ‘නිරන්තරයෙන්ම සියලු ක්ලේශයන් පහකිරීමට කැපවූ සිත් ඇත්තෙක්’ යැයි කියනු ලැබේ.",
      "paliTitle": "Sīlasuttaṃ",
      "englishTitle": "The Discourse on Morality",
      "sinhalaTitle": "සීල සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "‘‘Cattārimāni, bhikkhave, sammappadhānāni. Katamāni cattāri? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imāni kho, bhikkhave, cattāri sammappadhānānī’’ti. ‘‘Sammappadhānā māradheyyābhibhūtā, Te asitā jātimaraṇabhayassa pāragū; Te tusitā jetvā māraṃ savāhiniṃ [savāhanaṃ (syā. kaṃ. pī. ka.)] te anejā, Sabbaṃ namucibalaṃ upātivattā te sukhitā’’ti. tatiyaṃ;",
      "english": "Monks, these are the four right strivings. Which four? Here, monks, a monk generates desire for the non-arising of unarisen evil, unwholesome states; he makes an effort, arouses energy, exerts his mind, and strives. He generates desire for the abandonment of arisen evil, unwholesome states; he makes an effort, arouses energy, exerts his mind, and strives. He generates desire for the arising of unarisen wholesome states; he makes an effort, arouses energy, exerts his mind, and strives. He generates desire for the maintenance, non-forgetting, increase, full growth, development, and perfect fulfillment of arisen wholesome states; he makes an effort, arouses energy, exerts his mind, and strives. These, monks, are the four right strivings.\n\nThose who possess right striving have overcome the realm of Māra. They are unattached, having gone beyond the fear of birth and death. They are content, having conquered Māra with his army; they are free from craving. They have completely transcended all the forces of Namuci; they are truly happy.",
      "sinhala": "මහණෙනි, මේවා සතර සම්‍යක් ප්‍රධානයෝ ය. ඒ සතර කවරහු ද? මහණෙනි, මෙහිලා භික්ෂුව නූපන් අකුසල ධර්මයන් නොඉපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත අල්වාගෙන සිටියි, වීර්යයෙන් ක්‍රියා කරයි; ඉපදුනු අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත අල්වාගෙන සිටියි, වීර්යයෙන් ක්‍රියා කරයි; නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත අල්වාගෙන සිටියි, වීර්යයෙන් ක්‍රියා කරයි; ඉපදුනු කුසල ධර්මයන් තහවුරු වීම පිණිස, විකෘති නොවී පැවතීම පිණිස, වැඩි දියුණු වීම පිණිස, විපුල බවට පත්වීම පිණිස, භාවනා කිරීම පිණිස, සම්පූර්ණ වීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත අල්වාගෙන සිටියි, වීර්යයෙන් ක්‍රියා කරයි. මහණෙනි, මේවා සතර සම්‍යක් ප්‍රධානයෝ වෙති.\n\nසම්‍යක් ප්‍රධානයන් වඩන උතුමන් මාරයාගේ අධිපතිත්වය ඉක්මවා සිටිති. ඔවුහු අසංගව සිටිති; ජාති, මරණ භයෙන් එතෙර වූවෝ වෙති. ඔවුහු තෘප්තිමත් ව, සේනාව සහිත මාරයා දිනා, කම්පාවෙන් තොරව සිටිති. සෑම නමුචි බලවේගයක්ම අතික්‍රමණය කර, ඔවුහු සුවපත් වූවෝ වෙති.",
      "paliTitle": "Padhānasuttaṃ",
      "englishTitle": "The Discourse on Striving",
      "sinhalaTitle": "ප‍්‍රධානය සූත‍්‍රය"
    },
    {
      "number": 14,
      "pali": "‘‘Cattārimāni, bhikkhave, padhānāni. Katamāni cattāri? Saṃvarappadhānaṃ, pahānappadhānaṃ, bhāvanāppadhānaṃ, anurakkhaṇāppadhānaṃ. Katamañca, bhikkhave, saṃvarappadhānaṃ? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī, yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati, rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. Idaṃ vuccati, bhikkhave, saṃvarappadhānaṃ. ‘‘Katamañca, bhikkhave, pahānappadhānaṃ? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gameti; uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ…pe… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Idaṃ vuccati, bhikkhave, pahānappadhānaṃ. ‘‘Katamañca, bhikkhave, bhāvanāppadhānaṃ? Idha, bhikkhave, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, dhammavicayasambojjhaṅgaṃ bhāveti… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Idaṃ vuccati, bhikkhave, bhāvanāppadhānaṃ. ‘‘Katamañca, bhikkhave, anurakkhaṇāppadhānaṃ? Idha, bhikkhave, bhikkhu uppannaṃ bhaddakaṃ samādhinimittaṃ anurakkhati aṭṭhikasaññaṃ puḷavakasaññaṃ vinīlakasaññaṃ vicchiddakasaññaṃ uddhumātakasaññaṃ. Idaṃ vuccati, bhikkhave, anurakkhaṇāppadhānaṃ. Imāni kho, bhikkhave, cattāri padhānānī’’ti. ‘‘Saṃvaro ca pahānañca, bhāvanā anurakkhaṇā; Ete padhānā cattāro, desitādiccabandhunā; Yehi bhikkhu idhātāpī, khayaṃ dukkhassa pāpuṇe’’ti. catutthaṃ;",
      "english": "“Monks, there are these four exertions. Which four? The exertion of restraint, the exertion of abandoning, the exertion of development, and the exertion of protection.\n\nAnd what, monks, is the exertion of restraint? Here, monks, a monk, seeing a form with the eye, does not grasp at its general appearance or its specific details. He practices for the restraint of that through which, if the eye faculty were to remain unrestrained, evil, unwholesome states of covetousness and distress might overwhelm him. He guards the eye faculty; he undertakes the restraint of the eye faculty. Hearing a sound with the ear... Smelling an odor with the nose... Tasting a flavor with the tongue... Touching a tangible object with the body... Cognizing a mental phenomenon with the mind, he does not grasp at its general appearance or its specific details. He practices for the restraint of that through which, if the mind faculty were to remain unrestrained, evil, unwholesome states of covetousness and distress might overwhelm him. He guards the mind faculty; he undertakes the restraint of the mind faculty. This, monks, is called the exertion of restraint.\n\nAnd what, monks, is the exertion of abandoning? Here, monks, a monk does not tolerate an arisen thought of sensual desire; he abandons it, dispels it, puts an end to it, and makes it cease to exist. He does not tolerate an arisen thought of ill-will... He does not tolerate an arisen thought of harming... He does not tolerate any arisen evil, unwholesome states; he abandons them, dispels them, puts an end to them, and makes them cease to exist. This, monks, is called the exertion of abandoning.\n\nAnd what, monks, is the exertion of development? Here, monks, a monk develops the mindfulness factor of awakening, which is based on seclusion, dispassion, and cessation, and ripens in relinquishment. He develops the discernment-of-phenomena factor of awakening... the energy factor of awakening... the rapture factor of awakening... the tranquility factor of awakening... the concentration factor of awakening... the equanimity factor of awakening, which is based on seclusion, dispassion, and cessation, and ripens in relinquishment. This, monks, is called the exertion of development.\n\nAnd what, monks, is the exertion of protection? Here, monks, a monk protects an arisen auspicious meditation object, such as the perception of bones, the perception of worms, the perception of lividity, the perception of being cut up, or the perception of bloatedness. This, monks, is called the exertion of protection. These, monks, are the four exertions.\n\nRestraint and abandoning, development and protection;\nThese are the four exertions, taught by the Kinsman of the Sun;\nBy which a monk, ardent here, attains the destruction of suffering.",
      "sinhala": "භික්ෂූනි, මේවා සතර ප්‍රධාන ධර්ම යි. කවරවා යි මේ සතර? සංවර ප්‍රධානය, ප්‍රහාණ ප්‍රධානය, භාවනා ප්‍රධානය, අනුරක්ෂණා ප්‍රධානය යි.\n\nභික්ෂූනි, සංවර ප්‍රධානය කවරවා ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් ඇසින් රූපයක් දැක එහි නිමිත්ත නොගන්නේ වෙයි. අනු ව්‍යංජන නොගන්නේ වෙයි. යම් හෙයකින් ඔහුගේ චක්ෂුර් ඉන්ද්‍රිය අසංවරව වාසය කිරීමෙන් ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල් ධර්මයන්ට ගලා ඒමට ඉඩ සැලසේද, ඔහු ඒ චක්ෂුර් ඉන්ද්‍රිය සංවර කර ගැනීමට පිළිපදී, චක්ෂුර් ඉන්ද්‍රිය ආරක්ෂා කරයි, චක්ෂුර් ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. කනින් ශබ්දයක් අසා... නාසයෙන් ගඳක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් ස්පර්ශයක් ස්පර්ශ කොට... මනසින් ධර්මයක් දැන (එහි) නිමිත්ත නොගන්නේ වෙයි, අනු ව්‍යංජන නොගන්නේ වෙයි. යම් හෙයකින් ඔහුගේ මනෝ ඉන්ද්‍රිය අසංවරව වාසය කිරීමෙන් ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල් ධර්මයන්ට ගලා ඒමට ඉඩ සැලසේද, ඔහු ඒ මනෝ ඉන්ද්‍රිය සංවර කර ගැනීමට පිළිපදී, මනෝ ඉන්ද්‍රිය ආරක්ෂා කරයි, මනෝ ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. භික්ෂූනි, මෙය සංවර ප්‍රධානය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, ප්‍රහාණ ප්‍රධානය කවරවා ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් උපන් කාම විතර්කයන් ඉවසන්නේ නැත, ඒවා අත්හරියි, දුරු කරයි, නැති කරයි, අභාවයට පත් කරයි. උපන් ව්‍යාපාද විතර්කයන්ද ඉවසන්නේ නැත, ඒවා අත්හරියි, දුරු කරයි, නැති කරයි, අභාවයට පත් කරයි. උපන් විහිංසා විතර්කයන්ද ඉවසන්නේ නැත, ඒවා අත්හරියි, දුරු කරයි, නැති කරයි, අභාවයට පත් කරයි. උපනුපන් අන්‍ය වූද පව් අකුසල් ධර්මයන් ඉවසන්නේ නැත, ඒවා අත්හරියි, දුරු කරයි, නැති කරයි, අභාවයට පත් කරයි. භික්ෂූනි, මෙය ප්‍රහාණ ප්‍රධානය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, භාවනා ප්‍රධානය කවරවා ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් විවේකය ඇසුරු කොට, විරාගය ඇසුරු කොට, නිරෝධය ඇසුරු කොට, අත්හැරීමෙහි කෙළවර වන සේ සති සම්බොජ්ඣංගය වඩයි. ධම්මවිචය සම්බොජ්ඣංගය වඩයි, වීර්ය සම්බොජ්ඣංගය වඩයි, ප්‍රීති සම්බොජ්ඣංගය වඩයි, පස්සද්ධි සම්බොජ්ඣංගය වඩයි, සමාධි සම්බොජ්ඣංගය වඩයි, විවේකය ඇසුරු කොට, විරාගය ඇසුරු කොට, නිරෝධය ඇසුරු කොට, අත්හැරීමෙහි කෙළවර වන සේ උපේක්ඛා සම්බොජ්ඣංගය වඩයි. භික්ෂූනි, මෙය භාවනා ප්‍රධානය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, අනුරක්ෂණා ප්‍රධානය කවරවා ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් උපන් යහපත් සමාධි නිමිත්තක් ආරක්ෂා කරයි. එනම්, ඇටසැකිලි සංඥාව, පණුවන් පිරුණු සංඥාව, නිල් පැහැ ගැන්වූ සංඥාව, විච්ඡේදනය වූ සංඥාව, ඉදිමුණු සංඥාව යි. භික්ෂූනි, මෙය අනුරක්ෂණා ප්‍රධානය යැයි කියනු ලැබේ. භික්ෂූනි, මේවා සතර ප්‍රධාන ධර්ම යි.\n\nසංවරය ද, ප්‍රහාණය ද, භාවනාව ද, අනුරක්ෂණය ද යන මේ සතර ප්‍රධානයෝ ආදිච්චබන්ධු (සූර්ය වංශික) වූ භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද්දාහු ය. යම් ධර්මයන්ගෙන් භික්ෂුවක් මේ ශාසනයෙහි වීර්යවන්තව දුක ක්ෂය කිරීම (අවබෝධ කිරීම) පිණිස පැමිණෙන්නේ ද.",
      "paliTitle": "Saṃvarasuttaṃ",
      "englishTitle": "The Discourse on Restraint",
      "sinhalaTitle": "සංවර සූත‍්‍රය"
    },
    {
      "number": 15,
      "pali": "‘‘Catasso imā, bhikkhave, aggapaññattiyo. Katamā catasso? Etadaggaṃ, bhikkhave, attabhāvīnaṃ yadidaṃ – rāhu asurindo. Etadaggaṃ, bhikkhave, kāmabhogīnaṃ yadidaṃ – rājā mandhātā. Etadaggaṃ, bhikkhave, ādhipateyyānaṃ yadidaṃ – māro pāpimā. Sadevake, bhikkhave, loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato aggamakkhāyati arahaṃ sammāsambuddho. Imā kho, bhikkhave, catasso aggapaññattiyo’’ti. ‘‘Rāhuggaṃ attabhāvīnaṃ, mandhātā kāmabhoginaṃ; Māro ādhipateyyānaṃ, iddhiyā yasasā jalaṃ. ‘‘Uddhaṃ tiriyaṃ apācīnaṃ, yāvatā jagato gati; Sadevakassa lokassa, buddho aggo pavuccatī’’ti. pañcamaṃ;",
      "english": "“Monks, these are the four foremost designations. Which four? Among those with an individual existence, monks, Rāhu, the lord of asuras, is declared foremost. Among those who enjoy sensual pleasures, monks, King Mandhātā is declared foremost. Among those who exercise dominion, monks, Māra the Evil One is declared foremost. Among the world with its devas, Māras, and Brahmās, among the generation of recluses and brahmins, of devas and humans, the Tathāgata, the Arahant, the Fully Awakened One, is declared foremost. These, monks, are indeed the four foremost designations.”\n\nRāhu is foremost among those with an individual existence, Mandhātā among those who enjoy sensual pleasures; Māra among those who exercise dominion, shining with power and glory.\nUpwards, across, and downwards, as far as the world extends; in the world with its devas, the Buddha is declared foremost.",
      "sinhala": "භික්ෂූණි, මේ අග්‍ර ප්‍රඥප්ති සතරකි. ඒ සතර කුමක්ද යත්?\n\nභික්ෂූණි, ආත්මභාව ඇති අය අතුරින් මේ රාහු අසුරේන්ද්‍රයා අග්‍ර වේ. භික්ෂූණි, කාමභෝගී පුද්ගලයන් අතුරින් මේ මන්ධාතු රජු අග්‍ර වේ. භික්ෂූණි, ආධිපත්‍ය දරන්නන් අතුරින් මේ පාපීමා මාරයා අග්‍ර වේ. භික්ෂූණි, දෙවියන් සහිත වූ, මාරයා සහිත වූ, බ්‍රහ්මයා සහිත වූ, ශ්‍රමණ බ්‍රාහ්මණ ප්‍රජාව සහිත වූ, දෙවි මිනිසුන් සහිත වූ ලෝකයෙහි තථාගත අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ අග්‍ර යැයි වදාළ සේක. භික්ෂූණි, මේවාමයි අග්‍ර ප්‍රඥප්ති සතර.\n\nආත්මභාව ඇති අය අතුරින් රාහු අග්‍ර වේ.\nකාමභෝගී අය අතුරින් මන්ධාතු අග්‍ර වේ.\nඉර්ධියෙන් හා යසසින් බැබළෙන මාරයා ආධිපත්‍ය දරන්නන් අතුරින් අග්‍ර වේ.\nඋඩට, හරහට, යටට, යම්තාක් ලෝකය පැතිරී තිබේද, දෙවියන් සහිත වූ ඒ ලෝකයට බුදුරජාණන් වහන්සේ අග්‍ර යැයි කියනු ලැබේ.",
      "paliTitle": "Paññattisuttaṃ",
      "englishTitle": "Discourse on Designation",
      "sinhalaTitle": "පඤ්ඤ‍ත්ති සූත්‍රය"
    },
    {
      "number": 16,
      "pali": "‘‘Cattārimāni, bhikkhave, sokhummāni. Katamāni cattāri? Idha, bhikkhave, bhikkhu rūpasokhummena samannāgato hoti paramena; tena ca rūpasokhummena aññaṃ rūpasokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na samanupassati; tena ca rūpasokhummena aññaṃ rūpasokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Vedanāsokhummena samannāgato hoti paramena; tena ca vedanāsokhummena aññaṃ vedanāsokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na samanupassati; tena ca vedanāsokhummena aññaṃ vedanāsokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Saññāsokhummena samannāgato hoti paramena; tena ca saññāsokhummena aññaṃ saññāsokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na samanupassati; tena ca saññāsokhummena aññaṃ saññāsokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Saṅkhārasokhummena samannāgato hoti paramena; tena ca saṅkhārasokhummena aññaṃ saṅkhārasokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na samanupassati; tena ca saṅkhārasokhummena aññaṃ saṅkhārasokhummaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Imāni kho, bhikkhave, cattāri sokhummānī’’ti. ‘‘Rūpasokhummataṃ ñatvā, vedanānañca sambhavaṃ; Saññā yato samudeti, atthaṃ gacchati yattha ca; Saṅkhāre parato ñatvā, dukkhato no ca attato. ‘‘Sa ve sammaddaso bhikkhu, santo santipade rato; Dhāreti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti. chaṭṭhaṃ;",
      "english": "Monks, these four are the subtleties. What are these four?\n\nHere, monks, a monk is endowed with the supreme subtlety of form; and by that subtlety of form, he does not perceive any other subtlety of form as higher or more refined; and by that subtlety of form, he does not long for any other subtlety of form as higher or more refined. He is endowed with the supreme subtlety of feeling; and by that subtlety of feeling, he does not perceive any other subtlety of feeling as higher or more refined; and by that subtlety of feeling, he does not long for any other subtlety of feeling as higher or more refined. He is endowed with the supreme subtlety of perception; and by that subtlety of perception, he does not perceive any other subtlety of perception as higher or more refined; and by that subtlety of perception, he does not long for any other subtlety of perception as higher or more refined. He is endowed with the supreme subtlety of volitional formations; and by that subtlety of volitional formations, he does not perceive any other subtlety of volitional formations as higher or more refined; and by that subtlety of volitional formations, he does not long for any other subtlety of volitional formations as higher or more refined. These, monks, are the four subtleties.\n\nHaving understood the subtlety of form, and the arising of feelings; from where perception arises, and where it ceases; having understood volitional formations as alien, as suffering, and not as self—that monk, truly rightly seeing, peaceful and delighting in the path to peace, bears his final body, having conquered Māra with his retinue.",
      "sinhala": "මහණෙනි, මේ සූක්ෂමතා සතරක් වෙති. ඒ සතර කවරේද? මහණෙනි, මෙහි භික්ෂුවක් පරම වූ රූප සූක්ෂමතාවයකින් යුක්ත වන්නේය; එම රූප සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් රූප සූක්ෂමතාවයක් ඔහු නොදකියි; එම රූප සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් රූප සූක්ෂමතාවයක් ඔහු නොපතයි.\n\nපරම වූ වේදනා සූක්ෂමතාවයකින් යුක්ත වන්නේය; එම වේදනා සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් වේදනා සූක්ෂමතාවයක් ඔහු නොදකියි; එම වේදනා සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් වේදනා සූක්ෂමතාවයක් ඔහු නොපතයි.\n\nපරම වූ සඤ්ඤා සූක්ෂමතාවයකින් යුක්ත වන්නේය; එම සඤ්ඤා සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් සඤ්ඤා සූක්ෂමතාවයක් ඔහු නොදකියි; එම සඤ්ඤා සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් සඤ්ඤා සූක්ෂමතාවයක් ඔහු නොපතයි.\n\nපරම වූ සංඛාර සූක්ෂමතාවයකින් යුක්ත වන්නේය; එම සංඛාර සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් සංඛාර සූක්ෂමතාවයක් ඔහු නොදකියි; එම සංඛාර සූක්ෂමතාවයට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් සංඛාර සූක්ෂමතාවයක් ඔහු නොපතයි.\n\nමහණෙනි, මේවා සූක්ෂමතා සතරයි.\n\nරූපයේ සූක්ෂමභාවයද, වේදනාවන්ගේ හටගැනීමද දැන, සඤ්ඤාව හටගන්නා තැනද, නැතිවී යන තැනද අවබෝධ කර, සංඛාර අන් දෙයක් ලෙසත්, දුකක් ලෙසත්, ආත්මයක් නොවන ලෙසත් දැන,\n\nඔහු සැබවින්ම සම්‍යක් දර්ශනයෙන් යුත් භික්ෂුවකි, ශාන්ත වූ, ශාන්ති පදයට (නිවනට) ඇලුම් කරන්නෙකි. ඔහු මාරයා හා ඔහුගේ සේනාව පරාජය කර, අවසාන ශරීරය දරන්නේය.",
      "paliTitle": "Sokhummasuttaṃ",
      "englishTitle": "The Discourse on Subtlety",
      "sinhalaTitle": "සූක්ෂ්ම සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "‘‘Cattārimāni, bhikkhave, agatigamanāni. Katamāni cattāri? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati – imāni kho, bhikkhave, cattāri agatigamanānī’’ti. ‘‘Chandā dosā bhayā mohā, yo dhammaṃ ativattati; Nihīyati tassa yaso, kāḷapakkheva candimā’’ti. sattamaṃ;",
      "english": "Monks, there are these four improper courses of action. Which four? One goes on the path of bias due to desire, one goes on the path of bias due to hatred, one goes on the path of bias due to delusion, and one goes on the path of bias due to fear. These, monks, are the four improper courses of action.\n\nWhoever transgresses the Dhamma due to desire, hatred, fear, or delusion, his fame declines, like the moon during the dark fortnight.",
      "sinhala": "භික්ෂූන් වහන්ස, අගති ගමන් සතරක් ඇත. ඒ සතර කවරේද? ඡන්දය හේතුවෙන් අගතියට යයි, ද්වේෂය හේතුවෙන් අගතියට යයි, මෝහය හේතුවෙන් අගතියට යයි, භය හේතුවෙන් අගතියට යයි. භික්ෂූන් වහන්ස, මේවා අගති ගමන් සතර වේ.\n\nඡන්දය, ද්වේෂය, භය, මෝහය යන මේවා නිසා යම් කෙනෙක් ධර්මය ඉක්මවා කටයුතු කරන්නේද, කළුවර පෑලැස්සේ සඳ මෙන් ඔහුගේ යසස පිරිහී යයි.",
      "paliTitle": "Paṭhamaagatisuttaṃ",
      "englishTitle": "First Discourse on Wrong Courses",
      "sinhalaTitle": "පළමු අගති සූත්‍රය"
    },
    {
      "number": 18,
      "pali": "‘‘Cattārimāni, bhikkhave, nāgatigamanāni. Katamāni cattāri? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati – imāni kho, bhikkhave, cattāri nāgatigamanānī’’ti. ‘‘Chandā dosā bhayā mohā, yo dhammaṃ nātivattati; Āpūrati tassa yaso, sukkapakkheva candimā’’ti. aṭṭhamaṃ;",
      "english": "Monastics, there are these four ways of not straying due to prejudice. Which four? One does not stray due to prejudice based on desire, one does not stray due to prejudice based on hatred, one does not stray due to prejudice based on delusion, and one does not stray due to prejudice based on fear. These, monastics, are the four ways of not straying due to prejudice.\n\nWhoever does not violate the Dhamma due to desire, hatred, fear, or delusion— his renown indeed increases, like the moon in the bright fortnight.",
      "sinhala": "භික්ෂූනි, මේ නොයා යුතු ගමන් සතරක් තිබේ. කවරේද ඒ සතර? ඡන්දය (කැමැත්ත) නිසා අගතියට නොයයි; ද්වේෂය (වෛරය) නිසා අගතියට නොයයි; මෝහය (මුළාව) නිසා අගතියට නොයයි; භය (බිය) නිසා අගතියට නොයයි. භික්ෂූනි, මේවාමයි නොයා යුතු ගමන් සතර.\n\nයම් පුද්ගලයෙක් ඡන්දය, ද්වේෂය, භය, මෝහය යන මේවා හේතුවෙන් ධර්‍මය ඉක්මවා නොයයි ද, ඔහුගේ යසස ශුක්ල පක්ෂයේ සඳ මෙන් පිරී යයි.",
      "paliTitle": "Dutiyaagatisuttaṃ",
      "englishTitle": "Second Discourse on Wrong Courses",
      "sinhalaTitle": "දෙවන අගති සූත්‍රය"
    },
    {
      "number": 19,
      "pali": "‘‘Cattārimāni, bhikkhave, agatigamanāni. Katamāni cattāri? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati – imāni kho, bhikkhave, cattāri agatigamanāni. ‘‘Cattārimāni, bhikkhave, nāgatigamanāni. Katamāni cattāri? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati – imāni kho, bhikkhave, cattāri nāgatigamanānī’’ti. ‘‘Chandā dosā bhayā mohā, yo dhammaṃ ativattati; Nihīyati tassa yaso, kāḷapakkheva candimā. ‘‘Chandā dosā bhayā mohā, yo dhammaṃ nātivattati; Āpūrati tassa yaso, sukkapakkheva candimā’’ti. navamaṃ;",
      "english": "“Bhikkhus, there are these four wrong courses of conduct. Which four? One goes a wrong course due to partiality, one goes a wrong course due to aversion, one goes a wrong course due to delusion, one goes a wrong course due to fear – these, bhikkhus, are the four wrong courses of conduct.\n\n“Bhikkhus, there are these four courses of conduct that are not wrong. Which four? One does not go a wrong course due to partiality, one does not go a wrong course due to aversion, one does not go a wrong course due to delusion, one does not go a wrong course due to fear – these, bhikkhus, are the four courses of conduct that are not wrong.\n\nWhoever transgresses the Dhamma due to partiality, aversion, fear, or delusion, his renown declines, just like the moon in the dark fortnight.\n\nWhoever does not transgress the Dhamma due to partiality, aversion, fear, or delusion, his renown increases, just like the moon in the bright fortnight.",
      "sinhala": "භික්‍ෂූනි, මේ අගත‍ිගමන සතරකි. කවර සතරක්ද? ඡන්දය නිසා අගතියට යයි, ද්වේෂය නිසා අගතියට යයි, මෝහය නිසා අගතියට යයි, භය නිසා අගතියට යයි. භික්‍ෂූනි, මේවා අගත‍ිගමන සතරක් යයි කියනු ලැබේ.\n\nභික්‍ෂූනි, මේ නාගත‍ිගමන සතරකි. කවර සතරක්ද? ඡන්දය නිසා අගතියට නොයයි, ද්වේෂය නිසා අගතියට නොයයි, මෝහය නිසා අගතියට නොයයි, භය නිසා අගතියට නොයයි. භික්‍ෂූනි, මේවා නාගත‍ිගමන සතරක් යයි කියනු ලැබේ.\n\nයම් කෙනෙක් ඡන්දය, ද්වේෂය, භය, මෝහය යන මේවා නිසා ධර්මය ඉක්මවා කටයුතු කරයිද, ඔහුගේ යසස අඳුරු පක්‍ෂයේ සඳ මෙන් පිරිහීමට පත්වේ.\n\nයම් කෙනෙක් ඡන්දය, ද්වේෂය, භය, මෝහය යන මේවා නිසා ධර්මය ඉක්මවා නොකටයුතු කරයිද, ඔහුගේ යසස සුදු පක්‍ෂයේ සඳ මෙන් වැඩේ.",
      "paliTitle": "Tatiyaagatisuttaṃ",
      "englishTitle": "The Third Discourse on Wrong Courses",
      "sinhalaTitle": "තුන්වන අගති සූත්‍රය"
    },
    {
      "number": 20,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ sagge’’ti. ‘‘Ye keci kāmesu asaññatā janā, Adhammikā honti adhammagāravā; Chandā dosā mohā ca bhayā gāmino [chandā ca dosā ca bhayā ca gāmino (sī. syā. kaṃ. pī)], Parisākasaṭo [parisakkasāvo (sī. syā. kaṃ. pī.)] ca panesa vuccati. ‘‘Evañhi vuttaṃ samaṇena jānatā, Tasmā hi te sappurisā pasaṃsiyā; Dhamme ṭhitā ye na karonti pāpakaṃ, Na chandā na dosā na mohā na bhayā ca gāmino [na chandadosā na bhayā ca gāmino (sī. syā. kaṃ. pī.)]; ‘‘Parisāya maṇḍo ca panesa vuccati, Evañhi vuttaṃ samaṇena jānatā’’ti. dasamaṃ; ",
      "english": "\"Monks, a distributor of food who is endowed with four qualities is cast into hell as if deposited there. What are the four? He goes to partiality through desire, he goes to partiality through aversion, he goes to partiality through delusion, he goes to partiality through fear. It is with these four qualities that a distributor of food is cast into hell as if deposited there.\n\n\"Monks, a distributor of food who is endowed with four qualities is cast into heaven as if deposited there. What are the four? He does not go to partiality through desire, he does not go to partiality through aversion, he does not go to partiality through delusion, he does not go to partiality through fear. It is with these four qualities that a distributor of food is cast into heaven as if deposited there.\"\n\n\"Those people who are unrestrained in sensual pleasures, who are unrighteous, and who have no respect for righteousness, who go to desire, aversion, delusion, and fear, are called the dregs of the assembly.\n\n\"Thus has it been said by the mindful ascetic. Therefore, those who are righteous are praised by the good. They stand firm in the Dhamma and do no evil, not going to desire, aversion, delusion, or fear. They are called the ornament of the assembly. Thus has it been said by the mindful ascetic.\"\n\nThe tenth is finished.",
      "sinhala": "මහණෙනි, ධර්ම හතරකින් යුක්ත වූ දානයන් බෙදන්නා (බත් බෙදන්නා) ගෙන ගොස් දැමුවාක් මෙන් නිරයේ වැටෙයි. ඔහු ඡන්දය (කැමැත්ත/පක්ෂපාතීත්වය) මුල් කරගත් මාර්ගයට යයි, ද්වේෂය (අකමැත්ත/වෛරය) මුල් කරගත් මාර්ගයට යයි, මෝහය (මුළාව/නොදැනීම) මුල් කරගත් මාර්ගයට යයි, භය (බිය) මුල් කරගත් මාර්ගයට යයි. මහණෙනි, මේ ධර්ම හතරකින් යුක්ත වූ දානයන් බෙදන්නා ගෙන ගොස් දැමුවාක් මෙන් නිරයේ වැටෙයි.\n\n මහණෙනි, ධර්ම හතරකින් යුක්ත වූ දානයන් බෙදන්නා ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයේ වැටෙයි. කවර ධර්ම හතරකින්ද? ඔහු ඡන්දය මුල් කරගත් මාර්ගයට නොයයි, ද්වේෂය මුල් කරගත් මාර්ගයට නොයයි, මෝහය මුල් කරගත් මාර්ගයට නොයයි, භය මුල් කරගත් මාර්ගයට නොයයි. මහණෙනි, මේ ධර්ම හතරකින් යුක්ත වූ දානයන් බෙදන්නා ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයේ වැටෙයි.\n\n ගාථා කොටස \n\n යම් කිසි කෙනෙක් කාමයන්හි (ඇලීම්) අසංයත වූවාහුද, අධාර්මික වෙත්ද, අධර්මයට ගරු කරන්නෝ වෙත්ද, ඡන්දය, ද්වේෂය, මෝහය සහ භය යන මාර්ගයන්හි යන්නෝ වෙති, ඔවුන් සභාවේ කිලිටි තැනැත්තා (අපිරිසිදු පුද්ගලයා) ලෙස කියනු ලැබේ. දන්නා ශ්‍රමණයා විසින් මෙසේ දේශනා කරන ලදී. එබැවින් යම් ඒ සත්පුරුෂයෝ ධර්මයෙහි පිහිටා පාපයක් නොකෙරෙත්ද, ඡන්දයෙන්, ද්වේෂයෙන්, මෝහයෙන් සහ භයෙන් යන මාර්ගයන්හි නොයන්නෝ වෙති, ඔවුහු යහපත් පුද්ගලයන් විසින් ප්‍රශංසා කරනු ලැබිය යුත්තෝ වෙති. ඔවුන් සභාවේ ශ්‍රේෂ්ඨයා (මඩුල්ල) ලෙස කියනු ලැබේ. දන්නා ශ්‍රමණයා විසින් මෙසේ දේශනා කරන ලදී. \n\n දහවන කොටස අවසන් විය.",
      "paliTitle": "Bhattuddesakasuttaṃ",
      "englishTitle": "The Discourse on the Meal Distributor",
      "sinhalaTitle": "භත්තුද්දේසක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Caravaggo dutiyo. Tassuddānaṃ – Caraṃ sīlaṃ padhānāni, saṃvaraṃ paññatti pañcamaṃ; Sokhummaṃ tayo agatī, bhattuddesena te dasāti.",
    "english": "The Second Chapter on Conduct",
    "sinhala": "දෙවන චර වග්ගය"
  }
}