{
  "id": "an4.1",
  "title": {
    "pali": "Bhaṇḍagāmavaggo",
    "english": "The Section on Bhaṇḍagāma",
    "sinhala": "භණ්ඩගාමවර්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vajjīsu viharati bhaṇḍagāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Catunnaṃ, bhikkhave, dhammānaṃ ananubodhā appaṭivedhā evamidaṃ dīghamaddhānaṃ sandhāvitaṃ saṃsaritaṃ mamañceva tumhākañca. Katamesaṃ catunnaṃ? Ariyassa, bhikkhave, sīlassa ananubodhā appaṭivedhā evamidaṃ dīghamaddhānaṃ sandhāvitaṃ saṃsaritaṃ mamañceva tumhākañca. Ariyassa, bhikkhave, samādhissa ananubodhā appaṭivedhā evamidaṃ dīghamaddhānaṃ sandhāvitaṃ saṃsaritaṃ mamañceva tumhākañca. Ariyāya, bhikkhave, paññāya ananubodhā appaṭivedhā evamidaṃ dīghamaddhānaṃ sandhāvitaṃ saṃsaritaṃ mamañceva tumhākañca. Ariyāya, bhikkhave, vimuttiyā ananubodhā appaṭivedhā evamidaṃ dīghamaddhānaṃ sandhāvitaṃ saṃsaritaṃ mamañceva tumhākañca. Tayidaṃ, bhikkhave, ariyaṃ sīlaṃ anubuddhaṃ paṭividdhaṃ, ariyo samādhi anubuddho paṭividdho, ariyā paññā anubuddhā paṭividdhā, ariyā vimutti anubuddhā paṭividdhā, ucchinnā bhavataṇhā, khīṇā bhavanetti, natthi dāni punabbhavo’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Sīlaṃ samādhi paññā ca, vimutti ca anuttarā; Anubuddhā ime dhammā, gotamena yasassinā. ‘‘Iti buddho abhiññāya, dhammamakkhāsi bhikkhunaṃ; Dukkhassantakaro satthā, cakkhumā parinibbuto’’ti. paṭhamaṃ;",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling among the Vajjians, at Bhaṇḍagāma. There the Blessed One addressed the bhikkhus, saying, “Bhikkhus.” “Venerable Sir,” those bhikkhus replied to the Blessed One.\n\nThe Blessed One spoke thus: “It is, bhikkhus, through not comprehending, not penetrating four things that I as well as you have wandered on for such a long time, have transmigrated for such a long time. Which four? It is, bhikkhus, through not comprehending, not penetrating the noble virtue that I as well as you have wandered on for such a long time, have transmigrated for such a long time. It is, bhikkhus, through not comprehending, not penetrating the noble concentration that I as well as you have wandered on for such a long time, have transmigrated for such a long time. It is, bhikkhus, through not comprehending, not penetrating the noble wisdom that I as well as you have wandered on for such a long time, have transmigrated for such a long time. It is, bhikkhus, through not comprehending, not penetrating the noble liberation that I as well as you have wandered on for such a long time, have transmigrated for such a long time. But now, bhikkhus, because the noble virtue has been comprehended and penetrated, the noble concentration has been comprehended and penetrated, the noble wisdom has been comprehended and penetrated, and the noble liberation has been comprehended and penetrated, the craving for existence has been cut off, the conduit to renewed existence has been exhausted, and there is no longer any future becoming.”\n\nThis is what the Blessed One said. Having said this, the Fortunate One, the Teacher, said further:\n\n“Virtue, concentration, and wisdom,\nAnd unsurpassed liberation—\nThese truths were comprehended\nBy the glorious Gotama.\n\nThus, the Buddha, having directly known them,\nTaught the Dhamma to the bhikkhus.\nThe Teacher, the bringer to an end of suffering,\nThe one with vision, has attained final Nibbāna.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ වජ්ජී ජනපදයෙහි භණ්ඩගාමය නම් ගමෙහි වැඩවසන සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ ‘මහණෙනි’ යැයි භික්ෂූන් අමතා වදාළ සේක. ඒ භික්ෂූහු ‘වහන්සැ’යි භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n‘‘මහණෙනි, ධර්ම සතරක් අවබෝධ නොකළ බැවින්ද, ප්‍රත්‍යක්ෂ නොකළ බැවින්ද, මේ සසර දීර්ඝ කාලයක් මුළුල්ලේ මා විසින්ද, ඔබ විසින්ද සැරිසරා ඇත, සංසාරයේ ඉපිද ඇත.\n\nඒ සතර කුමක්ද? මහණෙනි, ආර්ය ශීලය අවබෝධ නොකළ බැවින්ද, ප්‍රත්‍යක්ෂ නොකළ බැවින්ද, මේ සසර දීර්ඝ කාලයක් මුළුල්ලේ මා විසින්ද, ඔබ විසින්ද සැරිසරා ඇත, සංසාරයේ ඉපිද ඇත. මහණෙනි, ආර්ය සමාධිය අවබෝධ නොකළ බැවින්ද, ප්‍රත්‍යක්ෂ නොකළ බැවින්ද, මේ සසර දීර්ඝ කාලයක් මුළුල්ලේ මා විසින්ද, ඔබ විසින්ද සැරිසරා ඇත, සංසාරයේ ඉපිද ඇත. මහණෙනි, ආර්ය ප්‍රඥාව අවබෝධ නොකළ බැවින්ද, ප්‍රත්‍යක්ෂ නොකළ බැවින්ද, මේ සසර දීර්ඝ කාලයක් මුළුල්ලේ මා විසින්ද, ඔබ විසින්ද සැරිසරා ඇත, සංසාරයේ ඉපිද ඇත. මහණෙනි, ආර්ය විමුක්තිය අවබෝධ නොකළ බැවින්ද, ප්‍රත්‍යක්ෂ නොකළ බැවින්ද, මේ සසර දීර්ඝ කාලයක් මුළුල්ලේ මා විසින්ද, ඔබ විසින්ද සැරිසරා ඇත, සංසාරයේ ඉපිද ඇත.\n\nමහණෙනි, එහෙයින් ආර්ය ශීලය අවබෝධ කරගන්නා ලද බැවින්ද, ප්‍රත්‍යක්ෂ කරගන්නා ලද බැවින්ද, ආර්ය සමාධිය අවබෝධ කරගන්නා ලද බැවින්ද, ප්‍රත්‍යක්ෂ කරගන්නා ලද බැවින්ද, ආර්ය ප්‍රඥාව අවබෝධ කරගන්නා ලද බැවින්ද, ප්‍රත්‍යක්ෂ කරගන්නා ලද බැවින්ද, ආර්ය විමුක්තිය අවබෝධ කරගන්නා ලද බැවින්ද, ප්‍රත්‍යක්ෂ කරගන්නා ලද බැවින්ද, භවතණ්හාව සිඳ බිඳ දමන ලදී, භවනැත්ත ක්ෂය කරන ලදී, දැන් නැවත ඉපදීමක් නැතැයි (වදාළ සේක.)’’\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙසේ වදාරා සුගත වූ ශාස්තෘන් වහන්සේ තවදුරටත් මෙය වදාළ සේක:\n\n‘‘උතුම් වූ ශීලය, සමාධිය, ප්‍රඥාව සහ විමුක්තිය,\nමේ ධර්මයන් යසස් ඇති ගෞතමයන් වහන්සේ විසින් අවබෝධ කරන ලදී.\n\nමෙසේ බුදුරජාණන් වහන්සේ අභිඥාවෙන් දැන, භික්ෂූන්ට ධර්මය දේශනා කළ සේක.\nදුක්ඛයාගේ කෙළවර කරන්නා වූ, චක්ෂුස් ඇති ඒ ශාස්තෘන් වහන්සේ පිරිනිවන් පෑ සේක.’’",
      "paliTitle": "Anubuddhasuttaṃ",
      "englishTitle": "Discourse of the Subsequently Awakened",
      "sinhalaTitle": "අනුබුද්‍ධ සූත‍්‍රය"
    },
    {
      "number": 2,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi asamannāgato ‘imasmā dhammavinayā papatito’ti vuccati. Katamehi catūhi? Ariyena, bhikkhave, sīlena asamannāgato ‘imasmā dhammavinayā papatito’ti vuccati. Ariyena, bhikkhave, samādhinā asamannāgato ‘imasmā dhammavinayā papatito’ti vuccati. Ariyāya, bhikkhave, paññāya asamannāgato ‘imasmā dhammavinayā papatito’ti vuccati. Ariyāya, bhikkhave, vimuttiyā asamannāgato ‘imasmā dhammavinayā papatito’ti vuccati. Imehi kho, bhikkhave, catūhi dhammehi asamannāgato ‘imasmā dhammavinayā papatito’ti vuccati. ‘‘Catūhi, bhikkhave, dhammehi samannāgato ‘imasmā dhammavinayā apapatito’ti [appapatitoti (ka.)] vuccati. Katamehi catūhi? Ariyena, bhikkhave, sīlena samannāgato ‘imasmā dhammavinayā apapatito’ti vuccati. Ariyena, bhikkhave, samādhinā samannāgato ‘imasmā dhammavinayā apapatito’ti vuccati. Ariyāya, bhikkhave, paññāya samannāgato ‘imasmā dhammavinayā apapatito’ti vuccati. Ariyāya, bhikkhave, vimuttiyā samannāgato ‘imasmā dhammavinayā apapatito’ti vuccati. Imehi kho, bhikkhave, catūhi dhammehi samannāgato ‘imasmā dhammavinayā apapatito’ti vuccatī’’ti. ‘‘Cutā patanti patitā, giddhā ca punarāgatā; Kataṃ kiccaṃ rataṃ rammaṃ, sukhenānvāgataṃ sukha’’ntntti. dutiyaṃ;",
      "english": "Monks, one who is not endowed with four qualities is said to have fallen from this Dhamma and Vinaya. Which four? Monks, one who is not endowed with noble virtue is said to have fallen from this Dhamma and Vinaya. Monks, one who is not endowed with noble concentration is said to have fallen from this Dhamma and Vinaya. Monks, one who is not endowed with noble wisdom is said to have fallen from this Dhamma and Vinaya. Monks, one who is not endowed with noble liberation is said to have fallen from this Dhamma and Vinaya. Indeed, monks, one who is not endowed with these four qualities is said to have fallen from this Dhamma and Vinaya.\n\nMonks, one who is endowed with four qualities is said not to have fallen from this Dhamma and Vinaya. Which four? Monks, one who is endowed with noble virtue is said not to have fallen from this Dhamma and Vinaya. Monks, one who is endowed with noble concentration is said not to have fallen from this Dhamma and Vinaya. Monks, one who is endowed with noble wisdom is said not to have fallen from this Dhamma and Vinaya. Monks, one who is endowed with noble liberation is said not to have fallen from this Dhamma and Vinaya. Indeed, monks, one who is endowed with these four qualities is said not to have fallen from this Dhamma and Vinaya.\n\nHaving fallen, they continue to fall; being greedy, they return again. The task has been accomplished, delight has been savored, and happiness is accompanied by happiness.",
      "sinhala": "භික්ෂූනි, කරුණු සතරකින් යුක්ත නොවූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී ගියෙකි’ යැයි කියනු ලැබේ. ඒ කවර සතරකින්ද? භික්ෂූනි, ආර්ය ශීලයෙන් යුක්ත නොවූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී ගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, ආර්ය සමාධියෙන් යුක්ත නොවූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී ගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, ආර්ය ප්‍රඥාවෙන් යුක්ත නොවූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී ගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, ආර්ය විමුක්තියෙන් යුක්ත නොවූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී ගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, මේ සතර ධර්මයන්ගෙන් යුක්ත නොවූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී ගියෙකි’ යැයි කියනු ලැබේ.\n\nභික්ෂූනි, කරුණු සතරකින් යුක්ත වූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී නොගියෙකි’ යැයි කියනු ලැබේ. ඒ කවර සතරකින්ද? භික්ෂූනි, ආර්ය ශීලයෙන් යුක්ත වූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී නොගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, ආර්ය සමාධියෙන් යුක්ත වූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී නොගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, ආර්ය ප්‍රඥාවෙන් යුක්ත වූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී නොගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, ආර්ය විමුක්තියෙන් යුක්ත වූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී නොගියෙකි’ යැයි කියනු ලැබේ. භික්ෂූනි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා ‘මේ ධර්මවිනයෙන් පිරිහී නොගියෙකි’ යැයි කියනු ලැබේ.\n\nපිරිහුණු අය නැවතත් පිරිහෙති. ගිජුවූවෝ නැවත නැවතත් (සංසාරයට) එති.\n(නොපිරිහුණු අය විසින්) කළ යුතු කාර්යය සම්පූර්ණ කර ඇත. ඔවුහු එහි රමණය කරති, ප්‍රීති වෙති. සැපයෙන් යුක්ත වූ උතුම් සැපයක් ඔවුන්ට අත් වේ.",
      "paliTitle": "Papatitasuttaṃ",
      "englishTitle": "Discourse on the Fallen",
      "sinhalaTitle": "පතිත සූත‍්‍රය"
    },
    {
      "number": 3,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bālo abyatto [avyatto (sī. pī.)] asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi catūhi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā appasādanīye ṭhāne pasādaṃ upadaṃseti, ananuvicca apariyogāhetvā pasādanīye ṭhāne appasādaṃ upadaṃseti – imehi kho, bhikkhave, catūhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. ‘‘Catūhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto [vyatto (sī. pī.), byatto (syā. kaṃ.)] sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi catūhi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati, anuvicca pariyogāhetvā appasādanīye ṭhāne appasādaṃ upadaṃseti, anuvicca pariyogāhetvā pasādanīye ṭhāne pasādaṃ upadaṃseti – imehi kho, bhikkhave, catūhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. [su. ni. 663; saṃ. ni. 1.180] ‘‘Yo nindiyaṃ pasaṃsati, Taṃ vā nindati yo pasaṃsiyo; Vicināti mukhena so kaliṃ, Kalinā tena sukhaṃ na vindati. [su. ni. 663; saṃ. ni. 1.180] ‘‘Appamatto ayaṃ kali, Yo akkhesu dhanaparājayo; Sabbassāpi sahāpi attanā, Ayameva mahantataro kali; Yo sugatesu manaṃ padosaye. ‘‘Sataṃ sahassānaṃ nirabbudānaṃ, Chattiṃsatī pañca ca abbudāni; Yamariyagarahī [yamariyaṃ garahīya (syā. kaṃ.)] nirayaṃ upeti, Vācaṃ manañca paṇidhāya pāpaka’’nti. tatiyaṃ;",
      "english": "Monks, an ignorant, undeveloped, ignoble person, endowed with four qualities, conducts himself in a way that harms and injures himself, is blameworthy and reproachable by the discerning, and generates much demerit. Which four? He speaks praise of one who deserves blame without thoroughly investigating and without fully examining; he speaks blame of one who deserves praise without thoroughly investigating and without fully examining; he shows approval in a situation where disapproval is appropriate without thoroughly investigating and without fully examining; he shows disapproval in a situation where approval is appropriate without thoroughly investigating and without fully examining. Monks, an ignorant, undeveloped, ignoble person, endowed with these four qualities, conducts himself in a way that harms and injures himself, is blameworthy and reproachable by the discerning, and generates much demerit.\n\nMonks, a wise, developed, noble person, endowed with four qualities, conducts himself in a way that does not harm and does not injure himself, is blameless and irreproachable by the discerning, and generates much merit. Which four? He speaks blame of one who deserves blame after thoroughly investigating and fully examining; he speaks praise of one who deserves praise after thoroughly investigating and fully examining; he shows disapproval in a situation where disapproval is appropriate after thoroughly investigating and fully examining; he shows approval in a situation where approval is appropriate after thoroughly investigating and fully examining. Monks, a wise, developed, noble person, endowed with these four qualities, conducts himself in a way that does not harm and does not injure himself, is blameless and irreproachable by the discerning, and generates much merit.\n\nWhoever praises what is blameworthy, or blames what is praiseworthy, that person gathers evil through their mouth. With that evil, they do not find happiness.\n\nSmall is this evil, the loss of wealth in gambling, even if it is a loss of all one's possessions, and even of oneself. This indeed is a much greater evil: to corrupt one's mind towards the Noble Ones.\n\nFor a hundred thousand *nirabbudas* and thirty-six *abbudas*, the one who slanders the Noble Ones goes to hell, having directed their speech and mind to evil.",
      "sinhala": "මහණෙනි, අඥාන වූ, අව්‍යක්ත වූ, අසත්පුරුෂ පුද්ගලයා කරුණු සතරකින් යුක්තව තමාට විපතක් කරගනී, විඥානවන්තයන්ට දොස් සහිත ද වේ, නින්දා ලැබීමට සුදුසු ද වේ, බොහෝ අකුසල් ද රැස්කරයි. ඒ කරුණු සතර මොනවාද? විමසා නොබලා, හොඳින් පරීක්ෂා නොකර අවර්ණනා කිරීමට සුදුසු පුද්ගලයෙකුට වර්ණනා කරයි. විමසා නොබලා, හොඳින් පරීක්ෂා නොකර වර්ණනා කිරීමට සුදුසු පුද්ගලයෙකුට අවර්ණනා කරයි. විමසා නොබලා, හොඳින් පරීක්ෂා නොකර පැහැදීමට නුසුදුසු තැනක පැහැදීම ඇතිකරයි. විමසා නොබලා, හොඳින් පරීක්ෂා නොකර පැහැදීමට සුදුසු තැනක අපැහැදීම ඇතිකරයි. මහණෙනි, මේ කරුණු සතරින් යුක්ත වූ අඥාන වූ, අව්‍යක්ත වූ, අසත්පුරුෂ පුද්ගලයා තමාට විපතක් කරගනී, විඥානවන්තයන්ට දොස් සහිත ද වේ, නින්දා ලැබීමට සුදුසු ද වේ, බොහෝ අකුසල් ද රැස්කරයි.\n\nමහණෙනි, පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා කරුණු සතරකින් යුක්තව තමාට කිසිදු හානියක්, විපතක් සිදු නොකරයි, විඥානවන්තයන්ට දොස් රහිත ද වේ, නින්දා ලැබීමට නුසුදුසු ද වේ, බොහෝ පින් ද රැස්කරයි. ඒ කරුණු සතර මොනවාද? විමසා බලා, හොඳින් පරීක්ෂා කර අවර්ණනා කිරීමට සුදුසු පුද්ගලයෙකුට අවර්ණනා කරයි. විමසා බලා, හොඳින් පරීක්ෂා කර වර්ණනා කිරීමට සුදුසු පුද්ගලයෙකුට වර්ණනා කරයි. විමසා බලා, හොඳින් පරීක්ෂා කර පැහැදීමට නුසුදුසු තැනක අපැහැදීම ඇතිකරයි. විමසා බලා, හොඳින් පරීක්ෂා කර පැහැදීමට සුදුසු තැනක පැහැදීම ඇතිකරයි. මහණෙනි, මේ කරුණු සතරින් යුක්ත වූ පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට කිසිදු හානියක්, විපතක් සිදු නොකරයි, විඥානවන්තයන්ට දොස් රහිත ද වේ, නින්දා ලැබීමට නුසුදුසු ද වේ, බොහෝ පින් ද රැස්කරයි.\n\nයමෙක් නින්දා කටයුත්තෙකුට ප්‍රශංසා කරයි ද, යමෙක් ප්‍රශංසා කටයුත්තෙකුට නින්දා කරයි ද, ඔහු තම මුවින් කලහයක් ඇතිකර ගනී. ඒ කලහය නිසා ඔහු සැපතක් නොලබයි.\n\nදූ කෙළියේ දී ධනය නැති වීම, සියල්ල සමඟ තමාට ද හානි වුවත්, මේ කලහය සුළු දෙයකි. යමෙක් සුගතයන් කෙරෙහි සිත දූෂ්‍ය කරයි නම්, මේ කලහය ඊට වඩා මහත් වූ කලහයකි.\n\nයම් පුද්ගලයෙක් පාපී වචනයෙන් හා සිතින් ආර්‍යයන්ට ගරහා, නිරබුද කල්ප ලක්ෂයක් ද, අබුද කල්ප තිස් හයක් ද, අබුද කල්ප පහක් ද යන මෙතරම් දීර්ඝ කාලයක් නිරයට පැමිණේ.",
      "paliTitle": "Paṭhamakhatasuttaṃ",
      "englishTitle": "The First Discourse on Being Damaged",
      "sinhalaTitle": "ප්‍ර‍ථම ඛත සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "‘‘Catūsu, bhikkhave, micchā paṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamesu catūsu? Mātari, bhikkhave, micchā paṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Pitari, bhikkhave, micchā paṭipajjamāno… pe… tathāgate, bhikkhave, micchā paṭipajjamāno…pe… tathāgatasāvake, bhikkhave, micchā paṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Imesu kho, bhikkhave, catūsu micchā paṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. ‘‘Catūsu, bhikkhave, sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamesu catūsu? Mātari, bhikkhave, sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Pitari, bhikkhave, sammā paṭipajjamāno…pe… tathāgate, bhikkhave, sammā paṭipajjamāno…pe… tathāgatasāvake, bhikkhave, sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Imesu kho, bhikkhave, catūsu sammā paṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. ‘‘Mātari pitari cāpi, yo micchā paṭipajjati; Tathāgate vā sambuddhe, atha vā tassa sāvake; Bahuñca so pasavati, apuññaṃ tādiso naro. ‘‘Tāya naṃ adhammacariyāya [tāya adhammacariyāya (sī. syā. kaṃ. pī.)], mātāpitūsu paṇḍitā; Idheva naṃ garahanti, peccāpāyañca gacchati. ‘‘Mātari pitari cāpi, yo sammā paṭipajjati; Tathāgate vā sambuddhe, atha vā tassa sāvake; Bahuñca so pasavati, puññaṃ etādiso [puññampi tādiso (sī. syā. kaṃ.)] naro. ‘‘Tāya naṃ dhammacariyāya, mātāpitūsu paṇḍitā; Idheva [idha ceva (sī.)] naṃ pasaṃsanti, pecca sagge pamodatī’’ti [sagge ca modatīti (sī.)]. catutthaṃ;",
      "english": "Monks, an unwise, undeveloped, ignoble person who practices wrongly in four ways brings harm and injury upon themselves, is blameworthy and censurable by the discerning, and generates much demerit. Which four? Monks, an unwise, undeveloped, ignoble person who practices wrongly towards their mother brings harm and injury upon themselves, is blameworthy and censurable by the discerning, and generates much demerit. An unwise, undeveloped, ignoble person who practices wrongly towards their father brings harm and injury upon themselves, is blameworthy and censurable by the discerning, and generates much demerit. An unwise, undeveloped, ignoble person who practices wrongly towards the Tathāgata brings harm and injury upon themselves, is blameworthy and censurable by the discerning, and generates much demerit. An unwise, undeveloped, ignoble person who practices wrongly towards a disciple of the Tathāgata brings harm and injury upon themselves, is blameworthy and censurable by the discerning, and generates much demerit. Monks, it is in these four ways that an unwise, undeveloped, ignoble person who practices wrongly brings harm and injury upon themselves, is blameworthy and censurable by the discerning, and generates much demerit.\n\nMonks, a wise, discerning, noble person who practices rightly in four ways preserves themselves unharmed and uninjured, is blameless and uncensurable by the discerning, and generates much merit. Which four? Monks, a wise, discerning, noble person who practices rightly towards their mother preserves themselves unharmed and uninjured, is blameless and uncensurable by the discerning, and generates much merit. A wise, discerning, noble person who practices rightly towards their father preserves themselves unharmed and uninjured, is blameless and uncensurable by the discerning, and generates much merit. A wise, discerning, noble person who practices rightly towards the Tathāgata preserves themselves unharmed and uninjured, is blameless and uncensurable by the discerning, and generates much merit. A wise, discerning, noble person who practices rightly towards a disciple of the Tathāgata preserves themselves unharmed and uninjured, is blameless and uncensurable by the discerning, and generates much merit. Monks, it is in these four ways that a wise, discerning, noble person who practices rightly preserves themselves unharmed and uninjured, is blameless and uncensurable by the discerning, and generates much merit.\n\nWhoever behaves wrongly towards mother or father, or towards the Fully Enlightened Tathāgata, or towards his disciples—such a person generates much demerit.\n\nFor that unrighteous conduct, the wise here in this world condemn such a person, and after death, he goes to a state of woe.\n\nWhoever behaves rightly towards mother or father, or towards the Fully Enlightened Tathāgata, or towards his disciples—such a person generates much merit.\n\nFor that righteous conduct, the wise here in this world praise such a person, and after death, he rejoices in a heavenly realm.",
      "sinhala": "භික්ෂූන් වහන්ස, කරුණු සතරක් සම්බන්ධයෙන් වැරදි ලෙස හැසිරෙන අඥාන, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම හානි කරගෙන, තමා විනාශ කරගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය හැකි, වරද පෙන්වා දිය හැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ අකුසල් රැස් කරගනී. ඒ කරුණු සතර මොනවාද?\nභික්ෂූන් වහන්ස, මව සම්බන්ධයෙන් වැරදි ලෙස හැසිරෙන අඥාන, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම හානි කරගෙන, තමා විනාශ කරගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය හැකි, වරද පෙන්වා දිය හැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ අකුසල් රැස් කරගනී. පියා සම්බන්ධයෙන් වැරදි ලෙස හැසිරෙන අඥාන, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම හානි කරගෙන, තමා විනාශ කරගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය හැකි, වරද පෙන්වා දිය හැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ අකුසල් රැස් කරගනී. තථාගතයන් වහන්සේ සම්බන්ධයෙන් වැරදි ලෙස හැසිරෙන අඥාන, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම හානි කරගෙන, තමා විනාශ කරගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය හැකි, වරද පෙන්වා දිය හැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ අකුසල් රැස් කරගනී. තථාගත ශ්‍ර‌ාවකයන් සම්බන්ධයෙන් වැරදි ලෙස හැසිරෙන අඥාන, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම හානි කරගෙන, තමා විනාශ කරගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය හැකි, වරද පෙන්වා දිය හැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ අකුසල් රැස් කරගනී. භික්ෂූන් වහන්ස, මේ සතර කරුණ සම්බන්ධයෙන් වැරදි ලෙස හැසිරෙන අඥාන, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම හානි කරගෙන, තමා විනාශ කරගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය හැකි, වරද පෙන්වා දිය හැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ අකුසල් රැස් කරගනී.\n\nභික්ෂූන් වහන්ස, කරුණු සතරක් සම්බන්ධයෙන් නිවැරදි ලෙස හැසිරෙන පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා තමාට හානි කර නොගෙන, තමා විනාශ කර නොගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය නොහැකි, වරද පෙන්වා දිය නොහැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ කුසල් රැස් කරගනී. ඒ කරුණු සතර මොනවාද?\nභික්ෂූන් වහන්ස, මව සම්බන්ධයෙන් නිවැරදි ලෙස හැසිරෙන පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා තමාට හානි කර නොගෙන, තමා විනාශ කර නොගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය නොහැකි, වරද පෙන්වා දිය නොහැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ කුසල් රැස් කරගනී. පියා සම්බන්ධයෙන් නිවැරදි ලෙස හැසිරෙන පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා තමාට හානි කර නොගෙන, තමා විනාශ කර නොගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය නොහැකි, වරද පෙන්වා දිය නොහැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ කුසල් රැස් කරගනී. තථාගතයන් වහන්සේ සම්බන්ධයෙන් නිවැරදි ලෙස හැසිරෙන පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා තමාට හානි කර නොගෙන, තමා විනාශ කර නොගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය නොහැකි, වරද පෙන්වා දිය නොහැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ කුසල් රැස් කරගනී. තථාගත ශ්‍ර‌ාවකයන් සම්බන්ධයෙන් නිවැරදි ලෙස හැසිරෙන පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා තමාට හානි කර නොගෙන, තමා විනාශ කර නොගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය නොහැකි, වරද පෙන්වා දිය නොහැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ කුසල් රැස් කරගනී. භික්ෂූන් වහන්ස, මේ සතර කරුණ සම්බන්ධයෙන් නිවැරදි ලෙස හැසිරෙන පණ්ඩිත, දක්ෂ, සත්පුරුෂ පුද්ගලයා තමාට හානි කර නොගෙන, තමා විනාශ කර නොගෙන වාසය කරයි. ඔහු නුවණැත්තන්ට දොස් පැවරිය නොහැකි, වරද පෙන්වා දිය නොහැකි පුද්ගලයෙක් ද වේ. ඔහු බොහෝ කුසල් රැස් කරගනී.\n\nයම් පුද්ගලයෙක් මවට හෝ පියාට, එසේත් නැත්නම් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේට හෝ උන්වහන්සේගේ ශ්‍ර‌ාවකයන්ට වැරදි ලෙස ක්‍ර‌ියා කරයිද, එබඳු පුද්ගලයා බොහෝ අකුසල් රැස් කරගනී.\nඒ අධර්මචාරී ක්‍ර‌ියාව නිසා, මවටත් පියාටත් වැරදි ලෙස ක්‍ර‌ියා කළ ඒ පුද්ගලයාට නුවණැත්තෝ මේ ආත්මයේදීම නින්දා කරති, මිය පරලොව ගිය පසු අපායට ද යයි.\n\nයම් පුද්ගලයෙක් මවට හෝ පියාට, එසේත් නැත්නම් සම්‍යක් සම්බුද්ධ තථාගතයන් වහන්සේට හෝ උන්වහන්සේගේ ශ්‍ර‌ාවකයන්ට නිවැරදි ලෙස ක්‍ර‌ියා කරයිද, එබඳු පුද්ගලයා බොහෝ කුසල් රැස් කරගනී.\nඒ ධර්මචාරී ක්‍ර‌ියාව නිසා, මවටත් පියාටත් නිවැරදි ලෙස ක්‍ර‌ියා කළ ඒ පුද්ගලයාට නුවණැත්තෝ මේ ආත්මයේදීම ප්‍ර‌ශංසා කරති, මිය පරලොව ගිය පසු දෙව්ලොව සතුටු වෙයි.",
      "paliTitle": "Dutiyakhatasuttaṃ",
      "englishTitle": "Second Discourse on the Damaged",
      "sinhalaTitle": "දෙවන ඛත සූත්‍රය"
    },
    {
      "number": 5,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Anusotagāmī puggalo, paṭisotagāmī puggalo, ṭhitatto puggalo, tiṇṇo pāraṅgato [pāragato (sī. syā. kaṃ.)] thale tiṭṭhati brāhmaṇo. Katamo ca, bhikkhave, anusotagāmī puggalo? Idha, bhikkhave, ekacco puggalo kāme ca paṭisevati, pāpañca kammaṃ karoti. Ayaṃ vuccati, bhikkhave, anusotagāmī puggalo. ‘‘Katamo ca, bhikkhave, paṭisotagāmī puggalo? Idha, bhikkhave, ekacco puggalo kāme ca nappaṭisevati, pāpañca kammaṃ na karoti, sahāpi dukkhena sahāpi domanassena assumukhopi rudamāno paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati. Ayaṃ vuccati, bhikkhave, paṭisotagāmī puggalo. ‘‘Katamo ca, bhikkhave, ṭhitatto puggalo? Idha, bhikkhave, ekacco puggalo pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti, tattha parinibbāyī, anāvattidhammo tasmā lokā. Ayaṃ vuccati, bhikkhave, ṭhitatto puggalo. ‘‘Katamo ca, bhikkhave, puggalo tiṇṇo pāraṅgato thale tiṭṭhati brāhmaṇo? Idha, bhikkhave, ekacco puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, bhikkhave, puggalo tiṇṇo pāraṅgato thale tiṭṭhati brāhmaṇo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. ‘‘Ye keci kāmesu asaññatā janā, Avītarāgā idha kāmabhogino; Punappunaṃ jātijarūpagāmi te [jātijarūpagāhino (sī.), jātijarūpagā hi te (syā. kaṃ.)], Taṇhādhipannā anusotagāmino. ‘‘Tasmā hi dhīro idhupaṭṭhitassatī, Kāme ca pāpe ca asevamāno; Sahāpi dukkhena jaheyya kāme, Paṭisotagāmīti tamāhu puggalaṃ. ‘‘Yo ve kilesāni pahāya pañca, Paripuṇṇasekho aparihānadhammo; Cetovasippatto samāhitindriyo, Sa ve ṭhitattoti naro pavuccati. ‘‘Paroparā yassa samecca dhammā, Vidhūpitā atthagatā na santi; Sa ve muni [sa vedagū (sī. syā. kaṃ. pī.)] vusitabrahmacariyo, Lokantagū pāragatoti vuccatī’’ti. pañcamaṃ;",
      "english": "Bhikkhus, there are these four individuals existing and found in the world. Which four? The individual who goes with the current, the individual who goes against the current, the individual whose self is established, and the brahmin who has crossed over, reached the far shore, and stands on firm ground.\n\nAnd what kind of individual, bhikkhus, is the one who goes with the current? Here, bhikkhus, a certain individual indulges in sensual pleasures and commits unwholesome deeds. This, bhikkhus, is called the individual who goes with the current.\n\nAnd what kind of individual, bhikkhus, is the one who goes against the current? Here, bhikkhus, a certain individual does not indulge in sensual pleasures and does not commit unwholesome deeds, but practices the complete and pure spiritual life even with suffering, even with sorrow, with a tearful face, weeping. This, bhikkhus, is called the individual who goes against the current.\n\nAnd what kind of individual, bhikkhus, is the one whose self is established? Here, bhikkhus, a certain individual, with the destruction of the five lower fetters, arises spontaneously, there to attain final Nibbāna, not returning from that world. This, bhikkhus, is called the individual whose self is established.\n\nAnd what kind of individual, bhikkhus, is the brahmin who has crossed over, reached the far shore, and stands on firm ground? Here, bhikkhus, a certain individual, with the destruction of the taints, by realizing it for themselves with direct knowledge, attains and abides in the taintless liberation of mind and liberation by wisdom in this very life. This, bhikkhus, is called the individual who has crossed over, reached the far shore, and stands on firm ground. These, bhikkhus, are the four individuals existing and found in the world.\n\nWhatever people are unrestrained in sensual pleasures,\nDevoid of passion here, indulging in sense desires,\nThey repeatedly go to birth and old age,\nOverwhelmed by craving, they are those who go with the current.\n\nTherefore, the wise one, with mindfulness established here,\nNot indulging in sensual pleasures and unwholesome deeds,\nShould abandon sensual pleasures even with suffering;\nThat person is called one who goes against the current.\n\nIndeed, whoever has abandoned the five defilements,\nA perfect learner, one whose nature is not to decline,\nHaving attained mastery over the mind, with faculties well-composed,\nThat person is truly called one whose self is established.\n\nFor whom all phenomena, high and low,\nHaving been comprehended, are dispelled, extinguished, and no longer exist,\nThat sage, who has completed the spiritual life,\nIs truly called one who has reached the world's end, crossed to the far shore.",
      "sinhala": "භික්‍ෂූණි, මෙලොව වෙසෙන, සිටින මේ පුද්ගලයෝ සතර දෙනෙක් වෙති. කවර සතර දෙනෙක් ද? අනුසෝතගාමී පුද්ගලයා, ප්‍රතිසෝතගාමී පුද්ගලයා, ඨිතත්ත පුද්ගලයා, සහ එතෙර වී, පරතෙරට ගොස්, වියළි බිමෙහි පිහිටා සිටින බ්‍රාහ්මණයා යි. භික්‍ෂූණි, අනුසෝතගාමී පුද්ගලයා නම් කවරෙක් ද? භික්‍ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් කාමයන් සේවනය කරයි. පව්කම් ද කරයි. භික්‍ෂූණි, මේ පුද්ගලයා අනුසෝතගාමී පුද්ගලයා යැයි කියනු ලැබේ. භික්‍ෂූණි, ප්‍රතිසෝතගාමී පුද්ගලයා නම් කවරෙක් ද? භික්‍ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් කාමයන් සේවනය නොකරයි. පව්කම් ද නොකරයි. දුකින් වුව ද, දොම්නසින් වුව ද, කඳුළු පිරුණු මුහුණින් හඬමින් වුව ද, පිරිපුන් පිරිසිදු බ්‍රහ්මචර්යාව පුරයි. භික්‍ෂූණි, මේ පුද්ගලයා ප්‍රතිසෝතගාමී පුද්ගලයා යැයි කියනු ලැබේ. භික්‍ෂූණි, ඨිතත්ත පුද්ගලයා නම් කවරෙක් ද? භික්‍ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් ඕරම්භාගීය සංයෝජන පහ ක්ෂය කිරීමෙන් ඕපපාතික ව උපදී. එතැන දී ම පිරිනිවන් පායි. ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වේ. භික්‍ෂූණි, මේ පුද්ගලයා ඨිතත්ත පුද්ගලයා යැයි කියනු ලැබේ. භික්‍ෂූණි, එතෙර වී, පරතෙරට ගොස්, වියළි බිමෙහි පිහිටා සිටින බ්‍රාහ්මණ පුද්ගලයා නම් කවරෙක් ද? භික්‍ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේ දී ම තමා විසින් ම අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරයි. භික්‍ෂූණි, මේ පුද්ගලයා එතෙර වී, පරතෙරට ගොස්, වියළි බිමෙහි පිහිටා සිටින බ්‍රාහ්මණ පුද්ගලයා යැයි කියනු ලැබේ. භික්‍ෂූණි, මෙලොව වෙසෙන, සිටින මේ පුද්ගලයෝ සතර දෙනා මෙසේ වෙති.\n\nයම් කිසිවෙක් කාමයන් කෙරෙහි අසංවර වූ, රාගයෙන් නොමිදුණු, මෙලොව කාම භෝගී වූ ජනයෝ වෙත් ද, ඔවුහු නැවත නැවතත් ඉපදීම හා ජරාවට පැමිණෙන්නෝ වෙති. තණ්හාවෙන් යටපත් වූ ඔවුහු අනුසෝතගාමීහු වෙති.\n\nඑහෙයින් ප්‍රඥාවන්තයා මෙහි (සසුනෙහි) ම පිහිටුවාගත් සිහියෙන් යුක්ත ව, කාමයන් හා පව්කම් සේවනය නොකරමින්, දුකින් වුව ද, කාමයන් හැර දමන්නේ ය. ඒ පුද්ගලයා ප්‍රතිසෝතගාමී පුද්ගලයා යැයි කියනු ලැබේ.\n\nයම් පුද්ගලයෙක් ඕරම්භාගීය ක්ලේශයන් පස ප්‍රහීණ කොට, පිරිපුන් ශෛක්ෂයෙකු වී, පිරිහීමෙන් තොර ස්වභාවයෙන් යුක්ත ව, චේතෝවසීභාවයට පැමිණ, සමාහිත ඉන්ද්‍රියයන් ඇත්තෙක් වේ ද, ඒ තැනැත්තා ඨිතත්ත පුද්ගලයා යැයි කියනු ලැබේ.\n\nයම් මුනිවරයෙකුගේ සියලු උසස් පහත් ධර්‍මයන් (ක්ලේශ ධර්‍මයන්) මුලිනුපුටා දමා, අභාවයට පත් වී, නැවත නොපවතී ද, ඒ මුනිවරයා බ්‍රහ්මචර්යාව පූරණය කළ, ලෝකාන්තයට පැමිණි, පරතෙරට ගිය තැනැත්තෙක් යැයි කියනු ලැබේ.",
      "paliTitle": "Anusotasuttaṃ",
      "englishTitle": "The Downstream Discourse",
      "sinhalaTitle": "අනුසෝත සූත්‍රය"
    },
    {
      "number": 6,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Appassuto sutena anupapanno, appassuto sutena upapanno, bahussuto sutena anupapanno, bahussuto sutena upapanno. Kathañca, bhikkhave, puggalo appassuto hoti sutena anupapanno? Idha, bhikkhave, ekaccassa puggalassa appakaṃ sutaṃ hoti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthā udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ. So tassa appakassa sutassa na atthamaññāya dhammamaññāya [na dhammamaññāya (pī. ka.)] dhammānudhammappaṭipanno hoti. Evaṃ kho, bhikkhave, puggalo appassuto hoti sutena anupapanno. ‘‘Kathañca, bhikkhave, puggalo appassuto hoti sutena upapanno? Idha, bhikkhave, ekaccassa puggalassa appakaṃ sutaṃ hoti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthā udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ. So tassa appakassa sutassa atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti. Evaṃ kho, bhikkhave, puggalo appassuto hoti sutena upapanno. ‘‘Kathañca, bhikkhave, puggalo bahussuto hoti sutena anupapanno? Idha, bhikkhave, ekaccassa puggalassa bahukaṃ sutaṃ hoti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthā udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ. So tassa bahukassa sutassa na atthamaññāya dhammamaññāya [na dhammamaññāya (pī.)] dhammānudhammappaṭipanno hoti. Evaṃ kho, bhikkhave, puggalo bahussuto hoti sutena anupapanno. ‘‘Kathañca, bhikkhave, puggalo bahussuto hoti sutena upapanno? Idha, bhikkhave, ekaccassa puggalassa bahukaṃ sutaṃ hoti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthā udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ. So tassa bahukassa sutassa atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti. Evaṃ kho, bhikkhave, puggalo bahussuto hoti sutena upapanno. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. ‘‘Appassutopi ce hoti, sīlesu asamāhito; Ubhayena naṃ garahanti, sīlato ca sutena ca. ‘‘Appassutopi ce hoti, sīlesu susamāhito; Sīlato naṃ pasaṃsanti, tassa sampajjate sutaṃ. ‘‘Bahussutopi ce hoti, sīlesu asamāhito; Sīlato naṃ garahanti, nāssa sampajjate sutaṃ. ‘‘Bahussutopi ce hoti, sīlesu susamāhito; Ubhayena naṃ pasaṃsanti, sīlato ca sutena ca. ‘‘Bahussutaṃ dhammadharaṃ, sappaññaṃ buddhasāvakaṃ; Nekkhaṃ jambonadasseva, ko taṃ ninditumarahati; Devāpi naṃ pasaṃsanti, brahmunāpi pasaṃsito’’ti. chaṭṭhaṃ;",
      "english": "There are these four individuals, monks, existing and found in the world. Which four? One who has little learning and does not live in accordance with that learning; one who has little learning and lives in accordance with that learning; one who has much learning and does not live in accordance with that learning; and one who has much learning and lives in accordance with that learning.\n\nAnd how, monks, is an individual one who has little learning and does not live in accordance with that learning? Here, monks, for a certain individual, there is little learning – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'as it was said' discourse, birth story, marvelous phenomenon, question-and-answer discourse. He, regarding that little learning, does not understand its meaning, does not understand the Dhamma, and does not practice in accordance with the Dhamma. This is how, monks, an individual is one who has little learning and does not live in accordance with that learning.\n\nAnd how, monks, is an individual one who has little learning and lives in accordance with that learning? Here, monks, for a certain individual, there is little learning – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'as it was said' discourse, birth story, marvelous phenomenon, question-and-answer discourse. He, regarding that little learning, understands its meaning, understands the Dhamma, and practices in accordance with the Dhamma. This is how, monks, an individual is one who has little learning and lives in accordance with that learning.\n\nAnd how, monks, is an individual one who has much learning and does not live in accordance with that learning? Here, monks, for a certain individual, there is much learning – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'as it was said' discourse, birth story, marvelous phenomenon, question-and-answer discourse. He, regarding that much learning, does not understand its meaning, does not understand the Dhamma, and does not practice in accordance with the Dhamma. This is how, monks, an individual is one who has much learning and does not live in accordance with that learning.\n\nAnd how, monks, is an individual one who has much learning and lives in accordance with that learning? Here, monks, for a certain individual, there is much learning – discourse, mixed prose and verse, exposition, verse, inspired utterance, 'as it was said' discourse, birth story, marvelous phenomenon, question-and-answer discourse. He, regarding that much learning, understands its meaning, understands the Dhamma, and practices in accordance with the Dhamma. This is how, monks, an individual is one who has much learning and lives in accordance with that learning.\n\nThese are the four individuals, monks, existing and found in the world.\n\nEven if one has little learning, but is not established in virtue,\nThey are blamed on both counts: for their virtue and for their learning.\n\nEven if one has little learning, but is well established in virtue,\nThey are praised for their virtue, and their learning brings fulfillment.\n\nEven if one has much learning, but is not established in virtue,\nThey are blamed for their virtue, and their learning brings no fulfillment.\n\nEven if one has much learning, and is well established in virtue,\nThey are praised on both counts: for their virtue and for their learning.\n\nA person of much learning, a holder of the Dhamma, endowed with wisdom, a disciple of the Buddha,\nLike pure Jambu-river gold, who would dare to criticize them?\nEven the devas praise them, and they are praised by Brahmā himself.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. කවරහුද ඒ සතර දෙනා? අල්පමාත්‍ර ශ්‍රවණය ඇත්තා වූත්, ශ්‍රවණයෙන් (ධර්මයට අනුව ජීවත් වීමෙන්) යුක්ත නොවූත් පුද්ගලයාය. අල්පමාත්‍ර ශ්‍රවණය ඇත්තා වූත්, ශ්‍රවණයෙන් යුක්ත වූත් පුද්ගලයාය. බහුශ්‍රැත වූත්, ශ්‍රවණයෙන් යුක්ත නොවූත් පුද්ගලයාය. බහුශ්‍රැත වූත්, ශ්‍රවණයෙන් යුක්ත වූත් පුද්ගලයාය.\n\nභික්ෂූන් වහන්ස, පුද්ගලයෙකු අල්පමාත්‍ර ශ්‍රවණය ඇත්තෙක්, ශ්‍රවණයෙන් යුක්ත නොවූවෙක් වන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහිලා යම් කිසි පුද්ගලයෙකුට අල්පමාත්‍ර වූ සූත්‍ර, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන මේ නව අංග ශාසනය ඇසීමට ලැබේ. ඔහු ඒ අල්පමාත්‍ර ධර්ම ශ්‍රවණයේ අර්ථය ද නොදැන, ධර්මය ද නොදැන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි නොපිහිටියේය. භික්ෂූන් වහන්ස, මෙසේ පුද්ගලයෙකු අල්පමාත්‍ර ශ්‍රවණය ඇත්තෙක්, ශ්‍රවණයෙන් යුක්ත නොවූවෙක් වන්නේය.\n\nභික්ෂූන් වහන්ස, පුද්ගලයෙකු අල්පමාත්‍ර ශ්‍රවණය ඇත්තෙක්, ශ්‍රවණයෙන් යුක්ත වූවෙක් වන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහිලා යම් කිසි පුද්ගලයෙකුට අල්පමාත්‍ර වූ සූත්‍ර, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන මේ නව අංග ශාසනය ඇසීමට ලැබේ. ඔහු ඒ අල්පමාත්‍ර ධර්ම ශ්‍රවණයේ අර්ථය ද දැන, ධර්මය ද දැන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටියේය. භික්ෂූන් වහන්ස, මෙසේ පුද්ගලයෙකු අල්පමාත්‍ර ශ්‍රවණය ඇත්තෙක්, ශ්‍රවණයෙන් යුක්ත වූවෙක් වන්නේය.\n\nභික්ෂූන් වහන්ස, පුද්ගලයෙකු බහුශ්‍රැත වූවෙක්, ශ්‍රවණයෙන් යුක්ත නොවූවෙක් වන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහිලා යම් කිසි පුද්ගලයෙකුට බහුල වූ සූත්‍ර, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන මේ නව අංග ශාසනය ඇසීමට ලැබේ. ඔහු ඒ බහුල ධර්ම ශ්‍රවණයේ අර්ථය ද නොදැන, ධර්මය ද නොදැන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි නොපිහිටියේය. භික්ෂූන් වහන්ස, මෙසේ පුද්ගලයෙකු බහුශ්‍රැත වූවෙක්, ශ්‍රවණයෙන් යුක්ත නොවූවෙක් වන්නේය.\n\nභික්ෂූන් වහන්ස, පුද්ගලයෙකු බහුශ්‍රැත වූවෙක්, ශ්‍රවණයෙන් යුක්ත වූවෙක් වන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහිලා යම් කිසි පුද්ගලයෙකුට බහුල වූ සූත්‍ර, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන මේ නව අංග ශාසනය ඇසීමට ලැබේ. ඔහු ඒ බහුල ධර්ම ශ්‍රවණයේ අර්ථය ද දැන, ධර්මය ද දැන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටියේය. භික්ෂූන් වහන්ස, මෙසේ පුද්ගලයෙකු බහුශ්‍රැත වූවෙක්, ශ්‍රවණයෙන් යුක්ත වූවෙක් වන්නේය. භික්ෂූන් වහන්ස, මේ පුද්ගලයෝ සතර දෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.\n\nයම් හෙයකින් පුද්ගලයෙක් අල්පමාත්‍ර ශ්‍රවණය ඇතිව සිටියි නම්, සිල්වලින් සමන්විත නොවූවෙක් නම්, ශීලයෙන් ද, ශ්‍රවණයෙන් ද යන දෙයාකාරයෙන්ම ඔහුට නින්දා කරති.\n\nයම් හෙයකින් පුද්ගලයෙක් අල්පමාත්‍ර ශ්‍රවණය ඇතිව සිටියි නම්, සිල්වලින් මැනවින් සමන්විත වූවෙක් නම්, ශීලයෙන් ඔහුට ප්‍රශංසා කරති. ඔහුගේ ශ්‍රවණය ද (බලාපොරොත්තු වූ) සාර්ථක ප්‍රතිඵල දෙන්නේය.\n\nයම් හෙයකින් පුද්ගලයෙක් බහුශ්‍රැතව සිටියි නම්, සිල්වලින් සමන්විත නොවූවෙක් නම්, ශීලයෙන් ඔහුට නින්දා කරති. ඔහුගේ ශ්‍රවණය ද සාර්ථක නොවන්නේය.\n\nයම් හෙයකින් පුද්ගලයෙක් බහුශ්‍රැතව සිටියි නම්, සිල්වලින් මැනවින් සමන්විත වූවෙක් නම්, ශීලයෙන් ද, ශ්‍රවණයෙන් ද යන දෙයාකාරයෙන්ම ඔහුට ප්‍රශංසා කරති.\n\nබහුශ්‍රැත වූ, ධර්මය දරන්නා වූ, ප්‍රඥාවන්ත වූ, බුද්ධ ශ්‍රාවකයා ජම්බුනදී රත්රන් මෙන් විශිෂ්ටය. කවරෙක් නම් ඔහුට නින්දා කිරීමට සුදුසුද? දෙවියෝ ද ඔහුට ප්‍රශංසා කරති. බ්‍රහ්මයා විසින් ද ඔහු ප්‍රශංසාවට පත් කරනු ලැබියේය.",
      "paliTitle": "Appassutasuttaṃ",
      "englishTitle": "The Discourse on Little Learning",
      "sinhalaTitle": "අල්පශ්‍රැත සූත්‍රය"
    },
    {
      "number": 7,
      "pali": "‘‘Cattārome, bhikkhave, viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā saṅghaṃ sobhenti. Katame cattāro? Bhikkhu, bhikkhave, viyatto vinīto visārado bahussuto dhammadharo dhammānudhammappaṭipanno saṅghaṃ sobheti. Bhikkhunī, bhikkhave, viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā saṅghaṃ sobheti. Upāsako, bhikkhave, viyatto vinīto visārado bahussuto dhammadharo dhammānudhammappaṭipanno saṅghaṃ sobheti. Upāsikā, bhikkhave, viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā saṅghaṃ sobheti. Ime kho, bhikkhave, cattāro viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā saṅghaṃ sobhentī’’ti. ‘‘Yo hoti viyatto [vyatto (sī. pī.), byatto (syā. kaṃ.)] ca visārado ca, Bahussuto dhammadharo ca hoti; Dhammassa hoti anudhammacārī, Sa tādiso vuccati saṅghasobhano [saṃghasobhaṇo (ka.)]. ‘‘Bhikkhu ca sīlasampanno, bhikkhunī ca bahussutā; Upāsako ca yo saddho, yā ca saddhā upāsikā; Ete kho saṅghaṃ sobhenti, ete hi saṅghasobhanā’’ti. sattamaṃ;",
      "english": "Bhikkhus, these four — accomplished, well-trained, confident, learned, bearers of the Dhamma, and those who practice the Dhamma in complete conformity with the Dhamma — adorn the Sangha. Which four?\n\nBhikkhus, a monk who is accomplished, well-trained, confident, learned, a bearer of the Dhamma, and who practices the Dhamma in complete conformity with the Dhamma, adorns the Sangha. Bhikkhus, a nun who is accomplished, well-trained, confident, learned, a bearer of the Dhamma, and who practices the Dhamma in complete conformity with the Dhamma, adorns the Sangha. Bhikkhus, a male lay follower who is accomplished, well-trained, confident, learned, a bearer of the Dhamma, and who practices the Dhamma in complete conformity with the Dhamma, adorns the Sangha. Bhikkhus, a female lay follower who is accomplished, well-trained, confident, learned, a bearer of the Dhamma, and who practices the Dhamma in complete conformity with the Dhamma, adorns the Sangha. Indeed, Bhikkhus, these four — accomplished, well-trained, confident, learned, bearers of the Dhamma, and those who practice the Dhamma in complete conformity with the Dhamma — adorn the Sangha.\n\nOne who is accomplished and confident,\nLearned and a bearer of the Dhamma,\nWho practices the Dhamma in complete conformity with the Dhamma—\nSuch a one is called an adornment of the Sangha.\n\nA monk endowed with virtue,\nAnd a nun who is learned,\nAnd a male lay follower who has faith,\nAnd a female lay follower who has faith—\nIndeed, these adorn the Sangha,\nFor they are adornments of the Sangha.",
      "sinhala": "භික්ෂූණි, මේ සතර දෙනා ප්‍ර‍වීණ වූ, විනයට අනුව හික්මුණු, නිර්භීත වූ, බහුශ‍්‍රැත වූ, ධර්‍මය දරන, ධර්‍මයට අනුලෝමව පිළිපදින අතර සංඝයා ශෝභමාන කරත්. කවර සතර දෙනෙක්ද?\n\nභික්ෂූණි, ප්‍ර‍වීණ වූ, විනයට අනුව හික්මුණු, නිර්භීත වූ, බහුශ‍්‍රැත වූ, ධර්‍මය දරන, ධර්‍මයට අනුලෝමව පිළිපදින භික්ෂුව සංඝයා ශෝභමාන කරන්නේය.\n\nභික්ෂූණි, ප්‍ර‍වීණ වූ, විනයට අනුව හික්මුණු, නිර්භීත වූ, බහුශ‍්‍රැත වූ, ධර්‍මය දරන, ධර්‍මයට අනුලෝමව පිළිපදින භික්ෂුණිය සංඝයා ශෝභමාන කරන්නීය.\n\nභික්ෂූණි, ප්‍ර‍වීණ වූ, විනයට අනුව හික්මුණු, නිර්භීත වූ, බහුශ‍්‍රැත වූ, ධර්‍මය දරන, ධර්‍මයට අනුලෝමව පිළිපදින උපාසකයා සංඝයා ශෝභමාන කරන්නේය.\n\nභික්ෂූණි, ප්‍ර‍වීණ වූ, විනයට අනුව හික්මුණු, නිර්භීත වූ, බහුශ‍්‍රැත වූ, ධර්‍මය දරන, ධර්‍මයට අනුලෝමව පිළිපදින උපාසිකාව සංඝයා ශෝභමාන කරන්නීය. භික්ෂූණි, මේ සතර දෙනා, එනම් ප්‍ර‍වීණ වූ, විනයට අනුව හික්මුණු, නිර්භීත වූ, බහුශ‍්‍රැත වූ, ධර්‍මය දරන, ධර්‍මයට අනුලෝමව පිළිපදින පුද්ගලයන් සංඝයා ශෝභමාන කරත්.\n\nයම් කෙනෙක් ප්‍ර‍වීණ ද, නිර්භීත ද, බහුශ‍්‍රැත ද, ධර්‍මය දරන්නේ ද, ධර්‍මයට අනුලෝමව පිළිපදින්නේ ද, එබඳු තැනැත්තා සංඝයාගේ ශෝභාව යැයි කියනු ලැබේ.\n\nසිල්වත් භික්ෂුව ද, බහුශ‍්‍රැත භික්ෂුණිය ද, ශ‍්‍රද්ධාවන්ත උපාසකයා ද, ශ‍්‍රද්ධාවන්ත උපාසිකාව ද, මේ අය සංඝයා ශෝභමාන කරත්. මේ අය සැබවින්ම සංඝයාගේ ශෝභාව යි.",
      "paliTitle": "Sobhanasuttaṃ",
      "englishTitle": "The Excellent Discourse",
      "sinhalaTitle": "ශෝභන සූත්‍රය"
    },
    {
      "number": 8,
      "pali": "‘‘Cattārimāni, bhikkhave, tathāgatassa vesārajjāni, yehi vesārajjehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni cattāri? ‘Sammāsambuddhassa te paṭijānato ime dhammā anabhisambuddhā’ti tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ sahadhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi. Etamahaṃ [etampahaṃ (sī. syā. kaṃ. pī.)], bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmi. ‘‘‘Khīṇāsavassa te paṭijānato ime āsavā aparikkhīṇā’ti tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ sahadhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi. Etamahaṃ, bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmi. ‘‘‘Ye kho pana te antarāyikā dhammā vuttā te paṭisevato nālaṃ antarāyāyā’ti tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ sahadhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi. Etamahaṃ, bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmi. ‘‘‘Yassa kho pana te atthāya dhammo desito so na niyyāti takkarassa sammā dukkhakkhayāyā’ti tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ sahadhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi. Etamahaṃ, bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmi. Imāni kho, bhikkhave, cattāri tathāgatassa vesārajjāni, yehi vesārajjehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. ‘‘Ye kecime vādapathā puthussitā, Yaṃ nissitā samaṇabrāhmaṇā ca; Tathāgataṃ patvā na te bhavanti, Visāradaṃ vādapathātivattaṃ [vādapathābhivattinaṃ (sī.), vādapathāti vuttaṃ (pī. ka.)]. ‘‘Yo dhammacakkaṃ abhibhuyya kevalī [kevalaṃ (syā.), kevalo (ka.)], Pavattayī sabbabhūtānukampī; Taṃ tādisaṃ devamanussaseṭṭhaṃ, Sattā namassanti bhavassa pāragu’’nti. aṭṭhamaṃ;",
      "english": "“Monks, there are these four confidences of the Tathāgata, endowed with which the Tathāgata claims the foremost position, roars a lion’s roar in assemblies, and sets rolling the supreme Wheel. What are these four?\n\n“‘While I claim to be a Perfectly Self-Awakened One, these phenomena remain unawakened by me’—that a recluse or brahmin, a god or Māra or Brahmā, or anyone else in the world would accuse me of this with sound reason, monks, I see no such ground for accusation. Seeing no such ground for accusation, monks, I dwell having attained safety, attained fearlessness, attained confidence.\n\n“‘While I claim to be one whose taints are destroyed, these taints are not destroyed’—that a recluse or brahmin, a god or Māra or Brahmā, or anyone else in the world would accuse me of this with sound reason, monks, I see no such ground for accusation. Seeing no such ground for accusation, monks, I dwell having attained safety, attained fearlessness, attained confidence.\n\n“‘The phenomena that I have declared to be obstructions are not truly obstructive to one who engages with them’—that a recluse or brahmin, a god or Māra or Brahmā, or anyone else in the world would accuse me of this with sound reason, monks, I see no such ground for accusation. Seeing no such ground for accusation, monks, I dwell having attained safety, attained fearlessness, attained confidence.\n\n“‘The Dhamma taught by me for a specific purpose does not lead the practitioner to the complete cessation of suffering’—that a recluse or brahmin, a god or Māra or Brahmā, or anyone else in the world would accuse me of this with sound reason, monks, I see no such ground for accusation. Seeing no such ground for accusation, monks, I dwell having attained safety, attained fearlessness, attained confidence.\n\n“These, monks, are the four confidences of the Tathāgata, endowed with which the Tathāgata claims the foremost position, roars a lion’s roar in assemblies, and sets rolling the supreme Wheel.”\n\nWhatever diverse paths of debate there are, upon which recluses and brahmins rely, they do not stand firm when they encounter the Tathāgata, the confident one, who has surpassed all paths of debate.\n\nHe who, having fully overpowered the Wheel of Dhamma, being complete, set it rolling out of compassion for all beings; that such a one, the foremost among devas and humans, the one who has gone to the far shore of existence, beings honor.",
      "sinhala": "මහණෙනි, තථාගතයන් වහන්සේට මේ චතුර්වේශාරද්‍යයෝ හතරක් ඇත්තාහ. යම් වේශාරද්‍යයන්ගෙන් යුක්ත වූ තථාගතයන් වහන්සේ වෘෂභ ස්ථානයට පැමිණියෙමි යි ප්‍රතිඥා කරන සේක, පිරිස් මැද සිංහනාද කරන සේක, බ්‍රහ්ම චක්‍රය පවත්වන සේක. ඒ හතර කවරේද?\n\n‘නුඹ සම්මාසම්බුද්ධයෙකැයි ප්‍රතිඥා කරද්දී, මේ ධර්මයන් නුඹ විසින් අවබෝධ කරගෙන නැතැයි’ යනුවෙන්, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ වෙනත් කිසිවෙක් හෝ ධර්මානුකූලව මට දොස් නගන්නේ ය යන නිමිත්තක්, මහණෙනි, මම නොදකිමි. මහණෙනි, මේ නිමිත්ත නොදක්නා මම, ක්ෂේමයට පත් වූයේ, අභයත්වයට පත් වූයේ, වේශාරද්‍යයට පත් වූයේ වාසය කරමි.\n\n‘නුඹ ක්ෂීණාශ්‍රවයෙකැයි ප්‍රතිඥා කරද්දී, මේ ආශ්‍රවයන් නුඹ විසින් ක්ෂය කර නොතිබෙතැයි’ යනුවෙන්, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ වෙනත් කිසිවෙක් හෝ ධර්මානුකූලව මට දොස් නගන්නේ ය යන නිමිත්තක්, මහණෙනි, මම නොදකිමි. මහණෙනි, මේ නිමිත්ත නොදක්නා මම, ක්ෂේමයට පත් වූයේ, අභයත්වයට පත් වූයේ, වේශාරද්‍යයට පත් වූයේ වාසය කරමි.\n\n‘නුඹ විසින් කියන ලද යම් අන්තරායකර ධර්ම කෙනෙක් ඇත්තාහු ද, ඒවා සේවනය කරන අයට අන්තරාය පිණිස නොපවතී යැයි’ යනුවෙන්, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ වෙනත් කිසිවෙක් හෝ ධර්මානුකූලව මට දොස් නගන්නේ ය යන නිමිත්තක්, මහණෙනි, මම නොදකිමි. මහණෙනි, මේ නිමිත්ත නොදක්නා මම, ක්ෂේමයට පත් වූයේ, අභයත්වයට පත් වූයේ, වේශාරද්‍යයට පත් වූයේ වාසය කරමි.\n\n‘නුඹ විසින් යම් කෙනෙකුගේ අර්ථය පිණිස ධර්මය දේශනා කරන ලද්දේ ද, එය එසේ පිළිපදින තැනැත්තාට දුක්ඛ ක්ෂය පිණිස නිවැරදිව පමුණුවන්නේ නැතැයි’ යනුවෙන්, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ වෙනත් කිසිවෙක් හෝ ධර්මානුකූලව මට දොස් නගන්නේ ය යන නිමිත්තක්, මහණෙනි, මම නොදකිමි. මහණෙනි, මේ නිමිත්ත නොදක්නා මම, ක්ෂේමයට පත් වූයේ, අභයත්වයට පත් වූයේ, වේශාරද්‍යයට පත් වූයේ වාසය කරමි.\n\nමහණෙනි, තථාගතයන් වහන්සේගේ මේ වේශාරද්‍යයෝ සතර දෙනා වහන්සේලා යි. යම් වේශාරද්‍යයන්ගෙන් යුක්ත වූ තථාගතයන් වහන්සේ වෘෂභ ස්ථානයට පැමිණියෙමි යි ප්‍රතිඥා කරන සේක, පිරිස් මැද සිංහනාද කරන සේක, බ්‍රහ්ම චක්‍රය පවත්වන සේක.\n\nයම් දහස් ගණන් විවිධ වූ වාද මාර්ග කෙනෙක් ඇත්තාහු ද, යම් වාද මාර්ගයන් ආශ්‍රය කරගෙන ශ්‍රමණ බ්‍රාහ්මණයෝ ද සිටිත් ද, අතිශයින් වේශාරද වූ, වාද මාර්ග ඉක්මවා ගිය තථාගතයන් වහන්සේ වෙත පැමිණ, ඒ වාද මාර්ග (තථාගතයන් වහන්සේට එරෙහි වීමට) නොහැකි වෙති.\n\nයම් බුදුරජාණන් වහන්සේ ධර්ම චක්‍රය පාලනය කරමින්, කෙලෙස් රහිත වූවාහු ද, සියලු සත්වයන් කෙරෙහි අනුකම්පාවෙන් එය පැවැත්වූ සේක් ද, එබඳු වූ දෙව් මිනිසුන්ට ශ්‍රේෂ්ඨ වූ, භවයේ එතෙරට පැමිණි ඒ උතුමාණන්ට සත්වයෝ නමස්කාර කරත්.",
      "paliTitle": "Vesārajjasuttaṃ",
      "englishTitle": "Discourse on Fearlessness",
      "sinhalaTitle": "වෙසරද සූත්‍රය"
    },
    {
      "number": 9,
      "pali": "‘‘Cattārome, bhikkhave, taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjati. Katame cattāro? Cīvarahetu vā, bhikkhave, bhikkhuno taṇhā uppajjamānā uppajjati; piṇḍapātahetu vā, bhikkhave, bhikkhuno taṇhā uppajjamānā uppajjati; senāsanahetu vā, bhikkhave, bhikkhuno taṇhā uppajjamānā uppajjati; itibhavābhavahetu vā, bhikkhave, bhikkhuno taṇhā uppajjamānā uppajjati. Ime kho, bhikkhave, cattāro taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjatī’’ti. ‘‘Taṇhā dutiyo puriso, dīghamaddhāna saṃsaraṃ; Itthabhāvaññathābhāvaṃ, saṃsāraṃ nātivattati. ‘‘Evamādīnavaṃ ñatvā, taṇhaṃ dukkhassa sambhavaṃ; Vītataṇho anādāno, sato bhikkhu paribbaje’’ti [itivu. 15, 105]. navamaṃ;",
      "english": "Monks, there are these four sources from which craving arises for a bhikkhu. Which four? Craving, monks, for a bhikkhu, arises in connection with robes; craving, monks, for a bhikkhu, arises in connection with alms food; craving, monks, for a bhikkhu, arises in connection with lodging; craving, monks, for a bhikkhu, arises in connection with this or that state of existence. These, monks, are the four sources from which craving arises for a bhikkhu.\n\nA person who is accompanied by craving wanders on for a long time through the cycle of rebirth, passing from this state of being to another, and thus does not transcend the cycle of existence.\n\nHaving thus understood the danger, that craving is the origin of suffering, a bhikkhu, free from craving and clinging, mindful, should live the holy life.",
      "sinhala": "මහණෙනි, භික්ෂුවකගේ තෘෂ්ණාව උපදින තෘෂ්ණා උත්පාද ස්ථාන සතරක් වෙති. ඒ කවර සතරක්ද? මහණෙනි, භික්ෂුවකගේ තෘෂ්ණාව සිවුරු හේතු කොටගෙන උපදින්නේය; පිණ්ඩපාතය හේතු කොටගෙන උපදින්නේය; සේනාසන හේතු කොටගෙන උපදින්නේය; භවය (පැවැත්ම) හෝ විභවය (නොපැවැත්ම) හේතු කොටගෙන උපදින්නේය. මහණෙනි, භික්ෂුවකගේ තෘෂ්ණාව උපදින තෘෂ්ණා උත්පාද ස්ථාන සතර නම් මේවාය.\n\nතෘෂ්ණාව දෙවැනියා කොටගත් පුරුෂයා (පුද්ගලයා) දිගු කලක් සසරෙහි සැරිසරන්නේය. මෙලොව මෙසේද, පරලොව එසේද වශයෙන් නොයෙක් භවයන්හි සැරිසරන ඔහු සසරින් එතෙර නොවෙයි. මේ ආකාරයට (තෘෂ්ණාවේ) ආදීනවය දැනගෙන, දුක්ඛයේ හේතුව තෘෂ්ණාව බව දැනගෙන, තෘෂ්ණා රහිතව, උපාදාන රහිතව, සිහි නුවණින් යුතුව භික්ෂුව (සසරින් එතෙර වීමට) හැසිරිය යුතුය.",
      "paliTitle": "Taṇhuppādasuttaṃ",
      "englishTitle": "The Discourse on the Arising of Craving",
      "sinhalaTitle": "තණ්හා උප්පාද සූත්‍රය"
    },
    {
      "number": 10,
      "pali": "‘‘Cattārome, bhikkhave, yogā. Katame cattāro? Kāmayogo, bhavayogo, diṭṭhiyogo, avijjāyogo. Katamo ca, bhikkhave, kāmayogo? Idha, bhikkhave, ekacco kāmānaṃ samudayañca atthaṅgamañca [atthagamañca (sī. pī.)] assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa kāmānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ appajānato [nappajānato (syā. kaṃ. ka.)] yo kāmesu kāmarāgo kāmanandī [kāmanandi (sī. syā. kaṃ.)] kāmasneho kāmamucchā kāmapipāsā kāmapariḷāho kāmajjhosānaṃ kāmataṇhā sānuseti. Ayaṃ vuccati, bhikkhave, kāmayogo. Iti kāmayogo. ‘‘Bhavayogo ca kathaṃ hoti? Idha, bhikkhave, ekacco bhavānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa bhavānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ appajānato yo bhavesu bhavarāgo bhavanandī bhavasneho bhavamucchā bhavapipāsā bhavapariḷāho bhavajjhosānaṃ bhavataṇhā sānuseti. Ayaṃ vuccati, bhikkhave, bhavayogo. Iti kāmayogo bhavayogo. ‘‘Diṭṭhiyogo ca kathaṃ hoti? Idha, bhikkhave, ekacco diṭṭhīnaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa diṭṭhīnaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ appajānato yo diṭṭhīsu diṭṭhirāgo diṭṭhinandī diṭṭhisneho diṭṭhimucchā diṭṭhipipāsā diṭṭhipariḷāho diṭṭhijjhosānaṃ [diṭṭhiajjhosānaṃ (sī. pī.)] diṭṭhitaṇhā sānuseti. Ayaṃ vuccati, bhikkhave, diṭṭhiyogo. Iti kāmayogo bhavayogo diṭṭhiyogo. ‘‘Avijjāyogo ca kathaṃ hoti? Idha, bhikkhave, ekacco channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ appajānato yā chasu phassāyatanesu avijjā aññāṇaṃ sānuseti. Ayaṃ vuccati, bhikkhave, avijjāyogo. Iti kāmayogo bhavayogo diṭṭhiyogo avijjāyogo, saṃyutto pāpakehi akusalehi dhammehi saṃkilesikehi ponobhavikehi [pono bbhavikehi (syā. ka.)] sadarehi dukkhavipākehi āyatiṃ jātijarāmaraṇikehi. Tasmā ayogakkhemīti vuccati. Ime kho, bhikkhave, cattāro yogā. ‘‘Cattārome, bhikkhave, visaṃyogā. Katame cattāro? Kāmayogavisaṃyogo, bhavayogavisaṃyogo, diṭṭhiyogavisaṃyogo, avijjāyogavisaṃyogo. Katamo ca, bhikkhave, kāmayogavisaṃyogo? Idha, bhikkhave, ekacco kāmānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti. Tassa kāmānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānato yo kāmesu kāmarāgo kāmanandī kāmasneho kāmamucchā kāmapipāsā kāmapariḷāho kāmajjhosānaṃ kāmataṇhā sā nānuseti. Ayaṃ vuccati, bhikkhave, kāmayogavisaṃyogo. Iti kāmayogavisaṃyogo. ‘‘Bhavayogavisaṃyogo ca kathaṃ hoti? Idha, bhikkhave, ekacco bhavānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti. Tassa bhavānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānato yo bhavesu bhavarāgo bhavanandī bhavasneho bhavamucchā bhavapipāsā bhavapariḷāho bhavajjhosānaṃ bhavataṇhā sā nānuseti. Ayaṃ vuccati, bhikkhave, bhavayogavisaṃyogo. Iti kāmayogavisaṃyogo bhavayogavisaṃyogo. ‘‘Diṭṭhiyogavisaṃyogo ca kathaṃ hoti? Idha, bhikkhave, ekacco diṭṭhīnaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti. Tassa diṭṭhīnaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānato yo diṭṭhīsu diṭṭhirāgo diṭṭhinandī diṭṭhisneho diṭṭhimucchā diṭṭhipipāsā diṭṭhipariḷāho diṭṭhijjhosānaṃ diṭṭhitaṇhā sā nānuseti. Ayaṃ vuccati, bhikkhave, diṭṭhiyogavisaṃyogo. Iti kāmayogavisaṃyogo bhavayogavisaṃyogo diṭṭhiyogavisaṃyogo. ‘‘Avijjāyogavisaṃyogo ca kathaṃ hoti? Idha, bhikkhave, ekacco channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti. Tassa channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānato yā chasu phassāyatanesu avijjā aññāṇaṃ sā nānuseti. Ayaṃ vuccati, bhikkhave, avijjāyogavisaṃyogo. Iti kāmayogavisaṃyogo bhavayogavisaṃyogo diṭṭhiyogavisaṃyogo avijjāyogavisaṃyogo, visaṃyutto pāpakehi akusalehi dhammehi saṃkilesikehi ponobhavikehi sadarehi dukkhavipākehi āyatiṃ jātijarāmaraṇikehi. Tasmā yogakkhemīti vuccati. Ime kho, bhikkhave, cattāro visaṃyogā’’ti. ‘‘Kāmayogena saṃyuttā, bhavayogena cūbhayaṃ; Diṭṭhiyogena saṃyuttā, avijjāya purakkhatā. ‘‘Sattā gacchanti saṃsāraṃ, jātimaraṇagāmino; Ye ca kāme pariññāya, bhavayogañca sabbaso. ‘‘Diṭṭhiyogaṃ samūhacca, avijjañca virājayaṃ; Sabbayogavisaṃyuttā, te ve yogātigā munī’’ti. dasamaṃ; ",
      "english": "Monks, there are these four bonds. Which four? The bond of sensual desire, the bond of becoming, the bond of views, and the bond of ignorance.\n\nAnd what, monks, is the bond of sensual desire? Here, monks, some individual does not understand as it actually is the origination of sensual pleasures, their passing away, their gratification, their danger, and the escape from them. For that one, not understanding as it actually is the origination of sensual pleasures, their passing away, their gratification, their danger, and the escape from them, there arises and persists a sensual passion for sensual pleasures, a delight in sensual pleasures, an attachment to sensual pleasures, an infatuation with sensual pleasures, a thirst for sensual pleasures, a feverish longing for sensual pleasures, an obsession with sensual pleasures, a craving for sensual pleasures. This, monks, is called the bond of sensual desire. Thus, the bond of sensual desire.\n\nAnd how, monks, is the bond of becoming? Here, monks, some individual does not understand as it actually is the origination of becoming, its passing away, its gratification, its danger, and the escape from it. For that one, not understanding as it actually is the origination of becoming, its passing away, its gratification, its danger, and the escape from it, there arises and persists a passion for becoming, a delight in becoming, an attachment to becoming, an infatuation with becoming, a thirst for becoming, a feverish longing for becoming, an obsession with becoming, a craving for becoming. This, monks, is called the bond of becoming. Thus, the bond of sensual desire and the bond of becoming.\n\nAnd how, monks, is the bond of views? Here, monks, some individual does not understand as it actually is the origination of views, their passing away, their gratification, their danger, and the escape from them. For that one, not understanding as it actually is the origination of views, their passing away, their gratification, their danger, and the escape from them, there arises and persists a passion for views, a delight in views, an attachment to views, an infatuation with views, a thirst for views, a feverish longing for views, an obsession with views, a craving for views. This, monks, is called the bond of views. Thus, the bond of sensual desire, the bond of becoming, and the bond of views.\n\nAnd how, monks, is the bond of ignorance? Here, monks, some individual does not understand as it actually is the origination of the six sense bases for contact, their passing away, their gratification, their danger, and the escape from them. For that one, not understanding as it actually is the origination of the six sense bases for contact, their passing away, their gratification, their danger, and the escape from them, there arises and persists ignorance and unknowing concerning the six sense bases for contact. This, monks, is called the bond of ignorance. Thus, the bond of sensual desire, the bond of becoming, the bond of views, and the bond of ignorance. One who is thus bound is yoked to evil, unwholesome states that defile, lead to renewed existence, are distressing, result in suffering, and in the future bring forth birth, aging, and death. Therefore, such a one is called 'not secure from the bond'. These, monks, are the four bonds.\n\nMonks, there are these four disentanglements. Which four? The disentanglement from the bond of sensual desire, the disentanglement from the bond of becoming, the disentanglement from the bond of views, and the disentanglement from the bond of ignorance.\n\nAnd what, monks, is the disentanglement from the bond of sensual desire? Here, monks, some individual understands as it actually is the origination of sensual pleasures, their passing away, their gratification, their danger, and the escape from them. For that one, understanding as it actually is the origination of sensual pleasures, their passing away, their gratification, their danger, and the escape from them, a sensual passion for sensual pleasures, a delight in sensual pleasures, an attachment to sensual pleasures, an infatuation with sensual pleasures, a thirst for sensual pleasures, a feverish longing for sensual pleasures, an obsession with sensual pleasures, a craving for sensual pleasures does not arise and persist. This, monks, is called the disentanglement from the bond of sensual desire. Thus, the disentanglement from the bond of sensual desire.\n\nAnd how, monks, is the disentanglement from the bond of becoming? Here, monks, some individual understands as it actually is the origination of becoming, its passing away, its gratification, its danger, and the escape from it. For that one, understanding as it actually is the origination of becoming, its passing away, its gratification, its danger, and the escape from it, a passion for becoming, a delight in becoming, an attachment to becoming, an infatuation with becoming, a thirst for becoming, a feverish longing for becoming, an obsession with becoming, a craving for becoming does not arise and persist. This, monks, is called the disentanglement from the bond of becoming. Thus, the disentanglement from the bond of sensual desire and the disentanglement from the bond of becoming.\n\nAnd how, monks, is the disentanglement from the bond of views? Here, monks, some individual understands as it actually is the origination of views, their passing away, their gratification, their danger, and the escape from them. For that one, understanding as it actually is the origination of views, their passing away, their gratification, their danger, and the escape from them, a passion for views, a delight in views, an attachment to views, an infatuation with views, a thirst for views, a feverish longing for views, an obsession with views, a craving for views does not arise and persist. This, monks, is called the disentanglement from the bond of views. Thus, the disentanglement from the bond of sensual desire, the disentanglement from the bond of becoming, and the disentanglement from the bond of views.\n\nAnd how, monks, is the disentanglement from the bond of ignorance? Here, monks, some individual understands as it actually is the origination of the six sense bases for contact, their passing away, their gratification, their danger, and the escape from them. For that one, understanding as it actually is the origination of the six sense bases for contact, their passing away, their gratification, their danger, and the escape from them, ignorance and unknowing concerning the six sense bases for contact do not arise and persist. This, monks, is called the disentanglement from the bond of ignorance.\n\nThus, one is disjoined from the yoke of sensual desire, disjoined from the yoke of becoming, disjoined from the yoke of wrong views, disjoined from the yoke of ignorance. One is utterly freed from evil, unwholesome states that defile, lead to renewed existence, are accompanied by suffering, result in pain, and lead in the future to birth, aging, and death. Therefore, one is called 'secure from yokes'. These, monks, are the four freedoms from yokes.\n\nBound by the yoke of sensual desire, and by the yoke of becoming; bound by the yoke of wrong views, led on by ignorance. Beings travel through saṃsāra, heading towards birth and death. But those who have fully comprehended sensual desires and entirely the yoke of becoming, having uprooted the yoke of wrong views and dispelled ignorance, utterly disjoined from all yokes—they are indeed the sages who have transcended all yokes.",
      "sinhala": "භික්ෂූනි, මේ යෝග හතරකි. කවරේද ඒ හතර? කාම යෝගය, භව යෝගය, දෘෂ්ටි යෝගය, අවිද්‍යා යෝගය.\n\nභික්ෂූනි, කාම යෝගය කවරේද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් කාමයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නේය. ඔහුට කාමයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නා කල්හි, යම් කාමයන් කෙරෙහි කාම රාගයක් වේ ද, කාම නන්දියක් වේ ද, කාම ස්නේහයක් වේ ද, කාම මෝහයක් වේ ද, කාම පිපාසාවක් වේ ද, කාම පරිදාහයක් වේ ද, කාම අධ්‍යෝසානයක් වේ ද, කාම තෘෂ්ණාවක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් පවතී. භික්ෂූනි, මේ කාම යෝගය යැයි කියනු ලැබේ. මෙසේ කාම යෝගය පවතී.\n\nභව යෝගය කෙසේ වේ ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් භවයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නේය. ඔහුට භවයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නා කල්හි, යම් භවයන් කෙරෙහි භව රාගයක් වේ ද, භව නන්දියක් වේ ද, භව ස්නේහයක් වේ ද, භව මෝහයක් වේ ද, භව පිපාසාවක් වේ ද, භව පරිදාහයක් වේ ද, භව අධ්‍යෝසානයක් වේ ද, භව තෘෂ්ණාවක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් පවතී. භික්ෂූනි, මේ භව යෝගය යැයි කියනු ලැබේ. මෙසේ කාම යෝගය ද, භව යෝගය ද පවතී.\n\nදෘෂ්ටි යෝගය කෙසේ වේ ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් දෘෂ්ටීන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නේය. ඔහුට දෘෂ්ටීන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නා කල්හි, යම් දෘෂ්ටීන් කෙරෙහි දෘෂ්ටි රාගයක් වේ ද, දෘෂ්ටි නන්දියක් වේ ද, දෘෂ්ටි ස්නේහයක් වේ ද, දෘෂ්ටි මෝහයක් වේ ද, දෘෂ්ටි පිපාසාවක් වේ ද, දෘෂ්ටි පරිදාහයක් වේ ද, දෘෂ්ටි අධ්‍යෝසානයක් වේ ද, දෘෂ්ටි තෘෂ්ණාවක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් පවතී. භික්ෂූනි, මේ දෘෂ්ටි යෝගය යැයි කියනු ලැබේ. මෙසේ කාම යෝගය ද, භව යෝගය ද, දෘෂ්ටි යෝගය ද පවතී.\n\nඅවිද්‍යා යෝගය කෙසේ වේ ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් සය ස්පර්ශායතන වල හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නේය. ඔහුට සය ස්පර්ශායතන වල හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදන්නා කල්හි, යම් සය ස්පර්ශායතන කෙරෙහි අවිද්‍යාවක් වේ ද, අඤ්ඤාණයක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් පවතී. භික්ෂූනි, මේ අවිද්‍යා යෝගය යැයි කියනු ලැබේ. මෙසේ කාම යෝගය ද, භව යෝගය ද, දෘෂ්ටි යෝගය ද, අවිද්‍යා යෝගය ද පවතින අතර, මේවා පව්කාර, අකුසල, කෙලෙස් සහිත, නැවත භවයට හේතු වන, දුක් සහිත, දුක් විපාක දෙන, මතු භවයේ දී ජාති, ජරා, මරණ ගෙන දෙන ධර්මයන්ගෙන් සංයුක්ත වේ. එබැවින් ඔහු අයෝගක්ෂේමී යැයි කියනු ලැබේ. භික්ෂූනි, මේ යෝග හතරයි.\n\nභික්ෂූනි, මේ විසංයෝග හතරකි. කවරේද ඒ හතර? කාම යෝග විසංයෝගය, භව යෝග විසංයෝගය, දෘෂ්ටි යෝග විසංයෝගය, අවිද්‍යා යෝග විසංයෝගය.\n\nභික්ෂූනි, කාම යෝග විසංයෝගය කවරේද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් කාමයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නේය. ඔහුට කාමයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නා කල්හි, යම් කාමයන් කෙරෙහි කාම රාගයක් වේ ද, කාම නන්දියක් වේ ද, කාම ස්නේහයක් වේ ද, කාම මෝහයක් වේ ද, කාම පිපාසාවක් වේ ද, කාම පරිදාහයක් වේ ද, කාම අධ්‍යෝසානයක් වේ ද, කාම තෘෂ්ණාවක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් නොපවතී. භික්ෂූනි, මේ කාම යෝග විසංයෝගය යැයි කියනු ලැබේ. මෙසේ කාම යෝග විසංයෝගය පවතී.\n\nභව යෝග විසංයෝගය කෙසේ වේ ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් භවයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නේය. ඔහුට භවයන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නා කල්හි, යම් භවයන් කෙරෙහි භව රාගයක් වේ ද, භව නන්දියක් වේ ද, භව ස්නේහයක් වේ ද, භව මෝහයක් වේ ද, භව පිපාසාවක් වේ ද, භව පරිදාහයක් වේ ද, භව අධ්‍යෝසානයක් වේ ද, භව තෘෂ්ණාවක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් නොපවතී. භික්ෂූනි, මේ භව යෝග විසංයෝගය යැයි කියනු ලැබේ. මෙසේ කාම යෝග විසංයෝගය ද, භව යෝග විසංයෝගය ද පවතී.\n\nදෘෂ්ටි යෝග විසංයෝගය කෙසේ වේ ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් දෘෂ්ටීන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නේය. ඔහුට දෘෂ්ටීන්ගේ හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නා කල්හි, යම් දෘෂ්ටීන් කෙරෙහි දෘෂ්ටි රාගයක් වේ ද, දෘෂ්ටි නන්දියක් වේ ද, දෘෂ්ටි ස්නේහයක් වේ ද, දෘෂ්ටි මෝහයක් වේ ද, දෘෂ්ටි පිපාසාවක් වේ ද, දෘෂ්ටි පරිදාහයක් වේ ද, දෘෂ්ටි අධ්‍යෝසානයක් වේ ද, දෘෂ්ටි තෘෂ්ණාවක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් නොපවතී. භික්ෂූනි, මේ දෘෂ්ටි යෝග විසංයෝගය යැයි කියනු ලැබේ. මෙසේ කාම යෝග විසංයෝගය ද, භව යෝග විසංයෝගය ද, දෘෂ්ටි යෝග විසංයෝගය ද පවතී.\n\nඅවිද්‍යා යෝග විසංයෝගය කෙසේ වේ ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් සය ස්පර්ශායතන වල හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නේය. ඔහුට සය ස්පර්ශායතන වල හටගැනීම ද, වැළකීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දන්නා කල්හි, යම් සය ස්පර්ශායතන කෙරෙහි අවිද්‍යාවක් වේ ද, අඤ්ඤාණයක් වේ ද, ඒ සියල්ල අනුසය වශයෙන් නොපවතී. භික්ෂූනි, මේ අවිද්‍යා යෝග විසංයෝගය යැයි කියනු ලැබේ.\n\nකාම යෝගයෙන් වෙන්වූයේය, භව යෝගයෙන් වෙන්වූයේය, දිට්ඨි යෝගයෙන් වෙන්වූයේය, අවිද‍්‍යා යෝගයෙන් වෙන්වූයේය. (එසේ වෙන්වූයේ) ක‍්ලේශ උපදවන, නැවත භවය ඇති කරන, දුක්ඛ සහගත වූ, දුක් විපාක ඇති, අනාගතයේ ජාති, ජරා, මරණ ඇති කරන පාපී අකුසල ධර්මයන්ගෙන් (ඔහු) වෙන් වූ බැවිනි. එහෙයින් ඔහු යෝගක‍්ෂේමී යයි කියනු ලැබේ. මහණෙනි, මේ සතර යෝග මුදවා හැරීම්ය.\n\nකාම යෝගයෙන්ද, භව යෝගයෙන්ද යන දෙකින්ද බැඳුනෝය. දිට්ඨි යෝගයෙන්ද බැඳුනෝය. අවිද‍්‍යාව පෙරටු කොට ගත්තෝය.\nඒ සත‍්වයෝ ජාති මරණයට යන සුලුවෝ වී සංසාරයට යති.\nයම් කෙනෙක් කාමයන් හොඳින් අවබෝධ කොට, සියලු භව යෝගයද (දැනගෙන),\nදිට්ඨි යෝගය මුලින් උදුරා දමා, අවිද‍්‍යාව දුරු කොට,\nසියලු යෝගයන්ගෙන් වෙන්වූවාහු නම්, නියත වශයෙන්ම ඔවුහු යෝගය ඉක්මවා ගිය මුනිවරු වෙති.",
      "paliTitle": "Yogasuttaṃ",
      "englishTitle": "Discourse on Yokes",
      "sinhalaTitle": "යෝග සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Bhaṇḍagāmavaggo paṭhamo. Tassuddānaṃ – Anubuddhaṃ papatitaṃ dve, khatā anusotapañcamaṃ; Appassuto ca sobhanaṃ, vesārajjaṃ taṇhāyogena te dasāti.",
    "english": "Bhaṇḍagāma Chapter One",
    "sinhala": "බණ්ඩගාම වග්ගය පළමුවන"
  }
}