{
  "id": "an4.16",
  "title": {
    "pali": "Indriyavaggo",
    "english": "The Chapter on the Faculties",
    "sinhala": "ඉන්ද්‍රිය වර්‍ගය"
  },
  "sections": [
    {
      "number": 151,
      "pali": "‘‘Cattārimāni, bhikkhave, indriyāni. Katamāni cattāri? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ – imāni kho, bhikkhave, cattāri indriyānī’’ti. Paṭhamaṃ.",
      "english": "Monks, these are the four faculties. What are these four? The faculty of conviction, the faculty of energy, the faculty of mindfulness, and the faculty of concentration – these, monks, are indeed the four faculties.",
      "sinhala": "භික්ෂූණි, මේ ඉන්ද්‍රියෝ සතර දෙනෙකි. ඒ සතර මොනවාද? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය යන මේවායි. භික්ෂූණි, මේ සතර ඉන්ද්‍රියෝ නම් මේවාමයි. මෙය පළමුවන සූත්‍රයයි.",
      "paliTitle": "Indriyasuttaṃ",
      "englishTitle": "Discourse on the Faculties",
      "sinhalaTitle": "ඉන්\\u200dද්‍රි\\u200dය සූත්‍\\u200dරය"
    },
    {
      "number": 152,
      "pali": "‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ – imāni kho, bhikkhave, cattāri balānī’’ti. Dutiyaṃ.",
      "english": "Monks, there are these four powers. Which four? The power of conviction, the power of energy, the power of mindfulness, and the power of concentration. These, Monks, are indeed the four powers.",
      "sinhala": "භික්ෂූනි, මේවා සතර බලධර්මයෝ වෙති. ඒ කවර සතරක්ද යත්: ශ්‍රද්ධා බලය, වීර්යය බලය, සති බලය, සමාධි බලය යනුයි. භික්ෂූනි, මේවා ඒ සතර බලධර්මයෝ වෙති.",
      "paliTitle": "Saddhābalasuttaṃ",
      "englishTitle": "The Discourse on the Power of Faith",
      "sinhalaTitle": "ශ්‍රද්ධාබල සූත්‍රය"
    },
    {
      "number": 153,
      "pali": "‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Paññābalaṃ, vīriyabalaṃ, anavajjabalaṃ, saṅgahabalaṃ [saṅgāhabalaṃ (sī. syā. kaṃ. pī.)] – imāni kho, bhikkhave, cattāri balānī’’ti. Tatiyaṃ.",
      "english": "Monks, these are four strengths. Which four? The strength of wisdom, the strength of energy, the strength of blamelessness, and the strength of benevolence. These, monks, are the four strengths.",
      "sinhala": "මහණෙනි, මේ බලධර්‍ම සතරක් වෙති. ඒ සතර කවරේද? ප්‍ර‌ඥා බලය, වීර්යය බලය, අනවද්‍ය බලය, සංග්‍ර‌හ බලය යන මේවායි. මහණෙනි, මේ බලධර්‍ම සතර නම් මේවාමයි.",
      "paliTitle": "Paññābalasuttaṃ",
      "englishTitle": "Discourse on the Power of Wisdom",
      "sinhalaTitle": "ප්‍රඥාබල සූත්‍රය"
    },
    {
      "number": 154,
      "pali": "‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Satibalaṃ, samādhibalaṃ, anavajjabalaṃ, saṅgahabalaṃ – imāni kho, bhikkhave, cattāri balānī’’ti. Catutthaṃ.",
      "english": "“Monks, these are four strengths. Which four? The strength of mindfulness, the strength of concentration, the strength of blamelessness, and the strength of benevolence. These indeed, monks, are the four strengths.”",
      "sinhala": "මහණෙනි, මේ බලධර්ම සතරකි. ඒ සතර කවරේද යත්: සති බලය, සමාධි බලය, අනවද්‍ය බලය, සංග්‍රහ බලය යන මේවාය. මහණෙනි, මේ බලධර්ම සතරක් වෙති.",
      "paliTitle": "Satibalasuttaṃ",
      "englishTitle": "Discourse on the Power of Mindfulness",
      "sinhalaTitle": "සතිබල සූත්‍රය"
    },
    {
      "number": 155,
      "pali": "‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Paṭisaṅkhānabalaṃ, bhāvanābalaṃ, anavajjabalaṃ, saṅgahabalaṃ – imāni kho, bhikkhave, cattāri balānī’’ti. Pañcamaṃ.",
      "english": "Monks, these are the four powers. Which four? The power of discernment, the power of development, the power of blamelessness, and the power of benevolence – these, monks, are the four powers.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ බලධර්ම සතරකි. ඒ සතර කවරේද? ප්‍රත්‍යවේක්ෂණා බලය, භාවනා බලය, අනවද්‍ය බලය, සංග්‍රහ බලය – භික්ෂූන් වහන්ස, මේ බලධර්ම සතර නම් මේවාම යි.",
      "paliTitle": "Paṭisaṅkhānabalasuttaṃ",
      "englishTitle": "Discourse on the Power of Reflection",
      "sinhalaTitle": "ප‍්‍රතිසංඛ‍්‍යාන බල සූත්‍රය"
    },
    {
      "number": 156,
      "pali": "‘‘Cattārimāni, bhikkhave, kappassa asaṅkhyeyyāni. Katamāni cattāri? Yadā, bhikkhave, kappo saṃvaṭṭati, taṃ na sukaraṃ saṅkhātuṃ – ettakāni vassānīti vā, ettakāni vassasatānīti vā, ettakāni vassasahassānīti vā, ettakāni vassasatasahassānīti vā. ‘‘Yadā, bhikkhave, kappo saṃvaṭṭo tiṭṭhati, taṃ na sukaraṃ saṅkhātuṃ – ettakāni vassānīti vā, ettakāni vassasatānīti vā, ettakāni vassasahassānīti vā, ettakāni vassasatasahassānīti vā. ‘‘Yadā, bhikkhave, kappo vivaṭṭati, taṃ na sukaraṃ saṅkhātuṃ – ettakāni vassānīti vā, ettakāni vassasatānīti vā, ettakāni vassasahassānīti vā, ettakāni vassasatasahassānīti vā. ‘‘Yadā, bhikkhave, kappo vivaṭṭo tiṭṭhati, taṃ na sukaraṃ saṅkhātuṃ – ettakāni vassānīti vā, ettakāni vassasatānīti vā, ettakāni vassasahassānīti vā, ettakāni vassasatasahassānīti vā. Imāni kho, bhikkhave, cattāri kappassa asaṅkhyeyyānī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these four incalculable stages of an eon. Which are these four?\n\nMonks, when an eon is in the process of contracting, it is not easy to calculate it as being so many years, or so many hundreds of years, or so many thousands of years, or so many hundreds of thousands of years.\n\nMonks, when an eon has contracted and remains in that state, it is not easy to calculate it as being so many years, or so many hundreds of years, or so many thousands of years, or so many hundreds of thousands of years.\n\nMonks, when an eon is in the process of expanding, it is not easy to calculate it as being so many years, or so many hundreds of years, or so many thousands of years, or so many hundreds of thousands of years.\n\nMonks, when an eon has expanded and remains in that state, it is not easy to calculate it as being so many years, or so many hundreds of years, or so many thousands of years, or so many hundreds of thousands of years. Indeed, monks, these are the four incalculable stages of an eon.",
      "sinhala": "භික්ෂූන් වහන්ස, කල්පයේ මේ අසංඛ්‍යෙය සතරක් ඇත.\n\nඒ කවර සතරක්ද? භික්ෂූන් වහන්ස, යම් කලෙක කල්පය සංවට්‍ටනය වන්නේද, එතරම් වසර ගණනක් යැයි හෝ, එතරම් වසර සිය ගණනක් යැයි හෝ, එතරම් වසර දහස් ගණනක් යැයි හෝ, එතරම් වසර ලක්ෂ ගණනක් යැයි හෝ ගණනය කිරීම පහසු නොවන්නේය.\n\nභික්ෂූන් වහන්ස, යම් කලෙක කල්පය සංවට්‍ටව පවතින්නේද, එතරම් වසර ගණනක් යැයි හෝ, එතරම් වසර සිය ගණනක් යැයි හෝ, එතරම් වසර දහස් ගණනක් යැයි හෝ, එතරම් වසර ලක්ෂ ගණනක් යැයි හෝ ගණනය කිරීම පහසු නොවන්නේය.\n\nභික්ෂූන් වහන්ස, යම් කලෙක කල්පය විවට්‍ටනය වන්නේද, එතරම් වසර ගණනක් යැයි හෝ, එතරම් වසර සිය ගණනක් යැයි හෝ, එතරම් වසර දහස් ගණනක් යැයි හෝ, එතරම් වසර ලක්ෂ ගණනක් යැයි හෝ ගණනය කිරීම පහසු නොවන්නේය.\n\nභික්ෂූන් වහන්ස, යම් කලෙක කල්පය විවට්‍ටව පවතින්නේද, එතරම් වසර ගණනක් යැයි හෝ, එතරම් වසර සිය ගණනක් යැයි හෝ, එතරම් වසර දහස් ගණනක් යැයි හෝ, එතරම් වසර ලක්ෂ ගණනක් යැයි හෝ ගණනය කිරීම පහසු නොවන්නේය.\n\nභික්ෂූන් වහන්ස, කල්පයේ මේ අසංඛ්‍යෙය සතර මේවා වන්නේය.",
      "paliTitle": "Kappasuttaṃ",
      "englishTitle": "The Eon Sutta",
      "sinhalaTitle": "කල්ප සූත්‍රය"
    },
    {
      "number": 157,
      "pali": "‘‘Dveme, bhikkhave, rogā. Katame dve? Kāyiko ca rogo cetasiko ca rogo. Dissanti, bhikkhave, sattā kāyikena rogena ekampi vassaṃ ārogyaṃ paṭijānamānā, dvepi vassāni ārogyaṃ paṭijānamānā, tīṇipi vassāni ārogyaṃ paṭijānamānā, cattāripi vassāni ārogyaṃ paṭijānamānā, pañcapi vassāni ārogyaṃ paṭijānamānā, dasapi vassāni ārogyaṃ paṭijānamānā, vīsatipi vassāni ārogyaṃ paṭijānamānā, tiṃsampi vassāni ārogyaṃ paṭijānamānā, cattārīsampi vassāni ārogyaṃ paṭijānamānā, paññāsampi vassāni ārogyaṃ paṭijānamānā, vassasatampi, bhiyyopi ārogyaṃ paṭijānamānā. Te, bhikkhave, sattā sudullabhā [dullabhā (sī. syā. kaṃ. pī.)] lokasmiṃ ye cetasikena rogena muhuttampi ārogyaṃ paṭijānanti, aññatra khīṇāsavehi. ‘‘Cattārome, bhikkhave, pabbajitassa rogā. Katame cattāro? Idha, bhikkhave, bhikkhu mahiccho hoti vighātavā asantuṭṭho itarītaracīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. So mahiccho samāno vighātavā asantuṭṭho itarītaracīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena pāpikaṃ icchaṃ paṇidahati anavaññappaṭilābhāya lābhasakkārasilokappaṭilābhāya. So uṭṭhahati ghaṭati vāyamati anavaññappaṭilābhāya lābhasakkārasilokappaṭilābhāya. So saṅkhāya kulāni upasaṅkamati, saṅkhāya nisīdati, saṅkhāya dhammaṃ bhāsati, saṅkhāya uccārapassāvaṃ sandhāreti. Ime kho, bhikkhave, cattāro pabbajitassa rogā. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘na mahicchā bhavissāma vighātavanto asantuṭṭhā itarītaracīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena, na pāpikaṃ icchaṃ paṇidahissāma anavaññappaṭilābhāya lābhasakkārasilokappaṭilābhāya, na uṭṭhahissāma na ghaṭessāma na vāyamissāma anavaññappaṭilābhāya lābhasakkārasilokappaṭilābhāya, khamā bhavissāma sītassa uṇhassa jighacchāya pipāsāya ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātikā bhavissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ.",
      "english": "Monks, there are these two diseases. Which two? Bodily disease and mental disease.\n\nMonks, there are beings who can be found claiming to be free from bodily disease for one year, for two years, for three years, for four years, for five years, for ten years, for twenty years, for thirty years, for forty years, for fifty years, for a hundred years, or even longer. But, Monks, those beings are extremely rare in the world who claim to be free from mental disease even for a moment, apart from those whose defilements are destroyed.\n\nMonks, there are these four diseases for one who has gone forth. Which four? Here, Monks, a monk is of great desires, vexatious, and discontent with whatever robes, alms-food, lodgings, and medicinal requisites for the sick he obtains. Being of great desires, vexatious, and discontent with whatever robes, alms-food, lodgings, and medicinal requisites for the sick he obtains, he entertains evil wishes for the acquisition of undiminished gain, honor, and renown. He arises, strives, and exerts himself for the acquisition of undiminished gain, honor, and renown. He visits families with a specific calculation, he sits down with a specific calculation, he speaks the Dhamma with a specific calculation, and he even retains his urine and feces with a specific calculation. These, Monks, are the four diseases of one who has gone forth.\n\nTherefore, Monks, you should train yourselves thus: 'We will not be of great desires, vexatious, or discontent with whatever robes, alms-food, lodgings, and medicinal requisites for the sick we obtain. We will not entertain evil wishes for the acquisition of undiminished gain, honor, and renown. We will not arise, strive, or exert ourselves for the acquisition of undiminished gain, honor, and renown. We will be patient with cold, heat, hunger, thirst, the touch of gadflies, mosquitoes, wind, sun, and creeping things; with ill-spoken and unwelcome words. And we will be of such a nature as to endure arisen bodily feelings that are painful, sharp, severe, acute, disagreeable, unpleasant, and life-threatening.' This is how you should train yourselves, Monks.",
      "sinhala": "මහණෙනි, මේ රෝග දෙකකි. ඒ දෙක කවරේද? කායික රෝගය සහ මානසික රෝගයයි. මහණෙනි, කායික රෝගයකින් එක් වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, දෙවසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, තෙවසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, සිව් වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, පස් වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, දස වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, විසි වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, තිස් වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, සතළිස් වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, පනස් වසරක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, අවුරුදු සියයක් නිරෝගී බව ප‍්‍ර‍කාශ කරන, ඊටත් වැඩි කාලයක් නිරෝගී බව ප‍්‍ර‍කාශ කරන සත්ත්වයන් දක්නට ලැබේ. මහණෙනි, යම් සත්ත්ව‍යෝ මානසික රෝගයකින් මුහූර්තයක් හෝ නිරෝගී බව ප‍්‍ර‍කාශ කරත්ද, එබඳු සත්ත්ව‍යෝ ලෝකයෙහි අතිශයින් දුර්‍ලභයහ. කෙලෙස් ක්‍ෂය කළ ආර්‍යයන් වහන්සේලා හැර අන් කිසිවෙක් එසේ (මානසික රෝගයකින්) මොහොතක් හෝ නිරෝගී බව ප‍්‍ර‍කාශ නොකරති.\n\nමහණෙනි, පැවිද්දාට මේ රෝග සතරකි. ඒ සතර කවරේද? මහණෙනි, මෙහිලා භික්‍ෂුව මහේච්ඡ (මහත් ආශා ඇති) වෙයි, පීඩා ඇතිව වාසය කරයි, ලැබෙන සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිබඳව නොසතුටු වෙයි. මහේච්ඡ වූ ඔහු, පීඩාවෙන් යුක්තව, ලැබෙන සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිබඳව නොසතුටු වෙමින්, අන්‍යයන්ගේ අවඥාවෙන් තොරවීමටත්, ලාභ සත්කාර කීර්ති ප්‍ර‍ශංසා ලැබීමටත් පාපී ආශාවන් ඇතිකර ගනී. ඔහු අන්‍යයන්ගේ අවඥාවෙන් තොරවීමටත්, ලාභ සත්කාර කීර්ති ප්‍ර‍ශංසා ලැබීමටත් උත්සාහ කරයි, වෙහෙසෙයි, වෑයම් කරයි. ඔහු හොඳින් කල්පනා කර ගෘහස්ථ‍යන් වෙත එළඹෙයි, හොඳින් කල්පනා කර හිඳගනියි, හොඳින් කල්පනා කර ධර්‍මය දේශනා කරයි, හොඳින් කල්පනා කර මලමුත්‍රා පිටකිරීම පවා පාලනය කරයි. මහණෙනි, මේවා පැවිද්දාගේ රෝග සතරයි.\n\nඑබැවින් මහණෙනි, මෙසේ හික්මිය යුතු යි – 'අපි මහේච්ඡ (මහත් ආශා ඇති) නොවෙමු, පීඩාවෙන් යුක්ත නොවෙමු, ලැබෙන සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිබඳව නොසතුටු නොවෙමු. අන්‍යයන්ගේ අවඥාවෙන් තොරවීමටත්, ලාභ සත්කාර කීර්ති ප්‍ර‍ශංසා ලැබීමටත් පාපී ආශාවන් ඇතිකර නොගනිමු. අන්‍යයන්ගේ අවඥාවෙන් තොරවීමටත්, ලාභ සත්කාර කීර්ති ප්‍ර‍ශංසා ලැබීමටත් උත්සාහ නොකරමු, වෙහෙස නොගනිමු, වෑයම් නොකරමු. සීතල, උණුසුම, බඩගින්න, පිපාසය, මැසි-මදුරු, සුළං, අව්ව, සර්‍පයන්ගේ ස්පර්‍ශයන්ටත්, නොමනා ලෙස කියන ලද, නොමනා ලෙස පැමිණෙන වචනවලටත්, ඇතිවන ශාරීරික වේදනාවන්ටත්, දුක් සහිත වූ, තියුණු වූ, රළු වූ, කටුක වූ, අප්‍රිය වූ, නොමනා වූ, ප්‍ර‍ාණඝාතක වූ (ජීවිතය නසන්නාක් බඳු වූ) ඒවා ඉවසා දරා සිටිනසුලු වන්නෙමු.' මහණෙනි, නුඹලා මෙසේම හික්මිය යුතු යි.",
      "paliTitle": "Rogasuttaṃ",
      "englishTitle": "Discourse on Sickness",
      "sinhalaTitle": "රෝග සූත්‍රය"
    },
    {
      "number": 158,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā cattāro dhamme attani samanupassati, niṭṭhamettha gantabbaṃ – ‘parihāyāmi kusalehi dhammehi’. Parihānametaṃ vuttaṃ bhagavatā. Katame cattāro? Rāgavepullattaṃ [rāgavepullataṃ (sī. syā. kaṃ. pī.)], dosavepullattaṃ, mohavepullattaṃ, gambhīresu kho panassa ṭhānāṭhānesu paññācakkhu na kamati. Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā ime cattāro dhamme attani samanupassati, niṭṭhamettha gantabbaṃ – ‘parihāyāmi kusalehi dhammehi’. Parihānametaṃ vuttaṃ bhagavatā. ‘‘Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā cattāro dhamme attani samanupassati, niṭṭhamettha gantabbaṃ – ‘na parihāyāmi kusalehi dhammehi’. Aparihānametaṃ vuttaṃ bhagavatā. Katame cattāro? Rāgatanuttaṃ [rāgatanuttanaṃ (ka.)], dosatanuttaṃ, mohatanuttaṃ, gambhīresu kho panassa ṭhānāṭhānesu paññācakkhu kamati. Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā ime cattāro dhamme attani samanupassati, niṭṭhamettha gantabbaṃ – ‘na parihāyāmi kusalehi dhammehi’. Aparihānametaṃ vuttaṃ bhagavatā’’ti. Aṭṭhamaṃ.",
      "english": "Then, indeed, the venerable Sāriputta addressed the bhikkhus, saying, \"Friends, bhikkhus!\" \"Friend!\" replied those bhikkhus to the venerable Sāriputta. The venerable Sāriputta said this:\n\n\"Indeed, any bhikkhu or bhikkhunī, friends, who perceives four qualities within themselves, should come to the certain conclusion: 'I am declining in wholesome qualities.' This is what the Blessed One declared to be a decline. Which four? The abundant proliferation of lust, the abundant proliferation of aversion, the abundant proliferation of delusion, and moreover, their eye of wisdom does not penetrate into profound matters concerning what is possible and what is not possible. Indeed, any bhikkhu or bhikkhunī, friends, who perceives these four qualities within themselves, should come to the certain conclusion: 'I am declining in wholesome qualities.' This is what the Blessed One declared to be a decline.\n\n\"Indeed, any bhikkhu or bhikkhunī, friends, who perceives four qualities within themselves, should come to the certain conclusion: 'I am not declining in wholesome qualities.' This is what the Blessed One declared to be no decline. Which four? The attenuation of lust, the attenuation of aversion, the attenuation of delusion, and moreover, their eye of wisdom penetrates into profound matters concerning what is possible and what is not possible. Indeed, any bhikkhu or bhikkhunī, friends, who perceives these four qualities within themselves, should come to the certain conclusion: 'I am not declining in wholesome qualities.' This is what the Blessed One declared to be no decline.\"",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා \"ඇවැත්නි භික්ෂූනි\" යැයි වදාළ සේක. \"ඇවැත්නි\" යැයි ඒ භික්ෂූහු ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: \"ඇවැත්නි, යම් කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ තමන් තුළ සතර ධර්මයක් විමසා බලන්නේ නම්, 'මම කුසල ධර්මයන්ගෙන් පිරිහී යමි' යැයි මෙහිදී නිශ්චිත වශයෙන්ම අවබෝධ කරගත යුතුය. භාග්‍යවතුන් වහන්සේ විසින් මෙය පිරිහීමක් ලෙස වදාරන ලදී. ඒ සතර කවරේද? රාගය ඉතිරී යාම, ද්වේෂය ඉතිරී යාම, මෝහය ඉතිරී යාම, තවද ගැඹුරු වූ හේතුඵල ධර්මයන්හි ඔහුගේ ප්‍රඥාචක්ෂුව නොගමන් කිරීමයි. ඇවැත්නි, යම් කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ තමන් තුළ මේ සතර ධර්මය විමසා බලන්නේ නම්, 'මම කුසල ධර්මයන්ගෙන් පිරිහී යමි' යැයි මෙහිදී නිශ්චිත වශයෙන්ම අවබෝධ කරගත යුතුය. භාග්‍යවතුන් වහන්සේ විසින් මෙය පිරිහීමක් ලෙස වදාරන ලදී.\n\nඇවැත්නි, යම් කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ තමන් තුළ සතර ධර්මයක් විමසා බලන්නේ නම්, 'මම කුසල ධර්මයන්ගෙන් පිරිහී නොයමි' යැයි මෙහිදී නිශ්චිත වශයෙන්ම අවබෝධ කරගත යුතුය. භාග්‍යවතුන් වහන්සේ විසින් මෙය නොපිරිහීමක් ලෙස වදාරන ලදී. ඒ සතර කවරේද? රාගය සිහින් වීම, ද්වේෂය සිහින් වීම, මෝහය සිහින් වීම, තවද ගැඹුරු වූ හේතුඵල ධර්මයන්හි ඔහුගේ ප්‍රඥාචක්ෂුව ගමන් කිරීමයි. ඇවැත්නි, යම් කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ තමන් තුළ මේ සතර ධර්මය විමසා බලන්නේ නම්, 'මම කුසල ධර්මයන්ගෙන් පිරිහී නොයමි' යැයි මෙහිදී නිශ්චිත වශයෙන්ම අවබෝධ කරගත යුතුය. භාග්‍යවතුන් වහන්සේ විසින් මෙය නොපිරිහීමක් ලෙස වදාරන ලදී.\"",
      "paliTitle": "Parihānisuttaṃ",
      "englishTitle": "Discourse on Decline",
      "sinhalaTitle": "පරිහානි සූත්‍රය"
    },
    {
      "number": 159,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho aññatarā bhikkhunī aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa, yenayyo ānando tenupasaṅkama; upasaṅkamitvā mama vacanena ayyassa ānandassa pāde sirasā vanda – ‘itthannāmā, bhante, bhikkhunī ābādhikinī dukkhitā bāḷhagilānā. Sā ayyassa ānandassa pāde sirasā vandatī’ti. Evañca vadehi – ‘sādhu kira, bhante, ayyo ānando yena bhikkhunupassayo yena sā bhikkhunī tenupasaṅkamatu anukampaṃ upādāyā’’’ti. ‘‘Evaṃ, ayye’’ti kho so puriso tassā bhikkhuniyā paṭissutvā yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so puriso āyasmantaṃ ānandaṃ etadavoca – ‘‘Itthannāmā, bhante, bhikkhunī ābādhikinī dukkhitā bāḷhagilānā. Sā āyasmato ānandassa pāde sirasā vandati, evañca vadeti – ‘sādhu kira, bhante, āyasmā ānando yena bhikkhunupassayo yena sā bhikkhunī tenupasaṅkamatu anukampaṃ upādāyā’’’ti. Adhivāsesi kho āyasmā ānando tuṇhībhāvena. Atha kho āyasmā ānando nivāsetvā pattacīvaramādāya yena bhikkhunupassayo yena sā bhikkhunī tenupasaṅkami. Addasā kho sā bhikkhunī āyasmantaṃ ānandaṃ dūratova āgacchantaṃ. Disvā sasīsaṃ pārupitvā mañcake nipajji. Atha kho āyasmā ānando yena sā bhikkhunī tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho āyasmā ānando taṃ bhikkhuniṃ etadavoca – ‘‘Āhārasambhūto ayaṃ, bhagini, kāyo āhāraṃ nissāya. Āhāro pahātabbo. Taṇhāsambhūto ayaṃ, bhagini, kāyo taṇhaṃ nissāya. Taṇhā pahātabbā. Mānasambhūto ayaṃ, bhagini, kāyo mānaṃ nissāya. Māno pahātabbo. Methunasambhūto ayaṃ, bhagini, kāyo. Methune ca setughāto vutto bhagavatā. ‘‘‘Āhārasambhūto ayaṃ, bhagini, kāyo āhāraṃ nissāya. Āhāro pahātabbo’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhagini, bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya. Iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi. Yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. So aparena samayena āhāraṃ nissāya āhāraṃ pajahati. ‘Āhārasambhūto ayaṃ, bhagini, kāyo āhāraṃ nissāya. Āhāro pahātabbo’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Taṇhāsambhūto ayaṃ, bhagini, kāyo taṇhaṃ nissāya. Taṇhā pahātabbā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhagini, bhikkhu suṇāti – ‘itthannāmo kira bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissāmī’ti! So aparena samayena taṇhaṃ nissāya taṇhaṃ pajahati. ‘Taṇhāsambhūto ayaṃ, bhagini, kāyo taṇhaṃ nissāya. Taṇhā pahātabbā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Mānasambhūto ayaṃ, bhagini, kāyo mānaṃ nissāya. Māno pahātabbo’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhagini, bhikkhu suṇāti – ‘itthannāmo kira bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa evaṃ hoti – ‘so hi nāma āyasmā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati; kimaṅgaṃ [kimaṅga (sī. pī.) a. ni. 5.180; cūḷava. 331; saṃ. ni. 5.1020] panāha’nti! So aparena samayena mānaṃ nissāya mānaṃ pajahati. ‘Mānasambhūto ayaṃ, bhagini, kāyo mānaṃ nissāya. Māno pahātabbo’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Methunasambhūto ayaṃ, bhagini, kāyo. Methune ca setughāto vutto bhagavatā’’ti. Atha kho sā bhikkhunī mañcakā vuṭṭhahitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā āyasmato ānandassa pādesu sirasā nipatitvā āyasmantaṃ ānandaṃ etadavoca – ‘‘accayo maṃ, bhante, accagamā, yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yāhaṃ evamakāsiṃ. Tassā me, bhante, ayyo ānando accayaṃ accayato paṭiggaṇhātu, āyatiṃ saṃvarāyā’’ti. ‘‘Taggha taṃ [taggha tvaṃ (sī. pī. ka.)], bhagini, accayo accagamā, yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yā tvaṃ evamakāsi. Yato ca kho tvaṃ, bhagini, accayaṃ accayato disvā yathādhammaṃ paṭikarosi, taṃ te mayaṃ paṭiggaṇhāma. Vuddhi hesā, bhagini, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiṃ saṃvaraṃ āpajjatī’’ti. Navamaṃ.",
      "english": "Thus have I heard. On one occasion, the Venerable Ananda was staying at Ghosita's Monastery in Kosambi. Then a certain bhikkhuni addressed a certain man, saying: \"Come, good man, go to the Venerable Ananda. Having approached him, bow your head at the feet of the Venerable Ananda on my behalf, saying: 'Venerable sir, a bhikkhuni named so-and-so is sick, suffering, gravely ill. She bows her head at the feet of the Venerable Ananda.' And also say this: 'It would be good, Venerable sir, if the Venerable Ananda would approach the bhikkhunis' dwelling, where that bhikkhuni is, out of compassion.'\" \"Yes, reverend lady,\" the man replied to that bhikkhuni. Then he went to the Venerable Ananda, and having approached him, he paid homage to the Venerable Ananda and sat down to one side. Sitting to one side, the man said to the Venerable Ananda: \"Venerable sir, a bhikkhuni named so-and-so is sick, suffering, gravely ill. She bows her head at the feet of the Venerable Ananda, and also says this: 'It would be good, Venerable sir, if the Venerable Ananda would approach the bhikkhunis' dwelling, where that bhikkhuni is, out of compassion.'\" The Venerable Ananda consented by remaining silent. Then, having dressed and taking his bowl and robe, the Venerable Ananda went to the bhikkhunis' dwelling, where that bhikkhuni was. That bhikkhuni saw the Venerable Ananda coming from afar. Having seen him, she covered her head and lay down on her couch. Then the Venerable Ananda went to where that bhikkhuni was, and having approached her, sat down on the seat prepared for him.\n\nHaving sat down, the Venerable Ananda said to that bhikkhuni: \"Sister, this body is born of food, dependent on food. Food is to be abandoned. This body, sister, is born of craving, dependent on craving. Craving is to be abandoned. This body, sister, is born of conceit, dependent on conceit. Conceit is to be abandoned. This body, sister, is born of sexual intercourse. And the Blessed One has declared the destruction of the bridge in sexual intercourse.\"\n\n\"'This body, sister, is born of food, dependent on food. Food is to be abandoned' – thus it has been said. And what was this said in reference to? Here, sister, a monk, reflecting carefully, eats food not for sport, not for intoxication, not for adornment, not for beautification, but only for the maintenance and sustenance of this body, for the cessation of harm, and for the support of the holy life. He reflects: 'Thus I shall put an end to old feelings and not arouse new feelings. And there will be for me sustenance, blamelessness, and a comfortable abiding.' Later, by means of food, he abandons food. 'This body, sister, is born of food, dependent on food. Food is to be abandoned' – what was said, was said in reference to this.\"\n\n\"'This body, sister, is born of craving, dependent on craving. Craving is to be abandoned' – thus it has been said. And what was this said in reference to? Here, sister, a monk hears: 'It is said that a certain monk, with the destruction of the intoxicants, has realized for himself, in this very life, the Stainless Liberation of mind and Liberation by wisdom, having directly known and entered upon it, and he dwells therein.' Then he thinks: 'When will I too, with the destruction of the intoxicants, realize for myself, in this very life, the Stainless Liberation of mind and Liberation by wisdom, having directly known and entered upon it, and dwell therein!' Later, by means of craving, he abandons craving. 'This body, sister, is born of craving, dependent on craving. Craving is to be abandoned' – what was said, was said in reference to this.\"\n\n\"'This body, sister, is born of conceit, dependent on conceit. Conceit is to be abandoned' – thus it has been said. And what was this said in reference to? Here, sister, a monk hears: 'It is said that a certain monk, with the destruction of the intoxicants, has realized for himself, in this very life, the Stainless Liberation of mind and Liberation by wisdom, having directly known and entered upon it, and he dwells therein.' Then he thinks: 'If that venerable one, with the destruction of the intoxicants, can realize for himself, in this very life, the Stainless Liberation of mind and Liberation by wisdom, having directly known and entered upon it, and dwell therein, then why not I!' Later, by means of conceit, he abandons conceit. 'This body, sister, is born of conceit, dependent on conceit. Conceit is to be abandoned' – what was said, was said in reference to this.\"\n\n\"This body, sister, is born of sexual intercourse. And the Blessed One has declared the destruction of the bridge in sexual intercourse.\"\n\nThen that bhikkhuni rose from her couch, arranged her upper robe over one shoulder, prostrated herself with her head at the feet of the Venerable Ananda, and said to the Venerable Ananda: \"Venerable sir, a transgression has overcome me, as foolish, as confused, as unskillful as I was, in that I acted thus. Venerable sir, may the Venerable Ananda accept this transgression of mine as a transgression, so that I may restrain myself in the future.\" \"Indeed, sister, a transgression has overcome you, as foolish, as confused, as unskillful as you were, in that you acted thus. But since you, sister, seeing your transgression as a transgression, make amends in accordance with the Dhamma, we accept your transgression. For it is a growth in the Noble Discipline when one sees a transgression as a transgression, makes amends in accordance with the Dhamma, and restrains oneself in the future.”\n\nSister, a transgression has indeed occurred—foolishly, ignorantly, and unskillfully—in that you acted thus. But since you, sister, having seen the transgression as a transgression, make amends in accordance with the Dhamma, we accept your rectification. Indeed, sister, this is progress in the Noble Discipline: for whoever, having seen a transgression as a transgression, makes amends in accordance with the Dhamma, undertakes future restraint.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයකදී ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කෝසම්බි නුවර ඝෝසිතාරාමයේ වැඩසිටියාහ. එකල්හි එක්තරා භික්ෂුණියක් එක්තරා පුරුෂයෙකු අමතා මෙසේ කීවාය: “එම්බා පුරුෂය, නුඹ වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට යනු මැනවි. ගොස් මාගේ වචනයෙන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේගේ දෙපා හිසින් වඳිනු මැනවි. ‘ස්වාමීනි, අසවල් නම් භික්ෂුණිය ආබාධිතය. දුකට පත්ව සිටින්නීය. දැඩි ලෙස රෝගාතුරය. ඇය ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේගේ දෙපා හිසින් වඳින්නීය’ කියා පවසනු මැනවි. මෙසේද පවසනු මැනවි: ‘ස්වාමීනි, අනුකම්පාවෙන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භික්ෂුණී ආරාමය වෙත, එනම් ඒ භික්ෂුණිය සිටින තැනට වැඩම කරනු මැනව’ කියායි.” “එසේය, ආර්යාවෙනි” කියා ඒ පුරුෂයා ඒ භික්ෂුණියට ප්‍රතිඥා දී, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට ගියේය. පැමිණ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට වන්දනා කර, එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි ඒ පුරුෂයා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, අසවල් නම් භික්ෂුණිය ආබාධිතය. දුකට පත්ව සිටින්නීය. දැඩි ලෙස රෝගාතුරය. ඇය ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේගේ දෙපා හිසින් වඳින්නීය. මෙසේද පවසන්නීය: ‘ස්වාමීනි, අනුකම්පාවෙන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භික්ෂුණී ආරාමය වෙත, එනම් ඒ භික්ෂුණිය සිටින තැනට වැඩම කරනු මැනව’ කියායි.” ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ නිශ්ශබ්දතාවයෙන් එය පිළිගත් සේක. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සිවුරු පොරවා, පාත්‍ර සිවුරු රැගෙන, භික්ෂුණී ආරාමය වෙත, එනම් ඒ භික්ෂුණිය සිටින තැනට වැඩම කළ සේක.\n\nඒ භික්ෂුණිය ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ දුරදීම වඩිනවා දුටුවාය. දැක, හිස ද සහිතව සිවුර පොරවා ගෙන යහනෙහි වැතිර ගත්තාය. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ඒ භික්ෂුණිය සිටින තැනට වැඩම කළ සේක. වැඩම කර, පනවා තිබූ අසුනක වාඩි වූ සේක. වාඩි වී, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ඒ භික්ෂුණියට මෙසේ වදාළ සේක:\n\n“නංගියේ, මේ කය ආහාරය නිසාවෙන් හටගත්තකි. ආහාරය (කෙරෙහි ඇති ආශාව) ප්‍රහාණය කළ යුතුයි. නංගියේ, මේ කය තණ්හාව නිසාවෙන් හටගත්තකි. තණ්හාව ප්‍රහාණය කළ යුතුයි. නංගියේ, මේ කය මානය නිසාවෙන් හටගත්තකි. මානය ප්‍රහාණය කළ යුතුයි. නංගියේ, මේ කය මෛථුන ධර්මය නිසා හටගත්තකි. භාග්‍යවතුන් වහන්සේ විසින් මෛථුන ධර්මය අධ්‍යාත්මික මාර්ගය සිඳලීමක් ලෙස දක්වා ඇත.\n\n‘නංගියේ, මේ කය ආහාරය නිසාවෙන් හටගත්තකි. ආහාරය ප්‍රහාණය කළ යුතුයි’ කියා මෙය භාග්‍යවතුන් වහන්සේ විසින් වදාළ සේක. මෙය කවර කරුණක් නිසා වදාළ සේක්ද? මෙහිදී, නංගියේ, භික්ෂුව නුවණින් විමසා යෝනිසෝමනසිකාරයෙන් ආහාර අනුභව කරයි. ‘ආහාරය ලෝල කමින් හෝ මදයෙන් හෝ හැඩවීම සඳහා හෝ අලංකාරය පිණිස හෝ නොව, මේ කයේ පැවැත්මට, ජීවිකාවට, හිංසා දුරු කිරීමට, බ්‍රහ්මචාරී ජීවිතයට උපකාර පිණිස ය. මෙයින් පැරණි වේදනාවන් නැති කර ගනිමි. අලුත් වේදනාවන් උපදවා නොගනිමි. මාගේ ශරීර යාපනයද සිදුවන්නේය, නිරවද්‍ය බවද, පහසු විහරණයද වන්නේය’ කියායි. ඔහු පසු කලෙක ආහාරය මුල් කරගෙන ඇති (ආහාර කෙරෙහි ඇති) ආශාව ප්‍රහාණය කරයි. ‘නංගියේ, මේ කය ආහාරය නිසාවෙන් හටගත්තකි. ආහාරය ප්‍රහාණය කළ යුතුයි’ කියා යමක් වදාළ සේක්ද, මෙය ඒ කරුණ නිසා වදාළ සේක.\n\n‘නංගියේ, මේ කය තණ්හාව නිසාවෙන් හටගත්තකි. තණ්හාව ප්‍රහාණය කළ යුතුයි’ කියා මෙය භාග්‍යවතුන් වහන්සේ විසින් වදාළ සේක. මෙය කවර කරුණක් නිසා වදාළ සේක්ද? මෙහිදී, නංගියේ, භික්ෂුව අසයි: ‘අසවල් නම් භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කරගෙන, එයට පැමිණ වාසය කරයි’ කියායි. ඔහුට මෙසේ සිතේ: ‘කවදා නම් මාත් ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කරගෙන, එයට පැමිණ වාසය කරන්නද!’ කියායි. ඔහු පසු කලෙක තණ්හාව මුල් කරගෙන ඇති (තණ්හා) ආශාව ප්‍රහාණය කරයි. ‘නංගියේ, මේ කය තණ්හාව නිසාවෙන් හටගත්තකි. තණ්හාව ප්‍රහාණය කළ යුතුයි’ කියා යමක් වදාළ සේක්ද, මෙය ඒ කරුණ නිසා වදාළ සේක.\n\n‘නංගියේ, මේ කය මානය නිසාවෙන් හටගත්තකි. මානය ප්‍රහාණය කළ යුතුයි’ කියා මෙය භාග්‍යවතුන් වහන්සේ විසින් වදාළ සේක. මෙය කවර කරුණක් නිසා වදාළ සේක්ද? මෙහිදී, නංගියේ, භික්ෂුව අසයි: ‘අසවල් නම් භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කරගෙන, එයට පැමිණ වාසය කරයි’ කියායි. ඔහුට මෙසේ සිතේ: ‘ඒ ආයුෂ්මතා නම් ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කරගෙන, එයට පැමිණ වාසය කරන්නේය. මටත් එය කළ නොහැකිද!’ කියායි. ඔහු පසු කලෙක මානය මුල් කරගෙන ඇති (මාන) ආශාව ප්‍රහාණය කරයි. ‘නංගියේ, මේ කය මානය නිසාවෙන් හටගත්තකි. මානය ප්‍රහාණය කළ යුතුයි’ කියා යමක් වදාළ සේක්ද, මෙය ඒ කරුණ නිසා වදාළ සේක.\n\n“නංගියේ, මේ කය මෛථුන ධර්මය නිසා හටගත්තකි. භාග්‍යවතුන් වහන්සේ විසින් මෛථුන ධර්මය අධ්‍යාත්මික මාර්ගය සිඳලීමක් ලෙස දක්වා ඇත” යි.\n\nඑකල්හි ඒ භික්ෂුණිය යහනින් නැඟිට, උතුරු සළුව එක අතකින් (එක අංශයකින්) පොරවාගෙන, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේගේ දෙපා හිසින් වැඳ වැටී, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ කීවාය: “ස්වාමීනි, මා විසින් නොමෝහයෙන්, නොදැනුවත්ව, අකුශලභාවයෙන් යුතුව සිදුකරන ලද වරදක් විය. ස්වාමීනි, අනාගතයේදී සංවරය පිණිස මාගේ ඒ වරද වරදක් ලෙස ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පිළිගන්නා සේක්වා” කියායි. “එසේය, නංගියේ,\n\nභගිනි, ඔබ මේ ආකාරයෙන් ක්‍රියා කළේ බාලයෙකු මෙන්, මුළාවූවෙකු මෙන්, අකුසල ක්‍රියාවක් කරන්නෙකු මෙනි. එය වරදකි. භගිනි, ඔබ යම් හෙයකින් ඒ වරද වරදක් ලෙස දැක, ධර්‍මානුකූලව පිළිසකර කරන්නේද, එය අපි ඔබෙන් පිළිගනිමු. භගිනි, යමෙක් වරද වරදක් ලෙස දැක, ධර්‍මානුකූලව එය පිළිසකර කොට, අනාගතයේදී සංවරයෙහි පිහිටන්නේද, එය ආර්‍ය විනයෙහි දියුණුවකි.",
      "paliTitle": "Bhikkhunīsuttaṃ",
      "englishTitle": "Discourse on Nuns",
      "sinhalaTitle": "භික්‍ෂුණී සූත්‍රය"
    },
    {
      "number": 160,
      "pali": "‘‘Sugato vā, bhikkhave, loke tiṭṭhamāno sugatavinayo vā tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. ‘‘Katamo ca, bhikkhave, sugato? Idha, bhikkhave, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. Ayaṃ, bhikkhave, sugato. ‘‘Katamo ca, bhikkhave, sugatavinayo? So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Ayaṃ, bhikkhave, sugatavinayo. Evaṃ sugato vā, bhikkhave, loke tiṭṭhamāno sugatavinayo vā tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānanti. ‘‘Cattārome, bhikkhave, dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhū duggahitaṃ suttantaṃ pariyāpuṇanti dunnikkhittehi padabyañjanehi. Dunnikkhittassa, bhikkhave, padabyañjanassa atthopi dunnayo hoti. Ayaṃ, bhikkhave, paṭhamo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū dubbacā honti dovacassakaraṇehi dhammehi samannāgatā akkhamā appadakkhiṇaggāhino anusāsaniṃ. Ayaṃ, bhikkhave, dutiyo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te na sakkaccaṃ suttantaṃ paraṃ vācenti. Tesaṃ accayena chinnamūlako suttanto hoti appaṭisaraṇo. Ayaṃ, bhikkhave, tatiyo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, therā bhikkhū bāhulikā honti sāthalikā, okkamane pubbaṅgamā, paviveke nikkhittadhurā, na vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti bāhulikā sāthalikā, okkamane pubbaṅgamā, paviveke nikkhittadhurā, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ, bhikkhave, catuttho dhammo saddhammassa sammosāya antaradhānāya saṃvattati. Ime kho, bhikkhave, cattāro dhammā saddhammassa sammosāya antaradhānāya saṃvattantī’’ti. ‘‘Cattārome, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhū suggahitaṃ suttantaṃ pariyāpuṇanti sunikkhittehi padabyañjanehi. Sunikkhittassa, bhikkhave, padabyañjanassa atthopi sunayo hoti. Ayaṃ, bhikkhave, paṭhamo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū suvacā honti sovacassakaraṇehi dhammehi samannāgatā khamā padakkhiṇaggāhino anusāsaniṃ. Ayaṃ, bhikkhave, dutiyo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te sakkaccaṃ suttantaṃ paraṃ vācenti. Tesaṃ accayena nacchinnamūlako [acchinnamūlako (syā. kaṃ.) a. ni. 5.156] suttanto hoti sappaṭisaraṇo. Ayaṃ, bhikkhave, tatiyo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, therā bhikkhū na bāhulikā honti na sāthalikā, okkamane nikkhittadhurā, paviveke pubbaṅgamā, vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti na bāhulikā na sāthalikā, okkamane nikkhittadhurā, paviveke pubbaṅgamā, vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ, bhikkhave, catuttho dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. Ime kho, bhikkhave, cattāro dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. Dasamaṃ. ",
      "english": "Either the Fortunate One, monastics, existing in the world, or the discipline of the Fortunate One, would be for the benefit of many people, for the happiness of many people, out of compassion for the world, for the welfare, benefit, and happiness of devas and humans. And who, monastics, is the Fortunate One? Here, monastics, a Tathāgata arises in the world—an Arahant, a Fully Self-Enlightened One, endowed with knowledge and conduct, the Fortunate One, knower of worlds, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Awakened One, the Blessed One. This, monastics, is the Fortunate One. And what, monastics, is the discipline of the Fortunate One? He teaches the Dhamma beautiful in the beginning, beautiful in the middle, beautiful in the end, with meaning and with phrasing; he proclaims the perfectly complete and utterly pure holy life. This, monastics, is the discipline of the Fortunate One. Thus, monastics, either the Fortunate One existing in the world, or the discipline of the Fortunate One, would be for the benefit of many people, for the happiness of many people, out of compassion for the world, for the welfare, benefit, and happiness of devas and humans.\n\nThere are these four things, monastics, that lead to the confusion and disappearance of the true Dhamma. Which four? Here, monastics, monastics learn a Sutta incorrectly, with wrongly placed words and phrases. When the words and phrases are wrongly placed, monastics, the meaning also becomes difficult to ascertain. This, monastics, is the first thing that leads to the confusion and disappearance of the true Dhamma.\n\nFurthermore, monastics, monastics are difficult to admonish, endowed with qualities that make them difficult to admonish, impatient, and unskillful in receiving instruction. This, monastics, is the second thing that leads to the confusion and disappearance of the true Dhamma.\n\nFurthermore, monastics, those monastics who are learned, who have preserved the traditions, who are upholders of the Dhamma, upholders of the Vinaya, upholders of the Mātikā, do not diligently teach the Suttas to others. When they pass away, the Suttas become rootless and without recourse. This, monastics, is the third thing that leads to the confusion and disappearance of the true Dhamma.\n\nFurthermore, monastics, elder monastics are given to busyness, are slack, take the lead in falling away, and lay aside the burden of solitude. They do not arouse effort for the attainment of what is not yet attained, for the realization of what is not yet realized, for the direct experience of what is not yet directly experienced. The later generations follow their example. They too become given to busyness, slack, take the lead in falling away, and lay aside the burden of solitude. They do not arouse effort for the attainment of what is not yet attained, for the realization of what is not yet realized, for the direct experience of what is not yet directly experienced. This, monastics, is the fourth thing that leads to the confusion and disappearance of the true Dhamma. These four things, monastics, lead to the confusion and disappearance of the true Dhamma.\n\nThere are these four things, monastics, that lead to the establishment, non-confusion, and non-disappearance of the true Dhamma. Which four? Here, monastics, monastics learn a Sutta correctly, with well-placed words and phrases. When the words and phrases are well-placed, monastics, the meaning also becomes easy to ascertain. This, monastics, is the first thing that leads to the establishment, non-confusion, and non-disappearance of the true Dhamma.\n\nFurthermore, monastics, monastics are easy to admonish, endowed with qualities that make them easy to admonish, patient, and skillful in receiving instruction. This, monastics, is the second thing that leads to the establishment, non-confusion, and non-disappearance of the true Dhamma.\n\nFurthermore, monastics, those monastics who are learned, who have preserved the traditions, who are upholders of the Dhamma, upholders of the Vinaya, upholders of the Mātikā, diligently teach the Suttas to others. When they pass away, the Suttas are not rootless; they have recourse. This, monastics, is the third thing that leads to the establishment, non-confusion, and non-disappearance of the true Dhamma.\n\nFurthermore, monastics, elder monastics are not given to busyness, are not slack, lay aside the burden of falling away, and take the lead in solitude. They arouse effort for the attainment of what is not yet attained, for the realization of what is not yet realized, for the direct experience of what is not yet directly experienced. The later generations follow their example. They too become not given to busyness, not slack, lay aside the burden of falling away, and take the lead in solitude. They arouse effort for the attainment of what is not yet attained, for the realization of what is not yet realized, for the direct experience of what is not yet directly experienced. This, monastics, is the fourth thing that leads to the establishment, non-confusion, and non-disappearance of the true Dhamma. These four things, monastics, lead to the establishment, non-confusion, and non-disappearance of the true Dhamma.",
      "sinhala": "මහණෙනි, සුගතයන් වහන්සේ හෝ සුගතයන් වහන්සේගේ ශාසනය ලොව පවතින්නේ නම්, එය බොහෝ දෙනාගේ යහපත පිණිසද, බොහෝ දෙනාගේ සුවය පිණිසද, ලෝකයා කෙරෙහි අනුකම්පාව පිණිසද, දෙවි මිනිසුන්ගේ අර්ථය පිණිසද, හිත පිණිසද, සැපය පිණිසද පවතින්නේය.\n\nමහණෙනි, සුගතයාණෝ කවරෙක්ද? මහණෙනි, මෙහි රහත් වූ, සම්මාසම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලෝක විදූ වූ, අනුත්තර පුරිසදම්ම සාරථී වූ, දෙවි මිනිසුන්ට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ ලෝකයෙහි පහළ වෙති. මහණෙනි, මේ සුගතයාණෝය.\n\nමහණෙනි, සුගතයන් වහන්සේගේ විනය (ශාසනය) කවරේද? උන්වහන්සේ මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථය සහිත වූ, ව්‍යංජනයන් සහිත වූ (පද සහ අකුරු සහිත වූ) ධර්මය දේශනා කරති. එසේම ඒකන්තයෙන්ම පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරති. මහණෙනි, මෙය සුගතයන් වහන්සේගේ විනය (ශාසනය) වේ. මහණෙනි, මෙසේ සුගතයන් වහන්සේ හෝ සුගතයන් වහන්සේගේ ශාසනය ලොව පවතින්නේ නම්, එය බොහෝ දෙනාගේ යහපත පිණිසද, බොහෝ දෙනාගේ සුවය පිණිසද, ලෝකයා කෙරෙහි අනුකම්පාව පිණිසද, දෙවි මිනිසුන්ගේ අර්ථය පිණිසද, හිත පිණිසද, සැපය පිණිසද පවතින්නේය.\n\nමහණෙනි, සද්ධර්මය නොපැහැදිලි වීම පිණිසද, අතුරුදහන් වීම පිණිසද හේතු වන කරුණු සතරක් ඇත. ඒ සතර කවරේද? මහණෙනි, මෙහිලා භික්‍ෂූහු වැරදි ලෙස තැබූ පද සහ අකුරු සහිතව සුත්‍ර ඉගෙන ගනිති. මහණෙනි, වැරදි ලෙස තැබූ පද සහ ව්‍යංජනයන්හි අර්ථය ද ග්‍රහණය කරගැනීමට අපහසු වෙයි. මහණෙනි, සද්ධර්මය නොපැහැදිලි වීම පිණිසද, අතුරුදහන් වීම පිණිසද හේතු වන පළමුවන කරුණ මෙයයි.\n\nනැවතත් මහණෙනි, භික්‍ෂූහු අවවාද කිරීමට අපහසු වෙති. අවවාද කිරීමට අපහසු කරන ධර්මයන්ගෙන් යුක්ත වෙති. ඔවුහු නොඉවසිලිමත් වන අතර අනුශාසනාවන්ට ගෞරවයෙන් ප්‍රතිග්‍රහණය නොකරති. මහණෙනි, සද්ධර්මය නොපැහැදිලි වීම පිණිසද, අතුරුදහන් වීම පිණිසද හේතු වන දෙවන කරුණ මෙයයි.\n\nනැවතත් මහණෙනි, යම් ඒ භික්‍ෂූහු බහුශ්‍රැත වූ, ආගමයන් ලබාගත්, ධර්මධර වූ, විනයධර වූ, මාතිකාධර වූවාහුද, ඔවුහු සුත්‍ර ධර්මය අන් අයට උගන්වන්නේ ගෞරවයකින් තොරවය. ඔවුන්ගේ ඇවෑමෙන් සුත්‍ර ධර්මය මුල් සිඳී ගිය එකක් බවට පත්වෙයි, පිහිටක් නැති එකක් වෙයි. මහණෙනි, සද්ධර්මය නොපැහැදිලි වීම පිණිසද, අතුරුදහන් වීම පිණිසද හේතු වන තුන්වන කරුණ මෙයයි.\n\nනැවතත් මහණෙනි, ස්ථවිර භික්‍ෂූහු බොහෝ කටයුතුවල නිරත වීමට කැමති වෙති, අලස වෙති. මිශ්‍රවීම් වලට ප්‍රමුඛ වෙති, විවේකයෙහි බර අත්හළ වෙති. නොලැබූ අරමුණු ලැබීම පිණිස, අවබෝධ නොකළ අරමුණු අවබෝධ කිරීම පිණිස, ප්‍රත්‍යක්‍ෂ නොකළ අරමුණු ප්‍රත්‍යක්‍ෂ කිරීම පිණිස වීර්ය නොආරම්භ කරති. ඔවුන්ගේ පසු පරම්පරාව ඔවුන්ගේ ක්‍රියා මාර්ගයටම පැමිණෙති. ඔවුහුද බොහෝ කටයුතුවල නිරත වීමට කැමති වෙති, අලස වෙති. මිශ්‍රවීම් වලට ප්‍රමුඛ වෙති, විවේකයෙහි බර අත්හළ වෙති. නොලැබූ අරමුණු ලැබීම පිණිස, අවබෝධ නොකළ අරමුණු අවබෝධ කිරීම පිණිස, ප්‍රත්‍යක්‍ෂ නොකළ අරමුණු ප්‍රත්‍යක්‍ෂ කිරීම පිණිස වීර්ය නොආරම්භ කරති. මහණෙනි, සද්ධර්මය නොපැහැදිලි වීම පිණිසද, අතුරුදහන් වීම පිණිසද හේතු වන සිවුවන කරුණ මෙයයි. මහණෙනි, මේ ධර්ම සතර සද්ධර්මය නොපැහැදිලි වීම පිණිසත්, අතුරුදහන් වීම පිණිසත් පවතින්නේය.\n\nමහණෙනි, සද්ධර්මයේ පැවැත්ම පිණිසද, නොපැහැදිලි නොවීම පිණිසද, අතුරුදහන් නොවීම පිණිසද හේතු වන කරුණු සතරක් ඇත. ඒ සතර කවරේද? මහණෙනි, මෙහිලා භික්‍ෂූහු මනා ලෙස තැබූ පද සහ අකුරු සහිතව සුත්‍ර ඉගෙන ගනිති. මහණෙනි, මනා ලෙස තැබූ පද සහ ව්‍යංජනයන්හි අර්ථය ද ග්‍රහණය කරගැනීමට පහසු වෙයි. මහණෙනි, සද්ධර්මයේ පැවැත්ම පිණිසද, නොපැහැදිලි නොවීම පිණිසද, අතුරුදහන් නොවීම පිණිසද හේතු වන පළමුවන කරුණ මෙයයි.\n\nනැවතත් මහණෙනි, භික්‍ෂූහු අවවාද කිරීමට පහසු වෙති. අවවාද කිරීමට පහසු කරන ධර්මයන්ගෙන් යුක්ත වෙති. ඔවුහු ඉවසිලිමත් වන අතර අනුශාසනාවන්ට ගෞරවයෙන් ප්‍රතිග්‍රහණය කරති. මහණෙනි, සද්ධර්මයේ පැවැත්ම පිණිසද, නොපැහැදිලි නොවීම පිණිසද, අතුරුදහන් නොවීම පිණිසද හේතු වන දෙවන කරුණ මෙයයි.\n\nනැවතත් මහණෙනි, යම් ඒ භික්‍ෂූහු බහුශ්‍රැත වූ, ආගමයන් ලබාගත්, ධර්මධර වූ, විනයධර වූ, මාතිකාධර වූවාහුද, ඔවුහු සුත්‍ර ධර්මය අන් අයට උගන්වන්නේ ගෞරවයෙන් හා උනන්දුවෙනි. ඔවුන්ගේ ඇවෑමෙන් සුත්‍ර ධර්මය මුල් සිඳී ගිය එකක් බවට පත් නොවෙයි, පිහිටක් ඇති එකක් වෙයි. මහණෙනි, සද්ධර්මයේ පැවැත්ම පිණිසද, නොපැහැදිලි නොවීම පිණිසද, අතුරුදහන් නොවීම පිණිසද හේතු වන තුන්වන කරුණ මෙයයි.\n\nනැවතත් මහණෙනි, ස්ථවිර භික්‍ෂූහු බොහෝ කටයුතුවල නිරත වීමට කැමති නොවෙති, අලස නොවෙති. මිශ්‍රවීම් වල බර අත්හළ වෙති, විවේකයෙහි ප්‍රමුඛ වෙති. නොලැබූ අරමුණු ලැබීම පිණිස, අවබෝධ නොකළ අරමුණු අවබෝධ කිරීම පිණිස, ප්‍රත්‍යක්‍ෂ නොකළ අරමුණු ප්‍රත්‍යක්‍ෂ කිරීම පිණිස වීර්ය ආරම්භ කරති. ඔවුන්ගේ පසු පරම්පරාව ඔවුන්ගේ ක්‍රියා මාර්ගයටම පැමිණෙති. ඔවුහුද බොහෝ කටයුතුවල නිරත වීමට කැමති නොවෙති, අලස නොවෙති. මිශ්‍රවීම් වල බර අත්හළ වෙති, විවේකයෙහි ප්‍රමුඛ වෙති. නොලැබූ අරමුණු ලැබීම පිණිස, අවබෝධ නොකළ අරමුණු අවබෝධ කිරීම පිණිස, ප්‍රත්‍යක්‍ෂ නොකළ අරමුණු ප්‍රත්‍යක්‍ෂ කිරීම පිණිස වීර්ය ආරම්භ කරති. මහණෙනි, සද්ධර්මයේ පැවැත්ම පිණිසද, නොපැහැදිලි නොවීම පිණිසද, අතුරුදහන් නොවීම පිණිසද හේතු වන සිවුවන කරුණ මෙයයි. මහණෙනි, මේ ධර්ම සතර සද්ධර්මයේ පැවැත්ම පිණිසද, නොපැහැදිලි නොවීම පිණිසද, අතුරුදහන් නොවීම පිණිසද පවතින්නේය.",
      "paliTitle": "Sugatavinayasuttaṃ",
      "englishTitle": "The Well-Gone One's Discipline Discourse",
      "sinhalaTitle": "සුගත විනය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Indriyavaggo paṭhamo. Tassuddānaṃ – Indriyāni saddhā paññā, sati saṅkhānapañcamaṃ; Kappo rogo parihāni, bhikkhunī sugatena cāti.",
    "english": "The First Section on Faculties",
    "sinhala": "පළමු ඉන්‍‌ද්‍‌රිය වර්‍‌ගය"
  }
}