{
  "id": "an4.8",
  "title": {
    "pali": "Apaṇṇakavaggo",
    "english": "The Chapter on the Unmistakable",
    "sinhala": "නොවරදින වග්ගය"
  },
  "sections": [
    {
      "number": 71,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi catūhi? Idha, bhikkhave, bhikkhu sīlavā hoti, bahussuto hoti, āraddhavīriyo hoti, paññavā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā’’ti. Paṭhamaṃ.",
      "english": "Monks, a bhikkhu endowed with four qualities has entered upon the unquestionable path, and for him, the proper course has been undertaken for the destruction of the taints.\n\nWhich four?\n\nHere, monks, a bhikkhu is virtuous, is learned, has aroused persistent effort, and is wise.\n\nIndeed, monks, a bhikkhu endowed with these four qualities has entered upon the unquestionable path, and for him, the proper course has been undertaken for the destruction of the taints.",
      "sinhala": "මහණෙනි, කරුණු සතරකින් යුක්ත වූ භික්ෂුව නිසැක ප්‍රතිපදාවක පිහිටා සිටින්නේය. තවද, ඔහුගේ ආශ්‍රවයන් ක්ෂය කිරීම පිණිස යෝග්‍ය මාර්ගය (උපක්‍රමය) ආරම්භ වී ඇත්තේය.\n\nඒ කවර කරුණු සතරකින්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව සිල්වත් වන්නේය. බහුශ්‍රැත වන්නේය. ආරම්භ කළ වීර්යය ඇත්තේය. ප්‍රඥාවන්ත වන්නේය.\n\nමහණෙනි, භික්ෂුවක් මේ කරුණු සතරින් යුක්ත වන්නේ නම්, ඔහු නිසැක ප්‍රතිපදාවක පිහිටා සිටින්නේය. තවද, ඔහුගේ ආශ්‍රවයන් ක්ෂය කිරීම පිණිස යෝග්‍ය මාර්ගය (උපක්‍රමය) ආරම්භ වී ඇත්තේය.",
      "paliTitle": "Padhānasuttaṃ"
    },
    {
      "number": 72,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi catūhi? Nekkhammavitakkena, abyāpādavitakkena, avihiṃsāvitakkena, sammādiṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā’’ti. Dutiyaṃ.",
      "english": "Monks, a monk endowed with four qualities practices the unfailing path, and the proper course for the destruction of the influxes is initiated for him. Which four? By thoughts of renunciation, by thoughts of non-ill-will, by thoughts of non-harming, and by right view. Monks, a monk endowed with these four qualities practices the unfailing path, and the proper course for the destruction of the influxes is initiated for him.",
      "sinhala": "මහණෙනි, කරුණු සතරකින් යුක්ත වූ භික්ෂුව නිසැක ප්‍රතිපදාවට පැමිණ සිටී. තවද, ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිවැරදි මඟ ඔහු විසින් අරඹන ලද්දේ වෙයි. ඒ සතර කුමක්ද? නෙක්ඛම්ම විතර්කයෙන්, අව්‍යාපාද විතර්කයෙන්, අවිහිංසා විතර්කයෙන්, සම්මා දිට්ඨියෙන් – මහණෙනි, මේ කරුණු සතරින් යුක්ත වූ භික්ෂුව නිසැක ප්‍රතිපදාවට පැමිණ සිටී. තවද, ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිවැරදි මඟ ඔහු විසින් අරඹන ලද්දේ වෙයි.",
      "paliTitle": "Sammādiṭṭhisuttaṃ"
    },
    {
      "number": 73,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato asappuriso veditabbo. Katamehi catūhi? Idha, bhikkhave, asappuriso yo hoti parassa avaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ vitthārena parassa avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti. ‘‘Puna caparaṃ, bhikkhave, asappuriso yo hoti parassa vaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena parassa vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti. ‘‘Puna caparaṃ, bhikkhave, asappuriso yo hoti attano avaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena attano avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti. ‘‘Puna caparaṃ, bhikkhave, asappuriso yo hoti attano vaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ vitthārena attano vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato asappuriso veditabbo. ‘‘Catūhi, bhikkhave, dhammehi samannāgato sappuriso veditabbo. Katamehi catūhi? Idha, bhikkhave, sappuriso yo hoti parassa avaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena parassa avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti. ‘‘Puna caparaṃ, bhikkhave, sappuriso yo hoti parassa vaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ vitthārena parassa vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti. ‘‘Puna caparaṃ, bhikkhave, sappuriso yo hoti attano avaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ vitthārena attano avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti. ‘‘Puna caparaṃ, bhikkhave, sappuriso yo hoti attano vaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena attano vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato sappuriso veditabbo. ‘‘Seyyathāpi, bhikkhave, vadhukā yaññadeva rattiṃ vā divaṃ vā ānītā hoti, tāvadevassā tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti sassuyāpi sasurepi sāmikepi antamaso dāsakammakaraporisesu. Sā aparena samayena saṃvāsamanvāya vissāsamanvāya sassumpi sasurampi sāmikampi evamāha – ‘apetha, kiṃ pana tumhe jānāthā’ti! Evamevaṃ kho, bhikkhave, idhekacco bhikkhu yaññadeva rattiṃ vā divaṃ vā agārasmā anagāriyaṃ pabbajito hoti, tāvadevassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti bhikkhūsu bhikkhunīsu upāsakesu upāsikāsu antamaso ārāmikasamaṇuddesesu. So aparena samayena saṃvāsamanvāya vissāsamanvāya ācariyampi upajjhāyampi evamāha – ‘apetha, kiṃ pana tumhe jānāthā’ti! Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘adhunāgatavadhukāsamena cetasā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Tatiyaṃ.",
      "english": "Monks, an ignoble person is to be known by four qualities. Which four?\n\nHere, monks, an ignoble person, when there is another's fault, reveals it even when not asked; what need to mention when asked! When questioned and pressed, they speak of another's fault fully and extensively, without suppressing or holding back. This, monks, is to be known as an ignoble person.\n\nFurthermore, monks, an ignoble person, when there is another's praise, does not reveal it even when asked; what need to mention when not asked! When questioned and pressed, they speak of another's praise incompletely and not extensively, suppressing and holding back. This, monks, is to be known as an ignoble person.\n\nFurthermore, monks, an ignoble person, when there is their own fault, does not reveal it even when asked; what need to mention when not asked! When questioned and pressed, they speak of their own fault incompletely and not extensively, suppressing and holding back. This, monks, is to be known as an ignoble person.\n\nFurthermore, monks, an ignoble person, when there is their own praise, reveals it even when not asked; what need to mention when asked! When questioned and pressed, they speak of their own praise fully and extensively, without suppressing or holding back. This, monks, is to be known as an ignoble person. Monks, it is by these four qualities that an ignoble person is to be known.\n\nMonks, a noble person is to be known by four qualities. Which four?\n\nHere, monks, a noble person, when there is another's fault, does not reveal it even when asked; what need to mention when not asked! When questioned and pressed, they speak of another's fault incompletely and not extensively, suppressing and holding back. This, monks, is to be known as a noble person.\n\nFurthermore, monks, a noble person, when there is another's praise, reveals it even when not asked; what need to mention when asked! When questioned and pressed, they speak of another's praise fully and extensively, without suppressing or holding back. This, monks, is to be known as a noble person.\n\nFurthermore, monks, a noble person, when there is their own fault, reveals it even when not asked; what need to mention when asked! When questioned and pressed, they speak of their own fault fully and extensively, without suppressing or holding back. This, monks, is to be known as a noble person.\n\nFurthermore, monks, a noble person, when there is their own praise, does not reveal it even when asked; what need to mention when not asked! When questioned and pressed, they speak of their own praise incompletely and not extensively, suppressing and holding back. This, monks, is to be known as a noble person. Monks, it is by these four qualities that a noble person is to be known.\n\nJust as, monks, a bride, on the very night or day she is brought into her new home, experiences an intense sense of moral shame and moral dread towards her mother-in-law, her father-in-law, her husband, and even towards the slaves, workers, and servants. But after some time, having lived together and grown familiar, she says to her mother-in-law, father-in-law, and husband, \"Go away! What do you know?\"\n\nIn the same way, monks, some monk, on the very night or day he has gone forth from the home life into homelessness, experiences an intense sense of moral shame and moral dread towards monks, nuns, male lay followers, female lay followers, and even towards monastery attendants and novice monks. But after some time, having lived together and grown familiar, he says to his teacher and preceptor, \"Go away! What do you know?\"\n\nTherefore, monks, you should train yourselves thus: \"We will dwell with a mind like that of a newly arrived bride.\" That is how you should train yourselves, monks.",
      "sinhala": "භික්ෂූණි, අසත්පුරුෂයෙක් ධර්ම සතරකින් යුක්තව සිටින බව දැනගත යුත්තෙකි. ඒ සතර කුමක්ද? භික්ෂූණි, මෙහිලා අසත්පුරුෂ පුද්ගලයා අනුන්ගේ යම් අපකීර්තියක් වේ නම්, එය තමාගෙන් නොවිමසුවත් ප්‍රකාශ කරයි. විමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, කිසිවක් නොඅත්හැර, කිසිවක් නොසඟවා, සම්පූර්ණයෙන් විස්තර වශයෙන් අනුන්ගේ අපකීර්තිය කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා අසත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. තවද භික්ෂූණි, අසත්පුරුෂ පුද්ගලයා අනුන්ගේ යම් ගුණයක් වේ නම්, එය තමාගෙන් විමසුවත් ප්‍රකාශ නොකරයි. නොවිමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, යමක් අත්හැර, යමක් සඟවා, අසම්පූර්ණව, අවිස්තරව අනුන්ගේ ගුණ කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා අසත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. තවද භික්ෂූණි, අසත්පුරුෂ පුද්ගලයා තමාගේ යම් අපකීර්තියක් වේ නම්, එය තමාගෙන් විමසුවත් ප්‍රකාශ නොකරයි. නොවිමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, යමක් අත්හැර, යමක් සඟවා, අසම්පූර්ණව, අවිස්තරව තමාගේ අපකීර්තිය කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා අසත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. තවද භික්ෂූණි, අසත්පුරුෂ පුද්ගලයා තමාගේ යම් ගුණයක් වේ නම්, එය තමාගෙන් නොවිමසුවත් ප්‍රකාශ කරයි. විමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, කිසිවක් නොඅත්හැර, කිසිවක් නොසඟවා, සම්පූර්ණයෙන් විස්තර වශයෙන් තමාගේ ගුණ කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා අසත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. භික්ෂූණි, මේ ධර්ම සතරකින් යුක්තව සිටින අසත්පුරුෂ පුද්ගලයා දැනගත යුත්තෙකි.\n\nභික්ෂූණි, සත්පුරුෂයෙක් ධර්ම සතරකින් යුක්තව සිටින බව දැනගත යුත්තෙකි. ඒ සතර කුමක්ද? භික්ෂූණි, මෙහිලා සත්පුරුෂ පුද්ගලයා අනුන්ගේ යම් අපකීර්තියක් වේ නම්, එය තමාගෙන් විමසුවත් ප්‍රකාශ නොකරයි. නොවිමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, යමක් අත්හැර, යමක් සඟවා, අසම්පූර්ණව, අවිස්තරව අනුන්ගේ අපකීර්තිය කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා සත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. තවද භික්ෂූණි, සත්පුරුෂ පුද්ගලයා අනුන්ගේ යම් ගුණයක් වේ නම්, එය තමාගෙන් නොවිමසුවත් ප්‍රකාශ කරයි. විමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, කිසිවක් නොඅත්හැර, කිසිවක් නොසඟවා, සම්පූර්ණයෙන් විස්තර වශයෙන් අනුන්ගේ ගුණ කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා සත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. තවද භික්ෂූණි, සත්පුරුෂ පුද්ගලයා තමාගේ යම් අපකීර්තියක් වේ නම්, එය තමාගෙන් නොවිමසුවත් ප්‍රකාශ කරයි. විමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, කිසිවක් නොඅත්හැර, කිසිවක් නොසඟවා, සම්පූර්ණයෙන් විස්තර වශයෙන් තමාගේ අපකීර්තිය කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා සත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. තවද භික්ෂූණි, සත්පුරුෂ පුද්ගලයා තමාගේ යම් ගුණයක් වේ නම්, එය තමාගෙන් විමසුවත් ප්‍රකාශ නොකරයි. නොවිමසුවහොත් කියනුම කවරේද? විමසන ලද කල්හි නම්, ප්‍රශ්නයට යොමු වූ විට, යමක් අත්හැර, යමක් සඟවා, අසම්පූර්ණව, අවිස්තරව තමාගේ ගුණ කතා කරන්නේ වෙයි. භික්ෂූණි, මේ පුද්ගලයා සත්පුරුෂයෙකැයි මෙයින් දැනගත යුත්තේය. භික්ෂූණි, මේ ධර්ම සතරකින් යුක්තව සිටින සත්පුරුෂ පුද්ගලයා දැනගත යුත්තෙකි.\n\nභික්ෂූණි, යම්සේ අලුත විවාහ කරගෙන ආ මනාලියක් වේද, ඇය මුලින්ම ගෙනා රාත්‍රියේ හෝ දිවා කාලයේදී මවටද, පියාටද, ස්වාමියාටද, එපමණක් නොව දාස දාසියන්ට සහ සේවකයන්ට පවා දැඩි ලැජ්ජාවක් සහ බියක් ඇති කරගෙන යුක්තව සිටින්නීය. කල් ගත වී ඇසුරු කිරීමෙන් සහ හුරුපුරුදු වීමෙන් පසුව, ඇය නැන්දම්මාටද, මාමණ්ඩීටද, ස්වාමියාටද මෙසේ කියන්නීය: “ඉවත් වන්න! ඔබ කුමක් දන්නේද?” භික්ෂූණි, එසේම මෙහිලා ඇතැම් භික්ෂුවක් ගිහි ගෙන් නික්ම මහණ වූ මුල්ම රාත්‍රියේ හෝ දිවා කාලයේදී භික්ෂූන් කෙරෙහිද, භික්ෂුණීන් කෙරෙහිද, උපාසකවරුන් කෙරෙහිද, උපාසිකාවන් කෙරෙහිද, එපමණක් නොව ආරාමිකයන් කෙරෙහිද, සාමණේරවරුන් කෙරෙහිද දැඩි ලැජ්ජාවක් සහ බියක් ඇති කරගෙන යුක්තව සිටින්නේය. ඔහු කල් ගත වී ඇසුරු කිරීමෙන් සහ හුරුපුරුදු වීමෙන් පසුව ආචාර්යවරුන්ටද, උපාධ්‍යායවරුන්ටද මෙසේ කියන්නේය: “ඉවත් වන්න! ඔබ කුමක් දන්නේද?” එබැවින් භික්ෂූණි, මෙසේ හික්මිය යුත්තේය: ‘අලුතින් පැමිණි මනාලියකගේ සිත හා සමාන සිතකින් අපි වාසය කරන්නෙමු’යි. භික්ෂූණි, ඔබ මෙසේම හික්මිය යුත්තේය.",
      "paliTitle": "Sappurisasuttaṃ"
    },
    {
      "number": 74,
      "pali": "‘‘Cattārimāni, bhikkhave, aggāni. Katamāni cattāri? Sīlaggaṃ, samādhiggaṃ [samādhaggaṃ (sī. syā. kaṃ)], paññāggaṃ, vimuttaggaṃ – imāni kho, bhikkhave, cattāri aggānī’’ti. Catutthaṃ.",
      "english": "Monks, these four are the supreme. Which four? Supreme moral conduct, supreme concentration, supreme wisdom, supreme liberation – these indeed, monks, are the four supreme things.",
      "sinhala": "භික්ෂූන් වහන්ස, මේවා අග්‍ර ධර්ම සතරකි. ඒ කවර සතරක්ද? අග්‍ර ශීලය, අග්‍ර සමාධිය, අග්‍ර ප්‍රඥාව, අග්‍ර විමුක්තිය – භික්ෂූන් වහන්ස, මේවා අග්‍ර ධර්ම සතර වේ.",
      "paliTitle": "Paṭhamaaggasuttaṃ"
    },
    {
      "number": 75,
      "pali": "‘‘Cattārimāni, bhikkhave, aggāni. Katamāni cattāri? Rūpaggaṃ, vedanāggaṃ, saññāggaṃ, bhavaggaṃ – imāni kho, bhikkhave, cattāri aggānī’’ti. Pañcamaṃ.",
      "english": "Monks, these four are the foremost. Which four? The foremost among forms, the foremost among feelings, the foremost among perceptions, and the foremost among states of existence. Indeed, Monks, these are the four foremost.",
      "sinhala": "මහණෙනි, මේ අග්‍ර දහම් සතරකි.\nකවරේද ඒ සතර?\nරූප අග්‍රය, වේදනා අග්‍රය, සංඥා අග්‍රය, භව අග්‍රය –\nමහණෙනි, සැබැවින්ම මේ අග්‍ර දහම් සතර නම් මේවාය.",
      "paliTitle": "Dutiyaaggasuttaṃ"
    },
    {
      "number": 76,
      "pali": "Ekaṃ samayaṃ bhagavā kusinārāyaṃ viharati upavattane mallānaṃ sālavane antarena yamakasālānaṃ parinibbānasamaye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Siyā kho pana, bhikkhave [dī. ni. 2.217], ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Evaṃ vutte te bhikkhū tuṇhī ahesuṃ. Dutiyampi kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Dutiyampi kho te bhikkhū tuṇhī ahesuṃ. Tatiyampi kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Tatiyampi kho te bhikkhū tuṇhī ahesuṃ. Atha kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, satthugāravenapi na puccheyyātha, sahāyakopi, bhikkhave, sahāyakassa ārocetū’’ti. Evaṃ vutte te bhikkhū tuṇhī ahesuṃ. Atha kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Evaṃ pasanno ahaṃ, bhante! Natthi imasmiṃ bhikkhusaṅghe ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā’’ti. ‘‘Pasādā kho tvaṃ, ānanda, vadesi. Ñāṇameva hettha, ānanda, tathāgatassa – ‘natthi imasmiṃ bhikkhusaṅghe ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā’. Imesañhi, ānanda, pañcannaṃ bhikkhusatānaṃ yo pacchimako bhikkhu so sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti. Chaṭṭhaṃ.",
      "english": "At one time, the Blessed One was dwelling in Kusinārā, in the Upavattana Sāla-grove of the Mallas, between the twin Sāla trees, at the time of his final Nibbāna.\n\nThere, indeed, the Blessed One addressed the bhikkhus, saying, \"Bhikkhus.\" \"Venerable sir,\" those bhikkhus responded to the Blessed One. The Blessed One spoke thus: \"It is possible, bhikkhus, that even for a single bhikkhu there might be doubt or perplexity concerning the Buddha, the Dhamma, the Saṅgha, the path, or the practice. Ask, bhikkhus, so that you may not later regret, 'Our Teacher was present before us, yet we were unable to question the Blessed One face to face.'\" When this was said, those bhikkhus remained silent. A second time, indeed, the Blessed One addressed the bhikkhus: \"It is possible, bhikkhus, that even for a single bhikkhu there might be doubt or perplexity concerning the Buddha, the Dhamma, the Saṅgha, the path, or the practice. Ask, bhikkhus, so that you may not later regret, 'Our Teacher was present before us, yet we were unable to question the Blessed One face to face.'\" A second time, indeed, those bhikkhus remained silent. A third time, indeed, the Blessed One addressed the bhikkhus: \"It is possible, bhikkhus, that even for a single bhikkhu there might be doubt or perplexity concerning the Buddha, the Dhamma, the Saṅgha, the path, or the practice. Ask, bhikkhus, so that you may not later regret, 'Our Teacher was present before us, yet we were unable to question the Blessed One face to face.'\" A third time, indeed, those bhikkhus remained silent.\n\nThen, indeed, the Blessed One addressed the bhikkhus: \"It is possible, bhikkhus, that out of reverence for the Teacher you might not ask. Even a companion, bhikkhus, should inform his companion.\" When this was said, those bhikkhus remained silent.\n\nThen, indeed, Venerable Ānanda spoke to the Blessed One thus: \"It is wonderful, Venerable sir! It is astounding, Venerable sir! So great is my confidence, Venerable sir! There is not a single bhikkhu in this assembly of bhikkhus who has any doubt or perplexity concerning the Buddha, the Dhamma, the Saṅgha, the path, or the practice.\"\n\n\"You speak from faith, Ānanda. Herein, Ānanda, the Tathāgata's knowledge is certain: 'There is not a single bhikkhu in this assembly of bhikkhus who has any doubt or perplexity concerning the Buddha, the Dhamma, the Saṅgha, the path, or the practice.' For among these five hundred bhikkhus, Ānanda, the very last bhikkhu is a stream-enterer, not subject to downfall, assured, with enlightenment as his destination.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කුසිනාරා නුවරට නුදුරු මල්ලවරුන්ගේ උපවත්තන නම් සල් වනයේ යමකසල් ගස් දෙකක් අතර පිරිනිවන් පෑමේ කාලයෙහි වැඩසිටියහ. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"ස්වාමීනි\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, ඇතැම් විට එක් භික්ෂුවකට වත් බුදුරජාණන් වහන්සේ කෙරෙහි හෝ ධර්මය කෙරෙහි හෝ සංඝයා කෙරෙහි හෝ මාර්ගය කෙරෙහි හෝ ප්‍රතිපදාව කෙරෙහි හෝ සැකයක් හෝ විමතියක් හෝ ඇත්නම්, මහණෙනි, විමසන්න. 'අපට ශාස්තෘන් වහන්සේ සමීපයෙහි වැඩසිටියහ, භාග්‍යවතුන් වහන්සේගෙන් සමීපයෙහිදී ප්‍ර‍ශ්න ඇසීමට අපට නොහැකි විය' යි පසුව පසුතැවිලි නොවනු පිණිසයි.\" මෙසේ වදාළ කල්හි ඒ භික්ෂූහු නිහඬ වූහ.\n\nදෙවෙනි වරටත් භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි, ඇතැම් විට එක් භික්ෂුවකට වත් බුදුරජාණන් වහන්සේ කෙරෙහි හෝ ධර්මය කෙරෙහි හෝ සංඝයා කෙරෙහි හෝ මාර්ගය කෙරෙහි හෝ ප්‍රතිපදාව කෙරෙහි හෝ සැකයක් හෝ විමතියක් හෝ ඇත්නම්, මහණෙනි, විමසන්න. 'අපට ශාස්තෘන් වහන්සේ සමීපයෙහි වැඩසිටියහ, භාග්‍යවතුන් වහන්සේගෙන් සමීපයෙහිදී ප්‍ර‍ශ්න ඇසීමට අපට නොහැකි විය' යි පසුව පසුතැවිලි නොවනු පිණිසයි\" යි වදාළ සේක. දෙවෙනි වරටත් ඒ භික්ෂූහු නිහඬ වූහ.\n\nතුන්වෙනි වරටත් භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි, ඇතැම් විට එක් භික්ෂුවකට වත් බුදුරජාණන් වහන්සේ කෙරෙහි හෝ ධර්මය කෙරෙහි හෝ සංඝයා කෙරෙහි හෝ මාර්ගය කෙරෙහි හෝ ප්‍රතිපදාව කෙරෙහි හෝ සැකයක් හෝ විමතියක් හෝ ඇත්නම්, මහණෙනි, විමසන්න. 'අපට ශාස්තෘන් වහන්සේ සමීපයෙහි වැඩසිටියහ, භාග්‍යවතුන් වහන්සේගෙන් සමීපයෙහිදී ප්‍ර‍ශ්න ඇසීමට අපට නොහැකි විය' යි පසුව පසුතැවිලි නොවනු පිණිසයි\" යි වදාළ සේක. තුන්වෙනි වරටත් ඒ භික්ෂූහු නිහඬ වූහ.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි, ඇතැම් විට ශාස්තෘන් වහන්සේට ඇති ගෞරවය නිසාත් ප්‍ර‍ශ්න නොඅසන්නට පුළුවන. මහණෙනි, යහළුවෙක් වුවත් යහළුවාට තමාගේ සැකය ප්‍ර‍කාශ කරත්වා\" යි වදාළ සේක. මෙසේ වදාළ කල්හි ඒ භික්ෂූහු නිහඬ වූහ.\n\nඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ වදාළ සේක: \"අපූරුයි ස්වාමීනි, පුදුම සහගතයි ස්වාමීනි! ස්වාමීනි, මා මෙසේ පහන් වූ සිතින් සිටිමි! මේ භික්ෂු සංඝයා තුළ එක් භික්ෂුවකට වත් බුදුරජාණන් වහන්සේ කෙරෙහි හෝ ධර්මය කෙරෙහි හෝ සංඝයා කෙරෙහි හෝ මාර්ගය කෙරෙහි හෝ ප්‍රතිපදාව කෙරෙහි හෝ සැකයක් හෝ විමතියක් හෝ නැත.\" \"ආනන්දය, ඔබ මෙය කියන්නේ ප්‍ර‍සාදයෙනි. ආනන්දය, මේ භික්ෂු සංඝයා තුළ එක් භික්ෂුවකට වත් බුදුරජාණන් වහන්සේ කෙරෙහි හෝ ධර්මය කෙරෙහි හෝ සංඝයා කෙරෙහි හෝ මාර්ගය කෙරෙහි හෝ ප්‍රතිපදාව කෙරෙහි හෝ සැකයක් හෝ විමතියක් හෝ නැතැයි යනු තථාගතයාණන් වහන්සේගේ ඥානයමයි. ඇත්තෙන්ම ආනන්දය, මේ පන්සියයක් වූ භික්ෂූන් අතරින් යම් අවසාන භික්ෂුවක් වේද, ඔහු සෝවාන් වූවෙකි, නීචගාමී නොවීමේ ස්වභාවයෙන් යුක්ත වූවෙකි, නියත වශයෙන්ම සම්බෝධිය පරම කොට ඇත්තෙකි\" යි වදාළ සේක.",
      "paliTitle": "Kusinārasuttaṃ"
    },
    {
      "number": 77,
      "pali": "‘‘Cattārimāni, bhikkhave, acinteyyāni, na cintetabbāni; yāni cintento ummādassa vighātassa bhāgī assa. Katamāni cattāri? Buddhānaṃ, bhikkhave, buddhavisayo acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Jhāyissa, bhikkhave, jhānavisayo acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Kammavipāko, bhikkhave, acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Lokacintā, bhikkhave, acinteyyā, na cintetabbā; yaṃ cintento ummādassa vighātassa bhāgī assa. Imāni kho, bhikkhave, cattāri acinteyyāni, na cintetabbāni; yāni cintento ummādassa vighātassa bhāgī assā’’ti. Sattamaṃ.",
      "english": "Monks, there are these four unconjecturable things that should not be conjectured about; one who conjectures about them would be a sharer in mental derangement and distress. What are these four? Monks, the Buddha-domain of the Buddhas is unconjecturable, it should not be conjectured about; one who conjectures about it would be a sharer in mental derangement and distress. Monks, the jhana-domain of one absorbed in jhana is unconjecturable, it should not be conjectured about; one who conjectures about it would be a sharer in mental derangement and distress. Monks, the result of kamma is unconjecturable, it should not be conjectured about; one who conjectures about it would be a sharer in mental derangement and distress. Monks, speculation about the world is unconjecturable, it should not be conjectured about; one who conjectures about it would be a sharer in mental derangement and distress. Indeed, monks, these are the four unconjecturable things that should not be conjectured about; one who conjectures about them would be a sharer in mental derangement and distress.",
      "sinhala": "මහණෙනි, මේ කරුණු සතරක් සිතා බැලිය යුතු නොවන, අචින්ත්‍ය කරුණු වෙති. යමෙක් මේවා සිතා බලන්නේ නම්, ඔහු උමතුවට හා පීඩාවට භාගී වන්නේය. ඒ සතර කවරේද? මහණෙනි, බුදුවරුන්ගේ බුද්ධවිෂය අචින්ත්‍යය, සිතා බැලිය යුතු නොවේ. යමෙක් එය සිතා බලන්නේ නම්, ඔහු උමතුවට හා පීඩාවට භාගී වන්නේය. මහණෙනි, ධ්‍යානලාභී පුද්ගලයාගේ ධ්‍යානවිෂය අචින්ත්‍යය, සිතා බැලිය යුතු නොවේ. යමෙක් එය සිතා බලන්නේ නම්, ඔහු උමතුවට හා පීඩාවට භාගී වන්නේය. මහණෙනි, කර්මවිපාකය අචින්ත්‍යය, සිතා බැලිය යුතු නොවේ. යමෙක් එය සිතා බලන්නේ නම්, ඔහු උමතුවට හා පීඩාවට භාගී වන්නේය. මහණෙනි, ලෝකය පිළිබඳ සිතීම (ලෝකචින්තාව) අචින්ත්‍යය, සිතා බැලිය යුතු නොවේ. යමෙක් එය සිතා බලන්නේ නම්, ඔහු උමතුවට හා පීඩාවට භාගී වන්නේය. මහණෙනි, මේ කරුණු සතරක් සිතා බැලිය යුතු නොවන, අචින්ත්‍ය කරුණු වෙති. යමෙක් මේවා සිතා බලන්නේ නම්, ඔහු උමතුවට හා පීඩාවට භාගී වන්නේය.",
      "paliTitle": "Acinteyyasuttaṃ"
    },
    {
      "number": 78,
      "pali": "‘‘Catasso imā, bhikkhave, dakkhiṇā visuddhiyo. Katamā catasso? Atthi, bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato; atthi, bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato; atthi, bhikkhave, dakkhiṇā neva dāyakato visujjhati, no paṭiggāhakato; atthi, bhikkhave, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca. ‘‘Kathañca, bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato? Idha, bhikkhave, dāyako hoti sīlavā kalyāṇadhammo; paṭiggāhakā honti dussīlā pāpadhammā [paṭiggāhako hoti dussīlo pāpadhammo (syā. kaṃ. ka.) ma. ni. 3.381 oloketabbaṃ]. Evaṃ kho, bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato. ‘‘Kathañca, bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato? Idha, bhikkhave, dāyako hoti dussīlo pāpadhammo; paṭiggāhakā honti sīlavanto kalyāṇadhammā. Evaṃ kho, bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato. ‘‘Kathañca, bhikkhave, dakkhiṇā neva dāyakato visujjhati, no paṭiggāhakato? Idha, bhikkhave, dāyako hoti dussīlo pāpadhammo; paṭiggāhakāpi honti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, dakkhiṇā neva dāyakato visujjhati, no paṭiggāhakato. ‘‘Kathañca, bhikkhave, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca? Idha, bhikkhave, dāyako hoti sīlavā kalyāṇadhammo; paṭiggāhakāpi honti sīlavanto kalyāṇadhammā. Evaṃ kho, bhikkhave, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca. Imā kho, bhikkhave, catasso dakkhiṇā visuddhiyo’’ti. Aṭṭhamaṃ.",
      "english": "These, bhikkhus, are four purifications of gifts. Which four?\n\nThere is, bhikkhus, a gift that is purified on the part of the giver, but not on the part of the recipient; there is, bhikkhus, a gift that is purified on the part of the recipient, but not on the part of the giver; there is, bhikkhus, a gift that is purified neither on the part of the giver nor on the part of the recipient; and there is, bhikkhus, a gift that is purified both on the part of the giver and on the part of the recipient.\n\nAnd how, bhikkhus, is a gift purified on the part of the giver, but not on the part of the recipient? Here, bhikkhus, the giver is virtuous, of good character; the recipients are immoral, of bad character. Thus, bhikkhus, is a gift purified on the part of the giver, but not on the part of the recipient.\n\nAnd how, bhikkhus, is a gift purified on the part of the recipient, but not on the part of the giver? Here, bhikkhus, the giver is immoral, of bad character; the recipients are virtuous, of good character. Thus, bhikkhus, is a gift purified on the part of the recipient, but not on the part of the giver.\n\nAnd how, bhikkhus, is a gift purified neither on the part of the giver nor on the part of the recipient? Here, bhikkhus, the giver is immoral, of bad character; and the recipients are also immoral, of bad character. Thus, bhikkhus, is a gift purified neither on the part of the giver nor on the part of the recipient.\n\nAnd how, bhikkhus, is a gift purified both on the part of the giver and on the part of the recipient? Here, bhikkhus, the giver is virtuous, of good character; and the recipients are also virtuous, of good character. Thus, bhikkhus, is a gift purified both on the part of the giver and on the part of the recipient. These, bhikkhus, are the four purifications of gifts.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ දක්ෂිණා විශුද්ධි සතරකි. ඒ සතර කවරේද? භික්ෂූන් වහන්ස, දායකයාගෙන් විශුද්ධ වන, ප්‍රතිග්‍රාහකයාගෙන් විශුද්ධ නොවන දක්ෂිණාවක් ඇත; භික්ෂූන් වහන්ස, ප්‍රතිග්‍රාහකයාගෙන් විශුද්ධ වන, දායකයාගෙන් විශුද්ධ නොවන දක්ෂිණාවක් ඇත; භික්ෂූන් වහන්ස, දායකයාගෙන් හෝ ප්‍රතිග්‍රාහකයාගෙන් යන දෙපක්ෂයෙන්ම විශුද්ධ නොවන දක්ෂිණාවක් ඇත; භික්ෂූන් වහන්ස, දායකයාගෙන්ද, ප්‍රතිග්‍රාහකයාගෙන්ද යන දෙපක්ෂයෙන්ම විශුද්ධ වන දක්ෂිණාවක් ඇත.\n\nභික්ෂූන් වහන්ස, දක්ෂිණාවක් දායකයාගෙන් විශුද්ධ වන්නේ ප්‍රතිග්‍රාහකයාගෙන් විශුද්ධ නොවන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහි දායකයා සිල්වත්, කල්‍යාණ ධර්මයෙන් යුක්ත වේ; ප්‍රතිග්‍රාහකයෝ දුස්සීල, පාප ධර්මයන්ගෙන් යුක්ත වෙති. භික්ෂූන් වහන්ස, මෙසේ දක්ෂිණාව දායකයාගෙන් විශුද්ධ වේ, ප්‍රතිග්‍රාහකයාගෙන් විශුද්ධ නොවේ.\n\nභික්ෂූන් වහන්ස, දක්ෂිණාවක් ප්‍රතිග්‍රාහකයාගෙන් විශුද්ධ වන්නේ දායකයාගෙන් විශුද්ධ නොවන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහි දායකයා දුස්සීල, පාප ධර්මයන්ගෙන් යුක්ත වේ; ප්‍රතිග්‍රාහකයෝ සිල්වත්, කල්‍යාණ ධර්මයන්ගෙන් යුක්ත වෙති. භික්ෂූන් වහන්ස, මෙසේ දක්ෂිණාව ප්‍රතිග්‍රාහකයාගෙන් විශුද්ධ වේ, දායකයාගෙන් විශුද්ධ නොවේ.\n\nභික්ෂූන් වහන්ස, දක්ෂිණාවක් දායකයාගෙන් හෝ ප්‍රතිග්‍රාහකයාගෙන් යන දෙපක්ෂයෙන්ම විශුද්ධ නොවන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහි දායකයා දුස්සීල, පාප ධර්මයන්ගෙන් යුක්ත වේ; ප්‍රතිග්‍රාහකයෝද දුස්සීල, පාප ධර්මයන්ගෙන් යුක්ත වෙති. භික්ෂූන් වහන්ස, මෙසේ දක්ෂිණාව දායකයාගෙන් හෝ ප්‍රතිග්‍රාහකයාගෙන් යන දෙපක්ෂයෙන්ම විශුද්ධ නොවේ.\n\nභික්ෂූන් වහන්ස, දක්ෂිණාවක් දායකයාගෙන්ද, ප්‍රතිග්‍රාහකයාගෙන්ද යන දෙපක්ෂයෙන්ම විශුද්ධ වන්නේ කෙසේද? භික්ෂූන් වහන්ස, මෙහි දායකයා සිල්වත්, කල්‍යාණ ධර්මයෙන් යුක්ත වේ; ප්‍රතිග්‍රාහකයෝද සිල්වත්, කල්‍යාණ ධර්මයන්ගෙන් යුක්ත වෙති. භික්ෂූන් වහන්ස, මෙසේ දක්ෂිණාව දායකයාගෙන්ද, ප්‍රතිග්‍රාහකයාගෙන්ද යන දෙපක්ෂයෙන්ම විශුද්ධ වේ. භික්ෂූන් වහන්ස, මේ දක්ෂිණා විශුද්ධි සතර වන්නේය.",
      "paliTitle": "Dakkhiṇasuttaṃ"
    },
    {
      "number": 79,
      "pali": "Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā chedagāminī hoti? Ko pana, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā na yathādhippāyā [yathādhippāyaṃ (sī.)] hoti? Ko nu kho, bhante hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā yathādhippāyā [yathādhippāyaṃ (sī.)] hoti? Ko pana, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā parādhippāyā hotī’’ti? ‘‘Idha, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ na deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti chedagāminī. ‘‘Idha pana, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ na yathādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa na hoti yathādhippāyā [yathādhippāyaṃ (sī. ka.)]. ‘‘Idha pana, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ yathādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti yathādhippāyā [yathādhippāyaṃ (sī. ka.)]. ‘‘Idha, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ parādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti parādhippāyā [parādhippāyaṃ (ka.)]. ‘‘Ayaṃ kho, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā chedagāminī hoti. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā na yathādhippāyā hoti. Ayaṃ kho pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā yathādhippāyā hoti. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā parādhippāyā hotī’’ti. Navamaṃ.",
      "english": "Then, the Venerable Sāriputta approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, the Venerable Sāriputta said this to the Blessed One: \"What, Venerable Sir, is the reason, what is the cause, by which for some person, a certain trade undertaken results in ruin? And what, Venerable Sir, is the reason, what is the cause, by which for some person, a certain trade undertaken does not turn out as intended? What, Venerable Sir, is the reason, what is the cause, by which for some person, a certain trade undertaken turns out as intended? And what, Venerable Sir, is the reason, what is the cause, by which for some person, a certain trade undertaken turns out even better than intended?\"\n\n\"Here, Sāriputta, some person approaches an ascetic or a brahmin and invites them, saying: ‘Venerable Sir, please tell me your needs for requisites.’ But what he invites them to request, that he does not give. If, having passed away from that state, he comes to this present state of existence, whatever trade he undertakes, that results in ruin for him.\n\nAgain, Sāriputta, some person approaches an ascetic or a brahmin and invites them, saying: ‘Venerable Sir, please tell me your needs for requisites.’ But what he invites them to request, that he does not give as intended. If, having passed away from that state, he comes to this present state of existence, whatever trade he undertakes, that does not turn out as intended for him.\n\nAgain, Sāriputta, some person approaches an ascetic or a brahmin and invites them, saying: ‘Venerable Sir, please tell me your needs for requisites.’ And what he invites them to request, that he gives as intended. If, having passed away from that state, he comes to this present state of existence, whatever trade he undertakes, that turns out as intended for him.\n\nHere, Sāriputta, some person approaches an ascetic or a brahmin and invites them, saying: ‘Venerable Sir, please tell me your needs for requisites.’ And what he invites them to request, that he gives even better than intended. If, having passed away from that state, he comes to this present state of existence, whatever trade he undertakes, that turns out even better than intended for him.\n\nThis, Sāriputta, is the reason, this is the cause, by which for some person, a certain trade undertaken results in ruin. And this, Sāriputta, is the reason, this is the cause, by which for some person, a certain trade undertaken does not turn out as intended. And this, Sāriputta, is the reason, this is the cause, by which for some person, a certain trade undertaken turns out as intended. And this, Sāriputta, is the reason, this is the cause, by which for some person, a certain trade undertaken turns out even better than intended.\"",
      "sinhala": "එවිට ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූ සේක. එක් පසෙකින් වාඩි වී සිටි ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක – \"ස්වාමීනි, කවර හේතුවකින්ද, කවර ප්‍රත්‍යයකින්ද, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් අලාභයට පත්වන්නේ? ස්වාමීනි, කවර හේතුවකින්ද, කවර ප්‍රත්‍යයකින්ද, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් බලාපොරොත්තු වූ අයුරින් සිදු නොවන්නේ? ස්වාමීනි, කවර හේතුවකින්ද, කවර ප්‍රත්‍යයකින්ද, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් බලාපොරොත්තු වූ අයුරින් සිදු වන්නේ? ස්වාමීනි, කවර හේතුවකින්ද, කවර ප්‍රත්‍යයකින්ද, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් බලාපොරොත්තු වූවාටත් වඩා හොඳින් සිදු වන්නේ?\"\n\n\"සාරිපුත්තය, මෙහිලා යම් කිසිවෙක් මහණකු හෝ බමුණකු හෝ වෙත එළඹ, 'ස්වාමීනි, සිව්පසයකින් කටයුතු කරන්න' යැයි ආරාධනා කරයි. ඔහු ආරාධනා කළ දේ නොදෙයි. ඔහු එතැනින් චුත වී මිනිස් ලොවට පැමිණියහොත්, ඔහු යම්කිසි වෙළෙඳාමක් කරන්නේද, එය අලාභයට පත්වන්නේය.\n\nසාරිපුත්තය, මෙහිලා යම් කිසිවෙක් මහණකු හෝ බමුණකු හෝ වෙත එළඹ, 'ස්වාමීනි, සිව්පසයකින් කටයුතු කරන්න' යැයි ආරාධනා කරයි. ඔහු ආරාධනා කළ දේ බලාපොරොත්තු වූ අයුරින් නොදෙයි. ඔහු එතැනින් චුත වී මිනිස් ලොවට පැමිණියහොත්, ඔහු යම්කිසි වෙළෙඳාමක් කරන්නේද, එය ඔහු බලාපොරොත්තු වූ අයුරින් සිදු නොවන්නේය.\n\nසාරිපුත්තය, මෙහිලා යම් කිසිවෙක් මහණකු හෝ බමුණකු හෝ වෙත එළඹ, 'ස්වාමීනි, සිව්පසයකින් කටයුතු කරන්න' යැයි ආරාධනා කරයි. ඔහු ආරාධනා කළ දේ බලාපොරොත්තු වූ අයුරින්ම දෙයි. ඔහු එතැනින් චුත වී මිනිස් ලොවට පැමිණියහොත්, ඔහු යම්කිසි වෙළෙඳාමක් කරන්නේද, එය ඔහු බලාපොරොත්තු වූ අයුරින්ම සිදු වන්නේය.\n\nසාරිපුත්තය, මෙහිලා යම් කිසිවෙක් මහණකු හෝ බමුණකු හෝ වෙත එළඹ, 'ස්වාමීනි, සිව්පසයකින් කටයුතු කරන්න' යැයි ආරාධනා කරයි. ඔහු ආරාධනා කළ දේ බලාපොරොත්තු වූවාටත් වඩා හොඳින් දෙයි. ඔහු එතැනින් චුත වී මිනිස් ලොවට පැමිණියහොත්, ඔහු යම්කිසි වෙළෙඳාමක් කරන්නේද, එය ඔහු බලාපොරොත්තු වූවාටත් වඩා හොඳින් සිදු වන්නේය.\n\nසාරිපුත්තය, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් අලාභයට පත්වන්නේ, මේ හේතුවෙන් සහ මේ ප්‍රත්‍යයෙන්ය. සාරිපුත්තය, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් බලාපොරොත්තු වූ අයුරින් සිදු නොවන්නේ, මේ හේතුවෙන් සහ මේ ප්‍රත්‍යයෙන්ය. සාරිපුත්තය, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් බලාපොරොත්තු වූ අයුරින් සිදු වන්නේ, මේ හේතුවෙන් සහ මේ ප්‍රත්‍යයෙන්ය. සාරිපුත්තය, යම් කිසිවකු විසින් කරන ලද එවැනි වෙළෙඳාමක් බලාපොරොත්තු වූවාටත් වඩා හොඳින් සිදු වන්නේ, මේ හේතුවෙන් සහ මේ ප්‍රත්‍යයෙන්ය.\"",
      "paliTitle": "Vaṇijjasuttaṃ"
    },
    {
      "number": 80,
      "pali": "Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Ko nu kho, bhante, hetu ko paccayo, yena mātugāmo neva sabhāyaṃ nisīdati, na kammantaṃ payojeti, na kambojaṃ gacchatī’’ti? ‘‘Kodhano, ānanda, mātugāmo; issukī, ānanda, mātugāmo; maccharī, ānanda, mātugāmo; duppañño, ānanda, mātugāmo – ayaṃ kho, ānanda, hetu ayaṃ paccayo, yena mātugāmo neva sabhāyaṃ nisīdati, na kammantaṃ payojeti, na kambojaṃ gacchatī’’ti. Dasamaṃ. ",
      "english": "At one time, the Blessed One was dwelling in Kosambi, at Ghosita's monastery. Then the Venerable Ananda approached the Blessed One, saluted him, and sat down to one side. As he was sitting to one side, the Venerable Ananda said this to the Blessed One: \"What, Venerable Sir, is the reason, what is the cause, by which women do not sit in the assembly, do not engage in business, and do not venture forth to trade and travel?\"\n\n\"Women, Ananda, are prone to anger; women, Ananda, are prone to envy; women, Ananda, are prone to avarice; women, Ananda, are lacking in discernment. This, Ananda, is the reason, this is the cause, by which women do not sit in the assembly, do not engage in business, and do not venture forth to trade and travel.\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ කොසඹෑ නුවර ඝෝසිතාරාමයේ වැඩසිටින සේක. ඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියහ; පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙක වාඩිවූහ.\n\nඑකත්පසෙක වාඩිවූ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ – \"භාග්‍යවතුන් වහන්ස, ස්ත්‍රියක් සභාවක වාඩි නොවන්නට, කර්මාන්තයක නොයෙදෙන්නට, කම්බෝජ රටට නොයන්නට කවර හේතුවක්ද, කවර ප්‍රත්‍යයක්ද?\" \"ආනන්දය, ස්ත්‍රිය ක්‍රෝධ ඇත්තීය; ආනන්දය, ස්ත්‍රිය ඊර්ෂ්‍යා ඇත්තීය; ආනන්දය, ස්ත්‍රිය මසුරුය; ආනන්දය, ස්ත්‍රිය දුර්වල ප්‍රඥා ඇත්තීය. ආනන්දය, ස්ත්‍රියක් සභාවක වාඩි නොවන්නට, කර්මාන්තයක නොයෙදෙන්නට, කම්බෝජ රටට නොයන්නට මෙයයි ඒ හේතුව, මෙයයි ඒ ප්‍රත්‍යය.\"",
      "paliTitle": "Kambojasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Apaṇṇakavaggo tatiyo. Tassuddānaṃ – Padhānaṃ diṭṭhisappurisa, vadhukā dve ca honti aggāni; Kusināraacinteyyā, dakkhiṇā ca vaṇijjā kambojanti.",
    "english": "",
    "sinhala": ""
  }
}