{
  "id": "an4.24",
  "title": {
    "pali": "Kammavaggo",
    "english": "The Chapter on Kamma",
    "sinhala": "කර්ම වග්ගය"
  },
  "sections": [
    {
      "number": 232,
      "pali": "‘‘Cattārimāni, bhikkhave, kammāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Atthi, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ; atthi, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ; atthi, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ; atthi, bhikkhave, kammaṃ akaṇhaasukkaṃ [akaṇhaṃ asukkaṃ (sī. syā. pī.) (dī. ni. 3.312; ma. ni. 2.81)] akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Imāni kho, bhikkhave, cattāri kammāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Paṭhamaṃ.",
      "english": "Monks, these four types of kamma have been declared by me, having directly known and personally realized them. Which four?\n\nMonks, there is kamma that is dark with dark results. Monks, there is kamma that is bright with bright results. Monks, there is kamma that is dark and bright with dark and bright results. Monks, there is kamma that is neither dark nor bright, with neither dark nor bright results, leading to the cessation of kamma. Indeed, monks, these are the four types of kamma that have been declared by me, having directly known and personally realized them.",
      "sinhala": "මහණෙනි, මා විසින්ම අභිඥාවෙන් පසක් කොට ප්‍රකාශ කරන ලද කර්ම සතරක් මේවායි. ඒ සතර කවරේද? මහණෙනි, කළු වූ, කළු විපාක දෙන කර්මයක් ඇත. මහණෙනි, සුදු වූ, සුදු විපාක දෙන කර්මයක් ඇත. මහණෙනි, කළු ද සුදු ද වූ, කළු ද සුදු ද විපාක දෙන කර්මයක් ඇත. මහණෙනි, කළු ද නොවන සුදු ද නොවන, කළු ද නොවන සුදු ද නොවන විපාක දෙන, කර්ම ක්‍ෂය කිරීම පිණිස පවතින කර්මයක් ඇත. මහණෙනි, මා විසින්ම අභිඥාවෙන් පසක් කොට ප්‍රකාශ කරන ලද්දේ මේ කර්ම සතරයි.",
      "paliTitle": "Saṃkhittasuttaṃ",
      "englishTitle": "Brief Discourse",
      "sinhalaTitle": "සංක‍්ෂිප්ත සූත‍්‍රය"
    },
    {
      "number": 233,
      "pali": "‘‘Cattārimāni, bhikkhave, kammāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Atthi, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ; atthi, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ; atthi, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ; atthi, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ? Idha, bhikkhave, ekacco sabyābajjhaṃ [sabyāpajjhaṃ (sabbattha)] kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhaṃ lokaṃ upapajjati. Tamenaṃ sabyābajjhaṃ lokaṃ upapannaṃ samānaṃ sabyābajjhā phassā phusanti. So sabyābajjhehi phassehi phuṭṭho samāno sabyābajjhaṃ vedanaṃ vediyati [vedayati (ka.) a. ni. 6.63] ekantadukkhaṃ, seyyathāpi sattā nerayikā. Idaṃ vuccati, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ? Idha, bhikkhave, ekacco abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā abyābajjhaṃ lokaṃ upapajjati. Tamenaṃ abyābajjhaṃ lokaṃ upapannaṃ samānaṃ abyābajjhā phassā phusanti. So abyābajjhehi phassehi phuṭṭho samāno abyābajjhaṃ vedanaṃ vediyati ekantasukhaṃ, seyyathāpi devā subhakiṇhā. Idaṃ vuccati, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ? Idha, bhikkhave, ekacco sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhampi abyābajjhampi lokaṃ upapajjati. Tamenaṃ sabyābajjhampi abyābajjhampi lokaṃ upapannaṃ samānaṃ sabyābajjhāpi abyābajjhāpi phassā phusanti. So sabyābajjhehipi abyābajjhehipi phassehi phuṭṭho samāno sabyābajjhampi abyābajjhampi vedanaṃ vediyati vokiṇṇasukhadukkhaṃ, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Idaṃ vuccati, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati? Tatra, bhikkhave, yamidaṃ kammaṃ kaṇhaṃ kaṇhavipākaṃ tassa pahānāya yā cetanā, yamidaṃ [yampidaṃ (sī. syā. kaṃ. pī.)] kammaṃ sukkaṃ sukkavipākaṃ tassa pahānāya yā cetanā, yamidaṃ [yampidaṃ (sī. syā. kaṃ. pī.)] kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ tassa pahānāya yā cetanā – idaṃ vuccati, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Imāni kho, bhikkhave, cattāri kammāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, these four types of kamma have been declared by me, having realized and personally experienced them through direct knowledge. What are these four? There is, bhikkhus, dark kamma with dark result. There is, bhikkhus, bright kamma with bright result. There is, bhikkhus, dark and bright kamma with dark and bright result. There is, bhikkhus, kamma that is neither dark nor bright, with neither dark nor bright result, leading to the exhaustion of kamma.\n\nAnd what, bhikkhus, is dark kamma with dark result? Here, bhikkhus, some individual performs an afflicted bodily volitional formation, performs an afflicted verbal volitional formation, and performs an afflicted mental volitional formation. Having performed an afflicted bodily volitional formation, having performed an afflicted verbal volitional formation, and having performed an afflicted mental volitional formation, that person is reborn into an afflicted realm. When that person has been reborn into an afflicted realm, afflicted contacts assail them. Being assailed by afflicted contacts, that person experiences an exclusively painful feeling, just as do beings in hell. This, bhikkhus, is called dark kamma with dark result.\n\nAnd what, bhikkhus, is bright kamma with bright result? Here, bhikkhus, some individual performs an unafflicted bodily volitional formation, performs an unafflicted verbal volitional formation, and performs an unafflicted mental volitional formation. Having performed an unafflicted bodily volitional formation, having performed an unafflicted verbal volitional formation, and having performed an unafflicted mental volitional formation, that person is reborn into an unafflicted realm. When that person has been reborn into an unafflicted realm, unafflicted contacts assail them. Being assailed by unafflicted contacts, that person experiences an exclusively pleasant feeling, just as do the Radiant Devas. This, bhikkhus, is called bright kamma with bright result.\n\nAnd what, bhikkhus, is dark and bright kamma with dark and bright result? Here, bhikkhus, some individual performs both afflicted and unafflicted bodily volitional formations, performs both afflicted and unafflicted verbal volitional formations, and performs both afflicted and unafflicted mental volitional formations. Having performed both afflicted and unafflicted bodily volitional formations, having performed both afflicted and unafflicted verbal volitional formations, and having performed both afflicted and unafflicted mental volitional formations, that person is reborn into a realm that is both afflicted and unafflicted. When that person has been reborn into a realm that is both afflicted and unafflicted, both afflicted and unafflicted contacts assail them. Being assailed by both afflicted and unafflicted contacts, that person experiences a feeling mixed with pleasure and pain, just as do human beings, and certain devas, and certain beings in the states of deprivation. This, bhikkhus, is called dark and bright kamma with dark and bright result.\n\nAnd what, bhikkhus, is kamma that is neither dark nor bright, with neither dark nor bright result, leading to the exhaustion of kamma? In this regard, bhikkhus, the volition for the abandoning of this dark kamma with dark result, the volition for the abandoning of this bright kamma with bright result, and the volition for the abandoning of this dark and bright kamma with dark and bright result – this, bhikkhus, is called kamma that is neither dark nor bright, with neither dark nor bright result, leading to the exhaustion of kamma. Indeed, bhikkhus, these are the four types of kamma that have been declared by me, having realized and personally experienced them through direct knowledge.",
      "sinhala": "භික්‍ෂූනි, මා විසින් අභිඥා ඥානයෙන් ස්වයංව ප්‍රත්‍යක්‍ෂ කොට දේශනා කරන ලද්දා වූ මේ කර්ම සතරක් වෙති. කවරේද ඒ සතර? භික්‍ෂූනි, කළු වූ, කළු විපාක දෙන කර්මයක් ඇත. භික්‍ෂූනි, සුදු වූ, සුදු විපාක දෙන කර්මයක් ඇත. භික්‍ෂූනි, කළු සුදු වූ, කළු සුදු විපාක දෙන කර්මයක් ඇත. භික්‍ෂූනි, කළු ද නොවූ, සුදු ද නොවූ, කළු ද නොවූ සුදු ද නොවූ විපාක දෙන, කර්මක්‍ෂය සඳහා පවතින කර්මයක් ඇත.\n\nභික්‍ෂූනි, කළු වූ, කළු විපාක දෙන කර්මය කවරේද? භික්‍ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් පීඩා සහිත වූ කාය සංඛාරයන් (කයට අයත් ක්‍රියා) සිදු කරයි. පීඩා සහිත වූ වචී සංඛාරයන් (වචනයට අයත් ක්‍රියා) සිදු කරයි. පීඩා සහිත වූ මනෝ සංඛාරයන් (සිතට අයත් ක්‍රියා) සිදු කරයි. හෙතෙම පීඩා සහිත වූ කාය සංඛාරයන් සිදු කොට, පීඩා සහිත වූ වචී සංඛාරයන් සිදු කොට, පීඩා සහිත වූ මනෝ සංඛාරයන් සිදු කොට, පීඩා සහිත ලෝකයක උපදියි. පීඩා සහිත ඒ ලෝකයේ උපන් ඔහුට පීඩා සහිත වූ ස්පර්ශයන් ස්පර්ශ වෙයි. හෙතෙම පීඩා සහිත ස්පර්ශයන්ගෙන් ස්පර්ශ වූයේ පීඩා සහිත වූ වේදනාවක්, ඒකාන්තයෙන් දුක් සහගත වූ වේදනාවක් විඳියි. යම්සේ නිරයේ සත්ත්වයෝ මෙන් ය. භික්‍ෂූනි, මේ කර්මය කළු වූ, කළු විපාක දෙන කර්මය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, සුදු වූ, සුදු විපාක දෙන කර්මය කවරේද? භික්‍ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් පීඩා රහිත වූ කාය සංඛාරයන් සිදු කරයි. පීඩා රහිත වූ වචී සංඛාරයන් සිදු කරයි. පීඩා රහිත වූ මනෝ සංඛාරයන් සිදු කරයි. හෙතෙම පීඩා රහිත වූ කාය සංඛාරයන් සිදු කොට, පීඩා රහිත වූ වචී සංඛාරයන් සිදු කොට, පීඩා රහිත වූ මනෝ සංඛාරයන් සිදු කොට, පීඩා රහිත ලෝකයක උපදියි. පීඩා රහිත ඒ ලෝකයේ උපන් ඔහුට පීඩා රහිත වූ ස්පර්ශයන් ස්පර්ශ වෙයි. හෙතෙම පීඩා රහිත ස්පර්ශයන්ගෙන් ස්පර්ශ වූයේ පීඩා රහිත වූ වේදනාවක්, ඒකාන්තයෙන් සුව සහගත වූ වේදනාවක් විඳියි. යම්සේ සුභකිණ්හ (සුභකිණ්හක) දෙවියන් මෙන් ය. භික්‍ෂූනි, මේ කර්මය සුදු වූ, සුදු විපාක දෙන කර්මය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, කළු සුදු වූ, කළු සුදු විපාක දෙන කර්මය කවරේද? භික්‍ෂූනි, මෙහිලා ඇතැම් පුද්ගලයෙක් පීඩා සහිත ද, පීඩා රහිත ද වූ කාය සංඛාරයන් සිදු කරයි. පීඩා සහිත ද, පීඩා රහිත ද වූ වචී සංඛාරයන් සිදු කරයි. පීඩා සහිත ද, පීඩා රහිත ද වූ මනෝ සංඛාරයන් සිදු කරයි. හෙතෙම පීඩා සහිත ද, පීඩා රහිත ද වූ කාය සංඛාරයන් සිදු කොට, පීඩා සහිත ද, පීඩා රහිත ද වූ වචී සංඛාරයන් සිදු කොට, පීඩා සහිත ද, පීඩා රහිත ද වූ මනෝ සංඛාරයන් සිදු කොට, පීඩා සහිත ද, පීඩා රහිත ද වූ ලෝකයක උපදියි. පීඩා සහිත ද, පීඩා රහිත ද වූ ඒ ලෝකයේ උපන් ඔහුට පීඩා සහිත ද, පීඩා රහිත ද වූ ස්පර්ශයන් ස්පර්ශ වෙයි. හෙතෙම පීඩා සහිත ද, පීඩා රහිත ද වූ ස්පර්ශයන්ගෙන් ස්පර්ශ වූයේ පීඩා සහිත ද, පීඩා රහිත ද වූ වේදනාවක්, සුඛ-දුක්ඛ මිශ්‍ර වූ වේදනාවක් විඳියි. යම්සේ මිනිසුන් මෙන් ය, සමහර දෙවියන් හා සමහර විනිපාතිකයන් (දුගතිගාමීන්) මෙන් ය. භික්‍ෂූනි, මේ කර්මය කළු සුදු වූ, කළු සුදු විපාක දෙන කර්මය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, කළු ද නොවූ, සුදු ද නොවූ, කළු ද නොවූ සුදු ද නොවූ විපාක දෙන, කර්මක්‍ෂය සඳහා පවතින කර්මය කවරේද? භික්‍ෂූනි, එහිලා කළු වූ, කළු විපාක දෙන යම් කර්මයක් ඇද්ද, එය ප්‍රහාණය කිරීම පිණිස යම් චේතනාවක් ඇද්ද, සුදු වූ, සුදු විපාක දෙන යම් කර්මයක් ඇද්ද, එය ප්‍රහාණය කිරීම පිණිස යම් චේතනාවක් ඇද්ද, කළු සුදු වූ, කළු සුදු විපාක දෙන යම් කර්මයක් ඇද්ද, එය ප්‍රහාණය කිරීම පිණිස යම් චේතනාවක් ඇද්ද – භික්‍ෂූනි, මේ කර්මය කළු ද නොවූ, සුදු ද නොවූ, කළු ද නොවූ සුදු ද නොවූ විපාක දෙන, කර්මක්‍ෂය සඳහා පවතින කර්මය යැයි කියනු ලැබේ. භික්‍ෂූනි, මා විසින් අභිඥා ඥානයෙන් ස්වයංව ප්‍රත්‍යක්‍ෂ කොට දේශනා කරන ලද්දා වූ මේ කර්ම සතර නම් මේවා ය.",
      "paliTitle": "Vitthārasuttaṃ",
      "englishTitle": "The Expanded Discourse",
      "sinhalaTitle": "විස්තර සූත්‍රය"
    },
    {
      "number": 234,
      "pali": "Atha kho sikhāmoggallāno brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sikhāmoggallāno brāhmaṇo bhagavantaṃ etadavoca – ‘‘Purimāni, bho gotama, divasāni purimatarāni soṇakāyano māṇavo yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘samaṇo gotamo sabbakammānaṃ akiriyaṃ paññapeti, sabbakammānaṃ kho pana akiriyaṃ paññapento ucchedaṃ āha lokassa – kammasaccāyaṃ [kammasaccāyī (ka.)], bho, loko kammasamārambhaṭṭhāyī’’’ti. ‘‘Dassanampi kho ahaṃ, brāhmaṇa, soṇakāyanassa māṇavassa nābhijānāmi; kuto panevarūpo kathāsallāpo! Cattārimāni, brāhmaṇa, kammāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Atthi, brāhmaṇa, kammaṃ kaṇhaṃ kaṇhavipākaṃ; atthi, brāhmaṇa, kammaṃ sukkaṃ sukkavipākaṃ; atthi, brāhmaṇa, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ; atthi, brāhmaṇa, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. ‘‘Katamañca, brāhmaṇa, kammaṃ kaṇhaṃ kaṇhavipākaṃ? Idha, brāhmaṇa, ekacco sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhaṃ lokaṃ upapajjati. Tamenaṃ sabyābajjhaṃ lokaṃ upapannaṃ samānaṃ sabyābajjhā phassā phusanti. So sabyābajjhehi phassehi phuṭṭho samāno sabyābajjhaṃ vedanaṃ vediyati ekantadukkhaṃ, seyyathāpi sattā nerayikā. Idaṃ vuccati, brāhmaṇa, kammaṃ kaṇhaṃ kaṇhavipākaṃ. ‘‘Katamañca, brāhmaṇa, kammaṃ sukkaṃ sukkavipākaṃ? Idha, brāhmaṇa, ekacco abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā abyābajjhaṃ lokaṃ upapajjati. Tamenaṃ abyābajjhaṃ lokaṃ upapannaṃ samānaṃ abyābajjhā phassā phusanti. So abyābajjhehi phassehi phuṭṭho samāno abyābajjhaṃ vedanaṃ vediyati ekantasukhaṃ, seyyathāpi devā subhakiṇhā. Idaṃ vuccati, brāhmaṇa, kammaṃ sukkaṃ sukkavipākaṃ. ‘‘Katamañca, brāhmaṇa, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ? Idha, brāhmaṇa, ekacco sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhampi abyābajjhampi lokaṃ upapajjati. Tamenaṃ sabyābajjhampi abyābajjhampi lokaṃ upapannaṃ samānaṃ sabyābajjhāpi abyābajjhāpi phassā phusanti. So sabyābajjhehipi abyābajjhehipi phassehi phuṭṭho samāno sabyābajjhampi abyābajjhampi vedanaṃ vediyati vokiṇṇasukhadukkhaṃ, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Idaṃ vuccati, brāhmaṇa, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ. ‘‘Katamañca, brāhmaṇa, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati? Tatra, brāhmaṇa, yamidaṃ kammaṃ kaṇhaṃ kaṇhavipākaṃ tassa pahānāya yā cetanā, yamidaṃ kammaṃ sukkaṃ sukkavipākaṃ tassa pahānāya yā cetanā, yamidaṃ kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ tassa pahānāya yā cetanā – idaṃ vuccati, brāhmaṇa, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Imāni kho, brāhmaṇa, cattāri kammāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Tatiyaṃ.",
      "english": "Then, the brahmin Sikha Moggallana approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable talk, he sat down to one side. Seated to one side, the brahmin Sikha Moggallana said to the Blessed One: \"Reverend Gotama, some days ago, even earlier than that, the young man Sonakayana approached me. Having approached, he said to me: 'The recluse Gotama teaches the non-doing of all actions, and by teaching the non-doing of all actions, he proclaims the annihilation of the world. Reverend sir, the world is established by action, sustained by the initiation of actions.'\"\n\n\"Indeed, brahmin, I do not even know of having seen the young man Sonakayana; how then could there have been such a conversation? These four actions, brahmin, have been declared by me after having directly known and realized them for myself. Which are these four? There is, brahmin, dark action with dark results; there is, brahmin, bright action with bright results; there is, brahmin, dark and bright action with dark and bright results; there is, brahmin, neither dark nor bright action with neither dark nor bright results, leading to the cessation of kamma.\"\n\n\"And what, brahmin, is dark action with dark results? Here, brahmin, someone performs an afflictive bodily formation, performs an afflictive verbal formation, performs an afflictive mental formation. Having performed an afflictive bodily formation, having performed an afflictive verbal formation, having performed an afflictive mental formation, he is reborn in an afflictive world. When he is reborn in an afflictive world, afflictive contacts touch him. Being touched by afflictive contacts, he experiences purely painful feeling, just like beings in hell. This is called, brahmin, dark action with dark results.\"\n\n\"And what, brahmin, is bright action with bright results? Here, brahmin, someone performs a non-afflictive bodily formation, performs a non-afflictive verbal formation, performs a non-afflictive mental formation. Having performed a non-afflictive bodily formation, having performed a non-afflictive verbal formation, having performed a non-afflictive mental formation, he is reborn in a non-afflictive world. When he is reborn in a non-afflictive world, non-afflictive contacts touch him. Being touched by non-afflictive contacts, he experiences purely pleasant feeling, just like the Subhakinha devas. This is called, brahmin, bright action with bright results.\"\n\n\"And what, brahmin, is dark and bright action with dark and bright results? Here, brahmin, someone performs both an afflictive and non-afflictive bodily formation, performs both an afflictive and non-afflictive verbal formation, performs both an afflictive and non-afflictive mental formation. Having performed both an afflictive and non-afflictive bodily formation, having performed both an afflictive and non-afflictive verbal formation, having performed both an afflictive and non-afflictive mental formation, he is reborn in a world that is both afflictive and non-afflictive. When he is reborn in a world that is both afflictive and non-afflictive, both afflictive and non-afflictive contacts touch him. Being touched by both afflictive and non-afflictive contacts, he experiences feeling mixed with pleasure and pain, just like human beings, some devas, and some in the lower realms. This is called, brahmin, dark and bright action with dark and bright results.\"\n\n\"And what, brahmin, is neither dark nor bright action with neither dark nor bright results, leading to the cessation of kamma? In this regard, brahmin, it is the volition for abandoning that dark action with dark results, the volition for abandoning that bright action with bright results, and the volition for abandoning that dark and bright action with dark and bright results. This is called, brahmin, neither dark nor bright action with neither dark nor bright results, leading to the cessation of kamma. These, brahmin, are the four actions declared by me after having directly known and realized them for myself.\"",
      "sinhala": "එවිට ශිඛාමො​ග්ග​ල්ලාන බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බහ නිමවා එකත්පස්ව හුන්නේය. එකත්පස්ව හුන් ශිඛාමො​ග්ග​ල්ලාන බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"භවත් ගෞතමයන් වහන්ස, මීට පෙර දිනවල, ඊටත් පෙර දිනක, සෝණකායන නම් මානවකයා මා සිටි තැනට පැමිණියේය. පැමිණ මට මෙය කීවේය: ‘ශ්‍රමණයන් වහන්සේ ගෞතමයන් වහන්සේ සියලු කර්මයන්හි අකර්මණ්‍ය භාවය ප්‍රකාශ කරන සේක. (එනම් කර්මයක් නොකළ යුතු බව පවසන සේක.) සියලු කර්මයන්හි අකර්මණ්‍ය භාවය ප්‍රකාශ කරන්නා වූ ඒ ශ්‍රමණයන් වහන්සේ ලෝකයාගේ උච්ඡේදයක් (විනාශයක්) පවසන සේක. භවත්නි, මේ ලෝකය කර්ම සත්‍ය කොට ඇත්තේය. කර්ම ආරම්භය (පුරුදු කිරීම) පිණිස පවතින්නේය’ කියාය.\" \"බ්‍රාහ්මණය, මම සෝණකායන මානවකයා දැකීමටවත් නොදනිමි (දැක නැත). එවන් කථා සල්ලාපයක් කොයින්ද? බ්‍රාහ්මණය, මේ කර්ම සතරක් මා විසින් තමාම විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කර ප්‍රකාශ කරණ ලද්දේය. ඒ කවර හතරක්ද?\n\nබ්‍රාහ්මණය, කළු වූ කළු විපාක ඇති කර්මයක් ඇත. බ්‍රාහ්මණය, සුදු වූ සුදු විපාක ඇති කර්මයක් ඇත. බ්‍රාහ්මණය, කළු සුදු වූ කළු සුදු විපාක ඇති කර්මයක් ඇත. බ්‍රාහ්මණය, කළුත් නොවන, සුදුත් නොවන, විපාක වශයෙන්ද කළුත් නොවන, සුදුත් නොවන කර්ම ක්ෂය පිණිස පවතින කර්මයක් ඇත.\n\n\"බ්‍රාහ්මණය, කළු වූ කළු විපාක ඇති කර්මය කවරේද? බ්‍රාහ්මණය, මෙහි ඇතැම් පුද්ගලයෙක් ව්‍යාබාධ (අන්‍යයන්ට හා තමාට පීඩා ගෙන දෙන) සහිත කාය සංස්කාරයන් (කායික ක්‍රියා) අභිසංස්කරණය කරයි, ව්‍යාබාධ සහිත වචී සංස්කාරයන් (වාචසික ක්‍රියා) අභිසංස්කරණය කරයි, ව්‍යාබාධ සහිත මනෝ සංස්කාරයන් (මානසික ක්‍රියා) අභිසංස්කරණය කරයි. ඔහු ව්‍යාබාධ සහිත කාය සංස්කාරයන් අභිසංස්කරණය කොට, ව්‍යාබාධ සහිත වචී සංස්කාරයන් අභිසංස්කරණය කොට, ව්‍යාබාධ සහිත මනෝ සංස්කාරයන් අභිසංස්කරණය කොට, ව්‍යාබාධ සහිත ලෝකයක උපදී (නිරය වැනි දුක් සහිත ලෝකයක උපදී). එවන් ව්‍යාබාධ සහිත ලෝකයක උපන්නා වූ ඔහුව ව්‍යාබාධ සහිත ස්පර්ශයෝ ස්පර්ශ කරති (පහස ලබති). ඔහු ව්‍යාබාධ සහිත ස්පර්ශයන්ගෙන් පහස ලද්දෙක් වී, ව්‍යාබාධ සහිත වේදනා, එනම් ඒකාන්තයෙන් දුක් සහිත වේදනා විඳියි. යම්සේ නිරය සත්වයෝ (දුක් විඳිත්ද) එසේය. බ්‍රාහ්මණය, මෙය කළු වූ කළු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\n\"බ්‍රාහ්මණය, සුදු වූ සුදු විපාක ඇති කර්මය කවරේද? බ්‍රාහ්මණය, මෙහි ඇතැම් පුද්ගලයෙක් අව්‍යාබාධ (අන්‍යයන්ට හා තමාට පීඩා නොවන) කාය සංස්කාරයන් අභිසංස්කරණය කරයි, අව්‍යාබාධ වචී සංස්කාරයන් අභිසංස්කරණය කරයි, අව්‍යාබාධ මනෝ සංස්කාරයන් අභිසංස්කරණය කරයි. ඔහු අව්‍යාබාධ කාය සංස්කාරයන් අභිසංස්කරණය කොට, අව්‍යාබාධ වචී සංස්කාරයන් අභිසංස්කරණය කොට, අව්‍යාබාධ මනෝ සංස්කාරයන් අභිසංස්කරණය කොට, අව්‍යාබාධ ලෝකයක උපදී (දෙව්ලොව වැනි සුඛිත ලෝකයක උපදී). එවන් අව්‍යාබාධ ලෝකයක උපන්නා වූ ඔහුව අව්‍යාබාධ ස්පර්ශයෝ ස්පර්ශ කරති. ඔහු අව්‍යාබාධ ස්පර්ශයන්ගෙන් පහස ලද්දෙක් වී, අව්‍යාබාධ වේදනා, එනම් ඒකාන්තයෙන් සුඛ සහිත වේදනා විඳියි. යම්සේ සුභකිණ්හ (ශුභකෘත්ස්න) දෙවියෝ (සැප විඳිත්ද) එසේය. බ්‍රාහ්මණය, මෙය සුදු වූ සුදු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\n\"බ්‍රාහ්මණය, කළු සුදු වූ කළු සුදු විපාක ඇති කර්මය කවරේද? බ්‍රාහ්මණය, මෙහි ඇතැම් පුද්ගලයෙක් ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් කාය සංස්කාරයන් අභිසංස්කරණය කරයි. ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් වචී සංස්කාරයන් අභිසංස්කරණය කරයි. ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් මනෝ සංස්කාරයන් අභිසංස්කරණය කරයි. ඔහු ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් කාය සංස්කාරයන් අභිසංස්කරණය කොට, ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් වචී සංස්කාරයන් අභිසංස්කරණය කොට, ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් මනෝ සංස්කාරයන් අභිසංස්කරණය කොට, ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් ලෝකයක උපදී (මිනිස් ලොව වැනි සැප දුක් මිශ්‍ර ලෝකයක උපදී). එවන් ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් ලෝකයක උපන්නා වූ ඔහුව ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් ස්පර්ශයෝ ස්පර්ශ කරති. ඔහු ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් ස්පර්ශයන්ගෙන් පහස ලද්දෙක් වී, ව්‍යාබාධ සහිත වූත්, අව්‍යාබාධ සහිත වූත් වේදනා, එනම් සැප දුක් මිශ්‍ර වේදනා විඳියි. යම්සේ මනුෂ්‍යයෝත්, ඇතැම් දෙවියෝත්, ඇතැම් විනිපාතික (දුගතිගාමී) සත්වයෝත් (සැප දුක් විඳිත්ද) එසේය. බ්‍රාහ්මණය, මෙය කළු සුදු වූ කළු සුදු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\n\"බ්‍රාහ්මණය, කළුත් නොවන, සුදුත් නොවන, විපාක වශයෙන්ද කළුත් නොවන, සුදුත් නොවන කර්ම ක්ෂය පිණිස පවතින කර්මය කවරේද? බ්‍රාහ්මණය, එහිලා යම් ඒ කළු වූ කළු විපාක ඇති කර්මයක් වේද, එය ප්‍රහීණ කිරීම පිණිස ඇති චේතනාව, යම් ඒ සුදු වූ සුදු විපාක ඇති කර්මයක් වේද, එය ප්‍රහීණ කිරීම පිණිස ඇති චේතනාව, යම් ඒ කළු සුදු වූ කළු සුදු විපාක ඇති කර්මයක් වේද, එය ප්‍රහීණ කිරීම පිණිස ඇති චේතනාව – බ්‍රාහ්මණය, මෙය කළුත් නොවන, සුදුත් නොවන, විපාක වශයෙන්ද කළුත් නොවන, සුදුත් නොවන කර්ම ක්ෂය පිණිස පවතින කර්මය යැයි කියනු ලැබේ. බ්‍රාහ්මණය, මා විසින් තමාම විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කර ප්‍රකාශ කරන ලද්දේ මේ කර්ම සතරයි.\"",
      "paliTitle": "Soṇakāyanasuttaṃ",
      "englishTitle": "Soṇakāyana Sutta",
      "sinhalaTitle": "සෝණකායන සූත්‍‍රය"
    },
    {
      "number": 235,
      "pali": "‘‘Cattārimāni, bhikkhave, kammāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Atthi, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ; atthi, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ; atthi, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ; atthi, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Katamañca, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ? Idha, bhikkhave, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, surāmerayamajjapamādaṭṭhāyī hoti. Idaṃ vuccati, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ? Idha, bhikkhave, ekacco sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati? Tatra, bhikkhave, yamidaṃ kammaṃ kaṇhaṃ kaṇhavipākaṃ…pe… idaṃ vuccati, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Imāni kho, bhikkhave, cattāri kammāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Catutthaṃ.",
      "english": "Monks, these four types of actions have been declared by me, having directly known and realized them myself through supernormal knowledge. What are these four? Monks, there is action that is dark with dark results; Monks, there is action that is bright with bright results; Monks, there is action that is dark and bright with dark and bright results; and Monks, there is action that is neither dark nor bright, with neither dark nor bright results, leading to the cessation of actions.\n\nAnd what, Monks, is action that is dark with dark results? Here, Monks, some individual takes life, takes what is not given, engages in sexual misconduct, speaks falsely, and indulges in intoxicating drinks and drugs that lead to heedlessness. This, Monks, is called action that is dark with dark results.\n\nAnd what, Monks, is action that is bright with bright results? Here, Monks, some individual abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from intoxicating drinks and drugs that lead to heedlessness. This, Monks, is called action that is bright with bright results.\n\nAnd what, Monks, is action that is dark and bright with dark and bright results? Here, Monks, some individual forms both harmful and harmless bodily volitional formations, both harmful and harmless verbal volitional formations, and both harmful and harmless mental volitional formations, experiencing both harmful and harmless contact. This, Monks, is called action that is dark and bright with dark and bright results.\n\nAnd what, Monks, is action that is neither dark nor bright, with neither dark nor bright results, leading to the cessation of actions? Here, Monks, it is the volition to abandon that action which is dark with dark results; the volition to abandon that action which is bright with bright results; the volition to abandon that action which is dark and bright with dark and bright results; and the volition to abandon even that volition which is neither dark nor bright but would otherwise lead to further existence. This action, based on such volition for abandonment, is called action that is neither dark nor bright, with neither dark nor bright results, leading to the cessation of actions.\n\nThese, Monks, are the four types of actions that have been declared by me, having directly known and realized them myself through supernormal knowledge.",
      "sinhala": "මහණෙනි, මා විසින් උසස් ඥානයෙන් (අභිඥාවෙන්) ප‍්‍රත්‍යක්ෂ කොට දේශනා කරන ලද කර්ම සතරක් ඇත්තේය.\n\nඒ සතර කවරේද? මහණෙනි, කළු වූ කළු විපාක ඇති කර්මයක් ඇත; මහණෙනි, සුදු වූ සුදු විපාක ඇති කර්මයක් ඇත; මහණෙනි, කළු හා සුදු වූ කළු හා සුදු විපාක ඇති කර්මයක් ඇත; මහණෙනි, කර්මක්ෂය පිණිස පවතින කළුද නොවන සුදුද නොවන, කළුද නොවන සුදුද නොවන විපාක ඇති කර්මයක් ඇත.\n\nමහණෙනි, කළු වූ කළු විපාක ඇති කර්මය කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප‍්‍රාණඝාතයෙහි යෙදෙයි, අදත්තාදානයෙහි යෙදෙයි, කාමයන්හි වරදවා හැසිරෙයි, මුසාවාදයෙහි යෙදෙයි, සුරා-මේරය පානයෙන් සිහිමුළා වීමෙන් ප‍්‍රමාදයට පත්වෙයි. මහණෙනි, මෙය කළු වූ කළු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, සුදු වූ සුදු විපාක ඇති කර්මය කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප‍්‍රාණඝාතයෙන් වැළකී සිටියි, අදත්තාදානයෙන් වැළකී සිටියි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි, මුසාවාදයෙන් වැළකී සිටියි, සුරා-මේරය පානයෙන් සිහිමුළා වීමෙන් ප‍්‍රමාදයට පත්වීමෙන් වැළකී සිටියි. මහණෙනි, මෙය සුදු වූ සුදු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කළු හා සුදු වූ කළු හා සුදු විපාක ඇති කර්මය කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ව්‍යාබාධ සහිත වූද, ව්‍යාබාධ රහිත වූද කාය සංස්කාරයන් සම්පාදනය කරයි; ව්‍යාබාධ සහිත වූද, ව්‍යාබාධ රහිත වූද වචී සංස්කාරයන් සම්පාදනය කරයි; ව්‍යාබාධ සහිත වූද, ව්‍යාබාධ රහිත වූද මනෝ සංස්කාරයන් සම්පාදනය කරයි. මහණෙනි, මෙය කළු හා සුදු වූ කළු හා සුදු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කර්මක්ෂය පිණිස පවතින කළුද නොවන සුදුද නොවන, කළුද නොවන සුදුද නොවන විපාක ඇති කර්මය කවරේද? මහණෙනි, ඒ අතුරින් යම් කළු වූ කළු විපාක ඇති කර්මයක් ඇත්ද, එය ප‍්‍රහාණය කිරීමත්; යම් සුදු වූ සුදු විපාක ඇති කර්මයක් ඇත්ද, එය ප‍්‍රහාණය කිරීමත්; යම් කළු හා සුදු වූ කළු හා සුදු විපාක ඇති කර්මයක් ඇත්ද, එය ප‍්‍රහාණය කිරීමත්, මෙය මහණෙනි, කර්මක්ෂය පිණිස පවතින කළුද නොවන සුදුද නොවන, කළුද නොවන සුදුද නොවන විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, මා විසින් උසස් ඥානයෙන් (අභිඥාවෙන්) ප‍්‍රත්‍යක්ෂ කොට දේශනා කරන ලද්දේ මේ සතර කර්මයෝමය.",
      "paliTitle": "Paṭhamasikkhāpadasuttaṃ",
      "englishTitle": "The First Sutta on Training Rules",
      "sinhalaTitle": "පළමු සික්ඛාපද සූත්‍රය"
    },
    {
      "number": 236,
      "pali": "‘‘Cattārimāni, bhikkhave, kammāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Atthi, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ; atthi, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ; atthi, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ; atthi, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ? Idha, bhikkhave, ekaccena mātā [ekacco mātaraṃ (ka.)] jīvitā voropitā hoti, pitā [pitaraṃ (ka.)] jīvitā voropito [voropitā (ka.)] hoti, arahaṃ [arahantaṃ (ka.)] jīvitā voropito [voropitā (ka.)] hoti, tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ [uppāditā (ka.)] hoti, saṅgho bhinno hoti. Idaṃ vuccati, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhi [sammādiṭṭhiko (sī. syā. kaṃ.)] hoti. Idaṃ vuccati, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ? Idha, bhikkhave, ekacco sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati? Tatra, bhikkhave, yamidaṃ kammaṃ kaṇhaṃ kaṇhavipākaṃ…pe… idaṃ vuccati, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Imāni kho, bhikkhave, cattāri kammāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Pañcamaṃ.",
      "english": "Monks, these four types of kamma have been directly known and realized by me and then proclaimed. Which four? Monks, there is kamma that is dark with dark result; there is kamma that is bright with bright result; there is kamma that is dark and bright with dark and bright result; and there is kamma that is neither dark nor bright with neither dark nor bright result, conducive to the destruction of kamma.\n\nAnd what, monks, is kamma that is dark with dark result? Here, monks, someone murders their mother, murders their father, murders an Arahant, with malicious intent causes the Tathāgata to shed blood, or causes a schism in the Saṅgha. This is called kamma that is dark with dark result.\n\nAnd what, monks, is kamma that is bright with bright result? Here, monks, someone abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter, is not covetous, is not malicious, and holds right view. This is called kamma that is bright with bright result.\n\nAnd what, monks, is kamma that is dark and bright with dark and bright result? Here, monks, someone performs volitional formations of the body that are both harmful and harmless, and similarly with volitional formations of speech and mind. This is called kamma that is dark and bright with dark and bright result.\n\nAnd what, monks, is kamma that is neither dark nor bright with neither dark nor bright result, conducive to the destruction of kamma? Therein, monks, the volition to abandon that kamma which is dark with dark result, and the kamma which is bright with bright result, and the kamma which is dark and bright with dark and bright result—this is called kamma that is neither dark nor bright with neither dark nor bright result, conducive to the destruction of kamma. These, monks, are the four types of kamma that have been directly known and realized by me and then proclaimed.",
      "sinhala": "භික්ෂූණි, මේ කර්ම හතර මා විසින් ස්වයංවම අභිඥාවෙන් ප්u200dරත්‍යක්ෂ කොට දේශනා කරන ලදී. ඒ කවර හතරක් ද? භික්ෂූණි, කළු වූ, කළු විපාක දෙන කර්මයක් ඇත. භික්ෂූණි, සුදු වූ, සුදු විපාක දෙන කර්මයක් ඇත. භික්ෂූණි, කළු-සුදු වූ, කළු-සුදු විපාක දෙන කර්මයක් ඇත. භික්ෂූණි, කළු ද නොවන, සුදු ද නොවන, කළු ද නොවන සුදු ද නොවන විපාක දෙන, කර්ම ක්ෂය වීම පිණිස පවතින කර්මයක් ඇත.\n\nභික්ෂූණි, කළු වූ, කළු විපාක දෙන කර්මය කවරේද? භික්ෂූණි, මෙහි ඇතැමෙකු විසින් මවට ජීවිත හානි කරන ලද්දේ වෙයි. පියාට ජීවිත හානි කරන ලද්දේ වෙයි. අරහත් කෙනෙකුට ජීවිත හානි කරන ලද්දේ වෙයි. තථාගතයන් වහන්සේගේ සිරුරේ දුෂ්ට සිතිවිල්ලකින් ලේ සෙලවීමක් ඇති කරන ලද්දේ වෙයි. සංඝ භේදයක් කරන ලද්දේ වෙයි. භික්ෂූණි, මේ කළු වූ, කළු විපාක දෙන කර්මය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, සුදු වූ, සුදු විපාක දෙන කර්මය කවරේද? භික්ෂූණි, මෙහි ඇතැමෙක් ප්u200dරාණඝාතයෙන් වැළකී සිටින්නේ වෙයි. අදත්තාදානයෙන් වැළකී සිටින්නේ වෙයි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටින්නේ වෙයි. මුසාවාදයෙන් වැළකී සිටින්නේ වෙයි. පිසුණු වචනයෙන් වැළකී සිටින්නේ වෙයි. ඵරුෂ වචනයෙන් වැළකී සිටින්නේ වෙයි. සම්ප්u200dරප්පලාපයෙන් වැළකී සිටින්නේ වෙයි. අභිධ්‍යාව නැති අයෙක් වෙයි. ව්‍යාපාදයක් නැති සිත් ඇත්තෙක් වෙයි. සම්මාදිට්ඨියෙන් යුක්ත වෙයි. භික්ෂූණි, මේ සුදු වූ, සුදු විපාක දෙන කර්මය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, කළු-සුදු වූ, කළු-සුදු විපාක දෙන කර්මය කවරේද? භික්ෂූණි, මෙහි ඇතැමෙක් ව්‍යාබාධ සහිත වූත්, ව්‍යාබාධ රහිත වූත් කාය සංස්කාරයන් ද, වචී සංස්කාරයන් ද, මනෝ සංස්කාරයන් ද සම්පාදනය කරන්නේ වෙයි. භික්ෂූණි, මේ කළු-සුදු වූ, කළු-සුදු විපාක දෙන කර්මය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, කළු ද නොවන, සුදු ද නොවන, කළු ද නොවන සුදු ද නොවන විපාක දෙන, කර්ම ක්ෂය වීම පිණිස පවතින කර්මය කවරේද? භික්ෂූණි, එහිලා, යම් මේ කළු වූ කළු විපාක දෙන කර්මයක් ද, සුදු වූ සුදු විපාක දෙන කර්මයක් ද, කළු-සුදු වූ කළු-සුදු විපාක දෙන කර්මයක් ද, ඒවා ප්u200dරහාණය කිරීම පිණිස පවතින (ආර්ය මාර්ග) චේතනාවම, කළු ද නොවන, සුදු ද නොවන, කළු ද නොවන සුදු ද නොවන විපාක දෙන, කර්ම ක්ෂය වීම පිණිස පවතින කර්මය යැයි කියනු ලැබේ. භික්ෂූණි, මේ කර්ම හතර මා විසින් ස්වයංවම අභිඥාවෙන් ප්u200dරත්‍යක්ෂ කොට දේශනා කරන ලදී.",
      "paliTitle": "Dutiyasikkhāpadasuttaṃ",
      "englishTitle": "The Second Precept Discourse",
      "sinhalaTitle": "දෙවන ශික්ෂාපද සූත්‍රය"
    },
    {
      "number": 237,
      "pali": "‘‘Cattārimāni, bhikkhave, kammāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Atthi, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ; atthi, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ; atthi, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ; atthi, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ? Idha, bhikkhave, ekacco sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ? Idha, bhikkhave, ekacco abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ? Idha, bhikkhave, ekacco sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati? Sammādiṭṭhi…pe… sammāsamādhi. Idaṃ vuccati, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Imāni kho, bhikkhave, cattāri kammāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these four types of action have been declared by me after having directly known and realized them for myself.\n\nWhich four? Monks, there is dark action with dark karmic consequence; monks, there is bright action with bright karmic consequence; monks, there is dark-and-bright action with dark-and-bright karmic consequence; monks, there is neither-dark-nor-bright action with neither-dark-nor-bright karmic consequence, which conduces to the cessation of karma.\n\nAnd what, monks, is dark action with dark karmic consequence? Here, monks, some individual performs bodily volitional formations accompanied by affliction... This, monks, is called dark action with dark karmic consequence.\n\nAnd what, monks, is bright action with bright karmic consequence? Here, monks, some individual performs bodily volitional formations not accompanied by affliction... This, monks, is called bright action with bright karmic consequence.\n\nAnd what, monks, is dark-and-bright action with dark-and-bright karmic consequence? Here, monks, some individual performs bodily volitional formations accompanied by affliction and not accompanied by affliction... This, monks, is called dark-and-bright action with dark-and-bright karmic consequence.\n\nAnd what, monks, is neither-dark-nor-bright action with neither-dark-nor-bright karmic consequence, which conduces to the cessation of karma? Right view... right concentration. This, monks, is called neither-dark-nor-bright action with neither-dark-nor-bright karmic consequence, which conduces to the cessation of karma.\n\nThese, monks, are the four types of action declared by me after having directly known and realized them for myself.",
      "sinhala": "මහණෙනි, මා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට ප්‍ර‌කාශ කරන ලද කර්ම සතරක් ඇත. කවරක්ද ඒ සතර? මහණෙනි, කළු වූ, කළු විපාක ඇති කර්මයක් ඇත. මහණෙනි, සුදු වූ, සුදු විපාක ඇති කර්මයක් ඇත. මහණෙනි, කළු හා සුදු වූ, කළු හා සුදු විපාක ඇති කර්මයක් ඇත. මහණෙනි, කළු නොවූ, සුදු නොවූ, කළු විපාක නැති, සුදු විපාක නැති, කර්ම ක්ෂය වීම පිණිස පවතින කර්මයක් ඇත.\n\nමහණෙනි, කළු වූ, කළු විපාක ඇති කර්මය කවරක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් පීඩා ඇති කරන කාය සංඛාර සම්පාදනය කරයි, ආදී වශයෙන්. මහණෙනි, මෙය කළු වූ, කළු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, සුදු වූ, සුදු විපාක ඇති කර්මය කවරක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් පීඩා රහිත කාය සංඛාර සම්පාදනය කරයි, ආදී වශයෙන්. මහණෙනි, මෙය සුදු වූ, සුදු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කළු හා සුදු වූ, කළු හා සුදු විපාක ඇති කර්මය කවරක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් පීඩා සහිත වූ ද, පීඩා රහිත වූ ද කාය සංඛාර සම්පාදනය කරයි, ආදී වශයෙන්. මහණෙනි, මෙය කළු හා සුදු වූ, කළු හා සුදු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කළු නොවූ, සුදු නොවූ, කළු විපාක නැති, සුදු විපාක නැති, කර්ම ක්ෂය වීම පිණිස පවතින කර්මය කවරක්ද? සම්මා දිට්ඨිය ආදී සම්මා සමාධිය දක්වා වූ අරිය අෂ්ටාංගික මාර්ගයයි. මහණෙනි, මෙය කළු නොවූ, සුදු නොවූ, කළු විපාක නැති, සුදු විපාක නැති, කර්ම ක්ෂය වීම පිණිස පවතින කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, මා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට ප්‍ර‌කාශ කරන ලද්දේ මේ සතර කර්මයෝම වෙති.",
      "paliTitle": "Ariyamaggasuttaṃ",
      "englishTitle": "The Noble Path Discourse",
      "sinhalaTitle": "ආර්ය මාර්ග සූත්‍රය"
    },
    {
      "number": 238,
      "pali": "‘‘Cattārimāni, bhikkhave, kammāni…pe… kaṇhaṃ kaṇhavipākaṃ…pe… idha, bhikkhave, ekacco sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ kaṇhaṃ kaṇhavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ? Idha, bhikkhave, ekacco abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ sukkaṃ sukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ? Idha, bhikkhave, ekacco sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti…pe… idaṃ vuccati, bhikkhave, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ. ‘‘Katamañca, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati? Satisambojjhaṅgo, dhammavicayasambojjhaṅgo, vīriyasambojjhaṅgo, pītisambojjhaṅgo, passaddhisambojjhaṅgo, samādhisambojjhaṅgo, upekkhāsambojjhaṅgo – idaṃ vuccati, bhikkhave, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. Imāni kho, bhikkhave, cattāri kammāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Sattamaṃ.",
      "english": "Monks, there are these four types of actions:\n\nAnd what, monks, is dark action with dark results? Here, monks, a certain individual performs a volitional physical formation that causes harm. This, monks, is called dark action with dark results.\n\nAnd what, monks, is bright action with bright results? Here, monks, a certain individual performs a volitional physical formation that causes no harm. This, monks, is called bright action with bright results.\n\nAnd what, monks, is dark and bright action with dark and bright results? Here, monks, a certain individual performs a volitional physical formation that causes both harm and no harm. This, monks, is called dark and bright action with dark and bright results.\n\nAnd what, monks, is neither dark nor bright action with neither dark nor bright results, which leads to the exhaustion of action? It is the mindfulness factor of awakening, the investigation of phenomena factor of awakening, the energy factor of awakening, the rapture factor of awakening, the tranquility factor of awakening, the concentration factor of awakening, and the equanimity factor of awakening. This, monks, is called neither dark nor bright action with neither dark nor bright results, which leads to the exhaustion of action.\n\nThese four types of actions, monks, have been declared by me, having directly known and realized them through my own higher knowledge.",
      "sinhala": "මහණෙනි, මේ කර්ම සතරකි. (ඒවා නම්) කළු වූ, කළු විපාක ඇති කර්මය... මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සාභ්‍යාබාධ (අනුන්ට හා තමාට පීඩා ගෙන දෙන) වූ කාය සංස්කාරයක් (කායික චේතනාවක්) උපදවයි... මහණෙනි, මෙය කළු වූ, කළු විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, ශුක්ල වූ, ශුක්ල විපාක ඇති කර්මය කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අභ්‍යාබාධ (අනුන්ට හා තමාට පීඩා නොදෙන) වූ කාය සංස්කාරයක් (කායික චේතනාවක්) උපදවයි... මහණෙනි, මෙය ශුක්ල වූ, ශුක්ල විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කළු ශුක්ල වූ, කළු ශුක්ල විපාක ඇති කර්මය කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සාභ්‍යාබාධ (පීඩා ගෙන දෙන) වූත්, අභ්‍යාබාධ (පීඩා නොදෙන) වූත් කාය සංස්කාරයක් (කායික චේතනාවක්) උපදවයි... මහණෙනි, මෙය කළු ශුක්ල වූ, කළු ශුක්ල විපාක ඇති කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කළු නොවන, ශුක්ල නොවන, කළු නොවන, ශුක්ල නොවන විපාක ඇති, කර්ම ක්ෂය වීම පිණිස පවතින්නා වූ කර්මය කවරේද? සති සම්බොජ්ඣංගය, ධම්මවිචය සම්බොජ්ඣංගය, වීරිය සම්බොජ්ඣංගය, පීති සම්බොජ්ඣංගය, පස්සද්ධි සම්බොජ්ඣංගය, සමාධි සම්බොජ්ඣංගය, උපේක්ඛා සම්බොජ්ඣංගය යන මේවායි. මහණෙනි, මෙය කළු නොවන, ශුක්ල නොවන, කළු නොවන, ශුක්ල නොවන විපාක ඇති, කර්ම ක්ෂය වීම පිණිස පවතින්නා වූ කර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, මා විසින් මේ කර්ම සතර මාගේ විශිෂ්ට ඥානයෙන් (අභිඥාවෙන්) අවබෝධ කොට ප්‍ර‌කාශ කරන ලද්දේය.",
      "paliTitle": "Bojjhaṅgasuttaṃ",
      "englishTitle": "Discourse on the Factors of Awakening",
      "sinhalaTitle": "බොජ්‍ඣංග සූත්‍‍රය"
    },
    {
      "number": 239,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Sāvajjena kāyakammena, sāvajjena vacīkammena, sāvajjena manokammena, sāvajjāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Anavajjena kāyakammena, anavajjena vacīkammena, anavajjena manokammena, anavajjāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Aṭṭhamaṃ.",
      "english": "Monks, endowed with four qualities, one is consigned to hell, as if picked up and laid down there. Which four? By blameworthy bodily action, by blameworthy verbal action, by blameworthy mental action, and by blameworthy view. Indeed, monks, endowed with these four qualities, one is consigned to hell, as if picked up and laid down there.\n\nMonks, endowed with four qualities, one is consigned to heaven, as if picked up and laid down there. Which four? By blameless bodily action, by blameless verbal action, by blameless mental action, and by blameless view. Indeed, monks, endowed with these four qualities, one is consigned to heaven, as if picked up and laid down there.",
      "sinhala": "මහණෙනි, ධර්ම සතරකින් යුක්ත වූ තැනැත්තා, ගෙනැවිත් තැබූවක් මෙන් නිරයේ තැන්පත් වෙයි. කවර සතරකින්ද? සාවද්‍ය වූ කායකර්මයෙන්, සාවද්‍ය වූ වචීකර්මයෙන්, සාවද්‍ය වූ මනෝකර්මයෙන්, සාවද්‍ය වූ ද්‍යෂ්ටියෙන් – මහණෙනි, මේ ධර්ම සතරින් යුක්ත වූ තැනැත්තා, ගෙනැවිත් තැබූවක් මෙන් නිරයේ තැන්පත් වෙයි.\n\nමහණෙනි, ධර්ම සතරකින් යුක්ත වූ තැනැත්තා, ගෙනැවිත් තැබූවක් මෙන් ස්වර්ගයේ තැන්පත් වෙයි. කවර සතරකින්ද? අනවද්‍ය වූ කායකර්මයෙන්, අනවද්‍ය වූ වචීකර්මයෙන්, අනවද්‍ය වූ මනෝකර්මයෙන්, අනවද්‍ය වූ ද්‍යෂ්ටියෙන් – මහණෙනි, මේ ධර්ම සතරින් යුක්ත වූ තැනැත්තා, ගෙනැවිත් තැබූවක් මෙන් ස්වර්ගයේ තැන්පත් වෙයි.",
      "paliTitle": "Sāvajjasuttaṃ",
      "englishTitle": "The Blameworthy Discourse",
      "sinhalaTitle": "සාවද‍්‍ය සූත‍්‍රය"
    },
    {
      "number": 240,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Sabyābajjhena kāyakammena, sabyābajjhena vacīkammena, sabyābajjhena manokammena, sabyābajjhāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Abyābajjhena kāyakammena, abyābajjhena vacīkammena, abyābajjhena manokammena, abyābajjhāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Navamaṃ.",
      "english": "Mendicants, one endowed with four qualities is deposited in hell just as if brought there. With which four? With harmful bodily action, with harmful verbal action, with harmful mental action, and with a harmful view. Indeed, mendicants, one endowed with these four qualities is deposited in hell just as if brought there.\n\nMendicants, one endowed with four qualities is deposited in heaven just as if brought there. With which four? With harmless bodily action, with harmless verbal action, with harmless mental action, and with a harmless view. Indeed, mendicants, one endowed with these four qualities is deposited in heaven just as if brought there.",
      "sinhala": "භික්ෂූනි, කරුණු සතරකින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැබුවාක් මෙන් නිරයටම පත් වේ. ඒ කවර සතරකින්ද යත්? පීඩාකාරී වූ කායික ක්‍රියාවකින්, පීඩාකාරී වූ වාචසික ක්‍රියාවකින්, පීඩාකාරී වූ මානසික ක්‍රියාවකින්, සහ පීඩාකාරී වූ දෘෂ්ටියකින් – භික්ෂූනි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැබුවාක් මෙන් නිරයටම පත් වේ.\n\nභික්ෂූනි, කරුණු සතරකින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැබුවාක් මෙන් ස්වර්ගයටම පත් වේ. ඒ කවර සතරකින්ද යත්? පීඩා රහිත වූ කායික ක්‍රියාවකින්, පීඩා රහිත වූ වාචසික ක්‍රියාවකින්, පීඩා රහිත වූ මානසික ක්‍රියාවකින්, සහ පීඩා රහිත වූ දෘෂ්ටියකින් – භික්ෂූනි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැබුවාක් මෙන් ස්වර්ගයටම පත් වේ.",
      "paliTitle": "Abyābajjhasuttaṃ",
      "englishTitle": "The Discourse on Non-Affliction",
      "sinhalaTitle": "අව්‍<ZWJ>යාබාධ සූත්<ZWJ>රය"
    },
    {
      "number": 241,
      "pali": "‘‘‘Idheva, bhikkhave, (paṭhamo) samaṇo, idha dutiyo samaṇo, idha tatiyo samaṇo, idha catuttho samaṇo; suññā parappavādā samaṇehi aññehī’ti [samaṇehi aññeti (sī. pī. ka.) ettha aññehīti sakāya paṭiññāya saccābhiññehīti attho veditabbo. dī. ni. 2.214; ma. ni. 1.140] – evametaṃ, bhikkhave, sammā sīhanādaṃ nadatha. ‘‘Katamo ca, bhikkhave, paṭhamo samaṇo? Idha, bhikkhave, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Ayaṃ, bhikkhave, paṭhamo samaṇo. ‘‘Katamo ca, bhikkhave, dutiyo samaṇo? Idha, bhikkhave, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Ayaṃ, bhikkhave, dutiyo samaṇo. ‘‘Katamo ca, bhikkhave, tatiyo samaṇo? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Ayaṃ, bhikkhave, tatiyo samaṇo. ‘‘Katamo ca, bhikkhave, catuttho samaṇo? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ, bhikkhave, catuttho samaṇo. ‘‘‘Idheva, bhikkhave, paṭhamo samaṇo, idha dutiyo samaṇo, idha tatiyo samaṇo, idha catuttho samaṇo; suññā parappavādā samaṇebhi aññehī’ti – evametaṃ, bhikkhave, sammā sīhanādaṃ nadathā’’ti. Dasamaṃ.",
      "english": "“Here, bhikkhus, is the first recluse; here is the second recluse; here is the third recluse; here is the fourth recluse. Other doctrines are devoid of recluses.” Thus, bhikkhus, you should rightly roar this lion's roar.\n\nAnd who, bhikkhus, is the first recluse? Here, bhikkhus, a bhikkhu, with the destruction of the three fetters, is a stream-entrant, one no longer liable to fall into states of woe, assured of liberation, bound for full enlightenment. This, bhikkhus, is the first recluse.\n\nAnd who, bhikkhus, is the second recluse? Here, bhikkhus, a bhikkhu, with the destruction of the three fetters and the attenuation of lust, ill-will, and delusion, is a once-returner. Having returned to this world just one more time, he makes an end to suffering. This, bhikkhus, is the second recluse.\n\nAnd who, bhikkhus, is the third recluse? Here, bhikkhus, a bhikkhu, with the destruction of the five lower fetters, is a spontaneously reborn one, attaining final Nibbāna there and never returning from that world. This, bhikkhus, is the third recluse.\n\nAnd who, bhikkhus, is the fourth recluse? Here, bhikkhus, a bhikkhu, through the destruction of the influxes, in this very life, having realized for himself with direct knowledge the taintless liberation of mind and liberation through wisdom, enters upon and dwells in it. This, bhikkhus, is the fourth recluse.\n\n“Here, bhikkhus, is the first recluse; here is the second recluse; here is the third recluse; here is the fourth recluse. Other doctrines are devoid of recluses.” Thus, bhikkhus, you should rightly roar this lion's roar.",
      "sinhala": "භික්ෂූනි, ‘‘මෙහිමයි පළමුවන ශ්‍රමණයෙක්, මෙහි දෙවන ශ්‍රමණයෙක්, මෙහි තෙවන ශ්‍රමණයෙක්, මෙහි සිව්වන ශ්‍රමණයෙක් සිටී; අන්‍ය වූ වාදයන්හි ශ්‍රමණයෝ ශූන්‍යයහ’’ – භික්ෂූනි, මෙසේ මේ සිංහනාදය මැනවින් පවත්වනු.\n\nභික්ෂූනි, පළමුවන ශ්‍රමණයෝ කවරහුද? භික්ෂූනි, මෙහිලා භික්ෂුව සංයෝජන තුනක් ප්‍රහීණ වීමෙන් සෝවාන් වේ. ඔහු දුගතිවලට නොවැටෙන ස්වභාව ඇත්තෙක්, සම්බෝධියට නියත වූවෙක්, පරම සම්බෝධිය අරමුණු කොට ඇත්තෙක් වේ. භික්ෂූනි, මොහු පළමුවන ශ්‍රමණයෝ වෙති.\n\nභික්ෂූනි, දෙවන ශ්‍රමණයෝ කවරහුද? භික්ෂූනි, මෙහිලා භික්ෂුව සංයෝජන තුනක් ප්‍රහීණ වීමෙන්ද, රාග, ද්වේෂ, මෝහ යන අකුසල මූලයන් තනුක භාවයට පත් වීමෙන්ද සකදාගාමී වේ. ඔහු එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුකෙහි කෙළවර කරන්නේය. භික්ෂූනි, මොහු දෙවන ශ්‍රමණයෝ වෙති.\n\nභික්ෂූනි, තෙවන ශ්‍රමණයෝ කවරහුද? භික්ෂූනි, මෙහිලා භික්ෂුව ඕරම්භාගීය සංයෝජන පහක් ප්‍රහීණ වීමෙන් ඕපපාතිකව උපදින්නේය. ඔහු එහිදී පිරිනිවන් පාන්නේය. ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වේ. භික්ෂූනි, මොහු තෙවන ශ්‍රමණයෝ වෙති.\n\nභික්ෂූනි, සිව්වන ශ්‍රමණයෝ කවරහුද? භික්ෂූනි, මෙහිලා භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ භවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් (අභිඥාවෙන්) දැන, ප්‍රත්‍යක්ෂ කොට, ඊට පත්ව වාසය කරන්නේය. භික්ෂූනි, මොහු සිව්වන ශ්‍රමණයෝ වෙති.\n\nභික්ෂූනි, ‘‘මෙහිමයි පළමුවන ශ්‍රමණයෙක්, මෙහි දෙවන ශ්‍රමණයෙක්, මෙහි තෙවන ශ්‍රමණයෙක්, මෙහි සිව්වන ශ්‍රමණයෙක් සිටී; අන්‍ය වූ වාදයන්හි ශ්‍රමණයෝ ශූන්‍යයහ’’ – භික්ෂූනි, මෙසේ මේ සිංහනාදය මැනවින් පවත්වනු.",
      "paliTitle": "Samaṇasuttaṃ",
      "englishTitle": "The Discourse on the Ascetic",
      "sinhalaTitle": "ශ්\\u200Dරමණ සූත්‍\\u200Dරය"
    },
    {
      "number": 242,
      "pali": "‘‘Sappurisaṃ, bhikkhave, nissāya cattāro ānisaṃsā pāṭikaṅkhā. Katame cattāro? Ariyena sīlena vaḍḍhati, ariyena samādhinā vaḍḍhati, ariyāya paññāya vaḍḍhati, ariyāya vimuttiyā vaḍḍhati – sappurisaṃ, bhikkhave, nissāya ime cattāro ānisaṃsā pāṭikaṅkhā’’ti. Ekādasamaṃ. ",
      "english": "Monks, relying on a noble person, four advantages are to be expected. Which four? One grows in noble virtue, one grows in noble concentration, one grows in noble wisdom, and one grows in noble liberation. Monks, these four advantages are to be expected when relying on a noble person.",
      "sinhala": "මහණෙනි, සත්පුරුෂයකු ඇසුරු කිරීමෙන් සිව් ආකාරයක ආනිසංස බලාපොරොත්තු විය හැකිය. ඒ සතර කවරේද? ආර්ය සීලයෙන් වැඩෙයි, ආර්ය සමාධියෙන් වැඩෙයි, ආර්ය ප්‍රඥාවෙන් වැඩෙයි, ආර්ය විමුක්තියෙන් වැඩෙයි. මහණෙනි, සත්පුරුෂයකු ඇසුරු කිරීමෙන් මේ සිව් ආකාරයක ආනිසංස බලාපොරොත්තු විය හැකිය.",
      "paliTitle": "Sappurisānisaṃsasuttaṃ",
      "englishTitle": "Discourse on the Benefits of the Virtuous",
      "sinhalaTitle": "සත්‍පුරුෂ ආනිසංස සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Kammavaggo catuttho. Tassuddānaṃ – Saṃkhitta vitthāra soṇakāyana, Sikkhāpadaṃ ariyamaggo bojjhaṅgaṃ; Sāvajjañceva abyābajjhaṃ, Samaṇo ca sappurisānisaṃsoti.",
    "english": "Fourth Kamma Section",
    "sinhala": "සිව්වන කම්Z‌WJම වර්ගය"
  }
}