{
  "id": "an4.13",
  "title": {
    "pali": "Bhayavaggo",
    "english": "The Chapter on Fear",
    "sinhala": "භය වග්ගය"
  },
  "sections": [
    {
      "number": 121,
      "pali": "‘‘Cattārimāni, bhikkhave, bhayāni. Katamāni cattāri? Attānuvādabhayaṃ, parānuvādabhayaṃ, daṇḍabhayaṃ, duggatibhayaṃ. ‘‘Katamañca, bhikkhave, attānuvādabhayaṃ? Idha, bhikkhave, ekacco iti paṭisañcikkhati – ‘ahañceva [ahañce (?)] kho pana kāyena duccaritaṃ careyyaṃ, vācāya duccaritaṃ careyyaṃ, manasā duccaritaṃ careyyaṃ, kiñca taṃ yaṃ maṃ [kiñca taṃ maṃ (sī.), kiñca maṃ (syā. kaṃ.), kiñca taṃ kammaṃ (pī. ka.)] attā sīlato na upavadeyyā’ti! So attānuvādabhayassa bhīto kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti, manoduccaritaṃ pahāya manosucaritaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, attānuvādabhayaṃ. ‘‘Katamañca, bhikkhave, parānuvādabhayaṃ? Idha, bhikkhave, ekacco iti paṭisañcikkhati – ‘ahañceva kho pana kāyena duccaritaṃ careyyaṃ, vācāya duccaritaṃ careyyaṃ, manasā duccaritaṃ careyyaṃ, kiñca taṃ yaṃ maṃ pare sīlato na upavadeyyu’nti! So parānuvādabhayassa bhīto kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti, manoduccaritaṃ pahāya manosucaritaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, parānuvādabhayaṃ. ‘‘Katamañca, bhikkhave, daṇḍabhayaṃ? Idha, bhikkhave, ekacco passati coraṃ āgucāriṃ, rājāno gahetvā vividhā kammakāraṇā kārente, kasāhipi tāḷente, vettehipi tāḷente, addhadaṇḍakehipi tāḷente, hatthampi chindante, pādampi chindante, hatthapādampi chindante, kaṇṇampi chindante, nāsampi chindante, kaṇṇanāsampi chindante, bilaṅgathālikampi karonte, saṅkhamuṇḍikampi karonte, rāhumukhampi karonte, jotimālikampi karonte, hatthapajjotikampi karonte, erakavattikampi karonte, cīrakavāsikampi karonte, eṇeyyakampi karonte, balisamaṃsikampi karonte, kahāpaṇakampi karonte, khārāpatacchikampi karonte, palighaparivattikampi karonte, palālapīṭhakampi karonte, tattenapi telena osiñcante, sunakhehipi khādāpente, jīvantampi sūle uttāsente, asināpi sīsaṃ chindante. ‘‘Tassa evaṃ hoti – ‘yathārūpānaṃ kho pāpakānaṃ kammānaṃ hetu coraṃ āgucāriṃ rājāno gahetvā vividhā kammakāraṇā kārenti, kasāhipi tāḷenti…pe… asināpi sīsaṃ chindanti, ahañceva kho pana evarūpaṃ pāpakammaṃ kareyyaṃ, mampi rājāno gahetvā evarūpā vividhā kammakāraṇā kāreyyuṃ, kasāhipi tāḷeyyuṃ, vettehipi tāḷeyyuṃ, addhadaṇḍakehipi tāḷeyyuṃ, hatthampi chindeyyuṃ, pādampi chindeyyuṃ, hatthapādampi chindeyyuṃ, kaṇṇampi chindeyyuṃ, nāsampi chindeyyuṃ, kaṇṇanāsampi chindeyyuṃ, bilaṅgathālikampi kareyyuṃ, saṅkhamuṇḍikampi kareyyuṃ; rāhumukhampi kareyyuṃ, jotimālikampi kareyyuṃ, hatthapajjotikampi kareyyuṃ, erakavattikampi kareyyuṃ, cīrakavāsikampi kareyyuṃ, eṇeyyakampi kareyyuṃ, balisamaṃsikampi kareyyuṃ, kahāpaṇakampi kareyyuṃ, khārāpatacchikampi kareyyuṃ, palighaparivattikampi kareyyuṃ, palālapīṭhakampi kareyyuṃ, tattenapi telena osiñceyyuṃ, sunakhehipi khādāpeyyuṃ, jīvantampi sūle uttāseyyuṃ, asināpi sīsaṃ chindeyyu’nti. So daṇḍabhayassa bhīto na paresaṃ pābhataṃ vilumpanto carati. Kāyaduccaritaṃ pahāya…pe… suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, daṇḍabhayaṃ. ‘‘Katamañca, bhikkhave, duggatibhayaṃ? Idha, bhikkhave, ekacco iti paṭisañcikkhati – ‘kāyaduccaritassa kho pāpako vipāko abhisamparāyaṃ, vacīduccaritassa pāpako vipāko abhisamparāyaṃ, manoduccaritassa pāpako vipāko abhisamparāyaṃ. Ahañceva kho pana kāyena duccaritaṃ careyyaṃ, vācāya duccaritaṃ careyyaṃ, manasā duccaritaṃ careyyaṃ, kiñca taṃ yāhaṃ na kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya’nti! So duggatibhayassa bhīto kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti, manoduccaritaṃ pahāya manosucaritaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, duggatibhayaṃ. Imāni kho, bhikkhave, cattāri bhayānī’’ti. Paṭhamaṃ.",
      "english": "These are four fears, monks. Which four? The fear of self-reproach, the fear of others' reproach, the fear of punishment, and the fear of an unfortunate destination.\n\nAnd what, monks, is the fear of self-reproach? Here, monks, some individual reflects thus: 'If I were to engage in misconduct by body, by speech, and by mind, how could I avoid my own self-reproach concerning my morality?' Frightened by this fear of self-reproach, he abandons misconduct of body and develops good conduct of body; he abandons misconduct of speech and develops good conduct of speech; he abandons misconduct of mind and develops good conduct of mind. He maintains himself in purity. This, monks, is called the fear of self-reproach.\n\nAnd what, monks, is the fear of others' reproach? Here, monks, some individual reflects thus: 'If I were to engage in misconduct by body, by speech, and by mind, how could I avoid others' reproach concerning my morality?' Frightened by this fear of others' reproach, he abandons misconduct of body and develops good conduct of body; he abandons misconduct of speech and develops good conduct of speech; he abandons misconduct of mind and develops good conduct of mind. He maintains himself in purity. This, monks, is called the fear of others' reproach.\n\nAnd what, monks, is the fear of punishment? Here, monks, some individual sees a criminal, a wrongdoer, whom kings have seized and are inflicting various kinds of torture upon: beating him with whips, beating him with canes, beating him with cudgels; cutting off his hands, cutting off his feet, cutting off his hands and feet; cutting off his ears, cutting off his nose, cutting off his ears and nose; making him a gruel-pot, making him a conch-shell shaven head, making him a Rahu's mouth, making him a garland of flames, making him a hand-torch, making him an ear-lotus, making him a bark-robe wearer, making him an antelope, making him a fish-hook flesh, making him a coin-shaved, making him a lye-pickler, making him a pivot-bar roller, making him a straw-mat; drenching him with hot oil, making dogs devour him, impaling him alive on a stake, and cutting off his head with a sword.\n\nHe then reflects: 'For such evil deeds, kings seize the criminal, the wrongdoer, and inflict various kinds of torture: they beat him with whips, beat him with canes, beat him with cudgels; cut off his hands, cut off his feet, cut off his hands and feet; cut off his ears, cut off his nose, cut off his ears and nose; make him a gruel-pot, make him a conch-shell shaven head, make him a Rahu's mouth, make him a garland of flames, make him a hand-torch, make him an ear-lotus, make him a bark-robe wearer, make him an antelope, make him a fish-hook flesh, make him a coin-shaved, make him a lye-pickler, make him a pivot-bar roller, make him a straw-mat; drench him with hot oil, make dogs devour him, impale him alive on a stake, and cut off his head with a sword. If I were to commit such evil deeds, kings might seize me too and inflict such various kinds of torture: they might beat me with whips, beat me with canes, beat me with cudgels; cut off my hands, cut off my feet, cut off my hands and feet; cut off my ears, cut off my nose, cut off my ears and nose; make me a gruel-pot, make me a conch-shell shaven head, make me a Rahu's mouth, make me a garland of flames, make me a hand-torch, make me an ear-lotus, make me a bark-robe wearer, make me an antelope, make me a fish-hook flesh, make me a coin-shaved, make me a lye-pickler, make me a pivot-bar roller, make me a straw-mat; drench me with hot oil, make dogs devour me, impale me alive on a stake, and cut off my head with a sword.' Frightened by this fear of punishment, he does not go about plundering others' possessions. He abandons misconduct of body and develops good conduct of body; he abandons misconduct of speech and develops good conduct of speech; he abandons misconduct of mind and develops good conduct of mind. He maintains himself in purity. This, monks, is called the fear of punishment.\n\nAnd what, monks, is the fear of an unfortunate destination? Here, monks, some individual reflects thus: 'Misconduct of body has an evil karmic consequence in the hereafter; misconduct of speech has an evil karmic consequence in the hereafter; misconduct of mind has an evil karmic consequence in the hereafter. If I were to engage in misconduct by body, by speech, and by mind, how could I avoid, with the breakup of the body, after death, arising in a state of deprivation, a bad destination, a lower realm, in hell?'\n\nFrightened by this fear of an unfortunate destination, he abandons misconduct of body and develops good conduct of body; he abandons misconduct of speech and develops good conduct of speech; he abandons misconduct of mind and develops good conduct of mind. He maintains himself in purity. This, monks, is called the fear of an unfortunate destination. These, monks, are the four fears.",
      "sinhala": "මහණෙනි, මේ භය සතරකි. ඒ සතර කවරේද? තමන්ගේ (හෘද සාක්ෂියේ) නින්දා භය, අනුන්ගේ නින්දා භය, දඬුවම් භය, සහ දුගති භය යන මේවාය.\n\nමහණෙනි, තමන්ගේ නින්දා භය යනු කවරේද? මහණෙනි, මෙහිලා යම් පුද්ගලයෙක් මෙසේ සිතයි: ‘මම කයින් දුසිරිතෙහි හැසිරුණොත්, වචනයෙන් දුසිරිතෙහි හැසිරුණොත්, සිතින් දුසිරිතෙහි හැසිරුණොත්, කවර නම් හේතුවකින් මාගේ ආත්මය සිල්වත්භාවය අතින් මට නින්දා නොකරාවිද?’ ඔහු තමන්ගේ නින්දා භයට බියව, කයින් කරන දුසිරිත අතහැර කයින් සුසිරිත වඩයි. වචනයෙන් කරන දුසිරිත අතහැර වචනයෙන් සුසිරිත වඩයි. සිතින් කරන දුසිරිත අතහැර සිතින් සුසිරිත වඩයි. (මෙලෙස) තමා පිරිසිදු කර ගනී. මහණෙනි, මේ තමන්ගේ නින්දා භය යැයි කියනු ලැබේ.\n\nමහණෙනි, අනුන්ගේ නින්දා භය යනු කවරේද? මහණෙනි, මෙහිලා යම් පුද්ගලයෙක් මෙසේ සිතයි: ‘මම කයින් දුසිරිතෙහි හැසිරුණොත්, වචනයෙන් දුසිරිතෙහි හැසිරුණොත්, සිතින් දුසිරිතෙහි හැසිරුණොත්, කවර නම් හේතුවකින් අනුන් සීලය අතින් මට නින්දා නොකරාවිද?’ ඔහු අනුන්ගේ නින්දා භයට බියව, කයින් කරන දුසිරිත අතහැර කයින් සුසිරිත වඩයි. වචනයෙන් කරන දුසිරිත අතහැර වචනයෙන් සුසිරිත වඩයි. සිතින් කරන දුසිරිත අතහැර සිතින් සුසිරිත වඩයි. (මෙලෙස) තමා පිරිසිදු කර ගනී. මහණෙනි, මේ අනුන්ගේ නින්දා භය යැයි කියනු ලැබේ.\n\nමහණෙනි, දඬුවම් භය යනු කවරේද? මහණෙනි, මෙහිලා යම් පුද්ගලයෙක් වරදක් කළ සොරෙකු රජවරුන් විසින් අල්වාගෙන, නොයෙකුත් වධ බන්ධන පමුණුවනු දකී. කසාවලින් තලනු, වේවැලින් තලනු, අඩසඳ හැඩැති මුගුරුවලින් තලනු, අත් සිඳිනු, පා සිඳිනු, අත්-පා සිඳිනු, කන් සිඳිනු, නාසා සිඳිනු, කන්-නාසා සිඳිනු, බිලංගථාලිකා වධය පමුණුවනු, සංඛමුණ්ඩිකා වධය පමුණුවනු, රාහුමුඛ වධය පමුණුවනු, ජෝතිමාලිකා වධය පමුණුවනු, හත්ථපජ්ජෝතික වධය පමුණුවනු, ඒරකවත්තික වධය පමුණුවනු, චීරකවාසික වධය පමුණුවනු, ඒණෙය්යක වධය පමුණුවනු, බලිසමංසික වධය පමුණුවනු, කහාපණක වධය පමුණුවනු, ඛාරාපතච්ඡික වධය පමුණුවනු, පලිඝපරිවත්තික වධය පමුණුවනු, පලාපීඨක වධය පමුණුවනු, උණු තෙලෙන් නහවනු, බල්ලන් ලවා කවනු, ජීවත්ව සිටියදීම උල තබනු, කඩුවෙන් හිස සිඳ දමනු දකී.\n\nඑවිට ඔහුට මෙසේ සිතේ: ‘මෙවැනි පාපක\\u200d්\\u200dරමයන් කළ නිසා වරදක් කළ සොරෙකු රජවරුන් විසින් අල්ලාගෙන නොයෙකුත් වධ බන්ධන පමුණුවනු ලබති. කසාවලින් තලනු ලබති, වේවැලින් තලනු ලබති, අඩසඳ හැඩැති මුගුරුවලින් තලනු ලබති, අත් සිඳිනු ලබති, පා සිඳිනු ලබති, අත්-පා සිඳිනු ලබති, කන් සිඳිනු ලබති, නාසා සිඳිනු ලබති, කන්-නාසා සිඳිනු ලබති, බිලංගථාලිකා වධය පමුණුවනු ලබති, සංඛමුණ්ඩිකා වධය පමුණුවනු ලබති, රාහුමුඛ වධය පමුණුවනු ලබති, ජෝතිමාලිකා වධය පමුණුවනු ලබති, හත්ථපජ්ජෝතික වධය පමුණුවනු ලබති, ඒරකවත්තික වධය පමුණුවනු ලබති, චීරකවාසික වධය පමුණුවනු ලබති, ඒණෙය්යක වධය පමුණුවනු ලබති, බලිසමංසික වධය පමුණුවනු ලබති, කහාපණක වධය පමුණුවනු ලබති, ඛාරාපතච්ඡික වධය පමුණුවනු ලබති, පලිඝපරිවත්තික වධය පමුණුවනු ලබති, පලාපීඨක වධය පමුණුවනු ලබති, උණු තෙලෙන් නහවනු ලබති, බල්ලන් ලවා කවනු ලබති, ජීවත්ව සිටියදීම උල තබනු ලබති, කඩුවෙන් හිස සිඳ දමනු ලබති. මමද මෙවැනි පාපක\\u200d්\\u200dරමයක් කළහොත්, රජවරු මා ද අල්ලාගෙන මෙවැනි නොයෙකුත් වධ බන්ධන පමුණුවනු ඇත. කසාවලින් තලනු ඇත, වේවැලින් තලනු ඇත, අඩසඳ හැඩැති මුගුරුවලින් තලනු ඇත, අත් සිඳිනු ඇත, පා සිඳිනු ඇත, අත්-පා සිඳිනු ඇත, කන් සිඳිනු ඇත, නාසා සිඳිනු ඇත, කන්-නාසා සිඳිනු ඇත, බිලංගථාලිකා වධය පමුණුවනු ඇත, සංඛමුණ්ඩිකා වධය පමුණුවනු ඇත, රාහුමුඛ වධය පමුණුවනු ඇත, ජෝතිමාලිකා වධය පමුණුවනු ඇත, හත්ථපජ්ජෝතික වධය පමුණුවනු ඇත, ඒරකවත්තික වධය පමුණුවනු ඇත, චීරකවාසික වධය පමුණුවනු ඇත, ඒණෙය්යක වධය පමුණුවනු ඇත, බලිසමංසික වධය පමුණුවනු ඇත, කහාපණක වධය පමුණුවනු ඇත, ඛාරාපතච්ඡික වධය පමුණුවනු ඇත, පලිඝපරිවත්තික වධය පමුණුවනු ඇත, පලාපීඨක වධය පමුණුවනු ඇත, උණු තෙලෙන් නහවනු ඇත, බල්ලන් ලවා කවනු ඇත, ජීවත්ව සිටියදීම උල තබනු ඇත, කඩුවෙන් හිස සිඳ දමනු ඇත.’ ඔහු දඬුවම් භයට බියව, අනුන්ගේ දේපළ කොල්ලකමින් නොහැසිරෙයි. කයින් කරන දුසිරිත අතහැර කයින් සුසිරිත වඩයි. වචනයෙන් කරන දුසිරිත අතහැර වචනයෙන් සුසිරිත වඩයි. සිතින් කරන දුසිරිත අතහැර සිතින් සුසිරිත වඩයි. (මෙලෙස) තමා පිරිසිදු කර ගනී. මහණෙනි, මේ දඬුවම් භය යැයි කියනු ලැබේ.\n\nමහණෙනි, දුගති භය යනු කවරේද? මහණෙනි, මෙහිලා යම් පුද්ගලයෙක් මෙසේ සිතයි: ‘කායික දුසිරිතට පරලොවදී නපුරු විපාක ඇත. වාචසික දුසිරිතට පරලොවදී නපුරු විපාක ඇත. මානසික දුසිරිතට පරලොවදී නපුරු විපාක ඇත. මමද කයින් දුසිරිතෙහි හැසිරුණොත්, වචනයෙන් දුසිරිතෙහි හැසිරුණොත්, සිතින් දුසිරිතෙහි හැසිරුණොත්, කවර නම් හේතුවකින් මරණින් පසු කය බිඳී අපාය, දුගති, විනිපාත, නිරය යන තැන්වල නූපදිමද?’ ඔහු දුගති භයට බියව, කයින් කරන දුසිරිත අතහැර කයින් සුසිරිත වඩයි. වචනයෙන් කරන දුසිරිත අතහැර වචනයෙන් සුසිරිත වඩයි. සිතින් කරන දුසිරිත අතහැර සිතින් සුසිරිත වඩයි. (මෙලෙස) තමා පිරිසිදු කර ගනී. මහණෙනි, මේ දුගති භය යැයි කියනු ලැබේ. මහණෙනි, මේ භය සතර නම් මේවාය.",
      "paliTitle": "Attānuvādasuttaṃ",
      "englishTitle": "The Discourse on Self-Reproach",
      "sinhalaTitle": "අත්තානුවාද සූත්‍රය"
    },
    {
      "number": 122,
      "pali": "‘‘Cattārimāni, bhikkhave, bhayāni udakorohantassa [udakorohante (ma. ni. 2.161)] pāṭikaṅkhitabbāni. Katamāni cattāri? Ūmibhayaṃ, kumbhīlabhayaṃ, āvaṭṭabhayaṃ, susukābhayaṃ – imāni kho, bhikkhave, cattāri bhayāni udakorohantassa pāṭikaṅkhitabbāni. Evamevaṃ kho, bhikkhave, cattāri bhayāni idhekaccassa kulaputtassa imasmiṃ dhammavinaye agārasmā [saddhā agārasmā (sī. syā. kaṃ.)] anagāriyaṃ pabbajitassa [pabbajato (sī.)] pāṭikaṅkhitabbāni. Katamāni cattāri? Ūmibhayaṃ, kumbhīlabhayaṃ, āvaṭṭabhayaṃ, susukābhayaṃ. ‘‘Katamañca, bhikkhave, ūmibhayaṃ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṃ pabbajito hoti – ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti! Tamenaṃ tathā pabbajitaṃ samānaṃ sabrahmacārino ovadanti anusāsanti – ‘evaṃ te abhikkamitabbaṃ, evaṃ te paṭikkamitabbaṃ, evaṃ te āloketabbaṃ, evaṃ te viloketabbaṃ, evaṃ te samiñjitabbaṃ, evaṃ te pasāritabbaṃ, evaṃ te saṅghāṭipattacīvaraṃ dhāretabba’nti. Tassa evaṃ hoti – ‘mayaṃ kho pubbe agāriyabhūtā samānā aññe ovadāmapi anusāsāmapi. Ime panamhākaṃ puttamattā maññe nattamattā maññe ovaditabbaṃ anusāsitabbaṃ maññantī’ti. So kupito anattamano sikkhaṃ paccakkhāya hīnāyāvattati. Ayaṃ vuccati, bhikkhave, bhikkhu ūmibhayassa bhīto sikkhaṃ paccakkhāya hīnāyāvatto. Ūmibhayanti kho, bhikkhave, kodhūpāyāsassetaṃ adhivacanaṃ. Idaṃ vuccati, bhikkhave, ūmibhayaṃ. ‘‘Katamañca, bhikkhave, kumbhīlabhayaṃ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṃ pabbajito hoti – ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti! Tamenaṃ tathā pabbajitaṃ samānaṃ sabrahmacārino ovadanti anusāsanti – ‘idaṃ te khāditabbaṃ, idaṃ te na khāditabbaṃ, idaṃ te bhuñjitabbaṃ, idaṃ te na bhuñjitabbaṃ, idaṃ te sāyitabbaṃ, idaṃ te na sāyitabbaṃ, idaṃ te pātabbaṃ, idaṃ te na pātabbaṃ, kappiyaṃ te khāditabbaṃ, akappiyaṃ te na khāditabbaṃ, kappiyaṃ te bhuñjitabbaṃ, akappiyaṃ te na bhuñjitabbaṃ, kappiyaṃ te sāyitabbaṃ, akappiyaṃ te na sāyitabbaṃ, kappiyaṃ te pātabbaṃ, akappiyaṃ te na pātabbaṃ, kāle te khāditabbaṃ, vikāle te na khāditabbaṃ, kāle te bhuñjitabbaṃ, vikāle te na bhuñjitabbaṃ, kāle te sāyitabbaṃ, vikāle te na sāyitabbaṃ, kāle te pātabbaṃ, vikāle te na pātabba’nti. Tassa evaṃ hoti – ‘mayaṃ kho pubbe agāriyabhūtā samānā yaṃ icchāma taṃ khādāma, yaṃ na icchāma na taṃ khādāma; yaṃ icchāma taṃ bhuñjāma, yaṃ na icchāma na taṃ bhuñjāma; yaṃ icchāma taṃ sāyāma, yaṃ na icchāma na taṃ sāyāma; yaṃ icchāma taṃ pivāma, yaṃ na icchāma na taṃ pivāma; kappiyampi khādāma akappiyampi khādāma kappiyampi bhuñjāma akappiyampi bhuñjāma kappiyampi sāyāma akappiyampi sāyāma kappiyampi pivāma akappiyampi pivāma, kālepi khādāma vikālepi khādāma kālepi bhuñjāma vikālepi bhuñjāma kālepi sāyāma vikālepi sāyāma kālepi pivāma vikālepi pivāma; yampi no saddhā gahapatikā divā vikāle paṇītaṃ khādanīyaṃ vā bhojanīyaṃ vā denti, tatrapime [tatthapime (ma. ni. 2.163)] mukhāvaraṇaṃ maññe karontī’ti. So kupito anattamano sikkhaṃ paccakkhāya hīnāyāvattati. Ayaṃ vuccati, bhikkhave, bhikkhu kumbhīlabhayassa bhīto sikkhaṃ paccakkhāya hīnāyāvatto. Kumbhīlabhayanti kho, bhikkhave, odarikattassetaṃ adhivacanaṃ. Idaṃ vuccati, bhikkhave, kumbhīlabhayaṃ. ‘‘Katamañca, bhikkhave, āvaṭṭabhayaṃ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṃ pabbajito hoti – ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi, dukkhehi domanassehi upāyāsehi dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti! So evaṃ pabbajito samāno pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya satiyā asaṃvutehi indriyehi. So tattha passati gahapatiṃ vā gahapatiputtaṃ vā pañcahi kāmaguṇehi samappitaṃ samaṅgībhūtaṃ paricārayamānaṃ. Tassa evaṃ hoti – ‘mayaṃ kho pubbe agāriyabhūtā samānā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārimhā; saṃvijjanti kho pana me kule bhogā. Sakkā bhoge ca bhuñjituṃ puññāni ca kātuṃ. Yaṃnūnāhaṃ sikkhaṃ paccakkhāya hīnāyāvattitvā bhoge ca bhuñjeyyaṃ puññāni ca kareyya’nti! So sikkhaṃ paccakkhāya hīnāyāvattati. Ayaṃ vuccati, bhikkhave, bhikkhu āvaṭṭabhayassa bhīto sikkhaṃ paccakkhāya hīnāyāvatto. Āvaṭṭabhayanti kho, bhikkhave, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Idaṃ vuccati, bhikkhave, āvaṭṭabhayaṃ. ‘‘Katamañca, bhikkhave, susukābhayaṃ? Idha, bhikkhave, ekacco kulaputto saddhā agārasmā anagāriyaṃ pabbajito hoti – ‘otiṇṇomhi jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, dukkhotiṇṇo dukkhapareto; appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti! So evaṃ pabbajito samāno pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya satiyā asaṃvutehi indriyehi. So tattha passati mātugāmaṃ dunnivatthaṃ vā duppārutaṃ vā. Tassa mātugāmaṃ disvā dunnivatthaṃ vā duppārutaṃ vā rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena sikkhaṃ paccakkhāya hīnāyāvattati. Ayaṃ vuccati, bhikkhave, bhikkhu susukābhayassa bhīto sikkhaṃ paccakkhāya hīnāyāvatto. Susukābhayanti kho, bhikkhave, mātugāmassetaṃ adhivacanaṃ. Idaṃ vuccati, bhikkhave, susukābhayaṃ. Imāni kho, bhikkhave, cattāri bhayāni idhekaccassa kulaputtassa imasmiṃ dhammavinaye agārasmā anagāriyaṃ pabbajitassa pāṭikaṅkhitabbānī’’ti. Dutiyaṃ.",
      "english": "Monks, these four dangers are to be expected by one descending into water. Which four? The danger of waves, the danger of crocodiles, the danger of whirlpools, the danger of sharks – indeed, monks, these are the four dangers to be expected by one descending into water. In the same way, monks, these four dangers are to be expected by a certain young man of good family who, out of faith, has gone forth from the home life into homelessness in this Dhamma and Discipline. Which four? The danger of waves, the danger of crocodiles, the danger of whirlpools, the danger of sharks.\n\nAnd what, monks, is the danger of waves? Here, monks, a certain young man of good family, out of faith, goes forth from the home life into homelessness, thinking: ‘I am submerged in birth, old age, death, sorrow, lamentation, pain, dejection, and despair; I am submerged in suffering, overcome by suffering. Oh, if only an end to this entire mass of suffering could be known!’ As he has thus gone forth, his fellow practitioners instruct and admonish him: ‘You should go forward in this way, you should go back in this way, you should look in this way, you should glance around in this way, you should bend your limbs in this way, you should stretch out your limbs in this way, you should wear your robes, bowl, and outer robe in this way.’ Then he thinks: ‘In the past, when we were householders, we ourselves used to instruct and admonish others. But now, these people, who are like our own sons or grandsons, as it were, think they should instruct and admonish us!’ He, being angry and displeased, renounces the training and returns to a lower state. This, monks, is called a bhikkhu who, fearing the danger of waves, renounces the training and returns to a lower state. Indeed, monks, the danger of waves is a designation for anger and despair. This, monks, is called the danger of waves.\n\nAnd what, monks, is the danger of crocodiles? Here, monks, a certain young man of good family, out of faith, goes forth from the home life into homelessness, thinking: ‘I am submerged in birth, old age, death, sorrow, lamentation, pain, dejection, and despair; I am submerged in suffering, overcome by suffering. Oh, if only an end to this entire mass of suffering could be known!’ As he has thus gone forth, his fellow practitioners instruct and admonish him: ‘This you may chew, this you may not chew; this you may eat, this you may not eat; this you may taste, this you may not taste; this you may drink, this you may not drink. You may chew what is permissible, you may not chew what is not permissible; you may eat what is permissible, you may not eat what is not permissible; you may taste what is permissible, you may not taste what is not permissible; you may drink what is permissible, you may not drink what is not permissible. You may chew at the proper time, you may not chew at the improper time; you may eat at the proper time, you may not eat at the improper time; you may taste at the proper time, you may not taste at the improper time; you may drink at the proper time, you may not drink at the improper time.’ Then he thinks: ‘In the past, when we were householders, we chewed what we liked, and did not chew what we disliked; we ate what we liked, and did not eat what we disliked; we tasted what we liked, and did not taste what we disliked; we drank what we liked, and did not drink what we disliked. We chewed what was permissible and what was not permissible; we ate what was permissible and what was not permissible; we tasted what was permissible and what was not permissible; we drank what was permissible and what was not permissible. We chewed at the proper time and at the improper time; we ate at the proper time and at the improper time; we tasted at the proper time and at the improper time; we drank at the proper time and at the improper time. Moreover, when faithful householders offered us choice edibles or food during the day and at improper times, these people, I think, are now placing an obstruction in our mouths!’ He, being angry and displeased, renounces the training and returns to a lower state. This, monks, is called a bhikkhu who, fearing the danger of crocodiles, renounces the training and returns to a lower state. Indeed, monks, the danger of crocodiles is a designation for gluttony. This, monks, is called the danger of crocodiles.\n\nAnd what, monks, is the danger of whirlpools? Here, monks, a certain young man of good family, out of faith, goes forth from the home life into homelessness, thinking: ‘I am submerged in birth, old age, death, sorrow, lamentation, pain, dejection, and despair; I am submerged in suffering, overcome by suffering. Oh, if only an end to this entire mass of suffering could be known!’ Having thus gone forth, in the morning he dresses, takes his bowl and outer robe, and enters a village or town for alms, with his body unguarded, his speech unguarded, his mind unguarded, his mindfulness unestablished, and his senses unrestrained. There he sees a householder or a householder’s son, endowed and furnished with the five strands of sensual pleasure, enjoying them.\n\nHe thinks thus: ‘Indeed, in the past, when we were householders, we were fully engrossed in and indulged in the five strands of sensual pleasure. But indeed, there is still wealth in my family. It is possible to enjoy wealth and also to perform meritorious deeds. What if I were to abandon the training, revert to the lower state, and enjoy wealth and perform meritorious deeds!’ So he abandons the training and reverts to the lower state. This monk, bhikkhus, is called one who, frightened by the danger of reversion, abandons the training and reverts to the lower state. The danger of reversion, bhikkhus, is indeed a designation for these five strands of sensual pleasure. This, bhikkhus, is called the danger of reversion.\n\nAnd what, bhikkhus, is the danger of enticing allure? Here, bhikkhus, some son of good family, out of faith, has gone forth from the home life into homelessness, thinking: ‘I am overcome by birth, aging, death, sorrow, lamentation, pain, dejection, and despair; I am overcome by suffering, tormented by suffering; Oh, that an end to this entire mass of suffering might be discerned!’ Such a one, having gone forth, dresses in the morning and, taking his bowl and robe, enters a village or town for alms, with an unguarded body, unguarded speech, unguarded mind, with mindfulness not established, and with unconstrained faculties. There he sees a woman poorly dressed or poorly covered. Seeing that woman poorly dressed or poorly covered, lust assails his mind. With his mind assailed by lust, he abandons the training and reverts to the lower state. This monk, bhikkhus, is called one who, frightened by the danger of enticing allure, abandons the training and reverts to the lower state. The danger of enticing allure, bhikkhus, is indeed a designation for women. This, bhikkhus, is called the danger of enticing allure. Indeed, bhikkhus, these four dangers are to be expected for some son of good family in this Dhamma and Discipline who has gone forth from home life into homelessness.",
      "sinhala": "මහණෙනි, දියට බසින්නෙකුට මේ භය හතරක් අපේක්ෂා කළ යුතුයි. කවරවාද ඒ හතර? රළ භය, කිඹුල් භය, සුළි භය, මෝර භයයි. මහණෙනි, දියට බසින්නෙකුට මේ භය හතර අපේක්ෂා කළ යුතුයි. එලෙසින්ම මහණෙනි, මේ ධර්ම විනයෙහි ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වූ යම් කුලපුත්‍රයෙකුට මේ භය හතරක් අපේක්ෂා කළ යුතුයි. කවරවාද ඒ හතර? රළ භය, කිඹුල් භය, සුළි භය, මෝර භයයි.\n\nමහණෙනි, රළ භය කවරේද? මහණෙනි, මේ ශාසනයෙහි යම් කුලපුත්‍රයෙක් ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදිව සිටී. ‘මම ජාතියෙන්ද, ජරාවෙන්ද, මරණයෙන්ද, ශෝකයෙන්ද, වැලපීමෙන්ද, දුකෙන්ද, දොම්නසින්ද, උපායාසයෙන්ද පෙලී සිටිමි. දුකෙහි ගැලී, දුකෙන් පීඩිතව සිටිමි. මේ සියලු දුක් සමුදාය අවසන් කිරීමක් තිබේ නම් හොඳයැ’යි ඔහු සිතයි. එලෙස පැවිදි වූ ඔහුට සබ්‍රහ්මචාරීහු අවවාද කරති, අනුශාසනා කරති: ‘ඔබ මෙසේ ඉදිරියට යා යුතුයි, මෙසේ පසුබැසිය යුතුයි, මෙසේ බැලිය යුතුයි, මෙසේ විමසා බැලිය යුතුයි, මෙසේ (අත පය) හැකිලිය යුතුයි, මෙසේ (අත පය) දිගහැරිය යුතුයි, මෙසේ සංඝාටියද පාත්‍රයද සිවුරුද දැරිය යුතුයි’ කියා. එවිට ඔහුට මෙසේ සිතේ: ‘අපි පෙර ගිහියන්ව සිටියදී අනුන්ට අවවාද කළා, අනුශාසනා කළා. එහෙත් දැන් මොවුන් අපගේ පුත්‍රයන් හෝ මුණුබුරන් යැයි සිතාගෙන අපට අවවාද කිරීමට, අනුශාසනා කිරීමට සිතනවා’ කියා. ඔහු කෝප වී, නොසතුටු වී, ශික්ෂාව අත්හැර පහත් තත්ත්වයකට පත් වේ. මහණෙනි, මේ භික්ෂුව රළ භයට බිය වී ශික්ෂාව අත්හැර පහත් තත්ත්වයකට පත් වූවෙකැයි කියනු ලැබේ. මහණෙනි, රළ භය යනු කෝපය හා උපායාසය සඳහා වූ නමකි. මහණෙනි, මෙය රළ භය යැයි කියනු ලැබේ.\n\nමහණෙනි, කිඹුල් භය කවරේද? මහණෙනි, මේ ශාසනයෙහි යම් කුලපුත්‍රයෙක් ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදිව සිටී. ‘මම ජාතියෙන්ද, ජරාවෙන්ද, මරණයෙන්ද, ශෝකයෙන්ද, වැලපීමෙන්ද, දුකෙන්ද, දොම්නසින්ද, උපායාසයෙන්ද පෙලී සිටිමි. දුකෙහි ගැලී, දුකෙන් පීඩිතව සිටිමි. මේ සියලු දුක් සමුදාය අවසන් කිරීමක් තිබේ නම් හොඳයැ’යි ඔහු සිතයි. එලෙස පැවිදි වූ ඔහුට සබ්‍රහ්මචාරීහු අවවාද කරති, අනුශාසනා කරති: ‘ඔබ මේ දේ අනුභව කළ යුතුයි, මේ දේ අනුභව නොකළ යුතුයි. මේ දේ භුක්ති විඳිය යුතුයි, මේ දේ භුක්ති විඳිය යුතු නැහැ. මේ දේ රස බැලිය යුතුයි, මේ දේ රස බැලිය යුතු නැහැ. මේ දේ පානය කළ යුතුයි, මේ දේ පානය කළ යුතු නැහැ. ඔබ කප්පිය දේ අනුභව කළ යුතුයි, අකප්පිය දේ අනුභව නොකළ යුතුයි. කප්පිය දේ භුක්ති විඳිය යුතුයි, අකප්පිය දේ භුක්ති විඳිය යුතු නැහැ. කප්පිය දේ රස බැලිය යුතුයි, අකප්පිය දේ රස බැලිය යුතු නැහැ. කප්පිය දේ පානය කළ යුතුයි, අකප්පිය දේ පානය කළ යුතු නැහැ. ඔබ කලට අනුභව කළ යුතුයි, විකලට අනුභව නොකළ යුතුයි. ඔබ කලට භුක්ති විඳිය යුතුයි, විකලට භුක්ති විඳිය යුතු නැහැ. ඔබ කලට රස බැලිය යුතුයි, විකලට රස බැලිය යුතු නැහැ. ඔබ කලට පානය කළ යුතුයි, විකලට පානය කළ යුතු නැහැ’ කියා. එවිට ඔහුට මෙසේ සිතේ: ‘අපි පෙර ගිහියන්ව සිටියදී කැමති දෙයක් අනුභව කළා, අකමැති දෙයක් අනුභව නොකළා. කැමති දෙයක් භුක්ති වින්දා, අකමැති දෙයක් භුක්ති වින්දේ නැහැ. කැමති දෙයක් රස බැලුවා, අකමැති දෙයක් රස බැලුවේ නැහැ. කැමති දෙයක් පානය කළා, අකමැති දෙයක් පානය කළේ නැහැ. කප්පිය දේත් අකප්පිය දේත් අනුභව කළා. කප්පිය දේත් අකප්පිය දේත් භුක්ති වින්දා. කප්පිය දේත් අකප්පිය දේත් රස බැලුවා. කප්පිය දේත් අකප්පිය දේත් පානය කළා. කලටත් විකලටත් අනුභව කළා. කලටත් විකලටත් භුක්ති වින්දා. කලටත් විකලටත් රස බැලුවා. කලටත් විකලටත් පානය කළා. දානපති ගෘහපතිවරු අපට දිවා කලද විකල කලද ප්‍රණීත ඛාදනීය හෝ භෝජනීය දේ දුන්නා. නමුත් දැන් මොවුන් අපට මුඛ ආවරණයක් කරනවා වැනියැ’යි. ඔහු කෝප වී, නොසතුටු වී, ශික්ෂාව අත්හැර පහත් තත්ත්වයකට පත් වේ. මහණෙනි, මේ භික්ෂුව කිඹුල් භයට බිය වී ශික්ෂාව අත්හැර පහත් තත්ත්වයකට පත් වූවෙකැයි කියනු ලැබේ. මහණෙනි, කිඹුල් භය යනු අධික භෝජන ලෝභයට වූ නමකි. මහණෙනි, මෙය කිඹුල් භය යැයි කියනු ලැබේ.\n\nමහණෙනි, සුළි භය කවරේද? මහණෙනි, මේ ශාසනයෙහි යම් කුලපුත්‍රයෙක් ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදිව සිටී. ‘මම ජාතියෙන්ද, ජරාවෙන්ද, මරණයෙන්ද, ශෝකයෙන්ද, වැලපීමෙන්ද, දුකෙන්ද, දොම්නසින්ද, උපායාසයෙන්ද පෙලී සිටිමි. දුකෙහි ගැලී, දුකෙන් පීඩිතව සිටිමි. මේ සියලු දුක් සමුදාය අවසන් කිරීමක් තිබේ නම් හොඳයැ’යි ඔහු සිතයි. එලෙස පැවිදි වූ ඔහු පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු ගෙන, ආරක්‍ෂා නොකළ කයින්, ආරක්‍ෂා නොකළ වචනයෙන්, ආරක්‍ෂා නොකළ සිතින්, නොපිහිටි සිහියෙන්, සංවර නොකළ ඉන්ද්‍රියයන් සහිතව ගමකට හෝ නියම්ගමකට හෝ පිඬු සිඟා පිවිසේ. ඔහු එහිදී ගෘහපතියෙකු හෝ ගෘහපති පුත්‍රයෙකු හෝ පංච කාම ගුණයන්ගෙන් පරිපූර්ණව, ඒවාට ඇලුම්ව, භුක්ති විඳිමින් සිටිනවා දකී.\n\nඔහුට මෙසේ සිතේ: ‘අපි පෙර ගිහිව සිටින කල පංච කාමගුණවලින් සමන්විතව, ඒවාට ඇලී වාසය කළෙමු. මාගේ කුලයේ භෝග සම්පත් තිබේ. ඒ භෝග සම්පත් පරිභෝග කිරීමටත්, පින්කම් කිරීමටත් පුළුවන. ඉතින්, මම ශික්ෂාව අත්හැර, පහත් තත්ත්වයට (ගිහි ජීවිතයට) හැරී, භෝග සම්පත් පරිභෝග කරමින්, පින්කම් කරන්නට යනවා නම් කොපමණ හොඳදැයි!’ ඔහු ශික්ෂාව අත්හැර, පහත් තත්ත්වයට හැරෙයි. මහණෙනි, මේ භික්ෂුව ‘ආවට්ටභය’ නම් වූ බියට බිය වී, ශික්ෂාව අත්හැර, පහත් තත්ත්වයට හැරුණු භික්ෂුවක් යැයි කියනු ලැබේ. මහණෙනි, ‘ආවට්ටභය’ යනු පංච කාමගුණවලටම නමකි. මහණෙනි, මෙය ‘ආවට්ටභය’ යැයි කියනු ලැබේ.\n\n\"මහණෙනි, ‘සුසුකාභය’ යනු කුමක්ද? මහණෙනි, මෙහි ඇතැම් කුලපුත්‍රයෙක් ශ්‍රද්ධාවෙන් යුතුව ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වී සිටියි – ‘මම ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, කම්පාවීමෙන් පෙළෙමි, දුකින් වෙලී සිටිමි, දුකට පත්ව සිටිමි. මේ සියලු දුක් සමූහයේ කෙළවරක් පෙනේවා’ යන අදහසින්. එසේ පැවිදි වූ ඔහු, පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන, ආරක්ෂා රහිත කයින්, ආරක්ෂා රහිත වචනයෙන්, ආරක්ෂා රහිත සිතින්, අනුපස්ථාන රහිත සතියෙන්, අසංවර වූ ඉන්ද්‍රියයන්ගෙන් යුතුව ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතය පිණිස පිවිසෙයි. ඔහු එහිදී අඩු සිවුරු ඇඳගත් හෝ අඩු වස්ත්‍ර පොරවාගත් ස්ත්‍රියක් දකිනු ලැබෙයි. ඔහු අඩු සිවුරු ඇඳගත් හෝ අඩු වස්ත්‍ර පොරවාගත් ඒ ස්ත්‍රිය දැකීමෙන් රාගය සිත විනාශ කරයි. ඔහු රාගයෙන් පෙළුණු සිතින් ශික්ෂාව අත්හැර, පහත් තත්ත්වයට හැරෙයි. මහණෙනි, මේ භික්ෂුව ‘සුසුකාභය’ නම් වූ බියට බිය වී, ශික්ෂාව අත්හැර, පහත් තත්ත්වයට හැරුණු භික්ෂුවක් යැයි කියනු ලැබේ. මහණෙනි, ‘සුසුකාභය’ යනු ස්ත්‍රියකටම නමකි. මහණෙනි, මෙය ‘සුසුකාභය’ යැයි කියනු ලැබේ. මහණෙනි, මේ ධර‍්ම විනයෙහි ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වූ ඇතැම් කුලපුත්‍රයෙකුට මේ භය හතර අපේක්ෂා කළ යුත්තාහු ය. දෙවෙනි කොටසයි.",
      "paliTitle": "Ūmibhayasuttaṃ",
      "englishTitle": "The Wave-Fear Sutta",
      "sinhalaTitle": "ඌමිභය සූත්‍රය"
    },
    {
      "number": 123,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? [kathā. 671 ādayo] Idha, bhikkhave, ekacco puggalo vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati. Tattha ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Brahmakāyikānaṃ, bhikkhave, devānaṃ kappo āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā sati [yadidaṃ cutiyā upapattiyā cāti (ka.) a. ni. 3.117 passitabbaṃ]. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati. Tattha ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ābhassarānaṃ devānaṃ sahabyataṃ upapajjati. Ābhassarānaṃ, bhikkhave, devānaṃ dve kappā āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā sati. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati. Tattha ṭhito tadadhimutto tabbahulavihārī aparihīno, kālaṃ kurumāno subhakiṇhānaṃ devānaṃ sahabyataṃ upapajjati. Subhakiṇhānaṃ, bhikkhave, devānaṃ cattāro kappā āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā sati. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati. Tattha ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno vehapphalānaṃ devānaṃ sahabyataṃ upapajjati. Vehapphalānaṃ, bhikkhave, devānaṃ pañca kappasatāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā sati. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ.",
      "english": "Bhikkhus, these four types of individuals are found and exist in the world. Which four? Here, bhikkhus, a certain individual, quite secluded from sensual pleasures, secluded from unwholesome states, enters and remains in the first jhana, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and happiness. That person relishes it, delights in it, and finds satisfaction in it. Abiding there, dedicated to it, dwelling predominantly in it, and not falling away from it, when that person passes away, they are reborn into the company of the Brahma-body devas. Bhikkhus, the life-span of the Brahma-body devas is one eon. There, the unenlightened individual, having remained for their full life-span, having exhausted the entire measure of those devas' life, goes to hell, or to the animal realm, or to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for their full life-span, having exhausted the entire measure of those devas' life, attains final Nibbana in that very existence. This, bhikkhus, is the distinction, this is the special feature, this is the difference between a well-instructed noble disciple and an uninstructed unenlightened individual, namely, in their destination and rebirth.\n\nFurthermore, bhikkhus, a certain individual, with the calming of initial application and sustained application, attains internal tranquility and unification of mind, and enters and remains in the second jhana, which is without initial application and sustained application, born of concentration, and filled with rapture and happiness. That person relishes it, delights in it, and finds satisfaction in it. Abiding there, dedicated to it, dwelling predominantly in it, and not falling away from it, when that person passes away, they are reborn into the company of the Abhassara devas. Bhikkhus, the life-span of the Abhassara devas is two eons. There, the unenlightened individual, having remained for their full life-span, having exhausted the entire measure of those devas' life, goes to hell, or to the animal realm, or to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for their full life-span, having exhausted the entire measure of those devas' life, attains final Nibbana in that very existence. This, bhikkhus, is the distinction, this is the special feature, this is the difference between a well-instructed noble disciple and an uninstructed unenlightened individual, namely, in their destination and rebirth.\n\nFurthermore, bhikkhus, a certain individual, with the fading of rapture, remains equanimous, mindful, and clearly comprehending, and experiences happiness with the body, which the Noble Ones declare: ‘He dwells equanimous, mindful, and happy,’ and enters and remains in the third jhana. That person relishes it, delights in it, and finds satisfaction in it. Abiding there, dedicated to it, dwelling predominantly in it, and not falling away from it, when that person passes away, they are reborn into the company of the Subhakinha devas. Bhikkhus, the life-span of the Subhakinha devas is four eons. There, the unenlightened individual, having remained for their full life-span, having exhausted the entire measure of those devas' life, goes to hell, or to the animal realm, or to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for their full life-span, having exhausted the entire measure of those devas' life, attains final Nibbana in that very existence. This, bhikkhus, is the distinction, this is the special feature, this is the difference between a well-instructed noble disciple and an uninstructed unenlightened individual, namely, in their destination and rebirth.\n\nFurthermore, bhikkhus, a certain individual, with the abandonment of pleasure and pain, and with the prior fading away of joy and sorrow, enters and remains in the fourth jhana, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. That person relishes it, delights in it, and finds satisfaction in it. Abiding there, dedicated to it, dwelling predominantly in it, and not falling away from it, when that person passes away, they are reborn into the company of the Vehapphala devas. Bhikkhus, the life-span of the Vehapphala devas is five hundred eons. There, the unenlightened individual, having remained for their full life-span, having exhausted the entire measure of those devas' life, goes to hell, or to the animal realm, or to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for their full life-span, having exhausted the entire measure of those devas' life, attains final Nibbana in that very existence. This, bhikkhus, is the distinction, this is the special feature, this is the difference between a well-instructed noble disciple and an uninstructed unenlightened individual, namely, in their destination and rebirth.\n\nThese, bhikkhus, are the four types of individuals found and existing in the world.",
      "sinhala": "මහණෙනි, මෙලොවෙහි පුද්ගලයෝ සතර දෙනෙක් සිටිති, වෙසෙති. ඒ සතර දෙනා කවරහුද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති ප්‍රථම ධ්‍යානයට එළඹ වාසය කරයි. ඒ තැනැත්තා එය ආස්වාදනය කරයි, එයට කැමැත්තක් දක්වයි, එයින් සතුටට පත්වේ. එහි පිහිටා, එයට අධිමුක්තව, එය බහුල වශයෙන් විහරණ කොට, පිරිහීමට පත් නොවී කලුරිය කර බ්‍රහ්මකායික දෙවියන්ගේ සහභාවයට (සමීපත්වයට) උපදී. මහණෙනි, බ්‍රහ්මකායික දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්පයකි. එහිදී පෘථග්ජන තැනැත්තා තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු එහි සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, නිරයටද යයි, තිරිසන් යෝනියටද යයි, ප්‍රේත ලෝකයටද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහි තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, එම භවයෙහිම පිරිනිවන් පායි. මහණෙනි, ශ්‍රැතවත් ආර්යශ්‍රාවකයාට සහ අශ්‍රැතවත් පෘථග්ජනයාට අතර ඇති වෙනස, අධිප්‍රාය, නානාත්වය මෙයයි, එනම් ගතිය හා උප්පත්තිය (මරණය හා උත්පත්තිය) සම්බන්ධයෙනි.\n\nනැවතද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් විතර්ක විචාරයන් සංසිඳීමෙන්, සිතේ අධ්‍යාත්මික පැහැදීමක්, සිතේ එකඟතාවක් ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරයි. ඒ තැනැත්තා එය ආස්වාදනය කරයි, එයට කැමැත්තක් දක්වයි, එයින් සතුටට පත්වේ. එහි පිහිටා, එයට අධිමුක්තව, එය බහුල වශයෙන් විහරණ කොට, පිරිහීමට පත් නොවී කලුරිය කර ආභස්සර දෙවියන්ගේ සහභාවයට (සමීපත්වයට) උපදී. මහණෙනි, ආභස්සර දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්ප දෙකකි. එහිදී පෘථග්ජන තැනැත්තා තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු එහි සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, නිරයටද යයි, තිරිසන් යෝනියටද යයි, ප්‍රේත ලෝකයටද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහි තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, එම භවයෙහිම පිරිනිවන් පායි. මහණෙනි, ශ්‍රැතවත් ආර්යශ්‍රාවකයාට සහ අශ්‍රැතවත් පෘථග්ජනයාට අතර ඇති වෙනස, අධිප්‍රාය, නානාත්වය මෙයයි, එනම් ගතිය හා උප්පත්තිය සම්බන්ධයෙනි.\n\nනැවතද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප්‍රීතියද, විරාගයද නිසා උපේක්ෂාවෙන් යුතුව වාසය කරයි, සිහි ඇතිව, මනා ප්‍රඥාවෙන් යුතුව, කයින්ද සැපය අනුභව කරයි. ආර්යයෝ යමක් 'උපේක්ෂාවෙන් යුක්ත වූ, සිහි ඇති, සැප විහරණ ඇති' යැයි කියත්ද, ඒ තෙවන ධ්‍යානයට එළඹ වාසය කරයි. ඒ තැනැත්තා එය ආස්වාදනය කරයි, එයට කැමැත්තක් දක්වයි, එයින් සතුටට පත්වේ. එහි පිහිටා, එයට අධිමුක්තව, එය බහුල වශයෙන් විහරණ කොට, පිරිහීමට පත් නොවී කලුරිය කර සුභකිණ්හ දෙවියන්ගේ සහභාවයට (සමීපත්වයට) උපදී. මහණෙනි, සුභකිණ්හ දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්ප සතරකි. එහිදී පෘථග්ජන තැනැත්තා තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු එහි සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, නිරයටද යයි, තිරිසන් යෝනියටද යයි, ප්‍රේත ලෝකයටද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහි තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, එම භවයෙහිම පිරිනිවන් පායි. මහණෙනි, ශ්‍රැතවත් ආර්යශ්‍රාවකයාට සහ අශ්‍රැතවත් පෘථග්ජනයාට අතර ඇති වෙනස, අධිප්‍රාය, නානාත්වය මෙයයි, එනම් ගතිය හා උප්පත්තිය සම්බන්ධයෙනි.\n\nනැවතද මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සැපයද ප්‍රහාණය කිරීමෙන්, දුකද ප්‍රහාණය කිරීමෙන්, පෙර තිබූ සෝමනස්ස-දෝමනස්සයන් අභාවයට යාමෙන්, දුක් රහිත, සැප රහිත වූ, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට එළඹ වාසය කරයි. ඒ තැනැත්තා එය ආස්වාදනය කරයි, එයට කැමැත්තක් දක්වයි, එයින් සතුටට පත්වේ. එහි පිහිටා, එයට අධිමුක්තව, එය බහුල වශයෙන් විහරණ කොට, පිරිහීමට පත් නොවී කලුරිය කර වෙහප්ඵල දෙවියන්ගේ සහභාවයට (සමීපත්වයට) උපදී. මහණෙනි, වෙහප්ඵල දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්ප පන්සියයකි. එහිදී පෘථග්ජන තැනැත්තා තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු එහි සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, නිරයටද යයි, තිරිසන් යෝනියටද යයි, ප්‍රේත ලෝකයටද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහි තමාට නියමිත ආයුෂ ප්‍රමාණය තිබෙන තුරු සිට, ඒ දෙවියන්ගේ සම්පූර්ණ ආයුෂ ප්‍රමාණය ගෙවා, එම භවයෙහිම පිරිනිවන් පායි. මහණෙනි, ශ්‍රැතවත් ආර්යශ්‍රාවකයාට සහ අශ්‍රැතවත් පෘථග්ජනයාට අතර ඇති වෙනස, අධිප්‍රාය, නානාත්වය මෙයයි, එනම් ගතිය හා උප්පත්තිය සම්බන්ධයෙනි. මහණෙනි, මෙලොවෙහි සිටින, වෙසෙන පුද්ගලයෝ මේ සතර දෙනා වෙති.",
      "paliTitle": "Paṭhamanānākaraṇasuttaṃ",
      "englishTitle": "The First Discourse on Diversity",
      "sinhalaTitle": "පළමු නානාකරණ සූත‍්‍රය"
    },
    {
      "number": 124,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So kāyassa bhedā paraṃ maraṇā suddhāvāsānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ, bhikkhave, upapatti asādhāraṇā puthujjanehi. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So kāyassa bhedā paraṃ maraṇā suddhāvāsānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ, bhikkhave, upapatti asādhāraṇā puthujjanehi. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Catutthaṃ.",
      "english": "Monks, these four individuals are found, are present in the world. Which four? Here, monks, a certain individual, quite secluded from sensual pleasures, secluded from unwholesome states, with applied thought and sustained thought, born of seclusion, filled with rapture and happiness, enters and dwells in the first jhana. Whatever there is therein that is related to form, related to feeling, related to perception, related to mental formations, related to consciousness – he contemplates these phenomena as impermanent, as suffering, as a disease, as a boil, as a dart, as an affliction, as an ailment, as alien, as disintegrating, as empty, as not-self. With the breaking up of the body, after death, he reappears in companionship with the gods of the Pure Abodes. Monks, this reappearance is not shared by ordinary people.\n\nFurther, monks, here a certain individual, with the fading away of applied thought and sustained thought, with the internal assurance and unification of mind, without applied thought and sustained thought, born of concentration, filled with rapture and happiness, enters and dwells in the second jhana. With the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body, of which the Noble Ones declare: 'He dwells in equanimity, mindful and happy,' he enters and dwells in the third jhana. With the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, he enters and dwells in the fourth jhana, which is neither painful nor pleasant, but purified by equanimity and mindfulness. Whatever there is therein that is related to form, related to feeling, related to perception, related to mental formations, related to consciousness – he contemplates these phenomena as impermanent, as suffering, as a disease, as a boil, as a dart, as an affliction, as an ailment, as alien, as disintegrating, as empty, as not-self. With the breaking up of the body, after death, he reappears in companionship with the gods of the Pure Abodes. Monks, this reappearance is not shared by ordinary people. Monks, these are the four individuals found, present in the world.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ලෝකයෙහි පුද්ගලයෝ සතර දෙනෙක් සිටිති, පෙනී සිටිති. කවරහු ද ඒ සතර දෙනා? භික්ෂූන් වහන්ස, මෙහිලා එක්තරා පුද්U+200Dගලයෙක් කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැප ඇති පළමුවන ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු එහි ඇති යම් රූප, වේදනා, සංඥා, සංස්කාර, විඤ්ඤාණ ධර්මයන් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, ව්‍යසනයක් වශයෙන්, ආබාධයක් වශයෙන්, අන්‍ය වූවක් වශයෙන්, විනාශ වන ස්වභාවයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්U+200Dම වශයෙන් මැනවින් මෙනෙහි කරයි. ඔහු කය බිඳී මරණයෙන් පසු ශුද්ධාවාසී දෙවියන් අතර උපදී. භික්ෂූන් වහන්ස, මේ උපත පෘථග්U+200Dජන පුද්ගලයන්ට පොදු නොවේ.\n\nභික්ෂූන් වහන්ස, නැවතත් තවත් එක්තරා පුද්U+200Dගලයෙක් මෙහිලා, විතර්ක විචාරයන් සංසිඳවීමෙන්, තමා තුළ පැහැදීම ඇතිකරගෙන, සිත එකඟ කරගෙන, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීතිය හා සැප ඇති දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු එහි ඇති යම් රූප, වේදනා, සංඥා, සංස්කාර, විඤ්ඤාණ ධර්මයන් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, ව්‍යසනයක් වශයෙන්, ආබාධයක් වශයෙන්, අන්‍ය වූවක් වශයෙන්, විනාශ වන ස්වභාවයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්U+200Dම වශයෙන් මැනවින් මෙනෙහි කරයි. ඔහු කය බිඳී මරණයෙන් පසු ශුද්ධාවාසී දෙවියන් අතර උපදී. භික්ෂූන් වහන්ස, මේ උපත පෘථග්U+200Dජන පුද්ගලයන්ට පොදු නොවේ. නැවතත්, භික්ෂූන් වහන්ස, තවත් එක්තරා පුද්U+200Dගලයෙක් මෙහිලා, ප්‍රීතිය කෙරෙහි ද නොඇලීමෙන්, උපේක්ෂාවෙන් යුතුව වාසය කරමින්, සිහි නුවණින් යුක්තව, ශරීරයෙන් සැපයක් විඳී. ආර්U+200Dයයන් වහන්සේලා යමක් 'උපේක්ෂා සහගතව සිහි නුවණින් යුක්තව සැප විහරණය කරයි' යැයි කියත් ද, එවන් තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු එහි ඇති යම් රූප, වේදනා, සංඥා, සංස්කාර, විඤ්ඤාණ ධර්මයන් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, ව්‍යසනයක් වශයෙන්, ආබාධයක් වශයෙන්, අන්‍ය වූවක් වශයෙන්, විනාශ වන ස්වභාවයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්U+200Dම වශයෙන් මැනවින් මෙනෙහි කරයි. ඔහු කය බිඳී මරණයෙන් පසු ශුද්ධාවාසී දෙවියන් අතර උපදී. භික්ෂූන් වහන්ස, මේ උපත පෘථග්U+200Dජන පුද්ගලයන්ට පොදු නොවේ. නැවතත්, භික්ෂූන් වහන්ස, තවත් එක්තරා පුද්U+200Dගලයෙක් මෙහිලා, සැපය සහ දුක යන දෙකම ප්‍රහීණ කිරීමෙන් ද, පෙර සිටි සෝමනස්ස සහ දෝමනස්ස අතුරුදහන් වීමෙන් ද, දුක් රහිත වූ ද, සැප රහිත වූ ද, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු එහි ඇති යම් රූප, වේදනා, සංඥා, සංස්කාර, විඤ්ඤාණ ධර්මයන් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, ව්‍යසනයක් වශයෙන්, ආබාධයක් වශයෙන්, අන්‍ය වූවක් වශයෙන්, විනාශ වන ස්වභාවයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්U+200Dම වශයෙන් මැනවින් මෙනෙහි කරයි. ඔහු කය බිඳී මරණයෙන් පසු ශුද්ධාවාසී දෙවියන් අතර උපදී. භික්ෂූන් වහන්ස, මේ උපත පෘථග්U+200Dජන පුද්ගලයන්ට පොදු නොවේ. භික්ෂූන් වහන්ස, මේ සතර දෙනාම ලෝකයෙහි සිටින, පෙනී සිටින පුද්U+200Dගලයෝ වෙති.",
      "paliTitle": "Dutiyanānākaraṇasuttaṃ",
      "englishTitle": "The Second Discourse on Distinction",
      "sinhalaTitle": "දෙවන නානාකරණ සූත්‍‌රය"
    },
    {
      "number": 125,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati. Tattha ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Brahmakāyikānaṃ, bhikkhave, devānaṃ kappo āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā sati. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So tadassādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati. Tattha ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ābhassarānaṃ [syāmapotthake pana karuṇādayo tayo vihārā ābhassarādīhi tīhi visuṃ visuṃ yojetvā paripuṇṇameva dassitaṃ] devānaṃ sahabyataṃ upapajjati. Ābhassarānaṃ, bhikkhave, devānaṃ dve kappā āyuppamāṇaṃ…pe… subhakiṇhānaṃ [syāmapotthake pana karuṇādayo tayo vihārā ābhassarādīhi tīhi visuṃ visuṃ yojetvā paripuṇṇameva dassitaṃ] devānaṃ sahabyataṃ upapajjati. Subhakiṇhānaṃ, bhikkhave, devānaṃ cattāro kappā āyuppamāṇaṃ…pe… vehapphalānaṃ devānaṃ sahabyataṃ upapajjati. Vehapphalānaṃ, bhikkhave, devānaṃ pañca kappasatāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā sati. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Pañcamaṃ.",
      "english": "“Monks, these four types of individuals are present and found in the world. Which four? Here, monks, a certain individual dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all aspects, pervading the entire world with a mind imbued with loving-kindness, vast, exalted, immeasurable, free from enmity, free from ill-will, he dwells. He delights in that, he enjoys that, and through that, he experiences satisfaction. Abiding therein, devoted to it, dwelling much in it, and not falling away from it, when he passes away, he reappears in companionship with the Brahmā-devas. Monks, the lifespan of the Brahmā-devas is one eon. Therein, an ordinary uninstructed person, having remained for the full extent of that life, having exhausted the entire lifespan of those devas, may go to hell, may go to the animal realm, or may go to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for the full extent of that life, having exhausted the entire lifespan of those devas, attains final Nibbāna in that very existence. This, monks, is the distinction, this is the difference, this is the disparity between a well-instructed noble disciple and an uninstructed ordinary person, in terms of destination and rebirth.\n\n“Furthermore, monks, here a certain individual dwells pervading one direction with a mind imbued with compassion, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all aspects, pervading the entire world with a mind imbued with compassion, vast, exalted, immeasurable, free from enmity, free from ill-will, he dwells. He delights in that, he enjoys that, and through that, he experiences satisfaction. Abiding therein, devoted to it, dwelling much in it, and not falling away from it, when he passes away, he reappears in companionship with the Ābhassara devas. Monks, the lifespan of the Ābhassara devas is two eons. Therein, an ordinary uninstructed person, having remained for the full extent of that life, having exhausted the entire lifespan of those devas, may go to hell, may go to the animal realm, or may go to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for the full extent of that life, having exhausted the entire lifespan of those devas, attains final Nibbāna in that very existence. This, monks, is the distinction, this is the difference, this is the disparity between a well-instructed noble disciple and an uninstructed ordinary person, in terms of destination and rebirth.\nA certain individual dwells pervading one direction with a mind imbued with appreciative joy, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all aspects, pervading the entire world with a mind imbued with appreciative joy, vast, exalted, immeasurable, free from enmity, free from ill-will, he dwells. He delights in that, he enjoys that, and through that, he experiences satisfaction. Abiding therein, devoted to it, dwelling much in it, and not falling away from it, when he passes away, he reappears in companionship with the Subhakiṇha devas. Monks, the lifespan of the Subhakiṇha devas is four eons. Therein, an ordinary uninstructed person, having remained for the full extent of that life, having exhausted the entire lifespan of those devas, may go to hell, may go to the animal realm, or may go to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for the full extent of that life, having exhausted the entire lifespan of those devas, attains final Nibbāna in that very existence. This, monks, is the distinction, this is the difference, this is the disparity between a well-instructed noble disciple and an uninstructed ordinary person, in terms of destination and rebirth.\nA certain individual dwells pervading one direction with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all aspects, pervading the entire world with a mind imbued with equanimity, vast, exalted, immeasurable, free from enmity, free from ill-will, he dwells. He delights in that, he enjoys that, and through that, he experiences satisfaction. Abiding therein, devoted to it, dwelling much in it, and not falling away from it, when he passes away, he reappears in companionship with the Vehapphala devas. Monks, the lifespan of the Vehapphala devas is five hundred eons. Therein, an ordinary uninstructed person, having remained for the full extent of that life, having exhausted the entire lifespan of those devas, may go to hell, may go to the animal realm, or may go to the realm of hungry ghosts. However, a disciple of the Fortunate One, having remained there for the full extent of that life, having exhausted the entire lifespan of those devas, attains final Nibbāna in that very existence. This, monks, is the distinction, this is the difference, this is the disparity between a well-instructed noble disciple and an uninstructed ordinary person, in terms of destination and rebirth. These, monks, are the four types of individuals who are present and found in the world.”",
      "sinhala": "භික්ෂූණි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයේ සිටිති, පවතිති. ඒ සතර දෙනා කවරහුද? භික්ෂූණි, මෙහිලා එක්තරා පුද්ගලයෙක් මෛත්‍රී සහගත සිතින් එක දිශාවක් පතුරුවාගෙන වාසය කරයි, එලෙසම දෙවන දිශාවක්, එලෙසම තෙවන දිශාවක්, එලෙසම සිව්වන දිශාවක් (පතුරුවාගෙන වාසය කරයි). මෙලෙස උඩ, යට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, සියලු ලෝකය මෛත්‍රී සහගත, මහත් වූ, උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ සිතින් පතුරුවාගෙන වාසය කරයි. ඔහු එයින් සතුටු වේ, එයට ඇලෙයි, තෘප්තියට පත් වේ. එහි (ඒ භාවනාවේ) පිහිටා, එයටම නැඹුරු වී, එයින් බහුල වූ විහරණයෙන් යුක්තව, පිරිහීමක් නොමැතිව කලුරිය කරන්නේ බ්‍රහ්මකායික දෙවියන්ගේ සහාය භාවයට (බ්‍රහ්ම ලෝකයට) උපදී. භික්ෂූණි, බ්‍රහ්මකායික දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්පයකි. එහිලා පෘථග්ජන පුද්ගලයා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) නිරයට ද යයි, තිරිසන් යෝනියට ද යයි, ප්‍රේත ලෝකයට ද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහිලා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) ඒ භවයේදීම පිරිනිවන් පායි. භික්ෂූණි, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා සහ අශ්‍රැතවත් පෘථග්ජන පුද්ගලයා අතර ඇති වෙනස මෙයයි, මේ අභිප්‍රාය මෙයයි, මේ විභේදනය මෙයයි, එනම් ගතිය හා උපපත්තිය පවතින කල්හි ය.\n\nභික්ෂූණි, තවද, මෙහිලා එක්තරා පුද්ගලයෙක් කරුණා සහගත සිතින් එක දිශාවක් පතුරුවාගෙන වාසය කරයි, එලෙසම දෙවන දිශාවක්, එලෙසම තෙවන දිශාවක්, එලෙසම සිව්වන දිශාවක් (පතුරුවාගෙන වාසය කරයි). මෙලෙස උඩ, යට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, සියලු ලෝකය කරුණා සහගත, මහත් වූ, උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ සිතින් පතුරුවාගෙන වාසය කරයි. ඔහු එයින් සතුටු වේ, එයට ඇලෙයි, තෘප්තියට පත් වේ. එහි (ඒ භාවනාවේ) පිහිටා, එයටම නැඹුරු වී, එයින් බහුල වූ විහරණයෙන් යුක්තව, පිරිහීමක් නොමැතිව කලුරිය කරන්නේ ආභස්සර දෙවියන්ගේ සහාය භාවයට (ආභස්සර බ්‍රහ්ම ලෝකයට) උපදී. භික්ෂූණි, ආභස්සර දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්ප දෙකකි. එහිලා පෘථග්ජන පුද්ගලයා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) නිරයට ද යයි, තිරිසන් යෝනියට ද යයි, ප්‍රේත ලෝකයට ද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහිලා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) ඒ භවයේදීම පිරිනිවන් පායි. භික්ෂූණි, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා සහ අශ්‍රැතවත් පෘථග්ජන පුද්ගලයා අතර ඇති වෙනස මෙයයි, මේ අභිප්‍රාය මෙයයි, මේ විභේදනය මෙයයි, එනම් ගතිය හා උපපත්තිය පවතින කල්හි ය. තවද, භික්ෂූණි, මෙහිලා එක්තරා පුද්ගලයෙක් මුදිතා සහගත සිතින් එක දිශාවක් පතුරුවාගෙන වාසය කරයි, එලෙසම දෙවන දිශාවක්, එලෙසම තෙවන දිශාවක්, එලෙසම සිව්වන දිශාවක් (පතුරුවාගෙන වාසය කරයි). මෙලෙස උඩ, යට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, සියලු ලෝකය මුදිතා සහගත, මහත් වූ, උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ සිතින් පතුරුවාගෙන වාසය කරයි. ඔහු එයින් සතුටු වේ, එයට ඇලෙයි, තෘප්තියට පත් වේ. එහි (ඒ භාවනාවේ) පිහිටා, එයටම නැඹුරු වී, එයින් බහුල වූ විහරණයෙන් යුක්තව, පිරිහීමක් නොමැතිව කලුරිය කරන්නේ සුභකිණ්හ දෙවියන්ගේ සහාය භාවයට (සුභකිණ්හ බ්‍රහ්ම ලෝකයට) උපදී. භික්ෂූණි, සුභකිණ්හ දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්ප සතරකි. එහිලා පෘථග්ජන පුද්ගලයා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) නිරයට ද යයි, තිරිසන් යෝනියට ද යයි, ප්‍රේත ලෝකයට ද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහිලා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) ඒ භවයේදීම පිරිනිවන් පායි. භික්ෂූණි, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා සහ අශ්‍රැතවත් පෘථග්ජන පුද්ගලයා අතර ඇති වෙනස මෙයයි, මේ අභිප්‍රාය මෙයයි, මේ විභේදනය මෙයයි, එනම් ගතිය හා උපපත්තිය පවතින කල්හි ය. තවද, භික්ෂූණි, මෙහිලා එක්තරා පුද්ගලයෙක් උපේක්ෂා සහගත සිතින් එක දිශාවක් පතුරුවාගෙන වාසය කරයි, එලෙසම දෙවන දිශාවක්, එලෙසම තෙවන දිශාවක්, එලෙසම සිව්වන දිශාවක් (පතුරුවාගෙන වාසය කරයි). මෙලෙස උඩ, යට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, සියලු ලෝකය උපේක්ෂා සහගත, මහත් වූ, උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ සිතින් පතුරුවාගෙන වාසය කරයි. ඔහු එයින් සතුටු වේ, එයට ඇලෙයි, තෘප්තියට පත් වේ. එහි (ඒ භාවනාවේ) පිහිටා, එයටම නැඹුරු වී, එයින් බහුල වූ විහරණයෙන් යුක්තව, පිරිහීමක් නොමැතිව කලුරිය කරන්නේ වේහප්ඵල දෙවියන්ගේ සහාය භාවයට (වේහප්ඵල බ්‍රහ්ම ලෝකයට) උපදී. භික්ෂූණි, වේහප්ඵල දෙවියන්ගේ ආයුෂ ප්‍රමාණය කල්ප පන්සියයකි. එහිලා පෘථග්ජන පුද්ගලයා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) නිරයට ද යයි, තිරිසන් යෝනියට ද යයි, ප්‍රේත ලෝකයට ද යයි. නමුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා එහිලා තම ආයු කාලය පුරා සිට, ඒ දෙවියන්ගේ ආයු ප්‍රමාණය කොපමණද, ඒ සියල්ල ගෙවා (අවසන් කොට) ඒ භවයේදීම පිරිනිවන් පායි. භික්ෂූණි, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා සහ අශ්‍රැතවත් පෘථග්ජන පුද්ගලයා අතර ඇති වෙනස මෙයයි, මේ අභිප්‍රාය මෙයයි, මේ විභේදනය මෙයයි, එනම් ගතිය හා උපපත්තිය පවතින කල්හි ය. භික්ෂූණි, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයේ සිටිති, පවතිති.",
      "paliTitle": "Paṭhamamettāsuttaṃ",
      "englishTitle": "First Loving-Kindness Sutta",
      "sinhalaTitle": "පඨම මෙත්‍ත‍ා සූත්‍රය"
    },
    {
      "number": 126,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So kāyassa bhedā paraṃ maraṇā suddhāvāsānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ, bhikkhave, upapatti asādhāraṇā puthujjanehi. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo karuṇā…pe… muditā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So kāyassa bhedā paraṃ maraṇā suddhāvāsānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ, bhikkhave, upapatti asādhāraṇā puthujjanehi. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Chaṭṭhaṃ.",
      "english": "Monks, these four individuals exist, are found in the world. Which four? Here, monks, a certain individual dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, he dwells pervading the entire world—above, below, around, everywhere, in every respect, with a mind imbued with loving-kindness, vast, exalted, immeasurable, without hostility, without ill-will. Whatever form, feeling, perception, mental formations, or consciousness exist there, he discerns these phenomena as impermanent, suffering, a disease, a boil, a dart, a calamity, an affliction, alien, subject to disintegration, empty, non-self. Upon the dissolution of the body, after death, he reappears in companionship with the devas of the Pure Abodes. Monks, this reappearance is not common to ordinary people.\n\nAgain, monks, here a certain individual dwells pervading one direction with a mind imbued with compassion, and likewise with a mind imbued with sympathetic joy, and likewise with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus, he dwells pervading the entire world—above, below, around, everywhere, in every respect, with a mind imbued with equanimity, vast, exalted, immeasurable, without hostility, without ill-will. Whatever form, feeling, perception, mental formations, or consciousness exist there, he discerns these phenomena as impermanent, suffering, a disease, a boil, a dart, a calamity, an affliction, alien, subject to disintegration, empty, non-self. Upon the dissolution of the body, after death, he reappears in companionship with the devas of the Pure Abodes. Monks, this reappearance is not common to ordinary people.\n\nMonks, these four individuals exist, are found in the world.",
      "sinhala": "භික්ෂූනි, මේ සිවු පුද්ගලයෝ ලෝකයෙහි සිටිති, පවතිති. කවරහුද ඒ සිවු දෙනා?\n\nභික්ෂූනි, මෙහිලා එක්තරා පුද්ගලයෙක් මෛත්‍රී සහගත වූ සිතින් එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවෙනි දිශාවද, එසේම තෙවෙනි දිශාවද, එසේම සතරවෙනි දිශාවද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියලු අයුරින්, සියලු ලෝකයට මෛත්‍රී සහගත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පැතිර වාසය කරයි. ඔහු ඒ මොන යම් රූපගත වූ, වේදනාගත වූ, සංඥාගත වූ, සංස්කාරගත වූ, විඥානගත වූ ධර්මයක් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, අඝයක් වශයෙන්, ආබාධයක් වශයෙන්, පර දෙයක් වශයෙන්, දිරා යන දෙයක් වශයෙන්, ශුන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. හෙතෙම කය බිඳී මරණින් මතු ශුද්ධාවාස දෙවියන්ගේ සහභාවයට පැමිණේ. භික්ෂූනි, මේ උපත පෘථග්ජනයන් සමඟ පොදු නොවූවකි.\n\nභික්ෂූනි, තවද, මෙහිලා එක්තරා පුද්ගලයෙක් කරුණා සහගත වූ සිතින් එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවෙනි දිශාවද, එසේම තෙවෙනි දිශාවද, එසේම සතරවෙනි දිශාවද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියලු අයුරින්, සියලු ලෝකයට කරුණා සහගත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පැතිර වාසය කරයි. ඔහු ඒ මොන යම් රූපගත වූ, වේදනාගත වූ, සංඥාගත වූ, සංස්කාරගත වූ, විඥානගත වූ ධර්මයක් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, අඝයක් වශයෙන්, ආබාධයක් වශයෙන්, පර දෙයක් වශයෙන්, දිරා යන දෙයක් වශයෙන්, ශුන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. හෙතෙම කය බිඳී මරණින් මතු ශුද්ධාවාස දෙවියන්ගේ සහභාවයට පැමිණේ. භික්ෂූනි, මේ උපත පෘථග්ජනයන් සමඟ පොදු නොවූවකි.\n\nභික්ෂූනි, තවද, මෙහිලා එක්තරා පුද්ගලයෙක් මුදිතා සහගත වූ සිතින් එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවෙනි දිශාවද, එසේම තෙවෙනි දිශාවද, එසේම සතරවෙනි දිශාවද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියලු අයුරින්, සියලු ලෝකයට මුදිතා සහගත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පැතිර වාසය කරයි. ඔහු ඒ මොන යම් රූපගත වූ, වේදනාගත වූ, සංඥාගත වූ, සංස්කාරගත වූ, විඥානගත වූ ධර්මයක් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, අඝයක් වශයෙන්, ආබාධයක් වශයෙන්, පර දෙයක් වශයෙන්, දිරා යන දෙයක් වශයෙන්, ශුන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. හෙතෙම කය බිඳී මරණින් මතු ශුද්ධාවාස දෙවියන්ගේ සහභාවයට පැමිණේ. භික්ෂූනි, මේ උපත පෘථග්ජනයන් සමඟ පොදු නොවූවකි.\n\nභික්ෂූනි, තවද, මෙහිලා එක්තරා පුද්ගලයෙක් උපේක්ෂා සහගත වූ සිතින් එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවෙනි දිශාවද, එසේම තෙවෙනි දිශාවද, එසේම සතරවෙනි දිශාවද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියලු අයුරින්, සියලු ලෝකයට උපේක්ෂා සහගත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පැතිර වාසය කරයි. ඔහු ඒ මොන යම් රූපගත වූ, වේදනාගත වූ, සංඥාගත වූ, සංස්කාරගත වූ, විඥානගත වූ ධර්මයක් වේද, ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, අඝයක් වශයෙන්, ආබාධයක් වශයෙන්, පර දෙයක් වශයෙන්, දිරා යන දෙයක් වශයෙන්, ශුන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. හෙතෙම කය බිඳී මරණින් මතු ශුද්ධාවාස දෙවියන්ගේ සහභාවයට පැමිණේ. භික්ෂූනි, මේ උපත පෘථග්ජනයන් සමඟ පොදු නොවූවකි.\n\nභික්ෂූනි, මේ සිවු පුද්ගලයෝ ලෝකයෙහි සිටිති, පවතිති.",
      "paliTitle": "Dutiyamettāsuttaṃ",
      "englishTitle": "The Second Loving-Kindness Sutta",
      "sinhalaTitle": "දෙවැනි මෙත්තා සූත‍්‍රය"
    },
    {
      "number": 127,
      "pali": "‘‘Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā cattāro acchariyā abbhutā dhammā [abbhutadhammā (syā. kaṃ. ka.)] pātubhavanti. Katame cattāro? Yadā, bhikkhave, bodhisatto tusitā kāyā cavitvā sato sampajāno mātukucchiṃ okkamati, atha sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yāpi tā lokantarikā aghā asaṃvutā andhakārā andhakāratimisā yatthapimesaṃ [yatthimesaṃ (sī. syā. kaṃ.)] candimasūriyānaṃ evaṃmahiddhikānaṃ evaṃmahānubhāvānaṃ ābhā nānubhonti, tatthapi appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yepi tattha sattā upapannā tepi tenobhāsena aññamaññaṃ sañjānanti – ‘aññepi kira, bho, santi sattā idhūpapannā’ti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ paṭhamo acchariyo abbhuto dhammo [abbhutadhammo (syā. kaṃ. ka.)] pātubhavati. ‘‘Puna caparaṃ, bhikkhave, yadā bodhisatto sato sampajāno mātukucchimhā nikkhamati, atha sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yāpi tā lokantarikā aghā asaṃvutā andhakārā andhakāratimisā yatthapimesaṃ candimasūriyānaṃ evaṃmahiddhikānaṃ evaṃmahānubhāvānaṃ ābhā nānubhonti, tatthapi appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yepi tattha sattā upapannā tepi tenobhāsena aññamaññaṃ sañjānanti – ‘aññepi kira, bho, santi sattā idhūpapannā’ti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ dutiyo acchariyo abbhuto dhammo pātubhavati. ‘‘Puna caparaṃ, bhikkhave, yadā tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhati, atha sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yāpi tā lokantarikā aghā asaṃvutā andhakārā andhakāratimisā yatthapimesaṃ candimasūriyānaṃ evaṃmahiddhikānaṃ evaṃmahānubhāvānaṃ ābhā nānubhonti, tatthapi appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yepi tattha sattā upapannā tepi tenobhāsena aññamaññaṃ sañjānanti – ‘aññepi kira, bho, santi sattā idhūpapannā’ti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ tatiyo acchariyo abbhuto dhammo pātubhavati. ‘‘Puna caparaṃ, bhikkhave, yadā tathāgato anuttaraṃ dhammacakkaṃ pavatteti, atha sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yāpi tā lokantarikā aghā asaṃvutā andhakārā andhakāratimisā yatthapimesaṃ candimasūriyānaṃ evaṃmahiddhikānaṃ evaṃmahānubhāvānaṃ ābhā nānubhonti, tatthapi appamāṇo uḷāro obhāso pātubhavati atikkammeva devānaṃ devānubhāvaṃ. Yepi tattha sattā upapannā tepi tenobhāsena aññamaññaṃ sañjānanti – ‘aññepi kira, bho, santi sattā idhūpapannā’ti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ catuttho acchariyo abbhuto dhammo pātubhavati. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ime cattāro acchariyā abbhutā dhammā pātubhavantī’’ti. Sattamaṃ.",
      "english": "Monks, upon the manifestation of the Tathāgata, the Arahant, the Perfectly Self-Awakened One, four astonishing and wonderful qualities appear. Which four?\n\nWhen, monks, the Bodhisatta, having descended from the Tusita realm, mindfully and clearly comprehending, enters his mother's womb, then in this world with its devas, its Māra, its Brahmā, with its ascetics and brahmins, and its divine and human beings, an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even in those inter-cosmic voids, abysses, unobstructed, dark, utterly dark, where the light of the moon and sun, though so mighty and powerful, does not penetrate, even there an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even the beings reborn there recognize each other by that radiance, thinking, 'Indeed, there are other beings reborn here!' Monks, upon the manifestation of the Tathāgata, the Arahant, the Perfectly Self-Awakened One, this is the first astonishing and wonderful quality that appears.\n\nFurthermore, monks, when the Bodhisatta, mindful and clearly comprehending, emerges from his mother's womb, then in this world with its devas, its Māra, its Brahmā, with its ascetics and brahmins, and its divine and human beings, an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even in those inter-cosmic voids, abysses, unobstructed, dark, utterly dark, where the light of the moon and sun, though so mighty and powerful, does not penetrate, even there an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even the beings reborn there recognize each other by that radiance, thinking, 'Indeed, there are other beings reborn here!' Monks, upon the manifestation of the Tathāgata, the Arahant, the Perfectly Self-Awakened One, this is the second astonishing and wonderful quality that appears.\n\nFurthermore, monks, when the Tathāgata fully awakens to unsurpassed perfect self-awakening, then in this world with its devas, its Māra, its Brahmā, with its ascetics and brahmins, and its divine and human beings, an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even in those inter-cosmic voids, abysses, unobstructed, dark, utterly dark, where the light of the moon and sun, though so mighty and powerful, does not penetrate, even there an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even the beings reborn there recognize each other by that radiance, thinking, 'Indeed, there are other beings reborn here!' Monks, upon the manifestation of the Tathāgata, the Arahant, the Perfectly Self-Awakened One, this is the third astonishing and wonderful quality that appears.\n\nFurthermore, monks, when the Tathāgata sets in motion the unsurpassed Wheel of Dhamma, then in this world with its devas, its Māra, its Brahmā, with its ascetics and brahmins, and its divine and human beings, an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even in those inter-cosmic voids, abysses, unobstructed, dark, utterly dark, where the light of the moon and sun, though so mighty and powerful, does not penetrate, even there an immeasurable, splendid radiance appears, surpassing the divine power of the devas. And even the beings reborn there recognize each other by that radiance, thinking, 'Indeed, there are other beings reborn here!' Monks, upon the manifestation of the Tathāgata, the Arahant, the Perfectly Self-Awakened One, this is the fourth astonishing and wonderful quality that appears.\n\nMonks, upon the manifestation of the Tathāgata, the Arahant, the Perfectly Self-Awakened One, these four astonishing and wonderful qualities appear.",
      "sinhala": "භික්ෂූනි, අරහත් වූ සම්මාසම්බුද්ධ වූ තථාගතයන්වහන්සේගේ පහළවීම නිසා සිව් ආකාර ආශ්චර්යවත් අද්භූත ධර්ම පහළ වෙත්. කවර සතරක් ද යත්? භික්ෂූනි, යම් කලෙක බෝධිසත්වයන්වහන්සේ තුසිත දෙව්ලොවින් චුත වී, සිහි ඇතිව, මනා ප්‍රඥාවෙන් යුතුව මව් කුසට පිවිසෙත් ද (පිළිසිඳ ගනිත් ද), එවිට දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත ලෝකයාට දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. යම් ඒ ලෝකාන්තරික අන්ධකාරයන් ද, ඒ ගැඹුරු, අවකාශ නැති, මහත් අන්ධකාරය ද, අඳුරු තෙල්ගුළක් බඳු අන්ධකාරය ද වෙත් ද, යම් තැනක මේ සඳහිරු දෙදෙනාගේ පවා, මෙසේ මහත් ඍද්ධි ඇති, මෙසේ මහත් ආනුභාව ඇති, ආලෝකය නොපැතිරෙයි ද, එහි ද දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. එහි උපන්නා වූ යම් සත්වයෝ වෙත් ද, ඔවුහු ද ඒ ආලෝකයෙන් එකිනෙකා හඳුනා ගනිති – ‘ඇවැත්නි, මෙහි උපන්නා වූ වෙනත් සත්වයෝ ද සිටිත්’ යැයි. භික්ෂූනි, අරහත් වූ සම්මාසම්බුද්ධ වූ තථාගතයන්වහන්සේගේ පහළවීම නිසා මේ පළමුවන ආශ්චර්යවත් අද්භූත ධර්මය පහළ වෙයි.\n\nනැවතත්, භික්ෂූනි, යම් කලෙක බෝධිසත්වයන්වහන්සේ සිහි ඇතිව, මනා ප්‍රඥාවෙන් යුතුව මව් කුසින් බිහි වෙත් ද, එවිට දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත ලෝකයාට දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. යම් ඒ ලෝකාන්තරික අන්ධකාරයන් ද, ඒ ගැඹුරු, අවකාශ නැති, මහත් අන්ධකාරය ද, අඳුරු තෙල්ගුළක් බඳු අන්ධකාරය ද වෙත් ද, යම් තැනක මේ සඳහිරු දෙදෙනාගේ පවා, මෙසේ මහත් ඍද්ධි ඇති, මෙසේ මහත් ආනුභාව ඇති, ආලෝකය නොපැතිරෙයි ද, එහි ද දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. එහි උපන්නා වූ යම් සත්වයෝ වෙත් ද, ඔවුහු ද ඒ ආලෝකයෙන් එකිනෙකා හඳුනා ගනිති – ‘ඇවැත්නි, මෙහි උපන්නා වූ වෙනත් සත්වයෝ ද සිටිත්’ යැයි. භික්ෂූනි, අරහත් වූ සම්මාසම්බුද්ධ වූ තථාගතයන්වහන්සේගේ පහළවීම නිසා මේ දෙවැනි ආශ්චර්යවත් අද්භූත ධර්මය පහළ වෙයි.\n\nනැවතත්, භික්ෂූනි, යම් කලෙක තථාගතයන්වහන්සේ අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කර ගනිත් ද, එවිට දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත ලෝකයාට දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. යම් ඒ ලෝකාන්තරික අන්ධකාරයන් ද, ඒ ගැඹුරු, අවකාශ නැති, මහත් අන්ධකාරය ද, අඳුරු තෙල්ගුළක් බඳු අන්ධකාරය ද වෙත් ද, යම් තැනක මේ සඳහිරු දෙදෙනාගේ පවා, මෙසේ මහත් ඍද්ධි ඇති, මෙසේ මහත් ආනුභාව ඇති, ආලෝකය නොපැතිරෙයි ද, එහි ද දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. එහි උපන්නා වූ යම් සත්වයෝ වෙත් ද, ඔවුහු ද ඒ ආලෝකයෙන් එකිනෙකා හඳුනා ගනිති – ‘ඇවැත්නි, මෙහි උපන්නා වූ වෙනත් සත්වයෝ ද සිටිත්’ යැයි. භික්ෂූනි, අරහත් වූ සම්මාසම්බුද්ධ වූ තථාගතයන්වහන්සේගේ පහළවීම නිසා මේ තුන්වැනි ආශ්චර්යවත් අද්භූත ධර්මය පහළ වෙයි.\n\nනැවතත්, භික්ෂූනි, යම් කලෙක තථාගතයන්වහන්සේ අනුත්තර වූ ධර්ම චක්‍රය ප්‍රවර්තනය කරත් ද, එවිට දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත ලෝකයාට දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. යම් ඒ ලෝකාන්තරික අන්ධකාරයන් ද, ඒ ගැඹුරු, අවකාශ නැති, මහත් අන්ධකාරය ද, අඳුරු තෙල්ගුළක් බඳු අන්ධකාරය ද වෙත් ද, යම් තැනක මේ සඳහිරු දෙදෙනාගේ පවා, මෙසේ මහත් ඍද්ධි ඇති, මෙසේ මහත් ආනුභාව ඇති, ආලෝකය නොපැතිරෙයි ද, එහි ද දෙවියන්ගේ දිව්‍ය ආනුභාවය ඉක්මවා අප්‍රමාණ, උතුම් ආලෝකයක් පහළ වෙයි. එහි උපන්නා වූ යම් සත්වයෝ වෙත් ද, ඔවුහු ද ඒ ආලෝකයෙන් එකිනෙකා හඳුනා ගනිති – ‘ඇවැත්නි, මෙහි උපන්නා වූ වෙනත් සත්වයෝ ද සිටිත්’ යැයි. භික්ෂූනි, අරහත් වූ සම්මාසම්බුද්ධ වූ තථාගතයන්වහන්සේගේ පහළවීම නිසා මේ සතරවැනි ආශ්චර්යවත් අද්භූත ධර්මය පහළ වෙයි.\n\nභික්ෂූනි, අරහත් වූ සම්මාසම්බුද්ධ වූ තථාගතයන්වහන්සේගේ පහළවීම නිසා මේ සිව් ආකාර ආශ්චර්යවත් අද්භූත ධර්ම පහළ වෙත්.",
      "paliTitle": "Paṭhamatathāgataacchariyasuttaṃ",
      "englishTitle": "First Discourse on the Tathāgata's Marvels",
      "sinhalaTitle": "පළමු තථාගත ආශ‍්චර‍්‍ය සූත‍්‍රය"
    },
    {
      "number": 128,
      "pali": "‘‘Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā cattāro acchariyā abbhutā dhammā pātubhavanti. Katame cattāro? Ālayārāmā [ālayarāmā (aññasuttesu)], bhikkhave, pajā ālayaratā ālayasammuditā; sā tathāgatena anālaye dhamme desiyamāne sussūsati sotaṃ odahati aññā cittaṃ upaṭṭhapeti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ paṭhamo acchariyo abbhuto dhammo pātubhavati. ‘‘Mānārāmā, bhikkhave, pajā mānaratā mānasammuditā. Sā tathāgatena mānavinaye dhamme desiyamāne sussūsati sotaṃ odahati aññā cittaṃ upaṭṭhapeti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ dutiyo acchariyo abbhuto dhammo pātubhavati. ‘‘Anupasamārāmā, bhikkhave, pajā anupasamaratā anupasamasammuditā. Sā tathāgatena opasamike dhamme desiyamāne sussūsati sotaṃ odahati aññā cittaṃ upaṭṭhapeti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ tatiyo acchariyo abbhuto dhammo pātubhavati. ‘‘Avijjāgatā, bhikkhave, pajā aṇḍabhūtā pariyonaddhā. Sā tathāgatena avijjāvinaye dhamme desiyamāne sussūsati sotaṃ odahati aññā cittaṃ upaṭṭhapeti. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ayaṃ catuttho acchariyo abbhuto dhammo pātubhavati. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvā ime cattāro acchariyā abbhutā dhammā pātubhavantī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, upon the arising of the Tathāgata, the Arahant, the Fully Awakened One, four wonderful and astonishing phenomena arise. Which four?\n\nMonks, beings delight in attachment, are fond of attachment, and rejoice in attachment. Yet, when the Tathāgata teaches the Dhamma that is free from attachment, they listen intently, lend ear, and apply their minds to understanding. Monks, upon the arising of the Tathāgata, the Arahant, the Fully Awakened One, this is the first wonderful and astonishing phenomenon that arises.\n\nMonks, beings delight in conceit, are fond of conceit, and rejoice in conceit. Yet, when the Tathāgata teaches the Dhamma for the removal of conceit, they listen intently, lend ear, and apply their minds to understanding. Monks, upon the arising of the Tathāgata, the Arahant, the Fully Awakened One, this is the second wonderful and astonishing phenomenon that arises.\n\nMonks, beings delight in non-pacification, are fond of non-pacification, and rejoice in non-pacification. Yet, when the Tathāgata teaches the Dhamma leading to pacification, they listen intently, lend ear, and apply their minds to understanding. Monks, upon the arising of the Tathāgata, the Arahant, the Fully Awakened One, this is the third wonderful and astonishing phenomenon that arises.\n\nMonks, beings are steeped in ignorance, like an egg, enveloped. Yet, when the Tathāgata teaches the Dhamma for the removal of ignorance, they listen intently, lend ear, and apply their minds to understanding. Monks, upon the arising of the Tathāgata, the Arahant, the Fully Awakened One, this is the fourth wonderful and astonishing phenomenon that arises.\n\nMonks, upon the arising of the Tathāgata, the Arahant, the Fully Awakened One, these four wonderful and astonishing phenomena arise.",
      "sinhala": "‘‘භික්ෂූනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේගේ පහළවීම නිසා ආශ්චර්යවත් වූ, අද්භූත වූ ධර්මතා සතරක් පහළ වේ. ඒ සතර කුමක්ද?\n\nභික්ෂූනි, සත්ව සමූහයා ආලයෙහි ඇලී, ආලයෙහිම සතුටු වී, ආලයෙහිම ප්‍රීති වෙමින් සිටිති. එහෙත් තථාගතයන් වහන්සේ අනාලය ධර්මය දේශනා කරන කල්හි, ඔවුහු හොඳින් ශ්‍රවණය කරති, සවන් යොමු කරති, අවබෝධය පිණිස සිත යොදවති. භික්ෂූනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේගේ පහළවීම නිසා පහළවන පළමු ආශ්චර්යවත් අද්භූත ධර්මතාව මෙයයි.\n\nභික්ෂූනි, සත්ව සමූහයා මානයෙහි ඇලී, මානයෙහිම සතුටු වී, මානයෙහිම ප්‍රීති වෙමින් සිටිති. එහෙත් තථාගතයන් වහන්සේ මාන විනය ධර්මය දේශනා කරන කල්හි, ඔවුහු හොඳින් ශ්‍රවණය කරති, සවන් යොමු කරති, අවබෝධය පිණිස සිත යොදවති. භික්ෂූනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේගේ පහළවීම නිසා පහළවන දෙවැනි ආශ්චර්යවත් අද්භූත ධර්මතාව මෙයයි.\n\nභික්ෂූනි, සත්ව සමූහයා උපශමයක් නොමැති තැන ඇලී, එහිම සතුටු වී, එහිම ප්‍රීති වෙමින් සිටිති. එහෙත් තථාගතයන් වහන්සේ උපශම ධර්මය දේශනා කරන කල්හි, ඔවුහු හොඳින් ශ්‍රවණය කරති, සවන් යොමු කරති, අවබෝධය පිණිස සිත යොදවති. භික්ෂූනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේගේ පහළවීම නිසා පහළවන තෙවැනි ආශ්චර්යවත් අද්භූත ධර්මතාව මෙයයි.\n\nභික්ෂූනි, සත්ව සමූහයා අවිද්‍යාවට ගොදුරු වී, පොත්තෙන් වැසුණු බිජුවක් මෙන්, මුළුමනින්ම අවිද්‍යාවෙන් වෙලී සිටිති. එහෙත් තථාගතයන් වහන්සේ අවිද්‍යා විනය ධර්මය දේශනා කරන කල්හි, ඔවුහු හොඳින් ශ්‍රවණය කරති, සවන් යොමු කරති, අවබෝධය පිණිස සිත යොදවති. භික්ෂූනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේගේ පහළවීම නිසා පහළවන සිව්වැනි ආශ්චර්යවත් අද්භූත ධර්මතාව මෙයයි.\n\nභික්ෂූනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේගේ පහළවීම නිසා මේ ආශ්චර්යවත් අද්භූත ධර්මතා සතර පහළ වේ.",
      "paliTitle": "Dutiyatathāgataacchariyasuttaṃ",
      "englishTitle": "Second Sutta on the Tathāgata's Wonders",
      "sinhalaTitle": "දෙවන තථාගත ආශ්චර්ය සූත්‍රය"
    },
    {
      "number": 129,
      "pali": "‘‘Cattārome, bhikkhave, acchariyā abbhutā dhammā ānande. Katame cattāro? Sace, bhikkhave, bhikkhuparisā ānandaṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce ānando dhammaṃ bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, bhikkhuparisā hoti, atha ānando tuṇhī bhavati. ‘‘Sace, bhikkhave, bhikkhuniparisā ānandaṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tattha ce ānando dhammaṃ bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, bhikkhuniparisā hoti, atha ānando tuṇhī bhavati. ‘‘Sace, bhikkhave, upāsakaparisā ānandaṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce ānando dhammaṃ bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, upāsakaparisā hoti, atha ānando tuṇhī bhavati. ‘‘Sace, bhikkhave, upāsikāparisā ānandaṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce ānando dhammaṃ bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, upāsikāparisā hoti, atha ānando tuṇhī bhavati. Ime kho, bhikkhave, cattāro acchariyā abbhutā dhammā ānande’’ti. Navamaṃ.",
      "english": "Monks, these four are marvelous and astounding qualities in Ananda. Which four?\n\nIf, monks, a community of monks comes to see Ananda, they are delighted merely by seeing him. If Ananda then teaches the Dhamma, they are delighted even by his discourse. Yet, monks, the community of monks remains unsatisfied when Ananda falls silent.\n\nIf, monks, a community of nuns comes to see Ananda, they are delighted merely by seeing him. If Ananda then teaches the Dhamma, they are delighted even by his discourse. Yet, monks, the community of nuns remains unsatisfied when Ananda falls silent.\n\nIf, monks, a community of laymen comes to see Ananda, they are delighted merely by seeing him. If Ananda then teaches the Dhamma, they are delighted even by his discourse. Yet, monks, the community of laymen remains unsatisfied when Ananda falls silent.\n\nIf, monks, a community of laywomen comes to see Ananda, they are delighted merely by seeing him. If Ananda then teaches the Dhamma, they are delighted even by his discourse. Yet, monks, the community of laywomen remains unsatisfied when Ananda falls silent.\n\nThese, monks, are the four marvelous and astounding qualities in Ananda.",
      "sinhala": "මහණෙනි, ආනන්ද තෙරුන් වහන්සේ තුළ මේ පුදුමාකාර ආශ්චර්යවත් ධර්ම හතරක් ඇත. ඒ හතර කවරේද?\n\nමහණෙනි, යම් හෙයකින් භික්ෂුපරිසදක් ආනන්ද තෙරුන් වහන්සේ දැකීම සඳහා උන්වහන්සේ වෙත පැමිණෙන්නේ නම්, දැකීමෙන් පමණක් වුවද ඔවුහු සතුටු වෙති. එහිදී ආනන්ද තෙරුන් වහන්සේ ධර්මය දේශනා කරන්නේ නම්, දේශනාවෙන්ද ඔවුහු සතුටු වෙති. මහණෙනි, භික්ෂුපරිසදය තවමත් (සැහීමකට පත් නොවී) අතෘප්තිමත්ව සිටියද, ආනන්ද තෙරුන් වහන්සේ නිශ්ශබ්ද වෙති.\n\nමහණෙනි, යම් හෙයකින් භික්ෂුණීපරිසදක් ආනන්ද තෙරුන් වහන්සේ දැකීම සඳහා උන්වහන්සේ වෙත පැමිණෙන්නේ නම්, දැකීමෙන් පමණක් වුවද ඔවුහු සතුටු වෙති. එහිදී ආනන්ද තෙරුන් වහන්සේ ධර්මය දේශනා කරන්නේ නම්, දේශනාවෙන්ද ඔවුහු සතුටු වෙති. මහණෙනි, භික්ෂුණීපරිසදය තවමත් (සැහීමකට පත් නොවී) අතෘප්තිමත්ව සිටියද, ආනන්ද තෙරුන් වහන්සේ නිශ්ශබ්ද වෙති.\n\nමහණෙනි, යම් හෙයකින් උපාසකපරිසදක් ආනන්ද තෙරුන් වහන්සේ දැකීම සඳහා උන්වහන්සේ වෙත පැමිණෙන්නේ නම්, දැකීමෙන් පමණක් වුවද ඔවුහු සතුටු වෙති. එහිදී ආනන්ද තෙරුන් වහන්සේ ධර්මය දේශනා කරන්නේ නම්, දේශනාවෙන්ද ඔවුහු සතුටු වෙති. මහණෙනි, උපාසකපරිසදය තවමත් (සැහීමකට පත් නොවී) අතෘප්තිමත්ව සිටියද, ආනන්ද තෙරුන් වහන්සේ නිශ්ශබ්ද වෙති.\n\nමහණෙනි, යම් හෙයකින් උපාසිකාපරිසදක් ආනන්ද තෙරුන් වහන්සේ දැකීම සඳහා උන්වහන්සේ වෙත පැමිණෙන්නේ නම්, දැකීමෙන් පමණක් වුවද ඔවුහු සතුටු වෙති. එහිදී ආනන්ද තෙරුන් වහන්සේ ධර්මය දේශනා කරන්නේ නම්, දේශනාවෙන්ද ඔවුහු සතුටු වෙති. මහණෙනි, උපාසිකාපරිසදය තවමත් (සැහීමකට පත් නොවී) අතෘප්තිමත්ව සිටියද, ආනන්ද තෙරුන් වහන්සේ නිශ්ශබ්ද වෙති.\n\nමහණෙනි, ආනන්ද තෙරුන් වහන්සේ තුළ ඇති මේ පුදුමාකාර ආශ්චර්යවත් ධර්ම හතර මේවාය.",
      "paliTitle": "Ānandaacchariyasuttaṃ",
      "englishTitle": "Ananda's Amazing Discourse",
      "sinhalaTitle": "ආනන්ද ආශ්‍චර‍්‍ය සූත්‍රය"
    },
    {
      "number": 130,
      "pali": "‘‘Cattārome, bhikkhave, acchariyā abbhutā dhammā raññe cakkavattimhi. Katame cattāro? Sace, bhikkhave, khattiyaparisā rājānaṃ cakkavattiṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce rājā cakkavattī bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, khattiyaparisā hoti, atha rājā cakkavattī tuṇhī bhavati. ‘‘Sace, bhikkhave, brāhmaṇaparisā rājānaṃ cakkavattiṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce rājā cakkavattī bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, brāhmaṇaparisā hoti, atha rājā cakkavattī tuṇhī bhavati. ‘‘Sace, bhikkhave, gahapatiparisā rājānaṃ cakkavattiṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce rājā cakkavattī bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, gahapatiparisā hoti, atha rājā cakkavattī tuṇhī bhavati. ‘‘Sace, bhikkhave, samaṇaparisā rājānaṃ cakkavattiṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce rājā cakkavattī bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, samaṇaparisā hoti, atha rājā cakkavattī tuṇhī bhavati. Ime kho, bhikkhave, cattāro acchariyā abbhutā dhammā raññe cakkavattimhi. ‘‘Evamevaṃ kho, bhikkhave, cattāro [cattārome (ka.)] acchariyā abbhutā dhammā ānande. Katame cattāro? Sace, bhikkhave, bhikkhuparisā ānandaṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce ānando dhammaṃ bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, bhikkhuparisā hoti, atha ānando tuṇhī bhavati. ‘‘Sace, bhikkhave, bhikkhuniparisā…pe… sace, bhikkhave, upāsakaparisā…pe… sace, bhikkhave, upāsikāparisā ānandaṃ dassanāya upasaṅkamati, dassanenapi sā attamanā hoti. Tatra ce ānando dhammaṃ bhāsati, bhāsitenapi sā attamanā hoti. Atittāva, bhikkhave, upāsikāparisā hoti, atha ānando tuṇhī bhavati. Ime kho, bhikkhave, cattāro acchariyā abbhutā dhammā ānande’’ti. Dasamaṃ. ",
      "english": "Monks, these four wondrous and amazing qualities are found in a Universal Monarch. Which four?\n\nMonks, if a gathering of kṣatriyas approaches a Universal Monarch for an audience, they are delighted merely by seeing him. And if the Universal Monarch speaks, they are delighted by his speech. Monks, the gathering of kṣatriyas remains unsatisfied, yet the Universal Monarch falls silent.\n\nMonks, if a gathering of brahmins approaches a Universal Monarch for an audience, they are delighted merely by seeing him. And if the Universal Monarch speaks, they are delighted by his speech. Monks, the gathering of brahmins remains unsatisfied, yet the Universal Monarch falls silent.\n\nMonks, if a gathering of householders approaches a Universal Monarch for an audience, they are delighted merely by seeing him. And if the Universal Monarch speaks, they are delighted by his speech. Monks, the gathering of householders remains unsatisfied, yet the Universal Monarch falls silent.\n\nMonks, if a gathering of ascetics approaches a Universal Monarch for an audience, they are delighted merely by seeing him. And if the Universal Monarch speaks, they are delighted by his speech. Monks, the gathering of ascetics remains unsatisfied, yet the Universal Monarch falls silent.\n\nThese, monks, are the four wondrous and amazing qualities found in a Universal Monarch.\n\nIn the same way, monks, these four wondrous and amazing qualities are found in Ānanda. Which four?\n\nMonks, if a gathering of bhikkhus approaches Ānanda for an audience, they are delighted merely by seeing him. And if Ānanda speaks the Dhamma, they are delighted by his speech. Monks, the gathering of bhikkhus remains unsatisfied, yet Ānanda falls silent.\n\nMonks, if a gathering of bhikkhunīs approaches Ānanda for an audience, they are delighted merely by seeing him. And if Ānanda speaks the Dhamma, they are delighted by his speech. Monks, the gathering of bhikkhunīs remains unsatisfied, yet Ānanda falls silent.\n\nMonks, if a gathering of laymen approaches Ānanda for an audience, they are delighted merely by seeing him. And if Ānanda speaks the Dhamma, they are delighted by his speech. Monks, the gathering of laymen remains unsatisfied, yet Ānanda falls silent.\n\nMonks, if a gathering of laywomen approaches Ānanda for an audience, they are delighted merely by seeing him. And if Ānanda speaks the Dhamma, they are delighted by his speech. Monks, the gathering of laywomen remains unsatisfied, yet Ānanda falls silent.\n\nThese, monks, are the four wondrous and amazing qualities found in Ānanda.",
      "sinhala": "මහණෙනි, සක්විති රජු පිළිබඳව ආශ්චර්යවත් හා අද්භූත වූ කරුණු සතරක් ඇත. ඒ සතර කවරේද?\n\nමහණෙනි, යම් හෙයකින් ක්ෂත්‍රිය පිරිසක් සක්විති රජු දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී සක්විති රජු යම් හෙයකින් කතා කරන්නේ නම්, ඔවුහු කතාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් ක්ෂත්‍රිය පිරිස නොතෘප්තිමත් ව සිටියද, සක්විති රජු නිහඬ වන්නේය.\n\nමහණෙනි, යම් හෙයකින් බ්‍රාහ්මණ පිරිසක් සක්විති රජු දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී සක්විති රජු යම් හෙයකින් කතා කරන්නේ නම්, ඔවුහු කතාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් බ්‍රාහ්මණ පිරිස නොතෘප්තිමත් ව සිටියද, සක්විති රජු නිහඬ වන්නේය.\n\nමහණෙනි, යම් හෙයකින් ගෘහපති පිරිසක් සක්විති රජු දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී සක්විති රජු යම් හෙයකින් කතා කරන්නේ නම්, ඔවුහු කතාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් ගෘහපති පිරිස නොතෘප්තිමත් ව සිටියද, සක්විති රජු නිහඬ වන්නේය.\n\nමහණෙනි, යම් හෙයකින් ශ්‍රමණ පිරිසක් සක්විති රජු දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී සක්විති රජු යම් හෙයකින් කතා කරන්නේ නම්, ඔවුහු කතාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් ශ්‍රමණ පිරිස නොතෘප්තිමත් ව සිටියද, සක්විති රජු නිහඬ වන්නේය.\n\nමහණෙනි, සක්විති රජු පිළිබඳව ඇති ආශ්චර්යවත් හා අද්භූත වූ කරුණු සතර මේවාය.\n\nමහණෙනි, එලෙසින්ම ආනන්ද තෙරුන් පිළිබඳවද ආශ්චර්යවත් හා අද්භූත වූ කරුණු සතරක් ඇත. ඒ සතර කවරේද?\n\nමහණෙනි, යම් හෙයකින් භික්ෂු පිරිසක් ආනන්ද තෙරුන් දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී ආනන්ද තෙරණුවෝ යම් හෙයකින් ධර්මය දේශනා කරන්නේ නම්, ඔවුහු දේශනාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් භික්ෂු පිරිස නොතෘප්තිමත් ව සිටියද, ආනන්ද තෙරණුවෝ නිහඬ වන්නේය.\n\nමහණෙනි, යම් හෙයකින් භික්ෂුණී පිරිසක් ආනන්ද තෙරුන් දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී ආනන්ද තෙරණුවෝ යම් හෙයකින් ධර්මය දේශනා කරන්නේ නම්, ඔවුහු දේශනාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් භික්ෂුණී පිරිස නොතෘප්තිමත් ව සිටියද, ආනන්ද තෙරණුවෝ නිහඬ වන්නේය. මහණෙනි, යම් හෙයකින් උපාසක පිරිසක් ආනන්ද තෙරුන් දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී ආනන්ද තෙරණුවෝ යම් හෙයකින් ධර්මය දේශනා කරන්නේ නම්, ඔවුහු දේශනාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් උපාසක පිරිස නොතෘප්තිමත් ව සිටියද, ආනන්ද තෙරණුවෝ නිහඬ වන්නේය. මහණෙනි, යම් හෙයකින් උපාසිකා පිරිසක් ආනන්ද තෙරුන් දැකීමට පැමිණෙන්නේ නම්, ඔවුහු දැකීමෙන්ම ප්‍රීතියට පත් වෙති. එහිදී ආනන්ද තෙරණුවෝ යම් හෙයකින් ධර්මය දේශනා කරන්නේ නම්, ඔවුහු දේශනාවෙන්ද ප්‍රීතියට පත් වෙති. මහණෙනි, තවමත් උපාසිකා පිරිස නොතෘප්තිමත් ව සිටියද, ආනන්ද තෙරණුවෝ නිහඬ වන්නේය.\n\nමහණෙනි, ආනන්ද තෙරුන් පිළිබඳව ඇති ආශ්චර්යවත් හා අද්භූත වූ කරුණු සතර මේවාය.",
      "paliTitle": "Cakkavattiacchariyasuttaṃ",
      "englishTitle": "The Universal Monarch's Marvels Discourse",
      "sinhalaTitle": "චක‍්‍රවර්තී ආශ‍්චර‍්ය සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Bhayavaggo tatiyo. Tassuddānaṃ – Attānuvādaūmi ca, dve ca nānā dve ca honti; Mettā dve ca acchariyā, aparā ca tathā duveti.",
    "english": "The Third Chapter on Fear",
    "sinhala": "තෙවැනි භය වග්ගය සහ උද්දානය"
  }
}