{
  "id": "an4.22",
  "title": {
    "pali": "Parisāvaggo",
    "english": "The Chapter on Assemblies",
    "sinhala": "පරිෂද වග්ගය"
  },
  "sections": [
    {
      "number": 211,
      "pali": "‘‘Cattārome, bhikkhave, parisadūsanā. Katame cattāro? Bhikkhu, bhikkhave [idha bhikkhave bhikkhu (pī. ka.)], dussīlo pāpadhammo parisadūsano; bhikkhunī, bhikkhave, dussīlā pāpadhammā parisadūsanā; upāsako, bhikkhave, dussīlo pāpadhammo parisadūsano; upāsikā, bhikkhave, dussīlā pāpadhammā parisadūsanā. Ime kho, bhikkhave, cattāro parisadūsanā. ‘‘Cattārome, bhikkhave, parisasobhanā. Katame cattāro? Bhikkhu, bhikkhave, sīlavā kalyāṇadhammo parisasobhano; bhikkhunī, bhikkhave, sīlavatī kalyāṇadhammā parisasobhanā; upāsako, bhikkhave, sīlavā kalyāṇadhammo parisasobhano; upāsikā, bhikkhave, sīlavatī kalyāṇadhammā parisasobhanā. Ime kho, bhikkhave, cattāro parisasobhanā’’ti. Paṭhamaṃ.",
      "english": "Monks, these four are defilers of an assembly. Which four? Monks, a monk who is immoral and of evil ways is a defiler of an assembly; a nun who is immoral and of evil ways is a defiler of an assembly; a male lay follower who is immoral and of evil ways is a defiler of an assembly; a female lay follower who is immoral and of evil ways is a defiler of an assembly. Monks, these four are indeed defilers of an assembly.\n\nMonks, these four are adorners of an assembly. Which four? Monks, a monk who is virtuous and of wholesome ways is an adorner of an assembly; a nun who is virtuous and of wholesome ways is an adorner of an assembly; a male lay follower who is virtuous and of wholesome ways is an adorner of an assembly; a female lay follower who is virtuous and of wholesome ways is an adorner of an assembly. Monks, these four are indeed adorners of an assembly.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ පිරිස දූෂණය කරන්නෝ සතර දෙනෙක් වෙති. කවරහුද ඒ සතර දෙනා?\nමෙහිලා, භික්ෂූන් වහන්ස, දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති භික්ෂුව පිරිස දූෂණය කරන්නෙකි. භික්ෂූන් වහන්ස, දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති භික්ෂුණිය පිරිස දූෂණය කරන්නියකි. භික්ෂූන් වහන්ස, දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති උපාසකයා පිරිස දූෂණය කරන්නෙකි. භික්ෂූන් වහන්ස, දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති උපාසිකාව පිරිස දූෂණය කරන්නියකි. භික්ෂූන් වහන්ස, මේ සතර දෙනා පිරිස දූෂණය කරන්නෝ වෙති.\n\nභික්ෂූන් වහන්ස, මේ පිරිස ශෝභමාන කරන්නෝ සතර දෙනෙක් වෙති. කවරහුද ඒ සතර දෙනා?\nමෙහිලා, භික්ෂූන් වහන්ස, ශීලයෙන් යුක්ත වූ, කල්‍යාණ ධර්‍මයන්ගෙන් යුක්ත වූ භික්ෂුව පිරිස ශෝභමාන කරන්නෙකි. භික්ෂූන් වහන්ස, ශීලයෙන් යුක්ත වූ, කල්‍යාණ ධර්‍මයන්ගෙන් යුක්ත වූ භික්ෂුණිය පිරිස ශෝභමාන කරන්නියකි. භික්ෂූන් වහන්ස, ශීලයෙන් යුක්ත වූ, කල්‍යාණ ධර්‍මයන්ගෙන් යුක්ත වූ උපාසකයා පිරිස ශෝභමාන කරන්නෙකි. භික්ෂූන් වහන්ස, ශීලයෙන් යුක්ත වූ, කල්‍යාණ ධර්‍මයන්ගෙන් යුක්ත වූ උපාසිකාව පිරිස ශෝභමාන කරන්නියකි. භික්ෂූන් වහන්ස, මේ සතර දෙනා පිරිස ශෝභමාන කරන්නෝ වෙති.",
      "paliTitle": "Parisāsuttaṃ",
      "englishTitle": "The Assembly Discourse",
      "sinhalaTitle": "පිරිස සූත්‍‍රය"
    },
    {
      "number": 212,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Kāyaduccaritena, vacīduccaritena, manoduccaritena, micchādiṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Kāyasucaritena, vacīsucaritena, manosucaritena, sammādiṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Dutiyaṃ.",
      "english": "Monks, one endowed with four qualities is consigned to hell, as if picked up and placed there. Which four? Misconduct in body, misconduct in speech, misconduct in mind, and wrong view. Indeed, monks, one endowed with these four qualities is consigned to hell, as if picked up and placed there.\n\nMonks, one endowed with four qualities is consigned to heaven, as if picked up and placed there. Which four? Good conduct in body, good conduct in speech, good conduct in mind, and right view. Indeed, monks, one endowed with these four qualities is consigned to heaven, as if picked up and placed there.",
      "sinhala": "භික්ෂූනි, සතර ධර්‍මයකින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් දැමූවකු මෙන් නිරයටම වැටෙයි. කවර සතරකින්ද? කයෙහි දුසිරිතෙන්, වචනයෙහි දුසිරිතෙන්, සිතෙහි දුසිරිතෙන්, මිථ්‍යාදෘෂ්ටියෙන් යන මේ සතර ධර්‍මයන්ගෙන් යුක්ත වූ තැනැත්තා භික්ෂූනි, හරියට ගෙනැවිත් දැමූවකු මෙන් නිරයටම වැටෙයි.\n\nභික්ෂූනි, සතර ධර්‍මයකින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් දැමූවකු මෙන් ස්වර්ගයටම වැටෙයි. කවර සතරකින්ද? කයෙහි සුසිරිතෙන්, වචනයෙහි සුසිරිතෙන්, සිතෙහි සුසිරිතෙන්, සම්මාදිට්ඨියෙන් යන මේ සතර ධර්‍මයන්ගෙන් යුක්ත වූ තැනැත්තා භික්ෂූනි, හරියට ගෙනැවිත් දැමූවකු මෙන් ස්වර්ගයටම වැටෙයි.",
      "paliTitle": "Diṭṭhisuttaṃ",
      "englishTitle": "Discourse on Views",
      "sinhalaTitle": "දිට්ඨි සූත්‍රය"
    },
    {
      "number": 213,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Kāyaduccaritena, vacīduccaritena, manoduccaritena, akataññutā akataveditā [akataññutāakataveditāya (sī.)] – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Kāyasucaritena, vacīsucaritena, manosucaritena, kataññutākataveditā [kataññutākataveditāya (sī.)] – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, endowed with four qualities, one is likewise deposited in hell, just as he was brought. Which four? By misconduct of body, by misconduct of speech, by misconduct of mind, and by ingratitude and unthankfulness. Indeed, bhikkhus, endowed with these four qualities, one is likewise deposited in hell, just as he was brought.\n\nBhikkhus, endowed with four qualities, one is likewise deposited in heaven, just as he was brought. Which four? By good conduct of body, by good conduct of speech, by good conduct of mind, and by gratitude and thankfulness. Indeed, bhikkhus, endowed with these four qualities, one is likewise deposited in heaven, just as he was brought.",
      "sinhala": "භික්ෂූන් වහන්ස, කරුණු සතරකින් යුක්ත වූ පුද්ගලයා ගෙනැවිත් තැබුවාක් මෙන් කෙළින්ම නිරයේ පිහිටුවනු ලබයි. ඒ කවර කරුණු සතරකින්ද යත්: කයෙහි දුසිරිතෙන්, වචනයෙහි දුසිරිතෙන්, සිතෙහි දුසිරිතෙන්, කෘතගුණ නොදැනීම හා අනුන් කළ උපකාර නොසැලකීම යන මේ කරුණු සතරෙනි. භික්ෂූන් වහන්ස, මේ කරුණු සතරින් යුක්ත වූ පුද්ගලයා ගෙනැවිත් තැබුවාක් මෙන් කෙළින්ම නිරයේ පිහිටුවනු ලබයි.\n\nභික්ෂූන් වහන්ස, කරුණු සතරකින් යුක්ත වූ පුද්ගලයා ගෙනැවිත් තැබුවාක් මෙන් කෙළින්ම ස්වර්ගයේ පිහිටුවනු ලබයි. ඒ කවර කරුණු සතරකින්ද යත්: කයෙහි සුසිරිතෙන්, වචනයෙහි සුසිරිතෙන්, සිතෙහි සුසිරිතෙන්, කෘතගුණ දැනීම හා අනුන් කළ උපකාර සැලකීම යන මේ කරුණු සතරෙනි. භික්ෂූන් වහන්ස, මේ කරුණු සතරින් යුක්ත වූ පුද්ගලයා ගෙනැවිත් තැබුවාක් මෙන් කෙළින්ම ස්වර්ගයේ පිහිටුවනු ලබයි.",
      "paliTitle": "Akataññutāsuttaṃ",
      "englishTitle": "Discourse on Ingratitude",
      "sinhalaTitle": "අකෘතඥතා සූත්‍රය"
    },
    {
      "number": 214,
      "pali": "…Pe… pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti…pe… pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti. Catutthaṃ.",
      "english": "He takes life, he takes what is not given, he engages in sexual misconduct, he speaks falsely.\n\nHe abstains from taking life, he abstains from taking what is not given, he abstains from sexual misconduct, he abstains from false speech. The fourth.",
      "sinhala": "ප්‍රාණඝාතයෙහි යෙදෙයි, අදත්තාදානයෙහි යෙදෙයි, කාමමිථ්‍යාචාරයෙහි යෙදෙයි, මුසාවාදයෙහි යෙදෙයි.\nප්‍රාණඝාතයෙන් වළකින්නේ වේ, අදත්තාදානයෙන් වළකින්නේ වේ, කාමමිථ්‍යාචාරයෙන් වළකින්නේ වේ, මුසාවාදයෙන් වළකින්නේ වේ. සතරවැන්න.",
      "paliTitle": "Pāṇātipātīsuttaṃ",
      "englishTitle": "The Discourse on Taking Life",
      "sinhalaTitle": "ප්‍රාණඝාතී සූත්‍රය"
    },
    {
      "number": 215,
      "pali": "…Pe… micchādiṭṭhiko hoti, micchāsaṅkappo hoti, micchāvāco hoti, micchākammanto hoti… pe… sammādiṭṭhiko hoti, sammāsaṅkappo hoti, sammāvāco hoti, sammākammanto hoti. Pañcamaṃ.",
      "english": "He has wrong view, he has wrong intention, he has wrong speech, he has wrong action, he has wrong livelihood, he has wrong effort, he has wrong mindfulness, he has wrong concentration. He has right view, he has right intention, he has right speech, he has right action. Fifth.",
      "sinhala": "ඔහු මිත්‍යාදෘෂ්ටිකයෙක් වෙයි, ඔහු මිත්‍යා සංකල්පනා ඇත්තෙක් වෙයි, ඔහු මිත්‍යා වචන ඇත්තෙක් වෙයි, ඔහු මිත්‍යා කර්‍මාන්ත ඇත්තෙක් වෙයි. ඔහු සම්මාදිට්ඨියෙන් යුක්ත වෙයි, ඔහු සම්මා සංකල්පනා ඇත්තෙක් වෙයි, ඔහු සම්මා වචන ඇත්තෙක් වෙයි, ඔහු සම්මා කර්‍මාන්ත ඇත්තෙක් වෙයි. පස්වැන්නයි.",
      "paliTitle": "Paṭhamamaggasuttaṃ",
      "englishTitle": "First Path Sutta",
      "sinhalaTitle": "පළමු මග්ග සූත්‍රය"
    },
    {
      "number": 216,
      "pali": "…Pe… micchāājīvo hoti, micchāvāyāmo hoti, micchāsati hoti, micchāsamādhi hoti…pe… sammāājīvo hoti, sammāvāyāmo hoti, sammāsati hoti, sammāsamādhi hoti. Chaṭṭhaṃ.",
      "english": "There is wrong livelihood, there is wrong effort, there is wrong mindfulness, there is wrong concentration. There is right livelihood, there is right effort, there is right mindfulness, there is right concentration. This is the Sixth.",
      "sinhala": "... මිත්‍යා ආජීවය වන්නේය, මිත්‍යා ව්‍යායාමය වන්නේය, මිත්‍යා සතිය වන්නේය, මිත්‍යා සමාධිය වන්නේය ... සම්මා ආජීවය වන්නේය, සම්මා ව්‍යායාමය වන්නේය, සම්මා සතිය වන්නේය, සම්මා සමාධිය වන්නේය. සයවැන්නයි.",
      "paliTitle": "Dutiyamaggasuttaṃ",
      "englishTitle": "Second Path Sutta",
      "sinhalaTitle": "දෙවැනි මාර්ග සූත්‍රය"
    },
    {
      "number": 217,
      "pali": "…Pe… adiṭṭhe diṭṭhavādī hoti, asute sutavādī hoti, amute mutavādī hoti, aviññāte viññātavādī hoti…pe… adiṭṭhe adiṭṭhavādī hoti, asute asutavādī hoti, amute amutavādī hoti, aviññāte aviññātavādī hoti. Sattamaṃ.",
      "english": "He claims to have seen what was unseen; he claims to have heard what was unheard; he claims to have perceived what was unperceived; he claims to have cognized what was uncognized. He claims not to have seen what was unseen; he claims not to have heard what was unheard; he claims not to have perceived what was unperceived; he claims not to have cognized what was uncognized. The seventh.",
      "sinhala": "නොදැක්ක දේ දැක්කේයයි කියනවා. නොඇසූ දේ ඇසූයේයයි කියනවා. නොපසක් කළ දේ පසක් කළේයයි කියනවා. නොදැනගත් දේ දැනගත්තේයයි කියනවා.\n\nනොදැක්ක දේ නොදැක්කේයයි කියනවා. නොඇසූ දේ නොඇසූයේයයි කියනවා. නොපසක් කළ දේ නොපසක් කළේයයි කියනවා. නොදැනගත් දේ නොදැනගත්තේයයි කියනවා.\n\nසත්වැන්නයි.",
      "paliTitle": "Paṭhamavohārapathasuttaṃ",
      "englishTitle": "The First Discourse on the Path of Expression",
      "sinhalaTitle": "පළමු ව්‍යවහාර පථ සූත්‍රය"
    },
    {
      "number": 218,
      "pali": "…Pe… diṭṭhe adiṭṭhavādī hoti, sute asutavādī hoti, mute amutavādī hoti, viññāte aviññātavādī hoti…pe… diṭṭhe diṭṭhavādī hoti, sute sutavādī hoti, mute mutavādī hoti, viññāte viññātavādī hoti. Aṭṭhamaṃ.",
      "english": "He asserts that what is seen is unseen, that what is heard is unheard, that what is sensed is unsensed, that what is cognized is uncognized. He asserts that what is seen is seen, that what is heard is heard, that what is sensed is sensed, that what is cognized is cognized. The Eighth.",
      "sinhala": "දුටු දෙය නොදුටු බව කියන්නෙක් වේ. ඇසූ දෙය නොඇසූ බව කියන්නෙක් වේ. ප්‍රත්‍යක්ෂ කළ දෙය ප්‍රත්‍යක්ෂ නොකළ බව කියන්නෙක් වේ. විඤ්ඤාණයෙන් අවබෝධ කළ දෙය අවබෝධ නොකළ බව කියන්නෙක් වේ.\n\nදුටු දෙය දුටු බව කියන්නෙක් වේ. ඇසූ දෙය ඇසූ බව කියන්නෙක් වේ. ප්‍රත්‍යක්ෂ කළ දෙය ප්‍රත්‍යක්ෂ කළ බව කියන්නෙක් වේ. විඤ්ඤාණයෙන් අවබෝධ කළ දෙය අවබෝධ කළ බව කියන්නෙක් වේ.",
      "paliTitle": "Dutiyavohārapathasuttaṃ",
      "englishTitle": "The Second Discourse on the Path of Speech",
      "sinhalaTitle": "දෙවෙනි වෝහාරපථ සූත‍්‍රය"
    },
    {
      "number": 219,
      "pali": "…Pe… assaddho hoti, dussīlo hoti, ahiriko hoti, anottappī hoti…pe… saddho hoti, sīlavā hoti, hirimā hoti, ottappī hoti. Navamaṃ.",
      "english": "He is without faith, unvirtuous, without moral shame, without moral dread. He is faithful, virtuous, possessed of moral shame, possessed of moral dread. The ninth.",
      "sinhala": "අසද්ධාවන්ත වෙයි, දුස්සීල වෙයි, අහිරික වෙයි, අනොත්තප්පී වෙයි. ශ්‍රද්ධාවන්ත වෙයි, සිල්වත් වෙයි, හිරිමත් වෙයි, ඔතප්පත් වෙයි. නවවැනි සූත්‍රයයි.",
      "paliTitle": "Ahirikasuttaṃ",
      "englishTitle": "The Discourse on Shamelessness",
      "sinhalaTitle": "අහිරික සූත්‍රය"
    },
    {
      "number": 220,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Assaddho hoti, dussīlo hoti, kusīto hoti, duppañño hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Saddho hoti, sīlavā hoti, āraddhavīriyo hoti, paññavā hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Dasamaṃ. ",
      "english": "Monks, one endowed with four qualities is consigned to hell as if directly carried and deposited there. Which four? He is without conviction, he is immoral, he is lazy, he is unwise. Monks, it is with these four qualities that one is consigned to hell as if directly carried and deposited there.\n\nMonks, one endowed with four qualities is consigned to heaven as if directly carried and deposited there. Which four? He is endowed with conviction, he is virtuous, he is energetic, he is wise. Monks, it is with these four qualities that one is consigned to heaven as if directly carried and deposited there.",
      "sinhala": "භික්ෂූනි, ධර්ම සතරකින් සමන්වාගත වූ තැනැත්තා යම්සේ ගෙන ආවාද, එලෙසම නිරයෙහි තැන්පත් කරනු ලැබේ.\nකවර සතරකින්ද? ඔහු අශ්‍රද්ධාවන්ත වේ, දුශ්ශීල වේ, කුසීත වේ, දුෂ්ප්‍රඥා වේ. භික්ෂූනි, මේ සතර ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා යම්සේ ගෙන ආවාද, එලෙසම නිරයෙහි තැන්පත් කරනු ලැබේ.\n\nභික්ෂූනි, ධර්ම සතරකින් සමන්වාගත වූ තැනැත්තා යම්සේ ගෙන ආවාද, එලෙසම ස්වර්ගයෙහි තැන්පත් කරනු ලැබේ.\nකවර සතරකින්ද? ඔහු ශ්‍රද්ධාවන්ත වේ, සිල්වත් වේ, වීර්යය වඩාගත් තැනැත්තා වේ, ප්‍රඥාවන්ත වේ. භික්ෂූනි, මේ සතර ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා යම්සේ ගෙන ආවාද, එලෙසම ස්වර්ගයෙහි තැන්පත් කරනු ලැබේ.",
      "paliTitle": "Dussīlasuttaṃ",
      "englishTitle": "The Immoral Person Discourse",
      "sinhalaTitle": "දුස්සීල සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Parisāvaggo [sobhanavaggo (sī. syā. kaṃ. pī.)] dutiyo. Tassuddānaṃ – Parisā diṭṭhi akataññutā, pāṇātipātāpi dve maggā; Dve vohārapathā vuttā, ahirikaṃ duppaññena cāti.",
    "english": "The Second Chapter on the Assembly",
    "sinhala": "දෙවන පිරිස වග්ගය"
  }
}