{
  "id": "an4.6",
  "title": {
    "pali": "Puññābhisandavaggo",
    "english": "The Chapter on the Stream of Merit",
    "sinhala": "පුණ්‍යාභිසන්ද වග්ගය"
  },
  "sections": [
    {
      "number": 51,
      "pali": "Sāvatthinidānaṃ. Cattārome, bhikkhave, puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Katame cattāro? Yassa, bhikkhave, bhikkhu cīvaraṃ paribhuñjamāno appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Yassa, bhikkhave, bhikkhu piṇḍapātaṃ paribhuñjamāno appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Yassa, bhikkhave, bhikkhu senāsanaṃ paribhuñjamāno appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Yassa, bhikkhave, bhikkhu gilānappaccayabhesajjaparikkhāraṃ paribhuñjamāno appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. Ime kho, bhikkhave, cattāro puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. ‘‘Imehi ca pana, bhikkhave, catūhi puññābhisandehi kusalābhisandehi samannāgatassa ariyasāvakassa na sukaraṃ puññassa pamāṇaṃ gahetuṃ [gaṇetuṃ (ka.)] – ‘ettako puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattatī’ti. Atha kho asaṅkhyeyyo [asaṅkheyyo (sī. syā. kaṃ. pī.)] appameyyo mahāpuññakkhandhotveva saṅkhyaṃ [saṅkhaṃ (sī. syā. kaṃ. pī.)] gacchati. ‘‘Seyyathāpi, bhikkhave, mahāsamudde na sukaraṃ udakassa pamāṇaṃ gahetuṃ – ‘ettakāni udakāḷhakānīti vā, ettakāni udakāḷhakasatānīti vā, ettakāni udakāḷhakasahassānīti vā, ettakāni udakāḷhakasatasahassānīti vā’, atha kho asaṅkhyeyyo appameyyo mahāudakakkhandhotveva saṅkhyaṃ gacchati; evamevaṃ kho, bhikkhave, imehi catūhi puññābhisandehi kusalābhisandehi samannāgatassa ariyasāvakassa na sukaraṃ puññassa pamāṇaṃ gahetuṃ – ‘ettako puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattatī’ti. Atha kho asaṅkhyeyyo appameyyo mahāpuññakkhandhotveva saṅkhyaṃ gacchatī’’ti. ‘‘Mahodadhiṃ aparimitaṃ mahāsaraṃ, Bahubheravaṃ ratanavarānamālayaṃ [ratanagaṇānamālayaṃ (sī. syā. kaṃ. pī.)]; Najjo yathā naragaṇasaṅghasevitā [macchagaṇasaṃghasevitā (syā. kaṃ.)], Puthū savantī upayanti sāgaraṃ. ‘‘Evaṃ naraṃ annadapānavatthadaṃ [annapānavatthaṃ (ka.)], Seyyānisajjattharaṇassa dāyakaṃ; Puññassa dhārā upayanti paṇḍitaṃ, Najjo yathā vārivahāva sāgara’’nti. paṭhamaṃ;",
      "english": "Bhikkhus, there are these four streams of merit, streams of skillfulness, sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and to happiness. Which four?\n\nBhikkhus, when a bhikkhu partakes of robes and dwells having attained boundless concentration of mind, then for him there is a boundless stream of merit, a boundless stream of skillfulness, a sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and to happiness.\n\nBhikkhus, when a bhikkhu partakes of almsfood and dwells having attained boundless concentration of mind, then for him there is a boundless stream of merit, a boundless stream of skillfulness, a sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and to happiness.\n\nBhikkhus, when a bhikkhu partakes of lodging and dwellings and dwells having attained boundless concentration of mind, then for him there is a boundless stream of merit, a boundless stream of skillfulness, a sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and to happiness.\n\nBhikkhus, when a bhikkhu partakes of requisites for the sick and medicine and dwells having attained boundless concentration of mind, then for him there is a boundless stream of merit, a boundless stream of skillfulness, a sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and to happiness.\n\nThese, bhikkhus, are the four streams of merit, streams of skillfulness, sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and to happiness.\n\nFurthermore, bhikkhus, for a noble disciple endowed with these four streams of merit and streams of skillfulness, it is not easy to measure the merit, saying, 'Such is the extent of this stream of merit, stream of skillfulness, sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and happiness.' Rather, it is reckoned simply as an immeasurable, incalculable great mass of merit.\n\nJust as, bhikkhus, in the great ocean, it is not easy to measure the water, saying, 'There are so many āḷhaka-measures of water, or so many hundreds of āḷhaka-measures of water, or so many thousands of āḷhaka-measures of water, or so many hundreds of thousands of āḷhaka-measures of water.' Instead, it is reckoned simply as an immeasurable, incalculable great mass of water.\n\nIn the same way, bhikkhus, for a noble disciple endowed with these four streams of merit and streams of skillfulness, it is not easy to measure the merit, saying, 'Such is the extent of this stream of merit, stream of skillfulness, sustenance for happiness, conducive to heavenly states, leading to pleasant consequences, leading to rebirth in heaven, conducive to what is wished for, desired, agreeable, beneficial, and happiness.' Rather, it is reckoned simply as an immeasurable, incalculable great mass of merit.\n\nThe great ocean, boundless, a vast expanse,\nTerrifying in its depths, the abode of excellent jewels;\nJust as rivers, frequented by throngs of people,\nFlowing extensively, reach the ocean.\n\nIn the same way, for a person who gives food, drink, and clothing,\nWho provides beds, seats, and bedding,\nStreams of merit flow towards that wise person,\nJust as water-bearing rivers flow into the ocean.",
      "sinhala": "සැවැත්නුවරදීය.\n\nමහණෙනි, මේවා පින් ගලා ඒමට හේතු වන, කුසල් ගලා ඒමට හේතු වන, සැපයට හේතු වන, ස්වර්ගයට හේතු වන, සැප විපාක ඇති, ස්වර්ගය කරා පමුණුවන, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවත්නා සතරක් වෙති. ඒ සතර කවරේද?\n\nමහණෙනි, යම් භික්‍ෂුවක් සිවුරු පරිභෝජනය කරන්නේ අප්‍රමාණ වූ චේතෝසමාධියට එළඹ වාසය කරන්නේද, ඔහුට අප්‍රමාණ වූ පින් ගලා ඒමද, කුසල් ගලා ඒමද, සැපයට හේතු වීමද, ස්වර්ගයට හේතු වීමද, සැප විපාක ඇති වීමද, ස්වර්ගය කරා පමුණුවීමද, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවතී. මහණෙනි, යම් භික්‍ෂුවක් පිණ්ඩපාතය පරිභෝජනය කරන්නේ අප්‍රමාණ වූ චේතෝසමාධියට එළඹ වාසය කරන්නේද, ඔහුට අප්‍රමාණ වූ පින් ගලා ඒමද, කුසල් ගලා ඒමද, සැපයට හේතු වීමද, ස්වර්ගයට හේතු වීමද, සැප විපාක ඇති වීමද, ස්වර්ගය කරා පමුණුවීමද, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවතී. මහණෙනි, යම් භික්‍ෂුවක් සේනාසන පරිභෝජනය කරන්නේ අප්‍රමාණ වූ චේතෝසමාධියට එළඹ වාසය කරන්නේද, ඔහුට අප්‍රමාණ වූ පින් ගලා ඒමද, කුසල් ගලා ඒමද, සැපයට හේතු වීමද, ස්වර්ගයට හේතු වීමද, සැප විපාක ඇති වීමද, ස්වර්ගය කරා පමුණුවීමද, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවතී. මහණෙනි, යම් භික්‍ෂුවක් ගිලන්පස බෙහෙත් පිරිකර පරිභෝජනය කරන්නේ අප්‍රමාණ වූ චේතෝසමාධියට එළඹ වාසය කරන්නේද, ඔහුට අප්‍රමාණ වූ පින් ගලා ඒමද, කුසල් ගලා ඒමද, සැපයට හේතු වීමද, ස්වර්ගයට හේතු වීමද, සැප විපාක ඇති වීමද, ස්වර්ගය කරා පමුණුවීමද, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවතී.\n\nමහණෙනි, මේවා පින් ගලා ඒමට හේතු වන, කුසල් ගලා ඒමට හේතු වන, සැපයට හේතු වන, ස්වර්ගයට හේතු වන, සැප විපාක ඇති, ස්වර්ගය කරා පමුණුවන, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවත්නා සතරක් වෙති.\n\nමහණෙනි, මේ සතර පින් ගලා ඒමට හේතු වන ධර්මයන්ගෙන්ද, කුසල් ගලා ඒමට හේතු වන ධර්මයන්ගෙන්ද යුක්ත වූ ආර්ය ශ්‍රාවකයාට, “මෙපමණ පින් ගලා ඒමකි, කුසල් ගලා ඒමකි, සැපයට හේතුවකි, ස්වර්ගයට හේතුවකි, සැප විපාකයකි, ස්වර්ගය කරා පමුණුවීමකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවතින්නකි” කියා පිනෙහි ප්‍රමාණය ගන්නට පහසු නැත. එහෙත් අසංඛ්‍ය වූ, අප්‍රමාණ වූ මහත් පින් කඳක්ම ඇති බවට ගණනට ගැනේ.\n\nමහණෙනි, යම් සේ මහා සාගරයේ ජල ප්‍රමාණය “මෙපමණ ජල ආළකයයි, මෙපමණ ජල ආළක සිය ගණනකි, මෙපමණ ජල ආළක දහස් ගණනකි, මෙපමණ ජල ආළක ලක්ෂ ගණනකි” කියා ගන්නට පහසු නැතිද, එහෙත් එය අසංඛ්‍ය වූ, අප්‍රමාණ වූ මහත් ජල කඳක්ම ඇති බවට ගණනට ගැනේද, එසේම මහණෙනි, මේ සතර පින් ගලා ඒමට හේතු වන ධර්මයන්ගෙන්ද, කුසල් ගලා ඒමට හේතු වන ධර්මයන්ගෙන්ද යුක්ත වූ ආර්ය ශ්‍රාවකයාට, “මෙපමණ පින් ගලා ඒමකි, කුසල් ගලා ඒමකි, සැපයට හේතුවකි, ස්වර්ගයට හේතුවකි, සැප විපාකයකි, ස්වර්ගය කරා පමුණුවීමකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත වූ, සැප වූ විපාක පිණිස පවතින්නකි” කියා පිනෙහි ප්‍රමාණය ගන්නට පහසු නැත. එහෙත් අසංඛ්‍ය වූ, අප්‍රමාණ වූ මහත් පින් කඳක්ම ඇති බවට ගණනට ගැනේ.\n\nඅප්‍රමාණ වූ, මහා ගැඹුරු වූ, බොහෝ භයානක වූ, උතුම් රත්නයන්ට වාසස්ථාන වූ මහා සාගරයට, මිනිස් සමූහයන් විසින් සේවනය කරනු ලැබූ, නොයෙක් පැතිවලින් ගලන ගංගාවන් යම් සේ පැමිණෙද්ද; එසේම අන්නපාන වස්ත්‍ර දෙන, සයන ආසන ඇතිරිලි දෙන පණ්ඩිතයා කරා, ජලය ගෙන යන ගංගාවෝ සාගරයට පැමිණෙන්නාක් මෙන්, පිනෙහි ධාරාවෝ පැමිණෙත්.",
      "paliTitle": "Paṭhamapuññābhisandasuttaṃ",
      "englishTitle": "First Sutta on Merit's Accrual",
      "sinhalaTitle": "පළමු පුණ්‍යාභිසන්ද සූත්‍රය"
    },
    {
      "number": 52,
      "pali": "‘‘Cattārome, bhikkhave, puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Katame cattāro? Idha, bhikkhave, ariyasāvako buddhe aveccappasādena samannāgato hoti – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Ayaṃ, bhikkhave, paṭhamo puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako dhamme aveccappasādena samannāgato hoti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Ayaṃ, bhikkhave, dutiyo puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako saṅghe aveccappasādena samannāgato hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā, esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Ayaṃ, bhikkhave, tatiyo puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako ariyakantehi sīlehi samannāgato hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. Ayaṃ, bhikkhave, catuttho puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. Ime kho, bhikkhave, cattāro puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattantī’’ti. [a. ni. 5.47] ‘‘Yassa saddhā tathāgate, acalā suppatiṭṭhitā; Sīlañca yassa kalyāṇaṃ, ariyakantaṃ pasaṃsitaṃ. ‘‘Saṅghe pasādo yassatthi, ujubhūtañca dassanaṃ; Adaliddoti taṃ āhu, amoghaṃ tassa jīvitaṃ. ‘‘Tasmā saddhañca sīlañca, pasādaṃ dhammadassanaṃ; Anuyuñjetha medhāvī, saraṃ buddhāna sāsana’’nti. dutiyaṃ;",
      "english": "Monks, there are these four streams of merit, streams of wholesome action, sustenance for happiness, leading to good rebirths, with happy results, conducive to heavenly realms, leading to what is wished for, desired, agreeable, beneficial, and happiness. Which four?\n\nHere, monks, a noble disciple is endowed with unwavering confidence in the Buddha, reflecting thus: \"Indeed, the Blessed One is an Arahant, perfectly self-enlightened, endowed with knowledge and conduct, the Fortunate One, knower of the world, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Enlightened One, the Blessed One.\" This, monks, is the first stream of merit, stream of wholesome action, sustenance for happiness, leading to good rebirths, with happy results, conducive to heavenly realms, leading to what is wished for, desired, agreeable, beneficial, and happiness.\n\nFurthermore, monks, a noble disciple is endowed with unwavering confidence in the Dhamma, reflecting thus: \"The Dhamma is well-proclaimed by the Blessed One, visible here and now, immediate, inviting inspection, leading inwards, to be comprehended by the wise, each for themselves.\" This, monks, is the second stream of merit, stream of wholesome action, sustenance for happiness, leading to good rebirths, with happy results, conducive to heavenly realms, leading to what is wished for, desired, agreeable, beneficial, and happiness.\n\nFurthermore, monks, a noble disciple is endowed with unwavering confidence in the Saṅgha, reflecting thus: \"The Saṅgha of the Blessed One's disciples is practicing the good way, practicing the straight way, practicing the wise way, practicing the proper way; that is, the four pairs of persons, the eight individual noble ones. This Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.\" This, monks, is the third stream of merit, stream of wholesome action, sustenance for happiness, leading to good rebirths, with happy results, conducive to heavenly realms, leading to what is wished for, desired, agreeable, beneficial, and happiness.\n\nFurthermore, monks, a noble disciple is endowed with virtues cherished by the noble ones: unbroken, untorn, unblemished, unspotted, liberating, praised by the wise, unclung to, and conducive to concentration. This, monks, is the fourth stream of merit, stream of wholesome action, sustenance for happiness, leading to good rebirths, with happy results, conducive to heavenly realms, leading to what is wished for, desired, agreeable, beneficial, and happiness. These, monks, are the four streams of merit, streams of wholesome action, sustenance for happiness, leading to good rebirths, with happy results, conducive to heavenly realms, leading to what is wished for, desired, agreeable, beneficial, and happiness.\n\nFor whom faith in the Tathāgata is unwavering, well-established; and whose virtue is good, cherished by the noble ones, praised;\nAnd who has confidence in the Saṅgha, and has a direct vision of the Dhamma: they say of such a one, \"They are not spiritually poor; their life is not in vain.\"\nTherefore, the wise person should constantly pursue faith, virtue, confidence, and the vision of the Dhamma, remembering the teaching of the Buddhas.",
      "sinhala": "මහණෙනි, කුසල සංඛ්‍යාත වූ ද, පින් සංඛ්‍යාත වූ ද, සුවයට හේතු වූ ද, සුවිශේෂී ස්වර්ග සම්පත්තිය පිණිස පවතින සුළු වූ ද, සුව විපාක ඇති වූ ද, ස්වර්ගය පිණිස පවතින සුළු වූ ද, ඉෂ්ට වූ ද, කාන්ත වූ ද, මනාප වූ ද, හිත වූ ද, සුවයට පවතින සුළු වූ ද මේ පින් දහරා සතරක් වෙත්. කවරේද මේ සතර?\n\nමහණෙනි, මෙහි ආර්ය ශ්‍රාවක තෙම බුදුන් වහන්සේ කෙරෙහි 'ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මා සම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර පුරිස දම්ම සාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භගවා යන ගුණාංගවලින් යුක්තය' යනුවෙන් නොසෙල්වෙන, අචල ශ්‍රද්ධාවකින් යුක්ත වන්නේය. මහණෙනි, මෙය සුවයට හේතු වූ ද, සුවිශේෂී ස්වර්ග සම්පත්තිය පිණිස පවතින සුළු වූ ද, සුව විපාක ඇති වූ ද, ස්වර්ගය පිණිස පවතින සුළු වූ ද, ඉෂ්ට වූ ද, කාන්ත වූ ද, මනාප වූ ද, හිත වූ ද, සුවයට පවතින සුළු වූ ද පළමු වන පින් දහරාවයි, කුසල දහරාවයි.\n\nමහණෙනි, නැවත ද ආර්ය ශ්‍රාවක තෙම ධර්මය කෙරෙහි 'භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ ද, සන්දිට්ඨික වූ ද, අකාලික වූ ද, ඒහිපස්සික වූ ද, ඕපනයික වූ ද, ප්‍රත්‍යත්ත වශයෙන් ප්‍රඥාවන්තයන් විසින් දත යුතු වූ ද ධර්මය' යනුවෙන් නොසෙල්වෙන, අචල ශ්‍රද්ධාවකින් යුක්ත වන්නේය. මහණෙනි, මෙය සුවයට හේතු වූ ද, සුවිශේෂී ස්වර්ග සම්පත්තිය පිණිස පවතින සුළු වූ ද, සුව විපාක ඇති වූ ද, ස්වර්ගය පිණිස පවතින සුළු වූ ද, ඉෂ්ට වූ ද, කාන්ත වූ ද, මනාප වූ ද, හිත වූ ද, සුවයට පවතින සුළු වූ ද දෙවෙනි පින් දහරාවයි, කුසල දහරාවයි.\n\nමහණෙනි, නැවත ද ආර්ය ශ්‍රාවක තෙම සංඝයා වහන්සේ කෙරෙහි 'භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා සුප්‍රතිපන්නය, උජුප්‍රතිපන්නය, ඤායප්‍රතිපන්නය, සාමීචිප්‍රතිපන්නය. එනම් සිව් පුරුෂ යුගලක් වූ අට පුද්ගලයන්ගෙන් යුත් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා වහන්සේ ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලීකරණීය වේ. ලෝකයාගේ අනුත්තර පුණ්‍යක්ෂේත්‍රයයි' යනුවෙන් නොසෙල්වෙන, අචල ශ්‍රද්ධාවකින් යුක්ත වන්නේය. මහණෙනි, මෙය සුවයට හේතු වූ ද, සුවිශේෂී ස්වර්ග සම්පත්තිය පිණිස පවතින සුළු වූ ද, සුව විපාක ඇති වූ ද, ස්වර්ගය පිණිස පවතින සුළු වූ ද, ඉෂ්ට වූ ද, කාන්ත වූ ද, මනාප වූ ද, හිත වූ ද, සුවයට පවතින සුළු වූ ද තුන්වෙනි පින් දහරාවයි, කුසල දහරාවයි.\n\nමහණෙනි, නැවත ද ආර්ය ශ්‍රාවක තෙම අඛණ්ඩ වූ, අච්ඡිද්‍ර වූ, අසබල වූ, අකම්මාස වූ, භුජිස්ස වූ, ප්‍රඥාවන්තයන් විසින් ප්‍රශංසා කරන ලද, තෘෂ්ණා දිට්ඨි වලින් ස්පර්ශ නොකරන ලද, සමාධිය පිණිස පවතින ආර්යයන් වහන්සේලා ප්‍රිය කරන සිල්වලින් යුක්ත වන්නේය. මහණෙනි, මෙය සුවයට හේතු වූ ද, සුවිශේෂී ස්වර්ග සම්පත්තිය පිණිස පවතින සුළු වූ ද, සුව විපාක ඇති වූ ද, ස්වර්ගය පිණිස පවතින සුළු වූ ද, ඉෂ්ට වූ ද, කාන්ත වූ ද, මනාප වූ ද, හිත වූ ද, සුවයට පවතින සුළු වූ ද සතරවෙනි පින් දහරාවයි, කුසල දහරාවයි. මහණෙනි, සුවයට හේතු වූ ද, සුවිශේෂී ස්වර්ග සම්පත්තිය පිණිස පවතින සුළු වූ ද, සුව විපාක ඇති වූ ද, ස්වර්ගය පිණිස පවතින සුළු වූ ද, ඉෂ්ට වූ ද, කාන්ත වූ ද, මනාප වූ ද, හිත වූ ද, සුවයට පවතින සුළු වූ ද මේ පින් දහරා සතර නම් මේවාය.\n\nතථාගතයන් වහන්සේ කෙරෙහි යමකුගේ ශ්‍රද්ධාව අචල වූ ද, හොඳින් පිහිටි වූ ද වේ ද, යමකුගේ සිල් ආර්යයන් වහන්සේලා ප්‍රිය කරන ලද, ප්‍රශංසා කරන ලද, කල්‍යාණ වූ සිල් වේ ද,\n\nසංඝයා වහන්සේ කෙරෙහි යමකුගේ ප්‍රසාදය ඇත්තේ ද, යමකුගේ දැක්ම සෘජු වූයේ ද වේ ද, ඔවුහු ඔහු දුගී නොවේ යැයි කියති. ඔහුගේ ජීවිතය නිෂ්ඵල නොවේ.\n\nඑහෙයින් නුවණැත්තා බුදුවරුන්ගේ ශාසනය සිහි කරමින් ශ්‍රද්ධාව ද, සිල් ද, ප්‍රසාදය ද, ධර්මය දැකීම ද අනුයෝගයෙන් පුරුදු කළ යුතුය.",
      "paliTitle": "Dutiyapuññābhisandasuttaṃ",
      "englishTitle": "The Second Discourse on the Flow of Merit",
      "sinhalaTitle": "දෙවන පින් දහර සූත්‍රය"
    },
    {
      "number": 53,
      "pali": "Ekaṃ samayaṃ bhagavā antarā ca madhuraṃ antarā ca verañjaṃ addhānamaggappaṭipanno hoti. Sambahulāpi kho gahapatī ca gahapatāniyo ca antarā ca madhuraṃ antarā ca verañjaṃ addhānamaggappaṭipannā honti. Atha kho bhagavā maggā okkamma aññatarasmiṃ rukkhamūle ( ) [(paññatte āsane) (pī. ka.)] nisīdi. Addasaṃsu kho gahapatī ca gahapatāniyo ca bhagavantaṃ aññatarasmiṃ rukkhamūle nisinnaṃ. Disvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te gahapatī ca gahapatāniyo ca bhagavā etadavoca – ‘‘Cattārome, gahapatayo, saṃvāsā. Katame cattāro? Chavo chavāya saddhiṃ saṃvasati, chavo deviyā saddhiṃ saṃvasati, devo chavāya saddhiṃ saṃvasati, devo deviyā saddhiṃ saṃvasati. ‘‘Kathañca, gahapatayo, chavo chavāya saddhiṃ saṃvasati? Idha, gahapatayo, sāmiko hoti pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī surāmerayamajjapamādaṭṭhāyī dussīlo pāpadhammo maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyāpissa hoti pāṇātipātinī adinnādāyinī kāmesumicchācārinī musāvādinī surāmerayamajjapamādaṭṭhāyinī dussīlā pāpadhammā maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, gahapatayo, chavo chavāya saddhiṃ saṃvasati. ‘‘Kathañca, gahapatayo, chavo deviyā saddhiṃ saṃvasati? Idha, gahapatayo, sāmiko hoti pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī surāmerayamajjapamādaṭṭhāyī dussīlo pāpadhammo maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyā khvassa hoti pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā surāmerayamajjapamādaṭṭhānā paṭiviratā sīlavatī kalyāṇadhammā vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, gahapatayo, chavo deviyā saddhiṃ saṃvasati. ‘‘Kathañca, gahapatayo, devo chavāya saddhiṃ saṃvasati? Idha, gahapatayo, sāmiko hoti pāṇātipātā paṭivirato adinnādānā paṭivirato kāmesumicchācārā paṭivirato musāvādā paṭivirato surāmerayamajjapamādaṭṭhānā paṭivirato sīlavā kalyāṇadhammo vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyā khvassa hoti pāṇātipātinī…pe… surāmerayamajjapamādaṭṭhāyinī dussīlā pāpadhammā maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, gahapatayo, devo chavāya saddhiṃ saṃvasati. ‘‘Kathañca, gahapatayo, devo deviyā saddhiṃ saṃvasati? Idha, gahapatayo, sāmiko hoti pāṇātipātā paṭivirato…pe… sīlavā kalyāṇadhammo vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyāpissa hoti pāṇātipātā paṭiviratā…pe… surāmerayamajjapamādaṭṭhānā paṭiviratā sīlavatī kalyāṇadhammā vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, gahapatayo, devo deviyā saddhiṃ saṃvasati. Ime kho, gahapatayo, cattāro saṃvāsā’’ti. ‘‘Ubho ca honti dussīlā, kadariyā paribhāsakā; Te honti jānipatayo, chavā saṃvāsamāgatā. ‘‘Sāmiko hoti dussīlo, kadariyo paribhāsako; Bhariyā sīlavatī hoti, vadaññū vītamaccharā; Sāpi devī saṃvasati, chavena patinā saha. ‘‘Sāmiko sīlavā hoti, vadaññū vītamaccharo; Bhariyā hoti dussīlā, kadariyā paribhāsikā; Sāpi chavā saṃvasati, devena patinā saha. ‘‘Ubho saddhā vadaññū ca, saññatā dhammajīvino; Te honti jānipatayo, aññamaññaṃ piyaṃvadā. ‘‘Atthāsaṃ pacurā honti, phāsukaṃ [phāsattaṃ (sī.), vāsatthaṃ (pī.)] upajāyati; Amittā dummanā honti, ubhinnaṃ samasīlinaṃ. ‘‘Idha dhammaṃ caritvāna, samasīlabbatā ubho; Nandino devalokasmiṃ, modanti kāmakāmino’’ti. tatiyaṃ;",
      "english": "On one occasion, the Blessed One was journeying along the road between Madhura and Verañja. And many householders and their wives were also journeying along the road between Madhura and Verañja. Then the Blessed One, having left the road, sat down at the root of a certain tree. Indeed, the householders and their wives saw the Blessed One sitting at the root of a certain tree. Having seen him, they approached where the Blessed One was. Having approached and paid homage to the Blessed One, they sat down to one side.\n\nTo those householders and their wives sitting to one side, the Blessed One said this: \"Householders, there are these four types of companionship. Which four? A corpse-like man lives with a corpse-like woman, a corpse-like man lives with a divine woman, a divine man lives with a corpse-like woman, and a divine man lives with a divine woman.\"\n\n\"And how, householders, does a corpse-like man live with a corpse-like woman? Here, householders, the husband is a killer of living beings, a taker of what is not given, one who engages in sexual misconduct, a speaker of falsehoods, one given to intoxication through fermented and distilled liquors, causing heedlessness; he is unvirtuous, of evil character, lives at home with a mind overwhelmed by the stain of stinginess, and abuses and reviles monastics and brahmins. And his wife is also a killer of living beings, a taker of what is not given, one who engages in sexual misconduct, a speaker of falsehoods, one given to intoxication through fermented and distilled liquors, causing heedlessness; she is unvirtuous, of evil character, lives at home with a mind overwhelmed by the stain of stinginess, and abuses and reviles monastics and brahmins. This is how, householders, a corpse-like man lives with a corpse-like woman.\"\n\n\"And how, householders, does a corpse-like man live with a divine woman? Here, householders, the husband is a killer of living beings, a taker of what is not given, one who engages in sexual misconduct, a speaker of falsehoods, one given to intoxication through fermented and distilled liquors, causing heedlessness; he is unvirtuous, of evil character, lives at home with a mind overwhelmed by the stain of stinginess, and abuses and reviles monastics and brahmins. But his wife abstains from killing living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from speaking falsehoods, abstains from intoxication through fermented and distilled liquors, causing heedlessness; she is virtuous, of good character, lives at home with a mind free from the stain of stinginess, and does not abuse or revile monastics and brahmins. This is how, householders, a corpse-like man lives with a divine woman.\"\n\n\"And how, householders, does a divine man live with a corpse-like woman? Here, householders, the husband abstains from killing living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from speaking falsehoods, abstains from intoxication through fermented and distilled liquors, causing heedlessness; he is virtuous, of good character, lives at home with a mind free from the stain of stinginess, and does not abuse or revile monastics and brahmins. But his wife is a killer of living beings, a taker of what is not given, one who engages in sexual misconduct, a speaker of falsehoods, one given to intoxication through fermented and distilled liquors, causing heedlessness; she is unvirtuous, of evil character, lives at home with a mind overwhelmed by the stain of stinginess, and abuses and reviles monastics and brahmins. This is how, householders, a divine man lives with a corpse-like woman.\"\n\n\"And how, householders, does a divine man live with a divine woman? Here, householders, the husband abstains from killing living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from speaking falsehoods, abstains from intoxication through fermented and distilled liquors, causing heedlessness; he is virtuous, of good character, lives at home with a mind free from the stain of stinginess, and does not abuse or revile monastics and brahmins. And his wife also abstains from killing living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from speaking falsehoods, abstains from intoxication through fermented and distilled liquors, causing heedlessness; she is virtuous, of good character, lives at home with a mind free from the stain of stinginess, and does not abuse or revile monastics and brahmins. This is how, householders, a divine man lives with a divine woman. These, householders, are the four types of companionship.\"\n\nWhen both are unvirtuous, stingy, and abusive,\nThey are husband and wife, having come together as corpse-like ones.\n\nWhen the husband is unvirtuous, stingy, and abusive,\nBut the wife is virtuous, generous, and free from stinginess,\nThat divine woman lives with a corpse-like husband.\n\nWhen the husband is virtuous, generous, and free from stinginess,\nBut the wife is unvirtuous, stingy, and abusive,\nThat corpse-like woman lives with a divine husband.\n\nWhen both are faithful and generous, self-restrained and living righteously,\nThey are husband and wife, speaking pleasantly to each other.\n\nTheir aims are plentiful, and comfort arises.\nTheir enemies are distressed, for both are equally virtuous.\n\nHaving practiced the Dhamma in this world, both having equal virtue and observances,\nThey rejoice in the deva-world, delighting, enjoying their desires.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ මධුරාව සහ වේරඤ්ජාව අතර මාර්ගයේ ගමන් කරමින් සිටියාහ. බොහෝ ගෘහපතියෝ ද ගෘහපතිනියෝ ද මධුරාව සහ වේරඤ්ජාව අතර මාර්ගයේ ගමන් කරමින් සිටියහ. ඉන්පසු භාග්‍යවතුන් වහන්සේ මඟින් ඉවත්ව එක්තරා රුක්මුලක වැඩ හිඳගත් සේක. ගෘහපතියෝ ද ගෘහපතිනියෝ ද භාග්‍යවතුන් වහන්සේ එක්තරා රුක්මුලක වැඩ හිඳගෙන සිටිනු දුටුවෝය. දැක, භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූහ. එක් පසෙකින් වාඩි වී සිටි ඒ ගෘහපතිවරුන්ට හා ගෘහපතිනියන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"ගෘහපතිවරුනි, මේ සංවාස (එකව වාසය කිරීම්) සතරකි. කවරේද ඒ සතර? මළමිනියක් මළමිනියක් සමඟ එකව වාසය කරයි. මළමිනියක් දෙවඟනක් සමඟ එකව වාසය කරයි. දෙවියෙක් මළමිනියක් සමඟ එකව වාසය කරයි. දෙවියෙක් දෙවඟනක් සමඟ එකව වාසය කරයි.\"\n\n\"ගෘහපතිවරුනි, මළමිනියක් මළමිනියක් සමඟ එකව වාසය කරන්නේ කෙසේද? ගෘහපතිවරුනි, මෙහි ස්වාමිපුරුෂයා ප්‍රාණඝාතී, අදත්තාදායි, කාමයන්හි මිස්‍යාචාරී, මුසාවාදී, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්හි හැසිරෙන්නෙක් වේ. ඔහු දුශ්ශීල, පාපී ස්වභාව ඇත්තෙක් වී, මසුරුමලයෙන් වෙලුණු සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට බණින්නෙක්, පරිභව කරන්නෙක් වේ. ඔහුගේ භාර්යාව ද ප්‍රාණඝාතිනී, අදත්තාදායිනී, කාමයන්හි මිස්‍යාචාරිනී, මුසාවාදිනී, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්හි හැසිරෙන්නී, දුශ්ශීල, පාපී ස්වභාව ඇත්තී වේ. මසුරුමලයෙන් වෙලුණු සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට බණින්නී, පරිභව කරන්නී වේ. ගෘහපතිවරුනි, මළමිනියක් මළමිනියක් සමඟ එකව වාසය කරන්නේ මෙසේය.\"\n\n\"ගෘහපතිවරුනි, මළමිනියක් දෙවඟනක් සමඟ එකව වාසය කරන්නේ කෙසේද? ගෘහපතිවරුනි, මෙහි ස්වාමිපුරුෂයා ප්‍රාණඝාතී, අදත්තාදායි, කාමයන්හි මිස්‍යාචාරී, මුසාවාදී, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්හි හැසිරෙන්නෙක් වේ. ඔහු දුශ්ශීල, පාපී ස්වභාව ඇත්තෙක් වී, මසුරුමලයෙන් වෙලුණු සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට බණින්නෙක්, පරිභව කරන්නෙක් වේ. එහෙත් ඔහුගේ භාර්යාව ප්‍රාණඝාතයෙන් වැළකුණු, අදත්තාදානයෙන් වැළකුණු, කාමයන්හි මිස්‍යාචාරයෙන් වැළකුණු, මුසාවාදයෙන් වැළකුණු, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්ගෙන් වැළකුණු, සිල්වත්, යහපත් ගුණධර්ම ඇත්තී වේ. මසුරුමල දුරුකළ සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට නොබණින්නී, පරිභව නොකරන්නී වේ. ගෘහපතිවරුනි, මළමිනියක් දෙවඟනක් සමඟ එකව වාසය කරන්නේ මෙසේය.\"\n\n\"ගෘහපතිවරුනි, දෙවියෙක් මළමිනියක් සමඟ එකව වාසය කරන්නේ කෙසේද? ගෘහපතිවරුනි, මෙහි ස්වාමිපුරුෂයා ප්‍රාණඝාතයෙන් වැළකුණු, අදත්තාදානයෙන් වැළකුණු, කාමයන්හි මිස්‍යාචාරයෙන් වැළකුණු, මුසාවාදයෙන් වැළකුණු, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්ගෙන් වැළකුණු, සිල්වත්, යහපත් ගුණධර්ම ඇත්තෙක් වේ. මසුරුමල දුරුකළ සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට නොබණින්නෙක්, පරිභව නොකරන්නෙක් වේ. එහෙත් ඔහුගේ භාර්යාව ප්‍රාණඝාතිනී, අදත්තාදායිනී, කාමයන්හි මිස්‍යාචාරිනී, මුසාවාදිනී, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්හි හැසිරෙන්නී, දුශ්ශීල, පාපී ස්වභාව ඇත්තී වේ. මසුරුමලයෙන් වෙලුණු සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට බණින්නී, පරිභව කරන්නී වේ. ගෘහපතිවරුනි, දෙවියෙක් මළමිනියක් සමඟ එකව වාසය කරන්නේ මෙසේය.\"\n\n\"ගෘහපතිවරුනි, දෙවියෙක් දෙවඟනක් සමඟ එකව වාසය කරන්නේ කෙසේද? ගෘහපතිවරුනි, මෙහි ස්වාමිපුරුෂයා ප්‍රාණඝාතයෙන් වැළකුණු, අදත්තාදානයෙන් වැළකුණු, කාමයන්හි මිස්‍යාචාරයෙන් වැළකුණු, මුසාවාදයෙන් වැළකුණු, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්ගෙන් වැළකුණු, සිල්වත්, යහපත් ගුණධර්ම ඇත්තෙක් වේ. මසුරුමල දුරුකළ සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට නොබණින්නෙක්, පරිභව නොකරන්නෙක් වේ. ඔහුගේ භාර්යාව ද ප්‍රාණඝාතයෙන් වැළකුණු, අදත්තාදානයෙන් වැළකුණු, කාමයන්හි මිස්‍යාචාරයෙන් වැළකුණු, මුසාවාදයෙන් වැළකුණු, සුරාමේරය මද්‍යප්‍රමාද ස්ථානයන්ගෙන් වැළකුණු, සිල්වත්, යහපත් ගුණධර්ම ඇත්තී වේ. මසුරුමල දුරුකළ සිතින් යුතුව ගිහි ගෙයි වසයි. ශ්‍රමණ බ්‍රාහ්මණයන්ට නොබණින්නී, පරිභව නොකරන්නී වේ. ගෘහපතිවරුනි, දෙවියෙක් දෙවඟනක් සමඟ එකව වාසය කරන්නේ මෙසේය. ගෘහපතිවරුනි, මේ සංවාස සතර මෙසේය.\"\n\nදෙදෙනාම දුශ්ශීල වූවාහු, මසුරු වූවාහු, (අනුන්හට) බණින්නෝ වෙති.\nඒ ස්වාමි භාර්යා දෙදෙනා මළමිණි දෙදෙනෙකු ලෙස එක්ව වාසයට පැමිණියෝ වෙති.\n\nස්වාමිපුරුෂයා දුශ්ශීල වූයේ, මසුරු වූයේ, බණින්නෙක් වූයේ නම්,\nභාර්යාව සිල්වත් වූවා, ත්‍යාගශීලී වූවා, මසුරුමල දුරුකළා වූවා නම්,\nඒ දෙවඟන ද මළමිනියක් වැනි ස්වාමිපුරුෂයා සමඟ එකව වාසය කරයි.\n\nස්වාමිපුරුෂයා සිල්වත් වූයේ, ත්‍යාගශීලී වූයේ, මසුරුමල දුරුකළේ නම්,\nභාර්යාව දුශ්ශීල වූවා, මසුරු වූවා, බණින්නියක් වූවා නම්,\nඒ මළමිනියක් වැනි භාර්යාව ද දෙවියෙක් වැනි ස්වාමිපුරුෂයා සමඟ එකව වාසය කරයි.\n\nදෙදෙනාම ශ්‍රද්ධාවන්ත වූවාහු, ත්‍යාගශීලී වූවාහු, සංවර වූවාහු, ධර්මානුකූලව ජීවත්වන්නෝ වෙති.\nඒ ස්වාමි භාර්යා දෙදෙනා එකිනෙකාට ප්‍රියවචන කියන්නෝ වෙති.\n\nඔවුන්ට අර්ථයන් බහුල වෙයි, සැප පහසුව ඇති වෙයි.\nසමාන ශීල ඇති ඒ දෙදෙනාට අමිත්‍රයෝ දුකින් වෙති.\n\nමෙලොව ධර්මයෙහි හැසිර, සමාන ශීලව්‍රත ඇති ඒ දෙදෙනා,\nදෙව්ලොව ප්‍රීති වන්නෝ, කාම සම්පත් විඳිමින් සතුටු වෙති.",
      "paliTitle": "Paṭhamasaṃvāsasuttaṃ",
      "englishTitle": "First Sutta on Living Together",
      "sinhalaTitle": "පළමු සංවාස සූත‍්‍රය"
    },
    {
      "number": 54,
      "pali": "‘‘Cattārome, bhikkhave, saṃvāsā. Katame cattāro? Chavo chavāya saddhiṃ saṃvasati, chavo deviyā saddhiṃ saṃvasati, devo chavāya saddhiṃ saṃvasati, devo deviyā saddhiṃ saṃvasati. ‘‘Kathañca, bhikkhave, chavo chavāya saddhiṃ saṃvasati. Idha, bhikkhave, sāmiko hoti pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhiko dussīlo pāpadhammo maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyāpissa hoti pāṇātipātinī adinnādāyinī kāmesumicchācārinī musāvādinī pisuṇavācā pharusavācā samphappalāpinī abhijjhālunī byāpannacittā micchādiṭṭhikā dussīlā pāpadhammā maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, bhikkhave, chavo chavāya saddhiṃ saṃvasati. ‘‘Kathañca, bhikkhave, chavo deviyā saddhiṃ saṃvasati? Idha, bhikkhave, sāmiko hoti pāṇātipātī…pe… micchādiṭṭhiko dussīlo pāpadhammo maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyā khvassa hoti pāṇātipātā paṭiviratā adinnādānā paṭiviratā kāmesumicchācārā paṭiviratā musāvādā paṭiviratā pisuṇāya vācāya paṭiviratā pharusāya vācāya paṭiviratā samphappalāpā paṭiviratā anabhijjhālunī abyāpannacittā sammādiṭṭhikā sīlavatī kalyāṇadhammā vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, bhikkhave, chavo deviyā saddhiṃ saṃvasati. ‘‘Kathañca, bhikkhave, devo chavāya saddhiṃ saṃvasati? Idha, bhikkhave, sāmiko hoti pāṇātipātā paṭivirato adinnādānā paṭivirato kāmesumicchācārā paṭivirato musāvādā paṭivirato pisuṇāya vācāya paṭivirato pharusāya vācāya paṭivirato samphappalāpā paṭivirato anabhijjhālu abyāpannacitto sammādiṭṭhiko sīlavā kalyāṇadhammo vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyā khvassa hoti pāṇātipātinī…pe… micchādiṭṭhikā dussīlā pāpadhammā maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati akkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, bhikkhave, devo chavāya saddhiṃ saṃvasati. ‘‘Kathañca, bhikkhave, devo deviyā saddhiṃ saṃvasati? Idha, bhikkhave, sāmiko hoti pāṇātipātā paṭivirato…pe… sammādiṭṭhiko sīlavā kalyāṇadhammo vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosakaparibhāsako samaṇabrāhmaṇānaṃ; bhariyāpissa hoti pāṇātipātā paṭiviratā…pe… sammādiṭṭhikā sīlavatī kalyāṇadhammā vigatamalamaccherena cetasā agāraṃ ajjhāvasati anakkosikaparibhāsikā samaṇabrāhmaṇānaṃ. Evaṃ kho, bhikkhave, devo deviyā saddhiṃ saṃvasati. Ime kho, bhikkhave, cattāro saṃvāsā’’ti. ‘‘Ubho ca honti dussīlā, kadariyā paribhāsakā; Te honti jānipatayo, chavā saṃvāsamāgatā. ‘‘Sāmiko hoti dussīlo, kadariyo paribhāsako; Bhariyā sīlavatī hoti, vadaññū vītamaccharā; Sāpi devī saṃvasati, chavena patinā saha. ‘‘Sāmiko sīlavā hoti, vadaññū vītamaccharo; Bhariyā hoti dussīlā, kadariyā paribhāsikā; Sāpi chavā saṃvasati, devena patinā saha. ‘‘Ubho saddhā vadaññū ca, saññatā dhammajīvino; Te honti jānipatayo, aññamaññaṃ piyaṃvadā. ‘‘Atthāsaṃ pacurā honti, phāsukaṃ upajāyati; Amittā dummanā honti, ubhinnaṃ samasīlinaṃ. ‘‘Idha dhammaṃ caritvāna, samasīlabbatā ubho; Nandino devalokasmiṃ, modanti kāmakāmino’’ti. catutthaṃ;",
      "english": "There are, monks, these four kinds of cohabitation. Which four? A morally deficient person lives with a morally deficient person; a morally deficient person lives with a divine person; a divine person lives with a morally deficient person; a divine person lives with a divine person.\n\nAnd how, monks, does a morally deficient person live with a morally deficient person? Here, monks, the husband is one who takes life, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has an ill-willed mind, holds wrong view, is immoral, of evil nature, and dwells in a home with a mind overcome by the stain of stinginess, abusing and reviling monastics and brahmins. And his wife is also one who takes life, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has an ill-willed mind, holds wrong view, is immoral, of evil nature, and dwells in a home with a mind overcome by the stain of stinginess, abusing and reviling monastics and brahmins. Thus, monks, a morally deficient person lives with a morally deficient person.\n\nAnd how, monks, does a morally deficient person live with a divine person? Here, monks, the husband is one who takes life, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has an ill-willed mind, holds wrong view, is immoral, of evil nature, and dwells in a home with a mind overcome by the stain of stinginess, abusing and reviling monastics and brahmins. But his wife is one who abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter, is not covetous, has a benevolent mind, holds right view, is virtuous, of good nature, and dwells in a home with a mind freed from the stain of stinginess, not abusing or reviling monastics and brahmins. Thus, monks, a morally deficient person lives with a divine person.\n\nAnd how, monks, does a divine person live with a morally deficient person? Here, monks, the husband is one who abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter, is not covetous, has a benevolent mind, holds right view, is virtuous, of good nature, and dwells in a home with a mind freed from the stain of stinginess, not abusing or reviling monastics and brahmins. But his wife is one who takes life, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has an ill-willed mind, holds wrong view, is immoral, of evil nature, and dwells in a home with a mind overcome by the stain of stinginess, abusing and reviling monastics and brahmins. Thus, monks, a divine person lives with a morally deficient person.\n\nAnd how, monks, does a divine person live with a divine person? Here, monks, the husband is one who abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter, is not covetous, has a benevolent mind, holds right view, is virtuous, of good nature, and dwells in a home with a mind freed from the stain of stinginess, not abusing or reviling monastics and brahmins. And his wife is also one who abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter, is not covetous, has a benevolent mind, holds right view, is virtuous, of good nature, and dwells in a home with a mind freed from the stain of stinginess, not abusing or reviling monastics and brahmins. Thus, monks, a divine person lives with a divine person. These, monks, are the four kinds of cohabitation.\n\nWhen both are immoral, miserly, and abusive,\nThey become husband and wife, like corpses cohabiting.\n\nIf the husband is immoral, miserly, and abusive,\nWhile the wife is virtuous, generous, and free from stinginess,\nThat divine woman lives with a corpse as her husband.\n\nIf the husband is virtuous, generous, and free from stinginess,\nWhile the wife is immoral, miserly, and abusive,\nThat corpse-like woman lives with a divine man as her husband.\n\nWhen both are faithful and generous, restrained and live righteously,\nThey become husband and wife, speaking kindly to each other.\n\nFor them, prosperity abounds, and comfort arises;\nTheir enemies become dejected, for both are of equal virtue.\n\nHaving practiced the Dhamma here, both endowed with equal virtue and observances,\nDelighting in the divine realm, they rejoice, enjoying their desired pleasures.",
      "sinhala": "භික්ෂූනි, මේ සිව් වැදෑරුම් සහවාසයෝ වෙති. ඒ කවර සතර ද? මළමිනිය මළමිනියක් සමඟ සහවාස කරයි, මළමිනිය දෙවඟනක් සමඟ සහවාස කරයි, දෙවියා මළමිනියක් සමඟ සහවාස කරයි, දෙවියා දෙවඟනක් සමඟ සහවාස කරයි.\n\nභික්ෂූනි, මළමිනියක් මළමිනියක් සමඟ සහවාස කරන්නේ කෙසේද? භික්ෂූනි, මෙහි ස්වාමියා පරපණ නසන සුළු, අනුන් සතු දේ නොදී ගන්නා සුළු, කාමයන්හි වරදවා හැසිරෙන සුළු, බොරු කියන සුළු, කේළාම් කියන සුළු, රළු වචන කතා කරන සුළු, හිස් වචන දොඩවන සුළු, දැඩි ලෝභයෙන් යුක්ත වූ, ක්‍රෝධයෙන් යුත් සිතැත්තා වූ, මිථ්‍යාදෘෂ්ටික වූ, දුස්සීල වූ, පාපී ස්වභාව ඇත්තා වූ, මසුරු මලින් පෙළුණු සිතින් ගිහි ගෙය වාසය කරන්නා වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට බණින, නින්දා කරන කෙනෙක් වෙයි. ඔහුගේ භාර්යාව ද පරපණ නසන සුළු, අනුන් සතු දේ නොදී ගන්නා සුළු, කාමයන්හි වරදවා හැසිරෙන සුළු, බොරු කියන සුළු, කේළාම් කියන සුළු, රළු වචන කතා කරන සුළු, හිස් වචන දොඩවන සුළු, දැඩි ලෝභයෙන් යුක්ත වූ, ක්‍රෝධයෙන් යුත් සිතැත්තී වූ, මිථ්‍යාදෘෂ්ටික වූ, දුස්සීල වූ, පාපී ස්වභාව ඇත්තී වූ, මසුරු මලින් පෙළුණු සිතින් ගිහි ගෙය වාසය කරන්නී වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට බණින, නින්දා කරන කෙනෙක් වෙයි. භික්ෂූනි, මළමිනියක් මළමිනියක් සමඟ සහවාස කරන්නේ මෙසේ ය.\n\nභික්ෂූනි, මළමිනියක් දෙවඟනක් සමඟ සහවාස කරන්නේ කෙසේද? භික්ෂූනි, මෙහි ස්වාමියා පරපණ නසන සුළු, අනුන් සතු දේ නොදී ගන්නා සුළු, කාමයන්හි වරදවා හැසිරෙන සුළු, බොරු කියන සුළු, කේළාම් කියන සුළු, රළු වචන කතා කරන සුළු, හිස් වචන දොඩවන සුළු, දැඩි ලෝභයෙන් යුක්ත වූ, ක්‍රෝධයෙන් යුත් සිතැත්තා වූ, මිථ්‍යාදෘෂ්ටික වූ, දුස්සීල වූ, පාපී ස්වභාව ඇත්තා වූ, මසුරු මලින් පෙළුණු සිතින් ගිහි ගෙය වාසය කරන්නා වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට බණින, නින්දා කරන කෙනෙක් වෙයි. ඔහුගේ භාර්යාව නම් පරපණ නැසීමෙන් වැළකුණා වූ, අනුන් සතු දේ නොදී ගැනීමෙන් වැළකුණා වූ, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණා වූ, බොරු කීමෙන් වැළකුණා වූ, කේළාම් කීමෙන් වැළකුණා වූ, රළු වචන කතා කිරීමෙන් වැළකුණා වූ, හිස් වචන දොඩවීමෙන් වැළකුණා වූ, ලෝභ නැත්තී වූ, ක්‍රෝධයෙන් තොර වූ සිතැත්තී වූ, සම්මාදිට්ඨික වූ, සිල්වත් වූ, යහපත් ගුණධර්ම ඇත්තී වූ, මසුරු මල දුරු කළ සිතින් ගිහි ගෙය වාසය කරන්නී වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට නොබණින, නින්දා නොකරන කෙනෙක් වෙයි. භික්ෂූනි, මළමිනියක් දෙවඟනක් සමඟ සහවාස කරන්නේ මෙසේ ය.\n\nභික්ෂූනි, දෙවියා මළමිනියක් සමඟ සහවාස කරන්නේ කෙසේද? භික්ෂූනි, මෙහි ස්වාමියා පරපණ නැසීමෙන් වැළකුණා වූ, අනුන් සතු දේ නොදී ගැනීමෙන් වැළකුණා වූ, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණා වූ, බොරු කීමෙන් වැළකුණා වූ, කේළාම් කීමෙන් වැළකුණා වූ, රළු වචන කතා කිරීමෙන් වැළකුණා වූ, හිස් වචන දොඩවීමෙන් වැළකුණා වූ, ලෝභ නැත්තා වූ, ක්‍රෝධයෙන් තොර වූ සිතැත්තා වූ, සම්මාදිට්ඨික වූ, සිල්වත් වූ, යහපත් ගුණධර්ම ඇත්තා වූ, මසුරු මල දුරු කළ සිතින් ගිහි ගෙය වාසය කරන්නා වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට නොබණින, නින්දා නොකරන කෙනෙක් වෙයි. ඔහුගේ භාර්යාව නම් පරපණ නසන සුළු, අනුන් සතු දේ නොදී ගන්නා සුළු, කාමයන්හි වරදවා හැසිරෙන සුළු, බොරු කියන සුළු, කේළාම් කියන සුළු, රළු වචන කතා කරන සුළු, හිස් වචන දොඩවන සුළු, දැඩි ලෝභයෙන් යුක්ත වූ, ක්‍රෝධයෙන් යුත් සිතැත්තී වූ, මිථ්‍යාදෘෂ්ටික වූ, දුස්සීල වූ, පාපී ස්වභාව ඇත්තී වූ, මසුරු මලින් පෙළුණු සිතින් ගිහි ගෙය වාසය කරන්නී වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට බණින, නින්දා කරන කෙනෙක් වෙයි. භික්ෂූනි, දෙවියා මළමිනියක් සමඟ සහවාස කරන්නේ මෙසේ ය.\n\nභික්ෂූනි, දෙවියා දෙවඟනක් සමඟ සහවාස කරන්නේ කෙසේද? භික්ෂූනි, මෙහි ස්වාමියා පරපණ නැසීමෙන් වැළකුණා වූ, අනුන් සතු දේ නොදී ගැනීමෙන් වැළකුණා වූ, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණා වූ, බොරු කීමෙන් වැළකුණා වූ, කේළාම් කීමෙන් වැළකුණා වූ, රළු වචන කතා කිරීමෙන් වැළකුණා වූ, හිස් වචන දොඩවීමෙන් වැළකුණා වූ, ලෝභ නැත්තා වූ, ක්‍රෝධයෙන් තොර වූ සිතැත්තා වූ, සම්මාදිට්ඨික වූ, සිල්වත් වූ, යහපත් ගුණධර්ම ඇත්තා වූ, මසුරු මල දුරු කළ සිතින් ගිහි ගෙය වාසය කරන්නා වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට නොබණින, නින්දා නොකරන කෙනෙක් වෙයි. ඔහුගේ භාර්යාව ද පරපණ නැසීමෙන් වැළකුණා වූ, අනුන් සතු දේ නොදී ගැනීමෙන් වැළකුණා වූ, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණා වූ, බොරු කීමෙන් වැළකුණා වූ, කේළාම් කීමෙන් වැළකුණා වූ, රළු වචන කතා කිරීමෙන් වැළකුණා වූ, හිස් වචන දොඩවීමෙන් වැළකුණා වූ, ලෝභ නැත්තී වූ, ක්‍රෝධයෙන් තොර වූ සිතැත්තී වූ, සම්මාදිට්ඨික වූ, සිල්වත් වූ, යහපත් ගුණධර්ම ඇත්තී වූ, මසුරු මල දුරු කළ සිතින් ගිහි ගෙය වාසය කරන්නී වූ, ශ්‍රමණ_බ්‍රාහ්මණයන්ට නොබණින, නින්දා නොකරන කෙනෙක් වෙයි. භික්ෂූනි, දෙවියා දෙවඟනක් සමඟ සහවාස කරන්නේ මෙසේ ය. භික්ෂූනි, මේ සිව් වැදෑරුම් සහවාසයෝ යයි.\n\nදෙදෙනාම දුස්සීල, මසුරු වූ, අනුන්ට බණින සුළු වෙත් නම්, ඒ ස්වාමි_භාර්යාවෝ මළමිනී වශයෙන් සහවාසයට පැමිණියෝ වෙති.\n\nස්වාමියා දුස්සීල, මසුරු, අනුන්ට බණින සුළු වෙයි. භාර්යාව සිල්වත්, ත්‍යාගශීලී, මසුරු මල දුරු කළ තැනැත්තී වෙයි. ඒ දෙවඟන ද මළමිනියක් වූ ස්වාමියා සමඟ සහවාස කරයි.\n\nස්වාමියා සිල්වත්, ත්‍යාගශීලී, මසුරු මල දුරු කළ තැනැත්තා වෙයි. භාර්යාව දුස්සීල, මසුරු, අනුන්ට බණින සුළු වෙයි. ඒ මළමිනියක් බඳු භාර්යාව ද දෙවියෙක් වූ ස්වාමියා සමඟ සහවාස කරයි.\n\nදෙදෙනාම ශ්‍රද්ධාවන්ත, ත්‍යාගශීලී, ඉන්ද්‍රිය සංවර වූ, ධර්මානුකූලව ජීවත් වන්නෝ වෙති. ඒ ස්වාමි_භාර්යාවෝ එකිනෙකාට ප්‍රිය වචන කතා කරන්නෝ වෙති.\n\nසමාන සීලයෙන් යුත් ඒ දෙදෙනාට අර්ථයන් බහුල වෙයි, සැප පහසුකම් ඇති වෙයි. සතුරෝ ද සිත් තැවුලට පත් වෙති.\n\nමෙලොව ධර්මයෙහි හැසිරෙන්නා වූ, සමාන සීල_ව්‍රත ඇති දෙදෙනාම දෙව්ලොවෙහි ප්‍රීතියෙන් යුක්තව, කැමති සේ සතුටු වෙති.",
      "paliTitle": "Dutiyasaṃvāsasuttaṃ",
      "englishTitle": "Second Sutta on Cohabitation",
      "sinhalaTitle": "දෙවැනි සංවාස සූත‍්‍රය"
    },
    {
      "number": 55,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā bhaggesu viharati susumāragire [suṃsumāragire (sī. syā. kaṃ. pī.)] bhesakaḷāvane [bhesakalāvane (sī. pī. ka.)] migadāye. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena nakulapituno gahapatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho nakulapitā ca gahapati nakulamātā ca gahapatānī yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho nakulapitā gahapati bhagavantaṃ etadavoca – ‘‘Yato me, bhante, nakulamātā gahapatānī daharasseva daharā ānītā, nābhijānāmi nakulamātaraṃ gahapatāniṃ manasāpi aticaritā, kuto pana kāyena! Iccheyyāma mayaṃ, bhante, diṭṭhe ceva dhamme aññamaññaṃ passituṃ abhisamparāyañca aññamaññaṃ passitu’’nti. Nakulamātāpi kho gahapatānī bhagavantaṃ etadavoca – ‘‘yatohaṃ, bhante, nakulapituno gahapatissa daharasseva daharā ānītā, nābhijānāmi nakulapitaraṃ gahapatiṃ manasāpi aticaritā, kuto pana kāyena! Iccheyyāma mayaṃ, bhante, diṭṭhe ceva dhamme aññamaññaṃ passituṃ abhisamparāyañca aññamaññaṃ passitu’’nti. ‘‘Ākaṅkheyyuṃ ce, gahapatayo, ubho jānipatayo diṭṭhe ceva dhamme aññamaññaṃ passituṃ abhisamparāyañca aññamaññaṃ passituṃ ubhova [ubho ca (sī. pī.)] assu samasaddhā samasīlā samacāgā samapaññā, te diṭṭhe ceva dhamme aññamaññaṃ passanti abhisamparāyañca aññamaññaṃ passantī’’ti [passissantīti (ka.)]. ‘‘Ubho saddhā vadaññū ca, saññatā dhammajīvino; Te honti jānipatayo, aññamaññaṃ piyaṃvadā. ‘‘Atthāsaṃ pacurā honti, phāsukaṃ upajāyati; Amittā dummanā honti, ubhinnaṃ samasīlinaṃ. ‘‘Idha dhammaṃ caritvāna, samasīlabbatā ubho; Nandino devalokasmiṃ, modanti kāmakāmino’’ti. pañcamaṃ;",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling among the Bhaggas, at Susumāragira, in the Bhesakaḷāvana Deer Park. Then, in the forenoon, the Blessed One dressed, took his bowl and robe, and went to the residence of Nakulapitā, the householder. Having arrived, he sat down on the appointed seat. Then Nakulapitā, the householder, and Nakulamātā, the householder's wife, went to the Blessed One. Having approached and paid homage to the Blessed One, they sat down to one side. Seated to one side, Nakulapitā, the householder, said to the Blessed One: \"Venerable Sir, since Nakulamātā, the householder's wife, was brought to me when she was still young and I was still young, I do not recall ever having transgressed against Nakulamātā, the householder's wife, even in thought, let alone in body! We wish, Venerable Sir, to see each other in this present life and also to see each other in the life to come.\" Nakulamātā, the householder's wife, also said to the Blessed One: \"Venerable Sir, since I was brought to Nakulapitā, the householder, when he was still young and I was still young, I do not recall ever having transgressed against Nakulapitā, the householder, even in thought, let alone in body! We wish, Venerable Sir, to see each other in this present life and also to see each other in the life to come.\" \"If, householders, both husband and wife wish to see each other in this present life and also to see each other in the life to come, they should both be endowed with the same faith, the same virtue, the same generosity, and the same wisdom. Then they will see each other in this present life and also see each other in the life to come.\"\n\n\"Both faithful and generous, self-restrained, living by the Dhamma; they are husband and wife, speaking kindly to each other. For them, prosperity abounds, comfort arises; enemies are disheartened for these two who are of equal virtue. Having lived the Dhamma here, both possessing the same moral practices and observances, they rejoice in the world of devas, enjoying their desired pleasures.\"",
      "sinhala": "මෙසේ ම විසින් අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ භග්ග ජනපදයේ, සුංසුමාරගිර නම් නගරය අසල, භේසකළා වනය නම් මිගදායෙහි වැඩවසන සේක.\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන, නකුලපිතා ගෘහපතියාගේ නිවස වෙත වැඩිය සේක; එහි වැඩමවා, පනවන ලද අසුනෙහි වැඩහුන් සේක.\n\nඑකල්හි නකුලපිතා ගෘහපතියා ද, නකුලමාතා ගෘහපතිනිය ද, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩි වූහ.\n\nඑකත්පසෙකින් වාඩි වී සිටි නකුලපිතා ගෘහපතියා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"ස්වාමීනි, මා කුඩා වියේදීම, කුඩා වියෙහි සිටි නකුලමාතා ගෘහපතිනිය මා වෙත කැඳවාගෙන එන ලදී. නකුලමාතා ගෘහපතිනිය කෙරෙහි සිතින් හෝ වරදක් කළ බව මම නොදනිමි, කයින් වරදක් කිරීම කෙසේ අසම්භාව්‍ය වේද! ස්වාමීනි, අප දෙදෙනා මේ ආත්මභාවයේ දී ද එකිනෙකා සමඟ වාසය කිරීමට ද, පරලොව දී ද එකිනෙකා සමඟ වාසය කිරීමට ද කැමැත්තෙමු.\"\n\nනකුලමාතා ගෘහපතිනිය ද භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවාය: \"ස්වාමීනි, මා කුඩා වියේදීම, කුඩා වියෙහි සිටි නකුලපිතා ගෘහපතියා වෙත කැඳවාගෙන එන ලදී. නකුලපිතා ගෘහපතියා කෙරෙහි සිතින් හෝ වරදක් කළ බව මම නොදනිමි, කයින් වරදක් කිරීම කෙසේ අසම්භාව්‍ය වේද! ස්වාමීනි, අප දෙදෙනා මේ ආත්මභාවයේ දී ද එකිනෙකා සමඟ වාසය කිරීමට ද, පරලොව දී ද එකිනෙකා සමඟ වාසය කිරීමට ද කැමැත්තෙමු.\"\n\n\"ගෘහපතියෙනි, ස්වාමී පුරුෂයා හා භාර්යාව යන දෙදෙනාම මේ ආත්මභාවයේ දී ද එකිනෙකා සමඟ වාසය කිරීමට ද, පරලොව දී ද එකිනෙකා සමඟ වාසය කිරීමට ද කැමැත්තෝ නම්, ඒ දෙදෙනාම සමසද්ධාවක්, සමසීලයක්, සමත්‍යාගයක්, සමප්‍රඥාවක් ඇත්තෝ විය යුතුය. එසේ වූ කල, ඔවුහු මේ ආත්මභාවයේ දී ද එකිනෙකා සමඟ වාසය කරත්, පරලොව දී ද එකිනෙකා සමඟ වාසය කරත්.\"\n\n\"දෙදෙනාම ශ්‍රද්ධාවෙන් යුක්ත නම්, ත්‍යාගශීලී නම්,\nසංවරශීලී නම්, ධර්මානුකූලව ජීවත් වන්නෝ නම්,\nඒ ස්වාමී පුරුෂයා හා භාර්යාව එකිනෙකාට ප්‍රියවචන කියන්නෝ වෙති.\n\nඔවුනට බොහෝ සම්පත් ඇති වේ. සැප පහසුකම් ඇති වේ.\nසමාන සිල් ඇත්තා වූ ඒ දෙදෙනාගේ සතුරෝ දුකට පත් වෙති.\n\nමෙලොව ධර්මයේ හැසිර, සමාන සිල්වත් බවින් යුක්ත වූ ඒ දෙදෙනා,\nදෙව්ලොවෙහි සතුටු වන්නෝ වෙති, කම් සැප විඳිමින් ප්‍රීති වෙති.\"",
      "paliTitle": "Paṭhamasamajīvīsuttaṃ",
      "englishTitle": "First Discourse on Equal Living",
      "sinhalaTitle": "පළමු සමජීවී සූත්‍රය"
    },
    {
      "number": 56,
      "pali": "‘‘Ākaṅkheyyuṃ ce, bhikkhave, ubho jānipatayo diṭṭhe ceva dhamme aññamaññaṃ passituṃ abhisamparāyañca aññamaññaṃ passituṃ ubhova assu samasaddhā samasīlā samacāgā samapaññā, te diṭṭhe ceva dhamme aññamaññaṃ passanti abhisamparāyañca aññamaññaṃ passantī’’ti. ‘‘Ubho saddhā vadaññū ca, saññatā dhammajīvino; Te honti jānipatayo, aññamaññaṃ piyaṃvadā. ‘‘Atthāsaṃ pacurā honti, phāsukaṃ upajāyati; Amittā dummanā honti, ubhinnaṃ samasīlinaṃ. ‘‘Idha dhammaṃ caritvāna, samasīlabbatā ubho; Nandino devalokasmiṃ, modanti kāmakāmino’’ti. chaṭṭhaṃ;",
      "english": "‘‘If, bhikkhus, both husband and wife wish to see each other in this very life and to see each other in the life to come, then they both should be equal in faith, equal in virtue, equal in generosity, and equal in wisdom. Then they see each other in this very life and see each other in the life to come.’’\n\nBoth are faithful and generous, self-controlled and living righteously by the Dhamma; such a husband and wife speak pleasant words to each other.\n\nFor them, advantages become abundant, comfort and ease arise; their enemies are disheartened by the two who are equal in virtue.\n\nHaving practiced the Dhamma here, both, with equal virtuous practices, rejoice in the deva-world, delighting, experiencing the fulfillment of their desires.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් හෙයකින් ස්වාමි භාර්යාවෝ දෙදෙනාම මේ ආත්මභාවයේදීම එකිනෙකා දැකීමටත්, පරලොවදීද එකිනෙකා දැකීමටත් කැමැති වෙත් නම්, ඔවුහු දෙදෙනාම සමසද්ධාවෙන්, සමසීලයෙන්, සමත්‍යාගයෙන්, සමප්‍රඥාවෙන් යුක්ත විය යුතුය. ඔවුහු මේ ආත්මභාවයේදීම එකිනෙකා දකිති, පරලොවදීද එකිනෙකා දකිති.\n\nශ්‍රද්ධාවන්තවූද, ත්‍යාගශීලීවූද, සංයතවූද, ධර්මයෙන් දිවි ගෙවන්නාවූද ස්වාමි භාර්යාවෝ දෙදෙන, එකිනෙකාට ප්‍රිය වචන කතා කරන්නෝ වෙති.\n\nසමසීලයෙන් යුක්තවූ ඒ දෙදෙනාට සම්පත් බහුල වෙයි, පහසුව ඇති වෙයි, සතුරෝ කනගාටුවට පත් වෙති.\n\nමේ ලොව ධර්මයෙහි හැසිර, සමසීලයෙන් හා සමව්‍රතයෙන් යුක්තවූ ඒ දෙදෙන, කාමයන් කැමැතිව දෙව්ලොවදී ප්‍රීතියෙන් හා සතුටින් වාසය කරති.",
      "paliTitle": "Dutiyasamajīvīsuttaṃ",
      "englishTitle": "Second Discourse on Harmonious Living",
      "sinhalaTitle": "දෙවන සමජීවී සූත්‍රය"
    },
    {
      "number": 57,
      "pali": "Ekaṃ samayaṃ bhagavā koliyesu viharati pajjanikaṃ [sajjanelaṃ (sī. pī.), pajjanelaṃ (syā. kaṃ.)] nāma koliyānaṃ nigamo. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena suppavāsāya koliyadhītuyā nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho suppavāsā koliyadhītā bhagavantaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho suppavāsā koliyadhītā bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho suppavāsaṃ koliyadhītaraṃ bhagavā etadavoca – ‘‘Bhojanaṃ, suppavāse, dentī ariyasāvikā paṭiggāhakānaṃ cattāri ṭhānāni deti. Katamāni cattāri? Āyuṃ deti, vaṇṇaṃ deti, sukhaṃ deti, balaṃ deti. Āyuṃ kho pana datvā āyussa bhāginī hoti dibbassa vā mānusassa vā. Vaṇṇaṃ datvā vaṇṇassa bhāginī hoti dibbassa vā mānusassa vā. Sukhaṃ datvā sukhassa bhāginī hoti dibbassa vā mānusassa vā. Balaṃ datvā balassa bhāginī hoti dibbassa vā mānusassa vā. Bhojanaṃ, suppavāse, dentī ariyasāvikā paṭiggāhakānaṃ imāni cattāri ṭhānāni detī’’ti. ‘‘Susaṅkhataṃ bhojanaṃ yā dadāti, Suciṃ paṇītaṃ [supaṇītaṃ (ka.)] rasasā upetaṃ; Sā dakkhiṇā ujjugatesu dinnā, Caraṇūpapannesu mahaggatesu; Puññena puññaṃ saṃsandamānā, Mahapphalā lokavidūna vaṇṇitā. ‘‘Etādisaṃ yaññamanussarantā, Ye vedajātā vicaranti loke; Vineyya maccheramalaṃ samūlaṃ, Aninditā saggamupenti ṭhāna’’nti. sattamaṃ;",
      "english": "On one occasion, the Blessed One was dwelling among the Koliyans, in a Koliyan town named Pajjanika. Then, in the morning, the Blessed One dressed, took his bowl and robes, and approached the dwelling of Suppavāsā, the Koliyan's daughter. Having approached, he sat down on the appointed seat. Then Suppavāsā, the Koliyan's daughter, with her own hands, served and fully satisfied the Blessed One with exquisite solid and soft food. Then, when the Blessed One had finished eating and had removed his hand from the bowl, Suppavāsā, the Koliyan's daughter, sat down to one side. To Suppavāsā, the Koliyan's daughter, as she sat to one side, the Blessed One said this: \"Suppavāsā, a noble disciple who gives food bestows four things upon those who receive it. Which four? She bestows long life, beauty, happiness, and strength. Having given long life, she becomes a partaker of long life, whether divine or human. Having given beauty, she becomes a partaker of beauty, whether divine or human. Having given happiness, she becomes a partaker of happiness, whether divine or human. Having given strength, she becomes a partaker of strength, whether divine or human. Suppavāsā, a noble disciple who gives food bestows these four things upon those who receive it.\"\n\n\"She who offers well-prepared food, pure and excellent, endowed with exquisite flavors; such an offering, given to those who have gone the straight path, to those endowed with virtuous conduct, to those who have attained greatness, generating merit upon merit, is greatly fruitful and praised by those who know the world. Remembering such an offering, those who live in the world having realized the truth, having uprooted completely the stain of stinginess, blameless, they reach the heavenly abode.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කොලිය දනව්වෙහි පජ්ජනික නම් වූ කොලියවරුන්ගේ නියම්ගමක වැඩසිටින සේක. එකල්හි භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන සුප්පවාසාව නම් වූ කොලිය දියණියගේ නිවස වෙත වැඩිය සේක; වැඩම කොට පනවන ලද ආසනයෙහි වැඩසිටි සේක. එකල්හි සුප්පවාසාව නම් වූ කොලිය දියණිය භාග්‍යවතුන් වහන්සේ ප්‍රණීත වූ, කෑමට සුදුසු, බීමට සුදුසු දේ අතින්ම පිළිගන්වා සන්තර්පණය කොට, වළඳවන ලද්දාය. එකල්හි සුප්පවාසාව නම් වූ කොලිය දියණිය භාග්‍යවතුන් වහන්සේ වළඳා, පාත්‍රයෙන් අත් ඉවත් කළ කල්හි එක් පසෙක වාඩි වූවාය.\n\nඑක් පසෙක වාඩි වී සිටි සුප්පවාසාව නම් වූ කොලිය දියණියට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “සුප්පවාසාවෙනි, ආහාර දෙන ආර්ය ශ්‍රාවිකාව ප්‍රතිග්‍රාහකයන්ට කරුණු සතරක් දෙයි. කවරේද ඒ සතර? ආයුෂ දෙයි, වර්ණය දෙයි, සැප දෙයි, බලය දෙයි. ආයුෂ දුන් කල්හි දිව්‍ය හෝ මනුෂ්‍ය ආයුෂයට හිමිකාරියක් වෙයි. වර්ණය දුන් කල්හි දිව්‍ය හෝ මනුෂ්‍ය වර්ණයට හිමිකාරියක් වෙයි. සැප දුන් කල්හි දිව්‍ය හෝ මනුෂ්‍ය සැපයට හිමිකාරියක් වෙයි. බලය දුන් කල්හි දිව්‍ය හෝ මනුෂ්‍ය බලයට හිමිකාරියක් වෙයි. සුප්පවාසාවෙනි, ආහාර දෙන ආර්ය ශ්‍රාවිකාව ප්‍රතිග්‍රාහකයන්ට මේ කරුණු සතර දෙන්නේය.”\n\n“යම් තැනැත්තියක් මැනවින් සකස් කළ, පිරිසිදු, ප්‍රණීත වූ, රසයෙන් යුක්ත වූ ආහාර දෙයිද, ඒ දක්ෂිණාව ඍජු ගමන් ඇති, චරණයෙන් යුක්ත වූ, මහත් ගුණ ඇති අයට දෙන ලද්දකි. පිනෙන් පින එක් වීමෙන් මහාඵල ගෙන දෙන එය, ලෝකවිදූන් විසින් වර්ණනා කරන ලද්දකි.\n\nයම් කෙනෙක් මෙබඳු යාගයක් (දීමක්) සිහිපත් කරමින්, ඤාණය පහළ වී ලොව හැසිරෙත්ද, ඔවුහු මුලිනුපුටා දැමූ මසුරු මල ඇතිව, කිසිවෙකුගේ නින්දා නොලබමින් ස්වර්ගයට (සුගති ස්ථානයට) පැමිණෙත්.”",
      "paliTitle": "Suppavāsāsuttaṃ",
      "englishTitle": "The Suppavāsā Sutta",
      "sinhalaTitle": "සුප්පවාසා සූත්‍රය"
    },
    {
      "number": 58,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Bhojanaṃ, gahapati, dadamāno ariyasāvako paṭiggāhakānaṃ cattāri ṭhānāni deti. Katamāni cattāri? Āyuṃ deti, vaṇṇaṃ deti, sukhaṃ deti, balaṃ deti. Āyuṃ kho pana datvā āyussa bhāgī hoti dibbassa vā mānusassa vā. Vaṇṇaṃ datvā… sukhaṃ datvā… balaṃ datvā balassa bhāgī hoti dibbassa vā mānusassa vā. Bhojanaṃ, gahapati, dadamāno ariyasāvako paṭiggāhakānaṃ imāni cattāri ṭhānāni detī’’ti. [mahāva. 282] ‘‘Yo saññatānaṃ paradattabhojinaṃ, Kālena sakkacca dadāti bhojanaṃ; Cattāri ṭhānāni anuppavecchati, Āyuñca vaṇṇañca sukhaṃ balañca. ‘‘So āyudāyī vaṇṇadāyī [so āyudāyī baladāyī (sī. pī.), āyudāyī baladāyī (syā. kaṃ.)], sukhaṃ balaṃ dado [sukhaṃ vaṇṇaṃ dado (sī. syā. kaṃ. pī.), sukhabaladado (ka.)] naro; Dīghāyu yasavā hoti, yattha yatthūpapajjatī’’ti. aṭṭhamaṃ;",
      "english": "Then Anathapindika the householder approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As Anathapindika the householder sat to one side, the Blessed One said to him: \"Householder, when a noble disciple gives food, he bestows four things upon the recipients. Which four? He gives life, he gives beauty, he gives happiness, he gives strength. And having given life, he becomes a partaker of life, whether divine or human. Having given beauty, he becomes a partaker of beauty, whether divine or human. Having given happiness, he becomes a partaker of happiness, whether divine or human. Having given strength, he becomes a partaker of strength, whether divine or human. Householder, when a noble disciple gives food, he bestows these four things upon the recipients.\"\n\nWhoever gives food respectfully and at the proper time to the self-controlled who subsist on what is given by others, bestows four things: life, beauty, happiness, and strength. That person, a giver of life, a giver of beauty, a giver of happiness and strength, becomes long-lived and renowned wherever he is reborn.",
      "sinhala": "එසඳ අනාථපිණ්ඩික ගෘහපතිතුමා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි අනාථපිණ්ඩික ගෘහපතිතුමාට භාග්‍යවතුන් වහන්සේ මේ අයුරින් වදාළ සේක: ‘‘ගෘහපතිය, භෝජනය පූජා කරන ආර්ය ශ්‍රාවකයා ප්‍රතිග්‍රාහකයන්ට කරුණු සතරක් දෙයි. කවර සතරක්ද? ආයුෂ දෙයි, වර්ණය (ප්‍රසන්න බව) දෙයි, සුවය දෙයි, බලය දෙයි. ඒ ආයුෂ දී දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ ආයුෂයේ භාග්‍යවන්තයා වෙයි. වර්ණය (ප්‍රසන්න බව) දී දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ වර්ණයේ භාග්‍යවන්තයා වෙයි. සුවය දී දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ සුවයේ භාග්‍යවන්තයා වෙයි. බලය දී දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ බලයේ භාග්‍යවන්තයා වෙයි. ගෘහපතිය, භෝජනය පූජා කරන ආර්ය ශ්‍රාවකයා ප්‍රතිග්‍රාහකයන්ට මේ කරුණු සතර දෙයි’’යි.\n\n‘‘යම් කෙනෙක් සංවර වූ, අනුන් දෙන දෙයින් යැපෙන අයට, කල් ඇතිව සකස් කොට භෝජනය පිරිනමයිද, ඔහු ආයුෂයත්, වර්ණයත්, සුවයත්, බලයත් යන කරුණු සතර ලබා දෙයි. ඒ ආයුෂ දෙන්නා, වර්ණය දෙන්නා, සුවයත් බලයත් දෙන්නා වූ පුද්ගලයා යම් යම් තැනක උපදීද, එහිදී දීර්ඝායුෂ ඇත්තෙක්ද, යසස් ඇත්තෙක්ද වෙයි’’යි.",
      "paliTitle": "Sudattasuttaṃ",
      "englishTitle": "Sudatta Sutta",
      "sinhalaTitle": "සුදත්ත සූත‍්‍රය"
    },
    {
      "number": 59,
      "pali": "‘‘Bhojanaṃ, bhikkhave, dadamāno dāyako paṭiggāhakānaṃ cattāri ṭhānāni deti. Katamāni cattāri? Āyuṃ deti, vaṇṇaṃ deti, sukhaṃ deti, balaṃ deti. Āyuṃ kho pana datvā āyussa bhāgī hoti dibbassa vā mānusassa vā. Vaṇṇaṃ datvā… sukhaṃ datvā… balaṃ datvā balassa bhāgī hoti dibbassa vā mānusassa vā. Bhojanaṃ, bhikkhave, dadamāno dāyako paṭiggāhakānaṃ imāni cattāri ṭhānāni detī’’ti. [mahāva. 282] ‘‘Yo saññatānaṃ paradattabhojinaṃ, Kālena sakkacca dadāti bhojanaṃ; Cattāri ṭhānāni anuppavecchati, Āyuñca vaṇṇañca sukhaṃ balañca. ‘‘So āyudāyī vaṇṇadāyī, sukhaṃ balaṃ dado naro; Dīghāyu yasavā hoti, yattha yatthūpapajjatī’’ti. navamaṃ;",
      "english": "Monks, a donor, giving food, gives four things to the recipients. Which four? He gives long life, beauty, happiness, and strength. Indeed, having given long life, one becomes a sharer in long life, whether divine or human. Having given beauty, one becomes a sharer in beauty, whether divine or human. Having given happiness, one becomes a sharer in happiness, whether divine or human. Having given strength, one becomes a sharer in strength, whether divine or human. Monks, a donor, giving food, gives these four things to the recipients.\n\nWhoever gives food at the proper time with careful attention to those who are restrained and live on alms received from others, he bestows these four things: long life, beauty, happiness, and strength. That person, a giver of long life, a giver of beauty, one who gives happiness and strength, becomes long-lived and renowned wherever they are reborn.",
      "sinhala": "මහණෙනි, දායකයා භෝජනයක් දෙන කල්හි පිළිගන්නා වූ අයට කරුණු සතරක් දෙයි. කවරේද ඒ සතර? ආයුෂ දෙයි, වර්ණය දෙයි, සැපය දෙයි, බලය දෙයි. ආයුෂ දීලා දිව්‍ය හෝ මනුෂ්‍ය ආයුෂයට හිමියෙක් වෙයි. වර්ණය දීලා දිව්‍ය හෝ මනුෂ්‍ය වර්ණයට හිමියෙක් වෙයි. සැපය දීලා දිව්‍ය හෝ මනුෂ්‍ය සැපයට හිමියෙක් වෙයි. බලය දීලා දිව්‍ය හෝ මනුෂ්‍ය බලයට හිමියෙක් වෙයි. මහණෙනි, දායකයා භෝජනයක් දෙන කල්හි පිළිගන්නා වූ අයට මේ කරුණු සතර දෙයි.\n\nයමෙක් සංයත වූ, අනුන් දෙන දෙයින් යැපෙන අයට නියම වේලාවට, ගෞරවයෙන් යුතුව භෝජනය දෙයිද, හෙතෙම ආයුෂය, වර්ණය, සැපය සහ බලය යන කරුණු සතර පිරිනමයි.\n\nආයුෂ දෙන්නා වූ, වර්ණය දෙන්නා වූ, සැපය හා බලය දෙන්නා වූ ඒ තැනැත්තා, යම් යම් තැනක උපදියිද, එහි දී දීර්ඝායුෂ ඇත්තෙක් ද යසස් ඇත්තෙක් ද වෙයි.",
      "paliTitle": "Bhojanasuttaṃ",
      "englishTitle": "Discourse on Food",
      "sinhalaTitle": "භෝජන සූත්‍රය"
    },
    {
      "number": 60,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Catūhi kho, gahapati, dhammehi samannāgato ariyasāvako gihisāmīcipaṭipadaṃ paṭipanno hoti yasopaṭilābhiniṃ saggasaṃvattanikaṃ. Katamehi catūhi? Idha, gahapati, ariyasāvako bhikkhusaṅghaṃ paccupaṭṭhito hoti cīvarena, bhikkhusaṅghaṃ paccupaṭṭhito hoti piṇḍapātena, bhikkhusaṅghaṃ paccupaṭṭhito hoti senāsanena, bhikkhusaṅghaṃ paccupaṭṭhito hoti gilānappaccayabhesajjaparikkhārena. Imehi kho, gahapati, catūhi dhammehi samannāgato ariyasāvako gihisāmīcipaṭipadaṃ paṭipanno hoti yasopaṭilābhiniṃ saggasaṃvattanika’’nti. ‘‘Gihisāmīcipaṭipadaṃ, paṭipajjanti paṇḍitā; Sammaggate sīlavante, cīvarena upaṭṭhitā. Piṇḍapātasayanena, gilānappaccayena ca; Tesaṃ divā ca ratto ca, sadā puññaṃ pavaḍḍhati; Saggañca kamatiṭṭhānaṃ [saggañca sappatiṭṭhānaṃ (ka.)], kammaṃ katvāna bhaddaka’’nti. dasamaṃ; ",
      "english": "Then, the householder Anāthapiṇḍika approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, the Blessed One said this to the householder Anāthapiṇḍika:\n\n“Householder, a noble disciple endowed with four qualities practices the proper conduct for a lay person, which leads to the acquisition of renown and to rebirth in a heavenly realm. Which four? Here, householder, a noble disciple serves the Saṅgha of bhikkhus with robes, serves the Saṅgha of bhikkhus with almsfood, serves the Saṅgha of bhikkhus with lodging, and serves the Saṅgha of bhikkhus with requisites for the sick, such as medicine. Householder, a noble disciple endowed with these four qualities practices the proper conduct for a lay person, which leads to the acquisition of renown and to rebirth in a heavenly realm.”\n\nThe wise practice the proper conduct for a lay person, providing robes to those who are righteous and virtuous. With almsfood, lodging, and requisites for the sick, their merit always increases day and night. Having performed such wholesome deeds, they reach a heavenly destination.",
      "sinhala": "එවිට අනේපිඬු සිටුතුමා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩිවිය.\n\nඑක් පසෙකින් වාඩි වී සිටි අනේපිඬු සිටුතුමාට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “ගෘහපති, ආර්ය ශ්‍රාවකයෙක් යශස ලබාදෙන, ස්වර්ගය කරා ගෙන යන, ගිහි සාමීචි ප්‍රතිපදාවට එළඹෙන්නේ කරුණු හතරකින් යුක්තවයි. ඒ කවර කරුණු හතරකින්ද? ගෘහපති, මෙහිලා ආර්ය ශ්‍රාවක තෙමේ භික්ෂුසංඝයාට සිවුරෙන් උපස්ථාන කරයි. භික්ෂුසංඝයාට පිණ්ඩපාතයෙන් උපස්ථාන කරයි. භික්ෂුසංඝයාට සේනාසනයෙන් උපස්ථාන කරයි. භික්ෂුසංඝයාට ගිලන්පසින්, බෙහෙතින් සහ පිරිකරෙන් උපස්ථාන කරයි. ගෘහපති, මේ කරුණු හතරින් යුක්ත වූ ආර්ය ශ්‍රාවක තෙමේ යශස ලබාදෙන, ස්වර්ගය කරා ගෙන යන, ගිහි සාමීචි ප්‍රතිපදාවට එළඹෙන්නේය.”\n\n“පණ්ඩිතයෝ ගිහි සාමීචි ප්‍රතිපදාවෙහි හැසිරෙති. ඍජු ගමනින් යුක්ත වූ, ශීලවන්ත භික්ෂූන්ට සිවුරු, පිණ්ඩපාතය, සේනාසන සහ ගිලන්පස පිරිනමා උපස්ථාන කරති. දිවා රෑ දෙකෙහිම ඔවුන්ගේ පින නිරන්තරයෙන් වර්ධනය වෙයි. යහපත් වූ කර්ම කොට ඔවුහු ස්වර්ගයට පැමිණෙති.”",
      "paliTitle": "Gihisāmīcisuttaṃ",
      "englishTitle": "Discourse on Lay Proper Conduct",
      "sinhalaTitle": "ගිහි සාමීචි සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Puññābhisandavaggo paṭhamo. Tassuddānaṃ – Dve puññābhisandā dve ca, saṃvāsā samajīvino; Suppavāsā sudatto ca, bhojanaṃ gihisāmicīti.",
    "english": "First Chapter: Streams of Merit",
    "sinhala": "පළමුවන පුණ්‍ය‍ාභිසන්ද වග්‍ගය"
  }
}