{
  "id": "an4.27",
  "title": {
    "pali": "Kammapathavaggo",
    "english": "The Chapter on Courses of Action",
    "sinhala": "කර්මපථ වග්ගය"
  },
  "sections": [
    {
      "number": 264,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti, pāṇātipāte ca samanuñño hoti, pāṇātipātassa ca vaṇṇaṃ bhāsati – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi catūhi? Attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti, pāṇātipātā veramaṇiyā ca samanuñño hoti, pāṇātipātā veramaṇiyā ca vaṇṇaṃ bhāsati – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ.",
      "english": "Monks, one endowed with four qualities is thus consigned to hell, as if carried and deposited there. Which four? He himself takes life, he encourages others to take life, he approves of taking life, and he speaks in praise of taking life. Indeed, monks, one endowed with these four qualities is thus consigned to hell, as if carried and deposited there.\n\nMonks, one endowed with four qualities is thus consigned to heaven, as if carried and deposited there. Which four? He himself abstains from taking life, he encourages others to abstain from taking life, he approves of abstaining from taking life, and he speaks in praise of abstaining from taking life. Indeed, monks, one endowed with these four qualities is thus consigned to heaven, as if carried and deposited there.",
      "sinhala": "මහණෙනි, කරුණු සතරකින් යුක්ත වූ තැනැත්තා, ගෙනැවිත් තැබුවාක් මෙන්, නිරයටම වැටෙයි. ඒ කවර සතරකින් ද? තමා ද සතුන් මැරීමෙහි යෙදෙයි. අනුන් ද සතුන් මැරීමට පොළඹවයි. සතුන් මැරීමට අනුමත වෙයි. සතුන් මැරීමෙහි ගුණ වර්ණනා කරයි. මහණෙනි, මේ කරුණු සතරින් යුක්ත වූ තැනැත්තා ගෙනැවිත් තැබුවාක් මෙන් නිරයටම වැටෙයි.\n\nමහණෙනි, කරුණු සතරකින් යුක්ත වූ තැනැත්තා, ගෙනැවිත් තැබුවාක් මෙන්, ස්‍වර්ගයටම පිහිටයි. ඒ කවර සතරකින් ද? තමා ද සතුන් මැරීමෙන් වැළකී සිටියි. අනුන් ද සතුන් මැරීමෙන් වැළකීමට පොළඹවයි. සතුන් මැරීමෙන් වැළකීම අනුමත වෙයි. සතුන් මැරීමෙන් වැළකීමෙහි ගුණ වර්ණනා කරයි. මහණෙනි, මේ කරුණු සතරින් යුක්ත වූ තැනැත්තා ගෙනැවිත් තැබුවාක් මෙන් ස්‍වර්ගයටම පිහිටයි. පළමු සූත්‍රයයි.",
      "paliTitle": "Pāṇātipātīsuttaṃ"
    },
    {
      "number": 265,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi catūhi? Attanā ca adinnādāyī hoti, parañca adinnādāne samādapeti, adinnādāne ca samanuñño hoti, adinnādānassa ca vaṇṇaṃ bhāsati – imehi kho…pe…. ‘‘Attanā ca adinnādānā paṭivirato hoti, parañca adinnādānā veramaṇiyā samādapeti, adinnādānā veramaṇiyā ca samanuñño hoti, adinnādānā veramaṇiyā ca vaṇṇaṃ bhāsati – imehi kho, bhikkhave… pe…. Dutiyaṃ.",
      "english": "Monks, endowed with four qualities, one is deposited into hell just as they were brought there. Which four? One takes what is not given oneself, encourages others to take what is not given, approves of taking what is not given, and speaks in praise of taking what is not given. Monks, it is with these four qualities that one is deposited into hell just as they were brought there.\n\nOne abstains from taking what is not given oneself, encourages others in abstaining from taking what is not given, approves of abstaining from taking what is not given, and speaks in praise of abstaining from taking what is not given. Monks, it is with these four qualities that one is deposited into a good destination, into a heavenly world, just as they were brought there.",
      "sinhala": "භික්ෂූණි, ධර්ම සතරකින් යුක්ත වූ තැනැත්තා, යම් ලෙසින් පවත්වන ලද්දේද, එලෙසින්ම නිරයේ පිහිටුවනු ලැබේ. එම සතර කවරේද යත්: තමාද නොදුන් දෙය ගැනීමෙහි යෙදෙයි, අනුන්ද නොදුන් දෙය ගැනීමෙහි පොළඹවයි, නොදුන් දෙය ගැනීම අනුමත කරයි, නොදුන් දෙය ගැනීමෙහි වර්ණනාවද කියයි. භික්ෂූණි, මේ ධර්ම සතරින් යුක්ත වූ තැනැත්තා, යම් ලෙසින් පවත්වන ලද්දේද, එලෙසින්ම නිරයේ පිහිටුවනු ලැබේ.\n\nතමාද නොදුන් දෙය ගැනීමෙන් වැළකී සිටියි, අනුන්ද නොදුන් දෙය ගැනීමෙන් වැළකීමට පොළඹවයි, නොදුන් දෙය ගැනීමෙන් වැළකීම අනුමත කරයි, නොදුන් දෙය ගැනීමෙන් වැළකීමෙහි වර්ණනාවද කියයි. භික්ෂූණි, මේ ධර්ම සතරින් යුක්ත වූ තැනැත්තා, යම් ලෙසින් පවත්වන ලද්දේද, එලෙසින්ම ස්වර්ගයෙහි පිහිටුවනු ලැබේ.",
      "paliTitle": "Adinnādāyīsuttaṃ"
    },
    {
      "number": 266,
      "pali": "… Attanā ca kāmesumicchācārī hoti, parañca kāmesumicchācāre samādapeti, kāmesumicchācāre ca samanuñño hoti, kāmesumicchācārassa ca vaṇṇaṃ bhāsati – imehi kho…pe…. Attanā ca kāmesumicchācārā paṭivirato hoti, parañca kāmesumicchācārā veramaṇiyā samādapeti, kāmesumicchācārā veramaṇiyā ca samanuñño hoti, kāmesumicchācārā veramaṇiyā ca vaṇṇaṃ bhāsati – imehi kho…pe…. Tatiyaṃ.",
      "english": "One oneself engages in sexual misconduct, and encourages others to engage in sexual misconduct, and approves of sexual misconduct, and speaks in praise of sexual misconduct.\n\nOne oneself abstains from sexual misconduct, and encourages others to abstain from sexual misconduct, and approves of abstinence from sexual misconduct, and speaks in praise of abstinence from sexual misconduct.\n\nThe third.",
      "sinhala": "තමන් විසින්ම ද කාමයන්හි වරදවා හැසිරෙයි. අනුන් ද කාමයන්හි වරදවා හැසිරීමට පොලඹවයි. කාමයන්හි වරදවා හැසිරීමට කැමැත්තෙන් ද යුක්ත වෙයි. කාමයන්හි වරදවා හැසිරීම ප්‍රශංසා කරයි. මේ කරුණු නිසා (සත්ත්වයා) කය බිඳීමෙන්, මරණින් පසු අපායෙහි, දුගතියෙහි, විනිපාතයෙහි, නිරයෙහි උපදියි.\n\nතමන් විසින්ම ද කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි. අනුන් ද කාමයන්හි වරදවා හැසිරීමෙන් වැළකීමට පොලඹවයි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකීමට කැමැත්තෙන් ද යුක්ත වෙයි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම ප්‍රශංසා කරයි. මේ කරුණු නිසා (සත්ත්වයා) කය බිඳීමෙන්, මරණින් පසු සුගතියෙහි, සග්ග ලෝකයෙහි උපදියි.\n\nතෙවැනි කොටසයි.",
      "paliTitle": "Micchācārīsuttaṃ"
    },
    {
      "number": 267,
      "pali": "… Attanā ca musāvādī hoti, parañca musāvāde samādapeti, musāvāde ca samanuñño hoti, musāvādassa ca vaṇṇaṃ bhāsati – imehi kho…pe…. Attanā ca musāvādā paṭivirato hoti, parañca musāvādā veramaṇiyā samādapeti, musāvādā veramaṇiyā ca samanuñño hoti, musāvādā veramaṇiyā ca vaṇṇaṃ bhāsati – imehi…pe…. Catutthaṃ.",
      "english": "He himself is a speaker of falsehood; he encourages others to speak falsehood; he approves of speaking falsehood; and he speaks in praise of speaking falsehood.\n\nHe himself abstains from speaking falsehood; he encourages others to abstain from speaking falsehood; he approves of abstaining from speaking falsehood; and he speaks in praise of abstaining from speaking falsehood.\n\nThe fourth.",
      "sinhala": "තමාම බොරු කියන තැනැත්තෙක් වේ; අනුන්ව ද බොරු කීමට පොළඹවයි; බොරු කීම අනුමත කරයි; බොරු කීම වර්ණනා කරයි.\n\nතමාම බොරු කීමෙන් වැළකී සිටියි; අනුන්ව ද බොරු කීමෙන් වැළකීමට පොළඹවයි; බොරු කීමෙන් වැළකීම අනුමත කරයි; බොරු කීමෙන් වැළකීම වර්ණනා කරයි. මෙය සිව්වැන්නයි.",
      "paliTitle": "Musāvādīsuttaṃ"
    },
    {
      "number": 268,
      "pali": "… Attanā ca pisuṇavāco hoti, parañca pisuṇāya vācāya samādapeti, pisuṇāya vācāya ca samanuñño hoti, pisuṇāya vācāya ca vaṇṇaṃ bhāsati – imehi…pe…. Attanā ca pisuṇāya vācāya paṭivirato hoti, parañca pisuṇāya vācāya veramaṇiyā samādapeti, pisuṇāya vācāya veramaṇiyā ca samanuñño hoti, pisuṇāya vācāya veramaṇiyā ca vaṇṇaṃ bhāsati – imehi…pe…. Pañcamaṃ.",
      "english": "He himself speaks divisively, and he encourages others to divisive speech, and he approves of divisive speech, and he speaks in praise of divisive speech. One endowed with these qualities is deposited in hell just as if brought there.\n\nHe himself abstains from divisive speech, and he encourages others to abstain from divisive speech, and he approves of abstinence from divisive speech, and he speaks in praise of abstinence from divisive speech. One endowed with these qualities is deposited in heaven just as if brought there. This is the fifth.",
      "sinhala": "තමා ද කේලාම් කියන්නේ වෙයි, අනුන් ද කේලාම් කීමට පොළඹවයි, කේලාම් කීමට ද කැමති වෙයි, කේලාම් කීමේ ගුණය ද වර්ණනා කරයි – මේ කරුණු වලින්...\n\nතමා ද කේලාම් කීමෙන් වැළකුණේ වෙයි, අනුන් ද කේලාම් කීමෙන් වැළකීමට පොළඹවයි, කේලාම් කීමෙන් වැළකීමට ද කැමති වෙයි, කේලාම් කීමෙන් වැළකීමේ ගුණය ද වර්ණනා කරයි – මේ කරුණු වලින්...\n\nපස්වෙනි.",
      "paliTitle": "Pisuṇavācāsuttaṃ"
    },
    {
      "number": 269,
      "pali": "… Attanā ca pharusavāco hoti, parañca pharusāya vācāya samādapeti, pharusāya vācāya ca samanuñño hoti, pharusāya vācāya ca vaṇṇaṃ bhāsati…pe…. Attanā ca pharusāya vācāya paṭivirato hoti, parañca pharusāya vācāya veramaṇiyā samādapeti, pharusāya vācāya veramaṇiyā ca samanuñño hoti, pharusāya vācāya veramaṇiyā ca vaṇṇaṃ bhāsati – imehi kho…pe…. Chaṭṭhaṃ.",
      "english": "He himself is harsh in speech; he encourages others to harsh speech; he approves of harsh speech; and he speaks in praise of harsh speech...\n\nHe himself abstains from harsh speech; he encourages others to abstain from harsh speech; he approves of abstaining from harsh speech; and he speaks in praise of abstaining from harsh speech – by these, indeed... The sixth.",
      "sinhala": "තමා ද රළු වචන කථා කරන්නෙක් වේ, අනුන් ද රළු වචන කථා කිරීමට පොළඹවයි, රළු වචන කථා කිරීමට සතුටු වේ, රළු වචන කථා කිරීම වර්ණනා කරයි.\n\nතමා ද රළු වචන කථා කිරීමෙන් වැළකී සිටී, අනුන් ද රළු වචන කථා කිරීමෙන් වැළකීමට පොළඹවයි, රළු වචන කථා කිරීමෙන් වැළකීමට සතුටු වේ, රළු වචන කථා කිරීමෙන් වැළකීම වර්ණනා කරයි.\n\nමේවායින් හයවැන්නයි.",
      "paliTitle": "Pharusavācāsuttaṃ"
    },
    {
      "number": 270,
      "pali": "… Attanā ca samphappalāpī hoti, parañca samphappalāpe samādapeti, samphappalāpe ca samanuñño hoti, samphappalāpassa ca vaṇṇaṃ bhāsati – imehi…pe…. Attanā ca samphappalāpā paṭivirato hoti, parañca samphappalāpā veramaṇiyā samādapeti, samphappalāpā veramaṇiyā ca samanuñño hoti, samphappalāpā veramaṇiyā ca vaṇṇaṃ bhāsati – imehi kho, bhikkhave…pe…. Sattamaṃ.",
      "english": "... He himself engages in frivolous speech; he encourages others in frivolous speech; he approves of frivolous speech; and he speaks in praise of frivolous speech. By these, and so forth. He himself abstains from frivolous speech; he encourages others to abstain from frivolous speech; he approves of the abstention from frivolous speech; and he speaks in praise of the abstention from frivolous speech. By these, monks, and so forth. The seventh.",
      "sinhala": "තමා ද සම්ඵප්පලාපයේ නිරත වේ. අනුන් ද සම්ඵප්පලාපයට සමාදන් කරවයි. සම්ඵප්පලාපයට අනුමෝදන් වේ. සම්ඵප්පලාපය වර්ණනා ද කරයි. මේ කරුණු වලින් යුක්ත වූ තැනැත්තා මෙබඳු වේ.\n\nතමා ද සම්ඵප්පලාපයෙන් ප්‍ර‍තිවිරත වේ. අනුන් ද සම්ඵප්පලාපයෙන් විරතියට සමාදන් කරවයි. සම්ඵප්පලාපයෙන් විරතියට අනුමෝදන් වේ. සම්ඵප්පලාපයෙන් විරතිය වර්ණනා ද කරයි. භික්ෂූන් වහන්ස, මේ කරුණු වලින් යුක්ත වූ තැනැත්තා මෙබඳු වේ. සත්වැන්නයි.",
      "paliTitle": "Samphappalāpasuttaṃ"
    },
    {
      "number": 271,
      "pali": "… Attanā ca abhijjhālu hoti, parañca abhijjhāya samādapeti, abhijjhāya ca samanuñño hoti, abhijjhāya ca vaṇṇaṃ bhāsati…pe…. ‘‘Attanā ca anabhijjhālu hoti, parañca anabhijjhāya samādapeti, anabhijjhāya ca samanuñño hoti, anabhijjhāya ca vaṇṇaṃ bhāsati – imehi kho…pe…. Aṭṭhamaṃ.",
      "english": "He is himself covetous, and he encourages others in covetousness, approves of covetousness, and speaks in praise of covetousness.\n\nHe is himself non-covetous, and he encourages others in non-covetousness, approves of non-covetousness, and speaks in praise of non-covetousness. By these, indeed. The eighth.",
      "sinhala": "...තමා ද අභිජ්ඣාවෙන් යුක්ත වේ. අනුන් ද අභිජ්ඣාවට පොළඹවයි. අභිජ්ඣාව ද අනුමෝදන් වේ. අභිජ්ඣාව ද වර්ණනා කරයි. ...\n\nතමා ද අනභිජ්ඣාවෙන් යුක්ත වේ. අනුන් ද අනභිජ්ඣාවට පොළඹවයි. අනභිජ්ඣාව ද අනුමෝදන් වේ. අනභිජ්ඣාව ද වර්ණනා කරයි. මේවායින් ම, ... අටවෙනි කරුණයි.",
      "paliTitle": "Abhijjhālusuttaṃ"
    },
    {
      "number": 272,
      "pali": "… Attanā ca byāpannacitto hoti, parañca byāpāde samādapeti, byāpāde ca samanuñño hoti, byāpādassa ca vaṇṇaṃ bhāsati – imehi…pe…. Attanā ca abyāpannacitto hoti, parañca abyāpāde samādapeti, abyāpāde ca samanuñño hoti, abyāpādassa ca vaṇṇaṃ bhāsati – imehi kho…pe…. Navamaṃ.",
      "english": "...He himself has a mind imbued with ill-will, and he encourages another to ill-will, and he approves of ill-will, and he speaks in praise of ill-will — by these, he performs unwholesome actions.\n\nHe himself has a mind free from ill-will, and he encourages another to be free from ill-will, and he approves of freedom from ill-will, and he speaks in praise of freedom from ill-will — by these, indeed, he performs wholesome actions. The ninth.",
      "sinhala": "තමා ව්‍යාපාද සිතින් යුක්ත වෙයි. අනුන් ද ව්‍යාපාදයට සමාදන් කරවයි. ව්‍යාපාදය ද අනුමත කරයි. ව්‍යාපාදය ද වර්ණනා කරයි. මේවා එලෙසින්ම වේ.\n\nතමා අව්‍යාපාද සිතින් යුක්ත වෙයි. අනුන් ද අව්‍යාපාදයට සමාදන් කරවයි. අව්‍යාපාදය ද අනුමත කරයි. අව්‍යාපාදය ද වර්ණනා කරයි. සැබවින්ම, මේවා නවවැනි කරුණු වේ.",
      "paliTitle": "Byāpannacittasuttaṃ"
    },
    {
      "number": 273,
      "pali": "… Attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti, micchādiṭṭhiyā ca samanuñño hoti, micchādiṭṭhiyā ca vaṇṇaṃ bhāsati – imehi…pe…. Attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti, sammādiṭṭhiyā ca samanuñño hoti, sammādiṭṭhiyā ca vaṇṇaṃ bhāsati – imehi kho, bhikkhave, catūhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ saggeti. Dasamaṃ. ",
      "english": "He himself holds wrong view, and he encourages others in wrong view, and he approves of wrong view, and he speaks in praise of wrong view. By these four qualities, being endowed, he is deposited in hell, just as he was brought.\n\nHe himself holds right view, and he encourages others in right view, and he approves of right view, and he speaks in praise of right view. By these four qualities, monks, being endowed, he is deposited in heaven, just as he was brought. This is the tenth.",
      "sinhala": "තමන් විසින්ම මිථ්‍යාදෘෂ්ටික වෙයි, අනුන් ද මිථ්‍යාදෘෂ්ටියෙහි පිහිටුවයි, මිථ්‍යාදෘෂ්ටිය අනුමත කරයි, මිථ්‍යාදෘෂ්ටිය වර්ණනා කරයි.\n\nතමන් විසින්ම සම්මාදෘෂ්ටික වෙයි, අනුන් ද සම්මාදෘෂ්ටියෙහි පිහිටුවයි, සම්මාදෘෂ්ටිය අනුමත කරයි, සම්මාදෘෂ්ටිය වර්ණනා කරයි. මහණෙනි, මේ ධ​ර්‍ම සතරින් යුක්ත වූ පුද්ගලයා, ගෙනැවිත් තැබුවාක් මෙන් ස්ව​ර්‍ගයෙහි උපදී.",
      "paliTitle": "Micchādiṭṭhisuttaṃ"
    }
  ],
  "footer": {
    "pali": "Kammapathavaggo sattamo.",
    "english": "",
    "sinhala": ""
  }
}