{
  "id": "an4.21",
  "title": {
    "pali": "Sappurisavaggo",
    "english": "The Chapter on True Persons",
    "sinhala": "සත්පුරුෂ වග්ගය"
  },
  "sections": [
    {
      "number": 201,
      "pali": "‘‘Asappurisañca vo, bhikkhave, desessāmi, asappurisena asappurisatarañca; sappurisañca, sappurisena sappurisatarañca. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamo ca, bhikkhave, asappuriso? Idha, bhikkhave, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, surāmerayamajjapamādaṭṭhāyī hoti. Ayaṃ vuccati, bhikkhave, asappuriso. ‘‘Katamo ca, bhikkhave, asappurisena asappurisataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti; attanā ca adinnādāyī hoti, parañca adinnādāne samādapeti; attanā ca kāmesumicchācārī hoti, parañca kāmesumicchācāre samādapeti; attanā ca musāvādī hoti, parañca musāvāde samādapeti; attanā ca surāmerayamajjapamādaṭṭhāyī hoti, parañca surāmerayamajjapamādaṭṭhāne samādapeti. Ayaṃ vuccati, bhikkhave, asappurisena asappurisataro. ‘‘Katamo ca, bhikkhave, sappuriso? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṃ vuccati, bhikkhave, sappuriso. ‘‘Katamo ca, bhikkhave, sappurisena sappurisataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti; attanā ca adinnādānā paṭivirato hoti, parañca adinnādānā veramaṇiyā samādapeti; attanā ca kāmesumicchācārā paṭivirato hoti, parañca kāmesumicchācārā veramaṇiyā samādapeti; attanā ca musāvādā paṭivirato hoti, parañca musāvādā veramaṇiyā samādapeti; attanā ca surāmerayamajjapamādaṭṭhānā paṭivirato hoti, parañca surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Ayaṃ vuccati, bhikkhave, sappurisena sappurisataro’’ti [pu. pa. 135]. Paṭhamaṃ.",
      "english": "Monks, I will teach you about the ignoble person, and one more ignoble than the ignoble person; and the noble person, and one more noble than the noble person. Listen to that, attend carefully; I will speak. “Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One spoke this:\n\nAnd what, monks, is the ignoble person? Here, monks, some individual is a slayer of living beings, a taker of what is not given, one who engages in sexual misconduct, a speaker of falsehoods, and one who partakes of fermented and distilled intoxicants which are the basis for heedlessness. This, monks, is called the ignoble person.\n\nAnd what, monks, is one more ignoble than the ignoble person? Here, monks, some individual himself slays living beings, and also encourages others to slay living beings; he himself takes what is not given, and also encourages others to take what is not given; he himself engages in sexual misconduct, and also encourages others in sexual misconduct; he himself speaks falsehoods, and also encourages others to speak falsehoods; he himself partakes of fermented and distilled intoxicants which are the basis for heedlessness, and also encourages others to partake of fermented and distilled intoxicants which are the basis for heedlessness. This, monks, is called one more ignoble than the ignoble person.\n\nAnd what, monks, is the noble person? Here, monks, some individual abstains from slaying living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from speaking falsehoods, and abstains from fermented and distilled intoxicants which are the basis for heedlessness. This, monks, is called the noble person.\n\nAnd what, monks, is one more noble than the noble person? Here, monks, some individual himself abstains from slaying living beings, and also encourages others to abstain from slaying living beings; he himself abstains from taking what is not given, and also encourages others to abstain from taking what is not given; he himself abstains from sexual misconduct, and also encourages others to abstain from sexual misconduct; he himself abstains from speaking falsehoods, and also encourages others to abstain from speaking falsehoods; he himself abstains from fermented and distilled intoxicants which are the basis for heedlessness, and also encourages others to abstain from fermented and distilled intoxicants which are the basis for heedlessness. This, monks, is called one more noble than the noble person.",
      "sinhala": "මහණෙනි, මම ඔබට අසත්පුරුෂයා ද, අසත්පුරුෂයාට වඩා අසත්පුරුෂයා ද, සත්පුරුෂයා ද, සත්පුරුෂයාට වඩා සත්පුරුෂයා ද දේශනා කරන්නෙමි. එය අසන්න, මැනවින් සිතට ගන්න; මම දේශනා කරන්නෙමි.”\n\n“එසේය, භාග්‍යවතුන් වහන්ස”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, අසත්පුරුෂයා කවරෙක් ද?\n\nමහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙහි යෙදෙයි, අදත්තාදානයෙහි යෙදෙයි, කාමමිථ්‍යාචාරයෙහි යෙදෙයි, මුසාවාදයෙහි යෙදෙයි, සුරාමේරය මත්පැන් පානයෙන් ප්‍රමාදයට පත්වෙයි. මහණෙනි, මේ පුද්ගලයා අසත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, අසත්පුරුෂයාට වඩා අසත්පුරුෂයා කවරෙක් ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තමා ද ප්‍රාණඝාතයෙහි යෙදෙයි, අනුන් ද ප්‍රාණඝාතයෙහි සමාදන් කරවයි; තමා ද අදත්තාදානයෙහි යෙදෙයි, අනුන් ද අදත්තාදානයෙහි සමාදන් කරවයි; තමා ද කාමමිථ්‍යාචාරයෙහි යෙදෙයි, අනුන් ද කාමමිථ්‍යාචාරයෙහි සමාදන් කරවයි; තමා ද මුසාවාදයෙහි යෙදෙයි, අනුන් ද මුසාවාදයෙහි සමාදන් කරවයි; තමා ද සුරාමේරය මත්පැන් පානයෙන් ප්‍රමාදයට පත්වෙයි, අනුන් ද සුරාමේරය මත්පැන් පානයෙන් ප්‍රමාදයට පත්වීමට සමාදන් කරවයි. මහණෙනි, මේ පුද්ගලයා අසත්පුරුෂයාට වඩා අසත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයා කවරෙක් ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙන් වැළකී සිටියි, අදත්තාදානයෙන් වැළකී සිටියි, කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි, මුසාවාදයෙන් වැළකී සිටියි, සුරාමේරය මත්පැන් පානයෙන් ප්‍රමාදයට පත්වීමෙන් වැළකී සිටියි. මහණෙනි, මේ පුද්ගලයා සත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයාට වඩා සත්පුරුෂයා කවරෙක් ද? මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් තමා ද ප්‍රාණඝාතයෙන් වැළකී සිටියි, අනුන් ද ප්‍රාණඝාතයෙන් වැළකීමට සමාදන් කරවයි; තමා ද අදත්තාදානයෙන් වැළකී සිටියි, අනුන් ද අදත්තාදානයෙන් වැළකීමට සමාදන් කරවයි; තමා ද කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි, අනුන් ද කාමමිථ්‍යාචාරයෙන් වැළකීමට සමාදන් කරවයි; තමා ද මුසාවාදයෙන් වැළකී සිටියි, අනුන් ද මුසාවාදයෙන් වැළකීමට සමාදන් කරවයි; තමා ද සුරාමේරය මත්පැන් පානයෙන් ප්‍රමාදයට පත්වීමෙන් වැළකී සිටියි, අනුන් ද සුරාමේරය මත්පැන් පානයෙන් ප්‍රමාදයට පත්වීමෙන් වැළකීමට සමාදන් කරවයි. මහණෙනි, මේ පුද්ගලයා සත්පුරුෂයාට වඩා සත්පුරුෂයෙකැයි කියනු ලැබේ.”",
      "paliTitle": "Sikkhāpadasuttaṃ",
      "englishTitle": "Discourse on Precepts",
      "sinhalaTitle": "ශික්ෂාපද සූත්‍රය"
    },
    {
      "number": 202,
      "pali": "‘‘Asappurisañca vo, bhikkhave, desessāmi, asappurisena asappurisatarañca; sappurisañca, sappurisena sappurisatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, asappuriso? Idha, bhikkhave, ekacco assaddho hoti, ahiriko hoti, anottappī hoti, appassuto hoti, kusīto hoti, muṭṭhassati hoti, duppañño hoti. Ayaṃ vuccati, bhikkhave, asappuriso. ‘‘Katamo ca, bhikkhave, asappurisena asappurisataro? Idha, bhikkhave, ekacco attanā ca assaddho hoti, parañca assaddhiye [asaddhāya (ka.)] samādapeti; attanā ca ahiriko hoti, parañca ahirikatāya samādapeti; attanā ca anottappī hoti, parañca anottappe samādapeti; attanā ca appassuto hoti, parañca appassute samādapeti; attanā ca kusīto hoti, parañca kosajje samādapeti; attanā ca muṭṭhassati hoti, parañca muṭṭhassacce [muṭṭhasacce (sī. syā. kaṃ. pī.)] samādapeti; attanā ca duppañño hoti, parañca duppaññatāya samādapeti. Ayaṃ vuccati, bhikkhave, asappurisena asappurisataro. ‘‘Katamo ca, bhikkhave, sappuriso? Idha, bhikkhave, ekacco saddho hoti, hirimā hoti, ottappī hoti, bahussuto hoti, āraddhavīriyo hoti, satimā hoti, paññavā hoti. Ayaṃ vuccati, bhikkhave, sappuriso. ‘‘Katamo ca, bhikkhave, sappurisena sappurisataro? Idha, bhikkhave, ekacco attanā ca saddhāsampanno hoti, parañca saddhāsampadāya samādapeti; attanā ca hirimā hoti, parañca hirimatāya [hirisampadāya (ka.)] samādapeti; attanā ca ottappī hoti, parañca ottappe samādapeti; attanā ca bahussuto hoti, parañca bāhusacce samādapeti; attanā ca āraddhavīriyo hoti, parañca vīriyārambhe samādapeti; attanā ca upaṭṭhitassati hoti, parañca satiupaṭṭhāne [satipaṭṭhāne (sī. syā. kaṃ. pī.)] samādapeti; attanā ca paññāsampanno hoti, parañca paññāsampadāya samādapeti. Ayaṃ vuccati, bhikkhave, sappurisena sappurisataro’’ti. Dutiyaṃ.",
      "english": "“Monks, I will teach you about the unvirtuous person and one even more unvirtuous; and about the virtuous person and one even more virtuous. Listen to that.\n\n“And what, monks, is an unvirtuous person? Here, monks, some individual is without faith, shameless, without moral dread, of little learning, lazy, unmindful, and unwise. This, monks, is called an unvirtuous person.\n\n“And what, monks, is one even more unvirtuous than the unvirtuous person? Here, monks, some individual is himself without faith, and he encourages others to be without faith; he is himself shameless, and he encourages others to be shameless; he is himself without moral dread, and he encourages others to be without moral dread; he is himself of little learning, and he encourages others to be of little learning; he is himself lazy, and he encourages others in laziness; he is himself unmindful, and he encourages others in unmindfulness; he is himself unwise, and he encourages others in unwisdom. This, monks, is called one even more unvirtuous than the unvirtuous person.\n\n“And what, monks, is a virtuous person? Here, monks, some individual is endowed with faith, conscientious, possesses moral dread, is of much learning, energetic, mindful, and wise. This, monks, is called a virtuous person.\n\n“And what, monks, is one even more virtuous than the virtuous person? Here, monks, some individual is himself endowed with faith, and he encourages others to be endowed with faith; he is himself conscientious, and he encourages others to be conscientious; he is himself endowed with moral dread, and he encourages others to be endowed with moral dread; he is himself of much learning, and he encourages others in much learning; he is himself energetic, and he encourages others in the arousal of energy; he is himself mindful, and he encourages others in the establishment of mindfulness; he is himself wise, and he encourages others to be endowed with wisdom. This, monks, is called one even more virtuous than the virtuous person.”",
      "sinhala": "මහණෙනි, මම ඔබට අසත්පුරුෂයාද, අසත්පුරුෂයාට වඩා අසත්පුරුෂයාද, සත්පුරුෂයාද, සත්පුරුෂයාට වඩා සත්පුරුෂයාද දේශනා කරන්නෙමි. එයට සවන් දෙන්න.\n\nමහණෙනි, අසත්පුරුෂයා කවරෙක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ශ්‍රද්ධාවෙන් තොර වෙයි, හිරිවිරියෙන් තොර වෙයි, පව්කම් කිරීමට බියක් නැත්තෙක් වෙයි, අල්පශ්‍රැත වෙයි, අලස වෙයි, සිහිමඳ වෙයි, දුෂ්ප්‍රාඥ වෙයි. මහණෙනි, මොහු අසත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, අසත්පුරුෂයාට වඩා අසත්පුරුෂයා කවරෙක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද ශ්‍රද්ධාවෙන් තොරව සිට, අනුන්ද ශ්‍රද්ධාවෙන් තොරවීමට පොලඹවයි; තමාද හිරිවිරියෙන් තොරව සිට, අනුන්ද හිරිවිරියෙන් තොරවීමට පොලඹවයි; තමාද පව්කම් කිරීමට බියක් නැතිව සිට, අනුන්ද පව්කම් කිරීමට බියක් නැතිවීමට පොලඹවයි; තමාද අල්පශ්‍රැතව සිට, අනුන්ද අල්පශ්‍රැතවීමට පොලඹවයි; තමාද අලසව සිට, අනුන්ද අලසවීමට පොලඹවයි; තමාද සිහිමඳව සිට, අනුන්ද සිහිමඳවීමට පොලඹවයි; තමාද දුෂ්ප්‍රාඥව සිට, අනුන්ද දුෂ්ප්‍රාඥවීමට පොලඹවයි. මහණෙනි, මොහු අසත්පුරුෂයාට වඩා අසත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයා කවරෙක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ශ්‍රද්ධාවෙන් යුක්ත වෙයි, හිරිවිරියෙන් යුක්ත වෙයි, පව්කම් කිරීමට බියක් ඇත්තෙක් වෙයි, බහුශ්‍රැත වෙයි, වීර්යය අරඹා සිටියෙක් වෙයි, සිහි නුවණින් යුක්ත වෙයි, ප්‍රාඥ වෙයි. මහණෙනි, මොහු සත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයාට වඩා සත්පුරුෂයා කවරෙක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද ශ්‍රද්ධාවෙන් යුක්තව සිට, අනුන්ද ශ්‍රද්ධාවෙන් යුක්තවීමට පොලඹවයි; තමාද හිරිවිරියෙන් යුක්තව සිට, අනුන්ද හිරිවිරියෙන් යුක්තවීමට පොලඹවයි; තමාද පව්කම් කිරීමට බියක් ඇතිව සිට, අනුන්ද පව්කම් කිරීමට බියක් ඇතිවීමට පොලඹවයි; තමාද බහුශ්‍රැතව සිට, අනුන්ද බහුශ්‍රැතභාවයට පොලඹවයි; තමාද වීර්යය අරඹා සිට, අනුන්ද වීර්යය ඇරඹීමට පොලඹවයි; තමාද සිහිය පිහිටුවාගෙන සිට, අනුන්ද සිහි පිහිටුවා ගැනීමට පොලඹවයි; තමාද ප්‍රඥාවෙන් යුක්තව සිට, අනුන්ද ප්‍රඥාවෙන් යුක්තවීමට පොලඹවයි. මහණෙනි, මොහු සත්පුරුෂයාට වඩා සත්පුරුෂයෙකැයි කියනු ලැබේ.",
      "paliTitle": "Assaddhasuttaṃ",
      "englishTitle": "The Faithless Discourse",
      "sinhalaTitle": "අශ්‍රද්ධ සූත්‍රය"
    },
    {
      "number": 203,
      "pali": "‘‘Asappurisañca vo, bhikkhave, desessāmi, asappurisena asappurisatarañca; sappurisañca, sappurisena sappurisatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, asappuriso? Idha, bhikkhave, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, asappuriso. ‘‘Katamo ca, bhikkhave, asappurisena asappurisataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti; attanā ca adinnādāyī hoti, parañca adinnādāne samādapeti; attanā ca kāmesumicchācārī hoti, parañca kāmesumicchācāre samādapeti; attanā ca musāvādī hoti, parañca musāvāde samādapeti; attanā ca pisuṇavāco hoti, parañca pisuṇāya vācāya samādapeti; attanā ca pharusavāco hoti, parañca pharusāya vācāya samādapeti; attanā ca samphappalāpī hoti, parañca samphappalāpe samādapeti. Ayaṃ vuccati, bhikkhave, asappurisena asappurisataro. ‘‘Katamo ca, bhikkhave, sappuriso? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato, hoti, samphappalāpā paṭivirato hoti. Ayaṃ vuccati, bhikkhave, sappuriso. ‘‘Katamo ca, bhikkhave, sappurisena sappurisataro? Idha bhikkhave, ekacco attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti; attanā ca adinnādānā paṭivirato hoti, parañca adinnādānā veramaṇiyā samādapeti; attanā ca kāmesumicchācārā paṭivirato hoti, parañca kāmesumicchācārā veramaṇiyā samādapeti; attanā ca musāvādā paṭivirato hoti, parañca musāvādā veramaṇiyā samādapeti; attanā ca pisuṇāya vācāya paṭivirato hoti, parañca pisuṇāya vācāya veramaṇiyā samādapeti; attanā ca pharusāya vācāya paṭivirato hoti, parañca pharusāya vācāya veramaṇiyā samādapeti; attanā ca samphappalāpā paṭivirato hoti, parañca samphappalāpā veramaṇiyā samādapeti. Ayaṃ vuccati, bhikkhave, sappurisena sappurisataro’’ti. Tatiyaṃ.",
      "english": "“Monks, I will teach you about the ignoble person, and one who is more ignoble than the ignoble; and about the noble person, and one who is more noble than the noble. Listen to that.\n\n“And who, monks, is the ignoble person? Here, monks, some individual is a killer of living beings, is a taker of what is not given, is a wrongdoer in sensual pleasures, is a speaker of falsehoods, is a speaker of divisive speech, is a speaker of harsh speech, is a speaker of idle chatter. This, monks, is called the ignoble person.\n\n“And who, monks, is one more ignoble than the ignoble? Here, monks, some individual is himself a killer of living beings and encourages others to kill living beings; is himself a taker of what is not given and encourages others to take what is not given; is himself a wrongdoer in sensual pleasures and encourages others to wrongdoing in sensual pleasures; is himself a speaker of falsehoods and encourages others to speak falsehoods; is himself a speaker of divisive speech and encourages others to divisive speech; is himself a speaker of harsh speech and encourages others to harsh speech; is himself a speaker of idle chatter and encourages others to idle chatter. This, monks, is called one more ignoble than the ignoble.\n\n“And who, monks, is the noble person? Here, monks, some individual abstains from killing living beings, abstains from taking what is not given, abstains from wrongdoing in sensual pleasures, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter. This, monks, is called the noble person.\n\n“And who, monks, is one more noble than the noble? Here, monks, some individual himself abstains from killing living beings and encourages others to abstain from killing living beings; himself abstains from taking what is not given and encourages others to abstain from taking what is not given; himself abstains from wrongdoing in sensual pleasures and encourages others to abstain from wrongdoing in sensual pleasures; himself abstains from false speech and encourages others to abstain from false speech; himself abstains from divisive speech and encourages others to abstain from divisive speech; himself abstains from harsh speech and encourages others to abstain from harsh speech; himself abstains from idle chatter and encourages others to abstain from idle chatter. This, monks, is called one more noble than the noble.”",
      "sinhala": "මහණෙනි, මම ඔබට අසත්පුරුෂයා දේශනා කරන්නෙමි. අසත්පුරුෂයන් අතරින් අසත්පුරුෂතර වූ තැනැත්තා ද (දේශනා කරන්නෙමි). සත්පුරුෂයා ද, සත්පුරුෂයන් අතරින් සත්පුරුෂතර වූ තැනැත්තා ද දේශනා කරන්නෙමි. එය අසව්.\n\nමහණෙනි, අසත්පුරුෂයා නම් කවරෙක් ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප‍්‍රාණඝාතයෙහි යෙදෙයි. අදත්තාදානයෙහි යෙදෙයි. කාමමිථ්‍යාචාරයෙහි යෙදෙයි. මෘෂාවාදයෙහි යෙදෙයි. පිසුණාවාචායෙහි යෙදෙයි. පරුෂාවාචායෙහි යෙදෙයි. සම්ප‍්‍රලාපයෙහි යෙදෙයි. මහණෙනි, මේ තැනැත්තා අසත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, අසත්පුරුෂයන් අතරින් අසත්පුරුෂතර වූ තැනැත්තා නම් කවරෙක් ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමා ද ප‍්‍රාණඝාතයෙහි යෙදෙයි. අනුන් ද ප‍්‍රාණඝාතයෙහි පිහිටුවයි. තමා ද අදත්තාදානයෙහි යෙදෙයි. අනුන් ද අදත්තාදානයෙහි පිහිටුවයි. තමා ද කාමමිථ්‍යාචාරයෙහි යෙදෙයි. අනුන් ද කාමමිථ්‍යාචාරයෙහි පිහිටුවයි. තමා ද මෘෂාවාදයෙහි යෙදෙයි. අනුන් ද මෘෂාවාදයෙහි පිහිටුවයි. තමා ද පිසුණාවාචායෙහි යෙදෙයි. අනුන් ද පිසුණාවාචායෙහි පිහිටුවයි. තමා ද පරුෂාවාචායෙහි යෙදෙයි. අනුන් ද පරුෂාවාචායෙහි පිහිටුවයි. තමා ද සම්ප‍්‍රලාපයෙහි යෙදෙයි. අනුන් ද සම්ප‍්‍රලාපයෙහි පිහිටුවයි. මහණෙනි, මේ තැනැත්තා අසත්පුරුෂයන් අතරින් අසත්පුරුෂතරයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයා නම් කවරෙක් ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප‍්‍රාණඝාතයෙන් වැළකී සිටියි. අදත්තාදානයෙන් වැළකී සිටියි. කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි. මෘෂාවාදයෙන් වැළකී සිටියි. පිසුණාවාචාවෙන් වැළකී සිටියි. පරුෂාවාචාවෙන් වැළකී සිටියි. සම්ප‍්‍රලාපයෙන් වැළකී සිටියි. මහණෙනි, මේ තැනැත්තා සත්පුරුෂයෙකැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයන් අතරින් සත්පුරුෂතර වූ තැනැත්තා නම් කවරෙක් ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමා ද ප‍්‍රාණඝාතයෙන් වැළකී සිටියි. අනුන් ද ප‍්‍රාණඝාතයෙන් වැළකීමෙහි පිහිටුවයි. තමා ද අදත්තාදානයෙන් වැළකී සිටියි. අනුන් ද අදත්තාදානයෙන් වැළකීමෙහි පිහිටුවයි. තමා ද කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි. අනුන් ද කාමමිථ්‍යාචාරයෙන් වැළකීමෙහි පිහිටුවයි. තමා ද මෘෂාවාදයෙන් වැළකී සිටියි. අනුන් ද මෘෂාවාදයෙන් වැළකීමෙහි පිහිටුවයි. තමා ද පිසුණාවාචාවෙන් වැළකී සිටියි. අනුන් ද පිසුණාවාචාවෙන් වැළකීමෙහි පිහිටුවයි. තමා ද පරුෂාවාචාවෙන් වැළකී සිටියි. අනුන් ද පරුෂාවාචාවෙන් වැළකීමෙහි පිහිටුවයි. තමා ද සම්ප‍්‍රලාපයෙන් වැළකී සිටියි. අනුන් ද සම්ප‍්‍රලාපයෙන් වැළකීමෙහි පිහිටුවයි. මහණෙනි, මේ තැනැත්තා සත්පුරුෂයන් අතරින් සත්පුරුෂතරයෙකැයි කියනු ලැබේ.",
      "paliTitle": "Sattakammasuttaṃ",
      "englishTitle": "The Seven Actions Sutta",
      "sinhalaTitle": "සප්ත කර්ම සූත්‍රය"
    },
    {
      "number": 204,
      "pali": "‘‘Asappurisañca vo, bhikkhave, desessāmi, asappurisena asappurisatarañca; sappurisañca, sappurisena sappurisatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, asappuriso? Idha, bhikkhave, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhiko hoti. Ayaṃ vuccati, bhikkhave, asappuriso. ‘‘Katamo ca, bhikkhave, asappurisena asappurisataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti…pe… attanā ca abhijjhālu hoti, parañca abhijjhāya samādapeti; attanā ca byāpannacitto hoti, parañca byāpāde samādapeti, attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti. Ayaṃ vuccati, bhikkhave, asappurisena asappurisataro. ‘‘Katamo ca, bhikkhave, sappuriso? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti…pe… anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhiko hoti. Ayaṃ vuccati, bhikkhave, sappuriso. ‘‘Katamo ca, bhikkhave, sappurisena sappurisataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti…pe… attanā ca anabhijjhālu hoti, parañca anabhijjhāya samādapeti; attanā ca abyāpannacitto hoti, parañca abyāpāde samādapeti; attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti. Ayaṃ vuccati, bhikkhave, sappurisena sappurisataro’’ti. Catutthaṃ.",
      "english": "“Monks, I shall teach you about the ignoble person and one more ignoble than the ignoble person; and about the noble person and one more noble than the noble person. Listen to that and pay careful attention, I will speak.”\n\n“And what, monks, is the ignoble person? Here, monks, some individual takes life, takes what is not given, engages in sexual misconduct, speaks falsehoods, engages in divisive speech, engages in harsh speech, engages in idle chatter, is covetous, has ill will, and holds wrong view. This, monks, is called the ignoble person.”\n\n“And what, monks, is one more ignoble than the ignoble person? Here, monks, some individual himself takes life and encourages others to take life; himself takes what is not given and encourages others to take what is not given; himself engages in sexual misconduct and encourages others in sexual misconduct; himself speaks falsehoods and encourages others to speak falsehoods; himself engages in divisive speech and encourages others in divisive speech; himself engages in harsh speech and encourages others in harsh speech; himself engages in idle chatter and encourages others in idle chatter; himself is covetous and encourages others in covetousness; himself has ill will and encourages others in ill will; and himself holds wrong view and encourages others in wrong view. This, monks, is called one more ignoble than the ignoble person.”\n\n“And what, monks, is the noble person? Here, monks, some individual abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from speaking falsehoods, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter, is not covetous, has no ill will, and holds right view. This, monks, is called the noble person.”\n\n“And what, monks, is one more noble than the noble person? Here, monks, some individual himself abstains from taking life and encourages others to abstain from taking life; himself abstains from taking what is not given and encourages others to abstain from taking what is not given; himself abstains from sexual misconduct and encourages others to abstain from sexual misconduct; himself abstains from speaking falsehoods and encourages others to abstain from speaking falsehoods; himself abstains from divisive speech and encourages others to abstain from divisive speech; himself abstains from harsh speech and encourages others to abstain from harsh speech; himself abstains from idle chatter and encourages others to abstain from idle chatter; himself is not covetous and encourages others in non-covetousness; himself has no ill will and encourages others in the absence of ill will; and himself holds right view and encourages others in right view. This, monks, is called one more noble than the noble person.”",
      "sinhala": "මහණෙනි, මම ඔබට අසත්පුරුෂ පුද්ගලයා ද, අසත්පුරුෂයාටත් වඩා අසත්පුරුෂ පුද්ගලයා ද, සත්පුරුෂ පුද්ගලයා ද, සත්පුරුෂයාටත් වඩා සත්පුරුෂ පුද්ගලයා ද දේශනා කරන්නෙමි. එය අසව්.\n\nමහණෙනි, අසත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහිලා ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාත කරන්නෙක් වෙයි, අදත්තාදානය කරන්නෙක් වෙයි, කාමයන්හි වරදවා හැසිරෙන්නෙක් වෙයි, මුසාවාද කියන්නෙක් වෙයි, පිසුනු වචන කියන්නෙක් වෙයි, පරුෂ වචන කියන්නෙක් වෙයි, සම්ඵප්පලාප කියන්නෙක් වෙයි, අභිජ්ඣා ඇත්තෙක් වෙයි, ව්‍යාපාද සිත් ඇත්තෙක් වෙයි, මිත්‍යා දෘෂ්ටිකයෙක් වෙයි. මහණෙනි, මෙ තෙම අසත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, අසත්පුරුෂයාටත් වඩා අසත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහිලා ඇතැම් පුද්ගලයෙක් තමා ද ප්‍රාණඝාතයෙහි යෙදෙයි, අනුන් ද ප්‍රාණඝාතයට පොලඹවයි. තමා ද අදත්තාදානයෙහි යෙදෙයි, අනුන් ද අදත්තාදානයට පොලඹවයි. තමා ද කාමයන්හි වරදවා හැසිරෙයි, අනුන් ද කාමමිථ්‍යාචාරයට පොලඹවයි. තමා ද මුසාවාද කියයි, අනුන් ද මුසාවාදයට පොලඹවයි. තමා ද පිසුනු වචන කියයි, අනුන් ද පිසුනු වචන කීමට පොලඹවයි. තමා ද පරුෂ වචන කියයි, අනුන් ද පරුෂ වචන කීමට පොලඹවයි. තමා ද සම්ඵප්පලාප කියයි, අනුන් ද සම්ඵප්පලාප කීමට පොලඹවයි. තමා ද අභිජ්ඣා ඇත්තෙක් වෙයි, අනුන් ද අභිජ්ඣාවට පොලඹවයි. තමා ද ව්‍යාපාද සිත් ඇත්තෙක් වෙයි, අනුන් ද ව්‍යාපාදයට පොලඹවයි. තමා ද මිත්‍යා දෘෂ්ටිකයෙක් වෙයි, අනුන් ද මිත්‍යා දෘෂ්ටියට පොලඹවයි. මහණෙනි, මෙ තෙම අසත්පුරුෂයාටත් වඩා අසත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහිලා ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙන් වැළකුණේ වෙයි, අදත්තාදානයෙන් වැළකුණේ වෙයි, කාමමිථ්‍යාචාරයෙන් වැළකුණේ වෙයි, මුසාවාදයෙන් වැළකුණේ වෙයි, පිසුනු වචන කීමෙන් වැළකුණේ වෙයි, පරුෂ වචන කීමෙන් වැළකුණේ වෙයි, සම්ඵප්පලාප කීමෙන් වැළකුණේ වෙයි. අභිජ්ඣා නැත්තෙක් වෙයි, ව්‍යාපාද සිත් නැත්තෙක් වෙයි, සම්මා දෘෂ්ටිකයෙක් වෙයි. මහණෙනි, මෙ තෙම සත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයාටත් වඩා සත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහිලා ඇතැම් පුද්ගලයෙක් තමා ද ප්‍රාණඝාතයෙන් වැළකුණේ වෙයි, අනුන් ද ප්‍රාණඝාතයෙන් වැළකීමට සමාදන් කරවයි. තමා ද අදත්තාදානයෙන් වැළකුණේ වෙයි, අනුන් ද අදත්තාදානයෙන් වැළකීමට සමාදන් කරවයි. තමා ද කාමමිථ්‍යාචාරයෙන් වැළකුණේ වෙයි, අනුන් ද කාමමිථ්‍යාචාරයෙන් වැළකීමට සමාදන් කරවයි. තමා ද මුසාවාදයෙන් වැළකුණේ වෙයි, අනුන් ද මුසාවාදයෙන් වැළකීමට සමාදන් කරවයි. තමා ද පිසුනු වචන කීමෙන් වැළකුණේ වෙයි, අනුන් ද පිසුනු වචන කීමෙන් වැළකීමට සමාදන් කරවයි. තමා ද පරුෂ වචන කීමෙන් වැළකුණේ වෙයි, අනුන් ද පරුෂ වචන කීමෙන් වැළකීමට සමාදන් කරවයි. තමා ද සම්ඵප්පලාප කීමෙන් වැළකුණේ වෙයි, අනුන් ද සම්ඵප්පලාප කීමෙන් වැළකීමට සමාදන් කරවයි. තමා ද අභිජ්ඣා නැත්තෙක් වෙයි, අනුන් ද අභිජ්ඣා රහිත බවට සමාදන් කරවයි. තමා ද ව්‍යාපාද සිත් නැත්තෙක් වෙයි, අනුන් ද ව්‍යාපාද රහිත බවට සමාදන් කරවයි. තමා ද සම්මා දෘෂ්ටිකයෙක් වෙයි, අනුන් ද සම්මා දෘෂ්ටියට සමාදන් කරවයි. මහණෙනි, මෙ තෙම සත්පුරුෂයාටත් වඩා සත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.",
      "paliTitle": "Dasakammasuttaṃ",
      "englishTitle": "Discourse on Ten Actions",
      "sinhalaTitle": "දස කර්‍ම සූත‍්‍රය"
    },
    {
      "number": 205,
      "pali": "‘‘Asappurisañca vo, bhikkhave, desessāmi, asappurisena asappurisatarañca; sappurisañca, sappurisena sappurisatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, asappuriso? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti, micchāsaṅkappo hoti, micchāvāco hoti, micchākammanto hoti, micchāājīvo hoti, micchāvāyāmo hoti, micchāsati hoti, micchāsamādhi hoti. Ayaṃ vuccati, bhikkhave, asappuriso. ‘‘Katamo ca, bhikkhave, asappurisena asappurisataro? Idha bhikkhave, ekacco attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti; attanā ca micchāsaṅkappo hoti, parañca micchāsaṅkappe samādapeti; attanā ca micchāvāco hoti, parañca micchāvācāya samādapeti; attanā ca micchākammanto hoti, parañca micchākammante samādapeti; attanā ca micchāājīvo hoti, parañca micchāājīve samādapeti; attanā ca micchāvāyāmo hoti, parañca micchāvāyāme samādapeti; attanā ca micchāsati hoti, parañca micchāsatiyā samādapeti; attanā ca micchāsamādhi hoti, parañca micchāsamādhimhi samādapeti. Ayaṃ vuccati, bhikkhave, asappurisena asappurisataro. ‘‘Katamo ca, bhikkhave, sappuriso? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti, sammāsaṅkappo hoti, sammāvāco hoti, sammākammanto hoti, sammāājīvo hoti, sammāvāyāmo hoti, sammāsati hoti, sammāsamādhi hoti. Ayaṃ vuccati, bhikkhave, sappuriso. ‘‘Katamo ca, bhikkhave, sappurisena sappurisataro? Idha, bhikkhave, ekacco attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti; attanā ca sammāsaṅkappo hoti, parañca sammāsaṅkappe samādapeti; attanā ca sammāvāco hoti, parañca sammāvācāya samādapeti; attanā ca sammākammanto hoti, parañca sammākammante samādapeti; attanā ca sammāājīvo hoti, parañca sammāājīve samādapeti; attanā ca sammāvāyāmo hoti, parañca sammāvāyāme samādapeti; attanā ca sammāsati hoti, parañca sammāsatiyā samādapeti; attanā ca sammāsamādhi hoti, parañca sammāsamādhimhi samādapeti. Ayaṃ vuccati, bhikkhave, sappurisena sappurisataro’’ti. Pañcamaṃ.",
      "english": "Monastics, I shall teach you about the ignoble person and one who is even more ignoble than the ignoble; and about the noble person and one who is even more noble than the noble. Listen to that.\n\nAnd who, monastics, is an ignoble person? Here, monastics, a certain individual holds wrong view, has wrong intention, has wrong speech, has wrong action, has wrong livelihood, has wrong effort, has wrong mindfulness, and has wrong concentration. This, monastics, is called an ignoble person.\n\nAnd who, monastics, is an ignoble person who is even more ignoble than the ignoble? Here, monastics, a certain individual himself holds wrong view and encourages others to adopt wrong view; he himself has wrong intention and encourages others to adopt wrong intention; he himself has wrong speech and encourages others to adopt wrong speech; he himself has wrong action and encourages others to adopt wrong action; he himself has wrong livelihood and encourages others to adopt wrong livelihood; he himself has wrong effort and encourages others to adopt wrong effort; he himself has wrong mindfulness and encourages others to adopt wrong mindfulness; he himself has wrong concentration and encourages others to adopt wrong concentration. This, monastics, is called an ignoble person who is even more ignoble than the ignoble.\n\nAnd who, monastics, is a noble person? Here, monastics, a certain individual has right view, has right intention, has right speech, has right action, has right livelihood, has right effort, has right mindfulness, and has right concentration. This, monastics, is called a noble person.\n\nAnd who, monastics, is a noble person who is even more noble than the noble? Here, monastics, a certain individual himself has right view and encourages others to adopt right view; he himself has right intention and encourages others to adopt right intention; he himself has right speech and encourages others to adopt right speech; he himself has right action and encourages others to adopt right action; he himself has right livelihood and encourages others to adopt right livelihood; he himself has right effort and encourages others to adopt right effort; he himself has right mindfulness and encourages others to adopt right mindfulness; he himself has right concentration and encourages others to adopt right concentration. This, monastics, is called a noble person who is even more noble than the noble.",
      "sinhala": "භික්ෂූණි, අසත්පුරුෂ පුද්ගලයා ගැනත්, අසත්පුරුෂයාටත් වඩා අසත්පුරුෂ පුද්ගලයා ගැනත්, සත්පුරුෂ පුද්ගලයා ගැනත්, සත්පුරුෂයාටත් වඩා සත්පුරුෂ පුද්ගලයා ගැනත් මම ඔබට දේශනා කරන්නෙමි. එයට සවන් දෙන්න.\n\nභික්ෂූණි, අසත්පුරුෂ පුද්ගලයා යනු කවරෙක්ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් මිත්‍යාදෘෂ්ටික වෙයි, මිත්‍යාසංකල්ප ඇතියෙක් වෙයි, මිත්‍යාවචී වෙයි, මිත්‍යාකර්මාන්ත ඇතියෙක් වෙයි, මිත්‍යාආජීව ඇතියෙක් වෙයි, මිත්‍යාව්‍යායාම ඇතියෙක් වෙයි, මිත්‍යාස්මෘති ඇතියෙක් වෙයි, මිත්‍යාසමාධි ඇතියෙක් වෙයි. භික්ෂූණි, මොහු අසත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nභික්ෂූණි, අසත්පුරුෂයාටත් වඩා අසත්පුරුෂ පුද්ගලයා යනු කවරෙක්ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් තමාම මිත්‍යාදෘෂ්ටික වෙයි, අනුන්වද මිත්‍යාදෘෂ්ටියෙහි පිහිටුවයි; තමාම මිත්‍යාසංකල්ප ඇතියෙක් වෙයි, අනුන්වද මිත්‍යාසංකල්පයන්හි පිහිටුවයි; තමාම මිත්‍යාවචී වෙයි, අනුන්වද මිත්‍යාවචනයෙහි පිහිටුවයි; තමාම මිත්‍යාකර්මාන්ත ඇතියෙක් වෙයි, අනුන්වද මිත්‍යාකර්මාන්තයන්හි පිහිටුවයි; තමාම මිත්‍යාආජීව ඇතියෙක් වෙයි, අනුන්වද මිත්‍යාආජීවයෙහි පිහිටුවයි; තමාම මිත්‍යාව්‍යායාම ඇතියෙක් වෙයි, අනුන්වද මිත්‍යාව්‍යායාමයෙහි පිහිටුවයි; තමාම මිත්‍යාස්මෘති ඇතියෙක් වෙයි, අනුන්වද මිත්‍යාස්මෘතියෙහි පිහිටුවයි; තමාම මිත්‍යාසමාධි ඇතියෙක් වෙයි, අනුන්වද මිත්‍යාසමාධියෙහි පිහිටුවයි. භික්ෂූණි, මොහු අසත්පුරුෂයාටත් වඩා අසත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nභික්ෂූණි, සත්පුරුෂ පුද්ගලයා යනු කවරෙක්ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් සම්මාදිට්ඨික වෙයි, සම්මාසංකල්ප ඇතියෙක් වෙයි, සම්මාවචී වෙයි, සම්මාකර්මාන්ත ඇතියෙක් වෙයි, සම්මාආජීව ඇතියෙක් වෙයි, සම්මාව්‍යායාම ඇතියෙක් වෙයි, සම්මාස්මෘති ඇතියෙක් වෙයි, සම්මාසමාධි ඇතියෙක් වෙයි. භික්ෂූණි, මොහු සත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nභික්ෂූණි, සත්පුරුෂයාටත් වඩා සත්පුරුෂ පුද්ගලයා යනු කවරෙක්ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් තමාම සම්මාදිට්ඨික වෙයි, අනුන්වද සම්මාදිට්ඨියෙහි පිහිටුවයි; තමාම සම්මාසංකල්ප ඇතියෙක් වෙයි, අනුන්වද සම්මාසංකල්පයන්හි පිහිටුවයි; තමාම සම්මාවචී වෙයි, අනුන්වද සම්මාවචනයෙහි පිහිටුවයි; තමාම සම්මාකර්මාන්ත ඇතියෙක් වෙයි, අනුන්වද සම්මාකර්මාන්තයන්හි පිහිටුවයි; තමාම සම්මාආජීව ඇතියෙක් වෙයි, අනුන්වද සම්මාආජීවයෙහි පිහිටුවයි; තමාම සම්මාව්‍යායාම ඇතියෙක් වෙයි, අනුන්වද සම්මාව්‍යායාමයෙහි පිහිටුවයි; තමාම සම්මාස්මෘති ඇතියෙක් වෙයි, අනුන්වද සම්මාස්මෘතියෙහි පිහිටුවයි; තමාම සම්මාසමාධි ඇතියෙක් වෙයි, අනුන්වද සම්මාසමාධියෙහි පිහිටුවයි. භික්ෂූණි, මොහු සත්පුරුෂයාටත් වඩා සත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.",
      "paliTitle": "Aṭṭhaṅgikasuttaṃ",
      "englishTitle": "The Eightfold Discourse",
      "sinhalaTitle": "අෂ්‍ටාංගික සූත්‍රය"
    },
    {
      "number": 206,
      "pali": "‘‘Asappurisañca vo, bhikkhave, desessāmi, asappurisena asappurisatarañca; sappurisañca, sappurisena sappurisatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, asappuriso? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti …pe… micchāñāṇī hoti, micchāvimutti hoti. Ayaṃ vuccati, bhikkhave, asappuriso. ‘‘Katamo ca, bhikkhave, asappurisena asappurisataro? Idha, bhikkhave, ekacco attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti…pe… attanā ca micchāñāṇī hoti, parañca micchāñāṇe samādapeti; attanā ca micchāvimutti hoti, parañca micchāvimuttiyā samādapeti. Ayaṃ vuccati, bhikkhave, asappurisena asappurisataro. ‘‘Katamo ca, bhikkhave, sappuriso? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti…pe… sammāñāṇī hoti, sammāvimutti hoti. Ayaṃ vuccati, bhikkhave, sappuriso. ‘‘Katamo ca, bhikkhave, sappurisena sappurisataro? Idha, bhikkhave, ekacco attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti…pe… attanā ca sammāñāṇī hoti, parañca sammāñāṇe samādapeti; attanā ca sammāvimutti hoti, parañca sammāvimuttiyā samādapeti. Ayaṃ vuccati, bhikkhave, sappurisena sappurisataro’’ti. Chaṭṭhaṃ.",
      "english": "Monks, I shall teach you about the ignoble person, and one who is more ignoble than an ignoble person; and about the noble person, and one who is more noble than a noble person. Listen to this.\n\nAnd what, monks, is an ignoble person? Herein, monks, a certain one holds wrong view, has wrong knowledge, and has wrong liberation. This one, monks, is called an ignoble person.\n\nAnd what, monks, is one who is more ignoble than an ignoble person? Herein, monks, a certain one himself holds wrong view and establishes others in wrong view; he himself has wrong knowledge and establishes others in wrong knowledge; he himself has wrong liberation and establishes others in wrong liberation. This one, monks, is called one who is more ignoble than an ignoble person.\n\nAnd what, monks, is a noble person? Herein, monks, a certain one holds right view, has right knowledge, and has right liberation. This one, monks, is called a noble person.\n\nAnd what, monks, is one who is more noble than a noble person? Herein, monks, a certain one himself holds right view and establishes others in right view; he himself has right knowledge and establishes others in right knowledge; he himself has right liberation and establishes others in right liberation. This one, monks, is called one who is more noble than a noble person.",
      "sinhala": "මහණෙනි, මම ඔබට අසත්පුරුෂ පුද්ගලයා ද, අසත්පුරුෂයාට වඩා අසත්පුරුෂ පුද්ගලයා ද, සත්පුරුෂ පුද්ගලයා ද, සත්පුරුෂයාට වඩා සත්පුරුෂ පුද්ගලයා ද දේශනා කරමි. එයට සවන් දෙන්න.\n\nමහණෙනි, අසත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහි යම්කිසි පුද්ගලයෙක් මිථ්‍යාදෘෂ‍්ටියෙන් යුක්ත වෙයි, මිථ්‍යාඥානයෙන් යුක්ත වෙයි, මිථ්‍යාවිමුක්තියෙන් යුක්ත වෙයි. මහණෙනි, මේ පුද්ගලයා අසත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, අසත්පුරුෂයාට වඩා අසත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහි යම්කිසි පුද්ගලයෙක් තමා ද මිථ්‍යාදෘෂ‍්ටියෙන් යුක්ත වෙයි, අනුන් ද මිථ්‍යාදෘෂ‍්ටියට පොලඹවයි. තමා ද මිථ්‍යාඥානයෙන් යුක්ත වෙයි, අනුන් ද මිථ්‍යාඥානයට පොලඹවයි. තමා ද මිථ්‍යාවිමුක්තියෙන් යුක්ත වෙයි, අනුන් ද මිථ්‍යාවිමුක්තියට පොලඹවයි. මහණෙනි, මේ පුද්ගලයා අසත්පුරුෂයාට වඩා අසත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහි යම්කිසි පුද්ගලයෙක් සම්මාදෘෂ‍්ටියෙන් යුක්ත වෙයි, සම්මාඥානයෙන් යුක්ත වෙයි, සම්මාවිමුක්තියෙන් යුක්ත වෙයි. මහණෙනි, මේ පුද්ගලයා සත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, සත්පුරුෂයාට වඩා සත්පුරුෂ පුද්ගලයා කවරෙක් ද? මහණෙනි, මෙහි යම්කිසි පුද්ගලයෙක් තමා ද සම්මාදෘෂ‍්ටියෙන් යුක්ත වෙයි, අනුන් ද සම්මාදෘෂ‍්ටියට යොමු කරයි. තමා ද සම්මාඥානයෙන් යුක්ත වෙයි, අනුන් ද සම්මාඥානයට යොමු කරයි. තමා ද සම්මාවිමුක්තියෙන් යුක්ත වෙයි, අනුන් ද සම්මාවිමුක්තියට යොමු කරයි. මහණෙනි, මේ පුද්ගලයා සත්පුරුෂයාට වඩා සත්පුරුෂ පුද්ගලයා යැයි කියනු ලැබේ.",
      "paliTitle": "Dasamaggasuttaṃ",
      "englishTitle": "The Ten Paths Sutta",
      "sinhalaTitle": "දස මාර්‍ග සූත්‍රය"
    },
    {
      "number": 207,
      "pali": "‘‘Pāpañca vo, bhikkhave, desessāmi, pāpena pāpatarañca; kalyāṇañca, kalyāṇena kalyāṇatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, pāpo? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… micchādiṭṭhiko hoti. Ayaṃ vuccati, bhikkhave, pāpo. ‘‘Katamo ca, bhikkhave, pāpena pāpataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti…pe… attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti. Ayaṃ vuccati, bhikkhave, pāpena pāpataro. ‘‘Katamo ca, bhikkhave, kalyāṇo? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti…pe… sammādiṭṭhiko hoti. Ayaṃ vuccati, bhikkhave, kalyāṇo. ‘‘Katamo ca, bhikkhave, kalyāṇena kalyāṇataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti…pe… attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti. Ayaṃ vuccati, bhikkhave, kalyāṇena kalyāṇataro’’ti. Sattamaṃ.",
      "english": "“Monks, I will teach you about evil and what is worse than evil; and about wholesome and what is more wholesome than wholesome. Listen to that.\n\nAnd what, monks, is evil? Here, monks, some individual kills living beings, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has ill will, and holds wrong view. This, monks, is called evil.\n\nAnd what, monks, is worse than evil? Here, monks, some individual himself kills living beings and encourages others to kill living beings; himself takes what is not given and encourages others to take what is not given; himself engages in sexual misconduct and encourages others to engage in sexual misconduct; himself speaks falsely and encourages others to speak falsely; himself speaks divisively and encourages others to speak divisively; himself speaks harshly and encourages others to speak harshly; himself engages in idle chatter and encourages others to engage in idle chatter; himself is covetous and encourages others to be covetous; himself has ill will and encourages others to have ill will; and himself holds wrong view and encourages others to hold wrong view. This, monks, is called worse than evil.\n\nAnd what, monks, is wholesome? Here, monks, some individual abstains from killing living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from slanderous speech, abstains from harsh speech, abstains from idle chatter, is not covetous, has no ill will, and holds right view. This, monks, is called wholesome.\n\nAnd what, monks, is more wholesome than wholesome? Here, monks, some individual himself abstains from killing living beings and encourages others to abstain from killing living beings; himself abstains from taking what is not given and encourages others to abstain from taking what is not given; himself abstains from sexual misconduct and encourages others to abstain from sexual misconduct; himself abstains from false speech and encourages others to abstain from false speech; himself abstains from slanderous speech and encourages others to abstain from slanderous speech; himself abstains from harsh speech and encourages others to abstain from harsh speech; himself abstains from idle chatter and encourages others to abstain from idle chatter; himself is not covetous and encourages others to be not covetous; himself has no ill will and encourages others to have no ill will; and himself holds right view and encourages others to hold right view. This, monks, is called more wholesome than wholesome.",
      "sinhala": "මහණෙනි, මම ඔබට පවද, පවට වඩා දරුණු පවද; කුසලයද, කුසලයට වඩා උතුම් කුසලයද දේශනා කරන්නෙමි. එය ශ‍්‍රවණය කරන්න.\n\nමහණෙනි, පව කුමක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප‍්‍රාණඝාතයෙහි යෙදෙයි, අදත්තාදානයෙහි යෙදෙයි, කාමමිථ්‍යාචාරයෙහි යෙදෙයි, මුසාවාදයෙන් යුක්ත වෙයි, පිසුණු වචන කියයි, පරුෂ වචන කියයි, සම්ප‍්‍රප්පලාපයෙන් යුක්ත වෙයි, අභිධ්‍යා ඇතියෙක් වෙයි, ව්‍යාපාද සිත් ඇත්තෙක් වෙයි, මිත්‍යාදෘෂ්ටික වෙයි. මහණෙනි, මේ පුද්ගලයා 'පව' යැයි කියනු ලැබේ.\n\nමහණෙනි, පවට වඩා දරුණු පව කුමක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද ප‍්‍රාණඝාතයෙහි යෙදෙයි, අනුන්වද ප‍්‍රාණඝාතයෙහි යොදවයි; තමාද අදත්තාදානයෙහි යෙදෙයි, අනුන්වද අදත්තාදානයෙහි යොදවයි; තමාද කාමමිථ්‍යාචාරයෙහි යෙදෙයි, අනුන්වද කාමමිථ්‍යාචාරයෙහි යොදවයි; තමාද මුසාවාදයෙන් යුක්ත වෙයි, අනුන්වද මුසාවාදයෙන් යොදවයි; තමාද පිසුණු වචන කියයි, අනුන්වද පිසුණු වචන කීමෙහි යොදවයි; තමාද පරුෂ වචන කියයි, අනුන්වද පරුෂ වචන කීමෙහි යොදවයි; තමාද සම්ප‍්‍රප්පලාපයෙන් යුක්ත වෙයි, අනුන්වද සම්ප‍්‍රප්පලාපයෙන් යොදවයි; තමාද අභිධ්‍යා ඇතියෙක් වෙයි, අනුන්වද අභිධ්‍යා ඇති කරවයි; තමාද ව්‍යාපාද සිත් ඇත්තෙක් වෙයි, අනුන්වද ව්‍යාපාද සිත් ඇති කරවයි; තමාද මිත්‍යාදෘෂ්ටික වෙයි, අනුන්වද මිත්‍යාදෘෂ්ටියෙහි යොදවයි. මහණෙනි, මේ පුද්ගලයා 'පවට වඩා දරුණු පව' යැයි කියනු ලැබේ.\n\nමහණෙනි, කුසලය කුමක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප‍්‍රාණඝාතයෙන් වැළකී සිටියි, අදත්තාදානයෙන් වැළකී සිටියි, කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි, මුසාවාදයෙන් වැළකී සිටියි, පිසුණු වචන කීමෙන් වැළකී සිටියි, පරුෂ වචන කීමෙන් වැළකී සිටියි, සම්ප‍්‍රප්පලාපයෙන් වැළකී සිටියි, අනුන්ගේ දේට ආශා නොකරයි, අනුන්ට හිංසා කිරීමට නොසිතයි, සම්මාදිට්ඨියෙන් යුක්ත වෙයි. මහණෙනි, මේ පුද්ගලයා 'කුසලය' යැයි කියනු ලැබේ.\n\nමහණෙනි, කුසලයට වඩා උතුම් කුසලය කුමක්ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද ප‍්‍රාණඝාතයෙන් වැළකී සිටියි, අනුන්වද ප‍්‍රාණඝාතයෙන් වැළකීමෙහි යොදවයි; තමාද අදත්තාදානයෙන් වැළකී සිටියි, අනුන්වද අදත්තාදානයෙන් වැළකීමෙහි යොදවයි; තමාද කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි, අනුන්වද කාමමිථ්‍යාචාරයෙන් වැළකීමෙහි යොදවයි; තමාද මුසාවාදයෙන් වැළකී සිටියි, අනුන්වද මුසාවාදයෙන් වැළකීමෙහි යොදවයි; තමාද පිසුණු වචන කීමෙන් වැළකී සිටියි, අනුන්වද පිසුණු වචන කීමෙන් වැළකීමෙහි යොදවයි; තමාද පරුෂ වචන කීමෙන් වැළකී සිටියි, අනුන්වද පරුෂ වචන කීමෙන් වැළකීමෙහි යොදවයි; තමාද සම්ප‍්‍රප්පලාපයෙන් වැළකී සිටියි, අනුන්වද සම්ප‍්‍රප්පලාපයෙන් වැළකීමෙහි යොදවයි; තමාද අනුන්ගේ දේට ආශා නොකරයි, අනුන්වද අනුන්ගේ දේට ආශා නොකිරීමෙහි යොදවයි; තමාද අනුන්ට හිංසා කිරීමට නොසිතයි, අනුන්වද අනුන්ට හිංසා නොකිරීමෙහි යොදවයි; තමාද සම්මාදිට්ඨියෙන් යුක්ත වෙයි, අනුන්වද සම්මාදිට්ඨියෙහි පිහිටුවයි. මහණෙනි, මේ පුද්ගලයා 'කුසලයට වඩා උතුම් කුසලය' යැයි කියනු ලැබේ.",
      "paliTitle": "Paṭhamapāpadhammasuttaṃ",
      "englishTitle": "First Discourse on Evil Qualities",
      "sinhalaTitle": "පළමු පාප ධ‍ර්ම සූත්‍රය"
    },
    {
      "number": 208,
      "pali": "‘‘Pāpañca vo, bhikkhave, desessāmi, pāpena pāpatarañca; kalyāṇañca, kalyāṇena kalyāṇatarañca. Taṃ suṇātha, sādhukaṃ manasikarotha; bhāsissāmī’’ti. Evaṃ…pe… etadavoca – ‘‘Katamo ca, bhikkhave, pāpo? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti…pe… micchāñāṇī hoti, micchāvimutti hoti. Ayaṃ vuccati, bhikkhave, pāpo. ‘‘Katamo ca, bhikkhave, pāpena pāpataro? Idha, bhikkhave, ekacco attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti…pe… attanā ca micchāñāṇī hoti, parañca micchāñāṇe samādapeti; attanā ca micchāvimutti hoti, parañca micchāvimuttiyā samādapeti. Ayaṃ vuccati, bhikkhave, pāpena pāpataro. ‘‘Katamo ca, bhikkhave, kalyāṇo? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti …pe… sammāñāṇī hoti, sammāvimutti hoti. Ayaṃ vuccati, bhikkhave, kalyāṇo. ‘‘Katamo ca, bhikkhave, kalyāṇena kalyāṇataro? Idha, bhikkhave, ekacco attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti…pe… attanā ca sammāñāṇī hoti, parañca sammāñāṇe samādapeti; attanā ca sammāvimutti hoti, parañca sammāvimuttiyā samādapeti. Ayaṃ vuccati, bhikkhave, kalyāṇena kalyāṇataro’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I will teach you about what is unwholesome, and what is more unwholesome; and what is wholesome, and what is more wholesome. Listen to it, pay careful attention; I will speak.\n\nHe spoke thus: “And what, monks, is unwholesome? Here, monks, someone has wrong view... has wrong knowledge, has wrong liberation. This, monks, is called unwholesome.\n\n“And what, monks, is more unwholesome than that? Here, monks, someone oneself has wrong view and also encourages others to adopt wrong view... oneself has wrong knowledge and also encourages others to adopt wrong knowledge; oneself has wrong liberation and also encourages others to adopt wrong liberation. This, monks, is called more unwholesome than that.\n\n“And what, monks, is wholesome? Here, monks, someone has right view... has right knowledge, has right liberation. This, monks, is called wholesome.\n\n“And what, monks, is more wholesome than that? Here, monks, someone oneself has right view and also encourages others to adopt right view... oneself has right knowledge and also encourages others to adopt right knowledge; oneself has right liberation and also encourages others to adopt right liberation. This, monks, is called more wholesome than that.”",
      "sinhala": "භික්ෂූනි, මම ඔබට පව දේශනා කරන්නෙමි. පවට වඩා දරුණු පවත් දේශනා කරන්නෙමි. කුසලයද, කුසලයට වඩා උතුම් කුසලයද දේශනා කරන්නෙමි. එය අසන්න. මනාකොට මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි.''\nඒ අයුරින් වදාළ සේක:\n''භික්ෂූනි, පව කුමක්ද? භික්ෂූනි, මෙහි සමහරෙක් මිත්‍යාදෘෂ්ටික වෙයි. මිත්‍යාඥාන ඇත්තෙක් වෙයි. මිත්‍යාවිමුක්තියට පත්වූවෙක් වෙයි. භික්ෂූනි, මොහු පව යැයි කියනු ලැබේ.\n''භික්ෂූනි, පවට වඩා දරුණු පව කුමක්ද? භික්ෂූනි, මෙහි සමහරෙක් තමාද මිත්‍යාදෘෂ්ටික වෙයි. අනුන්වද මිත්‍යාදෘෂ්ටියට පත්කරයි. තමාද මිත්‍යාඥාන ඇත්තෙක් වෙයි. අනුන්වද මිත්‍යාඥානයට පත්කරයි. තමාද මිත්‍යාවිමුක්තියට පත්වූවෙක් වෙයි. අනුන්වද මිත්‍යාවිමුක්තියට පත්කරයි. භික්ෂූනි, මොහු පවට වඩා දරුණු පව යැයි කියනු ලැබේ.\n''භික්ෂූනි, කුසලය කුමක්ද? භික්ෂූනි, මෙහි සමහරෙක් සම්මාදිට්ඨික වෙයි. සම්මාඥාන ඇත්තෙක් වෙයි. සම්මාවිමුක්තියට පත්වූවෙක් වෙයි. භික්ෂූනි, මොහු කුසලය යැයි කියනු ලැබේ.\n''භික්ෂූනි, කුසලයට වඩා උතුම් කුසලය කුමක්ද? භික්ෂූනි, මෙහි සමහරෙක් තමාද සම්මාදිට්ඨික වෙයි. අනුන්වද සම්මාදිට්ඨියට පත්කරයි. තමාද සම්මාඥාන ඇත්තෙක් වෙයි. අනුන්වද සම්මාඥානයට පත්කරයි. තමාද සම්මාවිමුක්තියට පත්වූවෙක් වෙයි. අනුන්වද සම්මාවිමුක්තියට පත්කරයි. භික්ෂූනි, මොහු කුසලයට වඩා උතුම් කුසලය යැයි කියනු ලැබේ.''",
      "paliTitle": "Dutiyapāpadhammasuttaṃ",
      "englishTitle": "The Second Discourse on Evil Qualities",
      "sinhalaTitle": "දෙවන පාපධ​ර්ම සූත්‍රය"
    },
    {
      "number": 209,
      "pali": "‘‘Pāpadhammañca vo, bhikkhave, desessāmi, pāpadhammena pāpadhammatarañca; kalyāṇadhammañca, kalyāṇadhammena kalyāṇadhammatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, pāpadhammo? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… micchādiṭṭhiko hoti. Ayaṃ vuccati, bhikkhave, pāpadhammo. ‘‘Katamo ca, bhikkhave, pāpadhammena pāpadhammataro? Idha bhikkhave, ekacco attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti…pe… attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti. Ayaṃ vuccati, bhikkhave, pāpadhammena pāpadhammataro. ‘‘Katamo ca, bhikkhave, kalyāṇadhammo? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti… pe… sammādiṭṭhiko hoti. Ayaṃ vuccati, bhikkhave, kalyāṇadhammo. ‘‘Katamo ca, bhikkhave, kalyāṇadhammena kalyāṇadhammataro? Idha, bhikkhave, ekacco attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti…pe… attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti. Ayaṃ vuccati, bhikkhave, kalyāṇadhammena kalyāṇadhammataro’’ti. Navamaṃ.",
      "english": "“Monks, I shall teach you evil conduct, and that which is more evil than evil conduct; and wholesome conduct, and that which is more wholesome than wholesome conduct. Listen to that.\n\n“And what, monks, is evil conduct? Here, monks, some individual kills living beings... is of wrong view. This, monks, is called evil conduct.\n\n“And what, monks, is that which is more evil than evil conduct? Here, monks, some individual himself kills living beings and encourages others to kill living beings... himself is of wrong view and encourages others to adopt wrong view. This, monks, is called that which is more evil than evil conduct.\n\n“And what, monks, is wholesome conduct? Here, monks, some individual refrains from killing living beings... is of right view. This, monks, is called wholesome conduct.\n\n“And what, monks, is that which is more wholesome than wholesome conduct? Here, monks, some individual himself refrains from killing living beings and encourages others to refrain from killing living beings... himself is of right view and encourages others to adopt right view. This, monks, is called that which is more wholesome than wholesome conduct.”",
      "sinhala": "මහණෙනි, මම ඔබට පාප ධර්‍මයද, පාප ධර්‍මයට වඩා අධම වූ ධර්‍මයද; කල්‍යාණ ධර්‍මයද, කල්‍යාණ ධර්‍මයට වඩා උත්තම වූ ධර්‍මයද දේශනා කරමි. එය හොඳින් අසන්න, මනසින් මෙනෙහි කරන්න.\n\nමහණෙනි, පාප ධර්‍මය නම් කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙහි යෙදෙයි. සොරකම් කරයි, කාමයන්හි වරදවා හැසිරෙයි, බොරු කියයි, කේළාම් කියයි, ඵරුෂ වචන කියයි, සම්ඵප්‍රලාපයෙන් යුක්ත වෙයි, අභිධ්‍යාවෙන් යුක්ත වෙයි, ව්‍යාපාදයෙන් යුක්ත වෙයි, වැරදි දැකීම් ඇත්තේ වෙයි. මහණෙනි, මේ පාප ධර්‍මය යැයි කියනු ලැබේ.\n\nමහණෙනි, පාප ධර්‍මයට වඩා අධම වූ ධර්‍මය නම් කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද ප්‍රාණඝාතයෙහි යෙදෙයි, අන්‍යයන්ද ප්‍රාණඝාතයෙහි සමාදන් කරවයි. තමාද සොරකම් කරයි, අන්‍යයන්ද සොරකම් කිරීමෙහි සමාදන් කරවයි. තමාද කාමයන්හි වරදවා හැසිරෙයි, අන්‍යයන්ද කාමයන්හි වරදවා හැසිරීමෙහි සමාදන් කරවයි. තමාද බොරු කියයි, අන්‍යයන්ද බොරු කීමෙහි සමාදන් කරවයි. තමාද කේළාම් කියයි, අන්‍යයන්ද කේළාම් කීමෙහි සමාදන් කරවයි. තමාද ඵරුෂ වචන කියයි, අන්‍යයන්ද ඵරුෂ වචන කීමෙහි සමාදන් කරවයි. තමාද සම්ඵප්‍රලාපයෙන් යුක්ත වෙයි, අන්‍යයන්ද සම්ඵප්‍රලාපයෙහි සමාදන් කරවයි. තමාද අභිධ්‍යාවෙන් යුක්ත වෙයි, අන්‍යයන්ද අභිධ්‍යාවෙහි සමාදන් කරවයි. තමාද ව්‍යාපාදයෙන් යුක්ත වෙයි, අන්‍යයන්ද ව්‍යාපාදයෙහි සමාදන් කරවයි. තමාද වැරදි දැකීම් ඇත්තේ වෙයි, අන්‍යයන්ද වැරදි දැකීම් ඇති කරවයි. මහණෙනි, මේ පාප ධර්‍මයට වඩා අධම වූ ධර්‍මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කල්‍යාණ ධර්‍මය නම් කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙන් වැළකී සිටියි. සොරකමින් වැළකී සිටියි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි, බොරු කීමෙන් වැළකී සිටියි, කේළාම් කීමෙන් වැළකී සිටියි, ඵරුෂ වචන කීමෙන් වැළකී සිටියි, සම්ඵප්‍රලාපයෙන් වැළකී සිටියි, අභිධ්‍යාවෙන් තොරව සිටියි, ව්‍යාපාදයෙන් තොරව සිටියි, නිවැරදි දැකීම් ඇත්තේ වෙයි. මහණෙනි, මේ කල්‍යාණ ධර්‍මය යැයි කියනු ලැබේ.\n\nමහණෙනි, කල්‍යාණ ධර්‍මයට වඩා උත්තම වූ ධර්‍මය නම් කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද ප්‍රාණඝාතයෙන් වැළකී සිටියි, අන්‍යයන්ද ප්‍රාණඝාතයෙන් වැළකීමෙහි සමාදන් කරවයි. තමාද සොරකමින් වැළකී සිටියි, අන්‍යයන්ද සොරකමින් වැළකීමෙහි සමාදන් කරවයි. තමාද කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි, අන්‍යයන්ද කාමයන්හි වරදවා හැසිරීමෙන් වැළකීමෙහි සමාදන් කරවයි. තමාද බොරු කීමෙන් වැළකී සිටියි, අන්‍යයන්ද බොරු කීමෙන් වැළකීමෙහි සමාදන් කරවයි. තමාද කේළාම් කීමෙන් වැළකී සිටියි, අන්‍යයන්ද කේළාම් කීමෙන් වැළකීමෙහි සමාදන් කරවයි. තමාද ඵරුෂ වචන කීමෙන් වැළකී සිටියි, අන්‍යයන්ද ඵරුෂ වචන කීමෙන් වැළකීමෙහි සමාදන් කරවයි. තමාද සම්ඵප්‍රලාපයෙන් වැළකී සිටියි, අන්‍යයන්ද සම්ඵප්‍රලාපයෙන් වැළකීමෙහි සමාදන් කරවයි. තමාද අභිධ්‍යාවෙන් තොරව සිටියි, අන්‍යයන්ද අභිධ්‍යාවෙන් තොරව සිටීමෙහි සමාදන් කරවයි. තමාද ව්‍යාපාදයෙන් තොරව සිටියි, අන්‍යයන්ද ව්‍යාපාදයෙන් තොරව සිටීමෙහි සමාදන් කරවයි. තමාද නිවැරදි දැකීම් ඇත්තේ වෙයි, අන්‍යයන්ද නිවැරදි දැකීම් ඇති කරවයි. මහණෙනි, මේ කල්‍යාණ ධර්‍මයට වඩා උත්තම වූ ධර්‍මය යැයි කියනු ලැබේ.",
      "paliTitle": "Tatiyapāpadhammasuttaṃ",
      "englishTitle": "The Third Discourse on Evil Qualities",
      "sinhalaTitle": "තෙවැනි පාපධ‍්‍රම සූත්‍රය"
    },
    {
      "number": 210,
      "pali": "‘‘Pāpadhammañca vo, bhikkhave, desessāmi, pāpadhammena pāpadhammatarañca; kalyāṇadhammañca, kalyāṇadhammena kalyāṇadhammatarañca. Taṃ suṇātha…pe…. ‘‘Katamo ca, bhikkhave, pāpadhammo? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti…pe… micchāñāṇī hoti, micchāvimutti hoti. Ayaṃ vuccati, bhikkhave, pāpadhammo. ‘‘Katamo ca, bhikkhave, pāpadhammena pāpadhammataro? Idha, bhikkhave, ekacco attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti…pe… attanā ca micchāñāṇī hoti, parañca micchāñāṇe samādapeti; attanā ca micchāvimutti hoti, parañca micchāvimuttiyā samādapeti. Ayaṃ vuccati, bhikkhave, pāpadhammena pāpadhammataro. ‘‘Katamo ca, bhikkhave, kalyāṇadhammo? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti…pe… sammāñāṇī hoti, sammāvimutti hoti. Ayaṃ vuccati, bhikkhave, kalyāṇadhammo. ‘‘Katamo ca, bhikkhave, kalyāṇadhammena kalyāṇadhammataro? Idha, bhikkhave, ekacco attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti…pe… attanā ca sammāñāṇī hoti, parañca sammāñāṇe samādapeti; attanā ca sammāvimutti hoti, parañca sammāvimuttiyā samādapeti. Ayaṃ vuccati, bhikkhave, kalyāṇadhammena kalyāṇadhammataro’’ti. Dasamaṃ. ",
      "english": "Monks, I will teach you about unwholesome states, and about states more unwholesome than the unwholesome; and about wholesome states, and about states more wholesome than the wholesome. Listen to that.\n\nAnd what, monks, are unwholesome states? Here, monks, a certain individual holds wrong view, has wrong intention, has wrong speech, has wrong action, has wrong livelihood, has wrong effort, has wrong mindfulness, has wrong concentration, has wrong knowledge, and has wrong liberation. This, monks, is called unwholesome states.\n\nAnd what, monks, are states more unwholesome than the unwholesome? Here, monks, a certain individual himself holds wrong view and encourages others to adopt wrong view; himself has wrong intention and encourages others to adopt wrong intention; himself has wrong speech and encourages others to adopt wrong speech; himself has wrong action and encourages others to adopt wrong action; himself has wrong livelihood and encourages others to adopt wrong livelihood; himself has wrong effort and encourages others to adopt wrong effort; himself has wrong mindfulness and encourages others to adopt wrong mindfulness; himself has wrong concentration and encourages others to adopt wrong concentration; himself has wrong knowledge and encourages others to adopt wrong knowledge; and himself has wrong liberation and encourages others to adopt wrong liberation. This, monks, is called states more unwholesome than the unwholesome.\n\nAnd what, monks, are wholesome states? Here, monks, a certain individual holds right view, has right intention, has right speech, has right action, has right livelihood, has right effort, has right mindfulness, has right concentration, has right knowledge, and has right liberation. This, monks, is called wholesome states.\n\nAnd what, monks, are states more wholesome than the wholesome? Here, monks, a certain individual himself holds right view and encourages others to adopt right view; himself has right intention and encourages others to adopt right intention; himself has right speech and encourages others to adopt right speech; himself has right action and encourages others to adopt right action; himself has right livelihood and encourages others to adopt right livelihood; himself has right effort and encourages others to adopt right effort; himself has right mindfulness and encourages others to adopt right mindfulness; himself has right concentration and encourages others to adopt right concentration; himself has right knowledge and encourages others to adopt right knowledge; and himself has right liberation and encourages others to adopt right liberation. This, monks, is called states more wholesome than the wholesome.",
      "sinhala": "මහණෙනි, නුඹලාට පාපධර්ම​යත්, පාපධර්ම​යට වඩා පාපධර්ම​යත්, කල්‍ය​ාණධර්ම​යත්, කල්‍ය​ාණධර්ම​යට වඩා කල්‍ය​ාණධර්ම​යත් දේශනා කරන්නෙමි. එය අසනු මැනවි.\n\nමහණෙනි, පාපධර්ම​ය යනු කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් මිත්‍යාදෘෂ්ටික වෙයි; මිත්‍යාඤාණී වෙයි; මිත්‍යාවිමුක්ත වෙයි. මහණෙනි, මෙය පාපධර්ම​ය යැයි කියනු ලැබේ.\n\nමහණෙනි, පාපධර්ම​යට වඩා පාපධර්ම​ය යනු කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද මිත්‍යාදෘෂ්ටික වී, අනුන්වද මිත්‍යාදෘෂ්ටියෙහි පිහිටුවයි; තමාද මිත්‍යාඤාණී වී, අනුන්වද මිත්‍යාඤාණයෙහි පිහිටුවයි; තමාද මිත්‍යාවිමුක්ත වී, අනුන්වද මිත්‍යාවිමුක්තියෙහි පිහිටුවයි. මහණෙනි, මෙය පාපධර්ම​යට වඩා පාපධර්ම​ය යැයි කියනු ලැබේ.\n\nමහණෙනි, කල්‍ය​ාණධර්ම​ය යනු කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සම්මාදිට්ඨික වෙයි; සම්මාඤාණී වෙයි; සම්මාවිමුක්ත වෙයි. මහණෙනි, මෙය කල්‍ය​ාණධර්ම​ය යැයි කියනු ලැබේ.\n\nමහණෙනි, කල්‍ය​ාණධර්ම​යට වඩා කල්‍ය​ාණධර්ම​ය යනු කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් තමාද සම්මාදිට්ඨික වී, අනුන්වද සම්මාදිට්ඨියෙහි පිහිටුවයි; තමාද සම්මාඤාණී වී, අනුන්වද සම්මාඤාණයෙහි පිහිටුවයි; තමාද සම්මාවිමුක්ත වී, අනුන්වද සම්මාවිමුක්තියෙහි පිහිටුවයි. මහණෙනි, මෙය කල්‍ය​ාණධර්ම​යට වඩා කල්‍ය​ාණධර්ම​ය යැයි කියනු ලැබේ.",
      "paliTitle": "Catutthapāpadhammasuttaṃ",
      "englishTitle": "The Fourth Discourse on Evil Qualities",
      "sinhalaTitle": "සිවුවන පාපධ​ර්‍ම සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sappurisavaggo paṭhamo. Tassuddānaṃ – Sikkhāpadañca assaddhaṃ, sattakammaṃ atho ca dasakammaṃ; Aṭṭhaṅgikañca dasamaggaṃ, dve pāpadhammā apare dveti.",
    "english": "First Section: Good Persons",
    "sinhala": "සප්පුරිස වග්ගය පළමුවැන්න"
  }
}