{
  "id": "an4.25",
  "title": {
    "pali": "Āpattibhayavaggo",
    "english": "The Section on the Danger of Transgressions",
    "sinhala": "ආපත්තිභය වග්ගය"
  },
  "sections": [
    {
      "number": 243,
      "pali": "Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘api nu taṃ, ānanda, adhikaraṇaṃ vūpasanta’’nti? ‘‘Kuto taṃ, bhante, adhikaraṇaṃ vūpasamissati [vūpasammissati (?)]! Āyasmato, bhante, anuruddhassa bāhiyo nāma saddhivihāriko kevalakappaṃ saṅghabhedāya ṭhito. Tatrāyasmā anuruddho na ekavācikampi bhaṇitabbaṃ maññatī’’ti. ‘‘Kadā panānanda, anuruddho saṅghamajjhe adhikaraṇesu [adhikaraṇesu tesu (ka.)] voyuñjati! Nanu, ānanda, yāni kānici adhikaraṇāni uppajjanti, sabbāni tāni tumhe ceva vūpasametha sāriputtamoggallānā ca. ‘‘Cattārome, ānanda, atthavase sampassamāno pāpabhikkhu saṅghabhedena nandati. Katame cattāro? Idhānanda, pāpabhikkhu dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – dussīlo pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujātoti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, paṭhamaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati. ‘‘Puna caparaṃ, ānanda, pāpabhikkhu micchādiṭṭhiko hoti, antaggāhikāya diṭṭhiyā samannāgato. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – micchādiṭṭhiko antaggāhikāya diṭṭhiyā samannāgatoti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, dutiyaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati. ‘‘Puna caparaṃ, ānanda, pāpabhikkhu micchāājīvo hoti, micchāājīvena jīvikaṃ [jīvitaṃ (syā. kaṃ. pī. ka.)] kappeti. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – micchāājīvo micchāājīvena jīvikaṃ kappetīti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, tatiyaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati. ‘‘Puna caparaṃ, ānanda, pāpabhikkhu lābhakāmo hoti sakkārakāmo anavaññattikāmo. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – lābhakāmo sakkārakāmo anavaññattikāmoti, samaggā maṃ santā na sakkarissanti na garuṃ karissanti na mānessanti na pūjessanti; vaggā pana maṃ sakkarissanti garuṃ karissanti mānessanti pūjessantī’ti. Idaṃ, ānanda, catutthaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati. Ime kho, ānanda, cattāro atthavase sampassamāno pāpabhikkhu saṅghabhedena nandatī’’ti. Paṭhamaṃ.",
      "english": "At one time the Blessed One was staying in Kosambi, at Ghosita's Park. Then the Venerable Ananda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As the Venerable Ananda was sitting to one side, the Blessed One said to him: \"Ananda, has that ecclesiastical dispute been settled?\"\n\n\"How could it be settled, Venerable Sir? The co-resident of the Venerable Anuruddha, named Bahiyo, stands entirely for the purpose of creating a schism in the Sangha. Yet, the Venerable Anuruddha does not think it appropriate to utter even a single word regarding it.\"\n\n\"But Ananda, when does Anuruddha involve himself in ecclesiastical disputes within the Sangha? Ananda, isn't it true that whatever ecclesiastical disputes arise, all of them are settled by you, Sariputta, and Moggallana?\"\n\n\"Ananda, there are these four grounds for delighting in a schism within the Sangha that an immoral monk perceives. Which four? Here, Ananda, an immoral monk is unethical, of evil ways, impure, of suspicious conduct, concealing his deeds; not a recluse, but claiming to be a recluse; not leading a holy life, but claiming to lead a holy life; rotten within, oozing, born of corruption. He thinks: 'If the bhikkhus know me to be unethical, of evil ways, impure, of suspicious conduct, concealing my deeds, not a recluse but claiming to be a recluse, not leading a holy life but claiming to lead a holy life, rotten within, oozing, born of corruption – then, if they are united, they will destroy me; but if they are divided, they will not destroy me.' Ananda, this is the first ground that an immoral monk perceives for delighting in a schism within the Sangha.\"\n\n\"Furthermore, Ananda, an immoral monk holds wrong view, being possessed of an extreme view. He thinks: 'If the bhikkhus know me to be one who holds wrong view, being possessed of an extreme view – then, if they are united, they will destroy me; but if they are divided, they will not destroy me.' Ananda, this is the second ground that an immoral monk perceives for delighting in a schism within the Sangha.\"\n\n\"Furthermore, Ananda, an immoral monk lives by wrong livelihood, sustaining his life through wrong livelihood. He thinks: 'If the bhikkhus know me to be one who lives by wrong livelihood, sustaining my life through wrong livelihood – then, if they are united, they will destroy me; but if they are divided, they will not destroy me.' Ananda, this is the third ground that an immoral monk perceives for delighting in a schism within the Sangha.\"\n\n\"Furthermore, Ananda, an immoral monk is desirous of gain, desirous of honor, desirous of not being looked down upon. He thinks: 'If the bhikkhus know me to be desirous of gain, desirous of honor, desirous of not being looked down upon – then, if they are united, they will not honor me, will not respect me, will not revere me, will not venerate me; but if they are divided, they will honor me, will respect me, will revere me, will venerate me.' Ananda, this is the fourth ground that an immoral monk perceives for delighting in a schism within the Sangha. These, Ananda, are the four grounds that an immoral monk perceives for delighting in a schism within the Sangha.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කොසඹෑ නුවර ඝෝෂිතාරාමයේ වැඩසිටින සේක. එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වැඩසිටියහ. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්දයෙනි, ඒ අදිකරණය සංසිඳී අවසන්ද?”\n\n“භාග්‍යවතුන් වහන්ස, ඒ අදිකරණය කෙසේ සංසිඳේද! භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේගේ බාහිය නම් සද්ධිවිහාරික භික්ෂුව මුළුල්ලක්ම සංඝභේදයට හේතුවෙමින් සිටී. එහෙත් ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ එයට එක වචනයකුදු කීමට සුදුසු යැයි නොසිතන සේක.”\n\n“ආනන්දයෙනි, අනුරුද්ධ ස්ථවිරයන් වහන්සේ කවර කලෙකද සංඝයා මැද අදිකරණ විසඳීමට වෙහෙසෙන්නේ? ආනන්දයෙනි, යම්කිසි අදිකරණයක් හටගනීද, ඒ සියල්ල නුඹලාත්, සාරිපුත්ත මොග්ගල්ලාන දෙනම ද සංසිඳවිය යුතු නොවේද?”\n\n“ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් මෙසේ කරුණු සතරක් දකිමින් සංඝභේදය ගැන සතුටු වේ. ඒ සතර කවරේද? ආනන්දයෙනි, මෙහිලා දුශ්ශීල භික්ෂුව දුශ්ශීල වේ, පාපී ස්වභාවයක් ඇත්තේය, අපිරිසිදුය, සැක කටයුතු පැවැත්මකින් යුක්තය, රහසිගත ක්‍රියා ඇත්තේය, ශ්‍ර‍මණයෙක් නොවී ශ්‍ර‍මණයෙකු ලෙස පොරොන්දු වූවෙකි, අ‍බ්‍ර‍හ්මචාරී නොවී බ්‍ර‍හ්මචාරියෙකු ලෙස පොරොන්දු වූවෙකි, ඇතුළතින් කුණු වී, කාන්දු වී, කුණුවලින් පිරී ගියෙකි. ඔහුට මෙසේ සිතේ: ‘භික්ෂූන් මා දුශ්ශීල බව, පාපී ස්වභාවයක් ඇති බව, අපිරිසිදු බව, සැක කටයුතු පැවැත්මකින් යුක්ත බව, රහසිගත ක්‍රියා ඇති බව, ශ්‍ර‍මණයෙක් නොවී ශ්‍ර‍මණයෙකු ලෙස පොරොන්දු වූවෙක් බව, අ‍බ්‍ර‍හ්මචාරී නොවී බ්‍ර‍හ්මචාරියෙකු ලෙස පොරොන්දු වූවෙක් බව, ඇතුළතින් කුණු වී, කාන්දු වී, කුණුවලින් පිරී ගිය කෙනෙකු බව දන්නේ නම්, සමගිව සිටින පිරිස මා විනාශ කරනු ඇත; එහෙත් භේද වූ පිරිස මා විනාශ නොකරනු ඇත’යි. ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් සංඝභේදය ගැන සතුටු වීමට හේතුවන පළමු කරුණ මෙයයි.\n\nතවද, ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් මිත්‍යාදෘෂ්ටිකයෙක් වේ, අන්තග්‍රාහී දෘෂ්ටියකින් යුක්ත වේ. ඔහුට මෙසේ සිතේ: ‘භික්ෂූන් මා මිත්‍යාදෘෂ්ටිකයෙක් බවත්, අන්තග්‍රාහී දෘෂ්ටියකින් යුක්ත බවත් දන්නේ නම්, සමගිව සිටින පිරිස මා විනාශ කරනු ඇත; එහෙත් භේද වූ පිරිස මා විනාශ නොකරනු ඇත’යි. ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් සංඝභේදය ගැන සතුටු වීමට හේතුවන දෙවන කරුණ මෙයයි.\n\nතවද, ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් මිථ්‍යාආජීවයෙන් යුක්ත වේ, මිථ්‍යාආජීවයෙන් ජීවිකාව පවත්වයි. ඔහුට මෙසේ සිතේ: ‘භික්ෂූන් මා මිථ්‍යාආජීවයෙන් යුක්ත බවත්, මිථ්‍යාආජීවයෙන් ජීවිකාව පවත්වන බවත් දන්නේ නම්, සමගිව සිටින පිරිස මා විනාශ කරනු ඇත; එහෙත් භේද වූ පිරිස මා විනාශ නොකරනු ඇත’යි. ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් සංඝභේදය ගැන සතුටු වීමට හේතුවන තුන්වන කරුණ මෙයයි.\n\nතවද, ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් ලාභයට කැමති වේ, සත්කාරයට කැමති වේ, අපහාස නොලැබීමට කැමති වේ. ඔහුට මෙසේ සිතේ: ‘භික්ෂූන් මා ලාභයට කැමති බවත්, සත්කාරයට කැමති බවත්, අපහාස නොලැබීමට කැමති බවත් දන්නේ නම්, සමගිව සිටින පිරිස මා සත්කාර නොකරනු ඇත, ගරු නොකරනු ඇත, මානයට පත් නොකරනු ඇත, පුදනු නොලබනු ඇත; එහෙත් භේද වූ පිරිස මා සත්කාර කරනු ඇත, ගරු කරනු ඇත, මානයට පත් කරනු ඇත, පුදනු ලබනු ඇත’යි. ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් සංඝභේදය ගැන සතුටු වීමට හේතුවන සිව්වන කරුණ මෙයයි.” “ආනන්දයෙනි, දුශ්ශීල භික්ෂුවක් මෙසේ කරුණු සතරක් දකිමින් සංඝභේදය ගැන සතුටු වේ.”",
      "paliTitle": "Saṅghabhedakasuttaṃ"
    },
    {
      "number": 244,
      "pali": "‘‘Cattārimāni, bhikkhave, āpattibhayāni. Katamāni cattāri? Seyyathāpi, bhikkhave, coraṃ āgucāriṃ gahetvā rañño dasseyyuṃ – ‘ayaṃ te, deva, coro āgucārī. Imassa devo daṇḍaṃ paṇetū’ti. Tamenaṃ rājā evaṃ vadeyya – ‘gacchatha, bho, imaṃ purisaṃ daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindathā’ti. Tamenaṃ rañño purisā daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindeyyuṃ. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ sīsacchejjaṃ. Yatra hi nāma rañño purisā daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindissanti! So vatassāhaṃ [so vatassāyaṃ (sī.)] evarūpaṃ pāpakammaṃ [pāpaṃ kammaṃ (sī. pī.)] na kareyyaṃ [na kareyya (sī.) dī. ni. 1.183 pāḷiyā tadaṭṭhakathāya ca saṃsandetabbaṃ] gārayhaṃ sīsacchejja’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pārājikesu dhammesu. Tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pārājikaṃ dhammaṃ na āpajjissati, āpanno vā pārājikaṃ dhammaṃ yathādhammaṃ paṭikarissati. ‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ [kāḷakaṃ vatthaṃ (sī. syā. kaṃ. pī.)] paridhāya kese pakiritvā musalaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ mosallaṃ, yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ mosallaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā musalaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ mosallaṃ, yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ mosalla’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti saṅghādisesesu dhammesu, tassetaṃ pāṭikaṅkhaṃ – anāpanno vā saṅghādisesaṃ dhammaṃ na āpajjissati, āpanno vā saṅghādisesaṃ dhammaṃ yathādhammaṃ paṭikarissati. ‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ paridhāya kese pakiritvā bhasmapuṭaṃ [assapuṭaṃ (sī. syā. kaṃ. pī.)] khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ bhasmapuṭaṃ. Yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ bhasmapuṭaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā bhasmapuṭaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ bhasmapuṭaṃ; yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ bhasmapuṭa’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pācittiyesu dhammesu, tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pācittiyaṃ dhammaṃ na āpajjissati, āpanno vā pācittiyaṃ dhammaṃ yathādhammaṃ paṭikarissati. ‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ paridhāya kese pakiritvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ upavajjaṃ. Yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ upavajjaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ upavajjaṃ; yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ upavajja’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pāṭidesanīyesu dhammesu, tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pāṭidesanīyaṃ dhammaṃ na āpajjissati, āpanno vā pāṭidesanīyaṃ dhammaṃ yathādhammaṃ paṭikarissati. Imāni kho, bhikkhave, cattāri āpattibhayānī’’ti. Dutiyaṃ.",
      "english": "Monks, there are these four fears concerning offenses. Which four?\n\nJust as, monks, people might arrest a criminal, a wrongdoer, and present him to the king, saying: 'This, sire, is a criminal, a wrongdoer. Let His Majesty inflict punishment upon him.' Then the king might say to them: 'Go, sirs, bind this man tightly with strong ropes, with his arms behind his back, shave his head, parade him through every street and crossroads to the harsh sound of a drum, lead him out through the southern gate, and cut off his head to the south of the city.' Then the king's men would bind that man tightly with strong ropes, with his arms behind his back, shave his head, parade him through every street and crossroads to the harsh sound of a drum, lead him out through the southern gate, and cut off his head to the south of the city. And to a certain bystander, it might occur: 'Indeed, this man has committed an evil deed, a blameworthy offense worthy of decapitation! To think that the king's men will bind him tightly with strong ropes, with his arms behind his back, shave his head, parade him through every street and crossroads to the harsh sound of a drum, lead him out through the southern gate, and cut off his head to the south of the city! I would never commit such an evil, blameworthy deed worthy of decapitation!' In the same way, monks, if any monk or nun has such an intense perception of fear concerning the Pārājika offenses (those entailing permanent expulsion from the Sangha), then this is to be expected: if they have not yet committed a Pārājika offense, they will not commit one; or if they have committed a Pārājika offense, they will rectify it according to the Dhamma.\n\nJust as, monks, a man might put on black clothes, dishevel his hair, place a pestle on his shoulder, approach a crowd of people, and say: 'Venerable sirs, I have committed an evil deed, a blameworthy offense worthy of carrying the pestle. I will do whatever pleases you, venerable sirs.' And to a certain bystander, it might occur: 'Indeed, this man has committed an evil deed, a blameworthy offense worthy of carrying the pestle! To think that he would put on black clothes, dishevel his hair, place a pestle on his shoulder, approach a crowd of people, and say: \"Venerable sirs, I have committed an evil deed, a blameworthy offense worthy of carrying the pestle. I will do whatever pleases you, venerable sirs.\" I would never commit such an evil, blameworthy deed worthy of carrying the pestle!' In the same way, monks, if any monk or nun has such an intense perception of fear concerning the Saṅghādisesa offenses (those entailing an initial and subsequent meeting of the Sangha), then this is to be expected: if they have not yet committed a Saṅghādisesa offense, they will not commit one; or if they have committed a Saṅghādisesa offense, they will rectify it according to the Dhamma.\n\nJust as, monks, a man might put on black clothes, dishevel his hair, place a basket of ashes on his shoulder, approach a crowd of people, and say: 'Venerable sirs, I have committed an evil deed, a blameworthy offense worthy of carrying a basket of ashes. I will do whatever pleases you, venerable sirs.' And to a certain bystander, it might occur: 'Indeed, this man has committed an evil deed, a blameworthy offense worthy of carrying a basket of ashes! To think that he would put on black clothes, dishevel his hair, place a basket of ashes on his shoulder, approach a crowd of people, and say: \"Venerable sirs, I have committed an evil deed, a blameworthy offense worthy of carrying a basket of ashes. I will do whatever pleases you, venerable sirs.\" I would never commit such an evil, blameworthy deed worthy of carrying a basket of ashes!' In the same way, monks, if any monk or nun has such an intense perception of fear concerning the Pācittiya offenses (those entailing expiation), then this is to be expected: if they have not yet committed a Pācittiya offense, they will not commit one; or if they have committed a Pācittiya offense, they will rectify it according to the Dhamma.\n\nJust as, monks, a man might put on black clothes, dishevel his hair, approach a crowd of people, and say: 'Venerable sirs, I have committed an evil deed, a blameworthy offense worthy of censure. I will do whatever pleases you, venerable sirs.' And to a certain bystander, it might occur: 'Indeed, this man has committed an evil deed, a blameworthy offense worthy of censure! To think that he would put on black clothes, dishevel his hair, approach a crowd of people, and say: \"Venerable sirs, I have committed an evil deed, a blameworthy offense worthy of censure. I will do whatever pleases you, venerable sirs.\" I would never commit such an evil, blameworthy deed worthy of censure!'\n\nJust so, monks, whosoever, whether a monk or a nun, has such an intense sense of danger established concerning the offenses requiring acknowledgement, from them this may be expected: either, not having committed an offense requiring acknowledgement, they will not commit it; or, having committed an offense requiring acknowledgement, they will make amends for it in accordance with the Dhamma. These, indeed, monks, are the four dangers concerning offenses.\n\nThe second.",
      "sinhala": "භික්ෂූනි, මේ ආපත්ති භයයන් සතරකි. ඒ සතර කවරේද?\n\nභික්ෂූනි, යම් සේ වරදක් කළ සොරකු අල්ලා රජුට පෙන්වා මෙසේ කියත්ද: “දේවයන් වහන්ස, මේ ඔබගේ වරදක් කළ සොරා ය. මෙයට දඬුවම් නියම කරන සේක්වා” කියා. එවිට රජු මෙසේ කියනු ඇත: “පින්වත්නි, මේ පුරුෂයා දැඩි කඹයකින් අත් පිටුපසට කර තදින් බැඳ, කොණ්ඩය කපා, රළු හඬින් යුත් පානව බෙරයක් ගසමින් වීදියෙන් වීදියට, සතර මං හන්දියෙන් සතර මං හන්දියට පෙරහරින් ගෙන ගොස්, දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයෙන් දකුණු පසින් හිස සිඳ දමන්න” කියා. එවිට රජුගේ පුරුෂයෝ ඔහු දැඩි කඹයකින් අත් පිටුපසට කර තදින් බැඳ, කොණ්ඩය කපා, රළු හඬින් යුත් පානව බෙරයක් ගසමින් වීදියෙන් වීදියට, සතර මං හන්දියෙන් සතර මං හන්දියට පෙරහරින් ගෙන ගොස්, දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයෙන් දකුණු පසින් හිස සිඳ දමති. එහි සිටි යම්කිසි පුරුෂයකුට මෙසේ සිතෙන්නේය: “ඇත්තෙන්ම, පින්වත්නි, මේ පුරුෂයා හිස සිඳීම පිණිස සුදුසු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කළේය. රජුගේ පුරුෂයෝ දැඩි කඹයකින් අත් පිටුපසට කර තදින් බැඳ, කොණ්ඩය කපා, රළු හඬින් යුත් පානව බෙරයක් ගසමින් වීදියෙන් වීදියට, සතර මං හන්දියෙන් සතර මං හන්දියට පෙරහරින් ගෙන ගොස්, දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයෙන් දකුණු පසින් හිස සිඳ දමති! මා නම් එවැනි නින්දාවට ලක් කළ යුතු, හිස සිඳීම පිණිස සුදුසු වූ පාප ක්‍රියාවක් නොකරන්නෙමි” කියා. භික්ෂූනි, එසේම යම්කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ වේවා, පාරාජිකා ධර්මයන් සම්බන්ධයෙන් මෙබඳු දැඩි භය සංඥාවක් පහළ වන්නේ නම්, ඔහුට හෝ ඇයට මෙය අපේක්ෂා කළ හැකිය: පාරාජිකා ධර්මයකට නොවැටුණු තැනැත්තා පාරාජිකා ධර්මයකට නොවැටෙනු ඇත, පාරාජිකා ධර්මයකට වැටුණු තැනැත්තා ධර්මයට අනුව එයට පිළියම් කරනු ඇත.\n\nභික්ෂූනි, යම් සේ එක් පුරුෂයෙක් කළු වස්ත්‍රයක් හැඳ, කෙස් අවුල් කර, මුගුරක් කර මත තබාගෙන, මහජනයා වෙත එළඹ, මෙසේ කියන්නේද: “ස්වාමීනි, මා විසින් මුගුරකින් පහර දීමට සුදුසු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කරන ලදි. ආයුෂ්මත්වරුන් මා කෙරෙහි සතුටු වන ලෙස මම කටයුතු කරමි” කියා. එහි සිටි යම්කිසි පුරුෂයකුට මෙසේ සිතෙන්නේය: “ඇත්තෙන්ම, පින්වත්නි, මේ පුරුෂයා මුගුරකින් පහර දීමට සුදුසු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කළේය. මක්නිසාද යත්, ඔහු කළු වස්ත්‍රයක් හැඳ, කෙස් අවුල් කර, මුගුරක් කර මත තබාගෙන, මහජනයා වෙත එළඹ, ‘ස්වාමීනි, මා විසින් මුගුරකින් පහර දීමට සුදුසු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කරන ලදි; ආයුෂ්මත්වරුන් මා කෙරෙහි සතුටු වන ලෙස මම කටයුතු කරමි’ යැයි කියන්නේය. මා නම් එවැනි නින්දාවට ලක් කළ යුතු, මුගුරකින් පහර දීමට සුදුසු වූ පාප ක්‍රියාවක් නොකරන්නෙමි” කියා. භික්ෂූනි, එසේම යම්කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ වේවා, සංඝාදිසේස ධර්මයන් සම්බන්ධයෙන් මෙබඳු දැඩි භය සංඥාවක් පහළ වන්නේ නම්, ඔහුට හෝ ඇයට මෙය අපේක්ෂා කළ හැකිය: සංඝාදිසේස ධර්මයකට නොවැටුණු තැනැත්තා සංඝාදිසේස ධර්මයකට නොවැටෙනු ඇත, සංඝාදිසේස ධර්මයකට වැටුණු තැනැත්තා ධර්මයට අනුව එයට පිළියම් කරනු ඇත.\n\nභික්ෂූනි, යම් සේ එක් පුරුෂයෙක් කළු වස්ත්‍රයක් හැඳ, කෙස් අවුල් කර, අළු මල්ලක් කර මත තබාගෙන, මහජනයා වෙත එළඹ, මෙසේ කියන්නේද: “ස්වාමීනි, මා විසින් අළු පොදියක් හිසට දැමීමට සුදුසු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කරන ලදි. ආයුෂ්මත්වරුන් මා කෙරෙහි සතුටු වන ලෙස මම කටයුතු කරමි” කියා. එහි සිටි යම්කිසි පුරුෂයකුට මෙසේ සිතෙන්නේය: “ඇත්තෙන්ම, පින්වත්නි, මේ පුරුෂයා අළු පොදියක් හිසට දැමීමට සුදුසු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කළේය. මක්නිසාද යත්, ඔහු කළු වස්ත්‍රයක් හැඳ, කෙස් අවුල් කර, අළු මල්ලක් කර මත තබාගෙන, මහජනයා වෙත එළඹ, ‘ස්වාමීනි, මා විසින් අළු පොදියක් හිසට දැමීමට සුදුසු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කරන ලදි; ආයුෂ්මත්වරුන් මා කෙරෙහි සතුටු වන ලෙස මම කටයුතු කරමි’ යැයි කියන්නේය. මා නම් එවැනි නින්දාවට ලක් කළ යුතු, අළු පොදියක් හිසට දැමීමට සුදුසු වූ පාප ක්‍රියාවක් නොකරන්නෙමි” කියා. භික්ෂූනි, එසේම යම්කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ වේවා, පාචිත්තිය ධර්මයන් සම්බන්ධයෙන් මෙබඳු දැඩි භය සංඥාවක් පහළ වන්නේ නම්, ඔහුට හෝ ඇයට මෙය අපේක්ෂා කළ හැකිය: පාචිත්තිය ධර්මයකට නොවැටුණු තැනැත්තා පාචිත්තිය ධර්මයකට නොවැටෙනු ඇත, පාචිත්තිය ධර්මයකට වැටුණු තැනැත්තා ධර්මයට අනුව එයට පිළියම් කරනු ඇත.\n\nභික්ෂූනි, යම් සේ එක් පුරුෂයෙක් කළු වස්ත්‍රයක් හැඳ, කෙස් අවුල් කර, මහජනයා වෙත එළඹ, මෙසේ කියන්නේද: “ස්වාමීනි, මා විසින් වරදක් ලෙස පෙන්වා දිය යුතු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කරන ලදි. ආයුෂ්මත්වරුන් මා කෙරෙහි සතුටු වන ලෙස මම කටයුතු කරමි” කියා. එහි සිටි යම්කිසි පුරුෂයකුට මෙසේ සිතෙන්නේය: “ඇත්තෙන්ම, පින්වත්නි, මේ පුරුෂයා වරදක් ලෙස පෙන්වා දිය යුතු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කළේය. මක්නිසාද යත්, ඔහු කළු වස්ත්‍රයක් හැඳ, කෙස් අවුල් කර, මහජනයා වෙත එළඹ, ‘ස්වාමීනි, මා විසින් වරදක් ලෙස පෙන්වා දිය යුතු වූ, නින්දාවට ලක් කළ යුතු වූ පාප ක්‍රියාවක් කරන ලදි; ආයුෂ්මත්වරුන් මා කෙරෙහි සතුටු වන ලෙස මම කටයුතු කරමි’ යැයි කියන්නේය. මා නම් එවැනි නින්දාවට ලක් කළ යුතු, වරදක් ලෙස පෙන්වා දිය යුතු වූ පාප ක්‍රියාවක් නොකරන්නෙමි” කියා.\n\nමහණෙනි, යම් භික්ෂුවකට හෝ භික්ෂුණියකට පාටිදේසනීය ආපත්ති ධර්‍මයන් සම්බන්ධයෙන් මෙබඳු දැඩි භය සංඥාවක් උපදින්නේද, ඔහුට හෝ ඇයට මෙය අපේක්ෂා කළ හැකියි – පාටිදේසනීය ආපත්තියකට පත් නොවූයේ නම්, ඔහු එයට පත් නොවන්නේය; පාටිදේසනීය ආපත්තියකට පත් වූයේ නම්, ධර්‍මානුකූලව එය පිළිසකර කරන්නේය. මහණෙනි, මේවා ආපත්ති භය සතරයි.",
      "paliTitle": "Āpattibhayasuttaṃ"
    },
    {
      "number": 245,
      "pali": "‘‘Sikkhānisaṃsamidaṃ, bhikkhave, brahmacariyaṃ vussati paññuttaraṃ vimuttisāraṃ satādhipateyyaṃ. Kathañca, bhikkhave, sikkhānisaṃsaṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ ābhisamācārikā sikkhā paññattā appasannānaṃ pasādāya pasannānaṃ bhiyyobhāvāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ ābhisamācārikā sikkhā paññattā appasannānaṃ pasādāya pasannānaṃ bhiyyobhāvāya tathā tathā so tassā sikkhāya akhaṇḍakārī hoti acchiddakārī asabalakārī akammāsakārī, samādāya sikkhati sikkhāpadesu. ‘‘Puna caparaṃ, bhikkhave, mayā sāvakānaṃ ādibrahmacariyikā sikkhā paññattā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ ādibrahmacariyikā sikkhā paññattā sabbaso sammā dukkhakkhayāya tathā tathā so tassā sikkhāya akhaṇḍakārī hoti acchiddakārī asabalakārī akammāsakārī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, sikkhānisaṃsaṃ hoti. ‘‘Kathañca, bhikkhave, paññuttaraṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya tathā tathāssa te dhammā paññāya samavekkhitā honti. Evaṃ kho, bhikkhave, paññuttaraṃ hoti. ‘‘Kathañca, bhikkhave, vimuttisāraṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya tathā tathāssa te dhammā vimuttiyā phusitā honti. Evaṃ kho, bhikkhave, vimuttisāraṃ hoti. ‘‘Kathañca, bhikkhave, satādhipateyyaṃ hoti? ‘Iti aparipūraṃ vā ābhisamācārikaṃ sikkhaṃ paripūressāmi, paripūraṃ vā ābhisamācārikaṃ sikkhaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti aparipūraṃ vā ādibrahmacariyikaṃ sikkhaṃ paripūressāmi, paripūraṃ vā ādibrahmacariyikaṃ sikkhaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti asamavekkhitaṃ vā dhammaṃ paññāya samavekkhissāmi, samavekkhitaṃ vā dhammaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti aphusitaṃ vā dhammaṃ vimuttiyā phusissāmi, phusitaṃ vā dhammaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. Evaṃ kho, bhikkhave, satādhipateyyaṃ hoti. ‘Sikkhānisaṃsamidaṃ, bhikkhave, brahmacariyaṃ vussati paññuttaraṃ vimuttisāraṃ satādhipateyya’nti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Tatiyaṃ.",
      "english": "Monks, this holy life is lived with training as its benefit, supreme through wisdom, with liberation as its essence, and with mindfulness as its chief principle.\n\nAnd how, monks, is it with training as its benefit? Here, monks, I have laid down for the disciples a training in excellent conduct for the arousing of faith in those who are without faith, and for the increase of faith in those who already have faith. In whatever way, monks, I have laid down for the disciples a training in excellent conduct for the arousing of faith in those without faith and for the increase of faith in those who already have faith, in just that way, one observes that training without breach, without flaw, without blemish, without stain, undertaking and training in the precepts.\n\nFurthermore, monks, I have laid down for the disciples a fundamental training of the holy life for the complete and right destruction of suffering. In whatever way, monks, I have laid down for the disciples a fundamental training of the holy life for the complete and right destruction of suffering, in just that way, one observes that training without breach, without flaw, without blemish, without stain, undertaking and training in the precepts. It is in this way, monks, that it has training as its benefit.\n\nAnd how, monks, is it supreme through wisdom? Here, monks, I have expounded the teachings for the disciples for the complete and right destruction of suffering. In whatever way, monks, I have expounded the teachings for the disciples for the complete and right destruction of suffering, in just that way, those teachings are thoroughly investigated by one with wisdom. It is in this way, monks, that it is supreme through wisdom.\n\nAnd how, monks, is it with liberation as its essence? Here, monks, I have expounded the teachings for the disciples for the complete and right destruction of suffering. In whatever way, monks, I have expounded the teachings for the disciples for the complete and right destruction of suffering, in just that way, those teachings are directly realized by one through liberation. It is in this way, monks, that it has liberation as its essence.\n\nAnd how, monks, is it with mindfulness as its chief principle? One’s mindfulness is well-established internally with the thought: ‘I shall complete any incomplete training in excellent conduct, or I shall sustain the complete training in excellent conduct here and there with wisdom.’ One’s mindfulness is well-established internally with the thought: ‘I shall complete any incomplete fundamental training of the holy life, or I shall sustain the complete fundamental training of the holy life here and there with wisdom.’ One’s mindfulness is well-established internally with the thought: ‘I shall thoroughly investigate with wisdom any teaching that has not been thoroughly investigated, or I shall sustain with wisdom here and there any teaching that has been thoroughly investigated.’ One’s mindfulness is well-established internally with the thought: ‘I shall directly realize through liberation any teaching that has not been directly realized, or I shall sustain with wisdom here and there any teaching that has been directly realized through liberation.’ It is in this way, monks, that it has mindfulness as its chief principle. When it was said, ‘Monks, this holy life is lived with training as its benefit, supreme through wisdom, with liberation as its essence, and with mindfulness as its chief principle,’ it was said with reference to this.",
      "sinhala": "මහණෙනි, මේ බ්‍රහ්මචර්යාව ශික්‍ෂානිසංස සහිත වූ, ප්‍රඥාව ප්‍රධාන කොට ඇත්තාවූ, විමුක්තිය සාරය කොට ඇත්තාවූ, ස්මෘතිය අධිපති කොට ඇත්තාවූ ලෙස පවත්වනු ලැබේ.\n\nමහණෙනි, කෙසේ නම් ශික්‍ෂානිසංස සහිත වේ ද? මහණෙනි, මේ ශාසනයෙහි මා විසින් ශ්‍රාවකයන්ට අප්‍රසන්න අයගේ ප්‍රසාදය පිණිසත්, ප්‍රසන්න අයගේ වැඩිදියුණුව පිණිසත් ආභිසමාචාරික ශික්‍ෂාව පණවන ලදී. මහණෙනි, මා විසින් ශ්‍රාවකයන්ට අප්‍රසන්න අයගේ ප්‍රසාදය පිණිසත්, ප්‍රසන්න අයගේ වැඩිදියුණුව පිණිසත් යම් යම් පරිදි ආභිසමාචාරික ශික්‍ෂාව පණවන ලද ද, ඒ ඒ පරිදි හේ ඒ ශික්‍ෂාව නොකැඩූ, සිදුරු නොකළ, කැළැල් රහිත, අපවිත්‍ර නොකළ තැනැත්තෙක් වෙමින් ශික්‍ෂාපදයන් සමාදන්ව හික්මෙයි.\n\nමහණෙනි, තවද මා විසින් ශ්‍රාවකයන්ට සියලු දුක් සර්වප්‍රකාරයෙන් ක්ෂය කිරීම පිණිස ආදීබ්‍රහ්මචාරික ශික්‍ෂාව පණවන ලදී. මහණෙනි, මා විසින් ශ්‍රාවකයන්ට සියලු දුක් සර්වප්‍රකාරයෙන් ක්ෂය කිරීම පිණිස යම් යම් පරිදි ආදීබ්‍රහ්මචාරික ශික්‍ෂාව පණවන ලද ද, ඒ ඒ පරිදි හේ ඒ ශික්‍ෂාව නොකැඩූ, සිදුරු නොකළ, කැළැල් රහිත, අපවිත්‍ර නොකළ තැනැත්තෙක් වෙමින් ශික්‍ෂාපදයන් සමාදන්ව හික්මෙයි. මහණෙනි, මෙලෙසින් ම ශික්‍ෂානිසංස සහිත වේ.\n\nමහණෙනි, කෙසේ නම් ප්‍රඥා ප්‍රධාන කොට ඇත්තේ වේ ද? මහණෙනි, මේ ශාසනයෙහි මා විසින් ශ්‍රාවකයන්ට සියලු දුක් සර්වප්‍රකාරයෙන් ක්ෂය කිරීම පිණිස ධර්ම දේශනා කරන ලදී. මහණෙනි, මා විසින් ශ්‍රාවකයන්ට සියලු දුක් සර්වප්‍රකාරයෙන් ක්ෂය කිරීම පිණිස යම් යම් පරිදි ධර්ම දේශනා කරන ලද ද, ඒ ඒ පරිදි ඔහුගේ ඒ ධර්මයන් ප්‍රඥාවෙන් සම්‍යක් ආකාරයෙන් පිරිසිඳ බලන ලද වෙති. මහණෙනි, මෙලෙසින් ම ප්‍රඥා ප්‍රධාන කොට ඇත්තේ වේ.\n\nමහණෙනි, කෙසේ නම් විමුක්තිය සාරය කොට ඇත්තේ වේ ද? මහණෙනි, මේ ශාසනයෙහි මා විසින් ශ්‍රාවකයන්ට සියලු දුක් සර්වප්‍රකාරයෙන් ක්ෂය කිරීම පිණිස ධර්ම දේශනා කරන ලදී. මහණෙනි, මා විසින් ශ්‍රාවකයන්ට සියලු දුක් සර්වප්‍රකාරයෙන් ක්ෂය කිරීම පිණිස යම් යම් පරිදි ධර්ම දේශනා කරන ලද ද, ඒ ඒ පරිදි ඔහුගේ ඒ ධර්මයන් විමුක්තියෙන් ස්පර්ශ කරන ලද වෙති. මහණෙනි, මෙලෙසින් ම විමුක්තිය සාරය කොට ඇත්තේ වේ.\n\nමහණෙනි, කෙසේ නම් ස්මෘතිය අධිපති කොට ඇත්තේ වේ ද? ‘සම්පූර්ණ නොකළ ආභිසමාචාරික ශික්‍ෂාව සම්පූර්ණ කරන්නෙමි, සම්පූර්ණ කරන ලද ආභිසමාචාරික ශික්‍ෂාව ඒ ඒ තැනදී ප්‍රඥාවෙන් දියුණු කරන්නෙමි’ යනුවෙන් ඇතුළතින් ම සිහිය හොඳින් පිහිටා සිටියි. ‘සම්පූර්ණ නොකළ ආදීබ්‍රහ්මචාරික ශික්‍ෂාව සම්පූර්ණ කරන්නෙමි, සම්පූර්ණ කරන ලද ආදීබ්‍රහ්මචාරික ශික්‍ෂාව ඒ ඒ තැනදී ප්‍රඥාවෙන් දියුණු කරන්නෙමි’ යනුවෙන් ඇතුළතින් ම සිහිය හොඳින් පිහිටා සිටියි. ‘ප්‍රඥාවෙන් විමර්ශනය නොකළ ධර්මය ප්‍රඥාවෙන් විමර්ශනය කරන්නෙමි, ප්‍රඥාවෙන් විමර්ශනය කරන ලද ධර්මය ඒ ඒ තැනදී ප්‍රඥාවෙන් දියුණු කරන්නෙමි’ යනුවෙන් ඇතුළතින් ම සිහිය හොඳින් පිහිටා සිටියි. ‘විමුක්තියෙන් ස්පර්ශ නොකළ ධර්මය විමුක්තියෙන් ස්පර්ශ කරන්නෙමි, විමුක්තියෙන් ස්පර්ශ කරන ලද ධර්මය ඒ ඒ තැනදී ප්‍රඥාවෙන් දියුණු කරන්නෙමි’ යනුවෙන් ඇතුළතින් ම සිහිය හොඳින් පිහිටා සිටියි. මහණෙනි, මෙලෙසින් ම ස්මෘතිය අධිපති කොට ඇත්තේ වේ. ‘මහණෙනි, මේ බ්‍රහ්මචර්යාව ශික්‍ෂානිසංස සහිත වූ, ප්‍රඥාව ප්‍රධාන කොට ඇත්තාවූ, විමුක්තිය සාරය කොට ඇත්තාවූ, ස්මෘතිය අධිපති කොට ඇත්තාවූ ලෙස පවත්වනු ලැබේ’ යනුවෙන් යම් ඒ කියන ලද්දේ වේ ද, එය මේ කරුණු අරභයා කියන ලදී.",
      "paliTitle": "Sikkhānisaṃsasuttaṃ"
    },
    {
      "number": 246,
      "pali": "‘‘Catasso imā, bhikkhave, seyyā. Katamā catasso? Petaseyyā, kāmabhogiseyyā, sīhaseyyā, tathāgataseyyā. Katamā ca, bhikkhave, petaseyyā? Yebhuyyena, bhikkhave, petā uttānā senti; ayaṃ vuccati, bhikkhave, petaseyyā. ‘‘Katamā ca, bhikkhave, kāmabhogiseyyā? Yebhuyyena, bhikkhave, kāmabhogī vāmena passena senti; ayaṃ vuccati, bhikkhave, kāmabhogiseyyā. ‘‘Katamā ca, bhikkhave, sīhaseyyā? Sīho, bhikkhave, migarājā dakkhiṇena passena seyyaṃ kappeti, pāde pādaṃ accādhāya, antarasatthimhi naṅguṭṭhaṃ anupakkhipitvā. So paṭibujjhitvā purimaṃ kāyaṃ abbhunnāmetvā pacchimaṃ kāyaṃ anuviloketi. Sace, bhikkhave, sīho migarājā kiñci passati kāyassa vikkhittaṃ vā visaṭaṃ vā, tena, bhikkhave, sīho migarājā anattamano hoti. Sace pana, bhikkhave, sīho migarājā na kiñci passati kāyassa vikkhittaṃ vā visaṭaṃ vā, tena, bhikkhave, sīho migarājā attamano hoti. Ayaṃ vuccati, bhikkhave, sīhaseyyā. ‘‘Katamā ca, bhikkhave, tathāgataseyyā? Idha, bhikkhave, tathāgato vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, tathāgataseyyā. Imā kho, bhikkhave, catasso seyyā’’ti. Catutthaṃ.",
      "english": "These four kinds of rest, monks. Which are these four? The rest of a hungry ghost, the rest of a sensual enjoyer, the lion’s rest, the Tathāgata’s rest.\n\nAnd what, monks, is the rest of a hungry ghost? For the most part, monks, hungry ghosts lie on their backs; this, monks, is called the rest of a hungry ghost.\n\nAnd what, monks, is the rest of a sensual enjoyer? For the most part, monks, sensual enjoyers lie on their left side; this, monks, is called the rest of a sensual enjoyer.\n\nAnd what, monks, is the lion’s rest? Monks, the lion, the king of beasts, lies down on its right side, placing one paw over the other, tucking its tail between its thighs. Having awakened, it raises the front part of its body and surveys the hind part of its body. If, monks, the lion, the king of beasts, sees anything of its body scattered or dishevelled, then, monks, the lion, the king of beasts, is displeased. But if, monks, the lion, the king of beasts, sees nothing of its body scattered or dishevelled, then, monks, the lion, the king of beasts, is pleased. This, monks, is called the lion’s rest.\n\nAnd what, monks, is the Tathāgata’s rest? Here, monks, the Tathāgata, quite secluded from sensual pleasures, secluded from unwholesome states, and so on, enters and dwells in the fourth jhāna. This, monks, is called the Tathāgata’s rest. These, monks, are the four kinds of rest.",
      "sinhala": "භික්ෂූනි, මේ සතර සයනයෝ වෙති. කවර සතරක්ද? ප්‍රේත සයනය, කාමභෝගී සයනය, සිංහ සයනය, තථාගත සයනය යනුවෙනි.\n\nභික්ෂූනි, ප්‍රේත සයනය කවරේද? භික්ෂූනි, බොහෝ විට ප්‍රේතයෝ උඩුකුරුව නිදති. භික්ෂූනි, මෙය ප්‍රේත සයනයයි කියනු ලැබේ.\n\nභික්ෂූනි, කාමභෝගී සයනය කවරේද? භික්ෂූනි, බොහෝ විට කාමභෝගී පුද්ගලයෝ වම් පසින් නිදති. භික්ෂූනි, මෙය කාමභෝගී සයනයයි කියනු ලැබේ.\n\nභික්ෂූනි, සිංහ සයනය කවරේද? භික්ෂූනි, මෘගරාජ වූ සිංහයා දකුණු පසින් හා එක් පයක් තවත් පයක් මත තබා, නගුට කලවා අතරට නවා සයනය කරයි. හෙතෙම අවදි වූ කල්හි පෙරටු කොටස ඔසවා, පසු කොටස නිරීක්ෂණය කරයි. භික්ෂූනි, යම් හෙයකින් මෘගරාජ වූ සිංහයා ශරීරයේ යමක් විසිරී හෝ අවුල් වී හෝ තිබෙනු දුටුවොත්, භික්ෂූනි, එමගින් මෘගරාජ වූ සිංහයා අසතුටට පත් වෙයි. භික්ෂූනි, යම් හෙයකින් මෘගරාජ වූ සිංහයා ශරීරයේ කිසිවක් විසිරී හෝ අවුල් වී හෝ තිබෙනු නොදුටුවොත්, භික්ෂූනි, එමගින් මෘගරාජ වූ සිංහයා සතුටට පත් වෙයි. භික්ෂූනි, මෙය සිංහ සයනයයි කියනු ලැබේ.\n\nභික්ෂූනි, තථාගත සයනය කවරේද? භික්ෂූනි, මෙහිලා තථාගතයන් වහන්සේ කාමයන්ගෙන් වෙන්වම... (පෙ)... සතරවන ධ්‍යානයට එළඹ වාසය කරයි. භික්ෂූනි, මෙය තථාගත සයනයයි කියනු ලැබේ.\n\nභික්ෂූනි, මේ සතර සයනයෝ වෙති.",
      "paliTitle": "Seyyāsuttaṃ"
    },
    {
      "number": 247,
      "pali": "‘‘Cattārome, bhikkhave, thūpārahā. Katame cattāro? Tathāgato arahaṃ sammāsambuddho thūpāraho, paccekabuddho thūpāraho, tathāgatasāvako thūpāraho, rājā cakkavattī thūpāraho – ime kho, bhikkhave, cattāro thūpārahā’’ti. Pañcamaṃ.",
      "english": "Monks, these four are worthy of a stūpa. Which four? The Tathāgata, the Arahant, the Fully Awakened One, is worthy of a stūpa; a Private Buddha is worthy of a stūpa; a disciple of the Tathāgata is worthy of a stūpa; and a Wheel-turning Monarch is worthy of a stūpa. These, monks, are the four worthy of a stūpa.",
      "sinhala": "‘‘මහණෙනි, ස්තූපයන්ට සුදුසු පුද්ගලයෝ මේ සතර දෙනා වෙති. කවරහුද ඒ සතර දෙනා? තථාගත අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ ස්තූපයකට සුදුසුය. පසේබුදුරජාණන් වහන්සේ ස්තූපයකට සුදුසුය. තථාගතයන් වහන්සේගේ ශ්‍රාවක වූ රහත් තෙමේ ස්තූපයකට සුදුසුය. සක්විති රජතෙමේ ස්තූපයකට සුදුසුය. මහණෙනි, මේ සතර දෙනා ස්තූපයන්ට සුදුසු වෙති.’’ පස්වැනි සූත්‍රයයි.",
      "paliTitle": "Thūpārahasuttaṃ"
    },
    {
      "number": 248,
      "pali": "‘‘Cattārome, bhikkhave, dhammā paññāvuddhiyā saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammasavanaṃ, yonisomanasikāro, dhammānudhammappaṭipatti – ime kho, bhikkhave, cattāro dhammā paññāvuddhiyā saṃvattantī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these four things conduce to the growth of wisdom. Which four? Association with admirable people, listening to the True Dhamma, wise attention, and practice in accordance with the Dhamma—indeed, Monks, these four things conduce to the growth of wisdom.",
      "sinhala": "මහණෙනි, මේ ධර්ම හතර ප්‍රඥාව වර්ධනය පිණිස පවතී. ඒ ධර්ම හතර කවරේද? සත්පුරුෂ සේවනය, සද්ධර්ම ශ්‍රවණය, යෝනිසෝමනසිකාරය, ධර්මානුධර්ම ප්‍රතිපත්තියයි. මහණෙනි, මේ ධර්ම හතර ප්‍රඥාව වර්ධනය පිණිස පවතී.",
      "paliTitle": "Paññāvuddhisuttaṃ"
    },
    {
      "number": 249,
      "pali": "‘‘Cattārome, bhikkhave, dhammā manussabhūtassa bahukārā honti. Katame cattāro? Sappurisasaṃsevo, saddhammasavanaṃ, yonisomanasikāro, dhammānudhammappaṭipatti – ime kho, bhikkhave, cattāro dhammā manussabhūtassa bahukārā hontī’’ti. Sattamaṃ.",
      "english": "Monks, these four qualities are of great benefit to a human being. Which four? Association with admirable people, listening to the True Dhamma, wise attention, and practice in accordance with the Dhamma. These, monks, are the four qualities that are of great benefit to a human being.",
      "sinhala": "භික්ෂූණි, මිනිසත් බව ලැබූවෙකුට මේ ධර්ම සතර මහත් උපකාරී වෙත්. කවර සතරක්ද යත්: සත්පුරුෂ සේවනය, සද්ධර්ම ශ්‍ර‍‌වණය, යෝනිසෝමනසිකාරය, ධර්මානුධර්ම ප්‍ර‍‌තිපත්තිය යන මේවායි. භික්ෂූණි, මිනිසත් බව ලැබූවෙකුට මේ ධර්ම සතර මහත් උපකාරී වෙත්.",
      "paliTitle": "Bahukārasuttaṃ"
    },
    {
      "number": 250,
      "pali": "‘‘Cattārome, bhikkhave, anariyavohārā. Katame cattāro? Adiṭṭhe diṭṭhavāditā, asute sutavāditā, amute mutavāditā, aviññāte viññātavāditā – ime kho, bhikkhave, cattāro anariyavohārā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these are the four ignoble ways of speaking. Which four? Speaking of having seen what one has not seen; speaking of having heard what one has not heard; speaking of having sensed what one has not sensed; speaking of having known what one has not known. These, monks, are the four ignoble ways of speaking.",
      "sinhala": "මහණෙනි, මේ අනර්ය ව්‍යවහාරයෝ සතර දෙනෙක් වෙති. කවර සතර දෙනෙක්ද?\n\nතමන් විසින් නුදුටු දෙයක් දුටු බව ප්‍රකාශ කිරීම, තමන් විසින් නෑසූ දෙයක් ඇසූ බව ප්‍රකාශ කිරීම, තමන් විසින් ඉන්ද්‍රියයන්ට ගෝචර නොවූ (නොදැනගත්) දෙයක් එසේ ගෝචර වූ (දැනගත්) බව ප්‍රකාශ කිරීම, තමන් විසින් අවබෝධ නොකළ, නොදැනගත් දෙයක් අවබෝධ කළ බව, දැනගත් බව ප්‍රකාශ කිරීම යන මේවාය. මහණෙනි, සැබවින්ම මේවා සතර අනර්ය ව්‍යවහාරයෝය.",
      "paliTitle": "Paṭhamavohārasuttaṃ"
    },
    {
      "number": 251,
      "pali": "‘‘Cattārome, bhikkhave, ariyavohārā. Katame cattāro? Adiṭṭhe adiṭṭhavāditā, asute asutavāditā, amute amutavāditā, aviññāte aviññātavāditā – ime kho, bhikkhave, cattāro ariyavohārā’’ti. Navamaṃ.",
      "english": "Monks, there are these four noble ways of speaking. Which four? Speaking of the unseen as unseen; speaking of the unheard as unheard; speaking of the unsensed as unsensed; speaking of the uncognized as uncognized. These, monks, are the four noble ways of speaking.",
      "sinhala": "මහණෙනි, මේ ආර්ය ව්‍යවහාර සතරකි. එම සතර කවරේද? නොදුටු දෙය නොදුටු බව කීම, නොඇසූ දෙය නොඇසූ බව කීම, නොදැනුණු දෙය නොදැනුණු බව කීම, නොදැනගත් දෙය නොදැනගත් බව කීමයි. මහණෙනි, නියත වශයෙන්ම මේවා ආර්ය ව්‍යවහාර සතරයි.",
      "paliTitle": "Dutiyavohārasuttaṃ"
    },
    {
      "number": 252,
      "pali": "‘‘Cattārome, bhikkhave, anariyavohārā. Katame cattāro? Diṭṭhe adiṭṭhavāditā, sute asutavāditā, mute amutavāditā, viññāte aviññātavāditā – ime kho, bhikkhave, cattāro anariyavohārā’’ti. Dasamaṃ.",
      "english": "“Monks, these four are ignoble forms of communication. Which four? Speaking of what has been seen as not seen; speaking of what has been heard as not heard; speaking of what has been sensed as not sensed; speaking of what has been cognized as not cognized. These, monks, are the four ignoble forms of communication.”",
      "sinhala": "මහණෙනි, මේ අනාරිය ව්‍යවහාරයෝ සතර දෙනෙක් වෙති.\n\nඒ කවර සතර දෙනෙක්ද?\n\nදුටු දෙය නොදුටු බව කීම, ඇසූ දෙය නොඇසූ බව කීම, ආඝ්‍රාණය කළ, රසවින්දනය කළ හෝ ස්පර්ශ කළ දෙය නොදැනුණු බව කීම, දැනගත් දෙය නොදැනගත් බව කීම යන මේවාය. මහණෙනි, මේවා නම් ඒ අනාරිය ව්‍යවහාරයෝ සතර දෙනාම වෙති.",
      "paliTitle": "Tatiyavohārasuttaṃ"
    },
    {
      "number": 253,
      "pali": "‘‘Cattārome, bhikkhave, ariyavohārā. Katame cattāro? Diṭṭhe diṭṭhavāditā, sute sutavāditā, mute mutavāditā, viññāte viññātavāditā – ime kho, bhikkhave, cattāro ariyavohārā’’ti. Ekādasamaṃ. ",
      "english": "Monastics, there are these four noble ways of speaking. Which four? Speaking of what is seen, as seen; speaking of what is heard, as heard; speaking of what is sensed, as sensed; speaking of what is cognized, as cognized. These, monastics, are the four noble ways of speaking.",
      "sinhala": "මහණෙනි, මේ ආර්ය​ව්‍යවහාර හතරක් ඇත. ඒ කවර හතරක්ද? දිට්ඨ දෙයෙහි, දිට්ඨ යැයි කියනසුලු බව; සුත දෙයෙහි, සුත යැයි කියනසුලු බව; මුත දෙයෙහි, මුත යැයි කියනසුලු බව; විඤ්ඤාත දෙයෙහි, විඤ්ඤාත යැයි කියනසුලු බව යන මේවා යි. මහණෙනි, මේවා ආර්ය​ව්‍යවහාර හතර වේ.",
      "paliTitle": "Catutthavohārasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Āpattibhayavaggo pañcamo. Tassuddānaṃ – Bhedaāpatti sikkhā ca, seyyā thūpārahena ca; Paññāvuddhi bahukārā, vohārā caturo ṭhitāti. Pañcamapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}