{
  "id": "an4.17",
  "title": {
    "pali": "Paṭipadāvaggo",
    "english": "The Section on Practice",
    "sinhala": "ප්‍රතිපදා වර්ගය"
  },
  "sections": [
    {
      "number": 161,
      "pali": "‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā – imā kho, bhikkhave, catasso paṭipadā’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these four courses of practice. Which four? A difficult course of practice with slow direct realization, a difficult course of practice with swift direct realization, a pleasant course of practice with slow direct realization, a pleasant course of practice with swift direct realization – these, monks, are the four courses of practice.",
      "sinhala": "මහණෙනි, මේ පටිපදා සතරක් ඇත. ඒ සතර කවරේද යත්: දුක් සහිත වූත්, මන්ද අභිඥා ඇති වූත් පටිපදාව, දුක් සහිත වූත්, ක්ෂිප්‍රඅභිඥා ඇති වූත් පටිපදාව, සුවපහසු වූත්, මන්ද අභිඥා ඇති වූත් පටිපදාව, සුවපහසු වූත්, ක්ෂිප්‍රඅභිඥා ඇති වූත් පටිපදාව යන මේවාය. මහණෙනි, මේවා ඒ සතර පටිපදා වෙති.",
      "paliTitle": "Saṃkhittasuttaṃ",
      "englishTitle": "The Concise Discourse",
      "sinhalaTitle": "සංඛිප්ත සූත්‍රය"
    },
    {
      "number": 162,
      "pali": "‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. ‘‘Katamā ca, bhikkhave, dukkhā paṭipadā dandhābhiññā? Idha, bhikkhave, ekacco pakatiyāpi tibbarāgajātiko hoti, abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbadosajātiko hoti, abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbamohajātiko hoti, abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā dandhābhiññā. ‘‘Katamā ca, bhikkhave, dukkhā paṭipadā khippābhiññā? Idha, bhikkhave, ekacco pakatiyāpi tibbarāgajātiko hoti, abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbadosajātiko hoti, abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbamohajātiko hoti, abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā khippābhiññā. ‘‘Katamā ca, bhikkhave, sukhā paṭipadā dandhābhiññā? Idha, bhikkhave, ekacco pakatiyāpi na tibbarāgajātiko hoti, nābhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbadosajātiko hoti, nābhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbamohajātiko hoti, nābhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā dandhābhiññā. ‘‘Katamā ca, bhikkhave, sukhā paṭipadā khippābhiññā? Idha, bhikkhave, ekacco pakatiyāpi na tibbarāgajātiko hoti, nābhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbadosajātiko hoti, nābhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbamohajātiko hoti, nābhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā khippābhiññā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Dutiyaṃ.",
      "english": "Monks, these are the four paths of practice. Which four? There is the painful path with slow direct knowledge, the painful path with swift direct knowledge, the pleasant path with slow direct knowledge, and the pleasant path with swift direct knowledge.\n\nAnd what, monks, is the painful path with slow direct knowledge? Here, monks, some individual is by nature prone to intense lust, and repeatedly experiences suffering and mental anguish born of lust. He is by nature prone to intense ill will, and repeatedly experiences suffering and mental anguish born of ill will. He is by nature prone to intense delusion, and repeatedly experiences suffering and mental anguish born of delusion. For such a person, these five faculties arise weakly: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the weakness of these five faculties, he achieves the immediate cessation of the taints slowly. This, monks, is called the painful path with slow direct knowledge.\n\nAnd what, monks, is the painful path with swift direct knowledge? Here, monks, some individual is by nature prone to intense lust, and repeatedly experiences suffering and mental anguish born of lust. He is by nature prone to intense ill will, and repeatedly experiences suffering and mental anguish born of ill will. He is by nature prone to intense delusion, and repeatedly experiences suffering and mental anguish born of delusion. For such a person, these five faculties arise strongly: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the strength of these five faculties, he achieves the immediate cessation of the taints swiftly. This, monks, is called the painful path with swift direct knowledge.\n\nAnd what, monks, is the pleasant path with slow direct knowledge? Here, monks, some individual is by nature not prone to intense lust, and does not repeatedly experience suffering and mental anguish born of lust. He is by nature not prone to intense ill will, and does not repeatedly experience suffering and mental anguish born of ill will. He is by nature not prone to intense delusion, and does not repeatedly experience suffering and mental anguish born of delusion. For such a person, these five faculties arise weakly: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the weakness of these five faculties, he achieves the immediate cessation of the taints slowly. This, monks, is called the pleasant path with slow direct knowledge.\n\nAnd what, monks, is the pleasant path with swift direct knowledge? Here, monks, some individual is by nature not prone to intense lust, and does not repeatedly experience suffering and mental anguish born of lust. He is by nature not prone to intense ill will, and does not repeatedly experience suffering and mental anguish born of ill will. He is by nature not prone to intense delusion, and does not repeatedly experience suffering and mental anguish born of delusion. For such a person, these five faculties arise strongly: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the strength of these five faculties, he achieves the immediate cessation of the taints swiftly. This, monks, is called the pleasant path with swift direct knowledge. These, monks, are the four paths of practice.",
      "sinhala": "මහණෙනි, මේ ප්‍රතිපදා සතරකි. ඒ සතර කවරේද? දුක් සහගත ප්‍රතිපදාව, ප්‍රමාදව අධිගමනය කිරීම සහිත වූවකි. දුක් සහගත ප්‍රතිපදාව, ඉක්මනින් අධිගමනය කිරීම සහිත වූවකි. සුඛ සහගත ප්‍රතිපදාව, ප්‍රමාදව අධිගමනය කිරීම සහිත වූවකි. සුඛ සහගත ප්‍රතිපදාව, ඉක්මනින් අධිගමනය කිරීම සහිත වූවකි.\n\nමහණෙනි, දුක් සහගත ප්‍රතිපදාව, ප්‍රමාදව අධිගමනය කිරීම සහිත වූව කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ස්වභාවයෙන්ම තීව්‍ර රාගයෙන් යුක්ත වෙයි. ඔහු නිතරම රාගය නිසා උපදින දුකද, දොම්නසද අත්දකී. ස්වභාවයෙන්ම තීව්‍ර ද්වේෂයෙන් යුක්ත වෙයි. ඔහු නිතරම ද්වේෂය නිසා උපදින දුකද, දොම්නසද අත්දකී. ස්වභාවයෙන්ම තීව්‍ර මෝහයෙන් යුක්ත වෙයි. ඔහු නිතරම මෝහය නිසා උපදින දුකද, දොම්නසද අත්දකී. ඔහුට මේ ඉන්ද්‍රිය පස දුබලව පහළ වෙයි – එනම්, ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන ඉන්ද්‍රිය පසය. ඔහු මේ ඉන්ද්‍රිය පස දුබල වීම නිසා ආශ්‍රවයන් ක්ෂය කිරීම සඳහා ප්‍රමාදව ඵලයට පැමිණෙයි. මහණෙනි, මෙය දුක් සහගත ප්‍රතිපදාව, ප්‍රමාදව අධිගමනය කිරීම සහිත වූව යැයි කියනු ලැබේ.\n\nමහණෙනි, දුක් සහගත ප්‍රතිපදාව, ඉක්මනින් අධිගමනය කිරීම සහිත වූව කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ස්වභාවයෙන්ම තීව්‍ර රාගයෙන් යුක්ත වෙයි. ඔහු නිතරම රාගය නිසා උපදින දුකද, දොම්නසද අත්දකී. ස්වභාවයෙන්ම තීව්‍ර ද්වේෂයෙන් යුක්ත වෙයි. ඔහු නිතරම ද්වේෂය නිසා උපදින දුකද, දොම්නසද අත්දකී. ස්වභාවයෙන්ම තීව්‍ර මෝහයෙන් යුක්ත වෙයි. ඔහු නිතරම මෝහය නිසා උපදින දුකද, දොම්නසද අත්දකී. ඔහුට මේ ඉන්ද්‍රිය පස අධිමාත්‍රව පහළ වෙයි – එනම්, ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන ඉන්ද්‍රිය පසය. ඔහු මේ ඉන්ද්‍රිය පස අධිමාත්‍ර වීම නිසා ආශ්‍රවයන් ක්ෂය කිරීම සඳහා ඉක්මනින් ඵලයට පැමිණෙයි. මහණෙනි, මෙය දුක් සහගත ප්‍රතිපදාව, ඉක්මනින් අධිගමනය කිරීම සහිත වූව යැයි කියනු ලැබේ.\n\nමහණෙනි, සුඛ සහගත ප්‍රතිපදාව, ප්‍රමාදව අධිගමනය කිරීම සහිත වූව කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ස්වභාවයෙන්ම තීව්‍ර රාගයෙන් යුක්ත නොවෙයි. ඔහු නිතරම රාගය නිසා උපදින දුකක් හෝ දොම්නසක් අත්නොදකී. ස්වභාවයෙන්ම තීව්‍ර ද්වේෂයෙන් යුක්ත නොවෙයි. ඔහු නිතරම ද්වේෂය නිසා උපදින දුකක් හෝ දොම්නසක් අත්නොදකී. ස්වභාවයෙන්ම තීව්‍ර මෝහයෙන් යුක්ත නොවෙයි. ඔහු නිතරම මෝහය නිසා උපදින දුකක් හෝ දොම්නසක් අත්නොදකී. ඔහුට මේ ඉන්ද්‍රිය පස දුබලව පහළ වෙයි – එනම්, ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන ඉන්ද්‍රිය පසය. ඔහු මේ ඉන්ද්‍රිය පස දුබල වීම නිසා ආශ්‍රවයන් ක්ෂය කිරීම සඳහා ප්‍රමාදව ඵලයට පැමිණෙයි. මහණෙනි, මෙය සුඛ සහගත ප්‍රතිපදාව, ප්‍රමාදව අධිගමනය කිරීම සහිත වූව යැයි කියනු ලැබේ.\n\nමහණෙනි, සුඛ සහගත ප්‍රතිපදාව, ඉක්මනින් අධිගමනය කිරීම සහිත වූව කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ස්වභාවයෙන්ම තීව්‍ර රාගයෙන් යුක්ත නොවෙයි. ඔහු නිතරම රාගය නිසා උපදින දුකක් හෝ දොම්නසක් අත්නොදකී. ස්වභාවයෙන්ම තීව්‍ර ද්වේෂයෙන් යුක්ත නොවෙයි. ඔහු නිතරම ද්වේෂය නිසා උපදින දුකක් හෝ දොම්නසක් අත්නොදකී. ස්වභාවයෙන්ම තීව්‍ර මෝහයෙන් යුක්ත නොවෙයි. ඔහු නිතරම මෝහය නිසා උපදින දුකක් හෝ දොම්නසක් අත්නොදකී. ඔහුට මේ ඉන්ද්‍රිය පස අධිමාත්‍රව පහළ වෙයි – එනම්, ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන ඉන්ද්‍රිය පසය. ඔහු මේ ඉන්ද්‍රිය පස අධිමාත්‍ර වීම නිසා ආශ්‍රවයන් ක්ෂය කිරීම සඳහා ඉක්මනින් ඵලයට පැමිණෙයි. මහණෙනි, මෙය සුඛ සහගත ප්‍රතිපදාව, ඉක්මනින් අධිගමනය කිරීම සහිත වූව යැයි කියනු ලැබේ.\n\nමහණෙනි, මේ ප්‍රතිපදා සතර නම් මේවාය.",
      "paliTitle": "Vitthārasuttaṃ",
      "englishTitle": "The Detailed Discourse",
      "sinhalaTitle": "විත්ථාර සූත්‍රය"
    },
    {
      "number": 163,
      "pali": "‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. ‘‘Katamā ca, bhikkhave, dukkhā paṭipadā dandhābhiññā? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī [paṭikkūlasaññī (sī. syā. kaṃ. pī.)], sabbaloke anabhiratisaññī [anabhiratasaññī (sī. syā. kaṃ. pī.)], sabbasaṅkhāresu aniccānupassī; maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni [sekkhabalāni (syā. kaṃ.)] upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā dandhābhiññā. ‘‘Katamā ca, bhikkhave, dukkhā paṭipadā khippābhiññā? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī; maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ… pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā khippābhiññā. ‘‘Katamā ca, bhikkhave, sukhā paṭipadā dandhābhiññā? Idha bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati; pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati; sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… paññābalaṃ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ… pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā dandhābhiññā. ‘‘Katamā ca, bhikkhave, sukhā paṭipadā khippābhiññā? [kathā. 815 ādayo] Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā khippābhiññā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Tatiyaṃ.",
      "english": "Monks, there are these four paths of practice. Which four? They are: the painful path with slow realization, the painful path with swift realization, the pleasant path with slow realization, and the pleasant path with swift realization.\n\nAnd what, monks, is the painful path with slow realization? Here, monks, a monk dwells contemplating the repulsiveness of the body, perceiving repugnance in food, perceiving dissatisfaction in the whole world, contemplating impermanence in all fabrications; and the perception of death is well-established internally for him. He dwells relying upon these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties manifest as weak: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the weakness of these five faculties, he attains the immediate cessation of the taints slowly. This, monks, is called the painful path with slow realization.\n\nAnd what, monks, is the painful path with swift realization? Here, monks, a monk dwells contemplating the repulsiveness of the body, perceiving repugnance in food, perceiving dissatisfaction in the whole world, contemplating impermanence in all fabrications; and the perception of death is well-established internally for him. He dwells relying upon these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties manifest as strong: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the strength of these five faculties, he attains the immediate cessation of the taints swiftly. This, monks, is called the painful path with swift realization.\n\nAnd what, monks, is the pleasant path with slow realization? Here, monks, quite secluded from sensual pleasures, secluded from unwholesome states, a monk enters and abides in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and pleasure; with the fading away of initial application and sustained application, through the internal assurance and unification of mind, he enters and abides in the second jhāna, which is without initial application and sustained application, born of concentration, and filled with rapture and pleasure; with the fading of rapture as well, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body — that of which the noble ones declare: 'Equanimous and mindful, he dwells in pleasure'; he enters and abides in the third jhāna; with the abandoning of pleasure and the abandoning of pain, and with the previous disappearance of joy and sorrow, he enters and abides in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. He dwells relying upon these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties manifest as weak: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the weakness of these five faculties, he attains the immediate cessation of the taints slowly. This, monks, is called the pleasant path with slow realization.\n\nAnd what, monks, is the pleasant path with swift realization? Here, monks, quite secluded from sensual pleasures, secluded from unwholesome states, a monk enters and abides in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and pleasure; with the fading away of initial application and sustained application, through the internal assurance and unification of mind, he enters and abides in the second jhāna, which is without initial application and sustained application, born of concentration, and filled with rapture and pleasure; with the fading of rapture as well, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body — that of which the noble ones declare: 'Equanimous and mindful, he dwells in pleasure'; he enters and abides in the third jhāna; with the abandoning of pleasure and the abandoning of pain, and with the previous disappearance of joy and sorrow, he enters and abides in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. He dwells relying upon these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties manifest as strong: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Because of the strength of these five faculties, he attains the immediate cessation of the taints swiftly. This, monks, is called the pleasant path with swift realization.\n\nThese, monks, are the four paths of practice.",
      "sinhala": "භික්ෂූනි, මේ ප්‍රතිපදා සතරකි. කවරේද ඒ සතර? දුක්ඛා ප්‍රතිපදා දන්ධාභිඥා, දුක්ඛා ප්‍රතිපදා ක්ෂිප්‍රාභිඥා, සුඛා ප්‍රතිපදා දන්ධාභිඥා, සුඛා ප්‍රතිපදා ක්ෂිප්‍රාභිඥා යන ප්‍රතිපදා සතරයි.\n\nභික්ෂූනි, දුක්ඛා ප්‍රතිපදා දන්ධාභිඥා යනු කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුව කය අශුභ වශයෙන් බලමින් වාසය කරයි. ආහාරයෙහි පිළිකුල් සංඥාවෙන් යුක්තව, සියලු ලෝකයෙහි නොඇලෙන සංඥාවෙන් යුක්තව, සියලු සංස්කාරයන් අනිත්‍ය වශයෙන් බලමින් වාසය කරයි. මරණ සංඥාවද ඔහුට ඇතුළතින් හොඳින් පිහිටා පවතී. ඔහු මේ ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්ය බලය, ප්‍රඥා බලය යන ශෛක්ෂ්‍ය බලධර්ම පහ උපනිශ්‍රය කොටගෙන වාසය කරයි. ඔහුට ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේ ඉන්ද්‍රියයන් පහ මෘදු වශයෙන් පහළ වේ. ඔහු මේ ඉන්ද්‍රියයන් පහේ මෘදුකම නිසා ආශ්‍රවයන් ක්ෂය කිරීම පිණිස මන්දගාමීව, කල්ගතව, (ප්‍රතිඵලයට) පැමිණේ. භික්ෂූනි, මෙය දුක්ඛා ප්‍රතිපදා දන්ධාභිඥා යැයි කියනු ලැබේ.\n\nභික්ෂූනි, දුක්ඛා ප්‍රතිපදා ක්ෂිප්‍රාභිඥා යනු කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුව කය අශුභ වශයෙන් බලමින් වාසය කරයි. ආහාරයෙහි පිළිකුල් සංඥාවෙන් යුක්තව, සියලු ලෝකයෙහි නොඇලෙන සංඥාවෙන් යුක්තව, සියලු සංස්කාරයන් අනිත්‍ය වශයෙන් බලමින් වාසය කරයි. මරණ සංඥාවද ඔහුට ඇතුළතින් හොඳින් පිහිටා පවතී. ඔහු මේ ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්ය බලය, ප්‍රඥා බලය යන ශෛක්ෂ්‍ය බලධර්ම පහ උපනිශ්‍රය කොටගෙන වාසය කරයි. ඔහුට ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේ ඉන්ද්‍රියයන් පහ අධිමාත්‍ර වශයෙන් පහළ වේ. ඔහු මේ ඉන්ද්‍රියයන් පහේ අධිමාත්‍ර භාවය නිසා ආශ්‍රවයන් ක්ෂය කිරීම පිණිස ඉක්මනින්, නොපමාව, (ප්‍රතිඵලයට) පැමිණේ. භික්ෂූනි, මෙය දුක්ඛා ප්‍රතිපදා ක්ෂිප්‍රාභිඥා යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සුඛා ප්‍රතිපදා දන්ධාභිඥා යනු කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක සහ විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මයෙහි පැහැදීම ඇති කල්හි, සිතේ එකඟ බව ඇති කල්හි, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සුඛය ඇති ද්විතීය ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියද දුරු කිරීමෙන් උපේක්ෂා සහගතව වාසය කරයි. සිහි නුවණින් යුක්තව, ශරීරයෙන්ද සැප විඳියි. යම් ඒ (පුද්ගලයා) ‘උපේක්ෂා සහගතය, සිහි නුවණින් යුක්තය, සැප විහරණයෙන් යුක්තය’ යැයි ආර්යයන් කියත්ද, එවැනි වූ තෘතිය ධ්‍යානයට පැමිණ වාසය කරයි. සැපයද දුරු කිරීමෙන්, දුකද දුරු කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන් අන්තර්ගත වීමෙන්, දුක්ද නොවන සැපද නොවන, උපේක්ෂාවෙන් හා ස්මෘතියෙන් පිරිසිදු වූ චතුර්ථ ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්ය බලය, ප්‍රඥා බලය යන ශෛක්ෂ්‍ය බලධර්ම පහ උපනිශ්‍රය කොටගෙන වාසය කරයි. ඔහුට ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේ ඉන්ද්‍රියයන් පහ මෘදු වශයෙන් පහළ වේ. ඔහු මේ ඉන්ද්‍රියයන් පහේ මෘදුකම නිසා ආශ්‍රවයන් ක්ෂය කිරීම පිණිස මන්දගාමීව, කල්ගතව, (ප්‍රතිඵලයට) පැමිණේ. භික්ෂූනි, මෙය සුඛා ප්‍රතිපදා දන්ධාභිඥා යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සුඛා ප්‍රතිපදා ක්ෂිප්‍රාභිඥා යනු කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක සහ විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මයෙහි පැහැදීම ඇති කල්හි, සිතේ එකඟ බව ඇති කල්හි, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සුඛය ඇති ද්විතීය ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියද දුරු කිරීමෙන් උපේක්ෂා සහගතව වාසය කරයි. සිහි නුවණින් යුක්තව, ශරීරයෙන්ද සැප විඳියි. යම් ඒ (පුද්ගලයා) ‘උපේක්ෂා සහගතය, සිහි නුවණින් යුක්තය, සැප විහරණයෙන් යුක්තය’ යැයි ආර්යයන් කියත්ද, එවැනි වූ තෘතිය ධ්‍යානයට පැමිණ වාසය කරයි. සැපයද දුරු කිරීමෙන්, දුකද දුරු කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන් අන්තර්ගත වීමෙන්, දුක්ද නොවන සැපද නොවන, උපේක්ෂාවෙන් හා ස්මෘතියෙන් පිරිසිදු වූ චතුර්ථ ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්ය බලය, ප්‍රඥා බලය යන ශෛක්ෂ්‍ය බලධර්ම පහ උපනිශ්‍රය කොටගෙන වාසය කරයි. ඔහුට ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේ ඉන්ද්‍රියයන් පහ අධිමාත්‍ර වශයෙන් පහළ වේ. ඔහු මේ ඉන්ද්‍රියයන් පහේ අධිමාත්‍ර භාවය නිසා ආශ්‍රවයන් ක්ෂය කිරීම පිණිස ඉක්මනින්, නොපමාව, (ප්‍රතිඵලයට) පැමිණේ. භික්ෂූනි, මෙය සුඛා ප්‍රතිපදා ක්ෂිප්‍රාභිඥා යැයි කියනු ලැබේ. භික්ෂූනි, මේ ප්‍රතිපදා සතර නම් මේවායයි.",
      "paliTitle": "Asubhasuttaṃ",
      "englishTitle": "Discourse on the Unlovely",
      "sinhalaTitle": "අසුභසූත‍්‍රය"
    },
    {
      "number": 164,
      "pali": "‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Akkhamā paṭipadā, khamā paṭipadā, damā paṭipadā, samā paṭipadā. Katamā ca, bhikkhave, akkhamā paṭipadā? Idha, bhikkhave, ekacco [ekacco puggalo (sī. syā. kaṃ.)] akkosantaṃ paccakkosati, rosantaṃ paṭirosati, bhaṇḍantaṃ paṭibhaṇḍati. Ayaṃ vuccati, bhikkhave, akkhamā paṭipadā. ‘‘Katamā ca, bhikkhave, khamā paṭipadā? Idha, bhikkhave, ekacco akkosantaṃ na paccakkosati, rosantaṃ na paṭirosati, bhaṇḍantaṃ na paṭibhaṇḍati. Ayaṃ vuccati, bhikkhave, khamā paṭipadā. ‘‘Katamā ca, bhikkhave, damā paṭipadā? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. Ayaṃ vuccati, bhikkhave, damā paṭipadā. ‘‘Katamā ca, bhikkhave, samā paṭipadā? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti; uppannaṃ byāpādavitakkaṃ… pe… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti. Ayaṃ vuccati, bhikkhave, samā paṭipadā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Catutthaṃ.",
      "english": "Monks, there are these four practices. Which four? The practice of non-forbearance, the practice of forbearance, the practice of taming, and the practice of tranquilizing.\n\nAnd what, monks, is the practice of non-forbearance? Here, monks, some individual reviles one who reviles him, is angry at one who is angry at him, quarrels with one who quarrels with him. This, monks, is called the practice of non-forbearance.\n\nAnd what, monks, is the practice of forbearance? Here, monks, some individual does not revile one who reviles him, is not angry at one who is angry at him, does not quarrel with one who quarrels with him. This, monks, is called the practice of forbearance.\n\nAnd what, monks, is the practice of taming? Here, monks, a monk, having seen a form with the eye, does not grasp at its general appearance nor at its details; because if the eye faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might overwhelm him. For its restraint, he practices; he guards the eye faculty; he undertakes the restraint of the eye faculty. Having heard a sound with the ear, he does not grasp at its general appearance nor at its details; because if the ear faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might overwhelm him. For its restraint, he practices; he guards the ear faculty; he undertakes the restraint of the ear faculty. Having smelled an odor with the nose, he does not grasp at its general appearance nor at its details; because if the nose faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might overwhelm him. For its restraint, he practices; he guards the nose faculty; he undertakes the restraint of the nose faculty. Having tasted a flavor with the tongue, he does not grasp at its general appearance nor at its details; because if the tongue faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might overwhelm him. For its restraint, he practices; he guards the tongue faculty; he undertakes the restraint of the tongue faculty. Having felt a tactile sensation with the body, he does not grasp at its general appearance nor at its details; because if the body faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might overwhelm him. For its restraint, he practices; he guards the body faculty; he undertakes the restraint of the body faculty. Having cognized a mental phenomenon with the mind, he does not grasp at its general appearance nor at its details; because if the mind faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might overwhelm him. For its restraint, he practices; he guards the mind faculty; he undertakes the restraint of the mind faculty. This, monks, is called the practice of taming.\n\nAnd what, monks, is the practice of tranquilizing? Here, monks, a monk does not tolerate an arisen thought of sensual desire; he abandons it, dispels it, puts an end to it, makes it disappear. An arisen thought of ill-will, he does not tolerate; he abandons it, dispels it, puts an end to it, makes it disappear. An arisen thought of harming, he does not tolerate; he abandons it, dispels it, puts an end to it, makes it disappear. Any evil unwholesome states that have arisen, he does not tolerate; he abandons them, dispels them, puts an end to them, makes them disappear. This, monks, is called the practice of tranquilizing. These, monks, are the four practices.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ප්‍රතිපදා සතරකි. ඒ සතර කවරේද? අක්ෂමා ප්‍රතිපදාව, ක්ෂමා ප්‍රතිපදාව, දම ප්‍රතිපදාව, ශම ප්‍රතිපදාවයි.\n\nභික්ෂූන් වහන්ස, අක්ෂමා ප්‍රතිපදාව කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැම් අයෙක් අක්‍රෝශ කරන්නාට ප්‍රතිඅක්‍රෝශ කරයි, ක්‍රෝධ කරන්නාට ප්‍රතික්‍රෝධ කරයි, අඬදබර කරන්නාට ප්‍රතිඅඬදබර කරයි. භික්ෂූන් වහන්ස, මෙය අක්ෂමා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ක්ෂමා ප්‍රතිපදාව කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැම් අයෙක් අක්‍රෝශ කරන්නාට ප්‍රතිඅක්‍රෝශ නොකරයි, ක්‍රෝධ කරන්නාට ප්‍රතික්‍රෝධ නොකරයි, අඬදබර කරන්නාට ප්‍රතිඅඬදබර නොකරයි. භික්ෂූන් වහන්ස, මෙය ක්ෂමා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දම ප්‍රතිපදාව කවරේද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුවක් ඇසින් රූපයක් දැක, එහි සාමාන්‍ය ලක්ෂණ හෝ විස්තරාත්මක ලක්ෂණ නොගනී; යම් හෙයකින් ඔහුගේ චක්ෂුරින්ද්‍රිය අසංවරව වාසය කරන කල්හි, ලෝභය හා ද්වේෂය සහිත වූ පව්කාර අකුසල ධර්මයන් හටගන්නේ නම්, ඒවා වැළැක්වීම පිණිස පිළිපදියි; ඔහු චක්ෂුරින්ද්‍රිය රකී; චක්ෂුරින්ද්‍රියෙහි සංවරයට පැමිණෙයි. කනින් ශබ්දයක් අසා... නාසයෙන් ගඳක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් ස්පර්ශයක් ස්පර්ශ කොට... මනසින් ධර්මයක් දැන, එහි සාමාන්‍ය ලක්ෂණ හෝ විස්තරාත්මක ලක්ෂණ නොගනී; යම් හෙයකින් ඔහුගේ මනින්ද්‍රිය අසංවරව වාසය කරන කල්හි, ලෝභය හා ද්වේෂය සහිත වූ පව්කාර අකුසල ධර්මයන් හටගන්නේ නම්, ඒවා වැළැක්වීම පිණිස පිළිපදියි; ඔහු මනින්ද්‍රිය රකී; මනින්ද්‍රියෙහි සංවරයට පැමිණෙයි. භික්ෂූන් වහන්ස, මෙය දම ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ශම ප්‍රතිපදාව කවරේද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුවක් උපන් කාමවිතර්කයක් ඉවසන්නේ නැත, එය පහකරයි, දුරුකරයි, සංසිඳවයි, නැතිකරයි, අභාවයට පත්කරයි; උපන් ව්‍යාපාදවිතර්කයක් ද... (මේ අයුරින්ම)... උපන් විහිංසාවිතර්කයක් ද... උපනුපන් පව්කාර අකුසල ධර්මයන් ඉවසන්නේ නැත, ඒවා පහකරයි, දුරුකරයි, සංසිඳවයි, නැතිකරයි, අභාවයට පත්කරයි. භික්ෂූන් වහන්ස, මෙය ශම ප්‍රතිපදාව යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මේ සතර ප්‍රතිපදාවෝ ය.",
      "paliTitle": "Paṭhamakhamasuttaṃ",
      "englishTitle": "The First Sutta on Forbearance",
      "sinhalaTitle": "පළමු ක්ෂම සූත්‍රය"
    },
    {
      "number": 165,
      "pali": "‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Akkhamā paṭipadā, khamā paṭipadā, damā paṭipadā, samā paṭipadā. ‘‘Katamā ca, bhikkhave, akkhamā paṭipadā? Idha, bhikkhave, ekacco akkhamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ anadhivāsakajātiko hoti. Ayaṃ vuccati, bhikkhave, akkhamā paṭipadā. ‘‘Katamā ca, bhikkhave, khamā paṭipadā? Idha, bhikkhave, ekacco khamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Ayaṃ vuccati, bhikkhave, khamā paṭipadā. ‘‘Katamā ca, bhikkhave, damā paṭipadā? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti…pe… sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. Ayaṃ vuccati, bhikkhave, damā paṭipadā. ‘‘Katamā ca, bhikkhave, samā paṭipadā? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ… pe… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti. Ayaṃ vuccati, bhikkhave, samā paṭipadā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Pañcamaṃ.",
      "english": "Monks, these are the four paths of practice. Which four? The path of impatience, the path of forbearance, the path of self-restraint, and the path of tranquility.\n\nAnd what, monks, is the path of impatience? Here, monks, a certain individual is impatient with cold, heat, hunger, thirst, the touch of gnats, mosquitoes, wind, sun, and creeping things, with ill-spoken, unwelcome words, and with bodily feelings that arise—painful, sharp, severe, piercing, disagreeable, unpleasant, life-threatening. Such a one is unable to endure them. This, monks, is called the path of impatience.\n\nAnd what, monks, is the path of forbearance? Here, monks, a certain individual is forbearing with cold, heat, hunger, thirst, the touch of gnats, mosquitoes, wind, sun, and creeping things, with ill-spoken, unwelcome words, and with bodily feelings that arise—painful, sharp, severe, piercing, disagreeable, unpleasant, life-threatening. Such a one is able to endure them. This, monks, is called the path of forbearance.\n\nAnd what, monks, is the path of self-restraint? Here, monks, a monastic, having seen a form with the eye, is not caught up in its general appearance. Having heard a sound with the ear... having smelt an odor with the nose... having tasted a flavor with the tongue... having felt a tactile sensation with the body... having cognized a mental phenomenon with the mind, he is not caught up in its general appearance nor in its specific details. He practices for the restraint of that mental faculty by which, if it were to remain unrestrained, evil unwholesome states of covetousness and distress might overwhelm him. He guards the mental faculty; he undertakes restraint of the mental faculty. This, monks, is called the path of self-restraint.\n\nAnd what, monks, is the path of tranquility? Here, monks, a monastic does not tolerate an arisen thought of sensual desire; he abandons it, dispels it, puts an end to it, annihilates it, brings it to an end. He does not tolerate an arisen thought of ill-will... he does not tolerate an arisen thought of harmfulness... he does not tolerate any arisen evil unwholesome states; he abandons them, dispels them, puts an end to them, annihilates them, brings them to an end. This, monks, is called the path of tranquility.\n\nThese, monks, are the four paths of practice.",
      "sinhala": "මහණෙනි, මේ ප්‍රතිපදා සතරකි. ඒ සතර කවරේද? අක්ඛමා ප්‍රතිපදාව, ඛමා ප්‍රතිපදාව, දමා ප්‍රතිපදාව, සමා ප්‍රතිපදාවයි.\n\nමහණෙනි, අක්ඛමා ප්‍රතිපදාව කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සීතලට, උෂ්ණයට, බඩගින්නට, පිපාසයට, මැසි-මදුරු, සුළං-හිරුරශ්මි, සර්පයන්ගේ ස්පර්ශයන්ට, නොහොඳින් කියන ලද, නොමනා ලෙසින් පැමිණෙන වචන මාර්ගයන්ට, ඇතිවූ ශාරීරික වේදනාවන් වූ දුක්, තියුණු වූ, රළු වූ, කටුක වූ, අප්‍රිය වූ, අමනාප වූ, ප්‍රාණය නසන සුලු දේවල් නොඉවසන ස්වභාව ඇත්තෙක් වෙයි. මහණෙනි, මෙය අක්ඛමා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nමහණෙනි, ඛමා ප්‍රතිපදාව කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සීතලට, උෂ්ණයට, බඩගින්නට, පිපාසයට, මැසි-මදුරු, සුළං-හිරුරශ්මි, සර්පයන්ගේ ස්පර්ශයන්ට, නොහොඳින් කියන ලද, නොමනා ලෙසින් පැමිණෙන වචන මාර්ගයන්ට, ඇතිවූ ශාරීරික වේදනාවන් වූ දුක්, තියුණු වූ, රළු වූ, කටුක වූ, අප්‍රිය වූ, අමනාප වූ, ප්‍රාණය නසන සුලු දේවල් ඉවසන ස්වභාව ඇත්තෙක් වෙයි. මහණෙනි, මෙය ඛමා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nමහණෙනි, දමා ප්‍රතිපදාව කවරේද? මහණෙනි, මෙහි භික්ෂුවක් ඇසින් රූපයක් දැක, නිමිති නොගන්නා කෙනෙක් වෙයි; කනින් ශබ්දයක් අසා, නිමිති නොගන්නා කෙනෙක් වෙයි; නාසයෙන් ගන්ධයක් ආඝ්‍රාණය කොට, නිමිති නොගන්නා කෙනෙක් වෙයි; දිවෙන් රසයක් විඳ, නිමිති නොගන්නා කෙනෙක් වෙයි; කයින් ස්පර්ශයක් අනුභව කොට, නිමිති නොගන්නා කෙනෙක් වෙයි; මනසින් ධර්‍මයක් දැනගෙන, නිමිති නොගන්නා, අනු ව්‍යංජන නොගන්නා කෙනෙක් වෙයි. යම් අයුරකින් ඔහුගේ මනින්ද්‍රිය අසංවරව වාසය කිරීම නිසා ලෝභය හා ද්වේෂය සහිත පාපී අකුසල ධර්‍මයන්ට ගලාගෙන ඒමට ඉඩ සැලසෙන්නේද, ඒ (මනින්ද්‍රියෙහි) සංවරය සඳහා ප්‍රතිපදාවට එළඹෙයි; මනින්ද්‍රිය රකියි; මනින්ද්‍රියෙහි සංවරය ඇතිකර ගනියි. මහණෙනි, මෙය දමා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nමහණෙනි, සමා ප්‍රතිපදාව කවරේද? මහණෙනි, මෙහි භික්ෂුවක් ඇතිවූ කාම විතර්කය ඉවසා නොසිටියි; ප්‍රහාණය කරයි; දුරුකරයි; සංසිඳවයි; නැතිකර දමයි; අභාවයට පත්කරයි. ඇතිවූ ව්‍යාපාද විතර්කයද, ඇතිවූ විහිංසා විතර්කයද, ඇතිවූ, ඇතිවූ පාපී අකුසල ධර්‍මයන්ද ඉවසා නොසිටියි; ප්‍රහාණය කරයි; දුරුකරයි; සංසිඳවයි; නැතිකර දමයි; අභාවයට පත්කරයි. මහණෙනි, මෙය සමා ප්‍රතිපදාව යැයි කියනු ලැබේ. මහණෙනි, මේ ප්‍රතිපදා සතර නම් මේවාය.",
      "paliTitle": "Dutiyakhamasuttaṃ",
      "englishTitle": "The Second Discourse on Forbearance",
      "sinhalaTitle": "දෙවන ඛම සූත්‍රය"
    },
    {
      "number": 166,
      "pali": "‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. ‘‘Tatra, bhikkhave, yāyaṃ paṭipadā dukkhā dandhābhiññā, ayaṃ, bhikkhave, paṭipadā ubhayeneva hīnā akkhāyati. Yampāyaṃ paṭipadā dukkhā, imināpāyaṃ hīnā akkhāyati; yampāyaṃ paṭipadā dandhā, imināpāyaṃ hīnā akkhāyati. Ayaṃ, bhikkhave, paṭipadā ubhayeneva hīnā akkhāyati. ‘‘Tatra, bhikkhave, yāyaṃ paṭipadā dukkhā khippābhiññā, ayaṃ, bhikkhave, paṭipadā dukkhattā hīnā akkhāyati. ‘‘Tatra, bhikkhave, yāyaṃ paṭipadā sukhā dandhābhiññā, ayaṃ, bhikkhave, paṭipadā dandhattā hīnā akkhāyati. ‘‘Tatra, bhikkhave, yāyaṃ paṭipadā sukhā khippābhiññā, ayaṃ, bhikkhave, paṭipadā ubhayeneva paṇītā akkhāyati. Yampāyaṃ paṭipadā sukhā, imināpāyaṃ paṇītā akkhāyati; yampāyaṃ paṭipadā khippā, imināpāyaṃ paṇītā akkhāyati. Ayaṃ, bhikkhave, paṭipadā ubhayeneva paṇītā akkhāyati. Imā kho, bhikkhave, catasso paṭipadā’’ti. Chaṭṭhaṃ.",
      "english": "\"Monks, there are these four paths of practice. Which four? The path that is painful and slow to comprehend, the path that is painful and quick to comprehend, the path that is pleasant and slow to comprehend, and the path that is pleasant and quick to comprehend.\n\n\"Among these, monks, the path that is painful and slow to comprehend is declared inferior in both respects. Because this path is painful, it is declared inferior in that respect; and because this path is slow, it is declared inferior in that respect. Monks, this path is declared inferior in both respects.\n\n\"Among these, monks, the path that is painful and quick to comprehend is declared inferior because of its painfulness.\n\n\"Among these, monks, the path that is pleasant and slow to comprehend is declared inferior because of its slowness.\n\n\"Among these, monks, the path that is pleasant and quick to comprehend is declared superior in both respects. Because this path is pleasant, it is declared superior in that respect; and because this path is quick, it is declared superior in that respect. Monks, this path is declared superior in both respects.\n\n\"Monks, these are the four paths of practice.\"",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ප්‍රතිපත්ති සතරකි. ඒවා කවරේද? දුක් සහගත ප්‍රතිපදාව, ප්‍රමාදව අවබෝධයට පත්වන; දුක් සහගත ප්‍රතිපදාව, ඉක්මනින් අවබෝධයට පත්වන; සුව සහගත ප්‍රතිපදාව, ප්‍රමාදව අවබෝධයට පත්වන; සුව සහගත ප්‍රතිපදාව, ඉක්මනින් අවබෝධයට පත්වන.\n\nභික්ෂූන් වහන්ස, ඒ ප්‍රතිපත්ති අතරින් යම් මේ ප්‍රතිපදාව දුක් සහගතව ප්‍රමාදව අවබෝධයට පත්වන්නක්ද, භික්ෂූන් වහන්ස, මේ ප්‍රතිපදාව කරුණු දෙකෙන්ම පහත් යැයි කියනු ලැබේ. යම් හෙයකින් මේ ප්‍රතිපදාව දුක් සහගතද, ඒ කරුණ නිසාත් මේ ප්‍රතිපදාව පහත් යැයි කියනු ලැබේ. යම් හෙයකින් මේ ප්‍රතිපදාව ප්‍රමාද සහගතද, ඒ කරුණ නිසාත් මේ ප්‍රතිපදාව පහත් යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මේ ප්‍රතිපදාව කරුණු දෙකෙන්ම පහත් යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ඒ ප්‍රතිපත්ති අතරින් යම් මේ ප්‍රතිපදාව දුක් සහගතව ඉක්මනින් අවබෝධයට පත්වන්නක්ද, භික්ෂූන් වහන්ස, මේ ප්‍රතිපදාව දුක් සහගත භාවය නිසා පහත් යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ඒ ප්‍රතිපත්ති අතරින් යම් මේ ප්‍රතිපදාව සුව සහගතව ප්‍රමාදව අවබෝධයට පත්වන්නක්ද, භික්ෂූන් වහන්ස, මේ ප්‍රතිපදාව ප්‍රමාද භාවය නිසා පහත් යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ඒ ප්‍රතිපත්ති අතරින් යම් මේ ප්‍රතිපදාව සුව සහගතව ඉක්මනින් අවබෝධයට පත්වන්නක්ද, භික්ෂූන් වහන්ස, මේ ප්‍රතිපදාව කරුණු දෙකෙන්ම ප්‍රණීත යැයි කියනු ලැබේ. යම් හෙයකින් මේ ප්‍රතිපදාව සුව සහගතද, ඒ කරුණ නිසාත් මේ ප්‍රතිපදාව ප්‍රණීත යැයි කියනු ලැබේ. යම් හෙයකින් මේ ප්‍රතිපදාව ඉක්මන් සහගතද, ඒ කරුණ නිසාත් මේ ප්‍රතිපදාව ප්‍රණීත යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මේ ප්‍රතිපදාව කරුණු දෙකෙන්ම ප්‍රණීත යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, මේ ප්‍රතිපත්ති සතර මෙයයි.",
      "paliTitle": "Ubhayasuttaṃ",
      "englishTitle": "The Discourse on Both",
      "sinhalaTitle": "උභය සූත‍්‍රය"
    },
    {
      "number": 167,
      "pali": "Atha kho āyasmā sāriputto yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahāmoggallānena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘Catasso imā, āvuso moggallāna, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā. Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ [catassannaṃ paṭipadānaṃ (sī. syā. kaṃ.)] katamaṃ te paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti? ‘‘Catasso imā, āvuso sāriputta, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā. Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ yāyaṃ paṭipadā dukkhā khippābhiññā, imaṃ me paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti. Sattamaṃ.",
      "english": "Then the venerable Sāriputta approached the venerable Mahāmoggallāna. Having approached, he exchanged friendly greetings with the venerable Mahāmoggallāna. Having concluded the courteous and memorable conversation, he sat down to one side. Sitting to one side, the venerable Sāriputta then said to the venerable Mahāmoggallāna: \"Friend Moggallāna, there are these four paths of practice. Which four? The path of practice that is painful with slow realization, the path of practice that is painful with quick realization, the path of practice that is pleasant with slow realization, the path of practice that is pleasant with quick realization. Indeed, friend, these are the four paths of practice. Among these four paths of practice, friend, by relying on which path of practice was your mind liberated from the influxes without clinging?\"\n\n\"Friend Sāriputta, there are these four paths of practice. Which four? The path of practice that is painful with slow realization, the path of practice that is painful with quick realization, the path of practice that is pleasant with slow realization, the path of practice that is pleasant with quick realization. Indeed, friend, these are the four paths of practice. Among these four paths of practice, friend, it was by relying on the path of practice that is painful with quick realization, that my mind was liberated from the influxes without clinging.\"",
      "sinhala": "එවිට ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. එසේ පැමිණ ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු, සිහිකටයුතු කථා බස් හමාර කොට එක් පසෙකින් වැඩහුන්හ. එක් පසෙකින් වැඩහුන් ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේට මෙසේ පැවසූහ: \"ඇවැත් මොග්ගල්ලාන, මේ ප‍්‍රැතිපදා සතරකි. ඒ කවර සතරක්ද? දුක් ප‍්‍රැතිපදාවකි, ප‍්‍රැමාද වී අවබෝධ වන සුළුය. දුක් ප‍්‍රැතිපදාවකි, ඉක්මනින් අවබෝධ වන සුළුය. සැප ප‍්‍රැතිපදාවකි, ප‍්‍රැමාද වී අවබෝධ වන සුළුය. සැප ප‍්‍රැතිපදාවකි, ඉක්මනින් අවබෝධ වන සුළුය. ඇවැත්නි, මේ ප‍්‍රැතිපදා සතර වේ. ඇවැත්නි, මේ ප‍්‍රැතිපදා සතරෙන් ඔබගේ සිත අනුපාදානයෙන් තොරව, ආශ‍්‍රැවයන්ගෙන් මිදුණේ කවර ප‍්‍රැතිපදාවක් අරමුණු කොටගෙනද?\" \"ඇවැත් සාරිපුත්ත, මේ ප‍්‍රැතිපදා සතරකි. ඒ කවර සතරක්ද? දුක් ප‍්‍රැතිපදාවකි, ප‍්‍රැමාද වී අවබෝධ වන සුළුය. දුක් ප‍්‍රැතිපදාවකි, ඉක්මනින් අවබෝධ වන සුළුය. සැප ප‍්‍රැතිපදාවකි, ප‍්‍රැමාද වී අවබෝධ වන සුළුය. සැප ප‍්‍රැතිපදාවකි, ඉක්මනින් අවබෝධ වන සුළුය. ඇවැත්නි, මේ ප‍්‍රැතිපදා සතර වේ. ඇවැත්නි, මේ ප‍්‍රැතිපදා සතරෙන් යම් ප‍්‍රැතිපදාවක් දුක් සහිතව ඉක්මනින් අවබෝධ වන සුළුද, මේ ප‍්‍රැතිපදාව හේතු කොටගෙන මාගේ සිත අනුපාදානයෙන් තොරව ආශ‍්‍රැවයන්ගෙන් මිදුණේය.\"",
      "paliTitle": "Mahāmoggallānasuttaṃ",
      "englishTitle": "The Great Moggallāna Sutta",
      "sinhalaTitle": "මහාමොග්ගල්ලාන සූත‍්‍රය"
    },
    {
      "number": 168,
      "pali": "Atha kho āyasmā mahāmoggallāno yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahāmoggallāno āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Catasso imā, āvuso sāriputta, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā. Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ katamaṃ te paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti? ‘‘Catasso imā, āvuso moggallāna, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā. Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ yāyaṃ paṭipadā sukhā khippābhiññā, imaṃ me paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti. Aṭṭhamaṃ.",
      "english": "Then Venerable Mahāmoggallāna approached where Venerable Sāriputta was. Having approached, he exchanged friendly greetings with Venerable Sāriputta. Having concluded a courteous and memorable conversation, he sat down to one side. As he sat to one side, Venerable Mahāmoggallāna said this to Venerable Sāriputta: “Friend Sāriputta, there are these four paths of practice. Which are these four? A painful path of practice with slow direct knowledge, a painful path of practice with swift direct knowledge, a pleasant path of practice with slow direct knowledge, a pleasant path of practice with swift direct knowledge. These, friend, are the four paths of practice. Of these four paths of practice, friend, relying on which path of practice was your mind liberated from the influxes without clinging?” “Friend Moggallāna, there are these four paths of practice. Which are these four? A painful path of practice with slow direct knowledge, a painful path of practice with swift direct knowledge, a pleasant path of practice with slow direct knowledge, a pleasant path of practice with swift direct knowledge. These, friend, are the four paths of practice. Of these four paths of practice, friend, relying on that path of practice which is pleasant with swift direct knowledge, my mind was liberated from the influxes without clinging.”",
      "sinhala": "ඉන්පසු ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ සමඟ මිත්‍රශීලී වූ ද සිහි කටයුතු වූ ද කතාබහ අවසන් කොට, උන්වහන්සේ එකත්පසෙකින් වාඩි වූහ. එකත්පසෙකින් වාඩි වී සිටි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙය වදාළහ – ‘‘ආයුෂ්මත් සාරිපුත්තයෙනි, මේ ප‍්‍ර​තිපදා සතරකි. ඒ සතර කවරේද? දුෂ්කර ප‍්‍ර​තිපදාවෙන් මන්දගාමී අවබෝධය ලැබීම, දුෂ්කර ප‍්‍ර​තිපදාවෙන් ක්ෂිප‍්‍ර​ අවබෝධය ලැබීම, සුවදායක ප‍්‍ර​තිපදාවෙන් මන්දගාමී අවබෝධය ලැබීම, සුවදායක ප‍්‍ර​තිපදාවෙන් ක්ෂිප‍්‍ර​ අවබෝධය ලැබීම යනුයි. ආයුෂ්මත්නි, මේ ප‍්‍ර​තිපදා සතරයි. ආයුෂ්මත්නි, මේ ප‍්‍ර​තිපදා සතරෙන් ඔබ කුමන ප‍්‍ර​තිපදාවක් උපයෝගී කරගෙන උපාදාන රහිතව ආශ‍්‍ර​වයන්ගෙන් සිත විමුක්ත කළාද?’’ ‘‘ආයුෂ්මත් මොග්ගල්ලානයෙනි, මේ ප‍්‍ර​තිපදා සතරකි. ඒ සතර කවරේද? දුෂ්කර ප‍්‍ර​තිපදාවෙන් මන්දගාමී අවබෝධය ලැබීම, දුෂ්කර ප‍්‍ර​තිපදාවෙන් ක්ෂිප‍්‍ර​ අවබෝධය ලැබීම, සුවදායක ප‍්‍ර​තිපදාවෙන් මන්දගාමී අවබෝධය ලැබීම, සුවදායක ප‍්‍ර​තිපදාවෙන් ක්ෂිප‍්‍ර​ අවබෝධය ලැබීම යනුයි. ආයුෂ්මත්නි, මේ ප‍්‍ර​තිපදා සතරයි. ආයුෂ්මත්නි, මේ ප‍්‍ර​තිපදා සතරෙන් යම් ප‍්‍ර​තිපදාවක් සුවදායක වූ ද, ක්ෂිප‍්‍ර​ අවබෝධය ලබන්නා වූ ද වේ නම්, මම එම ප‍්‍ර​තිපදාව උපයෝගී කරගෙන උපාදාන රහිතව ආශ‍්‍ර​වයන්ගෙන් සිත විමුක්ත කළෙමි.’’\n\nඅට වැන්න.",
      "paliTitle": "Sāriputtasuttaṃ",
      "englishTitle": "Sāriputta Sutta",
      "sinhalaTitle": "සාරිපුත්ත සූත්‍රය"
    },
    {
      "number": 169,
      "pali": "‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti. ‘‘Kathañca, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī. Maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. ‘‘Kathañca, bhikkhave, puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī. Maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā kāyassa bhedā sasaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti. ‘‘Kathañca, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ… pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ… pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. ‘‘Kathañca, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ… pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā kāyassa bhedā asaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ.",
      "english": "Monks, these four individuals are found existing in the world. Which four? Here, monks, a certain individual attains Nibbāna with exertion in this very life. Here, monks, a certain individual attains Nibbāna with exertion after the breaking up of the body. Here, monks, a certain individual attains Nibbāna without exertion in this very life. Here, monks, a certain individual attains Nibbāna without exertion after the breaking up of the body.\n\nAnd how, monks, does an individual attain Nibbāna with exertion in this very life? Here, monks, a monastic dwells contemplating the unloveliness of the body, perceiving repulsiveness in food, perceiving non-delight in the entire world, and contemplating impermanence in all fabrications. Furthermore, the perception of death is well-established internally for him. He dwells relying on these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties become keen: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Due to the keenness of these five faculties, he attains Nibbāna with exertion in this very life. This is how, monks, an individual attains Nibbāna with exertion in this very life.\n\nAnd how, monks, does an individual attain Nibbāna with exertion after the breaking up of the body? Here, monks, a monastic dwells contemplating the unloveliness of the body, perceiving repulsiveness in food, perceiving non-delight in the entire world, and contemplating impermanence in all fabrications. Furthermore, the perception of death is well-established internally for him. He dwells relying on these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties become gentle: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Due to the gentleness of these five faculties, he attains Nibbāna with exertion after the breaking up of the body. This is how, monks, an individual attains Nibbāna with exertion after the breaking up of the body.\n\nAnd how, monks, does an individual attain Nibbāna without exertion in this very life? Here, monks, a monastic, quite secluded from sensual pleasures, secluded from unwholesome states, with thinking and examining, born of seclusion, filled with rapture and pleasure, enters and dwells in the first jhāna. With the fading away of thinking and examining, with the internal stilling and unification of mind, without thinking and examining, born of concentration, filled with rapture and pleasure, he enters and dwells in the second jhāna. With the fading away of rapture, he dwells equanimous, mindful, and clearly comprehending, and experiences pleasure with the body, of which the Noble Ones declare: 'He dwells equanimous, mindful, and blissful.' Thus, he enters and dwells in the third jhāna. With the abandoning of pleasure and pain, and with the prior disappearance of joy and grief, he enters and dwells in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. He dwells relying on these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties become keen: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Due to the keenness of these five faculties, he attains Nibbāna without exertion in this very life. This is how, monks, an individual attains Nibbāna without exertion in this very life.\n\nAnd how, monks, does an individual attain Nibbāna without exertion after the breaking up of the body? Here, monks, a monastic, quite secluded from sensual pleasures, secluded from unwholesome states, with thinking and examining, born of seclusion, filled with rapture and pleasure, enters and dwells in the first jhāna. With the fading away of thinking and examining, with the internal stilling and unification of mind, without thinking and examining, born of concentration, filled with rapture and pleasure, he enters and dwells in the second jhāna. With the fading away of rapture, he dwells equanimous, mindful, and clearly comprehending, and experiences pleasure with the body, of which the Noble Ones declare: 'He dwells equanimous, mindful, and blissful.' Thus, he enters and dwells in the third jhāna. With the abandoning of pleasure and pain, and with the prior disappearance of joy and grief, he enters and dwells in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. He dwells relying on these five strengths of a trainee: the strength of faith, the strength of moral shame, the strength of moral dread, the strength of energy, and the strength of wisdom. For him, these five faculties become gentle: the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Due to the gentleness of these five faculties, he attains Nibbāna without exertion after the breaking up of the body. This is how, monks, an individual attains Nibbāna without exertion after the breaking up of the body. These four individuals, monks, are found existing in the world.",
      "sinhala": "භික්ෂූනි, මේ සතර දෙනෙක් ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. කවරහුද ඒ සතර දෙනා? භික්ෂූනි, මේ ශාසනයෙහි සමහර පුද්ගලයෙක් මේ ආත්මභාවය තුළදී ම සසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, තවත් සමහර පුද්ගලයෙක් කය බිඳී යාමෙන් පසු සසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, තවත් සමහර පුද්ගලයෙක් මේ ආත්මභාවය තුළදී ම අසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, තවත් සමහර පුද්ගලයෙක් කය බිඳී යාමෙන් පසු අසංඛාරපරිනිර්වාණයට පත්වේ.\n\nභික්ෂූනි, කෙසේ නම් පුද්ගලයෙක් මේ ආත්මභාවය තුළදී ම සසංඛාරපරිනිර්වාණයට පත්වේද? භික්ෂූනි, මේ ශාසනයෙහි භික්ෂුවක් කාය අශුභ වශයෙන් අනුපස්සනා කරමින් වාසය කරයි, ආහාරයෙහි පිළිකුල් සංඥාවෙන් යුක්තව වාසය කරයි, සියලු ලෝකයෙහි ඇලීම් රහිත සංඥාවෙන් යුක්තව වාසය කරයි, සියලු සංස්කාරයන් අනිත්‍ය වශයෙන් අනුපස්සනා කරමින් වාසය කරයි. මරණ සංඥාවද ඔහුට අභ්‍යන්තරයෙහි මැනවින් පිහිටා තිබේ. ඔහු මේ පංචශෛක්ෂ්‍ය බලයන් උපනිශ්‍රය කරගෙන වාසය කරයි – ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්යය බලය, ප්‍රඥා බලය යනුයි. ඔහුට මේ පංච ඉන්ද්‍රියෝ අධිමාත්‍ර ලෙස පහළ වෙති – ශ්‍රද්ධේන්ද්‍රිය, වීර්යේන්ද්‍රිය, සතින්ද්‍රිය, සමාධීන්ද්‍රිය, ප්‍රඥේන්ද්‍රිය යනුයි. ඔහු මේ පංච ඉන්ද්‍රියන්ගේ අධිමාත්‍ර බව නිසා මේ ආත්මභාවය තුළදී ම සසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, මෙසේ නම් පුද්ගලයෙක් මේ ආත්මභාවය තුළදී ම සසංඛාරපරිනිර්වාණයට පත්වේ.\n\nභික්ෂූනි, කෙසේ නම් පුද්ගලයෙක් කය බිඳී යාමෙන් පසු සසංඛාරපරිනිර්වාණයට පත්වේද? භික්ෂූනි, මේ ශාසනයෙහි භික්ෂුවක් කාය අශුභ වශයෙන් අනුපස්සනා කරමින් වාසය කරයි, ආහාරයෙහි පිළිකුල් සංඥාවෙන් යුක්තව වාසය කරයි, සියලු ලෝකයෙහි ඇලීම් රහිත සංඥාවෙන් යුක්තව වාසය කරයි, සියලු සංස්කාරයන් අනිත්‍ය වශයෙන් අනුපස්සනා කරමින් වාසය කරයි. මරණ සංඥාවද ඔහුට අභ්‍යන්තරයෙහි මැනවින් පිහිටා තිබේ. ඔහු මේ පංචශෛක්ෂ්‍ය බලයන් උපනිශ්‍රය කරගෙන වාසය කරයි – ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්යය බලය, ප්‍රඥා බලය යනුයි. ඔහුට මේ පංච ඉන්ද්‍රියෝ මෘදු ලෙස පහළ වෙති – ශ්‍රද්ධේන්ද්‍රිය, වීර්යේන්ද්‍රිය, සතින්ද්‍රිය, සමාධීන්ද්‍රිය, ප්‍රඥේන්ද්‍රිය යනුයි. ඔහු මේ පංච ඉන්ද්‍රියන්ගේ මෘදු බව නිසා කය බිඳී යාමෙන් පසු සසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, මෙසේ නම් පුද්ගලයෙක් කය බිඳී යාමෙන් පසු සසංඛාරපරිනිර්වාණයට පත්වේ.\n\nභික්ෂූනි, කෙසේ නම් පුද්ගලයෙක් මේ ආත්මභාවය තුළදී ම අසංඛාරපරිනිර්වාණයට පත්වේද? භික්ෂූනි, මේ ශාසනයෙහි භික්ෂුවක් කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතක්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. විතක්ක විචාරයන් සංසිඳුවාගෙන, තමන් තුළ පැහැදීමෙන්, සිතේ එකඟ බවෙන්, විතක්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීතිය හා සුඛය ඇති ද්විතීය ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියෙන්ද වෙන්ව, උපේක්ෂාවෙන් යුතුව, සිහි නුවණින් යුතුව, කයින්ද සුඛය අනුභව කරමින්, ආර්යයන් උපේක්ෂාවෙන් සිහි නුවණින් යුතුව සුඛ විහරණය කරයි යැයි කියන තෘතීය ධ්‍යානයට පැමිණ වාසය කරයි. සුඛයද ප්‍රහීණ වීමෙන්, දුකද ප්‍රහීණ වීමෙන්, පෙර පැවති සෝමනස්ස දෝමනස්සයන් අතුරුදන් වීමෙන්, දුක් රහිත සුඛ රහිත වූ උපේක්ෂා සති පාරිශුද්ධිය ඇති චතුර්ථ ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ පංචශෛක්ෂ්‍ය බලයන් උපනිශ්‍රය කරගෙන වාසය කරයි – ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්යය බලය, ප්‍රඥා බලය යනුයි. ඔහුට මේ පංච ඉන්ද්‍රියෝ අධිමාත්‍ර ලෙස පහළ වෙති – ශ්‍රද්ධේන්ද්‍රිය, වීර්යේන්ද්‍රිය, සතින්ද්‍රිය, සමාධීන්ද්‍රිය, ප්‍රඥේන්ද්‍රිය යනුයි. ඔහු මේ පංච ඉන්ද්‍රියන්ගේ අධිමාත්‍ර බව නිසා මේ ආත්මභාවය තුළදී ම අසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, මෙසේ නම් පුද්ගලයෙක් මේ ආත්මභාවය තුළදී ම අසංඛාරපරිනිර්වාණයට පත්වේ.\n\nභික්ෂූනි, කෙසේ නම් පුද්ගලයෙක් කය බිඳී යාමෙන් පසු අසංඛාරපරිනිර්වාණයට පත්වේද? භික්ෂූනි, මේ ශාසනයෙහි භික්ෂුවක් කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතක්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. විතක්ක විචාරයන් සංසිඳුවාගෙන, තමන් තුළ පැහැදීමෙන්, සිතේ එකඟ බවෙන්, විතක්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීතිය හා සුඛය ඇති ද්විතීය ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියෙන්ද වෙන්ව, උපේක්ෂාවෙන් යුතුව, සිහි නුවණින් යුතුව, කයින්ද සුඛය අනුභව කරමින්, ආර්යයන් උපේක්ෂාවෙන් සිහි නුවණින් යුතුව සුඛ විහරණය කරයි යැයි කියන තෘතීය ධ්‍යානයට පැමිණ වාසය කරයි. සුඛයද ප්‍රහීණ වීමෙන්, දුකද ප්‍රහීණ වීමෙන්, පෙර පැවති සෝමනස්ස දෝමනස්සයන් අතුරුදන් වීමෙන්, දුක් රහිත සුඛ රහිත වූ උපේක්ෂා සති පාරිශුද්ධිය ඇති චතුර්ථ ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ පංචශෛක්ෂ්‍ය බලයන් උපනිශ්‍රය කරගෙන වාසය කරයි – ශ්‍රද්ධා බලය, හිරි බලය, ඔතප්ප බලය, වීර්යය බලය, ප්‍රඥා බලය යනුයි. ඔහුට මේ පංච ඉන්ද්‍රියෝ මෘදු ලෙස පහළ වෙති – ශ්‍රද්ධේන්ද්‍රිය, වීර්යේන්ද්‍රිය, සතින්ද්‍රිය, සමාධීන්ද්‍රිය, ප්‍රඥේන්ද්‍රිය යනුයි. ඔහු මේ පංච ඉන්ද්‍රියන්ගේ මෘදු බව නිසා කය බිඳී යාමෙන් පසු අසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, මෙසේ නම් පුද්ගලයෙක් කය බිඳී යාමෙන් පසු අසංඛාරපරිනිර්වාණයට පත්වේ. භික්ෂූනි, මේ සතර දෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Sasaṅkhārasuttaṃ",
      "englishTitle": "Discourse on the Conditioned",
      "sinhalaTitle": "සසංඛාර සූත්‍රය"
    },
    {
      "number": 170,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Tatra kho āyasmā ānando bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato ānandassa paccassosuṃ. Āyasmā ānando etadavoca – ‘‘Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā mama santike arahattappattiṃ [arahattappattaṃ (ka.) paṭi. ma. 2.1 paṭisambhidāmaggepi] byākaroti, sabbo so catūhi maggehi, etesaṃ vā aññatarena. ‘‘Katamehi catūhi? Idha, āvuso, bhikkhu samathapubbaṅgamaṃ vipassanaṃ bhāveti. Tassa samathapubbaṅgamaṃ vipassanaṃ bhāvayato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti. ‘‘Puna caparaṃ, āvuso, bhikkhu vipassanāpubbaṅgamaṃ samathaṃ bhāveti. Tassa vipassanāpubbaṅgamaṃ samathaṃ bhāvayato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti. ‘‘Puna caparaṃ, āvuso, bhikkhu samathavipassanaṃ yuganaddhaṃ bhāveti. Tassa samathavipassanaṃ yuganaddhaṃ bhāvayato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti. ‘‘Puna caparaṃ, āvuso, bhikkhuno dhammuddhaccaviggahitaṃ mānasaṃ hoti. Hoti so, āvuso, samayo yaṃ taṃ cittaṃ ajjhattameva santiṭṭhati sannisīdati ekodi hoti samādhiyati. Tassa maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti. ‘‘Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā mama santike arahattappattiṃ byākaroti, sabbo so imehi catūhi maggehi, etesaṃ vā aññatarenā’’ti. Dasamaṃ. ",
      "english": "Thus have I heard – on one occasion, the Venerable Ānanda was staying at Kosambī, in Ghositārāma. There, the Venerable Ānanda addressed the bhikkhus, saying: \"Friends, bhikkhus!\" \"Friend!\" replied those bhikkhus to the Venerable Ānanda. The Venerable Ānanda said this:\n\n\"Any bhikkhu or bhikkhunī, friends, who declares before me their attainment of arahatship, all of them do so through these four paths, or through one of them. Which four?\n\nHere, friends, a bhikkhu develops insight preceded by tranquility. As he develops insight preceded by tranquility, the path arises for him. He cultivates that path, develops it, and makes it extensive. As he cultivates, develops, and makes that path extensive, the fetters are abandoned, and the underlying tendencies cease.\n\nFurthermore, friends, a bhikkhu develops tranquility preceded by insight. As he develops tranquility preceded by insight, the path arises for him. He cultivates that path, develops it, and makes it extensive. As he cultivates, develops, and makes that path extensive, the fetters are abandoned, and the underlying tendencies cease.\n\nFurthermore, friends, a bhikkhu develops tranquility and insight in conjunction. As he develops tranquility and insight in conjunction, the path arises for him. He cultivates that path, develops it, and makes it extensive. As he cultivates, develops, and makes that path extensive, the fetters are abandoned, and the underlying tendencies cease.\n\nFurthermore, friends, a bhikkhu's mind becomes agitated by teachings. There comes a time, friends, when that mind settles down internally, becomes composed, unified, and concentrated. For him, the path arises. He cultivates that path, develops it, and makes it extensive. As he cultivates, develops, and makes that path extensive, the fetters are abandoned, and the underlying tendencies cease.\n\nAny bhikkhu or bhikkhunī, friends, who declares before me their attainment of arahatship, all of them do so through these four paths, or through one of them.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කොසඹෑ නුවර ඝෝෂිතාරාමයෙහි වැඩවසන සේක.\n\nඑහිදී ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා, \"ඇවැත්නි භික්ෂූනි\" යැයි වදාළ සේක. \"ඇවැත්නි\" යැයි ඒ භික්ෂූහු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: \"ඇවැත්නි, යම් කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ මාගේ සමීපයෙහි අරහත්වය අවබෝධ කළ බව ප්‍ර\\u200dකාශ කරන්නේ නම්, ඒ සියල්ලෝම මේ මාර්ග සතරින් හෝ ඉන් එක් මාර්ගයකින් හෝ අරහත්වයට පත් වූවෝ වෙති.\"\n\n\"ඒ මාර්ග සතර කවරේද? ඇවැත්නි, මෙහිලා භික්ෂුවක් සමථය පෙරටු කොට විපස්සනාව වඩයි. සමථය පෙරටු කොට විපස්සනාව වඩන ඔහුට මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි. ඒ මාර්ගය සේවනය කරන, වඩන, බහුල වශයෙන් පුරුදු කරන ඔහුට සංයෝජන ප්‍ර\\u200dහීණ වෙති, අනුසයෝ මුලිනුපුටා දමනු ලබති.\n\nතවද ඇවැත්නි, භික්ෂුවක් විපස්සනාව පෙරටු කොට සමථය වඩයි. විපස්සනාව පෙරටු කොට සමථය වඩන ඔහුට මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි. ඒ මාර්ගය සේවනය කරන, වඩන, බහුල වශයෙන් පුරුදු කරන ඔහුට සංයෝජන ප්‍ර\\u200dහීණ වෙති, අනුසයෝ මුලිනුපුටා දමනු ලබති.\n\nතවද ඇවැත්නි, භික්ෂුවක් සමථය හා විපස්සනාව යුගල වශයෙන් වඩයි. සමථය හා විපස්සනාව යුගල වශයෙන් වඩන ඔහුට මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි. ඒ මාර්ගය සේවනය කරන, වඩන, බහුල වශයෙන් පුරුදු කරන ඔහුට සංයෝජන ප්‍ර\\u200dහීණ වෙති, අනුසයෝ මුලිනුපුටා දමනු ලබති.\n\nතවද ඇවැත්නි, භික්ෂුවකගේ සිත ධර්මය පිළිබඳ උද්ධච්චයෙන් වික්ෂිප්තව පවතී. ඇවැත්නි, යම් කලෙක ඒ සිත අභ්‍ය\\u200dන්තරයෙහිම පිහිටයි, හොඳින් සංසිඳෙයි, ඒකාග්‍ර\\u200d වෙයි, සමාධියට පත්වෙයි. ඔහුට මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි. ඒ මාර්ගය සේවනය කරන, වඩන, බහුල වශයෙන් පුරුදු කරන ඔහුට සංයෝජන ප්‍ර\\u200dහීණ වෙති, අනුසයෝ මුලිනුපුටා දමනු ලබති.\n\nඇවැත්නි, යම් කිසි භික්ෂුවක් හෝ භික්ෂුණියක් හෝ මාගේ සමීපයෙහි අරහත්වය අවබෝධ කළ බව ප්‍ර\\u200dකාශ කරන්නේ නම්, ඒ සියල්ලෝම මේ මාර්ග සතරින් හෝ ඉන් එක් මාර්ගයකින් හෝ අරහත්වයට පත් වූවෝ වෙති\" යැයි (ආනන්ද ස්ථවිරයන් වහන්සේ) වදාළ සේක.",
      "paliTitle": "Yuganaddhasuttaṃ",
      "englishTitle": "Discourse on the Conjoined",
      "sinhalaTitle": "යුගනද්ධ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Paṭipadāvaggo dutiyo. Tassuddānaṃ – Saṃkhittaṃ vitthārāsubhaṃ, dve khamā ubhayena ca; Moggallāno sāriputto, sasaṅkhāraṃ yuganaddhena cāti.",
    "english": "The Second Chapter on Practice",
    "sinhala": "දෙවන ප්‍රතිපදා වර්ගය"
  }
}