{
  "id": "an4.19",
  "title": {
    "pali": "Brāhmaṇavaggo",
    "english": "The Chapter on the Brāhmaṇa",
    "sinhala": "බ්‍රාහ්මණ වග්ගය"
  },
  "sections": [
    {
      "number": 181,
      "pali": "‘‘Catūhi, bhikkhave, aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, yodhājīvo ṭhānakusalo ca hoti, dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu ṭhānakusalo ca hoti, dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā. ‘‘Kathañca, bhikkhave, bhikkhu ṭhānakusalo hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu ṭhānakusalo hoti. ‘‘Kathañca, bhikkhave, bhikkhu dūrepātī hoti? Idha, bhikkhave, bhikkhu yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Evaṃ kho, bhikkhave, bhikkhu dūrepātī hoti. ‘‘Kathañca, bhikkhave, bhikkhu akkhaṇavedhī hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu akkhaṇavedhī hoti. ‘‘Kathañca, bhikkhave, bhikkhu mahato kāyassa padāletā hoti? Idha, bhikkhave, bhikkhu mahantaṃ avijjākkhandhaṃ padāletā. Evaṃ kho, bhikkhave, bhikkhu mahato kāyassa padāletā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Paṭhamaṃ.",
      "english": "Monks, a warrior endowed with four qualities is worthy of the king, fit for royal use, and is considered an integral part of the king. Which four? Here, monks, a warrior is skillful in his stance, one who strikes from afar, one who pierces the vital point, and one who shatters a great host. Monks, a warrior endowed with these four qualities is worthy of the king, fit for royal use, and is considered an integral part of the king.\n\nIn the same way, monks, a monk endowed with four qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverence, an unsurpassed field of merit for the world. Which four? Here, monks, a monk is skillful in his grounding, one who sees and penetrates phenomena, far and near, one who pierces the reality of things, and one who shatters a great mass.\n\nAnd how, monks, is a monk skillful in his grounding? Here, monks, a monk is virtuous; he dwells restrained by the Pāṭimokkha rules, perfect in conduct and resort, seeing danger in the slightest fault, he undertakes and trains himself in the training rules. It is in this way, monks, that a monk is skillful in his grounding.\n\nAnd how, monks, is a monk one who sees and penetrates phenomena, far and near? Here, monks, whatever form — past, future, or present; internal or external; gross or subtle; inferior or excellent; far or near — he sees all such form as ‘This is not mine, I am not this, this is not my self,’ seeing it as it really is with right wisdom. Whatever feeling — past, future, or present; internal or external; gross or subtle; inferior or excellent; far or near — he sees all such feeling as ‘This is not mine, I am not this, this is not my self,’ seeing it as it really is with right wisdom. Whatever perception — past, future, or present; internal or external; gross or subtle; inferior or excellent; far or near — he sees all such perception as ‘This is not mine, I am not this, this is not my self,’ seeing it as it really is with right wisdom. Whatever mental formations — past, future, or present; internal or external; gross or subtle; inferior or excellent; far or near — he sees all such mental formations as ‘This is not mine, I am not this, this is not my self,’ seeing them as they really are with right wisdom. Whatever consciousness — past, future, or present; internal or external; gross or subtle; inferior or excellent; far or near — he sees all such consciousness as ‘This is not mine, I am not this, this is not my self,’ seeing it as it really is with right wisdom. It is in this way, monks, that a monk is one who sees and penetrates phenomena, far and near.\n\nAnd how, monks, is a monk one who pierces the reality of things? Here, monks, a monk understands ‘This is suffering’ as it really is; he understands ‘This is the origin of suffering’ as it really is; he understands ‘This is the cessation of suffering’ as it really is; he understands ‘This is the path leading to the cessation of suffering’ as it really is. It is in this way, monks, that a monk is one who pierces the reality of things.\n\nAnd how, monks, is a monk one who shatters a great mass? Here, monks, a monk shatters the great mass of ignorance. It is in this way, monks, that a monk is one who shatters a great mass.\n\nMonks, a monk endowed with these four qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverence, an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, අංග සතරකින් යුක්ත වූ යෝධ සටන්කරුවා රජුට සුදුසු වේ. රජුගේ භෝගයක් වේ. රජුගේම අංගයක් සේ ගණනට යයි. කවර සතරකින් ද? මහණෙනි, මේ ශාසනයෙහි යෝධ සටන්කරුවා පිහිටීමෙහි දක්ෂ වේ. දුරින් විදින්නා වූවෙක් වේ. නොවරදින ලෙස ඉලක්කය විදින්නා වූවෙක් වේ. මහත් වූ කඳක් දෙදරා බිඳින්නා වූවෙක් වේ. මහණෙනි, මේ අංග සතරින් යුක්ත වූ යෝධ සටන්කරුවා රජුට සුදුසු වේ. රජුගේ භෝගයක් වේ. රජුගේම අංගයක් සේ ගණනට යයි.\n\nමහණෙනි, එපරිද්දෙන්ම ධර්ම සතරකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ. පාහුණෙය්‍ය වේ. දක්ඛිණෙය්‍ය වේ. ඇඳිලි පිදීමට සුදුසු වේ. ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ. කවර සතරකින් ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව පිහිටීමෙහි දක්ෂ වේ. දුරින් විදින්නා වූවෙක් වේ. නොවරදින ලෙස ඉලක්කය විදින්නා වූවෙක් වේ. මහත් වූ කඳක් දෙදරා බිඳින්නා වූවෙක් වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් පිහිටීමෙහි දක්ෂ වේ ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව සිල්වත් වේ. ...[ඉදිරි පාඨයෙහි විස්තර කර ඇති පරිදි]... ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. මහණෙනි, භික්ෂුව මෙසේ පිහිටීමෙහි දක්ෂ වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් දුරින් විදින්නා වූවෙක් වේ ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව අතීත, අනාගත, වර්තමාන වූ, ඇතුළත හෝ පිටත වූ, ස්ථූල හෝ සූක්ෂ්ම වූ, හීන හෝ ප්‍රණීත වූ, දුර හෝ ළඟ වූ යම් රූපයක් වේ ද, ඒ සියලු රූපය ‘මෙය මාගේ නොවේ, මම මෙය නොවෙමි, මෙය මගේ ආත්මය නොවේ’ යි මෙසේ යථාභූත වශයෙන් සම්මා ප්‍රඥාවෙන් දකී. යම්කිසි වේදනාවක් වේ ද... [ඉදිරි පාඨයෙහි විස්තර කර ඇති පරිදි]... යම්කිසි සංඥාවක් වේ ද... යම්කිසි සංස්කාර සමූහයක් වේ ද... අතීත, අනාගත, වර්තමාන වූ, ඇතුළත හෝ පිටත වූ, ස්ථූල හෝ සූක්ෂ්ම වූ, හීන හෝ ප්‍රණීත වූ, දුර හෝ ළඟ වූ යම් විඤ්ඤාණයක් වේ ද, ඒ සියලු විඤ්ඤාණය ‘මෙය මාගේ නොවේ, මම මෙය නොවෙමි, මෙය මගේ ආත්මය නොවේ’ යි මෙසේ යථාභූත වශයෙන් සම්මා ප්‍රඥාවෙන් දකී. මහණෙනි, භික්ෂුව මෙසේ දුරින් විදින්නා වූවෙක් වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් නොවරදින ලෙස ඉලක්කය විදින්නා වූවෙක් වේ ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ‘මෙය දුක ය’ යි යථාභූත වශයෙන් පැහැදිලිව දනී. ...[ඉදිරි පාඨයෙහි විස්තර කර ඇති පරිදි]... ‘මෙය දුක් නිරෝධ ගාමිනී ප්‍රතිපදාව ය’ යි යථාභූත වශයෙන් පැහැදිලිව දනී. මහණෙනි, භික්ෂුව මෙසේ නොවරදින ලෙස ඉලක්කය විදින්නා වූවෙක් වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් මහත් වූ කඳක් දෙදරා බිඳින්නා වූවෙක් වේ ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව මහත් වූ අවිද්‍යාස්කන්ධය පළා දමන්නා වූවෙක් වේ. මහණෙනි, භික්ෂුව මෙසේ මහත් වූ කඳක් දෙදරා බිඳින්නා වූවෙක් වේ. මහණෙනි, මේ ධර්ම සතරින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ. ...[ඉදිරි පාඨයෙහි විස්තර කර ඇති පරිදි]... ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ.",
      "paliTitle": "Yodhājīvasuttaṃ",
      "englishTitle": "The Soldier Discourse",
      "sinhalaTitle": "යෝධාජීව සූත‍්‍රය"
    },
    {
      "number": 182,
      "pali": "[kathā. 624] ‘‘Catunnaṃ, bhikkhave, dhammānaṃ natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ. ‘‘Katamesaṃ catunnaṃ? ‘Jarādhammaṃ mā jīrī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘byādhidhammaṃ mā byādhiyī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘maraṇadhammaṃ mā mīyī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘yāni kho pana tāni pubbe attanā katāni pāpakāni kammāni saṃkilesikāni ponobhavikāni sadarāni dukkhavipākāni āyatiṃ jātijarāmaraṇikāni, tesaṃ vipāko mā nibbattī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ. ‘‘Imesaṃ kho, bhikkhave, catunnaṃ dhammānaṃ natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmi’’nti. Dutiyaṃ.",
      "english": "Bhikkhus, regarding four phenomena, there is no one who can provide a guarantee – neither an ascetic nor a brahmin, neither a deva nor Māra, nor Brahmā, nor anyone else in the world. Which four? There is no one who can provide a guarantee – neither an ascetic nor a brahmin, neither a deva nor Māra, nor Brahmā, nor anyone else in the world – against that which is subject to aging, saying, 'May it not age!'; there is no one who can provide a guarantee – neither an ascetic nor a brahmin, neither a deva nor Māra, nor Brahmā, nor anyone else in the world – against that which is subject to sickness, saying, 'May it not sicken!'; there is no one who can provide a guarantee – neither an ascetic nor a brahmin, neither a deva nor Māra, nor Brahmā, nor anyone else in the world – against that which is subject to death, saying, 'May it not die!'; and there is no one who can provide a guarantee – neither an ascetic nor a brahmin, neither a deva nor Māra, nor Brahmā, nor anyone else in the world – against the unwholesome actions that one has previously performed by oneself, which lead to defilement, which lead to renewed existence, which cause anguish, which result in suffering, and which in the future lead to birth, aging, and death, saying, 'May the consequence of these not arise!' Bhikkhus, regarding these four phenomena, there is no one who can provide a guarantee – neither an ascetic nor a brahmin, neither a deva nor Māra, nor Brahmā, nor anyone else in the world.",
      "sinhala": "මහණෙනි, මේ කරුණු සතරකට කිසිදු ඇපකරුවෙක් – ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ කිසිවෙක් – නැත.\n\nඒ කවර සතරක්ද යත්:\n\n‘දිරායන ස්වභාවය ඇති දෙයක් නොදිරා යේවා’යි කීමට කිසිදු ඇපකරුවෙක් – ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ කිසිවෙක් – නැත; ‘රෝගී වන ස්වභාවය ඇති දෙයක් රෝගී නොවේවා’යි කීමට කිසිදු ඇපකරුවෙක් – ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ කිසිවෙක් – නැත; ‘මරණයට පත්වන ස්වභාවය ඇති දෙයක් නොමරේවා’යි කීමට කිසිදු ඇපකරුවෙක් – ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ කිසිවෙක් – නැත; ‘යම් සත්ත්වයෙක් විසින් පෙර කරන ලද කෙලෙස් උපදවන, නැවත භවයට හේතුවන, ශෝක ඇති කරන, දුක් විපාක දෙන, මතු ජාති, ජරා, මරණ ගෙන දෙන පව්කම් ඇත්ද, ඒ කර්මයන්ගේ විපාක නොහටගනීවා’යි කීමට කිසිදු ඇපකරුවෙක් – ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ කිසිවෙක් – නැත.\n\nමහණෙනි, මේ කරුණු සතරකට කිසිදු ඇපකරුවෙක් – ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දෙවියෙක් හෝ මාරයෙක් හෝ බ්‍රහ්මයෙක් හෝ ලෝකයේ කිසිවෙක් – නැත.",
      "paliTitle": "Pāṭibhogasuttaṃ",
      "englishTitle": "The Discourse on the Guarantor",
      "sinhalaTitle": "ඇප සූත්‍රය"
    },
    {
      "number": 183,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṃ etadavoca – ‘‘Ahañhi, bho gotama, evaṃvādī evaṃdiṭṭhi [evaṃdiṭṭhī (sabbattha)] – ‘yo koci diṭṭhaṃ bhāsati – evaṃ me diṭṭhanti, natthi tato doso; yo koci sutaṃ bhāsati – evaṃ me sutanti, natthi tato doso; yo koci mutaṃ bhāsati – evaṃ me mutanti, natthi tato doso; yo koci viññātaṃ bhāsati – evaṃ me viññātanti, natthi tato doso’’’ti. ‘‘Nāhaṃ, brāhmaṇa, sabbaṃ diṭṭhaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ diṭṭhaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ sutaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ sutaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ mutaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ mutaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ viññātaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ viññātaṃ na bhāsitabbanti vadāmi. ‘‘Yañhi, brāhmaṇa, diṭṭhaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ diṭṭhaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, diṭṭhaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ diṭṭhaṃ bhāsitabbanti vadāmi. ‘‘Yañhi, brāhmaṇa, sutaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ sutaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, sutaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ sutaṃ bhāsitabbanti vadāmi. ‘‘Yañhi, brāhmaṇa, mutaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ mutaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, mutaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ mutaṃ bhāsitabbanti vadāmi. ‘‘Yañhi, brāhmaṇa, viññātaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ viññātaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, viññātaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ viññātaṃ bhāsitabbanti vadāmī’’ti. Atha kho vassakāro brāhmaṇo magadhamahāmatto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā pakkāmīti. Tatiyaṃ.",
      "english": "At one time, the Blessed One was dwelling at Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place.\n\nThen the brahmin Vassakāro, the chief minister of Magadha, approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having exchanged courteous and memorable greetings, he sat down to one side.\n\nSitting to one side, the brahmin Vassakāro, the chief minister of Magadha, said to the Blessed One: \"Indeed, Venerable Gotama, I hold such a doctrine and view: 'Whoever speaks of what is seen, saying \"This is what I have seen,\" there is no fault in that. Whoever speaks of what is heard, saying \"This is what I have heard,\" there is no fault in that. Whoever speaks of what is sensed, saying \"This is what I have sensed,\" there is no fault in that. Whoever speaks of what is cognized, saying \"This is what I have cognized,\" there is no fault in that.'\"\n\n\"Brahmin, I do not say that all that has been seen should be spoken. Nor, brahmin, do I say that all that has been seen should not be spoken. Brahmin, I do not say that all that has been heard should be spoken. Nor, brahmin, do I say that all that has been heard should not be spoken. Brahmin, I do not say that all that has been sensed should be spoken. Nor, brahmin, do I say that all that has been sensed should not be spoken. Brahmin, I do not say that all that has been cognized should be spoken. Nor, brahmin, do I say that all that has been cognized should not be spoken.\n\n\"Indeed, brahmin, if speaking of what has been seen leads to the increase of unwholesome states and the decrease of wholesome states, then I say that such a seen thing should not be spoken. But if, brahmin, not speaking of what has been seen leads to the decrease of wholesome states and the increase of unwholesome states, then I say that such a seen thing should be spoken.\n\n\"Indeed, brahmin, if speaking of what has been heard leads to the increase of unwholesome states and the decrease of wholesome states, then I say that such a heard thing should not be spoken. But if, brahmin, not speaking of what has been heard leads to the decrease of wholesome states and the increase of unwholesome states, then I say that such a heard thing should be spoken.\n\n\"Indeed, brahmin, if speaking of what has been sensed leads to the increase of unwholesome states and the decrease of wholesome states, then I say that such a sensed thing should not be spoken. But if, brahmin, not speaking of what has been sensed leads to the decrease of wholesome states and the increase of unwholesome states, then I say that such a sensed thing should be spoken.\n\n\"Indeed, brahmin, if speaking of what has been cognized leads to the increase of unwholesome states and the decrease of wholesome states, then I say that such a cognized thing should not be spoken. But if, brahmin, not speaking of what has been cognized leads to the decrease of wholesome states and the increase of unwholesome states, then I say that such a cognized thing should be spoken.\"\n\nThen the brahmin Vassakāro, the chief minister of Magadha, having approved of and delighted in the Blessed One's words, rose from his seat and departed.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලන්දක නිවාප නම් ස්ථානයේ වැඩවසන සේක. ඉක්බිති වස්සකාර බ්‍රාහ්මණ නම් මගධ මහඇමති තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ ප්‍රිය සංලාපයද, සිහි කටයුතු වූ කතා බහද පවත්වමින් එක් පසෙකින් වාඩි විය.\n\nඑක් පසෙක වාඩි වී සිටි ඒ වස්සකාර බ්‍රාහ්මණ මගධ මහඇමති තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘භවත් ගෞතමයන් වහන්ස, මා මෙබඳු වාද ඇති, මෙබඳු දෘෂ්ටි ඇති කෙනෙක්මි: ‘යම් කෙනෙක් තමා විසින් දකින ලද දෙයක්, ‘මා විසින් මෙසේ දැක ඇත’ යැයි පවසන්නේ නම්, ඊට දොස් නැත; යම් කෙනෙක් තමා විසින් අසන ලද දෙයක්, ‘මා විසින් මෙසේ අසා ඇත’ යැයි පවසන්නේ නම්, ඊට දොස් නැත; යම් කෙනෙක් තමා විසින් ආඝ්‍රාණය කරන ලද, රස විඳින ලද, ස්පර්ශ කරන ලද දෙයක්, ‘මා විසින් මෙසේ අත්විඳ ඇත’ යැයි පවසන්නේ නම්, ඊට දොස් නැත; යම් කෙනෙක් තමා විසින් අවබෝධ කරන ලද දෙයක්, ‘මා විසින් මෙසේ අවබෝධ කර ඇත’ යැයි පවසන්නේ නම්, ඊට දොස් නැත.’’’\n\n‘‘බ්‍රාහ්මණය, මා විසින් දකින ලද සියල්ල පැවසිය යුතු යැයි මම නොකියමි; එසේම බ්‍රාහ්මණය, මා විසින් දකින ලද කිසිවක් නොපැවසිය යුතු යැයි ද මම නොකියමි. බ්‍රාහ්මණය, මා විසින් අසන ලද සියල්ල පැවසිය යුතු යැයි මම නොකියමි; එසේම බ්‍රාහ්මණය, මා විසින් අසන ලද කිසිවක් නොපැවසිය යුතු යැයි ද මම නොකියමි. බ්‍රාහ්මණය, මා විසින් ආඝ්‍රාණය කරන ලද, රස විඳින ලද, ස්පර්ශ කරන ලද සියල්ල පැවසිය යුතු යැයි මම නොකියමි; එසේම බ්‍රාහ්මණය, මා විසින් ආඝ්‍රාණය කරන ලද, රස විඳින ලද, ස්පර්ශ කරන ලද කිසිවක් නොපැවසිය යුතු යැයි ද මම නොකියමි. බ්‍රාහ්මණය, මා විසින් අවබෝධ කරන ලද සියල්ල පැවසිය යුතු යැයි මම නොකියමි; එසේම බ්‍රාහ්මණය, මා විසින් අවබෝධ කරන ලද කිසිවක් නොපැවසිය යුතු යැයි ද මම නොකියමි.\n\n‘‘බ්‍රාහ්මණය, යමක් දුටු තැනැත්තෙකු කතා කරන විට අකුසල ධර්මයන් වැඩි දියුණු වේද, කුසල ධර්මයන් පිරිහී යේද, මෙබඳු දුටු දෙයක් කතා නොකළ යුතු යැයි මම කියමි. බ්‍රාහ්මණය, යමක් දුටු තැනැත්තෙකු කතා නොකරන විට කුසල ධර්මයන් පිරිහී යේද, අකුසල ධර්මයන් වැඩි දියුණු වේද, මෙබඳු දුටු දෙයක් කතා කළ යුතු යැයි මම කියමි.\n\n‘‘බ්‍රාහ්මණය, යමක් අසන ලද තැනැත්තෙකු කතා කරන විට අකුසල ධර්මයන් වැඩි දියුණු වේද, කුසල ධර්මයන් පිරිහී යේද, මෙබඳු අසන ලද දෙයක් කතා නොකළ යුතු යැයි මම කියමි. බ්‍රාහ්මණය, යමක් අසන ලද තැනැත්තෙකු කතා නොකරන විට කුසල ධර්මයන් පිරිහී යේද, අකුසල ධර්මයන් වැඩි දියුණු වේද, මෙබඳු අසන ලද දෙයක් කතා කළ යුතු යැයි මම කියමි.\n\n‘‘බ්‍රාහ්මණය, යමක් ආඝ්‍රාණය කරන ලද, රස විඳින ලද, ස්පර්ශ කරන ලද තැනැත්තෙකු කතා කරන විට අකුසල ධර්මයන් වැඩි දියුණු වේද, කුසල ධර්මයන් පිරිහී යේද, මෙබඳු ආඝ්‍රාණය කරන ලද, රස විඳින ලද, ස්පර්ශ කරන ලද දෙයක් කතා නොකළ යුතු යැයි මම කියමි. බ්‍රාහ්මණය, යමක් ආඝ්‍රාණය කරන ලද, රස විඳින ලද, ස්පර්ශ කරන ලද තැනැත්තෙකු කතා නොකරන විට කුසල ධර්මයන් පිරිහී යේද, අකුසල ධර්මයන් වැඩි දියුණු වේද, මෙබඳු ආඝ්‍රාණය කරන ලද, රස විඳින ලද, ස්පර්ශ කරන ලද දෙයක් කතා කළ යුතු යැයි මම කියමි.\n\n‘‘බ්‍රාහ්මණය, යමක් අවබෝධ කරන ලද තැනැත්තෙකු කතා කරන විට අකුසල ධර්මයන් වැඩි දියුණු වේද, කුසල ධර්මයන් පිරිහී යේද, මෙබඳු අවබෝධ කරන ලද දෙයක් කතා නොකළ යුතු යැයි මම කියමි. බ්‍රාහ්මණය, යමක් අවබෝධ කරන ලද තැනැත්තෙකු කතා නොකරන විට කුසල ධර්මයන් පිරිහී යේද, අකුසල ධර්මයන් වැඩි දියුණු වේද, මෙබඳු අවබෝධ කරන ලද දෙයක් කතා කළ යුතු යැයි මම කියමි.’’\n\nඉක්බිති වස්සකාර බ්‍රාහ්මණ නම් මගධ මහඇමති තෙමේ භාග්‍යවතුන් වහන්සේගේ වචනය අභිනන්දනය කොට, අනුමෝදන් වී, හුනස්නෙන් නැගිට පිටත් වී ගියේය.",
      "paliTitle": "Sutasuttaṃ",
      "englishTitle": "Discourse on Hearing",
      "sinhalaTitle": "සුත සූත්‍රය"
    },
    {
      "number": 184,
      "pali": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘Ahañhi, bho gotama, evaṃvādī evaṃdiṭṭhi – ‘natthi yo maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassā’’’ti. ‘‘Atthi, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa; atthi pana, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa. ‘‘Katamo ca, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa? Idha, brāhmaṇa, ekacco kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘piyā vata maṃ kāmā jahissanti, piye cāhaṃ kāme jahissāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa. ‘‘Puna caparaṃ, brāhmaṇa, idhekacco kāye avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘piyo vata maṃ kāyo jahissati, piyañcāhaṃ kāyaṃ jahissāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa. ‘‘Puna caparaṃ, brāhmaṇa, idhekacco akatakalyāṇo hoti akatakusalo akatabhīruttāṇo katapāpo kataluddo katakibbiso. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akataṃ vata me kalyāṇaṃ, akataṃ kusalaṃ, akataṃ bhīruttāṇaṃ; kataṃ pāpaṃ, kataṃ luddaṃ, kataṃ kibbisaṃ. Yāvatā, bho, akatakalyāṇānaṃ akatakusalānaṃ akatabhīruttāṇānaṃ katapāpānaṃ kataluddānaṃ katakibbisānaṃ gati taṃ gatiṃ pecca gacchāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa. ‘‘Puna caparaṃ, brāhmaṇa, idhekacco kaṅkhī hoti vicikicchī aniṭṭhaṅgato saddhamme. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘kaṅkhī vatamhi vicikicchī aniṭṭhaṅgato saddhamme’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa. Ime kho, brāhmaṇa, cattāro maraṇadhammā samānā bhāyanti, santāsaṃ āpajjanti maraṇassa. ‘‘Katamo ca, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa? Idha, brāhmaṇa, ekacco kāmesu vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa na evaṃ hoti – ‘piyā vata maṃ kāmā jahissanti, piye cāhaṃ kāme jahissāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa. ‘‘Puna caparaṃ, brāhmaṇa, idhekacco kāye vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa na evaṃ hoti – ‘piyo vata maṃ kāyo jahissati, piyañcāhaṃ kāyaṃ jahissāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa. ‘‘Puna caparaṃ, brāhmaṇa, idhekacco akatapāpo hoti akataluddo akatakibbiso katakalyāṇo katakusalo katabhīruttāṇo. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akataṃ vata me pāpaṃ, akataṃ luddaṃ, akataṃ kibbisaṃ; kataṃ kalyāṇaṃ, kataṃ kusalaṃ, kataṃ bhīruttāṇaṃ. Yāvatā, bho, akatapāpānaṃ akataluddānaṃ akatakibbisānaṃ katakalyāṇānaṃ katakusalānaṃ katabhīruttāṇānaṃ gati taṃ gatiṃ pecca gacchāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa. ‘‘Puna caparaṃ, brāhmaṇa, idhekacco akaṅkhī hoti avicikicchī niṭṭhaṅgato saddhamme. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akaṅkhī vatamhi avicikicchī niṭṭhaṅgato saddhamme’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa. Ime kho, brāhmaṇa, cattāro maraṇadhammā samānā na bhāyanti, na santāsaṃ āpajjanti maraṇassā’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Catutthaṃ.",
      "english": "Then the brahmin Jāṇussoṇi approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable talk, he sat down to one side. As he sat to one side, the brahmin Jāṇussoṇi said to the Blessed One, \"Indeed, Venerable Gotama, I hold this view and doctrine: 'There is no being subject to death who does not fear, who is not terrified by death.'\"\n\n\"Brahmin, there is a being subject to death who fears and is terrified by death; but there is also, brahmin, a being subject to death who does not fear and is not terrified by death.\"\n\n\"And what kind of being, brahmin, subject to death, fears and is terrified by death? Here, brahmin, some person has not overcome passion for sensual pleasures; their desire, affection, craving, feverish longing, and thirst for them has not vanished. Then some severe illness afflicts them. When afflicted by that severe illness, they think, 'Alas, beloved sensual pleasures will leave me, and I will leave my beloved sensual pleasures.' They grieve, lament, weep, beat their breast, and fall into confusion. This, brahmin, is a being subject to death who fears and is terrified by death.\"\n\n\"Furthermore, brahmin, here some person has not overcome passion for the body; their desire, affection, craving, feverish longing, and thirst for it has not vanished. Then some severe illness afflicts them. When afflicted by that severe illness, they think, 'Alas, my beloved body will leave me, and I will leave my beloved body.' They grieve, lament, weep, beat their breast, and fall into confusion. This too, brahmin, is a being subject to death who fears and is terrified by death.\"\n\n\"Furthermore, brahmin, here some person has not done what is wholesome, has not done what is skillful, has not provided protection from danger, but has done evil, has acted cruelly, has committed offenses. Then some severe illness afflicts them. When afflicted by that severe illness, they think, 'Alas, I have not done what is wholesome, I have not done what is skillful, I have not provided protection from danger; I have done evil, I have acted cruelly, I have committed offenses. Whatever destination awaits those who have not done what is wholesome, have not done what is skillful, have not provided protection from danger, but have done evil, have acted cruelly, have committed offenses – to that destination I will go after death.' They grieve, lament, weep, beat their breast, and fall into confusion. This too, brahmin, is a being subject to death who fears and is terrified by death.\"\n\n\"Furthermore, brahmin, here some person is doubtful, wavering, not having attained conviction in the True Dhamma. Then some severe illness afflicts them. When afflicted by that severe illness, they think, 'Alas, I am doubtful, wavering, not having attained conviction in the True Dhamma.' They grieve, lament, weep, beat their breast, and fall into confusion. This too, brahmin, is a being subject to death who fears and is terrified by death. These, brahmin, are the four types of beings subject to death who fear and are terrified by death.\"\n\n\"And what kind of being, brahmin, subject to death, does not fear and is not terrified by death? Here, brahmin, some person has overcome passion for sensual pleasures; their desire, affection, craving, feverish longing, and thirst for them has vanished. Then some severe illness afflicts them. When afflicted by that severe illness, they do not think, 'Beloved sensual pleasures will leave me, and I will leave my beloved sensual pleasures.' They do not grieve, lament, weep, beat their breast, or fall into confusion. This, brahmin, is a being subject to death who does not fear and is not terrified by death.\"\n\n\"Furthermore, brahmin, here some person has overcome passion for the body; their desire, affection, craving, feverish longing, and thirst for it has vanished. Then some severe illness afflicts them. When afflicted by that severe illness, they do not think, 'My beloved body will leave me, and I will leave my beloved body.' They do not grieve, lament, weep, beat their breast, or fall into confusion. This too, brahmin, is a being subject to death who does not fear and is not terrified by death.\"\n\n\"Furthermore, brahmin, here some person has not done evil, has not acted cruelly, has not committed offenses, but has done what is wholesome, has done what is skillful, has provided protection from danger. Then some severe illness afflicts them. When afflicted by that severe illness, they think, 'Alas, I have not done evil, I have not acted cruelly, I have not committed offenses; I have done what is wholesome, I have done what is skillful, I have provided protection from danger. Whatever destination awaits those who have not done evil, have not acted cruelly, have not committed offenses, but have done what is wholesome, have done what is skillful, have provided protection from danger – to that destination I will go after death.'\"\n\nHe does not grieve, does not lament, does not wail, does not beat his breast and cry, nor does he fall into confusion. This one too, O brahmin, though subject to death, does not fear, nor does he fall into terror of death.\n\n\"Furthermore, O brahmin, some individual here is without doubt, free from perplexity, and has arrived at conviction in the true Dhamma. Then some severe illness afflicts him. When afflicted by that severe illness, it occurs to him thus: ‘Indeed, I am without doubt, free from perplexity, and have arrived at conviction in the true Dhamma.’ He does not grieve, does not lament, does not wail, does not beat his breast and cry, nor does he fall into confusion. This one too, O brahmin, though subject to death, does not fear, nor does he fall into terror of death. These, O brahmin, are the four individuals who, though subject to death, do not fear, nor do they fall into terror of death.\"\n\n\"Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as if someone were to set upright what had been overturned, or to reveal what was hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms, even so has the Venerable Gotama expounded the Dhamma in various ways. Let the Venerable Gotama accept me as a lay follower who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "එවිට ජාණුස්සෝණි බමුණා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු සාකච්ඡාවක යෙදුණේය. ප්‍රිය මනාප කථාබහ අවසන් කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ ජාණුස්සෝණි බමුණා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘භවත් ගෞතමයන් වහන්ස, මා මෙබඳු මතයක් දරන්නෙක්මි, මෙබඳු දෘෂ්ටියක් ඇත්තෙක්මි – ‘මරණයට යටත් වූවෙක් සිටී නම්, ඔහු මරණයට නො බිය වන්නේ හෝ තැතිගැනීමකට පත් නොවන්නේ හෝ නැතැයි’’’.\n\n‘‘බමුණ, මරණයට යටත් වූවෙක් සිටී, ඔහු මරණයට බිය වේ, තැතිගැනීමකට පත් වේ. එහෙත් බමුණ, මරණයට යටත් වූවෙක් සිටී, ඔහු මරණයට නො බිය වේ, තැතිගැනීමකට පත් නොවේ.\n\n‘‘බමුණ, මරණයට යටත් වූවන්ගෙන් මරණයට බිය වී, තැතිගැනීමකට පත් වන්නා කවරෙක්ද? බමුණ, මෙහිලා ඇතැමෙක් කාමයන් කෙරෙහි වීතරාගී නොවේ, ඡන්දය පහව ගොස් නැත, ප්‍රේමය පහව ගොස් නැත, පිපාසය පහව ගොස් නැත, දැවිල්ල පහව ගොස් නැත, තණ්හාව පහව ගොස් නැත. එවිට ඔහුව යම් දරුණු රෝගාබාධයක් ස්පර්ශ කරයි. එම දරුණු රෝගාබාධයෙන් පෙළෙන්නාට මෙසේ සිතේ: ‘අනේ! ප්‍රිය වූ කාමයන් මා හැර යන්නට ඇත. මමත් ප්‍රිය වූ කාමයන් හැර යන්නට ඇතැයි.’ ඔහු ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, පපුවට තලා ගනී, මෝහයට පත්වෙයි. බමුණ, මරණයට යටත් වූවන්ගෙන් මෙබඳු පුද්ගලයා මරණයට බිය වේ, තැතිගැනීමකට පත් වේ.\n\n‘‘බමුණ, තවද, මෙහිලා ඇතැමෙක් ශරීරය කෙරෙහි වීතරාගී නොවේ, ඡන්දය පහව ගොස් නැත, ප්‍රේමය පහව ගොස් නැත, පිපාසය පහව ගොස් නැත, දැවිල්ල පහව ගොස් නැත, තණ්හාව පහව ගොස් නැත. එවිට ඔහුව යම් දරුණු රෝගාබාධයක් ස්පර්ශ කරයි. එම දරුණු රෝගාබාධයෙන් පෙළෙන්නාට මෙසේ සිතේ: ‘අනේ! ප්‍රිය වූ කය මා හැර යන්නට ඇත. මමත් ප්‍රිය වූ කය හැර යන්නට ඇතැයි.’ ඔහු ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, පපුවට තලා ගනී, මෝහයට පත්වෙයි. බමුණ, මරණයට යටත් වූවන්ගෙන් මෙබඳු පුද්ගලයාද මරණයට බිය වේ, තැතිගැනීමකට පත් වේ.\n\n‘‘බමුණ, තවද, මෙහිලා ඇතැමෙක් යහපත් දේ නොකළ, කුසල් නොකළ, භයින් ආරක්ෂාව නොසැදූ, පව්කළ, කුරිරු ක්‍රියා කළ, අකුසල් කළ අයෙක් වේ. එවිට ඔහුව යම් දරුණු රෝගාබාධයක් ස්පර්ශ කරයි. එම දරුණු රෝගාබාධයෙන් පෙළෙන්නාට මෙසේ සිතේ: ‘අහෝ! මවිසින් යහපත් දේ නොකරන ලදී, කුසල් නොකරන ලදී, භයින් ආරක්ෂාව නොසැදිනි; පව් කරන ලදී, කුරිරු ක්‍රියා කරන ලදී, අකුසල් කරන ලදී. භවත්නි, යහපත් දේ නොකළ, කුසල් නොකළ, භයින් ආරක්ෂාව නොසැදූ, පව් කළ, කුරිරු ක්‍රියා කළ, අකුසල් කළ පුද්ගලයන්ට යම් ගතියක් ඇත්ද, මිය පරලොව ගොස් මම ඒ ගතියටම යන්නෙමි’යි. ඔහු ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, පපුවට තලා ගනී, මෝහයට පත්වෙයි. බමුණ, මරණයට යටත් වූවන්ගෙන් මෙබඳු පුද්ගලයාද මරණයට බිය වේ, තැතිගැනීමකට පත් වේ.\n\n‘‘බමුණ, තවද, මෙහිලා ඇතැමෙක් සද්ධර්මය කෙරෙහි සැක ඇති, විචිකිච්ඡා සහගත වූ, තහවුරු නොවූ අයෙක් වේ. එවිට ඔහුව යම් දරුණු රෝගාබාධයක් ස්පර්ශ කරයි. එම දරුණු රෝගාබාධයෙන් පෙළෙන්නාට මෙසේ සිතේ: ‘අහෝ! මම සද්ධර්මය කෙරෙහි සැක ඇති, විචිකිච්ඡා සහගත වූ, තහවුරු නොවූ අයෙක් වෙමි’යි. ඔහු ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, පපුවට තලා ගනී, මෝහයට පත්වෙයි. බමුණ, මරණයට යටත් වූවන්ගෙන් මෙබඳු පුද්ගලයාද මරණයට බිය වේ, තැතිගැනීමකට පත් වේ. බමුණ, මරණයට යටත් වූවන්ගෙන් මරණයට බිය වී, තැතිගැනීමකට පත් වන්නෝ මේ සිව් පුද්ගලයෝය.\n\n‘‘බමුණ, මරණයට යටත් වූවන්ගෙන් මරණයට නො බිය වී, තැතිගැනීමකට පත් නොවන්නා කවරෙක්ද? බමුණ, මෙහිලා ඇතැමෙක් කාමයන් කෙරෙහි වීතරාගී වේ, ඡන්දය පහව ගොස් ඇත, ප්‍රේමය පහව ගොස් ඇත, පිපාසය පහව ගොස් ඇත, දැවිල්ල පහව ගොස් ඇත, තණ්හාව පහව ගොස් ඇත. එවිට ඔහුව යම් දරුණු රෝගාබාධයක් ස්පර්ශ කරයි. එම දරුණු රෝගාබාධයෙන් පෙළෙන්නාට මෙසේ නොසිතේ: ‘අනේ! ප්‍රිය වූ කාමයන් මා හැර යන්නට ඇත. මමත් ප්‍රිය වූ කාමයන් හැර යන්නට ඇතැයි.’ ඔහු ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට තලා නොගනී, මෝහයට පත් නොවේ. බමුණ, මරණයට යටත් වූවන්ගෙන් මෙබඳු පුද්ගලයා මරණයට නො බිය වේ, තැතිගැනීමකට පත් නොවේ.\n\n‘‘බමුණ, තවද, මෙහිලා ඇතැමෙක් ශරීරය කෙරෙහි වීතරාගී වේ, ඡන්දය පහව ගොස් ඇත, ප්‍රේමය පහව ගොස් ඇත, පිපාසය පහව ගොස් ඇත, දැවිල්ල පහව ගොස් ඇත, තණ්හාව පහව ගොස් ඇත. එවිට ඔහුව යම් දරුණු රෝගාබාධයක් ස්පර්ශ කරයි. එම දරුණු රෝගාබාධයෙන් පෙළෙන්නාට මෙසේ නොසිතේ: ‘අනේ! ප්‍රිය වූ කය මා හැර යන්නට ඇත. මමත් ප්‍රිය වූ කය හැර යන්නට ඇතැයි.’ ඔහු ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට තලා නොගනී, මෝහයට පත් නොවේ. බමුණ, මරණයට යටත් වූවන්ගෙන් මෙබඳු පුද්ගලයාද මරණයට නො බිය වේ, තැතිගැනීමකට පත් නොවේ.\n\n‘‘බමුණ, තවද, මෙහිලා ඇතැමෙක් පව් නොකළ, කුරිරු ක්‍රියා නොකළ, අකුසල් නොකළ, යහපත් දේ කළ, කුසල් කළ, භයින් ආරක්ෂාව සැදූ අයෙක් වේ. එවිට ඔහුව යම් දරුණු රෝගාබාධයක් ස්පර්ශ කරයි. එම දරුණු රෝගාබාධයෙන් පෙළෙන්නාට මෙසේ සිතේ: ‘අහෝ! මවිසින් පව් නොකරන ලදී, කුරිරු ක්‍රියා නොකරන ලදී, අකුසල් නොකරන ලදී; යහපත් දේ කරන ලදී, කුසල් කරන ලදී, භයින් ආරක්ෂාව සැදිනි. භවත්නි, පව් නොකළ, කුරිරු ක්‍රියා නොකළ, අකුසල් නොකළ, යහපත් දේ කළ, කුසල් කළ, භයින් ආරක්ෂාව සැදූ පුද්ගලයන්ට යම් ගතියක් ඇත්ද, මිය පරලොව ගොස් මම ඒ ගතියටම යන්නෙමි’යි. ඔහු ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට තලා නොගනී, මෝහයට පත් නොවේ. බමුණ, මරණයට යටත් වූවන්ගෙන් මෙබඳු පුද්ගලයාද මරණයට නො බිය වේ, තැතිගැනීමකට පත් නොවේ.\n\nඔහු ශෝක නොකරයි, වෙහෙසට පත් නොවේ, වැළපෙන්නේ නැත, පපුවට ගසාගෙන හඬන්නේ නැත, මුළා නොවෙයි. බ්‍රාහ්මණයාණෙනි, මරණ ස්‍වභාව ඇති මේ පුද්ගලයාද මරණයට බිය නොවෙයි, තැතිගන්නේ නැත.\n\n‘‘බ්‍රාහ්මණයාණෙනි, තවද මෙහි සමහරෙක් සද්ධර්මයෙහි සැක රහිත, විචිකිච්ඡා රහිත, තහවුරු වූවෙක් වෙයි. යම් දරුණු රෝගාබාධයක් ඔහුට වැළඳෙයි. ඒ යම් දරුණු රෝගාබාධයකට ලක් වූ ඔහුට ‘මම නම් සැක රහිත වෙමි, විචිකිච්ඡා රහිත වෙමි, සද්ධර්මයෙහි තහවුරු වූවෙක් වෙමි’ යනුවෙන් සිතේ. ඔහු ශෝක නොකරයි, වෙහෙසට පත් නොවේ, වැළපෙන්නේ නැත, පපුවට ගසාගෙන හඬන්නේ නැත, මුළා නොවෙයි. බ්‍රාහ්මණයාණෙනි, මරණ ස්‍වභාව ඇති මේ පුද්ගලයාද මරණයට බිය නොවෙයි, තැතිගන්නේ නැත. බ්‍රාහ්මණයාණෙනි, මරණ ස්‍වභාව ඇති මේ සිව් දෙනාම මරණයට බිය නොවෙති, තැතිගන්නේ නැත.’’\n\n‘‘භවත් ගෞත‍්මයන් වහන්ස, ඉතා මැනවි, භවත් ගෞත‍්මයන් වහන්ස, ඉතා මැනවි... අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයකු ලෙස භවත් ගෞත‍්මයන් වහන්සේ මා පිළිගන්නා සේක්වා.’’\nමෙය සතරවන සූත්‍රයයි.",
      "paliTitle": "Abhayasuttaṃ",
      "englishTitle": "The Abhaya Sutta",
      "sinhalaTitle": "අභය සූත්‍‍රය"
    },
    {
      "number": 185,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena sambahulā abhiññātā abhiññātā paribbājakā sippinikātīre paribbājakārāme paṭivasanti, seyyathidaṃ annabhāro varadharo sakuludāyī ca paribbājako aññe ca abhiññātā abhiññātā paribbājakā. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena sippinikātīre paribbājakārāmo tenupasaṅkami. Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarā kathā udapādi – ‘‘itipi brāhmaṇasaccāni, itipi brāhmaṇasaccānī’’ti. Atha kho bhagavā yena te paribbājakā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā te paribbājake etadavoca – ‘‘Kāya nuttha, paribbājakā, etarahi kathāya sannisinnā, kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idha, bho gotama, amhākaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘itipi brāhmaṇasaccāni, itipi brāhmaṇasaccānī’’’ti. ‘‘Cattārimāni, paribbājakā, brāhmaṇasaccāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Idha, paribbājakā, brāhmaṇo evamāha – ‘sabbe pāṇā avajjhā’ti. Iti vadaṃ brāhmaṇo saccaṃ āha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya pāṇānaṃyeva anuddayāya [tadabhiññāya anudayāya (ka.)] anukampāya paṭipanno hoti. ‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘sabbe kāmā aniccā dukkhā vipariṇāmadhammā’ti. Iti vadaṃ brāhmaṇo saccamāha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya kāmānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti. ‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘sabbe bhavā aniccā…pe… bhavānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti. ‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘nāhaṃ kvacani [kvacana (sī. syā.)] kassaci kiñcanatasmiṃ na ca mama kvacani katthaci kiñcanatatthī’ti. Iti vadaṃ brāhmaṇo saccaṃ āha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya ākiñcaññaṃyeva paṭipadaṃ paṭipanno hoti. Imāni kho, paribbājakā, cattāri brāhmaṇasaccāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Pañcamaṃ.",
      "english": "At one time the Blessed One was dwelling in Rājagaha, on Vulture Peak Mountain. Now at that time, many well-known wanderers were staying in the wanderers' park on the bank of the Sappinikā River, namely, Annabhāra, Varadhara, and Sakuludāyī the wanderer, and other well-known wanderers. Then, in the evening, the Blessed One arose from his seclusion and went to the wanderers' park on the bank of the Sappinikā River. At that time, these wanderers of other sects were seated together, assembled, and this discussion arose among them: \"These are the truths of a brahman; these are the truths of a brahman.\"\n\nThen the Blessed One approached those wanderers; having approached, he sat down on the seat that had been prepared. Having sat down, the Blessed One said to those wanderers: \"Wanderers, what was the topic of your discussion as you were seated together just now, and what was the conversation left unfinished among you?\"\n\n\"Here, Venerable Gotama, as we were seated together, assembled, this discussion arose among us: 'These are the truths of a brahman; these are the truths of a brahman.'\"\n\n\"Wanderers, there are these four truths of a brahman, which I have directly known, realized, and proclaimed for myself. Which four? Here, wanderers, a brahman says: 'All living beings are not to be harmed.' Saying thus, the brahman speaks truth, not falsehood. Because of that, he does not conceive 'I am a recluse,' nor 'I am a brahman,' nor 'I am superior,' nor 'I am equal,' nor 'I am inferior.' Instead, having directly known the truth in that matter, he practices for sympathy and compassion towards living beings.\n\n\"Furthermore, wanderers, a brahman says: 'All sensual pleasures are impermanent, unsatisfactory, and subject to change.' Saying thus, the brahman speaks truth, not falsehood. Because of that, he does not conceive 'I am a recluse,' nor 'I am a brahman,' nor 'I am superior,' nor 'I am equal,' nor 'I am inferior.' Instead, having directly known the truth in that matter, he practices for disillusionment with, dispassion for, and cessation of sensual pleasures.\n\n\"Furthermore, wanderers, a brahman says: 'All forms of existence are impermanent, unsatisfactory, and subject to change.' Instead, having directly known the truth in that matter, he practices for disillusionment with, dispassion for, and cessation of forms of existence.\n\n\"Furthermore, wanderers, a brahman says: 'I am not anyone's anything in any way, nor is there anything of mine anywhere at all.' Saying thus, the brahman speaks truth, not falsehood. Because of that, he does not conceive 'I am a recluse,' nor 'I am a brahman,' nor 'I am superior,' nor 'I am equal,' nor 'I am inferior.' Instead, having directly known the truth in that matter, he practices the path of nothingness. These, wanderers, are the four truths of a brahman, which I have directly known, realized, and proclaimed for myself.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රාජග්‍රහ නුවර ගිජ්ජකූට පර්වතයේ වැඩසිටියහ. එකල බෙහෙවින් ප්‍රකට වූ, එනම් අන්නභාර, වරධර, සකුලුදායී යන පරිබ්‍රාජකයින් ද තවත් ප්‍රකට වූ බොහෝ පරිබ්‍රාජකයින් ද සිප්පිනිකා තීරයේ පිහිටි පරිබ්‍රාජකාරාමයේ වාසය කළහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි භාවනානුයෝගීව වැඩසිටීමෙන් නැගී සිට, සිප්පිනිකා තීරයෙහි වූ පරිබ්‍රාජකාරාමය වෙත වැඩම කළ සේක. එකල ඒ වෙනත් තීර්ථක පරිබ්‍රාජකයෝ එක්ව රැස්වී වාඩි වී සිටින අතරතුරේ \"මේවා බ්‍රාහ්මණ සත්‍යයෝ ය, මේවා බ්‍රාහ්මණ සත්‍යයෝ ය\" යන මේ කතාව පහළ විය.\n\nඑවිට භාග්‍යවතුන් වහන්සේ ඒ පරිබ්‍රාජකයින් සිටි තැනට වැඩම කළ සේක; වැඩම කොට පනවා තිබූ ආසනයක වැඩහුන් සේක. වැඩහුන් පසු භාග්‍යවතුන් වහන්සේ ඒ පරිබ්‍රාජකයින්ට මෙසේ වදාළ සේක: \"පරිබ්‍රාජකයෙනි, දැන් නුඹලා කුමන කතාවකින් යුතුව රැස්වී සිටින්නහු ද? නුඹලාගේ කුමන කතාවක්ද අතරමග නැවතුණේ?\" \"භවත් ගෞතමයින් වහන්ස, මෙහිලා අපි රැස්වී වාඩි වී සිටින අතරතුරේ 'මේවා බ්‍රාහ්මණ සත්‍යයෝ ය, මේවා බ්‍රාහ්මණ සත්‍යයෝ ය' යන මේ කතාව පහළ විය.\"\n\n\"පරිබ්‍රාජකයෙනි, මා විසින් තමන්ම අභිඥා ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරන ලද මේ බ්‍රාහ්මණ සත්‍යයෝ සතරක් වෙති. ඒ සතර කුමක්ද? පරිබ්‍රාජකයෙනි, මෙහිලා බ්‍රාහ්මණයා මෙසේ කියයි: 'සියලු ප්‍රාණීහු අවධ්‍ය වෙත්' කියා. මෙසේ පවසන බ්‍රාහ්මණයා සත්‍යය ම කියයි, මුසාවක් නොවේ. ඒ නිසා හෙතෙම තමා ශ්‍රමණයෙකැයි නොසිතයි, බ්‍රාහ්මණයෙකැයි නොසිතයි, මම ශ්‍රේෂ්ඨ යැයි නොසිතයි, මම සමාන යැයි නොසිතයි, මම හීන යැයි නොසිතයි. එහෙත්, ඒ බ්‍රාහ්මණයා එහි ඇති සත්‍යය අවබෝධ කරගෙන, ප්‍රාණීන් කෙරෙහි ම කරුණාවෙන් හා අනුකම්පාවෙන් යුතුව පිළිපදින්නෙක් වෙයි.\n\n\"තවද, පරිබ්‍රාජකයෙනි, බ්‍රාහ්මණයා මෙසේ කියයි: 'සියලු කාමයන් අනිත්‍ය ය, දුක්ඛ ය, වෙනස් වන ස්වභාව ඇත්තාහ' කියා. මෙසේ පවසන බ්‍රාහ්මණයා සත්‍යය ම කියයි, මුසාවක් නොවේ. ඒ නිසා හෙතෙම තමා ශ්‍රමණයෙකැයි නොසිතයි, බ්‍රාහ්මණයෙකැයි නොසිතයි, මම ශ්‍රේෂ්ඨ යැයි නොසිතයි, මම සමාන යැයි නොසිතයි, මම හීන යැයි නොසිතයි. එහෙත්, ඒ බ්‍රාහ්මණයා එහි ඇති සත්‍යය අවබෝධ කරගෙන, කාමයන් කෙරෙහි ම කලකිරීම පිණිස, නොඇල්ම පිණිස, නැති කිරීම පිණිස පිළිපදින්නෙක් වෙයි.\n\n\"තවද, පරිබ්‍රාජකයෙනි, බ්‍රාහ්මණයා මෙසේ කියයි: 'සියලු භවයන් අනිත්‍ය ය, දුක්ඛ ය, වෙනස් වන ස්වභාව ඇත්තාහ' කියා. මෙසේ පවසන බ්‍රාහ්මණයා සත්‍යය ම කියයි, මුසාවක් නොවේ. ඒ නිසා හෙතෙම තමා ශ්‍රමණයෙකැයි නොසිතයි, බ්‍රාහ්මණයෙකැයි නොසිතයි, මම ශ්‍රේෂ්ඨ යැයි නොසිතයි, මම සමාන යැයි නොසිතයි, මම හීන යැයි නොසිතයි. එහෙත්, ඒ බ්‍රාහ්මණයා එහි ඇති සත්‍යය අවබෝධ කරගෙන, භවයන් කෙරෙහි ම කලකිරීම පිණිස, නොඇල්ම පිණිස, නැති කිරීම පිණිස පිළිපදින්නෙක් වෙයි.\n\n\"තවද, පරිබ්‍රාජකයෙනි, බ්‍රාහ්මණයා මෙසේ කියයි: 'මම කිසිදු තැනක කිසිවෙකුගේ කිසියම් දෙයකට අයත් නොවෙමි, කිසිදු තැනක කිසිවෙකුගේ කිසියම් දෙයක් මට අයිති නැත' කියා. මෙසේ පවසන බ්‍රාහ්මණයා සත්‍යය ම කියයි, මුසාවක් නොවේ. ඒ නිසා හෙතෙම තමා ශ්‍රමණයෙකැයි නොසිතයි, බ්‍රාහ්මණයෙකැයි නොසිතයි, මම ශ්‍රේෂ්ඨ යැයි නොසිතයි, මම සමාන යැයි නොසිතයි, මම හීන යැයි නොසිතයි. එහෙත්, ඒ බ්‍රාහ්මණයා එහි ඇති සත්‍යය අවබෝධ කරගෙන, කිසිවක් නැති බවට, අයිතිකරගත යුතු දෙයක් නැති බවට වන ප්‍රතිපදාව ම අනුගමනය කරන්නෙක් වෙයි. පරිබ්‍රාජකයෙනි, මා විසින් තමන්ම අභිඥා ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරන ලද මේ බ්‍රාහ්මණ සත්‍යයෝ සතර නම් මේවා ය.\"\n\nපස්වැන්නයි.",
      "paliTitle": "Brāhmaṇasaccasuttaṃ",
      "englishTitle": "Discourse on Brahmana Truth",
      "sinhalaTitle": "බ්‍රාහ්මණ සත්‍ය සූත්‍රය"
    },
    {
      "number": 186,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘kena nu kho, bhante, loko nīyati, kena loko parikassati, kassa ca uppannassa vasaṃ gacchatī’’ti? ‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu, ummaggo [ummaṅgo (syā. ka.)], bhaddakaṃ paṭibhānaṃ, kalyāṇī [kalyāṇā (ka.)] paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘kena nu kho, bhante, loko nīyati, kena loko parikassati, kassa ca uppannassa vasaṃ gacchatī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Cittena kho, bhikkhu, loko nīyati, cittena parikassati, cittassa uppannassa vasaṃ gacchatī’’ti. ‘‘Sādhu, bhante’’ti kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttari pañhaṃ apucchi – ‘‘‘bahussuto dhammadharo, bahussuto dhammadharo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, bahussuto dhammadharo hotī’’ti? ‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘bahussuto dhammadharo, bahussuto dhammadharoti, bhante, vuccati. Kittāvatā nu kho, bhante, bahussuto dhammadharo hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Bahū kho, bhikkhu, mayā dhammā desitā [bahu kho bhikkhu mayā dhammo desito (ka.)] – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthā, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Catuppadāya cepi, bhikkhu, gāthāya atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti bahussuto dhammadharoti alaṃ vacanāyā’’ti. ‘‘Sādhu, bhante’’ti kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttari pañhaṃ apucchi – ‘‘‘sutavā nibbedhikapañño, sutavā nibbedhikapañño’ti, bhante, vuccati. Kittāvatā nu kho, bhante, sutavā nibbedhikapañño hotī’’ti? ‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu, ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘sutavā nibbedhikapañño, sutavā nibbedhikapaññoti, bhante, vuccati. Kittāvatā nu kho, bhante, sutavā nibbedhikapañño hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Idha, bhikkhu, bhikkhuno ‘idaṃ dukkha’nti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhasamudayo’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhanirodho’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati. Evaṃ kho, bhikkhu, sutavā nibbedhikapañño hotī’’ti. ‘‘Sādhu, bhante’’ti kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttari pañhaṃ apucchi – ‘‘‘paṇḍito mahāpañño, paṇḍito mahāpañño’ti, bhante, vuccati. Kittāvatā nu kho, bhante, paṇḍito mahāpañño hotī’’ti? ‘‘Sādhu sādhu bhikkhu! Bhaddako kho te, bhikkhu, ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ bhikkhu pucchasi – ‘paṇḍito mahāpañño, paṇḍito mahāpaññoti, bhante, vuccati. Kittāvatā nu kho, bhante, paṇḍito mahāpañño hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Idha, bhikkhu, paṇḍito mahāpañño nevattabyābādhāya ceteti na parabyābādhāya ceteti na ubhayabyābādhāya ceteti attahitaparahitaubhayahitasabbalokahitameva cintayamāno cinteti. Evaṃ kho, bhikkhu, paṇḍito mahāpañño hotī’’ti. Chaṭṭhaṃ.",
      "english": "Then a certain bhikkhu approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, that bhikkhu said to the Blessed One, \"Venerable Sir, by what is the world led? By what is the world dragged along? And to the power of what, having arisen, does it go?\"\n\n\"Good, good, bhikkhu! Excellent indeed, bhikkhu, is your insight! Excellent is your comprehension! Auspicious is your question! For thus, bhikkhu, you ask: 'Venerable Sir, by what is the world led? By what is the world dragged along? And to the power of what, having arisen, does it go?'\"\n\n\"Yes, Venerable Sir.\"\n\n\"Bhikkhu, the world is led by mind, the world is dragged along by mind, and to the power of mind, having arisen, it goes.\"\n\n\"Excellent, Venerable Sir,\" that bhikkhu said. Delighted and gratified by the Blessed One’s words, he then asked the Blessed One a further question: \"Venerable Sir, it is said, 'one who is learned and upholds the Dhamma, one who is learned and upholds the Dhamma.' To what extent, Venerable Sir, is one considered learned and an upholder of the Dhamma?\"\n\n\"Good, good, bhikkhu! Excellent indeed, bhikkhu, is your insight! Excellent is your comprehension! Auspicious is your question! For thus, bhikkhu, you ask: 'Venerable Sir, it is said, \"one who is learned and upholds the Dhamma, one who is learned and upholds the Dhamma.\" To what extent, Venerable Sir, is one considered learned and an upholder of the Dhamma?'\"\n\n\"Yes, Venerable Sir.\"\n\n\"Bhikkhu, many teachings have been expounded by me: discourses, mixed prose and verse, expositions, verses, inspired utterances, 'thus-saids,' birth stories, wonderful phenomena, and question-and-answer teachings. Even if, bhikkhu, one knows the meaning and knows the teaching of a verse of four lines, and practices in accordance with the Dhamma and its sub-teachings, that is sufficient to call one learned and an upholder of the Dhamma.\"\n\n\"Excellent, Venerable Sir,\" that bhikkhu said. Delighted and gratified by the Blessed One’s words, he then asked the Blessed One a further question: \"Venerable Sir, it is said, 'one who has heard much and possesses penetrative wisdom, one who has heard much and possesses penetrative wisdom.' To what extent, Venerable Sir, does one possess penetrative wisdom?\"\n\n\"Good, good, bhikkhu! Excellent indeed, bhikkhu, is your insight! Excellent is your comprehension! Auspicious is your question! For thus, bhikkhu, you ask: 'Venerable Sir, it is said, \"one who has heard much and possesses penetrative wisdom, one who has heard much and possesses penetrative wisdom.\" To what extent, Venerable Sir, does one possess penetrative wisdom?'\"\n\n\"Yes, Venerable Sir.\"\n\n\"Here, bhikkhu, a bhikkhu has heard, 'This is suffering,' and with wisdom, he penetrates its meaning and sees it. He has heard, 'This is the origin of suffering,' and with wisdom, he penetrates its meaning and sees it. He has heard, 'This is the cessation of suffering,' and with wisdom, he penetrates its meaning and sees it. He has heard, 'This is the path leading to the cessation of suffering,' and with wisdom, he penetrates its meaning and sees it. In this way, bhikkhu, one who has heard much possesses penetrative wisdom.\"\n\n\"Excellent, Venerable Sir,\" that bhikkhu said. Delighted and gratified by the Blessed One’s words, he then asked the Blessed One a further question: \"Venerable Sir, it is said, 'one who is wise and possesses great wisdom, one who is wise and possesses great wisdom.' To what extent, Venerable Sir, is one wise and possesses great wisdom?\"\n\n\"Good, good, bhikkhu! Excellent indeed, bhikkhu, is your insight! Excellent is your comprehension! Auspicious is your question! For thus, bhikkhu, you ask: 'Venerable Sir, it is said, \"one who is wise and possesses great wisdom, one who is wise and possesses great wisdom.\" To what extent, Venerable Sir, is one wise and possesses great wisdom?'\"\n\n\"Yes, Venerable Sir.\"\n\n\"Here, bhikkhu, one who is wise and possesses great wisdom does not think for the affliction of oneself, nor does he think for the affliction of others, nor does he think for the affliction of both. Instead, while thinking, he thinks only for the welfare of oneself, the welfare of others, the welfare of both, and the welfare of the entire world. In this way, bhikkhu, one is wise and possesses great wisdom.\"",
      "sinhala": "එවිට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. එසේ පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ නමස්කාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩසිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භාග්‍යවතුන් වහන්ස, ලෝකය කුමක් විසින් මෙහෙයවනු ලැබේ ද? ලෝකය කුමක් විසින් ඇදගෙන යනු ලැබේ ද? කුමක් උපන් කල්හි ඒ ලෝකය ඊට වසඟ වී සිටී ද?\"\n\n\"හොඳයි, හොඳයි භික්ෂුව! භික්ෂුව, ඔබට යහපත් වූ ප්‍රවේශ මාර්ගයක් (ප්‍රශ්නයට පිවිසීමේ මාර්ගයක්) ඇත. යහපත් වූ ප්‍රතිභාවක් (අදහසක්) ඇත. සුන්දර වූ ප්‍රශ්නයක් ද (පරිපෘච්ඡාවක් ද) ඇත. භික්ෂුව, ඔබ අසන්නේ මෙසේ නොවේ ද: ‘භාග්‍යවතුන් වහන්ස, ලෝකය කුමක් විසින් මෙහෙයවනු ලැබේ ද? ලෝකය කුමක් විසින් ඇදගෙන යනු ලැබේ ද? කුමක් උපන් කල්හි ඒ ලෝකය ඊට වසඟ වී සිටී ද?’” “එසේය, භාග්‍යවතුන් වහන්ස.” “භික්ෂුව, ලෝකය සිතින් මෙහෙයවනු ලැබේ. සිතින් ඇදගෙන යනු ලැබේ. සිත උපන් කල්හි ඒ ලෝකය සිතට වසඟ වී සිටී.”\n\n\"සාධු, භාග්‍යවතුන් වහන්ස” යැයි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කොට, අනුමෝදන්ව, භාග්‍යවතුන් වහන්සේගෙන් තවදුරටත් ප්‍රශ්නයක් ඇසුවේය: “භාග්‍යවතුන් වහන්ස, ‘බහුශ්‍රැත ධර්මධරයා, බහුශ්‍රැත ධර්මධරයා’ යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණු සමූහයකින් (ප්‍රමාණයකින්) බහුශ්‍රැත ධර්මධරයෙක් වේ ද?”\n\n\"හොඳයි, හොඳයි භික්ෂුව! භික්ෂුව, ඔබට යහපත් වූ ප්‍රවේශ මාර්ගයක් ඇත. යහපත් වූ ප්‍රතිභාවක් ඇත. සුන්දර වූ ප්‍රශ්නයක් ද ඇත. භික්ෂුව, ඔබ අසන්නේ මෙසේ නොවේ ද: ‘භාග්‍යවතුන් වහන්ස, ‘බහුශ්‍රැත ධර්මධරයා, බහුශ්‍රැත ධර්මධරයා’ යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණු සමූහයකින් බහුශ්‍රැත ධර්මධරයෙක් වේ ද?’” “එසේය, භාග්‍යවතුන් වහන්ස.”\n\n\"භික්ෂුව, මා විසින් බොහෝ ධර්මයන් දේශනා කර ඇත. එනම්: සූත්‍ර, ගෙය්‍ය (ගායනයට සුදුසු), වෙය්‍යාකරණ (ව්‍යාකරණ සහිත), ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම (පුදුම අරුම දහම්), වේදල්ල (ප්‍රශ්න විසඳීමෙන් අර්ථය ලබා දෙන) යනාදියයි. භික්ෂුව, සිව්පද ගාථාවක හෝ අර්ථය තේරුම් ගෙන, එහි ධර්මය (වචනවල තේරුම) තේරුම් ගෙන, ධර්මානුකූලව පිළිවෙත් පුරන්නේ නම්, ඔහු ‘බහුශ්‍රැත ධර්මධරයෙකි’ යැයි කීමට ප්‍රමාණවත් වේ.”\n\n\"සාධු, භාග්‍යවතුන් වහන්ස” යැයි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කොට, අනුමෝදන්ව, භාග්‍යවතුන් වහන්සේගෙන් තවදුරටත් ප්‍රශ්නයක් ඇසුවේය: “භාග්‍යවතුන් වහන්ස, ‘ඇසූ දත් විනිවිද දකින ප්‍රඥාව ඇත්තා, ඇසූ දත් විනිවිද දකින ප්‍රඥාව ඇත්තා’ යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණු සමූහයකින් ඇසූ දත් විනිවිද දකින ප්‍රඥාව ඇත්තෙක් වේ ද?”\n\n\"හොඳයි, හොඳයි භික්ෂුව! භික්ෂුව, ඔබට යහපත් වූ ප්‍රවේශ මාර්ගයක් ඇත. යහපත් වූ ප්‍රතිභාවක් ඇත. සුන්දර වූ ප්‍රශ්නයක් ද ඇත. භික්ෂුව, ඔබ අසන්නේ මෙසේ නොවේ ද: ‘භාග්‍යවතුන් වහන්ස, ‘ඇසූ දත් විනිවිද දකින ප්‍රඥාව ඇත්තා, ඇසූ දත් විනිවිද දකින ප්‍රඥාව ඇත්තා’ යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණු සමූහයකින් ඇසූ දත් විනිවිද දකින ප්‍රඥාව ඇත්තෙක් වේ ද?’” “එසේය, භාග්‍යවතුන් වහන්ස.”\n\n\"භික්ෂුව, මෙහිලා භික්ෂුවකට ‘මෙය දුකයි’ යැයි අසා ඇත. (තවද) ඔහු ප්‍රඥාවෙන් එහි (දුකෙහි) අර්ථය විනිවිද දැකීම කරයි. ‘මෙය දුක හටගැනීමයි (දුක්ඛ සමුදයයි)’ යැයි අසා ඇත. ප්‍රඥාවෙන් එහි අර්ථය විනිවිද දැකීම කරයි. ‘මෙය දුක නැතිකිරීමයි (දුක්ඛ නිරෝධයයි)’ යැයි අසා ඇත. ප්‍රඥාවෙන් එහි අර්ථය විනිවිද දැකීම කරයි. ‘මෙය දුක නැති කිරීමට පමුණුවන පිළිවෙතයි (දුක්ඛ නිරෝධගාමිනී ප්‍රතිපදාවයි)’ යැයි අසා ඇත. ප්‍රඥාවෙන් එහි අර්ථය විනිවිද දැකීම කරයි. භික්ෂුව, මෙසේ (චතුරාර්ය සත්‍යයන් අවබෝධයෙන්) ඇසූ දත් විනිවිද දකින ප්‍රඥාව ඇත්තෙක් වේ.”\n\n\"සාධු, භාග්‍යවතුන් වහන්ස” යැයි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කොට, අනුමෝදන්ව, භාග්‍යවතුන් වහන්සේගෙන් තවදුරටත් ප්‍රශ්නයක් ඇසුවේය: “භාග්‍යවතුන් වහන්ස, ‘පණ්ඩිත මහා ප්‍රඥාවන්තයා, පණ්ඩිත මහා ප්‍රඥාවන්තයා’ යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණු සමූහයකින් පණ්ඩිත මහා ප්‍රඥාවන්තයෙක් වේ ද?”\n\n\"හොඳයි, හොඳයි භික්ෂුව! භික්ෂුව, ඔබට යහපත් වූ ප්‍රවේශ මාර්ගයක් ඇත. යහපත් වූ ප්‍රතිභාවක් ඇත. සුන්දර වූ ප්‍රශ්නයක් ද ඇත. භික්ෂුව, ඔබ අසන්නේ මෙසේ නොවේ ද: ‘භාග්‍යවතුන් වහන්ස, ‘පණ්ඩිත මහා ප්‍රඥාවන්තයා, පණ්ඩිත මහා ප්‍රඥාවන්තයා’ යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණු සමූහයකින් පණ්ඩිත මහා ප්‍රඥාවන්තයෙක් වේ ද?’” “එසේය, භාග්‍යවතුන් වහන්ස.”\n\n\"භික්ෂුව, මෙහිලා පණ්ඩිත මහා ප්‍රඥාවන්තයා තමාගේ විනාශය පිණිස අදහස් නොකරයි. අනුන්ගේ විනාශය පිණිස අදහස් නොකරයි. තමාගේත් අනුන්ගේත් විනාශය පිණිස අදහස් නොකරයි. (එහෙත්) තමාගේ යහපත, අනුන්ගේ යහපත, තමාගේත් අනුන්ගේත් යහපත, සියලු ලෝකයාගේම යහපත ගැන සිතමින් ම කල්පනා කරයි. භික්ෂුව, මෙසේ පණ්ඩිත මහා ප්‍රඥාවන්තයෙක් වේ.”",
      "paliTitle": "Ummaggasuttaṃ",
      "englishTitle": "Discourse on the Wrong Path",
      "sinhalaTitle": "උම්මග්ග සූත්‍රය"
    },
    {
      "number": 187,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṃ etadavoca – ‘‘Jāneyya nu kho, bho gotama, asappuriso asappurisaṃ – ‘asappuriso ayaṃ bhava’’’nti? ‘‘Aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – ‘asappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya pana, bho gotama, asappuriso sappurisaṃ – ‘sappuriso ayaṃ bhava’’’nti? ‘‘Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – ‘sappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya nu kho, bho gotama, sappuriso sappurisaṃ – ‘sappuriso ayaṃ bhava’’’nti? ‘‘Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – ‘sappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya pana, bho gotama, sappuriso asappurisaṃ – ‘asappuriso ayaṃ bhava’’’nti? ‘‘Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – ‘asappuriso ayaṃ bhava’’’nti. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāva subhāsitaṃ cidaṃ, bhotā gotamena – ‘aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhava’’’nti. ‘‘Ekamidaṃ, bho gotama, samayaṃ todeyyassa brāhmaṇassa parisati parūpārambhaṃ vattenti – ‘bālo ayaṃ rājā eḷeyyo samaṇe rāmaputte abhippasanno, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karoti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikamma’nti. Imepi rañño eḷeyyassa parihārakā bālā – yamako moggallo [puggalo (ka.)] uggo nāvindakī gandhabbo aggivesso, ye samaṇe rāmaputte abhippasannā, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karonti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammanti. Tyāssudaṃ todeyyo brāhmaṇo iminā nayena neti. Taṃ kiṃ maññanti, bhonto, paṇḍito rājā eḷeyyo karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro’ti? ‘Evaṃ, bho, paṇḍito rājā eḷeyyo karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro’’’ti. ‘‘Yasmā ca kho, bho, samaṇo rāmaputto raññā eḷeyyena paṇḍitena paṇḍitataro karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarena alamatthadasataro, tasmā rājā eḷeyyo samaṇe rāmaputte abhippasanno, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karoti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ’’. ‘‘Taṃ kiṃ maññanti, bhonto, paṇḍitā rañño eḷeyyassa parihārakā – yamako moggallo uggo nāvindakī gandhabbo aggivesso, karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasatarāti? ‘Evaṃ, bho, paṇḍitā rañño eḷeyyassa parihārakā – yamako moggallo uggo nāvindakī gandhabbo aggivesso, karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasatarā’’’ti. ‘‘Yasmā ca kho, bho, samaṇo rāmaputto rañño eḷeyyassa parihārakehi paṇḍitehi paṇḍitataro karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro, tasmā rañño eḷeyyassa parihārakā samaṇe rāmaputte abhippasannā; samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karonti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikamma’’nti. ‘‘Acchariyaṃ, bho, gotama, abbhutaṃ, bho gotama! Yāva subhāsitaṃ cidaṃ bhotā gotamena – ‘aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhava’nti. Handa ca dāni mayaṃ, bho gotama, gacchāma. Bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassadāni tvaṃ, brāhmaṇa, kālaṃ maññasī’’ti. Atha kho vassakāro brāhmaṇo magadhamahāmatto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā pakkāmīti. Sattamaṃ.",
      "english": "Once, the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. Then the brahmin Vassakāra, the chief minister of Magadha, approached the Blessed One. Having approached, he exchanged courteous greetings with the Blessed One. After exchanging courteous and memorable remarks, he sat down to one side.\n\nSeated to one side, the brahmin Vassakāra, the chief minister of Magadha, said to the Blessed One: \"Venerable Gotama, could an ignoble person recognize an ignoble person, thinking, 'This person is ignoble'?\"\n\n\"Brahmin, it is impossible, there is no occasion for an ignoble person to recognize an ignoble person, thinking, 'This person is ignoble'.\"\n\n\"But Venerable Gotama, could an ignoble person recognize a noble person, thinking, 'This person is noble'?\"\n\n\"Brahmin, this too is impossible, there is no occasion for an ignoble person to recognize a noble person, thinking, 'This person is noble'.\"\n\n\"Venerable Gotama, could a noble person recognize a noble person, thinking, 'This person is noble'?\"\n\n\"Brahmin, it is indeed possible, there is an occasion for a noble person to recognize a noble person, thinking, 'This person is noble'.\"\n\n\"But Venerable Gotama, could a noble person recognize an ignoble person, thinking, 'This person is ignoble'?\"\n\n\"Brahmin, this too is indeed possible, there is an occasion for a noble person to recognize an ignoble person, thinking, 'This person is ignoble'.\"\n\n\"It is amazing, Venerable Gotama! It is astonishing, Venerable Gotama! How well-spoken are these words by Venerable Gotama: 'Brahmin, it is impossible, there is no occasion for an ignoble person to recognize an ignoble person, thinking, \"This person is ignoble.\" Brahmin, this too is impossible, there is no occasion for an ignoble person to recognize a noble person, thinking, \"This person is noble.\" Brahmin, it is indeed possible, there is an occasion for a noble person to recognize a noble person, thinking, \"This person is noble.\" Brahmin, this too is indeed possible, there is an occasion for a noble person to recognize an ignoble person, thinking, \"This person is ignoble\".'\"\n\n\"Venerable Gotama, on one occasion, in the assembly of the brahmin Todeyya, they were engaged in blaming others, saying: 'This King Eleyya is foolish for having such profound confidence in the ascetic Rāmaputta. He offers the ascetic Rāmaputta the highest forms of reverence, namely, salutation, rising up, joined palms, and dutiful conduct.' 'These attendants of King Eleyya are also foolish – Yamaka, Moggalla, Ugga, Navindakī, Gandhabba, Aggivessa – for having such profound confidence in the ascetic Rāmaputta. They also offer the ascetic Rāmaputta the highest forms of reverence, namely, salutation, rising up, joined palms, and dutiful conduct.' Thus, the brahmin Todeyya leads them in this manner. 'What do you think, sirs? Is King Eleyya wise, and most competent in discerning what is advantageous in matters of business and matters of speech?' 'Yes, sirs, King Eleyya is wise and most competent in discerning what is advantageous in matters of business and matters of speech.' 'And because, sirs, the ascetic Rāmaputta is wiser than the wise King Eleyya, and more competent than him in discerning what is advantageous in matters of business and matters of speech, therefore King Eleyya has such profound confidence in the ascetic Rāmaputta, and offers the ascetic Rāmaputta such highest forms of reverence, namely, salutation, rising up, joined palms, and dutiful conduct.' 'What do you think, sirs? Are these wise attendants of King Eleyya – Yamaka, Moggalla, Ugga, Navindakī, Gandhabba, Aggivessa – most competent in discerning what is advantageous in matters of business and matters of speech?' 'Yes, sirs, these wise attendants of King Eleyya – Yamaka, Moggalla, Ugga, Navindakī, Gandhabba, Aggivessa – are most competent in discerning what is advantageous in matters of business and matters of speech.' 'And because, sirs, the ascetic Rāmaputta is wiser than the wise attendants of King Eleyya, and more competent than them in discerning what is advantageous in matters of business and matters of speech, therefore King Eleyya's attendants have such profound confidence in the ascetic Rāmaputta, and offer the ascetic Rāmaputta such highest forms of reverence, namely, salutation, rising up, joined palms, and dutiful conduct.'\n\n\"It is amazing, Venerable Gotama, it is astonishing, Venerable Gotama! How well-spoken are these words by Venerable Gotama: 'Brahmin, it is impossible, there is no occasion for an ignoble person to recognize an ignoble person, thinking, \"This person is ignoble.\" Brahmin, this too is impossible, there is no occasion for an ignoble person to recognize a noble person, thinking, \"This person is noble.\" Brahmin, it is indeed possible, there is an occasion for a noble person to recognize a noble person, thinking, \"This person is noble.\" Brahmin, this too is indeed possible, there is an occasion for a noble person to recognize an ignoble person, thinking, \"This person is ignoble\".'\"\n\n“Well then, Reverend Gotama, we must leave now. We have many duties and many tasks to attend to.”\n“Now, brahmin, you may do as you deem fit.”\nThen, indeed, the brahmin Vassakāra, the chief minister of Magadha, having rejoiced in and approved of the Blessed One’s words, rose from his seat and departed.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දකනිවාප නම් ස්ථානයේ වැඩ වාසය කළ සේක.\n\nඑවිට මගධ දේශයේ මහා අමාත්‍යවරයෙකු වූ වස්සකාර බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු වන සුළු කතා බහද, සිහිපත් වන සුළු කතා බහද පවත්වන ලද්දේය. එයින් පසු එකත්පසක වාඩි විය.\n\nඑකත්පසක වාඩි වී සිටි මගධ මහාමාත්‍ය වස්සකාර බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “භවත් ගෞතමයන් වහන්ස, අසත්පුරුෂයෙකුට අසත්පුරුෂයෙකු මෙසේ දැනගත හැකිද – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා?”\n\n“බ්‍රාහ්මණය, අසත්පුරුෂයෙකු විසින් අසත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා – නොලැබිය හැකි කාරණයකි, ඒ සඳහා අවකාශයක් නැත.”\n\n“එසේ නම්, භවත් ගෞතමයන් වහන්ස, අසත්පුරුෂයෙකුට සත්පුරුෂයෙකු මෙසේ දැනගත හැකිද – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා?”\n\n“බ්‍රාහ්මණය, අසත්පුරුෂයෙකු විසින් සත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා – එයද නොලැබිය හැකි කාරණයකි, ඒ සඳහා අවකාශයක් නැත.”\n\n“භවත් ගෞතමයන් වහන්ස, සත්පුරුෂයෙකුට සත්පුරුෂයෙකු මෙසේ දැනගත හැකිද – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා?”\n\n“බ්‍රාහ්මණය, සත්පුරුෂයෙකු විසින් සත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා – එය කළ හැකි කාරණයකි, ඒ සඳහා අවකාශයක් ඇත.”\n\n“එසේ නම්, භවත් ගෞතමයන් වහන්ස, සත්පුරුෂයෙකුට අසත්පුරුෂයෙකු මෙසේ දැනගත හැකිද – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා?”\n\n“බ්‍රාහ්මණය, සත්පුරුෂයෙකු විසින් අසත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා – එයද කළ හැකි කාරණයකි, ඒ සඳහා අවකාශයක් ඇත.”\n\n“භවත් ගෞතමයන් වහන්ස, එය ආශ්චර්යයකි! භවත් ගෞතමයන් වහන්ස, එය අද්භූතයකි! භවත් ගෞතමයන් වහන්සේ විසින් කෙතරම් මැනවින් මෙය දේශනා කර තිබේද! – ‘බ්‍රාහ්මණය, අසත්පුරුෂයෙකු විසින් අසත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා – නොලැබිය හැකි කාරණයකි, ඒ සඳහා අවකාශයක් නැත. බ්‍රාහ්මණය, අසත්පුරුෂයෙකු විසින් සත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා – එයද නොලැබිය හැකි කාරණයකි, ඒ සඳහා අවකාශයක් නැත. බ්‍රාහ්මණය, සත්පුරුෂයෙකු විසින් සත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා – එය කළ හැකි කාරණයකි, ඒ සඳහා අවකාශයක් ඇත. බ්‍රාහ්මණය, සත්පුරුෂයෙකු විසින් අසත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා – එයද කළ හැකි කාරණයකි, ඒ සඳහා අවකාශයක් ඇත.’”\n\n“භවත් ගෞතමයන් වහන්ස, එක් කලෙක තොදෙය්‍ය බ්‍රාහ්මණයාගේ පිරිසක් අන්‍යයන්ට දෝෂාරෝපණය කරමින් මෙසේ කියති – ‘මේ ඇලෙය්‍ය නම් රජු මෝඩයෙකි. ඔහු ශ්‍රමණයන් වන රාමපුත්‍රයන් කෙරෙහි ඉතා ප්‍රසන්න වී සිටියි. එමෙන්ම ශ්‍රමණයන් වන රාමපුත්‍රයන්ට මේ ආකාරයේ උත්තරීතර ගෞරවයක් දක්වයි, එනම් ආචාර කිරීම, සිටිනු දැක නැගී සිටීම, දොහොත් මුදුන් තබා වැඳීම, හා ව්‍යක්ත ආචාර ක්‍රමයන් අනුගමනය කිරීමයි.’\n\n“ඇලෙය්‍ය රජුගේ මේ අනුචරයෝද මෝඩයෝය – යමක මෝග්ගල්ල, උග්ග, නාවින්දකී, ගන්ධබ්බ, අග්ගිවෙස්ස යන මේ සියල්ලෝද, ශ්‍රමණයන් වන රාමපුත්‍රයන් කෙරෙහි ඉතා ප්‍රසන්න වී සිටිති. එමෙන්ම ශ්‍රමණයන් වන රාමපුත්‍රයන්ට මේ ආකාරයේ උත්තරීතර ගෞරවයක් දක්වති, එනම් ආචාර කිරීම, සිටිනු දැක නැගී සිටීම, දොහොත් මුදුන් තබා වැඳීම, හා ව්‍යක්ත ආචාර ක්‍රමයන් අනුගමනය කිරීමයි.”\n\n“මෙලෙස තොදෙය්‍ය බ්‍රාහ්මණයා මේ කරුණ ඉදිරිපත් කරයි.”\n\n“භවත්නි, ඔබ කුමක් සිතයිද, ඇලෙය්‍ය රජු යමක් කළ යුතු කාරණාවලදීද, විසඳිය යුතු නඩු කටයුතුවලදීද, පැවසිය යුතු හා නැවත පැවසිය යුතු කරුණුවලදීද ඉතා ප්‍රඥාවන්තයෙක් යැයි, දස දහස් වාරයකින්ම දස දහස් වාරයක්ම ප්‍රඥාවන්තයෙක් යැයි ඔබ සිතයිද?”\n\n“එසේය, භවත්නි, ඇලෙය්‍ය රජු යමක් කළ යුතු කාරණාවලදීද, විසඳිය යුතු නඩු කටයුතුවලදීද, පැවසිය යුතු හා නැවත පැවසිය යුතු කරුණුවලදීද ඉතා ප්‍රඥාවන්තයෙක් යැයි, දස දහස් වාරයකින්ම දස දහස් වාරයක්ම ප්‍රඥාවන්තයෙක් යැයි අපි සිතමු.”\n\n“භවත්නි, යමක් කළ යුතු කාරණාවලදීද, විසඳිය යුතු නඩු කටයුතුවලදීද, පැවසිය යුතු හා නැවත පැවසිය යුතු කරුණුවලදීද, ශ්‍රමණයන් වන රාමපුත්‍රයන්, ඒ ප්‍රඥාවන්ත ඇලෙය්‍ය රජුට වඩා දස දහස් වාරයකින්ම දස දහස් වාරයක්ම ප්‍රඥාවන්ත වන බැවින්, එම ඇලෙය්‍ය රජු ශ්‍රමණයන් වන රාමපුත්‍රයන් කෙරෙහි ඉතා ප්‍රසන්න වී සිටියි. එමෙන්ම ශ්‍රමණයන් වන රාමපුත්‍රයන්ට මේ ආකාරයේ උත්තරීතර ගෞරවයක් දක්වයි, එනම් ආචාර කිරීම, සිටිනු දැක නැගී සිටීම, දොහොත් මුදුන් තබා වැඳීම, හා ව්‍යක්ත ආචාර ක්‍රමයන් අනුගමනය කිරීමයි.”\n\n“භවත්නි, ඔබ කුමක් සිතයිද, ඇලෙය්‍ය රජුගේ ප්‍රඥාවන්ත අනුචරයන් වන යමක මෝග්ගල්ල, උග්ග, නාවින්දකී, ගන්ධබ්බ, අග්ගිවෙස්ස යන මොවුන් යමක් කළ යුතු කාරණාවලදීද, විසඳිය යුතු නඩු කටයුතුවලදීද, පැවසිය යුතු හා නැවත පැවසිය යුතු කරුණුවලදීද දස දහස් වාරයකින්ම දස දහස් වාරයක්ම ප්‍රඥාවන්තයෝ යැයි ඔබ සිතයිද?”\n\n“එසේය, භවත්නි, ඇලෙය්‍ය රජුගේ ප්‍රඥාවන්ත අනුචරයන් වන යමක මෝග්ගල්ල, උග්ග, නාවින්දකී, ගන්ධබ්බ, අග්ගිවෙස්ස යන මොවුන් යමක් කළ යුතු කාරණාවලදීද, විසඳිය යුතු නඩු කටයුතුවලදීද, පැවසිය යුතු හා නැවත පැවසිය යුතු කරුණුවලදීද දස දහස් වාරයකින්ම දස දහස් වාරයක්ම ප්‍රඥාවන්තයෝ යැයි අපි සිතමු.”\n\n“භවත්නි, යමක් කළ යුතු කාරණාවලදීද, විසඳිය යුතු නඩු කටයුතුවලදීද, පැවසිය යුතු හා නැවත පැවසිය යුතු කරුණුවලදීද, ශ්‍රමණයන් වන රාමපුත්‍රයන්, ඒ ප්‍රඥාවන්ත ඇලෙය්‍ය රජුගේ අනුචරයන්ට වඩා දස දහස් වාරයකින්ම දස දහස් වාරයක්ම ප්‍රඥාවන්ත වන බැවින්, ඇලෙය්‍ය රජුගේ අනුචරයෝ ශ්‍රමණයන් වන රාමපුත්‍රයන් කෙරෙහි ඉතා ප්‍රසන්න වී සිටිති. එමෙන්ම ශ්‍රමණයන් වන රාමපුත්‍රයන්ට මේ ආකාරයේ උත්තරීතර ගෞරවයක් දක්වති, එනම් ආචාර කිරීම, සිටිනු දැක නැගී සිටීම, දොහොත් මුදුන් තබා වැඳීම, හා ව්‍යක්ත ආචාර ක්‍රමයන් අනුගමනය කිරීමයි.”\n\n“භවත් ගෞතමයන් වහන්ස, එය ආශ්චර්යයකි! භවත් ගෞතමයන් වහන්ස, එය අද්භූතයකි! භවත් ගෞතමයන් වහන්සේ විසින් කෙතරම් මැනවින් මෙය දේශනා කර තිබේද! – ‘බ්‍රාහ්මණය, අසත්පුරුෂයෙකු විසින් අසත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා – නොලැබිය හැකි කාරණයකි, ඒ සඳහා අවකාශයක් නැත. බ්‍රාහ්මණය, අසත්පුරුෂයෙකු විසින් සත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා – එයද නොලැබිය හැකි කාරණයකි, ඒ සඳහා අවකාශයක් නැත. බ්‍රාහ්මණය, සත්පුරුෂයෙකු විසින් සත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා සත්පුරුෂයෙකි’ කියා – එය කළ හැකි කාරණයකි, ඒ සඳහා අවකාශයක් ඇත. බ්‍රාහ්මණය, සත්පුරුෂයෙකු විසින් අසත්පුරුෂයෙකු මෙසේ දැනගැනීම – ‘මේ පුද්ගලයා අසත්පුරුෂයෙකි’ කියා – එයද කළ හැකි කාරණයකි, ඒ සඳහා අවකාශයක් ඇත.’”\n\nභවත් ගෞතමයන් වහන්ස, එසේ නම් දැන් අපි යමු. අපට බොහෝ කටයුතු ඇත, බොහෝ ඉටුකළ යුතු වගකීම්ද ඇත.\n(භාග්‍ය​වතුන් වහන්සේ) \"බ්‍රාහ්මණය, දැන් ඔබ යමක් සඳහා කාලය යැයි සිතන්නේ නම් (එය කරනු).\" යි වදාළ සේක.\nඑවිට මගධයේ මහඇමති වූ වස්සකාර බ්‍රාහ්මණයා භාග්‍ය​වතුන් වහන්සේගේ වචනයට සතුටු වී, එය අනුමෝදන් වී, අසුනෙන් නැගිට පිටත්ව ගියේය.",
      "paliTitle": "Vassakārasuttaṃ",
      "englishTitle": "The Vassakāra Sutta",
      "sinhalaTitle": "වස්සකාර සූත්‍රය"
    },
    {
      "number": 188,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho upako maṇḍikāputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho upako maṇḍikāputto bhagavantaṃ etadavoca – ‘‘Ahañhi, bhante, evaṃvādī evaṃdiṭṭhi – ‘yo koci parūpārambhaṃ vatteti, parūpārambhaṃ vattento sabbo so [sabbaso (sī. pī.)] na upapādeti. Anupapādento gārayho hoti upavajjo’’’ti. ‘‘Parūpārambhaṃ ce, upaka, vatteti parūpārambhaṃ vattento na upapādeti, anupapādento gārayho hoti upavajjo. Tvaṃ kho, upaka, parūpārambhaṃ vattesi, parūpārambhaṃ vattento na upapādesi, anupapādento gārayho hosi upavajjo’’ti. ‘‘Seyyathāpi, bhante, ummujjamānakaṃyeva mahatā pāsena bandheyya; evamevaṃ kho ahaṃ, bhante, ummujjamānakoyeva bhagavatā mahatā vādapāsena [mahatā pāsena (ka.)] baddho’’ti. ‘‘Idaṃ akusalanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ akusalanti. Taṃ kho panidaṃ akusalaṃ pahātabbanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ akusalaṃ pahātabbanti. ‘‘Idaṃ kusalanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ kusalanti. Taṃ kho panidaṃ kusalaṃ bhāvetabbanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ kusalaṃ bhāvetabba’’nti. Atha kho upako maṇḍikāputto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yena rājā māgadho ajātasattu vedehiputto tenupasaṅkami; upasaṅkamitvā yāvatako ahosi bhagavatā saddhiṃ kathāsallāpo taṃ sabbaṃ rañño māgadhassa ajātasattussa vedehiputtassa ārocesi. Evaṃ vutte rājā māgadho ajātasattu vedehiputto kupito anattamano upakaṃ maṇḍikāputtaṃ etadavoca – ‘‘yāva dhaṃsī vatāyaṃ loṇakāradārako yāva mukharo yāva pagabbo yatra hi nāma taṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ āsādetabbaṃ maññissati; apehi tvaṃ, upaka, vinassa, mā taṃ addasa’’nti. Aṭṭhamaṃ.",
      "english": "Once the Blessed One was staying in Rājagaha, on Vulture Peak Mountain. Then Upaka Maṇḍikāputta approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, Upaka Maṇḍikāputta said to the Blessed One: \"Venerable sir, I hold this view and doctrine: 'Whoever engages in disparaging others, by engaging in disparaging others, such a person does not establish themselves well. Not establishing themselves well, they become blameworthy and censurable.'\" \"If, Upaka, one engages in disparaging others, by engaging in disparaging others, one does not establish oneself well; not establishing oneself well, one becomes blameworthy and censurable. You, Upaka, are engaging in disparaging others; by engaging in disparaging others, you do not establish yourself well, and not establishing yourself well, you are blameworthy and censurable.\" \"Just as, Venerable sir, one might bind with a great noose someone who is just about to emerge, even so, Venerable sir, I, who was just about to emerge, have been bound by the Blessed One with a great net of argument.\" \"This is unwholesome, Upaka, thus have I designated it. Regarding this, there are immeasurable words, immeasurable expressions, an immeasurable teaching of the Dhamma by the Tathāgata — that this is unwholesome. And this unwholesome, Upaka, is to be abandoned, thus have I designated it. Regarding this, there are immeasurable words, immeasurable expressions, an immeasurable teaching of the Dhamma by the Tathāgata — that this unwholesome is to be abandoned. This is wholesome, Upaka, thus have I designated it. Regarding this, there are immeasurable words, immeasurable expressions, an immeasurable teaching of the Dhamma by the Tathāgata — that this is wholesome. And this wholesome, Upaka, is to be cultivated, thus have I designated it. Regarding this, there are immeasurable words, immeasurable expressions, an immeasurable teaching of the Dhamma by the Tathāgata — that this wholesome is to be cultivated.\" Then Upaka Maṇḍikāputta, having delighted in and approved of the Blessed One's words, rose from his seat, paid homage to the Blessed One, and circumambulated him clockwise, before approaching King Ajātasattu Vedehiputta of Magadha. Having approached, he recounted to King Ajātasattu Vedehiputta of Magadha everything that had transpired in his conversation with the Blessed One. When this was said, King Ajātasattu Vedehiputta of Magadha, displeased and ill-humored, said to Upaka Maṇḍikāputta: \"How destructive indeed is this salt-maker's son! How talkative! How impudent! He even dares to think it permissible to offend that Blessed One, the Arahant, the Perfectly Self-Awakened One! Go away, Upaka, perish! Let me not see you again!\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රාජගෘහයෙහි ගිජ්ජකූට පර්වතයෙහි වැඩ වාසය කරන සේක. ඉක්බිති මාණ්ඩිකාපුත්‍ර උපක තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව හුන්නේය. එකත්පස්ව හුන් මාණ්ඩිකාපුත්‍ර උපක තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"වහන්ස, මම මෙබඳු වාද ඇත්තෙක්මි, මෙබඳු දෘෂ්ටි ඇත්තෙක්මි: යම් කිසිවෙක් අනුන්ට උපද්‍රව කරයි නම්, අනුන්ට උපද්‍රව කරන ඔහු කිසිසේත් යහපත් නොවේ. යහපත් නොවන හෙයින් ඔහු ගර්හාවට ලක්විය යුත්තෙක්, දොස් පැවරිය යුත්තෙක් වේ.\"\n\n\"උපක, යම් හෙයකින් අනුන්ට උපද්‍රව කරයි නම්, අනුන්ට උපද්‍රව කරන්නා යහපත් නොවේ නම්, යහපත් නොවන හෙයින් ඔහු ගර්හාවට ලක්විය යුත්තෙක්, දොස් පැවරිය යුත්තෙක් වේ. උපක, නුඹ අනුන්ට උපද්‍රව කළේය. අනුන්ට උපද්‍රව කළ නුඹ යහපත් නොවූයෙහි. යහපත් නොවන හෙයින් නුඹ ගර්හාවට ලක්විය යුත්තෙක්, දොස් පැවරිය යුත්තෙක් වූයෙහි.\"\n\n\"වහන්ස, යම් සේ මතු වන්නා වූ යමෙකුට මහත් පාශයකින් බඳින්නේද, එපරිද්දෙන්ම, වහන්ස, මතු වන්නා වූ මාම භාග්‍යවතුන් වහන්සේ විසින් මහත් වාදපාශයකින් බඳින ලද්දේය.\"\n\n\"උපක, මෙය අකුසල යැයි මා විසින් ප්‍රඥප්ත කරන ලදී. එහි අප්‍රමාණ පද ද, අප්‍රමාණ ව්‍යංජන ද, අප්‍රමාණ වූ තථාගතයන් වහන්සේගේ ධර්ම දේශනා ද ඇත – මෙය අකුසල යැයි යනුවෙන්. උපක, එම අකුසලය ප්‍රහාණය කළ යුතු යැයි ද මා විසින් ප්‍රඥප්ත කරන ලදී. එහි අප්‍රමාණ පද ද, අප්‍රමාණ ව්‍යංජන ද, අප්‍රමාණ වූ තථාගතයන් වහන්සේගේ ධර්ම දේශනා ද ඇත – මෙය අකුසලය, එය ප්‍රහාණය කළ යුතු යැයි යනුවෙන්.\"\n\n\"උපක, මෙය කුසල යැයි ද මා විසින් ප්‍රඥප්ත කරන ලදී. එහි අප්‍රමාණ පද ද, අප්‍රමාණ ව්‍යංජන ද, අප්‍රමාණ වූ තථාගතයන් වහන්සේගේ ධර්ම දේශනා ද ඇත – මෙය කුසල යැයි යනුවෙන්. උපක, එම කුසලය භාවනා කළ යුතු යැයි ද මා විසින් ප්‍රඥප්ත කරන ලදී. එහි අප්‍රමාණ පද ද, අප්‍රමාණ ව්‍යංජන ද, අප්‍රමාණ වූ තථාගතයන් වහන්සේගේ ධර්ම දේශනා ද ඇත – මෙය කුසලය, එය භාවනා කළ යුතු යැයි යනුවෙන්.\"\n\nඉක්බිති මාණ්ඩිකාපුත්‍ර උපක තෙමේ භාග්‍යවතුන් වහන්සේගේ වචනය අභිනන්දනය කොට, අනුමෝදන්ව, අසුනෙන් නැගිට භාග්‍යවතුන් වහන්සේට වන්දනා කොට, ප්‍රදක්ෂිණා කොට, විදේහීපුත්‍ර මාගධ අජාතසත්තු රජු වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ යම්තාක් කථාවක් වූයේ ද, ඒ සියල්ල විදේහීපුත්‍ර මාගධ අජාතසත්තු රජුට දැන්වීය. මෙසේ කියනු ලැබූ කල්හි, විදේහීපුත්‍ර මාගධ අජාතසත්තු රජු කෝපයට පත් වූයේ, නොසතුටු වූයේ, මාණ්ඩිකාපුත්‍ර උපකට මෙය කීවේය: \"මේ ලුණු කර්මාන්තය කරන්නා කෙතරම් විනාශකාරී දැ! කෙතරම් වාචාල දැ! කෙතරම් නිර්භීත දැ! යම් හෙයකින් ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට අපහාස කළ යුතු යැයි සිතන්නේය. උපක, නුඹ යව, විනාශ වව, නුඹව නොදකිමි!\"",
      "paliTitle": "Upakasuttaṃ",
      "englishTitle": "Upaka Sutta",
      "sinhalaTitle": "උපක සූත‍්‍රය"
    },
    {
      "number": 189,
      "pali": "‘‘Cattārome, bhikkhave, sacchikaraṇīyā dhammā. Katame cattāro? Atthi, bhikkhave, dhammā kāyena sacchikaraṇīyā; atthi, bhikkhave, dhammā satiyā sacchikaraṇīyā; atthi, bhikkhave, dhammā cakkhunā sacchikaraṇīyā; atthi, bhikkhave, dhammā paññāya sacchikaraṇīyā. Katame ca, bhikkhave, dhammā kāyena sacchikaraṇīyā? Aṭṭha vimokkhā, bhikkhave, kāyena sacchikaraṇīyā. ‘‘Katame ca, bhikkhave, dhammā satiyā sacchikaraṇīyā? Pubbenivāso, bhikkhave, satiyā sacchikaraṇīyo. ‘‘Katame ca, bhikkhave, dhammā cakkhunā sacchikaraṇīyā? Sattānaṃ cutūpapāto, bhikkhave, cakkhunā sacchikaraṇīyo. ‘‘Katame ca, bhikkhave, dhammā paññāya sacchikaraṇīyā? Āsavānaṃ khayo, bhikkhave, paññāya sacchikaraṇīyo. Ime kho, bhikkhave, cattāro sacchikaraṇīyā dhammā’’ti. Navamaṃ.",
      "english": "Monks, there are these four things to be realized. Which four? Monks, there are things to be realized through the body; monks, there are things to be realized through recollection; monks, there are things to be realized through the divine eye; monks, there are things to be realized through wisdom.\n\nAnd which phenomena, monks, are to be realized through the body? Monks, the eight liberations are to be realized through the body.\n\nAnd which phenomena, monks, are to be realized through recollection? Monks, the recollection of past lives is to be realized through recollection.\n\nAnd which phenomena, monks, are to be realized through the divine eye? Monks, the passing away and reappearance of beings is to be realized through the divine eye.\n\nAnd which phenomena, monks, are to be realized through wisdom? Monks, the destruction of the taints is to be realized through wisdom.\n\nMonks, these are the four things to be realized.",
      "sinhala": "මහණෙනි, සාක්‍ෂාත් කළ යුතු ධර්‍මතා හතරක් ඇත. ඒ කවර හතරක්ද?\n\nමහණෙනි, කයින් සාක්‍ෂාත් කළ යුතු ධර්‍මතා ඇත; මහණෙනි, සතියෙන් සාක්‍ෂාත් කළ යුතු ධර්‍මතා ඇත; මහණෙනි, ඇසින් සාක්‍ෂාත් කළ යුතු ධර්‍මතා ඇත; මහණෙනි, ප්‍රඥාවෙන් සාක්‍ෂාත් කළ යුතු ධර්‍මතා ඇත.\n\nමහණෙනි, කයින් සාක්‍ෂාත් කළ යුතු ධර්‍මතා කවරේද? මහණෙනි, අෂ්ට විමෝක්‍ෂයෝ කයින් සාක්‍ෂාත් කළ යුතු ධර්‍මතා වෙති.\n\nමහණෙනි, සතියෙන් සාක්‍ෂාත් කළ යුතු ධර්‍මතා කවරේද? මහණෙනි, පූර්ව නිවාසය සතියෙන් සාක්‍ෂාත් කළ යුතු ධර්‍මතාවකි.\n\nමහණෙනි, ඇසින් සාක්‍ෂාත් කළ යුතු ධර්‍මතා කවරේද? මහණෙනි, සත්ත්වයන්ගේ චුති-උප්පත්තිය ඇසින් සාක්‍ෂාත් කළ යුතු ධර්‍මතාවකි.\n\nමහණෙනි, ප්‍රඥාවෙන් සාක්‍ෂාත් කළ යුතු ධර්‍මතා කවරේද? මහණෙනි, ආශ්‍රවයන් ක්ෂය කිරීම ප්‍රඥාවෙන් සාක්‍ෂාත් කළ යුතු ධර්‍මතාවකි.\n\nමහණෙනි, මේවා සාක්‍ෂාත් කළ යුතු ධර්‍මතා හතර වෙති.",
      "paliTitle": "Sacchikaraṇīyasuttaṃ",
      "englishTitle": "The Discourse on Realization",
      "sinhalaTitle": "සාක්ෂාත් කළ යුතු සූත්‍රය"
    },
    {
      "number": 190,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho bhagavā tuṇhībhūtaṃ tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā bhikkhū āmantesi – ‘‘Apalāpāyaṃ, bhikkhave, parisā nippalāpāyaṃ, bhikkhave, parisā suddhā sāre patiṭṭhitā. Tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpā parisā dullabhā dassanāyapi lokasmiṃ, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpā parisā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpāya parisāya appaṃ dinnaṃ bahu hoti bahu dinnaṃ bahutaraṃ, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpaṃ parisaṃ alaṃ yojanagaṇanānipi dassanāya gantuṃ api puṭosenāpi, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, (tathārūpāyaṃ, bhikkhave, parisā) [( ) sī. syā. kaṃ. pī. potthakesu natthi]. ‘‘Santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe devappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe brahmappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe āneñjappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe ariyappattā viharanti. ‘‘Kathañca, bhikkhave, bhikkhu devappatto hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi… pe… paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu devappatto hoti. ‘‘Kathañca, bhikkhave, bhikkhu brahmappatto hoti? Idha, bhikkhave, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Karuṇā… muditā… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Evaṃ kho, bhikkhave, bhikkhu brahmappatto hoti. ‘‘Kathañca, bhikkhave, bhikkhu āneñjappatto hoti? Idha, bhikkhave, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu āneñjappatto hoti. ‘‘Kathañca, bhikkhave, bhikkhu ariyappatto hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu ariyappatto hotī’’ti. Dasamaṃ.",
      "english": "At one time, the Blessed One was dwelling in Sāvatthī, at Pubbārāma, in Migāra's mother's palace. Now at that time, on the Uposatha day, the Blessed One was seated surrounded by the assembly of bhikkhus. Then the Blessed One, observing the silent, utterly silent assembly of bhikkhus, addressed the bhikkhus: \"This assembly, bhikkhus, is free from chatter; this assembly, bhikkhus, is free from idle talk, pure, established in essence. Such is this assembly of bhikkhus, bhikkhus; such is this assembly. An assembly like this is rare to see in the world; such is this assembly of bhikkhus, bhikkhus; such is this assembly. An assembly like this is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world; such is this assembly of bhikkhus, bhikkhus; such is this assembly. To an assembly like this, a little given becomes much, and much given becomes much more; such is this assembly of bhikkhus, bhikkhus; such is this assembly. For an assembly like this, it is fitting to travel many leagues to see it, even carrying provisions; such is this assembly of bhikkhus.\"\n\n\"There are, bhikkhus, bhikkhus in this assembly who have attained to the divine abodes; there are, bhikkhus, bhikkhus in this assembly who have attained to the Brahma abodes; there are, bhikkhus, bhikkhus in this assembly who have attained to the imperturbable abodes; there are, bhikkhus, bhikkhus in this assembly who have attained to the noble states.\"\n\n\"And how, bhikkhus, does a bhikkhu attain to the divine abodes? Here, bhikkhus, a bhikkhu—quite secluded from sensual pleasures, secluded from unwholesome states—enters and dwells in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and happiness. With the stilling of initial application and sustained application, by gaining inner tranquility and unification of mind, he enters and dwells in the second jhāna, which is without initial application and sustained application, born of concentration, filled with rapture and happiness. With the fading of rapture, he dwells in equanimity, mindful and clearly comprehending, and he experiences happiness with the body; he enters and dwells in the third jhāna of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the disappearance of former joy and sorrow, he enters and dwells in the fourth jhāna, which is neither painful nor pleasant, and purified by equanimity and mindfulness. It is in this way, bhikkhus, that a bhikkhu attains to the divine abodes.\"\n\n\"And how, bhikkhus, does a bhikkhu attain to the Brahma abodes? Here, bhikkhus, a bhikkhu dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus above, below, across, everywhere, in every way, he dwells pervading the entire world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, free from hostility, free from ill will. He dwells pervading one direction with a mind imbued with compassion... with sympathetic joy... with equanimity, likewise the second, likewise the third, likewise the fourth. Thus above, below, across, everywhere, in every way, he dwells pervading the entire world with a mind imbued with equanimity, abundant, exalted, immeasurable, free from hostility, free from ill will. It is in this way, bhikkhus, that a bhikkhu attains to the Brahma abodes.\"\n\n\"And how, bhikkhus, does a bhikkhu attain to the imperturbable abodes? Here, bhikkhus, by completely surmounting perceptions of form, by the disappearance of perceptions of sensory impact, by not attending to perceptions of diversity, thinking, ‘Space is infinite,’ he enters and dwells in the sphere of infinite space. By completely surmounting the sphere of infinite space, thinking, ‘Consciousness is infinite,’ he enters and dwells in the sphere of infinite consciousness. By completely surmounting the sphere of infinite consciousness, thinking, ‘There is nothing at all,’ he enters and dwells in the sphere of nothingness. By completely surmounting the sphere of nothingness, he enters and dwells in the sphere of neither perception nor non-perception. It is in this way, bhikkhus, that a bhikkhu attains to the imperturbable abodes.\"\n\n\"And how, bhikkhus, does a bhikkhu attain to the noble states? Here, bhikkhus, a bhikkhu understands ‘This is suffering’ as it actually is; he understands ‘This is the origin of suffering’ as it actually is; he understands ‘This is the cessation of suffering’ as it actually is; he understands ‘This is the path leading to the cessation of suffering’ as it actually is. It is in this way, bhikkhus, that a bhikkhu attains to the noble states.\"",
      "sinhala": "එක් සමයෙක භාග්‍ය‍වතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයෙහි මිගාරමාතු ප‍්‍රාසාදයෙහි වැඩවසන සේක. එසමයෙහි භාග්‍ය‍වතුන් වහන්සේ එදවස් උපෝසථයෙහි භික්ෂුසංඝයා පිරිවරා වැඩසිටින සේක. ඉක්බිති භාග්‍ය‍වතුන් වහන්සේ නිහඬව සිටි භික්ෂුසංඝයා වහන්සේලා දෙස බලා භික්ෂූන්ට මෙසේ වදාළ සේක:\n\n\"මහණෙනි, මේ පිරිස නිස්සාර වූ වචනවලින් තොරය, මහණෙනි, මේ පිරිස නිරර්ථක කථාවලින් තොරය, පිරිසුදුය, සාරවත් ධර්‍මයෙහි පිහිටා සිටින්නීය. මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ එබඳුය, මහණෙනි, මේ පිරිස එබඳුය. ලෝකයෙහි දැකීම පවා දුර්‍ලභ වූ පිරිසක් එබඳුය. මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ එබඳුය, මහණෙනි, මේ පිරිස එබඳුය. යම්බඳු පිරිසක් ආහුණෙය්‍ය (දුර සිට පූජා ගෙන ගොස් පිදිය යුතු), පාහුණෙය්‍ය (තමන් වෙත එළඹෙන අමුත්තන්ට පිදිය යුතු), දක්ඛිණෙය්‍ය (දක්ෂිණාවට සුදුසු), අඤ්ජලිකරණීය (ඇඳිලි කොට වැඳිය යුතු) වනවාද, ලෝකයාට අනුත්තර වූ පින්කෙතක් වනවාද, මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ එබඳුය, මහණෙනි, මේ පිරිස එබඳුය. යම්බඳු පිරිසකට අල්පයක් දීම මහත් ඵල දෙනවාද, මහත් දෙයක් දීම වඩාත් මහත් ඵල දෙනවාද, මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ එබඳුය, මහණෙනි, මේ පිරිස එබඳුය. යම්බඳු පිරිසක් දැකීමට යොදුන් ගණනාවක් වුවත්, පාන්සකුඹුරු ද රැගෙන වුවත්, යාමට සුදුසුද, මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ එබඳුය, මහණෙනි, මේ පිරිස එබඳුය.\n\n\"මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ තුළ දෙව් භාවයට පත් වී වසන භික්ෂූහු සිටිත්. මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ තුළ බ්‍රහ්ම භාවයට පත් වී වසන භික්ෂූහු සිටිත්. මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ තුළ ආනෙඤ්ජ භාවයට පත් වී වසන භික්ෂූහු සිටිත්. මහණෙනි, මේ භික්ෂුසංඝයා වහන්සේ තුළ ආර්‍ය භාවයට පත් වී වසන භික්ෂූහු සිටිත්.\n\n\"මහණෙනි, භික්ෂුවක් දෙව් භාවයට පත් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් කාමයන්ගෙන් වෙන්ව, අකුසල ධර්‍මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප‍්‍රීති සුඛය ඇති ප‍්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මයෙහි පැහැදීම ඇති, සිතේ එකඟතාවය ඇති, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප‍්‍රීති සුඛය ඇති දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ප‍්‍රීතිය කෙරෙහි ද කලකිරීමෙන්, උපේක්ෂාවෙන් යුතුව, සිහි නුවණින් යුතුව, ශරීරයෙන් සුඛය විඳිමින්, ආර්‍යයන් වහන්සේලා යම් ධ්‍යානයක් උපේක්ෂාවෙන් යුක්ත වූ, සිහි නුවණින් යුක්ත වූ, සුඛ විහරණයක් ලෙස පවසනවාද, ඒ තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. සුඛය පහකිරීමෙන් හා දුක පහකිරීමෙන්, පෙර තිබූ සෝමනස්ස දෝමනස්සයන් අභාවයට යාමෙන්, දුක් රහිත, සුඛ රහිත වූ, උපේක්ෂා සතියෙන් පිරිසුදු වූ සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. මහණෙනි, මෙසේ භික්ෂුවක් දෙව් භාවයට පත්වෙයි.\"\n\n\"මහණෙනි, භික්ෂුවක් බ්‍රහ්ම භාවයට පත් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් මෛත්‍රී සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි, එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද පතුරුවයි. මෙසේ උඩින්, යටින්, හරහට, හැමතැන, සර්‍ව ආත්මභාවයන්හි, සමස්ත ලෝකයම මෛත්‍රී සහගත සිතින්, විපුල වූ, මහත් වූ, අප‍්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කරයි. කරුණා සහගත සිතින්... මුදිතා සහගත සිතින්... උපේක්ෂා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි, එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද පතුරුවයි. මෙසේ උඩින්, යටින්, හරහට, හැමතැන, සර්‍ව ආත්මභාවයන්හි, සමස්ත ලෝකයම උපේක්ෂා සහගත සිතින්, විපුල වූ, මහත් වූ, අප‍්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කරයි. මහණෙනි, මෙසේ භික්ෂුවක් බ්‍රහ්ම භාවයට පත්වෙයි.\"\n\n\"මහණෙනි, භික්ෂුවක් ආනෙඤ්ජ භාවයට පත් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් සියලු රූප සංඥාවන් සම්පූර්ණයෙන්ම ඉක්මවා, ප්‍රතිඝ සංඥාවන් අභාවයට යවා, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, 'අනන්ත වූ ආකාශය' යනුවෙන් ආකාසානඤ්චායතනයට පැමිණ වාසය කරයි. සියලු ආකාසානඤ්චායතනයන් සම්පූර්ණයෙන්ම ඉක්මවා, 'අනන්ත වූ විඤ්ඤාණය' යනුවෙන් විඤ්ඤාණඤ්චායතනයට පැමිණ වාසය කරයි. සියලු විඤ්ඤාණඤ්චායතනයන් සම්පූර්ණයෙන්ම ඉක්මවා, 'කිසිවක් නැත' යනුවෙන් ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. සියලු ආකිඤ්චඤ්ඤායතනයන් සම්පූර්ණයෙන්ම ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරයි. මහණෙනි, මෙසේ භික්ෂුවක් ආනෙඤ්ජ භාවයට පත්වෙයි.\"\n\n\"මහණෙනි, භික්ෂුවක් ආර්‍ය භාවයට පත් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවක් 'මෙය දුක' යැයි යථාර්‍ථය පරිදි අවබෝධ කරයි. 'මෙය දුක හටගැනීමට හේතුව' යැයි යථාර්‍ථය පරිදි අවබෝධ කරයි. 'මෙය දුක නැතිකිරීම' යැයි යථාර්‍ථය පරිදි අවබෝධ කරයි. 'මෙය දුක නැතිකිරීමට යන මාර්‍ගය' යැයි යථාර්‍ථය පරිදි අවබෝධ කරයි. මහණෙනි, මෙසේ භික්ෂුවක් ආර්‍ය භාවයට පත්වෙයි.\"",
      "paliTitle": "Uposathasuttaṃ",
      "englishTitle": "The Uposatha Sutta",
      "sinhalaTitle": "උපෝසථ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Brāhmaṇavaggo [yodhājīvavaggo (sī. syā. kaṃ. pī.)] catuttho. Tassuddānaṃ – Yodhā pāṭibhogasutaṃ, abhayaṃ brāhmaṇasaccena pañcamaṃ; Ummaggavassakāro, upako sacchikiriyā ca uposathoti. (20)",
    "english": "The Fourth Chapter on Brahmins",
    "sinhala": "සතරවැනි බ්‍රාහ්මණ වග්ගය"
  }
}