{
  "id": "an4.23",
  "title": {
    "pali": "Duccaritavaggo",
    "english": "The Chapter on Misconduct",
    "sinhala": "දුශ්චරිත වර්ගය"
  },
  "sections": [
    {
      "number": 221,
      "pali": "‘‘Cattārimāni, bhikkhave, vacīduccaritāni. Katamāni cattāri? Musāvādo, pisuṇā vācā, pharusā vācā, samphappalāpo – imāni kho, bhikkhave, cattāri vacīduccaritāni. Cattārimāni, bhikkhave, vacīsucaritāni. Katamāni cattāri? Saccavācā, apisuṇā vācā, saṇhā vācā, mantavācā [mantā vācā (sī. syā. kaṃ. pī.)] – imāni kho, bhikkhave, cattāri vacīsucaritānī’’ti. Paṭhamaṃ.",
      "english": "“Monks, there are these four kinds of verbal misconduct. Which four? False speech, slanderous speech, harsh speech, and frivolous speech. These, Monks, are the four kinds of verbal misconduct.\n\nMonks, there are these four kinds of verbal good conduct. Which four? Truthful speech, non-slanderous speech, gentle speech, and meaningful speech. These, Monks, are the four kinds of verbal good conduct.”",
      "sinhala": "මහණෙනි, මේවා සතර වචී දුශ්චරිතයෝ වෙති. කවරවාද ඒ සතර? මුසාවාදය, පිසුණා වාචාව, ඵරුෂා වාචාව, සම්ඵප්පලාපය යන මේවාය. මහණෙනි, මේවා සතර වචී දුශ්චරිතයෝ වෙති.\n\nමහණෙනි, මේවා සතර වචී සුචරිතයෝ වෙති. කවරවාද ඒ සතර? සත්‍ය වාචාව, අප්‍රිසුණා වාචාව, සන්හා වාචාව, ප්‍රඥාවන්ත කතාව යන මේවාය. මහණෙනි, මේවා සතර වචී සුචරිතයෝ වෙති.",
      "paliTitle": "Duccaritasuttaṃ",
      "englishTitle": "Discourse on Misconduct",
      "sinhalaTitle": "දුශ‍්චරිත සූත‍්‍රය"
    },
    {
      "number": 222,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ; bahuñca apuññaṃ pasavati. Katamehi catūhi? Kāyaduccaritena, vacīduccaritena, manoduccaritena, micchādiṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. ‘‘Catūhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi catūhi? Kāyasucaritena, vacīsucaritena, manosucaritena, sammādiṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ; bahuñca puññaṃ pasavatī’’ti. Dutiyaṃ.",
      "english": "Monks, an ignorant, uncultivated, ignoble person, endowed with four qualities, brings ruin and damage upon themselves, is blameworthy and reproachable by the wise, and generates much demerit. Which four? Misconduct in body, misconduct in speech, misconduct in mind, and wrong view. It is with these four qualities, monks, that an ignorant, uncultivated, ignoble person brings ruin and damage upon themselves, is blameworthy and reproachable by the wise, and generates much demerit.\n\nMonks, a wise, cultivated, noble person, endowed with four qualities, keeps themselves unharmed and uninjured, is blameless and irreproachable by the wise, and generates much merit. Which four? Good conduct in body, good conduct in speech, good conduct in mind, and right view. It is with these four qualities, monks, that a wise, cultivated, noble person keeps themselves unharmed and uninjured, is blameless and irreproachable by the wise, and generates much merit.",
      "sinhala": "මහණෙනි, මෝඩ, නොදියුණු, අසත්පුරුෂ පුද්ගලයා ධර්ම සතරකින් සමන්විත වූයේ, තමාට හානි පමුණුවා ගනිමින්, තමා විනාශ කර ගනිමින් වාසය කරයි. හෙතෙම විඤ්ඤුජනතාවට දොස් පැවරිය හැකි, නින්දා කළ හැකි තැනැත්තෙක් ද වන්නේය. බොහෝ අකුසල් රැස්කර ගන්නේය. කවර සතරකින්ද යත්: කය දුසිරිතෙන්, වචී දුසිරිතෙන්, මනෝ දුසිරිතෙන් සහ මිථ්‍යාදෘෂ්ටියෙන් යන මේ ධර්ම සතරින් සමන්විත වූ මෝඩ, නොදියුණු, අසත්පුරුෂ පුද්ගලයා තමාට හානි පමුණුවා ගනිමින්, තමා විනාශ කර ගනිමින් වාසය කරයි. හෙතෙම විඤ්ඤුජනතාවට දොස් පැවරිය හැකි, නින්දා කළ හැකි තැනැත්තෙක් ද වන්නේය. බොහෝ අකුසල් රැස්කර ගන්නේය.\n\nමහණෙනි, පණ්ඩිත, දියුණු, සත්පුරුෂ පුද්ගලයා ධර්ම සතරකින් සමන්විත වූයේ, තමාට හානියක් හෝ විනාශයක් නොවන අයුරින් කටයුතු කරමින් වාසය කරයි. හෙතෙම විඤ්ඤුජනතාවට දොස් පැවරිය නොහැකි, නින්දා කළ නොහැකි තැනැත්තෙක් ද වන්නේය. බොහෝ පින් රැස්කර ගන්නේය. කවර සතරකින්ද යත්: කය සුසිරිතෙන්, වචී සුසිරිතෙන්, මනෝ සුසිරිතෙන් සහ සම්මාදිට්ඨියෙන් යන මේ ධර්ම සතරින් සමන්විත වූ පණ්ඩිත, දියුණු, සත්පුරුෂ පුද්ගලයා තමාට හානියක් හෝ විනාශයක් නොවන අයුරින් කටයුතු කරමින් වාසය කරයි. හෙතෙම විඤ්ඤුජනතාවට දොස් පැවරිය නොහැකි, නින්දා කළ නොහැකි තැනැත්තෙක් ද වන්නේය. බොහෝ පින් රැස්කර ගන්නේය.",
      "paliTitle": "Diṭṭhisuttaṃ",
      "englishTitle": "Discourse on Views",
      "sinhalaTitle": "දෘෂ්ටි සූත‍්‍රය"
    },
    {
      "number": 223,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi catūhi? Kāyaduccaritena, vacīduccaritena, manoduccaritena, akataññutā akataveditā – imehi…pe… paṇḍito… kāyasucaritena, vacīsucaritena, manosucaritena kataññutākataveditā…pe…. Tatiyaṃ.",
      "english": "Monks, a foolish, unskilled, ignoble person, possessing four qualities, brings himself to ruin and destruction, is blameworthy and censurable by the wise, and generates much demerit. Which four? Misconduct in body, misconduct in speech, misconduct in mind, and ingratitude or failure to appreciate kindness. Possessing these four qualities, monks, a foolish, unskilled, ignoble person brings himself to ruin and destruction, is blameworthy and censurable by the wise, and generates much demerit. Conversely, a wise, skillful, noble person, possessing four qualities, leads himself without harm or destruction, is blameless and uncensurable by the wise, and generates much merit. Which four? Good conduct in body, good conduct in speech, good conduct in mind, and gratitude or appreciation for kindness. Possessing these four qualities, monks, a wise, skillful, noble person leads himself without harm or destruction, is blameless and uncensurable by the wise, and generates much merit.",
      "sinhala": "භික්ෂූනි, කරුණු සතරකින් යුක්ත වූ අඥාන, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමන් විනාශයටත් පීඩාවටත් පීඩාවටත් පත්කර ගනියි. ඔහු ප‍්‍රඥාවන්තයන්ගේ නින්දාවට හා දොස් කීමට ලක්වෙයි. තවද බොහෝ අකුසල් රැස්කර ගනියි. කවර නම් සතරකින් ද?\nකාය දුෂ්චරිතයෙන්, වචී දුෂ්චරිතයෙන්, මනෝ දුෂ්චරිතයෙන්, අකෘතඥතාවයෙන් හා අකෘතවේදීභාවයෙන් යන මේ කරුණු සතරෙනි.\n\n(අනෙක් අතට) භික්ෂූනි, කරුණු සතරකින් යුක්ත වූ ප‍්‍රඥාවන්ත, පුහුණු වූ, සත්පුරුෂ පුද්ගලයා තමන් විනාශයට හා පීඩාවට පත්කර නොගනියි. ඔහු ප‍්‍රඥාවන්තයන්ගේ නින්දාවට හා දොස් කීමට ලක්නොවෙයි. තවද බොහෝ පින් රැස්කර ගනියි. කවර නම් සතරකින් ද?\nකාය සුචරිතයෙන්, වචී සුචරිතයෙන්, මනෝ සුචරිතයෙන්, කෘතඥතාවයෙන් හා කෘතවේදීභාවයෙන් යන මේ කරුණු සතරෙනි.\n\nතෙවන සූත්‍රයයි.",
      "paliTitle": "Akataññutāsuttaṃ",
      "englishTitle": "Ingratitude Sutta",
      "sinhalaTitle": "අකතඥතා සූත්‍රය"
    },
    {
      "number": 224,
      "pali": "… Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti…pe… pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti…pe…. Catutthaṃ.",
      "english": "He is one who kills living beings; he is one who takes what is not given; he is one who engages in sexual misconduct; he is one who speaks falsely.\n\nHe abstains from killing living beings; he abstains from taking what is not given; he abstains from sexual misconduct; he abstains from false speech.\n\nThe Fourth.",
      "sinhala": "... ප්‍රාණඝාත කරන්නෙක් වෙයි, අදත්තාදානයෙහි යෙදෙන්නෙක් වෙයි, කාමයන්හි වරදවා හැසිරෙන්නෙක් වෙයි, මුසාවාද කරන්නෙක් වෙයි, යනාදී වශයෙන් දස අකුසල කර්මපථයන්හි යෙදෙන්නෙක් වෙයි.\n\nප්‍රාණඝාතයෙන් වැළකුණෙක් වෙයි, අදත්තාදානයෙන් වැළකුණෙක් වෙයි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණෙක් වෙයි, මුසාවාදයෙන් වැළකුණෙක් වෙයි, යනාදී වශයෙන් දස කුසල කර්මපථයන්හි පිහිටියෙක් වෙයි.\n\nසිව්වැන්නයි.",
      "paliTitle": "Pāṇātipātīsuttaṃ",
      "englishTitle": "Discourse on Killing",
      "sinhalaTitle": "ප්‍රාණඝාතී සූත්‍රය"
    },
    {
      "number": 225,
      "pali": "… Micchādiṭṭhiko hoti, micchāsaṅkappo hoti, micchāvāco hoti, micchākammanto hoti…pe… sammādiṭṭhiko hoti, sammāsaṅkappo hoti, sammāvāco hoti, sammākammanto hoti…pe…. Pañcamaṃ.",
      "english": "…one has wrong view, one has wrong intention, one has wrong speech, one has wrong action, one has wrong livelihood, one has wrong effort, one has wrong mindfulness, one has wrong concentration. …one has right view, one has right intention, one has right speech, one has right action, one has right livelihood, one has right effort, one has right mindfulness, one has right concentration. This is the fifth.",
      "sinhala": "මිථ්‍යාදෘෂ්ටියක් ඇත්තෙක් වෙයි, මිථ්‍යාසංකල්පයක් ඇත්තෙක් වෙයි, මිථ්‍යාවචනයක් ඇත්තෙක් වෙයි, මිථ්‍යාකර්මාන්තයක් ඇත්තෙක් වෙයි, මිථ්‍යාආජීවයක් ඇත්තෙක් වෙයි, මිථ්‍යාව්‍ය‌ායාමයක් ඇත්තෙක් වෙයි, මිථ්‍යාසතියක් ඇත්තෙක් වෙයි, මිථ්‍යාසමාධියක් ඇත්තෙක් වෙයි; සම්මාදෘෂ්ටියක් ඇත්තෙක් වෙයි, සම්මාසංකල්පයක් ඇත්තෙක් වෙයි, සම්මාවචනයක් ඇත්තෙක් වෙයි, සම්මාකර්මාන්තයක් ඇත්තෙක් වෙයි, සම්මාආජීවයක් ඇත්තෙක් වෙයි, සම්මාව්‍ය‌ායාමයක් ඇත්තෙක් වෙයි, සම්මාසතියක් ඇත්තෙක් වෙයි, සම්මාසමාධියක් ඇත්තෙක් වෙයි. පස්වැනි කොටසයි.",
      "paliTitle": "Paṭhamamaggasuttaṃ",
      "englishTitle": "First Path Discourse",
      "sinhalaTitle": "පළමු මාර්‍ග සූත්‍රය"
    },
    {
      "number": 226,
      "pali": "… Micchāājīvo hoti, micchāvāyāmo hoti, micchāsati hoti, micchāsamādhi hoti…pe… sammāājīvo hoti, sammāvāyāmo hoti, sammāsati hoti, sammāsamādhi hoti…pe…. Chaṭṭhaṃ.",
      "english": "There is wrong livelihood, there is wrong effort, there is wrong mindfulness, there is wrong concentration, and so on. There is right livelihood, there is right livelihood, there is right effort, there is right mindfulness, there is right concentration, and so on. The sixth.",
      "sinhala": "…වැරදි ආජීවය ද වේ, වැරදි ව්‍යායාමය ද වේ, වැරදි සිහිය ද වේ, වැරදි සමාධිය ද වේ… යහපත් ආජීවය ද වේ, යහපත් ව්‍යායාමය ද වේ, යහපත් සිහිය ද වේ, යහපත් සමාධිය ද වේ…. සයවෙනි කොටස.",
      "paliTitle": "Dutiyamaggasuttaṃ",
      "englishTitle": "The Second Path Discourse",
      "sinhalaTitle": "දෙවන මාර්‍ග සූත‍්‍රය"
    },
    {
      "number": 227,
      "pali": "… Adiṭṭhe diṭṭhavādī hoti, asute sutavādī hoti, amute mutavādī hoti, aviññāte viññātavādī hoti…pe… adiṭṭhe adiṭṭhavādī hoti, asute asutavādī hoti, amute amutavādī hoti, aviññāte aviññātavādī hoti…pe…. Sattamaṃ.",
      "english": "He asserts that he has seen what was not seen; he asserts that he has heard what was not heard; he asserts that he has sensed by smell, taste, or touch what was not sensed by smell, taste, or touch; he asserts that he has cognized what was not cognized.\n\nHe asserts that he has not seen what was not seen; he asserts that he has not heard what was not heard; he asserts that he has not sensed by smell, taste, or touch what was not sensed by smell, taste, or touch; he asserts that he has not cognized what was not cognized.",
      "sinhala": "නොදැකපු දේ දැක්කාය කියා පවසයි, නොඇසූ දේ ඇසුවාය කියා පවසයි, නොදැනගත් දේ දැනගත්තාය කියා පවසයි, නොවැටහුණු දේ වැටහුණාය කියා පවසයි.\n\nනොදැකපු දේ නොදැක්කාය කියා පවසයි, නොඇසූ දේ නොඇසුවාය කියා පවසයි, නොදැනගත් දේ නොදැනගත්තාය කියා පවසයි, නොවැටහුණු දේ නොවැටහුණාය කියා පවසයි.\n\nසත්වන කරුණයි.",
      "paliTitle": "Paṭhamavohārapathasuttaṃ",
      "englishTitle": "The First Discourse on Conventional Expression",
      "sinhalaTitle": "පළමු ව‍්‍යවහාරපථ සූත්‍රය"
    },
    {
      "number": 228,
      "pali": "… Diṭṭhe adiṭṭhavādī hoti, sute asutavādī hoti, mute amutavādī hoti, viññāte aviññātavādī hoti…pe… diṭṭhe diṭṭhavādī hoti, sute sutavādī hoti, mute mutavādī hoti, viññāte viññātavādī hoti… pe…. Aṭṭhamaṃ.",
      "english": "There is one who, regarding what is seen, asserts it as unseen; regarding what is heard, asserts it as unheard; regarding what is sensed, asserts it as unsensed; regarding what is cognized, asserts it as uncognized. Then there is another who, regarding what is seen, asserts it as seen; regarding what is heard, asserts it as heard; regarding what is sensed, asserts it as sensed; and regarding what is cognized, asserts it as cognized.",
      "sinhala": "දුටු දෙය නොදුටුවක් සේ පවසන්නෙක් වෙයි. ඇසූ දෙය නොඇසූවක් සේ පවසන්නෙක් වෙයි. අත්විඳි දෙය අත්නොවිඳින්නක් සේ පවසන්නෙක් වෙයි. අවබෝධ කරගත් දෙය අවබෝධ නොකරගත්තක් සේ පවසන්නෙක් වෙයි.\n\nදුටු දෙය දුටුවක් සේ පවසන්නෙක් වෙයි. ඇසූ දෙය ඇසූවක් සේ පවසන්නෙක් වෙයි. අත්විඳි දෙය අත්විඳින්නක් සේ පවසන්නෙක් වෙයි. අවබෝධ කරගත් දෙය අවබෝධ කරගත්තක් සේ පවසන්නෙක් වෙයි.\n\nඅටවෙනියයි.",
      "paliTitle": "Dutiyavohārapathasuttaṃ",
      "englishTitle": "Second Discourse on the Path of Expression",
      "sinhalaTitle": "දෙවන වෝහාරපථ සූත‍්‍රය"
    },
    {
      "number": 229,
      "pali": "… Assaddho hoti, dussīlo hoti, ahiriko hoti, anottappī hoti…pe… saddho hoti, sīlavā hoti, hirimā hoti, ottappī hoti…pe…. Navamaṃ.",
      "english": "He is faithless, he is unvirtuous, he is without moral shame, he is without moral dread, and so forth. He is endowed with faith, he is virtuous, he is endowed with moral shame, he is endowed with moral dread, and so forth. The Ninth.",
      "sinhala": "...අශ්‍රද්ධාවන්තයෙක් වේ, දුස්සීලයෙක් වේ, නිර්ලජ්ජී අයෙක් වේ, පවට බියක් නැත්තෙක් වේ.\n\nශ්‍රද්ධාවන්තයෙක් වේ, සීලවන්තයෙක් වේ, පවට ලැජ්ජා ඇත්තෙක් වේ, පවට බිය ඇත්තෙක් වේ.\n\nනවවෙනි සූත්‍රයයි.",
      "paliTitle": "Ahirikasuttaṃ",
      "englishTitle": "The Discourse on Shamelessness",
      "sinhalaTitle": "අහිරික සූත‍්‍රය"
    },
    {
      "number": 230,
      "pali": "… Assaddho hoti, dussīlo hoti, kusīto hoti, duppañño hoti…pe… saddho hoti, sīlavā hoti, āraddhavīriyo hoti, paññavā hoti – imehi kho, bhikkhave, catūhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. Dasamaṃ.",
      "english": "He is faithless, he is immoral, he is lazy, he is unwise. He is faithful, he is virtuous, he is energetic, he is wise. Indeed, bhikkhus, a wise, discerning, good person, endowed with these four qualities, protects himself unharmed and uninjured; he is blameless and irreproachable by the discerning, and he generates much merit.",
      "sinhala": "යමෙක් අශ්‍රද්ධාවෙන් යුක්ත වෙයි, දුස්සීල වෙයි, අලස වෙයි, දුෂ්ප්‍රාඥ වෙයි. ශ්‍රද්ධාවෙන් යුක්ත වූ, සිල්වත් වූ, වීර්යය ආරම්භ කළාවූ, ප්‍රඥාවන්ත වූ පුද්ගලයා, භික්‍ෂූනි, මේ ධර්ම සතරින් සමන්විත වූ කල්හි පණ්ඩිතයෙක්, විචක්ෂණයෙක්, සත්පුරුෂයෙක් වෙයි. හෙතෙම තමා අක්ෂතව හා අනුපහතව පවත්වාගනී. විචක්ෂණ පුද්ගලයන්ගේ නින්දා රහිත වෙයි, දෝෂාරෝපණයට ලක් නොවේ. එමෙන්ම බොහෝ පින් රැස් කරයි.",
      "paliTitle": "Duppaññasuttaṃ",
      "englishTitle": "Discourse on the Foolish",
      "sinhalaTitle": "අඥාන සූත්‍රය"
    },
    {
      "number": 231,
      "pali": "‘‘Cattārome, bhikkhave, kavī. Katame cattāro? Cintākavi, sutakavi, atthakavi, paṭibhānakavi – ime kho, bhikkhave, cattāro kavī’’ti. Ekādasamaṃ. ",
      "english": "Monks, there are these four types of inspired speakers. Which four? The inspired speaker of contemplation, the inspired speaker of learning, the inspired speaker of meaning, and the inspired speaker of spontaneous exposition. These, monks, are the four types of inspired speakers.",
      "sinhala": "මහණෙනි, මේ කවීහු සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද? චින්තාකවී, සුතකවී, අත්ථකවී, පටිභානකවී යන මේ කවීහු සතර දෙනා වන්නාහුය.",
      "paliTitle": "Kavisuttaṃ",
      "englishTitle": "The Poet's Discourse",
      "sinhalaTitle": "කවි සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Duccaritavaggo tatiyo. Tassuddānaṃ – Duccaritaṃ diṭṭhi akataññū ca, pāṇātipātāpi dve maggā; Dve vohārapathā vuttā, ahirikaṃ duppaññakavinā cāti.",
    "english": "The Third Chapter on Misconduct",
    "sinhala": "තුන්වන දුශ‍්චරිත වග‍්ගය"
  }
}