{
  "id": "an4.12",
  "title": {
    "pali": "Kesivaggo",
    "english": "The Chapter on Kesi",
    "sinhala": "කේසි වග්ගය"
  },
  "sections": [
    {
      "number": 111,
      "pali": "Atha kho kesi assadammasārathi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho kesiṃ assadammasārathiṃ bhagavā etadavoca – ‘‘tvaṃ khosi, kesi, paññāto assadammasārathīti [saññāto assadammasārathi (sī. syā. kaṃ. pī.)]. Kathaṃ pana tvaṃ, kesi, assadammaṃ vinesī’’ti? ‘‘Ahaṃ kho, bhante, assadammaṃ saṇhenapi vinemi, pharusenapi vinemi, saṇhapharusenapi vinemī’’ti. ‘‘Sace te, kesi, assadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, kinti naṃ karosī’’ti? ‘‘Sace me, bhante, assadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti; hanāmi naṃ, bhante. Taṃ kissa hetu? Mā me ācariyakulassa avaṇṇo ahosī’’ti. ‘‘Bhagavā pana, bhante, anuttaro purisadammasārathi. Kathaṃ pana, bhante, bhagavā purisadammaṃ vinetī’’ti? ‘‘Ahaṃ kho, kesi, purisadammaṃ saṇhenapi vinemi, pharusenapi vinemi, saṇhapharusenapi vinemi. Tatridaṃ, kesi, saṇhasmiṃ – iti kāyasucaritaṃ iti kāyasucaritassa vipāko, iti vacīsucaritaṃ iti vacīsucaritassa vipāko, iti manosucaritaṃ iti manosucaritassa vipāko, iti devā, iti manussāti. Tatridaṃ, kesi, pharusasmiṃ – iti kāyaduccaritaṃ iti kāyaduccaritassa vipāko, iti vacīduccaritaṃ iti vacīduccaritassa vipāko, iti manoduccaritaṃ iti manoduccaritassa vipāko, iti nirayo, iti tiracchānayoni, iti pettivisayo’’ti. ‘‘Tatridaṃ, kesi, saṇhapharusasmiṃ – iti kāyasucaritaṃ iti kāyasucaritassa vipāko, iti kāyaduccaritaṃ iti kāyaduccaritassa vipāko, iti vacīsucaritaṃ iti vacīsucaritassa vipāko, iti vacīduccaritaṃ iti vacīduccaritassa vipāko, iti manosucaritaṃ iti manosucaritassa vipāko, iti manoduccaritaṃ iti manoduccaritassa vipāko, iti devā, iti manussā, iti nirayo, iti tiracchānayoni, iti pettivisayo’’ti. ‘‘Sace te, bhante, purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, kinti naṃ bhagavā karotī’’ti? ‘‘Sace me, kesi, purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, hanāmi naṃ, kesī’’ti. ‘‘Na kho, bhante, bhagavato pāṇātipāto kappati. Atha ca pana bhagavā evamāha – ‘hanāmi, naṃ kesī’’’ti! ‘‘Saccaṃ, kesi! Na tathāgatassa pāṇātipāto kappati. Api ca yo purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, na taṃ tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññanti. Vadho heso, kesi, ariyassa vinaye – yaṃ na tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññantī’’ti. ‘‘So hi nūna, bhante, suhato hoti – yaṃ na tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññantīti. Abhikkantaṃ, bhante, abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Paṭhamaṃ.",
      "english": "Then Kesi the horse-trainer approached the Blessed One, and having approached, he paid homage to the Blessed One and sat down to one side. As Kesi the horse-trainer was sitting to one side, the Blessed One said this to him: \"Indeed, Kesi, you are known as a horse-trainer. But how, Kesi, do you train a wild horse?\"\n\n\"Venerable sir, I train a wild horse with gentleness, with harshness, and with a combination of gentleness and harshness.\"\n\"If, Kesi, a wild horse does not respond to training with gentleness, or with harshness, or with a combination of gentleness and harshness, what do you do with it then?\"\n\"If, Venerable sir, a wild horse does not respond to training with gentleness, or with harshness, or with a combination of gentleness and harshness, I kill it, Venerable sir. Why is that? So that it does not bring disgrace to my master's family.\"\n\n\"But the Blessed One, Venerable sir, is the unsurpassed trainer of human beings. How, then, Venerable sir, does the Blessed One train human beings?\"\n\"Indeed, Kesi, I train human beings with gentleness, with harshness, and with a combination of gentleness and harshness. And this, Kesi, is the gentle method: 'Such is wholesome bodily conduct, such is the result of wholesome bodily conduct; such is wholesome verbal conduct, such is the result of wholesome verbal conduct; such is wholesome mental conduct, such is the result of wholesome mental conduct; such are the devas, such are human beings.'\nAnd this, Kesi, is the harsh method: 'Such is unwholesome bodily conduct, such is the result of unwholesome bodily conduct; such is unwholesome verbal conduct, such is the result of unwholesome verbal conduct; such is unwholesome mental conduct, such is the result of unwholesome mental conduct; such is hell, such is the animal realm, such is the realm of hungry ghosts.'\nAnd this, Kesi, is the combined gentle and harsh method: 'Such is wholesome bodily conduct, such is the result of wholesome bodily conduct; such is unwholesome bodily conduct, such is the result of unwholesome bodily conduct; such is wholesome verbal conduct, such is the result of wholesome verbal conduct; such is unwholesome verbal conduct, such is the result of unwholesome verbal conduct; such is wholesome mental conduct, such is the result of wholesome mental conduct; such is unwholesome mental conduct, such is the result of unwholesome mental conduct; such are the devas, such are human beings, such is hell, such is the animal realm, such is the realm of hungry ghosts.'\"\n\n\"If, Venerable sir, a human being does not respond to training with gentleness, or with harshness, or with a combination of gentleness and harshness, what does the Blessed One do with him then?\"\n\"If, Kesi, a human being does not respond to training with gentleness, or with harshness, or with a combination of gentleness and harshness, I kill him, Kesi.\"\n\"Indeed, Venerable sir, the Blessed One does not permit the taking of life. And yet the Blessed One says, 'I kill him, Kesi!'\"\n\"It is true, Kesi, that the Tathagata does not permit the taking of life. However, a human being who does not respond to training with gentleness, or with harshness, or with a combination of gentleness and harshness – the Tathagata does not consider him worthy of being spoken to or instructed, nor do other discerning practitioners of the holy life consider him worthy of being spoken to or instructed. This, Kesi, is indeed a 'killing' in the Noble Discipline: when the Tathagata does not consider one worthy of being spoken to or instructed, and nor do other discerning practitioners of the holy life consider one worthy of being spoken to or instructed.\"\n\"Then, Venerable sir, he is indeed truly 'killed' – one whom neither the Tathagata considers worthy of being spoken to or instructed, nor do other discerning practitioners of the holy life consider worthy of being spoken to or instructed. Excellent, Venerable sir! Excellent, Venerable sir! Let the Blessed One accept me as a lay follower who has taken refuge for life from this day forward.\"",
      "sinhala": "එවිට කේසි අශ්ව දමනය කරන්නා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි කේසි අශ්ව දමනය කරන්නාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"කේසි, ඔබ ප්‍රකට අශ්ව දමනය කරන්නෙක් වන්නේය. කේසි, ඔබ අශ්වයන් දමනය කරන්නේ කෙසේද?\"\n\n\"වහන්ස, මම නම් අශ්වයා මෘදුවෙන් ද හික්මවමි, රළු ලෙසින් ද හික්මවමි, මෘදු හා රළු යන දෙයාකාරයෙන් ද හික්මවමි.\"\n\n\"කේසි, යම් හෙයකින් ඔබට, අශ්වයා මෘදු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, මෘදු හා රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, ඔබ ඌට කුමක් කරන්නේද?\"\n\n\"වහන්ස, යම් හෙයකින් මට, අශ්වයා මෘදු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, මෘදු හා රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, මම ඌ මරා දමමි, වහන්ස. ඒ කුමන හේතුවක් නිසාද යත්, මගේ ආචාර්ය කුලයට අවනම්බුවක් නොවේවා!\"\n\n\"වහන්ස, භාග්‍යවතුන් වහන්සේ නම් අනුත්තර පුරිසදම්මසාරථී (පුරුෂයන් දමනය කිරීමේ අග්‍ර ශ්‍රේෂ්ඨ ශාස්තෘවරයා) ය. වහන්ස, භාග්‍යවතුන් වහන්සේ පුරුෂයන් දමනය කරන්නේ කෙසේද?\"\n\n\"කේසි, මම නම් පුරුෂයා මෘදුවෙන් ද හික්මවමි, රළු ලෙසින් ද හික්මවමි, මෘදු හා රළු යන දෙයාකාරයෙන් ද හික්මවමි. කේසි, එහි මෘදු ක්‍රමය මෙසේය – 'මෙය කාය සුචරිතයයි, මෙය කාය සුචරිතයේ විපාකයයි, මෙය වචී සුචරිතයයි, මෙය වචී සුචරිතයේ විපාකයයි, මෙය මනෝ සුචරිතයයි, මෙය මනෝ සුචරිතයේ විපාකයයි, මෙය දෙව් ලොවයි, මෙය මිනිස් ලොවයි' යනාදී වශයෙන් දේශනා කිරීමයි. කේසි, එහි රළු ක්‍රමය මෙසේය – 'මෙය කාය දුශ්චරිතයයි, මෙය කාය දුශ්චරිතයේ විපාකයයි, මෙය වචී දුශ්චරිතයයි, මෙය වචී දුශ්චරිතයේ විපාකයයි, මෙය මනෝ දුශ්චරිතයයි, මෙය මනෝ දුශ්චරිතයේ විපාකයයි, මෙය නිරයයි, මෙය තිරිසන් යෝනියයි, මෙය ප්‍රේත විෂයයි' යනාදී වශයෙන් දේශනා කිරීමයි. කේසි, එහි මෘදු හා රළු යන දෙයාකාර ක්‍රමය මෙසේය – 'මෙය කාය සුචරිතයයි, මෙය කාය සුචරිතයේ විපාකයයි, මෙය කාය දුශ්චරිතයයි, මෙය කාය දුශ්චරිතයේ විපාකයයි, මෙය වචී සුචරිතයයි, මෙය වචී සුචරිතයේ විපාකයයි, මෙය වචී දුශ්චරිතයයි, මෙය වචී දුශ්චරිතයේ විපාකයයි, මෙය මනෝ සුචරිතයයි, මෙය මනෝ සුචරිතයේ විපාකයයි, මෙය මනෝ දුශ්චරිතයයි, මෙය මනෝ දුශ්චරිතයේ විපාකයයි, මෙය දෙව් ලොවයි, මෙය මිනිස් ලොවයි, මෙය නිරයයි, මෙය තිරිසන් යෝනියයි, මෙය ප්‍රේත විෂයයි' යනාදී වශයෙන් දේශනා කිරීමයි.\"\n\n\"වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේට, පුරුෂයා මෘදු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, මෘදු හා රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, භාග්‍යවතුන් වහන්සේ ඌට කුමක් කරන්නේද?\"\n\n\"කේසි, යම් හෙයකින් මට, පුරුෂයා මෘදු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, මෘදු හා රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, කේසි, මම ඌ මරා දමමි.\"\n\n\"වහන්ස, භාග්‍යවතුන් වහන්සේට ප්‍රාණඝාතය සුදුසු නොවේ. එහෙත් භාග්‍යවතුන් වහන්සේ 'කේසි, මම ඌ මරා දමමි' යැයි මෙසේ වදාරයි!\"\n\n\"කේසි, සැබෑය! තථාගතයන් වහන්සේට ප්‍රාණඝාතය සුදුසු නොවේ. එහෙත් යම් පුරුෂයෙක් මෘදු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, මෘදු හා රළු ක්‍රමයෙන් හික්මෙන්නේ නැත්නම්, ඔහුට තථාගතයන් වහන්සේ කතා කිරීමට හෝ අනුශාසනා කිරීමට හෝ සුදුසු යැයි නොසලකයි, නුවණැති සබ්‍රහ්මචාරීන් ද කතා කිරීමට හෝ අනුශාසනා කිරීමට හෝ සුදුසු යැයි නොසලකයි. කේසි, ආර්ය විනයෙහි මෙය මරණයකි – යමක් තථාගතයන් වහන්සේ කතා කිරීමට හෝ අනුශාසනා කිරීමට හෝ සුදුසු යැයි නොසලකයි ද, නුවණැති සබ්‍රහ්මචාරීන් ද කතා කිරීමට හෝ අනුශාසනා කිරීමට හෝ සුදුසු යැයි නොසලකයි ද, එයයි.\"\n\n\"වහන්ස, යමක් තථාගතයන් වහන්සේ කතා කිරීමට හෝ අනුශාසනා කිරීමට හෝ සුදුසු යැයි නොසලකයි ද, නුවණැති සබ්‍රහ්මචාරීන් ද කතා කිරීමට හෝ අනුශාසනා කිරීමට හෝ සුදුසු යැයි නොසලකයි ද, ඔහු සැබැවින්ම හොඳින් මරණයට පත් වූවෙක් වේ.\"\n\n\"ඉතා මැනවි, වහන්ස! ඉතා මැනවි, වහන්ස! වහන්ස, අද පටන් ජීවිතය ඇති තාක් සරණ ගිය උපාසකයෙක් ලෙස මා භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Kesisuttaṃ",
      "englishTitle": "Kesi Sutta",
      "sinhalaTitle": "කේසි සූත‍්‍රය"
    },
    {
      "number": 112,
      "pali": "‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Ajjavena, javena, khantiyā, soraccena – imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti, rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Ajjavena, javena, khantiyā, soraccena – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Dutiyaṃ.",
      "english": "Monks, a fine thoroughbred horse belonging to a king, endowed with four qualities, is worthy of a king, is fit for a king's use, and is reckoned as a very part of the king himself. Which four? Straightforwardness, swiftness, patience, and gentleness. Endowed with these four qualities, monks, a fine thoroughbred horse belonging to a king is worthy of a king, is fit for a king's use, and is reckoned as a very part of the king himself.\n\nEven so, monks, a monk endowed with four qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world. Which four? Straightforwardness, swiftness, patience, and gentleness. Endowed with these four qualities, monks, a monk is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, කරුණු සතරකින් යුක්ත රජුගේ යහපත් ජාති අශ්වයා රජුට සුදුසු ද වේ, රජුට භුක්ති විඳීමට සුදුසු ද වේ, රජුගේ සම්පතක් ලෙස ද සැලකේ. කවර කරුණු සතරකින් ද? සෘජු බවෙන්, වේගවත් බවෙන්, ඉවසීමෙන්, මෘදු ස්වභාවයෙන්. මහණෙනි, මේ කරුණු සතරින් යුක්ත රජුගේ යහපත් ජාති අශ්වයා රජුට සුදුසු ද වේ, රජුට භුක්ති විඳීමට සුදුසු ද වේ, රජුගේ සම්පතක් ලෙස ද සැලකේ.\n\nමහණෙනි, එපරිද්දෙන්ම කරුණු සතරකින් යුක්ත භික්‍ෂුව දූරයන්ගෙන් ගෙනැවිත් දෙන දානයට සුදුසු වේ, ආගන්තුකයන්ට පිරිනමන දානයට සුදුසු වේ, (ශ්‍රද්ධාවෙන්) පිරිනමන දක්‍ෂිණාවන්ට සුදුසු වේ, වැඳීමට හා ගෞරවයට සුදුසු වේ, ලෝකයාගේ අනුත්තර පුණ්‍ය​ක්‍ෂේත්‍රය ද වේ. කවර කරුණු සතරකින් ද? සෘජු බවෙන්, ක්‍රියාශීලී බවෙන්, ඉවසීමෙන්, මෘදු ස්වභාවයෙන්. මහණෙනි, මේ කරුණු සතරින් යුක්ත භික්‍ෂුව දූරයන්ගෙන් ගෙනැවිත් දෙන දානයට සුදුසු වේ, ආගන්තුකයන්ට පිරිනමන දානයට සුදුසු වේ, (ශ්‍රද්ධාවෙන්) පිරිනමන දක්‍ෂිණාවන්ට සුදුසු වේ, වැඳීමට හා ගෞරවයට සුදුසු වේ, ලෝකයාගේ අනුත්තර පුණ්‍ය​ක්‍ෂේත්‍රය ද වේ.",
      "paliTitle": "Javasuttaṃ",
      "englishTitle": "Discourse on Speed",
      "sinhalaTitle": "ජව සූත්‍රය"
    },
    {
      "number": 113,
      "pali": "‘‘Cattārome, bhikkhave, bhadrā assājānīyā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco bhadro assājānīyo patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ [kathamassāhaṃ (ka.)] paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, paṭhamo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati, api ca kho lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, dutiyo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati nāpi lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati, api ca kho cammavedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, tatiyo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati nāpi lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati nāpi cammavedhaviddho saṃvijjati saṃvegaṃ āpajjati, api ca kho aṭṭhivedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, catuttho bhadro assājānīyo santo saṃvijjamāno lokasmiṃ. Ime kho, bhikkhave, cattāro bhadrā assājānīyā santo saṃvijjamānā lokasmiṃ. ‘‘Evamevaṃ kho, bhikkhave, cattārome bhadrā purisājānīyā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco bhadro purisājānīyo suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato [kālakato (sī. syā. kaṃ. pī.)] vā’ti. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ [paramatthasaccaṃ (ka.) ma. ni. 2.183 passitabbaṃ] sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, paṭhamo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, api ca kho sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, dutiyo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, nāpi sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā, api ca khvassa ñāti vā sālohito vā dukkhito vā hoti kālaṅkato vā. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo cammavedhaviddho saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, tatiyo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, nāpi sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā, nāpissa ñāti vā sālohito vā dukkhito vā hoti kālaṅkato vā, api ca kho sāmaññeva phuṭṭho hoti sārīrikāhi vedanāhi dukkhāhi tibbāhi [tippāhi (sī. pī.)] kharāhi kaṭukāhi asātāhi amanāpāhi pāṇaharāhi. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo aṭṭhivedhaviddho saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, catuttho bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ. Ime kho, bhikkhave, cattāro bhadrā purisājānīyā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ.",
      "english": "Monks, these four excellent thoroughbred horses exist and are found in the world. Which four? Here, monks, some excellent thoroughbred horse, seeing the shadow of the goad, is aroused and experiences a sense of urgency, thinking: ‘What task will the horse-trainer set for me today? How shall I respond to him?’ Such a type, monks, is one excellent thoroughbred horse here. This, monks, is the first excellent thoroughbred horse that exists and is found in the world.\n\nFurthermore, monks, some excellent thoroughbred horse here is not aroused and does not experience a sense of urgency merely by seeing the shadow of the goad, but it is aroused and experiences a sense of urgency when pierced by the hair-tip of the goad, thinking: ‘What task will the horse-trainer set for me today? How shall I respond to him?’ Such a type, monks, is one excellent thoroughbred horse here. This, monks, is the second excellent thoroughbred horse that exists and is found in the world.\n\nFurthermore, monks, some excellent thoroughbred horse here is not aroused and does not experience a sense of urgency merely by seeing the shadow of the goad, nor when pierced by the hair-tip of the goad, but it is aroused and experiences a sense of urgency when pierced through the hide, thinking: ‘What task will the horse-trainer set for me today? How shall I respond to him?’ Such a type, monks, is one excellent thoroughbred horse here. This, monks, is the third excellent thoroughbred horse that exists and is found in the world.\n\nFurthermore, monks, some excellent thoroughbred horse here is not aroused and does not experience a sense of urgency merely by seeing the shadow of the goad, nor when pierced by the hair-tip of the goad, nor when pierced through the hide, but it is aroused and experiences a sense of urgency when pierced through the bone, thinking: ‘What task will the horse-trainer set for me today? How shall I respond to him?’ Such a type, monks, is one excellent thoroughbred horse here. This, monks, is the fourth excellent thoroughbred horse that exists and is found in the world. These, monks, are the four excellent thoroughbred horses that exist and are found in the world.\n\nIn the same way, monks, these four excellent thoroughbred persons exist and are found in the world. Which four? Here, monks, some excellent thoroughbred person hears: ‘In such-and-such a village or town, a woman or a man is afflicted with suffering or has died.’ Through that, he is aroused and experiences a sense of urgency. Being thus stirred, he applies himself wisely. Having resolute energy, he realizes the highest truth through direct experience and sees it penetratingly with wisdom. Just as, monks, that excellent thoroughbred horse, seeing the shadow of the goad, is aroused and experiences a sense of urgency, so too, monks, I say this excellent thoroughbred person is comparable. Such a type, monks, is one excellent thoroughbred person here. This, monks, is the first excellent thoroughbred person that exists and is found in the world.\n\nFurthermore, monks, some excellent thoroughbred person here does not merely hear: ‘In such-and-such a village or town, a woman or a man is afflicted with suffering or has died,’ but rather personally sees a woman or a man afflicted with suffering or who has died. Through that, he is aroused and experiences a sense of urgency. Being thus stirred, he applies himself wisely. Having resolute energy, he realizes the highest truth through direct experience and sees it penetratingly with wisdom. Just as, monks, that excellent thoroughbred horse, when pierced by the hair-tip of the goad, is aroused and experiences a sense of urgency, so too, monks, I say this excellent thoroughbred person is comparable. Such a type, monks, is one excellent thoroughbred person here. This, monks, is the second excellent thoroughbred person that exists and is found in the world.\n\nFurthermore, monks, some excellent thoroughbred person here does not merely hear: ‘In such-and-such a village or town, a woman or a man is afflicted with suffering or has died,’ nor does he personally see a woman or a man afflicted with suffering or who has died, but rather a relative of his or a blood-relation is afflicted with suffering or has died. Through that, he is aroused and experiences a sense of urgency. Being thus stirred, he applies himself wisely. Having resolute energy, he realizes the highest truth through direct experience and sees it penetratingly with wisdom. Just as, monks, that excellent thoroughbred horse, when pierced through the hide, is aroused and experiences a sense of urgency, so too, monks, I say this excellent thoroughbred person is comparable. Such a type, monks, is one excellent thoroughbred person here. This, monks, is the third excellent thoroughbred person that exists and is found in the world.\n\nFurthermore, monks, in this case, some excellent thoroughbred person does not hear, 'In such and such a village or town, a woman or man has suffered or passed away,' nor does he himself see a woman or man suffering or passed away, nor is his relative or blood-relation suffering or passed away. But he himself is afflicted by bodily feelings that are painful, sharp, harsh, bitter, disagreeable, unpleasant, and life-threatening. Stirred by this, he experiences a sense of spiritual urgency. Being thus urged, he applies himself wisely. Having put forth resolute effort, he realizes the ultimate truth directly and sees it with penetrating wisdom. Just as, monks, that excellent thoroughbred horse, pierced by an eight-thorned dart, is stirred and experiences urgency, so too, monks, I declare this excellent thoroughbred person to be comparable. Such an excellent thoroughbred person, monks, is found here. This, monks, is the fourth excellent thoroughbred person existing and found in the world. These, monks, are the four excellent thoroughbred persons existing and found in the world.",
      "sinhala": "මහණෙනි, මේ සතර දෙනෙක් භද්‍ර අජානීය අශ්වයෝ ලෝකයේ සිටිති, පවතිති. කවරහුද ඒ සතර දෙනා?\n\nමහණෙනි, මෙහි ඇතැම් භද්‍ර අජානීය අශ්වයෙක් කස පහරෙහි සෙවනැල්ල දැක සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ. ‘අද මාගේ අශ්වදමක සාරථී මට කුමන කාර්යයක් කරවයිද? මම ඊට කෙසේ පිළිතුරු දෙම්ද?’යි (සිතා). මහණෙනි, මෙබඳු භද්‍ර අජානීය අශ්වයෙක් මෙහි වෙයි. මහණෙනි, ලෝකයේ සිටින, පවතින පළමු වන භද්‍ර අජානීය අශ්වයා මොහුය.\n\nමහණෙනි, නැවතත්, මෙහි ඇතැම් භද්‍ර අජානීය අශ්වයෙක් කස පහරෙහි සෙවනැල්ල දැක සංවේගයට පත්වන්නේ හෝ තැතිගැනීමකට පත්වන්නේ හෝ නැත. එහෙත්, ලොම් සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ. ‘අද මාගේ අශ්වදමක සාරථී මට කුමන කාර්යයක් කරවයිද? මම ඊට කෙසේ පිළිතුරු දෙම්ද?’යි (සිතා). මහණෙනි, මෙබඳු භද්‍ර අජානීය අශ්වයෙක් මෙහි වෙයි. මහණෙනි, ලෝකයේ සිටින, පවතින දෙවන භද්‍ර අජානීය අශ්වයා මොහුය.\n\nමහණෙනි, නැවතත්, මෙහි ඇතැම් භද්‍ර අජානීය අශ්වයෙක් කස පහරෙහි සෙවනැල්ල දැක සංවේගයට පත්වන්නේ හෝ තැතිගැනීමකට පත්වන්නේ හෝ නැත. ලොම් සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වන්නේ හෝ තැතිගැනීමකට පත්වන්නේ හෝ නැත. එහෙත්, හම සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ. ‘අද මාගේ අශ්වදමක සාරථී මට කුමන කාර්යයක් කරවයිද? මම ඊට කෙසේ පිළිතුරු දෙම්ද?’යි (සිතා). මහණෙනි, මෙබඳු භද්‍ර අජානීය අශ්වයෙක් මෙහි වෙයි. මහණෙනි, ලෝකයේ සිටින, පවතින තෙවන භද්‍ර අජානීය අශ්වයා මොහුය.\n\nමහණෙනි, නැවතත්, මෙහි ඇතැම් භද්‍ර අජානීය අශ්වයෙක් කස පහරෙහි සෙවනැල්ල දැක සංවේගයට පත්වන්නේ හෝ තැතිගැනීමකට පත්වන්නේ හෝ නැත. ලොම් සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වන්නේ හෝ තැතිගැනීමකට පත්වන්නේ හෝ නැත. හම සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වන්නේ හෝ තැතිගැනීමකට පත්වන්නේ හෝ නැත. එහෙත්, ඇට සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ. ‘අද මාගේ අශ්වදමක සාරථී මට කුමන කාර්යයක් කරවයිද? මම ඊට කෙසේ පිළිතුරු දෙම්ද?’යි (සිතා). මහණෙනි, මෙබඳු භද්‍ර අජානීය අශ්වයෙක් මෙහි වෙයි. මහණෙනි, ලෝකයේ සිටින, පවතින සතර වන භද්‍ර අජානීය අශ්වයා මොහුය. මහණෙනි, ලෝකයේ සිටින, පවතින මේ භද්‍ර අජානීය අශ්වයෝ සතර දෙනා වෙති.\n\nමහණෙනි, එපරිද්දෙන්ම, මේ සතර දෙනෙක් භද්‍ර අජානීය පුරුෂයෝ ලෝකයේ සිටිති, පවතිති. කවරහුද ඒ සතර දෙනා?\n\nමහණෙනි, මෙහි ඇතැම් භද්‍ර අජානීය පුරුෂයෙක් ‘අසුවල් ගමෙහි හෝ නියම්ගමෙහි හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ දුකට පත්ව සිටී, නැතහොත් මිය ගොස් ඇතැ’යි අසයි. හෙතෙම ඒ අසා සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ. සංවේගයට පත්වූ හෙතෙම මැනවින් වීර්යය අරඹයි. සිත යොමුකොට, කාය සාක්ෂාත් කිරීමෙන් පරම සත්‍යය අවබෝධ කරයි, ප්U+200Dරඥාවෙන් එය විනිවිද දකී. මහණෙනි, යම්සේ ඒ භද්‍ර අජානීය අශ්වයා කස පහරෙහි සෙවනැල්ල දැක සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ; මහණෙනි, එසේම මම මේ භද්‍ර අජානීය පුරුෂයාද උපමා කරමි. මහණෙනි, මෙබඳු භද්‍ර අජානීය පුරුෂයෙක් මෙහි වෙයි. මහණෙනි, ලෝකයේ සිටින, පවතින පළමු වන භද්‍ර අජානීය පුරුෂයා මොහුය.\n\nමහණෙනි, නැවතත්, මෙහි ඇතැම් භද්‍ර අජානීය පුරුෂයෙක් ‘අසුවල් ගමෙහි හෝ නියම්ගමෙහි හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ දුකට පත්ව සිටී, නැතහොත් මිය ගොස් ඇතැ’යි අසන්නේ නොවේ. එහෙත්, තමා විසින්ම ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ දුකට පත්ව සිටිනවා හෝ මිය ගොස් සිටිනවා හෝ දකියි. හෙතෙම ඒ දැක සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ. සංවේගයට පත්වූ හෙතෙම මැනවින් වීර්යය අරඹයි. සිත යොමුකොට, කාය සාක්ෂාත් කිරීමෙන් පරම සත්‍යය අවබෝධ කරයි, ප්U+200Dරඥාවෙන් එය විනිවිද දකී. මහණෙනි, යම්සේ ඒ භද්‍ර අජානීය අශ්වයා ලොම් සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ; මහණෙනි, එසේම මම මේ භද්‍ර අජානීය පුරුෂයාද උපමා කරමි. මහණෙනි, මෙබඳු භද්‍ර අජානීය පුරුෂයෙක් මෙහි වෙයි. මහණෙනි, ලෝකයේ සිටින, පවතින දෙවන භද්‍ර අජානීය පුරුෂයා මොහුය.\n\nමහණෙනි, නැවතත්, මෙහි ඇතැම් භද්‍ර අජානීය පුරුෂයෙක් ‘අසුවල් ගමෙහි හෝ නියම්ගමෙහි හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ දුකට පත්ව සිටී, නැතහොත් මිය ගොස් ඇතැ’යි අසන්නේ නොවේ. තමා විසින්ම ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ දුකට පත්ව සිටිනවා හෝ මිය ගොස් සිටිනවා හෝ දකින්නේත් නොවේ. එහෙත්, ඔහුගේ නෑයෙක් හෝ ලේ නෑයෙක් හෝ දුකට පත්ව සිටී, නැතහොත් මිය ගොස් ඇත. හෙතෙම ඒ අසා සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ. සංවේගයට පත්වූ හෙතෙම මැනවින් වීර්යය අරඹයි. සිත යොමුකොට, කාය සාක්ෂාත් කිරීමෙන් පරම සත්‍යය අවබෝධ කරයි, ප්U+200Dරඥාවෙන් එය විනිවිද දකී. මහණෙනි, යම්සේ ඒ භද්‍ර අජානීය අශ්වයා හම සිඳින්නාවූ වේදනාවකින් සංවේගයට පත්වේ, තැතිගැනීමකට පත්වේ; මහණෙනි, එසේම මම මේ භද්‍ර අජානීය පුරුෂයාද උපමා කරමි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් උතුම් පුරිසජානීය පුද්ගලයෙක් “අසුවල් නම් ගමක හෝ නියම්ගමක හෝ ස්‍ත්‍රියක් හෝ පුරුෂයෙක් හෝ දුකට පත්ව සිටී, නැතහොත් මිය ගොස් ඇතැයි” අසන්නේම නැත. තමන් විසින්ම ස්‍ත්‍රියක් හෝ පුරුෂයෙක් හෝ දුකට පත්ව සිටිනවා හෝ මිය ගොස් ඇතිවා හෝ දකින්නේ ද නැත. ඔහුගේ නෑයෙක් හෝ ලේ නෑයෙක් හෝ දුකට පත්ව සිටින්නේ ද නැත, මිය ගොස් ඇත්තේ ද නැත. එහෙත් ඔහුම දුක් සහිත වූ, තීව්‍ර වූ, රළු වූ, කටුක වූ, අප්‍රිය වූ, අමනාප වූ, ප්‍රාණය නසන සුළු වූ ශාරීරික වේදනාවන්ගෙන් පීඩාවට පත්ව සිටී.\n\nඔහු ඒ හේතුවෙන් සංවේගයට පත්වේ, මහත් සංවේගයක් ඇති කර ගනී. සංවේගයට පත් වූ හෙතෙම යෝනිසෝ මනසිකාරයෙන් යුතුව වීර්යය කරයි. වීර්යය කළ සිත් ඇති හෙතෙම කයින්ම පරම සත්‍යය සාක්ෂාත් කරයි, ප්‍රඥාවෙන් ද එය විනිවිද දකී. මහණෙනි, යම්සේ අට ස්ථානයකින් විදිනු ලැබූ උතුම් අශ්වජානීය සතෙක් සංවේගයට පත්ව මහත් සංවේගයක් ඇති කර ගනී ද, මහණෙනි, මම මේ උතුම් පුරිසජානීය පුද්ගලයා ද එබඳු උපමාවක් කොට කියමි. මහණෙනි, මෙබඳු වූ ද ඇතැම් උතුම් පුරිසජානීය පුද්ගලයෙක් වෙයි.\n\nමහණෙනි, ලෝකයෙහි පවත්නා, දක්නට ලැබෙන සිව්වන උතුම් පුරිසජානීය පුද්ගලයා මොහු යි. මහණෙනි, ලෝකයෙහි පවත්නා, දක්නට ලැබෙන උතුම් පුරිසජානීය පුද්ගලයෝ සතර දෙනා මොවුහු යි.",
      "paliTitle": "Patodasuttaṃ",
      "englishTitle": "The Goad Discourse",
      "sinhalaTitle": "පතොද සූත්‍රය"
    },
    {
      "number": 114,
      "pali": "‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño nāgo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño nāgo sotā ca hoti, hantā ca, khantā ca, gantā ca. ‘‘Kathañca, bhikkhave, rañño nāgo sotā hoti? Idha, bhikkhave, rañño nāgo yamenaṃ hatthidammasārathi kāraṇaṃ kāreti – yadi vā katapubbaṃ yadi vā akatapubbaṃ – taṃ aṭṭhiṃ katvā [aṭṭhikatvā (sī. syā. kaṃ. pī.) a. ni. 5.140] manasi katvā sabbacetasā [sabbaṃ cetaso (sabbattha)] samannāharitvā ohitasoto suṇāti. Evaṃ kho, bhikkhave, rañño nāgo sotā hoti. ‘‘Kathañca, bhikkhave, rañño nāgo hantā hoti? Idha, bhikkhave, rañño nāgo saṅgāmagato hatthimpi hanati, hatthāruhampi hanati, assampi hanati, assāruhampi hanati, rathampi hanati, rathikampi hanati, pattikampi hanati. Evaṃ kho, bhikkhave, rañño nāgo hantā hoti. ‘‘Kathañca, bhikkhave, rañño nāgo khantā hoti? Idha bhikkhave, rañño nāgo saṅgāmagato khamo hoti sattippahārānaṃ asippahārānaṃ usuppahārānaṃ pharasuppahārānaṃ [‘‘pharasuppahārāna’’nti idaṃ padaṃ syāmapotthake natthi. ma. ni. 3.217 passitabbaṃ] bheripaṇavasaṅkhatiṇavaninnādasaddānaṃ. Evaṃ kho, bhikkhave, rañño nāgo khantā hoti. ‘‘Kathañca, bhikkhave, rañño nāgo gantā hoti? Idha, bhikkhave, rañño nāgo yamenaṃ hatthidammasārathi disaṃ peseti – yadi vā gatapubbaṃ yadi vā agatapubbaṃ – taṃ khippameva gantā hoti. Evaṃ kho, bhikkhave, rañño nāgo gantā hoti. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño nāgo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti …pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu sotā ca hoti, hantā ca, khantā ca, gantā ca. ‘‘Kathañca, bhikkhave, bhikkhu sotā hoti? Idha, bhikkhave, bhikkhu tathāgatappavedite dhammavinaye desiyamāne aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasoto dhammaṃ suṇāti. Evaṃ kho, bhikkhave, bhikkhu sotā hoti. ‘‘Kathañca, bhikkhave, bhikkhu hantā hoti? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti (hanati) [( ) natthi sī. syā. pī. potthakesu. a. ni. 4.164 paṭipadāvagge catutthasutte pana ‘‘sametī’’ti padaṃ sabbatthapi dissati] byantīkaroti anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ…pe… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti hanati byantīkaroti anabhāvaṃ gameti. Evaṃ kho, bhikkhave, bhikkhu hantā hoti. ‘‘Kathañca, bhikkhave, bhikkhu khantā hoti? Idha, bhikkhave, bhikkhu khamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Evaṃ kho, bhikkhave, bhikkhu khantā hoti. ‘‘Kathañca, bhikkhave, bhikkhu gantā hoti? Idha, bhikkhave, bhikkhu yāyaṃ disā agatapubbā iminā dīghena addhunā yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ, taṃ khippaññeva gantā hoti. Evaṃ kho, bhikkhave, bhikkhu gantā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Catutthaṃ.",
      "english": "“Monks, a king’s excellent elephant, endowed with four qualities, is fit for a king, fit for royal use, and is counted as a royal asset. What are these four? Here, monks, a king’s excellent elephant is a listener, a striker, an endurer, and a goer.\n\n“And how, monks, is a king’s excellent elephant a listener? Here, monks, whatever task the elephant trainer sets for it—whether it has been done before or not—it listens with keen attention, making it the core of its attention, applying its mind to it, gathering its entire consciousness, with ears alert. This is how, monks, a king’s excellent elephant is a listener.\n\n“And how, monks, is a king’s excellent elephant a striker? Here, monks, a king’s excellent elephant, having gone into battle, strikes elephants, strikes elephant-riders, strikes horses, strikes horse-riders, strikes chariots, strikes chariot-drivers, and strikes foot soldiers. This is how, monks, a king’s excellent elephant is a striker.\n\n“And how, monks, is a king’s excellent elephant an endurer? Here, monks, a king’s excellent elephant, having gone into battle, is capable of enduring blows from spears, blows from swords, blows from arrows, blows from axes, and the sounds of drums, kettledrums, conchs, and tom-toms. This is how, monks, a king’s excellent elephant is an endurer.\n\n“And how, monks, is a king’s excellent elephant a goer? Here, monks, a king’s excellent elephant quickly goes to whatever direction the elephant trainer sends it, whether that direction has been gone to before or not. This is how, monks, a king’s excellent elephant is a goer.\n\n“Indeed, monks, a king’s excellent elephant, endowed with these four qualities, is fit for a king, fit for royal use, and is counted as a royal asset.\n\n“Similarly, monks, a monk endowed with four qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world. What are these four? Here, monks, a monk is a listener, a destroyer, an endurer, and a reache.\n\n“And how, monks, is a monk a listener? Here, monks, when the Dhamma and Vinaya proclaimed by the Tathāgata is being taught, the monk listens to the teaching with keen attention, making it the core of his attention, applying his mind to it, gathering his entire consciousness, with ears alert. This is how, monks, a monk is a listener.\n\n“And how, monks, is a monk a destroyer? Here, monks, a monk does not tolerate a sensual thought that has arisen; he abandons it, dispels it, eliminates it, and brings it to an end. He does not tolerate a thought of ill-will that has arisen; he abandons it, dispels it, eliminates it, and brings it to an end. He does not tolerate a thought of harm that has arisen; he abandons it, dispels it, eliminates it, and brings it to an end. He does not tolerate any arisen evil unwholesome states; he abandons them, dispels them, eliminates them, and brings them to an end. This is how, monks, a monk is a destroyer.\n\n“And how, monks, is a monk an endurer? Here, monks, a monk is patient and endures cold, heat, hunger, thirst, the touch of gnats, mosquitoes, wind, sun, and creeping things; abusive and offensive words; and bodily feelings that are painful, sharp, severe, acute, disagreeable, unpleasant, and life-threatening; he is one who endures them. This is how, monks, a monk is an endurer.\n\n“And how, monks, is a monk a reache? Here, monks, the monk quickly reaches that direction which has not been gone to before by this long journey, namely: the calming of all fabrications, the relinquishing of all substrata of existence, the destruction of craving, dispassion, cessation, Nibbāna. This is how, monks, a monk is a reache.\n\n“Indeed, monks, a monk endowed with these four qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world.”",
      "sinhala": "භික්ෂූණි, අංග සතරකින් යුත් රජුගේ හස්තියා රජුට සුදුසු ය, රජුගේ පරිභෝගයට සුදුසු ය, රජුගේ අංගයක් ලෙස ගණන් ගැනේ. ඒ කවර සතරකින් ද? භික්ෂූණි, මෙහිලා රජුගේ හස්තියා ශ්‍රවණය කරන්නෙක් ද වේ, පහර දෙන්නෙක් ද වේ, ඉවසන්නෙක් ද වේ, යන්නෙක් ද වේ.\n\nභික්ෂූණි, කෙසේ නම් රජුගේ හස්තියා ශ්‍රවණය කරන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා රජුගේ හස්තියා, අලි ඇත් දමනය කරන්නා විසින් යම්කිසි කාර්යයක් කරවන්නේ නම්, පෙර කරන ලද්දක් හෝ පෙර නොකරන ලද්දක් වේවා, එය සිත්හි තබාගෙන, මනසෙහි තබාගෙන, මුළු සිතින්ම එකඟ කරගෙන, සවන් යොමා අසයි. භික්ෂූණි, මෙලෙසින් රජුගේ හස්තියා ශ්‍රවණය කරන්නෙක් වේ.\n\nභික්ෂූණි, කෙසේ නම් රජුගේ හස්තියා පහර දෙන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා රජුගේ හස්තියා යුධ බිමට ගොස් අලින්ට ද පහර දෙයි, අලි පිට සිටින අයට ද පහර දෙයි, අශ්වයින්ට ද පහර දෙයි, අශ්ව පිට සිටින අයට ද පහර දෙයි, රථවලට ද පහර දෙයි, රථවල සිටින අයට ද පහර දෙයි, පාබල සේනාවට ද පහර දෙයි. භික්ෂූණි, මෙලෙසින් රජුගේ හස්තියා පහර දෙන්නෙක් වේ.\n\nභික්ෂූණි, කෙසේ නම් රජුගේ හස්තියා ඉවසන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා රජුගේ හස්තියා යුධ බිමට ගොස් හෙල් පහර, කඩු පහර, ඊ පහර, පොරෝ පහර, භේරි, පණව, සක්, ඩිමඩිම නාද යන ශබ්දයන්ට ඔරොත්තු දෙයි, ඉවසියි. භික්ෂූණි, මෙලෙසින් රජුගේ හස්තියා ඉවසන්නෙක් වේ.\n\nභික්ෂූණි, කෙසේ නම් රජුගේ හස්තියා යන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා රජුගේ හස්තියා, අලි ඇත් දමනය කරන්නා විසින් යම් දිශාවකට යවන්නේ නම්, පෙර ගොස් ඇති තැනකට හෝ පෙර නොගිය තැනකට හෝ වේවා, එයට ඉක්මනින්ම යන්නෙක් වේ. භික්ෂූණි, මෙලෙසින් රජුගේ හස්තියා යන්නෙක් වේ. භික්ෂූණි, මේ සතර අංගයන්ගෙන් යුත් රජුගේ හස්තියා රජුට සුදුසු ය, රජුගේ පරිභෝගයට සුදුසු ය, රජුගේ අංගයක් ලෙස ගණන් ගැනේ.\n\nභික්ෂූණි, එලෙසින්ම ධර්ම සතරකින් යුක්ත වූ භික්ෂුව ආහුණෙය වේ, පාහුණෙය වේ, දක්ඛිණෙය වේ, අඤ්ජලිකරණෙය වේ, ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයක් වේ. ඒ කවර සතරකින් ද? භික්ෂූණි, මෙහිලා භික්ෂුව ශ්‍රවණය කරන්නෙක් ද වේ, පහර දෙන්නෙක් ද වේ, ඉවසන්නෙක් ද වේ, යන්නෙක් ද වේ.\n\nභික්ෂූණි, කෙසේ නම් භික්ෂුව ශ්‍රවණය කරන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා භික්ෂුව තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනය දේශනා කරනු ලබන විට, එය සිත්හි තබාගෙන, මනසෙහි තබාගෙන, මුළු සිතින්ම එකඟ කරගෙන, සවන් යොමා ධර්මය අසයි. භික්ෂූණි, මෙලෙසින් භික්ෂුව ශ්‍රවණය කරන්නෙක් වේ.\n\nභික්ෂූණි, කෙසේ නම් භික්ෂුව පහර දෙන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා භික්ෂුව, උපන් කාම විතර්කය ඉවසන්නේ නැත, එය අත්හරියි, දුරුකරයි, නැතිකරයි, අභාවයට පත්කරයි. උපන් ව්‍යාපාද විතර්කය ද ඉවසන්නේ නැත, එය අත්හරියි, දුරුකරයි, නැතිකරයි, අභාවයට පත්කරයි. උපන් විහිංසා විතර්කය ද ඉවසන්නේ නැත, එය අත්හරියි, දුරුකරයි, නැතිකරයි, අභාවයට පත්කරයි. උපනුපන් අකුසල ධර්මයන් ද ඉවසන්නේ නැත, ඒවා අත්හරියි, දුරුකරයි, නැතිකරයි, අභාවයට පත්කරයි. භික්ෂූණි, මෙලෙසින් භික්ෂුව පහර දෙන්නෙක් වේ.\n\nභික්ෂූණි, කෙසේ නම් භික්ෂුව ඉවසන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා භික්ෂුව සීතල, උෂ්ණය, බඩගින්න, පිපාසය, මැසි මදුරු සුළං අව් තද සර්ප ස්පර්ශයන්ට, නින්දාවට පත් කරන, අප්‍රසන්න වචන වලට, උපදිනා ශාරීරික වේදනාවන්ට, දැඩි, තියුණු, කටුක, අප්‍රසන්න, සිත් නොගන්නා, ප්‍රාණය නසන තරමේ දුක්වලට ඔරොත්තු දෙන්නෙක්, ඉවසන්නෙක් වේ. භික්ෂූණි, මෙලෙසින් භික්ෂුව ඉවසන්නෙක් වේ.\n\nභික්ෂූණි, කෙසේ නම් භික්ෂුව යන්නෙක් වේ ද? භික්ෂූණි, මෙහිලා භික්ෂුව, සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපාධීන් අත්හැරීම, තණ්හාව ක්ෂය කිරීම, විරාගය, නිරෝධය, නිර්වාණය යන යම් දිශාවක් මේ දිගු කලක් තුළ පෙර නොගිය තැනක් වේ ද, එයට ඉක්මනින්ම යන්නෙක් වේ. භික්ෂූණි, මෙලෙසින් භික්ෂුව යන්නෙක් වේ. භික්ෂූණි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව ආහුණෙය වේ, පාහුණෙය වේ, දක්ඛිණෙය වේ, අඤ්ජලිකරණෙය වේ, ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයක් වේ යැයි වදාළ සේක.",
      "paliTitle": "Nāgasuttaṃ",
      "englishTitle": "The Nāga Discourse",
      "sinhalaTitle": "නාගසූත්‍රය"
    },
    {
      "number": 115,
      "pali": "‘‘Cattārimāni, bhikkhave, ṭhānāni. Katamāni cattāri? Atthi, bhikkhave, ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati. ‘‘Tatra, bhikkhave, yamidaṃ [yadidaṃ (syā. kaṃ. ka.)] ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati – idaṃ, bhikkhave, ṭhānaṃ ubhayeneva na kattabbaṃ maññati [paññāyati (?)]. Yampidaṃ [yadidaṃ (ka.)] ṭhānaṃ amanāpaṃ kātuṃ; imināpi naṃ [taṃ (sī. pī.) syāmapotthake natthi] na kattabbaṃ maññati. Yampidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattati; imināpi naṃ [taṃ (pī.) sī. syā. potthakesu natthi] na kattabbaṃ maññati. Idaṃ, bhikkhave, ṭhānaṃ ubhayeneva na kattabbaṃ maññati. ‘‘Tatra, bhikkhave, yamidaṃ ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati – imasmiṃ, bhikkhave, ṭhāne bālo ca paṇḍito ca veditabbo purisathāme purisavīriye purisaparakkame. Na, bhikkhave, bālo iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ amanāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattatī’ti. So taṃ ṭhānaṃ na karoti. Tassa taṃ ṭhānaṃ akayiramānaṃ anatthāya saṃvattati. Paṇḍito ca kho, bhikkhave, iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ amanāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattatī’ti. So taṃ ṭhānaṃ karoti. Tassa taṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattati. ‘‘Tatra, bhikkhave, yamidaṃ [yadidaṃ (syā. kaṃ.)] ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati – imasmimpi, bhikkhave, ṭhāne bālo ca paṇḍito ca veditabbo purisathāme purisavīriye purisaparakkame. Na, bhikkhave, bālo iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ manāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattatī’ti. So taṃ ṭhānaṃ karoti. Tassa taṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattati. Paṇḍito ca kho, bhikkhave, iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ manāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattatī’ti. So taṃ ṭhānaṃ na karoti. Tassa taṃ ṭhānaṃ akayiramānaṃ atthāya saṃvattati. ‘‘Tatra, bhikkhave, yamidaṃ ṭhānaṃ manāpaṃ kātuṃ, tañca kayiramānaṃ atthāya saṃvattati – idaṃ, bhikkhave, ṭhānaṃ ubhayeneva kattabbaṃ maññati. Yampidaṃ ṭhānaṃ manāpaṃ kātuṃ, imināpi naṃ kattabbaṃ maññati; yampidaṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattati, imināpi naṃ kattabbaṃ maññati. Idaṃ, bhikkhave, ṭhānaṃ ubhayeneva kattabbaṃ maññati. Imāni kho, bhikkhave, cattāri ṭhānānī’’ti. Pañcamaṃ.",
      "english": "Monks, there are these four courses of action. Which four? Monks, there is a course of action that is unpleasant to undertake, and when undertaken, it conduces to harm. Monks, there is a course of action that is unpleasant to undertake, and when undertaken, it conduces to benefit. Monks, there is a course of action that is pleasant to undertake, and when undertaken, it conduces to harm. Monks, there is a course of action that is pleasant to undertake, and when undertaken, it conduces to benefit.\n\nMonks, concerning that course of action which is unpleasant to undertake and, when undertaken, conduces to harm—this course of action, monks, is understood by both considerations not to be undertaken. It is understood not to be undertaken because it is unpleasant to undertake. It is understood not to be undertaken because, when undertaken, it conduces to harm. This course of action, monks, is understood by both considerations not to be undertaken.\n\nMonks, concerning that course of action which is unpleasant to undertake, and yet, when undertaken, conduces to benefit—it is in this situation, monks, that the fool and the wise person are to be discerned by their human strength, human vigor, and human exertion. Monks, the fool does not reflect thus: ‘Even though this course of action is unpleasant to undertake, nevertheless, when undertaken, it conduces to benefit.’ So, he does not undertake that course of action. When that course of action is not undertaken by him, it conduces to his harm. However, monks, the wise person reflects thus: ‘Even though this course of action is unpleasant to undertake, nevertheless, when undertaken, it conduces to benefit.’ So, he undertakes that course of action. When that course of action is undertaken by him, it conduces to his benefit.\n\nMonks, concerning that course of action which is pleasant to undertake, and yet, when undertaken, conduces to harm—it is also in this situation, monks, that the fool and the wise person are to be discerned by their human strength, human vigor, and human exertion. Monks, the fool does not reflect thus: ‘Even though this course of action is pleasant to undertake, nevertheless, when undertaken, it conduces to harm.’ So, he undertakes that course of action. When that course of action is undertaken by him, it conduces to his harm. However, monks, the wise person reflects thus: ‘Even though this course of action is pleasant to undertake, nevertheless, when undertaken, it conduces to harm.’ So, he does not undertake that course of action. When that course of action is not undertaken by him, it conduces to his benefit.\n\nMonks, concerning that course of action which is pleasant to undertake, and when undertaken, conduces to benefit—this course of action, monks, is understood by both considerations to be undertaken. It is understood to be undertaken because it is pleasant to undertake. It is understood to be undertaken because, when undertaken, it conduces to benefit. This course of action, monks, is understood by both considerations to be undertaken. These, monks, are the four courses of action.",
      "sinhala": "භික්ෂූනි, මේ කරුණු සතරකි. ඒ සතර කවරේද? භික්ෂූනි, අකැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි අහිත පිණිස පවතී. භික්ෂූනි, අකැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි හිත පිණිස පවතී. භික්ෂූනි, කැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි අහිත පිණිස පවතී. භික්ෂූනි, කැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි හිත පිණිස පවතී.\n\nභික්ෂූනි, අකැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි අහිත පිණිස පවතීද, භික්ෂූනි, ඒ කරුණ දෙයාකාරයෙන්ම නොකළ යුත්තක් යැයි සැලකේ. යම් කරුණක් අකැමැතිව කළ යුතු වේද, ඒ හේතුවෙන්ද එය නොකළ යුත්තක් යැයි සැලකේ. යම් කරුණක් කරන කල්හි අහිත පිණිස පවතීද, ඒ හේතුවෙන්ද එය නොකළ යුත්තක් යැයි සැලකේ. භික්ෂූනි, මේ කරුණ දෙයාකාරයෙන්ම නොකළ යුත්තක් යැයි සැලකේ.\n\nභික්ෂූනි, අකැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි හිත පිණිස පවතීද, භික්ෂූනි, මේ කරුණ සම්බන්ධයෙන් මෝඩයා සහ පණ්ඩිතයා, පුරුෂ ධෛර්යයෙන්, පුරුෂ වීර්යයෙන් සහ පුරුෂ පරාක‍්‍රමයෙන් තේරුම් ගත යුත්තෝ වෙති. භික්ෂූනි, මෝඩයා මෙසේ විමසා නොබලයි: 'මේ කරුණ අකැමැතිව කළ යුතු වුවද, එය කරන කල්හි හිත පිණිස පවතී' කියා. හෙතෙම ඒ කරුණ නොකරයි. ඒ කරුණ නොකරන කල්හි ඔහුට අහිත පිණිස පවතී. එහෙත් භික්ෂූනි, පණ්ඩිතයා මෙසේ විමසා බලයි: 'මේ කරුණ අකැමැතිව කළ යුතු වුවද, එය කරන කල්හි හිත පිණිස පවතී' කියා. හෙතෙම ඒ කරුණ කරයි. ඒ කරුණ කරන කල්හි ඔහුට හිත පිණිස පවතී.\n\nභික්ෂූනි, කැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි අහිත පිණිස පවතීද, භික්ෂූනි, මේ කරුණ සම්බන්ධයෙන්ද මෝඩයා සහ පණ්ඩිතයා, පුරුෂ ධෛර්යයෙන්, පුරුෂ වීර්යයෙන් සහ පුරුෂ පරාක‍්‍රමයෙන් තේරුම් ගත යුත්තෝ වෙති. භික්ෂූනි, මෝඩයා මෙසේ විමසා නොබලයි: 'මේ කරුණ කැමැතිව කළ යුතු වුවද, එය කරන කල්හි අහිත පිණිස පවතී' කියා. හෙතෙම ඒ කරුණ කරයි. ඒ කරුණ කරන කල්හි ඔහුට අහිත පිණිස පවතී. එහෙත් භික්ෂූනි, පණ්ඩිතයා මෙසේ විමසා බලයි: 'මේ කරුණ කැමැතිව කළ යුතු වුවද, එය කරන කල්හි අහිත පිණිස පවතී' කියා. හෙතෙම ඒ කරුණ නොකරයි. ඒ කරුණ නොකරන කල්හි ඔහුට හිත පිණිස පවතී.\n\nභික්ෂූනි, කැමැතිව කළ යුතු යම් කරුණක් වේද, එය කරන කල්හි හිත පිණිස පවතීද, භික්ෂූනි, ඒ කරුණ දෙයාකාරයෙන්ම කළ යුත්තක් යැයි සැලකේ. යම් කරුණක් කැමැතිව කළ යුතු වේද, ඒ හේතුවෙන්ද එය කළ යුත්තක් යැයි සැලකේ. යම් කරුණක් කරන කල්හි හිත පිණිස පවතීද, ඒ හේතුවෙන්ද එය කළ යුත්තක් යැයි සැලකේ. භික්ෂූනි, මේ කරුණ දෙයාකාරයෙන්ම කළ යුත්තක් යැයි සැලකේ. භික්ෂූනි, මේවාම කරුණු සතර වන්නේ එසේය.",
      "paliTitle": "Ṭhānasuttaṃ",
      "englishTitle": "The Grounds Discourse",
      "sinhalaTitle": "ස්ථාන සූත්‍රය"
    },
    {
      "number": 116,
      "pali": "‘‘Catūhi, bhikkhave, ṭhānehi appamādo karaṇīyo. Katamehi catūhi? Kāyaduccaritaṃ, bhikkhave, pajahatha, kāyasucaritaṃ bhāvetha; tattha ca mā pamādattha. Vacīduccaritaṃ, bhikkhave, pajahatha, vacīsucaritaṃ bhāvetha; tattha ca mā pamādattha. Manoduccaritaṃ, bhikkhave, pajahatha, manosucaritaṃ bhāvetha; tattha ca mā pamādattha. Micchādiṭṭhiṃ, bhikkhave, pajahatha, sammādiṭṭhiṃ bhāvetha; tattha ca mā pamādattha. ‘‘Yato kho, bhikkhave, bhikkhuno kāyaduccaritaṃ pahīnaṃ hoti kāyasucaritaṃ bhāvitaṃ, vacīduccaritaṃ pahīnaṃ hoti vacīsucaritaṃ bhāvitaṃ, manoduccaritaṃ pahīnaṃ hoti manosucaritaṃ bhāvitaṃ, micchādiṭṭhi pahīnā hoti sammādiṭṭhi bhāvitā, so na bhāyati samparāyikassa maraṇassā’’ti. Chaṭṭhaṃ.",
      "english": "Monastics, heedfulness is to be practiced in four matters. Which four? Monastics, abandon bodily misconduct and develop bodily good conduct; do not be negligent in that. Monastics, abandon verbal misconduct and develop verbal good conduct; do not be negligent in that. Monastics, abandon mental misconduct and develop mental good conduct; do not be negligent in that. Monastics, abandon wrong view and develop right view; do not be negligent in that.\n\nIndeed, monastics, when a monastic has abandoned bodily misconduct and developed bodily good conduct, has abandoned verbal misconduct and developed verbal good conduct, has abandoned mental misconduct and developed mental good conduct, has abandoned wrong view and developed right view, such a one does not fear death in future existences.",
      "sinhala": "මහණෙනි, කරුණු සතරක් සම්බන්ධයෙන් අප්‍රමාදී විය යුතු ය. ඒ කවර සතරක් ද? මහණෙනි, කායදුශ්චරිතය ප්‍රහීණ කරන්න, කායසුචරිතය වඩන්න; එහිලා අප්‍රමාදී වන්න. මහණෙනි, වචීදුශ්චරිතය ප්‍රහීණ කරන්න, වචීසුචරිතය වඩන්න; එහිලා අප්‍රමාදී වන්න. මහණෙනි, මනෝදුශ්චරිතය ප්‍රහීණ කරන්න, මනෝසුචරිතය වඩන්න; එහිලා අප්‍රමාදී වන්න. මහණෙනි, මිථ්‍යාදෘෂ්ටිය ප්‍රහීණ කරන්න, සම්මාදෘෂ්ටිය වඩන්න; එහිලා අප්‍රමාදී වන්න.\n\nමහණෙනි, යම් කලෙක භික්ෂුවකගේ කායදුශ්චරිතය ප්‍රහීණ වී, කායසුචරිතය වැඩී තිබේ ද, වචීදුශ්චරිතය ප්‍රහීණ වී, වචීසුචරිතය වැඩී තිබේ ද, මනෝදුශ්චරිතය ප්‍රහීණ වී, මනෝසුචරිතය වැඩී තිබේ ද, මිථ්‍යාදෘෂ්ටිය ප්‍රහීණ වී, සම්මාදෘෂ්ටිය වැඩී තිබේ ද, හේ පරලොවට අයත් මරණයට බිය නොවන්නේ ය.",
      "paliTitle": "Appamādasuttaṃ",
      "englishTitle": "The Discourse on Heedfulness",
      "sinhalaTitle": "අප්‍රමාද සූත්‍රය"
    },
    {
      "number": 117,
      "pali": "‘‘Catūsu, bhikkhave, ṭhānesu attarūpena appamādo sati cetaso ārakkho karaṇīyo. Katamesu catūsu? ‘Mā me rajanīyesu dhammesu cittaṃ rajjī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me dosanīyesu dhammesu cittaṃ dussī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me mohanīyesu dhammesu cittaṃ muyhī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me madanīyesu dhammesu cittaṃ majjī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo. ‘‘Yato kho, bhikkhave, bhikkhuno rajanīyesu dhammesu cittaṃ na rajjati vītarāgattā, dosanīyesu dhammesu cittaṃ na dussati vītadosattā, mohanīyesu dhammesu cittaṃ na muyhati vītamohattā, madanīyesu dhammesu cittaṃ na majjati vītamadattā, so na chambhati na kampati na vedhati na santāsaṃ āpajjati, na ca pana samaṇavacanahetupi gacchatī’’ti. Sattamaṃ.",
      "english": "Bhikkhus, in four instances, diligence, mindfulness, and the guarding of the mind must be undertaken with a sense of personal responsibility and earnestness. Which four? With the thought, ‘May my mind not become infatuated by phenomena that incite lust,’ diligence, mindfulness, and the guarding of the mind must be undertaken with a sense of personal responsibility and earnestness. With the thought, ‘May my mind not become corrupted by phenomena that incite aversion,’ diligence, mindfulness, and the guarding of the mind must be undertaken with a sense of personal responsibility and earnestness. With the thought, ‘May my mind not become deluded by phenomena that incite delusion,’ diligence, mindfulness, and the guarding of the mind must be undertaken with a sense of personal responsibility and earnestness. With the thought, ‘May my mind not become intoxicated by phenomena that incite spiritual intoxication or conceit,’ diligence, mindfulness, and the guarding of the mind must be undertaken with a sense of personal responsibility and earnestness.\n\nBut when, bhikkhus, a bhikkhu’s mind is not infatuated by phenomena that incite lust, due to being free from lust; when his mind is not corrupted by phenomena that incite aversion, due to being free from aversion; when his mind is not deluded by phenomena that incite delusion, due to being free from delusion; and when his mind is not intoxicated by phenomena that incite spiritual intoxication or conceit, due to being free from spiritual intoxication; then he is not struck with terror, he does not tremble, he does not quiver, he does not fall into dread, nor is he swayed by the words of any ascetic.",
      "sinhala": "භික්‍ෂූනි, කරුණු සතරකදී තමන්ගේම ස්වභාවය අනුව අප්‍රමාදීව සිහියෙන් යුක්තව සිත ආරක්‍ෂා කිරීම කළ යුතුයි. ඒ සතර කුමක්ද?\n\n‘මගේ සිත රාගය ඇති කරන ධර්මයන් කෙරෙහි නො ඇලෙවා!’ යනුවෙන් තමන්ගේම ස්වභාවය අනුව අප්‍රමාදීව සිහියෙන් යුක්තව සිත ආරක්‍ෂා කිරීම කළ යුතුයි. ‘මගේ සිත ද්වේෂය ඇති කරන ධර්මයන් කෙරෙහි නො කිපේවා!’ යනුවෙන් තමන්ගේම ස්වභාවය අනුව අප්‍රමාදීව සිහියෙන් යුක්තව සිත ආරක්‍ෂා කිරීම කළ යුතුයි. ‘මගේ සිත මෝහය ඇති කරන ධර්මයන් කෙරෙහි මුළා නොවේවා!’ යනුවෙන් තමන්ගේම ස්වභාවය අනුව අප්‍රමාදීව සිහියෙන් යුක්තව සිත ආරක්‍ෂා කිරීම කළ යුතුයි. ‘මගේ සිත මානය ඇති කරන ධර්මයන් කෙරෙහි උඩඟු නොවේවා!’ යනුවෙන් තමන්ගේම ස්වභාවය අනුව අප්‍රමාදීව සිහියෙන් යුක්තව සිත ආරක්‍ෂා කිරීම කළ යුතුයි.\n\nභික්‍ෂූනි, යම් හෙයකින් භික්‍ෂුවකගේ සිත රාගය ඇති කරන ධර්මයන් කෙරෙහි නො ඇලේද, රාගය දුරු කළ හෙයින්, ද්වේෂය ඇති කරන ධර්මයන් කෙරෙහි සිත නො කිපේද, ද්වේෂය දුරු කළ හෙයින්, මෝහය ඇති කරන ධර්මයන් කෙරෙහි සිත මුළා නොවේද, මෝහය දුරු කළ හෙයින්, මානය ඇති කරන ධර්මයන් කෙරෙහි සිත උඩඟු නොවේද, මානය දුරු කළ හෙයින්, ඔහු නො සෙලවේ, නො වෙවුලයි, නො කම්පා වේ, භීතියට පත් නොවේ, කිසිදු ශ්‍රමණයකුගේ වචනයක් හේතුවෙන් පවා ඒ කිසිදු තත්ත්වයකට නොපැමිණේ.",
      "paliTitle": "Ārakkhasuttaṃ",
      "englishTitle": "The Discourse on Protection",
      "sinhalaTitle": "ආරක්ෂක සූත්‍‌රය"
    },
    {
      "number": 118,
      "pali": "‘‘Cattārimāni, bhikkhave, saddhassa kulaputtassa dassanīyāni saṃvejanīyāni ṭhānāni. Katamāni cattāri? ‘Idha tathāgato jāto’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anuttaraṃ sammāsambodhiṃ abhisambuddho’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anuttaraṃ dhammacakkaṃ pavattesī’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anupādisesāya nibbānadhātuyā parinibbuto’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. Imāni kho, bhikkhave, cattāri saddhassa kulaputtassa dassanīyāni saṃvejanīyāni ṭhānānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these four places are to be seen by a devoted clansman, and they inspire spiritual urgency. Which four?\n\nMonks, the place where the Tathāgata was born is one such place to be seen by a devoted clansman, inspiring spiritual urgency. Monks, the place where the Tathāgata attained supreme perfect self-awakening is one such place to be seen by a devoted clansman, inspiring spiritual urgency. Monks, the place where the Tathāgata set in motion the unsurpassed Wheel of Dhamma is one such place to be seen by a devoted clansman, inspiring spiritual urgency. Monks, the place where the Tathāgata passed into Nibbāna without any trace of clinging aggregates remaining is one such place to be seen by a devoted clansman, inspiring spiritual urgency. These, monks, are the four places to be seen by a devoted clansman, and they inspire spiritual urgency.",
      "sinhala": "මහණෙනි, ශ්‍රද්ධාවන්ත කුලපුත්‍රයා හට දැකිය යුතු, සංවේගය ඇති කරන ස්ථාන සතරක් මේවායි.\n\nකවරේද ඒ සතර?\n\nමහණෙනි, 'තථාගතයන් වහන්සේ මෙහිදී උපත ලැබූ සේකැයි' යන මේ, ශ්‍රද්ධාවන්ත කුලපුත්‍රයා හට දැකිය යුතු, සංවේගය උපදවන ස්ථානයකි.\n\nමහණෙනි, 'තථාගතයන් වහන්සේ මෙහිදී අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ සේකැයි' යන මේ, ශ්‍රද්ධාවන්ත කුලපුත්‍රයා හට දැකිය යුතු, සංවේගය උපදවන ස්ථානයකි.\n\nමහණෙනි, 'තථාගතයන් වහන්සේ මෙහිදී අනුත්තර වූ ධර්මචක්‍රය ප්‍රවර්තනය කළ සේකැයි' යන මේ, ශ්‍රද්ධාවන්ත කුලපුත්‍රයා හට දැකිය යුතු, සංවේගය උපදවන ස්ථානයකි.\n\nමහණෙනි, 'තථාගතයන් වහන්සේ මෙහිදී අනුපාදිශේෂ නිර්වාණ ධාතුවෙන් පිරිනිවන් පෑ සේකැයි' යන මේ, ශ්‍රද්ධාවන්ත කුලපුත්‍රයා හට දැකිය යුතු, සංවේගය උපදවන ස්ථානයකි.\n\nමහණෙනි, ශ්‍රද්ධාවන්ත කුලපුත්‍රයාට දැකිය යුතු, සංවේගය උපදවන ස්ථාන සතර මේවාමයි.",
      "paliTitle": "Saṃvejanīyasuttaṃ",
      "englishTitle": "The Stirring Discourse",
      "sinhalaTitle": "සංවේදනීය සූත‍්‍රය"
    },
    {
      "number": 119,
      "pali": "‘‘Cattārimāni, bhikkhave, bhayāni. Katamāni cattāri? Jātibhayaṃ, jarābhayaṃ, byādhibhayaṃ, maraṇabhayaṃ – imāni kho, bhikkhave, cattāri bhayānī’’ti. Navamaṃ.",
      "english": "Monastics, there are these four fears. Which four? The fear of birth, the fear of aging, the fear of sickness, and the fear of death – these, monastics, are indeed the four fears.",
      "sinhala": "භික්‍ෂූණි, මේ භයවල් සතරකි. ඒ සතර කවරේද? ජාති භය, ජරා භය, ව්‍යාධි භය, මරණ භය යනු මේවාය. භික්‍ෂූණි, සැබැවින්ම මේවා භයවල් සතරකි.",
      "paliTitle": "Paṭhamabhayasuttaṃ",
      "englishTitle": "The First Discourse on Fear",
      "sinhalaTitle": "ප්‍රථම භය සූත්‍රය"
    },
    {
      "number": 120,
      "pali": "‘‘Cattārimāni, bhikkhave, bhayāni. Katamāni cattāri? Aggibhayaṃ, udakabhayaṃ, rājabhayaṃ, corabhayaṃ – imāni kho, bhikkhave, cattāri bhayānī’’ti. Dasamaṃ. Kesivaggo dutiyo. ",
      "english": "Monks, there are these four fears. Which four? The fear of fire, the fear of water, the fear of kings, and the fear of thieves. Monks, these are indeed the four fears.",
      "sinhala": "මහණෙනි, මේ භයෝ සතරකි. කවර සතරක්ද? ගිනි භය, දිය භය, රාජ භය, සොර භයයි – මහණෙනි, නිසැකයෙන්ම මේ භයෝ සතරක්ම වෙති.",
      "paliTitle": "Dutiyabhayasuttaṃ",
      "englishTitle": "Second Fear Sutta",
      "sinhalaTitle": "දෙවන භය සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Tassuddānaṃ – Kesi javo patodo ca, nāgo ṭhānena pañcamaṃ; Appamādo ca ārakkho, saṃvejanīyañca dve bhayāti.",
    "english": "The Recapitulation",
    "sinhala": "එහි උද්දානය"
  }
}