{
  "id": "an4.28",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Repetitive Section on Passion.",
    "sinhala": "රාගය ආදිය"
  },
  "sections": [
    {
      "number": 274,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya cattāro dhammā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Rāgassa, bhikkhave, abhiññāya ime cattāro dhammā bhāvetabbā’’ti. Paṭhamaṃ.",
      "english": "Monks, for the direct knowledge of greed, four things are to be developed. Which four? Here, monks, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having removed covetousness and distress concerning the world. He dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having removed covetousness and distress concerning the world. He dwells contemplating mind in mind, ardent, clearly comprehending, and mindful, having removed covetousness and distress concerning the world. He dwells contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having removed covetousness and distress concerning the world. Monks, for the direct knowledge of greed, these four things are to be developed.",
      "sinhala": "මහණෙනි, රාගය හොඳින් දැනගැනීම පිණිස ධර්ම සතරක් වැඩිය යුත්තාහ.\nඒ සතර කවරේද?\nමහණෙනි, මෙහි මහණෙක් ලෝකයෙහි අභිධ්‍යාව හා දොම්නස දුරු කොට, වීර්යයෙන් යුතුව, සම්‍යක් ප්‍රඥාවෙන් යුතුව, සිහි නුවණින් යුතුව,\nකයෙහි කය අනුව බලමින් වාසය කරයි;\nවේදනාවන්හි වේදනා අනුව බලමින් වාසය කරයි;\nසිතෙහි සිත අනුව බලමින් වාසය කරයි;\nධර්මයන්හි ධර්ම අනුව බලමින් වාසය කරයි.\nමහණෙනි, රාගය හොඳින් දැනගැනීම පිණිස මේ ධර්ම සතර වැඩිය යුත්තාහ.",
      "paliTitle": "Satipaṭṭhānasuttaṃ"
    },
    {
      "number": 275,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya cattāro dhammā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya…pe… anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Rāgassa, bhikkhave, abhiññāya ime cattāro dhammā bhāvetabbā’’ti. Dutiyaṃ.",
      "english": "Monks, for the full understanding of craving, four qualities are to be cultivated. Which four? Here, monks, a monk generates will, strives, arouses effort, steadies his mind, and exerts himself for the non-arising of unarisen evil, unwholesome qualities. He generates will, strives, arouses effort, steadies his mind, and exerts himself for the abandoning of arisen evil, unwholesome qualities. He generates will, strives, arouses effort, steadies his mind, and exerts himself for the arising of unarisen wholesome qualities. He generates will, strives, arouses effort, steadies his mind, and exerts himself for the persistence, non-confusion, increase, abundance, cultivation, and perfection of arisen wholesome qualities. Monks, for the full understanding of craving, these four qualities are to be cultivated.",
      "sinhala": "භික්ෂූනි, රාගය මුළුමනින් අවබෝධ කර ගැනීම පිණිස සතර ධර්‍මයක් වැඩිය යුතුයි.\n\nකුමන සතරක්ද?\n\nමෙහිලා, භික්ෂූනි, භික්ෂුව නූපන් පව් අකුසල ධර්‍මයන් නූපදීම පිණිස ඡන්දය උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කොට ගනී, වෙර වඩයි; උපන් පව් අකුසල ධර්‍මයන් ප්‍ර​හීණ කිරීම පිණිස ඡන්දය උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කොට ගනී, වෙර වඩයි; නූපන් කුසල ධර්‍මයන් උපදවා ගැනීම පිණිස ඡන්දය උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කොට ගනී, වෙර වඩයි; උපන් කුසල ධර්‍මයන්ගේ ස්ථිතිය පිණිස, නොපිරිහීම පිණිස, වැඩිදියුණුව පිණිස, විපුලත්වය පිණිස, වැඩීම පිණිස, පරිපූර්ණත්වය පිණිස ඡන්දය උපදවා ගනී, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කොට ගනී, වෙර වඩයි.\n\nභික්ෂූනි, රාගය මුළුමනින් අවබෝධ කර ගැනීම පිණිස මේ සතර ධර්‍මයන් වැඩිය යුතුයි.",
      "paliTitle": "Sammappadhānasuttaṃ"
    },
    {
      "number": 276,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya cattāro dhammā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti; vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Rāgassa, bhikkhave, abhiññāya ime cattāro dhammā bhāvetabbā’’ti. Tatiyaṃ.",
      "english": "Monks, for the full understanding of passion, these four qualities are to be developed. Which four? Here, monks, a monk develops the base of spiritual power endowed with zeal-concentration and the volitional formations of exertion; he develops the base of spiritual power endowed with energy-concentration and the volitional formations of exertion; he develops the base of spiritual power endowed with mind-concentration and the volitional formations of exertion; he develops the base of spiritual power endowed with investigation-concentration and the volitional formations of exertion. Monks, for the full understanding of passion, these four qualities are to be developed.",
      "sinhala": "රාගය සෘජුව අවබෝධ කරගැනීම පිණිස, මහණෙනි, මේ ධර්ම සතර වඩනු ලැබිය යුත්තාහ. ඒ කවර සතරක්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව ඡන්දය මුල්කොට ඇති සමාධියෙන් සහ වීර්‍යය මුල්කොට ඇති සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි. වීර්‍යය මුල්කොට ඇති සමාධියෙන් සහ වීර්‍යය මුල්කොට ඇති සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි. චිත්තය මුල්කොට ඇති සමාධියෙන් සහ වීර්‍යය මුල්කොට ඇති සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි. විමංසාව මුල්කොට ඇති සමාධියෙන් සහ වීර්‍යය මුල්කොට ඇති සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි.\n\nමහණෙනි, රාගය සෘජුව අවබෝධ කරගැනීම පිණිස මේ ධර්ම සතර වඩනු ලැබිය යුත්තාහ.",
      "paliTitle": "Iddhipādasuttaṃ"
    },
    {
      "number": 277,
      "pali": "‘‘Rāgassa, bhikkhave, pariññāya…pe… parikkhayāya… pahānāya… khayāya … vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya cattāro dhammā bhāvetabbā…pe…. Tiṃsatimaṃ.",
      "english": "Monks, for the direct, full understanding of passion, for its complete exhaustion, for its abandonment, for its destruction, for its vanishing, for dispassion towards it, for its cessation, for its relinquishment, and for its utter letting go, these four qualities are to be developed.",
      "sinhala": "මහණෙනි, රාගය සම්පූර්ණයෙන් අවබෝධ කරගැනීම පිණිස, රාගය මුළුමනින්ම ක්ෂය කිරීම පිණිස, රාගය ප්‍රහාණය කිරීම පිණිස, රාගය ක්ෂය කිරීම පිණිස, රාගය වියැකී යාම පිණිස, රාගය විරාගය පිණිස, රාගය නිරෝධය පිණිස, රාගය චාගය පිණිස, රාගය ප්‍රතිනිස්සර්ගය පිණිස, ධර්ම සතරක් වැඩිය යුත්තාහ.",
      "paliTitle": "4-30. Pariññādisuttāni"
    },
    {
      "number": 304,
      "pali": "‘‘Dosassa…pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa abhiññāya… pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya ime cattāro dhammā bhāvetabbā’’ti. Dasuttarapañcasatimaṃ",
      "english": "For the direct knowing, for the complete understanding, for the full exhaustion, for the abandoning, for the destruction, for the fading away, for dispassion, for cessation, for the relinquishing, and for the total letting go of hatred, delusion, anger, resentment, denigration, rivalry, envy, avarice, hypocrisy, fraudulence, obstinacy, presumption, conceit, haughtiness, intoxication, and heedlessness, these four qualities are to be developed.",
      "sinhala": "ද්වේෂය, මෝහය, ක්‍රෝධය, උපනාහය, මක්ඛය, පලාසය, ඊර්ෂ්‍යාව, මසුරුකම, මායාව, සාඨෙය්‍යය, ථම්භය, සාරම්භය, මානය, අතිමානය, මදය, ප්‍රමාදය යන මේවායේ අභිඥාව පිණිස, පරිඥාව පිණිස, පරික්ෂය පිණිස, ප්‍රහාණය පිණිස, ක්ෂය වීම පිණිස, ව්‍යය වීම පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, ත්‍යාගය පිණිස, ප්‍රතිනිස්සර්ගය පිණිස, මෙම ධර්ම සතර වඩනු ලැබිය යුතුයි.",
      "paliTitle": "31-510. Dosaabhiññādisuttāni"
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ. ",
    "english": "",
    "sinhala": ""
  }
}