{
  "id": "an3.13",
  "title": {
    "pali": "Kusināravaggo",
    "english": "The Chapter on Kusinara",
    "sinhala": "කුසිනාරා වග්ගය"
  },
  "sections": [
    {
      "number": 124,
      "pali": "Ekaṃ samayaṃ bhagavā kusinārāyaṃ viharati baliharaṇe vanasaṇḍe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Idha, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. Tamenaṃ gahapati vā gahapatiputto vā upasaṅkamitvā svātanāya bhattena nimanteti. Ākaṅkhamāno, bhikkhave, bhikkhu adhivāseti. So tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena tassa gahapatissa vā gahapatiputtassa vā nivesanaṃ tenupasaṅkamati; upasaṅkamitvā paññatte āsane nisīdati. Tamenaṃ so gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāreti. ‘‘Tassa evaṃ hoti – ‘sādhu vata myāyaṃ gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāretī’ti. Evampissa hoti – ‘aho vata māyaṃ gahapati vā gahapatiputto vā āyatimpi evarūpena paṇītena khādanīyena bhojanīyena sahatthā santappeyya sampavāreyyā’ti! So taṃ piṇḍapātaṃ gathito [gadhito (syā. kaṃ. ka.)] mucchito ajjhosanno [ajjhāpanno (sī. ka.) ajjhopanno (ṭīkā)] anādīnavadassāvī anissaraṇapañño paribhuñjati. So tattha kāmavitakkampi vitakketi, byāpādavitakkampi vitakketi, vihiṃsāvitakkampi vitakketi. Evarūpassāhaṃ, bhikkhave, bhikkhuno dinnaṃ na mahapphalanti vadāmi. Taṃ kissa hetu? Pamatto hi, bhikkhave, bhikkhu viharati. ‘‘Idha pana, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. Tamenaṃ gahapati vā gahapatiputto vā upasaṅkamitvā svātanāya bhattena nimanteti. Ākaṅkhamāno, bhikkhave, bhikkhu adhivāseti. So tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena tassa gahapatissa vā gahapatiputtassa vā nivesanaṃ tenupasaṅkamati; upasaṅkamitvā paññatte āsane nisīdati. Tamenaṃ so gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāreti. ‘‘Tassa na evaṃ hoti – ‘sādhu vata myāyaṃ gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāretī’ti. Evampissa na hoti – ‘aho vata māyaṃ gahapati vā gahapatiputto vā āyatimpi evarūpena paṇītena khādanīyena bhojanīyena sahatthā santappeyya sampavāreyyā’ti! So taṃ piṇḍapātaṃ agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati. So tattha nekkhammavitakkampi vitakketi, abyāpādavitakkampi vitakketi, avihiṃsāvitakkampi vitakketi. Evarūpassāhaṃ, bhikkhave, bhikkhuno dinnaṃ mahapphalanti vadāmi. Taṃ kissa hetu? Appamatto hi, bhikkhave, bhikkhu viharatī’’ti. Paṭhamaṃ.",
      "english": "At one time the Blessed One was dwelling in Kusinara, in the Batihāra wood. There the Blessed One addressed the bhikkhus, saying, \"Bhikkhus.\" \"Venerable Sir,\" replied those bhikkhus to the Blessed One. The Blessed One said this: \"Here, bhikkhus, a bhikkhu dwells having relied upon a certain village or market town. A householder or a householder's son approaches him and invites him for a meal for the next day. If he wishes, bhikkhus, the bhikkhu accepts. After that night passed, in the morning, having dressed and taken his bowl and robe, he approaches the dwelling of that householder or householder's son, and having arrived, he sits down on the prepared seat. Then that householder or householder's son serves him with choice edibles and savories with his own hands, satisfying and gratifying him. It occurs to him thus: 'It is indeed good that this householder or householder's son serves me with choice edibles and savories with his own hands, satisfying and gratifying me.' And it also occurs to him: 'Oh, if only this householder or householder's son would serve me in the future too with such choice edibles and savories with his own hands, satisfying and gratifying me!' He partakes of that alms-food, bound, infatuated, and obsessed by it, not perceiving its drawbacks, and lacking the wisdom for liberation. There, he contemplates thoughts of sensuality, he contemplates thoughts of ill-will, he contemplates thoughts of harming. I declare, bhikkhus, that a gift given to such a bhikkhu does not yield great fruit. And why is that? Because, bhikkhus, that bhikkhu dwells heedlessly.\n\n\"But here, bhikkhus, a bhikkhu dwells having relied upon a certain village or market town. A householder or a householder's son approaches him and invites him for a meal for the next day. If he wishes, bhikkhus, the bhikkhu accepts. After that night passed, in the morning, having dressed and taken his bowl and robe, he approaches the dwelling of that householder or householder's son, and having arrived, he sits down on the prepared seat. Then that householder or householder's son serves him with choice edibles and savories with his own hands, satisfying and gratifying him. It does not occur to him thus: 'It is indeed good that this householder or householder's son serves me with choice edibles and savories with his own hands, satisfying and gratifying me.' And it also does not occur to him: 'Oh, if only this householder or householder's son would serve me in the future too with such choice edibles and savories with his own hands, satisfying and gratifying me!' He partakes of that alms-food, unbound, uninfatuated, and unobsessed by it, perceiving its drawbacks, and possessing the wisdom for liberation. There, he contemplates thoughts of renunciation, he contemplates thoughts of non-ill-will, he contemplates thoughts of non-harming. I declare, bhikkhus, that a gift given to such a bhikkhu yields great fruit. And why is that? Because, bhikkhus, that bhikkhu dwells heedfully.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කුසිනාරා නුවර බලිහරණ නම් වූ වන ලැහැබෙහි වාසය කළ සේක. එවිට භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, මෙහිලා යම් භික්ෂුවක් කිසියම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කොට වාසය කරයි. එවිට ඔහුට ගෘහපතියෙක් හෝ ගෘහපති පුත්‍රයෙක් හෝ ළඟට පැමිණ හෙට දවසේ දානයට ආරාධනා කරයි. මහණෙනි, කැමති වන්නේ නම් ඒ භික්ෂුව එය පිළිගනී. ඔහු ඒ රාත්‍රිය ඉක්ම ගිය පසු පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන ඒ ගෘහපතියාගේ හෝ ගෘහපති පුත්‍රයාගේ හෝ නිවස වෙත එළඹෙයි; එළඹ, පනවන ලද අසුනක වාඩි වෙයි. ඒ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා හෝ ප්‍රණීත වූ කෑමෙන්, බීමෙන් තම අතින් සංග්‍රහ කොට සතුටු කරයි. ඔහුට මෙසේ සිතක් ඇති වෙයි: 'ඉතා යහපත්! මේ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා හෝ මා හට ප්‍රණීත වූ කෑමෙන්, බීමෙන් තම අතින් සංග්‍රහ කොට සතුටු කරයි' කියා. තවද ඔහුට මෙසේ ද සිතක් ඇති වෙයි: 'අහෝ! මේ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා හෝ මට මතු දවසෙහි ද මෙවැනි ප්‍රණීත වූ කෑමෙන්, බීමෙන් තම අතින් සංග්‍රහ කොට සතුටු කරන්නේ නම් ඉතා යහපත්!' කියා. ඔහු ඒ පිණ්ඩපාතය (ආදීනව) කෙළවරක් නොදක්නාසුලුව, (සසරින්) මිදීමට ප්‍රඥාවක් නැතිව, ගිජු වී, මුසපත් වී, ඇලී ගැලී වළඳයි. ඔහු එහිදී කාම විතර්ක ද විතර්ක කරයි, ව්‍යාපාද විතර්ක ද විතර්ක කරයි, විහිංසා විතර්ක ද විතර්ක කරයි. මහණෙනි, මෙබඳු භික්ෂුවකට දෙන ලද දානය මහත්ඵල නොවේ යැයි මම කියමි. ඒ කිමෙක් ද? මහණෙනි, ඒ භික්ෂුව ප්‍රමාදයට පත් ව වාසය කරන බැවිනි.\n\n\"නමුත් මහණෙනි, මෙහිලා යම් භික්ෂුවක් කිසියම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කොට වාසය කරයි. එවිට ඔහුට ගෘහපතියෙක් හෝ ගෘහපති පුත්‍රයෙක් හෝ ළඟට පැමිණ හෙට දවසේ දානයට ආරාධනා කරයි. මහණෙනි, කැමති වන්නේ නම් ඒ භික්ෂුව එය පිළිගනී. ඔහු ඒ රාත්‍රිය ඉක්ම ගිය පසු පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන ඒ ගෘහපතියාගේ හෝ ගෘහපති පුත්‍රයාගේ හෝ නිවස වෙත එළඹෙයි; එළඹ, පනවන ලද අසුනක වාඩි වෙයි. ඒ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා හෝ ප්‍රණීත වූ කෑමෙන්, බීමෙන් තම අතින් සංග්‍රහ කොට සතුටු කරයි. ඔහුට 'ඉතා යහපත්! මේ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා හෝ මා හට ප්‍රණීත වූ කෑමෙන්, බීමෙන් තම අතින් සංග්‍රහ කොට සතුටු කරයි' කියා සිතක් ඇති නොවේ. තවද ඔහුට 'අහෝ! මේ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා හෝ මට මතු දවසෙහි ද මෙවැනි ප්‍රණීත වූ කෑමෙන්, බීමෙන් තම අතින් සංග්‍රහ කොට සතුටු කරන්නේ නම් ඉතා යහපත්!' කියා සිතක් ද ඇති නොවේ. ඔහු ඒ පිණ්ඩපාතය (ආදීනව) කෙළවරක් දක්නාසුලුව, (සසරින්) මිදීමට ප්‍රඥාව ඇතිව, ගිජු නොවී, මුසපත් නොවී, ඇලී ගැලී නොසිට වළඳයි. ඔහු එහිදී නෛෂ්ක්‍රම්‍ය විතර්ක ද විතර්ක කරයි, අව්‍යාපාද විතර්ක ද විතර්ක කරයි, අවිහිංසා විතර්ක ද විතර්ක කරයි. මහණෙනි, මෙබඳු භික්ෂුවකට දෙන ලද දානය මහත්ඵල වේ යැයි මම කියමි. ඒ කිමෙක් ද? මහණෙනි, ඒ භික්ෂුව අප්‍රමාදයට පත් ව වාසය කරන බැවිනි.\"",
      "paliTitle": "Kusinārasuttaṃ"
    },
    {
      "number": 125,
      "pali": "‘‘Yassaṃ, bhikkhave, disāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, manasi kātumpi me esā, bhikkhave, disā na phāsu hoti, pageva gantuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto tayo dhamme pajahiṃsu, tayo dhamme bahulamakaṃsu [bahulīmakaṃsu (syā. kaṃ. pī.)]. Katame tayo dhamme pajahiṃsu? Nekkhammavitakkaṃ, abyāpādavitakkaṃ, avihiṃsāvitakkaṃ – ime tayo dhamme pajahiṃsu. Katame tayo dhamme bahulamakaṃsu? Kāmavitakkaṃ, byāpādavitakkaṃ, vihiṃsāvitakkaṃ – ime tayo dhamme bahulamakaṃsu’. Yassaṃ, bhikkhave, disāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, manasi kātumpi me esā, bhikkhave, disā na phāsu hoti, pageva gantuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto ime tayo dhamme pajahiṃsu, ime tayo dhamme bahulamakaṃsu’’’. ‘‘Yassaṃ pana, bhikkhave, disāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, gantumpi me esā, bhikkhave, disā phāsu hoti, pageva manasi kātuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto tayo dhamme pajahiṃsu, tayo dhamme bahulamakaṃsu. Katame tayo dhamme pajahiṃsu? Kāmavitakkaṃ, byāpādavitakkaṃ, vihiṃsāvitakkaṃ – ime tayo dhamme pajahiṃsu. Katame tayo dhamme bahulamakaṃsu? Nekkhammavitakkaṃ, abyāpādavitakkaṃ, avihiṃsāvitakkaṃ – ime tayo dhamme bahulamakaṃsu’. Yassaṃ, bhikkhave, disāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, gantumpi me esā, bhikkhave, disā phāsu hoti, pageva manasi kātuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto ime tayo dhamme pajahiṃsu, ime tayo dhamme bahulamakaṃsū’’’ti. Dutiyaṃ.",
      "english": "Monks, in any direction where monastics dwell, engaged in quarrels, disputes, and disagreements, piercing each other with the darts of their speech, that direction, Monks, is not agreeable for me even to think about, much less to go to! I come to this conclusion regarding them: 'Surely, those venerable ones have abandoned three qualities and frequently cultivated three other qualities. Which three qualities have they abandoned? Thoughts of renunciation, thoughts of non-ill-will, and thoughts of non-harming – these three qualities have they abandoned. Which three qualities have they frequently cultivated? Thoughts of sensual desire, thoughts of ill-will, and thoughts of harming – these three qualities have they frequently cultivated.' Monks, in any direction where monastics dwell, engaged in quarrels, disputes, and disagreements, piercing each other with the darts of their speech, that direction, Monks, is not agreeable for me even to think about, much less to go to! I come to this conclusion regarding them: 'Surely, those venerable ones have abandoned these three qualities and frequently cultivated these three other qualities.'\n\nHowever, Monks, in any direction where monastics dwell in harmony, with mutual appreciation, without dispute, having become like milk and water, regarding one another with kindly eyes, that direction, Monks, is agreeable for me even to go to, much less to think about! I come to this conclusion regarding them: 'Surely, those venerable ones have abandoned three qualities and frequently cultivated three other qualities. Which three qualities have they abandoned? Thoughts of sensual desire, thoughts of ill-will, and thoughts of harming – these three qualities have they abandoned. Which three qualities have they frequently cultivated? Thoughts of renunciation, thoughts of non-ill-will, and thoughts of non-harming – these three qualities have they frequently cultivated.' However, Monks, in any direction where monastics dwell in harmony, with mutual appreciation, without dispute, having become like milk and water, regarding one another with kindly eyes, that direction, Monks, is agreeable for me even to go to, much less to think about! I come to this conclusion regarding them: 'Surely, those venerable ones have abandoned these three qualities and frequently cultivated these three other qualities.'",
      "sinhala": "මහණෙනි, යම් දිශාවක භික්‍ෂූන් වහන්සේලා කලහ ඇති කරගෙන, විවාද ඇති කරගෙන, භේද ඇති කරගෙන, එකිනෙකාට මුඛ ශස්ත්‍රයෙන් විදිනු ලබමින් වසත්ද, මහණෙනි, ඒ දිශාව මට සිතන්නටවත් පහසු නැත, යාමට කෙසේ වෙතත්. මම මේ පිළිබඳව නිගමනයකට එළඹෙමි: ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ත්‍රිවිධ ධර්මයන් අත්හැරියහ, ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළහ.’ කවර ත්‍රිවිධ ධර්මයන් අත්හැරියෝද? නෛෂ්ක්‍රම්‍ය විතර්කය, අව්‍යාපාද විතර්කය, අවිහිංසා විතර්කය - මේ ත්‍රිවිධ ධර්මයන් අත්හැරියෝය. කවර ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළෝද? කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය - මේ ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළෝය. මහණෙනි, යම් දිශාවක භික්‍ෂූන් වහන්සේලා කලහ ඇති කරගෙන, විවාද ඇති කරගෙන, භේද ඇති කරගෙන, එකිනෙකාට මුඛ ශස්ත්‍රයෙන් විදිනු ලබමින් වසත්ද, මහණෙනි, ඒ දිශාව මට සිතන්නටවත් පහසු නැත, යාමට කෙසේ වෙතත්. මම මේ පිළිබඳව නිගමනයකට එළඹෙමි: ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු මේ ත්‍රිවිධ ධර්මයන් අත්හැරියහ, මේ ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළහ.’\n\nමහණෙනි, යම් දිශාවක නම් භික්‍ෂූන් වහන්සේලා සමගිව, සාමොදමාන වෙමින්, විවාද නොකරමින්, කිරි හා ජලය මෙන් එකිනෙකාට ප්‍රිය වූ ඇස්වලින් බලමින් වසත්ද, මහණෙනි, ඒ දිශාව මට යාමටත් පහසුය, සිතන්නට කෙසේ වෙතත්. මම මේ පිළිබඳව නිගමනයකට එළඹෙමි: ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ත්‍රිවිධ ධර්මයන් අත්හැරියහ, ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළහ.’ කවර ත්‍රිවිධ ධර්මයන් අත්හැරියෝද? කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය - මේ ත්‍රිවිධ ධර්මයන් අත්හැරියෝය. කවර ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළෝද? නෛෂ්ක්‍රම්‍ය විතර්කය, අව්‍යාපාද විතර්කය, අවිහිංසා විතර්කය - මේ ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළෝය. මහණෙනි, යම් දිශාවක භික්‍ෂූන් වහන්සේලා සමගිව, සාමොදමාන වෙමින්, විවාද නොකරමින්, කිරි හා ජලය මෙන් එකිනෙකාට ප්‍රිය වූ ඇස්වලින් බලමින් වසත්ද, මහණෙනි, ඒ දිශාව මට යාමටත් පහසුය, සිතන්නට කෙසේ වෙතත්. මම මේ පිළිබඳව නිගමනයකට එළඹෙමි: ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු මේ ත්‍රිවිධ ධර්මයන් අත්හැරියහ, මේ ත්‍රිවිධ ධර්මයන් බහුල වශයෙන් පුරුදු කළහ.’",
      "paliTitle": "Bhaṇḍanasuttaṃ"
    },
    {
      "number": 126,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati gotamake cetiye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Abhiññāyāhaṃ, bhikkhave, dhammaṃ desemi, no anabhiññāya. Sanidānāhaṃ, bhikkhave, dhammaṃ desemi, no anidānaṃ. Sappāṭihāriyāhaṃ, bhikkhave, dhammaṃ desemi, no appāṭihāriyaṃ. Tassa mayhaṃ, bhikkhave, abhiññāya dhammaṃ desayato no anabhiññāya, sanidānaṃ dhammaṃ desayato no anidānaṃ, sappāṭihāriyaṃ dhammaṃ desayato no appāṭihāriyaṃ, karaṇīyo ovādo, karaṇīyā anusāsanī. Alañca pana vo, bhikkhave, tuṭṭhiyā, alaṃ attamanatāya, alaṃ somanassāya – ‘sammāsambuddho bhagavā, svākkhāto dhammo, suppaṭipanno saṅgho’’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne sahassī lokadhātu akampitthāti. Tatiyaṃ.",
      "english": "At one time the Blessed One was dwelling in Vesāli at the Gōtamaka Shrine. There the Blessed One addressed the monks, saying: \"Monks.\" \"Venerable sir,\" those monks replied to the Blessed One. The Blessed One spoke this: \"Monks, I teach the Dhamma with direct knowledge, not without it. Monks, I teach the Dhamma with a proper basis and reason, not without one. Monks, I teach the Dhamma with its wondrous manifestations of truth, not without them. Monks, for me, who teaches the Dhamma with direct knowledge and not without it, with a proper basis and reason and not without one, and with its wondrous manifestations of truth and not without them—for me, instruction is to be followed and admonition is to be heeded. And, monks, it is sufficient for you to have contentment, sufficient to have gladness, sufficient to have joy, [thinking]: 'The Blessed One is perfectly and fully enlightened, the Dhamma is well-expounded, the Saṅgha has practiced well.'\" The Blessed One said this. Those monks, pleased, rejoiced in the Blessed One's words. And while this exposition was being delivered, the thousandfold world system trembled.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි ගෝතමක චේතියෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක – “මහණෙනි” කියා. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක –\n\n“මහණෙනි, මම ධර්මය දේශනා කරන්නේ අභිඥා ඥානයෙන් යුක්තව මිස, අභිඥා ඥානයෙන් තොරව නොවේ. මහණෙනි, මම ධර්මය දේශනා කරන්නේ හේතු ප්‍රත්‍ය සහිතව මිස, හේතු ප්‍රත්‍ය රහිතව නොවේ. මහණෙනි, මම ධර්මය දේශනා කරන්නේ ප්‍රාතිහාර්යයක් සහිතව මිස, ප්‍රාතිහාර්යයක් රහිතව නොවේ. මහණෙනි, අභිඥා ඥානයෙන් යුක්තව මිස, අභිඥා ඥානයෙන් තොරව නොවන සේ ධර්මය දේශනා කරන්නා වූ, හේතු ප්‍රත්‍ය සහිතව මිස, හේතු ප්‍රත්‍ය රහිතව නොවන සේ ධර්මය දේශනා කරන්නා වූ, ප්‍රාතිහාර්යයක් සහිතව මිස, ප්‍රාතිහාර්යයක් රහිතව නොවන සේ ධර්මය දේශනා කරන්නා වූ මා හට, අවවාද කිරීම යුක්තයි, අනුශාසනා කිරීම යුක්තයි. මහණෙනි, ‘භාග්‍යවතුන් වහන්සේ සම්මාසම්බුද්ධ සේක, ධර්මය මනාව දේශනා කර ඇත, සංඝයා වහන්සේ යහපත් මාර්ගයෙහි පිළිපන් සේක’ යන මේ කරුණ ඔබට තුටුපහටු වීමටත්, සිත සතුටු කර ගැනීමටත්, සතුටු සිතින් යුක්ත වීමටත් ප්‍රමාණවත් වන්නේය.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ දෙසුම සතුටින් පිළිගත්හ. තවද, මේ ව්‍යාකරණ ධර්මය දේශනා කරන කල්හි දහසක් ලෝක ධාතුව කම්පා විය.",
      "paliTitle": "Gotamakacetiyasuttaṃ"
    },
    {
      "number": 127,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno yena kapilavatthu tadavasari. Assosi kho mahānāmo sakko – ‘‘bhagavā kira kapilavatthuṃ anuppatto’’ti. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho mahānāmaṃ sakkaṃ bhagavā etadavoca – ‘‘Gaccha, mahānāma, kapilavatthusmiṃ, tathārūpaṃ āvasathaṃ jāna yatthajja mayaṃ ekarattiṃ vihareyyāmā’’ti. ‘‘Evaṃ, bhante’’ti kho mahānāmo sakko bhagavato paṭissutvā kapilavatthuṃ pavisitvā kevalakappaṃ kapilavatthuṃ anvāhiṇḍanto [āhiṇḍanto (syā. kaṃ.)] nāddasa kapilavatthusmiṃ tathārūpaṃ āvasathaṃ yatthajja bhagavā ekarattiṃ vihareyya. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘natthi, bhante, kapilavatthusmiṃ tathārūpo āvasatho yatthajja bhagavā ekarattiṃ vihareyya. Ayaṃ, bhante, bharaṇḍu kālāmo bhagavato purāṇasabrahmacārī. Tassajja bhagavā assame ekarattiṃ viharatū’’ti. ‘‘Gaccha, mahānāma, santharaṃ paññapehī’’ti. ‘‘Evaṃ, bhante’’ti kho mahānāmo sakko bhagavato paṭissutvā yena bharaṇḍussa kālāmassa assamo tenupasaṅkami; upasaṅkamitvā santharaṃ paññāpetvā udakaṃ ṭhapetvā pādānaṃ dhovanāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘santhato, bhante, santhāro, udakaṃ ṭhapitaṃ pādānaṃ dhovanāya. Yassadāni, bhante, bhagavā kālaṃ maññatī’’ti. Atha kho bhagavā yena bharaṇḍussa kālāmassa assamo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā pāde pakkhālesi. Atha kho mahānāmassa sakkassa etadahosi – ‘‘akālo kho ajja bhagavantaṃ payirupāsituṃ. Kilanto bhagavā. Sve dānāhaṃ bhagavantaṃ payirupāsissāmī’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho mahānāmo sakko tassā rattiyā accayena yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho mahānāmaṃ sakkaṃ bhagavā etadavoca – ‘‘tayo khome, mahānāma, satthāro santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti; na rūpānaṃ pariññaṃ paññāpeti, na vedanānaṃ pariññaṃ paññāpeti. Idha pana, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti, rūpānaṃ pariññaṃ paññāpeti; na vedanānaṃ pariññaṃ paññāpeti. Idha pana, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti, rūpānaṃ pariññaṃ paññāpeti, vedanānaṃ pariññaṃ paññāpeti. Ime kho, mahānāma, tayo satthāro santo saṃvijjamānā lokasmiṃ. ‘Imesaṃ, mahānāma, tiṇṇaṃ satthārānaṃ ekā niṭṭhā udāhu puthu niṭṭhā’’’ti? Evaṃ vutte bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma, vadehī’’ti. Evaṃ vutte bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti. Dutiyampi kho bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma, vadehī’’ti. Dutiyampi kho bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti. Tatiyampi kho bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma, vadehī’’ti. Tatiyampi kho bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti. Atha kho bharaṇḍu kālāmassa etadahosi – ‘‘mahesakkhassa vatamhi mahānāmassa sakkassa sammukhā samaṇena gotamena yāvatatiyaṃ apasādito. Yaṃnūnāhaṃ kapilavatthumhā pakkameyya’’nti. Atha kho bharaṇḍu kālāmo kapilavatthumhā pakkāmi. Yaṃ kapilavatthumhā pakkāmi tathā pakkantova ahosi na puna paccāgacchīti. Catutthaṃ.",
      "english": "On one occasion, the Blessed One, while wandering in the Kōsalas, arrived at Kapilavatthu. Sakyan Mahānāma heard, \"The Blessed One has indeed arrived at Kapilavatthu.\" Then Sakyan Mahānāma approached the Blessed One; having approached and paid homage to the Blessed One, he stood to one side. The Blessed One said to Sakyan Mahānāma, who was standing to one side: \"Go, Mahānāma, and find in Kapilavatthu a suitable lodging where we may stay for one night today.\" \"Yes, Venerable Sir,\" Sakyan Mahānāma replied to the Blessed One, and having entered Kapilavatthu and searched throughout the entire Kapilavatthu, he did not find a suitable lodging where the Blessed One could stay for one night today. Then Sakyan Mahānāma approached the Blessed One; having approached, he said to the Blessed One: \"There is no suitable lodging in Kapilavatthu, Venerable Sir, where the Blessed One could stay for one night today. Venerable Sir, Bharandu Kālāma is an old companion in the holy life of the Blessed One. Let the Blessed One stay for one night today in his hermitage.\" \"Go, Mahānāma, and prepare a resting place.\" \"Yes, Venerable Sir,\" Sakyan Mahānāma replied to the Blessed One, and having approached Bharandu Kālāma's hermitage, and having prepared the resting place and placed water for washing the feet, he approached the Blessed One and said to him: \"The resting place is prepared, Venerable Sir, and water for washing the feet has been placed. Now, Venerable Sir, let the Blessed One do as he sees fit.\" Then the Blessed One approached Bharandu Kālāma's hermitage; having approached, he sat down on the prepared seat. Having sat down, the Blessed One washed his feet. Then it occurred to Sakyan Mahānāma: \"It is not the right time today to wait upon the Blessed One. The Blessed One is tired. Tomorrow I shall wait upon the Blessed One.\" So, having paid homage to the Blessed One and circumambulated him clockwise, he departed.\n\nThen Sakyan Mahānāma, when that night had passed, approached the Blessed One; having approached, he sat down to one side. To Sakyan Mahānāma, who was sitting to one side, the Blessed One said: \"Mahānāma, there are these three teachers existing and found in the world. Which three? Here, Mahānāma, one teacher proclaims the full understanding of sense-desires, but does not proclaim the full understanding of form, nor the full understanding of feelings. Here again, Mahānāma, one teacher proclaims the full understanding of sense-desires and the full understanding of form, but does not proclaim the full understanding of feelings. Here again, Mahānāma, one teacher proclaims the full understanding of sense-desires, the full understanding of form, and the full understanding of feelings. These, Mahānāma, are the three teachers existing and found in the world. For these three teachers, Mahānāma, is there one ultimate goal, or are there distinct ultimate goals?\"\n\nWhen this was said, Bharandu Kālāma said to Sakyan Mahānāma: \"Mahānāma, declare it to be one.\" When this was said, the Blessed One said to Sakyan Mahānāma: \"Mahānāma, declare them to be distinct.\" A second time Bharandu Kālāma said to Sakyan Mahānāma: \"Mahānāma, declare it to be one.\" A second time the Blessed One said to Sakyan Mahānāma: \"Mahānāma, declare them to be distinct.\" A third time Bharandu Kālāma said to Sakyan Mahānāma: \"Mahānāma, declare it to be one.\" A third time the Blessed One said to Sakyan Mahānāma: \"Mahānāma, declare them to be distinct.\" Then it occurred to Bharandu Kālāma: \"Before the powerful Sakyan Mahānāma, I have been disparaged three times by the recluse Gotama. What if I were to depart from Kapilavatthu?\" Then Bharandu Kālāma departed from Kapilavatthu. Having thus departed from Kapilavatthu, he never returned.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයේ චාරිකාවේ වඩමින් කපිලවස්තුවට වැඩම කළ සේක. මහානාම ශාක්‍යයාට භාග්‍යවතුන් වහන්සේ කපිලවස්තුවට වැඩම කළ බව අසන්නට ලැබුණි. එවිට මහානාම ශාක්‍යයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක සිටියේය. එක් පසෙක සිටි මහානාම ශාක්‍යයාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහානාම, කපිලවස්තුවට ගොස්, අද රාත්‍රියෙහි අපට වැඩ සිටීමට සුදුසු ආවාසයක් සොයා බලන්න.” “එසේය, භන්තේ” යැයි මහානාම ශාක්‍යයා භාග්‍යවතුන් වහන්සේට ප්‍රතිඥා දී, කපිලවස්තුවට පිවිස, මුළු කපිලවස්තුව පුරාම ඇවිද බැලුවද, අද රාත්‍රියෙහි භාග්‍යවතුන් වහන්සේට වැඩ සිටීමට සුදුසු ආවාසයක් කපිලවස්තුවෙහි නොදුටුවේය. එවිට මහානාම ශාක්‍යයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භන්තේ, අද රාත්‍රියෙහි භාග්‍යවතුන් වහන්සේට වැඩ සිටීමට සුදුසු ආවාසයක් කපිලවස්තුවෙහි නැත. භන්තේ, මේ භරණ්ඩු කාලාම භාග්‍යවතුන් වහන්සේගේ පැරණි සබ්‍රහ්මචාරී කෙනෙකි. අද භාග්‍යවතුන් වහන්සේ ඔහුගේ ආශ්‍රමයෙහි එක් රාත්‍රියක් වැඩ සිටින සේක්වා!” “මහානාම, ගොස් සයනය පිළියෙළ කරන්න” යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. “එසේය, භන්තේ” යැයි මහානාම ශාක්‍යයා භාග්‍යවතුන් වහන්සේට ප්‍රතිඥා දී, භරණ්ඩු කාලාමගේ ආශ්‍රමය වෙත ගොස්, සයනය පිළියෙළ කර, පා සේදීම සඳහා ජලය තබා, භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භන්තේ, සයනය සකසා ඇත, පා සේදීම සඳහා ජලය තබා ඇත. දැන් භාග්‍යවතුන් වහන්සේ සුදුසු යැයි සිතන වේලාව මෙයයි.” එවිට භාග්‍යවතුන් වහන්සේ භරණ්ඩු කාලාමගේ ආශ්‍රමය වෙත වැඩම කර, සකසා තිබූ ආසනයෙහි වැඩ සිටි සේක. වැඩ සිටි භාග්‍යවතුන් වහන්සේ පා සේදූ සේක. එවිට මහානාම ශාක්‍යයාට මෙසේ සිතුණි: “අද භාග්‍යවතුන් වහන්සේට උවටැන් කිරීමට සුදුසු වේලාවක් නොවේ. භාග්‍යවතුන් වහන්සේ වෙහෙසට පත්ව සිටිති. දැන් මම හෙට භාග්‍යවතුන් වහන්සේට උවටැන් කරන්නෙමි” යැයි භාග්‍යවතුන් වහන්සේට වන්දනා කර, ප්‍රදක්ෂිණා කර පිටව ගියේය.\n\nඑවිට මහානාම ශාක්‍යයා ඒ රාත්‍රිය ඉක්ම ගිය පසු, භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි මහානාම ශාක්‍යයාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහානාම, මෙලොව ශාස්තෘවරුන් තිදෙනෙක් සිටිති. ඒ තිදෙනා කවුරුන්ද? මහානාම, මෙහි එක් ශාස්තෘවරයෙක් කාමයන් පිළිබඳව පිරිසිඳ දැකීම උගන්වයි; රූපයන් පිළිබඳව පිරිසිඳ දැකීම නොඋගන්වයි, වේදනාවන් පිළිබඳව පිරිසිඳ දැකීම නොඋගන්වයි. මහානාම, මෙහි තවත් එක් ශාස්තෘවරයෙක් කාමයන් පිළිබඳව පිරිසිඳ දැකීම උගන්වයි, රූපයන් පිළිබඳව පිරිසිඳ දැකීම උගන්වයි; වේදනාවන් පිළිබඳව පිරිසිඳ දැකීම නොඋගන්වයි. මහානාම, මෙහි තවත් එක් ශාස්තෘවරයෙක් කාමයන් පිළිබඳව පිරිසිඳ දැකීම උගන්වයි, රූපයන් පිළිබඳව පිරිසිඳ දැකීම උගන්වයි, වේදනාවන් පිළිබඳව පිරිසිඳ දැකීම උගන්වයි. මහානාම, මෙලොව සිටින ශාස්තෘවරුන් මේ තිදෙනායි. ‘මහානාම, මේ ශාස්තෘවරුන් තිදෙනාගේ අවසානය එකක්ද, නැතහොත් වෙනස් අවසාන ඇත්තෝද’?” මෙසේ වදාළ විට භරණ්ඩු කාලාම මහානාම ශාක්‍යයාට මෙය කීවේය: “මහානාම, එකක් යැයි කියන්න.” මෙසේ කී විට භාග්‍යවතුන් වහන්සේ මහානාම ශාක්‍යයාට මෙය වදාළ සේක: “මහානාම, වෙනස් යැයි කියන්න.” දෙවැනි වරටත් භරණ්ඩු කාලාම මහානාම ශාක්‍යයාට මෙය කීවේය: “මහානාම, එකක් යැයි කියන්න.” දෙවැනි වරටත් භාග්‍යවතුන් වහන්සේ මහානාම ශාක්‍යයාට මෙය වදාළ සේක: “මහානාම, වෙනස් යැයි කියන්න.” තුන්වැනි වරටත් භරණ්ඩු කාලාම මහානාම ශාක්‍යයාට මෙය කීවේය: “මහානාම, එකක් යැයි කියන්න.” තුන්වැනි වරටත් භාග්‍යවතුන් වහන්සේ මහානාම ශාක්‍යයාට මෙය වදාළ සේක: “මහානාම, වෙනස් යැයි කියන්න.” එවිට භරණ්ඩු කාලාම හට මෙසේ සිතුණි: “මේ මහානුභාව සම්පන්න මහානාම ශාක්‍යයා ඉදිරියේ ශ්‍රමණ ගෞතමයන් විසින් තුන් වරක්ම මා අපහසුතාවයට පත් කරන ලදී. කුමක් කළ යුතුද, මම කපිලවස්තුවෙන් පිටව යා යුතුයි.” එවිට භරණ්ඩු කාලාම කපිලවස්තුවෙන් පිටව ගියේය. ඔහු කපිලවස්තුවෙන් පිටව ගිය ආකාරයටම පිටව ගියේය, නැවත කිසිදා නොපැමිණියේය.",
      "paliTitle": "Bharaṇḍukālāmasuttaṃ"
    },
    {
      "number": 128,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho hatthako devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā – ‘‘bhagavato purato ṭhassāmī’’ti osīdatimeva saṃsīdatimeva [osīdati ceva saṃsīdati ca (sī. pī.), osīdati saṃsīdati (syā. kaṃ.)], na sakkoti saṇṭhātuṃ. Seyyathāpi nāma sappi vā telaṃ vā vālukāya āsittaṃ osīdatimeva saṃsīdatimeva, na saṇṭhāti; evamevaṃ hatthako devaputto – ‘‘bhagavato purato ṭhassāmī’’ti osīdatimeva saṃsīdatimeva, na sakkoti saṇṭhātuṃ. Atha kho bhagavā hatthakaṃ devaputtaṃ etadavoca – ‘‘oḷārikaṃ, hatthaka, attabhāvaṃ abhinimmināhī’’ti. ‘‘Evaṃ, bhante’’ti, kho hatthako devaputto bhagavato paṭissutvā oḷārikaṃ attabhāvaṃ abhinimminitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho hatthakaṃ devaputtaṃ bhagavā etadavoca – ‘‘Ye te, hatthaka, dhammā pubbe manussabhūtassa pavattino ahesuṃ, api nu te te dhammā etarahi pavattino’’ti? ‘‘Ye ca me, bhante, dhammā pubbe manussabhūtassa pavattino ahesuṃ, te ca me dhammā etarahi pavattino; ye ca me, bhante, dhammā pubbe manussabhūtassa nappavattino ahesuṃ, te ca me dhammā etarahi pavattino. Seyyathāpi, bhante, bhagavā etarahi ākiṇṇo viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi rājūhi rājamahāmattehi titthiyehi titthiyasāvakehi; evamevaṃ kho ahaṃ, bhante, ākiṇṇo viharāmi devaputtehi. Dūratopi, bhante, devaputtā āgacchanti hatthakassa devaputtassa santike ‘dhammaṃ sossāmā’ti. Tiṇṇāhaṃ, bhante, dhammānaṃ atitto appaṭivāno kālaṅkato. Katamesaṃ tiṇṇaṃ? Bhagavato ahaṃ, bhante, dassanassa atitto appaṭivāno kālaṅkato; saddhammasavanassāhaṃ, bhante, atitto appaṭivāno kālaṅkato; saṅghassāhaṃ, bhante, upaṭṭhānassa atitto appaṭivāno kālaṅkato. Imesaṃ kho ahaṃ, bhante, tiṇṇaṃ dhammānaṃ atitto appaṭivāno kālaṅkato’’ti. ‘‘Nāhaṃ bhagavato dassanassa, tittimajjhagā [titti tittisambhavaṃ (ka.)] kudācanaṃ; Saṅghassa upaṭṭhānassa, saddhammasavanassa ca. ‘‘Adhisīlaṃ sikkhamāno, saddhammasavane rato; Tiṇṇaṃ dhammānaṃ atitto, hatthako avihaṃ gato’’ti. pañcamaṃ;",
      "english": "At one time the Blessed One was staying in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Then, when the night was far advanced and shining forth, the deity Hatthaka, with a surpassing beauty illuminating the entire Jeta's Grove, approached the Blessed One. Having approached, he thought, \"I shall stand before the Blessed One,\" but he kept sinking down and subsiding, unable to stand firm. Just as ghee or oil poured onto sand keeps sinking down and subsiding and does not stay firm, even so, the deity Hatthaka, thinking, \"I shall stand before the Blessed One,\" kept sinking down and subsiding, unable to stand firm. Then the Blessed One said to the deity Hatthaka, \"Hatthaka, create for yourself a grosser form.\"\n\n\"Yes, venerable sir,\" the deity Hatthaka replied to the Blessed One. Having created a grosser form for himself, he paid homage to the Blessed One and stood to one side. To the deity Hatthaka, standing to one side, the Blessed One said this: \"Hatthaka, those qualities of yours that prevailed when you were formerly a human being, do those same qualities prevail now?\"\n\n\"Venerable sir, those qualities of mine that prevailed when I was formerly a human being, those qualities of mine prevail now. And venerable sir, those qualities of mine that did not prevail when I was formerly a human being, those qualities of mine prevail now. Just as, venerable sir, the Blessed One now dwells surrounded by monks, nuns, male lay followers, female lay followers, kings, royal ministers, sectarians, and their disciples; even so, venerable sir, I dwell surrounded by deities. Even from afar, venerable sir, deities come to the presence of the deity Hatthaka, saying, 'We shall hear the Dhamma.' Venerable sir, I passed away insatiated and unrepulsed with regard to three things.\"\n\n\"Which three?\"\n\n\"Venerable sir, I passed away insatiated and unrepulsed with regard to seeing the Blessed One. Venerable sir, I passed away insatiated and unrepulsed with regard to hearing the True Dhamma. Venerable sir, I passed away insatiated and unrepulsed with regard to attending on the Saṅgha. Indeed, venerable sir, concerning these three things I passed away insatiated and unrepulsed.\"\n\n\"Never did I reach full satisfaction from seeing the Blessed One at any time,\nnor from attending on the Saṅgha, nor from hearing the True Dhamma.\nTraining in higher virtue, delighting in hearing the True Dhamma,\nHatthaka, insatiated with these three things, went to the Aviha realm.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. ඉක්බිති හත්ථක නම් දෙව්පුත් රෑ ඉක්මගිය කල්හි අතිශය පැහැපත් වර්ණ ඇත්තෙක් වී මුළු ජේතවනාරාමයම බබුළුවා, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, \"භාග්‍යවතුන් වහන්සේ ඉදිරියේ සිටින්නෙමි\" යි සිතුවද, ඔහු කිඳා බැස යමින්, ගිලී යමින්, සිටගන්නට නොහැකි විය. යම්සේ ඝෘතය හෝ තෙල් හෝ වැල්ලට වත්කළ කල්හි කිඳා බැස යන්නේය, ගිලී යන්නේය, නොසිටින්නේය; එසෙයින්ම හත්ථක දෙව්පුත් ද \"භාග්‍යවතුන් වහන්සේ ඉදිරියේ සිටින්නෙමි\" යි සිතුවද, කිඳා බැස යමින්, ගිලී යමින්, සිටගන්නට නොහැකි විය. ඉක්බිති භාග්‍යවතුන් වහන්සේ හත්ථක දෙව්පුත්හට මෙය වදාළ සේක: \"හත්ථක, ඝන වූ ශරීරයක් මවාගනුව!\" \"එසේය, භාග්‍යවතුන් වහන්සැ\" යි හත්ථක දෙව්පුත් භාග්‍යවතුන් වහන්සේට ප්‍රතිඥා දී, ඝන වූ ශරීරයක් මවාගෙන, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එක්පසෙක සිටියේය.\n\nඑක්පසෙක සිටි හත්ථක දෙව්පුත්හට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"හත්ථක, ඔබ පෙර මිනිස්ව සිටි කල්හි ඔබට යම් ධර්ම කාරණා පැවතුනේද, ඒ ධර්ම කාරණා දැන් ද ඔබට පවතින්නේද?\" \"වහන්ස, පෙර මිනිස්ව සිටි කල්හි මට යම් ධර්ම කාරණා පැවතුනේද, ඒ ධර්ම කාරණා දැන් ද මට පවතී; වහන්ස, පෙර මිනිස්ව සිටි කල්හි මට යම් ධර්ම කාරණා නොපැවතුනේද, ඒ ධර්ම කාරණා ද දැන් මට පවතී. වහන්ස, යම්සේ භාග්‍යවතුන් වහන්සේ දැන් භික්ෂූන් වහන්සේලා, භික්ෂුණීන් වහන්සේලා, උපාසකවරුන්, උපාසිකාවන්, රජවරුන්, රාජ මහාමාත්‍යවරුන්, තීර්ථකයන්, තීර්ථක ශ්‍රාවකයන් විසින් පිරිවරා වැඩවසන සේක් ද; එසෙයින්ම වහන්ස, මම ද දෙව්පුතුන් විසින් පිරිවරා වෙසෙමි. වහන්ස, ඈත සිට ද 'ධර්මය අසන්නෙමු' යි සිතා දෙව්පුත්තු හත්ථක දෙව්පුත් සමීපයට පැමිණෙති. වහන්ස, මම කරුණු තුනක් පිළිබඳව නොසතුටු වූයේ, ආශාව නොනැසුණේ මිය පරලොව ගියෙමි.\" \"ඒ තුන කුමක් ද?\" \"වහන්ස, මම භාග්‍යවතුන් වහන්සේ දැකීමෙහි නොසතුටු වූයේ, ආශාව නොනැසුණේ මිය පරලොව ගියෙමි; වහන්ස, මම සද්ධර්මය ශ්‍රවණය කිරීමෙහි නොසතුටු වූයේ, ආශාව නොනැසුණේ මිය පරලොව ගියෙමි; වහන්ස, මම සංඝයාට උපස්ථාන කිරීමෙහි නොසතුටු වූයේ, ආශාව නොනැසුණේ මිය පරලොව ගියෙමි. වහන්ස, මේ කරුණු තුන පිළිබඳව මම නොසතුටු වූයේ, ආශාව නොනැසුණේ මිය පරලොව ගියෙමි.\"\n\nමම භාග්‍යවතුන් වහන්සේ දැකීමෙන් කිසි කලෙක තෘප්තියට නොපැමිණියෙමි; සංඝයාට උපස්ථාන කිරීමෙන් ද, සද්ධර්මය ශ්‍රවණය කිරීමෙන් ද කිසි කලෙක තෘප්තියට නොපැමිණියෙමි. අධිශීලයෙහි හික්මෙමින්, සද්ධර්ම ශ්‍රවණයෙහි ඇලී සිටි, කරුණු තුනක් පිළිබඳව නොසතුටු වූ, හත්ථක නම් තෙමේ අවිහා භවයට පැමිණියේය.",
      "paliTitle": "Hatthakasuttaṃ"
    },
    {
      "number": 129,
      "pali": "Ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya bārāṇasiṃ piṇḍāya pāvisi. Addasā kho bhagavā goyogapilakkhasmiṃ [goyogamilakkhasmiṃ (syā. kaṃ. ka.)] piṇḍāya caramāno [caramānaṃ (ka.)] aññataraṃ bhikkhuṃ rittassādaṃ bāhirassādaṃ muṭṭhassatiṃ asampajānaṃ asamāhitaṃ vibbhantacittaṃ pākatindriyaṃ. Disvā taṃ bhikkhuṃ etadavoca – ‘‘Mā kho tvaṃ, bhikkhu, attānaṃ kaṭuviyamakāsi. Taṃ vata bhikkhu kaṭuviyakataṃ attānaṃ āmagandhena [āmagandhe (sī. syā. kaṃ. pī.)] avassutaṃ makkhikā nānupatissanti nānvāssavissantīti [nānubandhissanti (ka.)], netaṃ ṭhānaṃ vijjatī’’ti. Atha kho so bhikkhu bhagavatā iminā ovādena ovadito saṃvegamāpādi. Atha kho bhagavā bārāṇasiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto bhikkhū āmantesi – ‘‘Idhāhaṃ, bhikkhave, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya bārāṇasiṃ piṇḍāya pāvisiṃ. Addasaṃ kho ahaṃ, bhikkhave, goyogapilakkhasmiṃ piṇḍāya caramāno aññataraṃ bhikkhuṃ rittassādaṃ bāhirassādaṃ muṭṭhassatiṃ asampajānaṃ asamāhitaṃ vibbhantacittaṃ pākatindriyaṃ. Disvā taṃ bhikkhuṃ etadavocaṃ – ‘‘‘Mā kho tvaṃ, bhikkhu, attānaṃ kaṭuviyamakāsi. Taṃ vata bhikkhu kaṭuviyakataṃ attānaṃ āmagandhena avassutaṃ makkhikā nānupatissanti nānvāssavissantīti, netaṃ ṭhānaṃ vijjatī’ti. Atha kho, bhikkhave, so bhikkhu mayā iminā ovādena ovadito saṃvegamāpādī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘kiṃ nu kho, bhante, kaṭuviyaṃ? Ko āmagandho? Kā makkhikā’’ti? ‘‘Abhijjhā kho, bhikkhu, kaṭuviyaṃ; byāpādo āmagandho; pāpakā akusalā vitakkā makkhikā. Taṃ vata, bhikkhu, kaṭuviyakataṃ attānaṃ āmagandhena avassutaṃ makkhikā nānupatissanti nānvāssavissantīti, netaṃ ṭhānaṃ vijjatī’’ti. ‘‘Aguttaṃ cakkhusotasmiṃ, indriyesu asaṃvutaṃ; Makkhikānupatissanti, saṅkappā rāganissitā. ‘‘Kaṭuviyakato bhikkhu, āmagandhe avassuto; Ārakā hoti nibbānā, vighātasseva bhāgavā. ‘‘Gāme vā yadi vāraññe, aladdhā samathamattano [samamattano (sī. syā. kaṃ.), sammamattano (pī.)]; Pareti [careti (syā. ka.)] bālo dummedho, makkhikāhi purakkhato. ‘‘Ye ca sīlena sampannā, paññāyūpasameratā; Upasantā sukhaṃ senti, nāsayitvāna makkhikā’’ti. chaṭṭhaṃ;",
      "english": "On one occasion, the Blessed One was dwelling in Bārāṇasī, at Isipatana, in the Deer Park. Then, in the forenoon, the Blessed One dressed, and taking his bowl and outer robe, entered Bārāṇasī for alms. While wandering for alms at the Goyogapilakkha, the Blessed One saw a certain monk who was empty of spiritual essence, focused on external satisfactions, devoid of mindfulness, lacking clear comprehension, unconcentrated, with a wandering mind, and with unrestrained faculties. Having seen that monk, he said this: \"Indeed, monk, do not make yourself like a piece of putrid meat. Surely, monk, that flies will not fall upon oneself made like putrid meat, imbued with the stench of decay, will not swarm over it—this is not possible.\" Then that monk, having been exhorted with this exhortation by the Blessed One, experienced a deep sense of spiritual urgency.\n\nThen, having wandered for alms in Bārāṇasī, and having returned from his alms round after the meal, the Blessed One addressed the monks: \"Here, monks, in the forenoon, I dressed, and taking my bowl and outer robe, entered Bārāṇasī for alms. Indeed, monks, while wandering for alms at the Goyogapilakkha, I saw a certain monk who was empty of spiritual essence, focused on external satisfactions, devoid of mindfulness, lacking clear comprehension, unconcentrated, with a wandering mind, and with unrestrained faculties. Having seen that monk, I said this: ‘Indeed, monk, do not make yourself like a piece of putrid meat. Surely, monk, that flies will not fall upon oneself made like putrid meat, imbued with the stench of decay, will not swarm over it—this is not possible.’ Then, monks, that monk, having been exhorted with this exhortation by me, experienced a deep sense of spiritual urgency.\"\n\nWhen this was said, a certain monk said to the Blessed One: \"What now, Venerable Sir, is ‘putrid meat’? What is the ‘stench of decay’? What are the ‘flies’?\"\n\n\"Indeed, monk, covetousness is the ‘putrid meat’; ill-will is the ‘stench of decay’; evil, unwholesome thoughts are the ‘flies’. Surely, monk, that flies will not fall upon oneself made like putrid meat, imbued with the stench of decay, will not swarm over it—this is not possible.\"\n\n\"One unguarded in eye and ear, unrestrained in the senses, upon him will fall the flies—thoughts rooted in lust. A monk made like putrid meat, imbued with the stench of decay, is far from Nibbāna; he is indeed a participant in torment. Whether in a village or in a forest, the foolish, unwise one, not having attained inner calm for himself, wanders, surrounded by flies. But those who are accomplished in virtue, delighting in wisdom and tranquility, being peaceful, they sleep happily, having destroyed the flies.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ ඉසිපතන මිගදායේ බරණැස වැඩසිටි සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍රය හා සිවුරු ගෙන, බරණැසට පිඬු සිඟා වදාළ සේක. භාග්‍යවතුන් වහන්සේ ගොයෝගපිලක්ඛ නම් ස්ථානයෙහි පිඬු සිඟා වඩිනා අතර, ධර්ම රස විරහිත වූ, බාහිර රසයෙහි ඇලුනා වූ, සිහි නැති වූ, අවිචාරවත් වූ, නොසන්සුන් සිත් ඇත්තා වූ, වික්ෂිප්ත සිත් ඇත්තා වූ, ඉඳුරන් මුදාහළා වූ එක්තරා භික්ෂුවක් දුටු සේක. ඒ භික්ෂුව දැක මේ වදාළ සේක: \"මහණ, තෙමේ තමන්ව කටු වියක් නොකරගන්නෙහි. මහණ, කටු වියක් බවට පත් කළ තමන් ආමගන්ධයෙන් තෙත් වූ විට මැස්සෝ නොපැමිණෙත් ද, නොඇලෙත් ද කියා සිතීම විය නොහැක්කකි.\" ඉක්බිති ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේ විසින් මේ අනුශාසනාවෙන් අවවාද කරන ලද්දේ සංවේගයට පත් විය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ බරණැසෙහි පිඬු සිඟා වදාළායින් පසු, දහවල් භෝජනයෙන් ආපසු වැඩ සිට භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මෙහිලා මම පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍රය හා සිවුරු ගෙන, බරණැසට පිඬු සිඟා පිවිසියෙමි. මහණෙනි, ගොයෝගපිලක්ඛ නම් ස්ථානයෙහි පිඬු සිඟා වඩිනා අතර, ධර්ම රස විරහිත වූ, බාහිර රසයෙහි ඇලුනා වූ, සිහි නැති වූ, අවිචාරවත් වූ, නොසන්සුන් සිත් ඇත්තා වූ, වික්ෂිප්ත සිත් ඇත්තා වූ, ඉඳුරන් මුදාහළා වූ එක්තරා භික්ෂුවක් මම දුටුවෙමි. ඒ භික්ෂුව දැක මම මේ වදාළෙමි: 'මහණ, තෙමේ තමන්ව කටු වියක් නොකරගන්නෙහි. මහණ, කටු වියක් බවට පත් කළ තමන් ආමගන්ධයෙන් තෙත් වූ විට මැස්සෝ නොපැමිණෙත් ද, නොඇලෙත් ද කියා සිතීම විය නොහැක්කකි.' මහණෙනි, ඉක්බිති ඒ භික්ෂුව මා විසින් මේ අනුශාසනාවෙන් අවවාද කරන ලද්දේ සංවේගයට පත් විය.\"\n\nමෙසේ වදාළ විට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේට මේ කී ය: \"වහන්ස, 'කටු විය' යනු කුමක් ද? කුමක් ද 'ආමගන්ධය'? කවරහු ද 'මැස්සෝ'?\" \"'මහණ, සැබවින් ම අනුන් සතු දේට ආශා කිරීම (අභිජ්ඣාව) 'කටු විය' වේ; ව්‍යාපාදය (ද්වේෂය) 'ආමගන්ධය' වේ; පාපී වූ අකුසල විතර්ක 'මැස්සෝ' වෙති. මහණ, කටු වියක් බවට පත් කළ තමන් ආමගන්ධයෙන් තෙත් වූ විට මැස්සෝ නොපැමිණෙත් ද, නොඇලෙත් ද කියා සිතීම විය නොහැක්කකි.\"\n\nඇස හා කන ආදී ඉන්ද්‍රියයන්ට අරක් නොගත්, ඉන්ද්‍රියයන්හි නොසංවර වූ අය වෙත රාගය නිසා ඇතිවන සංකල්පනා නමැති මැස්සෝ පැමිණෙත්.\nකටු වියක් බවට පත් වී, ආමගන්ධයෙන් තෙත් වූ භික්ෂුව නිවනින් දුරස් වී, විනාශයටම භාග්‍යවන්තයෙක් වේ.\nතමන්ගේ සිතට සමථය නොලබා ගමෙහි හෝ අරණ්‍යයෙහි හැසිරෙන දුර්මති වූ බාල පුද්ගලයා මැස්සන් විසින් වට කරනු ලැබූවෙක් බඳු ය.\nයම් කෙනෙක් සීලයෙන් යුක්ත ද, ප්‍රඥාවෙන් සහ උපශමයෙන් යුක්තව ඇලී වාසය කරත් ද, ඔවුහු මැස්සන් (අකුසල විතර්ක) විනාශ කොට සන්සුන් වූවෝ සැප සේ වාසය කරත්.",
      "paliTitle": "Kaṭuviyasuttaṃ"
    },
    {
      "number": 130,
      "pali": "Atha kho āyasmā anuruddho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, dibbena cakkhunā visuddhena atikkantamānusakena yebhuyyena passāmi mātugāmaṃ kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjamānaṃ. Katihi nu kho, bhante, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti? ‘‘Tīhi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi tīhi? Idha, anuruddha, mātugāmo pubbaṇhasamayaṃ maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati, majjhanhikasamayaṃ issāpariyuṭṭhitena cetasā agāraṃ ajjhāvasati, sāyanhasamayaṃ kāmarāgapariyuṭṭhitena cetasā agāraṃ ajjhāvasati. Imehi kho, anuruddha, tīhi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Sattamaṃ.",
      "english": "Then the Venerable Anuruddha approached the Blessed One, and having approached, bowed down to the Blessed One and sat down to one side. As he was seated to one side, the Venerable Anuruddha said this to the Blessed One: \"Here, venerable sir, with my divine eye, purified and surpassing that of humans, I mostly observe women, after the dissolution of the body and subsequent to death, being reborn in states of deprivation, in woeful destinations, in ruinous realms, in hell. With how many qualities, venerable sir, are women endowed, such that after the dissolution of the body and subsequent to death, they are reborn in states of deprivation, in woeful destinations, in ruinous realms, in hell?\" \"Anuruddha, women endowed with three qualities are, after the dissolution of the body and subsequent to death, reborn in states of deprivation, in woeful destinations, in ruinous realms, in hell. Which three? Here, Anuruddha, a woman dwells at home in the morning with a mind afflicted by the defilement of stinginess; at midday with a mind afflicted by envy; and in the evening with a mind afflicted by sensual craving. Indeed, Anuruddha, women endowed with these three qualities are, after the dissolution of the body and subsequent to death, reborn in states of deprivation, in woeful destinations, in ruinous realms, in hell.\"",
      "sinhala": "ඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ නමස්කාර කොට, එකත්පසෙකින් වාඩි වූ සේක. එකත්පසෙකින් වාඩි වී සිටි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කී සේක: “වහන්ස, මෙහිලා මම මිනිසුන්ගේ ඇස ඉක්ම වූ, පිරිසිදු වූ දිව්‍ය චක්ෂුසින් (දිව්‍ය ඇසින්) බහුල වශයෙන් දකිමි, මාතෘ ග්‍රාමය (ස්ත්‍රීන්), කය බිඳීමෙන්, මරණයෙන් පසුව, අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදිනු. වහන්ස, කිනම් ධර්ම කීපයකින් සමන්විත වූ මාතෘ ග්‍රාමයෙක් (ස්ත්‍රියක්), කය බිඳීමෙන්, මරණයෙන් පසුව, අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදින්නේද?”\n\n“අනුරුද්ධ, ධර්ම තුනකින් සමන්විත වූ මාතෘ ග්‍රාමයෙක් (ස්ත්‍රියක්), කය බිඳීමෙන්, මරණයෙන් පසුව, අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදී. කිනම් තුනකින්ද? අනුරුද්ධ, මෙහිලා මාතෘ ග්‍රාමයෙක් (ස්ත්‍රියක්) පෙරවරු සමයෙහි මසුරු මලයෙන් මුළුමනින්ම වෙලී ගිය සිතකින් ගෘහයෙහි වාසය කරයි. දහවල් සමයෙහි ඊර්ෂ්‍යාවෙන් මුළුමනින්ම වෙලී ගිය සිතකින් ගෘහයෙහි වාසය කරයි. සවස් සමයෙහි කාමරාගයෙන් මුළුමනින්ම වෙලී ගිය සිතකින් ගෘහයෙහි වාසය කරයි. අනුරුද්ධ, මේ ධර්ම තුනෙන් සමන්විත වූ මාතෘ ග්‍රාමයෙක් (ස්ත්‍රියක්), කය බිඳීමෙන්, මරණයෙන් පසුව, අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදී.”",
      "paliTitle": "Paṭhamaanuruddhasuttaṃ"
    },
    {
      "number": 131,
      "pali": "Atha kho āyasmā anuruddho yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho āyasmantaṃ sāriputtaṃ etadavoca – ‘‘idhāhaṃ, āvuso sāriputta, dibbena cakkhunā visuddhena atikkantamānusakena sahassaṃ lokaṃ olokemi. Āraddhaṃ kho pana me vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā [apammuṭṭhā (sī.), apamuṭṭhā (syā. kaṃ.)], passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ. Atha ca pana me nānupādāya [na anupādāya (sī. syā. kaṃ. pī.)] āsavehi cittaṃ vimuccatī’’ti. ‘‘Yaṃ kho te, āvuso anuruddha, evaṃ hoti – ‘ahaṃ dibbena cakkhunā visuddhena atikkantamānusakena sahassaṃ lokaṃ volokemī’ti, idaṃ te mānasmiṃ. Yampi te, āvuso anuruddha, evaṃ hoti – ‘āraddhaṃ kho pana me vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekagga’nti, idaṃ te uddhaccasmiṃ. Yampi te, āvuso anuruddha, evaṃ hoti – ‘atha ca pana me nānupādāya āsavehi cittaṃ vimuccatī’ti, idaṃ te kukkuccasmiṃ. Sādhu vatāyasmā anuruddho ime tayo dhamme pahāya, ime tayo dhamme amanasikaritvā amatāya dhātuyā cittaṃ upasaṃharatū’’ti. Atha kho āyasmā anuruddho aparena samayena ime tayo dhamme pahāya, ime tayo dhamme amanasikaritvā amatāya dhātuyā cittaṃ upasaṃhari [upasaṃhāsi (syā. kaṃ. pī.), upasaṃharati (ka.)]. Atha kho āyasmā anuruddho eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā anuruddho arahataṃ ahosīti. Aṭṭhamaṃ.",
      "english": "Then Venerable Anuruddha approached Venerable Sāriputta. Having approached, he exchanged courteous greetings with Venerable Sāriputta. Having concluded the amicable and memorable talk, he sat down to one side. As he sat to one side, Venerable Anuruddha said this to Venerable Sāriputta: “Here, friend Sāriputta, with the divine eye, purified and surpassing that of humans, I survey a thousand world-systems. Indeed, my energy is aroused and unflagging; my mindfulness is established and unclouded; my body is tranquil and and undisturbed; my mind is concentrated and unified. Yet, my mind has not become liberated from the taints through non-clinging.”\n\n“Friend Anuruddha, that which makes you think, ‘I survey a thousand world-systems with the divine eye, purified and surpassing that of humans’ – this is conceit for you. And that which makes you think, ‘Indeed, my energy is aroused and unflagging; my mindfulness is established and unclouded; my body is tranquil and undisturbed; my mind is concentrated and unified’ – this is restlessness for you. And that which makes you think, ‘Yet, my mind has not become liberated from the taints through non-clinging’ – this is remorse for you. It would be good, Venerable Anuruddha, if, having abandoned these three qualities, and having paid no attention to these three qualities, you would direct your mind towards the Deathless Element.”\n\nThen, at a later time, Venerable Anuruddha, having abandoned these three qualities, and having paid no attention to these three qualities, directed his mind towards the Deathless Element. Then Venerable Anuruddha, dwelling alone in seclusion, diligent, ardent, and resolute, not long after – for the sake of which noble sons rightly go forth from home to homelessness, that unsurpassed culmination of the holy life – he realized it for himself with direct knowledge in this very life, and entering upon it, he dwelled therein. He understood: “Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.” And Venerable Anuruddha became one of the Arahants.",
      "sinhala": "එවිට ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ වෙතට ගියහ. එසේ ගොස් ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ සමඟ සුහද කතාබහකින් සතුටු වූහ. සුහද හා සිහි කටයුතු කතාබහක් පවත්වා, එකත්පසෙකින් වැඩ සිටියහ. එකත්පසෙකින් වැඩ සිටි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: \"ඇවැත් ශ්‍රීපුත්‍රයෙනි, මා විසින් දිවැසින්, පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය ඇසින් දහසක් ලෝකයන් නරඹනු ලැබේ. මාගේ වීර්යය නොසැලී පවතී, පිහිටුවාගත් සතිය නොමුළා වී පවතී, සිරුර සංසිඳී ඇත, චිත්තය සමාධිගතව, එකඟව පවතී. එසේ වුවද, මාගේ සිත උපන් ආශ්‍රවයන්ගෙන් නිරුපාදාන වශයෙන් විමුක්ත වන්නේ නැත.\"\n\n\"ඇවැත් අනුරුද්ධයෙනි, ඔබට යම් මේ සිතුවිල්ලක් වේද – 'මා විසින් දිවැසින්, පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය ඇසින් දහසක් ලෝකයන් නරඹනු ලැබේ' කියා, මෙය ඔබට මානයකි. ඇවැත් අනුරුද්ධයෙනි, ඔබට යම් මේ සිතුවිල්ලක් වේද – 'මාගේ වීර්යය නොසැලී පවතී, පිහිටුවාගත් සතිය නොමුළා වී පවතී, සිරුර සංසිඳී ඇත, චිත්තය සමාධිගතව, එකඟව පවතී' කියා, මෙය ඔබට උද්ධච්චයකි (සිතේ නොසන්සුන්කමකි). ඇවැත් අනුරුද්ධයෙනි, ඔබට යම් මේ සිතුවිල්ලක් වේද – 'එසේ වුවද, මාගේ සිත උපන් ආශ්‍රවයන්ගෙන් නිරුපාදාන වශයෙන් විමුක්ත වන්නේ නැත' කියා, මෙය ඔබට කුක්කුච්චයකි (අනුශෝචනාවකි). ආයුෂ්මත් අනුරුද්ධයෙනි, ඔබ මේ ධර්ම තුන දුරු කොට, මේ ධර්ම තුන මෙනෙහි නොකොට, අමා මහ නිවනට (අමත ධාතුවට) සිත යොමු කරන්නේ නම් එය යහපත් වේ.\"\n\nඑවිට ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ, ඉන්පසු එක් කලෙක මේ ධර්ම තුන දුරු කොට, මේ ධර්ම තුන මෙනෙහි නොකොට, අමා මහ නිවනට සිත යොමු කළහ. එවිට ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ තනිව, एकांतව, අප්‍රමාදීව, වීර්යවත්ව, අත්දමනයෙන් යුතුව වාසය කරද්දී, යම් උතුම් අරමුණක් උදෙසා කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරිකභාවයට පැමිණෙත්ද, එනම් අනුත්තර වූ බ්‍රහ්මචාරී ජීවිතයේ අවසානය වූ අරහත්ඵලය මේ ආත්මභාවයේදීම තමන් විසින්ම අභිඥා ඥානයෙන් සාක්ෂාත් කොට, එයට පැමිණ වාසය කළහ. \"ජාතිය ක්ෂය විය. බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී. කළ යුතු දේ කරන ලදී. නැවත මේ භවයට පැමිණීමක් නැතැ\"යි උන්වහන්සේ දැන ගත්හ. තවද, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ අරහතුන් වහන්සේ නමක් බවට පත් වූහ.",
      "paliTitle": "Dutiyaanuruddhasuttaṃ"
    },
    {
      "number": 132,
      "pali": "‘‘Tīṇimāni, bhikkhave, paṭicchannāni āvahanti [vahanti (sī. syā. kaṃ. pī.)], no vivaṭāni. Katamāni tīṇi? Mātugāmo, bhikkhave, paṭicchanno āvahati, no vivaṭo; brāhmaṇānaṃ, bhikkhave, mantā paṭicchannā āvahanti, no vivaṭā; micchādiṭṭhi, bhikkhave, paṭicchannā āvahati, no vivaṭā. Imāni kho, bhikkhave, tīṇi paṭicchannāni āvahanti, no vivaṭāni. ‘‘Tīṇimāni, bhikkhave, vivaṭāni virocanti, no paṭicchannāni. Katamāni tīṇi? Candamaṇḍalaṃ, bhikkhave, vivaṭaṃ virocati, no paṭicchannaṃ; sūriyamaṇḍalaṃ, bhikkhave, vivaṭaṃ virocati, no paṭicchannaṃ; tathāgatappavedito dhammavinayo, bhikkhave, vivaṭo virocati, no paṭicchanno. Imāni kho, bhikkhave, tīṇi vivaṭāni virocanti, no paṭicchannānī’’ti. Navamaṃ.",
      "english": "Monks, these three things operate effectively when concealed, not when revealed. Which three? Monks, a woman operates effectively when concealed, not when revealed. Monks, the incantations of brahmins operate effectively when concealed, not when revealed. Monks, wrong view operates effectively when concealed, not when revealed. Indeed, monks, these three things operate effectively when concealed, not when revealed.\n\nMonks, these three things shine forth when revealed, not when concealed. Which three? Monks, the disk of the moon shines forth when revealed, not when concealed. Monks, the disk of the sun shines forth when revealed, not when concealed. Monks, the Dhamma and Discipline proclaimed by the Tathāgata shines forth when revealed, not when concealed. Indeed, monks, these three things shine forth when revealed, not when concealed.",
      "sinhala": "භික්ෂූණි, මේ දේ තුනක් සැඟවී බලපාන්නේය, ප්‍රක‍ටව නොවේ. ඒ කවර තුනක්ද? භික්ෂූණි, කාන්තාව සැඟවී බලපාන්නේය, ප්‍රක‍ටව නොවේ. භික්ෂූණි, බ්‍රාහ්මණයන්ගේ මන්ත්‍ර සැඟවී බලපාන්නේය, ප්‍රක‍ටව නොවේ. භික්ෂූණි, මිථ්‍යාදෘෂ්ටිය සැඟවී බලපාන්නේය, ප්‍රක‍ටව නොවේ. භික්ෂූණි, මේ තුන සැඟවී බලපාන්නේය, ප්‍රක‍ටව නොවේ.\n\nභික්ෂූණි, මේ දේ තුනක් විවෘත වූ විට බබලයි, සැඟවී නොවේ. ඒ කවර තුනක්ද? භික්ෂූණි, සඳමඬල විවෘත වූ විට බබලයි, සැඟවී නොවේ. භික්ෂූණි, හිරුමඬල විවෘත වූ විට බබලයි, සැඟවී නොවේ. භික්ෂූණි, තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම​විනය විවෘත වූ විට බබලයි, සැඟවී නොවේ. භික්ෂූණි, මේ තුන විවෘත වූ විට බබලයි, සැඟවී නොවේ.",
      "paliTitle": "Paṭicchannasuttaṃ"
    },
    {
      "number": 133,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Pāsāṇalekhūpamo puggalo, pathavilekhūpamo puggalo, udakalekhūpamo puggalo. Katamo ca, bhikkhave, pāsāṇalekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho dīgharattaṃ anuseti. Seyyathāpi, bhikkhave, pāsāṇe lekhā na khippaṃ lujjati vātena vā udakena vā, ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho dīgharattaṃ anuseti. Ayaṃ vuccati, bhikkhave, pāsāṇalekhūpamo puggalo. ‘‘Katamo ca, bhikkhave, pathavilekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho na dīgharattaṃ anuseti. Seyyathāpi, bhikkhave, pathaviyā lekhā khippaṃ lujjati vātena vā udakena vā, na ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho na dīgharattaṃ anuseti. Ayaṃ vuccati, bhikkhave, pathavilekhūpamo puggalo. ‘‘Katamo ca, bhikkhave, udakalekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo āgāḷhenapi vuccamāno pharusenapi vuccamāno amanāpenapi vuccamāno sandhiyatimeva [… yeva (syā. kaṃ.) … ceva (pī.)] saṃsandatimeva [… yeva (syā. kaṃ.) … ceva (pī.)] sammodatimeva [… yeva (syā. kaṃ.) … ceva (pī.)]. Seyyathāpi, bhikkhave, udake lekhā khippaṃyeva paṭivigacchati, na ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo āgāḷhenapi vuccamāno pharusenapi vuccamāno amanāpenapi vuccamāno sandhiyatimeva saṃsandatimeva sammodatimeva. Ayaṃ vuccati, bhikkhave, udakalekhūpamo puggalo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti [pu. pa. 115]. Dasamaṃ.",
      "english": "Monks, these three types of individuals exist and are found in the world. Which three? The individual like a writing on rock, the individual like a writing on earth, and the individual like a writing on water. And what kind of individual, monks, is like a writing on rock? Here, monks, a certain individual often gets angry, and that anger of theirs lingers for a long time. Just as, monks, a writing on rock is not quickly erased by wind or by water, but endures for a long time; just so, monks, a certain individual here often gets angry, and that anger of theirs lingers for a long time. This, monks, is called the individual like a writing on rock.\n\nAnd what kind of individual, monks, is like a writing on earth? Here, monks, a certain individual often gets angry, but that anger of theirs does not linger for a long time. Just as, monks, a writing on earth is quickly erased by wind or by water, and does not endure for a long time; just so, monks, a certain individual here often gets angry, but that anger of theirs does not linger for a long time. This, monks, is called the individual like a writing on earth.\n\nAnd what kind of individual, monks, is like a writing on water? Here, monks, a certain individual, even when spoken to harshly, even when spoken to roughly, even when spoken to unpleasantly, immediately becomes reconciled, immediately harmonizes, immediately rejoices. Just as, monks, a writing on water immediately vanishes and does not endure for a long time; just so, monks, a certain individual here, even when spoken to harshly, even when spoken to roughly, even when spoken to unpleasantly, immediately becomes reconciled, immediately harmonizes, immediately rejoices. This, monks, is called the individual like a writing on water. These, monks, are the three types of individuals existing and found in the world.",
      "sinhala": "‘‘භික්‍ෂූනි, ලෝකයෙහි මේ පුද්ගලයන් තිදෙනෙක් සිටිති, පවතී. ඒ තිදෙනා කවුරුන්ද? ශිලා ලේඛා උපමාව ඇති පුද්ගලයා, පෘථිවී ලේඛා උපමාව ඇති පුද්ගලයා, උදක ලේඛා උපමාව ඇති පුද්ගලයා යනුයි. භික්‍ෂූනි, ශිලා ලේඛා උපමාව ඇති පුද්ගලයා කවරෙක්ද? භික්‍ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් නිතරම කෝප වෙයි. ඔහුගේ ඒ කෝපය බොහෝ කල් පවතී. භික්‍ෂූනි, යම්සේ ගලක සටහනක් සුළඟින් හෝ ජලයෙන් හෝ ඉක්මනින් මැකී නොයයිද, බොහෝ කල් පවතින්නක් වේද, භික්‍ෂූනි, එසේම මෙහි ඇතැම් පුද්ගලයෙක් නිතරම කෝප වෙයි. ඔහුගේ ඒ කෝපය බොහෝ කල් පවතී. භික්‍ෂූනි, මොහු ශිලා ලේඛා උපමාව ඇති පුද්ගලයා යැයි කියනු ලැබේ.\n\n‘‘භික්‍ෂූනි, පෘථිවී ලේඛා උපමාව ඇති පුද්ගලයා කවරෙක්ද? භික්‍ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් නිතරම කෝප වෙයි. ඔහුගේ ඒ කෝපය බොහෝ කල් නොපවතී. භික්‍ෂූනි, යම්සේ පොළොවේ ඇඳි සටහනක් සුළඟින් හෝ ජලයෙන් හෝ ඉක්මනින් මැකී යයිද, බොහෝ කල් නොපවතින්නක් වේද, භික්‍ෂූනි, එසේම මෙහි ඇතැම් පුද්ගලයෙක් නිතරම කෝප වෙයි. ඔහුගේ ඒ කෝපය බොහෝ කල් නොපවතී. භික්‍ෂූනි, මොහු පෘථිවී ලේඛා උපමාව ඇති පුද්ගලයා යැයි කියනු ලැබේ.\n\n‘‘භික්‍ෂූනි, උදක ලේඛා උපමාව ඇති පුද්ගලයා කවරෙක්ද? භික්‍ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් දැඩි වචනයෙන් කියනු ලැබුවත්, රළු වචනයෙන් කියනු ලැබුවත්, අ+ප්+‍ර+ිය (අප්‍රිය) වචනයෙන් කියනු ලැබුවත්, සමගි වෙයි, එකඟ වෙයි, සතුටු වෙයි. භික්‍ෂූනි, යම්සේ ජලයෙහි ඇඳි සටහනක් ඉතා ඉක්මනින්ම මැකී යයිද, බොහෝ කල් නොපවතින්නක් වේද, භික්‍ෂූනි, එසේම මෙහි ඇතැම් පුද්ගලයෙක් දැඩි වචනයෙන් කියනු ලැබුවත්, රළු වචනයෙන් කියනු ලැබුවත්, අ+ප්+‍ර+ිය (අප්‍රිය) වචනයෙන් කියනු ලැබුවත්, සමගි වෙයි, එකඟ වෙයි, සතුටු වෙයි. භික්‍ෂූනි, මොහු උදක ලේඛා උපමාව ඇති පුද්ගලයා යැයි කියනු ලැබේ. භික්‍ෂූනි, ලෝකයෙහි සිටින, පවතින මේ පුද්ගලයන් තිදෙනා මොවුන්ම යැයි (දැක්වෙනු ලැබේ).",
      "paliTitle": "Lekhasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Kusināravaggo terasamo. Tassuddānaṃ – Kusinārabhaṇḍanā ceva, gotamabharaṇḍuhatthako; Kaṭuviyaṃ dve anuruddhā, paṭicchannaṃ lekhena te dasāti.",
    "english": "",
    "sinhala": ""
  }
}