{
  "id": "an3.1",
  "title": {
    "pali": "Paṭhamapaṇṇāsakaṃ - Bālavaggo",
    "english": "The First Fifty - The Chapter on Fools",
    "sinhala": "ප්‍රථම පණ්ණාසකය - බාලවග්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante [bhaddante (ka.)]’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Yāni kānici, bhikkhave, bhayāni uppajjanti sabbāni tāni bālato uppajjanti, no paṇḍitato. Ye keci upaddavā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato. Ye keci upasaggā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato. Seyyathāpi, bhikkhave, naḷāgārā vā tiṇāgārā vā [naḷāgāraṃ vā tiṇāgāraṃ vā (sī.)] aggi mutto [aggimukko (sī.), aggi mukko (syā. kaṃ. pī.)] kūṭāgārānipi ḍahati ullittāvalittāni nivātāni phusitaggaḷāni pihitavātapānāni; evamevaṃ kho, bhikkhave, yāni kānici bhayāni uppajjanti sabbāni tāni bālato uppajjanti, no paṇḍitato. Ye keci upaddavā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato. Ye keci upasaggā uppajjanti sabbe te bālato uppajjanti, no paṇḍitato. ‘‘Iti kho, bhikkhave, sappaṭibhayo bālo, appaṭibhayo paṇḍito. Saupaddavo bālo, anupaddavo paṇḍito. Saupasaggo bālo, anupasaggo paṇḍito. Natthi, bhikkhave, paṇḍitato bhayaṃ, natthi paṇḍitato upaddavo, natthi paṇḍitato upasaggo. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘yehi tīhi dhammehi samannāgato bālo veditabbo te tayo dhamme abhinivajjetvā, yehi tīhi dhammehi samannāgato paṇḍito veditabbo te tayo dhamme samādāya vattissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "Thus have I heard – on one occasion the Blessed One was dwelling in Sāvatthī, at Jetavana, in Anāthapiṇḍika’s park. There the Blessed One addressed the monks, saying, \"Monks.\" \"Venerable Sir,\" replied those monks to the Blessed One. The Blessed One spoke thus: \"Whatever fears arise, monks, all of them arise from the foolish, not from the wise. Whatever troubles arise, all of them arise from the foolish, not from the wise. Whatever afflictions arise, all of them arise from the foolish, not from the wise. Just as, monks, a fire started in a reed hut or a grass hut can burn down even multi-storied mansions that are well-plastered and rendered, wind-sheltered, with firmly bolted doors and closed windows; even so, monks, whatever fears arise, all of them arise from the foolish, not from the wise. Whatever troubles arise, all of them arise from the foolish, not from the wise. Whatever afflictions arise, all of them arise from the foolish, not from the wise.\"\n\n\"Thus, monks, the foolish person is fraught with danger, the wise person is free from danger. The foolish person is beset by troubles, the wise person is free from troubles. The foolish person is subject to afflictions, the wise person is free from afflictions. There is no fear, monks, from the wise; there are no troubles from the wise; there are no afflictions from the wise. Therefore, monks, you should train yourselves thus: 'Having entirely abandoned those three qualities by which a foolish person is known, we will live practicing those three qualities by which a wise person is known.' Indeed, monks, you should train yourselves in this way.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනය නම් වූ අනාථපිණ්ඩික සිටුහුගේ ආරාමයෙහි වාසය කරන සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, යම්කිසි භයෝ උපදිත් ද, ඒ සියල්ලෝ බාලයා නිසා උපදිත්. පණ්ඩිතයා නිසා උපදින්නේ නැත. යම්කිසි උපද්‍රවයෝ උපදිත් ද, ඒ සියල්ලෝ බාලයා නිසා උපදිත්. පණ්ඩිතයා නිසා උපදින්නේ නැත. යම්කිසි උපසර්ගයෝ උපදිත් ද, ඒ සියල්ලෝ බාලයා නිසා උපදිත්. පණ්ඩිතයා නිසා උපදින්නේ නැත.\n\nමහණෙනි, යම්සේ නළගෙයක හෝ තණගෙයක හෝ ගින්නක් පැතිර ගොස්, හොඳින් පස් ආදියෙන් තවරා, සුළං ඇතුළු නොවන සේ ගොඩනගන ලද, දොරගුළු දමා ඇති, කවුළු හොඳින් වසා ඇති මාළිගා පවා දවා හළු කරයි ද; එසෙයින්ම මහණෙනි, යම්කිසි භයෝ උපදිත් ද, ඒ සියල්ලෝ බාලයා නිසා උපදිත්. පණ්ඩිතයා නිසා උපදින්නේ නැත. යම්කිසි උපද්‍රවයෝ උපදිත් ද, ඒ සියල්ලෝ බාලයා නිසා උපදිත්. පණ්ඩිතයා නිසා උපදින්නේ නැත. යම්කිසි උපසර්ගයෝ උපදිත් ද, ඒ සියල්ලෝ බාලයා නිසා උපදිත්. පණ්ඩිතයා නිසා උපදින්නේ නැත.\n\nමහණෙනි, එහෙයින් බාලයා භය සහිතය, පණ්ඩිතයා භය රහිතය. බාලයා උපද්‍රව සහිතය, පණ්ඩිතයා උපද්‍රව රහිතය. බාලයා උපසර්ග සහිතය, පණ්ඩිතයා උපසර්ග රහිතය. මහණෙනි, පණ්ඩිතයා නිසා භයක් නැත. පණ්ඩිතයා නිසා උපද්‍රවයක් නැත. පණ්ඩිතයා නිසා උපසර්ගයක් නැත.\n\nමහණෙනි, එහෙයින් මෙසේ හික්මිය යුතුය – ‘යම් තුන් ධර්මයකින් යුක්ත වූ පුද්ගලයා බාලයා ලෙස දත යුතු වේ ද, ඒ ධර්ම තුන දුරු කොට, යම් තුන් ධර්මයකින් යුක්ත වූ පුද්ගලයා පණ්ඩිතයා ලෙස දත යුතු වේ ද, ඒ ධර්ම තුන සමාදන් වී හැසිරෙමු’ යි. මහණෙනි, නුඹලා මෙසේම හික්මිය යුතු යි.\"",
      "paliTitle": "Bhayasuttaṃ",
      "englishTitle": "The Fear Sutta",
      "sinhalaTitle": "භය සූත්‍රය"
    },
    {
      "number": 2,
      "pali": "‘‘Kammalakkhaṇo, bhikkhave, bālo, kammalakkhaṇo paṇḍito, apadānasobhanī [apadāne sobhati (syā. kaṃ. pī.)] paññāti [paññatti (?)]. Tīhi, bhikkhave, dhammehi samannāgato bālo veditabbo. Katamehi tīhi? Kāyaduccaritena, vacīduccaritena, manoduccaritena. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bālo veditabbo. ‘‘Tīhi, bhikkhave, dhammehi samannāgato paṇḍito veditabbo. Katamehi tīhi? Kāyasucaritena, vacīsucaritena, manosucaritena. Imehi kho, bhikkhave, tīhi dhammehi samannāgato paṇḍito veditabbo. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘yehi tīhi dhammehi samannāgato bālo veditabbo te tayo dhamme abhinivajjetvā, yehi tīhi dhammehi samannāgato paṇḍito veditabbo te tayo dhamme samādāya vattissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Monks, the fool is discerned by their volitional actions, the wise person is discerned by their volitional actions; wisdom is made evident by one's conduct.\n\nMonks, the fool is to be known as one endowed with three qualities. Which three? Misconduct of body, misconduct of speech, and misconduct of mind. Indeed, monks, the fool is to be known as one endowed with these three qualities.\n\nMonks, the wise person is to be known as one endowed with three qualities. Which three? Good conduct of body, good conduct of speech, and good conduct of mind. Indeed, monks, the wise person is to be known as one endowed with these three qualities.\n\nTherefore, monks, you should train yourselves thus: 'Having completely abandoned those three qualities with which the fool is known to be endowed, we shall undertake and practice those three qualities with which the wise person is known to be endowed.' Indeed, monks, thus should you train yourselves.",
      "sinhala": "භික්ෂූන් වහන්ස, බාල පුද්ගලයා කර්මයෙන් හඳුනාගත හැකිය. පණ්ඩිත පුද්ගලයාද කර්මයෙන් හඳුනාගත හැකිය. ප්‍රඥාව ක්‍රියාවන්ගෙන් බබළන්නීය. භික්ෂූන් වහන්ස, ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා බාලයෙකු ලෙස හඳුනාගත යුතුය. කවර ධර්ම තුනකින්ද? කයින් කරන දුශ්චරිතයෙන්, වචනයෙන් කරන දුශ්චරිතයෙන්, සිතින් කරන දුශ්චරිතයෙන්. භික්ෂූන් වහන්ස, මේ ධර්ම තුනෙන් යුක්ත වූ පුද්ගලයා බාල පුද්ගලයා ලෙස සැලකිය යුතුය.\n\nභික්ෂූන් වහන්ස, ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා පණ්ඩිතයෙකු ලෙස හඳුනාගත යුතුය. කවර ධර්ම තුනකින්ද? කයින් කරන සුචරිතයෙන්, වචනයෙන් කරන සුචරිතයෙන්, සිතින් කරන සුචරිතයෙන්. භික්ෂූන් වහන්ස, මේ ධර්ම තුනෙන් යුක්ත වූ පුද්ගලයා පණ්ඩිත පුද්ගලයා ලෙස සැලකිය යුතුය.\n\nඑබැවින් භික්ෂූන් වහන්ස, මෙසේ පුහුණු විය යුතුය: ‘යම් ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා බාල පුද්ගලයා ලෙස සැලකේද, ඒ ධර්ම තුන සම්පූර්ණයෙන්ම අත්හැර දමා, යම් ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා පණ්ඩිත පුද්ගලයා ලෙස සැලකේද, ඒ ධර්ම තුන සමාදන් වී හැසිරෙමු’ යනුයි. භික්ෂූන් වහන්ස, ඔබට මෙසේම පුහුණු විය යුතුයි.",
      "paliTitle": "Lakkhaṇasuttaṃ",
      "englishTitle": "The Characteristic Sutta",
      "sinhalaTitle": "ලක්ඛණ සූත්‍රය"
    },
    {
      "number": 3,
      "pali": "‘‘Tīṇimāni, bhikkhave, bālassa bālalakkhaṇāni bālanimittāni bālāpadānāni. Katamāni tīṇi? Idha, bhikkhave, bālo duccintitacintī ca hoti dubbhāsitabhāsī ca dukkaṭakammakārī ca. No cedaṃ [no cetaṃ (syā. kaṃ. ka.)], bhikkhave, bālo duccintitacintī ca abhavissa dubbhāsitabhāsī ca dukkaṭakammakārī ca, kena naṃ paṇḍitā jāneyyuṃ [tena naṃ paṇḍitā na jāneyyuṃ (ka.), na naṃ paṇḍitā jāneyyuṃ (?)] – ‘bālo ayaṃ bhavaṃ asappuriso’ti? Yasmā ca kho, bhikkhave, bālo duccintitacintī ca hoti dubbhāsitabhāsī ca dukkaṭakammakārī ca tasmā naṃ paṇḍitā jānanti – ‘bālo ayaṃ bhavaṃ asappuriso’ti. Imāni kho, bhikkhave, tīṇi bālassa bālalakkhaṇāni bālanimittāni bālāpadānāni. ‘‘Tīṇimāni, bhikkhave, paṇḍitassa paṇḍitalakkhaṇāni paṇḍitanimittāni paṇḍitāpadānāni. Katamāni tīṇi? Idha, bhikkhave, paṇḍito sucintitacintī ca hoti subhāsitabhāsī ca sukatakammakārī ca. No cedaṃ, bhikkhave, paṇḍito sucintitacintī ca abhavissa subhāsitabhāsī ca sukatakammakārī ca, kena naṃ paṇḍitā jāneyyuṃ – ‘paṇḍito ayaṃ bhavaṃ sappuriso’ti? Yasmā ca kho, bhikkhave, paṇḍito sucintitacintī ca hoti subhāsitabhāsī ca sukatakammakārī ca tasmā naṃ paṇḍitā jānanti – ‘paṇḍito ayaṃ bhavaṃ sappuriso’ti. Imāni kho, bhikkhave, tīṇi paṇḍitassa paṇḍitalakkhaṇāni paṇḍitanimittāni paṇḍitāpadānāni. Tasmātiha…. Tatiyaṃ.",
      "english": "There are these three, bhikkhus, marks of a fool, signs of a fool, and characteristics of a fool. Which three? Here, bhikkhus, the fool is one whose thoughts are ill-conceived, whose speech is ill-spoken, and whose actions are ill-done. Bhikkhus, if the fool were not one whose thoughts are ill-conceived, whose speech is ill-spoken, and whose actions are ill-done, how would the wise recognize him as, ‘This venerable one is a fool, an ignoble person’? But since, bhikkhus, the fool is one whose thoughts are ill-conceived, whose speech is ill-spoken, and whose actions are ill-done, the wise recognize him as, ‘This venerable one is a fool, an ignoble person’. These, bhikkhus, are the three marks of a fool, signs of a fool, and characteristics of a fool.\n\nThere are these three, bhikkhus, marks of a wise person, signs of a wise person, and characteristics of a wise person. Which three? Here, bhikkhus, the wise person is one whose thoughts are well-conceived, whose speech is well-spoken, and whose actions are well-done. Bhikkhus, if the wise person were not one whose thoughts are well-conceived, whose speech is well-spoken, and whose actions are well-done, how would the wise recognize him as, ‘This venerable one is a wise person, a noble person’? But since, bhikkhus, the wise person is one whose thoughts are well-conceived, whose speech is well-spoken, and whose actions are well-done, the wise recognize him as, ‘This venerable one is a wise person, a noble person’. These, bhikkhus, are the three marks of a wise person, signs of a wise person, and characteristics of a wise person. Therefore, in this case. The third.",
      "sinhala": "මහණෙනි, බාලයාගේ බාල ලක්‍ෂ\\u200dණ, බාල නිමිති, බාල ක්‍\\u200dරියා මේවා තුනකි. ඒ තුන කවරේද? මහණෙනි, මෙහිලා බාලයා නපුරු දේ සිතන්නෙක් ද වෙයි, නපුරු දේ කතා කරන්නෙක් ද වෙයි, නපුරු දේ කරන්නෙක් ද වෙයි. මහණෙනි, යම් හෙයකින් බාලයා නපුරු දේ සිතන්නෙක් ද, නපුරු දේ කතා කරන්නෙක් ද, නපුරු දේ කරන්නෙක් ද නොවන්නේ නම්, ‘මේ භවත් අප්පුරිසයා බාලයෙකි’ කියා ප්‍ර\\u200dඥාවන්තයෝ ඔහුව කෙසේ නම් දැනගන්නු ඇද්ද? මහණෙනි, යම් හෙයකින් බාලයා නපුරු දේ සිතන්නෙක් ද, නපුරු දේ කතා කරන්නෙක් ද, නපුරු දේ කරන්නෙක් ද වෙයි ද, එහෙයින් ප්‍ර\\u200dඥාවන්තයෝ ‘මේ භවත් අප්පුරිසයා බාලයෙකි’ කියා ඔහුව දනිති. මහණෙනි, බාලයාගේ බාල ලක්‍ෂ\\u200dණ, බාල නිමිති, බාල ක්‍\\u200dරියා මේවා තුනකි.\n\nමහණෙනි, පණ්ඩිතයාගේ පණ්ඩිත ලක්‍ෂ\\u200dණ, පණ්ඩිත නිමිති, පණ්ඩිත ක්‍\\u200dරියා මේවා තුනකි. ඒ තුන කවරේද? මහණෙනි, මෙහිලා පණ්ඩිතයා යහපත් දේ සිතන්නෙක් ද වෙයි, යහපත් දේ කතා කරන්නෙක් ද වෙයි, යහපත් දේ කරන්නෙක් ද වෙයි. මහණෙනි, යම් හෙයකින් පණ්ඩිතයා යහපත් දේ සිතන්නෙක් ද, යහපත් දේ කතා කරන්නෙක් ද, යහපත් දේ කරන්නෙක් ද නොවන්නේ නම්, ‘මේ භවත් සත්පුරුෂයා පණ්ඩිතයෙකි’ කියා ප්‍ර\\u200dඥාවන්තයෝ ඔහුව කෙසේ නම් දැනගන්නු ඇද්ද? මහණෙනි, යම් හෙයකින් පණ්ඩිතයා යහපත් දේ සිතන්නෙක් ද, යහපත් දේ කතා කරන්නෙක් ද, යහපත් දේ කරන්නෙක් ද වෙයි ද, එහෙයින් ප්‍ර\\u200dඥාවන්තයෝ ‘මේ භවත් සත්පුරුෂයා පණ්ඩිතයෙකි’ කියා ඔහුව දනිති. මහණෙනි, පණ්ඩිතයාගේ පණ්ඩිත ලක්‍ෂ\\u200dණ, පණ්ඩිත නිමිති, පණ්ඩිත ක්‍\\u200dරියා මේවා තුනකි. එහෙයින්ම මේ කරුණු හොඳින් තේරුම් ගත යුතුයි. තෙවැනි සූත්‍රයයි.",
      "paliTitle": "Cintīsuttaṃ",
      "englishTitle": "The Thinker Sutta",
      "sinhalaTitle": "චින්තී සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bālo veditabbo. Katamehi tīhi? Accayaṃ accayato na passati, accayaṃ accayato disvā yathādhammaṃ nappaṭikaroti, parassa kho pana accayaṃ desentassa yathādhammaṃ nappaṭiggaṇhāti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bālo veditabbo. ‘‘Tīhi, bhikkhave, dhammehi samannāgato paṇḍito veditabbo. Katamehi tīhi? Accayaṃ accayato passati, accayaṃ accayato disvā yathādhammaṃ paṭikaroti, parassa kho pana accayaṃ desentassa yathādhammaṃ paṭiggaṇhāti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato paṇḍito veditabbo. Tasmātiha…. Catutthaṃ.",
      "english": "“Monks, an ignorant person is to be recognized by three qualities. Which three? He does not see a transgression as a transgression; having seen a transgression as a transgression, he does not rectify it in accordance with the Dhamma; and when another points out his transgression, he does not accept it in accordance with the Dhamma. Indeed, monks, an ignorant person is to be recognized by these three qualities.\n\n“Monks, a wise person is to be recognized by three qualities. Which three? He sees a transgression as a transgression; having seen a transgression as a transgression, he rectifies it in accordance with the Dhamma; and when another points out his transgression, he accepts it in accordance with the Dhamma. Indeed, monks, a wise person is to be recognized by these three qualities. Therefore.”",
      "sinhala": "මහණෙනි, ධර්‍ම කරුණු තුනකින් යුක්ත වූ තැනැත්තා බාලයෙකු ලෙස දත යුතු ය. ඒ තුන කවරේද යත්: තමන් කළ වරද වරදක් ලෙස නොදකියි. වරද වරදක් ලෙස දැක ද, ධර්‍මානුකූලව පිළියම් නොකරයි. අන් අයෙකු ධර්‍මානුකූලව වරදක් පෙන්වා දෙන විට, එය පිළි නොගනියි. මහණෙනි, ධර්‍ම කරුණු මේ තුනෙන් යුක්ත වූ තැනැත්තා බාලයෙකු ලෙස දත යුතු ය.\n\nමහණෙනි, ධර්‍ම කරුණු තුනකින් යුක්ත වූ තැනැත්තා පණ්‌ඩිතයෙකු ලෙස දත යුතු ය. ඒ තුන කවරේද යත්: තමන් කළ වරද වරදක් ලෙස දකියි. වරද වරදක් ලෙස දැක, ධර්‍මානුකූලව පිළියම් කරයි. අන් අයෙකු ධර්‍මානුකූලව වරදක් පෙන්වා දෙන විට, එය පිළිගනියි. මහණෙනි, ධර්‍ම කරුණු මේ තුනෙන් යුක්ත වූ තැනැත්තා පණ්‌ඩිතයෙකු ලෙස දත යුතු ය.",
      "paliTitle": "Accayasuttaṃ",
      "englishTitle": "The Discourse on Transgression",
      "sinhalaTitle": "අච්චය සූත්‍රය"
    },
    {
      "number": 5,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bālo veditabbo. Katamehi tīhi? Ayoniso pañhaṃ kattā hoti, ayoniso pañhaṃ vissajjetā hoti, parassa kho pana yoniso pañhaṃ vissajjitaṃ parimaṇḍalehi padabyañjanehi siliṭṭhehi upagatehi nābbhanumoditā hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bālo veditabbo. ‘‘Tīhi, bhikkhave, dhammehi samannāgato paṇḍito veditabbo. Katamehi tīhi? Yoniso pañhaṃ kattā hoti, yoniso pañhaṃ vissajjetā hoti, parassa kho pana yoniso pañhaṃ vissajjitaṃ parimaṇḍalehi padabyañjanehi siliṭṭhehi upagatehi abbhanumoditā hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato paṇḍito veditabbo. Tasmātiha…. Pañcamaṃ.",
      "english": "Monks, a fool is to be recognized by being endowed with three qualities. Which three? He is one who asks a question unwisely, he is one who answers a question unwisely, and he is not one who appreciates another's skillfully answered question, even if it is complete in its words and phrases and well-reasoned. Indeed, monks, a fool is to be recognized by being endowed with these three qualities.\n\nMonks, a wise person is to be recognized by being endowed with three qualities. Which three? He is one who asks a question wisely, he is one who answers a question wisely, and he is one who appreciates another's skillfully answered question, even if it is complete in its words and phrases and well-reasoned. Indeed, monks, a wise person is to be recognized by being endowed with these three qualities.",
      "sinhala": "භික්ෂූනි, ත්‍රිවිධ ධර්මයන්ගෙන් සමන්වාගත පුද්ගලයා අඥයෙකු යැයි දත යුතුයි. ඒ ත්‍රිවිධ ධර්මයෝ කවරහුද?\n\nඔහු අවිචාරවත් ලෙස ප්‍රශ්න නගන්නේ වෙයි. ඔහු අවිචාරවත් ලෙස ප්‍රශ්න විසඳන්නේ වෙයි. අනුන් විසින් විචාරවත් ලෙස විසඳන ලද, පරිපූර්ණ වූ, පද හා ව්‍යංජන සහිත වූ, මනාව සුසංයෝගී වූ පිළිතුරුවලට ඔහු අනුමෝදන් නොවේ. භික්ෂූනි, මේ ත්‍රිවිධ ධර්මයන්ගෙන් සමන්වාගත පුද්ගලයා අඥයෙකු යැයි දත යුතුයි.\n\nභික්ෂූනි, ත්‍රිවිධ ධර්මයන්ගෙන් සමන්වාගත පුද්ගලයා පණ්ඩිතයෙකු යැයි දත යුතුයි. ඒ ත්‍රිවිධ ධර්මයෝ කවරහුද?\n\nඔහු විචාරවත් ලෙස ප්‍රශ්න නගන්නේ වෙයි. ඔහු විචාරවත් ලෙස ප්‍රශ්න විසඳන්නේ වෙයි. අනුන් විසින් විචාරවත් ලෙස විසඳන ලද, පරිපූර්ණ වූ, පද හා ව්‍යංජන සහිත වූ, මනාව සුසංයෝගී වූ පිළිතුරුවලට ඔහු අනුමෝදන් වෙයි. භික්ෂූනි, මේ ත්‍රිවිධ ධර්මයන්ගෙන් සමන්වාගත පුද්ගලයා පණ්ඩිතයෙකු යැයි දත යුතුයි.\n\nඑබැවින්... පස්වැනි සූත්‍රයයි.",
      "paliTitle": "Ayonisosuttaṃ",
      "englishTitle": "Unwise Attention Sutta",
      "sinhalaTitle": "අයෝනිසෝ සූත්‍රය"
    },
    {
      "number": 6,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bālo veditabbo. Katamehi tīhi? Akusalena kāyakammena, akusalena vacīkammena, akusalena manokammena. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bālo veditabbo. ‘‘Tīhi, bhikkhave, dhammehi samannāgato paṇḍito veditabbo. Katamehi tīhi? Kusalena kāyakammena, kusalena vacīkammena, kusalena manokammena. Imehi kho, bhikkhave, tīhi dhammehi samannāgato paṇḍito veditabbo. Tasmātiha…. Chaṭṭhaṃ.",
      "english": "Monks, a foolish person is to be understood as one endowed with three qualities. Which three? With unwholesome bodily action, unwholesome verbal action, and unwholesome mental action. Indeed, monks, a foolish person is to be understood as one endowed with these three qualities.\n\nMonks, a wise person is to be understood as one endowed with three qualities. Which three? With wholesome bodily action, wholesome verbal action, and wholesome mental action. Indeed, monks, a wise person is to be understood as one endowed with these three qualities.",
      "sinhala": "මහණෙනි, බාල පුද්ගලයා ධර්මයන් තුනකින් යුක්ත වූවකු ලෙස දැනගත යුත්තේය. කවර තුනකින්ද? අකුසල කාය කර්මයෙන්, අකුසල වචී කර්මයෙන්, අකුසල මනෝ කර්මයෙන් යුක්ත වීමෙනි. මහණෙනි, සැබවින්ම, මේ ධර්මයන් තුනකින් යුක්ත වූ බාල පුද්ගලයා දැනගත යුත්තේය.\n\nමහණෙනි, පණ්ඩිත පුද්ගලයා ධර්මයන් තුනකින් යුක්ත වූවකු ලෙස දැනගත යුත්තේය. කවර තුනකින්ද? කුසල කාය කර්මයෙන්, කුසල වචී කර්මයෙන්, කුසල මනෝ කර්මයෙන් යුක්ත වීමෙනි. මහණෙනි, සැබවින්ම, මේ ධර්මයන් තුනකින් යුක්ත වූ පණ්ඩිත පුද්ගලයා දැනගත යුත්තේය. එහෙයින්...",
      "paliTitle": "Akusalasuttaṃ",
      "englishTitle": "The Discourse on the Unwholesome",
      "sinhalaTitle": "අකුසල සූත්‍රය"
    },
    {
      "number": 7,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bālo veditabbo. Katamehi tīhi? Sāvajjena kāyakammena, sāvajjena vacīkammena, sāvajjena manokammena…pe… anavajjena kāyakammena, anavajjena vacīkammena, anavajjena manokammena…pe…. Sattamaṃ.",
      "english": "Monks, a fool is to be understood as being endowed with three qualities. Which three? Blameworthy bodily action, blameworthy verbal action, and blameworthy mental action.\n\nSimilarly, Monks, a wise person is to be understood as being endowed with three qualities. Which three? Blameless bodily action, blameless verbal action, and blameless mental action.",
      "sinhala": "භික්ෂූනි, ධර්මත්‍ර‍යකින් සමන්වාගත වූ බාලයා හැඳිනගත යුත්තේ ය. කවර තුණකින් ද? සාවද්‍ය වූ කාය කර්මයෙන්, සාවද්‍ය වූ වචී කර්මයෙන්, සාවද්‍ය වූ මනෝ කර්මයෙන් යුක්ත වීමෙනි. එසේම, ධර්මත්‍ර‍යකින් සමන්වාගත වූ පණ්ඩිතයා හැඳිනගත යුත්තේ ය. අනවද්‍ය වූ කාය කර්මයෙන්, අනවද්‍ය වූ වචී කර්මයෙන්, අනවද්‍ය වූ මනෝ කර්මයෙන් යුක්ත වීමෙනි.",
      "paliTitle": "Sāvajjasuttaṃ",
      "englishTitle": "Blameworthy Sutta",
      "sinhalaTitle": "සාවජ්ජ සූත්‍රය"
    },
    {
      "number": 8,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bālo veditabbo. Katamehi tīhi? Sabyābajjhena kāyakammena, sabyābajjhena vacīkammena, sabyābajjhena manokammena…pe… abyābajjhena kāyakammena, abyābajjhena vacīkammena, abyābajjhena manokammena. Imehi, kho, bhikkhave, tīhi dhammehi samannāgato paṇḍito veditabbo. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘yehi tīhi dhammehi samannāgato bālo veditabbo te tayo dhamme abhinivajjetvā, yehi tīhi dhammehi samannāgato paṇḍito veditabbo te tayo dhamme samādāya vattissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Aṭṭhamaṃ.",
      "english": "Monks, a foolish person is known by being endowed with three qualities. Which three? Bodily action that causes affliction, verbal action that causes affliction, and mental action that causes affliction. And monks, a wise person is known by being endowed with these three qualities: bodily action that causes no affliction, verbal action that causes no affliction, and mental action that causes no affliction. Therefore, monks, this is how you should train yourselves: 'Having abandoned those three qualities by which a foolish person is known, we shall undertake and live by those three qualities by which a wise person is known.' That is how, monks, you should train yourselves.",
      "sinhala": "භික්ෂූන් වහන්සේලා, කරුණු තුනකින් යුක්ත වූ පුද්ගලයා අනුවණ පුද්ගලයෙකු ලෙස දැනගත යුතුය. ඒ තුන කුමක්ද? අනුන්ට පීඩා කරන කායික කර්මය, අනුන්ට පීඩා කරන වාචසික කර්මය, අනුන්ට පීඩා කරන මානසික කර්මය යන මේ කරුණු තුනෙන් යුක්ත වූ පුද්ගලයා අනුවණ පුද්ගලයෙකු ලෙස දැනගත යුතුය. භික්ෂූන් වහන්සේලා, අනුන්ට පීඩා නොකරන කායික කර්මය, අනුන්ට පීඩා නොකරන වාචසික කර්මය, අනුන්ට පීඩා නොකරන මානසික කර්මය යන මේ කරුණු තුනෙන් යුක්ත වූ පුද්ගලයා නුවණැති පුද්ගලයෙකු ලෙස දැනගත යුතුය.\n\nඑබැවින්, භික්ෂූන් වහන්සේලා, මෙසේ හික්මිය යුතුය – ‘යම් කරුණු තුනකින් යුක්ත වූ පුද්ගලයා අනුවණ පුද්ගලයෙකු ලෙස දැනගන්නේද, ඒ කරුණු තුන සම්පූර්ණයෙන් අත්හැර, යම් කරුණු තුනකින් යුක්ත වූ පුද්ගලයා නුවණැති පුද්ගලයෙකු ලෙස දැනගන්නේද, ඒ කරුණු තුන සමාදන් වී වාසය කරන්නෙමු’ කියාය. භික්ෂූන් වහන්සේලා, මෙසේම ඔබ හික්මිය යුතුය.",
      "paliTitle": "Sabyābajjhasuttaṃ",
      "englishTitle": "The Discourse on Suffering",
      "sinhalaTitle": "සබ්‍යාබජ්ඣ සූත්‍රය"
    },
    {
      "number": 9,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi tīhi? Kāyaduccaritena, vacīduccaritena, manoduccaritena. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. ‘‘Tīhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi tīhi? Kāyasucaritena, vacīsucaritena, manosucaritena. Imehi kho, bhikkhave, tīhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. Navamaṃ.",
      "english": "Monks, an unwise, undiscerning, ignoble person, endowed with three qualities, brings harm and injury upon himself. He is blameworthy and reproachable by the discerning, and he generates much demerit. Which three? Misconduct in body, misconduct in speech, and misconduct in mind. Indeed, Monks, an unwise, undiscerning, ignoble person, endowed with these three qualities, brings harm and injury upon himself. He is blameworthy and reproachable by the discerning, and he generates much demerit.\n\nMonks, a wise, discerning, noble person, endowed with three qualities, maintains himself undamaged and unblemished. He is blameless and irreproachable by the discerning, and he generates much merit. Which three? Good conduct in body, good conduct in speech, and good conduct in mind. Indeed, Monks, a wise, discerning, noble person, endowed with these three qualities, maintains himself undamaged and unblemished. He is blameless and irreproachable by the discerning, and he generates much merit.",
      "sinhala": "භික්ෂූනි, ධර්මයන් තුනකින් සමන්වාගත වූ බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ තැනැත්තා තමා විනාශයට හා පිරිහීමට පත්කර ගනී. එසේම, විඥාවන්තයන්ට දොස් සහිත ද, නින්දාවට ලක්විය යුතු ද වේ. තවද, බොහෝ අකුසල් ද උපදවා ගනී. ඒ ධර්මයෝ තුන කවරේද? කාය දුශ්චරිතයෙන්, වචී දුශ්චරිතයෙන්, මනෝ දුශ්චරිතයෙන්. භික්ෂූනි, සැබැවින්ම මේ ධර්මයන් තුනකින් සමන්වාගත වූ බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ තැනැත්තා තමා විනාශයට හා පිරිහීමට පත්කර ගනී. එසේම, විඥාවන්තයන්ට දොස් සහිත ද, නින්දාවට ලක්විය යුතු ද වේ. තවද, බොහෝ අකුසල් ද උපදවා ගනී.\n\nභික්ෂූනි, ධර්මයන් තුනකින් සමන්වාගත වූ පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ තැනැත්තා තමා විනාශයට හා පිරිහීමට පත්කර නොගනී. එසේම, විඥාවන්තයන්ට දොස් රහිත ද, නින්දාවට ලක්විය යුතු නොවන ද වේ. තවද, බොහෝ කුසල් ද උපදවා ගනී. ඒ ධර්මයෝ තුන කවරේද? කාය සුචරිතයෙන්, වචී සුචරිතයෙන්, මනෝ සුචරිතයෙන්. භික්ෂූනි, සැබැවින්ම මේ ධර්මයන් තුනකින් සමන්වාගත වූ පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ තැනැත්තා තමා විනාශයට හා පිරිහීමට පත්කර නොගනී. එසේම, විඥාවන්තයන්ට දොස් රහිත ද, නින්දාවට ලක්විය යුතු නොවන ද වේ. තවද, බොහෝ කුසල් ද උපදවා ගනී.",
      "paliTitle": "Khatasuttaṃ",
      "englishTitle": "The Uprooted Sutta",
      "sinhalaTitle": "ඛත සූත්‍රය"
    },
    {
      "number": 10,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato tayo male appahāya yathābhataṃ nikkhitto evaṃ niraye. Katamehi tīhi? Dussīlo ca hoti, dussīlyamalañcassa appahīnaṃ hoti; issukī ca hoti, issāmalañcassa appahīnaṃ hoti; maccharī ca hoti, maccheramalañcassa appahīnaṃ hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato ime tayo male appahāya yathābhataṃ nikkhitto evaṃ niraye. ‘‘Tīhi, bhikkhave, dhammehi samannāgato tayo male pahāya yathābhataṃ nikkhitto evaṃ sagge. Katamehi tīhi? Sīlavā ca hoti, dussīlyamalañcassa pahīnaṃ hoti; anissukī ca hoti, issāmalañcassa pahīnaṃ hoti; amaccharī ca hoti, maccheramalañcassa pahīnaṃ hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato ime tayo male pahāya yathābhataṃ nikkhitto evaṃ sagge’’ti. Dasamaṃ.",
      "english": "Monks, a person endowed with three qualities, without abandoning these three stains, is deposited in hell just as if he were carried there. What three? He is unvirtuous, and the stain of unvirtuousness is not abandoned in him; he is envious, and the stain of envy is not abandoned in him; he is stingy, and the stain of stinginess is not abandoned in him. Indeed, monks, a person endowed with these three qualities, without abandoning these three stains, is deposited in hell just as if he were carried there.\n\nMonks, a person endowed with three qualities, having abandoned these three stains, is deposited in heaven just as if he were carried there. What three? He is virtuous, and the stain of unvirtuousness is abandoned in him; he is not envious, and the stain of envy is abandoned in him; he is not stingy, and the stain of stinginess is abandoned in him. Indeed, monks, a person endowed with these three qualities, having abandoned these three stains, is deposited in heaven just as if he were carried there.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්‍මයන් තුනකින් සමන්විත වූ, කෙලෙස් (මල) තුනක් අත්නොහළ පුද්ගලයා, ඔහු ගෙනා අයුරින්ම නිරයේ දමන ලද්දෙක් වැනිය. ඒ කවර තුනක්ද? ඔහු දුස්සීල වේ, දුස්සීල්‍යමලයද ඔහු විසින් අත්හරින ලද්දක් නොවේ; ඔහු ඊර්ෂ්‍යා සහගත වේ, ඊර්ෂ්‍යාමලයද ඔහු විසින් අත්හරින ලද්දක් නොවේ; ඔහු මසුරු වේ, මසුරුකම නමැති මලයද ඔහු විසින් අත්හරින ලද්දක් නොවේ. භික්ෂූන් වහන්ස, මේ ධර්‍මයන් තුනෙන් සමන්විත වූ, මේ කෙලෙස් (මල) තුන අත්නොහළ පුද්ගලයා, ඔහු ගෙනා අයුරින්ම නිරයේ දමන ලද්දෙක් වැනිය.\n\nභික්ෂූන් වහන්ස, ධර්‍මයන් තුනකින් සමන්විත වූ, කෙලෙස් (මල) තුනක් අත්හළ පුද්ගලයා, ඔහු ගෙනා අයුරින්ම ස්වර්ගයේ දමන ලද්දෙක් වැනිය. ඒ කවර තුනක්ද? ඔහු සිල්වත් වේ, දුස්සීල්‍යමලය ඔහු විසින් අත්හරින ලද්දක් වේ; ඔහු ඊර්ෂ්‍යා රහිත වේ, ඊර්ෂ්‍යාමලය ඔහු විසින් අත්හරින ලද්දක් වේ; ඔහු මසුරු නොවේ, මසුරුකම නමැති මලය ඔහු විසින් අත්හරින ලද්දක් වේ. භික්ෂූන් වහන්ස, මේ ධර්‍මයන් තුනෙන් සමන්විත වූ, මේ කෙලෙස් (මල) තුන අත්හළ පුද්ගලයා, ඔහු ගෙනා අයුරින්ම ස්වර්ගයේ දමන ලද්දෙක් වැනිය.",
      "paliTitle": "Malasuttaṃ",
      "englishTitle": "Stains Sutta",
      "sinhalaTitle": "මල සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Bālavaggo paṭhamo. Tassuddānaṃ – Bhayaṃ lakkhaṇacintī ca, accayañca ayoniso; Akusalañca sāvajjaṃ, sabyābajjhakhataṃ malanti.",
    "english": "The first chapter on the Fool. The summary of it: Fear, Mark, Thinking, Transgression, Unwise Attention; Unwholesome, Blameworthy, Afflicted, Damaged, and Stain.",
    "sinhala": "පළමු බාල වර්ගයයි. එහි උද්දානය නම්: භය, ලක්ඛණ, චින්තී, අච්චය, අයෝනිසෝ, අකුසල, සාවජ්ජ, සබ්‍යාබජ්ඣ, ඛත සහ මල සූත්‍රයි."
  }
}