{
  "id": "an3.18",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The passage on lust.",
    "sinhala": "රාගය පිළිබඳ වූ මාලාවයි."
  },
  "sections": [
    {
      "number": 184,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya tayo dhammā bhāvetabbā. Katame tayo? Suññato samādhi, animitto samādhi, appaṇihito samādhi – rāgassa, bhikkhave, abhiññāya ime tayo dhammā bhāvetabbā. ( ) [(rāgassa bhikkhave abhiññāya tayo dhammā bhāvetabbā. katame tayo? savitakkasavicāro samādhi, avitakkavicāramatto samādhi, avitakkaavicāro samādhi. rāgassa bhikkhave abhiññāya ime tayo dhammā bhāvetabbā.) etthantare pāṭho katthaci dissati, aṭṭhakathāyaṃ passitabbo] ‘‘Rāgassa, bhikkhave, pariññāya…pe… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya ime tayo dhammā bhāvetabbā. ‘‘Dosassa… mohassa… kodhassa… upanāhassa… makkhassa… palāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa abhiññāya… pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya ime tayo dhammā bhāvetabbā’’ti. (Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti.) [( ) etthantare pāṭho syā. kaṃ. ka. potthakesu na dissati] ",
      "english": "For the profound understanding of lust, O monks, three qualities are to be developed. Which three? Concentration on emptiness, concentration on the signless, and concentration on the desireless. For the profound understanding of lust, O monks, these three qualities are to be developed.\n\nFor the complete understanding, for the utter destruction, for the abandoning, for the exhaustion, for the fading away, for dispassion, for cessation, for relinquishment, and for the letting go of lust, O monks, these three qualities are to be developed.\n\nFor the profound understanding, for the complete understanding, for the utter destruction, for the abandoning, for the exhaustion, for the fading away, for dispassion, for cessation, for relinquishment, and for the letting go of aversion, of delusion, of anger, of resentment, of denigration, of rivalry, of envy, of stinginess, of hypocrisy, of fraud, of stubbornness, of presumption, of conceit, of excessive conceit, of intoxication, and of heedlessness, O monks, these three qualities are to be developed.\n\nThis is what the Blessed One said. Delighted, those monks rejoiced in the Blessed One’s words.",
      "sinhala": "මහණෙනි, රාගය මැනවින් අවබෝධ කිරීම පිණිස ධර්ම කරුණු තුනක් වැඩිය යුතු ය. කවර තුනක් ද? ශූන්‍යතා සමාධිය, අනිමිත්ත සමාධිය, අප්‍රණිහිත සමාධිය යි. මහණෙනි, රාගය මැනවින් අවබෝධ කිරීම පිණිස මේ ධර්ම කරුණු තුන වැඩිය යුතු ය.\n\nමහණෙනි, රාගය පිරිසිඳ දැනීම පිණිස ද, මුළුමණින්ම ක්ෂය කිරීම පිණිස ද, ප්‍රහාණය කිරීම පිණිස ද, ක්ෂය වීම පිණිස ද, වියැකී යාම පිණිස ද, විරාගය පිණිස ද, නිරෝධය පිණිස ද, කැප කිරීම පිණිස ද, මුළුමණින්ම අත්හැරීම පිණිස ද මේ ධර්ම කරුණු තුන වැඩිය යුතු ය. ද්වේෂය, මෝහය, ක්‍රෝධය, උපනාහය, මක්ඛය, පලාසය, ඊර්ෂ්‍යාව, මසුරුකම, මායාව, සාඨේය්‍යය, ථම්භය, සාරම්භය, මානය, අතිමානය, මදය, ප්‍රමාදය යන මේ සෑම ධර්මයක්ම මැනවින් අවබෝධ කිරීම පිණිස ද, පිරිසිඳ දැනීම පිණිස ද, මුළුමණින්ම ක්ෂය කිරීම පිණිස ද, ප්‍රහාණය කිරීම පිණිස ද, ක්ෂය වීම පිණිස ද, වියැකී යාම පිණිස ද, විරාගය පිණිස ද, නිරෝධය පිණිස ද, කැප කිරීම පිණිස ද, මුළුමණින්ම අත්හැරීම පිණිස ද යන මේ හැම කරුණක් පිණිසම මේ ධර්ම කරුණු තුන වැඩිය යුතු ය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ. Tassuddānaṃ – [imā uddānagāthāyo sī. syā. kaṃ. pī. potthakesu na dissanti] Rāgaṃ dosañca mohañca, kodhūpanāhapañcamaṃ; Makkhapaḷāsaissā ca, maccharimāyāsāṭheyyā. Thambhasārambhamānañca, atimānamadassa ca; Pamādā sattarasa vuttā, rāgapeyyālanissitā. Ete opammayuttena, āpādena abhiññāya; Pariññāya parikkhayā, pahānakkhayabbayena; Virāganirodhacāgaṃ, paṭinissagge ime dasa. Suññato animitto ca, appaṇihito ca tayo; Samādhimūlakā peyyālesupi vavatthitā cāti. ",
    "english": "The Abbreviated Series on Lust is finished. The summary of it: [These summary verses are not seen in the Ceylonese, Thai, Cambodian, and PTS books] Lust, Hatred, Delusion, Anger, and Resentment as the fifth; Contempt, Domineering, Envy, Stinginess, Deceit, and Fraud; Obstinacy, Impetuosity, Conceit, Arrogance, Intoxication; and Heedlessness—these seventeen are mentioned in the Abbreviated Series on Lust. These, combined with similes and means, for direct knowledge, full understanding, complete exhaustion, abandoning, destruction, and passing away; fading of lust, cessation, giving up, and relinquishment—these ten. Emptiness, Signless, and Undirected—these three; established also in the Abbreviated Series rooted in Concentration.",
    "sinhala": "රාග පෙය්‍යාලය නිමයි. එහි උද්දානය නම්: රාග, දෝස, මෝහ, කෝධ, උපනාහ, මක්ඛ, පලාස, ඉස්සා, මච්ඡරිය, මායා, සාඨෙය්‍ය, ථම්භ, සාරම්භ, මාන, අතිමාන, මද සහ පමාද යන සූත්‍ර දාහතක් රාග පෙය්‍යාලයෙහි දැක්වේ. මේවා අභිඤ්ඤා, පරිඤ්ඤා, පිරික්ඛය, පහාන, ඛය, වය, විරාග, නිරෝධ, චාග සහ පටිනිස්සග්ග යන දසය සමඟ යොදන්න. සුඤ්ඤත, අනිමිත්ත සහ අප්පණිහිත යන තුන සමාධි මූලක පෙය්‍යාලයෙහිද දැක්වේ."
  }
}