{
  "id": "an3.7",
  "title": {
    "pali": "Mahāvaggo",
    "english": "The Great Section",
    "sinhala": "මහා වග්ගය"
  },
  "sections": [
    {
      "number": 62,
      "pali": "‘‘Tīṇimāni, bhikkhave, titthāyatanāni yāni paṇḍitehi samanuyuñjiyamānāni [samanuggāhiyamānāni (syā. kaṃ. ka.)] samanugāhiyamānāni samanubhāsiyamānāni parampi gantvā akiriyāya saṇṭhahanti. Katamāni tīṇi? Santi, bhikkhave, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ pubbekatahetū’ti. Santi, bhikkhave, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ issaranimmānahetū’ti. Santi, bhikkhave, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ ahetuappaccayā’’’ti. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ pubbekatahetū’ti, tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto evaṃvādino evaṃdiṭṭhino – yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ pubbekatahetū’ti? Te ca me [te ce me (sī. syā. kaṃ. pī.)] evaṃ puṭṭhā ‘āmā’ti [āmoti (sī.)] paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘tenahāyasmanto pāṇātipātino bhavissanti pubbekatahetu, adinnādāyino bhavissanti pubbekatahetu, abrahmacārino bhavissanti pubbekatahetu, musāvādino bhavissanti pubbekatahetu, pisuṇavācā bhavissanti pubbekatahetu, pharusavācā bhavissanti pubbekatahetu, samphappalāpino bhavissanti pubbekatahetu, abhijjhāluno bhavissanti pubbekatahetu, byāpannacittā bhavissanti pubbekatahetu, micchādiṭṭhikā bhavissanti pubbekatahetu’’’. ‘‘Pubbekataṃ kho pana, bhikkhave, sārato paccāgacchataṃ na hoti chando vā vāyāmo vā idaṃ vā karaṇīyaṃ idaṃ vā akaraṇīyanti. Iti karaṇīyākaraṇīye kho pana saccato thetato anupalabbhiyamāne muṭṭhassatīnaṃ anārakkhānaṃ viharataṃ na hoti paccattaṃ sahadhammiko samaṇavādo. Ayaṃ kho me, bhikkhave, tesu samaṇabrāhmaṇesu evaṃvādīsu evaṃdiṭṭhīsu paṭhamo sahadhammiko niggaho hoti. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ issaranimmānahetū’ti, tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto evaṃvādino evadiṭṭhino – yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ issaranimmānahetū’ti? Te ca me evaṃ puṭṭhā ‘āmā’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘tenahāyasmanto pāṇātipātino bhavissanti issaranimmānahetu, adinnādāyino bhavissanti issaranimmānahetu, abrahmacārino bhavissanti issaranimmānahetu, musāvādino bhavissanti issaranimmānahetu, pisuṇavācā bhavissanti issaranimmānahetu, pharusavācā bhavissanti issaranimmānahetu, samphappalāpino bhavissanti issaranimmānahetu, abhijjhāluno bhavissanti issaranimmānahetu, byāpannacittā bhavissanti issaranimmānahetu, micchādiṭṭhikā bhavissanti issaranimmānahetu’’’. ‘‘Issaranimmānaṃ kho pana, bhikkhave, sārato paccāgacchataṃ na hoti chando vā vāyāmo vā idaṃ vā karaṇīyaṃ idaṃ vā akaraṇīyanti. Iti karaṇīyākaraṇīye kho pana saccato thetato anupalabbhiyamāne muṭṭhassatīnaṃ anārakkhānaṃ viharataṃ na hoti paccattaṃ sahadhammiko samaṇavādo. Ayaṃ kho me, bhikkhave, tesu samaṇabrāhmaṇesu evaṃvādīsu evaṃdiṭṭhīsu dutiyo sahadhammiko niggaho hoti. ‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiṃ cāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ ahetuappaccayā’ti, tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto evaṃvādino evaṃdiṭṭhino – yaṃ kiṃ cāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ ahetuappaccayā’ti? Te ca me evaṃ puṭṭhā ‘āmā’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘tenahāyasmanto pāṇātipātino bhavissanti ahetuappaccayā…pe… micchādiṭṭhikā bhavissanti ahetuappaccayā’’’. ‘‘Ahetuappaccayaṃ [ahetuṃ (sī.), ahetu (syā. kaṃ.), ahetuappaccayā (pī.), ahetuṃ appaccayaṃ (ka.)] kho pana, bhikkhave, sārato paccāgacchataṃ na hoti chando vā vāyāmo vā idaṃ vā karaṇīyaṃ idaṃ vā akaraṇīyanti. Iti karaṇīyākaraṇīye kho pana saccato thetato anupalabbhiyamāne muṭṭhassatīnaṃ anārakkhānaṃ viharataṃ na hoti paccattaṃ sahadhammiko samaṇavādo. Ayaṃ kho me, bhikkhave, tesu samaṇabrāhmaṇesu evaṃvādīsu evaṃdiṭṭhīsu tatiyo sahadhammiko niggaho hoti. ‘‘Imāni kho, bhikkhave, tīṇi titthāyatanāni yāni paṇḍitehi samanuyuñjiyamānāni samanugāhiyamānāni samanubhāsiyamānāni parampi gantvā akiriyāya saṇṭhahanti. ‘‘Ayaṃ kho pana, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhi. Katamo ca, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhi? Imā cha dhātuyoti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhi. Imāni cha phassāyatanānīti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhi. Ime aṭṭhārasa manopavicārāti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhi. Imāni cattāri ariyasaccānīti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhi. ‘‘Imā cha dhātuyoti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Chayimā, bhikkhave, dhātuyo – pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu, ākāsadhātu, viññāṇadhātu. Imā cha dhātuyoti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Imāni cha phassāyatanānīti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Chayimāni, bhikkhave, phassāyatanāni – cakkhu phassāyatanaṃ, sotaṃ phassāyatanaṃ, ghānaṃ phassāyatanaṃ, jivhā phassāyatanaṃ, kāyo phassāyatanaṃ, mano phassāyatanaṃ. Imāni cha phassāyatanānīti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Ime aṭṭhārasa manopavicārāti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Cakkhunā rūpaṃ disvā somanassaṭṭhāniyaṃ rūpaṃ upavicarati domanassaṭṭhāniyaṃ rūpaṃ upavicarati upekkhāṭṭhāniyaṃ rūpaṃ upavicarati, sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya somanassaṭṭhāniyaṃ dhammaṃ upavicarati domanassaṭṭhāniyaṃ dhammaṃ upavicarati upekkhāṭṭhāniyaṃ dhammaṃ upavicarati. Ime aṭṭhārasa manopavicārāti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Imāni cattāri ariyasaccānīti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Channaṃ, bhikkhave, dhātūnaṃ upādāya gabbhassāvakkanti hoti; okkantiyā sati nāmarūpaṃ, nāmarūpapaccayā saḷāyatanaṃ, saḷāyatanapaccayā phasso, phassapaccayā vedanā. Vediyamānassa kho panāhaṃ, bhikkhave, idaṃ dukkhanti paññapemi, ayaṃ dukkhasamudayoti paññapemi, ayaṃ dukkhanirodhoti paññapemi, ayaṃ dukkhanirodhagāminī paṭipadāti paññapemi. ‘‘Katamañca, bhikkhave, dukkhaṃ ariyasaccaṃ? Jātipi dukkhā, jarāpi dukkhā, ( ) [(byādhipi dukkho) (sī. pī. ka.) aṭṭhakathāya saṃsandetabbaṃ visuddhi. 2.537] maraṇampi dukkhaṃ, sokaparidevadukkhadomanassupāyāsāpi dukkhā, (appiyehi sampayogo dukkho, piyehi vippayogo dukkho,) [(natthi katthaci)] yampicchaṃ na labhati tampi dukkhaṃ. Saṃkhittena pañcupādānakkhandhā dukkhā. Idaṃ vuccati, bhikkhave, dukkhaṃ ariyasaccaṃ. ‘‘Katamañca, bhikkhave, dukkhasamudayaṃ [dukkhasamudayo (syā. kaṃ.)] ariyasaccaṃ? Avijjāpaccayā saṅkhārā, saṅkhārapaccayā viññāṇaṃ, viññāṇapaccayā nāmarūpaṃ, nāmarūpapaccayā saḷāyatanaṃ, saḷāyatanapaccayā phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṃ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā sambhavanti. Evametassa kevalassa dukkhakkhandhassa samudayo hoti. Idaṃ vuccati, bhikkhave, dukkhasamudayaṃ ariyasaccaṃ. ‘‘Katamañca, bhikkhave, dukkhanirodhaṃ [dukkhanirodho (syā. kaṃ.)] ariyasaccaṃ? Avijjāya tveva asesavirāganirodhā saṅkhāranirodho, saṅkhāranirodhā viññāṇanirodho, viññāṇanirodhā nāmarūpanirodho, nāmarūpanirodhā saḷāyatananirodho, saḷāyatananirodhā phassanirodho, phassanirodhā vedanānirodho, vedanānirodhā taṇhānirodho, taṇhānirodhā upādānanirodho, upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā nirujjhanti. Evametassa kevalassa dukkhakkhandhassa nirodho hoti. Idaṃ vuccati, bhikkhave, dukkhanirodhaṃ ariyasaccaṃ. ‘‘Katamañca, bhikkhave, dukkhanirodhagāminī paṭipadā ariyasaccaṃ? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. Idaṃ vuccati, bhikkhave, dukkhanirodhagāminī paṭipadā ariyasaccaṃ. ‘Imāni cattāri ariyasaccānī’ti, bhikkhave, mayā dhammo desito aniggahito asaṃkiliṭṭho anupavajjo appaṭikuṭṭho samaṇehi brāhmaṇehi viññūhīti. Iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Paṭhamaṃ.",
      "english": "Monks, these are the three bases of speculative views which, when thoroughly investigated, examined, and discussed by the wise, ultimately settle upon the conclusion of inaction. Which three? Monks, there are some ascetics and brahmins who hold such a doctrine and view: ‘Whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that is due to a cause stemming from past deeds.’ Monks, there are some ascetics and brahmins who hold such a doctrine and view: ‘Whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that is due to a cause stemming from divine creation.’ Monks, there are some ascetics and brahmins who hold such a doctrine and view: ‘Whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that arises without cause or condition.’\n\nRegarding this, Monks, those ascetics and brahmins who hold such a doctrine and view: ‘Whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that is due to a cause stemming from past deeds,’ I approach them and say: ‘Is it truly the case, venerable sirs, that you hold such a doctrine and view: that whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that is due to a cause stemming from past deeds?’ When I question them thus, they acknowledge it, saying: ‘Yes.’ Then I say to them: ‘In that case, venerable sirs, people will become killers of living beings due to a cause stemming from past deeds; they will become takers of what is not given due to a cause stemming from past deeds; they will become non-celibate due to a cause stemming from past deeds; they will become speakers of falsehoods due to a cause stemming from past deeds; they will become speakers of divisive speech due to a cause stemming from past deeds; they will become speakers of harsh speech due to a cause stemming from past deeds; they will become speakers of frivolous chatter due to a cause stemming from past deeds; they will become covetous due to a cause stemming from past deeds; they will become those with malevolent intent due to a cause stemming from past deeds; they will become those holding wrong view due to a cause stemming from past deeds.’\n\nMoreover, Monks, for those who take past action as the essence, there is no arising of zeal or effort regarding ‘this is what should be done’ or ‘this is what should not be done.’ Thus, since what should be done and what should not be done are not truly and substantially found, the proclamation of religious conduct that accords with the Dhamma does not exist individually for those who abide forgetful of mindfulness and unprotected. This, Monks, is my first rebuttal based on the Dhamma against those ascetics and brahmins who hold such a doctrine and view.\n\nRegarding this, Monks, those ascetics and brahmins who hold such a doctrine and view: ‘Whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that is due to a cause stemming from divine creation,’ I approach them and say: ‘Is it truly the case, venerable sirs, that you hold such a doctrine and view: that whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that is due to a cause stemming from divine creation?’ When I question them thus, they acknowledge it, saying: ‘Yes.’ Then I say to them: ‘In that case, venerable sirs, people will become killers of living beings due to a cause stemming from divine creation; they will become takers of what is not given due to a cause stemming from divine creation; they will become non-celibate due to a cause stemming from divine creation; they will become speakers of falsehoods due to a cause stemming from divine creation; they will become speakers of divisive speech due to a cause stemming from divine creation; they will become speakers of harsh speech due to a cause stemming from divine creation; they will become speakers of frivolous chatter due to a cause stemming from divine creation; they will become covetous due to a cause stemming from divine creation; they will become those with malevolent intent due to a cause stemming from divine creation; they will become those holding wrong view due to a cause stemming from divine creation.’\n\nMoreover, Monks, for those who take divine creation as the essence, there is no arising of zeal or effort regarding ‘this is what should be done’ or ‘this is what should not be done.’ Thus, since what should be done and what should not be done are not truly and substantially found, the proclamation of religious conduct that accords with the Dhamma does not exist individually for those who abide forgetful of mindfulness and unprotected. This, Monks, is my second rebuttal based on the Dhamma against those ascetics and brahmins who hold such a doctrine and view.\n\nRegarding this, Monks, those ascetics and brahmins who hold such a doctrine and view: ‘Whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that arises without cause or condition,’ I approach them and say: ‘Is it truly the case, venerable sirs, that you hold such a doctrine and view: that whatever this individual person experiences—whether pleasure, pain, or neither-pain-nor-pleasure—all of that arises without cause or condition?’ When I question them thus, they acknowledge it, saying: ‘Yes.’ Then I say to them: ‘In that case, venerable sirs, people will become killers of living beings without cause or condition... they will become those holding wrong view without cause or condition.’\n\nMoreover, Monks, for those who take the absence of cause or condition as the essence, there is no arising of zeal or effort regarding ‘this is what should be done’ or ‘this is what should not be done.’ Thus, since what should be done and what should not be done are not truly and substantially found, the proclamation of religious conduct that accords with the Dhamma does not exist individually for those who abide forgetful of mindfulness and unprotected. This, Monks, is my third rebuttal based on the Dhamma against those ascetics and brahmins who hold such a doctrine and view.\n\nYet, Monks, for those who truly revert to the essence of the doctrine that things arise without cause or condition, there is no desire, no effort, nor the distinction that ‘this should be done’ or ‘this should not be done.’ Thus, when the duties to be done and the duties not to be done are not truly and ultimately discovered, for those who dwell unmindful and unprotected, there can be no congenial discourse among contemplatives regarding the ultimate goal. This, Monks, is the third congenial refutation I have against those contemplatives and brahmins who hold such views and doctrines.\n\nMonks, these three bases of views, when questioned, examined, and debated by the wise, eventually culminate in the doctrine of non-action. But, Monks, this Dhamma has been taught by me—a Dhamma that is not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins. And what, Monks, is the Dhamma taught by me that is not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins? It is the Dhamma taught by me concerning the Six Elements. It is the Dhamma taught by me concerning the Six Bases of Contact. It is the Dhamma taught by me concerning the Eighteen Mental Explorations. It is the Dhamma taught by me concerning the Four Noble Truths.\n\nThis was said: “The Dhamma concerning the Six Elements was taught by me, not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins.” In reliance upon what was this said? Monks, these are the six elements: the earth element, the water element, the fire element, the wind element, the space element, and the consciousness element. The Dhamma concerning the Six Elements was taught by me, not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins. That which was said, was said in reliance upon this.\n\nThis was said: “The Dhamma concerning the Six Bases of Contact was taught by me, not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins.” In reliance upon what was this said? Monks, these are the six bases of contact: the eye as a base of contact, the ear as a base of contact, the nose as a base of contact, the tongue as a base of contact, the body as a base of contact, and the mind as a base of contact. The Dhamma concerning the Six Bases of Contact was taught by me, not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins. That which was said, was said in reliance upon this.\n\nThis was said: “The Dhamma concerning the Eighteen Mental Explorations was taught by me, not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins.” In reliance upon what was this said? Having seen a form with the eye, one explores a form connected with joy, explores a form connected with displeasure, and explores a form connected with equanimity. Having heard a sound with the ear... Having smelled an odor with the nose... Having tasted a flavor with the tongue... Having felt a tangible object with the body... Having cognized a mental phenomenon with the mind, one explores a mental phenomenon connected with joy, explores a mental phenomenon connected with displeasure, and explores a mental phenomenon connected with equanimity. The Dhamma concerning the Eighteen Mental Explorations was taught by me, not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins. That which was said, was said in reliance upon this.\n\nThis was said: “The Dhamma concerning the Four Noble Truths was taught by me, not refuted, not defiled, not blameworthy, and not rejected by wise contemplatives and brahmins.” In reliance upon what was this said? Monks, dependent upon the six elements, there is the descent into the womb; with the descent, there is mind-and-matter; conditioned by mind-and-matter, there are the six sense bases; conditioned by the six sense bases, there is contact; conditioned by contact, there is feeling. Monks, it is for one who experiences feeling that I declare this to be suffering, I declare this to be the origin of suffering, I declare this to be the cessation of suffering, and I declare this to be the path leading to the cessation of suffering.\n\nAnd what, Monks, is the Noble Truth of Suffering? Birth is suffering, aging is suffering, sickness is suffering, death is suffering, sorrow, lamentation, pain, grief, and despair are suffering. Association with the disliked is suffering; separation from the beloved is suffering. Not getting what one wants is suffering. In short, the five aggregates subject to clinging are suffering.\n\nThis, monks, is called the Noble Truth of Suffering. And what, monks, is the Noble Truth of the Origin of Suffering? Conditioned by ignorance are mental formations; conditioned by mental formations is consciousness; conditioned by consciousness are mind-and-matter; conditioned by mind-and-matter are the six sense bases; conditioned by the six sense bases is contact; conditioned by contact is feeling; conditioned by feeling is craving; conditioned by craving is clinging; conditioned by clinging is becoming; conditioned by becoming is birth; conditioned by birth, aging-and-death, sorrow, lamentation, physical pain, mental grief, and despair arise. Thus is the origin of this entire mass of suffering. This, monks, is called the Noble Truth of the Origin of Suffering.\n\nAnd what, monks, is the Noble Truth of the Cessation of Suffering? However, through the complete fading away and cessation of ignorance comes the cessation of mental formations; through the cessation of mental formations, the cessation of consciousness; through the cessation of consciousness, the cessation of mind-and-matter; through the cessation of mind-and-matter, the cessation of the six sense bases; through the cessation of the six sense bases, the cessation of contact; through the cessation of contact, the cessation of feeling; through the cessation of feeling, the cessation of craving; through the cessation of craving, the cessation of clinging; through the cessation of clinging, the cessation of becoming; through the cessation of becoming, the cessation of birth; through the cessation of birth, aging-and-death, sorrow, lamentation, physical pain, mental grief, and despair cease. Thus is the cessation of this entire mass of suffering. This, monks, is called the Noble Truth of the Cessation of Suffering.\n\nAnd what, monks, is the Noble Truth of the Path Leading to the Cessation of Suffering? This is simply the Noble Eightfold Path, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, monks, is called the Noble Truth of the Path Leading to the Cessation of Suffering.\n\nMonks, this Dhamma—these four Noble Truths—have been taught by me, uncontested, undefiled, irreproachable, and unrepudiated by recluses, brahmins, or the wise. Thus, what was stated was stated by reference to this meaning.",
      "sinhala": "මහණෙනි, මේ තිත්ථායතන (මිථ්‍යාදෘෂ්ටි වලට පදනම් වන කරුණු) තුනක් ඇත. මේවා පණ්ඩිතයන් විසින් මැනවින් විමර්ශනය කරන විට, විචාරණ විට, සාකච්ඡා කරන විට අවසානයේ අකිරියවාදයෙහි (ක්‍රියා නැතිකමෙහි) පිහිටන්නේය. ඒ තිදෙන කවරේද?\n\nමහණෙනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ මෙසේ වදාරන්නෝ, මෙසේ දෘෂ්ටි දරන්නෝ වෙති: ‘යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ (උපේක්ෂා) වේදනාවක් හෝ—ඒ සියල්ලම පෙර කරන ලද කර්ම හේතුවෙන් සිදුවේ.’ මහණෙනි, තවද ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ මෙසේ වදාරන්නෝ, මෙසේ දෘෂ්ටි දරන්නෝ වෙති: ‘යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම ඊශ්වරයාගේ නිර්මාණය හේතුවෙන් සිදුවේ.’ මහණෙනි, තවද ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ මෙසේ වදාරන්නෝ, මෙසේ දෘෂ්ටි දරන්නෝ වෙති: ‘යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව සිදුවේ.’\n\nමහණෙනි, ඒ ශ්‍රමණ-බ්‍රාහ්මණයන් අතර, ‘යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම පෙර කරන ලද කර්ම හේතුවෙන් සිදුවේ’ යැයි මෙසේ වදාරන්නාවූ, මෙසේ දෘෂ්ටි දරන්නාවූ යම් කෙනෙක් ඇද්ද, මම ඔවුනට එළඹ මෙසේ කියමි: ‘ඇත්තෙන්ම ආයුෂ්මතුන් වහන්සේලා මෙසේ වදාරන්නෝ, මෙසේ දෘෂ්ටි දරන්නෝද, එනම්: යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම පෙර කරන ලද කර්ම හේතුවෙන් සිදුවේ’ කියා? මා විසින් මෙසේ විමසූ විට ඔවුහු ‘එසේය’යි පිළිගනිති. මම ඔවුනට මෙසේ කියමි: ‘එසේනම්, ආයුෂ්මතුන් වහන්සේලා පෙර කරන ලද හේතුවෙන් ප්‍රාණඝාත කරන්නෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් අදත්තාදානය කරන්නෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් අබ්‍රහ්මචර්යාවෙහි හැසිරෙන්නෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් මුසාවාද කියන්නෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් පිසුණාවාචා කියන්නෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් ඵරුෂවාචා කියන්නෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් සම්ඵප්ප්‍රලාප කියන්නෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් අභිධ්‍යා ඇත්තෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් ව්‍යාපාද සිත් ඇත්තෝ වන්නාහ; පෙර කරන ලද හේතුවෙන් මිථ්‍යාදෘෂ්ටි ඇත්තෝ වන්නාහ.’\n\nමහණෙනි, පෙර කරන ලද කර්මය සාර කොට ගත්තවුන්ට මෙය කළයුත්තකි, මෙය නොකළ යුත්තකි යන්න පිළිබඳව ඡන්දයක් හෝ වෑයමක් හෝ ඇති නොවේ. මෙසේ සැබෑ ලෙසින්, ස්ථිර වශයෙන් කළයුතු නොකළයුතු දෑ සොයාගත නොහැකි වූ විට, සිහි මුළා වූවන් ලෙසින්, ආරක්ෂා රහිතව වාසය කරන්නන්ට තමන් විසින්ම ඇතිකරගත් ධර්මානුකූල ශ්‍රමණ ප්‍රතිපදාවක් හෝ වාදයක් හෝ ඇති නොවේ. මහණෙනි, මෙසේ වදාරන්නාවූ, මෙසේ දෘෂ්ටි දරන්නාවූ ඒ ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි මාගේ පළමු ධර්මානුකූල නිග්‍රහය මෙය වන්නේය.\n\nමහණෙනි, ඒ ශ්‍රමණ-බ්‍රාහ්මණයන් අතර, ‘යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම ඊශ්වර නිර්මාණය හේතුවෙන් සිදුවේ’ යැයි මෙසේ වදාරන්නාවූ, මෙසේ දෘෂ්ටි දරන්නාවූ යම් කෙනෙක් ඇද්ද, මම ඔවුනට එළඹ මෙසේ කියමි: ‘ඇත්තෙන්ම ආයුෂ්මතුන් වහන්සේලා මෙසේ වදාරන්නෝ, මෙසේ දෘෂ්ටි දරන්නෝද, එනම්: යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම ඊශ්වර නිර්මාණය හේතුවෙන් සිදුවේ’ කියා? මා විසින් මෙසේ විමසූ විට ඔවුහු ‘එසේය’යි පිළිගනිති. මම ඔවුනට මෙසේ කියමි: ‘එසේනම්, ආයුෂ්මතුන් වහන්සේලා ඊශ්වර නිර්මාණය හේතුවෙන් ප්‍රාණඝාත කරන්නෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් අදත්තාදානය කරන්නෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් අබ්‍රහ්මචර්යාවෙහි හැසිරෙන්නෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් මුසාවාද කියන්නෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් පිසුණාවාචා කියන්නෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් ඵරුෂවාචා කියන්නෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් සම්ඵප්ප්‍රලාප කියන්නෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් අභිධ්‍යා ඇත්තෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් ව්‍යාපාද සිත් ඇත්තෝ වන්නාහ; ඊශ්වර නිර්මාණය හේතුවෙන් මිථ්‍යාදෘෂ්ටි ඇත්තෝ වන්නාහ.’\n\nමහණෙනි, ඊශ්වර නිර්මාණය සාර කොට ගත්තවුන්ට මෙය කළයුත්තකි, මෙය නොකළ යුත්තකි යන්න පිළිබඳව ඡන්දයක් හෝ වෑයමක් හෝ ඇති නොවේ. මෙසේ සැබෑ ලෙසින්, ස්ථිර වශයෙන් කළයුතු නොකළයුතු දෑ සොයාගත නොහැකි වූ විට, සිහි මුළා වූවන් ලෙසින්, ආරක්ෂා රහිතව වාසය කරන්නන්ට තමන් විසින්ම ඇතිකරගත් ධර්මානුකූල ශ්‍රමණ ප්‍රතිපදාවක් හෝ වාදයක් හෝ ඇති නොවේ. මහණෙනි, මෙසේ වදාරන්නාවූ, මෙසේ දෘෂ්ටි දරන්නාවූ ඒ ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි මාගේ දෙවන ධර්මානුකූල නිග්‍රහය මෙය වන්නේය.\n\nමහණෙනි, ඒ ශ්‍රමණ-බ්‍රාහ්මණයන් අතර, ‘යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව සිදුවේ’ යැයි මෙසේ වදාරන්නාවූ, මෙසේ දෘෂ්ටි දරන්නාවූ යම් කෙනෙක් ඇද්ද, මම ඔවුනට එළඹ මෙසේ කියමි: ‘ඇත්තෙන්ම ආයුෂ්මතුන් වහන්සේලා මෙසේ වදාරන්නෝ, මෙසේ දෘෂ්ටි දරන්නෝද, එනම්: යම් කිසිවක් මේ පුරුෂ පුද්ගලයා විසින් විඳිනු ලබන්නේද—සුවයක් හෝ, දුකක් හෝ, දුක් නොවූ සුවක් නොවූ වේදනාවක් හෝ—ඒ සියල්ලම අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව සිදුවේ’ කියා? මා විසින් මෙසේ විමසූ විට ඔවුහු ‘එසේය’යි පිළිගනිති. මම ඔවුනට මෙසේ කියමි: ‘එසේනම්, ආයුෂ්මතුන් වහන්සේලා අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව ප්‍රාණඝාත කරන්නෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව අදත්තාදානය කරන්නෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව අබ්‍රහ්මචර්යාවෙහි හැසිරෙන්නෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව මුසාවාද කියන්නෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව පිසුණාවාචා කියන්නෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව ඵරුෂවාචා කියන්නෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව සම්ඵප්ප්‍රලාප කියන්නෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව අභිධ්‍යා ඇත්තෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව ව්‍යාපාද සිත් ඇත්තෝ වන්නාහ; අහේතුකව, ප්‍රත්‍යයන්ගෙන් තොරව මිථ්‍යාදෘෂ්ටි ඇත්තෝ වන්නාහ.’\n\nමහණෙනි, අහේතුකව හා අප්‍රත්‍යයව සිදුවීම සාර කොට ගත්තවුන්ට මෙය කළයුත්තකි, මෙය නොකළ යුත්තකි යන්න පිළිබඳව ඡන්දයක් හෝ වෑයමක් හෝ ඇති නොවේ. මෙසේ සැබෑ ලෙසින්, ස්ථිර වශයෙන් කළයුතු නොකළයුතු දෑ සොයාගත නොහැකි වූ විට, සිහි මුළා වූවන් ලෙසින්, ආරක්ෂා රහිතව වාසය කරන්නන්ට තමන් විසින්ම ඇතිකරගත් ධර්මානුකූල ශ්‍රමණ ප්‍රතිපදාවක් හෝ වාදයක් හෝ ඇති නොවේ. මහණෙනි, මෙසේ වදාරන්නාවූ, මෙසේ දෘෂ්ටි දරන්නාවූ ඒ ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි මාගේ තුන්වන ධර්මානුකූල නිග්‍රහය මෙය වන්නේය.\n\nමහණෙනි, යමෙක් අහේතුකව, අප්‍රත්‍යව (හේතු රහිතව, ප්‍රත්‍ය රහිතව) යමක් සාර කොටගෙන නැවත පැමිණෙන්නේ නම්, ඔවුන්ට 'මෙය කළ යුතු ය, මෙය නොකළ යුතු ය' යනුවෙන් ඡන්දයක් (කැමැත්තක්) හෝ ව්‍යායාමයක් (වීර්යයක්) හෝ ඇති නොවේ. මෙසේ, කළ යුත්තක් හෝ නොකළ යුත්තක් සත්‍ය වශයෙන්ම, ස්ථිර වශයෙන්ම සොයාගත නොහැකි වූ කල්හි, සිහි මුළා වී, රැකවරණයකින් තොරව වාසය කරන්නන්ට තමන් විසින්ම අවබෝධ කළ හැකි, ධර්මයට එකඟ වූ ශ්‍රමණයන්ගේ වාදයක් (දේශනාවක්) නැත්තේමය. මහණෙනි, මෙසේ කියන්නාවූ, මෙසේ දකින්නාවූ ඒ ශ්‍රමණයන් හා බ්‍රාහ්මණයන් කෙරෙහි මාගේ ධර්මයට එකඟ වූ තුන්වන නිග්‍රහය (පිළිවිරෝධය/බිඳ හෙලීම) මෙය වේ.\n\nමහණෙනි, මේ ත්‍රිවිධ වූ මිථ්‍යා දෘෂ්ටි ආයතන (තිත්ථ ආයතන) යම් විද්වතුන් විසින් විමසනු ලැබුවාහු ද, විභාග කරනු ලැබුවාහු ද, විස්තර කරනු ලැබුවාහු ද, අවසානයේ දී ඒවා ක්‍රියා රහිතභාවය (අක්‍රියාව) තුළම පිහිටා සිටින්නේ ය.\n\nමහණෙනි, මා විසින් මේ ධර්මය දේශනා කරන ලද්දේය. එය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද්දේය, කිලිටි නොකරන ලද්දේය, දොස් නොකියන ලද්දේය, ප්‍රතික්ෂේප නොකරන ලද්දේය. මහණෙනි, ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද මා විසින් දේශනා කරන ලද ධර්මය කවරේ ද? “මේ සය ධාතු ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මයයි. “මේ සය ස්පර්ශායතන ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මයයි. “මේ අටළොස් මනෝපවිචාර ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මයයි. “මේ ආර්ය සත්‍ය සතර ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මයයි.\n\n“මේ සය ධාතු ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මය යැයි මෙය වදාරන ලදී. කවරක් අරබයා මෙය වදාරන ලද්දේ ද? මහණෙනි, මේ ධාතු සය යි: එනම් පෘථිවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව, ආකාශ ධාතුව, විඥාණ ධාතුව යි. “මේ සය ධාතු ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මය යැයි යමක් වදාළේ ද, එය මේ කරුණ අරබයා වදාළේ ය.\n\n“මේ සය ස්පර්ශායතන ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මය යැයි මෙය වදාරන ලදී. කවරක් අරබයා මෙය වදාරන ලද්දේ ද? මහණෙනි, මේ ස්පර්ශායතන සය යි: එනම් චක්ඛු (ඇස) ස්පර්ශායතනය, සෝත (කන) ස්පර්ශායතනය, ඝාණ (නාසය) ස්පර්ශායතනය, ජිව්හා (දිව) ස්පර්ශායතනය, කාය (කය) ස්පර්ශායතනය, මනෝ (සිත) ස්පර්ශායතනය යි. “මේ සය ස්පර්ශායතන ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මය යැයි යමක් වදාළේ ද, එය මේ කරුණ අරබයා වදාළේ ය.\n\n“මේ අටළොස් මනෝපවිචාර ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මය යැයි මෙය වදාරන ලදී. කවරක් අරබයා මෙය වදාරන ලද්දේ ද? ඇසින් රූපයක් දැක සෝමනස්සයට (සතුටට) හේතුවන රූපයකට මනසින් පිවිසේ (ක්‍රියා කරයි), දෝමනස්සයට (දුකට) හේතුවන රූපයකට මනසින් පිවිසේ, උපේක්ෂාවට හේතුවන රූපයකට මනසින් පිවිසේ. කනෙන් ශබ්දයක් අසා... නාසයෙන් ගන්ධයක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් ස්පර්ශයක් දැන... මනසින් ධර්මයක් (සිතට ගන්නා දෙයක්) දැනගෙන, සෝමනස්සයට හේතුවන ධර්මයකට මනසින් පිවිසේ, දෝමනස්සයට හේතුවන ධර්මයකට මනසින් පිවිසේ, උපේක්ෂාවට හේතුවන ධර්මයකට මනසින් පිවිසේ. “මේ අටළොස් මනෝපවිචාර ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මය යැයි යමක් වදාළේ ද, එය මේ කරුණ අරබයා වදාළේ ය.\n\n“මේ ආර්ය සත්‍ය සතර ය”යි මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහ ප්‍රඥාවන්තයන් විසින් නිග්‍රහ නොකරන ලද, කිලිටි නොකරන ලද, දොස් නොකියන ලද, ප්‍රතික්ෂේප නොකරන ලද ධර්මය යැයි මෙය වදාරන ලදී. කවරක් අරබයා මෙය වදාරන ලද්දේ ද? මහණෙනි, ධාතු සය මුල් කොට ගෙන ගර්භයකට ඇතුළු වීම (ප්‍රතිසන්ධිය) සිදු වේ. ඇතුළු වීම තිබෙන කල්හි නාමරූපය (පවතී), නාමරූපය ප්‍රත්‍යයෙන් සළායතනය (ඇස, කන ආදිය) පවතී, සළායතනය ප්‍රත්‍යයෙන් ස්පර්ශය පවතී, ස්පර්ශය ප්‍රත්‍යයෙන් වේදනාව පවතී. මහණෙනි, වේදනා විඳින්නහුට මම 'මෙය දුක ය' කියා දේශනා කරමි, 'මෙය දුක හට ගැනීම ය' කියා දේශනා කරමි, 'මෙය දුක නැති කිරීම ය' කියා දේශනා කරමි, 'මෙය දුක නැති කිරීම පිණිස ඇති පිළිවෙත ය' කියා දේශනා කරමි. මහණෙනි, දුක්ඛ ආර්ය සත්‍යය කවරේ ද? ඉපදීම ද දුකකි, ජරාව (දිරා යෑම) ද දුකකි, ව්‍යාධිය (රෝගී බව) ද දුකකි, මරණය ද දුකකි, ශෝකය, වැළපීම, කායික දුක, දෝමනස්සය (මානසික දුක) සහ සුසුම්ලෑම ද දුකකි. අප්‍රිය දේ සමඟ එක්වීම ද දුකකි, ප්‍රිය දේ වෙන් වීම ද දුකකි, යම් දෙයක් පතන්නේ ද එය නොලැබීම ද දුකකි. කෙටියෙන් කියතොත්, පංච උපාදානස්කන්ධයෝ ම දුක වෙත්.\n\nභික්ෂූන් වහන්ස, මෙය දුක පිළිබඳ ආර්‍ය්‍ය සත්‍යය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දුකට හේතු වන ආර්‍ය්‍ය සත්‍යය කවරේද? අවිද්‍යාව හේතු කොට ගෙන සංස්කාර ඇති වේ. සංස්කාර හේතු කොට ගෙන විඥානය ඇති වේ. විඥානය හේතු කොට ගෙන නාමරූපය ඇති වේ. නාමරූපය හේතු කොට ගෙන සළායතනය ඇති වේ. සළායතනය හේතු කොට ගෙන ස්පර්ශය ඇති වේ. ස්පර්ශය හේතු කොට ගෙන වේදනාව ඇති වේ. වේදනාව හේතු කොට ගෙන තණ්හාව ඇති වේ. තණ්හාව හේතු කොට ගෙන උපාදානය ඇති වේ. උපාදානය හේතු කොට ගෙන භවය ඇති වේ. භවය හේතු කොට ගෙන ජාතිය ඇති වේ. ජාතිය හේතු කොට ගෙන ජරාව, මරණය, ශෝකය, වැළපීම, දුක, දොම්නස සහ දැඩි වෙහෙස හටගනී. මේ ආකාරයට මේ සියලු දුක් සමූහයේ හටගැනීම සිදු වේ. භික්ෂූන් වහන්ස, මෙය දුකට හේතු වන ආර්‍ය්‍ය සත්‍යය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දුක්ඛ නිරෝධය පිළිබඳ ආර්‍ය්‍ය සත්‍යය කවරේද? අවිද්‍යාව මුළුමනින්ම (අශේෂව) නොඇල්මෙන් නිරුද්ධ කිරීමෙන් සංස්කාර නිරුද්ධ වේ. සංස්කාර නිරුද්ධ වීමෙන් විඥානය නිරුද්ධ වේ. විඥානය නිරුද්ධ වීමෙන් නාමරූපය නිරුද්ධ වේ. නාමරූපය නිරුද්ධ වීමෙන් සළායතනය නිරුද්ධ වේ. සළායතනය නිරුද්ධ වීමෙන් ස්පර්ශය නිරුද්ධ වේ. ස්පර්ශය නිරුද්ධ වීමෙන් වේදනාව නිරුද්ධ වේ. වේදනාව නිරුද්ධ වීමෙන් තණ්හාව නිරුද්ධ වේ. තණ්හාව නිරුද්ධ වීමෙන් උපාදානය නිරුද්ධ වේ. උපාදානය නිරුද්ධ වීමෙන් භවය නිරුද්ධ වේ. භවය නිරුද්ධ වීමෙන් ජාතිය නිරුද්ධ වේ. ජාතිය නිරුද්ධ වීමෙන් ජරාව, මරණය, ශෝකය, වැළපීම, දුක, දොම්නස සහ දැඩි වෙහෙස නිරුද්ධ වේ. මේ ආකාරයට මේ සියලු දුක් සමූහයේ නිරෝධය (නැති වීම) සිදු වේ. භික්ෂූන් වහන්ස, මෙය දුක්ඛ නිරෝධය පිළිබඳ ආර්‍ය්‍ය සත්‍යය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දුක්ඛ නිරෝධය කරා ගමන් කරන ප්‍රතිපදාව පිළිබඳ ආර්‍ය්‍ය සත්‍යය කවරේද? ඒ නම් මේ ආර්‍ය්‍ය අෂ්ටාංගික මාර්ගයම ය. එනම්: සම්මාදිට්ඨි (නිවැරදි දැක්ම), සම්මාසංකප්පෝ (නිවැරදි කල්පනාව), සම්මාවාචා (නිවැරදි වචනය), සම්මාකම්මන්තෝ (නිවැරදි ක්‍රියාව), සම්මාආජීවෝ (නිවැරදි ජීවනෝපාය), සම්මාවායාමෝ (නිවැරදි උත්සාහය), සම්මාසති (නිවැරදි සිහිය), සම්මාසමාධි (නිවැරදි සමාධිය) යි. භික්ෂූන් වහන්ස, මෙය දුක්ඛ නිරෝධය කරා ගමන් කරන ප්‍රතිපදාව පිළිබඳ ආර්‍ය්‍ය සත්‍යය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ‘මේවා සතර ආර්‍ය්‍ය සත්‍යයෝ ය’ යි මා විසින් දේශනා කරන ලද ධර්මය ශ්‍රමණ බ්‍රාහ්මණයන් විසින් හෝ නුවණැත්තන් විසින් හෝ නිග්‍රහ නොකළ හැකි, කිළුටු නොකළ හැකි, දෝෂාරෝපණය නොකළ හැකි, ප්‍රතික්ෂේප නොකළ හැකි ධර්මයකි. යම් කරුණක් කියන ලද්දේ ද, ඒ කරුණ මේ නිදර්ශනය අනුවම කියන ලද්දකි.",
      "paliTitle": "Titthāyatanādisuttaṃ"
    },
    {
      "number": 63,
      "pali": "‘‘Tīṇimāni, bhikkhave, amātāputtikāni bhayānīti assutavā puthujjano bhāsati. Katamāni tīṇi? Hoti so, bhikkhave, samayo yaṃ mahāaggiḍāho vuṭṭhāti. Mahāaggiḍāhe kho pana, bhikkhave, vuṭṭhite tena gāmāpi ḍayhanti nigamāpi ḍayhanti nagarāpi ḍayhanti. Gāmesupi ḍayhamānesu nigamesupi ḍayhamānesu nagaresupi ḍayhamānesu tattha mātāpi puttaṃ nappaṭilabhati, puttopi mātaraṃ nappaṭilabhati. Idaṃ, bhikkhave, paṭhamaṃ amātāputtikaṃ bhayanti assutavā puthujjano bhāsati. ‘‘Puna caparaṃ, bhikkhave, hoti so samayo yaṃ mahāmegho vuṭṭhāti. Mahāmeghe kho pana, bhikkhave, vuṭṭhite mahāudakavāhako sañjāyati. Mahāudakavāhake kho pana, bhikkhave, sañjāyante tena gāmāpi vuyhanti nigamāpi vuyhanti nagarāpi vuyhanti. Gāmesupi vuyhamānesu nigamesupi vuyhamānesu nagaresupi vuyhamānesu tattha mātāpi puttaṃ nappaṭilabhati, puttopi mātaraṃ nappaṭilabhati. Idaṃ, bhikkhave, dutiyaṃ amātāputtikaṃ bhayanti assutavā puthujjano bhāsati. ‘‘Puna caparaṃ, bhikkhave, hoti so samayo yaṃ bhayaṃ hoti aṭavisaṅkopo, cakkasamāruḷhā jānapadā pariyāyanti. Bhaye kho pana, bhikkhave, sati aṭavisaṅkope cakkasamāruḷhesu jānapadesu pariyāyantesu tattha mātāpi puttaṃ nappaṭilabhati, puttopi mātaraṃ nappaṭilabhati. Idaṃ, bhikkhave, tatiyaṃ amātāputtikaṃ bhayanti assutavā puthujjano bhāsati. Imāni kho, bhikkhave, tīṇi amātāputtikāni bhayānīti assutavā puthujjano bhāsati. ‘‘Tāni kho panimāni [imāni kho (sī.), imāni kho pana (ka.)], bhikkhave, tīṇi samātāputtikāniyeva bhayāni amātāputtikāni bhayānīti assutavā puthujjano bhāsati. Katamāni tīṇi? Hoti so, bhikkhave, samayo yaṃ mahāaggiḍāho vuṭṭhāti. Mahāaggiḍāhe kho pana, bhikkhave, vuṭṭhite tena gāmāpi ḍayhanti nigamāpi ḍayhanti nagarāpi ḍayhanti. Gāmesupi ḍayhamānesu nigamesupi ḍayhamānesu nagaresupi ḍayhamānesu hoti so samayo yaṃ kadāci karahaci mātāpi puttaṃ paṭilabhati, puttopi mātaraṃ paṭilabhati. Idaṃ, bhikkhave, paṭhamaṃ samātāputtikaṃyeva bhayaṃ amātāputtikaṃ bhayanti assutavā puthujjano bhāsati. ‘‘Puna caparaṃ, bhikkhave, hoti so samayo yaṃ mahāmegho vuṭṭhāti. Mahāmeghe kho pana, bhikkhave, vuṭṭhite mahāudakavāhako sañjāyati. Mahāudakavāhake kho pana, bhikkhave, sañjāte tena gāmāpi vuyhanti nigamāpi vuyhanti nagarāpi vuyhanti. Gāmesupi vuyhamānesu nigamesupi vuyhamānesu nagaresupi vuyhamānesu hoti so samayo yaṃ kadāci karahaci mātāpi puttaṃ paṭilabhati, puttopi mātaraṃ paṭilabhati. Idaṃ, bhikkhave, dutiyaṃ samātāputtikaṃyeva bhayaṃ amātāputtikaṃ bhayanti assutavā puthujjano bhāsati. ‘‘Puna caparaṃ, bhikkhave, hoti so samayo yaṃ bhayaṃ hoti aṭavisaṅkopo, cakkasamāruḷhā jānapadā pariyāyanti. Bhaye kho pana, bhikkhave, sati aṭavisaṅkope cakkasamāruḷhesu jānapadesu pariyāyantesu hoti so samayo yaṃ kadāci karahaci mātāpi puttaṃ paṭilabhati, puttopi mātaraṃ paṭilabhati. Idaṃ, bhikkhave, tatiyaṃ samātāputtikaṃyeva bhayaṃ amātāputtikaṃ bhayanti assutavā puthujjano bhāsati. ‘‘Imāni kho, bhikkhave, tīṇi samātāputtikāniyeva bhayāni amātāputtikāni bhayānīti assutavā puthujjano bhāsati’’. ‘‘Tīṇimāni, bhikkhave, amātāputtikāni bhayāni. Katamāni tīṇi? Jarābhayaṃ, byādhibhayaṃ, maraṇabhayanti. Na, bhikkhave, mātā puttaṃ jīramānaṃ evaṃ labhati – ‘ahaṃ jīrāmi, mā me putto jīrī’ti; putto vā pana mātaraṃ jīramānaṃ na evaṃ labhati – ‘ahaṃ jīrāmi, mā me mātā jīrī’’’ti. ‘‘Na, bhikkhave, mātā puttaṃ byādhiyamānaṃ evaṃ labhati – ‘ahaṃ byādhiyāmi, mā me putto byādhiyī’ti; putto vā pana mātaraṃ byādhiyamānaṃ na evaṃ labhati – ‘ahaṃ byādhiyāmi, mā me mātā byādhiyī’’’ti. ‘‘Na, bhikkhave, mātā puttaṃ mīyamānaṃ evaṃ labhati – ‘ahaṃ mīyāmi, mā me putto mīyī’ti; putto vā pana mātaraṃ mīyamānaṃ na evaṃ labhati – ‘ahaṃ mīyāmi, mā me mātā mīyī’ti. Imāni kho, bhikkhave, tīṇi amātāputtikāni bhayānī’’ti. ‘‘Atthi, bhikkhave, maggo atthi paṭipadā imesañca tiṇṇaṃ samātāputtikānaṃ bhayānaṃ imesañca tiṇṇaṃ amātāputtikānaṃ bhayānaṃ pahānāya samatikkamāya saṃvattati. Katamo ca, bhikkhave, maggo katamā ca paṭipadā imesañca tiṇṇaṃ samātāputtikānaṃ bhayānaṃ imesañca tiṇṇaṃ amātāputtikānaṃ bhayānaṃ pahānāya samatikkamāya saṃvattati? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi, sammāsaṅkapo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. Ayaṃ kho, bhikkhave, maggo ayaṃ paṭipadā imesañca tiṇṇaṃ samātāputtikānaṃ bhayānaṃ imesañca tiṇṇaṃ amātāputtikānaṃ bhayānaṃ pahānāya samatikkamāya saṃvattatī’’ti. Dutiyaṃ.",
      "english": "“Monks, the uninstructed ordinary person speaks of these three fears as those where mother and son cannot help each other. Which three?\n\nMonks, there comes a time when a great conflagration breaks out. When that great conflagration breaks out, monks, villages are burned, townships are burned, and cities are burned. When villages, townships, and cities are burning, neither can a mother find her son, nor can a son find his mother there. Monks, the uninstructed ordinary person speaks of this as the first fear where mother and son cannot help each other.\n\nFurthermore, monks, there comes a time when a great rain cloud bursts forth. When that great rain cloud bursts forth, monks, a great rush of water arises. When that great rush of water arises, monks, villages are swept away, townships are swept away, and cities are swept away. When villages, townships, and cities are being swept away, neither can a mother find her son, nor can a son find his mother there. Monks, the uninstructed ordinary person speaks of this as the second fear where mother and son cannot help each other.\n\nFurthermore, monks, there comes a time when there is fear due to upheaval in the wilderness, and the people of the country scatter, having mounted their vehicles. When there is this fear, monks, due to the upheaval in the wilderness, and the people of the country scatter in their vehicles, neither can a mother find her son, nor can a son find his mother there. Monks, the uninstructed ordinary person speaks of this as the third fear where mother and son cannot help each other. Monks, the uninstructed ordinary person speaks of these three fears as those where mother and son cannot help each other.\n\nBut monks, the uninstructed ordinary person speaks of these three fears, which are actually fears where mother and son *can* help each other, calling them fears where mother and son cannot help each other. Which three?\n\nMonks, there comes a time when a great conflagration breaks out. When that great conflagration breaks out, monks, villages are burned, townships are burned, and cities are burned. When villages, townships, and cities are burning, there comes a time when occasionally, a mother finds her son, and a son finds his mother. Monks, the uninstructed ordinary person speaks of this as the first fear where mother and son can help each other, calling it a fear where they cannot help each other.\n\nFurthermore, monks, there comes a time when a great rain cloud bursts forth. When that great rain cloud bursts forth, monks, a great rush of water arises. When that great rush of water arises, monks, villages are swept away, townships are swept away, and cities are swept away. When villages, townships, and cities are being swept away, there comes a time when occasionally, a mother finds her son, and a son finds his mother. Monks, the uninstructed ordinary person speaks of this as the second fear where mother and son can help each other, calling it a fear where they cannot help each other.\n\nFurthermore, monks, there comes a time when there is fear due to upheaval in the wilderness, and the people of the country scatter, having mounted their vehicles. When there is this fear, monks, due to the upheaval in the wilderness, and the people of the country scatter in their vehicles, there comes a time when occasionally, a mother finds her son, and a son finds his mother. Monks, the uninstructed ordinary person speaks of this as the third fear where mother and son can help each other, calling it a fear where they cannot help each other.\n\nMonks, the uninstructed ordinary person speaks of these three fears as those where mother and son can help each other, calling them fears where mother and son cannot help each other.\n\nMonks, there are three fears where mother and son truly cannot help each other. Which three? The fear of aging, the fear of sickness, and the fear of death.\n\nMonks, a mother whose son is aging cannot achieve this: ‘Let me age, but may my son not age.’ Nor can a son whose mother is aging achieve this: ‘Let me age, but may my mother not age.’\n\nMonks, a mother whose son is falling ill cannot achieve this: ‘Let me become sick, but may my son not become sick.’ Nor can a son whose mother is falling ill achieve this: ‘Let me become sick, but may my mother not become sick.’\n\nMonks, a mother whose son is dying cannot achieve this: ‘Let me die, but may my son not die.’ Nor can a son whose mother is dying achieve this: ‘Let me die, but may my mother not die.’ Monks, these truly are the three fears where mother and son cannot help each other.\n\nMonks, there is a path, there is a practice that leads to the abandoning and transcendence of these three fears where mother and son can help each other, and these three fears where mother and son cannot help each other. And what, monks, is that path, what is that practice that leads to the abandoning and transcendence of these three fears where mother and son can help each other, and these three fears where mother and son cannot help each other?\n\nThis Noble Eightfold Path is this, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This path, monks, this practice, is conducive to the abandoning and transcending of these three dangers associated with having parents and these three dangers not associated with having parents.",
      "sinhala": "\"මහණෙනි, අශ්‍රැතවත් පෘථග්ජනයා මේවා මවටත්, පුතාටත් පිහිට විය නොහැකි (අමාතාපුත්තික) භය තුනක් යයි කියයි. ඒ තුන කවරේද? මහණෙනි, මහත් වූ ගිනි දැල් නැගී සිටින කාලයක් වෙයි. මහණෙනි, ඒ මහත් ගිනි දැල් නැගී සිටි කල්හි ඒ කරුණෙන් ගම් ද දැවී යයි, නියම්ගම් ද දැවී යයි, නගර ද දැවී යයි. ගම් ද දැවෙමින් තිබියදී, නියම්ගම් ද දැවෙමින් තිබියදී, නගර ද දැවෙමින් තිබියදී, එහිදී මවට පුතා ද, පුතාට මව ද සොයාගත නොහැකි වෙයි. මහණෙනි, මේ පළමුවන අමාතාපුත්තික භය යයි අශ්‍රැතවත් පෘථග්ජනයා කියයි.\n\nතවද මහණෙනි, මහත් වූ වැසි වලා නැගී සිටින කාලයක් වෙයි. මහණෙනි, මහත් වැසි වලා නැගී සිටි කල්හි මහත් වූ ජල ධාරාවක් ඇති වෙයි. මහණෙනි, ඒ මහත් වූ ජල ධාරාව ඇති වෙද්දී, ඒ කරුණෙන් ගම් ද ගසාගෙන යයි, නියම්ගම් ද ගසාගෙන යයි, නගර ද ගසාගෙන යයි. ගම් ද ගසාගෙන යමින් තිබියදී, නියම්ගම් ද ගසාගෙන යමින් තිබියදී, නගර ද ගසාගෙන යමින් තිබියදී, එහිදී මවට පුතා ද, පුතාට මව ද සොයාගත නොහැකි වෙයි. මහණෙනි, මේ දෙවැනි අමාතාපුත්තික භය යයි අශ්‍රැතවත් පෘථග්ජනයා කියයි.\n\nතවද මහණෙනි, වන සංකෝචනය (කැලෑ කැළඹීම) නම් භීතිය ඇති වන කාලයක් වෙයි, රථවලට නැගගත් ජනපදවාසීහු තැන තැන සැරිසරති. මහණෙනි, භීතිය ඇති කල්හි, වන සංකෝචනය ඇති කල්හි, රථවලට නැගගත් ජනපදවාසීහු තැන තැන සැරිසරද්දී, එහිදී මවට පුතා ද, පුතාට මව ද සොයාගත නොහැකි වෙයි. මහණෙනි, මේ තෙවැනි අමාතාපුත්තික භය යයි අශ්‍රැතවත් පෘථග්ජනයා කියයි. මහණෙනි, අශ්‍රැතවත් පෘථග්ජනයා මේ භය තුන අමාතාපුත්තික භය යයි කියයි.\n\nමහණෙනි, එහෙත් අශ්‍රැතවත් පෘථග්ජනයා මේ භය තුන අමාතාපුත්තික භය යයි කීවද, ඇත්තෙන්ම මේවා සමතාපුත්තික භය (මවට පුතාවත්, පුතාට මව වත් සොයාගත හැකි භය) යි. ඒ තුන කවරේද? මහණෙනි, මහත් ගිනි දැල් නැගී සිටින කාලයක් වෙයි. මහණෙනි, ඒ මහත් ගිනි දැල් නැගී සිටි කල්හි ඒ කරුණෙන් ගම් ද දැවී යයි, නියම්ගම් ද දැවී යයි, නගර ද දැවී යයි. ගම් ද දැවෙමින් තිබියදී, නියම්ගම් ද දැවෙමින් තිබියදී, නගර ද දැවෙමින් තිබියදී, යම්කිසි කලෙක කලාතුරකින් මවට පුතා ද, පුතාට මව ද සොයාගත හැකි වන කාලයක් වෙයි. මහණෙනි, මේ පළමුවන සමතාපුත්තික භය වුවද, අශ්‍රැතවත් පෘථග්ජනයා මෙය අමාතාපුත්තික භය යයි කියයි.\n\nතවද මහණෙනි, මහත් වූ වැසි වලා නැගී සිටින කාලයක් වෙයි. මහණෙනි, මහත් වැසි වලා නැගී සිටි කල්හි මහත් වූ ජල ධාරාවක් ඇති වෙයි. මහණෙනි, ඒ මහත් වූ ජල ධාරාව ඇති වෙද්දී, ඒ කරුණෙන් ගම් ද ගසාගෙන යයි, නියම්ගම් ද ගසාගෙන යයි, නගර ද ගසාගෙන යයි. ගම් ද ගසාගෙන යමින් තිබියදී, නියම්ගම් ද ගසාගෙන යමින් තිබියදී, නගර ද ගසාගෙන යමින් තිබියදී, යම්කිසි කලෙක කලාතුරකින් මවට පුතා ද, පුතාට මව ද සොයාගත හැකි වන කාලයක් වෙයි. මහණෙනි, මේ දෙවැනි සමතාපුත්තික භය වුවද, අශ්‍රැතවත් පෘථග්ජනයා මෙය අමාතාපුත්තික භය යයි කියයි.\n\nතවද මහණෙනි, වන සංකෝචනය නම් භීතිය ඇති වන කාලයක් වෙයි, රථවලට නැගගත් ජනපදවාසීහු තැන තැන සැරිසරති. මහණෙනි, භීතිය ඇති කල්හි, වන සංකෝචනය ඇති කල්හි, රථවලට නැගගත් ජනපදවාසීහු සැරිසරද්දී, යම්කිසි කලෙක කලාතුරකින් මවට පුතා ද, පුතාට මව ද සොයාගත හැකි වන කාලයක් වෙයි. මහණෙනි, මේ තෙවැනි සමතාපුත්තික භය වුවද, අශ්‍රැතවත් පෘථග්ජනයා මෙය අමාතාපුත්තික භය යයි කියයි.\n\nමහණෙනි, මේවා ඇත්තෙන්ම සමතාපුත්තික භය වුවත්, අශ්‍රැතවත් පෘථග්ජනයා මේ භය තුන අමාතාපුත්තික භය යයි කියයි.\n\nමහණෙනි, ඇත්තෙන්ම මේ භය තුනක් අමාතාපුත්තික භයෝ ය. ඒ තුන කවරේද? ජරා භය, ව්‍යාධි භය, මරණ භය යි. මහණෙනි, මව වුවද තමන්ගේ පුතා දිරාපත් වෙද්දී, ‘මම දිරාපත් වෙමි, මාගේ පුතා දිරාපත් නොවී වා!’ යි පතන්නට නොලබයි; පුතා වුවද මව දිරාපත් වෙද්දී, ‘මම දිරාපත් වෙමි, මාගේ මව දිරාපත් නොවී වා!’ යි පතන්නට නොලබයි.\n\nමහණෙනි, මව වුවද තමන්ගේ පුතා රෝගී වෙද්දී, ‘මම රෝගී වෙමි, මාගේ පුතා රෝගී නොවී වා!’ යි පතන්නට නොලබයි; පුතා වුවද මව රෝගී වෙද්දී, ‘මම රෝගී වෙමි, මාගේ මව රෝගී නොවී වා!’ යි පතන්නට නොලබයි.\n\nමහණෙනි, මව වුවද තමන්ගේ පුතා මිය යද්දී, ‘මම මිය යමි, මාගේ පුතා මිය නොගී වා!’ යි පතන්නට නොලබයි; පුතා වුවද මව මිය යද්දී, ‘මම මිය යමි, මාගේ මව මිය නොගී වා!’ යි පතන්නට නොලබයි. මහණෙනි, මේවා ඇත්තෙන්ම අමාතාපුත්තික භය තුන යි.\n\nමහණෙනි, මේ සමතාපුත්තික භය තුන ද, මේ අමාතාපුත්තික භය තුන ද ප්‍රහාණය කිරීම පිණිසත්, ඒවා ඉක්මවා යෑම පිණිසත් මාර්ගයක් ඇත, පිළිවෙතක් ඇත. මහණෙනි, මේ සමතාපුත්තික භය තුන ද, මේ අමාතාපුත්තික භය තුන ද ප්‍රහාණය කිරීම පිණිසත්, ඉක්මවා යෑම පිණිසත් හේතු වන ඒ මාර්ගය කවරේද? ඒ පිළිවෙත කවරේද?\n\nමේමයි ආර්ය අෂ්ටාංගික මාර්ගය. එනම්: සම්මාදිට්ඨි, සම්මාසංකප්පෝ, සම්මාවාචා, සම්මාකම්මන්තෝ, සම්මාආජීවෝ, සම්මාවායාමෝ, සම්මාසති, සම්මාසමාධි යි.\n\nමහණෙනි, මේ මාර්ගය, මේ පිළිවෙත මවටත් පුත්‍රයාටත් පොදු වූ ඒ තුන් බියද, මවටත් පුත්‍රයාටත් පොදු නොවූ ඒ තුන් බියද ප්‍රෟහාණය කිරීම පිණිසත්, ඉක්මවා යෑම පිණිසත් පවතින්නේය. දෙවෙනි (වර්ගය) යි.",
      "paliTitle": ""
    },
    {
      "number": 64,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena venāgapuraṃ nāma kosalānaṃ brāhmaṇagāmo tadavasari. Assosuṃ kho venāgapurikā brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito venāgapuraṃ anuppatto. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti [bhagavā (sī. syā kaṃ. pī.) idaṃ suttavaṇṇanāya aṭṭhakathāya saṃsandetabbaṃ pārā. 1; dī. ni. 1.255 passitabbaṃ]. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti. Atha kho venāgapurikā brāhmaṇagahapatikā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu, appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu, appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu, appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu, appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho venāgapuriko vacchagotto brāhmaṇo bhagavantaṃ etadavoca – ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāvañcidaṃ bhoto gotamassa vippasannāni indriyāni, parisuddho chavivaṇṇo pariyodāto. Seyyathāpi, bho gotama, sāradaṃ badarapaṇḍuṃ [maṇḍaṃ (ka.)] parisuddhaṃ hoti pariyodātaṃ; evamevaṃ bhoto gotamassa vippasannāni indriyāni parisuddho chavivaṇṇo pariyodāto. Seyyathāpi, bho gotama, tālapakkaṃ sampati bandhanā pamuttaṃ [muttaṃ (sī. pī. ka.)] parisuddhaṃ hoti pariyodātaṃ; evamevaṃ bhoto gotamassa vippasannāni indriyāni parisuddho chavivaṇṇo pariyodāto. Seyyathāpi, bho gotama, nekkhaṃ [nikkhaṃ-itipi (ma. ni. 3.168)] jambonadaṃ dakkhakammāraputtasuparikammakataṃ ukkāmukhe sukusalasampahaṭṭhaṃ paṇḍukambale nikkhittaṃ bhāsate ca tapate ca virocati ca; evamevaṃ bhoto gotamassa vippasannāni indriyāni parisuddho chavivaṇṇo pariyodāto. Yāni tāni, bho gotama, uccāsayanamahāsayanāni, seyyathidaṃ – āsandi pallaṅko gonako cittako paṭikā paṭalikā tūlikā vikatikā uddalomī ekantalomī kaṭṭissaṃ koseyyaṃ kuttakaṃ hatthattharaṃ assattharaṃ rathattharaṃ ajinappaveṇī kadalimigapavarapaccattharaṇaṃ [kādalimigapavarapaccattharaṇaṃ (sī.)] sauttaracchadaṃ ubhatolohitakūpadhānaṃ, evarūpānaṃ nūna bhavaṃ gotamo uccāsayanamahāsayanānaṃ nikāmalābhī akicchalābhī akasiralābhī’’ti. ‘‘Yāni kho pana tāni, brāhmaṇa, uccāsayanamahāsayanāni, seyyathidaṃ – āsandi pallaṅko gonako cittako paṭikā paṭalikā tūlikā vikatikā uddalomī ekantalomī kaṭṭissaṃ koseyyaṃ kuttakaṃ hatthattharaṃ assattharaṃ rathattharaṃ ajinappaveṇī kadalimigapavarapaccattharaṇaṃ sauttaracchadaṃ ubhatolohitakūpadhānaṃ. Dullabhāni tāni pabbajitānaṃ laddhā ca pana [laddhāni ca (sī. syā. kaṃ.), laddhā ca (pī.)] na kappanti. ‘‘Tīṇi kho, imāni, brāhmaṇa, uccāsayanamahāsayanāni, yesāhaṃ etarahi nikāmalābhī akicchalābhī akasiralābhī. Katamāni tīṇi? Dibbaṃ uccāsayanamahāsayanaṃ, brahmaṃ uccāsayanamahāsayanaṃ, ariyaṃ uccāsayanamahāsayanaṃ. Imāni kho, brāhmaṇa, tīṇi uccāsayanamahāsayanāni, yesāhaṃ etarahi nikāmalābhī akicchalābhī akasiralābhī’’ti. ‘‘Katamaṃ pana taṃ, bho gotama, dibbaṃ uccāsayanamahāsayanaṃ, yassa bhavaṃ gotamo etarahi nikāmalābhī akicchalābhī akasiralābhī’’ti? ‘‘Idhāhaṃ, brāhmaṇa, yaṃ gāmaṃ vā nigamaṃ vā upanissāya viharāmi, so pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisāmi. So pacchābhattaṃ piṇḍapātapaṭikkanto vanantaññeva pavisāmi [pacārayāmi (sī. syā. kaṃ.)]. So yadeva tattha honti tiṇāni vā paṇṇāni vā tāni ekajjhaṃ saṅgharitvā nisīdāmi pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi; vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi; pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi; sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharāmi. So ce ahaṃ, brāhmaṇa, evaṃbhūto caṅkamāmi, dibbo me eso tasmiṃ samaye caṅkamo hoti. So ce ahaṃ, brāhmaṇa, evaṃbhūto tiṭṭhāmi, dibbaṃ me etaṃ tasmiṃ samaye ṭhānaṃ hoti. So ce ahaṃ, brāhmaṇa, evaṃbhūto nisīdāmi, dibbaṃ me etaṃ tasmiṃ samaye āsanaṃ hoti. So ce ahaṃ, brāhmaṇa, evaṃbhūto seyyaṃ kappemi, dibbaṃ me etaṃ tasmiṃ samaye uccāsayanamahāsayanaṃ hoti. Idaṃ kho, brāhmaṇa, dibbaṃ uccāsayanamahāsayanaṃ, yassāhaṃ etarahi nikāmalābhī akicchalābhī akasiralābhī’’ti. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Ko cañño evarūpassa dibbassa uccāsayanamahāsayanassa nikāmalābhī bhavissati akicchalābhī akasiralābhī, aññatra bhotā gotamena! ‘‘Katamaṃ pana taṃ, bho gotama, brahmaṃ uccāsayanamahāsayanaṃ, yassa bhavaṃ gotamo etarahi nikāmalābhī akicchalābhī akasiralābhī’’ti? ‘‘Idhāhaṃ, brāhmaṇa, yaṃ gāmaṃ vā nigamaṃ vā upanissāya viharāmi, so pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisāmi. So pacchābhattaṃ piṇḍapātapaṭikkanto vanantaññeva pavisāmi. So yadeva tattha honti tiṇāni vā paṇṇāni vā tāni ekajjhaṃ saṅgharitvā nisīdāmi pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharāmi, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjhena [abyāpajjhena (sabbattha)] pharitvā viharāmi. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharāmi, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ [catutthiṃ (sī.)], iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjhena pharitvā viharāmi. So ce ahaṃ, brāhmaṇa, evaṃbhūto caṅkamāmi, brahmā me eso tasmiṃ samaye caṅkamo hoti. So ce ahaṃ, brāhmaṇa, evaṃbhūto tiṭṭhāmi…pe… nisīdāmi…pe… seyyaṃ kappemi, brahmaṃ me etaṃ tasmiṃ samaye uccāsayanamahāsayanaṃ hoti. Idaṃ kho, brāhmaṇa, brahmaṃ uccāsayanamahāsayanaṃ, yassāhaṃ etarahi nikāmalābhī akicchalābhī akasiralābhī’’ti. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Ko cañño evarūpassa brahmassa uccāsayanamahāsayanassa nikāmalābhī bhavissati akicchalābhī akasiralābhī, aññatra bhotā gotamena! ‘‘Katamaṃ pana taṃ, bho gotama, ariyaṃ uccāsayanamahāsayanaṃ, yassa bhavaṃ gotamo etarahi nikāmalābhī akicchalābhī akasiralābhī’’ti? ‘‘Idhāhaṃ, brāhmaṇa, yaṃ gāmaṃ vā nigamaṃ vā upanissāya viharāmi, so pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisāmi. So pacchābhattaṃ piṇḍapātapaṭikkanto vanantaññeva pavisāmi. So yadeva tattha honti tiṇāni vā paṇṇāni vā tāni ekajjhaṃ saṅgharitvā nisīdāmi pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So evaṃ jānāmi – ‘rāgo me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo; doso me pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo; moho me pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo’. So ce ahaṃ, brāhmaṇa, evaṃbhūto caṅkamāmi, ariyo me eso tasmiṃ samaye caṅkamo hoti. So ce ahaṃ, brāhmaṇa, evaṃbhūto tiṭṭhāmi…pe… nisīdāmi…pe… seyyaṃ kappemi, ariyaṃ me etaṃ tasmiṃ samaye uccāsayanamahāsayanaṃ hoti. Idaṃ kho, brāhmaṇa, ariyaṃ uccāsayanamahāsayanaṃ, yassāhaṃ etarahi nikāmalābhī akicchalābhī akasiralābhī’’ti. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Ko cañño evarūpassa ariyassa uccāsayanamahāsayanassa nikāmalāmī bhavissati akicchalābhī akasiralābhī, aññatra bhotā gotamena! ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ kho bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti. Tatiyaṃ.",
      "english": "On one occasion, The Blessed One, while wandering on tour through the Kosala country together with a large community of monastics, arrived at the Brahman village of the Kosalans named Venāgapura.\n\nNow the Brahman householders of Venāgapura heard: ‘Truly, good sirs, the ascetic Gotama, the son of the Sakyans, who went forth into homelessness from the Sakyan clan, has arrived at Venāgapura. Moreover, concerning that Venerable Gotama, a good report has spread thus: ‘He is the Blessed One, the Accomplished One, the Perfectly Self-Enlightened One, endowed with knowledge and conduct, the Fortunate One, the Knower of the world, the Unsurpassed Trainer of persons ready to be tamed, the Teacher of gods and humans, the Awakened One, the Blessed One.’ Having understood and directly realized this world—with its gods, Māras, and Brahmas, including the generation of ascetics and Brahmans, and gods and humans—by his own direct knowledge, he proclaims it. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, in spirit and in letter, and he reveals the entirely complete and perfectly purified holy life. It is excellent indeed to see such Accomplished Ones.’\n\nThen the Brahman householders of Venāgapura approached The Blessed One. Having approached, some paid homage to The Blessed One and sat down to one side. Some exchanged friendly greetings and courteous conversation with The Blessed One and sat down to one side. Some, having made the gesture of reverent salutation towards The Blessed One, sat down to one side. Some announced their name and clan and sat down to one side. And some remained silent and sat down to one side.\n\nSeated to one side, the Brahman Vacchagotta of Venāgapura said this to The Blessed One: ‘It is wonderful, good Gotama! It is astounding, good Gotama! How extremely serene are the sense faculties of the Venerable Gotama! How pure and bright is his complexion! Just as, good Gotama, a ripe jujube fruit is perfectly clean and bright, even so are the sense faculties of the Venerable Gotama extremely serene, and his complexion pure and bright. Just as, good Gotama, a ripe palm fruit, freshly released from its stem, is perfectly clean and bright, even so are the sense faculties of the Venerable Gotama extremely serene, and his complexion pure and bright. Just as, good Gotama, a choice gold nugget, skillfully crafted by the son of a master goldsmith and thoroughly refined in a furnace, when laid upon a yellow woolen cloth, shines, blazes, and radiates; even so are the sense faculties of the Venerable Gotama extremely serene, and his complexion pure and bright. Those high and luxurious beds and seats, good Gotama, namely: a long couch, a divan, a goatskin rug with long hair, an embroidered spread, a silk covering, a cotton rug, a plush mattress, a spread embroidered with animal figures, a rug made entirely of goat hair, a rug made of hair from one side, a rug woven with gold or silver threads, a silk rug, a large woolen carpet, an elephant housing, a horse housing, a chariot housing, a rug of antelope hide, a superior deer-hide spread, a couch with a canopy, or a bed with red cushions at both ends—surely the Venerable Gotama is one who obtains such high and luxurious beds and seats readily, without difficulty, and without trouble.’\n\n‘Those high and luxurious beds and seats, Brahman, namely: a long couch, a divan, a goatskin rug with long hair, an embroidered spread, a silk covering, a cotton rug, a plush mattress, a spread embroidered with animal figures, a rug made entirely of goat hair, a rug made of hair from one side, a rug woven with gold or silver threads, a silk rug, a large woolen carpet, an elephant housing, a horse housing, a chariot housing, a rug of antelope hide, a superior deer-hide spread, a couch with a canopy, or a bed with red cushions at both ends—they are difficult for those who have gone forth into homelessness to obtain, and even if they were obtained, they would not be allowable.\n\n‘There are, Brahman, three high and luxurious beds and seats which I presently obtain readily, without difficulty, and without trouble. Which three? The divine high and luxurious bed and seat, the sublime high and luxurious bed and seat, and the noble high and luxurious bed and seat. These, Brahman, are the three high and luxurious beds and seats which I presently obtain readily, without difficulty, and without trouble.’\n\n‘And what, good Gotama, is that divine high and luxurious bed and seat which the Venerable Gotama presently obtains readily, without difficulty, and without trouble?’\n\n‘Here, Brahman, when I dwell near a village or a town, in the forenoon, having dressed myself and taken my bowl and robe, I enter that same village or town for alms. After my meal, having returned from my alms round, I enter a forest grove. Gathering together whatever grasses or leaves are there, I sit down, having folded my legs crosswise, set my body erect, and established mindfulness in front of me.\n\nI, quite secluded from sensual pleasures, secluded from unskillful mental states, enter and abide in the first *jhāna*, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and pleasure. With the calming of initial application and sustained application, I enter and abide in the second *jhāna*, which has internal confidence, unification of mind, is without initial application and sustained application, and is born of concentration, filled with rapture and pleasure. With the fading away of rapture, I abide in equanimity, mindful and clearly comprehending, and I experience pleasure with the body, concerning which the Noble Ones declare: ‘Equanimous, mindful, abiding in pleasure.’ Thus, I enter and abide in the third *jhāna*. With the abandoning of pleasure and the abandoning of pain, and with the previous disappearance of joy and grief, I enter and abide in the fourth *jhāna*, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. Brahmin, when I walk while being in this state, that walking is divine walking for me at that time. Brahmin, when I stand while being in this state, that standing is a divine stance for me at that time. Brahmin, when I sit while being in this state, that sitting is a divine seat for me at that time. Brahmin, when I make a resting posture while being in this state, that resting place is a divine high resting place, a magnificent resting place, for me at that time. This, Brahmin, is the divine high resting place, the magnificent resting place, which I obtain easily, without trouble, and without difficulty.\n\n“It is marvelous, good Gotama, it is wonderful, good Gotama! Who else but the good Gotama would be able to obtain such a divine high resting place, a magnificent resting place, easily, without trouble, and without difficulty? But what, good Gotama, is that Brahma high resting place, that magnificent resting place, which the good Gotama now obtains easily, without trouble, and without difficulty?”\n\n“Brahmin, here, having depended on a certain village or town, I dress in the morning and, taking bowl and robes, enter that same village or town for alms. Having returned from the alms round after the meal, I enter the edge of a forest. There, whatever grasses or leaves are available, I collect them all together and sit down, having folded my legs crosswise, having set my body upright, and having established mindfulness in front of me. I abide pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, around—everywhere, in every way, I abide pervading the entire world with a mind imbued with loving-kindness, vast, exalted, measureless, without hostility, without ill will. I abide pervading one direction with a mind imbued with compassion... I abide pervading one direction with a mind imbued with sympathetic joy... I abide pervading one direction with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus, above, below, around—everywhere, in every way, I abide pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without hostility, without ill will. Brahmin, when I walk while being in this state, that walking is divine-abode walking for me at that time. Brahmin, when I stand while being in this state... when I sit... when I make a resting posture, that resting place is a divine-abode high resting place, a magnificent resting place, for me at that time. This, Brahmin, is the Brahma high resting place, the magnificent resting place, which I obtain easily, without trouble, and without difficulty.”\n\n“It is marvelous, good Gotama, it is wonderful, good Gotama! Who else but the good Gotama would be able to obtain such a Brahma high resting place, a magnificent resting place, easily, without trouble, and without difficulty? But what, good Gotama, is that Noble high resting place, that magnificent resting place, which the good Gotama now obtains easily, without trouble, and without difficulty?”\n\n“Brahmin, here, having depended on a certain village or town, I dress in the morning and, taking bowl and robes, enter that same village or town for alms. Having returned from the alms round after the meal, I enter the edge of a forest. There, whatever grasses or leaves are available, I collect them all together and sit down, having folded my legs crosswise, having set my body upright, and having established mindfulness in front of me. I thus know: ‘My lust is abandoned, rooted out, made like a palm stump, brought to non-existence, unable to arise in the future. My hatred is abandoned, rooted out, made like a palm stump, brought to non-existence, unable to arise in the future. My delusion is abandoned, rooted out, made like a palm stump, brought to non-existence, unable to arise in the future.’ Brahmin, when I walk while being in this state, that walking is Noble walking for me at that time. Brahmin, when I stand while being in this state... when I sit... when I make a resting posture, that resting place is a Noble high resting place, a magnificent resting place, for me at that time. This, Brahmin, is the Noble high resting place, the magnificent resting place, which I obtain easily, without trouble, and without difficulty.”\n\nWonderful, Venerable Gotama, astounding, Venerable Gotama! Who else but the Venerable Gotama would freely, without difficulty, without trouble, obtain such noble high and luxurious resting places?\n\nExcellent, Venerable Gotama, excellent, Venerable Gotama! Just as, Venerable Gotama, one might set upright what was overturned, or reveal what was hidden, or point out the path to one who was lost, or hold up an oil lamp in the darkness so that those with eyes may see forms; even so has the Dhamma been made clear by the Venerable Gotama in manifold ways.\n\nTherefore, we go for refuge to the Venerable Gotama, to the Dhamma, and to the Saṅgha of Monastics. May the Venerable Gotama remember us as lay followers who have gone for refuge from this day forth for as long as life lasts.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මහත් භික්‍ෂුසංඝයා වහන්සේලා සමඟ කෝසල ජනපදයෙහි චාරිකාවේ වඩමින්, කෝසල වැසි බ්‍රාහ්මණ ගමක් වූ වේණාගපුරයට වැඩම කළ සේක.\n\nවේණාගපුර වැසි බ්‍රාහ්මණ ගෘහපතිවරු මෙසේ ඇසූහ: \"භවත්නි, ශාක්‍යපුත්‍ර වූ ශාක්‍ය කුලයෙන් පැවිදි වූ ගෞතම ශ්‍රමණයන් වහන්සේ වේණාගපුරයට වැඩම කොට ඇත. ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳව, 'ඒ භාග්‍යවතුන් වහන්සේ අරහත් වන සේක, සම්මාසම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තර පුරිසදම්මසාරථී වන සේක, දෙවි-මිනිසුන්ට ශාස්තෘ වන සේක, බුද්ධ වන සේක, භාග්‍යවතුන් වන සේක' යි මෙබඳු වූ කල්යාණ කීර්ති ඝෝෂාවක් පැතිර ඇත. උන්වහන්සේ දෙවිවරුන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ-බ්‍රාහ්මණ පිරිස සහිත, දෙවි-මිනිසුන් සහිත මේ ලෝකය තමන් වහන්සේම අභිඥාවෙන් (විශේෂ දැනුමෙන්) අවබෝධ කොට ප්‍රකාශ කරති. උන්වහන්සේ මුලින් කල්යාණ වූ, මැදින් කල්යාණ වූ, කෙළවරින් කල්යාණ වූ, අර්ථ සහිත, ව්‍යංජන (පද සමූහ) සහිත ධර්මය දේශනා කරති. උන්වහන්සේ කේවල වූ, පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව (උතුම් පැවතුම) ප්‍රකාශ කරති. සැබවින්ම එබඳු අරහතුන් වහන්සේලා දැකීම සුදුසු වන්නේය.\"\n\nඉක්බිති වේණාගපුර වැසි බ්‍රාහ්මණ ගෘහපතිවරු භාග්‍යවතුන් වහන්සේ වැඩ සිටින තැනට පැමිණියහ. පැමිණ සමහරු භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙක හිඳ ගත්හ. සමහරු භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වූහ, සතුටු විය යුතු කතා බහත් සිහි කටයුතු කතා බහත් නිමවා එකත්පසෙක හිඳ ගත්හ. සමහරු භාග්‍යවතුන් වහන්සේ දෙසට ඇඳිලි නමා එකත්පසෙක හිඳ ගත්හ. සමහරු තමන්ගේ නම-ගොත් ප්‍රකාශ කොට එකත්පසෙක හිඳ ගත්හ. සමහරු නිශ්ශබ්දව එකත්පසෙක හිඳ ගත්හ.\n\nඑකත්පසෙක හිඳ සිටි වේණාගපුර වැසි වච්ඡගොත්ත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භවත් ගෞතමයන් වහන්ස, ආශ්චර්යයකි! භවත් ගෞතමයන් වහන්ස, අද්භූතයකි! භවත් ගෞතමයන් වහන්සේගේ ඉන්ද්‍රියයන් කොපමණ පැහැපත් (ප්‍රසන්න) වීද! සමේ පැහැය කොතරම් පිරිසිදුද, දීප්තිමත්ද! භවත් ගෞතමයන් වහන්ස, යම් සේ සරත් ඍතුවෙහි ඉදූ බොර දමන ලද වැටකෙයියා ගෙඩියක් ඉතා පිරිසිදුද, දීප්තිමත්ද; එපරිද්දෙන්ම භවත් ගෞතමයන් වහන්සේගේ ඉන්ද්‍රියයන් පැහැපත්ය, සමේ පැහැය පිරිසිදුය, දීප්තිමත්ය. භවත් ගෞතමයන් වහන්ස, යම් සේ දැන් ගසෙන් මුදුන් වූ (බිඳී වැටුණු) තල් ගෙඩියක් ඉතා පිරිසිදුද, දීප්තිමත්ද; එපරිද්දෙන්ම භවත් ගෞතමයන් වහන්සේගේ ඉන්ද්‍රියයන් පැහැපත්ය, සමේ පැහැය පිරිසිදුය, දීප්තිමත්ය. භවත් ගෞතමයන් වහන්ස, යම් සේ දක්‍ෂ කම්මල් පුත‍්‍රයකු විසින් මැනවින් අත්කම් කරන ලද, උණු කිරීමේ උදුනෙහි මැනැවින් පිසින ලද ජම්බු නදී රනින් කළ (නෙක්ඛ) රන් කාසියක්, කහ පැහැති කම්බිලියක් මත තැබූ විට බබළන්නේද, දහදිය දමන්නේද, ප්‍රකාශ වන්නේද; එපරිද්දෙන්ම භවත් ගෞතමයන් වහන්සේගේ ඉන්ද්‍රියයන් පැහැපත්ය, සමේ පැහැය පිරිසිදුය, දීප්තිමත්ය. භවත් ගෞතමයන් වහන්ස, යම් ඒ උස් අසුන් සහ මහ අසුන් ඇද්ද—එනම්: දිග අසුන්ය, පලඟය (දිවන්)ය, ලොම් දිගට ඇති රළු ඇතිරිය, සිත්තම් කළ ඇඳ ඇතිරිය, සළුව, පැතලි ඇතිරිය, පුළුන් මෙට්ට, සත්ව රූප සහිත ඇතිරිය, දෙපස ලොම් ඇති ඇතිරිය, එක් පසෙක ලොම් ඇති ඇතිරිය, සිත්තම් කළ සේද රෙදි, සේද ඇතිරිය, ලොම් සහිත ඇතිරිය, ඇතින් අදින ලද ඇත් ඇතිරිය, අසුන් අදින ලද අස් ඇතිරිය, රථයෙන් අදින ලද රථ ඇතිරිය, මුව සමින් කළ ඇතිරිය, කදළි මෘග සමින් කළ ඇතිරිලි, උඩ ඇතිරියක් සහිතවූද, දෙපැත්ත රතු කොට්ට සහිතවූද ඇඳ ඇතිරිලි—මෙවන් වූ උස් අසුන් හා මහ අසුන් භවත් ගෞතමයන් වහන්සේ කැමති සේ ලබන්නෙක්ය, අපහසුවකින් තොරව ලබන්නෙක්ය, වෙහෙසකින් තොරව ලබන්නෙක්ය.\"\n\n\"බ්‍රාහ්මණය, යම් ඒ උස් අසුන් හා මහ අසුන් ඇද්ද—එනම්: දිග අසුන්ය, පලඟය, ලොම් දිගට ඇති රළු ඇතිරිය, සිත්තම් කළ ඇඳ ඇතිරිය, සළුව, පැතලි ඇතිරිය, පුළුන් මෙට්ට, සත්ව රූප සහිත ඇතිරිය, දෙපස ලොම් ඇති ඇතිරිය, එක් පසෙක ලොම් ඇති ඇතිරිය, සිත්තම් කළ සේද රෙදි, සේද ඇතිරිය, ලොම් සහිත ඇතිරිය, ඇතින් අදින ලද ඇත් ඇතිරිය, අසුන් අදින ලද අස් ඇතිරිය, රථයෙන් අදින ලද රථ ඇතිරිය, මුව සමින් කළ ඇතිරිය, කදළි මෘග සමින් කළ ඇතිරිලි, උඩ ඇතිරියක් සහිතවූද, දෙපැත්ත රතු කොට්ට සහිතවූද ඇඳ ඇතිරිලි—ඒවා පැවිද්දන්ට දුර්ලභය, ලබා ගත්තද ඒවා සුදුසු (කැප) වන්නේ නැත.\n\n\"බ්‍රාහ්මණය, මම මේ වන විට කැමති සේ ලබන, අපහසුවකින් තොරව ලබන, වෙහෙසකින් තොරව ලබන උස් අසුන් හා මහ අසුන් තුනක් ඇත්තේය. ඒ තුන කවරේද? දිව්‍ය උස් අසුන හා මහ අසුන, බ්‍රහ්ම උස් අසුන හා මහ අසුන, ආර්ය උස් අසුන හා මහ අසුන යි. බ්‍රාහ්මණය, මේ උස් අසුන් හා මහ අසුන් තුන, මම මේ වන විට කැමති සේ ලබන, අපහසුවකින් තොරව ලබන, වෙහෙසකින් තොරව ලබන ඒවා වෙති.\"\n\n\"භවත් ගෞතමයන් වහන්ස, එසේ නම් භවත් ගෞතමයන් වහන්සේ මේ වන විට කැමති සේ ලබන, අපහසුවකින් තොරව ලබන, වෙහෙසකින් තොරව ලබන ඒ දිව්‍ය උස් අසුන හා මහ අසුන කවරේද?\"\n\n\"බ්‍රාහ්මණය, මම මෙහි යම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කරමින් වාසය කරම්ද, මම පෙරවරුවේ හැඳ පොරවා පාත්‍ර සිවුරු ගෙන ඒ ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස පිවිසෙමි. මම දහවල් ආහාරයෙන් පසු පිණ්ඩපාතයෙන් නික්ම ගොස් වනාන්තරයටම පිවිසෙමි. එහි යම් තණ කොළ හෝ පත්‍ර (පත්රැ) ඇත්ද, ඒ සියල්ල එක් තැනකට ගොඩ ගසා, පලක් බැඳ, කය ඍජුව තබා, සිහිය ඉදිරියට ගෙන (පිරිසිඳ) පිහිටුවාගෙන හිඳගනිමි.\"\n\nමම කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූද, විචාර සහිත වූද, විවේකයෙන් උපන් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට එළඹ වාසය කරමි; විතර්ක විචාරයන් සංසිඳීමෙන්, අධ්‍යාත්මයෙහි පැහැදීම ඇති, සිතේ එකඟ බව ඇති, විතර්ක රහිත වූද, විචාර රහිත වූද, සමාධියෙන් උපන් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරමි; ප්‍රීතිය කෙරෙහි ද ඇල්ම නැති කිරීමෙන්, උපේක්ෂා සහිතව, සිහි නුවණින් යුතුව වාසය කරමින්, කයින් ද සැපය විඳිමින් (ඒ යම් ධ්‍යානයක්) ආර්යයෝ 'උපේක්ෂා සහිත වූයේ, සිහි ඇතිව, සැප විහරණය ඇත්තේ' යැයි ප්‍රකාශ කෙරෙත් ද, ඒ තෙවන ධ්‍යානයට එළඹ වාසය කරමි; සැපය ද නැති කිරීමෙන්, දුක ද නැති කිරීමෙන්, කලින්ම සෝමනස්ස ද දෝමනස්ස ද අස්තංගත වීමෙන්, දුක් ද නොවන සැප ද නොවන උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට එළඹ වාසය කරමි. බ්‍රාහ්මණය, මම එබඳු භාවනාවකට එළඹ සිටියේ, යම් හෙයකින් සක්මන් කරම් ද, ඒ සක්මන් කිරීම ඒ වේලාවේ මට දිව්‍යමය සක්මන් කිරීමක් වන්නේය. බ්‍රාහ්මණය, යම් හෙයකින් එබඳු භාවනාවකට එළඹ සිටියේ මම සිටිම් ද, ඒ සිටීම ඒ වේලාවේ මට දිව්‍යමය සිටීමක් වන්නේය. බ්‍රාහ්මණය, යම් හෙයකින් එබඳු භාවනාවකට එළඹ සිටියේ මම හිඳිම් ද, ඒ හිඳීම ඒ වේලාවේ මට දිව්‍යමය ආසනයක් වන්නේය. බ්‍රාහ්මණය, යම් හෙයකින් එබඳු භාවනාවකට එළඹ සිටියේ මම සයනය කරම් ද, ඒ සයනය ඒ වේලාවේ මට දිව්‍යමය උසස් වූ මහත් සයනයක් වන්නේය. බ්‍රාහ්මණය, මම දැන් කැමති පරිදි ලබන, අපහසුවකින් තොරව ලබන, දුෂ්කරතාවකින් තොරව ලබන දිව්‍යමය උසස් වූ මහත් සයනය නම් මෙයයි.\n\nඅහෝ ගෞතමයන් වහන්සේ! එය ආශ්චර්යයකි, අද්භූතයකි! ගෞතමයන් වහන්සේ හැර වෙන කවරෙක් නම් එබඳු දිව්‍යමය උසස් වූ මහත් සයනයක් කැමති පරිදි ලබන්නේ, අපහසුවකින් තොරව ලබන්නේ, දුෂ්කරතාවකින් තොරව ලබන්නේ ද? එසේ නම් ගෞතමයන් වහන්සේ දැන් කැමති පරිදි ලබන, අපහසුවකින් තොරව ලබන, දුෂ්කරතාවකින් තොරව ලබන බ්‍රහ්මමය උසස් වූ මහත් සයනය කුමක් ද?\n\nබ්‍රාහ්මණය, මේ ශාසනයේ මම යම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කරගෙන වාසය කරම් ද, මම පෙරවරුවේ හැඳ පොරවා පාත්‍ර සිවුරු ගෙන ඒ ගමට හෝ නියම්ගමට හෝ පිඬු සිඟා පිවිසෙමි. මම දානය වැළඳීමෙන් පසු ආපසු හැරී වන දෙසටම පිවිසෙමි. එහි යම් තණකොළ හෝ පත්‍ර හෝ ඇත්නම්, ඒ සියල්ල එකතු කොට, පලක් බැඳ, කය සෘජුව තබා, සිහිය ඉදිරියේ පිහිටුවා හිඳගනිමි. මම මෛත්‍රී සහගත සිතින් යුතුව එක් දිශාවක් පතුරුවා වාසය කරමි, එසේම දෙවැනි දිශාව ද, එසේම තෙවැනි දිශාව ද, එසේම සතරවැනි දිශාව ද පතුරුවා වාසය කරමි. මෙසේ ඉහළ, පහළ, හරහට, සියලු තැන්හි, සියලු අයුරින්, සියලු ලෝකයම වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ මෛත්‍රී සහගත සිතින් යුතුව පතුරුවා වාසය කරමි. කරුණා සහගත සිතින් යුතුව... මුදිතා සහගත සිතින් යුතුව... උපේක්ෂා සහගත සිතින් යුතුව එක් දිශාවක් පතුරුවා වාසය කරමි, එසේම දෙවැනි දිශාව ද, එසේම තෙවැනි දිශාව ද, එසේම සතරවැනි දිශාව ද පතුරුවා වාසය කරමි. මෙසේ ඉහළ, පහළ, හරහට, සියලු තැන්හි, සියලු අයුරින්, සියලු ලෝකයම වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ උපේක්ෂා සහගත සිතින් යුතුව පතුරුවා වාසය කරමි. බ්‍රාහ්මණය, මම එබඳු භාවනාවකට එළඹ සිටියේ, යම් හෙයකින් සක්මන් කරම් ද, ඒ සක්මන් කිරීම ඒ වේලාවේ මට බ්‍රහ්මමය සක්මන් කිරීමක් වන්නේය. බ්‍රාහ්මණය, යම් හෙයකින් එබඳු භාවනාවකට එළඹ සිටියේ මම සිටිම් ද... හිඳිම් ද... සයනය කරම් ද, ඒ සයනය ඒ වේලාවේ මට බ්‍රහ්මමය උසස් වූ මහත් සයනයක් වන්නේය. බ්‍රාහ්මණය, මම දැන් කැමති පරිදි ලබන, අපහසුවකින් තොරව ලබන, දුෂ්කරතාවකින් තොරව ලබන බ්‍රහ්මමය උසස් වූ මහත් සයනය නම් මෙයයි.\n\nඅහෝ ගෞතමයන් වහන්සේ! එය ආශ්චර්යයකි, අද්භූතයකි! ගෞතමයන් වහන්සේ හැර වෙන කවරෙක් නම් එබඳු බ්‍රහ්මමය උසස් වූ මහත් සයනයක් කැමති පරිදි ලබන්නේ, අපහසුවකින් තොරව ලබන්නේ, දුෂ්කරතාවකින් තොරව ලබන්නේ ද? එසේ නම් ගෞතමයන් වහන්සේ දැන් කැමති පරිදි ලබන, අපහසුවකින් තොරව ලබන, දුෂ්කරතාවකින් තොරව ලබන ආර්ය උසස් වූ මහත් සයනය කුමක් ද?\n\nබ්‍රාහ්මණය, මේ ශාසනයේ මම යම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කරගෙන වාසය කරම් ද, මම පෙරවරුවේ හැඳ පොරවා පාත්‍ර සිවුරු ගෙන ඒ ගමට හෝ නියම්ගමට හෝ පිඬු සිඟා පිවිසෙමි. මම දානය වැළඳීමෙන් පසු ආපසු හැරී වන දෙසටම පිවිසෙමි. එහි යම් තණකොළ හෝ පත්‍ර හෝ ඇත්නම්, ඒ සියල්ල එකතු කොට, පලක් බැඳ, කය සෘජුව තබා, සිහිය ඉදිරියේ පිහිටුවා හිඳගනිමි. මම මෙසේ දනිමි: ‘මාගේ රාගය ප්‍රහීණ කර ඇත, මුලින් උදුරා දමා ඇත, තල් ගසක කඳක් මෙන් කර ඇත, නැති කර දමා ඇත, අනාගතයේ නූපදින ස්වභාවයෙන් යුක්තය; මාගේ ද්වේෂය ප්‍රහීණ කර ඇත, මුලින් උදුරා දමා ඇත, තල් ගසක කඳක් මෙන් කර ඇත, නැති කර දමා ඇත, අනාගතයේ නූපදින ස්වභාවයෙන් යුක්තය; මාගේ මෝහය ප්‍රහීණ කර ඇත, මුලින් උදුරා දමා ඇත, තල් ගසක කඳක් මෙන් කර ඇත, නැති කර දමා ඇත, අනාගතයේ නූපදින ස්වභාවයෙන් යුක්තය’ යනුවෙනි. බ්‍රාහ්මණය, මම එබඳු ආර්ය භාවයට එළඹ සිටියේ, යම් හෙයකින් සක්මන් කරම් ද, ඒ සක්මන් කිරීම ඒ වේලාවේ මට ආර්ය සක්මන් කිරීමක් වන්නේය. බ්‍රාහ්මණය, යම් හෙයකින් එබඳු භාවනාවකට එළඹ සිටියේ මම සිටිම් ද... හිඳිම් ද... සයනය කරම් ද, ඒ සයනය ඒ වේලාවේ මට ආර්ය උසස් වූ මහත් සයනයක් වන්නේය. බ්‍රාහ්මණය, මම දැන් කැමති පරිදි ලබන, අපහසුවකින් තොරව ලබන, දුෂ්කරතාවකින් තොරව ලබන ආර්ය උසස් වූ මහත් සයනය නම් මෙයයි.\n\nභවත් ගෞතමයන් වහන්ස, ආශ්චර්ය යි! භවත් ගෞතමයන් වහන්ස, අද්භූත යි! භවත් ගෞතමයන් වහන්සේ හැර, මෙබඳු ආර්ය වූ උස් ආසන, මහා ආසන යමෙක් පහසුවෙන් ලබන්නේ ද, දුකකින් තොරව ලබන්නේ ද, වෙහෙසකින් තොරව ලබන්නේ ද?\n\nභවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, යම් සේ යමෙක් යටිකුරු කරන ලද්දක් උඩුකුරු කරන්නේ ද, වසන ලද්දක් විවෘත කරන්නේ ද, මං මුළා වූවෙකුට මාර්ගය කියන්නේ ද, ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යි අඳුරේ තෙල් පහනක් දරන්නේ ද; එසේම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරණ ලදී.\n\nඅපි ඒ භවත් ගෞතමයන් වහන්සේ ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමු. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි තිබෙන තුරා සරණ ගිය උපාසකයින් ලෙස අපව දරණ සේක්වා! මෙසේ තෙවැනි වරට ද කීහ.",
      "paliTitle": "Venāgapurasuttaṃ"
    },
    {
      "number": 65,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena sarabho nāma paribbājako acirapakkanto hoti imasmā dhammavinayā. So rājagahe parisati [parisatiṃ (sī. pī.)] evaṃ vācaṃ bhāsati – ‘‘aññāto mayā samaṇānaṃ sakyaputtikānaṃ dhammo. Aññāya ca panāhaṃ samaṇānaṃ sakyaputtikānaṃ dhammaṃ evāhaṃ tasmā dhammavinayā apakkanto’’ti. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pavisiṃsu. Assosuṃ kho te bhikkhū sarabhassa paribbājakassa rājagahe parisati evaṃ vācaṃ bhāsamānassa – ‘‘aññāto mayā samaṇānaṃ sakyaputtikānaṃ dhammo. Aññāya ca panāhaṃ samaṇānaṃ sakyaputtikānaṃ dhammaṃ evāhaṃ tasmā dhammavinayā apakkanto’’ti. Atha kho te bhikkhū rājagahe piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘sarabho nāma, bhante, paribbājako acirapakkanto imasmā dhammavinayā. So rājagahe parisati evaṃ vācaṃ bhāsati – ‘aññāto mayā samaṇānaṃ sakyaputtikānaṃ dhammo. Aññāya ca panāhaṃ samaṇānaṃ sakyaputtikānaṃ dhammaṃ evāhaṃ tasmā dhammavinayā apakkanto’ti. Sādhu bhante, bhagavā yena sippinikātīraṃ [sappinikātīraṃ (sī. pī.), sappiniyā tīraṃ (syā. kaṃ.)] paribbājakārāmo yena sarabho paribbājako tenupasaṅkamatu anukampaṃ upādāyā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena sippinikātīraṃ paribbājakārāmo yena sarabho paribbājako tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā sarabhaṃ paribbājakaṃ etadavoca – ‘‘saccaṃ kira tvaṃ, sarabha, evaṃ vadesi – ‘aññāto mayā samaṇānaṃ sakyaputtikānaṃ dhammo. Aññāya ca panāhaṃ samaṇānaṃ sakyaputtikānaṃ dhammaṃ evāhaṃ tasmā dhammavinayā apakkanto’’’ti? Evaṃ vutte sarabho paribbājako tuṇhī ahosi. Dutiyampi kho, bhagavā sarabhaṃ paribbājakaṃ etadavoca – ‘‘vadehi, sarabha, kinti te aññāto samaṇānaṃ sakyaputtikānaṃ dhammo? Sace te aparipūraṃ bhavissati, ahaṃ paripūressāmi. Sace pana te paripūraṃ bhavissati, ahaṃ anumodissāmī’’ti. Dutiyampi kho sarabho paribbājako tuṇhī ahosi. Tatiyampi kho bhagavā sarabhaṃ paribbājakaṃ etadavoca – (‘‘yo [mayā (syā. kaṃ. pī.)] kho sarabha paññāyati samaṇānaṃ sakyaputtikānaṃ dhammo) [( ) sī. potthake natthi] ‘‘vadehi, sarabha, kinti te aññāto samaṇānaṃ sakyaputtikānaṃ dhammo? Sace te aparipūraṃ bhavissati, ahaṃ paripūressāmi. Sace pana te paripūraṃ bhavissati, ahaṃ anumodissāmī’’ti. Tatiyampi kho sarabho paribbājako tuṇhī ahosi. Atha kho te paribbājakā sarabhaṃ paribbājakaṃ etadavocuṃ – ‘‘yadeva kho tvaṃ, āvuso sarabha, samaṇaṃ gotamaṃ yāceyyāsi tadeva te samaṇo gotamo pavāreti. Vadehāvuso sarabha, kinti te aññāto samaṇānaṃ sakyaputtikānaṃ dhammo? Sace te aparipūraṃ bhavissati, samaṇo gotamo paripūressati. Sace pana te paripūraṃ bhavissati, samaṇo gotamo anumodissatī’’ti. Evaṃ vutte sarabho paribbājako tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdi. Atha kho bhagavā sarabhaṃ paribbājakaṃ tuṇhībhūtaṃ maṅkubhūtaṃ pattakkhandhaṃ adhomukhaṃ pajjhāyantaṃ appaṭibhānaṃ viditvā te paribbājake etadavoca – ‘‘Yo kho maṃ, paribbājakā [paribbājako (pī. ka.)], evaṃ vadeyya – ‘sammāsambuddhassa te paṭijānato ime dhammā anabhisambuddhā’ti, tamahaṃ tattha sādhukaṃ samanuyuñjeyyaṃ samanugāheyyaṃ samanubhāseyyaṃ. So vata mayā sādhukaṃ samanuyuñjiyamāno samanugāhiyamāno samanubhāsiyamāno aṭṭhānametaṃ anavakāso yaṃ so tiṇṇaṃ ṭhānānaṃ nāññataraṃ [aññataraṃ (ka.)] ṭhānaṃ nigaccheyya, aññena vā aññaṃ paṭicarissati, bahiddhā kathaṃ apanāmessati, kopañca dosañca appaccayañca pātukarissati, tuṇhībhūto maṅkubhūto [tuṇhībhūto vā maṅkubhūto (sī. syā. kaṃ.), tuṇhībhūto vā maṅkubhūto vā (pī.)] pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdissati, seyyathāpi sarabho paribbājako. ‘‘Yo kho maṃ, paribbājakā, evaṃ vadeyya – ‘khīṇāsavassa te paṭijānato ime āsavā aparikkhīṇā’ti, tamahaṃ tattha sādhukaṃ samanuyuñjeyyaṃ samanugāheyyaṃ samanubhāseyyaṃ. So vata mayā sādhukaṃ samanuyuñjiyamāno samanugāhiyamāno samanubhāsiyamāno aṭṭhānametaṃ anavakāso yaṃ so tiṇṇaṃ ṭhānānaṃ nāññataraṃ ṭhānaṃ nigaccheyya, aññena vā aññaṃ paṭicarissati, bahiddhā kathaṃ apanāmessati, kopañca dosañca appaccayañca pātukarissati, tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdissati, seyyathāpi sarabho paribbājako. ‘‘Yo kho maṃ, paribbājakā, evaṃ vadeyya – ‘yassa kho pana te atthāya dhammo desito, so na niyyāti takkarassa sammā dukkhakkhayāyā’ti, tamahaṃ tattha sādhukaṃ samanuyuñjeyyaṃ samanugāheyyaṃ samanubhāseyyaṃ. So vata mayā sādhukaṃ samanuyuñjiyamāno samanugāhiyamāno samanubhāsiyamāno aṭṭhānametaṃ anavakāso yaṃ so tiṇṇaṃ ṭhānānaṃ nāññataraṃ ṭhānaṃ nigaccheyya, aññena vā aññaṃ paṭicarissati, bahiddhā kathaṃ apanāmessati, kopañca dosañca appaccayañca pātukarissati, tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdissati, seyyathāpi sarabho paribbājako’’ti. Atha kho bhagavā sippinikātīre paribbājakārāme tikkhattuṃ sīhanādaṃ naditvā vehāsaṃ pakkāmi. Atha kho te paribbājakā acirapakkantassa bhagavato sarabhaṃ paribbājakaṃ samantato vācāyasannitodakena [vācāsattitodakena (sī.)] sañjambharimakaṃsu [sañcumbharimakaṃsu (pī., dī. ni. 1.421) saṃ. ni. 2.243 uparipāṭho viya] – ‘‘seyyathāpi, āvuso sarabha, brahāraññe jarasiṅgālo ‘sīhanādaṃ nadissāmī’ti siṅgālakaṃyeva [segālakaṃyeva (sī. syā. kaṃ. pī.)] nadati, bheraṇḍakaṃyeva nadati [bhedaṇḍakaṃ (ka.)]; evamevaṃ kho tvaṃ, āvuso sarabha, aññatreva samaṇena gotamena ‘sīhanādaṃ nadissāmī’ti siṅgālakaṃyeva nadasi bheraṇḍakaṃyeva nadasi. Seyyathāpi, āvuso sarabha, ambukasañcarī [ambakamaddarī (sī.)] ‘purisakaravitaṃ [phussakaravitaṃ (sī.), pussakaravitaṃ (syā. kaṃ. pī.)] ravissāmī’ti ambukasañcariravitaṃyeva ravati; evamevaṃ kho tvaṃ, āvuso sarabha, aññatreva samaṇena gotamena ‘purisakaravitaṃ ravissāmī’ti, ambukasañcariravitaṃyeva ravasi. Seyyathāpi, āvuso sarabha, usabho suññāya gosālāya gambhīraṃ naditabbaṃ maññati; evamevaṃ kho tvaṃ, āvuso sarabha, aññatreva samaṇena gotamena gambhīraṃ naditabbaṃ maññasī’’ti. Atha kho te paribbājakā sarabhaṃ paribbājakaṃ samantato vācāyasannitodakena sañjambharimakaṃsūti. Catutthaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying at Rājagaha, on Vulture Peak Mountain (Gijjhakūṭa).\n\nNow on that occasion, a wandering ascetic named Sarabha had recently departed from this Dhamma and Discipline. He was speaking such words in the assembly at Rājagaha, saying, “I have fully understood the Dhamma of the recluses, the sons of the Sakyans. And having understood the Dhamma of the recluses, the sons of the Sakyans, I have accordingly departed from that Dhamma and Discipline.”\n\nThen, a number of bhikkhus, having dressed in the forenoon and taken their bowls and robes, entered Rājagaha for alms. These bhikkhus heard the wandering ascetic Sarabha speaking such words in the assembly at Rājagaha: “I have fully understood the Dhamma of the recluses, the sons of the Sakyans. And having understood the Dhamma of the recluses, the sons of the Sakyans, I have accordingly departed from that Dhamma and Discipline.”\n\nThen, having wandered for alms in Rājagaha, and returning from the alms round after the meal, those bhikkhus approached the Blessed One. Having approached, they respectfully saluted the Blessed One and sat down to one side. Sitting to one side, those bhikkhus said to the Blessed One, “Venerable Sir, the wandering ascetic Sarabha has recently departed from this Dhamma and Discipline. He is speaking such words in the assembly at Rājagaha: ‘I have fully understood the Dhamma of the recluses, the sons of the Sakyans. And having understood the Dhamma of the recluses, the sons of the Sakyans, I have accordingly departed from that Dhamma and Discipline.’ It would be good, Venerable Sir, if the Blessed One, out of compassion, would approach the wandering ascetic Sarabha at the ascetics’ park near the Suppinikā bank.” The Blessed One consented by silence.\n\nThen, the Blessed One, having emerged from seclusion in the evening, approached the ascetics’ park near the Suppinikā bank, where the wandering ascetic Sarabha was staying. Having approached, he sat down on the seat prepared for him. Having sat down, the Blessed One said to the wandering ascetic Sarabha, “Is it true, Sarabha, that you speak thus: ‘I have fully understood the Dhamma of the recluses, the sons of the Sakyans. And having understood the Dhamma of the recluses, the sons of the Sakyans, I have accordingly departed from that Dhamma and Discipline’?” When this was said, the wandering ascetic Sarabha remained silent.\n\nA second time, the Blessed One said to the wandering ascetic Sarabha, “Speak, Sarabha, how exactly have you fully understood the Dhamma of the recluses, the sons of the Sakyans? If your understanding is incomplete, I shall complete it. But if your understanding is complete, I shall approve of it.” A second time, the wandering ascetic Sarabha remained silent.\n\nA third time, the Blessed One said to the wandering ascetic Sarabha, “Speak, Sarabha, how exactly have you fully understood the Dhamma of the recluses, the sons of the Sakyans? If your understanding is incomplete, I shall complete it. But if your understanding is complete, I shall approve of it.” A third time, the wandering ascetic Sarabha remained silent.\n\nThen those ascetics said to the wandering ascetic Sarabha, “Friend Sarabha, the very thing you should be asking the recluse Gotama, the recluse Gotama is offering to you. Speak, friend Sarabha, how exactly have you fully understood the Dhamma of the recluses, the sons of the Sakyans? If your understanding is incomplete, the recluse Gotama will complete it. But if your understanding is complete, the recluse Gotama will approve of it.” When this was said, the wandering ascetic Sarabha sat silent, ashamed, with slumped shoulders, downcast face, brooding, and unable to reply.\n\nThen the Blessed One, understanding that the wandering ascetic Sarabha was silent, ashamed, with slumped shoulders, downcast face, brooding, and unable to reply, addressed those ascetics, “If, O ascetics, anyone should say to me, ‘These teachings of the Fully Self-Awakened One are not fully awakened to by you,’ I would thoroughly examine him, investigate him, and question him there. It is impossible, it is not feasible, that when he is thoroughly examined by me, investigated by me, and questioned by me, he would not arrive at one of three outcomes: he will answer with one thing for another, or he will lead the discussion astray, or he will reveal anger, ill-will, and dissatisfaction, or he will sit silent, ashamed, with slumped shoulders, downcast face, brooding, and unable to reply, just as the wandering ascetic Sarabha is doing.\n\n“If, O ascetics, anyone should say to me, ‘These defilements of the one who claims to have destroyed the defilements are not destroyed,’ I would thoroughly examine him, investigate him, and question him there.”\n\nVerily, when that person is thoroughly cross-examined by me, pressed by me, and thoroughly instructed by me, it is impossible and out of the question that he would not arrive at one of the three inevitable outcomes. Or else, he will evade the topic by substituting one thing for another, or he will lead the discussion astray to external matters, or he will exhibit anger, malice, and dissatisfaction. He will sit silent, crestfallen, with shoulders drooping, facing downwards, dejected, and speechless, just like the wanderer Sarabha.\n\n“Wanderers, if anyone were to say this to me: ‘That Dhamma which you teach does not lead to the complete cessation of suffering for one who practices it correctly,’ then I would closely cross-examine him there, press him, and thoroughly instruct him. Verily, when that person is thoroughly cross-examined by me, pressed by me, and thoroughly instructed by me, it is impossible and out of the question that he would not arrive at one of the three inevitable outcomes. Or else, he will evade the topic by substituting one thing for another, or he will lead the discussion astray to external matters, or he will exhibit anger, malice, and dissatisfaction. He will sit silent, crestfallen, with shoulders drooping, facing downwards, dejected, and speechless, just like the wanderer Sarabha.”\n\nThen the Blessed One, having sounded the lion’s roar three times in the wanderers’ park on the bank of the Sippinikā, departed into the air.\n\nThen, shortly after the Blessed One had departed, those wanderers surrounded the wanderer Sarabha and assailed him from all sides with sharp, verbal barbs, saying: “Just as, friend Sarabha, in the great forest an old jackal says, ‘I shall roar the lion’s roar,’ but only yelps the jackal’s yelp, only howls the bheranda-howl—just so, friend Sarabha, when you are away from the recluse Gotama, you say, ‘I shall roar the lion’s roar,’ but you only yelp the jackal’s yelp, you only howl the bheranda-howl. Just as, friend Sarabha, the Ambukasañcarī bird says, ‘I shall sing the song of a man,’ but only sings the Ambukasañcarī song—just so, friend Sarabha, when you are away from the recluse Gotama, you say, ‘I shall sing the song of a man,’ but you only sing the Ambukasañcarī song. Just as, friend Sarabha, a bull thinks it makes a mighty sound in an empty cattle-pen; just so, friend Sarabha, when you are away from the recluse Gotama, you think you make a mighty sound.”\n\nThus, those wanderers assailed the wanderer Sarabha from all sides with sharp, verbal barbs.",
      "sinhala": "මා හට මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජුකුළු පව්වේ වැඩවසන සේක. එකල සරභ නම් පරිබ්‍රාජක තෙම මේ ධර්ම විනයෙන් වැඩි කලක් නොගොස් නික්ම ගියේ වේ. හෙතෙම රජගහ නුවර රැස්ව සිටි පිරිස මැද මෙසේ කථාවක් කියයි: 'ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය මා විසින් අවබෝධ කරගන්නා ලදී. ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය අවබෝධ කරගත් නිසාම මම ඒ ධර්ම විනයෙන් නික්ම ගියෙමි' යි. ඉක්බිති බොහෝ භික්ෂූහු පෙරවරුවෙහි හැඳ පොරවා පාත්‍ර සිවුරු ගෙන රජගහ නුවරට පිඬු සිඟා පිවිසියාහුය. ඒ භික්ෂූහු සරභ පරිබ්‍රාජක තෙම රජගහ නුවර පිරිස මැද මෙසේ කියනු ඇසූහ: 'ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය මා විසින් අවබෝධ කරගන්නා ලදී. ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය අවබෝධ කරගත් නිසාම මම ඒ ධර්ම විනයෙන් නික්ම ගියෙමි' යි. ඉක්බිති ඒ භික්ෂූහු රජගහ නුවර පිඬු සිඟා වළඳා, දහවල් ආහාරයෙන් පසුව පිඬු සිඟා යෑමෙන් නික්ම, යම් තැනක භාග්‍යවතුන් වහන්සේ වැඩසිටින සේක්ද, එතැනට එළඹියාහුය. එළඹ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පසෙක වාඩිවූවාහුය. එකත්පසෙක හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය කීවාහුය: “වහන්ස, සරභ නම් පරිබ්‍රාජක තෙම මේ ධර්ම විනයෙන් වැඩි කලක් නොගොස් නික්ම ගියේය. හෙතෙම රජගහ නුවර පිරිස මැද මෙසේ කථාවක් කියයි: 'ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය මා විසින් අවබෝධ කරගන්නා ලදී. ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය අවබෝධ කරගත් නිසාම මම ඒ ධර්ම විනයෙන් නික්ම ගියෙමි' යි. වහන්ස, භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් සරභ පරිබ්‍රාජකයා සිටින සප්පිනිකා තීරයේ පිහිටි පරිබ්‍රාජකාරාමයට එළඹෙන සේක්වා.” භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දව සිටීමෙන් එය ඉවසූ සේක.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් වේලාවෙහි පටිසල්ලානයෙන් නැගිට, යම් තැනක සරභ පරිබ්‍රාජකයා සිටීද, ඒ සප්පිනිකා තීරයේ පිහිටි පරිබ්‍රාජකාරාමයට එළඹි සේක. එළඹ, පනවන ලද අසුනෙහි වැඩ හුන් සේක. වැඩහිඳ, භාග්‍යවතුන් වහන්සේ සරභ පරිබ්‍රාජකයාට මෙය වදාළ සේක: “සරභ, 'ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය මා විසින් අවබෝධ කරගන්නා ලදී. ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය අවබෝධ කරගත් නිසාම මම ඒ ධර්ම විනයෙන් නික්ම ගියෙමි' යි, ඔබ එසේ කියන්නේ සැබෑද?” මෙසේ වදාළ කල්හි සරභ පරිබ්‍රාජක තෙම නිශ්ශබ්ද විය. දෙවන වරද භාග්‍යවතුන් වහන්සේ සරභ පරිබ්‍රාජකයාට මෙය වදාළ සේක: “සරභ, ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය ඔබට අවබෝධ වූයේ කෙසේද? යම් හෙයකින් එය ඔබට අසම්පූර්ණ නම්, මම එය සම්පූර්ණ කරන්නෙමි. යම් හෙයකින් එය ඔබට සම්පූර්ණ නම්, මම එය අනුමෝදන් කරන්නෙමි.” දෙවන වරද සරභ පරිබ්‍රාජක තෙම නිශ්ශබ්ද විය. තුන්වන වරද භාග්‍යවතුන් වහන්සේ සරභ පරිබ්‍රාජකයාට මෙය වදාළ සේක: “සරභ, ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය ඔබට අවබෝධ වූයේ කෙසේද? යම් හෙයකින් එය ඔබට අසම්පූර්ණ නම්, මම එය සම්පූර්ණ කරන්නෙමි. යම් හෙයකින් එය ඔබට සම්පූර්ණ නම්, මම එය අනුමෝදන් කරන්නෙමි.” තුන්වන වරද සරභ පරිබ්‍රාජක තෙම නිශ්ශබ්ද විය.\n\nඉක්බිති ඒ පරිබ්‍රාජකයෝ සරභ පරිබ්‍රාජකයාට මෙය කීවාහුය: “ඇවැත් සරභ, ඔබ ශ්‍රමණ ගෞතමයන්ගෙන් යමක් ඉල්ලා සිටින්නෙහිද, ඒ දෙයම ශ්‍රමණ ගෞතම තෙම ඔබට පිළිගන්වයි. ඇවැත් සරභ, ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගේ ධර්මය ඔබට අවබෝධ වූයේ කෙසේද? යම් හෙයකින් එය ඔබට අසම්පූර්ණ නම්, ශ්‍රමණ ගෞතම තෙම එය සම්පූර්ණ කරනු ඇත. යම් හෙයකින් එය ඔබට සම්පූර්ණ නම්, ශ්‍රමණ ගෞතම තෙම එය අනුමෝදන් කරනු ඇත.” මෙසේ කී කල්හි සරභ පරිබ්‍රාජක තෙම නිශ්ශබ්දව, මැලවී, උරහිස් එල්ලාගෙන, මුහුණ පහතට කරගෙන, කල්පනා කරමින්, පිළිතුරු දීමට නොහැකිව වාඩි වී සිටියේය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ සරභ පරිබ්‍රාජකයා නිශ්ශබ්දව, මැලවී, උරහිස් එල්ලාගෙන, මුහුණ පහතට කරගෙන, කල්පනා කරමින්, පිළිතුරු දීමට නොහැකිව සිටින බව දැන, ඒ පරිබ්‍රාජකයන්ට මෙය වදාළ සේක: “පරිබ්‍රාජකයෙනි, යමෙක් මා හට 'ඔබ සම්මාසම්බුද්ධ බව ප්‍රකාශ කරතත්, මේ ධර්මයන් ඔබ විසින් නියම ලෙස අවබෝධ කරගෙන නැත' යි මෙසේ කියන්නේ නම්, මම ඒ පුද්ගලයාට ඒ කරුණ සම්බන්ධයෙන් මනාකොට ප්‍රශ්න නගන්නෙමි, කරුණු විමසන්නෙමි, කරුණු පැහැදිලි කරන්නෙමි. මා විසින් මෙසේ මනාකොට ප්‍රශ්න කරන කල්හි, විමසන කල්හි, කරුණු පැහැදිලි කරන කල්හි, ඔහු විසින් අසම්බන්ධ දෙයක් කීම, හෝ කථාව පිටතට යොමු කරවා ගැනීම, හෝ කිපීම, ද්වේශ කිරීම සහ අප්‍රසාදය ප්‍රකාශ කිරීම, හෝ සරභ පරිබ්‍රාජකයා මෙන් නිශ්ශබ්දව, මැලවී, උරහිස් එල්ලාගෙන, මුහුණ පහතට කරගෙන, කල්පනා කරමින්, පිළිතුරු දීමට නොහැකිව වාඩි වී සිටීම යන මේ ස්ථාන තුනෙන් එක් ස්ථානයකටවත් නොපැමිණ සිටීම අතනොවන කරුණකි, එයට අවකාශයක් නැත.”\n\n“පරිබ්‍රාජකයෙනි, යමෙක් මා හට 'ඔබ ක්ෂීණාශ්‍රව බව ප්‍රකාශ කරතත්, මේ ආශ්‍රවයන් ඔබ විසින් පිරිසිඳ නැත' යි මෙසේ කියන්නේ නම්, මම ඒ පුද්ගලයාට ඒ කරුණ සම්බන්ධයෙන් මනාකොට ප්‍රශ්න නගන්නෙමි, කරුණු විමසන්නෙමි, කරුණු පැහැදිලි කරන්නෙමි.\n\nමා විසින් ඔහු මනාකොට ප්‍රශ්න කරනු ලබන විට, හරස් ප්‍රශ්න මගින් පීඩා කරනු ලබන විට, කරුණු පැහැදිලි කරනු ලබන විට, ඔහුට එම ත්‍රිවිධ ස්ථානවලින් එකක්වත් නොලැබී යාම නම් නොවන අවස්ථාවකි, නොකළ යුත්තකි. ඔහු අන් දෙයකට අන් දෙයකින් පිළිතුරු දෙනු ඇත, නැතහොත් කථාව පිටතට යොමු කරවනු ඇත, නැතහොත් ඔහු ක්‍රෝධයත්, ද්වේශයත්, අසතුටු බවත් ප්‍රකට කරනු ඇත, නැතහොත් ඔහු සරභ පරිබ්‍රාජකයා මෙන් නිහඬව, කලකිරී, උරහිස් එල්ලාගෙන, යටිකුරු වී, කල්පනා කරමින්, ප්‍රතිභානයක් නැතුව වාඩිවී සිටිනු ඇත. \"පරිබ්‍රාජකයෙනි, යමෙක් මා අරභයා මෙසේ කියන්නේ නම්: ‘ඔබ විසින් යම් අරමුණක් උදෙසා ධර්මය දේශනා කරනු ලැබුවේද, එය ඒ ආකාරයෙන් පිළිපදින තැනැත්තාට දුක්ඛ ක්ෂය කිරීම පිණිස නිසි ලෙසින් නොපවතී’ කියා, එවිට මම ඔහුව එහිදී මනාකොට ප්‍රශ්න කරමි, කරුණු විමසමි, කතාබහට ලක් කරමි. මා විසින් ඔහු මනාකොට ප්‍රශ්න කරනු ලබන විට, හරස් ප්‍රශ්න මගින් පීඩා කරනු ලබන විට, කරුණු පැහැදිලි කරනු ලබන විට, ඔහුට එම ත්‍රිවිධ ස්ථානවලින් එකක්වත් නොලැබී යාම නම් නොවන අවස්ථාවකි, නොකළ යුත්තකි. ඔහු අන් දෙයකට අන් දෙයකින් පිළිතුරු දෙනු ඇත, නැතහොත් කථාව පිටතට යොමු කරවනු ඇත, නැතහොත් ඔහු ක්‍රෝධයත්, ද්වේශයත්, අසතුටු බවත් ප්‍රකට කරනු ඇත, නැතහොත් ඔහු සරභ පරිබ්‍රාජකයා මෙන් නිහඬව, කලකිරී, උරහිස් එල්ලාගෙන, යටිකුරු වී, කල්පනා කරමින්, ප්‍රතිභානයක් නැතුව වාඩිවී සිටිනු ඇත.\"\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ සිප්පිනිකා ගංතෙර පිහිටි පරිබ්‍රාජක ආරාමයේදී තුන් වරක් සිංහනාදයක් කොට අහසින් වැඩම කළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ වැඩමකොට වැඩි නොබෝ වේලාවකින් ඒ පරිබ්‍රාජකයෝ සරභ පරිබ්‍රාජකයා වට කරගෙන, වචන නැමැති ඊතලවලින් ඇන පීඩා කළහ. \"ඇවැත් සරභ, මහ වනයෙහි මහළු නරියෙක් 'මම සිංහනාදයක් කරන්නෙමි' යි සිතා, නරි නාදයක්ම, නැතහොත් බෙරඬ නාදයක්ම නගන්නා සේම; ඇවැත් සරභ, ඔබත් ශ්‍රමණ ගෞතමයන් හැර 'මම සිංහනාදයක් කරන්නෙමි' යි සිතා, නරි නාදයක්ම, නැතහොත් බෙරඬ නාදයක්ම නගන්නෙහි ය. ඇවැත් සරභ, දියෙහි හැසිරෙන සතෙක් 'මම පුරුෂ ගාම්භීර නාදයක් නගන්නෙමි' යි සිතා, දියෙහි හැසිරෙන සතාගේ නාදයම නගන්නා සේම; ඇවැත් සරභ, ඔබත් ශ්‍රමණ ගෞතමයන් හැර 'මම පුරුෂ ගාම්භීර නාදයක් නගන්නෙමි' යි සිතා, දියෙහි හැසිරෙන සතාගේ නාදයම නගන්නෙහි ය. ඇවැත් සරභ, ගවයන් නැති හිස් ගාලක සිටින ගොනෙක් 'ගැඹුරු නාදයක් නංවා තේජස පෙන්විය යුතුය' යි සිතා ක්‍රියා කරන්නා සේම; ඇවැත් සරභ, ඔබත් ශ්‍රමණ ගෞතමයන් හැර (වෙනත් තැනකදී) 'ගැඹුරු නාදයක් නැගිය යුතුය' යි සිතන්නෙහි ය\" යි කීහ. ඉක්බිති ඒ පරිබ්‍රාජකයෝ සරභ පරිබ්‍රාජකයා වට කරගෙන වචන නැමැති ඊතලවලින් ඔහුට පීඩා කළහ.",
      "paliTitle": "Sarabhasuttaṃ"
    },
    {
      "number": 66,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena kesamuttaṃ [kesaputtaṃ (sī. syā. kaṃ. pī.)] nāma kālāmānaṃ nigamo tadavasari. Assosuṃ kho kesamuttiyā kālāmā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kesamuttaṃ anuppatto. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā…pe… sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’’ti. Atha kho kesamuttiyā kālāmā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu, appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu, appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu, appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu, appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te kesamuttiyā kālāmā bhagavantaṃ etadavocuṃ – ‘‘Santi, bhante, eke samaṇabrāhmaṇā kesamuttaṃ āgacchanti. Te sakaṃyeva vādaṃ dīpenti jotenti, parappavādaṃ pana khuṃsenti vambhenti paribhavanti omakkhiṃ [opapakkhiṃ (sī. syā. kaṃ. pī.), omakkhikaṃ (ka.)] karonti. Aparepi, bhante, eke samaṇabrāhmaṇā kesamuttaṃ āgacchanti. Tepi sakaṃyeva vādaṃ dīpenti jotenti, parappavādaṃ pana khuṃsenti vambhenti paribhavanti omakkhiṃ karonti. Tesaṃ no, bhante, amhākaṃ hoteva kaṅkhā hoti vicikicchā – ‘ko su nāma imesaṃ bhavataṃ samaṇabrāhmaṇānaṃ saccaṃ āha, ko musā’’’ti? ‘‘Alañhi vo, kālāmā, kaṅkhituṃ alaṃ vicikicchituṃ. Kaṅkhanīyeva pana [kaṅkhanīyeva ca pana (saṃyuttanikāye)] vo ṭhāne vicikicchā uppannā’’. ‘‘Etha tumhe, kālāmā, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe, kālāmā, attanāva jāneyyātha – ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā [samādiṇṇā (ka.)] ahitāya dukkhāya saṃvattantī’’’ti, atha tumhe, kālāmā, pajaheyyātha. ‘‘Taṃ kiṃ maññatha, kālāmā, lobho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Luddho panāyaṃ, kālāmā, purisapuggalo lobhena abhibhūto pariyādinnacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya [tadatthāya (ka.)] samādapeti, yaṃ sa [yaṃ tassa (ka.) anantarasutte pana ‘‘yaṃ’ sa’’ itveva sabbatthapi dissati] hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, kālāmā, doso purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Duṭṭho panāyaṃ, kālāmā, purisapuggalo dosena abhibhūto pariyādinnacitto pāṇampi hanati [hanti (sī. pī.)], adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, kālāmā, moho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Ahitāya, bhante’’. ‘‘Mūḷho panāyaṃ, kālāmā, purisapuggalo mohena abhibhūto pariyādinnacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, kālāmā, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Akusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Sāvajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññugarahitā, bhante’’. ‘‘Samattā samādinnā ahitāya dukkhāya saṃvattanti, no vā? Kathaṃ vā [kathaṃ vā vo (?)] ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā ahitāya dukkhāya saṃvattantīti. Evaṃ no ettha hotī’’ti. ‘‘Iti kho, kālāmā, yaṃ taṃ avocumhā [avocumha (sī. syā. kaṃ. pī.) a. ni. 4.193] – ‘etha tumhe, kālāmā! Mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe kālāmā attanāva jāneyyātha – ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantīti, atha tumhe, kālāmā, pajaheyyāthā’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Etha tumhe, kālāmā, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe, kālāmā, attanāva jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantī’ti, atha tumhe, kālāmā, upasampajja vihareyyātha. ‘‘Taṃ kiṃ maññatha, kālāmā, alobho purisassa ajjhattaṃ uppajjamāno uppajjati hitāya vā ahitāya vā’’ti? ‘‘Hitāya, bhante’’. ‘‘Aluddho panāyaṃ, kālāmā, purisapuggalo lobhena anabhibhūto apariyādinnacitto neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati, na parampi tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, kālāmā, adoso purisassa ajjhattaṃ uppajjamāno uppajjati…pe… amoho purisassa ajjhattaṃ uppajjamāno uppajjati…pe… hitāya sukhāyā’’ti. ‘‘Evaṃ bhante’’. ‘‘Taṃ kiṃ maññatha, kālāmā, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Kusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Anavajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññuppasatthā, bhante’’. ‘‘Samattā samādinnā hitāya sukhāya saṃvattanti no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā hitāya sukhāya saṃvattanti. Evaṃ no ettha hotī’’ti. ‘‘Iti kho, kālāmā, yaṃ taṃ avocumhā – ‘etha tumhe, kālāmā! Mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe, kālāmā, attanāva jāneyyātha – ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantīti, atha tumhe, kālāmā, upasampajja vihareyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Sa kho so [yo kho (ka.)], kālāmā, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno patissato [sato (ka.)] mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjhena pharitvā viharati. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjhena pharitvā viharati. ‘‘Sa [sace (ka.)] kho so, kālāmā, ariyasāvako evaṃ averacitto evaṃ abyāpajjhacitto evaṃ asaṃkiliṭṭhacitto evaṃ visuddhacitto. Tassa diṭṭheva dhamme cattāro assāsā adhigatā honti. ‘Sace kho pana atthi paro loko, atthi sukatadukkaṭānaṃ [sukaṭadukkaṭānaṃ (sī. syā. kaṃ. pī.)] kammānaṃ phalaṃ vipāko, athāhaṃ [ṭhānamahaṃ (sī. pī.), ṭhānametaṃ yenāhaṃ (syā. kaṃ.)] kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti, ayamassa paṭhamo assāso adhigato hoti. ‘‘‘Sace kho pana natthi paro loko, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, athāhaṃ [idhāhaṃ (sī. syā. kaṃ. pī.)] diṭṭheva dhamme averaṃ abyāpajjhaṃ anīghaṃ sukhiṃ [sukhaṃ (sī.), sukhī (syā. kaṃ.)] attānaṃ pariharāmī’ti, ayamassa dutiyo assāso adhigato hoti. ‘‘‘Sace kho pana karoto karīyati pāpaṃ, na kho panāhaṃ kassaci pāpaṃ cetemi. Akarontaṃ kho pana maṃ pāpakammaṃ kuto dukkhaṃ phusissatī’ti, ayamassa tatiyo assāso adhigato hoti. ‘‘‘Sace kho pana karoto na karīyati pāpaṃ, athāhaṃ ubhayeneva visuddhaṃ attānaṃ samanupassāmī’ti, ayamassa catuttho assāso adhigato hoti. ‘‘Sa kho so, kālāmā, ariyasāvako evaṃ averacitto evaṃ abyāpajjhacitto evaṃ asaṃkiliṭṭhacitto evaṃ visuddhacitto. Tassa diṭṭheva dhamme ime cattāro assāsā adhigatā hontī’’ti. ‘‘Evametaṃ, bhagavā, evametaṃ, sugata! Sa kho so, bhante, ariyasāvako evaṃ averacitto evaṃ abyāpajjhacitto evaṃ asaṃkiliṭṭhacitto evaṃ visuddhacitto. Tassa diṭṭheva dhamme cattāro assāsā adhigatā honti. ‘Sace kho pana atthi paro loko, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, athāhaṃ kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti, ayamassa paṭhamo assāso adhigato hoti. ‘‘‘Sace kho pana natthi paro loko, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, athāhaṃ diṭṭheva dhamme averaṃ abyāpajjhaṃ anīghaṃ sukhiṃ attānaṃ pariharāmī’ti, ayamassa dutiyo assāso adhigato hoti. ‘‘Sace kho pana karoto karīyati pāpaṃ, na kho panāhaṃ – kassaci pāpaṃ cetemi, akarontaṃ kho pana maṃ pāpakammaṃ kuto dukkhaṃ phusissatī’ti, ayamassa tatiyo assāso adhigato hoti. ‘‘‘Sace kho pana karoto na karīyati pāpaṃ, athāhaṃ ubhayeneva visuddhaṃ attānaṃ samanupassāmī’ti, ayamassa catuttho assāso adhigato hoti. ‘‘Sa kho so, bhante, ariyasāvako evaṃ averacitto evaṃ abyāpajjhacitto evaṃ asaṃkiliṭṭhacitto evaṃ visuddhacitto. Tassa diṭṭheva dhamme ime cattāro assāsā adhigatā honti. ‘‘Abhikkantaṃ, bhante…pe… ete mayaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no, bhante, bhagavā dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti. Pañcamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was traveling through the Kosalan country with a large community of monastics, and he arrived at a market town of the Kālāmas called Kesamutta. The Kālāmas of Kesamutta heard: \"It is said that the ascetic Gotama, the son of the Sakyans who renounced the world from the Sakyan clan, has arrived at Kesamutta. And concerning that Blessed Gotama, such a favorable report has spread: ‘He is indeed the Blessed One, the Arahant, the Fully Awakened Buddha, endowed with true knowledge and conduct, sublime, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One’—it is truly excellent to see such Arahants.\" Then the Kālāmas of Kesamutta approached the Blessed One. Having approached, some paid homage to the Blessed One and sat down to one side. Some exchanged greetings with the Blessed One, and having concluded friendly and courteous talk, they sat down to one side. Some, bowing their hands in reverence toward the Blessed One, sat down to one side. Some announced their name and clan, and sat down to one side. Others remained silent, and sat down to one side.\n\nSeated to one side, those Kālāmas of Kesamutta addressed the Blessed One: \"Venerable Sir, some ascetics and Brahmins come to Kesamutta. They explain and illuminate only their own doctrine, but they scorn, despise, disparage, and diminish the doctrines of others. Venerable Sir, other ascetics and Brahmins also come to Kesamutta. They too explain and illuminate only their own doctrine, but they scorn, despise, disparage, and diminish the doctrines of others. Regarding them, Venerable Sir, we have doubt and uncertainty: 'Who among these respected ascetics and Brahmins speaks the truth, and who speaks falsehood?'\" \"It is appropriate for you, Kālāmas, to have doubt, to have uncertainty. Uncertainty has arisen in you concerning a doubtful matter.\"\n\n\"Come, Kālāmas. Do not go merely by report, by tradition, by hearsay, by the authority of scriptural collections, by mere logic, by inference, by careful contemplation of reasons, by the acceptance of a view after speculation, by the seeming competence of a speaker, or because 'The ascetic is our teacher.' But when you yourselves, Kālāmas, know: 'These mental qualities are unskillful; these qualities are blameworthy; these qualities are censured by the wise; these qualities, when fully undertaken and practiced, lead to harm and suffering,' then you should abandon them. What do you think, Kālāmas? When greed arises internally in a person, does it arise for his well-being or for his harm?\" \"For his harm, Venerable Sir.\" \"When a person, Kālāmas, overwhelmed by greed and with his mind utterly possessed by it, kills living beings, takes what is not given, goes after the wives of others, speaks falsehood, and encourages others to do the same—does this lead to long-term harm and suffering?\" \"Yes, Venerable Sir.\" \"What do you think, Kālāmas? When hatred arises internally in a person, does it arise for his well-being or for his harm?\" \"For his harm, Venerable Sir.\" \"When a person, Kālāmas, overwhelmed by hatred and with his mind utterly possessed by it, kills living beings, takes what is not given, goes after the wives of others, speaks falsehood, and encourages others to do the same—does this lead to long-term harm and suffering?\" \"Yes, Venerable Sir.\" \"What do you think, Kālāmas? When delusion arises internally in a person, does it arise for his well-being or for his harm?\" \"For his harm, Venerable Sir.\" \"When a person, Kālāmas, overwhelmed by delusion and with his mind utterly possessed by it, kills living beings, takes what is not given, goes after the wives of others, speaks falsehood, and encourages others to do the same—does this lead to long-term harm and suffering?\" \"Yes, Venerable Sir.\" \"What do you think, Kālāmas? Are these qualities skillful or unskillful?\" \"Unskillful, Venerable Sir.\" \"Are they blameworthy or blameless?\" \"Blameworthy, Venerable Sir.\" \"Are they censured by the wise or praised by the wise?\" \"Censured by the wise, Venerable Sir.\" \"When fully undertaken and practiced, do they lead to harm and suffering, or not? How do you feel about this?\" \"When fully undertaken and practiced, Venerable Sir, they lead to harm and suffering. That is how we feel about this.\" \"Thus, Kālāmas, regarding what we said: 'Come, Kālāmas. Do not go merely by report, by tradition, by hearsay, by the authority of scriptural collections, by mere logic, by inference, by careful contemplation of reasons, by the acceptance of a view after speculation, by the seeming competence of a speaker, or because \"The ascetic is our teacher.\"'\"\n\nWhen, Kālāmas, you yourselves know: ‘These qualities are unwholesome; these qualities are blameworthy; these qualities are criticized by the wise; these qualities, when undertaken and practiced, lead to harm and suffering,’ then, Kālāmas, you should abandon them. That is why this was stated.\n\n“Come, Kālāmas. Do not go merely by report, or by tradition, or by hearsay, or by reliance on textual collections, or by mere reasoning, or by mere logic, or by consideration of reasons, or by the acceptance of a view after pondering it, or by the seeming competence of a speaker, or because ‘The ascetic is our respected teacher.’ When, Kālāmas, you yourselves know: ‘These qualities are wholesome; these qualities are blameless; these qualities are praised by the wise; these qualities, when undertaken and practiced, lead to welfare and happiness,’ then, Kālāmas, you should undertake them and abide in them.\n\n“What do you think, Kālāmas? When non-greed arises internally in a person, does it arise for welfare or for harm?” “For welfare, venerable sir.” “A person who is not greedy, Kālāmas, whose mind is not overcome or obsessed by greed, does not kill living beings, does not take what is not given, does not go after another man’s wife, does not speak falsehood, nor does he encourage others to engage in such practices, which leads to their long-term welfare and happiness.” “It is so, venerable sir.” “What do you think, Kālāmas? When non-hatred arises internally in a person, does it arise... (and so forth)... When non-delusion arises internally in a person, does it arise... (and so forth)... for welfare and happiness?” “It is so, venerable sir.”\n\n“What do you think, Kālāmas? Are these qualities wholesome or unwholesome?” “Wholesome, venerable sir.” “Blameworthy or blameless?” “Blameless, venerable sir.” “Criticized by the wise or praised by the wise?” “Praised by the wise, venerable sir.” “When undertaken and practiced, do they lead to welfare and happiness, or not? How is it in this case?” “When undertaken and practiced, venerable sir, they lead to welfare and happiness. This is how it is in this case for us.”\n\nThus, Kālāmas, when we said: ‘Come, Kālāmas! Do not go merely by report, or by tradition, or by hearsay, or by reliance on textual collections, or by mere reasoning, or by mere logic, or by consideration of reasons, or by the acceptance of a view after pondering it, or by the seeming competence of a speaker, or because ‘The ascetic is our respected teacher.’ When, Kālāmas, you yourselves know: ‘These qualities are wholesome; these qualities are blameless; these qualities are praised by the wise; these qualities, when undertaken and practiced, lead to welfare and happiness,’ then, Kālāmas, you should undertake them and abide in them’—it was with reference to this that it was stated.\n\nThat noble disciple, Kālāmas, who is thus free from covetousness, free from ill will, unconfused, clearly comprehending, and mindful, abides pervading one direction with a mind imbued with loving-kindness; likewise the second, likewise the third, likewise the fourth. Thus, above, below, around, everywhere, and equally, he abides pervading the entire world with a mind imbued with loving-kindness, vast, exalted, measureless, without enmity and without ill will. He abides pervading one direction with a mind imbued with compassion... (and so forth)... He abides pervading one direction with a mind imbued with altruistic joy... (and so forth)... He abides pervading one direction with a mind imbued with equanimity; likewise the second, likewise the third, likewise the fourth. Thus, above, below, around, everywhere, and equally, he abides pervading the entire world with a mind imbued with equanimity, vast, exalted, measureless, without enmity and without ill will.\n\nThat noble disciple, Kālāmas, whose mind is thus without enmity, thus without ill will, thus undefiled, thus purified, has gained four assurances in this very life. ‘If there is another world, and if there is the fruition and result of deeds done well or ill, then it is possible that upon the breakup of the body, after death, I shall arise in a happy destination, in the heavenly world,’—this is the first assurance he has gained.\n\n‘If, however, there is no other world, and there is no fruition and result of deeds done well or ill, then here and now in this very life I maintain myself free from enmity, free from ill will, free from trouble, and happy,’—this is the second assurance he has gained.\n\n‘If evil deeds are performed by doing them, yet I do not intend evil toward anyone. Since I perform no evil deeds, how can suffering touch me?’—this is the third assurance he has gained.\n\n‘If, however, evil deeds are not performed by doing them, then I see myself purified in both respects,’—this is the fourth assurance he has gained. That noble disciple, Kālāmas, whose mind is thus without enmity, thus without ill will, thus undefiled, thus purified.\n\nIn the very present life, these four assurances are attained by him.\n\n“It is so, Blessed One. It is so, Fortunate One! That noble disciple, venerable sir, is thus free from enmity in mind, thus free from ill-will in mind, thus uncorrupted in mind, thus purified in mind. In the very present life, these four assurances are attained by him.\n\n‘If, indeed, there is another world, if there is fruit and result of deeds done well and ill, then upon the dissolution of the body, after death, I shall be reborn into a good destination, a heavenly world.’ This is his first assurance attained.\n\n‘If, however, there is no other world, if there is no fruit and result of deeds done well and ill, then in this very life I keep myself free from enmity, free from ill-will, free from distress, and happy.’ This is his second assurance attained.\n\n‘If, indeed, by doing, evil is done, yet I do not intend evil toward anyone; and since I am one who does no evil, how can suffering possibly touch me?’ This is his third assurance attained.\n\n‘If, however, by doing, evil is not done, then I see myself purified in both ways.’ This is his fourth assurance attained.\n\nThat noble disciple, venerable sir, is thus free from enmity in mind, thus free from ill-will in mind, thus uncorrupted in mind, thus purified in mind. In the very present life, these four assurances are attained by him.\n\n“Excellent, Venerable Sir... We, venerable sir, take refuge in the Blessed One, in the Dhamma, and in the Sangha of monks. May the Blessed One accept us as lay followers who have taken refuge from this day forth as long as life lasts.”",
      "sinhala": "මා හට මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මහත් වූ භික්‍ෂුසඞ්ඝයා සමඟ කෝසල ජනපදයේ චාරිකාවේ වඩමින්, කාලාමවරුන්ගේ කේසමුත්ත නම් වූ නියම් ගමට වැඩම කළ සේක.\n\nකේසමුත්තියේ කාලාමවරුන්ට මේ ආරංචිය අසන්නට ලැබිණි: “භවත්නි, ශාක්‍ය පුත්‍ර වූ, ශාක්‍ය කුලයෙන් පැවිදි වූ ගෞතම ශ්‍රමණයන් වහන්සේ කේසමුත්ත නම් නියම් ගමට පැමිණ ඇත. එම භවත් ගෞතමයන් වහන්සේ පිළිබඳව ‘ඒ භාග්‍යවතුන් වහන්සේ ඉතිපි සෝ භගවා... (යනාදී වශයෙන්)... එබඳු රහතුන් වහන්සේලා දැකීම සුදුසු වන්නේය’ යනුවෙන් මෙබඳු වූ උතුම් කීර්ති ඝෝෂාවක් පැතිර ගොස් ඇත.”\n\nඑවිට කේසමුත්තියේ කාලාමවරු භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණියහ. පැමිණ, ඇතැම් අය භාග්‍යවතුන් වහන්සේට වැඳ එකත්පස්ව වාඩි වූහ. ඇතැම් අය භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු කථා බහ, සිහිපත් කළ යුතු කථා බහ නිමවා එකත්පස්ව වාඩි වූහ. ඇතැම් අය භාග්‍යවතුන් වහන්සේ වෙත දෝත නමා එකත්පස්ව වාඩි වූහ. ඇතැම් අය තමන්ගේ නම ගොත‍්‍රය දැන්වා එකත්පස්ව වාඩි වූහ. ඇතැම් අය නිශ්ශබ්දව සිටිමින් එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ කේසමුත්තියේ කාලාමවරු භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, සමහර ශ්‍රමණ බ්‍රාහ්මණයෝ කේසමුත්ත නම් මේ නියම් ගමට පැමිණෙති. ඔවුහු තමන්ගේම වාදය විස්තර කරති, දීප්තිමත් කරති. අනුන්ගේ වාදයන්ට නම් ඔවුහු නින්දා කරති, ගැරහති, හෙළා දකිති, අවඥා කරති. ස්වාමීනි, තවත් සමහර ශ්‍රමණ බ්‍රාහ්මණයෝ ද කේසමුත්ත නම් මේ නියම් ගමට පැමිණෙති. ඔවුහු ද තමන්ගේම වාදය විස්තර කරති, දීප්තිමත් කරති. අනුන්ගේ වාදයන්ට නම් ඔවුහු ද නින්දා කරති, ගැරහති, හෙළා දකිති, අවඥා කරති. ස්වාමීනි, අපට මේ පිළිබඳව සැකයක්, විමතියක් ඇති වේ. ‘මේ භවත් ශ්‍රමණ බ්‍රාහ්මණයන් අතුරින් කවුරුන් නම් සත්‍යය පවසන්නේද, කවුරුන් බොරු පවසන්නේද’ කියාය.”\n\n“කාලාමයෙනි, නුඹලාට සැක කිරීම ද සුදුසුය, විමති වීම ද සුදුසුය. සැක කළ යුතු තැනම නුඹලාට විමතිය උපදින ලදී.”\n\n“කාලාමයෙනි, එන්න, නුඹලා පුරුද්දෙන් (කටින් කට ආ දේ) නිසා පිළිගන්න එපා. පරම්පරාගතව පැවත ආවේ යැයි නිසා පිළිගන්න එපා. මෙසේ කියනු ලැබේ යන (ආරංචියක්) නිසා පිළිගන්න එපා. පිටක සම්ප්‍රදාය (ධර්ම ග්‍රන්ථ) නිසා පිළිගන්න එපා. තර්ක හේතුවෙන් නිසා පිළිගන්න එපා. න්‍යාය හේතුවෙන් නිසා පිළිගන්න එපා. ආකා‍රය අනුව විතර්ක කිරීමෙන් නිසා පිළිගන්න එපා. තමන්ගේ දෘෂ්ටියට ගැලපේ යැයි ඉවසීමෙන් නිසා පිළිගන්න එපා. බැලූ බැල්මට සුදුසු ස්වභාවය නිසා පිළිගන්න එපා. මේ ශ්‍රමණයෝ අපගේ ගුරුවරු යැයි කියා පිළිගන්න එපා.\n\nකාලාමයෙනි, යම් කලක නුඹලා විසින් ම දැනගනු ඇද්ද—‘මේ ධර්මයෝ අකුසල වෙති, මේ ධර්මයෝ වරද සහිත වෙති, මේ ධර්මයෝ නුවණැත්තන් විසින් ගරහන ලද වෙති. මේ ධර්මයන් සම්පූර්ණයෙන් සමාදන් වූ කල්හි අහිත පිණිසත්, දුක පිණිසත් පවතින්නෝය’ කියා, එවිට කාලාමයෙනි, නුඹලා ඒ ධර්මයන් අත්හැරිය යුතුය.”\n\n“කාලාමයෙනි, මේ පිළිබඳව නුඹලා කුමක් සිතන්නහු ද? යම් පුරුෂයෙකු තුළ අධ්‍යාත්මිකව ලෝභය උපදින්නේ නම්, එය හිත පිණිස ද, නැතිනම් අහිත පිණිස ද උපදින්නේ?”\n“ස්වාමීනි, අහිත පිණිස යි.”\n“කාලාමයෙනි, ලෝභයෙන් පිරුණු යම් මේ පුරුෂ පුද්ගලයෙක්, ලෝභයෙන් යටපත් වී, සිත වසඟ වී සිටින්නේ නම්, හෙතෙම ප්‍රාණීන් මැරීම ද කරන්නේ ය. නුදුන් දෙය ගැනීම ද කරන්නේ ය. අනුන්ගේ භාර්යාවන් වෙත යාම ද කරන්නේ ය. බොරු කීම ද කරන්නේ ය. අනුන් ද ඒ දේ සඳහා සමාදන් කරවන්නේ ය. එය ඔහුට දීර්ඝ කාලයක් මුළුල්ලේ අහිත පිණිසත්, දුක පිණිසත් වන්නේය.”\n“එසේය, ස්වාමීනි.”\n\n“කාලාමයෙනි, ද්වේෂය යම් පුරුෂයෙකු තුළ අධ්‍යාත්මිකව උපදින්නේ නම්, එය හිත පිණිස ද, නැතිනම් අහිත පිණිස ද උපදින්නේ?”\n“ස්වාමීනි, අහිත පිණිස යි.”\n“කාලාමයෙනි, ද්වේෂයෙන් පිරුණු යම් මේ පුරුෂ පුද්ගලයෙක්, ද්වේෂයෙන් යටපත් වී, සිත වසඟ වී සිටින්නේ නම්, හෙතෙම ප්‍රාණීන් මැරීම ද කරන්නේ ය. නුදුන් දෙය ගැනීම ද කරන්නේ ය. අනුන්ගේ භාර්යාවන් වෙත යාම ද කරන්නේ ය. බොරු කීම ද කරන්නේ ය. අනුන් ද ඒ දේ සඳහා සමාදන් කරවන්නේ ය. එය ඔහුට දීර්ඝ කාලයක් මුළුල්ලේ අහිත පිණිසත්, දුක පිණිසත් වන්නේය.”\n“එසේය, ස්වාමීනි.”\n\n“කාලාමයෙනි, මෝහය යම් පුරුෂයෙකු තුළ අධ්‍යාත්මිකව උපදින්නේ නම්, එය හිත පිණිස ද, නැතිනම් අහිත පිණිස ද උපදින්නේ?”\n“ස්වාමීනි, අහිත පිණිස යි.”\n“කාලාමයෙනි, මෝහයෙන් පිරුණු යම් මේ පුරුෂ පුද්ගලයෙක්, මෝහයෙන් යටපත් වී, සිත වසඟ වී සිටින්නේ නම්, හෙතෙම ප්‍රාණීන් මැරීම ද කරන්නේ ය. නුදුන් දෙය ගැනීම ද කරන්නේ ය. අනුන්ගේ භාර්යාවන් වෙත යාම ද කරන්නේ ය. බොරු කීම ද කරන්නේ ය. අනුන් ද ඒ දේ සඳහා සමාදන් කරවන්නේ ය. එය ඔහුට දීර්ඝ කාලයක් මුළුල්ලේ අහිත පිණිසත්, දුක පිණිසත් වන්නේය.”\n“එසේය, ස්වාමීනි.”\n\n“කාලාමයෙනි, නුඹලා කුමක් සිතන්නහු ද? මේ ධර්මයෝ කුසල ධර්ම ද, අකුසල ධර්ම ද?”\n“ස්වාමීනි, අකුසල ධර්ම ය.”\n“වරද සහිත ද, වරද රහිත ද?”\n“ස්වාමීනි, වරද සහිත ය.”\n“නුවණැත්තන් විසින් ගරහන ලද ද, පසසන ලද ද?”\n“ස්වාමීනි, නුවණැත්තන් විසින් ගරහන ලද ය.”\n“සම්පූර්ණයෙන් සමාදන් වූ කල්හි අහිත පිණිසත්, දුක පිණිසත් පවතී ද, නැද්ද? නුඹලාට මෙහිදී කෙසේ වැටහෙන්නේ ද?”\n“ස්වාමීනි, සම්පූර්ණයෙන් සමාදන් වූ කල්හි අහිත පිණිසත්, දුක පිණිසත් පවතී. අපට මෙහිදී එසේ වැටහෙන්නේ ය.”\n\n“කාලාමයෙනි, යමක් මම නුඹලාට පෙර කීවෙම් ද – ‘කාලාමයෙනි, එන්න, පුරුද්දෙන් නිසා පිළිගන්න එපා. පරම්පරාගතව පැවත ආවේ යැයි නිසා පිළිගන්න එපා. මෙසේ කියනු ලැබේ යන නිසා පිළිගන්න එපා. පිටක සම්ප්‍රදාය නිසා පිළිගන්න එපා. තර්ක හේතුවෙන් නිසා පිළිගන්න එපා. න්‍යාය හේතුවෙන් නිසා පිළිගන්න එපා. ආකා‍රය අනුව විතර්ක කිරීමෙන් නිසා පිළිගන්න එපා. තමන්ගේ දෘෂ්ටියට ගැලපේ යැයි ඉවසීමෙන් නිසා පිළිගන්න එපා. බැලූ බැල්මට සුදුසු ස්වභාවය නිසා පිළිගන්න එපා. මේ ශ්‍රමණයෝ අපගේ ගුරුවරු යැයි කියා පිළිගන්න එපා’ යනුයි.\n\nකාලාමයිනි, යම් කලෙක නුඹලා විසින්ම ‘මේ ධර්‍මයෝ අකුශල වෙති, මේ ධර්‍මයෝ දොස් සහිත වෙති, මේ ධර්‍මයෝ නුවණැත්තන් විසින් ගැරහූ වෙති, මේ ධර්‍මයෝ මැනවින් සමාදන් වූ කල්හි අහිත පිණිස දුක පිණිස පවතී’ යි දැනගන්නේ ද, එවිට නුඹලා ඒවා ප්‍රහාණය කරන්නැ යි යම් ඒ වචනයක් කියන ලද්දේ ද, මේ කරුණ නිසා එය කියන ලදී.\n\nකාලාමයිනි, නුඹලා එන්න; අනුශ්‍රවයෙන් (අසා දැනගැනීමෙන්) ද, පරම්පරාවෙන් ද, කටකතා වශයෙන් ද, පිටක සම්ප්‍රදානයෙන් ද, තර්ක හේතුවෙන් ද, නය හේතුවෙන් ද, ආකාර පරිවිතර්කයෙන් ද, දෘෂ්ටිය නිශ්චලව ඉවසීමෙන් ද, භව්‍ය රූපයෙන් ද, ‘මේ ශ්‍රමණයෝ අපගේ ගුරු වෙති’ යි යන හැඟීමෙන් ද (ධර්මය පිළිගැනීමට) නොඑන්න. කාලාමයිනි, නුඹලා විසින්ම ‘මේ ධර්‍මයෝ කුශල වෙති, මේ ධර්‍මයෝ දොස් නැති වෙති, මේ ධර්‍මයෝ නුවණැත්තන් විසින් ප්‍රශංසා කරන ලද්දාහු වෙති, මේ ධර්‍මයෝ මැනවින් සමාදන් වූ කල්හි හිත පිණිස සැප පිණිස පවතී’ යි යම් කලෙක දැනගන්නේ ද, එවිට නුඹලා ඒවා පිළිගෙන වාසය කරන්න.\n\n“කාලාමයිනි, නුඹලා ඒ ගැන කුමක් සිතන්නෙහි ද? අලෝභය (ලෝභ නැති බව) පුද්ගලයකු තුළ උපදින විට හිත පිණිස ද, අහිත පිණිස ද උපදින්නේ?” “ස්වාමීනි, හිත පිණිස ය.” “කාලාමයිනි, ලෝභයෙන් යටපත් නොවූ, සිත් පහර නොගත් මේ අලෝභී පුද්ගලයා ප්‍රාණඝාතය නොකරයි, නුදුන් දෙය නොගනියි, පරදාර සේවනය නොකරයි, මුසාවාදා නොකියයි, අනුන් ද ඒ තත්ත්වයට සමාදන් කරවන්නේ නැත. එය දීර්ඝ කාලයක් හිත පිණිස සැප පිණිස පවතින්නේ ය.” “ස්වාමීනි, එසේය.”\n\n“කාලාමයිනි, නුඹලා කුමක් සිතන්නෙහි ද? පුද්ගලයකු තුළ අදෝෂය උපදින විට ද, අමෝහය උපදින විට ද, එය හිත පිණිස සැප පිණිස පවතී ද?” “ස්වාමීනි, එසේය.”\n\n“කාලාමයිනි, නුඹලා මේ ධර්‍මයන් කුශල යයි හෝ අකුශල යයි සලකන්නේ කුමක් ලෙස ද?” “ස්වාමීනි, කුශල යි.” “දෝෂ සහිත යයි හෝ දෝෂ රහිත යයි සලකන්නේ කුමක් ලෙස ද?” “ස්වාමීනි, දෝෂ රහිත යි.” “නුවණැත්තන් විසින් ගැරහූ යයි හෝ ප්‍රශංසා කළ යයි සලකන්නේ කුමක් ලෙස ද?” “ස්වාමීනි, ප්‍රශංසා කළ යි.” “මැනවින් සමාදන් වූ කල්හි හිත පිණිස සැප පිණිස පවතී ද නැද්ද? නැතහොත් මෙහිදී කෙසේ වන්නේ ද?” “ස්වාමීනි, මැනවින් සමාදන් වූ කල්හි හිත පිණිස සැප පිණිස පවතී. මෙහිදී අපට එසේ වන්නේ ය.”\n\nකාලාමයිනි, ‘එන්න, නුඹලා අනුශ්‍රවයෙන්, පරම්පරාවෙන්, කටකතා වශයෙන්, පිටක සම්ප්‍රදානයෙන්, තර්ක හේතුවෙන්, නය හේතුවෙන්, ආකාර පරිවිතර්කයෙන්, දෘෂ්ටිය නිශ්චලව ඉවසීමෙන්, භව්‍ය රූපයෙන්, ‘මේ ශ්‍රමණයෝ අපගේ ගුරු වෙති’ යි යන හැඟීමෙන් (ධර්මය) නොපිළිගන්න. කාලාමයිනි, නුඹලා විසින්ම මේ ධර්‍මයෝ කුශල වෙති, මේ ධර්‍මයෝ දොස් නැති වෙති, මේ ධර්‍මයෝ නුවණැත්තන් විසින් ප්‍රශංසා කළ වෙති, මේ ධර්‍මයෝ මැනවින් සමාදන් වූ කල්හි හිත පිණිස සැප පිණිස පවතී යි යම් කලෙක දැනගන්නේ ද, එවිට නුඹලා ඒවා පිළිගෙන වාසය කරන්නැ’යි යම් ඒ වචනයක් අප විසින් කියන ලද්දේ ද, මේ කරුණ නිසා එය කියන ලදී.\n\nකාලාමයිනි, ඒ ආර්‍ය්‍ය ශ්‍රාවක තෙම මෙසේ පහ වූ අභිධ්‍යාව ඇත්තේ, පහ වූ ව්‍යාපාදය ඇත්තේ, මුළා නොවුණු, මනා නුවණින් යුක්ත වූ, සිහි ඇති කෙනෙකු බවට පත්වන්නේ ය. ඔහු මෛත්‍රිය සහිත වූ සිතින් එක් දිශාවක් පැතිර වාසය කරයි. එසේම දෙවන දිශාව ද, එසේම තෙවන දිශාව ද, එසේම සතරවන දිශාව ද, මෙසේ උඩ, යට, හරස් අතට, සෑම තැනම, සියලු ආත්මභාවයන් තුළින්, මුළු ලෝකයම මෛත්‍රිය සහිත වූ, විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පැතිර වාසය කරයි. කරුණාව සහිත වූ සිතින් ද, මුදිතාව සහිත වූ සිතින් ද, උපේක්ෂාව සහිත වූ සිතින් ද එක් දිශාවක් පැතිර වාසය කරයි. එසේම දෙවන දිශාව ද, එසේම තෙවන දිශාව ද, එසේම සතරවන දිශාව ද, මෙසේ උඩ, යට, හරස් අතට, සෑම තැනම, සියලු ආත්මභාවයන් තුළින්, මුළු ලෝකයම උපේක්ෂාව සහිත වූ, විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පැතිර වාසය කරයි.\n\nකාලාමයිනි, ඒ ආර්‍ය්‍ය ශ්‍රාවක තෙම මෙසේ වෛර රහිත සිත් ඇත්තේ, ව්‍යාපාද රහිත සිත් ඇත්තේ, නොකිලිටි සිත් ඇත්තේ, පිරිසිදු සිත් ඇත්තේ ය. ඔහුට මේ දැක්මෙහිම කරුණු සතරක් ගැන සහතික ලබන්නට ලැබේ. ‘සැබැවින්ම පරලොවක් තිබේ නම්, සුචරිත දුශ්චරිත කර්මයන්ගේ ඵල විපාකයක් තිබේ නම්, මම කය බිඳී මරණින් මතු සුගතිය වූ ස්වර්ග ලෝකයේ උපදින්නෙමි’ යනු ඔහු ලබන පළමු වන සහතිකය වන්නේ ය.\n\n‘සැබැවින්ම පරලොවක් නැත නම්, සුචරිත දුශ්චරිත කර්මයන්ගේ ඵල විපාකයක් නැත නම්, මම මෙලොවදීම වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, පීඩා රහිත වූ, සුවපත් වූ ආත්මයක් පවත්වාගෙන යන්නෙමි’ යනු ඔහු ලබන දෙවෙනි සහතිකය වන්නේ ය.\n\n‘සැබැවින්ම පව් කරන කල්හි පාපයක් සිදු වේ නම්, මම කිසිවෙකුටත් පාපයක් නොසිතමි. පව්කම් නොකරන මා දුක ස්පර්ශ කරන්නේ කෙසේ ද?’ යනු ඔහු ලබන තෙවැනි සහතිකය වන්නේ ය.\n\n‘සැබැවින්ම පව් කරන කල්හි පාපයක් සිදු නොවේ නම්, මම දෙයාකාරයෙන්ම පිරිසිදු වූ ආත්මයක් දකිමි’ යනු ඔහු ලබන සතරවැනි සහතිකය වන්නේ ය.\n\nකාලාමයිනි, ඒ ආර්‍ය්‍ය ශ්‍රාවක තෙම මෙසේ වෛර රහිත සිත් ඇත්තේ, ව්‍යාපාද රහිත සිත් ඇත්තේ, නොකිලිටි සිත් ඇත්තේ, පිරිසිදු සිත් ඇත්තේ ය.\n\n\"ඔහුට මේ දැක්ම ඇති මේ ධර්මය තුළම මේ සතර ආකාර වූ සහනයෝ අත්පත් වෙති.\"\n\"එසේය භාග්‍යවතුන් වහන්ස, එසේය සුගතයන් වහන්ස! වහන්ස, ඒ ආර්යශ්‍රාවකයා මේ අයුරින් වෛරයෙන් තොර සිතැත්තෙක්, මේ අයුරින් ව්‍යාපාදයෙන් තොර සිතැත්තෙක්, මේ අයුරින් කෙලෙස්වලින් තොර සිතැත්තෙක්, මේ අයුරින් පිරිසුදු සිතැත්තෙක් වන්නේය. ඔහුට මේ දැක්ම ඇති ධර්මය තුළම සතර ආකාර වූ සහනයෝ අත්පත් වෙති.\n\n‘යම් හෙයකින් පරලොවක් වේ නම්, යහපත් හා අයහපත් කර්මයන්ගේ ඵලයක් විපාකයක් වේ නම්, එසේ නම් මම කය බිඳී මරණින් පසු සුගතියක් වූ ස්වර්ග ලෝකයෙහි උපදින්නෙමි’ යනු මේ ඔහුගේ අත්පත් වූ පළමුවන සහනයයි.\n\n‘යම් හෙයකින් පරලොවක් නැත්නම්, යහපත් හා අයහපත් කර්මයන්ගේ ඵලයක් විපාකයක් නැත්නම්, එසේ නම් මම මේ දැක්ම ඇති ධර්මය තුළම වෛරයෙන් තොරව, ව්‍යාපාදයෙන් තොරව, පීඩාවකින් තොරව, සුවසේ කල් ගෙවන්නෙමි’ යනු මේ ඔහුගේ අත්පත් වූ දෙවන සහනයයි.\n\n‘යම් හෙයකින් පව්කම් කිරීමෙන් පාපය සිදුවේ නම්, එහෙත් මම කිසිවකුට පවක් අරමුණු නොකරමි. එසේ නම් පව්කම් නොකරන මා පීඩාවට පත් කරනු ලබන්නේ කොතැනින්ද?’ යනු මේ ඔහුගේ අත්පත් වූ තෙවන සහනයයි.\n\n‘යම් හෙයකින් පව්කම් කිරීමෙන් පාපය සිදු නොවේ නම්, එසේ නම් මම ඒ උභය ආකාරයෙන්ම පිරිසිදු වූ ස්වභාවයක් ම විදින්නෙමි’ යනු මේ ඔහුගේ අත්පත් වූ සතරවන සහනයයි.\n\nවහන්ස, ඒ ආර්යශ්‍රාවකයා මේ අයුරින් වෛරයෙන් තොර සිතැත්තෙක්, මේ අයුරින් ව්‍යාපාදයෙන් තොර සිතැත්තෙක්, මේ අයුරින් කෙලෙස්වලින් තොර සිතැත්තෙක්, මේ අයුරින් පිරිසුදු සිතැත්තෙක් වන්නේය. ඔහුට මේ දැක්ම ඇති මේ ධර්මය තුළම මේ සතර ආකාර වූ සහනයෝ අත්පත් වෙති.\n\n\"අතිශයින් ම මැනවි, වහන්ස... (පෙ)... වහන්ස, අපි ඒ භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, භික්ෂුසංඝයා ද සරණ යමු. වහන්ස, අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයින් ලෙස භාග්‍යවතුන් වහන්සේ අපව දරාගන්නා සේක්වා.\" පස්වැනිය.",
      "paliTitle": "Kesamuttisuttaṃ"
    },
    {
      "number": 67,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā nandako sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho sāḷho ca migāranattā sāṇo ca sekhuniyanattā [rohaṇo ca pekhuṇiyanattā (sī. syā. kaṃ. pī.)] yenāyasmā nandako tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ nandakaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnaṃ kho sāḷhaṃ migāranattāraṃ āyasmā nandako etadavoca – ‘‘Etha tumhe, sāḷhā, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe, sāḷhā, attanāva jāneyyātha ‘ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantī’ti, atha tumhe sāḷhā pajaheyyātha. ‘‘Taṃ kiṃ maññatha, sāḷhā, atthi lobho’’ti? ‘‘Evaṃ, bhante’’. ‘‘Abhijjhāti kho ahaṃ, sāḷhā, etamatthaṃ vadāmi. Luddho kho ayaṃ, sāḷhā, abhijjhālu pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sāḷhā, atthi doso’’ti? ‘‘Evaṃ, bhante’’. ‘‘Byāpādoti kho ahaṃ, sāḷhā, etamatthaṃ vadāmi. Duṭṭho kho ayaṃ, sāḷhā, byāpannacitto pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sāḷhā, atthi moho’’ti? ‘‘Evaṃ, bhante’’. ‘‘Avijjāti kho ahaṃ, sāḷhā, etamatthaṃ vadāmi. Mūḷho kho ayaṃ, sāḷhā, avijjāgato pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, parampi tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ ahitāya dukkhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sāḷhā, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Akusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Sāvajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññugarahitā, bhante’’. ‘‘Samattā samādinnā ahitāya dukkhāya saṃvattanti, no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā ahitāya dukkhāya saṃvattantīti. Evaṃ no ettha hotī’’ti. ‘‘Iti kho, sāḷhā, yaṃ taṃ avocumhā – ‘etha tumhe, sāḷhā, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe, sāḷhā, attanāva jāneyyātha – ime dhammā akusalā, ime dhammā sāvajjā, ime dhammā viññugarahitā, ime dhammā samattā samādinnā ahitāya dukkhāya saṃvattantīti, atha tumhe, sāḷhā, pajaheyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Etha tumhe, sāḷhā, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe, sāḷhā, attanāva jāneyyātha – ‘ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā hitāya sukhāya saṃvattantī’ti, atha tumhe, sāḷhā, upasampajja vihareyyātha. ‘‘Taṃ kiṃ maññatha, sāḷhā, atthi alobho’’ti? ‘‘Evaṃ, bhante’’. ‘‘Anabhijjhāti kho ahaṃ, sāḷhā, etamatthaṃ vadāmi. Aluddho kho ayaṃ, sāḷhā, anabhijjhālu neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati, parampi na tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sāḷhā, atthi adoso’’ti? ‘‘Evaṃ, bhante’’. ‘‘Abyāpādoti kho ahaṃ, sāḷhā, etamatthaṃ vadāmi. Aduṭṭho kho ayaṃ, sāḷhā, abyāpannacitto neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati, parampi na tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sāḷhā, atthi amoho’’ti? ‘‘Evaṃ, bhante’’. ‘‘Vijjāti kho ahaṃ, sāḷhā, etamatthaṃ vadāmi. Amūḷho kho ayaṃ, sāḷhā, vijjāgato neva pāṇaṃ hanati, na adinnaṃ ādiyati, na paradāraṃ gacchati, na musā bhaṇati, parampi na tathattāya samādapeti, yaṃ sa hoti dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sāḷhā, ime dhammā kusalā vā akusalā vā’’ti? ‘‘Kusalā, bhante’’. ‘‘Sāvajjā vā anavajjā vā’’ti? ‘‘Anavajjā, bhante’’. ‘‘Viññugarahitā vā viññuppasatthā vā’’ti? ‘‘Viññuppasatthā, bhante’’. ‘‘Samattā samādinnā hitāya sukhāya saṃvattanti, no vā? Kathaṃ vā ettha hotī’’ti? ‘‘Samattā, bhante, samādinnā hitāya sukhāya saṃvattantīti. Evaṃ no ettha hotī’’ti. ‘‘Iti kho, sāḷhā, yaṃ taṃ avocumhā – ‘etha tumhe, sāḷhā, mā anussavena, mā paramparāya, mā itikirāya, mā piṭakasampadānena, mā takkahetu, mā nayahetu, mā ākāraparivitakkena, mā diṭṭhinijjhānakkhantiyā, mā bhabbarūpatāya, mā samaṇo no garūti. Yadā tumhe, sāḷhā, attanāva jāneyyātha – ime dhammā kusalā, ime dhammā anavajjā, ime dhammā viññuppasatthā, ime dhammā samattā samādinnā dīgharattaṃ hitāya sukhāya saṃvattantīti, atha tumhe, sāḷhā, upasampajja vihareyyāthā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Sa kho so, sāḷhā, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno patissato mettāsahagatena cetasā…pe… karuṇā…pe… muditā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjhena pharitvā viharati. So evaṃ pajānāti – ‘atthi idaṃ, atthi hīnaṃ, atthi paṇītaṃ, atthi imassa saññāgatassa uttari [uttariṃ (sī. syā. kaṃ. pī.)] nissaraṇa’nti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. ‘‘So evaṃ pajānāti – ‘ahu pubbe lobho, tadahu akusalaṃ, so etarahi natthi, iccetaṃ kusalaṃ; ahu pubbe doso…pe… ahu pubbe moho, tadahu akusalaṃ, so etarahi natthi, iccetaṃ kusala’nti. So diṭṭheva dhamme nicchāto nibbuto sītibhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharatī’’ti. Chaṭṭhaṃ.",
      "english": "Thus have I heard. On one occasion the Venerable Nandaka was staying near Sāvatthī, in the Pubbārāma, the Palace of Migāra’s Mother. Then Sāḷha, the grandson of Migāra, and Sāṇa, the grandson of Sekhunī, approached the Venerable Nandaka. Having approached, they respectfully greeted the Venerable Nandaka and sat down to one side.\n\nTo Sāḷha, the grandson of Migāra, who was sitting to one side, the Venerable Nandaka said this: “Come, Sāḷha, do not be led by what you have merely heard, nor by traditional lineage, nor by hearsay, nor by reliance on collections of texts, nor by mere reasoning, nor by inference, nor by reflecting upon appearances, nor by agreement with a cherished view, nor by the plausibility of the speaker, nor because ‘The ascetic is our respected teacher.’ But when you yourselves, Sāḷha, know: ‘These qualities are unwholesome, these qualities are blameworthy, these qualities are censured by the wise, these qualities, when undertaken and practiced, lead to harm and suffering’—then, Sāḷha, you should abandon them.”\n\n“What do you think, Sāḷha, is there greed?” “Yes, venerable sir.” “Greed, Sāḷha, I declare to be covetousness. A person who is greedy, Sāḷha, and covetous, kills living beings, takes what is not given, goes after the wives of others, speaks falsehood, and encourages others to do the same, which leads to harm and suffering for a long time.” “Yes, venerable sir.”\n\n“What do you think, Sāḷha, is there hatred?” “Yes, venerable sir.” “Hatred, Sāḷha, I declare to be ill will. A person who is hateful, Sāḷha, and filled with ill will, kills living beings, takes what is not given, goes after the wives of others, speaks falsehood, and encourages others to do the same, which leads to harm and suffering for a long time.” “Yes, venerable sir.”\n\n“What do you think, Sāḷha, is there delusion?” “Yes, venerable sir.” “Delusion, Sāḷha, I declare to be ignorance. A person who is deluded, Sāḷha, and overcome by ignorance, kills living beings, takes what is not given, goes after the wives of others, speaks falsehood, and encourages others to do the same, which leads to harm and suffering for a long time.” “Yes, venerable sir.”\n\n“What do you think, Sāḷha, are these qualities wholesome or unwholesome?” “Unwholesome, venerable sir.” “Are they blameworthy or blameless?” “Blameworthy, venerable sir.” “Are they censured by the wise or praised by the wise?” “Censured by the wise, venerable sir.” “When undertaken and practiced, do they lead to harm and suffering, or not? How does this seem to you?” “Venerable sir, when undertaken and practiced, they lead to harm and suffering. This is how it seems to us.”\n\n“Therefore, Sāḷha, what we said: ‘Come, Sāḷha, do not be led by what you have merely heard, nor by traditional lineage... [through]... then, Sāḷha, you should abandon them’—that statement was made with reference to this.”\n\n“Come, Sāḷha, do not be led by what you have merely heard, nor by traditional lineage, nor by hearsay, nor by reliance on collections of texts, nor by mere reasoning, nor by inference, nor by reflecting upon appearances, nor by agreement with a cherished view, nor by the plausibility of the speaker, nor because ‘The ascetic is our respected teacher.’ But when you yourselves, Sāḷha, know: ‘These qualities are wholesome, these qualities are blameless, these qualities are praised by the wise, these qualities, when undertaken and practiced, lead to welfare and happiness’—then, Sāḷha, you should undertake them and dwell in them.”\n\n“What do you think, Sāḷha, is there non-greed?” “Yes, venerable sir.” “Non-greed, Sāḷha, I declare to be non-covetousness. A person who is not greedy, Sāḷha, and is non-covetous, neither kills living beings, nor takes what is not given, nor goes after the wives of others, nor speaks falsehood, nor encourages others to do the same, which leads to welfare and happiness for a long time.” “Yes, venerable sir.”\n\n“What do you think, Sāḷha, is there non-hatred?” “Yes, venerable sir.” “Non-hatred, Sāḷha, I declare to be non-ill will. A person who is not hateful, Sāḷha, and is free from ill will, neither kills living beings, nor takes what is not given, nor goes after the wives of others, nor speaks falsehood, nor encourages others to do the same, which leads to welfare and happiness for a long time.” “Yes, venerable sir.”\n\n“What do you think, Sāḷha, is there non-delusion?” “Yes, venerable sir.” “Non-delusion, Sāḷha, I declare to be true knowledge. A person who is not deluded, Sāḷha, and possesses true knowledge, neither kills living beings, nor takes what is not given, nor goes after the wives of others, nor speaks falsehood, nor encourages others to do the same, which leads to welfare and happiness for a long time.” “Yes, venerable sir.”\n\nWhat do you think, Sāḷhā, are these qualities wholesome or unwholesome?\nThey are wholesome, venerable sir.\nAre they blameworthy or blameless?\nThey are blameless, venerable sir.\nAre they criticized by the wise or praised by the wise?\nThey are praised by the wise, venerable sir.\nWhen fully undertaken and adopted, do they lead to welfare and happiness, or not? How is it in this case?\nWhen fully undertaken and adopted, venerable sir, they lead to welfare and happiness. This is how it is for us in this case.\nTherefore, Sāḷhā, that which we told you—‘Come, Sāḷhā, do not go by mere repeatedly hearing, nor by lineage, nor by rumor, nor by scripture, nor by logical conjecture, nor by inference, nor by considering appearances, nor by the approval of reflective thinking, nor because the subject is plausible, nor because ‘The recluse is our teacher.’ But, Sāḷhā, when you yourselves know: ‘These qualities are wholesome; these qualities are blameless; these qualities are praised by the wise; these qualities, when fully undertaken and adopted, lead to welfare and happiness for a long time,’ then you should enter upon and abide in them’—that is what we said, and it was said with reference to this.\n\nThat noble disciple, Sāḷhā, thus without covetousness, without ill will, not deluded, clearly comprehending, and mindful, abides pervading one direction with a mind imbued with loving-kindness, thus the second, thus the third, thus the fourth. Thus, above, below, across, everywhere, in every way, he abides pervading the entire world with a mind imbued with equanimity, vast, elevated, measureless, free from hostility, and free from ill will. He understands thus: ‘There is this (attainment), there is the inferior, there is the superior, and there is a further escape beyond this sphere of perception.’ For him, who thus knows and thus sees, the mind is liberated from the taint of sensual desire, the mind is liberated from the taint of existence, and the mind is liberated from the taint of ignorance; and upon liberation, the knowledge ‘It is liberated’ arises. He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more returning to this state of being.’\n\nHe understands thus: ‘Formerly there was greed; that was unwholesome; but now it is absent; this is wholesome. Formerly there was hatred... formerly there was delusion; that was unwholesome; but now it is absent; this is wholesome.’ Thus, in this very life, he dwells without thirsting, quenched, cooled, experiencing happiness, having become like a great being within himself.",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක, ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේ සැවැත් නුවර පූර්වාරාමයෙහි මිගාරමාතු ප්‍රාසාදයෙහි වාසය කරති.\n\nඉක්බිති මිගාරගේ මුනුබුරු වූ සාළ්හ සහ සේකුණියගේ මුනුබුරු වූ සාණ යන දෙදෙනා ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේ වැඩ සිටි තැනට එළඹියහ. එළඹ, ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේට වන්දනා කර එකත්පසෙක වාඩි වූහ.\n\nඑකත්පසෙක වාඩි වී සිටි මිගාරගේ මුනුබුරු වූ සාළ්හට ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේ මෙය පැවසූහ: “සාළ්හයිනි, එන්න. පරම්පරාවෙන් එන කටකතා අසා, පරම්පරාවෙන් එන සිරිතක් නිසා, මෙය මෙසේ විය යුතුය යන විශ්වාසය නිසා, ධර්ම ග්‍රන්ථය සම්ප්‍රදායිකව ලැබුණු නිසා, තර්කයක් නිසා, න්‍යාය මාර්ගයක් නිසා, උපමා ආදියෙන් ගළපා බැලීමෙන්, තමන්ට නිශ්චය වූ දෘෂ්ටියක් ඉවසීමෙන් යුතුවීම නිසා, යම්කිසි පුද්ගලයෙකුගේ හැකියාව හෝ යෝග්‍යතාව නිසා, හෝ අපගේ ශ්‍රමණයන් වහන්සේ ගෞරවනීය යැයි සලකා යම් ධර්මයක් පිළි නොගන්න. සාළ්හයිනි, යම් කලක නුඹලා විසින්ම දැනගන්නවා නම්, ‘මේ ධර්මයෝ අකුසල වෙත්, මේ ධර්මයෝ දොස් සහිත වෙත්, මේ ධර්මයෝ නුවණැත්තන් විසින් ගැරහූ වෙත්, මේ ධර්මයෝ සමාදන් වී පිළිපැදීම නිසා අහිත පිණිසත් දුක් පිණිසත් පවතී’ කියා, එසේ නම්, සාළ්හයිනි, නුඹලා ඒවා අත්හරින්න.\n\n“සාළ්හයිනි, මේ පිළිබඳව නුඹලා කුමක් සිතන්නෙහිද, ලෝභය තිබේද?” “එසේය, වහන්ස.” “සාළ්හයිනි, මේ ලෝභයම ‘අභිජ්ඣා’ (තද ආශාව) යයි මම කියමි. සාළ්හයිනි, යම් කෙනෙක් ලෝභ සහිත වී, අභිජ්ඣාවෙන් යුක්තව ප්‍රාණඝාතයද කරති, නුදුන් දේද ගනිති, පර ස්ත්‍රීන් කෙරෙහි ද යති, බොරුද කියති, අන්‍යයන් ද ඒ ආකාරයෙන් සමාදන් කරවති, එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක් පිණිසත් පවතී.” “එසේය, වහන්ස.”\n\n“සාළ්හයිනි, මේ පිළිබඳව නුඹලා කුමක් සිතන්නෙහිද, ද්වේශය තිබේද?” “එසේය, වහන්ස.” “සාළ්හයිනි, මේ ද්වේශයම ‘ව්‍යාපාද’ (වෛර කිරීම) යයි මම කියමි. සාළ්හයිනි, යම් කෙනෙක් ද්වේශ සහිත වී, ව්‍යාපාද චිත්තයෙන් යුක්තව ප්‍රාණඝාතයද කරති, නුදුන් දේද ගනිති, පර ස්ත්‍රීන් කෙරෙහි ද යති, බොරුද කියති, අන්‍යයන් ද ඒ ආකාරයෙන් සමාදන් කරවති, එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක් පිණිසත් පවතී.” “එසේය, වහන්ස.”\n\n“සාළ්හයිනි, මේ පිළිබඳව නුඹලා කුමක් සිතන්නෙහිද, මෝහය තිබේද?” “එසේය, වහන්ස.” “සාළ්හයිනි, මේ මෝහයම ‘අවිද්‍යාව’ (නොදැකීම) යයි මම කියමි. සාළ්හයිනි, යම් කෙනෙක් මුළා වී, අවිද්‍යාවට ගොස් ප්‍රාණඝාතයද කරති, නුදුන් දේද ගනිති, පර ස්ත්‍රීන් කෙරෙහි ද යති, බොරුද කියති, අන්‍යයන් ද ඒ ආකාරයෙන් සමාදන් කරවති, එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක් පිණිසත් පවතී.” “එසේය, වහන්ස.”\n\n“සාළ්හයිනි, මේ ධර්මයෝ කුසලද, අකුසලද?” “අකුසලයි, වහන්ස.” “දොස් සහිතද, දොස් රහිතද?” “දොස් සහිතයි, වහන්ස.” “නුවණැත්තන් විසින් ගැරහූ ඒවාද, නුවණැත්තන් විසින් පසසන ලද ඒවාද?” “නුවණැත්තන් විසින් ගැරහූ ඒවායි, වහන්ස.” “සමාදන් වී පිළිපැදීමෙන් අහිත පිණිස දුක් පිණිස පවතීද, නැද්ද? නැතහොත් මේ පිළිබඳව කෙසේද වන්නේ?” “වහන්ස, සමාදන් වී පිළිපැදීමෙන් අහිත පිණිස දුක් පිණිස පවතී. මේ පිළිබඳව අපට ඇත්තේ එවැනි මතයකි.”\n\n“සාළ්හයිනි, අපි යම් දෙයක් ‘සාළ්හයිනි, එන්න, පරම්පරාවෙන් එන කටකතා අසා, පරම්පරාවෙන් එන සිරිතක් නිසා, මෙය මෙසේ විය යුතුය යන විශ්වාසය නිසා, ධර්ම ග්‍රන්ථය සම්ප්‍රදායිකව ලැබුණු නිසා, තර්කයක් නිසා, න්‍යාය මාර්ගයක් නිසා, උපමා ආදියෙන් ගළපා බැලීමෙන්, තමන්ට නිශ්චය වූ දෘෂ්ටියක් ඉවසීමෙන් යුතුවීම නිසා, යම්කිසි පුද්ගලයෙකුගේ හැකියාව හෝ යෝග්‍යතාව නිසා, හෝ අපගේ ශ්‍රමණයන් වහන්සේ ගෞරවනීය යැයි සලකා යම් ධර්මයක් පිළි නොගන්න. යම් කලක නුඹලා විසින්ම දැනගන්නවා නම්, මේ ධර්මයෝ අකුසල වෙත්, දොස් සහිත වෙත්, නුවණැත්තන් විසින් ගැරහූ වෙත්, සමාදන් වී පිළිපැදීම නිසා අහිත පිණිසත් දුක් පිණිසත් පවතී’ කියා, එසේ නම්, සාළ්හයිනි, නුඹලා ඒවා අත්හරින්න’ යැයි කීවෙමු ද, ඒ කීම මේ කරුණු නිසා කියන ලදී.\n\n“සාළ්හයිනි, එන්න, පරම්පරාවෙන් එන කටකතා අසා, පරම්පරාවෙන් එන සිරිතක් නිසා, මෙය මෙසේ විය යුතුය යන විශ්වාසය නිසා, ධර්ම ග්‍රන්ථය සම්ප්‍රදායිකව ලැබුණු නිසා, තර්කයක් නිසා, න්‍යාය මාර්ගයක් නිසා, උපමා ආදියෙන් ගළපා බැලීමෙන්, තමන්ට නිශ්චය වූ දෘෂ්ටියක් ඉවසීමෙන් යුතුවීම නිසා, යම්කිසි පුද්ගලයෙකුගේ හැකියාව හෝ යෝග්‍යතාව නිසා, හෝ අපගේ ශ්‍රමණයන් වහන්සේ ගෞරවනීය යැයි සලකා යම් ධර්මයක් පිළි නොගන්න. සාළ්හයිනි, යම් කලක නුඹලා විසින්ම දැනගන්නවා නම්, ‘මේ ධර්මයෝ කුසල වෙත්, මේ ධර්මයෝ දොස් රහිත වෙත්, මේ ධර්මයෝ නුවණැත්තන් විසින් පසසන ලද වෙත්, මේ ධර්මයෝ සමාදන් වී පිළිපැදීම නිසා හිත පිණිසත් සුව පිණිසත් පවතී’ කියා, එසේ නම්, සාළ්හයිනි, නුඹලා ඒවා සමාදන් වී වාසය කරන්න.\n\n“සාළ්හයිනි, මේ පිළිබඳව නුඹලා කුමක් සිතන්නෙහිද, අලෝභය තිබේද?” “එසේය, වහන්ස.” “සාළ්හයිනි, මේ අලෝභයම ‘අනභිජ්ඣා’ යයි මම කියමි. සාළ්හයිනි, යම් කෙනෙක් අලෝභ සහිත වී, අනභිජ්ඣාවෙන් යුක්තව ප්‍රාණඝාතය නොකරති, නුදුන් දේ නොගනිති, පර ස්ත්‍රීන් කෙරෙහි නොයති, බොරු නොකියති, අන්‍යයන් ද ඒ ආකාරයෙන් සමාදන් කරවති, එය ඔවුන්ට දීර්ඝ කාලයක් හිත පිණිසත් සුව පිණිසත් පවතී.” “එසේය, වහන්ස.”\n\n“සාළ්හයිනි, මේ පිළිබඳව නුඹලා කුමක් සිතන්නෙහිද, අද්වේශය තිබේද?” “එසේය, වහන්ස.” “සාළ්හයිනි, මේ අද්වේශයම ‘අව්‍යාපාද’ (වෛර නොකිරීම) යයි මම කියමි. සාළ්හයිනි, යම් කෙනෙක් අද්වේශ සහිත වී, අව්‍යාපාද චිත්තයෙන් යුක්තව ප්‍රාණඝාතය නොකරති, නුදුන් දේ නොගනිති, පර ස්ත්‍රීන් කෙරෙහි නොයති, බොරු නොකියති, අන්‍යයන් ද ඒ ආකාරයෙන් සමාදන් කරවති, එය ඔවුන්ට දීර්ඝ කාලයක් හිත පිණිසත් සුව පිණිසත් පවතී.” “එසේය, වහන්ස.”\n\n“සාළ්හයිනි, මේ පිළිබඳව නුඹලා කුමක් සිතන්නෙහිද, අමෝහය තිබේද?” “එසේය, වහන්ස.” “සාළ්හයිනි, මේ අමෝහයම ‘විද්‍යාව’ යයි මම කියමි. සාළ්හයිනි, යම් කෙනෙක් නොමුළා වී, විද්‍යාවට ගොස් ප්‍රාණඝාතය නොකරති, නුදුන් දේ නොගනිති, පර ස්ත්‍රීන් කෙරෙහි නොයති, බොරු නොකියති, අන්‍යයන් ද ඒ ආකාරයෙන් සමාදන් කරවති, එය ඔවුන්ට දීර්ඝ කාලයක් හිත පිණිසත් සුව පිණිසත් පවතී.” “එසේය, වහන්ස.”\n\nසාලවරුනි, ඔබ මේ කුමක් සිතන්නේද? මේ ධර්‍මතාවයෝ කුශල ධර්‍මද? අකුශල ධර්‍මද? ‘‘ස්වාමීනි, කුශල ධර්‍මයි’’. ‘‘දොස් සහිතද? දොස් රහිතද?’’ ‘‘ස්වාමීනි, දොස් රහිතයි’’. ‘‘විඤ්ඤුන් විසින් ගැරහීමට ලක්වූවෝද? විඤ්ඤුන් විසින් ප්‍රශංසා කරන ලද්දෝද?’’ ‘‘ස්වාමීනි, විඤ්ඤුන් විසින් ප්‍රශංසා කරන ලද්දෝය’’. ‘‘සම්පූර්‍ණයෙන් ගෙන සමාදන් වූ කල්හි හිත සුව පිණිස පවතීද? නොපවතීද? මේ පිළිබඳව ඔබගේ අදහස කුමක්ද?’’ ‘‘ස්වාමීනි, සම්පූර්‍ණයෙන් ගෙන සමාදන් වූ කල්හි හිත සුව පිණිසම පවතී. අපට නම් මේ පිළිබඳව එසේම වන්නේය’’.\n\nසාලවරුනි, එසේ නම් අප විසින් ඔබට මෙසේ කියන ලද්දේය: ‘සාලවරුනි, අනුශ්‍රවයෙන් (කෙලින්ම අසා) භාර නොගනිවු, පරම්පරාගතව පැවත එන දෙයක් ලෙස භාර නොගනිවු, එය එසේමය යන කටකතාවෙන් භාර නොගනිවු, පි‍ටක සම්ප්‍රදායෙන් (ධර්ම ග්‍රන්ථවල සඳහන් නිසා) භාර නොගනිවු, තර්‍ක හේතුවෙන් භාර නොගනිවු, නය හේතුවෙන් (ක්‍රමයක් ලෙස) භාර නොගනිවු, ආකාර සහිතව විතර්‍ක කිරීමෙන් භාර නොගනිවු, දෘෂ්ටීන් (තමන් පිළිගත් මත) පිළිබඳව ඉවසීමෙන් (ඒවා නිවැරදි යැයි) භාර නොගනිවු, භව්‍ය වූ රූපයකින් (පෙනුමෙන්) භාර නොගනිවු, ‘ශ්‍රමණයෝ අපගේ ගුරුතුමාය’ යන (ගෞරවය) නිසා භාර නොගනිවු. සාලවරුනි, යම් කලක ‘මේ ධර්‍මතා කුශල ධර්‍මයෝය, මේ ධර්‍මතා දොස් රහිතය, මේ ධර්‍මතා විඤ්ඤූන් විසින් ප්‍රශංසා කරන ලද්දාහුය, මේ ධර්‍මතා සමාදන් වූ කල්හි දීර්ඝ කාලයක් හිත සුව පිණිස පවතී’ යැයි ඔබ විසින්ම දැන ගන්නේද, සාලවරුනි, එවිට ඔබ ඒවා සමාදන්ව වාසය කරව්’ යැයි අප විසින් යමක් කියන ලද්දේ නම්, මේ කරුණ මුල්කොට ගෙනය.\n\nසාලවරුනි, ඒ ආර්‍ය්‍ය ශ්‍රාවකයා මෙසේ විගත වූ අභිධ්‍යා ඇත්තේ, විගත වූ ව්‍යාපාද ඇත්තේ, මුළා නොවූයේ, සම්‍පජාන ඇත්තේ, සිහි ඇත්තේ වන්නේය. මෛත්‍රී සහගත වූ සිතින්... එසේම කරුණාව... එසේම මුදිතාව... එසේම උපේක්ෂාව සහගත වූ සිතින් එක් දිශාවක් පතුරුවා වාසය කරන්නේය. එසේම දෙවෙනි දිශාවද, එසේම තුන්වෙනි දිශාවද, එසේම සිව්වෙනි දිශාවද පතුරුවා හරියි. මෙසේ උඩින්, යටින්, හරහට, සියල්ලෙහි, සියලු අයුරින්, සියලු ලෝකය උපේක්ෂාව සහගත වූ සිතින් යුක්තව, විශාල වූ, මහත් බවට ගිය, අප්‍රමාණය වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කරන්නේය. ඔහු මෙසේ විශේෂයෙන් දන්නේය: ‘මේ (උපේක්ෂාව) ඇත්තේය, මෙයට වඩා හීන වූ (කෙලෙස් සහිත තත්ත්වය) ඇත්තේය, මෙයට වඩා උසස් වූ (විමුක්ති ඵලයක්) ඇත්තේය, මේ සංඥා භාවය ඉක්මවා ගිය නිස්සරණයක් (නිර්වාණය) ඇත්තේය’ යන්නයි.\n\nමෙසේ දන්නා, මෙසේ දක්නා වූ ඔහුගේ සිත කාම ආශ්‍රවයන්ගෙන්ද මිදෙන්නේය, භව ආශ්‍රවයන්ගෙන්ද මිදෙන්නේය, අවිද්‍යා ආශ්‍රවයන්ගෙන්ද මිදෙන්නේය. මිදුණු කල්හි ‘මිදුණේය’ යන ඥානය ඇති වන්නේය. ‘උපත ක්ෂය විය, බ්‍රහ්මචරියාව වාසය කරන ලදී, කළ යුත්ත කරන ලදී, නැවත මේ තත්ත්වයට පැමිණීමක් නැත’ යැයි ඔහු විශේෂයෙන් දන්නේය.\n\nඔහු මෙසේ දන්නේය: ‘පෙර ලෝභය තිබුණේය, එය අකුශලය. එය දැන් නැත, එබැවින් මෙය කුශලය. පෙර ද්වේෂය තිබුණේය... පෙර මෝහය තිබුණේය, එය අකුශලය. එය දැන් නැත, එබැවින් මෙය කුශලය’ යන්නයි. ඔහු මේ දෘෂ්ට ධර්‍මයෙහිදීම ආශාවන්ගෙන් මිදුණේය, නිවුණේය, සිහිල් වූයේය, සුවය විඳින්නෙක් වන්නේය. බ්‍රහ්ම ස්වභාවයට පත් වූ ආත්මභාවයකින් යුතුව වාසය කරන්නේය.",
      "paliTitle": "Sāḷhasuttaṃ"
    },
    {
      "number": 68,
      "pali": "‘‘Tīṇimāni, bhikkhave, kathāvatthūni. Katamāni tīṇi? Atītaṃ vā, bhikkhave, addhānaṃ ārabbha kathaṃ katheyya – ‘evaṃ ahosi atītamaddhāna’nti. Anāgataṃ vā, bhikkhave, addhānaṃ ārabbha kathaṃ katheyya – ‘evaṃ bhavissati anāgatamaddhāna’nti. Etarahi vā, bhikkhave, paccuppannaṃ addhānaṃ ārabbha kathaṃ katheyya – ‘evaṃ hoti etarahi paccuppannamaddhāna’’’nti [evaṃ etarahi paccuppannanti (sī. pī. ka.), evaṃ hoti etarahi paccuppannanti (syā. kaṃ.)]. ‘‘Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno ekaṃsabyākaraṇīyaṃ pañhaṃ na ekaṃsena byākaroti, vibhajjabyākaraṇīyaṃ pañhaṃ na vibhajja byākaroti, paṭipucchābyākaraṇīyaṃ pañhaṃ na paṭipucchā byākaroti, ṭhapanīyaṃ pañhaṃ na ṭhapeti [thapanīyaṃ pañhaṃ na thapeti (ka.)], evaṃ santāyaṃ, bhikkhave, puggalo akaccho hoti. Sace panāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno ekaṃsabyākaraṇīyaṃ pañhaṃ ekaṃsena byākaroti, vibhajjabyākaraṇīyaṃ pañhaṃ vibhajja byākaroti, paṭipucchābyākaraṇīyaṃ pañhaṃ paṭipucchā byākaroti, ṭhapanīyaṃ pañhaṃ ṭhapeti, evaṃ santāyaṃ, bhikkhave, puggalo kaccho hoti. ‘‘Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno ṭhānāṭhāne na saṇṭhāti parikappe na saṇṭhāti aññātavāde [aññavāde (sī. syā. kaṃ. pī.), aññātavāre (ka.)] na saṇṭhāti paṭipadāya na saṇṭhāti, evaṃ santāyaṃ, bhikkhave, puggalo akaccho hoti. Sace panāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno ṭhānāṭhāne saṇṭhāti parikappe saṇṭhāti aññātavāde saṇṭhāti paṭipadāya saṇṭhāti, evaṃ santāyaṃ, bhikkhave, puggalo kaccho hoti. ‘‘Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno aññenaññaṃ paṭicarati, bahiddhā kathaṃ apanāmeti, kopañca dosañca appaccayañca pātukaroti, evaṃ santāyaṃ, bhikkhave, puggalo akaccho hoti. Sace panāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno na aññenaññaṃ paṭicarati na bahiddhā kathaṃ apanāmeti, na kopañca dosañca appaccayañca pātukaroti, evaṃ santāyaṃ, bhikkhave, puggalo kaccho hoti. ‘‘Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā kaccho yadi vā akacchoti. Sacāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno abhiharati abhimaddati anupajagghati [anusaṃjagghati (ka.)] khalitaṃ gaṇhāti, evaṃ santāyaṃ, bhikkhave, puggalo akaccho hoti. Sace panāyaṃ, bhikkhave, puggalo pañhaṃ puṭṭho samāno nābhiharati nābhimaddati na anupajagghati na khalitaṃ gaṇhāti, evaṃ santāyaṃ, bhikkhave, puggalo kaccho hoti. ‘‘Kathāsampayogena, bhikkhave, puggalo veditabbo yadi vā saupaniso yadi vā anupanisoti. Anohitasoto, bhikkhave, anupaniso hoti, ohitasoto saupaniso hoti. So saupaniso samāno abhijānāti ekaṃ dhammaṃ, parijānāti ekaṃ dhammaṃ, pajahati ekaṃ dhammaṃ, sacchikaroti ekaṃ dhammaṃ. So abhijānanto ekaṃ dhammaṃ, parijānanto ekaṃ dhammaṃ, pajahanto ekaṃ dhammaṃ, sacchikaronto ekaṃ dhammaṃ sammāvimuttiṃ phusati. Etadatthā, bhikkhave, kathā; etadatthā mantanā; etadatthā upanisā; etadatthaṃ sotāvadhānaṃ, yadidaṃ anupādā cittassa vimokkhoti. ‘‘Ye viruddhā sallapanti, viniviṭṭhā samussitā; Anariyaguṇamāsajja, aññoññavivaresino. ‘‘Dubbhāsitaṃ vikkhalitaṃ, sampamohaṃ [sasammohaṃ (ka.)] parājayaṃ; Aññoññassābhinandanti, tadariyo kathanācare [tadariyo na kathaṃ vade (ka.)]. ‘‘Sace cassa kathākāmo, kālamaññāya paṇḍito; Dhammaṭṭhapaṭisaṃyuttā, yā ariyacaritā [ariyañcaritā (sī.), ariyādikā (ka.)] kathā. ‘‘Taṃ kathaṃ kathaye dhīro, aviruddho anussito; Anunnatena manasā, apaḷāso asāhaso. ‘‘Anusūyāyamāno so, sammadaññāya bhāsati; Subhāsitaṃ anumodeyya, dubbhaṭṭhe nāpasādaye [nāvasādaye (sī. pī.)]. ‘‘Upārambhaṃ na sikkheyya, khalitañca na gāhaye [na bhāsaye (ka.)]; Nābhihare nābhimadde, na vācaṃ payutaṃ bhaṇe. ‘‘Aññātatthaṃ pasādatthaṃ, sataṃ ve hoti mantanā; Evaṃ kho ariyā mantenti, esā ariyāna mantanā; Etadaññāya medhāvī, na samusseyya mantaye’’ti. sattamaṃ;",
      "english": "Monks, there are these three topics for discourse. What are the three? Monks, one may speak concerning the past period, saying: ‘Such was it in the past period.’ Monks, one may speak concerning the future period, saying: ‘Such will it be in the future period.’ Or, monks, one may speak concerning the present period, saying: ‘Such is it now in the present period.’\n\nMonks, a person is known by their engagement in discussion, whether they are skilled or unskilled. If, monks, when a person is questioned, they do not answer a question requiring a direct response directly, they do not answer a question requiring an analytical response analytically, they do not answer a question requiring a counter-question by counter-questioning, and they do not set aside a question that should be set aside—in this way, monks, that person is unskilled. If, however, monks, when a person is questioned, they answer a question requiring a direct response directly, they answer a question requiring an analytical response analytically, they answer a question requiring a counter-question by counter-questioning, and they set aside a question that should be set aside—in this way, monks, that person is skilled.\n\nMonks, a person is known by their engagement in discussion, whether they are skilled or unskilled. If, monks, when a person is questioned, they do not stand firm regarding what is proper and improper, they do not stand firm regarding inferences, they do not stand firm regarding accepted doctrine, and they do not stand firm regarding the path of practice—in this way, monks, that person is unskilled. If, however, monks, when a person is questioned, they stand firm regarding what is proper and improper, they stand firm regarding inferences, they stand firm regarding accepted doctrine, and they stand firm regarding the path of practice—in this way, monks, that person is skilled.\n\nMonks, a person is known by their engagement in discussion, whether they are skilled or unskilled. If, monks, when a person is questioned, they reply to one thing with another, they divert the talk away from the topic, and they exhibit anger, malice, and dissatisfaction—in this way, monks, that person is unskilled. If, however, monks, when a person is questioned, they do not reply to one thing with another, they do not divert the talk away from the topic, and they do not exhibit anger, malice, or dissatisfaction—in this way, monks, that person is skilled.\n\nMonks, a person is known by their engagement in discussion, whether they are skilled or unskilled. If, monks, when a person is questioned, they attack, they crush, they ridicule, and they seize upon errors—in this way, monks, that person is unskilled. If, however, monks, when a person is questioned, they do not attack, they do not crush, they do not ridicule, and they do not seize upon errors—in this way, monks, that person is skilled.\n\nMonks, a person is known by their engagement in discussion, whether they possess supporting conditions or lack supporting conditions. Monks, one whose attention is not directed lacks supporting conditions; one whose attention is directed possesses supporting conditions. Having supporting conditions, that person fully knows one principle, fully understands one principle, abandons one principle, and realizes one principle. Fully knowing one principle, fully understanding one principle, abandoning one principle, and realizing one principle, that person attains right liberation. This, monks, is the purpose of discourse; this is the purpose of consultation; this is the purpose of supporting conditions; this is the purpose of directing one’s attention—namely, the liberation of the mind through non-clinging.\n\nThose who speak in conflict, fixed in their views and inflated with pride,\nClinging to ignoble qualities, seeking out the faults of one another,\nThey delight in the ill-spoken, the erroneous, the confusion, and the defeat of the other.\nA noble one should not engage in such a discussion.\n\nIf the wise one desires discourse, knowing the proper time,\nThat discourse which is connected to the established Dhamma and is practiced by the Noble Ones—\nThe prudent one should engage in that discussion, without conflict and without conceit,\nWith an unexalted mind, without trickery, and without violence.\n\nNot being envious, they speak knowing the truth completely;\nThey should rejoice in what is well-spoken, and not be disheartened by what is poorly expressed.\nThey should not train in fault-finding, nor seize upon errors;\nThey should not attack, nor crush, nor utter speech that is provoking.\n\nThe consultation of the wise is for the purpose of insight and conviction.\nThus, the Noble Ones consult; this is the consultation of the Noble Ones.\nThe intelligent person, having understood this, should consult without conceit.",
      "sinhala": "භික්ෂූන් වහන්ස, මේවා කථා වස්තු තුනකි. ඒ කවරේද? භික්ෂූන් වහන්ස, යම් කෙනෙක් අතීත කාලය අරභයා කථාවක් කරන්නේ නම්— ‘අතීත කාලයේදී මෙසේ සිදුවිය’ යනුවෙනි. භික්ෂූන් වහන්ස, නැතහොත් අනාගත කාලය අරභයා කථාවක් කරන්නේ නම්— ‘අනාගත කාලයේදී මෙසේ සිදුවනු ඇත’ යනුවෙනි. භික්ෂූන් වහන්ස, නැතහොත් වර්තමාන කාලය අරභයා කථාවක් කරන්නේ නම්— ‘වර්තමාන කාලයේදී මෙසේ සිදුවේ’ යනුවෙනි.\n\nභික්ෂූන් වහන්ස, කථාවට සම්බන්ධ වීමෙන්, පුද්ගලයා විනිශ්චය කළ යුත්තේ ඔහු (සාකච්ඡාවට) අනුකූල ද අනුකූල නොවන ද යනුවෙනි. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, ඒකාංශයෙන් (එකම පිළිතුරක් දිය යුතු) ප්‍රශ්නයට ඒකාංශයෙන් පිළිතුරු නොදෙන්නේ නම්, විභජ්ජ (විභේදනය කරමින් පිළිතුරු දිය යුතු) ප්‍රශ්නයට විභේදනය කරමින් පිළිතුරු නොදෙන්නේ නම්, ප්‍රතිපෘච්ඡා (ප්‍රතිප්‍රශ්න ඇසීමෙන් පිළිතුරු දිය යුතු) ප්‍රශ්නයට ප්‍රතිප්‍රශ්න ඇසීමෙන් පිළිතුරු නොදෙන්නේ නම්, ඨපනීය (නිශ්ශබ්දව සිටිය යුතු) ප්‍රශ්නයට නිශ්ශබ්දව නොසිටින්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල නොවන කෙනෙක් වේ. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, ඒකාංශ ප්‍රශ්නයට ඒකාංශයෙන් පිළිතුරු දෙන්නේ නම්, විභජ්ජ ප්‍රශ්නයට විභේදනය කරමින් පිළිතුරු දෙන්නේ නම්, ප්‍රතිපෘච්ඡා ප්‍රශ්නයට ප්‍රතිප්‍රශ්න ඇසීමෙන් පිළිතුරු දෙන්නේ නම්, ඨපනීය ප්‍රශ්නයට නිශ්ශබ්දව සිටින්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල කෙනෙක් වේ.\n\nභික්ෂූන් වහන්ස, කථාවට සම්බන්ධ වීමෙන්, පුද්ගලයා අනුකූල ද අනුකූල නොවන ද යනුවෙන් විනිශ්චය කළ යුත්තේ ය. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, ඨානාඨාන (කාරණා සහ අකාරණා) පිළිබඳව ස්ථිරව නොසිටින්නේ නම්, පරිකල්ප (අදහස්) පිළිබඳව ස්ථිරව නොසිටින්නේ නම්, අන්‍ය දර්ශනවාද පිළිබඳව ස්ථිරව නොසිටින්නේ නම්, ප්‍රතිපදා (සම්පූර්ණ කළ යුතු මාර්ගය) පිළිබඳව ස්ථිරව නොසිටින්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල නොවන කෙනෙක් වේ. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, ඨානාඨාන පිළිබඳව ස්ථිරව සිටින්නේ නම්, පරිකල්ප පිළිබඳව ස්ථිරව සිටින්නේ නම්, අන්‍ය දර්ශනවාද පිළිබඳව ස්ථිරව සිටින්නේ නම්, ප්‍රතිපදා පිළිබඳව ස්ථිරව සිටින්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල කෙනෙක් වේ.\n\nභික්ෂූන් වහන්ස, කථාවට සම්බන්ධ වීමෙන්, පුද්ගලයා අනුකූල ද අනුකූල නොවන ද යනුවෙන් විනිශ්චය කළ යුත්තේ ය. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, එකකට අනෙකක් ගලපා පවසන්නේ නම්, කථාව පිටතට යොමු කරන්නේ නම්, කෝපය ද, ද්වේශය ද, අප්‍රසාදය ද ප්‍රකට කරන්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල නොවන කෙනෙක් වේ. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, එකකට අනෙකක් ගලපා නොපවසන්නේ නම්, කථාව පිටතට යොමු නොකරන්නේ නම්, කෝපය ද, ද්වේශය ද, අප්‍රසාදය ද ප්‍රකට නොකරන්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල කෙනෙක් වේ.\n\nභික්ෂූන් වහන්ස, කථාවට සම්බන්ධ වීමෙන්, පුද්ගලයා අනුකූල ද අනුකූල නොවන ද යනුවෙන් විනිශ්චය කළ යුත්තේ ය. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, තමාගේ මතය බලයෙන් ඉදිරිපත් කරන්නේ නම්, අන්‍යයාගේ මතය යටපත් කරන්නේ නම්, උපහාස කරමින් සිනාසෙන්නේ නම්, වරදක් අල්ලා ගන්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල නොවන කෙනෙක් වේ. භික්ෂූන් වහන්ස, යම් හෙයකින් මේ පුද්ගලයා ප්‍රශ්නයක් විමසන ලද විට, තමාගේ මතය බලයෙන් ඉදිරිපත් නොකරන්නේ නම්, අන්‍යයාගේ මතය යටපත් නොකරන්නේ නම්, උපහාස කරමින් සිනාසෙන්නේ නැත්නම්, වරදක් අල්ලා නොගන්නේ නම්, එසේ නම් භික්ෂූන් වහන්ස, මේ පුද්ගලයා අනුකූල කෙනෙක් වේ.\n\nභික්ෂූන් වහන්ස, කථාවට සම්බන්ධ වීමෙන්, පුද්ගලයා උපනිස්සය (හේතුව) සහිත ද උපනිස්සය රහිත ද යනුවෙන් විනිශ්චය කළ යුත්තේ ය. භික්ෂූන් වහන්ස, (ධර්මයට) නොයොදන ලද සවන් ඇත්තා උපනිස්සය රහිත වේ. යොදන ලද සවන් ඇත්තා උපනිස්සය සහිත වේ. ඒ උපනිස්සය සහිත වූ තැනැත්තා එක් ධර්මයක් අවබෝධ කරන්නේ ය, එක් ධර්මයක් පිරිසිඳ දන්නේ ය, එක් ධර්මයක් ප්‍රහීණ කරන්නේ ය, එක් ධර්මයක් ප්‍රත්‍යක්ෂ කරන්නේ ය. ඒ එක් ධර්මයක් අවබෝධ කරමින්, එක් ධර්මයක් පිරිසිඳ දනිමින්, එක් ධර්මයක් ප්‍රහීණ කරමින්, එක් ධර්මයක් ප්‍රත්‍යක්ෂ කරමින්, ඔහු සම්මා විමුක්තිය ස්පර්ශ කරයි. භික්ෂූන් වහන්ස, අනුපාදාන රහිතව චිත්ත විමුක්තිය ලැබීම යනු මේ කථාවේ අර්ථය යි; මේ මන්ත්‍රණයේ අර්ථය යි; මේ උපනිස්සයේ අර්ථය යි; මේ සවන් යෙදීමේ අර්ථය යි.\n\nයම් අයෙක් විරුද්ධ වෙමින් වාද කරත් ද, අභිමානයෙන් යුක්තව මතයන්හි එල්බ සිටිත් ද, අනාර්ය ගුණවලට පැමිණ, එකිනෙකාගේ වරද සොයමින් සිටිත් ද.\n\nදුර්භාෂිතය, වැරදීම, මුළාව, පරාජය යන මේවාට ඔවුහු එකිනෙකා ප්‍රීති වෙති. ආර්යයන් නම් එබඳු කථාවන් නොකළ යුතුය.\n\nපණ්ඩිතයා කථා කිරීමට කැමති වන්නේ නම්, කාලය දැනගෙන, ධර්මයට අනුව හා ප්‍රතිසංයුක්ත වූ, ආර්ය චර්යාවන්ට අදාළ කථාවන් ම කළ යුතුය.\n\nඒ කථාව ධෛර්යවන්තයා විරෝධයක් නැතිව, උඩඟු නැතිව, නොනැමුණු සිතින්, අලජ්ජී බවක් නැතිව, බලහත්කාරයෙන් තොරව පැවසිය යුතුය.\n\nඔහු ඊර්ෂ්‍යා නොකරන්නේ, මැනවින් දැනගෙන කථා කරන්නේ ය. සුභාෂිතයට අනුමෝදන් විය යුතුය, දුර්භාෂිතය ගැන අප්‍රසාදය ප්‍රකාශ නොකළ යුතුය.\n\nගර්හා කිරීම පුරුදු නොකළ යුතුය. වැරදීම් අල්ලා නොගත යුතුය. තම මතය බලයෙන් ඉදිරිපත් නොකළ යුතුය, යටපත් නොකළ යුතුය, අසංයත වචන නොකළ යුතුය.\n\nදැනගැනීම පිණිස ද, ප්‍රසාදය පිණිස ද සත්පුරුෂයන්ගේ මන්ත්‍රණය වේ. ආර්යයෝ මෙසේ මන්ත්‍රණය කරති. මෙය ආර්යයන්ගේ මන්ත්‍රණය යි. මේ බව දන්නා නුවණැත්තා උඩඟු නොවී මන්ත්‍රණය කළ යුතුය.",
      "paliTitle": "Kathāvatthusuttaṃ"
    },
    {
      "number": 69,
      "pali": "‘‘Sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘tayome, āvuso, dhammā. Katame tayo? Rāgo, doso, moho – ime kho, āvuso, tayo dhammā. Imesaṃ, āvuso, tiṇṇaṃ dhammānaṃ ko viseso ko adhippayāso [adhippāyo (sī.) adhippāyāso (syā. kaṃ. pī.) adhi + pa + yasu + ṇa = adhippayāso] kiṃ nānākaraṇa’nti? Evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ kinti byākareyyāthā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘tayome, āvuso, dhammā. Katame tayo? Rāgo, doso, moho – ime kho, āvuso, tayo dhammā; imesaṃ, āvuso, tiṇṇaṃ dhammānaṃ ko viseso ko adhippayāso kiṃ nānākaraṇa’nti? Evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘rāgo kho, āvuso, appasāvajjo dandhavirāgī, doso mahāsāvajjo khippavirāgī, moho mahāsāvajjo dandhavirāgī’’’ ti. ‘‘‘Ko panāvuso, hetu ko paccayo yena anuppanno vā rāgo uppajjati uppanno vā rāgo bhiyyobhāvāya vepullāya saṃvattatī’ti? ‘Subhanimittantissa vacanīyaṃ. Tassa subhanimittaṃ ayoniso manasi karoto anuppanno vā rāgo uppajjati uppanno vā rāgo bhiyyobhāvāya vepullāya saṃvattati. Ayaṃ kho, āvuso, hetu ayaṃ paccayo yena anuppanno vā rāgo uppajjati uppanno vā rāgo bhiyyobhāvāya vepullāya saṃvattatī’’’ti. ‘‘‘Ko panāvuso, hetu ko paccayo yena anuppanno vā doso uppajjati uppanno vā doso bhiyyobhāvāya vepullāya saṃvattatī’ti? ‘Paṭighanimittaṃ tissa vacanīyaṃ. Tassa paṭighanimittaṃ ayoniso manasi karoto anuppanno vā doso uppajjati uppanno vā doso bhiyyobhāvāya vepullāya saṃvattati. Ayaṃ kho, āvuso, hetu ayaṃ paccayo yena anuppanno vā doso uppajjati uppanno vā doso bhiyyobhāvāya vepullāya saṃvattatī’’’ti. ‘‘‘Ko panāvuso, hetu ko paccayo yena anuppanno vā moho uppajjati uppanno vā moho bhiyyobhāvāya vepullāya saṃvattatī’ti? ‘Ayoniso manasikāro tissa vacanīyaṃ. Tassa ayoniso manasi karoto anuppanno vā moho uppajjati uppanno vā moho bhiyyobhāvāya vepullāya saṃvattati. Ayaṃ kho, āvuso, hetu ayaṃ paccayo yena anuppanno vā moho uppajjati uppanno vā moho bhiyyobhāvāya vepullāya saṃvattatī’’’ti. ‘‘‘Ko panāvuso, hetu ko paccayo yena anuppanno ceva rāgo nuppajjati uppanno ca rāgo pahīyatī’ti? ‘Asubhanimittantissa vacanīyaṃ. Tassa asubhanimittaṃ yoniso manasi karoto anuppanno ceva rāgo nuppajjati uppanno ca rāgo pahīyati. Ayaṃ kho, āvuso, hetu ayaṃ paccayo yena anuppanno ceva rāgo nuppajjati uppanno ca rāgo pahīyatī’’’ti. ‘‘‘Ko panāvuso, hetu ko paccayo yena anuppanno ceva doso nuppajjati uppanno ca doso pahīyatī’ti? ‘Mettā cetovimuttī tissa vacanīyaṃ. Tassa mettaṃ cetovimuttiṃ yoniso manasi karoto anuppanno ceva doso nuppajjati uppanno ca doso pahīyati. Ayaṃ kho, āvuso, hetu ayaṃ paccayo yena anuppanno ceva doso nuppajjati uppanno ca doso pahīyatī’’’ti. ‘‘‘Ko panāvuso, hetu ko paccayo yena anuppanno ceva moho nuppajjati uppanno ca moho pahīyatī’ti? ‘Yonisomanasikāro tissa vacanīyaṃ. Tassa yoniso manasi karoto anuppanno ceva moho nuppajjati uppanno ca moho pahīyati. Ayaṃ kho, āvuso, hetu ayaṃ paccayo yena anuppanno vā moho nuppajjati uppanno ca moho pahīyatī’’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, if wandering ascetics of other sects should question you thus: ‘Friends, there are these three mental states. What three? Craving, aversion, and delusion—these, friends, are the three mental states. What is the distinction, what is the characteristic difference, what is the variety among these three mental states, friends?’ When questioned thus, monks, how would you answer those wandering ascetics of other sects?”\n\n“Venerable Sir, the teachings have the Blessed One as their root, the Blessed One as their guide, and the Blessed One as their refuge. It is excellent, Venerable Sir, if the meaning of this statement would occur to the Blessed One himself. Having heard it from the Blessed One, the monks will remember it.”\n\n“In that case, monks, listen, attend carefully; I shall speak.” “Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One said this:\n\n“If, monks, wandering ascetics of other sects should question you thus: ‘Friends, there are these three mental states. What three? Craving, aversion, and delusion—these, friends, are the three mental states. What is the distinction, what is the characteristic difference, what is the variety among these three mental states, friends?’ When questioned thus, monks, you should answer those wandering ascetics of other sects in this way: ‘Craving, friends, has minor fault but is slow to fade away. Aversion has great fault but is quick to fade away. Delusion has great fault and is slow to fade away.’”\n\n“‘And what, friends, is the cause, what is the condition, by which unarisen craving arises, or arisen craving conduces to increase and growth?’ It should be answered, ‘The sign of the beautiful. For one who attends improperly to the sign of the beautiful, unarisen craving arises, or arisen craving conduces to increase and growth. This, friends, is the cause, this is the condition, by which unarisen craving arises, or arisen craving conduces to increase and growth.’”\n\n“‘And what, friends, is the cause, what is the condition, by which unarisen aversion arises, or arisen aversion conduces to increase and growth?’ It should be answered, ‘The sign of irritation. For one who attends improperly to the sign of irritation, unarisen aversion arises, or arisen aversion conduces to increase and growth. This, friends, is the cause, this is the condition, by which unarisen aversion arises, or arisen aversion conduces to increase and growth.’”\n\n“‘And what, friends, is the cause, what is the condition, by which unarisen delusion arises, or arisen delusion conduces to increase and growth?’ It should be answered, ‘Improper attention. For one who attends improperly, unarisen delusion arises, or arisen delusion conduces to increase and growth. This, friends, is the cause, this is the condition, by which unarisen delusion arises, or arisen delusion conduces to increase and growth.’”\n\n“‘And what, friends, is the cause, what is the condition, by which unarisen craving does not arise, and arisen craving is abandoned?’ It should be answered, ‘The sign of the unattractive. For one who attends properly to the sign of the unattractive, unarisen craving does not arise, and arisen craving is abandoned. This, friends, is the cause, this is the condition, by which unarisen craving does not arise, and arisen craving is abandoned.’”\n\n“‘And what, friends, is the cause, what is the condition, by which unarisen aversion does not arise, and arisen aversion is abandoned?’ It should be answered, ‘The mental liberation through loving-kindness. For one who attends properly to the mental liberation through loving-kindness, unarisen aversion does not arise, and arisen aversion is abandoned. This, friends, is the cause, this is the condition, by which unarisen aversion does not arise, and arisen aversion is abandoned.’”\n\n“‘And what, friends, is the cause, what is the condition, by which unarisen delusion does not arise, and arisen delusion is abandoned?’ It should be answered, ‘Proper attention. For one who attends properly, unarisen delusion does not arise, and arisen delusion is abandoned. This, friends, is the cause, this is the condition, by which unarisen delusion does not arise, and arisen delusion is abandoned.’”",
      "sinhala": "මහණෙනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ඔබට මෙසේ ප්‍රශ්න කරන්නේ නම්— ‘ඇවැත්නි, මේ ධර්ම තුනකි. ඒ කවර තුනක් ද? රාගය, ද්වේෂය, මෝහය යන මේවා යි. ඇවැත්නි, මේ ධර්ම තුනෙහි ඇති විශේෂය කවරේද? අදහස කවරේද? වෙනස්කම කවරේදැ’යි? මහණෙනි, මෙසේ අසන ලද ඔබ, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට කෙසේ පිළිතුරු දෙන්නේ දැයි?\n\nවහන්ස, ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ විසින් මෙහෙයවන ලද්දාහ. භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. වහන්ස, යහපත් වන්නේ ම ය, භාග්‍යවතුන් වහන්සේ ම මේ වචනයේ අර්ථය ප්‍රකාශ කරන සේක්වා! භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණ​ය කොට භික්ෂූහු එය දරන්නාහයි.\n\nමහණෙනි, එසේ නම් අසන්න, මනාව සිතට ගන්න; මම කථා කරන්නෙමි යි. එසේ ය, වහන්සැ’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්නාහ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: මහණෙනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ඔබට මෙසේ ප්‍රශ්න කරන්නේ නම්— ‘ඇවැත්නි, මේ ධර්ම තුනකි. ඒ කවර තුනක් ද? රාගය, ද්වේෂය, මෝහය යන මේවා යි. ඇවැත්නි, මේ ධර්ම තුනෙහි ඇති විශේෂය කවරේද? අදහස කවරේද? වෙනස්කම කවරේදැ’යි? මහණෙනි, මෙසේ අසන ලද ඔබ, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතු ය: ‘ඇවැත්නි, රාගය ස්වල්ප වූ වරද ඇත්තෙක් වේ, එය මැළිවී දුරු කරන්නට හැකි ය; ද්වේෂය මහත් වූ වරද ඇත්තෙක් වේ, එය ඉක්මනින් දුරු කරන්නට හැකි ය; මෝහය මහත් වූ වරද ඇත්තෙක් වේ, එය මැළිවී දුරු කරන්නට හැකි ය’යි.\n\n‘ඇවැත්නි, නො උපන් රාගය උපදින්නට හෝ උපන් රාගය තවදුරටත් වැඩි දියුණුවට, මහත් බවට පත් වීමට හේතුව කවරේද, ප්‍රත්‍යය කවරේදැ’යි විමසන්නේ නම්, ඔහුට ‘ශුභ නිමිත්ත ය’යි කිව යුතු ය. හෙතෙම ඒ ශුභ නිමිත්ත නුවණින් යුතුව මෙනෙහි නොකරන කල්හි, නො උපන් රාගය උපදී, උපන් රාගය වැඩි දියුණුවට, මහත් බවට පත් වේ. ඇවැත්නි, නො උපන් රාගය උපදින්නට හෝ උපන් රාගය වැඩි දියුණුවට, මහත් බවට පත් වීමට මේ හේතුව ය, මේ ප්‍රත්‍යය යි.\n\n‘ඇවැත්නි, නො උපන් ද්වේෂය උපදින්නට හෝ උපන් ද්වේෂය වැඩි දියුණුවට, මහත් බවට පත් වීමට හේතුව කවරේද, ප්‍රත්‍යය කවරේදැ’යි විමසන්නේ නම්, ඔහුට ‘ගැටීම් නිමිත්ත ය’යි කිව යුතු ය. හෙතෙම ඒ ගැටීම් නිමිත්ත නුවණින් යුතුව මෙනෙහි නොකරන කල්හි, නො උපන් ද්වේෂය උපදී, උපන් ද්වේෂය වැඩි දියුණුවට, මහත් බවට පත් වේ. ඇවැත්නි, නො උපන් ද්වේෂය උපදින්නට හෝ උපන් ද්වේෂය වැඩි දියුණුවට, මහත් බවට පත් වීමට මේ හේතුව ය, මේ ප්‍රත්‍යය යි.\n\n‘ඇවැත්නි, නො උපන් මෝහය උපදින්නට හෝ උපන් මෝහය වැඩි දියුණුවට, මහත් බවට පත් වීමට හේතුව කවරේද, ප්‍රත්‍යය කවරේදැ’යි විමසන්නේ නම්, ඔහුට ‘අයෝනිසෝමනසිකාරය ය’යි කිව යුතු ය. හෙතෙම අයෝනිසෝමනසිකාරය නුවණින් යුතුව මෙනෙහි නොකරන කල්හි, නො උපන් මෝහය උපදී, උපන් මෝහය වැඩි දියුණුවට, මහත් බවට පත් වේ. ඇවැත්නි, නො උපන් මෝහය උපදින්නට හෝ උපන් මෝහය වැඩි දියුණුවට, මහත් බවට පත් වීමට මේ හේතුව ය, මේ ප්‍රත්‍යය යි.\n\n‘ඇවැත්නි, නො උපන් රාගය නො උපදින්නට ම සහ උපන් රාගය දුරු වීමට හේතුව කවරේද, ප්‍රත්‍යය කවරේදැ’යි විමසන්නේ නම්, ඔහුට ‘අශුභ නිමිත්ත ය’යි කිව යුතු ය. හෙතෙම ඒ අශුභ නිමිත්ත නුවණින් යුතුව මෙනෙහි කරන කල්හි, නො උපන් රාගය නො උපදී, උපන් රාගය ප්‍රහීණ වේ. ඇවැත්නි, නො උපන් රාගය නො උපදින්නට ම සහ උපන් රාගය දුරු වීමට මේ හේතුව ය, මේ ප්‍රත්‍යය යි.\n\n‘ඇවැත්නි, නො උපන් ද්වේෂය නො උපදින්නට ම සහ උපන් ද්වේෂය දුරු වීමට හේතුව කවරේද, ප්‍රත්‍යය කවරේදැ’යි විමසන්නේ නම්, ඔහුට ‘මෛත්‍රී චේතෝවිමුක්තිය ය’යි කිව යුතු ය. හෙතෙම ඒ මෛත්‍රී චේතෝවිමුක්තිය නුවණින් යුතුව මෙනෙහි කරන කල්හි, නො උපන් ද්වේෂය නො උපදී, උපන් ද්වේෂය ප්‍රහීණ වේ. ඇවැත්නි, නො උපන් ද්වේෂය නො උපදින්නට ම සහ උපන් ද්වේෂය දුරු වීමට මේ හේතුව ය, මේ ප්‍රත්‍යය යි.\n\n‘ඇවැත්නි, නො උපන් මෝහය නො උපදින්නට ම සහ උපන් මෝහය දුරු වීමට හේතුව කවරේද, ප්‍රත්‍යය කවරේදැ’යි විමසන්නේ නම්, ඔහුට ‘යෝනිසෝමනසිකාරය ය’යි කිව යුතු ය. හෙතෙම ඒ යෝනිසෝමනසිකාරය නුවණින් යුතුව මෙනෙහි කරන කල්හි, නො උපන් මෝහය නො උපදී, උපන් මෝහය ප්‍රහීණ වේ. ඇවැත්නි, නො උපන් මෝහය නො උපදින්නට ම සහ උපන් මෝහය දුරු වීමට මේ හේතුව ය, මේ ප්‍රත්‍යය යි.",
      "paliTitle": "Aññatitthiyasuttaṃ"
    },
    {
      "number": 70,
      "pali": "‘‘Tīṇimāni, bhikkhave, akusalamūlāni. Katamāni tīṇi? Lobho akusalamūlaṃ, doso akusalamūlaṃ, moho akusalamūlaṃ. ‘‘Yadapi, bhikkhave, lobho tadapi akusalamūlaṃ [akusalaṃ (sī. syā. kaṃ. pī.)]; yadapi luddho abhisaṅkharoti kāyena vācāya manasā tadapi akusalaṃ [akusalamūlaṃ (ka.)]; yadapi luddho lobhena abhibhūto pariyādinnacitto parassa asatā dukkhaṃ uppādayati [upadahati (sī. syā. kaṃ. pī.)] vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi akusalaṃ [idaṃ pana sabbatthapi evameva dissati]. Itissame lobhajā lobhanidānā lobhasamudayā lobhapaccayā aneke pāpakā akusalā dhammā sambhavanti. ‘‘Yadapi, bhikkhave, doso tadapi akusalamūlaṃ; yadapi duṭṭho abhisaṅkharoti kāyena vācāya manasā tadapi akusalaṃ; yadapi duṭṭho dosena abhibhūto pariyādinnacitto parassa asatā dukkhaṃ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi akusalaṃ. Itissame dosajā dosanidānā dosasamudayā dosapaccayā aneke pāpakā akusalā dhammā sambhavanti. ‘‘Yadapi, bhikkhave, moho tadapi akusalamūlaṃ; yadapi mūḷho abhisaṅkharoti kāyena vācāya manasā tadapi akusalaṃ; yadapi mūḷho mohena abhibhūto pariyādinnacitto parassa asatā dukkhaṃ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi akusalaṃ. Itissame mohajā mohanidānā mohasamudayā mohapaccayā aneke pāpakā akusalā dhammā sambhavanti. Evarūpo cāyaṃ, bhikkhave, puggalo vuccati akālavādītipi, abhūtavādītipi, anatthavādītipi, adhammavādītipi, avinayavādītipi. ‘‘Kasmā cāyaṃ, bhikkhave, evarūpo puggalo vuccati akālavādītipi, abhūtavādītipi, anatthavādītipi, adhammavādītipi, avinayavādītipi? Tathāhāyaṃ, bhikkhave, puggalo parassa asatā dukkhaṃ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi. Bhūtena kho pana vuccamāno avajānāti, no paṭijānāti; abhūtena vuccamāno na ātappaṃ karoti, tassa nibbeṭhanāya itipetaṃ atacchaṃ itipetaṃ abhūtanti. Tasmā evarūpo puggalo vuccati akālavādītipi, abhūtavādītipi, anatthavādītipi, adhammavādītipi, avinayavādītipi. ‘‘Evarūpo, bhikkhave, puggalo lobhajehi pāpakehi akusalehi dhammehi abhibhūto pariyādinnacitto diṭṭhe ceva dhamme dukkhaṃ viharati, savighātaṃ saupāyāsaṃ sapariḷāhaṃ. Kāyassa ca bhedā paraṃ maraṇā duggati pāṭikaṅkhā. ‘‘Dosajehi…pe… mohajehi pāpakehi akusalehi dhammehi abhibhūto pariyādinnacitto diṭṭhe ceva dhamme dukkhaṃ viharati, savighātaṃ saupāyāsaṃ sapariḷāhaṃ. Kāyassa ca bhedā paraṃ maraṇā duggati pāṭikaṅkhā. Seyyathāpi, bhikkhave, sālo vā dhavo vā phandano vā tīhi māluvālatāhi uddhasto pariyonaddho anayaṃ āpajjati, byasanaṃ āpajjati, anayabyasanaṃ āpajjati; evamevaṃ kho, bhikkhave, evarūpo puggalo lobhajehi pāpakehi akusalehi dhammehi abhibhūto pariyādinnacitto diṭṭhe ceva dhamme dukkhaṃ viharati, savighātaṃ saupāyāsaṃ sapariḷāhaṃ. Kāyassa ca bhedā paraṃ maraṇā duggati pāṭikaṅkhā. ‘‘Dosajehi…pe… mohajehi pāpakehi akusalehi dhammehi abhibhūto pariyādinnacitto diṭṭhe ceva dhamme dukkhaṃ viharati savighātaṃ saupāyāsaṃ sapariḷāhaṃ. Kāyassa ca bhedā paraṃ maraṇā duggati pāṭikaṅkhā. Imāni kho, bhikkhave, tīṇi akusalamūlānīti. ‘‘Tīṇimāni, bhikkhave, kusalamūlāni. Katamāni tīṇi? Alobho kusalamūlaṃ, adoso kusalamūlaṃ, amoho kusalamūlaṃ. ‘‘Yadapi, bhikkhave, alobho tadapi kusalamūlaṃ [kusalaṃ (sī. syā. kaṃ. pī.)]; yadapi aluddho abhisaṅkharoti kāyena vācāya manasā tadapi kusalaṃ [kusalamūlaṃ (ka.)]; yadapi aluddho lobhena anabhibhūto apariyādinnacitto na parassa asatā dukkhaṃ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi kusalaṃ. Itissame alobhajā alobhanidānā alobhasamudayā alobhapaccayā aneke kusalā dhammā sambhavanti. ‘‘Yadapi, bhikkhave, adoso tadapi kusalamūlaṃ; yadapi aduṭṭho abhisaṅkharoti kāyena vācāya manasā tadapi kusalaṃ; yadapi aduṭṭho dosena anabhibhūto apariyādinnacitto na parassa asatā dukkhaṃ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi kusalaṃ. Itissame adosajā adosanidānā adosasamudayā adosapaccayā aneke kusalā dhammā sambhavanti. ‘‘Yadapi, bhikkhave, amoho tadapi kusalamūlaṃ; yadapi amūḷho abhisaṅkharoti kāyena vācāya manasā tadapi kusalaṃ; yadapi amūḷho mohena anabhibhūto apariyādinnacitto na parassa asatā dukkhaṃ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi tadapi kusalaṃ. Itissame amohajā amohanidānā amohasamudayā amohapaccayā aneke kusalā dhammā sambhavanti. Evarūpo cāyaṃ, bhikkhave, puggalo vuccati kālavādītipi, bhūtavādītipi, atthavādītipi, dhammavādītipi, vinayavādītipi. ‘‘Kasmā cāyaṃ, bhikkhave, evarūpo puggalo vuccati kālavādītipi, bhūtavādītipi, atthavādītipi, dhammavādītipi, vinayavādītipi? Tathāhāyaṃ, bhikkhave, puggalo na parassa asatā dukkhaṃ uppādayati vadhena vā bandhanena vā jāniyā vā garahāya vā pabbājanāya vā balavamhi balattho itipi. Bhūtena kho pana vuccamāno paṭijānāti no avajānāti; abhūtena vuccamāno ātappaṃ karoti tassa nibbeṭhanāya – ‘itipetaṃ atacchaṃ, itipetaṃ abhūta’nti. Tasmā evarūpo puggalo vuccati kālavādītipi, atthavādītipi, dhammavādītipi, vinayavādītipi. ‘‘Evarūpassa, bhikkhave, puggalassa lobhajā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ. Diṭṭheva dhamme parinibbāyati. ‘‘Dosajā…pe… parinibbāyati. Mohajā…pe… parinibbāyati. Seyyathāpi bhikkhave, sālo vā dhavo vā phandano vā tīhi māluvālatāhi uddhasto pariyonaddho. Atha puriso āgaccheyya kuddāla-piṭakaṃ [kuddālapiṭakaṃ (sī. syā. kaṃ. pī.)] ādāya. So taṃ māluvālataṃ mūle chindeyya, mūle chetvā palikhaṇeyya, palikhaṇitvā mūlāni uddhareyya, antamaso usīranāḷimattānipi [usīranāḷamattānipi (sī. syā. kaṃ. pī.)]. So taṃ māluvālataṃ khaṇḍākhaṇḍikaṃ chindeyya, khaṇḍākhaṇḍikaṃ chetvā phāleyya, phāletvā sakalikaṃ sakalikaṃ kareyya, sakalikaṃ sakalikaṃ karitvā vātātape visoseyya, vātātape visosetvā agginā ḍaheyya, agginā ḍahitvā masiṃ kareyya, masiṃ karitvā mahāvāte vā ophuṇeyya nadiyā vā sīghasotāya pavāheyya. Evamassa [evamassu (sī.), evassu (ka.)] tā, bhikkhave, māluvālatā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Evamevaṃ kho, bhikkhave, evarūpassa puggalassa lobhajā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ. Diṭṭheva dhamme parinibbāyati. ‘‘Dosajā …pe… mohajā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ. Diṭṭheva dhamme parinibbāyati. Imāni kho, bhikkhave, tīṇi kusalamūlānī’’ti. Navamaṃ.",
      "english": "Monks, there are these three roots of the unwholesome. Which three? Greed is a root of the unwholesome, hatred is a root of the unwholesome, and delusion is a root of the unwholesome. Monks, that which is greed is indeed a root of the unwholesome; when a person, being greedy, fabricates volition by body, speech, or mind, that too is unwholesome; when a person, being greedy, overcome by greed, his mind completely seized, inflicts suffering upon another who is innocent, whether by striking, or by binding, or by causing loss, or by censure, or by banishment, or thinking, \"I am powerful, I desire power\"—that too is unwholesome. Thus, many evil, unwholesome states arise, originating from greed, having greed as their source, born of greed, conditioned by greed.\n\nMonks, that which is hatred is indeed a root of the unwholesome; when a person, being hateful, fabricates volition by body, speech, or mind, that too is unwholesome; when a person, being hateful, overcome by hatred, his mind completely seized, inflicts suffering upon another who is innocent, whether by striking, or by binding, or by causing loss, or by censure, or by banishment, or thinking, \"I am powerful, I desire power\"—that too is unwholesome. Thus, many evil, unwholesome states arise, originating from hatred, having hatred as their source, born of hatred, conditioned by hatred.\n\nMonks, that which is delusion is indeed a root of the unwholesome; when a person, being deluded, fabricates volition by body, speech, or mind, that too is unwholesome; when a person, being deluded, overcome by delusion, his mind completely seized, inflicts suffering upon another who is innocent, whether by striking, or by binding, or by causing loss, or by censure, or by banishment, or thinking, \"I am powerful, I desire power\"—that too is unwholesome. Thus, many evil, unwholesome states arise, originating from delusion, having delusion as their source, born of delusion, conditioned by delusion.\n\nFurthermore, Monks, a person of this sort is called one who speaks out of time, one who speaks falsely, one who speaks unprofitably, one who speaks contrary to the Dhamma, one who speaks contrary to the Discipline.\n\nWhy, Monks, is a person of this sort called one who speaks out of time, one who speaks falsely, one who speaks unprofitably, one who speaks contrary to the Dhamma, one who speaks contrary to the Discipline? For this person, Monks, inflicts suffering upon another who is innocent, whether by striking, or by binding, or by causing loss, or by censure, or by banishment, or thinking, \"I am powerful, I desire power.\" Furthermore, when spoken to truthfully, he ignores it and does not acknowledge it; when spoken to falsely, he makes no effort to refute it, saying, \"This is incorrect; this is false.\" Therefore, a person of this sort is called one who speaks out of time, one who speaks falsely, one who speaks unprofitably, one who speaks contrary to the Dhamma, one who speaks contrary to the Discipline.\n\nMonks, a person of this sort, overcome by the evil, unwholesome states born of greed, his mind completely seized, dwells miserably in this very life, afflicted with distress, anguish, and fever. And upon the breaking up of the body, after death, a woeful destination is to be expected.\n\nOvercome by the evil, unwholesome states born of hatred... overcome by the evil, unwholesome states born of delusion, his mind completely seized, he dwells miserably in this very life, afflicted with distress, anguish, and fever. And upon the breaking up of the body, after death, a woeful destination is to be expected. Just as, Monks, a Sal tree, or a Dhavas tree, or a Phandana tree, overwhelmed and completely enveloped by three creeping vines, meets with ruin, meets with disaster, meets with ruin and disaster; even so, Monks, a person of this sort, overcome by the evil, unwholesome states born of greed, his mind completely seized, dwells miserably in this very life, afflicted with distress, anguish, and fever. And upon the breaking up of the body, after death, a woeful destination is to be expected.\n\nOvercome by the evil, unwholesome states born of hatred... overcome by the evil, unwholesome states born of delusion, his mind completely seized, he dwells miserably in this very life, afflicted with distress, anguish, and fever. And upon the breaking up of the body, after death, a woeful destination is to be expected. These, Monks, are the three roots of the unwholesome.\n\nMonks, there are these three roots of the wholesome. Which three? Non-greed is a root of the wholesome, non-hatred is a root of the wholesome, and non-delusion is a root of the wholesome. Monks, that which is non-greed is indeed a root of the wholesome; when a person, being non-greedy, fabricates volition by body, speech, or mind, that too is wholesome; when a person, being non-greedy, not overcome by greed, his mind not completely seized, does not inflict suffering upon another who is innocent, whether by striking, or by binding, or by causing loss, or by censure, or by banishment, or thinking, \"I am powerful, I desire power\"—that too is wholesome. Thus, many wholesome states arise, originating from non-greed, having non-greed as their source, born of non-greed, conditioned by non-greed.\n\nMonks, that which is non-hatred is indeed a root of the wholesome; when a person, being non-hateful, fabricates volition by body, speech, or mind, that too is wholesome; when a person, being non-hateful, not overcome by hatred, his mind not completely seized, does not inflict suffering upon another who is innocent, whether by striking, or by binding, or by causing loss, or by censure, or by banishment, or thinking, \"I am powerful, I desire power\"—that too is wholesome.\n\nThus, many wholesome mental qualities arise originating from non-hatred, rooted in non-hatred, having non-hatred as their source, and conditioned by non-hatred.\n\n“Monks, whatever is non-delusion, that is also a root of the wholesome. Whatever a person, being undeluded, produces karmic formations through body, speech, or mind, that is wholesome. Whatever a person, being undeluded, not overcome by delusion, with a mind unseized, does not inflict suffering upon another without cause—whether by striking, or by imprisonment, or by injury, or by blame, or by banishment, thinking, ‘I am powerful, I seek power’—that is also wholesome.”\n\nThus, many wholesome mental qualities arise originating from non-delusion, rooted in non-delusion, having non-delusion as their source, and conditioned by non-delusion.\n\nMonks, such a person is called one who speaks in due season, one who speaks what is true, one who speaks of benefit, one who speaks of the Dhamma, and one who speaks of the Discipline.\n\n“Why, Monks, is such a person called one who speaks in due season, one who speaks what is true, one who speaks of benefit, one who speaks of the Dhamma, and one who speaks of the Discipline? It is because this person does not inflict suffering upon another without cause—whether by striking, or by imprisonment, or by injury, or by blame, or by banishment, thinking, ‘I am powerful, I seek power.’ When he is spoken to concerning what is true, he affirms it and does not reject it; when he is spoken to concerning what is false, he makes the effort to refute it, saying, ‘This is not correct, this is untrue.’ Therefore, such a person is called one who speaks in due season, one who speaks of benefit, one who speaks of the Dhamma, and one who speaks of the Discipline.\n\n“Monks, for such a person, the wicked, unwholesome qualities born of greed are abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and are incapable of arising in the future. In this very life, he dwells happily, without vexation, without distress, and without fever. In this very life, he attains final Nibbāna.\n\n“The wicked, unwholesome qualities born of hatred are abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and are incapable of arising in the future. In this very life, he dwells happily, without vexation, without distress, and without fever. In this very life, he attains final Nibbāna. The wicked, unwholesome qualities born of delusion are abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and are incapable of arising in the future. In this very life, he dwells happily, without vexation, without distress, and without fever. In this very life, he attains final Nibbāna.\n\n“Just as, Monks, a Sal tree, a Dhavana tree, or a Phandana tree might be encircled and bound by three creepers. Then a man might come, carrying a spade and a basket. He would cut that creeper at its root; having cut the root, he would dig around it; having dug around it, he would pull out the roots, even the tiniest ones, down to the size of a vetiver fiber. He would cut that creeper into pieces; having cut it into pieces, he would split it; having split it, he would make it into chips; having made it into chips, he would dry it in the wind and sun; having dried it in the wind and sun, he would burn it with fire; having burned it with fire, he would reduce it to ash; having reduced it to ash, he would either scatter it to a great wind or cast it into a swiftly flowing river. Thus, Monks, those creepers would be cut off at the root, made like a palm-stump, brought to non-existence, and incapable of future arising.\n\n“In the same way, Monks, for such a person, the wicked, unwholesome qualities born of greed are abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and are incapable of arising in the future. In this very life, he dwells happily, without vexation, without distress, and without fever. In this very life, he attains final Nibbāna.\n\n“The wicked, unwholesome qualities born of hatred, and the wicked, unwholesome qualities born of delusion are abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and are incapable of arising in the future. In this very life, he dwells happily, without vexation, without distress, and without fever. In this very life, he attains final Nibbāna.\n\n“These, Monks, are the three roots of the wholesome.”",
      "sinhala": "මහණෙනි, මේ අකුශලමූල තුනකි. ඒ කවර තුනක්ද? ලෝභය අකුශලමූලයකි, ද්වේශය අකුශලමූලයකි, මෝහය අකුශලමූලයකි.\n\nමහණෙනි, යමක් ලෝභ වේද, එයද අකුශලමූලයකි; යම් විටෙක ලෝභයෙන් යුක්ත වූ තැනැත්තා කයින්, වචනයෙන් හෝ මනසින් සංස්කාරයන් උපදවයි ද, එයද අකුසලයකි; යම් විටෙක ලෝභයෙන් යටපත් වූ, මනස දූෂ්‍ය වූ ලෝභී පුද්ගලයා ‘මම බලවත් වෙමි, මට බලය ඇතැයි’ සිතා අනුන්ට අසාධාරණ ලෙස මැරීමෙන් හෝ, බැඳීමෙන් හෝ, දේපළ හානි කිරීමෙන් හෝ, දෝෂාරෝපණයෙන් හෝ, රටින් නෙරපා හැරීමෙන් හෝ දුක් උපදවයි ද, එයද අකුසලයකි. මෙසේ මේ ලෝභයෙන් උපන්, ලෝභය මුල් කොට ඇති, ලෝභය හේතු කොට ඇති, ලෝභය නිසා ඇති වූ බොහෝ පව් සහිත අකුශල ධර්මයන් හට ගනී.\n\nමහණෙනි, යමක් ද්වේශය වේද, එයද අකුශලමූලයකි; යම් විටෙක ද්වේශයෙන් යුක්ත වූ තැනැත්තා කයින්, වචනයෙන් හෝ මනසින් සංස්කාරයන් උපදවයි ද, එයද අකුසලයකි; යම් විටෙක ද්වේශයෙන් යටපත් වූ, මනස දූෂ්‍ය වූ ද්වේශී පුද්ගලයා ‘මම බලවත් වෙමි, මට බලය ඇතැයි’ සිතා අනුන්ට අසාධාරණ ලෙස මැරීමෙන් හෝ, බැඳීමෙන් හෝ, දේපළ හානි කිරීමෙන් හෝ, දෝෂාරෝපණයෙන් හෝ, රටින් නෙරපා හැරීමෙන් හෝ දුක් උපදවයි ද, එයද අකුසලයකි. මෙසේ මේ ද්වේශයෙන් උපන්, ද්වේශය මුල් කොට ඇති, ද්වේශය හේතු කොට ඇති, ද්වේශය නිසා ඇති වූ බොහෝ පව් සහිත අකුශල ධර්මයන් හට ගනී.\n\nමහණෙනි, යමක් මෝහය වේද, එයද අකුශලමූලයකි; යම් විටෙක මෝහයෙන් යුක්ත වූ තැනැත්තා කයින්, වචනයෙන් හෝ මනසින් සංස්කාරයන් උපදවයි ද, එයද අකුසලයකි; යම් විටෙක මෝහයෙන් යටපත් වූ, මනස දූෂ්‍ය වූ මෝහී පුද්ගලයා ‘මම බලවත් වෙමි, මට බලය ඇතැයි’ සිතා අනුන්ට අසාධාරණ ලෙස මැරීමෙන් හෝ, බැඳීමෙන් හෝ, දේපළ හානි කිරීමෙන් හෝ, දෝෂාරෝපණයෙන් හෝ, රටින් නෙරපා හැරීමෙන් හෝ දුක් උපදවයි ද, එයද අකුසලයකි. මෙසේ මේ මෝහයෙන් උපන්, මෝහය මුල් කොට ඇති, මෝහය හේතු කොට ඇති, මෝහය නිසා ඇති වූ බොහෝ පව් සහිත අකුශල ධර්මයන් හට ගනී.\n\nමහණෙනි, මෙවැනි පුද්ගලයා ‘අකාලවාදී’ ය, ‘අභූතවාදී’ ය, ‘අනර්ථවාදී’ ය, ‘අධර්මවාදී’ ය, ‘අවිනයවාදී’ ය, යනුවෙන් කියනු ලැබේ.\n\nමහණෙනි, කවර හෙයින් මේ පුද්ගලයා ‘අකාලවාදී’ ය, ‘අභූතවාදී’ ය, ‘අනර්ථවාදී’ ය, ‘අධර්මවාදී’ ය, ‘අවිනයවාදී’ ය, යනුවෙන් කියනු ලැබේ ද? මහණෙනි, ඒ මක්නිසාද යත්: මේ පුද්ගලයා ‘මම බලවත් වෙමි, මට බලය ඇතැයි’ සිතා අනුන්ට අසාධාරණ ලෙස මැරීමෙන් හෝ, බැඳීමෙන් හෝ, දේපළ හානි කිරීමෙන් හෝ, දෝෂාරෝපණයෙන් හෝ, රටින් නෙරපා හැරීමෙන් හෝ දුක් උපදවන බැවිනි. සත්‍යයෙන් (ඇත්ත ඇති සැටියෙන්) කියන විට, ඔහු එය හෙළා දකී, පිළිගන්නේ නැත; අසත්‍යයෙන් කියන විට, ‘මේ අසත්‍යයයි, මේ බොරුවක් ය’ යනුවෙන් එය දුරු කිරීමට හෝ නිවැරදි කිරීමට උත්සාහ නොකරයි. එබැවින් මෙවැනි පුද්ගලයා ‘අකාලවාදී’ ය, ‘අභූතවාදී’ ය, ‘අනර්ථවාදී’ ය, ‘අධර්මවාදී’ ය, ‘අවිනයවාදී’ ය, යනුවෙන් කියනු ලැබේ.\n\nමහණෙනි, ලෝභයෙන් හටගත් පව් සහිත අකුශල ධර්මයන්ගෙන් යටපත් වූ, මනස දූෂ්‍ය වූ මෙවැනි පුද්ගලයා මේ දක්නට ලැබෙන වර්තමාන ජීවිතයේදී පවා දුකින්, විඝාත සහිතව, උපායාස සහිතව, දැවීම් සහිතව වාසය කරයි. ශරීරය බිඳී මරණයෙන් පසු දුගතියට පැමිණීම අපේක්ෂා කළ යුත්තේය. ද්වේශයෙන් හටගත් පව් සහිත අකුශල ධර්මයන්ගෙන් යටපත් වූ, මනස දූෂ්‍ය වූ පුද්ගලයා මේ දක්නට ලැබෙන වර්තමාන ජීවිතයේදී පවා දුකින්, විඝාත සහිතව, උපායාස සහිතව, දැවීම් සහිතව වාසය කරයි. ශරීරය බිඳී මරණයෙන් පසු දුගතියට පැමිණීම අපේක්ෂා කළ යුත්තේය. මෝහයෙන් හටගත් පව් සහිත අකුශල ධර්මයන්ගෙන් යටපත් වූ, මනස දූෂ්‍ය වූ පුද්ගලයා මේ දක්නට ලැබෙන වර්තමාන ජීවිතයේදී පවා දුකින්, විඝාත සහිතව, උපායාස සහිතව, දැවීම් සහිතව වාසය කරයි. ශරීරය බිඳී මරණයෙන් පසු දුගතියට පැමිණීම අපේක්ෂා කළ යුත්තේය.\n\nමහණෙනි, යම් සේ සල් ගසක් හෝ, දවුල් ගසක් හෝ, අට්ටික්කා ගසක් හෝ මාළුවා වැල් තුනකින් මුළුල්ලේ වෙළී, තදින් බඳින ලද්දේ විනාශයට පැමිණේ ද, දුකට පැමිණේ ද, විනාශය සහ දුක යන දෙකටම පැමිණේ ද; එපරිද්දෙන්ම මහණෙනි, මෙවැනි පුද්ගලයා ලෝභයෙන් හටගත් පව් සහිත අකුශල ධර්මයන්ගෙන් යටපත් වූ, මනස දූෂ්‍ය වූ හෙයින් මේ දක්නට ලැබෙන වර්තමාන ජීවිතයේදී පවා දුකින්, විඝාත සහිතව, උපායාස සහිතව, දැවීම් සහිතව වාසය කරයි. ශරීරය බිඳී මරණයෙන් පසු දුගතියට පැමිණීම අපේක්ෂා කළ යුත්තේය. ද්වේශයෙන් හටගත් පව් සහිත අකුශල ධර්මයන්ගෙන් යටපත් වූ, මනස දූෂ්‍ය වූ හෙයින් මේ දක්නට ලැබෙන වර්තමාන ජීවිතයේදී පවා දුකින්, විඝාත සහිතව, උපායාස සහිතව, දැවීම් සහිතව වාසය කරයි. ශරීරය බිඳී මරණයෙන් පසු දුගතියට පැමිණීම අපේක්ෂා කළ යුත්තේය. මෝහයෙන් හටගත් පව් සහිත අකුශල ධර්මයන්ගෙන් යටපත් වූ, මනස දූෂ්‍ය වූ හෙයින් මේ දක්නට ලැබෙන වර්තමාන ජීවිතයේදී පවා දුකින්, විඝාත සහිතව, උපායාස සහිතව, දැවීම් සහිතව වාසය කරයි. ශරීරය බිඳී මරණයෙන් පසු දුගතියට පැමිණීම අපේක්ෂා කළ යුත්තේය.\n\nමහණෙනි, මේ අකුශලමූල තුන වන්නේය.\n\nමහණෙනි, මේ කුශලමූල තුනකි. ඒ කවර තුනක්ද? අලෝභය කුශලමූලයකි, අද්වේශය කුශලමූලයකි, අමෝහය කුශලමූලයකි.\n\nමහණෙනි, යමක් අලෝභය වේද, එයද කුශලමූලයකි; යම් විටෙක අලෝභී වූ තැනැත්තා කයින්, වචනයෙන් හෝ මනසින් සංස්කාරයන් උපදවයි ද, එයද කුසලයකි; යම් විටෙක අලෝභයෙන් යටපත් නොවුණු, මනස දූෂ්‍ය නොවුණු අලෝභී පුද්ගලයා ‘මම බලවත් වෙමි, මට බලය ඇතැයි’ සිතා අනුන්ට අසාධාරණ ලෙස මැරීමෙන් හෝ, බැඳීමෙන් හෝ, දේපළ හානි කිරීමෙන් හෝ, දෝෂාරෝපණයෙන් හෝ, රටින් නෙරපා හැරීමෙන් හෝ දුක් උපදවන්නේ නැද්ද, එයද කුසලයකි. මෙසේ මේ අලෝභයෙන් උපන්, අලෝභය මුල් කොට ඇති, අලෝභය හේතු කොට ඇති, අලෝභය නිසා ඇති වූ බොහෝ කුශල ධර්මයන් හට ගනී.\n\nමහණෙනි, යමක් අද්වේශය වේද, එයද කුශලමූලයකි; යම් විටෙක අද්වේශයෙන් යුක්ත වූ තැනැත්තා කයින්, වචනයෙන් හෝ මනසින් සංස්කාරයන් උපදවයි ද, එයද කුසලයකි; යම් විටෙක අද්වේශයෙන් යටපත් නොවුණු, මනස දූෂ්‍ය නොවුණු අද්වේශී පුද්ගලයා ‘මම බලවත් වෙමි, මට බලය ඇතැයි’ සිතා අනුන්ට අසාධාරණ ලෙස මැරීමෙන් හෝ, බැඳීමෙන් හෝ, දේපළ හානි කිරීමෙන් හෝ, දෝෂාරෝපණයෙන් හෝ, රටින් නෙරපා හැරීමෙන් හෝ දුක් උපදවන්නේ නැද්ද, එයද කුසලයකි.\n\nමේ ආකාරයෙන්, ද්වේෂය නැතිකමෙන් උපන්නා වූ ද, ද්වේෂය නැතිකම නිදාන කොට ඇත්තා වූ ද, ද්වේෂය නැතිකමෙන් සමුදය වූවා වූ ද, ද්වේෂය නැතිකම ප්‍රත්‍යය වූවා වූ ද, බොහෝ කුසල ධර්මයෝ හටගනිති. මහණෙනි, යම්කිසි දෙයක් මෝහය නැතිකම වේද, එය ද කුසල මූලයකි. යම්කිසිවක් මුළා නොවූ කල්හි කයින්, වචනයෙන්, මනසින් සංස්කාරයන් අභිසංඛාරය කෙරේද, එය ද කුසලයකි. යම්කිසිවක් මුළා නොවූ කල්හි, මෝහයෙන් නොදැමුණා වූ ද, සිත පිරිහෙලනු නොලද්දා වූ ද, ‘මම බලවත් වෙමි, බලය පතන්නෙමි’ යි යන චේතනාවෙන්, මනුෂ්‍යයාට අයුක්තියෙන් හෝ හිංසාවෙන් හෝ බැඳීමෙන් හෝ හානියකින් හෝ ගැරහීමකින් හෝ පිටුවහල් කිරීමකින් හෝ දුක් ඇති නොකෙරේ ද, එය ද කුසලයකි. මේ ආකාරයෙන්, මෝහය නැතිකමෙන් උපන්නා වූ ද, මෝහය නැතිකම නිදාන කොට ඇත්තා වූ ද, මෝහය නැතිකමෙන් සමුදය වූවා වූ ද, මෝහය නැතිකම ප්‍රත්‍යය වූවා වූ ද, බොහෝ කුසල ධර්මයෝ හටගනිති.\n\nමහණෙනි, මෙබඳු වූ පුද්ගලයා කාලවාදී යැයි ද, භූතවාදී යැයි ද, අර්ථවාදී යැයි ද, ධර්මවාදී යැයි ද, විනයවාදී යැයි ද කියනු ලැබේ.\n\nමහණෙනි, කුමක් හෙයින් මෙබඳු පුද්ගලයා කාලවාදී යැයි ද, භූතවාදී යැයි ද, අර්ථවාදී යැයි ද, ධර්මවාදී යැයි ද, විනයවාදී යැයි ද කියනු ලැබේ ද? මහණෙනි, යම් හෙයකින් මේ පුද්ගලයා ‘මම බලවත් වෙමි, බලය පතන්නෙමි’ යි යන චේතනාවෙන්, මනුෂ්‍යයාට අයුක්තියෙන් හෝ හිංසාවෙන් හෝ බැඳීමෙන් හෝ හානියකින් හෝ ගැරහීමකින් හෝ පිටුවහල් කිරීමකින් හෝ දුක් ඇති නොකෙරේ ද, එසේ හෙයින් ය. තවද යම්කිසි දෙයක් ඇත්ත ඇති සැටියෙන් කියනු ලබන්නේ නම්, එය පිළිගන්නේ මිස ප්‍රතික්ෂේප කරන්නේ නොවේ. යම්කිසි දෙයක් අසත්‍ය වශයෙන් කියනු ලබන්නේ නම්, ‘මේක අසත්‍යයි, මේක සත්‍ය නොවේ’ යැයි එහි බන්ධනය ලිහිල් කිරීමට උත්සාහ කරයි. එබැවින් මෙබඳු පුද්ගලයා කාලවාදී යැයි ද, අර්ථවාදී යැයි ද, ධර්මවාදී යැයි ද, විනයවාදී යැයි ද කියනු ලැබේ.\n\nමහණෙනි, මෙබඳු පුද්ගලයාගේ ලෝභය නිසා හටගත් පාපී අකුසල ධර්මයෝ ප්‍රහීණ කරනු ලැබූහ, මුලින් උදුරා දමනු ලැබූහ, තල්ගසක කඳක් මෙන් අභාවයට පත් කරනු ලැබූහ, ඉදිරියේදී නැවත නොඇති වීමේ ස්වභාවයෙන් යුක්ත වෙති. ඔහු මේ දිට්ඨධර්මයේදීම කිසිදු හිංසාවකින් තොරව, වෙහෙසකින් තොරව, ක්ලේශ දැවිල්ලකින් තොරව සුවසේ වාසය කරයි. මේ දිට්ඨධර්මයේදීම පිරිනිවන් පායි.\n\nද්වේෂය නිසා හටගත් පාපී අකුසල ධර්මයෝ ප්‍රහීණ කරනු ලැබූහ, මුලින් උදුරා දමනු ලැබූහ, තල්ගසක කඳක් මෙන් අභාවයට පත් කරනු ලැබූහ, ඉදිරියේදී නැවත නොඇති වීමේ ස්වභාවයෙන් යුක්ත වෙති. ඔහු මේ දිට්ඨධර්මයේදීම කිසිදු හිංසාවකින් තොරව, වෙහෙසකින් තොරව, ක්ලේශ දැවිල්ලකින් තොරව සුවසේ වාසය කරයි. මේ දිට්ඨධර්මයේදීම පිරිනිවන් පායි. මෝහය නිසා හටගත් පාපී අකුසල ධර්මයෝ ප්‍රහීණ කරනු ලැබූහ, මුලින් උදුරා දමනු ලැබූහ, තල්ගසක කඳක් මෙන් අභාවයට පත් කරනු ලැබූහ, ඉදිරියේදී නැවත නොඇති වීමේ ස්වභාවයෙන් යුක්ත වෙති. ඔහු මේ දිට්ඨධර්මයේදීම කිසිදු හිංසාවකින් තොරව, වෙහෙසකින් තොරව, ක්ලේශ දැවිල්ලකින් තොරව සුවසේ වාසය කරයි. මේ දිට්ඨධර්මයේදීම පිරිනිවන් පායි.\n\nමහණෙනි, යම් සේ සල් ගසක් හෝ දව් ගසක් හෝ පැඳිණි ගසක් හෝ වේ ද, එය මාලුවා ලතා තුනකින් වෙළී, වැසී පැවතීමක් වේ ද; එකල්හි යම් පුරුෂයෙක් උදැල්ලක් හා කූඩයක් රැගෙන එන්නේ ය. හෙතෙම ඒ මාලුවා ලතා මුලින්ම කපා දමන්නේ ය. මුලින් කපා අවසානයේ වටා අගල් හාරන්නේ ය. අගල් හැර අවසානයේ මුල් උදුරා දමන්නේ ය. යන්තමින්වත් උස්සිරනාලියක් තරම් කුඩා වූ මුල් ද උදුරා දමන්නේ ය. හෙතෙම ඒ මාලුවා ලතා කැබලි කැබලි කොට කපන්නේ ය. කැබලි කැබලි කොට කපා දමා පලන්නේ ය. පලා අවසානයේ ලී පතුරු, පතුරු බවට පත් කරන්නේ ය. ලී පතුරු පතුරු බවට පත් කොට අවසානයේ හුළඟේ හා අව්වේ වියළන්නේ ය. හුළඟේ හා අව්වේ වියළා අවසානයේ ගින්නෙන් දවන්නේ ය. ගින්නෙන් දවා අවසානයේ අළු බවට පත් කරන්නේ ය. අළු බවට පත් කොට අවසානයේ මහා සුළඟක හෝ මුසු කොට පාවා හරින්නේ ය, නැතහොත් වේගවත් දියවැල් සහිත ගංගාවකට පා කර හරින්නේ ය. මහණෙනි, මෙසේ ඒ මාලුවා ලතා මුලින් උදුරා දමනු ලැබූහ, තල්ගසක කඳක් මෙන් අභාවයට පත් කරනු ලැබූහ, ඉදිරියේදී නැවත නොඇති වීමේ ස්වභාවයෙන් යුක්ත වෙති.\n\nමහණෙනි, එපරිද්දෙන්ම මෙබඳු පුද්ගලයාගේ ලෝභය නිසා හටගත් පාපී අකුසල ධර්මයෝ ද ප්‍රහීණ කරනු ලැබූහ, මුලින් උදුරා දමනු ලැබූහ, තල්ගසක කඳක් මෙන් අභාවයට පත් කරනු ලැබූහ, ඉදිරියේදී නැවත නොඇති වීමේ ස්වභාවයෙන් යුක්ත වෙති. ඔහු මේ දිට්ඨධර්මයේදීම කිසිදු හිංසාවකින් තොරව, වෙහෙසකින් තොරව, ක්ලේශ දැවිල්ලකින් තොරව සුවසේ වාසය කරයි. මේ දිට්ඨධර්මයේදීම පිරිනිවන් පායි.\n\nද්වේෂය නිසා හටගත් පාපී අකුසල ධර්මයෝ ද, මෝහය නිසා හටගත් පාපී අකුසල ධර්මයෝ ද ප්‍රහීණ කරනු ලැබූහ, මුලින් උදුරා දමනු ලැබූහ, තල්ගසක කඳක් මෙන් අභාවයට පත් කරනු ලැබූහ, ඉදිරියේදී නැවත නොඇති වීමේ ස්වභාවයෙන් යුක්ත වෙති. ඔහු මේ දිට්ඨධර්මයේදීම කිසිදු හිංසාවකින් තොරව, වෙහෙසකින් තොරව, ක්ලේශ දැවිල්ලකින් තොරව සුවසේ වාසය කරයි. මේ දිට්ඨධර්මයේදීම පිරිනිවන් පායි.\n\nමහණෙනි, මේවා නම් ඒ කුසල මූල තුන යි.",
      "paliTitle": "Akusalamūlasuttaṃ"
    },
    {
      "number": 71,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā tadahuposathe yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca – ‘‘handa kuto nu tvaṃ, visākhe, āgacchasi divā divassā’’ti? ‘‘Uposathāhaṃ, bhante, ajja upavasāmī’’ti. ‘‘Tayo khome, visākhe, uposathā. Katame tayo? Gopālakuposatho, nigaṇṭhuposatho, ariyuposatho. Kathañca, visākhe, gopālakuposatho hoti? Seyyathāpi, visākhe, gopālako sāyanhasamaye sāmikānaṃ gāvo niyyātetvā iti paṭisañcikkhati – ‘ajja kho gāvo amukasmiñca amukasmiñca padese cariṃsu, amukasmiñca amukasmiñca padese pānīyāni piviṃsu; sve dāni gāvo amukasmiñca amukasmiñca padese carissanti, amukasmiñca amukasmiñca padese pānīyāni pivissantī’ti; evamevaṃ kho, visākhe, idhekacco uposathiko iti paṭisañcikkhati – ‘ahaṃ khvajja idañcidañca khādanīyaṃ khādiṃ, idañcidañca bhojanīyaṃ bhuñjiṃ; sve dānāhaṃ idañcidañca khādanīyaṃ khādissāmi, idaṃ cidañca bhojanīyaṃ bhuñjissāmī’ti. So tena abhijjhāsahagatena cetasā divasaṃ atināmeti. Evaṃ kho visākhe, gopālakuposatho hoti. Evaṃ upavuttho kho, visākhe, gopālakuposatho na mahapphalo hoti na mahānisaṃso na mahājutiko na mahāvipphāro. ‘‘Kathañca, visākhe, nigaṇṭhuposatho hoti? Atthi, visākhe, nigaṇṭhā nāma samaṇajātikā. Te sāvakaṃ evaṃ samādapenti – ‘ehi tvaṃ, ambho purisa, ye puratthimāya disāya pāṇā paraṃ yojanasataṃ tesu daṇḍaṃ nikkhipāhi; ye pacchimāya disāya pāṇā paraṃ yojanasataṃ tesu daṇḍaṃ nikkhipāhi; ye uttarāya disāya pāṇā paraṃ yojanasataṃ tesu daṇḍaṃ nikkhipāhi; ye dakkhiṇāya disāya pāṇā paraṃ yojanasataṃ tesu daṇḍaṃ nikkhipāhī’ti. Iti ekaccānaṃ pāṇānaṃ anuddayāya anukampāya samādapenti, ekaccānaṃ pāṇānaṃ nānuddayāya nānukampāya samādapenti. Te tadahuposathe sāvakaṃ evaṃ samādapenti – ‘ehi tvaṃ, ambho purisa, sabbacelāni [sabbaverāni (ka.)] nikkhipitvā evaṃ vadehi – nāhaṃ kvacani kassaci kiñcanatasmiṃ [kiñcanatasmi (?) kiriyāpadametaṃ yathā kiñcanatatthīti], na ca mama kvacani katthaci kiñcanatatthī’ti. Jānanti kho panassa mātāpitaro – ‘ayaṃ amhākaṃ putto’ti; sopi jānāti – ‘ime mayhaṃ mātāpitaro’ti. Jānāti kho panassa puttadāro – ‘ayaṃ mayhaṃ bhattā’ti; sopi jānāti – ‘ayaṃ mayhaṃ puttadāro’ti. Jānanti kho panassa dāsakammakaraporisā – ‘ayaṃ amhākaṃ ayyo’ti; sopi jānāti – ‘ime mayhaṃ dāsakammakaraporisā’ti. Iti yasmiṃ samaye sacce samādapetabbā musāvāde tasmiṃ samaye samādapenti. Idaṃ tassa musāvādasmiṃ vadāmi. So tassā rattiyā accayena bhoge adinnaṃyeva paribhuñjati. Idaṃ tassa adinnādānasmiṃ vadāmi. Evaṃ kho, visākhe, nigaṇṭhuposatho hoti. Evaṃ upavuttho kho, visākhe, nigaṇṭhuposatho na mahapphalo hoti na mahānisaṃso na mahājutiko na mahāvipphāro. ‘‘Kathañca, visākhe, ariyuposatho hoti? Upakkiliṭṭhassa, visākhe, cittassa upakkamena pariyodapanā hoti. Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā [pariyodāpanā (?)] hoti? Idha, visākhe, ariyasāvako tathāgataṃ anussarati – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Tassa tathāgataṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati. Ye cittassa upakkilesā te pahīyanti, seyyathāpi, visākhe, upakkiliṭṭhassa sīsassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa sīsassa upakkamena pariyodapanā hoti? Kakkañca paṭicca mattikañca paṭicca udakañca paṭicca purisassa ca tajjaṃ vāyāmaṃ paṭicca, evaṃ kho, visākhe, upakkiliṭṭhassa sīsassa upakkamena pariyodapanā hoti. Evamevaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako tathāgataṃ anussarati – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Tassa tathāgataṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti. Ayaṃ vuccati, visākhe – ‘ariyasāvako brahmuposathaṃ upavasati, brahmunā saddhiṃ saṃvasati, brahmañcassa [brahmañca (ka.)] ārabbha cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti’. Evaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Upakkiliṭṭhassa, visākhe, cittassa upakkamena pariyodapanā hoti. Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako dhammaṃ anussarati – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Tassa dhammaṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti, seyyathāpi, visākhe, upakkiliṭṭhassa kāyassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa kāyassa upakkamena pariyodapanā hoti? Sottiñca paṭicca, cuṇṇañca paṭicca, udakañca paṭicca, purisassa ca tajjaṃ vāyāmaṃ paṭicca. Evaṃ kho, visākhe, upakkiliṭṭhassa kāyassa upakkamena pariyodapanā hoti. Evamevaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako dhammaṃ anussarati – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Tassa dhammaṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti. Ayaṃ vuccati, visākhe, ‘ariyasāvako dhammuposathaṃ upavasati, dhammena saddhiṃ saṃvasati, dhammañcassa ārabbha cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti’. Evaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Upakkiliṭṭhassa, visākhe, cittassa upakkamena pariyodapanā hoti. Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako saṅghaṃ anussarati – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Tassa saṅghaṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti, seyyathāpi, visākhe, upakkiliṭṭhassa vatthassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa vatthassa upakkamena pariyodapanā hoti? Usmañca [ūsañca (syā. kaṃ. aṭṭhakathāyampi pāṭhantaraṃ, saṃ. ni. 3.89 khemakasuttapāḷiyāpi sameti.) usumañca (sī.)] paṭicca, khārañca paṭicca, gomayañca paṭicca, udakañca paṭicca, purisassa ca tajjaṃ vāyāmaṃ paṭicca. Evaṃ kho, visākhe, upakkiliṭṭhassa vatthassa upakkamena pariyodapanā hoti. Evamevaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako saṅghaṃ anussarati – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Tassa saṅghaṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti. Ayaṃ vuccati, visākhe, ‘ariyasāvako saṅghuposathaṃ upavasati, saṅghena saddhiṃ saṃvasati, saṅghañcassa ārabbha cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti’. Evaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Upakkiliṭṭhassa, visākhe, cittassa upakkamena pariyodapanā hoti. Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako attano sīlāni anussarati akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni. Tassa sīlaṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti, seyyathāpi, visākhe, upakkiliṭṭhassa ādāsassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa ādāsassa upakkamena pariyodapanā hoti? Telañca paṭicca, chārikañca paṭicca, vālaṇḍupakañca paṭicca, purisassa ca tajjaṃ vāyāmaṃ paṭicca. Evaṃ kho, visākhe, upakkiliṭṭhassa ādāsassa upakkamena pariyodapanā hoti. Evamevaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako attano sīlāni anussarati akhaṇḍāni…pe… samādhisaṃvattanikāni. Tassa sīlaṃ anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti. Ayaṃ vuccati, visākhe, ‘ariyasāvako sīluposathaṃ upavasati, sīlena saddhiṃ saṃvasati, sīlañcassa ārabbha cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti’. Evaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Upakkiliṭṭhassa, visākhe, cittassa upakkamena pariyodapanā hoti. Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha visākhe, ariyasāvako devatā anussarati – ‘santi devā cātumahārājikā [cātummahārājikā (sī. syā. kaṃ. pī.)], santi devā tāvatiṃsā, santi devā yāmā, santi devā tusitā, santi devā nimmānaratino, santi devā paranimmitavasavattino, santi devā brahmakāyikā, santi devā tatuttari [tatuttariṃ (sī. pī.)]. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tatthupapannā [tatthuppannā (sī. pī.)], mayhampi tathārūpā saddhā saṃvijjati. Yathārūpena sīlena samannāgatā tā devatā ito cutā tatthupapannā, mayhampi tathārūpaṃ sīlaṃ saṃvijjati. Yathārūpena sutena samannāgatā tā devatā ito cutā tatthupapannā, mayhampi tathārūpaṃ sutaṃ saṃvijjati. Yathārūpena cāgena samannāgatā tā devatā ito cutā tatthupapannā, mayhampi tathārūpo cāgo saṃvijjati. Yathārūpāya paññāya samannāgatā tā devatā ito cutā tatthupapannā, mayhampi tathārūpā paññā saṃvijjatī’ti. Tassa attano ca tāsañca devatānaṃ saddhañca sīlañca sutañca cāgañca paññañca anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti, seyyathāpi, visākhe, upakkiliṭṭhassa jātarūpassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa jātarūpassa upakkamena pariyodapanā hoti? Ukkañca paṭicca, loṇañca paṭicca, gerukañca paṭicca, nāḷikasaṇḍāsañca [nāḷikañca paṭicca saṇḍāsañca (pī. ka.)] paṭicca, purisassa ca tajjaṃ vāyāmaṃ paṭicca. Evaṃ kho, visākhe, upakkiliṭṭhassa jātarūpassa upakkamena pariyodapanā hoti. Evamevaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Kathañca, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti? Idha, visākhe, ariyasāvako devatā anussarati – ‘santi devā cātumahārājikā, santi devā tāvatiṃsā…pe… santi devā tatuttari. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tatthupapannā, mayhampi tathārūpā saddhā saṃvijjati. Yathārūpena sīlena…pe… sutena…pe… cāgena…pe… paññāya samannāgatā tā devatā ito cutā tatthupapannā, mayhampi tathārūpā paññā saṃvijjatī’ti. Tassa attano ca tāsañca devatānaṃ saddhañca sīlañca sutañca cāgañca paññañca anussarato cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti. Ayaṃ vuccati, visākhe, ‘ariyasāvako devatuposathaṃ upavasati, devatāhi saddhiṃ saṃvasati, devatā ārabbha cittaṃ pasīdati, pāmojjaṃ uppajjati, ye cittassa upakkilesā te pahīyanti’. Evaṃ kho, visākhe, upakkiliṭṭhassa cittassa upakkamena pariyodapanā hoti. ‘‘Sa kho so, visākhe, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā sabbapāṇabhūtahitānukampī viharanti; ahampajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharāmi. Imināpi [imināpahaṃ (sī.) a. ni. 8.41] aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissati. ‘‘Yāvajīvaṃ arahanto adinnādānaṃ pahāya adinnādānā paṭiviratā dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharanti; ahampajja imañca rattiṃ imañca divasaṃ adinnādānaṃ pahāya adinnādānā paṭivirato dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharāmi. Imināpi aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissati. ‘‘Yāvajīvaṃ arahanto abrahmacariyaṃ pahāya brahmacārī ārācārī [anācārī (pī.)] viratā methunā gāmadhammā; ahampajja imañca rattiṃ imañca divasaṃ abrahmacariyaṃ pahāya brahmacārī ārācārī virato methunā gāmadhammā. Imināpi aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissati. ‘‘Yāvajīvaṃ arahanto musāvādaṃ pahāya musāvādā paṭiviratā saccavādī saccasandhā thetā paccayikā avisaṃvādakā lokassa; ahampajja imañca rattiṃ imañca divasaṃ musāvādaṃ pahāya musāvādā paṭivirato saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Imināpi aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissati. ‘‘Yāvajīvaṃ arahanto surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭiviratā; ahampajja imañca rattiṃ imañca divasaṃ surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭivirato. Imināpi aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissati. ‘‘Yāvajīvaṃ arahanto ekabhattikā rattūparatā viratā vikālabhojanā; ahampajja imañca rattiṃ imañca divasaṃ ekabhattiko rattūparato virato vikālabhojanā. Imināpi aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissati. ‘‘Yāvajīvaṃ arahanto naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭiviratā; ahampajja imañca rattiṃ imañca divasaṃ naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato. Imināpi aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissati. ‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti mañcake vā tiṇasanthārake vā; ahampajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi mañcake vā tiṇasanthārake vā. Imināpi aṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’’ti. ‘‘Evaṃ kho, visākhe, ariyuposatho hoti. Evaṃ upavuttho kho, visākhe, ariyuposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’. ‘‘Kīvamahapphalo hoti kīvamahānisaṃso kīvamahājutiko kīvamahāvipphāro’’? ‘‘Seyyathāpi, visākhe, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ [pahūtasattaratanānaṃ (ka. sī. syā. kaṃ. pī.) ṭīkāyaṃ dassitapāḷiyeva. a. ni. 8.42] issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ, magadhānaṃ, kāsīnaṃ, kosalānaṃ, vajjīnaṃ, mallānaṃ, cetīnaṃ, vaṅgānaṃ, kurūnaṃ, pañcālānaṃ, macchānaṃ [maccānaṃ (ka.)], sūrasenānaṃ, assakānaṃ, avantīnaṃ, gandhārānaṃ, kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ [ekaṃ (ka.)] kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, visākhe, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’. ‘‘Yāni, visākhe, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo [rattidivo (ka.)]. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yaṃ, visākhe, mānusakaṃ vassasataṃ, tāvatiṃsānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbaṃ vassasahassaṃ tāvatiṃsānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, visākhe, mānusakāni dve vassasatāni, yāmānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni dve vassasahassāni yāmānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā yāmānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, visākhe, mānusakāni cattāri vassasatāni, tusitānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni cattāri vassasahassāni tusitānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tusitānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, visākhe, mānusakāni aṭṭha vassasatāni, nimmānaratīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni aṭṭha vassasahassāni nimmānaratīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, visākhe, mānusakāni soḷasa vassasatāni, paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti. ‘‘Pāṇaṃ na haññe [na hāne (sī. pī.), na hane (ka.)] na cadinnamādiye, Musā na bhāse na ca majjapo siyā; Abrahmacariyā virameyya methunā, Rattiṃ na bhuñjeyya vikālabhojanaṃ. ‘‘Mālaṃ na dhāre na ca gandhamācare, Mañce chamāyaṃ va sayetha santhate; Etañhi aṭṭhaṅgikamāhuposathaṃ, Buddhena dukkhantagunā pakāsitaṃ. ‘‘Cando ca sūriyo ca ubho sudassanā, Obhāsayaṃ anupariyanti yāvatā; Tamonudā te pana antalikkhagā, Nabhe pabhāsanti disāvirocanā. ‘‘Etasmiṃ yaṃ vijjati antare dhanaṃ, Muttā maṇi veḷuriyañca bhaddakaṃ; Siṅgī suvaṇṇaṃ atha vāpi kañcanaṃ, Yaṃ jātarūpaṃ haṭakanti vuccati. ‘‘Aṭṭhaṅgupetassa uposathassa, Kalampi te nānubhavanti soḷasiṃ; Candappabhā tāragaṇā ca sabbe. ‘‘Tasmā hi nārī ca naro ca sīlavā, Aṭṭhaṅgupetaṃ upavassuposathaṃ; Puññāni katvāna sukhudrayāni, Aninditā saggamupenti ṭhāna’’nti. dasamaṃ; ",
      "english": "Thus have I heard. On one occasion the Blessed One was staying near Sāvatthī, at the Eastern Park, in the palace of Migāra's mother (Visākhā).\n\nThen Visākhā, Migāra’s mother, on that Uposatha day, approached the Blessed One. Having approached and paid homage to the Blessed One, she sat down to one side. As Visākhā, Migāra’s mother, sat to one side, the Blessed One said to her, “Well, Visākhā, from where are you coming so early in the day?” “Venerable Sir, I am observing the Uposatha today,” she replied.\n\n“Visākhā, there are these three kinds of Uposatha. Which three? The Goatherd’s Uposatha, the Nigaṇṭha’s Uposatha, and the Noble One’s Uposatha.\n\n“And how, Visākhā, is the Goatherd’s Uposatha observed? Just as a goatherd, Visākhā, in the evening hands over the cows to their owners and reflects thus: ‘Today, the cows grazed in such-and-such a place, and drank water in such-and-such a place. Tomorrow, the cows will graze in such-and-such a place, and drink water in such-and-such a place.’ In the same way, Visākhā, some individual observing the Uposatha reflects thus: ‘Today, I ate this and that food, and consumed this and that meal. Tomorrow, I will eat this and that food, and consume this and that meal.’ He passes the day with a mind accompanied by covetousness. This is how, Visākhā, the Goatherd’s Uposatha is observed. When observed in this way, Visākhā, the Goatherd’s Uposatha is not greatly fruitful, not greatly beneficial, not greatly splendid, and not greatly pervasive in effect.\n\n“And how, Visākhā, is the Nigaṇṭha’s Uposatha observed? Visākhā, there is a class of ascetics called Nigaṇṭhas. They instruct their followers thus: ‘Come now, good man, lay aside the rod of punishment (non-harm) regarding all living beings a hundred *yojanas* to the east, lay aside the rod of punishment regarding all living beings a hundred *yojanas* to the west, lay aside the rod of punishment regarding all living beings a hundred *yojanas* to the north, lay aside the rod of punishment regarding all living beings a hundred *yojanas* to the south.’ In this way, they instruct their followers to have compassion and sympathy for some beings, but they instruct them to have neither compassion nor sympathy for other beings.\n\n“On that Uposatha day, they instruct their followers thus: ‘Come now, good man, casting off all coverings, speak thus: “I belong nowhere to anyone, and nothing belongs anywhere to me.”’ Yet, his mother and father know, ‘This is our son,’ and he knows, ‘These are my mother and father.’ His wife and children know, ‘This is our husband,’ and he knows, ‘This is my wife and children.’ His slaves, servants, and laborers know, ‘This is our master,’ and he knows, ‘These are my slaves, servants, and laborers.’ Thus, they instruct him to speak falsely at the very time he ought to be instructed to speak truthfully. I declare this to be False Speech for him. Moreover, when that night has passed, he enjoys wealth that has not been given to him. I declare this to be Taking What Is Not Given for him. This is how, Visākhā, the Nigaṇṭha’s Uposatha is observed. When observed in this way, Visākhā, the Nigaṇṭha’s Uposatha is not greatly fruitful, not greatly beneficial, not greatly splendid, and not greatly pervasive in effect.\n\n“And how, Visākhā, is the Noble One’s Uposatha observed? Visākhā, it is the process of completely purifying the defiled mind through active effort. And how, Visākhā, is there the complete purification of the defiled mind through active effort? Here, Visākhā, a noble disciple recollects the Tathāgata: ‘Indeed, the Blessed One is Arahant, Perfectly Self-Awakened, accomplished in true knowledge and conduct, sublime, knower of worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ As he recollects the Tathāgata, his mind becomes serene, and delight arises. The defilements of the mind are abandoned, just as, Visākhā, the purification of a defiled head occurs through active effort.\n\n“And how, Visākhā, does the purification of a defiled head occur through active effort? Dependent on paste, dependent on clay, dependent on water, and dependent on the person’s due effort—in this way, Visākhā, the purification of a defiled head occurs through active effort.\n\n“In the same way, Visākhā, the complete purification of the defiled mind occurs through active effort.\n\n“And how, Visākhā, does the complete purification of the defiled mind occur through active effort? Here, Visākhā, a noble disciple recollects the Tathāgata: ‘Indeed, the Blessed One is Arahant, Perfectly Self-Awakened, accomplished in true knowledge and conduct, sublime, knower of worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ As he recollects the Tathāgata, his mind becomes serene, delight arises, and the defilements of the mind are abandoned.\n\nVisakha, this is called: ‘The noble disciple observes the Uposatha of the Sublime, dwells in communion with the Sublime, and concerning the Sublime, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned.’ In this way, Visakha, the corrupted mind is purified through spiritual exertion.\n\nVisakha, the corrupted mind is purified through spiritual exertion. But how, Visakha, is the corrupted mind purified through spiritual exertion? Here, Visakha, the noble disciple reflects upon the Dhamma: ‘The Dhamma is well-proclaimed by the Blessed One, directly visible, immediate, inviting one to come and see, leading onward, to be personally understood by the wise.’ As he reflects upon the Dhamma, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned. Just as, Visakha, a corrupted body is purified through exertion.\n\nAnd how, Visakha, is a corrupted body purified through exertion? Dependent on soap or cleansing clay, dependent on scrubbing powder, dependent on water, and dependent on the proper effort of the person. In this way, Visakha, a corrupted body is purified through exertion. Similarly, Visakha, the corrupted mind is purified through spiritual exertion.\n\nBut how, Visakha, is the corrupted mind purified through spiritual exertion? Here, Visakha, the noble disciple reflects upon the Dhamma: ‘The Dhamma is well-proclaimed by the Blessed One, directly visible, immediate, inviting one to come and see, leading onward, to be personally understood by the wise.’ As he reflects upon the Dhamma, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned. Visakha, this is called: ‘The noble disciple observes the Uposatha of the Dhamma, dwells in communion with the Dhamma, and concerning the Dhamma, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned.’ In this way, Visakha, the corrupted mind is purified through spiritual exertion.\n\nVisakha, the corrupted mind is purified through spiritual exertion. But how, Visakha, is the corrupted mind purified through spiritual exertion? Here, Visakha, the noble disciple reflects upon the Sangha: ‘The community of the Blessed One’s disciples has entered the good path; the community of the Blessed One’s disciples has entered the straight path; the community of the Blessed One’s disciples has entered the path to insight; the community of the Blessed One’s disciples has entered the path of proper conduct—that is, the four pairs of men, the eight types of individuals—this community of the Blessed One’s disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of veneration, an incomparable field of merit for the world.’ As he reflects upon the Sangha, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned. Just as, Visakha, a corrupted cloth is purified through exertion.\n\nAnd how, Visakha, is a corrupted cloth purified through exertion? Dependent on lye, dependent on alkali, dependent on cow dung, dependent on water, and dependent on the proper effort of the person. In this way, Visakha, a corrupted cloth is purified through exertion. Similarly, Visakha, the corrupted mind is purified through spiritual exertion.\n\nBut how, Visakha, is the corrupted mind purified through spiritual exertion? Here, Visakha, the noble disciple reflects upon the Sangha: ‘The community of the Blessed One’s disciples has entered the good path; the community of the Blessed One’s disciples has entered the straight path; the community of the Blessed One’s disciples has entered the path to insight; the community of the Blessed One’s disciples has entered the path of proper conduct—that is, the four pairs of men, the eight types of individuals—this community of the Blessed One’s disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of veneration, an incomparable field of merit for the world.’ As he reflects upon the Sangha, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned. Visakha, this is called: ‘The noble disciple observes the Uposatha of the Sangha, dwells in communion with the Sangha, and concerning the Sangha, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned.’ In this way, Visakha, the corrupted mind is purified through spiritual exertion.\n\nVisakha, the corrupted mind is purified through spiritual exertion. But how, Visakha, is the corrupted mind purified through spiritual exertion? Here, Visakha, the noble disciple reflects upon his own moral habits: ‘They are unbroken, unpierced, unspotted, untarnished, liberating, praised by the wise, untainted by craving, and conducive to concentration.’ As he reflects upon his moral habits, his mind becomes clear, rapture arises, and the mental defilements that affect the mind are abandoned. Just as, Visakha, a corrupted mirror is purified through exertion.\n\nAnd how, Visakha, is a corrupted mirror purified through exertion? Dependent on oil, dependent on ashes, dependent on a cleaning pad, and dependent on the proper effort of the person.\n\nThus, Visakha, the purification of a tarnished mirror occurs through effort. In the same way, Visakha, the purification of a defiled mind occurs through effort.\n\n“And how, Visakha, does the purification of a defiled mind occur through effort? Here, Visakha, the noble disciple recollects their own virtues (moral precepts)—those that are unbroken, flawless, spotless, unblemished, freeing, praised by the wise, ungrasped, and leading to concentration. As they recollect these virtues, their mind becomes clear, rapture arises, and those mental defilements are abandoned. This, Visakha, is called 'the noble disciple observing the Uposatha based on virtue, dwelling in harmony with virtue; and with virtue as the basis, the mind becomes clear, rapture arises, and those mental defilements are abandoned.' Thus, Visakha, the purification of a defiled mind occurs through effort.\n\nThe purification of a defiled mind occurs through effort, Visakha. And how, Visakha, does the purification of a defiled mind occur through effort? Here, Visakha, the noble disciple recollects the devas (celestial beings): ‘There are devas of the Four Great Kings, there are devas of the Thirty-three, there are Yama devas, there are Tusita devas, there are devas who delight in creation, there are devas who control the creations of others, there are devas of the Brahma assembly, and there are devas higher than those. With the kind of confidence they possessed, those devas, having passed away from this realm, reappeared there; such confidence exists in me as well. With the kind of virtue they possessed, those devas, having passed away from this realm, reappeared there; such virtue exists in me as well. With the kind of learning they possessed, those devas, having passed away from this realm, reappeared there; such learning exists in me as well. With the kind of generosity they possessed, those devas, having passed away from this realm, reappeared there; such generosity exists in me as well. With the kind of wisdom they possessed, those devas, having passed away from this realm, reappeared there; such wisdom exists in me as well.’ As they recollect their own confidence, virtue, learning, generosity, and wisdom, and that of those devas, their mind becomes clear, rapture arises, and those mental defilements are abandoned, just as, Visakha, the purification of tarnished gold occurs through effort.\n\n“And how, Visakha, does the purification of tarnished gold occur through effort? By means of fire, by means of salt, by means of red chalk, by means of the crucible and the tongs, and by means of the corresponding exertion of the man. Thus, Visakha, the purification of tarnished gold occurs through effort. In the very same way, Visakha, the purification of a defiled mind occurs through effort.\n\n“And how, Visakha, does the purification of a defiled mind occur through effort? Here, Visakha, the noble disciple recollects the devas: ‘There are devas of the Four Great Kings, there are devas of the Thirty-three... and there are devas higher than those. With the kind of confidence they possessed, those devas, having passed away from this realm, reappeared there; such confidence exists in me as well. With the kind of virtue... learning... generosity... wisdom they possessed, those devas, having passed away from this realm, reappeared there; such wisdom exists in me as well.’ As they recollect their own confidence, virtue, learning, generosity, and wisdom, and that of those devas, their mind becomes clear, rapture arises, and those mental defilements are abandoned. This, Visakha, is called 'the noble disciple observing the Uposatha based on the devas, dwelling in harmony with the devas; and taking the devas as the basis, the mind becomes clear, rapture arises, and those mental defilements are abandoned.' Thus, Visakha, the purification of a defiled mind occurs through effort.\n\nMoreover, Visakha, that noble disciple reflects thus: ‘Throughout their lives, the Arahants (Perfected Ones), having abandoned the taking of life, abstain from the taking of life; they have laid down the rod and the weapon; they are conscientious, full of compassion, and abide with loving sympathy for all living beings. Today, during this night and this day, I too, having abandoned the taking of life, abstain from the taking of life; I have laid down the rod and the weapon; I am conscientious, full of compassion, and abide with loving sympathy for all living beings. Through this factor, I imitate the Arahants, and my Uposatha observation shall be complete.’\n\n‘Throughout their lives, the Arahants, having abandoned taking what is not given, abstain from taking what is not given; they are receivers of what is given, expecting only what is given; they abide with a pure, unthieving self. Today, during this night and this day, I too, having abandoned taking what is not given, abstain from taking what is not given; I am a receiver of what is given, expecting only what is given; I abide with a pure, unthieving self. Through this factor, I imitate the Arahants, and my Uposatha observation shall be complete.’\n\nThroughout their lives, the Arahants, having abandoned unchastity, are celibate, standing far apart from sexual conduct, abstaining from the common practices of village life. Today, during this night and this day, I too, having abandoned unchastity, am celibate, standing far apart from sexual conduct, abstaining from the common practices of village life. By this factor, I emulate the Arahants, and my Uposatha observation shall be complete.\n\nThroughout their lives, the Arahants, having abandoned false speech, abstain from false speech; they are speakers of truth, joined to the truth, firm, reliable, and trustworthy to the world. Today, during this night and this day, I too, having abandoned false speech, abstain from false speech; I am a speaker of truth, joined to the truth, firm, reliable, and trustworthy to the world. By this factor, I emulate the Arahants, and my Uposatha observation shall be complete.\n\nThroughout their lives, the Arahants, having abandoned intoxicating drinks and drugs which are the cause of heedlessness, abstain from intoxicating drinks and drugs which are the cause of heedlessness. Today, during this night and this day, I too, having abandoned intoxicating drinks and drugs which are the cause of heedlessness, abstain from intoxicating drinks and drugs which are the cause of heedlessness. By this factor, I emulate the Arahants, and my Uposatha observation shall be complete.\n\nThroughout their lives, the Arahants eat only one meal a day, having ceased eating at night, abstaining from eating at improper times. Today, during this night and this day, I too eat only one meal a day, having ceased eating at night, abstaining from eating at improper times. By this factor, I emulate the Arahants, and my Uposatha observation shall be complete.\n\nThroughout their lives, the Arahants abstain from dancing, singing, music, viewing entertainment, wearing garlands, applying scents and perfumes, and using ornaments for beautification. Today, during this night and this day, I too abstain from dancing, singing, music, viewing entertainment, wearing garlands, applying scents and perfumes, and using ornaments for beautification. By this factor, I emulate the Arahants, and my Uposatha observation shall be complete.\n\nThroughout their lives, the Arahants, having abandoned high and large beds, abstain from high and large beds, making use of a low resting place, such as a couch or a mat of straw. Today, during this night and this day, I too, having abandoned high and large beds, abstain from high and large beds, making use of a low resting place, such as a couch or a mat of straw. By this factor, I emulate the Arahants, and my Uposatha observation shall be complete.\n\n“It is in this way, Visakha, that the Noble Uposatha is observed. The Noble Uposatha observed in this manner, Visakha, is of great fruit, of great benefit, of great splendor, and of great pervasive power.”\n\n“How great is the fruit, how great is the benefit, how great is the splendor, and how great is the pervasive power?”\n\n“Suppose, Visakha, that someone were to exercise sovereignty, supremacy, and rule over these sixteen great nations, possessing abundant treasures and the seven kinds of gems—namely, Anga, Magadha, Kasi, Kosala, Vajji, Malla, Ceti, Vanga, Kuru, Pañcāla, Maccha, Sūrasena, Assaka, Avanti, Gandhāra, and Kamboja—that sovereignty is not worth even a sixteenth part of the eight-factored Uposatha. Why is that? Because, Visakha, human kingship is meager when compared to heavenly bliss.”\n\n“Visakha, fifty human years constitute one day and night for the Devas of the Four Great Kings. Thirty such days and nights constitute their month. Twelve such months constitute their year. The lifespan for the Devas of the Four Great Kings is five hundred divine years. It is indeed possible, Visakha, that some woman or man, having observed the eight-factored Uposatha, upon the dissolution of the body after death, might reappear in companionship with the Devas of the Four Great Kings. It was in reference to this, Visakha, that it was stated: 'Human kingship is meager when compared to heavenly bliss.'\"\n\n“Visakha, one hundred human years constitute one day and night for the Tāvatiṃsa Devas. Thirty such days and nights constitute their month. Twelve such months constitute their year. The lifespan for the Tāvatiṃsa Devas is one thousand divine years. It is indeed possible, Visakha, that some woman or man, having observed the eight-factored Uposatha, upon the dissolution of the body after death, might reappear in companionship with the Tāvatiṃsa Devas. It was in reference to this, Visakha, that it was stated: 'Human kingship is meager when compared to heavenly bliss.'\"\n\n“Visakha, two hundred human years constitute one day and night for the Yāma Devas. Thirty such days and nights constitute their month. Twelve such months constitute their year. The lifespan for the Yāma Devas is two thousand divine years.\"\n\nVisākha, this is indeed possible: that some individual, whether woman or man, having observed the Uposatha practice complete with eight components, upon the breaking up of the body after death, is reborn into the companionship of the Yāma gods. It is in reference to this, Visākha, that this saying was spoken: ‘Pitiful is human sovereignty when compared to heavenly happiness.’\n\nVisākha, four hundred human years constitute one single day and night for the Tusita gods. Thirty such days and nights constitute a month. Twelve such months constitute a year. The lifespan of the Tusita gods is four thousand divine years of such duration. Visākha, this is indeed possible: that some individual, whether woman or man, having observed the Uposatha practice complete with eight components, upon the breaking up of the body after death, is reborn into the companionship of the Tusita gods. It is in reference to this, Visākha, that this saying was spoken: ‘Pitiful is human sovereignty when compared to heavenly happiness.’\n\nVisākha, eight hundred human years constitute one single day and night for the Nimmānaratī gods (Those who delight in creation). Thirty such days and nights constitute a month. Twelve such months constitute a year. The lifespan of the Nimmānaratī gods is eight thousand divine years of such duration. Visākha, this is indeed possible: that some individual, whether woman or man, having observed the Uposatha practice complete with eight components, upon the breaking up of the body after death, is reborn into the companionship of the Nimmānaratī gods. It is in reference to this, Visākha, that this saying was spoken: ‘Pitiful is human sovereignty when compared to heavenly happiness.’\n\nVisākha, sixteen hundred human years constitute one single day and night for the Paranimmitavasavattī gods (Those who wield power over others’ creations). Thirty such days and nights constitute a month. Twelve such months constitute a year. The lifespan of the Paranimmitavasavattī gods is sixteen thousand divine years of such duration. Visākha, this is indeed possible: that some individual, whether woman or man, having observed the Uposatha practice complete with eight components, upon the breaking up of the body after death, is reborn into the companionship of the Paranimmitavasavattī gods. It is in reference to this, Visākha, that this saying was spoken: ‘Pitiful is human sovereignty when compared to heavenly happiness.’\n\nOne should not kill any living thing, nor should one take what is not given. One should not speak falsehoods, nor should one consume intoxicants. One should abstain from unchaste sexual conduct, and should not eat in the nighttime, which is untimely food.\n\nOne should not wear garlands nor apply perfumes or scents. One should sleep on a simple bed or a mat spread upon the ground. This, indeed, they call the eight-component Uposatha, declared by the Buddha, who attained the end of suffering.\n\nThe Moon and the Sun, both beautiful to see, shine brightly as they circle around, removing darkness as they travel through space, illuminating the directions in the sky.\n\nAll the wealth found within their range—be it pearls, gems, fine beryl, pure gold, or bullion known as refined gold—none of it is equal to even a sixteenth part of the eight-component Uposatha, just as the light of the stars does not equal the radiance of the moon.\n\nTherefore, let the moral woman and man observe the Uposatha practice complete with eight components. Having created merit that brings forth happiness, they go to happy destinations without fault.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර මිගාරමාතුප්‍රාසාද නම් වූ පූර්වාරාමයෙහි වැඩසිටින සේක. එකල්හි මිගාරමාතාව වූ විශාඛාව එදවස් පෝය දිනෙහි භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියා ය; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පසෙක වාඩි වූවා ය. එකත්පසෙක වැඩසිටි මිගාරමාතාව වූ විශාඛාවට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “විශාඛාව, එම්බා, දහවලෙහි දහවල් කාලයෙහි නුඹ කොතැනින් ද මේ එන්නේ?” “ස්වාමීනි, මම අද උපෝසථය සමාදන් වී සිටිමි.” “විශාඛාව, මේ උපෝසථයෝ තිදෙනෙකි. ඒ තිදෙනා කවරහු ද? ගෝපාලක උපෝසථය, නිගණ්ඨ උපෝසථය, ආර්ය උපෝසථය යි.”\n\nවිශාඛාව, ගෝපාලක උපෝසථය කෙසේ වන්නේ ද? විශාඛාව, යම් සේ ගොපල්ලා සවස් කාලයෙහි අයිතිකරුවන්ට ගවයන් භාර දී මෙසේ කල්පනා කරන්නේ ද: ‘අද මේ ගවයෝ අසවල් අසවල් තැන්හි හැසිරුණාහු ය, අසවල් අසවල් තැන්හි දිය පානය කළාහු ය; හෙට මේ ගවයෝ අසවල් අසවල් තැන්හි හැසිරෙන්නාහු ය, අසවල් අසවල් තැන්හි දිය පානය කරන්නාහු ය’ යි. විශාඛාව, එපරිද්දෙන් ම මෙහි ඇතැම් උපෝසථ සමාදන් වූ පුද්ගලයෙක් මෙසේ කල්පනා කරන්නේ ය: ‘මම අද මේ මේ කෑම කෑවෙමි, මේ මේ භෝජන වැළඳුවෙමි; මම හෙට මේ මේ කෑම කන්නෙමි, මේ මේ භෝජන වළඳන්නෙමි’ යි. හෙතෙම එම ලෝභය හා බැඳුණු සිතින් දවස ගෙවන්නේ ය. විශාඛාව, ගෝපාලක උපෝසථය මෙසේ වන්නේ ය. විශාඛාව, මෙසේ සමාදන් වූ ගෝපාලක උපෝසථය මහත් ඵල නැත්තේ ය, මහත් ආනිසංස නැත්තේ ය, මහත් තේජස් නැත්තේ ය, මහත් විපුල බවක් නැත්තේ ය.\n\nවිශාඛාව, නිගණ්ඨ උපෝසථය කෙසේ වන්නේ ද? විශාඛාව, ශ්‍රමණ වර්ගයක් වූ නිගණ්ඨයෝ නම් ඇත්තාහ. ඔවුහු ශ්‍රාවකයා මෙසේ සමාදන් කරවන්නාහ: ‘එම්බා පුරුෂය, ඉදින්, යම් ප්‍රාණීහු පෙර දිශාවෙහි යොදුන් සියයකට එහා සිටිත් ද, ඒ අයට දඬුවම් කිරීම අත්හරින්න; යම් ප්‍රාණීහු පසු දිශාවෙහි යොදුන් සියයකට එහා සිටිත් ද, ඒ අයට දඬුවම් කිරීම අත්හරින්න; යම් ප්‍රාණීහු උතුරු දිශාවෙහි යොදුන් සියයකට එහා සිටිත් ද, ඒ අයට දඬුවම් කිරීම අත්හරින්න; යම් ප්‍රාණීහු දකුණු දිශාවෙහි යොදුන් සියයකට එහා සිටිත් ද, ඒ අයට දඬුවම් කිරීම අත්හරින්න’ යි. මෙසේ ඔවුහු ඇතැම් ප්‍රාණීන් සම්බන්ධයෙන් අනුකම්පාවෙන් හා දයාවෙන් සමාදන් කරවන්නාහු ය, ඇතැම් ප්‍රාණීන් සම්බන්ධයෙන් අනුකම්පාවෙන් හෝ දයාවෙන් සමාදන් නො කරවන්නාහු ය.\n\nඔවුහු එදවස් පෝය දිනෙහි ශ්‍රාවකයා මෙසේ සමාදන් කරවන්නාහ: ‘එම්බා පුරුෂය, ඉදින්, සියලු වස්ත්‍ර අත්හැර මෙසේ කියන්න: මා කිසිවෙකුට කිසිවක් ලෙස නොපවතී, කිසි තැනක කිසිවක් මාගේ ද නොවේ’ යි. නමුත් ඔහුගේ මවුපියෝ, ‘මේ අපගේ පුත්‍රයා ය’ යි දැන සිටිති. හෙතෙමේ ද, ‘මේ මාගේ මවුපියෝ ය’ යි දැන සිටී. ඔහුගේ භාර්යාව හා දරුවෝ, ‘මේ අපගේ ස්වාමියා ය’ යි දැන සිටිති. හෙතෙමේ ද, ‘මේ මාගේ භාර්යාව හා දරුවෝ ය’ යි දැන සිටී. ඔහුගේ දාසකම්කරුවන් හා පිරිස්, ‘මේ අපගේ ස්වාමියා ය’ යි දැන සිටිති. හෙතෙමේ ද, ‘මේ මාගේ දාසකම්කරුවෝ ය, පිරිස ය’ යි දැන සිටී. මෙසේ යම් කලක සත්‍යය සමාදන් කරවිය යුතු ද, එබඳු කලෙක ඔවුහු ඔහු මුසාවාදයෙහි සමාදන් කරවති. මම මෙය ඔහුට මුසාවාදයක් වශයෙන් කියමි. හෙතෙම ඒ රැය ගෙවී ගිය පසු අයිතියට නොදුන් දේ (තමාගේ කොට) ම පරිභෝග කරන්නේ ය. මම මෙය ඔහුට අදත්තාදානයක් වශයෙන් කියමි. විශාඛාව, නිගණ්ඨ උපෝසථය මෙසේ වන්නේ ය. විශාඛාව, මෙසේ සමාදන් වූ නිගණ්ඨ උපෝසථය මහත් ඵල නැත්තේ ය, මහත් ආනිසංස නැත්තේ ය, මහත් තේජස් නැත්තේ ය, මහත් විපුල බවක් නැත්තේ ය.\n\nවිශාඛාව, ආර්ය උපෝසථය කෙසේ වන්නේ ද? විශාඛාව, කෙලෙස් සහිත සිත ප්‍රයෝගයකින් පිරිසුදු කිරීම වේ. විශාඛාව, කෙලෙස් සහිත සිත ප්‍රයෝගයකින් පිරිසුදු කිරීම කෙසේ වන්නේ ද? විශාඛාව, මේ ශාසනයෙහි ආර්ය ශ්‍රාවකයා තථාගතයන් වහන්සේ අනුස්මරණය කරන්නේ ය: ‘ඒ භාග්‍යවතුන් වහන්සේ අර්හත් වූ සේක, සම්මාසම්බුද්ධ වූ සේක, විද්‍යාචරණසම්පන්න වූ සේක, සුගත වූ සේක, ලෝකය දත් සේක, නිරුත්තර වූ පුරිසදම්මසාරථී වූ සේක, දෙවි මිනිසුන්ට ශාස්තෘ වූ සේක, බුද්ධ වූ සේක, භාග්‍යවතුන් වහන්සේ වූ සේක’ යි. ඒ තථාගතයන් වහන්සේ අනුස්මරණය කරන ඔහුට සිත පහන් වන්නේ ය, ප්‍රමෝදය හටගන්නේ ය. යම් සිතේ කෙලෙස් ඇත් ද, ඒවා දුරු වන්නේ ය. විශාඛාව, යම් සේ කෙලෙස් සහිත හිසක් ප්‍රයෝගයකින් පිරිසුදු කිරීම සිදු වේ ද, එපරිද්දෙනි.\n\nවිශාඛාව, කෙලෙස් සහිත හිසක් ප්‍රයෝගයකින් පිරිසුදු කිරීම කෙසේ වන්නේ ද? කෙඳි පිටි, මැටි, දියර, සහ ඊට අදාළ පුරුෂයාගේ උත්සාහය නිසා ය. විශාඛාව, කෙලෙස් සහිත හිසක් ප්‍රයෝගයකින් පිරිසුදු කිරීම මෙසේ වන්නේ ය. විශාඛාව, එපරිද්දෙන් ම කෙලෙස් සහිත සිත ප්‍රයෝගයකින් පිරිසුදු කිරීම සිදු වන්නේ ය.\n\nවිශාඛාව, කෙලෙස් සහිත සිත ප්‍රයෝගයකින් පිරිසුදු කිරීම කෙසේ වන්නේ ද? විශාඛාව, මේ ශාසනයෙහි ආර්ය ශ්‍රාවකයා තථාගතයන් වහන්සේ අනුස්මරණය කරන්නේ ය: ‘ඒ භාග්‍යවතුන් වහන්සේ අර්හත් වූ සේක, සම්මාසම්බුද්ධ වූ සේක, විද්‍යාචරණසම්පන්න වූ සේක, සුගත වූ සේක, ලෝකය දත් සේක, නිරුත්තර වූ පුරිසදම්මසාරථී වූ සේක, දෙවි මිනිසුන්ට ශාස්තෘ වූ සේක, බුද්ධ වූ සේක, භාග්‍යවතුන් වහන්සේ වූ සේක’ යි. ඒ තථාගතයන් වහන්සේ අනුස්මරණය කරන ඔහුට සිත පහන් වන්නේ ය, ප්‍රමෝදය හටගන්නේ ය. යම් සිතේ කෙලෙස් ඇත් ද, ඒවා දුරු වන්නේ ය.\n\nවිශාඛයෙනි, මේ (උපෝෂථය) මෙසේ කියනු ලැබේ: ‘ආර්ය ශ්‍රාවකයා බ්‍රහ්මෝපෝෂථය සමාදන් වේ. ඔහු බ්‍රහ්මයා (බුදුරජාණන් වහන්සේ) සමඟ වාසය කරයි. බ්‍රහ්මයා අරමුණු කරගෙන ඔහුගේ සිත පැහැදෙයි. ප්‍රමෝදය ඇති වේ. සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි.’ විශාඛයෙනි, මේ අයුරින්ම යම් සිතක් කිලිටි වී ඇත්නම්, ඒ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ. විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? විශාඛයෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා ධර්මය සිහි කරයි: ‘ඒ භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛාත කරන ලද ධර්මය ස්වයංව දැකිය හැකි ය, ක්ෂණික වූවකි, ‘එන්න බලන්න’ යැයි පෙන්විය හැකි ය, නිවන කරා ගෙන යන්නකි, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැක්ක යුත්තකි’ යනුවෙනි. ඔහු ඒ ධර්මය සිහි කරන විට සිත පැහැදෙයි, ප්‍රමෝදය ඇති වේ, සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි. විශාඛයෙනි, ඒ අයුරින්ම යම් කිලිටි වූ ශරීරයක් වේද, එය උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ ශරීරයක් උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? යම් සබන් හෝ පෙන නමැති දේත්, කුඩුත්, ජලයත්, ඒ සඳහා අවශ්‍ය පුද්ගලයාගේ උත්සාහයත් නිසා ය. විශාඛයෙනි, මේ අයුරින්ම කිලිටි වූ ශරීරයක් උපාය මඟින් පිරිසිදු කිරීම සිදු වේ. මේ අයුරින්ම විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? විශාඛයෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා ධර්මය සිහි කරයි: ‘ඒ භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛාත කරන ලද ධර්මය ස්වයංව දැකිය හැකි ය, ක්ෂණික වූවකි, ‘එන්න බලන්න’ යැයි පෙන්විය හැකි ය, නිවන කරා ගෙන යන්නකි, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැක්ක යුත්තකි’ යනුවෙනි. ඔහු ඒ ධර්මය සිහි කරන විට සිත පැහැදෙයි, ප්‍රමෝදය ඇති වේ, සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි. විශාඛයෙනි, මේ (උපෝෂථය) මෙසේ කියනු ලැබේ: ‘ආර්ය ශ්‍රාවකයා ධර්මෝපෝෂථය සමාදන් වේ. ඔහු ධර්මය සමඟ වාසය කරයි. ධර්මය අරමුණු කරගෙන ඔහුගේ සිත පැහැදෙයි, ප්‍රමෝදය ඇති වේ, සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි.’ විශාඛයෙනි, මේ අයුරින්ම යම් සිතක් කිලිටි වී ඇත්නම්, ඒ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ. විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? විශාඛයෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා සංඝයා වහන්සේලා සිහි කරයි: ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා වහන්සේලා මනා ලෙස පිළිපන්නාහ. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා වහන්සේලා අවංකව පිළිපන්නාහ. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා වහන්සේලා ඥාය ධර්මයට මනාව පිළිපන්නාහ. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා වහන්සේලා මනා වූ ගරු කටයුතු පිළිවෙතින් පිළිපන්නාහ. එනම්, යුගල වශයෙන් ගත් කල සතරක් ද, පුද්ගල වශයෙන් ගත් කල අටක් ද වන මේ භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා වහන්සේලා දුර සිට ගෙනෙන පූජාවට සුදුසු ය, අමුත්තන් හට දෙන පූජාවට සුදුසු ය, දක්ෂිණාවට සුදුසු ය, වැඳීමට සුදුසු ය, ලෝකයාගේ අනුත්තර වූ පින් කෙතක් වන්නේය.’ ඔහු ඒ සංඝයා වහන්සේලා සිහි කරන විට සිත පැහැදෙයි, ප්‍රමෝදය ඇති වේ, සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි. විශාඛයෙනි, ඒ අයුරින්ම යම් කිලිටි වූ වස්ත්‍රයක් වේද, එය උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ වස්ත්‍රයක් උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? යම් හුමාලයත්, ක්ෂාර ද්‍රව්‍යයත්, ගොම ද්‍රව්‍යයත්, ජලයත්, ඒ සඳහා අවශ්‍ය පුද්ගලයාගේ උත්සාහයත් නිසා ය. විශාඛයෙනි, මේ අයුරින්ම කිලිටි වූ වස්ත්‍රයක් උපාය මඟින් පිරිසිදු කිරීම සිදු වේ. මේ අයුරින්ම විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? විශාඛයෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා සංඝයා වහන්සේලා සිහි කරයි: ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා වහන්සේලා මනා ලෙස පිළිපන්නාහ... ලෝකයාගේ අනුත්තර වූ පින් කෙතක් වන්නේය’ යනුවෙනි. ඔහු ඒ සංඝයා වහන්සේලා සිහි කරන විට සිත පැහැදෙයි, ප්‍රමෝදය ඇති වේ, සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි. විශාඛයෙනි, මේ (උපෝෂථය) මෙසේ කියනු ලැබේ: ‘ආර්ය ශ්‍රාවකයා සංඝෝපෝෂථය සමාදන් වේ. ඔහු සංඝයා වහන්සේලා සමඟ වාසය කරයි. සංඝයා අරමුණු කරගෙන ඔහුගේ සිත පැහැදෙයි, ප්‍රමෝදය ඇති වේ, සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි.’ විශාඛයෙනි, මේ අයුරින්ම යම් සිතක් කිලිටි වී ඇත්නම්, ඒ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදු වේ. විශාඛයෙනි, කිලිටි වූ සිත උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? විශාඛයෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා තමාගේම සීලයන් සිහි කරයි. ඒවා අඛණ්ඩ ය, සිඳුරු නැති ය, පැල්ලම් නැති ය, කැලැල් නැති ය, ස්වාධීන ය, නුවණැත්තන් විසින් ප්‍රශංසා කරන ලද ය, තෘෂ්ණා දෘෂ්ටිවලින් නොඇලුණු ය, සමාධියට උපකාරී වන ස්වභාව ඇත්තකි. ඔහු ඒ සීලය සිහි කරන විට සිත පැහැදෙයි, ප්‍රමෝදය ඇති වේ, සිතේ යම් උපක්ලේශ ධර්ම ඇත්ද, ඒවා පහ වී යයි. විශාඛයෙනි, ඒ අයුරින්ම යම් කිලිටි වූ කැඩපතක් වේද, එය උපාය මඟින් පිරිසිදු කිරීම සිදු වේ.\n\n“විශාඛයෙනි, කිලිටි වූ කැඩපතක් උපාය මඟින් පිරිසිදු කිරීම සිදුවන්නේ කෙසේද? යම් තෙල් ද්‍රව්‍යයත්, අළු ද්‍රව්‍යයත්, පිරිසිදු කිරීමට අවශ්‍ය රෙදි කැබැල්ලක් වැනි දෙයක් ද, ඒ සඳහා අවශ්‍ය පුද්ගලයාගේ උත්සාහයත් නිසා ය.\n\nවිශාඛය, මෙසේ යම් සේ කිලිටි වූ කණ්ණාඩියක් ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කරන්නේ ද, එසේම විශාඛය, කිලිටි වූ සිත ද ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කිරීම සිදුවේ.\n\nවිශාඛය, කිලිටි වූ සිත ක්‍රමික වෑයමකින් කෙසේ නම් මුළුමනින් පිරිසිදු වන්නේ ද? විශාඛය, මෙහිලා ආර්ය ශ්‍රාවකයා තමාගේ ශීලය, එනම් අඛණ්ඩ වූ... (පෙ)... සමාධිය පිණිස පවත්නා වූ ශීලයන් සිහි කරන්නේ ය. ඔහුට ඒ ශීලය සිහි කරන කල්හි සිත පහදී, ප්‍රීතිය උපදී, සිතේ යම් ක්ලේශයන් ඇත්ද, ඒවා පහව යයි. විශාඛය, මෙය කියනු ලැබේ: ‘මේ ආර්ය ශ්‍රාවකයා ශීලය ඇති උපෝසථය සමාදන් වී සිටී. ඔහු ශීලය සමඟ වාසය කරයි. ඒ ශීලය මුල් කරගෙන ඔහුගේ සිත පහදී, ප්‍රීතිය උපදී, සිතේ යම් ක්ලේශයන් ඇත්ද, ඒවා පහව යයි.’ විශාඛය, මෙසේ කිලිටි වූ සිත ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කිරීම සිදුවේ.\n\nවිශාඛය, කිලිටි වූ සිත ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කිරීම සිදුවේ. විශාඛය, කිලිටි වූ සිත ක්‍රමික වෑයමකින් කෙසේ නම් මුළුමනින් පිරිසිදු වන්නේ ද? විශාඛය, මෙහිලා ආර්ය ශ්‍රාවකයා දෙවියන් සිහි කරන්නේ ය: ‘චාතුම්මහාරාජික දෙවිවරු ඇත්තාහ, තාවතිංස දෙවිවරු ඇත්තාහ, යාම දෙවිවරු ඇත්තාහ, තුසිත දෙවිවරු ඇත්තාහ, නිම්මානරති දෙවිවරු ඇත්තාහ, පරනිම්මිතවසවර්තී දෙවිවරු ඇත්තාහ, බ්‍රහ්මකායික දෙවිවරු ඇත්තාහ, ඊටත් වඩා උසස් දෙවිවරු ඇත්තාහ. යම් ආකාරයක ශ්‍රද්ධාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එතැන උපන්නාහු ද, ඒ ආකාරයේ ශ්‍රද්ධාවක් මට ද ඇත්තේ ය. යම් ආකාරයක ශීලයකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එතැන උපන්නාහු ද, ඒ ආකාරයේ ශීලයක් මට ද ඇත්තේ ය. යම් ආකාරයක ශ්‍රවණයකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එතැන උපන්නාහු ද, ඒ ආකාරයේ ශ්‍රවණයක් මට ද ඇත්තේ ය. යම් ආකාරයක ත්‍යාගශීලී බවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එතැන උපන්නාහු ද, ඒ ආකාරයේ ත්‍යාගශීලී බවක් මට ද ඇත්තේ ය. යම් ආකාරයක ප්‍රඥාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එතැන උපන්නාහු ද, ඒ ආකාරයේ ප්‍රඥාවක් මට ද ඇත්තේ ය’ යි සිහි කරන්නේ ය. තමාගේත් ඒ දෙවිවරුන්ගේත් ශ්‍රද්ධාව ද, ශීලය ද, ශ්‍රවණය ද, ත්‍යාගය ද, ප්‍රඥාව ද සිහි කරන ඔහුට සිත පහදී, ප්‍රීතිය උපදී, සිතේ යම් ක්ලේශයන් ඇත්ද, ඒවා පහව යයි. විශාඛය, යම් සේ කිලිටි වූ රත්‍රන් ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කරන්නේ ද, එසේ ම ය.\n\nවිශාඛය, කිලිටි වූ රත්‍රන් ක්‍රමික වෑයමකින් කෙසේ නම් මුළුමනින් පිරිසිදු වන්නේ ද? උදුන ද, ක්ෂාර ද, ගුරුගල් ද, නාලිකාව සහ සන්ඩැස් ද, ඒ සඳහා පුරුෂයාගේ උචිත වෑයම ද උපකාර කොට ගැනීමෙන් ය. විශාඛය, මෙසේ කිලිටි වූ රත්‍රන් ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කිරීම සිදුවේ. එසේම විශාඛය, කිලිටි වූ සිත ද ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කිරීම සිදුවේ.\n\nවිශාඛය, කිලිටි වූ සිත ක්‍රමික වෑයමකින් කෙසේ නම් මුළුමනින් පිරිසිදු වන්නේ ද? විශාඛය, මෙහිලා ආර්ය ශ්‍රාවකයා දෙවියන් සිහි කරන්නේ ය: ‘චාතුම්මහාරාජික දෙවිවරු ඇත්තාහ, තාවතිංස දෙවිවරු ඇත්තාහ... (පෙ)... ඊටත් වඩා උසස් දෙවිවරු ඇත්තාහ. යම් ආකාරයක ශ්‍රද්ධාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එතැන උපන්නාහු ද, ඒ ආකාරයේ ශ්‍රද්ධාවක් මට ද ඇත්තේ ය. යම් ආකාරයක ශීලයකින් යුක්තව... (පෙ)... ශ්‍රවණයකින් යුක්තව... (පෙ)... ත්‍යාගයෙන් යුක්තව... (පෙ)... ප්‍රඥාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එතැන උපන්නාහු ද, ඒ ආකාරයේ ප්‍රඥාවක් මට ද ඇත්තේ ය’ යි සිහි කරන්නේ ය. තමාගේත් ඒ දෙවිවරුන්ගේත් ශ්‍රද්ධාව ද, ශීලය ද, ශ්‍රවණය ද, ත්‍යාගය ද, ප්‍රඥාව ද සිහි කරන ඔහුට සිත පහදී, ප්‍රීතිය උපදී, සිතේ යම් ක්ලේශයන් ඇත්ද, ඒවා පහව යයි. විශාඛය, මෙය කියනු ලැබේ: ‘මේ ආර්ය ශ්‍රාවකයා දේවතා උපෝසථය සමාදන් වී සිටී. ඔහු දෙවිවරුන් සමඟ වාසය කරයි. ඒ දෙවිවරුන් මුල් කරගෙන ඔහුගේ සිත පහදී, ප්‍රීතිය උපදී, සිතේ යම් ක්ලේශයන් ඇත්ද, ඒවා පහව යයි.’ විශාඛය, මෙසේ කිලිටි වූ සිත ක්‍රමික වෑයමකින් මුළුමනින් පිරිසිදු කිරීම සිදුවේ.\n\nවිශාඛය, ඒ ආර්ය ශ්‍රාවකයා මෙසේ නුවණින් විමසන්නේ ය: ‘අරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා ප්‍රාණඝාතය හැර දමා, ප්‍රාණඝාතයෙන් වැළකී, දඬු මුගුරු බහා තබා, සිත් පිත් නැති ආයුධ ඉවත ලා, ලැජ්ජා ඇත්තෝ, කරුණාවෙන් යුක්ත ව, සියලු සතුන්ගේ හිත පිණිස අනුකම්පාවෙන් යුක්ත ව වාසය කරති. මම ද අද මේ රාත්‍රියේත්, මේ දවසේත්, ප්‍රාණඝාතය හැර දමා, ප්‍රාණඝාතයෙන් වැළකී, දඬු මුගුරු බහා තබා, සිත් පිත් නැති ආයුධ ඉවත ලා, ලැජ්ජා ඇත්තා වූ, කරුණාවෙන් යුක්ත වූ, සියලු සතුන්ගේ හිත පිණිස අනුකම්පාවෙන් යුක්ත ව වාසය කරමි. මේ අංගයෙන් මම අරහතුන් වහන්සේලා අනුකරණය කරමි. මා විසින් උපෝසථය ද සමවදින ලද්දේ වන්නේ ය. අරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා අදත්තාදානය හැර දමා, අදත්තාදානයෙන් වැළකී, දෙන දේ ම ගනිමින්, දෙන දේම බලාපොරොත්තු වෙමින්, හොර සිතක් නැත්තාහු, පිරිසිදු ආත්මභාවයකින් යුක්ත ව වාසය කරති. මම ද අද මේ රාත්‍රියේත්, මේ දවසේත් අදත්තාදානය හැර දමා, අදත්තාදානයෙන් වැළකී, දෙන දේ ම ගනිමින්, දෙන දේම බලාපොරොත්තු වෙමින්, හොර සිතක් නැත්තා වූ, පිරිසිදු ආත්මභාවයකින් යුක්ත ව වාසය කරමි. මේ අංගයෙන් මම අරහතුන් වහන්සේලා අනුකරණය කරමි. මා විසින් උපෝසථය ද සමවදින ලද්දේ වන්නේ ය.\n\nඅරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා අබ්‍රහ්මචාරී සේවනය දුරු කොට, බ්‍රහ්මචාරීව, මෙථුන ග්‍රාම්‍ය ධර්මයෙන් දුරස් වූ ආකාරයෙන් හැසිරෙති. මම ද අද මේ රාත්‍රිය සහ මේ දිවා කාලය පුරා අබ්‍රහ්මචාරී සේවනය දුරු කොට, බ්‍රහ්මචාරීව, මෙථුන ග්‍රාම්‍ය ධර්මයෙන් දුරස්ව හැසිරෙමි. මේ අංගයෙන් ද මම අරහතුන් වහන්සේලා අනුකරණය කරමි, මාගේ උපෝසථය රැකීම ද සිදු කරනු ලැබේ.\n\nඅරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා මුසාවාදයෙන් වැළකී, මුසාවාදය දුරු කොට, සත්‍ය වචන කියන, සත්‍යයෙන් බැඳුණු, ස්ථිර වූ, විශ්වාස කළ හැකි, ලෝකයා නොරවටන අය වෙති. මම ද අද මේ රාත්‍රිය සහ මේ දිවා කාලය පුරා මුසාවාදයෙන් වැළකී, මුසාවාදය දුරු කොට, සත්‍ය වචන කියන, සත්‍යයෙන් බැඳුණු, ස්ථිර වූ, විශ්වාස කළ හැකි, ලෝකයා නොරවටන අයෙක් වෙමි. මේ අංගයෙන් ද මම අරහතුන් වහන්සේලා අනුකරණය කරමි, මාගේ උපෝසථය රැකීම ද සිදු කරනු ලැබේ.\n\nඅරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා සුරාමේරය මත්පැන් පානයෙන් සිහි විකල් වන තැන දුරු කොට, එයින් වැළකුණාහු වෙති. මම ද අද මේ රාත්‍රිය සහ මේ දිවා කාලය පුරා සුරාමේරය මත්පැන් පානයෙන් සිහි විකල් වන තැන දුරු කොට, එයින් වැළකුණෙක් වෙමි. මේ අංගයෙන් ද මම අරහතුන් වහන්සේලා අනුකරණය කරමි, මාගේ උපෝසථය රැකීම ද සිදු කරනු ලැබේ.\n\nඅරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා එක් වේලක් පමණක් වළඳන්නාහු, රාත්‍රියට වැළකුණාහු, විකල් භෝජනයෙන් දුරස් වූවාහු වෙති. මම ද අද මේ රාත්‍රිය සහ මේ දිවා කාලය පුරා එක් වේලක් පමණක් වළඳන්නෙක් වෙමි, රාත්‍රියට වැළකුණෙක් වෙමි, විකල් භෝජනයෙන් දුරස් වූවෙක් වෙමි. මේ අංගයෙන් ද මම අරහතුන් වහන්සේලා අනුකරණය කරමි, මාගේ උපෝසථය රැකීම ද සිදු කරනු ලැබේ.\n\nඅරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා නැටුම්, ගීත ගැයීම්, වාදනය කිරීම්, සහ විරූප දර්ශන බැලීමෙන් ද, මල්, සුවඳ විලවුන්, ආලේපන දැරීම, සැරසීම සහ අලංකාර කිරීම් ආදියෙන් ද වැළකුණාහු වෙති. මම ද අද මේ රාත්‍රිය සහ මේ දිවා කාලය පුරා නැටුම්, ගීත ගැයීම්, වාදනය කිරීම්, සහ විරූප දර්ශන බැලීමෙන් ද, මල්, සුවඳ විලවුන්, ආලේපන දැරීම, සැරසීම සහ අලංකාර කිරීම් ආදියෙන් ද වැළකුණෙක් වෙමි. මේ අංගයෙන් ද මම අරහතුන් වහන්සේලා අනුකරණය කරමි, මාගේ උපෝසථය රැකීම ද සිදු කරනු ලැබේ.\n\nඅරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා උස් අසුන් සහ මහා අසුන් දුරු කොට, උස් අසුන් සහ මහා අසුන් වලින් වැළකී, යහනක් මත හෝ තෘණ ඇතිරිල්ලක් මත හෝ පහත් සයනයක වාසය කරති. මම ද අද මේ රාත්‍රිය සහ මේ දිවා කාලය පුරා උස් අසුන් සහ මහා අසුන් දුරු කොට, උස් අසුන් සහ මහා අසුන් වලින් වැළකී, යහනක් මත හෝ තෘණ ඇතිරිල්ලක් මත හෝ පහත් සයනයක වාසය කරමි. මේ අංගයෙන් ද මම අරහතුන් වහන්සේලා අනුකරණය කරමි, මාගේ උපෝසථය රැකීම ද සිදු කරනු ලැබේ.\n\nවිශාඛාවෙනි, මේ අයුරින් ආර්ය උපෝසථය සිදු කරනු ලැබේ. විශාඛාවෙනි, මෙසේ රැක ගන්නා ලද ආර්ය උපෝසථය මහා ඵල සහිත වන්නේය, මහා ආනිසංස සහිත වන්නේය, මහා තේජසින් යුක්ත වන්නේය, මහා ව්‍යාප්තියක් සහිත වන්නේය. කොපමණ මහා ඵල සහිත වන්නේද? කොපමණ මහා ආනිසංස සහිත වන්නේද? කොපමණ මහා තේජසින් යුක්ත වන්නේද? කොපමණ මහා ව්‍යාප්තියක් සහිත වන්නේද?\n\nවිශාඛාවෙනි, යම් සේ මේ සොළොස් මහා ජනපදයන්හි (ඒවා නම්: අංග, මගධ, කාසි, කෝසල, වජ්ජී, මල්ල, චේතී, වංග, කුරූ, පංචාල, මච්ඡ, සූරසේන, අස්සක, අවන්තී, ගන්ධාර, කම්බෝජ යන) බොහෝ රජුන්ගේ සත් රුවන් සහිත අධිපතිත්වය ද රාජ්‍ය පාලනය ද කරන්නට ලැබේ නම්, අෂ්ටාංග සමන්විත උපෝසථයෙහි එම වටිනාකම එයින් සොළොස්වන කොටසකටවත් (එක කලාවකටවත්) නොවටින්නේය. ඒ කුමන කරුණක් නිසා ද? විශාඛාවෙනි, මනුෂ්‍ය රාජ්‍යය දිව්‍ය සැපයට සාපේක්ෂව ඉතා අල්ප වූවකි.\n\nවිශාඛාවෙනි, මනුෂ්‍යයින්ගේ යම් පනස් වර්ෂයක් වේද, එය චාතුම්මහාරාජික දෙවියන්ගේ එක් දිනක් සහ රාත්‍රියක් වන්නේය. එම රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. එම මාසයෙන් දොළොස් මාසයක් වසරකි. එම වසරින් දිව්‍ය වර්ෂ පන්සියයක් චාතුම්මහාරාජික දෙවියන්ගේ ආයුෂ ප්‍රමාණය වන්නේය. විශාඛාවෙනි, යම් පුද්ගලයෙක් හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අෂ්ටාංග සමන්වාගත උපෝසථය සමාදන් වී රැක, කය බිඳී මරණින් මතු චාතුම්මහාරාජික දෙවියන්ගේ සහායෝගයට පැමිණේ නම්, එවැන්නක් මෙහි සිදුවිය හැකිය. මේ කාරණය මුල් කොට ගෙනය විශාඛාවෙනි, ‘මනුෂ්‍ය රාජ්‍යය දිව්‍ය සැපයට සාපේක්ෂව ඉතා අල්ප වූවකි’ යැයි කියන ලද්දේ.\n\nවිශාඛාවෙනි, මනුෂ්‍යයින්ගේ යම් වර්ෂ සියයක් වේද, එය තාවතිංසක දෙවියන්ගේ එක් දිනක් සහ රාත්‍රියක් වන්නේය. එම රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. එම මාසයෙන් දොළොස් මාසයක් වසරකි. එම වසරින් දිව්‍ය වර්ෂ දහසක් තාවතිංසක දෙවියන්ගේ ආයුෂ ප්‍රමාණය වන්නේය. විශාඛාවෙනි, යම් පුද්ගලයෙක් හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අෂ්ටාංග සමන්වාගත උපෝසථය සමාදන් වී රැක, කය බිඳී මරණින් මතු තාවතිංසක දෙවියන්ගේ සහායෝගයට පැමිණේ නම්, එවැන්නක් මෙහි සිදුවිය හැකිය. මේ කාරණය මුල් කොට ගෙනය විශාඛාවෙනි, ‘මනුෂ්‍ය රාජ්‍යය දිව්‍ය සැපයට සාපේක්ෂව ඉතා අල්ප වූවකි’ යැයි කියන ලද්දේ.\n\nවිශාඛාවෙනි, මනුෂ්‍යයින්ගේ යම් වර්ෂ දෙසීයක් වේද, එය යාම දෙවියන්ගේ එක් දිනක් සහ රාත්‍රියක් වන්නේය. එම රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. එම මාසයෙන් දොළොස් මාසයක් වසරකි. එම වසරින් දිව්‍ය වර්ෂ දෙදහසක් යාම දෙවියන්ගේ ආයුෂ ප්‍රමාණය වන්නේය.\n\nවිශාඛයෙනි, යම් ස්ත්‍රියක් හෝ පුරුෂයකු හෝ අෂ්ටාංගයෙන් යුක්ත වූ උපෝසථය සමාදන් වී, කය බිඳී මරණින් මතු යාම නම් වූ දෙවියන්ගේ සහවාසයට (එම දිව්‍ය ලෝකයට) උපදින්නට පුළුවන. විශාඛයෙනි, ‘දිව්‍ය වූ සැපය හා සසඳන කල මනුෂ්‍ය රාජ්‍යය දුර්වල ය’ යනුවෙන් කියන ලද්දේ මෙය අරමුණු කොටගෙන ය.\n\nවිශාඛයෙනි, මනුෂ්‍ය වර්ෂ සතර සියයක් යනු තුසිත දෙවියන්ට එක් දිනක් හා රාත්‍රියක් වේ. එම රාත්‍රියෙන් තිස් රාත්‍රියක් එක් මාසයක් වේ. එම මාසයෙන් දොළොස් මාසයක් එක් සංවත්සරයක් වේ. එම සංවත්සරයෙන් දිව්‍ය වර්ෂ සාර දහසක් තුසිත දෙවියන්ගේ ආයුෂ ප්‍රමාණය වේ. විශාඛයෙනි, යම් ස්ත්‍රියක් හෝ පුරුෂයකු හෝ අෂ්ටාංගයෙන් යුක්ත වූ උපෝසථය සමාදන් වී, කය බිඳී මරණින් මතු, තුසිත දෙවියන්ගේ සහවාසයට උපදින්නට පුළුවන. විශාඛයෙනි, ‘දිව්‍ය වූ සැපය හා සසඳන කල මනුෂ්‍ය රාජ්‍යය දුර්වල ය’ යනුවෙන් කියන ලද්දේ මෙය අරමුණු කොටගෙන ය.\n\nවිශාඛයෙනි, මනුෂ්‍ය වර්ෂ අට සියයක් යනු නිර්මාණරතී දෙවියන්ට එක් දිනක් හා රාත්‍රියක් වේ. එම රාත්‍රියෙන් තිස් රාත්‍රියක් එක් මාසයක් වේ. එම මාසයෙන් දොළොස් මාසයක් එක් සංවත්සරයක් වේ. එම සංවත්සරයෙන් දිව්‍ය වර්ෂ අට දහසක් නිර්මාණරතී දෙවියන්ගේ ආයුෂ ප්‍රමාණය වේ. විශාඛයෙනි, යම් ස්ත්‍රියක් හෝ පුරුෂයකු හෝ අෂ්ටාංගයෙන් යුක්ත වූ උපෝසථය සමාදන් වී, කය බිඳී මරණින් මතු, නිර්මාණරතී දෙවියන්ගේ සහවාසයට උපදින්නට පුළුවන. විශාඛයෙනි, ‘දිව්‍ය වූ සැපය හා සසඳන කල මනුෂ්‍ය රාජ්‍යය දුර්වල ය’ යනුවෙන් කියන ලද්දේ මෙය අරමුණු කොටගෙන ය.\n\nවිශාඛයෙනි, මනුෂ්‍ය වර්ෂ දහසය සියයක් යනු පරනිම්මිතවසවත්ති දෙවියන්ට එක් දිනක් හා රාත්‍රියක් වේ. එම රාත්‍රියෙන් තිස් රාත්‍රියක් එක් මාසයක් වේ. එම මාසයෙන් දොළොස් මාසයක් එක් සංවත්සරයක් වේ. එම සංවත්සරයෙන් දිව්‍ය වර්ෂ දහසය දහසක් පරනිම්මිතවසවත්ති දෙවියන්ගේ ආයුෂ ප්‍රමාණය වේ. විශාඛයෙනි, යම් ස්ත්‍රියක් හෝ පුරුෂයකු හෝ අෂ්ටාංගයෙන් යුක්ත වූ උපෝසථය සමාදන් වී, කය බිඳී මරණින් මතු, පරනිම්මිතවසවත්ති දෙවියන්ගේ සහවාසයට උපදින්නට පුළුවන. විශාඛයෙනි, ‘දිව්‍ය වූ සැපය හා සසඳන කල මනුෂ්‍ය රාජ්‍යය දුර්වල ය’ යනුවෙන් කියන ලද්දේ මෙය අරමුණු කොටගෙන ය.\n\nසතුන් මැරීම නොකළ යුතු ය. නුදුන් දේ ගැනීම නොකළ යුතු ය. මුසාවාද නොකළ යුතු ය. මත්පැන් පානය නොකළ යුතු ය. මෙථුන සේවනය නම් වූ අබ්‍රහ්මචරියාවෙන් වැළකිය යුතු ය. රාත්‍රී කාලයේ (විවාල භෝජන) ආහාර නොගත යුතු ය.\n\nමල්මාලා දැරීම හෝ සුවඳ විලවුන් ආලේප කිරීම නොකළ යුතු ය. උස් අසුන්වලින් වැළකී බිම ඇතිරූ සයනයක නිදාගත යුතු ය. මේ අංග අටින් යුක්ත උපෝසථය දුක අවසන් කිරීමේ ගුණයෙන් යුතු වූ බුදුරජාණන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දේ ය.\n\nචන්ද්‍රයා සහ සූර්යයා යන දෙදෙනා ම සුන්දර ලෙස දැකිය හැකි ය. ඔවුන් යම්තාක් දුරක් දක්වා ආලෝකවත් කරමින් ගමන් කරන්නේ ද, අහසේ සැරිසරන ඔවුහු අඳුර දුරු කරමින් දිශා ආලෝකවත් කරමින් බබළති.\n\nඒ සීමාව තුළ ඇති යම් ධනයක් වේ ද: මුතු, මැණික්, සුන්දර වෛදූර්යය, (ශිංගි) ශුද්ධ වූ රත්රන් හෝ යම් රන්වන් වස්තුවක් (කාංචන) වේ ද, යම් හටක නම් වූ ජාත රූපයක් (ස්වභාවික රත්‍රන්) වේ ද;\n\nඒ සියල්ල, චන්ද්‍ර ප්‍රභාව සහ සියලු තාරකා සමූහය ද, අෂ්ටාංගයෙන් යුතු උපෝසථ ශීලයේ සොළොස් කලාවෙන් එක කලාවකටවත් සමාන නොවේ.\n\nඑහෙයින්, යහපත් ගති ඇති ස්ත්‍රිය හෝ පුරුෂයා හෝ අෂ්ටාංගයෙන් යුතු උපෝසථය සමාදන් විය යුතු ය. සැප ගෙන දෙන පින් රැස් කරගෙන, කිසිදු දෝෂයකට ලක් නොවී, සුගතිය නම් වූ ස්ථානයට (දිව්‍ය ලෝකයට) ඔවුහු පැමිණෙති.",
      "paliTitle": "Uposathasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Mahāvaggo sattamo. Tassuddānaṃ – Titthabhayañca venāgo, sarabho kesamuttiyā; Sāḷho cāpi kathāvatthu, titthiyamūluposathoti.",
    "english": "",
    "sinhala": ""
  }
}