{
  "id": "an3.6",
  "title": {
    "pali": "Dutiyapaṇṇāsakaṃ - Brāhmaṇavaggo",
    "english": "The Second Fifties – The Chapter on Brahmins.",
    "sinhala": "දෙවෙනි පණ්ණාසකය - බ්‍රාහ්මණවග්ගය"
  },
  "sections": [
    {
      "number": 52,
      "pali": "Atha kho dve brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavatā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te brāhmaṇā bhagavantaṃ etadavocuṃ – ‘‘mayamassu, bho gotama, brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te camhā akatakalyāṇā akatakusalā akatabhīruttāṇā. Ovadatu no bhavaṃ gotamo, anusāsatu no bhavaṃ gotamo yaṃ amhākaṃ assa dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Taggha tumhe, brāhmaṇā, jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te cattha akatakalyāṇā akatakusalā akatabhīruttāṇā. Upanīyati kho ayaṃ, brāhmaṇā, loko jarāya byādhinā maraṇena. Evaṃ upanīyamāne kho, brāhmaṇā, loke jarāya byādhinā maraṇena, yo idha kāyena saṃyamo vācāya saṃyamo manasā saṃyamo, taṃ tassa petassa tāṇañca leṇañca dīpañca saraṇañca parāyaṇañcā’’ti. ‘‘Upanīyati jīvitamappamāyu, Jarūpanītassa na santi tāṇā; Etaṃ bhayaṃ maraṇe pekkhamāno, Puññāni kayirātha sukhāvahāni. ‘‘Yodha kāyena saṃyamo, vācāya uda cetasā; Taṃ tassa petassa sukhāya hoti, Yaṃ jīvamāno pakaroti puñña’’nti. [saṃ. ni. 1.100] paṭhamaṃ;",
      "english": "Now then, two brahmins, old, aged, advanced in years, having traveled far and reached the end of their years, a hundred and twenty years old by birth, approached where the Blessed One was. Having approached, they exchanged greetings with the Blessed One. Having concluded a courteous and amiable conversation, they sat down to one side.\n\nSeated to one side, those brahmins then said this to the Blessed One: \"Good sir Gotama, we are indeed brahmins, old, aged, advanced in years, having traveled far and reached the end of our years, a hundred and twenty years old by birth. But we have not done what is noble, we have not done what is wholesome, we have not made for ourselves a protection from danger. Let good sir Gotama instruct us, let good sir Gotama admonish us, that which would be for our long-term welfare and happiness.\" \"Indeed, brahmins, you are old, aged, advanced in years, having traveled far and reached the end of your years, a hundred and twenty years old by birth. And yet you have not done what is noble, have not done what is wholesome, have not made for yourselves a protection from danger. Indeed, brahmins, this world is drawn onwards by old age, by sickness, by death. Indeed, brahmins, when the world is thus drawn onwards by old age, by sickness, by death, that which here is restraint in body, restraint in speech, and restraint in mind, that, for the one who has passed away, is a protection, a shelter, an island, a refuge, and a final resort.\"\n\n\"Life is drawn onwards, with little lifespan. For one led on by old age, there are no protections. Observing this danger in death, one should do wholesome deeds that bring happiness.\n\n\"That which here is restraint in body, or in speech, or in mind, that, for the one who has passed away, is for happiness; that which, while living, one performs as wholesome deeds.\"",
      "sinhala": "ඉන්පසු ඉතාම මහලු, වියපත් වූ, ජීවිතයේ අවසන් භාගයට පැමිණි, වයස අවුරුදු එකසිය විස්සක් වූ බමුණන් දෙදෙනෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු සාමිචියෙහි යෙදුණාහ. සුහද කථා බස් හුවමාරු කරගෙන එක් පසෙක වාඩි වූහ.\n\nඑක් පසෙක වාඩි වී සිටි ඒ බමුණෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ – “භවත් ගෞතමයින් වහන්ස, අපි ඉතාම මහලු වූ, වියපත් වූ, ජීවිතයේ අවසන් භාගයට පැමිණි, වයස අවුරුදු එකසිය විස්සක් වූ බමුණෝ වෙමු. ඒ අපි මෙතෙක් කිසිදු යහපත් ක්‍රියාවක් හෝ කුසලයක් නොකළ, සසර බියෙන් ආරක්‍ෂා වන පිහිටක් හෝ රැකවරණයක් නොසපයාගත් පිරිසක් වෙමු. භවත් ගෞතමයින් වහන්ස, අපට බොහෝ කලක් හිතසුව පිණිස වන පරිදි අවවාද කළ මැනව, අනුශාසනා කළ මැනව.”\n\n“බමුණෙනි, සැබවින්ම නුඹලා ඉතාම මහලු වූ, වියපත් වූ, ජීවිතයේ අවසන් භාගයට පැමිණි, වයස අවුරුදු එකසිය විස්සක් වූ පිරිසක් වෙති. තවද, ඒ නුඹලා කිසිදු යහපත් ක්‍රියාවක් හෝ කුසලයක් නොකළ, සසර බියෙන් ආරක්‍ෂා වන පිහිටක් හෝ රැකවරණයක් නොසපයාගත් පිරිසක් වෙති. බමුණෙනි, සැබවින්ම මේ ලෝකය ජරාවෙන්ද, ව්‍යාධියෙන්ද, මරණයෙන්ද නිරන්තරයෙන් වෙලා ගනු ලබයි. බමුණෙනි, මෙසේ ලෝකය ජරාවෙන්ද, ව්‍යාධියෙන්ද, මරණයෙන්ද නිරන්තරයෙන් වෙලා ගනු ලබද්දී, මේ ලෝකයෙහි යම් කෙනෙක් කයින් සංවර වී, වචනයෙන් සංවර වී, සිතින් සංවර වන්නේද, එය පරලෝකයට යන ඒ පුද්ගලයාට පිහිටක්ද, රැකවරණයක්ද, පහන් ආලෝකයක්ද, සරණක්ද, පරම ගතියක්ද වන්නේය.”\n\n“ජීවිතය කෙටි වන අතර, ආයුෂයද ගෙවී යයි.\nජරාවෙන් වෙලී සිටින්නන්ට පිහිටක් නැත;\nමරණයෙහි ඇති මේ භයානක ස්වභාවය දකිමින්,\nසැප ගෙන දෙන්නා වූ පින්කම් කළ යුතුය.\n\nමේ ලෝකයෙහි යම් කෙනෙක් කයින්, වචනයෙන් හෝ සිතින් සංවර වේද;\nජීවත්ව සිටියදීම යම් කුසලයක් කරන්නේද,\nඑය පරලෝකයට යන ඒ පුද්ගලයාට සැප පිණිස වන්නේය.”",
      "paliTitle": "Paṭhamadvebrāhmaṇasuttaṃ",
      "englishTitle": "The First Discourse on Two Brahmins",
      "sinhalaTitle": "පළමු ද්වේබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 53,
      "pali": "Atha kho dve brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te brāhmaṇā bhagavantaṃ etadavocuṃ – ‘‘mayamassu, bho gotama, brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te camhā akatakalyāṇā akatakusalā akatabhīruttāṇā. Ovadatu no bhavaṃ gotamo, anusāsatu no bhavaṃ gotamo yaṃ amhākaṃ assa dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Taggha tumhe, brāhmaṇā, jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te cattha akatakalyāṇā akatakusalā akatabhīruttāṇā. Āditto kho ayaṃ, brāhmaṇā, loko jarāya byādhinā maraṇena. Evaṃ āditte kho, brāhmaṇā, loke jarāya byādhinā maraṇena, yo idha kāyena saṃyamo vācāya saṃyamo manasā saṃyamo, taṃ tassa petassa tāṇañca leṇañca dīpañca saraṇañca parāyaṇañcā’’ti. ‘‘Ādittasmiṃ agārasmiṃ, yaṃ nīharati bhājanaṃ; Taṃ tassa hoti atthāya, no ca yaṃ tattha ḍayhati. ‘‘Evaṃ āditto kho [evaṃ ādīvito (sī. pī.), evaṃ ādittako (syā. kaṃ.) saṃ. ni. 1.41] loko, jarāya maraṇena ca; Nīharetheva dānena, dinnaṃ hoti sunīhataṃ [sunibbhataṃ (ka.)]. ‘‘Yodha kāyena saṃyamo, vācāya uda cetasā; Taṃ tassa petassa sukhāya hoti, Yaṃ jīvamāno pakaroti puñña’’nti. dutiyaṃ;",
      "english": "Then, two brahmins, aged, old, advanced in years, having reached the end of their lifespan, having attained old age, a hundred and twenty years old by birth, approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side.\n\nSeated to one side, those brahmins said this to the Blessed One: \"We, Venerable Gotama, are brahmins, aged, old, advanced in years, having reached the end of our lifespan, having attained old age, a hundred and twenty years old by birth. And we have not done what is wholesome, not done what is skillful, not created a refuge from fear. May Venerable Gotama advise us, may Venerable Gotama instruct us, for our long-term welfare and happiness.\"\n\n\"Indeed, brahmins, you are aged, old, advanced in years, having reached the end of your lifespan, having attained old age, a hundred and twenty years old by birth. And you have not done what is wholesome, not done what is skillful, not created a refuge from fear. This world, brahmins, is aflame with aging, sickness, and death. When the world is thus aflame, brahmins, with aging, sickness, and death, whoever here has self-restraint in body, self-restraint in speech, self-restraint in mind, for that departed one, this serves as protection, shelter, an island, a refuge, and a final resort.\"\n\n\"When a house is ablaze,\nWhatever vessel one carries out,\nThat is of benefit to them,\nNot what burns up inside.\n\nSimilarly, this world is aflame\nWith aging and death.\nOne should carry out (valuables) through generosity,\nWhat is given is well carried out.\n\nWhoever here has self-restraint in body,\nOr in speech, or in mind—\nThat is for the happiness of that departed one,\nWhatever merit one performs while alive.\"",
      "sinhala": "ඉන්පසු මහලු වූ, වයසට ගිය, ප්‍රවෘද්ධ වූ, ආයුෂය ගෙවී ගිය, වයසට පැමිණි, උපතින් සියවස ඉක්මවූ බමුණන් දෙදෙනෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ බමුණෝ භාග්‍යවතුන් වහන්සේට මෙය කීහ: ‘‘භවත් ගෞතමයන් වහන්ස, අපි බමුණෝ මහලු වූ, වයසට ගිය, ප්‍රවෘද්ධ වූ, ආයුෂය ගෙවී ගිය, වයසට පැමිණි, උපතින් සියවස ඉක්මවූ අය වෙමු. එහෙත් අපි යහපත් ක්‍රියා නොකළ, කුසල් දහම් නොකළ, භයෙන් මිදීමට පිණිස රැකවරණයක් නොකළ අය වෙමු. භවත් ගෞතමයන් වහන්සේ අපට අවවාද දෙන සේක්වා, භවත් ගෞතමයන් වහන්සේ අපට අනුශාසනා දෙන සේක්වා. ඒ අනුශාසනා අපට දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේ ය.’’\n\n‘‘බමුණෙනි, නියත වශයෙන් ම ඔබලා මහලු වූ, වයසට ගිය, ප්‍රවෘද්ධ වූ, ආයුෂය ගෙවී ගිය, වයසට පැමිණි, උපතින් සියවස ඉක්මවූ අය වෙති. එහෙත් ඔබලා යහපත් ක්‍රියා නොකළ, කුසල් දහම් නොකළ, භයෙන් මිදීමට පිණිස රැකවරණයක් නොකළ අය වෙති. බමුණෙනි, මේ ලෝකය ජරාවෙන්, ව්‍යාධියෙන්, මරණයෙන් දැවෙන්නේ ය. බමුණෙනි, මෙසේ ජරාවෙන්, ව්‍යාධියෙන්, මරණයෙන් දැවෙන ලෝකයේ, යමෙක් මේ සස්නෙහි කයින් සංයමයත්, වචනයෙන් සංයමයත්, සිතින් සංයමයත් පුරුදු කරයි ද, එය ඔහුට පරලොවදී රැකවරණය ද, පිහිට ද, ආලෝකය ද, සරණය ද, පරම පිහිට ද වන්නේ ය.’’\n\n‘‘දැවෙන ගෙයක, යම් භාජනයක් පිටතට ගනී ද, එය ඔහුට ප්‍රයෝජනවත් වේ. එතැනදී දැවෙන දේ ප්‍රයෝජනවත් නොවේ.\n\nමෙලෙස ම මේ ලෝකය ජරාවෙන් හා මරණයෙන් දැවෙන්නේ ය. දානයෙන් ම එය (තමාට වටිනා දේ) පිටතට ගන්නේ ය. දෙන ලද දේ මනා කොට තැන්පත් කරනු ලැබේ.\n\nයමෙක් මෙලොව කයින් සංයමයත්, වචනයෙන් හෝ සිතින් සංයමයත් පුරුදු කරයි ද, ජීවත්ව සිටියදී ඔහු කරන ඒ පින ම ඔහුට පරලොවදී සුව පිණිස වේ.",
      "paliTitle": "Dutiyadvebrāhmaṇasuttaṃ",
      "englishTitle": "Second Sutta with Two Brahmins",
      "sinhalaTitle": "දුතිය ද්වෙබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 54,
      "pali": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi…pe… ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhiko dhammo sandiṭṭhiko dhammo’ti, bho gotama, vuccati. Kittāvatā nu kho, bho gotama, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko [opanayiko (sī. syā. kaṃ. pī.) pañcamasuttassa ṭīkā oloketabbā] paccattaṃ veditabbo viññūhī’’ti? ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. (Ratto kho…pe… kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. Rāge pahīnā neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Ratto kho…pe… attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti. Rāge pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti.) [( ) etthantare pāṭho sī. syā. kaṃ. pī. potthakesu na dissati, idhapi duṭṭhamūḷhavāresu] Evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti…pe…. ‘‘Duṭṭho kho, brāhmaṇa, dosena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Dose pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikampi [na cetasikaṃ (sī. syā. ka.)] dukkhaṃ domanassaṃ paṭisaṃvedeti. Evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti…pe…. ‘‘Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Evaṃ kho, brāhmaṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Tatiyaṃ.",
      "english": "Then a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. When the polite and friendly talk was concluded, he sat down to one side and said to the Blessed One:\n\n\"It is said, Master Gotama, 'The Dhamma is directly verifiable; the Dhamma is directly verifiable.' To what extent, Master Gotama, is the Dhamma directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise?\"\n\n\"Brahmin, one who is affected by lust, overcome by passion, with mind obsessed, contemplates harm to oneself, contemplates harm to others, contemplates harm to both, and experiences mental suffering and distress. When passion is abandoned, one does not contemplate harm to oneself, does not contemplate harm to others, does not contemplate harm to both, and does not experience mental suffering or distress. Thus, brahmin, the Dhamma is directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise.\"\n\n\"Brahmin, one who is affected by aversion, overcome by hatred, with mind obsessed, contemplates harm to oneself, contemplates harm to others, contemplates harm to both, and experiences mental suffering and distress. When hatred is abandoned, one does not contemplate harm to oneself, does not contemplate harm to others, does not contemplate harm to both, and does not experience mental suffering or distress. Thus, brahmin, the Dhamma is directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise.\"\n\n\"Brahmin, one who is affected by delusion, overcome by ignorance, with mind obsessed, contemplates harm to oneself, contemplates harm to others, contemplates harm to both, and experiences mental suffering and distress. When delusion is abandoned, one does not contemplate harm to oneself, does not contemplate harm to others, does not contemplate harm to both, and does not experience mental suffering or distress. In this way, brahmin, the Dhamma is directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise.\"\n\n\"Excellent, Master Gotama! Excellent, Master Gotama! Just as, Master Gotama, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or carry an oil lamp in the darkness so that those with eyes might see forms; in the same way, the Dhamma has been made clear by Master Gotama in manifold ways. I go for refuge to Master Gotama, and to the Dhamma, and to the Sangha of monastics. May Master Gotama remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "එවිට එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. ආදරයෙන් කතා බස් කොට, එක් පසෙක වාඩි වූ ඒ බ්‍රාහ්මණයෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: ‘‘‘ධර්මය මේ ආත්මභාවයේදීම පල දෙන සුළුය, ධර්මය මේ ආත්මභාවයේදීම පල දෙන සුළුය’ යැයි, භවත් ගෞතමයන් වහන්ස, කියනු ලැබේ. භවත් ගෞතමයන් වහන්ස, කොපමණකින්ද මේ ධර්මය තමා විසින්ම දැකිය හැකි (සන්දිඨ්ඨික), කල් නොයවා පලදෙන (අකාලික), ‘එව බලව’ යැයි ආරාධනා කළ හැකි (ඒහිපස්සික), නිවනට මඟ පෙන්වන (ඕපනයික), ප්‍රඥාවන්තයින් විසින් තම තමා තුළින්ම අත්දැකිය හැකි (පච්චත්තං වේදිතබ්බ) ධර්මයක් වන්නේ?’’\n\n‘‘බ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ සිතක් ඇති පුද්ගලයා තමාටත් විපත් පමුණුවීමට සිතයි, අනුන්ටත් විපත් පමුණුවීමට සිතයි, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතයි, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳියි. රාගය ප්‍රහීණ වූ විට තමාටත් විපත් පමුණුවීමට සිතන්නේ නැත, අනුන්ටත් විපත් පමුණුවීමට සිතන්නේ නැත, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතන්නේ නැත, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳින්නේ නැත. බ්‍රාහ්මණය, මෙසේද මේ ධර්මය තමා විසින්ම දැකිය හැකි ධර්මයක් වන්නේය… (ආදී වශයෙන්).’’\n\n‘‘බ්‍රාහ්මණය, ද්වේෂයෙන් මත් වූ, ද්වේෂයෙන් යටපත් වූ සිතක් ඇති පුද්ගලයා තමාටත් විපත් පමුණුවීමට සිතයි, අනුන්ටත් විපත් පමුණුවීමට සිතයි, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතයි, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳියි. ද්වේෂය ප්‍රහීණ වූ විට තමාටත් විපත් පමුණුවීමට සිතන්නේ නැත, අනුන්ටත් විපත් පමුණුවීමට සිතන්නේ නැත, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතන්නේ නැත, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳින්නේ නැත. බ්‍රාහ්මණය, මෙසේද මේ ධර්මය තමා විසින්ම දැකිය හැකි ධර්මයක් වන්නේය… (ආදී වශයෙන්).’’\n\n‘‘බ්‍රාහ්මණය, මෝහයෙන් මත් වූ, මෝහයෙන් යටපත් වූ සිතක් ඇති පුද්ගලයා තමාටත් විපත් පමුණුවීමට සිතයි, අනුන්ටත් විපත් පමුණුවීමට සිතයි, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතයි, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳියි. මෝහය ප්‍රහීණ වූ විට තමාටත් විපත් පමුණුවීමට සිතන්නේ නැත, අනුන්ටත් විපත් පමුණුවීමට සිතන්නේ නැත, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතන්නේ නැත, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳින්නේ නැත. බ්‍රාහ්මණය, මෙසේ මේ ධර්මය තමා විසින්ම දැකිය හැකි (සන්දිඨ්ඨික), කල් නොයවා පලදෙන (අකාලික), ‘එව බලව’ යැයි ආරාධනා කළ හැකි (ඒහිපස්සික), නිවනට මඟ පෙන්වන (ඕපනයික), ප්‍රඥාවන්තයින් විසින් තම තමා තුළින්ම අත්දැකිය හැකි (පච්චත්තං වේදිතබ්බ) ධර්මයක් වන්නේය.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, යමෙක් පෙරළා තිබූ දෙයක් නැවත පෙරළා තබන්නාක් මෙන් හෝ, වසා තිබූ දෙයක් විවෘත කරන්නාක් මෙන් හෝ, මඟ වැරදුණු අයෙකුට මඟ පෙන්වන්නාක් මෙන් හෝ, අඳුරෙහි තෙල් පහනක් දරන්නාක් මෙන් ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යැයි පවසන්නාක් මෙන් භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය දේශනා කරන ලදී. මම ඒ භවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Aññatarabrāhmaṇasuttaṃ",
      "englishTitle": "The Discourse to a Certain Brahmin",
      "sinhalaTitle": "අඤ්ඤතර බ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 55,
      "pali": "Atha kho aññataro brāhmaṇaparibbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe… ekamantaṃ nisinno kho so brāhmaṇaparibbājako bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhiko dhammo sandiṭṭhiko dhammo’ti, bho gotama, vuccati. Kittāvatā nu kho, bho gotama, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti? ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. Rāge pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti. Rāge pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti…pe…. ‘‘Duṭṭho kho, brāhmaṇa, dosena…pe… mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. ‘‘Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto, kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. Mohe pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. ‘‘Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti. Mohe pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Evaṃ kho, brāhmaṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Catutthaṃ.",
      "english": "Then a certain wandering ascetic of the Brāhmaṇa caste approached the Blessed One; having approached, exchanged greetings with the Blessed One, and having conversed in a friendly and courteous manner, sat down to one side. As he sat to one side, that wandering ascetic said to the Blessed One: \"The Dhamma is said to be 'directly visible, directly visible', good Master Gotama. To what extent, good Master Gotama, is the Dhamma directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves?\"\n\n\"Corrupted, Brāhmaṇa, by greed, one who is overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, intends harm to both, and experiences mental pain and distress. When greed is abandoned, one does not intend harm to oneself, does not intend harm to others, does not intend harm to both, and does not experience mental pain and distress.\n\nCorrupted, Brāhmaṇa, by greed, one who is overwhelmed and obsessed in mind, engages in misconduct by body, engages in misconduct by speech, engages in misconduct by mind. When greed is abandoned, one does not engage in misconduct by body, does not engage in misconduct by speech, and does not engage in misconduct by mind.\n\nCorrupted, Brāhmaṇa, by greed, one who is overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When greed is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. In this way, Brāhmaṇa, the Dhamma is directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves.\n\nCorrupted, Brāhmaṇa, by hatred, one who is overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, intends harm to both, and experiences mental pain and distress. When hatred is abandoned, one does not intend harm to oneself, does not intend harm to others, does not intend harm to both, and does not experience mental pain and distress.\n\nCorrupted, Brāhmaṇa, by hatred, one who is overwhelmed and obsessed in mind, engages in misconduct by body, engages in misconduct by speech, engages in misconduct by mind. When hatred is abandoned, one does not engage in misconduct by body, does not engage in misconduct by speech, and does not engage in misconduct by mind.\n\nCorrupted, Brāhmaṇa, by hatred, one who is overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When hatred is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. In this way, Brāhmaṇa, the Dhamma is directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves.\n\nCorrupted, Brāhmaṇa, by delusion, one who is overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, intends harm to both, and experiences mental pain and distress. When delusion is abandoned, one does not intend harm to oneself, does not intend harm to others, does not intend harm to both, and does not experience mental pain and distress.\n\nCorrupted, Brāhmaṇa, by delusion, one who is overwhelmed and obsessed in mind, engages in misconduct by body, engages in misconduct by speech, engages in misconduct by mind. When delusion is abandoned, one does not engage in misconduct by body, does not engage in misconduct by speech, and does not engage in misconduct by mind.\n\nCorrupted, Brāhmaṇa, by delusion, one who is overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When delusion is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. In this way, Brāhmaṇa, the Dhamma is directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves.\"\n\n\"Excellent, good Master Gotama! Excellent! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes could see forms – in the same way has Master Gotama made the Dhamma clear in many ways. May Master Gotama remember me as a lay follower who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "එකල්හි එක්තරා බ්‍රාහ්මණ පරිබ්‍රාජකයෙක් භාග්‍ය\\u200Dවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ එක්පසෙක වාඩි වී භාග්‍ය\\u200Dවතුන් වහන්සේට මෙය පැවසුවේය: \"භවත් ගෞතමයන් වහන්ස, 'මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමානයි, මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමානයි' යැයි කියනු ලැබේ. භවත් ගෞතමයන් වහන්ස, කෙතරම් අයුරකින්ද මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමාන, කාලයට අයත් නොවූ, 'එන්න, බලන්න' යැයි ආරාධනා කළ හැකි, නිවන් මගට යොමුකරවන, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කළ යුතු වන්නේ?\"\n\n\"බ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාට හිංසා කිරීම පිණිසද සිතයි, අනුන්ට හිංසා කිරීම පිණිසද සිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද සිතයි, මානසික දුක්ඛයද, දොම්නසද විඳියි. රාගය ප්‍ර\\u200Dහීණ වූ විට තමාට හිංසා කිරීම පිණිසද නොසිතයි, අනුන්ට හිංසා කිරීම පිණිසද නොසිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද නොසිතයි, මානසික දුක්ඛයද, දොම්නසද නොවිඳියි.\nබ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. රාගය ප්‍ර\\u200Dහීණ වූ විට කයින් දුසිරිත් නොකරයි, වචනයෙන් දුසිරිත් නොකරයි, සිතින් දුසිරිත් නොකරයි.\nබ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාගේ යහපතද ඇති සැටියෙන් නොදෙකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් නොදෙකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් නොදෙකියි. රාගය ප්‍ර\\u200Dහීණ වූ විට තමාගේ යහපතද ඇති සැටියෙන් දකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් දකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් දකියි. බ්‍රාහ්මණය, මෙලෙසින්ද මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමාන, කාලයට අයත් නොවූ, 'එන්න, බලන්න' යැයි ආරාධනා කළ හැකි, නිවන් මගට යොමුකරවන, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කළ යුතු වන්නේය.\n\nබ්‍රාහ්මණය, ද්වේෂයෙන් දූෂිත වූ පුද්ගලයාද... බ්‍රාහ්මණය, මෝහයෙන් මුළා වූ, මෝහයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාට හිංසා කිරීම පිණිසද සිතයි, අනුන්ට හිංසා කිරීම පිණිසද සිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද සිතයි, මානසික දුක්ඛයද, දොම්නසද විඳියි. මෝහය ප්‍ර\\u200Dහීණ වූ විට තමාට හිංසා කිරීම පිණිසද නොසිතයි, අනුන්ට හිංසා කිරීම පිණිසද නොසිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද නොසිතයි, මානසික දුක්ඛයද, දොම්නසද නොවිඳියි.\nබ්‍රාහ්මණය, මෝහයෙන් මුළා වූ, මෝහයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. මෝහය ප්‍ර\\u200Dහීණ වූ විට කයින් දුසිරිත් නොකරයි, වචනයෙන් දුසිරිත් නොකරයි, සිතින් දුසිරිත් නොකරයි.\nබ්‍රාහ්මණය, මෝහයෙන් මුළා වූ, මෝහයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාගේ යහපතද ඇති සැටියෙන් නොදෙකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් නොදෙකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් නොදෙකියි. මෝහය ප්‍ර\\u200Dහීණ වූ විට තමාගේ යහපතද ඇති සැටියෙන් දකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් දකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් දකියි. බ්‍රාහ්මණය, මෙලෙසින්ම මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමාන, කාලයට අයත් නොවූ, 'එන්න, බලන්න' යැයි ආරාධනා කළ හැකි, නිවන් මගට යොමුකරවන, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කළ යුතු වන්නේය.\"\n\n\"භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! යටිකුරු කළ දෙයක් උඩුකුරු කරන්නාක් මෙන්ද, වසා තැබූ දෙයක් විවෘත කරන්නාක් මෙන්ද, මංමුළා වූවෙකුට මග පෙන්වන්නාක් මෙන්ද, අන්ධකාරයේ තෙල් පහනක් දරන්නාක් මෙන්ද, ඇස් ඇත්තෝ රූප දකිනවා යැයි කියන්නාක් මෙන්ද, භාග්‍ය\\u200Dවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්ම\\u200Dය ප්‍ර\\u200Dකාශ කරන ලදී. භවත් ගෞතමයන් වහන්ස, මම භාග්‍ය\\u200Dවතුන් වහන්සේද, ධර්ම\\u200Dයද, සංඝයාද සරණ යමි. අද පටන් දිවි තිබෙන තුරා සරණ ගිය උපාසකයෙකු ලෙස මා භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Paribbājakasuttaṃ",
      "englishTitle": "The Wanderers Sutta",
      "sinhalaTitle": "පරිබ්බාජක සූත්‍රය"
    },
    {
      "number": 56,
      "pali": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhikaṃ nibbānaṃ sandiṭṭhikaṃ nibbāna’nti, bho gotama, vuccati. Kittāvatā nu kho, bho gotama, sandiṭṭhikaṃ nibbānaṃ hoti akālikaṃ ehipassikaṃ opaneyyikaṃ paccattaṃ veditabbaṃ viññūhī’’ti? ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Evampi kho, brāhmaṇa, sandiṭṭhikaṃ nibbānaṃ hoti. ‘‘Duṭṭho kho, brāhmaṇa…pe… mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Evampi kho, brāhmaṇa, sandiṭṭhikaṃ nibbānaṃ hoti. ‘‘Yato kho ayaṃ, brāhmaṇa [yato ca kho ayaṃ brāhmaṇa (sī.), yato kho brāhmaṇa akālikaṃ ehipassikaṃ opaneyyikaṃ paccattaṃ veditabbaṃ (ka.)], anavasesaṃ rāgakkhayaṃ paṭisaṃvedeti, anavasesaṃ dosakkhayaṃ paṭisaṃvedeti, anavasesaṃ mohakkhayaṃ paṭisaṃvedeti; evaṃ kho, brāhmaṇa, sandiṭṭhikaṃ nibbānaṃ hoti akālikaṃ ehipassikaṃ opaneyyikaṃ paccattaṃ veditabbaṃ viññūhī’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ.",
      "english": "Then the brahmin Jāṇussoṇi approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, the brahmin Jāṇussoṇi said to the Blessed One: \"It is said, Master Gotama, 'Nibbāna visible in this very life, Nibbāna visible in this very life.' To what extent, Master Gotama, is Nibbāna visible in this very life, immediate, inviting verification, leading inwards, to be known individually by the wise?\"\n\n\"Indeed, brahmin, one who is obsessed with lust, whose mind is overwhelmed and consumed by lust, thinks of harming himself, thinks of harming others, thinks of harming both, and experiences mental suffering and distress. When lust is abandoned, he does not think of harming himself, nor of harming others, nor of harming both, nor does he experience mental suffering and distress. Thus, brahmin, is Nibbāna visible in this very life.\"\n\n\"Indeed, brahmin, one who is filled with hatred, whose mind is overwhelmed and consumed by hatred, thinks of harming himself, thinks of harming others, thinks of harming both, and experiences mental suffering and distress. When hatred is abandoned, he does not think of harming himself, nor of harming others, nor of harming both, nor does he experience mental suffering and distress. Thus, brahmin, is Nibbāna visible in this very life. Indeed, brahmin, one who is deluded, whose mind is overwhelmed and consumed by delusion, thinks of harming himself, thinks of harming others, of harming both, and experiences mental suffering and distress. When delusion is abandoned, he does not think of harming himself, nor of harming others, nor of harming both, nor does he experience mental suffering and distress. Thus, brahmin, is Nibbāna visible in this very life.\"\n\n\"When, brahmin, one experiences the complete eradication of lust, the complete eradication of hatred, and the complete eradication of delusion, without remainder; in this way, brahmin, Nibbāna is visible in this very life, immediate, inviting verification, leading inwards, to be known individually by the wise.\"\n\n\"Excellent, Master Gotama! Excellent! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to bring a lamp into the darkness for those with eyes to see forms – even so has Master Gotama made the Dhamma clear in many ways. I go for refuge to Master Gotama, to the Dhamma, and to the Sangha of monks. Let Master Gotama remember me as a lay follower who has taken refuge from this day forward as long as life lasts.\"",
      "sinhala": "එවිට ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘භවත් ගෞතමයන් වහන්ස, ‘මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය, මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය’ යැයි කියනු ලැබේ. භවත් ගෞතමයන් වහන්ස, කොපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය කාලයක් නොයවාම, ‘එන්න, බලන්න’ යැයි පෙන්විය හැකි, තමා වෙතට කැඳවා ගත හැකි, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැකිය හැකි නිර්වාණයක් වන්නේ?’’\n\n‘‘බ්‍රාහ්මණය, රාගයෙන් පෙලී, රාගයෙන් යටපත් වී, සිත මුලාවට පත් වූ තැනැත්තා තමාටද පීඩා කිරීමට සිතයි, අනුන්ටද පීඩා කිරීමට සිතයි, තමාටත් අනුන්ටත් දෙපිරිසටම පීඩා කිරීමට සිතයි, මානසික දුකක් හා දොම්නසක් අත්විඳියි. රාගය ප්‍‍රහීණ කළ කල්හි ඔහු තමාට පීඩා කිරීමට නොසිතයි, අනුන්ට පීඩා කිරීමට නොසිතයි, දෙපිරිසටම පීඩා කිරීමට නොසිතයි, මානසික දුකක් හා දොම්නසක් අත්නොවිඳියි. බ්‍රාහ්මණය, මෙපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය වන්නේය.\n\nදෝසයෙන් පෙලී, දෝසයෙන් යටපත් වී, සිත මුලාවට පත් වූ තැනැත්තා තමාටද පීඩා කිරීමට සිතයි, අනුන්ටද පීඩා කිරීමට සිතයි, තමාටත් අනුන්ටත් දෙපිරිසටම පීඩා කිරීමට සිතයි, මානසික දුකක් හා දොම්නසක් අත්විඳියි. දෝසය ප්‍‍රහීණ කළ කල්හි ඔහු තමාට පීඩා කිරීමට නොසිතයි, අනුන්ට පීඩා කිරීමට නොසිතයි, දෙපිරිසටම පීඩා කිරීමට නොසිතයි, මානසික දුකක් හා දොම්නසක් අත්නොවිඳියි. බ්‍රාහ්මණය, මෙපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය වන්නේය.\n\nමෝහයෙන් පෙලී, මෝහයෙන් යටපත් වී, සිත මුලාවට පත් වූ තැනැත්තා තමාටද පීඩා කිරීමට සිතයි, අනුන්ටද පීඩා කිරීමට සිතයි, තමාටත් අනුන්ටත් දෙපිරිසටම පීඩා කිරීමට සිතයි, මානසික දුකක් හා දොම්නසක් අත්විඳියි. මෝහය ප්‍‍රහීණ කළ කල්හි ඔහු තමාට පීඩා කිරීමට නොසිතයි, අනුන්ට පීඩා කිරීමට නොසිතයි, දෙපිරිසටම පීඩා කිරීමට නොසිතයි, මානසික දුකක් හා දොම්නසක් අත්නොවිඳියි. බ්‍රාහ්මණය, මෙපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය වන්නේය.\n\n‘‘බ්‍රාහ්මණය, යම් හෙයකින් යම් පුද්ගලයෙක් ඉතිරි නොකොට රාගයේ ක්ෂයවීම අත්විඳින්නේද, ඉතිරි නොකොට දෝසයේ ක්ෂයවීම අත්විඳින්නේද, ඉතිරි නොකොට මෝහයේ ක්ෂයවීම අත්විඳින්නේද; බ්‍රාහ්මණය, මෙපමණකින් මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය, කාලයක් නොයවාම, ‘එන්න, බලන්න’ යැයි පෙන්විය හැකි, තමා වෙතට කැඳවා ගත හැකි, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැකිය හැකි නිර්වාණයක් වන්නේය’’යි වදාළ සේක.\n\n‘‘භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා සලකන සේක්වා!’’",
      "paliTitle": "Nibbutasuttaṃ",
      "englishTitle": "Extinguished Sutta",
      "sinhalaTitle": "නිබ්බුත සූත්‍රය"
    },
    {
      "number": 57,
      "pali": "Atha kho aññataro brāhmaṇamahāsālo yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho so brāhmaṇamahāsālo bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama, pubbakānaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘pubbe sudaṃ [pubbassudaṃ (sī. syā. kaṃ. pī.)] ayaṃ loko avīci maññe phuṭo ahosi manussehi, kukkuṭasaṃpātikā gāmanigamarājadhāniyo’ti. Ko nu kho, bho gotama, hetu ko paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā hontī’’ti? ‘‘Etarahi, brāhmaṇa, manussā adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā. Te adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā tiṇhāni satthāni gahetvā aññamaññaṃ [aññamaññassa (sabbattha)] jīvitā voropenti, tena bahū manussā kālaṃ karonti. Ayampi kho, brāhmaṇa, hetu ayaṃ paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā honti. ‘‘Puna caparaṃ, brāhmaṇa, etarahi manussā adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā. Tesaṃ adhammarāgarattānaṃ visamalobhābhibhūtānaṃ micchādhammaparetānaṃ devo na sammādhāraṃ anuppavecchati. Tena dubbhikkhaṃ hoti dussassaṃ setaṭṭhikaṃ salākāvuttaṃ. Tena bahū manussā kālaṃ karonti. Ayampi kho, brāhmaṇa, hetu ayaṃ paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā honti. ‘‘Puna caparaṃ, brāhmaṇa, etarahi manussā adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā. Tesaṃ adhammarāgarattānaṃ visamalobhābhibhūtānaṃ micchādhammaparetānaṃ yakkhā vāḷe amanusse ossajjanti [ossajanti (sī.)], tena bahū manussā kālaṃ karonti. Ayampi kho, brāhmaṇa, hetu ayaṃ paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā hontī’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Chaṭṭhaṃ.",
      "english": "Then a certain wealthy Brahmin approached the Blessed One, exchanged greetings with him, and having sat down to one side, that wealthy Brahmin said to the Blessed One: \"I have heard this, Venerable Gotama, from the elder, aged Brahmins, my teachers and teachers' teachers, speaking thus: 'Indeed, in former times, this world was, as it were, teeming with people, packed like a chicken run with villages, towns, and royal capitals.' But what, Venerable Gotama, is the cause, what is the reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied?\"\n\n\"Nowadays, Brahmin, people are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states. Those who are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states, take sharp weapons and deprive one another of life; by this, many people die. This, too, Brahmin, is a cause, this is a reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied.\n\n\"Furthermore, Brahmin, nowadays people are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states. Because they are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states, the sky does not send down rain at the proper time. Due to this, there is famine, poor harvest, withered crops, and crops destroyed by pests. By this, many people die. This, too, Brahmin, is a cause, this is a reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied.\n\n\"Furthermore, Brahmin, nowadays people are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states. Because they are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states, Yakkhas let loose fierce non-human beings upon them; by this, many people die. This, too, Brahmin, is a cause, this is a reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied.\"\n\n\"Excellent, Venerable Gotama! It is as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms. In the same way has the Venerable Gotama, in many ways, made the Dhamma clear. I go for refuge to the Venerable Gotama, to the Dhamma, and to the Saṅgha. May the Venerable Gotama remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "ඉන්පසු එක්තරා බ්‍රාහ්මණ මහසාලෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ ඒ බ්‍රාහ්මණ මහසාල තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: ‘‘භවත් ගෞතමයන් වහන්ස, පෙර විසූ, වෘද්ධ වූ, මහලු වූ, ආචාර්ය-ප්‍රාචාර්යවරුන් කියනවා මා අසා ඇත – ‘පෙර මේ ලෝකය මිනිසුන්ගෙන් අවීචියක් මෙන් පිරී තිබුණා. ගම්, නියම්ගම්, රාජධානි කුකුළු සාම්ප්‍රාප්තියක් මෙන් (මිනිසුන්ගෙන් ඝනව) විය’ කියා. භවත් ගෞතමයන් වහන්ස, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’’\n\n‘‘බ්‍රාහ්මණය, දැන් මිනිසුන් අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය වෙති. ඒ අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය තියුණු ආයුධ ගෙන එකිනෙකාගේ ජීවිත නැති කරති. එයින් බොහෝ මිනිසුන් මිය යති. බ්‍රාහ්මණය, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයද හේතුවක්, මෙයද ප්‍රත්‍යයක් වේ.\n\n‘‘තවද බ්‍රාහ්මණය, දැන් මිනිසුන් අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය වෙති. ඒ අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අයට දෙවියෝ (වර්ෂාව) මැනවින් වැසි නොදෙති. එයින් දුර්භික්ෂය (සාගතය) සිදු වේ. අස්වැන්න දුර්වල වී, ධාන්‍ය සුදු ඇට බවට පත්ව වියළී ගොස්, කෘමි හානිවලට ලක් වේ. එයින් බොහෝ මිනිසුන් මිය යති. බ්‍රාහ්මණය, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයද හේතුවක්, මෙයද ප්‍රත්‍යයක් වේ.\n\n‘‘තවද බ්‍රාහ්මණය, දැන් මිනිසුන් අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය වෙති. ඒ අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අයට යක්ෂයෝ දරුණු අමනුෂ්‍යයන් එලවති. එයින් බොහෝ මිනිසුන් මිය යති. බ්‍රාහ්මණය, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයද හේතුවක්, මෙයද ප්‍රත්‍යයක් වේ.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, අතිශයින්ම මැනවි! අතිශයින්ම මැනවි! යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මංමුලා වූවෙකුට මග පෙන්වන්නේද, අන්ධකාරයේ සිටින අයට තෙල් පහනක් දරන්නේද, එසේම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය දේශනා කරන ලදී. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය, මා උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Palokasuttaṃ",
      "englishTitle": "Disintegration Sutta",
      "sinhalaTitle": "පලෝක සූත්‍රය"
    },
    {
      "number": 58,
      "pali": "Atha kho vacchagotto [vacchaputto (ka.)] paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama, samaṇo gotamo evamāha – ‘mayhameva dānaṃ dātabbaṃ, nāññesaṃ dānaṃ dātabbaṃ; mayhameva sāvakānaṃ dānaṃ dātabbaṃ, nāññesaṃ sāvakānaṃ dānaṃ dātabbaṃ; mayhameva dinnaṃ mahapphalaṃ, nāññesaṃ dinnaṃ mahapphalaṃ; mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, nāññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti. Ye te, bho gotama, evamāhaṃsu ‘samaṇo gotamo evamāha mayhameva dānaṃ dātabbaṃ, nāññesaṃ dānaṃ dātabbaṃ. Mayhameva sāvakānaṃ dānaṃ dātabbaṃ, nāññesaṃ sāvakānaṃ dānaṃ dātabbaṃ. Mayhameva dinnaṃ mahapphalaṃ, nāññesaṃ dinnaṃ mahapphalaṃ. Mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, nāññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti. Kacci te bhoto gotamassa vuttavādino ca bhavantaṃ gotamaṃ abhūtena abbhācikkhanti, dhammassa cānudhammaṃ byākaronti, na ca koci sahadhammiko vādānupāto [vādānuvādo (ka.)] gārayhaṃ ṭhānaṃ āgacchati? Anabbhakkhātukāmā hi mayaṃ bhavantaṃ gotama’’nti. ‘‘Ye te, vaccha, evamāhaṃsu – ‘samaṇo gotamo evamāha – mayhameva dānaṃ dātabbaṃ…pe… nāññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti na me te vuttavādino. Abbhācikkhanti ca pana maṃ [ca pana maṃ te (sī. syā. kaṃ. pī.)] asatā abhūtena. Yo kho, vaccha, paraṃ dānaṃ dadantaṃ vāreti so tiṇṇaṃ antarāyakaro hoti, tiṇṇaṃ pāripanthiko. Katamesaṃ tiṇṇaṃ? Dāyakassa puññantarāyakaro hoti, paṭiggāhakānaṃ lābhantarāyakaro hoti, pubbeva kho panassa attā khato ca hoti upahato ca. Yo kho, vaccha, paraṃ dānaṃ dadantaṃ vāreti so imesaṃ tiṇṇaṃ antarāyakaro hoti, tiṇṇaṃ pāripanthiko. ‘‘Ahaṃ kho pana, vaccha, evaṃ vadāmi – ye hi te candanikāya vā oligalle vā pāṇā, tatrapi yo thālidhovanaṃ [thālakadhovanaṃ (ka.)] vā sarāvadhovanaṃ vā chaḍḍeti – ye tattha pāṇā te tena yāpentūti, tato nidānampāhaṃ, vaccha, puññassa āgamaṃ vadāmi. Ko pana vādo manussabhūte! Api cāhaṃ, vaccha, sīlavato dinnaṃ mahapphalaṃ vadāmi, no tathā dussīlassa, so ca hoti pañcaṅgavippahīno pañcaṅgasamannāgato. ‘‘Katamāni pañcaṅgāni pahīnāni honti? Kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Imāni pañcaṅgāni vippahīnāni honti. ‘‘Katamehi pañcahi aṅgehi samannāgato hoti? Asekkhena sīlakkhandhena samannāgato hoti, asekkhena samādhikkhandhena samannāgato hoti, asekkhena paññākkhandhena samannāgato hoti, asekkhena vimuttikkhandhena samannāgato hoti, asekkhena vimuttiñāṇadassanakkhandhena samannāgato hoti; imehi pañcahi aṅgehi samannāgato hoti. Iti pañcaṅgavippahīne pañcaṅgasamannāgate dinnaṃ mahapphalanti vadāmī’’ti. ‘‘Iti kaṇhāsu setāsu, rohiṇīsu harīsu vā; Kammāsāsu sarūpāsu, gosu pārevatāsu vā. ‘‘Yāsu kāsuci etāsu, danto jāyati puṅgavo; Dhorayho balasampanno, kalyāṇajavanikkamo; Tameva bhāre yuñjanti, nāssa vaṇṇaṃ parikkhare. ‘‘Evamevaṃ manussesu, yasmiṃ kasmiñci jātiye; Khattiye brāhmaṇe vesse, sudde caṇḍālapukkuse. ‘‘Yāsu kāsuci etāsu, danto jāyati subbato; Dhammaṭṭho sīlasampanno, saccavādī hirīmano. ‘‘Pahīnajātimaraṇo, brahmacariyassa kevalī; Pannabhāro visaṃyutto, katakicco anāsavo. ‘‘Pāragū sabbadhammānaṃ, anupādāya nibbuto; Tasmiṃyeva [tasmiṃ ve (syā. kaṃ.)] viraje khette, vipulā hoti dakkhiṇā. ‘‘Bālā ca avijānantā, dummedhā assutāvino; Bahiddhā denti dānāni, na hi sante upāsare. ‘‘Ye ca sante upāsanti, sappaññe dhīrasammate; Saddhā ca nesaṃ sugate, mūlajātā patiṭṭhitā. ‘‘Devalokañca te yanti, kule vā idha jāyare; Anupubbena nibbānaṃ, adhigacchanti paṇḍitā’’ti. sattamaṃ;",
      "english": "Then the wanderer Vacchagotta approached the Blessed One. Having approached, he exchanged friendly and courteous greetings with the Blessed One. When the amiable and memorable conversation was concluded, he sat down to one side.\n\nSitting to one side, the wanderer Vacchagotta said this to the Blessed One: “I have heard it said, Venerable Gotama, that the ascetic Gotama declares the following: ‘Alms should be given only to me, not to others. Alms should be given only to my disciples, not to the disciples of others. What is given to me yields great fruit, what is given to others does not yield great fruit. What is given to my disciples yields great fruit, what is given to the disciples of others does not yield great fruit.’\n\nVenerable Gotama, do those who say this—that the ascetic Gotama declares: ‘Alms should be given only to me... what is given to the disciples of others does not yield great fruit’—are they stating what has been said by the Venerable Gotama, or are they misrepresenting the Venerable Gotama with something false? Are they explaining the teaching (Dhamma) in accordance with the teaching, or is there some consequence of their statement, based on the Dhamma, that merits reproach? For we do not wish to misrepresent the Venerable Gotama.”\n\n“Vacchagotta, those who say that the ascetic Gotama declares: ‘Alms should be given only to me... what is given to the disciples of others does not yield great fruit’—they are not stating what I have said. They are misrepresenting me with what is unreal and false.\n\nIndeed, Vacchagotta, whoever obstructs another person who is giving alms becomes an obstacle and opponent to three things. Which three? He becomes an obstacle to the merit of the donor; he becomes an obstacle to the gain of the recipients; and, furthermore, his own self is previously injured and harmed. Whoever, Vacchagotta, obstructs another person who is giving alms becomes an obstacle and opponent to these three things.\n\nFurthermore, Vacchagotta, I declare this: Even if creatures reside in a ditch or a puddle, if someone throws away water used to wash a pot or a bowl—thinking, ‘May the creatures there sustain themselves with this’—even from that source, Vacchagotta, I declare the influx of merit. How much more so when dealing with human beings!\n\nNevertheless, Vacchagotta, I declare that giving to a virtuous person yields great fruit, but not so much when giving to an immoral person. And that virtuous person is one who is utterly released from five factors and endowed with five factors.\n\nWhich five factors are utterly released? Sensual desire is utterly released; ill will is utterly released; sloth and torpor is utterly released; restlessness and remorse is utterly released; skeptical doubt is utterly released. These five factors are utterly released.\n\nWith which five factors is one endowed? One is endowed with the aggregate of virtue which requires no further training; one is endowed with the aggregate of concentration which requires no further training; one is endowed with the aggregate of wisdom which requires no further training; one is endowed with the aggregate of liberation which requires no further training; one is endowed with the aggregate of the knowledge and vision of liberation which requires no further training. One is endowed with these five factors. Thus, I declare that giving to one who is utterly released from five factors and endowed with five factors yields great fruit.”\n\nWhether they are black, white, red, green, mottled, or dove-colored cows—in whatever lineage among these that a disciplined bull is born—a sturdy carrier, endowed with strength, excelling in rapid movement—they harness that one to the load, and they do not inspect its color.\n\nEven so, among human beings, in whatever birth—whether in the noble warrior class, brahmin class, merchant class, worker class, or among the outcastes or refuse-gatherers. In whatever lineage among these that a disciplined one is born—a virtuous ascetic, established in the Dhamma, endowed with virtue, truthful, conscientious; one who has abandoned birth and death, who has perfected the Holy Life entirely; one who has laid down the burden, is unbound, who has completed the task, and is free from defilements; one who has reached the far shore of all phenomena and is liberated through non-clinging—in that immaculate field of merit, the offering yields abundant fruit.\n\nBut foolish, ignorant, dull-witted, and uninstructed people give gifts outside the true path; they do not attend to the Noble Ones.\n\nBut those who attend to the Noble Ones, the wise, those respected for their steadfastness, their faith in the Sublime Ones is fundamentally established.\n\nThey either proceed to the realm of devas or are born here in a noble family. The wise, proceeding gradually, attain Nibbāna.",
      "sinhala": "ඉන්පසු වච්ඡගොත්ත පරිබ්‍රාජක තෙමේ භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු වූ කථා බහ නිමවා එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි වච්ඡගොත්ත පරිබ්‍රාජක තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භවත් ගෞතමයන් වහන්ස, ශ්‍රමණ ගෞතමයාණන් වහන්සේ මෙසේ කියන බව මට අසන්නට ලැබුණි: 'දන් දිය යුත්තේ මටමයි, අන්‍යයන්ට දන් දිය යුතු නැත; දන් දිය යුත්තේ මාගේ ශ්‍රාවකයන්ටමයි, අන්‍යයන්ගේ ශ්‍රාවකයන්ට දන් දිය යුතු නැත; මට දුන්නොත් මහත්ඵලයි, අන්‍යයන්ට දුන්නොත් මහත්ඵල නැත; මාගේ ශ්‍රාවකයන්ට දුන්නොත් මහත්ඵලයි, අන්‍යයන්ගේ ශ්‍රාවකයන්ට දුන්නොත් මහත්ඵල නැත' යනුයි.\n\nභවත් ගෞතමයන් වහන්ස, 'ශ්‍රමණ ගෞතමයාණන් වහන්සේ මෙසේ කියති: දන් දිය යුත්තේ මටමයි... අන්‍යයන්ගේ ශ්‍රාවකයන්ට දුන්නොත් මහත්ඵල නැත' යැයි යම් කෙනෙක් කීවා නම්, ඔවුන් භවත් ගෞතමයන් වහන්සේගේ කියන ලද දේ කියන්නෝ වෙත්ද, නැතහොත් භවත් ගෞතමයන් වහන්සේට අසත්‍යයෙන් අපහාස කරත්ද? ඔවුන් ධර්මයට අනුරූපි ධර්මය ප්‍රකාශ කරත්ද, ධර්මයෙන් යුක්ත වූ කිසිදු වාද විවාදයකට හෝ දෝෂ සහිත ස්ථානයකට පැමිණෙන්නේ නැද්ද? මන්ද, අපි භවත් ගෞතමයන් වහන්සේට අභූතයෙන් චෝදනා කිරීමට අකමැත්තෙමු.\"\n\n\"වච්ඡයෙනි, යම් කෙනෙක් 'ශ්‍රමණ ගෞතමයාණන් වහන්සේ මෙසේ කියති: දන් දිය යුත්තේ මටමයි... අන්‍යයන්ගේ ශ්‍රාවකයන්ට දුන්නොත් මහත්ඵල නැත' යැයි කීවා නම්, ඔවුන් මා විසින් කියන ලද දේ කියන්නෝ නොවෙති. ඔවුන් මා හට අසත්‍ය වූ, නැති දෙයකින් චෝදනා කරත්.\n\nවච්ඡයෙනි, යමෙක් අනුන් දන් දෙනු ලබන විට එය වළක්වයිද, ඔහු තුන් දෙනෙකුට අන්තරාය කරන්නෙක් වේ, තුන් දෙනෙකුට බාධා කරන්නෙක් වේ. ඒ කවර තුන් දෙනෙක්ද? දායකයාගේ පිනට බාධා කරන්නෙක් වේ. ප්‍රතිග්‍රාහකයන්ගේ ලාභයට බාධා කරන්නෙක් වේ. එපමණක් නොව, පළමුවෙන්ම ඔහු විසින් තමාම හිංසාවට පත් කරනු ලබයි, විනාශ කරනු ලබයි. වච්ඡයෙනි, යමෙක් අනුන් දන් දෙනු ලබන විට එය වළක්වයිද, ඔහු මේ තුන් දෙනාට අන්තරාය කරන්නෙක් වේ, තුන් දෙනාට බාධා කරන්නෙක් වේ.\n\nවච්ඡයෙනි, මම මෙසේ කියමි: යම් සත්ත්වයෝ අපිරිසිදු වතුර වලක හෝ කුණු කානුවක හෝ වෙත්ද, එහිදී යමෙක් පිඟන් සේදූ ජලය හෝ වළන් සේදූ ජලය හෝ ඉවත දමන්නේ 'එහි සිටින සත්ත්වයෝ එයින් ජීවත් වෙත්වා' යන අදහසින් නම්, වච්ඡයෙනි, එය නිමිති කොටගෙන පිනක් උපදින බව මම කියමි. මිනිසුන් ගැන කවර කතාද!\n\nවච්ඡයෙනි, එසේම මම ශීලවන්තයාට දෙන ලද දානය මහත්ඵල බව කියමි; දුශ්ශීලයාට දෙන ලද දානය එසේ නොවේ. ඒ ශීලවන්තයා පඤ්චාංගයන්ගෙන් ප්‍රහීණ වූ, පඤ්චාංගයන්ගෙන් සමන්විත වූවෙක් වේ.\n\nකවර පඤ්චාංගයන් ප්‍රහීණ වේද? කාමච්ඡන්දය ප්‍රහීණ වේ, ව්‍යාපාදය ප්‍රහීණ වේ, ථීනමිද්ධය ප්‍රහීණ වේ, උද්ධච්චකුක්කුච්චය ප්‍රහීණ වේ, විචිකිච්ඡාව ප්‍රහීණ වේ. මේ පඤ්චාංගයන් ප්‍රහීණ වේ.\n\nකවර පස් අංගයන්ගෙන් සමන්විත වේද? අශෛක්‍ෂ ශීලස්කන්ධයෙන් සමන්විත වේ, අශෛක්‍ෂ සමාධිස්කන්ධයෙන් සමන්විත වේ, අශෛක්‍ෂ ප්‍රඥාස්කන්ධයෙන් සමන්විත වේ, අශෛක්‍ෂ විමුක්තිස්කන්ධයෙන් සමන්විත වේ, අශෛක්‍ෂ විමුක්තිඥානදර්ශන ස්කන්ධයෙන් සමන්විත වේ. මේ පස් අංගයන්ගෙන් සමන්විත වේ. මෙසේ පඤ්චාංගයන් ප්‍රහීණ කළ, පඤ්චාංගයන්ගෙන් සමන්විත වූ පුද්ගලයාට දුන් දානය මහත්ඵල යැයි මම කියමි.\"\n\nකලු පැහැති, සුදු පැහැති, රතු පැහැති, කොළ පැහැති, විසිතුරු පැහැති, සාමාන්‍ය රූප ස්වභාවයෙන් යුක්ත වූ, පරෙවි පැහැති යන යම් කිසි ගවයන් අතර, යම් කිසි ගවයෙක් දමනය වීද, ප්‍රබල වීද, බර උසුලන්නට හැකි, බල සම්පන්න, යහපත් වේගයෙන් යුක්ත වීද, බර පැටවීමට යොදවන්නේ ඔහුම වේ; ඔහුගේ වර්ණය ගැන නොසලකති.\n\nඑසේම මිනිසුන් අතර, ක්ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශූද්‍ර, චණ්ඩාල, පුක්කුස යන යම් කිසි ජාතියක උපන්නා වූ, ඒ ජාතීන් අතර යම් කිසි ශ්‍රමණයෙක් දමනය වීද, යහපත් ව්‍රතයන්ගෙන් යුක්ත වීද, ධර්මයෙහි පිහිටියේ, ශීල සම්පන්න වූයේ, සත්‍යවාදී වූයේ, ලජ්ජා ඇත්තේ වේද, ජාති මරණ දුරු කළ, බ්‍රහ්මචර්යාව පූර්ණ වශයෙන් අවසන් කළ, බර බැහැර කළ, (සංයෝජනවලින්) වෙන් වූ, අරහත් මාර්ග කෘත්‍යය නිම කළ, ආශ්‍රව රහිත වූ, සියලු ධර්මයන්හි පරතෙරට ගියේ, උපාදාන රහිතව පිරිනිවීද, කෙලෙස් රහිත වූ ඒ ක්ෂේත්‍රයෙහි දෙන දක්ෂිණාව මහත්ඵල වේ.\n\nයම් බාලයෝද, අවිද්‍යාව ඇත්තෝද, දුර්මති ඇත්තෝද, ධර්ම ශ්‍රවණය නැත්තෝද වෙත්ද, ඔවුහු සත්පුරුෂයන් වහන්සේලාට නොලංව, පිටතම දාන දෙති.\n\nයම් කෙනෙක් ප්‍රඥාවන්ත වූ, නුවණැත්තන් විසින් ගරු කරන ලද සත්පුරුෂයන් වහන්සේලා ඇසුරු කරත්ද, ඔවුන්ගේ ශ්‍රද්ධාව සුගතයන් වහන්සේ කෙරෙහි මුල් බැසගෙන, පිහිටා තිබේ. ඔවුහු දෙව්ලොවට යති, නැතහොත් මේ මිනිස් ලොව යහපත් කුලයක උපදිති. ඒ පණ්ඩිතයෝ ක්‍රමයෙන් නිර්වාණය අවබෝධ කර ගනිති. (සත්වමං)",
      "paliTitle": "Vacchagottasuttaṃ",
      "englishTitle": "Vacchagotta Sutta",
      "sinhalaTitle": "වච්ඡගොත්ත සූත්‍රය"
    },
    {
      "number": 59,
      "pali": "Atha kho tikaṇṇo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ…pe… ekamantaṃ nisinno kho tikaṇṇo brāhmaṇo bhagavato sammukhā tevijjānaṃ sudaṃ brāhmaṇānaṃ vaṇṇaṃ bhāsati – ‘‘evampi tevijjā brāhmaṇā, itipi tevijjā brāhmaṇā’’ti. ‘‘Yathā kathaṃ pana, brāhmaṇa, brāhmaṇā brāhmaṇaṃ tevijjaṃ paññāpentī’’ti? ‘‘Idha, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena, ajjhāyako, mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayoti. Evaṃ kho, bho gotama, brāhmaṇā tevijjaṃ paññāpentī’’ti. ‘‘Aññathā kho, brāhmaṇa, brāhmaṇā brāhmaṇaṃ tevijjaṃ paññapenti, aññathā ca pana ariyassa vinaye tevijjo hotī’’ti. ‘‘Yathā kathaṃ pana, bho gotama, ariyassa vinaye tevijjo hoti? Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ariyassa vinaye tevijjo hotī’’ti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho tikaṇṇo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha, brāhmaṇa, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattārīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi, anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ. Tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Ayamassa paṭhamā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā…pe… manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā, vacīsucaritena samannāgatā, manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Ayamassa dutiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti; ‘ime āsavā’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Ayamassa tatiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato’’ti. ‘‘Anuccāvacasīlassa, nipakassa ca jhāyino; Cittaṃ yassa vasībhūtaṃ, ekaggaṃ susamāhitaṃ. ‘‘Taṃ ve tamonudaṃ dhīraṃ, tevijjaṃ maccuhāyinaṃ; Hitaṃ devamanussānaṃ, āhu sabbappahāyinaṃ. ‘‘Tīhi vijjāhi sampannaṃ, asammūḷhavihārinaṃ; Buddhaṃ antimadehinaṃ [antimasārīraṃ (sī. syā. kaṃ. pī.)], taṃ namassanti gotamaṃ. [dha. pa. 423; itivu. 99] ‘‘Pubbenivāsaṃ yo vedī, saggāpāyañca passati; Atho jātikkhayaṃ patto, abhiññāvosito muni. ‘‘Etāhi tīhi vijjāhi, tevijjo hoti brāhmaṇo; Tamahaṃ vadāmi tevijjaṃ, nāññaṃ lapitalāpana’’nti. ‘‘Evaṃ kho, brāhmaṇa, ariyassa vinaye tevijjo hotī’’ti. ‘‘Aññathā, bho gotama, brāhmaṇānaṃ tevijjo, aññathā ca pana ariyassa vinaye tevijjo hoti. Imassa ca pana, bho gotama, ariyassa vinaye tevijjassa brāhmaṇānaṃ tevijjo kalaṃ nāgghati soḷasiṃ’’. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Aṭṭhamaṃ.",
      "english": "Then the Brahmin Tikaṇṇa approached the Blessed One. Having approached and exchanged greetings, he sat down to one side. Sitting thus, the Brahmin Tikaṇṇa praised the Brahmins possessing the Threefold Knowledge in the presence of the Blessed One, saying, \"Thus are the Brahmins possessing the Threefold Knowledge; in this way, too, are the Brahmins possessing the Threefold Knowledge.\"\n\n\"But how, Brahmin, do Brahmins designate a Brahmin as possessing the Threefold Knowledge?\"\n\n\"Here, good Gotama, a Brahmin is well-born on both sides, both mother and father; pure in lineage up to the seventh generation of ancestors, unblemished and unreproached on the grounds of birth. He is a repeater of sacred texts, a holder of the secret mantras, one who has mastered the three Vedas—complete with their lexicons and rituals, their phonology and etymology, and counting historical tradition as the fifth—skilled in grammar, versed in the signs of a great man according to the worldly tradition (Lokāyata). This is how, good Gotama, Brahmins designate one possessing the Threefold Knowledge.\"\n\n\"The way Brahmins designate a Brahmin possessing the Threefold Knowledge is indeed one thing, Brahmin, but it is quite another way that one becomes a possessor of the Threefold Knowledge in the Noble Discipline.\"\n\"But how, good Gotama, does one become a possessor of the Threefold Knowledge in the Noble Discipline? May the venerable Gotama kindly teach me the Dharma such that one becomes a possessor of the Threefold Knowledge in the Noble Discipline.\"\n\n\"In that case, Brahmin, listen, and attend carefully; I shall speak.\"\n\"Yes, good sir,\" replied the Brahmin Tikaṇṇa to the Blessed One. The Blessed One spoke this:\n\n\"Here, Brahmin, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and remains in the first jhāna, which is accompanied by applied thought and sustained thought, born of detachment, filled with rapture and pleasure.\nWith the subsiding of applied thought and sustained thought, through inner tranquility and unification of mind, he enters and remains in the second jhāna, which is without applied thought or sustained thought, born of concentration, filled with rapture and pleasure.\nWith the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body, concerning which the Noble Ones announce, ‘He is equanimous, mindful, one who dwells in pleasure.’ He enters and remains in the third jhāna.\nWith the abandoning of pleasure and the abandoning of pain—and with the previous disappearance of joy and grief—he enters and remains in the fourth jhāna, which is neither painful nor pleasant, purified by equanimity and mindfulness.\n\n\"With his mind thus concentrated, purified, cleansed, without blemish, rid of defilements, soft, workable, steady, and attained to imperturbability, he directs his mind to the knowledge of the recollection of past dwellings. He recollects his manifold past dwellings—that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births; many eons of world contraction, many eons of world expansion, many eons of world contraction and expansion—'There I was named thus, of such a clan, of such a color, subsisting on such food, experiencing such pleasure and pain, having such a lifespan; having passed away from there, I reappeared yonder. There too I was named thus, of such a clan, of such a color, subsisting on such food, experiencing such pleasure and pain, having such a lifespan; having passed away from there, I have reappeared here.' Thus, with its characteristic aspects and circumstances, he recollects his manifold past dwellings. This is the first True Knowledge (Vijjā) attained by him; ignorance is destroyed, knowledge has arisen; darkness is destroyed, light has arisen—as is fitting for one who dwells diligently, ardent, and resolute.\n\n\"With his mind thus concentrated, purified, cleansed, without blemish, rid of defilements, soft, workable, steady, and attained to imperturbability, he directs his mind to the knowledge of the passing away and reappearance of beings. With the purified divine eye, surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their deeds—'These worthy beings, who were endowed with misconduct of body, misconduct of speech, and misconduct of mind, who reviled the Noble Ones, held wrong view, and undertook deeds rooted in wrong view, upon the breaking up of the body, after death, have reappeared in a state of deprivation, a bad destination, the lower realms, in hell. However, these worthy beings, who were endowed with good conduct of body, good conduct of speech, and good conduct of mind, who did not revile the Noble Ones, held right view, and undertook deeds rooted in right view, upon the breaking up of the body, after death, have reappeared in a good destination, the heavenly world.' Thus, with the purified divine eye, surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their deeds. This is the second True Knowledge attained by him; ignorance is destroyed, knowledge has arisen; darkness is destroyed, light has arisen—as is fitting for one who dwells diligently, ardent, and resolute.\n\n\"With his mind thus concentrated, purified, cleansed, without blemish, rid of defilements, soft, workable, steady, and attained to imperturbability, he directs his mind to the knowledge of the destruction of the defilements.\"\n\nHe understands according to reality: ‘This is suffering,’ he understands according to reality: ‘This is the origin of suffering,’ he understands according to reality: ‘This is the cessation of suffering,’ he understands according to reality: ‘This is the path leading to the cessation of suffering.’ He understands according to reality: ‘These are the cankers,’ he understands according to reality: ‘This is the origin of the cankers,’ he understands according to reality: ‘This is the cessation of the cankers,’ he understands according to reality: ‘This is the path leading to the cessation of the cankers.’ When he thus knows and thus sees, his mind is liberated from the canker of sensuality, his mind is liberated from the canker of existence, and his mind is liberated from the canker of ignorance. In liberation, the knowledge arises: ‘It is liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what needed to be done has been done, there is no further state of being in this world.’ This is his third knowledge attained; ignorance is dispelled, knowledge has arisen; darkness is dispelled, light has arisen, just as it is for one who dwells diligently, ardently, resolute in mind.”\n\nWhose morality is neither high nor low, who is sagacious and meditative, whose mind is mastered, unified, and well-concentrated—\n\nThat wise one, dispeller of darkness, possessing the three knowledges, abandoning death, beneficial to gods and men—they call him the abandoner of all things.\n\nComplete with the three knowledges, dwelling without delusion, the Buddha, possessing the final body—they pay homage to that Gotama.\n\nHe who knows previous abodes, and sees heaven and the places of woe, and further, has attained the destruction of birth, that sage is consummate in higher knowledge.\n\nBy these three knowledges, one is a true possessor of the three knowledges, a true brahmin. That one I call the possessor of the three knowledges, not another who merely utters chatter.”\n\n“In this way, brahmin, one is a possessor of the three knowledges in the Noble Discipline.”\n\n“Differently, good Gotama, is the possessor of the three knowledges according to the brahmins, and differently is the possessor of the three knowledges in the Noble Discipline. Furthermore, good Gotama, the brahmin’s possessor of the three knowledges is not worth a sixteenth part compared to the possessor of the three knowledges in the Noble Discipline.”\n\n“Excellent, good Gotama... I request that the good Gotama accept me as a lay follower who has gone for refuge from this day forth for as long as life lasts.”",
      "sinhala": "ඉන්පසු තිකණ්ණ නම් බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ කතාබස් කොට එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි තිකණ්ණ නම් බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ වර්ණනාව කීවේය: “ත්‍රිවේදී බ්‍රාහ්මණයෝ මෙබඳු ගුණ ඇත්තෝ වෙති, ත්‍රිවේදී බ්‍රාහ්මණයෝ එබඳු ගුණ ඇත්තෝ වෙති.”\n\n“බ්‍රාහ්මණය, එසේනම් බ්‍රාහ්මණයෝ කිනම් අයුරකින්ද ත්‍රිවේදී බ්‍රාහ්මණයෙකු හඳුන්වන්නේ?” “භවත් ගෞතමයන් වහන්ස, මෙහිලා බ්‍රාහ්මණයා මව්පිය දෙදෙනාගෙන් මනා කොට උපන්නේ වෙයි. හත්වන පිය-මුත්තා පරම්පරාව දක්වා සංශුද්ධ වූ ගර්භය ඇත්තේ වෙයි. ජාතිවාදයෙන් (උපත ගැන) කිසිවෙකුගෙන් නින්දා නොලද්දේ, අපකීර්තිමත් නොවූයේ වෙයි. අධ්‍යයනශීලී වූයේ, මන්ත්‍ර දරන්නෙක් වූයේ, නිඝණ්ඩු සහ කේටුභ නම් ශාස්ත්‍ර සහිත වූ, අක්ෂර ප්‍රභේද සහිත වූ, ඉතිහාසය පස්වනු කොට ඇති තිදෙක්‍ වේදයන්ගේ පරතෙරට ගියේ වෙයි. පද ශාස්ත්‍රය දන්නේ, ව්‍යාකරණ ශාස්ත්‍රය දන්නේ වෙයි. ලෝකායත (ලෞකික විද්‍යා) ශාස්ත්‍රයෙහි ද මහා පුරුෂ ලක්ෂණ විද්‍යාවෙහි ද අඩුපාඩුවක් නැත්තේ වෙයි. භවත් ගෞතමයන් වහන්ස, බ්‍රාහ්මණයෝ ත්‍රිවේදී බ්‍රාහ්මණයා මෙසේ හඳුන්වති.”\n\n“බ්‍රාහ්මණය, බ්‍රාහ්මණයෝ ත්‍රිවේදී බ්‍රාහ්මණයා හඳුන්වන්නේ එක් ආකාරයකටය. එහෙත් ආර්ය විනයෙහි ත්‍රිවේදී වූයේ අන් ආකාරයකින් වන්නේය.” “භවත් ගෞතමයන් වහන්ස, එසේනම් ආර්ය විනයෙහි ත්‍රිවේදී වූයේ කෙසේ වන්නේද? ආර්ය විනයෙහි ත්‍රිවේදී වන ආකාරයට භවත් ගෞතමයන් වහන්සේ මට ඒ ධර්මය දේශනා කරන්නේ නම් යෙහෙකි.” “එසේනම් බ්‍රාහ්මණය, අසව! මනාව මෙනෙහි කරව! මම දේශනා කරන්නෙමි.” “එසේය, භවත් වහන්ස” යි තිකණ්ණ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “බ්‍රාහ්මණය, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සුඛය සහිත වූ ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි.\n\nවිතර්ක විචාරයන් සංසිඳීමෙන් අධ්‍යාත්මිකව පහන් බවක්, සිතේ එකඟ බවක් ඇතිව, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සුඛය සහිත වූ ද්විතීය ධ්‍යානයට පැමිණ වාසය කරයි.\n\nප්‍රීතියෙහි ද නොඇල්ම නිසා උපේක්ෂාවෙන් යුක්තව වාසය කරයි, සිහි ඇත්තේ ද මනා නුවණින් යුක්ත වූයේ ද වෙයි. යමක් ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්ත වූයේ, සිහි ඇත්තේ, සැප විහරණය ඇත්තේ’ යැයි පවසත් ද, කයින් ද සුඛය අත්විඳින්නේ තෘතීය ධ්‍යානයට පැමිණ වාසය කරයි.\n\nසුඛය ද දුක ද ප්‍රහාණය කිරීමෙන්, කලින්ම සොම්නස් ද දොම්නස් ද අතුරුදහන් වීමෙන්, දුක් ද නොවූ, සැප ද නොවූ, උපේක්ෂා-සති පාරිශුද්ධිය ඇති චතුර්ථ ධ්‍යානයට පැමිණ වාසය කරයි.\n\nඒ භික්ෂුව මෙසේ සමාධිගත වූ, පිරිසිදු වූ, අවටින් පිරිසිදු වූ, කෙලෙස්-මල රහිත වූ, දුරු කරන ලද උපක්ලේශ ඇති, මෘදු බවට පැමිණි, කර්මයට සුදුසු වූ, ස්ථිර වූ, කම්පනයට නොපැමිණි වූ කල්හි පූර්ව නිවාසයන් සිහි කරන ඥානය පිණිස සිත යොමු කරයි. ඔහු නානාවිධ වූ පෙර විසූ කඳන් සිහි කරයි. එනම්: එක් ආත්ම භවයක් ද, දෙකක් ද, තුනක් ද, සතරක් ද, පහක් ද, දහයක් ද, විස්සක් ද, තිහක් ද, සතළිහක් ද, පනහක් ද, සියයක් ද, දහසක් ද, සියක් දහසක් ද වූ ආත්ම භවයන් සිහි කරයි. බොහෝ සංවර්ත කල්පයන් ද, බොහෝ විවර්ත කල්පයන් ද, බොහෝ සංවර්ත-විවර්ත කල්පයන් ද සිහි කරයි: ‘මම අසවල් තැන සිටියෙමි, මෙබඳු නාම ඇතිව, මෙබඳු ගෝත්‍ර ඇතිව, මෙබඳු වර්ණ ඇතිව, මෙබඳු ආහාර ඇතිව, මෙබඳු සැප දුක් විඳින්නෙක්ව, මෙබඳු ආයුෂ කෙළවර ඇතිව විසුවෙමි. ඒ මම එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එතැන්හි ද මෙබඳු නාම ඇතිව, මෙබඳු ගෝත්‍ර ඇතිව, මෙබඳු වර්ණ ඇතිව, මෙබඳු ආහාර ඇතිව, මෙබඳු සැප දුක් විඳින්නෙක්ව, මෙබඳු ආයුෂ කෙළවර ඇතිව විසුවෙමි. ඒ මම එතැනින් චුත වී මෙහි උපන්නෙමි’ යි මෙසේ ආකාර සහිතව, අරමුණු සහිතව, නානාවිධ වූ පෙර විසූ කඳන් සිහි කරයි. මෙය ඔහුගේ පළමු වන විද්‍යාව වන්නේය. අප්‍රමාදීව, වීර්යවත්ව, යොදන ලද සිතින් යුක්තව වාසය කරන භික්ෂුවට අවිද්‍යාව දුරු කරන ලදී, විද්‍යාව උපදවන ලදී; අඳුර දුරු කරන ලදී, ආලෝකය උපදවන ලදී.\n\nඒ භික්ෂුව මෙසේ සමාධිගත වූ, පිරිසිදු වූ, අවටින් පිරිසිදු වූ, කෙලෙස්-මල රහිත වූ, දුරු කරන ලද උපක්ලේශ ඇති, මෘදු බවට පැමිණි, කර්මයට සුදුසු වූ, ස්ථිර වූ, කම්පනයට නොපැමිණි වූ කල්හි සත්වයන්ගේ චුති-උපත් ඥානය පිණිස සිත යොමු කරයි. ඔහු පිරිසිදු වූ, මනුෂ්‍ය ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගතිගාමී වූ, දුර්ගතිගාමී වූ සත්වයන් දකී, කර්මානුරූපව ගමන් කරන්නා වූ සත්වයන් හඳුනා ගනී: ‘අහෝ, මේ භවත් සත්ත්වයෝ කාය දුශ්චරිතයෙන් යුක්ත වූ, වචී දුශ්චරිතයෙන් යුක්ත වූ, මනෝ දුශ්චරිතයෙන් යුක්ත වූ, ආර්යයන්ට අපහාස කරන්නා වූ, මිථ්‍යාදෘෂ්ටි ඇත්තා වූ, මිථ්‍යාදෘෂ්ටියට අනුකූල කර්ම සමාදන් වූවෝ වෙති. ඔවුහු කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරයෙහි උපන්නාහ. නැතහොත් මේ භවත් සත්වයෝ කාය සුචරිතයෙන් යුක්ත වූ, වචී සුචරිතයෙන් යුක්ත වූ, මනෝ සුචරිතයෙන් යුක්ත වූ, ආර්යයන්ට අපහාස නොකරන්නා වූ, සම්මාදිට්ඨි ඇත්තා වූ, සම්මාදිට්ඨියට අනුකූල කර්ම සමාදන් වූවෝ වෙති. ඔවුහු කය බිඳී මරණින් මතු සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපන්නාහ’ යි. මෙසේ පිරිසිදු වූ, මනුෂ්‍ය ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගතිගාමී වූ, දුර්ගතිගාමී වූ සත්වයන් දකී, කර්මානුරූපව ගමන් කරන්නා වූ සත්වයන් හඳුනා ගනී. මෙය ඔහුගේ දෙවන විද්‍යාව වන්නේය. අප්‍රමාදීව, වීර්යවත්ව, යොදන ලද සිතින් යුක්තව වාසය කරන භික්ෂුවට අවිද්‍යාව දුරු කරන ලදී, විද්‍යාව උපදවන ලදී; අඳුර දුරු කරන ලදී, ආලෝකය උපදවන ලදී.\n\nඒ භික්ෂුව මෙසේ සමාධිගත වූ, පිරිසිදු වූ, අවටින් පිරිසිදු වූ, කෙලෙස්-මල රහිත වූ, දුරු කරන ලද උපක්ලේශ ඇති, මෘදු බවට පැමිණි, කර්මයට සුදුසු වූ, ස්ථිර වූ, කම්පනයට නොපැමිණි වූ කල්හි ආශ්‍රවයන් ක්ෂය කිරීමේ ඥානය පිණිස සිත යොමු කරයි.\n\nහෙතෙම 'මේ දුක ය' යි ඇති සැටියෙන් අවබෝධ කරයි. 'මේ දුක ඇතිවීමට හේතුව ය' යි ඇති සැටියෙන් අවබෝධ කරයි. 'මේ දුක නැති කිරීම ය' යි ඇති සැටියෙන් අවබෝධ කරයි. 'මේ දුක නැති කරන මාර්ගය ය' යි ඇති සැටියෙන් අවබෝධ කරයි. 'මේ ආශ්‍රවයෝ ය' යි ඇති සැටියෙන් අවබෝධ කරයි. 'මේ ආශ්‍රවයන්ගේ සමුදය ය' යි ඇති සැටියෙන් අවබෝධ කරයි. 'මේ ආශ්‍රවයන්ගේ නිරෝධය ය' යි ඇති සැටියෙන් අවබෝධ කරයි. 'මේ ආශ්‍රවයන්ගේ නිරෝධයට යන ප්‍රතිපදාව ය' යි ඇති සැටියෙන් අවබෝධ කරයි.\n\nමෙසේ දන්නා, මෙසේ දක්නා ඔහුගේ සිත කාමාශ්‍රවයෙන් ද නිදහස් වේ. භවාශ්‍රවයෙන් ද නිදහස් වේ. අවිද්‍යාශ්‍රවයෙන් ද නිදහස් වේ. නිදහස් වීමෙහි, 'නිදහස් විය' යන ඥානය ඔහුට ඇති වේ. 'ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කෙළේ ය, මේ බවය පිණිස අන් කිසිවක් නැත' යි හෙතෙම අවබෝධ කරයි. මෙසේ ඔහු විසින් මේ තුන්වන විද්‍යාව (ආශ්‍රවක්‍ෂය ඥානය) ලබා ගත්තා වේ. අවිද්‍යාව දුරු කරන ලදී, විද්‍යාව උපදවන ලදී. අන්ධකාරය දුරු කරන ලදී, ආලෝකය උපදවන ලදී. එසේ වූයේ යම් සේ අප්‍රමාදීව, දැඩි වීර්යයෙන් යුක්තව, නිවන පිණිස කැප වූ සිතින් වාසය කරන තැනැත්තා හට ද, එසේ ම වේ.\n\nයමෙක් පහත් වූ ද, උසස් වූ ද සිල්පද නැත්තෙක් ද, ප්‍රඥාවෙන් යුක්ත ව ධ්‍යාන වඩන්නෙක් ද වේ ද, යමෙකුගේ සිත වසඟ බවට පත් වී, තමා විසින්ම එක අග්‍ර කොට, මනාකොට සමාධිගත වී ඇත්තේ ද, ඒ තැනැත්තා අන්ධකාරය දුරු කරන, ධෛර්යවත් වූ, ත්‍රිවිද්‍යාවෙන් යුක්ත වූ, මරණය ඉක්මවා ගිය, දෙවි මිනිසුන්ගේ හිත පිණිස වූ, සියලු කෙලෙස් පහ කළ තැනැත්තා යැයි පණ්ඩිතයෝ කියති.\n\nඒ තිදෙක (තුන් විද්‍යාව) සම්පූර්ණ කළ, මුළා නොවී වාසය කරන, අන්තිම ශරීරය දරන බුදුරජාණන් වහන්සේ වන ගෞතමයන් වහන්සේට මම නමස්කාර කරමි.\n\nයම් කෙනෙක් පෙර කරන ලද වාසය දන්නේ ද, ස්වර්ගය හා අපාය ද දකින්නේ ද, එසේම ජාතිය ක්ෂය කිරීම (අර්හත්වය) ලැබූ, අභිඥාවලින් කෙළවරට පැමිණි මුනිරජාණන් වහන්සේ වේ ද, ඒ තුන් විද්‍යාවන්ගෙන් යුක්ත වූ තැනැත්තා ම බ්‍රාහ්මණයා වන්නේ ය. මම ඔහු ම ත්‍රිවිද්‍යා සම්පන්න යැයි කියමි. අන්‍ය වල් දොඩවන්නා ත්‍රිවිද්‍යා සම්පන්න යැයි නොකියමි.\n\nබමුණ, ආර්ය විනයෙහි ත්‍රිවිද්‍යා සම්පන්න පුද්ගලයා වන්නේ මෙසේ යි. \"භවත් ගෞතමයන් වහන්ස, බ්‍රාහ්මණවරුන්ගේ ත්‍රිවිද්‍යාව වෙනත් ආකාරයකි. ආර්ය විනයෙහි ත්‍රිවිද්‍යාව වෙනත් ආකාරයකි. භවත් ගෞතමයන් වහන්ස, මේ ආර්ය විනයෙහි ත්‍රිවිද්‍යා සම්පන්න බව බ්‍රාහ්මණවරුන්ගේ ත්‍රිවිද්‍යාවේ දහසය කොටසකටවත් වටින්නේ නැත.\" \"භවත් ගෞතමයන් වහන්ස, ඉතා යහපත් ය. . . භවත් ගෞතමයන් වහන්සේ අද පටන් මා දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා.\" අටවැනි වග්ගය නිමි.",
      "paliTitle": "Tikaṇṇasuttaṃ",
      "englishTitle": "Discourse to Tikanna",
      "sinhalaTitle": "තිකණ්ණ සූත්‍රය"
    },
    {
      "number": 60,
      "pali": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ…pe… ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘yassassu, bho gotama, yañño vā saddhaṃ vā thālipāko vā deyyadhammaṃ vā, tevijjesu brāhmaṇesu dānaṃ dadeyyā’’ti. ‘‘Yathā kathaṃ pana, brāhmaṇa, brāhmaṇā tevijjaṃ paññapentī’’ti? ‘‘Idha kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, ajjhāyako mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayoti. Evaṃ kho, bho gotama, brāhmaṇā tevijjaṃ paññapentī’’ti. ‘‘Aññathā kho, brāhmaṇa, brāhmaṇā brāhmaṇaṃ tevijjaṃ paññapenti, aññathā ca pana ariyassa vinaye tevijjo hotī’’ti. ‘‘Yathā kathaṃ pana, bho gotama, ariyassa vinaye tevijjo hoti? Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ariyassa vinaye tevijjo hotī’’ti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho jāṇussoṇi brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha pana, brāhmaṇa, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Ayamassa paṭhamā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti. Ayamassa dutiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti; ‘ime āsavā’ti yathābhūtaṃ pajānāti…pe… ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Ayamassa tatiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato’’ti. ‘‘Yo sīlabbatasampanno, pahitatto samāhito; Cittaṃ yassa vasībhūtaṃ, ekaggaṃ susamāhitaṃ. [dha. pa. 423; itivu. 99] ‘‘Pubbenivāsaṃ yo vedī, saggāpāyañca passati; Atho jātikkhayaṃ patto, abhiññāvosito muni. ‘‘Etāhi tīhi vijjāhi, tevijjo hoti brāhmaṇo; Tamahaṃ vadāmi tevijjaṃ, nāññaṃ lapitalāpana’’nti. ‘‘Evaṃ kho, brāhmaṇa, ariyassa vinaye tevijjo hotī’’ti. ‘‘Aññathā, bho gotama, brāhmaṇānaṃ tevijjo, aññathā ca pana ariyassa vinaye tevijjo hoti. Imassa ca, bho gotama, ariyassa vinaye tevijjassa brāhmaṇānaṃ tevijjo kalaṃ nāgghati soḷasiṃ’’. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Navamaṃ.",
      "english": "Then the brahmin Jāṇussoṇi approached the Blessed One. Having approached and exchanged greetings with the Blessed One, he sat down to one side. Sitting thus, the brahmin Jāṇussoṇi said to the Blessed One: “If someone, Venerable Gotama, had a sacrifice, or a devotional offering, or a meal offering, or an alms offering, he should give that gift to brahmins possessing the Three Knowledges.”\n\n“But how, brahmin, do the brahmins define one possessing the Three Knowledges?”\n\n“Here, Venerable Gotama, a brahmin is well-born on both sides, from mother and father, with pure lineage back through seven generations of ancestors, without reproach or defect concerning birth. He is a repeater and memorizer of the sacred texts, having mastered the Three Vedas, complete with the glossaries and rituals, the phonology and exegesis, and the fifth element, the narratives. He is skilled in grammar and syntax, and proficient in natural philosophy and the marks of a Great Man. This, Venerable Gotama, is how the brahmins define one possessing the Three Knowledges.”\n\n“The way in which brahmins define a brahmin possessing the Three Knowledges is one thing, brahmin, but in the Noble Discipline, the one possessing the Three Knowledges is defined in quite another way.”\n\n“But how, Venerable Gotama, is one possessing the Three Knowledges defined in the Noble Discipline? It would be excellent if the Venerable Gotama would teach me the Dhamma, so that I might know how one is defined as possessing the Three Knowledges in the Noble Discipline.”\n\n“In that case, brahmin, listen and pay close attention; I shall speak.” “Yes, Venerable Sir,” replied the brahmin Jāṇussoṇi to the Blessed One. The Blessed One spoke thus: “Here, brahmin, a monk, detached from sensual pleasures, [details of the first three absorptions are omitted] enters upon and abides in the fourth absorption.\n\nWith his mind thus concentrated, purified, radiant, spotless, free from defilements, malleable, ready for action, firm, and having attained imperturbability, he directs his mind to the knowledge of recollecting past lives. He recollects his diverse past lives, that is, one birth, two births… thus he recollects his diverse past lives in all their modes and details. This is the first Knowledge attained by him; ignorance is destroyed, knowledge has arisen; darkness is destroyed, light has arisen, just as is proper for one who dwells diligently, ardent, and resolute.\n\nWith his mind thus concentrated, purified, radiant, spotless, free from defilements, malleable, ready for action, firm, and having attained imperturbability, he directs his mind to the knowledge of the passing away and reappearance of beings. He sees, with the divine eye, purified and surpassing that of humans, and discerns beings according to their deeds. This is the second Knowledge attained by him; ignorance is destroyed, knowledge has arisen; darkness is destroyed, light has arisen, just as is proper for one who dwells diligently, ardent, and resolute.\n\nWith his mind thus concentrated, purified, radiant, spotless, free from defilements, malleable, ready for action, firm, and having attained imperturbability, he directs his mind to the knowledge of the destruction of the defilements. He understands ‘This is suffering’ as it actually is, and he understands ‘This is the path leading to the cessation of suffering’ as it actually is; he understands ‘These are the defilements’ as it actually is, and he understands ‘This is the path leading to the cessation of the defilements’ as it actually is. When he thus knows and sees, his mind is liberated from the defilement of sensual desire, his mind is liberated from the defilement of existence, and his mind is liberated from the defilement of ignorance. With liberation, the knowledge arises: ‘I am liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more returning to any state of being.’ This is the third Knowledge attained by him; ignorance is destroyed, knowledge has arisen; darkness is destroyed, light has arisen, just as is proper for one who dwells diligently, ardent, and resolute.”\n\nThe one perfected in virtuous conduct and vows, resolute and concentrated,\nWhose mind is thoroughly controlled, unified, and perfectly composed—\nWho knows his past lives and sees heavens and woeful states,\nAnd who, moreover, has attained the destruction of birth, that sage, accomplished in higher knowledge,\nBy means of these Three Knowledges, becomes a brahmin with the three knowledges.\nHim do I call one possessing the Three Knowledges, and not the mere chanter of recited words.\n\n“This, brahmin, is how one is defined as possessing the Three Knowledges in the Noble Discipline.”\n\n“The way in which brahmins define one possessing the Three Knowledges is one thing, Venerable Gotama, and the way in which one is defined in the Noble Discipline is quite another. Compared to this one possessing the Three Knowledges in the Noble Discipline, the brahmin’s definition of the Three Knowledges is not worth a sixteenth part.” “Excellent, Venerable Gotama! May the Venerable Gotama remember me as a lay follower who has taken refuge from this day forth, for as long as life lasts.”",
      "sinhala": "ඉන්පසු ජාණුස්සෝණි බ්‍රාහ්මණයාණෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේ සමග සතුටු වූහ... (ආදී වශයෙන්) එක් පසෙක වාඩි වූ ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භවත් ගෞතමයන් වහන්ස, යම් කෙනෙකුට යඥයක් හෝ ශ්‍රද්ධාවක් හෝ ථාලිපාකයක් (ගින්නෙහි පිසූ භෝජනයක්) හෝ දියයුතු ධර්මයක් (දෙය්‍යධර්මයක්) හෝ ඇත්නම්, එය ත්‍රිවේදධර බ්‍රාහ්මණයන් කෙරෙහි දන් දිය යුතුය.\"\n\n\"එසේ නම්, බ්‍රාහ්මණය, බ්‍රාහ්මණයෝ ත්‍රිවේදය ඇත්තා කවර ආකාරයකින් පනවන්නේද?\"\n\n\"භවත් ගෞතමයන් වහන්ස, මෙහිලා බ්‍රාහ්මණයා මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම යහපත් උපතක් ඇත්තෙක් වන්නේය. සත්වන මුතු පරම්පරාව දක්වා සංශුද්ධ වූ කුල පරපුරක් ඇත්තේය. ජාති වශයෙන් කිසිවෙකු විසින් අවලාමයට හෝ දෝෂාරෝපණයට හෝ ලක් නොකරන ලද්දේය. ඔහු මන්ත්‍රධාරී වූ, අධ්‍යායනය කරන්නෙක් වේ. ඔහු නිඝණ්ඩු සහිත, කේටුභ සහිත, අක්‍ෂර ප්‍රභේද සහිත, ඉතිහාසය පස්වනු කොට ඇති තිදෙනා වූ වේදයන්හි පරතෙරට ගියේය. ඔහු පදයන්හි දක්‍ෂයෙක්, ව්‍යාකරණ දන්නේය. ලෝකායතයෙහිද මහා පුරුෂ ලක්‍ෂණයන්හිද අඩුපාඩුවක් නැත්තෙක් වේ. භවත් ගෞතමයන් වහන්ස, බ්‍රාහ්මණයෝ ත්‍රිවේදධරයා පනවන්නේ මෙසේය.\"\n\n\"බ්‍රාහ්මණය, බ්‍රාහ්මණයෝ බ්‍රාහ්මණයා ත්‍රිවේදධරයා ලෙස පනවන්නේ එක් ආකාරයකිනි. නමුත් ආර්ය විනයෙහි ත්‍රිවේදධරයා වන්නේ ඊට වඩා වෙනත් ආකාරයකිනි.\"\n\n\"එසේ නම්, භවත් ගෞතමයන් වහන්ස, ආර්ය විනයෙහි ත්‍රිවේදධරයා වන්නේ කෙසේද? ආර්ය විනයෙහි ත්‍රිවේදධරයා වන ආකාරයට භවත් ගෞතමයන් වහන්සේ මට ධර්මය දේශනා කරන්නේ නම් යහපති.\"\n\n\"එසේ නම් බ්‍රාහ්මණය, අසන්න. මනා කොට මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි.\" \"එසේය, භවත් වහන්සැ\" යි ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"බ්‍රාහ්මණය, මෙහිලා භික්‍ෂුව කාමයන්ගෙන් වෙන්වම ... (ආදී වශයෙන්) සිව්වන ධ්‍යානයට පැමිණ වාසය කරන්නේය.\n\nඑම භික්ෂුව මෙසේ සමහිත වූ, පිරිසිදු වූ, අවබෝධයට පැමිණි, කෙලෙස් රහිත වූ, පහව ගිය උපක්ලේශයන් සහිත වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, නොසෙල්වෙන ස්වභාවයට පැමිණි සිත, පූර්වේනිවාසය (පෙර විසූ කඳ) සිහි කිරීමේ ඥානය සඳහා යොමු කරන්නේය. ඔහු ඒක ජාතියක්, දෙක ජාති ආදී වශයෙන්... (ආදී වශයෙන්) ආකාර සහිතව, අරමුණු සහිතව, නා නා ප්‍රකාර වූ පෙර විසූ කඳ සිහි කරන්නේය. මෙය ඔහුගේ අධිගත කරන ලද පළමු විද්‍යාව වන්නේය. මෙහිදී අවිද්‍යාව දුරු කරණ ලද්දේය, විද්‍යාව උපදින ලද්දේය. අඳුර දුරු කරන ලද්දේය, ආලෝකය උපදින ලද්දේය. මෙය අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, කැප වූ සිතින් වාසය කරන තැනැත්තාට සිදු වන්නාක් මෙනි.\n\nඑම භික්ෂුව මෙසේ සමහිත වූ, පිරිසිදු වූ, අවබෝධයට පැමිණි, කෙලෙස් රහිත වූ, පහව ගිය උපක්ලේශයන් සහිත වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, නොසෙල්වෙන ස්වභාවයට පැමිණි සිත, සත්වයන්ගේ චුතිය හා උපත පිළිබඳ ඥානය සඳහා යොමු කරන්නේය. ඔහු පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින් ... (ආදී වශයෙන්) කර්මානුරූපව උපදින සත්වයන් දන්නේය. මෙය ඔහුගේ අධිගත කරන ලද දෙවන විද්‍යාව වන්නේය. මෙහිදී අවිද්‍යාව දුරු කරණ ලද්දේය, විද්‍යාව උපදින ලද්දේය. අඳුර දුරු කරන ලද්දේය, ආලෝකය උපදින ලද්දේය. මෙය අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, කැප වූ සිතින් වාසය කරන තැනැත්තාට සිදු වන්නාක් මෙනි.\n\nඑම භික්ෂුව මෙසේ සමහිත වූ, පිරිසිදු වූ, අවබෝධයට පැමිණි, කෙලෙස් රහිත වූ, පහව ගිය උපක්ලේශයන් සහිත වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, නොසෙල්වෙන ස්වභාවයට පැමිණි සිත, ආශ්‍රවයන් (කෙලෙස්) ක්ෂය කිරීමේ ඥානය සඳහා යොමු කරන්නේය. ඔහු 'මෙය දුක ය' යි ඇති සැටියෙන් දන්නේය ... (ආදී වශයෙන්) 'මේ දුක නිරෝධය පිණිස යන ප්‍රතිපදාව ය' යි ඇති සැටියෙන් දන්නේය. 'මේ ආශ්‍රවයෝ ය' යි ඇති සැටියෙන් දන්නේය ... (ආදී වශයෙන්) 'මේ ආශ්‍රව නිරෝධය පිණිස යන ප්‍රතිපදාව ය' යි ඇති සැටියෙන් දන්නේය. මෙසේ දන්නා, මෙසේ දක්නා ඔහුගේ සිත කාමාශ්‍රවයෙන්ද මිදෙන්නේය, භවාශ්‍රවයෙන්ද මිදෙන්නේය, අවිද්‍යාශ්‍රවයෙන්ද මිදෙන්නේය. මිදුණු කල්හි 'මිදුණේය' යන ඥානය ඇති වන්නේය. 'උපත ක්ෂය කරන ලදී, ශ්‍රේෂ්ඨ පැවැත්ම (බ්‍රහ්මචර්යාව) වසන ලදී, කළ යුතු දේ කරන ලදී, නැවත මේ තත්ත්වය පිණිස අන් කිසිවක් නැත' යි දන්නේය. මෙය ඔහුගේ අධිගත කරන ලද තුන්වන විද්‍යාව වන්නේය. මෙහිදී අවිද්‍යාව දුරු කරණ ලද්දේය, විද්‍යාව උපදින ලද්දේය. අඳුර දුරු කරන ලද්දේය, ආලෝකය උපදින ලද්දේය. මෙය අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, කැප වූ සිතින් වාසය කරන තැනැත්තාට සිදු වන්නාක් මෙනි.\n\nසිල්වත් වූ, වතින් යුක්ත වූ, කැපවූ සිතින් සමහිත වූ, යමෙකුගේ සිත වසඟ කොට ගත්තේද, ඒකාග්‍ර වූ, මනා කොට සමහිත වූ යමෙක් වේද, යමෙක් පෙර විසූ කඳ දන්නේද, ස්වර්ග හා අපාය දකින්නේ ද, එපමණක් නොව, ජාති ක්ෂය කළ, අභිඥාවන්ගෙන් කෙළවරට ගිය මුනිවරයා වේද, මේ තිදෙනා වූ විද්‍යාවන් කරණ කොටගෙන ඔහු ත්‍රිවිද්‍යාධර බ්‍රාහ්මණයා වන්නේය. මම ඔහු ත්‍රිවිද්‍යාධරයා යි කියමි; වෙනත් වචනවලින් කියවන අය නොවේ.\n\n\"බ්‍රාහ්මණය, ආර්ය විනයෙහි ත්‍රිවේදධරයා වන්නේ මෙසේය.\"\n\n\"භවත් ගෞතමයන් වහන්ස, බ්‍රාහ්මණයන්ගේ ත්‍රිවේදධරයා වන්නේ එක් ආකාරයකිනි. ආර්ය විනයෙහි ත්‍රිවේදධරයා වන්නේ වෙනත් ආකාරයකිනි. භවත් ගෞතමයන් වහන්ස, ආර්ය විනයෙහි මේ ත්‍රිවේදධරයාට බ්‍රාහ්මණයන්ගේ ත්‍රිවේදධරයාගේ සෝළොස්වන කොටසක්වත් වටින්නේ නැත.\" \"භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි ... (ආදී වශයෙන්) අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස භවත් ගෞතමයන් වහන්සේ මා පිළිගන්නා සේක්වා\" යි.",
      "paliTitle": "Jāṇussoṇisuttaṃ",
      "englishTitle": "The Discourse to Jāṇussoṇi",
      "sinhalaTitle": "ජාණුස්සෝණි සූත්‍රය"
    },
    {
      "number": 61,
      "pali": "Atha kho saṅgāravo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho saṅgāravo brāhmaṇo bhagavantaṃ etadavoca – ‘‘mayamassu, bho gotama, brāhmaṇā nāma. Yaññaṃ yajāmapi yajāpemapi. Tatra, bho gotama, yo ceva yajati [yo ceva yaññaṃ yajati (syā. kaṃ.)] yo ca yajāpeti sabbe te anekasārīrikaṃ puññappaṭipadaṃ paṭipannā honti, yadidaṃ yaññādhikaraṇaṃ. Yo panāyaṃ, bho gotama, yassa vā tassa vā kulā agārasmā anagāriyaṃ pabbajito ekamattānaṃ dameti, ekamattānaṃ sameti, ekamattānaṃ parinibbāpeti, evamassāyaṃ ekasārīrikaṃ puññappaṭipadaṃ paṭipanno hoti, yadidaṃ pabbajjādhikaraṇa’’nti. ‘‘Tena hi, brāhmaṇa, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, brāhmaṇa, idha tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So evamāha – ‘ethāyaṃ maggo ayaṃ paṭipadā yathāpaṭipanno ahaṃ anuttaraṃ brahmacariyogadhaṃ sayaṃ abhiññā sacchikatvā pavedemi; etha [etaṃ (ka.)], tumhepi tathā paṭipajjatha, yathāpaṭipannā tumhepi anuttaraṃ brahmacariyogadhaṃ sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti. Iti ayañceva [sayaṃ ceva (ka.)] satthā dhammaṃ deseti, pare ca tathatthāya paṭipajjanti, tāni kho pana honti anekānipi satāni anekānipi sahassāni anekānipi satasahassāni. ‘‘Taṃ kiṃ maññasi, brāhmaṇa, iccāyaṃ evaṃ sante ekasārīrikā vā puññappaṭipadā hoti anekasārīrikā vā, yadidaṃ pabbajjādhikaraṇa’’nti? ‘‘Iccāyampi [iccāyante (ka.)], bho gotama, evaṃ sante anekasārīrikā puññappaṭipadā hoti, yadidaṃ pabbajjādhikaraṇa’’nti. Evaṃ vutte āyasmā ānando saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘imāsaṃ te, brāhmaṇa, dvinnaṃ paṭipadānaṃ katamā paṭipadā khamati appatthatarā ca appasamārambhatarā ca mahapphalatarā ca mahānisaṃsatarā cā’’ti? Evaṃ vutte saṅgāravo brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘seyyathāpi bhavaṃ gotamo bhavaṃ cānando. Ete me pujjā, ete me pāsaṃsā’’ti. Dutiyampi kho āyasmā ānando saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘na kho tyāhaṃ, brāhmaṇa, evaṃ pucchāmi – ‘ke vā te pujjā ke vā te pāsaṃsā’ti? Evaṃ kho tyāhaṃ, brāhmaṇa, pucchāmi – ‘imāsaṃ te, brāhmaṇa, dvinnaṃ paṭipadānaṃ katamā paṭipadā khamati appatthatarā ca appasamārambhatarā ca mahapphalatarā ca mahānisaṃsatarā cā’’’ti? Dutiyampi kho saṅgāravo brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘seyyathāpi bhavaṃ gotamo bhavaṃ cānando. Ete me pujjā, ete me pāsaṃsā’’ti. Tatiyampi kho āyasmā ānando saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘na kho tyāhaṃ, brāhmaṇa, evaṃ pucchāmi – ‘ke vā te pujjā ke vā te pāsaṃsā’ti? Evaṃ kho tyāhaṃ, brāhmaṇa, pucchāmi – ‘imāsaṃ te, brāhmaṇa, dvinnaṃ paṭipadānaṃ katamā paṭipadā khamati appatthatarā ca appasamārambhatarā ca mahapphalatarā ca mahānisaṃsatarā cā’’’ti? Tatiyampi kho saṅgāravo brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘seyyathāpi bhavaṃ gotamo bhavaṃ cānando. Ete me pujjā, ete me pāsaṃsā’’ti. Atha kho bhagavato etadahosi – ‘‘yāva tatiyampi kho saṅgāravo brāhmaṇo ānandena sahadhammikaṃ pañhaṃ puṭṭho saṃsādeti [ma. ni. 1.337] no vissajjeti. Yaṃnūnāhaṃ parimoceyya’’nti. Atha kho bhagavā saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘kā nvajja, brāhmaṇa, rājantepure rājapurisānaṃ [rājaparisāyaṃ (sī. syā. kaṃ. pī.)] sannisinnānaṃ sannipatitānaṃ antarākathā udapādī’’ti? ‘‘Ayaṃ khvajja, bho gotama, rājantepure rājapurisānaṃ sannisinnānaṃ sannipatitānaṃ antarākathā udapādi – ‘pubbe sudaṃ appatarā ceva bhikkhū ahesuṃ bahutarā ca uttari manussadhammā iddhipāṭihāriyaṃ dassesuṃ; etarahi pana bahutarā ceva bhikkhū appatarā ca uttari manussadhammā iddhipāṭihāriyaṃ dassentī’ti. Ayaṃ khvajja, bho gotama, rājantepure rājapurisānaṃ sannisinnānaṃ sannipatitānaṃ antarākathā udapādī’’ti. [paṭi. ma. 3.30; dī. ni. 1.483] ‘‘Tīṇi kho imāni, brāhmaṇa, pāṭihāriyāni. Katamāni tīṇi? Iddhipāṭihāriyaṃ, ādesanāpāṭihāriyaṃ, anusāsanīpāṭihāriyaṃ. Katamañca, brāhmaṇa, iddhipāṭihāriyaṃ? Idha, brāhmaṇa, ekacco anekavihitaṃ iddhividhaṃ paccanubhoti – ‘ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake; udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasati [parāmasati (dī. ni. 1.484; paṭi. ma. 1.102] parimajjati, yāva brahmalokāpi kāyena vasaṃ vatteti’. Idaṃ vuccati, brāhmaṇa, iddhipāṭihāriyaṃ. ‘‘Katamañca, brāhmaṇa, ādesanāpāṭihāriyaṃ? Idha, brāhmaṇa, ekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. ‘‘Idha pana, brāhmaṇa, ekacco na heva kho nimittena ādisati, api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. ‘‘Idha pana, brāhmaṇa, ekacco na heva kho nimittena ādisati napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. ‘‘Idha pana, brāhmaṇa, ekacco na heva kho nimittena ādisati, napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, napi vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati, api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā imassa cittassa anantarā amuṃ nāma vitakkaṃ vitakkessatī’ti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. Idaṃ vuccati, brāhmaṇa, ādesanāpāṭihāriyaṃ. ‘‘Katamañca, brāhmaṇa, anusāsanīpāṭihāriyaṃ? Idha, brāhmaṇa, ekacco evamanusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’ti. Idaṃ vuccati, brāhmaṇa, anusāsanīpāṭihāriyaṃ. Imāni kho, brāhmaṇa, tīṇi pāṭihāriyāni. Imesaṃ te, brāhmaṇa, tiṇṇaṃ pāṭihāriyānaṃ katamaṃ pāṭihāriyaṃ khamati abhikkantatarañca paṇītatarañcā’’ti? ‘‘Tatra, bho gotama, yadidaṃ [yamidaṃ (syā. kaṃ. pī.)] pāṭihāriyaṃ idhekacco anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brāhmalokāpi kāyena vasaṃ vatteti, idaṃ, bho gotama, pāṭihāriyaṃ yova [yo ca (syā. kaṃ. pī. ka.)] naṃ karoti sova [soca ca (syā. kaṃ pī. ka.)] naṃ paṭisaṃvedeti, yova [yo ca (syā. kaṃ. pī. ka.)] naṃ karoti tasseva [tassameva (sī. ka.), tassa ceva (syā. kaṃ. pī.)] taṃ hoti. Idaṃ me, bho gotama, pāṭihāriyaṃ māyāsahadhammarūpaṃ viya khāyati. ‘‘Yampidaṃ, bho gotama, pāṭihāriyaṃ idhekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti, so bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. Idha pana, bho gotama, ekacco na heva kho nimittena ādisati, api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati…pe… napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati…pe… napi vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati, api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā imassa cittassa anantarā amhaṃ nāma vitakkaṃ vitakkessatī’ti, so bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. Idampi, bho gotama, pāṭihāriyaṃ yova naṃ karoti sova naṃ paṭisaṃvedeti, yova naṃ karoti tasseva taṃ hoti. Idampi me, bho gotama, pāṭihāriyaṃ māyāsahadhammarūpaṃ viya khāyati. ‘‘Yañca kho idaṃ, bho gotama, pāṭihāriyaṃ idhekacco evaṃ anusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’ti. Idameva, bho gotama, pāṭihāriyaṃ khamati imesaṃ tiṇṇaṃ pāṭihāriyānaṃ abhikkantatarañca paṇītatarañca. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāvasubhāsitamidaṃ bhotā gotamena imehi ca mayaṃ tīhi pāṭihāriyehi samannāgataṃ bhavantaṃ gotamaṃ dhārema. Bhavañhi gotamo anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti, bhavañhi gotamo avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā imassa cittassa anantarā amuṃ nāma vitakkaṃ vitakkessatī’ti. Bhavañhi gotamo evamanusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’’’ti. ‘‘Addhā kho tyāhaṃ, brāhmaṇa, āsajja upanīya vācā bhāsitā; api ca tyāhaṃ byākarissāmi. Ahañhi, brāhmaṇa, anekavihitaṃ iddhividhaṃ paccanubhomi…pe… yāva brahmalokāpi kāyena vasaṃ vattemi. Ahañhi, brāhmaṇa, avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāmi – ‘yathā imassa bhoto manosaṅkhārā paṇihitā, imassa cittassa anantarā amuṃ nāma vitakkaṃ vitakkessatī’ti. Ahañhi, brāhmaṇa, evamanusāsāmi – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’’’ti. ‘‘Atthi pana, bho gotama, añño ekabhikkhupi yo imehi tīhi pāṭihāriyehi samannāgato, aññatra bhotā gotamenā’’ti? ‘‘Na kho, brāhmaṇa, ekaṃyeva sataṃ na dve satāni na tīṇi satāni na cattāri satāni na pañca satāni, atha kho bhiyyova, ye [te (ka.) passa ma. ni. 2.195] bhikkhū imehi tīhi pāṭihāriyehi samannāgatā’’ti. ‘‘Kahaṃ pana, bho gotama, etarahi te bhikkhū viharantī’’ti? ‘‘Imasmiṃyeva kho, brāhmaṇa, bhikkhusaṅghe’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti, evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi, dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ. ",
      "english": "Then the Brahmin Saṅgārava approached the Exalted One; having approached, he exchanged pleasant greetings and memorable conversation with the Exalted One, and sat down to one side. Sitting to one side, the Brahmin Saṅgārava said to the Exalted One: “We, Master Gotama, are called Brahmins. We perform sacrifices and we cause sacrifices to be performed. Regarding that, Master Gotama, whoever performs the sacrifice and whoever causes it to be performed, all of them are following a path of merit involving many subjects, which is the sphere of the sacrifice. But this person, Master Gotama, who, from whatever family, goes forth from the home life into homelessness, who tames himself alone, calms himself alone, and achieves final liberation for himself alone—this person is following a path of merit involving only a single subject, which is the sphere of renunciation.”\n\n“In that case, Brahmin, I shall question you concerning this very matter. You should answer it just as you see fit. What do you think, Brahmin? Here, a Tathāgata arises in the world, Arahant, Perfectly Self-Awakened, endowed with knowledge and conduct, Sublime, Knower of the Worlds, Unsurpassed Leader of Persons to be Tamed, Teacher of gods and humans, the Awakened One, the Exalted One. He says: ‘Come, this is the path, this is the practice, by practicing which I, having directly known and realized the unshakable ultimate goal of the Holy Life, proclaim it. Come, you too should practice accordingly, so that by practicing thus, you too may realize for yourselves the unshakable ultimate goal of the Holy Life and dwell therein.’ Thus, the Teacher himself teaches the Dhamma, and others practice for that same goal. And those who practice may be many hundreds, many thousands, or many hundreds of thousands. What do you think, Brahmin? In that case, is this path of merit—the sphere of renunciation—one involving a single subject or one involving many subjects?”\n\n“In that case too, Master Gotama, this path of merit—the sphere of renunciation—is one involving many subjects.”\n\nWhen this was said, Venerable Ānanda said to the Brahmin Saṅgārava: “Of these two paths of practice, Brahmin, which path do you prefer, one that involves less toil and less strenuous effort, yields great fruit, and has great benefit?”\n\nWhen this was said, the Brahmin Saṅgārava replied to Venerable Ānanda: “Just as Master Gotama is revered, so too is Master Ānanda. They are both revered and praised by me.”\n\nA second time, Venerable Ānanda said to the Brahmin Saṅgārava: “I am not asking you, Brahmin, who you revere or who you praise. This is what I am asking you, Brahmin: ‘Of these two paths of practice, which path do you prefer, one that involves less toil and less strenuous effort, yields great fruit, and has great benefit?’”\n\nA second time, the Brahmin Saṅgārava replied to Venerable Ānanda: “Just as Master Gotama is revered, so too is Master Ānanda. They are both revered and praised by me.”\n\nA third time, Venerable Ānanda said to the Brahmin Saṅgārava: “I am not asking you, Brahmin, who you revere or who you praise. This is what I am asking you, Brahmin: ‘Of these two paths of practice, which path do you prefer, one that involves less toil and less strenuous effort, yields great fruit, and has great benefit?’”\n\nA third time, the Brahmin Saṅgārava replied to Venerable Ānanda: “Just as Master Gotama is revered, so too is Master Ānanda. They are both revered and praised by me.”\n\nThen the Exalted One thought: “The Brahmin Saṅgārava, though questioned three times by Ānanda on a point pertaining to the Doctrine, has evaded the question and has not answered it. What if I relieve him of this difficulty?”\n\nThen the Exalted One said to the Brahmin Saṅgārava: “Brahmin, what was the discussion that arose today among the royal officials gathered together and sitting in the inner court of the palace?”\n\n“This, Master Gotama, was the discussion that arose today among the royal officials gathered together and sitting in the inner court of the palace: ‘In the past, there were fewer monks, yet more of them displayed superhuman feats of psychic power. Now, however, there are more monks, but fewer of them display superhuman feats of psychic power.’ This, Master Gotama, was the discussion that arose today among the royal officials gathered together and sitting in the inner court of the palace.”\n\n“Brahmin, there are these three kinds of miracles. Which three? The miracle of psychic power, the miracle of telepathy, and the miracle of instruction. And what, Brahmin, is the miracle of psychic power?”\n\nHere, brahmin, someone experiences various forms of psychic power: being one person, they become many; being many, they become one. They appear and disappear. They pass through walls, ramparts, and mountains without obstruction, just as if in space. They plunge into and out of the earth, just as if in water. They walk on water without dividing it, just as if on earth. They travel cross-legged through the sky, just as a winged bird. They touch and stroke the moon and sun, which are so mighty and powerful, with their hand. They exert mastery over their own body even up to the Brahma-world. This, brahmin, is called the miracle of psychic power.\n\nAnd what, brahmin, is the miracle of manifestation based on knowledge of others' minds? Here, brahmin, someone divines by means of signs, saying: ‘Your mind is thus, your mind is in this state, your consciousness is of this kind.’ Even if they predict much, it happens exactly so, and not otherwise.\n\nFurthermore, brahmin, someone here does not divine by signs, but rather divines after hearing the sound of humans, non-humans, or deities, saying: ‘Your mind is thus, your mind is in this state, your consciousness is of this kind.’ Even if they predict much, it happens exactly so, and not otherwise.\n\nFurthermore, brahmin, someone here does not divine by signs, nor does they divine after hearing the sound of humans, non-humans, or deities, but rather divines after hearing the reverberation of thought-conceptions from one who is thinking and pondering, saying: ‘Your mind is thus, your mind is in this state, your consciousness is of this kind.’ Even if they predict much, it happens exactly so, and not otherwise.\n\nFurthermore, brahmin, someone here does not divine by signs, nor does they divine after hearing the sound of humans, non-humans, or deities, nor does they divine after hearing the reverberation of thought-conceptions from one who is thinking and pondering, but rather, penetrating the mind with his own mind, he discerns the mental formations of a person who has attained concentration devoid of initial and sustained thought, knowing: ‘According to the way this venerable one's mental formations are directed, immediately after this state of consciousness, they will conceive such-and-such a thought.’ Even if they predict much, it happens exactly so, and not otherwise. This, brahmin, is called the miracle of manifestation based on knowledge of others' minds.\n\nAnd what, brahmin, is the miracle of instruction? Here, brahmin, someone instructs thus: ‘Think in this way, do not think in that way; attend to the mind in this way, do not attend to the mind in that way; abandon this, attain and abide in this.’ This, brahmin, is called the miracle of instruction. These, brahmin, are the three miracles. Of these three miracles, brahmin, which miracle do you approve of as being far superior and more refined?\n\nRegarding the miracle where someone here experiences various forms of psychic power, up to exerting mastery over their own body even up to the Brahma-world: that miracle, Venerable Gotama, is only experienced by the one who performs it, and it pertains only to the one who performs it. This miracle seems to me like something associated with an illusory trick, Venerable Gotama. And regarding the miracle, Venerable Gotama, where someone here divines by signs, saying: ‘Your mind is thus, your mind is in this state, your consciousness is of this kind,’ and even if they predict much, it happens exactly so, and not otherwise; and furthermore, where someone here does not divine by signs, but rather divines after hearing the sound of humans, non-humans, or deities... nor does they divine after hearing the sound of humans, non-humans, or deities, but rather divines after hearing the reverberation of thought-conceptions from one who is thinking and pondering... nor does they divine after hearing the reverberation of thought-conceptions from one who is thinking and pondering, but rather, penetrating the mind with his own mind, he discerns the mental formations of a person who has attained concentration devoid of initial and sustained thought, knowing: ‘According to the way this venerable one's mental formations are directed, immediately after this state of consciousness, they will conceive such-and-such a thought,’ and even if they predict much, it happens exactly so, and not otherwise: this miracle too, Venerable Gotama, is only experienced by the one who performs it, and it pertains only to the one who performs it. This miracle also seems to me like something associated with an illusory trick, Venerable Gotama. But regarding the miracle, Venerable Gotama, where someone here instructs thus: ‘Think in this way, do not think in that way; attend to the mind in this way, do not attend to the mind in that way; abandon this, attain and abide in this’—this very miracle, Venerable Gotama, is the one I approve of as being far superior and more refined among these three miracles. Wonderful, Venerable Gotama! Extraordinary, Venerable Gotama!\n\nThis is excellently spoken by the esteemed Gotama, and we hold the esteemed Gotama as being possessed of these three wondrous displays. For the esteemed Gotama experiences manifold supernormal powers, exercising mastery over his body even up to the Brahma world. For the esteemed Gotama fully comprehends the mind of one who has attained concentration devoid of initial thought and sustained thought, encompassing that mind with his own mind, [knowing:] 'According to the intention set forth in the mental formations of this venerable one, immediately following this thought, he will conceive such-and-such a thought.' For the esteemed Gotama teaches thus: ‘Think in this way, do not think in that way; direct your attention in this way, do not direct your attention in that way; abandon this, and having attained this, dwell in it.’\n\n\"Assuredly, Brāhmaṇa, you have spoken words of high praise and close approach; nevertheless, I will make a declaration to you. For I, Brāhmaṇa, experience manifold supernormal powers... and I exercise mastery over my body even up to the Brahma world. For I, Brāhmaṇa, fully comprehend the mind of one who has attained concentration devoid of initial thought and sustained thought, encompassing that mind with my own mind, [knowing:] 'According to the intention set forth in the mental formations of this venerable one, immediately following this thought, he will conceive such-and-such a thought.' For I, Brāhmaṇa, teach thus: ‘Think in this way, do not think in that way; direct your attention in this way, do not direct your attention in that way; abandon this, and having attained this, dwell in it.’\"\n\n\"Is there, esteemed Gotama, even one other monk who is endowed with these three wondrous displays, apart from the esteemed Gotama himself?\"\n\n\"It is not merely one hundred, Brāhmaṇa, nor two hundred, nor three hundred, nor four hundred, nor five hundred, but rather there are more, monks who are endowed with these three wondrous displays.\"\n\n\"Where then, esteemed Gotama, do these monks currently dwell?\"\n\n\"Right here, Brāhmaṇa, in this very community of monks.\"\n\n\"Excellent, esteemed Gotama! Most excellent, esteemed Gotama! Just as, esteemed Gotama, one might set upright what was overturned, or reveal what was hidden, or point out the path to one who was lost, or hold up an oil lamp in the darkness so that those with sight might see forms, exactly so has the Dhamma been made manifest by the esteemed Gotama in various ways. I go for refuge to the esteemed Gotama, to the Dhamma, and to the Community of Monks. May the esteemed Gotama hold me as a lay follower who has gone for refuge from this day forth for as long as life shall last.\"",
      "sinhala": "ඉන්පසු සංගාරව බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වී, ප්‍රියශීලී වූ, සිහිකටයුතු කතා බහ නිමවා, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි සංගාරව බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ගෞතමයන් වහන්ස, අපි බ්‍රාහ්මණයෝ වෙමු. අපි යඥා පවත්වමු ද, අන් අය ලවා යඥා පවත්වවමු ද. එහි දී, ගෞතමයන් වහන්ස, යමෙක් යඥා පවත්වන්නේ ද, යමෙක් යඥා පවත්වවන්නේ ද, ඒ සියල්ලෝම බොහෝ ශරීර සම්බන්ධ පින්කම් මාර්ගයකට පිළිපන්නෝ වෙති, එනම් යඥා කටයුතු අරභයා ය. යම් කෙනෙක්, ගෞතමයන් වහන්ස, කවර හෝ කුලයකින් ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වී, එකම ආත්ම දමනය කරන්නේ ද, එකම ආත්මය සංසිඳුවන්නේ ද, එකම ආත්මය පිරිනිවන් පමුණුවන්නේ ද, මේ ආකාරයට ඔහු එක් ශරීරයක් පමණක් සම්බන්ධ පින්කම් මාර්ගයකට පිළිපන්නේ වේ, එනම් පැවිදි වීම අරභයා ය.”\n\n“එසේ නම්, බ්‍රාහ්මණය, මේ පිළිබඳව මම ඔබෙන්ම පෙරළා අසන්නෙමි. ඔබට රුචි වන පරිදි එය විස්තර කළ යුතු ය. බ්‍රාහ්මණය, ඔබ මේ ගැන කුමක් සිතන්නේ ද? මෙහි ලෝකයෙහි තථාගතයන් වහන්සේ පහළ වන සේක: ඒ රහතන් වහන්සේ, සම්මා සම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, නිරුත්තර වූ පුරුෂ දමනය කිරීමේ සාරථී, දෙවි මිනිසුන්ට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ ය. උන්වහන්සේ මෙසේ වදාරණ සේක: ‘එන්න, මේ මාර්ගය යි, මේ ප්‍රතිපදාව යි. යම් ප්‍රතිපදාවකට පිළිපන් මම උතුම් වූ බ්‍රහ්මචර්යාව තුළ මුල් බැස ගෙන, තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍රකාශ කරම් ද, එන්න, ඔබලා ද එලෙසින්ම පිළිපදින්න, යම් ප්‍රතිපදාවකට පිළිපන් ඔබලා ද උතුම් වූ බ්‍රහ්මචර්යාව තුළ මුල් බැස ගෙන, තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, එයට පැමිණ වාසය කරන්නේ ද.’ මෙසේ මේ ශාස්තෘවරයාණන් වහන්සේ ධර්මය දේශනා කරන සේක. අන්‍යයෝ ද ඒ අර්ථය පිණිස පිළිපදිති. ඔවුහු බොහෝ සිය ගණනක් ද, බොහෝ දහස් ගණනක් ද, බොහෝ ලක්ෂ ගණනක් ද වෙති. බ්‍රාහ්මණය, ඔබ මේ ගැන කුමක් සිතන්නේ ද? මෙසේ පවතින කල්හි, පැවිදි වීම අරභයා වූ මේ (ප්‍රතිපදාව) එක් ශරීරයක් සම්බන්ධ පින්කම් මාර්ගයක් ද, නැතහොත් බොහෝ ශරීර සම්බන්ධ පින්කම් මාර්ගයක් ද?”\n\n“ගෞතමයන් වහන්ස, මෙසේ පවතින කල්හි නම්, පැවිදි වීම අරභයා වූ එය ද බොහෝ ශරීර සම්බන්ධ පින්කම් මාර්ගයක් ම වේ.”\n\nමෙසේ පැවසූ විට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සංගාරව බ්‍රාහ්මණයාට මෙය කීවේය: “බ්‍රාහ්මණය, මේ ප්‍රතිපදා දෙකින් ඔබ කැමති වන්නේ කවර ප්‍රතිපදාවකට ද? අල්ප වූ අනර්ථ ඇති ද, අල්ප වූ ආරම්භක ක්‍රියා ඇති ද, මහත් ඵල ඇති ද, මහත් ආනිශංස ඇති ද?” මෙසේ පැවසූ විට සංගාරව බ්‍රාහ්මණයා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය කීවේය: “ගෞතමයන් වහන්සේ මෙන්ම ආනන්දයන් වහන්සේත් යම්සේ ද, ඒ දෙදෙනා මා විසින් පුදනු ලබන, මා විසින් ප්‍රශංසා කරනු ලබන අය වෙති.” දෙවන වරටත් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සංගාරව බ්‍රාහ්මණයාට මෙය කීවේය: “බ්‍රාහ්මණය, ‘ඔබ විසින් පුදනු ලබන්නේ කවරෙක් ද? ඔබ විසින් ප්‍රශංසා කරනු ලබන්නේ කවරෙක් ද?’ යි මම ඔබෙන් අසන්නේ නැත. බ්‍රාහ්මණය, මම ඔබෙන් මෙසේ අසමි: ‘බ්‍රාහ්මණය, මේ ප්‍රතිපදා දෙකින් ඔබ කැමති වන්නේ කවර ප්‍රතිපදාවකට ද? අල්ප වූ අනර්ථ ඇති ද, අල්ප වූ ආරම්භක ක්‍රියා ඇති ද, මහත් ඵල ඇති ද, මහත් ආනිශංස ඇති ද?’” දෙවන වරටත් සංගාරව බ්‍රාහ්මණයා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය කීවේය: “ගෞතමයන් වහන්සේ මෙන්ම ආනන්දයන් වහන්සේත් යම්සේ ද, ඒ දෙදෙනා මා විසින් පුදනු ලබන, මා විසින් ප්‍රශංසා කරනු ලබන අය වෙති.” තුන්වන වරටත් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සංගාරව බ්‍රාහ්මණයාට මෙය කීවේය: “බ්‍රාහ්මණය, ‘ඔබ විසින් පුදනු ලබන්නේ කවරෙක් ද? ඔබ විසින් ප්‍රශංසා කරනු ලබන්නේ කවරෙක් ද?’ යි මම ඔබෙන් අසන්නේ නැත. බ්‍රාහ්මණය, මම ඔබෙන් මෙසේ අසමි: ‘බ්‍රාහ්මණය, මේ ප්‍රතිපදා දෙකින් ඔබ කැමති වන්නේ කවර ප්‍රතිපදාවකට ද? අල්ප වූ අනර්ථ ඇති ද, අල්ප වූ ආරම්භක ක්‍රියා ඇති ද, මහත් ඵල ඇති ද, මහත් ආනිශංස ඇති ද?’” තුන්වන වරටත් සංගාරව බ්‍රාහ්මණයා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය කීවේය: “ගෞතමයන් වහන්සේ මෙන්ම ආනන්දයන් වහන්සේත් යම්සේ ද, ඒ දෙදෙනා මා විසින් පුදනු ලබන, මා විසින් ප්‍රශංසා කරනු ලබන අය වෙති.”\n\nඑවිට භාග්‍යවතුන් වහන්සේට මෙසේ සිතුණි: “තුන්වන වරටත් සංගාරව බ්‍රාහ්මණයාගෙන් ආනන්ද විසින් ධර්මයට අනුව ප්‍රශ්නය අසන ලද්දේ ද, ඔහු පැටලවී මිස නිවැරදිව විසඳුවේ නැත. මම මොහු ගැටලුවෙන් මුදවා ගත්තොත් හොඳ ය.” ඉන්පසු භාග්‍යවතුන් වහන්සේ සංගාරව බ්‍රාහ්මණයාට මෙය වදාළ සේක: “බ්‍රාහ්මණය, අද රාජකීය අන්තඃපුරයේ රැස්ව සිටින, එක්රැස් වී සිටින රාජ පුරුෂයන් අතර කුමන කතා බහක් ඇති වී ද?” “ගෞතමයන් වහන්ස, අද රාජකීය අන්තඃපුරයේ රැස්ව සිටින, එක්රැස් වී සිටින රාජ පුරුෂයන් අතර මේ කතා බහ ඇති විය: ‘පෙර කල නම් භික්ෂූන් වහන්සේලා ස්වල්ප දෙනෙක් වූහ. එහෙත් බොහෝ දෙනෙක් උසස් මනුෂ්‍ය ධර්ම වූ ඍද්ධි ප්‍රාතිහාර්යයන් දැක්වූහ. දැන් නම් භික්ෂූන් වහන්සේලා බොහෝ දෙනෙක් වෙති. එහෙත් උසස් මනුෂ්‍ය ධර්ම වූ ඍද්ධි ප්‍රාතිහාර්යයන් දක්වන්නේ ස්වල්ප දෙනෙක් ය.’ ගෞතමයන් වහන්ස, අද රාජකීය අන්තඃපුරයේ රැස්ව සිටින, එක්රැස් වී සිටින රාජ පුරුෂයන් අතර මේ කතා බහ ඇති විය.”\n\n“බ්‍රාහ්මණය, මේ ප්‍රාතිහාර්යයෝ තුනක් වෙති. ඒ තුන කවරේ ද? ඍද්ධි ප්‍රාතිහාර්යය, ආදේශනා ප්‍රාතිහාර්යය, අනුශාසනා ප්‍රාතිහාර්යය යි. බ්‍රාහ්මණය, ඍද්ධි ප්‍රාතිහාර්යය කවරේ ද?”\n\nබ්‍රාහ්මණය, මෙහිලා යම් පුද්ගලයෙක් නොයෙක් ආකාර වූ සෘද්ධිවිධ ප්‍රාතිහාර්යයන් අත්දක්නේ ය— ‘එකෙක් ව සිට බොහෝ වේ, බොහෝ ව සිට එකෙක් වේ; ප්‍රකට වීම, නොපෙනී යාම; බිත්ති, පවුරු, පර්වත හරහා අහසෙහි මෙන් නොඇලී යන්නේ ය; පොළොවෙහි ද ජලයෙහි මෙන් මතුවීම හා කිඳා බැසීම කරන්නේ ය; ජලයෙහි ද පොළොවෙහි මෙන් නොබිඳී යන්නේ ය; අහසෙහි ද පක්ෂියෙක් සේ පලක් බැඳ ගමන් කරන්නේ ය; මෙබඳු මහත් සෘද්ධි ඇති, මෙබඳු මහත් ආනුභාව ඇති හිරු සඳු ද අතින් පිරිමදින්නේ ය, පිරිමැද ගන්නේ ය. බ්‍රහ්ම ලෝකය දක්වා ද කයින් වසඟය පවත් වන්නේ ය.’ බ්‍රාහ්මණය, මෙය සෘද්ධි ප්‍රාතිහාර්ය යැයි කියනු ලැබේ.\n\n‘බ්‍රාහ්මණය, ආදේශනා ප්‍රාතිහාර්ය නම් කවරේ ද? බ්‍රාහ්මණය, මෙහිලා යම් පුද්ගලයෙක් නිමිත්තකින් කියන්නේ ය— ‘තොපගේ මනස මෙසේ ය, තොපගේ මනස එසේ ය, තොපගේ සිත මෙසේ ය’ කියා ය. හෙතෙම බොහෝ දේ කිව ද එය එසේම වන්නේ ය, අන් අයුරකින් නො වන්නේ ය.\n\nඑහෙත් බ්‍රාහ්මණය, මෙහිලා යම් පුද්ගලයෙක් නිමිත්තකින් පමණක්ම නො කියන්නේ ය, එසේ වුව ද මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දෙවියන්ගේ හෝ ශබ්දය අසා කියන්නේ ය— ‘තොපගේ මනස මෙසේ ය, තොපගේ මනස එසේ ය, තොපගේ සිත මෙසේ ය’ කියා ය. හෙතෙම බොහෝ දේ කිව ද එය එසේම වන්නේ ය, අන් අයුරකින් නො වන්නේ ය.\n\nතවද බ්‍රාහ්මණය, මෙහිලා යම් පුද්ගලයෙක් නිමිත්තකින් පමණක්ම නො කියන්නේ ය, මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දෙවියන්ගේ හෝ ශබ්දය අසා ද නො කියන්නේ ය, එසේ වුව ද විතර්ක කරන, විචාරය කරන කල්හි ඇතිවන විතර්ක කම්පනයේ ශබ්දය අසා කියන්නේ ය— ‘තොපගේ මනස මෙසේ ය, තොපගේ මනස එසේ ය, තොපගේ සිත මෙසේ ය’ කියා ය. හෙතෙම බොහෝ දේ කිව ද එය එසේම වන්නේ ය, අන් අයුරකින් නො වන්නේ ය.\n\nතවද බ්‍රාහ්මණය, මෙහිලා යම් පුද්ගලයෙක් නිමිත්තකින් පමණක්ම නො කියන්නේ ය, මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දෙවියන්ගේ හෝ ශබ්දය අසා ද නො කියන්නේ ය, විතර්ක කරන, විචාරය කරන කල්හි ඇතිවන විතර්ක කම්පනයේ ශබ්දය අසා ද නො කියන්නේ ය, එසේ වුව ද අවිතර්ක අවිචාර සමාධියට සමවන් තැනැත්තාගේ සිතින් සිත අවබෝධ කොට දැනගන්නේ ය— ‘මේ පින්වතාගේ මනෝ සංඛාර පිහිටා ඇති ආකාරය අනුව, මෙහි සිතට අනතුරුව, අසවල් නම් වූ විතර්කය විතර්ක කරන්නේ ය’ කියා ය. හෙතෙම බොහෝ දේ කිව ද එය එසේම වන්නේ ය, අන් අයුරකින් නො වන්නේ ය. බ්‍රාහ්මණය, මෙය ආදේශනා ප්‍රාතිහාර්ය යැයි කියනු ලැබේ.\n\n‘බ්‍රාහ්මණය, අනුශාසනී ප්‍රාතිහාර්ය නම් කවරේ ද? බ්‍රාහ්මණය, මෙහිලා යම් පුද්ගලයෙක් මෙසේ අනුශාසනා කරන්නේ ය— ‘මෙසේ විතර්ක කරව්, මෙසේ විතර්ක නො කරව්; මෙසේ මෙනෙහි කරව්, මෙසේ මෙනෙහි නො කරව්; මේවා දුරලව්, මේවා උපදවා වාසය කරව්’ කියා ය. බ්‍රාහ්මණය, මෙය අනුශාසනී ප්‍රාතිහාර්ය යැයි කියනු ලැබේ.\n\nබ්‍රාහ්මණය, මේවා තිදෙනා වනාහි ප්‍රාතිහාර්යයෝ වෙති. බ්‍රාහ්මණය, මේ ප්‍රාතිහාර්ය තුනෙන් කවර ප්‍රාතිහාර්යයක් තොපට වඩාත් උසස් ලෙස ද, වඩාත් ප්‍රණීත ලෙස ද රුචි වන්නේ දැ?\n\n‘භවත් ගෞතමයන් වහන්ස, එහිලා යම් ප්‍රාතිහාර්යයක් අරමුණු කොට මෙහිලා යම් පුද්ගලයෙක් නොයෙක් ආකාර වූ සෘද්ධිවිධ ප්‍රාතිහාර්යයන් අත්දක්නේ ද... බ්‍රහ්ම ලෝකය දක්වා ද කයින් වසඟය පවත් වන්නේ ද, භවත් ගෞතමයන් වහන්ස, මේ ප්‍රාතිහාර්යය වනාහි යමෙක් එය කරන්නේ ද, හෙතෙම ම එය අත්දක්නේ ය. යමෙක් එය කරන්නේ ද, එය හෙතෙමගේ ම වන්නේ ය. භවත් ගෞතමයන් වහන්ස, මේ ප්‍රාතිහාර්යය මට නම් මායාවකට සමාන වූ ස්වභාවයක් ඇත්තේ යැයි හැඟේ.\n\nභවත් ගෞතමයන් වහන්ස, යම් ප්‍රාතිහාර්යයක් අරමුණු කොට මෙහිලා යම් පුද්ගලයෙක් නිමිත්තකින් කියන්නේ ද— ‘තොපගේ මනස මෙසේ ය, තොපගේ මනස එසේ ය, තොපගේ සිත මෙසේ ය’ කියා ය, හෙතෙම බොහෝ දේ කිව ද එය එසේම වන්නේ ය, අන් අයුරකින් නො වන්නේ ය. එහෙත් භවත් ගෞතමයන් වහන්ස, මෙහිලා යම් පුද්ගලයෙක් නිමිත්තකින් පමණක්ම නො කියන්නේ ය, එසේ වුව ද මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දෙවියන්ගේ හෝ ශබ්දය අසා කියන්නේ ද... විතර්ක කරන, විචාරය කරන කල්හි ඇතිවන විතර්ක කම්පනයේ ශබ්දය අසා ද නො කියන්නේ ය, එසේ වුව ද අවිතර්ක අවිචාර සමාධියට සමවන් තැනැත්තාගේ සිතින් සිත අවබෝධ කොට දැනගන්නේ ද— ‘මේ පින්වතාගේ මනෝ සංඛාර පිහිටා ඇති ආකාරය අනුව, මෙහි සිතට අනතුරුව, අසවල් නම් වූ විතර්කය විතර්ක කරන්නේ ය’ කියා ය, හෙතෙම බොහෝ දේ කිව ද එය එසේම වන්නේ ය, අන් අයුරකින් නො වන්නේ ය. භවත් ගෞතමයන් වහන්ස, මේ ප්‍රාතිහාර්යය ද යමෙක් කරන්නේ ද, හෙතෙම ම එය අත්දක්නේ ය. යමෙක් එය කරන්නේ ද, එය හෙතෙමගේ ම වන්නේ ය. භවත් ගෞතමයන් වහන්ස, මේ ප්‍රාතිහාර්යය ද මට නම් මායාවකට සමාන වූ ස්වභාවයක් ඇත්තේ යැයි හැඟේ.\n\nයම් ප්‍රාතිහාර්යයක් අරමුණු කොට භවත් ගෞතමයන් වහන්ස, මෙහිලා යම් පුද්ගලයෙක් මෙසේ අනුශාසනා කරන්නේ ද— ‘මෙසේ විතර්ක කරව්, මෙසේ විතර්ක නො කරව්; මෙසේ මෙනෙහි කරව්, මෙසේ මෙනෙහි නො කරව්; මේවා දුරලව්, මේවා උපදවා වාසය කරව්’ කියා ය, භවත් ගෞතමයන් වහන්ස, ප්‍රාතිහාර්ය තුනෙන් වඩාත් උසස් වූ ද, වඩාත් ප්‍රණීත වූ ද ප්‍රාතිහාර්යය වනුයේ මේ අනුශාසනී ප්‍රාතිහාර්යය ම වන්නේ ය.\n\n‘භවත් ගෞතමයන් වහන්ස, ආශ්චර්යයකි. භවත් ගෞතමයන් වහන්ස, අද්භූතයකි!\n\nභාග්‍යවතුන් වහන්සේ විසින් මෙය කොතරම් නම් මැනවින් වදාළේ ද! භාග්‍යවත් ගෞතමයන් වහන්සේ මේ ත්‍රිවිධ ප්‍රාතිහාර්යයන්ගෙන් සමන්වාගත බව අපි දනිමු. ගෞතමයන් වහන්සේ නානාවිධ වූ සෘද්ධි ප්‍රභේද අත්දකිති. . . බ්‍රහ්ම ලෝකය දක්වාම කයින් වසඟ කොට වසති. භාග්‍යවත් ගෞතමයන් වහන්සේ විතර්ක රහිත වූ, විචාර රහිත වූ සමාධියට සමවන් තැනැත්තෙකුගේ සිත, තම සිතින් පරිච්ඡේද කොට මෙසේ දැනගනිති: 'යම්සේ මේ භවත් පුද්ගලයාගේ මනෝසංස්කාරයන් පිහිටා තිබේ ද, මේ සිතට අනතුරුව අසවල් නම් විතර්කය විතර්ක කරන්නේ ය' කියා. භාග්‍යවත් ගෞතමයන් වහන්සේ මෙසේ අනුශාසනා කරති: 'මේ ආකාරයෙන් විතර්ක කරන්න, මේ ආකාරයෙන් විතර්ක නොකරන්න; මේ ආකාරයෙන් මෙනෙහි කරන්න, මේ ආකාරයෙන් මෙනෙහි නොකරන්න; මේ දේ අත්හරින්න, මේ දේ උපසම්පදා කරගෙන වාසය කරන්න' කියා.\n\n\"පින්වත් බ්‍රාහ්මණය, ඔබ මා හට නිසැකයෙන්ම ලං වී, අභියෝග කොට වචනය කතා කළේ ය; එසේ වුවද මම ඔබට කරුණු පැහැදිලි කරන්නෙමි. පින්වත් බ්‍රාහ්මණය, මම නානාවිධ වූ සෘද්ධි ප්‍රභේද අත්දකිමි. . . බ්‍රහ්ම ලෝකය දක්වාම කයින් වසඟ කොට වසමි. පින්වත් බ්‍රාහ්මණය, මම විතර්ක රහිත වූ, විචාර රහිත වූ සමාධියට සමවන් තැනැත්තෙකුගේ සිත, තම සිතින් පරිච්ඡේද කොට මෙසේ දැනගනිමි: 'යම්සේ මේ භවත් පුද්ගලයාගේ මනෝසංස්කාරයන් පිහිටා තිබේ ද, මේ සිතට අනතුරුව අසවල් නම් විතර්කය විතර්ක කරන්නේ ය' කියා. පින්වත් බ්‍රාහ්මණය, මම මෙසේ අනුශාසනා කරමි: 'මේ ආකාරයෙන් විතර්ක කරන්න, මේ ආකාරයෙන් විතර්ක නොකරන්න; මේ ආකාරයෙන් මෙනෙහි කරන්න, මේ ආකාරයෙන් මෙනෙහි නොකරන්න; මේ දේ අත්හරින්න, මේ දේ උපසම්පදා කරගෙන වාසය කරන්න' කියා.\"\n\n\"භවත් ගෞතමයන් වහන්ස, භවත් ගෞතමයන් වහන්සේ හැර, මේ ත්‍රිවිධ ප්‍රාතිහාර්යයන්ගෙන් සමන්වාගත වූ වෙනත් එක් භික්ෂුවක් හෝ සිටී දැ?\" යි.\n\n\"පින්වත් බ්‍රාහ්මණය, එක් සියයක් පමණක් නොව, දෙසියයක්, තුන්සියයක්, හාරසියයක්, පන්සියයක් පමණක් නොව, ඊටත් වඩා වැඩියෙන් භික්ෂූන් වහන්සේලා මේ ත්‍රිවිධ ප්‍රාතිහාර්යයන්ගෙන් සමන්වාගතව සිටිති.\"\n\n\"එසේ නම් භවත් ගෞතමයන් වහන්ස, ඒ භික්ෂූන් වහන්සේලා දැන් කොතැනක වාසය කරන්නාහු දැ?\" යි.\n\n\"පින්වත් බ්‍රාහ්මණය, මේ භික්ෂුසංඝයා තුළම යි.\"\n\n\"භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, යම්සේ යමෙක් යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වසා තිබූ දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේ ද, නැතහොත් 'ඇස් ඇති අය රූප දකිත්වා' යි අන්ධකාරයේ තෙල් පහනක් දරන්නේ ද, එපරිද්දෙන්ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරන ලදී. මම ඒ භාග්‍යවත් ගෞතමයන් වහන්සේත්, ධර්මයත්, භික්ෂුසංඝයාත් සරණ යන බව ප්‍රකාශ කරමි. භාග්‍යවත් ගෞතමයන් වහන්සේ අද පටන් මා දිවි තිබෙන තුරා සරණ ගිය උපාසකයෙකු ලෙස පිළිගත මැනව.\"",
      "paliTitle": "Saṅgāravasuttaṃ",
      "englishTitle": "The Discourse to Saṅgārava",
      "sinhalaTitle": "සංගාරව සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Brāhmaṇavaggo paṭhamo. Tassuddānaṃ – Dve brāhmaṇā caññataro, paribbājakena nibbutaṃ; Palokavaccho tikaṇṇo, soṇi saṅgāravena cāti.",
    "english": "",
    "sinhala": ""
  }
}