{
  "id": "an3.16",
  "title": {
    "pali": "Acelakavaggo",
    "english": "The Chapter on Naked Ascetics",
    "sinhala": "අචේලක වග්ගය"
  },
  "sections": [
    {
      "number": 157,
      "numberRange": "157-163",
      "pali": "‘‘Tisso imā, bhikkhave, paṭipadā. Katamā tisso? Āgāḷhā paṭipadā, nijjhāmā paṭipadā, majjhimā paṭipadā. Katamā ca, bhikkhave, āgāḷhā paṭipadā? Idha, bhikkhave, ekacco evaṃvādī hoti evaṃdiṭṭhi – ‘natthi kāmesu doso’ti. So kāmesu pātabyataṃ āpajjati. Ayaṃ vuccati, bhikkhave, āgāḷhā paṭipadā. ‘‘Katamā ca, bhikkhave, nijjhāmā paṭipadā? Idha, bhikkhave, ekacco acelako hoti muttācāro, hatthāpalekhano [hatthāvalekhano (syā. kaṃ.) dī. ni. 1.394; ma. ni. 1.155 passitabbaṃ], na ehibhadantiko, na tiṭṭhabhadantiko, nābhihaṭaṃ na uddissakataṃ na nimantanaṃ sādiyati. So na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā [khaḷopimukhā (sī. syā. kaṃ.)] paṭiggaṇhāti na eḷakamantaraṃ na daṇḍamantaraṃ na musalamantaraṃ na dvinnaṃ bhuñjamānānaṃ na gabbhiniyā na pāyamānāya na purisantaragatāya na saṅkittīsu na yattha sā upaṭṭhito hoti na yattha makkhikā saṇḍasaṇḍacārinī na macchaṃ na maṃsaṃ na suraṃ na merayaṃ, na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko, dvāgāriko vā hoti dvālopiko… sattāgāriko vā hoti sattālopiko; ekissāpi dattiyā yāpeti, dvīhipi dattīhi yāpeti… sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti, dvāhikampi āhāraṃ āhāreti… sattāhikampi āhāraṃ āhāreti – iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. So sākabhakkhopi hoti, sāmākabhakkhopi hoti, nīvārabhakkhopi hoti, daddulabhakkhopi hoti, haṭabhakkhopi hoti, kaṇhabhakkhopi hoti, ācāmabhakkhopi hoti, piññākabhakkhopi hoti, tiṇabhakkhopi hoti, gomayabhakkhopi hoti, vanamūlaphalāhāro yāpeti pavattaphalabhojī. So sāṇānipi dhāreti, masāṇānipi dhāreti, chavadussānipi dhāreti, paṃsukūlānipi dhāreti, tirīṭānipi dhāreti, ajinampi dhāreti, ajinakkhipampi dhāreti, kusacīrampi dhāreti, vākacīrampi dhāreti, phalakacīrampi dhāreti, kesakambalampi dhāreti, vāḷakambalampi dhāreti, ulūkapakkhikampi dhāreti, kesamassulocakopi hoti kesamassulocanānuyogamanuyutto, ubbhaṭṭhakopi hoti āsanapaṭikkhitto, ukkuṭikopi hoti ukkuṭikappadhānamanuyutto, kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti, sāyatatiyakampi udakorohanānuyogamanuyutto viharati – iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto viharati. Ayaṃ vuccati, bhikkhave, nijjhāmā paṭipadā. ‘‘Katamā ca, bhikkhave, majjhimā paṭipadā? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Ayaṃ vuccati, bhikkhave, majjhimā paṭipadā. Imā kho, bhikkhave, tisso paṭipadā’’ti. ‘‘Tisso imā, bhikkhave, paṭipadā. Katamā tisso? Āgāḷhā paṭipadā, nijjhāmā paṭipadā, majjhimā paṭipadā. Katamā ca, bhikkhave, āgāḷhā paṭipadā…pe… ayaṃ vuccati, bhikkhave, āgāḷhā paṭipadā. ‘‘Katamā ca, bhikkhave, nijjhāmā paṭipadā…pe… ayaṃ vuccati, bhikkhave, nijjhāmā paṭipadā. ‘‘Katamā ca, bhikkhave, majjhimā paṭipadā? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…. ‘‘Chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti…pe…. ‘‘Saddhindriyaṃ bhāveti… vīriyindriyaṃ bhāveti… satindriyaṃ bhāveti… samādhindriyaṃ bhāveti… paññindriyaṃ bhāveti…. ‘‘Saddhābalaṃ bhāveti… vīriyabalaṃ bhāveti… satibalaṃ bhāveti… samādhibalaṃ bhāveti… paññābalaṃ bhāveti…. ‘‘Satisambojjhaṅgaṃ bhāveti… dhammavicayasambojjhaṅgaṃ bhāveti… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti…. ‘‘Sammādiṭṭhiṃ bhāveti… sammāsaṅkappaṃ bhāveti… sammāvācaṃ bhāveti… sammākammantaṃ bhāveti … sammāājīvaṃ bhāveti… sammāvāyāmaṃ bhāveti… sammāsatiṃ bhāveti… sammāsamādhiṃ bhāveti…. Ayaṃ vuccati, bhikkhave, majjhimā paṭipadā. Imā kho, bhikkhave, tisso paṭipadā’’ti. ",
      "english": "There are these three paths, Bhikkhus. Which are these three? The path of addiction, the path of self-mortification, and the Middle Path.\n\nWhich, Bhikkhus, is the path of addiction? Here, Bhikkhus, someone holds such a view and such a doctrine: ‘There is no fault in sensual pleasures.’ He falls into the habit of indulging in sensual pleasures. This is called, Bhikkhus, the path of addiction.\n\nWhich, Bhikkhus, is the path of self-mortification? Here, Bhikkhus, someone is unclothed, of unconventional conduct, licking food from his hands, not one who accepts food saying ‘come, good sir!’ or ‘stop, good sir!’, nor does he accept food brought specifically for him, not prepared specifically for him, nor by invitation. He does not accept food from a pot’s mouth, nor from a pan’s mouth, not where there is a door-bar, not where there is a stick, not where there is a pestle, not from two people eating, not from a pregnant woman, not from a nursing woman, not from a woman with a man between her and the giver, not at a collection, not where a dog is standing, not where flies are swarming, nor does he eat fish, nor meat, nor drink intoxicating liquor, nor fermented liquor, nor rice-gruel. He lives eating one mouthful of food, having visited only one house; or two mouthfuls, having visited two houses; or three mouthfuls, having visited three houses; or four mouthfuls, having visited four houses; or five mouthfuls, having visited five houses; or six mouthfuls, having visited six houses; or seven mouthfuls, having visited seven houses. He sustains himself with one donation of food; or two donations of food; or three donations of food; or four donations of food; or five donations of food; or six donations of food; or seven donations of food. He eats food once every day; or once every two days; or once every three days; or once every four days; or once every five days; or once every six days; or once every seven days. Thus, he lives devoted to such a regimen of eating food at intervals, even up to half a month. He eats vegetables; he eats millet; he eats wild rice; he eats leather scraps; he eats rice husks; he eats rice bran; he eats scum; he eats oil-cake; he eats grass; he eats cow dung. He sustains himself on roots and fruits from the forest, eating only fallen fruits. He wears clothes made of hemp; he wears clothes made of coarse hemp; he wears shrouds from corpses; he wears rag-robes from dust heaps; he wears clothes made of tree bark; he wears antelope hide; he wears a strip of antelope hide; he wears clothes made of kusa grass; he wears clothes made of bark; he wears clothes made of wood shavings; he wears a blanket of human hair; he wears a blanket of horsehair; he wears a blanket of owl feathers. He is one who plucks out his hair and beard, devoted to the practice of plucking out his hair and beard; he is one who stands up, refusing a seat; he is one who squats, devoted to the practice of squatting; he is one who sleeps on a bed of thorns, making his bed on thorns; he lives devoted to the practice of descending into water for the third time at evening. Thus, he lives devoted to manifold practices of heating and tormenting the body. This is called, Bhikkhus, the path of self-mortification.\n\nWhich, Bhikkhus, is the Middle Path? Here, Bhikkhus, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having put away covetousness and distress concerning the world. He dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having put away covetousness and distress concerning the world. He dwells contemplating consciousness in consciousness, ardent, clearly comprehending, and mindful, having put away covetousness and distress concerning the world. He dwells contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having put away covetousness and distress concerning the world. This is called, Bhikkhus, the Middle Path.\n\nThese, Bhikkhus, are the three paths. There are these three paths, Bhikkhus. Which are these three? The path of addiction, the path of self-mortification, and the Middle Path. Which, Bhikkhus, is the path of addiction? Here, Bhikkhus, someone holds such a view and such a doctrine: ‘There is no fault in sensual pleasures.’ He falls into the habit of indulging in sensual pleasures. This is called, Bhikkhus, the path of addiction. Which, Bhikkhus, is the path of self-mortification? Here, Bhikkhus, someone is unclothed, of unconventional conduct, licking food from his hands, not one who accepts food saying ‘come, good sir!’ or ‘stop, good sir!’, nor does he accept food brought specifically for him, not prepared specifically for him, nor by invitation. He does not accept food from a pot’s mouth, nor from a pan’s mouth, not where there is a door-bar, not where there is a stick, not where there is a pestle, not from two people eating, not from a pregnant woman, not from a nursing woman, not from a woman with a man between her and the giver, not at a collection, not where a dog is standing, not where flies are swarming, nor does he eat fish, nor meat, nor drink intoxicating liquor, nor fermented liquor, nor rice-gruel. He lives eating one mouthful of food, having visited only one house; or two mouthfuls, having visited two houses; or three mouthfuls, having visited three houses; or four mouthfuls, having visited four houses; or five mouthfuls, having visited five houses; or six mouthfuls, having visited six houses; or seven mouthfuls, having visited seven houses. He sustains himself with one donation of food; or two donations of food; or three donations of food; or four donations of food; or five donations of food; or six donations of food; or seven donations of food. He eats food once every day; or once every two days; or once every three days; or once every four days; or once every five days; or once every six days; or once every seven days. Thus, he lives devoted to such a regimen of eating food at intervals, even up to half a month. He eats vegetables; he eats millet; he eats wild rice; he eats leather scraps; he eats rice husks; he eats rice bran; he eats scum; he eats oil-cake; he eats grass; he eats cow dung. He sustains himself on roots and fruits from the forest, eating only fallen fruits. He wears clothes made of hemp; he wears clothes made of coarse hemp; he wears shrouds from corpses; he wears rag-robes from dust heaps; he wears clothes made of tree bark; he wears antelope hide; he wears a strip of antelope hide; he wears clothes made of kusa grass; he wears clothes made of bark; he wears clothes made of wood shavings; he wears a blanket of human hair; he wears a blanket of horsehair; he wears a blanket of owl feathers. He is one who plucks out his hair and beard, devoted to the practice of plucking out his hair and beard; he is one who stands up, refusing a seat; he is one who squats, devoted to the practice of squatting; he is one who sleeps on a bed of thorns, making his bed on thorns; he lives devoted to the practice of descending into water for the third time at evening. Thus, he lives devoted to manifold practices of heating and tormenting the body. This is called, Bhikkhus, the path of self-mortification.\n\nWhich, Bhikkhus, is the Middle Path? Here, Bhikkhus, a bhikkhu generates desire for the non-arising of unarisen evil, unwholesome states; he endeavors, arouses energy, exerts his mind, and strives. He generates desire for the abandonment of arisen evil, unwholesome states; he endeavors, arouses energy, exerts his mind, and strives. He generates desire for the arising of unarisen wholesome states; he endeavors, arouses energy, exerts his mind, and strives. He generates desire for the maintenance, non-decay, increase, proliferation, development, and perfection of arisen wholesome states; he endeavors, arouses energy, exerts his mind, and strives.\n\nHe develops the base of spiritual power endowed with concentration due to desire and volitional formations of exertion. He develops the base of spiritual power endowed with concentration due to energy and volitional formations of exertion. He develops the base of spiritual power endowed with concentration due to consciousness and volitional formations of exertion. He develops the base of spiritual power endowed with concentration due to investigation and volitional formations of exertion.\n\nHe develops the faculty of faith. He develops the faculty of energy. He develops the faculty of mindfulness. He develops the faculty of concentration. He develops the faculty of wisdom.\n\nHe develops the power of faith. He develops the power of energy. He develops the power of mindfulness. He develops the power of concentration. He develops the power of wisdom.\n\nHe develops the awakening factor of mindfulness. He develops the awakening factor of investigation of phenomena. He develops the awakening factor of energy. He develops the awakening factor of rapture. He develops the awakening factor of tranquility. He develops the awakening factor of concentration. He develops the awakening factor of equanimity.\n\nOne develops right view, one develops right intention, one develops right speech, one develops right action, one develops right livelihood, one develops right effort, one develops right mindfulness, one develops right concentration. This, monks, is called the Middle Way. These, monks, are the three paths.",
      "sinhala": "භික්ෂූනි, මේ ප්‍රතිපත්ති තුනකි. ඒ තුන කවරේද? ආගාළ්හා ප්‍රතිපදාව, නිජ්ජාමා ප්‍රතිපදාව, මජ්ඣිමා ප්‍රතිපදාව.\n\nභික්ෂූනි, ආගාළ්හා ප්‍රතිපදාව කවරේද? භික්ෂූනි, මෙහිලා ඇතැම් අය ‘කාමයන්හි දෝෂයක් නැත’ යනුවෙන් මෙබඳු වචන ඇති, මෙබඳු දෘෂ්ටි ඇති කෙනෙක් වෙති. ඔහු කාමයන්හි ගැලී විඳීමෙහි යෙදෙයි. භික්ෂූනි, මෙය ආගාළ්හා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, නිජ්ජාමා ප්‍රතිපදාව කවරේද? භික්ෂූනි, මෙහිලා ඇතැම් අය වස්ත්‍ර රහිතව හැසිරෙන, කිසිදු සිරිත් විරිත් නොපිළිගන්නා, දෑතින් ආහාර ලෙව කන, ‘එනු මැන ස්වාමීනි’ යැයි කීවිට නොයන, ‘නවතින්න ස්වාමීනි’ යැයි කීවිට නොනැවතෙන, තමා වෙත ගෙනා දෑ, තමා වෙනුවෙන් සකස් කළ දෑ, ආරාධනා කොට පිරිනමන දෑ නොපිළිගන්නා කෙනෙක් වෙති. ඔහු භාජන මුඛයෙන් නොපිළිගනියි, හැළි මුඛයෙන් නොපිළිගනියි, එළුවන් අතරින් නොපිළිගනියි, දඬු අතරින් නොපිළිගනියි, මුසල් අතරින් නොපිළිගනියි, දෙදෙනෙකු කන තැනින් නොපිළිගනියි, ගැබිණියකගෙන් නොපිළිගනියි, කිරි බොන දරුවන් ඇති මවකගෙන් නොපිළිගනියි, පිරිමියන් අතරින් ගිය තැනැත්තියකගෙන් නොපිළිගනියි, කලබලකාරී තැන්වලින් නොපිළිගනියි, බල්ලන් සිටින තැනින් නොපිළිගනියි, මැස්සන් රංචු වශයෙන් ගැවසෙන තැනින් නොපිළිගනියි, මාළු නොකයි, මස් නොකයි, මත්පැන් නොබොයි, සුරා නොබොයි, නිවුඩු වතුර නොබොයි. ඔහු එක් නිවෙසකින් පමණක් ආහාර සොයා ගනියි, එක් පිඬක් පමණක් ගනියි, නැතහොත් නිවෙස් දෙකකින් ආහාර සොයා ගනියි, පිඬු දෙකක් පමණක් ගනියි, නැතහොත් නිවෙස් තුනකින් ආහාර සොයා ගනියි, පිඬු තුනක් පමණක් ගනියි, නැතහොත් නිවෙස් හතරකින් ආහාර සොයා ගනියි, පිඬු හතරක් පමණක් ගනියි, නැතහොත් නිවෙස් පහකින් ආහාර සොයා ගනියි, පිඬු පහක් පමණක් ගනියි, නැතහොත් නිවෙස් හයකින් ආහාර සොයා ගනියි, පිඬු හයක් පමණක් ගනියි, නැතහොත් නිවෙස් හතකින් ආහාර සොයා ගනියි, පිඬු හතක් පමණක් ගනියි. ඔහු එක් දානයකින් ද ජීවත් වෙයි, දාන දෙකකින් ද ජීවත් වෙයි, දාන තුනකින් ද ජීවත් වෙයි, දාන හතරකින් ද ජීවත් වෙයි, දාන පහකින් ද ජීවත් වෙයි, දාන හයකින් ද ජීවත් වෙයි, දාන හතකින් ද ජීවත් වෙයි. ඔහු එක් දිනක් පමණක් ආහාර ගනියි, දින දෙකක් පමණක් ආහාර ගනියි, දින තුනක් පමණක් ආහාර ගනියි, දින හතරක් පමණක් ආහාර ගනියි, දින පහක් පමණක් ආහාර ගනියි, දින හයක් පමණක් ආහාර ගනියි, දින හතක් පමණක් ආහාර ගනියි. මෙසේ ඔහු අඩ මසක් වැනි කලක් වාරයෙන් වාරයට ආහාර භෝජනයෙහි යෙදෙන අනුයෝගයෙහි නිරතව වාසය කරයි. ඔහු එළවළු පමණක් අනුභව කරන කෙනෙක් වෙයි, ශාමක ධාන්‍ය පමණක් අනුභව කරන කෙනෙක් වෙයි, නීවාර ධාන්‍ය පමණක් අනුභව කරන කෙනෙක් වෙයි, ලපටි බත් පමණක් අනුභව කරන කෙනෙක් වෙයි, දිරාගිය බත් පමණක් අනුභව කරන කෙනෙක් වෙයි, කළු බත් පමණක් අනුභව කරන කෙනෙක් වෙයි, කැඳ පෙරා ඉතිරි වූ දේ පමණක් අනුභව කරන කෙනෙක් වෙයි, තලපිටි පමණක් අනුභව කරන කෙනෙක් වෙයි, තණකොළ පමණක් අනුභව කරන කෙනෙක් වෙයි, ගොම පමණක් අනුභව කරන කෙනෙක් වෙයි, වනයෙහි ඇති මුල් හා පලතුරු අනුභව කරමින්, ඉබේ හටගත් පලතුරු අනුභව කරමින් ජීවත් වෙයි. ඔහු හණ වස්ත්‍ර ද අඳියි, මිශ්‍ර රෙදි ද අඳියි, මළ මිනී ඔතන ලද රෙදි ද අඳියි, පැන්සකුලික චීවර ද අඳියි, ගස් පොතු වැනි රෙදි ද අඳියි, මුව හම් ද අඳියි, මුව හම් කැබලි ද අඳියි, කුස තණ පටල ද අඳියි, ගස් පොතු චීවර ද අඳියි, ලී කැබලි වැනි චීවර ද අඳියි, කෙස්වලින් සෑදූ කම්බිලි ද අඳියි, සතුන්ගේ ලොම්වලින් සෑදූ කම්බිලි ද අඳියි, බකමුණන්ගේ පිහාටු ද අඳියි. කෙස් හා රැවුල් උදුරන කෙනෙක් වෙයි, කෙස් හා රැවුල් උදුරන අනුයෝගයෙහි නිරතවෙයි. හිටගෙන සිටින කෙනෙක් වෙයි, ආසන ප්‍රතික්ෂේප කොට සිටියි. උක්කුටිකාසනයෙන් සිටින කෙනෙක් වෙයි, උක්කුටිකාසනයෙන් සිටින ව්‍යායාමයෙහි නිරත වෙයි. කටු ඇති තැන්වල නිදන කෙනෙක් වෙයි, කටු ඇති තැන්වල සයනය කරයි. තුන්වන දවස වන විට වතුරට බසින අනුයෝගයෙහි නිරතව වාසය කරයි. මෙසේ ඔහු නොයෙක් අයුරින් ශරීරය තවන, ශරීරය පීඩා කරන අනුයෝගයෙහි නිරතව වාසය කරයි. භික්ෂූනි, මෙය නිජ්ජාමා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, මජ්ඣිමා ප්‍රතිපදාව කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුව තපස් ඇතිව, නුවණින් යුතුව, සිහි ඇතිව, ලෝකයෙහි ඇති අධිච්ඡාවන් සහ දොම්නස් දුරු කොට, කයෙහි කය අනුව බලමින් වාසය කරයි; වේදනාවන්හි වේදනා අනුව බලමින් වාසය කරයි, තපස් ඇතිව, නුවණින් යුතුව, සිහි ඇතිව, ලෝකයෙහි ඇති අධිච්ඡාවන් සහ දොම්නස් දුරු කොට; සිතෙහි සිත අනුව බලමින් වාසය කරයි, තපස් ඇතිව, නුවණින් යුතුව, සිහි ඇතිව, ලෝකයෙහි ඇති අධිච්ඡාවන් සහ දොම්නස් දුරු කොට; ධර්මයන්හි ධර්මයන් අනුව බලමින් වාසය කරයි, තපස් ඇතිව, නුවණින් යුතුව, සිහි ඇතිව, ලෝකයෙහි ඇති අධිච්ඡාවන් සහ දොම්නස් දුරු කොට. භික්ෂූනි, මෙය මජ්ඣිමා ප්‍රතිපදාව යැයි කියනු ලැබේ. භික්ෂූනි, මේ ප්‍රතිපත්ති තුන වේ.\n\nභික්ෂූනි, මේ ප්‍රතිපත්ති තුනකි. ඒ තුන කවරේද? ආගාළ්හා ප්‍රතිපදාව, නිජ්ජාමා ප්‍රතිපදාව, මජ්බිමා ප්‍රතිපදාව. භික්ෂූනි, ආගාළ්හා ප්‍රතිපදාව කවරේද? භික්ෂූනි, මෙහිලා ඇතැම් අය ‘කාමයන්හි දෝෂයක් නැත’ යනුවෙන් මෙබඳු වචන ඇති, මෙබඳු දෘෂ්ටි ඇති කෙනෙක් වෙති. ඔහු කාමයන්හි ගැලී විඳීමෙහි යෙදෙයි. භික්ෂූනි, මෙය ආගාළ්හා ප්‍රතිපදාව යැයි කියනු ලැබේ. භික්ෂූනි, නිජ්ජාමා ප්‍රතිපදාව කවරේද? භික්ෂූනි, මෙහිලා ඇතැම් අය වස්ත්‍ර රහිතව හැසිරෙන, කිසිදු සිරිත් විරිත් නොපිළිගන්නා, දෑතින් ආහාර ලෙව කන, ‘එනු මැන ස්වාමීනි’ යැයි කීවිට නොයන, ‘නවතින්න ස්වාමීනි’ යැයි කීවිට නොනැවතෙන, තමා වෙත ගෙනා දෑ, තමා වෙනුවෙන් සකස් කළ දෑ, ආරාධනා කොට පිරිනමන දෑ නොපිළිගන්නා කෙනෙක් වෙති. ඔහු භාජන මුඛයෙන් නොපිළිගනියි, හැළි මුඛයෙන් නොපිළිගනියි, එළුවන් අතරින් නොපිළිගනියි, දඬු අතරින් නොපිළිගනියි, මුසල් අතරින් නොපිළිගනියි, දෙදෙනෙකු කන තැනින් නොපිළිගනියි, ගැබිණියකගෙන් නොපිළිගනියි, කිරි බොන දරුවන් ඇති මවකගෙන් නොපිළිගනියි, පිරිමියන් අතරින් ගිය තැනැත්තියකගෙන් නොපිළිගනියි, කලබලකාරී තැන්වලින් නොපිළිගනියි, බල්ලන් සිටින තැනින් නොපිළිගනියි, මැස්සන් රංචු වශයෙන් ගැවසෙන තැනින් නොපිළිගනියි, මාළු නොකයි, මස් නොකයි, මත්පැන් නොබොයි, සුරා නොබොයි, නිවුඩු වතුර නොබොයි. ඔහු එක් නිවෙසකින් පමණක් ආහාර සොයා ගනියි, එක් පිඬක් පමණක් ගනියි, නැතහොත් නිවෙස් දෙකකින් ආහාර සොයා ගනියි, පිඬු දෙකක් පමණක් ගනියි, නැතහොත් නිවෙස් තුනකින් ආහාර සොයා ගනියි, පිඬු තුනක් පමණක් ගනියි, නැතහොත් නිවෙස් හතරකින් ආහාර සොයා ගනියි, පිඬු හතරක් පමණක් ගනියි, නැතහොත් නිවෙස් පහකින් ආහාර සොයා ගනියි, පිඬු පහක් පමණක් ගනියි, නැතහොත් නිවෙස් හයකින් ආහාර සොයා ගනියි, පිඬු හයක් පමණක් ගනියි, නැතහොත් නිවෙස් හතකින් ආහාර සොයා ගනියි, පිඬු හතක් පමණක් ගනියි. ඔහු එක් දානයකින් ද ජීවත් වෙයි, දාන දෙකකින් ද ජීවත් වෙයි, දාන තුනකින් ද ජීවත් වෙයි, දාන හතරකින් ද ජීවත් වෙයි, දාන පහකින් ද ජීවත් වෙයි, දාන හයකින් ද ජීවත් වෙයි, දාන හතකින් ද ජීවත් වෙයි. ඔහු එක් දිනක් පමණක් ආහාර ගනියි, දින දෙකක් පමණක් ආහාර ගනියි, දින තුනක් පමණක් ආහාර ගනියි, දින හතරක් පමණක් ආහාර ගනියි, දින පහක් පමණක් ආහාර ගනියි, දින හයක් පමණක් ආහාර ගනියි, දින හතක් පමණක් ආහාර ගනියි. මෙසේ ඔහු අඩ මසක් වැනි කලක් වාරයෙන් වාරයට ආහාර භෝජනයෙහි යෙදෙන අනුයෝගයෙහි නිරතව වාසය කරයි. ඔහු එළවළු පමණක් අනුභව කරන කෙනෙක් වෙයි, ශාමක ධාන්‍ය පමණක් අනුභව කරන කෙනෙක් වෙයි, නීවාර ධාන්‍ය පමණක් අනුභව කරන කෙනෙක් වෙයි, ලපටි බත් පමණක් අනුභව කරන කෙනෙක් වෙයි, දිරාගිය බත් පමණක් අනුභව කරන කෙනෙක් වෙයි, කළු බත් පමණක් අනුභව කරන කෙනෙක් වෙයි, කැඳ පෙරා ඉතිරි වූ දේ පමණක් අනුභව කරන කෙනෙක් වෙයි, තලපිටි පමණක් අනුභව කරන කෙනෙක් වෙයි, තණකොළ පමණක් අනුභව කරන කෙනෙක් වෙයි, ගොම පමණක් අනුභව කරන කෙනෙක් වෙයි, වනයෙහි ඇති මුල් හා පලතුරු අනුභව කරමින්, ඉබේ හටගත් පලතුරු අනුභව කරමින් ජීවත් වෙයි. ඔහු හණ වස්ත්‍ර ද අඳියි, මිශ්‍ර රෙදි ද අඳියි, මළ මිනී ඔතන ලද රෙදි ද අඳියි, පැන්සකුලික චීවර ද අඳියි, ගස් පොතු වැනි රෙදි ද අඳියි, මුව හම් ද අඳියි, මුව හම් කැබලි ද අඳියි, කුස තණ පටල ද අඳියි, ගස් පොතු චීවර ද අඳියි, ලී කැබලි වැනි චීවර ද අඳියි, කෙස්වලින් සෑදූ කම්බිලි ද අඳියි, සතුන්ගේ ලොම්වලින් සෑදූ කම්බිලි ද අඳියි, බකමුණන්ගේ පිහාටු ද අඳියි. කෙස් හා රැවුල් උදුරන කෙනෙක් වෙයි, කෙස් හා රැවුල් උදුරන අනුයෝගයෙහි නිරතවෙයි. හිටගෙන සිටින කෙනෙක් වෙයි, ආසන ප්‍රතික්ෂේප කොට සිටියි. උක්කුටිකාසනයෙන් සිටින කෙනෙක් වෙයි, උක්කුටිකාසනයෙන් සිටින ව්‍යායාමයෙහි නිරත වෙයි. කටු ඇති තැන්වල නිදන කෙනෙක් වෙයි, කටු ඇති තැන්වල සයනය කරයි. තුන්වන දවස වන විට වතුරට බසින අනුයෝගයෙහි නිරතව වාසය කරයි. මෙසේ ඔහු නොයෙක් අයුරින් ශරීරය තවන, ශරීරය පීඩා කරන අනුයෝගයෙහි නිරතව වාසය කරයි. භික්ෂූනි, මෙය නිජ්ජාමා ප්‍රතිපදාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, මජ්ඣිමා ප්‍රතිපදාව කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුව නූපන් පව් අකුසල් ධර්මයන් නූපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත එසවයි, වෙර වඩයි. උපන් පව් අකුසල් ධර්මයන් ප්‍රහීණ කිරීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත එසවයි, වෙර වඩයි. නූපන් කුසල් ධර්මයන් ඉපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත එසවයි, වෙර වඩයි. උපන් කුසල් ධර්මයන් පැවැත්ම පිණිස, අමතක නොවීම පිණිස, වඩා වර්ධනය වීම පිණිස, මහත් වීම පිණිස, වැඩීම පිණිස, සම්පූර්ණ වීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත එසවයි, වෙර වඩයි.\n\nඡන්ද සමාධියෙන්, ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි; වීර්යය සමාධියෙන්, ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි; චිත්ත සමාධියෙන්, ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි; විමංසා සමාධියෙන්, ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි.\n\nසද්ධා ඉන්ද්‍රිය වඩයි; වීර්යය ඉන්ද්‍රිය වඩයි; සති ඉන්ද්‍රිය වඩයි; සමාධි ඉන්ද්‍රිය වඩයි; ප්‍රඥා ඉන්ද්‍රිය වඩයි.\n\nසද්ධා බලය වඩයි; වීර්යය බලය වඩයි; සති බලය වඩයි; සමාධි බලය වඩයි; ප්‍රඥා බලය වඩයි.\n\nසති සම්බොජ්ඣංගය වඩයි; ධම්මවිචය සම්බොජ්ඣංගය වඩයි; වීර්යය සම්බොජ්ඣංගය වඩයි; ප්‍රීති සම්බොජ්ඣංගය වඩයි; පස්සද්ධි සම්බොජ්ඣංගය වඩයි; සමාධි සම්බොජ්ඣංගය වඩයි; උපේක්ඛා සම්බොජ්ඣංගය වඩයි.\n\nසම්මාදිට්ඨිය වඩයි.\nසම්මාසංකප්පය වඩයි.\nසම්මාවාචාව වඩයි.\nසම්මාකම්මන්තය වඩයි.\nසම්මාආජීවය වඩයි.\nසම්මාවායාමය වඩයි.\nසම්මාසතිය වඩයි.\nසම්මාසමාධිය වඩයි.\nමහණෙනි, මෙය මධ්‍යම පටිපදාව යැයි කියනු ලැබේ.\nමහණෙනි, මේ ප්‍රතිපදා තුනක් වෙති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Acelakavaggo chaṭṭho. Tassuddānaṃ – Satipaṭṭhānaṃ sammappadhānaṃ, iddhipādindriyena ca; Balaṃ bojjhaṅgo maggo ca, paṭipadāya yojayeti.",
    "english": "",
    "sinhala": ""
  }
}