{
  "id": "an3.9",
  "title": {
    "pali": "Samaṇavaggo",
    "english": "The Chapter on the Ascetic.",
    "sinhala": "ශ්‍රමණ වග්ගය"
  },
  "sections": [
    {
      "number": 82,
      "pali": "‘‘Tīṇimāni, bhikkhave, samaṇassa samaṇiyāni samaṇakaraṇīyāni. Katamāni tīṇi? Adhisīlasikkhāsamādānaṃ, adhicittasikkhāsamādānaṃ, adhipaññāsikkhāsamādānaṃ – imāni kho, bhikkhave, tīṇi samaṇassa samaṇiyāni samaṇakaraṇīyāni. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘tibbo no chando bhavissati adhisīlasikkhāsamādāne, tibbo no chando bhavissati adhicittasikkhāsamādāne, tibbo no chando bhavissati adhipaññāsikkhāsamādāne’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "Monks, there are these three essential vocational tasks incumbent upon a contemplative. Which three? They are the undertaking of the training in higher virtue, the undertaking of the training in higher mind, and the undertaking of the training in higher wisdom. These, Monks, are the three essential vocational tasks incumbent upon a contemplative.\n\nTherefore, Monks, you must train yourselves thus: ‘Our ardour will be keen in the undertaking of the training in higher virtue; our ardour will be keen in the undertaking of the training in higher mind; our ardour will be keen in the undertaking of the training in higher wisdom.’ In this manner, Monks, must you train yourselves.",
      "sinhala": "මහණෙනි, ශ්‍රමණයෙකුට අයත් ශ්‍රමණ වත්/කර්තව්‍යයන් මේ තුනයි. කවරේද ඒ තුන? අධිශීල ශික්‍ෂා සමාදානය, අධිචිත්ත ශික්‍ෂා සමාදානය, අධිප්‍රඥා ශික්‍ෂා සමාදානයයි. මහණෙනි, ශ්‍රමණයෙකුට අයත් ශ්‍රමණ වත්/කර්තව්‍යයන් සැබැවින්ම මේ තුනයි.\n\nඑහෙයින්, මහණෙනි, නුඹලා විසින් මෙසේ හික්මිය යුත්තේය: ‘අධිශීල ශික්‍ෂා සමාදානයෙහිලා අපගේ ඡන්දය තීව්‍ර වන්නේය, අධිචිත්ත ශික්‍ෂා සමාදානයෙහිලා අපගේ ඡන්දය තීව්‍ර වන්නේය, අධිප්‍රඥා ශික්‍ෂා සමාදානයෙහිලා අපගේ ඡන්දය තීව්‍ර වන්නේය’ යනුවෙනි. මහණෙනි, නුඹලා මෙසේම හික්මිය යුත්තේය.",
      "paliTitle": "Samaṇasuttaṃ"
    },
    {
      "number": 83,
      "pali": "‘‘Seyyathāpi, bhikkhave, gadrabho gogaṇaṃ piṭṭhito piṭṭhito anubandho hoti – ‘ahampi dammo, ahampi dammo’ti [ahampi go amhā ahampi go amhāti (sī.), ahampi amhā ahampi amhāti (syā. kaṃ. pī.), ahampi go ahampi goti (?)]. Tassa na tādiso vaṇṇo hoti seyyathāpi gunnaṃ, na tādiso saro hoti seyyathāpi gunnaṃ, na tādisaṃ padaṃ hoti seyyathāpi gunnaṃ. So gogaṇaṃyeva piṭṭhito piṭṭhito anubandho hoti – ‘ahampi dammo, ahampi dammo’’’ti. ‘‘Evamevaṃ kho, bhikkhave, idhekacco bhikkhu bhikkhusaṅghaṃ piṭṭhito piṭṭhito anubandho hoti – ‘ahampi bhikkhu, ahampi bhikkhū’ti. Tassa na tādiso chando hoti adhisīlasikkhāsamādāne seyyathāpi aññesaṃ bhikkhūnaṃ, na tādiso chando hoti adhicittasikkhāsamādāne seyyathāpi aññesaṃ bhikkhūnaṃ, na tādiso chando hoti adhipaññāsikkhāsamādāne seyyathāpi aññesaṃ bhikkhūnaṃ. So bhikkhusaṅghaṃyeva piṭṭhito piṭṭhito anubandho hoti – ‘ahampi bhikkhu, ahampi bhikkhū’’’ti. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘tibbo no chando bhavissati adhisīlasikkhāsamādāne, tibbo no chando bhavissati adhicittasikkhāsamādāne, tibbo no chando bhavissati adhipaññāsikkhāsamādāne’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Monks, just as an ass follows closely behind a herd of cattle, saying, ‘I am also one of the herd, I am also one of the herd.’\n\nYet it does not have the same appearance as the cattle, nor the same voice as the cattle, nor the same track as the cattle. Still, it continues to follow closely behind the herd of cattle, saying, ‘I am also one of the herd, I am also one of the herd.’\n\nIn the same way, Monks, some monk here follows closely behind the community of monks, saying, ‘I am also a monk, I am also a monk.’\n\nBut he does not have the same aspiration for undertaking the training in higher virtue as the other monks, nor the same aspiration for undertaking the training in higher mind as the other monks, nor the same aspiration for undertaking the training in higher wisdom as the other monks. Yet he continues to follow closely behind the community of monks, saying, ‘I am also a monk, I am also a monk.’\n\nTherefore, Monks, you must train yourselves in this manner: ‘Our aspiration for undertaking the training in higher virtue shall be intense, our aspiration for undertaking the training in higher mind shall be intense, our aspiration for undertaking the training in higher wisdom shall be intense.’ Thus, Monks, you must train yourselves.",
      "sinhala": "මහණෙනි, යම් සේ ගඳෙබි ගව සමූහයාගේ පිටුපසින්ම පිටුපසින් ලුහුබඳින්නේද, ‘මමත් දමනය කරන ලද්දෙමි, මමත් දමනය කරන ලද්දෙමි’ කියා. එහි වර්ණය ගවයන්ගේ වර්ණය වැනි නොවෙයි, එහි හඬ ගවයන්ගේ හඬ වැනි නොවෙයි, එහි පා සටහන ගවයන්ගේ පා සටහන වැනි නොවෙයි. එහෙත් එය ගව සමූහයාගේ පිටුපසින්ම පිටුපසින් ලුහුබඳියි, ‘මමත් දමනය කරන ලද්දෙමි, මමත් දමනය කරන ලද්දෙමි’ කියා.\n\nමහණෙනි, එපරිද්දෙන්ම මේ ශාසනයෙහි ඇතැම් භික්ෂුවක් භික්ෂු සංඝයාගේ පිටුපසින්ම පිටුපසින් ලුහුබඳියි, ‘මමත් භික්ෂුවක්මි, මමත් භික්ෂුවක්මි’ කියා. අන්‍ය භික්ෂූන්ගේ අධිශීල ශික්‍ෂා සමාදානයෙහි යම් සේ දැඩි කැමැත්තක් ඇත්තේද, ඔහුට ඊට සමාන දැඩි කැමැත්තක් නැත. අන්‍ය භික්ෂූන්ගේ අධිචිත්ත ශික්‍ෂා සමාදානයෙහි යම් සේ දැඩි කැමැත්තක් ඇත්තේද, ඔහුට ඊට සමාන දැඩි කැමැත්තක් නැත. අන්‍ය භික්ෂූන්ගේ අධිප්‍රඥා ශික්‍ෂා සමාදානයෙහි යම් සේ දැඩි කැමැත්තක් ඇත්තේද, ඔහුට ඊට සමාන දැඩි කැමැත්තක් නැත. එහෙත් ඔහු භික්ෂු සංඝයාගේ පිටුපසින්ම පිටුපසින් ලුහුබඳියි, ‘මමත් භික්ෂුවක්මි, මමත් භික්ෂුවක්මි’ කියා.\n\nඑබැවින් මහණෙනි, ඔබලා විසින් මෙසේ හික්මිය යුත්තේය: ‘අධිශීල ශික්‍ෂා සමාදානයෙහි අපගේ ඡන්දය තීව්‍ර වන්නේය, අධිචිත්ත ශික්‍ෂා සමාදානයෙහි අපගේ ඡන්දය තීව්‍ර වන්නේය, අධිප්‍රඥා ශික්‍ෂා සමාදානයෙහි අපගේ ඡන්දය තීව්‍ර වන්නේය’ කියා. මහණෙනි, ඔබලා විසින් හික්මිය යුත්තේ මේ අයුරිනි.",
      "paliTitle": "Gadrabhasuttaṃ"
    },
    {
      "number": 84,
      "pali": "‘‘Tīṇimāni, bhikkhave, kassakassa gahapatissa pubbe karaṇīyāni. Katamāni tīṇi? Idha, bhikkhave, kassako gahapati paṭikacceva [paṭigacceva (sī. pī.)] khettaṃ sukaṭṭhaṃ karoti sumatikataṃ [sumattikataṃ (ka.), ettha matisaddo kaṭṭhakhettassa samīkaraṇasādhane dārubhaṇḍe vattatīti sakkataabhidhānesu āgataṃ. taṃ ‘‘matiyā suṭṭhu samīkata’’nti aṭṭhakathāya sameti]. Paṭikacceva khettaṃ sukaṭṭhaṃ karitvā sumatikataṃ kālena bījāni patiṭṭhāpeti. Kālena bījāni patiṭṭhāpetvā samayena udakaṃ abhinetipi apanetipi. Imāni kho, bhikkhave, tīṇi kassakassa gahapatissa pubbe karaṇīyāni. ‘‘Evamevaṃ kho, bhikkhave, tīṇimāni bhikkhussa pubbe karaṇīyāni. Katamāni tīṇi? Adhisīlasikkhāsamādānaṃ, adhicittasikkhāsamādānaṃ, adhipaññāsikkhāsamādānaṃ – imāni kho, bhikkhave, tīṇi bhikkhussa pubbe karaṇīyāni. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘tibbo no chando bhavissati adhisīlasikkhāsamādāne, tibbo no chando bhavissati adhicittasikkhāsamādāne, tibbo no chando bhavissati adhipaññāsikkhāsamādāne’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Tatiyaṃ.",
      "english": "Monks, there are these three prior duties for a householder who is a farmer. Which three?\n\nHere, monks, the householder who is a farmer first thoroughly prepares the field, making it well-smoothed. Having first thoroughly prepared the field and made it well-smoothed, he sows the seeds at the proper time. Having sown the seeds at the proper time, he brings in water or drains it away as appropriate. These, monks, are the three prior duties for a householder who is a farmer.\n\nIn the same way, monks, there are these three prior duties for a monk. Which three? The commitment to the training in higher virtue, the commitment to the training in higher mind (concentration), and the commitment to the training in higher wisdom—these, monks, are the three prior duties for a monk.\n\nTherefore, monks, you should train yourselves thus: ‘Our aspiration will be intense regarding the commitment to the training in higher virtue; our aspiration will be intense regarding the commitment to the training in higher mind; our aspiration will be intense regarding the commitment to the training in higher wisdom.’ That is how you should train yourselves, monks.",
      "sinhala": "මහණෙනි, ගොවි ගෘහපතියාට මේ පෙර කළ යුතු කර්තව්‍යයෝ තුනක් ඇත්තාහ. කවරේද ඒ තුන? මහණෙනි, මෙහිලා ගොවි ගෘහපතියා ප්‍රථමයෙන්ම කෙත මනාව සීසාන ලද, මනාව සමතලා කරන ලද තැනක් බවට පත් කරයි. ප්‍රථමයෙන්ම කෙත මනාව සීසා, මනාව සමතලා කොට කාලයට අනුව බීජ සිටුවයි. කාලයට අනුව බීජ සිටුවා, සුදුසු අවස්ථාවේදී ජලය ඇතුල් කරන්නේද, ඉවත් කරන්නේද වෙයි. මහණෙනි, ගොවි ගෘහපතියාට ඇති පෙර කළ යුතු කර්තව්‍යයෝ නම් මේ තුනයි.\n\nමහණෙනි, එපරිද්දෙන්ම භික්‍ෂුවටද මේ පෙර කළ යුතු කර්තව්‍යයෝ තුනක් ඇත්තාහ. කවරේද ඒ තුන? අධිසීල ශික්‍ෂා සමාදානය, අධිචිත්ත ශික්‍ෂා සමාදානය, අධිප්‍රඥා ශික්‍ෂා සමාදානයයි. මහණෙනි, භික්‍ෂුවට ඇති පෙර කළ යුතු කර්තව්‍යයෝ නම් මේ තුනයි.\n\nඑහෙයින් මහණෙනි, ඔබ විසින් මෙසේ හික්මිය යුතුය. ‘අධිසීල ශික්‍ෂා සමාදානයෙහි අපගේ ඡන්දය තීව්‍ර වන්නේය, අධිචිත්ත ශික්‍ෂා සමාදානයෙහි අපගේ ඡන්දය තීව්‍ර වන්නේය, අධිප්‍රඥා ශික්‍ෂා සමාදානයෙහි අපගේ ඡන්දය තීව්‍ර වන්නේය’ යනුවෙනි. මහණෙනි, ඔබ විසින් මෙසේ හික්මිය යුතුය.",
      "paliTitle": "Khettasuttaṃ"
    },
    {
      "number": 85,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho aññataro vajjiputtako bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so vajjiputtako bhikkhu bhagavantaṃ etadavoca – ‘‘sādhikamidaṃ, bhante, diyaḍḍhasikkhāpadasataṃ [diyaḍḍhaṃ sikkhāpadasataṃ (sī.)] anvaddhamāsaṃ uddesaṃ āgacchati. Nāhaṃ, bhante, ettha sakkomi sikkhitu’’nti. ‘‘Sakkhissasi pana tvaṃ, bhikkhu, tīsu sikkhāsu sikkhituṃ – adhisīlasikkhāya, adhicittasikkhāya adhipaññāsikkhāyā’’ti? ‘‘Sakkomahaṃ, bhante, tīsu sikkhāsu sikkhituṃ – adhisīlasikkhāya, adhicittasikkhāya, adhipaññāsikkhāyā’’ti. ‘‘Tasmātiha tvaṃ, bhikkhu, tīsu sikkhāsu sikkhassu – adhisīlasikkhāya, adhicittasikkhāya, adhipaññāsikkhāya’’. ‘‘Yato kho tvaṃ, bhikkhu, adhisīlampi sikkhissasi, adhicittampi sikkhissasi, adhipaññampi sikkhissasi, tassa tuyhaṃ bhikkhu adhisīlampi sikkhato adhicittampi sikkhato adhipaññampi sikkhato rāgo pahīyissati, doso pahīyissati, moho pahīyissati. So tvaṃ rāgassa pahānā dosassa pahānā mohassa pahānā yaṃ akusalaṃ na taṃ karissasi, yaṃ pāpaṃ na taṃ sevissasī’’ti. Atha kho so bhikkhu aparena samayena adhisīlampi sikkhi, adhicittampi sikkhi, adhipaññampi sikkhi. Tassa adhisīlampi sikkhato adhicittampi sikkhato adhipaññampi sikkhato rāgo pahīyi, doso pahīyi, moho pahīyi. So rāgassa pahānā dosassa pahānā mohassa pahānā yaṃ akusalaṃ taṃ nākāsi, yaṃ pāpaṃ taṃ na sevīti. Catutthaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Vesālī, in the Great Wood, in the Hall with the Gabled Roof. Then a certain monk who was a Vajjiputta approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, that Vajjiputta monk said this to the Blessed One: \"Venerable sir, these training rules, numbering more than one hundred and fifty, come up for recitation every half month. I, venerable sir, am unable to train in them.\" \"But, monk, will you be able to train in the three trainings: the training in higher virtue, the training in higher mind, and the training in higher wisdom?\" \"I am able, venerable sir, to train in the three trainings: the training in higher virtue, the training in higher mind, and the training in higher wisdom.\" \"Therefore, monk, train yourself in these three trainings: the training in higher virtue, the training in higher mind, and the training in higher wisdom.\" \"For when you, monk, train in higher virtue, train in higher mind, and train in higher wisdom, then for you, monk, as you train in higher virtue, train in higher mind, and train in higher wisdom, lust will be abandoned, hatred will be abandoned, and delusion will be abandoned. Having abandoned lust, abandoned hatred, and abandoned delusion, you will not commit any unwholesome actions, nor will you engage in anything evil.\"\n\nThen, after some time, that monk trained in higher virtue, trained in higher mind, and trained in higher wisdom. As he trained in higher virtue, trained in higher mind, and trained in higher wisdom, his lust was abandoned, his hatred was abandoned, and his delusion was abandoned. Having abandoned lust, abandoned hatred, and abandoned delusion, he did not commit any unwholesome actions, nor did he engage in anything evil.",
      "sinhala": "එක් සමය​ක භාග්‍යවතුන් වහන්සේ විශාලා මහනුවර මහාවනයෙහි කූටාගාරශාලාවෙහි වැඩවසන සේක. එවිට යම්කිසි වජ්ජිපුත්තක භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ආදරයෙන් වැඳ එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වූ ඒ වජ්ජිපුත්තක භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"ස්වාමීනි, මේ එකසිය පනහකට වඩා වැඩි ශික්ෂාපද රාශියක් සෑම අඩමසකට වරක් පාතිමොක්ඛ වශයෙන් උද්දේශයට පැමිණේ. ස්වාමීනි, මේ සියල්ලෙහි හික්මෙන්නට මට නොහැකිය.\" \"එසේ නම් මහණ, ඔබට අධිශීල ශික්ෂාවෙහි, අධිචිත්ත ශික්ෂාවෙහි සහ අධිප්‍රඥා ශික්ෂාවෙහි යන ශික්ෂා තුනෙහි හික්මෙන්නට හැකි වේද?\" \"ස්වාමීනි, අධිශීල ශික්ෂාවෙහි, අධිචිත්ත ශික්ෂාවෙහි, අධිප්‍රඥා ශික්ෂාවෙහි යන ශික්ෂා තුනෙහි හික්මෙන්නට මට පුළුවන.\" \"එබැවින් මහණ, ඔබ ඒ ශික්ෂා තුනෙහි හික්මෙන්න—අධිශීල ශික්ෂාවෙහි, අධිචිත්ත ශික්ෂාවෙහි, අධිප්‍රඥා ශික්ෂාවෙහි.\" \"මහණ, යම් කලක ඔබ අධිශීලයෙහි හික්මෙන්නේද, අධිචිත්තයෙහි හික්මෙන්නේද, අධිප්‍රඥාවෙහි හික්මෙන්නේද, එසේ අධිශීලයෙහි හික්මෙන, අධිචිත්තයෙහි හික්මෙන, අධිප්‍රඥාවෙහි හික්මෙන ඔබට රාගය ප්‍රහීණ වන්නේය, ද්වේෂය ප්‍රහීණ වන්නේය, මෝහය ප්‍රහීණ වන්නේය. රාගය ප්‍රහීණ කිරීමෙන්, ද්වේෂය ප්‍රහීණ කිරීමෙන්, මෝහය ප්‍රහීණ කිරීමෙන් ඔබ යම් අකුසල කර්මයක් ඇත්නම් එය නොකරන්නේය, යම් පාපයක් ඇත්නම් එය සේවනය නොකරන්නේය.\"\n\nඉක්බිති ඒ භික්ෂුව පසුව තවත් කලෙක අධිශීලයෙහි ද හික්මුණේය, අධිචිත්තයෙහි ද හික්මුණේය, අධිප්‍රඥාවෙහි ද හික්මුණේය.\n\nඑසේ අධිශීලයෙහි හික්මෙන, අධිචිත්තයෙහි හික්මෙන, අධිප්‍රඥාවෙහි හික්මෙන ඔහුගේ රාගය ප්‍රහීණ විය, ද්වේෂය ප්‍රහීණ විය, මෝහය ප්‍රහීණ විය. ඔහු රාගය ප්‍රහීණ කිරීමෙන්, ද්වේෂය ප්‍රහීණ කිරීමෙන්, මෝහය ප්‍රහීණ කිරීමෙන් යම් අකුසලයක් ඇත්ද එය නොකළේය, යම් පාපයක් ඇත්ද එය සේවනය නොකළේය. (සතරවෙනි සූත්‍රයයි).",
      "paliTitle": "Vajjiputtasuttaṃ"
    },
    {
      "number": 86,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘‘Sekho, sekho’ti, bhante, vuccati. Kittāvatā nu kho, bhante, sekho hotī’’ti? ‘‘Sikkhatīti kho, bhikkhu, tasmā sekhoti vuccati. Kiñca sikkhati? Adhisīlampi sikkhati, adhicittampi sikkhati, adhipaññampi sikkhati. Sikkhatīti kho, bhikkhu, tasmā sekhoti vuccatī’’ti. ‘‘Sekhassa sikkhamānassa, ujumaggānusārino; Khayasmiṃ paṭhamaṃ ñāṇaṃ, tato aññā anantarā. ‘‘Tato aññāvimuttassa [aññāvimuttiyā (ka.)], ñāṇaṃ ve [ñāṇañca (ka.)] hoti tādino; Akuppā me vimuttīti, bhavasaṃyojanakkhaye’’ti. pañcamaṃ; ( ) [(aṭṭhamaṃ bhāṇavāraṃ niṭṭhitaṃ) (ka.)]",
      "english": "Then indeed a certain monk approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side.\n\nSeated to one side, that monk said this to the Blessed One: \"Venerable sir, 'Sekha,' the one in training, is what is said. How far, Venerable sir, is one truly a Sekha?\"\n\n\"He trains, O monk, thus he is called a Sekha. And what does he train in? He trains in the higher morality, he trains in the higher mind, he trains in the higher wisdom. Because he trains, O monk, therefore he is called a Sekha.\"\n\nFor the Sekha who is training, who follows the straight path, first is the knowledge regarding the destruction of defilements, and immediately after that is the final knowledge. Then for the one liberated by that final knowledge, knowledge certainly arises for that steadfast one: that ‘My liberation is unshakeable,’ upon the utter destruction of the fetters that bind one to existence.",
      "sinhala": "එවිට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේ ය. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පස් ව වාඩි විය.\n\nඑකත්පස් ව වැඩහුන් ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: “ස්වාමීනි, ‘ශික්ෂා කරන්නා, ශික්ෂා කරන්නා’ යැයි කියනු ලැබේ. ස්වාමීනි, කෙතරම් පමණකින් ශික්ෂා කරන්නෙක් (සේඛයෙක්) වේ ද?”\n\n“භික්ෂුව, ශික්ෂා කරන (පුහුණු වන) හෙයින් ම සේඛයෙක් යැයි කියනු ලැබේ. හෙතෙම කුමක් පුහුණු කරන්නේ ද? හෙතෙම අධිශීලය පුහුණු කරයි, අධිචිත්තය පුහුණු කරයි, අධිප්‍රඥාව පුහුණු කරයි. භික්ෂුව, ශික්ෂා කරන හෙයින් ම සේඛයෙක් යැයි කියනු ලැබේ.”\n\n“ශික්ෂා කරමින් සිටින, සෘජු මාර්ගය අනුගමනය කරන්නා වූ සේඛ පුද්ගලයාට,\nපළමුව ක්ෂය ඥානය ඇතිවේ. ඉන්පසු වහා ම අරහත්වය නම් වූ ඥානය ඇතිවේ.\nඉන්පසු අරහත්වයෙන් විමුක්ත වූ, ඒ ස්ථිර වූ තැනැත්තාට,\nභව සංයෝජන ක්ෂය කිරීමේ දී ‘මාගේ විමුක්තිය නොසෙල්වෙන්නේය’ යන ඥානය ද ඇතිවේ.”",
      "paliTitle": "Sekkhasuttaṃ"
    },
    {
      "number": 87,
      "pali": "‘‘Sādhikamidaṃ, bhikkhave, diyaḍḍhasikkhāpadasataṃ anvaddhamāsaṃ uddesaṃ āgacchati, yattha attakāmā kulaputtā sikkhanti. Tisso imā, bhikkhave, sikkhā yatthetaṃ sabbaṃ samodhānaṃ gacchati. Katamā tisso? Adhisīlasikkhā, adhicittasikkhā adhipaññāsikkhā – imā kho, bhikkhave, tisso sikkhā, yatthetaṃ sabbaṃ samodhānaṃ gacchati. ‘‘Idha, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ mattaso kārī paññāya mattaso kārī. So yāni tāni khuddānukhuddakāni sikkhāpadāni tāni āpajjatipi vuṭṭhātipi. Taṃ kissa hetu? Na hi mettha, bhikkhave, abhabbatā vuttā. Yāni ca kho tāni sikkhāpadāni ādibrahmacariyakāni brahmacariyasāruppāni, tattha dhuvasīlo [dhuvasīlī (sī.) pu. pa. 127-129 (thokaṃ visadisaṃ)] ca hoti ṭhitasīlo [ṭhitasīlī (sī.)] ca, samādāya sikkhati sikkhāpadesu. So tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. ‘‘Idha pana, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ mattaso kārī paññāya mattaso kārī. So yāni tāni khuddānukhuddakāni sikkhāpadāni tāni āpajjatipi vuṭṭhātipi. Taṃ kissa hetu? Na hi mettha, bhikkhave, abhabbatā vuttā. Yāni ca kho tāni sikkhāpadāni ādibrahmacariyakāni brahmacariyasāruppāni tattha dhuvasīlo ca hoti ṭhitasīlo ca, samādāya sikkhati sikkhāpadesu. So tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. ‘‘Idha pana, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ paripūrakārī paññāya mattaso kārī. So yāni tāni khuddānukhuddakāni sikkhāpadāni tāni āpajjatipi vuṭṭhātipi. Taṃ kissa hetu? Na hi mettha, bhikkhave, abhabbatā vuttā. Yāni ca kho tāni sikkhāpadāni ādibrahmacariyakāni brahmacariyasāruppāni tattha dhuvasīlo ca hoti ṭhitasīlo ca, samādāya sikkhati sikkhāpadesu. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. ‘‘Idha pana, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ paripūrakārī paññāya paripūrakārī. So yāni tāni khuddānukhuddakāni sikkhāpadāni tāni āpajjatipi vuṭṭhātipi. Taṃ kissa hetu? Na hi mettha, bhikkhave, abhabbatā vuttā. Yāni ca kho tāni sikkhāpadāni ādibrahmacariyakāni brahmacariyasāruppāni tattha dhuvasīlo ca hoti ṭhitasīlo ca, samādāya sikkhati sikkhāpadesu. So āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. ‘‘Iti kho, bhikkhave, padesaṃ padesakārī ārādheti paripūraṃ paripūrakārī. Avañjhāni tvevāhaṃ [avañcuvanevāhaṃ (ka.)], bhikkhave, sikkhāpadāni vadāmī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, this training code, numbering more than one hundred and fifty rules, comes up for recitation every half-month, in which clansmen who desire benefit train themselves. Monks, there are these three trainings where all this culminates. Which three? The training in higher morality, the training in higher mind, and the training in higher wisdom. Monks, these are the three trainings where all this culminates.\n\nFurthermore, monks, a monk here is one who completely fulfills morality, acts moderately in concentration, and acts moderately in wisdom. Regarding those minor and sub-minor training rules, he sometimes incurs offense and and sometimes recovers. Why is this? Because, monks, inability regarding them has not been declared. But regarding those training rules that are foundational to the holy life, suitable for the holy life, he is both firm in virtue and established in virtue, and he undertakes the training rules fully. Due to the destruction of the three fetters, he is a Stream-Enterer, one not subject to falling into lower realms, fixed (in destiny), and headed for full awakening.\n\nFurthermore, monks, a monk here is one who completely fulfills morality, acts moderately in concentration, and acts moderately in wisdom. Regarding those minor and sub-minor training rules, he sometimes incurs offense and sometimes recovers. Why is this? Because, monks, inability regarding them has not been declared. But regarding those training rules that are foundational to the holy life, suitable for the holy life, he is both firm in virtue and established in virtue, and he undertakes the training rules fully. Due to the destruction of the three fetters and the attenuation of lust, hatred, and delusion, he is a Once-Returner, who, having returned to this world just one more time, will make an end of suffering.\n\nFurthermore, monks, a monk here is one who completely fulfills morality, completely fulfills concentration, and acts moderately in wisdom. Regarding those minor and sub-minor training rules, he sometimes incurs offense and sometimes recovers. Why is this? Because, monks, inability regarding them has not been declared. But regarding those training rules that are foundational to the holy life, suitable for the holy life, he is both firm in virtue and established in virtue, and he undertakes the training rules fully. Due to the destruction of the five lower fetters, he is one who spontaneously reappears (in the Pure Abodes), attaining final Nibbāna there, not subject to returning from that world.\n\nFurthermore, monks, a monk here is one who completely fulfills morality, completely fulfills concentration, and completely fulfills wisdom. Regarding those minor and sub-minor training rules, he sometimes incurs offense and sometimes recovers. Why is this? Because, monks, inability regarding them has not been declared. But regarding those training rules that are foundational to the holy life, suitable for the holy life, he is both firm in virtue and established in virtue, and he undertakes the training rules fully. Due to the destruction of the defilements, having realized and experienced the taintless liberation of mind and liberation by wisdom for himself through direct knowledge in this very life, he abides therein.\n\nThus, monks, one who undertakes part of the training succeeds in fulfilling that part, and one who undertakes the full training succeeds in fulfilling the full training. Nevertheless, monks, I declare that these training rules are not barren, but fruitful.",
      "sinhala": "මහණෙනි, තමන්ගේ දියුණුව කැමති කුලපුත්‍රයෝ හික්මෙන මේ සියක් පනහකට අධික ශික්‍ෂාපද අඩ මසක් පාසා උද්දේසයට එන්නේය.\n\nමහණෙනි, මේ සියල්ලම අන්තර්ගත වන ශික්‍ෂාවෝ තුනක් ඇත්තාහ. ඒ තුන කවරේද? අධිසීල ශික්‍ෂාව, අධිචිත්ත ශික්‍ෂාව, අධිප්‍රඥා ශික්‍ෂාව යනුයි. මහණෙනි, මේ සියල්ලම අන්තර්ගත වන ශික්‍ෂාවෝ තුන නම් මේවායි.\n\nමහණෙනි, මේ ශාසනයෙහි භික්‍ෂුවක් සීලයෙහි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි පමණට කරන්නෙක් වෙයි, ප්‍රඥාවෙහි පමණට කරන්නෙක් වෙයි. යම් ඒ කුඩා අනු කුඩා ශික්‍ෂාපද ඇත්ද, ඔහු ඒවාට වැටෙයිද, ඉන් නැගී සිටියිද. එයට හේතු කවරේද? මහණෙනි, මෙහි නුසුදුසු බවක් නොකියන ලදී. යම් ඒ ශික්‍ෂාපද බ්‍රහ්මචර්යාවේ මූලික කරුණු ඇත්තාහ, බ්‍රහ්මචර්යාවට සුදුසු දේ වෙත්ද, එහි ඔහු ස්ථිර සීල ඇත්තෙක්ද වෙයි, පිහිටි සීල ඇත්තෙක්ද වෙයි, ඒ ශික්‍ෂාපද සමාදන්ව හික්මෙයි. ඔහු ඒ සංයෝජන තුන ක්‍ෂය කිරීමෙන් සෝවාන් වන්නේය, අපායට නොවැටෙන ස්වභාව ඇත්තෙක් වන්නේය, නියත වූ, සම්බෝධිය පරම කොට ඇත්තෙක් වන්නේය.\n\nමහණෙනි, තවද මේ ශාසනයෙහි භික්‍ෂුවක් සීලයෙහි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි පමණට කරන්නෙක් වෙයි, ප්‍රඥාවෙහි පමණට කරන්නෙක් වෙයි. යම් ඒ කුඩා අනු කුඩා ශික්‍ෂාපද ඇත්ද, ඔහු ඒවාට වැටෙයිද, ඉන් නැගී සිටියිද. එයට හේතු කවරේද? මහණෙනි, මෙහි නුසුදුසු බවක් නොකියන ලදී. යම් ඒ ශික්‍ෂාපද බ්‍රහ්මචර්යාවේ මූලික කරුණු ඇත්තාහ, බ්‍රහ්මචර්යාවට සුදුසු දේ වෙත්ද, එහි ඔහු ස්ථිර සීල ඇත්තෙක්ද වෙයි, පිහිටි සීල ඇත්තෙක්ද වෙයි, ඒ ශික්‍ෂාපද සමාදන්ව හික්මෙයි. ඔහු ඒ සංයෝජන තුන ක්‍ෂය කිරීමෙන්ද, රාග ද්වේෂ මෝහ යන ධර්මයන් තුනී වීමෙන්ද සකදාගාමී වන්නේය, මේ ලෝකයට එක් වරක්ම පැමිණ දුක කෙළවර කරන්නේය.\n\nමහණෙනි, තවද මේ ශාසනයෙහි භික්‍ෂුවක් සීලයෙහි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි සම්පූර්ණ කරන්නෙක් වෙයි, ප්‍රඥාවෙහි පමණට කරන්නෙක් වෙයි. යම් ඒ කුඩා අනු කුඩා ශික්‍ෂාපද ඇත්ද, ඔහු ඒවාට වැටෙයිද, ඉන් නැගී සිටියිද. එයට හේතු කවරේද? මහණෙනි, මෙහි නුසුදුසු බවක් නොකියන ලදී. යම් ඒ ශික්‍ෂාපද බ්‍රහ්මචර්යාවේ මූලික කරුණු ඇත්තාහ, බ්‍රහ්මචර්යාවට සුදුසු දේ වෙත්ද, එහි ඔහු ස්ථිර සීල ඇත්තෙක්ද වෙයි, පිහිටි සීල ඇත්තෙක්ද වෙයි, ඒ ශික්‍ෂාපද සමාදන්ව හික්මෙයි. ඔහු ඒ ඕරම්භාගීය සංයෝජන පහක් ක්‍ෂය කිරීමෙන් ඕපපාතික වන්නේය, එහිම පිරිනිවන් පාන්නෙක් වන්නේය, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වන්නේය.\n\nමහණෙනි, තවද මේ ශාසනයෙහි භික්‍ෂුවක් සීලයෙහි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි සම්පූර්ණ කරන්නෙක් වෙයි, ප්‍රඥාවෙහි සම්පූර්ණ කරන්නෙක් වෙයි. යම් ඒ කුඩා අනු කුඩා ශික්‍ෂාපද ඇත්ද, ඔහු ඒවාට වැටෙයිද, ඉන් නැගී සිටියිද. එයට හේතු කවරේද? මහණෙනි, මෙහි නුසුදුසු බවක් නොකියන ලදී. යම් ඒ ශික්‍ෂාපද බ්‍රහ්මචර්යාවේ මූලික කරුණු ඇත්තාහ, බ්‍රහ්මචර්යාවට සුදුසු දේ වෙත්ද, එහි ඔහු ස්ථිර සීල ඇත්තෙක්ද වෙයි, පිහිටි සීල ඇත්තෙක්ද වෙයි, ඒ ශික්‍ෂාපද සමාදන්ව හික්මෙයි. ඔහු ආශ්‍රවයන් ක්‍ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තියද, ප්‍රඥා විමුක්තියද, මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් සාක්‍ෂාත් කරගෙන පැමිණ වාසය කරන්නේය.\n\nමහණෙනි, මෙසේ නම් කොටසක් සම්පූර්ණ කරන්නා කොටසක් සාදා ගන්නේය, සම්පූර්ණයෙන් සම්පූර්ණ කරන්නා සම්පූර්ණ බව සාදා ගන්නේය. මහණෙනි, මම මේ ශික්‍ෂාපද නිශ්ඵල නොවන්නේයයි කියමි.",
      "paliTitle": "Paṭhamasikkhāsuttaṃ"
    },
    {
      "number": 88,
      "pali": "‘‘Sādhikamidaṃ, bhikkhave, diyaḍḍhasikkhāpadasataṃ anvaddhamāsaṃ uddesaṃ āgacchati yattha attakāmā kulaputtā sikkhanti. Tisso imā, bhikkhave, sikkhā yatthetaṃ sabbaṃ samodhānaṃ gacchati. Katamā tisso? Adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā – imā kho, bhikkhave, tisso sikkhā yatthetaṃ sabbaṃ samodhānaṃ gacchati. ‘‘Idha, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ mattaso kārī paññāya mattaso kārī. So yāni tāni khuddānukhuddakāni sikkhāpadāni tāni āpajjatipi vuṭṭhātipi. Taṃ kissa hetu? Na hi mettha, bhikkhave, abhabbatā vuttā. Yāni ca kho tāni sikkhāpadāni ādibrahmacariyakāni brahmacariyasāruppāni tattha dhuvasīlo ca hoti ṭhitasīlo ca, samādāya sikkhati sikkhāpadesu. So tiṇṇaṃ saṃyojanānaṃ parikkhayā sattakkhattuparamo hoti. Sattakkhattuparamaṃ deve ca manusse ca sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. So tiṇṇaṃ saṃyojanānaṃ parikkhayā kolaṃkolo hoti, dve vā tīṇi vā kulāni sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. So tiṇṇaṃ saṃyojanānaṃ parikkhayā ekabījī hoti, ekaṃyeva mānusakaṃ bhavaṃ nibbattetvā dukkhassantaṃ karoti. So tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. ‘‘Idha pana, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ paripūrakārī paññāya mattaso kārī. So yāni tāni khuddānukhuddakāni sikkhāpadāni tāni āpajjatipi vuṭṭhātipi. Taṃ kissa hetu? Na hi mettha, bhikkhave, abhabbatā vuttā. Yāni ca kho tāni sikkhāpadāni ādibrahmacariyakāni brahmacariyasāruppāni tattha dhuvasīlo ca hoti ṭhitasīlo ca, samādāya sikkhati sikkhāpadesu. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā uddhaṃsoto akaniṭṭhagāmī. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā sasaṅkhāraparinibbāyī hoti. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā asaṅkhāraparinibbāyī hoti. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā upahaccaparinibbāyī hoti. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti. ‘‘Idha pana, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ paripūrakārī paññāya paripūrakārī. So yāni tāni dhuvasīlo ca hoti ṭhitasīlo ca, samādāya sikkhati sikkhāpadesu. So āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. ‘‘Iti kho, bhikkhave, padesaṃ padesakārī ārādheti, paripūraṃ paripūrakārī, avañjhāni tvevāhaṃ, bhikkhave, sikkhāpadāni vadāmī’’ti. Sattamaṃ.",
      "english": "Monks, these are more than one hundred and fifty training rules which come up for recitation every half month, and in which sons of noble families who desire their own welfare train. Monks, there are these three trainings where all this is comprised. Which three? The training in higher virtue, the training in higher mind, and the training in higher wisdom—these, monks, are the three trainings where all this is comprised.\n\nHere, monks, a bhikkhu is a completer of virtue, but is moderate in concentration and moderate in wisdom. Those lesser and minor training rules, he may fall into and rise out of. What is the reason for this? I do not say that this is impossibility here, monks. But those training rules which are fundamental to the holy life, appropriate to the holy life, in those he is firm in virtue and established in virtue, undertaking and training in the rules. Through the destruction of the three fetters, he is a maximum-of-seven-rebirths stream-enterer. Having run on and wandered in the realms of gods and men a maximum of seven times, he makes an end of suffering. Through the destruction of the three fetters, he is a family-to-family stream-enterer, having run on and wandered through two or three families (lives), he makes an end of suffering. Through the destruction of the three fetters, he is a one-seed stream-enterer, having generated only one more human existence, he makes an end of suffering. Through the destruction of the three fetters and the attenuation of lust, aversion, and delusion, he is a once-returner, having come back to this world only one more time, he makes an end of suffering.\n\nFurthermore, monks, a bhikkhu here is a completer of virtue and a completer of concentration, but is moderate in wisdom. Those lesser and minor training rules, he may fall into and rise out of. What is the reason for this? I do not say that this is impossibility here, monks. But those training rules which are fundamental to the holy life, appropriate to the holy life, in those he is firm in virtue and established in virtue, undertaking and training in the rules.\n\nThrough the destruction of the five lower fetters, he is one flowing upstream, bound for the Akaniṭṭha realm. Through the destruction of the five lower fetters, he attains Nibbāna with exertion. Through the destruction of the five lower fetters, he attains Nibbāna without exertion. Through the destruction of the five lower fetters, he attains Nibbāna upon passing. Through the destruction of the five lower fetters, he attains Nibbāna in the interim.\n\nFurthermore, monks, a bhikkhu here is a completer of virtue, a completer of concentration, and a completer of wisdom. Those (rules), he is firm in virtue and established in virtue, undertaking and training in the rules. Through the destruction of the influxes, having realized directly for himself with higher knowledge, he enters and dwells in the taintless liberation of mind and liberation through wisdom in this very life.\n\nThus, monks, the practitioner of partial training achieves partial realization, and the practitioner of full training achieves full realization. Nevertheless, monks, I declare that the training rules are never fruitless.",
      "sinhala": "මහණෙනි, තමන්ගේ යහපත කැමති කුලපුත්‍රයෝ යම් තැනක හික්මෙත්ද, එකසිය පනහකට අධික ශික්ෂාපද සංඛ්‍යාවක් අඩ මසක් පාසා පාතිමෝක්ෂය උදෙසා එළඹේ. මහණෙනි, මේ සියල්ලම අන්තර්ගත වන ශික්ෂාවෝ තුනක් වෙති. ඒ තුන කවරේද? අධිසීල ශික්ෂාව, අධිචිත්ත ශික්ෂාව, අධිප්‍රඥා ශික්ෂාව යි. මහණෙනි, මේ සියල්ලම අන්තර්ගත වන ශික්ෂාවෝ මේ තුන වෙති.\n\nමහණෙනි, මේ ශාසනයෙහි භික්ෂුව සීලයෙහි පරිපූරකිරීම් ඇත්තේ වෙයි, සමාධියෙහි ප්‍රමාණයකට කිරීම් ඇත්තේ වෙයි, ප්‍රඥාවෙහි ප්‍රමාණයකට කිරීම් ඇත්තේ වෙයි. යම් ඒ කුඩා වූද අනුකුඩා වූද ශික්ෂාපද ඇත්ද, ඔහු ඒවාට වැටෙයිද, ඉන් නැගී සිටියිද. එයට හේතු කවරේද? මහණෙනි, මෙහිදී මම අභව්‍ය බව (ප්‍රගතියට ඇති නොහැකියාව) නොකියමි. යම් ඒ ශික්ෂාපද බ්‍රහ්මචර්යාවේ මූලිකාංගද, බ්‍රහ්මචර්යාවට අනුරූපද වෙත්ද, එහි ඔහු ස්ථිරසීල ඇත්තේ වෙයි, පිහිටිසීල ඇත්තේ වෙයි, ශික්ෂාපද සමාදන්ව හික්මෙයි. ඔහු සංයෝජන තුනක් ක්ෂය කිරීමෙන් සත් වරක් උපදින තැනැත්තා වෙයි (සත්තක්ඛත්තුපරම). දෙවියන් අතර සහ මිනිසුන් අතර සත් වරක් ඉපදී සංසාරයේ සැරිසරා දුක අවසන් කරයි. ඔහු සංයෝජන තුනක් ක්ෂය කිරීමෙන් කොලංකෝලී වෙයි. දෙකක් හෝ තුනක් වූ කුලයන්හි ඉපදී සංසාරයේ සැරිසරා දුක අවසන් කරයි. ඔහු සංයෝජන තුනක් ක්ෂය කිරීමෙන් එකබීජී වෙයි. එකම මනුෂ්‍ය භවයක් ඉපිදවා දුක අවසන් කරයි. ඔහු රාගය, ද්වේෂය, මෝහය යන මේවායේ ක්ෂීණ වීම නිසා සකදාගාමී වෙයි. එක වරක්ම මේ ලෝකයට පැමිණ දුක අවසන් කරයි.\n\nමහණෙනි, තවද මේ ශාසනයෙහි භික්ෂුව සීලයෙහි පරිපූරකිරීම් ඇත්තේ වෙයි, සමාධියෙහි පරිපූරකිරීම් ඇත්තේ වෙයි, ප්‍රඥාවෙහි ප්‍රමාණයකට කිරීම් ඇත්තේ වෙයි. යම් ඒ කුඩා වූද අනුකුඩා වූද ශික්ෂාපද ඇත්ද, ඔහු ඒවාට වැටෙයිද, ඉන් නැගී සිටියිද. එයට හේතු කවරේද? මහණෙනි, මෙහිදී මම අභව්‍ය බව නොකියමි. යම් ඒ ශික්ෂාපද බ්‍රහ්මචර්යාවේ මූලිකාංගද, බ්‍රහ්මචර්යාවට අනුරූපද වෙත්ද, එහි ඔහු ස්ථිරසීල ඇත්තේ වෙයි, පිහිටිසීල ඇත්තේ වෙයි, ශික්ෂාපද සමාදන්ව හික්මෙයි. ඔහු ඕරම්භාගීය සංයෝජන පහක් ක්ෂය කිරීමෙන් අකනිට්ඨා බ්‍රහ්ම ලෝකය දක්වා ගමන් කරන උඩට ගලන දහරාවක් ඇත්තේ වෙයි (උද්ධංසෝතෝ අකනිට්ඨගාමී). ඔහු ඕරම්භාගීය සංයෝජන පහක් ක්ෂය කිරීමෙන් සසංඛාරපරිනිර්වායී වෙයි. ඔහු ඕරම්භාගීය සංයෝජන පහක් ක්ෂය කිරීමෙන් අසංඛාරපරිනිර්වායී වෙයි. ඔහු ඕරම්භාගීය සංයෝජන පහක් ක්ෂය කිරීමෙන් උපහච්චපරිනිර්වායී වෙයි. ඔහු ඕරම්භාගීය සංයෝජන පහක් ක්ෂය කිරීමෙන් අන්තරාපරිනිර්වායී වෙයි.\n\nමහණෙනි, තවද මේ ශාසනයෙහි භික්ෂුව සීලයෙහි පරිපූරකිරීම් ඇත්තේ වෙයි, සමාධියෙහි පරිපූරකිරීම් ඇත්තේ වෙයි, ප්‍රඥාවෙහි පරිපූරකිරීම් ඇත්තේ වෙයි. යම් ඒ ශික්ෂාපද බ්‍රහ්මචර්යාවේ මූලිකාංගද, බ්‍රහ්මචර්යාවට අනුරූපද වෙත්ද, එහි ඔහු ස්ථිරසීල ඇත්තේ වෙයි, පිහිටිසීල ඇත්තේ වෙයි, ශික්ෂාපද සමාදන්ව හික්මෙයි. ඔහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දැක්වෙන ධර්මයෙහිදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට වාසය කරයි.\n\nමහණෙනි, මෙසේ කොටසක් පුරන්නා කොටසක් සාක්ෂාත් කරයි, පිරිපුන් කරන තැනැත්තා පිරිපුන් ලෙස සාක්ෂාත් කරයි. එසේ වුවද මහණෙනි, මම මේ ශික්ෂාපද නිෂ්ඵල නොවේ යැයි කියමි.",
      "paliTitle": "Dutiyasikkhāsuttaṃ"
    },
    {
      "number": 89,
      "pali": "‘‘Sādhikamidaṃ, bhikkhave, diyaḍḍhasikkhāpadasataṃ anvaddhamāsaṃ uddesaṃ āgacchati yattha attakāmā kulaputtā sikkhanti. Tisso imā, bhikkhave, sikkhā yatthetaṃ sabbaṃ samodhānaṃ gacchati. Katamā tisso? Adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā – imā kho, bhikkhave, tisso sikkhā yatthetaṃ sabbaṃ samodhānaṃ gacchati. ‘‘Idha, bhikkhave, bhikkhu sīlesu paripūrakārī hoti samādhismiṃ paripūrakārī paññāya paripūrakārī. So yāni tāni khuddānukhuddakāni sikkhāpadāni tāni āpajjatipi vuṭṭhātipi. Taṃ kissa hetu? Na hi mettha, bhikkhave, abhabbatā vuttā. Yāni ca kho tāni sikkhāpadāni ādibrahmacariyakāni brahmacariyasāruppāni tattha dhuvasīlo ca hoti ṭhitasīlo ca, samādāya sikkhati sikkhāpadesu. So āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā upahaccaparinibbāyī hoti. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā asaṅkhāraparinibbāyī hoti. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā sasaṅkhāraparinibbāyī hoti. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā uddhaṃsoto hoti akaniṭṭhagāmī taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ tiṇṇaṃ saṃyojanānaṃ parikkhayā, rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ tiṇṇaṃ saṃyojanānaṃ parikkhayā ekabījī hoti, ekaṃyeva mānusakaṃ bhavaṃ nibbattetvā dukkhassantaṃ karoti. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ tiṇṇaṃ saṃyojanānaṃ parikkhayā kolaṃkolo hoti, dve vā tīṇi vā kulāni sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. Taṃ vā pana anabhisambhavaṃ appaṭivijjhaṃ tiṇṇaṃ saṃyojanānaṃ parikkhayā sattakkhattuparamo hoti, sattakkhattuparamaṃ deve ca manusse ca sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. ‘‘Iti kho, bhikkhave, paripūraṃ paripūrakārī ārādheti padesaṃ padesakārī. Avañjhānitvevāhaṃ, bhikkhave, sikkhāpadāni vadāmī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these training rules, numbering more than one hundred and fifty, come up for recitation every half-month, and it is in these rules that young men of good family, seeking their own welfare, train. Monks, there are these three trainings wherein all this practice is comprised. Which three? The training in higher virtue, the training in higher mind, and the training in higher wisdom—these, monks, are the three trainings wherein all this practice is comprised.\n\nHere, monks, a monk is one who fulfills virtue completely, one who fulfills concentration completely, and one who fulfills wisdom completely. He sometimes commits and sometimes recovers from those minor and secondary training rules. Why is that? Because, monks, incapability is not declared in this respect. However, concerning those training rules that pertain to the beginning of the Holy Life and are appropriate to the Holy Life, he is steady in virtue and firm in virtue, and he undertakes and trains in those training rules. Through the destruction of the taints, having realized for himself with direct knowledge in this very life the taintless liberation of mind and liberation through wisdom, he enters upon and dwells therein.\n\nOr, failing to attain or fully realize that, through the complete elimination of the five lower fetters, he becomes one who attains Nibbāna in the interval between rebirths. Or, failing to attain or fully realize that, through the complete elimination of the five lower fetters, he becomes one who attains Nibbāna upon reaching the heavenly realm. Or, failing to attain or fully realize that, through the complete elimination of the five lower fetters, he becomes one who attains Nibbāna effortlessly. Or, failing to attain or fully realize that, through the complete elimination of the five lower fetters, he becomes one who attains Nibbāna with exertion. Or, failing to attain or fully realize that, through the complete elimination of the five lower fetters, he becomes one who flows upstream, heading for the Akaniṭṭha realm. Or, failing to attain or fully realize that, through the complete elimination of three fetters and the attenuation of passion, aversion, and delusion, he becomes a Once-Returner, who having come back to this world just one more time, makes an end of suffering. Or, failing to attain or fully realize that, through the complete elimination of three fetters, he becomes a One-Seeder, who having generated only one human existence, makes an end of suffering. Or, failing to attain or fully realize that, through the complete elimination of three fetters, he becomes a Family-to-Family traveler, who having roamed and wandered through two or three families makes an end of suffering. Or, failing to attain or fully realize that, through the complete elimination of three fetters, he becomes one limited to seven births, who having roamed and wandered among gods and men for a maximum of seven times, makes an end of suffering.\n\nThus, monks, the one who fulfills the training completely achieves complete attainment, and the one who fulfills the training partially achieves partial attainment. I declare, monks, that these training rules are never barren of result.",
      "sinhala": "මහණෙනි, එකසිය පනහකට අධික මේ ශික්‍ෂාපද සමූහය අඩමසකට වරක් පාතිමෝක්‍ෂ උද්දේශය පිණිස එන්නේය. තමන්ගේ යහපත කැමති කුලපුත්‍රයෝ යම් තැනක හික්මෙත්ද.\n\nමහණෙනි, මේ ත්‍රිවිධ ශික්‍ෂාවෝ වෙති. යම් තැනකට මේ සියල්ලම ඇතුළත් වන්නේද. ඒ තුන කවරේද? අධිසීල ශික්‍ෂාව, අධිචිත්ත ශික්‍ෂාව, අධිප්‍රඥා ශික්‍ෂාව යන මේ ත්‍රිවිධ ශික්‍ෂාවෝ වෙති. යම් තැනකට මේ සියල්ලම ඇතුළත් වන්නේද.\n\nමහණෙනි, මෙහිලා භික්‍ෂුව සීලයන්හි සම්පූර්ණ කරනසුලු (පරිපූර්ණකාරී) වන්නේය, සමාධියෙහි සම්පූර්ණ කරනසුලු වන්නේය, ප්‍රඥාවෙහි සම්පූර්ණ කරනසුලු වන්නේය. හෙතෙම යම් ඒ ඉතා සුළු සහ අනුසුළු ශික්‍ෂාපද ඇද්ද, ඒවාට පැමිණෙන්නේද (නොදැනුවත්ව සිඳින්නේද), නැවත එයින් නැගී සිටින්නේද (යථා පරිදි පිහිටන්නේද). එයට හේතුව කිමෙක්ද? මහණෙනි, මෙහිලා අප විසින් අභව්‍ය බවක් (කළ නොහැකි දෙයක්) ප්‍රකාශ කර නොමැත. යම් ඒ ශික්‍ෂාපද පිරිසුදු පැවැත්මට (බ්‍රහ්මචර්යාවට) මුල් වූවාහු ද, බ්‍රහ්මචර්යාවට අනුරූප වූවාහු ද, එහිලා ස්ථීරශීලී ද, නොසෙල්වෙන ශීලී ද වන්නේය. ඒ ශික්‍ෂාපද සමාදන්ව හික්මෙන්නේය. හෙතෙම ආශ්‍රවයන්ගේ ක්ෂය වීම නිසා ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන පැමිණ වාසය කරන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට එය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, එවිට ඕරම්භාගීය සංයෝජන පහ ක්ෂය වීම නිසා අන්තරාපරිනිබ්බායී වන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට එය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, එවිට ඕරම්භාගීය සංයෝජන පහ ක්ෂය වීම නිසා උපහච්චපරිනිබ්බායී වන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට එය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, එවිට ඕරම්භාගීය සංයෝජන පහ ක්ෂය වීම නිසා අසංඛාරපරිනිබ්බායී වන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට එය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, එවිට ඕරම්භාගීය සංයෝජන පහ ක්ෂය වීම නිසා සසංඛාරපරිනිබ්බායී වන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට එය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, එවිට ඕරම්භාගීය සංයෝජන පහ ක්ෂය වීම නිසා උද්ධංසෝත නම් වූ අකනිට්ඨගාමී වන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට ඒ විමුක්ති ඵලය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, සංයෝජන තුනක් ක්ෂය වීම නිසාත්, රාග, ද්වේෂ, මෝහයන්ගේ තුනී වීම නිසාත් සකදාගාමී වන්නේය. එක වරක් පමණක් මේ මනුෂ්‍ය ලෝකයට පැමිණ දුක් කෙළවර කරන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට ඒ විමුක්ති ඵලය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, සංයෝජන තුනක් ක්ෂය වීම නිසා ඒකබීජී වන්නේය. එක් මනුෂ්‍ය භවයක් පමණක් ඉපදවූයේ දුක් කෙළවර කරන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට ඒ විමුක්ති ඵලය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, සංයෝජන තුනක් ක්ෂය වීම නිසා කෝලංකෝල වන්නේය. දෙකක් හෝ තුනක් වූ කුලයන්හි ඉපද සංසාරයේ සැරිසරා දුක් කෙළවර කරන්නේය. එසේ නැතහොත්, යම් හෙයකින් ඔහුට ඒ විමුක්ති ඵලය සම්භවනයට පත් කරගත නොහැකි වූයේද, ප්‍රත්‍යක්ෂ කරගත නොහැකි වූයේද, සංයෝජන තුනක් ක්ෂය වීම නිසා සත්ථක්ඛත්තුපරම වන්නේය. උපරිම වශයෙන් සත් වරක් දෙවියන් අතරේද, මනුෂ්‍යයන් අතරේද ඉපද සංසාරයේ සැරිසරා දුක් කෙළවර කරන්නේය.\n\nමහණෙනි, මෙසේ සම්පූර්ණ කරනසුලු තැනැත්තා සම්පූර්ණ ඵලය සාක්ෂාත් කරගන්නේය, අර්ධ වශයෙන් කරනසුලු තැනැත්තා අර්ධ ඵලය සාක්ෂාත් කරගන්නේය. මහණෙනි, මේ ශික්‍ෂාපද නිශ්ඵල නොවන බවම මම කියමි.",
      "paliTitle": "Tatiyasikkhāsuttaṃ"
    },
    {
      "number": 90,
      "pali": "‘‘Tisso imā, bhikkhave, sikkhā. Katamā tisso? Adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā. ‘‘Katamā ca, bhikkhave, adhisīlasikkhā? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Ayaṃ vuccati, bhikkhave, adhisīlasikkhā. ‘‘Katamā ca, bhikkhave, adhicittasikkhā? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, adhicittasikkhā. ‘‘Katamā ca, bhikkhave, adhipaññāsikkhā? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Ayaṃ vuccati, bhikkhave, adhipaññāsikkhā. Imā kho, bhikkhave, tisso sikkhā’’ti. Navamaṃ.",
      "english": "Monks, these are the three trainings. What are the three? The higher training in morality, the higher training in mind, and the higher training in wisdom.\n\nAnd what, monks, is the higher training in morality? Here, monks, a monk is virtuous... he undertakes and trains himself in the rules of training. This, monks, is called the higher training in morality.\n\nAnd what, monks, is the higher training in mind? Here, monks, a monk—quite secluded from sensual pleasures... he enters and dwells in the fourth meditative absorption. This, monks, is called the higher training in mind.\n\nAnd what, monks, is the higher training in wisdom? Here, monks, a monk understands 'This is suffering' as it actually is... he understands 'This is the path leading to the cessation of suffering' as it actually is. This, monks, is called the higher training in wisdom.\n\nThese, monks, are the three trainings.",
      "sinhala": "මහණෙනි, මේ ශික්‍ෂාවෝ තුනකි. කවරේද ඒ තුන? අධිසීල ශික්‍ෂාව, අධිචිත්ත ශික්‍ෂාව, අධිප්‍රඥා ශික්‍ෂාවයි.\n\nමහණෙනි, අධිසීල ශික්‍ෂාව කවරේද? මහණෙනි, මෙහිලා භික්‍ෂුව සිල්වත් වේ... (ආදිය)... ශික්‍ෂාපදයන් සමාදන්ව හික්මෙයි. මහණෙනි, මෙය අධිසීල ශික්‍ෂාව යැයි කියනු ලැබේ.\n\nමහණෙනි, අධිචිත්ත ශික්‍ෂාව කවරේද? මහණෙනි, මෙහිලා භික්‍ෂුව කාමයන්ගෙන් වෙන්වම... (ආදිය)... සිව්වෙනි ධ්‍යානය උපදවාගෙන වාසය කරයි. මහණෙනි, මෙය අධිචිත්ත ශික්‍ෂාව යැයි කියනු ලැබේ.\n\nමහණෙනි, අධිප්‍රඥා ශික්‍ෂාව කවරේද? මහණෙනි, මෙහිලා භික්‍ෂුව 'මේ දුක' යැයි ඇති සැටියෙන් අවබෝධ කරයි... (ආදිය)... 'මේ දුක් නිරෝධගාමිනී ප්‍රතිපදාව' යැයි ඇති සැටියෙන් අවබෝධ කරයි. මහණෙනි, මෙය අධිප්‍රඥා ශික්‍ෂාව යැයි කියනු ලැබේ.\n\nමහණෙනි, මේවා ඒ ශික්‍ෂාවෝ තුන වෙති.",
      "paliTitle": "Paṭhamasikkhattayasuttaṃ"
    },
    {
      "number": 91,
      "pali": "‘‘Tisso imā, bhikkhave, sikkhā. Katamā tisso? Adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā. ‘‘Katamā ca, bhikkhave, adhisīlasikkhā? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Ayaṃ vuccati, bhikkhave, adhisīlasikkhā. ‘‘Katamā ca, bhikkhave, adhicittasikkhā? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, adhicittasikkhā. ‘‘Katamā ca, bhikkhave, adhipaññāsikkhā? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, bhikkhave, adhipaññā sikkhā. Imā kho, bhikkhave, tisso sikkhā’’ti. ‘‘Adhisīlaṃ adhicittaṃ, adhipaññañca vīriyavā; Thāmavā dhitimā jhāyī, sato guttindriyo [uppattindriyo (ka.)] care. ‘‘Yathā pure tathā pacchā, yathā pacchā tathā pure; Yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho. ‘‘Yathā divā tathā rattiṃ, yathā rattiṃ tathā divā; Abhibhuyya disā sabbā, appamāṇasamādhinā. ‘‘Tamāhu sekhaṃ paṭipadaṃ [pāṭipadaṃ (?) ma. ni. 2.27 passitabbaṃ], atho saṃsuddhacāriyaṃ [saṃsuddhacāraṇaṃ (sī. pī.), saṃsuddhacārinaṃ (syā. kaṃ.)]; Tamāhu loke sambuddhaṃ, dhīraṃ paṭipadantaguṃ. ‘‘Viññāṇassa nirodhena, taṇhākkhayavimuttino; Pajjotasseva nibbānaṃ, vimokkho hoti cetaso’’ti. dasamaṃ;",
      "english": "Monks, there are these three trainings. Which three? The training in higher virtue, the training in higher mind, and the training in higher wisdom.\n\nAnd what, Monks, is the training in higher virtue? Here, Monks, a monk is virtuous, undertaking and training in the training rules. This, Monks, is called the training in higher virtue.\n\nAnd what, Monks, is the training in higher mind? Here, Monks, a monk, quite secluded from sensual pleasures... achieves and abides in the fourth absorption (jhāna). This, Monks, is called the training in higher mind.\n\nAnd what, Monks, is the training in higher wisdom? Here, Monks, a monk, through the destruction of the taints, achieves and abides in the stainless liberation of mind and liberation through wisdom, having realized and directly known it for himself in this very life. This, Monks, is called the training in higher wisdom.\n\nThese, Monks, are the three trainings.\n\nEnergetic, resolute, firm in perseverance, meditating, mindful, and with guarded faculties, one should proceed in higher virtue, higher mind, and higher wisdom.\n\nJust as before, so after; just as after, so before. Just as below, so above; just as above, so below.\n\nJust as during the day, so during the night; just as during the night, so during the day. Overcoming all directions with boundless concentration.\n\nThat they call the path of the trainee, and also the purified way of life. That they call the Fully Awakened One in the world, the steady sage who has reached the limit of the path.\n\nThrough the cessation of consciousness, for one liberated by the destruction of craving, the liberation of the mind is Nibbāna, like a lamp extinguishing.",
      "sinhala": "මහණෙනි, මේ ශික්ෂාවෝ (පුහුණු කිරීම්) තුනකි. කවරේද ඒ තුන? අධිශීල ශික්ෂාව, අධිචිත්ත ශික්ෂාව, අධිප්‍රඥා ශික්ෂාව යන මේවාය.\n\nමහණෙනි, අධිශීල ශික්ෂාව කවරේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව සිල්වත් වේ…පෙ… ශික්ෂා පදයන් සමාදන්ව පුරුදු කරන්නේය. මහණෙනි, මේ අධිශීල ශික්ෂාව යැයි කියනු ලැබේ.\n\nමහණෙනි, අධිචිත්ත ශික්ෂාව කවරේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව කාමයන්ගෙන් වෙන්වම…පෙ… සිවුවන ධ්‍යානයට පැමිණ වාසය කරන්නේය. මහණෙනි, මේ අධිචිත්ත ශික්ෂාව යැයි කියනු ලැබේ.\n\nමහණෙනි, අධිප්‍රඥා ශික්ෂාව කවරේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ආශ්‍රවයන්ගේ ක්ෂය වීම නිසා, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය මේ අත්මභාවයේදීම තමා විසින්ම අවබෝධයෙන් ප්‍රත්‍යක්ෂ කොට ලබා වාසය කරයි. මහණෙනි, මේ අධිප්‍රඥා ශික්ෂාව යැයි කියනු ලැබේ. මහණෙනි, සැබවින්ම මේ ශික්ෂාවෝ තුනකි.\n\nවීර්යවත්ව අධිශීලයෙහිද, අධිචිත්තයෙහිද, අධිප්‍රඥාවෙහිද පිහිටා, ස්ථිර ගතියෙන් යුතුව, අධිෂ්ඨාන සම්පත්තියෙන් යුක්තව, ධ්‍යාන වඩන සුලු වූ, සිහි ඇති, ආරක්‍ෂා කරන ලද ඉන්ද්‍රියයන් ඇතිව හැසිරිය යුත්තේය.\n\nපෙර ලෙසම පසුවද, පසුව ලෙසම පෙරද; යට ලෙසම උඩද, උඩ ලෙසම යටද (භාවනා කළ යුත්තේය).\n\nදිවා කාලයේ ලෙසම රාත්‍රියේද, රාත්‍රියේ ලෙසම දිවා කාලයේද; අප්‍රමාණ වූ සමාධියෙන් සියලු දිශාවන් මැඩ පවත්වා (භාවනා කළ යුත්තේය).\n\nඒ තැනැත්තාගේ හැසිරීම ශික්ෂා මාර්ගය ලෙසද, තවද සම්පූර්ණයෙන්ම පිරිසිදු වූ හැසිරීම ලෙසද හඳුන්වති. ඒ මඟෙහි කෙළවරට පැමිණි, ධෛර්යවත් ඒ පුද්ගලයා ලෝකයෙහි සම්බුද්ධයාණන් වහන්සේ යැයි හඳුන්වති.\n\nතණ්හාව ක්ෂය වීමෙන් ලැබූ විමුක්තිය ඇති, විඤ්ඤාණය නිරුද්ධ වීමෙන්, පහනක් නිවී යන සේ, ඔහුගේ සිතේ විමෝක්ෂය නිවන වන්නේය.",
      "paliTitle": "Dutiyasikkhattayasuttaṃ"
    },
    {
      "number": 92,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena saṅkavā [paṅkadhā (sī. syā. kaṃ. pī.)] nāma kosalānaṃ nigamo tadavasari. Tatra sudaṃ bhagavā saṅkavāyaṃ viharati. Tena kho pana samayena kassapagotto nāma bhikkhu saṅkavāyaṃ āvāsiko hoti. Tatra sudaṃ bhagavā sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandasseti samādapeti samuttejeti sampahaṃseti. Atha kho kassapagottassa bhikkhuno bhagavati sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandassente samādapente samuttejente sampahaṃsente ahudeva akkhanti ahu appaccayo – ‘‘adhisallikhatevāyaṃ [adhisallekhatevāyaṃ (syā. kaṃ. ka.)] samaṇo’’ti. Atha kho bhagavā saṅkavāyaṃ yathābhirantaṃ viharitvā yena rājagahaṃ tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena rājagahaṃ tadavasari. Tatra sudaṃ bhagavā rājagahe viharati. Atha kho kassapagottassa bhikkhuno acirapakkantassa bhagavato ahudeva kukkuccaṃ ahu vippaṭisāro – ‘‘alābhā vata me, na vata me lābhā; dulladdhaṃ vata me, na vata me suladdhaṃ; yassa me bhagavati sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandassente samādapente samuttejente sampahaṃsente ahudeva akkhanti ahu appaccayo – ‘adhisallikhatevāyaṃ samaṇo’ti. Yaṃnūnāhaṃ yena bhagavā tenupasaṅkameyyaṃ; upasaṅkamitvā bhagavato santike accayaṃ accayato deseyya’’nti. Atha kho kassapagotto bhikkhu senāsanaṃ saṃsāmetvā pattacīvaramādāya yena rājagahaṃ tena pakkāmi. Anupubbena yena rājagahaṃ yena gijjhakūṭo pabbato yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho kassapagotto bhikkhu bhagavantaṃ etadavoca – ‘‘Ekamidaṃ, bhante, samayaṃ bhagavā saṅkavāyaṃ viharati, saṅkavā nāma kosalānaṃ nigamo. Tatra, bhante, bhagavā sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandassesi samādapesi samuttejesi sampahaṃsesi. Tassa mayhaṃ bhagavati sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandassente samādapente samuttejente sampahaṃsente ahudeva akkhanti ahu appaccayo – ‘adhisallikhatevāyaṃ samaṇo’ti. Atha kho bhagavā saṅkavāyaṃ yathābhirantaṃ viharitvā yena rājagahaṃ tena cārikaṃ pakkāmi. ( ) [(anupubbena cārikaṃ caramāno yena rājagahaṃ tadavasari. tatra sudaṃ bhagavā rājagahe viharati. atha kho (ka.)] Tassa mayhaṃ, bhante, acirapakkantassa bhagavato ahudeva kukkuccaṃ ahu vippaṭisāro – alābhā vata me, na vata me lābhā; dulladdhaṃ vata me, na vata me suladdhaṃ; yassa me bhagavati sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandassente samādapente samuttejente sampahaṃsente ahudeva akkhanti ahu appaccayo – ‘adhisallikhatevāyaṃ samaṇo’ti. Yaṃnūnāhaṃ yena bhagavā tenupasaṅkameyyaṃ; upasaṅkamitvā bhagavato santike accayaṃ accayato deseyyanti. Accayo maṃ, bhante, accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ yassa me bhagavati sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandassente samādapente samuttejente sampahaṃsente ahudeva akkhanti ahu appaccayo – ‘adhisallikhatevāyaṃ samaṇo’ti. Tassa me, bhante, bhagavā accayaṃ accayato paṭiggaṇhātu, āyatiṃ saṃvarāyā’’ti. ‘‘Taggha taṃ [taggha tvaṃ (sī. pī.)], kassapa, accayo accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yassa te mayi sikkhāpadapaṭisaṃyuttāya dhammiyā kathāya bhikkhū sandassente samādapente samuttejente sampahaṃsente ahudeva akkhanti ahu appaccayo – ‘adhisallikhatevāyaṃ samaṇo’ti. Yato ca kho tvaṃ, kassapa, accayaṃ accayato disvā yathādhammaṃ paṭikarosi, taṃ te mayaṃ paṭiggaṇhāma. Vuddhihesā, kassapa, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti, āyatiṃ saṃvaraṃ āpajjati. ‘‘Thero cepi, kassapa, bhikkhu hoti na sikkhākāmo na sikkhāsamādānassa vaṇṇavādī, ye caññe bhikkhū na sikkhākāmā te ca na sikkhāya samādapeti, ye caññe bhikkhū sikkhākāmā tesañca na vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena, evarūpassāhaṃ, kassapa, therassa bhikkhuno na vaṇṇaṃ bhaṇāmi. Taṃ kissa hetu? Satthā hissa vaṇṇaṃ bhaṇatīti aññe naṃ [taṃ (sī. pī.)] bhikkhū bhajeyyuṃ, ye naṃ bhajeyyuṃ tyāssa diṭṭhānugatiṃ āpajjeyyuṃ, yyāssa diṭṭhānugatiṃ āpajjeyyuṃ tesaṃ taṃ assa dīgharattaṃ ahitāya dukkhāyāti. Tasmāhaṃ, kassapa, evarūpassa therassa bhikkhuno na vaṇṇaṃ bhaṇāmi. ‘‘Majjhimo cepi, kassapa, bhikkhu hoti…pe… navo cepi, kassapa, bhikkhu hoti na sikkhākāmo na sikkhāsamādānassa vaṇṇavādī, ye caññe bhikkhū na sikkhākāmā te ca na sikkhāya samādapeti, ye caññe bhikkhū sikkhākāmā tesañca na vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena, evarūpassāhaṃ, kassapa, navassa bhikkhuno na vaṇṇaṃ bhaṇāmi. Taṃ kissa hetu? Satthā hissa vaṇṇaṃ bhaṇatīti aññe naṃ bhikkhū bhajeyyuṃ, ye naṃ bhajeyyuṃ tyāssa diṭṭhānugatiṃ āpajjeyyuṃ, yyāssa diṭṭhānugatiṃ āpajjeyyuṃ tesaṃ taṃ assa dīgharattaṃ ahitāya dukkhāyāti. Tasmāhaṃ, kassapa, evarūpassa navassa bhikkhuno na vaṇṇaṃ bhaṇāmi. ‘‘Thero cepi, kassapa, bhikkhu hoti sikkhākāmo sikkhāsamādānassa vaṇṇavādī, ye caññe bhikkhū na sikkhākāmā te ca sikkhāya samādapeti, ye caññe bhikkhū sikkhākāmā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena, evarūpassāhaṃ, kassapa, therassa bhikkhuno vaṇṇaṃ bhaṇāmi. Taṃ kissa hetu? Satthā hissa vaṇṇaṃ bhaṇatīti aññe naṃ bhikkhū bhajeyyuṃ, ye naṃ bhajeyyuṃ tyāssa diṭṭhānugatiṃ āpajjeyyuṃ, yyāssa diṭṭhānugatiṃ āpajjeyyuṃ tesaṃ taṃ assa dīgharattaṃ hitāya sukhāyāti. Tasmāhaṃ, kassapa, evarūpassa therassa bhikkhuno vaṇṇaṃ bhaṇāmi. ‘‘Majjhimo cepi, kassapa, bhikkhu hoti sikkhākāmo…pe… navo cepi, kassapa, bhikkhu hoti sikkhākāmo sikkhāsamādānassa vaṇṇavādī, ye caññe bhikkhū na sikkhākāmā te ca sikkhāya samādapeti, ye caññe bhikkhū sikkhākāmā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena, evarūpassāhaṃ, kassapa, navassa bhikkhuno vaṇṇaṃ bhaṇāmi. Taṃ kissa hetu? Satthā hissa vaṇṇaṃ bhaṇatīti aññe naṃ bhikkhū bhajeyyuṃ, ye naṃ bhajeyyuṃ tyāssa diṭṭhānugatiṃ āpajjeyyuṃ, yyāssa diṭṭhānugatiṃ āpajjeyyuṃ tesaṃ taṃ assa dīgharattaṃ hitāya sukhāyāti. Tasmāhaṃ, kassapa, evarūpassa navassa bhikkhuno vaṇṇaṃ bhaṇāmī’’ti. Ekādasamaṃ. ",
      "english": "On one occasion, the Blessed One, while wandering on tour through the Kosala country with a large assembly of monks, arrived at Saṅkavā, a market town belonging to the Kosalans. The Blessed One stayed there in Saṅkavā. At that time, a monk named Kassapagotta was residing in Saṅkavā. There, the Blessed One instructed, encouraged, inspired, and gladdened the monks with a talk on the Dhamma connected with the rules of training. But while the Blessed One was instructing, encouraging, inspiring, and gladdening the monks with this Dhamma talk connected with the rules of training, dissatisfaction and displeasure arose in the monk Kassapagotta, and he thought: \"This ascetic is excessively severe.\"\n\nThen, the Blessed One, having stayed in Saṅkavā for as long as he wished, set out on tour toward Rājagaha. Wandering step by step, he arrived at Rājagaha. The Blessed One stayed there in Rājagaha. Not long after the Blessed One had departed, regret and remorse arose in the monk Kassapagotta. He thought: \"Truly, this was a loss for me; it was no gain for me! Truly, this was ill-gained for me; it was not well-gained for me!—in that, while the Blessed One was instructing, encouraging, inspiring, and gladdening the monks with a Dhamma talk connected with the rules of training, dissatisfaction and displeasure arose in me, thinking: 'This ascetic is excessively severe.' Why don't I approach the Blessed One? Having approached, I shall confess my fault as a fault in the presence of the Blessed One.\"\n\nThen the monk Kassapagotta put his lodging in order, took his bowl and robe, and set out toward Rājagaha. Wandering step by step, he approached Rājagaha, Vulture Peak Mountain, and where the Blessed One was staying. Having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, the monk Kassapagotta said to the Blessed One: \"On one occasion, Venerable Sir, the Blessed One was staying in Saṅkavā, a market town of the Kosalans. There, Venerable Sir, the Blessed One instructed, encouraged, inspired, and gladdened the monks with a Dhamma talk connected with the rules of training. While the Blessed One was instructing, encouraging, inspiring, and gladdening the monks with this Dhamma talk connected with the rules of training, dissatisfaction and displeasure arose in me, thinking: 'This ascetic is excessively severe.' Then the Blessed One, having stayed in Saṅkavā for as long as he wished, set out on tour toward Rājagaha. Venerable Sir, not long after the Blessed One had departed, regret and remorse arose in me: 'Truly, this was a loss for me; it was no gain for me! Truly, this was ill-gained for me; it was not well-gained for me!—in that, while the Blessed One was instructing, encouraging, inspiring, and gladdening the monks with a Dhamma talk connected with the rules of training, dissatisfaction and displeasure arose in me, thinking: \"This ascetic is excessively severe.\" Why don't I approach the Blessed One? Having approached, I shall confess my fault as a fault in the presence of the Blessed One.' Venerable Sir, this fault overwhelmed me, done foolishly, ignorantly, and unskillfully—in that, while the Blessed One was instructing, encouraging, inspiring, and gladdening the monks with a Dhamma talk connected with the rules of training, dissatisfaction and displeasure arose in me, thinking: 'This ascetic is excessively severe.' Therefore, Venerable Sir, may the Blessed One accept this fault as a fault from me, so that I may restrain myself in the future.\"\n\n\"Indeed, Kassapa, this fault overwhelmed you, done foolishly, ignorantly, and unskillfully—in that, while I was instructing, encouraging, inspiring, and gladdening the monks with a Dhamma talk connected with the rules of training, dissatisfaction and displeasure arose in you, thinking: 'This ascetic is excessively severe.' However, Kassapa, since you have seen this fault as a fault and made amends according to the Dhamma, we accept it from you. Truly, Kassapa, this is growth in the Noble Discipline: that having seen a fault as a fault, one makes amends according to the Dhamma and undertakes future restraint.\"\n\n\"If a monk is an Elder, Kassapa, but is not desirous of training, nor one who speaks in praise of undertaking the training; and he neither encourages other monks who are not desirous of training to undertake the training; nor does he praise, truthfully, rightly, and at the proper time, those monks who are desirous of training—I do not praise such an Elder monk, Kassapa. For what reason? [I fear that if I were to praise him], other monks might associate with him, thinking: 'The Teacher praises him.' Those who associate with him would follow his example. And for those who follow his example, that would lead to their harm and suffering for a long time.\"\n\nTherefore, Kassapa, I do not speak praise of such an elder bhikkhu.\n\nEven if he is a middle bhikkhu, Kassapa, or even if he is a novice bhikkhu, who is not desirous of the training, who does not speak praise of undertaking the training, and who does not encourage other bhikkhus who are not desirous of the training to undertake the training, and who does not speak praise—that is true, factual, and timely—of those other bhikkhus who are desirous of the training, I do not speak praise, Kassapa, of such a novice bhikkhu. What is the reason for that? Thinking, ‘The Teacher praises him,’ other bhikkhus might associate with him, and those who associate with him would follow his example, and for those who follow his example, that would lead to long-term harm and suffering. Therefore, Kassapa, I do not speak praise of such a novice bhikkhu.\n\nEven if he is an elder bhikkhu, Kassapa, who is desirous of the training, who speaks praise of undertaking the training, and who encourages other bhikkhus who are not desirous of the training to undertake the training, and who speaks praise—that is true, factual, and timely—of those other bhikkhus who are desirous of the training, I speak praise, Kassapa, of such an elder bhikkhu. What is the reason for that? Thinking, ‘The Teacher praises him,’ other bhikkhus might associate with him, and those who associate with him would follow his example, and for those who follow his example, that would lead to long-term welfare and happiness. Therefore, Kassapa, I speak praise of such an elder bhikkhu.\n\nEven if he is a middle bhikkhu, Kassapa, who is desirous of the training, or even if he is a novice bhikkhu, who is desirous of the training, who speaks praise of undertaking the training, and who encourages other bhikkhus who are not desirous of the training to undertake the training, and who speaks praise—that is true, factual, and timely—of those other bhikkhus who are desirous of the training, I speak praise, Kassapa, of such a novice bhikkhu. What is the reason for that? Thinking, ‘The Teacher praises him,’ other bhikkhus might associate with him, and those who associate with him would follow his example, and for those who follow his example, that would lead to long-term welfare and happiness. Therefore, Kassapa, I speak praise of such a novice bhikkhu.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ විශාල භික්‍ෂුසංඝයක් සමග කෝසල ජනපදයේ චාරිකාවේ වඩමින් කෝසල ජනපදයේ සංකවා නම් නියම් ගමට වැඩම කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ සංකවා නියම් ගමෙහි වැඩ වාසය කළ සේක.\n\nඑසමයෙහි කස්සපගොත්ත නම් භික්‍ෂුවක් සංකවා නියම් ගමෙහි වාසය කරමින් සිටියේය. එහිදී භාග්‍යවතුන් වහන්සේ ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් සිටි සේක.\n\nඑවිට භාග්‍යවතුන් වහන්සේ ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් සිටියදී කස්සපගොත්ත භික්‍ෂුවට \"මේ ශ්‍රමණයෝ අධික ලෙස කෙලෙස් සලිත කරති\" යි සිතා අකමැත්තක් හා අසතුටක් ඇති විය.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ සංකවා නියම් ගමෙහි යම් තාක් කල් කැමති සේ වැඩ වාසය කොට රජගහ නුවර දෙසට චාරිකාවේ වැඩි සේක. අනුක්‍රමයෙන් චාරිකාවේ වඩමින් රජගහ නුවරට වැඩම කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ රජගහ නුවර වැඩ වාසය කළ සේක.\n\nභාග්‍යවතුන් වහන්සේ වැඩි සැනින්ම කස්සපගොත්ත භික්‍ෂුවට පසුතැවීමක් හා විපිළිසර බවක් ඇති විය: \"අහෝ, මා ලද දේ අලාභයකි! මට ලාභයක් නොවීය! මා ලැබුවේ අයහපතකි, යහපතක් නොවීය! යම් හෙයකින් භාග්‍යවතුන් වහන්සේ ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් සිටියදී 'මේ ශ්‍රමණයෝ අධික ලෙස කෙලෙස් සලිත කරති' යි සිතා මට අකමැත්තක් හා අසතුටක් ඇති වූයේ නම් එය අයහපතකි. මම භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, පැමිණ භාග්‍යවතුන් වහන්සේ ඉදිරියේ ඒ වරද වරදක් ලෙස ප්‍රකාශ කළොත් හොඳය.\"\n\nඉක්බිති කස්සපගොත්ත භික්‍ෂුව සෙනසුන සකස් කොට පාත්‍ර සිවුරු ගෙන රජගහ නුවර දෙසට ගමන් කළේය. අනුක්‍රමයෙන් රජගහ නුවරට, ගිජුකුළු පව්වට, භාග්‍යවතුන් වහන්සේ වැඩ සිටි ස්ථානයට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආදරයෙන් වැඳ එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි කස්සපගොත්ත භික්‍ෂුව භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භාග්‍යවතුන් වහන්ස, එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයේ නියම් ගමක් වන සංකවාවේ වැඩ වාසය කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වූ සේක, සමාදන් කරවූ සේක, උනන්දු කරවූ සේක, සතුටු කරවූ සේක. භාග්‍යවතුන් වහන්සේ ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් සිටියදී 'මේ ශ්‍රමණයෝ අධික ලෙස කෙලෙස් සලිත කරති' යි සිතා මට අකමැත්තක් හා අසතුටක් ඇති විය.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ සංකවාවේ යම් තාක් කල් කැමති සේ වැඩ වාසය කොට රජගහ නුවර දෙසට චාරිකාවේ වැඩි සේක. භාග්‍යවතුන් වහන්සේ වැඩි සැනින්ම මට පසුතැවීමක් හා විපිළිසර බවක් ඇති විය: 'අහෝ, මා ලද දේ අලාභයකි, මට ලාභයක් නොවීය! මා ලැබුවේ අයහපතකි, යහපතක් නොවීය! යම් හෙයකින් භාග්‍යවතුන් වහන්සේ ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් සිටියදී 'මේ ශ්‍රමණයෝ අධික ලෙස කෙලෙස් සලිත කරති' යි සිතා මට අකමැත්තක් හා අසතුටක් ඇති වූයේ නම් එය අයහපතකි. මම භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, පැමිණ භාග්‍යවතුන් වහන්සේ ඉදිරියේ ඒ වරද වරදක් ලෙස ප්‍රකාශ කළොත් හොඳය.' භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් සිටියදී 'මේ ශ්‍රමණයෝ අධික ලෙස කෙලෙස් සලිත කරති' යි සිතා මට අකමැත්තක් හා අසතුටක් ඇති වීම නමැති වරද නූගත් අඥාන අකුසල සහගත ක්‍රියාවක් ලෙස මට සිදු විය. භාග්‍යවතුන් වහන්ස, අනාගතයේ සංවරය පිණිස මාගේ ඒ වරද වරදක් ලෙස පිළිගත මැනව!\"\n\n\"කස්සප, සැබැවින්ම නුඹට ඒ වරද නූගත් අඥාන අකුසල සහගත ක්‍රියාවක් ලෙස සිදු විය. යම් හෙයකින් මා ශික්‍ෂාපද හා සම්බන්ධ ධර්ම කථාවකින් භික්‍ෂූන් වහන්සේලා දේශනා කොට පෙන්වමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් සිටියදී 'මේ ශ්‍රමණයෝ අධික ලෙස කෙලෙස් සලිත කරති' යි සිතා නුඹට අකමැත්තක් හා අසතුටක් ඇති වූයේ නම් එය වරදකි. එහෙත් කස්සප, නුඹ වරද වරදක් ලෙස දැක ධර්මානුකූලව පිළිසකර කරන බැවින් අපි එය පිළිගනිමු. කස්සප, ආර්ය විනයෙහි මෙය වර්ධනයක් වන්නේය. යමෙක් වරද වරදක් ලෙස දැක ධර්මානුකූලව පිළිසකර කොට අනාගතයේ සංවරයට පැමිණේද, එය වර්ධනයකි.\n\nකස්සප, යම් හෙයකින් භික්‍ෂුවක් තෙර නමක් වී නම්, ශික්‍ෂා කිරීමට කැමති නැති නම්, ශික්‍ෂා සමාදන්වීම් ප්‍රශංසා නොකරන්නේ නම්, අනිකුත් ශික්‍ෂා කිරීමට අකමැති භික්‍ෂූන්ව ශික්‍ෂා කිරීමට සමාදන් කරවන්නේද නැති නම්, ශික්‍ෂා කිරීමට කැමති අනිකුත් භික්‍ෂූන්ගේ ගුණ සත්‍ය වශයෙන්ම, ඇති සැටියෙන්ම, නියම කලට ප්‍රකාශ නොකරන්නේ නම්, කස්සප, එබඳු තෙර භික්‍ෂුවට මම ප්‍රශංසා නොකරමි. එයට හේතුව කුමක්ද? ශාස්තෘන් වහන්සේ ඔහුට ප්‍රශංසා කරති යි සිතා අන්‍ය භික්‍ෂූහු ඔහු ඇසුරු කරති. යමෙක් ඔහුව ඇසුරු කරත්ද, ඔහු ඇසුරු කරන්නෝ ඔහුගේ වැරදි දෘෂ්ටිය අනුගමනය කරති. යමෙක් ඔහුගේ දෘෂ්ටිය අනුගමනය කරත්ද, එය ඔවුන්ට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් වන්නේය.\"\n\nඑහෙයින් කස්සප, මම මෙබඳු තෙරණුවරක් භික්ෂුවකගේ වර්ණනාව නොකියමි. කස්සප, යම් හෙයකින් මැදුම් භික්ෂුවක් වුවත්... කස්සප, නවක භික්ෂුවක් වුවත්, ශික්‍ෂාවට කැමැති නැත්තේද, ශික්‍ෂා සමාදන් වීමේ වර්ණනාව නොකියන්නේද, අන්‍ය යම් භික්‍ෂූහු ශික්‍ෂාවට කැමැති නොවෙත්ද, ඔවුන්ද ශික්‍ෂාවෙහි සමාදන් කරවීමට අසමත් වේද, අන්‍ය යම් භික්‍ෂූහු ශික්‍ෂාවට කැමැති වෙත්ද, ඔවුන්ගේ වර්ණනාව යථාභූතව සත්‍ය ලෙස කාලය අනුව නොකියයිද, කස්සප, මෙබඳු නවක භික්ෂුවකගේ වර්ණනාව මම නොකියමි. එයට හේතුව කුමක්ද? ‘ශාස්තෲන්වහන්සේ ඔහුගේ වර්ණනාව කියන සේකැ’යි සිතා අන්‍ය භික්‍ෂූහු ඔහු සේවනය කරති. යම් කෙනෙක් ඔහු සේවනය කරත්ද, ඔවුහු ඔහුගේ දෘෂ්ටිය/ක්‍රියා මාර්ගය අනුව යෙති. යම් කෙනෙක් ඔහුගේ දෘෂ්ටිය අනුව යෙත්ද, එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක පිණිසත් වන්නේය. එහෙයින් කස්සප, මම මෙබඳු නවක භික්ෂුවකගේ වර්ණනාව නොකියමි.\n\nකස්සප, යම් හෙයකින් තෙරණුවරක් භික්ෂුවක් වුවත්, ශික්‍ෂාවට කැමැති වේද, ශික්‍ෂා සමාදන් වීමේ වර්ණනාව කියයිද, අන්‍ය යම් භික්‍ෂූහු ශික්‍ෂාවට කැමැති නොවෙත්ද, ඔවුන්ද ශික්‍ෂාවෙහි සමාදන් කරවයිද, අන්‍ය යම් භික්‍ෂූහු ශික්‍ෂාවට කැමැති වෙත්ද, ඔවුන්ගේ වර්ණනාව යථාභූතව සත්‍ය ලෙස කාලය අනුව කියයිද, කස්සප, මෙබඳු තෙරණුවරක් භික්ෂුවකගේ වර්ණනාව මම කියමි. එයට හේතුව කුමක්ද? ‘ශාස්තෲන්වහන්සේ ඔහුගේ වර්ණනාව කියන සේකැ’යි සිතා අන්‍ය භික්‍ෂූහු ඔහු සේවනය කරති. යම් කෙනෙක් ඔහු සේවනය කරත්ද, ඔවුහු ඔහුගේ දෘෂ්ටිය/ක්‍රියා මාර්ගය අනුව යෙති. යම් කෙනෙක් ඔහුගේ දෘෂ්ටිය අනුව යෙත්ද, එය ඔවුන්ට දීර්ඝ කාලයක් හිත පිණිසත් සැප පිණිසත් වන්නේය. එහෙයින් කස්සප, මම මෙබඳු තෙරණුවරක් භික්ෂුවකගේ වර්ණනාව කියමි.\n\nකස්සප, යම් හෙයකින් මැදුම් භික්ෂුවක් වුවත් ශික්‍ෂාවට කැමැති වේද... කස්සප, නවක භික්ෂුවක් වුවත්, ශික්‍ෂාවට කැමැති වේද, ශික්‍ෂා සමාදන් වීමේ වර්ණනාව කියයිද, අන්‍ය යම් භික්‍ෂූහු ශික්‍ෂාවට කැමැති නොවෙත්ද, ඔවුන්ද ශික්‍ෂාවෙහි සමාදන් කරවයිද, අන්‍ය යම් භික්‍ෂූහු ශික්‍ෂාවට කැමැති වෙත්ද, ඔවුන්ගේ වර්ණනාව යථාභූතව සත්‍ය ලෙස කාලය අනුව කියයිද, කස්සප, මෙබඳු නවක භික්ෂුවකගේ වර්ණනාව මම කියමි. එයට හේතුව කුමක්ද? ‘ශාස්තෲන්වහන්සේ ඔහුගේ වර්ණනාව කියන සේකැ’යි සිතා අන්‍ය භික්‍ෂූහු ඔහු සේවනය කරති. යම් කෙනෙක් ඔහු සේවනය කරත්ද, ඔවුහු ඔහුගේ දෘෂ්ටිය/ක්‍රියා මාර්ගය අනුව යෙති. යම් කෙනෙක් ඔහුගේ දෘෂ්ටිය අනුව යෙත්ද, එය ඔවුන්ට දීර්ඝ කාලයක් හිත පිණිසත් සැප පිණිසත් වන්නේය. එහෙයින් කස්සප, මම මෙබඳු නවක භික්ෂුවකගේ වර්ණනාව කියමි.",
      "paliTitle": "Saṅkavāsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Samaṇavaggo navamo. Tassuddānaṃ – Samaṇo gadrabho khettaṃ, vajjiputto ca sekkhakaṃ; Tayo ca sikkhanā vuttā, dve sikkhā saṅkavāya cāti.",
    "english": "",
    "sinhala": ""
  }
}