{
  "id": "an3.15",
  "title": {
    "pali": "Maṅgalavaggo",
    "english": "The Chapter on Blessings",
    "sinhala": "මංගල වග්ගය"
  },
  "sections": [
    {
      "number": 147,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi tīhi? Akusalena kāyakammena, akusalena vacīkammena, akusalena manokammena – imehi kho, bhikkhave, tīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Tīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi tīhi? Kusalena kāyakammena, kusalena vacīkammena, kusalena manokammena – imehi kho, bhikkhave, tīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ.",
      "english": "Monks, one endowed with three qualities is consigned to hell, just as if brought and laid down there. Which three? By unwholesome bodily action, by unwholesome verbal action, and by unwholesome mental action – indeed, monks, one endowed with these three qualities is consigned to hell, just as if brought and laid down there.\n\nMonks, one endowed with three qualities is consigned to heaven, just as if brought and laid down there. Which three? By wholesome bodily action, by wholesome verbal action, and by wholesome mental action – indeed, monks, one endowed with these three qualities is consigned to heaven, just as if brought and laid down there.",
      "sinhala": "භික්‌ෂූණි, ධර්ම තුනකින් යුක්ත වූ තැනැත්තා ගෙන ආ ආකාරයෙන්ම නිරයට පත් වේ. කවර තුනකින්ද? අකුසල කාය කර්මයෙන්ද, අකුසල වචී කර්මයෙන්ද, අකුසල මනෝ කර්මයෙන්ද - භික්‌ෂූණි, මේ ධර්ම තුනෙන් යුක්ත වූ තැනැත්තා ගෙන ආ ආකාරයෙන්ම නිරයට පත් වේ.\n\nභික්‌ෂූණි, ධර්ම තුනකින් යුක්ත වූ තැනැත්තා ගෙන ආ ආකාරයෙන්ම ස්වර්ගයට පත් වේ. කවර තුනකින්ද? කුසල කාය කර්මයෙන්ද, කුසල වචී කර්මයෙන්ද, කුසල මනෝ කර්මයෙන්ද - භික්‌ෂූණි, මේ ධර්ම තුනෙන් යුක්ත වූ තැනැත්තා ගෙන ආ ආකාරයෙන්ම ස්වර්ගයට පත් වේ.",
      "paliTitle": "Akusalasuttaṃ"
    },
    {
      "number": 148,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi tīhi? Sāvajjena kāyakammena, sāvajjena vacīkammena, sāvajjena manokammena – imehi kho, bhikkhave, tīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Tīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi tīhi? Anavajjena kāyakammena, anavajjena vacīkammena, anavajjena manokammena – imehi kho…pe… evaṃ sagge’’ti. Dutiyaṃ.",
      "english": "Monks, one endowed with three qualities is, just as if carried and laid down, thus deposited in hell. Which three? With blameworthy bodily action, with blameworthy verbal action, and with blameworthy mental action – indeed, monks, one endowed with these three qualities is, just as if carried and laid down, thus deposited in hell.\n\nMonks, one endowed with three qualities is, just as if carried and laid down, thus deposited in a heavenly realm. Which three? With blameless bodily action, with blameless verbal action, and with blameless mental action – indeed, monks, one endowed with these three qualities is, just as if carried and laid down, thus deposited in a heavenly realm.",
      "sinhala": "භික්ෂූනි, ධර්මයන් තුනකින් සමන්වාගත වූ තැනැත්තා යම් සේ රැගෙන එන ලද්දේද, එසේම නිරයේ පිහිටුවනු ලැබේ. කිනම් තුනකින්ද? සාවද්‍ය වූ කාය කර්මයෙන්, සාවද්‍ය වූ වචී කර්මයෙන්, සාවද්‍ය වූ මනෝ කර්මයෙන් යන මේ ධර්මයන් තුනකින් සමන්වාගත වූ තැනැත්තා යම් සේ රැගෙන එන ලද්දේද, එසේම නිරයේ පිහිටුවනු ලැබේ.\n\nභික්ෂූනි, ධර්මයන් තුනකින් සමන්වාගත වූ තැනැත්තා යම් සේ රැගෙන එන ලද්දේද, එසේම ස්වර්ගයෙහි පිහිටුවනු ලැබේ. කිනම් තුනකින්ද? අනවද්‍ය වූ කාය කර්මයෙන්, අනවද්‍ය වූ වචී කර්මයෙන්, අනවද්‍ය වූ මනෝ කර්මයෙන් යන මේ ධර්මයන් තුනකින් සමන්වාගත වූ තැනැත්තා යම් සේ රැගෙන එන ලද්දේද, එසේම ස්වර්ගයෙහි පිහිටුවනු ලැබේ.",
      "paliTitle": "Sāvajjasuttaṃ"
    },
    {
      "number": 149,
      "pali": "‘‘Tīhi, bhikkhave…pe… visamena kāyakammena, visamena vacīkammena, visamena manokammena – imehi kho…pe… evaṃ niraye. ‘‘Tīhi, bhikkhave, dhammehi…pe… samena kāyakammena, samena vacīkammena, samena manokammena – imehi kho…pe… evaṃ sagge’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, by means of three things, one is thus cast into hell. What three? By unrighteous bodily action, by unrighteous verbal action, and by unrighteous mental action. Indeed, by means of these three things, one is thus cast into hell.\n\nBhikkhus, by means of three qualities, one is thus born in heaven. What three? By righteous bodily action, by righteous verbal action, and by righteous mental action. Indeed, by means of these three qualities, one is thus born in heaven.",
      "sinhala": "මහණෙනි, යම් සත්වයෙක් අධර්මිෂ්ඨ වූ කායික කර්මයෙන් ද, අධර්මිෂ්ඨ වූ වාචසික කර්මයෙන් ද, අධර්මිෂ්ඨ වූ මානසික කර්මයෙන් ද යුක්ත වේ ද, ඒ ධර්මයන්ගෙන් යුක්ත වූ හෙයින් හෙතෙම එසේ නිරයෙහි උපදී.\n\nමහණෙනි, යම් සත්වයෙක් ධර්මිෂ්ඨ වූ කායික කර්මයෙන් ද, ධර්මිෂ්ඨ වූ වාචසික කර්මයෙන් ද, ධර්මිෂ්ඨ වූ මානසික කර්මයෙන් ද යුක්ත වේ ද, ඒ ධර්මයන්ගෙන් යුක්ත වූ හෙයින් හෙතෙම එසේ ස්වර්ගයෙහි උපදී.\n\nතෙවැන්නයි.",
      "paliTitle": "Visamasuttaṃ"
    },
    {
      "number": 150,
      "pali": "‘‘Tīhi, bhikkhave…pe… asucinā kāyakammena, asucinā vacīkammena, asucinā manokammena – imehi kho…pe… evaṃ niraye. ‘‘Tīhi, bhikkhave…pe… sucinā kāyakammena, sucinā vacīkammena, sucinā manokammena – imehi kho, bhikkhave, tīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Catutthaṃ.",
      "english": "Monks, a person endowed with three qualities is consigned to hell, just as if brought there. These are: by impure bodily action, by impure verbal action, and by impure mental action. Indeed, Monks, endowed with these three qualities, a person is thus consigned to hell, just as if brought there.\n\nMonks, a person endowed with three qualities is consigned to heaven, just as if brought there. These are: by pure bodily action, by pure verbal action, and by pure mental action. Indeed, Monks, endowed with these three qualities, a person is thus consigned to heaven, just as if brought there.",
      "sinhala": "භික්ෂූණි, අපිරිසිදු කායික කර්‍මයෙන්, අපිරිසිදු වාචසික කර්‍මයෙන්, අපිරිසිදු මානසික කර්‍මයෙන් යන මේ ධර්‍ම තුනෙන් යුක්ත වූ පුද්ගලයා, රැගෙන ගොස් දැමුවාක් මෙන් නිරයේ පිහිටුවනු ලැබේ.\n\nභික්ෂූණි, පිරිසිදු කායික කර්‍මයෙන්, පිරිසිදු වාචසික කර්‍මයෙන්, පිරිසිදු මානසික කර්‍මයෙන් යන මේ ධර්‍ම තුනෙන් යුක්ත වූ පුද්ගලයා, රැගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයේ පිහිටුවනු ලැබේ.",
      "paliTitle": "Asucisuttaṃ"
    },
    {
      "number": 151,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi tīhi? Akusalena kāyakammena, akusalena vacīkammena, akusalena manokammena – imehi kho, bhikkhave, tīhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. ‘‘Tīhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi tīhi? Kusalena kāyakammena, kusalena vacīkammena, kusalena manokammena…pe…. Pañcamaṃ.",
      "english": "Monks, endowed with three qualities, the foolish, undeveloped, ignoble person brings harm and ruin upon himself, is censurable and blameworthy by the discerning, and generates much demerit. What are these three? By unwholesome bodily action, by unwholesome verbal action, and by unwholesome mental action – Monks, it is by these three qualities that the foolish, undeveloped, ignoble person brings harm and ruin upon himself, is censurable and blameworthy by the discerning, and generates much demerit.\n\nMonks, endowed with three qualities, the wise, developed, noble person brings no harm or ruin upon himself, is uncensurable and blameless by the discerning, and generates much merit. What are these three? By wholesome bodily action, by wholesome verbal action, and by wholesome mental action – Monks, it is by these three qualities that the wise, developed, noble person brings no harm or ruin upon himself, is uncensurable and blameless by the discerning, and generates much merit. Fifth.",
      "sinhala": "භික්ෂූනි, කරුණු තුනකින් යුක්ත වූ බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ පුද්ගලයා තමාට විනාශය හා හානිය සිදුකර ගනී. ඔහු විඥානවන්තයන්ට දොස් සහිත ද, නින්දා සහිත ද වේ. තවද ඔහු බොහෝ අකුසල් රැස් කරයි. කවර කරුණු තුනකින් ද? අකුසල කායික කර්මයෙන්, අකුසල වාචසික කර්මයෙන්, අකුසල මානසික කර්මයෙන් යන මේ කරුණු තුනින් යුක්ත වූ භික්ෂූනි, බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ පුද්ගලයා තමාට විනාශය හා හානිය සිදුකර ගනී. ඔහු විඥානවන්තයන්ට දොස් සහිත ද, නින්දා සහිත ද වේ. තවද ඔහු බොහෝ අකුසල් රැස් කරයි.\n\nභික්ෂූනි, කරුණු තුනකින් යුක්ත වූ පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට විනාශය හෝ හානිය සිදුනොකර ගනී. ඔහු විඥානවන්තයන්ට දොස් රහිත ද, නින්දා රහිත ද වේ. තවද ඔහු බොහෝ කුසල් රැස් කරයි. කවර කරුණු තුනකින් ද? කුසල කායික කර්මයෙන්, කුසල වාචසික කර්මයෙන්, කුසල මානසික කර්මයෙන් යන මේ කරුණු තුනින් යුක්ත වූ භික්ෂූනි, පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට විනාශය හෝ හානිය සිදුනොකර ගනී. ඔහු විඥානවන්තයන්ට දොස් රහිත ද, නින්දා රහිත ද වේ. තවද ඔහු බොහෝ කුසල් රැස් කරයි.",
      "paliTitle": "Paṭhamakhatasuttaṃ"
    },
    {
      "number": 152,
      "pali": "‘‘Tīhi, bhikkhave…pe… sāvajjena kāyakammena, sāvajjena vacīkammena, sāvajjena manokammena…pe…. ‘‘Tīhi, bhikkhave…pe… anavajjena kāyakammena, anavajjena vacīkammena, anavajjena manokammena…pe…. Chaṭṭhaṃ.",
      "english": "Monks, endowed with three qualities, one is cast into hell just as if they were brought there. What three? By blameworthy bodily action, by blameworthy verbal action, and by blameworthy mental action. Monks, endowed with these three qualities, one is cast into hell just as if they were brought there.\n\nMonks, endowed with three qualities, one is cast into heaven just as if they were brought there. What three? By blameless bodily action, by blameless verbal action, and by blameless mental action. Monks, endowed with these three qualities, one is cast into heaven just as if they were brought there.",
      "sinhala": "භික්ෂූණි, දෝෂ සහිත කායික කර්මයෙන්, දෝෂ සහිත වාචසික කර්මයෙන්, දෝෂ සහිත මානසික කර්මයෙන් යන මේ කර්ම තුනෙන්.\n\nභික්ෂූණි, නිර්දෝෂී කායික කර්මයෙන්, නිර්දෝෂී වාචසික කර්මයෙන්, නිර්දෝෂී මානසික කර්මයෙන් යන මේ කර්ම තුනෙන්.\n\nසයවැනි සූත්‍රයයි.",
      "paliTitle": "Dutiyakhatasuttaṃ"
    },
    {
      "number": 153,
      "pali": "‘‘Tīhi, bhikkhave…pe… visamena kāyakammena, visamena vacīkammena, visamena manokammena…pe…. ‘‘Tīhi, bhikkhave…pe… samena kāyakammena, samena vacīkammena, samena manokammena… pe…. Sattamaṃ.",
      "english": "Bhikkhus, endowed with these three qualities, one is consigned to hell as if brought there. Which three? By unwholesome bodily action, by unwholesome verbal action, and by unwholesome mental action. Endowed with these three qualities, one is consigned to hell as if brought there.\n\nBhikkhus, endowed with these three qualities, one is consigned to heaven as if brought there. Which three? By wholesome bodily action, by wholesome verbal action, and by wholesome mental action. Endowed with these three qualities, one is consigned to heaven as if brought there.",
      "sinhala": "මහණෙනි, කරුණු තුනකින් යුක්ත වූ පුද්ගලයා, ගෙනැවිත් නිරයේ හෙළන ලද්දක් මෙන් වේ. කවර කරුණු තුනකින් ද යත්: වැරදි කායික කර්මයෙන්, වැරදි වාචසික කර්මයෙන් සහ වැරදි මානසික කර්මයෙන් යන මේ කරුණු තුනෙනි.\n\nමහණෙනි, කරුණු තුනකින් යුක්ත වූ පුද්ගලයා, ගෙනැවිත් ස්වර්ගයේ තබන ලද්දක් මෙන් වේ. කවර කරුණු තුනකින් ද යත්: යහපත් කායික කර්මයෙන්, යහපත් වාචසික කර්මයෙන් සහ යහපත් මානසික කර්මයෙන් යන මේ කරුණු තුනෙනි.\n\nසත්වන සූත්‍රයයි.",
      "paliTitle": "Tatiyakhatasuttaṃ"
    },
    {
      "number": 154,
      "pali": "‘‘Tīhi, bhikkhave…pe… asucinā kāyakammena, asucinā vacīkammena, asucinā manokammena…pe…. ‘‘Tīhi, bhikkhave…pe… sucinā kāyakammena, sucinā vacīkammena, sucinā manokammena – imehi kho, bhikkhave, tīhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a fool, an undiscerning person, an ignoble one, is endowed with three qualities, and thereby harms himself, is blameworthy by the discerning, and produces much demerit. Which three? Impure bodily action, impure verbal action, and impure mental action. Monks, a fool, an undiscerning person, an ignoble one, endowed with these three qualities, harms himself, is blameworthy by the discerning, and produces much demerit.\n\nMonks, by pure bodily action, by pure verbal action, and by pure mental action—a wise person, a discerning person, a good person, endowed with these three qualities, preserves himself uninjured, unharmed, is blameless and irreproachable by the discerning, and produces much merit.",
      "sinhala": "භික්ෂූණි, අශුචි කය කර්මයෙන්, අශුචි වචී කර්මයෙන්, අශුචි මනෝ කර්මයෙන් යන මේ ධර්ම තුන පවතී. භික්ෂූණි, පිරිසිදු කය කර්මයෙන්, පිරිසිදු වචී කර්මයෙන්, පිරිසිදු මනෝ කර්මයෙන් යන මේ ධර්ම තුනෙන් සමන්විත වූ පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට කිසිදු හානියක් නොවන සේ, විපතක් නොවන සේ තමා ආරක්ෂා කර ගනී. ඔහු නුවණැත්තන් විසින් දොස් නොලබන, දොස් පැවරිය නොහැකි කෙනෙක් ද වේ. මහත් පිනක් ද උපදවයි.",
      "paliTitle": "Catutthakhatasuttaṃ"
    },
    {
      "number": 155,
      "pali": "‘‘Tisso imā, bhikkhave, vandanā. Katamā tisso? Kāyena, vācāya, manasā – imā kho, bhikkhave, tisso vandanā’’ti. Navamaṃ.",
      "english": "Monks, these are the three forms of homage. Which three? By body, by speech, and by mind – these, Monks, are indeed the three forms of homage.",
      "sinhala": "භික්ෂූනි, මේ වන්දනා තුනකි. කවර තුනක්ද? කයින්, වචනයෙන්, මනසින් යන මේවායි. භික්ෂූනි, මේ වන්දනා තුන නම් මේවාමයි.",
      "paliTitle": "Vandanāsuttaṃ"
    },
    {
      "number": 156,
      "pali": "‘‘Ye, bhikkhave, sattā pubbaṇhasamayaṃ kāyena sucaritaṃ caranti, vācāya sucaritaṃ caranti, manasā sucaritaṃ caranti, supubbaṇho, bhikkhave, tesaṃ sattānaṃ. ‘‘Ye, bhikkhave, sattā majjhanhikasamayaṃ kāyena sucaritaṃ caranti, vācāya sucaritaṃ caranti, manasā sucaritaṃ caranti, sumajjhanhiko, bhikkhave, tesaṃ sattānaṃ. ‘‘Ye, bhikkhave, sattā sāyanhasamayaṃ kāyena sucaritaṃ caranti, vācāya sucaritaṃ caranti, manasā sucaritaṃ caranti, susāyanho, bhikkhave, tesaṃ sattāna’’nti. ‘‘Sunakkhattaṃ sumaṅgalaṃ, suppabhātaṃ suhuṭṭhitaṃ [suvuṭṭhitaṃ (sī. pī.)]; Sukhaṇo sumuhutto ca, suyiṭṭhaṃ brahmacārisu. ‘‘Padakkhiṇaṃ kāyakammaṃ, vācākammaṃ padakkhiṇaṃ; Padakkhiṇaṃ manokammaṃ, paṇīdhi te padakkhiṇe [paṇidhiyo padakkhiṇā (sī. pī.), paṇidhi te padakkhiṇā (syā. kaṃ.)]; Padakkhiṇāni katvāna, labhantatthe [labhatatthe (sī. pī.)] padakkhiṇe. ‘‘Te atthaladdhā sukhitā, viruḷhā buddhasāsane; Arogā sukhitā hotha, saha sabbehi ñātibhī’’ti. dasamaṃ; ",
      "english": "“Monks, for those beings who in the morning engage in good conduct by body, good conduct by speech, and good conduct by mind, for those beings, monks, it is an auspicious morning. Monks, for those beings who at midday engage in good conduct by body, good conduct by speech, and good conduct by mind, for those beings, monks, it is an auspicious midday. Monks, for those beings who in the evening engage in good conduct by body, good conduct by speech, and good conduct by mind, for those beings, monks, it is an auspicious evening.”\n\nAn auspicious constellation, an auspicious omen, a good dawn, a well-arisen day;\nA good moment, and a propitious instant, well-offered to those who lead the holy life.\n\nRight-directed bodily action, right-directed verbal action;\nRight-directed mental action, their aspirations are right-directed.\nHaving performed right-directed actions, they obtain right-directed benefits.\n\nHaving attained their aims, they are happy,\nFlourishing in the Buddha’s Dispensation.\nMay you be free from illness and happy,\nTogether with all your relatives.",
      "sinhala": "මහණෙනි, යම් සත්ත්වයෝ උදෑසන කාලයෙහි කයින් සුචරිතයෙහි හැසිරෙත්ද, වචනයෙන් සුචරිතයෙහි හැසිරෙත්ද, සිතින් සුචරිතයෙහි හැසිරෙත්ද, මහණෙනි, ඒ සත්ත්වයන්ගේ උදෑසන යහපත් උදෑසනකි.\n\nමහණෙනි, යම් සත්ත්වයෝ මධ්‍යාහ්න කාලයෙහි කයින් සුචරිතයෙහි හැසිරෙත්ද, වචනයෙන් සුචරිතයෙහි හැසිරෙත්ද, සිතින් සුචරිතයෙහි හැසිරෙත්ද, මහණෙනි, ඒ සත්ත්වයන්ගේ මධ්‍යාහ්නය යහපත් මධ්‍යාහ්නයකි.\n\nමහණෙනි, යම් සත්ත්වයෝ සවස කාලයෙහි කයින් සුචරිතයෙහි හැසිරෙත්ද, වචනයෙන් සුචරිතයෙහි හැසිරෙත්ද, සිතින් සුචරිතයෙහි හැසිරෙත්ද, මහණෙනි, ඒ සත්ත්වයන්ගේ සවස යහපත් සවසකි.\n\nයහපත් නක්‍ෂත්‍රයකි, යහපත් මංගල්‍යයකි, යහපත් සුප්‍රභාතයකි, යහපත් පිබිදීමකි. යහපත් ක්ෂණයකි, යහපත් මුහූර්තයකි ද, බ්‍රහ්මචාරීන් විසින් හොඳින් සම්පූර්ණ කරන ලද්දකි.\n\nප්‍රදක්‍ෂිණා කරන ලද කය කර්මයකි, ප්‍රදක්‍ෂිණා කරන ලද වචී කර්මයකි. ප්‍රදක්‍ෂිණා කරන ලද මනෝ කර්මයකි, ඔවුන්ගේ ප්‍රාර්ථනාද යහපත්ය. මෙවැනි ප්‍රදක්‍ෂිණා වූ දේ කොට, ප්‍රදක්‍ෂිණා වූ (යහපත්) අර්ථයන් ලබත්.\n\nඔවුහු ඒ අර්ථයන් ලබා සුවපත් වෙති, බුද්ධ ශාසනයෙහි වැඩෙති. සියලු ඥාතීන් සමඟින් නිරෝගීව, සුවපත් වනු මැනවි.",
      "paliTitle": "Pubbaṇhasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Maṅgalavaggo pañcamo. Tassuddānaṃ – Akusalañca sāvajjaṃ, visamāsucinā saha; Caturo khatā vandanā, pubbaṇhena ca te dasāti.",
    "english": "",
    "sinhala": ""
  }
}