{
  "id": "an3.12",
  "title": {
    "pali": "Āpāyikavaggo",
    "english": "The Chapter on Those Destined for the Lower Realms",
    "sinhala": "අපායික වග්ගය"
  },
  "sections": [
    {
      "number": 114,
      "pali": "‘‘Tayome, bhikkhave, āpāyikā nerayikā idamappahāya. Katame tayo? Yo ca abrahmacārī brahmacāripaṭiñño, yo ca suddhaṃ brahmacariyaṃ carantaṃ amūlakena [abhūtena (ka.)] abrahmacariyena anuddhaṃseti, yo cāyaṃ evaṃvādī evaṃdiṭṭhi – ‘natthi kāmesu doso’ti, so tāya kāmesu pātabyataṃ āpajjati. Ime kho, bhikkhave, tayo āpāyikā nerayikā idamappahāyā’’ti. Paṭhamaṃ.",
      "english": "Monks, these three individuals are destined for the lower realms, destined for hell, so long as they do not abandon these particular qualities. Which three? First, whoever is unchaste yet proclaims themselves to be a chaste practitioner; second, whoever disparages one who practices pure celibacy with a baseless accusation of unchastity; and third, whoever holds and declares the view, 'There is no fault in sensual pleasures,' thereby becoming completely consumed by sensual pleasures. Indeed, Monks, these three individuals are destined for the lower realms, destined for hell, so long as they do not abandon these particular qualities.",
      "sinhala": "භික්ෂූනි, මේවා අත් නොහැරීම හේතුවෙන් අපායට යන, නිරයට යන පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ තිදෙනා කවරහුද?\n\nඒ යම් කෙනෙක් අබ්‍රහ්මචාරීව සිටියදීම, තමන් බ්‍රහ්මචාරී යැයි ප්‍ර්‍රතිඥා දෙන්නේද;\n\nඒ යම් කෙනෙක් පිරිසිදු බ්‍රහ්මචරියාවක් පුරන කෙනෙකුට, අමූලික වූ (අභූත වූ) අබ්‍රහ්මචාරී චෝදනාවකින් දූෂණය කරන්නේද;\n\nඒ යම් කෙනෙක් 'කාමයන්හි දොසක් නැත' යන මෙබඳු වාද ඇත්තා වූ ද, මෙබඳු දැක්ම ඇත්තා වූ ද පුද්ගලයා, එම දැක්ම නිසා කාමයන්හි පිරිහීමට පත්වේද.\n\nභික්ෂූනි, මේවා අත් නොහැරීම හේතුවෙන් අපායට යන, නිරයට යන පුද්ගලයෝ මේ තිදෙනාම වෙති.",
      "paliTitle": "Āpāyikasuttaṃ",
      "englishTitle": "The Discourse on Those Destined for States of Deprivation",
      "sinhalaTitle": "ආපායික සූත්‍රය"
    },
    {
      "number": 115,
      "pali": "‘‘Tiṇṇaṃ, bhikkhave, pātubhāvo dullabho lokasmiṃ. Katamesaṃ tiṇṇaṃ? Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pātubhāvo dullabho lokasmiṃ, tathāgatappaveditassa dhammavinayassa desetā puggalo dullabho lokasmiṃ, kataññū katavedī puggalo dullabho lokasmiṃ. Imesaṃ kho, bhikkhave, tiṇṇaṃ pātubhāvo dullabho lokasmi’’nti. Dutiyaṃ.",
      "english": "Monks, the appearance of three things is rare in the world. Which three? Monks, the appearance in the world of a Tathāgata, an Arahant, a Perfectly Self-Awakened One, is rare. A person who expounds the Dhamma-Vinaya proclaimed by the Tathāgata is rare in the world. A person who is grateful and acknowledges the kindness received is rare in the world. Indeed, Monks, the appearance of these three things is rare in the world.",
      "sinhala": "මහණෙනි, මේ ත්‍රිවිධ දේ පහළ වීම ලොව දුලභය. කවර තුනක්ද?\nමහණෙනි, අරහත් වූ සම්‍යක්‌ සම්බුදු වූ තථාගතයන් වහන්සේ නමකගේ පහළ වීම ලොව දුලභය. තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්‍මවිනය දේශනා කරන පුද්ගලයෙක් ලොව දුලභය. කෘතඥ වූ ද, කෘතවේදී වූ ද පුද්ගලයෙක් ලොව දුලභය.\nමහණෙනි, මේ ත්‍රිවිධ දේ පහළ වීම ම ලොව දුලභය.",
      "paliTitle": "Dullabhasuttaṃ",
      "englishTitle": "Hard to Obtain Sutta",
      "sinhalaTitle": "දුල්ලභ සූත්‍රය"
    },
    {
      "number": 116,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Suppameyyo, duppameyyo, appameyyo. Katamo ca, bhikkhave, puggalo suppameyyo? Idha, bhikkhave, ekacco puggalo uddhato hoti unnaḷo capalo mukharo vikiṇṇavāco muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Ayaṃ vuccati, bhikkhave, puggalo suppameyyo. ‘‘Katamo ca, bhikkhave, puggalo duppameyyo? Idha, bhikkhave, ekacco puggalo anuddhato hoti anunnaḷo acapalo amukharo avikiṇṇavāco upaṭṭhitassati sampajāno samāhito ekaggacitto saṃvutindriyo. Ayaṃ vuccati, bhikkhave, puggalo duppameyyo. ‘‘Katamo ca, bhikkhave, puggalo appameyyo? Idha, bhikkhave, bhikkhu arahaṃ hoti khīṇāsavo. Ayaṃ vuccati, bhikkhave, puggalo appameyyo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ.",
      "english": "Monks, these three types of individuals exist, are found in the world. Which three? The easily fathomable, the difficult to fathom, and the immeasurable.\n\nAnd what kind of individual, Monks, is easily fathomable? Here, Monks, a certain individual is agitated, proud, fickle, talkative, scattered in speech, lacking mindfulness, lacking clear comprehension, not concentrated, with a distracted mind, and with unrestrained senses. This individual, Monks, is called the easily fathomable.\n\nAnd what kind of individual, Monks, is difficult to fathom? Here, Monks, a certain individual is not agitated, not proud, not fickle, not talkative, not scattered in speech, established in mindfulness, with clear comprehension, concentrated, with a unified mind, and with restrained senses. This individual, Monks, is called the difficult to fathom.\n\nAnd what kind of individual, Monks, is immeasurable? Here, Monks, a monastic is an Arahant, with the defilements destroyed. This individual, Monks, is called the immeasurable. Indeed, Monks, these are the three individuals existing, found in the world.",
      "sinhala": "භික්‍ෂූණි, මේ පුද්ගලයන් තිදෙනා ලෝකයෙහි සිටිති, විද්‍යමාන වෙති. කවරහුද ඒ තිදෙනා? පහසුවෙන් මැනිය හැකි (සුප්‍රමේය) පුද්ගලයා, දුෂ්කරයෙන් මැනිය හැකි (දුෂ්ප්‍රමේය) පුද්ගලයා, මැනිය නොහැකි (අප්‍රමේය) පුද්ගලයා යන මොවුහුය.\n\nභික්‍ෂූණි, පහසුවෙන් මැනිය හැකි පුද්ගලයා කවරෙක්ද? භික්‍ෂූණි, මෙහිලා යම් පුද්ගලයෙක් උද්දච්ඡව, උඩඟු ලෙස, චංචලව, මුඛරීව, විසිරුණු වචන ඇතිව, නැති වූ සිහියෙන් යුතුව, මනා අවබෝධයෙන් තොරව, අසමාහිතව, වික්ෂිප්ත සිත් ඇතිව, ඉන්ද්‍රියයන් ප්‍රකටව කටයුතු කරයිද, භික්‍ෂූණි, මේ පුද්ගලයා පහසුවෙන් මැනිය හැකි පුද්ගලයා යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, දුෂ්කරයෙන් මැනිය හැකි පුද්ගලයා කවරෙක්ද? භික්‍ෂූණි, මෙහිලා යම් පුද්ගලයෙක් උද්දච්ඡ නොවී, උඩඟු නොවී, චංචල නොවී, මුඛරී නොවී, විසිරුණු වචන නැතිව, පිහිටි සිහියෙන් යුතුව, මනා අවබෝධයෙන් යුතුව, සමාහිතව, එකඟ සිතින් යුතුව, ඉන්ද්‍රියයන් සංවරව කටයුතු කරයිද, භික්‍ෂූණි, මේ පුද්ගලයා දුෂ්කරයෙන් මැනිය හැකි පුද්ගලයා යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, මැනිය නොහැකි පුද්ගලයා කවරෙක්ද? භික්‍ෂූණි, මෙහිලා යම් භික්‍ෂුවක් අර්හත් වූ, ක්ෂීණාශ්‍රව පුද්ගලයෙක් වේද, භික්‍ෂූණි, මේ පුද්ගලයා මැනිය නොහැකි පුද්ගලයා යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, මේ පුද්ගලයන් තිදෙනාම ලෝකයෙහි සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Appameyyasuttaṃ",
      "englishTitle": "Immeasurable Sutta",
      "sinhalaTitle": "අප්පමෙය්ය සූත්‍රය"
    },
    {
      "number": 117,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ākāsānañcāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Ākāsānañcāyatanūpagānaṃ, bhikkhave, devānaṃ vīsati kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno viññāṇañcāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Viññāṇañcāyatanūpagānaṃ, bhikkhave, devānaṃ cattārīsaṃ kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. So tadassādeti taṃ nikāmeti tena ca vittiṃ āpajjati, tatra ṭhito tadadhimutto tabbahulavihārī aparihīno kālaṃ kurumāno ākiñcaññāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Ākiñcaññāyatanūpagānaṃ, bhikkhave, devānaṃ saṭṭhi kappasahassāni āyuppamāṇaṃ. Tattha puthujjano yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā nirayampi gacchati tiracchānayonimpi gacchati pettivisayampi gacchati. Bhagavato pana sāvako tattha yāvatāyukaṃ ṭhatvā yāvatakaṃ tesaṃ devānaṃ āyuppamāṇaṃ taṃ sabbaṃ khepetvā tasmiṃyeva bhave parinibbāyati. Ayaṃ kho, bhikkhave, viseso, ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanena, yadidaṃ gatiyā upapattiyā. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti. Catutthaṃ.",
      "english": "Monks, these three types of individuals exist, are found in the world. Which three? Here, monks, a certain individual, by entirely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, by not attending to perceptions of diversity, enters and dwells in the dimension of infinite space, thinking, 'Space is infinite.' He relishes that, delights in that, and becomes satisfied with that. Established there, dedicated to it, frequently dwelling in it, not falling away, and passing away at the time of death, he is reborn into the companionship of the devas of the dimension of infinite space. Monks, the lifespan of the devas of the dimension of infinite space is twenty thousand eons. There, an ordinary uninstructed person, having remained there for the full extent of that lifespan, exhausting all of the lifespan of those devas, goes to hell, or to the animal realm, or to the realm of hungry ghosts. But the disciple of the Blessed One, having remained there for the full extent of that lifespan, exhausting all of the lifespan of those devas, attains final Nibbāna in that very existence. This, monks, is the distinction, this is the difference, this is the variance between the well-instructed noble disciple and the uninstructed ordinary person, regarding destiny and rebirth.\n\nFurthermore, monks, here a certain individual, by entirely transcending the dimension of infinite space, enters and dwells in the dimension of infinite consciousness, thinking, 'Consciousness is infinite.' He relishes that, delights in that, and becomes satisfied with that. Established there, dedicated to it, frequently dwelling in it, not falling away, and passing away at the time of death, he is reborn into the companionship of the devas of the dimension of infinite consciousness. Monks, the lifespan of the devas of the dimension of infinite consciousness is forty thousand eons. There, an ordinary uninstructed person, having remained there for the full extent of that lifespan, exhausting all of the lifespan of those devas, goes to hell, or to the animal realm, or to the realm of hungry ghosts. But the disciple of the Blessed One, having remained there for the full extent of that lifespan, exhausting all of the lifespan of those devas, attains final Nibbāna in that very existence. This, monks, is the distinction, this is the difference, this is the variance between the well-instructed noble disciple and the uninstructed ordinary person, regarding destiny and rebirth.\n\nFurthermore, monks, here a certain individual, by entirely transcending the dimension of infinite consciousness, enters and dwells in the dimension of nothingness, thinking, 'There is nothing.' He relishes that, delights in that, and becomes satisfied with that. Established there, dedicated to it, frequently dwelling in it, not falling away, and passing away at the time of death, he is reborn into the companionship of the devas of the dimension of nothingness. Monks, the lifespan of the devas of the dimension of nothingness is sixty thousand eons. There, an ordinary uninstructed person, having remained there for the full extent of that lifespan, exhausting all of the lifespan of those devas, goes to hell, or to the animal realm, or to the realm of hungry ghosts. But the disciple of the Blessed One, having remained there for the full extent of that lifespan, exhausting all of the lifespan of those devas, attains final Nibbāna in that very existence. This, monks, is the distinction, this is the difference, this is the variance between the well-instructed noble disciple and the uninstructed ordinary person, regarding destiny and rebirth. These, monks, are the three types of individuals existing, found in the world.",
      "sinhala": "භික්ෂූනි, මේ ලෝකයෙහි පවත්නා, විද්‍යමාන පුද්ගලයෝ තිදෙනෙක් වෙති. කවරහුද ඒ තිදෙනා? භික්ෂූනි, මෙහිලා යම්කිසි පුද්ගලයෙක් සියලු රූප සංඥාවන් ඉක්මවා, ගැටීම් සංඥාවන් නැති කර, නානත්ව සංඥාවන්ට මනස යොමු නොකර ‘අනන්තය ආකාශයයි’ කියා ආකාසානඤ්චායතනයට පැමිණ වාසය කරයි. ඔහු එය රස විඳියි, එයට ඇලෙයි, එමගින් සතුටට පත් වෙයි, එහි පිහිටා, එයට අධිමුක්තව, එය බහුල කොට වාසය කරමින්, පිරිහීමට පත් නොවී, කලුරිය කරන්නේ ආකාසානඤ්චායතන භූමියේ උපන් දෙවියන්ගේ සහභාවයට උපදී. භික්ෂූනි, ආකාසානඤ්චායතන භූමියේ උපන් දෙවියන්ගේ ආයු ප්‍රමාණය කල්ප විසි දහසකි. එහිලා පෘථග්ජනයා ආයුෂ කෙළවර වන තුරු වාසය කොට, ඒ දෙවියන්ගේ යම්තාක් ආයු ප්‍රමාණයක් ඇත්ද, ඒ සියල්ල ගෙවා දමා, නිරයටද යයි, තිරිසන් යෝනියටද යයි, ප්‍රේත ලෝකයටද යයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා නම් එහිලා ආයුෂ කෙළවර වන තුරු වාසය කොට, ඒ දෙවියන්ගේ යම්තාක් ආයු ප්‍රමාණයක් ඇත්ද, ඒ සියල්ල ගෙවා දමා, ඒ භවයෙහිදීම පිරිනිවන් පායි. භික්ෂූනි, අසත්පුරුෂ පෘථග්ජනයාට වඩා, ශ්‍රැතවත් ආර්යශ්‍රාවකයාගේ ගතියෙහිද, උපපත්තියෙහිද ඇති මේ වෙනස, මේ සුවිශේෂත්වය, මේ විභේදනය මෙයයි.\n\nභික්ෂූනි, තවද අන්‍යවූ යම්කිසි පුද්ගලයෙක් සියලු ආකාසානඤ්චායතනය ඉක්මවා, ‘අනන්තය විඤ්ඤාණයයි’ කියා විඤ්ඤාණඤ්චායතනයට පැමිණ වාසය කරයි. ඔහු එය රස විඳියි, එයට ඇලෙයි, එමගින් සතුටට පත් වෙයි, එහි පිහිටා, එයට අධිමුක්තව, එය බහුල කොට වාසය කරමින්, පිරිහීමට පත් නොවී, කලුරිය කරන්නේ විඤ්ඤාණඤ්චායතන භූමියේ උපන් දෙවියන්ගේ සහභාවයට උපදී. භික්ෂූනි, විඤ්ඤාණඤ්චායතන භූමියේ උපන් දෙවියන්ගේ ආයු ප්‍රමාණය කල්ප හතළිස් දහසකි. එහිලා පෘථග්ජනයා ආයුෂ කෙළවර වන තුරු වාසය කොට, ඒ දෙවියන්ගේ යම්තාක් ආයු ප්‍රමාණයක් ඇත්ද, ඒ සියල්ල ගෙවා දමා, නිරයටද යයි, තිරිසන් යෝනියටද යයි, ප්‍රේත ලෝකයටද යයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා නම් එහිලා ආයුෂ කෙළවර වන තුරු වාසය කොට, ඒ දෙවියන්ගේ යම්තාක් ආයු ප්‍රමාණයක් ඇත්ද, ඒ සියල්ල ගෙවා දමා, ඒ භවයෙහිදීම පිරිනිවන් පායි. භික්ෂූනි, අසත්පුරුෂ පෘථග්ජනයාට වඩා, ශ්‍රැතවත් ආර්යශ්‍රාවකයාගේ ගතියෙහිද, උපපත්තියෙහිද ඇති මේ වෙනස, මේ සුවිශේෂත්වය, මේ විභේදනය මෙයයි.\n\nභික්ෂූනි, තවද අන්‍යවූ යම්කිසි පුද්ගලයෙක් සියලු විඤ්ඤාණඤ්චායතනය ඉක්මවා, ‘කිසිවක් නැතැයි’ කියා ආකිංචඤ්ඤායතනයට පැමිණ වාසය කරයි. ඔහු එය රස විඳියි, එයට ඇලෙයි, එමගින් සතුටට පත් වෙයි, එහි පිහිටා, එයට අධිමුක්තව, එය බහුල කොට වාසය කරමින්, පිරිහීමට පත් නොවී, කලුරිය කරන්නේ ආකිංචඤ්ඤායතන භූමියේ උපන් දෙවියන්ගේ සහභාවයට උපදී. භික්ෂූනි, ආකිංචඤ්ඤායතන භූමියේ උපන් දෙවියන්ගේ ආයු ප්‍රමාණය කල්ප හැට දහසකි. එහිලා පෘථග්ජනයා ආයුෂ කෙළවර වන තුරු වාසය කොට, ඒ දෙවියන්ගේ යම්තාක් ආයු ප්‍රමාණයක් ඇත්ද, ඒ සියල්ල ගෙවා දමා, නිරයටද යයි, තිරිසන් යෝනියටද යයි, ප්‍රේත ලෝකයටද යයි. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයා නම් එහිලා ආයුෂ කෙළවර වන තුරු වාසය කොට, ඒ දෙවියන්ගේ යම්තාක් ආයු ප්‍රමාණයක් ඇත්ද, ඒ සියල්ල ගෙවා දමා, ඒ භවයෙහිදීම පිරිනිවන් පායි. භික්ෂූනි, අසත්පුරුෂ පෘථග්ජනයාට වඩා, ශ්‍රැතවත් ආර්යශ්‍රාවකයාගේ ගතියෙහිද, උපපත්තියෙහිද ඇති මේ වෙනස, මේ සුවිශේෂත්වය, මේ විභේදනය මෙයයි. භික්ෂූනි, මේ ලෝකයෙහි පවත්නා, විද්‍යමාන පුද්ගලයෝ මේ තිදෙනායි.",
      "paliTitle": "Āneñjasuttaṃ",
      "englishTitle": "The Discourse on the Imperturbable",
      "sinhalaTitle": "ආනෙඤ්ජ සූත්‍රය"
    },
    {
      "number": 118,
      "pali": "‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Sīlavipatti, cittavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, sīlavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, sīlavipatti. ‘‘Katamā ca, bhikkhave, cittavipatti? Idha, bhikkhave, ekacco abhijjhālu hoti byāpannacitto. Ayaṃ vuccati, bhikkhave, cittavipatti. ‘‘Katamā ca, bhikkhave, diṭṭhivipatti? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ, kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Sīlavipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; cittavipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; diṭṭhivipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Imā kho, bhikkhave, tisso vipattiyoti. ‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Sīlasampadā, cittasampadā, diṭṭhisampadā. Katamā ca, bhikkhave, sīlasampadā? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Ayaṃ vuccati, bhikkhave, sīlasampadā. ‘‘Katamā ca, bhikkhave, cittasampadā? Idha, bhikkhave, ekacco anabhijjhālu hoti abyāpannacitto. Ayaṃ vuccati, bhikkhave, cittasampadā. ‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Sīlasampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; cittasampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; diṭṭhisampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Imā kho, bhikkhave, tisso sampadā’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, there are these three failures. Which three? Failure in conduct, failure in mind, failure in view.\n\nAnd what, bhikkhus, is failure in conduct? Here, bhikkhus, some individual is a killer of living beings, takes what is not given, engages in sexual misconduct, speaks falsely, engages in divisive speech, engages in harsh speech, engages in idle chatter. This, bhikkhus, is called failure in conduct.\n\nAnd what, bhikkhus, is failure in mind? Here, bhikkhus, some individual is covetous and malevolent in mind. This, bhikkhus, is called failure in mind.\n\nAnd what, bhikkhus, is failure in view? Here, bhikkhus, some individual holds wrong view, possessing a perverted outlook, thinking: ‘There is no gift, no offering, no sacrifice; there is no fruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father; there are no spontaneously arisen beings; there are no recluses and brahmins in the world who are rightly gone, rightly practicing, who, having themselves realized and directly experienced this world and the other world, proclaim it.’ This, bhikkhus, is called failure in view.\n\nDue to failure in conduct, bhikkhus, beings, with the breaking up of the body, after death, reappear in a state of deprivation, a bad destination, a lower realm, hell. Due to failure in mind, bhikkhus, beings, with the breaking up of the body, after death, reappear in a state of deprivation, a bad destination, a lower realm, hell. Due to failure in view, bhikkhus, beings, with the breaking up of the body, after death, reappear in a state of deprivation, a bad destination, a lower realm, hell. These, bhikkhus, are the three failures.\n\nBhikkhus, there are these three accomplishments. Which three? Accomplishment in conduct, accomplishment in mind, accomplishment in view.\n\nAnd what, bhikkhus, is accomplishment in conduct? Here, bhikkhus, some individual abstains from killing living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter. This, bhikkhus, is called accomplishment in conduct.\n\nAnd what, bhikkhus, is accomplishment in mind? Here, bhikkhus, some individual is not covetous and is without malevolence in mind. This, bhikkhus, is called accomplishment in mind.\n\nAnd what, bhikkhus, is accomplishment in view? Here, bhikkhus, some individual holds right view, possessing an unperverted outlook, thinking: ‘There is gift, there is offering, there is sacrifice; there is fruit and result of good and bad actions; there is this world, there is other world; there is mother, there is father; there are spontaneously arisen beings; there are recluses and brahmins in the world who are rightly gone, rightly practicing, who, having themselves realized and directly experienced this world and the other world, proclaim it.’ This, bhikkhus, is called accomplishment in view.\n\nDue to accomplishment in conduct, bhikkhus, beings, with the breaking up of the body, after death, reappear in a good destination, a heavenly world. Due to accomplishment in mind, bhikkhus, beings, with the breaking up of the body, after death, reappear in a good destination, a heavenly world. Due to accomplishment in view, bhikkhus, beings, with the breaking up of the body, after death, reappear in a good destination, a heavenly world. These, bhikkhus, are the three accomplishments.",
      "sinhala": "භික්ෂූණි, මේ විපත්ති තුනකි. ඒ තුන කවරේද? ශීල විපත්තිය, චිත්ත විපත්තිය, දෘෂ්ටි විපත්තිය. භික්ෂූණි, ශීල විපත්තිය කවරේද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතය කරන්නේ වේ. අදත්තාදානය කරන්නේ වේ. කාමයන්හි වරදවා හැසිරෙන්නේ වේ. මුසාවාදයේ යෙදෙන්නේ වේ. පිසුනු වචන කියන්නේ වේ. ඵරුෂ වචන (දැඩි රළු වචන) කියන්නේ වේ. සම්ඵප්පලාපයේ (ඵල රහිත වචන, හිස් වචන) යෙදෙන්නේ වේ. භික්ෂූණි, මෙය ශීල විපත්තිය යැයි කියනු ලැබේ. භික්ෂූණි, චිත්ත විපත්තිය කවරේද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් අධික ලෝභයෙන් යුක්තව අනුන්ගේ දේට ආශා කරන්නේ වේ. ව්‍යාපාද සහිත සිතින් (ක්‍රෝධයෙන්) යුක්ත වේ. භික්ෂූණි, මෙය චිත්ත විපත්තිය යැයි කියනු ලැබේ. භික්ෂූණි, දෘෂ්ටි විපත්තිය කවරේද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් මිථ්‍යා දෘෂ්ටියෙන් යුක්ත වේ. විපරීත දර්ශනයක් ඇත්තේ වේ. එනම්: ‘දුන් දෙයෙහි විපාකයක් නැත. පූජා කළ දෙයෙහි විපාකයක් නැත. පිදූ දෙයෙහි විපාකයක් නැත. හොඳින් කළ සහ නරකින් කළ කර්මයන්ට ඵල විපාක නැත. මේ ලෝකයක් නැත. පරලොවක් නැත. මවක් නැත. පියෙක් නැත. ඕපපාතික සත්වයෝ නැත. ලොවෙහි සම්මා දර්ශනයට පැමිණි, මනා ලෙස පිළිපන්, මේ ලෝකයත් පරලෝකයත් තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කරගෙන ප්‍රකාශ කරන්නාවූ කිසිදු ශ්‍රමණ බ්‍රාහ්මණයෙක් නැත’ යනාදී වශයෙනි. භික්ෂූණි, මෙය දෘෂ්ටි විපත්තිය යැයි කියනු ලැබේ. භික්ෂූණි, ශීල විපත්තිය හේතු කොටගෙන හෝ, සත්වයෝ ශරීරය බිඳී මරණින් මතු අපාය නම් වූ දුර්ගති විනිපාත නිරයෙහි උපදිති. භික්ෂූණි, චිත්ත විපත්තිය හේතු කොටගෙන හෝ, සත්වයෝ ශරීරය බිඳී මරණින් මතු අපාය නම් වූ දුර්ගති විනිපාත නිරයෙහි උපදිති. භික්ෂූණි, දෘෂ්ටි විපත්තිය හේතු කොටගෙන හෝ, සත්වයෝ ශරීරය බිඳී මරණින් මතු අපාය නම් වූ දුර්ගති විනිපාත නිරයෙහි උපදිති. භික්ෂූණි, මේ විපත්ති තුන නම් මේවාය.\n\nභික්ෂූණි, මේ සම්පදා තුනකි. ඒ තුන කවරේද? ශීල සම්පදාව, චිත්ත සම්පදාව, දෘෂ්ටි සම්පදාව. භික්ෂූණි, ශීල සම්පදාව කවරේද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙන් වැළකී සිටින්නේ වේ. අදත්තාදානයෙන් වැළකී සිටින්නේ වේ. කාමමිථ්‍යාචාරයෙන් වැළකී සිටින්නේ වේ. මුසාවාදයෙන් වැළකී සිටින්නේ වේ. පිසුනු වචන කීමෙන් වැළකී සිටින්නේ වේ. ඵරුෂ වචන කීමෙන් වැළකී සිටින්නේ වේ. සම්ඵප්පලාපයෙන් (ඵල රහිත වචන කීමෙන්) වැළකී සිටින්නේ වේ. භික්ෂූණි, මෙය ශීල සම්පදාව යැයි කියනු ලැබේ. භික්ෂූණි, චිත්ත සම්පදාව කවරේද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් අධික ලෝභයෙන් යුක්තව අනුන්ගේ දේට ආශා නොකරන්නේ වේ. ව්‍යාපාද රහිත සිතින් (ක්‍රෝධ රහිතව) යුක්ත වේ. භික්ෂූණි, මෙය චිත්ත සම්පදාව යැයි කියනු ලැබේ. භික්ෂූණි, දෘෂ්ටි සම්පදාව කවරේද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් සම්මා දෘෂ්ටියෙන් යුක්ත වේ. අවිපරීත දර්ශනයක් ඇත්තේ වේ. එනම්: ‘දුන් දෙයෙහි විපාකයක් ඇත. පූජා කළ දෙයෙහි විපාකයක් ඇත. පිදූ දෙයෙහි විපාකයක් ඇත. හොඳින් කළ සහ නරකින් කළ කර්මයන්ට ඵල විපාක ඇත. මේ ලෝකයක් ඇත. පරලොවක් ඇත. මවක් ඇත. පියෙක් ඇත. ඕපපාතික සත්වයෝ ඇත. ලොවෙහි සම්මා දර්ශනයට පැමිණි, මනා ලෙස පිළිපන්, මේ ලෝකයත් පරලෝකයත් තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කරගෙන ප්‍රකාශ කරන්නාවූ ශ්‍රමණ බ්‍රාහ්මණයෝ ඇත’ යනාදී වශයෙනි. භික්ෂූණි, මෙය දෘෂ්ටි සම්පදාව යැයි කියනු ලැබේ. භික්ෂූණි, ශීල සම්පදාව හේතු කොටගෙන හෝ, සත්වයෝ ශරීරය බිඳී මරණින් මතු සුගති ස්වර්ග ලෝකයන්හි උපදිති. භික්ෂූණි, චිත්ත සම්පදාව හේතු කොටගෙන හෝ, සත්වයෝ ශරීරය බිඳී මරණින් මතු සුගති ස්වර්ග ලෝකයන්හි උපදිති. භික්ෂූණි, දෘෂ්ටි සම්පදාව හේතු කොටගෙන හෝ, සත්වයෝ ශරීරය බිඳී මරණින් මතු සුගති ස්වර්ග ලෝකයන්හි උපදිති. භික්ෂූණි, මේ සම්පදා තුන නම් මේවාය.",
      "paliTitle": "Vipattisampadāsuttaṃ",
      "englishTitle": "The Discourse on Failure and Success",
      "sinhalaTitle": "විපත්තිසම්පදා සූත්‍රය"
    },
    {
      "number": 119,
      "pali": "‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Sīlavipatti, cittavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, sīlavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, sīlavipatti. ‘‘Katamā ca, bhikkhave, cittavipatti? Idha, bhikkhave, ekacco abhijjhālu hoti byāpannacitto. Ayaṃ vuccati, bhikkhave, cittavipatti. ‘‘Katamā ca, bhikkhave, diṭṭhivipatti? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Sīlavipattihetu vā, bhikkhave…pe… diṭṭhivipattihetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃ khitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, sīlavipattihetu vā sattā…pe… upapajjanti. Imā kho, bhikkhave, tisso vipattiyoti. ‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Sīlasampadā, cittasampadā, diṭṭhisampadā. Katamā ca, bhikkhave, sīlasampadā? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti…pe… ayaṃ vuccati, bhikkhave, sīlasampadā. ‘‘Katamā ca, bhikkhave, cittasampadā? Idha, bhikkhave, ekacco anabhijjhālu hoti abyāpannacitto. Ayaṃ vuccati, bhikkhave, cittasampadā. ‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Sīlasampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Cittasampadāhetu vā…pe… diṭṭhisampadāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃ khitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, sīlasampadāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti, cittasampadāhetu vā sattā…pe… diṭṭhisampadāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Imā kho, bhikkhave, tisso sampadā’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, these are the three failings. Which three? Failing in virtue, failing in mind, and failing in view.\n\nAnd what, bhikkhus, is failing in virtue? Here, bhikkhus, some individual kills living beings, takes what is not given, engages in sexual misconduct, speaks falsely, speaks slanderously, speaks harshly, and engages in frivolous talk. This, bhikkhus, is called failing in virtue.\n\nAnd what, bhikkhus, is failing in mind? Here, bhikkhus, some individual is covetous and has ill will in their mind. This, bhikkhus, is called failing in mind.\n\nAnd what, bhikkhus, is failing in view? Here, bhikkhus, some individual has wrong view, a perverted outlook, holding that ‘there is no giving, no offering, no sacrifice; there is no fruit or result of good or bad actions; there is no this world, no other world; there is no mother, no father; there are no spontaneously arisen beings; and there are no recluses or brahmins who, by their own direct knowledge, have seen and declared this world and the other world.’ This, bhikkhus, is called failing in view.\n\nBhikkhus, because of failing in virtue, or because of failing in mind, or because of failing in view, beings, with the breakup of the body, after death, are reborn in a state of deprivation, a bad destination, a state of ruin, in hell. Just as, bhikkhus, an unquestionable gem, when thrown upwards, lands firmly wherever it falls, so too, bhikkhus, because of failing in virtue, or because of failing in mind, or because of failing in view, beings, with the breakup of the body, after death, are reborn in a state of deprivation, a bad destination, a state of ruin, in hell. These, bhikkhus, are the three failings.\n\nBhikkhus, these are the three accomplishments. Which three? Accomplishment in virtue, accomplishment in mind, and accomplishment in view.\n\nAnd what, bhikkhus, is accomplishment in virtue? Here, bhikkhus, some individual refrains from killing living beings, refrains from taking what is not given, refrains from sexual misconduct, refrains from false speech, refrains from slanderous speech, refrains from harsh speech, and refrains from frivolous talk. This, bhikkhus, is called accomplishment in virtue.\n\nAnd what, bhikkhus, is accomplishment in mind? Here, bhikkhus, some individual is not covetous and has no ill will in their mind. This, bhikkhus, is called accomplishment in mind.\n\nAnd what, bhikkhus, is accomplishment in view? Here, bhikkhus, some individual has right view, an unperverted outlook, holding that ‘there is giving, there is offering, there is sacrifice; there is fruit and result of good and bad actions; there is this world, there is the other world; there is mother, there is father; there are spontaneously arisen beings; and there are recluses or brahmins who, by their own direct knowledge, have seen and declared this world and the other world.’ This, bhikkhus, is called accomplishment in view.\n\nBhikkhus, because of accomplishment in virtue, or because of accomplishment in mind, or because of accomplishment in view, beings, with the breakup of the body, after death, are reborn in a good destination, a heavenly world. Just as, bhikkhus, an unquestionable gem, when thrown upwards, lands firmly wherever it falls, so too, bhikkhus, because of accomplishment in virtue, or because of accomplishment in mind, or because of accomplishment in view, beings, with the breakup of the body, after death, are reborn in a good destination, a heavenly world. These, bhikkhus, are the three accomplishments.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ විපත්ති තුනකි. කවරේද ඒ තුන? සීලවිපත්තිය, චිත්තවිපත්තිය, දිට්ඨිවිපත්තිය.\n\nභික්ෂූන් වහන්ස, සීලවිපත්තිය යනු කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැමෙක් සතුන් මරන්නේ වෙයි, නුදුන් දේ ගන්නේ වෙයි, කාමයන්හි වරදවා හැසිරෙන්නේ වෙයි, බොරු කියන්නේ වෙයි, කේළාම් කියන්නේ වෙයි, පරුෂ වචන කියන්නේ වෙයි, සම්ඵප්පලාපී ඇත්තේ වෙයි. භික්ෂූන් වහන්ස, මේ සීලවිපත්තියයි කියනු ලැබේ. භික්ෂූන් වහන්ස, චිත්තවිපත්තිය යනු කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැමෙක් අභිජ්ඣා ඇත්තෙක් (අනුන්ගේ දේට ආශා කරන්නෙක්) වෙයි, ව්‍යාපාද සිත් ඇත්තෙක් (අනුන් කෙරෙහි ද්වේෂ කරන්නෙක්) වෙයි. භික්ෂූන් වහන්ස, මේ චිත්තවිපත්තියයි කියනු ලැබේ. භික්ෂූන් වහන්ස, දිට්ඨිවිපත්තිය යනු කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැමෙක් මිත්‍යාදෘෂ්ටික වෙයි, විපරීත දර්ශනයෙන් යුක්ත වෙයි – ‘දුන් දෙයෙහි විපාක නැත, පිදූ දෙයෙහි විපාක නැත, හෝම කළ දෙයෙහි විපාක නැත, හොඳ නරක කර්මයන්ගේ ඵලවිපාක නැත, මේ ලෝකය නැත, පරලෝකය නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත, යම් ශ්‍රමණ බ්‍රාහ්මණයෝ මේ ලෝකයත් පරලෝකයත් තමන්ම අභිඥාවෙන් සාක්ෂාත් කොට ප්‍රකාශ කරන්නාහු නම්, එබඳු සම්‍යක්ප්‍රතිපදාවට පැමිණි සම්‍යක්ප්‍රතිපත්තියෙන් යුක්ත වූ ශ්‍රමණ බ්‍රාහ්මණයෝ ලෝකයෙහි නැත’ යනුවෙන් දරන දෘෂ්ටිය. භික්ෂූන් වහන්ස, මේ දිට්ඨිවිපත්තියයි කියනු ලැබේ. සීලවිපත්තිය හේතු කොටගෙන හෝ, භික්ෂූන් වහන්ස, චිත්තවිපත්තිය හේතු කොටගෙන හෝ, භික්ෂූන් වහන්ස, දිට්ඨිවිපත්තිය හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදිත්. භික්ෂූන් වහන්ස, යම්සේ පතුළක් නැති මැණිකක් ඉහළට විසි කළ කල්හි යම් යම් තැනක වැටේද, හොඳින් පිහිටන්නේම වේද; එසේම භික්ෂූන් වහන්ස, සීලවිපත්තිය හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදිත්. චිත්තවිපත්තිය හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදිත්. දිට්ඨිවිපත්තිය හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදිත්. භික්ෂූන් වහන්ස, මේ විපත්ති තුන වන්නේය.\n\nභික්ෂූන් වහන්ස, මේ සම්පදා තුනකි. කවරේද ඒ තුන? සීලසම්පදාව, චිත්තසම්පදාව, දිට්ඨිසම්පදාව.\n\nභික්ෂූන් වහන්ස, සීලසම්පදාව යනු කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැමෙක් පරපණ නැසීමෙන් වැළකුණේ වෙයි, නුදුන් දේ ගැනීමෙන් වැළකුණේ වෙයි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණේ වෙයි, බොරු කීමෙන් වැළකුණේ වෙයි, කේළාම් කීමෙන් වැළකුණේ වෙයි, පරුෂ වචන කීමෙන් වැළකුණේ වෙයි, සම්ඵප්පලාපයෙන් වැළකුණේ වෙයි. භික්ෂූන් වහන්ස, මේ සීලසම්පදාවයි කියනු ලැබේ. භික්ෂූන් වහන්ස, චිත්තසම්පදාව යනු කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැමෙක් අභිජ්ඣා රහිත වෙයි, ව්‍යාපාද රහිත සිත් ඇත්තෙක් වෙයි. භික්ෂූන් වහන්ස, මේ චිත්තසම්පදාවයි කියනු ලැබේ. භික්ෂූන් වහන්ස, දිට්ඨිසම්පදාව යනු කවරේද? භික්ෂූන් වහන්ස, මෙහිලා ඇතැමෙක් සම්මාදිට්ඨික (සම්මා දිට්ඨියෙන් යුක්ත) වෙයි, අවිපරීත දර්ශනයෙන් යුක්ත වෙයි – ‘දුන් දෙයෙහි විපාක ඇත, පිදූ දෙයෙහි විපාක ඇත, හෝම කළ දෙයෙහි විපාක ඇත, හොඳ නරක කර්මයන්ගේ ඵලවිපාක ඇත, මේ ලෝකය ඇත, පරලෝකය ඇත, මවක් ඇත, පියෙක් ඇත, ඕපපාතික සත්වයෝ ඇත, යම් ශ්‍රමණ බ්‍රාහ්මණයෝ මේ ලෝකයත් පරලෝකයත් තමන්ම අභිඥාවෙන් සාක්ෂාත් කොට ප්‍රකාශ කරන්නාහු නම්, එබඳු සම්‍යක්ප්‍රතිපදාවට පැමිණි සම්‍යක්ප්‍රතිපත්තියෙන් යුක්ත වූ ශ්‍රමණ බ්‍රාහ්මණයෝ ලෝකයෙහි වෙති’ යනුවෙන් දරන දෘෂ්ටිය. භික්ෂූන් වහන්ස, මේ දිට්ඨිසම්පදාවයි කියනු ලැබේ. සීලසම්පදාව හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිත්. භික්ෂූන් වහන්ස, චිත්තසම්පදාව හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිත්. භික්ෂූන් වහන්ස, දිට්ඨිසම්පදාව හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිත්. භික්ෂූන් වහන්ස, යම්සේ පතුළක් නැති මැණිකක් ඉහළට විසි කළ කල්හි යම් යම් තැනක වැටේද, හොඳින් පිහිටන්නේම වේද; එසේම භික්ෂූන් වහන්ස, සීලසම්පදාව හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිත්. චිත්තසම්පදාව හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිත්. දිට්ඨිසම්පදාව හේතු කොටගෙන හෝ සත්වයෝ ශරීරය බිඳී, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිත්. භික්ෂූන් වහන්ස, මේ සම්පදා තුන වන්නේය.",
      "paliTitle": "Apaṇṇakasuttaṃ",
      "englishTitle": "The Discourse on the Unmistakable/Sure Practice",
      "sinhalaTitle": "අපණ්ණක සූත්‍රය"
    },
    {
      "number": 120,
      "pali": "‘‘Tisso imā, bhikkhave, vipattiyo. Katamā tisso? Kammantavipatti, ājīvavipatti, diṭṭhivipatti. Katamā ca, bhikkhave, kammantavipatti? Idha, bhikkhave, ekacco pāṇātipātī hoti…pe… samphappalāpī hoti. Ayaṃ vuccati, bhikkhave, kammantavipatti. ‘‘Katamā ca, bhikkhave, ājīvavipatti? Idha, bhikkhave, ekacco micchāājīvo hoti, micchāājīvena jīvikaṃ [jīvitaṃ (syā. kaṃ. ka.)] kappeti. Ayaṃ vuccati, bhikkhave, ājīvavipatti. ‘‘Katamā ca, bhikkhave, diṭṭhivipatti? Idha, bhikkhave, ekacco micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhivipatti. Imā kho, bhikkhave, tisso vipattiyoti. ‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Kammantasampadā, ājīvasampadā, diṭṭhisampadā. Katamā ca, bhikkhave, kammantasampadā? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti…pe… samphappalāpā paṭivirato hoti. Ayaṃ vuccati, bhikkhave, kammantasampadā. ‘‘Katamā ca, bhikkhave, ājīvasampadā? Idha, bhikkhave, ekacco sammāājīvo hoti, sammāājīvena jīvikaṃ kappeti. Ayaṃ vuccati, bhikkhave, ājīvasampadā. ‘‘Katamā ca, bhikkhave, diṭṭhisampadā? Idha, bhikkhave, ekacco sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ vuccati, bhikkhave, diṭṭhisampadā. Imā kho, bhikkhave, tisso sampadā’’ti. Sattamaṃ.",
      "english": "Bhikkhus, there are these three failures. What are these three? Failure in action, failure in livelihood, and failure in view.\n\nAnd what, bhikkhus, is failure in action? Here, bhikkhus, someone is a killer of living beings, a taker of what is not given, one who engages in sexual misconduct, a speaker of false speech, divisive speech, harsh speech, or frivolous talk. This, bhikkhus, is called failure in action. And what, bhikkhus, is failure in livelihood? Here, bhikkhus, someone has a wrong livelihood; they sustain their life through wrong livelihood. This, bhikkhus, is called failure in livelihood. And what, bhikkhus, is failure in view? Here, bhikkhus, someone holds a wrong view, a perverted perception, thinking: ‘There is no result from giving, offering, or sacrifice; there is no fruit or consequence of good and bad actions; there is no this world or other world; there is no mother or father; there are no spontaneously arisen beings; and there are no ascetics or brahmins in the world who, having directly known and realized this world and the other world for themselves, proclaim them.’ This, bhikkhus, is called failure in view. These, bhikkhus, are the three failures.\n\nBhikkhus, there are these three accomplishments. What are these three? Accomplishment in action, accomplishment in livelihood, and accomplishment in view.\n\nAnd what, bhikkhus, is accomplishment in action? Here, bhikkhus, someone abstains from killing living beings, from taking what is not given, from sexual misconduct, from false speech, from divisive speech, from harsh speech, and from frivolous talk. This, bhikkhus, is called accomplishment in action. And what, bhikkhus, is accomplishment in livelihood? Here, bhikkhus, someone has a right livelihood; they sustain their life through right livelihood. This, bhikkhus, is called accomplishment in livelihood. And what, bhikkhus, is accomplishment in view? Here, bhikkhus, someone holds a right view, an unperverted perception, thinking: ‘There is a result from giving, offering, and sacrifice; there is fruit and consequence of good and bad actions; there is this world and other world; there is mother and father; there are spontaneously arisen beings; and there are ascetics or brahmins in the world who, having directly known and realized this world and the other world for themselves, proclaim them.’ This, bhikkhus, is called accomplishment in view. These, bhikkhus, are the three accomplishments.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ විපත්ති තුනක් තිබේ. ඒ තුන කුමක්ද? කම්මන්තවිපත්තිය, ආජීවවිපත්තිය, දිට්ඨිවිපත්තියයි.\n\nභික්ෂූන් වහන්ස, කම්මන්තවිපත්තිය යනු කුමක්ද? භික්ෂූන් වහන්ස, මෙහි ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙහි යෙදෙයි... (පෙ)... සම්ඵප්ප්‍රලාපී වෙයි. භික්ෂූන් වහන්ස, මෙය කම්මන්තවිපත්තියයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ආජීවවිපත්තිය යනු කුමක්ද? භික්ෂූන් වහන්ස, මෙහි ඇතැම් පුද්ගලයෙක් මිථ්‍යා ආජීවයෙන් (වැරදි ජීවනෝපායෙන්) යුක්ත වෙයි, මිථ්‍යා ආජීවයෙන් ජීවිකාව පවත්වයි. භික්ෂූන් වහන්ස, මෙය ආජීවවිපත්තියයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දිට්ඨිවිපත්තිය යනු කුමක්ද? භික්ෂූන් වහන්ස, මෙහි ඇතැම් පුද්ගලයෙක් මිථ්‍යාදෘෂ්ටික වෙයි, විපරීත දර්ශනයෙන් (වැරදි දැක්මකින්) යුක්ත වෙයි – ‘දෙන ලද දේ අත්ථි වශයෙන් (ඵලයක්) නැත, පූජා කරන ලද දේ අත්ථි වශයෙන් (ඵලයක්) නැත... (පෙ)... යම් ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ මේ ලෝකයත් පරලෝකයත් තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරත්ද, ඔවුන්ද නැත’ යනුවෙන් (ඔහුගේ දෘෂ්ටිය වෙයි). භික්ෂූන් වහන්ස, මෙය දිට්ඨිවිපත්තියයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මේවා විපත්ති තුනයි.\n\nභික්ෂූන් වහන්ස, මේ සම්පත් තුනක් තිබේ. ඒ තුන කුමක්ද? කම්මන්තසම්පදාව, ආජීවසම්පදාව, දිට්ඨිසම්පදාවයි.\n\nභික්ෂූන් වහන්ස, කම්මන්තසම්පදාව යනු කුමක්ද? භික්ෂූන් වහන්ස, මෙහි ඇතැම් පුද්ගලයෙක් ප්‍රාණඝාතයෙන් වැළකුණේ වෙයි... (පෙ)... සම්ඵප්ප්‍රලාපයෙන් වැළකුණේ වෙයි. භික්ෂූන් වහන්ස, මෙය කම්මන්තසම්පදාවයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, ආජීවසම්පදාව යනු කුමක්ද? භික්ෂූන් වහන්ස, මෙහි ඇතැම් පුද්ගලයෙක් සම්මා ආජීවයෙන් (නිවැරදි ජීවනෝපායෙන්) යුක්ත වෙයි, සම්මා ආජීවයෙන් ජීවිකාව පවත්වයි. භික්ෂූන් වහන්ස, මෙය ආජීවසම්පදාවයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දිට්ඨිසම්පදාව යනු කුමක්ද? භික්ෂූන් වහන්ස, මෙහි ඇතැම් පුද්ගලයෙක් සම්මාදෘෂ්ටික වෙයි, අවිපරීත දර්ශනයෙන් (නිවැරදි දැක්මකින්) යුක්ත වෙයි – ‘දෙන ලද දේ අත්ථි වශයෙන් (ඵලයක්) ඇත, පූජා කරන ලද දේ අත්ථි වශයෙන් (ඵලයක්) ඇත... (පෙ)... යම් ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ මේ ලෝකයත් පරලෝකයත් තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරත්ද, ඔවුන්ද ඇත’ යනුවෙන් (ඔහුගේ දෘෂ්ටිය වෙයි). භික්ෂූන් වහන්ස, මෙය දිට්ඨිසම්පදාවයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මේවා සම්පත් තුනයි.",
      "paliTitle": "Kammantasuttaṃ",
      "englishTitle": "Work Sutta",
      "sinhalaTitle": "කම්මන්ත සූත්‍රය"
    },
    {
      "number": 121,
      "pali": "‘‘Tīṇimāni, bhikkhave, soceyyāni. Katamāni tīṇi? Kāyasoceyyaṃ, vacīsoceyyaṃ, manosoceyyaṃ. Katamañca, bhikkhave, kāyasoceyyaṃ? Idha, bhikkhave, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyasoceyyaṃ. ‘‘Katamañca, bhikkhave, vacīsoceyyaṃ? Idha, bhikkhave, ekacco musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Idaṃ vuccati bhikkhave, vacīsoceyyaṃ. ‘‘Katamañca, bhikkhave, manosoceyyaṃ? Idha, bhikkhave, ekacco anabhijjhālu hoti abyāpannacitto sammādiṭṭhiko. Idaṃ vuccati, bhikkhave, manosoceyyaṃ. Imāni kho, bhikkhave, tīṇi soceyyānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these three purifications. Which three? Purification of body, purification of speech, and purification of mind.\n\nAnd what, monks, is purification of body? Here, monks, someone abstains from the destruction of life, abstains from taking what is not given, and abstains from sexual misconduct. This, monks, is called purification of body.\n\nAnd what, monks, is purification of speech? Here, monks, someone abstains from false speech, abstains from divisive speech, abstains from harsh speech, and abstains from idle chatter. This, monks, is called purification of speech.\n\nAnd what, monks, is purification of mind? Here, monks, someone is free from covetousness, has a mind free from ill will, and possesses right view. This, monks, is called purification of mind. These, monks, are the three purifications.",
      "sinhala": "භික්ෂූනි, මේ සෝචෙය්‍ය හෙවත් පිරිසිදුකම් තුනක් තිබේ. ඒ තුන කවරේද? කය සෝචෙය්‍යය, වචී සෝචෙය්‍යය, මනෝ සෝචෙය්‍යය යන ඒවායි.\n\nභික්ෂූනි, කය සෝචෙය්‍යය කවරේද? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් ප්‍රාණඝාතයෙන් වැළකී සිටීද, අදත්තාදානයෙන් වැළකී සිටීද, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටීද, භික්ෂූනි, මෙය කය සෝචෙය්‍යය ලෙස කියනු ලැබේ.\n\nභික්ෂූනි, වචී සෝචෙය්‍යය කවරේද? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් මුසාවාදයෙන් වැළකී සිටීද, පිසුණු වචනයෙන් වැළකී සිටීද, ඵරුෂ වචනයෙන් වැළකී සිටීද, සම්ප්‍රප්පලාපයෙන් වැළකී සිටීද, භික්ෂූනි, මෙය වචී සෝචෙය්‍යය ලෙස කියනු ලැබේ.\n\nභික්ෂූනි, මනෝ සෝචෙය්‍යය කවරේද? භික්ෂූනි, මෙහිලා යම් පුද්ගලයෙක් අනුන්ගේ දේට ආශා නොකරන, ව්‍යාපාද රහිත සිතක් ඇති, සම්මා දිට්ඨියෙන් යුක්ත කෙනෙක් වේද, භික්ෂූනි, මෙය මනෝ සෝචෙය්‍යය ලෙස කියනු ලැබේ.\n\nභික්ෂූනි, සැබවින්ම මේවා පිරිසිදුකම් තුනයි.",
      "paliTitle": "Paṭhamasoceyyasuttaṃ",
      "englishTitle": "The First Discourse on Purity",
      "sinhalaTitle": "පළමු සෝචෙය්‍ය සූත්‍රය"
    },
    {
      "number": 122,
      "pali": "‘‘Tīṇimāni, bhikkhave, soceyyāni. Katamāni tīṇi? Kāyasoceyyaṃ, vacīsoceyyaṃ, manosoceyyaṃ. Katamañca, bhikkhave, kāyasoceyyaṃ? Idha, bhikkhave, bhikkhu pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyasoceyyaṃ. ‘‘Katamañca, bhikkhave, vacīsoceyyaṃ? Idha, bhikkhave, bhikkhu musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Idaṃ vuccati, bhikkhave, vacīsoceyyaṃ. ‘‘Katamañca, bhikkhave, manosoceyyaṃ? Idha, bhikkhave, bhikkhu santaṃ vā ajjhattaṃ kāmacchandaṃ – ‘atthi me ajjhattaṃ kāmacchando’ti pajānāti; asantaṃ vā ajjhattaṃ kāmacchandaṃ – ‘natthi me ajjhattaṃ kāmacchando’ti pajānāti; yathā ca anuppannassa kāmacchandassa uppādo hoti, tañca pajānāti; yathā ca uppannassa kāmacchandassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa kāmacchandassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ byāpādaṃ – ‘atthi me ajjhattaṃ byāpādo’ti pajānāti; asantaṃ vā ajjhattaṃ byāpādaṃ – ‘natthi me ajjhattaṃ byāpādo’ti pajānāti; yathā ca anuppannassa byāpādassa uppādo hoti, tañca pajānāti; yathā ca uppannassa byāpādassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa byāpādassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ thinamiddhaṃ – ‘atthi me ajjhattaṃ thinamiddha’nti pajānāti; asantaṃ vā ajjhattaṃ thinamiddhaṃ – ‘natthi me ajjhattaṃ thinamiddha’nti pajānāti; yathā ca anuppannassa thinamiddhassa uppādo hoti, tañca pajānāti; yathā ca uppannassa thinamiddhassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa thinamiddhassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ uddhaccakukkuccaṃ – ‘atthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti; asantaṃ vā ajjhattaṃ uddhaccakukkuccaṃ – ‘natthi me ajjhattaṃ uddhaccakukkucca’nti pajānāti; yathā ca anuppannassa uddhaccakukkuccassa uppādo hoti, tañca pajānāti; yathā ca uppannassa uddhaccakukkuccassa pahānaṃ hoti, tañca pajānāti; yathā ca pahīnassa uddhaccakukkuccassa āyatiṃ anuppādo hoti, tañca pajānāti; santaṃ vā ajjhattaṃ vicikicchaṃ – ‘atthi me ajjhattaṃ vicikicchā’ti pajānāti; asantaṃ vā ajjhattaṃ vicikicchaṃ – ‘natthi me ajjhattaṃ vicikicchā’ti pajānāti; yathā ca anuppannāya vicikicchāya uppādo hoti, tañca pajānāti; yathā ca uppannāya vicikicchāya pahānaṃ hoti, tañca pajānāti; yathā ca pahīnāya vicikicchāya āyatiṃ anuppādo hoti, tañca pajānāti. Idaṃ vuccati, bhikkhave, manosoceyyaṃ. Imāni kho, bhikkhave, tīṇi soceyyānīti. [itivu. 66] ‘‘Kāyasuciṃ vacīsuciṃ, cetosuciṃ anāsavaṃ; Suciṃ soceyyasampannaṃ, āhu ninhātapāpaka’’nti. navamaṃ;",
      "english": "“Monks, there are these three kinds of purity. What are these three? Purity of body, purity of speech, and purity of mind.\n\n“And what, monks, is purity of body? Here, monks, a monk abstains from the destruction of life, abstains from taking what is not given, and abstains from unchaste conduct. This, monks, is called purity of body.\n\n“And what, monks, is purity of speech? Here, monks, a monk abstains from false speech, abstains from divisive speech, abstains from harsh speech, and abstains from idle chatter. This, monks, is called purity of speech.\n\n“And what, monks, is purity of mind? Here, monks, a monk understands, ‘I have sensual desire within me,’ when sensual desire is present within him; he understands, ‘I do not have sensual desire within me,’ when sensual desire is not present within him. He understands how unarisen sensual desire arises; he understands how arisen sensual desire is abandoned; and he understands how abandoned sensual desire will not arise again in the future. He understands, ‘I have ill will within me,’ when ill will is present within him; he understands, ‘I do not have ill will within me,’ when ill will is not present within him. He understands how unarisen ill will arises; he understands how arisen ill will is abandoned; and he understands how abandoned ill will will not arise again in the future. He understands, ‘I have sloth and torpor within me,’ when sloth and torpor are present within him; he understands, ‘I do not have sloth and torpor within me,’ when sloth and torpor are not present within him. He understands how unarisen sloth and torpor arise; he understands how arisen sloth and torpor are abandoned; and he understands how abandoned sloth and torpor will not arise again in the future. He understands, ‘I have restlessness and remorse within me,’ when restlessness and remorse are present within him; he understands, ‘I do not have restlessness and remorse within me,’ when restlessness and remorse are not present within him. He understands how unarisen restlessness and remorse arise; he understands how arisen restlessness and remorse are abandoned; and he understands how abandoned restlessness and remorse will not arise again in the future. He understands, ‘I have doubt within me,’ when doubt is present within him; he understands, ‘I do not have doubt within me,’ when doubt is not present within him. He understands how unarisen doubt arises; he understands how arisen doubt is abandoned; and he understands how abandoned doubt will not arise again in the future. This, monks, is called purity of mind. These, monks, are the three kinds of purity.\n\nOne pure in body, pure in speech, pure in mind, one who is free from defilements, pure and endowed with purity—such a one is called one who has washed away all evil.",
      "sinhala": "භික්ෂූණි, මේ පාරිශුද්‍ධි තුනකි. ඒ තුන කවරේද? කය පාරිශුද්‍ධිය, වචී පාරිශුද්‍ධිය, මනෝ පාරිශුද්‍ධියයි. භික්ෂූණි, කය පාරිශුද්‍ධිය කවරේද? භික්ෂූණි, මෙහිලා භික්‍ෂුව ප්‍රාණඝාතයෙන් වැළකී සිටී. අදින්නාදානයෙන් වැළකී සිටී. අබ්‍රහ්මචර්‍යාවෙන් වැළකී සිටී. භික්ෂූණි, මෙය කය පාරිශුද්‍ධිය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, වචී පාරිශුද්‍ධිය කවරේද? භික්ෂූණි, මෙහිලා භික්‍ෂුව බොරු කීමෙන් වැළකී සිටී. පිසුනු බස් කීමෙන් වැළකී සිටී. රළු බස් කීමෙන් වැළකී සිටී. සම්ඵප්‍ප්‍රලාපයෙන් වැළකී සිටී. භික්ෂූණි, මෙය වචී පාරිශුද්‍ධිය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, මනෝ පාරිශුද්‍ධිය කවරේද? භික්ෂූණි, මෙහිලා භික්‍ෂුව තමා තුළ ඇති කාමච්ඡන්දය, ‘මා තුළ කාමච්ඡන්දය ඇතැ’යි දනී. තමා තුළ නැති කාමච්ඡන්දය, ‘මා තුළ කාමච්ඡන්දය නැතැ’යි දනී. නූපන් කාමච්ඡන්දය උපදින්නේ කෙසේදැයි දනී. උපන් කාමච්ඡන්දය ප්‍රහීණ වන්නේ කෙසේදැයි දනී. ප්‍රහීණ වූ කාමච්ඡන්දය නැවත නූපදින්නේ කෙසේදැයි දනී. තමා තුළ ඇති ව්‍යාපාදය, ‘මා තුළ ව්‍යාපාදය ඇතැ’යි දනී. තමා තුළ නැති ව්‍යාපාදය, ‘මා තුළ ව්‍යාපාදය නැතැ’යි දනී. නූපන් ව්‍යාපාදය උපදින්නේ කෙසේදැයි දනී. උපන් ව්‍යාපාදය ප්‍රහීණ වන්නේ කෙසේදැයි දනී. ප්‍රහීණ වූ ව්‍යාපාදය නැවත නූපදින්නේ කෙසේදැයි දනී. තමා තුළ ඇති ථීනමිද්ධය, ‘මා තුළ ථීනමිද්ධය ඇතැ’යි දනී. තමා තුළ නැති ථීනමිද්ධය, ‘මා තුළ ථීනමිද්ධය නැතැ’යි දනී. නූපන් ථීනමිද්ධය උපදින්නේ කෙසේදැයි දනී. උපන් ථීනමිද්ධය ප්‍රහීණ වන්නේ කෙසේදැයි දනී. ප්‍රහීණ වූ ථීනමිද්ධය නැවත නූපදින්නේ කෙසේදැයි දනී. තමා තුළ ඇති උද්ධච්චකුක්කුච්චය, ‘මා තුළ උද්ධච්චකුක්කුච්චය ඇතැ’යි දනී. තමා තුළ නැති උද්ධච්චකුක්කුච්චය, ‘මා තුළ උද්ධච්චකුක්කුච්චය නැතැ’යි දනී. නූපන් උද්ධච්චකුක්කුච්චය උපදින්නේ කෙසේදැයි දනී. උපන් උද්ධච්චකුක්කුච්චය ප්‍රහීණ වන්නේ කෙසේදැයි දනී. ප්‍රහීණ වූ උද්ධච්චකුක්කුච්චය නැවත නූපදින්නේ කෙසේදැයි දනී. තමා තුළ ඇති විචිකිච්ඡාව, ‘මා තුළ විචිකිච්ඡාව ඇතැ’යි දනී. තමා තුළ නැති විචිකිච්ඡාව, ‘මා තුළ විචිකිච්ඡාව නැතැ’යි දනී. නූපන් විචිකිච්ඡාව උපදින්නේ කෙසේදැයි දනී. උපන් විචිකිච්ඡාව ප්‍රහීණ වන්නේ කෙසේදැයි දනී. ප්‍රහීණ වූ විචිකිච්ඡාව නැවත නූපදින්නේ කෙසේදැයි දනී. භික්ෂූණි, මෙය මනෝ පාරිශුද්‍ධිය යැයි කියනු ලැබේ. භික්ෂූණි, මේ පාරිශුද්‍ධි තුනයි.\n\nකයින් පිරිසිදු වූ, වචනයෙන් පිරිසිදු වූ, සිතින් පිරිසිදු වූ, ආශ්‍රව රහිත වූ, පිරිසිදු වූ, පාරිශුද්‍ධියෙන් යුක්ත වූ තැනැත්තා පාපයන් දුරු කළ කෙනෙකු ලෙස හඳුන්වනු ලැබේ.",
      "paliTitle": "Dutiyasoceyyasuttaṃ",
      "englishTitle": "Second Sutta on Purity",
      "sinhalaTitle": "දුතිය සෝචෙය්‍ය සූත්‍රය"
    },
    {
      "number": 123,
      "pali": "‘‘Tīṇimāni, bhikkhave, moneyyāni. Katamāni tīṇi? Kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ. Katamañca, bhikkhave, kāyamoneyyaṃ? Idha, bhikkhave, bhikkhu pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti. Idaṃ vuccati, bhikkhave, kāyamoneyyaṃ. ‘‘Katamañca, bhikkhave, vacīmoneyyaṃ? Idha, bhikkhave, bhikkhu musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti. Idaṃ vuccati, bhikkhave, vacīmoneyyaṃ. ‘‘Katamañca, bhikkhave, manomoneyyaṃ? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ vuccati, bhikkhave, manomoneyyaṃ. Imāni kho, bhikkhave, tīṇi moneyyānī’’ti. ‘‘Kāyamuniṃ vacīmuniṃ, cetomuniṃ anāsavaṃ; Muniṃ moneyyasampannaṃ, āhu sabbappahāyina’’nti. dasamaṃ; Āpāyikavaggo dvādasamo. Tassuddānaṃ – Āpāyiko dullabho appameyyaṃ, āneñjavipattisampadā; Apaṇṇako ca kammanto, dve soceyyāni moneyyanti. (13) 3. Kusināravaggo",
      "english": "There are these three forms of sagely conduct, bhikkhus. Which three? Sagely conduct of body, sagely conduct of speech, and sagely conduct of mind.\n\nAnd what, bhikkhus, is sagely conduct of body? Here, bhikkhus, a monk abstains from the destruction of life, abstains from taking what is not given, and abstains from unchaste conduct. This, bhikkhus, is called sagely conduct of body.\n\nAnd what, bhikkhus, is sagely conduct of speech? Here, bhikkhus, a monk abstains from false speech, abstains from divisive speech, abstains from harsh speech, and abstains from idle chatter. This, bhikkhus, is called sagely conduct of speech.\n\nAnd what, bhikkhus, is sagely conduct of mind? Here, bhikkhus, a monk, through the destruction of the taints, having realized for himself in this very life the taintless liberation of mind and liberation by wisdom through direct knowledge, he dwells having attained it. This, bhikkhus, is called sagely conduct of mind. These, bhikkhus, are the three forms of sagely conduct.\n\nA sage of body, a sage of speech, a sage of mind, the taintless one—\nThey call that sage, accomplished in sagely conduct, one who has abandoned everything.",
      "sinhala": "භික්ෂූණි, මේ මුනිවර පැවතුම් තුනක් ඇත. ඒ තුන කවරේද?\n\nකාය මුනිවර පැවතුම, වචී මුනිවර පැවතුම, මනෝ මුනිවර පැවතුම යි. භික්ෂූණි, කාය මුනිවර පැවතුම යනු කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව ප්‍රාණඝාතයෙන් වැළකී සිටින්නේ ය. අදත්තාදානයෙන් වැළකී සිටින්නේ ය. අබ්‍රහ්මචරියාවෙන් වැළකී සිටින්නේ ය. භික්ෂූණි, මෙය කාය මුනිවර පැවතුම යැයි කියනු ලැබේ.\n\nභික්ෂූණි, වචී මුනිවර පැවතුම යනු කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව මුසාවාදයෙන් වැළකී සිටින්නේ ය. පිසුනු වචනයෙන් වැළකී සිටින්නේ ය. ඵරුෂ වචනයෙන් වැළකී සිටින්නේ ය. සම්ඵප්‍රලාපයෙන් වැළකී සිටින්නේ ය. භික්ෂූණි, මෙය වචී මුනිවර පැවතුම යැයි කියනු ලැබේ.\n\nභික්ෂූණි, මනෝ මුනිවර පැවතුම යනු කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරන්නේ ය. භික්ෂූණි, මෙය මනෝ මුනිවර පැවතුම යැයි කියනු ලැබේ. භික්ෂූණි, මේ මුනිවර පැවතුම් තුන යි.\n\nකාය මුනීන්, වචී මුනීන්, චේතෝ මුනීන්, ආශ්‍රව රහිත වූ මුනීන්, මුනිවර පැවතුමෙන් යුක්ත වූ මුනීන්, සියල්ල ප්‍රහාණය කළ තැනැත්තෙකු යැයි පවසති.",
      "paliTitle": "Moneyyasuttaṃ",
      "englishTitle": "Sagacity Sutta",
      "sinhalaTitle": "මෝනෙය්‍ය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}