{
  "id": "an3.11",
  "title": {
    "pali": "Tatiyapaṇṇāsakaṃ - Sambodhavaggo",
    "english": "The Third Fifties – The Chapter on Perfect Awakening",
    "sinhala": "තතියපණ්ණාසකය - සම්බෝධ වර්ගය"
  },
  "sections": [
    {
      "number": 104,
      "pali": "‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho loke assādo, ko ādīnavo, kiṃ nissaraṇa’nti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘yaṃ kho lokaṃ [loke (sī. syā. kaṃ. pī.)] paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ loke assādo. Yaṃ loko [loke (pī. ka.)] anicco dukkho vipariṇāmadhammo, ayaṃ loke ādīnavo. Yo loke chandarāgavinayo chandarāgappahānaṃ, idaṃ loke nissaraṇa’nti [lokanissaraṇaṃ (aṭṭha.) ‘‘loke nissaraṇa’’nti padena saṃsanditabbaṃ]. Yāvakīvañcāhaṃ, bhikkhave, evaṃ lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti [abhisambuddho (sī. syā. kaṃ. ka.)] paccaññāsiṃ. Yato ca khvāhaṃ [kho ahaṃ (sī. pī.), khohaṃ (syā. kaṃ. ka.)], bhikkhave, evaṃ lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti [cetovimutti (sī. pī. ka.)], ayamantimā jāti, natthi dāni punabbhavo’’’ti. Paṭhamaṃ.",
      "english": "Before my full enlightenment, monks, while I was still an unenlightened Bodhisatta, this thought arose in me: ‘What, indeed, is the gratification in the world? What is its danger? What is the escape from it?’ Then, monks, this thought arose in me: ‘Whatever pleasant and joyful feeling arises in dependence on the world—this is the gratification in the world. That the world is impermanent, unsatisfactory, and subject to change—this is the danger in the world. The disciplining of desire and passion for the world, the abandoning of desire and passion for the world—this is the escape from the world.’ As long as, monks, I had not clearly understood, as they truly are, the gratification of the world as gratification, the danger of the world as danger, and the escape from the world as escape, so long did I not declare, in this world with its devas, Māras, and Brahmās, among the generation of recluses and brahmins, devas and humans, that I had attained unsurpassed perfect self-enlightenment. But when, monks, I had clearly understood, as they truly are, the gratification of the world as gratification, the danger of the world as danger, and the escape from the world as escape, then I declared, in this world with its devas, Māras, and Brahmās, among the generation of recluses and brahmins, devas and humans, that I had attained unsurpassed perfect self-enlightenment. And knowledge and vision arose in me: ‘My liberation is unshakeable; this is my final birth; now there is no more renewed existence.’",
      "sinhala": "භික්ෂූනි, මා සම්බුදු නොවූ බෝධිසත්වයෙකු ලෙස සිටියදී, මාගේ බුද්ධත්වයට පෙර මට මෙසේ සිතුණි: ‘ලෝකයේ ආශ්වාදය කුමක්ද? ආදීනවය කුමක්ද? නිස්සරණය කුමක්ද?’ කියා.\n\nභික්ෂූනි, මට මෙසේ සිතුණි: ‘යම් කිසි ලෝකය (ලෝකයෙහි අරමුණු) අරභයා සුවයක්, සෝමනස්සයක් උපදින්නේද, එය ලෝකයේ ආශ්වාදයයි. ලෝකය අනිත්‍ය, දුක්ඛිත, විපරිණාම වන ස්වභාවයක් ඇත්තේය යන යමක් ඇත්ද, එය ලෝකයේ ආදීනවයයි. ලෝකයෙහි යම් ඡන්දරාගය දුරු කිරීමක්ද, ඡන්දරාගය ප්‍ර​හාණය කිරීමක්ද ඇත්ද, එය ලෝකයේ නිස්සරණයයි.’ කියා.\n\nභික්ෂූනි, යම් තාක් කල් මම මෙසේ ලෝකයේ ආශ්වාදය ආශ්වාදයක් ලෙසින්ද, ආදීනවය ආදීනවයක් ලෙසින්ද, නිස්සරණය නිස්සරණයක් ලෙසින්ද, ඇති සැටියෙන් අවබෝධ නොකළෙම්ද, ඒ තාක් කල් මම දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍ර​ජාව තුළ ‘අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළෙමි’යි ප්‍ර​තිඥා නොකළෙමි. භික්ෂූනි, යම් හෙයකින් මම මෙසේ ලෝකයේ ආශ්වාදය ආශ්වාදයක් ලෙසින්ද, ආදීනවය ආදීනවයක් ලෙසින්ද, නිස්සරණය නිස්සරණයක් ලෙසින්ද, ඇති සැටියෙන් අවබෝධ කළෙම්ද, එවිට මම දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍ර​ජාව තුළ ‘අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළෙමි’යි ප්‍ර​තිඥා කළෙමි. තවද, මට මෙසේ ඥානයක් සහ දර්ශනයක් පහළ විය: ‘මාගේ විමුක්තිය නොසෙල්වෙන සුළුය. මෙය අවසාන ඉපදීමයි. දැන් නැවත භවයක් නැත’ කියා.",
      "paliTitle": "Pubbevasambodhasuttaṃ"
    },
    {
      "number": 105,
      "pali": "‘‘Lokassāhaṃ, bhikkhave, assādapariyesanaṃ acariṃ. Yo loke assādo tadajjhagamaṃ. Yāvatako loke assādo, paññāya me so sudiṭṭho. Lokassāhaṃ, bhikkhave, ādīnavapariyesanaṃ acariṃ. Yo loke ādīnavo tadajjhagamaṃ. Yāvatako loke ādīnavo, paññāya me so sudiṭṭho. Lokassāhaṃ, bhikkhave, nissaraṇapariyesanaṃ acariṃ. Yaṃ loke nissaraṇaṃ tadajjhagamaṃ. Yāvatakaṃ loke nissaraṇaṃ, paññāya me taṃ sudiṭṭhaṃ. Yāvakīvañcāhaṃ, bhikkhave, lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Yato ca khvāhaṃ, bhikkhave, lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti, ayamantimā jāti, natthi dāni punabbhavo’’’ti. Dutiyaṃ.",
      "english": "Monks, I undertook the search for the gratification in the world. Whatever gratification there is in the world, that I apprehended. As far as there is gratification in the world, that has been clearly seen by me with wisdom. Monks, I undertook the search for the danger in the world. Whatever danger there is in the world, that I apprehended. As far as there is danger in the world, that has been clearly seen by me with wisdom. Monks, I undertook the search for the escape from the world. Whatever escape there is from the world, that I apprehended. As far as there is escape from the world, that has been clearly seen by me with wisdom. And as long as, monks, I did not fully comprehend the gratification in the world as gratification, the danger in the world as danger, and the escape from the world as escape, according to reality, for so long, monks, I did not declare myself to be one who had attained unsurpassable perfect self-awakening in this world with its deities, Māras, and Brahmās, among the generation of recluses and brahmins, deities and humans. But when, monks, I did fully comprehend the gratification in the world as gratification, the danger in the world as danger, and the escape from the world as escape, according to reality, then, monks, I declared myself to be one who had attained unsurpassable perfect self-awakening in this world with its deities, Māras, and Brahmās, among the generation of recluses and brahmins, deities and humans. And knowledge and vision arose in me: ‘My liberation is unshakeable. This is my last birth. There is now no further existence.’",
      "sinhala": "මහණෙනි, මම ලෝකයේ ආස්වාදය සෙවීමෙහි හැසිරුණෙමි. ලෝකයේ යම් ආස්වාදයක් වේ ද, එය මම අවබෝධ කළෙමි. ලෝකයේ කොපමණ ආස්වාදයක් ඇත්ද, ඒ සියල්ල මා විසින් ප‍්​ර​ඥාවෙන් මැනවින් දක්නා ලදී. මහණෙනි, මම ලෝකයේ ආදීනවය සෙවීමෙහි හැසිරුණෙමි. ලෝකයේ යම් ආදීනවයක් වේ ද, එය මම අවබෝධ කළෙමි. ලෝකයේ කොපමණ ආදීනවයක් ඇත්ද, ඒ සියල්ල මා විසින් ප‍්​ර​ඥාවෙන් මැනවින් දක්නා ලදී. මහණෙනි, මම ලෝකයේ නිස්සරණය සෙවීමෙහි හැසිරුණෙමි. ලෝකයේ යම් නිස්සරණයක් වේ ද, එය මම අවබෝධ කළෙමි. ලෝකයේ කොපමණ නිස්සරණයක් ඇත්ද, ඒ සියල්ල මා විසින් ප‍්​ර​ඥාවෙන් මැනවින් දක්නා ලදී. මහණෙනි, යම්තාක් කල් මම ලෝකයේ ආස්වාදය ආස්වාද වශයෙන් ද, ආදීනවය ආදීනව වශයෙන් ද, නිස්සරණය නිස්සරණ වශයෙන් ද ඇති සැටියෙන් අවබෝධ නොකළෙම් ද, එතෙක් මහණෙනි, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බඹුන් සහිත වූ, ශ‍්​ර​මණ බ‍්​ර​ාහ්මණ ප‍්​ර​ජාව සහිත වූ, දෙවි මිනිසුන් සහිත වූ මේ ලෝකයෙහි ‘අනුත්තර සම්මා සම්බෝධියට පැමිණියෙමි’ යැයි ප‍්​ර​කාශ නොකළෙමි. මහණෙනි, යම් කලක මම ලෝකයේ ආස්වාදය ආස්වාද වශයෙන් ද, ආදීනවය ආදීනව වශයෙන් ද, නිස්සරණය නිස්සරණ වශයෙන් ද ඇති සැටියෙන් අවබෝධ කළෙම් ද, එකල්හි මහණෙනි, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බඹුන් සහිත වූ, ශ‍්​ර​මණ බ‍්​ර​ාහ්මණ ප‍්​ර​ජාව සහිත වූ, දෙවි මිනිසුන් සහිත වූ මේ ලෝකයෙහි ‘අනුත්තර සම්මා සම්බෝධියට පැමිණියෙමි’ යැයි ප‍්​ර​කාශ කළෙමි. තවද මට මේ ඥානය හා දර්ශනය පහළ විය – ‘මාගේ විමුක්තිය නොසෙල්වෙන්නකි. මේ මගේ අන්තිම ඉපදීමයි. දැන් නැවත භවයක් (ඉපදීමක්) නැත.’",
      "paliTitle": "Paṭhamaassādasuttaṃ"
    },
    {
      "number": 106,
      "pali": "‘‘No cedaṃ [no cetaṃ (syā. kaṃ. pī. ka.) saṃ. ni. 3.28 passitabbaṃ], bhikkhave, loke assādo abhavissa, nayidaṃ sattā loke sārajjeyyuṃ. Yasmā ca kho, bhikkhave, atthi loke assādo, tasmā sattā loke sārajjanti. No cedaṃ, bhikkhave, loke ādīnavo abhavissa, nayidaṃ sattā loke nibbindeyyuṃ. Yasmā ca kho, bhikkhave, atthi loke ādīnavo, tasmā sattā loke nibbindanti. No cedaṃ, bhikkhave, loke nissaraṇaṃ abhavissa, nayidaṃ sattā lokamhā [loke (ka.)] nissareyyuṃ. Yasmā ca kho, bhikkhave, atthi loke nissaraṇaṃ, tasmā sattā lokamhā nissaranti. Yāvakīvañca, bhikkhave, sattā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsuṃ [nābbhaññaṃsu (saṃ. ni. 3.28], neva tāva, bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā [vippayuttā (ka.)] vimariyādīkatena [vimariyādikatena (sī. pī. ka.)] cetasā vihariṃsu. Yato ca kho, bhikkhave, sattā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsuṃ, atha, bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā vimariyādīkatena cetasā viharantī’’ti. Tatiyaṃ.",
      "english": "Monks, if there were no gratification in the world, then beings would not become infatuated with the world. But because, monks, there is gratification in the world, beings therefore become infatuated with the world. Monks, if there were no danger in the world, then beings would not become disenchanted with the world. But because, monks, there is danger in the world, beings therefore become disenchanted with the world. Monks, if there were no escape from the world, then beings would not escape from the world. But because, monks, there is escape from the world, beings therefore escape from the world. And as long as, monks, beings did not understand as it actually is the gratification of the world as gratification, its danger as danger, and its escape as escape, then monks, beings did not dwell with a mind unconfined, escaped, disjoined, and fully liberated from the world with its devas, Māras, Brahmās, its population of recluses and brahmins, and its devas and humans. But when, monks, beings understood as it actually is the gratification of the world as gratification, its danger as danger, and its escape as escape, then, monks, beings dwell with a mind unconfined, escaped, disjoined, and fully liberated from the world with its devas, Māras, Brahmās, its population of recluses and brahmins, and its devas and humans.",
      "sinhala": "භික්ෂූන් වහන්ස, ලෝකයෙහි ආස්වාදයක් නොතිබුණා නම්, සත්වයෝ ලෝකයෙහි ඇලෙන්නේ නැත. භික්ෂූන් වහන්ස, යම් හෙයකින් ලෝකයෙහි ආස්වාදයක් ඇත්ද, එහෙයින් සත්වයෝ ලෝකයෙහි ඇලෙති. භික්ෂූන් වහන්ස, ලෝකයෙහි ආදීනවයක් නොතිබුණා නම්, සත්වයෝ ලෝකයෙහි කලකිරෙන්නේ නැත. භික්ෂූන් වහන්ස, යම් හෙයකින් ලෝකයෙහි ආදීනවයක් ඇත්ද, එහෙයින් සත්වයෝ ලෝකයෙහි කලකිරෙති. භික්ෂූන් වහන්ස, ලෝකයෙහි නිස්සරණයක් නොතිබුණා නම්, සත්වයෝ ලෝකයෙන් නිදහස් වන්නේ නැත. භික්ෂූන් වහන්ස, යම් හෙයකින් ලෝකයෙහි නිස්සරණයක් ඇත්ද, එහෙයින් සත්වයෝ ලෝකයෙන් නිදහස් වෙති.\n\nභික්ෂූන් වහන්ස, සත්වයෝ ලෝකයේ ආස්වාදය ආස්වාදය වශයෙන්ද, ආදීනවය ආදීනවය වශයෙන්ද, නිස්සරණය නිස්සරණය වශයෙන්ද, යථාභූත ඥානයෙන් (ඇත්ත ඇති සැටියෙන්) අවබෝධ නොකරන තාක් කල්, ඒ සත්වයෝ දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත වූ මේ ලෝකයෙන් නික්ම ගොස්, නොබැඳී, මුදාහැරී, සීමා රහිත වූ සිතකින් යුතුව වාසය නොකරති. භික්ෂූන් වහන්ස, යම් කලෙක සත්වයෝ ලෝකයේ ආස්වාදය ආස්වාදය වශයෙන්ද, ආදීනවය ආදීනවය වශයෙන්ද, නිස්සරණය නිස්සරණය වශයෙන්ද, යථාභූත ඥානයෙන් අවබෝධ කරගත්තාද, එවිට භික්ෂූන් වහන්ස, ඒ සත්වයෝ දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත වූ මේ ලෝකයෙන් නික්ම ගොස්, නොබැඳී, මුදාහැරී, සීමා රහිත වූ සිතකින් යුතුව වාසය කරති.",
      "paliTitle": "Dutiyaassādasuttaṃ"
    },
    {
      "number": 107,
      "pali": "‘‘Ye keci, bhikkhave, samaṇā vā brāhmaṇā vā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nappajānanti, na me te [na te (ka.)], bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ pajānanti, te kho, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti [viharissanti (sī. pī.)]. Catutthaṃ.",
      "english": "Monks, whatever recluses or brahmins do not truly understand the gratification of the world as gratification, its danger as danger, and its escape as escape, I do not regard those recluses or brahmins as recluses among recluses, nor as brahmins among brahmins. Nor do those venerable ones, having directly known and realized for themselves in this very life, enter upon and abide in the goal of recluseship or the goal of brahminhood. But, monks, whatever recluses or brahmins truly understand the gratification of the world as gratification, its danger as danger, and its escape as escape, those recluses or brahmins are regarded by me as recluses among recluses and as brahmins among brahmins. And those venerable ones, having directly known and realized for themselves in this very life, enter upon and abide in the goal of recluseship and the goal of brahminhood.",
      "sinhala": "භික්ෂූනි, යම් කිසි ශ්‍ර‍මණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ලෝකයේ ආශ්වාදය ආශ්වාදයක් ලෙස ද, එහි ආදීනවය ආදීනවයක් ලෙස ද, එයින් නිස්සරණය නිස්සරණයක් ලෙස ද, ඇති සැටියෙන් (යථාභූතව) ප්‍ර‍ඥාවෙන් අවබෝධ කර නොගනිත් ද, භික්ෂූනි, මා විසින් ඒ ශ්‍ර‍මණයෝ හෝ බ්‍රාහ්මණයෝ ශ්‍ර‍මණයන් අතර ශ්‍ර‍මණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද නොසලකනු ලැබෙත්. එම පූජ්‍යවරු මෙලොවදීම තමන් විසින්ම අභිඥාවෙන් (විශේෂ ඤාණයෙන්) ප්‍ර‍ත්‍යක්ෂ කොට, ශ්‍ර‍මණත්වයේ අරමුණ හෝ බ්‍රාහ්මණත්වයේ අරමුණ සාක්ෂාත් කරගෙන වාසය නොකරත්. යම් කිසි ශ්‍ර‍මණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ලෝකයේ ආශ්වාදය ආශ්වාදයක් ලෙස ද, එහි ආදීනවය ආදීනවයක් ලෙස ද, එයින් නිස්සරණය නිස්සරණයක් ලෙස ද, ඇති සැටියෙන් (යථාභූතව) ප්‍ර‍ඥාවෙන් අවබෝධ කරගනිත් ද, භික්ෂූනි, මා විසින් ඒ ශ්‍ර‍මණයෝ හෝ බ්‍රාහ්මණයෝ ශ්‍ර‍මණයන් අතර ශ්‍ර‍මණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද සලකනු ලැබෙත්. එම පූජ්‍යවරු මෙලොවදීම තමන් විසින්ම අභිඥාවෙන් (විශේෂ ඤාණයෙන්) ප්‍ර‍ත්‍යක්ෂ කොට, ශ්‍ර‍මණත්වයේ අරමුණ සහ බ්‍රාහ්මණත්වයේ අරමුණ සාක්ෂාත් කරගෙන වාසය කරත්.",
      "paliTitle": "Samaṇabrāhmaṇasuttaṃ"
    },
    {
      "number": 108,
      "pali": "‘‘Ruṇṇamidaṃ, bhikkhave, ariyassa vinaye yadidaṃ gītaṃ. Ummattakamidaṃ, bhikkhave, ariyassa vinaye yadidaṃ naccaṃ. Komārakamidaṃ, bhikkhave, ariyassa vinaye yadidaṃ ativelaṃ dantavidaṃsakahasitaṃ [dantavidaṃsakaṃ hasitaṃ (sī. pī.)]. Tasmātiha, bhikkhave, setughāto gīte, setughāto nacce, alaṃ vo dhammappamoditānaṃ sataṃ sitaṃ sitamattāyā’’ti. Pañcamaṃ.",
      "english": "Monks, singing is considered lamentation in the Discipline of the Noble Ones. Monks, dancing is considered madness in the Discipline of the Noble Ones. Monks, excessive, tooth-revealing laughter is considered childishness in the Discipline of the Noble Ones. Therefore, monks, there must be a complete cessation of singing; there must be a complete cessation of dancing. For you who delight in the Dhamma, a mere smile is sufficient.",
      "sinhala": "භික්ෂූන් වහන්සේලා, ආර්ය විනයෙහි ගීත ගායනා කිරීම නම් හඬා වැලපීමක් වැන්න. භික්ෂූන් වහන්සේලා, ආර්ය විනයෙහි නැටුම් නම් උමතුකමක් වැන්න. භික්ෂූන් වහන්සේලා, ආර්ය විනයෙහි දත් විදහා පාමින් අතිශයින් සිනාසීම නම් ළමා ක්‍රියාවක් වැන්න.\n\nඑහෙයින් භික්ෂූන් වහන්සේලා, ගීත ගායනය සම්පූර්ණයෙන්ම බැහැර කළ යුත්තකි. නැටීම සම්පූර්ණයෙන්ම බැහැර කළ යුත්තකි. ධර්මයෙහි ප්‍රමුදිත වූ ඔබට, සුළු සිනාවකින් සෑහීම ප්‍රමාණවත්ය.",
      "paliTitle": "Ruṇṇasuttaṃ"
    },
    {
      "number": 109,
      "pali": "‘‘Tiṇṇaṃ, bhikkhave, paṭisevanāya natthi titti. Katamesaṃ tiṇṇaṃ? Soppassa, bhikkhave, paṭisevanāya natthi titti. Surāmerayapānassa, bhikkhave, paṭisevanāya natthi titti. Methunadhammasamāpattiyā, bhikkhave, paṭisevanāya natthi titti. Imesaṃ, bhikkhave, tiṇṇaṃ paṭisevanāya natthi tittī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there is no satiety in the indulgence of three things. Which three? Monks, there is no satiety in the indulgence of sleep. Monks, there is no satiety in the indulgence of intoxicating drinks. Monks, there is no satiety in the indulgence of sexual activity. Monks, there is no satiety in the indulgence of these three things.",
      "sinhala": "භික්ෂූණි, කරුණු තුනක් නැවත නැවත සෙවීමෙන් හෝ ඒවාට නැවත නැවත යොමු වීමෙන් කිසිදා සෑහීමකට පත් විය නොහැක. ඒ කරුණු තුන කවරේද?\n\nභික්ෂූණි, නින්ද නැවත නැවත සෙවීමෙන් හෝ අධික නින්දට යොමු වීමෙන් කිසිදා සෑහීමකට පත් විය නොහැක. භික්ෂූණි, රහමෙර පානය නැවත නැවත සෙවීමෙන් හෝ අධික ලෙස ඊට යොමු වීමෙන් කිසිදා සෑහීමකට පත් විය නොහැක. භික්ෂූණි, මෛථුන ධර්‍මයෙහි නැවත නැවත යෙදීමෙන් හෝ එයට අධික ලෙස යොමු වීමෙන් කිසිදා සෑහීමකට පත් විය නොහැක. භික්ෂූණි, මේ කරුණු තුන නැවත නැවත සෙවීමෙන් හෝ ඒවාට නැවත නැවත යොමු වීමෙන් කිසිදා සෑහීමකට පත් විය නොහැක.",
      "paliTitle": "Atittisuttaṃ"
    },
    {
      "number": 110,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘citte, gahapati, arakkhite kāyakammampi arakkhitaṃ hoti, vacīkammampi arakkhitaṃ hoti, manokammampi arakkhitaṃ hoti. Tassa arakkhitakāyakammantassa arakkhitavacīkammantassa arakkhitamanokammantassa kāyakammampi avassutaṃ hoti, vacīkammampi avassutaṃ hoti, manokammampi avassutaṃ hoti. Tassa avassutakāyakammantassa avassutavacīkammantassa avassutamanokammantassa kāyakammampi pūtikaṃ hoti, vacīkammampi pūtikaṃ hoti, manokammampi pūtikaṃ hoti. Tassa pūtikāyakammantassa pūtivacīkammantassa pūtimanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā. ‘‘Seyyathāpi, gahapati, kūṭāgāre ducchanne kūṭampi arakkhitaṃ hoti, gopānasiyopi arakkhitā honti, bhittipi arakkhitā hoti; kūṭampi avassutaṃ hoti, gopānasiyopi avassutā honti, bhittipi avassutā hoti; kūṭampi pūtikaṃ hoti, gopānasiyopi pūtikā honti, bhittipi pūtikā hoti. ‘‘Evamevaṃ kho, gahapati, citte arakkhite kāyakammampi arakkhitaṃ hoti, vacīkammampi arakkhitaṃ hoti, manokammampi arakkhitaṃ hoti. Tassa arakkhitakāyakammantassa arakkhitavacīkammantassa arakkhitamanokammantassa kāyakammampi avassutaṃ hoti, vacīkammampi avassutaṃ hoti, manokammampi avassutaṃ hoti. Tassa avassutakāyakammantassa avassutavacīkammantassa avassutamanokammantassa kāyakammampi pūtikaṃ hoti, vacīkammampi pūtikaṃ hoti, manokammampi pūtikaṃ hoti. Tassa pūtikāyakammantassa pūtivacīkammantassa pūtimanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā. ‘‘Citte, gahapati, rakkhite kāyakammampi rakkhitaṃ hoti, vacīkammampi rakkhitaṃ hoti, manokammampi rakkhitaṃ hoti. Tassa rakkhitakāyakammantassa rakkhitavacīkammantassa rakkhitamanokammantassa kāyakammampi anavassutaṃ hoti, vacīkammampi anavassutaṃ hoti, manokammampi anavassutaṃ hoti. Tassa anavassutakāyakammantassa anavassutavacīkammantassa anavassutamanokammantassa kāyakammampi apūtikaṃ hoti, vacīkammampi apūtikaṃ hoti, manokammampi apūtikaṃ hoti. Tassa apūtikāyakammantassa apūtivacīkammantassa apūtimanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā. ‘‘Seyyathāpi, gahapati, kūṭāgāre succhanne kūṭampi rakkhitaṃ hoti, gopānasiyopi rakkhitā honti, bhittipi rakkhitā hoti; kūṭampi anavassutaṃ hoti, gopānasiyopi anavassutā honti, bhittipi anavassutā hoti; kūṭampi apūtikaṃ hoti, gopānasiyopi apūtikā honti, bhittipi apūtikā hoti. Evamevaṃ kho, gahapati, citte rakkhite kāyakammampi rakkhitaṃ hoti, vacīkammampi rakkhitaṃ hoti, manokammampi rakkhitaṃ hoti. Tassa rakkhitakāyakammantassa rakkhitavacīkammantassa rakkhitamanokammantassa kāyakammampi anavassutaṃ hoti, vacīkammampi anavassutaṃ hoti, manokammampi anavassutaṃ hoti. Tassa anavassutakāyakammantassa anavassutavacīkammantassa anavassutamanokammantassa kāyakammampi apūtikaṃ hoti, vacīkammampi apūtikaṃ hoti, manokammampi apūtikaṃ hoti. Tassa apūtikāyakammantassa apūtivacīkammantassa apūtimanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā’’ti. Sattamaṃ.",
      "english": "Then the householder Anāthapiṇḍika approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Blessed One said to him:\n\n“Householder, when the mind is unguarded, bodily action is unguarded, verbal action is unguarded, and mental action is unguarded. For one whose bodily action is unguarded, whose verbal action is unguarded, and whose mental action is unguarded, bodily action becomes permeated by defilements, verbal action becomes permeated by defilements, and mental action becomes permeated by defilements. For one whose bodily action is permeated by defilements, whose verbal action is permeated by defilements, and whose mental action is permeated by defilements, bodily action becomes corrupt, verbal action becomes corrupt, and mental action becomes corrupt. For one whose bodily action is corrupt, whose verbal action is corrupt, and whose mental action is corrupt, there is no good death, no auspicious passing away.\n\n“Just as, householder, in a badly thatched peaked house, the peak is unguarded, the rafters are unguarded, and the walls are unguarded; the peak becomes leaky, the rafters become leaky, and the walls become leaky; the peak becomes rotten, the rafters become rotten, and the walls become rotten.\n\n“In the same way, householder, when the mind is unguarded, bodily action is unguarded, verbal action is unguarded, and mental action is unguarded. For one whose bodily action is unguarded, whose verbal action is unguarded, and whose mental action is unguarded, bodily action becomes permeated by defilements, verbal action becomes permeated by defilements, and mental action becomes permeated by defilements. For one whose bodily action is permeated by defilements, whose verbal action is permeated by defilements, and whose mental action is permeated by defilements, bodily action becomes corrupt, verbal action becomes corrupt, and mental action becomes corrupt. For one whose bodily action is corrupt, whose verbal action is corrupt, and whose mental action is corrupt, there is no good death, no auspicious passing away.\n\n“Householder, when the mind is guarded, bodily action is guarded, verbal action is guarded, and mental action is guarded. For one whose bodily action is guarded, whose verbal action is guarded, and whose mental action is guarded, bodily action becomes unpermeated by defilements, verbal action becomes unpermeated by defilements, and mental action becomes unpermeated by defilements. For one whose bodily action is unpermeated by defilements, whose verbal action is unpermeated by defilements, and whose mental action is unpermeated by defilements, bodily action becomes uncorrupt, verbal action becomes uncorrupt, and mental action becomes uncorrupt. For one whose bodily action is uncorrupt, whose verbal action is uncorrupt, and whose mental action is uncorrupt, there is a good death, an auspicious passing away.\n\n“Just as, householder, in a well-thatched peaked house, the peak is guarded, the rafters are guarded, and the walls are guarded; the peak does not leak, the rafters do not leak, and the walls do not leak; the peak does not become rotten, the rafters do not become rotten, and the walls do not become rotten. In the same way, householder, when the mind is guarded, bodily action is guarded, verbal action is guarded, and mental action is guarded. For one whose bodily action is guarded, whose verbal action is guarded, and whose mental action is guarded, bodily action becomes unpermeated by defilements, verbal action becomes unpermeated by defilements, and mental action becomes unpermeated by defilements. For one whose bodily action is unpermeated by defilements, whose verbal action is unpermeated by defilements, and whose mental action is unpermeated by defilements, bodily action becomes uncorrupt, verbal action becomes uncorrupt, and mental action becomes uncorrupt. For one whose bodily action is uncorrupt, whose verbal action is uncorrupt, and whose mental action is uncorrupt, there is a good death, an auspicious passing away.”",
      "sinhala": "ඉන්පසු අනාථපිණ්ඩික ගෘහපතියා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩි විය.\n\nඑකත්පසෙකින් වාඩි වී සිටි අනාථපිණ්ඩික ගෘහපතියාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"ගෘහපතිය, සිත ආරක්ෂා නොකළ කල්හි, කාය කර්මද ආරක්ෂා නොකෙරේ. වචී කර්මද ආරක්ෂා නොකෙරේ. මනෝ කර්මද ආරක්ෂා නොකෙරේ. ආරක්ෂා නොකළ කාය කර්ම, ආරක්ෂා නොකළ වචී කර්ම, ආරක්ෂා නොකළ මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද ආශ්‍රව සහිත වේ. වචී කර්මද ආශ්‍රව සහිත වේ. මනෝ කර්මද ආශ්‍රව සහිත වේ. ආශ්‍රව සහිත කාය කර්ම, ආශ්‍රව සහිත වචී කර්ම, ආශ්‍රව සහිත මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද දූෂිත වේ. වචී කර්මද දූෂිත වේ. මනෝ කර්මද දූෂිත වේ. දූෂිත කාය කර්ම, දූෂිත වචී කර්ම, දූෂිත මනෝ කර්ම ඇති ඒ තැනැත්තාට යහපත් මරණයක් හෝ යහපත් කලුරිය කිරීමක් සිදු නොවේ.\n\nගෘහපතිය, යම්සේනම්, දුර්වල ලෙස වහල සෙවිලි කළ මාලිගාවක, මුදුන් යට ලීද ආරක්ෂා රහිත වේ. පරාලද ආරක්ෂා රහිත වේ. බිත්තිද ආරක්ෂා රහිත වේ. මුදුන් යට ලීද ජලයෙන් තෙමේ. පරාලද ජලයෙන් තෙමේ. බිත්තිද ජලයෙන් තෙමේ. මුදුන් යට ලීද දිරාපත් වේ. පරාලද දිරාපත් වේ. බිත්තිද දිරාපත් වේ.\n\nගෘහපතිය, එපරිද්දෙන්ම, සිත ආරක්ෂා නොකළ කල්හි, කාය කර්මද ආරක්ෂා නොකෙරේ. වචී කර්මද ආරක්ෂා නොකෙරේ. මනෝ කර්මද ආරක්ෂා නොකෙරේ. ආරක්ෂා නොකළ කාය කර්ම, ආරක්ෂා නොකළ වචී කර්ම, ආරක්ෂා නොකළ මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද ආශ්‍රව සහිත වේ. වචී කර්මද ආශ්‍රව සහිත වේ. මනෝ කර්මද ආශ්‍රව සහිත වේ. ආශ්‍රව සහිත කාය කර්ම, ආශ්‍රව සහිත වචී කර්ම, ආශ්‍රව සහිත මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද දූෂිත වේ. වචී කර්මද දූෂිත වේ. මනෝ කර්මද දූෂිත වේ. දූෂිත කාය කර්ම, දූෂිත වචී කර්ම, දූෂිත මනෝ කර්ම ඇති ඒ තැනැත්තාට යහපත් මරණයක් හෝ යහපත් කලුරිය කිරීමක් සිදු නොවේ.\n\nගෘහපතිය, සිත ආරක්ෂා කළ කල්හි, කාය කර්මද ආරක්ෂා කෙරේ. වචී කර්මද ආරක්ෂා කෙරේ. මනෝ කර්මද ආරක්ෂා කෙරේ. ආරක්ෂා කළ කාය කර්ම, ආරක්ෂා කළ වචී කර්ම, ආරක්ෂා කළ මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද ආශ්‍රව රහිත වේ. වචී කර්මද ආශ්‍රව රහිත වේ. මනෝ කර්මද ආශ්‍රව රහිත වේ. ආශ්‍රව රහිත කාය කර්ම, ආශ්‍රව රහිත වචී කර්ම, ආශ්‍රව රහිත මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද නොදූෂිත වේ. වචී කර්මද නොදූෂිත වේ. මනෝ කර්මද නොදූෂිත වේ. නොදූෂිත කාය කර්ම, නොදූෂිත වචී කර්ම, නොදූෂිත මනෝ කර්ම ඇති ඒ තැනැත්තාට යහපත් මරණයක් හෝ යහපත් කලුරිය කිරීමක් සිදු වේ.\n\nගෘහපතිය, යම්සේනම්, මනා ලෙස වහල සෙවිලි කළ මාලිගාවක, මුදුන් යට ලීද ආරක්ෂිත වේ. පරාලද ආරක්ෂිත වේ. බිත්තිද ආරක්ෂිත වේ. මුදුන් යට ලීද ජලයෙන් නොතෙමේ. පරාලද ජලයෙන් නොතෙමේ. බිත්තිද ජලයෙන් නොතෙමේ. මුදුන් යට ලීද නොදිරාපත් වේ. පරාලද නොදිරාපත් වේ. බිත්තිද නොදිරාපත් වේ. ගෘහපතිය, එපරිද්දෙන්ම, සිත ආරක්ෂා කළ කල්හි, කාය කර්මද ආරක්ෂා කෙරේ. වචී කර්මද ආරක්ෂා කෙරේ. මනෝ කර්මද ආරක්ෂා කෙරේ. ආරක්ෂා කළ කාය කර්ම, ආරක්ෂා කළ වචී කර්ම, ආරක්ෂා කළ මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද ආශ්‍රව රහිත වේ. වචී කර්මද ආශ්‍රව රහිත වේ. මනෝ කර්මද ආශ්‍රව රහිත වේ. ආශ්‍රව රහිත කාය කර්ම, ආශ්‍රව රහිත වචී කර්ම, ආශ්‍රව රහිත මනෝ කර්ම ඇති ඒ තැනැත්තාගේ කාය කර්මද නොදූෂිත වේ. වචී කර්මද නොදූෂිත වේ. මනෝ කර්මද නොදූෂිත වේ. නොදූෂිත කාය කර්ම, නොදූෂිත වචී කර්ම, නොදූෂිත මනෝ කර්ම ඇති ඒ තැනැත්තාට යහපත් මරණයක් හෝ යහපත් කලුරිය කිරීමක් සිදු වේ.\"",
      "paliTitle": "Arakkhitasuttaṃ"
    },
    {
      "number": 111,
      "pali": "Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘citte, gahapati, byāpanne kāyakammampi byāpannaṃ hoti, vacīkammampi byāpannaṃ hoti, manokammampi byāpannaṃ hoti. Tassa byāpannakāyakammantassa byāpannavacīkammantassa byāpannamanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā. Seyyathāpi, gahapati, kūṭāgāre ducchanne kūṭampi byāpannaṃ hoti, gopānasiyopi byāpannā honti, bhittipi byāpannā hoti; evamevaṃ kho, gahapati, citte byāpanne kāyakammampi byāpannaṃ hoti, vacīkammampi byāpannaṃ hoti, manokammampi byāpannaṃ hoti. Tassa byāpannakāyakammantassa byāpannavacīkammantassa byāpannamanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā. ‘‘Citte, gahapati, abyāpanne kāyakammampi abyāpannaṃ hoti, vacīkammampi abyāpannaṃ hoti, manokammampi abyāpannaṃ hoti. Tassa abyāpannakāyakammantassa abyāpannavacīkammantassa abyāpannamanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā. Seyyathāpi, gahapati, kūṭāgāre succhanne kūṭampi abyāpannaṃ hoti, gopānasiyopi abyāpannā honti, bhittipi abyāpannā hoti; evamevaṃ kho, gahapati, citte abyāpanne kāyakammampi abyāpannaṃ hoti, vacīkammampi abyāpannaṃ hoti, manokammampi abyāpannaṃ hoti. Tassa abyāpannakāyakammantassa…pe… abyāpannamanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā’’ti. Aṭṭhamaṃ.",
      "english": "The Blessed One said this to Anāthapiṇḍika the householder, who was sitting to one side: \"Householder, when the mind is corrupted, bodily action becomes corrupted, verbal action becomes corrupted, and mental action becomes corrupted. For one whose bodily action is corrupted, whose verbal action is corrupted, and whose mental action is corrupted, their demise is not fortunate, nor is their passing propitious. Just as, householder, in a badly thatched house, the ridgepole becomes damaged, the rafters become damaged, and the walls become damaged; in the same way, householder, when the mind is corrupted, bodily action becomes corrupted, verbal action becomes corrupted, and mental action becomes corrupted. For one whose bodily action is corrupted, whose verbal action is corrupted, and whose mental action is corrupted, their demise is not fortunate, nor is their passing propitious.\"\n\n\"Householder, when the mind is uncorrupted, bodily action becomes uncorrupted, verbal action becomes uncorrupted, and mental action becomes uncorrupted. For one whose bodily action is uncorrupted, whose verbal action is uncorrupted, and whose mental action is uncorrupted, their demise is fortunate, and their passing is propitious.\"\n\n\"Just as, householder, in a well-thatched house, the ridgepole is undamaged, the rafters are undamaged, and the walls are undamaged; in the same way, householder, when the mind is uncorrupted, bodily action becomes uncorrupted, verbal action becomes uncorrupted, and mental action becomes uncorrupted. For one whose bodily action is uncorrupted, whose verbal action is uncorrupted, and whose mental action is uncorrupted, their demise is fortunate, and their passing is propitious.\"",
      "sinhala": "එකත්පසෙක වාඩි වී සිටි අනාථපිණ්ඩික ගෘහපතියාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ගෘහපතිය, සිත දූෂිත වූ විට, කායකර්මයද දූෂිත වේ, වචීකර්මයද දූෂිත වේ, මනෝකර්මයද දූෂිත වේ. දූෂිත කායකර්ම ඇති, දූෂිත වචීකර්ම ඇති, දූෂිත මනෝකර්ම ඇති ඔහුට යහපත් මරණයක් නොවේ, යහපත් කාලක්‍රියාවක්ද නොවේ. ගෘහපතිය, යම්සේ දුර්වල වහලක් සහිත මාලිගාවක මුදුනද හානි වී තිබේද, උල්පත්ද හානි වී තිබේද, බිත්තිද හානි වී තිබේද; එසේම ගෘහපතිය, සිත දූෂිත වූ විට, කායකර්මයද දූෂිත වේ, වචීකර්මයද දූෂිත වේ, මනෝකර්මයද දූෂිත වේ. දූෂිත කායකර්ම ඇති, දූෂිත වචීකර්ම ඇති, දූෂිත මනෝකර්ම ඇති ඔහුට යහපත් මරණයක් නොවේ, යහපත් කාලක්‍රියාවක්ද නොවේ.”\n\n“ගෘහපතිය, සිත නොදූෂිත වූ විට, කායකර්මයද නොදූෂිත වේ, වචීකර්මයද නොදූෂිත වේ, මනෝකර්මයද නොදූෂිත වේ. නොදූෂිත කායකර්ම ඇති, නොදූෂිත වචීකර්ම ඇති, නොදූෂිත මනෝකර්ම ඇති ඔහුට යහපත් මරණයක් වේ, යහපත් කාලක්‍රියාවක්ද වේ. ගෘහපතිය, යම්සේ හොඳින් වහලක් සහිත මාලිගාවක මුදුනද නොහානි වී තිබේද, උල්පත්ද නොහානි වී තිබේද, බිත්තිද නොහානි වී තිබේද; එසේම ගෘහපතිය, සිත නොදූෂිත වූ විට, කායකර්මයද නොදූෂිත වේ, වචීකර්මයද නොදූෂිත වේ, මනෝකර්මයද නොදූෂිත වේ. නොදූෂිත කායකර්ම ඇති, නොදූෂිත වචීකර්ම ඇති, නොදූෂිත මනෝකර්ම ඇති ඔහුට යහපත් මරණයක් වේ, යහපත් කාලක්‍රියාවක්ද වේ.”",
      "paliTitle": "Byāpannasuttaṃ"
    },
    {
      "number": 112,
      "pali": "‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Lobho nidānaṃ kammānaṃ samudayāya, doso nidānaṃ kammānaṃ samudayāya, moho nidānaṃ kammānaṃ samudayāya. Yaṃ, bhikkhave, lobhapakataṃ kammaṃ lobhajaṃ lobhanidānaṃ lobhasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Yaṃ, bhikkhave, dosapakataṃ kammaṃ dosajaṃ dosanidānaṃ dosasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Yaṃ, bhikkhave, mohapakataṃ kammaṃ mohajaṃ mohanidānaṃ mohasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya. ‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Alobho nidānaṃ kammānaṃ samudayāya, adoso nidānaṃ kammānaṃ samudayāya, amoho nidānaṃ kammānaṃ samudayāya. Yaṃ, bhikkhave, alobhapakataṃ kammaṃ alobhajaṃ alobhanidānaṃ alobhasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Yaṃ, bhikkhave, adosapakataṃ kammaṃ adosajaṃ adosanidānaṃ adosasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Yaṃ, bhikkhave, amohapakataṃ kammaṃ amohajaṃ amohanidānaṃ amohasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. Navamaṃ.",
      "english": "Monks, these three are the roots for the origination of kamma. Which three? Greed is a root for the origination of kamma, hatred is a root for the origination of kamma, and delusion is a root for the origination of kamma. Monks, any kamma performed out of greed, born of greed, rooted in greed, and originated from greed, that kamma is unwholesome, that kamma is blameworthy, that kamma has a painful result, and that kamma conduces to the origination of further kamma, not to the cessation of kamma. Monks, any kamma performed out of hatred, born of hatred, rooted in hatred, and originated from hatred, that kamma is unwholesome, that kamma is blameworthy, that kamma has a painful result, and that kamma conduces to the origination of further kamma, not to the cessation of kamma. Monks, any kamma performed out of delusion, born of delusion, rooted in delusion, and originated from delusion, that kamma is unwholesome, that kamma is blameworthy, that kamma has a painful result, and that kamma conduces to the origination of further kamma, not to the cessation of kamma. These, monks, are the three roots for the origination of kamma.\n\nMonks, these three are the roots for the origination of kamma. Which three? Non-greed is a root for the origination of kamma, non-hatred is a root for the origination of kamma, and non-delusion is a root for the origination of kamma. Monks, any kamma performed out of non-greed, born of non-greed, rooted in non-greed, and originated from non-greed, that kamma is wholesome, that kamma is blameless, that kamma has a pleasant result, and that kamma conduces to the cessation of kamma, not to the origination of further kamma. Monks, any kamma performed out of non-hatred, born of non-hatred, rooted in non-hatred, and originated from non-hatred, that kamma is wholesome, that kamma is blameless, that kamma has a pleasant result, and that kamma conduces to the cessation of kamma, not to the origination of further kamma. Monks, any kamma performed out of non-delusion, born of non-delusion, rooted in non-delusion, and originated from non-delusion, that kamma is wholesome, that kamma is blameless, that kamma has a pleasant result, and that kamma conduces to the cessation of kamma, not to the origination of further kamma. These, monks, are the three roots for the origination of kamma.",
      "sinhala": "මහණෙනි, කර්මයන් හටගැනීමට මේ මූල හේතු තුනක් පවතී. කවර ඒවා තුනක්ද? ලෝභය කර්මයන් හටගැනීමට මූල හේතුවකි, ද්වේෂය කර්මයන් හටගැනීමට මූල හේතුවකි, මෝහය කර්මයන් හටගැනීමට මූල හේතුවකි. මහණෙනි, යම් කර්මයක් ලෝභයෙන් කරන ලද්දක්ද, ලෝභයෙන් උපන්නක්ද, ලෝභය මූල හේතු කොට ඇත්තක්ද, ලෝභයෙන් හටගත්තක්ද, ඒ කර්මය අකුසලයකි, දෝෂ සහිතය, දුක් විපාක ඇති (කර්මයකි). ඒ කර්මය කර්ම සම්භවයට හේතු වේ, ඒ කර්මය කර්ම නිරෝධයට හේතු නොවේ. මහණෙනි, යම් කර්මයක් ද්වේෂයෙන් කරන ලද්දක්ද, ද්වේෂයෙන් උපන්නක්ද, ද්වේෂය මූල හේතු කොට ඇත්තක්ද, ද්වේෂයෙන් හටගත්තක්ද, ඒ කර්මය අකුසලයකි, දෝෂ සහිතය, දුක් විපාක ඇති (කර්මයකි). ඒ කර්මය කර්ම සම්භවයට හේතු වේ, ඒ කර්මය කර්ම නිරෝධයට හේතු නොවේ. මහණෙනි, යම් කර්මයක් මෝහයෙන් කරන ලද්දක්ද, මෝහයෙන් උපන්නක්ද, මෝහය මූල හේතු කොට ඇත්තක්ද, මෝහයෙන් හටගත්තක්ද, ඒ කර්මය අකුසලයකි, දෝෂ සහිතය, දුක් විපාක ඇති (කර්මයකි). ඒ කර්මය කර්ම සම්භවයට හේතු වේ, ඒ කර්මය කර්ම නිරෝධයට හේතු නොවේ. මහණෙනි, කර්මයන් හටගැනීමට මේ මූල හේතු තුන පවතී.\n\nමහණෙනි, කර්මයන් හටගැනීමට මේ මූල හේතු තුනක් පවතී. කවර ඒවා තුනක්ද? අලෝභය කර්මයන් හටගැනීමට මූල හේතුවකි, අද්වේෂය කර්මයන් හටගැනීමට මූල හේතුවකි, අමෝහය කර්මයන් හටගැනීමට මූල හේතුවකි. මහණෙනි, යම් කර්මයක් අලෝභයෙන් කරන ලද්දක්ද, අලෝභයෙන් උපන්නක්ද, අලෝභය මූල හේතු කොට ඇත්තක්ද, අලෝභයෙන් හටගත්තක්ද, ඒ කර්මය කුසලයකි, දෝෂ රහිතය, සැප විපාක ඇති (කර්මයකි). ඒ කර්මය කර්ම නිරෝධයට හේතු වේ, ඒ කර්මය කර්ම සම්භවයට හේතු නොවේ. මහණෙනි, යම් කර්මයක් අද්වේෂයෙන් කරන ලද්දක්ද, අද්වේෂයෙන් උපන්නක්ද, අද්වේෂය මූල හේතු කොට ඇත්තක්ද, අද්වේෂයෙන් හටගත්තක්ද, ඒ කර්මය කුසලයකි, දෝෂ රහිතය, සැප විපාක ඇති (කර්මයකි). ඒ කර්මය කර්ම නිරෝධයට හේතු වේ, ඒ කර්මය කර්ම සම්භවයට හේතු නොවේ. මහණෙනි, යම් කර්මයක් අමෝහයෙන් කරන ලද්දක්ද, අමෝහයෙන් උපන්නක්ද, අමෝහය මූල හේතු කොට ඇත්තක්ද, අමෝහයෙන් හටගත්තක්ද, ඒ කර්මය කුසලයකි, දෝෂ රහිතය, සැප විපාක ඇති (කර්මයකි). ඒ කර්මය කර්ම නිරෝධයට හේතු වේ, ඒ කර්මය කර්ම සම්භවයට හේතු නොවේ. මහණෙනි, කර්මයන් හටගැනීමට මේ මූල හේතු තුන පවතී.",
      "paliTitle": "Paṭhamanidānasuttaṃ"
    },
    {
      "number": 113,
      "pali": "‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. Kathañca, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa atīte chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. ‘‘Kathañca, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa anāgate chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. ‘‘Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa paccuppanne chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya. ‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; anāgate bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. Kathañca, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Atītānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti. Āyatiṃ vipākaṃ viditvā tadabhinivatteti. Tadabhinivattetvā [tadabhinivajjeti, tadabhinivajjetvā (sī. syā. kaṃ.)] cetasā abhinivijjhitvā [abhivirājetvā (sī. syā. kaṃ. pī.)] paññāya ativijjha [abhinivijjha (ka.)] passati. Evaṃ kho, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. ‘‘Kathañca, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Anāgatānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti. Āyatiṃ vipākaṃ viditvā tadabhinivatteti. Tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṃ kho, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. ‘‘Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Paccuppannānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti, āyatiṃ vipākaṃ viditvā tadabhinivatteti, tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṃ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. Dasamaṃ. ",
      "english": "Bhikkhus, there are these three causes for the arising of kamma. Which three? Bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the past, desire arises; bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the future, desire arises; bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the present, desire arises.\n\nAnd how, bhikkhus, does desire arise with regard to phenomena that are grounds for desire-and-passion in the past? Bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the past, one mentally reflects upon and examines them. As one mentally reflects upon and examines those past phenomena that are grounds for desire-and-passion, desire arises. Having arisen desire, one becomes bound by those phenomena. This, bhikkhus, is what I call a fetter: the mental attachment. In this way, bhikkhus, desire arises with regard to phenomena that are grounds for desire-and-passion in the past.\n\nAnd how, bhikkhus, does desire arise with regard to phenomena that are grounds for desire-and-passion in the future? Bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the future, one mentally reflects upon and examines them. As one mentally reflects upon and examines those future phenomena that are grounds for desire-and-passion, desire arises. Having arisen desire, one becomes bound by those phenomena. This, bhikkhus, is what I call a fetter: the mental attachment. In this way, bhikkhus, desire arises with regard to phenomena that are grounds for desire-and-passion in the future.\n\nAnd how, bhikkhus, does desire arise with regard to phenomena that are grounds for desire-and-passion in the present? Bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the present, one mentally reflects upon and examines them. As one mentally reflects upon and examines those present phenomena that are grounds for desire-and-passion, desire arises. Having arisen desire, one becomes bound by those phenomena. This, bhikkhus, is what I call a fetter: the mental attachment. In this way, bhikkhus, desire arises with regard to phenomena that are grounds for desire-and-passion in the present. These, bhikkhus, are the three causes for the arising of kamma.\n\nBhikkhus, there are these three causes for the cessation of kamma. Which three? Bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the past, desire does not arise; bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the future, desire does not arise; bhikkhus, with regard to phenomena that are grounds for desire-and-passion in the present, desire does not arise.\n\nAnd how, bhikkhus, does desire not arise with regard to phenomena that are grounds for desire-and-passion in the past? Bhikkhus, one understands the future consequence of those past phenomena that are grounds for desire-and-passion. Having understood the future consequence, one turns away from them. Having turned away from them, one mentally penetrates them and sees them with wisdom. In this way, bhikkhus, desire does not arise with regard to phenomena that are grounds for desire-and-passion in the past.\n\nAnd how, bhikkhus, does desire not arise with regard to phenomena that are grounds for desire-and-passion in the future? Bhikkhus, one understands the future consequence of those future phenomena that are grounds for desire-and-passion. Having understood the future consequence, one turns away from them. Having turned away from them, one mentally penetrates them and sees them with wisdom. In this way, bhikkhus, desire does not arise with regard to phenomena that are grounds for desire-and-passion in the future.\n\nAnd how, bhikkhus, does desire not arise with regard to phenomena that are grounds for desire-and-passion in the present? Bhikkhus, one understands the future consequence of those present phenomena that are grounds for desire-and-passion. Having understood the future consequence, one turns away from them. Having turned away from them, one mentally penetrates them and sees them with wisdom. In this way, bhikkhus, desire does not arise with regard to phenomena that are grounds for desire-and-passion in the present. These, bhikkhus, are the three causes for the cessation of kamma.",
      "sinhala": "භික්‍ෂූණි, කර්මයන් ඇතිවීමට මේ හේතු තුනක් ඇත. ඒ තුන කවරේද? භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදී; භික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදී; භික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදී. භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ කෙසේද? භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා සිතින් නැවත නැවත කල්පනා කරයි, නැවත නැවත විමසා බලයි. ඔහුට අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා සිතින් නැවත නැවත කල්පනා කරන විට, නැවත නැවත විමසා බලන විට ඡන්දය උපදී. ඡන්දය උපන් හෙයින් ඔහු ඒ ස්වභාවයන් හා බැඳී සිටියි. භික්‍ෂූණි, සිතේ ඇතිවන ඒ ඇලීම සංයෝජනයක් යැයි මම කියමි. භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ මෙසේය.\n\nභික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ කෙසේද? භික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා සිතින් නැවත නැවත කල්පනා කරයි, නැවත නැවත විමසා බලයි. ඔහුට අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා සිතින් නැවත නැවත කල්පනා කරන විට, නැවත නැවත විමසා බලන විට ඡන්දය උපදී. ඡන්දය උපන් හෙයින් ඔහු ඒ ස්වභාවයන් හා බැඳී සිටියි. භික්‍ෂූණි, සිතේ ඇතිවන ඒ ඇලීම සංයෝජනයක් යැයි මම කියමි. භික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ මෙසේය.\n\nභික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ කෙසේද? භික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා සිතින් නැවත නැවත කල්පනා කරයි, නැවත නැවත විමසා බලයි. ඔහුට වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා සිතින් නැවත නැවත කල්පනා කරන විට, නැවත නැවත විමසා බලන විට ඡන්දය උපදී. ඡන්දය උපන් හෙයින් ඔහු ඒ ස්වභාවයන් හා බැඳී සිටියි. භික්‍ෂූණි, සිතේ ඇතිවන ඒ ඇලීම සංයෝජනයක් යැයි මම කියමි. භික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ මෙසේය. භික්‍ෂූණි, කර්මයන් ඇතිවීමට මේ හේතු තුනක් ඇත.\n\nභික්‍ෂූණි, කර්මයන්ගේ නිරෝධය සඳහා මේ හේතු තුනක් ඇත. ඒ තුන කවරේද? භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ නැත; භික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ නැත; භික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය උපදින්නේ නැත. භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය නොඋපදින්නේ කෙසේද? භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවූ ස්වභාවයන්ගේ අනාගත විපාකය ඔහු දනී. අනාගත විපාකය දැන, එයින් බැහැර වෙයි. එයින් බැහැර වී, සිතින් එය විනිවිද දැක, ප්‍ර‍ඥාවෙන් එය මනාකොට විනිවිද දකියි. භික්‍ෂූණි, අතීතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය නොඋපදින්නේ මෙසේය.\n\nභික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය නොඋපදින්නේ කෙසේද? භික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන්ගේ අනාගත විපාකය ඔහු දනී. අනාගත විපාකය දැන, එයින් බැහැර වෙයි. එයින් බැහැර වී, සිතින් එය විනිවිද දැක, ප්‍ර‍ඥාවෙන් එය මනාකොට විනිවිද දකියි. භික්‍ෂූණි, අනාගතයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය නොඋපදින්නේ මෙසේය.\n\nභික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය නොඋපදින්නේ කෙසේද? භික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන්ගේ අනාගත විපාකය ඔහු දනී, අනාගත විපාකය දැන, එයින් බැහැර වෙයි, එයින් බැහැර වී, සිතින් එය විනිවිද දැක, ප්‍ර‍ඥාවෙන් එය මනාකොට විනිවිද දකියි. භික්‍ෂූණි, වර්තමානයේ ඡන්දරාගය හටගැනීමට හේතුවන ස්වභාවයන් අරබයා ඡන්දය නොඋපදින්නේ මෙසේය. භික්‍ෂූණි, කර්මයන්ගේ නිරෝධය සඳහා මේ හේතු තුනක් ඇත.",
      "paliTitle": "Dutiyanidānasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Sambodhavaggo paṭhamo. Tassuddānaṃ – Pubbeva duve assādā, samaṇo ruṇṇapañcamaṃ; Atitti dve ca vuttāni, nidānāni apare duveti.",
    "english": "",
    "sinhala": ""
  }
}