{
  "id": "an3.8",
  "title": {
    "pali": "Ānandavaggo",
    "english": "The Division concerning Ānanda",
    "sinhala": "ආනන්ද වර්ගය"
  },
  "sections": [
    {
      "number": 72,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho channo paribbājako yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho channo paribbājako āyasmantaṃ ānandaṃ etadavoca – ‘‘tumhepi, āvuso ānanda, rāgassa pahānaṃ paññāpetha, dosassa pahānaṃ paññāpetha, mohassa pahānaṃ paññāpethāti. Mayaṃ kho, āvuso, rāgassa pahānaṃ paññāpema, dosassa pahānaṃ paññāpema, mohassa pahānaṃ paññapemā’’ti. ‘‘Kiṃ pana tumhe, āvuso, rāge ādīnavaṃ disvā rāgassa pahānaṃ paññāpetha, kiṃ dose ādīnavaṃ disvā dosassa pahānaṃ paññāpetha, kiṃ mohe ādīnavaṃ disvā mohassa pahānaṃ paññāpethā’’ti? ‘‘Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti; rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati; rāge pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti; rāge pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Rāgo kho, āvuso, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko. ‘‘Duṭṭho kho, āvuso, dosena…pe… mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti; mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati; mohe pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti; mohe pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Moho kho, āvuso, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko. Idaṃ kho mayaṃ, āvuso, rāge ādīnavaṃ disvā rāgassa pahānaṃ paññāpema. Idaṃ dose ādīnavaṃ disvā dosassa pahānaṃ paññāpema. Idaṃ mohe ādīnavaṃ disvā mohassa pahānaṃ paññāpemā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti? ‘‘Atthāvuso, maggo atthi paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti? ‘‘Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti. ‘‘Bhaddako kho, āvuso, maggo bhaddikā paṭipadā etassa rāgassa dosassa mohassa pahānāya. Alañca panāvuso ānanda, appamādāyā’’ti. Paṭhamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, the monastery of Anāthapiṇḍika. Then the wandering ascetic Channa approached the Venerable Ānanda. Having approached, he exchanged friendly and courteous greetings with the Venerable Ānanda. When this exchange of polite conversation was concluded, he sat down to one side.\n\nSeated to one side, the wandering ascetic Channa addressed the Venerable Ānanda thus: \"Friend Ānanda, you too teach the abandoning of lust, the abandoning of hatred, and the abandoning of delusion, don't you?\" \"Indeed, friend, we teach the abandoning of lust, we teach the abandoning of hatred, and we teach the abandoning of delusion.\" \"But friend, seeing what danger in lust do you teach the abandoning of lust? Seeing what danger in hatred do you teach the abandoning of hatred? Seeing what danger in delusion do you teach the abandoning of delusion?\"\n\n\"Friend, one who is struck by lust, overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, and intends harm to both; and experiences mental suffering and dejection. When lust is abandoned, one neither intends harm to oneself, nor intends harm to others, nor intends harm to both, nor experiences mental suffering and dejection. Furthermore, friend, one who is struck by lust, overwhelmed and obsessed in mind, performs misconduct by body, performs misconduct by speech, and performs misconduct by mind. When lust is abandoned, one performs no misconduct by body, no misconduct by speech, and no misconduct by mind. Furthermore, friend, one who is struck by lust, overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When lust is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. Lust, friend, is blinding, non-seeing, knowledge-destroying, obstructive to wisdom, conducive to vexation, and not conducive to Nibbāna. [The same applies to hatred.] Furthermore, friend, one who is deluded by delusion, overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, and intends harm to both; and experiences mental suffering and dejection. When delusion is abandoned, one neither intends harm to oneself, nor intends harm to others, nor intends harm to both, nor experiences mental suffering and dejection. Furthermore, friend, one who is deluded by delusion, overwhelmed and obsessed in mind, performs misconduct by body, performs misconduct by speech, and performs misconduct by mind. When delusion is abandoned, one performs no misconduct by body, no misconduct by speech, and no misconduct by mind. Furthermore, friend, one who is deluded by delusion, overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When delusion is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. Delusion, friend, is blinding, non-seeing, knowledge-destroying, obstructive to wisdom, conducive to vexation, and not conducive to Nibbāna. It is this danger that we see in lust, friend, that causes us to teach the abandoning of lust. It is this danger that we see in hatred that causes us to teach the abandoning of hatred. It is this danger that we see in delusion that causes us to teach the abandoning of delusion.\"\n\n\"But friend, is there a path, is there a way of practice for the abandoning of this lust, hatred, and delusion?\" \"There is a path, friend, there is a way of practice for the abandoning of this lust, hatred, and delusion.\" \"But what, friend, is that path? What is that way of practice for the abandoning of this lust, hatred, and delusion?\"\n\n\"It is this Noble Eightfold Path: namely, Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, and Right Concentration. This, friend, is the path, this is the way of practice for the abandoning of this lust, hatred, and delusion.\" \"Excellent is this path, friend, excellent is this way of practice for the abandoning of this lust, hatred, and delusion. And sufficient is the Venerable Ānanda's teaching for those who are heedful.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශ්‍රාවස්තියෙහි අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඑකල්හි ඡන්න පරිබ්‍රාජකයාණෝ ආයුෂ්මත් ආනන්දයන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, ආයුෂ්මත් ආනන්දයන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු සිහි කටයුතු කථා බහ නිමවා එකත්පස්ව වාඩි වූහ. එකත්පස්ව හුන් ඡන්න පරිබ්‍රාජකයාණෝ ආයුෂ්මත් ආනන්දයන් වහන්සේට මෙය පැවසූහ: ‘‘ඇවැත් ආනන්දයෙනි, ඔබ වහන්සේලාද රාගය ප්‍රහාණය කිරීම, ද්වේෂය ප්‍රහාණය කිරීම, මෝහය ප්‍රහාණය කිරීම ප්‍රකාශ කරති, නොවේද?’’ ‘‘ඇවැත, අපි රාගය ප්‍රහාණය කිරීම, ද්වේෂය ප්‍රහාණය කිරීම, මෝහය ප්‍රහාණය කිරීම ප්‍රකාශ කරමු.’’ ‘‘එසේ නම්, ඇවැත, ඔබ වහන්සේලා රාගයෙහි කුමන ආදීනවයක් දැක රාගය ප්‍රහාණය කිරීම ප්‍රකාශ කරත්ද? ද්වේෂයෙහි කුමන ආදීනවයක් දැක ද්වේෂය ප්‍රහාණය කිරීම ප්‍රකාශ කරත්ද? මෝහයෙහි කුමන ආදීනවයක් දැක මෝහය ප්‍රහාණය කිරීම ප්‍රකාශ කරත්ද?’’\n\n‘‘ඇවැත, රාගයෙන් ඇලුණේ, රාගයෙන් යටපත් වූයේ, සිත් තැවුල් ලැබූයේ තමා පෙළීම පිණිසද සිතයි, අනුන් පෙළීම පිණිසද සිතයි, දෙදෙනාම පෙළීම පිණිසද සිතයි, චෛතසික දුකක් හා දොම්නසක්ද විඳියි. රාගය ප්‍රහීණ වූ විට තමා පෙළීම පිණිස නොසිතයි, අනුන් පෙළීම පිණිස නොසිතයි, දෙදෙනාම පෙළීම පිණිසද නොසිතයි, චෛතසික දුකක් හා දොම්නසක්ද නොවිඳියි. ඇවැත, රාගයෙන් ඇලුණේ, රාගයෙන් යටපත් වූයේ, සිත් තැවුල් ලැබූයේ කයින් දුශ්චරිතයෙහි හැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙයි, මනසින් දුශ්චරිතයෙහි හැසිරෙයි. රාගය ප්‍රහීණ වූ විට කයින් දුශ්චරිතයෙහි නොහැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි නොහැසිරෙයි, මනසින් දුශ්චරිතයෙහි නොහැසිරෙයි. ඇවැත, රාගයෙන් ඇලුණේ, රාගයෙන් යටපත් වූයේ, සිත් තැවුල් ලැබූයේ තමාගේ යහපතද ඇති සැටියෙන් නොදන්නේය, අනුන්ගේ යහපතද ඇති සැටියෙන් නොදන්නේය, දෙදෙනාගේම යහපතද ඇති සැටියෙන් නොදන්නේය. රාගය ප්‍රහීණ වූ විට තමාගේ යහපතද ඇති සැටියෙන් දන්නේය, අනුන්ගේ යහපතද ඇති සැටියෙන් දන්නේය, දෙදෙනාගේම යහපතද ඇති සැටියෙන් දන්නේය. ඇවැත, රාගය අන්ධභාවය ඇති කරන්නේය, ඇස් නැති කරන්නේය, අවිද්‍යාව ඇති කරන්නේය, ප්‍රඥාව නිරුද්ධ කරන්නේය, විනාශයට පක්ෂපාතී වන්නේය, නිවනට නොපැමිණෙන්නේය.\n\n‘‘ඇවැත, ද්වේෂයෙන් දූෂ්‍ය වූයේ... (පෙ)... ඇවැත, මෝහයෙන් මුළා වූයේ, මෝහයෙන් යටපත් වූයේ, සිත් තැවුල් ලැබූයේ තමා පෙළීම පිණිසද සිතයි, අනුන් පෙළීම පිණිසද සිතයි, දෙදෙනාම පෙළීම පිණිසද සිතයි, චෛතසික දුකක් හා දොම්නසක්ද විඳියි. මෝහය ප්‍රහීණ වූ විට තමා පෙළීම පිණිස නොසිතයි, අනුන් පෙළීම පිණිස නොසිතයි, දෙදෙනාම පෙළීම පිණිසද නොසිතයි, චෛතසික දුකක් හා දොම්නසක්ද නොවිඳියි. ඇවැත, මෝහයෙන් මුළා වූයේ, මෝහයෙන් යටපත් වූයේ, සිත් තැවුල් ලැබූයේ කයින් දුශ්චරිතයෙහි හැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙයි, මනසින් දුශ්චරිතයෙහි හැසිරෙයි. මෝහය ප්‍රහීණ වූ විට කයින් දුශ්චරිතයෙහි නොහැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි නොහැසිරෙයි, මනසින් දුශ්චරිතයෙහි නොහැසිරෙයි. ඇවැත, මෝහයෙන් මුළා වූයේ, මෝහයෙන් යටපත් වූයේ, සිත් තැවුල් ලැබූයේ තමාගේ යහපතද ඇති සැටියෙන් නොදන්නේය, අනුන්ගේ යහපතද ඇති සැටියෙන් නොදන්නේය, දෙදෙනාගේම යහපතද ඇති සැටියෙන් නොදන්නේය. මෝහය ප්‍රහීණ වූ විට තමාගේ යහපතද ඇති සැටියෙන් දන්නේය, අනුන්ගේ යහපතද ඇති සැටියෙන් දන්නේය, දෙදෙනාගේම යහපතද ඇති සැටියෙන් දන්නේය. ඇවැත, මෝහය අන්ධභාවය ඇති කරන්නේය, ඇස් නැති කරන්නේය, අවිද්‍යාව ඇති කරන්නේය, ප්‍රඥාව නිරුද්ධ කරන්නේය, විනාශයට පක්ෂපාතී වන්නේය, නිවනට නොපැමිණෙන්නේය.\n\n‘‘ඇවැත, අපි රාගයෙහි මේ ආදීනවය දැක රාගය ප්‍රහාණය කිරීම ප්‍රකාශ කරන්නෙමු. ද්වේෂයෙහි මේ ආදීනවය දැක ද්වේෂය ප්‍රහාණය කිරීම ප්‍රකාශ කරන්නෙමු. මෝහයෙහි මේ ආදීනවය දැක මෝහය ප්‍රහාණය කිරීම ප්‍රකාශ කරන්නෙමු.’’ ‘‘ඇවැත, එසේ නම් මේ රාගය, ද්වේෂය, මෝහය ප්‍රහාණය කිරීම සඳහා මාර්ගයක් තිබේද, පිළිවෙතක් තිබේද?’’ ‘‘ඇවැත, මේ රාගය, ද්වේෂය, මෝහය ප්‍රහාණය කිරීම සඳහා මාර්ගයක් ඇත, පිළිවෙතක් ඇත.’’ ‘‘ඇවැත, එසේ නම් මේ රාගය, ද්වේෂය, මෝහය ප්‍රහාණය කිරීම සඳහා මාර්ගය කවරේද, පිළිවෙත කවරේද?’’ ‘‘ඒනම් මේ ආර්ය අෂ්ටාංගික මාර්ගයමය, එනම්: සම්මා දිට්ඨිය... (පෙ)... සම්මා සමාධියයි. ඇවැත, මේ රාගය, ද්වේෂය, මෝහය ප්‍රහාණය කිරීම සඳහා මාර්ගය මෙයයි, පිළිවෙත මෙයයි.’’ ‘‘ඇවැත, රාගය, ද්වේෂය, මෝහය ප්‍රහාණය කිරීම සඳහා මාර්ගය යහපත්ය, පිළිවෙත යහපත්ය. ඇවැත් ආනන්දයෙනි, අප්‍රමාදීව සිටීමටද මෙය ප්‍රමාණවත් වන්නේය.’’ පළමුවැන්නයි.",
      "paliTitle": "Channasuttaṃ",
      "englishTitle": "The Discourse to Channa",
      "sinhalaTitle": "ඡන්න සූත්‍රය"
    },
    {
      "number": 73,
      "pali": "Ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho aññataro ājīvakasāvako gahapati yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so ājīvakasāvako gahapati āyasmantaṃ ānandaṃ etadavoca – ‘‘Kesaṃ no, bhante ānanda, dhammo svākkhāto? Ke loke suppaṭipannā? Ke loke sukatā’’ti [sugatāti (sī. syā. kaṃ. pī.)]? ‘‘Tena hi, gahapati, taññevettha paṭipucchissāmi, yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, gahapati, ye rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Ye, bhante, rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto. Evaṃ me ettha hotī’’ti. ‘‘Taṃ kiṃ maññasi, gahapati, ye rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Ye, bhante, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā. Evaṃ me ettha hotī’’ti. ‘‘Taṃ kiṃ maññasi, gahapati, yesaṃ rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, te loke sukatā no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Yesaṃ, bhante, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno…pe… yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, te loke sukatā. Evaṃ me ettha hotī’’ti. ‘‘Iti kho, gahapati, tayāvetaṃ [tayā cetaṃ (sī. pī. ka.)] byākataṃ – ‘ye, bhante, rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto’ti. Tayāvetaṃ byākataṃ – ‘ye, bhante, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā’ti. Tayāvetaṃ byākataṃ – ‘yesaṃ, bhante, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno…pe… yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, te loke sukatā’’’ti. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Na ceva nāma sadhammukkaṃsanā bhavissati, na ca paradhammāpasādanā [na paradhammāpasādanā (sī. pī.), na paradhammavambhanā (ma. ni. 2.236)]. Āyataneva [āyatane ca (ma. ni. 2.236)] dhammadesanā, attho ca vutto, attā ca anupanīto. Tumhe, bhante ānanda, rāgassa pahānāya dhammaṃ desetha, dosassa…pe… mohassa pahanāya dhammaṃ desetha. Tumhākaṃ, bhante ānanda, dhammo svākkhāto. Tumhe, bhante ānanda, rāgassa pahānāya paṭipannā, dosassa…pe… mohassa pahānāya paṭipannā. Tumhe, bhante, loke suppaṭipannā. Tumhākaṃ, bhante ānanda, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, tumhākaṃ doso pahīno…pe… tumhākaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo. Tumhe loke sukatā. ‘‘Abhikkantaṃ, bhante, abhikkantaṃ, bhante! Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ ayyena ānandena anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante ānanda, taṃ bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ ayyo ānando dhāretu, ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dutiyaṃ.",
      "english": "At one time, the Venerable Ānanda was dwelling at Kosambī, in Ghositārāma. Then a certain householder who was a disciple of the Ājīvakas approached the Venerable Ānanda; having approached and paid homage to the Venerable Ānanda, he sat down to one side. Sitting to one side, that householder, a disciple of the Ājīvakas, said this to the Venerable Ānanda: “Whose Dhamma, Venerable Ānanda, is well-proclaimed? Who in the world are rightly practicing? Who in the world are perfected?”\n\n“In that case, householder, I shall question you concerning this, and you should answer as you deem appropriate. What do you think, householder? Those who teach the Dhamma for the abandoning of lust, who teach the Dhamma for the abandoning of hatred, who teach the Dhamma for the abandoning of delusion—is their Dhamma well-proclaimed or not? What is your view on this?”\n\n“Venerable sir, those who teach the Dhamma for the abandoning of lust, who teach the Dhamma for the abandoning of hatred, who teach the Dhamma for the abandoning of delusion—their Dhamma is well-proclaimed. This is my view on this.”\n\n“What do you think, householder? Those who are practicing for the abandoning of lust, who are practicing for the abandoning of hatred, who are practicing for the abandoning of delusion—are they rightly practicing in the world or not? What is your view on this?”\n\n“Venerable sir, those who are practicing for the abandoning of lust, who are practicing for the abandoning of hatred, who are practicing for the abandoning of delusion—they are rightly practicing in the world. This is my view on this.”\n\n“What do you think, householder? Those whose lust has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising; those whose hatred has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising; those whose delusion has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising—are they perfected in the world or not? What is your view on this?”\n\n“Venerable sir, those whose lust has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising; those whose hatred has been abandoned... those whose delusion has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising—they are perfected in the world. This is my view on this.”\n\n“Thus, householder, this has been declared by you: ‘Venerable sir, those who teach the Dhamma for the abandoning of lust, who teach the Dhamma for the abandoning of hatred, who teach the Dhamma for the abandoning of delusion—their Dhamma is well-proclaimed.’ This has been declared by you: ‘Venerable sir, those who are practicing for the abandoning of lust, who are practicing for the abandoning of hatred, who are practicing for the abandoning of delusion—they are rightly practicing in the world.’ And this has been declared by you: ‘Venerable sir, those whose lust has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising; those whose hatred has been abandoned... those whose delusion has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising—they are perfected in the world.’”\n\n“Wonderful, Venerable sir! Amazing, Venerable sir! In this way, there has been no extolling of one’s own doctrine, nor any disparagement of the doctrines of others. There has been instruction purely relating to the path, the meaning has been stated, and the self has not been brought into it. Venerable Ānanda, you teach the Dhamma for the abandoning of lust, hatred, and delusion. Venerable Ānanda, your Dhamma is well-proclaimed. Venerable Ānanda, you are practicing for the abandoning of lust, hatred, and delusion. Venerable sir, you are rightly practicing in the world. Venerable Ānanda, your lust has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising; your hatred has been abandoned... your delusion has been abandoned, cut off at the root, made like a palm-stump, annihilated so that it is incapable of future arising. You are perfected in the world.”\n\n“Excellent, Venerable sir! Excellent, Venerable sir! Just as, Venerable sir, one might set upright what was overturned, or reveal what was hidden, or point out the path to one who was lost, or carry an oil lamp in the darkness so that those with sight might see forms; in the very same way, the Dhamma has been made clear by the Noble Ānanda in various ways. Therefore, Venerable Ānanda, I go for refuge to that Blessed One, the Dhamma, and the community of monastics. Let the Noble Ānanda accept me as a lay follower, having gone for refuge from this day forth until the end of my life.”",
      "sinhala": "එක්තරා සමයෙක ආය ෂ්ම ත් ආනන්ද වහන්සේ කෝසම්බී නුවර ඝෝෂිතාරාමයෙහි වැඩ වාසය කළහ. එසමයෙහි එක්තරා ආජීවක ශ්‍රාවකයෙක් වූ ගෘහපතියෙක් ආය ෂ්ම ත් ආනන්ද වහන්සේ වැඩසිටි තැනට පැමිණියේ ය. පැමිණ, ආය ෂ්ම ත් ආනන්ද වහන්සේට වන්දනා කොට, එකත්පස් ව වාඩි විය.\n\nඑකත්පස් ව වාඩි වූ ඒ ආජීවක ශ්‍රාවක ගෘහපති තෙමේ ආය ෂ්ම ත් ආනන්ද වහන්සේට මෙසේ කී ය: “වහන්ස, ආනන්දයන් වහන්ස, කවර අයගේ ධර්මය ද ස්වාක්ඛාත වන්නේ? ලෝකයෙහි කවර අය ද සුප්‍රතිපන්න වන්නේ? ලෝකයෙහි කවර අය ද සුගත (හොඳින් කෙළවර කළ යුතු කෘත්‍යය ඇති) වන්නේ?”\n\n“එසේ නම්, ගෘහපති, මම ඔබගෙන්ම මේ පිළිබඳ ව යළි ප්‍රශ්න කරන්නෙමි. ඔබට යම්සේ රුචි වේ ද, එසේ එය විස්තර කරන්න. ගෘහපති, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? යම් අය රාගය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, ද්වේෂය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, මෝහය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, ඔවුන්ගේ ධර්මය ස්වාක්ඛාත ද, නොවේ ද? මේ පිළිබඳ ව ඔබට කෙසේ වේ ද?”\n\n“වහන්ස, යම් අය රාගය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, ද්වේෂය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, මෝහය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, ඔවුන්ගේ ධර්මය ස්වාක්ඛාත ය. මේ පිළිබඳ ව මට මෙසේ වේ.”\n\n“ගෘහපති, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? යම් අය රාගය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, ද්වේෂය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, මෝහය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, ඔවුහු ලෝකයෙහි සුප්‍රතිපන්න වෙත් ද, නො වෙත් ද? මේ පිළිබඳ ව ඔබට කෙසේ වේ ද?”\n\n“වහන්ස, යම් අය රාගය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, ද්වේෂය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, මෝහය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, ඔවුහු ලෝකයෙහි සුප්‍රතිපන්න වෙති. මේ පිළිබඳ ව මට මෙසේ වේ.”\n\n“ගෘහපති, ඔබ මේ ගැන කුමක් සිතන්නෙහි ද? යමෙකුගේ රාගය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ද; යමෙකුගේ ද්වේෂය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ද; යමෙකුගේ මෝහය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ද, ඔවුහු ලෝකයෙහි සුගත (යහපත් ගමනක් ඇති) වෙත් ද, නො වෙත් ද? මේ පිළිබඳ ව ඔබට කෙසේ වේ ද?”\n\n“වහන්ස, යමෙකුගේ රාගය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ද; යමෙකුගේ ද්වේෂය ප්‍රහීණ වී ද... (පෙ)... යමෙකුගේ මෝහය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ද, ඔවුහු ලෝකයෙහි සුගත වෙති. මේ පිළිබඳ ව මට මෙසේ වේ.”\n\n“ගෘහපති, එසේ නම්, 'වහන්ස, යම් අය රාගය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, ද්වේෂය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, මෝහය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කෙරෙත් ද, ඔවුන්ගේ ධර්මය ස්වාක්ඛාත ය' යි ඔබ විසින් ම එය විස්තර කරන ලදී. 'වහන්ස, යම් අය රාගය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, ද්වේෂය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, මෝහය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ද, ඔවුහු ලෝකයෙහි සුප්‍රතිපන්න වෙති' යි ඔබ විසින් ම එය විස්තර කරන ලදී. 'වහන්ස, යමෙකුගේ රාගය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ද; යමෙකුගේ ද්වේෂය ප්‍රහීණ වී ද... (පෙ)... යමෙකුගේ මෝහය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ද, ඔවුහු ලෝකයෙහි සුගත වෙති' යි ඔබ විසින් ම එය විස්තර කරන ලදී.”\n\n“වහන්ස, එය ආශ්චර්යයකි, වහන්ස, එය අද්භූතයකි! මෙහි දී තමාගේ ධර්මය වර්ණනා කිරීමක් නොවේ; අන්‍යයන්ගේ ධර්මය අවමන් කිරීමක් ද නොවේ. විෂය පථය ගැන පමණක් ම ධර්ම දේශනාව කෙරේ, අර්ථය කියන ලදී, ආත්මය ඉදිරිපත් කරන ලද්දේ ද නොවේ. ආනන්දයන් වහන්ස, ඔබ වහන්සේ රාගය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරන සේක, ද්වේෂය... (පෙ)... මෝහය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරන සේක. ආනන්දයන් වහන්සේගේ ධර්මය ස්වාක්ඛාත ය. ආනන්දයන් වහන්ස, ඔබ වහන්සේ රාගය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ය, ද්වේෂය... (පෙ)... මෝහය ප්‍රහාණය කිරීම පිණිස පිළිපදින්නාහු ය. වහන්ස, ඔබ වහන්සේ ලෝකයෙහි සුප්‍රතිපන්න වන්නාහු ය.”\n\n“ආනන්දයන් වහන්ස, ඔබ වහන්සේගේ රාගය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ය. ඔබ වහන්සේගේ ද්වේෂය ප්‍රහීණ වී ද... (පෙ)... ඔබ වහන්සේගේ මෝහය ප්‍රහීණ වී ද, මුල සිඳලන ලද්දේ ද, තල් රුකක් මුල සිඳ දැමුවා සේ නැවත ඇති නොවන පරිදි කරනු ලැබී ද, ඉදිරියෙහි නූපදින ස්වභාව ඇත්තේ ය. ඔබ වහන්සේ ලෝකයෙහි සුගත වන්නාහු ය.”\n\n“වහන්ස, අතිශයින් ම ශ්‍රේෂ්ඨ ය, වහන්ස, අතිශයින් ම ශ්‍රේෂ්ඨ ය! වහන්ස, යම්සේ යමෙක් යටිකුරු කරන ලද්දක් උඩුකුරු කරන්නේ ද, වසන ලද්දක් විවෘත කරන්නේ ද, මුළා වූවකුට මඟ කියන්නේ ද, ඇස් ඇත්තෝ රූප දකිත්වා යි අන්ධකාරයේ තෙල් පහනක් දරන්නේ ද; එසේ ම ආනන්ද ස්ථවිරයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. එහෙයින් වහන්ස, ආනන්දයන් වහන්ස, මම ඒ භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, භික්ෂුසංඝයා ද සරණ යමි. ආනන්ද ස්ථවිරයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!”\n\nදෙවෙනි වරට ය.",
      "paliTitle": "Ājīvakasuttaṃ",
      "englishTitle": "Ājīvaka Sutta",
      "sinhalaTitle": "ආජීවක සූත්‍රය"
    },
    {
      "number": 74,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Tena kho pana samayena bhagavā gilānāvuṭṭhito [gilānavuṭṭhito (saddanīti)] hoti aciravuṭṭhito gelaññā. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo sakko bhagavantaṃ etadavoca – ‘‘dīgharattāhaṃ, bhante, bhagavatā evaṃ dhammaṃ desitaṃ ājānāmi – ‘samāhitassa ñāṇaṃ, no asamāhitassā’ti. Samādhi nu kho, bhante, pubbe, pacchā ñāṇaṃ; udāhu ñāṇaṃ pubbe, pacchā samādhī’’ti? Atha kho āyasmato ānandassa etadahosi – ‘‘bhagavā kho gilānavuṭṭhito aciravuṭṭhito gelaññā. Ayañca mahānāmo sakko bhagavantaṃ atigambhīraṃ pañhaṃ pucchati. Yaṃnūnāhaṃ mahānāmaṃ sakkaṃ ekamantaṃ apanetvā dhammaṃ deseyya’’nti. Atha kho āyasmā ānando mahānāmaṃ sakkaṃ bāhāyaṃ gahetvā ekamantaṃ apanetvā mahānāmaṃ sakkaṃ etadavoca – ‘‘sekhampi kho, mahānāma, sīlaṃ vuttaṃ bhagavatā, asekhampi sīlaṃ vuttaṃ bhagavatā; sekhopi samādhi vutto bhagavatā, asekhopi samādhi vutto bhagavatā; sekhāpi paññā vuttā bhagavatā, asekhāpi paññā vuttā bhagavatā. Katamañca, mahānāma, sekhaṃ sīlaṃ? Idha, mahānāma, bhikkhu sīlavā hoti pātimokkhasaṃvarasaṃvuto viharati…pe… samādāya sikkhati sikkhāpadesu. Idaṃ vuccati, mahānāma, sekhaṃ sīlaṃ’’. ‘‘Katamo ca, mahānāma, sekho samādhi? Idha, mahānāma, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, mahānāma, sekho samādhi. ‘‘Katamā ca, mahānāma, sekhā paññā? Idha, mahānāma, bhikkhu idaṃ dukkhanti yathābhūtaṃ pajānāti…pe… ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Ayaṃ vuccati, mahānāma, sekhā paññā. ‘‘Sa kho so, mahānāma, ariyasāvako evaṃ sīlasampanno evaṃ samādhisampanno evaṃ paññāsampanno āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, mahānāma, sekhampi sīlaṃ vuttaṃ bhagavatā, asekhampi sīlaṃ vuttaṃ bhagavatā; sekhopi samādhi vutto bhagavatā, asekhopi samādhi vutto bhagavatā; sekhāpi paññā vuttā bhagavatā, asekhāpi paññā vuttā bhagavatā’’ti. Tatiyaṃ.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling among the Sakyans in Kapilavatthu, at the Nigrodha Park. Now, at that time, the Blessed One had recovered from illness, having only recently arisen from sickness. Then Mahānāma the Sakyan approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, Mahānāma the Sakyan said this to the Blessed One: “Venerable Sir, I have long understood the Dhamma taught by the Blessed One in this way: ‘Knowledge is for one who is concentrated, not for one who is unconcentrated.’ Is concentration, Venerable Sir, prior, and knowledge subsequent; or is knowledge prior, and concentration subsequent?”\n\nThen this thought occurred to the Venerable Ānanda: “The Blessed One has just recovered from illness, having recently arisen from sickness. And this Mahānāma the Sakyan is asking the Blessed One a question that is exceedingly profound. What if I were to lead Mahānāma the Sakyan aside and teach him the Dhamma?”\n\nThen the Venerable Ānanda, taking Mahānāma the Sakyan by the arm, led him aside and said this to Mahānāma the Sakyan: “O Mahānāma, virtue that is subject to training has been declared by the Blessed One, and virtue that is beyond training has been declared by the Blessed One. Concentration that is subject to training has been declared by the Blessed One, and concentration that is beyond training has been declared by the Blessed One. Wisdom that is subject to training has been declared by the Blessed One, and wisdom that is beyond training has been declared by the Blessed One. And what, O Mahānāma, is virtue subject to training? Here, O Mahānāma, a monk is virtuous; he dwells restrained by the restraint of the Pātimokkha… he undertakes the training in the training rules. This, O Mahānāma, is called virtue subject to training. And what, O Mahānāma, is concentration subject to training? Here, O Mahānāma, a monk, quite secluded from sensual pleasures… he enters and dwells in the fourth absorption. This, O Mahānāma, is called concentration subject to training. And what, O Mahānāma, is wisdom subject to training? Here, O Mahānāma, a monk truly understands, ‘This is suffering’… he truly understands, ‘This is the path leading to the cessation of suffering.’ This, O Mahānāma, is called wisdom subject to training. That noble disciple, O Mahānāma, thus endowed with virtue, thus endowed with concentration, and thus endowed with wisdom, through the destruction of the spiritual taints, directly realizing for himself in this very life the taintless liberation of mind and liberation through wisdom, enters and dwells therein. Thus, O Mahānāma, virtue that is subject to training has been declared by the Blessed One, and virtue that is beyond training has been declared by the Blessed One. Concentration that is subject to training has been declared by the Blessed One, and concentration that is beyond training has been declared by the Blessed One. Wisdom that is subject to training has been declared by the Blessed One, and wisdom that is beyond training has been declared by the Blessed One.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ ශාක්‍යයන් අතර කපිලවස්තුවෙහි වූ නිග්‍රෝධාරාමයෙහි වැඩහිඳින සේක. එම වේලෙහි භාග්‍යවතුන් වහන්සේ ගිලන් බවෙන් නැගී සිටියා වූ සේක; ගිලන් බවින් නැගී සිට වැඩි කලක් නොගිය සේක. එවිට මහානාම නම් වූ ශාක්‍යයාණෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩි වූහ.\n\nඑකත්පසෙක වාඩි වී සිටි මහානාම ශාක්‍යයාණෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් 'සමාධිය ඇති තැනැත්තාට ප්‍රඥාව ඇති වේ, සමාධිය නැති තැනැත්තාට ප්‍රඥාව ඇති නොවේ' යැයි මෙසේ ධර්මය දේශනා කළ බව මම බොහෝ කලක පටන් දනිමි. ස්වාමීනි, පළමුව සමාධිය ද, පසුව ප්‍රඥාව ද; එසේත් නැත්නම් පළමුව ප්‍රඥාව ද, පසුව සමාධිය ද?” එවිට ආයුෂ්මත් ආනන්ද වහන්සේට මෙබඳු අදහසක් ඇති විය: “භාග්‍යවතුන් වහන්සේ ගිලන් බවෙන් නැගී සිටි සේක; ගිලන් බවින් නැගී සිට වැඩි කලක් නොගිය සේක. මේ මහානාම ශාක්‍යයාණෝ භාග්‍යවතුන් වහන්සේගෙන් අතිශයින් ගැඹුරු ප්‍රශ්නයක් විමසති. මම මහානාම ශාක්‍යයාණන් එකත්පසකට ඉවත් කොට ධර්මය දේශනා කරන්නේ නම් යෙහෙකි.”\n\nඉක්බිති ආයුෂ්මත් ආනන්ද වහන්සේ මහානාම ශාක්‍යයාණන්ගේ අතින් අල්ලා එකත්පසකට ඉවත් කොට මහානාම ශාක්‍යයාණන්ට මෙය වදාළ සේක: “මහානාම, ශික්ෂා සහිත වූ (සෙඛ) ශීලය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි; ශික්ෂාව සම්පූර්ණ කළ (අසේඛ) ශීලය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි. ශික්ෂා සහිත වූ සමාධිය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි; ශික්ෂාව සම්පූර්ණ කළ සමාධිය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි. ශික්ෂා සහිත වූ ප්‍රඥාව ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි; ශික්ෂාව සම්පූර්ණ කළ ප්‍රඥාව ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි. මහානාම, ශික්ෂා සහිත වූ ශීලය කවරේද? මහානාම, මෙහි භික්ෂුව ශීලවන්ත වී, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වී වාසය කරයි, ශික්ෂා පදයන් සමාදන් වී හික්මෙයි. මහානාම, මෙය ශික්ෂා සහිත වූ ශීලය යැයි කියනු ලැබේ. මහානාම, ශික්ෂා සහිත වූ සමාධිය කවරේද? මහානාම, මෙහි භික්ෂුව කාමයන්ගෙන් වෙන් වී සිවුවන ධ්‍යානයට එළඹ වාසය කරයි. මහානාම, මෙය ශික්ෂා සහිත වූ සමාධිය යැයි කියනු ලැබේ. මහානාම, ශික්ෂා සහිත වූ ප්‍රඥාව කවරේද? මහානාම, මෙහි භික්ෂුව 'මේ දුක යැ'යි යථාභූත වශයෙන් දැන ගනී, 'මේ දුක නැති කිරීමේ මාර්ගය යැ'යි යථාභූත වශයෙන් දැන ගනී. මහානාම, මෙය ශික්ෂා සහිත වූ ප්‍රඥාව යැයි කියනු ලැබේ.\n\nමහානාම, ඒ ආර්යශ්‍රාවකයා මෙසේ ශීල සම්පන්න වූයේ, මෙසේ සමාධි සම්පන්න වූයේ, මෙසේ ප්‍රඥා සම්පන්න වූයේ, ආශ්‍රවයන් ක්ෂය කිරීමෙන්, මේ ආත්මභාවය තුළ දී ම තමන් විසින් ම අවබෝධයෙන් සාක්ෂාත් කොට, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තියට එළඹ වාසය කරයි. මහානාම, මෙසේ ශික්ෂා සහිත වූ ශීලය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි; ශික්ෂාව සම්පූර්ණ කළ ශීලය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි. ශික්ෂා සහිත වූ සමාධිය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි; ශික්ෂාව සම්පූර්ණ කළ සමාධිය ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි. ශික්ෂා සහිත වූ ප්‍රඥාව ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි; ශික්ෂාව සම්පූර්ණ කළ ප්‍රඥාව ද භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලදි.",
      "paliTitle": "Mahānāmasakkasuttaṃ",
      "englishTitle": "To Mahānāma the Sakyan Sutta",
      "sinhalaTitle": "මහානාමසක්ක සූත්‍රය"
    },
    {
      "number": 75,
      "pali": "Ekaṃ samayaṃ āyasmā ānando vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho abhayo ca licchavi paṇḍitakumārako ca licchavi yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho abhayo licchavi āyasmantaṃ ānandaṃ etadavoca – ‘‘nigaṇṭho, bhante, nāṭaputto [nāthaputto (sī. pī.)] sabbaññū sabbadassāvī aparisesaṃ ñāṇadassanaṃ paṭijānāti – ‘carato ca me tiṭṭhato ca suttassa ca jāgarassa ca satataṃ samitaṃ ñāṇadassanaṃ paccupaṭṭhita’nti. So purāṇānaṃ kammānaṃ tapasā byantībhāvaṃ paññapeti navānaṃ kammānaṃ akaraṇā setughātaṃ. Iti kammakkhayā dukkhakkhayo, dukkhakkhayā vedanākkhayo, vedanākkhayā sabbaṃ dukkhaṃ nijjiṇṇaṃ bhavissati – evametissā sandiṭṭhikāya nijjarāya visuddhiyā samatikkamo hoti. Idha, bhante, bhagavā kimāhā’’ti? ‘‘Tisso kho imā, abhaya, nijjarā visuddhiyo tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya. Katamā tisso? Idha, abhaya, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti. ‘‘Sa kho so, abhaya, bhikkhu evaṃ sīlasampanno vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti. ‘‘Sa kho so, abhaya, bhikkhu evaṃ samādhisampanno [evaṃ sīlasampanno evaṃ samādhisampanno (sī. syā. kaṃ.)] āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti. Imā kho, abhaya, tisso nijjarā visuddhiyo tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā’’ti. Evaṃ vutte paṇḍitakumārako licchavi abhayaṃ licchaviṃ etadavoca – ‘‘kiṃ pana tvaṃ, samma abhaya, āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodasī’’ti? ‘‘Kyāhaṃ, samma paṇḍitakumāraka, āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodissāmi! Muddhāpi tassa vipateyya yo āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodeyyā’’ti. Catutthaṃ.",
      "english": "At one time, the Venerable Ānanda was dwelling at Vesālī, in the Great Wood, at the Gabled Hall.\n\nThen Abhaya the Licchavi and Paṇḍitakumāraka the Licchavi approached the Venerable Ānanda. Having approached and paid homage to the Venerable Ānanda, they sat down to one side. Sitting to one side, Abhaya the Licchavi said this to the Venerable Ānanda: \"Bhante, the Nigaṇṭha Nāṭaputta claims to be omniscient, all-seeing, possessing complete knowledge and vision. He proclaims: 'Whether I am walking, standing, sleeping, or awake, knowledge and vision are constantly and continually present to me.' He teaches the wearing away of old actions through austerity, and the cutting off of the stream of future actions through the non-doing of new actions. Thus, by the destruction of action, there is the destruction of suffering; by the destruction of suffering, there is the destruction of feeling; by the destruction of feeling, all suffering will be worn out and exhausted. In this way, there is transcendence by means of this visible purification through wearing away. Bhante, what does the Blessed One say concerning this matter?\"\n\n\"Abhaya, these three purifications through wearing away have been fully proclaimed by the Blessed One—the Knower, the Seer, the Arahant, the Fully Self-Awakened One—for the purification of beings, for the passing beyond sorrow and lamentation, for the cessation of pain and distress, for the attainment of the path, and for the realization of Nibbāna. What are these three?\n\nHere, Abhaya, a monastic is virtuous... he undertakes and trains in the training rules. He does not perform new actions, and he wears away old actions by touching them, thereby exhausting them. This purification through wearing away is visible in this very life, immediately effective, inviting inspection, leading onward, and to be personally experienced by the wise.\n\nThat monk, thus accomplished in virtue, secluded from sensual pleasures and secluded from unwholesome mental states, enters and abides in the first absorption, which is accompanied by initial thought and sustained thought, born of seclusion, and filled with rapture and pleasure. With the calming of initial thought and sustained thought, he enters and abides in the second absorption, which is internal composure and unification of mind, without initial thought and sustained thought, born of concentration, and filled with rapture and pleasure. With the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and he experiences pleasure with the body—that of which the Noble Ones declare: 'He dwells in equanimity, mindful, a pleasant abider'—he enters and abides in the third absorption. With the abandoning of pleasure and the abandoning of pain—and with the previous cessation of joy and distress—he enters and abides in the fourth absorption, which is neither pain nor pleasure, and is purification of mindfulness by equanimity. He does not perform new actions, and he wears away old actions by touching them, thereby exhausting them. This purification through wearing away is visible in this very life, immediately effective, inviting inspection, leading onward, and to be personally experienced by the wise.\n\nThat monk, thus accomplished in concentration, by the destruction of the taints, enters and abides in the taintless liberation of mind and liberation by wisdom, having realized it for himself through direct knowledge in this very life. He does not perform new actions, and he wears away old actions by touching them, thereby exhausting them. This purification through wearing away is visible in this very life, immediately effective, inviting inspection, leading onward, and to be personally experienced by the wise.\n\nAbhaya, these are the three purifications through wearing away that have been fully proclaimed by the Blessed One—the Knower, the Seer, the Arahant, the Fully Self-Awakened One—for the purification of beings, for the passing beyond sorrow and lamentation, for the cessation of pain and distress, for the attainment of the path, and for the realization of Nibbāna.\"\n\nWhen this was said, Paṇḍitakumāraka the Licchavi asked Abhaya the Licchavi: \"Friend Abhaya, do you not approve of the Venerable Ānanda’s well-spoken discourse as being well-spoken?\"\n\n\"Friend Paṇḍitakumāraka, why would I not approve of the Venerable Ānanda’s well-spoken discourse as being well-spoken! Even his head would split open who would not approve of the Venerable Ānanda’s well-spoken discourse as being well-spoken.\"",
      "sinhala": "එක් සමයක ආයුෂ්මත් ආනන්ද තෙරණුවෝ වෙසාලියෙහි මහා වනයෙහි කූටාගාර ශාලාවේ වැඩ සිටියහ. ඉන්පසු අභය නම් ලිච්ඡවී සහ පණ්ඩිතකුමාරක නම් ලිච්ඡවී ආයුෂ්මත් ආනන්ද තෙරණුවන් වෙත එළඹියහ. එළඹ, ආයුෂ්මත් ආනන්ද තෙරණුවන්ට ස වැඳ, එකත්පසෙක වාඩි වූහ.\n\nඑකත්පසෙක වාඩි වී සිටි අභය නම් ලිච්ඡවී ආයුෂ්මත් ආනන්ද තෙරණුවන්ට මෙය සැල කළේය: “වහන්ස, නිගණ්ඨ නාටපුත්ත නම් ශාස්තෘවරයා සියල්ල දන්නා, සියල්ල දක්නා, කිසිවක් නොහැර වූ ඥාන දර්ශනයක් තමන් සතු බව ප්‍රතිඥා කරයි. ‘මා යන විට, සිටින විට, නිදන විට, පිබිදී සිටින විට—නිරන්තරයෙන් නොකඩවා ඥාන දර්ශනය පැමිණ සිටී’යි ඔහු කියයි. ඔහු පැරණි කර්මයන් තපසින් (දැඩි ව්‍යායාමයෙන්) ගෙවා දැමීම ප්‍රකාශ කරයි. නව කර්ම නොකිරීමෙන් (සැඩැල්ලක් බිඳ දැමීම වැනි) හරස් මාර්ගය වැසීමක් සිදු කරයි. මෙසේ කර්ම ක්ෂය වීමෙන් දුක් ක්ෂය වීම සිදු වේ, දුක් ක්ෂය වීමෙන් වේදනා ක්ෂය වීම සිදු වේ, වේදනා ක්ෂය වීමෙන් සියලු දුක් ගෙවී යන්නේය. මේ අයුරින් මේ දෘෂ්ටිගත කර්ම ක්ෂය කිරීමේ (නිජ්ජරාවේ) විශුද්ධිය සම්පූර්ණ වේ. වහන්ස, මේ පිළිබඳව භාග්‍යවතුන් වහන්සේ කුමක් වදාළ සේක්ද?”\n\n“අභය, මේ නිජ්ජරා විශුද්ධීන් තුනක් ඇත. ඒවා සියල්ල දැන වදාළ, සියල්ල දැක වදාළ, අරහත් වූ, සම්මා සම්බුදු වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක පරිදේවයන් ඉක්මවීම පිණිස, දුක් දෝමනස්සයන් අස්තංගත වීම පිණිස, න්‍යාය ධර්මය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය ප්‍රත්‍යක්ෂ කිරීම පිණිස මනා කොට දේශනා කරන ලදී. ඒ තුන කවරේද?\n\nඅභය, මෙහි භික්ෂුව ශීලවන්ත වේ... ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. ඔහු නව කර්මයක් නොකරයි, පැරණි කර්මය ස්පර්ශ කර ස්පර්ශ කර ගෙවා දමයි. මේ දෘෂ්ටිගත කර්ම ක්ෂය වීම ක්ෂණික වූවකි, ‘එව, බලව’ යන ලෙස පෙන්විය හැක්කකි, නිවනට පමුණුවන්නකි, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම දැනගත යුත්තකි.\n\nඅභය, ඒ ශීල සම්පන්න භික්ෂුව කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති ප්‍රථම ධ්‍යානයට එළඹ වාසය කරයි. විතර්ක විචාරයන් සංසිඳීමෙන්, ඇතුළත පැහැදීම ඇති කල්හි, සිතේ එකඟ බව ඇති කල්හි, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරයි. ප්‍රීතියෙහි ද විරාගයෙන් යුක්තව, උපේක්ෂාවෙන් යුක්තව, සිහි නුවණින් යුක්තව වාසය කරයි, ආර්යයන් විසින් ‘උපේක්ෂාවෙන් යුක්තව, සිහි නුවණින් යුක්තව, සුඛ විහරණයෙන් යුක්තය’යි කියනු ලබන යම් සුඛයක් වේද, එය කයින් අත්විඳිමින්, තුන්වන ධ්‍යානයට එළඹ වාසය කරයි. සුඛය ද ප්‍රහාණය කිරීමෙන්, දුක් ද ප්‍රහාණය කිරීමෙන්, කලින්ම සෝමනස්ස දෝමනස්සයන් අස්තංගත වීමෙන්, දුක්ද නොවන, සැපද නොවන, උපේක්ෂා සතියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට එළඹ වාසය කරයි. ඔහු නව කර්මයක් නොකරයි, පැරණි කර්මය ස්පර්ශ කර ස්පර්ශ කර ගෙවා දමයි. මේ දෘෂ්ටිගත කර්ම ක්ෂය වීම ක්ෂණික වූවකි, ‘එව, බලව’ යන ලෙස පෙන්විය හැක්කකි, නිවනට පමුණුවන්නකි, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම දැනගත යුත්තකි.\n\nඅභය, ඒ සමාධි සම්පන්න භික්ෂුව ආශ්‍රවයන්ගේ ක්ෂය වීම නිසා ආශ්‍රව රහිත වූ චේතෝවිමුක්තියද ප්‍රඥා විමුක්තියද මේ ජීවිතයේදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට එළඹ වාසය කරයි. ඔහු නව කර්මයක් නොකරයි, පැරණි කර්මය ස්පර්ශ කර ස්පර්ශ කර ගෙවා දමයි. මේ දෘෂ්ටිගත කර්ම ක්ෂය වීම ක්ෂණික වූවකි, ‘එව, බලව’ යන ලෙස පෙන්විය හැක්කකි, නිවනට පමුණුවන්නකි, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම දැනගත යුත්තකි.\n\nඅභය, සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක පරිදේවයන් ඉක්මවීම පිණිස, දුක් දෝමනස්සයන් අස්තංගත වීම පිණිස, න්‍යාය ධර්මය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය ප්‍රත්‍යක්ෂ කිරීම පිණිස, සියල්ල දැන වදාළ, සියල්ල දැක වදාළ, අරහත් වූ, සම්මා සම්බුදු වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මේ නිජ්ජරා විශුද්ධීන් තුන මනා කොට දේශනා කරන ලදී.”\n\nමෙසේ වදාළ කල්හි පණ්ඩිතකුමාරක නම් ලිච්ඡවී අභය නම් ලිච්ඡවීට මෙසේ කීය: “ඇවැත් අභය, ඔබ ආයුෂ්මත් ආනන්ද තෙරණුවන්ගේ සුභාෂිතය සුභාෂිතයක් ලෙස අනුමෝදන් නොකරන්නේද?”\n\n“ඇවැත් පණ්ඩිතකුමාරක, මා විසින් කෙසේ නම් ආයුෂ්මත් ආනන්ද තෙරණුවන්ගේ සුභාෂිතය සුභාෂිතයක් ලෙස අනුමෝදන් නොකරන්නද! යමෙක් ආයුෂ්මත් ආනන්ද තෙරණුවන්ගේ සුභාෂිතය සුභාෂිතයක් ලෙස අනුමෝදන් නොකරන්නේද, ඔහුගේ හිස පවා පිපිරී යන්නේය.” (දේශනාව මෙතැනින් අවසන් විය).",
      "paliTitle": "Nigaṇṭhasuttaṃ",
      "englishTitle": "To the Nigaṇṭhas Sutta",
      "sinhalaTitle": "නිගණ්ඨ සූත්‍රය"
    },
    {
      "number": 76,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘Ye, ānanda, anukampeyyātha ye ca sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā sālohitā vā te vo, ānanda, tīsu ṭhānesu samādapetabbā [samādāpetabbā (?)] nivesetabbā patiṭṭhāpetabbā. Katamesu tīsu? Buddhe aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi; satthā devamanussānaṃ, buddho bhagavā’ti, dhamme aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti, saṅghe aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’’ti. ‘‘Siyā, ānanda, catunnaṃ mahābhūtānaṃ aññathattaṃ – pathavīdhātuyā āpodhātuyā tejodhātuyā vāyodhātuyā, na tveva buddhe aveccappasādena samannāgatassa ariyasāvakassa siyā aññathattaṃ tatridaṃ aññathattaṃ. So vatānanda, buddhe aveccappasādena samannāgato ariyasāvako nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjissatīti netaṃ ṭhānaṃ vijjati. ‘‘Siyā, ānanda, catunnaṃ mahābhūtānaṃ aññathattaṃ – pathavīdhātuyā āpodhātuyā tejodhātuyā vāyodhātuyā, na tveva dhamme…pe… na tveva saṅghe aveccappasādena samannāgatassa ariyasāvakassa siyā aññathattaṃ tatridaṃ aññathattaṃ. So vatānanda, saṅghe aveccappasādena samannāgato ariyasāvako nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjissatīti netaṃ ṭhānaṃ vijjati. ‘‘Ye, ānanda, anukampeyyātha ye ca sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā sālohitā vā te vo, ānanda, imesu tīsu ṭhānesu samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Pañcamaṃ.",
      "english": "Then the Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down at one side.\n\nAs the Venerable Ānanda was sitting at one side, the Blessed One said this to him: “Ānanda, those whom you feel compassion for, those who you think ought to listen—whether they be friends, colleagues, relatives, or kin—these, Ānanda, should be urged, established, and settled in three grounds. Which three? They should be urged, established, and settled in unshakeable confidence in the Buddha, thinking: ‘Indeed, the Blessed One is Arahant, Perfectly and Fully Awakened, accomplished in true knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons fit to be tamed, teacher of devas and humans, the Buddha, the Blessed One.’ They should be urged, established, and settled in unshakeable confidence in the Dhamma, thinking: ‘The Dhamma is well-proclaimed by the Blessed One, visible here and now, immediate, inviting inspection, onward-leading, to be personally realized by the wise.’ They should be urged, established, and settled in unshakeable confidence in the Saṅgha, thinking: ‘The Saṅgha of the Blessed One’s disciples practices well, the Saṅgha of the Blessed One’s disciples practices directly, the Saṅgha of the Blessed One’s disciples practices methodically, the Saṅgha of the Blessed One’s disciples practices properly; that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One’s disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unsurpassed field of merit for the world.’\n\n“It is possible, Ānanda, that the four great elements—the earth element, the water element, the fire element, and the air element—might experience alteration, but it is not possible that the noble disciple possessing unshakeable confidence in the Buddha should experience alteration in this regard. It is simply not possible, Ānanda, that a noble disciple possessing unshakeable confidence in the Buddha would be reborn in hell, or in the animal realm, or in the realm of hungry ghosts. That situation does not exist.\n\n“It is possible, Ānanda, that the four great elements—the earth element, the water element, the fire element, and the air element—might experience alteration, but it is not possible that the noble disciple possessing unshakeable confidence in the Dhamma, or possessing unshakeable confidence in the Saṅgha, should experience alteration in this regard. It is simply not possible, Ānanda, that a noble disciple possessing unshakeable confidence in the Saṅgha would be reborn in hell, or in the animal realm, or in the realm of hungry ghosts. That situation does not exist.\n\n“Therefore, Ānanda, those whom you feel compassion for, those who you think ought to listen—whether they be friends, colleagues, relatives, or kin—these should be urged, established, and settled in these three grounds.”",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනාමාන කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“ආනන්දයෙනි, යම් අයෙකුට ඔබ අනුකම්පා කරන්නේ නම්, යම් අයෙකු ඔබට ශ්‍රවණය කළ යුතු යැයි සිතන්නේ නම්—ඒ මිත්‍රයෝ හෝ, ඇමැත්තෝ හෝ, ඥාතීහු හෝ, ලේ ඥාතීහු හෝ වේවා—ආනන්දයෙනි, ඔබ විසින් ඔවුන් මේ ස්ථාන තුනෙහි සමාදන් කරවිය යුතු ය, පිහිටුවිය යුතු ය, තහවුරු කළ යුතු ය. ඒ තුන කවරේද? බුදුරජාණන් වහන්සේ කෙරෙහි ඇති නොසැලෙන පැහැදීමෙහි සමාදන් කරවිය යුතු ය, පිහිටුවිය යුතු ය, තහවුරු කළ යුතු ය—‘ඒ භාග්‍යවතුන් වහන්සේ අරහං වන සේක, සම්මාසම්බුද්ධ වන සේක, විජ්ජාචරණසම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තරෝ පුරිසදම්මසාරථි වන සේක, සත්ථා දේවමනුස්සානං වන සේක, බුද්ධ වන සේක, භාග්‍යවතුන් වහන්සේ වන සේක’ යනුයි. ධර්මය කෙරෙහි ඇති නොසැලෙන පැහැදීමෙහි සමාදන් කරවිය යුතු ය, පිහිටුවිය යුතු ය, තහවුරු කළ යුතු ය—‘භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛාත කරන ලද ඒ ධර්මය මේ ආත්මභාවයේදී ම විපාක දෙන සුළු ය, කාලය ඉක්මවා විපාක දෙන සුළු ය, ‘එන්න, බලන්නැ’ යි ආරාධනා කළ හැකි ය, නිර්වාණය වෙත පමුණුවන සුළු ය, ප්‍රඥාවන්තයින් විසින් තමන් තුළින් ම අවබෝධ කරගත යුතු ය’ යනුයි. සංඝයා වහන්සේ කෙරෙහි ඇති නොසැලෙන පැහැදීමෙහි සමාදන් කරවිය යුතු ය, පිහිටුවිය යුතු ය, තහවුරු කළ යුතු ය—‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රා200Dවක සංඝයා වහන්සේ සුපටිපන්න වන සේක, උජුපටිපන්න වන සේක, ඤායපටිපන්න වන සේක, සාමීචිපටිපන්න වන සේක; යම් සේ මේ සතර පුරුෂ යුගල ද, අට අරිය පුරුෂ පුද්ගලයෝ ද වෙත් ද, ඒ භාග්‍යවතුන් වහන්සේගේ ශ්‍රා200Dවක සංඝයා වහන්සේ ආහුණෙය්‍ය (දූරයෙන් ගෙනවිත් දිය යුතු), පාහුණෙය්‍ය (අමුත්තන්ට දිය යුතු), දක්ඛිණෙය්‍ය (පූජා පැවැත්විය යුතු), අඤ්ජලිකරණීය (වැඳිය යුතු) වන සේක; ලෝකයාගේ අනුත්තර වූ පින් කෙත වන සේක’ යනුයි.\n\n“ආනන්දයෙනි, පඨවිධාතුව, ආපෝධාතුව, තේජෝධාතුව, වායෝධාතුව යන සතර මහා භූතයන්ගේ වෙනස්වීමක් (ස්වභාවය වෙනස් වීමක්) විය හැකි ය. එහෙත්, බුදුරජාණන් වහන්සේ කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත වූ ආර්ය ශ්‍රා200Dවකයාගේ ඒ පැහැදීම වෙනස් වීමක් (ඒකාන්තයෙන්) නොවිය හැකි ය. ආනන්දයෙනි, බුදුරජාණන් වහන්සේ කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත වූ ඒ ආර්ය ශ්‍රා200Dවකයා වනාහී නිරයේ හෝ, තිරශ්චීන යෝනියේ හෝ, ප්‍රේත ලෝකයේ හෝ උපදිනු ඇත යන්න සිදු විය හැකි කරුණක් නොවේ.\n\n“ආනන්දයෙනි, පඨවිධාතුව, ආපෝධාතුව, තේජෝධාතුව, වායෝධාතුව යන සතර මහා භූතයන්ගේ වෙනස්වීමක් විය හැකි ය. එහෙත්, ධර්මය කෙරෙහි ඇති නොසැලෙන පැහැදීමෙන් යුක්ත වූ ආර්ය ශ්‍රා200Dවකයාගේ ඒ පැහැදීම වෙනස් වීමක් නොවිය හැකි ය. සංඝයා වහන්සේ කෙරෙහි ඇති නොසැලෙන පැහැදීමෙන් යුක්ත වූ ආර්ය ශ්‍රා200Dවකයාගේ ඒ පැහැදීම වෙනස් වීමක් නොවිය හැකි ය. ආනන්දයෙනි, සංඝයා වහන්සේ කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත වූ ඒ ආර්ය ශ්‍රා200Dවකයා වනාහී නිරයේ හෝ, තිරශ්චීන යෝනියේ හෝ, ප්‍රේත ලෝකයේ හෝ උපදිනු ඇත යන්න සිදු විය හැකි කරුණක් නොවේ.\n\n“ආනන්දයෙනි, යම් අයෙකුට ඔබ අනුකම්පා කරන්නේ නම්, යම් අයෙකු ඔබට ශ්‍රවණය කළ යුතු යැයි සිතන්නේ නම්—ඒ මිත්‍රයෝ හෝ, ඇමැත්තෝ හෝ, ඥාතීහු හෝ, ලේ ඥාතීහු හෝ වේවා—ආනන්දයෙනි, ඔබ විසින් ඔවුන් මේ ස්ථාන තුනෙහි සමාදන් කරවිය යුතු ය, පිහිටුවිය යුතු ය, තහවුරු කළ යුතු ය” යි. පස්වෙනි සූත්‍රයයි.",
      "paliTitle": "Nivesakasuttaṃ",
      "englishTitle": "The Settling Sutta",
      "sinhalaTitle": "නිවේසක සූත්‍රය"
    },
    {
      "number": 77,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘bhavo, bhavoti, bhante, vuccati. Kittāvatā nu kho, bhante, bhavo hotī’’ti? ‘‘Kāmadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho kāmabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho [sineho (sī. syā. kaṃ. pī.)]. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ hīnāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ [āyati (sī.)] punabbhavābhinibbatti hoti. ( ) [(evaṃ kho ānanda bhavo hotīti) (ka.) dutiyasutte pana idaṃ pāṭhanānattaṃ natthi] ‘‘Rūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho rūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ majjhimāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ punabbhavābhinibbatti hoti. ( ) [(evaṃ kho ānanda bhavo hotīti) (ka.) dutiyasutte pana idaṃ pāṭhanānattaṃ natthi] ‘‘Arūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho arūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ paṇītāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ punabbhavābhinibbatti hoti. Evaṃ kho, ānanda, bhavo hotī’’ti. Chaṭṭhaṃ.",
      "english": "Then the Venerable Ānanda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down at one side. As he sat at one side, the Venerable Ānanda spoke thus to the Blessed One: \"Becoming, becoming, sir, it is said. To what extent, sir, does becoming occur?\"\n\n\"Ānanda, if there were no volitional actions (kamma) ripening in the sense-sphere realm, would sense-sphere existence (kāmabhava) be discernible?\" \"It would not be so, sir.\" \"Thus, Ānanda, action is the field, consciousness is the seed, and craving is the moisture. For beings obstructed by ignorance and bound by the fetters of craving, consciousness becomes established in the inferior realm; thus, in the future, the coming to renewed existence occurs.\"\n\n\"Ānanda, if there were no volitional actions ripening in the form-realm, would form-existence (rūpabhava) be discernible?\" \"It would not be so, sir.\" \"Thus, Ānanda, action is the field, consciousness is the seed, and craving is the moisture. For beings obstructed by ignorance and bound by the fetters of craving, consciousness becomes established in the middle realm; thus, in the future, the coming to renewed existence occurs.\"\n\n\"Ānanda, if there were no volitional actions ripening in the formless-realm, would formless-existence (arūpabhava) be discernible?\" \"It would not be so, sir.\" \"Thus, Ānanda, action is the field, consciousness is the seed, and craving is the moisture. For beings obstructed by ignorance and bound by the fetters of craving, consciousness becomes established in the superior realm; thus, in the future, the coming to renewed existence occurs. This is how becoming occurs, Ānanda.\"",
      "sinhala": "එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක වාඩි වූහ. එකත්පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ: “වහන්ස, ‘භවය’, ‘භවය’ යැයි කියනු ලැබේ. වහන්ස, කොපමණකින් නම් භවය ඇති වේද?”\n\n“ආනන්දයෙනි, කාමධාතුවෙහි විපාක දෙන කර්මය නොවන්නේ නම්, කාමභවය ප්‍රඥප්ත වන්නේද?” “වහන්ස, එය එසේ නොවේ.” “ආනන්දයෙනි, එසේ නම් කර්මය යනු කෙතය, විඤ්ඤාණය යනු බීජයය, තණ්හාව යනු ස්නේහය/තෙතමනය යි. අවිද්‍යා_නීවරණයන්ගෙන් වැසී, තණ්හා_සංයෝජනයන්ගෙන් බැඳුණු සත්වයන්ගේ පහත් වූ ධාතුවෙහි (කාම ධාතුවෙහි) විඤ්ඤාණය පිහිටියේ නම්, මෙසේ මතු භවයෙහි පුනර්භවය හටගැනීම සිදු වේ.”\n\n“ආනන්දයෙනි, රූපධාතුවෙහි විපාක දෙන කර්මය නොවන්නේ නම්, රූපභවය ප්‍රඥප්ත වන්නේද?” “වහන්ස, එය එසේ නොවේ.” “ආනන්දයෙනි, එසේ නම් කර්මය යනු කෙතය, විඤ්ඤාණය යනු බීජයය, තණ්හාව යනු ස්නේහය/තෙතමනය යි. අවිද්‍යා_නීවරණයන්ගෙන් වැසී, තණ්හා_සංයෝජනයන්ගෙන් බැඳුණු සත්වයන්ගේ මධ්‍යම වූ ධාතුවෙහි (රූප ධාතුවෙහි) විඤ්ඤාණය පිහිටියේ නම්, මෙසේ මතු භවයෙහි පුනර්භවය හටගැනීම සිදු වේ.”\n\n“ආනන්දයෙනි, අරූපධාතුවෙහි විපාක දෙන කර්මය නොවන්නේ නම්, අරූපභවය ප්‍රඥප්ත වන්නේද?” “වහන්ස, එය එසේ නොවේ.” “ආනන්දයෙනි, එසේ නම් කර්මය යනු කෙතය, විඤ්ඤාණය යනු බීජයය, තණ්හාව යනු ස්නේහය/තෙතමනය යි. අවිද්‍යා_නීවරණයන්ගෙන් වැසී, තණ්හා_සංයෝජනයන්ගෙන් බැඳුණු සත්වයන්ගේ ප්‍රණීත වූ ධාතුවෙහි (අරූප ධාතුවෙහි) විඤ්ඤාණය පිහිටියේ නම්, මෙසේ මතු භවයෙහි පුනර්භවය හටගැනීම සිදු වේ. ආනන්දයෙනි, මෙසේ භවය ඇති වේ.”",
      "paliTitle": "Paṭhamabhavasuttaṃ",
      "englishTitle": "The First Discourse on Existence",
      "sinhalaTitle": "පළමු භව සූත්‍රය"
    },
    {
      "number": 78,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami…pe… āyasmā ānando bhagavantaṃ etadavoca – ‘‘bhavo, bhavoti, bhante, vuccati. Kittāvatā nu kho, bhante, bhavo hotī’’ti? ‘‘Kāmadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho kāmabhavo paññāyethā’’ti? ‘‘No hetaṃ bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ hīnāya dhātuyā cetanā patiṭṭhitā patthanā patiṭṭhitā evaṃ āyatiṃ punabbhavābhinibbatti hoti’’. ‘‘Rūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho rūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ majjhimāya dhātuyā cetanā patiṭṭhitā patthanā patiṭṭhitā evaṃ āyatiṃ punabbhavābhinibbatti hoti’’. ‘‘Arūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho arūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ paṇītāya dhātuyā cetanā patiṭṭhitā patthanā patiṭṭhitā evaṃ āyatiṃ punabbhavābhinibbatti hoti. Evaṃ kho, ānanda, bhavo hotī’’ti. Sattamaṃ.",
      "english": "Then the Venerable Ānanda approached the Blessed One... The Venerable Ānanda said this to the Blessed One: \"Existence, existence is spoken of, Venerable Sir. To what extent, Venerable Sir, does existence come to be?\"\n\n\"If, Ānanda, action (kamma) that matures in the Sense Realm were not present, would existence in the sense realm (kāmabhava) be discerned?\" \"No, Venerable Sir.\"\n\n\"Thus, Ānanda, action is the field, consciousness is the seed, and craving is the moisture. When volition is established and aspiration is established in the lower realm for beings covered by the hindrance of ignorance and bound by the fetter of craving, it is thus that the re-origination of renewed existence comes about in the future.\"\n\n\"If, Ānanda, action that matures in the Form Realm were not present, would existence in the form realm (rūpabhava) be discerned?\" \"No, Venerable Sir.\"\n\n\"Thus, Ānanda, action is the field, consciousness is the seed, and craving is the moisture. When volition is established and aspiration is established in the middle realm for beings covered by the hindrance of ignorance and bound by the fetter of craving, it is thus that the re-origination of renewed existence comes about in the future.\"\n\n\"If, Ānanda, action that matures in the Formless Realm were not present, would existence in the formless realm (arūpabhava) be discerned?\" \"No, Venerable Sir.\"\n\n\"Thus, Ānanda, action is the field, consciousness is the seed, and craving is the moisture. When volition is established and aspiration is established in the sublime realm for beings covered by the hindrance of ignorance and bound by the fetter of craving, it is thus that the re-origination of renewed existence comes about in the future. It is in this way, Ānanda, that existence comes to be.\"",
      "sinhala": "එයින් පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණ, වැඳ, එකත්පසෙක හිඳගෙන, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “වහන්ස, භවය, භවය යැයි කියනු ලැබේ. වහන්ස, කවර කරුණකින් භවය ඇති වන්නේද?”\n\n“ආනන්දය, කාමධාතුවේ විපාක දෙන කර්මය නොවන්නේ නම්, කාම භවය පැනවීමට (දැක්වීමට) හැකිවේද?” “වහන්ස, එසේ නොවේ.” “ආනන්දය, එසේ නම් කර්මය යනු කෙතය, විඤ්ඤාණය යනු බීජය ය, තෘෂ්ණාව යනු ස්නේහය ය. අවිද්‍යාව නමැති නීවරණයෙන් වැසුණු, තෘෂ්ණාව නමැති සංයෝජනයෙන් බැඳුණු සත්ත්වයෝ හීන වූ ධාතුවේ චේතනාව පිහිටුවා, ප්‍රාර්ථනාව පිහිටුවන කල්හි, මෙසේ අනාගතයේදී නැවත භවයක් ඇතිවීම සිදුවේ.”\n\n“ආනන්දය, රූපධාතුවේ විපාක දෙන කර්මය නොවන්නේ නම්, රූප භවය පැනවීමට හැකිවේද?” “වහන්ස, එසේ නොවේ.” “ආනන්දය, එසේ නම් කර්මය යනු කෙතය, විඤ්ඤාණය යනු බීජය ය, තෘෂ්ණාව යනු ස්නේහය ය. අවිද්‍යාව නමැති නීවරණයෙන් වැසුණු, තෘෂ්ණාව නමැති සංයෝජනයෙන් බැඳුණු සත්ත්වයෝ මධ්‍යම වූ ධාතුවේ චේතනාව පිහිටුවා, ප්‍රාර්ථනාව පිහිටුවන කල්හි, මෙසේ අනාගතයේදී නැවත භවයක් ඇතිවීම සිදුවේ.”\n\n“ආනන්දය, අරූපධාතුවේ විපාක දෙන කර්මය නොවන්නේ නම්, අරූප භවය පැනවීමට හැකිවේද?” “වහන්ස, එසේ නොවේ.” “ආනන්දය, එසේ නම් කර්මය යනු කෙතය, විඤ්ඤාණය යනු බීජය ය, තෘෂ්ණාව යනු ස්නේහය ය. අවිද්‍යාව නමැති නීවරණයෙන් වැසුණු, තෘෂ්ණාව නමැති සංයෝජනයෙන් බැඳුණු සත්ත්වයෝ ප්‍රණීත වූ ධාතුවේ චේතනාව පිහිටුවා, ප්‍රාර්ථනාව පිහිටුවන කල්හි, මෙසේ අනාගතයේදී නැවත භවයක් ඇතිවීම සිදුවේ. ආනන්දය, භවය ඇති වන්නේ මේ ආකාරයට යි.”",
      "paliTitle": "Dutiyabhavasuttaṃ",
      "englishTitle": "Second Sutta on Becoming",
      "sinhalaTitle": "දුතිය භව සූත්‍රය"
    },
    {
      "number": 79,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘sabbaṃ nu kho, ānanda, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ saphala’’nti? ‘‘Na khvettha, bhante, ekaṃsenā’’ti. ‘‘Tena hānanda, vibhajassū’’ti. ‘‘Yañhissa [yathārūpaṃ hissa (?) sevitabbāsevitabbasuttānurūpaṃ], bhante, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ sevato akusalā dhammā abhivaḍḍhanti kusalā dhammā parihāyanti, evarūpaṃ sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ aphalaṃ. Yañca khvāssa [yañhissa (ka.), yathārūpañca khvāssa (?)], bhante, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṃ sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ saphala’’nti. Idamavoca āyasmā ānando; samanuñño satthā ahosi. Atha kho āyasmā ānando ‘‘samanuñño me satthā’’ti, uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā acirapakkante āyasmante ānande bhikkhū āmantesi – ‘‘sekho, bhikkhave, ānando; na ca panassa sulabharūpo samasamo paññāyā’’ti. Aṭṭhamaṃ.",
      "english": "Then Venerable Ānanda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down at one side. To Venerable Ānanda, sitting at one side, the Blessed One said this: \"Ānanda, is all virtuous conduct and observances, the way of life, and the spiritual path—which is sustained by diligent effort—fruitful?\" \"It is not entirely so in this matter, Venerable Sir,\" he replied. \"In that case, Ānanda, make the distinction.\"\n\n\"Venerable Sir, when virtuous conduct and observances, way of life, and spiritual practice sustained by diligent effort are engaged in, and unwholesome states increase while wholesome states decline, such virtuous conduct and observances, way of life, and spiritual practice sustained by diligent effort is unfruitful. However, Venerable Sir, when virtuous conduct and observances, way of life, and spiritual practice sustained by diligent effort are engaged in, and unwholesome states decline while wholesome states increase, such virtuous conduct and observances, way of life, and spiritual practice sustained by diligent effort is fruitful.\" This is what Venerable Ānanda said; the Teacher approved. Then Venerable Ānanda, knowing that his Teacher had approved, rose from his seat, paid homage to the Blessed One, circumambulated him respectfully, and departed.\n\nThen, soon after Venerable Ānanda had departed, the Blessed One addressed the monastics: \"Ānanda, monastics, is a learner on the path (sekha); and truly, one of his caliber in wisdom is not easily found.\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩ සිටින තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩ සිටි ආයුෂ්මත් ආනන්ද තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"ආනන්දයෙනි, ශීලය, වත, ජීවිතය, හා බ්‍රහ්මචර්යාව යන මේ සියල්ලම උපස්ථාන සාර කොට ඇත්තේ පල සහිත ද?\" \"භාග්‍යවතුන් වහන්ස, මේ කාරණයේ දී එකාන්තයෙන්ම එසේ නොවේ.\" \"එසේ නම් ආනන්දයෙනි, ඔබ එය විභාග කොට දක්වන්න.\"\n\n\"භාග්‍යවතුන් වහන්ස, යම් ආකාරයක ශීලය, වත, ජීවිතය, හා බ්‍රහ්මචර්යාව උපස්ථාන සාර කොට ඇත්තෙක් එය සේවනය කිරීමෙන් අකුශල ධර්‍මයෝ වැඩෙත් ද, කුශල ධර්‍මයෝ පිරිහෙත් ද, එබඳු වූ ශීලය, වත, ජීවිතය, හා බ්‍රහ්මචර්යාව උපස්ථාන සාර කොට ඇත්තේ අපල සහිත යි. භාග්‍යවතුන් වහන්ස, යම් ආකාරයක ශීලය, වත, ජීවිතය, හා බ්‍රහ්මචර්යාව උපස්ථාන සාර කොට ඇත්තෙක් එය සේවනය කිරීමෙන් අකුශල ධර්‍මයෝ පිරිහෙත් ද, කුශල ධර්‍මයෝ වැඩෙත් ද, එබඳු වූ ශීලය, වත, ජීවිතය, හා බ්‍රහ්මචර්යාව උපස්ථාන සාර කොට ඇත්තේ පල සහිත යි.\"\n\nආයුෂ්මත් ආනන්ද තෙරණුවෝ මෙය වදාළ සේක. ශාස්තෲන් වහන්සේ එය අනුමත කළ සේක. ඉන්පසු ආයුෂ්මත් ආනන්ද තෙරණුවෝ \"මාගේ ශාස්තෲන් වහන්සේ අනුමත කළ සේකැ\"යි සිතා, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වැඳ, පැදකුණු කොට, පිටත්ව ගියහ.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද තෙරණුවෝ පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමට පෙර භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, ආනන්ද තෙරණුවෝ ශෛක්‍ෂ කෙනෙකි. එහෙත් ප්‍රඥාවෙන් ඔහුට සමසම කෙනෙකු සොයා ගැනීම පහසු නොවන්නේ ය.\"",
      "paliTitle": "Sīlabbatasuttaṃ",
      "englishTitle": "The Discourse on Precepts and Vows",
      "sinhalaTitle": "සීලබ්බත සූත්‍රය"
    },
    {
      "number": 80,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Tīṇimāni, bhante, gandhajātāni, yesaṃ anuvātaṃyeva gandho gacchati, no paṭivātaṃ. Katamāni tīṇi? Mūlagandho, sāragandho, pupphagandho – imāni kho, bhante, tīṇi gandhajātāni, yesaṃ anuvātaṃyeva gandho gacchati, no paṭivātaṃ. Atthi nu kho, bhante, kiñci gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti? ‘‘Atthānanda, kiñci gandhajātaṃ [atthānanda gandhajātaṃ (sī. syā. kaṃ. pī.)] yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti. ‘‘Katamañca pana, bhante, gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti? ‘‘Idhānanda, yasmiṃ gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti, sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato. ‘‘Tassa disāsu samaṇabrāhmaṇā vaṇṇaṃ bhāsanti – ‘amukasmiṃ [asukasmiṃ (sī. syā. kaṃ. pī.)] nāma gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti, sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’’’ti. ‘‘Devatāpissa [devatāpissa amanussā (sī. pī.), devatāpissa amanussāpi (ka.), devatāpissa…pe… manussāpissa (?)] vaṇṇaṃ bhāsanti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti, sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’ti. Idaṃ kho taṃ, ānanda, gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti. ‘‘Na pupphagandho paṭivātameti, Na candanaṃ tagaramallikā [taggaramallikā (pī.)] vā; Satañca gandho paṭivātameti, Sabbā disā sappuriso pavāyatī’’ti. navamaṃ;",
      "english": "Then the Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down at one side. Sitting at one side, the Venerable Ānanda said this to the Blessed One: “Venerable Sir, there are these three kinds of fragrances which travel only with the wind, not against the wind. What are the three? The fragrance of roots, the fragrance of wood-heart, and the fragrance of flowers—these, Venerable Sir, are the three kinds of fragrances which travel only with the wind, not against the wind. But is there, Venerable Sir, any kind of fragrance which travels with the wind, against the wind, and both with and against the wind?” “There is, Ānanda, a kind of fragrance which travels with the wind, against the wind, and both with and against the wind.” “And what, Venerable Sir, is that kind of fragrance which travels with the wind, against the wind, and both with and against the wind?”\n\n“Here, Ānanda, in whatever village or town, a woman or a man has gone for refuge to the Buddha, gone for refuge to the Dhamma, gone for refuge to the Saṅgha; abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from intoxicating drinks and drugs which are the basis for heedlessness; is virtuous, possesses beautiful qualities, dwells in a home with a mind free of the stain of stinginess, is open-handed, pure-handed, delighting in relinquishment, amenable to requests, delighting in giving and sharing.\n\n“Of that person, monastics and Brahmins speak highly in all directions: ‘In such-and-such a village or town, a woman or a man has gone for refuge to the Buddha, gone for refuge to the Dhamma, gone for refuge to the Saṅgha; abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from intoxicating drinks and drugs which are the basis for heedlessness; is virtuous, possesses beautiful qualities, dwells in a home with a mind free of the stain of stinginess, is open-handed, pure-handed, delighting in relinquishment, amenable to requests, delighting in giving and sharing.’\n\n“Even deities speak highly of that person: ‘In such-and-such a village or town, a woman or a man has gone for refuge to the Buddha, gone for refuge to the Dhamma, gone for refuge to the Saṅgha; abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from intoxicating drinks and drugs which are the basis for heedlessness; is virtuous, possesses beautiful qualities, dwells in a home with a mind free of the stain of stinginess, is open-handed, pure-handed, delighting in relinquishment, amenable to requests, delighting in giving and sharing.’\n\n“This, Ānanda, is that kind of fragrance which travels with the wind, against the wind, and both with and against the wind.”\n\nThe fragrance of flowers does not travel against the wind, nor does sandalwood, tagara, or jasmine. But the fragrance of the virtuous travels against the wind; the truly good person pervades all directions.",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියා; පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වූ ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීනි, මේ ගන්ධ වර්ග තුනක් ඇත, එහි සුවඳ යන්නේ අනුක්‍රමයෙන් හුළං යන දෙසටම පමණි, ප්‍රතිලෝමව (හුළං එන දෙසට) නොවේ. ඒ තුන කවරේද? මුල් සුවඳ, සාර (දඬු) සුවඳ, මල් සුවඳ යන මේවාය. ස්වාමීනි, මේ ගන්ධ වර්ග තුනයි, එහි සුවඳ යන්නේ අනුක්‍රමයෙන් හුළං යන දෙසටම පමණි, ප්‍රතිලෝමව නොවේ. ස්වාමීනි, යම්කිසි ගන්ධ වර්ගයක් ඇද්ද, එහි සුවඳ අනුලෝමවද (හුළං යන දෙසටද), ප්‍රතිලෝමවද (හුළං එන දෙසටද), අනුලෝම ප්‍රතිලෝම දෙකෙහිමද යන්නේ?” “ආනන්දය, යම්කිසි ගන්ධ වර්ගයක් ඇත, එහි සුවඳ අනුලෝමවද, ප්‍රතිලෝමවද, අනුලෝම ප්‍රතිලෝම දෙකෙහිමද යන්නේ.” “ස්වාමීනි, එසේනම් කවර නම් ගන්ධ වර්ගයක් ඇද්ද, එහි සුවඳ අනුලෝමවද, ප්‍රතිලෝමවද, අනුලෝම ප්‍රතිලෝම දෙකෙහිමද යන්නේ?”\n\n“ආනන්දය, මෙහි යම් ගමක හෝ නියම්ගමක හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ බුද්ධං සරණං ගොස් වාසය කරන්නේද, ධර්මං සරණං ගොස් වාසය කරන්නේද, සංඝං සරණං ගොස් වාසය කරන්නේද, ප්‍රාණඝාතයෙන් වැළකී වාසය කරන්නේද, අදත්තාදානයෙන් වැළකී වාසය කරන්නේද, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී වාසය කරන්නේද, මුසාවාදයෙන් වැළකී වාසය කරන්නේද, මත්පැන් පානය කිරීම සහ ප්‍රමාදයට හේතු වන ස්ථානවලින් වැළකී වාසය කරන්නේද, ඔහු සිල්වත් වන්නේය, යහපත් ගුණධර්ම ඇතිවන්නේය, පහ වූ මලමසුරු බව ඇති සිතින් යුක්තව ගිහි ගෙයි වෙසෙන්නේය, නිදහස්ව දීමෙහි යෙදී, පිරිසිදු අත් ඇතිව, පරිත්‍යාගයෙහි ඇලී, අයදින අයට පිහිට වීමට සුදුසු, දන් බෙදාදීමට ඇලී වාසය කරන්නේය.\n\nදිශාවල වසන ශ්‍රමණබ්‍රාහ්මණයෝ ඒ පුද්ගලයාගේ ගුණ වර්ණනා කරති: ‘අසවල් නම් වූ ගමක හෝ නියම්ගමක හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ බුද්ධං සරණං ගොස් වාසය කරන්නේය, ධර්මං සරණං ගොස් වාසය කරන්නේය, සංඝං සරණං ගොස් වාසය කරන්නේය, ප්‍රාණඝාතයෙන් වැළකී වාසය කරන්නේය, අදත්තාදානයෙන් වැළකී වාසය කරන්නේය, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී වාසය කරන්නේය, මුසාවාදයෙන් වැළකී වාසය කරන්නේය, මත්පැන් පානය කිරීම සහ ප්‍රමාදයට හේතු වන ස්ථානවලින් වැළකී වාසය කරන්නේය, ඔහු සිල්වත් වන්නේය, යහපත් ගුණධර්ම ඇතිවන්නේය, පහ වූ මලමසුරු බව ඇති සිතින් යුක්තව ගිහි ගෙයි වෙසෙන්නේය, නිදහස්ව දීමෙහි යෙදී, පිරිසිදු අත් ඇතිව, පරිත්‍යාගයෙහි ඇලී, අයදින අයට පිහිට වීමට සුදුසු, දන් බෙදාදීමට ඇලී වාසය කරන්නේය.’ දෙවිවරුද ඔහුගේ ගුණ වර්ණනා කරති: ‘අසවල් නම් වූ ගමක හෝ නියම්ගමක හෝ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ බුද්ධං සරණං ගොස් වාසය කරන්නේය, ධර්මං සරණං ගොස් වාසය කරන්නේය, සංඝං සරණං ගොස් වාසය කරන්නේය, ප්‍රාණඝාතයෙන් වැළකී වාසය කරන්නේය... මත්පැන් පානය කිරීම සහ ප්‍රමාදයට හේතු වන ස්ථානවලින් වැළකී වාසය කරන්නේය, ඔහු සිල්වත් වන්නේය, යහපත් ගුණධර්ම ඇතිවන්නේය, පහ වූ මලමසුරු බව ඇති සිතින් යුක්තව ගිහි ගෙයි වෙසෙන්නේය, නිදහස්ව දීමෙහි යෙදී, පිරිසිදු අත් ඇතිව, පරිත්‍යාගයෙහි ඇලී, අයදින අයට පිහිට වීමට සුදුසු, දන් බෙදාදීමට ඇලී වාසය කරන්නේය.’ ආනන්දය, මේ ඒ ගන්ධ වර්ගයයි, එහි සුවඳ අනුලෝමවද, ප්‍රතිලෝමවද, අනුලෝම ප්‍රතිලෝම දෙකෙහිමද යන්නේ.”\n\nමල් සුවඳ හුළං එන දෙසට නොයයි,\nසඳුන් හෝ තගර මල් හෝ සමන් මල් සුවඳද එසේමයි;\nඑහෙත් සත්පුරුෂයන්ගේ ගුණ සුවඳ නම් හුළං එන දෙසටද යයි,\nසත්පුරුෂ තැනැත්තා සියලු දිශාවන්ට තම කීර්ති සුවඳ පතුරුවන්නේය.",
      "paliTitle": "Gandhajātasuttaṃ",
      "englishTitle": "The Nature of Fragrances Sutta",
      "sinhalaTitle": "ගන්ධජාත සූත්‍රය"
    },
    {
      "number": 81,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sammukhāmetaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ [sahassīlokadhātuṃ (pī.) saṃ. ni. 1.185 vitthāro] sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṃ sammāsambuddho kīvatakaṃ pahoti sarena viññāpetu’’nti? ‘‘Sāvako so, ānanda, appameyyā tathāgatā’’ti. Dutiyampi kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṃ sammāsambuddho kīvatakaṃ pahoti sarena viññāpetu’’nti? ‘‘Sāvako so, ānanda, appameyyā tathāgatā’’ti. Tatiyampi kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sammukhāmetaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṃ sammāsambuddho kīvatakaṃ pahoti sarena viññāpetu’’nti? ‘‘Sutā te, ānanda, sahassī cūḷanikā lokadhātū’’ti? ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo! Yaṃ bhagavā bhāseyya. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahānanda, suṇāhi sādhukaṃ manasi karohi, bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca – ‘‘Yāvatā, ānanda, candimasūriyā [candimasuriyā (sī. syā. kaṃ. pī.)] pariharanti, disā bhanti virocanā, tāva sahassadhā loko. Tasmiṃ sahassadhā loke sahassaṃ [tasmiṃ sahassaṃ (syā. kaṃ. pī.)] candānaṃ, sahassaṃ sūriyānaṃ, sahassaṃ sinerupabbatarājānaṃ, sahassaṃ jambudīpānaṃ, sahassaṃ aparagoyānānaṃ, sahassaṃ uttarakurūnaṃ, sahassaṃ pubbavidehānaṃ, cattāri mahāsamuddasahassāni, cattāri mahārājasahassāni, sahassaṃ cātumahārājikānaṃ, sahassaṃ tāvatiṃsānaṃ, sahassaṃ yāmānaṃ, sahassaṃ tusitānaṃ, sahassaṃ nimmānaratīnaṃ, sahassaṃ paranimmitavasavattīnaṃ, sahassaṃ brahmalokānaṃ – ayaṃ vuccatānanda, sahassī cūḷanikā lokadhātu. ‘‘Yāvatānanda, sahassī cūḷanikā lokadhātu tāva sahassadhā loko. Ayaṃ vuccatānanda, dvisahassī majjhimikā lokadhātu. ‘‘Yāvatānanda, dvisahassī majjhimikā lokadhātu tāva sahassadhā loko. Ayaṃ vuccatānanda, tisahassī mahāsahassī lokadhātu. ‘‘Ākaṅkhamāno, ānanda, tathāgato tisahassimahāsahassilokadhātuṃ [tisahassi mahāsahassiṃ lokadhātuṃ (syā. kaṃ.), tisahassīmahāsahassīlokadhātuṃ (pī.)] sarena viññāpeyya, yāvatā pana ākaṅkheyyā’’ti. ‘‘Yathā kathaṃ pana, bhante, bhagavā tisahassimahāsahassilokadhātuṃ sarena viññāpeyya, yāvatā pana ākaṅkheyyā’’ti? ‘‘Idhānanda, tathāgato tisahassimahāsahassilokadhātuṃ obhāsena phareyya. Yadā te sattā taṃ ālokaṃ sañjāneyyuṃ, atha tathāgato ghosaṃ kareyya saddamanussāveyya. Evaṃ kho, ānanda, tathāgato tisahassimahāsahassilokadhātuṃ sarena viññāpeyya, yāvatā pana ākaṅkheyyā’’ti. Evaṃ vutte āyasmā ānando (āyasmantaṃ udāyiṃ) [(bhagavantaṃ) (sī.), ( ) natthi syā. kaṃ. potthakesu. aṭṭhakathāya sameti] etadavoca – ‘‘lābhā vata me, suladdhaṃ vata me, yassa me satthā evaṃmahiddhiko evaṃmahānubhāvo’’ti. Evaṃ vutte āyasmā udāyī āyasmantaṃ ānandaṃ etadavoca – ‘‘kiṃ tuyhettha, āvuso ānanda, yadi te satthā evaṃmahiddhiko evaṃmahānubhāvo’’ti? Evaṃ vutte bhagavā āyasmantaṃ udāyiṃ etadavoca – ‘‘mā hevaṃ, udāyi, mā hevaṃ, udāyi. Sace, udāyi, ānando avītarāgo kālaṃ kareyya, tena cittappasādena sattakkhattuṃ devesu devarajjaṃ kāreyya, sattakkhattuṃ imasmiṃyeva jambudīpe mahārajjaṃ kāreyya. Api ca, udāyi, ānando diṭṭheva dhamme parinibbāyissatī’’ti. Dasamaṃ.",
      "english": "Then the Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down at one side.\n\nSitting at one side, the Venerable Ānanda said this to the Blessed One: “Venerable Sir, I heard this directly from the Blessed One, I received this directly: ‘Ānanda, Abhibhū, a disciple of the Buddha Sikhī, standing in the Brahma world, made his voice heard throughout a thousandfold world system.’ But Venerable Sir, the Blessed One, the Arahant, the Fully Self-Awakened One—how far is he capable of making his voice heard?”\n\n“He was only a disciple, Ānanda. The Tathāgatas are immeasurable.”\n\nFor a second time, the Venerable Ānanda said this to the Blessed One: “Venerable Sir, I heard this directly from the Blessed One, I received this directly: ‘Ānanda, Abhibhū, a disciple of the Buddha Sikhī, standing in the Brahma world, made his voice heard throughout a thousandfold world system.’ But Venerable Sir, the Blessed One, the Arahant, the Fully Self-Awakened One—how far is he capable of making his voice heard?”\n\n“He was only a disciple, Ānanda. The Tathāgatas are immeasurable.”\n\nFor a third time, the Venerable Ānanda said this to the Blessed One: “Venerable Sir, I heard this directly from the Blessed One, I received this directly: ‘Ānanda, Abhibhū, a disciple of the Buddha Sikhī, standing in the Brahma world, made his voice heard throughout a thousandfold world system.’ But Venerable Sir, the Blessed One, the Arahant, the Fully Self-Awakened One—how far is he capable of making his voice heard?”\n\n“Have you heard of the thousandfold minor world system, Ānanda?”\n\n“Now is the time, Blessed One; now is the time, Well-Farer! May the Blessed One speak. Hearing it from the Blessed One, the monks will bear it in mind.”\n\n“In that case, Ānanda, listen closely, pay careful attention, and I will speak.” “Yes, Venerable Sir,” replied the Venerable Ānanda to the Blessed One.\n\nThe Blessed One spoke this: “Ānanda, as far as the moon and sun revolve, illuminating the directions with their brightness—that is the extent of a thousandfold world. In that thousandfold world, there are a thousand moons, a thousand suns, a thousand king-of-mountains Sineru, a thousand Jambudīpas (Rose-Apple Continents), a thousand Aparagoyānas (Western Continents), a thousand Uttarakurus (Northern Continents), a thousand Pubbavidehas (Eastern Continents), four thousand great oceans, four thousand Great Kings, a thousand Cātumahārājika heavens, a thousand Tāvatiṃsa heavens, a thousand Yāma heavens, a thousand Tusita heavens, a thousand Nimmānaratī heavens, a thousand Paranimmitavasavattī heavens, and a thousand Brahma worlds. This, Ānanda, is called the thousandfold minor world system.\n\n“Ānanda, the region where the thousandfold minor world system extends—that system multiplied a thousand times—this, Ānanda, is called the twice-thousandfold medium world system.\n\n“Ānanda, the region where the twice-thousandfold medium world system extends—that system multiplied a thousand times—this, Ānanda, is called the thrice-thousandfold great-thousandfold world system.\n\n“If the Tathāgata wishes, Ānanda, he can make his voice heard throughout the thrice-thousandfold great-thousandfold world system, or as far as he might wish.”\n\n“But how, Venerable Sir, might the Blessed One make his voice heard throughout the thrice-thousandfold great-thousandfold world system, or as far as he might wish?”\n\n“Here, Ānanda, the Tathāgata projects a bright radiance throughout the thrice-thousandfold great-thousandfold world system. When those beings perceive that radiance, the Tathāgata then creates a sound, allowing the voice to be heard. This is how, Ānanda, the Tathāgata makes his voice heard throughout the thrice-thousandfold great-thousandfold world system, or as far as he might wish.”\n\nWhen this was said, the Venerable Ānanda exclaimed: “Indeed, it is a gain for me! Indeed, it is well gained for me, whose Teacher possesses such great power and such great magnificence!”\n\nWhen this was said, the Venerable Udāyī said to the Venerable Ānanda: “What concern is that of yours, friend Ānanda, if your Teacher possesses such great power and such great magnificence?”\n\nWhen this was said, the Blessed One said to the Venerable Udāyī: “Do not speak so, Udāyī. Do not speak so, Udāyī. If, Udāyī, Ānanda were to pass away while still having attachment, due to that purified mind he would rule as king of the gods seven times among the deities, and rule as a great king seven times on this very Jambudīpa. Moreover, Udāyī, Ānanda will attain Parinibbāna in this very life.”",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මා විසින් භාග්‍යවතුන් වහන්සේ ඉදිරියේම අසන ලද්දකි, ඉදිරියේම පිළිගන්නා ලද්දකි: ‘ආනන්දයෙනි, සිඛී භාග්‍යවතුන් වහන්සේගේ අභිභූ නම් ශ්‍රාවකයා බ්‍රහ්ම ලෝකයේ සිට සහස්‍රීය ලෝකධාතුව ශබ්දයෙන් දැනුම් දුන්නේය’ කියා. එසේ නම්, ස්වාමීනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේට ශබ්දයෙන් කොපමණ දුරක් දැනුම් දීමට හැකි වන්නේ දැයි?” “ආනන්දයෙනි, ඒ ශ්‍රාවකයෙකි; තථාගතවරුන්ගේ බලය අප්‍රමේය යි.”\n\nදෙවන වරටත් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මා විසින් භාග්‍යවතුන් වහන්සේ ඉදිරියේම අසන ලද්දකි, ඉදිරියේම පිළිගන්නා ලද්දකි: ‘ආනන්දයෙනි, සිඛී භාග්‍යවතුන් වහන්සේගේ අභිභූ නම් ශ්‍රාවකයා බ්‍රහ්ම ලෝකයේ සිට සහස්‍රීය ලෝකධාතුව ශබ්දයෙන් දැනුම් දුන්නේය’ කියා. එසේ නම්, ස්වාමීනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේට ශබ්දයෙන් කොපමණ දුරක් දැනුම් දීමට හැකි වන්නේ දැයි?” “ආනන්දයෙනි, ඒ ශ්‍රාවකයෙකි; තථාගතවරුන්ගේ බලය අප්‍රමේය යි.”\n\nතුන්වන වරටත් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මා විසින් භාග්‍යවතුන් වහන්සේ ඉදිරියේම අසන ලද්දකි, ඉදිරියේම පිළිගන්නා ලද්දකි: ‘ආනන්දයෙනි, සිඛී භාග්‍යවතුන් වහන්සේගේ අභිභූ නම් ශ්‍රාවකයා බ්‍රහ්ම ලෝකයේ සිට සහස්‍රීය ලෝකධාතුව ශබ්දයෙන් දැනුම් දුන්නේය’ කියා. එසේ නම්, ස්වාමීනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේට ශබ්දයෙන් කොපමණ දුරක් දැනුම් දීමට හැකි වන්නේ දැයි?”\n\n“ආනන්දයෙනි, ඔබ විසින් සහස්‍රීය චූලනිකා ලෝකධාතුව අසා තිබේ ද?”\n\n“භාග්‍යවතුන් වහන්ස, මේ සඳහා මෙය කාලයයි; සුගතයන් වහන්ස, මෙය කාලයයි! භාග්‍යවතුන් වහන්සේ එය දේශනා කළ මැනව. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූන් වහන්සේලා එය ධාරණය කර ගනු ඇත.”\n\n“එසේ නම් ආනන්දයෙනි, අසන්න, මනාව සිතට ගන්න. මම දේශනා කරන්නෙමි.”\n\n“එසේය, ස්වාමීනි” යි කියා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ මෙය පැවසූහ: “ආනන්දයෙනි, සඳුත්, හිරුත් හැසිරෙමින්, දස දිසාව බබළවමින් ආලෝකය පතුරුවා හරින ප්‍රමාණය කොපමණ ද, එපමණ දහස් ගුණයකින් යුත් ලෝකයකි. ඒ දහස් ගුණයකින් යුත් ලෝකයෙහි හඳවල් දහසක් ද, හිරුන් දහසක් ද, සිනේරු පර්වත රාජයන් දහසක් ද, ජම්බුද්වීපයන් දහසක් ද, අපරගෝයාන ද්වීපයන් දහසක් ද, උත්තරකුරු ද්වීපයන් දහසක් ද, පූර්වවිදේහ ද්වීපයන් දහසක් ද, මහා සාගරයන් දහස් සතරක් ද, මහ රජවරුන් දහස් සතරක් ද, චාතුම්මහාරාජික ලෝකයන් දහසක් ද, තාවතිංස ලෝකයන් දහසක් ද, යාම ලෝකයන් දහසක් ද, තුසිත ලෝකයන් දහසක් ද, නිර්මාණරති ලෝකයන් දහසක් ද, පරනිර්මිත වසවත්ති ලෝකයන් දහසක් ද, බ්‍රහ්ම ලෝකයන් දහසක් ද ඇත්තේ ය. ආනන්දයෙනි, මේ (පද්ධතිය) සහස්‍රීය චූලනිකා ලෝකධාතුව යැයි කියනු ලැබේ.\n\n“ආනන්දයෙනි, යම් ප්‍රමාණයක් සහස්‍රීය චූලනිකා ලෝකධාතුව වේ ද, එය එපමණ දහස් ගුණයකින් යුත් ලෝකයකි. ආනන්දයෙනි, මේ (පද්ධතිය) ද්විසහස්‍රීය මධ්‍යමිකා ලෝකධාතුව යැයි කියනු ලැබේ.\n\n“ආනන්දයෙනි, යම් ප්‍රමාණයක් ද්විසහස්‍රීය මධ්‍යමිකා ලෝකධාතුව වේ ද, එය එපමණ දහස් ගුණයකින් යුත් ලෝකයකි. ආනන්දයෙනි, මේ (පද්ධතිය) ත්‍රිසහස්‍රීය මහාසහස්‍රීය ලෝකධාතුව යැයි කියනු ලැබේ.\n\n“ආනන්දයෙනි, තථාගතයන් වහන්සේ කැමති වන්නේ නම්, ත්‍රිසහස්‍රීය මහාසහස්‍රීය ලෝකධාතුව ශබ්දයෙන් දැනුම් දිය හැකි ය; නැතහොත් කැමති ඕනෑම දුරක් දක්වා දැනුම් දිය හැකි ය.”\n\n“ස්වාමීනි, එසේ නම් භාග්‍යවතුන් වහන්සේ කෙසේ නම් ත්‍රිසහස්‍රීය මහාසහස්‍රීය ලෝකධාතුව ශබ්දයෙන් දැනුම් දෙන්නේ ද, නැතහොත් කැමති ඕනෑම දුරක් දක්වා දැනුම් දෙන්නේ ද?”\n\n“ආනන්දයෙනි, මෙහි දී තථාගතයන් වහන්සේ ත්‍රිසහස්‍රීය මහාසහස්‍රීය ලෝකධාතුව ආලෝකයෙන් පතුරුවා හරියි. යම් කලෙක ඒ සත්වයෝ ඒ ආලෝකය දැන ගනිත් ද, එවිට තථාගතයන් වහන්සේ හඬ නඟා ශබ්දය ඇසෙන්නට සලස්වයි. ආනන්දයෙනි, මෙලෙසින් තථාගතයන් වහන්සේ ත්‍රිසහස්‍රීය මහාසහස්‍රීය ලෝකධාතුව ශබ්දයෙන් දැනුම් දිය හැකි ය, නැතහොත් කැමති ඕනෑම දුරක් දක්වා දැනුම් දිය හැකි ය.”\n\nමෙසේ වදාළ විට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙසේ පැවසූහ: “මට ලාභයකි, මට මනාව ලැබුණේ ය, මාගේ ශාස්තෘන් වහන්සේ මෙසේ මහත් ඍද්ධියෙන් යුක්ත, මෙසේ මහත් ආනුභාව සම්පන්න වූයේ ද!”\n\nමෙසේ පැවසූ විට ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: “ඇවැත්නි ආනන්ද, ඔබගේ ශාස්තෘන් වහන්සේ මෙසේ මහත් ඍද්ධියෙන් යුක්ත, මෙසේ මහත් ආනුභාව සම්පන්න වුව ද, ඔබට ඉන් කවර ප්‍රයෝජනයක් ද?”\n\nමෙසේ පැවසූ විට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: “උදායි, එසේ නොකියන්න, උදායි, එසේ නොකියන්න. උදායි, යම් හෙයකින් ආනන්ද තෙම වීතරාගී නොවී කලුරිය කරන්නේ නම්, ඒ චිත්ත ප්‍රසාදය නිසා සත් වරක් දෙවියන් අතර දෙව්රජ කරන්නේ ය; සත් වරක් මේ ජම්බුද්වීපයෙහිම මහා රාජ්‍යය කරන්නේ ය. එපමණක් නොව, උදායි, ආනන්ද තෙම මේ දැක්වෙන ධර්මය තුළදීම පිරිනිවන් පාන්නේ ය.”\n\nදසවෙනි සූත්‍රයයි.",
      "paliTitle": "Cūḷanikāsuttaṃ",
      "englishTitle": "The Minor Sutta",
      "sinhalaTitle": "චූළනිකා සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Ānandavaggo tatiyo. Tassuddānaṃ – Channo ājīvako sakko, nigaṇṭho ca nivesako; Duve bhavā sīlabbataṃ, gandhajātañca cūḷanīti.",
    "english": "The third chapter on Ānanda. The summary of it: Channa, the Ājīvaka, Sakka, Nigaṇṭha, and the Settler; two on Existence, Virtue and Vow, Types of Fragrance, and Cūḷanī.",
    "sinhala": "තෙවන ආනන්ද වර්ගයයි. එහි උද්දානය නම්: ඡන්න, ආජීවක, සක්ක, නිගණ්ඨ, නිවේසක, භව දෙකක්, සීලබ්බත, ගන්ධජාත සහ චූළනී සූත්‍රයි."
  }
}