{
  "id": "an3.6",
  "title": {
    "pali": "Dutiyapaṇṇāsakaṃ - Brāhmaṇavaggo",
    "english": "The Second Fifties – The Chapter on Brahmins.",
    "sinhala": "දෙවෙනි පණ්ණාසකය - බ්‍රාහ්මණවග්ගය"
  },
  "sections": [
    {
      "number": 52,
      "pali": "Atha kho dve brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavatā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te brāhmaṇā bhagavantaṃ etadavocuṃ – ‘‘mayamassu, bho gotama, brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te camhā akatakalyāṇā akatakusalā akatabhīruttāṇā. Ovadatu no bhavaṃ gotamo, anusāsatu no bhavaṃ gotamo yaṃ amhākaṃ assa dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Taggha tumhe, brāhmaṇā, jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te cattha akatakalyāṇā akatakusalā akatabhīruttāṇā. Upanīyati kho ayaṃ, brāhmaṇā, loko jarāya byādhinā maraṇena. Evaṃ upanīyamāne kho, brāhmaṇā, loke jarāya byādhinā maraṇena, yo idha kāyena saṃyamo vācāya saṃyamo manasā saṃyamo, taṃ tassa petassa tāṇañca leṇañca dīpañca saraṇañca parāyaṇañcā’’ti. ‘‘Upanīyati jīvitamappamāyu, Jarūpanītassa na santi tāṇā; Etaṃ bhayaṃ maraṇe pekkhamāno, Puññāni kayirātha sukhāvahāni. ‘‘Yodha kāyena saṃyamo, vācāya uda cetasā; Taṃ tassa petassa sukhāya hoti, Yaṃ jīvamāno pakaroti puñña’’nti. [saṃ. ni. 1.100] paṭhamaṃ;",
      "english": "Now then, two brahmins, old, aged, advanced in years, having traveled far and reached the end of their years, a hundred and twenty years old by birth, approached where the Blessed One was. Having approached, they exchanged greetings with the Blessed One. Having concluded a courteous and amiable conversation, they sat down to one side.\n\nSeated to one side, those brahmins then said this to the Blessed One: \"Good sir Gotama, we are indeed brahmins, old, aged, advanced in years, having traveled far and reached the end of our years, a hundred and twenty years old by birth. But we have not done what is noble, we have not done what is wholesome, we have not made for ourselves a protection from danger. Let good sir Gotama instruct us, let good sir Gotama admonish us, that which would be for our long-term welfare and happiness.\" \"Indeed, brahmins, you are old, aged, advanced in years, having traveled far and reached the end of your years, a hundred and twenty years old by birth. And yet you have not done what is noble, have not done what is wholesome, have not made for yourselves a protection from danger. Indeed, brahmins, this world is drawn onwards by old age, by sickness, by death. Indeed, brahmins, when the world is thus drawn onwards by old age, by sickness, by death, that which here is restraint in body, restraint in speech, and restraint in mind, that, for the one who has passed away, is a protection, a shelter, an island, a refuge, and a final resort.\"\n\n\"Life is drawn onwards, with little lifespan. For one led on by old age, there are no protections. Observing this danger in death, one should do wholesome deeds that bring happiness.\n\n\"That which here is restraint in body, or in speech, or in mind, that, for the one who has passed away, is for happiness; that which, while living, one performs as wholesome deeds.\"",
      "sinhala": "ඉන්පසු ඉතාම මහලු, වියපත් වූ, ජීවිතයේ අවසන් භාගයට පැමිණි, වයස අවුරුදු එකසිය විස්සක් වූ බමුණන් දෙදෙනෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු සාමිචියෙහි යෙදුණාහ. සුහද කථා බස් හුවමාරු කරගෙන එක් පසෙක වාඩි වූහ.\n\nඑක් පසෙක වාඩි වී සිටි ඒ බමුණෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ – “භවත් ගෞතමයින් වහන්ස, අපි ඉතාම මහලු වූ, වියපත් වූ, ජීවිතයේ අවසන් භාගයට පැමිණි, වයස අවුරුදු එකසිය විස්සක් වූ බමුණෝ වෙමු. ඒ අපි මෙතෙක් කිසිදු යහපත් ක්‍රියාවක් හෝ කුසලයක් නොකළ, සසර බියෙන් ආරක්‍ෂා වන පිහිටක් හෝ රැකවරණයක් නොසපයාගත් පිරිසක් වෙමු. භවත් ගෞතමයින් වහන්ස, අපට බොහෝ කලක් හිතසුව පිණිස වන පරිදි අවවාද කළ මැනව, අනුශාසනා කළ මැනව.”\n\n“බමුණෙනි, සැබවින්ම නුඹලා ඉතාම මහලු වූ, වියපත් වූ, ජීවිතයේ අවසන් භාගයට පැමිණි, වයස අවුරුදු එකසිය විස්සක් වූ පිරිසක් වෙති. තවද, ඒ නුඹලා කිසිදු යහපත් ක්‍රියාවක් හෝ කුසලයක් නොකළ, සසර බියෙන් ආරක්‍ෂා වන පිහිටක් හෝ රැකවරණයක් නොසපයාගත් පිරිසක් වෙති. බමුණෙනි, සැබවින්ම මේ ලෝකය ජරාවෙන්ද, ව්‍යාධියෙන්ද, මරණයෙන්ද නිරන්තරයෙන් වෙලා ගනු ලබයි. බමුණෙනි, මෙසේ ලෝකය ජරාවෙන්ද, ව්‍යාධියෙන්ද, මරණයෙන්ද නිරන්තරයෙන් වෙලා ගනු ලබද්දී, මේ ලෝකයෙහි යම් කෙනෙක් කයින් සංවර වී, වචනයෙන් සංවර වී, සිතින් සංවර වන්නේද, එය පරලෝකයට යන ඒ පුද්ගලයාට පිහිටක්ද, රැකවරණයක්ද, පහන් ආලෝකයක්ද, සරණක්ද, පරම ගතියක්ද වන්නේය.”\n\n“ජීවිතය කෙටි වන අතර, ආයුෂයද ගෙවී යයි.\nජරාවෙන් වෙලී සිටින්නන්ට පිහිටක් නැත;\nමරණයෙහි ඇති මේ භයානක ස්වභාවය දකිමින්,\nසැප ගෙන දෙන්නා වූ පින්කම් කළ යුතුය.\n\nමේ ලෝකයෙහි යම් කෙනෙක් කයින්, වචනයෙන් හෝ සිතින් සංවර වේද;\nජීවත්ව සිටියදීම යම් කුසලයක් කරන්නේද,\nඑය පරලෝකයට යන ඒ පුද්ගලයාට සැප පිණිස වන්නේය.”",
      "paliTitle": "Paṭhamadvebrāhmaṇasuttaṃ"
    },
    {
      "number": 53,
      "pali": "Atha kho dve brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te brāhmaṇā bhagavantaṃ etadavocuṃ – ‘‘mayamassu, bho gotama, brāhmaṇā jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te camhā akatakalyāṇā akatakusalā akatabhīruttāṇā. Ovadatu no bhavaṃ gotamo, anusāsatu no bhavaṃ gotamo yaṃ amhākaṃ assa dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Taggha tumhe, brāhmaṇā, jiṇṇā vuddhā mahallakā addhagatā vayoanuppattā vīsavassasatikā jātiyā; te cattha akatakalyāṇā akatakusalā akatabhīruttāṇā. Āditto kho ayaṃ, brāhmaṇā, loko jarāya byādhinā maraṇena. Evaṃ āditte kho, brāhmaṇā, loke jarāya byādhinā maraṇena, yo idha kāyena saṃyamo vācāya saṃyamo manasā saṃyamo, taṃ tassa petassa tāṇañca leṇañca dīpañca saraṇañca parāyaṇañcā’’ti. ‘‘Ādittasmiṃ agārasmiṃ, yaṃ nīharati bhājanaṃ; Taṃ tassa hoti atthāya, no ca yaṃ tattha ḍayhati. ‘‘Evaṃ āditto kho [evaṃ ādīvito (sī. pī.), evaṃ ādittako (syā. kaṃ.) saṃ. ni. 1.41] loko, jarāya maraṇena ca; Nīharetheva dānena, dinnaṃ hoti sunīhataṃ [sunibbhataṃ (ka.)]. ‘‘Yodha kāyena saṃyamo, vācāya uda cetasā; Taṃ tassa petassa sukhāya hoti, Yaṃ jīvamāno pakaroti puñña’’nti. dutiyaṃ;",
      "english": "Then, two brahmins, aged, old, advanced in years, having reached the end of their lifespan, having attained old age, a hundred and twenty years old by birth, approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side.\n\nSeated to one side, those brahmins said this to the Blessed One: \"We, Venerable Gotama, are brahmins, aged, old, advanced in years, having reached the end of our lifespan, having attained old age, a hundred and twenty years old by birth. And we have not done what is wholesome, not done what is skillful, not created a refuge from fear. May Venerable Gotama advise us, may Venerable Gotama instruct us, for our long-term welfare and happiness.\"\n\n\"Indeed, brahmins, you are aged, old, advanced in years, having reached the end of your lifespan, having attained old age, a hundred and twenty years old by birth. And you have not done what is wholesome, not done what is skillful, not created a refuge from fear. This world, brahmins, is aflame with aging, sickness, and death. When the world is thus aflame, brahmins, with aging, sickness, and death, whoever here has self-restraint in body, self-restraint in speech, self-restraint in mind, for that departed one, this serves as protection, shelter, an island, a refuge, and a final resort.\"\n\n\"When a house is ablaze,\nWhatever vessel one carries out,\nThat is of benefit to them,\nNot what burns up inside.\n\nSimilarly, this world is aflame\nWith aging and death.\nOne should carry out (valuables) through generosity,\nWhat is given is well carried out.\n\nWhoever here has self-restraint in body,\nOr in speech, or in mind—\nThat is for the happiness of that departed one,\nWhatever merit one performs while alive.\"",
      "sinhala": "ඉන්පසු මහලු වූ, වයසට ගිය, ප්‍රවෘද්ධ වූ, ආයුෂය ගෙවී ගිය, වයසට පැමිණි, උපතින් සියවස ඉක්මවූ බමුණන් දෙදෙනෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ බමුණෝ භාග්‍යවතුන් වහන්සේට මෙය කීහ: ‘‘භවත් ගෞතමයන් වහන්ස, අපි බමුණෝ මහලු වූ, වයසට ගිය, ප්‍රවෘද්ධ වූ, ආයුෂය ගෙවී ගිය, වයසට පැමිණි, උපතින් සියවස ඉක්මවූ අය වෙමු. එහෙත් අපි යහපත් ක්‍රියා නොකළ, කුසල් දහම් නොකළ, භයෙන් මිදීමට පිණිස රැකවරණයක් නොකළ අය වෙමු. භවත් ගෞතමයන් වහන්සේ අපට අවවාද දෙන සේක්වා, භවත් ගෞතමයන් වහන්සේ අපට අනුශාසනා දෙන සේක්වා. ඒ අනුශාසනා අපට දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේ ය.’’\n\n‘‘බමුණෙනි, නියත වශයෙන් ම ඔබලා මහලු වූ, වයසට ගිය, ප්‍රවෘද්ධ වූ, ආයුෂය ගෙවී ගිය, වයසට පැමිණි, උපතින් සියවස ඉක්මවූ අය වෙති. එහෙත් ඔබලා යහපත් ක්‍රියා නොකළ, කුසල් දහම් නොකළ, භයෙන් මිදීමට පිණිස රැකවරණයක් නොකළ අය වෙති. බමුණෙනි, මේ ලෝකය ජරාවෙන්, ව්‍යාධියෙන්, මරණයෙන් දැවෙන්නේ ය. බමුණෙනි, මෙසේ ජරාවෙන්, ව්‍යාධියෙන්, මරණයෙන් දැවෙන ලෝකයේ, යමෙක් මේ සස්නෙහි කයින් සංයමයත්, වචනයෙන් සංයමයත්, සිතින් සංයමයත් පුරුදු කරයි ද, එය ඔහුට පරලොවදී රැකවරණය ද, පිහිට ද, ආලෝකය ද, සරණය ද, පරම පිහිට ද වන්නේ ය.’’\n\n‘‘දැවෙන ගෙයක, යම් භාජනයක් පිටතට ගනී ද, එය ඔහුට ප්‍රයෝජනවත් වේ. එතැනදී දැවෙන දේ ප්‍රයෝජනවත් නොවේ.\n\nමෙලෙස ම මේ ලෝකය ජරාවෙන් හා මරණයෙන් දැවෙන්නේ ය. දානයෙන් ම එය (තමාට වටිනා දේ) පිටතට ගන්නේ ය. දෙන ලද දේ මනා කොට තැන්පත් කරනු ලැබේ.\n\nයමෙක් මෙලොව කයින් සංයමයත්, වචනයෙන් හෝ සිතින් සංයමයත් පුරුදු කරයි ද, ජීවත්ව සිටියදී ඔහු කරන ඒ පින ම ඔහුට පරලොවදී සුව පිණිස වේ.",
      "paliTitle": "Dutiyadvebrāhmaṇasuttaṃ"
    },
    {
      "number": 54,
      "pali": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi…pe… ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhiko dhammo sandiṭṭhiko dhammo’ti, bho gotama, vuccati. Kittāvatā nu kho, bho gotama, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko [opanayiko (sī. syā. kaṃ. pī.) pañcamasuttassa ṭīkā oloketabbā] paccattaṃ veditabbo viññūhī’’ti? ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. (Ratto kho…pe… kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. Rāge pahīnā neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Ratto kho…pe… attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti. Rāge pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti.) [( ) etthantare pāṭho sī. syā. kaṃ. pī. potthakesu na dissati, idhapi duṭṭhamūḷhavāresu] Evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti…pe…. ‘‘Duṭṭho kho, brāhmaṇa, dosena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Dose pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikampi [na cetasikaṃ (sī. syā. ka.)] dukkhaṃ domanassaṃ paṭisaṃvedeti. Evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti…pe…. ‘‘Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Evaṃ kho, brāhmaṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Tatiyaṃ.",
      "english": "Then a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. When the polite and friendly talk was concluded, he sat down to one side and said to the Blessed One:\n\n\"It is said, Master Gotama, 'The Dhamma is directly verifiable; the Dhamma is directly verifiable.' To what extent, Master Gotama, is the Dhamma directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise?\"\n\n\"Brahmin, one who is affected by lust, overcome by passion, with mind obsessed, contemplates harm to oneself, contemplates harm to others, contemplates harm to both, and experiences mental suffering and distress. When passion is abandoned, one does not contemplate harm to oneself, does not contemplate harm to others, does not contemplate harm to both, and does not experience mental suffering or distress. Thus, brahmin, the Dhamma is directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise.\"\n\n\"Brahmin, one who is affected by aversion, overcome by hatred, with mind obsessed, contemplates harm to oneself, contemplates harm to others, contemplates harm to both, and experiences mental suffering and distress. When hatred is abandoned, one does not contemplate harm to oneself, does not contemplate harm to others, does not contemplate harm to both, and does not experience mental suffering or distress. Thus, brahmin, the Dhamma is directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise.\"\n\n\"Brahmin, one who is affected by delusion, overcome by ignorance, with mind obsessed, contemplates harm to oneself, contemplates harm to others, contemplates harm to both, and experiences mental suffering and distress. When delusion is abandoned, one does not contemplate harm to oneself, does not contemplate harm to others, does not contemplate harm to both, and does not experience mental suffering or distress. In this way, brahmin, the Dhamma is directly verifiable, immediate, inviting one to come and see, leading inwards, and to be personally experienced by the wise.\"\n\n\"Excellent, Master Gotama! Excellent, Master Gotama! Just as, Master Gotama, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or carry an oil lamp in the darkness so that those with eyes might see forms; in the same way, the Dhamma has been made clear by Master Gotama in manifold ways. I go for refuge to Master Gotama, and to the Dhamma, and to the Sangha of monastics. May Master Gotama remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "එවිට එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. ආදරයෙන් කතා බස් කොට, එක් පසෙක වාඩි වූ ඒ බ්‍රාහ්මණයෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: ‘‘‘ධර්මය මේ ආත්මභාවයේදීම පල දෙන සුළුය, ධර්මය මේ ආත්මභාවයේදීම පල දෙන සුළුය’ යැයි, භවත් ගෞතමයන් වහන්ස, කියනු ලැබේ. භවත් ගෞතමයන් වහන්ස, කොපමණකින්ද මේ ධර්මය තමා විසින්ම දැකිය හැකි (සන්දිඨ්ඨික), කල් නොයවා පලදෙන (අකාලික), ‘එව බලව’ යැයි ආරාධනා කළ හැකි (ඒහිපස්සික), නිවනට මඟ පෙන්වන (ඕපනයික), ප්‍රඥාවන්තයින් විසින් තම තමා තුළින්ම අත්දැකිය හැකි (පච්චත්තං වේදිතබ්බ) ධර්මයක් වන්නේ?’’\n\n‘‘බ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ සිතක් ඇති පුද්ගලයා තමාටත් විපත් පමුණුවීමට සිතයි, අනුන්ටත් විපත් පමුණුවීමට සිතයි, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතයි, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳියි. රාගය ප්‍රහීණ වූ විට තමාටත් විපත් පමුණුවීමට සිතන්නේ නැත, අනුන්ටත් විපත් පමුණුවීමට සිතන්නේ නැත, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතන්නේ නැත, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳින්නේ නැත. බ්‍රාහ්මණය, මෙසේද මේ ධර්මය තමා විසින්ම දැකිය හැකි ධර්මයක් වන්නේය… (ආදී වශයෙන්).’’\n\n‘‘බ්‍රාහ්මණය, ද්වේෂයෙන් මත් වූ, ද්වේෂයෙන් යටපත් වූ සිතක් ඇති පුද්ගලයා තමාටත් විපත් පමුණුවීමට සිතයි, අනුන්ටත් විපත් පමුණුවීමට සිතයි, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතයි, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳියි. ද්වේෂය ප්‍රහීණ වූ විට තමාටත් විපත් පමුණුවීමට සිතන්නේ නැත, අනුන්ටත් විපත් පමුණුවීමට සිතන්නේ නැත, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතන්නේ නැත, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳින්නේ නැත. බ්‍රාහ්මණය, මෙසේද මේ ධර්මය තමා විසින්ම දැකිය හැකි ධර්මයක් වන්නේය… (ආදී වශයෙන්).’’\n\n‘‘බ්‍රාහ්මණය, මෝහයෙන් මත් වූ, මෝහයෙන් යටපත් වූ සිතක් ඇති පුද්ගලයා තමාටත් විපත් පමුණුවීමට සිතයි, අනුන්ටත් විපත් පමුණුවීමට සිතයි, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතයි, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳියි. මෝහය ප්‍රහීණ වූ විට තමාටත් විපත් පමුණුවීමට සිතන්නේ නැත, අනුන්ටත් විපත් පමුණුවීමට සිතන්නේ නැත, තමාටත් අනුන්ටත් යන දෙපිරිසටම විපත් පමුණුවීමට සිතන්නේ නැත, චෛතසික දුක්ඛ දෝමනස්සයන් අත්විඳින්නේ නැත. බ්‍රාහ්මණය, මෙසේ මේ ධර්මය තමා විසින්ම දැකිය හැකි (සන්දිඨ්ඨික), කල් නොයවා පලදෙන (අකාලික), ‘එව බලව’ යැයි ආරාධනා කළ හැකි (ඒහිපස්සික), නිවනට මඟ පෙන්වන (ඕපනයික), ප්‍රඥාවන්තයින් විසින් තම තමා තුළින්ම අත්දැකිය හැකි (පච්චත්තං වේදිතබ්බ) ධර්මයක් වන්නේය.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, යමෙක් පෙරළා තිබූ දෙයක් නැවත පෙරළා තබන්නාක් මෙන් හෝ, වසා තිබූ දෙයක් විවෘත කරන්නාක් මෙන් හෝ, මඟ වැරදුණු අයෙකුට මඟ පෙන්වන්නාක් මෙන් හෝ, අඳුරෙහි තෙල් පහනක් දරන්නාක් මෙන් ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යැයි පවසන්නාක් මෙන් භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය දේශනා කරන ලදී. මම ඒ භවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Aññatarabrāhmaṇasuttaṃ"
    },
    {
      "number": 55,
      "pali": "Atha kho aññataro brāhmaṇaparibbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe… ekamantaṃ nisinno kho so brāhmaṇaparibbājako bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhiko dhammo sandiṭṭhiko dhammo’ti, bho gotama, vuccati. Kittāvatā nu kho, bho gotama, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti? ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. Rāge pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti. Rāge pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti…pe…. ‘‘Duṭṭho kho, brāhmaṇa, dosena…pe… mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. ‘‘Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto, kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. Mohe pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. ‘‘Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti. Mohe pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Evaṃ kho, brāhmaṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Catutthaṃ.",
      "english": "Then a certain wandering ascetic of the Brāhmaṇa caste approached the Blessed One; having approached, exchanged greetings with the Blessed One, and having conversed in a friendly and courteous manner, sat down to one side. As he sat to one side, that wandering ascetic said to the Blessed One: \"The Dhamma is said to be 'directly visible, directly visible', good Master Gotama. To what extent, good Master Gotama, is the Dhamma directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves?\"\n\n\"Corrupted, Brāhmaṇa, by greed, one who is overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, intends harm to both, and experiences mental pain and distress. When greed is abandoned, one does not intend harm to oneself, does not intend harm to others, does not intend harm to both, and does not experience mental pain and distress.\n\nCorrupted, Brāhmaṇa, by greed, one who is overwhelmed and obsessed in mind, engages in misconduct by body, engages in misconduct by speech, engages in misconduct by mind. When greed is abandoned, one does not engage in misconduct by body, does not engage in misconduct by speech, and does not engage in misconduct by mind.\n\nCorrupted, Brāhmaṇa, by greed, one who is overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When greed is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. In this way, Brāhmaṇa, the Dhamma is directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves.\n\nCorrupted, Brāhmaṇa, by hatred, one who is overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, intends harm to both, and experiences mental pain and distress. When hatred is abandoned, one does not intend harm to oneself, does not intend harm to others, does not intend harm to both, and does not experience mental pain and distress.\n\nCorrupted, Brāhmaṇa, by hatred, one who is overwhelmed and obsessed in mind, engages in misconduct by body, engages in misconduct by speech, engages in misconduct by mind. When hatred is abandoned, one does not engage in misconduct by body, does not engage in misconduct by speech, and does not engage in misconduct by mind.\n\nCorrupted, Brāhmaṇa, by hatred, one who is overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When hatred is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. In this way, Brāhmaṇa, the Dhamma is directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves.\n\nCorrupted, Brāhmaṇa, by delusion, one who is overwhelmed and obsessed in mind, intends harm to oneself, intends harm to others, intends harm to both, and experiences mental pain and distress. When delusion is abandoned, one does not intend harm to oneself, does not intend harm to others, does not intend harm to both, and does not experience mental pain and distress.\n\nCorrupted, Brāhmaṇa, by delusion, one who is overwhelmed and obsessed in mind, engages in misconduct by body, engages in misconduct by speech, engages in misconduct by mind. When delusion is abandoned, one does not engage in misconduct by body, does not engage in misconduct by speech, and does not engage in misconduct by mind.\n\nCorrupted, Brāhmaṇa, by delusion, one who is overwhelmed and obsessed in mind, does not understand one's own welfare as it truly is, does not understand the welfare of others as it truly is, and does not understand the welfare of both as it truly is. When delusion is abandoned, one understands one's own welfare as it truly is, understands the welfare of others as it truly is, and understands the welfare of both as it truly is. In this way, Brāhmaṇa, the Dhamma is directly visible, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise, each for themselves.\"\n\n\"Excellent, good Master Gotama! Excellent! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes could see forms – in the same way has Master Gotama made the Dhamma clear in many ways. May Master Gotama remember me as a lay follower who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "එකල්හි එක්තරා බ්‍රාහ්මණ පරිබ්‍රාජකයෙක් භාග්‍ය\\u200Dවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ එක්පසෙක වාඩි වී භාග්‍ය\\u200Dවතුන් වහන්සේට මෙය පැවසුවේය: \"භවත් ගෞතමයන් වහන්ස, 'මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමානයි, මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමානයි' යැයි කියනු ලැබේ. භවත් ගෞතමයන් වහන්ස, කෙතරම් අයුරකින්ද මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමාන, කාලයට අයත් නොවූ, 'එන්න, බලන්න' යැයි ආරාධනා කළ හැකි, නිවන් මගට යොමුකරවන, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කළ යුතු වන්නේ?\"\n\n\"බ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාට හිංසා කිරීම පිණිසද සිතයි, අනුන්ට හිංසා කිරීම පිණිසද සිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද සිතයි, මානසික දුක්ඛයද, දොම්නසද විඳියි. රාගය ප්‍ර\\u200Dහීණ වූ විට තමාට හිංසා කිරීම පිණිසද නොසිතයි, අනුන්ට හිංසා කිරීම පිණිසද නොසිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද නොසිතයි, මානසික දුක්ඛයද, දොම්නසද නොවිඳියි.\nබ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. රාගය ප්‍ර\\u200Dහීණ වූ විට කයින් දුසිරිත් නොකරයි, වචනයෙන් දුසිරිත් නොකරයි, සිතින් දුසිරිත් නොකරයි.\nබ්‍රාහ්මණය, රාගයෙන් මත් වූ, රාගයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාගේ යහපතද ඇති සැටියෙන් නොදෙකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් නොදෙකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් නොදෙකියි. රාගය ප්‍ර\\u200Dහීණ වූ විට තමාගේ යහපතද ඇති සැටියෙන් දකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් දකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් දකියි. බ්‍රාහ්මණය, මෙලෙසින්ද මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමාන, කාලයට අයත් නොවූ, 'එන්න, බලන්න' යැයි ආරාධනා කළ හැකි, නිවන් මගට යොමුකරවන, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කළ යුතු වන්නේය.\n\nබ්‍රාහ්මණය, ද්වේෂයෙන් දූෂිත වූ පුද්ගලයාද... බ්‍රාහ්මණය, මෝහයෙන් මුළා වූ, මෝහයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාට හිංසා කිරීම පිණිසද සිතයි, අනුන්ට හිංසා කිරීම පිණිසද සිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද සිතයි, මානසික දුක්ඛයද, දොම්නසද විඳියි. මෝහය ප්‍ර\\u200Dහීණ වූ විට තමාට හිංසා කිරීම පිණිසද නොසිතයි, අනුන්ට හිංසා කිරීම පිණිසද නොසිතයි, දෙදෙනාටම හිංසා කිරීම පිණිසද නොසිතයි, මානසික දුක්ඛයද, දොම්නසද නොවිඳියි.\nබ්‍රාහ්මණය, මෝහයෙන් මුළා වූ, මෝහයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. මෝහය ප්‍ර\\u200Dහීණ වූ විට කයින් දුසිරිත් නොකරයි, වචනයෙන් දුසිරිත් නොකරයි, සිතින් දුසිරිත් නොකරයි.\nබ්‍රාහ්මණය, මෝහයෙන් මුළා වූ, මෝහයෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍ර\\u200Dහණය කරගත් පුද්ගලයා තමාගේ යහපතද ඇති සැටියෙන් නොදෙකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් නොදෙකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් නොදෙකියි. මෝහය ප්‍ර\\u200Dහීණ වූ විට තමාගේ යහපතද ඇති සැටියෙන් දකියි, අනුන්ගේ යහපතද ඇති සැටියෙන් දකියි, දෙදෙනාගේම යහපතද ඇති සැටියෙන් දකියි. බ්‍රාහ්මණය, මෙලෙසින්ම මේ ධර්ම\\u200Dය ස්වයංව දෘශ්‍යමාන, කාලයට අයත් නොවූ, 'එන්න, බලන්න' යැයි ආරාධනා කළ හැකි, නිවන් මගට යොමුකරවන, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කළ යුතු වන්නේය.\"\n\n\"භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! යටිකුරු කළ දෙයක් උඩුකුරු කරන්නාක් මෙන්ද, වසා තැබූ දෙයක් විවෘත කරන්නාක් මෙන්ද, මංමුළා වූවෙකුට මග පෙන්වන්නාක් මෙන්ද, අන්ධකාරයේ තෙල් පහනක් දරන්නාක් මෙන්ද, ඇස් ඇත්තෝ රූප දකිනවා යැයි කියන්නාක් මෙන්ද, භාග්‍ය\\u200Dවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්ම\\u200Dය ප්‍ර\\u200Dකාශ කරන ලදී. භවත් ගෞතමයන් වහන්ස, මම භාග්‍ය\\u200Dවතුන් වහන්සේද, ධර්ම\\u200Dයද, සංඝයාද සරණ යමි. අද පටන් දිවි තිබෙන තුරා සරණ ගිය උපාසකයෙකු ලෙස මා භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Paribbājakasuttaṃ"
    },
    {
      "number": 56,
      "pali": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhikaṃ nibbānaṃ sandiṭṭhikaṃ nibbāna’nti, bho gotama, vuccati. Kittāvatā nu kho, bho gotama, sandiṭṭhikaṃ nibbānaṃ hoti akālikaṃ ehipassikaṃ opaneyyikaṃ paccattaṃ veditabbaṃ viññūhī’’ti? ‘‘Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Evampi kho, brāhmaṇa, sandiṭṭhikaṃ nibbānaṃ hoti. ‘‘Duṭṭho kho, brāhmaṇa…pe… mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Evampi kho, brāhmaṇa, sandiṭṭhikaṃ nibbānaṃ hoti. ‘‘Yato kho ayaṃ, brāhmaṇa [yato ca kho ayaṃ brāhmaṇa (sī.), yato kho brāhmaṇa akālikaṃ ehipassikaṃ opaneyyikaṃ paccattaṃ veditabbaṃ (ka.)], anavasesaṃ rāgakkhayaṃ paṭisaṃvedeti, anavasesaṃ dosakkhayaṃ paṭisaṃvedeti, anavasesaṃ mohakkhayaṃ paṭisaṃvedeti; evaṃ kho, brāhmaṇa, sandiṭṭhikaṃ nibbānaṃ hoti akālikaṃ ehipassikaṃ opaneyyikaṃ paccattaṃ veditabbaṃ viññūhī’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ.",
      "english": "Then the brahmin Jāṇussoṇi approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, the brahmin Jāṇussoṇi said to the Blessed One: \"It is said, Master Gotama, 'Nibbāna visible in this very life, Nibbāna visible in this very life.' To what extent, Master Gotama, is Nibbāna visible in this very life, immediate, inviting verification, leading inwards, to be known individually by the wise?\"\n\n\"Indeed, brahmin, one who is obsessed with lust, whose mind is overwhelmed and consumed by lust, thinks of harming himself, thinks of harming others, thinks of harming both, and experiences mental suffering and distress. When lust is abandoned, he does not think of harming himself, nor of harming others, nor of harming both, nor does he experience mental suffering and distress. Thus, brahmin, is Nibbāna visible in this very life.\"\n\n\"Indeed, brahmin, one who is filled with hatred, whose mind is overwhelmed and consumed by hatred, thinks of harming himself, thinks of harming others, thinks of harming both, and experiences mental suffering and distress. When hatred is abandoned, he does not think of harming himself, nor of harming others, nor of harming both, nor does he experience mental suffering and distress. Thus, brahmin, is Nibbāna visible in this very life. Indeed, brahmin, one who is deluded, whose mind is overwhelmed and consumed by delusion, thinks of harming himself, thinks of harming others, of harming both, and experiences mental suffering and distress. When delusion is abandoned, he does not think of harming himself, nor of harming others, nor of harming both, nor does he experience mental suffering and distress. Thus, brahmin, is Nibbāna visible in this very life.\"\n\n\"When, brahmin, one experiences the complete eradication of lust, the complete eradication of hatred, and the complete eradication of delusion, without remainder; in this way, brahmin, Nibbāna is visible in this very life, immediate, inviting verification, leading inwards, to be known individually by the wise.\"\n\n\"Excellent, Master Gotama! Excellent! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to bring a lamp into the darkness for those with eyes to see forms – even so has Master Gotama made the Dhamma clear in many ways. I go for refuge to Master Gotama, to the Dhamma, and to the Sangha of monks. Let Master Gotama remember me as a lay follower who has taken refuge from this day forward as long as life lasts.\"",
      "sinhala": "එවිට ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘භවත් ගෞතමයන් වහන්ස, ‘මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය, මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය’ යැයි කියනු ලැබේ. භවත් ගෞතමයන් වහන්ස, කොපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය කාලයක් නොයවාම, ‘එන්න, බලන්න’ යැයි පෙන්විය හැකි, තමා වෙතට කැඳවා ගත හැකි, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැකිය හැකි නිර්වාණයක් වන්නේ?’’\n\n‘‘බ්‍රාහ්මණය, රාගයෙන් පෙලී, රාගයෙන් යටපත් වී, සිත මුලාවට පත් වූ තැනැත්තා තමාටද පීඩා කිරීමට සිතයි, අනුන්ටද පීඩා කිරීමට සිතයි, තමාටත් අනුන්ටත් දෙපිරිසටම පීඩා කිරීමට සිතයි, මානසික දුකක් හා දොම්නසක් අත්විඳියි. රාගය ප්‍‍රහීණ කළ කල්හි ඔහු තමාට පීඩා කිරීමට නොසිතයි, අනුන්ට පීඩා කිරීමට නොසිතයි, දෙපිරිසටම පීඩා කිරීමට නොසිතයි, මානසික දුකක් හා දොම්නසක් අත්නොවිඳියි. බ්‍රාහ්මණය, මෙපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය වන්නේය.\n\nදෝසයෙන් පෙලී, දෝසයෙන් යටපත් වී, සිත මුලාවට පත් වූ තැනැත්තා තමාටද පීඩා කිරීමට සිතයි, අනුන්ටද පීඩා කිරීමට සිතයි, තමාටත් අනුන්ටත් දෙපිරිසටම පීඩා කිරීමට සිතයි, මානසික දුකක් හා දොම්නසක් අත්විඳියි. දෝසය ප්‍‍රහීණ කළ කල්හි ඔහු තමාට පීඩා කිරීමට නොසිතයි, අනුන්ට පීඩා කිරීමට නොසිතයි, දෙපිරිසටම පීඩා කිරීමට නොසිතයි, මානසික දුකක් හා දොම්නසක් අත්නොවිඳියි. බ්‍රාහ්මණය, මෙපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය වන්නේය.\n\nමෝහයෙන් පෙලී, මෝහයෙන් යටපත් වී, සිත මුලාවට පත් වූ තැනැත්තා තමාටද පීඩා කිරීමට සිතයි, අනුන්ටද පීඩා කිරීමට සිතයි, තමාටත් අනුන්ටත් දෙපිරිසටම පීඩා කිරීමට සිතයි, මානසික දුකක් හා දොම්නසක් අත්විඳියි. මෝහය ප්‍‍රහීණ කළ කල්හි ඔහු තමාට පීඩා කිරීමට නොසිතයි, අනුන්ට පීඩා කිරීමට නොසිතයි, දෙපිරිසටම පීඩා කිරීමට නොසිතයි, මානසික දුකක් හා දොම්නසක් අත්නොවිඳියි. බ්‍රාහ්මණය, මෙපමණකින්ද මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය වන්නේය.\n\n‘‘බ්‍රාහ්මණය, යම් හෙයකින් යම් පුද්ගලයෙක් ඉතිරි නොකොට රාගයේ ක්ෂයවීම අත්විඳින්නේද, ඉතිරි නොකොට දෝසයේ ක්ෂයවීම අත්විඳින්නේද, ඉතිරි නොකොට මෝහයේ ක්ෂයවීම අත්විඳින්නේද; බ්‍රාහ්මණය, මෙපමණකින් මේ ආත්මභාවයේදී දැකිය හැකි නිර්වාණය, කාලයක් නොයවාම, ‘එන්න, බලන්න’ යැයි පෙන්විය හැකි, තමා වෙතට කැඳවා ගත හැකි, නුවණැත්තන් විසින් තමා තුළින්ම අත්දැකිය හැකි නිර්වාණයක් වන්නේය’’යි වදාළ සේක.\n\n‘‘භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා සලකන සේක්වා!’’",
      "paliTitle": "Nibbutasuttaṃ"
    },
    {
      "number": 57,
      "pali": "Atha kho aññataro brāhmaṇamahāsālo yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho so brāhmaṇamahāsālo bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama, pubbakānaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘pubbe sudaṃ [pubbassudaṃ (sī. syā. kaṃ. pī.)] ayaṃ loko avīci maññe phuṭo ahosi manussehi, kukkuṭasaṃpātikā gāmanigamarājadhāniyo’ti. Ko nu kho, bho gotama, hetu ko paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā hontī’’ti? ‘‘Etarahi, brāhmaṇa, manussā adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā. Te adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā tiṇhāni satthāni gahetvā aññamaññaṃ [aññamaññassa (sabbattha)] jīvitā voropenti, tena bahū manussā kālaṃ karonti. Ayampi kho, brāhmaṇa, hetu ayaṃ paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā honti. ‘‘Puna caparaṃ, brāhmaṇa, etarahi manussā adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā. Tesaṃ adhammarāgarattānaṃ visamalobhābhibhūtānaṃ micchādhammaparetānaṃ devo na sammādhāraṃ anuppavecchati. Tena dubbhikkhaṃ hoti dussassaṃ setaṭṭhikaṃ salākāvuttaṃ. Tena bahū manussā kālaṃ karonti. Ayampi kho, brāhmaṇa, hetu ayaṃ paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā honti. ‘‘Puna caparaṃ, brāhmaṇa, etarahi manussā adhammarāgarattā visamalobhābhibhūtā micchādhammaparetā. Tesaṃ adhammarāgarattānaṃ visamalobhābhibhūtānaṃ micchādhammaparetānaṃ yakkhā vāḷe amanusse ossajjanti [ossajanti (sī.)], tena bahū manussā kālaṃ karonti. Ayampi kho, brāhmaṇa, hetu ayaṃ paccayo yenetarahi manussānaṃ khayo hoti, tanuttaṃ paññāyati, gāmāpi agāmā honti, nigamāpi anigamā honti, nagarāpi anagarā honti, janapadāpi ajanapadā hontī’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Chaṭṭhaṃ.",
      "english": "Then a certain wealthy Brahmin approached the Blessed One, exchanged greetings with him, and having sat down to one side, that wealthy Brahmin said to the Blessed One: \"I have heard this, Venerable Gotama, from the elder, aged Brahmins, my teachers and teachers' teachers, speaking thus: 'Indeed, in former times, this world was, as it were, teeming with people, packed like a chicken run with villages, towns, and royal capitals.' But what, Venerable Gotama, is the cause, what is the reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied?\"\n\n\"Nowadays, Brahmin, people are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states. Those who are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states, take sharp weapons and deprive one another of life; by this, many people die. This, too, Brahmin, is a cause, this is a reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied.\n\n\"Furthermore, Brahmin, nowadays people are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states. Because they are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states, the sky does not send down rain at the proper time. Due to this, there is famine, poor harvest, withered crops, and crops destroyed by pests. By this, many people die. This, too, Brahmin, is a cause, this is a reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied.\n\n\"Furthermore, Brahmin, nowadays people are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states. Because they are infatuated with unrighteous lust, overcome by perverse greed, and permeated by unwholesome states, Yakkhas let loose fierce non-human beings upon them; by this, many people die. This, too, Brahmin, is a cause, this is a reason, that nowadays there is a decline in humanity, a scarcity is apparent, villages become unvillaged, towns become untowned, cities become uncitied, and provinces become unprovincied.\"\n\n\"Excellent, Venerable Gotama! It is as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms. In the same way has the Venerable Gotama, in many ways, made the Dhamma clear. I go for refuge to the Venerable Gotama, to the Dhamma, and to the Saṅgha. May the Venerable Gotama remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "ඉන්පසු එක්තරා බ්‍රාහ්මණ මහසාලෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ ඒ බ්‍රාහ්මණ මහසාල තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: ‘‘භවත් ගෞතමයන් වහන්ස, පෙර විසූ, වෘද්ධ වූ, මහලු වූ, ආචාර්ය-ප්‍රාචාර්යවරුන් කියනවා මා අසා ඇත – ‘පෙර මේ ලෝකය මිනිසුන්ගෙන් අවීචියක් මෙන් පිරී තිබුණා. ගම්, නියම්ගම්, රාජධානි කුකුළු සාම්ප්‍රාප්තියක් මෙන් (මිනිසුන්ගෙන් ඝනව) විය’ කියා. භවත් ගෞතමයන් වහන්ස, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’’\n\n‘‘බ්‍රාහ්මණය, දැන් මිනිසුන් අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය වෙති. ඒ අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය තියුණු ආයුධ ගෙන එකිනෙකාගේ ජීවිත නැති කරති. එයින් බොහෝ මිනිසුන් මිය යති. බ්‍රාහ්මණය, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයද හේතුවක්, මෙයද ප්‍රත්‍යයක් වේ.\n\n‘‘තවද බ්‍රාහ්මණය, දැන් මිනිසුන් අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය වෙති. ඒ අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අයට දෙවියෝ (වර්ෂාව) මැනවින් වැසි නොදෙති. එයින් දුර්භික්ෂය (සාගතය) සිදු වේ. අස්වැන්න දුර්වල වී, ධාන්‍ය සුදු ඇට බවට පත්ව වියළී ගොස්, කෘමි හානිවලට ලක් වේ. එයින් බොහෝ මිනිසුන් මිය යති. බ්‍රාහ්මණය, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයද හේතුවක්, මෙයද ප්‍රත්‍යයක් වේ.\n\n‘‘තවද බ්‍රාහ්මණය, දැන් මිනිසුන් අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අය වෙති. ඒ අධර්ම රාගයෙන් ඇලී, විෂම ලෝභයෙන් යටපත් වී, මිථ්‍යා ධර්මයෙන් පෙළුණු අයට යක්ෂයෝ දරුණු අමනුෂ්‍යයන් එලවති. එයින් බොහෝ මිනිසුන් මිය යති. බ්‍රාහ්මණය, යම් හෙයකින් දැන් මිනිසුන්ගේ ක්ෂය වීමක් සිදු වේද, තුනී වීමක් පෙනේ ද, ගම් පවා ගම් නොවන තත්ත්වයට පත් වේද, නියම්ගම් පවා නියම්ගම් නොවන තත්ත්වයට පත් වේද, නගර පවා නගර නොවන තත්ත්වයට පත් වේද, ජනපද පවා ජනපද නොවන තත්ත්වයට පත් වේද, මෙයද හේතුවක්, මෙයද ප්‍රත්‍යයක් වේ.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, අතිශයින්ම මැනවි! අතිශයින්ම මැනවි! යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මංමුලා වූවෙකුට මග පෙන්වන්නේද, අන්ධකාරයේ සිටින අයට තෙල් පහනක් දරන්නේද, එසේම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය දේශනා කරන ලදී. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය, මා උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Palokasuttaṃ"
    },
    {
      "number": 58,
      "pali": "Atha kho vacchagotto [vacchaputto (ka.)] paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama, samaṇo gotamo evamāha – ‘mayhameva dānaṃ dātabbaṃ, nāññesaṃ dānaṃ dātabbaṃ; mayhameva sāvakānaṃ dānaṃ dātabbaṃ, nāññesaṃ sāvakānaṃ dānaṃ dātabbaṃ; mayhameva dinnaṃ mahapphalaṃ, nāññesaṃ dinnaṃ mahapphalaṃ; mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, nāññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti. Ye te, bho gotama, evamāhaṃsu ‘samaṇo gotamo evamāha mayhameva dānaṃ dātabbaṃ, nāññesaṃ dānaṃ dātabbaṃ. Mayhameva sāvakānaṃ dānaṃ dātabbaṃ, nāññesaṃ sāvakānaṃ dānaṃ dātabbaṃ. Mayhameva dinnaṃ mahapphalaṃ, nāññesaṃ dinnaṃ mahapphalaṃ. Mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, nāññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti. Kacci te bhoto gotamassa vuttavādino ca bhavantaṃ gotamaṃ abhūtena abbhācikkhanti, dhammassa cānudhammaṃ byākaronti, na ca koci sahadhammiko vādānupāto [vādānuvādo (ka.)] gārayhaṃ ṭhānaṃ āgacchati? Anabbhakkhātukāmā hi mayaṃ bhavantaṃ gotama’’nti. ‘‘Ye te, vaccha, evamāhaṃsu – ‘samaṇo gotamo evamāha – mayhameva dānaṃ dātabbaṃ…pe… nāññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti na me te vuttavādino. Abbhācikkhanti ca pana maṃ [ca pana maṃ te (sī. syā. kaṃ. pī.)] asatā abhūtena. Yo kho, vaccha, paraṃ dānaṃ dadantaṃ vāreti so tiṇṇaṃ antarāyakaro hoti, tiṇṇaṃ pāripanthiko. Katamesaṃ tiṇṇaṃ? Dāyakassa puññantarāyakaro hoti, paṭiggāhakānaṃ lābhantarāyakaro hoti, pubbeva kho panassa attā khato ca hoti upahato ca. Yo kho, vaccha, paraṃ dānaṃ dadantaṃ vāreti so imesaṃ tiṇṇaṃ antarāyakaro hoti, tiṇṇaṃ pāripanthiko. ‘‘Ahaṃ kho pana, vaccha, evaṃ vadāmi – ye hi te candanikāya vā oligalle vā pāṇā, tatrapi yo thālidhovanaṃ [thālakadhovanaṃ (ka.)] vā sarāvadhovanaṃ vā chaḍḍeti – ye tattha pāṇā te tena yāpentūti, tato nidānampāhaṃ, vaccha, puññassa āgamaṃ vadāmi. Ko pana vādo manussabhūte! Api cāhaṃ, vaccha, sīlavato dinnaṃ mahapphalaṃ vadāmi, no tathā dussīlassa, so ca hoti pañcaṅgavippahīno pañcaṅgasamannāgato. ‘‘Katamāni pañcaṅgāni pahīnāni honti? Kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Imāni pañcaṅgāni vippahīnāni honti. ‘‘Katamehi pañcahi aṅgehi samannāgato hoti? Asekkhena sīlakkhandhena samannāgato hoti, asekkhena samādhikkhandhena samannāgato hoti, asekkhena paññākkhandhena samannāgato hoti, asekkhena vimuttikkhandhena samannāgato hoti, asekkhena vimuttiñāṇadassanakkhandhena samannāgato hoti; imehi pañcahi aṅgehi samannāgato hoti. Iti pañcaṅgavippahīne pañcaṅgasamannāgate dinnaṃ mahapphalanti vadāmī’’ti. ‘‘Iti kaṇhāsu setāsu, rohiṇīsu harīsu vā; Kammāsāsu sarūpāsu, gosu pārevatāsu vā. ‘‘Yāsu kāsuci etāsu, danto jāyati puṅgavo; Dhorayho balasampanno, kalyāṇajavanikkamo; Tameva bhāre yuñjanti, nāssa vaṇṇaṃ parikkhare. ‘‘Evamevaṃ manussesu, yasmiṃ kasmiñci jātiye; Khattiye brāhmaṇe vesse, sudde caṇḍālapukkuse. ‘‘Yāsu kāsuci etāsu, danto jāyati subbato; Dhammaṭṭho sīlasampanno, saccavādī hirīmano. ‘‘Pahīnajātimaraṇo, brahmacariyassa kevalī; Pannabhāro visaṃyutto, katakicco anāsavo. ‘‘Pāragū sabbadhammānaṃ, anupādāya nibbuto; Tasmiṃyeva [tasmiṃ ve (syā. kaṃ.)] viraje khette, vipulā hoti dakkhiṇā. ‘‘Bālā ca avijānantā, dummedhā assutāvino; Bahiddhā denti dānāni, na hi sante upāsare. ‘‘Ye ca sante upāsanti, sappaññe dhīrasammate; Saddhā ca nesaṃ sugate, mūlajātā patiṭṭhitā. ‘‘Devalokañca te yanti, kule vā idha jāyare; Anupubbena nibbānaṃ, adhigacchanti paṇḍitā’’ti. sattamaṃ;",
      "english": "",
      "sinhala": "",
      "paliTitle": "Vacchagottasuttaṃ"
    },
    {
      "number": 59,
      "pali": "Atha kho tikaṇṇo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ…pe… ekamantaṃ nisinno kho tikaṇṇo brāhmaṇo bhagavato sammukhā tevijjānaṃ sudaṃ brāhmaṇānaṃ vaṇṇaṃ bhāsati – ‘‘evampi tevijjā brāhmaṇā, itipi tevijjā brāhmaṇā’’ti. ‘‘Yathā kathaṃ pana, brāhmaṇa, brāhmaṇā brāhmaṇaṃ tevijjaṃ paññāpentī’’ti? ‘‘Idha, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena, ajjhāyako, mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayoti. Evaṃ kho, bho gotama, brāhmaṇā tevijjaṃ paññāpentī’’ti. ‘‘Aññathā kho, brāhmaṇa, brāhmaṇā brāhmaṇaṃ tevijjaṃ paññapenti, aññathā ca pana ariyassa vinaye tevijjo hotī’’ti. ‘‘Yathā kathaṃ pana, bho gotama, ariyassa vinaye tevijjo hoti? Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ariyassa vinaye tevijjo hotī’’ti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho tikaṇṇo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha, brāhmaṇa, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattārīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi, anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ. Tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Ayamassa paṭhamā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā…pe… manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā, vacīsucaritena samannāgatā, manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Ayamassa dutiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti; ‘ime āsavā’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Ayamassa tatiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato’’ti. ‘‘Anuccāvacasīlassa, nipakassa ca jhāyino; Cittaṃ yassa vasībhūtaṃ, ekaggaṃ susamāhitaṃ. ‘‘Taṃ ve tamonudaṃ dhīraṃ, tevijjaṃ maccuhāyinaṃ; Hitaṃ devamanussānaṃ, āhu sabbappahāyinaṃ. ‘‘Tīhi vijjāhi sampannaṃ, asammūḷhavihārinaṃ; Buddhaṃ antimadehinaṃ [antimasārīraṃ (sī. syā. kaṃ. pī.)], taṃ namassanti gotamaṃ. [dha. pa. 423; itivu. 99] ‘‘Pubbenivāsaṃ yo vedī, saggāpāyañca passati; Atho jātikkhayaṃ patto, abhiññāvosito muni. ‘‘Etāhi tīhi vijjāhi, tevijjo hoti brāhmaṇo; Tamahaṃ vadāmi tevijjaṃ, nāññaṃ lapitalāpana’’nti. ‘‘Evaṃ kho, brāhmaṇa, ariyassa vinaye tevijjo hotī’’ti. ‘‘Aññathā, bho gotama, brāhmaṇānaṃ tevijjo, aññathā ca pana ariyassa vinaye tevijjo hoti. Imassa ca pana, bho gotama, ariyassa vinaye tevijjassa brāhmaṇānaṃ tevijjo kalaṃ nāgghati soḷasiṃ’’. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Tikaṇṇasuttaṃ"
    },
    {
      "number": 60,
      "pali": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ…pe… ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘yassassu, bho gotama, yañño vā saddhaṃ vā thālipāko vā deyyadhammaṃ vā, tevijjesu brāhmaṇesu dānaṃ dadeyyā’’ti. ‘‘Yathā kathaṃ pana, brāhmaṇa, brāhmaṇā tevijjaṃ paññapentī’’ti? ‘‘Idha kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, ajjhāyako mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ, padako, veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayoti. Evaṃ kho, bho gotama, brāhmaṇā tevijjaṃ paññapentī’’ti. ‘‘Aññathā kho, brāhmaṇa, brāhmaṇā brāhmaṇaṃ tevijjaṃ paññapenti, aññathā ca pana ariyassa vinaye tevijjo hotī’’ti. ‘‘Yathā kathaṃ pana, bho gotama, ariyassa vinaye tevijjo hoti? Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ariyassa vinaye tevijjo hotī’’ti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho jāṇussoṇi brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha pana, brāhmaṇa, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Ayamassa paṭhamā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti. Ayamassa dutiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti; ‘ime āsavā’ti yathābhūtaṃ pajānāti…pe… ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Ayamassa tatiyā vijjā adhigatā hoti; avijjā vihatā, vijjā uppannā; tamo vihato, āloko uppanno yathā taṃ appamattassa ātāpino pahitattassa viharato’’ti. ‘‘Yo sīlabbatasampanno, pahitatto samāhito; Cittaṃ yassa vasībhūtaṃ, ekaggaṃ susamāhitaṃ. [dha. pa. 423; itivu. 99] ‘‘Pubbenivāsaṃ yo vedī, saggāpāyañca passati; Atho jātikkhayaṃ patto, abhiññāvosito muni. ‘‘Etāhi tīhi vijjāhi, tevijjo hoti brāhmaṇo; Tamahaṃ vadāmi tevijjaṃ, nāññaṃ lapitalāpana’’nti. ‘‘Evaṃ kho, brāhmaṇa, ariyassa vinaye tevijjo hotī’’ti. ‘‘Aññathā, bho gotama, brāhmaṇānaṃ tevijjo, aññathā ca pana ariyassa vinaye tevijjo hoti. Imassa ca, bho gotama, ariyassa vinaye tevijjassa brāhmaṇānaṃ tevijjo kalaṃ nāgghati soḷasiṃ’’. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Jāṇussoṇisuttaṃ"
    },
    {
      "number": 61,
      "pali": "Atha kho saṅgāravo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho saṅgāravo brāhmaṇo bhagavantaṃ etadavoca – ‘‘mayamassu, bho gotama, brāhmaṇā nāma. Yaññaṃ yajāmapi yajāpemapi. Tatra, bho gotama, yo ceva yajati [yo ceva yaññaṃ yajati (syā. kaṃ.)] yo ca yajāpeti sabbe te anekasārīrikaṃ puññappaṭipadaṃ paṭipannā honti, yadidaṃ yaññādhikaraṇaṃ. Yo panāyaṃ, bho gotama, yassa vā tassa vā kulā agārasmā anagāriyaṃ pabbajito ekamattānaṃ dameti, ekamattānaṃ sameti, ekamattānaṃ parinibbāpeti, evamassāyaṃ ekasārīrikaṃ puññappaṭipadaṃ paṭipanno hoti, yadidaṃ pabbajjādhikaraṇa’’nti. ‘‘Tena hi, brāhmaṇa, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, brāhmaṇa, idha tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So evamāha – ‘ethāyaṃ maggo ayaṃ paṭipadā yathāpaṭipanno ahaṃ anuttaraṃ brahmacariyogadhaṃ sayaṃ abhiññā sacchikatvā pavedemi; etha [etaṃ (ka.)], tumhepi tathā paṭipajjatha, yathāpaṭipannā tumhepi anuttaraṃ brahmacariyogadhaṃ sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti. Iti ayañceva [sayaṃ ceva (ka.)] satthā dhammaṃ deseti, pare ca tathatthāya paṭipajjanti, tāni kho pana honti anekānipi satāni anekānipi sahassāni anekānipi satasahassāni. ‘‘Taṃ kiṃ maññasi, brāhmaṇa, iccāyaṃ evaṃ sante ekasārīrikā vā puññappaṭipadā hoti anekasārīrikā vā, yadidaṃ pabbajjādhikaraṇa’’nti? ‘‘Iccāyampi [iccāyante (ka.)], bho gotama, evaṃ sante anekasārīrikā puññappaṭipadā hoti, yadidaṃ pabbajjādhikaraṇa’’nti. Evaṃ vutte āyasmā ānando saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘imāsaṃ te, brāhmaṇa, dvinnaṃ paṭipadānaṃ katamā paṭipadā khamati appatthatarā ca appasamārambhatarā ca mahapphalatarā ca mahānisaṃsatarā cā’’ti? Evaṃ vutte saṅgāravo brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘seyyathāpi bhavaṃ gotamo bhavaṃ cānando. Ete me pujjā, ete me pāsaṃsā’’ti. Dutiyampi kho āyasmā ānando saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘na kho tyāhaṃ, brāhmaṇa, evaṃ pucchāmi – ‘ke vā te pujjā ke vā te pāsaṃsā’ti? Evaṃ kho tyāhaṃ, brāhmaṇa, pucchāmi – ‘imāsaṃ te, brāhmaṇa, dvinnaṃ paṭipadānaṃ katamā paṭipadā khamati appatthatarā ca appasamārambhatarā ca mahapphalatarā ca mahānisaṃsatarā cā’’’ti? Dutiyampi kho saṅgāravo brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘seyyathāpi bhavaṃ gotamo bhavaṃ cānando. Ete me pujjā, ete me pāsaṃsā’’ti. Tatiyampi kho āyasmā ānando saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘na kho tyāhaṃ, brāhmaṇa, evaṃ pucchāmi – ‘ke vā te pujjā ke vā te pāsaṃsā’ti? Evaṃ kho tyāhaṃ, brāhmaṇa, pucchāmi – ‘imāsaṃ te, brāhmaṇa, dvinnaṃ paṭipadānaṃ katamā paṭipadā khamati appatthatarā ca appasamārambhatarā ca mahapphalatarā ca mahānisaṃsatarā cā’’’ti? Tatiyampi kho saṅgāravo brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘seyyathāpi bhavaṃ gotamo bhavaṃ cānando. Ete me pujjā, ete me pāsaṃsā’’ti. Atha kho bhagavato etadahosi – ‘‘yāva tatiyampi kho saṅgāravo brāhmaṇo ānandena sahadhammikaṃ pañhaṃ puṭṭho saṃsādeti [ma. ni. 1.337] no vissajjeti. Yaṃnūnāhaṃ parimoceyya’’nti. Atha kho bhagavā saṅgāravaṃ brāhmaṇaṃ etadavoca – ‘‘kā nvajja, brāhmaṇa, rājantepure rājapurisānaṃ [rājaparisāyaṃ (sī. syā. kaṃ. pī.)] sannisinnānaṃ sannipatitānaṃ antarākathā udapādī’’ti? ‘‘Ayaṃ khvajja, bho gotama, rājantepure rājapurisānaṃ sannisinnānaṃ sannipatitānaṃ antarākathā udapādi – ‘pubbe sudaṃ appatarā ceva bhikkhū ahesuṃ bahutarā ca uttari manussadhammā iddhipāṭihāriyaṃ dassesuṃ; etarahi pana bahutarā ceva bhikkhū appatarā ca uttari manussadhammā iddhipāṭihāriyaṃ dassentī’ti. Ayaṃ khvajja, bho gotama, rājantepure rājapurisānaṃ sannisinnānaṃ sannipatitānaṃ antarākathā udapādī’’ti. [paṭi. ma. 3.30; dī. ni. 1.483] ‘‘Tīṇi kho imāni, brāhmaṇa, pāṭihāriyāni. Katamāni tīṇi? Iddhipāṭihāriyaṃ, ādesanāpāṭihāriyaṃ, anusāsanīpāṭihāriyaṃ. Katamañca, brāhmaṇa, iddhipāṭihāriyaṃ? Idha, brāhmaṇa, ekacco anekavihitaṃ iddhividhaṃ paccanubhoti – ‘ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake; udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasati [parāmasati (dī. ni. 1.484; paṭi. ma. 1.102] parimajjati, yāva brahmalokāpi kāyena vasaṃ vatteti’. Idaṃ vuccati, brāhmaṇa, iddhipāṭihāriyaṃ. ‘‘Katamañca, brāhmaṇa, ādesanāpāṭihāriyaṃ? Idha, brāhmaṇa, ekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. ‘‘Idha pana, brāhmaṇa, ekacco na heva kho nimittena ādisati, api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. ‘‘Idha pana, brāhmaṇa, ekacco na heva kho nimittena ādisati napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. ‘‘Idha pana, brāhmaṇa, ekacco na heva kho nimittena ādisati, napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, napi vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati, api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā imassa cittassa anantarā amuṃ nāma vitakkaṃ vitakkessatī’ti. So bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. Idaṃ vuccati, brāhmaṇa, ādesanāpāṭihāriyaṃ. ‘‘Katamañca, brāhmaṇa, anusāsanīpāṭihāriyaṃ? Idha, brāhmaṇa, ekacco evamanusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’ti. Idaṃ vuccati, brāhmaṇa, anusāsanīpāṭihāriyaṃ. Imāni kho, brāhmaṇa, tīṇi pāṭihāriyāni. Imesaṃ te, brāhmaṇa, tiṇṇaṃ pāṭihāriyānaṃ katamaṃ pāṭihāriyaṃ khamati abhikkantatarañca paṇītatarañcā’’ti? ‘‘Tatra, bho gotama, yadidaṃ [yamidaṃ (syā. kaṃ. pī.)] pāṭihāriyaṃ idhekacco anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brāhmalokāpi kāyena vasaṃ vatteti, idaṃ, bho gotama, pāṭihāriyaṃ yova [yo ca (syā. kaṃ. pī. ka.)] naṃ karoti sova [soca ca (syā. kaṃ pī. ka.)] naṃ paṭisaṃvedeti, yova [yo ca (syā. kaṃ. pī. ka.)] naṃ karoti tasseva [tassameva (sī. ka.), tassa ceva (syā. kaṃ. pī.)] taṃ hoti. Idaṃ me, bho gotama, pāṭihāriyaṃ māyāsahadhammarūpaṃ viya khāyati. ‘‘Yampidaṃ, bho gotama, pāṭihāriyaṃ idhekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti, so bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. Idha pana, bho gotama, ekacco na heva kho nimittena ādisati, api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati…pe… napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati…pe… napi vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati, api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā imassa cittassa anantarā amhaṃ nāma vitakkaṃ vitakkessatī’ti, so bahuṃ cepi ādisati tatheva taṃ hoti, no aññathā. Idampi, bho gotama, pāṭihāriyaṃ yova naṃ karoti sova naṃ paṭisaṃvedeti, yova naṃ karoti tasseva taṃ hoti. Idampi me, bho gotama, pāṭihāriyaṃ māyāsahadhammarūpaṃ viya khāyati. ‘‘Yañca kho idaṃ, bho gotama, pāṭihāriyaṃ idhekacco evaṃ anusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’ti. Idameva, bho gotama, pāṭihāriyaṃ khamati imesaṃ tiṇṇaṃ pāṭihāriyānaṃ abhikkantatarañca paṇītatarañca. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāvasubhāsitamidaṃ bhotā gotamena imehi ca mayaṃ tīhi pāṭihāriyehi samannāgataṃ bhavantaṃ gotamaṃ dhārema. Bhavañhi gotamo anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti, bhavañhi gotamo avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā imassa cittassa anantarā amuṃ nāma vitakkaṃ vitakkessatī’ti. Bhavañhi gotamo evamanusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’’’ti. ‘‘Addhā kho tyāhaṃ, brāhmaṇa, āsajja upanīya vācā bhāsitā; api ca tyāhaṃ byākarissāmi. Ahañhi, brāhmaṇa, anekavihitaṃ iddhividhaṃ paccanubhomi…pe… yāva brahmalokāpi kāyena vasaṃ vattemi. Ahañhi, brāhmaṇa, avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāmi – ‘yathā imassa bhoto manosaṅkhārā paṇihitā, imassa cittassa anantarā amuṃ nāma vitakkaṃ vitakkessatī’ti. Ahañhi, brāhmaṇa, evamanusāsāmi – ‘evaṃ vitakketha, mā evaṃ vitakkayittha; evaṃ manasi karotha, mā evaṃ manasākattha; idaṃ pajahatha, idaṃ upasampajja viharathā’’’ti. ‘‘Atthi pana, bho gotama, añño ekabhikkhupi yo imehi tīhi pāṭihāriyehi samannāgato, aññatra bhotā gotamenā’’ti? ‘‘Na kho, brāhmaṇa, ekaṃyeva sataṃ na dve satāni na tīṇi satāni na cattāri satāni na pañca satāni, atha kho bhiyyova, ye [te (ka.) passa ma. ni. 2.195] bhikkhū imehi tīhi pāṭihāriyehi samannāgatā’’ti. ‘‘Kahaṃ pana, bho gotama, etarahi te bhikkhū viharantī’’ti? ‘‘Imasmiṃyeva kho, brāhmaṇa, bhikkhusaṅghe’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti, evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi, dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Saṅgāravasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Brāhmaṇavaggo paṭhamo. Tassuddānaṃ – Dve brāhmaṇā caññataro, paribbājakena nibbutaṃ; Palokavaccho tikaṇṇo, soṇi saṅgāravena cāti.",
    "english": "",
    "sinhala": ""
  }
}