{
  "id": "an3.10",
  "title": {
    "pali": "Loṇakapallavaggo",
    "english": "The Section on the Salt Crystal",
    "sinhala": "ලෝණකපල්ලව වග්ගය"
  },
  "sections": [
    {
      "number": 93,
      "pali": "‘‘Tīṇimāni, bhikkhave, kassakassa gahapatissa accāyikāni karaṇīyāni. Katamāni tīṇi? Idha, bhikkhave, kassako gahapati sīghaṃ sīghaṃ khettaṃ sukaṭṭhaṃ karoti sumatikataṃ. Sīghaṃ sīghaṃ khettaṃ sukaṭṭhaṃ karitvā sumatikataṃ sīghaṃ sīghaṃ bījāni patiṭṭhāpeti. Sīghaṃ sīghaṃ bījāni patiṭṭhāpetvā sīghaṃ sīghaṃ udakaṃ abhinetipi apanetipi. Imāni kho, bhikkhave, tīṇi kassakassa gahapatissa accāyikāni karaṇīyāni. Tassa kho taṃ, bhikkhave, kassakassa gahapatissa natthi sā iddhi vā ānubhāvo vā – ‘ajjeva me dhaññāni jāyantu, sveva gabbhīni hontu, uttarasveva paccantū’ti. Atha kho, bhikkhave, hoti so samayo yaṃ tassa kassakassa gahapatissa tāni dhaññāni utupariṇāmīni jāyantipi gabbhīnipi honti paccantipi. ‘‘Evamevaṃ kho, bhikkhave, tīṇimāni bhikkhussa accāyikāni karaṇīyāni. Katamāni tīṇi? Adhisīlasikkhāsamādānaṃ, adhicittasikkhāsamādānaṃ, adhipaññāsikkhāsamādānaṃ – imāni kho, bhikkhave, tīṇi bhikkhussa accāyikāni karaṇīyāni. Tassa kho taṃ, bhikkhave, bhikkhuno natthi sā iddhi vā anubhāvo vā – ‘ajjeva me anupādāya āsavehi cittaṃ vimuccatu sve vā uttarasve vā’ti. Atha kho, bhikkhave, hoti so samayo yaṃ tassa bhikkhuno adhisīlampi sikkhato adhicittampi sikkhato adhipaññampi sikkhato anupādāya āsavehi cittaṃ vimuccati. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘tibbo no chando bhavissati adhisīlasikkhāsamādāne, tibbo chando bhavissati adhicittasikkhāsamādāne, tibbo chando bhavissati adhipaññāsikkhāsamādāne’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "Monks, these three urgent duties belong to a farmer householder. Which three? Here, monks, a farmer householder quickly and thoroughly cultivates and prepares the field. Having quickly and thoroughly cultivated and prepared the field, he quickly sows the seeds. Having quickly sown the seeds, he quickly irrigates and drains the water as needed. These, monks, are the three urgent duties of a farmer householder. That farmer householder, monks, does not possess the power or influence to say: 'May my grains sprout today, may they ear tomorrow, and ripen the day after tomorrow.' But indeed, monks, there comes a time when, by the natural progression of seasons, those grains for that farmer householder sprout, ear, and ripen.\n\nJust so, monks, these three urgent duties belong to a monk. Which three? The undertaking of the training in higher virtue, the undertaking of the training in higher mind, and the undertaking of the training in higher wisdom — these, monks, are the three urgent duties of a monk. That monk, monks, does not possess the power or influence to say: 'May my mind be liberated from the defilements through non-clinging today, tomorrow, or the day after tomorrow.' But indeed, monks, there comes a time when, for that monk who is training in higher virtue, training in higher mind, and training in higher wisdom, the mind is liberated from the defilements through non-clinging.\n\nTherefore, monks, you should train yourselves thus: 'Our fervent desire will be for the undertaking of the training in higher virtue; our fervent desire will be for the undertaking of the training in higher mind; our fervent desire will be for the undertaking of the training in higher wisdom.' Indeed, monks, this is how you should train.",
      "sinhala": "මහණෙනි, ගොවි ගෘහපතියාට මේ අත්‍යාවශ්‍ය කරුණු තුනක් ඇත. ඒ තුන කවරේද? මහණෙනි, මෙහිලා ගොවි ගෘහපතියා ඉතා ඉක්මනින් කෙත හොඳින් සීසා දියුණු කරවයි. ඉතා ඉක්මනින් කෙත හොඳින් සීසා දියුණු කරවා ඉතා ඉක්මනින් බීජ රෝපණය කරයි. ඉතා ඉක්මනින් බීජ රෝපණය කරවා ඉතා ඉක්මනින් ජලය සපයයිද ඉවත් කරයිද. මහණෙනි, ගොවි ගෘහපතියාට මේ අත්‍යාවශ්‍ය කරුණු තුන වේ. මහණෙනි, ඒ ගොවි ගෘහපතියාට \"අදම මගේ ධාන්‍ය පැළ වේවා, හෙටම ගැබ් වේවා, අනිද්දාම මේරේවා\" යැයි කියන ඒ ඍද්ධියක් හෝ ආනුභාවයක් හෝ නැත. මහණෙනි, එහෙත් ඒ ගොවි ගෘහපතියාගේ ඒ ධාන්‍ය ඍතු ස්වභාවය අනුව පැළ වන, ගැබ් වන, මෝරන කාලයක් වේ.\n\nමහණෙනි, එපරිද්දෙන්ම භික්ෂුවටද මේ අත්‍යාවශ්‍ය කරුණු තුනක් ඇත. ඒ තුන කවරේද? අධිශීල ශික්ෂා සමාදානය, අධිචිත්ත ශික්ෂා සමාදානය, අධිප්‍රඥා ශික්ෂා සමාදානය යන මේවාය. මහණෙනි, භික්ෂුවට මේ අත්‍යාවශ්‍ය කරුණු තුන වේ. මහණෙනි, ඒ භික්ෂුවට \"අදම මගේ සිත උපාදානයෙන් තොරව ආශ්‍රවයන්ගෙන් මිදේවා, හෙට හෝ අනිද්දා හෝ මිදේවා\" යැයි කියන ඒ ඍද්ධියක් හෝ ආනුභාවයක් හෝ නැත. මහණෙනි, එහෙත් ඒ භික්ෂුව අධිශීලය පුරුදු කරන කල්හි, අධිචිත්තය පුරුදු කරන කල්හි, අධිප්‍රඥාව පුරුදු කරන කල්හි උපාදානයෙන් තොරව ආශ්‍රවයන්ගෙන් සිත මිදෙන කාලයක් වේ.\n\nඑහෙයින් මහණෙනි, \"අධිශීල ශික්ෂා සමාදානයෙහි අපගේ ඡන්දය තීව්‍ර වන්නේය, අධිචිත්ත ශික්ෂා සමාදානයෙහි ඡන්දය තීව්‍ර වන්නේය, අධිප්‍රඥා ශික්ෂා සමාදානයෙහි ඡන්දය තීව්‍ර වන්නේය\" යනුවෙන් මෙසේ හික්මිය යුතුය. මහණෙනි, එසේම ඔබ විසින් හික්මිය යුතු වන්නේය.",
      "paliTitle": "Accāyikasuttaṃ",
      "englishTitle": "Urgent Duties Sutta",
      "sinhalaTitle": "අච්චායික සූත්‍රය"
    },
    {
      "number": 94,
      "pali": "‘‘Tīṇimāni, bhikkhave, aññatitthiyā paribbājakā pavivekāni paññāpenti. Katamāni tīṇi? Cīvarapavivekaṃ, piṇḍapātapavivekaṃ, senāsanapavivekaṃ. ‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā cīvarapavivekasmiṃ paññāpenti, sāṇānipi dhārenti, masāṇānipi dhārenti, chavadussānipi dhārenti, paṃsukūlānipi dhārenti, tirīṭānipi dhārenti, ajinampi dhārenti, ajinakkhipampi dhārenti, kusacīrampi dhārenti, vākacīrampi dhārenti, phalakacīrampi dhārenti, kesakambalampi dhārenti, vālakambalampi dhārenti, ulūkapakkhikampi dhārenti. Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā cīvarapavivekasmiṃ paññāpenti. ‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā piṇḍapātapavivekasmiṃ paññāpenti. Sākabhakkhāpi honti, sāmākabhakkhāpi honti, nīvārabhakkhāpi honti, daddulabhakkhāpi honti, haṭabhakkhāpi honti, kaṇabhakkhāpi honti, ācāmabhakkhāpi honti, piññākabhakkhāpi honti, tiṇabhakkhāpi honti, gomayabhakkhāpi honti, vanamūlaphalāhārā yāpenti pavattaphalabhojī. Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā piṇḍapātapavivekasmiṃ paññāpenti. ‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā senāsanapavivekasmiṃ paññāpenti araññaṃ rukkhamūlaṃ susānaṃ [rukkhamūlaṃ bhusāgāraṃ susānaṃ (ka.)] vanapatthaṃ abbhokāsaṃ palālapuñjaṃ bhusāgāraṃ [suññāgāraṃ (ka.)]. Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā senāsanapavivekasmiṃ paññāpenti. Imāni kho, bhikkhave, tīṇi aññatitthiyā paribbājakā pavivekāni paññāpenti. ‘‘Tīṇi kho panimāni, bhikkhave, imasmiṃ dhammavinaye bhikkhuno pavivekāni. Katamāni tīṇi? Idha, bhikkhave, bhikkhu sīlavā ca hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti. Yato kho, bhikkhave, bhikkhu sīlavā hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aggappatto sārappatto suddho sāre patiṭṭhito’’’. ‘‘Seyyathāpi, bhikkhave, kassakassa gahapatissa sampannaṃ sālikkhettaṃ. Tamenaṃ kassako gahapati sīghaṃ sīghaṃ [sīghasīghaṃ (sī. syā. kaṃ. pī.)] lavāpeyya. Sīghaṃ sīghaṃ lavāpetvā sīghaṃ sīghaṃ saṅgharāpeyya. Sīghaṃ sīghaṃ saṅgharāpetvā sīghaṃ sīghaṃ ubbahāpeyya [ubbāhāpeyya (syā. kaṃ.)]. Sīghaṃ sīghaṃ ubbahāpetvā sīghaṃ sīghaṃ puñjaṃ kārāpeyya. Sīghaṃ sīghaṃ puñjaṃ kārāpetvā sīghaṃ sīghaṃ maddāpeyya. Sīghaṃ sīghaṃ maddāpetvā sīghaṃ sīghaṃ palālāni uddharāpeyya. Sīghaṃ sīghaṃ palālāni uddharāpetvā sīghaṃ sīghaṃ bhusikaṃ uddharāpeyya. Sīghaṃ sīghaṃ bhusikaṃ uddharāpetvā sīghaṃ sīghaṃ opunāpeyya. Sīghaṃ sīghaṃ opunāpetvā sīghaṃ sīghaṃ atiharāpeyya. Sīghaṃ sīghaṃ atiharāpetvā sīghaṃ sīghaṃ koṭṭāpeyya. Sīghaṃ sīghaṃ koṭṭāpetvā sīghaṃ sīghaṃ thusāni uddharāpeyya. Evamassu [evassu (ka.)] tāni, bhikkhave, kassakassa gahapatissa dhaññāni aggappattāni sārappattāni suddhāni sāre patiṭṭhitāni. ‘‘Evamevaṃ kho, bhikkhave, yato bhikkhu sīlavā ca hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aggappatto sārappatto suddho sāre patiṭṭhito’’’ti. Dutiyaṃ.",
      "english": "Monks, these three types of seclusion are declared by other sectarians, wanderers. Which three? Seclusion in robes, seclusion in alms food, and seclusion in dwelling places.\n\nHerein, monks, other sectarians, wanderers, declare seclusion in robes, wearing coarse hemp cloth, or cloth made of interwoven fibers, or shrouds from charnel grounds, or rag-robes from rubbish heaps, or bark garments, or antelope hide, or strips of antelope hide, or kusa-grass robes, or bark-fiber robes, or wood-chip robes, or hair blankets, or horsehair blankets, or owl-feather garments. Indeed, monks, this is what other sectarians, wanderers, declare as seclusion in robes.\n\nHerein, monks, other sectarians, wanderers, declare seclusion in alms food, existing on a diet of vegetables, or millet, or wild rice, or moss, or rice chaff, or rice bran, or rice gruel scum, or sesame paste, or grass, or cow dung, subsisting on roots and fruits from the wilderness, eating only fallen fruits. Indeed, monks, this is what other sectarians, wanderers, declare as seclusion in alms food.\n\nHerein, monks, other sectarians, wanderers, declare seclusion in dwelling places: the wilderness, at the foot of a tree, a charnel ground, a forest grove, the open air, a pile of straw, a granary. Indeed, monks, this is what other sectarians, wanderers, declare as seclusion in dwelling places. These are, monks, the three types of seclusion declared by other sectarians, wanderers.\n\nBut monks, there are these three types of seclusion for a bhikkhu in this Dhamma and Discipline. Which three? Here, monks, a bhikkhu is virtuous, and unvirtuous conduct is abandoned in him, and he is secluded from it; he holds right view, and wrong view is abandoned in him, and he is secluded from it; he is one whose defilements are destroyed, and defilements are abandoned in him, and he is secluded from them. When, monks, a bhikkhu is virtuous, and unvirtuous conduct is abandoned in him, and he is secluded from it; when he holds right view, and wrong view is abandoned in him, and he is secluded from it; when he is one whose defilements are destroyed, and defilements are abandoned in him, and he is secluded from them—such a bhikkhu, monks, is called 'one who has attained the best, attained the essence, pure, established in the essence.'\n\nJust as, monks, a householder farmer might have a flourishing rice field. That householder farmer would quickly have it reaped. Having quickly had it reaped, he would quickly have it gathered. Having quickly had it gathered, he would quickly have it brought in. Having quickly had it brought in, he would quickly have a pile made. Having quickly had a pile made, he would quickly have it threshed. Having quickly had it threshed, he would quickly have the straw removed. Having quickly had the straw removed, he would quickly have the chaff removed. Having quickly had the chaff removed, he would quickly have it winnowed. Having quickly had it winnowed, he would quickly have it transported. Having quickly had it transported, he would quickly have it pounded. Having quickly had it pounded, he would quickly have the husks removed. In this way, monks, the grains of that householder farmer would be attained to the best, attained to the essence, pure, established in the essence.\n\nEven so, monks, when a bhikkhu is virtuous, and unvirtuous conduct is abandoned in him, and he is secluded from it; when he holds right view, and wrong view is abandoned in him, and he is secluded from it; when he is one whose defilements are destroyed, and defilements are abandoned in him, and he is secluded from them—such a bhikkhu, monks, is called 'one who has attained the best, attained the essence, pure, established in the essence.'",
      "sinhala": "භික්ෂූනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මේ තිදෙනා ප්‍රවිවේකයන් ලෙස පනවති. ඒ කවර තිදෙනෙක්ද? සිවුරු ප්‍රවිවේකය, පිණ්ඩපාත ප්‍රවිවේකය, සේනාසන ප්‍රවිවේකය.\n\nභික්ෂූනි, එහිලා අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ සිවුරු ප්‍රවිවේකය මෙසේ පනවති. ඔවුහු සණ වස්ත්‍රද, සියුම් සණ වස්ත්‍රද, මළසිරුරු පොරවන වස්ත්‍රද, පන්සකුලද, තිරිට වස්ත්‍රද, මුවසමද, මුවසම් කැබලිද, කුස තණ පටලද, වැල් පොතු වස්ත්‍රද, දඬු ලී පොතු වස්ත්‍රද, කෙස් ඇති කම්බිලිද, ලොම් ඇති කම්බිලිද, බකමූණු පිහාටු වස්ත්‍රද දරති. භික්ෂූනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ සිවුරු ප්‍රවිවේකය මෙසේ පනවති.\n\nභික්ෂූනි, එහිලා අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ පිණ්ඩපාත ප්‍රවිවේකය මෙසේ පනවති. ඔවුහු පලා භක්ෂණය කරන්නෝද වෙති, සාමාක ධාන්‍ය භක්ෂණය කරන්නෝද වෙති, නීවාර ධාන්‍ය භක්ෂණය කරන්නෝද වෙති, දද්දුල ධාන්‍ය භක්ෂණය කරන්නෝද වෙති, හාට ධාන්‍ය භක්ෂණය කරන්නෝද වෙති, කණ ධාන්‍ය භක්ෂණය කරන්නෝද වෙති, ආචාම නම් කැඳවතුර භක්ෂණය කරන්නෝද වෙති, පිඤ්ඤාක නම් කැඳවතුර භක්ෂණය කරන්නෝද වෙති, තණකොළ භක්ෂණය කරන්නෝද වෙති, ගොම භක්ෂණය කරන්නෝද වෙති, වනයේ මුල් පලතුරු අනුභව කරමින්ද ජීවත්වෙති, තමන්ටම හටගත් පලතුරු අනුභව කරන්නෝද වෙති. භික්ෂූනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ පිණ්ඩපාත ප්‍රවිවේකය මෙසේ පනවති.\n\nභික්ෂූනි, එහිලා අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ සේනාසන ප්‍රවිවේකය මෙසේ පනවති. ඔවුන් අරණ්‍යය, රුක්මුල්, සුසානභූමි, වනාන්තර, එළිමහන් තැන්, පිදුරු ගොඩවල්, සහ පිදුරු ගෙවල් හෝ ශුන්‍යාගාර වල වාසය කරති. භික්ෂූනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ සේනාසන ප්‍රවිවේකය මෙසේ පනවති. භික්ෂූනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මේ තිදෙනා ප්‍රවිවේකයන් ලෙස පනවති.\n\nභික්ෂූනි, මේ ධර්ම විනයෙහි භික්ෂුවකට ඇති ප්‍රවිවේක තුනක් වෙති. ඒ කවර තිදෙනෙක්ද? භික්ෂූනි, මෙහිලා භික්ෂුව සිල්වතෙක් වන්නේය, දූසීල බව ඔහුගෙන් ප්‍රහීණ වී ඇත්තේය, එයින් හෙතෙම වෙන් වූවෙක් වේ. හෙතෙම සම්මාදිට්ඨිකයෙක් වන්නේය, මිථ්‍යාදෘෂ්ටිය ඔහුගෙන් ප්‍රහීණ වී ඇත්තේය, එයින් හෙතෙම වෙන් වූවෙක් වේ. හෙතෙම ක්ෂීණාශ්‍රවයෙක් වන්නේය, ආශ්‍රවයන් ඔහුගෙන් ප්‍රහීණ වී ඇත්තේය, එයින් හෙතෙම වෙන් වූවෙක් වේ. භික්ෂූනි, යම් හෙයකින් භික්ෂුව සිල්වතෙක් වන්නේද, දූසීල බව ඔහුගෙන් ප්‍රහීණ වී ඇත්තේ වේද, එයින් හෙතෙම වෙන් වූවෙක් වේද; හෙතෙම සම්මාදිට්ඨිකයෙක් වන්නේද, මිථ්‍යාදෘෂ්ටිය ඔහුගෙන් ප්‍රහීණ වී ඇත්තේ වේද, එයින් හෙතෙම වෙන් වූවෙක් වේද; හෙතෙම ක්ෂීණාශ්‍රවයෙක් වන්නේද, ආශ්‍රවයන් ඔහුගෙන් ප්‍රහීණ වී ඇත්තේ වේද, එයින් හෙතෙම වෙන් වූවෙක් වේද; භික්ෂූනි, මේ භික්ෂුව 'අග්‍රයට පැමිණි, සාරයට පැමිණි, පිරිසිදු වූ, සාරයෙහි පිහිටි භික්ෂුව' යැයි කියනු ලැබේ.\n\nභික්ෂූනි, යම්සේ නම් ගොවියෙකුගේ ගෙහිමියෙකුට සශ්‍රීක වූ වී කුඹුරක් ඇත්තේය. හෙතෙම එම වී ඉක්මනින් ඉක්මනින් කපවයි. ඉක්මනින් ඉක්මනින් කප්පවා ඉක්මනින් ඉක්මනින් ගොඩගසවයි. ඉක්මනින් ඉක්මනින් ගොඩගස්වා ඉක්මනින් ඉක්මනින් ඉවත් කරවයි. ඉක්මනින් ඉක්මනින් ඉවත් කරවා ඉක්මනින් ඉක්මනින් ගොඩක් කරවයි. ඉක්මනින් ඉක්මනින් ගොඩක් කරවා ඉක්මනින් ඉක්මනින් පාගවයි. ඉක්මනින් ඉක්මනින් පාගවා ඉක්මනින් ඉක්මනින් පිදුරු ඉවත් කරවයි. ඉක්මනින් ඉක්මනින් පිදුරු ඉවත් කරවා ඉක්මනින් ඉක්මනින් දහයියා ඉවත් කරවයි. ඉක්මනින් ඉක්මනින් දහයියා ඉවත් කරවා ඉක්මනින් ඉක්මනින් පාවා හරවයි. ඉක්මනින් ඉක්මනින් පාවා හරවා ඉක්මනින් ඉක්මනින් (ගබඩාවට) ගෙන යවයි. ඉක්මනින් ඉක්මනින් ගෙන ගොස් ඉක්මනින් ඉක්මනින් කොටවයි. ඉක්මනින් ඉක්මනින් කොටවා ඉක්මනින් ඉක්මනින් පොතු ඉවත් කරවයි. භික්ෂූනි, එම ගොවි ගෘහපතියාගේ එම ධාන්‍ය අග්‍රයට පැමිණ, සාරයට පැමිණ, පිරිසිදු වී, සාරයෙහි පිහිටා තිබෙන්නේය.\n\nභික්ෂූනි, එලෙසින්ම යම් හෙයකින් භික්ෂුව සිල්වතෙක් වන්නේද, දූසීල බව ඔහුගෙන් ප්‍රහීණ වී ඇත්තේ වේද, එයින් හෙතෙම වෙන් වූවෙක් වේද; හෙතෙම සම්මාදිට්ඨිකයෙක් වන්නේද, මිථ්‍යාදෘෂ්ටිය ඔහුගෙන් ප්‍රහීණ වී ඇත්තේ වේද, එයින් හෙතෙම වෙන් වූවෙක් වේද; හෙතෙම ක්ෂීණාශ්‍රවයෙක් වන්නේද, ආශ්‍රවයන් ඔහුගෙන් ප්‍රහීණ වී ඇත්තේ වේද, එයින් හෙතෙම වෙන් වූවෙක් වේද; භික්ෂූනි, මේ භික්ෂුව 'අග්‍රයට පැමිණි, සාරයට පැමිණි, පිරිසිදු වූ, සාරයෙහි පිහිටි භික්ෂුව' යැයි කියනු ලැබේ.",
      "paliTitle": "Pavivekasuttaṃ",
      "englishTitle": "The Discourse on Seclusion",
      "sinhalaTitle": "පවිවේක සූත්‍රය"
    },
    {
      "number": 95,
      "pali": "‘‘Seyyathāpi, bhikkhave, saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno [abbhussukkamāno (sī. pī.)] sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocati ca. ‘‘Evamevaṃ kho, bhikkhave, yato ariyasāvakassa virajaṃ vītamalaṃ dhammacakkhuṃ uppajjati [udapādi (sabbattha)], saha dassanuppādā, bhikkhave, ariyasāvakassa tīṇi saṃyojanāni pahīyanti – sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso. ‘‘Athāparaṃ dvīhi dhammehi niyyāti abhijjhāya ca byāpādena ca. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Tasmiṃ ce, bhikkhave, samaye ariyasāvako kālaṃ kareyya, natthi taṃ [tassa (ka.)] saṃyojanaṃ yena saṃyojanena saṃyutto ariyasāvako puna imaṃ [punayimaṃ (syā. kaṃ. ka.)] lokaṃ āgaccheyyā’’ti. Tatiyaṃ.",
      "english": "Just as, monks, in the autumn season, when the sky is clear and free of clouds, the sun, rising in the sky, having dispelled all darkness in the heavens, shines, radiates heat, and blazes forth. Even so, monks, when to a noble disciple the dust-free, stainless Dhamma-eye arises, with the arising of that vision, monks, three fetters are abandoned by that noble disciple – personality view, skeptical doubt, and clinging to rules and observances. Furthermore, they are released from covetousness and ill will. They, quite secluded from sensual pleasures, secluded from unwholesome states, with directed thought and sustained thought, born of seclusion, rapture and happiness, enter and dwell in the first jhāna. If, monks, at that time, a noble disciple were to pass away, there is no fetter by which that noble disciple, being bound, would return to this world.",
      "sinhala": "භික්ෂූණි, යම්සේ සරත් ඍතුවේදී වලාකුළු පහව ගොස්, වලාකුළු රහිත අහසෙහි, සූර්යයා අහසට නැඟී, ආකාශයෙහි පවතින සියලු අන්ධකාරය දුරු කොට, බබළන්නේ ද, තපින්නේ ද, ප්‍රකෘතිමත් වන්නේ ද වේ.\n\nඑසෙයින්ම භික්ෂූණි, යම් කලෙක ආර්ය ශ්‍රාවකයා හට විරජ වූ, කෙලෙස් රහිත වූ ධර්ම චක්ෂුව පහළ වේ ද, භික්ෂූණි, ඒ දැකීම පහළ වීමත් සමගම ආර්ය ශ්‍රාවකයාගේ සංයෝජන තුනක් ප්‍රහීණ වෙයි – එනම්, සක්කායදිට්ඨි, විචිකිච්ඡා, සීලබ්බතපරාමාසය යි.\n\nඉන් අනතුරුව, ලෝභය හා ව්‍යාපාදය යන ධර්ම ද්වයෙන් ද ඔහු නික්මෙයි. ඔහු කාමයන්ගෙන් වෙන් වී, අකුසල ධර්මයන්ගෙන් වෙන් වී, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප සහිත වූ ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි.\n\nභික්ෂූණි, යම් හෙයකින් ඒ අවස්ථාවේදී ආර්ය ශ්‍රාවකයා කාලක්‍රියා කරන්නේ නම්, ආර්ය ශ්‍රාවකයා යම් සංයෝජනයකින් බැඳී නැවත මේ ලෝකයට පැමිණෙන්නේ නම්, එවැනි සංයෝජනයක් නැත්තේ ය.",
      "paliTitle": "Saradasuttaṃ",
      "englishTitle": "The Discourse on Autumn",
      "sinhalaTitle": "සරද සූත්‍රය"
    },
    {
      "number": 96,
      "pali": "‘‘Tisso imā, bhikkhave, parisā. Katamā tisso? Aggavatī parisā, vaggā parisā, samaggā parisā. ‘‘Katamā ca, bhikkhave, aggavatī parisā? Idha, bhikkhave, yassaṃ parisāyaṃ therā bhikkhū na bāhulikā honti na sāthalikā, okkamane nikkhittadhurā paviveke pubbaṅgamā, vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā, vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ vuccati, bhikkhave, aggavatī parisā. ‘‘Katamā ca, bhikkhave, vaggā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, ayaṃ vuccati, bhikkhave, vaggā parisā. ‘‘Katamā ca, bhikkhave, samaggā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, ayaṃ vuccati, bhikkhave, samaggā parisā. ‘‘Yasmiṃ, bhikkhave, samaye bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, bahuṃ, bhikkhave, bhikkhū tasmiṃ samaye puññaṃ pasavanti. Brahmaṃ, bhikkhave, vihāraṃ tasmiṃ samaye bhikkhū viharanti, yadidaṃ muditāya cetovimuttiyā. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. ‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūreti, pabbatakandarapadarasākhā paripūrā kusobbhe [kussumbhe (sī. pī.), kusumbhe (syā. kaṃ. ka.)] paripūrenti, kusobbhā paripūrā mahāsobbhe paripūrenti, mahāsobbhā paripūrā kunnadiyo paripūrenti, kunnadiyo paripūrā mahānadiyo paripūrenti, mahānadiyo paripūrā samuddaṃ [samuddasāgare (ka.)] paripūrenti. ‘‘Evamevaṃ kho, bhikkhave, yasmiṃ samaye bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, bahuṃ, bhikkhave, bhikkhū tasmiṃ samaye puññaṃ pasavanti. Brahmaṃ, bhikkhave, vihāraṃ tasmiṃ samaye bhikkhū viharanti, yadidaṃ muditāya cetovimuttiyā. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Imā kho, bhikkhave, tisso parisā’’ti. Catutthaṃ.",
      "english": "Bhikkhus, there are these three assemblies. Which three? The excellent assembly, the factious assembly, and the harmonious assembly.\n\nAnd what, bhikkhus, is the excellent assembly? Here, bhikkhus, in that assembly the elder bhikkhus are not given to excessive socializing nor are they sluggish; having relinquished the burden of involvement, they are foremost in seclusion; they arouse energy for the attainment of the unattained, the comprehension of the uncomprehended, the realization of the unrealized. The latter generation follows their example, and they too are not given to excessive socializing nor are they sluggish, having relinquished the burden of involvement, foremost in seclusion, and they arouse energy for the attainment of the unattained, the comprehension of the uncomprehended, the realization of the unrealized. This, bhikkhus, is called the excellent assembly.\n\nAnd what, bhikkhus, is the factious assembly? Here, bhikkhus, in that assembly the bhikkhus are given to quarrels, contention, and disputes; they live piercing each other with the spears of their mouths. This, bhikkhus, is called the factious assembly.\n\nAnd what, bhikkhus, is the harmonious assembly? Here, bhikkhus, in that assembly the bhikkhus are harmonious, conversing pleasantly, not disputing; like milk and water mixed together, they live looking at each other with eyes of affection. This, bhikkhus, is called the harmonious assembly.\n\nBhikkhus, when bhikkhus are harmonious, conversing pleasantly, not disputing, like milk and water mixed together, living looking at each other with eyes of affection, at that time, bhikkhus generate much merit. At that time, bhikkhus dwell in a divine abiding, namely, in the liberation of mind through appreciative joy. For one who is appreciative, rapture arises; for one whose mind is rapturous, the body becomes tranquil; one whose body is tranquil experiences happiness; for one who is happy, the mind becomes concentrated.\n\nJust as, bhikkhus, when heavy rain falls on a mountaintop, that water, flowing downwards according to the slope, fills the mountain clefts, crevices, and ravines. When the mountain clefts, crevices, and ravines are full, they fill the small pools. When the small pools are full, they fill the great pools. When the great pools are full, they fill the small rivers. When the small rivers are full, they fill the great rivers. When the great rivers are full, they fill the ocean.\n\nIn the same way, bhikkhus, when bhikkhus are harmonious, conversing pleasantly, not disputing, like milk and water mixed together, living looking at each other with eyes of affection, at that time, bhikkhus generate much merit. At that time, bhikkhus dwell in a divine abiding, namely, in the liberation of mind through appreciative joy. For one who is appreciative, rapture arises; for one whose mind is rapturous, the body becomes tranquil; one whose body is tranquil experiences happiness; for one who is happy, the mind becomes concentrated.\n\nThese, bhikkhus, are the three assemblies.",
      "sinhala": "භික්ෂූනි, මේ සභා තුනකි. කවර සභා තුනක්ද යත්? අග්ගවතී සභාව, වග්ග සභාව, සමග්ග සභාව වශයෙනි.\n\nභික්ෂූනි, අග්ගවතී සභාව යනු කවරක්ද? භික්ෂූනි, මෙහිලා යම් සභාවක් ඇද්ද, එහි සිටින ථේර භික්ෂූහු බහුල කටයුතුවලට නොඇලී, නිදිමතට හා අලසකමට නොවැටී, ධර්ම මාර්ගයට පිවිසීම සඳහා උර දී, විවේකයට ප්‍රමුඛත්වය දෙමින්, නොලැබූ අරහත් ඵලය ලැබීම පිණිසත්, අවබෝධ නොකළ සත්‍ය අවබෝධ කර ගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ නිවන ප්‍රත්‍යක්ෂ කර ගැනීම පිණිසත් වීර්ය වඩති. ඔවුන්ගේ පසුකාලීන පරම්පරාව ද ඔවුන්ගේ ආදර්ශය අනුගමනය කරයි. ඔවුහු ද බහුල කටයුතුවලට නොඇලී, නිදිමතට හා අලසකමට නොවැටී, ධර්ම මාර්ගයට පිවිසීම සඳහා උර දී, විවේකයට ප්‍රමුඛත්වය දෙමින්, නොලැබූ අරහත් ඵලය ලැබීම පිණිසත්, අවබෝධ නොකළ සත්‍ය අවබෝධ කර ගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ නිවන ප්‍රත්‍යක්ෂ කර ගැනීම පිණිසත් වීර්ය වඩති. භික්ෂූනි, මේ සභාව අග්ගවතී සභාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, වග්ග සභාව යනු කවරක්ද? භික්ෂූනි, මෙහිලා යම් සභාවක් ඇද්ද, එහි සිටින භික්ෂූහු කලහකාරී වී, විවාද ඇතිකරගෙන, එකිනෙකාට වචන නමැති ඊතලවලින් විදිනු ලබමින් වාසය කරති. භික්ෂූනි, මේ සභාව වග්ග සභාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සමග්ග සභාව යනු කවරක්ද? භික්ෂූනි, මෙහිලා යම් සභාවක් ඇද්ද, එහි සිටින භික්ෂූහු සමගිව, සතුටු වෙමින්, වාද විවාද නොකරමින්, කිරි සහ වතුර මෙන් (එක්ව), එකිනෙකාට ප්‍රිය දෑසින් බලමින් වාසය කරති. භික්ෂූනි, මේ සභාව සමග්ග සභාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, යම් කලෙක භික්ෂූහු සමගිව, සතුටු වෙමින්, වාද විවාද නොකරමින්, කිරි සහ වතුර මෙන් (එක්ව), එකිනෙකාට ප්‍රිය දෑසින් බලමින් වාසය කරද්ද, භික්ෂූනි, ඒ කලට භික්ෂූහු බොහෝ පින් රැස් කර ගනිති. භික්ෂූනි, ඒ කලට භික්ෂූහු බ්‍රහ්ම විහරණයෙන්, එනම් මුදිතා චේතෝවිමුක්තියෙන් වාසය කරති. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය ඇති වේ. ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කය ඇති තැනැත්තා සැප විඳියි. සැප විඳින තැනැත්තාගේ සිත සමාධිමත් වේ.\n\nභික්ෂූනි, යම්සේ මහ පොද වැටෙන වර්ෂාවක් කඳු මුදුනක වසින විට, ඒ ජලය බෑවුම දිගේ ගලා යමින් කඳු හෙල්, බෑවුම් හා අතු ගංගා පුරවයි. කඳු හෙල්, බෑවුම් හා අතු ගංගා පිරුණු කල්හි, කුඩා දිය කඩිති පුරවයි. කුඩා දිය කඩිති පිරුණු කල්හි, මහත් දිය කඩිති පුරවයි. මහත් දිය කඩිති පිරුණු කල්හි, කුඩා ගංගා පුරවයි. කුඩා ගංගා පිරුණු කල්හි, මහ ගංගා පුරවයි. මහ ගංගා පිරුණු කල්හි, මුහුද පුරවයි.\n\nභික්ෂූනි, එපරිද්දෙන්ම, යම් කලෙක භික්ෂූහු සමගිව, සතුටු වෙමින්, වාද විවාද නොකරමින්, කිරි සහ වතුර මෙන් (එක්ව), එකිනෙකාට ප්‍රිය දෑසින් බලමින් වාසය කරද්ද, භික්ෂූනි, ඒ කලට භික්ෂූහු බොහෝ පින් රැස් කර ගනිති. භික්ෂූනි, ඒ කලට භික්ෂූහු බ්‍රහ්ම විහරණයෙන්, එනම් මුදිතා චේතෝවිමුක්තියෙන් වාසය කරති. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය ඇති වේ. ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කය ඇති තැනැත්තා සැප විඳියි. සැප විඳින තැනැත්තාගේ සිත සමාධිමත් වේ. භික්ෂූනි, මේ සභා තුනයි.",
      "paliTitle": "Parisāsuttaṃ",
      "englishTitle": "The Discourse on Assemblies",
      "sinhalaTitle": "පරිසා සූත්‍රය"
    },
    {
      "number": 97,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro [bhaddo (ka.)] assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ [saṅkhaṃ (sī. syā. kaṃ. pī.)] gacchati. Katamehi tīhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. ‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Pañcamaṃ.",
      "english": "Monks, a king's noble thoroughbred horse, endowed with three qualities, is worthy of a king, fit for a king's use, and is reckoned as a king's asset. Which three? Here, monks, a king's noble thoroughbred horse is endowed with beauty, endowed with strength, and endowed with speed. Indeed, monks, a king's noble thoroughbred horse, endowed with these three qualities, is worthy of a king, fit for a king's use, and is reckoned as a king's asset.\n\nIn the same way, monks, a monk endowed with three qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, and is an unsurpassed field of merit for the world. Which three? Here, monks, a monk is endowed with luster, endowed with spiritual strength, and endowed with penetrative insight.\n\nAnd how, monks, is a monk endowed with luster? Here, monks, a monk is virtuous, lives restrained by the Pātimokkha, perfect in conduct and resort, seeing danger even in the slightest faults, and undertakes and trains in the training rules. That, monks, is how a monk is endowed with luster.\n\nAnd how, monks, is a monk endowed with spiritual strength? Here, monks, a monk lives with aroused energy for the abandoning of unwholesome states and for the accomplishment of wholesome states; he is strong-willed, firm in effort, and does not abandon his burden in wholesome states. That, monks, is how a monk is endowed with spiritual strength.\n\nAnd how, monks, is a monk endowed with penetrative insight? Here, monks, a monk understands as it actually is: ‘This is suffering,’ he understands as it actually is: ‘This is the origin of suffering,’ he understands as it actually is: ‘This is the cessation of suffering,’ he understands as it actually is: ‘This is the path leading to the cessation of suffering.’ That, monks, is how a monk is endowed with penetrative insight.\n\nIndeed, monks, a monk endowed with these three qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, and is an unsurpassed field of merit for the world.",
      "sinhala": "‘‘භික්ෂූණි, කරුණු තුනකින් යුක්ත වූ රජුගේ සුජාත අශ්වයා රජුට සුදුසු වන්නේය, රජුට භුක්ති විඳීමට සුදුසු වන්නේය, රජුගේම අංගයක් සේ ගණන් ගැනේ. ඒ තුන කුමක්ද? භික්ෂූණි, මෙහිදී රජුගේ සුජාත අශ්වයා වර්ණ සම්පන්න ද වේ, බල සම්පන්න ද වේ, වේග සම්පන්න ද වේ. භික්ෂූණි, මේ කරුණු තුනෙන් යුක්ත වූ රජුගේ සුජාත අශ්වයා රජුට සුදුසු වන්නේය, රජුට භුක්ති විඳීමට සුදුසු වන්නේය, රජුගේම අංගයක් සේ ගණන් ගැනේ.\n\nභික්ෂූණි, එලෙසම කරුණු තුනකින් යුක්ත වූ භික්ෂුව ආහුණෙය වන්නේය, පාහුණෙය වන්නේය, දක්‍ෂිණෙය වන්නේය, ඇඳිලි පිදීමට සුදුසු වන්නේය, ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රයක් වන්නේය. ඒ තුන කුමක්ද? භික්ෂූණි, මෙහිදී භික්ෂුව වර්ණ සම්පන්න ද වේ, බල සම්පන්න ද වේ, වේග සම්පන්න ද වේ.\n\n‘‘භික්ෂූණි, භික්ෂුව වර්ණ සම්පන්න වන්නේ කෙසේද? භික්ෂූණි, මෙහිදී භික්ෂුව සීලවන්ත වන්නේය. ප්‍රාතිමෝක්ෂ සංවරයෙන් වැසී වාසය කරන්නේය. ආචාර ගෝචර සම්පන්න වන්නේය. අල්පමාත්‍ර වූ වැරදිවල පවා භය දකින සුළු වන්නේය. ශික්‍ෂා පදයන් සමාදන්ව ශික්‍ෂා කරන්නේය. භික්ෂූණි, භික්ෂුව වර්ණ සම්පන්න වන්නේ එලෙසය.\n\n‘‘භික්ෂූණි, භික්ෂුව බල සම්පන්න වන්නේ කෙසේද? භික්ෂූණි, මෙහිදී භික්ෂුව අකුසල ධර්මයන් ප්‍රහාණය කිරීම සඳහා ද, කුසල ධර්මයන් උපදවා ගැනීම සඳහා ද, ආරම්භක වීර්යයෙන් යුතුව වාසය කරන්නේය. ස්ථිර චිත්ත ශක්තියෙන් යුක්තව, දැඩි පරාක්‍රමයෙන් යුක්තව, කුසල ධර්මයන්හිදී නොපසුබට උත්සාහයෙන් යුක්තව වාසය කරන්නේය. භික්ෂූණි, භික්ෂුව බල සම්පන්න වන්නේ එලෙසය.\n\n‘‘භික්ෂූණි, භික්ෂුව වේග සම්පන්න වන්නේ කෙසේද? භික්ෂූණි, මෙහිදී භික්ෂුව ‘මෙය දුක’ යැයි ඇති සැටියෙන් දනී. ‘මෙය දුක ඇතිවීමට හේතුව’ යැයි ඇති සැටියෙන් දනී. ‘මෙය දුක නැති කිරීම’ යැයි ඇති සැටියෙන් දනී. ‘මෙය දුක නැති කිරීමට පමුණුවන ප්‍රතිපදාව’ යැයි ඇති සැටියෙන් දනී. භික්ෂූණි, භික්ෂුව වේග සම්පන්න වන්නේ එලෙසය. භික්ෂූණි, මේ කරුණු තුනෙන් යුක්ත වූ භික්ෂුව ආහුණෙය වන්නේය, පාහුණෙය වන්නේය, දක්‍ෂිණෙය වන්නේය, ඇඳිලි පිදීමට සුදුසු වන්නේය, ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රයක් වන්නේය.",
      "paliTitle": "Paṭhamaājānīyasuttaṃ",
      "englishTitle": "The First Discourse on the Thoroughbred",
      "sinhalaTitle": "පළමු ආජානීය සූත්‍රය"
    },
    {
      "number": 98,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhayaṃ gacchati. Katamehi tīhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. ‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, endowed with three qualities, a fine royal thoroughbred horse is worthy of a king, fit for a king's use, and counts as a valuable asset to the king. Which three? Here, monks, a fine royal thoroughbred horse is endowed with beauty, endowed with strength, and endowed with swiftness. Indeed, monks, endowed with these three qualities, a fine royal thoroughbred horse is worthy of a king, fit for a king's use, and counts as a valuable asset to the king.\n\nSimilarly, monks, endowed with three qualities, a monk is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of salutations, and is an unsurpassable field of merit for the world. Which three? Here, monks, a monk is endowed with moral beauty, endowed with spiritual strength, and endowed with quick penetration.\n\nAnd how, monks, is a monk endowed with moral beauty? Here, monks, a monk is virtuous, dwells restrained in the Pātimokkha, is perfect in conduct and resort, seeing danger in the slightest faults, and undertaking and training in the training rules. Thus, monks, a monk is endowed with moral beauty.\n\nAnd how, monks, is a monk endowed with spiritual strength? Here, monks, a monk dwells with aroused energy for the abandonment of unwholesome states and for the acquisition of wholesome states; he is firm in strength, steadfast in exertion, and does not cast off the burden in wholesome states. Thus, monks, a monk is endowed with spiritual strength.\n\nAnd how, monks, is a monk endowed with quick penetration? Here, monks, with the complete destruction of the five lower fetters, a monk arises spontaneously (in the Pure Abodes), there attains final Nibbāna, and is not liable to return from that world. Thus, monks, a monk is endowed with quick penetration.\n\nIndeed, monks, endowed with these three qualities, a monk is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of salutations, and is an unsurpassable field of merit for the world.",
      "sinhala": "මහණෙනි, කරුණු තුනකින් යුක්ත වූ රජුගේ ශ්‍රේෂ්ඨ අශ්වයා රජුට සුදුසු වේ, රජුට භුක්ති විඳීමට සුදුසු වේ, රජුගේ වස්තුවක් ලෙසම සැලකේ. ඒ කරුණු තුන කවරේද? මහණෙනි, මෙහිදී රජුගේ ශ්‍රේෂ්ඨ අශ්වයා වර්ණ සම්පන්න ද වේ, බලසම්පන්න ද වේ, වේග සම්පන්න ද වේ. මහණෙනි, මේ කරුණු තුනෙන් යුක්ත වූ රජුගේ ශ්‍රේෂ්ඨ අශ්වයා රජුට සුදුසු වේ, රජුට භුක්ති විඳීමට සුදුසු වේ, රජුගේ වස්තුවක් ලෙසම සැලකේ.\n\nඑපරිද්දෙන්ම, මහණෙනි, කරුණු (ධර්ම) තුනකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ. ඒ කරුණු තුන කවරේද? මහණෙනි, මේ ලෝකයෙහි භික්ෂුව වර්ණ සම්පන්න ද වේ, බලසම්පන්න ද වේ, වේග සම්පන්න ද වේ.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් වර්ණ සම්පන්න වන්නේද? මහණෙනි, මෙහිදී භික්ෂුව සීලවන්ත වේ; ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි; ආචාර ගෝචර සම්පන්න වේ; අල්පමාත්‍ර වූ දෝෂයන්හි පවා භය දකින්නේ, හික්මෙන්නේ, සික්ඛාපදයන් සමාදන්ව හික්මෙයි. මහණෙනි, භික්ෂුව මෙසේ වර්ණ සම්පන්න වේ.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් බලසම්පන්න වන්නේද? මහණෙනි, මෙහිදී භික්ෂුව අකුසල ධර්මයන් ප්‍රහාණය කිරීම සඳහා ද, කුසල ධර්මයන් උපදවා ගැනීම සඳහා ද, ආරම්භක වීර්යයෙන් යුක්තව වාසය කරයි. ඔහු ධෛර්ය සම්පන්න, දැඩි පරාක්‍රමයෙන් යුක්ත, කුසල ධර්මයන් කෙරෙහි නොකඩවා උත්සාහවත් වූවෙක් වේ. මහණෙනි, භික්ෂුව මෙසේ බලසම්පන්න වේ.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් වේග සම්පන්න වන්නේද? මහණෙනි, මෙහිදී භික්ෂුව පංච ඕරම්භාගීය සංයෝජන ක්ෂය කිරීමෙන් ඕපපාතික වේ (දෙව්ලොව උපදින්නේ වේ), එහිදී පිරිනිවන් පාන්නේ වේ, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වේ. මහණෙනි, භික්ෂුව මෙසේ වේග සම්පන්න වේ.\n\nමහණෙනි, මේ කරුණු තුනෙන් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ.",
      "paliTitle": "Dutiyaājānīyasuttaṃ",
      "englishTitle": "Second Sutta on the Thoroughbred",
      "sinhalaTitle": "දුතිය ආජානීය සූත්‍රය"
    },
    {
      "number": 99,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhayaṃ gacchati. Katamehi tīhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. ‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti. ‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ.",
      "english": "“Mendicants, a king’s excellent thoroughbred horse, endowed with three qualities, is fit for a king, worthy of royal use, and counts as a royal asset. What three? Here, mendicants, a king’s excellent thoroughbred horse is endowed with beauty, strength, and speed. Indeed, mendicants, endowed with these three qualities, a king’s excellent thoroughbred horse is fit for a king, worthy of royal use, and counts as a royal asset.\n\n“In the same way, mendicants, a monk endowed with three qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is an unsurpassed field of merit for the world. What three? Here, mendicants, a monk is endowed with ‘beauty,’ ‘strength,’ and ‘speed.’\n\n“And how, mendicants, is a monk endowed with ‘beauty’? Here, mendicants, a monk is virtuous; he dwells restrained by the Pāṭimokkha restraint, perfect in conduct and domain, seeing danger in the slightest faults, and undertaking the training rules, he trains himself. That is how, mendicants, a monk is endowed with ‘beauty.’\n\n“And how, mendicants, is a monk endowed with ‘strength’? Here, mendicants, a monk dwells with aroused energy for the abandonment of unwholesome states and for the acquisition of wholesome states; he is steadfast, firm in effort, and does not lay down the burden in wholesome states. That is how, mendicants, a monk is endowed with ‘strength.’\n\n“And how, mendicants, is a monk endowed with ‘speed’? Here, mendicants, by the destruction of the taints, he enters and dwells in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life. That is how, mendicants, a monk is endowed with ‘speed.’\n\n“Indeed, mendicants, endowed with these three qualities, a monk is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is an unsurpassed field of merit for the world.”",
      "sinhala": "මහණෙනි, කරුණු තුනකින් යුක්ත වූ රජුගේ උසස් ජාතියේ අශ්වයෙක් රජුට සුදුසු වේ, රජුට භෝගයෙක් වේ, රජුගේ අංගයක් ලෙසටම ගණන් ගැනේ. කවර කරුණු තුනකින්ද? මහණෙනි, මෙහිලා රජුගේ උසස් ජාතියේ අශ්වයෙක් වර්ණ සම්පත්තියෙන් ද යුක්ත වේ, බල සම්පත්තියෙන් ද යුක්ත වේ, ජව සම්පත්තියෙන් ද යුක්ත වේ. මහණෙනි, මේ කරුණු තුනින් යුක්ත වූ රජුගේ උසස් ජාතියේ අශ්වයෙක් රජුට සුදුසු වේ, රජුට භෝගයෙක් වේ, රජුගේ අංගයක් ලෙසටම ගණන් ගැනේ.\n\nමහණෙනි, එසෙවම් කරුණු (ධර්ම) තුනකින් යුක්ත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, දෑත් එක්කොට වන්දනා කිරීමට සුදුසු වේ, ලෝකයාට අනුත්තර පින්කෙතක් වේ. කවර කරුණු තුනකින්ද? මහණෙනි, මෙහිලා භික්ෂුවක් වර්ණ සම්පත්තියෙන් ද යුක්ත වේ, බල සම්පත්තියෙන් ද යුක්ත වේ, ජව සම්පත්තියෙන් ද යුක්ත වේ. මහණෙනි, භික්ෂුවක් කෙසේ නම් වර්ණ සම්පත්තියෙන් යුක්ත වේද? මහණෙනි, මෙහිලා භික්ෂුවක් සීලවන්ත වේ, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි, ආචාර සම්පන්න වේ, ගෝචර සම්පන්න වේ, අණු පමණ වැරදිවල පවා භය දකින සුළු වේ, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. මහණෙනි, මෙසේ භික්ෂුවක් වර්ණ සම්පත්තියෙන් යුක්ත වේ. මහණෙනි, භික්ෂුවක් කෙසේ නම් බල සම්පත්තියෙන් යුක්ත වේද? මහණෙනි, මෙහිලා භික්ෂුවක් අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස, කුසල ධර්මයන් උපදවා ගැනීම පිණිස වීර්ය අරඹා වාසය කරයි, ධෛර්ය සම්පන්න වේ, දැඩි පරාක්‍රමයකින් යුක්ත වේ, කුසල ධර්මයන්හි (තමාගේ) බර අත්නොහළ කෙනෙක් වේ. මහණෙනි, මෙසේ භික්ෂුවක් බල සම්පත්තියෙන් යුක්ත වේ. මහණෙනි, භික්ෂුවක් කෙසේ නම් ජව සම්පත්තියෙන් යුක්ත වේද? මහණෙනි, මෙහිලා භික්ෂුවක් ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය සහ ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, (එය) උපදවාගෙන වාසය කරයි. මහණෙනි, මෙසේ භික්ෂුවක් ජව සම්පත්තියෙන් යුක්ත වේ. මහණෙනි, මේ කරුණු තුනින් යුක්ත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, දෑත් එක්කොට වන්දනා කිරීමට සුදුසු වේ, ලෝකයාට අනුත්තර පින්කෙතක් වේ.",
      "paliTitle": "Tatiyaājānīyasuttaṃ",
      "englishTitle": "Third Discourse on the Thoroughbred",
      "sinhalaTitle": "තතිය ආජානීය සූත්‍රය"
    },
    {
      "number": 100,
      "pali": "‘‘Navopi, bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca; majjhimopi, bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca; jiṇṇopi, bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca. Jiṇṇampi, bhikkhave, potthakaṃ ukkhaliparimajjanaṃ vā karonti saṅkārakūṭe vā naṃ [taṃ (sī.), ṭhāne (ka.)] chaḍḍenti. ‘‘Evamevaṃ kho, bhikkhave, navo cepi bhikkhu hoti dussīlo pāpadhammo. Idamassa dubbaṇṇatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dubbaṇṇo tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Idamassa dukkhasamphassatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dukkhasamphasso tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so [yesaṃ kho pana (sī. syā. kaṃ. pī.), yesaṃ so (ka.) pu. pa. 116 passitabbaṃ] paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, tesaṃ taṃ na mahapphalaṃ hoti na mahānisaṃsaṃ. Idamassa appagghatāya vadāmi. Seyyathāpi so, bhikkhave, potthako appaggho tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Majjhimo cepi, bhikkhave, bhikkhu hoti…pe… thero cepi, bhikkhave, bhikkhu hoti dussīlo pāpadhammo, idamassa dubbaṇṇatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dubbaṇṇo tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Idamassa dukkhasamphassatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dukkhasamphasso tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, tesaṃ taṃ na mahapphalaṃ hoti na mahānisaṃsaṃ. Idamassa appagghatāya vadāmi. Seyyathāpi so, bhikkhave, potthako appaggho tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘Evarūpo cāyaṃ, bhikkhave, thero bhikkhu saṅghamajjhe bhaṇati. Tamenaṃ bhikkhū evamāhaṃsu – ‘kiṃ nu kho tuyhaṃ bālassa abyattassa bhaṇitena, tvampi nāma bhaṇitabbaṃ maññasī’ti! So kupito anattamano tathārūpiṃ vācaṃ nicchāreti yathārūpāya vācāya saṅgho taṃ ukkhipati, saṅkārakūṭeva naṃ potthakaṃ. ‘‘Navampi, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca; majjhimampi, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca; jiṇṇampi, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca. Jiṇṇampi, bhikkhave, kāsikaṃ vatthaṃ ratanapaliveṭhanaṃ vā karoti gandhakaraṇḍake vā naṃ pakkhipanti. ‘‘Evamevaṃ kho, bhikkhave, navo cepi bhikkhu hoti sīlavā kalyāṇadhammo, idamassa suvaṇṇatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ hitāya sukhāya. Idamassa sukhasamphassatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ sukhasamphassaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, tesaṃ taṃ mahapphalaṃ hoti mahānisaṃsaṃ. Idamassa mahagghatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ mahagghaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Majjhimo cepi, bhikkhave, bhikkhu hoti…pe… thero cepi, bhikkhave, bhikkhu hoti…pe… puggalaṃ vadāmi. ‘‘Evarūpo cāyaṃ, bhikkhave, thero bhikkhu saṅghamajjhe bhaṇati. Tamenaṃ bhikkhū evamāhaṃsu – ‘appasaddā āyasmanto hotha, thero bhikkhu dhammañca vinayañca bhaṇatī’ti. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kāsikavatthūpamā bhavissāma, na potthakūpamā’ti [kāsikaṃ vatthaṃ tathūpamāhaṃ bhavissāmi, na potthakūpamāhanti (ka.)]. Evañhi vo, bhikkhave, sikkhitabba’’nti. Aṭṭhamaṃ.",
      "english": "Even a new piece of hide, monks, is ill-colored, unpleasant to the touch, and of little value. Similarly, a middle-aged piece of hide is ill-colored, unpleasant to the touch, and of little value. And an old piece of hide is ill-colored, unpleasant to the touch, and of little value. Even an old piece of hide, monks, they use to wipe pots or discard on a rubbish heap.\n\nJust so, monks, even if a monk is new, but is immoral and of bad character. This, I say, is his unattractiveness. Just as that hide, monks, is ill-colored, so do I declare this person to be, monks. And those who associate with him, frequent him, attend upon him, and follow his views, for them this leads to long-term detriment and suffering. This, I say, is his unpleasantness to the touch. Just as that hide, monks, is unpleasant to the touch, so do I declare this person to be, monks. And those from whom he accepts robes, almsfood, lodging, and medicinal requisites for the sick, for them this does not bring great fruit or great benefit. This, I say, is his low value. Just as that hide, monks, is of little value, so do I declare this person to be, monks.\n\nEven if a monk, monks, is of middle seniority, but is immoral and of bad character. This, I say, is his unattractiveness. Just as that hide, monks, is ill-colored, so do I declare this person to be, monks. And those who associate with him, frequent him, attend upon him, and follow his views, for them this leads to long-term detriment and suffering. This, I say, is his unpleasantness to the touch. Just as that hide, monks, is unpleasant to the touch, so do I declare this person to be, monks. And those from whom he accepts robes, almsfood, lodging, and medicinal requisites for the sick, for them this does not bring great fruit or great benefit. This, I say, is his low value. Just as that hide, monks, is of little value, so do I declare this person to be, monks.\n\nEven if a monk, monks, is an elder, but is immoral and of bad character. This, I say, is his unattractiveness. Just as that hide, monks, is ill-colored, so do I declare this person to be, monks. And those who associate with him, frequent him, attend upon him, and follow his views, for them this leads to long-term detriment and suffering. This, I say, is his unpleasantness to the touch. Just as that hide, monks, is unpleasant to the touch, so do I declare this person to be, monks. And those from whom he accepts robes, almsfood, lodging, and medicinal requisites for the sick, for them this does not bring great fruit or great benefit. This, I say, is his low value. Just as that hide, monks, is of little value, so do I declare this person to be, monks.\n\nAnd such an elder monk, monks, speaks in the midst of the Sangha. Then the monks say to him, ‘What is the point of you, a fool and an unskillful person, speaking? Do you even think you should speak?’ He, being angry and displeased, utters such words that, because of those very words, the Sangha excommunicates him, just as that hide is cast onto a rubbish heap.\n\nEven a new piece of Kasi cloth, monks, is beautiful, pleasant to the touch, and of great value. Similarly, a middle-aged piece of Kasi cloth is beautiful, pleasant to the touch, and of great value. And an old piece of Kasi cloth is beautiful, pleasant to the touch, and of great value. Even an old piece of Kasi cloth, monks, they use to wrap jewels or place in a perfume box.\n\nJust so, monks, even if a monk is new, but is virtuous and of good character. This, I say, is his attractiveness. Just as that Kasi cloth, monks, is beautiful, so do I declare this person to be, monks. And those who associate with him, frequent him, attend upon him, and follow his views, for them this leads to long-term welfare and happiness. This, I say, is his pleasantness to the touch. Just as that Kasi cloth, monks, is pleasant to the touch, so do I declare this person to be, monks. And those from whom he accepts robes, almsfood, lodging, and medicinal requisites for the sick, for them this brings great fruit and great benefit. This, I say, is his great value. Just as that Kasi cloth, monks, is of great value, so do I declare this person to be, monks.\n\nEven if a monk, monks, is of middle seniority, but is virtuous and of good character. This, I say, is his attractiveness. Just as that Kasi cloth, monks, is beautiful, so do I declare this person to be, monks. And those who associate with him, frequent him, attend upon him, and follow his views, for them this leads to long-term welfare and happiness. This, I say, is his pleasantness to the touch. Just as that Kasi cloth, monks, is pleasant to the touch, so do I declare this person to be, monks. And those from whom he accepts robes, almsfood, lodging, and medicinal requisites for the sick, for them this brings great fruit and great benefit. This, I say, is his great value. Just as that Kasi cloth, monks, is of great value, so do I declare this person to be, monks.\n\nEven if a monk, monks, is an elder, but is virtuous and of good character. This, I say, is his attractiveness. Just as that Kasi cloth, monks, is beautiful, so do I declare this person to be, monks. And those who associate with him, frequent him, attend upon him, and follow his views, for them this leads to long-term welfare and happiness. This, I say, is his pleasantness to the touch. Just as that Kasi cloth, monks, is pleasant to the touch, so do I declare this person to be, monks. And those from whom he accepts robes, almsfood, lodging, and medicinal requisites for the sick, for them this brings great fruit and great benefit. This, I say, is his great value. Just as that Kasi cloth, monks, is of great value, so do I declare this person to be, monks.\n\nAnd such an elder monk, monks, speaks in the midst of the Sangha. Then the monks say, ‘Venerables, be silent, for the elder monk is speaking about the Dhamma and the Vinaya.’\n\nTherefore, monks, you should train yourselves thus: ‘We shall be like the Kasi cloth, not like the hide.’ For thus, monks, should you train yourselves.",
      "sinhala": "භික්‍ෂූණි, අලුත් පොත්තක් වුවද දුර්වර්ණ ය, අප්‍රසන්න ස්පර්ශය ඇත්තේය, අගය අඩුය. භික්‍ෂූණි, මධ්‍යම පොත්තක් වුවද දුර්වර්ණ ය, අප්‍රසන්න ස්පර්ශය ඇත්තේය, අගය අඩුය. භික්‍ෂූණි, ජරාවට පත් පොත්තක් වුවද දුර්වර්ණ ය, අප්‍රසන්න ස්පර්ශය ඇත්තේය, අගය අඩුය. භික්‍ෂූණි, ජරාවට පත් පොත්තක් බඳුනක් මදින රෙදි කැබැල්ලක් ලෙසට හෝ කසළ ගොඩකට හෝ දමති.\n\nභික්‍ෂූණි, එලෙසින්ම අලුත් භික්‍ෂුවක් වුවද දුශ්ශීල නම්, නපුරු ස්වභාවයන් ඇත්තේ නම්. මා මෙය ඔහුගේ දුර්වර්ණභාවය ලෙස කියමි. භික්‍ෂූණි, දුර්වර්ණ පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම්කිසි කෙනෙක් ඔහු සමඟ සේවනය කරත්ද, භජනය කරත්ද, ඇසුරු කරත්ද, ඔහුගේ දෘෂ්ටිය අනුගමනය කරත්ද, ඔවුන්ට එය බොහෝ කලක් අහිත පිණිසත් දුක පිණිසත් වෙයි. මා මෙය ඔහුගේ අප්‍රසන්න ස්පර්ශභාවය ලෙස කියමි. භික්‍ෂූණි, අප්‍රසන්න ස්පර්ශය ඇති පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම් කෙනෙකුගෙන් ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිගනීද, ඔවුන්ට එය මහත් ඵල පිණිස හෝ මහත් ආනිශංස පිණිස නොවේ. මා මෙය ඔහුගේ අගය අඩුභාවය ලෙස කියමි. භික්‍ෂූණි, අගය අඩු පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි.\n\nභික්‍ෂූණි, මධ්‍යම භික්‍ෂුවක් වුවද දුශ්ශීල නම්, නපුරු ස්වභාවයන් ඇත්තේ නම්. මා මෙය ඔහුගේ දුර්වර්ණභාවය ලෙස කියමි. භික්‍ෂූණි, දුර්වර්ණ පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම්කිසි කෙනෙක් ඔහු සමඟ සේවනය කරත්ද, භජනය කරත්ද, ඇසුරු කරත්ද, ඔහුගේ දෘෂ්ටිය අනුගමනය කරත්ද, ඔවුන්ට එය බොහෝ කලක් අහිත පිණිසත් දුක පිණිසත් වෙයි. මා මෙය ඔහුගේ අප්‍රසන්න ස්පර්ශභාවය ලෙස කියමි. භික්‍ෂූණි, අප්‍රසන්න ස්පර්ශය ඇති පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම් කෙනෙකුගෙන් ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිගනීද, ඔවුන්ට එය මහත් ඵල පිණිස හෝ මහත් ආනිශංස පිණිස නොවේ. මා මෙය ඔහුගේ අගය අඩුභාවය ලෙස කියමි. භික්‍ෂූණි, අගය අඩු පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. භික්‍ෂූණි, ස්ථවිර භික්‍ෂුවක් වුවද දුශ්ශීල නම්, නපුරු ස්වභාවයන් ඇත්තේ නම්. මා මෙය ඔහුගේ දුර්වර්ණභාවය ලෙස කියමි. භික්‍ෂූණි, දුර්වර්ණ පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම්කිසි කෙනෙක් ඔහු සමඟ සේවනය කරත්ද, භජනය කරත්ද, ඇසුරු කරත්ද, ඔහුගේ දෘෂ්ටිය අනුගමනය කරත්ද, ඔවුන්ට එය බොහෝ කලක් අහිත පිණිසත් දුක පිණිසත් වෙයි. මා මෙය ඔහුගේ අප්‍රසන්න ස්පර්ශභාවය ලෙස කියමි. භික්‍ෂූණි, අප්‍රසන්න ස්පර්ශය ඇති පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම් කෙනෙකුගෙන් ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිගනීද, ඔවුන්ට එය මහත් ඵල පිණිස හෝ මහත් ආනිශංස පිණිස නොවේ. මා මෙය ඔහුගේ අගය අඩුභාවය ලෙස කියමි. භික්‍ෂූණි, අගය අඩු පොත්තක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි.\n\nභික්‍ෂූණි, මෙබඳු වූ ස්ථවිර භික්‍ෂුවක් සංඝයා මැද කතා කරන්නේ නම්. එවිට අන්‍ය භික්‍ෂූහු ඔහුට මෙසේ කියති: 'නුවණ නැති, දක්‍ෂ නොවන ඔබට කතා කිරීමෙන් කුමක්ද? ඔබත් කතා කළ යුතු යැයි සිතන්නෙහිද!' ඔහු කිපී, අප්‍රසන්න සිතින් යුතුව, සංඝයා ඔහුව නෙරපා හරින ආකාරයේ වචන ප්‍රකාශ කරයි, හරියට කසළ ගොඩකට පොත්තක් දමන්නාක් මෙනි.\n\nභික්‍ෂූණි, අලුත් කාසි වස්ත්‍රයක් වුවද වර්ණවත් ය, ප්‍රසන්න ස්පර්ශය ඇත්තේය, මහත් අගය ඇත්තේය. භික්‍ෂූණි, මධ්‍යම කාසි වස්ත්‍රයක් වුවද වර්ණවත් ය, ප්‍රසන්න ස්පර්ශය ඇත්තේය, මහත් අගය ඇත්තේය. භික්‍ෂූණි, ජරාවට පත් කාසි වස්ත්‍රයක් වුවද වර්ණවත් ය, ප්‍රසන්න ස්පර්ශය ඇත්තේය, මහත් අගය ඇත්තේය. භික්‍ෂූණි, ජරාවට පත් කාසි වස්ත්‍රයක් වුවද රත්න ආවරණයක් ලෙසට හෝ සුවඳ කරඬුවලට හෝ දමති.\n\nභික්‍ෂූණි, එලෙසින්ම අලුත් භික්‍ෂුවක් වුවද ශීලවන්ත නම්, කල්‍යාණ ස්වභාවයන් ඇත්තේ නම්. මා මෙය ඔහුගේ සුන්දර වර්ණභාවය ලෙස කියමි. භික්‍ෂූණි, වර්ණවත් කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම්කිසි කෙනෙක් ඔහු සමඟ සේවනය කරත්ද, භජනය කරත්ද, ඇසුරු කරත්ද, ඔහුගේ දෘෂ්ටිය අනුගමනය කරත්ද, ඔවුන්ට එය බොහෝ කලක් හිත පිණිසත් සුවය පිණිසත් වෙයි. මා මෙය ඔහුගේ ප්‍රසන්න ස්පර්ශභාවය ලෙස කියමි. භික්‍ෂූණි, ප්‍රසන්න ස්පර්ශය ඇති කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම් කෙනෙකුගෙන් ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිගනීද, ඔවුන්ට එය මහත් ඵල පිණිසත් මහත් ආනිශංස පිණිසත් වෙයි. මා මෙය ඔහුගේ මහත් අගය ඇතිභාවය ලෙස කියමි. භික්‍ෂූණි, මහත් අගය ඇති කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි.\n\nභික්‍ෂූණි, මධ්‍යම භික්‍ෂුවක් වුවද ශීලවන්ත නම්, කල්‍යාණ ස්වභාවයන් ඇත්තේ නම්. මා මෙය ඔහුගේ සුන්දර වර්ණභාවය ලෙස කියමි. භික්‍ෂූණි, වර්ණවත් කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම්කිසි කෙනෙක් ඔහු සමඟ සේවනය කරත්ද, භජනය කරත්ද, ඇසුරු කරත්ද, ඔහුගේ දෘෂ්ටිය අනුගමනය කරත්ද, ඔවුන්ට එය බොහෝ කලක් හිත පිණිසත් සුවය පිණිසත් වෙයි. මා මෙය ඔහුගේ ප්‍රසන්න ස්පර්ශභාවය ලෙස කියමි. භික්‍ෂූණි, ප්‍රසන්න ස්පර්ශය ඇති කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම් කෙනෙකුගෙන් ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිගනීද, ඔවුන්ට එය මහත් ඵල පිණිසත් මහත් ආනිශංස පිණිසත් වෙයි. මා මෙය ඔහුගේ මහත් අගය ඇතිභාවය ලෙස කියමි. භික්‍ෂූණි, මහත් අගය ඇති කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. භික්‍ෂූණි, ස්ථවිර භික්‍ෂුවක් වුවද ශීලවන්ත නම්, කල්‍යාණ ස්වභාවයන් ඇත්තේ නම්. මා මෙය ඔහුගේ සුන්දර වර්ණභාවය ලෙස කියමි. භික්‍ෂූණි, වර්ණවත් කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම්කිසි කෙනෙක් ඔහු සමඟ සේවනය කරත්ද, භජනය කරත්ද, ඇසුරු කරත්ද, ඔහුගේ දෘෂ්ටිය අනුගමනය කරත්ද, ඔවුන්ට එය බොහෝ කලක් හිත පිණිසත් සුවය පිණිසත් වෙයි. මා මෙය ඔහුගේ ප්‍රසන්න ස්පර්ශභාවය ලෙස කියමි. භික්‍ෂූණි, ප්‍රසන්න ස්පර්ශය ඇති කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි. යම් කෙනෙකුගෙන් ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර පිළිගනීද, ඔවුන්ට එය මහත් ඵල පිණිසත් මහත් ආනිශංස පිණිසත් වෙයි. මා මෙය ඔහුගේ මහත් අගය ඇතිභාවය ලෙස කියමි. භික්‍ෂූණි, මහත් අගය ඇති කාසි වස්ත්‍රයක් යම්සේද, භික්‍ෂූණි, මේ පුද්ගලයාද ඊට උපමා කරමි.\n\nභික්‍ෂූණි, මෙබඳු වූ ස්ථවිර භික්‍ෂුවක් සංඝයා මැද කතා කරන්නේ නම්. එවිට අන්‍ය භික්‍ෂූහු ඔහුට මෙසේ කියති: 'ආයුෂ්මත්නි, නිහඬ වන්න, ස්ථවිර භික්‍ෂුව ධර්මය හා විනය දේශනා කරයි.' එහෙයින් භික්‍ෂූණි, මෙසේ හික්මිය යුතුය: 'අපි කාසි වස්ත්‍රයට උපමා වන්නෙමු, පොත්තකට උපමා නොවන්නෙමු.' භික්‍ෂූණි, එලෙසින්ම ඔබ විසින් හික්මිය යුතුයි.",
      "paliTitle": "Potthakasuttaṃ",
      "englishTitle": "The Discourse on the Bark-Cloth",
      "sinhalaTitle": "පොත්ථක සූත්‍රය"
    },
    {
      "number": 101,
      "pali": "‘‘Yo [yo kho (syā. kaṃ.), yo ca kho (ka.)], bhikkhave, evaṃ vadeyya – ‘yathā yathāyaṃ puriso kammaṃ karoti tathā tathā taṃ paṭisaṃvediyatī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso na hoti, okāso na paññāyati sammā dukkhassa antakiriyāya. Yo ca kho, bhikkhave, evaṃ vadeyya – ‘yathā yathā vedanīyaṃ ayaṃ puriso kammaṃ karoti tathā tathāssa vipākaṃ paṭisaṃvediyatī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso hoti, okāso paññāyati sammā dukkhassa antakiriyāya. Idha, bhikkhave, ekaccassa puggalassa appamattakampi pāpakammaṃ [pāpaṃ kammaṃ (sī. pī.)] kataṃ tamenaṃ nirayaṃ upaneti. Idha pana, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nā’ṇupi khāyati, kiṃ bahudeva. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti? Idha pana, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nā’ṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto [mahattā (sī. syā. kaṃ. pī.)] appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. ‘‘Seyyathāpi, bhikkhave, puriso loṇakapallaṃ [loṇaphalaṃ (sī. syā. kaṃ. pī.)] paritte udakamallake [udakakapallake (ka.)] pakkhipeyya. Taṃ kiṃ maññatha, bhikkhave, api nu taṃ parittaṃ udakaṃ [udakamallake udakaṃ (sī. syā. kaṃ. pī.)] amunā loṇakapallena loṇaṃ assa apeyya’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Aduñhi, bhante, parittaṃ udakakapallake udakaṃ, taṃ amunā loṇakapallena loṇaṃ assa apeyya’’nti. ‘‘Seyyathāpi, bhikkhave, puriso loṇakapallakaṃ gaṅgāya nadiyā pakkhipeyya. Taṃ kiṃ maññatha, bhikkhave, api nu sā gaṅgā nadī amunā loṇakapallena loṇaṃ assa apeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, gaṅgāya nadiyā mahā udakakkhandho so amunā loṇakapallena loṇo na assa apeyyo’’ti [loṇaṃ nevassa apeyyanti (sī.), na loṇo assa apeyyoti (pī.)]. ‘‘Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. Idha, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. ‘‘Idha, bhikkhave, ekacco aḍḍhakahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇasatenapi bandhanaṃ nigacchati. Idha, bhikkhave, ekacco aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati. ‘‘Kathaṃrūpo, bhikkhave, aḍḍhakahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇasatenapi bandhanaṃ nigacchati? Idha, bhikkhave, ekacco daliddo hoti appassako appabhogo. Evarūpo, bhikkhave, aḍḍhakahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇasatenapi bandhanaṃ nigacchati. ‘‘Kathaṃrūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati? Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo. Evarūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati. Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa appamattakaṃ pāpakammaṃ kataṃ. Tamenaṃ nirayaṃ upaneti. Idha, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakaṃ pāpakammaṃ kataṃ, tamenaṃ nirayaṃ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. ‘‘Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. Seyyathāpi, bhikkhave, orabbhiko vā urabbhaghātako vā appekaccaṃ urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ, appekaccaṃ urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ. ‘‘Kathaṃrūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ? Idha, bhikkhave, ekacco daliddo hoti appassako appabhogo. Evarūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ. ‘‘Kathaṃrūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ. Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo rājā vā rājamahāmatto vā. Evarūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ. Aññadatthu pañjalikova [pañjaliko (ka.)] naṃ [paraṃ (ka.)] yācati – ‘dehi me, mārisa, urabbhaṃ vā urabbhadhanaṃ vā’ti. Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. Idha pana, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. ‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. ‘‘Yo, bhikkhave, evaṃ vadeyya – ‘yathā yathāyaṃ puriso kammaṃ karoti tathā tathā taṃ paṭisaṃvedetī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso na hoti, okāso na paññāyati sammā dukkhassa antakiriyāya. Yo ca kho, bhikkhave, evaṃ vadeyya – ‘yathā yathā vedanīyaṃ ayaṃ puriso kammaṃ karoti tathā tathā tassa vipākaṃ paṭisaṃvedetī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso hoti, okāso paññāyati sammā dukkhassa antakiriyāyā’’ti. Navamaṃ.",
      "english": "If anyone, monks, were to say, ‘Just as this person performs a deed, so does he experience its retribution exactly as it was done,’ then, monks, there would be no living of the holy life, and no opportunity would be discerned for the complete ending of suffering. But if anyone, monks, were to say, ‘Just as this person performs a deed that is due to be experienced, so does he experience its ripening,’ then, monks, there would be the living of the holy life, and an opportunity would be discerned for the complete ending of suffering.\n\nHere, monks, for a certain individual, even a small evil deed done may lead him to hell. Yet here, monks, for another individual, precisely such a small evil deed done is experienced in this very life, and it does not even appear to be significant, let alone cause much trouble.\n\nWhat kind of individual, monks, is it for whom even a small evil deed done leads him to hell? Here, monks, a certain individual has not developed the body, not developed morality, not developed the mind, not developed wisdom; he is limited, of limited inner strength, and whose scope of well-being is restricted. For such an individual, monks, even a small evil deed done leads him to hell.\n\nWhat kind of individual, monks, is it for whom precisely such a small evil deed done is experienced in this very life, and it does not even appear to be significant, let alone cause much trouble? Here, monks, a certain individual has developed the body, developed morality, developed the mind, developed wisdom; he is boundless, great, and lives with immeasurable well-being. For such an individual, monks, precisely such a small evil deed done is experienced in this very life, and it does not even appear to be significant, let alone cause much trouble.\n\nJust as, monks, if a person were to put a lump of salt into a small bowl of water. What do you think, monks? Would that small amount of water become salty and undrinkable because of that lump of salt? “Yes, Venerable Sir.” “For what reason?” “Because, Venerable Sir, that small amount of water in the bowl is limited, and it would become salty and undrinkable because of that lump of salt.”\n\nJust as, monks, if a person were to put a lump of salt into the Ganges River. What do you think, monks? Would that Ganges River become salty and undrinkable because of that lump of salt? “No, Venerable Sir.” “For what reason?” “Because, Venerable Sir, the Ganges River has a great volume of water, and it would not become salty and undrinkable because of that lump of salt.”\n\nIn the same way, monks, for a certain individual, even a small evil deed done leads him to hell. Yet here, monks, for another individual, precisely such a small evil deed done is experienced in this very life, and it does not even appear to be significant, let alone cause much trouble.\n\nWhat kind of individual, monks, is it for whom even a small evil deed done leads him to hell? Here, monks, a certain individual has not developed the body, not developed morality, not developed the mind, not developed wisdom; he is limited, of limited inner strength, and whose scope of well-being is restricted. For such an individual, monks, even a small evil deed done leads him to hell. What kind of individual, monks, is it for whom precisely such a small evil deed done is experienced in this very life, and it does not even appear to be significant, let alone cause much trouble? Here, monks, a certain individual has developed the body, developed morality, developed the mind, developed wisdom; he is boundless, great, and lives with immeasurable well-being. For such an individual, monks, precisely such a small evil deed done is experienced in this very life, and it does not even appear to be significant, let alone cause much trouble.\n\nHere, monks, a certain individual goes into bondage for half a *kahāpaṇa*, goes into bondage for a *kahāpaṇa*, goes into bondage for a hundred *kahāpaṇas*. Yet here, monks, another individual does not go into bondage for half a *kahāpaṇa*, does not go into bondage for a *kahāpaṇa*, does not go into bondage for a hundred *kahāpaṇas*.\n\nWhat kind of individual, monks, goes into bondage for half a *kahāpaṇa*, goes into bondage for a *kahāpaṇa*, goes into bondage for a hundred *kahāpaṇas*? Here, monks, a certain individual is poor, of little property, of little wealth. Such an individual, monks, goes into bondage for half a *kahāpaṇa*, goes into bondage for a *kahāpaṇa*, goes into bondage for a hundred *kahāpaṇas*.\n\nWhat kind of individual, monks, does not go into bondage for half a *kahāpaṇa*, does not go into bondage for a *kahāpaṇa*, does not go into bondage for a hundred *kahāpaṇas*?\n\nHere, bhikkhus, some person is rich, with great wealth and possessions. Such a person, bhikkhus, is not taken to prison for half a kahāpaṇa, nor for a kahāpaṇa, nor for a hundred kahāpaṇas. In the same way, bhikkhus, for some person here, a trifling evil deed done leads him to hell. But here, bhikkhus, for some other person, such a trifling evil deed done is experienced in this very life; it is hardly noticed, much less causes significant suffering.\n\n“Of what kind of person, bhikkhus, does a trifling evil deed done lead him to hell? Here, bhikkhus, some person is undeveloped in body, undeveloped in virtue, undeveloped in mind, undeveloped in wisdom; he is of narrow scope, with little self-restraint, dwelling with much suffering. For such a person, bhikkhus, such a trifling evil deed done leads him to hell.\n\n“Of what kind of person, bhikkhus, is such a trifling evil deed done experienced in this very life, hardly noticed, much less causes significant suffering? Here, bhikkhus, some person is developed in body, developed in virtue, developed in mind, developed in wisdom; he is unrestricted, of great scope, dwelling with immeasurable well-being. For such a person, bhikkhus, such a trifling evil deed done is experienced in this very life, hardly noticed, much less causes significant suffering.\n\nHere, bhikkhus, some person is developed in body, developed in virtue, developed in mind, developed in wisdom; he is unrestricted, of great scope, dwelling with immeasurable well-being. For such a person, bhikkhus, such a trifling evil deed done is experienced in this very life, hardly noticed, much less causes significant suffering.\n\nJust as, bhikkhus, a sheep-herder or a sheep-butcher can kill or bind or fine or deal with as appropriate some person who has taken a sheep that was not given, while he cannot kill or bind or fine or deal with as appropriate some other person who has taken a sheep that was not given.\n\n“What kind of person, bhikkhus, can a sheep-herder or a sheep-butcher kill or bind or fine or deal with as appropriate, if he has taken a sheep that was not given? Here, bhikkhus, some person is poor, with little property and few possessions. Such a person, bhikkhus, if he has taken a sheep that was not given, can be killed or bound or fined or dealt with as appropriate by a sheep-herder or a sheep-butcher.\n\n“What kind of person, bhikkhus, cannot a sheep-herder or a sheep-butcher kill or bind or fine or deal with as appropriate, if he has taken a sheep that was not given? Here, bhikkhus, some person is rich, with great wealth and possessions, perhaps a king or a royal minister. Such a person, bhikkhus, if he has taken a sheep that was not given, cannot be killed or bound or fined or dealt with as appropriate by a sheep-herder or a sheep-butcher. Instead, with clasped hands, he will beg of him: ‘Good sir, please give me the sheep, or money for the sheep.’\n\nIn the same way, bhikkhus, for some person here, even a trifling evil deed done leads him to hell. But here, bhikkhus, for some other person, such a trifling evil deed done is experienced in this very life, hardly noticed, much less causes significant suffering.\n\n“Of what kind of person, bhikkhus, does even a trifling evil deed done lead him to hell? Here, bhikkhus, some person is undeveloped in body, undeveloped in virtue, undeveloped in mind, undeveloped in wisdom; he is of narrow scope, with little self-restraint, dwelling with much suffering. For such a person, bhikkhus, even a trifling evil deed done leads him to hell.\n\n“Of what kind of person, bhikkhus, is such a trifling evil deed done experienced in this very life, hardly noticed, much less causes significant suffering? Here, bhikkhus, some person is developed in body, developed in virtue, developed in mind, developed in wisdom; he is unrestricted, of great scope, dwelling with immeasurable well-being. For such a person, bhikkhus, such a trifling evil deed done is experienced in this very life, hardly noticed, much less causes significant suffering.\n\n“If, bhikkhus, anyone should say: ‘As this person does deeds, so he experiences them in return,’ then, bhikkhus, there would be no living of the holy life, and no opportunity would be discerned for the complete ending of suffering. But if, bhikkhus, anyone should say: ‘As this person performs deeds whose results are to be experienced, so he experiences their ripening,’ then, bhikkhus, there is the living of the holy life, and opportunity is discerned for the complete ending of suffering.”",
      "sinhala": "භික්ෂූනි, යම් කෙනෙක් මෙසේ කියන්නේ නම්: ‘යම් ආකාරයකින් මේ පුද්ගලයා කර්ම කරන්නේද, ඒ ආකාරයෙන්ම ඔහු එය විපාක වශයෙන් විඳී’යි. භික්ෂූනි, එසේ වුවහොත් බ්‍රහ්මචර්යාව වාසය කිරීමක් (සම්පූර්ණ කිරීමක්) නොවේ. මැනවින් දුක කෙළවර කිරීම සඳහා අවස්ථාවක් ද නොපෙනේ. භික්ෂූනි, යම් කෙනෙක් මෙසේ කියන්නේ නම්: ‘යම් ආකාරයකින් මේ පුද්ගලයා විඳිය යුතු කර්මයක් කරන්නේද, ඒ ආකාරයෙන්ම ඔහු එහි විපාකය විඳී’යි. භික්ෂූනි, එසේ වුවහොත් බ්‍රහ්මචර්යාව වාසය කිරීමක් වේ. මැනවින් දුක කෙළවර කිරීම සඳහා අවස්ථාවක් ද පෙනේ. භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙකුට ඉතා සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය ඔහුව නිරයට පමුණුවයි. නමුත්, භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙකුට එවැනිම සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය මේ ආත්ම භාවයේ දීම විපාක දීමට හේතු වේ. ඉතා සුළුවෙන් හෝ නොසැලකේ, වැඩි යමක් ගැන කවර කතාද?\n\nභික්ෂූනි, කිනම් ස්වභාවයක් ඇති පුද්ගලයෙකුගේ ද සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ඔහුව නිරයට පත් කරන්නේ? භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් ශරීරය නොවැඩූවෙක් (කාය භාවනාවෙන් තොර), සිල් නොවැඩූවෙක් (ශීල භාවනාවෙන් තොර), සිත නොවැඩූවෙක් (චිත්ත භාවනාවෙන් තොර), ප්‍ර‌ඥාව නොවැඩූවෙක් (ප්‍ර‌ඥා භාවනාවෙන් තොර) වේ. ඔහු ඉතා සීමිත වූ (ගුණධර්ම ඇති), අල්ප වූ ආත්මශක්තියක් ඇති, දුක දරාගැනීමට ශක්තියක් නැති පුද්ගලයෙකි. භික්ෂූනි, මෙවැනි පුද්ගලයෙකුගේ සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය ඔහුව නිරයට පත් කරයි.\n\nභික්ෂූනි, කිනම් ස්වභාවයක් ඇති පුද්ගලයෙකුගේ ද එවැනිම සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට මේ ආත්ම භාවයේ දීම විපාක දීමට හේතු වී, ඉතා සුළුවෙන් හෝ නොසැලකී, වැඩි යමක් ගැන කවර කතාද? භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් ශරීරය වැඩූවෙක් (කාය භාවනාවෙන් යුක්ත), සිල් වැඩූවෙක් (ශීල භාවනාවෙන් යුක්ත), සිත වැඩූවෙක් (චිත්ත භාවනාවෙන් යුක්ත), ප්‍ර‌ඥාව වැඩූවෙක් (ප්‍ර‌ඥා භාවනාවෙන් යුක්ත) වේ. ඔහු අසීමිත වූ (ගුණධර්ම ඇති), මහත් වූ ආත්මශක්තියක් ඇති, අප්‍ර‌මාණ (මෙත්තාදී) විහරණයන්ගෙන් වෙසෙන්නෙකි. භික්ෂූනි, මෙවැනි පුද්ගලයෙකුගේ එවැනිම සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය මේ ආත්ම භාවයේ දීම විපාක දීමට හේතු වී, ඉතා සුළුවෙන් හෝ නොසැලකී, වැඩි යමක් ගැන කවර කතාද?\n\nභික්ෂූනි, යම් සේ පුරුෂයෙක් ලුණු කැටයක් ස්වල්ප ජලය ඇති භාජනයකට දමන්නේ ද, භික්ෂූනි, ඔබලා ඒ ගැන කුමක් සිතන්නේ ද? ඒ ස්වල්ප ජලය ඒ ලුණු කැටය නිසා ලුණු රස වේද, පානය කළ නොහැකි වේද? ‘එසේය, ස්වාමීනි.’ ‘ඒ කුමක් හෙයින් ද?’ ‘එය, ස්වාමීනි, භාජනයෙහි ඇති ස්වල්ප ජලයකි. ඒ නිසා ඒ ලුණු කැටය හේතුවෙන් එය ලුණු රස වී පානය කළ නොහැකි වන්නේය.’ භික්ෂූනි, යම් සේ පුරුෂයෙක් ලුණු කැටයක් ගංගා නදියට දමන්නේ ද, භික්ෂූනි, ඔබලා ඒ ගැන කුමක් සිතන්නේ ද? ඒ ගංගා නදිය ඒ ලුණු කැටය නිසා ලුණු රස වේද, පානය කළ නොහැකි වේද? ‘එසේ නොවේ, ස්වාමීනි.’ ‘ඒ කුමක් හෙයින් ද?’ ‘ස්වාමීනි, ඒ ගංගා නදියෙහි මහත් වූ ජලස්කන්ධයක් ඇත. ඒ නිසා ඒ ලුණු කැටය හේතුවෙන් එය ලුණු රස වී පානය කළ නොහැකි නොවන්නේය.’\n\nභික්ෂූනි, ඒ ආකාරයෙන්ම මෙහි ඇතැම් පුද්ගලයෙකුගේ සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය ඔහුව නිරයට පමුණුවයි. භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙකුගේ එවැනිම සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය මේ ආත්ම භාවයේ දීම විපාක දීමට හේතු වී, ඉතා සුළුවෙන් හෝ නොසැලකී, වැඩි යමක් ගැන කවර කතාද?\n\nභික්ෂූනි, කිනම් ස්වභාවයක් ඇති පුද්ගලයෙකුගේ ද සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ඔහුව නිරයට පත් කරන්නේ? භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් ශරීරය නොවැඩූවෙක්, සිල් නොවැඩූවෙක්, සිත නොවැඩූවෙක්, ප්‍ර‌ඥාව නොවැඩූවෙක් වේ. ඔහු ඉතා සීමිත වූ (ගුණධර්ම ඇති), අල්ප වූ ආත්මශක්තියක් ඇති, දුක දරාගැනීමට ශක්තියක් නැති පුද්ගලයෙකි. භික්ෂූනි, මෙවැනි පුද්ගලයෙකුගේ සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය ඔහුව නිරයට පත් කරයි.\n\nභික්ෂූනි, කිනම් ස්වභාවයක් ඇති පුද්ගලයෙකුගේ ද එවැනිම සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට මේ ආත්ම භාවයේ දීම විපාක දීමට හේතු වී, ඉතා සුළුවෙන් හෝ නොසැලකී, වැඩි යමක් ගැන කවර කතාද? භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් ශරීරය වැඩූවෙක්, සිල් වැඩූවෙක්, සිත වැඩූවෙක්, ප්‍ර‌ඥාව වැඩූවෙක් වේ. ඔහු අසීමිත වූ (ගුණධර්ම ඇති), මහත් වූ ආත්මශක්තියක් ඇති, අප්‍ර‌මාණ (මෙත්තාදී) විහරණයන්ගෙන් වෙසෙන්නෙකි. භික්ෂූනි, මෙවැනි පුද්ගලයෙකුගේ එවැනිම සුළු ප්‍ර‌මාණයක් වූ පාප කර්මයක් කළ විට ද එය මේ ආත්ම භාවයේ දීම විපාක දීමට හේතු වී, ඉතා සුළුවෙන් හෝ නොසැලකී, වැඩි යමක් ගැන කවර කතාද?\n\nභික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් අඩ කහවණුවකට ද සිරගත වේ, කහවණුවකට ද සිරගත වේ, කහවණු සියයකට ද සිරගත වේ. භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් අඩ කහවණුවකට ද සිරගත නොවේ, කහවණුවකට ද සිරගත නොවේ, කහවණු සියයකට ද සිරගත නොවේ.\n\nභික්ෂූනි, කිනම් ස්වභාවයක් ඇති පුද්ගලයා ද අඩ කහවණුවකට ද සිරගත වන්නේ, කහවණුවකට ද සිරගත වන්නේ, කහවණු සියයකට ද සිරගත වන්නේ? භික්ෂූනි, මෙහි ඇතැම් පුද්ගලයෙක් දුප්පත්ය, අල්ප වස්තු ඇත්තෙක්ය, අල්ප භෝග සම්පත් ඇත්තෙක්ය. භික්ෂූනි, මෙවැනි පුද්ගලයෙක් අඩ කහවණුවකට ද සිරගත වේ, කහවණුවකට ද සිරගත වේ, කහවණු සියයකට ද සිරගත වේ. භික්ෂූනි, කිනම් ස්වභාවයක් ඇති පුද්ගලයා ද අඩ කහවණුවකට ද සිරගත නොවන්නේ, කහවණුවකට ද සිරගත නොවන්නේ, කහවණු සියයකට ද සිරගත නොවන්නේ?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් ධනවත්ය, මහා ධනයක් හා මහා භෝග සම්පත් ඇත්තෙක් වෙයි. මහණෙනි, එබඳු තැනැත්තා අඬකහපණයක් නිසාද බන්ධනයට නො යයි, කහපණයක් නිසාද බන්ධනයට නො යයි, කහපණ සීයයක් නිසාද බන්ධනයට නො යයි.\n\nමහණෙනි, එපරිද්දෙන්ම මෙහි යම් කිසි පු_ගලයෙක් විසින් කරන ලද ඉතා සුළු පාප කර්මයක් වෙයි. එය ඒ තැනැත්තා නිරයට පමුණුවයි.\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙකුට එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, මේ ආත්මභාවයේදීම විපාක දෙන සුළු වෙයි, නොවැදගත් දෙයක් ලෙසින් ක්ෂය වී යයි, බොහෝ වූ දෙයක් ගැන කුමන කථාද?\n\nමහණෙනි, කිනම් ස්වභාවයක් ඇති පු_ගලයෙකුගේද ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, එය ඒ තැනැත්තා නිරයට පමුණුවන්නේ?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් කය දියුණු නොකළ, සීලය දියුණු නොකළ, සිත දියුණු නොකළ, ප්‍රඥාව දියුණු නොකළ තැනැත්තෙක් වෙයි. ඔහු සීමා සහිත වූ, අල්ප වූ ආත්මයක් ඇත්තෙක් වෙයි, අල්ප වූ දුකින් වාසය කරන්නෙක් වෙයි.\n\nමහණෙනි, එබඳු පු_ගලයෙකුගේ එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, එය ඒ තැනැත්තා නිරයට පමුණුවයි.\n\nමහණෙනි, කිනම් ස්වභාවයක් ඇති පු_ගලයෙකුගේද එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, මේ ආත්මභාවයේදීම විපාක දෙන සුළු වෙයි, නොවැදගත් දෙයක් ලෙසින් ක්ෂය වී යයි, බොහෝ වූ දෙයක් ගැන කුමන කථාද?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් කය දියුණු කළ, සීලය දියුණු කළ, සිත දියුණු කළ, ප්‍රඥාව දියුණු කළ තැනැත්තෙක් වෙයි. ඔහු අපරිමිත වූ, මහත් වූ ආත්මයක් ඇත්තෙක් වෙයි, අප්‍රමාණ වූ විහරණයකින් වාසය කරන්නෙක් වෙයි.\n\nමහණෙනි, එබඳු පු_ගලයෙකුගේ එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, මේ ආත්මභාවයේදීම විපාක දෙන සුළු වෙයි, නොවැදගත් දෙයක් ලෙසින් ක්ෂය වී යයි, බොහෝ වූ දෙයක් ගැන කුමන කථාද?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් කය දියුණු කළ, සීලය දියුණු කළ, සිත දියුණු කළ, ප්‍රඥාව දියුණු කළ තැනැත්තෙක් වෙයි. ඔහු අපරිමිත වූ, මහත් වූ ආත්මයක් ඇත්තෙක් වෙයි, අප්‍රමාණ වූ විහරණයකින් වාසය කරන්නෙක් වෙයි. මහණෙනි, එබඳු පු_ගලයෙකුගේ එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, මේ ආත්මභාවයේදීම විපාක දෙන සුළු වෙයි, නොවැදගත් දෙයක් ලෙසින් ක්ෂය වී යයි, බොහෝ වූ දෙයක් ගැන කුමන කථාද?\n\nමහණෙනි, යම් සේ බැටළු පාලකයෙක් හෝ බැටළු ඝාතකයෙක් හෝ යම් කිසි බැටළුවෙකු නොදෙන ලද දෙයක් ගන්නා කල, ඔහුට මරන්නට හෝ බඳින්නට හෝ දඩ ගසන්නට හෝ තම අභිමතය පරිදි කරන්නට හෝ හැකියාව තිබේ. (එසේම) යම් කිසි බැටළුවෙකු නොදෙන ලද දෙයක් ගන්නා කල, ඔහුට මරන්නට හෝ බඳින්නට හෝ දඩ ගසන්නට හෝ තම අභිමතය පරිදි කරන්නට හෝ හැකියාව නැත.\n\nමහණෙනි, කිනම් ස්වභාවයක් ඇති බැටළුවෙකුද, බැටළු පාලකයෙක් හෝ බැටළු ඝාතකයෙක් හෝ නොදෙන ලද දෙයක් ගන්නා කල, මරන්නට හෝ බඳින්නට හෝ දඩ ගසන්නට හෝ තම අභිමතය පරිදි කරන්නට හෝ හැකියාව ඇත්තේ?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් දුප්පත්ය, ස්වල්ප සම්පත් ඇත්තේය, ස්වල්ප භෝග ඇත්තේය. මහණෙනි, බැටළු පාලකයෙක් හෝ බැටළු ඝාතකයෙක් හෝ නොදෙන ලද දෙයක් ගන්නා එබඳු බැටළුවෙකුට මරන්නට හෝ බඳින්නට හෝ දඩ ගසන්නට හෝ තම අභිමතය පරිදි කරන්නට හෝ හැකියාව තිබේ.\n\nමහණෙනි, කිනම් ස්වභාවයක් ඇති බැටළුවෙකුද, බැටළු පාලකයෙක් හෝ බැටළු ඝාතකයෙක් හෝ නොදෙන ලද දෙයක් ගන්නා කල, මරන්නට හෝ බඳින්නට හෝ දඩ ගසන්නට හෝ තම අභිමතය පරිදි කරන්නට හෝ හැකියාව නැත්තේ?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් ධනවත්ය, මහා ධනයක් හා මහා භෝග සම්පත් ඇත්තෙක්ය, රජෙක් හෝ රාජ මහාමාත්‍යවරයෙක් හෝ වෙයි.\n\nමහණෙනි, බැටළු පාලකයෙක් හෝ බැටළු ඝාතකයෙක් හෝ නොදෙන ලද දෙයක් ගන්නා එබඳු බැටළුවෙකුට මරන්නට හෝ බඳින්නට හෝ දඩ ගසන්නට හෝ තම අභිමතය පරිදි කරන්නට හෝ හැකියාව නැත. ඔහුට කළ හැකි වන්නේ දෙඅත් එක් කොට වැඳ (ඒ තැනැත්තාගෙන්) අයැද සිටීම පමණි, ‘ස්වාමීනි, මට බැටළුවා හෝ බැටළුවාගේ වටිනාකම හෝ දෙන්න’ කියා.\n\nමහණෙනි, එපරිද්දෙන්ම මෙහි යම් කිසි පු_ගලයෙකුගේ එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, එය ඒ තැනැත්තා නිරයට පමුණුවයි. මහණෙනි, එහෙත් මෙහි යම් කිසි පු_ගලයෙකුගේ එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, මේ ආත්මභාවයේදීම විපාක දෙන සුළු වෙයි, නොවැදගත් දෙයක් ලෙසින් ක්ෂය වී යයි, බොහෝ වූ දෙයක් ගැන කුමන කථාද?\n\nමහණෙනි, කිනම් ස්වභාවයක් ඇති පු_ගලයෙකුගේද ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, එය ඒ තැනැත්තා නිරයට පමුණුවන්නේ?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් කය දියුණු නොකළ, සීලය දියුණු නොකළ, සිත දියුණු නොකළ, ප්‍රඥාව දියුණු නොකළ තැනැත්තෙක් වෙයි. ඔහු සීමා සහිත වූ, අල්ප වූ ආත්මයක් ඇත්තෙක් වෙයි, අල්ප වූ දුකින් වාසය කරන්නෙක් වෙයි.\n\nමහණෙනි, එබඳු පු_ගලයෙකුගේ ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, එය ඒ තැනැත්තා නිරයට පමුණුවයි.\n\nමහණෙනි, කිනම් ස්වභාවයක් ඇති පු_ගලයෙකුගේද එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, මේ ආත්මභාවයේදීම විපාක දෙන සුළු වෙයි, නොවැදගත් දෙයක් ලෙසින් ක්ෂය වී යයි, බොහෝ වූ දෙයක් ගැන කුමන කථාද?\n\nමහණෙනි, මෙහි යම් කිසි පු_ගලයෙක් කය දියුණු කළ, සීලය දියුණු කළ, සිත දියුණු කළ, ප්‍රඥාව දියුණු කළ තැනැත්තෙක් වෙයි. ඔහු අපරිමිත වූ, මහත් වූ ආත්මයක් ඇත්තෙක් වෙයි, අප්‍රමාණ වූ විහරණයකින් වාසය කරන්නෙක් වෙයි.\n\nමහණෙනි, එබඳු පු_ගලයෙකුගේ එබඳුම ඉතා සුළු පාප කර්මයක් කරන ලද්දේ, මේ ආත්මභාවයේදීම විපාක දෙන සුළු වෙයි, නොවැදගත් දෙයක් ලෙසින් ක්ෂය වී යයි, බොහෝ වූ දෙයක් ගැන කුමන කථාද?\n\nමහණෙනි, යම් කෙනෙක් මෙසේ කියන්නේ නම්: ‘මේ පු_ගලයා යම් යම් අයුරින් කර්ම කරන්නේද, ඒ ඒ අයුරින්ම ඔහු එය විඳියි’ කියා, මහණෙනි, එසේ වන කල බ්‍රහ්මචාරී වාසය කිරීමක් (සසර දුකින් මිදීමට) නොමැත, දුක නිසි ලෙස කෙළවර කිරීමට අවස්ථාවක්ද නොපෙනේ. මහණෙනි, යම් කෙනෙක් මෙසේ කියන්නේ නම්: ‘මේ පු_ගලයා යම් යම් අයුරින් විපාක විඳීමට සුදුසු කර්ම කරන්නේද, ඒ ඒ අයුරින්ම ඔහු එහි විපාකය විඳියි’ කියා, මහණෙනි, එසේ වන කල බ්‍රහ්මචාරී වාසය කිරීමක් (සසර දුකින් මිදීමට) ඇත, දුක නිසි ලෙස කෙළවර කිරීමට අවස්ථාවක්ද පෙනේ.",
      "paliTitle": "Loṇakapallasuttaṃ",
      "englishTitle": "The Grain of Salt Sutta",
      "sinhalaTitle": "ලෝණකපල්ල සූත්‍රය"
    },
    {
      "number": 102,
      "pali": "‘‘Santi, bhikkhave, jātarūpassa oḷārikā upakkilesā paṃsuvālukā [paṃsuvālikā (sī. syā. kaṃ. pī.)] sakkharakaṭhalā. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā doṇiyaṃ ākiritvā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate santi jātarūpassa majjhimasahagatā upakkilesā sukhumasakkharā thūlavālukā [thūlavālikā (sī. pī.), thullavālikā (syā. kaṃ.)]. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate santi jātarūpassa sukhumasahagatā upakkilesā sukhumavālukā kāḷajallikā. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate athāparaṃ suvaṇṇasikatāvasissanti [suvaṇṇajātarūpakāvasissanti (ka.)]. Tamenaṃ suvaṇṇakāro vā suvaṇṇakārantevāsī vā jātarūpaṃ mūsāyaṃ pakkhipitvā dhamati sandhamati niddhamati. Taṃ hoti jātarūpaṃ dhantaṃ sandhantaṃ [adhantaṃ asandhantaṃ (syā. kaṃ.)] niddhantaṃ aniddhantakasāvaṃ [aniddhantaṃ anihitaṃ aninnītakasāvaṃ (sī. syā. kaṃ. pī.)], na ceva mudu hoti na ca kammaniyaṃ, na ca pabhassaraṃ pabhaṅgu ca, na ca sammā upeti kammāya. Hoti so, bhikkhave, samayo yaṃ suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ dhamati sandhamati niddhamati. Taṃ hoti jātarūpaṃ dhantaṃ sandhantaṃ niddhantaṃ niddhantakasāvaṃ [nihitaṃ ninnītakasāvaṃ (sī. syā. kaṃ. pī.)], mudu ca hoti kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā upeti kammāya. Yassā yassā ca pilandhanavikatiyā ākaṅkhati – yadi paṭṭikāya [muddikāya (a. ni. 5.23], yadi kuṇḍalāya, yadi gīveyyake [gīveyyakena (ka.), gīveyyakāya (?)], yadi suvaṇṇamālāya – tañcassa atthaṃ anubhoti. ‘‘Evamevaṃ kho, bhikkhave, santi adhicittamanuyuttassa bhikkhuno oḷārikā upakkilesā kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate santi adhicittamanuyuttassa bhikkhuno majjhimasahagatā upakkilesā kāmavitakko byāpādavitakko vihiṃsāvitakko, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate santi adhicittamanuyuttassa bhikkhuno sukhumasahagatā upakkilesā ñātivitakko janapadavitakko anavaññattipaṭisaṃyutto vitakko, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate athāparaṃ dhammavitakkāvasissati [dhammavitakkovasissati (ka.)]. So hoti samādhi na ceva santo na ca paṇīto nappaṭippassaddhaladdho na ekodibhāvādhigato sasaṅkhāraniggayhavāritagato [sasaṅkhāraniggayhavāritavato (sī. syā. kaṃ. pī.), sasaṅkhāraniggayhavārivāvato (ka.), sasaṅkhāraniggayhavāriyādhigato (?) a. ni. 9.37; dī. ni. 3.355] hoti. So, bhikkhave, samayo yaṃ taṃ cittaṃ ajjhattaṃyeva santiṭṭhati sannisīdati ekodi hoti [ekodibhāvaṃ gacchati (sī.), ekodibhāvo hoti (syā. kaṃ. ka.), ekodihoti (pī.)] samādhiyati. So hoti samādhi santo paṇīto paṭippassaddhiladdho ekodibhāvādhigato na sasaṅkhāraniggayhavāritagato. Yassa yassa ca abhiññā sacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññā sacchikiriyāya tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ – ekopi hutvā bahudhā assaṃ, bahudhāpi hutvā eko assaṃ; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gaccheyyaṃ, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ kareyyaṃ, seyyathāpi udake; udakepi abhijjamāne [abhijjamāno (sī. pī. ka.)] gaccheyyaṃ, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kameyyaṃ, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimaseyyaṃ parimajjeyyaṃ; yāva brahmalokāpi kāyena vasaṃ vatteyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane. ‘‘So sace ākaṅkhati – ‘dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇeyyaṃ dibbe ca mānuse ca ye dūre santike cā’ti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane. ‘‘So sace ākaṅkhati – ‘parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajāneyyaṃ – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajāneyyaṃ, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajāneyyaṃ; sadosaṃ vā cittaṃ sadosaṃ cittanti pajāneyyaṃ, vītadosaṃ vā cittaṃ vītadosaṃ cittanti pajāneyyaṃ; samohaṃ vā cittaṃ samohaṃ cittanti pajāneyyaṃ, vītamohaṃ vā cittaṃ vītamohaṃ cittanti pajāneyyaṃ; saṃkhittaṃ vā cittaṃ saṃkhittaṃ cittanti pajāneyyaṃ, vikkhittaṃ vā cittaṃ vikkhittaṃ cittanti pajāneyyaṃ; mahaggataṃ vā cittaṃ mahaggataṃ cittanti pajāneyyaṃ, amahaggataṃ vā cittaṃ amahaggataṃ cittanti pajāneyyaṃ; sauttaraṃ vā cittaṃ sauttaraṃ cittanti pajāneyyaṃ, anuttaraṃ vā cittaṃ anuttaraṃ cittanti pajāneyyaṃ; samāhitaṃ vā cittaṃ samāhitaṃ cittanti pajāneyyaṃ, asamāhitaṃ vā cittaṃ asamāhitaṃ cittanti pajāneyyaṃ; vimuttaṃ vā cittaṃ vimuttaṃ cittanti pajāneyyaṃ, avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ pubbenivāsaṃ anussareyyaṃ, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane. ‘‘So sace ākaṅkhati – ‘dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyyaṃ – ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannāti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane. ‘‘So sace ākaṅkhati – ‘āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’ti. Dasamaṃ.",
      "english": "“Monks, there are coarse impurities in gold: dust and sand, and rough gravel. A gold washer or a gold washer’s apprentice pours it into a trough and washes it, rinses it, thoroughly cleanses it. When those are removed and eliminated, there are medium-level impurities in the gold: fine gravel and coarse sand. A gold washer or a gold washer’s apprentice washes it, rinses it, thoroughly cleanses it. When those are removed and eliminated, there are subtle impurities in the gold: fine sand and black dust. A gold washer or a gold washer’s apprentice washes it, rinses it, thoroughly cleanses it. When those are removed and eliminated, what then remains is gold dust. A goldsmith or a goldsmith’s apprentice puts that gold into a crucible and smelts it, refines it, purifies it. The gold is then smelted, refined, purified, but its dross is not yet fully removed; it is not soft, nor workable, nor lustrous, and it is brittle, and does not lend itself perfectly to craftsmanship. Monks, there comes a time when a goldsmith or a goldsmith’s apprentice smelts, refines, and purifies that gold. Then the gold is smelted, refined, purified, its dross is fully removed; it is soft, workable, and lustrous, it is not brittle, and it lends itself perfectly to craftsmanship. Whatever kind of ornament one desires to make – be it a band, an earring, a necklace, or a gold garland – it will serve that purpose.\n\n“In the same way, monks, for a monk devoted to the higher mind, there are coarse defilements: misconduct in body, misconduct in speech, and misconduct in mind. A mindful monk of a resolute nature abandons these, dispels them, eliminates them, and brings them to naught. When those coarse defilements are removed and eliminated, there are medium-level defilements for a monk devoted to the higher mind: thoughts of sensual desire, thoughts of ill-will, and thoughts of harm. A mindful monk of a resolute nature abandons these, dispels them, eliminates them, and brings them to naught. When those medium-level defilements are removed and eliminated, there are subtle defilements for a monk devoted to the higher mind: thoughts about relatives, thoughts about the homeland, and thoughts connected with being slighted. A mindful monk of a resolute nature abandons these, dispels them, eliminates them, and brings them to naught. When those subtle defilements are removed and eliminated, what then remains are thoughts connected with the Dhamma. This concentration is not yet peaceful, not yet sublime, not yet attained through calm, not yet unified, and it is still maintained by forceful suppression. Monks, there comes a time when that mind becomes internally steady, settled, unified, and concentrated. This concentration is peaceful, sublime, attained through calm, attained to unification, and not maintained by forceful suppression. Whatever supernormal knowledge is to be realized, to which one inclines the mind for its realization, in each and every case one attains the ability to witness it, whenever there is the appropriate basis.\n\n“If he wishes, ‘May I experience various kinds of psychic power: having been one, may I become many; having been many, may I become one; may I appear and vanish; may I go unimpeded through walls, through ramparts, through mountains, as if through space; may I dive in and out of the earth as if in water; may I walk on water without sinking as if on land; may I travel through the sky seated cross-legged as if a winged bird; may I touch and stroke these sun and moon, so mighty, so powerful; may I exercise mastery with my body even as far as the Brahma world,’ then in each and every case he attains the ability to witness it, whenever there is the appropriate basis.\n\n“If he wishes, ‘May I hear both divine and human sounds, those that are far and near, with the divine ear element, purified and surpassing that of humans,’ then in each and every case he attains the ability to witness it, whenever there is the appropriate basis.\n\nIf he wishes, ‘May I discern the minds of other beings, of other persons, by encompassing them with my own mind: a mind with lust, I would discern as “a mind with lust”; a mind free from lust, I would discern as “a mind free from lust”; a mind with aversion, I would discern as “a mind with aversion”; a mind free from aversion, I would discern as “a mind free from aversion”; a mind with delusion, I would discern as “a mind with delusion”; a mind free from delusion, I would discern as “a mind free from delusion”; a contracted mind, I would discern as “a contracted mind”; a scattered mind, I would discern as “a scattered mind”; an expanded mind, I would discern as “an expanded mind”; an unexpanded mind, I would discern as “an unexpanded mind”; a surpassable mind, I would discern as “a surpassable mind”; an unsurpassed mind, I would discern as “an unsurpassed mind”; a concentrated mind, I would discern as “a concentrated mind”; an unconcentrated mind, I would discern as “an unconcentrated mind”; a liberated mind, I would discern as “a liberated mind”; an unliberated mind, I would discern as “an unliberated mind”’—then he attains the ability to witness and realize this, each and every time a relevant occasion arises.\n\nIf he wishes, ‘May I recollect my manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births, many aeons of cosmic contraction, many aeons of cosmic expansion, many aeons of cosmic contraction and expansion: “There I was of such a name, of such a clan, of such a color, consuming such food, experiencing such pleasure and pain, with such a lifespan; passing away from there, I reappeared elsewhere. There too I was of such a name, of such a clan, of such a color, consuming such food, experiencing such pleasure and pain, with such a lifespan; passing away from there, I reappeared here”—thus, I would recollect my manifold past lives with their specific features and details’—then he attains the ability to witness and realize this, each and every time a relevant occasion arises.\n\nIf he wishes, ‘May I behold beings—by means of the divine eye, purified and surpassing that of humans—as they pass away and reappear, inferior and superior, beautiful and ugly, in fortunate and unfortunate destinations, and understand them according to their kamma: “Indeed, these beings, who were endowed with misconduct of body, speech, and mind, who defamed the Noble Ones, held wrong view, and undertook actions based on wrong view, with the breaking up of the body, after death, have reappeared in a state of deprivation, a bad destination, a lower realm, in hell. However, these other beings, who were endowed with good conduct of body, speech, and mind, who did not defame the Noble Ones, held right view, and undertook actions based on right view, with the breaking up of the body, after death, have reappeared in a fortunate destination, in a heavenly world”—thus, I would behold beings with the divine eye, purified and surpassing that of humans, as they pass away and reappear, inferior and superior, beautiful and ugly, in fortunate and unfortunate destinations, and understand them according to their kamma’—then he attains the ability to witness and realize this, each and every time a relevant occasion arises.\n\nIf he wishes, ‘Through the destruction of the taints, having realized and entered upon the taintless liberation of mind and liberation by wisdom through my own direct knowledge in this very life, I would dwell therein’—then he attains the ability to witness and realize this, each and every time a relevant occasion arises.",
      "sinhala": "භික්ෂූණි, රන් වලට ස්ථූල කෙලෙස් තිබේ. ඒවා නම් පස්, වැලි සහ බොරළු ය. රන් පිරිසිදු කරන්නෙක් හෝ ඔහුගේ අතවැසියා හෝ එය දෝණියකට දමා සෝදයි, හොඳින් සෝදයි, මුළුමනින්ම සෝදයි. ඒවා පහ කළ විට, ඒවා නැති කළ විට, රන් වලට මධ්‍යම කෙලෙස් තිබේ. ඒවා නම් සියුම් ගල් කැට සහ රළු වැලි ය. රන් පිරිසිදු කරන්නෙක් හෝ ඔහුගේ අතවැසියා හෝ එය සෝදයි, හොඳින් සෝදයි, මුළුමනින්ම සෝදයි. ඒවා පහ කළ විට, ඒවා නැති කළ විට, රන් වලට සියුම් කෙලෙස් තිබේ. ඒවා නම් සියුම් වැලි සහ කළු පැහැති අවසාදිත ය. රන් පිරිසිදු කරන්නෙක් හෝ ඔහුගේ අතවැසියා හෝ එය සෝදයි, හොඳින් සෝදයි, මුළුමනින්ම සෝදයි. ඒවා පහ කළ විට, ඒවා නැති කළ විට, ඉන් පසු ශුද්ධ රන් මතු වෙයි. රන්කරුවෙක් හෝ ඔහුගේ අතවැසියා හෝ එම රන් මූසාවක් තුළට දමා පුළුස්සයි, හොඳින් පුළුස්සයි, මුළුමනින්ම පුළුස්සයි. එම රන් සෝදා, හොඳින් සෝදා, මුළුමනින්ම සෝදා ඇතත්, එහි අවශේෂ දෝෂ ඉවත් වී නැත. එය මෘදු නොවේ, කැමති පරිදි වැඩ කළ නොහැක, දිදුලන්නේ ද නැත, බිඳෙනසුලු ය, කිසිදු වැඩකට නිසි ලෙස යොදාගත නොහැක. භික්ෂූණි, රන්කරුවෙක් හෝ ඔහුගේ අතවැසියා හෝ එම රන් පුළුස්සා, හොඳින් පුළුස්සා, මුළුමනින්ම පුළුස්සන කාලයක් පැමිණේ. එම රන් සෝදා, හොඳින් සෝදා, මුළුමනින්ම සෝදා, එහි අවශේෂ දෝෂ මුළුමනින්ම ඉවත් කළ විට, එය මෘදු ද වෙයි, කැමති පරිදි වැඩ කළ හැකි ද වෙයි, දිදුලන සුළු ද වෙයි, බිඳෙනසුලු නො ද වෙයි, ඕනෑම වැඩකට නිසි ලෙස යොදාගත හැකි වෙයි. කවර ආකාරයක ආභරණයක් සඳහා, පටි සඳහා වේවා, කරාබු සඳහා වේවා, ගෙල පළඳනා සඳහා වේවා, රන් මාලා සඳහා වේවා, ඔහු කැමති ද, ඒ අරමුණ එයින් ඉටු වේ.\n\nභික්ෂූණි, එසේම අධිචිත්තයට යොමු වූ භික්ෂුවකට ස්ථූල කෙලෙස් තිබේ. ඒ නම් කයින් කරන දුසිරිත්, වචනයෙන් කරන දුසිරිත්, සිතින් කරන දුසිරිත් ය. සිහි කල්පනාවෙන් යුත්, දක්ෂ භික්ෂුව ඒවා දුරු කරයි, විනාශ කරයි, නැති කරයි, මුළුමනින්ම නැති කරයි. ඒවා පහ කළ විට, ඒවා නැති කළ විට, අධිචිත්තයට යොමු වූ භික්ෂුවකට මධ්‍යම කෙලෙස් තිබේ. ඒ නම් කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය යි. සිහි කල්පනාවෙන් යුත්, දක්ෂ භික්ෂුව ඒවා දුරු කරයි, විනාශ කරයි, නැති කරයි, මුළුමනින්ම නැති කරයි. ඒවා පහ කළ විට, ඒවා නැති කළ විට, අධිචිත්තයට යොමු වූ භික්ෂුවකට සියුම් කෙලෙස් තිබේ. ඒ නම් ඥාති විතර්කය, ජනපද විතර්කය, අවමන් කිරීම හා බැඳුණු විතර්කය යි. සිහි කල්පනාවෙන් යුත්, දක්ෂ භික්ෂුව ඒවා දුරු කරයි, විනාශ කරයි, නැති කරයි, මුළුමනින්ම නැති කරයි. ඒවා පහ කළ විට, ඒවා නැති කළ විට, ඉන් පසු ධර්ම විතර්ක පමණක් ඉතිරි වෙයි. එම සමාධිය ශාන්ත එකක් නොවේ, ප්‍රණීත එකක් නොවේ, ප්‍රශාන්ත බවක් ලබාගෙන නැත, ඒකෝභාවයට පත් වී නැත, සිත යටපත් කිරීමෙන් හා වළක්වා ගැනීමෙන් ඇති කරගත් එකක් වෙයි. භික්ෂූණි, එම සිත අභ්‍යන්තරයෙහිම පිහිටා, සන්සිඳී, ඒකාග්‍ර වී, සමවැදෙන කාලයක් පැමිණේ. එම සමාධිය ශාන්ත වෙයි, ප්‍රණීත වෙයි, ප්‍රශාන්ත බව ලබාගත් එකක් වෙයි, ඒකෝභාවයට පත් වූ එකක් වෙයි, සිත යටපත් කිරීමෙන් හා වළක්වා ගැනීමෙන් ඇති කරගත් එකක් නොවේ. කවර කවර අභිඥා වශයෙන් සාක්ෂාත් කළ යුතු ධර්මයක් වෙත සිත නැඹුරු කරන්නේ ද, අභිඥාවෙන් සාක්ෂාත් කිරීම සඳහා, ඒ ඒ අවස්ථාවෙහි ඔහුට සාක්ෂාත් කිරීමේ හැකියාව ලැබේ.\n\nයම් හෙයකින් ඔහු මෙසේ පතන්නේ නම් – ‘මම නොයෙක් ආකාර වූ ඉර්ධි ප්‍රාතිහාර්යයන් අත්විඳින්නෙමි. එනම්: එකකු වී බොහෝ දෙනෙකු වීම, බොහෝ දෙනෙකු වී එකකු වීම; ප්‍රකට වීම, අතුරුදහන් වීම; බිත්ති අතරින්, ප්‍රාකාර අතරින්, පර්වත අතරින් නොගැටී අහසෙහි මෙන් යන්නෙමි; පොළොවෙහි ජලයෙහි මෙන් කිමිදීම, මතු වීම කරන්නෙමි; ජලයෙහි පොළොවෙහි මෙන් නොබිඳී යන්නෙමි; අහසෙහි පියාඹන කුරුල්ලෙකු මෙන් පලක් බැඳ ගෙන ගමන් කරන්නෙමි; මෙවන් මහත් ඉර්ධි ඇති, මෙවන් මහත් ආනුභාව ඇති මේ හිරු සඳු ද අතින් අල්ලා පිරිමදින්නෙමි; බ්‍රහ්ම ලෝකය දක්වා ද කයින් වසඟ වන්නෙමි’ කියා, ඒ ඒ අවස්ථාවෙහි ඔහුට සාක්ෂාත් කිරීමේ හැකියාව ලැබේ.\n\nයම් හෙයකින් ඔහු මෙසේ පතන්නේ නම් – ‘පිරිසිදු වූ, මිනිසුන්ගේ සවන් පරදවා යන දිව්‍ය ශ්‍රවණ ධාතුවෙන් දිව්‍ය වූ ද මනුෂ්‍ය වූ ද දුර හෝ ළඟ හෝ ඇති දෙආකාර වූ ශබ්ද අසන්නෙමි’ කියා, ඒ ඒ අවස්ථාවෙහි ඔහුට සාක්ෂාත් කිරීමේ හැකියාව ලැබේ.\n\nයම් හෙයකින් ඔහු, 'අන්‍ය සත්වයන්ගේ, අන්‍ය පුද්ගලයන්ගේ සිත් මාගේ සිතින් පිරිසිඳ දැනගනිමි. රාගය සහිත සිතක් රාගය සහිත සිතක් ලෙස දැනගනිමි, රාගය රහිත සිතක් රාගය රහිත සිතක් ලෙස දැනගනිමි; ද්වේෂය සහිත සිතක් ද්වේෂය සහිත සිතක් ලෙස දැනගනිමි, ද්වේෂය රහිත සිතක් ද්වේෂය රහිත සිතක් ලෙස දැනගනිමි; මෝහය සහිත සිතක් මෝහය සහිත සිතක් ලෙස දැනගනිමි, මෝහය රහිත සිතක් මෝහය රහිත සිතක් ලෙස දැනගනිමි; හැකිළුණු සිතක් හැකිළුණු සිතක් ලෙස දැනගනිමි, වික්ෂිප්ත සිතක් වික්ෂිප්ත සිතක් ලෙස දැනගනිමි; මහග්ගත (උසස්) සිතක් මහග්ගත සිතක් ලෙස දැනගනිමි, අමහග්ගත (නුසස්) සිතක් අමහග්ගත සිතක් ලෙස දැනගනිමි; සඋත්තර සිතක් සඋත්තර සිතක් ලෙස දැනගනිමි, අනුත්තර සිතක් අනුත්තර සිතක් ලෙස දැනගනිමි; සමාහිත සිතක් සමාහිත සිතක් ලෙස දැනගනිමි, අසමාහිත සිතක් අසමාහිත සිතක් ලෙස දැනගනිමි; විමුක්ත සිතක් විමුක්ත සිතක් ලෙස දැනගනිමි, අවිමුක්ත සිතක් අවිමුක්ත සිතක් ලෙස දැනගනිමි' යැයි කැමති වේ නම්, ඒ ඒ අවස්ථාවන්හිදී, අවස්ථාව පැමිණි කල්හි, ඔහු සාක්ෂාත් කිරීමේ හැකියාවට පැමිණෙන්නේය.\n\nයම් හෙයකින් ඔහු, 'මම නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරමි. එනම්: එක් ආත්ම භවයක්, ආත්ම භවයන් දෙකක්, ආත්ම භවයන් තුනක්, ආත්ම භවයන් හතරක්, ආත්ම භවයන් පහක්, ආත්ම භවයන් දහයක්, ආත්ම භවයන් විස්සක්, ආත්ම භවයන් තිහක්, ආත්ම භවයන් හතළිහක්, ආත්ම භවයන් පනහක්, ආත්ම භවයන් සියයක්, ආත්ම භවයන් දහසක්, ආත්ම භවයන් ලක්ෂයක්, නොයෙක් සංවට්ට කල්පයන්, නොයෙක් විවට්ට කල්පයන්, නොයෙක් සංවට්ට-විවට්ට කල්පයන් සිහි කරමි. මම අසවල් තැන අසවල් නමින්, අසවල් ගෝත්‍රයෙන් යුක්තව, අසවල් වර්ණයෙන් යුක්තව, අසවල් ආහාරයෙන් යැපෙමින්, අසවල් ආකාරයේ සැප දුක් විඳිමින්, අසවල් ආයුෂ ප්‍රමාණයෙන් යුක්තව විසීමි. එතැනින් චුතව අසවල් තැන උපන්නෙමි; එහිදී ද මම අසවල් නමින්, අසවල් ගෝත්‍රයෙන් යුක්තව, අසවල් වර්ණයෙන් යුක්තව, අසවල් ආහාරයෙන් යැපෙමින්, අසවල් ආකාරයේ සැප දුක් විඳිමින්, අසවල් ආයුෂ ප්‍රමාණයෙන් යුක්තව විසීමි. එතැනින් චුතව මෙහි උපන්නෙමි. මෙසේ නොයෙක් ආකාර වූ, ආකාර ලක්ෂණ සහිත වූ, විස්තර සහිත වූ පෙර විසූ කඳන් පෙළ සිහි කරමි' යැයි කැමති වේ නම්, ඒ ඒ අවස්ථාවන්හිදී, අවස්ථාව පැමිණි කල්හි, ඔහු සාක්ෂාත් කිරීමේ හැකියාවට පැමිණෙන්නේය.\n\nයම් හෙයකින් ඔහු, 'පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින්, චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුන්දර වූ, අවලස්සන වූ, සුගති දුගතිවල ගමන් කරන, කර්මයට අනුව උපදින සත්වයන් දකිමි, දැනගනිමි. අනේ! මේ සත්වයෝ කාය දුශ්චරිතයෙන් යුක්තව, වචී දුශ්චරිතයෙන් යුක්තව, මනෝ දුශ්චරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස කරමින්, මිථ්‍යා දෘෂ්ටි ඇතුව, මිථ්‍යා දෘෂ්ටික කර්ම සමාදන් වූවෝ, ශරීරය බිඳී යාමෙන් පසු, මරණින් මතු, අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට වැටී උපන්නාහ. නැතහොත්, මේ සත්වයෝ කාය සුචරිතයෙන් යුක්තව, වචී සුචරිතයෙන් යුක්තව, මනෝ සුචරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස නොකරමින්, සම්මා දෘෂ්ටි ඇතුව, සම්මා දෘෂ්ටික කර්ම සමාදන් වූවෝ, ශරීරය බිඳී යාමෙන් පසු, මරණින් මතු, සුගතිය නම් වූ ස්වර්ග ලෝකයට වැටී උපන්නාහ' යැයි මෙසේ පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින්, චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුන්දර වූ, අවලස්සන වූ, සුගති දුගතිවල ගමන් කරන, කර්මයට අනුව උපදින සත්වයන් දක්නා පිණිස කැමති වේ නම්, ඒ ඒ අවස්ථාවන්හිදී, අවස්ථාව පැමිණි කල්හි, ඔහු සාක්ෂාත් කිරීමේ හැකියාවට පැමිණෙන්නේය.\n\nයම් හෙයකින් ඔහු, 'ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවය තුළදීම තමා විසින්ම විශේෂයෙන් දැනගෙන, සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරමි' යැයි කැමති වේ නම්, ඒ ඒ අවස්ථාවන්හිදී, අවස්ථාව පැමිණි කල්හි, ඔහු සාක්ෂාත් කිරීමේ හැකියාවට පැමිණෙන්නේය.",
      "paliTitle": "Paṃsudhovakasuttaṃ",
      "englishTitle": "The Discourse on the Dust-Washer",
      "sinhalaTitle": "පංසුධෝවක සූත්‍රය"
    },
    {
      "number": 103,
      "pali": "‘‘Adhicittamanuyuttena, bhikkhave, bhikkhunā tīṇi nimittāni kālena kālaṃ manasi kātabbāni – kālena kālaṃ samādhinimittaṃ manasi kātabbaṃ, kālena kālaṃ paggahanimittaṃ manasi kātabbaṃ, kālena kālaṃ upekkhānimittaṃ manasi kātabbaṃ. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ samādhinimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ kosajjāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ paggahanimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ uddhaccāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ upekkhānimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ na sammā samādhiyeyya āsavānaṃ khayāya. Yato ca kho, bhikkhave, adhicittamanuyutto bhikkhu kālena kālaṃ samādhinimittaṃ manasi karoti, kālena kālaṃ paggahanimittaṃ manasi karoti, kālena kālaṃ upekkhānimittaṃ manasi karoti, taṃ hoti cittaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā samādhiyati āsavānaṃ khayāya. ‘‘Seyyathāpi, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā ukkaṃ bandheyya [bandhati… ālimpati (visuddhi. 1.181 taṃṭīkāyaṃ ca) ma. ni. aṭṭha. 1.76; ma. ni. 3.360 taṃaṭṭhakathāṭīkāsu ca passitabbaṃ], ukkaṃ bandhitvā ukkāmukhaṃ ālimpeyya, ukkāmukhaṃ ālimpetvā saṇḍāsena jātarūpaṃ gahetvā ukkāmukhe pakkhipeyya [pakkhipati (visuddhi. 1.181)], ukkāmukhe pakkhipitvā kālena kālaṃ abhidhamati, kālena kālaṃ udakena paripphoseti, kālena kālaṃ ajjhupekkhati. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ abhidhameyya, ṭhānaṃ taṃ jātarūpaṃ ḍaheyya. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ udakena paripphoseyya, ṭhānaṃ taṃ jātarūpaṃ nibbāpeyya [nibbāyeyya (sī.)]. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ ajjhupekkheyya, ṭhānaṃ taṃ jātarūpaṃ na sammā paripākaṃ gaccheyya. Yato ca kho, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ kālena kālaṃ abhidhamati, kālena kālaṃ udakena paripphoseti, kālena kālaṃ ajjhupekkhati, taṃ hoti jātarūpaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā upeti kammāya. Yassā yassā ca pilandhanavikatiyā ākaṅkhati – yadi paṭṭikāya, yadi kuṇḍalāya, yadi gīveyyake, yadi suvaṇṇamālāya – tañcassa atthaṃ anubhoti. ‘‘Evamevaṃ kho, bhikkhave, adhicittamanuyuttena bhikkhunā tīṇi nimittāni kālena kālaṃ manasi kātabbāni – kālena kālaṃ samādhinimittaṃ manasi kātabbaṃ, kālena kālaṃ paggahanimittaṃ manasi kātabbaṃ, kālena kālaṃ upekkhānimittaṃ manasi kātabbaṃ. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ samādhinimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ kosajjāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ paggahanimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ uddhaccāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ upekkhānimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ na sammā samādhiyeyya āsavānaṃ khayāya. Yato ca kho, bhikkhave, adhicittamanuyutto bhikkhu kālena kālaṃ samādhinimittaṃ manasi karoti, kālena kālaṃ paggahanimittaṃ manasi karoti, kālena kālaṃ upekkhānimittaṃ manasi karoti, taṃ hoti cittaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā samādhiyati āsavānaṃ khayāya. Yassa yassa ca abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ…pe… (cha abhiññā vitthāretabbā) āsavānaṃ khayā…pe… sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’ti. Ekādasamaṃ. ",
      "english": "Monks, a monk devoted to the higher mind should, from time to time, keep three signs in mind: from time to time, the sign of concentration; from time to time, the sign of exertion; from time to time, the sign of equanimity. If, monks, a monk devoted to the higher mind were to focus exclusively on the sign of concentration, it is likely that his mind would lead to sluggishness. If, monks, a monk devoted to the higher mind were to focus exclusively on the sign of exertion, it is likely that his mind would lead to restlessness. If, monks, a monk devoted to the higher mind were to focus exclusively on the sign of equanimity, it is likely that his mind would not be rightly concentrated for the destruction of the taints. But when, monks, a monk devoted to the higher mind focuses on the sign of concentration from time to time, on the sign of exertion from time to time, and on the sign of equanimity from time to time, then his mind becomes pliable, workable, radiant, and not brittle. It becomes rightly concentrated for the destruction of the taints.\n\nJust as, monks, a goldsmith or a goldsmith's apprentice would set up a furnace. Having set up the furnace, he would smear the mouth of the furnace. Having smeared the mouth of the furnace, taking raw gold with tongs, he would place it in the mouth of the furnace. Having placed it in the mouth of the furnace, he blows on it from time to time, sprinkles it with water from time to time, and observes it with equanimity from time to time. If, monks, the goldsmith or apprentice were to blow on that raw gold exclusively, it is likely that the gold would burn up. If, monks, the goldsmith or apprentice were to sprinkle that raw gold exclusively with water, it is likely that the gold would cool down. If, monks, the goldsmith or apprentice were to observe that raw gold exclusively with equanimity, it is likely that the gold would not be properly refined. But when, monks, the goldsmith or apprentice blows on that raw gold from time to time, sprinkles it with water from time to time, and observes it with equanimity from time to time, then the raw gold becomes pliable, workable, radiant, and not brittle. It is rightly prepared for any work. Whatever kind of ornamentation he wishes to make – whether a belt, earrings, a necklace, or a gold garland – he achieves that purpose.\n\nExactly in the same way, monks, a monk devoted to the higher mind should, from time to time, keep three signs in mind: from time to time, the sign of concentration; from time to time, the sign of exertion; from time to time, the sign of equanimity. If, monks, a monk devoted to the higher mind were to focus exclusively on the sign of concentration, it is likely that his mind would lead to sluggishness. If, monks, a monk devoted to the higher mind were to focus exclusively on the sign of exertion, it is likely that his mind would lead to restlessness. If, monks, a monk devoted to the higher mind were to focus exclusively on the sign of equanimity, it is likely that his mind would not be rightly concentrated for the destruction of the taints. But when, monks, a monk devoted to the higher mind focuses on the sign of concentration from time to time, on the sign of exertion from time to time, and on the sign of equanimity from time to time, then his mind becomes pliable, workable, radiant, and not brittle. It becomes rightly concentrated for the destruction of the taints. To whatever supernormal phenomenon he inclines his mind for its direct realization, he attains the capacity for direct experience, provided there is a suitable basis. If he wishes: ‘May I experience various kinds of supernormal powers; may I hear sounds both human and divine, far and near, with the divine ear element, purified and surpassing human; may I know the minds of other beings, other individuals, comprehending mind with mind; may I recollect my manifold past lives; may I see with the divine eye, purified and surpassing human, beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and understand how beings fare according to their kamma; may I, through the destruction of the taints, realize for myself, in this very life, freedom of mind and freedom through wisdom, and abide therein,’ then in each instance he attains the capacity for direct experience, provided there is a suitable basis.",
      "sinhala": "මහණෙනි, අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුවක් විසින් අවශ්‍ය අවස්ථාවලදී නිමිති තුනක් මෙනෙහි කළ යුත්තේය. එනම්, අවශ්‍ය අවස්ථාවලදී සමාධි නිමිත්ත මෙනෙහි කළ යුත්තේය, අවශ්‍ය අවස්ථාවලදී වීර්යය නිමිත්ත මෙනෙහි කළ යුත්තේය, අවශ්‍ය අවස්ථාවලදී උපේක්ෂා නිමිත්ත මෙනෙහි කළ යුත්තේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව නිරන්තරයෙන්ම සමාධි නිමිත්ත පමණක් මෙනෙහි කරන්නේ නම්, ඔහුගේ සිත අලසබවට පත්වීමට හේතු වන්නේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව නිරන්තරයෙන්ම වීර්යය නිමිත්ත පමණක් මෙනෙහි කරන්නේ නම්, ඔහුගේ සිත උද්දච්චබවට පත්වීමට හේතු වන්නේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව නිරන්තරයෙන්ම උපේක්ෂා නිමිත්ත පමණක් මෙනෙහි කරන්නේ නම්, ඔහුගේ සිත ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිසි ලෙස සමාධිගත නොවන්නේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව අවශ්‍ය අවස්ථාවලදී සමාධි නිමිත්තද, අවශ්‍ය අවස්ථාවලදී වීර්යය නිමිත්තද, අවශ්‍ය අවස්ථාවලදී උපේක්ෂා නිමිත්තද මෙනෙහි කරන්නේද, එවිට ඔහුගේ සිත මෘදුද, කර්මණ්‍ය වනසුලුද, ප්‍රභාමත්ද, බිඳී නොයන සුළුද වන්නේය. එය ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිසි ලෙස සමාධිගත වන්නේය.\n\nමහණෙනි, යම් සේ රන්කරුවෙක් හෝ රන්කරුවෙකුගේ අතවැසියෙක් හෝ උදුනක් සාදාගන්නේද, උදුන සාදාගෙන, උදුනේ මුව ආලේප කරන්නේද, උදුනේ මුව ආලේප කොට, අඬුවකින් අමු රන් ගෙන උදුනෙහි දමන්නේද, උදුනට දමා, අවශ්‍ය අවස්ථාවලදී පිඹින්නේද, අවශ්‍ය අවස්ථාවලදී ජලයෙන් ඉසින්නේද, අවශ්‍ය අවස්ථාවලදී උපේක්ෂාවෙන් බලා සිටින්නේද; මහණෙනි, යම් හෙයකින් රන්කරුවෙක් හෝ රන්කරුවෙකුගේ අතවැසියෙක් හෝ එම අමු රන් නිරන්තරයෙන්ම පිඹින්නේ නම්, එම රන් පිළිස්සී යෑමට හේතුවක් වන්නේය. මහණෙනි, යම් හෙයකින් රන්කරුවෙක් හෝ රන්කරුවෙකුගේ අතවැසියෙක් හෝ එම අමු රන් නිරන්තරයෙන්ම ජලයෙන් ඉසින්නේ නම්, එම රන් නිවී යෑමට හේතුවක් වන්නේය. මහණෙනි, යම් හෙයකින් රන්කරුවෙක් හෝ රන්කරුවෙකුගේ අතවැසියෙක් හෝ එම අමු රන් නිරන්තරයෙන්ම උපේක්ෂාවෙන් බලා සිටින්නේ නම්, එම රන් නිසි පරිදි පදම් නොවීමට හේතුවක් වන්නේය. මහණෙනි, යම් හෙයකින් රන්කරුවෙක් හෝ රන්කරුවෙකුගේ අතවැසියෙක් හෝ එම අමු රන් අවශ්‍ය අවස්ථාවලදී පිඹින්නේද, අවශ්‍ය අවස්ථාවලදී ජලයෙන් ඉසින්නේද, අවශ්‍ය අවස්ථාවලදී උපේක්ෂාවෙන් බලා සිටින්නේද, එවිට එම රන් මෘදුද, කර්මණ්‍ය වනසුලුද, ප්‍රභාමත්ද, බිඳී නොයන සුළුද වන්නේය. එය නිසි ලෙස කටයුතු සඳහා සුදුසු වන්නේය. එනම්, පටියක් වේවා, කරාබුවක් වේවා, මාලයක් වේවා, රන් මාලාවක් වේවා, යම් යම් ආභරණයක් සඳහා ඔහු ප්‍රාර්ථනා කරන්නේද, ඒ ඒ අභිමතාර්ථය ඉටුකරගන්නේය.\n\nමහණෙනි, එලෙසම, අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුවක් විසින් අවශ්‍ය අවස්ථාවලදී නිමිති තුනක් මෙනෙහි කළ යුත්තේය. එනම්, අවශ්‍ය අවස්ථාවලදී සමාධි නිමිත්තද, අවශ්‍ය අවස්ථාවලදී වීර්යය නිමිත්තද, අවශ්‍ය අවස්ථාවලදී උපේක්ෂා නිමිත්තද මෙනෙහි කළ යුත්තේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව නිරන්තරයෙන්ම සමාධි නිමිත්ත පමණක් මෙනෙහි කරන්නේ නම්, ඔහුගේ සිත අලසබවට පත්වීමට හේතු වන්නේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව නිරන්තරයෙන්ම වීර්යය නිමිත්ත පමණක් මෙනෙහි කරන්නේ නම්, ඔහුගේ සිත උද්දච්චබවට පත්වීමට හේතු වන්නේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව නිරන්තරයෙන්ම උපේක්ෂා නිමිත්ත පමණක් මෙනෙහි කරන්නේ නම්, ඔහුගේ සිත ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිසි ලෙස සමාධිගත නොවන්නේය. මහණෙනි, යම් හෙයකින් අධිචිත්ත භාවනාවෙහි යෙදෙන භික්ෂුව අවශ්‍ය අවස්ථාවලදී සමාධි නිමිත්තද, අවශ්‍ය අවස්ථාවලදී වීර්යය නිමිත්තද, අවශ්‍ය අවස්ථාවලදී උපේක්ෂා නිමිත්තද මෙනෙහි කරන්නේද, එවිට ඔහුගේ සිත මෘදුද, කර්මණ්‍ය වනසුලුද, ප්‍රභාමත්ද, බිඳී නොයන සුළුද වන්නේය. එය ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිසි ලෙස සමාධිගත වන්නේය. යම් යම් අභිඥාවෙන් සාක්ෂාත් කළ යුතු ධර්මයක් වෙත අභිඥාවෙන් සාක්ෂාත් කිරීම පිණිස සිත යොමු කරන්නේද, ඒ ඒ ක්ෂේත්‍රයෙහි ඇති හැකියාව අනුව ප්‍රත්‍යක්ෂයෙන් සාක්ෂාත් කිරීමේ සමත් බවට පැමිණෙන්නේය. හෙතෙම, ‘මම නොයෙක් ආකාර වූ ඉර්ධි ප්‍රාතිහාර්යයන් අත්දකින්නෙමි... ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්... (ඒ ධර්මයන්) තමාගේම ප්‍රත්‍යක්ෂයෙන් අවබෝධ කරගෙන වාසය කරන්නෙමි’ කියා ප්‍රාර්ථනා කරන්නේද, ඒ ඒ ක්ෂේත්‍රයෙහි ඇති හැකියාව අනුව ප්‍රත්‍යක්ෂයෙන් සාක්ෂාත් කිරීමේ සමත් බවට පැමිණෙන්නේය.",
      "paliTitle": "Nimittasuttaṃ",
      "englishTitle": "The Sign Sutta",
      "sinhalaTitle": "නිමිත්ත සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Loṇakapallavaggo [loṇaphalavaggo (sī. syā. kaṃ. pī.)] pañcamo. Tassuddānaṃ – Accāyikaṃ pavivekaṃ, sarado parisā tayo; Ājānīyā potthako ca, loṇaṃ dhovati nimittānīti. Dutiyo paṇṇāsako samatto.",
    "english": "",
    "sinhala": ""
  }
}