{
  "id": "an3.17",
  "title": {
    "pali": "Kammapathapeyyālaṃ",
    "english": "The Section on the Courses of Action",
    "sinhala": "කර්මපථ පිළිබඳ විස්තර මාලාව"
  },
  "sections": [
    {
      "number": 164,
      "numberRange": "164-183",
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi tīhi? Attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti, pāṇātipāte ca samanuñño hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Tīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi tīhi? Attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti, pāṇātipātā veramaṇiyā ca samanuñño hoti…. ‘‘Attanā ca adinnādāyī hoti, parañca adinnādāne samādapeti, adinnādāne ca samanuñño hoti…. ‘‘Attanā ca adinnādānā paṭivirato hoti, parañca adinnādānā veramaṇiyā samādapeti, adinnādānā veramaṇiyā ca samanuñño hoti…. ‘‘Attanā ca kāmesumicchācārī hoti, parañca kāmesumicchācāre samādapeti, kāmesumicchācāre ca samanuñño hoti…. ‘‘Attanā ca kāmesumicchācārā paṭivirato hoti, parañca kāmesumicchācārā veramaṇiyā samādapeti, kāmesumicchācārā veramaṇiyā ca samanuñño hoti…. ‘‘Attanā ca musāvādī hoti, parañca musāvāde samādapeti, musāvāde ca samanuñño hoti…. ‘‘Attanā ca musāvādā paṭivirato hoti, parañca musāvādā veramaṇiyā samādapeti, musāvādā veramaṇiyā ca samanuñño hoti…. ‘‘Attanā ca pisuṇavāco hoti, parañca pisuṇāya vācāya samādapeti, pisuṇāya vācāya ca samanuñño hoti…. ‘‘Attanā ca pisuṇāya vācāya paṭivirato hoti, parañca pisuṇāya vācāya veramaṇiyā samādapeti, pisuṇāya vācāya veramaṇiyā ca samanuñño hoti…. ‘‘Attanā ca pharusavāco hoti, parañca pharusāya vācāya samādapeti, pharusāya vācāya ca samanuñño hoti…. ‘‘Attanā ca pharusāya vācāya paṭivirato hoti, parañca pharusāya vācāya veramaṇiyā samādapeti, pharusāya vācāya veramaṇiyā ca samanuñño hoti…. ‘‘Attanā ca samphappalāpī hoti, parañca samphappalāpe samādapeti, samphappalāpe ca samanuñño hoti…. ‘‘Attanā ca samphappalāpā paṭivirato hoti, parañca samphappalāpā veramaṇiyā samādapeti, samphappalāpā veramaṇiyā ca samanuñño hoti…. ‘‘Attanā ca abhijjhālu hoti, parañca abhijjhāya samādapeti, abhijjhāya ca samanuñño hoti…. ‘‘Attanā ca anabhijjhālu hoti, parañca anabhijjhāya samādapeti, anabhijjhāya ca samanuñño hoti…. ‘‘Attanā ca byāpannacitto hoti, parañca byāpāde samādapeti, byāpāde ca samanuñño hoti…. ‘‘Attanā ca abyāpannacitto hoti, parañca abyāpāde samādapeti, abyāpāde ca samanuñño hoti…. ‘‘Attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti, micchādiṭṭhiyā ca samanuñño hoti …. ‘‘Attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti, sammādiṭṭhiyā ca samanuñño hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. ",
      "english": "Monks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally takes life, one encourages others to take life, and one approves of taking life. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally refrains from taking life, one encourages others in the abstention from taking life, and one approves of the abstention from taking life. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally takes what is not given, one encourages others to take what is not given, and one approves of taking what is not given. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally refrains from taking what is not given, one encourages others in the abstention from taking what is not given, and one approves of the abstention from taking what is not given. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally engages in sexual misconduct, one encourages others in sexual misconduct, and one approves of sexual misconduct. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally refrains from sexual misconduct, one encourages others in the abstention from sexual misconduct, and one approves of the abstention from sexual misconduct. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally speaks falsehoods, one encourages others to speak falsehoods, and one approves of speaking falsehoods. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally refrains from speaking falsehoods, one encourages others in the abstention from speaking falsehoods, and one approves of the abstention from speaking falsehoods. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally speaks divisive speech, one encourages others to speak divisive speech, and one approves of divisive speech. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally refrains from divisive speech, one encourages others in the abstention from divisive speech, and one approves of the abstention from divisive speech. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally speaks harsh speech, one encourages others to speak harsh speech, and one approves of harsh speech. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally refrains from harsh speech, one encourages others in the abstention from harsh speech, and one approves of the abstention from harsh speech. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally speaks idle chatter, one encourages others to speak idle chatter, and one approves of idle chatter. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally refrains from idle chatter, one encourages others in the abstention from idle chatter, and one approves of the abstention from idle chatter. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally is covetous, one encourages others in covetousness, and one approves of covetousness. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally is not covetous, one encourages others in non-covetousness, and one approves of non-covetousness. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally has a mind full of ill-will, one encourages others in ill-will, and one approves of ill-will. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally has a mind free from ill-will, one encourages others in freedom from ill-will, and one approves of freedom from ill-will. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in hell just as if brought there. Which three? One personally holds wrong view, one encourages others in wrong view, and one approves of wrong view. Monks, one who is endowed with these three qualities is deposited in hell just as if brought there.\n\nMonks, one who is endowed with three qualities is deposited in heaven just as if brought there. Which three? One personally holds right view, one encourages others in right view, and one approves of right view. Monks, one who is endowed with these three qualities is deposited in heaven just as if brought there.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා යම් සේ ගෙනැවිත් තැබූවාක් මෙන් නිරයෙහි උපදී. කවර තුනකින් ද යත්: තෙමේ ද ප්‍රාණඝාතයෙහි යෙදෙයි, අනුන් ද ප්‍රාණඝාතයෙහි සමාදන් කරවයි, ප්‍රාණඝාතයෙහි ද සතුටු වෙයි. භික්ෂූන් වහන්ස, මේ ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා යම් සේ ගෙනැවිත් තැබූවාක් මෙන් නිරයෙහි උපදී.\n\nභික්ෂූන් වහන්ස, ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා යම් සේ ගෙනැවිත් තැබූවාක් මෙන් ස්වර්ගයෙහි උපදී. කවර තුනකින් ද යත්: තෙමේ ද ප්‍රාණඝාතයෙන් වැළකී සිටියි, අනුන් ද ප්‍රාණඝාතයෙන් වැළකීමෙහි සමාදන් කරවයි, ප්‍රාණඝාතයෙන් වැළකීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද අදත්තාදානයෙහි යෙදෙයි, අනුන් ද අදත්තාදානයෙහි සමාදන් කරවයි, අදත්තාදානයෙහි ද සතුටු වෙයි.\n\nතෙමේ ද අදත්තාදානයෙන් වැළකී සිටියි, අනුන් ද අදත්තාදානයෙන් වැළකීමෙහි සමාදන් කරවයි, අදත්තාදානයෙන් වැළකීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද කාමමිත්‍යාචාරයෙහි යෙදෙයි, අනුන් ද කාමමිත්‍යාචාරයෙහි සමාදන් කරවයි, කාමමිත්‍යාචාරයෙහි ද සතුටු වෙයි.\n\nතෙමේ ද කාමමිත්‍යාචාරයෙන් වැළකී සිටියි, අනුන් ද කාමමිත්‍යාචාරයෙන් වැළකීමෙහි සමාදන් කරවයි, කාමමිත්‍යාචාරයෙන් වැළකීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද මුසාවාදයෙහි යෙදෙයි, අනුන් ද මුසාවාදයෙහි සමාදන් කරවයි, මුසාවාදයෙහි ද සතුටු වෙයි.\n\nතෙමේ ද මුසාවාදයෙන් වැළකී සිටියි, අනුන් ද මුසාවාදයෙන් වැළකීමෙහි සමාදන් කරවයි, මුසාවාදයෙන් වැළකීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද පිසුණු වචන කීමෙහි යෙදෙයි, අනුන් ද පිසුණු වචන කීමෙහි සමාදන් කරවයි, පිසුණු වචන කීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද පිසුණු වචන කීමෙන් වැළකී සිටියි, අනුන් ද පිසුණු වචන කීමෙන් වැළකීමෙහි සමාදන් කරවයි, පිසුණු වචන කීමෙන් වැළකීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද පරොස් වචන කීමෙහි යෙදෙයි, අනුන් ද පරොස් වචන කීමෙහි සමාදන් කරවයි, පරොස් වචන කීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද පරොස් වචන කීමෙන් වැළකී සිටියි, අනුන් ද පරොස් වචන කීමෙන් වැළකීමෙහි සමාදන් කරවයි, පරොස් වචන කීමෙන් වැළකීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද සම්ඵප්පලාපයෙහි යෙදෙයි, අනුන් ද සම්ඵප්පලාපයෙහි සමාදන් කරවයි, සම්ඵප්පලාපයෙහි ද සතුටු වෙයි.\n\nතෙමේ ද සම්ඵප්පලාපයෙන් වැළකී සිටියි, අනුන් ද සම්ඵප්පලාපයෙන් වැළකීමෙහි සමාදන් කරවයි, සම්ඵප්පලාපයෙන් වැළකීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද අභිධ්‍යාවෙන් යුක්ත වෙයි, අනුන් ද අභිධ්‍යාවෙහි සමාදන් කරවයි, අභිධ්‍යාවෙහි ද සතුටු වෙයි.\n\nතෙමේ ද අභිධ්‍යාවෙන් තොර වෙයි, අනුන් ද අභිධ්‍යාවෙන් තොර වීමෙහි සමාදන් කරවයි, අභිධ්‍යාවෙන් තොර වීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද ව්‍යාපාද සිත් ඇත්තෙක් වෙයි, අනුන් ද ව්‍යාපාදයෙහි සමාදන් කරවයි, ව්‍යාපාදයෙහි ද සතුටු වෙයි.\n\nතෙමේ ද ව්‍යාපාද සිත් නැත්තෙක් වෙයි, අනුන් ද ව්‍යාපාදයෙන් තොර වීමෙහි සමාදන් කරවයි, ව්‍යාපාදයෙන් තොර වීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද මිසදිටු ඇත්තෙක් වෙයි, අනුන් ද මිසදිටු ගැනීමෙහි සමාදන් කරවයි, මිසදිටු ගැනීමෙහි ද සතුටු වෙයි.\n\nතෙමේ ද සම්මාදිට්ඨි ඇත්තෙක් වෙයි, අනුන් ද සම්මාදිට්ඨි ගැනීමෙහි සමාදන් කරවයි, සම්මාදිට්ඨි ගැනීමෙහි ද සතුටු වෙයි. භික්ෂූන් වහන්ස, මේ ධර්ම තුනකින් යුක්ත වූ පුද්ගලයා යම් සේ ගෙනැවිත් තැබූවාක් මෙන් ස්වර්ගයෙහි උපදී.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Kammapathapeyyālaṃ niṭṭhitaṃ. Tassuddānaṃ – Pāṇaṃ adinnamicchā ca, musāvādī ca pisuṇā; Pharusā samphappalāpo ca, abhijjhā byāpādadiṭṭhi ca; Kammapathesu peyyālaṃ, tikakena niyojayeti.",
    "english": "",
    "sinhala": ""
  }
}