{
  "id": "an3.14",
  "title": {
    "pali": "Maṅgalavaggo",
    "english": "The Chapter on Blessings",
    "sinhala": "මංගල වග්ගය"
  },
  "sections": [
    {
      "number": 134,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Katamehi tīhi? Idha, bhikkhave, yodhājīvo dūre pātī ca hoti akkhaṇavedhī ca mahato ca kāyassa padāletā. Imehi, kho, bhikkhave, tīhi aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi aṅgehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu dūre pātī ca hoti akkhaṇavedhī ca mahato ca kāyassa padāletā. ‘‘Kathañca, bhikkhave, bhikkhu dūre pātī hoti? Idha, bhikkhave, bhikkhu yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ – ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā atītānāgatapaccuppannā ajjhattā vā bahiddhā vā oḷārikā vā sukhumā vā hīnā vā paṇītā vā yā dūre santike vā, sabbaṃ vedanaṃ [sabbā vedanā (syā. kaṃ. pī. ka.)] – ‘netaṃ mama, nesohamasmsmmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci saññā atītānāgatapaccuppannā ajjhattā vā bahiddhā vā oḷārikā vā sukhumā vā hīnā vā paṇītā vā yā dūre santike vā, sabbaṃ saññaṃ [sabbā saññā (syā. kaṃ. pī. ka.)] – ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Ye keci saṅkhārā atītānāgatapaccuppannā ajjhattā vā bahiddhā vā oḷārikā vā sukhumā vā hīnā vā paṇītā vā ye dūre santike vā, sabbe saṅkhāre – ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ – ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Evaṃ kho, bhikkhave, bhikkhu dūre pātī hoti. ‘‘Kathañca, bhikkhave, bhikkhu akkhaṇavedhī hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu akkhaṇavedhī hoti. ‘‘Kathañca, bhikkhave, bhikkhu mahato kāyassa padāletā hoti? Idha, bhikkhave, bhikkhu mahantaṃ avijjākkhandhaṃ padāleti. Evaṃ kho, bhikkhave, bhikkhu mahato kāyassa padāletā hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Paṭhamaṃ.",
      "english": "Monks, a warrior endowed with three qualities is fit for a king, worthy of royal use, and is counted as a limb of the king. Which three? Here, monks, the warrior shoots far, hits the mark without missing, and destroys a great mass. Indeed, monks, a warrior endowed with these three qualities is fit for a king, worthy of royal use, and is counted as a limb of the king.\n\nIn the same way, monks, a bhikkhu endowed with three qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world. Which three? Here, monks, the bhikkhu shoots far, hits the mark without missing, and destroys a great mass.\n\nAnd how, monks, does a bhikkhu shoot far? Here, monks, whatever form there is—past, future, or present; internal or external; coarse or subtle; inferior or exalted; far or near—he sees all form as it actually is with right wisdom: ‘This is not mine, I am not this, this is not my self.’ Whatever feeling there is—past, future, or present; internal or external; coarse or subtle; inferior or exalted; far or near—he sees all feeling as it actually is with right wisdom: ‘This is not mine, I am not this, this is not my self.’ Whatever perception there is—past, future, or present; internal or external; coarse or subtle; inferior or exalted; far or near—he sees all perception as it actually is with right wisdom: ‘This is not mine, I am not this, this is not my self.’ Whatever volitional formations there are—past, future, or present; internal or external; coarse or subtle; inferior or exalted; far or near—he sees all volitional formations as they actually are with right wisdom: ‘These are not mine, I am not this, this is not my self.’ Whatever consciousness there is—past, future, or present; internal or external; coarse or subtle; inferior or exalted; far or near—he sees all consciousness as it actually is with right wisdom: ‘This is not mine, I am not this, this is not my self.’ It is in this way, monks, that a bhikkhu shoots far.\n\nAnd how, monks, does a bhikkhu hit the mark without missing? Here, monks, a bhikkhu understands as it actually is: ‘This is suffering’; he understands as it actually is: ‘This is the origin of suffering’; he understands as it actually is: ‘This is the cessation of suffering’; he understands as it actually is: ‘This is the path leading to the cessation of suffering.’ It is in this way, monks, that a bhikkhu hits the mark without missing.\n\nAnd how, monks, does a bhikkhu destroy a great mass? Here, monks, a bhikkhu destroys the great mass of ignorance. It is in this way, monks, that a bhikkhu destroys a great mass.\n\nIndeed, monks, a bhikkhu endowed with these three qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world.",
      "sinhala": "භික්ෂූණි, අංග තුනකින් යුක්ත යෝධ වෘත්තිකයෙක් රජුට සුදුසු වේ; රජුට භෝගයෙක් වේ; රජුගේ අංගයක් ලෙස ගණන් ගනු ලැබේ. ඒ කවර තුනකින්ද? භික්ෂූණි, මෙහිලා යෝධ වෘත්තිකයෙක් දුර විදින්නෙක් ද වේ, නිවැරදි ඉලක්කයට විදින්නෙක් ද වේ, මහත් ශරීරයක් භේදනය කරන්නෙක් ද වේ. භික්ෂූණි, මේ අංග තුනෙන් යුක්ත යෝධ වෘත්තිකයෙක් රජුට සුදුසු වේ; රජුට භෝගයෙක් වේ; රජුගේ අංගයක් ලෙස ගණන් ගනු ලැබේ.\n\nඑලෙසින්ම භික්ෂූණි, අංග තුනකින් යුක්ත භික්ෂුවක් ආහුණෙය්‍ය (දූරයෙන් ගෙනවිත් දෙන දන් වැළඳීමට සුදුසු) වේ, පාහුණෙය්‍ය (පා පහළ වූ තැන පිදූ දන් වැළඳීමට සුදුසු) වේ, දක්ඛිණෙය්‍ය (දක්ෂිණාවට සුදුසු) වේ, අඤ්ජලිකරණීය (ඇඳිලි පිදීමට සුදුසු) වේ, ලෝකයාගේ නිරුත්තර වූ පින් කෙතක් ද වේ. ඒ කවර තුනකින්ද? භික්ෂූණි, මෙහිලා භික්ෂුවක් දුර විදින්නෙක් ද වේ, නිවැරදි ඉලක්කයට විදින්නෙක් ද වේ, මහත් ශරීරයක් භේදනය කරන්නෙක් ද වේ.\n\nභික්ෂූණි, භික්ෂුවක් දුර විදින්නෙක් වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා භික්ෂුව යම් කිසි රූපයක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික වේවා, බාහිර වේවා, ඕලාරික වේවා, සියුම් වේවා, හීන වේවා, ප්‍ර(U+200D)ණීත වේවා, දුර වේවා, ළඟ වේවා, ඒ සියලු රූපය ‘මෙය මගේ නොවේ, මම මෙය නොවෙමි, මෙය මාගේ ආත්මය නොවේ’ යැයි යථාභූතව සම්මා ප්‍ර(U+200D)ඥාවෙන් දකී. යම් කිසි වේදනාවක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික වේවා, බාහිර වේවා, ඕලාරික වේවා, සියුම් වේවා, හීන වේවා, ප්‍ර(U+200D)ණීත වේවා, දුර වේවා, ළඟ වේවා, ඒ සියලු වේදනාව ‘මෙය මගේ නොවේ, මම මෙය නොවෙමි, මෙය මාගේ ආත්මය නොවේ’ යැයි යථාභූතව සම්මා ප්‍ර(U+200D)ඥාවෙන් දකී. යම් කිසි සංඥාවක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික වේවා, බාහිර වේවා, ඕලාරික වේවා, සියුම් වේවා, හීන වේවා, ප්‍ර(U+200D)ණීත වේවා, දුර වේවා, ළඟ වේවා, ඒ සියලු සංඥාව ‘මෙය මගේ නොවේ, මම මෙය නොවෙමි, මෙය මාගේ ආත්මය නොවේ’ යැයි යථාභූතව සම්මා ප්‍ර(U+200D)ඥාවෙන් දකී. යම් කිසි සංස්කාරයන් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික වේවා, බාහිර වේවා, ඕලාරික වේවා, සියුම් වේවා, හීන වේවා, ප්‍ර(U+200D)ණීත වේවා, දුර වේවා, ළඟ වේවා, ඒ සියලු සංස්කාරයන් ‘මෙය මගේ නොවේ, මම මෙය නොවෙමි, මෙය මාගේ ආත්මය නොවේ’ යැයි යථාභූතව සම්මා ප්‍ර(U+200D)ඥාවෙන් දකී. යම් කිසි විඤ්ඤාණයක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික වේවා, බාහිර වේවා, ඕලාරික වේවා, සියුම් වේවා, හීන වේවා, ප්‍ර(U+200D)ණීත වේවා, දුර වේවා, ළඟ වේවා, ඒ සියලු විඤ්ඤාණය ‘මෙය මගේ නොවේ, මම මෙය නොවෙමි, මෙය මාගේ ආත්මය නොවේ’ යැයි යථාභූතව සම්මා ප්‍ර(U+200D)ඥාවෙන් දකී. භික්ෂූණි, භික්ෂුවක් දුර විදින්නෙක් වන්නේ මෙලෙසිනි.\n\nභික්ෂූණි, භික්ෂුවක් නිවැරදි ඉලක්කයට විදින්නෙක් වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා භික්ෂුව ‘මේ දුක යි’ යැයි යථාභූතව අවබෝධ කරයි; ‘මේ දුක ඇතිවීම යි’ යැයි යථාභූතව අවබෝධ කරයි; ‘මේ දුක නැතිවීම යි’ යැයි යථාභූතව අවබෝධ කරයි; ‘මේ දුක නැතිකරන ප්‍රතිපදාව යි’ යැයි යථාභූතව අවබෝධ කරයි. භික්ෂූණි, භික්ෂුවක් නිවැරදි ඉලක්කයට විදින්නෙක් වන්නේ මෙලෙසිනි.\n\nභික්ෂූණි, භික්ෂුවක් මහත් ශරීරයක් භේදනය කරන්නෙක් වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා භික්ෂුව මහත් වූ අවිද්‍යාස්කන්ධය භේදනය කරයි. භික්ෂූණි, භික්ෂුවක් මහත් ශරීරයක් භේදනය කරන්නෙක් වන්නේ මෙලෙසිනි. භික්ෂූණි, මේ ධර්ම තුනෙන් යුක්ත භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාගේ නිරුත්තර වූ පින් කෙතක් ද වේ.",
      "paliTitle": "Yodhājīvasuttaṃ"
    },
    {
      "number": 135,
      "pali": "‘‘Tisso imā, bhikkhave, parisā. Katamā tisso? Ukkācitavinītā parisā, paṭipucchāvinītā parisā, yāvatāvinītā [yāvatajjhāvinītā (aṭṭhakathāyaṃ pāṭhantaraṃ)] parisā – imā kho, bhikkhave, tisso parisā’’ti. Dutiyaṃ.",
      "english": "Monks, there are these three types of assemblies. Which three? An assembly that is disciplined by admonishment, an assembly that is disciplined by questioning, and an assembly that is disciplined by sufficient understanding. Indeed, monks, these are the three types of assemblies.",
      "sinhala": "මහණෙනි, මේ සභා තුනකි. ඒ කවර තුනක්ද? පැහැදිලිව දහම් දෙසීමෙන් හික්මවන ලද පිරිසක්, ප්‍රශ්න විමසීමෙන් හික්මවන ලද පිරිසක්, තේරුම්ගත් ප්‍රමාණයට හික්මවන ලද පිරිසක් – මහණෙනි, මේ සභා තුන නම් මේවාමයි.",
      "paliTitle": "Parisāsuttaṃ"
    },
    {
      "number": 136,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato mitto sevitabbo. Katamehi tīhi? ( ) [(idha bhikkhave bhikkhu) (pī. ka.)] Duddadaṃ dadāti, dukkaraṃ karoti, dukkhamaṃ khamati – imehi kho, bhikkhave, tīhi aṅgehi samannāgato mitto sevitabbo’’ti. Tatiyaṃ.",
      "english": "Monks, a friend endowed with three qualities should be associated with. Which three? He gives what is hard to give, he does what is hard to do, and he endures what is hard to endure. Indeed, Monks, a friend endowed with these three qualities should be associated with.",
      "sinhala": "මහණෙනි, කරුණු තුනකින් යුක්ත වූ මිත්‍‌රයා ඇසුරු කළ යුතු යි. කවර තුනකින් ද? දීමට අපහසු දේ දෙයි, කිරීමට අපහසු දේ කරයි, ඉවසීමට අපහසු දේ ඉවසයි. මහණෙනි, මේ කරුණු තුනකින් යුක්ත වූ මිත්‍‌රයා ඇසුරු කළ යුතු යි.",
      "paliTitle": "Mittasuttaṃ"
    },
    {
      "number": 137,
      "pali": "‘‘Uppādā vā, bhikkhave, tathāgatānaṃ anuppādā vā tathāgatānaṃ, ṭhitāva sā dhātu dhammaṭṭhitatā dhammaniyāmatā. Sabbe saṅkhārā aniccā. Taṃ tathāgato abhisambujjhati abhisameti. Abhisambujjhitvā abhisametvā ācikkhati deseti paññāpeti paṭṭhapeti vivarati vibhajati uttānīkaroti – ‘sabbe saṅkhārā aniccā’ti. Uppādā vā, bhikkhave, tathāgatānaṃ anuppādā vā tathāgatānaṃ ṭhitāva sā dhātu dhammaṭṭhitatā dhammaniyāmatā. Sabbe saṅkhārā dukkhā. Taṃ tathāgato abhisambujjhati abhisameti. Abhisambujjhitvā abhisametvā ācikkhati deseti paññāpeti paṭṭhapeti vivarati vibhajati uttānīkaroti – ‘sabbe saṅkhārā dukkhā’ti. Uppādā vā, bhikkhave, tathāgatānaṃ anuppādā vā tathāgatānaṃ ṭhitāva sā dhātu dhammaṭṭhitatā dhammaniyāmatā. Sabbe dhammā anattā. Taṃ tathāgato abhisambujjhati abhisameti. Abhisambujjhitvā abhisametvā ācikkhati deseti paññāpeti paṭṭhapeti vivarati vibhajati uttānīkaroti – ‘sabbe dhammā anattā’’’ti. Catutthaṃ.",
      "english": "Monks, whether Tathāgatas appear or do not appear, this fundamental truth remains — the enduring nature of the Dhamma, the fixed order of the Dhamma: all conditioned phenomena are impermanent. This the Tathāgata fully comprehends and realizes. Having fully comprehended and realized this, he points it out, teaches it, declares it, establishes it, discloses it, analyzes it, and makes it clear: 'All conditioned phenomena are impermanent.' Monks, whether Tathāgatas appear or do not appear, this fundamental truth remains — the enduring nature of the Dhamma, the fixed order of the Dhamma: all conditioned phenomena are unsatisfactory. This the Tathāgata fully comprehends and realizes. Having fully comprehended and realized this, he points it out, teaches it, declares it, establishes it, discloses it, analyzes it, and makes it clear: 'All conditioned phenomena are unsatisfactory.' Monks, whether Tathāgatas appear or do not appear, this fundamental truth remains — the enduring nature of the Dhamma, the fixed order of the Dhamma: all phenomena are not-self. This the Tathāgata fully comprehends and realizes. Having fully comprehended and realized this, he points it out, teaches it, declares it, establishes it, discloses it, analyzes it, and makes it clear: 'All phenomena are not-self.'",
      "sinhala": "මහණෙනි, තථාගතයන් වහන්සේලා ලෝකයේ පහළ වුවත්, පහළ නොවුවත්, ‘සියලු සංස්කාර අනිත්‍ය යි’ යන ධර්ම ස්ථිතිභාවය, ධර්ම නියාමතාවය නම් වූ ඒ ධාතුව ස්ථීරව පවතී. සියලු සංස්කාර අනිත්‍ය යි. තථාගතයන් වහන්සේ එය සම්පූර්ණයෙන් අවබෝධ කොට, ප්‍ර‍‌ත්‍යක්‍ෂ කරගනිති. එසේ මනාව අවබෝධ කොට, ප්‍ර‍‌ත්‍යක්‍ෂ කොට, ‘සියලු සංස්කාර අනිත්‍ය යි’ යන මේ ධර්මතාවය ප්‍ර‍‌කාශ කරති, දේශනා කරති, ප්‍ර‍‌ඥප්ත කරති, පිහිටුවති, විවෘත කරති, විභජනය කරති, පැහැදිලි කරති. මහණෙනි, තථාගතයන් වහන්සේලා ලෝකයේ පහළ වුවත්, පහළ නොවුවත්, ‘සියලු සංස්කාර දුක් යි’ යන ධර්ම ස්ථිතිභාවය, ධර්ම නියාමතාවය නම් වූ ඒ ධාතුව ස්ථීරව පවතී. සියලු සංස්කාර දුක් යි. තථාගතයන් වහන්සේ එය සම්පූර්ණයෙන් අවබෝධ කොට, ප්‍ර‍‌ත්‍යක්‍ෂ කරගනිති. එසේ මනාව අවබෝධ කොට, ප්‍ර‍‌ත්‍යක්‍ෂ කොට, ‘සියලු සංස්කාර දුක් යි’ යන මේ ධර්මතාවය ප්‍ර‍‌කාශ කරති, දේශනා කරති, ප්‍ර‍‌ඥප්ත කරති, පිහිටුවති, විවෘත කරති, විභජනය කරති, පැහැදිලි කරති. මහණෙනි, තථාගතයන් වහන්සේලා ලෝකයේ පහළ වුවත්, පහළ නොවුවත්, ‘සියලු ධර්ම අනාත්ම යි’ යන ධර්ම ස්ථිතිභාවය, ධර්ම නියාමතාවය නම් වූ ඒ ධාතුව ස්ථීරව පවතී. සියලු ධර්ම අනාත්ම යි. තථාගතයන් වහන්සේ එය සම්පූර්ණයෙන් අවබෝධ කොට, ප්‍ර‍‌ත්‍යක්‍ෂ කරගනිති. එසේ මනාව අවබෝධ කොට, ප්‍ර‍‌ත්‍යක්‍ෂ කොට, ‘සියලු ධර්ම අනාත්ම යි’ යන මේ ධර්මතාවය ප්‍ර‍‌කාශ කරති, දේශනා කරති, ප්‍ර‍‌ඥප්ත කරති, පිහිටුවති, විවෘත කරති, විභජනය කරති, පැහැදිලි කරති.",
      "paliTitle": "Uppādāsuttaṃ"
    },
    {
      "number": 138,
      "pali": "‘‘Seyyathāpi, bhikkhave, yāni kānici tantāvutānaṃ vatthānaṃ, kesakambalo tesaṃ paṭikiṭṭho akkhāyati. Kesakambalo, bhikkhave, sīte sīto, uṇhe uṇho, dubbaṇṇo, duggandho, dukkhasamphasso. Evamevaṃ kho, bhikkhave, yāni kānici puthusamaṇabrāhmaṇavādānaṃ [samaṇappavādānaṃ (sī. syā. kaṃ. pī.)] makkhalivādo tesaṃ paṭikiṭṭho akkhāyati. ‘‘Makkhali, bhikkhave, moghapuriso evaṃvādī evaṃdiṭṭhi – ‘natthi kammaṃ, natthi kiriyaṃ, natthi vīriya’nti. Yepi te, bhikkhave, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, tepi bhagavanto kammavādā ceva ahesuṃ kiriyavādā ca vīriyavādā ca. Tepi, bhikkhave, makkhali moghapuriso paṭibāhati – ‘natthi kammaṃ, natthi kiriyaṃ, natthi vīriya’nti. Yepi te, bhikkhave, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, tepi bhagavanto kammavādā ceva bhavissanti kiriyavādā ca vīriyavādā ca. Tepi, bhikkhave, makkhali moghapuriso paṭibāhati – ‘natthi kammaṃ, natthi kiriyaṃ, natthi vīriya’nti. Ahampi, bhikkhave, etarahi arahaṃ sammāsambuddho kammavādo ceva kiriyavādo ca vīriyavādo ca. Mampi, bhikkhave, makkhali moghapuriso paṭibāhati – ‘natthi kammaṃ, natthi kiriyaṃ, natthi vīriya’’’nti. ‘‘Seyyathāpi, bhikkhave, nadīmukhe khippaṃ uḍḍeyya [oḍḍeyya (sī.)] bahūnaṃ [bahunnaṃ (sī. syā. kaṃ. pī.)] macchānaṃ ahitāya dukkhāya anayāya byasanāya; evamevaṃ kho, bhikkhave, makkhali moghapuriso manussakhippaṃ maññe loke uppanno bahūnaṃ sattānaṃ ahitāya dukkhāya anayāya byasanāyā’’ti. Pañcamaṃ.",
      "english": "Monks, just as a hair blanket is declared to be the worst of all woven cloths, because a hair blanket, monks, is cold in the cold season, hot in the hot season, ugly, foul-smelling, and unpleasant to touch; in the same way, monks, the doctrine of Makkhali is declared to be the worst of all the various doctrines of ascetics and brahmins. Monks, Makkhali, that deluded man, holds such views and teaches such doctrines: 'There is no action, there is no deed, there is no effort.' And those, monks, who in the past were Arahants, Perfectly Self-Enlightened Ones, those Blessed Ones were teachers of action, teachers of deeds, and teachers of effort. Yet, even those, monks, Makkhali, that deluded man, contradicts by saying: 'There is no action, there is no deed, there is no effort.' And those, monks, who in the future will be Arahants, Perfectly Self-Enlightened Ones, those Blessed Ones will be teachers of action, teachers of deeds, and teachers of effort. Yet, even those, monks, Makkhali, that deluded man, contradicts by saying: 'There is no action, there is no deed, there is no effort.' I myself, monks, at present, being an Arahant, a Perfectly Self-Enlightened One, am a teacher of action, a teacher of deeds, and a teacher of effort. Yet, even me, monks, Makkhali, that deluded man, contradicts by saying: 'There is no action, there is no deed, there is no effort.'\n\nMonks, just as a net is quickly cast at the mouth of a river for the harm, suffering, downfall, and ruin of many fish, in the same way, monks, Makkhali, that deluded man, has, I consider, quickly arisen in the world as a human being for the harm, suffering, downfall, and ruin of many beings.",
      "sinhala": "මහණෙනි, යම්සේ කෙඳි වලින් වියන ලද වස්ත්‍ර වර්ග ඇත්ද, ඒ සියල්ලටම වඩා කෙස් කම්බල ඉතා පහත් යැයි කියනු ලැබේ. මහණෙනි, ඒ කෙස් කම්බල සීතලෙහි සීතල ය, උෂ්ණයේදී උෂ්ණ ය, දුර්‍වර්ණ ය, දුර්‍ගන්ධ ය, දුක් ස්පර්ශ සහිත ය. මහණෙනි, එපරිද්දෙන්ම, යම්කිසි බොහෝ ශ්‍රමණ බ්‍රාහ්මණයන්ගේ වාදයන් (දෘෂ්ටි) ඇත්ද, ඒ සියල්ලටම වඩා මක්ඛලීගේ වාදය (දෘෂ්ටිය) ඉතා පහත් යැයි කියනු ලැබේ.\n\nමහණෙනි, ඒ මක්ඛලී නම් හිස් පුරුෂයා ‘කර්‍මයක් නැත, ක්‍රියාවක් නැත, වීර්‍යයක් නැත’ යනුවෙන් මෙබඳු වාද ඇත්තෙකි, මෙබඳු දෘෂ්ටි ඇත්තෙකි. මහණෙනි, අතීත කාලයෙහි යම් රහත් වූ සම්‍යක් සම්බුදුවරු වී සිටියාහුද, ඒ භාග්‍යවතුන් වහන්සේලාද කර්‍මවාදී වූහ, ක්‍රියාවාදී වූහ, වීර්‍යවාදී වූහ. මහණෙනි, ඒ භාග්‍යවතුන් වහන්සේලාද ‘කර්‍මයක් නැත, ක්‍රියාවක් නැත, වීර්‍යයක් නැත’ යනුවෙන් මක්ඛලී නම් හිස් පුරුෂයා ප්‍රතික්ෂේප කරයි. මහණෙනි, අනාගත කාලයෙහි යම් රහත් වූ සම්‍යක් සම්බුදුවරු ඇතිවන්නාහුද, ඒ භාග්‍යවතුන් වහන්සේලාද කර්‍මවාදී වන්නාහුය, ක්‍රියාවාදී වන්නාහුය, වීර්‍යවාදී වන්නාහුය. මහණෙනි, ඒ භාග්‍යවතුන් වහන්සේලාද ‘කර්‍මයක් නැත, ක්‍රියාවක් නැත, වීර්‍යයක් නැත’ යනුවෙන් මක්ඛලී නම් හිස් පුරුෂයා ප්‍රතික්ෂේප කරයි. මහණෙනි, මේ දැන් රහත් වූ සම්‍යක් සම්බුද්ධ වූ මමද කර්‍මවාදී වෙමි, ක්‍රියාවාදී වෙමි, වීර්‍යවාදී වෙමි. මහණෙනි, මාද ‘කර්‍මයක් නැත, ක්‍රියාවක් නැත, වීර්‍යයක් නැත’ යනුවෙන් මක්ඛලී නම් හිස් පුරුෂයා ප්‍රතික්ෂේප කරයි.\n\nමහණෙනි, යම්සේ මුවදොරෙහි කඩිනමින් මසුන් බොහෝ දෙනෙකුට අහිත පිණිස, දුක පිණිස, විනාශය පිණිස, පීඩා පිණිස දැලක් අටවනු ලැබේ ද, මහණෙනි, එපරිද්දෙන්ම මක්ඛලී නම් හිස් පුරුෂයා මිනිස් දැලක් මෙන් ලෝකයෙහි උපදිනු ලැබුවේ බොහෝ සත්වයන්ට අහිත පිණිස, දුක පිණිස, විනාශය පිණිස, පීඩා පිණිස යැයි මම සිතමි.",
      "paliTitle": "Kesakambalasuttaṃ"
    },
    {
      "number": 139,
      "pali": "‘‘Tisso imā, bhikkhave, sampadā. Katamā tisso? Saddhāsampadā, sīlasampadā, paññāsampadā – imā kho, bhikkhave, tisso sampadā’’ti. Chaṭṭhaṃ.",
      "english": "Monastics, there are these three accomplishments. Which three? The accomplishment of faith, the accomplishment of moral virtue, and the accomplishment of wisdom — these, indeed, Monastics, are the three accomplishments.",
      "sinhala": "මහණෙනි, මේ සම්පදා තුනකි. ඒ කවර සම්පදා තුනක්ද? ශ්‍රද්ධා සම්පදාව, ශීල සම්පදාව, ප්‍රඥා සම්පදාව. මහණෙනි, මේවාමයි ඒ සම්පදා තුන.",
      "paliTitle": "Sampadāsuttaṃ"
    },
    {
      "number": 140,
      "pali": "‘‘Tisso imā, bhikkhave, vuddhiyo. Katamā tisso? Saddhāvuddhi, sīlavuddhi, paññāvuddhi – imā kho, bhikkhave, tisso vuddhiyo’’ti. Sattamaṃ.",
      "english": "Monks, there are these three kinds of growth. Which three? Growth in conviction, growth in moral conduct, and growth in wisdom—these, monks, are the three kinds of growth.",
      "sinhala": "මහණෙනි, මේ වෘද්ධීන් තුනක් ඇත. ඒ තුන කුමක්ද? ශ්‍ර‌ද්ධා වෘද්ධිය, ශීල වෘද්ධිය, ප්‍ර‌ඥා වෘද්ධියයි. මහණෙනි, මේ වෘද්ධීන් තුනක් ඇත.",
      "paliTitle": "Vuddhisuttaṃ"
    },
    {
      "number": 141,
      "pali": "‘‘Tayo ca, bhikkhave, assakhaḷuṅke desessāmi tayo ca purisakhaḷuṅke. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katame ca, bhikkhave, tayo assakhaḷuṅkā? Idha, bhikkhave, ekacco assakhaḷuṅko javasampanno hoti; na vaṇṇasampanno, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo assakhaḷuṅkā. ‘‘Katame ca, bhikkhave, tayo purisakhaḷuṅkā? Idha, bhikkhave, ekacco purisakhaḷuṅko javasampanno hoti; na vaṇṇasampanno, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, purisakhaḷuṅko javasampanno hoti; na vaṇṇasampanno na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho saṃsādeti [saṃhīreti (ka.)], no vissajjeti. Idamassa na vaṇṇasmiṃ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Idamassa na ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisakhaḷuṅko javasampanno hoti; na vaṇṇasampanno, na ārohapariṇāhasampanno. ‘‘Kathañca, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Na pana lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Idamassa na ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno. ‘‘Kathañca, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Idamassa ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo purisakhaḷuṅkā’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, I shall teach you about three types of horses and three types of persons. Listen to that, attend carefully, I will speak.”\n\n“Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One said this: “And what, monks, are the three types of horses? Here, monks, one type of horse is endowed with speed, but not with beauty, nor with excellent stature and girth. Here again, monks, one type of horse is endowed with speed and with beauty, but not with excellent stature and girth. Here again, monks, one type of horse is endowed with speed, with beauty, and with excellent stature and girth. These, monks, are the three types of horses.\n\n“And what, monks, are the three types of persons? Here, monks, one type of person is endowed with speed, but not with beauty, nor with excellent stature and girth. Here again, monks, one type of person is endowed with speed and with beauty, but not with excellent stature and girth. Here again, monks, one type of person is endowed with speed, with beauty, and with excellent stature and girth.\n\n“And how, monks, is a person endowed with speed, but not with beauty, nor with excellent stature and girth? Here, monks, a monk understands ‘This is suffering’ as it actually is, and he understands ‘This is the origin of suffering’ as it actually is, and he understands ‘This is the cessation of suffering’ as it actually is, and he understands ‘This is the path leading to the cessation of suffering’ as it actually is. This, I say, is his speed. But when questioned about the Abhidhamma or the higher Vinaya, he flounders, he does not answer. This, I say, is not his beauty. Furthermore, he is not a recipient of robes, almsfood, lodgings, or requisites for the sick, such as medicine. This, I say, is not his excellent stature and girth. Thus, monks, is a person endowed with speed, but not with beauty, nor with excellent stature and girth.\n\n“And how, monks, is a person endowed with speed and with beauty, but not with excellent stature and girth? Here, monks, a monk understands ‘This is suffering’ as it actually is, and he understands ‘This is the origin of suffering’ as it actually is, and he understands ‘This is the cessation of suffering’ as it actually is, and he understands ‘This is the path leading to the cessation of suffering’ as it actually is. This, I say, is his speed. But when questioned about the Abhidhamma or the higher Vinaya, he answers, he does not flounder. This, I say, is his beauty. But he is not a recipient of robes, almsfood, lodgings, or requisites for the sick, such as medicine. This, I say, is not his excellent stature and girth. Thus, monks, is a person endowed with speed and with beauty, but not with excellent stature and girth.\n\n“And how, monks, is a person endowed with speed, with beauty, and with excellent stature and girth? Here, monks, a monk understands ‘This is suffering’ as it actually is, and he understands ‘This is the origin of suffering’ as it actually is, and he understands ‘This is the cessation of suffering’ as it actually is, and he understands ‘This is the path leading to the cessation of suffering’ as it actually is. This, I say, is his speed. But when questioned about the Abhidhamma or the higher Vinaya, he answers, he does not flounder. This, I say, is his beauty. Furthermore, he is a recipient of robes, almsfood, lodgings, and requisites for the sick, such as medicine. This, I say, is his excellent stature and girth. Thus, monks, is a person endowed with speed, with beauty, and with excellent stature and girth. These, monks, are the three types of persons.”",
      "sinhala": "මහණෙනි, මම ඔබට අශ්ව පුද්ගලයන් තිදෙනෙකු සහ පුරිස පුද්ගලයන් තිදෙනෙකු දේශනා කරමි. එය අසන්න, මනාව සිතට ගන්න; මම දේශනා කරන්නෙමි.'' එවිට ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට \"එසේය, භාග්‍යවතුන් වහන්සැ\"යි පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, අශ්ව පුද්ගලයන් තිදෙනා කවරහුද? මහණෙනි, මෙලොව ඇතැම් අශ්ව පුද්ගලයෙක් වේගවත් බවකින් යුක්ත වෙයි; නමුත් වර්ණයෙන් යුක්ත නොවේ, ශරීර ප්‍රමාණයෙන් හා පිරිපුන් බවෙන් යුක්ත නොවේ. මහණෙනි, මෙලොව ඇතැම් අශ්ව පුද්ගලයෙක් වේගවත් බවකින් ද වර්ණයෙන් ද යුක්ත වෙයි; නමුත් ශරීර ප්‍රමාණයෙන් හා පිරිපුන් බවෙන් යුක්ත නොවේ. මහණෙනි, මෙලොව ඇතැම් අශ්ව පුද්ගලයෙක් වේගවත් බවකින් ද වර්ණයෙන් ද ශරීර ප්‍රමාණයෙන් හා පිරිපුන් බවෙන් ද යුක්ත වෙයි. මහණෙනි, මේ අශ්ව පුද්ගලයන් තිදෙනා ය.\n\n\"මහණෙනි, පුරිස පුද්ගලයන් තිදෙනා කවරහුද? මහණෙනි, මෙලොව ඇතැම් පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් යුක්ත වෙයි; නමුත් ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් යුක්ත නොවේ, සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස ආදී සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් යුක්ත නොවේ. මහණෙනි, මෙලොව ඇතැම් පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් ද, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් ද යුක්ත වෙයි; නමුත් සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් යුක්ත නොවේ. මහණෙනි, මෙලොව ඇතැම් පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් ද, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් ද, සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් ද යුක්ත වෙයි.\n\n\"මහණෙනි, පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් යුක්ත වන අතර, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් යුක්ත නොවන, සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් යුක්ත නොවන බව කියන්නේ කෙසේද? මහණෙනි, මෙලොව භික්ෂුවක් 'මෙය දුක ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුකට හේතුව ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුක නැතිකිරීම ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුක් නිරෝධ ගාමිනී ප‍්‍රතිපදාව ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. මෙය ඔහුගේ ධර්මාවබෝධ ශක්තිය ලෙස මම කියමි. එහෙත් ඔහුට අභිධර්මය හෝ අභිවිනය (උසස් විනය) පිළිබඳ ප‍්‍රශ්න ඇසූ කල්හි ඔහු ව්‍යාකූල වී, නිසි පිළිතුරු දීමට නොහැකි වේ. මෙය ඔහුගේ ධර්ම ප්‍රකාශනයේ දීප්තිමත් බව නොවන බව මම කියමි. තවද ඔහුට සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර නොලැබේ. මෙය ඔහුගේ භික්ෂු ජීවිතයේ පිරිපුන් බව හා පූජා ලාභය නොවන බව මම කියමි. මහණෙනි, මේ අයුරින් පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් යුක්ත වන අතර, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් යුක්ත නොවන, සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් යුක්ත නොවන බව කියනු ලැබේ.\n\n\"මහණෙනි, පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් ද, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් ද යුක්ත වන අතර, සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් යුක්ත නොවන බව කියන්නේ කෙසේද? මහණෙනි, මෙලොව භික්ෂුවක් 'මෙය දුක ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුකට හේතුව ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුක නැතිකිරීම ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුක් නිරෝධ ගාමිනී ප‍්‍රතිපදාව ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. මෙය ඔහුගේ ධර්මාවබෝධ ශක්තිය ලෙස මම කියමි. එහෙත් ඔහුට අභිධර්මය හෝ අභිවිනය පිළිබඳ ප‍්‍රශ්න ඇසූ කල්හි ඔහු ව්‍යාකූල නොවී, පැහැදිලිව පිළිතුරු දෙයි. මෙය ඔහුගේ ධර්ම ප්‍රකාශනයේ දීප්තිමත් බව ලෙස මම කියමි. තවද ඔහුට සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර නොලැබේ. මෙය ඔහුගේ භික්ෂු ජීවිතයේ පිරිපුන් බව හා පූජා ලාභය නොවන බව මම කියමි. මහණෙනි, මේ අයුරින් පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් ද, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් ද යුක්ත වන අතර, සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් යුක්ත නොවන බව කියනු ලැබේ.\n\n\"මහණෙනි, පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් ද, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් ද, සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් ද යුක්ත වන බව කියන්නේ කෙසේද? මහණෙනි, මෙලොව භික්ෂුවක් 'මෙය දුක ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුකට හේතුව ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුක නැතිකිරීම ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. 'මෙය දුක් නිරෝධ ගාමිනී ප‍්‍රතිපදාව ය' කියා යථාර්ථය පරිදි අවබෝධ කරයි. මෙය ඔහුගේ ධර්මාවබෝධ ශක්තිය ලෙස මම කියමි. එහෙත් ඔහුට අභිධර්මය හෝ අභිවිනය පිළිබඳ ප‍්‍රශ්න ඇසූ කල්හි ඔහු ව්‍යාකූල නොවී, පැහැදිලිව පිළිතුරු දෙයි. මෙය ඔහුගේ ධර්ම ප්‍රකාශනයේ දීප්තිමත් බව ලෙස මම කියමි. තවද ඔහුට සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලැබෙයි. මෙය ඔහුගේ භික්ෂු ජීවිතයේ පිරිපුන් බව හා පූජා ලාභය ලෙස මම කියමි. මහණෙනි, මේ අයුරින් පුරිස පුද්ගලයෙක් ධර්මය අවබෝධ කර ගැනීමේ ශක්තියෙන් ද, ධර්මය පැහැදිලි කිරීමේ දක්ෂතාවයෙන් ද, සතර පසය ලැබීමෙන් හා භික්ෂු ජීවිතයේ පිරිපුන් බවෙන් ද යුක්ත වන බව කියනු ලැබේ. මහණෙනි, මේ පුරිස පුද්ගලයන් තිදෙනා ය.\" අටවෙනි සූත්‍රයයි.",
      "paliTitle": "Assakhaḷuṅkasuttaṃ"
    },
    {
      "number": 142,
      "pali": "‘‘Tayo ca, bhikkhave, assaparasse [assasadasse (sī syā. kaṃ. pī.)] desessāmi tayo ca purisaparasse [purisasadasse (sī. syā. kaṃ. pī.)]. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katame ca, bhikkhave, tayo assaparassā? Idha, bhikkhave, ekacco assaparasso javasampanno hoti; na vaṇṇasampanno na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assaparasso javasampanno hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo assaparassā. ‘‘Katame ca, bhikkhave, tayo purisaparassā? Idha, bhikkhave, ekacco purisaparasso javasampanno hoti; na vaṇṇasampanno na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisaparasso javasampanno ca hoti vaṇṇasampanno ca; na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, purisaparasso javasampanno hoti; na vaṇṇasampanno, na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhiviniye pañhaṃ puṭṭho saṃsādeti, no vissajjeti. Idamassa na vaṇṇasmiṃ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Idamassa na ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisaparasso javasampanno hoti; na vaṇṇasampanno, na ārohapariṇāhasampanno. ‘‘Kathañca, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Idamassa na ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisaparasso javasampanno ca hoti; vaṇṇasampanno ca, na ārohapariṇāhasampanno. ‘‘Kathañca, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Idamassa ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo purisaparassā’’ti. Navamaṃ.",
      "english": "“Monks, I will teach you about three types of horses and three types of persons. Listen to that, pay close attention; I will speak.”\n\n“Yes, venerable sir,” those monks replied to the Blessed One. The Blessed One said this:\n\n“What are the three types of horses, monks? Here, monks, a certain type of horse is endowed with speed, but not endowed with beauty, nor endowed with good stature and build. But here, monks, a certain type of horse is endowed with speed and endowed with beauty, but not endowed with good stature and build. But here, monks, a certain type of horse is endowed with speed, and endowed with beauty, and endowed with good stature and build. These, monks, are the three types of horses.\n\n“What are the three types of persons, monks? Here, monks, a certain type of person is endowed with spiritual progress, but not endowed with the ability to expound, nor endowed with material support. But here, monks, a certain type of person is endowed with spiritual progress and endowed with the ability to expound, but not endowed with material support. But here, monks, a certain type of person is endowed with spiritual progress, and endowed with the ability to expound, and endowed with material support.\n\n“And how, monks, is a type of person endowed with spiritual progress, but not endowed with the ability to expound, nor endowed with material support? Here, monks, a monastic, through the complete destruction of the five lower fetters, arises spontaneously in the Pure Abodes, and there attains final Nibbāna, not liable to return from that world. This I say is his spiritual progress. But when questioned on a problem concerning the higher doctrine or the higher discipline, he flounders and does not resolve it. This I say is his lack of ability to expound. Furthermore, he is not one who obtains robes, almsfood, lodgings, or requisites for the sick, such as medicines. This I say is his lack of material support. Thus, monks, is a type of person endowed with spiritual progress, but not endowed with the ability to expound, nor endowed with material support.\n\n“And how, monks, is a type of person endowed with spiritual progress and endowed with the ability to expound, but not endowed with material support? Here, monks, a monastic, through the complete destruction of the five lower fetters, arises spontaneously in the Pure Abodes, and there attains final Nibbāna, not liable to return from that world. This I say is his spiritual progress. But when questioned on a problem concerning the higher doctrine or the higher discipline, he resolves it and does not flounder. This I say is his ability to expound. Furthermore, he is not one who obtains robes, almsfood, lodgings, or requisites for the sick, such as medicines. This I say is his lack of material support. Thus, monks, is a type of person endowed with spiritual progress and endowed with the ability to expound, but not endowed with material support.\n\n“And how, monks, is a type of person endowed with spiritual progress, and endowed with the ability to expound, and endowed with material support? Here, monks, a monastic, through the complete destruction of the five lower fetters, arises spontaneously in the Pure Abodes, and there attains final Nibbāna, not liable to return from that world. This I say is his spiritual progress. But when questioned on a problem concerning the higher doctrine or the higher discipline, he resolves it and does not flounder. This I say is his ability to expound. Furthermore, he is one who obtains robes, almsfood, lodgings, and requisites for the sick, such as medicines. This I say is his material support. Thus, monks, is a type of person endowed with spiritual progress, and endowed with the ability to expound, and endowed with material support. These, monks, are the three types of persons.”",
      "sinhala": "මහණෙනි, මම ඔබට අශ්වයන්ගේ තෙවර්ගයද, පුරුෂයන්ගේ තෙවර්ගයද දේශනා කරන්නෙමි. එය අසන්න, මනාව මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි”යි වදාළ සේක. “එසේය, භාග්‍යවතුන් වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“මහණෙනි, අශ්වයන්ගේ තෙවර්ගය කවරේද? මහණෙනි, මෙහි ඇතැම් අශ්වයෙක් වේගයෙන් යුක්ත වෙයි; නමුත් වර්ණයෙන් යුක්ත නොවෙයි, උස මහතින් යුක්ත නොවෙයි. මහණෙනි, තවද මෙහි ඇතැම් අශ්වයෙක් වේගයෙන් යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි; නමුත් උස මහතින් යුක්ත නොවෙයි. මහණෙනි, තවද මෙහි ඇතැම් අශ්වයෙක් වේගයෙන්ද යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි, උස මහතින්ද යුක්ත වෙයි. මහණෙනි, මේ අශ්වයන්ගේ තෙවර්ගයයි.\n\n“මහණෙනි, පුරුෂයන්ගේ තෙවර්ගය කවරේද? මහණෙනි, මෙහි ඇතැම් පුරුෂයෙක් වේගයෙන් යුක්ත වෙයි; නමුත් වර්ණයෙන් යුක්ත නොවෙයි, උස මහතින්ද යුක්ත නොවෙයි. මහණෙනි, තවද මෙහි ඇතැම් පුරුෂයෙක් වේගයෙන්ද යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි; නමුත් උස මහතින් යුක්ත නොවෙයි. මහණෙනි, තවද මෙහි ඇතැම් පුරුෂයෙක් වේගයෙන්ද යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි, උස මහතින්ද යුක්ත වෙයි.\n\n“මහණෙනි, පුරුෂයෙක් කෙසේ වේගයෙන් යුක්ත වෙයිද, වර්ණයෙන් යුක්ත නොවෙයිද, උස මහතින් යුක්ත නොවෙයිද? මහණෙනි, මෙහි භික්ෂුවක් පඤ්ච ඕරම්භාගීය සංයෝජන ප්‍රහීණ වීමෙන් ඕපපාතිකව උපත ලබා, එම බ්‍රහ්ම ලෝකයේදීම පිරිනිවන් පාන්නෙක් වෙයි, එම ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වෙයි. මම මේ තත්ත්වය ඔහුගේ වේගය ලෙස කියමි. නමුත් ඔහු අභිධර්මයෙහිද, අභිවිනයෙහිද ප්‍රශ්නයක් විමසූ කල, (ව්‍යාකූල වී) පැටලී සිටින්නේය, විසඳා නොදෙන්නේය. මම මේ තත්ත්වය ඔහුගේ වර්ණය නොමැති බව ලෙස කියමි. තවද ඔහු සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන මේවා ලබන්නෙක් නොවෙයි. මම මේ තත්ත්වය ඔහුගේ උස මහත නොමැති බව ලෙස කියමි. මහණෙනි, මෙසේ පුරුෂයෙක් වේගයෙන් යුක්ත වෙයි; නමුත් වර්ණයෙන් යුක්ත නොවෙයි, උස මහතින්ද යුක්ත නොවෙයි.\n\n“මහණෙනි, පුරුෂයෙක් කෙසේ වේගයෙන්ද යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි, නමුත් උස මහතින් යුක්ත නොවෙයිද? මහණෙනි, මෙහි භික්ෂුවක් පඤ්ච ඕරම්භාගීය සංයෝජන ප්‍රහීණ වීමෙන් ඕපපාතිකව උපත ලබා, එම බ්‍රහ්ම ලෝකයේදීම පිරිනිවන් පාන්නෙක් වෙයි, එම ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වෙයි. මම මේ තත්ත්වය ඔහුගේ වේගය ලෙස කියමි. නමුත් ඔහු අභිධර්මයෙහිද, අභිවිනයෙහිද ප්‍රශ්නයක් විමසූ කල, විසඳා දෙන්නේය, (ව්‍යාකූල වී) පැටලී නොසිටින්නේය. මම මේ තත්ත්වය ඔහුගේ වර්ණය ලෙස කියමි. තවද ඔහු සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන මේවා ලබන්නෙක් නොවෙයි. මම මේ තත්ත්වය ඔහුගේ උස මහත නොමැති බව ලෙස කියමි. මහණෙනි, මෙසේ පුරුෂයෙක් වේගයෙන්ද යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි; නමුත් උස මහතින් යුක්ත නොවෙයි.\n\n“මහණෙනි, පුරුෂයෙක් කෙසේ වේගයෙන්ද යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි, උස මහතින්ද යුක්ත වෙයිද? මහණෙනි, මෙහි භික්ෂුවක් පඤ්ච ඕරම්භාගීය සංයෝජන ප්‍රහීණ වීමෙන් ඕපපාතිකව උපත ලබා, එම බ්‍රහ්ම ලෝකයේදීම පිරිනිවන් පාන්නෙක් වෙයි, එම ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වෙයි. මම මේ තත්ත්වය ඔහුගේ වේගය ලෙස කියමි. නමුත් ඔහු අභිධර්මයෙහිද, අභිවිනයෙහිද ප්‍රශ්නයක් විමසූ කල, විසඳා දෙන්නේය, (ව්‍යාකූල වී) පැටලී නොසිටින්නේය. මම මේ තත්ත්වය ඔහුගේ වර්ණය ලෙස කියමි. තවද ඔහු සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන මේවා ලබන්නෙක් වෙයි. මම මේ තත්ත්වය ඔහුගේ උස මහත ලෙස කියමි. මහණෙනි, මෙසේ පුරුෂයෙක් වේගයෙන්ද යුක්ත වෙයි, වර්ණයෙන්ද යුක්ත වෙයි, උස මහතින්ද යුක්ත වෙයි. මහණෙනි, මේ පුරුෂයන්ගේ තෙවර්ගයයි”යි වදාළ සේක.",
      "paliTitle": "Assaparassasuttaṃ"
    },
    {
      "number": 143,
      "pali": "‘‘Tayo ca, bhikkhave, bhadre assājānīye desessāmi tayo ca bhadre purisājānīye. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katame ca, bhikkhave, tayo bhadrā assājānīyā? Idha, bhikkhave, ekacco bhadro assājānīyo … pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo bhadrā assājānīyā. ‘‘Katame ca bhikkhave, tayo bhadrā purisājānīyā? Idha, bhikkhave, ekacco bhadro purisājānīyo… pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, bhadro purisājānīyo…pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Idamassa ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, bhadro purisājānīyo javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo bhadrā purisājānīyā’’ti. Dasamaṃ.",
      "english": "Monks, I shall describe three excellent thoroughbred horses and three excellent thoroughbred persons. Listen to that, attend carefully; I shall speak.\n“Yes, venerable sir,” those monks replied to the Blessed One. The Blessed One said this:\n\n“And what, monks, are the three excellent thoroughbred horses? Here, monks, an excellent thoroughbred horse is endowed with speed, endowed with beauty, and endowed with a robust build. These, monks, are the three excellent thoroughbred horses.\n\n“And what, monks, are the three excellent thoroughbred persons? Here, monks, an excellent thoroughbred person is endowed with speed, endowed with beauty, and endowed with a robust build.\n\n“And how, monks, is an excellent thoroughbred person endowed with speed, endowed with beauty, and endowed with a robust build? Here, monks, a monk, through the destruction of the taints, realizes for himself by direct knowledge, in this very life, the taintless liberation of mind and liberation through wisdom, and having attained it, dwells therein. This, I say, is his speed. Furthermore, when asked a question concerning the Higher Teaching and the Higher Discipline, he answers it without faltering. This, I say, is his beauty. Furthermore, he is one who obtains robes, almsfood, lodgings, and medicinal requisites for the sick. This, I say, is his robust build. Thus, monks, an excellent thoroughbred person is endowed with speed, endowed with beauty, and endowed with a robust build. These, monks, are the three excellent thoroughbred persons.”",
      "sinhala": "මහණෙනි, මම ඔබට භද්‍ර වූ අශ්වාජානීයයන් තිදෙනෙකුත්, භද්‍ර වූ පුරිසාජානීයයන් තිදෙනෙකුත් දේශනා කරන්නෙමි. එය අසන්න. මනාව මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි.\n\nඑසේය, භාග්‍යවතුන් වහන්ස, යැයි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළසේක: මහණෙනි, භද්‍ර වූ අශ්වාජානීයයෝ කවරහුද? මහණෙනි, මේ ශාසනයෙහි එක්තරා භද්‍ර වූ අශ්වාජානීයයෙක් ජවයෙන් යුක්ත වෙයි, වර්ණයෙන් යුක්ත වෙයි, ආරෝහපරිණාහයෙන් යුක්ත වෙයි. මහණෙනි, මොවුහු භද්‍ර වූ අශ්වාජානීයයෝ තිදෙනා වෙති.\n\nමහණෙනි, භද්‍ර වූ පුරිසාජානීයයෝ කවරහුද? මහණෙනි, මේ ශාසනයෙහි එක්තරා භද්‍ර වූ පුරිසාජානීයයෙක් ජවයෙන් යුක්ත වෙයි, වර්ණයෙන් යුක්ත වෙයි, ආරෝහපරිණාහයෙන් යුක්ත වෙයි.\n\nමහණෙනි, භද්‍ර වූ පුරිසාජානීයයෙක් කෙසේද... ජවයෙන් යුක්ත වන්නේ, වර්ණයෙන් යුක්ත වන්නේ, ආරෝහපරිණාහයෙන් යුක්ත වන්නේ?\n\nමහණෙනි, මේ ශාසනයෙහි භික්ෂුවක් ආසවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය සහ ප්‍ර්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කරගෙන වාසය කරයි. මෙය ඔහුගේ ජවය ලෙස මම කියමි.\n\nනැවතත්, අභිධර්මය හෝ අභිවිනය පිළිබඳ ගැටලුවක් විමසනු ලැබූ විට ඔහු එය විසඳයි, පැකිලෙන්නේ නැත. මෙය ඔහුගේ වර්ණය ලෙස මම කියමි.\n\nනැවතත්, ඔහු සිවුරු, පිණ්ඩපාත, සේනාසන සහ ගිලන්පස බෙහෙත් පිරිකරයන්ගේ ලාභී වෙයි. මෙය ඔහුගේ ආරෝහපරිණාහය ලෙස මම කියමි.\n\nමහණෙනි, මෙසේ භද්‍ර වූ පුරිසාජානීයයෙක් ජවයෙන් යුක්ත වෙයි, වර්ණයෙන් යුක්ත වෙයි, ආරෝහපරිණාහයෙන් යුක්ත වෙයි. මහණෙනි, මොවුහු භද්‍ර වූ පුරිසාජානීයයෝ තිදෙනා වෙති.",
      "paliTitle": "Assājānīyasuttaṃ"
    },
    {
      "number": 144,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati moranivāpe paribbājakārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Katamehi tīhi? Asekkhena sīlakkhandhena, asekkhena samādhikkhandhena, asekkhena paññākkhandhena. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussāna’’nti. Ekādasamaṃ.",
      "english": "At one time, the Blessed One was dwelling in Rājagaha, at the Mora-nivāpa in the Wanderers' Park. There, the Blessed One addressed the bhikkhus, saying, \"Bhikkhus!\" \"Venerable Sir!\" those bhikkhus replied to the Blessed One. The Blessed One spoke thus:\n\n\"Bhikkhus, a bhikkhu endowed with three qualities becomes utterly accomplished, utterly secure from bondage, one who has utterly lived the holy life, one whose ultimate end has been reached, supreme among devas and humans. Which three? With the aggregate of unconditioned virtue, with the aggregate of unconditioned concentration, and with the aggregate of unconditioned wisdom. Indeed, bhikkhus, a bhikkhu endowed with these three qualities becomes utterly accomplished, utterly secure from bondage, one who has utterly lived the holy life, one whose ultimate end has been reached, supreme among devas and humans.\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර මොරනිවාප නම් පරිබ්‍රාජකාරාමයේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්නාහුය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, ධර්ම තුනකින් යුක්ත වූ භික්ෂුව පරම නිමාවට පත්වූවෙක්, පරම යෝගක්ෂේමයට පත්වූවෙක්, පරම බඹසර ඇතිව අවසන් කළ කෙනෙක්, පරම අවසානයට පැමිණි කෙනෙක්, දෙවිමිනිසුන් අතර ශ්‍රේෂ්ඨතමයා වේ.\n\nකවර ධර්ම තුනකින් ද? අශෛක්ෂ ශීලස්කන්ධයෙන්, අශෛක්ෂ සමාධිස්කන්ධයෙන්, අශෛක්ෂ ප්‍රඥාස්කන්ධයෙන් යන ධර්ම තුනෙනි.\n\nමහණෙනි, මේ ධර්ම තුනෙන් යුක්ත වූ භික්ෂුව පරම නිමාවට පත්වූවෙක්, පරම යෝගක්ෂේමයට පත්වූවෙක්, පරම බඹසර ඇතිව අවසන් කළ කෙනෙක්, පරම අවසානයට පැමිණි කෙනෙක්, දෙවිමිනිසුන් අතර ශ්‍රේෂ්ඨතමයා වේ\" යි.",
      "paliTitle": "Paṭhamamoranivāpasuttaṃ"
    },
    {
      "number": 145,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Katamehi tīhi? Iddhipāṭihāriyena, ādesanāpāṭihāriyena, anusāsanīpāṭihāriyena – imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussāna’’nti. Dvādasamaṃ.",
      "english": "Bhikkhus, a monk endowed with three qualities is ultimately accomplished, ultimately secure from bondage, one who has ultimately completed the holy life, and one who has reached the ultimate culmination, foremost among gods and humans.\n\nWhich three?\n\nThe miracle of psychic power, the miracle of mind-reading, and the miracle of instruction. Bhikkhus, a monk endowed with these three qualities is ultimately accomplished, ultimately secure from bondage, one who has ultimately completed the holy life, and one who has reached the ultimate culmination, foremost among gods and humans.",
      "sinhala": "මහණෙනි, ධර්‍මයන් තුනකින් සමන්විත වූ භික්ෂුව පරම අර්ථයට පැමිණියේ වෙයි; පරම යෝගක්ෂේමයට පත් වූයේ වෙයි; පරම බ්‍රහ්මචරියාව සම්පූර්ණ කළේ වෙයි; පරම අවසානයට පැමිණියේ වෙයි; දෙවි මිනිසුන් අතර ශ්‍රේෂ්ඨතමයා වෙයි. ඒ කවර ධර්‍මතා තුනකින්ද?\n\nඒ ඍද්ධිප්‍රාතිහාර්‍යයෙන්, ආදේශනාප්‍රාතිහාර්‍යයෙන්, අනුශාසනීප්‍රාතිහාර්‍යයෙන් යන ධර්‍මතා තුනෙනි. මහණෙනි, මේ ධර්‍මයන් තුනකින් සමන්විත වූ භික්ෂුව පරම අර්ථයට පැමිණියේ වෙයි; පරම යෝගක්ෂේමයට පත් වූයේ වෙයි; පරම බ්‍රහ්මචරියාව සම්පූර්ණ කළේ වෙයි; පරම අවසානයට පැමිණියේ වෙයි; දෙවි මිනිසුන් අතර ශ්‍රේෂ්ඨතමයා වෙයි.",
      "paliTitle": "Dutiyamoranivāpasuttaṃ"
    },
    {
      "number": 146,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussānaṃ. Katamehi tīhi? Sammādiṭṭhiyā, sammāñāṇena, sammāvimuttiyā – imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu accantaniṭṭho hoti accantayogakkhemī accantabrahmacārī accantapariyosāno seṭṭho devamanussāna’’nti. Terasamaṃ.",
      "english": "Monks, a bhikkhu endowed with three qualities is utterly perfected, one who has attained supreme security from bondage, one who has brought the holy life to its ultimate conclusion, and one who has reached the ultimate end, foremost among gods and humans.\n\nWhich three? By right view, by right knowledge, and by right liberation. Monks, a bhikkhu endowed with these three qualities is utterly perfected, one who has attained supreme security from bondage, one who has brought the holy life to its ultimate conclusion, and one who has reached the ultimate end, foremost among gods and humans.",
      "sinhala": "මහණෙනි, ධර්ම තුනකින් යුක්ත වූ භික්ෂුවක් පරම නිමාවට පත් වූවෙක් ද, පරම යෝගක්ෂේමයට පත් වූවෙක් ද, පරම බ්‍රහ්මචර්යාව සම්පූර්ණ කළේක් ද, අතිශය පරම අවසානයට පැමිණියේක් ද, දෙවිමිනිසුන් අතර ශ්‍රේෂ්ඨතමයා ද වේ. කවර ධර්ම තුනකින්ද? සම්මාදිට්ඨියෙන්, සම්මාඤාණයෙන්, සම්මා විමුක්තියෙන්. මහණෙනි, සැබවින්ම මේ ධර්ම තුනෙන් යුක්ත වූ භික්ෂුවක් පරම නිමාවට පත් වූවෙක් ද, පරම යෝගක්ෂේමයට පත් වූවෙක් ද, පරම බ්‍රහ්මචර්යාව සම්පූර්ණ කළේක් ද, අතිශය පරම අවසානයට පැමිණියේක් ද, දෙවිමිනිසුන් අතර ශ්‍රේෂ්ඨතමයා ද වේ.",
      "paliTitle": "Tatiyamoranivāpasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Yodhājīvavaggo cuddasamo. Tassuddānaṃ – Yodho parisamittañca, uppādā kesakambalo; Sampadā vuddhi tayo, assā tayo moranivāpinoti.",
    "english": "",
    "sinhala": ""
  }
}