{
  "id": "an3.5",
  "title": {
    "pali": "Cūḷavaggo",
    "english": "The Lesser Section",
    "sinhala": "සුළු වර්ගය"
  },
  "sections": [
    {
      "number": 41,
      "pali": "‘‘Tiṇṇaṃ, bhikkhave, sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. Katamesaṃ tiṇṇaṃ? Saddhāya, bhikkhave, sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. Deyyadhammassa, bhikkhave, sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. Dakkhiṇeyyānaṃ, bhikkhave, sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. Imesaṃ kho, bhikkhave, tiṇṇaṃ sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavatī’’ti. Paṭhamaṃ.",
      "english": "Monks, because of the presence of three conditions, a faithful householder generates much merit. Which three? Monks, because of the presence of faith, a faithful householder generates much merit. Monks, because of the presence of things suitable for giving, a faithful householder generates much merit. Monks, because of the presence of those worthy of offerings, a faithful householder generates much merit. Monks, it is indeed because of the presence of these three conditions that a faithful householder generates much merit.",
      "sinhala": "භික්‍ෂූණි, කරුණු තුනක් සමීපවීමෙන් ශ්‍රද්ධාවන්ත කුලපුත්‍රයා බොහෝ පින් රැස් කරයි.\n\nඒ කරුණු තුන කවරේද?\n\nභික්‍ෂූණි, ශ්‍රද්ධාව සමීපවීමෙන් ශ්‍රද්ධාවන්ත කුලපුත්‍රයා බොහෝ පින් රැස් කරයි.\n\nභික්‍ෂූණි, දිය යුතු දෙයක් (දෙය්‍යධර්මයක්) සමීපවීමෙන් ශ්‍රද්ධාවන්ත කුලපුත්‍රයා බොහෝ පින් රැස් කරයි.\n\nභික්‍ෂූණි, දක්‍ෂිණාර්‍හ පුද්ගලයන් (පිළිගැනීමට සුදුසු අය) සමීපවීමෙන් ශ්‍රද්ධාවන්ත කුලපුත්‍රයා බොහෝ පින් රැස් කරයි.\n\nභික්‍ෂූණි, මේ කරුණු තුන සමීපවීමෙන් ශ්‍රද්ධාවන්ත කුලපුත්‍රයා බොහෝ පින් රැස් කරයි.",
      "paliTitle": "Sammukhībhāvasuttaṃ"
    },
    {
      "number": 42,
      "pali": "‘‘Tīhi, bhikkhave, ṭhānehi saddho pasanno veditabbo. Katamehi tīhi? Sīlavantānaṃ dassanakāmo hoti, saddhammaṃ sotukāmo hoti, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato. Imehi kho, bhikkhave, tīhi ṭhānehi saddho pasanno veditabbo’’. ‘‘Dassanakāmo sīlavataṃ, saddhammaṃ sotumicchati; Vinaye maccheramalaṃ, sa ve saddhoti vuccatī’’ti. dutiyaṃ;",
      "english": "Monks, a faithful and serene person is to be known by three characteristics. Which three? He is desirous of seeing those who are virtuous, he is desirous of hearing the true Dhamma, and he dwells in a home with a mind free from the stain of stinginess, a free giver, open-handed, delighting in relinquishment, approachable for requests, delighting in the sharing of gifts. Indeed, Monks, a faithful and serene person is to be known by these three characteristics.\n\nDesirous of seeing the virtuous,\nHe desires to hear the true Dhamma;\nHe dispels the stain of stinginess,\nTruly, that one is called faithful.",
      "sinhala": "මහණෙනි, කරුණු තුනකින් ශ්‍රද්ධාවන්ත, ප්‍රසන්න පුද්ගලයා හඳුනාගත යුතුයි. ඒ කරුණු තුන කවරේද? ඔහු සීලවන්තයන් දැකීමට කැමති වෙයි; සද්ධර්මය ඇසීමට කැමති වෙයි; මසුරු මල පහකළ සිතින් ගිහි ගෙයි වාසය කරයි, නිදහස් දීමෙන් යුක්ත වෙයි, පිරිසිදු දෑත් ඇත්තෙක් වෙයි, දීමෙහි ඇලුණෙක් වෙයි, යාචකයනට සුදුසු අයෙක් වෙයි, දන් බෙදා දීමෙහි ඇලුණෙක් වෙයි. මහණෙනි, මේ කරුණු තුනෙන් ශ්‍රද්ධාවන්ත, ප්‍රසන්න පුද්ගලයා හඳුනාගත යුතුයි.\n\nසීලවන්තයන් දැකීමට කැමති වන, සද්ධර්මය ශ්‍රවණය කිරීමට කැමති වන, මසුරු මල දුරු කළ, ඔහුම ශ්‍රද්ධාවන්තයෙකැයි කියනු ලැබේ.",
      "paliTitle": "Tiṭhānasuttaṃ"
    },
    {
      "number": 43,
      "pali": "‘‘Tayo, bhikkhave, atthavase sampassamānena alameva paresaṃ dhammaṃ desetuṃ. Katame tayo? Yo dhammaṃ deseti so atthappaṭisaṃvedī ca hoti dhammappaṭisaṃvedī ca. Yo dhammaṃ suṇāti so atthappaṭisaṃvedī ca hoti dhammappaṭisaṃvedī ca. Yo ceva dhammaṃ deseti yo ca dhammaṃ suṇāti ubho atthappaṭisaṃvedino ca honti dhammappaṭisaṃvedino ca. Ime kho, bhikkhave, tayo atthavase sampassamānena alameva paresaṃ dhammaṃ desetu’’nti. Tatiyaṃ.",
      "english": "Monks, for one who thoroughly perceives these three beneficial grounds, it is proper to teach the Dhamma to others. What are these three? He who teaches the Dhamma becomes one who realizes its purpose and realizes the Dhamma. He who listens to the Dhamma becomes one who realizes its purpose and realizes the Dhamma. Both he who teaches the Dhamma and he who listens to the Dhamma become ones who realize its purpose and realize the Dhamma. Monks, it is indeed proper to teach the Dhamma to others for one who thoroughly perceives these three beneficial grounds.",
      "sinhala": "භික්ෂූනි, අර්ථාවහ කරුණු තුනක් මනාව සලකන කෙනෙකුට අනුන්ට ධර්මය දේශනා කිරීම ප්‍රමාණවත්ය. ඒ කරුණු තුන කවරේද?\n\nයමෙක් ධර්මය දේශනා කරන්නේද, ඔහු අර්ථය අවබෝධ කරගත්තෙක්ද, ධර්මය අවබෝධ කරගත්තෙක්ද වේ.\n\nයමෙක් ධර්මය අසන්නේද, ඔහු අර්ථය අවබෝධ කරගත්තෙක්ද, ධර්මය අවබෝධ කරගත්තෙක්ද වේ.\n\nයමෙක් ධර්මය දේශනා කරන්නේද, යමෙක් ධර්මය අසන්නේද, ඒ දෙදෙනාම අර්ථය අවබෝධ කරගත්තෝද, ධර්මය අවබෝධ කරගත්තෝද වෙත්.\n\nභික්ෂූනි, මේ අර්ථාවහ කරුණු තුන මනාව සලකන කෙනෙකුට අනුන්ට ධර්මය දේශනා කිරීම ප්‍රමාණවත්ය.",
      "paliTitle": "Atthavasasuttaṃ"
    },
    {
      "number": 44,
      "pali": "‘‘Tīhi, bhikkhave, ṭhānehi kathā pavattinī hoti. Katamehi tīhi? Yo dhammaṃ deseti so atthappaṭisaṃvedī ca hoti dhammappaṭisaṃvedī ca. Yo dhammaṃ suṇāti so atthappaṭisaṃvedī ca hoti dhammappaṭisaṃvedī ca. Yo ceva dhammaṃ deseti yo ca dhammaṃ suṇāti ubho atthappaṭisaṃvedino ca honti dhammappaṭisaṃvedino ca. Imehi kho, bhikkhave, tīhi ṭhānehi kathā pavattinī hotī’’ti. Catutthaṃ.",
      "english": "Monks, a discourse proceeds effectively by three conditions. Which three?\nWhoever teaches the Dhamma discerns the meaning and discerns the Dhamma. Whoever listens to the Dhamma discerns the meaning and discerns the Dhamma. Both whoever teaches the Dhamma and whoever listens to the Dhamma discern the meaning and discern the Dhamma.\nIndeed, monks, by these three conditions a discourse proceeds effectively.",
      "sinhala": "මහණෙනි, කථාවක් පැවැත්වෙන්නේ කරුණු තුනකින්. ඒ කරුණු තුන කවරේද?\n\nයමෙක් ධර්මය දේශනා කරන්නේද, ඔහු අර්ථ ප‍්‍ර‍්‍රතිසංවේදී වූද, ධර්මය ප‍්‍ර‍්‍රතිසංවේදී වූද අයෙක් වේ. යමෙක් ධර්මය ශ්‍ර‍්‍රවණය කරන්නේද, ඔහු අර්ථ ප‍්‍ර‍්‍රතිසංවේදී වූද, ධර්මය ප‍්‍ර‍්‍රතිසංවේදී වූද අයෙක් වේ. යමෙක් ධර්මය දේශනා කරන්නේද, යමෙක් ධර්මය ශ්‍ර‍්‍රවණය කරන්නේද, ඒ දෙදෙනාම අර්ථ ප‍්‍ර‍්‍රතිසංවේදී වූද, ධර්මය ප‍්‍ර‍්‍රතිසංවේදී වූද අය වෙති. මහණෙනි, කථාවක් පැවැත්වෙන්නේ මේ කරුණු තුනෙන්ම යයි වදාළ සේක.",
      "paliTitle": "Kathāpavattisuttaṃ"
    },
    {
      "number": 45,
      "pali": "‘‘Tīṇimāni, bhikkhave, paṇḍitapaññattāni sappurisapaññattāni. Katamāni tīṇi? Dānaṃ, bhikkhave, paṇḍitapaññattaṃ sappurisapaññattaṃ. Pabbajjā, bhikkhave, paṇḍitapaññattā sappurisapaññattā. Mātāpitūnaṃ, bhikkhave, upaṭṭhānaṃ paṇḍitapaññattaṃ sappurisapaññattaṃ. Imāni kho, bhikkhave, tīṇi paṇḍitapaññattāni sappurisapaññattānī’’ti. ‘‘Sabbhi dānaṃ upaññattaṃ, ahiṃsā saṃyamo damo; Mātāpitu upaṭṭhānaṃ, santānaṃ brahmacārinaṃ. ‘‘Sataṃ etāni ṭhānāni, yāni sevetha paṇḍito; Ariyo dassanasampanno, sa lokaṃ bhajate siva’’nti. pañcamaṃ;",
      "english": "Monks, these three are enjoined by the sagacious and the virtuous. Which three? Monks, generosity is enjoined by the sagacious and the virtuous. Monks, going forth into homelessness is enjoined by the sagacious and the virtuous. Monks, supporting one’s mother and father is enjoined by the sagacious and the virtuous. Indeed, monks, these are the three that are enjoined by the sagacious and the virtuous.\n\nGiving is enjoined by the good, as are non-violence, restraint, and self-control, and the supporting of one's mother and father – these are the practices of the peaceful ones who lead the holy life. These are the grounds for the good, which a wise person should cultivate. A noble one, perfected in vision, finds security and well-being in the world.",
      "sinhala": "‘‘මහණෙනි, මේ කරුණු තුන පණ්ඩිතයන් විසින් පනවන ලද්දේය, සත්පුරුෂයන් විසින් පනවන ලද්දේය. කවරේද ඒ කරුණු තුන? මහණෙනි, දානය පණ්ඩිතයන් විසින් පනවන ලද්දේය, සත්පුරුෂයන් විසින් පනවන ලද්දේය. මහණෙනි, පැවිද්ද පණ්ඩිතයන් විසින් පනවන ලද්දේය, සත්පුරුෂයන් විසින් පනවන ලද්දේය. මහණෙනි, මවුපියන්ට උපස්ථාන කිරීම පණ්ඩිතයන් විසින් පනවන ලද්දේය, සත්පුරුෂයන් විසින් පනවන ලද්දේය. මහණෙනි, ඇත්තෙන්ම මේ කරුණු තුන පණ්ඩිතයන් විසින් පනවන ලද්දේය, සත්පුරුෂයන් විසින් පනවන ලද්දේය.’’\n\nසත්පුරුෂයන් විසින් දානය, අහිංසාව, සංයමය, දමනය පනවන ලදී. මවුපියන්ට උපස්ථාන කිරීමද, ශාන්ත වූ, බ්‍රහ්මචාරීව වාසය කරන සත්පුරුෂයන්ට අදාළ ධර්මයෝ වෙත්. මේ කරුණු සත්පුරුෂයන්ගේ මාර්ගයෝය. පණ්ඩිතයා ඒවා සේවනය කළ යුතුය. ආර්ය වූ, දර්ශන සම්පන්න වූ තැනැත්තා ශිව වූ ලෝකයක් ලබයි.",
      "paliTitle": "Paṇḍitasuttaṃ"
    },
    {
      "number": 46,
      "pali": "‘‘Yaṃ, bhikkhave, sīlavanto pabbajitā gāmaṃ vā nigamaṃ vā upanissāya viharanti. Tattha manussā tīhi ṭhānehi bahuṃ puññaṃ pasavanti. Katamehi tīhi? Kāyena, vācāya, manasā. Yaṃ, bhikkhave, sīlavanto pabbajitā gāmaṃ vā nigamaṃ vā upanissāya viharanti. Tattha manussā imehi tīhi ṭhānehi bahuṃ puññaṃ pasavantī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, when virtuous renunciants dwell relying on a village or a town, the people there generate abundant merit in three ways. Which three? Through bodily action, through verbal action, and through mental action. Monks, when virtuous renunciants dwell relying on a village or a town, the people there generate abundant merit in these three ways.",
      "sinhala": "භික්‍ෂූණි, යම් කලෙක සිල්වත් පැවිද්දෝ ගම් හෝ නියම්ගම් ඇසුරු කරගෙන වාසය කරත් ද, එහි මනුෂ්‍යයෝ කරුණු තුනකින් බොහෝ පිනක් උපදවා ගනිති. කවර කරුණු තුනකින් ද? කයෙන්, වචනයෙන්, සිතෙන්. භික්‍ෂූණි, යම් කලෙක සිල්වත් පැවිද්දෝ ගම් හෝ නියම්ගම් ඇසුරු කරගෙන වාසය කරත් ද, එහි මනුෂ්‍යයෝ මේ කරුණු තුනකින් බොහෝ පිනක් උපදවා ගනිති.",
      "paliTitle": "Sīlavantasuttaṃ"
    },
    {
      "number": 47,
      "pali": "‘‘Tīṇimāni, bhikkhave, saṅkhatassa saṅkhatalakkhaṇāni. Katamāni tīṇi? Uppādo paññāyati, vayo paññāyati, ṭhitassa aññathattaṃ paññāyati. Imāni kho, bhikkhave, tīṇi saṅkhatassa saṅkhatalakkhaṇānī’’ti. Sattamaṃ.",
      "english": "Monks, these are the three characteristics of the conditioned. Which three? Its arising is discerned, its vanishing is discerned, and the alteration of its existing state is discerned. These, monks, are indeed the three characteristics of the conditioned.",
      "sinhala": "මහණෙනි, සංඛත ධර්මයන්ගේ සංඛත ලක්ෂණ මේ තුනයි. ඒ තුන කවරේද? උපත ප‍්‍රකට වේ, වයවීම ප‍්‍රකට වේ, ස්ථිත වූ දෙයෙහි අන්‍යත්ථත්වය ප‍්‍රකට වේ. මහණෙනි, සංඛත ධර්මයන්ගේ මේ සංඛත ලක්ෂණ තුන මේවාම යි.",
      "paliTitle": "Saṅkhatalakkhaṇasuttaṃ"
    },
    {
      "number": 48,
      "pali": "‘‘Tīṇimāni, bhikkhave, asaṅkhatassa asaṅkhatalakkhaṇāni. Katamāni tīṇi? Na uppādo paññāyati, na vayo paññāyati, na ṭhitassa aññathattaṃ paññāyati. Imāni kho, bhikkhave, tīṇi asaṅkhatassa asaṅkhatalakkhaṇānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these are the three characteristics of the unconditioned. Which three? No arising is perceived, no passing away is perceived, and no alteration of what has endured is perceived. Indeed, Monks, these are the three characteristics of the unconditioned.",
      "sinhala": "මහණෙනි, අසංඛත ධර්‍මයේ මේ ලක්ෂණ තුනක් ඇත. ඒ තුන කුමක්ද? උපතක් දක්නට නොලැබේ, වැනසීමක් දක්නට නොලැබේ, ස්ථිත වූ දෙයෙහි වෙනස්වීමක් දක්නට නොලැබේ. මහණෙනි, අසංඛත ධර්‍මයේ මේ ලක්ෂණ තුන මේවා ය.",
      "paliTitle": "Asaṅkhatalakkhaṇasuttaṃ"
    },
    {
      "number": 49,
      "pali": "‘‘Himavantaṃ, bhikkhave, pabbatarājaṃ nissāya mahāsālā tīhi vaḍḍhīhi vaḍḍhanti. Katamāhi tīhi? Sākhāpattapalāsena vaḍḍhanti, tacapapaṭikāya vaḍḍhanti, pheggusārena vaḍḍhanti. Himavantaṃ, bhikkhave, pabbatarājaṃ nissāya mahāsālā imāhi tīhi vaḍḍhīhi vaḍḍhanti. ‘‘Evamevaṃ kho, bhikkhave, saddhaṃ kulapatiṃ nissāya anto jano tīhi vaḍḍhīhi vaḍḍhati. Katamāhi tīhi? Saddhāya vaḍḍhati, sīlena vaḍḍhati, paññāya vaḍḍhati. Saddhaṃ, bhikkhave, kulapatiṃ nissāya anto jano imāhi tīhi vaḍḍhīhi vaḍḍhatī’’ti. ‘‘Yathāpi pabbato selo, araññasmiṃ brahāvane; Taṃ rukkhā upanissāya, vaḍḍhante te vanappatī. ‘‘Tatheva sīlasampannaṃ, saddhaṃ kulapatiṃ idha; Upanissāya vaḍḍhanti, puttadārā ca bandhavā; Amaccā ñātisaṅghā ca, ye cassa anujīvino. ‘‘Tyāssa sīlavato sīlaṃ, cāgaṃ sucaritāni ca; Passamānānukubbanti, attamatthaṃ [ye bhavanti (sī. syā. kaṃ. pī.)] vicakkhaṇā. ‘‘Idha dhammaṃ caritvāna, maggaṃ sugatigāminaṃ; Nandino devalokasmiṃ, modanti kāmakāmino’’ti. navamaṃ;",
      "english": "Monks, the great sal trees, relying on the Himavanta, the king of mountains, grow with three kinds of growth. Which three? They grow with branches, leaves, and foliage; they grow with bark and outer layers; and they grow with heartwood. Monks, the great sal trees, relying on the Himavanta, the king of mountains, grow with these three kinds of growth.\n\nJust so, monks, relying on a faithful householder, the people within his household grow with three kinds of growth. Which three? They grow in faith, they grow in moral virtue, and they grow in wisdom. Monks, relying on a faithful householder, the people within his household grow with these three kinds of growth.\n\nJust as a rocky mountain in a great wilderness, relied upon by trees, makes those forest plants grow.\n\nJust so, here, children, spouses, and relatives, as well as ministers, kinsfolk, and those who depend on him, grow and develop by relying on a householder who is endowed with moral virtue and faith.\n\nThose discerning ones, seeing the moral virtue, generosity, and good conduct of that virtuous person, emulate them and thereby bring about their own welfare.\n\nHaving practiced the Dhamma in this world—the path leading to a good destination—they rejoice and delight in the divine world, having found the fulfillment of their aspirations.",
      "sinhala": "මහණෙනි, හිමාලය පර්වත රාජයා නිසා මහාසාල වෘක්ෂයෝ තුන් ආකාරයකින් වැඩෙත්. ඒ තුන කවරේද? අතු, පත්‍ර සහ රිකිලි වලින් වැඩෙත්, පොත්තෙන් සහ පොතුපට්ටයෙන් වැඩෙත්, අරටුවෙන් වැඩෙත්. මහණෙනි, හිමාලය පර්වත රාජයා නිසා මහාසාල වෘක්ෂයෝ මේ තුන් ආකාරයකින් වැඩෙත්.\n\nමහණෙනි, එලෙසින්ම ශ්‍රද්ධාවන්ත ගෘහපතියකු නිසා ඔහුගේ අන්තඃපුර ජනයා තුන් ආකාරයකින් දියුණුවට පත්වෙත්. ඒ තුන කවරේද? ශ්‍රද්ධාවෙන් වැඩෙත්, සීලයෙන් වැඩෙත්, ප්‍රඥාවෙන් වැඩෙත්. මහණෙනි, ශ්‍රද්ධාවන්ත ගෘහපතියකු නිසා ඔහුගේ අන්තඃපුර ජනයා මේ තුන් ආකාරයකින් දියුණුවට පත්වෙත්.\n\nයම්සේ මහා වනයක පිහිටි ශෛලමය පර්වතයක් වේද, එය ඇසුරු කරගෙන වෘක්ෂයෝ, වනස්පතියෝ වැඩෙත්.\n\nඑලෙසින්ම මෙලොවෙහි සීලයෙන් සම්පූර්ණ වූ, ශ්‍රද්ධාවන්ත ගෘහපතියකු ඇසුරු කරගෙන පුත්‍රයෝද, භාර්යාවෝද, ඥාතිවරුද, අමාත්‍යයෝද, ඥාති සමූහයෝද, යම් කිසි ඔහුගේ යැපෙන්නෝද, යන මොවුහු දියුණුවට පත්වෙත්.\n\nඒ විචක්ෂණ අය ඔහුගේ සීලවන්තභාවයද, ත්‍යාගශීලී බවද, යහපත් හැසිරීම්ද දැක අනුගමනය කරමින් තමන්ගේ යහපත සලසා ගනිත්.\n\nමෙලොව ධර්මයෙහි හැසිරී, සුගතියට යන මාර්ගය පුරා, කාමභෝගීව දෙව්ලොවෙහි සතුටින් වාසය කරත්.",
      "paliTitle": "Pabbatarājasuttaṃ"
    },
    {
      "number": 50,
      "pali": "‘‘Tīhi, bhikkhave, ṭhānehi ātappaṃ karaṇīyaṃ. Katamehi tīhi? Anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya ātappaṃ karaṇīyaṃ, anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya ātappaṃ karaṇīyaṃ, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsanāya ātappaṃ karaṇīyaṃ. Imehi tīhi, bhikkhave, ṭhānehi ātappaṃ karaṇīyaṃ. ‘‘Yato kho, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya ātappaṃ karoti, anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya ātappaṃ karoti, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsanāya ātappaṃ karoti. Ayaṃ vuccati, bhikkhave, bhikkhu ātāpī nipako sato sammā dukkhassa antakiriyāyā’’ti. Dasamaṃ.",
      "english": "Monks, ardent exertion should be undertaken in three ways. Which three? Ardent exertion should be undertaken for the non-arising of unarisen evil, unwholesome states; ardent exertion should be undertaken for the arising of unarisen wholesome states; ardent exertion should be undertaken for the patient endurance of arisen bodily feelings that are painful, intense, acute, grievous, unpleasant, undesirable, and life-threatening. Monks, ardent exertion should be undertaken in these three ways.\n\nWhen, monks, a monk undertakes ardent exertion for the non-arising of unarisen evil, unwholesome states, undertakes ardent exertion for the arising of unarisen wholesome states, and undertakes ardent exertion for the patient endurance of arisen bodily feelings that are painful, intense, acute, grievous, unpleasant, undesirable, and life-threatening, then, monks, that monk is called ardent, discerning, and mindful, for the proper ending of suffering.",
      "sinhala": "භික්ෂූණි, කරුණු තුනකින් දැඩි වෑයමක් කළ යුත්තේය. ඒ කරුණු තුන කවරේද? නූපන් පව් අකුසල ධර්මයන් නූපදීම පිණිස දැඩි වෑයමක් කළ යුත්තේය. නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස දැඩි වෑයමක් කළ යුත්තේය. ඉපදී ඇති ශාරීරික වූ, තීව්‍ර වූ, රළු වූ, කටුක වූ, අප්‍රිය වූ, අමනාප වූ, ප්‍රාණය නසන්නාක් බඳු වූ දුක් වේදනා ඉවසීම පිණිස දැඩි වෑයමක් කළ යුත්තේය. භික්ෂූණි, මේ කරුණු තුනකින් දැඩි වෑයමක් කළ යුත්තේය.\n\nභික්ෂූණි, යම් හෙයකින් භික්ෂුවක් නූපන් පව් අකුසල ධර්මයන් නූපදීම පිණිස දැඩි වෑයමක් කෙරේද, නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස දැඩි වෑයමක් කෙරේද, ඉපදී ඇති ශාරීරික වූ, තීව්‍ර වූ, රළු වූ, කටුක වූ, අප්‍රිය වූ, අමනාප වූ, ප්‍රාණය නසන්නාක් බඳු වූ දුක් වේදනා ඉවසීම පිණිස දැඩි වෑයමක් කෙරේද, භික්ෂූණි, මේ භික්ෂුව දැඩි වෑයම් ඇති, සියුම් නුවණ ඇති, සිහි කල්පනා ඇති, මනා කොට දුක කෙළවර කිරීම පිණිස යැයි කියනු ලැබේ.",
      "paliTitle": "Ātappakaraṇīyasuttaṃ"
    },
    {
      "number": 51,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato mahācoro sandhimpi chindati, nillopampi harati, ekāgārikampi karoti, paripanthepi tiṭṭhati. Katamehi tīhi? Idha, bhikkhave, mahācoro visamanissito ca hoti, gahananissito ca hoti, balavanissito ca hoti. Kathañca, bhikkhave, mahācoro visamanissito hoti? Idha, bhikkhave, mahācoro nadīviduggaṃ vā nissito hoti pabbatavisamaṃ vā. Evaṃ kho, bhikkhave, mahācoro visamanissito hoti. ‘‘Kathañca, bhikkhave, mahācoro gahananissito hoti? Idha, bhikkhave, mahācoro tiṇagahanaṃ vā nissito hoti, rukkhagahanaṃ vā rodhaṃ [gedhaṃ (sī. pī.)] vā mahāvanasaṇḍaṃ vā. Evaṃ kho, bhikkhave, mahācoro gahananissito hoti. ‘‘Kathañca, bhikkhave, mahācoro balavanissito hoti? Idha, bhikkhave, mahācoro rājānaṃ vā rājamahāmattānaṃ vā nissito hoti. Tassa evaṃ hoti – ‘sace maṃ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇissantī’ti. Sace naṃ koci kiñci āha, tyāssa rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇanti. Evaṃ kho, bhikkhave, mahācoro balavanissito hoti. Ime kho, bhikkhave, tīhi aṅgehi samannāgato mahācoro sandhimpi chindati, nillopampi harati, ekāgārikampi karoti, paripanthepi tiṭṭhati. ‘‘Evamevaṃ kho, bhikkhave, tīhi aṅgehi samannāgato pāpabhikkhu khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi tīhi? Idha, bhikkhave, pāpabhikkhu visamanissito ca hoti gahananissito ca balavanissito ca. ‘‘Kathañca, bhikkhave, pāpabhikkhu visamanissito hoti? Idha, bhikkhave, pāpabhikkhu visamena kāyakammena samannāgato hoti, visamena vacīkammena samannāgato hoti, visamena manokammena samannāgato hoti. Evaṃ kho, bhikkhave, pāpabhikkhu visamanissito hoti. ‘‘Kathañca, bhikkhave, pāpabhikkhu gahananissito hoti? Idha, bhikkhave, pāpabhikkhu micchādiṭṭhiko hoti, antaggāhikāya diṭṭhiyā samannāgato hoti. Evaṃ kho, bhikkhave, pāpabhikkhu gahananissito hoti. ‘‘Kathañca, bhikkhave, pāpabhikkhu balavanissito hoti? Idha, bhikkhave, pāpabhikkhu rājānaṃ vā rājamahāmattānaṃ vā nissito hoti. Tassa evaṃ hoti – ‘sace maṃ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇissantī’ti. Sace naṃ koci kiñci āha, tyāssa rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇanti. Evaṃ kho, bhikkhave, pāpabhikkhu balavanissito hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato pāpabhikkhu khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavatī’’ti. Ekādasamaṃ. ",
      "english": "Monks, a great thief endowed with three factors breaks into houses, plunders loot, commits single-house robberies, and stands ready on the highway. Which three? Here, monks, a great thief relies on difficult terrain, relies on dense cover, and relies on powerful support.\n\nAnd how, monks, does a great thief rely on difficult terrain? Here, monks, a great thief relies on impassable rivers or on rugged mountains. That is how, monks, a great thief relies on difficult terrain.\n\nAnd how, monks, does a great thief rely on dense cover? Here, monks, a great thief relies on thickets of grass, or thickets of trees, or dense undergrowth, or a vast forest. That is how, monks, a great thief relies on dense cover.\n\nAnd how, monks, does a great thief rely on powerful support? Here, monks, a great thief relies on kings or royal ministers. He thinks: ‘If anyone were to say anything against me, these kings or royal ministers of mine would clear my name and speak in my favor.’ And if anyone does say anything against him, those kings or royal ministers clear his name and speak in his favor. That is how, monks, a great thief relies on powerful support. Indeed, monks, a great thief endowed with these three factors breaks into houses, plunders loot, commits single-house robberies, and stands ready on the highway.\n\nIn the same way, monks, an evil monk endowed with three factors brings himself to ruin and destruction, is blameworthy and reproachable by the discerning, and generates much demerit. Which three? Here, monks, an evil monk relies on unrighteousness, relies on entrenched views, and relies on powerful support.\n\nAnd how, monks, does an evil monk rely on unrighteousness? Here, monks, an evil monk is endowed with unrighteous bodily action, unrighteous verbal action, and unrighteous mental action. That is how, monks, an evil monk relies on unrighteousness.\n\nAnd how, monks, does an evil monk rely on entrenched views? Here, monks, an evil monk holds wrong views, and is endowed with views that cling to extremes. That is how, monks, an evil monk relies on entrenched views.\n\nAnd how, monks, does an evil monk rely on powerful support? Here, monks, an evil monk relies on kings or royal ministers. He thinks: ‘If anyone were to say anything against me, these kings or royal ministers of mine would clear my name and speak in my favor.’ And if anyone does say anything against him, those kings or royal ministers clear his name and speak in his favor. That is how, monks, an evil monk relies on powerful support. Indeed, monks, an evil monk endowed with these three factors brings himself to ruin and destruction, is blameworthy and reproachable by the discerning, and generates much demerit.",
      "sinhala": "මහණෙනි, අංග තුනකින් යුක්ත වූ මහා හොරෙක් බිත්ති සිදුරු කරයි, අනුන්ගේ දේපළ පැහැර ගනී, ගෙවල් කඩා කොල්ලකයි, මංපහරයි. කවර අංග තුනකින් ද? මහණෙනි, මෙහිලා මහා හොරා දුර්ගම ස්ථාන ඇසුරු කරයි, ඝනකම් ස්ථාන ඇසුරු කරයි, බලවතුන් ඇසුරු කරයි. මහණෙනි, මහා හොරෙක් කෙසේ නම් දුර්ගම ස්ථාන ඇසුරු කරයි ද? මහණෙනි, මෙහිලා මහා හොරා ගංගා දුර්ගම ප්‍රදේශ හෝ පර්වත දුර්ගම ප්‍රදේශ හෝ ඇසුරු කරගෙන සිටී. මහණෙනි, මෙලෙසින් මහා හොරා දුර්ගම ස්ථාන ඇසුරු කරයි. මහණෙනි, මහා හොරෙක් කෙසේ නම් ඝනකම් ස්ථාන ඇසුරු කරයි ද? මහණෙනි, මෙහිලා මහා හොරා ඝන වූ තණබිම් හෝ ඝන වූ රුක් ගහන හෝ පඳුරු හෝ මහ වනාන්තර හෝ ඇසුරු කරගෙන සිටී. මහණෙනි, මෙලෙසින් මහා හොරා ඝනකම් ස්ථාන ඇසුරු කරයි. මහණෙනි, මහා හොරෙක් කෙසේ නම් බලවතුන් ඇසුරු කරයි ද? මහණෙනි, මෙහිලා මහා හොරා රජුන් හෝ රජුගේ අමාත්‍යවරුන් හෝ ඇසුරු කරගෙන සිටී. ඔහුට මෙසේ සිතේ: ‘යම් කිසිවෙක් මට යමක් කියන්නේ නම්, මේ රජවරු හෝ රජුගේ අමාත්‍යවරු හෝ මට පක්ෂව කතා කරනු ඇත’ කියා. යම් කිසිවෙක් ඔහුට යමක් පැවසූවිට, ඒ රජවරු හෝ රජුගේ අමාත්‍යවරු හෝ ඔහුට පක්ෂව කතා කරති. මහණෙනි, මෙලෙසින් මහා හොරා බලවතුන් ඇසුරු කරයි. මහණෙනි, මේ අංග තුනකින් යුක්ත වූ මහා හොරා බිත්ති සිදුරු කරයි, අනුන්ගේ දේපළ පැහැර ගනී, ගෙවල් කඩා කොල්ලකයි, මංපහරයි.\n\nමහණෙනි, එලෙසින්ම අංග තුනකින් යුක්ත වූ පව්කාර භික්ෂුව තමාට හානි කරගනී, තමා විනාශයට පත් කරගනී, ප්‍රඥාවන්තයන් විසින් නින්දා කරනු ලබයි, දෝෂාරෝපණය කරනු ලබයි, බොහෝ අකුසල් රැස්කර ගනී. කවර අංග තුනකින් ද? මහණෙනි, මෙහිලා පව්කාර භික්ෂුව වැරදි ක්‍රියාවන්හි පිහිටා සිටී, මිථ්‍යාදෘෂ්ටීන්හි පිහිටා සිටී, බලවතුන් ඇසුරු කරයි.\n\nමහණෙනි, පව්කාර භික්ෂුවක් කෙසේ නම් වැරදි ක්‍රියාවන්හි පිහිටා සිටී ද? මහණෙනි, මෙහිලා පව්කාර භික්ෂුව අයහපත් කායික ක්‍රියාවන්ගෙන් යුක්ත වෙයි, අයහපත් වාචසික ක්‍රියාවන්ගෙන් යුක්ත වෙයි, අයහපත් මානසික ක්‍රියාවන්ගෙන් යුක්ත වෙයි. මහණෙනි, මෙලෙසින් පව්කාර භික්ෂුව වැරදි ක්‍රියාවන්හි පිහිටා සිටී.\n\nමහණෙනි, පව්කාර භික්ෂුවක් කෙසේ නම් මිථ්‍යාදෘෂ්ටීන්හි පිහිටා සිටී ද? මහණෙනි, මෙහිලා පව්කාර භික්ෂුව මිථ්‍යාදෘෂ්ටික වෙයි, අන්තග්‍රාහික දෘෂ්ටියෙන් යුක්ත වෙයි. මහණෙනි, මෙලෙසින් පව්කාර භික්ෂුව මිථ්‍යාදෘෂ්ටීන්හි පිහිටා සිටී.\n\nමහණෙනි, පව්කාර භික්ෂුවක් කෙසේ නම් බලවතුන් ඇසුරු කරයි ද? මහණෙනි, මෙහිලා පව්කාර භික්ෂුව රජුන් හෝ රජුගේ අමාත්‍යවරුන් හෝ ඇසුරු කරගෙන සිටී. ඔහුට මෙසේ සිතේ: ‘යම් කිසිවෙක් මට යමක් කියන්නේ නම්, මේ රජවරු හෝ රජුගේ අමාත්‍යවරු හෝ මට පක්ෂව කතා කරනු ඇත’ කියා. යම් කිසිවෙක් ඔහුට යමක් පැවසූවිට, ඒ රජවරු හෝ රජුගේ අමාත්‍යවරු හෝ ඔහුට පක්ෂව කතා කරති. මහණෙනි, මෙලෙසින් පව්කාර භික්ෂුව බලවතුන් ඇසුරු කරයි. මහණෙනි, මේ ධර්ම තුනකින් යුක්ත වූ පව්කාර භික්ෂුව තමාට හානි කරගනී, තමා විනාශයට පත් කරගනී, ප්‍රඥාවන්තයන් විසින් නින්දා කරනු ලබයි, දෝෂාරෝපණය කරනු ලබයි, බොහෝ අකුසල් රැස්කර ගනී.",
      "paliTitle": "Mahācorasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Cūḷavaggo pañcamo. Tassuddānaṃ – Sammukhī ṭhānatthavasaṃ, pavatti paṇḍita sīlavaṃ; Saṅkhataṃ pabbatātappaṃ, mahācorenekādasāti [mahācorena te dasāti (ka.)]. Paṭhamo paṇṇāsako samatto.",
    "english": "",
    "sinhala": ""
  }
}