{
  "id": "an3.2",
  "title": {
    "pali": "Rathakāravaggo",
    "english": "The Chapter on the Chariot-Maker",
    "sinhala": "රථකාර වග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato ñāto bhikkhu bahujanaahitāya paṭipanno hoti bahujanadukkhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Katamehi tīhi? Ananulomike kāyakamme samādapeti, ananulomike vacīkamme samādapeti, ananulomikesu dhammesu samādapeti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato ñāto bhikkhu bahujanaahitāya paṭipanno hoti bahujanadukkhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. ‘‘Tīhi, bhikkhave, dhammehi samannāgato ñāto bhikkhu bahujanahitāya paṭipanno hoti bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Katamehi tīhi? Anulomike kāyakamme samādapeti, anulomike vacīkamme samādapeti, anulomikesu dhammesu samādapeti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato ñāto bhikkhu bahujanahitāya paṭipanno hoti bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussāna’’nti. Paṭhamaṃ.",
      "english": "Monks, a known monk endowed with three qualities practices for the harm of many people, for the suffering of many people, for the detriment, harm, and suffering of many people, gods, and humans. Which three? He establishes others in unharmonious bodily actions, he establishes others in unharmonious verbal actions, and he establishes others in unharmonious principles of conduct. Monks, it is with these three qualities that a known monk practices for the harm of many people, for the suffering of many people, for the detriment, harm, and suffering of many people, gods, and humans.\n\nMonks, a known monk endowed with three qualities practices for the welfare of many people, for the happiness of many people, for the benefit, welfare, and happiness of many people, gods, and humans. Which three? He establishes others in harmonious bodily actions, he establishes others in harmonious verbal actions, and he establishes others in harmonious principles of conduct. Monks, it is with these three qualities that a known monk practices for the welfare of many people, for the happiness of many people, for the benefit, welfare, and happiness of many people, gods, and humans.",
      "sinhala": "භික්ෂූනි, කරුණු තුනකින් යුක්ත වූ ප්‍රකට වූ භික්ෂුවක් බොහෝ දෙනාගේ අහිත පිණිසත්, බොහෝ දෙනාගේ දුක පිණිසත් පිළිපදින්නෙක් වේ. බොහෝ දෙවි මිනිසුන්ගේ අනර්ථය පිණිසත්, අහිත පිණිසත්, දුක පිණිසත් (ඔහු) පිළිපදින්නෙක් වේ. ඒ කරුණු තුන කවරේද? අනුකූල නොවන කය ක‍්‍රියාවන්ට අන්‍යයන් යොමු කරවයි. අනුකූල නොවන වචී ක‍්‍රියාවන්ට අන්‍යයන් යොමු කරවයි. අනුකූල නොවන ධර්මයන්ට අන්‍යයන් යොමු කරවයි. භික්ෂූනි, මේ කරුණු තුනකින් යුක්ත වූ ප්‍රකට වූ භික්ෂුවක් බොහෝ දෙනාගේ අහිත පිණිසත්, බොහෝ දෙනාගේ දුක පිණිසත් පිළිපදින්නෙක් වේ. බොහෝ දෙවි මිනිසුන්ගේ අනර්ථය පිණිසත්, අහිත පිණිසත්, දුක පිණිසත් (ඔහු) පිළිපදින්නෙක් වේ.\n\nභික්ෂූනි, කරුණු තුනකින් යුක්ත වූ ප්‍රකට වූ භික්ෂුවක් බොහෝ දෙනාගේ හිත පිණිසත්, බොහෝ දෙනාගේ සැපය පිණිසත් පිළිපදින්නෙක් වේ. බොහෝ දෙවි මිනිසුන්ගේ අර්ථය පිණිසත්, හිත පිණිසත්, සැපය පිණිසත් (ඔහු) පිළිපදින්නෙක් වේ. ඒ කරුණු තුන කවරේද? අනුකූල කය ක‍්‍රියාවන්ට අන්‍යයන් යොමු කරවයි. අනුකූල වචී ක‍්‍රියාවන්ට අන්‍යයන් යොමු කරවයි. අනුකූල ධර්මයන්ට අන්‍යයන් යොමු කරවයි. භික්ෂූනි, මේ කරුණු තුනකින් යුක්ත වූ ප්‍රකට වූ භික්ෂුවක් බොහෝ දෙනාගේ හිත පිණිසත්, බොහෝ දෙනාගේ සැපය පිණිසත් පිළිපදින්නෙක් වේ. බොහෝ දෙවි මිනිසුන්ගේ අර්ථය පිණිසත්, හිත පිණිසත්, සැපය පිණිසත් (ඔහු) පිළිපදින්නෙක් වේ.",
      "paliTitle": "Ñātasuttaṃ",
      "englishTitle": "The Discourse on the Known",
      "sinhalaTitle": "ඤාත සූත්‍රය"
    },
    {
      "number": 12,
      "pali": "‘‘Tīṇimāni, bhikkhave, rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyāni [saraṇīyāni (sī. syā. kaṃ. pī.)] bhavanti. Katamāni tīṇi? Yasmiṃ, bhikkhave, padese rājā khattiyo muddhāvasitto jāto hoti. Idaṃ, bhikkhave, paṭhamaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese rājā khattiyo muddhāvasitto hoti. Idaṃ, bhikkhave, dutiyaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese rājā khattiyo muddhāvasitto saṅgāmaṃ abhivijinitvā vijitasaṅgāmo tameva saṅgāmasīsaṃ ajjhāvasati. Idaṃ, bhikkhave, tatiyaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti. Imāni kho, bhikkhave, tīṇi rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyāni bhavanti. ‘‘Evamevaṃ kho, bhikkhave, tīṇimāni bhikkhussa yāvajīvaṃ sāraṇīyāni bhavanti. Katamāni tīṇi? Yasmiṃ, bhikkhave, padese bhikkhu kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito hoti. Idaṃ, bhikkhave, paṭhamaṃ bhikkhussa yāvajīvaṃ sāraṇīyaṃ hoti. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idaṃ, bhikkhave, dutiyaṃ bhikkhussa yāvajīvaṃ sāraṇīyaṃ hoti. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ, bhikkhave, tatiyaṃ bhikkhussa yāvajīvaṃ sāraṇīyaṃ hoti. Imāni kho, bhikkhave, tīṇi bhikkhussa yāvajīvaṃ sāraṇīyāni bhavantī’’ti. Dutiyaṃ.",
      "english": "Monks, these three things are to be remembered for life by a consecrated warrior king. Which three? Monks, the region where the consecrated warrior king was born. Monks, this is the first thing to be remembered for life by a consecrated warrior king.\n\nFurthermore, monks, the region where the consecrated warrior king was established. Monks, this is the second thing to be remembered for life by a consecrated warrior king.\n\nFurthermore, monks, the region where the consecrated warrior king, having completely triumphed in battle and become victorious, then settles in that very battleground. Monks, this is the third thing to be remembered for life by a consecrated warrior king. Indeed, monks, these are the three things to be remembered for life by a consecrated warrior king.\n\nJust so, monks, these three things are to be remembered for life by a monk. Which three? Monks, the region where the monk, having shaved off his hair and beard, put on saffron robes, and gone forth from the home life into homelessness. Monks, this is the first thing to be remembered for life by a monk.\n\nFurthermore, monks, the region where the monk truly understands: ‘This is suffering’; truly understands: ‘This is the origin of suffering’; truly understands: ‘This is the cessation of suffering’; truly understands: ‘This is the path leading to the cessation of suffering.’ Monks, this is the second thing to be remembered for life by a monk.\n\nFurthermore, monks, the region where the monk, through the destruction of the taints, having realized for himself with direct knowledge the taintless liberation of mind and liberation by wisdom in this very life, abides therein. Monks, this is the third thing to be remembered for life by a monk. Indeed, monks, these are the three things to be remembered for life by a monk.",
      "sinhala": "මහණෙනි, අභිෂේක ලත් ක්ෂත්‍රිය රජුහට ජීවිතාන්තය දක්වා සිහි කළ යුතු මේ කරුණු තුනක් ඇත. ඒ තුන කවරේද? මහණෙනි, අභිෂේක ලත් ක්ෂත්‍රිය රජු යම් පෙදෙසක උපත ලැබුවේද, මහණෙනි, මෙය අභිෂේක ලත් ක්ෂත්‍රිය රජුහට ජීවිතාන්තය දක්වා සිහි කළ යුතු පළමුවන කරුණ වේ.\n\nනැවතත් මහණෙනි, අභිෂේක ලත් ක්ෂත්‍රිය රජු යම් පෙදෙසක අභිෂේක ලැබුවේද, මහණෙනි, මෙය අභිෂේක ලත් ක්ෂත්‍රිය රජුහට ජීවිතාන්තය දක්වා සිහි කළ යුතු දෙවන කරුණ වේ.\n\nනැවතත් මහණෙනි, අභිෂේක ලත් ක්ෂත්‍රිය රජු යම් පෙදෙසක යුද්ධයක් මුළුමණින්ම ජයගෙන, එලෙස ජයගත් යුද්ධය සහිතව, ඒ යුධ භූමියෙහිම වාසය කරන්නේද, මහණෙනි, මෙය අභිෂේක ලත් ක්ෂත්‍රිය රජුහට ජීවිතාන්තය දක්වා සිහි කළ යුතු තෙවන කරුණ වේ. මහණෙනි, අභිෂේක ලත් ක්ෂත්‍රිය රජුහට ජීවිතාන්තය දක්වා සිහි කළ යුතු මේ කරුණු තුන නම් මේවාය.\n\nමහණෙනි, එලෙසින්ම භික්ෂුවකට ජීවිතාන්තය දක්වා සිහි කළ යුතු මේ කරුණු තුනක් ඇත. ඒ තුන කවරේද? මහණෙනි, යම් පෙදෙසක භික්ෂුව කෙස් රැවුල් කපා දමා, කහවතින් වැසී, ගිහි ගෙන් නික්ම අනගාරිකභාවයට පත් වූයේද, මහණෙනි, මෙය භික්ෂුවට ජීවිතාන්තය දක්වා සිහි කළ යුතු පළමුවන කරුණ වේ.\n\nනැවතත් මහණෙනි, යම් පෙදෙසක භික්ෂුව ‘මෙය දුකයි’ යැයි යථාර්ථය පරිදි අවබෝධ කරගන්නේද, ‘මෙය දුක ඇතිවීමට හේතුවයි’ යැයි යථාර්ථය පරිදි අවබෝධ කරගන්නේද, ‘මෙය දුක නැතිකිරීමයි’ යැයි යථාර්ථය පරිදි අවබෝධ කරගන්නේද, ‘මෙය දුක නැතිකිරීමට යන මාර්ගයයි’ යැයි යථාර්ථය පරිදි අවබෝධ කරගන්නේද, මහණෙනි, මෙය භික්ෂුවට ජීවිතාන්තය දක්වා සිහි කළ යුතු දෙවන කරුණ වේ.\n\nනැවතත් මහණෙනි, යම් පෙදෙසක භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන්, කෙලෙස් රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් සාක්ෂාත් කරගෙන, ඊට පැමිණ වාසය කරන්නේද, මහණෙනි, මෙය භික්ෂුවට ජීවිතාන්තය දක්වා සිහි කළ යුතු තෙවන කරුණ වේ. මහණෙනි, භික්ෂුවට ජීවිතාන්තය දක්වා සිහි කළ යුතු මේ කරුණු තුන නම් මේවාය.",
      "paliTitle": "Sāraṇīyasuttaṃ",
      "englishTitle": "The Discourse on Friendly Qualities",
      "sinhalaTitle": "සාරණීය සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Nirāso, āsaṃso, vigatāso. Katamo ca, bhikkhave puggalo nirāso? Idha, bhikkhave, ekacco puggalo nīce kule paccājāto hoti, caṇḍālakule vā venakule [veṇakule (syā. kaṃ. pī.)] vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho [bahvābādho (syā. kaṃ. pī. ka.)] kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa na evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Ayaṃ vuccati, bhikkhave, puggalo nirāso. ‘‘Katamo ca, bhikkhave, puggalo āsaṃso? Idha, bhikkhave, rañño khattiyassa muddhāvasittassa jeṭṭho putto hoti ābhiseko anabhisitto acalappatto [macalappatto (sī. pī.)]. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Ayaṃ vuccati, bhikkhave, puggalo āsaṃso. ‘‘Katamo ca, bhikkhave, puggalo vigatāso? Idha, bhikkhave, rājā hoti khattiyo muddhāvasitto. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa na evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Taṃ kissa hetu? Yā hissa, bhikkhave, pubbe anabhisittassa abhisekāsā sā [sāssa (sī. syā. kaṃ. pī.)] paṭippassaddhā. Ayaṃ vuccati, bhikkhave, puggalo vigatāso. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmiṃ. ‘‘Evamevaṃ kho, bhikkhave, tayo puggalā santo saṃvijjamānā bhikkhūsu. Katame tayo? Nirāso, āsaṃso, vigatāso. Katamo ca, bhikkhave, puggalo nirāso? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto. So suṇāti – ‘itthannāmo kira bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa na evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissāmī’ti! Ayaṃ vuccati, bhikkhave, puggalo nirāso. ‘‘Katamo ca, bhikkhave, puggalo āsaṃso? Idha, bhikkhave, bhikkhu sīlavā hoti kalyāṇadhammo. So suṇāti āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissāmī’ti! Ayaṃ vuccati, bhikkhave, puggalo āsaṃso. ‘‘Katamo ca, bhikkhave, puggalo vigatāso? Idha, bhikkhave, bhikkhu arahaṃ hoti khīṇāsavo. So suṇāti – ‘itthannāmo kira bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa na evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā…pe… sacchikatvā upasampajja viharissāmī’ti! Taṃ kissa hetu? Yā hissa, bhikkhave, pubbe avimuttassa vimuttāsā sā paṭippassaddhā. Ayaṃ vuccati, bhikkhave, puggalo vigatāso. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā bhikkhūsū’’ti. Tatiyaṃ.",
      "english": "Monks, these three types of individuals are found existing in the world. Which three? One who is without hope, one who is hopeful, and one who is free from hope.\n\nAnd what kind of individual, monks, is one who is without hope? Here, monks, a certain individual is born into a low family—into a family of outcasts, or basket-weavers, or hunters, or cart-makers, or scavengers—poor, with little food or drink, living a difficult life where sustenance is obtained with great hardship. Such a person is also ill-favored, unattractive, stooped, sickly with many ailments, blind or crippled or lame or paralyzed, and does not obtain food, drink, clothing, vehicles, garlands, perfumes, ointments, bedding, lodging, or lights. That person hears, “Indeed, a certain Khattiya (noble warrior) of such and such a name has been consecrated by Khattiyas with the Khattiya anointing.” To that person, the thought does not arise, “When will the Khattiyas anoint me too with the Khattiya anointing?” This, monks, is called the individual who is without hope.\n\nAnd what kind of individual, monks, is one who is hopeful? Here, monks, the eldest son of an anointed Khattiya king, one who is destined for anointing but has not yet been anointed, has not yet attained his stable position, hears, “Indeed, a certain Khattiya of such and such a name has been consecrated by Khattiyas with the Khattiya anointing.” To that person, the thought does arise, “When will the Khattiyas anoint me too with the Khattiya anointing?” This, monks, is called the individual who is hopeful.\n\nAnd what kind of individual, monks, is one who is free from hope? Here, monks, a Khattiya king who has been anointed hears, “Indeed, a certain Khattiya of such and such a name has been consecrated by Khattiyas with the Khattiya anointing.” To that person, the thought does not arise, “When will the Khattiyas anoint me too with the Khattiya anointing?” Why is that? Because, monks, the aspiration for anointing that he previously had, when he was not yet anointed, has now subsided. This, monks, is called the individual who is free from hope. These, monks, are the three types of individuals found existing in the world.\n\nIn the same way, monks, these three types of individuals are found existing among monastics. Which three? One who is without aspiration, one who is aspiring, and one who is free from aspiration.\n\nAnd what kind of individual, monks, is one who is without aspiration? Here, monks, a certain individual is immoral, of evil character, impure, of doubtful conduct, with hidden deeds, not a true recluse though claiming to be a recluse, not a true practitioner of the holy life though claiming to be a practitioner of the holy life, inwardly corrupt, overflowing with defilements, utterly putrid. That person hears, “Indeed, a certain monastic of such and such a name, through the destruction of the taints, dwells having entered upon and realized for himself, in this very life, the taintless liberation of mind and liberation through wisdom by direct knowledge.” To that person, the thought does not arise, “When will I too, through the destruction of the taints, dwell having entered upon and realized for myself, in this very life, the taintless liberation of mind and liberation through wisdom by direct knowledge?” This, monks, is called the individual who is without aspiration.\n\nAnd what kind of individual, monks, is one who is aspiring? Here, monks, a certain monastic is virtuous and of good character. That person hears, “Indeed, a certain monastic of such and such a name, through the destruction of the taints, dwells having entered upon and realized for himself, in this very life, the taintless liberation of mind and liberation through wisdom by direct knowledge.” To that person, the thought does arise, “When will I too, through the destruction of the taints, dwell having entered upon and realized for myself, in this very life, the taintless liberation of mind and liberation through wisdom by direct knowledge?” This, monks, is called the individual who is aspiring.\n\nAnd what kind of individual, monks, is one who is free from aspiration? Here, monks, a monastic is an Arahant, with taints destroyed. That person hears, “Indeed, a certain monastic of such and such a name, through the destruction of the taints, dwells having entered upon and realized for himself, in this very life, the taintless liberation of mind and liberation through wisdom by direct knowledge.” To that person, the thought does not arise, “When will I too, through the destruction of the taints, dwell having entered upon and realized for myself, in this very life, the taintless liberation of mind and liberation through wisdom by direct knowledge?” Why is that? Because, monks, the aspiration for liberation that he previously had, when he was not yet liberated, has now subsided. This, monks, is called the individual who is free from aspiration. These, monks, are the three types of individuals found existing among monastics.",
      "sinhala": "මහණෙනි, මෙලොව මේ පුද්ගලයන් තිදෙනෙක් සිටිති, පෙනී සිටිති. ඒ තිදෙනා කවුද? ඔවුන් නිරාශය, ආශංසය, විගතාශය යන අයයි.\n\nමහණෙනි, නිරාශය නම් පුද්ගලයා කවුද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් පහත් කුලයක උපත ලබා සිටී. එනම්, චණ්ඩාල කුලයක හෝ වේන කුලයක හෝ නේසාද කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ දරිද්‍ර වූ, අල්ප වූ අහර පාන භෝජන ඇති, දුක්ඛිත ජීවිතයක් ඇති, කොතැනද අතිශය දුෂ්කරව ජීවිකාව සොයා ගත යුත්තේ එබඳු තැනක උපත ලබා සිටී. ඔහු දුර්වර්ණ වූ, නපුරු පෙනුමැති, අංගවිකල වූ, බොහෝ රෝගාබාධ ඇති, කණ හෝ අතපය අඩුවූ හෝ කොර වූ හෝ අංශභාග රෝගයෙන් පෙළෙන හෝ අයෙක් වෙයි. ආහාර පාන, වස්ත්‍ර, යාන වාහන, මල් සුවඳ විලවුන්, සයන, ආවාස සහ පහන් ආදිය නොලබන අයෙක් වෙයි. ඔහු මෙසේ අසයි – ‘අසවල් ක්‍ෂත්‍රීය රජුට ක්‍ෂත්‍රීයයන් විසින් ක්‍ෂත්‍රීය අභිෂේකය පවත්වන ලදි’ කියා. ඔහුට මෙසේ සිතක් ඇති නොවේ – ‘මාව කවදානම් ක්‍ෂත්‍රීයයන් විසින් ක්‍ෂත්‍රීය අභිෂේකයෙන් අභිෂේක කරාවිදැ’යි! මහණෙනි, මේ පුද්ගලයා නිරාශය (බලාපොරොත්තු රහිත) පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, ආශංසය (බලාපොරොත්තු ඇති) පුද්ගලයා කවුද? මහණෙනි, මෙහි රජ වූ, ක්‍ෂත්‍රීය වූ, අභිෂේක ලත් කෙනෙකුගේ අභිෂේක නොලද, නොසැලෙන සිහසුනට පත් වීමට සිටින, ජ්‍යෙෂ්ඨ පුත්‍රයෙක් වෙයි. ඔහු මෙසේ අසයි – ‘අසවල් ක්‍ෂත්‍රීය රජුට ක්‍ෂත්‍රීයයන් විසින් ක්‍ෂත්‍රීය අභිෂේකය පවත්වන ලදි’ කියා. ඔහුට මෙසේ සිතක් ඇතිවේ – ‘මාව කවදානම් ක්‍ෂත්‍රීයයන් විසින් ක්‍ෂත්‍රීය අභිෂේකයෙන් අභිෂේක කරාවිදැ’යි! මහණෙනි, මේ පුද්ගලයා ආශංසය (බලාපොරොත්තු ඇති) පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, විගතාශය (බලාපොරොත්තු දුරු වූ) පුද්ගලයා කවුද? මහණෙනි, මෙහි රජ වූ, ක්‍ෂත්‍රීය වූ, අභිෂේක ලත් කෙනෙක් වෙයි. ඔහු මෙසේ අසයි – ‘අසවල් ක්‍ෂත්‍රීය රජුට ක්‍ෂත්‍රීයයන් විසින් ක්‍ෂත්‍රීය අභිෂේකය පවත්වන ලදි’ කියා. ඔහුට මෙසේ සිතක් ඇති නොවේ – ‘මාව කවදානම් ක්‍ෂත්‍රීයයන් විසින් ක්‍ෂත්‍රීය අභිෂේකයෙන් අභිෂේක කරාවිදැ’යි! ඒ කුමන හේතුවක් නිසාද? මහණෙනි, මන්ද, පෙර අභිෂේක නොලද කාලයේ ඔහුට තිබූ අභිෂේක අපේක්ෂාව පහව ගොස් ඇති බැවිනි. මහණෙනි, මේ පුද්ගලයා විගතාශය (බලාපොරොත්තු දුරු වූ) පුද්ගලයා යැයි කියනු ලැබේ. මහණෙනි, මෙලොව මේ පුද්ගලයන් තිදෙනා සිටිති, පෙනී සිටිති.\n\nමහණෙනි, එසේම භික්ෂූන් අතරද මේ පුද්ගලයන් තිදෙනෙක් සිටිති, පෙනී සිටිති. ඒ තිදෙනා කවුද? ඔවුන් නිරාශය, ආශංසය, විගතාශය යන අයයි.\n\nමහණෙනි, නිරාශය නම් භික්ෂුව කවුද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් දුශ්ශීල වූ, පාපී ස්වභාව ඇති, අපිරිසිදු වූ, සැක සහිත හැසිරීම් ඇති, රහසිගත ක්‍රියා ඇති, ශ්‍රමණයෙක් නොවූවද ශ්‍රමණ ප්‍රතිඥා ඇති, බ්‍රහ්මචාරියෙක් නොවූවද බ්‍රහ්මචාරී ප්‍රතිඥා ඇති, ඇතුළත කුණු වූ, කාන්දු වූ, කුණු කසළ වැන්නෙක් වෙයි. ඔහු මෙසේ අසයි – ‘අසවල් භික්ෂුව ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, නිරාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්‍මය තුළදීම තමා විසින්ම අභිඥා ලබා සාක්‍ෂාත් කොට උපසම්පදා වී වාසය කරයි’ කියා. ඔහුට මෙසේ සිතක් ඇති නොවේ – ‘මාව කවදානම් ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, නිරාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්‍මය තුළදීම තමා විසින්ම අභිඥා ලබා සාක්‍ෂාත් කොට උපසම්පදා වී වාසය කරාවිදැ’යි! මහණෙනි, මේ පුද්ගලයා නිරාශය (බලාපොරොත්තු රහිත) පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, ආශංසය (බලාපොරොත්තු ඇති) භික්ෂුව කවුද? මහණෙනි, මෙහි භික්ෂුව ශීලවන්ත වූ, කල්‍යාණ ධර්‍මයන්ගෙන් යුක්ත වූ අයෙක් වෙයි. ඔහු මෙසේ අසයි – ‘අසවල් භික්ෂුව ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, නිරාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්‍මය තුළදීම තමා විසින්ම අභිඥා ලබා සාක්‍ෂාත් කොට උපසම්පදා වී වාසය කරයි’ කියා. ඔහුට මෙසේ සිතක් ඇතිවේ – ‘මාව කවදානම් ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, නිරාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්‍මය තුළදීම තමා විසින්ම අභිඥා ලබා සාක්‍ෂාත් කොට උපසම්පදා වී වාසය කරාවිදැ’යි! මහණෙනි, මේ පුද්ගලයා ආශංසය (බලාපොරොත්තු ඇති) පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, විගතාශය (බලාපොරොත්තු දුරු වූ) භික්ෂුව කවුද? මහණෙනි, මෙහි භික්ෂුව රහත් වූ, ක්‍ෂීණාශ්‍රව වූ අයෙක් වෙයි. ඔහු මෙසේ අසයි – ‘අසවල් භික්ෂුව ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, නිරාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්‍මය තුළදීම තමා විසින්ම අභිඥා ලබා සාක්‍ෂාත් කොට උපසම්පදා වී වාසය කරයි’ කියා. ඔහුට මෙසේ සිතක් ඇති නොවේ – ‘මාව කවදානම් ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, නිරාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්‍මය තුළදීම තමා විසින්ම අභිඥා ලබා සාක්‍ෂාත් කොට උපසම්පදා වී වාසය කරාවිදැ’යි! ඒ කුමන හේතුවක් නිසාද? මහණෙනි, මන්ද, පෙර විමුක්තියට පත් නොවූ කාලයේ ඔහුට තිබූ විමුක්තිය පිළිබඳ අපේක්ෂාව පහව ගොස් ඇති බැවිනි. මහණෙනි, මේ පුද්ගලයා විගතාශය (බලාපොරොත්තු දුරු වූ) පුද්ගලයා යැයි කියනු ලැබේ. මහණෙනි, භික්ෂූන් අතරද මේ පුද්ගලයන් තිදෙනා සිටිති, පෙනී සිටිති.",
      "paliTitle": "Āsaṃsasuttaṃ",
      "englishTitle": "The Discourse on Expectations",
      "sinhalaTitle": "ආසංස සූත්‍රය"
    },
    {
      "number": 14,
      "pali": "‘‘Yopi so, bhikkhave, rājā cakkavattī dhammiko dhammarājā sopi na arājakaṃ cakkaṃ vattetī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘ko pana, bhante, rañño cakkavattissa dhammikassa dhammarañño rājā’’ti [cakkanti (ka.)]? ‘‘Dhammo, bhikkhū’’ti bhagavā avoca – ‘‘idha, bhikkhu, rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya [garukaronto (sī. syā. kaṃ. pī.)] dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati antojanasmiṃ’’. ‘‘Puna caparaṃ, bhikkhu, rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati khattiyesu, anuyantesu [anuyuttesu (sī. syā. kaṃ. pī.)], balakāyasmiṃ, brāhmaṇagahapatikesu, negamajānapadesu, samaṇabrāhmaṇesu, migapakkhīsu. Sa kho so bhikkhu rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā antojanasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā khattiyesu, anuyantesu, balakāyasmiṃ, brāhmaṇagahapatikesu, negamajānapadesu, samaṇabrāhmaṇesu, migapakkhīsu, dhammeneva cakkaṃ vatteti. Taṃ hoti cakkaṃ appaṭivattiyaṃ kenaci manussabhūtena paccatthikena pāṇinā. ‘‘Evamevaṃ kho, bhikkhu [bhikkhave (ka.)], tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati kāyakammasmiṃ – ‘evarūpaṃ kāyakammaṃ sevitabbaṃ, evarūpaṃ kāyakammaṃ na sevitabba’’’nti. ‘‘Puna caparaṃ, bhikkhu, tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati vacīkammasmiṃ – ‘evarūpaṃ vacīkammaṃ sevitabbaṃ, evarūpaṃ vacīkammaṃ na sevitabba’nti… pe… manokammasmiṃ – ‘evarūpaṃ manokammaṃ sevitabbaṃ, evarūpaṃ manokammaṃ na sevitabba’’’nti. ‘‘Sa kho so, bhikkhu, tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā kāyakammasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā vacīkammasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā manokammasmiṃ, dhammeneva anuttaraṃ dhammacakkaṃ pavatteti. Taṃ hoti cakkaṃ appaṭivattiyaṃ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmi’’nti. Catutthaṃ.",
      "english": "“Even that Wheel-turning Monarch, monks, who is righteous and a king of righteousness, does not roll a wheel without a sovereign.” When this was said, a certain monk asked the Blessed One, “Who then, Venerable Sir, is the sovereign of that Wheel-turning Monarch, who is righteous and a king of righteousness?” “It is the Dhamma, monk,” the Blessed One replied. “Here, monk, the Wheel-turning Monarch, righteous and a king of righteousness, relying solely on the Dhamma, respecting the Dhamma, revering the Dhamma, honoring the Dhamma, taking the Dhamma as his banner, the Dhamma as his emblem, and the Dhamma as his supreme authority, establishes righteous protection, guard, and security for his inner circle.\n\n“Furthermore, monk, the Wheel-turning Monarch, righteous and a king of righteousness, relying solely on the Dhamma, respecting the Dhamma, revering the Dhamma, honoring the Dhamma, taking the Dhamma as his banner, the Dhamma as his emblem, and the Dhamma as his supreme authority, establishes righteous protection, guard, and security for the nobles, for his retinue, for the armed forces, for the brahmins and householders, for the townsfolk and countryfolk, for recluses and brahmins, and for beasts and birds. That Wheel-turning Monarch, righteous and a king of righteousness, having relied solely on the Dhamma, respecting the Dhamma, revering the Dhamma, honoring the Dhamma, taking the Dhamma as his banner, the Dhamma as his emblem, and the Dhamma as his supreme authority, and having established righteous protection, guard, and security for his inner circle, and having established righteous protection, guard, and security for the nobles, for his retinue, for the armed forces, for the brahmins and householders, for the townsfolk and countryfolk, for recluses and brahmins, and for beasts and birds, rolls the Wheel solely by means of the Dhamma. That Wheel becomes irresistible by any hostile human being or sentient being.\n\n“In the same way, monk, the Tathāgata, the Arahant, the Perfectly Self-Awakened One, righteous and a king of righteousness, relying solely on the Dhamma, respecting the Dhamma, revering the Dhamma, honoring the Dhamma, taking the Dhamma as his banner, the Dhamma as his emblem, and the Dhamma as his supreme authority, establishes righteous protection, guard, and security with regard to bodily action, thinking: ‘Such bodily action is to be cultivated, such bodily action is not to be cultivated.’ Furthermore, monk, the Tathāgata, the Arahant, the Perfectly Self-Awakened One, righteous and a king of righteousness, relying solely on the Dhamma, respecting the Dhamma, revering the Dhamma, honoring the Dhamma, taking the Dhamma as his banner, the Dhamma as his emblem, and the Dhamma as his supreme authority, establishes righteous protection, guard, and security with regard to verbal action, thinking: ‘Such verbal action is to be cultivated, such verbal action is not to be cultivated.’ And similarly, with regard to mental action, thinking: ‘Such mental action is to be cultivated, such mental action is not to be cultivated.’ That Tathāgata, the Arahant, the Perfectly Self-Awakened One, righteous and a king of righteousness, having relied solely on the Dhamma, respecting the Dhamma, revering the Dhamma, honoring the Dhamma, taking the Dhamma as his banner, the Dhamma as his emblem, and the Dhamma as his supreme authority, and having established righteous protection, guard, and security with regard to bodily action, and having established righteous protection, guard, and security with regard to verbal action, and having established righteous protection, guard, and security with regard to mental action, rolls the unsurpassed Wheel of Dhamma solely by means of the Dhamma. That Wheel becomes irresistible by any recluse or brahmin, by any deva or Māra or Brahmā, or by anyone in the world.”",
      "sinhala": "“මහණෙනි, යම් ඒ ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ සක්විති රජෙක් සිටී ද, ඒ රජු ද රජෙකු නැති රථචක්‍රයක් නොපවත්වයි.”\nමෙසේ වදාළ කල්හි එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය. “භාග්‍යවතුන් වහන්ස, ඒ ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ සක්විති රජුගේ රජු කවරෙක් ද?” “මහණෙනි, ධර්මයයි” භාග්‍යවතුන් වහන්සේ වදාළ සේක. “මහණෙනි, මෙලොව ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ සක්විති රජ තෙමේ ධර්මයම විෂය කොටගෙන, ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මයට පූජා කරමින්, ධර්මයම ධ්වජය කොට ඇත්තෙක්ව, ධර්මයම කේතුව කොට ඇත්තෙක්ව, ධර්මයම අධිපති කොට ඇත්තෙක්ව අන්තඃපුරවාසීන් කෙරෙහි ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කරයි.\n\nතවද මහණෙනි, ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ සක්විති රජ තෙමේ ධර්මයම විෂය කොටගෙන, ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මයට පූජා කරමින්, ධර්මයම ධ්වජය කොට ඇත්තෙක්ව, ධර්මයම කේතුව කොට ඇත්තෙක්ව, ධර්මයම අධිපති කොට ඇත්තෙක්ව ක්ෂත්‍රියයන් කෙරෙහි, අනුගාමිකයන් කෙරෙහි, සේනාව කෙරෙහි, බ්‍රාහ්මණ ගෘහපතියන් කෙරෙහි, නගර වැසියන් හා ජනපද වැසියන් කෙරෙහි, ශ්‍රමණයන් හා බ්‍රාහ්මණයන් කෙරෙහි, මුවන් හා පක්ෂීන් කෙරෙහි ද ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කරයි. මහණෙනි, ඒ ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ සක්විති රජ තෙමේ ධර්මයම විෂය කොටගෙන, ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මයට පූජා කරමින්, ධර්මයම ධ්වජය කොට ඇත්තෙක්ව, ධර්මයම කේතුව කොට ඇත්තෙක්ව, ධර්මයම අධිපති කොට ඇත්තෙක්ව අන්තඃපුරවාසීන් කෙරෙහි ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කොට, ක්ෂත්‍රියයන්, අනුගාමිකයන්, සේනාව, බ්‍රාහ්මණ ගෘහපතියන්, නගර වැසියන් හා ජනපද වැසියන්, ශ්‍රමණයන් හා බ්‍රාහ්මණයන්, මුවන් හා පක්ෂීන් කෙරෙහි ද ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කොට, ධර්මයෙන්ම රථචක්‍රය පවත්වයි. ඒ චක්‍රය මනුෂ්‍ය භූත වූ කිසිදු සතුරෙකුට හෝ අන්‍ය සත්වයෙකුට ආපසු හැරවිය නොහැක්කක් වේ.\n\n“මහණෙනි, එපරිද්දෙන්ම තථාගත අරහත් සම්මාසම්බුදුන් වහන්සේ ද ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ ධර්ම රජෙක් සේ ධර්මයම විෂය කොටගෙන, ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මයට පූජා කරමින්, ධර්මයම ධ්වජය කොට ඇත්තෙක්ව, ධර්මයම කේතුව කොට ඇත්තෙක්ව, ධර්මයම අධිපති කොට ඇත්තෙක්ව කායකර්මයෙහි ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කරයි. ‘මෙබඳු කායකර්මයක් සේවනය කළ යුතුයි, මෙබඳු කායකර්මයක් සේවනය නොකළ යුතුයි’ යනුවෙන්.\n\n“තවද මහණෙනි, තථාගත අරහත් සම්මාසම්බුදුන් වහන්සේ ද ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ ධර්ම රජෙක් සේ ධර්මයම විෂය කොටගෙන, ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මයට පූජා කරමින්, ධර්මයම ධ්වජය කොට ඇත්තෙක්ව, ධර්මයම කේතුව කොට ඇත්තෙක්ව, ධර්මයම අධිපති කොට ඇත්තෙක්ව වචීකර්මයෙහි ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කරයි. ‘මෙබඳු වචීකර්මයක් සේවනය කළ යුතුයි, මෙබඳු වචීකර්මයක් සේවනය නොකළ යුතුයි’ යනුවෙන්. ...මනෝකර්මයෙහි ද, ‘මෙබඳු මනෝකර්මයක් සේවනය කළ යුතුයි, මෙබඳු මනෝකර්මයක් සේවනය නොකළ යුතුයි’ යනුවෙන්.\n\n“මහණෙනි, ඒ තථාගත අරහත් සම්මාසම්බුදුන් වහන්සේ ද ධර්මිෂ්ඨ වූ, ධර්මය අනුව යන්නා වූ ධර්ම රජෙක් සේ ධර්මයම විෂය කොටගෙන, ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මයට පූජා කරමින්, ධර්මයම ධ්වජය කොට ඇත්තෙක්ව, ධර්මයම කේතුව කොට ඇත්තෙක්ව, ධර්මයම අධිපති කොට ඇත්තෙක්ව කායකර්මයෙහි ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කොට, වචීකර්මයෙහි ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කොට, මනෝකර්මයෙහි ධර්මානුකූල රැකවරණයක්, ආරක්ෂාවක්, ආවරණයක් සම්පාදනය කොට, ධර්මයෙන්ම අනුත්තර වූ ධර්ම චක්‍රය පවත්වයි. ඒ ධර්ම චක්‍රය ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ දෙවියෙකුට හෝ මාරයෙකුට හෝ බ්‍රහ්මයෙකුට හෝ ලෝකයෙහි අන් කිසිවෙකුට හෝ ආපසු හැරවිය නොහැක්කක් වේ.”",
      "paliTitle": "Cakkavattisuttaṃ",
      "englishTitle": "The Discourse on the Wheel-Turning Monarch",
      "sinhalaTitle": "චක්කවත්ති සූත්‍රය"
    },
    {
      "number": 15,
      "pali": "Ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Bhūtapubbaṃ, bhikkhave, rājā ahosi sacetano [pacetano (sī. syā. kaṃ. pī.)] nāma. Atha kho, bhikkhave, rājā sacetano rathakāraṃ āmantesi – ‘ito me, samma rathakāra, channaṃ māsānaṃ accayena saṅgāmo bhavissati. Sakkhissasi [sakkhasi (syā. kaṃ. pī.)] me, samma rathakāra, navaṃ cakkayugaṃ kātu’nti? ‘Sakkomi devā’ti kho, bhikkhave, rathakāro rañño sacetanassa paccassosi. Atha kho, bhikkhave, rathakāro chahi māsehi chārattūnehi ekaṃ cakkaṃ niṭṭhāpesi. Atha kho, bhikkhave, rājā sacetano rathakāraṃ āmantesi – ‘ito me, samma rathakāra, channaṃ divasānaṃ accayena saṅgāmo bhavissati, niṭṭhitaṃ navaṃ cakkayuga’nti? ‘Imehi kho, deva, chahi māsehi chārattūnehi ekaṃ cakkaṃ niṭṭhita’nti. ‘Sakkhissasi pana me, samma rathakāra, imehi chahi divasehi dutiyaṃ cakkaṃ niṭṭhāpetu’nti? ‘Sakkomi devā’ti kho, bhikkhave, rathakāro chahi divasehi dutiyaṃ cakkaṃ niṭṭhāpetvā navaṃ cakkayugaṃ ādāya yena rājā sacetano tenupasaṅkami; upasaṅkamitvā rājānaṃ sacetanaṃ etadavoca – ‘idaṃ te, deva, navaṃ cakkayugaṃ niṭṭhita’nti. ‘Yañca te idaṃ, samma rathakāra, cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi yañca te idaṃ cakkaṃ chahi divasehi niṭṭhitaṃ, imesaṃ kiṃ nānākaraṇaṃ? Nesāhaṃ kiñci nānākaraṇaṃ passāmī’ti. ‘Atthesaṃ, deva, nānākaraṇaṃ. Passatu devo nānākaraṇa’’’nti. ‘‘Atha kho, bhikkhave, rathakāro yaṃ taṃ cakkaṃ chahi divasehi niṭṭhitaṃ taṃ pavattesi. Taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ papati. Yaṃ pana taṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi taṃ pavattesi. Taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsi. ‘‘‘Ko nu kho, samma rathakāra, hetu ko paccayo yamidaṃ [yadidaṃ (ka.)] cakkaṃ chahi divasehi niṭṭhitaṃ taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ papati? Ko pana, samma rathakāra, hetu ko paccayo yamidaṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsī’ti? ‘Yamidaṃ, deva, cakkaṃ chahi divasehi niṭṭhitaṃ tassa nemipi savaṅkā sadosā sakasāvā, arāpi savaṅkā sadosā sakasāvā, nābhipi savaṅkā sadosā sakasāvā. Taṃ nemiyāpi savaṅkattā sadosattā sakasāvattā, arānampi savaṅkattā sadosattā sakasāvattā, nābhiyāpi savaṅkattā sadosattā sakasāvattā pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ papati. Yaṃ pana taṃ, deva, cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi tassa nemipi avaṅkā adosā akasāvā, arāpi avaṅkā adosā akasāvā, nābhipi avaṅkā adosā akasāvā. Taṃ nemiyāpi avaṅkattā adosattā akasāvattā, arānampi avaṅkattā adosattā akasāvattā, nābhiyāpi avaṅkattā adosattā akasāvattā pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsī’’’ti. ‘‘Siyā kho pana, bhikkhave, tumhākaṃ evamassa – ‘añño nūna tena samayena so rathakāro ahosī’ti! Na kho panetaṃ, bhikkhave, evaṃ daṭṭhabbaṃ. Ahaṃ tena samayena so rathakāro ahosiṃ. Tadāhaṃ, bhikkhave, kusalo dāruvaṅkānaṃ dārudosānaṃ dārukasāvānaṃ. Etarahi kho panāhaṃ, bhikkhave, arahaṃ sammāsambuddho kusalo kāyavaṅkānaṃ kāyadosānaṃ kāyakasāvānaṃ, kusalo vacīvaṅkānaṃ vacīdosānaṃ vacīkasāvānaṃ, kusalo manovaṅkānaṃ manodosānaṃ manokasāvānaṃ. Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā kāyavaṅko appahīno kāyadoso kāyakasāvo, vacīvaṅko appahīno vacīdoso vacīkasāvo, manovaṅko appahīno manodoso manokasāvo, evaṃ papatitā te, bhikkhave, imasmā dhammavinayā, seyyathāpi taṃ cakkaṃ chahi divasehi niṭṭhitaṃ. ‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā kāyavaṅko pahīno kāyadoso kāyakasāvo, vacīvaṅko pahīno vacīdoso vacīkasāvo, manovaṅko pahīno manodoso manokasāvo, evaṃ patiṭṭhitā te, bhikkhave, imasmiṃ dhammavinaye, seyyathāpi taṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kāyavaṅkaṃ pajahissāma kāyadosaṃ kāyakasāvaṃ, vacīvaṅkaṃ pajahissāma vacīdosaṃ vacīkasāvaṃ, manovaṅkaṃ pajahissāma manodosaṃ manokasāva’nti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Pañcamaṃ.",
      "english": "At one time the Blessed One was dwelling in Varanasi, at Isipatana in the Deer Park. There, the Blessed One addressed the monks, saying, \"Monks.\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"In the past, monks, there was a king named Sacetana. Then, monks, King Sacetana addressed a chariot-maker, saying, 'Friend chariot-maker, in six months from now, I will have a battle. Will you be able, friend chariot-maker, to make a new pair of wheels for me?' 'I can, your Majesty,' the chariot-maker replied to King Sacetana. Then, monks, the chariot-maker completed one wheel in six months minus six nights. Then, monks, King Sacetana addressed the chariot-maker, saying, 'Friend chariot-maker, in six days from now, I will have a battle. Is the new pair of wheels finished?' 'Your Majesty, in these six months minus six nights, one wheel has been completed.' 'But will you be able, friend chariot-maker, to complete the second wheel in these six days?' 'I can, your Majesty,' monks, the chariot-maker replied. Having completed the second wheel in six days, the chariot-maker took the new pair of wheels and approached King Sacetana. Having approached, he said to King Sacetana, 'Your Majesty, this new pair of wheels is finished.' 'Friend chariot-maker, what is the difference between this wheel that you completed in six months minus six nights and this wheel that you completed in six days? I see no difference between them.' 'Your Majesty, there is a difference. May your Majesty see the difference.'\"\n\nThen, monks, the chariot-maker set rolling the wheel that he had completed in six days. Having been set rolling, it went as far as its initial impetus carried it, then wobbled and fell to the ground. But then he set rolling the wheel that he had completed in six months minus six nights. Having been set rolling, it went as far as its initial impetus carried it, and then it stood firm, as if struck by an axle.\n\n\"'What is the reason, friend chariot-maker, what is the cause, that this wheel, which was completed in six days, having been set rolling, went as far as its initial impetus carried it, then wobbled and fell to the ground? But what, friend chariot-maker, is the reason, what is the cause, that this wheel, which was completed in six months minus six nights, having been set rolling, went as far as its initial impetus carried it, and then it stood firm, as if struck by an axle?'\"\n\n\"'Your Majesty, concerning this wheel completed in six days: its rim has imperfections, flaws, and stains; its spokes have imperfections, flaws, and stains; its hub has imperfections, flaws, and stains. Because of the imperfections, flaws, and stains of its rim, because of the imperfections, flaws, and stains of its spokes, and because of the imperfections, flaws, and stains of its hub, having been set rolling, it went as far as its initial impetus carried it, then wobbled and fell to the ground. But concerning this wheel completed in six months minus six nights: its rim has no imperfections, no flaws, no stains; its spokes have no imperfections, no flaws, no stains; its hub has no imperfections, no flaws, no stains. Because of the absence of imperfections, flaws, and stains in its rim, because of the absence of imperfections, flaws, and stains in its spokes, and because of the absence of imperfections, flaws, and stains in its hub, having been set rolling, it went as far as its initial impetus carried it, and then it stood firm, as if struck by an axle.'\"\n\n\"It might occur to you, monks, 'Perhaps at that time, that chariot-maker was someone else!' But, monks, it should not be seen in that way. I myself was that chariot-maker at that time. Then, monks, I was skilled in discerning the imperfections, flaws, and stains in wood. But now, monks, as an Arahant, a Fully Self-Awakened One, I am skilled in discerning the imperfections, flaws, and stains of the body; I am skilled in discerning the imperfections, flaws, and stains of speech; I am skilled in discerning the imperfections, flaws, and stains of the mind. Monks, for any monk or nun whose bodily imperfections, bodily flaws, and bodily stains are not abandoned; whose verbal imperfections, verbal flaws, and verbal stains are not abandoned; whose mental imperfections, mental flaws, and mental stains are not abandoned – they fall away from this Dhamma and Discipline, just like that wheel completed in six days.\n\nBut, monks, for any monk or nun whose bodily imperfections, bodily flaws, and bodily stains are abandoned; whose verbal imperfections, verbal flaws, and verbal stains are abandoned; whose mental imperfections, mental flaws, and mental stains are abandoned – they are established in this Dhamma and Discipline, just like that wheel completed in six months minus six nights.\n\nTherefore, monks, you should train yourselves in this way: 'We will abandon bodily crookedness, bodily faults, and bodily defilements. We will abandon verbal crookedness, verbal faults, and verbal defilements. We will abandon mental crookedness, mental faults, and mental defilements.' Thus, monks, you should train yourselves.",
      "sinhala": "එක් සමයෙක භාග්‍ය‍වතුන් වහන්සේ බරණැස ඉසිපතන මිගදායේ වැඩ වාසය කරති. එහිදී භාග්‍ය‍වතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි,\" කියා. \"වහන්ස,\" යැයි ඒ භික්ෂූහු භාග්‍ය‍වතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍ය‍වතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, පෙර කාලයෙහි සචේතන නම් රජෙක් විය. මහණෙනි, එකල්හි සචේතන රජු රථ‍කාරයෙකු අමතා මෙසේ කීවේය: \"මිත්‍ර රථ‍කාරය, මට මාස හයකින් පසු යුද්ධයක් පැමිණේ. මිත්‍ර රථ‍කාරය, මට අලුත් රථ රෝද යුගලයක් සෑදීමට ඔබට හැකිද?\" \"දේවයන් වහන්ස, මට පුළුවන,\" යැයි මහණෙනි, ඒ රථ‍කාරයා සචේතන රජුට පිළිතුරු දුන්නේය. මහණෙනි, එකල්හි ඒ රථ‍කාරයා රාත්‍‍රී හයක් අඩු මාස හයකින් එක් රෝදයක් නිම කළේය. මහණෙනි, එකල්හි සචේතන රජු රථ‍කාරයා අමතා කීවේය: \"මිත්‍ර රථ‍කාරය, මට දින හයකින් පසු යුද්ධයක් පැමිණේ, අලුත් රථ රෝද යුගලය නිම කර තිබේද?\" \"දේවයන් වහන්ස, රාත්‍‍රී හයක් අඩු මාස හයකින් එක් රෝදයක් නිම කර ඇත.\" \"එසේනම්, මිත්‍ර රථ‍කාරය, ඔබට මේ දින හය ඇතුළත දෙවැනි රෝදය නිම කිරීමට හැකිද?\" \"දේවයන් වහන්ස, මට පුළුවන,\" යැයි මහණෙනි, රථ‍කාරයා දින හයකින් දෙවැනි රෝදය නිමකර, අලුත් රථ රෝද යුගලය රැගෙන සචේතන රජු සිටි තැනට පැමිණියේය; පැමිණ සචේතන රජුට මෙය කීවේය: \"දේවයන් වහන්ස, මේ ඔබට නිම කළ අලුත් රථ රෝද යුගලයයි.\" \"යම් හෙයකින් මිත්‍ර රථ‍කාරය, ඔබ රාත්‍‍රී හයක් අඩු මාස හයකින් නිම කළ මේ රෝදයත්, ඔබ දින හයකින් නිම කළ මේ රෝදයත්, මේ දෙකෙහි ඇති වෙනස කුමක්ද? මම නම් කිසිදු වෙනසක් නොදකිමි.\" \"දේවයන් වහන්ස, එහි වෙනසක් ඇත. දේවයන් වහන්සේ එම වෙනස බලත්වා.\"\n\nමහණෙනි, එකල්හි ඒ රථ‍කාරයා දින හයකින් නිම කළ රෝදය පෙරළා දැමුවේය. එය පෙරළා දැමූ විට, සාමාන්‍යයෙන් සාදා නිම කරන ලද රෝදයකට යා හැකි දුරක් ගොස්, දෝලනය වී පොළොවට වැටුණේය. එහෙත් ඔහු රාත්‍‍රී හයක් අඩු මාස හයකින් නිම කළ රෝදය පෙරළා දැමුවේය. එය පෙරළා දැමූ විට, සාමාන්‍යයෙන් සාදා නිම කරන ලද රෝදයකට යා හැකි දුරක් ගොස්, අක්ෂයෙහි වැදී මෙන් ස්ථාවරව පැවතුණේය.\n\n\"මිත්‍ර රථ‍කාරය, කුමක්ද හේතුව, කුමක්ද ප්‍ර‍ත්‍යය, යම් හෙයකින් මේ දින හයකින් නිම කළ රෝදය පෙරළා දැමූ විට, සාමාන්‍යයෙන් සාදා නිම කරන ලද රෝදයකට යා හැකි දුරක් ගොස්, දෝලනය වී පොළොවට වැටුණේද? එසේම, මිත්‍ර රථ‍කාරය, කුමක්ද හේතුව, කුමක්ද ප්‍ර‍ත්‍යය, යම් හෙයකින් මේ රාත්‍‍රී හයක් අඩු මාස හයකින් නිම කළ රෝදය පෙරළා දැමූ විට, සාමාන්‍යයෙන් සාදා නිම කරන ලද රෝදයකට යා හැකි දුරක් ගොස්, අක්ෂයෙහි වැදී මෙන් ස්ථාවරව පැවතුණේද?\" \"දේවයන් වහන්ස, මේ දින හයකින් නිම කළ රෝදයෙහි නෙමියද ඇද සහිතය, දෝෂ සහිතය, කැළැල් සහිතය, අරද ඇද සහිතය, දෝෂ සහිතය, කැළැල් සහිතය, නාභියද ඇද සහිතය, දෝෂ සහිතය, කැළැල් සහිතය. ඒ රෝදයෙහි නෙමිය ඇද සහිත බැවින්, දෝෂ සහිත බැවින්, කැළැල් සහිත බැවින්ද, අර ඇද සහිත බැවින්, දෝෂ සහිත බැවින්, කැළැල් සහිත බැවින්ද, නාභියද ඇද සහිත බැවින්, දෝෂ සහිත බැවින්, කැළැල් සහිත බැවින්ද, පෙරළා දැමූ විට, සාමාන්‍යයෙන් සාදා නිම කරන ලද රෝදයකට යා හැකි දුරක් ගොස්, දෝලනය වී පොළොවට වැටුණේය. යම් හෙයකින් දේවයන් වහන්ස, රාත්‍‍රී හයක් අඩු මාස හයකින් නිම කළ රෝදයෙහි නෙමිය ඇද නැත, දෝෂ නැත, කැළැල් නැත. අරද ඇද නැත, දෝෂ නැත, කැළැල් නැත. නාභියද ඇද නැත, දෝෂ නැත, කැළැල් නැත. ඒ රෝදයෙහි නෙමිය ඇද රහිත බැවින්, දෝෂ රහිත බැවින්, කැළැල් රහිත බැවින්ද, අර ඇද රහිත බැවින්, දෝෂ රහිත බැවින්, කැළැල් රහිත බැවින්ද, නාභියද ඇද රහිත බැවින්, දෝෂ රහිත බැවින්, කැළැල් රහිත බැවින්ද, පෙරළා දැමූ විට, සාමාන්‍යයෙන් සාදා නිම කරන ලද රෝදයකට යා හැකි දුරක් ගොස්, අක්ෂයෙහි වැදී මෙන් ස්ථාවරව පැවතුණේය.\"\n\n\"මහණෙනි, සමහරවිට ඔබට මෙසේ සිතෙන්නට පුළුවන: 'එකල සිටි රථ‍කාරයා වෙන කෙනෙක් විය යුතුයි!' කියා. එහෙත් මහණෙනි, මෙය එසේ නොදැක්ක යුතුය. එකල ඒ රථ‍කාරයා වූයේ මමය. එකල මහණෙනි, මම ලීයේ ඇද, ලීයේ දෝෂ, ලීයේ කැළැල් හඳුනාගැනීමට දක්ෂයෙක් වීමි. එහෙත් දැන් මහණෙනි, මම අරහත් සම්මාසම්බුද්ධ වූ කෙනෙක්මි; කායෙහි වංකභාවයන්, කාය දෝෂයන්, කාය කසාවන් හඳුනාගැනීමට දක්ෂයෙක්මි; වචනයෙහි වංකභාවයන්, වචන දෝෂයන්, වචන කසාවන් හඳුනාගැනීමට දක්ෂයෙක්මි; මනසෙහි වංකභාවයන්, මනෝ දෝෂයන්, මනෝ කසාවන් හඳුනාගැනීමට දක්ෂයෙක්මි. මහණෙනි, යම්කිසි භික්ෂුවක හෝ භික්ෂුණියකගේ කාය වංකභාවය පහකර නැත්තේද, කාය දෝෂය පහකර නැත්තේද, කාය කසාව පහකර නැත්තේද, වචන වංකභාවය පහකර නැත්තේද, වචන දෝෂය පහකර නැත්තේද, වචන කසාව පහකර නැත්තේද, මනෝ වංකභාවය පහකර නැත්තේද, මනෝ දෝෂය පහකර නැත්තේද, මනෝ කසාව පහකර නැත්තේද, මහණෙනි, ඔවුන් මේ ධර්ම‍විනයෙන් එසේ පිරිහී යයි, දින හයකින් නිම කළ රෝදය මෙන්. මහණෙනි, යම්කිසි භික්ෂුවක හෝ භික්ෂුණියකගේ කාය වංකභාවය පහකර ඇත්තේද, කාය දෝෂය පහකර ඇත්තේද, කාය කසාව පහකර ඇත්තේද, වචන වංකභාවය පහකර ඇත්තේද, වචන දෝෂය පහකර ඇත්තේද, වචන කසාව පහකර ඇත්තේද, මනෝ වංකභාවය පහකර ඇත්තේද, මනෝ දෝෂය පහකර ඇත්තේද, මනෝ කසාව පහකර ඇත්තේද, මහණෙනි, ඔවුන් මේ ධර්ම‍විනයෙහි එසේ පිහිටා සිටියි, රාත්‍‍රී හයක් අඩු මාස හයකින් නිම කළ රෝදය මෙන්.\n\nඑබැවින්, මහණෙනි, මෙසේ හික්මිය යුතු ය: 'අපි කාය කෛරාටික බව, කාය දෝෂ, කාය කෂාවන් දුරු කරන්නෙමු; වචී කෛරාටික බව, වචී දෝෂ, වචී කෂාවන් දුරු කරන්නෙමු; මනෝ කෛරාටික බව, මනෝ දෝෂ, මනෝ කෂාවන් දුරු කරන්නෙමු' යනුවෙනි.\n\nමහණෙනි, නුඹලා මෙසේම හික්මිය යුතු ය.",
      "paliTitle": "Sacetanasuttaṃ",
      "englishTitle": "The Discourse on Volition",
      "sinhalaTitle": "සචේතන සූත්‍රය"
    },
    {
      "number": 16,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ [apaṇṇakataṃ paṭipadaṃ (sī. pī.) ṭīkāya pana sameti] paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi tīhi? Idha, bhikkhave, bhikkhu indriyesu guttadvāro hoti, bhojane mattaññū hoti, jāgariyaṃ anuyutto hoti. ‘‘Kathañca, bhikkhave, bhikkhu indriyesu guttadvāro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ [yatvādhikaraṇametaṃ (sī.)] cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. Evaṃ kho, bhikkhave, bhikkhu indriyesu guttadvāro hoti. ‘‘Kathañca, bhikkhave, bhikkhu bhojane mattaññū hoti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. Evaṃ kho, bhikkhave, bhikkhu bhojane mattaññū hoti. ‘‘Kathañca, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti? Idha, bhikkhave, bhikkhu divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti, rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti, rattiyā majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeti pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā, rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti. Evaṃ kho, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, a monk endowed with three qualities enters upon the unfailingly certain path, and the means for the destruction of the taints is aroused in him. Which three? Here, Bhikkhus, a monk is guarded in his sense faculties, is moderate in eating, and is committed to wakefulness.\n\nAnd how, Bhikkhus, is a monk guarded in his sense faculties? Here, Bhikkhus, having seen a form with the eye, a monk does not grasp at its general appearance nor at its details. He practices for the restraint of that through which, if the eye-faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure might flow in upon him. He guards the eye-faculty; he undertakes its restraint. Having heard a sound with the ear, he does not grasp at its general appearance nor at its details. He practices for the restraint of that through which, if the ear-faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure might flow in upon him. He guards the ear-faculty; he undertakes its restraint. Having smelled an odor with the nose, he does not grasp at its general appearance nor at its details. He practices for the restraint of that through which, if the nose-faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure might flow in upon him. He guards the nose-faculty; he undertakes its restraint. Having tasted a flavor with the tongue, he does not grasp at its general appearance nor at its details. He practices for the restraint of that through which, if the tongue-faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure might flow in upon him. He guards the tongue-faculty; he undertakes its restraint. Having felt a tactile sensation with the body, he does not grasp at its general appearance nor at its details. He practices for the restraint of that through which, if the body-faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure might flow in upon him. He guards the body-faculty; he undertakes its restraint. Having cognized a mental phenomenon with the mind, he does not grasp at its general appearance nor at its details. He practices for the restraint of that through which, if the mind-faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure might flow in upon him. He guards the mind-faculty; he undertakes its restraint. Thus, Bhikkhus, a monk is guarded in his sense faculties.\n\nAnd how, Bhikkhus, is a monk moderate in eating? Here, Bhikkhus, a monk consumes food reflecting wisely: ‘Not for amusement, nor for intoxication, nor for adornment, nor for beautification, but only for the sustenance and maintenance of this body, for the cessation of discomfort, and for the support of the holy life. Thus I shall put an end to old feelings and not give rise to new feelings, and there will be for me sustenance, blamelessness, and a comfortable abiding.’ Thus, Bhikkhus, a monk is moderate in eating.\n\nAnd how, Bhikkhus, is a monk committed to wakefulness? Here, Bhikkhus, during the day, by walking and sitting, he purifies his mind from obstructive mental states. During the first watch of the night, by walking and sitting, he purifies his mind from obstructive mental states. During the middle watch of the night, he lies down on his right side, assuming the lion’s posture, placing one foot on the other, mindful and clearly comprehending, having set his mind on the thought of rising. During the last watch of the night, having arisen again, by walking and sitting, he purifies his mind from obstructive mental states. Thus, Bhikkhus, a monk is committed to wakefulness.\n\nIndeed, Bhikkhus, a monk endowed with these three qualities enters upon the unfailingly certain path, and the means for the destruction of the taints is aroused in him.",
      "sinhala": "මහණෙනි, ධර‍්ම තුනකින් යුක්ත භික්ෂුවක් අපණ්ණක ප‍්‍රතිපදාවට එළඹෙයි, ඒ වගේම, ආශ‍්‍රවයන්ගේ ක්ෂය පිණිස ඔහුට මාර්ගය ආරම්භ වී ඇත. ඒ ධර‍්ම තුන කවරේද? මහණෙනි, මෙහිලා භික්ෂුව ඉන්ද්‍රියයන්ගේ ද්වාරයන් ආරක්ෂා කළ කෙනෙක් වෙයි, භෝජනයෙහි පමණ දන්නේ වෙයි, නොනැවතී වීර්යයෙන් යුක්ත වෙයි.\n\nමහණෙනි, භික්ෂුවක් ඉන්ද්‍රියයන්ගේ ද්වාරයන් ආරක්ෂා කරන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව ඇසින් රූපයක් දැක එහි නිමිති ග‍්‍රහණය නොකරයි, අනුබ්‍යංජන ග‍්‍රහණය නොකරයි. යම් කරුණක් නිසා මේ චක්ඛුන්ද්‍රිය අසංවරව වාසය කිරීමෙන් ලෝභය හා ද්වේෂය සහිත පාපී අකුසල ධර‍්මයන් ඔහු වෙතට කා වැදෙන්නේද, ඒ සංවරය පිණිස ඔහු පිළිපදී, චක්ඛුන්ද්‍රිය ආරක්ෂා කරයි, චක්ඛුන්ද්‍රියෙහි සංවරය ඇතිකරගනී. කනින් ශබ්දයක් අසා නිමිති ග‍්‍රහණය නොකරයි, අනුබ්‍යංජන ග‍්‍රහණය නොකරයි. නාසයෙන් ගඳක් ආඝ‍්‍රාණය කොට නිමිති ග‍්‍රහණය නොකරයි, අනුබ්‍යංජන ග‍්‍රහණය නොකරයි. දිවෙන් රසයක් විඳ නිමිති ග‍්‍රහණය නොකරයි, අනුබ්‍යංජන ග‍්‍රහණය නොකරයි. කයින් ස්පර‍්ශයක් ස්පර‍්ශ කොට නිමිති ග‍්‍රහණය නොකරයි, අනුබ්‍යංජන ග‍්‍රහණය නොකරයි. මනසින් ධර‍්මයක් දැනගෙන නිමිති ග‍්‍රහණය නොකරයි, අනුබ්‍යංජන ග‍්‍රහණය නොකරයි. යම් කරුණක් නිසා මේ මනින්ද්‍රිය අසංවරව වාසය කිරීමෙන් ලෝභය හා ද්වේෂය සහිත පාපී අකුසල ධර‍්මයන් ඔහු වෙතට කා වැදෙන්නේද, ඒ සංවරය පිණිස ඔහු පිළිපදී, මනින්ද්‍රිය ආරක්ෂා කරයි, මනින්ද්‍රියෙහි සංවරය ඇතිකරගනී. මහණෙනි, භික්ෂුව ඉන්ද්‍රියයන්ගේ ද්වාරයන් ආරක්ෂා කළ කෙනෙක් වන්නේ මෙලෙසිනි.\n\nමහණෙනි, භික්ෂුවක් භෝජනයෙහි පමණ දන්නේ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව නුවණින් විමසා ආහාර අනුභව කරයි. 'මේ ආහාරය ක‍්‍රීඩා පිණිස නොවේ, මත්වීම පිණිස නොවේ, අලංකාරය පිණිස නොවේ, ශරීරය සරසා ගැනීම පිණිස නොවේ. මේ ශරීරයේ පැවැත්ම පිණිස, යැපීම පිණිස, හිංසාවෙන් වැළකීම පිණිස, බ්‍රහ්මචාරී ජීවිතයට අනුග‍්‍රහයක් පිණිස පමණි. මෙසේ පැරණි වේදනාවන් දුරු කරමි, අලුත් වේදනාවන් ඇති නොකරමි. මගේ ජීවනය පවත්වීමද, නිර‍්දෝෂී භාවයද, පහසු විහරණයද වන්නේය' යනුවෙන්. මහණෙනි, භික්ෂුව භෝජනයෙහි පමණ දන්නේ වන්නේ මෙලෙසිනි.\n\nමහණෙනි, භික්ෂුවක් නොනැවතී වීර්යයෙන් යුක්ත වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව දවල් කාලය සක්මන් කිරීමෙන් හා හිඳීමෙන් සිතට බාධා කරන ධර‍්මයන්ගෙන් සිත පිරිසිදු කරයි. රාත්‍රියේ පළමු යමෙහිද සක්මන් කිරීමෙන් හා හිඳීමෙන් සිතට බාධා කරන ධර‍්මයන්ගෙන් සිත පිරිසිදු කරයි. රාත්‍රියේ මැද යමෙහි, (දකුණු) පය මත (වම්) පය තබා, සිහියෙන් හා මනා දැනීමෙන් යුක්තව, නැගිටීමේ සංඥාව මෙනෙහි කරමින්, සිංහ සෙයියාවෙන් (දකුණු) ඇලයෙන් සැතපෙයි. රාත්‍රියේ අවසන් යමෙහි, නැවත නැගිට සක්මන් කිරීමෙන් හා හිඳීමෙන් සිතට බාධා කරන ධර‍්මයන්ගෙන් සිත පිරිසිදු කරයි. මහණෙනි, භික්ෂුව නොනැවතී වීර්යයෙන් යුක්ත වන්නේ මෙලෙසිනි. මහණෙනි, මේ ධර‍්ම තුනකින් යුක්ත භික්ෂුවක් අපණ්ණක ප‍්‍රතිපදාවට එළඹෙයි, ඒ වගේම, ආශ‍්‍රවයන්ගේ ක්ෂය පිණිස ඔහුට මාර්ගය ආරම්භ වී ඇත.",
      "paliTitle": "Apaṇṇakasuttaṃ",
      "englishTitle": "The Discourse on the Unmistakable/Sure Practice",
      "sinhalaTitle": "අපණ්ණක සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "‘‘Tayome, bhikkhave, dhammā attabyābādhāyapi saṃvattanti, parabyābādhāyapi saṃvattanti, ubhayabyābādhāyapi saṃvattanti. Katame tayo? Kāyaduccaritaṃ, vacīduccaritaṃ, manoduccaritaṃ. Ime kho, bhikkhave, tayo dhammā attabyābādhāyapi saṃvattanti, parabyābādhāyapi saṃvattanti, ubhayabyābādhāyapi saṃvattanti. ‘‘Tayome, bhikkhave, dhammā nevattabyābādhāyapi saṃvattanti, na parabyābādhāyapi saṃvattanti, na ubhayabyābādhāyapi saṃvattanti. Katame tayo? Kāyasucaritaṃ, vacīsucaritaṃ, manosucaritaṃ. Ime kho, bhikkhave, tayo dhammā nevattabyābādhāyapi saṃvattanti, na parabyābādhāyapi saṃvattanti, na ubhayabyābādhāyapi saṃvattantī’’ti. Sattamaṃ.",
      "english": "Monks, there are these three states that lead to one’s own affliction, to the affliction of others, and to the affliction of both. Which three? Bodily misconduct, verbal misconduct, and mental misconduct. Monks, these three states lead to one’s own affliction, to the affliction of others, and to the affliction of both.\n\nMonks, there are these three states that do not lead to one’s own affliction, nor to the affliction of others, nor to the affliction of both. Which three? Bodily good conduct, verbal good conduct, and mental good conduct. Monks, these three states do not lead to one’s own affliction, nor to the affliction of others, nor to the affliction of both.",
      "sinhala": "මහණෙනි, මේ ධර්ම තුනක් ඇත, ඒවා තමාටත් පීඩා පිණිස පවතී, අනුන්ටත් පීඩා පිණිස පවතී, තමාටත් අනුන්ටත් යන දෙපිරිසටම පීඩා පිණිස පවතී. ඒ මොනවාද තුන? කය දුසිරිත්, වචී දුසිරිත්, මනෝ දුසිරිත් යනුයි. මහණෙනි, මේ ධර්ම තුන තමාටත් පීඩා පිණිස පවතී, අනුන්ටත් පීඩා පිණිස පවතී, තමාටත් අනුන්ටත් යන දෙපිරිසටම පීඩා පිණිස පවතී.\n\nමහණෙනි, මේ ධර්ම තුනක් ඇත, ඒවා තමාටත් පීඩා පිණිස නොපවතී, අනුන්ටත් පීඩා පිණිස නොපවතී, තමාටත් අනුන්ටත් යන දෙපිරිසටම පීඩා පිණිස නොපවතී. ඒ මොනවාද තුන? කය සුසිරිත්, වචී සුසිරිත්, මනෝ සුසිරිත් යනුයි. මහණෙනි, මේ ධර්ම තුන තමාටත් පීඩා පිණිස නොපවතී, අනුන්ටත් පීඩා පිණිස නොපවතී, තමාටත් අනුන්ටත් යන දෙපිරිසටම පීඩා පිණිස නොපවතී.",
      "paliTitle": "Attabyābādhasuttaṃ",
      "englishTitle": "Harm to Oneself Sutta",
      "sinhalaTitle": "අත්තබ්‍යාබාධ සූත්‍රය"
    },
    {
      "number": 18,
      "pali": "‘‘Sace vo, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘devalokūpapattiyā, āvuso, samaṇe gotame brahmacariyaṃ vussathā’ti? Nanu tumhe, bhikkhave, evaṃ puṭṭhā aṭṭīyeyyātha harāyeyyātha jiguccheyyāthā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Iti kira tumhe, bhikkhave, dibbena āyunā aṭṭīyatha harāyatha jigucchatha, dibbena vaṇṇena dibbena sukhena dibbena yasena dibbenādhipateyyena aṭṭīyatha harāyatha jigucchatha; pageva kho pana, bhikkhave, tumhehi kāyaduccaritena aṭṭīyitabbaṃ harāyitabbaṃ jigucchitabbaṃ, vacīduccaritena… manoduccaritena aṭṭīyitabbaṃ harāyitabbaṃ jigucchitabba’’nti. Aṭṭhamaṃ.",
      "english": "“If, monks, ascetics of other sects were to ask you thus: ‘Friend, is the holy life lived under the recluse Gotama for rebirth in the deva worlds?’ Would you not, monks, when asked thus, be distressed, ashamed, and disgusted?”\n\n“Yes, venerable sir.”\n\n“Thus, it seems, monks, you are distressed by, ashamed of, and disgusted with divine life-span, divine beauty, divine happiness, divine renown, and divine sovereignty. How much more, then, monks, ought you to be distressed by, ashamed of, and disgusted with misconduct by body, misconduct by speech, and misconduct by mind.”",
      "sinhala": "මහණෙනි, අන්‍යතීර්ථක පරිබ්‍රාජකයෝ ඔබෙන් මෙසේ අසන්නාහු නම් – ‘ඇවැත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ යටතේ දිව්‍යලෝක උපත පිණිසද බ්‍රහ්මචර්යාව පුරන්නේ?’ කියා – මහණෙනි, මෙසේ අසනු ලැබූ ඔබ කලකිරෙන්නට, ලැජ්ජාවට පත්වන්නට, පිළිකුල් කරන්නට නොවේද?\n\nඑසේය, භාග්‍යවතුන් වහන්ස.\n\nමහණෙනි, එසේ නම්, ඔබ දිව්‍යමය ආයුෂයෙන් කලකිරෙයි, ලැජ්ජාවට පත්වෙයි, පිළිකුල් කරයි; දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන් කලකිරෙයි, ලැජ්ජාවට පත්වෙයි, පිළිකුල් කරයි; මහණෙනි, එසේ නම්, ඔබ කාය දුශ්චරිතයෙන් කලකිරිය යුතුය, ලැජ්ජාවට පත්විය යුතුය, පිළිකුල් කළ යුතුය; වචී දුශ්චරිතයෙන් කලකිරිය යුතුය, ලැජ්ජාවට පත්විය යුතුය, පිළිකුල් කළ යුතුය; මනෝ දුශ්චරිතයෙන් කලකිරිය යුතුය, ලැජ්ජාවට පත්විය යුතුය, පිළිකුල් කළ යුතුය.",
      "paliTitle": "Devalokasuttaṃ",
      "englishTitle": "The Heavenly World Sutta",
      "sinhalaTitle": "දේවලෝක සූත්‍රය"
    },
    {
      "number": 19,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato pāpaṇiko abhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, pāpaṇiko pubbaṇhasamayaṃ [majjhantikasamayaṃ (sī. syā. kaṃ. pī.)] na sakkaccaṃ kammantaṃ adhiṭṭhāti, majjhanhikasamayaṃ na sakkaccaṃ kammantaṃ adhiṭṭhāti, sāyanhasamayaṃ na sakkaccaṃ kammantaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko abhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ [phātikattuṃ (sī.), phātikātuṃ (syā. kaṃ. pī.)]. ‘‘Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu abhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, bhikkhu pubbaṇhasamayaṃ na sakkaccaṃ samādhinimittaṃ adhiṭṭhāti, majjhanhikasamayaṃ na sakkaccaṃ samādhinimittaṃ adhiṭṭhāti, sāyanhasamayaṃ na sakkaccaṃ samādhinimittaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu abhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ. ‘‘Tīhi, bhikkhave, aṅgehi samannāgato pāpaṇiko bhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, pāpaṇiko pubbaṇhasamayaṃ sakkaccaṃ kammantaṃ adhiṭṭhāti, majjhanhikasamayaṃ…pe… sāyanhasamayaṃ sakkaccaṃ kammantaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko bhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ. ‘‘Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu bhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, bhikkhu pubbaṇhasamayaṃ sakkaccaṃ samādhinimittaṃ adhiṭṭhāti, majjhanhikasamayaṃ… pe… sāyanhasamayaṃ sakkaccaṃ samādhinimittaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu bhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātu’’nti. Navamaṃ.",
      "english": "Monks, a merchant endowed with three qualities is incapable of acquiring wealth not yet acquired, or of making acquired wealth grow and flourish. Which three? Here, monks, the merchant does not apply himself diligently to his business in the morning, does not apply himself diligently to his business at midday, and does not apply himself diligently to his business in the evening. Monks, it is with these three qualities that a merchant is incapable of acquiring wealth not yet acquired, or of making acquired wealth grow and flourish.\n\nEven so, monks, a monk endowed with three qualities is incapable of acquiring wholesome states not yet acquired, or of making acquired wholesome states grow and flourish. Which three? Here, monks, the monk does not diligently attend to the sign of concentration in the morning, does not diligently attend to the sign of concentration at midday, and does not diligently attend to the sign of concentration in the evening. Monks, it is with these three qualities that a monk is incapable of acquiring wholesome states not yet acquired, or of making acquired wholesome states grow and flourish.\n\nMonks, a merchant endowed with three qualities is capable of acquiring wealth not yet acquired, and of making acquired wealth grow and flourish. Which three? Here, monks, the merchant diligently applies himself to his business in the morning, diligently applies himself to his business at midday, and diligently applies himself to his business in the evening. Monks, it is with these three qualities that a merchant is capable of acquiring wealth not yet acquired, and of making acquired wealth grow and flourish.\n\nEven so, monks, a monk endowed with three qualities is capable of acquiring wholesome states not yet acquired, and of making acquired wholesome states grow and flourish. Which three? Here, monks, the monk diligently attends to the sign of concentration in the morning, diligently attends to the sign of concentration at midday, and diligently attends to the sign of concentration in the evening. Monks, it is with these three qualities that a monk is capable of acquiring wholesome states not yet acquired, and of making acquired wholesome states grow and flourish.",
      "sinhala": "මහණෙනි, කරුණු තුනකින් සමන්විත වෙළෙන්දෙකුට තවම නොලැබූ සම්පත් ලබා ගැනීමට හෝ දැනටමත් ලැබූ සම්පත් වර්ධනය කර ගැනීමට හෝ නොහැකිය. ඒ කවර කරුණු තුනකින්ද? මහණෙනි, මෙහිලා වෙළෙන්දෙක් පෙරවරුවේ තම ව්‍යාපාර කටයුතු නොසැලකිල්ලෙන්, උනන්දුවක් නොදක්වා සිදු කරයි; දහවල් කාලයේ තම ව්‍යාපාර කටයුතු නොසැලකිල්ලෙන්, උනන්දුවක් නොදක්වා සිදු කරයි; සවස් කාලයේ තම ව්‍යාපාර කටයුතු නොසැලකිල්ලෙන්, උනන්දුවක් නොදක්වා සිදු කරයි. මෙම කරුණු තුනෙන් යුක්ත වූ වෙළෙන්දෙකුට, මහණෙනි, නොලැබූ සම්පත් ලබා ගැනීමට හෝ ලැබූ සම්පත් වර්ධනය කර ගැනීමට හෝ නොහැකිය.\n\nමහණෙනි, එලෙසින්ම කරුණු තුනකින් සමන්විත භික්‍ෂුවකට තවම අවබෝධ කර නොගත් කුසල ධර්‍මයක් අවබෝධ කර ගැනීමට හෝ දැනටමත් අවබෝධ කරගත් කුසල ධර්‍මයක් වර්ධනය කර ගැනීමට හෝ නොහැකිය. ඒ කවර කරුණු තුනකින්ද? මහණෙනි, මෙහිලා භික්‍ෂුවක් පෙරවරුවේ සමාධි නිමිත්තට නොසැලකිල්ලෙන්, උනන්දුවක් නොදක්වා යොමු නොවේ; දහවල් කාලයේ සමාධි නිමිත්තට නොසැලකිල්ලෙන්, උනන්දුවක් නොදක්වා යොමු නොවේ; සවස් කාලයේ සමාධි නිමිත්තට නොසැලකිල්ලෙන්, උනන්දුවක් නොදක්වා යොමු නොවේ. මෙම කරුණු තුනෙන් යුක්ත වූ භික්‍ෂුවකට, මහණෙනි, නොලැබූ කුසල ධර්‍මයක් ලබා ගැනීමට හෝ ලැබූ කුසල ධර්‍මයක් වර්ධනය කර ගැනීමට හෝ නොහැකිය.\n\nමහණෙනි, කරුණු තුනකින් සමන්විත වෙළෙන්දෙකුට තවම නොලැබූ සම්පත් ලබා ගැනීමට හෝ දැනටමත් ලැබූ සම්පත් වර්ධනය කර ගැනීමට හෝ හැකිය. ඒ කවර කරුණු තුනකින්ද? මහණෙනි, මෙහිලා වෙළෙන්දෙක් පෙරවරුවේ තම ව්‍යාපාර කටයුතු සැලකිල්ලෙන්, උනන්දුවෙන් සිදු කරයි; දහවල් කාලයේ තම ව්‍යාපාර කටයුතු සැලකිල්ලෙන්, උනන්දුවෙන් සිදු කරයි; සවස් කාලයේ තම ව්‍යාපාර කටයුතු සැලකිල්ලෙන්, උනන්දුවෙන් සිදු කරයි. මෙම කරුණු තුනෙන් යුක්ත වූ වෙළෙන්දෙකුට, මහණෙනි, නොලැබූ සම්පත් ලබා ගැනීමට හෝ ලැබූ සම්පත් වර්ධනය කර ගැනීමට හෝ හැකිය.\n\nමහණෙනි, එලෙසින්ම කරුණු තුනකින් සමන්විත භික්‍ෂුවකට තවම අවබෝධ කර නොගත් කුසල ධර්‍මයක් අවබෝධ කර ගැනීමට හෝ දැනටමත් අවබෝධ කරගත් කුසල ධර්‍මයක් වර්ධනය කර ගැනීමට හෝ හැකිය. ඒ කවර කරුණු තුනකින්ද? මහණෙනි, මෙහිලා භික්‍ෂුවක් පෙරවරුවේ සමාධි නිමිත්තට සැලකිල්ලෙන්, උනන්දුවෙන් යොමු වේ; දහවල් කාලයේ සමාධි නිමිත්තට සැලකිල්ලෙන්, උනන්දුවෙන් යොමු වේ; සවස් කාලයේ සමාධි නිමිත්තට සැලකිල්ලෙන්, උනන්දුවෙන් යොමු වේ. මෙම කරුණු තුනෙන් යුක්ත වූ භික්‍ෂුවකට, මහණෙනි, නොලැබූ කුසල ධර්‍මයක් ලබා ගැනීමට හෝ ලැබූ කුසල ධර්‍මයක් වර්ධනය කර ගැනීමට හෝ හැකිය.",
      "paliTitle": "Paṭhamapāpaṇikasuttaṃ",
      "englishTitle": "The First Discourse on the Shopkeeper",
      "sinhalaTitle": "පළමු පාපණික සූත්‍රය"
    },
    {
      "number": 20,
      "pali": "‘‘Tīhi, bhikkhave, aṅgehi samannāgato pāpaṇiko nacirasseva mahattaṃ vepullattaṃ [mahantattaṃ vā vepullattaṃ vā (pī. ka.)] pāpuṇāti bhogesu. Katamehi tīhi? Idha, bhikkhave, pāpaṇiko cakkhumā ca hoti vidhuro ca nissayasampanno ca. Kathañca, bhikkhave, pāpaṇiko cakkhumā hoti? Idha, bhikkhave, pāpaṇiko paṇiyaṃ jānāti – ‘idaṃ paṇiyaṃ evaṃ kītaṃ, evaṃ vikkayamānaṃ [vikkīyamānaṃ (?)], ettakaṃ mūlaṃ bhavissati, ettako udayo’ti [uddayoti (sī.)]. Evaṃ kho, bhikkhave, pāpaṇiko cakkhumā hoti. ‘‘Kathañca, bhikkhave, pāpaṇiko vidhuro hoti? Idha, bhikkhave, pāpaṇiko kusalo hoti paṇiyaṃ ketuñca vikketuñca. Evaṃ kho, bhikkhave, pāpaṇiko vidhuro hoti. ‘‘Kathañca, bhikkhave, pāpaṇiko nissayasampanno hoti? Idha bhikkhave, pāpaṇikaṃ ye te gahapatī vā gahapatiputtā vā aḍḍhā mahaddhanā mahābhogā te evaṃ jānanti – ‘ayaṃ kho bhavaṃ pāpaṇiko cakkhumā vidhuro ca paṭibalo puttadārañca posetuṃ, amhākañca kālena kālaṃ anuppadātu’nti. Te naṃ bhogehi nipatanti – ‘ito, samma pāpaṇika, bhoge karitvā [haritvā (sī. syā. kaṃ.)] puttadārañca posehi, amhākañca kālena kālaṃ anuppadehī’ti. Evaṃ kho, bhikkhave, pāpaṇiko nissayasampanno hoti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko nacirasseva mahattaṃ vepullattaṃ pāpuṇāti bhogesu. ‘‘Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu nacirasseva mahattaṃ vepullattaṃ pāpuṇāti kusalesu dhammesu. Katamehi tīhi? Idha, bhikkhave, bhikkhu cakkhumā ca hoti vidhuro ca nissayasampanno ca. Kathañca, bhikkhave, bhikkhu cakkhumā hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu cakkhumā hoti. ‘‘Kathañca, bhikkhave, bhikkhu vidhuro hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu vidhuro hoti. ‘‘Kathañca, bhikkhave, bhikkhu nissayasampanno hoti? Idha, bhikkhave, bhikkhu ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, bhikkhu nissayasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu nacirasseva mahattaṃ vepullattaṃ pāpuṇāti kusalesu dhammesū’’ti. Dasamaṃ. Rathakāravaggo dutiyo. ",
      "english": "“Monks, a shopkeeper endowed with three factors soon attains greatness and abundance in his wealth. What are these three? Here, monks, a shopkeeper is discerning, proficient, and well-supported.\n\n“And how, monks, is a shopkeeper discerning? Here, monks, a shopkeeper knows his merchandise: ‘This merchandise, bought at such a price, sold at such a price, will yield such a capital, such a profit.’ That is how, monks, a shopkeeper is discerning.\n\n“And how, monks, is a shopkeeper proficient? Here, monks, a shopkeeper is skillful in buying and selling merchandise. That is how, monks, a shopkeeper is proficient.\n\n“And how, monks, is a shopkeeper well-supported? Here, monks, householders or householders' sons who are wealthy, rich, and well-resourced, know of that shopkeeper: ‘This venerable shopkeeper is discerning, proficient, and capable of supporting his wife and children, and of supplying us from time to time.’ They entrust him with their wealth, saying: ‘Take this wealth, good shopkeeper, and use it to support your wife and children, and supply us from time to time.’ That is how, monks, a shopkeeper is well-supported. Monks, a shopkeeper endowed with these three factors soon attains greatness and abundance in his wealth.\n\n“In the same way, monks, a bhikkhu endowed with three qualities soon attains greatness and extensive development in wholesome qualities. What are these three? Here, monks, a bhikkhu is discerning, proficient, and well-supported.\n\n“And how, monks, is a bhikkhu discerning? Here, monks, a bhikkhu understands as it actually is: ‘This is suffering.’ He understands as it actually is: ‘This is the origin of suffering.’ He understands as it actually is: ‘This is the cessation of suffering.’ He understands as it actually is: ‘This is the path leading to the cessation of suffering.’ That is how, monks, a bhikkhu is discerning.\n\n“And how, monks, is a bhikkhu proficient? Here, monks, a bhikkhu dwells with aroused energy for the abandoning of unskillful qualities and for the acquisition of skillful qualities; he is strong, firm in exertion, and has not cast off the burden of effort concerning skillful qualities. That is how, monks, a bhikkhu is proficient.\n\n“And how, monks, is a bhikkhu well-supported? Here, monks, a bhikkhu from time to time approaches those bhikkhus who are very learned, preservers of the transmitted teachings, masters of the Dhamma, masters of the Vinaya, and masters of the Mātikā, and he questions them and asks them: ‘Venerable sirs, how is this? What is the meaning of this?’ For him, those venerable ones reveal what has not been revealed, make plain what has not been made plain, and resolve his doubts concerning various doubtful points in the teachings. That is how, monks, a bhikkhu is well-supported. Monks, a bhikkhu endowed with these three qualities soon attains greatness and extensive development in wholesome qualities.”",
      "sinhala": "මහණෙනි, කරුණු තුනකින් යුක්ත වෙළෙන්දෙක් නොබෝ කලකින් භෝග සම්පත්තියෙන් මහත් බවටද, විශාල බවටද පත්වෙයි. ඒ කරුණු තුන කවරේද?\n\nමහණෙනි, මෙහිලා වෙළෙන්දා ඇස් ඇත්තෙක් ද වෙයි, දක්ෂයෙක් ද වෙයි, ආශ්‍රය සම්පූර්ණ කළ තැනැත්තෙක් ද වෙයි. මහණෙනි, වෙළෙන්දා කෙසේ නම් ඇස් ඇත්තෙක් වන්නේද? මහණෙනි, මෙහිලා වෙළෙන්දා ‘මේ බඩු මේ ආකාරයෙන් මිලදී ගන්නේ නම්, මේ ආකාරයෙන් විකුණන්නේ නම්, මෙපමණක් මුදලක් වන්නේය, මෙපමණක් ලාභයක් වන්නේය’ යැයි වෙළඳ භාණ්ඩය දන්නේය. මහණෙනි, මේ අයුරින් වෙළෙන්දා ඇස් ඇත්තෙක් වන්නේය.\n\nමහණෙනි, වෙළෙන්දා කෙසේ නම් දක්ෂයෙක් වන්නේද? මහණෙනි, මෙහිලා වෙළෙන්දා වෙළඳ භාණ්ඩ මිලදී ගැනීමටත්, විකිණීමටත් දක්ෂ වෙයි. මහණෙනි, මේ අයුරින් වෙළෙන්දා දක්ෂයෙක් වන්නේය.\n\nමහණෙනි, වෙළෙන්දා කෙසේ නම් ආශ්‍රය සම්පූර්ණ කළ තැනැත්තෙක් වන්නේද? මහණෙනි, මෙහිලා, යම් ගෘහපතියෝ හෝ ගෘහපති පුත්‍රයෝ හෝ ධනවත් වූ, මහත් ධනයක් ඇති, මහත් භෝග සම්පත් ඇති අය වෙත්ද, ඔවුහු මේ වෙළෙන්දා ගැන මෙසේ දනිත්: ‘මේ මහත්මා වූ වෙළෙන්දා ඇස් ඇත්තෙක් ද, දක්ෂයෙක් ද වන අතර, තමාගේ පුත්‍ර දාරා පෝෂණය කිරීමටත්, අපට කලින් කලට භාණ්ඩ ලබා දීමටත් සමර්ථයෙක්’ යනුවෙනි. ඔවුහු මේ වෙළෙන්දාට භෝග සම්පත් ලබා දෙති. ‘වෙළෙන්ද, මෙයින් භෝග සම්පත් ගෙන පුත්‍ර දාරා පෝෂණය කරන්න, අපටද කලින් කලට භාණ්ඩ ලබා දෙන්න’ යනුවෙනි. මහණෙනි, මේ අයුරින් වෙළෙන්දා ආශ්‍රය සම්පූර්ණ කළ තැනැත්තෙක් වන්නේය. මහණෙනි, මේ කරුණු තුනෙන් යුක්ත වෙළෙන්දෙක් නොබෝ කලකින් භෝග සම්පත්තියෙන් මහත් බවටද, විශාල බවටද පත්වෙයි.\n\nමහණෙනි, එපරිද්දෙන්ම කරුණු තුනකින් යුක්ත භික්ෂුවක් නොබෝ කලකින් කුසල ධර්මයන්ගෙන් මහත් බවටද, විශාල බවටද පත්වෙයි. ඒ කරුණු තුන කවරේද?\n\nමහණෙනි, මෙහිලා භික්ෂුව ඇස් ඇත්තෙක් ද වෙයි, දක්ෂයෙක් ද වෙයි, ආශ්‍රය සම්පූර්ණ කළ තැනැත්තෙක් ද වෙයි. මහණෙනි, භික්ෂුව කෙසේ නම් ඇස් ඇත්තෙක් වන්නේද? මහණෙනි, මෙහිලා භික්ෂුව ‘මෙය දුක යි’ කියා ඇති සැටියෙන් අවබෝධ කරයි. ‘මෙය දුක ඇති වීමට හේතුව යි’ කියා ඇති සැටියෙන් අවබෝධ කරයි. ‘මෙය දුක නැති කිරීම යි’ කියා ඇති සැටියෙන් අවබෝධ කරයි. ‘මෙය දුක නැති කිරීමට ඇති මාර්ගය යි’ කියා ඇති සැටියෙන් අවබෝධ කරයි. මහණෙනි, මේ අයුරින් භික්ෂුව ඇස් ඇත්තෙක් වන්නේය.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් දක්ෂයෙක් වන්නේද? මහණෙනි, මෙහිලා භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් සම්පූර්ණ කිරීම පිණිසත්, වීර්යය ආරම්භ කොට වාසය කරයි. ධෛර්ය සම්පන්නව, දැඩි වීර්යයෙන් යුතුව, කුසල ධර්මයන් කෙරෙහි බර නොදැමූ ස්වභාවයෙන් යුතුව සිටියි. මහණෙනි, මේ අයුරින් භික්ෂුව දක්ෂයෙක් වන්නේය.\n\nමහණෙනි, භික්ෂුව කෙසේ නම් ආශ්‍රය සම්පූර්ණ කළ තැනැත්තෙක් වන්නේද? මහණෙනි, මෙහිලා භික්ෂුව යම් ඒ බහුශ්‍රැත වූ, ආගමයට පැමිණි (ග්‍රන්ථධාරී වූ), ධර්මය දරන, විනය දරන, මාතිකා දරන භික්ෂූහු වෙත්ද, ඔවුන් වෙත කලින් කලට එළඹ, ‘ස්වාමීනි, මේ ධර්මය කෙසේද, මේ ධර්මයේ අර්ථය කවරේද?’ කියා විමසා ප්‍රශ්න අසයි. ඒ ආයුෂ්මත්හු ඔහුට නොපැහැදිලි දේ පැහැදිලි කරති, නොගැඹුරු දේ ගැඹුරු කරති, නොයෙක් ආකාර වූ සැක සහිත කරුණුවල සැකය දුරු කරති. මහණෙනි, මේ අයුරින් භික්ෂුව ආශ්‍රය සම්පූර්ණ කළ තැනැත්තෙක් වන්නේය. මහණෙනි, මේ කරුණු තුනෙන් යුක්ත භික්ෂුවක් නොබෝ කලකින් කුසල ධර්මයන්ගෙන් මහත් බවටද, විශාල බවටද පත්වෙයි.",
      "paliTitle": "Dutiyapāpaṇikasuttaṃ",
      "englishTitle": "Second Sutta on the Shopkeeper",
      "sinhalaTitle": "දුතිය පාපණික සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Paṭhamabhāṇavāro niṭṭhito. Tassuddānaṃ – Ñāto [ñātako (syā. kaṃ.)] sāraṇīyo bhikkhu, cakkavattī sacetano; Apaṇṇakattā devo ca, duve pāpaṇikena cāti.",
    "english": "The first recitation session is finished. The summary of it: Known, Memorable, Monk, Wheel-turning Monarch, Conscious; Infallible, God, and two on the Shopkeeper.",
    "sinhala": "පළමු භාණවාරය නිමයි. එහි උද්දානය නම්: ඤාත, සාරණීය, භික්ඛු, චක්කවත්ති, සචේතන, අපණ්ණකත්ත, දේව සහ පාපණික සූත්‍ර දෙකකි."
  }
}