{
  "id": "an3.3",
  "title": {
    "pali": "Puggalavaggo",
    "english": "Section on Persons",
    "sinhala": "පුද්ගල වර්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ca samiddho [saviṭṭho (sī. syā. kaṃ. pī.)] āyasmā ca mahākoṭṭhiko [mahākoṭṭhito (sī. syā. kaṃ. pī.)] yenāyasmā sāriputto tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnaṃ kho āyasmantaṃ samiddhaṃ āyasmā sāriputto etadavoca – ‘‘Tayome, āvuso samiddha, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto [diṭṭhappatto (ka.)], saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti? ‘‘Tayome, āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ [yoyaṃ (ka.)] puggalo saddhāvimutto, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa saddhindriyaṃ adhimatta’’nti. Atha kho āyasmā sāriputto āyasmantaṃ mahākoṭṭhikaṃ etadavoca – ‘‘tayome, āvuso koṭṭhika, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti? ‘‘Tayome, āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ puggalo kāyasakkhī, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa samādhindriyaṃ adhimatta’’nti. Atha kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca – ‘‘tayome, āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti? ‘‘Tayome, āvuso koṭṭhika, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ puggalo diṭṭhippatto, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa paññindriyaṃ adhimatta’’nti. Atha kho āyasmā sāriputto āyasmantañca samiddhaṃ āyasmantañca mahākoṭṭhikaṃ etadavoca – ‘‘byākataṃ kho, āvuso, amhehi sabbeheva yathāsakaṃ paṭibhānaṃ. Āyāmāvuso, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṃ ārocessāma. Yathā no bhagavā byākarissati tathā naṃ dhāressāmā’’ti. ‘‘Evamāvuso’’ti kho āyasmā ca samiddho āyasmā ca mahākoṭṭhiko āyasmato sāriputtassa paccassosuṃ. Atha kho āyasmā ca sāriputto āyasmā ca samiddho āyasmā ca mahākoṭṭhiko yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā sāriputto yāvatako ahosi āyasmatā ca samiddhena āyasmatā ca mahākoṭṭhikena saddhiṃ kathāsallāpo taṃ sabbaṃ bhagavato ārocesi. ‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’ti. Ṭhānañhetaṃ, sāriputta, vijjati yvāyaṃ puggalo saddhāvimutto svāssa [svāyaṃ (syā. kaṃ. pī.), soyaṃ (ka.)] arahattāya paṭipanno, yvāyaṃ puggalo kāyasakkhī svāssa sakadāgāmī vā anāgāmī vā, yo cāyaṃ puggalo diṭṭhippatto sopassa [soyaṃ (ka.)] sakadāgāmī vā anāgāmī vā. ‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’ti. Ṭhānañhetaṃ, sāriputta, vijjati yvāyaṃ puggalo kāyasakkhī svāssa arahattāya paṭipanno, yvāyaṃ puggalo saddhāvimutto svāssa sakadāgāmī vā anāgāmī vā, yo cāyaṃ puggalo diṭṭhippatto sopassa sakadāgāmī vā anāgāmī vā. ‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’ti. Ṭhānañhetaṃ, sāriputta, vijjati yvāyaṃ puggalo diṭṭhippatto svāssa arahattāya paṭipanno, yvāyaṃ puggalo saddhāvimutto svāssa sakadāgāmī vā anāgāmī vā, yo cāyaṃ puggalo kāyasakkhī sopassa sakadāgāmī vā anāgāmī vā. ‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Savatthi, at Anathapindika's Jeta Grove. Then Venerable Samiddha and Venerable Mahakotthika approached Venerable Sariputta; having approached, they exchanged greetings with Venerable Sariputta. Having concluded their courteous and amiable talk, they sat down to one side. As Venerable Samiddha was sitting to one side, Venerable Sariputta said to him: “Friend Samiddha, there are these three types of individuals existing and found in the world. Which three? The Body-Witness, the One Attained to View, and the One Liberated by Faith. Indeed, friend, these three types of individuals exist and are found in the world. Among these three types of individuals, friend, which individual do you consider to be more distinguished and more sublime?” “Friend Sariputta, there are these three types of individuals existing and found in the world. Which three? The Body-Witness, the One Attained to View, and the One Liberated by Faith. Indeed, friend, these three types of individuals exist and are found in the world. Among these three types of individuals, friend, the individual who is Liberated by Faith – this individual I consider to be more distinguished and more sublime among these three types of individuals. For what reason? Because, friend, the faculty of faith is predominant in this individual.” Then Venerable Sariputta said to Venerable Mahakotthika: “Friend Kotthika, there are these three types of individuals existing and found in the world. Which three? The Body-Witness, the One Attained to View, and the One Liberated by Faith. Indeed, friend, these three types of individuals exist and are found in the world. Among these three types of individuals, friend, which individual do you consider to be more distinguished and more sublime?” “Friend Sariputta, there are these three types of individuals existing and found in the world. Which three? The Body-Witness, the One Attained to View, and the One Liberated by Faith. Indeed, friend, these three types of individuals exist and are found in the world. Among these three types of individuals, friend, the individual who is a Body-Witness – this individual I consider to be more distinguished and more sublime among these three types of individuals. For what reason? Because, friend, the faculty of concentration is predominant in this individual.” Then Venerable Mahakotthika said to Venerable Sariputta: “Friend Sariputta, there are these three types of individuals existing and found in the world. Which three? The Body-Witness, the One Attained to View, and the One Liberated by Faith. Indeed, friend, these three types of individuals exist and are found in the world. Among these three types of individuals, friend, which individual do you consider to be more distinguished and more sublime?” “Friend Kotthika, there are these three types of individuals existing and found in the world. Which three? The Body-Witness, the One Attained to View, and the One Liberated by Faith. Indeed, friend, these three types of individuals exist and are found in the world. Among these three types of individuals, friend, the individual who is One Attained to View – this individual I consider to be more distinguished and more sublime among these three types of individuals. For what reason? Because, friend, the faculty of wisdom is predominant in this individual.” Then Venerable Sariputta said to Venerable Samiddha and Venerable Mahakotthika: “Indeed, friends, we have all explained according to our respective insights. Come, friends, let us approach the Blessed One; having approached, let us report this matter to the Blessed One. As the Blessed One explains it to us, so shall we bear it in mind.” “Yes, friend,” Venerable Samiddha and Venerable Mahakotthika replied to Venerable Sariputta. Then Venerable Sariputta, Venerable Samiddha, and Venerable Mahakotthika approached the Blessed One; having approached, they paid homage to the Blessed One and sat down to one side. As he was sitting to one side, Venerable Sariputta reported entirely to the Blessed One all the talk that had taken place with Venerable Samiddha and Venerable Mahakotthika.\n\n“It is not easy here, Sariputta, to make a categorical declaration: ‘Among these three types of individuals, this one is more distinguished and more sublime.’ This possibility exists, Sariputta, that the individual Liberated by Faith is practicing for arahantship, that the individual who is a Body-Witness is a Once-Returner or a Non-Returner, and that the individual who is One Attained to View is a Once-Returner or a Non-Returner. Therefore, Sariputta, it is not easy to make a categorical declaration: ‘Among these three types of individuals, this one is more distinguished and more sublime.’”\n\nIt is possible, Sāriputta, that this person who is a body-witness is practicing for arahantship, that this person who is liberated by faith is a once-returner or a non-returner, and that this person who is attained to view is a once-returner or a non-returner. Indeed, Sāriputta, it is not easy to state conclusively: 'This one among these three types of persons is more excellent and more sublime.'\n\nIt is possible, Sāriputta, that this person who is attained to view is practicing for arahantship, that this person who is liberated by faith is a once-returner or a non-returner, and that this person who is a body-witness is a once-returner or a non-returner. Indeed, Sāriputta, it is not easy to state conclusively: 'This one among these three types of persons is more excellent and more sublime.'",
      "sinhala": "මා හට අසන ලද්දේ මෙසේය – එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනාථපිණ්ඩික සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඑවිට ආයුෂ්මත් සමිද්ධ මහරහතන් වහන්සේ ද, ආයුෂ්මත් මහාකෝට්ඨිත මහරහතන් වහන්සේ ද, ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේ වෙත එළඹියහ; එළඹ ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේ සමඟ සතුටු සාමිචි කතා කළහ. සතුටු සාමිචි කතා හා සිහිකටයුතු කතා අවසන් කොට එක් පසෙක වාඩිවූහ.\n\nඑක් පසෙක වාඩි වී සිටි ආයුෂ්මත් සමිද්ධ මහරහතන් වහන්සේට ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේ මෙය පැවසූ සේක: “මිත්‍ර සමිද්ධය, මේ ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ කවර තිදෙනෙක් ද? කායසාක්ෂී, දෘෂ්ටිප්‍රාප්ත, ශ්‍රද්ධාවිමුක්ත යන තිදෙනා යි. මිත්‍රය, මේ පුද්ගලයෝ තිදෙන ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ ය. මිත්‍රය, මේ තිදෙනා අතරින් වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද ලෙස ඔබට පෙනෙන පුද්ගලයා කවරෙක් ද?”\n\n“මිත්‍ර ශ්‍රීපුත්‍රය, මේ ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ කවර තිදෙනෙක් ද? කායසාක්ෂී, දෘෂ්ටිප්‍රාප්ත, ශ්‍රද්ධාවිමුක්ත යන තිදෙනා යි. මිත්‍රය, මේ පුද්ගලයෝ තිදෙන ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ ය. මිත්‍රය, මේ තිදෙනා අතුරින් යම් මේ ශ්‍රද්ධාවිමුක්ත පුද්ගලයා වේ ද, මේ පුද්ගලයා මට නම් මේ තිදෙනා අතුරින් වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද පුද්ගලයා ලෙස පෙනේ. ඒ කුමන කරුණක් නිසා ද? මිත්‍රය, මේ පුද්ගලයාගේ ශ්‍රද්ධා ඉන්ද්‍රිය අතිමාත්‍ර බැවිනි.”\n\nඑවිට ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේ ආයුෂ්මත් මහාකෝට්ඨිත මහරහතන් වහන්සේට මෙය පැවසූ සේක: “මිත්‍ර කෝට්ඨිතය, මේ ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ කවර තිදෙනෙක් ද? කායසාක්ෂී, දෘෂ්ටිප්‍රාප්ත, ශ්‍රද්ධාවිමුක්ත යන තිදෙනා යි. මිත්‍රය, මේ පුද්ගලයෝ තිදෙන ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ ය. මිත්‍රය, මේ තිදෙනා අතරින් වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද ලෙස ඔබට පෙනෙන පුද්ගලයා කවරෙක් ද?”\n\n“මිත්‍ර ශ්‍රීපුත්‍රය, මේ ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ කවර තිදෙනෙක් ද? කායසාක්ෂී, දෘෂ්ටිප්‍රාප්ත, ශ්‍රද්ධාවිමුක්ත යන තිදෙනා යි. මිත්‍රය, මේ පුද්ගලයෝ තිදෙන ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ ය. මිත්‍රය, මේ තිදෙනා අතුරින් යම් මේ කායසාක්ෂී පුද්ගලයා වේ ද, මේ පුද්ගලයා මට නම් මේ තිදෙනා අතුරින් වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද පුද්ගලයා ලෙස පෙනේ. ඒ කුමන කරුණක් නිසා ද? මිත්‍රය, මේ පුද්ගලයාගේ සමාධි ඉන්ද්‍රිය අතිමාත්‍ර බැවිනි.”\n\nඑවිට ආයුෂ්මත් මහාකෝට්ඨිත මහරහතන් වහන්සේ ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේට මෙය පැවසූ සේක: “මිත්‍ර ශ්‍රීපුත්‍රය, මේ ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ කවර තිදෙනෙක් ද? කායසාක්ෂී, දෘෂ්ටිප්‍රාප්ත, ශ්‍රද්ධාවිමුක්ත යන තිදෙනා යි. මිත්‍රය, මේ පුද්ගලයෝ තිදෙන ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ ය. මිත්‍රය, මේ තිදෙනා අතරින් වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද ලෙස ඔබට පෙනෙන පුද්ගලයා කවරෙක් ද?”\n\n“මිත්‍ර කෝට්ඨිතය, මේ ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ කවර තිදෙනෙක් ද? කායසාක්ෂී, දෘෂ්ටිප්‍රාප්ත, ශ්‍රද්ධාවිමුක්ත යන තිදෙනා යි. මිත්‍රය, මේ පුද්ගලයෝ තිදෙන ලෝකයෙහි පවතින, විද්‍යමාන වන පුද්ගලයෝ ය. මිත්‍රය, මේ තිදෙනා අතුරින් යම් මේ දෘෂ්ටිප්‍රාප්ත පුද්ගලයා වේ ද, මේ පුද්ගලයා මට නම් මේ තිදෙනා අතුරින් වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද පුද්ගලයා ලෙස පෙනේ. ඒ කුමන කරුණක් නිසා ද? මිත්‍රය, මේ පුද්ගලයාගේ ප්‍රඥා ඉන්ද්‍රිය අතිමාත්‍ර බැවිනි.”\n\nඑවිට ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේ ආයුෂ්මත් සමිද්ධ මහරහතන් වහන්සේට ද, ආයුෂ්මත් මහාකෝට්ඨිත මහරහතන් වහන්සේට ද මෙය පැවසූ සේක: “මිත්‍රවරුනි, අප සියල්ලන් විසින් අපගේ අදහසට අනුව පිළිතුරු දෙන ලදී. මිත්‍රවරුනි, එන්න, අපි භාග්‍යවතුන් වහන්සේ වෙත එළඹෙමු; එළඹ මේ කරුණ භාග්‍යවතුන් වහන්සේට දන්වමු. භාග්‍යවතුන් වහන්සේ අපට කෙසේ විසඳා දෙන්නේ ද, එසේ අපි එය පිළිගනිමු.” “මිත්‍රය, එසේයැයි” ආයුෂ්මත් සමිද්ධ මහරහතන් වහන්සේ ද, ආයුෂ්මත් මහාකෝට්ඨිත මහරහතන් වහන්සේ ද ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේට පිළිතුරු දුන්හ.\n\nඑවිට ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේ ද, ආයුෂ්මත් සමිද්ධ මහරහතන් වහන්සේ ද, ආයුෂ්මත් මහාකෝට්ඨිත මහරහතන් වහන්සේ ද භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙක වාඩිවූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් ශ්‍රීපුත්‍ර මහරහතන් වහන්සේ ආයුෂ්මත් සමිද්ධ මහරහතන් වහන්සේ සමඟ ද, ආයුෂ්මත් මහාකෝට්ඨිත මහරහතන් වහන්සේ සමඟ ද ඇති වූ යම් පමණ කතාබහක් වී ද, ඒ සියල්ල භාග්‍යවතුන් වහන්සේට සැලකළ සේක.\n\n“ශ්‍රීපුත්‍රය, ‘මේ තිදෙනා අතුරින් මේ පුද්ගලයා වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද’ යැයි එකාන්තයෙන් කිව නොහැක්කකි. ශ්‍රීපුත්‍රය, යම් ශ්‍රද්ධාවිමුක්ත පුද්ගලයා වේ ද, ඔහු රහත්ඵලයට පත් වූවෙක් විය හැකි ය. යම් කායසාක්ෂී පුද්ගලයා වේ ද, ඔහු සකෘදාගාමී හෝ අනාගාමී වූවෙක් විය හැකි ය. යම් දෘෂ්ටිප්‍රාප්ත පුද්ගලයා වේ ද, ඔහු ද සකෘදාගාමී හෝ අනාගාමී වූවෙක් විය හැකි ය.”\n\n“ශ්‍රීපුත්‍රය, ‘මේ තිදෙනා අතුරින් මේ පුද්ගලයා වඩා උසස් වූ ද, වඩා ප්‍රණීත වූ ද’ යැයි එකාන්තයෙන් කිව නොහැක්කකි.”\n\nසාරිපුත්තය, මෙය විය හැකි කරුණකි: යම් පුද්ගලයෙක් කායසක්ඛී නම්, ඔහු අරහත් බව පිණිස පිළිපන්නේ වේ. යම් පුද්ගලයෙක් සද්ධා-විමුක්ත නම්, ඔහු සකදාගාමී හෝ අනාගාමී වේ. යම් පුද්ගලයෙක් දිට්ඨිප්පත්ත නම්, ඔහු සකදාගාමී හෝ අනාගාමී වේ.\nසාරිපුත්තය, මේ පුද්ගලයන් තිදෙනා අතුරින් 'මෙතෙම වඩාත් උසස්ය, මෙතෙම වඩාත් ප්‍රණීතය' කියා නිශ්චිතවම ප්‍රකාශ කිරීම පහසු නොවේ.\n\nසාරිපුත්තය, මෙය විය හැකි කරුණකි: යම් පුද්ගලයෙක් දිට්ඨිප්පත්ත නම්, ඔහු අරහත් බව පිණිස පිළිපන්නේ වේ. යම් පුද්ගලයෙක් සද්ධා-විමුක්ත නම්, ඔහු සකදාගාමී හෝ අනාගාමී වේ. යම් පුද්ගලයෙක් කායසක්ඛී නම්, ඔහු සකදාගාමී හෝ අනාගාමී වේ.\nසාරිපුත්තය, මේ පුද්ගලයන් තිදෙනා අතුරින් 'මෙතෙම වඩාත් උසස්ය, මෙතෙම වඩාත් ප්‍රණීතය' කියා නිශ්චිතවම ප්‍රකාශ කිරීම පහසු නොවේ.",
      "paliTitle": "Samiddhasuttaṃ"
    },
    {
      "number": 22,
      "pali": "[pu. pa. 94] ‘‘Tayome, bhikkhave, gilānā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco gilāno labhanto vā sappāyāni bhojanāni alabhanto vā sappāyāni bhojanāni, labhanto vā sappāyāni bhesajjāni alabhanto vā sappāyāni bhesajjāni, labhanto vā patirūpaṃ upaṭṭhākaṃ alabhanto vā patirūpaṃ upaṭṭhākaṃ neva vuṭṭhāti tamhā ābādhā. ‘‘Idha pana, bhikkhave, ekacco gilāno labhanto vā sappāyāni bhojanāni alabhanto vā sappāyāni bhojanāni, labhanto vā sappāyāni bhesajjāni alabhanto vā sappāyāni bhesajjāni, labhanto vā patirūpaṃ upaṭṭhākaṃ alabhanto vā patirūpaṃ upaṭṭhākaṃ vuṭṭhāti tamhā ābādhā. ‘‘Idha pana, bhikkhave, ekacco gilāno labhantova sappāyāni bhojanāni no alabhanto, labhantova sappāyāni bhesajjāni no alabhanto, labhantova patirūpaṃ upaṭṭhākaṃ no alabhanto vuṭṭhāti tamhā ābādhā. ‘‘Tatra, bhikkhave, yvāyaṃ gilāno labhantova sappāyāni bhojanāni no alabhanto, labhantova sappāyāni bhesajjāni no alabhanto, labhantova patirūpaṃ upaṭṭhākaṃ no alabhanto vuṭṭhāti tamhā ābādhā, imaṃ kho, bhikkhave, gilānaṃ paṭicca gilānabhattaṃ anuññātaṃ gilānabhesajjaṃ anuññātaṃ gilānupaṭṭhāko anuññāto. Imañca pana, bhikkhave, gilānaṃ paṭicca aññepi gilānā upaṭṭhātabbā. Ime kho, bhikkhave, tayo gilānā santo saṃvijjamānā lokasmiṃ. ‘‘Evamevaṃ kho, bhikkhave, tayome gilānūpamā puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo labhanto vā tathāgataṃ dassanāya alabhanto vā tathāgataṃ dassanāya, labhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya alabhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya neva okkamati niyāmaṃ kusalesu dhammesu sammattaṃ. ‘‘Idha, pana, bhikkhave, ekacco puggalo labhanto vā tathāgataṃ dassanāya alabhanto vā tathāgataṃ dassanāya, labhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya alabhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya okkamati niyāmaṃ kusalesu dhammesu sammattaṃ. ‘‘Idha pana, bhikkhave, ekacco puggalo labhantova tathāgataṃ dassanāya no alabhanto, labhantova tathāgatappaveditaṃ dhammavinayaṃ savanāya no alabhanto okkamati niyāmaṃ kusalesu dhammesu sammattaṃ. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo labhantova tathāgataṃ dassanāya no alabhanto, labhantova tathāgatappaveditaṃ dhammavinayaṃ savanāya no alabhanto okkamati niyāmaṃ kusalesu dhammesu sammattaṃ, imaṃ kho bhikkhave, puggalaṃ paṭicca dhammadesanā anuññātā. Imañca pana, bhikkhave, puggalaṃ paṭicca aññesampi dhammo desetabbo. ‘‘Ime kho, bhikkhave, tayo gilānūpamā puggalā santo saṃvijjamānā lokasmi’’nti. Dutiyaṃ.",
      "english": "Monks, these three types of sick persons are found existing in the world. Which three? Here, monks, a certain sick person, whether or not he obtains suitable food, whether or not he obtains suitable medicines, whether or not he obtains a suitable attendant, does not recover from that illness.\n\nBut here, monks, a certain sick person, whether or not he obtains suitable food, whether or not he obtains suitable medicines, whether or not he obtains a suitable attendant, does recover from that illness.\n\nBut here, monks, a certain sick person, only if he obtains suitable food and not failing to obtain it, only if he obtains suitable medicines and not failing to obtain them, only if he obtains a suitable attendant and not failing to obtain one, recovers from that illness.\n\nAmong these, monks, that sick person who, only if he obtains suitable food and not failing to obtain it, only if he obtains suitable medicines and not failing to obtain them, only if he obtains a suitable attendant and not failing to obtain one, recovers from that illness – it is on account of this sick person, monks, that food for the sick is permitted, medicine for the sick is permitted, and an attendant for the sick is permitted. And furthermore, monks, it is on account of this sick person that other sick persons are also to be attended to. These, monks, are the three types of sick persons found existing in the world.\n\nIn the same way, monks, these three types of persons, comparable to the sick, are found existing in the world. Which three? Here, monks, a certain person, whether or not he obtains a sight of the Tathāgata, whether or not he obtains an opportunity to hear the Dhamma and Discipline proclaimed by the Tathāgata, does not enter the path of certainty in wholesome states.\n\nBut here, monks, a certain person, whether or not he obtains a sight of the Tathāgata, whether or not he obtains an opportunity to hear the Dhamma and Discipline proclaimed by the Tathāgata, does enter the path of certainty in wholesome states.\n\nBut here, monks, a certain person, only if he obtains a sight of the Tathāgata and not failing to obtain it, only if he obtains an opportunity to hear the Dhamma and Discipline proclaimed by the Tathāgata and not failing to obtain it, does enter the path of certainty in wholesome states.\n\nAmong these, monks, that person who, only if he obtains a sight of the Tathāgata and not failing to obtain it, only if he obtains an opportunity to hear the Dhamma and Discipline proclaimed by the Tathāgata and not failing to obtain it, does enter the path of certainty in wholesome states – it is on account of this person, monks, that the teaching of the Dhamma is permitted. And furthermore, monks, it is on account of this person that the Dhamma is to be taught to others also. These, monks, are the three types of persons comparable to the sick, found existing in the world.",
      "sinhala": "භික්ෂූණි, මේ ලෝකයේ ජීවමානව සිටින රෝගීහු තිදෙනෙක් වෙති. කවරහුද ඒ තිදෙනා? භික්ෂූණි, මේ ශාසනයෙහි ඇතැම් රෝගියෙක්, යෝග්‍ය වූ ආහාර ලැබුණත්, නොලැබුණත්, යෝග්‍ය වූ බෙහෙත් ලැබුණත්, නොලැබුණත්, සුදුසු උපස්ථායකයෙක් ලැබුණත්, නොලැබුණත්, ඒ රෝගයෙන් සුවය නොලබයි.\n\nභික්ෂූණි, මේ ශාසනයෙහි තවත් ඇතැම් රෝගියෙක්, යෝග්‍ය වූ ආහාර ලැබුණත්, නොලැබුණත්, යෝග්‍ය වූ බෙහෙත් ලැබුණත්, නොලැබුණත්, සුදුසු උපස්ථායකයෙක් ලැබුණත්, නොලැබුණත්, ඒ රෝගයෙන් සුවය ලබයි.\n\nභික්ෂූණි, මේ ශාසනයෙහි තවත් ඇතැම් රෝගියෙක්, යෝග්‍ය වූ ආහාර ලැබීමෙන් පමණක්, යෝග්‍ය වූ බෙහෙත් ලැබීමෙන් පමණක්, සුදුසු උපස්ථායකයෙක් ලැබීමෙන් පමණක්, ඒ රෝගයෙන් සුවය ලබයි.\n\nභික්ෂූණි, එහිලා යම් ඒ රෝගියෙක්, යෝග්‍ය වූ ආහාර ලැබීමෙන් පමණක්, යෝග්‍ය වූ බෙහෙත් ලැබීමෙන් පමණක්, සුදුසු උපස්ථායකයෙක් ලැබීමෙන් පමණක්, ඒ රෝගයෙන් සුවය ලබන්නේද, භික්ෂූණි, මේ රෝගියා අරභයාම රෝගීන්ට භෝජන, රෝගීන්ට බෙහෙත්, රෝගී උපස්ථායකයෝ අනුදැන වදාළ සේක. භික්ෂූණි, මේ රෝගියා අරභයා තවත් රෝගීන්ටද උපස්ථාන කළ යුත්තේය. භික්ෂූණි, මේ ලෝකයෙහි ජීවමානව සිටින ඒ රෝගීහු තිදෙනා වෙති.\n\nභික්ෂූණි, එසේම මේ ලෝකයෙහි ජීවමානව සිටින, රෝගීන්ට උපමා කළ හැකි පුද්ගලයෝ තිදෙනෙක් වෙති. කවරහුද ඒ තිදෙනා? භික්ෂූණි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක්, තථාගතයන් වහන්සේව දැකීමට ලැබුණත්, නොලැබුණත්, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය ශ්‍රවණය කිරීමට ලැබුණත්, නොලැබුණත්, කුසල ධර්මයන්හි නොවරදින ස්ථිර බවට නොපිවිසෙයි.\n\nභික්ෂූණි, මේ ශාසනයෙහි තවත් ඇතැම් පුද්ගලයෙක්, තථාගතයන් වහන්සේව දැකීමට ලැබුණත්, නොලැබුණත්, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය ශ්‍රවණය කිරීමට ලැබුණත්, නොලැබුණත්, කුසල ධර්මයන්හි නොවරදින ස්ථිර බවට පිවිසෙයි.\n\nභික්ෂූණි, මේ ශාසනයෙහි තවත් ඇතැම් පුද්ගලයෙක්, තථාගතයන් වහන්සේව දැකීමට ලැබීමෙන් පමණක්, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය ශ්‍රවණය කිරීමට ලැබීමෙන් පමණක්, කුසල ධර්මයන්හි නොවරදින ස්ථිර බවට පිවිසෙයි.\n\nභික්ෂූණි, එහිලා යම් ඒ පුද්ගලයෙක්, තථාගතයන් වහන්සේව දැකීමට ලැබීමෙන් පමණක්, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය ශ්‍රවණය කිරීමට ලැබීමෙන් පමණක්, කුසල ධර්මයන්හි නොවරදින ස්ථිර බවට පිවිසෙන්නේද, භික්ෂූණි, මේ පුද්ගලයා අරභයාම ධර්ම දේශනාව අනුදැන වදාළ සේක. භික්ෂූණි, මේ පුද්ගලයා අරභයා තවත් අන් අයටද ධර්මය දේශනා කළ යුත්තේය. භික්ෂූණි, මේ ලෝකයෙහි ජීවමානව සිටින, රෝගීන්ට උපමා කළ හැකි ඒ පුද්ගලයෝ තිදෙනා වෙති.",
      "paliTitle": "Gilānasuttaṃ"
    },
    {
      "number": 23,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo sabyābajjhaṃ [sabyāpajjhaṃ (sabbattha) evamuparipi] kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhaṃ lokaṃ upapajjati. Tamenaṃ sabyābajjhaṃ lokaṃ upapannaṃ samānaṃ sabyābajjhā phassā phusanti. So sabyābajjhehi phassehi phuṭṭho samāno sabyābajjhaṃ vedanaṃ vedayati ekantadukkhaṃ, seyyathāpi sattā nerayikā. ‘‘Idha pana, bhikkhave, ekacco puggalo abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā abyābajjhaṃ lokaṃ upapajjati. Tamenaṃ abyābajjhaṃ lokaṃ upapannaṃ samānaṃ abyābajjhā phassā phusanti. So abyābajjhehi phassehi phuṭṭho samāno abyābajjhaṃ vedanaṃ vedayati ekantasukhaṃ, seyyathāpi devā subhakiṇhā. ‘‘Idha pana, bhikkhave, ekacco puggalo sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhampi abyābajjhampi lokaṃ upapajjati. Tamenaṃ sabyābajjhampi abyābajjhampi lokaṃ upapannaṃ samānaṃ sabyābajjhāpi abyābajjhāpi phassā phusanti. So sabyābajjhehipi abyābajjhehipi phassehi phuṭṭho samāno sabyābajjhampi abyābajjhampi vedanaṃ vedayati vokiṇṇasukhadukkhaṃ, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ.",
      "english": "Monks, there are these three persons existing, found in the world. Which three? Here, monks, a certain person performs afflictive bodily volitional formations, performs afflictive verbal volitional formations, and performs afflictive mental volitional formations. Having performed afflictive bodily volitional formations, having performed afflictive verbal volitional formations, and having performed afflictive mental volitional formations, that person is reborn into an afflictive existence. When that person is reborn into an afflictive existence, afflictive contacts assail them. Being assailed by afflictive contacts, that person experiences exclusively painful feelings, just like beings in hell.\n\nBut here, monks, a certain person performs non-afflictive bodily volitional formations, performs non-afflictive verbal volitional formations, and performs non-afflictive mental volitional formations. Having performed non-afflictive bodily volitional formations, having performed non-afflictive verbal volitional formations, and having performed non-afflictive mental volitional formations, that person is reborn into a non-afflictive existence. When that person is reborn into a non-afflictive existence, non-afflictive contacts assail them. Being assailed by non-afflictive contacts, that person experiences exclusively pleasant feelings, just like the Radiant Devas.\n\nBut here, monks, a certain person performs both afflictive and non-afflictive bodily volitional formations, performs both afflictive and non-afflictive verbal volitional formations, and performs both afflictive and non-afflictive mental volitional formations. Having performed both afflictive and non-afflictive bodily volitional formations, having performed both afflictive and non-afflictive verbal volitional formations, and having performed both afflictive and non-afflictive mental volitional formations, that person is reborn into an existence that is both afflictive and non-afflictive. When that person is reborn into an existence that is both afflictive and non-afflictive, both afflictive and non-afflictive contacts assail them. Being assailed by both afflictive and non-afflictive contacts, that person experiences mixed pleasure and pain, just like humans, certain devas, and certain beings in the lower realms. These, monks, are the three persons existing, found in the world.",
      "sinhala": "භික්ෂූනි, මේ පුද්ගලයන් තිදෙනෙක් ලෝකයේ සිටිති, පවතී. කවරහුද ඒ තිදෙනා? භික්ෂූනි, මෙහිලා එක්තරා පුද්ගලයෙක් පීඩා සහිත කායසංස්කාරයන් රැස් කරයි, පීඩා සහිත වචීසංස්කාරයන් රැස් කරයි, පීඩා සහිත මනෝසංස්කාරයන් රැස් කරයි. හෙතෙම පීඩා සහිත කායසංස්කාරයන් රැස් කොට, පීඩා සහිත වචීසංස්කාරයන් රැස් කොට, පීඩා සහිත මනෝසංස්කාරයන් රැස් කොට, පීඩා සහිත ලෝකයකට උපදී. එසේ පීඩා සහිත ලෝකයක උපන්නහුට පීඩා සහිත ස්පර්ශයන් ස්පර්ශ වෙයි. හෙතෙම පීඩා සහිත ස්පර්ශයන්ගෙන් ස්පර්ශ කරනු ලැබූවෙක්ව ඒකාන්තයෙන් දුක් සහිත වූ පීඩා සහිත වේදනාවන් විඳියි, යම්සේ නිරය සත්වයන් අත්විඳීද එසේමය.\n\nභික්ෂූනි, මෙහිලා තවද එක්තරා පුද්ගලයෙක් පීඩා රහිත කායසංස්කාරයන් රැස් කරයි, පීඩා රහිත වචීසංස්කාරයන් රැස් කරයි, පීඩා රහිත මනෝසංස්කාරයන් රැස් කරයි. හෙතෙම පීඩා රහිත කායසංස්කාරයන් රැස් කොට, පීඩා රහිත වචීසංස්කාරයන් රැස් කොට, පීඩා රහිත මනෝසංස්කාරයන් රැස් කොට, පීඩා රහිත ලෝකයකට උපදී. එසේ පීඩා රහිත ලෝකයක උපන්නහුට පීඩා රහිත ස්පර්ශයන් ස්පර්ශ වෙයි. හෙතෙම පීඩා රහිත ස්පර්ශයන්ගෙන් ස්පර්ශ කරනු ලැබූවෙක්ව ඒකාන්තයෙන් සුව සහිත වූ පීඩා රහිත වේදනාවන් විඳියි, යම්සේ සුභකිණ්හ නම් වූ දෙවියන් අත්විඳීද එසේමය.\n\nභික්ෂූනි, මෙහිලා තවද එක්තරා පුද්ගලයෙක් පීඩා සහිත මෙන්ම පීඩා රහිත කායසංස්කාරයන් රැස් කරයි, පීඩා සහිත මෙන්ම පීඩා රහිත වචීසංස්කාරයන් රැස් කරයි, පීඩා සහිත මෙන්ම පීඩා රහිත මනෝසංස්කාරයන් රැස් කරයි. හෙතෙම පීඩා සහිත මෙන්ම පීඩා රහිත කායසංස්කාරයන් රැස් කොට, පීඩා සහිත මෙන්ම පීඩා රහිත වචීසංස්කාරයන් රැස් කොට, පීඩා සහිත මෙන්ම පීඩා රහිත මනෝසංස්කාරයන් රැස් කොට, පීඩා සහිත මෙන්ම පීඩා රහිත ලෝකයකට උපදී. එසේ පීඩා සහිත මෙන්ම පීඩා රහිත ලෝකයක උපන්නහුට පීඩා සහිත මෙන්ම පීඩා රහිත ස්පර්ශයන් ස්පර්ශ වෙයි. හෙතෙම පීඩා සහිත මෙන්ම පීඩා රහිත ස්පර්ශයන්ගෙන් ස්පර්ශ කරනු ලැබූවෙක්ව සුඛ-දුක් මිශ්‍ර වූ පීඩා සහිත මෙන්ම පීඩා රහිත වේදනාවන් විඳියි, යම්සේ මිනිසුන්, ඇතැම් දෙවියන් හා ඇතැම් විනිපාතිකයන් අත්විඳීද එසේමය. භික්ෂූනි, මේ පුද්ගලයන් තිදෙනා ලෝකයේ සිටිති, පවතී.",
      "paliTitle": "Saṅkhārasuttaṃ"
    },
    {
      "number": 24,
      "pali": "‘‘Tayome, bhikkhave, puggalā puggalassa bahukārā. Katame tayo? Yaṃ, bhikkhave, puggalaṃ āgamma puggalo buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti; ayaṃ, bhikkhave, puggalo imassa puggalassa bahukāro. ‘‘Puna caparaṃ, bhikkhave, yaṃ puggalaṃ āgamma puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti; ayaṃ, bhikkhave, puggalo imassa puggalassa bahukāro. ‘‘Puna caparaṃ, bhikkhave, yaṃ puggalaṃ āgamma puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; ayaṃ, bhikkhave, puggalo imassa puggalassa bahukāro. Ime kho, bhikkhave, tayo puggalā puggalassa bahukārā. ‘‘Imehi ca pana, bhikkhave, tīhi puggalehi imassa puggalassa natthañño puggalo bahukāroti vadāmi. Imesaṃ pana, bhikkhave, tiṇṇaṃ puggalānaṃ iminā puggalena na suppatikāraṃ vadāmi, yadidaṃ abhivādanapaccuṭṭhānaañjalikammasāmīcikammacīvarapiṇḍapātasenāsana- gilānapaccayabhesajjaparikkhārānuppadānenā’’ti. Catutthaṃ.",
      "english": "Monks, these three individuals are of great help to another individual. Which three? Monks, when an individual, relying upon another individual, has gone for refuge to the Buddha, has gone for refuge to the Dhamma, and has gone for refuge to the Saṅgha, this individual is of great help to that individual.\n\nFurthermore, monks, when an individual, relying upon another individual, discerns 'This is suffering' as it actually is, discerns 'This is the origin of suffering' as it actually is, discerns 'This is the cessation of suffering' as it actually is, and discerns 'This is the path leading to the cessation of suffering' as it actually is, this individual is of great help to that individual.\n\nFurthermore, monks, when an individual, relying upon another individual, by the destruction of the taints, has directly realized for themselves the taintless liberation of mind and liberation by wisdom in this very life, and having attained it, dwells therein, this individual is of great help to that individual.\n\nThese three individuals, monks, are of great help to another individual. And furthermore, monks, I declare that there is no other individual of great help to that individual apart from these three. However, monks, I declare that adequate recompense cannot be made by that individual to these three individuals, even by acts of bowing, rising up, reverential salutation, and proper conduct, or by supplying robes, alms food, lodging, and medicinal requisites for the sick.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයන් තිදෙනෙක් පුද්ගලයකුට මහත් උපකාර වෙති. ඒ තිදෙනා කවරහුද? මහණෙනි, යම් පුද්ගලයෙක් ඇසුරු කොට පුද්ගලයෙක් බුදුන් සරණ ගියේ වේද, දහම් සරණ ගියේ වේද, සඟ සරණ ගියේ වේද; මහණෙනි, මේ පුද්ගලයා ඒ පුද්ගලයාට මහත් උපකාරයෙකි.\n\nමහණෙනි, තවද යම් පුද්ගලයෙක් ඇසුරු කොට පුද්ගලයෙක් ‘මෙය දුක ය’යි ඇති සැටියෙන් අවබෝධ කර ගන්නේද, ‘මෙය දුක හටගැනීම ය’යි ඇති සැටියෙන් අවබෝධ කර ගන්නේද, ‘මෙය දුක නැති කිරීම ය’යි ඇති සැටියෙන් අවබෝධ කර ගන්නේද, ‘මෙය දුක නැති කරන මාර්ගය ය’යි ඇති සැටියෙන් අවබෝධ කර ගන්නේද; මහණෙනි, මේ පුද්ගලයා ඒ පුද්ගලයාට මහත් උපකාරයෙකි.\n\nමහණෙනි, තවද යම් පුද්ගලයෙක් ඇසුරු කොට පුද්ගලයෙක් ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප‍්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් ප‍්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරන්නේද; මහණෙනි, මේ පුද්ගලයා ඒ පුද්ගලයාට මහත් උපකාරයෙකි. මහණෙනි, මේ පුද්ගලයන් තිදෙනා පුද්ගලයකුට මහත් උපකාර වෙති. මහණෙනි, මේ පුද්ගලයන් තිදෙනා හැර ඒ පුද්ගලයාට වෙනත් කිසිවෙක් මෙතරම් මහත් උපකාරයක් නොවේ යැයි මම කියමි. එහෙත්, මහණෙනි, මේ පුද්ගලයන් තිදෙනාට, ඒ පුද්ගලයා විසින් වැඳීමෙන්ද, හුනස්නෙන් නැගී සිටීමෙන්ද, ඇඳිලි බැඳීමෙන්ද, මනා ක‍්‍රියා කිරීමෙන්ද, සිවුරු පිණ්ඩපාත සේනාසන ගිලන්පස බෙහෙත් පිරිකර පිදීමෙන්ද, ප‍්‍රමාණවත් ප්‍රතිඋපකාරයක් කළ නොහැකි යැයි මම කියමි.",
      "paliTitle": "Bahukārasuttaṃ"
    },
    {
      "number": 25,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Arukūpamacitto puggalo, vijjūpamacitto puggalo, vajirūpamacitto puggalo. Katamo ca, bhikkhave, arukūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo kodhano hoti upāyāsabahulo appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Seyyathāpi, bhikkhave, duṭṭhāruko [duṭṭhārukā (sī.)] kaṭṭhena vā kaṭhalāya [kathalāya (syā. kaṃ. ka.), kaṭhalena- kathalena (aṭṭhakathā)] vā ghaṭṭito [ghaṭṭitā (sī.)] bhiyyosomattāya āsavaṃ deti [assavanoti (sī.)]; evamevaṃ kho, bhikkhave, idhekacco puggalo kodhano hoti upāyāsabahulo appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Ayaṃ vuccati, bhikkhave, arukūpamacitto puggalo. ‘‘Katamo ca, bhikkhave, vijjūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Seyyathāpi bhikkhave, cakkhumā puriso rattandhakāratimisāyaṃ vijjantarikāya rūpāni passeyya; evamevaṃ kho, bhikkhave, idhekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Ayaṃ vuccati, bhikkhave, vijjūpamacitto puggalo. ‘‘Katamo ca, bhikkhave, vajirūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Seyyathāpi, bhikkhave, vajirassa natthi kiñci abhejjaṃ maṇi vā pāsāṇo vā; evamevaṃ kho, bhikkhave, idhekacco puggalo āsavānaṃ khayā…pe… upasampajja viharati. Ayaṃ vuccati, bhikkhave, vajirūpamacitto puggalo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti [pu. pa. 102]. Pañcamaṃ.",
      "english": "Mendicants, these three types of individuals exist, are found in the world. Which three? The individual like a festering sore, the individual like lightning, and the individual like a diamond. And what kind of individual, mendicants, is like a festering sore? Here, mendicants, some individual is irritable, full of vexation. Even when spoken to a little, they become angry, they flare up, they become hostile, they are stubborn, and they reveal anger, ill will, and discontent. Just as, mendicants, a festering sore, when poked with a stick or a potsherd, produces even more pus; in the same way, mendicants, some individual here is irritable, full of vexation. Even when spoken to a little, they become angry, they flare up, they become hostile, they are stubborn, and they reveal anger, ill will, and discontent. This, mendicants, is called the individual like a festering sore.\n\nAnd what kind of individual, mendicants, is like lightning? Here, mendicants, some individual fully comprehends, as it truly is: ‘This is suffering.’ They fully comprehend, as it truly is: ‘This is the origin of suffering.’ They fully comprehend, as it truly is: ‘This is the cessation of suffering.’ They fully comprehend, as it truly is: ‘This is the path leading to the cessation of suffering.’ Just as, mendicants, a person with good eyesight might see shapes in the dark, pitch-black night by means of a flash of lightning; in the same way, mendicants, some individual here fully comprehends, as it truly is: ‘This is suffering.’ They fully comprehend, as it truly is: ‘This is the origin of suffering.’ They fully comprehend, as it truly is: ‘This is the cessation of suffering.’ They fully comprehend, as it truly is: ‘This is the path leading to the cessation of suffering.’ This, mendicants, is called the individual like lightning.\n\nAnd what kind of individual, mendicants, is like a diamond? Here, mendicants, some individual, through the destruction of the cankers, realizes the undefiled liberation of mind and liberation by wisdom in this very life, having directly experienced it for themselves, and abides therein. Just as, mendicants, there is nothing that cannot be cut by a diamond, be it a gem or a stone; in the same way, mendicants, some individual here, through the destruction of the cankers, realizes the undefiled liberation of mind and liberation by wisdom in this very life, having directly experienced it for themselves, and abides therein. This, mendicants, is called the individual like a diamond.\n\nThese, mendicants, are the three individuals who exist, who are found in the world.",
      "sinhala": "භික්‍ෂූණි, මේ පුද්ගලයන් තිදෙනෙක් ලෝකයෙහි සිටිති, පවතී. ඒ කවර තිදෙනෙක්ද? තුවාලයක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා, විදුලියක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා, වජ්‍රයක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා යි. භික්‍ෂූණි, තුවාලයක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා කවරෙක්ද? භික්‍ෂූණි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ක්‍රෝධ ඇත්තෙක් වෙයි, තිව්‍ර පීඩාවන් බහුලව ඇත්තෙක් වෙයි. අල්ප වූ දෙයක් කී කල්හි දෝෂාරෝපණය කරයි, කිපෙයි, හානි කිරීමේ චේතනාවට පැමිණෙයි, නොසන්සුන් වෙයි, ක්‍රෝධය ද, ද්වේෂය ද, අප්‍රසාදය ද ප්‍රකට කරයි. භික්‍ෂූණි, යම් සේ නරක් වූ තුවාලයක් ලී කැබැල්ලකින් හෝ කැටියකින් හෝ තැළූ කල්හි වඩාත් ස්‍රාවය (ගලන සැරව) පිට කරන්නේ ද; එලෙසින්ම භික්‍ෂූණි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ක්‍රෝධ ඇත්තෙක් වෙයි, තිව්‍ර පීඩාවන් බහුලව ඇත්තෙක් වෙයි. අල්ප වූ දෙයක් කී කල්හි දෝෂාරෝපණය කරයි, කිපෙයි, හානි කිරීමේ චේතනාවට පැමිණෙයි, නොසන්සුන් වෙයි, ක්‍රෝධය ද, ද්වේෂය ද, අප්‍රසාදය ද ප්‍රකට කරයි. භික්‍ෂූණි, මේ පුද්ගලයා 'තුවාලයක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා' යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, විදුලියක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා කවරෙක්ද? භික්‍ෂූණි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් 'මෙය දුක ය' යි යථාභූතව (ඇති සැටියෙන්) ප්‍රඥාවෙන් දනී, 'මෙය දුක හටගැනීම ය' යි යථාභූතව ප්‍රඥාවෙන් දනී, 'මෙය දුක නැතිකිරීම ය' යි යථාභූතව ප්‍රඥාවෙන් දනී, 'මෙය දුක නැතිකිරීමට යන ප්‍රතිපදාව ය' යි යථාභූතව ප්‍රඥාවෙන් දනී. භික්‍ෂූණි, යම් සේ ඇස් ඇත්තා වූ පුරුෂයෙක් දැඩි අඳුරු රැයක විදුලි කෙටීමක් මගින් රූප දකින්නේ ද; එලෙසින්ම භික්‍ෂූණි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් 'මෙය දුක ය' යි යථාභූතව ප්‍රඥාවෙන් දනී, 'මෙය දුක හටගැනීම ය' යි යථාභූතව ප්‍රඥාවෙන් දනී, 'මෙය දුක නැතිකිරීම ය' යි යථාභූතව ප්‍රඥාවෙන් දනී, 'මෙය දුක නැතිකිරීමට යන ප්‍රතිපදාව ය' යි යථාභූතව ප්‍රඥාවෙන් දනී. භික්‍ෂූණි, මේ පුද්ගලයා 'විදුලියක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා' යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, වජ්‍රයක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා කවරෙක්ද? භික්‍ෂූණි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ආසවයන් ක්ෂය කිරීමෙන්, ආසව රහිත වූ චේතෝවිමුක්තිය ද, ප්‍රඥාවිමුක්තිය ද, මේ ආත්මභාවයෙහිම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට, සාක්‍ෂාත් කොට, (ඒ ඵලයට) පැමිණ වාසය කරයි. භික්‍ෂූණි, යම් සේ වජ්‍රයකට බිඳිය නොහැකි වූ මැණිකක් හෝ ගලක් හෝ නැත්තේ ද; එලෙසින්ම භික්‍ෂූණි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ආසවයන් ක්ෂය කිරීමෙන්, ආසව රහිත වූ චේතෝවිමුක්තිය ද, ප්‍රඥාවිමුක්තිය ද, මේ ආත්මභාවයෙහිම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට, සාක්‍ෂාත් කොට, (ඒ ඵලයට) පැමිණ වාසය කරයි. භික්‍ෂූණි, මේ පුද්ගලයා 'වජ්‍රයක් හා සමාන සිත් ඇත්තා වූ පුද්ගලයා' යැයි කියනු ලැබේ. භික්‍ෂූණි, මේ පුද්ගලයන් තිදෙනා ලෝකයෙහි සිටිති, පවතී.",
      "paliTitle": "Vajirūpamasuttaṃ"
    },
    {
      "number": 26,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Atthi, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Atthi, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Katamo ca, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo hīno hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo aññatra anuddayā aññatra anukampā. ‘‘Katamo ca, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave, ekacco puggalo sadiso hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Sīlasāmaññagatānaṃ sataṃ sīlakathā ca no bhavissati, sā ca no pavattinī [pavattanī (sī. syā. kaṃ. pī.) pu. pa. 122 passitabbaṃ] bhavissati, sā ca no phāsu bhavissati. Samādhisāmaññagatānaṃ sataṃ samādhikathā ca no bhavissati, sā ca no pavattinī bhavissati, sā ca no phāsu bhavissati. Paññāsāmaññagatānaṃ sataṃ paññākathā ca no bhavissati, sā ca no pavattinī bhavissati, sā ca no phāsu bhavissatīti. Tasmā evarūpo puggalo sevitabbo bhajitabbo payirupāsitabbo. ‘‘Katamo ca, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave, ekacco puggalo adhiko hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Iti aparipūraṃ vā sīlakkhandhaṃ paripūressāmi, paripūraṃ vā sīlakkhandhaṃ tattha tattha paññāya anuggahessāmi; aparipūraṃ vā samādhikkhandhaṃ paripūressāmi, paripūraṃ vā samādhikkhandhaṃ tattha tattha paññāya anuggahessāmi; aparipūraṃ vā paññākkhandhaṃ paripūressāmi, paripūraṃ vā paññākkhandhaṃ tattha tattha paññāya anuggahessāmīti. Tasmā evarūpo puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. ‘‘Nihīyati puriso nihīnasevī, Na ca hāyetha kadāci tulyasevī; Seṭṭhamupanamaṃ udeti khippaṃ, Tasmā attano uttariṃ bhajethā’’ti. chaṭṭhaṃ;",
      "english": "Monks, these three types of individuals are found existing in the world. Which three?\n\nMonks, there is an individual who should not be associated with, should not be resorted to, and should not be attended upon. Monks, there is an individual who should be associated with, should be resorted to, and should be attended upon. Monks, there is an individual who should be associated with, resorted to, and attended upon with respect and reverence.\n\nAnd who, monks, is the individual who should not be associated with, resorted to, or attended upon? Here, monks, a certain individual is inferior in virtue, in concentration, and in wisdom. Such an individual, monks, should not be associated with, resorted to, or attended upon, except out of compassion, except out of sympathy.\n\nAnd who, monks, is the individual who should be associated with, resorted to, and attended upon? Here, monks, a certain individual is similar in virtue, in concentration, and in wisdom. Such an individual, monks, should be associated with, resorted to, and attended upon. For what reason? Being in commonality of virtue, there will be talk about virtue for us, and that will be conducive to our progress, and that will be pleasant for us. Being in commonality of concentration, there will be talk about concentration for us, and that will be conducive to our progress, and that will be pleasant for us. Being in commonality of wisdom, there will be talk about wisdom for us, and that will be conducive to our progress, and that will be pleasant for us. Therefore, such an individual should be associated with, resorted to, and attended upon.\n\nAnd who, monks, is the individual who should be associated with, resorted to, and attended upon with respect and reverence? Here, monks, a certain individual is superior in virtue, in concentration, and in wisdom. Such an individual, monks, should be associated with, resorted to, and attended upon with respect and reverence. For what reason? Thinking: \"I will complete my undeveloped aggregate of virtue, or I will strengthen my developed aggregate of virtue in various aspects through wisdom; I will complete my undeveloped aggregate of concentration, or I will strengthen my developed aggregate of concentration in various aspects through wisdom; I will complete my undeveloped aggregate of wisdom, or I will strengthen my developed aggregate of wisdom in various aspects through wisdom.\" Therefore, such an individual should be associated with, resorted to, and attended upon with respect and reverence. These, monks, are the three types of individuals found existing in the world.\n\nA person who associates with the inferior declines,\nOne who associates with equals never declines;\nOne who draws near to the superior quickly rises,\nTherefore, one should associate with those who are superior to oneself.",
      "sinhala": "භික්ෂූණි, මේ පුද්ගලයෝ තිදෙනෙක් ලෝකයෙහි ඇත්තෝ, විද්‍යමාන වන්නෝ වෙති. ඒ තිදෙනා කවරහුද? භික්ෂූණි, නොසේවිය යුතු, නොභජනය කළ යුතු, නොඋපස්ථාන කළ යුතු පුද්ගලයෙක් වෙයි. භික්ෂූණි, සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු පුද්ගලයෙක් වෙයි. භික්ෂූණි, සත්කාර කොට, ගරු කොට සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු පුද්ගලයෙක් වෙයි. භික්ෂූණි, නොසේවිය යුතු, නොභජනය කළ යුතු, නොඋපස්ථාන කළ යුතු පුද්ගලයා කවරෙක්ද? භික්ෂූණි, මෙහිලා යම්කිසි පුද්ගලයෙක් සිල්, සමාධි, ප්‍ර‍ඥා යන මේවායෙන් හීන (පිරිහී) වෙයි. භික්ෂූණි, මෙබඳු පුද්ගලයා කරුණාවෙන් හා අනුකම්පාවෙන් මිස නොසේවිය යුතු, නොභජනය කළ යුතු, නොඋපස්ථාන කළ යුතු වෙයි.\n\nභික්ෂූණි, සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු පුද්ගලයා කවරෙක්ද? භික්ෂූණි, මෙහිලා යම්කිසි පුද්ගලයෙක් සිල්, සමාධි, ප්‍ර‍ඥා යන මේවායෙන් (තමාට) සමාන වෙයි. මෙබඳු පුද්ගලයා සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු වෙයි. ඒ කවර හෙයින්ද? සිල්හි සමාන වූවන් ඇති කල්හි අපගේ සිල් කථා ඇති වෙයි. එය අපට ප්‍ර‍වර්ධනයක් (අභිවෘද්ධියක්) වෙයි. එය අපට සැපක් වෙයි. සමාධියෙහි සමාන වූවන් ඇති කල්හි අපගේ සමාධි කථා ඇති වෙයි. එය අපට ප්‍ර‍වර්ධනයක් වෙයි. එය අපට සැපක් වෙයි. ප්‍ර‍ඥායෙහි සමාන වූවන් ඇති කල්හි අපගේ ප්‍ර‍ඥා කථා ඇති වෙයි. එය අපට ප්‍ර‍වර්ධනයක් වෙයි. එය අපට සැපක් වෙයි. එබැවින් මෙබඳු පුද්ගලයා සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු වෙයි.\n\nභික්ෂූණි, සත්කාර කොට, ගරු කොට සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු පුද්ගලයා කවරෙක්ද? භික්ෂූණි, මෙහිලා යම්කිසි පුද්ගලයෙක් සිල්, සමාධි, ප්‍ර‍ඥා යන මේවායෙන් (තමාට වඩා) අධික වෙයි. මෙබඳු පුද්ගලයා සත්කාර කොට, ගරු කොට සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු වෙයි. ඒ කවර හෙයින්ද? අපරිපූර්ණ වූ සිල් ස්කන්ධය පරිපූර්ණ කරගන්නෙමි, නැතහොත් පරිපූර්ණ වූ සිල් ස්කන්ධය නන් අයුරින් ප්‍ර‍ඥාවෙන් ධාරණය කරගන්නෙමි (පවත්වාගන්නෙමි) යන අදහසිනි. අපරිපූර්ණ වූ සමාධි ස්කන්ධය පරිපූර්ණ කරගන්නෙමි, නැතහොත් පරිපූර්ණ වූ සමාධි ස්කන්ධය නන් අයුරින් ප්‍ර‍ඥාවෙන් ධාරණය කරගන්නෙමි යන අදහසිනි. අපරිපූර්ණ වූ ප්‍ර‍ඥා ස්කන්ධය පරිපූර්ණ කරගන්නෙමි, නැතහොත් පරිපූර්ණ වූ ප්‍ර‍ඥා ස්කන්ධය නන් අයුරින් ප්‍ර‍ඥාවෙන් ධාරණය කරගන්නෙමි යන අදහසිනි. එබැවින් මෙබඳු පුද්ගලයා සත්කාර කොට, ගරු කොට සේවනය කළ යුතු, භජනය කළ යුතු, උපස්ථාන කළ යුතු වෙයි. භික්ෂූණි, මේ පුද්ගලයෝ තිදෙනෙක් ලෝකයෙහි ඇත්තෝ, විද්‍යමාන වන්නෝ වෙති.\n\nහීනයන් සේවනය කරන්නා වූ පුරුෂයා පහත් භාවයටම පත්වෙයි.\n(තමාට) සමානයන් සේවනය කරන්නා කිසි කලෙක පිරිහීමට පත් නොවෙයි.\nශ්‍රේෂ්ඨයන්ට ළං වන්නා ඉක්මනින් දියුණුවට පත්වෙයි.\nඑබැවින් තමාට වඩා උසස් අය ඇසුරු කළ යුතුයි.",
      "paliTitle": "Sevitabbasuttaṃ"
    },
    {
      "number": 27,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Atthi, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Katamo ca, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto, assamaṇo samaṇapaṭiñño, abrahmacārī brahmacāripaṭiñño, antopūti avassuto kasambujāto. Evarūpo, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Taṃ kissa hetu? Kiñcāpi, bhikkhave, evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ pāpako kittisaddo abbhuggacchati – ‘pāpamitto purisapuggalo pāpasahāyo pāpasampavaṅko’ti. Seyyathāpi, bhikkhave, ahi gūthagato kiñcāpi na daṃsati [ḍaṃsati (sī. syā.), ḍassati (pī.)], atha kho naṃ makkheti; evamevaṃ kho, bhikkhave, kiñcāpi evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ pāpako kittisaddo abbhuggacchati – ‘pāpamitto purisapuggalo pāpasahāyo pāpasampavaṅko’ti. Tasmā evarūpo puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. ‘‘Katamo ca, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Seyyathāpi, bhikkhave, duṭṭhāruko kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyosomattāya āsavaṃ deti; evamevaṃ kho, bhikkhave…pe… seyyathāpi, bhikkhave, tindukālātaṃ kaṭṭhena vā kaṭhalāya vā ghaṭṭitaṃ bhiyyosomattāya cicciṭāyati ciṭiciṭāyati; evamevaṃ kho bhikkhave…pe… seyyathāpi, bhikkhave, gūthakūpo kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyosomattāya duggandho hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Evarūpo, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Taṃ kissa hetu? Akkoseyyapi maṃ paribhāseyyapi maṃ anatthampi maṃ kareyyāti. Tasmā evarūpo puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. ‘‘Katamo ca, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo. Evarūpo, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Kiñcāpi, bhikkhave, evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ kalyāṇo kittisaddo abbhuggacchati – ‘kalyāṇamitto purisapuggalo kalyāṇasahāyo kalyāṇasampavaṅko’ti. Tasmā evarūpo puggalo sevitabbo bhajitabbo payirupāsitabbo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti. ‘‘Nihīyati puriso nihīnasevī, Na ca hāyetha kadāci tulyasevī; Seṭṭhamupanamaṃ udeti khippaṃ, Tasmā attano uttariṃ bhajethā’’ti. sattamaṃ;",
      "english": "Monks, there are these three types of individuals found existing in the world. Which three? Monks, there is an individual who is to be avoided with revulsion, not associated with, not cultivated, and not attended upon. Monks, there is an individual who is to be overlooked, not associated with, not cultivated, and not attended upon. Monks, there is an individual who is to be associated with, cultivated, and attended upon.\n\nAnd what kind of individual, monks, is to be avoided with revulsion, not associated with, not cultivated, and not attended upon? Here, monks, a certain individual is immoral, of evil nature, impure, of suspect conduct, one whose deeds are concealed; not a true ascetic but claiming to be one; not leading a holy life but claiming to lead one; inwardly rotten, oozing corruption, born of refuse. Such an individual, monks, is to be avoided with revulsion, not associated with, not cultivated, and not attended upon. And for what reason? Even if, monks, one does not adopt the views or conduct of such an individual, nevertheless, a bad reputation spreads about oneself: 'This person is one who has evil friends, evil companions, evil associates.' Just as, monks, a snake fallen into a cesspit, even if it does not bite one, still defiles one; in the same way, monks, even if one does not adopt the views or conduct of such an individual, nevertheless, a bad reputation spreads about oneself: 'This person is one who has evil friends, evil companions, evil associates.' Therefore, such an individual is to be avoided with revulsion, not associated with, not cultivated, and not attended upon.\n\nAnd what kind of individual, monks, is to be overlooked, not associated with, not cultivated, and not attended upon? Here, monks, a certain individual is irascible and prone to vexation; even if spoken to a little, he becomes angry, enraged, malevolent, and stubbornly resentful, and displays anger, hatred, and dissatisfaction.\n\nJust as, monks, an infected sore, when struck with a stick or a potsherd, exudes even more pus; in the same way, monks, a certain individual is irascible and prone to vexation; even if spoken to a little, he becomes angry, enraged, malevolent, and stubbornly resentful, and displays anger, hatred, and dissatisfaction. Just as, monks, a half-burnt tinduka log, when poked with a stick or a potsherd, crackles and sputters even more; in the same way, monks, a certain individual is irascible and prone to vexation; even if spoken to a little, he becomes angry, enraged, malevolent, and stubbornly resentful, and displays anger, hatred, and dissatisfaction. Just as, monks, a cesspool, when stirred with a stick or a potsherd, becomes even more foul-smelling; in the same way, monks, here a certain individual is irascible and prone to vexation; even if spoken to a little, he becomes angry, enraged, malevolent, and stubbornly resentful, and displays anger, hatred, and dissatisfaction. Such an individual, monks, is to be overlooked, not associated with, not cultivated, and not attended upon. And for what reason? He might abuse me, he might revile me, he might cause me harm. Therefore, such an individual is to be overlooked, not associated with, not cultivated, and not attended upon.\n\nAnd what kind of individual, monks, is to be associated with, cultivated, and attended upon? Here, monks, a certain individual is virtuous and of noble nature. Such an individual, monks, is to be associated with, cultivated, and attended upon. And for what reason? Even if, monks, one does not adopt the views or conduct of such an individual, nevertheless, a good reputation spreads about oneself: 'This person is one who has noble friends, noble companions, noble associates.' Therefore, such an individual is to be associated with, cultivated, and attended upon. Monks, these are the three types of individuals found existing in the world.\n\nA person who associates with inferiors degenerates;\nOne who associates with equals never declines;\nOne who attends upon superiors swiftly rises.\nTherefore, one should cultivate those who are superior to oneself.",
      "sinhala": "භික්ෂූනි, මේ ලෝකයෙහි පවත්නා, වැඩසිටින පුද්ගලයෝ තිදෙනෙක් වෙති. ඒ තිදෙනා කවරහුද? භික්ෂූනි, ගැරහිය යුතු, නො ඇසුරු කළ යුතු, නො සේවනය කළ යුතු, නො පිහිට පැතිය යුතු පුද්ගලයෙක් වෙයි. භික්ෂූනි, නොසලකා හැරිය යුතු, නො ඇසුරු කළ යුතු, නො සේවනය කළ යුතු, නො පිහිට පැතිය යුතු පුද්ගලයෙක් වෙයි. භික්ෂූනි, ඇසුරු කළ යුතු, සේවනය කළ යුතු, පිහිට පැතිය යුතු පුද්ගලයෙක් වෙයි.\n\nභික්ෂූනි, ගැරහිය යුතු, නො ඇසුරු කළ යුතු, නො සේවනය කළ යුතු, නො පිහිට පැතිය යුතු පුද්ගලයා කවරෙක්ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් දුස්සීල වෙයි, පාපී ස්වභාව ඇත්තෙක් වෙයි, අපිරිසිදු වෙයි, සැක සහිත පැවතුම් ඇත්තෙක් වෙයි, රහසිගත කර්මාන්ත ඇත්තෙක් වෙයි, මහණෙක් නොවී මහණෙකැයි ප්‍රතිඥා දෙන්නෙක් වෙයි, බඹසර නොරැක බඹසර රකිනෙකැයි ප්‍රතිඥා දෙන්නෙක් වෙයි, අභ්‍යන්තරයෙන් දූෂිත වූ, කාන්දුවීම් සහිත වූ, කුණු කසළෙන් පිරුණු පුද්ගලයෙක් වෙයි. භික්ෂූනි, මෙබඳු පුද්ගලයා ගැරහිය යුතු ය, නො ඇසුරු කළ යුතු ය, නො සේවනය කළ යුතු ය, නො පිහිට පැතිය යුතු ය. ඒ කුමන කරුණක් නිසාද? භික්ෂූනි, යම් හෙයකින් මෙබඳු පුද්ගලයකුගේ දෘෂ්ටිය අනුගමනය නොකළ ද, එසේ වුවත් ‘මෙය පාපී මිත්‍රත්වයක් ඇති, පාපී සහාය ඇති, පාපී ඇසුරක් ඇති පුද්ගලයෙකි’ යන නපුරු කීර්ති රාවයක් ඒ පුද්ගලයාට පැතිරෙයි. භික්ෂූනි, යම්සේ අසූචිවලට වැටුණු සර්පයෙක් දෂ්ට නොකළ ද, එය (ඔහුගේ ශරීරය) අපිරිසිදු කරන්නේ ද, භික්ෂූනි, එපරිද්දෙන්ම යම් හෙයකින් මෙබඳු පුද්ගලයකුගේ දෘෂ්ටිය අනුගමනය නොකළ ද, එසේ වුවත් ‘මෙය පාපී මිත්‍රත්වයක් ඇති, පාපී සහාය ඇති, පාපී ඇසුරක් ඇති පුද්ගලයෙකි’ යන නපුරු කීර්ති රාවයක් ඒ පුද්ගලයාට පැතිරෙයි. එබැවින් මෙබඳු පුද්ගලයා ගැරහිය යුතු ය, නො ඇසුරු කළ යුතු ය, නො සේවනය කළ යුතු ය, නො පිහිට පැතිය යුතු ය.\n\nභික්ෂූනි, නොසලකා හැරිය යුතු, නො ඇසුරු කළ යුතු, නො සේවනය කළ යුතු, නො පිහිට පැතිය යුතු පුද්ගලයා කවරෙක්ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ක්‍රෝධයෙන් යුක්ත වෙයි, ක්ලේශයන්ගෙන් පිරුණු බොහෝ දේ ඇත්තෙක් වෙයි, ස්වල්පයක් හෝ යම් දෙයක් කී විට ද්වේෂ කරයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, (අප්‍රසන්නව) සිටියි, ක්‍රෝධය ද, ද්වේෂය ද, අප්‍රසාදය ද ප්‍රකට කරයි. භික්ෂූනි, යම්සේ දරුණු තුවාලයක් දණ්ඩකින් හෝ කැටකින් ඇනීමෙන් තව තවත් සැරව ගලවන්නේ ද, භික්ෂූනි, එපරිද්දෙන්ම මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ක්‍රෝධයෙන් යුක්ත වෙයි, ක්ලේශයන්ගෙන් පිරුණු බොහෝ දේ ඇත්තෙක් වෙයි, ස්වල්පයක් හෝ යම් දෙයක් කී විට ද්වේෂ කරයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, (අප්‍රසන්නව) සිටියි, ක්‍රෝධය ද, ද්වේෂය ද, අප්‍රසාදය ද ප්‍රකට කරයි. භික්ෂූනි, යම්සේ ඇහැල දැව ගිනි පුපුරක් දණ්ඩකින් හෝ කැටකින් ඇනීමෙන් තව තවත් සිසිලයි, චිටි චිටි හඬ නඟන්නේ ද, භික්ෂූනි, එපරිද්දෙන්ම මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ක්‍රෝධයෙන් යුක්ත වෙයි, ක්ලේශයන්ගෙන් පිරුණු බොහෝ දේ ඇත්තෙක් වෙයි, ස්වල්පයක් හෝ යම් දෙයක් කී විට ද්වේෂ කරයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, (අප්‍රසන්නව) සිටියි, ක්‍රෝධය ද, ද්වේෂය ද, අප්‍රසාදය ද ප්‍රකට කරයි. භික්ෂූනි, යම්සේ අසූචි වළක් දණ්ඩකින් හෝ කැටකින් ඇනීමෙන් තව තවත් දුර්ගන්ධයක් නඟන්නේ ද, භික්ෂූනි, එපරිද්දෙන්ම මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් ක්‍රෝධයෙන් යුක්ත වෙයි, ක්ලේශයන්ගෙන් පිරුණු බොහෝ දේ ඇත්තෙක් වෙයි, ස්වල්පයක් හෝ යම් දෙයක් කී විට ද්වේෂ කරයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, (අප්‍රසන්නව) සිටියි, ක්‍රෝධය ද, ද්වේෂය ද, අප්‍රසාදය ද ප්‍රකට කරයි. භික්ෂූනි, මෙබඳු පුද්ගලයා නොසලකා හැරිය යුතු ය, නො ඇසුරු කළ යුතු ය, නො සේවනය කළ යුතු ය, නො පිහිට පැතිය යුතු ය. ඒ කුමන කරුණක් නිසාද? ‘(මා ඇසුරු කළහොත්) ඔහු මට බැණ වදිනු ඇත, මට පරිභව කරනු ඇත, මට අනර්ථයක් කරනු ඇතැයි’ යන බිය නිසා. එබැවින් මෙබඳු පුද්ගලයා නොසලකා හැරිය යුතු ය, නො ඇසුරු කළ යුතු ය, නො සේවනය කළ යුතු ය, නො පිහිට පැතිය යුතු ය.\n\nභික්ෂූනි, ඇසුරු කළ යුතු, සේවනය කළ යුතු, පිහිට පැතිය යුතු පුද්ගලයා කවරෙක්ද? භික්ෂූනි, මේ ශාසනයෙහි ඇතැම් පුද්ගලයෙක් සිල්වත් වෙයි, කල්‍යාණ ස්වභාව ඇත්තෙක් වෙයි. භික්ෂූනි, මෙබඳු පුද්ගලයා ඇසුරු කළ යුතු ය, සේවනය කළ යුතු ය, පිහිට පැතිය යුතු ය. ඒ කුමන කරුණක් නිසාද? භික්ෂූනි, යම් හෙයකින් මෙබඳු පුද්ගලයකුගේ දෘෂ්ටිය අනුගමනය නොකළ ද, එසේ වුවත් ‘මෙය කල්‍යාණ මිත්‍රත්වයක් ඇති, කල්‍යාණ සහාය ඇති, කල්‍යාණ ඇසුරක් ඇති පුද්ගලයෙකි’ යන යහපත් කීර්ති රාවයක් ඒ පුද්ගලයාට පැතිරෙයි. එබැවින් මෙබඳු පුද්ගලයා ඇසුරු කළ යුතු ය, සේවනය කළ යුතු ය, පිහිට පැතිය යුතු ය. භික්ෂූනි, මේ ලෝකයෙහි පවත්නා, වැඩසිටින පුද්ගලයෝ මේ තිදෙනාම වෙති.\n\nපහත් අය ඇසුරු කරන පුද්ගලයා පහතට වැටෙයි.\nසමාන අය ඇසුරු කරන්නා කිසි විටෙක පිරිහීමට පත් නොවෙයි.\nඋසස් අය සමීපයට යන්නා (එනම් ඇසුරු කරන්නා) ඉක්මනින් දියුණු වෙයි.\nඑබැවින් තමාට වඩා උසස් අය ඇසුරු කළ යුතු ය.",
      "paliTitle": "Jigucchitabbasuttaṃ"
    },
    {
      "number": 28,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Gūthabhāṇī, pupphabhāṇī, madhubhāṇī. Katamo ca, bhikkhave, puggalo gūthabhāṇī? Idha, bhikkhave, ekacco puggalo sabhaggato vā parisaggato vā [sabhāgato vā parisāgato vā (syā. kaṃ.)] ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti. So ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti, apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na passāmī’ti [ma. ni. 1.440; pu. pa. 91]; iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo gūthabhāṇī. ‘‘Katamo ca, bhikkhave, puggalo pupphabhāṇī? Idha, bhikkhave, ekacco puggalo sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ pajānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti; iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo pupphabhāṇī. ‘‘Katamo ca, bhikkhave, puggalo madhubhāṇī? Idha, bhikkhave, ekacco puggalo pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo madhubhāṇī. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ.",
      "english": "Monks, there are these three types of individuals found existing in the world. Which three? A deceptive speaker, a truthful speaker, and a sweet-spoken speaker.\n\nAnd which, Monks, is the individual who is a deceptive speaker? Here, Monks, a certain individual, having gone to an assembly, or a gathering, or among relatives, or among a guild, or among a royal court, is brought before them and questioned as a witness: 'Come, good sir, speak what you know.' He, not knowing, says 'I know'; or knowing, says 'I don't know'; or not seeing, says 'I see'; or seeing, says 'I don't see.' Thus, for his own sake, or for another's sake, or for the sake of some trifling material gain, he speaks a deliberate falsehood. This, Monks, is called an individual who is a deceptive speaker.\n\nAnd which, Monks, is the individual who is a truthful speaker? Here, Monks, a certain individual, having gone to an assembly, or a gathering, or among relatives, or among a guild, or among a royal court, is brought before them and questioned as a witness: 'Come, good sir, speak what you understand.' He, not knowing, says 'I don't know'; or knowing, says 'I know'; or not seeing, says 'I don't see'; or seeing, says 'I see.' Thus, for his own sake, or for another's sake, or for the sake of some trifling material gain, he does not speak a deliberate falsehood. This, Monks, is called an individual who is a truthful speaker.\n\nAnd which, Monks, is the individual who is a sweet-spoken speaker? Here, Monks, a certain individual, having abandoned harsh speech, refrains from harsh speech. He speaks such words that are gentle, pleasing to the ear, affectionate, heart-touching, courteous, dear to many, and agreeable to many. This, Monks, is called an individual who is a sweet-spoken speaker.\n\nThese, Monks, are the three types of individuals found existing in the world.",
      "sinhala": "භික්ෂූණි, මේ පුද්ගලයෝ තිදෙනෙක් ලෝකයෙහි සිටිති, පවතිති. ඒ කවර තිදෙනෙක්ද? ගූථභාණී, පුප්ඵභාණී, මධුභාණී යන පුද්ගලයන් තිදෙනාය. භික්ෂූණි, ගූථභාණී නම් වූ පුද්ගලයා කවරෙක්ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් සභාවක් වෙතට ගිය විට හෝ පිරිසක් වෙතට ගිය විට හෝ ඥාතීන් මැදට ගිය විට හෝ පූගයක් (සංවිධානයක්/සමූහයක්) මැදට ගිය විට හෝ රාජකීය පිරිසක් මැදට ගිය විට හෝ කැඳවනු ලැබ, සාක්ෂියක් ලෙස ප්‍රශ්න කරනු ලැබේ: ‘එම්බා පුරුෂය, යමක් ඔබ දන්නේ නම්, එය කියන්න’යි. ඔහු නොදන්නේ නම්, ‘මා දන්නා බව’ කියයි. දන්නේ නම්, ‘මා නොදන්නා බව’ කියයි. නොදකිනවා නම්, ‘මා දකින බව’ කියයි. දකිනවා නම්, ‘මා නොදකින බව’ කියයි. මෙසේ තමාගේ යහපත (ලාභය) නිසා හෝ අනුන්ගේ යහපත (ලාභය) නිසා හෝ කිසියම් අමිස ලාභයක් නිසා හෝ සිතා මතා බොරු කියනු ලැබේ. භික්ෂූණි, මේ පුද්ගලයා ගූථභාණී යැයි කියනු ලැබේ.\n\nභික්ෂූණි, පුප්ඵභාණී නම් වූ පුද්ගලයා කවරෙක්ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් සභාවක් වෙතට ගිය විට හෝ පිරිසක් වෙතට ගිය විට හෝ ඥාතීන් මැදට ගිය විට හෝ පූගයක් (සංවිධානයක්/සමූහයක්) මැදට ගිය විට හෝ රාජකීය පිරිසක් මැදට ගිය විට හෝ කැඳවනු ලැබ, සාක්ෂියක් ලෙස ප්‍රශ්න කරනු ලැබේ: ‘එම්බා පුරුෂය, යමක් ඔබ දන්නේ නම්, එය කියන්න’යි. ඔහු නොදන්නේ නම්, ‘මා නොදන්නා බව’ කියයි. දන්නේ නම්, ‘මා දන්නා බව’ කියයි. නොදකිනවා නම්, ‘මා නොදකින බව’ කියයි. දකිනවා නම්, ‘මා දකින බව’ කියයි. මෙසේ තමාගේ යහපත (ලාභය) නිසා හෝ අනුන්ගේ යහපත (ලාභය) නිසා හෝ කිසියම් අමිස ලාභයක් නිසා හෝ සිතා මතා බොරු කියනු නොලැබේ. භික්ෂූණි, මේ පුද්ගලයා පුප්ඵභාණී යැයි කියනු ලැබේ.\n\nභික්ෂූණි, මධුභාණී නම් වූ පුද්ගලයා කවරෙක්ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් රළු වචන අත්හැර, රළු වචන කීමෙන් වැළකී සිටියි. යම් ඒ වචනයක් මෘදුද, කනට ප්‍රියද, ප්‍රේමණීයද, හෘදයාංගමද, ශිෂ්ටසම්මතද, බොහෝ දෙනාට ප්‍රියමනාපද, බොහෝ දෙනාගේ සිත් සතුටු කරන්නක්ද, එබඳු වචන කථා කරයි. භික්ෂූණි, මේ පුද්ගලයා මධුභාණී යැයි කියනු ලැබේ. භික්ෂූණි, මේ පුද්ගලයෝ තිදෙනා ලෝකයෙහි සිටිති, පවතිති.",
      "paliTitle": "Gūthabhāṇīsuttaṃ"
    },
    {
      "number": 29,
      "pali": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Andho, ekacakkhu, dvicakkhu. Katamo ca, bhikkhave, puggalo andho? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ cakkhu na hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ adhigaccheyya adhigataṃ vā bhogaṃ phātiṃ kareyya [phātikareyya (sī.)]; tathārūpampissa cakkhu na hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya, sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo andho. ‘‘Katamo ca, bhikkhave, puggalo ekacakkhu? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ cakkhu hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ adhigaccheyya adhigataṃ vā bhogaṃ phātiṃ kareyya; tathārūpaṃ panassa [tathārūpampissa (syā. kaṃ. pī. ka.)] cakkhu na hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya, sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo ekacakkhu. ‘‘Katamo ca, bhikkhave, puggalo dvicakkhu? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ cakkhu hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ adhigaccheyya, adhigataṃ vā bhogaṃ phātiṃ kareyya; tathārūpampissa cakkhu hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya; sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo dvicakkhu. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti. ‘‘Na ceva bhogā tathārūpā, na ca puññāni kubbati; Ubhayattha kaliggāho, andhassa hatacakkhuno. ‘‘Athāparāyaṃ akkhāto, ekacakkhu ca puggalo; Dhammādhammena saṭhoso [saṃsaṭṭho (sī. syā. kaṃ. pī.), saṭhoti (ka.)], bhogāni pariyesati. ‘‘Theyyena kūṭakammena, musāvādena cūbhayaṃ; Kusalo hoti saṅghātuṃ [saṃhātuṃ (syā.)], kāmabhogī ca mānavo; Ito so nirayaṃ gantvā, ekacakkhu vihaññati. ‘‘Dvicakkhu pana akkhāto, seṭṭho purisapuggalo; Dhammaladdhehi bhogehi, uṭṭhānādhigataṃ dhanaṃ. ‘‘Dadāti seṭṭhasaṅkappo, abyaggamānaso naro; Upeti bhaddakaṃ ṭhānaṃ, yattha gantvā na socati. ‘‘Andhañca ekacakkhuñca, ārakā parivajjaye; Dvicakkhuṃ pana sevetha, seṭṭhaṃ purisapuggala’’nti. navamaṃ;",
      "english": "“Bhikkhus, these three types of individuals exist, are found in the world. Which three? The blind, the one-eyed, and the two-eyed.\n\n“And which, bhikkhus, is the blind individual? Here, bhikkhus, for a certain individual, there is no such eye with which they might acquire unacquired wealth or increase acquired wealth; nor is there such an eye with which they might discern wholesome and unwholesome phenomena, blameable and blameless phenomena, inferior and superior phenomena, and phenomena that are dark and bright with their counterparts. This, bhikkhus, is called the blind individual.\n\n“And which, bhikkhus, is the one-eyed individual? Here, bhikkhus, for a certain individual, there is such an eye with which they might acquire unacquired wealth or increase acquired wealth; but there is no such eye with which they might discern wholesome and unwholesome phenomena, blameable and blameless phenomena, inferior and superior phenomena, and phenomena that are dark and bright with their counterparts. This, bhikkhus, is called the one-eyed individual.\n\n“And which, bhikkhus, is the two-eyed individual? Here, bhikkhus, for a certain individual, there is such an eye with which they might acquire unacquired wealth or increase acquired wealth; and there is also such an eye with which they might discern wholesome and unwholesome phenomena, blameable and blameless phenomena, inferior and superior phenomena, and phenomena that are dark and bright with their counterparts. This, bhikkhus, is called the two-eyed individual. These, bhikkhus, are the three types of individuals existing, found in the world.”\n\nSuch wealth is not gained, nor are merits made by him; for the blind individual with lost vision, there is misfortune in both ways.\n\nThen there is this other, the one-eyed individual, described thus: He seeks wealth deceitfully, by both righteous and unrighteous means.\n\nBy theft, by fraud, and by lying as well, this human, enjoying sense pleasures, is skilled at accumulating. Having gone from here to hell, that one-eyed individual suffers.\n\nBut the two-eyed individual is declared the best type of person, with wealth obtained righteously, wealth acquired through diligent effort.\n\nThis person, with noble intentions and an unagitated mind, gives generously. He goes to a fortunate destination, where, having gone, he does not grieve.\n\nOne should keep far away from the blind and the one-eyed; but one should associate with the two-eyed, the best type of person.",
      "sinhala": "භික්ෂූනි, මේ පුද්ගලයන් තිදෙනෙක් ලෝකයෙහි සිටිති, පෙනී සිටිති. කවරහුද ඒ තිදෙනා? අන්ධයා, එක ඇස් ඇත්තා, සහ දෙඇස් ඇත්තා. භික්ෂූනි, අන්ධ පුද්ගලයා කවරෙක්ද?\n\nභික්ෂූනි, මෙහිලා සමහර පුද්ගලයෙකුට යම් ඇසකින් නොලැබූ භෝග සම්පත් ලබන්නේද, ලැබූ භෝග සම්පත් වැඩිය කරන්නේද, එබඳු ඇසක් නොමැත. තවද, යම් ඇසකින් කුසල අකුසල ධර්මයන් දන්නේද, වරද සහිත වූද, වරද රහිත වූද ධර්මයන් දන්නේද, හීන වූද ප්‍ර​ණීත වූද ධර්මයන් දන්නේද, කළු සහ සුදු පක්ෂයන්ට අයත් ධර්මයන් දන්නේද, එබඳු ධර්ම​ඥානයක් වන ඇසද ඔහුට නොමැත. භික්ෂූනි, මේ පුද්ගලයා අන්ධයා යැයි කියනු ලැබේ.\n\nභික්ෂූනි, එක ඇස් ඇත්තා වූ පුද්ගලයා කවරෙක්ද? භික්ෂූනි, මෙහිලා සමහර පුද්ගලයෙකුට යම් ඇසකින් නොලැබූ භෝග සම්පත් ලබන්නේද, ලැබූ භෝග සම්පත් වැඩිය කරන්නේද, එබඳු ඇසක් ඇත. එහෙත්, යම් ඇසකින් කුසල අකුසල ධර්මයන් දන්නේද, වරද සහිත වූද, වරද රහිත වූද ධර්මයන් දන්නේද, හීන වූද ප්‍ර​ණීත වූද ධර්මයන් දන්නේද, කළු සහ සුදු පක්ෂයන්ට අයත් ධර්මයන් දන්නේද, එබඳු ධර්ම​ඥානයක් වන ඇස ඔහුට නොමැත. භික්ෂූනි, මේ පුද්ගලයා එක ඇස් ඇත්තා යැයි කියනු ලැබේ.\n\nභික්ෂූනි, දෙඇස් ඇත්තා වූ පුද්ගලයා කවරෙක්ද? භික්ෂූනි, මෙහිලා සමහර පුද්ගලයෙකුට යම් ඇසකින් නොලැබූ භෝග සම්පත් ලබන්නේද, ලැබූ භෝග සම්පත් වැඩිය කරන්නේද, එබඳු ඇසක් ඇත. තවද, යම් ඇසකින් කුසල අකුසල ධර්මයන් දන්නේද, වරද සහිත වූද, වරද රහිත වූද ධර්මයන් දන්නේද, හීන වූද ප්‍ර​ණීත වූද ධර්මයන් දන්නේද, කළු සහ සුදු පක්ෂයන්ට අයත් ධර්මයන් දන්නේද, එබඳු ධර්ම​ඥානයක් වන ඇසද ඔහුට ඇත. භික්ෂූනි, මේ පුද්ගලයා දෙඇස් ඇත්තා යැයි කියනු ලැබේ. භික්ෂූනි, මේ පුද්ගලයන් තිදෙනාම ලෝකයෙහි සිටිති, පෙනී සිටිති.\n\nඔහුට එබඳු භෝග සම්පත්ද නැත, පින්ද නොකරයි.\nවිනාශ වූ ඇස් ඇති ඒ අන්ධයා දෙලොවදීම පරාජයට පත් වේ.\n\nතවද, එක ඇස් ඇත්තා වූ පුද්ගලයා දෙස බැලුවහොත්,\nඔහු දහමෙන්ද, අදහමෙන්ද මිශ්‍ර වී, භෝග සම්පත් සොයයි.\n\nසොරකමින්ද, වංචනික ක්‍රි​යාවලින්ද, මුසාවාදයෙන්ද යන දෙවර්ගයෙන්ම (භෝග සම්පත් උපයා ගැනීමට) දක්ෂ වූ, කම්සැප විඳින්නෙක් වූ ඒ මිනිසා,\nමෙලොවින් චුතව නිරයට ගොස්, එක ඇස් ඇත්තා වූ ඔහු දුක් විඳී.\n\nදෙඇස් ඇත්තා වූ පුද්ගලයා නම්, ශ්‍රේෂ්ඨ​ පුරුෂ පුද්ගලයා ලෙස කියනු ලැබේ.\nඔහු ධර්මයෙන් ලබන ලද භෝග සම්පත් වලින්ද, උත්සාහයෙන් උපයා ගත් ධනයෙන්ද,\n\nඋසස් අදහස් ඇති, නොකලබල වූ සිත් ඇති ඒ මිනිසා දන් දෙයි.\nඔහු සුගතියකට පැමිණෙයි, එහි ගොස් ශෝක නොකරයි.\n\nඅන්ධයා සහ එක ඇස් ඇත්තා දුරින්ම දුරු කළ යුතුය.\nඑහෙත්, ශ්‍රේෂ්ඨ​ පුරුෂ පුද්ගලයා වන දෙඇස් ඇත්තා ඇසුරු කළ යුතුය.",
      "paliTitle": "Andhasuttaṃ"
    },
    {
      "number": 30,
      "pali": "‘‘Tayome, bhikkhave [pu. pa. 107-108], puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Avakujjapañño puggalo, ucchaṅgapañño puggalo, puthupañño puggalo. Katamo ca, bhikkhave, avakujjapañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Seyyathāpi, bhikkhave, kumbho nikkujjo [nikkujjo (sī. pī.)] tatra udakaṃ āsittaṃ vivaṭṭati, no saṇṭhāti; evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya nevādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Ayaṃ vuccati, bhikkhave, avakujjapañño puggalo. ‘‘Katamo ca, bhikkhave, ucchaṅgapañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya nevādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Seyyathāpi, bhikkhave, purisassa ucchaṅge nānākhajjakāni ākiṇṇāni – tilā taṇḍulā modakā badarā. So tamhā āsanā vuṭṭhahanto satisammosā pakireyya. Evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Ayaṃ vuccati, bhikkhave, ucchaṅgapañño puggalo. ‘‘Katamo ca, bhikkhave, puthupañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Seyyathāpi, bhikkhave, kumbho ukkujjo tatra udakaṃ āsittaṃ saṇṭhāti no vivaṭṭati; evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Ayaṃ vuccati, bhikkhave, puthupañño puggalo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti. ‘‘Avakujjapañño puriso, dummedho avicakkhaṇo; Abhikkhaṇampi ce hoti, gantā bhikkhūna santike. ‘‘Ādiṃ kathāya majjhañca, pariyosānañca tādiso; Uggahetuṃ na sakkoti, paññā hissa na vijjati. ‘‘Ucchaṅgapañño puriso, seyyo etena vuccati; Abhikkhaṇampi ce hoti, gantā bhikkhūna santike. ‘‘Ādiṃ kathāya majjhañca, pariyosānañca tādiso; Nisinno āsane tasmiṃ, uggahetvāna byañjanaṃ; Vuṭṭhito nappajānāti, gahitaṃ hissa [gahitampissa (ka.)] mussati. ‘‘Puthupañño ca puriso, seyyo etehi [etena (ka.)] vuccati; Abhikkhaṇampi ce hoti, gantā bhikkhūna santike. ‘‘Ādiṃ kathāya majjhañca, pariyosānañca tādiso; Nisinno āsane tasmiṃ, uggahetvāna byañjanaṃ. ‘‘Dhāreti seṭṭhasaṅkappo, abyaggamānaso naro; Dhammānudhammappaṭipanno, dukkhassantakaro siyā’’ti. dasamaṃ; ",
      "english": "There are, monks, these three individuals existing, found in the world. Which three? An individual with overturned wisdom, an individual with wisdom like a lap-basket, an individual with extensive wisdom.\n\nAnd what, monks, is an individual with overturned wisdom? Here, monks, a certain individual goes often to a monastery to listen to the Dhamma from the bhikkhus. To him, the bhikkhus teach the Dhamma that is good in the beginning, good in the middle, good in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. While seated in that seat, he does not pay attention to the beginning of that talk, nor to the middle, nor to the end; and even after rising from that seat, he does not pay attention to the beginning of that talk, nor to the middle, nor to the end. Just as, monks, if a pot is overturned, and water poured into it pours out and does not remain; even so, monks, here a certain individual goes often to a monastery to listen to the Dhamma from the bhikkhus. To him, the bhikkhus teach the Dhamma that is good in the beginning, good in the middle, good in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. While seated in that seat, he does not pay attention to the beginning of that talk, nor to the middle, nor to the end; and even after rising from that seat, he does not pay attention to the beginning of that talk, nor to the middle, nor to the end. This, monks, is called an individual with overturned wisdom.\n\nAnd what, monks, is an individual with wisdom like a lap-basket? Here, monks, a certain individual goes often to a monastery to listen to the Dhamma from the bhikkhus. To him, the bhikkhus teach the Dhamma that is good in the beginning, good in the middle, good in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. While seated in that seat, he pays attention to the beginning of that talk, and to the middle, and to the end; but after rising from that seat, he does not pay attention to the beginning of that talk, nor to the middle, nor to the end. Just as, monks, if a man has various snacks scattered in his lap – sesame seeds, rice grains, sweetmeats, jujubes – when he rises from that seat, he would scatter them through forgetfulness. Even so, monks, here a certain individual goes often to a monastery to listen to the Dhamma from the bhikkhus. To him, the bhikkhus teach the Dhamma that is good in the beginning, good in the middle, good in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. While seated in that seat, he pays attention to the beginning of that talk, and to the middle, and to the end; but after rising from that seat, he does not pay attention to the beginning of that talk, nor to the middle, nor to the end. This, monks, is called an individual with wisdom like a lap-basket.\n\nAnd what, monks, is an individual with extensive wisdom? Here, monks, a certain individual goes often to a monastery to listen to the Dhamma from the bhikkhus. To him, the bhikkhus teach the Dhamma that is good in the beginning, good in the middle, good in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. While seated in that seat, he pays attention to the beginning of that talk, and to the middle, and to the end; and even after rising from that seat, he pays attention to the beginning of that talk, and to the middle, and to the end. Just as, monks, if a pot is upright, and water poured into it remains and does not pour out; even so, monks, here a certain individual goes often to a monastery to listen to the Dhamma from the bhikkhus. To him, the bhikkhus teach the Dhamma that is good in the beginning, good in the middle, good in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. While seated in that seat, he pays attention to the beginning of that talk, and to the middle, and to the end; and even after rising from that seat, he pays attention to the beginning of that talk, and to the middle, and to the end. This, monks, is called an individual with extensive wisdom.\n\nThese, monks, are the three individuals existing, found in the world.\n\nA person with overturned wisdom, foolish and lacking discernment,\nEven if he often goes to the bhikkhus’ presence,\nThe beginning of a talk, its middle, and its end, such a one\nIs unable to grasp, for wisdom does not exist in him.\n\nA person of shallow understanding is characterized by this: even if he frequently visits the monastics.\n\nSuch a one attends the discourse from its beginning, through its middle, to its end. Seated on that seat, having grasped the meaning, when he rises, he does not comprehend, for what he has grasped becomes forgotten by him.\n\nAnd a person of profound understanding is superior to such individuals because of this: even if he frequently visits the monastics.\n\nSuch a one also attends the discourse from its beginning, through its middle, to its end. Seated on that seat, he grasps the meaning.\n\nA person with a noble intention and an undistracted mind retains what he has heard. One who practices in accordance with the Dhamma may truly bring about the end of suffering.",
      "sinhala": "මහණෙනි, මේ ලෝකයෙහි පුද්ගලයෝ තිදෙනෙක් සිටිති, පවතිති. කවරහුද ඒ තිදෙනා? අවකුජ්ජපඤ්ඤ පුද්ගලයා, උච්ඡංගපඤ්ඤ පුද්ගලයා, පුථුපඤ්ඤ පුද්ගලයා යනුයි.\n\nමහණෙනි, අවකුජ්ජපඤ්ඤ පුද්ගලයා කවරෙක්ද? මහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් නිතර නිතර භික්ෂූන් වහන්සේලා වෙත ධර්ම ශ්‍රවණය සඳහා ආරාමයට යන්නේ වෙයි. භික්ෂූන් වහන්සේලා ඔහුට මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන (ප්‍රකාශන) සහිත වූ, මුළුල්ලින්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව (ධර්මය) දේශනා කරති. ඔහු ඒ ආසනයෙහි හිඳගෙන සිටිද්දී ඒ කථාවෙහි මුල හෝ මෙනෙහි නොකරයි, මැද හෝ මෙනෙහි නොකරයි, කෙළවර හෝ මෙනෙහි නොකරයි. ඒ ආසනයෙන් නැගිට ගියද ඒ කථාවෙහි මුල හෝ මෙනෙහි නොකරයි, මැද හෝ මෙනෙහි නොකරයි, කෙළවර හෝ මෙනෙහි නොකරයි. මහණෙනි, යම්සේ යටිකුරු කළ කළයක් (බඳුනක්) වේද, එහි වතුර වත් කළ කල්හි එය පිටතට පෙරළී යයි, රැඳී නොසිටියි. මහණෙනි, එපරිද්දෙන්ම මෙහිලා එක්තරා පුද්ගලයෙක් නිතර නිතර භික්ෂූන් වහන්සේලා වෙත ධර්ම ශ්‍රවණය සඳහා ආරාමයට යන්නේ වෙයි. භික්ෂූන් වහන්සේලා ඔහුට මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන (ප්‍රකාශන) සහිත වූ, මුළුල්ලින්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව දේශනා කරති. ඔහු ඒ ආසනයෙහි හිඳගෙන සිටිද්දී ඒ කථාවෙහි මුල හෝ මෙනෙහි නොකරයි, මැද හෝ මෙනෙහි නොකරයි, කෙළවර හෝ මෙනෙහි නොකරයි. ඒ ආසනයෙන් නැගිට ගියද ඒ කථාවෙහි මුල හෝ මෙනෙහි නොකරයි, මැද හෝ මෙනෙහි නොකරයි, කෙළවර හෝ මෙනෙහි නොකරයි. මහණෙනි, මොහු අවකුජ්ජපඤ්ඤ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, උච්ඡංගපඤ්ඤ පුද්ගලයා කවරෙක්ද? මහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් නිතර නිතර භික්ෂූන් වහන්සේලා වෙත ධර්ම ශ්‍රවණය සඳහා ආරාමයට යන්නේ වෙයි. භික්ෂූන් වහන්සේලා ඔහුට මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන (ප්‍රකාශන) සහිත වූ, මුළුල්ලින්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව දේශනා කරති. ඔහු ඒ ආසනයෙහි හිඳගෙන සිටිද්දී ඒ කථාවෙහි මුලද මෙනෙහි කරයි, මැදද මෙනෙහි කරයි, කෙළවරද මෙනෙහි කරයි. එහෙත් ඒ ආසනයෙන් නැගිට ගිය විට ඒ කථාවෙහි මුල හෝ මෙනෙහි නොකරයි, මැද හෝ මෙනෙහි නොකරයි, කෙළවර හෝ මෙනෙහි නොකරයි. මහණෙනි, යම්සේ පුරුෂයෙකුගේ උකුලෙහි තල, හාල්, මෝදක (කැවිලි), දොඹ (බෙලි) වැනි නොයෙකුත් කෑම වර්ග විසිරී තිබුණාද, ඔහු ඒ ආසනයෙන් නැගිටින කල්හි සිහි නැතිකම නිසා ඒවා විසිරී යයි. මහණෙනි, එපරිද්දෙන්ම මෙහිලා එක්තරා පුද්ගලයෙක් නිතර නිතර භික්ෂූන් වහන්සේලා වෙත ධර්ම ශ්‍රවණය සඳහා ආරාමයට යන්නේ වෙයි. භික්ෂූන් වහන්සේලා ඔහුට මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන (ප්‍රකාශන) සහිත වූ, මුළුල්ලින්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව දේශනා කරති. ඔහු ඒ ආසනයෙහි හිඳගෙන සිටිද්දී ඒ කථාවෙහි මුලද මෙනෙහි කරයි, මැදද මෙනෙහි කරයි, කෙළවරද මෙනෙහි කරයි. එහෙත් ඒ ආසනයෙන් නැගිට ගිය විට ඒ කථාවෙහි මුල හෝ මෙනෙහි නොකරයි, මැද හෝ මෙනෙහි නොකරයි, කෙළවර හෝ මෙනෙහි නොකරයි. මහණෙනි, මොහු උච්ඡංගපඤ්ඤ පුද්ගලයා යැයි කියනු ලැබේ.\n\nමහණෙනි, පුථුපඤ්ඤ පුද්ගලයා කවරෙක්ද? මහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් නිතර නිතර භික්ෂූන් වහන්සේලා වෙත ධර්ම ශ්‍රවණය සඳහා ආරාමයට යන්නේ වෙයි. භික්ෂූන් වහන්සේලා ඔහුට මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන (ප්‍රකාශන) සහිත වූ, මුළුල්ලින්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව දේශනා කරති. ඔහු ඒ ආසනයෙහි හිඳගෙන සිටිද්දී ඒ කථාවෙහි මුලද මෙනෙහි කරයි, මැදද මෙනෙහි කරයි, කෙළවරද මෙනෙහි කරයි. ඒ ආසනයෙන් නැගිට ගියද ඒ කථාවෙහි මුලද මෙනෙහි කරයි, මැදද මෙනෙහි කරයි, කෙළවරද මෙනෙහි කරයි. මහණෙනි, යම්සේ උඩුකුරු කළ කළයක් (බඳුනක්) වේද, එහි වතුර වත් කළ කල්හි එය රැඳී සිටියි, පිටතට පෙරළී නොයයි. මහණෙනි, එපරිද්දෙන්ම මෙහිලා එක්තරා පුද්ගලයෙක් නිතර නිතර භික්ෂූන් වහන්සේලා වෙත ධර්ම ශ්‍රවණය සඳහා ආරාමයට යන්නේ වෙයි. භික්ෂූන් වහන්සේලා ඔහුට මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන (ප්‍රකාශන) සහිත වූ, මුළුල්ලින්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව දේශනා කරති. ඔහු ඒ ආසනයෙහි හිඳගෙන සිටිද්දී ඒ කථාවෙහි මුලද මෙනෙහි කරයි, මැදද මෙනෙහි කරයි, කෙළවරද මෙනෙහි කරයි. ඒ ආසනයෙන් නැගිට ගියද ඒ කථාවෙහි මුලද මෙනෙහි කරයි, මැදද මෙනෙහි කරයි, කෙළවරද මෙනෙහි කරයි. මහණෙනි, මොහු පුථුපඤ්ඤ පුද්ගලයා යැයි කියනු ලැබේ. මහණෙනි, මේ පුද්ගලයෝ තිදෙනා ලෝකයෙහි සිටිති, පවතිති.\n\nඅවකුජ්ජපඤ්ඤ නම් වූ පුද්ගලයා, දුර්මති වූ, නුවණ නැති කෙනෙකි.\nඔහු නිතර නිතර භික්ෂූන් වහන්සේලා වෙත යන්නේ වුවද,\nඒ වැනි පුද්ගලයා කථාවෙහි මුලද, මැදද, කෙළවරද,\nඋගෙනීමට නොහැකි වෙයි. මන්ද, ඔහුට ප්‍රඥාවක් නැත්තේය.\n\nනොගැඹුරු ප්‍රඥාව ඇති පුද්ගලයෙක්, භික්ෂූන් වහන්සේලා වෙත නිතර නිතර යන්නේ වුවද, මේ හේතුවෙන් උසස් යැයි කියනු ලැබුවද, දේශනාවේ මුල, මැද සහ අග කොටස් අසා සිටින්නේ එබඳු ය. ඒ අසුනේ වාඩි වී වචන පමණක් ග්‍රහණය කරගෙන, නැගිට ගිය පසු ඔහුට කිසිවක් වැටහෙන්නේ නැත; මක්නිසාද යත් ඔහු ග්‍රහණය කරගත් දේ අමතක වන බැවිනි.\n\nඑහෙත් විශාල ප්‍රඥාව ඇති පුද්ගලයා නම්, මේ හේතුවෙන් සැබවින්ම උසස් යැයි කියනු ලැබේ. භික්ෂූන් වහන්සේලා වෙත නිතර නිතර යන්නේ වුවද, දේශනාවේ මුල, මැද සහ අග කොටස් අසා සිටින්නේ එබඳු ය. ඒ අසුනේ වාඩි වී වචන මනාව ග්‍රහණය කරගෙන, ශ්‍රේෂ්ඨ අධිෂ්ඨානයෙන් යුතුව ඒවා ධාරණය කරන, අවිසිරුණු සිත් ඇති ඒ පුද්ගලයා ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටින්නෙක් වන්නේය. ඔහු දුක කෙළවර කරන්නෙක් විය හැකියි.",
      "paliTitle": "Avakujjasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Puggalavaggo tatiyo. Tassuddānaṃ – Samiddha [kāyasakkhi (sī.), saviṭṭha (syā. kaṃ.), seṭṭha (ka.)] -gilāna-saṅkhārā, bahukārā vajirena ca; Sevi-jiguccha-gūthabhāṇī, andho ca avakujjatāti.",
    "english": "",
    "sinhala": ""
  }
}