{
  "id": "an3.4",
  "title": {
    "pali": "Devadūtavaggo",
    "english": "The Chapter on the Divine Messengers",
    "sinhala": "දේවදූත වග්ගය"
  },
  "sections": [
    {
      "number": 31,
      "pali": "‘‘Sabrahmakāni, bhikkhave, tāni kulāni yesaṃ puttānaṃ mātāpitaro ajjhāgāre pūjitā honti. Sapubbācariyakāni, bhikkhave, tāni kulāni yesaṃ puttānaṃ mātāpitaro ajjhāgāre pūjitā honti. Sāhuneyyāni, bhikkhave, tāni kulāni yesaṃ puttānaṃ mātāpitaro ajjhāgāre pūjitā honti. ‘Brahmā’ti, bhikkhave, mātāpitūnaṃ etaṃ adhivacanaṃ. ‘Pubbācariyā’ti, bhikkhave, mātāpitūnaṃ etaṃ adhivacanaṃ. ‘Āhuneyyā’ti, bhikkhave, mātāpitūnaṃ etaṃ adhivacanaṃ. Taṃ kissa hetu? Bahukārā, bhikkhave, mātāpitaro puttānaṃ, āpādakā posakā, imassa lokassa dassetāroti. ‘‘Brahmāti mātāpitaro, pubbācariyāti vuccare; Āhuneyyā ca puttānaṃ, pajāya anukampakā. ‘‘Tasmā hi ne namasseyya, sakkareyya ca paṇḍito; Annena atha pānena, vatthena sayanena ca; Ucchādanena nhāpanena [nahāpanena (sī.)], pādānaṃ dhovanena ca. ‘‘Tāya naṃ pāricariyāya, mātāpitūsu paṇḍitā; Idheva [idha ceva (sī.)] naṃ pasaṃsanti, pecca sagge pamodatī’’ti [sagge ca modatīti (sī.)",
      "english": "Monks, those families where parents are honored in the home by their children are families where Brahma is present. Monks, those families where parents are honored in the home by their children are families where former teachers are present. Monks, those families where parents are honored in the home by their children are families where those worthy of offerings are present. Monks, 'Brahma' is an appellation for parents. Monks, 'former teachers' is an appellation for parents. Monks, 'those worthy of offerings' is an appellation for parents. For what reason? Monks, parents are great benefactors to their children: they nourish and rear them, and they introduce them to this world.\n\nParents are called Brahma, and former teachers; they are worthy of offerings for their children, compassionate to their offspring. Therefore, a wise person should pay homage to them and honor them with food, drink, clothes, and bedding; with anointing, bathing, and washing their feet. By such devoted service to parents, wise people praise him in this very world, and after passing away, he rejoices in a heavenly realm.",
      "sinhala": "භික්ෂූනි, යම් පුත්‍රයන්ගේ මව්පියන් නිවසෙහි පුදනු ලැබ සිටිත්ද, ඒ කුලයන් බ්‍රහ්මයන් සහිත කුලයන් වන්නේය. භික්ෂූනි, යම් පුත්‍රයන්ගේ මව්පියන් නිවසෙහි පුදනු ලැබ සිටිත්ද, ඒ කුලයන් පූර්වාචාර්යයන් සහිත කුලයන් වන්නේය. භික්ෂූනි, යම් පුත්‍රයන්ගේ මව්පියන් නිවසෙහි පුදනු ලැබ සිටිත්ද, ඒ කුලයන් ආහුණෙය්‍යයන් සහිත කුලයන් වන්නේය. භික්ෂූනි, ‘බ්‍රහ්මා’ යනු මව්පියන්ට කියනු ලබන අධිවචනයකි. භික්ෂූනි, ‘පූර්වාචාර්යයෝ’ යනු මව්පියන්ට කියනු ලබන අධිවචනයකි. භික්ෂූනි, ‘ආහුණෙය්‍යයෝ’ යනු මව්පියන්ට කියනු ලබන අධිවචනයකි. එයට හේතුව කුමක්ද? භික්ෂූනි, මව්පියෝ දරුවන්ට මහත් උපකාර ඇත්තෝය. ඔවුහු දරුවන් ඇති කරන්නෝය, පෝෂණය කරන්නෝය, මේ ලෝකය පෙන්වන්නෝය.\n\nමව්පියෝ බ්‍රහ්මයා ලෙසද, පූර්වාචාර්යවරුන් ලෙසද හඳුන්වනු ලබති.\nදරුවන්ට ආහුණෙය්‍යයෝද, ප්‍රජාවට අනුකම්පා ඇත්තෝද වෙති.\n\nඑබැවින් නුවණැත්තා ඔවුන්ට නමස්කාර කළ යුතුය. ගෞරව කළ යුතුය.\nඅන්නපානයෙන්ද, වස්ත්‍ර සයනයෙන්ද, ඇඟගල්වා තැවරීමෙන්ද, නැහැවීමෙන්ද, පා සේදීමෙන්ද (සත්කාර කළ යුතුය).\n\nමව්පියන්ට කරන ඒ සත්කාරයෙන් නුවණැත්තෝ මේ ජීවිතයේදීම ඔහු ප්‍රශංසා කරති. මිය පරලොව ගිය පසු දෙව්ලොවදී සතුටු වන්නේය.",
      "paliTitle": "Sabrahmakasuttaṃ",
      "englishTitle": "The Discourse on Living with Brahma",
      "sinhalaTitle": "සබ්‍රහ්මක සූත්‍රය"
    },
    {
      "number": 32,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Siyā nu kho, bhante, bhikkhuno tathārūpo samādhipaṭilābho yathā imasmiñca saviññāṇake kāye ahaṅkāramamaṅkāramānānusayā nāssu, bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā nāssu; yañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharato ahaṅkāramamaṅkāramānānusayā na honti tañca cetovimuttiṃ paññāvimuttiṃ upasampajja vihareyyā’’ti? ‘‘Siyā, ānanda, bhikkhuno tathārūpo samādhipaṭilābho yathā imasmiñca saviññāṇake kāye ahaṅkāramamaṅkāramānānusayā nāssu, bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā nāssu; yañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharato ahaṅkāramamaṅkāramānānusayā na honti tañca cetovimuttiṃ paññāvimuttiṃ upasampajja vihareyyā’’ti. ‘‘Yathā kathaṃ pana, bhante, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā imasmiñca saviññāṇake kāye ahaṅkāramamaṅkāramānānusayā nāssu, bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā nāssu; yañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharato ahaṅkāramamaṅkāramānānusayā na honti tañca cetovimuttiṃ paññāvimuttiṃ upasampajja vihareyyā’’ti? ‘‘Idhānanda, bhikkhuno evaṃ hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, ānanda, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā imasmiñca saviññāṇake kāye ahaṅkāramamaṅkāramānānusayā nāssu, bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā nāssu; yañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharato ahaṅkāramamaṅkāramānānusayā na honti tañca cetovimuttiṃ paññāvimuttiṃ upasampajja vihareyyā’’ti. ‘‘Idañca pana metaṃ, ānanda, sandhāya bhāsitaṃ pārāyane puṇṇakapañhe – ‘‘Saṅkhāya lokasmiṃ paroparāni [parovarāni (sī. pī.) su. ni. 1054; cūḷani. puṇṇakamāṇavapucchā 73], Yassiñjitaṃ natthi kuhiñci loke; Santo vidhūmo anīgho [anigho (sī. syā. kaṃ. pī.), anagho (?)] nirāso, Atāri so jātijaranti brūmī’’ti. dutiyaṃ;",
      "english": "Then, the venerable Ānanda approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, the venerable Ānanda said this to the Blessed One: \"Is it possible, Venerable Sir, for a monk to achieve such a state of concentration that, in this conscious body, there are no latent tendencies of 'I-making', 'mine-making', and conceit, and externally in all phenomena, there are likewise no latent tendencies of 'I-making', 'mine-making', and conceit; and that, having entered and dwelt in the liberation of mind and liberation through wisdom, in which there are no latent tendencies of 'I-making', 'mine-making', and conceit, he would continue to dwell in that very liberation of mind and liberation through wisdom?\"\n\n\"It is possible, Ānanda, for a monk to achieve such a state of concentration that, in this conscious body, there are no latent tendencies of 'I-making', 'mine-making', and conceit, and externally in all phenomena, there are likewise no latent tendencies of 'I-making', 'mine-making', and conceit; and that, having entered and dwelt in the liberation of mind and liberation through wisdom, in which there are no latent tendencies of 'I-making', 'mine-making', and conceit, he would continue to dwell in that very liberation of mind and liberation through wisdom.\"\n\n\"But how, Venerable Sir, would it be possible for a monk to achieve such a state of concentration that, in this conscious body, there are no latent tendencies of 'I-making', 'mine-making', and conceit, and externally in all phenomena, there are likewise no latent tendencies of 'I-making', 'mine-making', and conceit; and that, having entered and dwelt in the liberation of mind and liberation through wisdom, in which there are no latent tendencies of 'I-making', 'mine-making', and conceit, he would continue to dwell in that very liberation of mind and liberation through wisdom?\"\n\n\"Here, Ānanda, a monk reflects thus: 'This is peaceful, this is sublime — namely, the calming of all fabrications, the relinquishing of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.' It is in this way, Ānanda, that a monk would achieve such a state of concentration that, in this conscious body, there are no latent tendencies of 'I-making', 'mine-making', and conceit, and externally in all phenomena, there are likewise no latent tendencies of 'I-making', 'mine-making', and conceit; and that, having entered and dwelt in the liberation of mind and liberation through wisdom, in which there are no latent tendencies of 'I-making', 'mine-making', and conceit, he would continue to dwell in that very liberation of mind and liberation through wisdom.\"\n\n\"Furthermore, Ānanda, it was with this in mind that I spoke in the Pārāyana, in Puṇṇaka's Question: 'Having discerned the higher and lower in the world, one whose wavering is nowhere in the world; peaceful, smokeless, without suffering, without hope— such a one, I declare, has crossed beyond birth and decay.'\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනාමාන කර එකත්පසෙක වැඩසිටියහ. එකත්පසෙක වැඩහිඳගෙන සිටි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “භාග්‍යවතුන් වහන්ස, යම් භික්ෂුවකට මේ සවිඤ්ඤාණක ශරීරයෙහිද, බාහිර සියලු අරමුණුවලද ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නැති වන පරිදි, එමෙන්ම ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කරන විට ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නොපවතින පරිදි, ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කළ හැකි ආකාරයේ සමාධි ලැබීමක් තිබිය හැකිද?”\n\n“ආනන්දය, යම් භික්ෂුවකට මේ සවිඤ්ඤාණක ශරීරයෙහිද, බාහිර සියලු අරමුණුවලද ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නැති වන පරිදි, එමෙන්ම ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කරන විට ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නොපවතින පරිදි, ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කළ හැකි ආකාරයේ සමාධි ලැබීමක් තිබිය හැක.” “භාග්‍යවතුන් වහන්ස, එසේනම් යම් භික්ෂුවකට මේ සවිඤ්ඤාණක ශරීරයෙහිද, බාහිර සියලු අරමුණුවලද ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නැති වන පරිදි, එමෙන්ම ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කරන විට ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නොපවතින පරිදි, ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කළ හැකි ආකාරයේ සමාධි ලැබීමක් තිබිය හැක්කේ කෙසේද?” “ආනන්දය, මේ ශාසනයෙහි භික්ෂුවකට මෙසේ සිතේ: ‘සියලු සංස්කාරයන් සංසිඳවීම, සියලු උපාධීන් අත්හැරීම, තෘෂ්ණාව ක්ෂය කිරීම, රාගයෙන් වෙන්වීම, නිරෝධය, නිර්වාණය යනු ශාන්ත වූත්, ප්‍රණීත වූත් ධර්මයයි.’ ආනන්දය, මේ ආකාරයෙන් යම් භික්ෂුවකට මේ සවිඤ්ඤාණක ශරීරයෙහිද, බාහිර සියලු අරමුණුවලද ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නැති වන පරිදි, එමෙන්ම ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කරන විට ‘මම වෙමි’ යන අහංකාරය, ‘මාගේය’ යන මමංකාරය, මානය යන අනුසය ධර්මයන් නොපවතින පරිදි, ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය උපදවාගෙන වාසය කළ හැකි ආකාරයේ සමාධි ලැබීමක් තිබිය හැක.” “ආනන්දය, මේ සම්බන්ධයෙන්ම පුණ්ණක මානවකයාගේ ප්‍රශ්නයෙහි පාරායන වග්ගයේ මෙසේ පවසා ඇත:\n\n‘මේ ලෝකයෙහි උසස් පහත් (හෙවත් සියලුම සංස්කාර ධර්මයන්ගේ ස්වභාවය) අවබෝධ කොටගෙන,\nයමෙකුට මේ ලෝකයෙහි කොතැනකවත් කිසිදු කම්පනයක් නැද්ද;\nහෙතෙම සන්සුන් වූයේ, කෙලෙස් දුමින් තොර වූයේ, දුකින් තොර වූයේ, තෘෂ්ණාවෙන් තොර වූයේ,\nඉපදීම හා ජරාව තරණය කළේයැයි අපි කියමු.’”",
      "paliTitle": "Ānandasuttaṃ",
      "englishTitle": "The Discourse to Ānanda",
      "sinhalaTitle": "ආනන්ද සූත්‍රය"
    },
    {
      "number": 33,
      "pali": "Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca – ‘‘saṃkhittenapi kho ahaṃ, sāriputta, dhammaṃ deseyyaṃ; vitthārenapi kho ahaṃ, sāriputta, dhammaṃ deseyyaṃ; saṃkhittavitthārenapi kho ahaṃ, sāriputta, dhammaṃ deseyyaṃ; aññātāro ca dullabhā’’ti. ‘‘Etassa, bhagavā, kālo, etassa, sugata, kālo yaṃ bhagavā saṃkhittenapi dhammaṃ deseyya, vitthārenapi dhammaṃ deseyya, saṃkhittavitthārenapi dhammaṃ deseyya. Bhavissanti dhammassa aññātāro’’ti. ‘‘Tasmātiha, sāriputta, evaṃ sikkhitabbaṃ – ‘imasmiñca saviññāṇake kāye ahaṅkāramamaṅkāramānānusayā na bhavissanti, bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā na bhavissanti, yañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharato ahaṅkāramamaṅkāramānānusayā na honti tañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharissāmā’ti. Evañhi kho, sāriputta, sikkhitabbaṃ. ‘‘Yato ca kho, sāriputta, bhikkhuno imasmiñca saviññāṇake kāye ahaṅkāramamaṅkāramānānusayā na honti, bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā na honti, yañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharato ahaṅkāramamaṅkāramānānusayā na honti tañca cetovimuttiṃ paññāvimuttiṃ upasampajja viharati; ayaṃ vuccati, sāriputta – ‘bhikkhu acchecchi [acchejji (syā. kaṃ. ka.)] taṇhaṃ, vivattayi [vāvattayi (sī. pī.)] saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassa’. Idañca pana metaṃ, sāriputta, sandhāya bhāsitaṃ pārāyane [pārāyaṇe (sī.)] udayapañhe – ‘‘Pahānaṃ kāmasaññānaṃ, domanassāna cūbhayaṃ; Thinassa ca panūdanaṃ, kukkuccānaṃ nivāraṇaṃ. ‘‘Upekkhāsatisaṃsuddhaṃ, dhammatakkapurejavaṃ; Aññāvimokkhaṃ pabrūmi, avijjāya pabhedana’’nti [su. ni. 1112; cūḷani. udayamāṇavapucchā 131]. tatiyaṃ;",
      "english": "Then, the Venerable Sāriputta approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. To Venerable Sāriputta, as he was sitting to one side, the Blessed One said this: \"Indeed, Sāriputta, I could teach the Dhamma concisely; I could teach the Dhamma extensively; I could teach the Dhamma both concisely and extensively; yet, those who understand are hard to find.\"\n\n\"Now is the time, Blessed One, now is the time, Fortunate One, for the Blessed One to teach the Dhamma concisely, to teach the Dhamma extensively, and to teach the Dhamma both concisely and extensively. There will be those who understand the Dhamma.\"\n\n\"Therefore, Sāriputta, you should train yourselves thus: 'In this conscious body, the latent tendencies of ego-making, possessiveness, and conceit will not arise; and in all external objects and signs, the latent tendencies of ego-making, possessiveness, and conceit will not arise; and we shall dwell having attained that liberation of mind and liberation through wisdom, by dwelling in which these latent tendencies of ego-making, possessiveness, and conceit do not arise.' Indeed, Sāriputta, you should train yourselves thus.\"\n\n\"When, Sāriputta, for a monk, the latent tendencies of ego-making, possessiveness, and conceit do not arise in this conscious body, and the latent tendencies of ego-making, possessiveness, and conceit do not arise in all external objects and signs, and he dwells having attained that liberation of mind and liberation through wisdom, by dwelling in which these latent tendencies of ego-making, possessiveness, and conceit do not arise—this monk, Sāriputta, is said to have 'cut off craving, overturned the fetters, and, through the complete eradication of conceit, has made an end to suffering.'\"\n\n\"And it was with reference to this, Sāriputta, that this was stated in Udaya's Questions in the Pārāyana: 'The abandoning of sensual perceptions, and of both kinds of dejection; the expulsion of sloth and torpor, the prevention of remorse. Pure through equanimity and mindfulness, foremost in the investigation of phenomena and reasoned thought—this I declare as liberation through ultimate knowledge, the breaking through of ignorance.'\"",
      "sinhala": "එවිට ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙකින් වැඩසිටියාහ. එකත්පසෙකින් වැඩසිටි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළසේක: \"ශාරිපුත්‍රය, මම ධර්මය සංක්ෂිප්තයෙන් ද දේශනා කරන්නෙමි; ශාරිපුත්‍රය, මම ධර්මය විස්තර වශයෙන් ද දේශනා කරන්නෙමි; ශාරිපුත්‍රය, මම ධර්මය සංක්ෂිප්තයෙන් ද විස්තර වශයෙන් ද දේශනා කරන්නෙමි. එහෙත් අවබෝධ කරගන්නෝ දුර්ලභ වෙත්.\" \"භාග්‍යවතුන් වහන්ස, මේ ඒ කාලයයි. සුගතයන් වහන්ස, මේ ඒ කාලයයි, භාග්‍යවතුන් වහන්සේ ධර්මය සංක්ෂිප්තයෙන් දේශනා කිරීමට ද, ධර්මය විස්තර වශයෙන් දේශනා කිරීමට ද, ධර්මය සංක්ෂිප්තයෙන් හා විස්තර වශයෙන් දේශනා කිරීමට ද. ධර්මය අවබෝධ කරගන්නෝ ඇති වන්නාහ.\" \"ශාරිපුත්‍රය, එහෙයින් මෙසේ හික්මිය යුතු ය: 'මෙම සවිඥාණක කයෙහි මමත්වය, මගේ ය යන හැඟීම හා මානයෙහි අනුසයෝ නොපවතීවා; බාහිර සියලු අරමුණු කෙරෙහි ද මමත්වය, මගේ ය යන හැඟීම හා මානයෙහි අනුසයෝ නොපවතීවා; යම් චේතෝවිමුක්තියක් හා ප්‍රඥාවිමුක්තියක් ලබා වසන්නාට මමත්වය, මගේ ය යන හැඟීම හා මානයෙහි අනුසයෝ නැත්තාහ. ඒ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය උපසම්පදා කරගෙන වසන්නෙමු' යි. ශාරිපුත්‍රය, මෙසේ ම හික්මිය යුතු ය.\"\n\nශාරිපුත්‍රය, යම් කලෙක භික්ෂුවකට මේ සවිඥාණක කයෙහි මමත්වය, මගේ ය යන හැඟීම හා මානයෙහි අනුසයෝ නොපවතී ද, බාහිර සියලු අරමුණු කෙරෙහි ද මමත්වය, මගේ ය යන හැඟීම හා මානයෙහි අනුසයෝ නොපවතී ද, යම් චේතෝවිමුක්තියක් හා ප්‍රඥාවිමුක්තියක් උපසම්පදා කරගෙන වසන්නාට මමත්වය, මගේ ය යන හැඟීම හා මානයෙහි අනුසයෝ නැත්තාහ. ඒ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය උපසම්පදා කරගෙන වසයි ද, ශාරිපුත්‍රය, මේ භික්ෂුව 'තණ්හාව සිඳලීය, සංයෝජන දුරු කළේය, මානය පිළිබඳ නිවැරදි අවබෝධයෙන් දුකට කෙළවර කළේය' යි කියනු ලැබේ. ශාරිපුත්‍රය, මම මේ දේශනාව පාරායන වග්ගයේ උදය මාණවක ප්‍රශ්නයෙහි සඳහන් කර ඇත්තෙමි.\n\n\"කාම සඤ්ඤා ප්‍රහීණ කිරීම ද, දොම්නස් දෙවර්ගය ප්‍රහීණ කිරීම ද, ථින මිද්ධය දුරු කිරීම ද, කුකුස වළක්වා ගැනීම ද, උපේක්ෂාවෙන් යුත් සතියෙන් පිරිසිදු වූ ද, ධර්ම විතර්කය පෙරටු කොට ඇති වූ ද, අවිද්‍යාව බිඳ දමන්නා වූ ද, (ඒ තත්ත්වය) 'පරම ඥානයෙන් ලබන විමුක්තිය' යැයි මම ප්‍රකාශ කරමි.\"",
      "paliTitle": "Sāriputtasuttaṃ",
      "englishTitle": "Sāriputta Sutta",
      "sinhalaTitle": "සාරිපුත්ත සූත්‍රය"
    },
    {
      "number": 34,
      "pali": "‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Lobho nidānaṃ kammānaṃ samudayāya, doso nidānaṃ kammānaṃ samudayāya, moho nidānaṃ kammānaṃ samudayāya. ‘‘Yaṃ, bhikkhave, lobhapakataṃ kammaṃ lobhajaṃ lobhanidānaṃ lobhasamudayaṃ, yatthassa attabhāvo nibbattati tattha taṃ kammaṃ vipaccati. Yattha taṃ kammaṃ vipaccati tattha tassa kammassa vipākaṃ paṭisaṃvedeti, diṭṭhe vā dhamme upapajja vā [upapajje vā (sī. syā. kaṃ.) upapajjitvāti ma. ni. 3.303 pāḷiyā saṃvaṇṇanā] apare vā [aparāpare vā (ka.)] pariyāye. ‘‘Yaṃ, bhikkhave, dosapakataṃ kammaṃ dosajaṃ dosanidānaṃ dosasamudayaṃ, yatthassa attabhāvo nibbattati tattha taṃ kammaṃ vipaccati. Yattha taṃ kammaṃ vipaccati tattha tassa kammassa vipākaṃ paṭisaṃvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye. ‘‘Yaṃ, bhikkhave, mohapakataṃ kammaṃ mohajaṃ mohanidānaṃ mohasamudayaṃ, yatthassa attabhāvo nibbattati tattha taṃ kammaṃ vipaccati. Yattha taṃ kammaṃ vipaccati tattha tassa kammassa vipākaṃ paṭisaṃvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye. ‘‘Seyyathāpi, bhikkhave, bījāni akhaṇḍāni apūtīni avātātapahatāni sārādāni sukhasayitāni sukhette suparikammakatāya bhūmiyā nikkhittāni. Devo ca sammādhāraṃ anuppaveccheyya. Evassu tāni, bhikkhave, bījāni vuddhiṃ viruḷhiṃ vepullaṃ āpajjeyyuṃ. Evamevaṃ kho, bhikkhave, yaṃ lobhapakataṃ kammaṃ lobhajaṃ lobhanidānaṃ lobhasamudayaṃ, yatthassa attabhāvo nibbattati tattha taṃ kammaṃ vipaccati. Yattha taṃ kammaṃ vipaccati tattha tassa kammassa vipākaṃ paṭisaṃvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye. ‘‘Yaṃ dosapakataṃ kammaṃ…pe… yaṃ mohapakataṃ kammaṃ mohajaṃ mohanidānaṃ mohasamudayaṃ, yatthassa attabhāvo nibbattati tattha taṃ kammaṃ vipaccati. Yattha taṃ kammaṃ vipaccati tattha tassa kammassa vipākaṃ paṭisaṃvedeti, diṭṭhe vā dhamme upapajja vā apare vā pariyāye. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya. ‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Alobho nidānaṃ kammānaṃ samudayāya, adoso nidānaṃ kammānaṃ samudayāya, amoho nidānaṃ kammānaṃ samudayāya. ‘‘Yaṃ, bhikkhave, alobhapakataṃ kammaṃ alobhajaṃ alobhanidānaṃ alobhasamudayaṃ, lobhe vigate evaṃ taṃ kammaṃ pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṅkataṃ āyatiṃ anuppādadhammaṃ. ‘‘Yaṃ, bhikkhave, adosapakataṃ kammaṃ adosajaṃ adosanidānaṃ adosasamudayaṃ, dose vigate evaṃ taṃ kammaṃ pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṅkataṃ āyatiṃ anuppādadhammaṃ. ‘‘Yaṃ, bhikkhave, amohapakataṃ kammaṃ amohajaṃ amohanidānaṃ amohasamudayaṃ, mohe vigate evaṃ taṃ kammaṃ pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṅkataṃ āyatiṃ anuppādadhammaṃ. ‘‘Seyyathāpi, bhikkhave, bījāni akhaṇḍāni apūtīni avātātapahatāni sārādāni sukhasayitāni. Tāni puriso agginā ḍaheyya. Agginā ḍahitvā masiṃ kareyya. Masiṃ karitvā mahāvāte vā ophuṇeyya [opuneyya (sī. pī.)] nadiyā vā sīghasotāya pavāheyya. Evassu tāni, bhikkhave, bījāni ucchinnamūlāni tālāvatthukatāni anabhāvaṅkatāni [anabhāvakatāni (sī. pī.)] āyatiṃ anuppādadhammāni. Evamevaṃ kho, bhikkhave, yaṃ alobhapakataṃ kammaṃ alobhajaṃ alobhanidānaṃ alobhasamudayaṃ, lobhe vigate evaṃ taṃ kammaṃ pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṅkataṃ āyatiṃ anuppādadhammaṃ. ‘‘Yaṃ adosapakataṃ kammaṃ…pe… yaṃ amohapakataṃ kammaṃ amohajaṃ amohanidānaṃ amohasamudayaṃ, mohe vigate evaṃ taṃ kammaṃ pahīnaṃ hoti…pe… āyatiṃ anuppādadhammaṃ. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. ‘‘Lobhajaṃ dosajañceva [dosajaṃ kammaṃ (ka.)], mohajañcāpaviddasu; Yaṃ tena pakataṃ kammaṃ, appaṃ vā yadi vā bahuṃ; Idheva taṃ vedaniyaṃ, vatthu aññaṃ na vijjati. ‘‘Tasmā lobhañca dosañca, mohajañcāpi viddasu; Vijjaṃ uppādayaṃ bhikkhu, sabbā duggatiyo jahe’’ti. catutthaṃ;",
      "english": "Monks, there are these three roots for the origination of kamma. Which three? Greed is a root for the origination of kamma, hatred is a root for the origination of kamma, and delusion is a root for the origination of kamma.\n\nMonks, that kamma which is performed out of greed, born of greed, rooted in greed, and originated from greed – wherever that individual’s existence comes to be, there that kamma ripens. Wherever that kamma ripens, there one experiences the result of that kamma, either in this very life, or by reappearing in a subsequent existence, or on some other successive occasion.\n\nMonks, that kamma which is performed out of hatred, born of hatred, rooted in hatred, and originated from hatred – wherever that individual’s existence comes to be, there that kamma ripens. Wherever that kamma ripens, there one experiences the result of that kamma, either in this very life, or by reappearing in a subsequent existence, or on some other successive occasion.\n\nMonks, that kamma which is performed out of delusion, born of delusion, rooted in delusion, and originated from delusion – wherever that individual’s existence comes to be, there that kamma ripens. Wherever that kamma ripens, there one experiences the result of that kamma, either in this very life, or by reappearing in a subsequent existence, or on some other successive occasion.\n\nJust as, monks, if seeds that are unbroken, not rotten, not damaged by wind and sun, substantial, and well-stored are placed in a good field on well-prepared ground, and the sky should provide proper rainfall – in this way, monks, those seeds would attain growth, increase, and full development.\n\nIn the same way, monks, that kamma which is performed out of greed, born of greed, rooted in greed, and originated from greed – wherever that individual’s existence comes to be, there that kamma ripens. Wherever that kamma ripens, there one experiences the result of that kamma, either in this very life, or by reappearing in a subsequent existence, or on some other successive occasion. Likewise, that kamma which is performed out of hatred, born of hatred, rooted in hatred, and originated from hatred – wherever that individual’s existence comes to be, there that kamma ripens. Wherever that kamma ripens, there one experiences the result of that kamma, either in this very life, or by reappearing in a subsequent existence, or on some other successive occasion. And that kamma which is performed out of delusion, born of delusion, rooted in delusion, and originated from delusion – wherever that individual’s existence comes to be, there that kamma ripens. Wherever that kamma ripens, there one experiences the result of that kamma, either in this very life, or by reappearing in a subsequent existence, or on some other successive occasion. These, monks, are the three roots for the origination of kamma.\n\nMonks, there are these three roots for the origination of kamma. Which three? Non-greed is a root for the origination of kamma, non-hatred is a root for the origination of kamma, and non-delusion is a root for the origination of kamma.\n\nMonks, that kamma which is performed out of non-greed, born of non-greed, rooted in non-greed, and originated from non-greed – when greed has vanished, such kamma is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and is not liable to future production.\n\nMonks, that kamma which is performed out of non-hatred, born of non-hatred, rooted in non-hatred, and originated from non-hatred – when hatred has vanished, such kamma is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and is not liable to future production.\n\nMonks, that kamma which is performed out of non-delusion, born of non-delusion, rooted in non-delusion, and originated from non-delusion – when delusion has vanished, such kamma is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and is not liable to future production.\n\nJust as, monks, if seeds that are unbroken, not rotten, not damaged by wind and sun, substantial, and well-stored – a man would burn them with fire. Having burned them with fire, he would reduce them to ash. Having reduced them to ash, he would scatter them in a strong wind, or cast them into a swift-flowing river. In this way, monks, those seeds would be cut off at the root, made like a palm-stump, brought to non-existence, and not liable to future production.\n\nIn the same way, monks, that kamma which is performed out of non-greed, born of non-greed, rooted in non-greed, and originated from non-greed – when greed has vanished, such kamma is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and is not liable to future production. Likewise, that kamma which is performed out of non-hatred, born of non-hatred, rooted in non-hatred, and originated from non-hatred – when hatred has vanished, such kamma is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and is not liable to future production. And that kamma which is performed out of non-delusion, born of non-delusion, rooted in non-delusion, and originated from non-delusion – when delusion has vanished, such kamma is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, and is not liable to future production. These, monks, are the three roots for the origination of kamma.\n\nThat which is born of greed, and born of hatred, and born of delusion, O knowing one – whatever kamma is performed through these, whether little or much, it is to be experienced right here; no other basis is found for it. Therefore, O knowing one, a monk, generating true knowledge, abandons all woeful destinations.",
      "sinhala": "භික්ෂූනි, කර්ම හටගැනීමට හේතු වන කරුණු තුනකි. ඒ තුන කවරේද? ලෝභය කර්ම හටගැනීමට හේතුවකි, ද්වේෂය කර්ම හටගැනීමට හේතුවකි, මෝහය කර්ම හටගැනීමට හේතුවකි.\n\nභික්ෂූනි, යම් කර්මයක් ලෝභයෙන් කරන ලද්දක් ද, ලෝභයෙන් හටගත්තක් ද, ලෝභය මුල් කරගත්තක් ද, ලෝභය නිසාම හටගත්තක් ද වේද, ඔහුගේ යම් ආත්මභාවයක උපත සිදුවේද, එහිදී ඒ කර්මය විපාක දෙයි. යම් තැනක ඒ කර්මය විපාක දෙයිද, එහිදී ඔහු ඒ කර්මයේ විපාකය විඳියි, මේ භවයේදී හෝ (නැවත) උපත ලැබීමෙන් පසු හෝ වෙනත් ආකාරයකින් හෝ.\n\nභික්ෂූනි, යම් කර්මයක් ද්වේෂයෙන් කරන ලද්දක් ද, ද්වේෂයෙන් හටගත්තක් ද, ද්වේෂය මුල් කරගත්තක් ද, ද්වේෂය නිසාම හටගත්තක් ද වේද, ඔහුගේ යම් ආත්මභාවයක උපත සිදුවේද, එහිදී ඒ කර්මය විපාක දෙයි. යම් තැනක ඒ කර්මය විපාක දෙයිද, එහිදී ඔහු ඒ කර්මයේ විපාකය විඳියි, මේ භවයේදී හෝ උපත ලැබීමෙන් පසු හෝ වෙනත් ආකාරයකින් හෝ.\n\nභික්ෂූනි, යම් කර්මයක් මෝහයෙන් කරන ලද්දක් ද, මෝහයෙන් හටගත්තක් ද, මෝහය මුල් කරගත්තක් ද, මෝහය නිසාම හටගත්තක් ද වේද, ඔහුගේ යම් ආත්මභාවයක උපත සිදුවේද, එහිදී ඒ කර්මය විපාක දෙයි. යම් තැනක ඒ කර්මය විපාක දෙයිද, එහිදී ඔහු ඒ කර්මයේ විපාකය විඳියි, මේ භවයේදී හෝ උපත ලැබීමෙන් පසු හෝ වෙනත් ආකාරයකින් හෝ.\n\nභික්ෂූනි, යම්සේ කැඩී නොගිය, නරක් නොවුණු, සුළඟින් හා අව්වෙන් හානි නොවූ, සාරවත්, හොඳින් රෝපණය කරන ලද බීජ, හොඳින් සකස් කරන ලද, සරුසාර කෙතක වපුරා තිබේ නම්. වැස්සද හොඳින් වහියි. භික්ෂූනි, එවිට ඒ බීජ වර්ධනයට, වැඩි දියුණුවට, මහත්ඵල භාවයට පත්වේ. භික්ෂූනි, එපරිද්දෙන්ම යම් කර්මයක් ලෝභයෙන් කරන ලද්දක් ද, ලෝභයෙන් හටගත්තක් ද, ලෝභය මුල් කරගත්තක් ද, ලෝභය නිසාම හටගත්තක් ද වේද, ඔහුගේ යම් ආත්මභාවයක උපත සිදුවේද, එහිදී ඒ කර්මය විපාක දෙයි. යම් තැනක ඒ කර්මය විපාක දෙයිද, එහිදී ඔහු ඒ කර්මයේ විපාකය විඳියි, මේ භවයේදී හෝ උපත ලැබීමෙන් පසු හෝ වෙනත් ආකාරයකින් හෝ.\n\nභික්ෂූනි, යම් කර්මයක් ද්වේෂයෙන් කරන ලද්දක් ද, ද්වේෂයෙන් හටගත්තක් ද, ද්වේෂය මුල් කරගත්තක් ද, ද්වේෂය නිසාම හටගත්තක් ද වේද, ඔහුගේ යම් ආත්මභාවයක උපත සිදුවේද, එහිදී ඒ කර්මය විපාක දෙයි. යම් තැනක ඒ කර්මය විපාක දෙයිද, එහිදී ඔහු ඒ කර්මයේ විපාකය විඳියි, මේ භවයේදී හෝ උපත ලැබීමෙන් පසු හෝ වෙනත් ආකාරයකින් හෝ. භික්ෂූනි, යම් කර්මයක් මෝහයෙන් කරන ලද්දක් ද, මෝහයෙන් හටගත්තක් ද, මෝහය මුල් කරගත්තක් ද, මෝහය නිසාම හටගත්තක් ද වේද, ඔහුගේ යම් ආත්මභාවයක උපත සිදුවේද, එහිදී ඒ කර්මය විපාක දෙයි. යම් තැනක ඒ කර්මය විපාක දෙයිද, එහිදී ඔහු ඒ කර්මයේ විපාකය විඳියි, මේ භවයේදී හෝ උපත ලැබීමෙන් පසු හෝ වෙනත් ආකාරයකින් හෝ. භික්ෂූනි, කර්ම හටගැනීමට හේතු වන කරුණු මේ තුනයි.\n\nභික්ෂූනි, කර්ම හටගැනීමට හේතු වන කරුණු තුනක් ද ඇත. ඒ තුන කවරේද? අලෝභය කර්ම හටගැනීමට හේතුවකි, අද්වේෂය කර්ම හටගැනීමට හේතුවකි, අමෝහය කර්ම හටගැනීමට හේතුවකි.\n\nභික්ෂූනි, යම් කර්මයක් අලෝභයෙන් කරන ලද්දක් ද, අලෝභයෙන් හටගත්තක් ද, අලෝභය මුල් කරගත්තක් ද, අලෝභය නිසාම හටගත්තක් ද වේද, ලෝභය පහ වූ කල්හි, එවිට ඒ කර්මය (ද) දුරු කරන ලද්දක් වෙයි, මුලින් සිඳින ලද්දක් වෙයි, තල් ගසක් මුලින් සිඳ දැමූ පරිදි (නැවත නොහටගන්නා සේ) විනාශ කරන ලද්දක් වෙයි, අනාගතයේදී කිසි ලෙසකින්වත් හට නොගන්නා ස්වභාවයෙන් යුක්ත වෙයි.\n\nභික්ෂූනි, යම් කර්මයක් අද්වේෂයෙන් කරන ලද්දක් ද, අද්වේෂයෙන් හටගත්තක් ද, අද්වේෂය මුල් කරගත්තක් ද, අද්වේෂය නිසාම හටගත්තක් ද වේද, ද්වේෂය පහ වූ කල්හි, එවිට ඒ කර්මය (ද) දුරු කරන ලද්දක් වෙයි, මුලින් සිඳින ලද්දක් වෙයි, තල් ගසක් මුලින් සිඳ දැමූ පරිදි (නැවත නොහටගන්නා සේ) විනාශ කරන ලද්දක් වෙයි, අනාගතයේදී කිසි ලෙසකින්වත් හට නොගන්නා ස්වභාවයෙන් යුක්ත වෙයි.\n\nභික්ෂූනි, යම් කර්මයක් අමෝහයෙන් කරන ලද්දක් ද, අමෝහයෙන් හටගත්තක් ද, අමෝහය මුල් කරගත්තක් ද, අමෝහය නිසාම හටගත්තක් ද වේද, මෝහය පහ වූ කල්හි, එවිට ඒ කර්මය (ද) දුරු කරන ලද්දක් වෙයි, මුලින් සිඳින ලද්දක් වෙයි, තල් ගසක් මුලින් සිඳ දැමූ පරිදි (නැවත නොහටගන්නා සේ) විනාශ කරන ලද්දක් වෙයි, අනාගතයේදී කිසි ලෙසකින්වත් හට නොගන්නා ස්වභාවයෙන් යුක්ත වෙයි.\n\nභික්ෂූනි, යම්සේ කැඩී නොගිය, නරක් නොවුණු, සුළඟින් හා අව්වෙන් හානි නොවූ, සාරවත්, හොඳින් රෝපණය කරන ලද බීජ, පුරුෂයෙක් ගින්නෙන් දවා අළු බවට පත් කරයි. අළු බවට පත් කර, මහ සුළඟේ පහ කරයි, නැතහොත් වේගවත් ගංගාවක පා කර හරියි. භික්ෂූනි, එවිට ඒ බීජ මුලින් සිඳ දැමූ ඒවා වෙයි, තල් ගසක් මුලින් සිඳ දැමූ පරිදි (නැවත නොහටගන්නා සේ) විනාශ කරන ලද ඒවා වෙයි, අනාගතයේදී කිසි ලෙසකින්වත් හට නොගන්නා ස්වභාවයෙන් යුක්ත ඒවා වෙයි. භික්ෂූනි, එපරිද්දෙන්ම යම් කර්මයක් අලෝභයෙන් කරන ලද්දක් ද, අලෝභයෙන් හටගත්තක් ද, අලෝභය මුල් කරගත්තක් ද, අලෝභය නිසාම හටගත්තක් ද වේද, ලෝභය පහ වූ කල්හි, එවිට ඒ කර්මය (ද) දුරු කරන ලද්දක් වෙයි, මුලින් සිඳින ලද්දක් වෙයි, තල් ගසක් මුලින් සිඳ දැමූ පරිදි (නැවත නොහටගන්නා සේ) විනාශ කරන ලද්දක් වෙයි, අනාගතයේදී කිසි ලෙසකින්වත් හට නොගන්නා ස්වභාවයෙන් යුක්ත වෙයි.\n\nභික්ෂූනි, යම් කර්මයක් අද්වේෂයෙන් කරන ලද්දක් ද, අද්වේෂයෙන් හටගත්තක් ද, අද්වේෂය මුල් කරගත්තක් ද, අද්වේෂය නිසාම හටගත්තක් ද වේද, ද්වේෂය පහ වූ කල්හි, එවිට ඒ කර්මය (ද) දුරු කරන ලද්දක් වෙයි, මුලින් සිඳින ලද්දක් වෙයි, තල් ගසක් මුලින් සිඳ දැමූ පරිදි (නැවත නොහටගන්නා සේ) විනාශ කරන ලද්දක් වෙයි, අනාගතයේදී කිසි ලෙසකින්වත් හට නොගන්නා ස්වභාවයෙන් යුක්ත වෙයි. භික්ෂූනි, යම් කර්මයක් අමෝහයෙන් කරන ලද්දක් ද, අමෝහයෙන් හටගත්තක් ද, අමෝහය මුල් කරගත්තක් ද, අමෝහය නිසාම හටගත්තක් ද වේද, මෝහය පහ වූ කල්හි, එවිට ඒ කර්මය (ද) දුරු කරන ලද්දක් වෙයි, මුලින් සිඳින ලද්දක් වෙයි, තල් ගසක් මුලින් සිඳ දැමූ පරිදි (නැවත නොහටගන්නා සේ) විනාශ කරන ලද්දක් වෙයි, අනාගතයේදී කිසි ලෙසකින්වත් හට නොගන්නා ස්වභාවයෙන් යුක්ත වෙයි. භික්ෂූනි, කර්ම හටගැනීමට හේතු වන කරුණු මේ තුනයි.\n\nලෝභයෙන් හටගත්, ද්වේෂයෙන් හටගත්, මෝහයෙන් හටගත් (කර්ම), දුරු කළ යුතු ඒවා වෙති. එම ලෝභ, ද්වේෂ, මෝහයන්ගෙන් කරන ලද කර්මය ස්වල්ප වුවද, මහත් වුවද, මෙලොවදීම විඳිය යුතු වේ, (එයට) වෙනත් පදනමක් නැත.\n\nඑබැවින්, ප්‍රඥාවන්තයා ලෝභය ද, ද්වේෂය ද, මෝහය ද (පහ කරමින්), විද්‍යාව උපදවමින්, සියලු දුගති දුරු කරන්නේය.",
      "paliTitle": "Nidānasuttaṃ",
      "englishTitle": "The Discourse on Causation",
      "sinhalaTitle": "නිදාන සූත්‍රය"
    },
    {
      "number": 35,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati gomagge siṃsapāvane paṇṇasanthare. Atha kho hatthako āḷavako jaṅghāvihāraṃ anucaṅkamamāno anuvicaramāno addasa bhagavantaṃ gomagge siṃsapāvane paṇṇasanthare nisinnaṃ. Disvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho hatthako āḷavako bhagavantaṃ etadavoca – ‘‘kacci, bhante, bhagavā sukhamasayitthā’’ti? ‘‘Evaṃ, kumāra, sukhamasayitthaṃ. Ye ca pana loke sukhaṃ senti, ahaṃ tesaṃ aññataro’’ti. ‘‘Sītā, bhante, hemantikā ratti, antaraṭṭhako himapātasamayo, kharā gokaṇṭakahatā bhūmi, tanuko paṇṇasantharo, viraḷāni rukkhassa pattāni, sītāni kāsāyāni vatthāni, sīto ca verambho vāto vāyati. Atha ca pana bhagavā evamāha – ‘evaṃ, kumāra, sukhamasayitthaṃ. Ye ca pana loke sukhaṃ senti, ahaṃ tesaṃ aññataro’’’ti. ‘‘Tena hi, kumāra, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, kumāra, idhassa gahapatissa vā gahapatiputtassa vā kūṭāgāraṃ ullittāvalittaṃ nivātaṃ phusitaggaḷaṃ pihitavātapānaṃ. Tatrassa pallaṅko gonakatthato paṭikatthato paṭalikatthato kadalimigapavarapaccattharaṇo [kādalimigapavarapaccattharaṇo (sī.)] sauttaracchado ubhato lohitakūpadhāno; telappadīpo cettha jhāyeyya [jāleyya (ka.)]; catasso ca [tasseva (ka.)] pajāpatiyo manāpāmanāpena paccupaṭṭhitā assu. Taṃ kiṃ maññasi, kumāra, sukhaṃ vā so sayeyya no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Sukhaṃ so, bhante, sayeyya. Ye ca pana loke sukhaṃ senti, so tesaṃ aññataro’’ti. ‘‘Taṃ kiṃ maññasi, kumāra, api nu tassa gahapatissa vā gahapatiputtassa vā uppajjeyyuṃ rāgajā pariḷāhā kāyikā vā cetasikā vā yehi so rāgajehi pariḷāhehi pariḍayhamāno dukkhaṃ sayeyyā’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Yehi kho so, kumāra, gahapati vā gahapatiputto vā rāgajehi pariḷāhehi pariḍayhamāno dukkhaṃ sayeyya, so rāgo tathāgatassa pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo. Tasmāhaṃ sukhamasayitthaṃ. ‘‘Taṃ kiṃ maññasi, kumāra, api nu tassa gahapatissa vā gahapatiputtassa vā uppajjeyyuṃ dosajā pariḷāhā…pe… mohajā pariḷāhā kāyikā vā cetasikā vā yehi so mohajehi pariḷāhehi pariḍayhamāno dukkhaṃ sayeyyā’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Ye hi kho so, kumāra, gahapati vā gahapatiputto vā mohajehi pariḷāhehi pariḍayhamāno dukkhaṃ sayeyya, so moho tathāgatassa pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo. Tasmāhaṃ sukhamasayittha’’nti. [cūḷava. 305; saṃ. ni. 1.242] ‘‘Sabbadā ve sukhaṃ seti, brāhmaṇo parinibbuto; Yo na limpati [lippati (sī. syā. kaṃ. ka.)] kāmesu, sītibhūto nirūpadhi. ‘‘Sabbā āsattiyo chetvā, vineyya hadaye daraṃ; Upasanto sukhaṃ seti, santiṃ pappuyya cetaso’’ti. pañcamaṃ;",
      "english": "Thus have I heard: At one time the Blessed One was staying in Āḷavī, at Gomagga, in a siṃsapā grove, on a bed of leaves. Then Hatthaka of Āḷavī, walking for exercise, came upon the Blessed One seated on a bed of leaves in a siṃsapā grove at Gomagga. Having seen him, he approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, Hatthaka of Āḷavī said to the Blessed One, “Lord, did the Blessed One sleep well?”\n\n“Indeed, young man, I slept well. I am one of those in the world who sleep well.”\n\n“Lord, the winter night is cold, it is the cold season with heavy frost. The ground is rough, pierced by cow-hooves. The bed of leaves is thin, the tree leaves are sparse, the robes are cold, and a bitter wind blows. Yet the Blessed One says, ‘Indeed, young man, I slept well. I am one of those in the world who sleep well.’”\n\n“In that case, young man, I will question you in return. You should answer as you see fit. What do you think, young man? Suppose there is a householder or householder’s son who has a gabled house, plastered inside and out, free from drafts, with well-fitting bolts and closed windows. Inside, there is a couch covered with a long-fleeced rug, a white woolen coverlet, an embroidered coverlet, and a splendid deerskin spread, with a canopy above and red pillows at both ends. An oil lamp burns there, and four wives attend upon him in ways both pleasing and unpleasing. What do you think, young man? Would he sleep well or not? What is your opinion on this?”\n\n“Lord, he would indeed sleep well. He would be one of those in the world who sleep well.”\n\n“What do you think, young man? Might not physical or mental fevers of lust arise in that householder or householder’s son, and burning with those fevers of lust, would he not sleep poorly?”\n\n“Yes, Lord.”\n\n“Young man, that lust by which that householder or householder’s son, burning with its fevers, would sleep poorly – that lust has been abandoned by the Tathāgata, cut off at the root, made like a palm stump, brought to non-existence, no longer liable to arise in the future. That is why I slept well.\n\n“What do you think, young man? Might not physical or mental fevers of aversion arise in that householder or householder’s son, and burning with those fevers of aversion, would he not sleep poorly? Might not physical or mental fevers of delusion arise in that householder or householder’s son, and burning with those fevers of delusion, would he not sleep poorly?”\n\n“Yes, Lord.”\n\n“Young man, that aversion by which that householder or householder’s son, burning with its fevers, would sleep poorly – that aversion has been abandoned by the Tathāgata, cut off at the root, made like a palm stump, brought to non-existence, no longer liable to arise in the future. That is why I slept well. And that delusion by which that householder or householder’s son, burning with its fevers, would sleep poorly – that delusion has been abandoned by the Tathāgata, cut off at the root, made like a palm stump, brought to non-existence, no longer liable to arise in the future. That is why I slept well.”\n\n“Always indeed he sleeps well, the brahmin who is fully extinguished; He who is not defiled by sensual pleasures, one who has become cool, without substratum for existence. Having cut off all attachments, having removed the dart in the heart; Peaceful, he sleeps well, having attained peace of mind.”",
      "sinhala": "මා හට මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ ආළවියේ, ගොමඟුල නම් සිංසපා වනයෙහි පත් අස්නක වැඩසිටින සේක.\n\nඑකල්හි හත්ථක ආළවක තෙමේ සක්මන් කරමින් ඇවිදින අතරතුරේදී ගොමඟුලෙහි සිංසපා වනයේ පත් අස්නක වැඩ සිටින භාග්‍යවතුන් වහන්සේ දුටුවේය. දැක, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩිවිය.\n\nඑකත්පසෙකින් වාඩි වී සිටි හත්ථක ආළවක තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"භන්තේ, භාග්‍යවතුන් වහන්සේ සුවසේ සැතපුණ සේක්ද?\"\n\n\"එසේය, කුමාරය, මම සුවසේ සැතපුනෙමි. ලොව යම් කෙනෙක් සුවසේ සැතපෙත්ද, මම ඔවුන් අතුරින් එක් අයෙක්මි.\"\n\n\"භන්තේ, මේ ශීත සෘතුවේ රාත්‍රිය සීතලයි. මහා ශීතල පිනිවැටෙන කාලයයි. ගොන්කටු වලින් පිරුණු බිම රළුයි. පත් අස්න සිහින්ය. ගසේ පත්‍ර විරලයි. කසාවත් සිවුරුද සිසිල්ය. සීතල වේරම්භ නම් සුළංද හමයි. එසේ තිබියදීත් භාග්‍යවතුන් වහන්සේ ‘එසේය, කුමාරය, මම සුවසේ සැතපුනෙමි. ලොව යම් කෙනෙක් සුවසේ සැතපෙත්ද, මම ඔවුන් අතුරින් එක් අයෙක්මි’ කියා වදාරණ සේක.\"\n\n\"එසේනම්, කුමාරය, මමම දැන් ඔබගෙන් විමසන්නෙමි. ඔබට යම්සේ සුදුසු වේද, ඒ අයුරින් එයට පිළිතුරු දෙන්න. කුමාරය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? යම් ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට බිත්ති තවරන ලද, සුළං රහිත, දොරගුළු දමන ලද, කවුළු වසන ලද, කුටියක් වේද, එහි ලෝම ඇති ඇතිරිලි, සිත්තම් ඇතිරිලි, සේද ඇතිරිලි, කෙසෙල් මුව සමින් කළ උතුම් ඇතිරිලි ඇති, උඩුවියන් සහිත, දෙපස රතු කොට්ට සහිත යහනක් වේද, එහි තෙල් පහනක්ද දැල්වෙමින් පවතීද, ඔහුට ප්‍රිය උපදවන සුළු බිරින්දෑවරු සතර දෙනෙක්ද උපස්ථාන කරත්ද, කුමාරය, ඔබ කුමක් සිතන්නෙහිද, ඔහු සුවසේ සැතපේද නැද්ද? නැතහොත් මේ ගැන ඔබේ අදහස කුමක්ද?\"\n\n\"භන්තේ, ඔහු සුවසේ සැතපෙනු ඇත. ලොව යම් කෙනෙක් සුවසේ සැතපෙත්ද, ඔහු ඔවුන් අතුරින් එක් අයෙක් වනු ඇත.\"\n\n\"කුමාරය, ඔබ කුමක් සිතන්නෙහිද? ඒ ගෘහපතියාට හෝ ගෘහපති පුත්‍රයාට කායික හෝ චෛතසික වශයෙන් රාගයෙන් හටගත් දැවිලි (ක්ලේශ ගිනි) ඇතිවිය හැකිද? යම් රාගයෙන් හටගත් දැවිලි නිසා ඔහු දුක් විඳිමින් සැතපේද?\"\n\n\"එසේය, භන්තේ.\"\n\n\"කුමාරය, යම් රාගයෙන් හටගත් දැවිලි නිසා ඒ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා දුක් විඳිමින් සැතපේද, ඒ රාගය තථාගතයන් වහන්සේ විසින් ප්‍රහීණ කරන ලද්දේය, මුලින් උදුරා දමන ලද්දේය, තල් ගසක් මුලින් උදුරා දැමූවාක් මෙන් නැති කරන ලද්දේය, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද්දේය, අනාගතයේදී නැවත ඇති නොවන ධර්මය ඇත්තේය. එබැවින් මම සුවසේ සැතපුනෙමි.\"\n\n\"කුමාරය, ඔබ කුමක් සිතන්නෙහිද? ඒ ගෘහපතියාට හෝ ගෘහපති පුත්‍රයාට කායික හෝ චෛතසික වශයෙන් ද්වේෂයෙන් හටගත් දැවිලි (ක්ලේශ ගිනි) ඇතිවිය හැකිද? යම් ද්වේෂයෙන් හටගත් දැවිලි නිසා ඔහු දුක් විඳිමින් සැතපේද? ඒ ගෘහපතියාට හෝ ගෘහපති පුත්‍රයාට කායික හෝ චෛතසික වශයෙන් මෝහයෙන් හටගත් දැවිලි (ක්ලේශ ගිනි) ඇතිවිය හැකිද? යම් මෝහයෙන් හටගත් දැවිලි නිසා ඔහු දුක් විඳිමින් සැතපේද?\"\n\n\"එසේය, භන්තේ.\"\n\n\"කුමාරය, යම් මෝහයෙන් හටගත් දැවිලි නිසා ඒ ගෘහපතියා හෝ ගෘහපති පුත්‍රයා දුක් විඳිමින් සැතපේද, ඒ මෝහය තථාගතයන් වහන්සේ විසින් ප්‍රහීණ කරන ලද්දේය, මුලින් උදුරා දමන ලද්දේය, තල් ගසක් මුලින් උදුරා දැමූවාක් මෙන් නැති කරන ලද්දේය, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද්දේය, අනාගතයේදී නැවත ඇති නොවන ධර්මය ඇත්තේය. එබැවින් මම සුවසේ සැතපුනෙමි.\"\n\n\"පිරිනිවුණු බ්‍රාහ්මණයා සැමවිටම සුවසේ සැතපේ.\nයමෙක් කාමයන්හි නොඇලේද, සිසිල් වූයේ, සියලු උපාධීන්ගෙන් තොර වූයේ, ඔහු සුවසේ සැතපේ.\"\n\n\"සියලු ඇලීම් සිඳ බිඳ දමා, හදවතේ තිබූ දැවීම් (ක්ලේශයන්) දුරු කර, සිතේ ශාන්තිය ලබා, උපශාන්ත වූයේ සුවසේ සැතපේ.\"",
      "paliTitle": "Hatthakasuttaṃ",
      "englishTitle": "The Discourse to Hatthaka",
      "sinhalaTitle": "හත්ථක සූත්‍රය"
    },
    {
      "number": 36,
      "pali": "‘‘Tīṇimāni, bhikkhave, devadūtāni. Katamāni tīṇi? Idha, bhikkhave, ekacco kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Tamenaṃ, bhikkhave, nirayapālā nānābāhāsu gahetvā yamassa rañño dassenti – ‘ayaṃ, deva, puriso amatteyyo apetteyyo asāmañño abrahmañño, na kule jeṭṭhāpacāyī. Imassa devo daṇḍaṃ paṇetū’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā paṭhamaṃ devadūtaṃ samanuyuñjati samanugāhati samanubhāsati – ‘ambho, purisa, na tvaṃ addasa manussesu paṭhamaṃ devadūtaṃ pātubhūta’nti? So evamāha – ‘nāddasaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho purisa, na tvaṃ addasa manussesu itthiṃ vā purisaṃ vā āsītikaṃ vā nāvutikaṃ vā vassasatikaṃ vā [passa ma. ni. 3.263] jātiyā jiṇṇaṃ gopānasivaṅkaṃ bhoggaṃ daṇḍaparāyaṇaṃ [daṇḍaparāyanaṃ (syā. kaṃ. pī.)] pavedhamānaṃ gacchantaṃ āturaṃ gatayobbanaṃ khaṇḍadantaṃ palitakesaṃ vilūnaṃ khallitasiraṃ [khalitaṃ siro (sī. pī.), khalitasiraṃ (syā. kaṃ.) ma. ni. 3.263] valitaṃ tilakāhatagatta’nti? So evamāha – ‘addasaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho, purisa, tassa te viññussa sato mahallakassa na etadahosi – ahampi khomhi jarādhammo jaraṃ anatīto, handāhaṃ kalyāṇaṃ karomi, kāyena vācāya manasā’ti? So evamāha – ‘nāsakkhissaṃ, bhante. Pamādassaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho, purisa, pamādatāya [pamādavatāya (sī. syā. kaṃ. pī.) ma. ni. 3.262] na kalyāṇamakāsi kāyena vācāya manasā. Taggha tvaṃ [taṃ (ka.)], ambho purisa, tathā karissanti yathā taṃ [te (ka.)] pamattaṃ. Taṃ kho pana te etaṃ [taṃ kho panetaṃ (sī. syā. kaṃ. pī.)] pāpakammaṃ [pāpaṃ kammaṃ (sī.)] neva mātarā kataṃ, na pitarā kataṃ, na bhātarā kataṃ, na bhaginiyā kataṃ, na mittāmaccehi kataṃ, na ñātisālohitehi kataṃ, na devatāhi kataṃ, na samaṇabrāhmaṇehi kataṃ; atha kho tayāvetaṃ pāpakammaṃ kataṃ, tvaññevetassa vipākaṃ paṭisaṃvedissasī’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā paṭhamaṃ devadūtaṃ samanuyuñjitvā samanugāhitvā samanubhāsitvā, dutiyaṃ devadūtaṃ samanuyuñjati samanugāhati samanubhāsati – ‘ambho purisa, na tvaṃ addasa manussesu dutiyaṃ devadūtaṃ pātubhūta’nti? So evamāha – ‘nāddasaṃ, bhante’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho purisa, na tvaṃ addasa manussesu itthiṃ vā purisaṃ vā ābādhikaṃ dukkhitaṃ bāḷhagilānaṃ, sake muttakarīse palipannaṃ semānaṃ, aññehi vuṭṭhāpiyamānaṃ, aññehi saṃvesiyamāna’nti? So evamāha – ‘addasaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho purisa, tassa te viññussa sato mahallakassa na etadahosi – ahampi khomhi byādhidhammo byādhiṃ anatīto, handāhaṃ kalyāṇaṃ karomi kāyena vācāya manasā’ti? So evamāha – ‘nāsakkhissaṃ, bhante. Pamādassaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho purisa, pamādatāya na kalyāṇamakāsi kāyena vācāya manasā. Taggha tvaṃ, ambho purisa, tathā karissanti yathā taṃ pamattaṃ. Taṃ kho pana te etaṃ pāpakammaṃ neva mātarā kataṃ, na pitarā kataṃ, na bhātarā kataṃ, na bhaginiyā kataṃ, na mittāmaccehi kataṃ, na ñātisālohitehi kataṃ, na devatāhi kataṃ, na samaṇabrāhmaṇehi kataṃ; atha kho tayāvetaṃ pāpakammaṃ kataṃ. Tvaññevetassa vipākaṃ paṭisaṃvedissasī’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā dutiyaṃ devadūtaṃ samanuyuñjitvā samanugāhitvā samanubhāsitvā, tatiyaṃ devadūtaṃ samanuyuñjati samanugāhati samanubhāsati – ‘ambho purisa, na tvaṃ addasa manussesu tatiyaṃ devadūtaṃ pātubhūta’nti? So evamāha – ‘nāddasaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho purisa, na tvaṃ addasa manussesu itthiṃ vā purisaṃ vā ekāhamataṃ vā dvīhamataṃ vā tīhamataṃ vā uddhumātakaṃ vinīlakaṃ vipubbakajāta’nti? So evamāha – ‘addasaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho purisa, tassa te viññussa sato mahallakassa na etadahosi – ahampi khomhi maraṇadhammo maraṇaṃ anatīto, handāhaṃ kalyāṇaṃ karomi kāyena vācāya manasā’ti? So evamāha – ‘nāsakkhissaṃ, bhante. Pamādassaṃ, bhante’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā evamāha – ‘ambho purisa, pamādatāya na kalyāṇamakāsi kāyena vācāya manasā. Taggha tvaṃ, ambho purisa, tathā karissanti yathā taṃ pamattaṃ. Taṃ kho pana te etaṃ pāpakammaṃ neva mātarā kataṃ, na pitarā kataṃ, na bhātarā kataṃ, na bhaginiyā kataṃ, na mittāmaccehi kataṃ, na ñātisālohitehi kataṃ, na devatāhi kataṃ, na samaṇabrāhmaṇehi kataṃ; atha kho tayāvetaṃ pāpakammaṃ kataṃ. Tvaññevetassa vipākaṃ paṭisaṃvedissasī’’’ti. ‘‘Tamenaṃ, bhikkhave, yamo rājā tatiyaṃ devadūtaṃ samanuyuñjitvā samanugāhitvā samanubhāsitvā tuṇhī hoti. Tamenaṃ, bhikkhave, nirayapālā pañcavidhabandhanaṃ nāma kāraṇaṃ karonti. Tattaṃ ayokhilaṃ hatthe gamenti. Tattaṃ ayokhilaṃ dutiyasmiṃ hatthe gamenti. Tattaṃ ayokhilaṃ pāde gamenti. Tattaṃ ayokhilaṃ dutiyasmiṃ pāde gamenti. Tattaṃ ayokhilaṃ majjhe urasmiṃ gamenti. So tattha dukkhā tibbā [tippā (sī.)] kharā kaṭukā vedanā vediyati, na ca tāva kālaṅkaroti yāva na taṃ pāpakammaṃ byantīhoti. ‘‘Tamenaṃ, bhikkhave, nirayapālā saṃvesetvā [saṃkaḍḍhitvā (ka.)] kudhārīhi tacchanti. So tattha dukkhā tibbā kharā kaṭukā vedanā vediyati, na ca tāva kālaṅkaroti yāva na taṃ pāpakammaṃ byantīhoti. ‘‘Tamenaṃ, bhikkhave, nirayapālā uddhaṃpādaṃ adhosiraṃ gahetvā vāsīhi tacchanti…pe… tamenaṃ, bhikkhave, nirayapālā rathe yojetvā ādittāya bhūmiyā sampajjalitāya sajotibhūtāya [sañjotibhūtāya (syā. kaṃ.)] sārentipi paccāsārentipi…pe… tamenaṃ, bhikkhave, nirayapālā mahantaṃ aṅgārapabbataṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ āropentipi oropentipi…pe… tamenaṃ, bhikkhave, nirayapālā uddhaṃpādaṃ adhosiraṃ gahetvā tattāya lohakumbhiyā pakkhipanti, ādittāya sampajjalitāya sajotibhūtāya. So tattha pheṇuddehakaṃ paccamāno sakimpi uddhaṃ gacchati, sakimpi adho gacchati, sakimpi tiriyaṃ gacchati. So tattha dukkhā tibbā kharā kaṭukā vedanā vediyati, na ca tāva kālaṃ karoti yāva na taṃ pāpakammaṃ byantīhoti. Tamenaṃ, bhikkhave, nirayapālā mahāniraye pakkhipanti. So kho pana, bhikkhave, mahānirayo – ‘‘Catukkaṇṇo catudvāro, vibhatto bhāgaso mito; Ayopākārapariyanto, ayasā paṭikujjito. ‘‘Tassa ayomayā bhūmi, jalitā tejasā yutā; Samantā yojanasataṃ, pharitvā tiṭṭhati sabbadā’’ti [pe. va. 70-71, 240-241]. ‘‘Bhūtapubbaṃ, bhikkhave, yamassa rañño etadahosi – ‘ye kira, bho, loke pāpakāni kammāni karonti te evarūpā vividhā kammakāraṇā karīyanti. Aho vatāhaṃ manussattaṃ labheyyaṃ, tathāgato ca loke uppajjeyya arahaṃ sammāsambuddho, tañcāhaṃ bhagavantaṃ payirupāseyyaṃ. So ca me bhagavā dhammaṃ deseyya, tassa cāhaṃ bhagavato dhammaṃ ājāneyya’nti. Taṃ kho panāhaṃ, bhikkhave, na aññassa samaṇassa vā brāhmaṇassa vā sutvā evaṃ vadāmi, api ca kho, bhikkhave, yadeva me sāmaṃ ñātaṃ sāmaṃ diṭṭhaṃ sāmaṃ viditaṃ tadevāhaṃ vadāmī’’ti. ‘‘Coditā devadūtehi, ye pamajjanti māṇavā; Te dīgharattaṃ socanti, hīnakāyūpagā narā. ‘‘Ye ca kho devadūtehi, santo sappurisā idha; Coditā nappamajjanti, ariyadhamme kudācanaṃ. ‘‘Upādāne bhayaṃ disvā, jātimaraṇasambhave; Anupādā vimuccanti, jātimaraṇasaṅkhaye. ‘‘Te appamattā [te khoppamattā (sī.), te khemappattā (syā. kaṃ. pī.) ma. ni. 3.271] sukhino [sukhitā (sī. syā.)], diṭṭhadhammābhinibbutā; Sabbaverabhayātītā, sabbadukkhaṃ upaccagu’’nti. chaṭṭhaṃ;",
      "english": "Monks, these are the three divine messengers. Which three? Here, monks, some individual performs misconduct with the body, performs misconduct with speech, performs misconduct with the mind. Having performed misconduct with the body, having performed misconduct with speech, having performed misconduct with the mind, at the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a ruinous state, in hell. Then, monks, the guardians of hell seize him by his various arms and present him to King Yama, saying: 'This man, O god, was undutiful to his mother, undutiful to his father, disrespectful to ascetics, disrespectful to brahmins, and did not honor the elders of his family. May your majesty inflict punishment upon him.'\n\nThen, monks, King Yama questions, probes, and confronts that person concerning the first divine messenger: 'My good man, did you not see the first divine messenger appear among humans?' He replies: 'No, venerable sir, I did not.' Then, monks, King Yama says to him: 'My good man, did you not see among humans a woman or a man, eighty, ninety, or a hundred years old, utterly decrepit, bent like a house-gable, frail, leaning on a stick, trembling as they walked, ailing, with youth long gone, with broken teeth, gray hair, thinning or bald head, wrinkled, with dark spots on their body?' He replies: 'Yes, venerable sir, I did.'\n\nThen, monks, King Yama says to him: 'My good man, since you were a discerning, mature person, did it not occur to you: \"I too am subject to old age, I have not passed beyond old age. Come, let me do good, with body, speech, and mind\"?' He replies: 'No, venerable sir, I was unable to. I was heedless, venerable sir.'\n\nThen, monks, King Yama says to him: 'My good man, because of your heedlessness, you did not do good with body, speech, or mind. Indeed, my good man, they will treat you in a way appropriate for one who was heedless. For this evil deed was not done by your mother, nor by your father, nor by your brother, nor by your sister, nor by your friends and companions, nor by your relatives by blood, nor by the deities, nor by ascetics or brahmins; rather, this evil deed was done by you yourself, and you yourself will experience its result.'\n\nThen, monks, after King Yama had questioned, probed, and confronted that person concerning the first divine messenger, he questions, probes, and confronts him concerning the second divine messenger: 'My good man, did you not see the second divine messenger appear among humans?' He replies: 'No, venerable sir, I did not.'\n\nThen, monks, King Yama says to him: 'My good man, did you not see among humans a woman or a man afflicted, suffering, gravely ill, lying in their own urine and feces, being lifted by others, being put to bed by others?' He replies: 'Yes, venerable sir, I did.'\n\nThen, monks, King Yama says to him: 'My good man, since you were a discerning, mature person, did it not occur to you: \"I too am subject to illness, I have not passed beyond illness. Come, let me do good with body, speech, and mind\"?' He replies: 'No, venerable sir, I was unable to. I was heedless, venerable sir.'\n\nThen, monks, King Yama says to him: 'My good man, because of your heedlessness, you did not do good with body, speech, or mind. Indeed, my good man, they will treat you in a way appropriate for one who was heedless. For this evil deed was not done by your mother, nor by your father, nor by your brother, nor by your sister, nor by your friends and companions, nor by your relatives by blood, nor by the deities, nor by ascetics or brahmins; rather, this evil deed was done by you yourself, and you yourself will experience its result.'\n\nThen, monks, after King Yama had questioned, probed, and confronted that person concerning the second divine messenger, he questions, probes, and confronts him concerning the third divine messenger: 'My good man, did you not see the third divine messenger appear among humans?' He replies: 'No, venerable sir, I did not.'\n\nThen, monks, King Yama says to him: 'My good man, did you not see among humans a woman or a man, dead for one day, or two days, or three days, bloated, discolored, and festering?' He replies: 'Yes, venerable sir, I did.'\n\nThen, monks, King Yama says to him: 'My good man, since you were a discerning, mature person, did it not occur to you: \"I too am subject to death, I have not passed beyond death. Come, let me do good with body, speech, and mind\"?' He replies: 'No, venerable sir, I was unable to. I was heedless, venerable sir.'\n\n“It was through negligence, Venerable Sir.”\n\n“Then, monks, King Yama says to him, ‘O man, through negligence you did not perform wholesome actions by body, speech, or mind. Indeed, O man, they will deal with you as befits one who was negligent. For this evil deed of yours was not done by your mother, nor by your father, nor by your brother, nor by your sister, nor by your friends and companions, nor by your relatives by blood, nor by devas, nor by recluses and brahmins; rather, this evil deed was done by you alone. You yourself will experience its result.’”\n\n“Then, monks, King Yama, having interrogated him, having cross-examined him, and having questioned him thoroughly concerning the third divine messenger, remains silent. Then, monks, the guardians of hell inflict upon him a torment called the five-fold binding. They drive a red-hot iron stake through one hand. They drive a red-hot iron stake through the second hand. They drive a red-hot iron stake through one foot. They drive a red-hot iron stake through the second foot. They drive a red-hot iron stake through the middle of his chest. There, he experiences feelings that are painful, sharp, severe, and bitter, and he does not pass away until that evil deed is exhausted.”\n\n“Then, monks, the guardians of hell throw him down and hack him with sharp axes. There, he experiences feelings that are painful, sharp, severe, and bitter, and he does not pass away until that evil deed is exhausted.”\n\n“Then, monks, the guardians of hell seize him with his feet upwards and head downwards, and they plane him with adzes. There, he experiences feelings that are painful, sharp, severe, and bitter, and he does not pass away until that evil deed is exhausted.”\n\n“Then, monks, the guardians of hell yoke him to a chariot and make him run back and forth on burning, blazing, glowing ground. There, he experiences feelings that are painful, sharp, severe, and bitter, and he does not pass away until that evil deed is exhausted.”\n\n“Then, monks, the guardians of hell make him climb up and down a great mountain of burning, blazing, glowing coals. There, he experiences feelings that are painful, sharp, severe, and bitter, and he does not pass away until that evil deed is exhausted.”\n\n“Then, monks, the guardians of hell seize him with his feet upwards and head downwards and throw him into a red-hot iron cauldron that is burning, blazing, and glowing. There, boiling and bubbling, he goes up once, down once, and across once. There, he experiences feelings that are painful, sharp, severe, and bitter, and he does not pass away until that evil deed is exhausted.”\n\n“Then, monks, the guardians of hell throw him into the Great Hell. And that Great Hell, monks, is:\n\nWith four corners and four gates,\nDivided into measured sections;\nEnclosed by an iron wall,\nCompletely shut with iron.\n\nIts ground is made of iron,\nBurning, endowed with glowing heat;\nIt always extends for a hundred leagues,\nOn all sides, it stands perpetually.”\n\n“Formerly, monks, this thought occurred to King Yama: ‘Indeed, those who perform evil deeds in this world undergo such various kinds of torment. Oh, if only I could attain human existence, and a Tathāgata, an Arahant, a Fully Enlightened One, would arise in the world! And I would attend upon that Blessed One, and that Blessed One would teach me the Dhamma, and I would understand the Dhamma of that Blessed One!’”\n\n“Indeed, monks, I do not say this having heard it from any other recluse or brahmin; but rather, monks, I say only what I have known myself, seen myself, and realized myself.”\n\n“Those young men who, urged on by the divine messengers, are negligent;\nThey sorrow for a long time, having gone to inferior states of existence.\n\nBut those virtuous and good people here who, urged on by the divine messengers,\nAre never negligent concerning the noble Dhamma.\n\nHaving seen fear in clinging, which is the cause of birth and death;\nUnattached, they are liberated, with the destruction of birth and death.\n\nThese diligent ones are happy, extinguished in this very life;\nHaving transcended all hostility and fear, they have gone beyond all suffering.”",
      "sinhala": "භික්ෂූන් වහන්ස, මේවා දිව්‍ය දූතයෝ තිදෙනෙකි. ඒ තිදෙන කවරහුද? භික්ෂූන් වහන්ස, මේ ලෝකයෙහි යම් කිසිවෙක් කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. ඔහු කයින් දුසිරිත්කොට, වචනයෙන් දුසිරිත්කොට, සිතින් දුසිරිත්කොට, ශරීරය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නමැති නිරයට උපදියි. භික්ෂූන් වහන්ස, නිරයපාලකයෝ (එම පුද්ගලයාගේ) දෙබාහුවෙන් ගෙන යම රජුට පෙන්වති – ‘දේවයන් වහන්ස, මේ පුරුෂයා මවට ගරු නොකළේය, පියාට ගරු නොකළේය, ශ්‍රමණයන්ට ගරු නොකළේය, බ්‍රාහ්මණයන්ට ගරු නොකළේය, කුලයේ වැඩිහිටියන්ට ගරු නොකළේය. දේවයන් වහන්ස, මේ පුද්ගලයාට දඬුවම් පනවනු මැනවි!’\n\nභික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට පළමු දිව්‍ය දූතයා පිළිබඳව විමසයි, අසයි, විස්තර කරයි – ‘අහෝ පුරුෂය, නුඹ මිනිසුන් අතර පහළ වූ පළමු දිව්‍ය දූතයා නොදුටුවෙහිද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, නොදුටුවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, නුඹ මිනිසුන් අතර අසූ වියැති, නැතහොත් අනූ වියැති, නැතහොත් සියක් වියැති, උපතින්ම වයසට ගිය, ගොපනැසි දණ්ඩක් මෙන් වකුටු වූ, ඉදිරියට නැමුණු, සැරයටියක් මත යැපෙන, වෙව්ලමින් යන, දුබල වූ, යොවුන් විය ඉක්මවූ, බිඳුණු දත් ඇති, පැසුණු කෙස් ඇති, ගැලවී ගිය කෙස් ඇති, තට්ට වූ හිස ඇති, රැලි වැටුණු, තිලක පහර කෑ ශරීරයක් ඇති ස්ත්‍රියක් හෝ පුරුෂයෙක් නොදුටුවෙහිද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, දුටුවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, එසේ නම් විඥානවන්ත වූ වැඩිහිටියෙකු වූ ඔබට ‘මමත් ජරාවට පත්වන ස්වභාවය ඇත්තෙමි, ජරාව ඉක්මවා ගියේ නොවේ. එබැවින් මම කයින්, වචනයෙන්, සිතින් යහපත් ක්‍රියා කරමි’ යන අදහස ඇති නොවීද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, මට නොහැකි විය. ස්වාමීනි, මම ප්‍රමාද වූවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, ප්‍රමාද බව නිසා නුඹ කයින්, වචනයෙන්, සිතින් යහපත් ක්‍රියා නොකළේය. එබැවින් අහෝ පුරුෂය, ඒ ප්‍රමාද වූ ඔබට සුදුසු පරිදිම ඔවුහු ඔබට සලකනු ඇත. මේ ඔබේ පාප කර්මය මව විසින් කරන ලද්දක් නොවේ, පියා විසින් කරන ලද්දක් නොවේ, සහෝදරයා විසින් කරන ලද්දක් නොවේ, සහෝදරිය විසින් කරන ලද්දක් නොවේ, මිත්‍රාමාත්‍යයන් විසින් කරන ලද්දක් නොවේ, ඥාති සාලෝහිතයන් විසින් කරන ලද්දක් නොවේ, දෙවියන් විසින් කරන ලද්දක් නොවේ, ශ්‍රමණයන් හෝ බ්‍රාහ්මණයන් විසින් කරන ලද්දක් නොවේ. එහෙත් මේ පාප කර්මය නුඹ විසින්ම කරන ලද්දකි. නුඹම එහි විපාක විඳිනු ඇත.’\n\nභික්ෂූන් වහන්ස, යම රජු පළමු දිව්‍ය දූතයා පිළිබඳව විමසා, විමර්ශනය කොට, විස්තර කොට, දෙවන දිව්‍ය දූතයා පිළිබඳව විමසයි, අසයි, විස්තර කරයි – ‘අහෝ පුරුෂය, නුඹ මිනිසුන් අතර පහළ වූ දෙවන දිව්‍ය දූතයා නොදුටුවෙහිද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, නොදුටුවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, නුඹ මිනිසුන් අතර රෝගී වූ, දුක් විඳින, ඉතා දරුණු ලෙස ගිලන් වූ, තමාගේ මුත්‍ර හා මළපහෙහි වැටී සිටින, අනුන් විසින් ඔසවා තැබෙන, අනුන් විසින් නිදි කරවනු ලබන ස්ත්‍රියක් හෝ පුරුෂයෙක් නොදුටුවෙහිද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, දුටුවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, එසේ නම් විඥානවන්ත වූ වැඩිහිටියෙකු වූ ඔබට ‘මමත් ව්‍යාධියට පත්වන ස්වභාවය ඇත්තෙමි, ව්‍යාධිය ඉක්මවා ගියේ නොවේ. එබැවින් මම කයින්, වචනයෙන්, සිතින් යහපත් ක්‍රියා කරමි’ යන අදහස ඇති නොවීද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, මට නොහැකි විය. ස්වාමීනි, මම ප්‍රමාද වූවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, ප්‍රමාද බව නිසා නුඹ කයින්, වචනයෙන්, සිතින් යහපත් ක්‍රියා නොකළේය. එබැවින් අහෝ පුරුෂය, ඒ ප්‍රමාද වූ ඔබට සුදුසු පරිදිම ඔවුහු ඔබට සලකනු ඇත. මේ ඔබේ පාප කර්මය මව විසින් කරන ලද්දක් නොවේ, පියා විසින් කරන ලද්දක් නොවේ, සහෝදරයා විසින් කරන ලද්දක් නොවේ, සහෝදරිය විසින් කරන ලද්දක් නොවේ, මිත්‍රාමාත්‍යයන් විසින් කරන ලද්දක් නොවේ, ඥාති සාලෝහිතයන් විසින් කරන ලද්දක් නොවේ, දෙවියන් විසින් කරන ලද්දක් නොවේ, ශ්‍රමණයන් හෝ බ්‍රාහ්මණයන් විසින් කරන ලද්දක් නොවේ. එහෙත් මේ පාප කර්මය නුඹ විසින්ම කරන ලද්දකි. නුඹම එහි විපාක විඳිනු ඇත.’\n\nභික්ෂූන් වහන්ස, යම රජු දෙවන දිව්‍ය දූතයා පිළිබඳව විමසා, විමර්ශනය කොට, විස්තර කොට, තුන්වන දිව්‍ය දූතයා පිළිබඳව විමසයි, අසයි, විස්තර කරයි – ‘අහෝ පුරුෂය, නුඹ මිනිසුන් අතර පහළ වූ තුන්වන දිව්‍ය දූතයා නොදුටුවෙහිද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, නොදුටුවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, නුඹ මිනිසුන් අතර එක් දිනක් මළ වූ, දෙදිනක් මළ වූ, තෙදිනක් මළ වූ, ඉදිමුණු, නිල් පැහැ ගැන්වුණු, සැරව ඇති වූ ස්ත්‍රියක් හෝ පුරුෂයෙක් නොදුටුවෙහිද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, දුටුවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, එසේ නම් විඥානවන්ත වූ වැඩිහිටියෙකු වූ ඔබට ‘මමත් මරණයට පත්වන ස්වභාවය ඇත්තෙමි, මරණය ඉක්මවා ගියේ නොවේ. එබැවින් මම කයින්, වචනයෙන්, සිතින් යහපත් ක්‍රියා කරමි’ යන අදහස ඇති නොවීද?’ ඔහු මෙසේ කියයි – ‘ස්වාමීනි, මට නොහැකි විය. ස්වාමීනි, මම ප්‍රමාද වූවෙමි.’ භික්ෂූන් වහන්ස, යම රජු ඒ පුද්ගලයාට මෙසේ කියයි – ‘අහෝ පුරුෂය, ප්‍රමාද බව නිසා නුඹ කයින්, වචනයෙන්, සිතින් යහපත් ක්‍රියා නොකළේය. එබැවින් අහෝ පුරුෂය, ඒ ප්‍රමාද වූ ඔබට සුදුසු පරිදිම ඔවුහු ඔබට සලකනු ඇත. මේ ඔබේ පාප කර්මය මව විසින් කරන ලද්දක් නොවේ, පියා විසින් කරන ලද්දක් නොවේ, සහෝදරයා විසින් කරන ලද්දක් නොවේ, සහෝදරිය විසින් කරන ලද්දක් නොවේ, මිත්‍රාමාත්‍යයන් විසින් කරන ලද්දක් නොවේ, ඥාති සාලෝහිතයන් විසින් කරන ලද්දක් නොවේ, දෙවියන් විසින් කරන ලද්දක් නොවේ, ශ්‍රමණයන් හෝ බ්‍රාහ්මණයන් විසින් කරන ලද්දක් නොවේ. එහෙත් මේ පාප කර්මය නුඹ විසින්ම කරන ලද්දකි. නුඹම එහි විපාක විඳිනු ඇත.’\n\nස්වාමීනි, එය මගේ ප්‍රමාදයයි.\n\nමහණෙනි, එකල්හි යම රජු ඔහුට මෙසේ කීය: එම්බල පුරුෂය, නුඹ ප්‍රමාද වූ නිසා කයින්, වචනයෙන්, සිතින් යහපත් දෙයක් නොකළෙහි. නුඹට ප්‍රමාද වූ අයට කරන්නාක් මෙන්, එම්බල පුරුෂය, නුඹට ද එසේම කරනු ඇත. එහෙත් නුඹ කළ මේ පාපකර්මය මව විසින් හෝ පියා විසින් හෝ සොහොයුරා විසින් හෝ සොහොයුරිය විසින් හෝ මිතුරන් හා ඇමතියන් විසින් හෝ ඥාති සනුහරින් විසින් හෝ දෙවියන් විසින් හෝ ශ්‍රමණ බ්‍රාහ්මණයන් විසින් හෝ කරන ලද්දක් නොවේ. එහෙත් මේ පාපකර්මය නුඹ විසින්ම කරන ලද්දකි. එහි විපාකය නුඹ විසින්ම විඳිනු ඇත. මහණෙනි, එකල්හි යම රජු තුන්වන දෙව්දූතයා (මරණය) ගැන ද එලෙසින්ම ප්‍රශ්න කර, විමසා, කතාබස් කර නිහඬ විය.\n\nමහණෙනි, එකල්හි නිරයපාලකයෝ ඔහුට පස්වැදෑරුම් බන්ධනය නම් වූ වධහිංසාව පමුණුවති. රත් වූ යකඩ ඇණයක් එක් අතකට ගසති. රත් වූ යකඩ ඇණයක් දෙවන අතට ගසති. රත් වූ යකඩ ඇණයක් එක් පයකට ගසති. රත් වූ යකඩ ඇණයක් දෙවන පයකට ගසති. රත් වූ යකඩ ඇණයක් පපුවේ මැදට ගසති. ඔහු එහිදී දුක්ඛිත, තීව්‍ර, රළු, කටුක වේදනා විඳියි. එහෙත් එම පාපකර්මය ක්ෂය වන තුරු ඔහු නොමැරෙයි.\n\nමහණෙනි, එකල්හි නිරයපාලකයෝ ඔහු පෙරළා තියුණු පොරෝවලින් කපති. ඔහු එහිදී දුක්ඛිත, තීව්‍ර, රළු, කටුක වේදනා විඳියි. එහෙත් එම පාපකර්මය ක්ෂය වන තුරු ඔහු නොමැරෙයි.\n\nමහණෙනි, එකල්හි නිරයපාලකයෝ ඔහු පා ඉහළට, හිස පහළට සිටින සේ අල්ලා, වෑයන්ගෙන් කපති. මහණෙනි, එකල්හි නිරයපාලකයෝ ඔහු රථයකට යොදා, ඇවිළී දැවෙමින්, තේජසින් බබළමින් පවතින ගිනිගත් භූමිය මත ඉදිරියටත් පස්සටත් පදවති. මහණෙනි, එකල්හි නිරයපාලකයෝ ඔහු ඇවිළී දැවෙමින්, තේජසින් බබළමින් පවතින මහා අඟුරු පර්වතයක් මතට නග්ගවති, බස්සවති. මහණෙනි, එකල්හි නිරයපාලකයෝ ඔහු පා ඉහළට, හිස පහළට සිටින සේ අල්ලා, ඇවිළී දැවෙමින්, තේජසින් බබළමින් පවතින රත් වූ යකඩ වළඳක දමති. එහිදී ඔහු පෙණ නඟමින් තැම්බෙමින්, සමහර විට ඉහළට යයි, සමහර විට පහළට යයි, සමහර විට තිරශ්චීනව යයි. ඔහු එහිදී දුක්ඛිත, තීව්‍ර, රළු, කටුක වේදනා විඳියි. එහෙත් එම පාපකර්මය ක්ෂය වන තුරු ඔහු නොමැරෙයි.\n\nමහණෙනි, එකල්හි නිරයපාලකයෝ ඔහුව මහානිරයට දමති. මහණෙනි, ඒ මහානිරය සිව් කොන් ඇත්තේය, සිව් දොරටු ඇත්තේය, කොටස් වශයෙන් බෙදන ලද්දේය, මැනවින් සකස් කරන ලද්දේය. යකඩ ප්‍රාකාරයකින් වට වූ, යකඩයෙන්ම වසා දමන ලද්දේය. එහි භූමිය යකඩමය, දැල්වී තේජසින් යුක්තය. යොදුන් සියයක් පමණ සතර දිශාවටම විහිදී නිරතුරුවම පවතී.\n\nමහණෙනි, පෙර කලෙක යම රජුට මෙබඳු අදහසක් ඇති විය: ‘අහෝ! මේ ලෝකයේ යම් පුද්ගලයෝ පාපකර්ම කරත්ද, ඔවුනට මෙබඳු නානාවිධ දඬුවම් පමුණුවනු ලබයි. අහෝ! මම මනුෂ්‍ය ආත්මභාවයක් ලබන්නට ලැබුණා නම්! ලොවට අරහත් වූ සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේ නමක් පහළ වූවා නම්! මම ඒ භාග්‍යවතුන් වහන්සේ ඇසුරු කරන්නෙමි! ඒ භාග්‍යවතුන් වහන්සේ මට ධර්මය දේශනා කරනු ඇත! මම ඒ භාග්‍යවතුන් වහන්සේගේ ධර්මය අවබෝධ කරගන්නෙමි!’ මහණෙනි, මා මේ දේශනා කරන්නේ අන් කිසිදු ශ්‍රමණයෙකුගෙන් හෝ බ්‍රාහ්මණයෙකුගෙන් හෝ අසා නොවේ. මහණෙනි, මම මා විසින්ම දැනගත්, මා විසින්ම දුටු, මා විසින්ම අවබෝධ කරගත් දේම දේශනා කරමි.\n\nදෙව්දූතයන් විසින් අවවාද කරන ලදුවත්, යම් මිනිස්සු ප්‍රමාද වෙද්ද, ඒ මිනිස්සු බොහෝ කලක් ශෝක කරති, පහත් භවයන්හි උපදිති.\n\nයම් සත්පුරුෂයෝ මෙහිලා දෙව්දූතයන් විසින් අවවාද කරන ලදුව, ආර්ය ධර්මයෙහි කිසි කලෙක ප්‍රමාද නොවෙත්ද,\n\nජාති-මරණ ඇති වීමට හේතුවන උපාදානයන්හි භයක් දැක, උපාදාන රහිතව ජාති-මරණ ක්ෂය වීමෙන් මුදෙති.\n\nඔවුන් අප්‍රමාදීව, සුවපත් වූ, මේ දැක්මෙහිම නිවී ගිය අය වෙති. සියලු වෛරයෙන් හා භයින් මිදී, සියලු දුක ඉක්මවා ගියෝ වෙති.",
      "paliTitle": "Devadūtasuttaṃ",
      "englishTitle": "The Divine Messengers",
      "sinhalaTitle": "දේවදූත සූත්‍රය"
    },
    {
      "number": 37,
      "pali": "‘‘Aṭṭhamiyaṃ, bhikkhave, pakkhassa catunnaṃ mahārājānaṃ amaccā pārisajjā imaṃ lokaṃ anuvicaranti – ‘kacci bahū manussā manussesu matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino uposathaṃ upavasanti paṭijāgaronti puññāni karontī’ti. Cātuddasiṃ, bhikkhave, pakkhassa catunnaṃ mahārājānaṃ puttā imaṃ lokaṃ anuvicaranti – ‘kacci bahū manussā manussesu matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino uposathaṃ upavasanti paṭijāgaronti puññāni karontī’ti. Tadahu, bhikkhave, uposathe pannarase cattāro mahārājāno sāmaññeva imaṃ lokaṃ anuvicaranti – ‘kacci bahū manussā manussesu matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino uposathaṃ upavasanti paṭijāgaronti puññāni karontī’’’ti. ‘‘Sace, bhikkhave, appakā honti manussā manussesu matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino uposathaṃ upavasanti paṭijāgaronti puññāni karonti. Tamenaṃ, bhikkhave, cattāro mahārājāno devānaṃ tāvatiṃsānaṃ sudhammāya sabhāya sannisinnānaṃ sannipatitānaṃ ārocenti – ‘appakā kho, mārisā, manussā manussesu matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino uposathaṃ upavasanti paṭijāgaronti puññāni karontī’ti. Tena kho, bhikkhave, devā tāvatiṃsā anattamanā honti – ‘dibbā vata, bho, kāyā parihāyissanti, paripūrissanti asurakāyā’’’ti. ‘‘Sace pana, bhikkhave, bahū honti manussā manussesu matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino uposathaṃ upavasanti paṭijāgaronti puññāni karonti. Tamenaṃ, bhikkhave, cattāro mahārājāno devānaṃ tāvatiṃsānaṃ sudhammāya sabhāya sannisinnānaṃ sannipatitānaṃ ārocenti – ‘bahū kho, mārisā, manussā manussesu matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino uposathaṃ upavasanti paṭijāgaronti puññāni karontī’ti. Tena, bhikkhave, devā tāvatiṃsā attamanā honti – ‘dibbā vata, bho, kāyā paripūrissanti, parihāyissanti asurakāyā’’’ti. ‘‘Bhūtapubbaṃ, bhikkhave, sakko devānamindo deve tāvatiṃse anunayamāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Cātuddasiṃ pañcadasiṃ, yā ca pakkhassa aṭṭhamī; Pāṭihāriyapakkhañca, aṭṭhaṅgasusamāgataṃ; Uposathaṃ upavaseyya, yopissa [yopassa (sī. syā. kaṃ. pī.)] mādiso naro’’ti. ‘‘Sā kho panesā, bhikkhave, sakkena devānamindena gāthā duggītā na sugītā dubbhāsitā na subhāsitā. Taṃ kissa hetu? Sakko hi, bhikkhave, devānamindo avītarāgo avītadoso avītamoho. ‘‘Yo ca kho so, bhikkhave, bhikkhu arahaṃ khīṇāsavo vusitavā brahmacariyo katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, tassa kho etaṃ, bhikkhave, bhikkhuno [tassa kho etaṃ bhikkhuno (sī. syā.), tassa kho evaṃ bhikkhave bhikkhuno (ka.)] kallaṃ vacanāya – ‘‘Cātuddasiṃ pañcadasiṃ, yā ca pakkhassa aṭṭhamī; Pāṭihāriyapakkhañca, aṭṭhaṅgasusamāgataṃ; Uposathaṃ upavaseyya, yopissa mādiso naro’’ti. ‘‘Taṃ kissa hetu? So hi, bhikkhave, bhikkhu vītarāgo vītadoso vītamoho’’ti. Sattamaṃ.",
      "english": "Monks, on the eighth day of the fortnight, the ministers and retinues of the four Great Kings travel throughout this world, asking: 'Are there many people among humankind who are respectful towards their mothers and fathers, respectful towards ascetics and brahmins, honor the elders in their families, observe the Uposatha, stay vigilant, and perform meritorious deeds?' Monks, on the fourteenth day of the fortnight, the sons of the four Great Kings travel throughout this world, asking: 'Are there many people among humankind who are respectful towards their mothers and fathers, respectful towards ascetics and brahmins, honor the elders in their families, observe the Uposatha, stay vigilant, and perform meritorious deeds?' Then, monks, on the Uposatha day, the fifteenth day of the fortnight, the four Great Kings themselves travel throughout this world, asking: 'Are there many people among humankind who are respectful towards their mothers and fathers, respectful towards ascetics and brahmins, honor the elders in their families, observe the Uposatha, stay vigilant, and perform meritorious deeds?'\n\nIf, monks, there are few people among humankind who are respectful towards their mothers and fathers, respectful towards ascetics and brahmins, honor the elders in their families, observe the Uposatha, stay vigilant, and perform meritorious deeds, then, monks, the four Great Kings report this to the Tāvatiṃsa gods, who are seated and assembled in the Sudhammā assembly hall: 'Indeed, dear sirs, few are the people among humankind who are respectful towards their mothers and fathers, respectful towards ascetics and brahmins, honor the elders in their families, observe the Uposatha, stay vigilant, and perform meritorious deeds.' Because of this, monks, the Tāvatiṃsa gods are displeased, thinking: 'Alas, the divine hosts will diminish, and the hosts of asuras will grow full.'\n\nBut if, monks, there are many people among humankind who are respectful towards their mothers and fathers, respectful towards ascetics and brahmins, honor the elders in their families, observe the Uposatha, stay vigilant, and perform meritorious deeds, then, monks, the four Great Kings report this to the Tāvatiṃsa gods, who are seated and assembled in the Sudhammā assembly hall: 'Indeed, dear sirs, many are the people among humankind who are respectful towards their mothers and fathers, respectful towards ascetics and brahmins, honor the elders in their families, observe the Uposatha, stay vigilant, and perform meritorious deeds.' Because of this, monks, the Tāvatiṃsa gods are pleased, thinking: 'Alas, the divine hosts will grow full, and the hosts of asuras will diminish!'\n\nMonks, in the past, Sakka, the king of devas, encouraging the Tāvatiṃsa devas, on that occasion recited this verse: \"Let any person who is like me observe the Uposatha, endowed with the eight factors, on the fourteenth, the fifteenth, and the eighth day of the fortnight, and on the special observance days.\"\n\nIndeed, monks, that verse recited by Sakka, the king of devas, was ill-sung, not well-sung; ill-spoken, not well-spoken. For what reason? Because, monks, Sakka, the king of devas, is not yet free from lust, not yet free from hatred, and not yet free from delusion.\n\nBut that monk, monks, who is an Arahant, whose defilements are exhausted, who has lived the holy life, who has accomplished what was to be done, who has laid down the burden, who has achieved their own true aim, who has totally destroyed the fetters of existence, and who is completely liberated through right knowledge — for such a monk, monks, it is appropriate to say this: \"Let any person who is like me observe the Uposatha, endowed with the eight factors, on the fourteenth, the fifteenth, and the eighth day of the fortnight, and on the special observance days.\"\n\nFor what reason? Because, monks, that monk is free from lust, free from hatred, and free from delusion.",
      "sinhala": "භික්‍ෂූණි, මසෙහි අටවක දිනට සතරවරම් මහරජවරුන්ගේ ඇමතිවරු සහ පිරිවර සේවකයෝ 'මනුෂ්‍යයන් අතරින් මව්පියන්ට, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට ගරු කරන, කුලදෙටුවන්ට ආචාර කරන බොහෝ මනුෂ්‍යයෝ උපෝසථ සීලය සමාදන් වෙත්ද, පිබිදීමෙන් කටයුතු කරත්ද, පින්කම් කරත්දැ'යි විමසමින් මේ ලෝකයෙහි සැරිසරති. භික්‍ෂූණි, මසෙහි චතුර්දශිය (පුර පසළොස්වක හෝ අව පසළොස්වක පෙර දින) දිනට සතරවරම් මහරජවරුන්ගේ පුත්‍රයෝ 'මනුෂ්‍යයන් අතරින් මව්පියන්ට, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට ගරු කරන, කුලදෙටුවන්ට ආචාර කරන බොහෝ මනුෂ්‍යයෝ උපෝසථ සීලය සමාදන් වෙත්ද, පිබිදීමෙන් කටයුතු කරත්ද, පින්කම් කරත්දැ'යි විමසමින් මේ ලෝකයෙහි සැරිසරති. භික්‍ෂූණි, එදිනම උපෝසථ දිනය වූ පසළොස්වක දිනට සතරවරම් මහරජවරු තමන් විසින්ම 'මනුෂ්‍යයන් අතරින් මව්පියන්ට, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට ගරු කරන, කුලදෙටුවන්ට ආචාර කරන බොහෝ මනුෂ්‍යයෝ උපෝසථ සීලය සමාදන් වෙත්ද, පිබිදීමෙන් කටයුතු කරත්ද, පින්කම් කරත්දැ'යි විමසමින් මේ ලෝකයෙහි සැරිසරති.\n\nභික්‍ෂූණි, යම් හෙයකින් මනුෂ්‍යයන් අතරින් මව්පියන්ට, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට ගරු කරන, කුලදෙටුවන්ට ආචාර කරන මනුෂ්‍යයෝ උපෝසථ සීලය සමාදන් වී, පිබිදීමෙන් කටයුතු කරමින්, පින්කම් කරන්නේ ස්වල්ප දෙනෙක් නම්, භික්‍ෂූණි, එවිට සතරවරම් මහරජවරු තව්තිසා දෙවියන් සුධර්මා නම් දෙව්සබාවෙහි රැස්ව සිටින තැනට ගොස් 'පින්වත්නි, මනුෂ්‍යයන් අතරින් මව්පියන්ට, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට ගරු කරන, කුලදෙටුවන්ට ආචාර කරන මනුෂ්‍යයෝ උපෝසථ සීලය සමාදන් වී, පිබිදීමෙන් කටයුතු කරමින්, පින්කම් කරන්නේ ස්වල්ප දෙනෙකි' යි දන්වති. භික්‍ෂූණි, එවිට තව්තිසා දෙවියෝ 'අහෝ පින්වත්නි, දිව්‍ය ශරීර සංඛ්‍යාව ක්ෂය වී යන්නේය, අසුර ශරීර සංඛ්‍යාව පිරී යන්නේය' යි අසතුටට පත්වෙති.\n\nභික්‍ෂූණි, යම් හෙයකින් මනුෂ්‍යයන් අතරින් මව්පියන්ට, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට ගරු කරන, කුලදෙටුවන්ට ආචාර කරන මනුෂ්‍යයෝ උපෝසථ සීලය සමාදන් වී, පිබිදීමෙන් කටයුතු කරමින්, පින්කම් කරන්නේ බොහෝ දෙනෙක් නම්, භික්‍ෂූණි, එවිට සතරවරම් මහරජවරු තව්තිසා දෙවියන් සුධර්මා නම් දෙව්සබාවෙහි රැස්ව සිටින තැනට ගොස් 'පින්වත්නි, මනුෂ්‍යයන් අතරින් මව්පියන්ට, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට ගරු කරන, කුලදෙටුවන්ට ආචාර කරන මනුෂ්‍යයෝ උපෝසථ සීලය සමාදන් වී, පිබිදීමෙන් කටයුතු කරමින්, පින්කම් කරන්නේ බොහෝ දෙනෙකි' යි දන්වති. භික්‍ෂූණි, එවිට තව්තිසා දෙවියෝ 'අහෝ පින්වත්නි, දිව්‍ය ශරීර සංඛ්‍යාව පිරී යන්නේය, අසුර ශරීර සංඛ්‍යාව ක්ෂය වී යන්නේය' යි සතුටට පත්වෙති.\n\nභික්‍ෂූණි, පෙර කලෙක සක් දෙවිඳු තව්තිසා දෙවියන්ට අනුශාසනා කරමින් ඒ වේලාවෙහි මේ ගාථාව ප්‍රකාශ කළේය: “චතුර්දශිය ද, පසළොස්වක ද, මසෙහි අටවක ද, පාටිහාරිය පක්‍ෂයේ දින ද යන මේ දිනවල අට අංගයන්ගෙන් යුක්ත වූ උපෝසථය, මා හා සමාන යම් පුරුෂයෙක් වේද, ඔහු සමාදන් විය යුතුය.”\n\nභික්‍ෂූණි, සක් දෙවිඳු විසින් කියන ලද මේ ගාථාව දුර්ගායනා කරන ලද්දකි, සුගායනා කරන ලද්දක් නොවේ. දුර්භාෂිතයකි, සුභාෂිතයක් නොවේ. එයට හේතුව කුමක්ද? භික්‍ෂූණි, සක් දෙවිඳු තවමත් රාගයෙන් තොර නොවූවෙකි, ද්වේෂයෙන් තොර නොවූවෙකි, මෝහයෙන් තොර නොවූවෙකි.\n\nභික්‍ෂූණි, යම් භික්‍ෂුවක් රහත් වූයේ, ක්ෂීණාශ්‍රව වූයේ, බ්‍රහ්මචර්යාවෙහි විසූයේ, කළ යුතු දේ කළේ, බර බහා තැබුවේ, තම අරමුණට පැමිණියේ, භව සංයෝජන ක්ෂය කළේ, මනාකොට අවබෝධයෙන් විමුක්ත වූයේ වේද, භික්‍ෂූණි, ඒ භික්‍ෂුවට මේ වචනය පැවසීම සුදුසු වන්නේය: “චතුර්දශිය ද, පසළොස්වක ද, මසෙහි අටවක ද, පාටිහාරිය පක්‍ෂයේ දින ද යන මේ දිනවල අට අංගයන්ගෙන් යුක්ත වූ උපෝසථය, මා හා සමාන යම් පුරුෂයෙක් වේද, ඔහු සමාදන් විය යුතුය.”\n\nඑයට හේතුව කුමක්ද? භික්‍ෂූණි, ඒ භික්‍ෂුව රාගයෙන් තොර වූවෙකි, ද්වේෂයෙන් තොර වූවෙකි, මෝහයෙන් තොර වූවෙකි.",
      "paliTitle": "Catumahārājasuttaṃ",
      "englishTitle": "The Four Great Kings Sutta",
      "sinhalaTitle": "චතුමහාරාජ සූත්‍රය"
    },
    {
      "number": 38,
      "pali": "‘‘Bhūtapubbaṃ, bhikkhave, sakko devānamindo deve tāvatiṃse anunayamāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Cātuddasiṃ pañcadasiṃ, yā ca pakkhassa aṭṭhamī; Pāṭihāriyapakkhañca, aṭṭhaṅgasusamāgataṃ; Uposathaṃ upavaseyya, yopissa mādiso naro’’ti. ‘‘Sā kho panesā, bhikkhave, sakkena devānamindena gāthā duggītā na sugītā dubbhāsitā na subhāsitā. Taṃ kissa hetu? Sakko hi, bhikkhave, devānamindo aparimutto jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, aparimutto dukkhasmāti vadāmi. ‘‘Yo ca kho so, bhikkhave, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, tassa kho etaṃ, bhikkhave, bhikkhuno kallaṃ vacanāya – ‘‘Cātuddasiṃ pañcadasiṃ, yā ca pakkhassa aṭṭhamī; Pāṭihāriyapakkhañca, aṭṭhaṅgasusamāgataṃ; Uposathaṃ upavaseyya, yopissa mādiso naro’’ti. ‘‘Taṃ kissa hetu? So hi, bhikkhave, bhikkhu parimutto jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, parimutto dukkhasmāti vadāmī’’ti. Aṭṭhamaṃ.",
      "english": "Formerly, bhikkhus, Sakka, king of the gods, exhorting the Tāvatiṃsa gods, at that time spoke this verse: “Whoever is a person like me should observe the Uposatha on the fourteenth day, the fifteenth day, and the eighth day of the fortnight, and also on the special observance day, complete with the eight constituents.”\n\nNow, bhikkhus, that verse spoken by Sakka, king of the gods, was ill-sung, not well-sung; ill-spoken, not well-spoken. What is the reason for that? For Sakka, bhikkhus, king of the gods, is not liberated from birth, old age, death, sorrow, lamentation, pain, dejection, and despair; I declare him not liberated from suffering.\n\nBut, bhikkhus, that bhikkhu who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what was to be done, who has laid down the burden, who has attained his own true goal, whose fetters to existence are utterly destroyed, who is fully liberated through perfect knowledge – for that bhikkhu, bhikkhus, it is fitting to say: “Whoever is a person like me should observe the Uposatha on the fourteenth day, the fifteenth day, and the eighth day of the fortnight, and also on the special observance day, complete with the eight constituents.”\n\nWhat is the reason for that? For that bhikkhu, bhikkhus, is liberated from birth, old age, death, sorrow, lamentation, pain, dejection, and despair; I declare him liberated from suffering.",
      "sinhala": "භික්ෂූණි, පෙර කලෙක දෙවියන්ට අධිපති වූ ශක්‍රයා තාවතිංස දෙවියන්ට අනුශාසනා කරමින් ඒ වේලෙහි මේ ගාථාව ප්‍රකාශ කළේය: “මාසයේ දහහතරවැනි දිනයෙහි ද, පසළොස්වැනි දිනයෙහි ද, පක්ෂයේ අටවැනි දිනයෙහි ද, ප්‍රාතිහාර්ය පක්ෂයෙහි ද, අංග අටකින් මැනවින් යුක්ත වූ උපෝසථය මා වැනි කවර හෝ පුරුෂයෙක් සමාදන් විය යුතුය.”\n\nභික්ෂූණි, දෙවියන්ට අධිපති වූ ශක්‍රයා විසින් කියන ලද මේ ගාථාව නම් දුර්වචනයකි, සුභාෂිතයක් නොවේ; අගුණ ලෙස කියන ලද්දකි, යහපත් ලෙස කියන ලද්දක් නොවේ. එයට හේතු කුමක් ද? භික්ෂූණි, දෙවියන්ට අධිපති වූ ශක්‍රයා නම් ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, ආයාසයෙන් නොමිදුණේය. දුකින් නොමිදුණේ යැයි මම කියමි.\n\nභික්ෂූණි, යම් භික්ෂුවක් නම් රහත් වූ, කෙලෙස් ක්‍ෂය කළ, බඹසර වැස නිම කළ, කළ යුතු දේ කළ, බර පහ කළ, තමන්ගේ අර්ථය සාදාගත්, භව සංයෝජන ක්‍ෂය කළ, නිරවුල් ඥානයෙන් මැනවින් විමුක්ත වූයේ වේ ද, භික්ෂූණි, ඒ භික්ෂුවට මේ වචනය කීම සුදුසු වන්නේය: “මාසයේ දහහතරවැනි දිනයෙහි ද, පසළොස්වැනි දිනයෙහි ද, පක්ෂයේ අටවැනි දිනයෙහි ද, ප්‍රාතිහාර්ය පක්ෂයෙහි ද, අංග අටකින් මැනවින් යුක්ත වූ උපෝසථය මා වැනි කවර හෝ පුරුෂයෙක් සමාදන් විය යුතුය.”\n\nඑයට හේතු කුමක් ද? භික්ෂූණි, ඒ භික්ෂුව නම් ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, ආයාසයෙන් මිදුණේය. දුකින් මිදුණේ යැයි මම කියමි.",
      "paliTitle": "Dutiyacatumahārājasuttaṃ",
      "englishTitle": "Second Sutta on the Four Great Kings",
      "sinhalaTitle": "දුතිය චතුමහාරාජ සූත්‍රය"
    },
    {
      "number": 39,
      "pali": "‘‘Sukhumālo ahaṃ, bhikkhave, paramasukhumālo accantasukhumālo. Mama sudaṃ, bhikkhave, pitu nivesane pokkharaṇiyo kāritā honti. Ekattha sudaṃ, bhikkhave, uppalaṃ vappati [pupphati (sī. pī.)], ekattha padumaṃ, ekattha puṇḍarīkaṃ, yāvadeva mamatthāya. Na kho panassāhaṃ, bhikkhave, akāsikaṃ candanaṃ dhāremi [kāsikaṃ candanaṃ dhāremi (syā. kaṃ. ka.), akāsikaṃ dhāremi (?)]. Kāsikaṃ, bhikkhave, su me taṃ veṭhanaṃ hoti, kāsikā kañcukā, kāsikaṃ nivāsanaṃ, kāsiko uttarāsaṅgo. Rattindivaṃ [rattidivaṃ (ka.)] kho pana me su taṃ, bhikkhave, setacchattaṃ dhārīyati – ‘mā naṃ phusi sītaṃ vā uṇhaṃ vā tiṇaṃ vā rajo vā ussāvo vā’’’ti. ‘‘Tassa mayhaṃ, bhikkhave, tayo pāsādā ahesuṃ – eko hemantiko, eko gimhiko, eko vassiko. So kho ahaṃ, bhikkhave, vassike pāsāde vassike cattāro māse nippurisehi tūriyehi paricārayamāno [paricāriyamāno (syā. kaṃ. pī. ka.)] na heṭṭhāpāsādaṃ orohāmi. Yathā kho pana, bhikkhave, aññesaṃ nivesane dāsakammakaraporisassa kaṇājakaṃ bhojanaṃ dīyati bilaṅgadutiyaṃ, evamevassu me, bhikkhave, pitu nivesane dāsakammakaraporisassa sālimaṃsodano dīyati. ‘‘Tassa mayhaṃ, bhikkhave, evarūpāya iddhiyā samannāgatassa evarūpena ca sukhumālena etadahosi – ‘assutavā kho puthujjano attanā jarādhammo samāno jaraṃ anatīto paraṃ jiṇṇaṃ disvā aṭṭīyati harāyati jigucchati attānaṃyeva atisitvā, ahampi khomhi jarādhammo jaraṃ anatīto. Ahañceva [ahañce (?)] kho pana jarādhammo samāno jaraṃ anatīto paraṃ jiṇṇaṃ disvā aṭṭīyeyyaṃ harāyeyyaṃ jiguccheyyaṃ na metaṃ assa patirūpa’nti. Tassa mayhaṃ, bhikkhave, iti paṭisañcikkhato yo yobbane yobbanamado so sabbaso pahīyi. ‘‘Assutavā kho puthujjano attanā byādhidhammo samāno byādhiṃ anatīto paraṃ byādhitaṃ disvā aṭṭīyati harāyati jigucchati attānaṃyeva atisitvā – ‘ahampi khomhi byādhidhammo byādhiṃ anatīto, ahañceva kho pana byādhidhammo samāno byādhiṃ anatīto paraṃ byādhikaṃ disvā aṭṭīyeyyaṃ harāyeyyaṃ jiguccheyyaṃ, na metaṃ assa patirūpa’nti. Tassa mayhaṃ, bhikkhave, iti paṭisañcikkhato yo ārogye ārogyamado so sabbaso pahīyi. ‘‘Assutavā kho puthujjano attanā maraṇadhammo samāno maraṇaṃ anatīto paraṃ mataṃ disvā aṭṭīyati harāyati jigucchati attānaṃyeva atisitvā – ‘ahampi khomhi maraṇadhammo, maraṇaṃ anatīto, ahaṃ ceva kho pana maraṇadhammo samāno maraṇaṃ anatīto paraṃ mataṃ disvā aṭṭīyeyyaṃ harāyeyyaṃ jiguccheyyaṃ, na metaṃ assa patirūpa’nti. Tassa mayhaṃ, bhikkhave, iti paṭisañcikkhato yo jīvite jīvitamado so sabbaso pahīyī’’ti. ‘‘Tayome, bhikkhave, madā. Katame tayo? Yobbanamado, ārogyamado, jīvitamado. Yobbanamadamatto vā, bhikkhave, assutavā puthujjano kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ārogyamadamatto vā, bhikkhave, assutavā puthujjano…pe… jīvitamadamatto vā, bhikkhave, assutavā puthujjano kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Yobbanamadamatto vā, bhikkhave, bhikkhu sikkhaṃ paccakkhāya hīnāyāvattati. Ārogyamadamatto vā, bhikkhave, bhikkhu…pe… jīvitamadamatto vā, bhikkhave, bhikkhu sikkhaṃ paccakkhāya hīnāyāvattatī’’ti. ‘‘Byādhidhammā jarādhammā, atho maraṇadhammino; Yathādhammā [byādhidhammo jarādhammo, atho maraṇadhammiko; yathā dhammo (ka.)] tathāsantā, jigucchanti puthujjanā. ‘‘Ahañce taṃ jiguccheyyaṃ, evaṃdhammesu pāṇisu; Na metaṃ patirūpassa, mama evaṃ vihārino. ‘‘Sohaṃ evaṃ viharanto, ñatvā dhammaṃ nirūpadhiṃ; Ārogye yobbanasmiñca, jīvitasmiñca ye madā. ‘‘Sabbe made abhibhosmi [atītosmi (ka.)], nekkhamme daṭṭhu khemataṃ; Tassa me ahu ussāho, nibbānaṃ abhipassato. ‘‘Nāhaṃ bhabbo etarahi, kāmāni paṭisevituṃ; Anivatti bhavissāmi, brahmacariyaparāyaṇo’’ti. navamaṃ;",
      "english": "Monks, I was exceedingly delicate, supremely delicate, utterly delicate. Monks, in my father’s residence, ponds were made. In one, Monks, blue lotuses bloomed, in another, red lotuses, and in yet another, white lotuses, solely for my enjoyment. Monks, I wore Kasi sandalwood. Monks, my turban was from Kasi, my tunic was from Kasi, my lower garment was from Kasi, and my upper robe was from Kasi. And Monks, day and night, a white parasol was held over me, so that I would not be touched by cold or heat, by grass or dust or dew.\n\nMonks, I had three palaces: one for the winter, one for the summer, and one for the rainy season. And Monks, in the rainy season palace, during the four months of the rainy season, while being entertained by female musicians, I would not descend from the upper palace floor. And Monks, just as in other residences, the servants and laborers are given broken rice with sour gruel, so too, Monks, in my father's residence, the servants and laborers were given fine rice with meat.\n\nMonks, though endowed with such prosperity and such delicate refinement, I had this thought: 'An untaught ordinary person, being himself subject to aging and not having transcended aging, seeing another who is old, is distressed, humiliated, and disgusted, despising himself. But I too am subject to aging and have not transcended aging. If I, being subject to aging and not having transcended aging, were to see another who is old and be distressed, humiliated, and disgusted, that would not be proper for me.' Monks, as I reflected in this way, the conceit of youth that I had regarding youth was completely abandoned.\n\nAn untaught ordinary person, being himself subject to sickness and not having transcended sickness, seeing another who is sick, is distressed, humiliated, and disgusted, despising himself. But I too am subject to sickness and have not transcended sickness. If I, being subject to sickness and not having transcended sickness, were to see another who is sick and be distressed, humiliated, and disgusted, that would not be proper for me. Monks, as I reflected in this way, the conceit of health that I had regarding health was completely abandoned.\n\nAn untaught ordinary person, being himself subject to death and not having transcended death, seeing another who has died, is distressed, humiliated, and disgusted, despising himself. But I too am subject to death and have not transcended death. If I, being subject to death and not having transcended death, were to see another who has died and be distressed, humiliated, and disgusted, that would not be proper for me. Monks, as I reflected in this way, the conceit of life that I had regarding life was completely abandoned.\n\nMonks, there are these three conceits. What are the three? The conceit of youth, the conceit of health, and the conceit of life. Monks, an untaught ordinary person, intoxicated by the conceit of youth, engages in misconduct by body, misconduct by speech, and misconduct by mind. Having engaged in misconduct by body, misconduct by speech, and misconduct by mind, at the breaking up of the body, after death, he reappears in a state of deprivation, a miserable destination, a downfall, in hell. Or, Monks, an untaught ordinary person, intoxicated by the conceit of health, engages in misconduct by body, misconduct by speech, and misconduct by mind. Or, Monks, an untaught ordinary person, intoxicated by the conceit of life, engages in misconduct by body, misconduct by speech, and misconduct by mind. Having engaged in misconduct by body, misconduct by speech, and misconduct by mind, at the breaking up of the body, after death, he reappears in a state of deprivation, a miserable destination, a downfall, in hell.\n\nOr, Monks, a monk intoxicated by the conceit of youth, having renounced the training, reverts to a lower state. Or, Monks, a monk intoxicated by the conceit of health, having renounced the training, reverts to a lower state. Or, Monks, a monk intoxicated by the conceit of life, having renounced the training, reverts to a lower state.\n\nSubject to sickness, subject to aging, and also subject to death;\nBeing of such nature, ordinary people are disgusted.\n\nIf I were to feel disgust towards beings of such nature,\nThat would not be proper for me, living as I am.\n\nLiving thus, having known the Dhamma that is free from defilements,\nAll the conceits that pertain to health, youth, and life—\n\nAll those conceits I have transcended,\nHaving seen safety in renunciation;\nFor me, seeing Nibbana, enthusiasm arose.\n\nI am no longer capable of indulging in sensual pleasures;\nI shall be irreversible, dedicated to the holy life.",
      "sinhala": "භික්‍ෂූණි, මම ඉතා සියුමැලි වූයෙමි, අතිශයින් සියුමැලි වූයෙමි, පරම සියුමැලි වූයෙමි. භික්‍ෂූණි, මගේ පියාගේ නිවසේ පොකුණු තනවා තිබුණි. භික්‍ෂූණි, එක් පොකුණක උපුල් මල් ද, එක් පොකුණක පියුම් මල් ද, එක් පොකුණක පුණ්ඩරීක මල් ද මා වෙනුවෙන්ම වවා තිබුණි. භික්‍ෂූණි, මම සාමාන්‍ය සඳුන් නොගල්වන ලදිමි. භික්‍ෂූණි, මාගේ හිස් වැස්ම කාසි වස්ත්‍රයෙන් විය, හැට්ටය කාසි වස්ත්‍රයෙන් විය, යට සාය කාසි වස්ත්‍රයෙන් විය, උතුරු සළුව කාසි වස්ත්‍රයෙන් විය. භික්‍ෂූණි, සීතලක් හෝ රස්නයක් හෝ තෘණයක් හෝ දූවිල්ලක් හෝ පිනි බිඳක් හෝ මට නොපැමිණේවා’යි දවාලෙහි ද රාත්‍රියෙහි ද මා වෙනුවෙන් සුදු සෙවෙණැල්ලක් අල්වාගෙන සිටින ලදි.\n\nභික්‍ෂූණි, මට මාලිගා තුනක් විය – එකක් හේමන්ත ඍතුවට ද, එකක් ගිම්හාන ඍතුවට ද, එකක් වස්සාන ඍතුවට ද විය. භික්‍ෂූණි, මම වස්සාන ඍතුවේ මාලිගාවේ වස්සාන ඍතුවේ මාස හතර පුරා, පුරුෂයන් නොමැතිව වාදන කණ්ඩායම් විසින් පිරිවරාගෙන සිටිමින්, පහළ මාලිගාවට නොබැසීමි. භික්‍ෂූණි, අන්‍යයන්ගේ නිවෙස්වල වහල්-කම්කරුවන් හට කැඳ හා දිරාගිය බත් දෙනු ලබන්නාක් මෙන්, මාගේ පියාගේ නිවසේ වහල්-කම්කරුවන් හට සාලි (හීල්) බත් හා මස් දෙනු ලැබුණි.\n\nභික්‍ෂූණි, එබඳු සමෘද්ධියෙන් යුක්ත වූ, එබඳු සියුමැලි බවකින් යුක්ත වූ මට මෙසේ සිතුණි: ‘අවිද්‍යානුගත වූ පෘථග්ජනයා තමා ද ජරාවට පත්වන ස්වභාවයෙන් යුක්තව, ජරාව ඉක්මවා නොගිය කෙනෙක්ව සිටියදී, අන් කෙනෙක් මහළු වී සිටිනු දැක, තමාගේම ස්වභාවය අමතක කර, කැළඹීමට පත්වේ, ලජ්ජාවට පත්වේ, පිළිකුල් කරයි. මම ද ජරාවට පත්වන ස්වභාවයෙන් යුක්ත වූයෙමි, ජරාව ඉක්මවා නොගියෙමි. මම ද ජරාවට පත්වන ස්වභාවයෙන් යුක්තව, ජරාව ඉක්මවා නොගිය කෙනෙක්ව සිටියදී, අන් කෙනෙක් මහළු වී සිටිනු දැක කැළඹීමට පත්වන්නේ නම්, ලජ්ජාවට පත්වන්නේ නම්, පිළිකුල් කරන්නේ නම්, එය මට සුදුසු නොවේ.’ භික්‍ෂූණි, මට එසේ සිතා බැලීමේදී, යොවුන් වියේ තිබූ යොවුන් මදය (තරුණ විය පිළිබඳ උඩඟුකම) සම්පූර්ණයෙන් පහව ගියේය.\n\n‘අවිද්‍යානුගත වූ පෘථග්ජනයා තමා ද ව්‍යාධියට පත්වන ස්වභාවයෙන් යුක්තව, ව්‍යාධිය ඉක්මවා නොගිය කෙනෙක්ව සිටියදී, අන් කෙනෙක් රෝගී වී සිටිනු දැක, තමාගේම ස්වභාවය අමතක කර, කැළඹීමට පත්වේ, ලජ්ජාවට පත්වේ, පිළිකුල් කරයි. මම ද ව්‍යාධියට පත්වන ස්වභාවයෙන් යුක්ත වූයෙමි, ව්‍යාධිය ඉක්මවා නොගියෙමි. මම ද ව්‍යාධියට පත්වන ස්වභාවයෙන් යුක්තව, ව්‍යාධිය ඉක්මවා නොගිය කෙනෙක්ව සිටියදී, අන් කෙනෙක් රෝගී වී සිටිනු දැක කැළඹීමට පත්වන්නේ නම්, ලජ්ජාවට පත්වන්නේ නම්, පිළිකුල් කරන්නේ නම්, එය මට සුදුසු නොවේ.’ භික්‍ෂූණි, මට එසේ සිතා බැලීමේදී, නිරෝගී භාවය පිළිබඳ තිබූ නිරෝගී මදය (නිරෝගී බව පිළිබඳ උඩඟුකම) සම්පූර්ණයෙන් පහව ගියේය.\n\n‘අවිද්‍යානුගත වූ පෘථග්ජනයා තමා ද මරණයට පත්වන ස්වභාවයෙන් යුක්තව, මරණය ඉක්මවා නොගිය කෙනෙක්ව සිටියදී, අන් කෙනෙක් මියගොස් සිටිනු දැක, තමාගේම ස්වභාවය අමතක කර, කැළඹීමට පත්වේ, ලජ්ජාවට පත්වේ, පිළිකුල් කරයි. මම ද මරණයට පත්වන ස්වභාවයෙන් යුක්ත වූයෙමි, මරණය ඉක්මවා නොගියෙමි. මම ද මරණයට පත්වන ස්වභාවයෙන් යුක්තව, මරණය ඉක්මවා නොගිය කෙනෙක්ව සිටියදී, අන් කෙනෙක් මියගොස් සිටිනු දැක කැළඹීමට පත්වන්නේ නම්, ලජ්ජාවට පත්වන්නේ නම්, පිළිකුල් කරන්නේ නම්, එය මට සුදුසු නොවේ.’ භික්‍ෂූණි, මට එසේ සිතා බැලීමේදී, ජීවිතය පිළිබඳ තිබූ ජීවිත මදය (ජීවත්වීම පිළිබඳ උඩඟුකම) සම්පූර්ණයෙන් පහව ගියේය.\n\nභික්‍ෂූණි, මේ මද තුනකි. කවරේද ඒ තුන? යොවුන් මදය (තරුණ විය පිළිබඳ උඩඟුකම), නිරෝගී මදය (නිරෝගී බව පිළිබඳ උඩඟුකම), ජීවිත මදය (ජීවත්වීම පිළිබඳ උඩඟුකම) යි. භික්‍ෂූණි, යොවුන් මදයෙන් මත් වූ අවිද්‍යානුගත පෘථග්ජනයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. ඔහු කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, සිතින් දුසිරිත් කොට, කය බිඳී මරණයෙන් පසු අපාය නම් වූ දුගතියකට, විනිපාතයකට, නිරයකට උපදී. භික්‍ෂූණි, නිරෝගී මදයෙන් මත් වූ අවිද්‍යානුගත පෘථග්ජනයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. ඔහු කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, සිතින් දුසිරිත් කොට, කය බිඳී මරණයෙන් පසු අපාය නම් වූ දුගතියකට, විනිපාතයකට, නිරයකට උපදී. භික්‍ෂූණි, ජීවිත මදයෙන් මත් වූ අවිද්‍යානුගත පෘථග්ජනයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. ඔහු කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, සිතින් දුසිරිත් කොට, කය බිඳී මරණයෙන් පසු අපාය නම් වූ දුගතියකට, විනිපාතයකට, නිරයකට උපදී.\n\nභික්‍ෂූණි, යොවුන් මදයෙන් මත් වූ භික්‍ෂුවක් ශික්‍ෂාව ප්‍රතික්‍ෂේප කොට හීන තත්වයට (ගිහි ජීවිතයට) පත්වෙයි. භික්‍ෂූණි, නිරෝගී මදයෙන් මත් වූ භික්‍ෂුවක් ශික්‍ෂාව ප්‍රතික්‍ෂේප කොට හීන තත්වයට පත්වෙයි. භික්‍ෂූණි, ජීවිත මදයෙන් මත් වූ භික්‍ෂුවක් ශික්‍ෂාව ප්‍රතික්‍ෂේප කොට හීන තත්වයට පත්වෙයි.\n\nව්‍යාධියට පත්වන ස්වභාවයෙන් යුක්ත වූ, ජරාවට පත්වන ස්වභාවයෙන් යුක්ත වූ, මරණයට පත්වන ස්වභාවයෙන් යුක්ත වූ ජීවීන්ව පෘථග්ජනයෝ ඔවුන්ගේ ස්වභාවය අනුවම පිළිකුල් කරති.\nඑබඳු ස්වභාවයෙන් යුක්ත වූ සත්වයන් කෙරෙහි මම පිළිකුල් කරන්නේ නම්, එසේ විහරණය කරන මට එය සුදුසු නොවන්නේය.\nඑසේ විහරණය කරන මම, උපධි රහිත ධර්මය අවබෝධ කරගෙන, නිරෝගී භාවයෙහි ද යොවුන් වියෙහි ද ජීවිතයෙහි ද තිබෙන යම් මදයන් ඇත්ද, ඒ සියලු මදයන් ඉක්මවා සිටිමි, නෙක්ඛම්මයෙහි (කෙලෙස්වලින් නික්මීමෙහි) ක්ෂේම භාවය දැකීමෙනි. නිවන මැනවින් දකිමින් සිටින මා හට, ඒ උත්සාහය ඇති විය.\nමේ දැන් මට කාමයන් සේවනය කිරීමට නොහැකිය. මම ආපසු නොහැරී (සංසාරයෙන් ආපසු නොඑන්නෙක්) බ්‍රහ්මචාරී ජීවිතය පරමායනය (අවසාන ගමනාන්තය) කොට ඇති කෙනෙක් වන්නෙමි.",
      "paliTitle": "Sukhumālasuttaṃ",
      "englishTitle": "The Discourse on Delicacy",
      "sinhalaTitle": "සුඛුමාල සූත්‍රය"
    },
    {
      "number": 40,
      "pali": "‘‘Tīṇimāni, bhikkhave, ādhipateyyāni. Katamāni tīṇi? Attādhipateyyaṃ, lokādhipateyyaṃ, dhammādhipateyyaṃ. Katamañca, bhikkhave, attādhipateyyaṃ? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘na kho panāhaṃ cīvarahetu agārasmā anagāriyaṃ pabbajito. Na piṇḍapātahetu, na senāsanahetu, na itibhavābhavahetu agārasmā anagāriyaṃ pabbajito. Api ca khomhi otiṇṇo jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, dukkhotiṇṇo dukkhapareto. Appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethāti. Ahañceva kho pana yādisake [yādisake vā (sī. pī. ka.)] kāme ohāya agārasmā anagāriyaṃ pabbajito tādisake vā [ca (ka.)] kāme pariyeseyyaṃ tato vā [ca (ka.)] pāpiṭṭhatare, na metaṃ patirūpa’nti. So iti paṭisañcikkhati – ‘āraddhaṃ kho pana me vīriyaṃ bhavissati asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekagga’nti. So attānaṃyeva adhipatiṃ karitvā akusalaṃ pajahati, kusalaṃ bhāveti, sāvajjaṃ pajahati, anavajjaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, attādhipateyyaṃ. ‘‘Katamañca, bhikkhave, lokādhipateyyaṃ? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘na kho panāhaṃ cīvarahetu agārasmā anagāriyaṃ pabbajito. Na piṇḍapātahetu, na senāsanahetu, na itibhavābhavahetu agārasmā anagāriyaṃ pabbajito. Api ca khomhi otiṇṇo jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, dukkhotiṇṇo dukkhapareto. Appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti. Ahañceva kho pana evaṃ pabbajito samāno kāmavitakkaṃ vā vitakkeyyaṃ, byāpādavitakkaṃ vā vitakkeyyaṃ, vihiṃsāvitakkaṃ vā vitakkeyyaṃ, mahā kho panāyaṃ lokasannivāso. Mahantasmiṃ kho pana lokasannivāse santi samaṇabrāhmaṇā iddhimanto dibbacakkhukā paracittaviduno. Te dūratopi passanti, āsannāpi na dissanti, cetasāpi cittaṃ pajānanti [jānanti (ka.)]. Tepi maṃ evaṃ jāneyyuṃ – ‘passatha, bho, imaṃ kulaputtaṃ saddhā agārasmā anagāriyaṃ pabbajito samāno vokiṇṇo viharati pāpakehi akusalehi dhammehī’ti. Devatāpi kho santi iddhimantiniyo dibbacakkhukā paracittaviduniyo. Tā dūratopi passanti, āsannāpi na dissanti, cetasāpi cittaṃ jānanti. Tāpi maṃ evaṃ jāneyyuṃ – ‘passatha, bho, imaṃ kulaputtaṃ saddhā agārasmā anagāriyaṃ pabbajito samāno vokiṇṇo viharati pāpakehi akusalehi dhammehī’ti. So iti paṭisañcikkhati – ‘āraddhaṃ kho pana me vīriyaṃ bhavissati asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekagga’nti. So lokaṃyeva adhipatiṃ karitvā akusalaṃ pajahati, kusalaṃ bhāveti, sāvajjaṃ pajahati, anavajjaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, lokādhipateyyaṃ. ‘‘Katamañca, bhikkhave, dhammādhipateyyaṃ? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘na kho panāhaṃ cīvarahetu agārasmā anagāriyaṃ pabbajito. Na piṇḍapātahetu, na senāsanahetu, na itibhavābhavahetu agārasmā anagāriyaṃ pabbajito. Api ca khomhi otiṇṇo jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, dukkhotiṇṇo dukkhapareto. Appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethāti. Svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti. Santi kho pana me sabrahmacārī jānaṃ passaṃ viharanti. Ahañceva kho pana evaṃ svākkhāte dhammavinaye pabbajito samāno kusīto vihareyyaṃ pamatto, na metaṃ assa patirūpa’nti. So iti paṭisañcikkhati – ‘āraddhaṃ kho pana me vīriyaṃ bhavissati asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekagga’nti. So dhammaṃyeva adhipatiṃ karitvā akusalaṃ pajahati, kusalaṃ bhāveti, sāvajjaṃ pajahati, anavajjaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, dhammādhipateyyaṃ. Imāni kho, bhikkhave, tīṇi ādhipateyyānī’’ti. ‘‘Natthi loke raho nāma, pāpakammaṃ pakubbato; Attā te purisa jānāti, saccaṃ vā yadi vā musā. ‘‘Kalyāṇaṃ vata bho sakkhi, attānaṃ atimaññasi; Yo santaṃ attani pāpaṃ, attānaṃ parigūhasi. ‘‘Passanti devā ca tathāgatā ca, Lokasmiṃ bālaṃ visamaṃ carantaṃ; Tasmā hi attādhipateyyako ca [attādhipako sako care (sī. syā. kaṃ. pī.)], Lokādhipo ca nipako ca jhāyī. ‘‘Dhammādhipo ca anudhammacārī, Na hīyati saccaparakkamo muni; Pasayha māraṃ abhibhuyya antakaṃ, Yo ca phusī jātikkhayaṃ padhānavā; So tādiso lokavidū sumedho, Sabbesu dhammesu atammayo munī’’ti. dasamaṃ; ",
      "english": "Monks, there are these three kinds of dominance. Which three? Self-dominance, world-dominance, Dhamma-dominance.\n\nAnd what, monks, is self-dominance? Here, monks, a monk, having gone to the wilderness, or to the root of a tree, or to an empty dwelling, reflects thus: ‘I did not go forth from home into homelessness for the sake of robes. Nor for the sake of alms food, nor for the sake of lodging, nor for the sake of future states of existence. Indeed, I am overcome by birth, old age, death, sorrow, lamentation, pain, distress, and despair. I am overcome by suffering, afflicted by suffering. Oh, that an end to this entire mass of suffering might be discerned!’ If, having abandoned such sensual pleasures as led me to go forth from home into homelessness, I were to seek similar or even more inferior sensual pleasures, that would not be proper for me.’ He reflects thus: ‘My energy will be aroused and not slack, my mindfulness will be established and not forgetful, my body will be tranquil and not agitated, my mind will be concentrated and unified.’ Making himself the dominant principle, he abandons unwholesome actions, develops wholesome ones, abandons blameworthy actions, develops blameless ones, and maintains himself in purity. This, monks, is called self-dominance.\n\nAnd what, monks, is world-dominance? Here, monks, a monk, having gone to the wilderness, or to the root of a tree, or to an empty dwelling, reflects thus: ‘I did not go forth from home into homelessness for the sake of robes. Nor for the sake of alms food, nor for the sake of lodging, nor for the sake of future states of existence. Indeed, I am overcome by birth, old age, death, sorrow, lamentation, pain, distress, and despair. I am overcome by suffering, afflicted by suffering. Oh, that an end to this entire mass of suffering might be discerned!’ If I, having thus gone forth, were to entertain thoughts of sensual desire, or thoughts of ill-will, or thoughts of harm, then this habitation of the world is indeed vast. In this vast habitation of the world, there are monastics and brahmins who are endowed with psychic powers, possess divine vision, and are knowers of the minds of others. They see from afar, and though nearby, are not seen; they know minds even by mental telepathy. Even they would know me thus: ‘Look, friends, this young man of good family, having gone forth from home into homelessness out of faith, dwells entangled in evil, unwholesome states.’ There are also deities who are endowed with psychic powers, possess divine vision, and are knowers of the minds of others. They see from afar, and though nearby, are not seen; they know minds even by mental telepathy. Even they would know me thus: ‘Look, friends, this young man of good family, having gone forth from home into homelessness out of faith, dwells entangled in evil, unwholesome states.’ He reflects thus: ‘My energy will be aroused and not slack, my mindfulness will be established and not forgetful, my body will be tranquil and not agitated, my mind will be concentrated and unified.’ Making the world the dominant principle, he abandons unwholesome actions, develops wholesome ones, abandons blameworthy actions, develops blameless ones, and maintains himself in purity. This, monks, is called world-dominance.\n\nAnd what, monks, is Dhamma-dominance? Here, monks, a monk, having gone to the wilderness, or to the root of a tree, or to an empty dwelling, reflects thus: ‘I did not go forth from home into homelessness for the sake of robes. Nor for the sake of alms food, nor for the sake of lodging, nor for the sake of future states of existence. Indeed, I am overcome by birth, old age, death, sorrow, lamentation, pain, distress, and despair. I am overcome by suffering, afflicted by suffering. Oh, that an end to this entire mass of suffering might be discerned!’ The Dhamma, well-proclaimed by the Blessed One, is immediately visible, timeless, inviting one to come and see, onward-leading, and to be personally experienced by the wise. Moreover, there are my spiritual companions who dwell knowing and seeing. If I, having gone forth into such a well-proclaimed Dhamma and Discipline, were to dwell lazy and heedless, that would not be proper for me.’ He reflects thus: ‘My energy will be aroused and not slack, my mindfulness will be established and not forgetful, my body will be tranquil and not agitated, my mind will be concentrated and unified.’ Making the Dhamma the dominant principle, he abandons unwholesome actions, develops wholesome ones, abandons blameworthy actions, develops blameless ones, and maintains himself in purity. This, monks, is called Dhamma-dominance.\n\nThese, monks, are the three kinds of dominance.\n\nThere is no secret place in the world for one who performs evil deeds. Your own self, O person, knows whether it is true or false.\n\nIndeed, good friend, you truly scorn yourself, you who conceal yourself, though evil exists within you.\n\nThe devas and Tathāgatas see the fool acting unrighteously in the world. Therefore, one who is self-sovereign, and one who is master of the world, and is discerning and a meditator; and one who is Dhamma-sovereign and lives in conformity with the Dhamma — such a sage, whose effort is in truth, does not decline. Having forcibly overcome Māra and conquered the Ender (Death), and who, striving diligently, has experienced the destruction of birth, such a one, a knower of the world and very wise, is a sage not identified with any phenomena.",
      "sinhala": "භික්ෂූණි, මේ අධිපතිභාවයන් තුනකි. කවරේද ඒ තුන? තමා අධිපති කොටගෙන පැවැත්ම, ලෝකය අධිපති කොටගෙන පැවැත්ම, ධර්මය අධිපති කොටගෙන පැවැත්ම. භික්ෂූණි, තමා අධිපති කොටගෙන පැවැත්ම කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගිය කල්හි හෝ ගස් මුලකට ගිය කල්හි හෝ හිස් ගෙයකට ගිය කල්හි හෝ මෙසේ මෙනෙහි කරයි: ‘මම සිවුරු පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේ නොවේ. පිණ්ඩපාතය පිණිස නොවේ, සේනාසන පිණිස නොවේ, මේ භවය හෝ වෙනත් භවයක් පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේ නොවේ. එහෙත් මම ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, සුසුම්ලෑමෙන් පෙළෙන්නෙක්මි. දුකෙන් වෙළුණු, දුකෙන් පීඩිත වූවෙක්මි. මේ කෙලෙස් සහිත දුක් සමූහයේ කෙළවරක් පෙනේ නම් ඉතා යහපති.’ ‘මා යම් කාමයන් අත්හැර දමා ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේද, එවැනිම හෝ ඊටත් වඩා නරක කාමයන් සොයන්නේ නම් එය මට නුසුදුසුය.’ ඔහු මෙසේ මෙනෙහි කරයි: ‘මාගේ වීර්යය නොපසුබට එකක් වෙයි. නොමුළා වූ සිහිය පිහිටා ඇත. කය සංසිඳී ඇත, නොසන්සුන් නොවේ. සිත සමාධිමත් වී, එකඟ වී ඇත.’ ඔහු තමාම අධිපති කොටගෙන අකුසල් දුරු කරයි, කුසල් වඩයි. වරද සහිත දේ අත්හරියි, වරද රහිත දේ වඩයි. තමා පිරිසිදුව පවත්වා ගනී. භික්ෂූණි, මෙය ‘තමා අධිපති කොටගෙන පැවැත්ම’ යැයි කියනු ලැබේ.\n\nභික්ෂූණි, ලෝකය අධිපති කොටගෙන පැවැත්ම කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගිය කල්හි හෝ ගස් මුලකට ගිය කල්හි හෝ හිස් ගෙයකට ගිය කල්හි හෝ මෙසේ මෙනෙහි කරයි: ‘මම සිවුරු පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේ නොවේ. පිණ්ඩපාතය පිණිස නොවේ, සේනාසන පිණිස නොවේ, මේ භවය හෝ වෙනත් භවයක් පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේ නොවේ. එහෙත් මම ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, සුසුම්ලෑමෙන් පෙළෙන්නෙක්මි. දුකෙන් වෙළුණු, දුකෙන් පීඩිත වූවෙක්මි. මේ කෙලෙස් සහිත දුක් සමූහයේ කෙළවරක් පෙනේ නම් ඉතා යහපති.’ ‘මා මෙසේ පැවිදි වී සිටියදී කාම විතර්ක හෝ ව්‍යාපාද විතර්ක හෝ විහිංසා විතර්ක හෝ සිතන්නේ නම්, මේ ලෝකය ඉතා පුළුල් ජනාවාසයකි. ඒ මහත් වූ ලෝක ජනාවාසයෙහි ඍද්ධිමත් වූ, දිව්‍ය චක්ෂුසින් යුක්ත වූ, අනුන්ගේ සිත් දන්නා සමණ බ්‍රාහ්මණයෝ වෙති. ඔවුහු දුර සිට වුවද දකිති, ළඟ සිටියද නොපෙනෙති, සිතින් වුවද සිත් පිරිසිඳ දනිති. ඔවුහු මා ගැන මෙසේ දැනගනිති: ‘ඇති යහළුවනි, මේ කුලපුත්‍රයා ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වී පව්කාර අකුසල ධර්මයන්ගෙන් මිශ්‍ර වූවකු ලෙස වාසය කරයි’ කියා. ‘එසේම ඍද්ධිමත්වූ, දිව්‍ය චක්ෂුසින් යුක්ත වූ, අනුන්ගේ සිත් දන්නා දෙවතාවෝද වෙති. ඔවුහු දුර සිට වුවද දකිති, ළඟ සිටියද නොපෙනෙති, සිතින් වුවද සිත් දනිති. ඔවුහු මා ගැන මෙසේ දැනගනිති: ‘ඇති යහළුවනි, මේ කුලපුත්‍රයා ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වී පව්කාර අකුසල ධර්මයන්ගෙන් මිශ්‍ර වූවකු ලෙස වාසය කරයි’ කියා. ඔහු මෙසේ මෙනෙහි කරයි: ‘මාගේ වීර්යය නොපසුබට එකක් වෙයි. නොමුළා වූ සිහිය පිහිටා ඇත. කය සංසිඳී ඇත, නොසන්සුන් නොවේ. සිත සමාධිමත් වී, එකඟ වී ඇත.’ ඔහු ලෝකයම අධිපති කොටගෙන අකුසල් දුරු කරයි, කුසල් වඩයි. වරද සහිත දේ අත්හරියි, වරද රහිත දේ වඩයි. තමා පිරිසිදුව පවත්වා ගනී. භික්ෂූණි, මෙය ‘ලෝකය අධිපති කොටගෙන පැවැත්ම’ යැයි කියනු ලැබේ.\n\nභික්ෂූණි, ධර්මය අධිපති කොටගෙන පැවැත්ම කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගිය කල්හි හෝ ගස් මුලකට ගිය කල්හි හෝ හිස් ගෙයකට ගිය කල්හි හෝ මෙසේ මෙනෙහි කරයි: ‘මම සිවුරු පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේ නොවේ. පිණ්ඩපාතය පිණිස නොවේ, සේනාසන පිණිස නොවේ, මේ භවය හෝ වෙනත් භවයක් පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේ නොවේ. එහෙත් මම ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, සුසුම්ලෑමෙන් පෙළෙන්නෙක්මි. දුකෙන් වෙළුණු, දුකෙන් පීඩිත වූවෙක්මි. මේ කෙලෙස් සහිත දුක් සමූහයේ කෙළවරක් පෙනේ නම් ඉතා යහපති.’ ‘භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාව දේශනා කර ඇත. එය ස්වයංව අවබෝධ කළ හැකි ය, කල් නොගෙන ඵල දෙන්නේය, ‘එව, බලව’ යැයි ආරාධනා කළ හැකිය, නිවනට පමුණුවන්නේය, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම අවබෝධ කරගත යුතු ය. මාගේ බ්‍රහ්මචාරී සහෝදරයෝ සිටිති, ඔවුහු (ධර්මය) දනිති, දකිති, වාසය කරති. මා මෙවන් මනාව දේශනා කරන ලද ධර්ම විනයෙහි පැවිදි වූවකු ලෙස කම්මැලිව, ප්‍රමාදව වාසය කරන්නේ නම් එය මට නුසුදුසුය.’ ඔහු මෙසේ මෙනෙහි කරයි: ‘මාගේ වීර්යය නොපසුබට එකක් වෙයි. නොමුළා වූ සිහිය පිහිටා ඇත. කය සංසිඳී ඇත, නොසන්සුන් නොවේ. සිත සමාධිමත් වී, එකඟ වී ඇත.’ ඔහු ධර්මයම අධිපති කොටගෙන අකුසල් දුරු කරයි, කුසල් වඩයි. වරද සහිත දේ අත්හරියි, වරද රහිත දේ වඩයි. තමා පිරිසිදුව පවත්වා ගනී. භික්ෂූණි, මෙය ‘ධර්මය අධිපති කොටගෙන පැවැත්ම’ යැයි කියනු ලැබේ.\n\nභික්ෂූණි, මේ අධිපතිභාවයන් තුන මෙයයි.\n\nලෝකයේ රහසක් නැත, පාපකර්මයක් කරන පුද්ගලයාට.\nපුරුෂයාණෙනි, ඔබගේ ආත්මයම දනියි, සත්‍ය හෝ අසත්‍ය දැයි.\n\nඅහෝ, යහපත් පුරුෂය, තමා තුළ පවතින පව සඟවා තබා ගනිමින්, තමාටම පහත් ලෙස සලකන තැනැත්තා සැබවින්ම තමාට අගෞරව කරන්නේය.\n\nදෙවිවරු ද, තථාගතවරු ද, ලෝකයෙහි දහමට විරුද්ධ ලෙස හැසිරෙන්නා වූ බාල පුද්ගලයා දකිති. එහෙයින් යමෙක් ආත්ම අධිපති කොට ඇත්තේ ද, ලෝකය අධිපති කොට ඇත්තේ ද, ප්‍රඥාවන්ත ද, ධ්‍යාන කරන්නෙක් ද විය යුතුය.\n\nධර්මය අධිපති කොට ඇත්තේ ද, ධර්මයට අනුව හැසිරෙන්නේ ද, සත්‍යයෙහි වීර්යවන්ත වූ ඒ මුනිවරයා පිරිහීමකට පත් නොවෙයි. මාරයා බලයෙන් තලා දමා, මරණය ද මැඩපවත්වා, යම් තැනැත්තෙක් වීර්යයෙන් යුක්තව ජාතික්ෂය ස්පර්ශ කළේ ද, එබඳු වූ ඔහු ලෝකවිදූ වූ, මනා ප්‍රඥාවෙන් යුක්ත වූ, සියලු ධර්මයන් කෙරෙහි නොඇලුණු මුනිවරයෙක් වන්නේය.",
      "paliTitle": "Ādhipateyyasuttaṃ",
      "englishTitle": "The Discourse on Sovereignty",
      "sinhalaTitle": "ආධිපතෙය්‍ය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Devadūtavaggo catuttho. Tassuddānaṃ – Brahma ānanda sāriputto, nidānaṃ hatthakena ca; Dūtā duve ca rājāno, sukhumālādhipateyyena cāti.",
    "english": "The fourth chapter on Divine Messengers. The summary of it: Brahma, Ānanda, Sāriputta, Cause, and with Hatthaka; two on Messengers, Kings, Delicacy, and Sovereignty.",
    "sinhala": "සිව්වන දේවදූත වර්ගයයි. එහි උද්දානය නම්: බ්‍රහ්ම, ආනන්ද, සාරිපුත්ත, නිදාන, හත්ථක, දූත දෙකක්, රාජා, සුඛුමාල සහ අධිපතෙය්‍ය සූත්‍රයි."
  }
}