{
  "metadata": {
    "created_date": "2025-12-29",
    "total_terms": 6,
    "instructions": {
      "purpose": "Bulk translation of Pali Buddhist footer texts",
      "task": "Fill in the \"english\" and \"sinhala\" fields for each footer",
      "context": "Use the \"contexts\" field to understand where each footer is used",
      "note": "Both English and Sinhala translations are requested for simplicity"
    },
    "statistics": {
      "books_scanned": 22,
      "chapters_scanned": 291,
      "footers_found": 310,
      "unique_terms": 6
    }
  },
  "translations": [
    {
      "pali": "Tikaṇḍakīvaggo pañcamo. Tassuddānaṃ – Datvā avajānāti ārabhati ca, sārandada tikaṇḍa nirayena ca; Mitto asappurisasappurisena, samayavimuttaṃ apare dveti. Tatiyapaṇṇāsakaṃ samattaṃ.",
      "english": "The fifth chapter on Tikaṇḍakī. The summary of it: Having Given, One Despises, One Commences; Sārandada, Tikaṇḍakī, and with Hell; Friend, the Unworthy Person and the Worthy Person, One Liberated by Time, and two others. The third fifty is complete.",
      "sinhala": "පස්වන තිකණ්ඩකී වර්ගයයි. එහි උද්දානය නම්: දත්වා, අවජානාති, ආරභති, සාරන්දද, තිකණ්ඩ, නිරය, මිත්ත, අසප්පුරිස, සප්පුරිස, සමයවිමුත්ත සහ තවත් සූත්‍ර දෙකකි. තෙවන පණ්ණාසකය සමාප්තයි.",
      "contexts": [
        "Chapter Footer: Pañcakanipātapāḷi/an5.15-Tikaṇḍakīvaggo.json"
      ],
      "usage_count": 1,
      "originally_needed": {
        "english": true,
        "sinhala": true
      }
    },
    {
      "pali": "Rāgapeyyālaṃ niṭṭhitaṃ. Tassuddānaṃ – Abhiññāya pariññāya parikkhayāya, Pahānāya khayāya vayena ca; Virāganirodhā cāgañca, Paṭinissaggo ime dasāti. Pañcakanipāto niṭṭhito. Tatridaṃ vagguddānaṃ – Sekhabalaṃ balañceva, pañcaṅgikañca sumanaṃ; Muṇḍanīvaraṇañca saññañca, yodhājīvañca aṭṭhamaṃ; Theraṃ kakudhaphāsuñca, andhakavindadvādasaṃ; Gilānarājatikaṇḍaṃ, saddhammāghātupāsakaṃ; Araññabrāhmaṇañceva, kimilakkosakaṃ tathā; Dīghācārāvāsikañca, duccaritūpasampadanti.",
      "english": "The Abbreviated Series on Lust is finished. The summary of it: Direct knowledge, full understanding, complete exhaustion, abandoning, destruction, and passing away; fading of lust, cessation, giving up, and relinquishment—these ten. The Book of the Fives is finished. This is the summary of its chapters: Trainee's Powers, Powers, Fivefold, Sumanā; Muṇḍa, Hindrances, Perception, the Warrior as eighth; Elders, Kakudha, Comfort, and Andhakavinda as twelfth; Sick, King, Tikaṇḍakī, True Dhamma, Resentment, Lay Follower; Forest, Brahmin, Kimila, and Insulter; Long Wandering, Resident Monk, Misconduct, and Ordination.",
      "sinhala": "රාග පෙය්‍යාලය නිමයි. එහි උද්දානය නම්: අභිඤ්ඤා, පරිඤ්ඤා, පිරික්ඛය, පහාන, ඛය, වය, විරාග, නිරෝධ, චාග සහ පටිනිස්සග්ග යන දසයයි. පංචක නිපාතය නිමයි. එහි වර්ග උද්දානය නම්: සේඛබල, බල, පංචංගික, සුමනා, මුණ්ඩ, නීවරණ, සඤ්ඤා, යෝධාජීව, ථේර, කකුධ, ඵාසු, අන්ධකවින්ද, ගිලාන, රාජ, තිකණ්ඩ, සද්ධම්ම, ආඝාත, උපාසක, අරඤ්ඤ, බ්‍රාහ්මණ, කිමිල, අක්කෝසක, දීඝචාරික, ආවාසික, දුච්චරිත සහ උපසම්පදා වර්ගයි.",
      "contexts": [
        "Chapter Footer: Pañcakanipātapāḷi/an5.29-Rāgapeyyālaṃ.json"
      ],
      "usage_count": 1,
      "originally_needed": {
        "english": true,
        "sinhala": true
      }
    },
    {
      "pali": "Sumanavaggo catuttho. Tassuddānaṃ – Sumanā cundī uggaho, sīho dānānisaṃsako; Kālabhojanasaddhā ca, puttasālehi te dasāti.",
      "english": "The fourth chapter on Sumanā. The summary of it: Sumanā, Cundī, Uggaha, Sīha, the Benefits of Giving; Timely Eating, Faith, and the Son's Sal Forest—these ten.",
      "sinhala": "සිව්වන සුමනා වර්ගයයි. එහි උද්දානය නම්: සුමනා, චුන්දී, උග්ගහ, සීහ, දානානිසංස, කාලභෝජන, සද්ධා සහ පුත්තසාල යන සූත්‍ර දහයයි.",
      "contexts": [
        "Chapter Footer: Pañcakanipātapāḷi/an5.4-Sumanavaggo.json"
      ],
      "usage_count": 1,
      "originally_needed": {
        "english": true,
        "sinhala": true
      }
    },
    {
      "pali": "Loṇakapallavaggo [loṇaphalavaggo (sī. syā. kaṃ. pī.)] pañcamo. Tassuddānaṃ – Accāyikaṃ pavivekaṃ, sarado parisā tayo; Ājānīyā potthako ca, loṇaṃ dhovati nimittānīti. Dutiyo paṇṇāsako samatto.",
      "english": "The fifth chapter on the Salt Crystal. The summary of it: Urgent, Seclusion, Autumn, three on Assemblies; Thoroughbreds, the Book, Salt, Washing, and Signs. The second fifty is complete.",
      "sinhala": "පස්වන ලෝණකපල්ල වර්ගයයි. එහි උද්දානය නම්: අච්චායික, පවිවේක, සරද, පරිසා තුනක්, ආජානීය, පොත්ථක, ලෝණ, ධෝවති සහ නිමිත්ත සූත්‍රයි. දෙවන පණ්ණාසකය සමාප්තයි.",
      "contexts": [
        "Chapter Footer: Tikanipātapāḷi/an3.10-Loṇakapallavaggo.json"
      ],
      "usage_count": 1,
      "originally_needed": {
        "english": true,
        "sinhala": true
      }
    },
    {
      "pali": "Puggalavaggo tatiyo. Tassuddānaṃ – Samiddha [kāyasakkhi (sī.), saviṭṭha (syā. kaṃ.), seṭṭha (ka.)] -gilāna-saṅkhārā, bahukārā vajirena ca; Sevi-jiguccha-gūthabhāṇī, andho ca avakujjatāti.",
      "english": "The third chapter on Persons. The summary of it: Samiddha, the Sick, Choices, Very Helpful, and with the Diamond; To be Associated, Loathsome, One who talks Dung, the Blind, and Face Down.",
      "sinhala": "තෙවන පුද්ගල වර්ගයයි. එහි උද්දානය නම්: සමිද්ධ, ගිලාන, සංඛාර, බහුකාර, වජිර, සේවී, ජිගුච්ඡ, ගූථභාණී, අන්ධ සහ අවකුජ්ජ සූත්‍රයි.",
      "contexts": [
        "Chapter Footer: Tikanipātapāḷi/an3.3-Puggalavaggo.json"
      ],
      "usage_count": 1,
      "originally_needed": {
        "english": true,
        "sinhala": true
      }
    },
    {
      "pali": "Brāhmaṇavaggo paṭhamo. Tassuddānaṃ – Dve brāhmaṇā caññataro, paribbājakena nibbutaṃ; Palokavaccho tikaṇṇo, soṇi saṅgāravena cāti.",
      "english": "The first chapter on Brahmins. The summary of it: Two Brahmins, Another, with the Wanderer, Extinguished; Destruction, Vaccha, Tikaṇṇa, Soṇi, and with Saṅgārava.",
      "sinhala": "පළමු බ්‍රාහ්මණ වර්ගයයි. එහි උද්දානය නම්: බ්‍රාහ්මණ සූත්‍ර දෙකක්, අඤ්ඤතර, පරිබ්බාජක, නිබ්බුත, පලෝක, වච්ඡ, තිකණ්ණ, සෝණි සහ සංගාරව සූත්‍රයි.",
      "contexts": [
        "Chapter Footer: Tikanipātapāḷi/an3.6-Brāhmaṇavaggo.json"
      ],
      "usage_count": 1,
      "originally_needed": {
        "english": true,
        "sinhala": true
      }
    }
  ]
}