{
  "id": "snp.1",
  "title": {
    "pali": "Uragavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Yo [yo ve (syā.)] uppatitaṃ vineti kodhaṃ, visaṭaṃ sappavisaṃva osadhehi [osadhebhi (ka.)]; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ [jiṇṇamiva tacaṃ (sī. syā. kaṃ. pī.), jiṇṇamivā tacaṃ (?)] purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Uragasuttaṃ"
    },
    {
      "number": 2,
      "pali": "Yo rāgamudacchidā asesaṃ, bhisapupphaṃva saroruhaṃ [sareruhaṃ (ka.)] vigayha; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ, purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Yo taṇhamudacchidā asesaṃ, saritaṃ sīghasaraṃ visosayitvā; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Yo mānamudabbadhī asesaṃ, naḷasetuṃva sudubbalaṃ mahogho; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Yo nājjhagamā bhavesu sāraṃ, vicinaṃ pupphamiva [pupphamiva (bahūsu)] udumbaresu; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Yassantarato na santi kopā, itibhavābhavatañca [itibbhavābhavatañca (ka.)] vītivatto; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Yassa vitakkā vidhūpitā, ajjhattaṃ suvikappitā asesā; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Yo nāccasārī na paccasārī, sabbaṃ accagamā imaṃ papañcaṃ; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Yo nāccasārī na paccasārī, sabbaṃ vitathamidanti ñatvā [utvā (syā. pī. ka.)] loke; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Yo nāccasārī na paccasārī, sabbaṃ vitathamidanti vītalobho; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Yo nāccasārī na paccasārī, sabbaṃ vitathamidanti vītarāgo; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "Yo nāccasārī na paccasārī, sabbaṃ vitathamidanti vītadoso; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "Yo nāccasārī na paccasārī, sabbaṃ vitathamidanti vītamoho; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "Yassānusayā na santi keci, mūlā ca akusalā samūhatāse; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "Yassa darathajā na santi keci, oraṃ āgamanāya paccayāse; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "Yassa vanathajā na santi keci, vinibandhāya bhavāya hetukappā; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 17,
      "pali": "Yo nīvaraṇe pahāya pañca, anigho tiṇṇakathaṃkatho visallo; So bhikkhu jahāti orapāraṃ, urago jiṇṇamivattacaṃ purāṇaṃ. Uragasuttaṃ paṭhamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 18,
      "pali": "‘‘Pakkodano duddhakhīrohamasmi, (iti dhaniyo gopo) Anutīre mahiyā samānavāso; Channā kuṭi āhito gini, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dhaniyasuttaṃ"
    },
    {
      "number": 19,
      "pali": "‘‘Akkodhano vigatakhilohamasmi [vigatakhīlohamasmi (sī. pī.)], (iti bhagavā) Anutīre mahiyekarattivāso; Vivaṭā kuṭi nibbuto gini, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 20,
      "pali": "‘‘Andhakamakasā na vijjare, (iti dhaniyo gopo) Kacche rūḷhatiṇe caranti gāvo; Vuṭṭhimpi saheyyumāgataṃ, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 21,
      "pali": "‘‘Baddhāsi bhisī susaṅkhatā, (iti bhagavā) Tiṇṇo pāragato vineyya oghaṃ; Attho bhisiyā na vijjati, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 22,
      "pali": "‘‘Gopī mama assavā alolā, (iti dhaniyo gopo) Dīgharattaṃ [dīgharatta (ka.)] saṃvāsiyā manāpā; Tassā na suṇāmi kiñci pāpaṃ, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 23,
      "pali": "‘‘Cittaṃ mama assavaṃ vimuttaṃ, (iti bhagavā) Dīgharattaṃ paribhāvitaṃ sudantaṃ; Pāpaṃ pana me na vijjati, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 24,
      "pali": "‘‘Attavetanabhatohamasmi, (iti dhaniyo gopo) Puttā ca me samāniyā arogā; Tesaṃ na suṇāmi kiñci pāpaṃ, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 25,
      "pali": "‘‘Nāhaṃ bhatakosmi kassaci, (iti bhagavā) Nibbiṭṭhena carāmi sabbaloke; Attho bhatiyā na vijjati, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 26,
      "pali": "‘‘Atthi vasā atthi dhenupā, (iti dhaniyo gopo) Godharaṇiyo paveṇiyopi atthi; Usabhopi gavampatīdha atthi, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 27,
      "pali": "‘‘Natthi vasā natthi dhenupā, (iti bhagavā) Godharaṇiyo paveṇiyopi natthi; Usabhopi gavampatīdha natthi, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 28,
      "pali": "‘‘Khilā nikhātā asampavedhī, (iti dhaniyo gopo) Dāmā muñjamayā navā susaṇṭhānā; Na hi sakkhinti dhenupāpi chettuṃ [chetuṃ (ka.)], atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 29,
      "pali": "‘‘Usabhoriva chetva [chetvā (syā. ka.)] bandhanāni, (iti bhagavā) Nāgo pūtilataṃva dālayitvā [pūtilataṃ padālayitvā (syā. ka.)]; Nāhaṃ punupessaṃ [puna upessaṃ (sī. syā. kaṃ. pī.), punupeyya (ka.)] gabbhaseyyaṃ, atha ce patthayasī pavassa deva’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 30,
      "pali": "‘‘Ninnañca thalañca pūrayanto, mahāmegho pavassi tāvadeva; Sutvā devassa vassato, imamatthaṃ dhaniyo abhāsatha.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 31,
      "pali": "‘‘Lābhā vata no anappakā, ye mayaṃ bhagavantaṃ addasāma; Saraṇaṃ taṃ upema cakkhuma, satthā no hohi tuvaṃ mahāmuni.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 32,
      "pali": "‘‘Gopī ca ahañca assavā, brahmacariyaṃ [brahmacariya (ka.)] sugate carāmase; Jātimaraṇassa pāragū [pāragā (sī. syā. kaṃ. pī.)], dukkhassantakarā bhavāmase’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 33,
      "pali": "‘‘Nandati puttehi puttimā, (iti māro pāpimā) Gomā [gomiko (sī. pī.), gopiko (syā. kaṃ.), gopiyo (ka.)] gohi tatheva nandati; Upadhī hi narassa nandanā, na hi so nandati yo nirūpadhi’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 34,
      "pali": "‘‘Socati puttehi puttimā, (iti bhagavā) Gopiyo gohi tatheva socati; Upadhī hi narassa socanā, na hi so socati yo nirūpadhī’’ti. Dhaniyasuttaṃ dutiyaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 35,
      "pali": "Sabbesu bhūtesu nidhāya daṇḍaṃ, aviheṭhayaṃ aññatarampi tesaṃ; Na puttamiccheyya kuto sahāyaṃ, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Khaggavisāṇasuttaṃ"
    },
    {
      "number": 36,
      "pali": "Saṃsaggajātassa bhavanti snehā, snehanvayaṃ dukkhamidaṃ pahoti; Ādīnavaṃ snehajaṃ pekkhamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 37,
      "pali": "Mitte suhajje anukampamāno, hāpeti atthaṃ paṭibaddhacitto; Etaṃ bhayaṃ santhave [sandhave (ka.)] pekkhamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 38,
      "pali": "Vaṃso visālova yathā visatto, puttesu dāresu ca yā apekkhā; Vaṃsakkaḷīrova [vaṃsakaḷīrova (sī.), vaṃsākaḷīrova (syā. kaṃ. pī.), vaṃsekaḷīrova (niddesa)] sajjamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 39,
      "pali": "Migo araññamhi yathā abaddho [abandho (syā. kaṃ.)], yenicchakaṃ gacchati gocarāya; Viññū naro seritaṃ pekkhamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 40,
      "pali": "Āmantanā hoti sahāyamajjhe, vāse ṭhāne gamane cārikāya; Anabhijjhitaṃ seritaṃ pekkhamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 41,
      "pali": "Khiḍḍā ratī hoti sahāyamajjhe, puttesu ca vipulaṃ hoti pemaṃ; Piyavippayogaṃ vijigucchamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 42,
      "pali": "Cātuddiso appaṭigho ca hoti, santussamāno itarītarena; Parissayānaṃ sahitā achambhī, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 43,
      "pali": "Dussaṅgahā pabbajitāpi eke, atho gahaṭṭhā gharamāvasantā; Appossukko paraputtesu hutvā, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 44,
      "pali": "Oropayitvā gihibyañjanāni [gihivyañjanāni (syā. kaṃ. pī.)], sañchinnapatto [saṃsīnapatto (sī.)] yathā koviḷāro; Chetvāna vīro gihibandhanāni, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 45,
      "pali": "Sace labhetha nipakaṃ sahāyaṃ, saddhiṃ caraṃ sādhuvihāridhīraṃ; Abhibhuyya sabbāni parissayāni, careyya tenattamano satīmā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 46,
      "pali": "No ce labhetha nipakaṃ sahāyaṃ, saddhiṃ caraṃ sādhuvihāridhīraṃ; Rājāva raṭṭhaṃ vijitaṃ pahāya, eko care mātaṅgaraññeva nāgo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 47,
      "pali": "Addhā pasaṃsāma sahāyasampadaṃ, seṭṭhā samā sevitabbā sahāyā; Ete aladdhā anavajjabhojī, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 48,
      "pali": "Disvā suvaṇṇassa pabhassarāni, kammāraputtena suniṭṭhitāni; Saṅghaṭṭamānāni duve bhujasmiṃ, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 49,
      "pali": "Evaṃ dutiyena [dutiyena (sabbattha)] sahā mamassa, vācābhilāpo abhisajjanā vā; Etaṃ bhayaṃ āyatiṃ pekkhamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 50,
      "pali": "Kāmā hi citrā madhurā manoramā, virūparūpena mathenti cittaṃ; Ādīnavaṃ kāmaguṇesu disvā, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 51,
      "pali": "Ītī ca gaṇḍo ca upaddavo ca, rogo ca sallañca bhayañca metaṃ; Etaṃ bhayaṃ kāmaguṇesu disvā, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 52,
      "pali": "Sītañca uṇhañca khudaṃ pipāsaṃ, vātātape ḍaṃsasarīsape [ḍaṃsasiriṃsape (sī. syā. kaṃ. pī.)] ca; Sabbānipetāni abhisambhavitvā, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 53,
      "pali": "Nāgova yūthāni vivajjayitvā, sañjātakhandho padumī uḷāro; Yathābhirantaṃ viharaṃ [vihare (sī. pī. niddesa)] araññe, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 54,
      "pali": "Aṭṭhānataṃ saṅgaṇikāratassa, yaṃ phassaye [phussaye (syā.)] sāmayikaṃ vimuttiṃ; Ādiccabandhussa vaco nisamma, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 55,
      "pali": "Diṭṭhīvisūkāni upātivatto, patto niyāmaṃ paṭiladdhamaggo; Uppannañāṇomhi anaññaneyyo, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 56,
      "pali": "Nillolupo nikkuho nippipāso, nimmakkho niddhantakasāvamoho; Nirāsayo [nirāsāso (ka.)] sabbaloke bhavitvā, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 57,
      "pali": "Pāpaṃ sahāyaṃ parivajjayetha, anatthadassiṃ visame niviṭṭhaṃ; Sayaṃ na seve pasutaṃ pamattaṃ, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 58,
      "pali": "Bahussutaṃ dhammadharaṃ bhajetha, mittaṃ uḷāraṃ paṭibhānavantaṃ; Aññāya atthāni vineyya kaṅkhaṃ, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 59,
      "pali": "Khiḍḍaṃ ratiṃ kāmasukhañca loke, analaṅkaritvā anapekkhamāno; Vibhūsanaṭṭhānā virato saccavādī, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 60,
      "pali": "Puttañca dāraṃ pitarañca mātaraṃ, dhanāni dhaññāni ca bandhavāni [bandhavāni ca (pī.)]; Hitvāna kāmāni yathodhikāni, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 61,
      "pali": "Saṅgo eso parittamettha sokhyaṃ, appassādo dukkhamettha bhiyyo; Gaḷo eso iti ñatvā mutīmā [matīmā (syā. ka.)], eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 62,
      "pali": "Sandālayitvāna [padālayitvāna (ka.)] saṃyojanāni, jālaṃva bhetvā salilambucārī; Aggīva daḍḍhaṃ anivattamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 63,
      "pali": "Okkhittacakkhū na ca pādalolo, guttindriyo rakkhitamānasāno; Anavassuto apariḍayhamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 64,
      "pali": "Ohārayitvā gihibyañjanāni, sañchannapatto [sañchinnapatto (syā. pī.), pacchinnapatto (ka.)] yathā pārichatto; Kāsāyavattho abhinikkhamitvā, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 65,
      "pali": "Rasesu gedhaṃ akaraṃ alolo, anaññaposī sapadānacārī; Kule kule appaṭibaddhacitto [appaṭibandhacitto (ka.)], eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 66,
      "pali": "Pahāya pañcāvaraṇāni cetaso, upakkilese byapanujja sabbe; Anissito chetva [chetvā (syā. pī. ka.)] sinehadosaṃ [snehadosaṃ (ka.)], eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 67,
      "pali": "Vipiṭṭhikatvāna sukhaṃ dukhañca, pubbeva ca somanassadomanassaṃ; Laddhānupekkhaṃ samathaṃ visuddhaṃ, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 68,
      "pali": "Āraddhavīriyo paramatthapattiyā, alīnacitto akusītavutti; Daḷhanikkamo thāmabalūpapanno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 69,
      "pali": "Paṭisallānaṃ jhānamariñcamāno, dhammesu niccaṃ anudhammacārī; Ādīnavaṃ sammasitā bhavesu, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 70,
      "pali": "Taṇhakkhayaṃ patthayamappamatto, aneḷamūgo [anelamūgo (syā. pī. ka.)] sutavā satīmā; Saṅkhātadhammo niyato padhānavā, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 71,
      "pali": "Sīhova saddesu asantasanto, vātova jālamhi asajjamāno; Padumaṃva toyena alippamāno [alimpamāno (sī. syā. ka.)], eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 72,
      "pali": "Sīho yathā dāṭhabalī pasayha, rājā migānaṃ abhibhuyya cārī; Sevetha pantāni senāsanāni, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 73,
      "pali": "Mettaṃ upekkhaṃ karuṇaṃ vimuttiṃ, āsevamāno muditañca kāle; Sabbena lokena avirujjhamāno, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 74,
      "pali": "Rāgañca dosañca pahāya mohaṃ, sandālayitvāna saṃyojanāni; Asantasaṃ jīvitasaṅkhayamhi, eko care khaggavisāṇakappo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 75,
      "pali": "Bhajanti sevanti ca kāraṇatthā, nikkāraṇā dullabhā ajja mittā; Attaṭṭhapaññā asucī manussā, eko care khaggavisāṇakappo. Khaggavisāṇasuttaṃ tatiyaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā magadhesu viharati dakkhiṇāgirismiṃ [dakkhiṇagirismiṃ (ka.)] ekanāḷāyaṃ brāhmaṇagāme. Tena kho pana samayena kasibhāradvājassa brāhmaṇassa pañcamattāni naṅgalasatāni payuttāni honti vappakāle. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena kasibhāradvājassa brāhmaṇassa kammanto tenupasaṅkami. Tena kho pana samayena kasibhāradvājassa brāhmaṇassa parivesanā vattati. Atha kho bhagavā yena parivesanā tenupasaṅkami; upasaṅkamitvā ekamantaṃ aṭṭhāsi. Addasā kho kasibhāradvājo brāhmaṇo bhagavantaṃ piṇḍāya ṭhitaṃ. Disvāna bhagavantaṃ etadavoca – ‘‘ahaṃ kho, samaṇa, kasāmi ca vapāmi ca; kasitvā ca vapitvā ca bhuñjāmi. Tvampi, samaṇa, kasassu ca vapassu ca; kasitvā ca vapitvā ca bhuñjassū’’ti. ‘‘Ahampi kho, brāhmaṇa, kasāmi ca vapāmi ca; kasitvā ca vapitvā ca bhuñjāmī’’ti. ‘‘Na kho pana mayaṃ [na kho pana samaṇa (syā.)] passāma bhoto gotamassa yugaṃ vā naṅgalaṃ vā phālaṃ vā pācanaṃ vā balibadde [balivadde (sī. pī.), balībadde (?)] vā. Atha ca pana bhavaṃ gotamo evamāha – ‘ahampi kho, brāhmaṇa, kasāmi ca vapāmi ca; kasitvā ca vapitvā ca bhuñjāmī’’’ti. Atha kho kasibhāradvājo brāhmaṇo bhagavantaṃ gāthāya ajjhabhāsi –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 76,
      "pali": "‘‘Kassako paṭijānāsi, na ca passāma te kasiṃ; Kasiṃ no pucchito brūhi, yathā jānemu te kasiṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Kasibhāradvājasuttaṃ"
    },
    {
      "number": 77,
      "pali": "‘‘Saddhā bījaṃ tapo vuṭṭhi, paññā me yuganaṅgalaṃ; Hirī īsā mano yottaṃ, sati me phālapācanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 78,
      "pali": "‘‘Kāyagutto vacīgutto, āhāre udare yato; Saccaṃ karomi niddānaṃ, soraccaṃ me pamocanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 79,
      "pali": "‘‘Vīriyaṃ me dhuradhorayhaṃ, yogakkhemādhivāhanaṃ; Gacchati anivattantaṃ, yattha gantvā na socati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 80,
      "pali": "‘‘Evamesā kasī kaṭṭhā, sā hoti amatapphalā; Etaṃ kasiṃ kasitvāna, sabbadukkhā pamuccatī’’ti. Atha kho kasibhāradvājo brāhmaṇo mahatiyā kaṃsapātiyā pāyasaṃ [pāyāsaṃ (sabbattha)] vaḍḍhetvā bhagavato upanāmesi – ‘‘bhuñjatu bhavaṃ gotamo pāyasaṃ. Kassako bhavaṃ; yaṃ hi bhavaṃ gotamo amatapphalaṃ [amatapphalampi (saṃ. ni. 1.197)] kasiṃ kasatī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 81,
      "pali": "‘‘Gāthābhigītaṃ me abhojaneyyaṃ, sampassataṃ brāhmaṇa nesa dhammo; Gāthābhigītaṃ panudanti buddhā, dhamme satī brāhmaṇa vuttiresā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 82,
      "pali": "‘‘Aññena ca kevalinaṃ mahesiṃ, khīṇāsavaṃ kukkuccavūpasantaṃ; Annena pānena upaṭṭhahassu, khettaṃ hi taṃ puññapekkhassa hotī’’ti. ‘‘Atha kassa cāhaṃ, bho gotama, imaṃ pāyasaṃ dammī’’ti? ‘‘Na khvāhaṃ taṃ, brāhmaṇa, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya, yassa so pāyaso bhutto sammā pariṇāmaṃ gaccheyya, aññatra tathāgatassa vā tathāgatasāvakassa vā. Tena hi tvaṃ, brāhmaṇa, taṃ pāyasaṃ appaharite vā chaḍḍehi appāṇake vā udake opilāpehī’’ti. Atha kho kasibhāradvājo brāhmaṇo taṃ pāyasaṃ appāṇake udake opilāpesi. Atha kho so pāyaso udake pakkhitto cicciṭāyati ciṭiciṭāyati sandhūpāyati sampadhūpāyati [sandhūmāyati sampadhūmāyati (syā.)]. Seyyathāpi nāma phālo divasaṃ santatto [divasasantatto (sī. syā. kaṃ. pī.)] udake pakkhitto cicciṭāyati ciṭiciṭāyati sandhūpāyati sampadhūpāyati; evameva so pāyaso udake pakkhitto cicciṭāyati ciṭiciṭāyati sandhūpāyati sampadhūpāyati. Atha kho kasibhāradvājo brāhmaṇo saṃviggo lomahaṭṭhajāto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, cakkhumanto rūpāni dakkhantīti [dakkhintīti (sī. syā. kaṃ. pī.)]; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca, labheyyāhaṃ bhoto gotamassa santike pabbajjaṃ, labheyyaṃ upasampada’’nti. Alattha kho kasibhāradvājo brāhmaṇo bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno kho panāyasmā bhāradvājo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca [aññataro ca kho (sī. pī.), aññataro kho (syā. kaṃ. ka.)] panāyasmā bhāradvājo arahataṃ ahosīti. Kasibhāradvājasuttaṃ catutthaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 83,
      "pali": "‘‘Pucchāmi muniṃ pahūtapaññaṃ, (iti cundo kammāraputto) Buddhaṃ dhammassāmiṃ vītataṇhaṃ; Dvipaduttamaṃ [dipaduttamaṃ (sī. syā. kaṃ. pī.)] sārathīnaṃ pavaraṃ, kati loke samaṇā tadiṅgha brūhi’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Cundasuttaṃ"
    },
    {
      "number": 84,
      "pali": "‘‘Caturo samaṇā na pañcamatthi, (cundāti bhagavā) Te te āvikaromi sakkhipuṭṭho; Maggajino maggadesako ca, magge jīvati yo ca maggadūsī’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 85,
      "pali": "‘‘Kaṃ maggajinaṃ vadanti buddhā, (iti cundo kammāraputto) Maggakkhāyī kathaṃ atulyo hoti; Magge jīvati me brūhi puṭṭho, atha me āvikarohi maggadūsiṃ’’ [maggadūsī (ka.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 86,
      "pali": "‘‘Yo tiṇṇakathaṃkatho visallo, nibbānābhirato anānugiddho; Lokassa sadevakassa netā, tādiṃ maggajinaṃ vadanti buddhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 87,
      "pali": "‘‘Paramaṃ paramanti yodha ñatvā, akkhāti vibhajate idheva dhammaṃ; Taṃ kaṅkhachidaṃ muniṃ anejaṃ, dutiyaṃ bhikkhunamāhu maggadesiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 88,
      "pali": "‘‘Yo dhammapade sudesite, magge jīvati saññato satīmā; Anavajjapadāni sevamāno, tatiyaṃ bhikkhunamāhu maggajīviṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 89,
      "pali": "‘‘Chadanaṃ katvāna subbatānaṃ, pakkhandī kuladūsako pagabbho; Māyāvī asaññato palāpo, patirūpena caraṃ sa maggadūsī.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 90,
      "pali": "‘‘Ete ca paṭivijjhi yo gahaṭṭho, sutavā ariyasāvako sapañño; Sabbe netādisāti [sabbe ne tādisāti (sī. syā. pī.)] ñatvā, iti disvā na hāpeti tassa saddhā; Kathaṃ hi duṭṭhena asampaduṭṭhaṃ, suddhaṃ asuddhena samaṃ kareyyā’’ti. Cundasuttaṃ pañcamaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho sā devatā bhagavantaṃ gāthāya ajjhabhāsi –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 91,
      "pali": "‘‘Parābhavantaṃ purisaṃ, mayaṃ pucchāma gotama [gotamaṃ (sī. syā.)]; Bhagavantaṃ [bhavantaṃ (syā. ka.)] puṭṭhumāgamma, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Parābhavasuttaṃ"
    },
    {
      "number": 92,
      "pali": "‘‘Suvijāno bhavaṃ hoti, suvijāno [duvijāno (syā. ka.)] parābhavo; Dhammakāmo bhavaṃ hoti, dhammadessī parābhavo’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 93,
      "pali": "‘‘Iti hetaṃ vijānāma, paṭhamo so parābhavo; Dutiyaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 94,
      "pali": "‘‘Asantassa piyā honti, sante na kurute piyaṃ; Asataṃ dhammaṃ roceti, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 95,
      "pali": "‘‘Iti hetaṃ vijānāma, dutiyo so parābhavo; Tatiyaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 96,
      "pali": "‘‘Niddāsīlī sabhāsīlī, anuṭṭhātā ca yo naro; Alaso kodhapaññāṇo, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 97,
      "pali": "‘‘Iti hetaṃ vijānāma, tatiyo so parābhavo; Catutthaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 98,
      "pali": "‘‘Yo mātaraṃ [yo mātaraṃ vā (sī. syā. kaṃ. pī.)] pitaraṃ vā, jiṇṇakaṃ gatayobbanaṃ; Pahu santo na bharati, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 99,
      "pali": "‘‘Iti hetaṃ vijānāma, catuttho so parābhavo; Pañcamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 100,
      "pali": "‘‘Yo brāhmaṇaṃ [yo brāhmaṇaṃ vā (sī. syā. kaṃ. pī.)] samaṇaṃ vā, aññaṃ vāpi vanibbakaṃ; Musāvādena vañceti, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 101,
      "pali": "‘‘Iti hetaṃ vijānāma, pañcamo so parābhavo; Chaṭṭhamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 102,
      "pali": "‘‘Pahūtavitto puriso, sahirañño sabhojano; Eko bhuñjati sādūni, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 103,
      "pali": "‘‘Iti hetaṃ vijānāma, chaṭṭhamo so parābhavo; Sattamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 104,
      "pali": "‘‘Jātitthaddho dhanatthaddho, gottatthaddho ca yo naro; Saññātiṃ atimaññeti, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 105,
      "pali": "‘‘Iti hetaṃ vijānāma, sattamo so parābhavo; Aṭṭhamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 106,
      "pali": "‘‘Itthidhutto surādhutto, akkhadhutto ca yo naro; Laddhaṃ laddhaṃ vināseti, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 107,
      "pali": "‘‘Iti hetaṃ vijānāma, aṭṭhamo so parābhavo; Navamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 108,
      "pali": "‘‘Sehi dārehi asantuṭṭho [dārehyasantuṭṭho (ka.)], vesiyāsu padussati [padissati (sī.)]; Dussati [dissati (sī. pī.)] paradāresu, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 109,
      "pali": "‘‘Iti hetaṃ vijānāma, navamo so parābhavo; Dasamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 110,
      "pali": "‘‘Atītayobbano poso, āneti timbarutthaniṃ; Tassā issā na supati, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 111,
      "pali": "‘‘Iti hetaṃ vijānāma, dasamo so parābhavo; Ekādasamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 112,
      "pali": "‘‘Itthiṃ soṇḍiṃ vikiraṇiṃ, purisaṃ vāpi tādisaṃ; Issariyasmiṃ ṭhapeti [ṭhāpeti (sī. pī.), thapeti (ka.)], taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 113,
      "pali": "‘‘Iti hetaṃ vijānāma, ekādasamo so parābhavo; Dvādasamaṃ bhagavā brūhi, kiṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 114,
      "pali": "‘‘Appabhogo mahātaṇho, khattiye jāyate kule; So ca rajjaṃ patthayati, taṃ parābhavato mukhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 115,
      "pali": "‘‘Ete parābhave loke, paṇḍito samavekkhiya; Ariyo dassanasampanno, sa lokaṃ bhajate siva’’nti. Parābhavasuttaṃ chaṭṭhaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Tena kho pana samayena aggikabhāradvājassa brāhmaṇassa nivesane aggi pajjalito hoti āhuti paggahitā. Atha kho bhagavā sāvatthiyaṃ sapadānaṃ piṇḍāya caramāno yena aggikabhāradvājassa brāhmaṇassa nivesanaṃ tenupasaṅkami. Addasā kho aggikabhāradvājo brāhmaṇo bhagavantaṃ dūratova āgacchantaṃ. Disvāna bhagavantaṃ etadavoca – ‘‘tatreva [atreva (syā. ka.)], muṇḍaka; tatreva, samaṇaka; tatreva, vasalaka tiṭṭhāhī’’ti. Evaṃ vutte, bhagavā aggikabhāradvājaṃ brāhmaṇaṃ etadavoca – ‘‘jānāsi pana tvaṃ, brāhmaṇa, vasalaṃ vā vasalakaraṇe vā dhamme’’ti? ‘‘Na khvāhaṃ, bho gotama, jānāmi vasalaṃ vā vasalakaraṇe vā dhamme; sādhu me bhavaṃ gotamo tathā dhammaṃ desetu, yathāhaṃ jāneyyaṃ vasalaṃ vā vasalakaraṇe vā dhamme’’ti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho aggikabhāradvājo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 116,
      "pali": "‘‘Kodhano upanāhī ca, pāpamakkhī ca yo naro; Vipannadiṭṭhi māyāvī, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Vasalasuttaṃ"
    },
    {
      "number": 117,
      "pali": "‘‘Ekajaṃ vā dvijaṃ [dijaṃ (pī.)] vāpi, yodha pāṇaṃ vihiṃsati; Yassa pāṇe dayā natthi, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 118,
      "pali": "‘‘Yo hanti parirundhati [uparundheti (syā.), uparundhati (ka.)], gāmāni nigamāni ca; Niggāhako [nigghātako (?)] samaññāto, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 119,
      "pali": "‘‘Gāme vā yadi vā raññe, yaṃ paresaṃ mamāyitaṃ; Theyyā adinnamādeti [adinnaṃ ādiyati (sī. pī.)], taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 120,
      "pali": "‘‘Yo have iṇamādāya, cujjamāno [bhuñjamāno (?)] palāyati; Na hi te iṇamatthīti, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 121,
      "pali": "‘‘Yo ve kiñcikkhakamyatā, panthasmiṃ vajantaṃ janaṃ; Hantvā kiñcikkhamādeti, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 122,
      "pali": "‘‘Attahetu parahetu, dhanahetu ca [dhanahetu va (ka.)] yo naro; Sakkhipuṭṭho musā brūti, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 123,
      "pali": "‘‘Yo ñātīnaṃ sakhīnaṃ vā, dāresu paṭidissati; Sāhasā [sahasā (sī. syā.)] sampiyena vā, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 124,
      "pali": "‘‘Yo mātaraṃ pitaraṃ vā, jiṇṇakaṃ gatayobbanaṃ; Pahu santo na bharati, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 125,
      "pali": "‘‘Yo mātaraṃ pitaraṃ vā, bhātaraṃ bhaginiṃ sasuṃ; Hanti roseti vācāya, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 126,
      "pali": "‘‘Yo atthaṃ pucchito santo, anatthamanusāsati; Paṭicchannena manteti, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 127,
      "pali": "‘‘Yo katvā pāpakaṃ kammaṃ, mā maṃ jaññāti icchati [vibha. 894 passitabbaṃ]; Yo paṭicchannakammanto, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 128,
      "pali": "‘‘Yo ve parakulaṃ gantvā, bhutvāna [sutvā ca (syā. ka.)] sucibhojanaṃ; Āgataṃ nappaṭipūjeti, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 129,
      "pali": "‘‘Yo brāhmaṇaṃ samaṇaṃ vā, aññaṃ vāpi vanibbakaṃ; Musāvādena vañceti, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 130,
      "pali": "‘‘Yo brāhmaṇaṃ samaṇaṃ vā, bhattakāle upaṭṭhite; Roseti vācā na ca deti, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 131,
      "pali": "‘‘Asataṃ yodha pabrūti, mohena paliguṇṭhito; Kiñcikkhaṃ nijigīsāno [nijigiṃsāno (sī. syā. kaṃ. pī.)], taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 132,
      "pali": "‘‘Yo cattānaṃ samukkaṃse, pare ca mavajānāti [mavajānati (sī. syā. pī.)]; Nihīno sena mānena, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 133,
      "pali": "‘‘Rosako kadariyo ca, pāpiccho maccharī saṭho; Ahiriko anottappī, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 134,
      "pali": "‘‘Yo buddhaṃ paribhāsati, atha vā tassa sāvakaṃ; Paribbājaṃ [paribbajaṃ (ka.), paribbājakaṃ (syā. kaṃ.)] gahaṭṭhaṃ vā, taṃ jaññā vasalo iti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 135,
      "pali": "‘‘Yo ve anarahaṃ [anarahā (sī. pī.)] santo, arahaṃ paṭijānāti [paṭijānati (sī. syā. pī.)]; Coro sabrahmake loke, eso kho vasalādhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 136,
      "pali": "‘‘Ete kho vasalā vuttā, mayā yete pakāsitā; Na jaccā vasalo hoti, na jaccā hoti brāhmaṇo; Kammunā [kammanā (sī. pī.)] vasalo hoti, kammunā hoti brāhmaṇo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 137,
      "pali": "‘‘Tadamināpi jānātha, yathāmedaṃ [yathāpedaṃ (ka.)] nidassanaṃ; Caṇḍālaputto sopāko [sapāko (?)], mātaṅgo iti vissuto.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 138,
      "pali": "‘‘So yasaṃ paramaṃ patto [so yasapparamappatto (syā. ka.)], mātaṅgo yaṃ sudullabhaṃ; Āgacchuṃ tassupaṭṭhānaṃ, khattiyā brāhmaṇā bahū.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 139,
      "pali": "‘‘Devayānaṃ abhiruyha, virajaṃ so mahāpathaṃ; Kāmarāgaṃ virājetvā, brahmalokūpago ahu; Na naṃ jāti nivāresi, brahmalokūpapattiyā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 140,
      "pali": "‘‘Ajjhāyakakule jātā, brāhmaṇā mantabandhavā; Te ca pāpesu kammesu, abhiṇhamupadissare.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 141,
      "pali": "‘‘Diṭṭheva dhamme gārayhā, samparāye ca duggati; Na ne jāti nivāreti, duggatyā [duggaccā (sī. syā. kaṃ. pī.)] garahāya vā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 142,
      "pali": "‘‘Na jaccā vasalo hoti, na jaccā hoti brāhmaṇo; Kammunā vasalo hoti, kammunā hoti brāhmaṇo’’ti. Evaṃ vutte, aggikabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama… pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Vasalasuttaṃ sattamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 143,
      "pali": "Karaṇīyamatthakusalena, yanta santaṃ padaṃ abhisamecca; Sakko ujū ca suhujū [sūjū (sī.)] ca, sūvaco cassa mudu anatimānī.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mettasuttaṃ"
    },
    {
      "number": 144,
      "pali": "Santussako ca subharo ca, appakicco ca sallahukavutti; Santindriyo ca nipako ca, appagabbho kulesvananugiddho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 145,
      "pali": "Na ca khuddamācare kiñci, yena viññū pare upavadeyyuṃ; Sukhino va khemino hontu, sabbasattā [sabbe sattā (sī. syā.)] bhavantu sukhitattā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 146,
      "pali": "Ye keci pāṇabhūtatthi, tasā vā thāvarā vanavasesā; Dīghā vā ye va mahantā [mahanta (?)], majjhimā rassakā aṇukathūlā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 147,
      "pali": "Diṭṭhā vā ye va adiṭṭhā [adiṭṭha (?)], ye va [ye ca (sī. syā. kaṃ. pī.)] dūre vasanti avidūre; Bhūtā va sambhavesī va [bhūtā vā sambhavesī vā (syā. kaṃ. pī. ka.)], sabbasattā bhavantu sukhitattā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 148,
      "pali": "Na paro paraṃ nikubbetha, nātimaññetha katthaci na kañci [naṃ kañci (sī. pī.), naṃ kiñci (syā.), na kiñci (ka.)]; Byārosanā paṭighasaññā, nāññamaññassa dukkhamiccheyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 149,
      "pali": "Mātā yathā niyaṃ puttamāyusā ekaputtamanurakkhe; Evampi sabbabhūtesu, mānasaṃ bhāvaye aparimāṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 150,
      "pali": "Mettañca sabbalokasmi, mānasaṃ bhāvaye aparimāṇaṃ; Uddhaṃ adho ca tiriyañca, asambādhaṃ averamasapattaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 151,
      "pali": "Tiṭṭhaṃ caraṃ nisinno va [vā (sī. syā. kaṃ. pī.)], sayāno yāvatāssa vitamiddho [vigatamiddo (bahūsu)]; Etaṃ satiṃ adhiṭṭheyya, brahmametaṃ vihāramidhamāhu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 152,
      "pali": "Diṭṭhiñca anupaggamma, sīlavā dassanena sampanno; Kāmesu vinaya [vineyya (sī. syā. pī.)] gedhaṃ, na hi jātuggabbhaseyya punaretīti. Mettasuttaṃ aṭṭhamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 153,
      "pali": "‘‘Ajja pannaraso uposatho, (iti sātāgiro yakkho) Dibbā [dibyā (sī. syā. kaṃ. pī.)] ratti upaṭṭhitā; Anomanāmaṃ satthāraṃ, handa passāma gotamaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Hemavatasuttaṃ"
    },
    {
      "number": 154,
      "pali": "‘‘Kacci mano supaṇihito, (iti hemavato yakkho) Sabbabhūtesu tādino; Kacci iṭṭhe aniṭṭhe ca, saṅkappassa vasīkatā’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 155,
      "pali": "‘‘Mano cassa supaṇihito, (iti sātāgiro yakkho) Sabbabhūtesu tādino; Atho iṭṭhe aniṭṭhe ca, saṅkappassa vasīkatā’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 156,
      "pali": "‘‘Kacci adinnaṃ nādiyati, (iti hemavato yakkho) Kacci pāṇesu saññato; Kacci ārā pamādamhā, kacci jhānaṃ na riñcati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 157,
      "pali": "‘‘Na so adinnaṃ ādiyati, (iti sātāgiro yakkho) Atho pāṇesu saññato; Atho ārā pamādamhā, buddho jhānaṃ na riñcati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 158,
      "pali": "‘‘Kacci musā na bhaṇati, (iti hemavato yakkho) Kacci na khīṇabyappatho; Kacci vebhūtiyaṃ nāha, kacci samphaṃ na bhāsati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 159,
      "pali": "‘‘Musā ca so na bhaṇati, (iti sātāgiro yakkho) Atho na khīṇabyappatho; Atho vebhūtiyaṃ nāha, mantā atthaṃ ca [atthaṃ so (sī. pī. ka.)] bhāsati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 160,
      "pali": "‘‘Kacci na rajjati kāmesu, (iti hemavato yakkho) Kacci cittaṃ anāvilaṃ; Kacci mohaṃ atikkanto, kacci dhammesu cakkhumā’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 161,
      "pali": "‘‘Na so rajjati kāmesu, (iti sātāgiro yakkho) Atho cittaṃ anāvilaṃ; Sabbamohaṃ atikkanto, buddho dhammesu cakkhumā’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 162,
      "pali": "‘‘Kacci vijjāya sampanno, (iti hemavato yakkho ) Kacci saṃsuddhacāraṇo; Kaccissa āsavā khīṇā, kacci natthi punabbhavo’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 163,
      "pali": "‘‘Vijjāya ceva sampanno, (iti sātāgiro yakkho) Atho saṃsuddhacāraṇo; Sabbassa āsavā khīṇā, natthi tassa punabbhavo’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 164,
      "pali": "‘‘Sampannaṃ munino cittaṃ, kammunā byappathena ca; Vijjācaraṇasampannaṃ, dhammato naṃ pasaṃsati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 165,
      "pali": "‘‘Sampannaṃ munino cittaṃ, kammunā byappathena ca; Vijjācaraṇasampannaṃ, dhammato anumodasi’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 166,
      "pali": "‘‘Sampannaṃ munino cittaṃ, kammunā byappathena ca; Vijjācaraṇasampannaṃ, handa passāma gotamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 167,
      "pali": "‘‘Eṇijaṅghaṃ kisaṃ vīraṃ [dhīraṃ (syā.)], appāhāraṃ alolupaṃ; Muniṃ vanasmiṃ jhāyantaṃ, ehi passāma gotamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 168,
      "pali": "‘‘Sīhaṃvekacaraṃ nāgaṃ, kāmesu anapekkhinaṃ; Upasaṅkamma pucchāma, maccupāsappamocanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 169,
      "pali": "‘‘Akkhātāraṃ pavattāraṃ, sabbadhammāna pāraguṃ; Buddhaṃ verabhayātītaṃ, mayaṃ pucchāma gotamaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 170,
      "pali": "‘‘Kismiṃ loko samuppanno, (iti hemavato yakkho) Kismiṃ kubbati santhavaṃ [sandhavaṃ (ka.)]; Kissa loko upādāya, kismiṃ loko vihaññati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 171,
      "pali": "‘‘Chasu [chassu (sī. pī.)] loko samuppanno, (hemavatāti bhagavā) Chasu kubbati santhavaṃ; Channameva upādāya, chasu loko vihaññati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 172,
      "pali": "‘‘Katamaṃ taṃ upādānaṃ, yattha loko vihaññati; Niyyānaṃ pucchito brūhi, kathaṃ dukkhā pamuccati’’ [pamuñcati (syā.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 173,
      "pali": "‘‘Pañca kāmaguṇā loke, manochaṭṭhā paveditā; Ettha chandaṃ virājetvā, evaṃ dukkhā pamuccati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 174,
      "pali": "‘‘Etaṃ lokassa niyyānaṃ, akkhātaṃ vo yathātathaṃ; Etaṃ vo ahamakkhāmi, evaṃ dukkhā pamuccati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 175,
      "pali": "‘‘Ko sūdha tarati oghaṃ, kodha tarati aṇṇavaṃ; Appatiṭṭhe anālambe, ko gambhīre na sīdati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 176,
      "pali": "‘‘Sabbadā sīlasampanno, paññavā susamāhito; Ajjhattacintī [ajjhattasaññī (syā. kaṃ. ka.)] satimā, oghaṃ tarati duttaraṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 177,
      "pali": "‘‘Virato kāmasaññāya, sabbasaṃyojanātigo; Nandībhavaparikkhīṇo, so gambhīre na sīdati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 178,
      "pali": "‘‘Gabbhīrapaññaṃ nipuṇatthadassiṃ, akiñcanaṃ kāmabhave asattaṃ; Taṃ passatha sabbadhi vippamuttaṃ, dibbe pathe kamamānaṃ mahesiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 179,
      "pali": "‘‘Anomanāmaṃ nipuṇatthadassiṃ, paññādadaṃ kāmālaye asattaṃ; Taṃ passatha sabbaviduṃ sumedhaṃ, ariye pathe kamamānaṃ mahesiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 180,
      "pali": "‘‘Sudiṭṭhaṃ vata no ajja, suppabhātaṃ suhuṭṭhitaṃ; Yaṃ addasāma sambuddhaṃ, oghatiṇṇamanāsavaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 181,
      "pali": "‘‘Ime dasasatā yakkhā, iddhimanto yasassino; Sabbe taṃ saraṇaṃ yanti, tvaṃ no satthā anuttaro.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 182,
      "pali": "‘‘Te mayaṃ vicarissāma, gāmā gāmaṃ nagā nagaṃ; Namassamānā sambuddhaṃ, dhammassa ca sudhammata’’nti. Hemavatasuttaṃ navamaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati āḷavakassa yakkhassa bhavane. Atha kho āḷavako yakkho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘nikkhama, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā nikkhami. ‘‘Pavisa, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā pāvisi. Dutiyampi kho…pe… tatiyampi kho āḷavako yakkho bhagavantaṃ etadavoca – ‘‘nikkhama, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā nikkhami. ‘‘Pavisa, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā pāvisi. Catutthampi kho āḷavako yakkho bhagavantaṃ etadavoca – ‘‘nikkhama, samaṇā’’ti. ‘‘Na khvāhaṃ taṃ, āvuso, nikkhamissāmi. Yaṃ te karaṇīyaṃ, taṃ karohī’’ti. ‘‘Pañhaṃ taṃ, samaṇa, pucchissāmi. Sace me na byākarissasi, cittaṃ vā te khipissāmi, hadayaṃ vā te phālessāmi, pādesu vā gahetvā pāragaṅgāya khipissāmī’’ti. ‘‘Na khvāhaṃ taṃ, āvuso, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yo me cittaṃ vā khipeyya hadayaṃ vā phāleyya pādesu vā gahetvā pāragaṅgāya khipeyya. Api ca tvaṃ, āvuso, puccha yadākaṅkhasī’’ti. Atha kho āḷavako yakkho bhagavantaṃ gāthāya ajjhabhāsi –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 183,
      "pali": "‘‘Kiṃ sūdha vittaṃ purisassa seṭṭhaṃ, kiṃ su suciṇṇaṃ sukhamāvahāti; Kiṃ su [kiṃ sū (sī.)] have sādutaraṃ rasānaṃ, kathaṃ jīviṃ jīvitamāhu seṭṭhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Āḷavakasuttaṃ"
    },
    {
      "number": 184,
      "pali": "‘‘Saddhīdha vittaṃ purisassa seṭṭhaṃ, dhammo suciṇṇo sukhamāvahāti; Saccaṃ have sādutaraṃ rasānaṃ, paññājīviṃ jīvitamāhu seṭṭhaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 185,
      "pali": "‘‘Kathaṃ su tarati oghaṃ, kathaṃ su tarati aṇṇavaṃ; Kathaṃ su dukkhamacceti, kathaṃ su parisujjhati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 186,
      "pali": "‘‘Saddhā tarati oghaṃ, appamādena aṇṇavaṃ; Vīriyena [viriyena (sī. syā. kaṃ. pī.)] dukkhamacceti, paññāya parisujjhati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 187,
      "pali": "‘‘Kathaṃ su labhate paññaṃ, kathaṃ su vindate dhanaṃ; Kathaṃ su kittiṃ pappoti, kathaṃ mittāni ganthati; Asmā lokā paraṃ lokaṃ, kathaṃ pecca na socati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 188,
      "pali": "‘‘Saddahāno arahataṃ, dhammaṃ nibbānapattiyā; Sussūsaṃ [sussūsā (sī. pī.)] labhate paññaṃ, appamatto vicakkhaṇo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 189,
      "pali": "‘‘Patirūpakārī dhuravā, uṭṭhātā vindate dhanaṃ; Saccena kittiṃ pappoti, dadaṃ mittāni ganthati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 190,
      "pali": "‘‘Yassete caturo dhammā, saddhassa gharamesino; Saccaṃ dhammo [damo (?)] dhiti cāgo, sa ve pecca na socati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 191,
      "pali": "‘‘Iṅgha aññepi pucchassu, puthū samaṇabrāhmaṇe; Yadi saccā damā cāgā, khantyā bhiyyodha vijjati’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 192,
      "pali": "‘‘Kathaṃ nu dāni puccheyyaṃ, puthū samaṇabrāhmaṇe; Yohaṃ [sohaṃ (sī. pī.)] ajja pajānāmi, yo attho samparāyiko.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 193,
      "pali": "‘‘Atthāya vata me buddho, vāsāyāḷavimāgamā; Yohaṃ [aṭṭhinhārūhi saṃyutto (syā. ka.)] ajja pajānāmi, yattha dinnaṃ mahapphalaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 194,
      "pali": "‘‘So ahaṃ vicarissāmi, gāmā gāmaṃ purā puraṃ; Namassamāno sambuddhaṃ, dhammassa ca sudhammata’’nti. Āḷavakasuttaṃ dasamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 195,
      "pali": "Caraṃ vā yadi vā tiṭṭhaṃ, nisinno uda vā sayaṃ; Samiñjeti pasāreti, esā kāyassa iñjanā.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Vijayasuttaṃ"
    },
    {
      "number": 196,
      "pali": "Aṭṭhinahārusaṃyutto, tacamaṃsāvalepano; Chaviyā kāyo paṭicchanno, yathābhūtaṃ na dissati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 197,
      "pali": "Antapūro udarapūro, yakanapeḷassa [yakapeḷassa (sī. syā.)] vatthino; Hadayassa papphāsassa, vakkassa pihakassa ca.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 198,
      "pali": "Siṅghāṇikāya kheḷassa, sedassa ca medassa ca; Lohitassa lasikāya, pittassa ca vasāya ca.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 199,
      "pali": "Athassa navahi sotehi, asucī savati sabbadā; Akkhimhā akkhigūthako, kaṇṇamhā kaṇṇagūthako.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 200,
      "pali": "Siṅghāṇikā ca nāsato, mukhena vamatekadā; Pittaṃ semhañca vamati, kāyamhā sedajallikā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 201,
      "pali": "Athassa susiraṃ sīsaṃ, matthaluṅgassa pūritaṃ; Subhato naṃ maññati, bālo avijjāya purakkhato.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 202,
      "pali": "Yadā ca so mato seti, uddhumāto vinīlako; Apaviddho susānasmiṃ, anapekkhā honti ñātayo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 203,
      "pali": "Khādanti naṃ suvānā [supāṇā (pī.)] ca, siṅgālā [sigālā (sī. syā. kaṃ. pī.)] vakā kimī; Kākā gijjhā ca khādanti, ye caññe santi pāṇino.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 204,
      "pali": "Sutvāna buddhavacanaṃ, bhikkhu paññāṇavā idha; So kho naṃ parijānāti, yathābhūtañhi passati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 205,
      "pali": "Yathā idaṃ tathā etaṃ, yathā etaṃ tathā idaṃ; Ajjhattañca bahiddhā ca, kāye chandaṃ virājaye.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 206,
      "pali": "Chandarāgaviratto so, bhikkhu paññāṇavā idha; Ajjhagā amataṃ santiṃ, nibbānaṃ padamaccutaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 207,
      "pali": "Dvipādakoyaṃ [dipādakoyaṃ (sī. syā. kaṃ. pī.)] asuci, duggandho parihārati [parihīrati (sī. syā. kaṃ. pī.)]; Nānākuṇapaparipūro, vissavanto tato tato.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 208,
      "pali": "Etādisena kāyena, yo maññe uṇṇametave [unnametave (?)]; Paraṃ vā avajāneyya, kimaññatra adassanāti. Vijayasuttaṃ ekādasamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 209,
      "pali": "Santhavāto [sandhavato (ka.)] bhayaṃ jātaṃ, niketā jāyate rajo; Aniketamasanthavaṃ, etaṃ ve munidassanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Munisuttaṃ"
    },
    {
      "number": 210,
      "pali": "Yo jātamucchijja na ropayeyya, jāyantamassa nānuppavecche; Tamāhu ekaṃ muninaṃ carantaṃ, addakkhi so santipadaṃ mahesi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 211,
      "pali": "Saṅkhāya vatthūni pamāya [pahāya (ka. sī. ka.), samāya (ka.) pa + mī + tvā = pamāya, yathā nissāyātipadaṃ] bījaṃ, sinehamassa nānuppavecche; Sa ve munī jātikhayantadassī, takkaṃ pahāya na upeti saṅkhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 212,
      "pali": "Aññāya sabbāni nivesanāni, anikāmayaṃ aññatarampi tesaṃ; Sa ve munī vītagedho agiddho, nāyūhatī pāragato hi hoti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 213,
      "pali": "Sabbābhibhuṃ sabbaviduṃ sumedhaṃ, sabbesu dhammesu anūpalittaṃ; Sabbañjahaṃ taṇhakkhaye vimuttaṃ, taṃ vāpi dhīrā muni [muniṃ (sī. pī.)] vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 214,
      "pali": "Paññābalaṃ sīlavatūpapannaṃ, samāhitaṃ jhānarataṃ satīmaṃ; Saṅgā pamuttaṃ akhilaṃ anāsavaṃ, taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 215,
      "pali": "Ekaṃ carantaṃ munimappamattaṃ, nindāpasaṃsāsu avedhamānaṃ; Sīhaṃva saddesu asantasantaṃ, vātaṃva jālamhi asajjamānaṃ; Padmaṃva [padumaṃva (sī. syā. pī.)] toyena alippamānaṃ [alimpamānaṃ (syā. ka.)], netāramaññesamanaññaneyyaṃ; Taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 216,
      "pali": "Yo ogahaṇe thambhorivābhijāyati, yasmiṃ pare vācāpariyantaṃ [vācaṃ pariyantaṃ (ka.)] vadanti; Taṃ vītarāgaṃ susamāhitindriyaṃ, taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 217,
      "pali": "Yo ve ṭhitatto tasaraṃva ujju, jigucchati kammehi pāpakehi; Vīmaṃsamāno visamaṃ samañca, taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 218,
      "pali": "Yo saññatatto na karoti pāpaṃ, daharo majjhimo ca muni [daharo ca majjho ca munī (sī. syā. kaṃ. pī.)] yatatto; Arosaneyyo na so roseti kañci [na roseti (syā.)], taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 219,
      "pali": "Yadaggato majjhato sesato vā, piṇḍaṃ labhetha paradattūpajīvī; Nālaṃ thutuṃ nopi nipaccavādī, taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 220,
      "pali": "Muniṃ carantaṃ virataṃ methunasmā, yo yobbane nopanibajjhate kvaci; Madappamādā virataṃ vippamuttaṃ, taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 221,
      "pali": "Aññāya lokaṃ paramatthadassiṃ, oghaṃ samuddaṃ atitariya tādiṃ; Taṃ chinnaganthaṃ asitaṃ anāsavaṃ, taṃ vāpi dhīrā muni vedayanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 222,
      "pali": "Asamā ubho dūravihāravuttino, gihī [gihi (ka.)] dāraposī amamo ca subbato; Parapāṇarodhāya gihī asaññato, niccaṃ munī rakkhati pāṇine [pāṇino (sī.)] yato.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 223,
      "pali": "Sikhī yathā nīlagīvo [nīlagivo (syā.)] vihaṅgamo, haṃsassa nopeti javaṃ kudācanaṃ; Evaṃ gihī nānukaroti bhikkhuno, munino vivittassa vanamhi jhāyatoti. Munisuttaṃ dvādasamaṃ niṭṭhitaṃ. Uragavaggo paṭhamo niṭṭhito. Tassuddānaṃ – Urago dhaniyo ceva, visāṇañca tathā kasi; Cundo parābhavo ceva, vasalo mettabhāvanā. Sātāgiro āḷavako, vijayo ca tathā muni; Dvādasetāni suttāni, uragavaggoti vuccatīti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}