{
  "id": "iti.6",
  "title": {
    "pali": "Paṭhamavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 50,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tīṇimāni, bhikkhave, akusalamūlāni. Katamāni tīṇi? Lobho akusalamūlaṃ, doso akusalamūlaṃ, moho akusalamūlaṃ – imāni kho, bhikkhave, tīṇi akusalamūlānī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Lobho doso ca moho ca, purisaṃ pāpacetasaṃ; Hiṃsanti attasambhūtā, tacasāraṃva samphala’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mūlasuttaṃ"
    },
    {
      "number": 51,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, dhātuyo. Katamā tisso? Rūpadhātu, arūpadhātu, nirodhadhātu – imā kho, bhikkhave, tisso dhātuyo’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Rūpadhātuṃ [rūpadhātu (sabbattha)] pariññāya, arūpesu asaṇṭhitā; Nirodhe ye vimuccanti, te janā maccuhāyino. ‘‘Kāyena amataṃ dhātuṃ, phusayitvā [phussayitvā (syā.), phassayitvā (pī.)] nirūpadhiṃ; Upadhippaṭinissaggaṃ, sacchikatvā anāsavo; Deseti sammāsambuddho, asokaṃ virajaṃ pada’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dhātusuttaṃ"
    },
    {
      "number": 52,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – Imā kho, bhikkhave, tisso vedanā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Samāhito sampajāno, sato buddhassa sāvako; Vedanā ca pajānāti, vedanānañca sambhavaṃ. ‘‘Yattha cetā nirujjhanti, maggañca khayagāminaṃ; Vedanānaṃ khayā bhikkhu, nicchāto parinibbuto’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamavedanāsuttaṃ"
    },
    {
      "number": 53,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Sukhā, bhikkhave, vedanā dukkhato daṭṭhabbā; dukkhā vedanā sallato daṭṭhabbā; adukkhamasukhā vedanā aniccato daṭṭhabbā. Yato kho, bhikkhave, bhikkhuno sukhā vedanā dukkhato diṭṭhā hoti, dukkhā vedanā sallato diṭṭhā hoti, adukkhamasukhā vedanā aniccato diṭṭhā hoti; ayaṃ vuccati, bhikkhave, ‘bhikkhu ariyo sammaddaso acchecchi [acchejji (sī. pī.), acchijji (ka.)], taṇhaṃ, vivattayi [vāvattayi (sī. aṭṭha.)] saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yo sukhaṃ dukkhato adda [dakkhi (sī. pī. ka.), adakkhi (syā.)], dukkhamaddakkhi sallato; Adukkhamasukhaṃ santaṃ, adakkhi naṃ aniccato. ‘‘Sa ve sammaddaso bhikkhu, yato tattha vimuccati; Abhiññāvosito santo, sa ve yogātigo munī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyavedanāsuttaṃ"
    },
    {
      "number": 54,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Samāhito sampajāno, sato buddhassa sāvako; Esanā ca pajānāti, esanānañca sambhavaṃ. ‘‘Yattha cetā nirujjhanti, maggañca khayagāminaṃ; Esanānaṃ khayā bhikkhu, nicchāto parinibbuto’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamaesanāsuttaṃ"
    },
    {
      "number": 55,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kāmesanā bhavesanā, brahmacariyesanā saha; Iti saccaparāmāso, diṭṭhiṭṭhānā samussayā. ‘‘Sabbarāgavirattassa, taṇhakkhayavimuttino; Esanā paṭinissaṭṭhā, diṭṭhiṭṭhānā samūhatā; Esanānaṃ khayā bhikkhu, nirāso akathaṃkathī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyaesanāsuttaṃ"
    },
    {
      "number": 56,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, āsavā. Katame tayo? Kāmāsavo, bhavāsavo, avijjāsavo – ime kho, bhikkhave, tayo āsavā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Samāhito sampajāno, sato buddhassa sāvako; Āsave ca pajānāti, āsavānañca sambhavaṃ. ‘‘Yattha cetā nirujjhanti, maggañca khayagāminaṃ; Āsavānaṃ khayā bhikkhu, nicchāto parinibbuto’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamaāsavasuttaṃ"
    },
    {
      "number": 57,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, āsavā. Katame tayo? Kāmāsavo, bhavāsavo, avijjāsavo – ime kho, bhikkhave, tayo āsavā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yassa kāmāsavo khīṇo, avijjā ca virājitā; Bhavāsavo parikkhīṇo, vippamutto nirūpadhi; Dhāreti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti [savāhananti (bahūsu)]. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyaāsavasuttaṃ"
    },
    {
      "number": 58,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, taṇhā. Katamā tisso? Kāmataṇhā, bhavataṇhā, vibhavataṇhā – imā kho, bhikkhave, tisso taṇhā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Taṇhāyogena saṃyuttā, rattacittā bhavābhave; Te yogayuttā mārassa, ayogakkhemino janā; Sattā gacchanti saṃsāraṃ, jātīmaraṇagāmino. ‘‘Ye ca taṇhaṃ pahantvāna, vītataṇhā [nikkaṇhā ca (sī. ka.)] bhavābhave; Te ve [te ca (sī. pī. ka.)] pāraṅgatā [pāragatā (ka. sī. syā.)] loke, ye pattā āsavakkhaya’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Taṇhāsuttaṃ"
    },
    {
      "number": 59,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu atikkamma māradheyyaṃ ādiccova virocati. Katamehi tīhi? Idha, bhikkhave, bhikkhu asekhena sīlakkhandhena samannāgato hoti, asekhena samādhikkhandhena samannāgato hoti, asekhena paññākkhandhena samannāgato hoti – imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu atikkamma māradheyyaṃ ādiccova virocatī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Sīlaṃ samādhi paññā ca, yassa ete subhāvitā; Atikkamma māradheyyaṃ, ādiccova virocatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ. Paṭhamo vaggo niṭṭhito. Tassuddānaṃ – Mūladhātu atha vedanā duve, esanā ca duve āsavā duve; Taṇhāto ca atha [taṇhāto atha (syā.)] māradheyyato, vaggamāhu paṭhamanti muttamanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Māradheyyasuttaṃ"
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}