{
  "id": "iti.2",
  "title": {
    "pali": "Dutiyavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 11,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Mohaṃ, bhikkhave, anabhijānaṃ aparijānaṃ tattha cittaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāya. Mohañca kho, bhikkhave, abhijānaṃ parijānaṃ tattha cittaṃ virājayaṃ pajahaṃ bhabbo dukkhakkhayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena mohena mūḷhāse, sattā gacchanti duggatiṃ; Taṃ mohaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mohapariññāsuttaṃ"
    },
    {
      "number": 12,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Kodhaṃ, bhikkhave, anabhijānaṃ aparijānaṃ tattha cittaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāya. Kodhañca kho, bhikkhave, abhijānaṃ parijānaṃ tattha cittaṃ virājayaṃ pajahaṃ bhabbo dukkhakkhayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena kodhena kuddhāse, sattā gacchanti duggatiṃ; Taṃ kodhaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Kodhapariññāsuttaṃ"
    },
    {
      "number": 3,
      "pali": "Makkhapariññāsuttaṃ",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Makkhaṃ, bhikkhave, anabhijānaṃ aparijānaṃ tattha cittaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāya. Makkhañca kho, bhikkhave, abhijānaṃ parijānaṃ tattha cittaṃ virājayaṃ pajahaṃ bhabbo dukkhakkhayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena makkhena makkhāse, sattā gacchanti duggatiṃ; Taṃ makkhaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Nāhaṃ, bhikkhave, aññaṃ ekanīvaraṇampi samanupassāmi yena [yenevaṃ (?)] nīvaraṇena nivutā pajā dīgharattaṃ sandhāvanti saṃsaranti yathayidaṃ, bhikkhave, avijjānīvaraṇaṃ [avijjānīvaraṇena (?)]. Avijjānīvaraṇena hi, bhikkhave, nivutā pajā dīgharattaṃ sandhāvanti saṃsarantī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Natthañño ekadhammopi, yenevaṃ [yeneva (sī. pī. ka.)] nivutā pajā; Saṃsaranti ahorattaṃ, yathā mohena āvutā. ‘‘Ye ca mohaṃ pahantvāna, tamokhandhaṃ [tamokkhandhaṃ (sī. syā. pī.)] padālayuṃ; Na te puna saṃsaranti, hetu tesaṃ na vijjatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Avijjānīvaraṇasuttaṃ"
    },
    {
      "number": 15,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Nāhaṃ, bhikkhave, aññaṃ ekasaṃyojanampi samanupassāmi yena [yenevaṃ (syā.)] saṃyojanena saṃyuttā sattā dīgharattaṃ sandhāvanti saṃsaranti yathayidaṃ, bhikkhave, taṇhāsaṃyojanaṃ [taṇhāsaṃyojanena (?)]. Taṇhāsaṃyojanena hi, bhikkhave, saṃyuttā sattā dīgharattaṃ sandhāvanti saṃsarantī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Taṇhādutiyo puriso, dīghamaddhāna saṃsaraṃ; Itthabhāvaññathābhāvaṃ [itthambhāvaññathābhāvaṃ (syā.)], saṃsāraṃ nātivattati. ‘‘Etamādīnavaṃ [evamādīnavaṃ (sī. pī. ka.)] ñatvā, taṇhaṃ [taṇhā (sī. ka.)] dukkhassa sambhavaṃ; Vītataṇho anādāno, sato bhikkhu paribbaje’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Taṇhāsaṃyojanasuttaṃ"
    },
    {
      "number": 16,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Sekhassa, bhikkhave, bhikkhuno appattamānasassa anuttaraṃ yogakkhemaṃ patthayamānassa viharato ajjhattikaṃ aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ bahūpakāraṃ yathayidaṃ, bhikkhave, yoniso manasikāro. Yoniso, bhikkhave, bhikkhu manasi karonto akusalaṃ pajahati, kusalaṃ bhāvetī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yoniso manasikāro, dhammo sekhassa bhikkhuno; Natthañño evaṃ bahukāro, uttamatthassa pattiyā; Yoniso padahaṃ bhikkhu, khayaṃ dukkhassa pāpuṇe’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamasekhasuttaṃ"
    },
    {
      "number": 17,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Sekhassa, bhikkhave, bhikkhuno appattamānasassa anuttaraṃ yogakkhemaṃ patthayamānassa viharato bāhiraṃ aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ bahūpakāraṃ yathayidaṃ, bhikkhave, kalyāṇamittatā. Kalyāṇamitto, bhikkhave, bhikkhu akusalaṃ pajahati, kusalaṃ bhāvetī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kalyāṇamitto yo bhikkhu, sappatisso sagāravo; Karaṃ mittānaṃ vacanaṃ, sampajāno patissato; Pāpuṇe anupubbena, sabbasaṃyojanakkhaya’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyasekhasuttaṃ"
    },
    {
      "number": 18,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammo, bhikkhave, loke uppajjamāno uppajjati bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Katamo ekadhammo? Saṅghabhedo. Saṅghe kho pana, bhikkhave, bhinne aññamaññaṃ bhaṇḍanāni ceva honti, aññamaññaṃ paribhāsā ca honti, aññamaññaṃ parikkhepā ca honti, aññamaññaṃ pariccajanā ca honti. Tattha appasannā ceva nappasīdanti, pasannānañca ekaccānaṃ aññathattaṃ hotī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Āpāyiko nerayiko, kappaṭṭho saṅghabhedako; Vaggārāmo adhammaṭṭho, yogakkhemā padhaṃsati [yogakkhemato dhaṃsati (syā. pī.), yogakkhemā vimaṃsati (sī. ka.)]; Saṅghaṃ samaggaṃ bhetvāna [bhitvāna (sī. ka.), bhinditvā (cūḷava. 354; a. ni. 10.39)], kappaṃ nirayamhi paccatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Saṅghabhedasuttaṃ"
    },
    {
      "number": 19,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammo, bhikkhave, loke uppajjamāno uppajjati bahujanahitāya bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Katamo ekadhammo? Saṅghasāmaggī. Saṅghe kho pana, bhikkhave, samagge na ceva aññamaññaṃ bhaṇḍanāni honti, na ca aññamaññaṃ paribhāsā honti, na ca aññamaññaṃ parikkhepā honti, na ca aññamaññaṃ pariccajanā honti. Tattha appasannā ceva pasīdanti, pasannānañca bhiyyobhāvo hotī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Sukhā saṅghassa sāmaggī, samaggānañcanuggaho; Samaggarato dhammaṭṭho, yogakkhemā na dhaṃsati; Saṅghaṃ samaggaṃ katvāna, kappaṃ saggamhi modatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Saṅghasāmaggīsuttaṃ"
    },
    {
      "number": 20,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ paduṭṭhacittaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imamhi cāyaṃ samaye puggalo kālaṅkareyya yathābhataṃ nikkhitto evaṃ niraye’. Taṃ kissa hetu? Cittaṃ hissa, bhikkhave, paduṭṭhaṃ. Cetopadosahetu kho pana, bhikkhave, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Paduṭṭhacittaṃ ñatvāna, ekaccaṃ idha puggalaṃ; Etamatthañca byākāsi, buddho bhikkhūna santike. ‘‘Imamhi cāyaṃ samaye, kālaṃ kayirātha puggalo; Nirayaṃ upapajjeyya, cittaṃ hissa padūsitaṃ. ‘‘Yathā haritvā nikkhipeyya, evameva tathāvidho; Cetopadosahetu hi, sattā gacchanti duggati’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ. Dutiyo vaggo niṭṭhito. Tassuddānaṃ – Moho kodho atha makkho, vijjā taṇhā sekhaduve ca; Bhedo sāmaggipuggalo [mohakodha atha makkhāgato, mūhā kāmasekkhaduve; bhedasāmaggapuggalo ca (sī. ka.) mohakodhā atha makkho mohakāmā sekkhā duve; bhedamodā puggalo ca (syā. pī.)], vaggamāhu dutiyanti vuccatīti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paduṭṭhacittasuttaṃ"
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}