{
  "id": "an7.1",
  "title": {
    "pali": "Dhanavaggo",
    "english": "The Chapter on Wealth",
    "sinhala": "ධන වර්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi sattahi? Idha, bhikkhave, bhikkhu lābhakāmo ca hoti, sakkārakāmo ca hoti, anavaññattikāmo ca hoti, ahiriko ca hoti, anottappī ca, pāpiccho ca, micchādiṭṭhi ca. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti, manāpo ca garu ca bhāvanīyo ca. Katamehi sattahi? Idha, bhikkhave, bhikkhu na lābhakāmo ca hoti, na sakkārakāmo ca hoti, na anavaññattikāmo ca hoti, hirimā ca hoti, ottappī ca, appiccho ca, sammādiṭṭhi ca. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling at Savatthi, in Jeta's Grove, Anathapindika's monastery. There, the Blessed One addressed the monks, saying, \"Monks.\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"Monks, a monk endowed with seven qualities becomes disliked by his companions in the holy life, disagreeable, unworthy of respect, and not to be esteemed. With which seven? Here, monks, a monk is desirous of gain, desirous of honor, desirous of recognition, is shameless, is reckless of wrongdoing, has wicked desires, and holds wrong view. Indeed, monks, a monk endowed with these seven qualities becomes disliked by his companions in the holy life, disagreeable, unworthy of respect, and not to be esteemed.\n\n\"Monks, a monk endowed with seven qualities becomes dear to his companions in the holy life, agreeable, worthy of respect, and to be esteemed. With which seven? Here, monks, a monk is not desirous of gain, not desirous of honor, not desirous of recognition, is conscientious, is scrupulous, has few desires, and holds right view. Indeed, monks, a monk endowed with these seven qualities becomes dear to his companions in the holy life, agreeable, worthy of respect, and to be esteemed.\"",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් ආරාමයෙහි, අනේපිඬු සිටුහුගේ අරම්හි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" කියා වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\n\"මහණෙනි, කරුණු සතකින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රිය ද, අමනාප ද, ගරු නොකටයුතු ද, භාවනා නොකටයුතු ද වේ. ඒ සත් කරුණ කුමක්ද? මහණෙනි, මෙහිලා භික්ෂුවක් ලාභයට කැමති ද වේ, සත්කාරයට කැමති ද වේ, අවඥාවට පත් නොවීම පිණිස කැමති ද වේ, නිර්ලජ්ජී ද වේ, පව් කිරීමට නොබිය වූවෙක් ද වේ, පාපිච්ඡා ඇත්තෙක් ද වේ, මිථ්‍යාදෘෂ්ටික ද වේ. මහණෙනි, මේ සත් කරුණින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රිය ද, අමනාප ද, ගරු නොකටයුතු ද, භාවනා නොකටයුතු ද වේ. මහණෙනි, කරුණු සතකින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද, මනාප ද, ගරු කටයුතු ද, භාවනා කටයුතු ද වේ. ඒ සත් කරුණ කුමක්ද? මහණෙනි, මෙහිලා භික්ෂුවක් ලාභයට කැමති නොවේ, සත්කාරයට කැමති නොවේ, අවඥාවට පත් නොවීම පිණිස කැමති නොවේ, ලජ්ජා ඇත්තෙක් ද වේ, පව් කිරීමට බිය වූවෙක් ද වේ, අල්පේච්ඡ වූවෙක් ද වේ, සම්මාදිට්ඨික ද වේ. මහණෙනි, මේ සත් කරුණින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද, මනාප ද, ගරු කටයුතු ද, භාවනා කටයුතු ද වේ\" යි. පළමුවැන්නයි.",
      "paliTitle": "Paṭhamapiyasuttaṃ"
    },
    {
      "number": 2,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi sattahi? Idha, bhikkhave, bhikkhu lābhakāmo ca hoti, sakkārakāmo ca hoti, anavaññattikāmo ca hoti, ahiriko ca hoti, anottappī ca, issukī ca, maccharī ca. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu+? Sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi sattahi? Idha, bhikkhave, bhikkhu na lābhakāmo ca hoti, na sakkārakāmo ca hoti, na anavaññattikāmo ca hoti, hirimā ca hoti, ottappī ca, anissukī ca, amaccharī ca. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Dutiyaṃ.",
      "english": "O monastics, a monastic endowed with seven qualities becomes disliked and displeasing, unesteemed and not worthy of cultivation by fellow practitioners. Which seven? Here, O monastics, a monastic is desirous of gain, desirous of honor, desirous of avoiding contempt, lacking moral shame, lacking moral dread, envious, and stingy. Indeed, O monastics, a monastic endowed with these seven qualities becomes disliked and displeasing, unesteemed and not worthy of cultivation by fellow practitioners.\n\nO monastics, a monastic endowed with seven qualities becomes liked and pleasing, revered and worthy of cultivation by fellow practitioners. Which seven? Here, O monastics, a monastic is not desirous of gain, not desirous of honor, not desirous of avoiding contempt, possesses moral shame, possesses moral dread, is not envious, and is not stingy. Indeed, O monastics, a monastic endowed with these seven qualities becomes liked and pleasing, revered and worthy of cultivation by fellow practitioners.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්ම‍ සතකින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වෙයි, අමනාප ද වෙයි, ගරු කටයුතු නො ද වෙයි, භාවනීය නො ද වෙයි. කවර සත් ධර්ම‍යකින් ද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුව ලාභ අපේක්ෂා කරන්නෙක් වෙයි, සත්කාර අපේක්ෂා කරන්නෙක් වෙයි, අවමානයට ලක් නොවීම අපේක්ෂා කරන්නෙක් වෙයි, ලජ්ජාව රහිත අයෙක් වෙයි, පව් කිරීමට බිය නැති අයෙක් වෙයි, ඊර්ෂ්‍යා ඇත්තෙක් වෙයි, මසුරු අයෙක් වෙයි. භික්ෂූන් වහන්ස, මේ සත් ධර්ම‍යන්ගෙන් යුක්ත වූ භික්ෂුව සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වෙයි, අමනාප ද වෙයි, ගරු කටයුතු නො ද වෙයි, භාවනීය නො ද වෙයි.\n\nභික්ෂූන් වහන්ස, ධර්ම‍ සතකින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, භාවනීය ද වෙයි. කවර සත් ධර්ම‍යකින් ද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුව ලාභ අපේක්ෂා නොකරන්නෙක් වෙයි, සත්කාර අපේක්ෂා නොකරන්නෙක් වෙයි, අවමානයට ලක් නොවීම අපේක්ෂා නොකරන්නෙක් වෙයි, ලජ්ජාව ඇත්තෙක් වෙයි, පව් කිරීමට බිය ඇත්තෙක් වෙයි, ඊර්ෂ්‍යා නැත්තෙක් වෙයි, මසුරු නොවන අයෙක් වෙයි. භික්ෂූන් වහන්ස, මේ සත් ධර්ම‍යන්ගෙන් යුක්ත වූ භික්ෂුව සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, භාවනීය ද වෙයි. මෙය දෙවෙනි (කථාවයි).",
      "paliTitle": "Dutiyapiyasuttaṃ"
    },
    {
      "number": 3,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme…pe… sattimāni, bhikkhave, balāni. Katamāni satta? Saddhābalaṃ, vīriyabalaṃ, hirībalaṃ, ottappabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ. Imāni kho, bhikkhave, satta balānīti. ‘‘Saddhābalaṃ vīriyañca, hirī [hiri (sī. pī. ka.)] ottappiyaṃ balaṃ; Satibalaṃ samādhi ca, paññā ve sattamaṃ balaṃ; Etehi balavā bhikkhu, sukhaṃ jīvati paṇḍito; ‘‘Yoniso vicine dhammaṃ, paññāyatthaṃ vipassati; Pajjotasseva nibbānaṃ, vimokkho hoti cetaso’’ti. tatiyaṃ;",
      "english": "Thus have I heard. At one time the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park.\n\n\"Monks, there are these seven powers. Which seven? The power of conviction, the power of persistent effort, the power of moral shame, the power of moral dread, the power of mindfulness, the power of concentration, and the power of wisdom. These, monks, are the seven powers.\"\n\nThe power of conviction and persistent effort,\nThe power of moral shame and moral dread;\nThe power of mindfulness and concentration,\nAnd wisdom is truly the seventh power.\nA monk endowed with these powers, a wise one, lives happily.\nWisely investigating the teachings, with wisdom one discerns their true meaning;\nLike the extinguishing of a lamp, so is the liberation of the mind.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් ආරාමයෙහි අනේපිඬු සිටුතුමා විසින් කරවන ලද ආරාමයෙහි වාසය කරති.\n\nමහණෙනි, මේ බලයන් සතකි. ඒ කවර සතක්ද? ශ්‍රද්ධා බලය, වීර්ය්‍ය බලය, හිරී බලය, ඔත්තප්ප බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලය යන මේවායි. මහණෙනි, මේ ඒ සත් බලයෝය.\n\n“ශ්‍රද්ධා බලයද, වීර්ය්‍ය බලයද, හිරී බලයද, ඔත්තප්ප බලයද,\nසති බලයද, සමාධියද, ප්‍රඥාව සත්වන බලය වේ.\nඒ බලයන්ගෙන් බලවත් වූ පණ්ඩිත භික්ෂුව සුවසේ ජීවත් වේ.\nනුවණින් (යෝනිසෝමනසිකාරයෙන්) ධර්මය විචාරන්නේ, ප්‍රඥාවෙන් එහි අර්ථය විශේෂයෙන් දකී.\nපහනක නිවීමක් මෙන් සිතේ විමුක්තිය සිදු වේ.”",
      "paliTitle": "Saṃkhittabalasuttaṃ"
    },
    {
      "number": 4,
      "pali": "‘‘Sattimāni, bhikkhave, balāni. Katamāni satta? Saddhābala, vīriyabalaṃ, hirībalaṃ, ottappabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ. ‘‘Katamañca, bhikkhave, saddhābalaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho…pe… satthā devamanussānaṃ buddho bhagavā’ti. Idaṃ vuccati, bhikkhave, saddhābalaṃ. ‘‘Katamañca, bhikkhave, vīriyabalaṃ? Idha, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Idaṃ vuccati, bhikkhave, vīriyabalaṃ. ‘‘Katamañca, bhikkhave, hirībalaṃ? Idha, bhikkhave, ariyasāvako hirimā hoti, hirīyati kāyaduccaritena vacīduccaritena manoduccaritena, hirīyati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Idaṃ vuccati, bhikkhave, hirībalaṃ. ‘‘Katamañca, bhikkhave, ottappabalaṃ? Idha, bhikkhave, ariyasāvako ottappī hoti, ottappati kāyaduccaritena vacīduccaritena manoduccaritena, ottappati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Idaṃ vuccati, bhikkhave, ottappabalaṃ. ‘‘Katamañca, bhikkhave, satibalaṃ? Idha, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Idaṃ, vuccati, bhikkhave, satibalaṃ. ‘‘Katamañca, bhikkhave, samādhibalaṃ? Idha, bhikkhave, ariyasāvako vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati, bhikkhave, samādhibalaṃ. ‘‘Katamañca, bhikkhave, paññābalaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Idaṃ vuccati, bhikkhave, paññābalaṃ. Imāni kho, bhikkhave, satta balānīti. ‘‘Saddhābalaṃ vīriyañca, hirī ottappiyaṃ balaṃ; Satibalaṃ samādhi ca, paññā ve sattamaṃ balaṃ; Etehi balavā bhikkhu, sukhaṃ jīvati paṇḍito. ‘‘Yoniso vicine dhammaṃ, paññāyatthaṃ vipassati; Pajjotasseva nibbānaṃ, vimokkho hoti cetaso’’ti. catutthaṃ;",
      "english": "Monks, there are these seven powers. Which seven? The power of faith, the power of energy, the power of moral shame, the power of moral dread, the power of mindfulness, the power of concentration, and the power of wisdom.\n\nAnd what, monks, is the power of faith? Here, monks, a noble disciple is endowed with faith; he has faith in the Tathāgata’s enlightenment, realizing that ‘Indeed, the Blessed One is an Arahant, a Perfectly Self-Awakened One, accomplished in true knowledge and conduct, sublime, knower of worlds, unsurpassed leader of persons to be tamed, a teacher of gods and humans, the Awakened One, the Blessed One.’ This, monks, is called the power of faith.\n\nAnd what, monks, is the power of energy? Here, monks, a noble disciple dwells with aroused energy for the abandoning of unwholesome states and for the acquisition of wholesome states; he is steadfast, firm in his exertion, and does not lay aside the burden in regard to wholesome states. This, monks, is called the power of energy.\n\nAnd what, monks, is the power of moral shame? Here, monks, a noble disciple is endowed with moral shame; he feels shame regarding misconduct by body, by speech, and by mind; he feels shame regarding the acquisition of evil, unwholesome states. This, monks, is called the power of moral shame.\n\nAnd what, monks, is the power of moral dread? Here, monks, a noble disciple is endowed with moral dread; he feels dread regarding misconduct by body, by speech, and by mind; he feels dread regarding the acquisition of evil, unwholesome states. This, monks, is called the power of moral dread.\n\nAnd what, monks, is the power of mindfulness? Here, monks, a noble disciple is mindful, endowed with supreme mindfulness and circumspection, one who remembers and recollects what was done and said long ago. This, monks, is called the power of mindfulness.\n\nAnd what, monks, is the power of concentration? Here, monks, a noble disciple, quite secluded from sensual pleasures, secluded from unwholesome states, enters upon and abides in the first jhana, which is accompanied by applied thought and sustained thought, born of seclusion and filled with rapture and happiness. With the stilling of applied thought and sustained thought, he enters upon and abides in the second jhana, which has internal assurance and unification of mind, is without applied thought and sustained thought, and is born of concentration and filled with rapture and happiness. With the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body; he enters upon and abides in the third jhana, of which the Noble Ones declare: ‘He is equanimous, mindful, one who dwells happily.’ With the abandoning of pleasure and pain, and with the prior disappearance of joy and grief, he enters upon and abides in the fourth jhana, which is neither painful nor pleasant and is purified by equanimity and mindfulness. This, monks, is called the power of concentration.\n\nAnd what, monks, is the power of wisdom? Here, monks, a noble disciple is wise, endowed with the wisdom that discerns rise and fall, which is noble and penetrative and leads to the complete destruction of suffering. This, monks, is called the power of wisdom.\n\nThese, monks, are the seven powers.\n\nThe power of faith and energy,\nThe power of moral shame and moral dread;\nThe power of mindfulness and concentration,\nAnd wisdom, indeed, is the seventh power.\nA bhikkhu endowed with these powers\nLives happily, being wise.\n\nWisely he investigates the Dhamma,\nAnd by wisdom he discerns its meaning;\nLike a lamp extinguished,\nHis mind is liberated in Nibbāna.",
      "sinhala": "මහණෙනි, මේ බලධර්ම සතකි. කවරේද ඒ සත? එනම්: ශ්‍රද්ධා බලය, වීර්යය බලය, හිරි බලය, ඔතප් බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලයයි.\n\nමහණෙනි, ශ්‍රද්ධා බලය යනු කවරේද? මහණෙනි, මේ ශාසනයෙහි ආර්යශ්‍රාවකයා ශ්‍රද්ධාවෙන් යුක්ත වෙයි. ඔහු තථාගතයන් වහන්සේගේ බෝධිය මෙසේ විශ්වාස කරයි: ‘ඒ භාග්‍ය​වතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධයහ... (ආදී වශයෙන්) දෙවි මිනිසුන්ගේ ශාස්තෘවරයාය, බුද්ධයහ, භාග්‍ය​වතුන් වහන්සේය’ යනුයි. මහණෙනි, මෙය ශ්‍රද්ධා බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, වීර්යය බලය යනු කවරේද? මහණෙනි, මේ ශාසනයෙහි ආර්යශ්‍රාවකයා අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් සම්පූර්ණ කර ගැනීම පිණිසත්, ආරම්භ කළ වීර්යයෙන් යුක්තව වාසය කරයි. ඔහු ධෛර්ය සම්පන්නව, දැඩි වීර්යයෙන් යුතුව, කුසල ධර්මයන් පිළිබඳව තම බර අත්නොහරිනසුලුය. මහණෙනි, මෙය වීර්යය බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, හිරි බලය යනු කවරේද? මහණෙනි, මේ ශාසනයෙහි ආර්යශ්‍රාවකයා ලජ්ජා ඇත්තෙක් වෙයි. හෙතෙම කය දුසිරිතෙන්ද, වචී දුසිරිතෙන්ද, මනෝ දුසිරිතෙන්ද ලජ්ජා වෙයි. පව්කම් වන අකුසල ධර්මයන්ට සමවැදීමෙන් ලජ්ජා වෙයි. මහණෙනි, මෙය හිරි බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, ඔතප් බලය යනු කවරේද? මහණෙනි, මේ ශාසනයෙහි ආර්යශ්‍රාවකයා පව් අකුසලයන්ට බිය ඇත්තෙක් වෙයි. හෙතෙම කය දුසිරිතෙන්ද, වචී දුසිරිතෙන්ද, මනෝ දුසිරිතෙන්ද බිය වෙයි. පව්කම් වන අකුසල ධර්මයන්ට සමවැදීමෙන් බිය වෙයි. මහණෙනි, මෙය ඔතප් බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, සති බලය යනු කවරේද? මහණෙනි, මේ ශාසනයෙහි ආර්යශ්‍රාවකයා සිහි ඇතිව වාසය කරයි. ඉතා උසස් වූ සිහි නුවණින් යුක්තව, බොහෝ කලකට පෙර කරන ලද දෙයක් වුවද, බොහෝ කලකට පෙර කියන ලද දෙයක් වුවද සිහි කරන්නේය, නැවත නැවත සිහිපත් කරන්නේය. මහණෙනි, මෙය සති බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, සමාධි බලය යනු කවරේද? මහණෙනි, මේ ශාසනයෙහි ආර්යශ්‍රාවකයා කාමයන්ගෙන් වෙන්ව... (පෙල පද ක්‍රමයෙන්) සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරයි. මහණෙනි, මෙය සමාධි බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රඥා බලය යනු කවරේද? මහණෙනි, මේ ශාසනයෙහි ආර්යශ්‍රාවකයා ප්‍රඥාවන්තයෙක් වෙයි. හෙතෙම උදයවය දක්නා නුවණින් යුක්තය, ආර්ය වූ, (කෙලෙස්) බිඳින්නාවූ, මැනවින් දුක් කෙළවර කරා ගමන් කරන්නා වූ ප්‍රඥාවෙන් යුක්තය. මහණෙනි, මෙය ප්‍රඥා බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, මේ බලධර්ම සතයි.\n\nශ්‍රද්ධා බලයද, වීර්යයද, හිරිද, ඔතප් නම් බලයද;\nසති බලයද, සමාධියද, ප්‍රඥාව නම් වූ සත්වෙනි බලයද;\nමේ බලධර්මයන්ගෙන් බලවත් වූ පණ්ඩිත භික්ෂුව සැපසේ ජීවත් වෙයි.\n\nහේ නුවණින්, ධර්ම​ය මනාකොට විමසයි. ප්‍රඥාවෙන් අර්ථය විදර්ශනා කරයි.\nපහනක් නිවී යන්නා සේ සිතේ විමුක්තිය නිර්වාණයට පත් වෙයි.",
      "paliTitle": "Vitthatabalasuttaṃ"
    },
    {
      "number": 5,
      "pali": "‘‘Sattimāni, bhikkhave, dhanāni. Katamāni satta? Saddhādhanaṃ, sīladhanaṃ, hirīdhanaṃ, ottappadhanaṃ, sutadhanaṃ, cāgadhanaṃ, paññādhanaṃ. Imāni kho, bhikkhave, satta dhanānīti. ‘‘Saddhādhanaṃ sīladhanaṃ, hirī ottappiyaṃ dhanaṃ; Sutadhanañca cāgo ca, paññā ve sattamaṃ dhanaṃ. ‘‘Yassa ete dhanā atthi, itthiyā purisassa vā; Adaliddoti taṃ āhu, amoghaṃ tassa jīvitaṃ. ‘‘Tasmā saddhañca sīlañca, pasādaṃ dhammadassanaṃ; Anuyuñjetha medhāvī, saraṃ [varaṃ (ka.)] buddhāna sāsana’’nti. pañcamaṃ;",
      "english": "Monks, there are these seven treasures. Which seven? The treasure of conviction, the treasure of moral virtue, the treasure of moral shame, the treasure of moral dread, the treasure of learning, the treasure of generosity, and the treasure of wisdom. Indeed, monks, these are the seven treasures.\n\nThe treasure of conviction, the treasure of moral virtue; moral shame and moral dread are treasures. The treasure of learning and generosity, and indeed wisdom is the seventh treasure.\n\nWhoever, be it a woman or a man, possesses these treasures, they are declared not poor; their life is not in vain.\n\nTherefore, the wise one should constantly cultivate conviction, moral virtue, serene confidence, and insight into the Dhamma, ever recollecting the excellent teaching of the Buddhas.",
      "sinhala": "භික්ෂූණි, මේ ධනයන් සතකි. ඒ සත කවරේද? ශ්‍රද්ධා ධනය, ශීල ධනය, හිරි ධනය, ඔතප් ධනය, ශ්‍රැත ධනය, ත්‍යාග ධනය, ප්‍රඥා ධනය. භික්ෂූණි, මේ ධනයන් සතයි.\n\nශ්‍රද්ධා ධනය, ශීල ධනය, හිරි ධනය, ඔතප් ධනය ද වේ. ශ්‍රැත ධනය ද, ත්‍යාග ධනය ද, ප්‍රඥාව නම් සත්වැනි ධනය යි.\n\nයම් ස්ත්‍රියකට හෝ පුරුෂයෙකුට හෝ මේ ධනයන් ඇත්තේ ද, ඔවුන් දරිද්‍රයෙක් නොවේ යැයි කියති. ඔහුගේ හෝ ඇයගේ ජීවිතය නිරර්ථක නොවේ.\n\nඑහෙයින් නුවණැත්තා බුදුවරුන්ගේ ශ්‍රේෂ්ඨ ශාසනය සිහි කරමින්, ශ්‍රද්ධාව ද, ශීලය ද, ධර්මය දැකීමෙන් ඇතිවන ප්‍රසාදය ද මැනවින් පුරුදු කළ යුතුය.",
      "paliTitle": "Saṃkhittadhanasuttaṃ"
    },
    {
      "number": 6,
      "pali": "‘‘Sattimāni, bhikkhave, dhanāni. Katamāni satta? Saddhādhanaṃ, sīladhanaṃ, hirīdhanaṃ, ottappadhanaṃ, sutadhanaṃ, cāgadhanaṃ, paññādhanaṃ. ‘‘Katamañca, bhikkhave, saddhādhanaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho…pe… buddho bhagavā’ti. Idaṃ vuccati, bhikkhave, saddhādhanaṃ. ‘‘Katamañca, bhikkhave, sīladhanaṃ? Idha, bhikkhave, ariyasāvako pāṇātipātā paṭivirato hoti… pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Idaṃ vuccati, bhikkhave, sīladhanaṃ. ‘‘Katamañca, bhikkhave, hirīdhanaṃ? Idha, bhikkhave, ariyasāvako hirīmā hoti, hirīyati kāyaduccaritena vacīduccaritena manoduccaritena, hirīyati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Idaṃ vuccati, bhikkhave, hirīdhanaṃ. ‘‘Katamañca, bhikkhave, ottappadhanaṃ? Idha, bhikkhave, ariyasāvako ottappī hoti, ottappati kāyaduccaritena vacīduccaritena manoduccaritena, ottappati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Idaṃ vuccati, bhikkhave, ottappadhanaṃ. ‘‘Katamañca, bhikkhave, sutadhanaṃ? Idha, bhikkhave, ariyasāvako bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti. Tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Idaṃ vuccati, bhikkhave, sutadhanaṃ. ‘‘Katamañca, bhikkhave, cāgadhanaṃ? Idha, bhikkhave, ariyasāvako vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato. Idaṃ vuccati, bhikkhave, cāgadhanaṃ. ‘‘Katamañca, bhikkhave, paññādhanaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti…pe… sammā dukkhakkhayagāminiyā. Idaṃ vuccati, bhikkhave, paññādhanaṃ. Imāni kho, bhikkhave, sattadhanānīti. ‘‘Saddhādhanaṃ sīladhanaṃ, hirī ottappiyaṃ dhanaṃ; Sutadhanañca cāgo ca, paññā ve sattamaṃ dhanaṃ. ‘‘Yassa ete dhanā atthi, itthiyā purisassa vā; Adaliddoti taṃ āhu, amoghaṃ tassa jīvitaṃ. ‘‘Tasmā saddhañca sīlañca, pasādaṃ dhammadassanaṃ; Anuyuñjetha medhāvī, saraṃ buddhāna sāsana’’nti. chaṭṭhaṃ;",
      "english": "Monks, there are these seven treasures. Which seven? The treasure of conviction, the treasure of moral discipline, the treasure of shame, the treasure of dread of wrongdoing, the treasure of learning, the treasure of generosity, and the treasure of wisdom.\n\nAnd what, monks, is the treasure of conviction? Here, monks, a noble disciple is convinced; they place their conviction in the Realized One’s awakening: ‘Indeed, the Blessed One is an Arahant, a Fully Self-awakened One, accomplished in knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Awakened One, the Blessed One.’ This, monks, is called the treasure of conviction.\n\nAnd what, monks, is the treasure of moral discipline? Here, monks, a noble disciple abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from wines, liquors, and intoxicants, which are the basis for heedlessness. This, monks, is called the treasure of moral discipline.\n\nAnd what, monks, is the treasure of shame? Here, monks, a noble disciple is ashamed; they are ashamed of misconduct by body, misconduct by speech, and misconduct by mind; they are ashamed of entering into evil, unwholesome qualities. This, monks, is called the treasure of shame.\n\nAnd what, monks, is the treasure of dread of wrongdoing? Here, monks, a noble disciple dreads wrongdoing; they dread misconduct by body, misconduct by speech, and misconduct by mind; they dread entering into evil, unwholesome qualities. This, monks, is called the treasure of dread of wrongdoing.\n\nAnd what, monks, is the treasure of learning? Here, monks, a noble disciple is widely learned, a retainer of what they have heard, one who accumulates what they have heard. These teachings, beautiful in the beginning, beautiful in the middle, beautiful in the end, with meaning and with expression, which proclaim the fully complete and purified holy life—such teachings they have heard much of, retained, recited verbally, pondered mentally, and thoroughly penetrated by discernment. This, monks, is called the treasure of learning.\n\nAnd what, monks, is the treasure of generosity? Here, monks, a noble disciple lives in a home with a mind devoid of the stain of stinginess, open-handed, clean-handed, delighting in relinquishing, responsive to requests, delighting in distributing gifts. This, monks, is called the treasure of generosity.\n\nAnd what, monks, is the treasure of wisdom? Here, monks, a noble disciple is wise; they are endowed with wisdom, endowed with wisdom that discerns rise and fall, noble and penetrative, leading to the complete destruction of suffering. This, monks, is called the treasure of wisdom. These, monks, are the seven treasures.\n\nThe treasure of conviction, the treasure of moral discipline, the treasure of shame, the treasure of dread of wrongdoing; the treasure of learning, and generosity, and wisdom, indeed, is the seventh treasure.\n\nWhoever, be it woman or man, possesses these treasures, they are called not poor; their life is fruitful.\n\nTherefore, the wise one, remembering the Buddhas' teaching, should apply themselves to conviction and moral discipline, to serene confidence and the vision of the Dhamma.",
      "sinhala": "මහණෙනි, මේ ධනයෝ සතෙකි. කවරහුද ඒ සත? ශ්‍රද්ධාව නම් ධනය, ශීලය නම් ධනය, හිරිය නම් ධනය, ඔතප්පය නම් ධනය, ශ්‍රැතය නම් ධනය, ත්‍යාගය නම් ධනය, ප්‍රඥාව නම් ධනය යන මේවාය.\n\nමහණෙනි, ශ්‍රද්ධාව නම් ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයෙක් ශ්‍රද්ධාවන්ත වේ. ඔහු ‘ඒ භාග්‍යවතුන් වහන්සේ අරහත්ය, සම්මාසම්බුද්ධය...පෙ... බුද්ධය, භාග්‍යවත්ය’ යනුවෙන් තථාගතයන් වහන්සේගේ බෝධිය විශ්වාස කරයි. මහණෙනි, මේ ශ්‍රද්ධාව නම් ධනය යැයි කියනු ලැබේ.\n\nමහණෙනි, ශීලය නම් ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයෙක් ප්‍රාණඝාතයෙන් වැළකුණේ වේ...පෙ... සුරාමේරය මජ්ජපමාදට්ඨානයෙන් වැළකුණේ වේ. මහණෙනි, මේ ශීලය නම් ධනය යැයි කියනු ලැබේ.\n\nමහණෙනි, හිරිය නම් ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයෙක් ලජ්ජාශීලී වේ. ඔහු කය දුසිරිතෙන්, වචී දුසිරිතෙන්, මනෝ දුසිරිතෙන් ලජ්ජා වෙයි. ඔහු පව්කාර අකුසල ධර්මයන්ට සමවැදීමෙන් ලජ්ජා වෙයි. මහණෙනි, මේ හිරිය නම් ධනය යැයි කියනු ලැබේ.\n\nමහණෙනි, ඔතප්පය නම් ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයෙක් පවට බිය වේ. ඔහු කය දුසිරිතෙන්, වචී දුසිරිතෙන්, මනෝ දුසිරිතෙන් බිය වෙයි. ඔහු පව්කාර අකුසල ධර්මයන්ට සමවැදීමෙන් බිය වෙයි. මහණෙනි, මේ ඔතප්පය නම් ධනය යැයි කියනු ලැබේ.\n\nමහණෙනි, ශ්‍රැතය නම් ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයෙක් බහුශ්‍රැත වේ. ඇසූ දේ දරාගෙන සිටින්නේ වේ. ඇසූ දේ රැස්කොට ඇත්තේ වේ. ආදියෙන් කල්‍යාණ වූ, මධ්‍යයෙන් කල්‍යාණ වූ, අවසානයෙන් කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන (අකුරු) සහිත වූ, මුළුල්ලෙන් පරිපූර්ණ වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන යම් ධර්ම කෙනෙක් ඇද්ද, ඔහුට එවැනි ධර්මයෝ බහුශ්‍රැත වෙති. දරාගෙන සිටින්නට වෙති. වචනයෙන් හුරුපුරුදු කරගත් ඒවා වෙති. මනසින් විමර්ශනය කළ ඒවා වෙති. දැක්මෙන් (ප්‍රඥාවෙන්) මනාව අවබෝධ කරගත් ඒවා වෙති. මහණෙනි, මේ ශ්‍රැතය නම් ධනය යැයි කියනු ලැබේ.\n\nමහණෙනි, ත්‍යාගය නම් ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයෙක් මසුරු මල පහකළ සිත් ඇතිව, ගිහි ගෙයි වාසය කරයි. ඔහු දෙනසුලුය, පිරිසිදු දෑත් ඇත්තේය, පරිත්‍යාගයෙහි ඇලුණේය, අයැදීම් වලට සුදුසුය, දන් බෙදා දීමෙහි ඇලුණේය. මහණෙනි, මේ ත්‍යාගය නම් ධනය යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රඥාව නම් ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයෙක් ප්‍රඥාවන්ත වේ...පෙ... උදයාස්තමය දකින, ආර්ය වූ, විනිවිද දකින, මනාකොට දුක් කෙළවර කිරීම පිණිස යන ප්‍රඥාවෙන් යුක්ත වේ. මහණෙනි, මේ ප්‍රඥාව නම් ධනය යැයි කියනු ලැබේ. මහණෙනි, මේ සප්ත ධනයෝය.\n\nශ්‍රද්ධාව නම් ධනයත්, ශීලය නම් ධනයත්,\nහිරියත්, ඔතප්පයත් ධනයකි.\nශ්‍රැතය නම් ධනයත්, ත්‍යාගයත්,\nප්‍රඥාව නම් සත්වෙනි ධනයත් වේ.\nයම් ස්ත්‍රියකට හෝ පුරුෂයෙකුට මේ ධනයෝ ඇත්තාහුද,\nඔහුව 'නොදරිද්‍රයෙක්ය' යි කියති. ඔහුගේ ජීවිතය නිෂ්ඵල නොවන්නේය.\nඑබැවින් නුවණැත්තා, බුදුවරුන්ගේ ශාසනය සිහිකරමින්,\nශ්‍රද්ධාව, ශීලය, පැහැදීම, ධර්මය දැකීම යන මේවාට නොකඩවා යුක්ත විය යුතුය.",
      "paliTitle": "Vitthatadhanasuttaṃ"
    },
    {
      "number": 7,
      "pali": "Atha kho uggo rājamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uggo rājamahāmatto bhagavantaṃ etadavoca – ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāva aḍḍho cāyaṃ, bhante, migāro rohaṇeyyo yāva mahaddhano yāva mahābhogo’’ti. ‘‘Kīva aḍḍho panugga, migāro rohaṇeyyo, kīva mahaddhano, kīva mahābhogo’’ti? ‘‘Sataṃ, bhante, satasahassānaṃ [sahassānaṃ (sī.), sahassāni (syā.), satasahassāni (?)] hiraññassa, ko pana vādo rūpiyassā’’ti! ‘‘Atthi kho etaṃ, ugga, dhanaṃ netaṃ ‘natthī’ti vadāmīti. Tañca kho etaṃ, ugga, dhanaṃ sādhāraṇaṃ agginā udakena rājūhi corehi appiyehi dāyādehi. Satta kho imāni, ugga, dhanāni asādhāraṇāni agginā udakena rājūhi corehi appiyehi dāyādehi. Katamāni satta? Saddhādhanaṃ, sīladhanaṃ, hirīdhanaṃ, ottappadhanaṃ, sutadhanaṃ, cāgadhanaṃ, paññādhanaṃ. Imāni kho, ugga, satta dhanāni asādhāraṇāni agginā udakena rājūhi corehi appiyehi dāyādehīti. ‘‘Saddhādhanaṃ sīladhanaṃ, hirī ottappiyaṃ dhanaṃ; Sutadhanañca cāgo ca, paññā ve sattamaṃ dhanaṃ. ‘‘Yassa ete dhanā atthi, itthiyā purisassa vā; Sa ve mahaddhano loke, ajeyyo devamānuse. ‘‘Tasmā saddhañca sīlañca, pasādaṃ dhammadassanaṃ; Anuyuñjetha medhāvī, saraṃ buddhāna sāsana’’nti. sattamaṃ;",
      "english": "Then, the royal chief minister Ugga approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, Ugga, the royal chief minister, said this to the Blessed One: \"It is wonderful, venerable sir, it is amazing, venerable sir! How very wealthy, venerable sir, is Migāra Rohaṇeyya, how great are his riches, how vast are his possessions!\"\n\n\"How wealthy, Ugga, is Migāra Rohaṇeyya? How great are his riches, how vast are his possessions?\" \"He possesses a hundred hundred-thousands of gold, venerable sir—what need is there to speak of silver!\"\n\n\"Indeed, Ugga, this wealth exists; I do not say that it does not exist. However, Ugga, this wealth is shared with fire, water, kings, thieves, and hostile inheritors. But there are these seven kinds of wealth, Ugga, which are not shared with fire, water, kings, thieves, or hostile inheritors. Which seven? They are the wealth of faith, the wealth of moral discipline, the wealth of moral shame, the wealth of moral dread, the wealth of learning, the wealth of generosity, and the wealth of wisdom. These, Ugga, are the seven kinds of wealth that are not shared with fire, water, kings, thieves, or hostile inheritors.\"\n\nThe wealth of faith, the wealth of moral discipline,\nThe wealth of moral shame, the wealth of moral dread,\nThe wealth of learning and generosity,\nWisdom indeed is the seventh wealth.\n\nFor whoever possesses these kinds of wealth,\nWhether a woman or a man,\nThat one is truly very wealthy in the world,\nUnconquerable by gods and humans.\n\nTherefore, the wise person,\nRemembering the teaching of the Buddhas,\nShould constantly cultivate faith, moral discipline,\nSerene confidence, and the realization of the Dhamma.",
      "sinhala": "ඉන්පසු උග්ග නම් රාජමහාමාත්‍යයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි උග්ග රාජමහාමාත්‍යයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"අසිරිමත් ය, ස්වාමීනි, පුදුම සහගත ය, ස්වාමීනි! මේ මිගාර රෝහණෙය්‍ය කෙතරම් නම් ධනවත් ද, කෙතරම් නම් මහා ධනයක් ඇත්තෙක් ද, කෙතරම් නම් මහා භෝග සම්පත්තියක් ඇත්තෙක් ද!\"\n\n\"උග්ග, මිගාර රෝහණෙය්‍ය කෙතරම් ධනවත් ද? කෙතරම් මහා ධනයක් ඇත්තෙක් ද? කෙතරම් මහා භෝග සම්පත්තියක් ඇත්තෙක් ද?\"\n\n\"ස්වාමීනි, (ඔහුට) රන් කෝටියක් ඇත. රිදී ගැන කුමන කතා ද!\"\n\n\"උග්ග, මේ ධනය ඇත්තේමය, එය 'නැත' යැයි මම නොකියමි. එහෙත් උග්ග, මේ ධනය ගින්න, ජලය, රජවරුන්, සොරුන් සහ අප්‍රිය වූ උරුමක්කරුවන් සමඟ පොදු වූවකි. උග්ග, මේ ධන හතක් ඇත, ඒවා ගින්නෙන්, ජලයෙන්, රජවරුන්ගෙන්, සොරුන්ගෙන් සහ අප්‍රිය වූ උරුමක්කරුවන්ගෙන් විනාශ නොවන දේ ය. ඒ හත කවරේද? ශ්‍රද්ධාධනය, සීලධනය, හිරිධනය, ඔත්තප්පධනය, සුතධනය, ත්‍යාගධනය, ප්‍රඥාධනය. උග්ග, මේ ධන හත ගින්නෙන්, ජලයෙන්, රජවරුන්ගෙන්, සොරුන්ගෙන් සහ අප්‍රිය වූ උරුමක්කරුවන්ගෙන් විනාශ නොවන දේ ය.\"\n\nශ්‍රද්ධාධනය ද, සීලධනය ද,\nහිරි සහ ඔත්තප්පය ද ධනය වේ.\nසුතධනය ද, ත්‍යාගය ද,\nප්‍රඥාව සත්වන ධනය යි.\n\nයම් ස්ත්‍රියකට හෝ පුරුෂයෙකුට\nමේ ධන සම්පත් ඇත්නම්,\nඒ තැනැත්තා ලොව මහා ධනවතෙක් වේ,\nදෙවියන් අතර හෝ මිනිසුන් අතර පරාජය කළ නොහැක්කෙක් වේ.\n\nඑහෙයින් නුවණැති පුද්ගලයා,\nබුදුවරුන්ගේ ශාසනය සිහි කරමින්,\nශ්‍රද්ධාව ද, සීලය ද,\n(ත්‍රිවිධ රත්නය පිළිබඳ) පැහැදීම ද, ධර්මය අවබෝධ කිරීම ද නිතරම පුරුදු කළ යුතු ය.",
      "paliTitle": "Uggasuttaṃ"
    },
    {
      "number": 8,
      "pali": "‘‘Sattimāni, bhikkhave, saṃyojanāni. Katamāni satta? Anunayasaṃyojanaṃ, paṭighasaṃyojanaṃ, diṭṭhisaṃyojanaṃ, vicikicchāsaṃyojanaṃ, mānasaṃyojanaṃ, bhavarāgasaṃyojanaṃ, avijjāsaṃyojanaṃ. Imāni kho, bhikkhave, satta saṃyojanānī’’ti. Aṭṭhamaṃ.",
      "english": "Bhikkhus, there are these seven fetters. Which seven? The fetter of sensual passion, the fetter of aversion, the fetter of wrong views, the fetter of doubt, the fetter of conceit, the fetter of passion for existence, and the fetter of ignorance. These, bhikkhus, are the seven fetters.",
      "sinhala": "භික්ෂූණි, මේ සංයෝජන හතකි. ඒ කවර හතක්ද යත්: අනුනය සංයෝජනය, පටිඝ සංයෝජනය, දිට්ඨි සංයෝජනය, විචිකිච්ඡා සංයෝජනය, මාන සංයෝජනය, භවරාග සංයෝජනය, අවිජ්ජා සංයෝජනය යි. භික්ෂූණි, මේ සංයෝජන හතයි. අටවැන්න.",
      "paliTitle": "Saṃyojanasuttaṃ"
    },
    {
      "number": 9,
      "pali": "‘‘Sattannaṃ, bhikkhave, saṃyojanānaṃ pahānāya samucchedāya brahmacariyaṃ vussati. Katamesaṃ sattannaṃ? Anunayasaṃyojanassa pahānāya samucchedāya brahmacariyaṃ vussati, paṭighasaṃyojanassa…pe… diṭṭhisaṃyojanassa… vicikicchāsaṃyojanassa… mānasaṃyojanassa… bhavarāgasaṃyojanassa … avijjāsaṃyojanassa pahānāya samucchedāya brahmacariyaṃ vussati. Imesaṃ kho, bhikkhave, sattannaṃ saṃyojanānaṃ pahānāya samucchedāya brahmacariyaṃ vussati. Yato ca kho, bhikkhave, bhikkhuno anunayasaṃyojanaṃ pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃ kataṃ āyatiṃ anuppādadhammaṃ. Paṭighasaṃyojanaṃ…pe… diṭṭhisaṃyojanaṃ… vicikicchāsaṃyojanaṃ… mānasaṃyojanaṃ… bhavarāgasaṃyojanaṃ… avijjāsaṃyojanaṃ pahīnaṃ hoti ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃ kataṃ āyatiṃ anuppādadhammaṃ. Ayaṃ vuccati, bhikkhave, bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’ti. Navamaṃ.",
      "english": "Monks, the holy life is lived for the abandonment and uprooting of seven fetters. Which seven? The holy life is lived for the abandonment and uprooting of the fetter of attachment, for the abandonment and uprooting of the fetter of aversion, for the abandonment and uprooting of the fetter of wrong views, for the abandonment and uprooting of the fetter of doubt, for the abandonment and uprooting of the fetter of conceit, for the abandonment and uprooting of the fetter of craving for existence, and for the abandonment and uprooting of the fetter of ignorance. Indeed, monks, it is for the abandonment and uprooting of these seven fetters that the holy life is lived.\n\nBut when, monks, for a bhikkhu, the fetter of attachment is abandoned, its root severed, made like a palm-stump, brought to non-existence, no longer liable to arise in the future; and the fetter of aversion is abandoned, its root severed, made like a palm-stump, brought to non-existence, no longer liable to arise in the future; and the fetter of wrong views is abandoned, its root severed, made like a palm-stump, brought to non-existence, no longer liable to arise in the future; and the fetter of doubt is abandoned, its root severed, made like a palm-stump, brought to non-existence, no longer liable to arise in the future; and the fetter of conceit is abandoned, its root severed, made like a palm-stump, brought to non-existence, no longer liable to arise in the future; and the fetter of craving for existence is abandoned, its root severed, made like a palm-stump, brought to non-existence, no longer liable to arise in the future; and the fetter of ignorance is abandoned, its root severed, made like a palm-stump, brought to non-existence, no longer liable to arise in the future — this bhikkhu, monks, is said to have cut off craving, to have unwound the fetter, and by rightly comprehending conceit, has made an end of suffering.",
      "sinhala": "මහණෙනි, සංයෝජන හතක් ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ.\n\nඒ සංයෝජන හත කවරේද? අනුනය සංයෝජනය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ. පටිඝ සංයෝජනය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ. දිට්ඨි සංයෝජනය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ. විචිකිච්ඡා සංයෝජනය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ. මාන සංයෝජනය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ. භවරාග සංයෝජනය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ. අවිද්‍යා සංයෝජනය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ.\n\nමහණෙනි, මේ සංයෝජන හත ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචරියාව පවත්වනු ලැබේ.\n\nමහණෙනි, යම් භික්ෂුවකට අනුනය සංයෝජනය ප්‍රහීණ වී, මුලිනුපුටා දමා, තල් ගසක් මුලින් සිඳ දැමුවා සේ (නැවත නොයෙදෙන සේ) කරන ලද, නූපදින සුළු ස්වභාවයට පත් කරන ලද, අනාගතයේ යළි නූපදින සුළු ස්වභාවයට පත් වූයේද; පටිඝ සංයෝජනය ප්‍රහීණ වී, මුලිනුපුටා දමා, තල් ගසක් මුලින් සිඳ දැමුවා සේ (නැවත නොයෙදෙන සේ) කරන ලද, නූපදින සුළු ස්වභාවයට පත් කරන ලද, අනාගතයේ යළි නූපදින සුළු ස්වභාවයට පත් වූයේද; දිට්ඨි සංයෝජනය ප්‍රහීණ වී, මුලිනුපුටා දමා, තල් ගසක් මුලින් සිඳ දැමුවා සේ (නැවත නොයෙදෙන සේ) කරන ලද, නූපදින සුළු ස්වභාවයට පත් කරන ලද, අනාගතයේ යළි නූපදින සුළු ස්වභාවයට පත් වූයේද; විචිකිච්ඡා සංයෝජනය ප්‍රහීණ වී, මුලිනුපුටා දමා, තල් ගසක් මුලින් සිඳ දැමුවා සේ (නැවත නොයෙදෙන සේ) කරන ලද, නූපදින සුළු ස්වභාවයට පත් කරන ලද, අනාගතයේ යළි නූපදින සුළු ස්වභාවයට පත් වූයේද; මාන සංයෝජනය ප්‍රහීණ වී, මුලිනුපුටා දමා, තල් ගසක් මුලින් සිඳ දැමුවා සේ (නැවත නොයෙදෙන සේ) කරන ලද, නූපදින සුළු ස්වභාවයට පත් කරන ලද, අනාගතයේ යළි නූපදින සුළු ස්වභාවයට පත් වූයේද; භවරාග සංයෝජනය ප්‍රහීණ වී, මුලිනුපුටා දමා, තල් ගසක් මුලින් සිඳ දැමුවා සේ (නැවත නොයෙදෙන සේ) කරන ලද, නූපදින සුළු ස්වභාවයට පත් කරන ලද, අනාගතයේ යළි නූපදින සුළු ස්වභාවයට පත් වූයේද; අවිද්‍යා සංයෝජනය ප්‍රහීණ වී, මුලිනුපුටා දමා, තල් ගසක් මුලින් සිඳ දැමුවා සේ (නැවත නොයෙදෙන සේ) කරන ලද, නූපදින සුළු ස්වභාවයට පත් කරන ලද, අනාගතයේ යළි නූපදින සුළු ස්වභාවයට පත් වූයේද,\n\nමහණෙනි, මේ භික්ෂුව තෘෂ්ණාව සිඳ දැමූ, සංයෝජන ලිහා දැමූ, මැනවින් මානය ප්‍රහීණ කිරීමෙන් දුක කෙළවර කළ අයෙකු ලෙස කියනු ලැබේ.",
      "paliTitle": "Pahānasuttaṃ"
    },
    {
      "number": 10,
      "pali": "‘‘Sattimāni, bhikkhave, saṃyojanāni. Katamāni satta? Anunayasaṃyojanaṃ, paṭighasaṃyojanaṃ, diṭṭhisaṃyojanaṃ, vicikicchāsaṃyojanaṃ, mānasaṃyojanaṃ, issāsaṃyojanaṃ, macchariyasaṃyojanaṃ. Imāni kho, bhikkhave, satta saṃyojanānī’’ti. Dasamaṃ. ",
      "english": "Monks, there are these seven fetters. Which seven? The fetter of attachment, the fetter of aversion, the fetter of wrong view, the fetter of doubt, the fetter of conceit, the fetter of envy, and the fetter of stinginess. These, monks, are indeed the seven fetters.",
      "sinhala": "භික්ෂූනි, මේ සංයෝජන හතක් ඇත.\n\nකවරක්ද ඒ හත?\n\nඅනුනය සංයෝජනය, පටිඝ සංයෝජනය, දිට්ඨි සංයෝජනය, විචිකිච්ඡා සංයෝජනය, මාන සංයෝජනය, ඉස්සා සංයෝජනය, මච්ඡරිය සංයෝජනය යන මේවාය.\n\nභික්ෂූනි, මේවාමයි ඒ සත් සංයෝජනයෝ.",
      "paliTitle": "Macchariyasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Dhanavaggo paṭhamo. Tassuddānaṃ – Dve piyāni balaṃ dhanaṃ, saṃkhittañceva vitthataṃ; Uggaṃ saṃyojanañceva, pahānaṃ macchariyena cāti.",
    "english": "",
    "sinhala": ""
  }
}