{
  "id": "an7.10",
  "title": {
    "pali": "Āhuneyyavaggo",
    "english": "The Chapter on Those Worthy of Offerings",
    "sinhala": "ආහුනෙය්‍යවග්ගෝ"
  },
  "sections": [
    {
      "number": 95,
      "pali": "‘‘Sattime, bhikkhave, puggalā āhuneyyā…pe… dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa. Katame satta? Idha, bhikkhave, ekacco puggalo cakkhusmiṃ aniccānupassī viharati aniccasaññī aniccapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. So āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ kho, bhikkhave, paṭhamo puggalo āhuneyyo pāhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo cakkhusmiṃ aniccānupassī viharati aniccasaññī aniccapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. Tassa apubbaṃ acarimaṃ āsavapariyādānañca hoti jīvitapariyādānañca. Ayaṃ, bhikkhave, dutiyo puggalo āhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo cakkhusmiṃ aniccānupassī viharati aniccasaññī aniccapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti…pe… upahaccaparinibbāyī hoti…pe… asaṅkhāraparinibbāyī hoti…pe… sasaṅkhāraparinibbāyī hoti…pe… uddhaṃsoto hoti akaniṭṭhagāmī. Ayaṃ, bhikkhave, sattamo puggalo āhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. Ime kho, bhikkhave, satta puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassā’’ti.",
      "english": "“Monks, these seven individuals are worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world. Which seven?\n\n“Here, monks, a certain individual dwells perceiving impermanence in the eye, perceiving impermanence, experiencing impermanence, constantly, continuously, with an uninterrupted mind resolving upon it, penetrating it deeply with wisdom. He, through the destruction of the taints, having realized for himself with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, attains and dwells in it. This, monks, is the first individual worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.\n\n“Furthermore, monks, here a certain individual dwells perceiving impermanence in the eye, perceiving impermanence, experiencing impermanence, constantly, continuously, with an uninterrupted mind resolving upon it, penetrating it deeply with wisdom. For him, the destruction of the taints and the cessation of life occur simultaneously. This, monks, is the second individual worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.\n\n“Furthermore, monks, here a certain individual dwells perceiving impermanence in the eye, perceiving impermanence, experiencing impermanence, constantly, continuously, with an uninterrupted mind resolving upon it, penetrating it deeply with wisdom. He, through the destruction of the five lower fetters, becomes one who attains Nibbāna in the interim (between worlds); or he becomes one who attains Nibbāna upon striking (a new existence); or he becomes one who attains Nibbāna without exertion; or he becomes one who attains Nibbāna with exertion; or he becomes one whose stream flows upwards, bound for the Akanittha realm. This, monks, is the seventh individual worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.\n\n“These, monks, are the seven individuals worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.”",
      "sinhala": "‘‘භික්ෂූනි, මේ සත් පුද්ගලයෝ ආහුණෙය්‍ය (පූජාවන්ට සුදුසු), පාහුණෙය්‍ය (ආගන්තුක සත්කාරයට සුදුසු), දක්ඛිණෙය්‍ය (දක්ෂිණාවන්ට සුදුසු), අඤ්ජලිකරණීය (දෝත මුදුන් තබා වැඳීමට සුදුසු) වූ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වෙති. කවරහුද ඒ සත් දෙනා? භික්ෂූනි, මෙහිලා යම්කිසි පුද්ගලයෙක් ඇසෙහි අනිත්‍ය වශයෙන් අනුව බලා වාසය කරයි. ඔහු අනිත්‍යය පිළිබඳ සංඥාව ඇතිව, අනිත්‍යය ප්‍රත්‍යවේක්ෂා කරනසුලුව, නිරන්තරයෙන්ම, නොනැවතී, ඡේදයකින් තොරව සිතින් අධිමුක්ත වෙමින්, ප්‍රඥාවෙන් ගැඹුරට විමසමින් වාසය කරයි. ඔහු ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැමුණු ධර්මයෙහිම (මේ ජීවිතයෙහිම) තමා විසින්ම අභිඥා ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, එය ලබා වාසය කරයි. භික්ෂූනි, මේ පළමු වන පුද්ගලයා ආහුණෙය්‍ය, පාහුණෙය්‍ය...පෙ...ලෝකයාට අනුත්තර වූ පින් කෙතක් වෙයි.\n\nතවද භික්ෂූනි, මෙහිලා යම්කිසි පුද්ගලයෙක් ඇසෙහි අනිත්‍ය වශයෙන් අනුව බලා වාසය කරයි. ඔහු අනිත්‍යය පිළිබඳ සංඥාව ඇතිව, අනිත්‍යය ප්‍රත්‍යවේක්ෂා කරනසුලුව, නිරන්තරයෙන්ම, නොනැවතී, ඡේදයකින් තොරව සිතින් අධිමුක්ත වෙමින්, ප්‍රඥාවෙන් ගැඹුරට විමසමින් වාසය කරයි. ඔහුට ආශ්‍රවයන්ගේ ක්ෂය වීමද, ජීවිතයේ කෙළවරද එකවර සිදුවේ. භික්ෂූනි, මේ දෙවැනි පුද්ගලයා ආහුණෙය්‍ය...පෙ...ලෝකයාට අනුත්තර වූ පින් කෙතක් වෙයි.\n\nතවද භික්ෂූනි, මෙහිලා යම්කිසි පුද්ගලයෙක් ඇසෙහි අනිත්‍ය වශයෙන් අනුව බලා වාසය කරයි. ඔහු අනිත්‍යය පිළිබඳ සංඥාව ඇතිව, අනිත්‍යය ප්‍රත්‍යවේක්ෂා කරනසුලුව, නිරන්තරයෙන්ම, නොනැවතී, ඡේදයකින් තොරව සිතින් අධිමුක්ත වෙමින්, ප්‍රඥාවෙන් ගැඹුරට විමසමින් වාසය කරයි. ඔහු පංච ඕරම්භාගීය සංයෝජන ක්ෂය කිරීමෙන් අන්තරාපරිනිර්වාණී වෙයි...පෙ...උපහච්චපරිනිර්වාණී වෙයි...පෙ...අසංඛාරපරිනිර්වාණී වෙයි...පෙ...සසංඛාරපරිනිර්වාණී වෙයි...පෙ...ඌර්ධ්වශ්‍රෝතස්වී (උඩුගං බලා යන සුළු) වී අකනිට්ඨ භවයට යන්නේ වෙයි. භික්ෂූනි, මේ සත්වන පුද්ගලයා ආහුණෙය්‍ය...පෙ...ලෝකයාට අනුත්තර වූ පින් කෙතක් වෙයි. භික්ෂූනි, මේ සත් පුද්ගලයෝ ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වෙති.",
      "paliTitle": ""
    },
    {
      "number": 96,
      "numberRange": "96-622",
      "pali": "Sattime, bhikkhave, puggalā āhuneyyā pāhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassa. Katame satta? Idha, bhikkhave, ekacco puggalo cakkhusmiṃ dukkhānupassī viharati…pe… cakkhusmiṃ anattānupassī viharati…pe… cakkhusmiṃ khayānupassī viharati…pe… cakkhusmiṃ vayānupassī viharati…pe… cakkhusmiṃ virāgānupassī viharati…pe… cakkhusmiṃ nirodhānupassī viharati…pe… cakkhusmiṃ paṭinissaggānupassī viharati…pe…. Sotasmiṃ…pe… ghānasmiṃ… jivhāya… kāyasmiṃ… manasmiṃ…pe…. Rūpesu…pe… saddesu… gandhesu… rasesu… phoṭṭhabbesu … dhammesu …pe…. Cakkhuviññāṇe…pe… sotaviññāṇe… ghānaviññāṇe… jivhāviññāṇe… kāyaviññāṇe… manoviññāṇe…pe…. Cakkhusamphasse…pe… sotasamphasse… ghānasamphasse… jivhāsamphasse… kāyasamphasse… manosamphasse…pe…. Cakkhusamphassajāya vedanāya…pe… sotasamphassajāya vedanāya… ghānasamphassajāya vedanāya… jivhāsamphassajāya vedanāya… kāyasamphassajāya vedanāya… manosamphassajāya vedanāya…pe…. Rūpasaññāya…pe… saddasaññāya… gandhasaññāya… rasasaññāya… phoṭṭhabbasaññāya… dhammasaññāya…pe…. Rūpasañcetanāya…pe… saddasañcetanāya… gandhasañcetanāya… rasasañcetanāya… phoṭṭhabbasañcetanāya… dhammasañcetanāya…pe…. Rūpataṇhāya…pe… saddataṇhāya… gandhataṇhāya… rasataṇhāya… phoṭṭhabbataṇhāya… dhammataṇhāya…pe…. Rūpavitakke …pe… saddavitakke… gandhavitakke… rasavitakke… phoṭṭhabbavitakke… dhammavitakke…pe…. Rūpavicāre…pe… saddavicāre… gandhavicāre… rasavicāre… phoṭṭhabbavicāre… dhammavicāre…pe…. ‘‘Pañcakkhandhe [( ) sī. syā. potthakesu natthi] …pe… rūpakkhandhe… vedanākkhandhe… saññākkhandhe… saṅkhārakkhandhe… viññāṇakkhandhe aniccānupassī viharati…pe… dukkhānupassī viharati… anattānupassī viharati… khayānupassī viharati… vayānupassī viharati… virāgānupassī viharati… nirodhānupassī viharati… paṭinissaggānupassī viharati…pe… lokassā’’ti. ‘‘Chadvārārammaṇesvettha, viññāṇesu ca phassesu; Vedanāsu ca dvārassa, suttā honti visuṃ aṭṭha. ‘‘Saññā sañcetanā taṇhā, vitakkesu vicāre ca; Gocarassa visuṃ aṭṭha, pañcakkhandhe ca pacceke. ‘‘Soḷasasvettha mūlesu, aniccaṃ dukkhamanattā; Khayā vayā virāgā ca, nirodhā paṭinissaggā. ‘‘Kamaṃ aṭṭhānupassanā, yojetvāna visuṃ visuṃ; Sampiṇḍitesu sabbesu, honti pañca satāni ca; Aṭṭhavīsati suttāni, āhuneyye ca vaggike’’ [imā uddānagāthāyo sī. syā. potthakesu natthi]. ",
      "english": "Bhikkhus, these seven individuals are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world. Which seven? Here, bhikkhus, a certain individual dwells contemplating suffering in the eye, contemplating non-self in the eye, contemplating destruction in the eye, contemplating dissolution in the eye, contemplating dispassion in the eye, contemplating cessation in the eye, and contemplating relinquishment in the eye. Similarly, one dwells contemplating these same eight aspects in the ear, in the nose, in the tongue, in the body, and in the mind.\n\nFurthermore, one dwells contemplating these same eight aspects in forms, and similarly for sounds, odors, tastes, tactile sensations, and mind-objects. One dwells contemplating these same eight aspects in eye-consciousness, and similarly for ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, and mind-consciousness. One dwells contemplating these same eight aspects in eye-contact, and similarly for ear-contact, nose-contact, tongue-contact, body-contact, and mind-contact. One dwells contemplating these same eight aspects in feelings arisen from eye-contact, and similarly for feelings arisen from ear-contact, from nose-contact, from tongue-contact, from body-contact, and from mind-contact.\n\nOne dwells contemplating these same eight aspects in perceptions of forms, and similarly for perceptions of sounds, odors, tastes, tactile sensations, and mind-objects. One dwells contemplating these same eight aspects in volitions regarding forms, and similarly for volitions regarding sounds, odors, tastes, tactile sensations, and mind-objects. One dwells contemplating these same eight aspects in craving for forms, and similarly for craving for sounds, odors, tastes, tactile sensations, and mind-objects. One dwells contemplating these same eight aspects in initial applications of thought regarding forms, and similarly for initial applications of thought regarding sounds, odors, tastes, tactile sensations, and mind-objects. One dwells contemplating these same eight aspects in sustained applications of thought regarding forms, and similarly for sustained applications of thought regarding sounds, odors, tastes, tactile sensations, and mind-objects.\n\nFinally, one dwells contemplating impermanence in the form aggregate, the feeling aggregate, the perception aggregate, the volitional formations aggregate, and the consciousness aggregate. One also dwells contemplating suffering, non-self, destruction, dissolution, dispassion, cessation, and relinquishment in each of these five aggregates, thus becoming an unsurpassed field of merit for the world.\n\nHere, in the six sense-doors and their objects, in consciousnesses and contacts, and in the feelings of the doors, there are distinctly eight contemplations.\n\nIn perceptions, volitions, craving, and in initial and sustained applications of thought, each of these domains has distinctly eight contemplations, as does each of the five aggregates.\n\nIn these sixteen foundations, there are impermanence, suffering, and non-self; and destruction, dissolution, dispassion, cessation, and relinquishment.\n\nWhen the eight contemplations are applied to each one distinctly in due order, all combined amount to five hundred and twenty-eight suttas in this division concerning those worthy of offerings.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සත් දෙන ආහුණෙය්‍ය (දුර සිට ගෙනෙන දානයට සුදුසු) වෙති, පාහුණෙය්‍ය (ආගන්තුක සත්කාරයට සුදුසු) වෙති, ලෝකයාට අනුත්තර වූ පුණ්‍යU+200D ක්ෂේත්‍රයෝ වෙති. කවර සත් දෙනෙක් ද?\n\nමහණෙනි, මෙහිලා යම් එක්තරා පුද්ගලයෙක් ඇසෙහි දුක්ඛ වශයෙන් අනුපස්සනා කරමින් වාසය කරයි; (තවත් එක්තරා පුද්ගලයෙක්) ඇසෙහි අනාත්ම වශයෙන් අනුපස්සනා කරමින් වාසය කරයි; (තවත් එක්තරා පුද්ගලයෙක්) ඇසෙහි ක්ෂය වශයෙන් අනුපස්සනා කරමින් වාසය කරයි; (තවත් එක්තරා පුද්ගලයෙක්) ඇසෙහි විය වශයෙන් අනුපස්සනා කරමින් වාසය කරයි; (තවත් එක්තරා පුද්ගලයෙක්) ඇසෙහි විරාග වශයෙන් අනුපස්සනා කරමින් වාසය කරයි; (තවත් එක්තරා පුද්ගලයෙක්) ඇසෙහි නිරෝධ වශයෙන් අනුපස්සනා කරමින් වාසය කරයි; (තවත් එක්තරා පුද්ගල​යෙක්) ඇසෙහි ප්‍රතිනිස්සර්ග වශයෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nඑලෙසම, කණෙහි ද, නාසයෙහි ද, දිවෙහි ද, කයෙහි ද, මනසෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nරූපයන්හි ද, ශබ්දයන්හි ද, ගඳයන්හි ද, රසයන්හි ද, ස්පර්ශයන්හි ද, ධර්මයන්හි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nචක්ඛුU+200D විඤ්ඤාණයෙහි ද, සෝත විඤ්ඤාණයෙහි ද, ඝාන විඤ්ඤාණයෙහි ද, ජිව්හා විඤ්ඤාණයෙහි ද, කාය විඤ්ඤාණයෙහි ද, මනෝ විඤ්ඤාණයෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nචක්ඛුU+200D ස්පර්ශයෙහි ද, සෝත ස්පර්ශයෙහි ද, ඝාන ස්පර්ශයෙහි ද, ජිව්හා ස්පර්ශයෙහි ද, කාය ස්පර්ශයෙහි ද, මනෝ ස්පර්ශයෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nචක්ඛුU+200D ස්පර්ශයෙන් හටගත් වේදනාවෙහි ද, සෝත ස්පර්ශයෙන් හටගත් වේදනාවෙහි ද, ඝාන ස්පර්ශයෙන් හටගත් වේදනාවෙහි ද, ජිව්හා ස්පර්ශයෙන් හටගත් වේදනාවෙහි ද, කාය ස්පර්ශයෙන් හටගත් වේදනාවෙහි ද, මනෝ ස්පර්ශයෙන් හටගත් වේදනාවෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nරූප සංඥාවෙහි ද, ශබ්ද සංඥාවෙහි ද, ගඳ සංඥාවෙහි ද, රස සංඥාවෙහි ද, ස්පර්ශ සංඥාවෙහි ද, ධර්ම සංඥාවෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nරූප සංචේතනාවෙහි ද, ශබ්ද සංචේතනාවෙහි ද, ගඳ සංචේතනාවෙහි ද, රස සංචේතනාවෙහි ද, ස්පර්ශ සංචේතනාවෙහි ද, ධර්ම සංචේතනාවෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nරූප තණ්හාවෙහි ද, ශබ්ද තණ්හාවෙහි ද, ගඳ තණ්හාවෙහි ද, රස තණ්හාවෙහි ද, ස්පර්ශ තණ්හාවෙහි ද, ධර්ම තණ්හාවෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nරූප විතර්කයෙහි ද, ශබ්ද විතර්කයෙහි ද, ගඳ විතර්කයෙහි ද, රස විතර්කයෙහි ද, ස්පර්ශ විතර්කයෙහි ද, ධර්ම විතර්කයෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nරූප විචාරයෙහි ද, ශබ්ද විචාරයෙහි ද, ගඳ විචාරයෙහි ද, රස විචාරයෙහි ද, ස්පර්ශ විචාරයෙහි ද, ධර්ම විචාරයෙහි ද (ඔවුන් දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන) මේ සත් අනුපස්සනාවන්ගෙන් අනුපස්සනා කරමින් වාසය කරයි.\n\nපංචස්කන්ධයන්හි ද, එනම් රූපස්කන්ධයෙහි ද, වේදනාස්කන්ධයෙහි ද, සංඥාස්කන්ධයෙහි ද, සංස්කාරස්කන්ධයෙහි ද, විඤ්ඤාණස්කන්ධයෙහි ද, අනිත්‍ය, දුක්ඛ, අනාත්ම, ක්ෂය, විය, විරාග, නිරෝධ, ප්‍රතිනිස්සර්ග යන මේ අනුපස්සනා අටින් අනුපස්සනා කරමින් වාසය කරයි.\n\n(සංක්ෂේප ගාථා:)\nමෙහිලා සය වැදෑරුම් ද්වාරයන්හි ද, ආරම්මණයන්හි ද, විඤ්ඤාණයන්හි ද, ස්පර්ශයන්හි ද, ද්වාරයෙන් හටගත් වේදනාවන්හි ද, (එකිනෙකට) අට බැගින් සූත්‍ර (මාර්ග) වෙත්. සංඥාවන්හි ද, සංචේතනාවන්හි ද, තණ්හාවන්හි ද, විතර්කයන්හි ද, විචාරයන්හි ද, ගෝචර වශයෙන් (එකිනෙකට) අට බැගින් (සූත්‍ර වෙත්); පංචස්කන්ධයන්හි ද ඒ ඒ අයුරින් (අට බැගින් වෙත්). මෙහිලා සොළොස් මූලයන්හි (යෙදෙන) අනිත්‍ය, දුක්ඛ, අනාත්ම; ක්ෂය, විය, විරාග, නිරෝධ, සහ ප්‍රතිනිස්සර්ග යන අනුපස්සනා (අට වෙත්). පිළිවෙලින් අනුපස්සනා අට එකිනෙකට යොදවා, සියල්ල සම්පිණ්ඩනය කළ කල්හි, ආහුණෙය්‍ය වර්ගයෙහි සූත්‍ර පන්සිය විසි අටක් වෙති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Āhuneyyavaggo dasamo.",
    "english": "",
    "sinhala": ""
  }
}