{
  "id": "an7.11",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Repetition Formula on Lustful Attachment.",
    "sinhala": "රාග පේයාලය"
  },
  "sections": [
    {
      "number": 623,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya satta dhammā bhāvetabbā. Katame satta? Satisambojjhaṅgo…pe… upekkhāsambojjhaṅgo – rāgassa, bhikkhave, abhiññāya ime satta dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct comprehension of passion, seven qualities should be cultivated. Which seven? Mindfulness as a factor of awakening, investigation of phenomena as a factor of awakening, persistent effort as a factor of awakening, rapture as a factor of awakening, tranquility as a factor of awakening, concentration as a factor of awakening, and equanimity as a factor of awakening – these seven qualities, monks, should be cultivated for the direct comprehension of passion.",
      "sinhala": "මහණෙනි, රාගය පිරිසිඳ අවබෝධ කරගැනීම සඳහා සත් ධර්‍මයන් වැඩිය යුතුය. කවර සතක්ද? එනම්, සති සම්බොජ්ඣංගය, ධම්මවිචය සම්බොජ්ඣංගය, විරිය සම්බොජ්ඣංගය, පීති සම්බොජ්ඣංගය, පස්සද්ධි සම්බොජ්ඣංගය, සමාධි සම්බොජ්ඣංගය, උපේක්ඛා සම්බොජ්ඣංගය යන මේ සත් ධර්‍මයන්ය. මහණෙනි, රාගය පිරිසිඳ අවබෝධ කරගැනීම සඳහා මේ සත් ධර්‍මයන් වැඩිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 624,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya satta dhammā bhāvetabbā. Katame satta? Aniccasaññā, anattasaññā, asubhasaññā, ādīnavasaññā, pahānasaññā, virāgasaññā, nirodhasaññā – rāgassa, bhikkhave, abhiññāya ime satta dhammā bhāvetabbā’’ti.",
      "english": "Monastics, for the full understanding of lust, seven qualities are to be developed. Which seven? The perception of impermanence, the perception of non-self, the perception of unattractiveness, the perception of danger, the perception of relinquishment, the perception of dispassion, the perception of cessation – for the full understanding of lust, monastics, these seven qualities are to be developed.",
      "sinhala": "මහණෙනි, රාගය ප්‍රඥාවෙන් මැනවින් අවබෝධ කර ගැනීම පිණිස ධර්ම සතක් වඩනු ලැබිය යුතුය. ඒ සත කවරේද? අනිත්‍ය සංඥාව, අනාත්ම සංඥාව, අසුභ සංඥාව, ආදීනව සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාව යන මේවාය. මහණෙනි, රාගය ප්‍රඥාවෙන් මැනවින් අවබෝධ කර ගැනීම පිණිස මේ ධර්ම සත වඩනු ලැබිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 625,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya satta dhammā bhāvetabbā. Katame satta? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā, aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā – rāgassa, bhikkhave, abhiññāya ime satta dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct knowing of passion, seven qualities are to be developed. Which seven? The perception of foulness, the perception of death, the perception of repulsiveness in food, the perception of non-delight in the entire world, the perception of impermanence, the perception of suffering in the impermanent, and the perception of non-self in suffering. For the direct knowing of passion, monks, these seven qualities are to be developed.",
      "sinhala": "රාගය ප්‍ර​හාණය පිණිස, මහණෙනි, ධර්ම සතක් වැඩිය යුතුයි. ඒ සත කවරේද? අශුභ සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, මුළු ලෝකය කෙරෙහිම නොඇලීමේ සංඥාව, අනිත්‍ය සංඥාව, අනිත්‍යයෙහි දුක් සංඥාව, දුක් ස්වභාවයෙහි අනාත්ම සංඥාවයි. මහණෙනි, රාගය ප්‍ර​හාණය පිණිස මේ ධර්ම සත වැඩිය යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 626,
      "numberRange": "626-652",
      "pali": "‘‘Rāgassa, bhikkhave, pariññāya…pe… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya…pe… paṭinissaggāya ime satta dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the full comprehension of passion, for its utter destruction, for its abandonment, for its waning, for its fading away, for dispassion towards it, for its cessation, for its relinquishment, and for its complete giving up – these seven qualities must be developed.",
      "sinhala": "මහණෙනි, රාගය පිරිසිඳ දැන ගැනීම පිණිස ද, එහි සම්පූර්ණ ක්‍ෂය කිරීම පිණිස ද, එය ප්‍රහාණය කිරීම පිණිස ද, එය ක්‍ෂය කිරීම පිණිස ද, එය වියැකී යාම පිණිස ද, එය කෙරෙහි විරාගී වීම පිණිස ද, එය නිරුද්ධ කිරීම පිණිස ද, එය මුළුමනින්ම අත්හැරීම පිණිස ද, එය ප්‍රතිනිස්සර්ග කිරීම පිණිස ද, මේ සප්ත බෝධ්‍යංග ධර්මයන් වඩනු ලැබිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 653,
      "numberRange": "653-1132",
      "pali": "‘‘Dosassa…pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa abhiññāya…pe… pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya ime satta dhammā bhāvetabbā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti.",
      "english": "For the direct comprehension, for the full understanding, for the complete destruction, for the abandoning, for the ending, for the fading away, for dispassion, for the cessation, for the relinquishment, and for the total letting go of hatred, of delusion, of anger, of resentment, of denigration, of rivalry, of envy, of avarice, of deceit, of fraud, of obstinacy, of presumption, of conceit, of excessive conceit, of intoxication, and of heedlessness – these seven qualities should be developed.\n\nThe Blessed One said this. Those monks, delighted, rejoiced in the words of the Blessed One.",
      "sinhala": "ද්වේෂය, මුළාව, ක්‍රෝධය, වෛර බැඳීම, අනුන්ගේ ගුණ මැකීම, තරඟය, ඊර්ෂ්‍යාව, මසුරුකම, වංචනික බව, කුහක බව, මුරණ්ඩු බව, ආඩම්බරය, මානය, අතිමානය, මත්වීම, ප්‍රමාදය යන මේවා අභිඥාපණය පිණිස, පරිඥාපණය පිණිස, පිරිහෙළීම පිණිස, ප්‍රහාණය පිණිස, ක්ෂය කිරීම පිණිස, ව්‍යය කිරීම පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, චාගය පිණිස, ප්‍රතිනිස්සර්ගය පිණිස මේ සප්ත බෝධ්‍යංග ධර්මයන් වැඩිය යුතු ය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ඒ භික්ෂූහු සතුටු සිත් ඇතිව, භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කළහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ. ",
    "english": "The Abbreviated Series on Lust is finished.",
    "sinhala": "රාග පෙය්‍යාලය නිමයි."
  }
}