{
  "id": "an7.5",
  "title": {
    "pali": "Mahāyaññavaggo",
    "english": "The Chapter on Great Sacrifices",
    "sinhala": "මහා යඥ වර්ගය"
  },
  "sections": [
    {
      "number": 44,
      "pali": "[dī. ni. 3.332; cūḷani. posālamāṇavapucchāniddesa 83] ‘‘Sattimā, bhikkhave, viññāṇaṭṭhitiyo. Katamā satta? Santi, bhikkhave, sattā nānattakāyā nānattasaññino, seyyathāpi manussā, ekacce ca devā, ekacce ca vinipātikā. Ayaṃ paṭhamā viññāṇaṭṭhiti. ‘‘Santi, bhikkhave, sattā nānattakāyā ekattasaññino, seyyathāpi devā brahmakāyikā paṭhamābhinibbattā. Ayaṃ dutiyā viññāṇaṭṭhiti. ‘‘Santi, bhikkhave, sattā ekattakāyā nānattasaññino, seyyathāpi devā ābhassarā. Ayaṃ tatiyā viññāṇaṭṭhiti. ‘‘Santi, bhikkhave, sattā ekattakāyā ekattasaññino, seyyathāpi devā subhakiṇhā. Ayaṃ catutthā viññāṇaṭṭhiti. ‘‘Santi, bhikkhave, sattā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanūpagā. Ayaṃ pañcamā viññāṇaṭṭhiti. ‘‘Santi, bhikkhave, sattā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanūpagā. Ayaṃ chaṭṭhā viññāṇaṭṭhiti. ‘‘Santi, bhikkhave, sattā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanūpagā. Ayaṃ sattamā viññāṇaṭṭhiti. Imā kho, bhikkhave, satta viññāṇaṭṭhitiyo’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these seven stations of consciousness. Which seven?\n\nMonks, there are beings with diverse bodies and diverse perceptions, such as humans, some devas, and some in states of woe. This is the first station of consciousness.\n\nMonks, there are beings with diverse bodies but unified perception, such as the devas of the Brahma assembly who are reborn for the first time. This is the second station of consciousness.\n\nMonks, there are beings with unified bodies but diverse perceptions, such as the Abhassara devas. This is the third station of consciousness.\n\nMonks, there are beings with unified bodies and unified perception, such as the Subhakiṇha devas. This is the fourth station of consciousness.\n\nMonks, there are beings who, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of diversity, enter the realm of the infinitude of space, perceiving 'Space is infinite.' This is the fifth station of consciousness.\n\nMonks, there are beings who, by completely transcending the base of the infinitude of space, enter the realm of the infinitude of consciousness, perceiving 'Consciousness is infinite.' This is the sixth station of consciousness.\n\nMonks, there are beings who, by completely transcending the base of the infinitude of consciousness, enter the realm of nothingness, perceiving 'There is nothing at all.' This is the seventh station of consciousness.\n\nThese, monks, are the seven stations of consciousness.",
      "sinhala": "මහණෙනි, මේ විඤ්ඤාණස්ථාන සතකි. ඒ කවර සතක් ද යත්:\n\nමහණෙනි, කාය වශයෙන් නානාවිධ වූ, සංඥා වශයෙන් නානාවිධ වූ සත්ත්වයෝ ඇත. ඒ කෙසේද යත්: මනුෂ්‍යයෝ ද, ඇතැම් දෙවියෝ ද, ඇතැම් විනිපාතික සත්වයෝ ද වෙති. මේ පළමු විඤ්ඤාණස්ථානය යි.\n\nමහණෙනි, කාය වශයෙන් නානාවිධ වූ, සංඥා වශයෙන් ඒකවිධ වූ සත්ත්වයෝ ඇත. ඒ කෙසේද යත්: පළමුවෙන්ම උපන් බ්‍රහ්මකායික දෙවියෝ ය. මේ දෙවෙනි විඤ්ඤාණස්ථානය යි.\n\nමහණෙනි, කාය වශයෙන් ඒකවිධ වූ, සංඥා වශයෙන් නානාවිධ වූ සත්ත්වයෝ ඇත. ඒ කෙසේද යත්: ආභස්සර දෙවියෝ ය. මේ තුන්වෙනි විඤ්ඤාණස්ථානය යි.\n\nමහණෙනි, කාය වශයෙන් ඒකවිධ වූ, සංඥා වශයෙන් ඒකවිධ වූ සත්ත්වයෝ ඇත. ඒ කෙසේද යත්: සුභකිණ්හ දෙවියෝ ය. මේ සතරවෙනි විඤ්ඤාණස්ථානය යි.\n\nමහණෙනි, යම් සත්ත්වයෝ සියලු රූපසංඥාවන් සම්පූර්ණයෙන් ඉක්මවා, පටිඝ සංඥාවන්ගේ අතුරුදහන් වීමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, ‘අනන්තයි ආකාශය’යි කියා ආකාශානන්ත්‍යायतනයට පැමිණ සිටිත් ද, ඒ සත්ත්වයෝ ඇත. මේ පස්වෙනි විඤ්ඤාණස්ථානය යි.\n\nමහණෙනි, යම් සත්ත්වයෝ සියලු ආකාශානන්ත්‍යायतනය සම්පූර්ණයෙන් ඉක්මවා, ‘අනන්තයි විඤ්ඤාණය’යි කියා විඤ්ඤාණානන්ත්‍යायतනයට පැමිණ සිටිත් ද, ඒ සත්ත්වයෝ ඇත. මේ සයවෙනි විඤ්ඤාණස්ථානය යි.\n\nමහණෙනි, යම් සත්ත්වයෝ සියලු විඤ්ඤාණානන්ත්‍යायतනය සම්පූර්ණයෙන් ඉක්මවා, ‘කිසිවක් නැතැ’යි කියා ආකිංචඤ්ඤායතනයට පැමිණ සිටිත් ද, ඒ සත්ත්වයෝ ඇත. මේ සත්වෙනි විඤ්ඤාණස්ථානය යි.\n\nමහණෙනි, මේ සත් විඤ්ඤාණස්ථාන යෝ යි.",
      "paliTitle": "Sattaviññāṇaṭṭhitisuttaṃ",
      "englishTitle": "The Discourse on the Seven Stations of Consciousness",
      "sinhalaTitle": "සත්තවිඤ්ඤාණට්ඨිති සූත්‍රය"
    },
    {
      "number": 45,
      "pali": "‘‘Sattime, bhikkhave, samādhiparikkhārā. Katame satta? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati. Yā kho, bhikkhave, imehi sattahaṅgehi cittassekaggatā parikkhatā [‘saparikkhāratā’tipi, ‘saparikkhatā’tipi (saṃ. ni. 5.28)], ayaṃ vuccati, bhikkhave, ariyo sammāsamādhi [samādhi (syā.)] saupaniso itipi saparikkhāro itipī’’ti. Dutiyaṃ.",
      "english": "Monks, there are these seven requisites for concentration. Which seven? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, and Right Mindfulness. Monks, the one-pointedness of mind that is equipped and supported by these seven factors is called Noble Right Concentration, for it has its underlying conditions and also its full set of requisites.",
      "sinhala": "භික්‍ෂූනි, සමාධියේ පරිවාර ධර්ම සතක් ඇත. ඒ කවර සතක්ද?\nඑනම්, නිවැරදි දැක්ම, නිවැරදි අරමුණ, නිවැරදි වචනය, නිවැරදි ක්‍රියාව, නිවැරදි දිවිපෙවෙත, නිවැරදි වෑයම, නිවැරදි සිහිය යන ධර්ම සතයි.\nභික්‍ෂූනි, යම් සිතේ ඒකාග්‍රතාවයක් මේ අංග සතින් පිරිවරණ ලද්දේ වේද, භික්‍ෂූනි, මෙය උපනිශ්‍රය සහිත ආර්ය සම්මාසමාධිය යැයි ද, පරිවාර ධර්ම සහිත ආර්ය සම්මාසමාධිය යැයි ද කියනු ලැබේ.",
      "paliTitle": "Samādhiparikkhārasuttaṃ",
      "englishTitle": "The Discourse on the Requisites of Concentration",
      "sinhalaTitle": "සමාධිපරික්ඛාර සූත්‍රය"
    },
    {
      "number": 46,
      "pali": "‘‘Sattime, bhikkhave, aggī. Katame satta? Rāgaggi, dosaggi, mohaggi, āhuneyyaggi, gahapataggi, dakkhiṇeyyaggi, kaṭṭhaggi – ime kho, bhikkhave, satta aggī’’ti. Tatiyaṃ.",
      "english": "Monks, these are seven fires. Which seven? The fire of lust, the fire of hatred, the fire of delusion, the fire worthy of offerings, the householder’s fire, the fire worthy of donations, and the wood fire. These, monks, are the seven fires.",
      "sinhala": "මහණෙනි, මේ ගිනි සතෙකි. ඒ කවර සතෙක්ද? රාග ගින්න, ද්වේෂ ගින්න, මෝහ ගින්න, ආහුණෙය්‍ය ගින්න, ගහපති ගින්න, දක්ඛිණෙය්‍ය ගින්න, දැව ගින්න – මහණෙනි, මේ ගිනි සත වේ.",
      "paliTitle": "Paṭhamaaggisuttaṃ",
      "englishTitle": "The First Discourse on Fire",
      "sinhalaTitle": "පළමු අග්ගි සූත්‍රය"
    },
    {
      "number": 47,
      "pali": "Tena kho pana samayena uggatasarīrassa brāhmaṇassa mahāyañño upakkhaṭo hoti. Pañca usabhasatāni thūṇūpanītāni honti yaññatthāya, pañca vacchatarasatāni thūṇūpanītāni honti yaññatthāya, pañca vacchatarisatāni thūṇūpanītāni honti yaññatthāya, pañca ajasatāni thūṇūpanītāni honti yaññatthāya, pañca urabbhasatāni thūṇūpanītāni honti yaññatthāya. Atha kho uggatasarīro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uggatasarīro brāhmaṇo bhagavantaṃ etadavoca – ‘‘Sutaṃ metaṃ, bho gotama, aggissa ādānaṃ [ādhānaṃ (sī. syā.)] yūpassa ussāpanaṃ mahapphalaṃ hoti mahānisaṃsa’’nti. ‘‘Mayāpi kho etaṃ, brāhmaṇa, sutaṃ aggissa ādānaṃ yūpassa ussāpanaṃ mahapphalaṃ hoti mahānisaṃsa’’nti. Dutiyampi kho uggatasarīro brāhmaṇo…pe… tatiyampi kho uggatasarīro brāhmaṇo bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama, aggissa ādānaṃ yūpassa ussāpanaṃ mahapphalaṃ hoti mahānisaṃsa’’nti. ‘‘Mayāpi kho etaṃ, brāhmaṇa, sutaṃ aggissa ādānaṃ yūpassa ussāpanaṃ mahapphalaṃ hoti mahānisaṃsa’’nti. ‘‘Tayidaṃ, bho gotama, sameti bhoto ceva gotamassa amhākañca, yadidaṃ sabbena sabbaṃ’’. Evaṃ vutte āyasmā ānando uggatasarīraṃ brāhmaṇaṃ etadavoca – ‘‘na kho, brāhmaṇa, tathāgatā evaṃ pucchitabbā – ‘sutaṃ metaṃ, bho gotama, aggissa ādānaṃ yūpassa ussāpanaṃ mahapphalaṃ hoti mahānisaṃsa’nti. Evaṃ kho, brāhmaṇa, tathāgatā pucchitabbā – ‘ahañhi, bhante, aggiṃ [aggissa (ka.)] ādātukāmo, [ādhātukāmo (sī. syā.)] yūpaṃ ussāpetukāmo. Ovadatu maṃ, bhante, bhagavā. Anusāsatu maṃ, bhante, bhagavā yaṃ mama assa dīgharattaṃ hitāya sukhāyā’’’ti. Atha kho uggatasarīro brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahañhi, bho gotama, aggiṃ ādātukāmo yūpaṃ ussāpetukāmo. Ovadatu maṃ bhavaṃ gotamo. Anusāsatu maṃ bhavaṃ gotamo yaṃ mama assa dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Aggiṃ, brāhmaṇa, ādento [ādhento (sī. syā.)] yūpaṃ ussāpento pubbeva yaññā tīṇi satthāni ussāpeti akusalāni dukkhudrayāni [dukkhuddayāni (sī.)] dukkhavipākāni. Katamāni tīṇi? Kāyasatthaṃ, vacīsatthaṃ, manosatthaṃ. Aggiṃ, brāhmaṇa, ādento yūpaṃ ussāpento pubbeva yaññā evaṃ cittaṃ uppādesi – ‘ettakā usabhā haññantu yaññatthāya, ettakā vacchatarā haññantu yaññatthāya, ettakā vacchatariyo haññantu yaññatthāya, ettakā ajā haññantu yaññatthāya, ettakā urabbhā haññantu yaññatthāyā’ti. So ‘puññaṃ karomī’ti apuññaṃ karoti, ‘kusalaṃ karomī’ti akusalaṃ karoti, ‘sugatiyā maggaṃ pariyesāmī’ti duggatiyā maggaṃ pariyesati. Aggiṃ, brāhmaṇa, ādento yūpaṃ ussāpento pubbeva yaññā idaṃ paṭhamaṃ manosatthaṃ ussāpeti akusalaṃ dukkhudrayaṃ dukkhavipākaṃ. ‘‘Puna caparaṃ, brāhmaṇa, aggiṃ ādento yūpaṃ ussāpento pubbeva yaññā evaṃ vācaṃ bhāsati – ‘ettakā usabhā haññantu yaññatthāya, ettakā vacchatarā haññantu yaññatthāya, ettakā vacchatariyo haññantu yaññatthāya, ettakā ajā haññantu yaññatthāya, ettakā urabbhā haññantu yaññatthāyā’ti. So ‘puññaṃ karomī’ti apuññaṃ karoti, ‘kusalaṃ karomī’ti akusalaṃ karoti, ‘sugatiyā maggaṃ pariyesāmī’ti duggatiyā maggaṃ pariyesati. Aggiṃ, brāhmaṇa, ādento yūpaṃ ussāpento pubbeva yaññā idaṃ dutiyaṃ vacīsatthaṃ ussāpeti akusalaṃ dukkhudrayaṃ dukkhavipākaṃ. ‘‘Puna caparaṃ, brāhmaṇa, aggiṃ ādento yūpaṃ ussāpento pubbeva yaññā sayaṃ paṭhamaṃ samārambhati [samārabbhati (sī. ka.), samārabhati (syā.)] usabhā hantuṃ [haññantu (sī. syā.)] yaññatthāya, sayaṃ paṭhamaṃ samārambhati vacchatarā hantuṃ yaññatthāya, sayaṃ paṭhamaṃ samārambhati vacchatariyo hantuṃ yaññatthāya, sayaṃ paṭhamaṃ samārambhati ajā hantuṃ yaññatthāya, sayaṃ paṭhamaṃ samārambhati urabbhā hantuṃ yaññatthāya [haññantu yaññatthāyāti (sī. syā.)]. So ‘puññaṃ karomī’ti apuññaṃ karoti, ‘kusalaṃ karomī’ti akusalaṃ karoti, ‘sugatiyā maggaṃ pariyesāmī’ti duggatiyā maggaṃ pariyesati. Aggiṃ, brāhmaṇa, ādento yūpaṃ ussāpento pubbeva yaññā idaṃ tatiyaṃ kāyasatthaṃ ussāpeti akusalaṃ dukkhudrayaṃ dukkhavipākaṃ. Aggiṃ, brāhmaṇa, ādento yūpaṃ ussāpento pubbeva yaññā imāni tīṇi satthāni ussāpeti akusalāni dukkhudrayāni dukkhavipākāni. ‘‘Tayome, brāhmaṇa, aggī pahātabbā parivajjetabbā, na sevitabbā. Katame tayo? Rāgaggi, dosaggi, mohaggi. ‘‘Kasmā cāyaṃ, brāhmaṇa, rāgaggi pahātabbo parivajjetabbo, na sevitabbo? Ratto kho, brāhmaṇa, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Tasmāyaṃ rāgaggi pahātabbo parivajjetabbo, na sevitabbo. ‘‘Kasmā cāyaṃ, brāhmaṇa, dosaggi pahātabbo parivajjetabbo, na sevitabbo? Duṭṭho kho, brāhmaṇa, dosena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Tasmāyaṃ dosaggi pahātabbo parivajjetabbo, na sevitabbo. ‘‘Kasmā cāyaṃ, brāhmaṇa, mohaggi pahātabbo parivajjetabbo, na sevitabbo? Mūḷho kho, brāhmaṇa, mohena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Tasmāyaṃ mohaggi pahātabbo parivajjetabbo, na sevitabbo. Ime kho tayo, brāhmaṇa, aggī pahātabbā parivajjetabbā, na sevitabbā. ‘‘Tayo kho, brāhmaṇa, aggī sakkatvā garuṃ katvā mānetvā pūjetvā sammā sukhaṃ parihātabbā. Katame tayo? Āhuneyyaggi, gahapataggi, dakkhiṇeyyaggi. ‘‘Katamo ca, brāhmaṇa, āhuneyyaggi? Idha, brāhmaṇa, yassa te honti mātāti vā pitāti vā, ayaṃ vuccati, brāhmaṇa, āhuneyyaggi. Taṃ kissa hetu? Atohayaṃ [itopāyaṃ (ka.)], brāhmaṇa, āhuto sambhūto, tasmāyaṃ āhuneyyaggi sakkatvā garuṃ katvā mānetvā pūjetvā sammā sukhaṃ parihātabbo. ‘‘Katamo ca, brāhmaṇa, gahapataggi? Idha, brāhmaṇa, yassa te honti puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, ayaṃ vuccati, brāhmaṇa, gahapataggi. Tasmāyaṃ gahapataggi sakkatvā garuṃ katvā mānetvā pūjetvā sammā sukhaṃ parihātabbo. ‘‘Katamo ca, brāhmaṇa, dakkhiṇeyyaggi? Idha, brāhmaṇa, ye te samaṇabrāhmaṇā parappavādā paṭiviratā khantisoracce niviṭṭhā ekamattānaṃ damenti, ekamattānaṃ samenti, ekamattānaṃ parinibbāpenti, ayaṃ vuccati, brāhmaṇa, dakkhiṇeyyaggi. Tasmāyaṃ dakkhiṇeyyaggi sakkatvā garuṃ katvā mānetvā pūjetvā sammā sukhaṃ parihātabbo. Ime kho, brāhmaṇa, tayo aggī sakkatvā garuṃ katvā mānetvā pūjetvā sammā sukhaṃ parihātabbā. ‘‘Ayaṃ kho pana, brāhmaṇa, kaṭṭhaggi kālena kālaṃ ujjaletabbo, kālena kālaṃ ajjhupekkhitabbo, kālena kālaṃ nibbāpetabbo, kālena kālaṃ nikkhipitabbo’’ti. Evaṃ vutte uggatasarīro brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama; abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gatanti. Esāhaṃ, bho gotama, pañca usabhasatāni muñcāmi jīvitaṃ demi, pañca vacchatarasatāni muñcāmi jīvitaṃ demi, pañca vacchatarisatāni muñcāmi jīvitaṃ demi, pañca ajasatāni muñcāmi jīvitaṃ demi, pañca urabbhasatāni muñcāmi jīvitaṃ demi. Haritāni ceva tiṇāni khādantu, sītāni ca pānīyāni pivantu, sīto ca nesaṃ vāto upavāyata’’nti [upavāyatūti (ka.)]. Catutthaṃ.",
      "english": "Now at that time, a great sacrifice had been prepared for the brahmin Uggatasarīra. Five hundred bulls were led to the posts for the sacrifice, five hundred steers were led to the posts for the sacrifice, five hundred heifers were led to the posts for the sacrifice, five hundred goats were led to the posts for the sacrifice, and five hundred rams were led to the posts for the sacrifice. Then the brahmin Uggatasarīra approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging polite and cordial talk, he sat down to one side. As he sat to one side, the brahmin Uggatasarīra said to the Blessed One, \"I have heard this, Venerable Gotama, that setting up a fire and raising a sacrificial post yields great fruit and great benefit.\" \"I too, brahmin, have heard this, that setting up a fire and raising a sacrificial post yields great fruit and great benefit,\" said the Blessed One. A second time, the brahmin Uggatasarīra... A third time, the brahmin Uggatasarīra said to the Blessed One, \"I have heard this, Venerable Gotama, that setting up a fire and raising a sacrificial post yields great fruit and great benefit.\" \"I too, brahmin, have heard this, that setting up a fire and raising a sacrificial post yields great fruit and great benefit,\" said the Blessed One. \"Therefore, Venerable Gotama, this statement agrees with both yours and ours, in every respect.\" When this was said, Venerable Ānanda said to the brahmin Uggatasarīra, \"Indeed, brahmin, Tathāgatas should not be questioned in this way: ‘I have heard this, Venerable Gotama, that setting up a fire and raising a sacrificial post yields great fruit and great benefit.’ Indeed, brahmin, Tathāgatas should be questioned in this way: ‘Venerable Sir, I desire to set up a fire and to raise a sacrificial post. May the Blessed One instruct me, Venerable Sir. May the Blessed One teach me what would be for my long-term welfare and happiness.’\" Then the brahmin Uggatasarīra said to the Blessed One, \"Indeed, Venerable Gotama, I desire to set up a fire and to raise a sacrificial post. May the Venerable Gotama instruct me. May the Venerable Gotama teach me what would be for my long-term welfare and happiness.\"\n\n\"Brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one raises three weapons that are unwholesome, have a painful outcome, and a painful result. Which three? The weapon of body, the weapon of speech, and the weapon of mind. Brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one generates such a thought in the mind: ‘Let so many bulls be slaughtered for the sacrifice, let so many steers be slaughtered for the sacrifice, let so many heifers be slaughtered for the sacrifice, let so many goats be slaughtered for the sacrifice, let so many rams be slaughtered for the sacrifice.’ Thinking ‘I am doing merit,’ one instead does demerit. Thinking ‘I am doing what is wholesome,’ one instead does what is unwholesome. Thinking ‘I am seeking the path to a good destination,’ one instead seeks the path to a bad destination. Brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one thereby raises this first weapon of mind, which is unwholesome, has a painful outcome, and a painful result.\n\n\"Furthermore, brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one utters such a speech: ‘Let so many bulls be slaughtered for the sacrifice, let so many steers be slaughtered for the sacrifice, let so many heifers be slaughtered for the sacrifice, let so many goats be slaughtered for the sacrifice, let so many rams be slaughtered for the sacrifice.’ Thinking ‘I am doing merit,’ one instead does demerit. Thinking ‘I am doing what is wholesome,’ one instead does what is unwholesome. Thinking ‘I am seeking the path to a good destination,’ one instead seeks the path to a bad destination. Brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one thereby raises this second weapon of speech, which is unwholesome, has a painful outcome, and a painful result.\n\n\"Furthermore, brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one oneself first undertakes to slaughter bulls for the sacrifice, oneself first undertakes to slaughter steers for the sacrifice, oneself first undertakes to slaughter heifers for the sacrifice, oneself first undertakes to slaughter goats for the sacrifice, oneself first undertakes to slaughter rams for the sacrifice. Thinking ‘I am doing merit,’ one instead does demerit. Thinking ‘I am doing what is wholesome,’ one instead does what is unwholesome. Thinking ‘I am seeking the path to a good destination,’ one instead seeks the path to a bad destination. Brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one thereby raises this third weapon of body, which is unwholesome, has a painful outcome, and a painful result. Brahmin, when one sets up a fire and raises a sacrificial post, even before the sacrifice, one thereby raises these three weapons, which are unwholesome, have a painful outcome, and a painful result.\"\n\nThere are these three fires, brahmin, that should be abandoned, avoided, and not indulged. Which three? The fire of craving, the fire of aversion, and the fire of delusion.\n\nAnd why, brahmin, should this fire of craving be abandoned, avoided, and not indulged? One who is stained by craving, brahmin, overcome and whose mind is consumed by it, commits misconduct by body, misconduct by speech, and misconduct by mind. Having committed misconduct by body, misconduct by speech, and misconduct by mind, with the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a downfall, in hell. Therefore, this fire of craving should be abandoned, avoided, and not indulged.\n\nAnd why, brahmin, should this fire of aversion be abandoned, avoided, and not indulged? One who is hostile, brahmin, overcome and whose mind is consumed by aversion, commits misconduct by body, misconduct by speech, and misconduct by mind. Having committed misconduct by body, misconduct by speech, and misconduct by mind, with the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a downfall, in hell. Therefore, this fire of aversion should be abandoned, avoided, and not indulged.\n\nAnd why, brahmin, should this fire of delusion be abandoned, avoided, and not indulged? One who is deluded, brahmin, overcome and whose mind is consumed by delusion, commits misconduct by body, misconduct by speech, and misconduct by mind. Having committed misconduct by body, misconduct by speech, and misconduct by mind, with the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a downfall, in hell. Therefore, this fire of delusion should be abandoned, avoided, and not indulged. These are the three fires, brahmin, that should be abandoned, avoided, and not indulged.\n\nThere are these three fires, brahmin, that should be properly and happily attended to with respect, esteem, honor, and veneration. Which three? The fire worthy of offerings, the householder's fire, and the fire worthy of gifts.\n\nAnd what, brahmin, is the fire worthy of offerings? Here, brahmin, whoever are your mother or your father, this is called, brahmin, the fire worthy of offerings. For what reason? From them, brahmin, you were offered and came into being. Therefore, this fire worthy of offerings should be properly and happily attended to with respect, esteem, honor, and veneration.\n\nAnd what, brahmin, is the householder's fire? Here, brahmin, whoever are your children, or your wife, or your servants, or your employees, or your workers, this is called, brahmin, the householder's fire. Therefore, this householder's fire should be properly and happily attended to with respect, esteem, honor, and veneration.\n\nAnd what, brahmin, is the fire worthy of gifts? Here, brahmin, those ascetics and brahmins who have withdrawn from other doctrines, who are established in patience and gentleness, who by themselves tame themselves, who by themselves bring themselves to peace, who by themselves attain complete liberation, this is called, brahmin, the fire worthy of gifts. Therefore, this fire worthy of gifts should be properly and happily attended to with respect, esteem, honor, and veneration. These are the three fires, brahmin, that should be properly and happily attended to with respect, esteem, honor, and veneration.\n\nBut as for this firewood fire, brahmin, it should be kindled from time to time, overseen from time to time, extinguished from time to time, and put away from time to time.\n\nWhen this was said, the brahmin Uggatasarīra addressed the Blessed One thus: 'Excellent, good Gotama! Excellent, good Gotama! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to hold up a lamp in the darkness so that those with eyes could see forms—in the same way has the Blessed One expounded the Dhamma in various ways. I go for refuge to the Blessed One, and to the Dhamma, and to the Saṅgha. Let the Blessed One remember me as a lay follower who has taken refuge from this day forth as long as life lasts.' Then the brahmin said: 'Good Gotama, I release five hundred bulls, I give them life; I release five hundred male calves, I give them life; I release five hundred female calves, I give them life; I release five hundred goats, I give them life; I release five hundred rams, I give them life. Let them eat green grass, let them drink cool water, and let a cool breeze blow upon them.'",
      "sinhala": "ඒ වේලෙහි, උග්ගතසරීර නම් බමුණාට මහා යාගයක් සූදානම් කර තිබුණි. යාගය සඳහා ගොනුන් පන්සීයක්, වස්සන් පන්සීයක්, වස්සීන් පන්සීයක්, එළුවන් පන්සීයක්, බැටළුවන් පන්සීයක් බැගින් කණු ළඟට ගෙනැවිත් තිබුණි.\n\nඉක්බිති උග්ගතසරීර බමුණා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සමීපව කතා කළේය. සතුටු විය යුතු, සිහි කටයුතු කතාබහ නිමවා එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ උග්ගතසරීර බමුණා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භවත් ගෞතමයන් වහන්ස, ගින්න දැල්වීමත්, යූප කණුව එසවීමත් මහත් ඵල ඇති, මහත් ආනිශංස ඇති දෙයක් බව මම අසා ඇත්තෙමි.\" \"බමුණ, ගින්න දැල්වීමත්, යූප කණුව එසවීමත් මහත් ඵල ඇති, මහත් ආනිශංස ඇති දෙයක් බව මමත් අසා ඇත්තෙමි.\" දෙවන වරටත් උග්ගතසරීර බමුණා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භවත් ගෞතමයන් වහන්ස, ගින්න දැල්වීමත්, යූප කණුව එසවීමත් මහත් ඵල ඇති, මහත් ආනිශංස ඇති දෙයක් බව මම අසා ඇත්තෙමි.\" \"බමුණ, ගින්න දැල්වීමත්, යූප කණුව එසවීමත් මහත් ඵල ඇති, මහත් ආනිශංස ඇති දෙයක් බව මමත් අසා ඇත්තෙමි.\" \"භවත් ගෞතමයන් වහන්ස, මේ (අදහස) සම්පූර්ණයෙන්ම භවත් ගෞතමයන් වහන්සේගේ සහ අපගේ අදහස් සමග එකඟ වේ.\"\n\nමෙසේ පැවසූ කල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ උග්ගතසරීර බමුණාට මෙසේ වදාළ සේක: \"බමුණ, 'භවත් ගෞතමයන් වහන්ස, ගින්න දැල්වීමත්, යූප කණුව එසවීමත් මහත් ඵල ඇති, මහත් ආනිශංස ඇති දෙයක් බව මම අසා ඇත්තෙමි' යනුවෙන් තථාගතයන් වහන්සේගෙන් ප්‍රශ්න නොකළ යුතුය. බමුණ, තථාගතයන් වහන්සේගෙන් මෙසේ ප්‍රශ්න කළ යුතුය: 'ස්වාමීනි, මම ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කැමැත්තෙමි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට අවවාද කරන සේක්වා. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට අනුශාසනා කරන සේක්වා, යමක් මට දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේද' යනුවෙනි.\" ඉක්බිති උග්ගතසරීර බමුණා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භවත් ගෞතමයන් වහන්ස, මම ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කැමැත්තෙමි. භවත් ගෞතමයන් වහන්සේ මට අවවාද කරන සේක්වා. භවත් ගෞතමයන් වහන්සේ මට අනුශාසනා කරන සේක්වා, යමක් මට දීර්ඝ කාලයක් හිතසුව පිණිස වන්නේද.\"\n\n\"බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර අකුසල, දුක් උපදවන, දුක් විපාක ඇති ශස්ත්‍ර තුනක් එසවූවා වේ. ඒ තුන කවරේද? කාය ශස්ත්‍රය, වචී ශස්ත්‍රය, මනෝ ශස්ත්‍රය. බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර මෙවැනි සිතක් උපදවයි: ‘මේ තරම් ගොනුන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් වස්සන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් වස්සීන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් එළුවන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් බැටළුවන් යාගය සඳහා මරනු ලැබේවා’ කියාය. ඔහු ‘පිනක් කරමි’ කියා පවක් කරයි. ‘කුසලයක් කරමි’ කියා අකුසලයක් කරයි. ‘සුගතියට මඟ සොයමි’ කියා දුගතියට මඟ සොයයි. බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර දුක් උපදවන, දුක් විපාක ඇති මේ පළමු මනෝ ශස්ත්‍රය එසවූවා වේ.\"\n\n\"තවද, බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර මෙවැනි වචනයක් ප්‍රකාශ කරයි: ‘මේ තරම් ගොනුන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් වස්සන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් වස්සීන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් එළුවන් යාගය සඳහා මරනු ලැබේවා, මේ තරම් බැටළුවන් යාගය සඳහා මරනු ලැබේවා’ කියාය. ඔහු ‘පිනක් කරමි’ කියා පවක් කරයි. ‘කුසලයක් කරමි’ කියා අකුසලයක් කරයි. ‘සුගතියට මඟ සොයමි’ කියා දුගතියට මඟ සොයයි. බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර දුක් උපදවන, දුක් විපාක ඇති මේ දෙවන වචී ශස්ත්‍රය එසවූවා වේ.\"\n\n\"තවද, බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර තෙමේම ප්‍රථමයෙන් ගොනුන් යාගය සඳහා මැරීමට පටන් ගනියි. තෙමේම ප්‍රථමයෙන් වස්සන් යාගය සඳහා මැරීමට පටන් ගනියි. තෙමේම ප්‍රථමයෙන් වස්සීන් යාගය සඳහා මැරීමට පටන් ගනියි. තෙමේම ප්‍රථමයෙන් එළුවන් යාගය සඳහා මැරීමට පටන් ගනියි. තෙමේම ප්‍රථමයෙන් බැටළුවන් යාගය සඳහා මැරීමට පටන් ගනියි. ඔහු ‘පිනක් කරමි’ කියා පවක් කරයි. ‘කුසලයක් කරමි’ කියා අකුසලයක් කරයි. ‘සුගතියට මඟ සොයමි’ කියා දුගතියට මඟ සොයයි. බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර දුක් උපදවන, දුක් විපාක ඇති මේ තෙවන කාය ශස්ත්‍රය එසවූවා වේ. බමුණ, ගින්න දැල්වීමටත්, යූප කණුව එසවීමටත් කල්පනා කරන්නා යාගයටත් පෙර දුක් උපදවන, දුක් විපාක ඇති මේ ශස්ත්‍ර තුනම එසවූවා වේ.\"\n\nබ්‍රාහ්මණය, මේ ගිනි තුනක් ඇත. ඒවා පහ කළ යුතු යි, දුරු කළ යුතු යි, සේවනය නොකළ යුතු යි. ඒ තුන කුමක් ද? රාගය නමැති ගින්න, ද්වේෂය නමැති ගින්න, මෝහය නමැති ගින්න යි.\n\nබ්‍රාහ්මණය, මේ රාගය නමැති ගින්න පහ කළ යුත්තේ, දුරු කළ යුත්තේ, සේවනය නොකළ යුත්තේ කුමක් හෙයින් ද? බ්‍රාහ්මණය, රාගයෙන් ඇලුණේ, රාගයෙන් යටපත් වුණේ, සිත මුළා වුණේ, කයින් දුශ්චරිතයෙහි හැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙයි, සිතින් දුශ්චරිතයෙහි හැසිරෙයි. හෙතෙම කයින් දුශ්චරිතයෙහි හැසිර, වචනයෙන් දුශ්චරිතයෙහි හැසිර, සිතින් දුශ්චරිතයෙහි හැසිර, කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයෙහි උපදී. එහෙයින් මේ රාගය නමැති ගින්න පහ කළ යුතු යි, දුරු කළ යුතු යි, සේවනය නොකළ යුතු යි.\n\nබ්‍රාහ්මණය, මේ ද්වේෂය නමැති ගින්න පහ කළ යුත්තේ, දුරු කළ යුත්තේ, සේවනය නොකළ යුත්තේ කුමක් හෙයින් ද? බ්‍රාහ්මණය, ද්වේෂයෙන් දූෂිත වුණේ, ද්වේෂයෙන් යටපත් වුණේ, සිත මුළා වුණේ, කයින් දුශ්චරිතයෙහි හැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙයි, සිතින් දුශ්චරිතයෙහි හැසිරෙයි. හෙතෙම කයින් දුශ්චරිතයෙහි හැසිර, වචනයෙන් දුශ්චරිතයෙහි හැසිර, සිතින් දුශ්චරිතයෙහි හැසිර, කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයෙහි උපදී. එහෙයින් මේ ද්වේෂය නමැති ගින්න පහ කළ යුතු යි, දුරු කළ යුතු යි, සේවනය නොකළ යුතු යි.\n\nබ්‍රාහ්මණය, මේ මෝහය නමැති ගින්න පහ කළ යුත්තේ, දුරු කළ යුත්තේ, සේවනය නොකළ යුත්තේ කුමක් හෙයින් ද? බ්‍රාහ්මණය, මෝහයෙන් මුළා වුණේ, මෝහයෙන් යටපත් වුණේ, සිත මුළා වුණේ, කයින් දුශ්චරිතයෙහි හැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙයි, සිතින් දුශ්චරිතයෙහි හැසිරෙයි. හෙතෙම කයින් දුශ්චරිතයෙහි හැසිර, වචනයෙන් දුශ්චරිතයෙහි හැසිර, සිතින් දුශ්චරිතයෙහි හැසිර, කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයෙහි උපදී. එහෙයින් මේ මෝහය නමැති ගින්න පහ කළ යුතු යි, දුරු කළ යුතු යි, සේවනය නොකළ යුතු යි. බ්‍රාහ්මණය, මේ ගිනි තුන පහ කළ යුතු යි, දුරු කළ යුතු යි, සේවනය නොකළ යුතු යි.\n\nබ්‍රාහ්මණය, ගිනි තුනක් ඇත. ඒවාට සත්කාර කොට, ගරු කොට, මැනවින් සලකා, පිදීමෙන් මනා කොට සැපසේ පවත්වාගෙන යා යුතු යි. ඒ තුන කුමක් ද? ආහුණෙය්‍ය අග්නිය, ගෘහපති අග්නිය, දක්ඛිණෙය්‍ය අග්නිය යි.\n\nබ්‍රාහ්මණය, ආහුණෙය්‍ය අග්නිය යනු කුමක් ද? බ්‍රාහ්මණය, මෙහිලා යමෙකුට මව හෝ පියා වේ ද, බ්‍රාහ්මණය, මොවුන් ආහුණෙය්‍ය අග්නිය යැයි කියනු ලැබේ. එයට හේතුව කුමක් ද? මක්නිසාද යත්, බ්‍රාහ්මණය, (දරුවා) ඔවුන්ගෙන් උපත ලැබූ බැවින්, ඔවුහු පූජාවන්ට සුදුස්සෝ වෙති. එහෙයින් මේ ආහුණෙය්‍ය අග්නියට සත්කාර කොට, ගරු කොට, මැනවින් සලකා, පිදීමෙන් මනා කොට සැපසේ පවත්වාගෙන යා යුතු යි.\n\nබ්‍රාහ්මණය, ගෘහපති අග්නිය යනු කුමක් ද? බ්‍රාහ්මණය, මෙහිලා යමෙකුට පුත්‍රයෝ හෝ භාර්යාවෝ හෝ දාසයෝ හෝ පේෂණකාරයෝ හෝ කම්කරුවෝ හෝ වෙත් ද, බ්‍රාහ්මණය, මොවුන් ගෘහපති අග්නිය යැයි කියනු ලැබේ. එහෙයින් මේ ගෘහපති අග්නියට සත්කාර කොට, ගරු කොට, මැනවින් සලකා, පිදීමෙන් මනා කොට සැපසේ පවත්වාගෙන යා යුතු යි.\n\nබ්‍රාහ්මණය, දක්ඛිණෙය්‍ය අග්නිය යනු කුමක් ද? බ්‍රාහ්මණය, මෙහිලා යම් ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ වෙත් ද, පරවාදයෙන් (අන්‍ය මතයන්ගෙන්) වෙන්වූවාහු ද, ඉවසීමෙන් හා ශාන්තභාවයෙන් පිහිටියාහු ද, තමන්ම දමනය කරත් ද, තමන්ම සංසිඳුවත් ද, තමන්ම පිරිනිවන් පමුණුවත් ද, බ්‍රාහ්මණය, මොවුන් දක්ඛිණෙය්‍ය අග්නිය යැයි කියනු ලැබේ. එහෙයින් මේ දක්ඛිණෙය්‍ය අග්නියට සත්කාර කොට, ගරු කොට, මැනවින් සලකා, පිදීමෙන් මනා කොට සැපසේ පවත්වාගෙන යා යුතු යි. බ්‍රාහ්මණය, මේ ගිනි තුනට සත්කාර කොට, ගරු කොට, මැනවින් සලකා, පිදීමෙන් මනා කොට සැපසේ පවත්වාගෙන යා යුතු යි.\n\nබ්‍රාහ්මණය, මේ දර ගින්න නම්, කලින් කලට දැල්විය යුතු යි, කලින් කලට නඩත්තු කළ යුතු යි, කලින් කලට නිවා දැමිය යුතු යි, කලින් කලට ඉවත දැමිය යුතු යි.\n\nමෙසේ පැවසූ කල්හි උග්ගතසரீර නම් බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භවත් ගෞතමයන් වහන්ස, ඉතා මනහර යි! භවත් ගෞතමයන් වහන්ස, ඉතා මනහර යි! අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස භවත් ගෞතමයන් වහන්සේ මා සලකත්වා!\n\nභවත් ගෞතමයන් වහන්ස, මම මේ ගවයන් පන්සීයක්, වසු පැටවුන් පන්සීයක්, වස්සීන් පන්සීයක්, එළුවන් පන්සීයක්, බැටළුවන් පන්සීයක් නිදහස් කරමි, ජීවිතය දෙමි. ඒවාට කොළ තණකොළ අනුභව කරන්නට ඉඩ හරින්න, සීතල ජලය පානය කරන්නට ඉඩ හරින්න, සිසිල් සුළං ඒවාට හමන්නට ඉඩ හරින්න.\"",
      "paliTitle": "Dutiyaaggisuttaṃ",
      "englishTitle": "Second Sutta on Fires",
      "sinhalaTitle": "දුතිය අග්ගි සූත්‍රය"
    },
    {
      "number": 48,
      "pali": "‘‘Sattimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. ‘‘Katamā satta? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā, aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā. Imā kho, bhikkhave, satta saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, these seven perceptions, when developed and frequently practiced, are greatly fruitful, greatly beneficial, having the Deathless as their culmination, with the Deathless as their ultimate aim. Which seven? The perception of repulsiveness, the perception of death, the perception of the loathsomeness of food, the perception of disenchantment with the entire world, the perception of impermanence, the perception of suffering in what is impermanent, and the perception of non-self in what is suffering. Indeed, bhikkhus, these seven perceptions, when developed and frequently practiced, are greatly fruitful, greatly beneficial, having the Deathless as their culmination, with the Deathless as their ultimate aim.",
      "sinhala": "මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ සංඥාවන් සත මහත් ඵල ද මහත් ආනිශංස ද ඇත්තාහ; අමෘතය අරමුණු කොට ඇත්තා වූ, අමෘතයෙන් කෙළවර වන්නා වූ වෙති.\n\nකවරේද ඒ සත? අසුභ සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි නොඇලීමේ සංඥාව, අනිත‍්ය සංඥාව, අනිත‍්ය වූ දෙයෙහි දුක‍්ඛ සංඥාව, දුක‍්ඛයෙහි අනාත‍්ම සංඥාව යන මේවාය.\n\nමහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ සංඥාවන් සත මහත් ඵල ද මහත් ආනිශංස ද ඇත්තාහ; අමෘතය අරමුණු කොට ඇත්තා වූ, අමෘතයෙන් කෙළවර වන්නා වූ වෙති.",
      "paliTitle": "Paṭhamasaññāsuttaṃ",
      "englishTitle": "The First Discourse on Perception",
      "sinhalaTitle": "පළමු සඤ්ඤා සූත්‍රය"
    },
    {
      "number": 49,
      "pali": "‘‘Sattimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā satta? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā, aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā. Imā kho, bhikkhave, satta saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānāti. ‘‘‘Asubhasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti. Iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Asubhasaññāparicitena, bhikkhave, bhikkhuno cetasā bahulaṃ viharato methunadhammasamāpattiyā cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti. Seyyathāpi, bhikkhave, kukkuṭapattaṃ vā nhārudaddulaṃ vā aggimhi pakkhittaṃ patilīyati patikuṭati pativattati, na sampasāriyati. Evamevaṃ kho, bhikkhave, bhikkhuno asubhasaññāparicitena cetasā bahulaṃ viharato methunadhammasamāpattiyā cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti. ‘‘Sace, bhikkhave, bhikkhuno asubhasaññāparicitena cetasā bahulaṃ viharato methunadhammasamāpattiyā cittaṃ anusandahati [anusaṇṭhāti (sī.)] appaṭikulyatā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘abhāvitā me asubhasaññā, natthi me pubbenāparaṃ viseso, appattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. Sace pana, bhikkhave, bhikkhuno asubhasaññāparicitena cetasā bahulaṃ viharato methunadhammasamāpattiyā cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘subhāvitā me asubhasaññā, atthi me pubbenāparaṃ viseso, pattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘Asubhasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Maraṇasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti kho panetaṃ vuttaṃ kiñcetaṃ paṭicca vuttaṃ? Maraṇasaññāparicitena, bhikkhave, bhikkhuno cetasā bahulaṃ viharato jīvitanikantiyā cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti. Seyyathāpi, bhikkhave, kukkuṭapattaṃ vā nhārudaddulaṃ vā aggimhi pakkhittaṃ patilīyati patikuṭati pativattati, na sampasāriyati. Evamevaṃ kho, bhikkhave, bhikkhuno maraṇasaññāparicitena cetasā bahulaṃ viharato jīvitanikantiyā cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti. ‘‘Sace, bhikkhave, bhikkhuno maraṇasaññāparicitena cetasā bahulaṃ viharato jīvitanikantiyā cittaṃ anusandahati appaṭikulyatā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘abhāvitā me maraṇasaññā, natthi me pubbenāparaṃ viseso, appattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. Sace pana, bhikkhave, bhikkhuno maraṇasaññāparicitena cetasā bahulaṃ viharato jīvitanikantiyā cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘subhāvitā me maraṇasaññā, atthi me pubbenāparaṃ viseso, pattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘Maraṇasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Āhāre paṭikūlasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Āhāre paṭikūlasaññāparicitena, bhikkhave, bhikkhuno cetasā bahulaṃ viharato rasataṇhāya cittaṃ patilīyati …pe… upekkhā vā pāṭikulyatā vā saṇṭhāti. Seyyathāpi, bhikkhave, kukkuṭapattaṃ vā nhārudaddulaṃ vā aggimhi pakkhittaṃ patilīyati patikuṭati pativattati, na sampasāriyati. Evamevaṃ kho, bhikkhave, bhikkhuno āhāre paṭikūlasaññāparicitena cetasā bahulaṃ viharato rasataṇhāya cittaṃ patilīyati…pe… upekkhā vā pāṭikulyatā vā saṇṭhāti. ‘‘Sace, bhikkhave, bhikkhuno āhāre paṭikūlasaññāparicitena cetasā bahulaṃ viharato rasataṇhāya cittaṃ anusandahati appaṭikulyatā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘abhāvitā me āhāre paṭikūlasaññā, natthi me pubbenāparaṃ viseso, appattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. Sace pana, bhikkhave, bhikkhuno āhāre paṭikūlasaññāparicitena cetasā bahulaṃ viharato rasataṇhāya cittaṃ patilīyati…pe… upekkhā vā pāṭikulyatā vā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘subhāvitā me āhāre paṭikūlasaññā, atthi me pubbenāparaṃ viseso, pattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘Āhāre paṭikūlasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Sabbaloke anabhiratasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Sabbaloke anabhiratasaññāparicitena, bhikkhave, bhikkhuno cetasā bahulaṃ viharato lokacitresu cittaṃ patilīyati… pe… seyyathāpi bhikkhave…pe… patilīyati patikuṭati pativattati, na sampasāriyati. Evamevaṃ kho, bhikkhave, bhikkhuno sabbaloke anabhiratasaññāparicitena cetasā bahulaṃ viharato lokacitresu cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti. ‘‘Sace, bhikkhave, bhikkhuno sabbaloke anabhiratasaññāparicitena cetasā bahulaṃ viharato lokacitresu cittaṃ anusandahati appaṭikulyatā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘abhāvitā me sabbaloke anabhiratasaññā, natthi me pubbenāparaṃ viseso, appattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. Sace pana, bhikkhave, bhikkhuno sabbaloke anabhiratasaññāparicitena cetasā bahulaṃ viharato lokacitresu cittaṃ patilīyati…pe… upekkhā vā pāṭikulyatā vā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘subhāvitā me sabbaloke anabhiratasaññā, atthi me pubbenāparaṃ viseso, pattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘Sabbaloke anabhiratasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Aniccasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Aniccasaññāparicitena, bhikkhave, bhikkhuno cetasā bahulaṃ viharato lābhasakkārasiloke cittaṃ patilīyati…pe… upekkhā vā pāṭikulyatā vā saṇṭhāti. Seyyathāpi, bhikkhave, kukkuṭapattaṃ vā nhārudaddulaṃ vā aggimhi pakkhittaṃ patilīyati patikuṭati pativattati na sampasāriyati. Evamevaṃ kho, bhikkhave, bhikkhuno aniccasaññāparicitena cetasā bahulaṃ viharato lābhasakkārasiloke cittaṃ patilīyati…pe… upekkhā vā pāṭikulyatā vā saṇṭhāti. ‘‘Sace, bhikkhave, bhikkhuno aniccasaññāparicitena cetasā bahulaṃ viharato lābhasakkārasiloke cittaṃ anusandahati appaṭikulyatā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘abhāvitā me aniccasaññā, natthi me pubbenāparaṃ viseso, appattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. Sace pana, bhikkhave, bhikkhuno aniccasaññāparicitena cetasā bahulaṃ viharato lābhasakkārasiloke cittaṃ patilīyati patikuṭati pativattati, na sampasāriyati upekkhā vā pāṭikulyatā vā saṇṭhāti; veditabbametaṃ, bhikkhave, bhikkhunā ‘subhāvitā me aniccasaññā, atthi me pubbenāparaṃ viseso, pattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘Aniccasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Anicce dukkhasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Anicce dukkhasaññāparicitena, bhikkhave, bhikkhuno cetasā bahulaṃ viharato ālasye kosajje vissaṭṭhiye pamāde ananuyoge apaccavekkhaṇāya tibbā bhayasaññā paccupaṭṭhitā hoti, seyyathāpi, bhikkhave, ukkhittāsike vadhake. ‘‘Sace, bhikkhave, bhikkhuno anicce dukkhasaññāparicitena cetasā bahulaṃ viharato ālasye kosajje vissaṭṭhiye pamāde ananuyoge apaccavekkhaṇāya tibbā bhayasaññā, na paccupaṭṭhitā hoti, seyyathāpi, bhikkhave, ukkhittāsike vadhake. Veditabbametaṃ, bhikkhave, bhikkhunā ‘abhāvitā me anicce dukkhasaññā, natthi me pubbenāparaṃ viseso, appattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. Sace pana, bhikkhave, bhikkhuno anicce dukkhasaññāparicitena cetasā bahulaṃ viharato ālasye kosajje vissaṭṭhiye pamāde ananuyoge apaccavekkhaṇāya tibbā bhayasaññā paccupaṭṭhitā hoti, seyyathāpi, bhikkhave, ukkhittāsike vadhake. Veditabbametaṃ, bhikkhave, bhikkhunā ‘subhāvitā me anicce dukkhasaññā, atthi me pubbenāparaṃ viseso, pattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘Anicce dukkhasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Dukkhe anattasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Dukkhe anattasaññāparicitena, bhikkhave, bhikkhuno cetasā bahulaṃ viharato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānāpagataṃ mānasaṃ hoti vidhāsamatikkantaṃ santaṃ suvimuttaṃ. ‘‘Sace, bhikkhave, bhikkhuno dukkhe anattasaññāparicitena cetasā bahulaṃ viharato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu na ahaṅkāramamaṅkāramānāpagataṃ mānasaṃ hoti vidhāsamatikkantaṃ santaṃ suvimuttaṃ. Veditabbametaṃ, bhikkhave, bhikkhunā ‘abhāvitā me dukkhe anattasaññā, natthi me pubbenāparaṃ viseso, appattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘‘Sace pana, bhikkhave, bhikkhuno dukkhe anattasaññāparicitena cetasā bahulaṃ viharato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānāpagataṃ mānasaṃ hoti vidhāsamatikkantaṃ santaṃ suvimuttaṃ. Veditabbametaṃ, bhikkhave, bhikkhunā ‘subhāvitā me dukkhe anattasaññā, atthi me pubbenāparaṃ viseso, pattaṃ me bhāvanābala’nti. Itiha tattha sampajāno hoti. ‘Dukkhe anattasaññā, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Imā kho, bhikkhave, satta saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these seven perceptions which, when developed and frequently practiced, are of great fruit and great benefit, having Nibbāna as their immersion and Nibbāna as their culmination. Which seven? The perception of foulness, the perception of death, the perception of repugnance in food, the perception of non-delight in the entire world, the perception of impermanence, the perception of suffering in what is impermanent, and the perception of non-self in what is suffering. These seven perceptions, monks, when developed and frequently practiced, are of great fruit and great benefit, having Nibbāna as their immersion and Nibbāna as their culmination.\n\n‘The perception of foulness, monks, when developed and frequently practiced, is of great fruit and great benefit, having Nibbāna as its immersion and Nibbāna as its culmination.’ Indeed, this has been said. And in reference to what was it said? Monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of foulness, his mind recoils from, shrinks away from, and turns back from sexual intercourse; it does not extend towards it, and indifference or repugnance remains established. Just as, monks, a chicken's feather or a strip of sinew, when thrown into a fire, recoils, shrinks away, and turns back, not extending itself. In the same way, monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of foulness, his mind recoils from, shrinks away from, and turns back from sexual intercourse; it does not extend towards it, and indifference or repugnance remains established.\n\nIf, monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of foulness, his mind inclines towards sexual intercourse and non-repugnance remains established; then that bhikkhu should know, ‘My perception of foulness is undeveloped; I have no distinction from before; I have not attained the power of development.’ Thus he becomes clearly comprehending in that regard. But if, monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of foulness, his mind recoils from, shrinks away from, and turns back from sexual intercourse, it does not extend towards it, and indifference or repugnance remains established; then that bhikkhu should know, ‘My perception of foulness is well-developed; I have a distinction from before; I have attained the power of development.’ Thus he becomes clearly comprehending in that regard. That which was said: ‘The perception of foulness, monks, when developed and frequently practiced, is of great fruit and great benefit, having Nibbāna as its immersion and Nibbāna as its culmination,’ it was said in reference to this.\n\n‘The perception of death, monks, when developed and frequently practiced, is of great fruit and great benefit, having Nibbāna as its immersion and Nibbāna as its culmination.’ Indeed, this has been said. And in reference to what was it said? Monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of death, his mind recoils from, shrinks away from, and turns back from the craving for life; it does not extend towards it, and indifference or repugnance remains established. Just as, monks, a chicken's feather or a strip of sinew, when thrown into a fire, recoils, shrinks away, and turns back, not extending itself. In the same way, monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of death, his mind recoils from, shrinks away from, and turns back from the craving for life; it does not extend towards it, and indifference or repugnance remains established.\n\nIf, monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of death, his mind inclines towards the craving for life and non-repugnance remains established; then that bhikkhu should know, ‘My perception of death is undeveloped; I have no distinction from before; I have not attained the power of development.’ Thus he becomes clearly comprehending in that regard. But if, monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of death, his mind recoils from, shrinks away from, and turns back from the craving for life, it does not extend towards it, and indifference or repugnance remains established; then that bhikkhu should know, ‘My perception of death is well-developed; I have a distinction from before; I have attained the power of development.’ Thus he becomes clearly comprehending in that regard. That which was said: ‘The perception of death, monks, when developed and frequently practiced, is of great fruit and great benefit, having Nibbāna as its immersion and Nibbāna as its culmination,’ it was said in reference to this.\n\n‘The perception of repugnance in food, monks, when developed and frequently practiced, is of great fruit and great benefit, having Nibbāna as its immersion and Nibbāna as its culmination.’ Indeed, this has been said. And in reference to what was it said? Monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of repugnance in food, his mind recoils from, shrinks away from, and turns back from the craving for tastes; it does not extend towards it, and indifference or repugnance remains established. Just as, monks, a chicken's feather or a strip of sinew, when thrown into a fire, recoils, shrinks away, and turns back, not extending itself. In the same way, monks, when a bhikkhu dwells frequently with a mind familiarized with the perception of repugnance in food, his mind recoils from, shrinks away from, and turns back from the craving for tastes; it does not extend towards it, and indifference or repugnance remains established.\n\nMonks, if a monk, while dwelling much with a mind accustomed to the perception of repulsiveness in food, finds that his mind flows towards craving for flavors and non-repulsiveness becomes established, then, monks, he should understand this: 'My perception of repulsiveness in food is undeveloped; there is no difference in me between before and after; the power of my spiritual development has not been attained.' Thus, in that instance, he is clearly comprehending. But, monks, if a monk, while dwelling much with a mind accustomed to the perception of repulsiveness in food, finds that his mind recoils from craving for flavors, shrinks, shrivels, rolls back, and does not spread out, and either equanimity or repulsiveness becomes established, then, monks, he should understand this: 'My perception of repulsiveness in food is well-developed; there is a difference in me between before and after; the power of my spiritual development has been attained.' Thus, in that instance, he is clearly comprehending. Therefore, what was said—'The perception of repulsiveness in food, monks, when developed and repeatedly practiced, is of great fruit, of great benefit, culminates in the Deathless, and has the Deathless as its destination'—was said with reference to this.\n\nFurthermore, what was said—'The perception of non-delight in the entire world, monks, when developed and repeatedly practiced, is of great fruit, of great benefit, culminates in the Deathless, and has the Deathless as its destination'—was said. What was this said with reference to? Monks, if a monk, while dwelling much with a mind accustomed to the perception of non-delight in the entire world, finds that his mind recoils from the fascinations of the world, shrinks, shrivels, rolls back, and does not spread out. Just as, monks, something recoils, shrivels, rolls back, and does not spread out. In the same way, monks, if a monk, while dwelling much with a mind accustomed to the perception of non-delight in the entire world, finds that his mind recoils from the fascinations of the world, shrinks, shrivels, rolls back, does not spread out, and either equanimity or repulsiveness becomes established.\n\nMonks, if a monk, while dwelling much with a mind accustomed to the perception of non-delight in the entire world, finds that his mind flows towards the fascinations of the world and non-repulsiveness becomes established, then, monks, he should understand this: 'My perception of non-delight in the entire world is undeveloped; there is no difference in me between before and after; the power of my spiritual development has not been attained.' Thus, in that instance, he is clearly comprehending. But, monks, if a monk, while dwelling much with a mind accustomed to the perception of non-delight in the entire world, finds that his mind recoils from the fascinations of the world, shrinks, shrivels, rolls back, and does not spread out, and either equanimity or repulsiveness becomes established, then, monks, he should understand this: 'My perception of non-delight in the entire world is well-developed; there is a difference in me between before and after; the power of my spiritual development has been attained.' Thus, in that instance, he is clearly comprehending. Therefore, what was said—'The perception of non-delight in the entire world, monks, when developed and repeatedly practiced, is of great fruit, of great benefit, culminates in the Deathless, and has the Deathless as its destination'—was said with reference to this.\n\nFurthermore, what was said—'The perception of impermanence, monks, when developed and repeatedly practiced, is of great fruit, of great benefit, culminates in the Deathless, and has the Deathless as its destination'—was said. What was this said with reference to? Monks, if a monk, while dwelling much with a mind accustomed to the perception of impermanence, finds that his mind recoils from gain, honor, and praise, shrinks, shrivels, rolls back, and does not spread out, and either equanimity or repulsiveness becomes established. Just as, monks, a chicken's feather or a piece of sinew thrown into a fire recoils, shrivels, rolls back, and does not spread out. In the same way, monks, if a monk, while dwelling much with a mind accustomed to the perception of impermanence, finds that his mind recoils from gain, honor, and praise, shrinks, shrivels, rolls back, and does not spread out, and either equanimity or repulsiveness becomes established.\n\nMonks, if a monk, while dwelling much with a mind accustomed to the perception of impermanence, finds that his mind flows towards gain, honor, and praise and non-repulsiveness becomes established, then, monks, he should understand this: 'My perception of impermanence is undeveloped; there is no difference in me between before and after; the power of my spiritual development has not been attained.' Thus, in that instance, he is clearly comprehending. But, monks, if a monk, while dwelling much with a mind accustomed to the perception of impermanence, finds that his mind recoils from gain, honor, and praise, shrinks, shrivels, rolls back, and does not spread out, and either equanimity or repulsiveness becomes established, then, monks, he should understand this: 'My perception of impermanence is well-developed; there is a difference in me between before and after; the power of my spiritual development has been attained.' Thus, in that instance, he is clearly comprehending. Therefore, what was said—'The perception of impermanence, monks, when developed and repeatedly practiced, is of great fruit, of great benefit, culminates in the Deathless, and has the Deathless as its destination'—was said with reference to this.\n\nFurthermore, what was said—'The perception of suffering in impermanence, monks, when developed and repeatedly practiced, is of great fruit, of great benefit, culminates in the Deathless, and has the Deathless as its destination'—was said. What was this said with reference to? Monks, if a monk, while dwelling much with a mind accustomed to the perception of suffering in impermanence, finds that a keen perception of danger is established concerning idleness, laziness, laxity, heedlessness, non-engagement in practice, and non-reflection, just as, monks, one would perceive danger from an assassin with a raised sword.\n\nIf, monks, for a bhikkhu dwelling frequently with a mind familiarized with the perception of suffering in impermanence, a strong perception of danger regarding idleness, laziness, slackness, heedlessness, lack of application, and lack of reflection is not present, just as, monks, if one were faced with an assassin with a raised sword. This, monks, should be understood by that bhikkhu: 'My perception of suffering in impermanence is undeveloped, there is no special progress for me compared to before, the power of development has not been attained by me.' Thus, he is clearly comprehending in that regard.\n\nBut if, monks, for a bhikkhu dwelling frequently with a mind familiarized with the perception of suffering in impermanence, a strong perception of danger regarding idleness, laziness, slackness, heedlessness, lack of application, and lack of reflection is present, just as, monks, if one were faced with an assassin with a raised sword. This, monks, should be understood by that bhikkhu: 'My perception of suffering in impermanence is well-developed, there is special progress for me compared to before, the power of development has been attained by me.' Thus, he is clearly comprehending in that regard. 'The perception of suffering in impermanence, monks, when developed and frequently practiced, is of great fruit and great benefit, culminating in the Deathless, ending in the Deathless,' it was said. It was with reference to this that it was said.\n\n'The perception of non-self in suffering, monks, when developed and frequently practiced, is of great fruit and great benefit, culminating in the Deathless, ending in the Deathless,' it was said. With reference to what was this said? For a bhikkhu dwelling frequently with a mind familiarized with the perception of non-self in suffering, in this conscious body and in all external signs (phenomena), the mind becomes free from 'I-making,' 'mine-making,' and conceit, transcending all modes of measuring, peaceful, and well-liberated.\n\nIf, monks, for a bhikkhu dwelling frequently with a mind familiarized with the perception of non-self in suffering, in this conscious body and in all external signs (phenomena), the mind does not become free from 'I-making,' 'mine-making,' and conceit, transcending all modes of measuring, peaceful, and well-liberated. This, monks, should be understood by that bhikkhu: 'My perception of non-self in suffering is undeveloped, there is no special progress for me compared to before, the power of development has not been attained by me.' Thus, he is clearly comprehending in that regard.\n\nBut if, monks, for a bhikkhu dwelling frequently with a mind familiarized with the perception of non-self in suffering, in this conscious body and in all external signs (phenomena), the mind does become free from 'I-making,' 'mine-making,' and conceit, transcending all modes of measuring, peaceful, and well-liberated. This, monks, should be understood by that bhikkhu: 'My perception of non-self in suffering is well-developed, there is special progress for me compared to before, the power of development has been attained by me.' Thus, he is clearly comprehending in that regard. 'The perception of non-self in suffering, monks, when developed and frequently practiced, is of great fruit and great benefit, culminating in the Deathless, ending in the Deathless,' it was said. It was with reference to this that it was said.\n\n'Indeed, monks, these seven perceptions, when developed and frequently practiced, are of great fruit and great benefit, culminating in the Deathless, ending in the Deathless.'",
      "sinhala": "භික්ෂූනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලද මේ සංඥා සත මහත් ඵල ඇත්තාහ, මහත් ආනිශංස ඇත්තාහ, අමෘතය අවසාන කොට ඇත්තාහ, අමෘතයෙහි පිහිටි ස්වU+200Dභාව ඇත්තාහ. කවර ඒවා සතක්ද? අසුභ සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි ඇලීම් රහිත සංඥාව, අනිත්‍ය සංඥාව, අනිත්‍ය වූ දේ තුළ දුක්ඛ සංඥාව, දුක්ඛ වූ දේ තුළ අනාත්ම සංඥාව යන මේවාය. භික්ෂූනි, මේ සංඥා සත වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහත් ඵල ඇත්තාහ, මහත් ආනිශංස ඇත්තාහ, අමෘතය අවසාන කොට ඇත්තාහ, අමෘතයෙහි පිහිටි ස්වU+200Dභාව ඇත්තාහ.\n\n'භික්ෂූනි, අසුභ සංඥාව වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහත් ඵල ඇත්තී, මහත් ආනිශංස ඇත්තී, අමෘතය අවසාන කොට ඇත්තී, අමෘතයෙහි පිහිටි ස්වU+200Dභාව ඇත්තී වේ' යනුවෙන් මේ කරුණ දේශනා කරන ලද්දේය. මේ කරුණ කවරක් අරභයා දේශනා කරන ලද්දේද? භික්ෂූනි, අසුභ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට මෙථුනධර්මයට පැමිණීමෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි. උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී. භික්ෂූනි, යම්සේ කිකිළි පිහාටුවක් හෝ නහර කැබැල්ලක් හෝ ගින්නෙහි දැමූ කල්හි හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි ද, එසෙයින්ම, භික්ෂූනි, අසුභ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට මෙථුනධර්මයට පැමිණීමෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි. උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී.\n\nභික්ෂූනි, යම් හෙයකින් අසුභ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට මෙථුනධර්මයට පැමිණීමෙහිලා සිත ඒ කෙරෙහි ඇලෙන්නේ නම්, පිළිකුලක් රහිතව පවතින්නේ නම්; භික්ෂූනි, ඒ භික්ෂූU+200Dව විසින් මෙසේ දත යුතුය: ‘මාගේ අසුභ සංඥාව වඩන ලද්දක් නොවේ. පෙරට වඩා මා හට කිසිදු විශේෂයක් නැත. මා හට භාවනා බලය නොලැබී තිබේ’ යනුයි. මෙසේ ඔහු එහිදී සම්ප්‍රU+200Dඥාවෙන් යුක්ත වෙයි. එහෙත්, භික්ෂූනි, යම් හෙයකින් අසුභ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට මෙථුනධර්මයට පැමිණීමෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි, උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී නම්; භික්ෂූනි, ඒ භික්ෂූU+200Dව විසින් මෙසේ දත යුතුය: ‘මාගේ අසුභ සංඥාව මැනවින් වඩන ලද්දීය. පෙරට වඩා මා හට විශේෂයක් ඇත. මා හට භාවනා බලය ලැබී තිබේ’ යනුයි. මෙසේ ඔහු එහිදී සම්ප්‍රU+200Dඥාවෙන් යුක්ත වෙයි. 'භික්ෂූනි, අසුභ සංඥාව වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහත් ඵල ඇත්තී, මහත් ආනිශංස ඇත්තී, අමෘතය අවසාන කොට ඇත්තී, අමෘතයෙහි පිහිටි ස්වU+200Dභාව ඇත්තී වේ' යනුවෙන් යමක් දේශනා කරන ලද්දේ ද, ඒ කරුණ මෙය අරභයා දේශනා කරන ලද්දේය.\n\n'භික්ෂූනි, මරණ සංඥාව වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහත් ඵල ඇත්තී, මහත් ආනිශංස ඇත්තී, අමෘතය අවසාන කොට ඇත්තී, අමෘතයෙහි පිහිටි ස්වU+200Dභාව ඇත්තී වේ' යනුවෙන් මේ කරුණ දේශනා කරන ලද්දේය. මේ කරුණ කවරක් අරභයා දේශනා කරන ලද්දේද? භික්ෂූනි, මරණ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට ජීවිත තෘෂ්ණාවෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි. උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී. භික්ෂූනි, යම්සේ කිකිළි පිහාටුවක් හෝ නහර කැබැල්ලක් හෝ ගින්නෙහි දැමූ කල්හි හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි ද, එසෙයින්ම, භික්ෂූනි, මරණ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට ජීවිත තෘෂ්ණාවෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි. උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී.\n\nභික්ෂූනි, යම් හෙයකින් මරණ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට ජීවිත තෘෂ්ණාවෙහිලා සිත ඒ කෙරෙහි ඇලෙන්නේ නම්, පිළිකුලක් රහිතව පවතින්නේ නම්; භික්ෂූනි, ඒ භික්ෂූU+200Dව විසින් මෙසේ දත යුතුය: ‘මාගේ මරණ සංඥාව වඩන ලද්දක් නොවේ. පෙරට වඩා මා හට කිසිදු විශේෂයක් නැත. මා හට භාවනා බලය නොලැබී තිබේ’ යනුයි. මෙසේ ඔහු එහිදී සම්ප්‍රU+200Dඥාවෙන් යුක්ත වෙයි. එහෙත්, භික්ෂූනි, යම් හෙයකින් මරණ සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට ජීවිත තෘෂ්ණාවෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි, උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී නම්; භික්ෂූනි, ඒ භික්ෂූU+200Dව විසින් මෙසේ දත යුතුය: ‘මාගේ මරණ සංඥාව මැනවින් වඩන ලද්දීය. පෙරට වඩා මා හට විශේෂයක් ඇත. මා හට භාවනා බලය ලැබී තිබේ’ යනුයි. මෙසේ ඔහු එහිදී සම්ප්‍රU+200Dඥාවෙන් යුක්ත වෙයි. 'භික්ෂූනි, මරණ සංඥාව වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහත් ඵල ඇත්තී, මහත් ආනිශංස ඇත්තී, අමෘතය අවසාන කොට ඇත්තී, අමෘතයෙහි පිහිටි ස්වU+200Dභාව ඇත්තී වේ' යනුවෙන් යමක් දේශනා කරන ලද්දේ ද, ඒ කරුණ මෙය අරභයා දේශනා කරන ලද්දේය.\n\n'භික්ෂූනි, ආහාරයෙහි පිළිකුල් සංඥාව වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහත් ඵල ඇත්තී, මහත් ආනිශංස ඇත්තී, අමෘතය අවසාන කොට ඇත්තී, අමෘතයෙහි පිහිටි ස්වU+200Dභාව ඇත්තී වේ' යනුවෙන් මේ කරුණ දේශනා කරන ලද්දේය. මේ කරුණ කවරක් අරභයා දේශනා කරන ලද්දේද? භික්ෂූනි, ආහාරයෙහි පිළිකුල් සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට රස තෘෂ්ණාවෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි. උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී. භික්ෂූනි, යම්සේ කිකිළි පිහාටුවක් හෝ නහර කැබැල්ලක් හෝ ගින්නෙහි දැමූ කල්හි හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි ද, එසෙයින්ම, භික්ෂූනි, ආහාරයෙහි පිළිකුල් සංඥාවෙන් මනාකොට පුරුදු කරන ලද සිත් ඇති භික්ෂූU+200Dව බහුල වශයෙන් වාසය කරන විට රස තෘෂ්ණාවෙහිලා සිත හැකිළෙයි, හැකිලෙයි, ඉවතට හැරෙයි, පැතිර නොයයි. උපේක්ෂාවක් හෝ පිළිකුලක් හෝ පිහිටා පවතී.\n\nභික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් විසින් ආහාරයෙහි පිළිකුල් සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන කල්හි, ඔහුගේ සිත රස තණ්හාවට පැතිරී යන්නේ නම්, පිළිකුල් නොවීමක් තහවුරු වන්නේ නම්, භික්ෂූන් වහන්ස, ඒ භික්ෂුව විසින් 'මා විසින් ආහාරයෙහි පිළිකුල් සංඥාව වඩන ලද්දේ නැත, මට පෙරට වඩා විශේෂයක් නැත, මා විසින් භාවනා බලය නොලැබී ඇත' යනුවෙන් දත යුතුයි. එහිදී ඔහු මනා සිහියෙන් යුක්ත වෙයි. භික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් විසින් ආහාරයෙහි පිළිකුල් සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන කල්හි, ඔහුගේ සිත රස තණ්හාවෙන් බැසගනී නම්, හැකිළී යයි නම්, පසුබසියි නම්, නොපැතිරෙයි නම්, උපේක්ෂාව හෝ පිළිකුල හෝ තහවුරු වන්නේ නම්, භික්ෂූන් වහන්ස, ඒ භික්ෂුව විසින් 'මා විසින් ආහාරයෙහි පිළිකුල් සංඥාව මැනවින් වඩන ලද්දේය, මට පෙරට වඩා විශේෂයක් ඇත, මා විසින් භාවනා බලය ලැබී ඇත' යනුවෙන් දත යුතුයි. එහිදී ඔහු මනා සිහියෙන් යුක්ත වෙයි. 'භික්ෂූන් වහන්ස, ආහාරයෙහි පිළිකුල් සංඥාව වඩන ලද්දේ, බහුල වශයෙන් වඩන ලද්දේ මහත් ඵල මහානිසංස ඇති, අමෘතයෙහි පිහිටි, අමෘතයෙන් කෙළවර වන (නිවනට නැඹුරු වූවක්) වන්නේය' යනුවෙන් යමක් කියන ලද්දේ ද, එය අරභයා මෙය කියන ලද්දකි.\n\nභික්ෂූන් වහන්ස, 'සියලු ලෝකයෙහි නොඇලෙන සංඥාව වඩන ලද්දේ, බහුල වශයෙන් වඩන ලද්දේ මහත් ඵල මහානිසංස ඇති, අමෘතයෙහි පිහිටි, අමෘතයෙන් කෙළවර වන (නිවනට නැඹුරු වූවක්) වන්නේය' යනුවෙන් ද මෙය කියන ලදී. මෙය කුමක් අරභයා කියන ලද්දේද? භික්ෂූන් වහන්ස, සියලු ලෝකයෙහි නොඇලෙන සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන භික්ෂුවකගේ සිත ලෝකයේ විසිතුරු දේ කෙරෙහි බැසගනී, හැකිළී යයි, පසුබසියි, නොපැතිරෙයි. භික්ෂූන් වහන්ස, යම්සේ නම්, කුකුළු පිහාටුවක් හෝ නහර කැබැල්ලක් හෝ ගින්නෙහි දමන ලද්දේ බැසගනී, හැකිළී යයි, පසුබසියි, නොපැතිරෙයි ද, එසේම, භික්ෂූන් වහන්ස, සියලු ලෝකයෙහි නොඇලෙන සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන භික්ෂුවකගේ සිත ලෝකයේ විසිතුරු දේ කෙරෙහි බැසගනී, හැකිළී යයි, පසුබසියි, නොපැතිරෙයි, උපේක්ෂාව හෝ පිළිකුල හෝ තහවුරු වෙයි.\n\nභික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් විසින් සියලු ලෝකයෙහි නොඇලෙන සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන කල්හි, ඔහුගේ සිත ලෝකයේ විසිතුරු දේ කෙරෙහි පැතිරී යන්නේ නම්, පිළිකුල් නොවීමක් තහවුරු වන්නේ නම්, භික්ෂූන් වහන්ස, ඒ භික්ෂුව විසින් 'මා විසින් සියලු ලෝකයෙහි නොඇලෙන සංඥාව වඩන ලද්දේ නැත, මට පෙරට වඩා විශේෂයක් නැත, මා විසින් භාවනා බලය නොලැබී ඇත' යනුවෙන් දත යුතුයි. එහිදී ඔහු මනා සිහියෙන් යුක්ත වෙයි. භික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් විසින් සියලු ලෝකයෙහි නොඇලෙන සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන කල්හි, ඔහුගේ සිත ලෝකයේ විසිතුරු දේ කෙරෙහි බැසගනී නම්, හැකිළී යයි නම්, පසුබසියි නම්, නොපැතිරෙයි නම්, උපේක්ෂාව හෝ පිළිකුල හෝ තහවුරු වන්නේ නම්, භික්ෂූන් වහන්ස, ඒ භික්ෂුව විසින් 'මා විසින් සියලු ලෝකයෙහි නොඇලෙන සංඥාව මැනවින් වඩන ලද්දේය, මට පෙරට වඩා විශේෂයක් ඇත, මා විසින් භාවනා බලය ලැබී ඇත' යනුවෙන් දත යුතුයි. එහිදී ඔහු මනා සිහියෙන් යුක්ත වෙයි. 'භික්ෂූන් වහන්ස, සියලු ලෝකයෙහි නොඇලෙන සංඥාව වඩන ලද්දේ, බහුල වශයෙන් වඩන ලද්දේ මහත් ඵල මහානිසංස ඇති, අමෘතයෙහි පිහිටි, අමෘතයෙන් කෙළවර වන (නිවනට නැඹුරු වූවක්) වන්නේය' යනුවෙන් යමක් කියන ලද්දේ ද, එය අරභයා මෙය කියන ලද්දකි.\n\nභික්ෂූන් වහන්ස, 'අනිත්‍ය සංඥාව වඩන ලද්දේ, බහුල වශයෙන් වඩන ලද්දේ මහත් ඵල මහානිසංස ඇති, අමෘතයෙහි පිහිටි, අමෘතයෙන් කෙළවර වන (නිවනට නැඹුරු වූවක්) වන්නේය' යනුවෙන් ද මෙය කියන ලදී. මෙය කුමක් අරභයා කියන ලද්දේද? භික්ෂූන් වහන්ස, අනිත්‍ය සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන භික්ෂුවකගේ සිත ලාභ, සත්කාර, කීර්ති ප්‍රශංසා කෙරෙහි බැසගනී, හැකිළී යයි, පසුබසියි, නොපැතිරෙයි, උපේක්ෂාව හෝ පිළිකුල හෝ තහවුරු වෙයි. භික්ෂූන් වහන්ස, යම්සේ නම්, කුකුළු පිහාටුවක් හෝ නහර කැබැල්ලක් හෝ ගින්නෙහි දමන ලද්දේ බැසගනී, හැකිළී යයි, පසුබසියි, නොපැතිරෙයි ද, එසේම, භික්ෂූන් වහන්ස, අනිත්‍ය සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන භික්ෂුවකගේ සිත ලාභ, සත්කාර, කීර්ති ප්‍රශංසා කෙරෙහි බැසගනී, හැකිළී යයි, පසුබසියි, නොපැතිරෙයි, උපේක්ෂාව හෝ පිළිකුල හෝ තහවුරු වෙයි.\n\nභික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් විසින් අනිත්‍ය සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන කල්හි, ඔහුගේ සිත ලාභ, සත්කාර, කීර්ති ප්‍රශංසා කෙරෙහි පැතිරී යන්නේ නම්, පිළිකුල් නොවීමක් තහවුරු වන්නේ නම්, භික්ෂූන් වහන්ස, ඒ භික්ෂුව විසින් 'මා විසින් අනිත්‍ය සංඥාව වඩන ලද්දේ නැත, මට පෙරට වඩා විශේෂයක් නැත, මා විසින් භාවනා බලය නොලැබී ඇත' යනුවෙන් දත යුතුයි. එහිදී ඔහු මනා සිහියෙන් යුක්ත වෙයි. භික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් විසින් අනිත්‍ය සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන කල්හි, ඔහුගේ සිත ලාභ, සත්කාර, කීර්ති ප්‍රශංසා කෙරෙහි බැසගනී නම්, හැකිළී යයි නම්, පසුබසියි නම්, නොපැතිරෙයි නම්, උපේක්ෂාව හෝ පිළිකුල හෝ තහවුරු වන්නේ නම්, භික්ෂූන් වහන්ස, ඒ භික්ෂුව විසින් 'මා විසින් අනිත්‍ය සංඥාව මැනවින් වඩන ලද්දේය, මට පෙරට වඩා විශේෂයක් ඇත, මා විසින් භාවනා බලය ලැබී ඇත' යනුවෙන් දත යුතුයි. එහිදී ඔහු මනා සිහියෙන් යුක්ත වෙයි. 'භික්ෂූන් වහන්ස, අනිත්‍ය සංඥාව වඩන ලද්දේ, බහුල වශයෙන් වඩන ලද්දේ මහත් ඵල මහානිසංස ඇති, අමෘතයෙහි පිහිටි, අමෘතයෙන් කෙළවර වන (නිවනට නැඹුරු වූවක්) වන්නේය' යනුවෙන් යමක් කියන ලද්දේ ද, එය අරභයා මෙය කියන ලද්දකි.\n\nභික්ෂූන් වහන්ස, 'අනිත්‍යයෙහි දුක් සංඥාව වඩන ලද්දේ, බහුල වශයෙන් වඩන ලද්දේ මහත් ඵල මහානිසංස ඇති, අමෘතයෙහි පිහිටි, අමෘතයෙන් කෙළවර වන (නිවනට නැඹුරු වූවක්) වන්නේය' යනුවෙන් ද මෙය කියන ලදී. මෙය කුමක් අරභයා කියන ලද්දේද? භික්ෂූන් වහන්ස, අනිත්‍යයෙහි දුක් සංඥාවෙන් හුරු කරන ලද සිතින් නිතර වසන භික්ෂුවකට ආලස්‍යය, කෝසජ්ජය, සිතෙහි විස්සට්ඨිය, ප්‍රමාදය, නොපසුබස්නා වීරියෙන් යුක්ත නොවීම, නැවත නැවත නොබැලීම යන මේවා කෙරෙහි කඩුව ඔසවාගත් ඝාතකයකු දුටු කල ඇතිවන භයක් මෙන්, දැඩි භය සංඥාවක් පැමිණ සිටියි.\n\nභික්ෂූන්‍ වහන්සේලාණෙනි, යම්කිසි භික්ෂුවක් අනිත්‍යයෙහි දුක්ඛසංඥාවෙන් පුරුදු කරන ලද සිතින් නිතර වාසය කරන කල්හි, කම්මැලිභාවය, අලසභාවය, ලිහිල් බව, ප්‍රමාදය, නොඇලීම සහ නොවිමසීම යන මේවා කෙරෙහි කඩු උස්සාගෙන සිටින මිනීමරුවෙකුගෙන් මෙන් තීව්‍ර භයසංඥාවක් පහළ නොවන්නේ නම්, භික්ෂූන්‍ වහන්සේලාණෙනි, ‘මා විසින් අනිත්‍යයෙහි දුක්ඛසංඥාව නොවැඩූ බවත්, පෙරට වඩා කිසිදු විශේෂ දියුණුවක් මා තුළ නැති බවත්, භාවනා බලය මා විසින් නොලැබූ බවත්’ මේ භික්ෂුව විසින් දත යුතුයි. මෙසේ ඔහු එහිදී මනාකොට දනී.\n\nඑහෙත් භික්ෂූන්‍ වහන්සේලාණෙනි, යම්කිසි භික්ෂුවක් අනිත්‍යයෙහි දුක්ඛසංඥාවෙන් පුරුදු කරන ලද සිතින් නිතර වාසය කරන කල්හි, කම්මැලිභාවය, අලසභාවය, ලිහිල් බව, ප්‍රමාදය, නොඇලීම සහ නොවිමසීම යන මේවා කෙරෙහි කඩු උස්සාගෙන සිටින මිනීමරුවෙකුගෙන් මෙන් තීව්‍ර භයසංඥාවක් පහළ වන්නේ නම්, භික්ෂූන්‍ වහන්සේලාණෙනි, ‘මා විසින් අනිත්‍යයෙහි දුක්ඛසංඥාව මනාකොට වැඩූ බවත්, පෙරට වඩා විශේෂ දියුණුවක් මා තුළ ඇති බවත්, භාවනා බලය මා විසින් ලැබූ බවත්’ මේ භික්ෂුව විසින් දත යුතුයි. මෙසේ ඔහු එහිදී මනාකොට දනී.\n\n‘භික්ෂූන්‍ වහන්සේලාණෙනි, අනිත්‍යයෙහි දුක්ඛසංඥාව වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී මහත් ඵල මහානිසංස ඇති වෙයි. එය අමෘතයට ඇතුළත් වූවකි. අමෘතයෙන් කෙළවර වූවකි’ යැයි යමක් කියන ලද්දේද, එය මේ කරුණ නිසා කියන ලද්දකි.\n\n‘භික්ෂූන්‍ වහන්සේලාණෙනි, දුකෙහි අනාත්ම සංඥාව වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී මහත් ඵල මහානිසංස ඇති වෙයි. එය අමෘතයට ඇතුළත් වූවකි. අමෘතයෙන් කෙළවර වූවකි’ යැයි ද කියන ලද්දකි. එය කුමක් නිසා කියන ලද්දක්ද? භික්ෂූන්‍ වහන්සේලාණෙනි, දුකෙහි අනාත්ම සංඥාවෙන් පුරුදු කරන ලද සිතින් නිතර වාසය කරන භික්ෂුවකට සවිඥාණක වූ මේ ශරීරයෙහිද, පිටත සියලු අරමුණු කෙරෙහිද අහංකාර, මමංකාර, මානයන්ගෙන් පහවූ, සංසන්දන ඉක්මවා ගිය, ශාන්ත වූ, මනාකොට විමුක්ත වූ මනසක් වෙයි.\n\nභික්ෂූන්‍ වහන්සේලාණෙනි, යම්කිසි භික්ෂුවක් දුකෙහි අනාත්ම සංඥාවෙන් පුරුදු කරන ලද සිතින් නිතර වාසය කරන කල්හි, සවිඥාණක වූ මේ ශරීරයෙහිද, පිටත සියලු අරමුණු කෙරෙහිද අහංකාර, මමංකාර, මානයන්ගෙන් පහවූ, සංසන්දන ඉක්මවා ගිය, ශාන්ත වූ, මනාකොට විමුක්ත වූ මනසක් නොවන්නේ නම්, භික්ෂූන්‍ වහන්සේලාණෙනි, ‘මා විසින් දුකෙහි අනාත්ම සංඥාව නොවැඩූ බවත්, පෙරට වඩා කිසිදු විශේෂ දියුණුවක් මා තුළ නැති බවත්, භාවනා බලය මා විසින් නොලැබූ බවත්’ මේ භික්ෂුව විසින් දත යුතුයි. මෙසේ ඔහු එහිදී මනාකොට දනී.\n\nඑහෙත් භික්ෂූන්‍ වහන්සේලාණෙනි, යම්කිසි භික්ෂුවක් දුකෙහි අනාත්ම සංඥාවෙන් පුරුදු කරන ලද සිතින් නිතර වාසය කරන කල්හි, සවිඥාණක වූ මේ ශරීරයෙහිද, පිටත සියලු අරමුණු කෙරෙහිද අහංකාර, මමංකාර, මානයන්ගෙන් පහවූ, සංසන්දන ඉක්මවා ගිය, ශාන්ත වූ, මනාකොට විමුක්ත වූ මනසක් වන්නේ නම්, භික්ෂූන්‍ වහන්සේලාණෙනි, ‘මා විසින් දුකෙහි අනාත්ම සංඥාව මනාකොට වැඩූ බවත්, පෙරට වඩා විශේෂ දියුණුවක් මා තුළ ඇති බවත්, භාවනා බලය මා විසින් ලැබූ බවත්’ මේ භික්ෂුව විසින් දත යුතුයි. මෙසේ ඔහු එහිදී මනාකොට දනී.\n\n‘භික්ෂූන්‍ වහන්සේලාණෙනි, දුකෙහි අනාත්ම සංඥාව වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී මහත් ඵල මහානිසංස ඇති වෙයි. එය අමෘතයට ඇතුළත් වූවකි. අමෘතයෙන් කෙළවර වූවකි’ යැයි යමක් කියන ලද්දේද, එය මේ කරුණ නිසා කියන ලද්දකි.\n\nභික්ෂූන්‍ වහන්සේලාණෙනි, මේ සත් සංඥාවන්‍ වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල මහත් ඵල මහානිසංස ඇති වෙයි. ඒවා අමෘතයට ඇතුළත් වූ, අමෘතයෙන් කෙළවර වූ ධර්මයෝ වෙති.",
      "paliTitle": "Dutiyasaññāsuttaṃ",
      "englishTitle": "The Second Discourse on Perception",
      "sinhalaTitle": "දෙවන සඤ්ඤා සූත්‍රය"
    },
    {
      "number": 50,
      "pali": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘bhavampi no gotamo brahmacārī paṭijānātī’’ti? ‘‘Yañhi taṃ, brāhmaṇa, sammā vadamāno vadeyya – ‘akhaṇḍaṃ acchiddaṃ asabalaṃ akammāsaṃ paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ caratī’ti, mameva taṃ, brāhmaṇa, sammā vadamāno vadeyya – ‘ahañhi, brāhmaṇa, akhaṇḍaṃ acchiddaṃ asabalaṃ akammāsaṃ paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carāmī’’’ti. ‘‘Kiṃ pana, bho gotama, brahmacariyassa khaṇḍampi chiddampi sabalampi kammāsampī’’ti? ‘‘Idha, brāhmaṇa, ekacco samaṇo vā brāhmaṇo vā sammā brahmacārī paṭijānamāno na heva kho mātugāmena saddhiṃ dvayaṃdvayasamāpattiṃ samāpajjati; api ca kho mātugāmassa ucchādanaparimaddananhāpanasambāhanaṃ sādiyati. So taṃ assādeti [so tadassādeti (sī.)], taṃ nikāmeti, tena ca vittiṃ āpajjati. Idampi kho, brāhmaṇa, brahmacariyassa khaṇḍampi chiddampi sabalampi kammāsampi. Ayaṃ vuccati, brāhmaṇa, aparisuddhaṃ brahmacariyaṃ carati, saṃyutto methunena saṃyogena na parimuccati jātiyā jarāya maraṇena [jarāmaraṇena (sī. syā.)] sokehi paridevehi dukkhehi domanassehi upāyāsehi, na parimuccati dukkhasmāti vadāmi. ‘‘Puna caparaṃ, brāhmaṇa, idhekacco samaṇo vā brāhmaṇo vā sammā brahmacārī paṭijānamāno na heva kho mātugāmena saddhiṃ dvayaṃdvayasamāpattiṃ samāpajjati, napi mātugāmassa ucchādanaparimaddananhāpanasambāhanaṃ sādiyati; api ca kho mātugāmena saddhiṃ sañjagghati saṃkīḷati saṃkelāyati…pe… napi mātugāmena saddhiṃ sañjagghati saṃkīḷati saṃkelāyati; api ca kho mātugāmassa cakkhunā cakkhuṃ upanijjhāyati pekkhati…pe… napi mātugāmassa cakkhunā cakkhuṃ upanijjhāyati pekkhati; api ca kho mātugāmassa saddaṃ suṇāti tirokuṭṭaṃ vā tiropākāraṃ vā hasantiyā vā bhaṇantiyā vā gāyantiyā vā rodantiyā vā…pe… napi mātugāmassa saddaṃ suṇāti tirokuṭṭaṃ vā tiropākāraṃ vā hasantiyā vā bhaṇantiyā vā gāyantiyā vā rodantiyā vā; api ca kho yānissa tāni pubbe mātugāmena saddhiṃ hasitalapitakīḷitāni tāni anussarati…pe… napi yānissa tāni pubbe mātugāmena saddhiṃ hasitalapitakīḷitāni tāni anussarati; api ca kho passati gahapatiṃ vā gahapatiputtaṃ vā pañcahi kāmaguṇehi samappitaṃ samaṅgībhūtaṃ paricārayamānaṃ…pe… napi passati gahapatiṃ vā gahapatiputtaṃ vā pañcahi kāmaguṇehi samappitaṃ samaṅgībhūtaṃ paricārayamānaṃ; api ca kho aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vāti. So taṃ assādeti, taṃ nikāmeti, tena ca vittiṃ āpajjati. Idampi kho, brāhmaṇa, brahmacariyassa khaṇḍampi chiddampi sabalampi kammāsampi. Ayaṃ vuccati, brāhmaṇa, aparisuddhaṃ brahmacariyaṃ carati saṃyutto methunena saṃyogena, na parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, na parimuccati dukkhasmāti vadāmi. ‘‘Yāvakīvañcāhaṃ, brāhmaṇa, imesaṃ sattannaṃ methunasaṃyogānaṃ aññataraññataramethunasaṃyogaṃ [aññataraṃ methunasaṃyogaṃ (sī. syā.)] attani appahīnaṃ samanupassiṃ, neva tāvāhaṃ, brāhmaṇa, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddhoti paccaññāsiṃ [abhisambuddho paccaññāsiṃ (sī. syā.)]. ‘‘Yato ca khohaṃ, brāhmaṇa, imesaṃ sattannaṃ methunasaṃyogānaṃ aññataraññataramethunasaṃyogaṃ attani appahīnaṃ na samanupassiṃ, athāhaṃ, brāhmaṇa, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddhoti paccaññāsiṃ. ‘Ñāṇañca pana me dassanaṃ udapādi, akuppā me vimutti [cetovimutti (sī. ka.)], ayamantimā jāti, natthi dāni punabbhavo’’’ti. Evaṃ vutte jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama; abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Sattamaṃ.",
      "english": "Then the brahmin Jāṇussoṇi approached the Blessed One. Having approached, he exchanged friendly greetings with the Blessed One. After exchanging courteous and memorable greetings, he sat down to one side. Sitting to one side, the brahmin Jāṇussoṇi said to the Blessed One, \"Does Master Gotama also proclaim himself a practitioner of the holy life?\" \"Indeed, brahmin, if one were to correctly say, 'He practices a holy life that is unbroken, unblemished, untainted, uncorrupted, complete, and purified,' it is of me that one would be correctly speaking. For I, brahmin, practice a holy life that is unbroken, unblemished, untainted, uncorrupted, complete, and purified.\" \"But Master Gotama, what constitutes a holy life that is broken, blemished, tainted, or corrupted?\"\n\n\"Here, brahmin, some ascetic or brahmin, while proclaiming himself a true practitioner of the holy life, does not actually engage in sexual intercourse with a woman. However, he enjoys rubbing, massaging, bathing, or caressing a woman. He relishes that, delights in it, and finds satisfaction in it. This, brahmin, is a holy life that is broken, blemished, tainted, and corrupted. This person, brahmin, is said to practice an unpurified holy life, bound by the fetter of sexual activity. He is not freed from birth, aging, death, sorrow, lamentation, pain, distress, and despair. I say he is not freed from suffering.\"\n\n\"Furthermore, brahmin, here some ascetic or brahmin, while proclaiming himself a true practitioner of the holy life, does not actually engage in sexual intercourse with a woman, nor does he enjoy rubbing, massaging, bathing, or caressing a woman. However, he laughs, plays, and amuses himself with women. Furthermore, he does not laugh, play, or amuse himself with women, but he gazes intently at a woman with his eyes. Furthermore, he does not gaze intently at a woman with his eyes, but he hears a woman's voice from behind a wall or a fence, whether she is laughing, speaking, singing, or weeping. Furthermore, he does not hear a woman's voice from behind a wall or a fence, whether she is laughing, speaking, singing, or weeping, but he recalls his former laughter, speech, and play with women. Furthermore, he does not recall his former laughter, speech, and play with women, but he sees a householder or a householder's son enjoying themselves, fully endowed and immersed in the five strands of sensual pleasure. Furthermore, he does not see a householder or a householder's son enjoying themselves, fully endowed and immersed in the five strands of sensual pleasure, but he practices the holy life with the aspiration towards a certain order of devas, thinking: 'By this virtue, or by this practice, or by this asceticism, or by this holy life, I shall become a deva or one of the devas.' He relishes that, delights in it, and finds satisfaction in it. This too, brahmin, is a holy life that is broken, blemished, tainted, and corrupted. This person, brahmin, is said to practice an unpurified holy life, bound by the fetter of sexual activity. He is not freed from birth, aging, death, sorrow, lamentation, pain, distress, and despair. I say he is not freed from suffering.\"\n\n\"As long as I, brahmin, perceived any one of these seven fetters of sexual activity as not yet abandoned within myself, for that long, brahmin, I did not declare myself to have fully awakened to the unsurpassed perfect self-awakening in this world with its devas, Māras, and Brahmās, among the generation of ascetics and brahmins, devas and humans. But when I, brahmin, no longer perceived any one of these seven fetters of sexual activity as not yet abandoned within myself, then, brahmin, I declared myself to have fully awakened to the unsurpassed perfect self-awakening in this world with its devas, Māras, and Brahmās, among the generation of ascetics and brahmins, devas and humans. And knowledge and vision arose in me: 'Unshakable is my liberation. This is my last birth. There is now no further existence.'\"\n\nWhen this was said, the brahmin Jāṇussoṇi said to the Blessed One, \"Excellent, Master Gotama! Excellent, Master Gotama! Just as if one were to set upright what had been overturned, or were to reveal what was hidden, or were to show the way to one who was lost, or were to hold up a lamp in the darkness so that those with eyes could see forms—in the same way has Master Gotama made the Dhamma clear in various ways. I go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha. Let Master Gotama remember me as a lay follower who has gone for refuge from this day forward until the end of my life.\"",
      "sinhala": "එවිට ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වූයේය. සතුටු වන, සිහිකළ යුතු කථා බස් හුවමාරු කරගෙන, එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ගෞතමයන් වහන්සේ ද බඹසර රකින බවට ප්‍රතිඥා දෙන සේක් ද?\"\n\n\"බ්‍රාහ්මණය, යමෙක් නිවැරදිව කියන්නේ නම් 'කැඩීම් බිඳීම් නැති, සිද්‍රූ නැති, අපවිත්‍ර නොවූ, කිළුටු නොවූ, පිරිපුන්, පිරිසිදු බඹසරක් රකී' යැයි, බ්‍රාහ්මණය, නිවැරදිව කියන්නේ මා ගැනම ය. 'බ්‍රාහ්මණය, මම කැඩීම් බිඳීම් නැති, සිද්‍රූ නැති, අපවිත්‍ර නොවූ, කිළුටු නොවූ, පිරිපුන්, පිරිසිදු බඹසරක් රකිමි' යනුවෙන්.\"\n\n\"ගෞතමයන් වහන්ස, බඹසරේ කැඩීම්, සිද්‍රූ, අපවිත්‍රවීම්, කිළුටු වීම් යනු කුමක්ද?\"\n\n\"බ්‍රාහ්මණය, මේ ලෝකයේ සමහර ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් නිවැරදි බඹසර රකින බවට ප්‍රතිඥා දෙමින්, ස්ත්‍රියක් සමඟ ලිංගික සේවනයට එළඹෙන්නේ නැත. එහෙත්, ස්ත්‍රියක් ඇඟපත පිරිමැදීම, තෙලගෑම, ස්නානය කරවීම, සම්බාහනය කරවීම භුක්ති විඳියි. හෙතෙම එය අගය කරයි, එයට කැමති වේ, එමඟින් සතුටු වේ. බ්‍රාහ්මණය, මෙය ද බඹසරේ කැඩීමක්, සිද්‍රූවක්, අපවිත්‍රවීමක්, කිළුටු වීමකි. බ්‍රාහ්මණය, මොහු අපිරිසිදු බඹසර රකී යැයි කියනු ලැබේ. මොහු මෙථුන සංයෝජනයෙන් බැඳී සිටී. ඉපදීමෙන්, මහලු වීමෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, බලාපොරොත්තු සුන්වීම්වලින් මිදෙන්නේ නැත. දුකෙන් මිදෙන්නේ නැතැයි මම කියමි.\n\nනැවතත් බ්‍රාහ්මණය, මේ ලෝකයේ සමහර ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් නිවැරදි බඹසර රකින බවට ප්‍රතිඥා දෙමින්, ස්ත්‍රියක් සමඟ ලිංගික සේවනයට එළඹෙන්නේ ද නැත, ස්ත්‍රියක් ඇඟපත පිරිමැදීම, තෙලගෑම, ස්නානය කරවීම, සම්බාහනය කරවීම භුක්ති විඳින්නේ ද නැත. එහෙත්, ස්ත්‍රියක් සමඟ එකට සිනාසෙයි, කෙළි දෙළෙන් යුක්ත වෙයි, සෙල්ලම් කරයි... ස්ත්‍රියක් සමඟ එකට සිනාසෙන්නේ ද නැත, සෙල්ලම් කරන්නේ ද නැත, කෙළි දෙළෙන් යුක්ත වන්නේ ද නැත. එහෙත්, ස්ත්‍රියකගේ ඇස දෙසට ඇස යොමා බලයි, බලාගෙන සිටියි... ස්ත්‍රියකගේ ඇස දෙසට ඇස යොමා බලන්නේ ද නැත, බලාගෙන සිටින්නේ ද නැත. එහෙත්, ස්ත්‍රියකගේ සිනාසෙන, කථා කරන, ගී ගයන, හඬන ශබ්දය තාප්පයකින් හෝ වැටකින් එහායින් සිට අසයි... ස්ත්‍රියකගේ සිනාසෙන, කථා කරන, ගී ගයන, හඬන ශබ්දය තාප්පයකින් හෝ වැටකින් එහායින් සිට අසන්නේ ද නැත. එහෙත්, පෙරදී ස්ත්‍රීන් සමඟ සිනාසුණු, කථා කළ, සෙල්ලම් කළ දේ සිහි කරයි... පෙරදී ස්ත්‍රීන් සමඟ සිනාසුණු, කථා කළ, සෙල්ලම් කළ දේ සිහි කරන්නේ ද නැත. එහෙත්, පස්කම් ගුණවලින් යුක්තව, පස්කම් ගුණ භුක්ති විඳින ගෘහපතියකු හෝ ගෘහපති පුත්‍රයකු දකිනු ලැබෙයි... පස්කම් ගුණවලින් යුක්තව, පස්කම් ගුණ භුක්ති විඳින ගෘහපතියකු හෝ ගෘහපති පුත්‍රයකු දකින්නේ ද නැත. එහෙත්, යම් දේව සමූහයකට පැමිණීමට අධිෂ්ඨාන කරගෙන බඹසර රකී, 'මම මේ සීලයෙන් හෝ වතෙන් හෝ තපසින් හෝ බඹසරින් හෝ දෙවියකු වෙමි, හෝ යම් දේව භාවයකට පත්වෙමි' යනුවෙන්. හෙතෙම එය අගය කරයි, එයට කැමති වේ, එමඟින් සතුටු වේ. බ්‍රාහ්මණය, මෙය ද බඹසරේ කැඩීමක්, සිද්‍රූවක්, අපවිත්‍රවීමක්, කිළුටු වීමකි. බ්‍රාහ්මණය, මොහු අපිරිසිදු බඹසර රකී යැයි කියනු ලැබේ, මෙථුන සංයෝජනයෙන් බැඳී සිටී. ඉපදීමෙන්, මහලු වීමෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, දුකෙන්, දොම්නසින්, බලාපොරොත්තු සුන්වීම්වලින් මිදෙන්නේ නැත. දුකෙන් මිදෙන්නේ නැතැයි මම කියමි.\n\n\"බ්‍රාහ්මණය, යම් තාක් කල් මම මේ සප්ත මෙථුන සංයෝජන අතුරින් යම් කිසිවක් මා තුළ ප්‍රහීණ වී නැති බව දුටුවෙම් ද, ඒ තාක් කල් මම දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝක සත්වයාට අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කරගත්තා යැයි ප්‍රතිඥා දුන්නේ නැත.\n\n\"බ්‍රාහ්මණය, යම් කලක මම මේ සප්ත මෙථුන සංයෝජන අතුරින් කිසිවක් මා තුළ ප්‍රහීණ නොවී තිබෙනු නොදුටුවෙම් ද, එවිට බ්‍රාහ්මණය, මම දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝක සත්වයාට අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කරගත්තා යැයි ප්‍රතිඥා දුනිමි. 'මට ඥානය හා දර්ශනය පහළ විය, මාගේ විමුක්තිය නොසෙල්වෙයි, මෙය අවසාන ඉපදීමයි, දැන් නැවත භවයක් නැත' යනුවෙන්.\"\n\nමෙසේ කී කල්හි ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"අහෝ ගෞතමයන් වහන්ස, ඉතා මැනවි! අහෝ ගෞතමයන් වහන්ස, ඉතා මැනවි! ...ගෞතමයන් වහන්සේ අද පටන් මා දිවි ඇති තෙක් සරණ ගිය උපාසකයකු ලෙස පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Methunasuttaṃ",
      "englishTitle": "Sexual Intercourse Sutta",
      "sinhalaTitle": "මෙථුන සූත්‍රය"
    },
    {
      "number": 51,
      "pali": "‘‘Saṃyogavisaṃyogaṃ vo, bhikkhave, dhammapariyāyaṃ desessāmi. Taṃ suṇātha…pe… katamo ca so, bhikkhave, saṃyogo visaṃyogo dhammapariyāyo? ‘‘Itthī, bhikkhave, ajjhattaṃ itthindriyaṃ manasi karoti – itthikuttaṃ itthākappaṃ itthividhaṃ itthicchandaṃ itthissaraṃ itthālaṅkāraṃ. Sā tattha rajjati tatrābhiramati. Sā tattha rattā tatrābhiratā bahiddhā purisindriyaṃ manasi karoti – purisakuttaṃ purisākappaṃ purisavidhaṃ purisacchandaṃ purisassaraṃ purisālaṅkāraṃ. Sā tattha rajjati tatrābhiramati. Sā tattha rattā tatrābhiratā bahiddhā saṃyogaṃ ākaṅkhati. Yañcassā saṃyogapaccayā uppajjati sukhaṃ somanassaṃ tañca ākaṅkhati. Itthatte, bhikkhave, abhiratā sattā purisesu saṃyogaṃ gatā. Evaṃ kho, bhikkhave, itthī itthattaṃ nātivattati. ‘‘Puriso, bhikkhave, ajjhattaṃ purisindriyaṃ manasi karoti – purisakuttaṃ purisākappaṃ purisavidhaṃ purisacchandaṃ purisassaraṃ purisālaṅkāraṃ. So tattha rajjati tatrābhiramati. So tattha ratto tatrābhirato bahiddhā itthindriyaṃ manasi karoti – itthikuttaṃ itthākappaṃ itthividhaṃ itthicchandaṃ itthissaraṃ itthālaṅkāraṃ. So tattha rajjati tatrābhiramati. So tattha ratto tatrābhirato bahiddhā saṃyogaṃ ākaṅkhati. Yañcassa saṃyogapaccayā uppajjati sukhaṃ somanassaṃ tañca ākaṅkhati. Purisatte, bhikkhave, abhiratā sattā itthīsu saṃyogaṃ gatā. Evaṃ kho, bhikkhave, puriso purisattaṃ nātivattati. Evaṃ kho, bhikkhave, saṃyogo hoti. ‘‘Kathañca, bhikkhave, visaṃyogo hoti? Itthī, bhikkhave, ajjhattaṃ itthindriyaṃ na manasi karoti – itthikuttaṃ itthākappaṃ itthividhaṃ itthicchandaṃ itthissaraṃ itthālaṅkāraṃ. Sā tattha na rajjati, sā tatra nābhiramati. Sā tattha arattā tatra anabhiratā bahiddhā purisindriyaṃ na manasi karoti – purisakuttaṃ purisākappaṃ purisavidhaṃ purisacchandaṃ purisassaraṃ purisālaṅkāraṃ. Sā tattha na rajjati, tatra nābhiramati. Sā tattha arattā tatra anabhiratā bahiddhā saṃyogaṃ nākaṅkhati. Yañcassā saṃyogapaccayā uppajjati sukhaṃ somanassaṃ tañca nākaṅkhati. Itthatte, bhikkhave, anabhiratā sattā purisesu visaṃyogaṃ gatā. Evaṃ kho, bhikkhave, itthī itthattaṃ ativattati. ‘‘Puriso, bhikkhave, ajjhattaṃ purisindriyaṃ na manasi karoti – purisakuttaṃ purisākappaṃ purisavidhaṃ purisacchandaṃ purisassaraṃ purisālaṅkāraṃ. So tattha na rajjati, so tatra nābhiramati. So tattha aratto tatra anabhirato bahiddhā itthindriyaṃ na manasi karoti – itthikuttaṃ itthākappaṃ itthividhaṃ itthicchandaṃ itthissaraṃ itthālaṅkāraṃ. So tattha na rajjati, tatra nābhiramati. So tattha aratto tatra anabhirato bahiddhā saṃyogaṃ nākaṅkhati. Yañcassa saṃyogapaccayā uppajjati sukhaṃ somanassaṃ tañca nākaṅkhati. Purisatte, bhikkhave, anabhiratā sattā itthīsu visaṃyogaṃ gatā. Evaṃ kho, bhikkhave, puriso purisattaṃ ativattati. Evaṃ kho, bhikkhave, visaṃyogo hoti. Ayaṃ kho, bhikkhave, saṃyogo visaṃyogo dhammapariyāyo’’ti. Aṭṭhamaṃ.",
      "english": "Bhikkhus, I shall teach you the discourse on entanglement and disentanglement. Listen to it, pay careful attention, I shall speak. And what, bhikkhus, is this discourse on entanglement and disentanglement?\n\nBhikkhus, a woman inwardly attends to the female faculty – to the female form, female gait, female manner, female desires, female voice, female adornments. She becomes enamored of them, she delights in them. Being enamored of them and delighted in them, she outwardly attends to the male faculty – to the male form, male gait, male manner, male desires, male voice, male adornments. She becomes enamored of them, she delights in them. Being enamored of them and delighted in them, she outwardly longs for entanglement. And she longs for the pleasure and joy that arises for her conditioned by entanglement. Bhikkhus, beings who delight in femaleness become entangled with males. Thus, bhikkhus, a woman does not transcend her femaleness.\n\nBhikkhus, a man inwardly attends to the male faculty – to the male form, male gait, male manner, male desires, male voice, male adornments. He becomes enamored of them, he delights in them. Being enamored of them and delighted in them, he outwardly attends to the female faculty – to the female form, female gait, female manner, female desires, female voice, female adornments. He becomes enamored of them, he delights in them. Being enamored of them and delighted in them, he outwardly longs for entanglement. And he longs for the pleasure and joy that arises for him conditioned by entanglement. Bhikkhus, beings who delight in maleness become entangled with females. Thus, bhikkhus, a man does not transcend his maleness. This is how, bhikkhus, entanglement occurs.\n\nAnd how, bhikkhus, does disentanglement occur? Bhikkhus, a woman inwardly does not attend to the female faculty – to the female form, female gait, female manner, female desires, female voice, female adornments. She does not become enamored of them, she does not delight in them. Not being enamored of them and not delighted in them, she outwardly does not attend to the male faculty – to the male form, male gait, male manner, male desires, male voice, male adornments. She does not become enamored of them, she does not delight in them. Not being enamored of them and not delighted in them, she outwardly does not long for entanglement. And she does not long for the pleasure and joy that arises for her conditioned by entanglement. Bhikkhus, beings who do not delight in femaleness become disentangled from males. Thus, bhikkhus, a woman transcends her femaleness.\n\nBhikkhus, a man inwardly does not attend to the male faculty – to the male form, male gait, male manner, male desires, male voice, male adornments. He does not become enamored of them, he does not delight in them. Not being enamored of them and not delighted in them, he outwardly does not attend to the female faculty – to the female form, female gait, female manner, female desires, female voice, female adornments. He does not become enamored of them, he does not delight in them. Not being enamored of them and not delighted in them, he outwardly does not long for entanglement. And he does not long for the pleasure and joy that arises for him conditioned by entanglement. Bhikkhus, beings who do not delight in maleness become disentangled from females. Thus, bhikkhus, a man transcends his maleness. This is how, bhikkhus, disentanglement occurs. This, bhikkhus, is the discourse on entanglement and disentanglement.",
      "sinhala": "භික්ෂූණි, මම ඔබට සංයෝගය සහ විසංයෝගය පිළිබඳ ධර්‍ම පරියායක් දේශනා කරන්නෙමි. ඊට සවන් දෙන්න. භික්ෂූණි, ඒ සංයෝගය සහ විසංයෝගය පිළිබඳ ධර්‍ම පරියාය කුමක්ද?\n\nභික්ෂූණි, ස්ත්‍රියක් තමා තුළ ඇති ස්ත්‍රී ඉන්ද්‍රිය (ස්ත්‍රී භාවය) මනසින් මෙනෙහි කරයි – එනම්, ඇගේ ස්ත්‍රී ස්වභාවය, ස්ත්‍රී ඉරියව්, ස්ත්‍රී ආකාරය, ස්ත්‍රී කැමැත්ත, ස්ත්‍රී කටහඬ, ස්ත්‍රී ආභරණ. ඇය ඒ කෙරෙහි ඇලෙයි, ඒ කෙරෙහි මත් වෙයි. එසේ ඇලුණු, එසේ මත් වූ ඇය බාහිර පුරුෂ ඉන්ද්‍රිය (පුරුෂ භාවය) මනසින් මෙනෙහි කරයි – එනම්, ඔහුගේ පුරුෂ ස්වභාවය, පුරුෂ ඉරියව්, පුරුෂ ආකාරය, පුරුෂ කැමැත්ත, පුරුෂ කටහඬ, පුරුෂ ආභරණ. ඇය ඒ කෙරෙහි ඇලෙයි, ඒ කෙරෙහි මත් වෙයි. එසේ ඇලුණු, එසේ මත් වූ ඇය බාහිරව සංයෝගයක් (බැඳීමක්) අපේක්ෂා කරයි. ඒ සංයෝගය නිසා ඇයට උපදින යම් සුවයක් හෝ සෝමනස්සයක් වේද, ඇය එයද අපේක්ෂා කරයි. භික්ෂූණි, ස්ත්‍රී භාවයෙහි මත් වූ සත්වයෝ පුරුෂයන් සමඟ බැඳීමකට (සංයෝගයකට) පත් වෙති. භික්ෂූණි, මෙසේ ස්ත්‍රිය ස්ත්‍රී භාවය ඉක්මවා නොයයි.\n\nභික්ෂූණි, පුරුෂයෙක් තමා තුළ ඇති පුරුෂ ඉන්ද්‍රිය (පුරුෂ භාවය) මනසින් මෙනෙහි කරයි – එනම්, ඔහුගේ පුරුෂ ස්වභාවය, පුරුෂ ඉරියව්, පුරුෂ ආකාරය, පුරුෂ කැමැත්ත, පුරුෂ කටහඬ, පුරුෂ ආභරණ. ඔහු ඒ කෙරෙහි ඇලෙයි, ඒ කෙරෙහි මත් වෙයි. එසේ ඇලුණු, එසේ මත් වූ ඔහු බාහිර ස්ත්‍රී ඉන්ද්‍රිය (ස්ත්‍රී භාවය) මනසින් මෙනෙහි කරයි – එනම්, ඇගේ ස්ත්‍රී ස්වභාවය, ස්ත්‍රී ඉරියව්, ස්ත්‍රී ආකාරය, ස්ත්‍රී කැමැත්ත, ස්ත්‍රී කටහඬ, ස්ත්‍රී ආභරණ. ඔහු ඒ කෙරෙහි ඇලෙයි, ඒ කෙරෙහි මත් වෙයි. එසේ ඇලුණු, එසේ මත් වූ ඔහු බාහිරව සංයෝගයක් (බැඳීමක්) අපේක්ෂා කරයි. ඒ සංයෝගය නිසා ඔහුට උපදින යම් සුවයක් හෝ සෝමනස්සයක් වේද, ඔහු එයද අපේක්ෂා කරයි. භික්ෂූණි, පුරුෂ භාවයෙහි මත් වූ සත්වයෝ ස්ත්‍රීන් සමඟ බැඳීමකට (සංයෝගයකට) පත් වෙති. භික්ෂූණි, මෙසේ පුරුෂයා පුරුෂ භාවය ඉක්මවා නොයයි. භික්ෂූණි, මෙසේ සංයෝගය (බැඳීම) ඇති වේ.\n\nභික්ෂූණි, විසංයෝගය (බැඳීම් වලින් මිදීම) ඇති වන්නේ කෙසේද? භික්ෂූණි, ස්ත්‍රියක් තමා තුළ ඇති ස්ත්‍රී ඉන්ද්‍රිය (ස්ත්‍රී භාවය) මනසින් මෙනෙහි නොකරයි – එනම්, ඇගේ ස්ත්‍රී ස්වභාවය, ස්ත්‍රී ඉරියව්, ස්ත්‍රී ආකාරය, ස්ත්‍රී කැමැත්ත, ස්ත්‍රී කටහඬ, ස්ත්‍රී ආභරණ. ඇය ඒ කෙරෙහි නොඇලෙයි, ඒ කෙරෙහි මත් නොවේ. එසේ නොඇලුණු, එසේ මත් නොවූ ඇය බාහිර පුරුෂ ඉන්ද්‍රිය (පුරුෂ භාවය) මනසින් මෙනෙහි නොකරයි – එනම්, ඔහුගේ පුරුෂ ස්වභාවය, පුරුෂ ඉරියව්, පුරුෂ ආකාරය, පුරුෂ කැමැත්ත, පුරුෂ කටහඬ, පුරුෂ ආභරණ. ඇය ඒ කෙරෙහි නොඇලෙයි, ඒ කෙරෙහි මත් නොවේ. එසේ නොඇලුණු, එසේ මත් නොවූ ඇය බාහිරව සංයෝගයක් (බැඳීමක්) අපේක්ෂා නොකරයි. ඒ සංයෝගය නිසා ඇයට උපදින යම් සුවයක් හෝ සෝමනස්සයක් වේද, ඇය එයද අපේක්ෂා නොකරයි. භික්ෂූණි, ස්ත්‍රී භාවයෙහි මත් නොවුණු සත්වයෝ පුරුෂයන්ගෙන් බැඳීම් වලින් මිදෙති (විසංයෝගයට පත් වෙති). භික්ෂූණි, මෙසේ ස්ත්‍රිය ස්ත්‍රී භාවය ඉක්මවා යයි.\n\nභික්ෂූණි, පුරුෂයෙක් තමා තුළ ඇති පුරුෂ ඉන්ද්‍රිය (පුරුෂ භාවය) මනසින් මෙනෙහි නොකරයි – එනම්, ඔහුගේ පුරුෂ ස්වභාවය, පුරුෂ ඉරියව්, පුරුෂ ආකාරය, පුරුෂ කැමැත්ත, පුරුෂ කටහඬ, පුරුෂ ආභරණ. ඔහු ඒ කෙරෙහි නොඇලෙයි, ඒ කෙරෙහි මත් නොවේ. එසේ නොඇලුණු, එසේ මත් නොවූ ඔහු බාහිර ස්ත්‍රී ඉන්ද්‍රිය (ස්ත්‍රී භාවය) මනසින් මෙනෙහි නොකරයි – එනම්, ඇගේ ස්ත්‍රී ස්වභාවය, ස්ත්‍රී ඉරියව්, ස්ත්‍රී ආකාරය, ස්ත්‍රී කැමැත්ත, ස්ත්‍රී කටහඬ, ස්ත්‍රී ආභරණ. ඔහු ඒ කෙරෙහි නොඇලෙයි, ඒ කෙරෙහි මත් නොවේ. එසේ නොඇලුණු, එසේ මත් නොවූ ඔහු බාහිරව සංයෝගයක් (බැඳීමක්) අපේක්ෂා නොකරයි. ඒ සංයෝගය නිසා ඔහුට උපදින යම් සුවයක් හෝ සෝමනස්සයක් වේද, ඔහු එයද අපේක්ෂා නොකරයි. භික්ෂූණි, පුරුෂ භාවයෙහි මත් නොවුණු සත්වයෝ ස්ත්‍රීන්ගෙන් බැඳීම් වලින් මිදෙති (විසංයෝගයට පත් වෙති). භික්ෂූණි, මෙසේ පුරුෂයා පුරුෂ භාවය ඉක්මවා යයි. භික්ෂූණි, මෙසේ විසංයෝගය (බැඳීම් වලින් මිදීම) ඇති වේ. භික්ෂූණි, සංයෝගය සහ විසංයෝගය පිළිබඳ ධර්‍ම පරියාය මෙයයි.",
      "paliTitle": "Saṃyogasuttaṃ",
      "englishTitle": "The Discourse on Bondage",
      "sinhalaTitle": "සංයෝග සූත්‍රය"
    },
    {
      "number": 52,
      "pali": "Ekaṃ samayaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Atha kho sambahulā campeyyakā upāsakā yena āyasmā sāriputto tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ sāriputtaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho campeyyakā upāsakā āyasmantaṃ sāriputtaṃ etadavocuṃ – ‘‘cirassutā no, bhante [bhante sāriputta (sī.)], bhagavato sammukhā dhammīkathā. Sādhu mayaṃ, bhante, labheyyāma bhagavato sammukhā dhammiṃ kathaṃ [bhagavato santikā dhammiṃ kathaṃ (sī.), bhagavato dhammiṃ kathaṃ (syā.)] savanāyā’’ti. ‘‘Tenahāvuso, tadahuposathe āgaccheyyātha, appeva nāma labheyyātha bhagavato sammukhā [bhagavato santike (syā.)] dhammiṃ kathaṃ savanāyā’’ti. ‘‘Evaṃ, bhante’’ti kho campeyyakā upāsakā āyasmato sāriputtassa paṭissutvā uṭṭhāyāsanā āyasmantaṃ sāriputtaṃ abhivādetvā padakkhiṇaṃ katvā pakkamiṃsu. Atha kho campeyyakā upāsakā tadahuposathe yenāyasmā sāriputto tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ sāriputtaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Atha kho āyasmā sāriputto tehi campeyyakehi upāsakehi saddhiṃ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘Siyā nu kho, bhante, idhekaccassa tādisaṃyeva dānaṃ dinnaṃ na mahapphalaṃ hoti na mahānisaṃsaṃ; siyā pana, bhante, idhekaccassa tādisaṃyeva dānaṃ dinnaṃ mahapphalaṃ hoti mahānisaṃsa’’nti? ‘‘Siyā, sāriputta, idhekaccassa tādisaṃyeva dānaṃ dinnaṃ na mahapphalaṃ hoti na mahānisaṃsaṃ; siyā pana, sāriputta, idhekaccassa tādisaṃyeva dānaṃ dinnaṃ mahapphalaṃ hoti mahānisaṃsa’’nti. ‘‘Ko nu kho, bhante, hetu ko paccayo yena midhekaccassa tādisaṃyeva dānaṃ dinnaṃ na mahapphalaṃ hoti na mahānisaṃsaṃ; ko nu kho, bhante, hetu ko paccayo yena midhekaccassa tādisaṃyeva dānaṃ dinnaṃ mahapphalaṃ hoti mahānisaṃsa’’nti? ‘‘Idha, sāriputta, ekacco sāpekho [sāpekkho (syā.)] dānaṃ deti, patibaddhacitto [patibandhacitto (ka.)] dānaṃ deti, sannidhipekho dānaṃ deti, ‘imaṃ pecca paribhuñjissāmī’ti dānaṃ deti. So taṃ dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Taṃ kiṃ maññasi, sāriputta, dadeyya idhekacco evarūpaṃ dāna’’nti? ‘‘Evaṃ, bhante’’. ‘‘Tatra, sāriputta, yvāyaṃ sāpekho dānaṃ deti, patibaddhacitto dānaṃ deti, sannidhipekho dānaṃ deti, ‘imaṃ pecca paribhuñjissāmī’ti dānaṃ deti. So taṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjati. So taṃ kammaṃ khepetvā taṃ iddhiṃ taṃ yasaṃ taṃ ādhipaccaṃ āgāmī hoti āgantā itthattaṃ. ‘‘Idha pana, sāriputta, ekacco na heva kho sāpekho dānaṃ deti, na patibaddhacitto dānaṃ deti, na sannidhipekho dānaṃ deti, na ‘imaṃ pecca paribhuñjissāmī’ti dānaṃ deti; api ca kho ‘sāhu dāna’nti dānaṃ deti…pe… napi ‘sāhu dāna’nti dānaṃ deti; api ca kho ‘dinnapubbaṃ katapubbaṃ pitupitāmahehi na arahāmi porāṇaṃ kulavaṃsaṃ hāpetu’nti dānaṃ deti…pe… napi ‘dinnapubbaṃ katapubbaṃ pitupitāmahehi na arahāmi porāṇaṃ kulavaṃsaṃ hāpetu’nti dānaṃ deti; api ca kho ‘ahaṃ pacāmi, ime na pacanti, nārahāmi pacanto apacantānaṃ dānaṃ adātu’nti dānaṃ deti…pe… napi ‘ahaṃ pacāmi, ime na pacanti, nārahāmi pacanto apacantānaṃ dānaṃ adātu’nti dānaṃ deti; api ca kho ‘yathā tesaṃ pubbakānaṃ isīnaṃ tāni mahāyaññāni ahesuṃ, seyyathidaṃ – aṭṭhakassa vāmakassa vāmadevassa vessāmittassa yamadaggino aṅgīrasassa bhāradvājassa vāseṭṭhassa kassapassa bhaguno, evaṃ me ayaṃ dānasaṃvibhāgo bhavissatī’ti dānaṃ deti…pe… napi ‘yathā tesaṃ pubbakānaṃ isīnaṃ tāni mahāyaññāni ahesuṃ, seyyathidaṃ – aṭṭhakassa vāmakassa vāmadevassa vessāmittassa yamadaggino aṅgīrasassa bhāradvājassa vāseṭṭhassa kassapassa bhaguno, evaṃ me ayaṃ dānasaṃvibhāgo bhavissatī’ti dānaṃ deti; api ca kho ‘imaṃ me dānaṃ dadato cittaṃ pasīdati, attamanatā somanassaṃ upajāyatī’ti dānaṃ deti…pe… napi ‘imaṃ me dānaṃ dadato cittaṃ pasīdati, attamanatā somanassaṃ upajāyatī’ti dānaṃ deti; api ca kho cittālaṅkāracittaparikkhāraṃ dānaṃ deti. So taṃ dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Taṃ kiṃ maññasi, sāriputta, dadeyya idhekacco evarūpaṃ dāna’’nti? ‘‘Evaṃ, bhante’’. ‘‘Tatra, sāriputta, yvāyaṃ na heva [naheva kho (sī. syā.)] sāpekho dānaṃ deti; na patibaddhacitto dānaṃ deti; na sannidhipekho dānaṃ deti; na ‘imaṃ pecca paribhuñjissāmī’ti dānaṃ deti; napi ‘sāhu dāna’nti dānaṃ deti; napi ‘dinnapubbaṃ katapubbaṃ pitupitāmahehi na arahāmi porāṇaṃ kulavaṃsaṃ hāpetu’nti dānaṃ deti; napi ‘ahaṃ pacāmi, ime na pacanti, nārahāmi pacanto apacantānaṃ dānaṃ adātu’nti dānaṃ deti; napi ‘yathā tesaṃ pubbakānaṃ isīnaṃ tāni mahāyaññāni ahesuṃ, seyyathidaṃ – aṭṭhakassa vāmakassa vāmadevassa vessāmittassa yamadaggino aṅgīrasassa bhāradvājassa vāseṭṭhassa kassapassa bhaguno, evaṃ me ayaṃ dānasaṃvibhāgo bhavissatī’ti dānaṃ deti; napi ‘imaṃ me dānaṃ dadato cittaṃ pasīdati, attamanatā somanassaṃ upajāyatī’ti dānaṃ deti; api ca kho cittālaṅkāracittaparikkhāraṃ dānaṃ deti. So taṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjati. So taṃ kammaṃ khepetvā taṃ iddhiṃ taṃ yasaṃ taṃ ādhipaccaṃ anāgāmī hoti anāgantā itthattaṃ. Ayaṃ kho, sāriputta, hetu ayaṃ paccayo yena midhekaccassa tādisaṃyeva dānaṃ dinnaṃ na mahapphalaṃ hoti na mahānisaṃsaṃ. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo yena midhekaccassa tādisaṃyeva dānaṃ dinnaṃ mahapphalaṃ hoti mahānisaṃsa’’nti. Navamaṃ.",
      "english": "Once, the Blessed One was dwelling in Campā, on the bank of Gaggarā's lotus pond. Then, a considerable number of lay followers from Campā approached the Venerable Sāriputta. Having approached and paid homage to the Venerable Sāriputta, they sat down to one side. Seated to one side, the lay followers from Campā said to the Venerable Sāriputta: \"It has been a long time, Venerable sir, since we heard a discourse on the Dhamma directly from the Blessed One. It would be good, Venerable sir, if we could obtain a discourse on the Dhamma directly from the Blessed One for listening.\" \"In that case, friends, you should come on the Uposatha day; perhaps you might obtain a discourse on the Dhamma directly from the Blessed One for listening.\" \"Yes, Venerable sir,\" replied the lay followers from Campā to the Venerable Sāriputta. Having assented, they rose from their seats, paid homage to the Venerable Sāriputta, circumambulated him with their right side towards him, and departed.\n\nThen, on that Uposatha day, the lay followers from Campā approached the Venerable Sāriputta. Having approached and paid homage to the Venerable Sāriputta, they stood to one side. Then, the Venerable Sāriputta, together with those lay followers from Campā, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the Venerable Sāriputta said to the Blessed One: \"Is it possible, Venerable sir, that for some, the very same kind of gift, when given, is not greatly fruitful and not greatly beneficial? But is it also possible, Venerable sir, that for others, the very same kind of gift, when given, is greatly fruitful and greatly beneficial?\" \"It is possible, Sāriputta, that for some, the very same kind of gift, when given, is not greatly fruitful and not greatly beneficial. But it is also possible, Sāriputta, that for others, the very same kind of gift, when given, is greatly fruitful and greatly beneficial.\" \"What, then, Venerable sir, is the reason, what is the cause, by which for some, the very same kind of gift, when given, is not greatly fruitful and not greatly beneficial? And what, Venerable sir, is the reason, what is the cause, by which for others, the very same kind of gift, when given, is greatly fruitful and greatly beneficial?\"\n\n\"Here, Sāriputta, someone gives a gift with expectation, with a mind bound to the reward, with an intention of accumulation for future use, thinking, 'I will consume this in the next life.' They give such a gift to a renunciant or a brahmin: food, drink, clothing, vehicles, garlands, perfumes, ointments, beds, dwellings, and lamps. What do you think, Sāriputta, would someone give such a gift?\" \"Yes, Venerable sir.\" \"Therein, Sāriputta, this person who gives a gift with expectation, with a mind bound to the reward, with an intention of accumulation for future use, thinking, 'I will consume this in the next life' – having given that gift, after the dissolution of the body and after death, they are reborn into the company of the Devas of the Four Great Kings. Having exhausted that kamma, that power, that glory, that dominion, they are an 'returner', one who will come back to this human existence.\n\n\"Here, Sāriputta, someone does not give a gift with expectation, nor with a mind bound to the reward, nor with an intention of accumulation for future use, nor thinking, 'I will consume this in the next life.' But rather, they give a gift thinking, 'It is good to give.' Yet, they do not give a gift solely thinking, 'It is good to give.' But rather, they give a gift thinking, 'This was given and done by my ancestors; I should not abandon the ancient family tradition.' Yet, they do not give a gift solely thinking, 'This was given and done by my ancestors; I should not abandon the ancient family tradition.' But rather, they give a gift thinking, 'I cook, these do not cook; I who cook am not fit not to give to those who do not cook.' Yet, they do not give a gift solely thinking, 'I cook, these do not cook; I who cook am not fit not to give to those who do not cook.' But rather, they give a gift thinking, 'Just as those great sacrifices were for those ancient sages – namely, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamadaggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu – so shall this distribution of my gift be.' Yet, they do not give a gift solely thinking, 'Just as those great sacrifices were for those ancient sages – namely, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamadaggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu – so shall this distribution of my gift be.' But rather, they give a gift thinking, 'When I give this gift, my mind becomes clear; delight and joy arise.' Yet, they do not give a gift solely thinking, 'When I give this gift, my mind becomes clear; delight and joy arise.' But rather, they give a gift as an adornment and requisite for the mind. They give such a gift to a renunciant or a brahmin: food, drink, clothing, vehicles, garlands, perfumes, ointments, beds, dwellings, and lamps.\n\n\"What do you think, Sāriputta, would someone here give such a gift?\"\n\"Yes, Venerable Sir.\"\n\nHere, Sāriputta, if someone gives a gift not with expectation, not with an attached mind, not with the intention of accumulating for later use, not thinking, 'I will partake of this in the next life'; nor does he give a gift thinking, 'Giving is good'; nor does he give a gift thinking, 'It has been given before, done before by my fathers and grandfathers; I must not allow the ancient family tradition to lapse'; nor does he give a gift thinking, 'I cook, these others do not cook; I ought not, being one who cooks, fail to give a gift to those who do not cook'; nor does he give a gift thinking, 'Just as those great sacrifices of the ancient sages – namely, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamadaggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, Bhagu – took place, so will this distribution of gifts of mine be'; nor does he give a gift thinking, 'By my giving this gift, my mind becomes clear; delight and joy arise'; but rather, he gives a gift as an adornment for the mind and a requisite for the mind. Having given that gift, at the breaking up of the body, after death, he reappears in the company of the Brahmā gods. Having exhausted that karma, that power, that glory, that dominion, he becomes a non-returner, one who will not return to this state of existence.\n\nThis, Sāriputta, is the reason, this is the condition, why for some person such a gift, when given, is not of great fruit and not of great benefit. But this, Sāriputta, is the reason, this is the condition, why for some person such a gift, when given, is of great fruit and great benefit.",
      "sinhala": "එක් සමයෙක භාග්‍ය​වතුන් වහන්සේ චම්පා නුවර ගග්ගරා නම් පොකුණේ වෙරළෙහි වැඩවිසූ සේක. එකල්හි බොහෝ චම්පා වැසි උපාසකවරු ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේ වැඩසිටි තැනට පැමිණියාහුය; පැමිණ, ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේට වන්දනා කර, එකත්පසෙක වාඩිවූවාහුය. එකත්පසෙක වාඩිවූ ඒ චම්පා වැසි උපාසකවරු ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේට මෙය පැවසුවාහුය: \"වහන්ස, අපට බොහෝ කලෙක සිට භාග්‍ය​වතුන් වහන්සේගේ සමීපයෙන් ධර්ම කථාවක් ශ්‍ර​වණය කරන්නට නොලැබිණි. වහන්ස, භාග්‍ය​වතුන් වහන්සේගේ සමීපයෙන් ධර්ම කථාවක් ශ්‍ර​වණය කරන්නට අපට අවස්ථාවක් ලැබුණොත් ඉතා යහපති.\" \"එසේ නම් ආයුෂ්මතුනි, ඒ උපෝසථ දිනයේදී පැමිණෙන්න, සමහරවිට භාග්‍ය​වතුන් වහන්සේගේ සමීපයෙන් ධර්ම කථාවක් ශ්‍ර​වණය කිරීමට ඔබට අවස්ථාව ලැබෙන්නට පුළුවන.\" \"එසේය, වහන්ස\" යැයි චම්පා වැසි උපාසකවරු ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේට පිළිතුරු දී, ආසනවලින් නැගිට, ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේට වන්දනා කර, පැදකුණු කොට නික්ම ගියාහුය.\n\nඑකල්හි ඒ චම්පා වැසි උපාසකවරු එදින උපෝසථයේදී ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේ වැඩසිටි තැනට පැමිණියාහුය; පැමිණ, ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේට වන්දනා කර, එකත්පසෙක සිටියාහුය. එකල්හි ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේ ඒ චම්පා වැසි උපාසකවරුන් සමග භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියාහ; පැමිණ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වාඩිවූ සේක. එකත්පසෙක වාඩිවූ ආයුෂ්මත් ශ්‍රී‍රාවුත් මහ රහතන් වහන්සේ භාග්‍ය​වතුන් වහන්සේට මෙය පැවසුවාහ: \"වහන්ස, මෙහි ඇතැම් අය විසින් දෙනු ලබන දානය මහත් ඵල නැත්තේ, මහත් ආනිශංස නැත්තේ වෙන්නට පුළුවන. එහෙත් වහන්ස, ඇතැම් අය විසින් දෙනු ලබන එබඳුම දානය මහත් ඵල ඇත්තේ, මහත් ආනිශංස ඇත්තේ වෙන්නටත් පුළුවන.\" \"ශාරිපුත්‍රය, මෙහි ඇතැම් අය විසින් දෙනු ලබන දානය මහත් ඵල නැත්තේ, මහත් ආනිශංස නැත්තේ වෙන්නට පුළුවන. එහෙත් ශාරිපුත්‍රය, ඇතැම් අය විසින් දෙනු ලබන එබඳුම දානය මහත් ඵල ඇත්තේ, මහත් ආනිශංස ඇත්තේ වෙන්නටත් පුළුවන.\" \"වහන්ස, ඇතැම් අය විසින් දෙනු ලබන එබඳුම දානය මහත් ඵල නැත්තේ, මහත් ආනිශංස නැත්තේ වන්නේ කුමන හේතුවකින්ද, කුමන ප්‍රත්‍ය​යකින්ද? වහන්ස, ඇතැම් අය විසින් දෙනු ලබන එබඳුම දානය මහත් ඵල ඇත්තේ, මහත් ආනිශංස ඇත්තේ වන්නේ කුමන හේතුවකින්ද, කුමන ප්‍රත්‍ය​යකින්ද?\"\n\n\"ශාරිපුත්‍රය, මෙහි ඇතැම් කෙනෙක් ආශාවක් සහිතව දානය දෙයි, සිත ඇලී සිටින ස්වභාවයෙන් දානය දෙයි, රැස්කිරීමේ අදහසින් දානය දෙයි, 'මම මින් මතු මෙය පරිභෝජනය කරන්නෙමි' යන අදහසින් දානය දෙයි. හෙතෙම ශ්‍ර​මණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ අන්නපාන, වස්ත්‍ර, යාන, මාලා, ගන්ධ, විලේවන, සයන, ආවාස, ප්‍ර​දීප ආදිය දානය කරයි. ශාරිපුත්‍රය, ඒ කුමක් සිතන්නෙහිද, මෙහි ඇතැම් අය එබඳු දානයක් දෙන්නට පුළුවන්ද?\" \"එසේය, වහන්ස.\" \"ශාරිපුත්‍රය, එහි යම් මේ කෙනෙක් ආශාවක් සහිතව දානය දෙයි, සිත ඇලී සිටින ස්වභාවයෙන් දානය දෙයි, රැස්කිරීමේ අදහසින් දානය දෙයි, 'මම මින් මතු මෙය පරිභෝජනය කරන්නෙමි' යන අදහසින් දානය දෙයිද, හෙතෙම ඒ දානය දී, කය බිඳී මරණින් මතු චාතුර්මහාරාජික දෙවියන් අතර සහායතාවයට පැමිණ උපදී. හෙතෙම ඒ කර්මය ක්ෂය කොට, ඒ ඍද්ධිය, ඒ යසස, ඒ ආධිපත්‍ය​ය විඳ, නැවත මේ මනුලොවට පැමිණෙන්නෙක් වේ.\n\n\"ශාරිපුත්‍රය, මෙහි ඇතැම් කෙනෙක් ආශාවක් සහිතව දානය නොදෙයි, සිත ඇලී සිටින ස්වභාවයෙන් දානය නොදෙයි, රැස්කිරීමේ අදහසින් දානය නොදෙයි, 'මම මින් මතු මෙය පරිභෝජනය කරන්නෙමි' යන අදහසින් දානය නොදෙයි; එහෙත් ඔහු 'දානය දීම යහපත්යැ'යි සිතා දානය දෙයි. එහෙත් ඔහු 'පෙර පියවරුන් සහ මුතුන්මිත්තන් විසින් දාන දෙනු ලැබ ඇත, මා විසින්ද එය කරනු ලැබ ඇත. පැරණි කුල පරම්පරාවට අගෞරව කිරීම මට සුදුසු නැතැයි' සිතා දානය දෙයි. එහෙත් ඔහු 'මම කෑම උයමි, මොවුන් කෑම උයන්නේ නැත. කෑම උයන මට, කෑම නොඋයන අයට දානය නොදීම සුදුසු නැතැයි' සිතා දානය දෙයි. එහෙත් ඔහු 'අට්‍ඨක, වාමක, වාමදේව, විශ්වාමිත්‍ර​, යමදග්නි, අංගීරස​, භාරද්වාජ​, වාසෙට්ඨ, කාශ්‍යප, භගු වැනි පෙර සිටි ඍෂිවරුන්ට මහත් යාග තිබුණාක් මෙන්, මාගේ මේ දාන සංවිභාගයද එබඳු වේවා' යන අදහසින් දානය දෙයි. එහෙත් ඔහු 'මා විසින් මේ දානය දෙන කල්හි සිත පහදී, ප්‍රීතිය හා සොම්නස උපදී' යන අදහසින් දානය දෙයි. එහෙත් ඔහු සිත අලංකාර කිරීම පිණිස, සිතේ පිරිවරක් කිරීම පිණිස දානය දෙයි. හෙතෙම ශ්‍ර​මණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ අන්නපාන, වස්ත්‍ර, යාන, මාලා, ගන්ධ, විලේවන, සයන, ආවාස, ප්‍ර​දීප ආදිය දානය කරයි.\n\nසාරිපුත්තය, ඔබ මේ කුමක් සිතන්නෙහිද? යම් කිසිවෙක් මෙබඳු දානයක් දෙන්නේද?\" \"එසේය, භන්තෙ.\"\n\n\"සාරිපුත්තය, එහිලා යම් කිසි කෙනෙක් අපේක්ෂා ඇතිව දානයක් නොදෙයිද; සිත බැඳුණු තැනැත්තකු ලෙස දානයක් නොදෙයිද; තැන්පත් කර තබාගැනීමේ අදහසින් දානයක් නොදෙයිද; 'මම පරලොවදී මේ දානය භුක්ති විඳිමි' යන අදහසින් දානයක් නොදෙයිද; 'දානය යහපතැයි' යන අදහසින් ද දානයක් නොදෙයිද; 'පෙර මාගේ පියවරුන් සහ මුත්තවරුන් විසින් දෙන ලද, කරන ලද දානයකි; පැරණි කුල වංශය නැති කිරීමට මම සුදුසු නොවෙමි' යන අදහසින් ද දානයක් නොදෙයිද; 'මම උයමි, මොවුන් නොඋයති; උයන්නා වූ මම නොඋයන්නන්ට දන් නොදීමට සුදුසු නොවෙමි' යන අදහසින් ද දානයක් නොදෙයිද; 'යම් සේ ඒ පෙර විසූ සෘෂිවරුන්ගේ, එනම් – අට්ඨක, වාමක, වාමදේව, විශ්වාමිත්‍ර, යමදග්ගි, අංගීරස, භාරද්වාජ, වාසෙට්ඨ, කස්සප, භගු යන මේ අයගේ මහා යාග පැවතුණාද, එසේම මාගේ මේ දානයත් බෙදාදීමක් වනු ඇතැයි' යන අදහසින් ද දානයක් නොදෙයිද; 'මේ දානය දෙන කල්හි මාගේ සිත පැහැදේ, සතුට හා ප්‍රීතිය ඇති වේයැයි' යන අදහසින් ද දානයක් නොදෙයිද; එහෙත් සිත අලංකාර කරනු පිණිසත්, සිතට උපකරණයක් ලෙසත් දානයක් දෙයිද. හෙතෙම ඒ දානය දී, කය බිඳී මරණින් මතු බ්‍රහ්මකායික දෙවියන්ගේ සහවාසයට පැමිණේ. හෙතෙම ඒ කර්මය ක්ෂය කොට, ඒ ඍද්ධිය, ඒ යසස, ඒ ආධිපත්‍යය විඳීමෙන් පසු අනාගාමී වී නැවත මේ තත්ත්වයට (කාම ලෝකයට) නොඑන්නේය.\n\nසාරිපුත්තය, යම් කිසි කෙනෙකුට මෙබඳුම දානයක් දෙන ලදුවත් මහත් ඵල නැත්තේත්, මහත් ආනිසංස නැත්තේත්, මේ හේතුවයි, මේ ප්‍රත්‍යයයි. සාරිපුත්තය, එහෙත් යම් කිසි කෙනෙකුට මෙබඳුම දානයක් දෙන ලදුවත් මහත් ඵල ඇත්තේත්, මහත් ආනිසංස ඇත්තේත්, මේ හේතුවයි, මේ ප්‍රත්‍යයයි.\"",
      "paliTitle": "Dānamahapphalasuttaṃ",
      "englishTitle": "The Great Fruit of Giving Sutta",
      "sinhalaTitle": "දානමහප්ඵල සූත්‍රය"
    },
    {
      "number": 53,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ca sāriputto āyasmā ca mahāmoggallāno dakkhiṇāgirismiṃ cārikaṃ caranti mahatā bhikkhusaṅghena saddhiṃ. Tena kho pana samayena veḷukaṇḍakī [veḷukaṇḍakī (syā.) a. ni. 6.37; 2.134; saṃ. ni. 2.173 passitabbaṃ] nandamātā upāsikā rattiyā paccūsasamayaṃ paccuṭṭhāya pārāyanaṃ [cūḷani. pārāyanavagga, vatthugāthā] sarena bhāsati. Tena kho pana samayena vessavaṇo mahārājā uttarāya disāya dakkhiṇaṃ disaṃ gacchati kenacideva karaṇīyena. Assosi kho vessavaṇo mahārājā nandamātāya upāsikāya pārāyanaṃ sarena bhāsantiyā, sutvā kathāpariyosānaṃ āgamayamāno aṭṭhāsi. Atha kho nandamātā upāsikā pārāyanaṃ sarena bhāsitvā tuṇhī ahosi. Atha kho vessavaṇo mahārājā nandamātāya upāsikāya kathāpariyosānaṃ viditvā abbhānumodi – ‘‘sādhu bhagini, sādhu bhaginī’’ti! ‘‘Ko paneso, bhadramukhā’’ti? ‘‘Ahaṃ te, bhagini, bhātā vessavaṇo, mahārājā’’ti. ‘‘Sādhu, bhadramukha, tena hi yo me ayaṃ dhammapariyāyo bhaṇito idaṃ te hotu ātitheyya’’nti. ‘‘Sādhu, bhagini, etañceva me hotu ātitheyyaṃ. Sveva [sve ca (sī.)] sāriputtamoggallānappamukho bhikkhusaṅgho akatapātarāso veḷukaṇḍakaṃ āgamissati, tañca bhikkhusaṅghaṃ parivisitvā mama dakkhiṇaṃ ādiseyyāsi. Etañceva [evañca (sī. syā.), etañca (?)] me bhavissati ātitheyya’’nti. Atha kho nandamātā upāsikā tassā rattiyā accayena sake nivesane paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpesi. Atha kho sāriputtamoggallānappamukho bhikkhusaṅgho akatapātarāso yena veḷukaṇḍako tadavasari. Atha kho nandamātā upāsikā aññataraṃ purisaṃ āmantesi – ‘‘ehi tvaṃ, ambho purisa, ārāmaṃ gantvā bhikkhusaṅghassa kālaṃ ārocehi – ‘kālo, bhante, ayyāya nandamātuyā nivesane niṭṭhitaṃ bhatta’’’nti. ‘‘Evaṃ, ayye’’ti kho so puriso nandamātāya upāsikāya paṭissutvā ārāmaṃ gantvā bhikkhusaṅghassa kālaṃ ārocesi – ‘‘kālo, bhante, ayyāya nandamātuyā nivesane niṭṭhitaṃ bhatta’’nti. Atha kho sāriputtamoggallānappamukho bhikkhusaṅgho pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena nandamātāya upāsikāya nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho nandamātā upāsikā sāriputtamoggallānappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho nandamātā upāsikā āyasmantaṃ sāriputtaṃ bhuttāviṃ onītapattapāṇiṃ ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho nandamātaraṃ upāsikaṃ āyasmā sāriputto etadavoca – ‘‘ko pana te, nandamāte, bhikkhusaṅghassa abbhāgamanaṃ ārocesī’’ti? ‘‘Idhāhaṃ, bhante, rattiyā paccūsasamayaṃ paccuṭṭhāya pārāyanaṃ sarena bhāsitvā tuṇhī ahosiṃ. Atha kho, bhante, vessavaṇo mahārājā mama kathāpariyosānaṃ viditvā abbhānumodi – ‘sādhu, bhagini, sādhu, bhaginī’ti! ‘Ko paneso, bhadramukhā’ti? ‘Ahaṃ te, bhagini, bhātā vessavaṇo, mahārājā’ti. ‘Sādhu, bhadramukha, tena hi yo me ayaṃ dhammapariyāyo bhaṇito idaṃ te hotu ātitheyya’nti. ‘Sādhu, bhagini, etañceva me hotu ātitheyyaṃ. Sveva sāriputtamoggallānappamukho bhikkhusaṅgho akatapātarāso veḷukaṇḍakaṃ āgamissati, tañca bhikkhusaṅghaṃ parivisitvā mama dakkhiṇaṃ ādiseyyāsi. Etañceva [etañca (sī.), evañca (syā.)] me bhavissati ātitheyya’nti. Yadidaṃ [yamidaṃ (ma. ni. 1.363)], bhante, dāne [puññaṃ hi taṃ (sī.), puññaṃ puññamahitaṃ (syā.), puññaṃ vā puññamahaṃ vā (pī.), puññaṃ vā puññamahī vā (ka.)] puññañca puññamahī ca taṃ [puññaṃ hi taṃ (sī.), puññaṃ puññamahitaṃ (syā.), puññaṃ vā puññamahaṃ vā (pī.), puññaṃ vā puññamahī vā (ka.)] vessavaṇassa mahārājassa sukhāya hotū’’ti. ‘‘Acchariyaṃ, nandamāte, abbhutaṃ, nandamāte! Yatra hi nāma vessavaṇena mahārājena evaṃmahiddhikena evaṃmahesakkhena devaputtena sammukhā sallapissasī’’ti. ‘‘Na kho me, bhante, eseva acchariyo abbhuto dhammo. Atthi me aññopi acchariyo abbhuto dhammo. Idha me, bhante, nando nāma ekaputtako piyo manāpo. Taṃ rājāno kismiñcideva pakaraṇe okassa pasayha jīvitā voropesuṃ. Tasmiṃ kho panāhaṃ, bhante, dārake gahite vā gayhamāne vā vadhe vā vajjhamāne vā hate vā haññamāne vā nābhijānāmi cittassa aññathatta’’nti. ‘‘Acchariyaṃ, nandamāte, abbhutaṃ nandamāte! Yatra hi nāma cittuppādampi [cittuppādamattampi (syā.)] parisodhessasī’’ti. ‘‘Na kho me, bhante, eseva acchariyo abbhuto dhammo. Atthi me aññopi acchariyo abbhuto dhammo. Idha me, bhante, sāmiko kālaṅkato aññataraṃ yakkhayoniṃ upapanno. So me teneva purimena attabhāvena uddassesi. Na kho panāhaṃ, bhante, abhijānāmi tatonidānaṃ cittassa aññathatta’’nti. ‘‘Acchariyaṃ, nandamāte, abbhutaṃ, nandamāte! Yatra hi nāma cittuppādampi parisodhessasī’’ti. ‘‘Na kho me, bhante, eseva acchariyo abbhuto dhammo. Atthi me aññopi acchariyo abbhuto dhammo. Yatohaṃ, bhante, sāmikassa daharasseva daharā ānītā nābhijānāmi sāmikaṃ manasāpi aticaritā [aticarituṃ (syā.), aticārittaṃ (ka.)], kuto pana kāyenā’’ti! ‘‘Acchariyaṃ, nandamāte, abbhutaṃ, nandamāte! Yatra hi nāma cittuppādampi parisodhessasī’’ti. ‘‘Na kho me, bhante, eseva acchariyo abbhuto dhammo. Atthi me aññopi acchariyo abbhuto dhammo. Yadāhaṃ, bhante, upāsikā paṭidesitā nābhijānāmi kiñci sikkhāpadaṃ sañcicca vītikkamitā’’ti. ‘‘Acchariyaṃ, nandamāte, abbhutaṃ, nandamāte’’ti! ‘‘Na kho me, bhante, eseva acchariyo abbhuto dhammo. Atthi me aññopi acchariyo abbhuto dhammo. Idhāhaṃ, bhante, yāvadeva [yāvadeva (sī. syā.) saṃ. ni. 2.152 pāḷi ca aṭṭhakathāṭīkā ca passitabbā] ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ vivekajaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Pītiyā ca virāgā upekkhikā ca viharāmi satā ca sampajānā sukhañca kāye paṭisaṃvedemi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharāmī’’ti. ‘‘Acchariyaṃ, nandamāte, abbhutaṃ, nandamāte’’ti! ‘‘Na kho me, bhante, eseva acchariyo abbhuto dhammo. Atthi me aññopi acchariyo abbhuto dhammo. Yānimāni, bhante, bhagavatā desitāni pañcorambhāgiyāni saṃyojanāni nāhaṃ tesaṃ kiñci attani appahīnaṃ samanupassāmī’’ti. ‘‘Acchariyaṃ, nandamāte, abbhutaṃ, nandamāte’’ti! Atha kho āyasmā sāriputto nandamātaraṃ upāsikaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmīti. Dasamaṃ. ",
      "english": "Thus have I heard. On one occasion, the Venerable Sāriputta and the Venerable Mahāmoggallāna were wandering in Dakkhiṇāgiri (Southern Mountains) together with a great community of bhikkhus. Now at that time, the lay follower Nandamātā from Veḷukaṇḍakī, having risen in the late night, was reciting the Pārāyana in a loud voice. At that time, Vessavaṇa, the Great King, was going from the northern direction to the southern direction for some purpose. Great King Vessavaṇa heard the lay follower Nandamātā reciting the Pārāyana in a loud voice, and having heard it, he waited until the end of the recitation. Then, the lay follower Nandamātā, having recited the Pārāyana in a loud voice, became silent. Then, Great King Vessavaṇa, knowing that the lay follower Nandamātā's recitation had ended, applauded, saying, \"Excellent, sister! Excellent, sister!\"\n\n\"Who is this, good sir?\"\n\"I am your brother, Vessavaṇa, the Great King.\"\n\"Excellent, good sir! In that case, let this teaching of the Dhamma which I have recited be your hospitality.\"\n\"Excellent, sister! Let this indeed be my hospitality. Tomorrow morning, the community of bhikkhus led by Sāriputta and Moggallāna will come to Veḷukaṇḍakī without having had their morning meal. Having served that community of bhikkhus, you should dedicate the merit to me. This too will be my hospitality.\"\n\nThen, after the passing of that night, the lay follower Nandamātā prepared delicious hard and soft foods in her own residence. Then, the community of bhikkhus led by Sāriputta and Moggallāna, without having had their morning meal, arrived at Veḷukaṇḍakī. Then the lay follower Nandamātā called a certain man and said, \"Come, good man, go to the monastery and announce the time to the community of bhikkhus, saying, 'It is time, Venerable Sirs; the meal is ready at the residence of the noble Nandamātā.'\" \"Yes, noble lady,\" that man, having assented to the lay follower Nandamātā, went to the monastery and announced the time to the community of bhikkhus: \"It is time, Venerable Sirs; the meal is ready at the residence of the noble Nandamātā.\" Then, the community of bhikkhus led by Sāriputta and Moggallāna, having dressed in the morning, took their bowls and robes and went to the residence of the lay follower Nandamātā; having arrived, they sat down on the prepared seats. Then the lay follower Nandamātā, with her own hands, satisfied and served the community of bhikkhus led by Sāriputta and Moggallāna with delicious hard and soft foods.\n\nThen the lay follower Nandamātā sat down to one side, after the Venerable Sāriputta had finished eating and put his bowl away. The Venerable Sāriputta then said to the lay follower Nandamātā, who was sitting to one side, \"Nandamātā, who announced the arrival of the community of bhikkhus to you?\"\n\n\"Here, Venerable Sir, I arose in the late night and, having recited the Pārāyana in a loud voice, became silent. Then, Venerable Sir, Great King Vessavaṇa, knowing that my recitation had ended, applauded, saying, 'Excellent, sister! Excellent, sister!' 'Who is this, good sir?' 'I am your brother, Vessavaṇa, the Great King.' 'Excellent, good sir! In that case, let this teaching of the Dhamma which I have recited be your hospitality.' 'Excellent, sister! Let this indeed be my hospitality. Tomorrow morning, the community of bhikkhus led by Sāriputta and Moggallāna will come to Veḷukaṇḍakī without having had their morning meal. Having served that community of bhikkhus, you should dedicate the merit to me. This too will be my hospitality.' Whatever merit, Venerable Sir, there is in this gift, may that merit be for the happiness of Great King Vessavaṇa.\"\n\n\"It is wonderful, Nandamātā! It is astonishing, Nandamātā! That you should converse face-to-face with Great King Vessavaṇa, a deva-son of such great power and such great might.\"\n\n\"Venerable Sir, this is not the only wonderful and astonishing phenomenon for me. There is another wonderful and astonishing phenomenon for me. Here, Venerable Sir, I had an only son named Nanda, who was dear and pleasing to me. The king's men, for some reason, forcibly deprived him of his life. Yet, Venerable Sir, when that child was being seized or about to be seized, being killed or about to be killed, having been killed or about to be killed, I do not recall any change in my mind.\"\n\n\"It is wonderful, Nandamātā! It is astonishing, Nandamātā! That you should purify even the arising of a thought!\"\n\nIndeed, venerable sir, this is not the only amazing and wonderful quality I possess. I have another amazing and wonderful quality. Here, venerable sir, my husband passed away and was reborn into a certain class of yakkhas. He appeared to me in that very previous form of existence. Indeed, venerable sir, I do not recall my mind ever having been disturbed on account of that.\n\nIt is amazing, Nandamātā, it is wonderful, Nandamātā! That you could purify even the arising of a thought!\n\nIndeed, venerable sir, this is not the only amazing and wonderful quality I possess. I have another amazing and wonderful quality. For, venerable sir, ever since I, a young girl, was brought to my young husband, I do not recall ever having transgressed against him even in thought, much less in body!\n\nIt is amazing, Nandamātā, it is wonderful, Nandamātā! That you could purify even the arising of a thought!\n\nIndeed, venerable sir, this is not the only amazing and wonderful quality I possess. I have another amazing and wonderful quality. For, venerable sir, since I declared myself a lay follower, I do not recall ever having intentionally transgressed any training rule.\n\nIt is amazing, Nandamātā, it is wonderful, Nandamātā!\n\nIndeed, venerable sir, this is not the only amazing and wonderful quality I possess. I have another amazing and wonderful quality. Here, venerable sir, whenever I wish, quite secluded from sensual pleasures, secluded from unwholesome states, I enter and remain in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and pleasure. With the calming of initial application and sustained application, through the internal serene assurance and unification of mind, without initial application and sustained application, I enter and remain in the second jhāna, which is born of seclusion, filled with rapture and pleasure. With the fading away of rapture, I abide in equanimity, mindful and clearly comprehending, and I experience pleasure with the body. I enter and remain in the third jhāna, of which the noble ones declare, ‘He dwells equanimous, mindful, and in pleasure.’ With the abandoning of pleasure and pain, and with the previous disappearance of joy and sorrow, I enter and remain in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness.\n\nIt is amazing, Nandamātā, it is wonderful, Nandamātā!\n\nIndeed, venerable sir, this is not the only amazing and wonderful quality I possess. I have another amazing and wonderful quality. Venerable sir, as for these five lower fetters taught by the Bhagavā, I do not perceive any of them remaining unabandoned in myself.\n\nIt is amazing, Nandamātā, it is wonderful, Nandamātā!\n\nThen, the venerable Sāriputta, having instructed, inspired, encouraged, and gladdened the lay follower Nandamātā with a Dhamma talk, rose from his seat and departed.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයකදී ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ සහ ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ මහත් භික්ෂුසංඝයක් සමඟ දක්ඛිණාගිරි ජනපදයේ චාරිකාවේ වැඩ සිටියහ. ඒ අවස්ථාවේදී වේළුකණ්ඩකී නන්දමාතා උපාසිකාව රාත්‍රියේ අලුයම් කාලයේදී පිබිද නැගිට පාරායන සූත්‍ර පාඨ හඬ නගා සජ්ඣායනා කරමින් සිටියාය. ඒ අවස්ථාවේදී වෛශ්‍රවණ මහා රාජයා උතුරු දිශාවේ සිට දකුණු දිශාවට කිසියම් දෙව් කටයුත්තක් නිසාවෙන් ගමන් කරමින් සිටියේය. වෛශ්‍රවණ මහා රාජයාට නන්දමාතා උපාසිකාව පාරායනය හඬ නගා සජ්ඣායනා කරන හඬ ඇසිණි. එය අසා සජ්ඣායනාව අවසන් වන තෙක් බලා සිටිමින් ඔහු සිටගෙන සිටියේය. ඉන්පසු නන්දමාතා උපාසිකාව පාරායනය හඬ නගා සජ්ඣායනා කර අවසන් කොට නිහඬ වූවාය. ඉන්පසු වෛශ්‍රවණ මහා රාජයා නන්දමාතා උපාසිකාවගේ සජ්ඣායනාව අවසන් වූ බව දැන ‘‘සාදු, නැගණියනි, සාදු, නැගණියනි!’’ යැයි අනුමෝදන් විය. ‘‘පින්වත, මේ කවරෙක්ද?’’ (උපාසිකාව ඇසීය.) ‘‘නැගණියනි, මම ඔබට සොහොයුරු වෛශ්‍රවණ මහා රාජයා වෙමි’’ යැයි ඔහු කීය. ‘‘සාදු, පින්වත, එසේ නම් මා විසින් දැන් සජ්ඣායනා කරන ලද මේ ධර්ම පර්යායය ඔබට ආගන්තුක සත්කාරයක් වේවා!’’ යැයි උපාසිකාව කීය. ‘‘සාදු, නැගණියනි, මට එයම ආගන්තුක සත්කාරයක් වේවා! හෙටම සාරිපුත්ත, මොග්ගල්ලාන ප්‍රමුඛ භික්ෂුසංඝයා වහන්සේ දානයට නොවැළඳා වේළුකණ්ඩක ගමට වඩින සේක. ඒ භික්ෂුසංඝයාට දානය පිළිගන්වා මට පින අනුමෝදන් කරන්න. එයද මට ආගන්තුක සත්කාරයක් වන්නේය!’’ යැයි කීවේය.\n\nඉන්පසු නන්දමාතා උපාසිකාව ඒ රාත්‍රිය ගෙවී ගිය පසු තම නිවසේදී ප්‍රණීත වූ කැවිලි, කෑම සකස් කරවීය. ඉන්පසු සාරිපුත්ත, මොග්ගල්ලාන ප්‍රමුඛ භික්ෂුසංඝයා වහන්සේ දානයට නොවැළඳා වේළුකණ්ඩක නම් ගම වෙත වැඩම කළ සේක. ඉන්පසු නන්දමාතා උපාසිකාව එක් පුරුෂයෙකු කැඳවා ‘‘පින්වත් පුරුෂය, ඔබ එන්න, ආරාමයට ගොස් භික්ෂුසංඝයාට ‘වහන්ස, වේලාවයි, ආර්යාව වන නන්දමාතාගේ නිවසේ දානය සූදානම්ය’ කියා කාලය දන්වන්න’’ යැයි කීවාය. ‘‘එසේය, ආර්යාවෙනි’’ යැයි ඒ පුරුෂයා නන්දමාතා උපාසිකාවට ප්‍රතිඥා දී ආරාමයට ගොස් භික්ෂුසංඝයාට ‘‘වහන්ස, වේලාවයි, ආර්යාව වන නන්දමාතාගේ නිවසේ දානය සූදානම්ය’’ කියා කාලය දන්වා කීවේය. ඉන්පසු සාරිපුත්ත, මොග්ගල්ලාන ප්‍රමුඛ භික්ෂුසංඝයා වහන්සේ පෙරවරුවේ සිවුරු පොරවාගෙන, පාත්‍ර සිවුරු ද රැගෙන නන්දමාතා උපාසිකාවගේ නිවස වෙත වැඩම කළ සේක; එහි වැඩම කොට පනවන ලද ආසනවල වැඩ සිටි සේක. ඉන්පසු නන්දමාතා උපාසිකාව සාරිපුත්ත, මොග්ගල්ලාන ප්‍රමුඛ භික්ෂුසංඝයා වහන්සේට ප්‍රණීත වූ කැවිලි හා කෑමෙන් තම දෑතින්ම සංතර්පණය කොට, සතුටු කළාය. ඉන්පසු නන්දමාතා උපාසිකාව ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ වළඳා අවසන් වී, පාත්‍රය අතින් පහත තබන ලද කල්හි එක් පසෙකින් වාඩි වූවාය.\n\nඑක් පසෙකින් වාඩි වී සිටි නන්දමාතා උපාසිකාවට ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ මෙසේ වදාළ සේක: ‘‘නන්දමාතාවෙනි, භික්ෂුසංඝයා වඩින බව ඔබට දන්වා සිටියේ කවරෙක්ද?’’ ‘‘වහන්ස, මෙහිදී මම රාත්‍රියේ අලුයම් කාලයේදී පිබිද නැගිට පාරායනය හඬ නගා සජ්ඣායනා කර නිහඬ වූයෙමි. ඉන්පසු, වහන්ස, වෛශ්‍රවණ මහා රාජයා මාගේ සජ්ඣායනාව අවසන් වූ බව දැන ‘සාදු, නැගණියනි, සාදු, නැගණියනි!’ කියා අනුමෝදන් විය. ‘පින්වත, මේ කවරෙක්ද?’ (මා ඇසීය.) ‘නැගණියනි, මම ඔබට සොහොයුරු වෛශ්‍රවණ මහා රාජයා වෙමි’ යැයි ඔහු කීය. ‘සාදු, පින්වත, එසේ නම් මා විසින් දැන් සජ්ඣායනා කරන ලද මේ ධර්ම පර්යායය ඔබට ආගන්තුක සත්කාරයක් වේවා!’ යැයි මා කීය. ‘සාදු, නැගණියනි, මට එයම ආගන්තුක සත්කාරයක් වේවා! හෙටම සාරිපුත්ත, මොග්ගල්ලාන ප්‍රමුඛ භික්ෂුසංඝයා වහන්සේ දානයට නොවැළඳා වේළුකණ්ඩක ගමට වඩින සේක. ඒ භික්ෂුසංඝයාට දානය පිළිගන්වා මට පින අනුමෝදන් කරන්න. එයද මට ආගන්තුක සත්කාරයක් වන්නේය’ යැයි ඔහු කීය. වහන්ස, මේ දානයේ යම් පිනක් (පුණ්‍ය මහිමයක්) වේ නම්, ඒ වෛශ්‍රවණ මහා රාජයාට සැප පිණිසම වේවා!’’\n\n‘‘නන්දමාතාවෙනි, එය ආශ්චර්යයකි, නන්දමාතාවෙනි, එය පුදුමයකි! කවර නම් අවස්ථාවක මෙතරම් මහත් ඍද්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති වෛශ්‍රවණ මහා රාජ නම් දෙව්පුත්‍රයා සමඟ ඔබ මුහුණට මුහුණ කතා කළාය.’’ ‘‘වහන්ස, මෙය පමණක් මට ආශ්චර්යවත් වූ හෝ පුදුම වූ ධර්මයක් නොවේ. මට තවත් ආශ්චර්යවත් වූ පුදුම වූ ධර්මයක් ඇත. වහන්ස, මෙහිදී මට නන්ද නම් වූ, ප්‍රිය මනාප වූ එකම පුත්‍රයෙක් විය. රජවරු ඒ පුත්‍රයා කිසියම් කරුණක් (වරදක්) නිසා බලහත්කාරයෙන් ජීවිතක්ෂයට පත් කළහ. වහන්ස, ඒ දරුවා අත්අඩංගුවට ගන්නා විට හෝ ගන්නා අතරතුරදී හෝ, ඝාතනය කරන විට හෝ ඝාතනය කරමින් සිටින විට හෝ, මරණයට පත් කළ විට හෝ මරණයට පත් කරමින් සිටින විට හෝ, මාගේ සිතේ කිසිදු වෙනසක් ඇති වූ බවක් නොදනිමි.’’ ‘‘නන්දමාතාවෙනි, එය ආශ්චර්යයකි, නන්දමාතාවෙනි, එය පුදුමයකි! කවර නම් අවස්ථාවක සිතිවිල්ලක් පවා පිරිසිදු කර ගත්තාය.’’\n\nස්වාමීන් වහන්ස, මාගේ මේ පුදුමාකාර ආශ්චර්යවත් ධර්මය පමණක් නොවේ. මා හට තවත් පුදුමාකාර ආශ්චර්යවත් ධර්මයක් ඇත. ස්වාමීන් වහන්ස, මෙහිදී මාගේ ස්වාමිපුරුෂයා මිය පරලොව ගොස් යම්කිසි යක්ෂ යෝනියක උපත ලැබීය. ඔහු පෙර භවයේ සිටි ඔහුගේ ස්වරූපයෙන්ම මට දර්ශනය විය. එහෙත් ස්වාමීන් වහන්ස, ඒ හේතුවෙන් මාගේ සිතේ කිසිදු වෙනසක් ඇති වූ බවක් මම නොදනිමි.\n\nනන්දමාතාව, එය ආශ්චර්යයකි, පුදුම සහගතය! යම් හෙයකින් ඔබ සිතේ හටගන්නා ක්ෂණික සිතුවිලි පවා පිරිසිදු කරන්නේ නම්.\n\nස්වාමීන් වහන්ස, මාගේ මේ පුදුමාකාර ආශ්චර්යවත් ධර්මය පමණක් නොවේ. මා හට තවත් පුදුමාකාර ආශ්චර්යවත් ධර්මයක් ඇත. ස්වාමීන් වහන්ස, මා තරුණ වියේදීම, තරුණ වූ මගේ ස්වාමිපුරුෂයා වෙත ගෙන එන ලද්දීය. එතැන් පටන් මාගේ ස්වාමිපුරුෂයාට සිතින් පවා වරදක් කළ බවක් මම නොදනිමි. කයින් කිරීම ගැන කවර කතාද!\n\nනන්දමාතාව, එය ආශ්චර්යයකි, පුදුම සහගතය! යම් හෙයකින් ඔබ සිතේ හටගන්නා ක්ෂණික සිතුවිලි පවා පිරිසිදු කරන්නේ නම්.\n\nස්වාමීන් වහන්ස, මාගේ මේ පුදුමාකාර ආශ්චර්යවත් ධර්මය පමණක් නොවේ. මා හට තවත් පුදුමාකාර ආශ්චර්යවත් ධර්මයක් ඇත. ස්වාමීන් වහන්ස, මා උපසිකාවක් වූ දා පටන් කිසිදු සික්ෂාපදයක් හිතාමතා කඩ කළ බවක් මම නොදනිමි.\n\nනන්දමාතාව, එය ආශ්චර්යයකි, පුදුම සහගතය!\n\nස්වාමීන් වහන්ස, මාගේ මේ පුදුමාකාර ආශ්චර්යවත් ධර්මය පමණක් නොවේ. මා හට තවත් පුදුමාකාර ආශ්චර්යවත් ධර්මයක් ඇත. ස්වාමීන් වහන්ස, මා යම් විටෙක කැමති නම්, කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති, පළමු ධ්‍යානයට සමවදින්නෙමි. විතර්ක සහ විචාරයන් සංසිඳීමෙන්, අධ්‍යාත්මිකව පහන් වූ, සිතේ ඒකාග්‍රතාවය ඇති, විතර්ක රහිත, විචාර රහිත, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති, දෙවන ධ්‍යානයට සමවදින්නෙමි. ප්‍රීතියෙන්ද වියෝ වී, උපේක්ෂාවෙන් යුක්තව වාසය කරන්නෙමි, සිහි නුවණින් යුක්තව කයෙහි සැපය අත්විඳින්නෙමි. ආර්යයෝ යමක් 'උපේක්ෂාවෙන් යුක්ත වූ, සිහියෙන් යුක්ත වූ, සැපයෙන් වාසය කරන්නා' යැයි කියත්ද, ඒ තෙවන ධ්‍යානයට සමවදින්නෙමි. සැපය ද දුක ද ප්‍රහාණය කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන්ගේ අතුරුදහන් වීමෙන්, දුක් නොවන සැප නොවන, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට සමවදින්නෙමි.\n\nනන්දමාතාව, එය ආශ්චර්යයකි, පුදුම සහගතය!\n\nස්වාමීන් වහන්ස, මාගේ මේ පුදුමාකාර ආශ්චර්යවත් ධර්මය පමණක් නොවේ. මා හට තවත් පුදුමාකාර ආශ්චර්යවත් ධර්මයක් ඇත. ස්වාමීන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ පහළ ඕරම්භාගීය සංයෝජන ධර්මයන්ගෙන් කිසිවක් මා තුළ ප්‍රහීණ නොවී ඇති බවක් මම නොදකිමි.\n\nනන්දමාතාව, එය ආශ්චර්යයකි, පුදුම සහගතය!\n\nඉක්බිති ආයුෂ්මත් ශ්‍රී‍්‍ර සාරිපුත්ත ස්වාමීන් වහන්සේ නන්දමාතා උපාසිකාවට ධර්ම කථාවකින් කරුණු පැහැදිලි කරවා, සමාදන් කරවා, ධෛර්යවත් කරවා, සතුටු කරවා, හුනස්නෙන් නැගිට වැඩම කළ සේක.",
      "paliTitle": "Nandamātāsuttaṃ",
      "englishTitle": "To Nanda’s Mother Sutta",
      "sinhalaTitle": "නන්දමාතා සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Mahāyaññavaggo pañcamo. Tassuddānaṃ – Ṭhiti ca parikkhāraṃ dve, aggī saññā ca dve parā; Methunā saṃyogo dānaṃ, nandamātena te dasāti. Paṭhamapaṇṇāsakaṃ samattaṃ.",
    "english": "The fifth chapter on the Great Sacrifice. The summary of it: Stability and two on Requisites, Fire, and two others on Perception; Sexual Intercourse, Fetter, Giving, and with Nanda's Mother—these ten. The first fifty is complete.",
    "sinhala": "පස්වන මහායඤ්ඤ වර්ගයයි. එහි උද්දානය නම්: ඨිති, පරික්ඛාර දෙකක්, අග්ගි, සඤ්ඤා දෙකක්, මෙථුන, සංයෝග, දාන සහ නන්දමාතා සූත්‍රයි. පළමු පණ්ණාසකය සමාප්තයි."
  }
}