{
  "id": "an7.4",
  "title": {
    "pali": "Devatāvaggo",
    "english": "The Chapter on Deities",
    "sinhala": "දේවතා වග්ගය"
  },
  "sections": [
    {
      "number": 32,
      "pali": "Atha kho aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho sā devatā bhagavantaṃ etadavoca – ‘‘Sattime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame satta? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, samādhigāravatā, appamādagāravatā, paṭisanthāragāravatā. Ime kho, bhante, satta dhammā bhikkhuno aparihānāya saṃvattantī’’ti. Idamavoca sā devatā. Samanuñño satthā ahosi. Atha kho sā devatā ‘‘samanuñño me satthā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho, bhikkhave, sā devatā maṃ etadavoca – ‘sattime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame satta? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, samādhigāravatā, appamādagāravatā, paṭisanthāragāravatā – ime kho, bhante, satta dhammā bhikkhuno aparihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. ‘‘Satthugaru dhammagaru, saṅghe ca tibbagāravo; Samādhigaru ātāpī [samādhigāravatāpi ca (ka.)], sikkhāya tibbagāravo. ‘‘Appamādagaru bhikkhu, paṭisanthāragāravo; Abhabbo parihānāya, nibbānasseva santike’’ti. paṭhamaṃ;",
      "english": "Then, when the night was far advanced, a certain deity, with resplendent beauty, having illuminated the entire Jeta Grove, approached where the Blessed One was. Having approached, she paid homage to the Blessed One and stood to one side. Standing to one side, that deity said this to the Blessed One: \"Venerable sir, these seven qualities lead to a monk's non-decline. Which seven? Reverence for the Teacher, reverence for the Dhamma, reverence for the Saṅgha, reverence for the training, reverence for concentration, reverence for diligence, and reverence for hospitality. Indeed, venerable sir, these seven qualities lead to a monk's non-decline.\" That deity said this. The Teacher assented. Then, thinking \"My Teacher has assented,\" that deity paid homage to the Blessed One, circumambulated him clockwise, and vanished right there.\n\nThen, at the end of that night, the Blessed One addressed the monastics: \"This night, monastics, a certain deity, when the night was far advanced, with resplendent beauty, having illuminated the entire Jeta Grove, approached where I was. Having approached, she paid homage to me and stood to one side. Standing to one side, monastics, that deity indeed said this to me: 'Venerable sir, these seven qualities lead to a monk's non-decline. Which seven? Reverence for the Teacher, reverence for the Dhamma, reverence for the Saṅgha, reverence for the training, reverence for concentration, reverence for diligence, and reverence for hospitality. Indeed, venerable sir, these seven qualities lead to a monk's non-decline.' That deity, monastics, said this. Having said this, she paid homage to me, circumambulated me clockwise, and vanished right there.\"\n\nThe monk who is respectful of the Teacher, respectful of the Dhamma, and deeply respectful of the Saṅgha; respectful of concentration, ardent, and deeply respectful of the training; a monk who is respectful of diligence, respectful of hospitality – he is incapable of decline, truly close to Nibbana.",
      "sinhala": "ඉන්පසු එක්තරා දෙවියෙක් අලංකාරවත් රාත්‍රියක, ඉතා ප්‍රභාවත් වූ වර්ණයෙන් යුක්තව, මුළු ජේතවනාරාමයම ආලෝකවත් කරමින් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක සිටගත්තේය. එකත්පසෙක සිටගත් ඒ දෙවියා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘භාග්‍යවතුන් වහන්ස, මේ ධර්ම සත භික්ෂුවගේ පරිහානියට පත් නොවීම පිණිස පවතී. ඒ සත කවරේද? ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, සමාධිය කෙරෙහි ගෞරවය, අප්‍රමාදය කෙරෙහි ගෞරවය, පිළිසඳර කෙරෙහි ගෞරවය. භාග්‍යවතුන් වහන්ස, මේ ධර්ම සත භික්ෂුවගේ පරිහානියට පත් නොවීම පිණිස පවතී.’’ ඒ දෙවියා මෙය පැවසීය. ශාස්තෘන් වහන්සේ එයට එකඟ වූ සේක. ඉන්පසු ඒ දෙවියා ‘‘ශාස්තෘන් වහන්සේ මා හා එකඟ වූ සේකැ’’යි සිතා, භාග්‍යවතුන් වහන්සේට වන්දනා කර, ප්‍රදක්ෂිණා කර, එතනම අතුරුදහන් විය.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය ගෙවී ගිය පසු භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කළ සේක: ‘‘මහණෙනි, මේ රාත්‍රියෙහි එක්තරා දෙවියෙක් අලංකාරවත් රාත්‍රියක, ඉතා ප්‍රභාවත් වූ වර්ණයෙන් යුක්තව, මුළු ජේතවනාරාමයම ආලෝකවත් කරමින් මා සිටි තැනට පැමිණියේය. පැමිණ, මට වන්දනා කර, එකත්පසෙක සිටගත්තේය. මහණෙනි, එකත්පසෙක සිටගත් ඒ දෙවියා මට මෙය පැවසීය: ‘භාග්‍යවතුන් වහන්ස, මේ ධර්ම සත භික්ෂුවගේ පරිහානියට පත් නොවීම පිණිස පවතී. ඒ සත කවරේද? ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, සමාධිය කෙරෙහි ගෞරවය, අප්‍රමාදය කෙරෙහි ගෞරවය, පිළිසඳර කෙරෙහි ගෞරවය. භාග්‍යවතුන් වහන්ස, මේ ධර්ම සත භික්ෂුවගේ පරිහානියට පත් නොවීම පිණිස පවතී.’ මහණෙනි, ඒ දෙවියා මෙය පැවසීය. මෙය පවසා මට වන්දනා කර, ප්‍රදක්ෂිණා කර, එතනම අතුරුදහන් විය.’’\n\n‘‘ශාස්තෘන් වහන්සේ කෙරෙහි ගරු කරන, ධර්මය කෙරෙහි ගරු කරන, සංඝයා කෙරෙහි ද දැඩි ගෞරවයෙන් යුක්ත වූ භික්ෂුව, සමාධිය කෙරෙහි ගරු කරන, කෙලෙස් තවන වීර්යයෙන් යුක්ත වූ, ශික්ෂාව කෙරෙහි දැඩි ගෞරවයෙන් යුක්ත වූ, අප්‍රමාදය කෙරෙහි ගරු කරන, පිළිසඳර කෙරෙහි ගරු කරන භික්ෂුව පරිහානියට පත් වීමට නොහැකි වන්නේය. ඔහු නිවනටම ආසන්න වන්නේය.’’",
      "paliTitle": "Appamādagāravasuttaṃ",
      "englishTitle": "Respect for Diligence Sutta",
      "sinhalaTitle": "අප්පමාද ගාරව සූත්‍රය"
    },
    {
      "number": 33,
      "pali": "‘‘Imaṃ, bhikkhave, rattiṃ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho, bhikkhave, sā devatā maṃ etadavoca – ‘sattime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame satta? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, samādhigāravatā, hirigāravatā, ottappagāravatā. Ime kho, bhante, satta dhammā bhikkhuno aparihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. ‘‘Satthugaru dhammagaru, saṅghe ca tibbagāravo; Samādhigaru ātāpī, sikkhāya tibbagāravo. ‘‘Hiri ottappasampanno, sappatisso sagāravo; Abhabbo parihānāya, nibbānasseva santike’’ti. dutiyaṃ;",
      "english": "“Monks, this night, a certain deity, when the night was far advanced, of surpassing beauty, illuminating the entire Jeta’s Grove, approached me; having approached, she paid homage to me and stood to one side. Monks, as she stood to one side, that deity spoke to me thus – ‘Venerable sir, these seven qualities conduce to a monk’s non-decline. Which seven? Reverence for the Teacher, reverence for the Dhamma, reverence for the Saṅgha, reverence for the training, reverence for concentration, reverence for moral shame, and reverence for moral dread. Indeed, Venerable sir, these seven qualities conduce to a monk’s non-decline.’ Monks, that deity said this. Having said this, she paid homage to me, circumambulated me clockwise, and vanished right there.”\n\nOne who reveres the Teacher, reveres the Dhamma, and has intense reverence for the Saṅgha;\nOne who reveres concentration, is ardently diligent, and has intense reverence for the training.\nEndowed with moral shame and moral dread, respectful and deferential;\nIs incapable of decline; indeed, such a one is close to Nibbāna.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ රාත්‍රියේ රාත්‍රිය බොහෝ සෙයින් ගෙවී ගිය විට, අතිශයින් ප‍්‍රභාමත් වූ වර්ණයෙන් යුක්තව, කිසියම් දෙවියෙක් මුළු ජේතවනාරාමයම බබළවමින් මා වෙත පැමිණියේය. මා වෙත පැමිණ, මට ආචාර කොට, එකත්පස්ව සිටියේය.\n\nභික්ෂූන් වහන්ස, එකත්පස්ව සිටි ඒ දෙවියා මට මෙසේ කීවේය: ‘ස්වාමීනි, මේ ධ‍ර්ම සත භික්ෂුවකගේ පිරිහීමට පත් නොවීම පිණිස පවතී. ඒ සත කවරේද?’\n\nශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවය, ධ‍ර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, සමාධිය කෙරෙහි ගෞරවය, හිරිය කෙරෙහි ගෞරවය, ඔත්තප්පය කෙරෙහි ගෞරවය යන මේ ධ‍ර්ම සත භික්ෂුවකගේ පිරිහීමට පත් නොවීම පිණිස පවතී’ යනුයි.\n\nභික්ෂූන් වහන්ස, ඒ දෙවියා මෙය කීවේය. මෙය පවසා, මට ආචාර කොට, පැදකුණු කොට, එතනම අතුරුදහන් විය’ යනුයි.\n\nශාස්තෘන් වහන්සේට ගරු කරන, ධ‍ර්මයට ගරු කරන, සංඝයා කෙරෙහි දැඩි ගෞරවයක් ඇත්තාවූ,\nසමාධියට ගරු කරන, වීර්යවන්ත වූ, ශික්ෂාව කෙරෙහි දැඩි ගෞරවයක් ඇත්තාවූ,\nහිරියෙන් හා ඔත්තප්පයෙන් යුක්ත වූ, ගරු කටයුතු තැනැත්තෙකු වූ, ගෞරවයෙන් යුක්ත වූ,\nපිරිහීමට පත් නොවන්නේය, නිර්වාණයටම සමීප වන්නේය.",
      "paliTitle": "Hirīgāravasuttaṃ",
      "englishTitle": "Respect with Shame Sutta",
      "sinhalaTitle": "හිරීගාරව සූත්‍රය"
    },
    {
      "number": 34,
      "pali": "‘‘Imaṃ, bhikkhave, rattiṃ aññatarā devatā…pe… maṃ etadavoca – ‘sattime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame satta? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, samādhigāravatā, sovacassatā, kalyāṇamittatā. Ime kho, bhante, satta dhammā bhikkhuno aparihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. ‘‘Satthugaru dhammagaru, saṅghe ca tibbagāravo; Samādhigaru ātāpī, sikkhāya tibbagāravo. ‘‘Kalyāṇamitto suvaco, sappatisso sagāravo; Abhabbo parihānāya, nibbānasseva santike’’ti. tatiyaṃ;",
      "english": "Monks, this night, a certain deity, having approached me and stood to one side, said this to me: ‘Venerable Sir, these seven qualities lead to a monk’s non-decline. Which seven? They are: profound reverence for the Teacher, profound reverence for the Dhamma, profound reverence for the Sangha, profound reverence for the training, profound reverence for concentration, amenability to instruction, and noble friendship. Venerable Sir, these seven qualities indeed lead to a monk’s non-decline.’ Monks, that deity said this. Having said this, having paid homage to me, having circumambulated me with their right side towards me, they vanished right there.\n\nOne who reveres the Teacher, reveres the Dhamma, and has intense reverence for the Sangha;\nwho reveres concentration, is ardent, and has intense reverence for the training;\nwho is a noble friend, amenable to instruction, respectful, and reverent—\nsuch a one is incapable of decline and is indeed close to Nibbāna.",
      "sinhala": "භික්ෂූණි, මේ රාත්‍රියේ එක්තරා දෙවියෙක් (මා වෙත පැමිණ) මෙසේ කීවේය: ‘ස්වාමීනි, භික්ෂුවකට පිරිහීමක් සිදු නොවන පිණිස මේ ධර්ම සත හේතුවේ. කවර සතක්ද යත්: ශාස‍්ත්‍රූන් වහන්සේ කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, සමාධිය කෙරෙහි ගෞරවය, සුවච බව සහ කල්‍යාණ මි‍ත්‍ර සේවනයයි. ස්වාමීනි, භික්ෂුවකට පිරිහීමක් සිදු නොවන පිණිස මේ ධර්ම සත හේතුවේය.’ භික්ෂූණි, ඒ දෙවියන් එසේ කීවේය. එසේ කියා මා වැඳ, පැදකුණු කොට, එතැනම අතුරුදහන් විය.\n\nශාස‍්ත්‍රූන් වහන්සේ කෙරෙහි ගෞරවය ඇති, ධර්මය කෙරෙහි ගෞරවය ඇති, සංඝයා කෙරෙහි දැඩි ගෞරවය ඇති; සමාධිය කෙරෙහි ගෞරවය ඇති, වීර්යවන්ත වූ, ශික්ෂාව කෙරෙහි දැඩි ගෞරවය ඇති (භික්ෂුව); කල්‍යාණ මි‍ත්‍ර සේවනයෙහි නියුක්ත වූ, සුවච වූ, ආදරයෙන් හා ගෞරවයෙන් යුක්ත වූ (එබඳු භික්ෂුව) පිරිහීමට පත් නොවීමට සමර්ථය. ඒකාන්තයෙන් නිවනටම ආසන්නය.",
      "paliTitle": "Paṭhamasovacassatāsuttaṃ",
      "englishTitle": "The First Discourse on Amenability to Correction",
      "sinhalaTitle": "පළමු සෝවචස්සතා සූත්‍රය"
    },
    {
      "number": 35,
      "pali": "‘‘Imaṃ, bhikkhave, rattiṃ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā…pe… ‘sattime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame satta? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, samādhigāravatā, sovacassatā, kalyāṇamittatā. Ime kho, bhante, satta dhammā bhikkhuno aparihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. Evaṃ vutte āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘imassa kho ahaṃ, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmi. Idha, bhante, bhikkhu attanā ca satthugāravo hoti, satthugāravatāya ca vaṇṇavādī. Ye caññe bhikkhū na satthugāravā te ca satthugāravatāya samādapeti. Ye caññe bhikkhū satthugāravā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena. Attanā ca dhammagāravo hoti…pe… saṅghagāravo hoti… sikkhāgāravo hoti… samādhigāravo hoti… suvaco hoti… kalyāṇamitto hoti, kalyāṇamittatāya ca vaṇṇavādī. Ye caññe bhikkhū na kalyāṇamittā te ca kalyāṇamittatāya samādapeti. Ye caññe bhikkhū kalyāṇamittā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālenāti. Imassa kho ahaṃ, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmī’’ti. ‘‘Sādhu sādhu, sāriputta! Sādhu kho tvaṃ, sāriputta, imassa mayā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāsi. Idha, sāriputta, bhikkhu attanā ca satthugāravo hoti, satthugāravatāya ca vaṇṇavādī. Ye caññe bhikkhū na satthugāravā te ca satthugāravatāya samādapeti. Ye caññe bhikkhū satthugāravā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena. Attanā ca dhammagāravo hoti…pe… saṅghagāravo hoti… sikkhāgāravo hoti… samādhigāravo hoti… suvaco hoti… kalyāṇamitto hoti, kalyāṇamittatāya ca vaṇṇavādī. Ye caññe bhikkhū na kalyāṇamittā te ca kalyāṇamittatāya samādapeti. Ye caññe bhikkhū kalyāṇamittā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālenāti. Imassa kho, sāriputta, mayā saṃkhittena bhāsitassa evaṃ vitthārena attho daṭṭhabbo’’ti. Catutthaṃ.",
      "english": "“This very night, monks, a certain deity, when the night was far advanced, appeared in resplendent beauty, illuminating the entire Jeta Grove. Having approached me, bowed down, and stood to one side, that deity said this to me:\n\n‘There are these seven principles, venerable sir, that lead to a monk's non-decline. What are these seven? Reverence for the Teacher, reverence for the Dhamma, reverence for the Sangha, reverence for the training, reverence for concentration, being amenable to instruction, and having admirable friends. Indeed, venerable sir, these seven principles lead to a monk's non-decline.’\n\nThat deity, monks, spoke thus. Having said this, she paid homage to me, circumambulated me with her right side towards me, and then vanished right there.”\n\nWhen this was said, the venerable Sāriputta then spoke to the Blessed One: “Venerable sir, I understand the meaning of what the Blessed One has stated concisely in this elaborated way. Here, venerable sir, a monk himself has reverence for the Teacher, and speaks in praise of reverence for the Teacher. And he encourages those other monks who do not have reverence for the Teacher to cultivate reverence for the Teacher. And for those other monks who do have reverence for the Teacher, he speaks praise of them that is factual, true, and timely. He himself has reverence for the Dhamma, and speaks in praise of reverence for the Dhamma. And he encourages those other monks who do not have reverence for the Dhamma to cultivate reverence for the Dhamma. And for those other monks who do have reverence for the Dhamma, he speaks praise of them that is factual, true, and timely. He himself has reverence for the Sangha, and speaks in praise of reverence for the Sangha. And he encourages those other monks who do not have reverence for the Sangha to cultivate reverence for the Sangha. And for those other monks who do have reverence for the Sangha, he speaks praise of them that is factual, true, and timely. He himself has reverence for the training, and speaks in praise of reverence for the training. And he encourages those other monks who do not have reverence for the training to cultivate reverence for the training. And for those other monks who do have reverence for the training, he speaks praise of them that is factual, true, and timely. He himself has reverence for concentration, and speaks in praise of reverence for concentration. And he encourages those other monks who do not have reverence for concentration to cultivate reverence for concentration. And for those other monks who do have reverence for concentration, he speaks praise of them that is factual, true, and timely. He himself is amenable to instruction. He himself has admirable friends, and speaks in praise of having admirable friends. And he encourages those other monks who do not have admirable friends to cultivate admirable friendship. And for those other monks who do have admirable friends, he speaks praise of them that is factual, true, and timely.\n\nVenerable sir, I understand the meaning of what the Blessed One has stated concisely in this elaborated way.”\n\n“Excellent, excellent, Sāriputta! It is excellent, Sāriputta, that you understand the meaning of what I have stated concisely in this elaborated way. Here, Sāriputta, a monk himself has reverence for the Teacher, and speaks in praise of reverence for the Teacher. And he encourages those other monks who do not have reverence for the Teacher to cultivate reverence for the Teacher. And for those other monks who do have reverence for the Teacher, he speaks praise of them that is factual, true, and timely. He himself has reverence for the Dhamma, and speaks in praise of reverence for the Dhamma. And he encourages those other monks who do not have reverence for the Dhamma to cultivate reverence for the Dhamma. And for those other monks who do have reverence for the Dhamma, he speaks praise of them that is factual, true, and timely. He himself has reverence for the Sangha, and speaks in praise of reverence for the Sangha. And he encourages those other monks who do not have reverence for the Sangha to cultivate reverence for the Sangha. And for those other monks who do have reverence for the Sangha, he speaks praise of them that is factual, true, and timely. He himself has reverence for the training, and speaks in praise of reverence for the training. And he encourages those other monks who do not have reverence for the training to cultivate reverence for the training. And for those other monks who do have reverence for the training, he speaks praise of them that is factual, true, and timely. He himself has reverence for concentration, and speaks in praise of reverence for concentration. And he encourages those other monks who do not have reverence for concentration to cultivate reverence for concentration. And for those other monks who do have reverence for concentration, he speaks praise of them that is factual, true, and timely. He himself is amenable to instruction. He himself has admirable friends, and speaks in praise of having admirable friends. And he encourages those other monks who do not have admirable friends to cultivate admirable friendship. And for those other monks who do have admirable friends, he speaks praise of them that is factual, true, and timely. Indeed, Sāriputta, the meaning of what I have stated concisely should be understood in this elaborated way.”",
      "sinhala": "භික්ෂූන් වහන්ස, මේ රාත්‍රියේ එක්තරා දෙවියෙක් අභිරූපී රූසිරින් යුක්තව, මුළු ජේතවනාරාමයම බබළවමින්, මා කරා පැමිණ, මා වැඳ එකත්පසක සිටියේය. එකත්පසක සිටි ඒ දෙවියා මට මෙසේ කීය: ‘භාග්‍යවතුන් වහන්ස, මේ ධර්ම සත භික්ෂුවට පිරිහීමක් නොවීම පිණිස පවතී. කවර සතක්ද? ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් යුක්තවීම, ධර්මය කෙරෙහි ගෞරවයෙන් යුක්තවීම, සංඝයා කෙරෙහි ගෞරවයෙන් යුක්තවීම, ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්තවීම, සමාධිය කෙරෙහි ගෞරවයෙන් යුක්තවීම, අවවාද පිළිගැනීමේ හැකියාවෙන් (සෝවචස් බවෙන්) යුක්තවීම, කල්‍යාණමිත්‍රභාවය (යහපත් මිතුරන් ඇසුරුකිරීම). භාග්‍යවතුන් වහන්ස, මේ ධර්ම සත භික්ෂුවට පිරිහීමක් නොවීම පිණිස පවතී’යි.\n\nභික්ෂූන් වහන්ස, ඒ දෙවියා මෙය කීය. මෙය කියා, මා වැඳ, පැදකුණු කොට, එතනම අතුරුදහන් විය.\n\nමෙසේ පැවසූ විට ආයුෂ්මත් ශ්‍රී#zwj; සාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක: ‘භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් සංක්‍#zwj;ෂිප්තයෙන් දේශනා කරන ලද මේ අර්ථය මෙසේ විස්තර වශයෙන් මම දනිමි.\n\nභාග්‍යවතුන් වහන්ස, මෙහි භික්ෂුව තමා ද ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශාස්තෘ ගෞරවය වර්ණනා කරන්නෙක් ද වේ. ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද ශාස්තෘ ගෞරවයෙහි පිහිටුවයි. ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද ධර්ම#zwj;ය කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ධර්ම ගෞරවය වර්ණනා කරන්නෙක් ද වේ. ධර්ම#zwj;ය කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද ධර්ම ගෞරවයෙහි පිහිටුවයි. ධර්ම#zwj;ය කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වේ. සංඝ ගෞරවය වර්ණනා කරන්නෙක් ද වේ. සංඝයා කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද සංඝ ගෞරවයෙහි පිහිටුවයි. සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශික්ෂා ගෞරවය වර්ණනා කරන්නෙක් ද වේ. ශික්ෂාව කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද ශික්ෂා ගෞරවයෙහි පිහිටුවයි. ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද සමාධිය කෙරෙහි ගෞරවයෙන් යුක්ත වේ. සමාධි ගෞරවය වර්ණනා කරන්නෙක් ද වේ. සමාධිය කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද සමාධි ගෞරවයෙහි පිහිටුවයි. සමාධිය කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද අවවාද පිළිගැනීමේ හැකියාවෙන් (සෝවචස් බවෙන්) යුක්ත වේ. සෝවචස් බව වර්ණනා කරන්නෙක් ද වේ. අවවාද පිළිගැනීමේ හැකියාවක් (සෝවචස් බවක්) නැති අන්‍ය භික්ෂූන් ද සෝවචස් බවෙහි පිහිටුවයි. සෝවචස් බවෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද කල්‍යාණමිත්‍රයෙක් (හොඳ මිතුරෙක්) වේ. කල්‍යාණමිත්‍රභාවය වර්ණනා කරන්නෙක් ද වේ. කල්‍යාණමිත්‍රයන් නැති අන්‍ය භික්ෂූන් ද කල්‍යාණමිත්‍රභාවයෙහි පිහිටුවයි. කල්‍යාණමිත්‍රයන්ගෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි’යි.\n\n‘භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් සංක්‍#zwj;ෂිප්තයෙන් දේශනා කරන ලද මේ අර්ථය මෙසේ විස්තර වශයෙන් මම දනිමි’යි.\n\n‘සාධු! සාධු! සාරිපුත්ත, මා විසින් සංක්‍#zwj;ෂිප්තයෙන් දේශනා කරන ලද මේ අර්ථය මෙසේ විස්තර වශයෙන් ඔබ දන්නෙහි. එය ඉතා යහපති සාරිපුත්ත.\n\nමෙහි, සාරිපුත්ත, භික්ෂුව තමා ද ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශාස්තෘ ගෞරවය වර්ණනා කරන්නෙක් ද වේ. ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද ශාස්තෘ ගෞරවයෙහි පිහිටුවයි. ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද ධර්ම#zwj;ය කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ධර්ම ගෞරවය වර්ණනා කරන්නෙක් ද වේ. ධර්ම#zwj;ය කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද ධර්ම ගෞරවයෙහි පිහිටුවයි. ධර්ම#zwj;ය කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වේ. සංඝ ගෞරවය වර්ණනා කරන්නෙක් ද වේ. සංඝයා කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද සංඝ ගෞරවයෙහි පිහිටුවයි. සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශික්ෂා ගෞරවය වර්ණනා කරන්නෙක් ද වේ. ශික්ෂාව කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද ශික්ෂා ගෞරවයෙහි පිහිටුවයි. ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද සමාධිය කෙරෙහි ගෞරවයෙන් යුක්ත වේ. සමාධි ගෞරවය වර්ණනා කරන්නෙක් ද වේ. සමාධිය කෙරෙහි ගෞරවයක් නැති අන්‍ය භික්ෂූන් ද සමාධි ගෞරවයෙහි පිහිටුවයි. සමාධිය කෙරෙහි ගෞරවයෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද අවවාද පිළිගැනීමේ හැකියාවෙන් (සෝවචස් බවෙන්) යුක්ත වේ. සෝවචස් බව වර්ණනා කරන්නෙක් ද වේ. අවවාද පිළිගැනීමේ හැකියාවක් (සෝවචස් බවක්) නැති අන්‍ය භික්ෂූන් ද සෝවචස් බවෙහි පිහිටුවයි. සෝවචස් බවෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි. තමා ද කල්‍යාණමිත්‍රයෙක් (හොඳ මිතුරෙක්) වේ. කල්‍යාණමිත්‍රභාවය වර්ණනා කරන්නෙක් ද වේ. කල්‍යාණමිත්‍රයන් නැති අන්‍ය භික්ෂූන් ද කල්‍යාණමිත්‍රභාවයෙහි පිහිටුවයි. කල්‍යාණමිත්‍රයන්ගෙන් යුක්ත වූ අන්‍ය භික්ෂූන්ගේ ගුණ ද සත්‍ය ලෙස, යථාභූත ලෙස, සුදුසු කල්හි වර්ණනා කරයි.\n\nසාරිපුත්ත, මා විසින් සංක්‍#zwj;ෂිප්තයෙන් දේශනා කරන ලද මේ අර්ථය මෙසේ විස්තර වශයෙන් දැක්විය යුතුයි.’",
      "paliTitle": "Dutiyasovacassatāsuttaṃ",
      "englishTitle": "Second Sutta on Amiability",
      "sinhalaTitle": "දුතිය සෝවචස්සතා සූත්‍රය"
    },
    {
      "number": 36,
      "pali": "‘‘Sattahi, bhikkhave, aṅgehi samannāgato mitto sevitabbo. Katamehi sattahi? Duddadaṃ dadāti, dukkaraṃ karoti, dukkhamaṃ khamati, guyhamassa [guyhassa (ka.)] āvi karoti, guyhamassa [guyhaṃ assa (sī.), guyhassa (ka.)] pariguhati [parigūhati (sī. syā.), pariguyhati (ka.)], āpadāsu na jahati, khīṇena [khīṇe (ka.)] nātimaññati. Imehi kho, bhikkhave, sattahi aṅgehi samannāgato mitto sevitabbo’’ti. ‘‘Duddadaṃ dadāti mitto, dukkarañcāpi kubbati; Athopissa duruttāni, khamati dukkhamāni ca [dukkhamānipi (sī. syā.)]. ‘‘Guyhañca tassa [guyhamassa ca (syā.)] akkhāti, guyhassa parigūhati; Āpadāsu na jahāti, khīṇena nātimaññati. ‘‘Yamhi etāni ṭhānāni, saṃvijjantīdha [saṃvijjanti ca (ka.)] puggale; So mitto mittakāmena, bhajitabbo tathāvidho’’ti. pañcamaṃ;",
      "english": "Monks, a friend endowed with seven qualities should be cultivated. Which seven? He gives what is difficult to give, he does what is difficult to do, he endures what is difficult to bear, he reveals his own secrets to his friend, he guards his friend's secrets, he does not abandon him in times of misfortune, and he does not despise him when he is in decline. Indeed, monks, a friend endowed with these seven qualities should be cultivated.\n\nA friend gives what is difficult to give, and he also does what is difficult to do; moreover, he endures his harsh words and difficulties.\n\nHe reveals his own secrets to him, he guards the other's secrets; he does not abandon him in times of misfortune, he does not despise him when he is in decline.\n\nIn whom these qualities are found in a person here, such a friend should be cultivated by one who desires a friend.",
      "sinhala": "භික්‍ෂූන් වහන්සේලා, අංග සතකින් සමන්විත වූ මිත්‍රයෙකු ඇසුරු කළ යුතු යි. ඒ කවර සතක් ද යත්: දීමට අපහසු දේ දෙයි, කිරීමට අපහසු දේ කරයි, දරා ගැනීමට අපහසු දේ දරා ගනී, තමාගේ රහස්‍ය කරුණු ඔහුට හෙළි කරයි, ඔහුගේ රහස්‍ය කරුණු ආරක්‍ෂා කරයි, ආපදාවන්හි දී අත් නොහරියි, ධන සම්පත් ක්‍ෂය වූ කල්හි අවමන් නොකරයි. භික්‍ෂූන් වහන්සේලා, මේ අංග සතකින් සමන්විත වූ මිත්‍රයෙකු ඇසුරු කළ යුතු යි.\n\nමිත්‍රයා දීමට අපහසු දේ දෙයි, කිරීමට අපහසු දේ ද කරයි. තවද ඔහුගේ නපුරු වචන සහ දුක් දෙන දේ ද ඉවසා දරා ගනී. ඔහුට තම රහස්‍ය කරුණු ද හෙළි කරයි, ඔහුගේ රහස්‍ය කරුණු ආරක්‍ෂා කරයි. ආපදාවන්හි දී අත් නොහරියි, ධන සම්පත් ක්‍ෂය වූ කල්හි අවමන් නොකරයි.\n\nයම් පුද්ගලයෙකු තුළ මේ ගුණාංග පවතී ද, මිත්‍රත්වය අපේක්‍ෂා කරන තැනැත්තා එවැනි මිත්‍රයෙකු ඇසුරු කළ යුතු යි.",
      "paliTitle": "Paṭhamamittasuttaṃ",
      "englishTitle": "The First Discourse on Friends",
      "sinhalaTitle": "පළමු මිත්ත සූත්‍රය"
    },
    {
      "number": 37,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu mitto sevitabbo bhajitabbo payirupāsitabbo api panujjamānenapi [paṇujjamānenapi (sī.)]. Katamehi sattahi? Piyo ca hoti manāpo ca garu ca bhāvanīyo ca vattā ca vacanakkhamo ca gambhīrañca kathaṃ kattā hoti, no ca aṭṭhāne niyojeti. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu mitto sevitabbo bhajitabbo payirupāsitabbo api panujjamānenapī’’ti. ‘‘Piyo garu bhāvanīyo, vattā ca vacanakkhamo; Gambhīrañca kathaṃ kattā, no caṭṭhāne niyojako [niyojaye (sī. syā.)]. ‘‘Yamhi etāni ṭhānāni, saṃvijjantīdha puggale; So mitto mittakāmena, atthakāmānukampato; Api nāsiyamānena, bhajitabbo tathāvidho’’ti. chaṭṭhaṃ;",
      "english": "Monks, a monk endowed with seven qualities should be associated with, cultivated, and revered as a friend, even if one is being pushed away. Which seven? He is amiable and delightful; he is revered and inspiring; he is an advisor and patient with counsel; he speaks profound discourse and does not assign tasks inappropriately. Monks, a monk endowed with these seven qualities should be associated with, cultivated, and revered as a friend, even if one is being pushed away.\n\nAmiable, revered, inspiring, an advisor and patient with counsel; one who speaks profound discourse and does not assign tasks inappropriately—\nIn whom these qualities are found here in a person, that friend should be associated with by one who desires a friend, out of a desire for welfare and compassion, even if one is being harmed.",
      "sinhala": "මහණෙනි, ධර්‍ම සතකින් යුක්ත වූ භික්‍ෂු මිත්‍රයෙකු ආශ්‍රය කළ යුතුයි, ඇසුරු කළ යුතුයි, භජනය කළ යුතුයි, බැහැර කරනු ලබමින් වුව ද ඔහුට උවටැන් කළ යුතුයි. ඒ ධර්‍ම සත කවරේද? ඔහු ප්‍රිය වන්නෙක් ද වේ, මනරම් වන්නෙක් ද වේ, ගරු කළ යුතු කෙනෙක් ද වේ, වැඩිය යුතු කෙනෙක් ද වේ, අවවාද කරන කෙනෙක් ද වේ, කියන දේ ඉවසන කෙනෙක් ද වේ, ගැඹුරු දහම් කථා කියන්නෙක් ද වේ, අනුචිත කරුණු වල නොයොදවයි ද වේ. මහණෙනි, මේ ධර්‍ම සතින් යුක්ත වූ භික්‍ෂු මිත්‍රයෙකු ආශ්‍රය කළ යුතුයි, ඇසුරු කළ යුතුයි, භජනය කළ යුතුයි, බැහැර කරනු ලබමින් වුව ද ඔහුට උවටැන් කළ යුතුයි.\n\nප්‍රිය වූ, ගරු කළ යුතු වූ, (ගුණ) වැඩිය යුතු වූ, අවවාද කරන සුළු වූ, කියන දේ ඉවසන සුළු වූ; ගැඹුරු දහම් කථා පවසන, අනුචිත කරුණු වල නොයොදවන පුද්ගලයා; යම් පුද්ගලයෙකු තුළ මේ ගුණ ධර්‍ම පිහිටා තිබේද; මිතුරන් කැමති වන (මිත්‍රත්වය පතන) අය විසින්, යහපත හා අනුකම්පාව පෙරදැරිව; බැහැර කරනු ලබමින් වුව ද එවැනි මිත්‍රයෙකු ඇසුරු කළ යුතුයි.",
      "paliTitle": "Dutiyamittasuttaṃ",
      "englishTitle": "Second Sutta on Friends",
      "sinhalaTitle": "දුතිය මිත්ත සූත්‍රය"
    },
    {
      "number": 38,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu nacirasseva catasso paṭisambhidā sayaṃ abhiññā sacchikatvā upasampajja vihareyya. Katamehi sattahi? Idha, bhikkhave, bhikkhu ‘idaṃ me cetaso līnatta’nti yathābhūtaṃ pajānāti; ajjhattaṃ saṃkhittaṃ vā cittaṃ ‘ajjhattaṃ me saṃkhittaṃ citta’nti yathābhūtaṃ pajānāti; bahiddhā vikkhittaṃ vā cittaṃ ‘bahiddhā me vikkhittaṃ citta’nti yathābhūtaṃ pajānāti; tassa viditā vedanā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti; viditā saññā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti; viditā vitakkā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti; sappāyāsappāyesu kho panassa dhammesu hīnappaṇītesu kaṇhasukkasappatibhāgesu nimittaṃ suggahitaṃ hoti sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu nacirasseva catasso paṭisambhidā sayaṃ abhiññā sacchikatvā upasampajja vihareyyā’’ti. Sattamaṃ.",
      "english": "Monks, endowed with seven qualities, a bhikkhu will not long hence, having directly known and realized the four analytical knowledges, dwell in their attainment. With which seven? Here, monks, a bhikkhu truly understands: ‘This is the sluggishness of my mind.’ He truly understands when his mind is internally constricted: ‘My mind is internally constricted.’ He truly understands when his mind is externally scattered: ‘My mind is externally scattered.’ For him, feelings arise known, persist known, and cease known. Perceptions arise known, persist known, and cease known. Thoughts arise known, persist known, and cease known. Furthermore, for him, the characteristic mark of phenomena that are suitable and unsuitable, inferior and superior, dark and bright counterparts, is well-grasped, well-attended to, well-sustained, and well-penetrated by wisdom.\n\nIndeed, monks, a bhikkhu endowed with these seven qualities will not long hence, having directly known and realized the four analytical knowledges, dwell in their attainment.",
      "sinhala": "මහණෙනි, ධර්ම සතකින් සමන්වාගත වූ භික්ෂුවක් නොබෝ කලකින්ම සිව් පිළිසිඹියාවන් තමන් විසින්ම විශේෂ ඥානයෙන් ප‍්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරන්නේය.\n\nකවර සතකින්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුවක් ‘මාගේ සිත ලිහිල් බවට පත්ව ඇතැ’යි යථාභූතව දනී; තමා තුළම සංකුල වූ හෝ සිත ‘මාගේ සිත තමා තුළම සංකුලව ඇතැ’යි යථාභූතව දනී; බාහිර අරමුණුවල විසිරී ගිය හෝ සිත ‘මාගේ සිත බාහිර අරමුණුවල විසිරී ඇතැ’යි යථාභූතව දනී; ඔහුට වේදනා දැනගෙනම උපදී, දැනගෙනම පවතී, දැනගෙනම නැති වී යයි; සංඥා දැනගෙනම උපදී, දැනගෙනම පවතී, දැනගෙනම නැති වී යයි; විතර්ක දැනගෙනම උපදී, දැනගෙනම පවතී, දැනගෙනම නැති වී යයි; තවද, ඔහුට හිතකර වූද, අහිතකර වූද, හීන වූද, ප‍්‍රණීත වූද, අකුසල සහ කුසල දෙකොටස්වලට අදාළ වූ ධර්මයන්හි නිමිත්ත හොඳින් ග‍්‍රහණය කරගෙන සිටී, හොඳින් මෙනෙහි කර ඇත, හොඳින් තේරුම් ගෙන ඇත, ප‍්‍රඥාවෙන් හොඳින් විනිවිද දකිනු ලැබේ.\n\nමහණෙනි, මේ ධර්ම සතකින් සමන්වාගත වූ භික්ෂුවක් නොබෝ කලකින්ම සිව් පිළිසිඹියාවන් තමන් විසින්ම විශේෂ ඥානයෙන් ප‍්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරන්නේය.",
      "paliTitle": "Paṭhamapaṭisambhidāsuttaṃ",
      "englishTitle": "The First Discourse on Discrimination",
      "sinhalaTitle": "පළමු පටිසම්භිදා සූත්‍රය"
    },
    {
      "number": 39,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato sāriputto catasso paṭisambhidā sayaṃ abhiññā sacchikatvā upasampajja viharati. Katamehi sattahi? Idha, bhikkhave, sāriputto ‘idaṃ me cetaso līnatta’nti yathābhūtaṃ pajānāti; ajjhattaṃ saṃkhittaṃ vā cittaṃ ‘ajjhattaṃ me saṃkhittaṃ citta’nti yathābhūtaṃ pajānāti; bahiddhā vikkhittaṃ vā cittaṃ ‘bahiddhā me vikkhittaṃ citta’nti yathābhūtaṃ pajānāti; tassa viditā vedanā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti; viditā saññā… pe… vitakkā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti; sappāyāsappāyesu kho panassa dhammesu hīnappaṇītesu kaṇhasukkasappatibhāgesu nimittaṃ suggahitaṃ sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya. Imehi kho, bhikkhave, sattahi dhammehi samannāgato sāriputto catasso paṭisambhidā sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, Sāriputta, endowed with these seven qualities, having directly realized the four analytical knowledges for himself, dwells having entered upon them. Which seven?\n\nHere, monks, Sāriputta knows as it actually is, \"This is the sluggishness of my mind\"; or an inwardly constricted mind, he knows as it actually is, \"My mind is inwardly constricted\"; or an outwardly scattered mind, he knows as it actually is, \"My mind is outwardly scattered.\" For him, feelings arise known to him, persist known to him, and cease known to him. Known to him, perceptions arise, persist, and cease; known to him, thoughts arise, persist, and cease. Furthermore, concerning phenomena that are wholesome and unwholesome, inferior and superior, and those that are dark and bright with their counterparts, their characteristic sign is well-grasped, well-attended to, well-considered, and well-penetrated by wisdom.\n\nMonks, Sāriputta, endowed with these seven qualities, having directly realized the four analytical knowledges for himself, dwells having entered upon them.",
      "sinhala": "භික්ෂූණි, සාරිපුත්ත ස්ථවිරයන් වහන්සේ ධර්මයන් සතකින් යුක්තව, චතුර් ප්‍රතිසම්භිදා ස්වකීය අභිඥාවෙන් සාක්ෂාත් කරගෙන, උපසම්පදා වී වාසය කරති.\n\nඒ ධර්මයන් සත කවරේද?\n\nභික්ෂූණි, මෙහිලා සාරිපුත්ත ස්ථවිරයන් වහන්සේ 'මාගේ සිතේ මෙය මලානික බවකි' යැයි ඇති සැටියෙන් අවබෝධ කරති. අධ්‍යාත්මිකව සංකුචිත වූ සිතක් ඇති විට 'මාගේ සිත අධ්‍යාත්මිකව සංකුචිත වී ඇත' යැයි ඇති සැටියෙන් අවබෝධ කරති. බාහිරව විසිරුණු සිතක් ඇති විට 'මාගේ සිත බාහිරව විසිරී ඇත' යැයි ඇති සැටියෙන් අවබෝධ කරති.\n\nඋන්වහන්සේට වේදනා පහළවන්නේ දන්නා ස්වරූපයෙනි, පවතින්නේ දන්නා ස්වරූපයෙනි, අභාවයට යන්නේ දන්නා ස්වරූපයෙනි. සංඥාවෝ ද... විතර්කයෝ ද දන්නා ස්වරූපයෙන් පහළවෙති, දන්නා ස්වරූපයෙන් පවතිති, දන්නා ස්වරූපයෙන් අභාවයට යති.\n\nතවද, උන්වහන්සේට අනුකූල වූ ද, අනුකූල නොවන වූ ද, හීන වූ ද, ප්‍රණීත වූ ද, අකුසල සහ කුසල කොටස්වලට අයත් වූ ද ධර්මයන්හි නිමිත්ත ප්‍රඥාවෙන් මනාකොට ග්‍රහණය කර, මනාකොට මනසිකාරය යොමුකර, මනාකොට ධාරණය කර, මනාකොට විනිවිද දැක ඇත.\n\nභික්ෂූණි, මේ ධර්මයන් සතින් යුක්තව, සාරිපුත්ත ස්ථවිරයන් වහන්සේ චතුර් ප්‍රතිසම්භිදා ස්වකීය අභිඥාවෙන් සාක්ෂාත් කරගෙන, උපසම්පදා වී වාසය කරති.",
      "paliTitle": "Dutiyapaṭisambhidāsuttaṃ",
      "englishTitle": "Second Sutta on Analytical Powers",
      "sinhalaTitle": "දුතිය පටිසම්භිදා සූත්‍රය"
    },
    {
      "number": 40,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu cittaṃ vase [vasaṃ (ka.)] vatteti, no ca bhikkhu cittassa vasena vattati. Katamehi sattahi? Idha, bhikkhave, bhikkhu samādhikusalo hoti, samādhissa samāpattikusalo hoti, samādhissa ṭhitikusalo hoti, samādhissa vuṭṭhānakusalo hoti, samādhissa kalyāṇakusalo hoti, samādhissa gocarakusalo hoti, samādhissa abhinīhārakusalo hoti. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu cittaṃ vase vatteti, no ca bhikkhu cittassa vasena vattatī’’ti. Navamaṃ.",
      "english": "Monks, a bhikkhu endowed with seven qualities exercises mastery over his mind and is not swayed by his mind. Which seven? Here, monks, a bhikkhu is skilled in concentration, skilled in entering concentration, skilled in sustaining concentration, skilled in emerging from concentration, skilled in the wholesome nature of concentration, skilled in the domain of concentration, and skilled in directing concentration. Monks, it is with these seven qualities that a bhikkhu exercises mastery over his mind and is not swayed by his mind.",
      "sinhala": "මහණෙනි, ධර්මයන් සතකින් සමන්විත වූ භික්ෂුව තමාගේ සිත වසඟයෙහි පවත්වයි, එහෙත් භික්ෂුව සිතෙහි වසඟයෙහි නොපවතියි.\n\nඒ ධර්මයන් සත කවරේද?\n\nමහණෙනි, මෙහිලා භික්ෂුව සමාධිය පිළිබඳ දක්ෂ වේ, සමාධියට සමවැදීම පිළිබඳ දක්ෂ වේ, සමාධියෙහි පැවැත්ම පිළිබඳ දක්ෂ වේ, සමාධියෙන් නැගිටීම පිළිබඳ දක්ෂ වේ, සමාධිය යහපත්වීම පිළිබඳ දක්ෂ වේ, සමාධියෙහි ගෝචරය පිළිබඳ දක්ෂ වේ, සමාධිය මෙහෙයවීම පිළිබඳ දක්ෂ වේ.\n\nමහණෙනි, මේ ධර්මයන් සතින් සමන්විත වූ භික්ෂුව තමාගේ සිත වසඟයෙහි පවත්වයි, එහෙත් භික්ෂුව සිතෙහි වසඟයෙහි නොපවතියි.",
      "paliTitle": "Paṭhamavasasuttaṃ",
      "englishTitle": "The First Discourse on Mastery",
      "sinhalaTitle": "පළමු වස සූත්‍රය"
    },
    {
      "number": 41,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato sāriputto cittaṃ vase vatteti, no ca sāriputto cittassa vasena vattati. Katamehi sattahi? Idha, bhikkhave, sāriputto samādhikusalo hoti, samādhissa samāpattikusalo, samādhissa ṭhitikusalo, samādhissa vuṭṭhānakusalo, samādhissa kalyāṇakusalo, samādhissa gocarakusalo, samādhissa abhinīhārakusalo hoti. Imehi kho, bhikkhave, sattahi dhammehi samannāgato sāriputto cittaṃ vase vatteti, no ca sāriputto cittassa vasena vattatī’’ti. Dasamaṃ.",
      "english": "Monks, Sāriputta, endowed with seven qualities, masters his mind, and Sāriputta is not mastered by his mind.\n\nWhat are these seven? Here, monks, Sāriputta is skilled in concentration, skilled in entering concentration, skilled in maintaining concentration, skilled in emerging from concentration, skilled in the wholesome aspects of concentration, skilled in the range of concentration, and skilled in directing concentration. Monks, Sāriputta, being endowed with these seven qualities, masters his mind, and Sāriputta is not mastered by his mind.",
      "sinhala": "මහණෙනි, සාරිපුත්ත තෙරණුවෝ ධර්‍ම සතකින් යුක්තව සිටින නිසා සිත තමන්ගේ වසඟයෙහි පවත්වති; සාරිපුත්ත තෙරණුවෝ සිතේ වසඟයෙහි නො_පවතිති.\n\nඒ සත කවරේද යත්?\n\nමහණෙනි, මේ ශාසනයෙහි සාරිපුත්ත තෙරණුවෝ සමාධියෙහි දක්ෂ වෙති; සමාධියට සමවැදීමට දක්ෂ වෙති; සමාධියෙහි පිහිටීමට දක්ෂ වෙති; සමාධියෙන් නැඟීසිටීමට දක්ෂ වෙති; සමාධියෙහි යහපත් භාවයට දක්ෂ වෙති; සමාධියේ ගෝචරයෙහි දක්ෂ වෙති; සමාධිය යොමුකිරීමට දක්ෂ වෙති.\n\nමහණෙනි, සාරිපුත්ත තෙරණුවෝ මේ ධර්‍ම සතින් යුක්තව සිටින නිසා සිත තමන්ගේ වසඟයෙහි පවත්වති; සාරිපුත්ත තෙරණුවෝ සිතේ වසඟයෙහි නො_පවතිති.",
      "paliTitle": "Dutiyavasasuttaṃ",
      "englishTitle": "Second Sutta on Mastery",
      "sinhalaTitle": "දුතිය වස සූත්‍රය"
    },
    {
      "number": 42,
      "pali": "Atha kho āyasmā sāriputto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Atha kho āyasmato sāriputtassa etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ. Yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’’nti. Atha kho āyasmā sāriputto yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘yo hi koci, āvuso, dvādasavassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāyā’’ti. Atha kho āyasmā sāriputto tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandi nappaṭikkosi. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkāmi – ‘‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’ti. Atha kho āyasmā sāriputto sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisiṃ. Tassa mayhaṃ, bhante, etadahosi – ‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ. Yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’nti. Atha khvāhaṃ, bhante, yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamiṃ; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Tena kho pana, bhante, samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘yo hi koci, āvuso, dvādasavassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, niddaso bhikkhūti alaṃ vacanāyā’ti. Atha khvāhaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamiṃ [pakkāmiṃ (sī. syā.)] – ‘bhagavato santike etassa atthaṃ ājānissāmī’ti. Sakkā nu kho, bhante, imasmiṃ dhammavinaye kevalaṃ vassagaṇanamattena niddaso bhikkhu paññāpetu’’nti? ‘‘Na kho, sāriputta, sakkā imasmiṃ dhammavinaye kevalaṃ vassagaṇanamattena niddaso bhikkhu paññāpetuṃ. Satta kho imāni, sāriputta, niddasavatthūni mayā sayaṃ abhiññā sacchikatvā paveditāni. [a. ni. 7.20; dī. ni. 3.331] ‘‘Katamāni satta? Idha, sāriputta, bhikkhu sikkhāsamādāne tibbacchando hoti āyatiñca sikkhāsamādāne avigatapemo, dhammanisantiyā tibbacchando hoti āyatiñca dhammanisantiyā avigatapemo, icchāvinaye tibbacchando hoti āyatiñca icchāvinaye avigatapemo, paṭisallāne tibbacchando hoti āyatiñca paṭisallāne avigatapemo, vīriyārambhe tibbacchando hoti āyatiñca vīriyārambhe avigatapemo, satinepakke tibbacchando hoti āyatiñca satinepakke avigatapemo, diṭṭhipaṭivedhe tibbacchando hoti āyatiñca diṭṭhipaṭivedhe avigatapemo. Imāni kho, sāriputta, satta niddasavatthūni mayā sayaṃ abhiññā sacchikatvā paveditāni. Imehi kho, sāriputta, sattahi niddasavatthūhi samannāgato bhikkhu dvādasa cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāya; catubbīsati cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāya; chattiṃsati cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāya, aṭṭhacattārīsaṃ cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāyā’’ti. Ekādasamaṃ.",
      "english": "Then, in the forenoon, the Venerable Sāriputta, having dressed and taken his bowl and robe, entered Sāvatthī for alms. Then it occurred to the Venerable Sāriputta: \"It is indeed too early to wander for alms in Sāvatthī. What if I were to approach the park of the other sect ascetics?\" Then the Venerable Sāriputta approached the park of the other sect ascetics; having approached, he exchanged greetings with those other sect ascetics. Having concluded a courteous and memorable conversation, he sat down to one side. Now at that time, those other sect ascetics, having gathered and assembled, had this conversation amongst themselves: \"Friends, whoever it may be who for twelve full years observes the perfectly pure holy life, it is fitting to call him a 'blameless monk'.\" Then the Venerable Sāriputta neither approved nor disapproved of the speech of those other sect ascetics. Without approving or disapproving, he rose from his seat and departed, thinking: \"I will come to know the meaning of this statement in the presence of the Blessed One.\"\n\nThen, having wandered for alms in Sāvatthī, and after his meal, the Venerable Sāriputta, having returned from his alms round, approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. As he was sitting to one side, the Venerable Sāriputta said this to the Blessed One: \"Venerable Sir, in the forenoon, having dressed and taken my bowl and robe, I entered Sāvatthī for alms. To me then, Venerable Sir, it occurred: 'It is indeed too early to wander for alms in Sāvatthī. What if I were to approach the park of the other sect ascetics?' Then, Venerable Sir, I approached the park of the other sect ascetics; having approached, I exchanged greetings with those other sect ascetics. Having concluded a courteous and memorable conversation, I sat down to one side. Now at that time, Venerable Sir, those other sect ascetics, having gathered and assembled, had this conversation amongst themselves: 'Friends, whoever it may be who for twelve full years observes the perfectly pure holy life, it is fitting to call him a 'blameless monk'.' Then, Venerable Sir, I neither approved nor disapproved of the speech of those other sect ascetics. Without approving or disapproving, I rose from my seat and departed, thinking: 'I will come to know the meaning of this in the presence of the Blessed One.' Is it possible, Venerable Sir, in this Dhamma and Discipline, merely by counting years, to declare a monk blameless?\"\n\n\"No, Sāriputta, it is not possible in this Dhamma and Discipline merely by counting years to declare a monk blameless. There are, Sāriputta, these seven grounds for blamelessness that I have realized through direct knowledge and declared.\"\n\n\"Which seven? Here, Sāriputta, a monk has keen desire for undertaking the training and unflagging affection for undertaking the training in the future. He has keen desire for investigating the Dhamma and unflagging affection for investigating the Dhamma in the future. He has keen desire for disciplining desires and unflagging affection for disciplining desires in the future. He has keen desire for seclusion and unflagging affection for seclusion in the future. He has keen desire for the arousal of energy and unflagging affection for the arousal of energy in the future. He has keen desire for mindfulness and clear comprehension and unflagging affection for mindfulness and clear comprehension in the future. He has keen desire for the penetration of views and unflagging affection for the penetration of views in the future. These, Sāriputta, are the seven grounds for blamelessness that I have realized through direct knowledge and declared. A monk endowed with these seven grounds for blamelessness, Sāriputta, even if he observes the perfectly pure holy life for twelve years, it is fitting to call him a 'blameless monk'; even if he observes the perfectly pure holy life for twenty-four years, it is fitting to call him a 'blameless monk'; even if he observes the perfectly pure holy life for thirty-six years, it is fitting to call him a 'blameless monk'; even if he observes the perfectly pure holy life for forty-eight years, it is fitting to call him a 'blameless monk'.\"",
      "sinhala": "එවිට ආයුෂ්මත් ශ්‍රී‍්සාරිපුත්ත ස්ථවිරයන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන සැවැත් නුවරට පිඬු සිඟා වැඩියහ. එවිට ආයුෂ්මත් ශ්‍රී‍්සාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"දැන් සැවැත් නුවර පිඬු සිඟා යෑමට වේලාසන වැඩියි. මා අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙතට යන්නේ නම් හොඳයි\" කියා. එවිට ආයුෂ්මත් ශ්‍රී‍්සාරිපුත්ත ස්ථවිරයන් වහන්සේ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත වැඩියහ; එහි වැඩම කොට ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන් සමඟ සතුටු වූහ. ප්‍රියමනාප සිහිකටයුතු කථාබහක් කොට එකත්පස්ව වාඩි වූහ. එකල ඒ රැස්ව සිටි අන්‍ය තීර්ථක පරිබ්‍රාජකයන් අතරට මේ කථාව ඇති විය: \"ඇවැත්නි, යමෙක් වසර දොළොසක් සම්පූර්ණ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කරයිද, 'මේ නිරවද්‍ය භික්ෂුවකි' යැයි කියන්නට ඔහු සුදුසු වේ\" කියා. එවිට ආයුෂ්මත් ශ්‍රී‍්සාරිපුත්ත ස්ථවිරයන් වහන්සේ ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ප්‍රකාශය අනුමෝදන් වූයේද නැත, ප්‍රතික්ෂේප කළේද නැත. අනුමෝදන් නොවීද, ප්‍රතික්ෂේප නොකොටද, ආසනයෙන් නැගිට පිටත් වූහ - \"භාග්‍යවතුන් වහන්සේ වෙතින් මේ ප්‍රකාශයේ අර්ථය දැනගන්නෙමි\" යන සිතිවිල්ලෙන්.\n\nඉන්පසු ආයුෂ්මත් ශ්‍රී‍්සාරිපුත්ත ස්ථවිරයන් වහන්සේ සැවැත් නුවර පිඬු සිඟා වැඩ, දානයෙන් පසු පිණ්ඩපාතයෙන් ආපසු පැමිණ, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට වැඩියහ; වැඩම කොට භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වූ ආයුෂ්මත් ශ්‍රී‍්සාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ සැළ කළහ: \"භාග්‍යවතුන් වහන්ස, මම මෙහි පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන සැවැත් නුවරට පිඬු සිඟා ගියෙමි. මට, භාග්‍යවතුන් වහන්ස, මෙසේ සිතුණි: 'දැන් සැවැත් නුවර පිඬු සිඟා යෑමට වේලාසන වැඩියි. මා අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙතට යන්නේ නම් හොඳයි' කියා. එවිට මම, භාග්‍යවතුන් වහන්ස, අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත ගියෙමි; එහි ගොස් ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන් සමඟ සතුටු වීමි. ප්‍රියමනාප සිහිකටයුතු කථාබහක් කොට එකත්පස්ව වාඩි වීමි. එකල, භාග්‍යවතුන් වහන්ස, ඒ රැස්ව සිටි අන්‍ය තීර්ථක පරිබ්‍රාජකයන් අතරට මේ කථාව ඇති විය: 'ඇවැත්නි, යමෙක් වසර දොළොසක් සම්පූර්ණ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කරයිද, මේ නිරවද්‍ය භික්ෂුවකි යැයි කියන්නට ඔහු සුදුසු වේ' කියා. එවිට මම, භාග්‍යවතුන් වහන්ස, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ප්‍රකාශය අනුමෝදන් වූයේද නැත, ප්‍රතික්ෂේප කළේද නැත. අනුමෝදන් නොවීද, ප්‍රතික්ෂේප නොකොටද, ආසනයෙන් නැගිට පිටත් වීමි – 'භාග්‍යවතුන් වහන්සේ වෙතින් මේ අර්ථය දැනගන්නෙමි' යන සිතිවිල්ලෙන්. භාග්‍යවතුන් වහන්ස, මේ ධර්ම විනයෙහි වසර ගණනින් පමණක් නිරවද්‍ය භික්ෂුවක් පනවන්නට හැකිද?\"\n\n\"සාරිපුත්තය, මේ ධර්ම විනයෙහි වසර ගණනින් පමණක් නිරවද්‍ය භික්ෂුවක් පනවන්නට නොහැකිය. සාරිපුත්තය, මේ නිරවද්‍ය බවට කරුණු සතක් මා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කරගෙන ප්‍රකාශ කර ඇත. ඒ සත කුමක්ද? සාරිපුත්තය, මෙහිලා භික්ෂුව ශික්ෂා සමාදන්වීමට තීව්‍ර කැමැත්තක් ඇත්තෙක් වේ, අනාගතයෙහිද ශික්ෂා සමාදන්වීමට නොනැවතී පවත්නා කැමැත්තක් ඇත්තෙක් වේ. ධර්මය විනිශ්චය කිරීමට තීව්‍ර කැමැත්තක් ඇත්තෙක් වේ, අනාගතයෙහිද ධර්මය විනිශ්චය කිරීමට නොනැවතී පවත්නා කැමැත්තක් ඇත්තෙක් වේ. ආශාවන් වැනසීමට තීව්‍ර කැමැත්තක් ඇත්තෙක් වේ, අනාගතයෙහිද ආශාවන් වැනසීමට නොනැවතී පවත්නා කැමැත්තක් ඇත්තෙක් වේ. පටිසල්ලානයට තීව්‍ර කැමැත්තක් ඇත්තෙක් වේ, අනාගතයෙහිද පටිසල්ලානයට නොනැවතී පවත්නා කැමැත්තක් ඇත්තෙක් වේ. වීර්යය ඇරඹීමට තීව්‍ර කැමැත්තක් ඇත්තෙක් වේ, අනාගතයෙහිද වීර්යය ඇරඹීමට නොනැවතී පවත්නා කැමැත්තක් ඇත්තෙක් වේ. සති නුවණින් යුක්ත වීමට තීව්‍ර කැමැත්තක් ඇත්තෙක් වේ, අනාගතයෙහිද සති නුවණින් යුක්ත වීමට නොනැවතී පවත්නා කැමැත්තක් ඇත්තෙක් වේ. දෘෂ්ටි ප්‍රතිවේධයට තීව්‍ර කැමැත්තක් ඇත්තෙක් වේ, අනාගතයෙහිද දෘෂ්ටි ප්‍රතිවේධයට නොනැවතී පවත්නා කැමැත්තක් ඇත්තෙක් වේ. සාරිපුත්තය, මා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කරගෙන ප්‍රකාශ කරන ලද නිරවද්‍ය බවට කරුණු සත මේවාය. සාරිපුත්තය, මේ නිරවද්‍ය බවට කරුණු සතින් යුක්ත වූ භික්ෂුව, වසර දොළොසක් සම්පූර්ණ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කළත්, 'මේ නිරවද්‍ය භික්ෂුවකි' යැයි කියන්නට සුදුසු වේ; වසර විසිහතරක් සම්පූර්ණ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කළත්, 'මේ නිරවද්‍ය භික්ෂුවකි' යැයි කියන්නට සුදුසු වේ; වසර තිස්හයක් සම්පූර්ණ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කළත්, 'මේ නිරවද්‍ය භික්ෂුවකි' යැයි කියන්නට සුදුසු වේ; වසර හතළිස් අටක් සම්පූර්ණ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කළත්, 'මේ නිරවද්‍ය භික්ෂුවකි' යැයි කියන්නට සුදුසු වේ.\"",
      "paliTitle": "Paṭhamaniddasasuttaṃ",
      "englishTitle": "The First Discourse on the Niddasa",
      "sinhalaTitle": "පළමු නිද්දස සූත්‍රය"
    },
    {
      "number": 43,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya kosambiṃ piṇḍāya pāvisi. Atha kho āyasmato ānandassa etadahosi – ‘‘atippago kho tāva kosambiyaṃ piṇḍāya carituṃ. Yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’’nti. Atha kho āyasmā ānando yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘yo hi koci, āvuso, dvādasa vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāyā’’ti. Atha kho āyasmā ānando tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandi nappaṭikkosi. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkāmi – ‘‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’ti. Atha kho āyasmā ānando kosambiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya kosambiṃ piṇḍāya pāvisiṃ. Tassa mayhaṃ, bhante, etadahosi – ‘atippago kho tāva kosambiyaṃ piṇḍāya carituṃ. Yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’nti…pe… tehi saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. ‘‘Tena kho pana, bhante, samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘yo hi koci, āvuso, dvādasavassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, niddaso bhikkhūti alaṃ vacanāyā’ti. Atha khvāhaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā, appaṭikkositvā uṭṭhāyāsanā pakkamiṃ – ‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’ti. Sakkā nu kho, bhante, imasmiṃ dhammavinaye kevalaṃ vassagaṇanamattena niddaso bhikkhu paññāpetu’’nti? ‘‘Na kho, ānanda, sakkā imasmiṃ dhammavinaye kevalaṃ vassagaṇanamattena niddaso bhikkhu paññāpetuṃ. Satta kho imāni, ānanda, niddasavatthūni mayā sayaṃ abhiññā sacchikatvā paveditāni. ‘‘Katamāni satta? Idhānanda, bhikkhu, saddho hoti, hirīmā hoti, ottappī hoti, bahussuto hoti, āraddhavīriyo hoti, satimā hoti, paññavā hoti. Imāni kho, ānanda, satta niddasavatthūni mayā sayaṃ abhiññā sacchikatvā paveditāni. Imehi kho, ānanda, sattahi niddasavatthūhi samannāgato bhikkhu dvādasa cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāya; catubbīsati cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāya; chattiṃsati cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāya, aṭṭhacattārīsaṃ cepi vassāni paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, ‘niddaso bhikkhū’ti alaṃ vacanāyā’’ti. Dvādasamaṃ. ",
      "english": "Thus have I heard. At one time the Blessed One was dwelling in Kosambi, at Ghosita's Park. Then, in the morning, Venerable Ananda dressed, took his bowl and robe, and entered Kosambi for alms. Then it occurred to Venerable Ananda: \"It is still too early to go for alms in Kosambi. Why don't I go to the park of the other wandering ascetics?\" Then Venerable Ananda went to the park of the other wandering ascetics; having gone there, he exchanged cordial greetings with those other wandering ascetics. After exchanging polite and memorable greetings, he sat down to one side.\n\nNow, at that time, while those other wandering ascetics were sitting together, gathered in assembly, this conversation arose among them: \"Friends, whoever practices the perfectly pure spiritual life for twelve full years, is fit to be called a 'flawless monk.'\" Then Venerable Ananda neither approved nor disapproved of the statement of those other wandering ascetics. Without approving or disapproving, he rose from his seat and departed, thinking, \"I shall learn the meaning of this statement in the presence of the Blessed One.\"\n\nThen, after wandering for alms in Kosambi and returning from his alms round after his meal, Venerable Ananda approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, Venerable Ananda said to the Blessed One: \"Venerable sir, here, in the morning, I dressed, took my bowl and robe, and entered Kosambi for alms. Then it occurred to me, Venerable sir: 'It is still too early to go for alms in Kosambi. Why don't I go to the park of the other wandering ascetics?' So I went to the park of the other wandering ascetics; having gone there, I exchanged cordial greetings with them. After exchanging polite and memorable greetings, I sat down to one side.\"\n\n\"Venerable sir, now, at that time, while those other wandering ascetics were sitting together, gathered in assembly, this conversation arose among them: 'Friends, whoever practices the perfectly pure spiritual life for twelve full years, is fit to be called a \"flawless monk.\"' Then, Venerable sir, I neither approved nor disapproved of the statement of those other wandering ascetics. Without approving or disapproving, I rose from my seat and departed, thinking, 'I shall learn the meaning of this statement in the presence of the Blessed One.' Is it possible, Venerable sir, in this Dhamma and Discipline, to declare someone a 'flawless monk' solely by counting the number of years?\"\n\n\"No, Ananda, it is not possible in this Dhamma and Discipline to declare someone a 'flawless monk' solely by counting the number of years. There are, Ananda, these seven bases for flawlessness which I myself have directly known, realized, and proclaimed.\"\n\n\"What are these seven? Here, Ananda, a monk is endowed with faith, has a sense of moral shame, has a sense of moral dread, is learned, has aroused energy, is mindful, and is wise. These, Ananda, are the seven bases for flawlessness that I myself have directly known, realized, and proclaimed.\"\n\n\"Ananda, a monk endowed with these seven bases for flawlessness, even if he has practiced the perfectly pure spiritual life for twelve full years, is fit to be called a 'flawless monk'; even if he has practiced the perfectly pure spiritual life for twenty-four full years, he is fit to be called a 'flawless monk'; even if he has practiced the perfectly pure spiritual life for thirty-six full years, he is fit to be called a 'flawless monk'; even if he has practiced the perfectly pure spiritual life for forty-eight full years, he is fit to be called a 'flawless monk.'\"",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ කොසඹෑ නුවර ඝෝෂිතාරාමයෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු රැගෙන කොසඹෑ නුවරට පිඬු සිඟා වඩින සේක. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"කොසඹෑ නුවර පිඬු සිඟා යාමට තවමත් බොහෝ වේලාසන වැඩිය. මම යම් තැනක අන්‍ය තීර්ථක පරිබ්‍රාජකයින්ගේ ආරාමය ඇත්ද, එතැනට යන්නෙම් නම් යෙහෙකි.\" එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ යම් තැනක අන්‍ය තීර්ථක පරිබ්‍රාජකයින්ගේ ආරාමය ඇත්ද, එතැනට වැඩම කළ සේක; වැඩම කොට එම අන්‍ය තීර්ථක පරිබ්‍රාජකයින් සමඟ සතුටු වූ සේක. සතුටු විය යුතු, සිහි කටයුතු කථා බස් කතා කොට නිමා වී එකත්පසෙක වැඩහුන් සේක.\n\nඑකල්හි එම අන්‍ය තීර්ථක පරිබ්‍රාජකයින් රැස්ව සිටියදී, එක්ව වාඩිවී සිටියදී, ඔවුන් අතර මෙබඳු කතාවක් ඇතිවිය: \"ඇවැත්නි, යමෙක් දොළොස් වසක් මුළුල්ලෙහි පිරිසිදු බඹසර රකියිද, ඔහු 'නිදොස් භික්ෂුවක්' යැයි පැවසීමට සුදුසුය.\" එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ එම අන්‍ය තීර්ථක පරිබ්‍රාජකයින්ගේ වචනය අනුමත කළේ ද නැත, ප්‍රතික්ෂේප කළේ ද නැත. අනුමත නොකොට, ප්‍රතික්ෂේප නොකොට, ආසනයෙන් නැගිට මෙසේ සිතා පිටත්ව ගිය සේක: \"භාග්‍යවතුන් වහන්සේ සමීපයෙහිදී මේ කතාවේ අර්ථය තේරුම් ගන්නෙමි.\"\n\nඑකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කොසඹෑ නුවර පිඬු සිඟා, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් ආපසු වැඩම කොට, යම් තැනක භාග්‍යවතුන් වහන්සේ වැඩසිටින සේක්ද, එතැනට වැඩම කළ සේක; වැඩම කොට භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක වැඩහුන් සේක. එකත්පසෙක වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කී සේක: \"ස්වාමීනි, මම මෙහිදී පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු රැගෙන කොසඹෑ නුවරට පිඬු සිඟා පිවිසියෙමි. ස්වාමීනි, මට මෙසේ සිතුණි: 'කොසඹෑ නුවර පිඬු සිඟා යාමට තවමත් බොහෝ වේලාසන වැඩිය. මම යම් තැනක අන්‍ය තීර්ථක පරිබ්‍රාජකයින්ගේ ආරාමය ඇත්ද, එතැනට යන්නෙම් නම් යෙහෙකි' යි. ස්වාමීනි, මම යම් තැනක අන්‍ය තීර්ථක පරිබ්‍රාජකයින්ගේ ආරාමය ඇත්ද, එතැනට වැඩම කළෙමි; වැඩම කොට එම අන්‍ය තීර්ථක පරිබ්‍රාජකයින් සමඟ සතුටු වූයෙමි. සතුටු විය යුතු, සිහි කටයුතු කථා බස් කතා කොට නිමා වී එකත්පසෙක වාඩිවූයෙමි.\"\n\n\"ස්වාමීනි, එකල්හි එම අන්‍ය තීර්ථක පරිබ්‍රාජකයින් රැස්ව සිටියදී, එක්ව වාඩිවී සිටියදී, ඔවුන් අතර මෙබඳු කතාවක් ඇතිවිය: 'ඇවැත්නි, යමෙක් දොළොස් වසක් මුළුල්ලෙහි පිරිසිදු බඹසර රකියිද, ඔහු 'නිදොස් භික්ෂුවක්' යැයි පැවසීමට සුදුසුය' කියාය. ස්වාමීනි, එකල්හි මම එම අන්‍ය තීර්ථක පරිබ්‍රාජකයින්ගේ වචනය අනුමත කළේ ද නැත, ප්‍රතික්ෂේප කළේ ද නැත. අනුමත නොකොට, ප්‍රතික්ෂේප නොකොට, ආසනයෙන් නැගිට 'භාග්‍යවතුන් වහන්සේ සමීපයෙහිදී මේ කතාවේ අර්ථය තේරුම් ගන්නෙමි' යැයි සිතා පිටත්ව ගියෙමි. ස්වාමීනි, මේ ධර්ම‍ විනයෙහි වස් ගණනක් පමණකින් පමණක් නිදොස් භික්ෂුවක් වශයෙන් ප්‍රකාශ කළ හැකිද?\"\n\n\"ආනන්දයෙනි, මේ ධර්ම‍ විනයෙහි වස් ගණනක් පමණකින් පමණක් නිදොස් භික්ෂුවක් වශයෙන් ප්‍රකාශ කළ නොහැකිය. ආනන්දයෙනි, නිදොස් භාවය පිණිස කරුණු සතක් මා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කර ඇත. ඒ සත කුමක්ද? ආනන්දයෙනි, මෙහිලා භික්ෂුව ශ්‍රද්ධාවෙන් යුක්ත වෙයි, හිරි ඇති වෙයි, ඔතප් ඇති වෙයි, බොහෝ ඇසූ පිරූ තැන් ඇති වෙයි, ආරම්භ කළ වීර්යයෙන් යුක්ත වෙයි, සිහි නුවණින් යුක්ත වෙයි, ප්‍රඥාවෙන් යුක්ත වෙයි. ආනන්දයෙනි, මා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරන ලද නිදොස් භාවය පිණිස කරුණු සත මේවාය.\"\n\n\"ආනන්දයෙනි, මේ නිදොස් භාවය පිණිස වූ කරුණු සතෙන් යුක්ත වූ භික්ෂුව දොළොස් වසරක් මුළුල්ලෙහි පිරිසිදු බඹසර රකියිද, ඔහු 'නිදොස් භික්ෂුවක්' යැයි පැවසීමට සුදුසුය; විසි හතර වසරක් මුළුල්ලෙහි පිරිසිදු බඹසර රකියිද, ඔහු 'නිදොස් භික්ෂුවක්' යැයි පැවසීමට සුදුසුය; තිස් හය වසරක් මුළුල්ලෙහි පිරිසිදු බඹසර රකියිද, ඔහු 'නිදොස් භික්ෂුවක්' යැයි පැවසීමට සුදුසුය; සිව් හතළිස් වසරක් මුළුල්ලෙහි පිරිසිදු බඹසර රකියිද, ඔහු 'නිදොස් භික්ෂුවක්' යැයි පැවසීමට සුදුසුය.\" දොළොස්වන සූත්‍රයයි.",
      "paliTitle": "Dutiyaniddasasuttaṃ",
      "englishTitle": "Second Sutta on the One Beyond Reproach",
      "sinhalaTitle": "දුතිය නිද්දස සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Devatāvaggo catuttho. Tassuddānaṃ – Appamādo hirī ceva, dve suvacā duve mittā; Dve paṭisambhidā dve vasā, duve niddasavatthunāti.",
    "english": "The fourth chapter on Deities. The summary of it: Heedfulness and Shame, two on Easy to Admonish, two on Friends; two on Analytical Knowledge, two on Mastery, and two on Grounds for Criticism.",
    "sinhala": "සිව්වන දේවතා වර්ගයයි. එහි උද්දානය නම්: අප්පමාද, හිරි, සුවච සූත්‍ර දෙකක්, මිත්ත සූත්‍ර දෙකක්, පටිසම්භිදා දෙකක්, වස සූත්‍ර දෙකක් සහ නිද්දසවත්ථු සූත්‍ර දෙකකි."
  }
}