{
  "id": "an7.8",
  "title": {
    "pali": "Vinayavaggo",
    "english": "The Chapter on Discipline",
    "sinhala": "විනය වර්ගය"
  },
  "sections": [
    {
      "number": 75,
      "pali": "[pari. 327] ‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu vinayadharo hoti. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, sīlavā hoti pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī samādāya sikkhati sikkhāpadesu, catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu vinayadharo hotī’’ti. Paṭhamaṃ.",
      "english": "Monks, a monk endowed with seven qualities is a master of the Discipline. Which seven?\n\nHe knows what constitutes an offense, what does not constitute an offense, what is a light offense, and what is a serious offense. He is virtuous, he dwells restrained by the Patimokkha, accomplished in proper conduct and suitable resort, seeing danger even in the slightest faults, and undertaking the training in the precepts. He is one who obtains at will, without difficulty or trouble, the four jhānas — the higher mental states that provide a pleasant abiding in this very life. Through the destruction of the influxes, having directly realized and experienced for himself in this very life, he enters upon and dwells in the liberation of mind and liberation through wisdom that are free from influxes.\n\nMonks, a monk endowed with these seven qualities is a master of the Discipline.",
      "sinhala": "මහණෙනි, සත් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව විනයධර වේ. කවර සතකින් ද යත්: ආපත්තිය දනී, අනාපත්තිය දනී, ලහුක ආපත්තිය දනී, ගරුක ආපත්තිය දනී; සිල්වත් වී, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරමින්, ආචාර ගෝචර සම්පන්නව, අණුමාත්‍ර වූ වරදෙහි ද භය දකිමින් ශික්ෂා පදයන් සමාදන්ව හික්මෙයි; අභිචෛතසික වූ, මේ අත්බැව්හි සැප විහරණය පිණිස වූ, සිව් ධ්‍යාන කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නේ වේ; ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන්, මේ අත්බැව්හි දීම, තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කර, සාක්ෂාත් කොට, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තියට පැමිණ වාසය කරයි. මහණෙනි, මේ සත් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව විනයධර වේ.",
      "paliTitle": "Paṭhamavinayadharasuttaṃ",
      "englishTitle": "The First Discourse on an Expert in Discipline",
      "sinhalaTitle": "පළමු විනයධර සූත්‍රය"
    },
    {
      "number": 76,
      "pali": "[pari. 327] ‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu vinayadharo hoti. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu vinayadharo hotī’’ti. Dutiyaṃ.",
      "english": "Monks, a monk endowed with seven qualities is a master of the Discipline. Which seven? He knows what constitutes an offence, he knows what does not constitute an offence, he knows a light offence, and he knows a grave offence. Furthermore, both Pātimokkhas are thoroughly learned by him, well analyzed, well-practiced, and well-determined both according to the suttas and their detailed explanations. He is one who obtains at will, without difficulty or trouble, the four jhānas—states of mental absorption—which pertain to the higher mind and are a pleasant abiding in this very life. And by the destruction of the taints, having realized for himself with direct knowledge and attained in this very life the taintless liberation of mind and liberation by wisdom, he abides therein. Monks, a monk endowed with these seven qualities is a master of the Discipline.",
      "sinhala": "මහණෙනි, ධර්මයන් සතකින් සමන්විත වූ භික්ෂුවක් විනයධරයෙක් වේ. ඒ ධර්මයන් සත කවරේද? ආපත්තිය දනී, අනාපත්තිය දනී, ලහුක ආපත්තිය දනී, ගරුක ආපත්තිය දනී, ඔහුට ප්‍රාතිමෝක්ෂ දෙකම විස්තර වශයෙන් මැනවින් හුරුපුරුදු වී ඇත, මැනවින් විභාග කරන ලද්දේය, මැනවින් ප්‍රගුණ කරන ලද්දේය, සූත්‍රයන් අනුවද අනුබ්‍යංජනයන් අනුවද මැනවින් විනිශ්චය කරන ලද්දේය. අභිචෛතසික වූ, මේ ආත්මභාවයේදීම සැප විහරණය පිණිස වන සතර ධ්‍යාන කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලැබිය හැකි අයෙක් වේ. ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් ප්‍රත්‍යක්ෂ කොට උපසම්පදා වී වාසය කරයි. මහණෙනි, මේ ධර්මයන් සතින් සමන්විත වූ භික්ෂුවක් විනයධරයෙක් වේ.",
      "paliTitle": "Dutiyavinayadharasuttaṃ",
      "englishTitle": "Second Sutta on a Vinaya-bearer",
      "sinhalaTitle": "දුතිය විනයධර සූත්‍රය"
    },
    {
      "number": 77,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu vinayadharo hoti. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, vinaye kho pana ṭhito hoti asaṃhīro, catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu vinayadharo hotī’’ti. Tatiyaṃ.",
      "english": "Monks, a monk endowed with seven qualities is a holder of the Discipline. Which seven? He knows what constitutes an offense, he knows what does not constitute an offense. He knows minor offenses, he knows grave offenses. Furthermore, he is established in the Discipline, unshaken. He obtains at will, without difficulty or trouble, the four jhānas, which are states pertaining to the higher mind and are comfortable abidings in this very life. And by the destruction of the taints, having realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation through wisdom, he abides therein. Monks, a monk endowed with these seven qualities is a holder of the Discipline.",
      "sinhala": "මහණෙනි, සත් අංගයන්ගෙන් යුක්ත වූ භික්ෂුව විනයධරයෙක් වේ. ඒ කවර සතකින්ද යත්: ආපත්තිය හඳුනා ගනී, අනාපත්තිය හඳුනා ගනී, ලහුක ආපත්තිය හඳුනා ගනී, ගරුක ආපත්තිය හඳුනා ගනී, විනයෙහි නොසැලී ස්ථිරව පිහිටා සිටී, අධිචෛතසික වූ, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණයන් වූ සිව් ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබා ගන්නා සුළු වේ, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට, උපසම්පදා වී වාසය කරයි. මහණෙනි, මේ සත් අංගයන්ගෙන් යුක්ත වූ භික්ෂුව විනයධරයෙක් වේ.",
      "paliTitle": "Tatiyavinayadharasuttaṃ",
      "englishTitle": "Third Discourse on an Expert in Vinaya",
      "sinhalaTitle": "තතිය විනයධර සූත්‍රය"
    },
    {
      "number": 78,
      "pali": "[pari. 327] ‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu vinayadharo hoti. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ, dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Dibbena cakkhunā visuddhena atikkantamānusakena yathākammūpage satte pajānāti. Āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu vinayadharo hotī’’ti. Catutthaṃ.",
      "english": "Monks, a bhikkhu endowed with seven qualities is a master of the Vinaya. Which seven? He knows what is an offense, he knows what is not an offense; he knows what is a minor offense, he knows what is a grave offense. He recollects his manifold past lives, that is, one birth, two births, and so on, thus remembering them with all their characteristic marks and specific details. With the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing according to their kamma. Through the destruction of the taints, having realized for himself with direct knowledge the taintless liberation of mind and liberation through wisdom, he enters and abides in it in this very life. Monks, a bhikkhu endowed with these seven qualities is a master of the Vinaya.",
      "sinhala": "භික්‍ෂූන් වහන්ස, ධර්‍ම සතකින් යුක්ත වූ භික්‍ෂුවක් විනයධරයෙක් වේ. ඒ ධර්‍ම සත කවරේද? ආපත්තිය හඳුනා ගනී. අනාපත්තිය හඳුනා ගනී. ලඝු ආපත්තිය හඳුනා ගනී. ගරු ආපත්තිය හඳුනා ගනී. විවිධ ආකාරයේ පෙර විසූ භවයන් සිහි කරයි. එනම්, එක් ජාතියක් ද, ජාති දෙකක් ද... ආදී වශයෙන්, ආකාර සහිතව, විස්තර සහිතව, විවිධ ආකාරයේ පෙර විසූ භවයන් සිහි කරයි. විශුද්ධ වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින්, කර්මයට අනුව උපදින සත්වයන් දකී. ආශ්‍ර‍වයන් ක්ෂය වීමෙන්, ආශ්‍ර‍ව රහිත වූ චේතෝවිමුක්තිය ද, ප්‍ර‍ඥාවිමුක්තිය ද, මේ අත් බැව්හිදීම තමන් විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට, සාක්ෂාත් කොට, එයට පැමිණ වාසය කරයි. භික්‍ෂූන් වහන්ස, මේ ධර්‍ම සතින් යුක්ත වූ භික්‍ෂුවක් විනයධරයෙක් වේ.",
      "paliTitle": "Catutthavinayadharasuttaṃ",
      "englishTitle": "Fourth Sutta on a Vinaya-bearer",
      "sinhalaTitle": "චතුත්ථ විනයධර සූත්‍රය"
    },
    {
      "number": 79,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato [samannāgato bhikkhu (sī. syā. ka.) anantarasuttadveye pana idaṃ pāṭhanānattaṃ natthi. pari. 327] vinayadharo sobhati. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu, catunnaṃ jhānānaṃ ābhicetasikānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato vinayadharo sobhatī’’ti. Pañcamaṃ.",
      "english": "Monks, one who upholds the Vinaya shines, endowed with seven qualities. With which seven?\n\nHe knows an offense; he knows a non-offense; he knows a light offense; he knows a grave offense. He is virtuous; he dwells restrained by the restraint of the Pātimokkha, perfect in conduct and domain, seeing danger in the slightest faults, and undertaking the training rules, he trains himself. He obtains at will, without difficulty, and without trouble, the four jhānas, which pertain to the higher mind. Through the destruction of the taints, by realizing for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, he abides therein.\n\nIndeed, monks, one who upholds the Vinaya shines, endowed with these seven qualities.",
      "sinhala": "මහණෙනි, ධර්‍මයන් සතකින් යුක්ත වූ විනයධර භික්ෂුවක් බැබළෙයි. කවර සතකින් ද? ආපත්තිය හඳුනයි. අනාපත්තිය හඳුනයි. ලඝු ආපත්තිය හඳුනයි. ගරු ආපත්තිය හඳුනයි. සිල්වත් වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ වාසය කරයි. ආචාර ගෝචර සම්පන්න වෙයි. අල්පමාත්‍ර වූ වරදෙහි පවා භය දකින්නේ වෙයි. සිකපදයන් සමාදන්ව හික්මෙයි. ආභිචෛතසික වූ සිව් ධ්‍යානයන් කැමති පරිදි, දුෂ්කරතාවකින් තොරව, වෙහෙසකින් තොරව ලබයි. ආශ්‍රවයන් ක්ෂය කිරීමෙන් කෙලෙස් රහිත චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය මේ භවයේදීම තමන් විසින්ම අවබෝධ කොට, සාක්‍ෂාත් කොට වාසය කරයි. මහණෙනි, මේ ධර්‍මයන් සතින් යුක්ත වූ විනයධර භික්ෂුවක් බැබළෙයි.",
      "paliTitle": "Paṭhamavinayadharasobhanasuttaṃ",
      "englishTitle": "The First Discourse on What Beautifies an Expert in Discipline",
      "sinhalaTitle": "පළමු විනයධරසෝභන සූත්‍රය"
    },
    {
      "number": 80,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato vinayadharo sobhati. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, catunnaṃ jhānānaṃ…pe… akasiralābhī, āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato vinayadharo sobhatī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, a Vinaya master, endowed with seven qualities, shines. With which seven? He knows what constitutes an offense and what does not constitute an offense; he knows what constitutes a light offense and what constitutes a grave offense. Furthermore, both Pātimokkha codes are thoroughly learned by him, well-analyzed, well-practiced, and well-understood in terms of the main rules and their detailed elucidations. He obtains the four jhānas—associated with the higher mind and a pleasant dwelling in this very life—whenever he wishes, without difficulty, and without trouble. Through the complete destruction of the taints, he here and now, by his own direct knowledge, realizes, enters, and abides in the taintless liberation of mind and liberation through wisdom. Monks, a Vinaya master, endowed with these seven qualities, shines.",
      "sinhala": "භික්ෂූනි, විනයධරයා කරුණු සතකින් යුක්තව ශෝභමාන වේ. ඒ සත කවරේද?\n\nහෙතෙම ආපත්තිය දනී, අනාපත්තිය දනී, ලහුක ආපත්තිය දනී, ගරුක ආපත්තිය දනී. තවද, ඔහුට දෙපසින් වූ ප්‍රාතිමෝක්ෂය විස්තර වශයෙන් මැනවින් පිළිගත්, මැනවින් බෙදා වෙන් කරන ලද, මැනවින් ප්‍රගුණ කරන ලද, සූත්‍ර ක්‍රමයෙන් ද අනුප්‍රඥප්ති ක්‍රමයෙන් ද මැනවින් විනිශ්චය කරන ලද එකක් වේ. හෙතෙම ආධිචෛතසික වූ, මේ ආත්මභාවයේදීම සැප විහරණයට හේතු වන, චතුර් ධ්‍යාන ස්වකැමැත්තෙන්, අපහසුවකින් තොරව, ආයාසයකින් තොරව ලබන්නෙක් වේ. හෙතෙම ආශ්‍රවයන් ක්ෂය කිරීමෙන්, මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාපූර්වකව අවබෝධ කොට, සාක්ෂාත් කොට, ප්‍රත්‍යක්ෂ කොට, ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය උපසම්පදා කරගෙන වාසය කරයි.\n\nභික්ෂූනි, මේ සත් කරුණින් යුක්ත වූ විනයධරයා ශෝභමාන වේ.",
      "paliTitle": "Dutiyavinayadharasobhanasuttaṃ",
      "englishTitle": "Second Sutta on the Beauty of a Vinaya-bearer",
      "sinhalaTitle": "දුතිය විනයධරසෝභන සූත්‍රය"
    },
    {
      "number": 81,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato vinayadharo sobhati. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, vinaye kho pana ṭhito hoti asaṃhīro, catunnaṃ jhānānaṃ…pe… akasiralābhī, āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato vinayadharo sobhatī’’ti. Sattamaṃ.",
      "english": "Monks, one who upholds the Vinaya, endowed with seven qualities, shines forth. Which seven? He knows an offense, he knows a non-offense, he knows a light offense, he knows a heavy offense; he stands firm in the Vinaya, unshakeable; he obtains at will, without difficulty or trouble, the four jhānas—which are states of heightened mind, a pleasant abiding in this very life; and through the destruction of the taints, having realized for himself with direct knowledge, in this very life, he enters and abides in the taintless liberation of mind, liberation through wisdom. Indeed, Monks, one who upholds the Vinaya, endowed with these seven qualities, shines forth.",
      "sinhala": "සත් ධර්මයන්ගෙන් යුක්ත වූ විනයධරයා, මහණෙනි, ශෝභා සම්පන්න වේ. කවර සත් ධර්මයන්ගෙන්ද?\nඔහු ආපත්තිය හඳුනා ගනී. අනාපත්තිය හඳුනා ගනී. ලහුක ආපත්තිය හඳුනා ගනී. ගරුක ආපත්තිය හඳුනා ගනී. තවද, ඔහු විනයෙහි නොසැලී පිහිටියේ වෙයි. සිව්වණක් ධ්‍යානයන් ප්‍රත්‍යක්ෂ ඥානයෙන් අවබෝධ කොට මේ ආත්මභාවයේදීම සැප විහරණය පිණිස පහසුවෙන් ලබන්නෙක් වෙයි. ආස්‍රවයන්ගේ ක්ෂය කිරීමෙන් ආස්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම ස්වයංව අවබෝධ කොට ප්‍රත්‍යක්ෂ කොටගෙන වාසය කරයි.\nමහණෙනි, මේ සත් ධර්මයන්ගෙන් සමන්විත වූ විනයධරයා ශෝභා සම්පන්න වේ.",
      "paliTitle": "Tatiyavinayadharasobhanasuttaṃ",
      "englishTitle": "Third Discourse on What Beautifies an Expert in Vinaya",
      "sinhalaTitle": "තතිය විනයධරසෝභන සූත්‍රය"
    },
    {
      "number": 82,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato [samannāgato bhikkhu (ka.)] vinayadharo sobhati. Katamehi sattahi? Āpattiṃ jānāti, anāpattiṃ jānāti, lahukaṃ āpattiṃ jānāti, garukaṃ āpattiṃ jānāti, anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ, dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, dibbena cakkhunā visuddhena atikkantamānusakena…pe… āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, sattahi dhammehi samannāgato vinayadharo sobhatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a monastic disciplinarian endowed with seven qualities shines forth. With which seven? He knows what constitutes an offense, he knows what does not constitute an offense, he knows what constitutes a light offense, he knows what constitutes a grave offense. He recollects his manifold past existences, that is, one birth, two births, and so forth, thus recollecting his manifold past existences with their distinct characteristics and circumstances. With the divine eye, purified and surpassing that of humans, and so forth. By the destruction of the taints, having directly realized and personally experienced this, he abides therein. Monks, a monastic disciplinarian endowed with these seven qualities truly shines forth.",
      "sinhala": "මහණෙනි, කරුණු සතකින් යුක්ත වූ විනයධර භික්‍ෂුව බැබළෙයි. ඒ කරුණු සත කවරේද?\n\nඔහු ආපත්තිය දනියි. අනාපත්තිය දනියි. ලාහුක ආපත්තිය දනියි. ගරුක ආපත්තිය දනියි. අනේකවිධ වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. එනම්, එක් ආත්මභාවයක් ද, දෙක් ආත්මභාවයන් ද… මෙසේ සියුම් ආකාර සහිත ව, නිමිති සහිත ව, අනේකවිධ වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින්, චුත වන, උපදින සත්වයන් දකිමින්… ආශ්‍රවයන් ක්‍ෂය කිරීමෙන්, මෙලොවදීම ආශ්‍රව රහිත වූ චිත්තවිමුක්තිය හා ප්‍රඥා විමුක්තිය තමන් විසින්ම අවබෝධ කොට, පසක් කොට, සාක්‍ෂාත් කොට වාසය කරයි.\n\nමහණෙනි, මේ කරුණු සතකින් යුක්ත වූ විනයධර භික්‍ෂුව බැබළෙයි.",
      "paliTitle": "Catutthavinayadharasobhanasuttaṃ",
      "englishTitle": "Fourth Sutta on the Beauty of a Vinaya-bearer",
      "sinhalaTitle": "චතුත්ථ විනයධරසෝභන සූත්‍රය"
    },
    {
      "number": 83,
      "pali": "Atha kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘Sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Ye kho tvaṃ, upāli, dhamme jāneyyāsi – ‘ime dhammā na ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattantī’ti; ekaṃsena, upāli, dhāreyyāsi – ‘neso dhammo neso vinayo netaṃ satthusāsana’nti. Ye ca kho tvaṃ, upāli, dhamme jāneyyāsi – ‘ime dhammā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattantī’ti; ekaṃsena, upāli, dhāreyyāsi – ‘eso dhammo eso vinayo etaṃ satthusāsana’’’nti. Navamaṃ.",
      "english": "Then the Venerable Upāli approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the Venerable Upāli then said to the Blessed One: \"It would be good, Venerable Sir, if the Blessed One would teach me the Dhamma concisely, so that having heard the Dhamma from the Blessed One, I might dwell alone, secluded, diligent, ardent, and resolute.\"\n\n\"Upāli, those teachings that you know to not lead exclusively to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to full awakening, to Nibbāna – you should definitively hold, Upāli, that 'this is not the Dhamma, this is not the Vinaya, this is not the Teacher's instruction.' But Upāli, those teachings that you know to lead exclusively to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to full awakening, to Nibbāna – you should definitively hold, Upāli, that 'this is the Dhamma, this is the Vinaya, this is the Teacher's instruction.'\"",
      "sinhala": "එවිට ආයුෂ්මත් උපාලි භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට ආදරයෙන් වැඳ, එකත්පසෙකින් වාඩිවිය.\n\nඑකත්පසෙකින් වාඩි වී සිටි ආයුෂ්මත් උපාලි භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – ‘‘ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට සංක්ෂිප්තයෙන් ධර්මය දේශනා කළ මැනව, යමක් මා භාග්‍යවතුන් වහන්සේගේ ධර්මය ශ්‍රවණය කොට, තනිව, හුදෙකලාව, අප්‍රමාදීව, වීර්යවත්ව, අධිෂ්ඨාන සහගතව වාසය කරන්නේද.’’\n\n‘‘උපාලි, යම් ධර්මයන් ගැන නුඹ දන්නෙහිද – ‘මේ ධර්මයන් සසර කෙරෙහි එකාන්තයෙන් කලකිරීමට, විරාගයට, නිරෝධයට, උපශාන්තියට, අභිඥාවට, සම්බෝධියට සහ නිර්වාණයට හේතු නොවේ’ යැයි; උපාලි, ඔබ එකහෙළාම දරාගන්න – ‘මේ ධර්මය නොවේ, මේ විනය නොවේ, මේ ශාස්තෘන් වහන්සේගේ ශාසනය නොවේ’ යැයි. යම් ධර්මයන් ගැන නුඹ දන්නෙහිද – ‘මේ ධර්මයන් සසර කෙරෙහි එකාන්තයෙන් කලකිරීමට, විරාගයට, නිරෝධයට, උපශාන්තියට, අභිඥාවට, සම්බෝධියට සහ නිර්වාණයට හේතු වේ’ යැයි; උපාලි, ඔබ එකහෙළාම දරාගන්න – ‘මේ ධර්මයයි, මේ විනයයි, මේ ශාස්තෘන් වහන්සේගේ ශාසනයයි’ යැයි.’’",
      "paliTitle": "Satthusāsanasuttaṃ",
      "englishTitle": "The Discourse on the Teacher’s Instruction",
      "sinhalaTitle": "සත්ථුසාසන සූත්‍රය"
    },
    {
      "number": 84,
      "pali": "‘‘Sattime, bhikkhave, adhikaraṇasamathā dhammā uppannuppannānaṃ adhikaraṇānaṃ samathāya vūpasamāya. Katame satta? Sammukhāvinayo dātabbo, sativinayo dātabbo, amūḷhavinayo dātabbo [paṭiññātakaraṇaṃ, yebhuyyassikā, tassapāpiyyassikā, tiṇavatthārako (syā.) dī. ni. 3.332 saṅgītisuttena ca pāci. 655 vinayena ca saṃsandetabbaṃ], paṭiññātakaraṇaṃ dātabbaṃ, yebhuyyasikā dātabbā, tassapāpiyasikā dātabbā, tiṇavatthārako dātabbo [paṭiññātakaraṇaṃ, yebhuyyassikā, tassapāpiyyassikā, tiṇavatthārako (syā.) dī. ni. 3.332 saṅgītisuttena ca pāci. 655 vinayena ca saṃsandetabbaṃ]. Ime kho, bhikkhave, satta adhikaraṇasamathā dhammā uppannuppannānaṃ adhikaraṇānaṃ samathāya vūpasamāyā’’ti. Dasamaṃ. ",
      "english": "Monks, these seven principles for settling disputes are for the calming and complete cessation of disputes that have arisen again and again. Which seven?\n\nA decision in the presence of the parties should be applied, a decision based on recollection should be applied, a decision for an unhinged person should be applied, a decision based on acknowledgement should be applied, a decision by majority vote should be applied, a decision by specific denunciation should be applied, and a decision by covering over with grass should be applied. Indeed, Monks, these seven principles for settling disputes are for the calming and complete cessation of disputes that have arisen again and again.",
      "sinhala": "භික්ෂූන් වහන්ස, පැනනැඟුණු පැනනැඟුණු අධිකරණ සමනය කිරීම සඳහාත්, සංසිඳුවීම සඳහාත් අධිකරණ සමථ ධර්ම සතක් ඇත. ඒ කවර සතක්ද? සම්මුඛා විනය දිය යුතුයි, සති විනය දිය යුතුයි, අමූඪ විනය දිය යුතුයි, ප්‍රතිඥාතකරණ දිය යුතුයි, යෙභුය්‍යසිකා දිය යුතුයි, තස්සපාපිය්‍යසිකා දිය යුතුයි, තිණවත්තාරක දිය යුතුයි.\n\nභික්ෂූන් වහන්ස, පැනනැඟුණු පැනනැඟුණු අධිකරණ සමනය කිරීම සඳහාත්, සංසිඳුවීම සඳහාත් වූ මේ අධිකරණ සමථ ධර්ම සත මේවාම යි. දසවෙනි සූත්‍රයයි.",
      "paliTitle": "Adhikaraṇasamathasuttaṃ",
      "englishTitle": "Settling Disputes Sutta",
      "sinhalaTitle": "අධිකරණ සමථ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Vinayavaggo aṭṭhamo. Tassuddānaṃ – Caturo vinayadharā, caturo ceva sobhanā; Sāsanaṃ adhikaraṇa-samathenaṭṭhame dasāti.",
    "english": "The eighth chapter on the Discipline. The summary of it: Four on the Bearer of Discipline, and four on the Beautiful; the Teaching, and Settling of Issues—the eighth makes ten.",
    "sinhala": "අටවන විනය වර්ගයයි. එහි උද්දානය නම්: විනයධර හතරක්, සෝභන හතරක්, සාසන සහ අධිකරණසමථ සූත්‍රයයි."
  }
}