{
  "id": "an7.3",
  "title": {
    "pali": "Vajjisattakavaggo",
    "english": "The Chapter of the Seven Vajjians",
    "sinhala": "වජ්ජිසත්තකවග්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati sārandade cetiye. Atha kho sambahulā licchavī yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te licchavī bhagavā etadavoca – ‘‘satta vo, licchavī, aparihāniye [aparihānīye (ka.)] dhamme desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te licchavī bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katame ca, licchavī, satta aparihāniyā dhammā? Yāvakīvañca, licchavī, vajjī abhiṇhaṃ sannipātā bhavissanti sannipātabahulā; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, licchavī, vajjī samaggā sannipatissanti, samaggā vuṭṭhahissanti, samaggā vajjikaraṇīyāni karissanti; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, licchavī, vajjī apaññattaṃ na paññāpessanti, paññattaṃ na samucchindissanti, yathāpaññatte porāṇe vajjidhamme samādāya vattissanti; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, licchavī, vajjī ye te vajjīnaṃ vajjimahallakā te sakkarissanti garuṃ karissanti mānessanti pūjessanti, tesañca sotabbaṃ maññissanti; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, licchavī, vajjī yā tā kulitthiyo kulakumāriyo tā na okassa pasayha vāsessanti; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, licchavī, vajjī yāni tāni vajjīnaṃ vajjicetiyāni abbhantarāni ceva bāhirāni ca tāni sakkarissanti garuṃ karissanti mānessanti pūjessanti, tesañca dinnapubbaṃ katapubbaṃ dhammikaṃ baliṃ no parihāpessanti; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, licchavī, vajjīnaṃ arahantesu dhammikā rakkhāvaraṇagutti susaṃvihitā bhavissati – ‘kinti anāgatā ca arahanto vijitaṃ āgaccheyyuṃ, āgatā ca arahanto vijite phāsuṃ vihareyyu’nti; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, licchavī, ime satta aparihāniyā dhammā vajjīsu ṭhassanti [vattissanti (ka.)], imesu ca sattasu aparihāniyesu dhammesu vajjī sandississanti [sandissanti (sī. pī. ka.)]; vuddhiyeva, licchavī, vajjīnaṃ pāṭikaṅkhā, no parihānī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Vesālī, at the Sārandada Shrine. Then many Licchavis approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side.\n\nAs those Licchavis were sitting to one side, the Blessed One addressed them thus: \"Licchavis, I shall teach you seven conditions of non-decline. Listen to it, attend carefully, I shall speak.\"\n\n\"Yes, venerable sir,\" those Licchavis replied to the Blessed One. The Blessed One then spoke: \"And what, Licchavis, are the seven conditions of non-decline?\n\n\"As long as, Licchavis, the Vajjians shall hold frequent and numerous assemblies, growth alone is to be expected for the Vajjians, not decline.\n\n\"As long as, Licchavis, the Vajjians shall meet in concord, rise in concord, and carry out their affairs in concord, growth alone is to be expected for the Vajjians, not decline.\n\n\"As long as, Licchavis, the Vajjians shall not enact new laws that have not been prescribed, shall not abolish existing laws, and shall abide by the ancient Vajjian laws as prescribed, growth alone is to be expected for the Vajjians, not decline.\n\n\"As long as, Licchavis, the Vajjians shall respect, revere, honor, and venerate those who are their elders, and consider their words worthy of listening to, growth alone is to be expected for the Vajjians, not decline.\n\n\"As long as, Licchavis, the Vajjians shall not forcibly abduct or confine their noble women and noble maidens, growth alone is to be expected for the Vajjians, not decline.\n\n\"As long as, Licchavis, the Vajjians shall respect, revere, honor, and venerate their Vajjian shrines, both internal and external, and shall not neglect the righteous offerings that were given and performed in the past, growth alone is to be expected for the Vajjians, not decline.\n\n\"As long as, Licchavis, a righteous protection, safeguard, and security for the Arahants shall be well-established among the Vajjians, with the thought: ‘How may Arahants who have not yet come to the realm arrive, and how may Arahants who have arrived dwell comfortably within the realm?’ growth alone is to be expected for the Vajjians, not decline.\n\n\"As long as, Licchavis, these seven conditions of non-decline shall endure among the Vajjians, and as long as the Vajjians are seen to be acting in accordance with these seven conditions of non-decline, growth alone is to be expected for the Vajjians, not decline.\"",
      "sinhala": "මෙසේ මා විසින් අසන ලදී – එක් සමයෙක භාග්‍යවතුන් වහන්සේ විශාලා නුවර, සාරන්දද නම් චෛත්‍යයෙහි වැඩ සිටි සේක.\n\nඑකල්හි බොහෝ ලිච්ඡවීහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක වාඩිවූහ. එකත්පසෙක වාඩි වී සිටි ඒ ලිච්ඡවීන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"ලිච්ඡවීනි, ඔබට පිරිහීමට හේතු නොවන සප්ත අපරිහානීය ධර්මයන් දේශනා කරමි. එය අසව්, හොඳින් මෙනෙහි කරව්; මම දේශනා කරමි.\"\n\n\"එසේය, ස්වාමීනී\" යැයි ඒ ලිච්ඡවීහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"ලිච්ඡවීනි, ඒ සප්ත අපරිහානීය ධර්මයෝ කවරහුද?\n\nලිච්ඡවීනි, වජ්ජීහු නිරන්තරයෙන් නිතර රැස්වීම් පවත්වන තාක් කල්, නිතර නිතර රැස්වන සුලු වන තාක් කල්, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\n\nලිච්ඡවීනි, වජ්ජීහු සමගිව රැස්වන තාක් කල්, සමගිව නැගී සිටින තාක් කල්, සමගිව වජ්ජීන්ට අදාළ කටයුතු කරන තාක් කල්, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\n\nලිච්ඡවීනි, වජ්ජීහු නුපනවූ දේ (නීති) පනවන්නේ නැති තාක් කල්, පනවන ලද දේ (නීති) උදුරා දමන්නේ නැති තාක් කල්, පනවන ලද පැරණි වජ්ජී ධර්මයන් (නීතිරීති) පිළිගෙන ඒ අනුව කටයුතු කරන තාක් කල්, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\n\nලිච්ඡවීනි, වජ්ජීන් අතර සිටින යම් වයසින් වැඩි, ප්‍රඥාවෙන් වැඩි වජ්ජී මහාල්ලකවරුන් ඇද්ද, ඔවුනට සත්කාර කරන තාක් කල්, ගරු කරන තාක් කල්, මානයෙන් තොරව සලකන තාක් කල්, පුදන තාක් කල්, ඔවුන්ගේ වචන ඇසිය යුතු යැයි සලකන තාක් කල්, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\n\nලිච්ඡවීනි, වජ්ජීහු යම් කුල ස්ත්‍රීහුද, කුල කුමාරිකාවෝද ඇද්ද, ඔවුන් බලහත්කාරයෙන් තම වාසයට නොගන්නා තාක් කල්, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\n\nලිච්ඡවීනි, වජ්ජීන්ට අයත්, ඇතුළත හා පිටත පිහිටි යම් වජ්ජී චෛත්‍යයන් ඇද්ද, ඒවාට සත්කාර කරන තාක් කල්, ගරු කරන තාක් කල්, මානයෙන් තොරව සලකන තාක් කල්, පුදන තාක් කල්, පෙර දී ඇති, පෙර කරන ලද, ධාර්මික පූජා බිලි (පූජාවන්) අත්නොහරින තාක් කල්, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\n\nලිච්ඡවීනි, වජ්ජීන්ගේ රහතන් වහන්සේලා කෙරෙහි, 'අනාගතයේ දී පැමිණෙන රහතන් වහන්සේලා අපගේ දේශයට පැමිණෙත්වා, පැමිණ සිටින රහතන් වහන්සේලා අපගේ දේශයෙහි සැපසේ වාසය කෙරෙත්වා' යනු සිතා, ධාර්මික ආරක්‍ෂාව, ආවරණය, ආරක්ෂණ විධි විධිමත් ලෙස සකසා ඇති තාක් කල්, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\n\nලිච්ඡවීනි, යම් තාක් කල් මේ සප්ත අපරිහානීය ධර්මයෝ වජ්ජීන් අතර පවතින්නාහුද, තවද යම් තාක් කල් මේ සප්ත අපරිහානීය ධර්මයන්හි වජ්ජීහු දැක්වෙන්නාහුද, ලිච්ඡවීනි, වජ්ජීන්ගේ දියුණුවම බලාපොරොත්තු විය යුතු ය, පිරිහීමක් නැත.\"",
      "paliTitle": "Sārandadasuttaṃ",
      "englishTitle": "Sārandada Sutta",
      "sinhalaTitle": "සාරන්දද සූත්‍රය"
    },
    {
      "number": 22,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena rājā māgadho ajātasattu vedehiputto vajjī abhiyātukāmo hoti. So evamāha – ‘‘ahaṃ hime vajjī evaṃmahiddhike evaṃmahānubhāve ucchecchāmi [ucchejjissāmi (syā.), ucchijjissāmi (ka.)], vajjī vināsessāmi, vajjī anayabyasanaṃ āpādessāmī’’ti [āpādessāmi vajjīti (ka.) dī. ni. 2.131]. Atha kho rājā māgadho ajātasattu vedehiputto vassakāraṃ brāhmaṇaṃ māgadhamahāmattaṃ āmantesi – ‘‘ehi tvaṃ, brāhmaṇa, yena bhagavā tenupasaṅkama; upasaṅkamitvā mama vacanena bhagavato pāde sirasā vandāhi, appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ puccha – ‘rājā, bhante, māgadho ajātasattu vedehiputto bhagavato pāde sirasā vandati, appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchatī’ti. Evañca vadehi – ‘rājā, bhante, māgadho ajātasattu vedehiputto vajjī abhiyātukāmo. So evamāha – ‘ahaṃ hime vajjī evaṃmahiddhike evaṃmahānubhāve ucchecchāmi, vajjī vināsessāmi, vajjī anayabyasanaṃ āpādessāmī’ti. Yathā te bhagavā byākaroti, taṃ sādhukaṃ uggahetvā mama āroceyyāsi. Na hi tathāgatā vitathaṃ bhaṇantī’’ti. ‘‘Evaṃ, bho’’ti kho vassakāro brāhmaṇo māgadhamahāmatto rañño māgadhassa ajātasattussa vedehiputtassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo māgadhamahāmatto bhagavantaṃ etadavoca – ‘‘rājā, bho gotama, māgadho ajātasattu vedehiputto bhoto gotamassa pāde sirasā vandati, appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchati. Rājā [evañca vadeti rājā (sī. ka.)], bho gotama, māgadho ajātasattu vedehiputto vajjī abhiyātukāmo. So evamāha – ‘ahaṃ hime vajjī evaṃmahiddhike evaṃmahānubhāve ucchecchāmi, vajjī vināsessāmi, vajjī anayabyasanaṃ āpādessāmī’’’ti. Tena kho pana samayena āyasmā ānando bhagavato piṭṭhito ṭhito hoti bhagavantaṃ bījayamāno [vījamāno (sī. syā.)]. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘kinti te, ānanda, sutaṃ – ‘vajjī abhiṇhaṃ sannipātā sannipātabahulā’’’ti? ‘‘Sutaṃ metaṃ, bhante – ‘vajjī abhiṇhaṃ sannipātā sannipātabahulā’’’ti. ‘‘Yāvakīvañca, ānanda, vajjī abhiṇhaṃ sannipātā bhavissanti sannipātabahulā; vuddhiyeva, ānanda, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Kinti te, ānanda, sutaṃ – ‘vajjī samaggā sannipatanti, samaggā vuṭṭhahanti, samaggā vajjikaraṇīyāni karontī’’’ti? ‘‘Sutaṃ metaṃ, bhante – ‘vajjī samaggā sannipatanti, samaggā vuṭṭhahanti, samaggā vajjikaraṇīyāni karontī’’’ti. ‘‘Yāvakīvañca, ānanda, vajjī samaggā sannipatissanti, samaggā vuṭṭhahissanti, samaggā vajjikaraṇīyāni karissanti; vuddhiyeva, ānanda, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Kinti te, ānanda, sutaṃ – ‘vajjī apaññattaṃ na paññāpenti, paññattaṃ na samucchindanti, yathāpaññatte porāṇe vajjidhamme samādāya vattantī’’’ti? ‘‘Sutaṃ metaṃ, bhante – ‘vajjī apaññattaṃ na paññāpenti, paññattaṃ na samucchindanti, yathāpaññatte porāṇe vajjidhamme samādāya vattantī’’’ti. ‘‘Yāvakīvañca, ānanda, vajjī apaññattaṃ na paññāpessanti, paññattaṃ na samucchindissanti, yathāpaññatte porāṇe vajjidhamme samādāya vattissanti; vuddhiyeva, ānanda, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Kinti te, ānanda, sutaṃ – ‘vajjī ye te vajjīnaṃ vajjimahallakā te sakkaronti garuṃ karonti mānenti pūjenti, tesañca sotabbaṃ maññantī’’’ti? ‘‘Sutaṃ metaṃ, bhante – ‘vajjī ye te vajjīnaṃ vajjimahallakā te sakkaronti garuṃ karonti mānenti pūjenti, tesañca sotabbaṃ maññantī’’’ti. ‘‘Yāvakīvañca, ānanda, vajjī ye te vajjīnaṃ vajjimahallakā te sakkarissanti garuṃ karissanti mānessanti pūjessanti, tesañca sotabbaṃ maññissanti; vuddhiyeva, ānanda, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Kinti te, ānanda, sutaṃ – ‘vajjī yā tā kulitthiyo kulakumāriyo tā na okassa pasayha vāsentī’’’ti? ‘‘Sutaṃ metaṃ, bhante – ‘vajjī yā tā kulitthiyo kulakumāriyo tā na okassa pasayha vāsentī’’’ti. ‘‘Yāvakīvañca, ānanda, vajjī yā tā kulitthiyo kulakumāriyo tā na okassa pasayha vāsessanti; vuddhiyeva, ānanda, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Kinti te, ānanda, sutaṃ – ‘vajjī yāni tāni vajjīnaṃ vajjicetiyāni abbhantarāni ceva bāhirāni ca tāni sakkaronti garuṃ karonti mānenti pūjenti, tesañca dinnapubbaṃ katapubbaṃ dhammikaṃ baliṃ no parihāpentī’’’ti? ‘‘Sutaṃ metaṃ, bhante – ‘vajjī yāni tāni vajjīnaṃ vajjicetiyāni abbhantarāni ceva bāhirāni ca tāni sakkaronti garuṃ karonti mānenti pūjenti, tesañca dinnapubbaṃ katapubbaṃ dhammikaṃ baliṃ no parihāpentī’’’ti. ‘‘Yāvakīvañca, ānanda, vajjī yāni tāni vajjīnaṃ vajjicetiyāni abbhantarāni ceva bāhirāni ca tāni sakkarissanti garuṃ karissanti mānessanti pūjessanti, tesañca dinnapubbaṃ katapubbaṃ dhammikaṃ baliṃ no parihāpessanti; vuddhiyeva, ānanda, vajjīnaṃ pāṭikaṅkhā, no parihāni. ‘‘Kinti te, ānanda, sutaṃ – ‘vajjīnaṃ arahantesu dhammikā rakkhāvaraṇagutti susaṃvihitā – kinti anāgatā ca arahanto vijitaṃ āgaccheyyuṃ, āgatā ca arahanto vijite phāsuṃ vihareyyu’’’nti? ‘‘Sutaṃ metaṃ, bhante – ‘vajjīnaṃ arahantesu dhammikā rakkhāvaraṇagutti susaṃvihitā bhavissati – kinti anāgatā ca arahanto vijitaṃ āgaccheyyuṃ, āgatā ca arahanto vijite phāsuṃ vihareyyu’’’nti. ‘‘Yāvakīvañca, ānanda, vajjīnaṃ arahantesu dhammikā rakkhāvaraṇagutti susaṃvihitā bhavissati – ‘kinti anāgatā ca arahanto vijitaṃ āgaccheyyuṃ, āgatā ca arahanto vijite phāsuṃ vihareyyu’nti; vuddhiyeva, ānanda, vajjīnaṃ pāṭikaṅkhā, no parihānī’’ti. Atha kho bhagavā vassakāraṃ brāhmaṇaṃ māgadhamahāmattaṃ āmantesi – ‘‘ekamidāhaṃ, brāhmaṇa, samayaṃ vesāliyaṃ viharāmi sārandade cetiye. Tatrāhaṃ, brāhmaṇa, vajjīnaṃ ime satta aparihāniye dhamme desesiṃ. Yāvakīvañca, brāhmaṇa, ime satta aparihāniyā dhammā vajjīsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu vajjī sandississanti; vuddhiyeva, brāhmaṇa, vajjīnaṃ pāṭikaṅkhā, no parihānī’’ti. ‘‘Ekamekenapi [ekamekenapi tena kho (ka.) dī. ni. 2.135] bho, gotama, aparihāniyena dhammena samannāgatānaṃ vajjīnaṃ vuddhiyeva pāṭikaṅkhā, no parihāni; ko pana vādo sattahi aparihāniyehi dhammehi! Akaraṇīyā ca, bho gotama, vajjī raññā māgadhena ajātasattunā vedehiputtena yadidaṃ yuddhassa, aññatra upalāpanāya [upalāpanā (ka. sī. ka.)], aññatra mithubhedā. Handa ca dāni mayaṃ, bho gotama, gacchāma, bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassadāni tvaṃ, brāhmaṇa, kālaṃ maññasī’’ti. Atha kho vassakāro brāhmaṇo māgadhamahāmatto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā pakkāmīti. Dutiyaṃ.",
      "english": "Thus have I heard. At one time the Blessed One was staying at Rājagaha, on Gijjhakūṭa mountain. Now at that time King Ajātasattu of Magadha, the son of Vaidehī, desired to attack the Vajjians. He declared, \"I shall utterly destroy these Vajjians, mighty and powerful though they are! I shall bring these Vajjians to ruin and utter destruction!\"\n\nThen King Ajātasattu of Magadha, the son of Vaidehī, addressed Vassakāra the brahmin, the chief minister of Magadha: \"Come, brahmin, go to the Blessed One; having approached him, bow your head at his feet on my behalf, and ask about his good health, freedom from illness, light burdens, strength, and comfortable dwelling, saying, 'Venerable sir, King Ajātasattu of Magadha, the son of Vaidehī, bows his head at the feet of the Blessed One and asks about his good health, freedom from illness, light burdens, strength, and comfortable dwelling.' And also say this: 'Venerable sir, King Ajātasattu of Magadha, the son of Vaidehī, desires to attack the Vajjians. He declares: \"I shall utterly destroy these Vajjians, mighty and powerful though they are! I shall bring these Vajjians to ruin and utter destruction!\"' And whatever the Blessed One answers you, remember it carefully and report it to me. For the Tathāgatas do not speak falsely.\"\n\n\"Yes, venerable sir,\" replied Vassakāra the brahmin, the chief minister of Magadha, to King Ajātasattu of Magadha, the son of Vaidehī. Then he approached the Blessed One, and having approached him, he exchanged courteous and amiable greetings with the Blessed One. After this exchange of greetings and polite conversation, he sat down to one side.\n\nSeated to one side, Vassakāra the brahmin, the chief minister of Magadha, said to the Blessed One: \"Venerable Gotama, King Ajātasattu of Magadha, the son of Vaidehī, bows his head at the feet of Venerable Gotama and asks about his good health, freedom from illness, light burdens, strength, and comfortable dwelling. Venerable Gotama, King Ajātasattu of Magadha, the son of Vaidehī, desires to attack the Vajjians. He declares: 'I shall utterly destroy these Vajjians, mighty and powerful though they are! I shall bring these Vajjians to ruin and utter destruction!'\"\n\nNow at that time, the Venerable Ānanda was standing behind the Blessed One, fanning him. Then the Blessed One addressed the Venerable Ānanda: \"Ānanda, what have you heard? Do the Vajjians hold frequent assemblies, are their gatherings frequent?\"\n\n\"I have heard, venerable sir, that the Vajjians hold frequent assemblies, that their gatherings are frequent.\"\n\n\"So long, Ānanda, as the Vajjians hold frequent assemblies and their gatherings are frequent, their prosperity is to be expected, not their decline.\n\n\"Ānanda, what have you heard? Do the Vajjians assemble in harmony, rise in harmony, and perform their affairs in harmony?\"\n\n\"I have heard, venerable sir, that the Vajjians assemble in harmony, rise in harmony, and perform their affairs in harmony.\"\n\n\"So long, Ānanda, as the Vajjians assemble in harmony, rise in harmony, and perform their affairs in harmony, their prosperity is to be expected, not their decline.\n\n\"Ānanda, what have you heard? Do the Vajjians not enact what has not been enacted, not abolish what has been enacted, and adhere to and practice the ancient Vajjian laws as they were laid down?\"\n\n\"I have heard, venerable sir, that the Vajjians do not enact what has not been enacted, do not abolish what has been enacted, and adhere to and practice the ancient Vajjian laws as they were laid down.\"\n\n\"So long, Ānanda, as the Vajjians do not enact what has not been enacted, do not abolish what has been enacted, and adhere to and practice the ancient Vajjian laws as they were laid down, their prosperity is to be expected, not their decline.\n\n\"Ānanda, what have you heard? Do the Vajjians honor, respect, esteem, and revere their Vajjian elders, and consider their words to be worth listening to?\"\n\n\"I have heard, venerable sir, that the Vajjians honor, respect, esteem, and revere their Vajjian elders, and consider their words to be worth listening to.\"\n\n\"So long, Ānanda, as the Vajjians honor, respect, esteem, and revere their Vajjian elders, and consider their words to be worth listening to, their prosperity is to be expected, not their decline.\n\n\"Ānanda, what have you heard? Do the Vajjians not abduct and detain noblewomen and noble maidens?\"\n\n\"I have heard, venerable sir, that the Vajjians do not abduct and detain noblewomen and noble maidens.\"\n\n\"So long, Ānanda, as the Vajjians do not abduct and detain noblewomen and noble maidens, their prosperity is to be expected, not their decline.\n\n\"How have you heard, Ananda – do the Vajji honor, respect, revere, and pay homage to those Vajji shrines, both internal and external, and do they not neglect the righteous offerings previously made and performed for them?\"\n\n\"I have heard this, Lord – that the Vajji honor, respect, revere, and pay homage to those Vajji shrines, both internal and external, and they do not neglect the righteous offerings previously made and performed for them.\"\n\n\"As long as, Ananda, the Vajji will honor, respect, revere, and pay homage to those Vajji shrines, both internal and external, and will not neglect the righteous offerings previously made and performed for them, then growth alone, Ananda, is to be expected for the Vajji, not decline.\"\n\n\"How have you heard, Ananda – is a righteous protection and safeguard well-established for the Vajji with regard to the Arahants, so that Arahants who have not yet come may come to their territory, and Arahants who have come may dwell comfortably in their territory?\"\n\n\"I have heard this, Lord – that a righteous protection and safeguard will be well-established for the Vajji with regard to the Arahants, so that Arahants who have not yet come may come to their territory, and Arahants who have come may dwell comfortably in their territory.\"\n\n\"As long as, Ananda, a righteous protection and safeguard will be well-established for the Vajji with regard to the Arahants, so that Arahants who have not yet come may come to their territory, and Arahants who have come may dwell comfortably in their territory, then growth alone, Ananda, is to be expected for the Vajji, not decline.\"\n\nThen the Blessed One addressed Vassakāra the Brahmin, the chief minister of Magadha: \"Once, Brahmin, I was dwelling in Vesālī, at the Sārandada Shrine. There, Brahmin, I taught these seven conditions of welfare to the Vajji. As long as, Brahmin, these seven conditions of welfare remain among the Vajji, and as long as the Vajji are seen to embody these seven conditions of welfare, then growth alone, Brahmin, is to be expected for the Vajji, not decline.\"\n\n\"Indeed, Master Gotama, for the Vajji endowed with even one condition of welfare, growth alone is to be expected, not decline; how much more so, then, when they are endowed with all seven conditions of welfare! The Vajji, Master Gotama, are not to be overcome by King Ajātasattu of Magadha, the son of Videhi, by means of war, except through flattery and appeasement or through sowing dissension. Well then, Master Gotama, we should depart now, for we have much to do, many pressing duties.\"\n\n\"Do as you see fit now, Brahmin.\"\n\nThen Vassakāra the Brahmin, the chief minister of Magadha, delighted in and approved of the Blessed One's words, rose from his seat, and departed.",
      "sinhala": "මා හට මෙසේ අසන ලදි: එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ඣකූට පර්වතයේ වැඩසිටින සේක. එසමයෙහි ම වේදේහි පුත් මගධ රජ අජාතශත්‍රැ වජ්ජීන් කෙරෙහි යුද්ධයට යාමට කැමැත්තෙන් සිටියේ ය. හෙතෙම මෙසේ කීය: ''මම මේ මෙතරම් මහත් ඍද්ධියක් ඇති, මෙතරම් මහත් ආනුභාවයක් ඇති වජ්ජීන් මුලිනුපුටා දමන්නෙමි, වජ්ජීන් විනාශ කරන්නෙමි, වජ්ජීන් විනාශයට හා අවාසනාවට පත් කරන්නෙමි.''\n\nඑසමයෙහි වේදේහි පුත් මගධ රජ අජාතශත්‍රැ වස්සකාර බ්‍රාහ්මණ නම් මගධ මහාමාත්‍යයා අමතා මෙසේ කීය: ''බ්‍රාහ්මණය, එන්න, භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට යන්න. එළඹ, මාගේ වචනයෙන් භාග්‍යවතුන් වහන්සේගේ පාද හිසින් වඳින්න, ආබාධ රහිත බව, රෝග රහිත බව, සැහැල්ලු බව, ශක්තිය, සුවසේ වැඩසිටීම ගැන විමසන්න – 'භාග්‍යවතුන් වහන්ස, වේදේහි පුත් මගධ රජ අජාතශත්‍රැ භාග්‍යවතුන් වහන්සේගේ පාද හිසින් වඳියි, ආබාධ රහිත බව, රෝග රහිත බව, සැහැල්ලු බව, ශක්තිය, සුවසේ වැඩසිටීම ගැන විමසයි' කියා දන්වන්න. මෙසේ ද කියන්න – 'භාග්‍යවතුන් වහන්ස, වේදේහි පුත් මගධ රජ අජාතශත්‍රැ වජ්ජීන් කෙරෙහි යුද්ධයට යාමට කැමැත්තෙන් සිටියි. හෙතෙම මෙසේ කීය: ''මම මේ මෙතරම් මහත් ඍද්ධියක් ඇති, මෙතරම් මහත් ආනුභාවයක් ඇති වජ්ජීන් මුලිනුපුටා දමන්නෙමි, වජ්ජීන් විනාශ කරන්නෙමි, වජ්ජීන් විනාශයට හා අවාසනාවට පත් කරන්නෙමි.'' භාග්‍යවතුන් වහන්සේ ඔබට යම් පිළිතුරක් දෙන්නේ ද, එය හොඳින් මතක තබාගෙන මට දන්වන්න. මක්නිසාද යත්, තථාගතයන් වහන්සේලා අසත්‍යය නොකියන සේක.''\n\n''එසේ ය, ස්වාමීනි'' යි මගධ මහාමාත්‍ය වස්සකාර බ්‍රාහ්මණයා වේදේහි පුත් මගධ රජ අජාතශත්‍රැට පිළිතුරු දී, භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹියේ ය. එළඹ භාග්‍යවතුන් වහන්සේ සමඟ ප්‍රීති විය. ප්‍රීති විය යුතු හා සිහිකළ යුතු කථා බස් කතා කර නිමවා, එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි මගධ මහාමාත්‍ය වස්සකාර බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීය: ''භවත් ගෞතමයන් වහන්ස, වේදේහි පුත් මගධ රජ අජාතශත්‍රැ භවත් ගෞතමයන් වහන්සේගේ පාද හිසින් වඳියි, ආබාධ රහිත බව, රෝග රහිත බව, සැහැල්ලු බව, ශක්තිය, සුවසේ වැඩසිටීම ගැන විමසයි. භවත් ගෞතමයන් වහන්ස, වේදේහි පුත් මගධ රජ අජාතශත්‍රැ වජ්ජීන් කෙරෙහි යුද්ධයට යාමට කැමැත්තෙන් සිටියි. හෙතෙම මෙසේ කීය: ''මම මේ මෙතරම් මහත් ඍද්ධියක් ඇති, මෙතරම් මහත් ආනුභාවයක් ඇති වජ්ජීන් මුලිනුපුටා දමන්නෙමි, වජ්ජීන් විනාශ කරන්නෙමි, වජ්ජීන් විනාශයට හා අවාසනාවට පත් කරන්නෙමි.''\n\nඑසමයෙහි ම ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිටුපසින් සිට පවන් සලමින් සිටියේ ය. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ අමතා මෙසේ වදාළ සේක: ''ආනන්ද, වජ්ජීන් නිතර රැස්වෙන, රැස්වීම් බහුල පිරිසක් බව ඔබට අසන්නට ලැබුණේ කෙසේ ද?'' ''භාග්‍යවතුන් වහන්ස, මා විසින් එය අසන ලදි: ‘වජ්ජීන් නිතර රැස්වෙන, රැස්වීම් බහුල පිරිසකි’ කියා ය.'' ''ආනන්ද, වජ්ජීන් නිතර රැස්වෙන, රැස්වීම් බහුල පිරිසක් වන තාක් කල්, වජ්ජීන්ගේ දියුණුවක් ම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු ය.\n\n''ආනන්ද, වජ්ජීන් සමගිව රැස්වෙන, සමගිව විසිරෙන, සමගිව වජ්ජි රාජ්‍යයේ කටයුතු කරන බව ඔබට අසන්නට ලැබුණේ කෙසේ ද?'' ''භාග්‍යවතුන් වහන්ස, මා විසින් එය අසන ලදි: ‘වජ්ජීන් සමගිව රැස්වෙන, සමගිව විසිරෙන, සමගිව වජ්ජි රාජ්‍යයේ කටයුතු කරයි’ කියා ය.'' ''ආනන්ද, වජ්ජීන් සමගිව රැස්වෙන, සමගිව විසිරෙන, සමගිව වජ්ජි රාජ්‍යයේ කටයුතු කරන තාක් කල්, වජ්ජීන්ගේ දියුණුවක් ම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු ය.\n\n''ආනන්ද, වජ්ජීන් විසින් නොපණවන ලද නීති නොපණවන, පණවන ලද නීති අහෝසි නොකරන, පණවන ලද පුරාණ වජ්ජි ධර්මයන් පිළිගෙන ක්‍රියා කරන බව ඔබට අසන්නට ලැබුණේ කෙසේ ද?'' ''භාග්‍යවතුන් වහන්ස, මා විසින් එය අසන ලදි: ‘වජ්ජීන් විසින් නොපණවන ලද නීති නොපණවන, පණවන ලද නීති අහෝසි නොකරන, පණවන ලද පුරාණ වජ්ජි ධර්මයන් පිළිගෙන ක්‍රියා කරයි’ කියා ය.'' ''ආනන්ද, වජ්ජීන් විසින් නොපණවන ලද නීති නොපණවන, පණවන ලද නීති අහෝසි නොකරන, පණවන ලද පුරාණ වජ්ජි ධර්මයන් පිළිගෙන ක්‍රියා කරන තාක් කල්, වජ්ජීන්ගේ දියුණුවක් ම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු ය.\n\n''ආනන්ද, වජ්ජීන් වජ්ජි දේශයේ යම් වැඩිහිටි උතුමන් වෙත් ද, ඔවුන්ට සත්කාර කරන, ගරු කරන, මානයෙන් තොරව සලකන, පුදන, ඔවුන්ගේ වචන අසන බව ඔබට අසන්නට ලැබුණේ කෙසේ ද?'' ''භාග්‍යවතුන් වහන්ස, මා විසින් එය අසන ලදි: ‘වජ්ජීන් වජ්ජි දේශයේ යම් වැඩිහිටි උතුමන් වෙත් ද, ඔවුන්ට සත්කාර කරන, ගරු කරන, මානයෙන් තොරව සලකන, පුදන, ඔවුන්ගේ වචන අසයි’ කියා ය.'' ''ආනන්ද, වජ්ජීන් වජ්ජි දේශයේ යම් වැඩිහිටි උතුමන් වෙත් ද, ඔවුන්ට සත්කාර කරන, ගරු කරන, මානයෙන් තොරව සලකන, පුදන, ඔවුන්ගේ වචන අසන තාක් කල්, වජ්ජීන්ගේ දියුණුවක් ම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු ය.\n\n''ආනන්ද, වජ්ජීන් කුල කාන්තාවන් සහ කුල කුමාරිකාවන් බලහත්කාරයෙන් තම පාලනයට යටත් කර නොගන්නා බව ඔබට අසන්නට ලැබුණේ කෙසේ ද?'' ''භාග්‍යවතුන් වහන්ස, මා විසින් එය අසන ලදි: ‘වජ්ජීන් කුල කාන්තාවන් සහ කුල කුමාරිකාවන් බලහත්කාරයෙන් තම පාලනයට යටත් කර නොගනියි’ කියා ය.'' ''ආනන්ද, වජ්ජීන් කුල කාන්තාවන් සහ කුල කුමාරිකාවන් බලහත්කාරයෙන් තම පාලනයට යටත් කර නොගන්නා තාක් කල්, වජ්ජීන්ගේ දියුණුවක් ම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු ය.\n\n‘‘ආනන්දයෙනි, ඔබට මෙය කෙසේ අසන්නට ලැබුණාද? 'වජ්ජීන් විසින් අභ්‍යන්තර හා බාහිරව ඇති වජ්ජී චෛත්‍යයන්ට සත්කාර කරති, ගරු කරති, බුහුමන් කරති, පුදති. පෙර දෙන ලද, පෙර කරන ලද ධර‍්මයට අනුව දෙන බලි පූජා අත් නොහරිති' යනුයි.‘‘භාග්‍#zwj;යවතුන් වහන්ස, මට එය අසන්නට ලැබුණා – 'වජ්ජීන් විසින් අභ්‍යන්තර හා බාහිරව ඇති වජ්ජී චෛත්‍යයන්ට සත්කාර කරති, ගරු කරති, බුහුමන් කරති, පුදති. පෙර දෙන ලද, පෙර කරන ලද ධර‍්මයට අනුව දෙන බලි පූජා අත් නොහරිති' යනුයි. ආනන්දයෙනි, වජ්ජීන් යම් තාක් කල් වජ්ජීන්ට අයත් අභ්‍යන්තර හා බාහිර වජ්ජී චෛත්‍යයන්ට සත්කාර කරත්ද, ගරු කරත්ද, බුහුමන් කරත්ද, පුදත්ද, ඔවුන් විසින් පෙර දෙන ලද, පෙර කරන ලද ධර‍්මයට අනුව දෙන බලි පූජා අත් නොහරිත්ද; ආනන්දයෙනි, වජ්ජීන්ට අපේක්ෂා කළ යුත්තේ දියුණුවම මිස පිරිහීමක් නොවේ.‘‘ආනන්දයෙනි, ඔබට මෙය කෙසේ අසන්නට ලැබුණාද? 'අනාගත අරහතුන් වහන්සේලා දේශයට පැමිණෙන පරිද්දෙන්ද, පැමිණි අරහතුන් වහන්සේලා දේශය තුළ සුවසේ වැඩසිටින පරිද්දෙන්ද වජ්ජීන් විසින් අරහතුන් වහන්සේලා කෙරෙහි ධර‍්මයට අනුකූලව ආරක්ෂා පියවරයන් හොඳින් සකස් කරනු ලබනවා' යනුයි.‘‘භාග්‍#zwj;යවතුන් වහන්ස, මට එය අසන්නට ලැබුණා – 'අනාගත අරහතුන් වහන්සේලා දේශයට පැමිණෙන පරිද්දෙන්ද, පැමිණි අරහතුන් වහන්සේලා දේශය තුළ සුවසේ වැඩසිටින පරිද්දෙන්ද වජ්ජීන් විසින් අරහතුන් වහන්සේලා කෙරෙහි ධර‍්මයට අනුකූලව ආරක්ෂා පියවරයන් හොඳින් සකස් කරනු ලබනු ඇතැයි' යනුයි. ආනන්දයෙනි, වජ්ජීන් විසින් අනාගත අරහතුන් වහන්සේලා දේශයට පැමිණෙන පරිද්දෙන්ද, පැමිණි අරහතුන් වහන්සේලා දේශය තුළ සුවසේ වැඩසිටින පරිද්දෙන්ද අරහතුන් වහන්සේලා කෙරෙහි ධර‍්මයට අනුකූල ආරක්ෂා පියවරයන් හොඳින් සකස් කරන තාක් කල්; ආනන්දයෙනි, වජ්ජීන්ට අපේක්ෂා කළ යුත්තේ දියුණුවම මිස පිරිහීමක් නොවේ.\n\nඉක්බිති භාග්‍#zwj;යවතුන් වහන්සේ මගධ මහාමාත්‍ය වස්සකාර බ්‍රාහ්මණයා අමතා වදාළ සේක: “බ්‍රාහ්මණය, මම එක් කලක වෛශාලියෙහි සාරන්දද චෛත්‍යයෙහි වාසය කළෙමි. එහිදී මම බ්‍රාහ්මණය, වජ්ජීන්ට මේ සත් අපරිහානීය ධර‍්ම දේශනා කළෙමි. බ්‍රාහ්මණය, යම් තාක් කල් මේ සත් අපරිහානීය ධර‍්ම වජ්ජීන් අතර පවතීද, මේ සත් අපරිහානීය ධර‍්මයන්ගෙන් යුක්තව වජ්ජීහු දැක්වෙත්ද; බ්‍රාහ්මණය, වජ්ජීන්ට අපේක්ෂා කළ යුත්තේ දියුණුවම මිස පිරිහීමක් නොවේ.” “භවත් ගෞතමයින් වහන්ස, එකම අපරිහානීය ධර‍්මයකින් යුක්ත වජ්ජීන්ටත් දියුණුවම අපේක්ෂා කළ යුත්තකි, පිරිහීමක් නොවේ; සත් අපරිහානීය ධර‍්මයන්ගෙන් යුක්ත වන විට කියනුම කවරේද! භවත් ගෞතමයින් වහන්ස, වේදේහී පුත්‍ර මගධ රජ අජාතශත්‍ර#zwj;ු විසින් වජ්ජීන්ට යුද්ධයක් කළ යුත්තක් නැත. ඔවුන්ට කළ හැකි වන්නේ රැවටීමෙන් හෝ භේදභින්න කිරීමෙන් පමණි. භවත් ගෞතමයින් වහන්ස, එසේනම් අපි දැන් යමු, අපට බොහෝ කටයුතු ඇත, කළ යුතු දේ බොහෝ ඇතැයි කීවේය. “බ්‍රාහ්මණය, ඔබ දැන් සුදුසු කාලය යැයි සිතන්න.” ඉක්බිති මගධ මහාමාත්‍ය වස්සකාර බ්‍රාහ්මණයා භාග්‍#zwj;යවතුන් වහන්සේගේ වචනය අභිනන්දනය කොට, අනුමෝදන් කොට අසුනෙන් නැගිට පිටත්ව ගියේය. දෙවැනි කොටස.",
      "paliTitle": "Vassakārasuttaṃ",
      "englishTitle": "The Discourse to Vassakāra",
      "sinhalaTitle": "වස්සකාර සූත්‍රය"
    },
    {
      "number": 23,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tatra kho bhagavā bhikkhū āmantesi – ‘‘satta vo, bhikkhave, aparihāniye dhamme desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katame ca, bhikkhave, satta aparihāniyā dhammā? Yāvakīvañca, bhikkhave, bhikkhū abhiṇhaṃ sannipātā bhavissanti sannipātabahulā; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū samaggā sannipatissanti, samaggā vuṭṭhahissanti, samaggā saṅghakaraṇīyāni karissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū apaññattaṃ na paññāpessanti, paññattaṃ na samucchindissanti, yathāpaññattesu sikkhāpadesu samādāya vattissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū ye te bhikkhū therā rattaññū cirapabbajitā saṅghapitaro saṅghapariṇāyakā te sakkarissanti garuṃ karissanti mānessanti pūjessanti, tesañca sotabbaṃ maññissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū uppannāya taṇhāya ponobhavikāya na vasaṃ gacchissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū āraññakesu senāsanesu sāpekkhā bhavissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū paccattaññeva satiṃ upaṭṭhāpessanti – ‘kinti anāgatā ca pesalā sabrahmacārī āgaccheyyuṃ, āgatā ca pesalā sabrahmacārī phāsuṃ vihareyyu’nti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, ime satta aparihāniyā dhammā bhikkhūsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu bhikkhū sandississanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihānī’’ti. Tatiyaṃ.",
      "english": "Thus have I heard. At one time the Blessed One was dwelling at Rājagaha, on Vulture Peak Mountain. There, the Blessed One addressed the monks, saying: \"Monks, I will teach you seven conditions leading to non-decline. Listen to it, pay close attention, I will speak.\" \"Yes, venerable sir,\" those monks replied to the Blessed One. The Blessed One then said: \"And what, monks, are the seven conditions leading to non-decline?\n\nAs long as, monks, the bhikkhus frequently assemble, and assemble in large numbers, their growth is to be expected, not their decline.\n\nAs long as, monks, the bhikkhus assemble in harmony, rise in harmony, and perform the Sangha's duties in harmony, their growth is to be expected, not their decline.\n\nAs long as, monks, the bhikkhus do not introduce new rules that have not been laid down, nor abolish existing rules that have been laid down, but live and act in accordance with the training rules as they have been laid down, their growth is to be expected, not their decline.\n\nAs long as, monks, the bhikkhus honor, respect, revere, and venerate those bhikkhus who are elders, long-experienced, long-ordained, fathers of the Sangha, leaders of the Sangha, and consider their words worth listening to, their growth is to be expected, not their decline.\n\nAs long as, monks, the bhikkhus do not fall under the power of craving that leads to renewed existence, their growth is to be expected, not their decline.\n\nAs long as, monks, the bhikkhus cherish remote forest abodes, their growth is to be expected, not their decline.\n\nAs long as, monks, the bhikkhus establish mindfulness within themselves, with the thought: ‘How may virtuous fellow-practitioners who have not yet come, come? And how may those virtuous fellow-practitioners who have already come, live at ease?’ their growth is to be expected, not their decline.\n\nAs long as, monks, these seven conditions leading to non-decline endure among the bhikkhus, and as long as the bhikkhus are seen to be living in accordance with these seven conditions leading to non-decline, their growth is to be expected, not their decline.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මම ඔබට නොපිරිහෙන ධර්ම සතක් දේශනා කරන්නෙමි. එය අසන්න, මනා කොට මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\" \"එසේය, ස්වාමීනී\" යැයි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, නොපිරිහෙන ධර්ම සත කවරේද?\n\nමහණෙනි, භික්ෂූහු නිතර නිතර රැස්වීමට, බොහෝ සෙයින් රැස්වීමට පුරුදු වන තාක් කල්, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.\n\nමහණෙනි, භික්ෂූහු සමගියෙන් රැස්වන තාක් කල්, සමගියෙන් විසිර යන තාක් කල්, සමගියෙන් සංඝ කර්ම සිදු කරන තාක් කල්, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.\n\nමහණෙනි, භික්ෂූහු නොපැණවූ දේ නොපණවන තාක් කල්, පැණවූ දේ සිඳ බිඳ නොදමන තාක් කල්, පැණවූ ශික්ෂා පදයන් හි සමාදන්ව හැසිරෙන තාක් කල්, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.\n\nමහණෙනි, භික්ෂූහු යම් ඒ ථේර, රාත්‍රීඥ වූ, දීර්ඝ කාලයක් පැවිදිව සිටි, සංඝයාගේ පිය වූ, සංඝයා මෙහෙයවන භික්ෂූන් සිටිත්ද, ඔවුන්ට සත්කාර කරන තාක් කල්, ගරු කරන තාක් කල්, බුහුමන් කරන තාක් කල්, පුදන තාක් කල්, ඔවුන්ගේ අදහස් ඇසිය යුත්තක් ලෙස සලකන තාක් කල්, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.\n\nමහණෙනි, භික්ෂූහු හටගන්නා පුනර්භවය ඇති කරන තෘෂ්ණාවට (පෝනොභවික තණ්හාවට) වශ නොවන තාක් කල්, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.\n\nමහණෙනි, භික්ෂූහු ආරණ්‍ය සේනාසන කෙරෙහි කැමැත්තෙන් යුක්ත වන තාක් කල්, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.\n\nමහණෙනි, භික්ෂූහු තමන් තුළම සතිය (සිහිය) පිහිටුවා ගන්නා තාක් කල් – \"නොපැමිණි භාග්‍යවත් බ්‍රහ්මචාරීන් පැමිණෙන්නේ කෙසේද, පැමිණි භාග්‍යවත් බ්‍රහ්මචාරීහු සුවසේ වාසය කරන්නේ කෙසේද\" යන අදහසින් යුතුව, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.\n\nමහණෙනි, යම් තාක් කල් මේ නොපිරිහෙන ධර්ම සත භික්ෂූන් තුළ පවතින්නේද, මේ නොපිරිහෙන ධර්ම සතෙහි භික්ෂූහු පිහිටා සිටින්නේද, භික්ෂූන්ගේ දියුණුවම බලාපොරොත්තු විය යුතුය, පිරිහීමක් නැත.",
      "paliTitle": "Paṭhamasattakasuttaṃ",
      "englishTitle": "The First Discourse on the Group of Seven",
      "sinhalaTitle": "පළමු සත්තක සූත්‍රය"
    },
    {
      "number": 24,
      "pali": "[dī. ni. 2.138] ‘‘Satta vo, bhikkhave, aparihāniye dhamme desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha…pe… katame ca, bhikkhave, satta aparihāniyā dhammā? Yāvakīvañca, bhikkhave, bhikkhū na kammārāmā bhavissanti, na kammaratā, na kammārāmataṃ anuyuttā; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū na bhassārāmā bhavissanti…pe… na niddārāmā bhavissanti… na saṅgaṇikārāmā bhavissanti… na pāpicchā bhavissanti na pāpikānaṃ icchānaṃ vasaṃ gatā… na pāpamittā bhavissanti na pāpasahāyā na pāpasampavaṅkā… na oramattakena visesādhigamena antarāvosānaṃ āpajjissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, ime satta aparihāniyā dhammā bhikkhūsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu bhikkhū sandississanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihānī’’ti. Catutthaṃ.",
      "english": "Monks, I will teach you seven conditions of welfare. Listen to that, attend carefully. And what, monks, are these seven conditions of welfare?\n\nAs long as, monks, the monks do not delight in worldly engagements, are not fond of worldly engagements, and are not devoted to the delighting in worldly engagements; growth alone is to be expected for the monks, not decline.\n\nAs long as, monks, the monks do not delight in idle chatter, are not fond of idle chatter, and are not devoted to the delighting in idle chatter; as long as they do not delight in excessive sleep, are not fond of excessive sleep, and are not devoted to the delighting in excessive sleep; as long as they do not delight in company, are not fond of company, and are not devoted to the delighting in company; as long as they do not have evil wishes, nor are they under the sway of evil wishes; as long as they do not have evil companions, nor evil friends, nor are they associated with evil persons or things; as long as they do not stop short along the spiritual path due to a minor attainment, taking it as the final goal; growth alone is to be expected for the monks, not decline.\n\nAs long as, monks, these seven conditions of welfare remain among the monks, and as long as the monks are seen to abide in these seven conditions of welfare; growth alone is to be expected for the monks, not decline.",
      "sinhala": "භික්ෂූනි, මම ඔබට අපරිහානීය ධර්ම සතක් දේශනා කරන්නෙමි. එය අසන්න, මැනවින් මෙනෙහි කරන්න. භික්ෂූනි, ඒ අපරිහානීය ධර්ම සත කවරේද?\n\nභික්ෂූනි, යම්තාක් කල් භික්ෂූන් කාර්යයන්හි ඇලී නොසිටිත්ද, කාර්යයන්හි ඇලුම් නොකරත්ද, කාර්යයන්හි ඇලීමට යොමු නොවෙත්ද; යම්තාක් කල් භික්ෂූන් නිෂ්ඵල කතාවෙහි ඇලී නොසිටිත්ද; යම්තාක් කල් භික්ෂූන් නිද්‍රාවෙහි ඇලී නොසිටිත්ද; යම්තාක් කල් භික්ෂූන් සමූහයන් හා පිරිස් සමඟ ඇසුරෙහි ඇලී නොසිටිත්ද; යම්තාක් කල් භික්ෂූන් පාපී ආශාවන් ඇති නොවෙත්ද, පාපී ආශාවන්ට වසඟ නොවෙත්ද; යම්තාක් කල් භික්ෂූන් පාප මිත්‍රයන් නොවෙත්ද, පාපී සගයන් නොවෙත්ද, පාපී සබඳකම් ඇති නොවෙත්ද; යම්තාක් කල් භික්ෂූන් සුළු ලාභයක් හෝ සුළු විශේෂ අධිගමයක් (ආධ්‍යාත්මික දියුණුවක්) ලැබූ පමණින් අතරමඟදී අවසන් නොකරත්ද; භික්ෂූන්ට වර්ධනයම මිස පරිහානියක් අපේක්ෂා කළ නොහැක.\n\nභික්ෂූනි, යම්තාක් කල් මේ සප්ත අපරිහානීය ධර්ම භික්ෂූන් අතර පිහිටා තිබෙත්ද, යම්තාක් කල් භික්ෂූන් මේ සප්ත අපරිහානීය ධර්මයන්හි යෙදී සිටිනු දක්නට ලැබෙත්ද; භික්ෂූන්ට වර්ධනයම මිස පරිහානියක් අපේක්ෂා කළ නොහැක.",
      "paliTitle": "Dutiyasattakasuttaṃ",
      "englishTitle": "Second Group of Seven Sutta",
      "sinhalaTitle": "දුතිය සත්තක සූත්‍රය"
    },
    {
      "number": 25,
      "pali": "‘‘Satta vo, bhikkhave, aparihāniye dhamme desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha…pe… katame ca, bhikkhave, satta aparihāniyā dhammā? Yāvakīvañca, bhikkhave, bhikkhū saddhā bhavissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū hirimanto [hirīmā (sī.), hirimanā (dī. ni. 2.138)] bhavissanti… pe… ottappino [ottāpīno (sī.)] bhavissanti… bahussutā bhavissanti… āraddhavīriyā bhavissanti… satimanto bhavissanti… paññavanto bhavissanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, ime satta aparihāniyā dhammā bhikkhūsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu bhikkhū sandississanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihānī’’ti. Pañcamaṃ.",
      "english": "Monks, I will teach you seven conditions of non-decline. Listen to that, and attend carefully. And what, monks, are the seven conditions of non-decline?\n\nAs long, monks, as the bhikkhus possess faith, growth is to be expected for the bhikkhus, not decline. As long, monks, as the bhikkhus are conscientious, growth is to be expected for the bhikkhus, not decline. As long, monks, as the bhikkhus are afraid of wrongdoing, growth is to be expected for the bhikkhus, not decline. As long, monks, as the bhikkhus are learned, growth is to be expected for the bhikkhus, not decline. As long, monks, as the bhikkhus are energetic, growth is to be expected for the bhikkhus, not decline. As long, monks, as the bhikkhus are mindful, growth is to be expected for the bhikkhus, not decline. As long, monks, as the bhikkhus are wise, growth is to be expected for the bhikkhus, not decline.\n\nAs long, monks, as these seven conditions of non-decline remain among the bhikkhus, and as long as the bhikkhus are seen to embody these seven conditions of non-decline, growth is to be expected for the bhikkhus, not decline.",
      "sinhala": "මහණෙනි, මම ඔබට නොපිරිහෙන ධර්ම සතක් දේශනා කරන්නෙමි. ඒවා අසන්න. මැනවින් මෙනෙහි කරන්න. මහණෙනි, නොපිරිහෙන ධර්ම සත කවරේද?\n\nමහණෙනි, යම්තාක් කල් භික්ෂූහු ශ්‍රද්ධාවන්තව වාසය කරන්නාහුද; මහණෙනි, භික්ෂූන්ගේ දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත.\n\nමහණෙනි, යම්තාක් කල් භික්ෂූහු හිරියෙන් යුක්තව වාසය කරන්නාහුද, ඔත්තුප්පයෙන් යුක්තව වාසය කරන්නාහුද, බහුශ්‍රැතව වාසය කරන්නාහුද, ආරම්භ කළ වීර්යයෙන් යුක්තව වාසය කරන්නාහුද, සිහි නුවණින් යුක්තව වාසය කරන්නාහුද, ප්‍රඥාවන්තව වාසය කරන්නාහුද; මහණෙනි, භික්ෂූන්ගේ දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත.\n\nමහණෙනි, යම්තාක් කල් මේ නොපිරිහෙන ධර්ම සත භික්ෂූන් අතර පවතින්නේද, තවද, භික්ෂූහු මේ නොපිරිහෙන ධර්ම සතෙහි යෙදී සිටින්නාහුද; මහණෙනි, භික්ෂූන්ගේ දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත.",
      "paliTitle": "Tatiyasattakasuttaṃ",
      "englishTitle": "Third Discourse on the Groups of Seven",
      "sinhalaTitle": "තතිය සත්තක සූත්‍රය"
    },
    {
      "number": 26,
      "pali": "‘‘Satta vo, bhikkhave, aparihāniye dhamme desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha…pe… katame ca, bhikkhave, satta aparihāniyā dhammā? Yāvakīvañca, bhikkhave, bhikkhū satisambojjhaṅgaṃ bhāvessanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū dhammavicayasambojjhaṅgaṃ bhāvessanti…pe… vīriyasambojjhaṅgaṃ bhāvessanti… pītisambojjhaṅgaṃ bhāvessanti… passaddhisambojjhaṅgaṃ bhāvessanti… samādhisambojjhaṅgaṃ bhāvessanti… upekkhāsambojjhaṅgaṃ bhāvessanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, ime satta aparihāniyā dhammā bhikkhūsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu bhikkhū sandississanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihānī’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, I will teach you seven conditions for non-decline. Listen to that, attend carefully. What then, monks, are these seven conditions for non-decline?\n\nAs long, monks, as the monastics cultivate mindfulness as a factor of awakening; as long as they cultivate investigation of phenomena as a factor of awakening; as long as they cultivate energy as a factor of awakening; as long as they cultivate rapture as a factor of awakening; as long as they cultivate tranquility as a factor of awakening; as long as they cultivate concentration as a factor of awakening; as long as they cultivate equanimity as a factor of awakening – growth is to be expected for the monastics, not decline.\n\nAs long, monks, as these seven conditions for non-decline endure among the monastics, and as long as the monastics are seen to be adhering to these seven conditions for non-decline – growth is to be expected for the monastics, not decline.”",
      "sinhala": "මහණෙනි, ඔබට නොපිරිහෙන ධර්‍ම සතක් දේශනා කරන්නෙමි. එය අසන්න, මනාකොට මෙනෙහි කරන්න. මහණෙනි, නොපිරිහෙන ධර්‍ම සත කවරේද?\n\nමහණෙනි, යම්තාක් කල් භික්ෂූහු සතිසම්බොජ්ඣංගය වඩත්ද; මහණෙනි, භික්ෂූන්ට දියුණුවම අපේක්ෂා කළ යුත්තේය, පරිහානියක් නොවේ. මහණෙනි, යම්තාක් කල් භික්ෂූහු ධම්මවිචය සම්බොජ්ඣංගය වඩත්ද, වීරිය සම්බොජ්ඣංගය වඩත්ද, පීති සම්බොජ්ඣංගය වඩත්ද, පස්සද්ධි සම්බොජ්ඣංගය වඩත්ද, සමාධි සම්බොජ්ඣංගය වඩත්ද, උපේක්ඛා සම්බොජ්ඣංගය වඩත්ද; මහණෙනි, භික්ෂූන්ට දියුණුවම අපේක්ෂා කළ යුත්තේය, පරිහානියක් නොවේ.\n\nමහණෙනි, යම්තාක් කල් මේ නොපිරිහෙන ධර්‍ම සත භික්ෂූන් අතර පිහිටා තිබේද, යම්තාක් කල් භික්ෂූහු මේ නොපිරිහෙන ධර්‍ම සතෙහි පිහිටා සිටින්නෝද; මහණෙනි, භික්ෂූන්ට දියුණුවම අපේක්ෂා කළ යුත්තේය, පරිහානියක් නොවේ.",
      "paliTitle": "Bojjhaṅgasuttaṃ",
      "englishTitle": "The Discourse on Enlightenment Factors",
      "sinhalaTitle": "බොජ්ඣංග සූත්‍රය"
    },
    {
      "number": 27,
      "pali": "‘‘Satta vo, bhikkhave, aparihāniye dhamme desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha…pe…. Katame ca, bhikkhave, satta aparihāniyā dhammā? Yāvakīvañca, bhikkhave, bhikkhū aniccasaññaṃ bhāvessanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, bhikkhū anattasaññaṃ bhāvessanti…pe… asubhasaññaṃ bhāvessanti… ādīnavasaññaṃ bhāvessanti… pahānasaññaṃ bhāvessanti… virāgasaññaṃ bhāvessanti… nirodhasaññaṃ bhāvessanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihāni. ‘‘Yāvakīvañca, bhikkhave, ime satta aparihāniyā dhammā bhikkhūsu ṭhassanti, imesu ca sattasu aparihāniyesu dhammesu, bhikkhū sandississanti; vuddhiyeva, bhikkhave, bhikkhūnaṃ pāṭikaṅkhā, no parihānī’’ti [dī. ni. 2.138]. Sattamaṃ.",
      "english": "Monks, I shall teach you seven conditions that prevent decline. Listen to it, and attend carefully in your minds.\n\nAnd what, monks, are these seven conditions that prevent decline?\n\nFor as long as, monks, the monks cultivate the perception of impermanence; growth alone is to be expected for the monks, not decline. For as long as, monks, the monks cultivate the perception of non-self; growth alone is to be expected for the monks, not decline. For as long as, monks, the monks cultivate the perception of unsightliness; growth alone is to be expected for the monks, not decline. For as long as, monks, the monks cultivate the perception of danger; growth alone is to be expected for the monks, not decline. For as long as, monks, the monks cultivate the perception of abandoning; growth alone is to be expected for the monks, not decline. For as long as, monks, the monks cultivate the perception of dispassion; growth alone is to be expected for the monks, not decline. For as long as, monks, the monks cultivate the perception of cessation; growth alone is to be expected for the monks, not decline.\n\nFor as long as, monks, these seven conditions that prevent decline remain among the monks, and as long as the monks are seen practicing these seven conditions that prevent decline; growth alone is to be expected for the monks, not decline.",
      "sinhala": "භික්ෂූන් වහන්ස, ඔබට පිරිහීමට හේතු නොවන ධර්‍ම සතක් මම දේශනා කරන්නෙමි. ඒ සත් ධර්‍මයන්ට සවන් දෙන්න, හොඳින් මෙනෙහි කරන්න. භික්ෂූන් වහන්ස, පිරිහීමට හේතු නොවන ඒ ධර්‍ම සත කවරේද?\n\nභික්ෂූන් වහන්ස, යම්තාක් කල් භික්ෂූහු අනිත්‍ය සංඥාව වඩත්ද, භික්ෂූන්ට දියුණුවක්ම මිස පිරිහීමක් බලාපොරොත්තු විය නොහැක. භික්ෂූන් වහන්ස, යම්තාක් කල් භික්ෂූහු අනත්ත සංඥාව වඩත්ද, අසුභ සංඥාව වඩත්ද, ආදීනව සංඥාව වඩත්ද, ප්‍රහාණ සංඥාව වඩත්ද, විරාග සංඥාව වඩත්ද, නිරෝධ සංඥාව වඩත්ද, භික්ෂූන්ට දියුණුවක්ම මිස පිරිහීමක් බලාපොරොත්තු විය නොහැක.\n\nභික්ෂූන් වහන්ස, යම්තාක් කල් මේ පිරිහීමට හේතු නොවන ධර්‍ම සත භික්ෂූන් අතර පිහිටා තිබේද, යම්තාක් කල් භික්ෂූහු මේ පිරිහීමට හේතු නොවන ධර්‍ම සතෙහි යුක්තව ක්‍රියා කෙරෙත්ද, භික්ෂූන්ට දියුණුවක්ම මිස පිරිහීමක් බලාපොරොත්තු විය නොහැක.",
      "paliTitle": "Saññāsuttaṃ",
      "englishTitle": "The Discourse on Perception",
      "sinhalaTitle": "සඤ්ඤා සූත්‍රය"
    },
    {
      "number": 28,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘sattime, bhikkhave, dhammā sekhassa bhikkhuno parihānāya saṃvattanti. Katame satta? Kammārāmatā, bhassārāmatā, niddārāmatā, saṅgaṇikārāmatā, indriyesu aguttadvāratā, bhojane amattaññutā, santi kho pana saṅghe saṅghakaraṇīyāni; tatra sekho bhikkhu [tatra bhikkhu (sī. syā.)] iti paṭisañcikkhati – ‘santi kho pana saṅghe therā [kho saṃghattherā (ka.)] rattaññū cirapabbajitā bhāravāhino, te [na te (ka.)] tena paññāyissantī’ti attanā tesu yogaṃ [attanā voyogaṃ (sī. syā.)] āpajjati. Ime kho, bhikkhave, satta dhammā sekhassa bhikkhuno parihānāya saṃvattanti. ‘‘Sattime, bhikkhave, dhammā sekhassa bhikkhuno aparihānāya saṃvattanti. Katame satta? Na kammārāmatā, na bhassārāmatā, na niddārāmatā, na saṅgaṇikārāmatā, indriyesu guttadvāratā, bhojane mattaññutā, santi kho pana saṅghe saṅghakaraṇīyāni; tatra sekho bhikkhu iti paṭisañcikkhati – ‘santi kho pana saṅghe therā rattaññū cirapabbajitā bhāravāhino, te tena paññāyissantī’ti attanā na tesu yogaṃ āpajjati. Ime kho, bhikkhave, satta dhammā sekhassa bhikkhuno aparihānāya saṃvattantī’’ti. Aṭṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's monastery. There the Blessed One addressed the monks, saying: \"Monks, there are these seven things that lead to the decline of a monk in training. Which seven? Delight in activity, delight in idle talk, delight in sleep, delight in company, unguardedness of the sense doors, immoderation in food; and furthermore, when there are duties to be done for the Saṅgha, a monk in training reflects thus: 'There are elder monks in the Saṅgha, long-standing, long-ordained, bearing responsibility; they will know what needs to be done.' And he himself then relies on them for these tasks. Monks, these are the seven things that lead to the decline of a monk in training.\n\n\"Monks, there are these seven things that lead to the non-decline of a monk in training. Which seven? Not delighting in activity, not delighting in idle talk, not delighting in sleep, not delighting in company, guardedness of the sense doors, moderation in food; and furthermore, when there are duties to be done for the Saṅgha, a monk in training reflects thus: 'There are elder monks in the Saṅgha, long-standing, long-ordained, bearing responsibility; they will know what needs to be done.' Yet he himself does not rely on them for these tasks. Monks, these are the seven things that lead to the non-decline of a monk in training.\"",
      "sinhala": "මෙසේ මා විසින් අසන ලදී – එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනාථපිණ්ඩික සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: ‘‘මහණෙනි, මේ ධර්ම සතක් ශෛක්ෂ භික්ෂුවකට පිරිහීම පිණිස පවතී. කවරේද ඒ සත? කටයුතුවලට ඇලීම, කතාබහට ඇලීම, නින්දට ඇලීම, සමූහ වශයෙන් ඇසුරු කිරීමට ඇලීම, ඉන්ද්‍රිය දොරටු අරක් නොගත් බව, භෝජනයෙහි පමණ නොදැනීම, එසේම සංඝයා අතර සංඝ කටයුතු පවතී; එහිදී ශෛක්ෂ භික්ෂුව ‘සංඝයා අතර බොහෝ කලක් පැවිදි වූ, රාත්‍රීන් දැනගත යුතු දෑ දැනගත්, බර දරාගත් ථේරවරු සිටිති; ඔවුහු ඒ කටයුතු කරනු ඇතැයි’ සිතා, තමා ඒවාට සම්බන්ධ වීමෙන් වෙන් වේ. මහණෙනි, මේ ධර්ම සත ශෛක්ෂ භික්ෂුවකට පිරිහීම පිණිස පවතී.\n\n‘‘මහණෙනි, මේ ධර්ම සතක් ශෛක්ෂ භික්ෂුවකට නොපිරිහීම පිණිස පවතී. කවරේද ඒ සත? කටයුතුවලට නොඇලීම, කතාබහට නොඇලීම, නින්දට නොඇලීම, සමූහ වශයෙන් ඇසුරු කිරීමට නොඇලීම, ඉන්ද්‍රිය දොරටු අරක්ගත් බව, භෝජනයෙහි පමණ දැනීම, එසේම සංඝයා අතර සංඝ කටයුතු පවතී; එහිදී ශෛක්ෂ භික්ෂුව ‘සංඝයා අතර බොහෝ කලක් පැවිදි වූ, රාත්‍රීන් දැනගත යුතු දෑ දැනගත්, බර දරාගත් ථේරවරු සිටිති; ඔවුහු ඒ කටයුතු කරනු ඇතැයි’ සිතා, තමා ඒවාට සම්බන්ධ වීමෙන් වෙන් නොවේ. මහණෙනි, මේ ධර්ම සත ශෛක්ෂ භික්ෂුවකට නොපිරිහීම පිණිස පවතී.’’\nඅටවෙනි සූත්‍රයයි.",
      "paliTitle": "Paṭhamaparihānisuttaṃ",
      "englishTitle": "The First Discourse on Decline",
      "sinhalaTitle": "පළමු පරිහානි සූත්‍රය"
    },
    {
      "number": 29,
      "pali": "‘‘Sattime, bhikkhave, dhammā upāsakassa parihānāya saṃvattanti. Katame satta? Bhikkhudassanaṃ hāpeti, saddhammassavanaṃ pamajjati, adhisīle na sikkhati, appasādabahulo hoti, bhikkhūsu theresu ceva navesu ca majjhimesu ca upārambhacitto dhammaṃ suṇāti randhagavesī, ito bahiddhā dakkhiṇeyyaṃ gavesati, tattha ca pubbakāraṃ karoti. Ime kho, bhikkhave, satta dhammā upāsakassa parihānāya saṃvattanti. ‘‘Sattime, bhikkhave, dhammā upāsakassa aparihānāya saṃvattanti. Katame satta? Bhikkhudassanaṃ na hāpeti, saddhammassavanaṃ nappamajjati, adhisīle sikkhati, pasādabahulo hoti, bhikkhūsu theresu ceva navesu ca majjhimesu ca anupārambhacitto dhammaṃ suṇāti na randhagavesī, na ito bahiddhā dakkhiṇeyyaṃ gavesati, idha ca pubbakāraṃ karoti. Ime kho, bhikkhave, satta dhammā upāsakassa aparihānāya saṃvattantī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Dassanaṃ bhāvitattānaṃ, yo hāpeti upāsako; Savanañca ariyadhammānaṃ, adhisīle na sikkhati. ‘‘Appasādo ca bhikkhūsu, bhiyyo bhiyyo pavaḍḍhati; Upārambhakacitto ca, saddhammaṃ sotumicchati. ‘‘Ito ca bahiddhā aññaṃ, dakkhiṇeyyaṃ gavesati; Tattheva ca pubbakāraṃ, yo karoti upāsako. ‘‘Ete kho parihāniye, satta dhamme sudesite; Upāsako sevamāno, saddhammā parihāyati. ‘‘Dassanaṃ bhāvitattānaṃ, yo na hāpeti upāsako; Savanañca ariyadhammānaṃ, adhisīle ca sikkhati. ‘‘Pasādo cassa bhikkhūsu, bhiyyo bhiyyo pavaḍḍhati; Anupārambhacitto ca, saddhammaṃ sotumicchati. ‘‘Na ito bahiddhā aññaṃ, dakkhiṇeyyaṃ gavesati; Idheva ca pubbakāraṃ, yo karoti upāsako. ‘‘Ete kho aparihāniye, satta dhamme sudesite; Upāsako sevamāno, saddhammā na parihāyatī’’ti. navamaṃ;",
      "english": "Monks, these seven things lead to a lay follower’s decline. What are these seven? A lay follower neglects seeing monks, is heedless regarding listening to the True Dhamma, does not train in the higher morality, is largely lacking in confidence, listens to the Dhamma with a mind intent on finding fault, seeking shortcomings in monks—whether they are elders, new monks, or middle-ranking monks; seeks worthy recipients of offerings outside this teaching and to them makes prior offerings. Indeed, monks, these seven things lead to a lay follower’s decline.\n\nMonks, these seven things lead to a lay follower’s non-decline. What are these seven? A lay follower does not neglect seeing monks, is not heedless regarding listening to the True Dhamma, trains in the higher morality, is largely full of confidence, listens to the Dhamma with a mind not intent on finding fault, not seeking shortcomings in monks—whether they are elders, new monks, or middle-ranking monks; does not seek worthy recipients of offerings outside this teaching and here makes prior offerings. Indeed, monks, these seven things lead to a lay follower’s non-decline. The Blessed One said this. Having said this, the Fortunate One, the Teacher, further said this:\n\nThe lay follower who neglects seeing those whose minds are cultivated,\nAnd listening to the noble Dhamma, and does not train in the higher morality;\nAnd whose lack of confidence in monks ever more increases;\nAnd who desires to listen to the True Dhamma with a mind intent on finding fault;\nAnd who seeks other worthy recipients of offerings outside of this teaching;\nAnd there, that lay follower makes prior offerings.\nIndeed, these seven factors of decline, well-expounded,\nThe lay follower who practices them declines from the True Dhamma.\n\nThe lay follower who does not neglect seeing those whose minds are cultivated,\nAnd listening to the noble Dhamma, and trains in the higher morality;\nAnd whose confidence in monks ever more increases;\nAnd who desires to listen to the True Dhamma with a mind not intent on finding fault;\nAnd who does not seek other worthy recipients of offerings outside of this teaching;\nAnd here, that lay follower makes prior offerings.\nIndeed, these seven factors of non-decline, well-expounded,\nThe lay follower who practices them does not decline from the True Dhamma.",
      "sinhala": "භික්ෂූණි, මේ ධර්ම සතක් උපාසකයකුගේ පිරිහීමට පවතී. ඒ සත කවරේද? භික්ෂූන් වහන්සේලා බැහැදැකීම අත්හරියි. සද්ධර්ම ශ්‍රවණයෙහි ප්‍රමාද වෙයි. අධිශීලයෙහි නොහික්මෙයි. අප්‍රසාද බහුල වෙයි. මහලු, නවක සහ මැද හිමිවරුන් වන භික්ෂූන් වහන්සේලා කෙරෙහි දෝෂාරෝපණ සිත් ඇතිව, අඩුපාඩු සොයමින් ධර්මය ශ්‍රවණය කරයි. මේ ශාසනයෙන් බැහැර දක්ෂිණාර්හයන් සොයයි, එහිම පුණ්‍ය කටයුතු ප්‍රථමයෙන් කරයි. භික්ෂූණි, මේ ධර්ම සත උපාසකයකුගේ පිරිහීම සඳහා පවතී.\n\nභික්ෂූණි, මේ ධර්ම සතක් උපාසකයකුගේ නොපිරිහීමට පවතී. ඒ සත කවරේද? භික්ෂූන් වහන්සේලා බැහැදැකීම අත් නොහරියි. සද්ධර්ම ශ්‍රවණයෙහි ප්‍රමාද නොවෙයි. අධිශීලයෙහි හික්මෙයි. ප්‍රසාද බහුල වෙයි. මහලු, නවක සහ මැද හිමිවරුන් වන භික්ෂූන් වහන්සේලා කෙරෙහි දෝෂාරෝපණ සිත් නැතිව, අඩුපාඩු නොසොයමින් ධර්මය ශ්‍රවණය කරයි. මේ ශාසනයෙන් බැහැර දක්ෂිණාර්හයන් නොසොයයි, මෙහිම පුණ්‍ය කටයුතු ප්‍රථමයෙන් කරයි. භික්ෂූණි, මේ ධර්ම සත උපාසකයකුගේ නොපිරිහීම සඳහා පවතී. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාළ සුගත වූ ශාස්තෘන් වහන්සේ තවදුරටත් මෙයද වදාළ සේක:\n\nභාවනා කළ සිත් ඇතිවූවන් බැහැදැකීම යම් උපාසකයෙක් අත්හරියි ද, ආර්ය ධර්ම ශ්‍රවණයද අත්හරියි, අධිශීලයෙහි නොහික්මෙයි.\n\nභික්ෂූන් වහන්සේලා කෙරෙහි අප්‍රසාදයද වැඩියෙන් වැඩියෙන් වර්ධනය වෙයි. දෝෂාරෝපණ සිත් ඇතිව සද්ධර්මය ඇසීමට කැමති වෙයි.\n\nමේ ශාසනයෙන් බැහැර වෙනත් දක්ෂිණාර්හයන් සොයයි. එහිම ප්‍රථමයෙන් පුණ්‍ය කටයුතු කරන්නේ යම් උපාසකයෙක් ද,\n\nමනාව දේශනා කරන ලද පිරිහීමට හේතුවන මේ ධර්ම සත අනුගමනය කරන්නා වූ උපාසකයා සද්ධර්මයෙන් පිරිහෙයි.\n\nභාවනා කළ සිත් ඇතිවූවන් බැහැදැකීම යම් උපාසකයෙක් අත් නොහරියි ද, ආර්ය ධර්ම ශ්‍රවණයද අත් නොහරියි, අධිශීලයෙහිද හික්මෙයි.\n\nභික්ෂූන් වහන්සේලා කෙරෙහි ඔහුගේ ප්‍රසාදයද වැඩියෙන් වැඩියෙන් වර්ධනය වෙයි. දෝෂාරෝපණ සිත් නැතිව සද්ධර්මය ඇසීමට කැමති වෙයි.\n\nමේ ශාසනයෙන් බැහැර වෙනත් දක්ෂිණාර්හයන් නොසොයයි. මෙහිම ප්‍රථමයෙන් පුණ්‍ය කටයුතු කරන්නේ යම් උපාසකයෙක් ද,\n\nමනාව දේශනා කරන ලද නොපිරිහීමට හේතුවන මේ ධර්ම සත අනුගමනය කරන්නා වූ උපාසකයා සද්ධර්මයෙන් නොපිරිහෙයි.",
      "paliTitle": "Dutiyaparihānisuttaṃ",
      "englishTitle": "Second Sutta on Decline",
      "sinhalaTitle": "දුතිය පරිහානි සූත්‍රය"
    },
    {
      "number": 30,
      "pali": "Sattimā, bhikkhave, upāsakassa vipattiyo…pe… sattimā, bhikkhave, upāsakassa sampadā… pe…. Dasamaṃ.",
      "english": "Monks, these are the seven downfalls of a lay follower, and so on; and these are the seven accomplishments of a lay follower, and so on. The Tenth.",
      "sinhala": "මහණෙනි, උපාසකයාගේ මේ විපත්ති සතක් ඇත. මහණෙනි, උපාසකයාගේ මේ සම්පදා සතක් ඇත. දසවැනි සූත්‍රයයි.",
      "paliTitle": "Vipattisuttaṃ",
      "englishTitle": "The Discourse on Failure",
      "sinhalaTitle": "විපත්ති සූත්‍රය"
    },
    {
      "number": 31,
      "pali": "‘‘Sattime, bhikkhave, upāsakassa parābhavā…pe… sattime, bhikkhave, upāsakassa sambhavā. Katame satta? Bhikkhudassanaṃ na hāpeti, saddhammassavanaṃ nappamajjati, adhisīle sikkhati, pasādabahulo hoti, bhikkhūsu theresu ceva navesu ca majjhimesu ca anupārambhacitto dhammaṃ suṇāti na randhagavesī, na ito bahiddhā dakkhiṇeyyaṃ gavesati, idha ca pubbakāraṃ karoti. Ime kho, bhikkhave, satta upāsakassa sambhavāti. ‘‘Dassanaṃ bhāvitattānaṃ, yo hāpeti upāsako; Savanañca ariyadhammānaṃ, adhisīle na sikkhati. ‘‘Appasādo ca bhikkhūsu, bhiyyo bhiyyo pavaḍḍhati; Upārambhakacitto ca, saddhammaṃ sotumicchati. ‘‘Ito ca bahiddhā aññaṃ, dakkhiṇeyyaṃ gavesati; Tattheva ca pubbakāraṃ, yo karoti upāsako. ‘‘Ete kho parihāniye, satta dhamme sudesite; Upāsako sevamāno, saddhammā parihāyati. ‘‘Dassanaṃ bhāvitattānaṃ, yo na hāpeti upāsako; Savanañca ariyadhammānaṃ, adhisīle ca sikkhati. ‘‘Pasādo cassa bhikkhūsu, bhiyyo bhiyyo pavaḍḍhati; Anupārambhacitto ca, saddhammaṃ sotumicchati. ‘‘Na ito bahiddhā aññaṃ, dakkhiṇeyyaṃ gavesati; Idheva ca pubbakāraṃ, yo karoti upāsako. ‘‘Ete kho aparihāniye, satta dhamme sudesite; Upāsako sevamāno, saddhammā na parihāyatī’’ti. ekādasamaṃ; ",
      "english": "Monks, there are these seven causes of a lay follower's progress. Which seven?\n\nHe does not neglect seeing monks; he is not heedless in listening to the true Dhamma; he trains in higher morality; he is abounding in serene faith; he listens to the Dhamma with a mind free from fault-finding towards monks—both elders, new monastics, and those in between—not seeking their flaws; he does not seek objects worthy of offerings outside this dispensation; and he makes his primary offering here within this dispensation.\n\nThe lay follower who neglects seeing those with cultivated minds, and listening to the Noble Dhamma, and does not train in higher morality;\n\nAnd whose lack of serene faith in monks increasingly grows, and who desires to listen to the true Dhamma with a fault-finding mind;\n\nAnd who seeks other objects worthy of offerings outside this dispensation, and makes his primary offering there;\n\nThese, indeed, are the seven qualities of decline, well-expounded; a lay follower who cultivates them falls away from the true Dhamma.\n\nThe lay follower who does not neglect seeing those with cultivated minds, and listening to the Noble Dhamma, and trains in higher morality;\n\nAnd whose serene faith in monks increasingly grows, and who desires to listen to the true Dhamma with a mind free from fault-finding;\n\nAnd who does not seek other objects worthy of offerings outside this dispensation, and makes his primary offering right here;\n\nThese, indeed, are the seven qualities of progress, well-expounded; a lay follower who cultivates them does not fall away from the true Dhamma.",
      "sinhala": "මහණෙනි, ගිහි උපාසකයාගේ පිරිහීමට කරුණු සතක් ඇත...පෙ... මහණෙනි, ගිහි උපාසකයාගේ දියුණුවට කරුණු සතක් ඇත. ඒ සත කවරේද? භාවිතාත්මයන්වූ භික්ෂූන් දැකීම අත්නොහරියි. සද්ධ‍ර්මය ශ‍්‍රවණය කිරීමෙහි නොපමාවෙයි. අධිශීලයෙහි පුහුණු වෙයි. බොහෝ ප‍්‍රසාදයෙන් යුක්ත වෙයි. මහළු, අලුත් හා මධ්‍යම භික්ෂූන් කෙරෙහි චෝදනා නොකරන සිතින්, දොස් සොයන්නෙක් නොවී, ධ‍ර්මය ශ‍්‍රවණය කරයි. මෙයින් පිටත අන් දක්ෂිණාවට සුදුස්සන් නොසොයයි. මෙහිම පළමුවෙන් පින් කරයි. මහණෙනි, උපාසකයාගේ දියුණුවට කරුණු සතක් නම් මේවාය.\n\nයම් උපාසකයෙක්, භාවිතාත්මයන්වූ අරහතුන් වහන්සේලා දැකීම අත්හරින්නේද, ආර්ය ධ‍ර්මය ශ‍්‍රවණය නොකරයිද, අධිශීලයෙහි නොපුහුණු වෙයිද;\n\nභික්ෂූන් කෙරෙහි අප‍්‍රසාදයද වඩ වඩාත් වැඩෙයිද, චෝදනා කරන සිතින් සද්ධ‍ර්මය ශ‍්‍රවණය කිරීමට කැමති වෙයිද;\n\nමෙයින් පිටත අන් දක්ෂිණාවට සුදුස්සන් සොයයිද, එහිම පළමුවෙන් පින් කරයිද;\n\nමෙසේ මනාකොට දේශනා කරන ලද පිරිහීමට හේතුවන මේ ධ‍ර්ම සත සේවනය කරන උපාසකයා සද්ධ‍ර්මයෙන් පිරිහෙයි.\n\nයම් උපාසකයෙක්, භාවිතාත්මයන්වූ අරහතුන් වහන්සේලා දැකීම අත්නොහරින්නේද, ආර්ය ධ‍ර්මය ශ‍්‍රවණය කරයිද, අධිශීලයෙහි පුහුණු වෙයිද;\n\nභික්ෂූන් කෙරෙහි ඔහුගේ ප‍්‍රසාදයද වඩ වඩාත් වැඩෙයිද, චෝදනා නොකරන සිතින් සද්ධ‍ර්මය ශ‍්‍රවණය කිරීමට කැමති වෙයිද;\n\nමෙයින් පිටත අන් දක්ෂිණාවට සුදුස්සන් නොසොයයිද, මෙහිම පළමුවෙන් පින් කරයිද;\n\nමෙසේ මනාකොට දේශනා කරන ලද නොපිරිහීමට හේතුවන මේ ධ‍ර්ම සත සේවනය කරන උපාසකයා සද්ධ‍ර්මයෙන් නොපිරිහෙයි.",
      "paliTitle": "Parābhavasuttaṃ",
      "englishTitle": "The Discourse on Downfall",
      "sinhalaTitle": "පරාභව සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Vajjisattakavaggo [vajjivaggo (syā.)] tatiyo. Tassuddānaṃ – Sāranda -vassakāro ca, tisattakāni bhikkhukā; Bodhisaññā dve ca hāni, vipatti ca parābhavoti.",
    "english": "The third chapter on the Seven Vajjian Conditions. The summary of it: Sāranda, Vassakāra, and three sets of seven for the Monks; Awareness of Awakening, two on Decline, Failure, and Ruin.",
    "sinhala": "තෙවන වජ්ජිසත්තක වර්ගයයි. එහි උද්දානය නම්: සාරන්ද, වස්සකාර, භික්ෂු සප්තක තුනක්, බෝධිසඤ්ඤා, හානි දෙකක්, විපත්ති සහ පරාභව සූත්‍රයි."
  }
}