{
  "id": "an7.7",
  "title": {
    "pali": "Mahāvaggo",
    "english": "The Great Chapter",
    "sinhala": "මහාවග්ගය"
  },
  "sections": [
    {
      "number": 65,
      "pali": "[a. ni. 5.24, 168; 2.6.50] ‘‘Hirottappe, bhikkhave, asati hirottappavipannassa hatūpaniso hoti indriyasaṃvaro; indriyasaṃvare asati indriyasaṃvaravipannassa hatūpanisaṃ hoti sīlaṃ; sīle asati sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi pheggupi sāropi na pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, hirottappe asati hirottappavipannassa hatūpaniso hoti indriyasaṃvaro; indriyasaṃvare asati indriyasaṃvaravipannassa hatūpanisaṃ hoti sīlaṃ; sīle asati sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Hirottappe, bhikkhave, sati hirottappasampannassa upanisasampanno hoti indriyasaṃvaro; indriyasaṃvare sati indriyasaṃvarasampannassa upanisasampannaṃ hoti sīlaṃ; sīle sati sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi pheggupi sāropi pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, hirottappe sati hirottappasampannassa upanisasampanno hoti… pe… vimuttiñāṇadassana’’nti. Paṭhamaṃ.",
      "english": "Monks, when moral shame and moral dread are absent, for one who is bereft of moral shame and moral dread, the foundation for the restraint of the senses is ruined. When restraint of the senses is absent, for one who is bereft of restraint of the senses, the foundation for moral conduct is ruined. When moral conduct is absent, for one who is bereft of moral conduct, the foundation for right concentration is ruined. When right concentration is absent, for one who is bereft of right concentration, the foundation for knowledge and vision of things as they truly are is ruined. When knowledge and vision of things as they truly are is absent, for one who is bereft of knowledge and vision of things as they truly are, the foundation for disenchantment and dispassion is ruined. When disenchantment and dispassion are absent, for one who is bereft of disenchantment and dispassion, the foundation for knowledge and vision of liberation is ruined. Monks, just as a tree is bereft of branches and foliage, its outer bark does not reach full development, nor do its inner bark, sapwood, or heartwood reach full development. Even so, Monks, when moral shame and moral dread are absent, for one who is bereft of moral shame and moral dread, the foundation for the restraint of the senses is ruined; when restraint of the senses is absent, for one who is bereft of restraint of the senses, the foundation for moral conduct is ruined; when moral conduct is absent, for one who is bereft of moral conduct, the foundation for right concentration is ruined; when right concentration is absent, for one who is bereft of right concentration, the foundation for knowledge and vision of things as they truly are is ruined; when knowledge and vision of things as they truly are is absent, for one who is bereft of knowledge and vision of things as they truly are, the foundation for disenchantment and dispassion is ruined; when disenchantment and dispassion are absent, for one who is bereft of disenchantment and dispassion, the foundation for knowledge and vision of liberation is ruined.\n\nMonks, when moral shame and moral dread are present, for one who is endowed with moral shame and moral dread, the restraint of the senses has a complete foundation. When restraint of the senses is present, for one who is endowed with restraint of the senses, moral conduct has a complete foundation. When moral conduct is present, for one who is endowed with moral conduct, right concentration has a complete foundation. When right concentration is present, for one who is endowed with right concentration, knowledge and vision of things as they truly are has a complete foundation. When knowledge and vision of things as they truly are is present, for one who is endowed with knowledge and vision of things as they truly are, disenchantment and dispassion have a complete foundation. When disenchantment and dispassion are present, for one who is endowed with disenchantment and dispassion, knowledge and vision of liberation has a complete foundation. Monks, just as a tree is endowed with branches and foliage, its outer bark reaches full development, and so do its inner bark, sapwood, and heartwood reach full development. Even so, Monks, when moral shame and moral dread are present, for one who is endowed with moral shame and moral dread, the restraint of the senses has a complete foundation; when restraint of the senses is present, for one who is endowed with restraint of the senses, moral conduct has a complete foundation; when moral conduct is present, for one who is endowed with moral conduct, right concentration has a complete foundation; when right concentration is present, for one who is endowed with right concentration, knowledge and vision of things as they truly are has a complete foundation; when knowledge and vision of things as they truly are is present, for one who is endowed with knowledge and vision of things as they truly are, disenchantment and dispassion have a complete foundation; when disenchantment and dispassion are present, for one who is endowed with disenchantment and dispassion, knowledge and vision of liberation has a complete foundation.",
      "sinhala": "භික්‍ෂූනි, හිරි ඔතප් නොමැති කල්හි, හිරි ඔතප් නැති තැනැත්තාට ඉන්‍ද්‍රිය සංවරයෙහි උපනිශ්‍රය නැති වී යයි. ඉන්‍ද්‍රිය සංවරය නොමැති කල්හි, ඉන්‍ද්‍රිය සංවරය නැති තැනැත්තාට ශීලයෙහි උපනිශ්‍රය නැති වී යයි. ශීලය නොමැති කල්හි, ශීලය නැති තැනැත්තාට සම්මා සමාධියෙහි උපනිශ්‍රය නැති වී යයි. සම්මා සමාධිය නොමැති කල්හි, සම්මා සමාධිය නැති තැනැත්තාට යථාභූත ඥාන දර්ශනයෙහි උපනිශ්‍රය නැති වී යයි. යථාභූත ඥාන දර්ශනය නොමැති කල්හි, යථාභූත ඥාන දර්ශනය නැති තැනැත්තාට නිබ්බිදා විරාගයෙහි උපනිශ්‍රය නැති වී යයි. නිබ්බිදා විරාගය නොමැති කල්හි, නිබ්බිදා විරාගය නැති තැනැත්තාට විමුක්ති ඥාන දර්ශනයෙහි උපනිශ්‍රය නැති වී යයි. භික්‍ෂූනි, යම් සේ ගසක් අතු කොළ නැති වුවහොත්, එහි පොත්ත ද, ලෙල්ල ද, පොතු සාරය ද, සාරය ද සම්පූර්ණත්වයට නොපැමිණෙයි. භික්‍ෂූනි, එපරිද්දෙන්ම, හිරි ඔතප් නොමැති කල්හි, හිරි ඔතප් නැති තැනැත්තාට ඉන්‍ද්‍රිය සංවරයෙහි උපනිශ්‍රය නැති වී යයි. ඉන්‍ද්‍රිය සංවරය නොමැති කල්හි, ඉන්‍ද්‍රිය සංවරය නැති තැනැත්තාට ශීලයෙහි උපනිශ්‍රය නැති වී යයි. ශීලය නොමැති කල්හි, ශීලය නැති තැනැත්තාට සම්මා සමාධියෙහි උපනිශ්‍රය නැති වී යයි. සම්මා සමාධිය නොමැති කල්හි, සම්මා සමාධිය නැති තැනැත්තාට යථාභූත ඥාන දර්ශනයෙහි උපනිශ්‍රය නැති වී යයි. යථාභූත ඥාන දර්ශනය නොමැති කල්හි, යථාභූත ඥාන දර්ශනය නැති තැනැත්තාට නිබ්බිදා විරාගයෙහි උපනිශ්‍රය නැති වී යයි. නිබ්බිදා විරාගය නොමැති කල්හි, නිබ්බිදා විරාගය නැති තැනැත්තාට විමුක්ති ඥාන දර්ශනයෙහි උපනිශ්‍රය නැති වී යයි.\n\nභික්‍ෂූනි, හිරි ඔතප් ඇති කල්හි, හිරි ඔතප් සහිත තැනැත්තාට ඉන්‍ද්‍රිය සංවරයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. ඉන්‍ද්‍රිය සංවරය ඇති කල්හි, ඉන්‍ද්‍රිය සංවරය සහිත තැනැත්තාට ශීලයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. ශීලය ඇති කල්හි, ශීලය සහිත තැනැත්තාට සම්මා සමාධියෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. සම්මා සමාධිය ඇති කල්හි, සම්මා සමාධිය සහිත තැනැත්තාට යථාභූත ඥාන දර්ශනයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. යථාභූත ඥාන දර්ශනය ඇති කල්හි, යථාභූත ඥාන දර්ශනය සහිත තැනැත්තාට නිබ්බිදා විරාගයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගය සහිත තැනැත්තාට විමුක්ති ඥාන දර්ශනයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. භික්‍ෂූනි, යම් සේ ගසක් අතු කොළ සහිත වුවහොත්, එහි පොත්ත ද, ලෙල්ල ද, පොතු සාරය ද, සාරය ද සම්පූර්ණත්වයට පැමිණෙයි. භික්‍ෂූනි, එපරිද්දෙන්ම, හිරි ඔතප් ඇති කල්හි, හිරි ඔතප් සහිත තැනැත්තාට ඉන්‍ද්‍රිය සංවරයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. ඉන්‍ද්‍රිය සංවරය ඇති කල්හි, ඉන්‍ද්‍රිය සංවරය සහිත තැනැත්තාට ශීලයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. ශීලය ඇති කල්හි, ශීලය සහිත තැනැත්තාට සම්මා සමාධියෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. සම්මා සමාධිය ඇති කල්හි, සම්මා සමාධිය සහිත තැනැත්තාට යථාභූත ඥාන දර්ශනයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. යථාභූත ඥාන දර්ශනය ඇති කල්හි, යථාභූත ඥාන දර්ශනය සහිත තැනැත්තාට නිබ්බිදා විරාගයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි. නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගය සහිත තැනැත්තාට විමුක්ති ඥාන දර්ශනයෙහි උපනිශ්‍රය සම්පූර්ණ වෙයි.",
      "paliTitle": "Hirīottappasuttaṃ",
      "englishTitle": "Shame and Fear of Wrongdoing Sutta",
      "sinhalaTitle": "හිරීඔත්තප්ප සූත්‍රය"
    },
    {
      "number": 66,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati ambapālivane. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Aniccā, bhikkhave, saṅkhārā; adhuvā, bhikkhave, saṅkhārā; anassāsikā, bhikkhave, saṅkhārā. Yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ alaṃ virajjituṃ alaṃ vimuccituṃ. ‘‘Sineru, bhikkhave, pabbatarājā caturāsītiyojanasahassāni āyāmena, caturāsītiyojanasahassāni vitthārena, caturāsītiyojanasahassāni mahāsamudde ajjhogāḷho, caturāsītiyojanasahassāni mahāsamuddā accuggato. Hoti kho so, bhikkhave, samayo yaṃ kadāci karahaci dīghassa addhuno accayena bahūni vassāni bahūni vassasatāni bahūni vassasahassāni bahūni vassasatasahassāni devo na vassati. Deve kho pana, bhikkhave, avassante ye kecime bījagāmabhūtagāmā osadhitiṇavanappatayo te ussussanti visussanti, na bhavanti. Evaṃ aniccā, bhikkhave, saṅkhārā; evaṃ adhuvā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Hoti kho so, bhikkhave, samayo yaṃ kadāci karahaci dīghassa addhuno accayena dutiyo sūriyo pātubhavati. Dutiyassa, bhikkhave, sūriyassa pātubhāvā yā kāci kunnadiyo kusobbhā [kussubbho (sī.), kussobbhā (syā.)] tā ussussanti visussanti, na bhavanti. Evaṃ aniccā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Hoti kho so, bhikkhave, samayo yaṃ kadāci karahaci dīghassa addhuno accayena tatiyo sūriyo pātubhavati. Tatiyassa, bhikkhave, sūriyassa pātubhāvā yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā ussussanti visussanti, na bhavanti. Evaṃ aniccā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Hoti kho so, bhikkhave, samayo yaṃ kadāci karahaci dīghassa addhuno accayena catuttho sūriyo pātubhavati. Catutthassa, bhikkhave, sūriyassa pātubhāvā ye te mahāsarā yato imā mahānadiyo pavattanti, seyyathidaṃ – anotattā, sīhapapātā, rathakārā, kaṇṇamuṇḍā, kuṇālā, chaddantā, mandākiniyā, tā ussussanti visussanti, na bhavanti. Evaṃ aniccā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Hoti kho so, bhikkhave, samayo yaṃ kadāci karahaci dīghassa addhuno accayena pañcamo sūriyo pātubhavati. Pañcamassa, bhikkhave, sūriyassa pātubhāvā yojanasatikānipi mahāsamudde udakāni ogacchanti, dviyojanasatikānipi mahāsamudde udakāni ogacchanti, tiyojanasatikānipi, catuyojanasatikānipi, pañcayojanasatikānipi, chayojanasatikānipi, sattayojanasatikānipi mahāsamudde udakāni ogacchanti; sattatālampi mahāsamudde udakaṃ saṇṭhāti, chatālampi, pañcatālampi, catutālampi, titālampi, dvitālampi, tālamattampi mahāsamudde udakaṃ saṇṭhāti; sattaporisampi mahāsamudde udakaṃ saṇṭhāti, chaporisampi, pañcaporisampi, catuporisampi, tiporisampi, dviporisampi, porisampi [porisamattampi (syā.)], aḍḍhaporisampi, kaṭimattampi, jaṇṇukāmattampi, gopphakamattampi mahāsamudde udakaṃ saṇṭhāti. Seyyathāpi, bhikkhave, saradasamaye thullaphusitake deve vassante tattha tattha gopadesu [gopphakapadesesu (ka.)] udakāni ṭhitāni honti; evamevaṃ kho, bhikkhave, tattha tattha gopphakamattāni [gopadamattāni (sī. syā.)] mahāsamudde udakāni ṭhitāni honti. Pañcamassa, bhikkhave, sūriyassa pātubhāvā aṅgulipabbamattampi mahāsamudde udakaṃ na hoti. Evaṃ aniccā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Hoti kho so, bhikkhave, samayo yaṃ kadāci karahaci dīghassa addhuno accayena chaṭṭho sūriyo pātubhavati. Chaṭṭhassa, bhikkhave, sūriyassa pātubhāvā ayañca mahāpathavī sineru ca pabbatarājā dhūmāyanti saṃdhūmāyanti sampadhūmāyanti [dhūpāyanti sandhūpāyanti sampadhūpāyanti (sī. syā.)]. Seyyathāpi, bhikkhave, kumbhakārapāko ālepito [ālimpito (sī. syā.)] paṭhamaṃ dhūmeti saṃdhūmeti sampadhūmeti; evamevaṃ kho, bhikkhave, chaṭṭhassa sūriyassa pātubhāvā ayañca mahāpathavī sineru ca pabbatarājā dhūmāyanti saṃdhūmāyanti sampadhūmāyanti. Evaṃ aniccā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Hoti kho so, bhikkhave, samayo yaṃ kadāci karahaci dīghassa addhuno accayena sattamo sūriyo pātubhavati. Sattamassa, bhikkhave, sūriyassa pātubhāvā ayañca mahāpathavī sineru ca pabbatarājā ādippanti pajjalanti ekajālā bhavanti. Imissā ca, bhikkhave, mahāpathaviyā sinerussa ca pabbatarājassa jhāyamānānaṃ dayhamānānaṃ acci vātena khittā yāva brahmalokāpi gacchati. Sinerussa, bhikkhave, pabbatarājassa jhāyamānassa dayhamānassa vinassamānassa mahatā tejokhandhena abhibhūtassa yojanasatikānipi kūṭāni palujjanti dviyojanasatikānipi, tiyojanasatikānipi, catuyojanasatikānipi, pañcayojanasatikānipi kūṭāni palujjanti. Imissā ca, bhikkhave, mahāpathaviyā sinerussa ca pabbatarājassa jhāyamānānaṃ dayhamānānaṃ neva chārikā paññāyati na masi. Seyyathāpi, bhikkhave, sappissa vā telassa vā jhāyamānassa dayhamānassa neva chārikā paññāyati na masi; evamevaṃ kho, bhikkhave, imissā ca mahāpathaviyā sinerussa ca pabbatarājassa jhāyamānānaṃ dayhamānānaṃ neva chārikā paññāyati na masi. Evaṃ aniccā, bhikkhave, saṅkhārā; evaṃ adhuvā, bhikkhave, saṅkhārā; evaṃ anassāsikā, bhikkhave, saṅkhārā. Yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ alaṃ virajjituṃ alaṃ vimuccituṃ. ‘‘Tatra, bhikkhave, ko mantā ko saddhātā – ‘ayañca pathavī sineru ca pabbatarājā dayhissanti vinassissanti, na bhavissantī’ti aññatra diṭṭhapadehi? [a. ni. 6.54; 7.73] ‘‘Bhūtapubbaṃ, bhikkhave, sunetto nāma satthā ahosi titthakaro kāmesu vītarāgo. Sunettassa kho pana, bhikkhave, satthuno anekāni sāvakasatāni ahesuṃ. Sunetto, bhikkhave, satthā sāvakānaṃ brahmalokasahabyatāya dhammaṃ desesi. Ye kho pana, bhikkhave, sunettassa satthuno brahmalokasahabyatāya dhammaṃ desentassa sabbena sabbaṃ sāsanaṃ ājāniṃsu te kāyassa bhedā paraṃ maraṇā sugatiṃ brahmalokaṃ upapajjiṃsu. Ye na sabbena sabbaṃ sāsanaṃ ājāniṃsu te kāyassa bhedā paraṃ maraṇā appekacce paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjiṃsu, appekacce nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjiṃsu, appekacce tusitānaṃ devānaṃ sahabyataṃ upapajjiṃsu, appekacce yāmānaṃ devānaṃ sahabyataṃ upapajjiṃsu, appekacce tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjiṃsu, appekacce cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjiṃsu, appekacce khattiyamahāsālānaṃ sahabyataṃ upapajjiṃsu, appekacce brāhmaṇamahāsālānaṃ sahabyataṃ upapajjiṃsu, appekacce gahapatimahāsālānaṃ sahabyataṃ upapajjiṃsu. ‘‘Atha kho, bhikkhave, sunettassa satthuno etadahosi – ‘na kho metaṃ patirūpaṃ yohaṃ sāvakānaṃ samasamagatiyo assaṃ abhisamparāyaṃ, yaṃnūnāhaṃ uttari mettaṃ [uttari maggaṃ (ka.)] bhāveyya’’’nti. ‘‘Atha kho, bhikkhave, sunetto satthā satta vassāni mettaṃ cittaṃ bhāvesi. Satta vassāni mettaṃ cittaṃ bhāvetvā satta saṃvaṭṭavivaṭṭakappe nayimaṃ lokaṃ punarāgamāsi. Saṃvaṭṭamāne sudaṃ, bhikkhave, loke ābhassarūpago hoti. Vivaṭṭamāne loke suññaṃ brahmavimānaṃ upapajjati. Tatra sudaṃ, bhikkhave, brahmā hoti mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī. Chattiṃsakkhattuṃ kho pana, bhikkhave, sakko ahosi devānamindo. Anekasatakkhattuṃ rājā ahosi cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Parosahassaṃ kho panassa puttā ahesuṃ sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasi. So hi nāma, bhikkhave, sunetto satthā evaṃ dīghāyuko samāno evaṃ ciraṭṭhitiko aparimutto ahosi – ‘jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, aparimutto dukkhasmā’ti vadāmi’’. ‘‘Taṃ kissa hetu? Catunnaṃ dhammānaṃ ananubodhā appaṭivedhā. Katamesaṃ catunnaṃ? Ariyassa, bhikkhave, sīlassa ananubodhā appaṭivedhā, ariyassa samādhissa ananubodhā appaṭivedhā, ariyāya paññāya ananubodhā appaṭivedhā, ariyāya vimuttiyā ananubodhā appaṭivedhā. Tayidaṃ, bhikkhave, ariyaṃ sīlaṃ anubuddhaṃ paṭividdhaṃ, ariyo samādhi anubodho paṭividdho, ariyā paññā anubodhā paṭividdhā, ariyā vimutti anubodhā paṭividdhā, ucchinnā bhavataṇhā, khīṇā bhavanetti, natthi dāni punabbhavo’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Sīlaṃ samādhi paññā ca, vimutti ca anuttarā; Anubuddhā ime dhammā, gotamena yasassinā. ‘‘Iti buddho abhiññāya, dhammamakkhāsi bhikkhunaṃ; Dukkhassantakaro satthā, cakkhumā parinibbuto’’ti. dutiyaṃ;",
      "english": "Thus have I heard: At one time the Blessed One was dwelling in Vesālī, in Ambapāli's mango grove. There, the Blessed One addressed the bhikkhus, \"Bhikkhus.\" \"Venerable Sir,\" replied those bhikkhus to the Blessed One. The Blessed One spoke thus:\n\n\"Impermanent, bhikkhus, are conditioned phenomena; unreliable, bhikkhus, are conditioned phenomena; without solace or shelter, bhikkhus, are conditioned phenomena. To such an extent, bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\n\"Mount Sineru, bhikkhus, the king of mountains, is eighty-four thousand leagues in length and eighty-four thousand leagues in width; eighty-four thousand leagues are submerged in the great ocean, and eighty-four thousand leagues rise above the great ocean. There comes a time, bhikkhus, when after a long, long period—for many years, many hundreds of years, many thousands of years, many hundreds of thousands of years—the sky does not rain. And when the sky, bhikkhus, does not rain, whatever seed-plants and living-plants, herbs, grasses, and forest trees there are, they dry up, wither away, and cease to exist. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace or shelter, bhikkhus, are conditioned phenomena. To such an extent, bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\n\"There comes a time, bhikkhus, when after a long, long period, a second sun appears. With the appearance of a second sun, bhikkhus, whatever small rivers and tiny streams there are, they dry up, wither away, and cease to exist. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace or shelter, bhikkhus, are conditioned phenomena. To such an extent, bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\n\"There comes a time, bhikkhus, when after a long, long period, a third sun appears. With the appearance of a third sun, bhikkhus, whatever great rivers there are—namely, the Gaṅgā, Yamunā, Aciravatī, Sarabhū, and Mahī—they dry up, wither away, and cease to exist. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace or shelter, bhikkhus, are conditioned phenomena. To such an extent, bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\n\"There comes a time, bhikkhus, when after a long, long period, a fourth sun appears. With the appearance of a fourth sun, bhikkhus, those great lakes from which these great rivers originate—namely, Anotattā, Sīhapapātā, Rathakārā, Kaṇṇamuṇḍā, Kuṇālā, Chaddantā, and Mandākiniyā—they dry up, wither away, and cease to exist. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace or shelter, bhikkhus, are conditioned phenomena. To such an extent, bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\n\"There comes a time, bhikkhus, when after a long, long period, a fifth sun appears. With the appearance of a fifth sun, bhikkhus, the waters in the great ocean recede even by a hundred leagues; the waters in the great ocean recede even by two hundred leagues, by three hundred leagues, by four hundred leagues, by five hundred leagues, by six hundred leagues, by seven hundred leagues. The water in the great ocean remains at seven palm-tree heights, at six, at five, at four, at three, at two, even at one palm-tree height. The water in the great ocean remains at seven men's heights, at six, at five, at four, at three, at two, at one man's height, at half a man's height, even up to the waist, up to the knees, even up to the ankles. Just as, bhikkhus, when it rains heavily in autumn, water remains here and there in cow-hoof prints; even so, bhikkhus, here and there in the great ocean, water remains only up to the ankles. With the appearance of a fifth sun, bhikkhus, not even a finger-joint's worth of water remains in the great ocean. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace or shelter, bhikkhus, are conditioned phenomena. To such an extent, bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\n\"There comes a time, bhikkhus, when after a long, long period, a sixth sun appears. With the appearance of a sixth sun, bhikkhus, this great earth and Mount Sineru, the king of mountains, begin to smoke, emit smoke, and are completely engulfed in smoke. Just as, bhikkhus, a potter's oven, freshly plastered, first gives off smoke, emits smoke, and is completely engulfed in smoke; even so, bhikkhus, with the appearance of a sixth sun, this great earth and Mount Sineru, the king of mountains, begin to smoke, emit smoke, and are completely engulfed in smoke. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace or shelter, bhikkhus, are conditioned phenomena. To such an extent, bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\n\"There comes a time, bhikkhus, when after a long, long period, a seventh sun appears. With the appearance of a seventh sun, bhikkhus, this great earth and Mount Sineru, the king of mountains, catch fire, blaze, and become a single mass of flame.\n\nO bhikkhus, when this great earth and Mount Sineru, the king of mountains, burn and are consumed by fire, the flame, propelled by the wind, reaches even to the Brahma worlds. When Mount Sineru, O bhikkhus, the king of mountains, burns, is consumed by fire, and perishes, overcome by a great mass of fiery energy, its peaks, even those hundreds of leagues high, crumble; those two hundred leagues high crumble, three hundred leagues high, four hundred leagues high, five hundred leagues high, crumble. When this great earth and Mount Sineru, the king of mountains, O bhikkhus, burn and are consumed by fire, neither ashes nor soot can be discerned. Just as, O bhikkhus, when ghee or oil burns and is consumed, neither ashes nor soot can be discerned; even so, O bhikkhus, when this great earth and Mount Sineru, the king of mountains, burn and are consumed, neither ashes nor soot can be discerned. Such is the impermanence, O bhikkhus, of all conditioned phenomena; such is the instability, O bhikkhus, of all conditioned phenomena; such is the unreliability, O bhikkhus, of all conditioned phenomena. To this extent, O bhikkhus, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\n\nIn such a case, O bhikkhus, who would wisely reflect, who would believe – 'This earth and Mount Sineru, the king of mountains, will burn, will perish, will cease to exist' – except those with profound insight?\n\nFormerly, O bhikkhus, there was a teacher named Sunetta, a founder of a spiritual path, who was dispassionate towards sensual pleasures. And indeed, O bhikkhus, the teacher Sunetta had many hundreds of disciples. The teacher Sunetta, O bhikkhus, taught his disciples the path to companionship in the Brahma world. And indeed, O bhikkhus, those who, when the teacher Sunetta was teaching the path to companionship in the Brahma world, fully understood his teaching, they, upon the breaking up of the body, after death, reappeared in a good destination, the Brahma world. Those who did not fully understand the teaching, they, upon the breaking up of the body, after death, some reappeared in companionship with the devas who have power over creations of others, some in companionship with the devas who delight in creation, some in companionship with the Tusita devas, some in companionship with the Yama devas, some in companionship with the Tāvatiṃsa devas, some in companionship with the Cātumahārājika devas, some in companionship with great noble families, some in companionship with great brahmin families, some in companionship with great householder families.\n\nThen, O bhikkhus, it occurred to the teacher Sunetta: 'It is not fitting for me that I should attain the same destination as my disciples in the next world. What if I were to cultivate further loving-kindness?'\n\nThen, O bhikkhus, the teacher Sunetta cultivated a mind of loving-kindness for seven years. Having cultivated a mind of loving-kindness for seven years, for seven cycles of world contraction and expansion, he did not return to this world. Indeed, O bhikkhus, when the world contracted, he became a radiant deva of the Ābhassara realm. When the world expanded, he reappeared in an empty Brahma-palace. Indeed, O bhikkhus, there he was a Brahmā, a Great Brahmā, the vanquisher, the unvanquished, the all-seeing, the controller. And indeed, O bhikkhus, thirty-six times he was Sakka, king of devas. Many hundreds of times he was a Wheel-turning Monarch, a righteous king, a king of righteousness, having conquered the four quarters, having achieved stability over his countries, endowed with the seven treasures. And indeed, he had more than a thousand sons, brave, heroic in form, crushers of enemy armies. He, over this earth, bounded by the ocean, having conquered it without rod or sword, through righteousness, dwelled as its ruler. That teacher Sunetta, O bhikkhus, though he was so long-lived, so enduring, was not liberated — 'from birth, aging, death, sorrow, lamentation, pain, dejection, and despair, I say he was not liberated from suffering.'\n\nWhat was the reason for that? From not fully understanding, not fully penetrating, the four things. Which four? From not fully understanding, not fully penetrating, the Noble Virtue, O bhikkhus. From not fully understanding, not fully penetrating, the Noble Concentration. From not fully understanding, not fully penetrating, the Noble Wisdom. From not fully understanding, not fully penetrating, the Noble Liberation. This, O bhikkhus, the Noble Virtue, has been fully understood and fully penetrated; the Noble Concentration has been fully understood and fully penetrated; the Noble Wisdom has been fully understood and fully penetrated; the Noble Liberation has been fully understood and fully penetrated. The craving for existence has been cut off, the conduit to renewed existence has been exhausted. There is now no more renewed existence.\n\nThis the Fortunate One said. Having said this, the Accomplished One, the Teacher, then spoke further:\n\nVirtue, concentration, and wisdom,\nAnd unsurpassed liberation;\nThese phenomena have been fully understood\nBy Gotama, the glorious one.\n\nThus the Buddha, having directly known,\nDeclared the Dhamma to the bhikkhus;\nThe Teacher, the bringer of an end to suffering,\nThe one with vision, fully extinguished.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ වෛශාලියෙහි අම්බපාලි වනයේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා “මහණෙනි” කියා වදාළ සේක. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“මහණෙනි, සංඛාරයෝ අනිත්‍ය වෙත්. මහණෙනි, සංඛාරයෝ දුරට නොපවත්නා හෙවත් තිර නොවන සුළුය. මහණෙනි, සංඛාරයෝ සැනසීමට හේතු නොවන හෙවත් සාර නැත්තාහ. මහණෙනි, මේ කරුණ නිසා, සියලු සංඛාරයන් කෙරෙහි කලකිරීමට සුදුසුය, නොඇලීමට සුදුසුය, විමුක්තිය ලැබීමට සුදුසුය.\n\n“මහණෙනි, මේ මහා මේරු පර්වත රාජයා යොදුන් අසූ හාර දහසක් දිගින් යුක්තය, යොදුන් අසූ හාර දහසක් පළලින් යුක්තය, යොදුන් අසූ හාර දහසක් මහා සමුද්‍රයෙහි කිඳා බැස ඇත, යොදුන් අසූ හාර දහසක් මහා සමුද්‍රයෙන් ඉහළට නැඟී සිටියි. මහණෙනි, ඇතැම් විට එබඳු සමයෙක් වේ; යම් කලකදී, බොහෝ කලක් ගතවීමෙන්, බොහෝ වර්ෂ, බොහෝ වර්ෂ සිය ගණන්, බොහෝ වර්ෂ දහස් ගණන්, බොහෝ වර්ෂ ලක්ෂ ගණන් වර්ෂාවක් නොපවතී. මහණෙනි, වර්ෂාවක් නොපවතින කල, යම් බීජ ග්‍රාමයක් ද, භූත ග්‍රාමයක් ද, ඕෂධීන් ද, තෘණ වර්ග ද, වෘක්ෂ ලතාදිය ද ඇත්නම්, ඒ සියල්ල සිඳී යයි, වියළී යයි, නැති වී යයි. මහණෙනි, මෙසේ සංඛාරයෝ අනිත්‍ය වෙති; මෙසේ සංඛාරයෝ දුරට නොපවත්නා හෙවත් තිර නොවන සුළුය; මෙසේ සංඛාරයෝ සැනසීමට හේතු නොවන හෙවත් සාර නැත්තාහ. මහණෙනි, මේ කරුණ නිසා, සියලු සංඛාරයන් කෙරෙහි කලකිරීමට සුදුසුය, නොඇලීමට සුදුසුය, විමුක්තිය ලැබීමට සුදුසුය.\n\n“මහණෙනි, ඇතැම් විට එබඳු සමයෙක් වේ; යම් කලකදී, බොහෝ කලක් ගතවීමෙන්, දෙවන සූර්යයා පහළ වෙයි. මහණෙනි, දෙවන සූර්යයා පහළවීමෙන්, යම් දිය පාරවල් ද, කුඩා ඔයවල් ද ඇත්නම්, ඒ සියල්ල සිඳී යයි, වියළී යයි, නැති වී යයි. මහණෙනි, මෙසේ සංඛාරයෝ අනිත්‍ය වෙති; මෙසේ සංඛාරයෝ දුරට නොපවත්නා හෙවත් තිර නොවන සුළුය; මෙසේ සංඛාරයෝ සැනසීමට හේතු නොවන හෙවත් සාර නැත්තාහ. මහණෙනි, මේ කරුණ නිසා, සියලු සංඛාරයන් කෙරෙහි කලකිරීමට සුදුසුය, නොඇලීමට සුදුසුය, විමුක්තිය ලැබීමට සුදුසුය.\n\n“මහණෙනි, ඇතැම් විට එබඳු සමයෙක් වේ; යම් කලකදී, බොහෝ කලක් ගතවීමෙන්, තුන්වන සූර්යයා පහළ වෙයි. මහණෙනි, තුන්වන සූර්යයා පහළවීමෙන්, යම් ගංගා, යමුනා, අචිරවතී, සරභූ, මහී වැනි මහා නදීන් ඇත්නම්, ඒ සියල්ල සිඳී යයි, වියළී යයි, නැති වී යයි. මහණෙනි, මෙසේ සංඛාරයෝ අනිත්‍ය වෙති; මෙසේ සංඛාරයෝ දුරට නොපවත්නා හෙවත් තිර නොවන සුළුය; මෙසේ සංඛාරයෝ සැනසීමට හේතු නොවන හෙවත් සාර නැත්තාහ. මහණෙනි, මේ කරුණ නිසා, සියලු සංඛාරයන් කෙරෙහි කලකිරීමට සුදුසුය, නොඇලීමට සුදුසුය, විමුක්තිය ලැබීමට සුදුසුය.\n\n“මහණෙනි, ඇතැම් විට එබඳු සමයෙක් වේ; යම් කලකදී, බොහෝ කලක් ගතවීමෙන්, සිව්වන සූර්යයා පහළ වෙයි. මහණෙනි, සිව්වන සූර්යයා පහළවීමෙන්, යම් අනුතත්ත, සිංහපපාත, රථකාර, කණ්ණමුණ්ඩක, කුණාල, ඡද්දන්ත, මන්දාකිනී යන මහා නදීන් පැන නඟින මහා විල් ඇත්නම්, ඒ සියල්ල සිඳී යයි, වියළී යයි, නැති වී යයි. මහණෙනි, මෙසේ සංඛාරයෝ අනිත්‍ය වෙති; මෙසේ සංඛාරයෝ දුරට නොපවත්නා හෙවත් තිර නොවන සුළුය; මෙසේ සංඛාරයෝ සැනසීමට හේතු නොවන හෙවත් සාර නැත්තාහ. මහණෙනි, මේ කරුණ නිසා, සියලු සංඛාරයන් කෙරෙහි කලකිරීමට සුදුසුය, නොඇලීමට සුදුසුය, විමුක්තිය ලැබීමට සුදුසුය.\n\n“මහණෙනි, ඇතැම් විට එබඳු සමයෙක් වේ; යම් කලකදී, බොහෝ කලක් ගතවීමෙන්, පස්වන සූර්යයා පහළ වෙයි. මහණෙනි, පස්වන සූර්යයා පහළවීමෙන්, මහා සමුද්‍රයෙහි යොදුන් සිය ගණනක් ගැඹුරු ජලය අඩු වී යයි, යොදුන් දෙසිය ගණනක් ද, යොදුන් තුන්සිය ගණනක් ද, යොදුන් සාරසිය ගණනක් ද, යොදුන් පන්සිය ගණනක් ද, යොදුන් හයසිය ගණනක් ද, යොදුන් සත්සිය ගණනක් ද ගැඹුරු ජලය අඩු වී යයි. මහා සමුද්‍රයෙහි තල් රුක් සතක් පමණ ගැඹුරට ජලය පිහිටයි, තල් රුක් සයක් පමණ ද, තල් රුක් පහක් පමණ ද, තල් රුක් සතරක් පමණ ද, තල් රුක් තුනක් පමණ ද, තල් රුක් දෙකක් පමණ ද, තල් රුකක් පමණ ද ගැඹුරට ජලය පිහිටයි. මහා සමුද්‍රයෙහි පුරුෂයන් සත් දෙනෙකුගේ තරම් උසට ජලය පිහිටයි, පුරුෂයන් හය දෙනෙකුගේ තරම් ද, පුරුෂයන් පස් දෙනෙකුගේ තරම් ද, පුරුෂයන් සතර දෙනෙකුගේ තරම් ද, පුරුෂයන් තුන් දෙනෙකුගේ තරම් ද, පුරුෂයන් දෙදෙනෙකුගේ තරම් ද, පුරුෂයෙකුගේ තරම් ද, අඩ පුරුෂයෙකුගේ තරම් ද, ඉන දක්වා පමණක් ද, දණ දක්වා පමණක් ද, වළලුකර දක්වා පමණක් ද ජලය පිහිටයි. මහණෙනි, යම් සේ සරත් සමයෙහි මහ වර්ෂාවක් පවතින කල, එහෙ මෙහෙ ගවයන්ගේ පා සටහන් වල ජලය රැඳී තිබේද, එසේම, මහණෙනි, මහා සමුද්‍රයෙහි එහෙ මෙහෙ වළලුකර පමණ ජලය රැඳී තිබේ. මහණෙනි, පස්වන සූර්යයා පහළවීමෙන්, මහා සමුද්‍රයෙහි ඇඟිලි පුරුකක් තරම්වත් ජලය නොපවති. මහණෙනි, මෙසේ සංඛාරයෝ අනිත්‍ය වෙති; මෙසේ සංඛාරයෝ දුරට නොපවත්නා හෙවත් තිර නොවන සුළුය; මෙසේ සංඛාරයෝ සැනසීමට හේතු නොවන හෙවත් සාර නැත්තාහ. මහණෙනි, මේ කරුණ නිසා, සියලු සංඛාරයන් කෙරෙහි කලකිරීමට සුදුසුය, නොඇලීමට සුදුසුය, විමුක්තිය ලැබීමට සුදුසුය.\n\n“මහණෙනි, ඇතැම් විට එබඳු සමයෙක් වේ; යම් කලකදී, බොහෝ කලක් ගතවීමෙන්, සයවන සූර්යයා පහළ වෙයි. මහණෙනි, සයවන සූර්යයා පහළවීමෙන්, මේ මහා පෘථිවිය ද, මේරු පර්වත රාජයා ද දුම් දමන්නට පටන් ගනී, හොඳින් දුම් දමන්නට පටන් ගනී, මුළුමනින්ම දුම් දමන්නට පටන් ගනී. මහණෙනි, යම් සේ කුඹල්කරුවෙකුගේ බඳුන් පිළිස්සීමට සකස් කළ ගොඩැල්ල මුලින් දුම් දමයි, හොඳින් දුම් දමයි, මුළුමනින්ම දුම් දමයි ද, එසේම, මහණෙනි, සයවන සූර්යයා පහළවීමෙන්, මේ මහා පෘථිවිය ද, මේරු පර්වත රාජයා ද දුම් දමන්නට පටන් ගනී, හොඳින් දුම් දමන්නට පටන් ගනී, මුළුමනින්ම දුම් දමන්නට පටන් ගනී. මහණෙනි, මෙසේ සංඛාරයෝ අනිත්‍ය වෙති; මෙසේ සංඛාරයෝ දුරට නොපවත්නා හෙවත් තිර නොවන සුළුය; මෙසේ සංඛාරයෝ සැනසීමට හේතු නොවන හෙවත් සාර නැත්තාහ. මහණෙනි, මේ කරුණ නිසා, සියලු සංඛාරයන් කෙරෙහි කලකිරීමට සුදුසුය, නොඇලීමට සුදුසුය, විමුක්තිය ලැබීමට සුදුසුය.\n\n“මහණෙනි, ඇතැම් විට එබඳු සමයෙක් වේ; යම් කලකදී, බොහෝ කලක් ගතවීමෙන්, සත්වන සූර්යයා පහළ වෙයි. මහණෙනි, සත්වන සූර්යයා පහළවීමෙන්, මේ මහා පෘථිවිය ද, මේරු පර්වත රාජයා ද ඇවිලෙයි, දැවෙයි, එකම ගිනි ජාලාවක් බවට පත් වෙයි.\n\nභික්‍ෂූනි, මේ මහපොළොව ද, සුමේරු පර්වත‍රාජයා ද දැවෙන විට, දුම් දමන විට, වාතයෙන් විසිවූ ගිනිදළු බ්‍රහ්මලෝකය දක්වා ද ගමන් කරයි. භික්‍ෂූනි, සුමේරු පර්වත‍රාජයා දැවෙන විට, දුම් දමන විට, විනාශ වන විට, මහා තේජස් කඳකින් යටපත් වූ සිය ගණන් යොදුන් උස කඳු මුදුන් ද, දෙසීයක් යොදුන් උස කඳු මුදුන් ද, තුන්සීයක් යොදුන් උස කඳු මුදුන් ද, හාරසීයක් යොදුන් උස කඳු මුදුන් ද, පන්සීයක් යොදුන් උස කඳු මුදුන් ද කඩා වැටේ. භික්‍ෂූනි, මේ මහපොළොව ද, සුමේරු පර්වත‍රාජයා ද දැවෙන විට, දුම් දමන විට අළු හෝ කබල් ද දක්නට නොලැබේ. භික්‍ෂූනි, යම්සේ ගිතෙල් හෝ තෙල් දැවෙන විට, දුම් දමන විට අළු හෝ කබල් දක්නට නොලැබේද, භික්‍ෂූනි, එලෙසින්ම මේ මහපොළොව ද, සුමේරු පර්වත‍රාජයා ද දැවෙන විට, දුම් දමන විට අළු හෝ කබල් දක්නට නොලැබේ. භික්‍ෂූනි, මෙසේ සංස්කාර‍යෝ අනිත්‍ය ය; භික්‍ෂූනි, මෙසේ සංස්කාර‍යෝ නොපවතී; භික්‍ෂූනි, මෙසේ සංස්කාර‍යෝ සැනසිල්ලක් නොවේ. භික්‍ෂූනි, මේ සියලු සංස්කාර‍යන් කෙරෙහි කලකිරීමට ද, නොඇලීමට ද, මිදීමට ද මෙය ප්‍රමාණවත් ය. භික්‍ෂූනි, එහිලා යමෙක් මෙය දැනගන්නේ කෙසේද? යමෙක් මෙය විශ්වාස කරන්නේ කෙසේද? ‘මේ පොළොව ද, සුමේරු පර්වත‍රාජයා ද දැවෙන්නේ ය, විනාශ වන්නේ ය, නැතිවී යන්නේ ය’ යැයි, ධර‍්මය දැක්කාවූවන් හැර (අන් කවරෙක් විශ්වාස කරයිද?).\n\nභික්‍ෂූනි, අතීතයේ සුනෙත්ත නම් වූ, තීර්ථක වූ, කාමයන් කෙරෙහි වීතරාගී වූ ශාස්තෘ‍වරයෙක් විය. භික්‍ෂූනි, ඒ සුනෙත්ත නම් ශාස්තෘ‍වරයාට බොහෝ සිය ගණන් ශ්‍රාවකයෝ වූහ. භික්‍ෂූනි, සුනෙත්ත ශාස්තෘ‍වරයා ශ්‍රාවකයන්ට බ්‍රහ්මලෝකයේ සහයෝගයට උපදින්නට ධර‍්මය දේශනා කළේ ය. භික්‍ෂූනි, යම් ඒ ශ්‍රාවකයෝ සුනෙත්ත ශාස්තෘ‍වරයා බ්‍රහ්මලෝක සහයෝගය පිණිස ධර‍්මය දේශනා කරන කල්හි සියල්ලෙන් සියල්ල ශාසනය (ධර‍්මය) අවබෝධ කළෝ ද, ඔවුහු ශරීරය බිඳීමෙන් මරණින් පසු සුගතිය වූ බ්‍රහ්මලෝකයේ උපන්නාහ. යම් ඒ ශ්‍රාවකයෝ සියල්ලෙන් සියල්ල ශාසනය (ධර‍්මය) අවබෝධ නොකළෝ ද, ඔවුහු ශරීරය බිඳීමෙන් මරණින් පසු ඇතැම් අය පරනිම්මිත වසවත්ති දෙවියන්ගේ සහයෝගයට ද, ඇතැම් අය නිම්මානරතී දෙවියන්ගේ සහයෝගයට ද, ඇතැම් අය තුසිත දෙවියන්ගේ සහයෝගයට ද, ඇතැම් අය යාම දෙවියන්ගේ සහයෝගයට ද, ඇතැම් අය තව්තිසා දෙවියන්ගේ සහයෝගයට ද, ඇතැම් අය චාතුම්මහාරාජික දෙවියන්ගේ සහයෝගයට ද උපන්නාහ. ඇතැම් අය මහසල් ක්ෂත්‍රියයන්ගේ සහයෝගයට ද, ඇතැම් අය මහසල් බ්‍රාහ්මණයන්ගේ සහයෝගයට ද, ඇතැම් අය මහසල් ගෘහපතියන්ගේ සහයෝගයට ද උපන්නාහ.\n\nභික්‍ෂූනි, ඉන්පසු සුනෙත්ත ශාස්තෘ‍වරයාට මෙබඳු අදහසක් ඇතිවිය: ‘මා ශ්‍රාවකයන් හා සමසම ගතියෙන් යුක්ත වීම මට සුදුසු නොවේ, එබැවින් මම තවදුරටත් මෛත්‍රිය වඩන්නෙම් නම් යෙහෙකි.’\n\nභික්‍ෂූනි, ඉන්පසු සුනෙත්ත ශාස්තෘ‍වරයා සත් වසරක් මෛත්‍රී චිත්තය වැඩුවේ ය. සත් වසරක් මෛත්‍රී චිත්තය වඩා, සත් සංවට්ට‍-විවට්ට‍ කල්පයක් මේ ලෝකයට නැවත නොආවේ ය. භික්‍ෂූනි, ලෝකය සංවට්ට‍ වන විට (විනාශ වන විට) ඔහු ආභස්සර බ්‍රහ්ම ලෝකයට පැමිණියේ ය. ලෝකය විවට්ට‍ වන විට (නැවත හටගන්නා විට) ශුන්‍ය වූ බ්‍රහ්ම විමානයක උපන්නේ ය. භික්‍ෂූනි, එහිලා ඔහු බ්‍රහ්ම වූයේ ය, මහා බ්‍රහ්ම වූයේ ය, අභිභවනය කරන්නෙක් වූයේ ය, අභිභවනය නොකරනු ලැබුවෙක් වූයේ ය, අන්‍ය දේ දකින්නෙක් වූයේ ය (සර්වඥයෙක් වූයේ යැයි ඔහුට සිතුණේ ය), වසඟ කරන්නෙක් වූයේ ය. භික්‍ෂූනි, තිස් හය වරක් දෙවියන්ට අධිපති වූ ශක්‍ර‍යා විය. අනන්ත සිය ගණන් වාරයක් ධර‍්මිෂ්ඨ වූ, ධර‍්මරාජ වූ, සිව් මහාද්වීපයට අධිපති වූ, ජනපදයන්හි ස්ථාවර‍ත්වයට පත් වූ, සප්ත රත්නයෙන් යුක්ත වූ, ජයගත් චක්‍ර‍වර්තී රජෙක් විය. ඔහුට දහසකට අධික පුත්‍ර‍යෝ වූහ, ඔවුන් ශූර‍ වූහ, වීර‍ රූපයෙන් යුක්ත වූහ, සතුරු සේනා මර‍්දනය කරන්නෝ වූහ. ඔහු මේ සාගරය කෙළවර කොට ඇති පොළොව දඬු මුගුරු නොමැතිව, අවි ආයුධ නොමැතිව ධර‍්මයෙන් ම ජයගෙන පාලනය කළේ ය. භික්‍ෂූනි, ඒ සුනෙත්ත නම් ශාස්තෘ‍වරයා මෙසේ දීර‍්ඝායුෂ්ක වී, මෙසේ චිර‍ස්ථිත වූ නමුත් ‘ජාතියෙන් ද, ජරාවෙන් ද, මර‍ණයෙන් ද, ශෝකයෙන් ද, වැළපීමෙන් ද, දුකින් ද, දොම්නසින් ද, උපායාසයන්ගෙන් ද නොමිදුණේ ය, දුකින් නොමිදුණේ යැයි මම කියමි’.\n\nඑයට හේතුව කුමක් ද? සතර‍ ධර‍්මයන් අවබෝධ නොකළ බැවිනි, ප්‍රත්‍යක්ෂ නොකළ බැවිනි. කවර‍ක් ද ඒ සතර‍ ධර‍්මයෝ? භික්‍ෂූනි, ආර්ය‍ ශීලය අවබෝධ නොකළ බැවිනි, ප්‍රත්‍යක්ෂ නොකළ බැවිනි; ආර්ය‍ සමාධිය අවබෝධ නොකළ බැවිනි, ප්‍රත්‍යක්ෂ නොකළ බැවිනි; ආර්ය‍ ප්‍රඥාව අවබෝධ නොකළ බැවිනි, ප්‍රත්‍යක්ෂ නොකළ බැවිනි; ආර්ය‍ විමුක්තිය අවබෝධ නොකළ බැවිනි, ප්‍රත්‍යක්ෂ නොකළ බැවිනි. භික්‍ෂූනි, මේ ආර්ය‍ ශීලය අවබෝධ කර‍නු ලැබ ඇත, ප්‍රත්‍යක්ෂ කර‍නු ලැබ ඇත; ආර්ය‍ සමාධිය අවබෝධ කර‍නු ලැබ ඇත, ප්‍රත්‍යක්ෂ කර‍නු ලැබ ඇත; ආර්ය‍ ප්‍රඥාව අවබෝධ කර‍නු ලැබ ඇත, ප්‍රත්‍යක්ෂ කර‍නු ලැබ ඇත; ආර්ය‍ විමුක්තිය අවබෝධ කර‍නු ලැබ ඇත, ප්‍රත්‍යක්ෂ කර‍නු ලැබ ඇත; භව තණ්හාව සිඳිනු ලැබ ඇත; භව නැමැති නෙත්තිය (බැඳීම) ක්ෂය‍ වී ඇත; දැන් නැවත පුනර‍්භවයක් නැත.\n\nභාග්‍ය‍වතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘ‍න් වහන්සේ මෙය වදාරා තවදුර‍ටත් මෙසේ වදාළ සේක:\n“ශීලය ද, සමාධිය ද, ප්‍රඥාව ද, අනුත්තර‍ වූ විමුක්තිය ද,\nයසස් ඇති ගෞතමයන් වහන්සේ විසින් මේ ධර‍්මයන් අවබෝධ කර‍නු ලැබ ඇත.\nමෙසේ බුදුර‍ජාණන් වහන්සේ අභිඥාවෙන් දැන, භික්‍ෂූන්ට ධර‍්මය දේශනා කළ සේක;\nදුක කෙළවර‍ කර‍න ශාස්තෘ‍න් වහන්සේ, චක්‍ෂුස් ඇති සේක (ප්‍රඥා චක්‍ෂුස් ඇති සේක), පිරිනිවන් පෑ සේක.”",
      "paliTitle": "Sattasūriyasuttaṃ",
      "englishTitle": "The Discourse on the Seven Suns",
      "sinhalaTitle": "සත්තසූරිය සූත්‍රය"
    },
    {
      "number": 67,
      "pali": "‘‘Yato kho, bhikkhave, rañño paccantimaṃ nagaraṃ sattahi nagaraparikkhārehi suparikkhataṃ [suparikkhittaṃ (ka.)] hoti, catunnañca āhārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Idaṃ vuccati, bhikkhave, rañño paccantimaṃ nagaraṃ akaraṇīyaṃ bāhirehi paccatthikehi paccāmittehi. ‘‘Katamehi sattahi nagaraparikkhārehi suparikkhataṃ hoti? Idha, bhikkhave, rañño paccantime nagare esikā hoti gambhīranemā [gambhīranemi (ka.)] sunikhātā acalā asampavedhī [asampavedhi (sī. syā.)]. Iminā paṭhamena nagaraparikkhārena suparikkhataṃ hoti rañño paccantimaṃ nagaraṃ abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare parikhā hoti gambhīrā ceva vitthatā ca. Iminā dutiyena nagaraparikkhārena suparikkhataṃ hoti rañño paccantimaṃ nagaraṃ abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare anupariyāyapatho hoti ucco ceva vitthato ca. Iminā tatiyena nagaraparikkhārena suparikkhataṃ hoti rañño paccantimaṃ nagaraṃ abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare bahuṃ āvudhaṃ sannicitaṃ hoti salākañceva jevanikañca [jevaniyañca (sī. aṭṭha.)]. Iminā catutthena nagaraparikkhārena suparikkhataṃ hoti rañño paccantimaṃ nagaraṃ abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare bahubalakāyo paṭivasati, seyyathidaṃ – hatthārohā assārohā rathikā dhanuggahā celakā calakā piṇḍadāyakā uggā rājaputtā pakkhandino mahānāgā sūrā cammayodhino dāsakaputtā. Iminā pañcamena nagaraparikkhārena suparikkhataṃ hoti rañño paccantimaṃ nagaraṃ abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare dovāriko hoti paṇḍito byatto medhāvī aññātānaṃ nivāretā ñātānaṃ pavesetā. Iminā chaṭṭhena nagaraparikkhārena suparikkhataṃ hoti rañño paccantimaṃ nagaraṃ abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare pākāro hoti ucco ceva vitthato ca vāsanalepanasampanno ca. Iminā sattamena nagaraparikkhārena suparikkhataṃ hoti rañño paccantimaṃ nagaraṃ abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Imehi sattahi nagaraparikkhārehi suparikkhataṃ hoti. ‘‘Katamesaṃ catunnaṃ āhārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī? Idha, bhikkhave, rañño paccantime nagare bahuṃ tiṇakaṭṭhodakaṃ sannicitaṃ hoti abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare bahuṃ sāliyavakaṃ sannicitaṃ hoti abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare bahuṃ tilamuggamāsāparaṇṇaṃ sannicitaṃ hoti abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. ‘‘Puna caparaṃ, bhikkhave, rañño paccantime nagare bahuṃ bhesajjaṃ sannicitaṃ hoti, seyyathidaṃ – sappi navanītaṃ telaṃ madhu phāṇitaṃ loṇaṃ abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. Imesaṃ kho, bhikkhave, catunnaṃ āhārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. ‘‘Yato kho, bhikkhave, rañño paccantimaṃ nagaraṃ imehi sattahi nagaraparikkhārehi suparikkhataṃ hoti, imesañca catunnaṃ āhārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Idaṃ vuccati, bhikkhave, rañño paccantimaṃ nagaraṃ akaraṇīyaṃ bāhirehi paccatthikehi paccāmittehi. Evamevaṃ kho, bhikkhave, yato ariyasāvako sattahi saddhammehi samannāgato hoti, catunnañca jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Ayaṃ vuccati, bhikkhave, ariyasāvako akaraṇīyo mārassa akaraṇīyo pāpimato. Katamehi sattahi saddhammehi samannāgato hoti? ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare esikā hoti gambhīranemā sunikhātā acalā asampavedhī abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ ‘itipi so…pe… buddho bhagavā’ti. Saddhesiko, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti; sāvajjaṃ pajahati, anavajjaṃ bhāveti; suddhaṃ attānaṃ pariharati. Iminā paṭhamena saddhammena samannāgato hoti. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare parikkhā hoti gambhīrā ceva vitthatā ca abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako hirīmā hoti, hirīyati kāyaduccaritena vacīduccaritena manoduccaritena, hirīyati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Hirīparikkho kho, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti; sāvajjaṃ pajahati, anavajjaṃ bhāveti; suddhaṃ attānaṃ pariharati. Iminā dutiyena saddhammena samannāgato hoti. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare anupariyāyapatho hoti ucco ceva vitthato ca abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako ottappī hoti, ottappati kāyaduccaritena vacīduccaritena manoduccaritena, ottappati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Ottappapariyāyapatho, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti; sāvajjaṃ pajahati, anavajjaṃ bhāveti; suddhaṃ attānaṃ pariharati. Iminā tatiyena saddhammena samannāgato hoti. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṃ āvudhaṃ sannicitaṃ hoti salākañceva jevanikañca abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā. Sutāvudho, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti; sāvajjaṃ pajahati, anavajjaṃ bhāveti; suddhaṃ attānaṃ pariharati. Iminā catutthena saddhammena samannāgato hoti. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare bahubalakāyo paṭivasati, seyyathidaṃ – hatthārohā assārohā rathikā dhanuggahā celakā calakā piṇḍadāyakā uggā rājaputtā pakkhandino mahānāgā sūrā cammayodhino dāsakaputtā abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Vīriyabalakāyo, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti; sāvajjaṃ pajahati, anavajjaṃ bhāveti; suddhaṃ attānaṃ pariharati. Iminā pañcamena saddhammena samannāgato hoti. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare dovāriko hoti paṇḍito byatto medhāvī aññātānaṃ nivāretā ñātānaṃ pavesetā abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Satidovāriko, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti; sāvajjaṃ pajahati, anavajjaṃ bhāveti; suddhaṃ attānaṃ pariharati. Iminā chaṭṭhena saddhammena samannāgato hoti. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare pākāro hoti ucco ceva vitthato ca vāsanalepanasampanno ca abbhantarānaṃ guttiyā bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Paññāvāsanalepanasampanno, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti; sāvajjaṃ pajahati, anavajjaṃ bhāveti; suddhaṃ attānaṃ pariharati. Iminā sattamena saddhammena samannāgato hoti. Imehi sattahi saddhammehi samannāgato hoti. ‘‘Katamesaṃ catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī? Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṃ tiṇakaṭṭhodakaṃ sannicitaṃ hoti abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati attano ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṃ sāliyavakaṃ sannicitaṃ hoti abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati attano ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṃ tilamuggamāsāparaṇṇaṃ sannicitaṃ hoti abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. Evamevaṃ kho, bhikkhave, ariyasāvako pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati attano ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. ‘‘Seyyathāpi, bhikkhave, rañño paccantime nagare bahuṃ bhesajjaṃ sannicitaṃ hoti, seyyathidaṃ – sappi navanītaṃ telaṃ madhu phāṇitaṃ loṇaṃ abbhantarānaṃ ratiyā aparitassāya phāsuvihārāya bāhirānaṃ paṭighātāya. Evamevaṃ kho bhikkhave, ariyasāvako sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati attano ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. Imesaṃ catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. ‘‘Yato kho, bhikkhave, ariyasāvako imehi sattahi saddhammehi samannāgato hoti, imesañca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Ayaṃ vuccati, bhikkhave, ariyasāvako akaraṇīyo mārassa akaraṇīyo pāpimato’’ti. Tatiyaṃ.",
      "english": "Indeed, monks, when a king's frontier city is well-protected with seven city defenses, and obtains at will, without difficulty or trouble, the four kinds of provisions. This, monks, is called a king's frontier city that cannot be overcome by external enemies and adversaries.\n\nWith what seven city defenses is it well-protected? Here, monks, in a king's frontier city, there is a main pillar, deeply founded, firmly planted, unmoving, and unshaking. By this first city defense, the king's frontier city is well-protected for the security of those within and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, there is a moat that is both deep and wide. By this second city defense, the king's frontier city is well-protected for the security of those within and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, there is a circumambulatory path that is both high and wide. By this third city defense, the king's frontier city is well-protected for the security of those within and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, there is an abundance of weapons stored, both projectile weapons and essential weapons for combat. By this fourth city defense, the king's frontier city is well-protected for the security of those within and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, a large body of troops resides, such as elephant riders, cavalrymen, charioteers, archers, standard-bearers, swift-moving troops, commissariat officers, fierce warriors, princes, shock troops, great heroes, brave men, shield-bearers, and retainers. By this fifth city defense, the king's frontier city is well-protected for the security of those within and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, there is a gatekeeper who is wise, experienced, and intelligent, one who keeps out strangers and allows in acquaintances. By this sixth city defense, the king's frontier city is well-protected for the security of those within and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, there is a rampart that is both high and wide, and well-plastered and maintained. By this seventh city defense, the king's frontier city is well-protected for the security of those within and for the repulsion of those without. With these seven city defenses, it is well-protected.\n\nOf which four kinds of provisions does it obtain at will, without difficulty or trouble? Here, monks, in a king's frontier city, an abundance of grass, wood, and water is stored, for the enjoyment and untroubled comfortable living of those within, and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, an abundance of rice and barley is stored, for the enjoyment and untroubled comfortable living of those within, and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, an abundance of sesame, mung beans, black gram, and other grains is stored, for the enjoyment and untroubled comfortable living of those within, and for the repulsion of those without.\n\nFurthermore, monks, in a king's frontier city, an abundance of medicines is stored, such as ghee, fresh butter, oil, honey, treacle, and salt, for the enjoyment and untroubled comfortable living of those within, and for the repulsion of those without. Of these four kinds of provisions, monks, it obtains at will, without difficulty or trouble.\n\nIndeed, monks, when a king's frontier city is well-protected with these seven city defenses, and obtains at will, without difficulty or trouble, these four kinds of provisions. This, monks, is called a king's frontier city that cannot be overcome by external enemies and adversaries.\n\nIn the same way, monks, when a noble disciple is endowed with seven excellent qualities, and obtains at will, without difficulty or trouble, the four jhānas—the mind's exalted dwellings, providing a pleasant abiding in this very life. This, monks, is called a noble disciple who cannot be overcome by Māra, cannot be overcome by the Evil One. With what seven excellent qualities is he endowed? Just as, monks, in a king's frontier city, there is a main pillar, deeply founded, firmly planted, unmoving, and unshaking, for the security of those within and for the repulsion of those without. In the same way, monks, the noble disciple is endowed with conviction, and has conviction in the enlightenment of the Tathāgata, thus: ‘Indeed, the Blessed One is an Arahant, perfectly enlightened, endowed with clear vision and conduct, fortunate, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Buddha, the Blessed One.’\n\nMonks, a noble disciple who has faith abandons unwholesome actions and develops wholesome actions; they abandon blameworthy actions and develop blameless actions; they maintain a purified self. They are endowed with this first excellent quality.\n\nJust as, monks, in a king’s frontier city, there is a moat, deep and wide, for the protection of those within and for keeping out those from outside. In the same way, monks, a noble disciple is endowed with moral shame; they are ashamed of misconduct by body, by speech, and by mind; they are ashamed of acquiring evil, unwholesome states. A noble disciple, protected by moral shame, abandons unwholesome actions and develops wholesome actions; they abandon blameworthy actions and develop blameless actions; they maintain a purified self. They are endowed with this second excellent quality.\n\nJust as, monks, in a king’s frontier city, there is an encircling rampart, high and wide, for the protection of those within and for keeping out those from outside. In the same way, monks, a noble disciple is endowed with moral dread; they dread misconduct by body, by speech, and by mind; they dread acquiring evil, unwholesome states. A noble disciple, whose patrol path is moral dread, abandons unwholesome actions and develops wholesome actions; they abandon blameworthy actions and develop blameless actions; they maintain a purified self. They are endowed with this third excellent quality.\n\nJust as, monks, in a king’s frontier city, much weaponry is stored, both spears and javelins, for the protection of those within and for keeping out those from outside. In the same way, monks, a noble disciple is very learned, remembers what has been learned, accumulates what has been learned, is conversant with those teachings that are beautiful in the beginning, beautiful in the middle, and beautiful in the end, with their right meaning and phrasing, proclaiming the perfectly complete and purified spiritual life; such teachings they have heard much of, retained, recited, pondered, and properly penetrated by understanding. A noble disciple, whose weapon is learning, abandons unwholesome actions and develops wholesome actions; they abandon blameworthy actions and develop blameless actions; they maintain a purified self. They are endowed with this fourth excellent quality.\n\nJust as, monks, in a king’s frontier city, a large army division resides, namely – elephant riders, cavalrymen, charioteers, archers, standard-bearers, messengers, provisioners, valiant warriors, royal princes, shock troops, great champions, heroes, shield-bearers, and sons of slaves – for the protection of those within and for keeping out those from outside. In the same way, monks, a noble disciple dwells with aroused energy for the abandoning of unwholesome states and for the acquisition of wholesome states; they are steadfast, firm in exertion, not casting off the burden in wholesome states. A noble disciple, whose army is energy, abandons unwholesome actions and develops wholesome actions; they abandon blameworthy actions and develop blameless actions; they maintain a purified self. They are endowed with this fifth excellent quality.\n\nJust as, monks, in a king’s frontier city, there is a gatekeeper, wise, competent, and intelligent, who keeps out strangers and lets in acquaintances, for the protection of those within and for keeping out those from outside. In the same way, monks, a noble disciple is mindful, endowed with supreme mindfulness and clear comprehension, remembering and recalling what was done and said long ago. A noble disciple, whose gatekeeper is mindfulness, abandons unwholesome actions and develops wholesome actions; they abandon blameworthy actions and develop blameless actions; they maintain a purified self. They are endowed with this sixth excellent quality.\n\nJust as, monks, in a king’s frontier city, there is a rampart, high and wide, coated with plaster and mortar, for the protection of those within and for keeping out those from outside. In the same way, monks, a noble disciple is wise, endowed with wisdom that discerns rise and fall, noble wisdom that penetrates, leading to the complete eradication of suffering. A noble disciple, whose plaster-coating is wisdom, abandons unwholesome actions and develops wholesome actions; they abandon blameworthy actions and develop blameless actions; they maintain a purified self. They are endowed with this seventh excellent quality. They are endowed with these seven excellent qualities.\n\nWhich of the four jhānas – pertaining to the higher mind, a pleasant abiding in this very life – do they obtain at will, without difficulty, without trouble? Just as, monks, in a king’s frontier city, a large store of grass, wood, and water is accumulated for the enjoyment of those within, for their non-distress and comfortable abiding, and for keeping out those from outside. In the same way, monks, a noble disciple, quite secluded from sensual pleasures, secluded from unwholesome states, attains and dwells in the first jhāna, which is accompanied by applied and sustained thought, born of seclusion, with rapture and pleasure, for their own enjoyment, non-distress, and comfortable abiding, and for approaching Nibbana.\n\nJust as, monks, in a king’s frontier city, a large store of rice and barley is accumulated for the enjoyment of those within, for their non-distress and comfortable abiding, and for keeping out those from outside. In the same way, monks, a noble disciple, with the fading away of applied and sustained thought, with the internal assurance and unification of mind, without applied and sustained thought, born of concentration, with rapture and pleasure, attains and dwells in the second jhāna, for their own enjoyment, non-distress, and comfortable abiding, and for approaching Nibbana.\n\nJust as, monastics, in a king’s border city, a great store of sesame, mung beans, black gram, and other grains is accumulated for the enjoyment of those within, for their non-agitation, for their comfortable abiding, and for warding off external dangers. In the same way, monastics, a noble disciple, with the fading away of rapture… enters and abides in the third jhāna, for his own enjoyment, for his non-agitation, for his comfortable abiding, and for the entering into Nibbāna.\n\nJust as, monastics, in a king’s border city, a great store of medicines is accumulated—namely, ghee, fresh butter, oil, honey, treacle, salt—for the enjoyment of those within, for their non-agitation, for their comfortable abiding, and for warding off external dangers. In the same way, monastics, a noble disciple, with the abandoning of pleasure and the abandoning of pain, and with the prior fading away of joy and sorrow, enters and abides in the fourth jhāna, which is neither painful nor pleasant, purified by equanimity and mindfulness, for his own enjoyment, for his non-agitation, for his comfortable abiding, and for the entering into Nibbāna. He obtains these four jhānas, which belong to the higher mind and are a comfortable abiding in this very life, whenever he wishes, without difficulty, without trouble.\n\nFor when, monastics, a noble disciple is endowed with these seven noble qualities, and obtains these four jhānas, which belong to the higher mind and are a comfortable abiding in this very life, whenever he wishes, without difficulty, without trouble, then, monastics, this noble disciple is said to be beyond the power of Māra, beyond the power of the Evil One.",
      "sinhala": "භික්ෂූනි, යම් කලක රජුගේ දේශසීමා නගරයක් සත් නගරාරක්ෂක අංගයන්ගෙන් මැනවින් සුරක්ෂිත වී ද, සිව් ආහාරයන් පහසුවෙන්, දුෂ්කරතාවකින් තොරව, අපහසුවකින් තොරව ලැබීමට හැකි වේ ද, භික්ෂූනි, එවැනි රජුගේ දේශසීමා නගරයක් බාහිර සතුරන් හා විරුද්ධවාදීන් විසින් ජයගත නොහැකි නගරයක් ලෙස කියනු ලැබේ.\n\nඑනම්, කවර සත් නගරාරක්ෂක අංගයන්ගෙන් එය මැනවින් සුරක්ෂිත වේ ද? භික්ෂූනි, මෙහි දී රජුගේ දේශසීමා නගරයෙහි ගැඹුරු පාදමක් ඇති, මැනවින් තදින් සිටවූ, නොසෙල්වෙන, නොසැලෙන ප්‍රධාන කණුවක් වෙයි. මේ පළමු නගරාරක්ෂක අංගය කරණ කොට ගෙන, රජුගේ දේශසීමා නගරය අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට ද, බාහිර සතුරන් පලවා හැරීමට ද මැනවින් සුරක්ෂිත වේ.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි ගැඹුරු වූ ද පළල් වූ ද අගලක් වෙයි. මේ දෙවැනි නගරාරක්ෂක අංගය කරණ කොට ගෙන, රජුගේ දේශසීමා නගරය අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට ද, බාහිර සතුරන් පලවා හැරීමට ද මැනවින් සුරක්ෂිත වේ.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි උස් වූ ද පළල් වූ ද ප්‍රාකාරය මත තැනූ වටරවුම් මඟක් වෙයි. මේ තුන්වැනි නගරාරක්ෂක අංගය කරණ කොට ගෙන, රජුගේ දේශසීමා නගරය අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට ද, බාහිර සතුරන් පලවා හැරීමට ද මැනවින් සුරක්ෂිත වේ.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි විසි කරන හා පහර දෙන බොහෝ ආයුධ ගබඩා කර ඇත. මේ සිව්වැනි නගරාරක්ෂක අංගය කරණ කොට ගෙන, රජුගේ දේශසීමා නගරය අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට ද, බාහිර සතුරන් පලවා හැරීමට ද මැනවින් සුරක්ෂිත වේ.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි විශාල හමුදා පිරිසක් වාසය කරයි. එනම්, හස්ති ආරෝහකයෝ, අශ්ව ආරෝහකයෝ, රථ සෙබළු, දුනුවායෝ, චේලකයෝ, චාලකයෝ, පිණ්ඩදායකයෝ, උග්‍ර සෙබළු, රාජ කුමාරවරු, ප්‍රහාරක භටයෝ, මහා ශක්ති සම්පන්නයෝ, ශූරයෝ, චර්ම යෝධයෝ, දාස පුත්‍රයෝ ආදීහු ය. මේ පස්වැනි නගරාරක්ෂක අංගය කරණ කොට ගෙන, රජුගේ දේශසීමා නගරය අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට ද, බාහිර සතුරන් පලවා හැරීමට ද මැනවින් සුරක්ෂිත වේ.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි නාඳුනන අය වළක්වන, හඳුනන අය ඇතුල් කරන, පණ්ඩිත, ප්‍රවීණ, බුද්ධිමත් දොරටුපාලයෙක් වෙයි. මේ සයවැනි නගරාරක්ෂක අංගය කරණ කොට ගෙන, රජුගේ දේශසීමා නගරය අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට ද, බාහිර සතුරන් පලවා හැරීමට ද මැනවින් සුරක්ෂිත වේ.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි උස් වූ ද පළල් වූ ද බදාම ආලේපයෙන් යුක්ත වූ ද ප්‍රාකාරයක් වෙයි. මේ සත්වැනි නගරාරක්ෂක අංගය කරණ කොට ගෙන, රජුගේ දේශසීමා නගරය අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට ද, බාහිර සතුරන් පලවා හැරීමට ද මැනවින් සුරක්ෂිත වේ. මේ සත් නගරාරක්ෂක අංගයන්ගෙන් එය මැනවින් සුරක්ෂිත වේ.\n\nකවර සිව් ආහාරයන් පහසුවෙන්, දුෂ්කරතාවකින් තොරව, අපහසුවකින් තොරව ලැබීමට හැකි වේ ද? භික්ෂූනි, මෙහි දී රජුගේ දේශසීමා නගරයෙහි අභ්‍යන්තර වැසියන්ගේ ප්‍රීතියට, නොසන්සුන් බවෙන් තොරව, සුවසේ විසීමට හා බාහිර සතුරන් පලවා හැරීමට බොහෝ තණකොළ, දර, ජලය ගබඩා කර ඇත.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි අභ්‍යන්තර වැසියන්ගේ ප්‍රීතියට, නොසන්සුන් බවෙන් තොරව, සුවසේ විසීමට හා බාහිර සතුරන් පලවා හැරීමට බොහෝ සාලි, යව ගබඩා කර ඇත.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි අභ්‍යන්තර වැසියන්ගේ ප්‍රීතියට, නොසන්සුන් බවෙන් තොරව, සුවසේ විසීමට හා බාහිර සතුරන් පලවා හැරීමට බොහෝ තල, මුං, මාෂ හා වෙනත් ධාන්‍ය වර්ග ගබඩා කර ඇත.\n\nතවද, භික්ෂූනි, රජුගේ දේශසීමා නගරයෙහි අභ්‍යන්තර වැසියන්ගේ ප්‍රීතියට, නොසන්සුන් බවෙන් තොරව, සුවසේ විසීමට හා බාහිර සතුරන් පලවා හැරීමට බොහෝ ඖෂධ, එනම් ගිතෙල්, වෙඬරු, තෙල්, මී පැණි, හකුරු, ලුණු ආදිය ගබඩා කර ඇත. භික්ෂූනි, මේ සිව් ආහාරයන් පහසුවෙන්, දුෂ්කරතාවකින් තොරව, අපහසුවකින් තොරව ලැබීමට හැකි වේ.\n\nභික්ෂූනි, යම් කලක රජුගේ දේශසීමා නගරයක් මේ සත් නගරාරක්ෂක අංගයන්ගෙන් මැනවින් සුරක්ෂිත වී ද, මේ සිව් ආහාරයන් පහසුවෙන්, දුෂ්කරතාවකින් තොරව, අපහසුවකින් තොරව ලැබීමට හැකි වේ ද, භික්ෂූනි, එවැනි රජුගේ දේශසීමා නගරයක් බාහිර සතුරන් හා විරුද්ධවාදීන් විසින් ජයගත නොහැකි නගරයක් ලෙස කියනු ලැබේ. භික්ෂූනි, එපරිද්දෙන්ම, යම් කලක ආර්ය ශ්‍රාවකයෙක් සත් සද්ධර්මයන්ගෙන් යුක්ත වේ ද, අධිචෛතසික වූ, මේ ආත්මයෙහිම සැප විහරණයන් වන සිව් ධ්‍යාන පහසුවෙන්, දුෂ්කරතාවකින් තොරව, අපහසුවකින් තොරව ලැබීමට හැකි වේ ද, භික්ෂූනි, එවැනි ආර්ය ශ්‍රාවකයෙක් මාරයාට ද, පාපී තැනැත්තාට ද ජයගත නොහැකි කෙනෙක් ලෙස කියනු ලැබේ. කවර සත් සද්ධර්මයන්ගෙන් ඔහු යුක්ත වේ ද?\n\nභික්ෂූනි, යම්සේ රජුගේ දේශසීමා නගරයෙහි අභ්‍යන්තර වැසියන්ගේ ආරක්ෂාවට හා බාහිර සතුරන් පලවා හැරීමට ගැඹුරු පාදමක් ඇති, මැනවින් තදින් සිටවූ, නොසෙල්වෙන, නොසැලෙන ප්‍රධාන කණුවක් වෙයි ද, භික්ෂූනි, එපරිද්දෙන්ම ආර්ය ශ්‍රාවකයා ශ්‍රද්ධාවන්තයෙක් වෙයි. ‘ඒ භාග්‍යවතුන් වහන්සේ අරහත් වන සේක, සම්‍යක් සම්බුද්ධ වන සේක’ ආදී වශයෙන් තථාගතයන් වහන්සේගේ බෝධිය විශ්වාස කරයි.\n\nමහණෙනි, ශ්‍රද්ධාවන්ත වූ ආර්ය ශ්‍රාවකයා අකුසලය දුරු කරයි, කුසලය වඩයි; දොස් සහිත දේ දුරු කරයි, දොස් රහිත දේ වඩයි; තමා පිරිසිදුව පවත්වා ගනී. ඔහු මේ පළමුවන සද්ධර්මයෙන් යුක්ත වෙයි.\n\nමහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ ආරක්ෂාව පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් ගැඹුරු වූ ද පළල් වූ ද පරිඛාවක් (පිටතින් ඇති ආරක්ෂිත වටාපිටාවක්) වෙයි. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා හිරි ඇති කෙනෙක් වෙයි. කය දුසිරිතෙන්, වචී දුසිරිතෙන්, මනෝ දුසිරිතෙන් ලැජ්ජාවට පත් වෙයි. පාපී අකුසල ධර්මයන්ට සමවැදීමෙන් ලැජ්ජාවට පත් වෙයි. හිරි නම් පරිඛාවෙන් යුතු මහණෙනි, ආර්ය ශ්‍රාවකයා අකුසලය දුරු කරයි, කුසලය වඩයි; දොස් සහිත දේ දුරු කරයි, දොස් රහිත දේ වඩයි; තමා පිරිසිදුව පවත්වා ගනී. ඔහු මේ දෙවන සද්ධර්මයෙන් යුක්ත වෙයි.\n\nමහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ ආරක්ෂාව පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් උස වූ ද පළල් වූ ද වටාපිටා මාර්ගයක් (ප්‍රාකාරය මත ඇති මාර්ගයක්) වෙයි. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා ඔත්ථප්පය ඇති කෙනෙක් වෙයි. කය දුසිරිතෙන්, වචී දුසිරිතෙන්, මනෝ දුසිරිතෙන් භය වෙයි. පාපී අකුසල ධර්මයන්ට සමවැදීමෙන් භය වෙයි. ඔත්ථප්පය නම් වටාපිටා මාර්ගයෙන් යුතු මහණෙනි, ආර්ය ශ්‍රාවකයා අකුසලය දුරු කරයි, කුසලය වඩයි; දොස් සහිත දේ දුරු කරයි, දොස් රහිත දේ වඩයි; තමා පිරිසිදුව පවත්වා ගනී. ඔහු මේ තෙවන සද්ධර්මයෙන් යුක්ත වෙයි.\n\nමහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ ආරක්ෂාව පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් සලාකා (ඊතල, හෙල්ල ආදි) සහ ජීවනිකා (විශාල යුධෝපකරණ) යන දෙවර්ගයේ ම බොහෝ ආයුධ රැස්කර තිබේ. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා බහුශ්‍රැත වෙයි, ධර්මය දරන්නෙක් වෙයි, ධර්මය රැස් කර ගත්තෙක් වෙයි. ආදි කල්‍යාණ වූ, මධ්‍ය කල්‍යාණ වූ, පර්යන්ත කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නා වූ යම් ඒ ධර්මයෝ වෙත් ද, එබඳු ධර්ම ඔහු විසින් බොහෝ කොට අසන ලද වෙත්, ධාරණය කරන ලද වෙත්, වචනයෙන් හුරු පුරුදු කරන ලද වෙත්, සිතින් මෙනෙහි කරන ලද වෙත්, දැක්මෙන් මනාකොට විනිවිද දකින ලද වෙත්. ශ්‍රැතිය නම් ආයුධයෙන් යුතු මහණෙනි, ආර්ය ශ්‍රාවකයා අකුසලය දුරු කරයි, කුසලය වඩයි; දොස් සහිත දේ දුරු කරයි, දොස් රහිත දේ වඩයි; තමා පිරිසිදුව පවත්වා ගනී. ඔහු මේ සිව්වන සද්ධර්මයෙන් යුක්ත වෙයි.\n\nමහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ ආරක්ෂාව පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් හස්ති ආරෝහකයෝ, අශ්වාරෝහකයෝ, රථවල ගමන් කරන්නෝ, දුනුවායෝ, චේලකයෝ, චාලකයෝ, පිණ්ඩදායකයෝ, උග්‍රයෝ, රාජ පුත්‍රයෝ, පැන නගින්නෝ, මහා නාගයෝ, ශූරයෝ, චර්ම යෝධයෝ, දාස පුත්‍රයෝ යන බොහෝ සේනා බලකායක් වාසය කරයි. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා අකුසල ධර්මයන් දුරු කිරීම පිණිස ද, කුසල ධර්මයන් උපදවා ගැනීම පිණිස ද වීර්ය අරඹා වාසය කරයි. ශක්ති සම්පන්න වූ, දැඩි වීර්ය ඇති වූ, කුසල ධර්මයන් කෙරෙහි භාරය නොදැමූ (එනම් උත්සාහය නොනැවැත්වූ) කෙනෙක් වෙයි. වීර්යය නම් බලකායෙන් යුතු මහණෙනි, ආර්ය ශ්‍රාවකයා අකුසලය දුරු කරයි, කුසලය වඩයි; දොස් සහිත දේ දුරු කරයි, දොස් රහිත දේ වඩයි; තමා පිරිසිදුව පවත්වා ගනී. ඔහු මේ පස්වන සද්ධර්මයෙන් යුක්ත වෙයි.\n\nමහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ ආරක්ෂාව පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් පණ්ඩිත වූ, ප්‍රකට වූ, බුද්ධිමත් වූ, නාඳුනන්නන් වැළැක්වූ, හඳුනන්නන් ඇතුළු කළාවූ දොරටුපාලයෙක් වෙයි. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා සිහි ඇති කෙනෙක් වෙයි, පරම සිහි නුවණින් යුක්ත වූ, කලක් කරන ලද දෙයක් ද, කලක් කියන ලද දෙයක් ද සිහි කරන්නෙක් වෙයි, නැවත නැවත සිහි කරන්නෙක් වෙයි. සතිය නම් දොරටුපාලයාගෙන් යුතු මහණෙනි, ආර්ය ශ්‍රාවකයා අකුසලය දුරු කරයි, කුසලය වඩයි; දොස් සහිත දේ දුරු කරයි, දොස් රහිත දේ වඩයි; තමා පිරිසිදුව පවත්වා ගනී. ඔහු මේ සයවන සද්ධර්මයෙන් යුක්ත වෙයි.\n\nමහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ ආරක්ෂාව පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් උස වූ ද පළල් වූ ද සුවඳ විලවුන් ආලේප කරන ලදුව මනා සේ නිම කරන ලද ප්‍රාකාරයක් වෙයි. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා ප්‍රඥාවන්ත වෙයි. උදය-ව්‍යය දකින ප්‍රඥාවෙන් යුක්ත වූ, ආර්ය වූ, විනිවිද දකින, මනාකොට දුක් ක්ෂය කිරීම කරා යන ප්‍රඥාවෙන් යුක්ත වෙයි. ප්‍රඥාව නම් වූ වාසනා ලේපනයෙන් යුතු මහණෙනි, ආර්ය ශ්‍රාවකයා අකුසලය දුරු කරයි, කුසලය වඩයි; දොස් සහිත දේ දුරු කරයි, දොස් රහිත දේ වඩයි; තමා පිරිසිදුව පවත්වා ගනී. ඔහු මේ සත්වන සද්ධර්මයෙන් යුක්ත වෙයි. ඔහු මේ සත් සද්ධර්මයෙන් යුක්ත වෙයි.\n\nකවර වූ සතර ධ්‍යානයන්ගේ, අභිචෛතසික වූ, මේ ජීවිතයේදීම සැප විහරණයට හේතු වූ (ධ්‍යානයන්ගේ) කැමති සේ ලබන්නෙක් වෙයි ද, අපහසුවකින් තොරව ලබන්නෙක් වෙයි ද, වෙහෙසකින් තොරව ලබන්නෙක් වෙයි ද? මහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ සතුට පිණිසත්, බියකින් තොරව සැපසේ වාසය කිරීම පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් බොහෝ තණ, දර, ජලය රැස්කර තිබේ. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමුවන ධ්‍යානයට එළඹ වාසය කරයි. එය තමන්ගේ සතුට පිණිසත්, බියකින් තොරව සැපසේ වාසය කිරීම පිණිසත්, නිවනට අවතීර්ණ වීම පිණිසත් වේ.\n\nමහණෙනි, යම් සේ රජෙකුගේ දේශ සීමාවේ ඇති නගරයක ඇතුළත සිටින අයගේ සතුට පිණිසත්, බියකින් තොරව සැපසේ වාසය කිරීම පිණිසත්, පිටතින් එන අයට බාධා කිරීම පිණිසත් බොහෝ ශාලි (වී) සහ යව (බාර්ලි) රැස්කර තිබේ. එසේම මහණෙනි, ආර්ය ශ්‍රාවකයා විතර්ක සහ විචාරයන් සංසිඳුවා, අධ්‍යාත්මිකව පහදවා ගැනීමෙන්, සිත එක අරමුණක තබා ගැනීමෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරයි. එය තමන්ගේ සතුට පිණිසත්, බියකින් තොරව සැපසේ වාසය කිරීම පිණිසත්, නිවනට අවතීර්ණ වීම පිණිසත් වේ.\n\nමහණෙනි, යම් සේ රජුගේ දේශසීමා නගරයක ඇතුළත වෙසෙන ජනයාගේ ප්‍රීතිය පිණිස, භීතියක් නැතිව, සැප විහරණය පිණිස, පිටතින් එන සතුරන් පලවා හැරීම පිණිස, තල, මුං, මාළු ආදි බොහෝ ධාන්‍ය වර්ග ගබඩා කර ඇත්ද; එලෙසම, මහණෙනි, ආර්ය ශ්‍රාවකයා ප්‍රීතිය කෙරෙහි නොඇලීමෙන් (විරාගයෙන්)... තුන්වන ධ්‍යානයට පැමිණ වාසය කරයි. තමාගේ ප්‍රීතිය පිණිස, භීතියක් නැතිව, සැප විහරණය පිණිස, නිවනට ළඟා වීම පිණිස.\n\nමහණෙනි, යම් සේ රජුගේ දේශසීමා නගරයක ඇතුළත වෙසෙන ජනයාගේ ප්‍රීතිය පිණිස, භීතියක් නැතිව, සැප විහරණය පිණිස, පිටතින් එන සතුරන් පලවා හැරීම පිණිස, ගිතෙල්, වෙඬරු, තෙල්, මී පැණි, උක්සකුරු, ලුණු ආදී බොහෝ බෙහෙත් ද්‍රව්‍ය ගබඩා කර ඇත්ද; එලෙසම, මහණෙනි, ආර්ය ශ්‍රාවකයා සැපයද ප්‍රහීණ කිරීමෙන්, දුකද ප්‍රහීණ කිරීමෙන්, පෙර තිබූ සෝමනස්ස-දෝමනස්සයන්ගේද අභාවයට යෑමෙන්, දුක්ද නොවන, සැපද නොවන, උපේක්ෂා-සති පාරිශුද්ධියෙන් යුත් සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. තමාගේ ප්‍රීතිය පිණිස, භීතියක් නැතිව, සැප විහරණය පිණිස, නිවනට ළඟා වීම පිණිස. ඔහු මේ අධිචෛතසික වූ, මේ ආත්මභාවයේම සැප විහරණ වූ, සතර ධ්‍යානයන් කැමති පරිදි ලබන්නේය, දුකක් නැතිව ලබන්නේය, වෙහෙසක් නැතිව ලබන්නේය.\n\nමහණෙනි, යම් කලෙක ආර්ය ශ්‍රාවකයා මේ සප්ත සද්ධර්මයන්ගෙන් යුක්ත වේද, මේ අධිචෛතසික වූ, මේ ආත්මභාවයේම සැප විහරණ වූ, සතර ධ්‍යානයන් කැමති පරිදි ලබන්නේද, දුකක් නැතිව ලබන්නේද, වෙහෙසක් නැතිව ලබන්නේද; මහණෙනි, මේ ආර්ය ශ්‍රාවකයා මාරයාට කිසිවක් කළ නොහැකි, පාපී මාරයාට කිසිවක් කළ නොහැකි කෙනෙකැයි කියනු ලැබේ. තෙවැනි සූත්‍රයයි.",
      "paliTitle": "Nagaropamasuttaṃ",
      "englishTitle": "Simile of the City Sutta",
      "sinhalaTitle": "නගරෝපම සූත්‍රය"
    },
    {
      "number": 68,
      "pali": "‘‘Sattahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti …pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi sattahi? Idha, bhikkhave, bhikkhu dhammaññū ca hoti atthaññū ca attaññū ca mattaññū ca kālaññū ca parisaññū ca puggalaparoparaññū ca. ‘‘Kathañca, bhikkhave, bhikkhu dhammaññū hoti? Idha, bhikkhave, bhikkhu dhammaṃ jānāti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthaṃ udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ. No ce, bhikkhave, bhikkhu dhammaṃ jāneyya – suttaṃ geyyaṃ…pe… abbhutadhammaṃ vedallaṃ, nayidha ‘dhammaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu dhammaṃ jānāti – suttaṃ geyyaṃ…pe… abbhutadhammaṃ vedallaṃ, tasmā ‘dhammaññū’ti vuccati. Iti dhammaññū. ‘‘Atthaññū ca kathaṃ hoti? Idha, bhikkhave, bhikkhu tassa tasseva bhāsitassa atthaṃ jānāti – ‘ayaṃ imassa bhāsitassa attho, ayaṃ imassa bhāsitassa attho’ti. No ce, bhikkhave, bhikkhu tassa tasseva bhāsitassa atthaṃ jāneyya – ‘ayaṃ imassa bhāsitassa attho, ayaṃ imassa bhāsitassa attho’ti, nayidha ‘atthaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu tassa tasseva bhāsitassa atthaṃ jānāti – ‘ayaṃ imassa bhāsitassa attho, ayaṃ imassa bhāsitassa attho’ti, tasmā ‘atthaññū’ti vuccati. Iti dhammaññū, atthaññū. ‘‘Attaññū ca kathaṃ hoti? Idha, bhikkhave, bhikkhu attānaṃ jānāti – ‘ettakomhi saddhāya sīlena sutena cāgena paññāya paṭibhānenā’ti. No ce, bhikkhave, bhikkhu attānaṃ jāneyya – ‘ettakomhi saddhāya sīlena sutena cāgena paññāya paṭibhānenā’ti, nayidha ‘attaññū’ti vucceyya. Yasmā ca, bhikkhave, bhikkhu attānaṃ jānāti – ‘ettakomhi saddhāya sīlena sutena cāgena paññāya paṭibhānenā’ti, tasmā ‘attaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū. ‘‘Mattaññū ca kathaṃ hoti? Idha, bhikkhave, bhikkhu mattaṃ jānāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ paṭiggahaṇāya. No ce, bhikkhave, bhikkhu mattaṃ jāneyya cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ paṭiggahaṇāya, nayidha ‘mattaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu mattaṃ jānāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ paṭiggahaṇāya, tasmā ‘mattaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū, mattaññū. ‘‘Kālaññū ca kathaṃ hoti? Idha, bhikkhave, bhikkhu, kālaṃ jānāti – ‘ayaṃ kālo uddesassa, ayaṃ kālo paripucchāya, ayaṃ kālo yogassa, ayaṃ kālo paṭisallānassā’ti. No ce, bhikkhave, bhikkhu kālaṃ jāneyya – ‘ayaṃ kālo uddesassa, ayaṃ kālo paripucchāya, ayaṃ kālo yogassa, ayaṃ kālo paṭisallānassā’ti, nayidha ‘kālaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu kālaṃ jānāti – ‘ayaṃ kālo uddesassa, ayaṃ kālo paripucchāya, ayaṃ kālo yogassa, ayaṃ kālo paṭisallānassā’ti, tasmā ‘kālaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū, mattaññū, kālaññū. ‘‘Parisaññū ca kathaṃ hoti? Idha, bhikkhave, bhikkhu parisaṃ jānāti – ‘ayaṃ khattiyaparisā, ayaṃ brāhmaṇaparisā, ayaṃ gahapatiparisā, ayaṃ samaṇaparisā. Tattha evaṃ upasaṅkamitabbaṃ, evaṃ ṭhātabbaṃ, evaṃ kattabbaṃ, evaṃ nisīditabbaṃ, evaṃ bhāsitabbaṃ, evaṃ tuṇhī bhavitabba’nti. No ce, bhikkhave, bhikkhu parisaṃ jāneyya – ‘ayaṃ khattiyaparisā…pe… evaṃ tuṇhī bhavitabba’nti, nayidha ‘parisaññū’ti vucceyya. Yasmā ca kho, bhikkhave, bhikkhu parisaṃ jānāti – ‘ayaṃ khattiyaparisā, ayaṃ brāhmaṇaparisā, ayaṃ gahapatiparisā, ayaṃ samaṇaparisā. Tattha evaṃ upasaṅkamitabbaṃ, evaṃ ṭhātabbaṃ, evaṃ kattabbaṃ, evaṃ nisīditabbaṃ, evaṃ bhāsitabbaṃ, evaṃ tuṇhī bhavitabba’nti, tasmā ‘parisaññū’ti vuccati. Iti dhammaññū, atthaññū, attaññū, mattaññū, kālaññū, parisaññū. ‘‘Puggalaparoparaññū ca kathaṃ hoti? Idha, bhikkhave, bhikkhuno [sabbatthapi idha ārambhe ‘‘bhikkhuno’’ tveva dissati] dvayena puggalā viditā honti. Dve puggalā – eko ariyānaṃ dassanakāmo, eko ariyānaṃ na dassanakāmo. Yvāyaṃ puggalo ariyānaṃ na dassanakāmo, evaṃ so tenaṅgena gārayho. Yvāyaṃ puggalo ariyānaṃ dassanakāmo, evaṃ so tenaṅgena pāsaṃso. ‘‘Dve puggalā ariyānaṃ dassanakāmā – eko saddhammaṃ sotukāmo, eko saddhammaṃ na sotukāmo. Yvāyaṃ puggalo saddhammaṃ na sotukāmo, evaṃ so tenaṅgena gārayho. Yvāyaṃ puggalo saddhammaṃ sotukāmo, evaṃ so tenaṅgena pāsaṃso. ‘‘Dve puggalā saddhammaṃ sotukāmā – eko ohitasoto dhammaṃ suṇāti, eko anohitasoto dhammaṃ suṇāti. Yvāyaṃ puggalo anohitasoto dhammaṃ suṇāti, evaṃ so tenaṅgena gārayho. Yvāyaṃ puggalo ohitasoto dhammaṃ suṇāti, evaṃ so tenaṅgena pāsaṃso. ‘‘Dve puggalā ohitasotā dhammaṃ suṇanti [suṇantā (ka.)] – eko sutvā dhammaṃ dhāreti, eko sutvā dhammaṃ na dhāreti. Yvāyaṃ puggalo sutvā na dhammaṃ dhāreti, evaṃ so tenaṅgena gārayho. Yvāyaṃ puggalo sutvā dhammaṃ dhāreti, evaṃ so tenaṅgena pāsaṃso. ‘‘Dve puggalā sutvā dhammaṃ dhārenti [dhārentā (ka.)] – eko dhātānaṃ [dhatānaṃ (sī. syā. kaṃ. pī.)] dhammānaṃ atthaṃ upaparikkhati, eko dhātānaṃ dhammānaṃ atthaṃ na upaparikkhati. Yvāyaṃ puggalo dhātānaṃ dhammānaṃ atthaṃ na upaparikkhati, evaṃ so tenaṅgena gārayho. Yvāyaṃ puggalo dhātānaṃ dhammānaṃ atthaṃ upaparikkhati, evaṃ so tenaṅgena pāsaṃso. ‘‘Dve puggalā dhātānaṃ dhammānaṃ atthaṃ upaparikkhanti [upaparikkhantā (ka.)] – eko atthamaññāya dhammamaññāya dhammānudhammappaṭipanno, eko atthamaññāya dhammamaññāya na dhammānudhammappaṭipanno. Yvāyaṃ puggalo atthamaññāya dhammamaññāya na dhammānudhammappaṭipanno, evaṃ so tenaṅgena gārayho. Yvāyaṃ puggalo atthamaññāya dhammamaññāya dhammānudhammappaṭipanno, evaṃ so tenaṅgena pāsaṃso. ‘‘Dve puggalā atthamaññāya dhammamaññāya dhammānudhammappaṭipannā – eko attahitāya paṭipanno no parahitāya, eko attahitāya ca paṭipanno parahitāya ca. Yvāyaṃ puggalo attahitāya paṭipanno no parahitāya, evaṃ so tenaṅgena gārayho. Yvāyaṃ puggalo atthahitāya ca paṭipanno parahitāya ca, evaṃ so tenaṅgena pāsaṃso. Evaṃ kho, bhikkhave, bhikkhuno [bhikkhunā (sī. syā.)] dvayena puggalā viditā honti. Evaṃ, bhikkhave, bhikkhu puggalaparoparaññū hoti. ‘‘Imehi kho, bhikkhave, sattahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Catutthaṃ.",
      "english": "Monks, a bhikkhu endowed with seven qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of veneration, an unsurpassed field of merit for the world. Which seven? Here, monks, a bhikkhu is one who knows the Dhamma, one who knows the meaning, one who knows himself, one who knows moderation, one who knows the proper time, one who knows the assembly, and one who knows the superior and inferior nature of individuals.\n\nAnd how, monks, is a bhikkhu one who knows the Dhamma? Here, monks, a bhikkhu knows the Dhamma—the discourses, mixed prose and verse, explanations, verses, inspired utterances, ‘thus-saids’, birth stories, extraordinary phenomena, and questions and answers. If, monks, a bhikkhu did not know the Dhamma—the discourses, mixed prose and verse, explanations, verses, inspired utterances, ‘thus-saids’, birth stories, extraordinary phenomena, and questions and answers—he would not be called ‘one who knows the Dhamma’. But because, monks, a bhikkhu does know the Dhamma—the discourses, mixed prose and verse, explanations, verses, inspired utterances, ‘thus-saids’, birth stories, extraordinary phenomena, and questions and answers—for that reason, he is called ‘one who knows the Dhamma’. Thus, one who knows the Dhamma.\n\nAnd how is he one who knows the meaning? Here, monks, a bhikkhu knows the meaning of whatever is spoken, thinking: ‘This is the meaning of this statement, this is the meaning of that statement.’ If, monks, a bhikkhu did not know the meaning of whatever is spoken, thinking: ‘This is the meaning of this statement, this is the meaning of that statement,’ he would not be called ‘one who knows the meaning’. But because, monks, a bhikkhu does know the meaning of whatever is spoken, thinking: ‘This is the meaning of this statement, this is the meaning of that statement,’ for that reason, he is called ‘one who knows the meaning’. Thus, one who knows the Dhamma, one who knows the meaning.\n\nAnd how is he one who knows himself? Here, monks, a bhikkhu knows himself, thinking: ‘I am thus far in faith, in virtue, in learning, in generosity, in wisdom, in spontaneous insight.’ If, monks, a bhikkhu did not know himself, thinking: ‘I am thus far in faith, in virtue, in learning, in generosity, in wisdom, in spontaneous insight,’ he would not be called ‘one who knows himself’. But because, monks, a bhikkhu does know himself, thinking: ‘I am thus far in faith, in virtue, in learning, in generosity, in wisdom, in spontaneous insight,’ for that reason, he is called ‘one who knows himself’. Thus, one who knows the Dhamma, one who knows the meaning, one who knows himself.\n\nAnd how is he one who knows moderation? Here, monks, a bhikkhu knows moderation in receiving robes, almsfood, lodgings, and medicinal requisites for the sick. If, monks, a bhikkhu did not know moderation in receiving robes, almsfood, lodgings, and medicinal requisites for the sick, he would not be called ‘one who knows moderation’. But because, monks, a bhikkhu does know moderation in receiving robes, almsfood, lodgings, and medicinal requisites for the sick, for that reason, he is called ‘one who knows moderation’. Thus, one who knows the Dhamma, one who knows the meaning, one who knows himself, one who knows moderation.\n\nAnd how is he one who knows the proper time? Here, monks, a bhikkhu knows the proper time, thinking: ‘This is the time for recitation, this is the time for questioning, this is the time for mental application, this is the time for seclusion.’ If, monks, a bhikkhu did not know the proper time, thinking: ‘This is the time for recitation, this is the time for questioning, this is the time for mental application, this is the time for seclusion,’ he would not be called ‘one who knows the proper time’. But because, monks, a bhikkhu does know the proper time, thinking: ‘This is the time for recitation, this is the time for questioning, this is the time for mental application, this is the time for seclusion,’ for that reason, he is called ‘one who knows the proper time’. Thus, one who knows the Dhamma, one who knows the meaning, one who knows himself, one who knows moderation, one who knows the proper time.\n\nAnd how is he one who knows the assembly? Here, monks, a bhikkhu knows the assembly, thinking: ‘This is an assembly of nobles, this is an assembly of brahmins, this is an assembly of householders, this is an assembly of ascetics. There, one should approach in this way, stand in this way, act in this way, sit in this way, speak in this way, remain silent in this way.’ If, monks, a bhikkhu did not know the assembly, thinking: ‘This is an assembly of nobles, this is an assembly of brahmins, this is an assembly of householders, this is an assembly of ascetics. There, one should approach in this way, stand in this way, act in this way, sit in this way, speak in this way, remain silent in this way,’ he would not be called ‘one who knows the assembly’. But because, monks, a bhikkhu does know the assembly, thinking: ‘This is an assembly of nobles, this is an assembly of brahmins, this is an assembly of householders, this is an assembly of ascetics. There, one should approach in this way, stand in this way, act in this way, sit in this way, speak in this way, remain silent in this way,’ for that reason, he is called ‘one who knows the assembly’. Thus, one who knows the Dhamma, one who knows the meaning, one who knows himself, one who knows moderation, one who knows the proper time, one who knows the assembly.\n\nAnd how is he one who knows the superior and inferior nature of individuals? Here, monks, individuals are known to a bhikkhu in two ways. There are two types of individuals: one who desires to see the noble ones, and one who does not desire to see the noble ones. That individual who does not desire to see the noble ones is, by that aspect, blameworthy. That individual who does desire to see the noble ones is, by that aspect, praiseworthy. Of those two individuals who desire to see the noble ones, one desires to hear the True Dhamma, and one does not desire to hear the True Dhamma. That individual who does not desire to hear the True Dhamma is, by that aspect, blameworthy. That individual who does desire to hear the True Dhamma is, by that aspect, praiseworthy.\n\nThere are two individuals who wish to hear the True Dhamma: one listens to the Dhamma with an attentive mind, and one listens to the Dhamma with an inattentive mind. This individual who listens to the Dhamma with an inattentive mind is blameworthy in that respect. This individual who listens to the Dhamma with an attentive mind is praiseworthy in that respect.\n\nThere are two individuals who listen to the Dhamma with an attentive mind: one, having heard, retains the Dhamma; and one, having heard, does not retain the Dhamma. This individual who, having heard, does not retain the Dhamma is blameworthy in that respect. This individual who, having heard, retains the Dhamma is praiseworthy in that respect.\n\nThere are two individuals who, having heard, retain the Dhamma: one investigates the meaning of the retained teachings; and one does not investigate the meaning of the retained teachings. This individual who does not investigate the meaning of the retained teachings is blameworthy in that respect. This individual who investigates the meaning of the retained teachings is praiseworthy in that respect.\n\nThere are two individuals who investigate the meaning of the retained teachings: one, having understood the meaning and understood the teaching, practices in accordance with the Dhamma; and one, having understood the meaning and understood the teaching, does not practice in accordance with the Dhamma. This individual who, having understood the meaning and understood the teaching, does not practice in accordance with the Dhamma is blameworthy in that respect. This individual who, having understood the meaning and understood the teaching, practices in accordance with the Dhamma is praiseworthy in that respect.\n\nThere are two individuals who, having understood the meaning and understood the teaching, practice in accordance with the Dhamma: one practices for their own well-being but not for the well-being of others; and one practices for their own well-being and for the well-being of others. This individual who practices for their own well-being but not for the well-being of others is blameworthy in that respect. This individual who practices for their own well-being and for the well-being of others is praiseworthy in that respect.\n\nThus, O monastics, individuals are known by a monastic through these pairs of qualities. Thus, O monastics, a monastic becomes one who discerns individuals' higher and lower qualities. O monastics, a monastic endowed with these seven qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, ධර්ම සතකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය (පූජාවන්ට සුදුසු) වේ, පාහුණෙය්‍ය (ආගන්තුක සත්කාරයට සුදුසු) වේ, දක්ඛිණෙය්‍ය (දකුණත් පූජාවට සුදුසු) වේ, අංජලිකරණීය (වැඳීමට සුදුසු) වේ, ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයකි (උත්තරීතර පින් කෙතකි). කවර සතකින්ද? මහණෙනි, මෙහිලා භික්ෂුව ධර්මය දන්නා කෙනෙක් ද වේ, අර්ථය දන්නා කෙනෙක් ද වේ, තමා දන්නා කෙනෙක් ද වේ, ප්‍රමාණය දන්නා කෙනෙක් ද වේ, කාලය දන්නා කෙනෙක් ද වේ, පිරිස දන්නා කෙනෙක් ද වේ, පුද්ගලයන්ගේ උස්පහත් භාවය දන්නා කෙනෙක් ද වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ ධර්මය දන්නා කෙනෙක් වේ ද? මහණෙනි, මෙහිලා භික්ෂුව සූත්‍ර, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන නව අංගයෙන් යුත් ධර්මය දනී. මහණෙනි, යම් හෙයකින් භික්ෂුව සූත්‍ර, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන නව අංගයෙන් යුත් ධර්මය නොදන්නේ නම්, ධර්මය දන්නා කෙනෙක් යැයි නොකියනු ලැබේ. මහණෙනි, යම් හෙයකින් භික්ෂුව සූත්‍ර, ගෙය්‍ය, වෙය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන නව අංගයෙන් යුත් ධර්මය දන්නේ නම්, ධර්මය දන්නා කෙනෙක් යැයි කියනු ලැබේ. මෙසේ ධර්මය දන්නා කෙනෙක් වේ.\n\nඅර්ථය දන්නා කෙනෙක් කෙසේ වේ ද? මහණෙනි, මෙහිලා භික්ෂුව ඒ ඒ දේශනා කරන ලද වචන වල අර්ථය දනී. එනම්: ‘මෙය මේ දේශනාවේ අර්ථයයි, මෙය මේ දේශනාවේ අර්ථයයි’ යනුවෙනි. මහණෙනි, යම් හෙයකින් භික්ෂුව ඒ ඒ දේශනා කරන ලද වචන වල අර්ථය, ‘මෙය මේ දේශනාවේ අර්ථයයි, මෙය මේ දේශනාවේ අර්ථයයි’ යනුවෙන් නොදන්නේ නම්, අර්ථය දන්නා කෙනෙක් යැයි නොකියනු ලැබේ. මහණෙනි, යම් හෙයකින් භික්ෂුව ඒ ඒ දේශනා කරන ලද වචන වල අර්ථය, ‘මෙය මේ දේශනාවේ අර්ථයයි, මෙය මේ දේශනාවේ අර්ථයයි’ යනුවෙන් දන්නේ නම්, අර්ථය දන්නා කෙනෙක් යැයි කියනු ලැබේ. මෙසේ ධර්මය දන්නා කෙනෙක් ද, අර්ථය දන්නා කෙනෙක් ද වේ.\n\nතමා දන්නා කෙනෙක් කෙසේ වේ ද? මහණෙනි, මෙහිලා භික්ෂුව තමා දනී. එනම්: ‘මම ශ්‍රද්ධාවෙන් මෙපමණ වෙමි, සීලයෙන් මෙපමණ වෙමි, ශ්‍රැතයෙන් මෙපමණ වෙමි, ත්‍යාගයෙන් මෙපමණ වෙමි, ප්‍රඥාවෙන් මෙපමණ වෙමි, ප්‍රතිභානයෙන් මෙපමණ වෙමි’ යනුවෙනි. මහණෙනි, යම් හෙයකින් භික්ෂුව තමා, ‘මම ශ්‍රද්ධාවෙන් මෙපමණ වෙමි, සීලයෙන් මෙපමණ වෙමි, ශ්‍රැතයෙන් මෙපමණ වෙමි, ත්‍යාගයෙන් මෙපමණ වෙමි, ප්‍රඥාවෙන් මෙපමණ වෙමි, ප්‍රතිභානයෙන් මෙපමණ වෙමි’ යනුවෙන් නොදන්නේ නම්, තමා දන්නා කෙනෙක් යැයි නොකියනු ලැබේ. මහණෙනි, යම් හෙයකින් භික්ෂුව තමා, ‘මම ශ්‍රද්ධාවෙන් මෙපමණ වෙමි, සීලයෙන් මෙපමණ වෙමි, ශ්‍රැතයෙන් මෙපමණ වෙමි, ත්‍යාගයෙන් මෙපමණ වෙමි, ප්‍රඥාවෙන් මෙපමණ වෙමි, ප්‍රතිභානයෙන් මෙපමණ වෙමි’ යනුවෙන් දන්නේ නම්, තමා දන්නා කෙනෙක් යැයි කියනු ලැබේ. මෙසේ ධර්මය දන්නා කෙනෙක් ද, අර්ථය දන්නා කෙනෙක් ද, තමා දන්නා කෙනෙක් ද වේ.\n\nප්‍රමාණය දන්නා කෙනෙක් කෙසේ වේ ද? මහණෙනි, මෙහිලා භික්ෂුව සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර පිළිගැනීමේ ප්‍රමාණය දනී. මහණෙනි, යම් හෙයකින් භික්ෂුව සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර පිළිගැනීමේ ප්‍රමාණය නොදන්නේ නම්, ප්‍රමාණය දන්නා කෙනෙක් යැයි නොකියනු ලැබේ. මහණෙනි, යම් හෙයකින් භික්ෂුව සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර පිළිගැනීමේ ප්‍රමාණය දන්නේ නම්, ප්‍රමාණය දන්නා කෙනෙක් යැයි කියනු ලැබේ. මෙසේ ධර්මය දන්නා කෙනෙක් ද, අර්ථය දන්නා කෙනෙක් ද, තමා දන්නා කෙනෙක් ද, ප්‍රමාණය දන්නා කෙනෙක් ද වේ.\n\nකාලය දන්නා කෙනෙක් කෙසේ වේ ද? මහණෙනි, මෙහිලා භික්ෂුව කාලය දනී. එනම්: ‘මෙය ධර්ම දේශනා කිරීමේ කාලයයි, මෙය ප්‍රශ්න ඇසීමේ කාලයයි, මෙය භාවනා කිරීමේ කාලයයි, මෙය තෘෂ්ණා රහිතව एकांतව සිටීමේ කාලයයි’ යනුවෙනි. මහණෙනි, යම් හෙයකින් භික්ෂුව කාලය, ‘මෙය ධර්ම දේශනා කිරීමේ කාලයයි, මෙය ප්‍රශ්න ඇසීමේ කාලයයි, මෙය භාවනා කිරීමේ කාලයයි, මෙය තෘෂ්ණා රහිතව एकांतව සිටීමේ කාලයයි’ යනුවෙන් නොදන්නේ නම්, කාලය දන්නා කෙනෙක් යැයි නොකියනු ලැබේ. මහණෙනි, යම් හෙයකින් භික්ෂුව කාලය, ‘මෙය ධර්ම දේශනා කිරීමේ කාලයයි, මෙය ප්‍රශ්න ඇසීමේ කාලයයි, මෙය භාවනා කිරීමේ කාලයයි, මෙය තෘෂ්ණා රහිතව एकांतව සිටීමේ කාලයයි’ යනුවෙන් දන්නේ නම්, කාලය දන්නා කෙනෙක් යැයි කියනු ලැබේ. මෙසේ ධර්මය දන්නා කෙනෙක් ද, අර්ථය දන්නා කෙනෙක් ද, තමා දන්නා කෙනෙක් ද, ප්‍රමාණය දන්නා කෙනෙක් ද, කාලය දන්නා කෙනෙක් ද වේ.\n\nපිරිස දන්නා කෙනෙක් කෙසේ වේ ද? මහණෙනි, මෙහිලා භික්ෂුව පිරිස දනී. එනම්: ‘මෙය ක්ෂත්‍රිය පිරිසයි, මෙය බ්‍රාහ්මණ පිරිසයි, මෙය ගෘහපති පිරිසයි, මෙය ශ්‍රමණයන්ගේ පිරිසයි. එහිලා මෙසේ සමීප විය යුතුයි, මෙසේ සිටිය යුතුයි, මෙසේ කටයුතු කළ යුතුයි, මෙසේ වාඩි විය යුතුයි, මෙසේ කතා කළ යුතුයි, මෙසේ නිශ්ශබ්ද විය යුතුයි’ යනුවෙනි. මහණෙනි, යම් හෙයකින් භික්ෂුව පිරිස, ‘මෙය ක්ෂත්‍රිය පිරිසයි, මෙය බ්‍රාහ්මණ පිරිසයි, මෙය ගෘහපති පිරිසයි, මෙය ශ්‍රමණයන්ගේ පිරිසයි. එහිලා මෙසේ සමීප විය යුතුයි, මෙසේ සිටිය යුතුයි, මෙසේ කටයුතු කළ යුතුයි, මෙසේ වාඩි විය යුතුයි, මෙසේ කතා කළ යුතුයි, මෙසේ නිශ්ශබ්ද විය යුතුයි’ යනුවෙන් නොදන්නේ නම්, පිරිස දන්නා කෙනෙක් යැයි නොකියනු ලැබේ. මහණෙනි, යම් හෙයකින් භික්ෂුව පිරිස, ‘මෙය ක්ෂත්‍රිය පිරිසයි, මෙය බ්‍රාහ්මණ පිරිසයි, මෙය ගෘහපති පිරිසයි, මෙය ශ්‍රමණයන්ගේ පිරිසයි. එහිලා මෙසේ සමීප විය යුතුයි, මෙසේ සිටිය යුතුයි, මෙසේ කටයුතු කළ යුතුයි, මෙසේ වාඩි විය යුතුයි, මෙසේ කතා කළ යුතුයි, මෙසේ නිශ්ශබ්ද විය යුතුයි’ යනුවෙන් දන්නේ නම්, පිරිස දන්නා කෙනෙක් යැයි කියනු ලැබේ. මෙසේ ධර්මය දන්නා කෙනෙක් ද, අර්ථය දන්නා කෙනෙක් ද, තමා දන්නා කෙනෙක් ද, ප්‍රමාණය දන්නා කෙනෙක් ද, කාලය දන්නා කෙනෙක් ද, පිරිස දන්නා කෙනෙක් ද වේ.\n\nපුද්ගලයන්ගේ උස්පහත් භාවය දන්නා කෙනෙක් කෙසේ වේ ද? මහණෙනි, මෙහිලා භික්ෂුව පුද්ගලයන් ද්විත්ව ආකාරයකින් හඳුනා ගනී. පුද්ගලයෝ ද්විත්ව වෙති – එක් අයෙක් ආර්යයන් දැකීමට කැමති කෙනෙක් ය, අනෙක් අයෙක් ආර්යයන් දැකීමට අකමැති කෙනෙක් ය. යම් පුද්ගලයෙක් ආර්යයන් දැකීමට අකමැති වේ ද, ඔහු ඒ අංශයෙන් නින්දා ලැබීමට සුදුසුය. යම් පුද්ගලයෙක් ආර්යයන් දැකීමට කැමති වේ ද, ඔහු ඒ අංශයෙන් ප්‍රශංසා ලැබීමට සුදුසුය.\nආර්යයන් දැකීමට කැමති පුද්ගලයෝ ද්විත්ව වෙති – එක් අයෙක් සද්ධර්මය ඇසීමට කැමති කෙනෙක් ය, අනෙක් අයෙක් සද්ධර්මය ඇසීමට අකමැති කෙනෙක් ය. යම් පුද්ගලයෙක් සද්ධර්මය ඇසීමට අකමැති වේ ද, ඔහු ඒ අංශයෙන් නින්දා ලැබීමට සුදුසුය. යම් පුද්ගලයෙක් සද්ධර්මය ඇසීමට කැමති වේ ද, ඔහු ඒ අංශයෙන් ප්‍රශංසා ලැබීමට සුදුසුය.\n\nදෙආකාර පුද්ගලයෝ සද්ධර්මය ශ්‍රවණය කිරීමට කැමැත්තෝ වෙති. එක් පුද්ගලයෙක් සිත එකඟ කොට ධර්මය ශ්‍රවණය කරයි, එක් පුද්ගලයෙක් සිත එකඟ නොකොට ධර්මය ශ්‍රවණය කරයි. යම් පුද්ගලයෙක් සිත එකඟ නොකොට ධර්මය ශ්‍රවණය කරයිද, ඔහු ඒ අංගයෙන් නින්දා ලැබීමට සුදුස්සෙකි. යම් පුද්ගලයෙක් සිත එකඟ කොට ධර්මය ශ්‍රවණය කරයිද, ඔහු ඒ අංගයෙන් ප්‍රශංසා ලැබීමට සුදුස්සෙකි.\n\nසිත එකඟ කොට ධර්මය ශ්‍රවණය කරන පුද්ගලයෝ දෙදෙනෙක් වෙති. එක් පුද්ගලයෙක් ධර්මය අසා එය ධාරණය කරයි, එක් පුද්ගලයෙක් ධර්මය අසා එය ධාරණය නොකරයි. යම් පුද්ගලයෙක් ධර්මය අසා එය ධාරණය නොකරයිද, ඔහු ඒ අංගයෙන් නින්දා ලැබීමට සුදුස්සෙකි. යම් පුද්ගලයෙක් ධර්මය අසා එය ධාරණය කරයිද, ඔහු ඒ අංගයෙන් ප්‍රශංසා ලැබීමට සුදුස්සෙකි.\n\nධර්මය අසා ධාරණය කරන පුද්ගලයෝ දෙදෙනෙක් වෙති. එක් පුද්ගලයෙක් ධාරණය කළ ධර්මයේ අර්ථය ගැඹුරින් විමර්ශනය කරයි, එක් පුද්ගලයෙක් ධාරණය කළ ධර්මයේ අර්ථය ගැඹුරින් විමර්ශනය නොකරයි. යම් පුද්ගලයෙක් ධාරණය කළ ධර්මයේ අර්ථය ගැඹුරින් විමර්ශනය නොකරයිද, ඔහු ඒ අංගයෙන් නින්දා ලැබීමට සුදුස්සෙකි. යම් පුද්ගලයෙක් ධාරණය කළ ධර්මයේ අර්ථය ගැඹුරින් විමර්ශනය කරයිද, ඔහු ඒ අංගයෙන් ප්‍රශංසා ලැබීමට සුදුස්සෙකි.\n\nධාරණය කළ ධර්මයේ අර්ථය ගැඹුරින් විමර්ශනය කරන පුද්ගලයෝ දෙදෙනෙක් වෙති. එක් පුද්ගලයෙක් අර්ථය අවබෝධ කොට, ධර්මය අවබෝධ කොට, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටී; එක් පුද්ගලයෙක් අර්ථය අවබෝධ කොට, ධර්මය අවබෝධ කොට, ධර්මානුධර්ම ප්‍රතිපදාවේ නොපිහිටා සිටී. යම් පුද්ගලයෙක් අර්ථය අවබෝධ කොට, ධර්මය අවබෝධ කොට, ධර්මානුධර්ම ප්‍රතිපදාවේ නොපිහිටා සිටීද, ඔහු ඒ අංගයෙන් නින්දා ලැබීමට සුදුස්සෙකි. යම් පුද්ගලයෙක් අර්ථය අවබෝධ කොට, ධර්මය අවබෝධ කොට, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටීද, ඔහු ඒ අංගයෙන් ප්‍රශංසා ලැබීමට සුදුස්සෙකි.\n\nඅර්ථය අවබෝධ කොට, ධර්මය අවබෝධ කොට, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටින පුද්ගලයෝ දෙදෙනෙක් වෙති. එක් පුද්ගලයෙක් තමාගේ හිත පිණිස පමණක් පිළිපදී, අනුන්ගේ හිත පිණිස පිළිපදින්නේ නැත; එක් පුද්ගලයෙක් තමාගේ හිත පිණිසද, අනුන්ගේ හිත පිණිසද පිළිපදී. යම් පුද්ගලයෙක් තමාගේ හිත පිණිස පමණක් පිළිපදී, අනුන්ගේ හිත පිණිස පිළිපදින්නේ නැතිද, ඔහු ඒ අංගයෙන් නින්දා ලැබීමට සුදුස්සෙකි. යම් පුද්ගලයෙක් තමාගේ හිත පිණිසද, අනුන්ගේ හිත පිණිසද පිළිපදීද, ඔහු ඒ අංගයෙන් ප්‍රශංසා ලැබීමට සුදුස්සෙකි. මහණෙනි, මෙලෙස භික්ෂුවට පුද්ගලයෝ දෙයාකාරයෙන් අවබෝධ වෙති. මහණෙනි, මෙසේ භික්ෂුව පුද්ගලයන්ගේ උසස් පහත් බව දන්නා කෙනෙක් වෙයි. මහණෙනි, මේ සත් ධර්මයන්ගෙන් සමන්විත වූ භික්ෂුව දානයට සුදුසු වෙයි, ආගන්තුක සත්කාර ලැබීමට සුදුසු වෙයි, දක්ෂිණාවට සුදුසු වෙයි, වැඳ නමස්කාර කිරීමට සුදුසු වෙයි, ලෝකයාට අනුත්තර වූ පින් කෙතක් වෙයි.",
      "paliTitle": "Dhammaññūsuttaṃ",
      "englishTitle": "One Who Knows the Dhamma Sutta",
      "sinhalaTitle": "ධම්මඤ්ඤූ සූත්‍රය"
    },
    {
      "number": 69,
      "pali": "‘‘Yasmiṃ, bhikkhave, samaye devānaṃ tāvatiṃsānaṃ pāricchattako koviḷāro paṇḍupalāso hoti, attamanā, bhikkhave, devā tāvatiṃsā tasmiṃ samaye honti – ‘paṇḍupalāso dāni pāricchattako koviḷāro nacirasseva dāni pannapalāso bhavissatī’’’ti. ‘‘Yasmiṃ, bhikkhave, samaye devānaṃ tāvatiṃsānaṃ pāricchattako koviḷāro pannapalāso hoti, attamanā, bhikkhave, devā tāvatiṃsā tasmiṃ samaye honti – ‘pannapalāso dāni pāricchattako koviḷāro nacirasseva dāni jālakajāto bhavissatī’’’ti. ‘‘Yasmiṃ, bhikkhave, samaye devānaṃ tāvatiṃsānaṃ pāricchattako koviḷāro jālakajāto hoti, attamanā, bhikkhave, devā tāvatiṃsā tasmiṃ samaye honti – ‘jālakajāto dāni pāricchattako koviḷāro nacirasseva dāni khārakajāto bhavissatī’’’ti. ‘‘Yasmiṃ, bhikkhave, samaye devānaṃ tāvatiṃsānaṃ pāricchattako koviḷāro khārakajāto hoti, attamanā, bhikkhave, devā tāvatiṃsā tasmiṃ samaye honti – ‘khārakajāto dāni pāricchattako koviḷāro nacirasseva dāni kuṭumalakajāto [kuḍumalakajāto (sī. syā. pī.)] bhavissatī’’’ti. ‘‘Yasmiṃ, bhikkhave, samaye devānaṃ tāvatiṃsānaṃ pāricchattako koviḷāro kuṭumalakajāto hoti, attamanā, bhikkhave, devā tāvatiṃsā tasmiṃ samaye honti – ‘kuṭumalakajāto dāni pāricchattako koviḷāro nacirasseva dāni korakajāto [kokāsakajāto (sī. syā.), kosakajāto (ka.)] bhavissatī’’’ti. ‘‘Yasmiṃ, bhikkhave, samaye devānaṃ tāvatiṃsānaṃ pāricchattako koviḷāro korakajāto hoti, attamanā, bhikkhave, devā tāvatiṃsā tasmiṃ samaye honti – ‘korakajāto dāni pāricchattako koviḷāro nacirasseva dāni sabbaphāliphullo [sabbapāliphullo (sī. pī.)] bhavissatī’’’ti. ‘‘Yasmiṃ, bhikkhave, samaye devānaṃ tāvatiṃsānaṃ pāricchattako koviḷāro sabbaphāliphullo hoti, attamanā, bhikkhave, devā tāvatiṃsā pāricchattakassa koviḷārassa mūle dibbe cattāro māse pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārenti. ‘‘Sabbaphāliphullassa kho pana, bhikkhave, pāricchattakassa koviḷārassa samantā paññāsayojanāni ābhāya phuṭaṃ hoti, anuvātaṃ yojanasataṃ gandho gacchati, ayamānubhāvo pāricchattakassa koviḷārassa. ‘‘Evamevaṃ kho, bhikkhave, yasmiṃ samaye ariyasāvako agārasmā anagāriyaṃ pabbajjāya ceteti, paṇḍupalāso, bhikkhave, ariyasāvako tasmiṃ samaye hoti devānaṃva tāvatiṃsānaṃ pāricchattako koviḷāro. ‘‘Yasmiṃ, bhikkhave, samaye ariyasāvako kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito hoti, pannapalāso, bhikkhave, ariyasāvako tasmiṃ samaye hoti devānaṃva tāvatiṃsānaṃ pāricchattako koviḷāro. ‘‘Yasmiṃ, bhikkhave, samaye ariyasāvako vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati, jālakajāto, bhikkhave, ariyasāvako tasmiṃ samaye hoti devānaṃva tāvatiṃsānaṃ pāricchattako koviḷāro. ‘‘Yasmiṃ, bhikkhave, samaye ariyasāvako vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati, khārakajāto, bhikkhave, ariyasāvako tasmiṃ samaye hoti devānaṃva tāvatiṃsānaṃ pāricchattako koviḷāro. ‘‘Yasmiṃ, bhikkhave, samaye ariyasāvako pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati, kuṭumalakajāto, bhikkhave, ariyasāvako tasmiṃ samaye hoti devānaṃva tāvatiṃsānaṃ pāricchattako koviḷāro. ‘‘Yasmiṃ, bhikkhave, samaye ariyasāvako sukhassa ca pahānā dukkhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati, korakajāto, bhikkhave, ariyasāvako tasmiṃ samaye hoti devānaṃva tāvatiṃsānaṃ pāricchattako koviḷāro. ‘‘Yasmiṃ, bhikkhave, samaye ariyasāvako āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati, sabbaphāliphullo, bhikkhave, ariyasāvako tasmiṃ samaye hoti devānaṃva tāvatiṃsānaṃ pāricchattako koviḷāro. ‘‘Tasmiṃ, bhikkhave, samaye bhummā devā saddamanussāventi – ‘eso itthannāmo āyasmā itthannāmassa āyasmato saddhivihāriko amukamhā gāmā vā nigamā vā agārasmā anagāriyaṃ pabbajito āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Bhummānaṃ devānaṃ saddaṃ sutvā cātumahārājikā devā…pe… tāvatiṃsā devā… yāmā devā… tusitā devā… nimmānaratī devā… paranimmitavasavattī devā… brahmakāyikā devā saddamanussāventi – ‘eso itthannāmo āyasmā itthannāmassa āyasmato saddhivihāriko amukamhā gāmā vā nigamā vā agārasmā anagāriyaṃ pabbajito āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Itiha tena khaṇena tena muhuttena yāva brahmalokā saddo [sādhukārasaddo (sī. aṭṭha., ka. aṭṭha.)] abbhuggacchati, ayamānubhāvo khīṇāsavassa bhikkhuno’’ti. Pañcamaṃ.",
      "english": "Monks, at the time when the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods has yellowing leaves, the Tāvatiṃsa gods are pleased at that time, thinking: ‘Now the Pāricchattaka koviḷāra tree with yellowing leaves will soon have shedding leaves.’ Monks, at the time when the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods has shedding leaves, the Tāvatiṃsa gods are pleased at that time, thinking: ‘Now the Pāricchattaka koviḷāra tree with shedding leaves will soon have budding leaves.’ Monks, at the time when the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods has budding leaves, the Tāvatiṃsa gods are pleased at that time, thinking: ‘Now the Pāricchattaka koviḷāra tree with budding leaves will soon have tender shoots.’ Monks, at the time when the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods has tender shoots, the Tāvatiṃsa gods are pleased at that time, thinking: ‘Now the Pāricchattaka koviḷāra tree with tender shoots will soon have young buds.’ Monks, at the time when the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods has young buds, the Tāvatiṃsa gods are pleased at that time, thinking: ‘Now the Pāricchattaka koviḷāra tree with young buds will soon have bursting buds.’ Monks, at the time when the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods has bursting buds, the Tāvatiṃsa gods are pleased at that time, thinking: ‘Now the Pāricchattaka koviḷāra tree with bursting buds will soon be in full bloom.’ Monks, at the time when the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods is in full bloom, the Tāvatiṃsa gods, with minds full of joy, attend and delight themselves at the base of the Pāricchattaka koviḷāra tree for four divine months, fully endowed with the five strands of sensual pleasure. Moreover, monks, when the Pāricchattaka koviḷāra tree is in full bloom, its radiance extends for fifty leagues all around, and its fragrance carries for a hundred leagues downwind. Such is the power of the Pāricchattaka koviḷāra tree.\n\nIn the same way, monks, at the time when a noble disciple resolves to go forth from the home life into homelessness, that noble disciple is like the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods with yellowing leaves. Monks, at the time when a noble disciple shaves off his hair and beard, puts on saffron robes, and has gone forth from the home life into homelessness, that noble disciple is like the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods with shedding leaves. Monks, at the time when a noble disciple, quite secluded from sensual pleasures, secluded from unwholesome states, with applied thought and sustained thought, born of seclusion, imbued with rapture and pleasure, enters and remains in the first jhāna, that noble disciple is like the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods with budding leaves. Monks, at the time when a noble disciple, with the subsiding of applied thought and sustained thought, with internal assurance and unification of mind, without applied thought and sustained thought, born of concentration, imbued with rapture and pleasure, enters and remains in the second jhāna, that noble disciple is like the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods with tender shoots. Monks, at the time when a noble disciple, with the fading away of rapture, dwells equanimous, mindful and clearly comprehending, and experiences pleasure with the body, of which the noble ones declare: ‘He dwells equanimous, mindful, and blissful,’ he enters and remains in the third jhāna, that noble disciple is like the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods with young buds. Monks, at the time when a noble disciple, with the abandoning of pleasure and pain, and with the prior passing away of joy and sorrow, enters and remains in the fourth jhāna, which is neither painful nor pleasant and is purified by equanimity and mindfulness, that noble disciple is like the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods with bursting buds. Monks, at the time when a noble disciple, through the destruction of the taints, personally realizes and enters and remains in the taintless liberation of mind and liberation by wisdom in this very life, that noble disciple is like the Pāricchattaka koviḷāra tree of the Tāvatiṃsa gods in full bloom. At that time, monks, the earth deities proclaim with a loud voice: ‘The venerable one named so-and-so, the companion in the holy life of the venerable so-and-so, who went forth from the home life into homelessness from such-and-such a village or town, through the destruction of the taints, has personally realized and entered and remains in the taintless liberation of mind and liberation by wisdom in this very life!’\n\nHaving heard the sound of the Earth Devas, the Devas of the Four Great Kings, the Tāvatiṃsa Devas, the Yāma Devas, the Tusita Devas, the Nimmānaratī Devas, the Paranimmitavasavattī Devas, and the Brahma-group Devas proclaim this sound: \"This venerable one, of such a name, a fellow-dweller of the venerable one of such a name, having gone forth from such-and-such a village or town, from home into homelessness, through the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, and now dwells having attained it.\" Thus, at that very moment, at that instant, the sound ascends even up to the Brahma world. Such is the wondrous power of a bhikkhu whose taints are destroyed.",
      "sinhala": "මහණෙනි, යම් සමයෙක තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය කහ පැහැති පත්‍ර ඇතිවී (ජරාවට පත්වී) තිබෙයි ද, මහණෙනි, එකල්හි තව්තිසා දෙවියෝ සතුටු වෙති – ‘දැන් මේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි පත්‍ර කහ පැහැ වී තිබෙන්නේ, වැඩි කල් නොගොස්ම පත්‍ර හැලී යනු ඇතැ’යි.\n\nමහණෙනි, යම් සමයෙක තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය පත්‍ර හැලී තිබෙයි ද, මහණෙනි, එකල්හි තව්තිසා දෙවියෝ සතුටු වෙති – ‘දැන් මේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි පත්‍ර හැලී තිබෙන්නේ, වැඩි කල් නොගොස්ම ලා දලු ලනු ඇතැ’යි.\n\nමහණෙනි, යම් සමයෙක තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය ලා දලු ඇතිවී තිබෙයි ද, මහණෙනි, එකල්හි තව්තිසා දෙවියෝ සතුටු වෙති – ‘දැන් මේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි ලා දලු ඇතිවී තිබෙන්නේ, වැඩි කල් නොගොස්ම මෝරා වැඩුණු පත්‍ර ඇතිවනු ඇතැ’යි.\n\nමහණෙනි, යම් සමයෙක තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය මෝරා වැඩුණු පත්‍ර ඇතිවී තිබෙයි ද, මහණෙනි, එකල්හි තව්තිසා දෙවියෝ සතුටු වෙති – ‘දැන් මේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි මෝරා වැඩුණු පත්‍ර ඇතිවී තිබෙන්නේ, වැඩි කල් නොගොස්ම පොහොට්ටු හටගනු ඇතැ’යි.\n\nමහණෙනි, යම් සමයෙක තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය පොහොට්ටු ඇතිවී තිබෙයි ද, මහණෙනි, එකල්හි තව්තිසා දෙවියෝ සතුටු වෙති – ‘දැන් මේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි පොහොට්ටු ඇතිවී තිබෙන්නේ, වැඩි කල් නොගොස්ම මල් පුපුරනු ඇතැ’යි.\n\nමහණෙනි, යම් සමයෙක තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය මල් පුපුරාගෙන ඒමෙන් යුක්තව තිබෙයි ද, මහණෙනි, එකල්හි තව්තිසා දෙවියෝ සතුටු වෙති – ‘දැන් මේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි මල් පුපුරාගෙන ඒමෙන් යුක්තව තිබෙන්නේ, වැඩි කල් නොගොස්ම මුළුමනින්ම පිපී යනු ඇතැ’යි.\n\nමහණෙනි, යම් සමයෙක තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය මුළුමනින්ම පිපී තිබෙයි ද, එකල්හි මහණෙනි, තව්තිසා දෙවියෝ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය පාමුල දිව්‍යමය වූ පස්කම් ගුණයන්ගෙන් පරිපූර්ණව, එකට එක්වී, සිවු මසක් නිරතුරු සැප විඳිති.\n\nමහණෙනි, මුළුමනින්ම පිපී ඇති ඒ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි ආලෝකය වටසතරින් යොදුන් පනහක් (අවටට) පැතිරෙයි. සුළඟ පිනා යන දිශාවට සුවඳ යොදුන් සියයක් දුරට යයි. මෙය පාරිච්ඡත්තක කෝවිලාර වෘක්ෂයෙහි ආනුභාවය වේ.\n\nමහණෙනි, එලෙසින්ම යම් සමයෙක ආර්ය ශ්‍රාවකයෙක් ගිහිගෙයින් නික්ම අනගාරික (පැවිදි) බවට පත්වීමට චේතනා කරයි ද, මහණෙනි, ඒ සමයෙහි එම ආර්ය ශ්‍රාවකයා, තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය කහ පැහැති පත්‍ර ඇතිවී ජරාවට පත්වීම හා සමාන වෙයි.\n\nමහණෙනි, යම් සමයෙක ආර්ය ශ්‍රාවකයා කේශයන් හා රැවුල මුදාහැර, කහවත් පොරවා, ගිහිගෙයින් නික්ම අනගාරික බවට පත්වෙයි ද, මහණෙනි, ඒ සමයෙහි එම ආර්ය ශ්‍රාවකයා, තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය පත්‍ර හැලී තිබීම හා සමාන වෙයි.\n\nමහණෙනි, යම් සමයෙක ආර්ය ශ්‍රාවකයා කාමයන්ගෙන් වෙන්වී, පාපී අකුසල ධර්මයන්ගෙන් වෙන්වී, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛයෙන් යුක්ත වූ පළමු ධ්‍යානයට එළඹ වාසය කරයි ද, මහණෙනි, ඒ සමයෙහි එම ආර්ය ශ්‍රාවකයා, තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය ලා දලු හටගැනීම හා සමාන වෙයි.\n\nමහණෙනි, යම් සමයෙක ආර්ය ශ්‍රාවකයා විතර්ක විචාරයන් සංසිඳවීමෙන්, තමා තුළ පැහැදීමෙන්, සිතේ එකඟතාවයකින්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුඛයෙන් යුක්ත වූ දෙවෙනි ධ්‍යානයට එළඹ වාසය කරයි ද, මහණෙනි, ඒ සමයෙහි එම ආර්ය ශ්‍රාවකයා, තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය මෝරා වැඩුණු පත්‍ර ඇතිවීම හා සමාන වෙයි.\n\nමහණෙනි, යම් සමයෙක ආර්ය ශ්‍රාවකයා ප්‍රීතියෙන්ද, නොඇලීමෙන්, උපේක්ෂාවෙන් යුක්තව වාසය කරමින්, සිහි ඇතිව, මනා නුවණින් යුක්තව, සුවසේ විහරණය කරයි. ආර්යයන් වහන්සේලා ‘උපේක්ෂා ඇතිව, සිහි ඇතිව, සුවසේ විහරණය කරයි’ යැයි ප්‍රකාශ කරන ඒ තෙවෙනි ධ්‍යානයට එළඹ වාසය කරයි ද, මහණෙනි, ඒ සමයෙහි එම ආර්ය ශ්‍රාවකයා, තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය පොහොට්ටු හටගැනීම හා සමාන වෙයි.\n\nමහණෙනි, යම් සමයෙක ආර්ය ශ්‍රාවකයා සුවයද දුරුකිරීමෙන්, දුකද දුරුකිරීමෙන්, පළමුවෙන් ම සොම්නස් දොම්නස් දෙක නැතිවීමෙන්, දුක් රහිත වූ, සුව රහිත වූ, උපේක්ෂාවෙන් යුක්ත වූ සිහිය පිරිසිදු වූ සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරයි ද, මහණෙනි, ඒ සමයෙහි එම ආර්ය ශ්‍රාවකයා, තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය මල් පුපුරාගෙන ඒමෙන් යුක්තව තිබීම හා සමාන වෙයි.\n\nමහණෙනි, යම් සමයෙක ආර්ය ශ්‍රාවකයා ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රවයන් රහිත වූ, චේතෝවිමුක්තිය, ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමාගේ උසස් ඥානයෙන් අවබෝධ කොට, සාක්ෂාත් කොට, සම්පූර්ණ කොට වාසය කරයි ද, මහණෙනි, ඒ සමයෙහි එම ආර්ය ශ්‍රාවකයා, තව්තිසා දෙවියන්ගේ පාරිච්ඡත්තක කෝවිලාර වෘක්ෂය මුළුමනින්ම පිපී තිබීම හා සමාන වෙයි.\n\nමහණෙනි, ඒ සමයෙහි භූමාටු දෙවියෝ (මෙසේ) ශබ්ද නගති – ‘අසවල් ගමකින් හෝ නියම්ගමකින් හෝ ගිහිගෙයින් නික්ම අනගාරික බවට පත්වූ, අසවල් නම් ඇති ආයුෂ්මත් ස්ථවිරයන්ගේ සද්ධිවිහාරික වූ, අසවල් නම් ඇති මේ ආයුෂ්මත් ස්ථවිරයන් වහන්සේ ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය සහ ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමන්ගේ උසස් ඥානයෙන් අවබෝධ කොට, සාක්ෂාත් කොට, සම්පූර්ණ කොට වාසය කරති’ යි.\n\nපොළොවේ වෙසෙන දෙවියන්ගේ ශබ්දය අසා, සතරවරම් දෙවියෝ ද, තව්තිසා දෙවියෝ ද, යාමා දෙවියෝ ද, තුසිත දෙවියෝ ද, නිර්මාණරතී දෙවියෝ ද, පරනිම්මිතවසවත්ති දෙවියෝ ද, බ්‍රහ්මකායික දෙවියෝ ද යන මේ සියලු දෙවියෝ මේ ශබ්දය පතුරුවා හැරියහ – ‘මේ අසවල් නමක් ඇති ආයුෂ්මත් ස්වාමීන් වහන්සේ, අසවල් නමක් ඇති ආයුෂ්මත් ස්වාමීන් වහන්සේ නමකගේ සද්ධිවිහාරිකයෙකි. උන්වහන්සේ අසවල් ගමකින් හෝ නියම්ගමකින් ගිහිගෙන් නික්ම මහණ වී, ආශ්‍රවයන්ගේ ක්ෂය වීම නිසා, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය ද ප්‍රඥාවිමුක්තිය ද මේ ආත්මභාවයේදීම තමන් විසින්ම විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කොට වාසය කරයි.’\n\nඑලෙසින් ඒ ක්ෂණයෙහි ද, ඒ මොහොතෙහි ද, බ්‍රහ්ම ලෝකය දක්වා සාධුකාර ශබ්දය ඉහළට නැඟී යයි. මේ ක්ෂීණාශ්‍රව භික්ෂුවකගේ ආනුභාවයයි.",
      "paliTitle": "Pāricchattakasuttaṃ",
      "englishTitle": "The Discourse on the Coral Tree",
      "sinhalaTitle": "පාරිච්ඡත්තක සූත්‍රය"
    },
    {
      "number": 70,
      "pali": "Atha kho āyasmato sāriputtassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘kiṃ nu kho, bhikkhu, sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyyā’’ti? Atha kho āyasmato sāriputtassa etadahosi – ‘‘satthāraṃ kho, bhikkhu, sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyya. Dhammaṃ kho, bhikkhu…pe… saṅghaṃ kho, bhikkhu…pe… sikkhaṃ kho, bhikkhu…pe… samādhiṃ kho, bhikkhu…pe… appamādaṃ kho, bhikkhu…pe… paṭisanthāraṃ kho, bhikkhu sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyyā’’ti. Atha kho āyasmato sāriputtassa etadahosi – ‘‘ime kho me dhammā parisuddhā pariyodātā, yaṃnūnāhaṃ ime dhamme gantvā [gahetvā (ka.)] bhagavato āroceyyaṃ. Evaṃ me ime dhammā parisuddhā ceva bhavissanti parisuddhasaṅkhātatarā ca. Seyyathāpi nāma puriso suvaṇṇanikkhaṃ adhigaccheyya parisuddhaṃ pariyodātaṃ. Tassa evamassa – ‘ayaṃ kho me suvaṇṇanikkho parisuddho pariyodāto, yaṃnūnāhaṃ imaṃ suvaṇṇanikkhaṃ gantvā [gahetvā (ka.)] kammārānaṃ dasseyyaṃ. Evaṃ me ayaṃ suvaṇṇanikkho sakammāragato parisuddho ceva bhavissati parisuddhasaṅkhātataro ca. Evamevaṃ [kho (ka.)] me ime dhammā parisuddhā pariyodātā, yaṃnūnāhaṃ ime dhamme gantvā [gahetvā (ka.)] bhagavato āroceyyaṃ. Evaṃ me ime dhammā parisuddhā ceva bhavissanti parisuddhasaṅkhātatarā cā’’’ti. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘Idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘kiṃ nu kho, bhikkhu, sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyyā’ti? Atha kho tassa mayhaṃ, bhante, etadahosi – ‘satthāraṃ kho, bhikkhu, sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyya. Dhammaṃ kho, bhikkhu …pe… paṭisanthāraṃ kho, bhikkhu sakkatvā…pe… kusalaṃ bhāveyyā’ti. Atha kho tassa mayhaṃ, bhante, etadahosi – ‘ime kho me dhammā parisuddhā pariyodātā, yaṃnūnāhaṃ ime dhamme gantvā bhagavato āroceyyaṃ. Evaṃ me ime dhammā parisuddhā ceva bhavissanti parisuddhasaṅkhātatarā ca. Seyyathāpi nāma puriso suvaṇṇanikkhaṃ adhigaccheyya parisuddhaṃ pariyodātaṃ. Tassa evamassa – ayaṃ kho me suvaṇṇanikkho parisuddho pariyodāto, yaṃnūnāhaṃ imaṃ suvaṇṇanikkhaṃ gantvā kammārānaṃ dasseyyaṃ. Evaṃ me ayaṃ suvaṇṇanikkho sakammāragato parisuddho ceva bhavissati parisuddhasaṅkhātataro ca. Evamevaṃ me ime dhammā parisuddhā pariyodātā, yaṃnūnāhaṃ ime dhamme gantvā bhagavato āroceyyaṃ. Evaṃ me ime dhammā parisuddhā ceva bhavissanti parisuddhasaṅkhātatarā cā’’’ti. ‘‘Sādhu sādhu, sāriputta! Satthāraṃ kho, sāriputta, bhikkhu sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyya. Dhammaṃ kho, sāriputta, bhikkhu sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyya. Saṅghaṃ kho…pe… sikkhaṃ kho… samādhiṃ kho… appamādaṃ kho… paṭisanthāraṃ kho, sāriputta, bhikkhu sakkatvā garuṃ katvā upanissāya viharanto akusalaṃ pajaheyya, kusalaṃ bhāveyyā’’ti. Evaṃ vutte āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘imassa kho ahaṃ, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmi. So vata, bhante, bhikkhu satthari agāravo dhamme sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari agāravo dhammepi so agāravo’’. ‘‘So vata, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghepi so agāravo. ‘‘So vata, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāyapi so agāravo. ‘‘So vata, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismiṃ sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismimpi so agāravo. ‘‘So vata, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismiṃ agāravo appamāde sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismiṃ agāravo appamādepi so agāravo. ‘‘So vata, bhante, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismiṃ agāravo appamāde agāravo paṭisanthāre sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari agāravo…pe… appamāde agāravo paṭisanthārepi so agāravo. ‘‘So vata, bhante, bhikkhu satthari sagāravo dhamme agāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari sagāravo dhammepi so sagāravo…pe…. ‘‘So vata, bhante, bhikkhu satthari sagāravo…pe. … appamāde sagāravo paṭisanthāre agāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, bhante, bhikkhu satthari sagāravo…pe… appamāde sagāravo paṭisanthārepi so sagāravo. ‘‘So vata, bhante, bhikkhu satthari sagāravo dhammepi sagāravo bhavissatīti ṭhānametaṃ vijjati. Yo so, bhante, bhikkhu satthari sagāravo dhammepi so sagāravo…pe…. ‘‘So vata, bhante, bhikkhu satthari sagāravo…pe… appamāde sagāravo paṭisanthārepi sagāravo bhavissatīti ṭhānametaṃ vijjati. Yo so, bhante, bhikkhu satthari sagāravo dhamme sagāravo saṅghe sagāravo sikkhāya sagāravo samādhismiṃ sagāravo appamāde sagāravo paṭisanthārepi so sagāravo’’ti. ‘‘Imassa kho ahaṃ, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmī’’ti. ‘‘Sādhu sādhu, sāriputta! Sādhu kho tvaṃ, sāriputta, imassa mayā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāsi. So vata, sāriputta, bhikkhu satthari agāravo dhamme sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati…pe… yo so, sāriputta, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismiṃ agāravo appamādepi so agāravo. ‘‘So vata, sāriputta, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismiṃ agāravo appamāde agāravo paṭisanthāre sagāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, sāriputta, bhikkhu satthari agāravo dhamme agāravo saṅghe agāravo sikkhāya agāravo samādhismiṃ agāravo appamāde agāravo paṭisanthārepi so agāravo. ‘‘So vata, sāriputta, bhikkhu satthari sagāravo dhamme agāravo bhavissatīti netaṃ ṭhānaṃ vijjati… pe… yo so, sāriputta, bhikkhu satthari sagāravo dhammepi so sagāravo …pe…. ‘‘So vata, sāriputta, bhikkhu satthari sagāravo dhamme sagāravo…pe… appamāde sagāravo paṭisanthāre agāravo bhavissatīti netaṃ ṭhānaṃ vijjati. Yo so, sāriputta, bhikkhu satthari sagāravo… pe… appamāde sagāravo paṭisanthārepi so sagāravo. ‘‘So vata, sāriputta, bhikkhu satthari sagāravo dhammepi sagāravo bhavissatīti ṭhānametaṃ vijjati. Yo so, sāriputta, bhikkhu satthari sagāravo dhammepi so sagāravo…pe…. ‘‘So vata, sāriputta, bhikkhu satthari sagāravo…pe… appamāde sagāravo paṭisanthārepi so sagāravo bhavissatīti ṭhānametaṃ vijjati. Yo so, sāriputta, bhikkhu satthari sagāravo…pe… appamāde sagāravo paṭisanthārepi so sagāravo’’ti. ‘‘Imassa kho, sāriputta, mayā saṃkhittena bhāsitassa evaṃ vitthārena attho daṭṭhabbo’’ti. Chaṭṭhaṃ.",
      "english": "Then, indeed, as the venerable Sāriputta was secluded and withdrawn, such a thought arose in his mind: \"What indeed, monks, by living respectfully, reverentially, and relying upon, would one abandon unskillful states and develop skillful states?\"\n\nThen, indeed, it occurred to the venerable Sāriputta: \"Monks, by living respectfully, reverentially, and relying upon the Teacher, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon the Dhamma, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon the Saṅgha, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon the Training, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon Concentration, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon Heedfulness, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon Hospitality, one would abandon unskillful states and develop skillful states.\" Then, indeed, it occurred to the venerable Sāriputta: \"These Dhamma principles of mine are perfectly pure and thoroughly cleansed. What if I were to take these Dhamma principles and declare them to the Fortunate One? Thus, these Dhamma principles of mine will become pure and be considered even more thoroughly purified. Just as if a man were to obtain a perfectly pure and thoroughly cleansed gold nugget. It would occur to him: 'This gold nugget of mine is perfectly pure and thoroughly cleansed. What if I were to take this gold nugget and show it to the goldsmiths? Thus, this gold nugget of mine, having gone to the goldsmiths, will become pure and be considered even more thoroughly purified.' Even so, these Dhamma principles of mine are perfectly pure and thoroughly cleansed. What if I were to take these Dhamma principles and declare them to the Fortunate One? Thus, these Dhamma principles of mine will become pure and be considered even more thoroughly purified.\"\n\nThen, indeed, the venerable Sāriputta, having risen from his seclusion in the evening, approached the Fortunate One; having approached and respectfully saluted the Fortunate One, he sat down to one side. Seated to one side, the venerable Sāriputta then spoke to the Fortunate One thus: \"Here, venerable sir, while I was secluded and withdrawn, such a thought arose in my mind: 'What indeed, monks, by living respectfully, reverentially, and relying upon, would one abandon unskillful states and develop skillful states?' Then, venerable sir, it occurred to me: 'Monks, by living respectfully, reverentially, and relying upon the Teacher, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon the Dhamma, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon the Saṅgha, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon the Training, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon Concentration, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon Heedfulness, one would abandon unskillful states and develop skillful states. Monks, by living respectfully, reverentially, and relying upon Hospitality, one would abandon unskillful states and develop skillful states.' Then, venerable sir, it occurred to me: 'These Dhamma principles of mine are perfectly pure and thoroughly cleansed. What if I were to take these Dhamma principles and declare them to the Fortunate One? Thus, these Dhamma principles of mine will become pure and be considered even more thoroughly purified. Just as if a man were to obtain a perfectly pure and thoroughly cleansed gold nugget. It would occur to him: \"This gold nugget of mine is perfectly pure and thoroughly cleansed. What if I were to take this gold nugget and show it to the goldsmiths? Thus, this gold nugget of mine, having gone to the goldsmiths, will become pure and be considered even more thoroughly purified.\" Even so, these Dhamma principles of mine are perfectly pure and thoroughly cleansed. What if I were to take these Dhamma principles and declare them to the Fortunate One? Thus, these Dhamma principles of mine will become pure and be considered even more thoroughly purified.'\"\n\n\"Excellent, excellent, Sāriputta! Sāriputta, indeed, by living respectfully, reverentially, and relying upon the Teacher, a monk would abandon unskillful states and develop skillful states. Sāriputta, indeed, by living respectfully, reverentially, and relying upon the Dhamma, a monk would abandon unskillful states and develop skillful states. Sāriputta, indeed, by living respectfully, reverentially, and relying upon the Saṅgha, a monk would abandon unskillful states and develop skillful states. Sāriputta, indeed, by living respectfully, reverentially, and relying upon the Training, a monk would abandon unskillful states and develop skillful states. Sāriputta, indeed, by living respectfully, reverentially, and relying upon Concentration, a monk would abandon unskillful states and develop skillful states. Sāriputta, indeed, by living respectfully, reverentially, and relying upon Heedfulness, a monk would abandon unskillful states and develop skillful states. Sāriputta, indeed, by living respectfully, reverentially, and relying upon Hospitality, a monk would abandon unskillful states and develop skillful states.\"\n\nWhen this was said, the venerable Sāriputta spoke to the Fortunate One thus: \"Venerable sir, I understand the meaning of this brief statement by the Fortunate One in this detailed way: 'Venerable sir, it is not possible that a monk who is disrespectful towards the Teacher would be respectful towards the Dhamma. Indeed, venerable sir, whoever is disrespectful towards the Teacher is also disrespectful towards the Dhamma.' 'Venerable sir, it is not possible that a monk who is disrespectful towards the Teacher and disrespectful towards the Dhamma would be respectful towards the Saṅgha. Indeed, venerable sir, whoever is disrespectful towards the Teacher and disrespectful towards the Dhamma is also disrespectful towards the Saṅgha.' 'Venerable sir, it is not possible that a monk who is disrespectful towards the Teacher, disrespectful towards the Dhamma, and disrespectful towards the Saṅgha would be respectful towards the Training. Indeed, venerable sir, whoever is disrespectful towards the Teacher, disrespectful towards the Dhamma, and disrespectful towards the Saṅgha is also disrespectful towards the Training.' 'Venerable sir, it is not possible that a monk who is disrespectful towards the Teacher, disrespectful towards the Dhamma, disrespectful towards the Saṅgha, and disrespectful towards the Training would be respectful towards Concentration.'\"\n\nVenerable Sir, a monk who lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, then he also lacks reverence for concentration. It is not possible, Venerable Sir, that a monk who lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, and lacks reverence for concentration, would yet have reverence for heedfulness. A monk who lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, lacks reverence for concentration, then he also lacks reverence for heedfulness. It is not possible, Venerable Sir, that a monk who lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, lacks reverence for concentration, and lacks reverence for heedfulness, would yet have reverence for hospitality. A monk who lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, lacks reverence for concentration, lacks reverence for heedfulness, then he also lacks reverence for hospitality.\n\nIt is not possible, Venerable Sir, that a monk who has reverence for the Teacher would yet lack reverence for the Dhamma. If a monk has reverence for the Teacher, then he also has reverence for the Dhamma, for the Sangha, for the training, for concentration, for heedfulness, and for hospitality. It is not possible, Venerable Sir, that a monk who has reverence for the Teacher, has reverence for the Dhamma, for the Sangha, for the training, for concentration, and for heedfulness, would yet lack reverence for hospitality. If a monk has reverence for the Teacher, has reverence for the Dhamma, has reverence for the Sangha, has reverence for the training, has reverence for concentration, has reverence for heedfulness, then he also has reverence for hospitality. It is possible, Venerable Sir, that a monk who has reverence for the Teacher would also have reverence for the Dhamma. If a monk has reverence for the Teacher, then he also has reverence for the Dhamma, for the Sangha, for the training, for concentration, for heedfulness, and for hospitality. It is possible, Venerable Sir, that a monk who has reverence for the Teacher, has reverence for the Dhamma, for the Sangha, for the training, for concentration, and for heedfulness, would also have reverence for hospitality. If a monk has reverence for the Teacher, has reverence for the Dhamma, has reverence for the Sangha, has reverence for the training, has reverence for concentration, has reverence for heedfulness, then he also has reverence for hospitality.\n\n“Venerable Sir, I understand the meaning of this brief statement by the Blessed One in such detail.”\n\n“Excellent, excellent, Sāriputta! Well said, Sāriputta, that you understand the meaning of this brief statement of mine in such detail. It is not possible, Sāriputta, that a monk who lacks reverence for the Teacher would yet have reverence for the Dhamma. If a monk lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, lacks reverence for concentration, then he also lacks reverence for heedfulness. It is not possible, Sāriputta, that a monk who lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, lacks reverence for concentration, and lacks reverence for heedfulness, would yet have reverence for hospitality. If a monk lacks reverence for the Teacher, lacks reverence for the Dhamma, lacks reverence for the Sangha, lacks reverence for the training, lacks reverence for concentration, lacks reverence for heedfulness, then he also lacks reverence for hospitality. It is not possible, Sāriputta, that a monk who has reverence for the Teacher would yet lack reverence for the Dhamma. If a monk has reverence for the Teacher, then he also has reverence for the Dhamma, for the Sangha, for the training, for concentration, for heedfulness, and for hospitality. It is not possible, Sāriputta, that a monk who has reverence for the Teacher, has reverence for the Dhamma, for the Sangha, for the training, for concentration, and for heedfulness, would yet lack reverence for hospitality. If a monk has reverence for the Teacher, has reverence for the Dhamma, for the Sangha, for the training, for concentration, for heedfulness, then he also has reverence for hospitality. It is possible, Sāriputta, that a monk who has reverence for the Teacher would also have reverence for the Dhamma. If a monk has reverence for the Teacher, then he also has reverence for the Dhamma, for the Sangha, for the training, for concentration, for heedfulness, and for hospitality. It is possible, Sāriputta, that a monk who has reverence for the Teacher, has reverence for the Dhamma, for the Sangha, for the training, for concentration, and for heedfulness, would also have reverence for hospitality. If a monk has reverence for the Teacher, has reverence for the Dhamma, has reverence for the Sangha, has reverence for the training, has reverence for concentration, has reverence for heedfulness, then he also has reverence for hospitality.”\n“Sāriputta, the meaning of this brief statement by me should be understood in such detail.”",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ශ්‍රී‍්‍ර_සාරිපුත්ත_තෙරුන්ට හුදෙකලා වූවිට, භාවනා කරන කල්හි, මෙවැනි සිතුවිල්ලක් සිතට නැඟුණි: \"භික්ෂුවක් කුමක් සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේදැයි?\" එසමයෙහි ආයුෂ්මත් ශ්‍රී‍්‍ර_සාරිපුත්ත_තෙරුන්ට මෙසේ සිතුණි: \"භික්ෂුවක් ශාස්තෘන් වහන්සේ සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේය. භික්ෂුව ධර්මය සක්කර කොට... භික්ෂුව සංඝයා සක්කර කොට... භික්ෂුව ශික්ෂාව සක්කර කොට... භික්ෂුව සමාධිය සක්කර කොට... භික්ෂුව අප්‍රමාදය සක්කර කොට... භික්ෂුව ප්‍රතිසන්ථාරය සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේය.\"\n\nඑසමයෙහි ආයුෂ්මත් ශ්‍රී‍්‍ර_සාරිපුත්ත_තෙරුන්ට මෙසේ සිතුණි: \"මාගේ මේ ධර්මයන් පිරිසිදුය, මනා සේ විශුද්ධය. දැන් මා මේ ධර්මයන් රැගෙන භාග්‍යවතුන් වහන්සේට දන්වා සිටියහොත් හොඳය. මෙසේ මාගේ මේ ධර්මයන් පිරිසිදු වනු ඇත, තවද වඩාත් පිරිසිදු යයි සැලකෙනු ඇත. යම් සේ පුරුෂයෙක් පිරිසිදු වූ, මනා සේ විශුද්ධ වූ රන්කාසියක් සොයා ගන්නේය. ඔහුට මෙසේ සිතේ: 'මාගේ මේ රන්කාසිය පිරිසිදුය, මනා සේ විශුද්ධය. දැන් මා මේ රන්කාසිය රැගෙන රන්කරුවන්ට පෙන්වුවහොත් හොඳය. මෙසේ මාගේ මේ රන්කාසිය රන්කරුවන් වෙත ගෙන ගිය විට පිරිසිදු වනු ඇත, තවද වඩාත් පිරිසිදු යයි සැලකෙනු ඇත.' එපරිද්දෙන්ම මාගේ මේ ධර්මයන් පිරිසිදුය, මනා සේ විශුද්ධය. දැන් මා මේ ධර්මයන් රැගෙන භාග්‍යවතුන් වහන්සේට දන්වා සිටියහොත් හොඳය. මෙසේ මාගේ මේ ධර්මයන් පිරිසිදු වනු ඇත, තවද වඩාත් පිරිසිදු යයි සැලකෙනු ඇත.\"\n\nඉන්පසු ආයුෂ්මත් ශ්‍රී‍්‍ර_සාරිපුත්ත_තෙරුන් සවස් කාලයෙහි හුදෙකලා වූ භාවනාවෙන් නැඟිට, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ ආයුෂ්මත් ශ්‍රී‍්‍ර_සාරිපුත්ත_තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, මෙහිදී මට හුදෙකලා වූවිට, භාවනා කරන කල්හි, මෙවැනි සිතුවිල්ලක් පහළ විය: 'භික්ෂුවක් කුමක් සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේදැයි?' ස්වාමීනි, ඉන්පසු මට මෙසේ සිතුණි: 'භික්ෂුවක් ශාස්තෘන් වහන්සේ සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේය. භික්ෂුව ධර්මය... ආදී වශයෙන්... ප්‍රතිසන්ථාරය සක්කර කොට... කුසල් වඩන්නේය.' ස්වාමීනි, ඉන්පසු මට මෙසේ සිතුණි: 'මාගේ මේ ධර්මයන් පිරිසිදුය, මනා සේ විශුද්ධය. දැන් මා මේ ධර්මයන් රැගෙන භාග්‍යවතුන් වහන්සේට දන්වා සිටියහොත් හොඳය. මෙසේ මාගේ මේ ධර්මයන් පිරිසිදු වනු ඇත, තවද වඩාත් පිරිසිදු යයි සැලකෙනු ඇත. යම් සේ පුරුෂයෙක් පිරිසිදු වූ, මනා සේ විශුද්ධ වූ රන්කාසියක් සොයා ගන්නේය. ඔහුට මෙසේ සිතේ: 'මාගේ මේ රන්කාසිය පිරිසිදුය, මනා සේ විශුද්ධය. දැන් මා මේ රන්කාසිය රැගෙන රන්කරුවන්ට පෙන්වුවහොත් හොඳය. මෙසේ මාගේ මේ රන්කාසිය රන්කරුවන් වෙත ගෙන ගිය විට පිරිසිදු වනු ඇත, තවද වඩාත් පිරිසිදු යයි සැලකෙනු ඇත.' එපරිද්දෙන්ම මාගේ මේ ධර්මයන් පිරිසිදුය, මනා සේ විශුද්ධය. දැන් මා මේ ධර්මයන් රැගෙන භාග්‍යවතුන් වහන්සේට දන්වා සිටියහොත් හොඳය. මෙසේ මාගේ මේ ධර්මයන් පිරිසිදු වනු ඇත, තවද වඩාත් පිරිසිදු යයි සැලකෙනු ඇත.\"\n\n\"සාධු! සාධු! සාරිපුත්තය! සාරිපුත්තය, භික්ෂුව ශාස්තෘන් වහන්සේ සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේය. සාරිපුත්තය, භික්ෂුව ධර්මය සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේය. සංඝයා... ආදී වශයෙන්... ශික්ෂාව... සමාධිය... අප්‍රමාදය... ප්‍රතිසන්ථාරය, සාරිපුත්තය, භික්ෂුව සක්කර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නේ අකුසල් දුරු කර, කුසල් වඩන්නේය.\"\n\nමෙසේ වදාළ විට ආයුෂ්මත් ශ්‍රී‍්‍ර_සාරිපුත්ත_තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ ධර්මයේ අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි. ස්වාමීනි, ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුක්ත වූ ඒ භික්ෂුව ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත වනු ඇතැයි, එය සිදුවිය හැක්කක් නොවේ. ස්වාමීනි, යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුක්ත වේද, හෙතෙම ධර්මය කෙරෙහිද අගෞරවයෙන් යුක්ත වන්නේය. ස්වාමීනි, ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුක්ත වූ, ධර්මය කෙරෙහි අගෞරවයෙන් යුක්ත වූ ඒ භික්ෂුව සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වනු ඇතැයි, එය සිදුවිය හැක්කක් නොවේ. ස්වාමීනි, යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුක්ත වේද, ධර්මය කෙරෙහි අගෞරවයෙන් යුක්ත වේද, හෙතෙම සංඝයා කෙරෙහිද අගෞරවයෙන් යුක්ත වන්නේය. ස්වාමීනි, ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුක්ත වූ, ධර්මය කෙරෙහි අගෞරවයෙන් යුක්ත වූ, සංඝයා කෙරෙහි අගෞරවයෙන් යුක්ත වූ ඒ භික්ෂුව ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වනු ඇතැයි, එය සිදුවිය හැක්කක් නොවේ. ස්වාමීනි, යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුක්ත වේද, ධර්මය කෙරෙහි අගෞරවයෙන් යුක්ත වේද, සංඝයා කෙරෙහි අගෞරවයෙන් යුක්ත වේද, හෙතෙම ශික්ෂාව කෙරෙහිද අගෞරවයෙන් යුක්ත වන්නේය. ස්වාමීනි, ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුක්ත වූ, ධර්මය කෙරෙහි අගෞරවයෙන් යුක්ත වූ, සංඝයා කෙරෙහි අගෞරවයෙන් යුක්ත වූ, ශික්ෂාව කෙරෙහි අගෞරවයෙන් යුක්ත වූ ඒ භික්ෂුව සමාධිය කෙරෙහි ගෞරවයෙන් යුක්ත වනු ඇතැයි, එය සිදුවිය හැක්කක් නොවේ.\n\nවහන්ස, යම් භික්ෂූන් වහන්සේ නමක් ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිතද, ධර්මය කෙරෙහි ගෞරව රහිතද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිතද, ශික්ෂාව කෙරෙහි ගෞරව රහිතද, උන්වහන්සේ සමාධිය කෙරෙහිද ගෞරව රහිත වෙති. ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ධර්මය කෙරෙහි ගෞරව රහිත වූද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ශික්ෂාව කෙරෙහි ගෞරව රහිත වූද, සමාධිය කෙරෙහි ගෞරව රහිත වූද, ඒ භික්ෂූන් වහන්සේ අප්‍රමාදය කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. යම් භික්ෂූන් වහන්සේ නමක්, වහන්ස, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිතද, ධර්මය කෙරෙහි ගෞරව රහිතද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිතද, ශික්ෂාව කෙරෙහි ගෞරව රහිතද, සමාධිය කෙරෙහි ගෞරව රහිතද, උන්වහන්සේ අප්‍රමාදය කෙරෙහිද ගෞරව රහිත වෙති. ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ධර්මය කෙරෙහි ගෞරව රහිත වූද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ශික්ෂාව කෙරෙහි ගෞරව රහිත වූද, සමාධිය කෙරෙහි ගෞරව රහිත වූද, අප්‍රමාදය කෙරෙහි ගෞරව රහිත වූද, ඒ භික්ෂූන් වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. යම් භික්ෂූන් වහන්සේ නමක්, වහන්ස, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිතද, ධර්මය කෙරෙහි ගෞරව රහිතද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිතද, ශික්ෂාව කෙරෙහි ගෞරව රහිතද, සමාධිය කෙරෙහි ගෞරව රහිතද, අප්‍රමාදය කෙරෙහි ගෞරව රහිතද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද ගෞරව රහිත වෙති.\n\nවහන්ස, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූ ඒ භික්ෂූන් වහන්සේ ධර්මය කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. යම් භික්ෂූන් වහන්සේ නමක්, වහන්ස, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, උන්වහන්සේ ධර්මය කෙරෙහිද සගෞරව වෙති, සංඝයා වහන්සේ කෙරෙහිද සගෞරව වෙති, ශික්ෂාව කෙරෙහිද සගෞරව වෙති, සමාධිය කෙරෙහිද සගෞරව වෙති, අප්‍රමාදය කෙරෙහිද සගෞරව වෙති, ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති. ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, ශික්ෂාව කෙරෙහි සගෞරව වූද, සමාධිය කෙරෙහි සගෞරව වූද, අප්‍රමාදය කෙරෙහි සගෞරව වූද, ඒ භික්ෂූන් වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. යම් භික්ෂූන් වහන්සේ නමක්, වහන්ස, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, ධර්මය කෙරෙහිද සගෞරවද, සංඝයා වහන්සේ කෙරෙහිද සගෞරවද, ශික්ෂාව කෙරෙහිද සගෞරවද, සමාධිය කෙරෙහිද සගෞරවද, අප්‍රමාදය කෙරෙහිද සගෞරවද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති. ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූ ඒ භික්ෂූන් වහන්සේ ධර්මය කෙරෙහිද සගෞරව වනු ඇතැයි කීම සිදුවිය හැකි කරුණකි. යම් භික්ෂූන් වහන්සේ නමක්, වහන්ස, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, ධර්මය කෙරෙහිද සගෞරවද, සංඝයා වහන්සේ කෙරෙහිද සගෞරවද, ශික්ෂාව කෙරෙහිද සගෞරවද, සමාධිය කෙරෙහිද සගෞරවද, අප්‍රමාදය කෙරෙහිද සගෞරවද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති. ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, ශික්ෂාව කෙරෙහි සගෞරව වූද, සමාධිය කෙරෙහි සගෞරව වූද, අප්‍රමාදය කෙරෙහි සගෞරව වූද, ඒ භික්ෂූන් වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වනු ඇතැයි කීම සිදුවිය හැකි කරුණකි. වහන්ස, යම් භික්ෂූන් වහන්සේ නමක් ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, ධර්මය කෙරෙහි සගෞරවද, සංඝයා වහන්සේ කෙරෙහි සගෞරවද, ශික්ෂාව කෙරෙහි සගෞරවද, සමාධිය කෙරෙහි සගෞරවද, අප්‍රමාදය කෙරෙහි සගෞරවද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති.\n\nවහන්ස, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ අදහස මම මෙසේ විස්තර වශයෙන් දනිමි.\n\nසාදු සාදු, සාරිපුත්ත! සාරිපුත්ත, මා විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ අදහස ඔබ මෙසේ විස්තර වශයෙන් දන්නා බව ඉතා යහපත්ය. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූ භික්ෂූන් වහන්සේ ධර්මය කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ධර්මය කෙරෙහි ගෞරව රහිත වූද, භික්ෂූන් වහන්සේ සංඝයා වහන්සේ කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ධර්මය කෙරෙහි ගෞරව රහිත වූද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිත වූද, භික්ෂූන් වහන්සේ ශික්ෂාව කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ධර්මය කෙරෙහි ගෞරව රහිත වූද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ශික්ෂාව කෙරෙහි ගෞරව රහිත වූද, භික්ෂූන් වහන්සේ සමාධිය කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ධර්මය කෙරෙහි ගෞරව රහිත වූද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ශික්ෂාව කෙරෙහි ගෞරව රහිත වූද, සමාධිය කෙරෙහි ගෞරව රහිත වූද, ඒ භික්ෂූන් වහන්සේ අප්‍රමාදය කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, යම් භික්ෂූන් වහන්සේ නමක් ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිතද, ධර්මය කෙරෙහි ගෞරව රහිතද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිතද, ශික්ෂාව කෙරෙහි ගෞරව රහිතද, සමාධිය කෙරෙහි ගෞරව රහිතද, උන්වහන්සේ අප්‍රමාදය කෙරෙහිද ගෞරව රහිත වෙති. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ධර්මය කෙරෙහි ගෞරව රහිත වූද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිත වූද, ශික්ෂාව කෙරෙහි ගෞරව රහිත වූද, සමාධිය කෙරෙහි ගෞරව රහිත වූද, අප්‍රමාදය කෙරෙහි ගෞරව රහිත වූද, ඒ භික්ෂූන් වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහි සගෞරව වනු ඇතැයි කීමට ඉඩක් නැත. යම් භික්ෂූන් වහන්සේ නමක්, සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිතද, ධර්මය කෙරෙහි ගෞරව රහිතද, සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිතද, ශික්ෂාව කෙරෙහි ගෞරව රහිතද, සමාධිය කෙරෙහි ගෞරව රහිතද, අප්‍රමාදය කෙරෙහි ගෞරව රහිතද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද ගෞරව රහිත වෙති. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූ ඒ භික්ෂූන් වහන්සේ ධර්මය කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, භික්ෂූන් වහන්සේ සංඝයා වහන්සේ කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, භික්ෂූන් වහන්සේ ශික්ෂාව කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, ශික්ෂාව කෙරෙහි සගෞරව වූද, භික්ෂූන් වහන්සේ සමාධිය කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, ශික්ෂාව කෙරෙහි සගෞරව වූද, සමාධිය කෙරෙහි සගෞරව වූද, භික්ෂූන් වහන්සේ අප්‍රමාදය කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, ශික්ෂාව කෙරෙහි සගෞරව වූද, සමාධිය කෙරෙහි සගෞරව වූද, අප්‍රමාදය කෙරෙහි සගෞරව වූද, භික්ෂූන් වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, යම් භික්ෂූන් වහන්සේ නමක් ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, උන්වහන්සේ ධර්මය කෙරෙහිද සගෞරව වෙති, සංඝයා වහන්සේ කෙරෙහිද සගෞරව වෙති, ශික්ෂාව කෙරෙහිද සගෞරව වෙති, සමාධිය කෙරෙහිද සගෞරව වෙති, අප්‍රමාදය කෙරෙහිද සගෞරව වෙති, ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, ශික්ෂාව කෙරෙහි සගෞරව වූද, සමාධිය කෙරෙහි සගෞරව වූද, අප්‍රමාදය කෙරෙහි සගෞරව වූද, ඒ භික්ෂූන් වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහි ගෞරව රහිත වනු ඇතැයි කීමට ඉඩක් නැත. සාරිපුත්ත, යම් භික්ෂූන් වහන්සේ නමක් ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, ධර්මය කෙරෙහිද සගෞරවද, සංඝයා වහන්සේ කෙරෙහිද සගෞරවද, ශික්ෂාව කෙරෙහිද සගෞරවද, සමාධිය කෙරෙහිද සගෞරවද, අප්‍රමාදය කෙරෙහිද සගෞරවද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූ ඒ භික්ෂූන් වහන්සේ ධර්මය කෙරෙහිද සගෞරව වනු ඇතැයි කීම සිදුවිය හැකි කරුණකි. සාරිපුත්ත, යම් භික්ෂූන් වහන්සේ නමක් ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, ධර්මය කෙරෙහිද සගෞරවද, සංඝයා වහන්සේ කෙරෙහිද සගෞරවද, ශික්ෂාව කෙරෙහිද සගෞරවද, සමාධිය කෙරෙහිද සගෞරවද, අප්‍රමාදය කෙරෙහිද සගෞරවද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති. සාරිපුත්ත, ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරව වූද, ධර්මය කෙරෙහි සගෞරව වූද, සංඝයා වහන්සේ කෙරෙහි සගෞරව වූද, ශික්ෂාව කෙරෙහි සගෞරව වූද, සමාධිය කෙරෙහි සගෞරව වූද, අප්‍රමාදය කෙරෙහි සගෞරව වූද, ඒ භික්ෂූන් වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වනු ඇතැයි කීම සිදුවිය හැකි කරුණකි. සාරිපුත්ත, යම් භික්ෂූන් වහන්සේ නමක් ශාස්තෘන් වහන්සේ කෙරෙහි සගෞරවද, ධර්මය කෙරෙහිද සගෞරවද, සංඝයා වහන්සේ කෙරෙහිද සගෞරවද, ශික්ෂාව කෙරෙහිද සගෞරවද, සමාධිය කෙරෙහිද සගෞරවද, අප්‍රමාදය කෙරෙහිද සගෞරවද, උන්වහන්සේ ප්‍රතිසන්ථාරය කෙරෙහිද සගෞරව වෙති.\n\nසාරිපුත්ත, මා විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ අදහස මෙසේ විස්තර වශයෙන් දැක්ක යුත්තේය.",
      "paliTitle": "Sakkaccasuttaṃ",
      "englishTitle": "The Discourse on Thoroughness",
      "sinhalaTitle": "සක්කච්ච සූත්‍රය"
    },
    {
      "number": 71,
      "pali": "‘‘Bhāvanaṃ ananuyuttassa, bhikkhave, bhikkhuno viharato kiñcāpi evaṃ icchā uppajjeyya – ‘aho vata me anupādāya āsavehi cittaṃ vimucceyyā’ti, atha khvassa neva anupādāya āsavehi cittaṃ vimuccati. Taṃ kissa hetu? ‘Abhāvitattā’tissa vacanīyaṃ. Kissa abhāvitattā? Catunnaṃ satipaṭṭhānānaṃ, catunnaṃ sammappadhānānaṃ, catunnaṃ iddhipādānaṃ, pañcannaṃ indriyānaṃ, pañcannaṃ balānaṃ, sattannaṃ bojjhaṅgānaṃ, ariyassa aṭṭhaṅgikassa maggassa. ‘‘Seyyathāpi, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā. Tānassu kukkuṭiyā na sammā adhisayitāni, na sammā pariseditāni, na sammā paribhāvitāni. Kiñcāpi tassā kukkuṭiyā evaṃ icchā uppajjeyya – ‘aho vata me kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṃ padāletvā sotthinā abhinibbhijjeyyu’nti, atha kho abhabbāva te kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṃ padāletvā sotthinā abhinibbhijjituṃ. Taṃ kissa hetu? Tathā hi, bhikkhave, kukkuṭiyā aṇḍāni na sammā adhisayitāni, na sammā pariseditāni, na sammā paribhāvitāni. Evamevaṃ kho, bhikkhave, bhāvanaṃ ananuyuttassa bhikkhuno viharato kiñcāpi evaṃ icchā uppajjeyya – ‘aho vata me anupādāya āsavehi cittaṃ vimucceyyā’ti, atha khvassa neva anupādāya āsavehi cittaṃ vimuccati. Taṃ kissa hetu? ‘Abhāvitattā’tissa vacanīyaṃ. Kissa abhāvitattā? Catunnaṃ satipaṭṭhānānaṃ, catunnaṃ sammappadhānānaṃ, catunnaṃ iddhipādānaṃ, pañcannaṃ indriyānaṃ, pañcannaṃ balānaṃ, sattannaṃ bojjhaṅgānaṃ, ariyassa aṭṭhaṅgikassa maggassa. ‘‘Bhāvanaṃ anuyuttassa, bhikkhave, bhikkhuno viharato kiñcāpi na evaṃ icchā uppajjeyya – ‘aho vata me anupādāya āsavehi cittaṃ vimucceyyā’ti, atha khvassa anupādāya āsavehi cittaṃ vimuccati. Taṃ kissa hetu? ‘Bhāvitattā’tissa vacanīyaṃ. Kissa bhāvitattā? Catunnaṃ satipaṭṭhānānaṃ, catunnaṃ sammappadhānānaṃ, catunnaṃ iddhipādānaṃ, pañcannaṃ indriyānaṃ, pañcannaṃ balānaṃ, sattannaṃ bojjhaṅgānaṃ, ariyassa aṭṭhaṅgikassa maggassa. ‘‘Seyyathāpi, bhikkhave, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā. Tānassu kukkuṭiyā sammā adhisayitāni, sammā pariseditāni, sammā paribhāvitāni. Kiñcāpi tassā kukkuṭiyā na evaṃ icchā uppajjeyya – ‘aho vata me kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṃ padāletvā sotthinā abhinibbhijjeyyu’nti, atha kho bhabbāva te kukkuṭapotakā pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṃ padāletvā sotthinā abhinibbhijjituṃ. Taṃ kissa hetu? Tathā hi, bhikkhave, kukkuṭiyā aṇḍāni sammā adhisayitāni, sammā pariseditāni, sammā paribhāvitāni. Evamevaṃ kho, bhikkhave, bhāvanaṃ anuyuttassa bhikkhuno viharato kiñcāpi na evaṃ icchā uppajjeyya – ‘aho vata me anupādāya āsavehi cittaṃ vimucceyyā’ti, atha khvassa anupādāya āsavehi cittaṃ vimuccati. Taṃ kissa hetu? ‘Bhāvitattā’tissa vacanīyaṃ. Kissa bhāvitattā? Catunnaṃ satipaṭṭhānānaṃ…pe… ariyassa aṭṭhaṅgikassa maggassa. ‘‘Seyyathāpi, bhikkhave, phalagaṇḍassa [palagaṇḍassa (?)] vā phalagaṇḍantevāsikassa vā dissanteva [khīyante (ka.)] vāsijaṭe [dissanti aṅgulipadāni (sī.), aṅgulapadāni dissanti aṅgulapadaṃ (ka.)] aṅgulipadāni dissati [dissanti (syā.)] aṅguṭṭhapadaṃ [dissanti aṅgulipadāni (sī.), aṅgulapadāni dissanti aṅgulapadaṃ (ka.)]. No ca khvassa evaṃ ñāṇaṃ hoti – ‘ettakaṃ me ajja vāsijaṭassa khīṇaṃ, ettakaṃ hiyyo, ettakaṃ pare’ti, atha khvassa khīṇe ‘khīṇa’nteva ñāṇaṃ hoti. Evamevaṃ kho, bhikkhave, bhāvanaṃ anuyuttassa bhikkhuno viharato kiñcāpi na evaṃ ñāṇaṃ hoti – ‘ettakaṃ me ajja āsavānaṃ khīṇaṃ, ettakaṃ hiyyo, ettakaṃ pare’ti, atha khvassa khīṇe ‘khīṇa’nteva ñāṇaṃ hoti. ‘‘Seyyathāpi, bhikkhave, sāmuddikāya nāvāya vettabandhanabaddhāya [vettabandhāya (ka.)] cha māsāni udake pariyādāya hemantikena thale ukkhittāya vātātapaparetāni bandhanāni, tāni pāvussakena meghena abhippavuṭṭhāni appakasireneva parihāyanti [paṭippassambhanti (sī. syā.)], pūtikāni bhavanti. Evamevaṃ kho, bhikkhave, bhāvanaṃ anuyuttassa bhikkhuno viharato appakasireneva saṃyojanāni paṭippassambhanti, pūtikāni bhavantī’’ti. Sattamaṃ.",
      "english": "Monks, for a monk dwelling without devotion to spiritual development, even if such a wish should arise in him: ‘Oh, may my mind be released from the taints without clinging!’ Yet, his mind is not released from the taints without clinging. For what reason? It should be said: ‘Because it has not been developed.’ Not developed with regard to what? The four establishments of mindfulness, the four right exertions, the four bases of spiritual power, the five spiritual faculties, the five spiritual powers, the seven factors of awakening, the Noble Eightfold Path.\n\nJust as, monks, if there were eight, ten, or twelve hen’s eggs. Those eggs might not be properly incubated by the hen, not properly warmed, not properly nurtured. Even if that hen should wish thus: ‘Oh, may my chicks break open the eggshells with their claw-tips or beak-tips and emerge safely!’ Yet, those chicks would be unable to break open the eggshells with their claw-tips or beak-tips and emerge safely. For what reason? Because, monks, those hen’s eggs were not properly incubated, not properly warmed, not properly nurtured. In the same way, monks, for a monk dwelling without devotion to spiritual development, even if such a wish should arise in him: ‘Oh, may my mind be released from the taints without clinging!’ Yet, his mind is not released from the taints without clinging. For what reason? It should be said: ‘Because it has not been developed.’ Not developed with regard to what? The four establishments of mindfulness, the four right exertions, the four bases of spiritual power, the five spiritual faculties, the five spiritual powers, the seven factors of awakening, the Noble Eightfold Path.\n\nMonks, for a monk dwelling devoted to spiritual development, even if such a wish should not arise in him: ‘Oh, may my mind be released from the taints without clinging!’ Yet, his mind is released from the taints without clinging. For what reason? It should be said: ‘Because it has been developed.’ Developed with regard to what? The four establishments of mindfulness, the four right exertions, the four bases of spiritual power, the five spiritual faculties, the five spiritual powers, the seven factors of awakening, the Noble Eightfold Path.\n\nJust as, monks, if there were eight, ten, or twelve hen’s eggs. Those eggs might be properly incubated by the hen, properly warmed, properly nurtured. Even if that hen should not wish thus: ‘Oh, may my chicks break open the eggshells with their claw-tips or beak-tips and emerge safely!’ Yet, those chicks would be able to break open the eggshells with their claw-tips or beak-tips and emerge safely. For what reason? Because, monks, those hen’s eggs were properly incubated, properly warmed, properly nurtured. In the same way, monks, for a monk dwelling devoted to spiritual development, even if such a wish should not arise in him: ‘Oh, may my mind be released from the taints without clinging!’ Yet, his mind is released from the taints without clinging. For what reason? It should be said: ‘Because it has been developed.’ Developed with regard to what? The four establishments of mindfulness, the four right exertions, the four bases of spiritual power, the five spiritual faculties, the five spiritual powers, the seven factors of awakening, the Noble Eightfold Path.\n\nJust as, monks, a carpenter or a carpenter's apprentice, working with an adze handle, sees the marks of his fingers and the mark of his thumb. But he does not have the knowledge: ‘So much of my adze handle wore away today, so much yesterday, so much the day before yesterday.’ Rather, when it is worn away, he knows: ‘It is worn away.’ In the same way, monks, for a monk dwelling devoted to spiritual development, even if he does not have the knowledge: ‘So much of my taints wore away today, so much yesterday, so much the day before yesterday.’ Rather, when they are worn away, he knows: ‘They are worn away.’\n\nJust as, monks, a seagoing ship bound with rope lashings, having been in the water for six months, is drawn ashore in winter. Its lashings, weathered by wind and sun, when thoroughly drenched by a cloudburst in the rainy season, easily subside and become weak. In the same way, monks, for a monk dwelling devoted to spiritual development, the fetters easily subside and become weak.",
      "sinhala": "මහණෙනි, භාවනාවට යොමු නොවූ, භාවනාව නොකරන භික්ෂුවක් වෙසෙන කල්හි, යම් හෙයකින් ඔහුට මෙවන් කැමැත්තක් ඇති වුවත් – 'අහෝ, මාගේ සිත කිසිවක් උපාදාන කර නොගෙනම ආශ්‍රවයන්ගෙන් මිදේවා!' කියා, එහෙත් ඔහුගේ සිත උපාදාන රහිතව ආශ්‍රවයන්ගෙන් මිදෙන්නේම නැත. එයට හේතුව කුමක්ද? 'භාවනා නොකළ නිසාය' යි ඔහුට කිව යුතුයි. කුමක් භාවනා නොකළ නිසාද? සිව් සතිපට්ඨාන ධර්මයන්, සිව් සම්මප්ප්‍රධාන ධර්මයන්, සිව් ඉර්ධිපාද ධර්මයන්, පස් ඉන්ද්‍රිය ධර්මයන්, පස් බල ධර්මයන්, සත් බොජ්ඣංග ධර්මයන්, ආර්ය අෂ්ඨාංගික මාර්ගය භාවනා නොකළ නිසාය.\n\nමහණෙනි, යම් සේ කිකිළියකගේ බිත්තර අටක් හෝ දසයක් හෝ දොළහක් හෝ වේ ද, ඒ බිත්තර කිකිළිය විසින් මනාව උණුසුම් කර නොබියවන ලද්දාහු, මනාව රැක නොබලන ලද්දාහු, මනාව පෝෂණය නොකරන ලද්දාහු වෙත් නම්, යම් හෙයකින් ඒ කිකිළියට මෙවන් කැමැත්තක් ඇති වුවත් – 'අහෝ, මාගේ කුකුළු පැටවුන් පාදයේ නිය තුඩින් හෝ, හොට තුඩින් හෝ බිත්තර කටුව බිඳ සුවසේ එළියට ඒවා' කියා, එහෙත් ඒ කුකුළු පැටවුන්ට පාදයේ නිය තුඩින් හෝ, හොට තුඩින් හෝ බිත්තර කටුව බිඳ සුවසේ එළියට ඒමට නොහැකිමය. එයට හේතුව කුමක්ද? මහණෙනි, මන්ද, ඒ කිකිළිය විසින් බිත්තර මනාව උණුසුම් කර නොබියවන ලද්දාහු, මනාව රැක නොබලන ලද්දාහු, මනාව පෝෂණය නොකරන ලද්දාහු වූ බැවිනි. එලෙසින්ම, මහණෙනි, භාවනාවට යොමු නොවූ, භාවනාව නොකරන භික්ෂුවක් වෙසෙන කල්හි, යම් හෙයකින් ඔහුට මෙවන් කැමැත්තක් ඇති වුවත් – 'අහෝ, මාගේ සිත කිසිවක් උපාදාන කර නොගෙනම ආශ්‍රවයන්ගෙන් මිදේවා!' කියා, එහෙත් ඔහුගේ සිත උපාදාන රහිතව ආශ්‍රවයන්ගෙන් මිදෙන්නේම නැත. එයට හේතුව කුමක්ද? 'භාවනා නොකළ නිසාය' යි ඔහුට කිව යුතුයි. කුමක් භාවනා නොකළ නිසාද? සිව් සතිපට්ඨාන ධර්මයන්, සිව් සම්මප්ප්‍රධාන ධර්මයන්, සිව් ඉර්ධිපාද ධර්මයන්, පස් ඉන්ද්‍රිය ධර්මයන්, පස් බල ධර්මයන්, සත් බොජ්ඣංග ධර්මයන්, ආර්ය අෂ්ඨාංගික මාර්ගය භාවනා නොකළ නිසාය.\n\nමහණෙනි, භාවනාවට යොමු වූ, භාවනා කරන භික්ෂුවක් වෙසෙන කල්හි, යම් හෙයකින් ඔහුට මෙවන් කැමැත්තක් ඇති නොවුවත් – 'අහෝ, මාගේ සිත කිසිවක් උපාදාන කර නොගෙනම ආශ්‍රවයන්ගෙන් මිදේවා!' කියා, එහෙත් ඔහුගේ සිත උපාදාන රහිතව ආශ්‍රවයන්ගෙන් මිදෙයි. එයට හේතුව කුමක්ද? 'භාවනා කළ නිසාය' යි ඔහුට කිව යුතුයි. කුමක් භාවනා කළ නිසාද? සිව් සතිපට්ඨාන ධර්මයන්, සිව් සම්මප්ප්‍රධාන ධර්මයන්, සිව් ඉර්ධිපාද ධර්මයන්, පස් ඉන්ද්‍රිය ධර්මයන්, පස් බල ධර්මයන්, සත් බොජ්ඣංග ධර්මයන්, ආර්ය අෂ්ඨාංගික මාර්ගය භාවනා කළ නිසාය.\n\nමහණෙනි, යම් සේ කිකිළියකගේ බිත්තර අටක් හෝ දසයක් හෝ දොළහක් හෝ වේ ද, ඒ බිත්තර කිකිළිය විසින් මනාව උණුසුම් කර බියවන ලද්දාහු, මනාව රැකබලන ලද්දාහු, මනාව පෝෂණය කරන ලද්දාහු වෙත් නම්, යම් හෙයකින් ඒ කිකිළියට මෙවන් කැමැත්තක් ඇති නොවුවත් – 'අහෝ, මාගේ කුකුළු පැටවුන් පාදයේ නිය තුඩින් හෝ, හොට තුඩින් හෝ බිත්තර කටුව බිඳ සුවසේ එළියට ඒවා' කියා, එහෙත් ඒ කුකුළු පැටවුන්ට පාදයේ නිය තුඩින් හෝ, හොට තුඩින් හෝ බිත්තර කටුව බිඳ සුවසේ එළියට ඒමට හැකිමය. එයට හේතුව කුමක්ද? මහණෙනි, මන්ද, ඒ කිකිළිය විසින් බිත්තර මනාව උණුසුම් කර බියවන ලද්දාහු, මනාව රැකබලන ලද්දාහු, මනාව පෝෂණය කරන ලද්දාහු වූ බැවිනි. එලෙසින්ම, මහණෙනි, භාවනාවට යොමු වූ, භාවනා කරන භික්ෂුවක් වෙසෙන කල්හි, යම් හෙයකින් ඔහුට මෙවන් කැමැත්තක් ඇති නොවුවත් – 'අහෝ, මාගේ සිත කිසිවක් උපාදාන කර නොගෙනම ආශ්‍රවයන්ගෙන් මිදේවා!' කියා, එහෙත් ඔහුගේ සිත උපාදාන රහිතව ආශ්‍රවයන්ගෙන් මිදෙයි. එයට හේතුව කුමක්ද? 'භාවනා කළ නිසාය' යි ඔහුට කිව යුතුයි. කුමක් භාවනා කළ නිසාද? සිව් සතිපට්ඨාන ධර්මයන්, සිව් සම්මප්ප්‍රධාන ධර්මයන්, සිව් ඉර්ධිපාද ධර්මයන්, පස් ඉන්ද්‍රිය ධර්මයන්, පස් බල ධර්මයන්, සත් බොජ්ඣංග ධර්මයන්, ආර්ය අෂ්ඨාංගික මාර්ගය භාවනා කළ නිසාය.\n\nමහණෙනි, යම් සේ වඩු කාර්මිකයෙකුගේ හෝ වඩු කාර්මිකයෙකුගේ අතවැසියාගේ හෝ වෑයෙ මිටේ ඇඟිලි සලකුණු සහ මහපට ඇඟිලි සලකුණු පෙනේ ද, එහෙත් ඔහුට මෙසේ ඥානයක් ඇති නොවේ – 'අද මාගේ වෑයෙ මිටෙන් මෙපමණක් ගෙවී ගියේය, ඊයේ මෙපමණක් ගෙවී ගියේය, පෙරේදා මෙපමණක් ගෙවී ගියේය' කියා, එහෙත් ගෙවී ගිය කල්හි 'ගෙවී ගියේය' යන ඥානය ඔහුට ඇති වේ. එලෙසින්ම, මහණෙනි, භාවනාවට යොමු වූ භික්ෂුවක් වෙසෙන කල්හි, යම් හෙයකින් ඔහුට මෙවන් ඥානයක් ඇති නොවුවත් – 'අද මාගේ ආශ්‍රවයන් මෙපමණක් ක්ෂය විය, ඊයේ මෙපමණක් ක්ෂය විය, පෙරේදා මෙපමණක් ක්ෂය විය' කියා, එහෙත් ක්ෂය වූ කල්හි 'ක්ෂය විය' යන ඥානය ඔහුට ඇති වේ.\n\nමහණෙනි, යම් සේ සමුද්‍රගාමී නැවක ලණුවලින් බැඳ තිබූ කොටස්, මාස හයක් ජලයේ තිබී, හේමන්ත ඍතුවේදී ගොඩට ගෙන තබන ලද කල්හි, වාතය හා අව්වට වේලී දුර්වල වූ එහි බැඳීම්, වර්ෂා කාලයේ වර්ෂාව ලැබීමෙන් අපහසුවකින් තොරව දිරාපත්ව, කුණු වී යේ ද, එලෙසින්ම, මහණෙනි, භාවනාවට යොමු වූ භික්ෂුවක් වෙසෙන කල්හි, අපහසුවකින් තොරව සංයෝජන දුරු වී යයි, කුණු වී යයි.",
      "paliTitle": "Bhāvanāsuttaṃ",
      "englishTitle": "The Discourse on Meditation (Development)",
      "sinhalaTitle": "භාවනා සූත්‍රය"
    },
    {
      "number": 72,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ. Addasā kho bhagavā addhānamaggappaṭipanno aññatarasmiṃ padese mahantaṃ aggikkhandhaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ [sañjotibhūtaṃ (syā.)]. Disvāna maggā okkamma aññatarasmiṃ rukkhamūle paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, amuṃ mahantaṃ aggikkhandhaṃ ādittaṃ sampajjalitaṃ sajotibhūta’’nti? ‘‘Evaṃ, bhante’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho varaṃ – yaṃ amuṃ mahantaṃ aggikkhandhaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ āliṅgetvā upanisīdeyya vā upanipajjeyya vā, yaṃ vā khattiyakaññaṃ vā brāhmaṇakaññaṃ vā gahapatikaññaṃ vā mudutalunahatthapādaṃ āliṅgetvā upanisīdeyya vā upanipajjeyya vā’’ti? ‘‘Etadeva, bhante, varaṃ – yaṃ khattiyakaññaṃ vā brāhmaṇakaññaṃ vā gahapatikaññaṃ vā mudutalunahatthapādaṃ āliṅgetvā upanisīdeyya vā upanipajjeyya vā, dukkhañhetaṃ, bhante, yaṃ amuṃ mahantaṃ aggikkhandhaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ āliṅgetvā upanisīdeyya vā upanipajjeyya vā’’ti. ‘‘Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave, yathā etadeva tassa varaṃ dussīlassa pāpadhammassa asucisaṅkassarasamācārassa paṭicchannakammantassa assamaṇassa samaṇapaṭiññassa abrahmacārissa brahmacāripaṭiññassa antopūtikassa avassutassa kasambujātassa yaṃ amuṃ mahantaṃ aggikkhandhaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ āliṅgetvā upanisīdeyya vā upanipajjeyya vā. Taṃ kissa hetu? Tatonidānañhi so, bhikkhave, maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ, na tveva tappaccayā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. ‘‘Yañca kho so, bhikkhave, dussīlo pāpadhammo asucisaṅkassarasamācāro…pe… kasambujāto khattiyakaññaṃ vā brāhmaṇakaññaṃ vā gahapatikaññaṃ vā mudutalunahatthapādaṃ āliṅgetvā upanisīdati vā upanipajjati vā, tañhi tassa [taṃ hissa (ka.)], bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho varaṃ – yaṃ balavā puriso daḷhāya vālarajjuyā ubho jaṅghā veṭhetvā ghaṃseyya – sā chaviṃ chindeyya chaviṃ chetvā cammaṃ chindeyya cammaṃ chetvā maṃsaṃ chindeyya maṃsaṃ chetvā nhāruṃ chindeyya nhāruṃ chetvā aṭṭhiṃ chindeyya aṭṭhiṃ chetvā aṭṭhimiñjaṃ āhacca tiṭṭheyya, yaṃ vā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā abhivādanaṃ sādiyeyyā’’ti? ‘‘Etadeva, bhante, varaṃ – yaṃ khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā abhivādanaṃ sādiyeyya, dukkhañhetaṃ, bhante, yaṃ balavā puriso daḷhāya vālarajjuyā…pe… aṭṭhimiñjaṃ āhacca tiṭṭheyyā’’ti. ‘‘Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave, yathā etadeva tassa varaṃ dussīlassa… pe… kasambujātassa yaṃ balavā puriso daḷhāya vālarajjuyā ubho jaṅghā veṭhetvā…pe… aṭṭhimiñjaṃ āhacca tiṭṭheyya. Taṃ kissa hetu? Tatonidānañhi so, bhikkhave, maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ, na tveva tappaccayā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. Yañca kho so, bhikkhave, dussīlo…pe… kasambujāto khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā abhivādanaṃ sādiyati, tañhi tassa, bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho varaṃ – yaṃ balavā puriso tiṇhāya sattiyā teladhotāya paccorasmiṃ pahareyya, yaṃ vā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā añjalikammaṃ sādiyeyyā’’ti? ‘‘Etadeva, bhante, varaṃ – yaṃ khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā añjalikammaṃ sādiyeyya, dukkhañhetaṃ, bhante, yaṃ balavā puriso tiṇhāya sattiyā teladhotāya paccorasmiṃ pahareyyā’’ti. ‘‘Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave, yathā etadeva tassa varaṃ dussīlassa… pe… kasambujātassa yaṃ balavā puriso tiṇhāya sattiyā teladhotāya paccorasmiṃ pahareyya. Taṃ kissa hetu? Tatonidānañhi so, bhikkhave, maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ, na tveva tappaccayā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. Yañca kho so, bhikkhave, dussīlo pāpadhammo…pe… kasambujāto khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā añjalikammaṃ sādiyati, tañhi tassa, bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho varaṃ – yaṃ balavā puriso tattena ayopaṭṭena ādittena sampajjalitena sajotibhūtena kāyaṃ sampaliveṭheyya, yaṃ vā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ cīvaraṃ paribhuñjeyyā’’ti? ‘‘Etadeva, bhante, varaṃ – yaṃ khattiyamahāsālānaṃ vā…pe… saddhādeyyaṃ cīvaraṃ paribhuñjeyya, dukkhañhetaṃ, bhante, yaṃ balavā puriso tattena ayopaṭṭena ādittena sampajjalitena sajotibhūtena kāyaṃ sampaliveṭheyyā’’ti. ‘‘Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave, yathā etadeva tassa varaṃ dussīlassa… pe… kasambujātassa yaṃ balavā puriso tattena ayopaṭṭena ādittena sampajjalitena sajotibhūtena kāyaṃ sampaliveṭheyya. Taṃ kissa hetu? Tatonidānañhi so, bhikkhave, maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ, na tveva tappaccayā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. Yañca kho so, bhikkhave, dussīlo…pe… kasambujāto khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ cīvaraṃ paribhuñjati, tañhi tassa, bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho varaṃ – yaṃ balavā puriso tattena ayosaṅkunā mukhaṃ vivaritvā tattaṃ lohaguḷaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ mukhe pakkhipeyya – taṃ tassa oṭṭhampi daheyya [ḍaheyya (katthaci)] mukhampi daheyya jivhampi daheyya kaṇṭhampi daheyya urampi [ma. ni. 3.270 devadūtasutte pana ‘‘udarampi’’ iti videsapāṭho dissati] daheyya antampi antaguṇampi ādāya adhobhāgā [adhobhāgaṃ (ka.)] nikkhameyya, yaṃ vā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ piṇḍapātaṃ paribhuñjeyyā’’ti? ‘‘Etadeva, bhante, varaṃ – yaṃ khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ piṇḍapātaṃ paribhuñjeyya, dukkhañhetaṃ, bhante, yaṃ balavā puriso tattena ayosaṅkunā mukhaṃ vivaritvā tattaṃ lohaguḷaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ mukhe pakkhipeyya – taṃ tassa oṭṭhampi daheyya mukhampi daheyya jivhampi daheyya kaṇṭhampi daheyya urampi daheyya antampi antaguṇampi ādāya adhobhāgaṃ nikkhameyyā’’ti. ‘‘Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave, yathā etadeva tassa varaṃ dussīlassa… pe… kasambujātassa yaṃ balavā puriso tattena ayosaṅkunā mukhaṃ vivaritvā tattaṃ lohaguḷaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ mukhe pakkhipeyya – taṃ tassa oṭṭhampi daheyya mukhampi daheyya jivhampi daheyya kaṇṭhampi daheyya urampi daheyya antampi antaguṇampi ādāya adhobhāgaṃ nikkhameyya. Taṃ kissa hetu? Tatonidānañhi so, bhikkhave, maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ, na tveva tappaccayā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. Yañca kho so, bhikkhave, dussīlo pāpadhammo…pe… kasambujāto khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ piṇḍapātaṃ paribhuñjati, tañhi tassa hoti dīgharattaṃ ahitāya dukkhāya kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho varaṃ – yaṃ balavā puriso sīse vā gahetvā khandhe vā gahetvā tattaṃ ayomañcaṃ vā ayopīṭhaṃ vā abhinisīdāpeyya vā abhinipajjāpeyya vā, yaṃ vā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ mañcapīṭhaṃ [mañcaṃ vā pīṭhaṃ vā (ka.)] paribhujjeyyā’’ti? ‘‘Etadeva, bhante, varaṃ – yaṃ khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ mañcapīṭhaṃ paribhuñjeyya, dukkhañhetaṃ, bhante, yaṃ balavā puriso sīse vā gahetvā khandhe vā gahetvā tattaṃ ayomañcaṃ vā ayopīṭhaṃ vā abhinisīdāpeyya vā abhinipajjāpeyya vā’’ti. ‘‘Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave, yathā etadeva tassa varaṃ dussīlassa… pe… kasambujātassa yaṃ balavā puriso sīse vā gahetvā khandhe vā gahetvā tattaṃ ayomañcaṃ vā ayopīṭhaṃ vā abhinisīdāpeyya vā abhinipajjāpeyya vā. Taṃ kissa hetu? Tatonidānañhi so, bhikkhave, maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ, na tveva tappaccayā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. Yañca kho so, bhikkhave, dussīlo pāpadhammo… pe… kasambujāto khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ mañcapīṭhaṃ paribhuñjati. Tañhi tassa, bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho varaṃ – yaṃ balavā puriso uddhaṃpādaṃ adhosiraṃ gahetvā tattāya lohakumbhiyā pakkhipeyya ādittāya sampajjalitāya sajotibhūtāya – so tattha pheṇuddehakaṃ paccamāno sakimpi uddhaṃ gaccheyya sakimpi adho gaccheyya sakimpi tiriyaṃ gaccheyya, yaṃ vā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ vihāraṃ paribhuñjeyyā’’ti? ‘‘Etadeva, bhante, varaṃ – yaṃ khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ vihāraṃ paribhuñjeyya, dukkhañhetaṃ, bhante, yaṃ balavā puriso uddhaṃpādaṃ adhosiraṃ gahetvā tattāya lohakumbhiyā pakkhipeyya ādittāya sampajjalitāya sajotibhūtāya – so tattha pheṇuddehakaṃ paccamāno sakimpi uddhaṃ gaccheyya sakimpi adho gaccheyya sakimpi tiriyaṃ gaccheyyā’’ti. ‘‘Ārocayāmi vo, bhikkhave, paṭivedayāmi vo, bhikkhave, yathā etadeva tassa varaṃ dussīlassa pāpadhammassa…pe… kasambujātassa yaṃ balavā puriso uddhaṃpādaṃ adhosiraṃ gahetvā…pe… sakimpi tiriyaṃ gaccheyya. Taṃ kissa hetu? Tatonidānañhi so, bhikkhave, maraṇaṃ vā nigaccheyya maraṇamattaṃ vā dukkhaṃ, na tveva tappaccayā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. Yañca kho so, bhikkhave, dussīlo pāpadhammo…pe… kasambujāto khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā saddhādeyyaṃ vihāraṃ paribhuñjati. Tañhi tassa, bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘yesañca [yesaṃ (?)] mayaṃ paribhuñjāma cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ [… parikkhārānaṃ (sī. syā. ka.)] tesaṃ te kārā mahapphalā bhavissanti mahānisaṃsā, amhākañcevāyaṃ pabbajjā avañjhā bhavissati saphalā saudrayā’ti. Evañhi vo, bhikkhave, sikkhitabbaṃ – ‘attatthaṃ vā, bhikkhave, sampassamānena alameva appamādena sampādetuṃ; paratthaṃ vā, bhikkhave, sampassamānena alameva appamādena sampādetuṃ; ubhayatthaṃ vā, bhikkhave, sampassamānena alameva appamādena sampādetu’’’nti. Idamavoca bhagavā [idamavoca bhagavā…pe… (ka.)]. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne saṭṭhimattānaṃ bhikkhūnaṃ uṇhaṃ lohitaṃ mukhato uggañchi [uggacchi (ka.)]. Saṭṭhimattā bhikkhū sikkhaṃ paccakkhāya hīnāyāvattiṃsu – ‘‘sudukkaraṃ bhagavā, sudukkaraṃ bhagavā’’ti. Saṭṭhimattānaṃ bhikkhūnaṃ anupādāya āsavehi cittāni vimucciṃsūti. Aṭṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was wandering in the Kosala country, accompanied by a large community of monastics. While on a journey in a certain place, the Blessed One saw an enormous mass of fire, blazing, thoroughly alight, emitting intense light. Having seen this, He left the road and sat down on a seat that had been prepared at the root of a certain tree. Having sat down, the Blessed One addressed the monastics, “Monastics, do you not see that enormous mass of fire, blazing, thoroughly alight, emitting intense light?” “Yes, Venerable Sir,” they replied. “What do you think, monastics, which would be better: to embrace and sit or lie down with that enormous mass of fire, blazing, thoroughly alight, emitting intense light, or to embrace and sit or lie down with a tender, soft-limbed daughter of a warrior, a brahmin, or a householder?” “Venerable Sir, it would be better to embrace and sit or lie down with a tender, soft-limbed daughter of a warrior, a brahmin, or a householder. For it would be suffering, Venerable Sir, to embrace and sit or lie down with that enormous mass of fire, blazing, thoroughly alight, emitting intense light.” “Monastics, I declare to you, I announce to you, that this very thing would be better for one who is unvirtuous, of wicked conduct, of impure, doubtful behavior, whose deeds are hidden, who is no true contemplative yet claims to be a contemplative, who does not live the holy life yet claims to live the holy life, who is rotten within, overflowing with defilements, born of refuse: that he embrace and sit or lie down with that enormous mass of fire, blazing, thoroughly alight, emitting intense light. Why is that? For because of that, monastics, he might encounter death or suffering unto death, but he would not, on account of that, with the breaking up of the body, after death, be reborn in a state of deprivation, a bad destination, a state of woe, hell. But if, monastics, that unvirtuous person, of wicked conduct, of impure, doubtful behavior, whose deeds are hidden, who is no true contemplative yet claims to be a contemplative, who does not live the holy life yet claims to live the holy life, who is rotten within, overflowing with defilements, born of refuse, embraces and sits or lies down with a tender, soft-limbed daughter of a warrior, a brahmin, or a householder, that indeed, monastics, would be for his harm and suffering for a long time, and with the breaking up of the body, after death, he will be reborn in a state of deprivation, a bad destination, a state of woe, hell.\n\n“What do you think, monastics, which would be better: for a strong man to wrap both his shins with a strong leather thong and rub them, so that it cuts through the skin, and having cut through the skin, cuts through the hide, and having cut through the hide, cuts through the flesh, and having cut through the flesh, cuts through the sinews, and having cut through the sinews, cuts through the bone, and having cut through the bone, reaches the marrow and remains there, or to accept the salutations of wealthy warriors, wealthy brahmins, or wealthy householders?” “Venerable Sir, it would be better to accept the salutations of wealthy warriors, wealthy brahmins, or wealthy householders. For it would be suffering, Venerable Sir, for a strong man to wrap both his shins with a strong leather thong and rub them, so that it cuts through the skin, and having cut through the skin, cuts through the hide, and having cut through the hide, cuts through the flesh, and having cut through the flesh, cuts through the sinews, and having cut through the sinews, cuts through the bone, and having cut through the bone, reaches the marrow and remains there.” “Monastics, I declare to you, I announce to you, that this very thing would be better for one who is unvirtuous, of wicked conduct, of impure, doubtful behavior, whose deeds are hidden, who is no true contemplative yet claims to be a contemplative, who does not live the holy life yet claims to live the holy life, who is rotten within, overflowing with defilements, born of refuse: that for a strong man to wrap both his shins with a strong leather thong and rub them, so that it cuts through the skin, and having cut through the skin, cuts through the hide, and having cut through the hide, cuts through the flesh, and having cut through the flesh, cuts through the sinews, and having cut through the sinews, cuts through the bone, and having cut through the bone, reaches the marrow and remains there. Why is that? For because of that, monastics, he might encounter death or suffering unto death, but he would not, on account of that, with the breaking up of the body, after death, be reborn in a state of deprivation, a bad destination, a state of woe, hell. But if, monastics, that unvirtuous person, of wicked conduct, of impure, doubtful behavior, whose deeds are hidden, who is no true contemplative yet claims to be a contemplative, who does not live the holy life yet claims to live the holy life, who is rotten within, overflowing with defilements, born of refuse, accepts the salutations of wealthy warriors, wealthy brahmins, or wealthy householders, that indeed, monastics, would be for his harm and suffering for a long time, and with the breaking up of the body, after death, he will be reborn in a state of deprivation, a bad destination, a state of woe, hell.\n\n“What do you think, monastics, which would be better: for a strong man to strike him in the chest with a sharp, oil-smeared spear, or to accept the reverence with joined palms from wealthy warriors, wealthy brahmins, or wealthy householders?” “Venerable Sir, it would be better to accept the reverence with joined palms from wealthy warriors, wealthy brahmins, or wealthy householders. For it would be suffering, Venerable Sir, for a strong man to strike him in the chest with a sharp, oil-smeared spear.” “Monastics, I declare to you, I announce to you, that this very thing would be better for one who is unvirtuous, of wicked conduct, of impure, doubtful behavior, whose deeds are hidden, who is no true contemplative yet claims to be a contemplative, who does not live the holy life yet claims to live the holy life, who is rotten within, overflowing with defilements, born of refuse: that for a strong man to strike him in the chest with a sharp, oil-smeared spear. Why is that? For because of that, monastics, he might encounter death or suffering unto death, but he would not, on account of that, with the breaking up of the body, after death, be reborn in a state of deprivation, a bad destination, a state of woe, hell.\n\nFrom that cause, O Bhikkhus, he might indeed meet death or suffering comparable to death, but he would not, because of that, after the breaking up of the body, after death, be reborn in a state of deprivation, a bad destination, a downfall, in hell. But if, O Bhikkhus, that immoral person, of evil character, defiled, a wretched outcast, accepts a respectful salutation from noble wealthy families, or brahmin wealthy families, or householder wealthy families, that, O Bhikkhus, will be for his long-term detriment and suffering, for after the breaking up of the body, after death, he is reborn in a state of deprivation, a bad destination, a downfall, in hell. \"What do you think, O Bhikkhus, which is better: that a strong man should wrap his body with a heated, blazing, burning, glowing iron plate, or that one should partake of a robe given in faith by noble wealthy families, or brahmin wealthy families, or householder wealthy families?\" \"This, Venerable Sir, is better: that one should partake of a robe given in faith by noble wealthy families, or brahmin wealthy families, or householder wealthy families. For it is suffering, Venerable Sir, that a strong man should wrap his body with a heated, blazing, burning, glowing iron plate.\" \"I declare to you, O Bhikkhus, I proclaim to you, O Bhikkhus, that this indeed is better for that immoral person, of evil character, defiled, a wretched outcast: that a strong man should wrap his body with a heated, blazing, burning, glowing iron plate. What is the reason for that? From that cause, O Bhikkhus, he might indeed meet death or suffering comparable to death, but he would not, because of that, after the breaking up of the body, after death, be reborn in a state of deprivation, a bad destination, a downfall, in hell. But if, O Bhikkhus, that immoral person, of evil character, defiled, a wretched outcast, partakes of a robe given in faith by noble wealthy families, or brahmin wealthy families, or householder wealthy families, that, O Bhikkhus, will be for his long-term detriment and suffering, for after the breaking up of the body, after death, he is reborn in a state of deprivation, a bad destination, a downfall, in hell.\n\n\"What do you think, O Bhikkhus, which is better: that a strong man, having opened his mouth with a heated iron spike, should insert into his mouth a heated, blazing, burning, glowing iron ball—that would burn his lips, burn his mouth, burn his tongue, burn his throat, burn his chest, and carrying away his intestines and bowels, it would exit from below—or that one should partake of alms-food given in faith by noble wealthy families, or brahmin wealthy families, or householder wealthy families?\" \"This, Venerable Sir, is better: that one should partake of alms-food given in faith by noble wealthy families, or brahmin wealthy families, or householder wealthy families. For it is suffering, Venerable Sir, that a strong man, having opened his mouth with a heated iron spike, should insert into his mouth a heated, blazing, burning, glowing iron ball—that would burn his lips, burn his mouth, burn his tongue, burn his throat, burn his chest, and carrying away his intestines and bowels, it would exit from below.\" \"I declare to you, O Bhikkhus, I proclaim to you, O Bhikkhus, that this indeed is better for that immoral person, of evil character, defiled, a wretched outcast: that a strong man, having opened his mouth with a heated iron spike, should insert into his mouth a heated, blazing, burning, glowing iron ball—that would burn his lips, burn his mouth, burn his tongue, burn his throat, burn his chest, and carrying away his intestines and bowels, it would exit from below. What is the reason for that? From that cause, O Bhikkhus, he might indeed meet death or suffering comparable to death, but he would not, because of that, after the breaking up of the body, after death, be reborn in a state of deprivation, a bad destination, a downfall, in hell. But if, O Bhikkhus, that immoral person, of evil character, defiled, a wretched outcast, partakes of alms-food given in faith by noble wealthy families, or brahmin wealthy families, or householder wealthy families, that will be for his long-term detriment and suffering, for after the breaking up of the body, after death, he is reborn in a state of deprivation, a bad destination, a downfall, in hell.\n\n\"What do you think, O Bhikkhus, which is better: that a strong man, taking him by the head or by the shoulders, should make him sit or lie down on a heated iron bed or a heated iron stool, or that one should make use of a bed or a stool given in faith by noble wealthy families, or brahmin wealthy families, or householder wealthy families?\"\n\n“This, Venerable Sir, is indeed better – to partake of beds and chairs offered out of faith by wealthy Khattiyas, Brahmins, or householders. It would be painful, Venerable Sir, if a strong man were to seize one by the head or shoulders and make one sit upon or lie upon a heated iron bed or iron chair.” “I declare to you, monks, I make it known to you, monks, that this very thing would indeed be better for that immoral person of evil conduct, who is like a foul refuse-eater, if a strong man were to seize him by the head or shoulders and make him sit upon or lie upon a heated iron bed or iron chair. And why is that? Because, monks, from that cause, he would only encounter death or suffering comparable to death, but he would certainly not, by reason of that, upon the body’s dissolution, after death, be reborn in a state of deprivation, a bad destination, a downfall, in hell. But if that immoral person of evil conduct, who is like a foul refuse-eater, partakes of beds and chairs offered out of faith by wealthy Khattiyas, Brahmins, or householders, that, monks, would truly be for his harm and suffering for a long time, and upon the body’s dissolution, after death, he would be reborn in a state of deprivation, a bad destination, a downfall, in hell.”\n\n“What do you think, monks? Which would indeed be better – if a strong man were to seize one by the feet and hold one head downwards and cast one into a blazing, incandescent, glowing pot of molten iron, where, boiling with effervescence, one might sometimes go up, sometimes go down, sometimes go across; or to partake of a dwelling offered out of faith by wealthy Khattiyas, Brahmins, or householders?” “This, Venerable Sir, is indeed better – to partake of a dwelling offered out of faith by wealthy Khattiyas, Brahmins, or householders. It would be painful, Venerable Sir, if a strong man were to seize one by the feet and hold one head downwards and cast one into a blazing, incandescent, glowing pot of molten iron, where, boiling with effervescence, one might sometimes go up, sometimes go down, sometimes go across.” “I declare to you, monks, I make it known to you, monks, that this very thing would indeed be better for that immoral person of evil conduct, who is like a foul refuse-eater, if a strong man were to seize him by the feet and hold him head downwards and cast him into a blazing, incandescent, glowing pot of molten iron, where, boiling with effervescence, he might sometimes go up, sometimes go down, sometimes go across. And why is that? Because, monks, from that cause, he would only encounter death or suffering comparable to death, but he would certainly not, by reason of that, upon the body’s dissolution, after death, be reborn in a state of deprivation, a bad destination, a downfall, in hell. But if that immoral person of evil conduct, who is like a foul refuse-eater, partakes of a dwelling offered out of faith by wealthy Khattiyas, Brahmins, or householders, that, monks, would truly be for his harm and suffering for a long time, and upon the body’s dissolution, after death, he would be reborn in a state of deprivation, a bad destination, a downfall, in hell.”\n\n“Therefore, monks, this is how you should train yourselves: ‘Those whose robes, almsfood, lodgings, and medicinal requisites for the sick we partake of – for them, these actions will be of great fruit, of great benefit. And for us, this going forth will not be barren, but fruitful and yielding returns.’ And in this way, monks, you should train yourselves: ‘Monks, if one regards one’s own welfare, it is sufficient to achieve it with diligence. Monks, if one regards the welfare of others, it is sufficient to achieve it with diligence. Monks, if one regards the welfare of both, it is sufficient to achieve it with diligence.’ ” The Blessed One said this. And while this exposition was being spoken, hot blood gushed from the mouths of sixty monks. Sixty monks, rejecting the training, reverted to a lower state, saying, “It is too difficult, Blessed One! It is too difficult, Blessed One!” The minds of sixty monks were liberated from the defilements, without clinging.",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයක භාග්‍යවතුන් වහන්සේ මහත් වූ භික්ෂුසංඝයා වහන්සේලා සමඟ කොසොල් ජනපදයෙහි චාරිකාවේ වැඩ සිටියහ. මාර්ගයෙහි ගමන් කරන අතරතුර එක්තරා ප්‍රදේශයක ඇවිලී, දැල්වී, තේජසින් බබළමින් තිබෙන මහත් වූ ගිනි කඳක් භාග්‍යවතුන් වහන්සේ දැක වදාළ සේක. එය දැක මගින් බැස, එක්තරා වෘක්ෂ මූලයක පනවන ලද අසුනක වැඩ සිටි සේක. වැඩ සිටි භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලා ඇමතූ සේක: \"මහණෙනි, අර ඇවිලී, දැල්වී, තේජසින් බබළමින් තිබෙන මහත් වූ ගිනි කඳ නුඹලා දකිනවා නොවේද?\" \"එසේය, භාග්‍යවතුන් වහන්සැ\"යි (ඔවුහු පිළිතුරු දුන්හ). \"මහණෙනි, නුඹලා ඒ කුමක් සිතන්නහුද? අර ඇවිලී, දැල්වී, තේජසින් බබළමින් තිබෙන මහත් වූ ගිනි කඳ වැළඳගෙන හිඳීම හෝ සැතපීම හෝ, නැතහොත් මෘදු, සියුම් අත්පා ඇති ක්ෂත්‍රිය කන්‍යාවක් හෝ බ්‍රාහ්මණ කන්‍යාවක් හෝ ගෘහපති කන්‍යාවක් හෝ වැළඳගෙන හිඳීම හෝ සැතපීම හෝ – මේ දෙකින් කවර දෙයක් නම් උතුම්ද?\" \"භාග්‍යවතුන් වහන්ස, ක්ෂත්‍රිය කන්‍යාවක් හෝ බ්‍රාහ්මණ කන්‍යාවක් හෝ ගෘහපති කන්‍යාවක් හෝ මෘදු, සියුම් අත්පා ඇති (ඇය) වැළඳගෙන හිඳීම හෝ සැතපීම හෝ යන මේ දෙයම උතුම්ය. භාග්‍යවතුන් වහන්ස, අර ඇවිලී, දැල්වී, තේජසින් බබළමින් තිබෙන මහත් වූ ගිනි කඳ වැළඳගෙන හිඳීම හෝ සැතපීම හෝ දුක් සහිත දෙයකි.\"\n\n\"මහණෙනි, මම නුඹලාට ප්‍රකාශ කරමි, මහණෙනි, මම නුඹලාට වටහා දෙමි. දුස්සීල වූ, පාප ධර්මයෙන් යුක්ත වූ, අපිරිසිදු සැක සහිත ක්‍රියාමාර්ග ඇත්තා වූ, රහසිගත ක්‍රියා ඇත්තා වූ, ශ්‍රමණයෙක් නොවී ශ්‍රමණ ප්‍රතිඥා ඇත්තා වූ, බ්‍රහ්මචාරියෙක් නොවී බ්‍රහ්මචාරී ප්‍රතිඥා ඇත්තා වූ, ඇතුළත කුණු වූ, ආශ්‍රවයන්ගෙන් කාන්දු වන්නා වූ, සාරය නැති කුණු කසළ වැන්නා වූ යම් පුද්ගලයෙකුට, අර ඇවිලී, දැල්වී, තේජසින් බබළමින් තිබෙන මහත් වූ ගිනි කඳ වැළඳගෙන හිඳීම හෝ සැතපීම හෝ මීට වඩා උතුම් වන්නේය. එයට හේතුව කුමක්ද? මහණෙනි, ඒ හේතුවෙන් ඔහු මරණයට හෝ පත්විය හැක, නැතහොත් මරණය තරම් දුකකට හෝ පත්විය හැක. එහෙත් ඒ හේතුවෙන් කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරයට උපදින්නේ නැත.\n\nමහණෙනි, යම් ඒ දුස්සීල වූ, පාප ධර්මයෙන් යුක්ත වූ, අපිරිසිදු සැක සහිත ක්‍රියාමාර්ග ඇත්තා වූ, රහසිගත ක්‍රියා ඇත්තා වූ, ශ්‍රමණයෙක් නොවී ශ්‍රමණ ප්‍රතිඥා ඇත්තා වූ, බ්‍රහ්මචාරියෙක් නොවී බ්‍රහ්මචාරී ප්‍රතිඥා ඇත්තා වූ, ඇතුළත කුණු වූ, ආශ්‍රවයන්ගෙන් කාන්දු වන්නා වූ, සාරය නැති කුණු කසළ වැන්නා වූ පුද්ගලයා ක්ෂත්‍රිය කන්‍යාවක් හෝ බ්‍රාහ්මණ කන්‍යාවක් හෝ ගෘහපති කන්‍යාවක් හෝ මෘදු, සියුම් අත්පා ඇති (ඇය) වැළඳගෙන හිඳී නම් හෝ සැතපේ නම් හෝ, මහණෙනි, ඒ කාරණය ඔහුට දීර්ඝ කාලයක් අහිත පිණිසත්, දුක පිණිසත් වේ. කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරයට උපදී.\n\n\"මහණෙනි, නුඹලා ඒ කුමක් සිතන්නහුද? කවර දෙයක් නම් උතුම්ද? යම් කෙනෙක් බලවත් පුරුෂයෙක් දැඩි වූ ලොම් කඹයකින් දෙපා වෙළාගෙන අතුල්ලා, ඒ කඹය සම සිඳී, සම කපා හම සිඳී, හම කපා මස් සිඳී, මස් කපා නහර සිඳී, නහර කපා ඇට සිඳී, ඇට කපා ඇට මිදුළු දක්වා පැමිණ සිටී නම් – මේ දෙය හෝ, නැතහොත් යම් කෙනෙක් ක්ෂත්‍රිය මහාසාලවරුන්ගේ හෝ බ්‍රාහ්මණ මහාසාලවරුන්ගේ හෝ ගෘහපති මහාසාලවරුන්ගේ හෝ ආචාරය පිළිගනී නම් – මේ දෙයින් කවර දෙයක් නම් උතුම්ද?\" \"භාග්‍යවතුන් වහන්ස, ක්ෂත්‍රිය මහාසාලවරුන්ගේ හෝ බ්‍රාහ්මණ මහාසාලවරුන්ගේ හෝ ගෘහපති මහාසාලවරුන්ගේ හෝ ආචාරය පිළිගැනීම යන මේ දෙයම උතුම්ය. භාග්‍යවතුන් වහන්ස, යම් කෙනෙක් බලවත් පුරුෂයෙක් දැඩි වූ ලොම් කඹයකින් දෙපා වෙළාගෙන අතුල්ලා, ඒ කඹය සම සිඳී, සම කපා හම සිඳී, හම කපා මස් සිඳී, මස් කපා නහර සිඳී, නහර කපා ඇට සිඳී, ඇට කපා ඇට මිදුළු දක්වා පැමිණ සිටීම දුක් සහිත දෙයකි.\"\n\n\"මහණෙනි, මම නුඹලාට ප්‍රකාශ කරමි, මහණෙනි, මම නුඹලාට වටහා දෙමි. දුස්සීල වූ, පාප ධර්මයෙන් යුක්ත වූ, අපිරිසිදු සැක සහිත ක්‍රියාමාර්ග ඇත්තා වූ, රහසිගත ක්‍රියා ඇත්තා වූ, ශ්‍රමණයෙක් නොවී ශ්‍රමණ ප්‍රතිඥා ඇත්තා වූ, බ්‍රහ්මචාරියෙක් නොවී බ්‍රහ්මචාරී ප්‍රතිඥා ඇත්තා වූ, ඇතුළත කුණු වූ, ආශ්‍රවයන්ගෙන් කාන්දු වන්නා වූ, සාරය නැති කුණු කසළ වැන්නා වූ යම් පුද්ගලයෙකුට, බලවත් පුරුෂයෙක් දැඩි වූ ලොම් කඹයකින් දෙපා වෙළාගෙන අතුල්ලා, ඒ කඹය සම සිඳී, සම කපා හම සිඳී, හම කපා මස් සිඳී, මස් කපා නහර සිඳී, නහර කපා ඇට සිඳී, ඇට කපා ඇට මිදුළු දක්වා පැමිණ සිටීම මීට වඩා උතුම් වන්නේය. එයට හේතුව කුමක්ද? මහණෙනි, ඒ හේතුවෙන් ඔහු මරණයට හෝ පත්විය හැක, නැතහොත් මරණය තරම් දුකකට හෝ පත්විය හැක. එහෙත් ඒ හේතුවෙන් කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරයට උපදින්නේ නැත.\n\nමහණෙනි, යම් ඒ දුස්සීල වූ, පාප ධර්මයෙන් යුක්ත වූ, අපිරිසිදු සැක සහිත ක්‍රියාමාර්ග ඇත්තා වූ, රහසිගත ක්‍රියා ඇත්තා වූ, ශ්‍රමණයෙක් නොවී ශ්‍රමණ ප්‍රතිඥා ඇත්තා වූ, බ්‍රහ්මචාරියෙක් නොවී බ්‍රහ්මචාරී ප්‍රතිඥා ඇත්තා වූ, ඇතුළත කුණු වූ, ආශ්‍රවයන්ගෙන් කාන්දු වන්නා වූ, සාරය නැති කුණු කසළ වැන්නා වූ පුද්ගලයා ක්ෂත්‍රිය මහාසාලවරුන්ගේ හෝ බ්‍රාහ්මණ මහාසාලවරුන්ගේ හෝ ගෘහපති මහාසාලවරුන්ගේ හෝ ආචාරය පිළිගනී නම්, මහණෙනි, ඒ කාරණය ඔහුට දීර්ඝ කාලයක් අහිත පිණිසත්, දුක පිණිසත් වේ. කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරයට උපදී.\n\n\"මහණෙනි, නුඹලා ඒ කුමක් සිතන්නහුද? කවර දෙයක් නම් උතුම්ද? යම් කෙනෙක් බලවත් පුරුෂයෙක් තියුණු, තෙලින් මඳින ලද හෙල්ලයකින් පපුවට පහර දෙයි නම් – මේ දෙය හෝ, නැතහොත් යම් කෙනෙක් ක්ෂත්‍රිය මහාසාලවරුන්ගේ හෝ බ්‍රාහ්මණ මහාසාලවරුන්ගේ හෝ ගෘහපති මහාසාලවරුන්ගේ හෝ ඇඳිලි බැඳ වඳිනු පිළිගනී නම් – මේ දෙයින් කවර දෙයක් නම් උතුම්ද?\" \"භාග්‍යවතුන් වහන්ස, ක්ෂත්‍රිය මහාසාලවරුන්ගේ හෝ බ්‍රාහ්මණ මහාසාලවරුන්ගේ හෝ ගෘහපති මහාසාලවරුන්ගේ හෝ ඇඳිලි බැඳ වඳිනු පිළිගැනීම යන මේ දෙයම උතුම්ය. භාග්‍යවතුන් වහන්ස, යම් කෙනෙක් බලවත් පුරුෂයෙක් තියුණු, තෙලින් මඳින ලද හෙල්ලයකින් පපුවට පහර දීම දුක් සහිත දෙයකි.\"\n\n\"මහණෙනි, මම නුඹලාට ප්‍රකාශ කරමි, මහණෙනි, මම නුඹලාට වටහා දෙමි. දුස්සීල වූ, පාප ධර්මයෙන් යුක්ත වූ, අපිරිසිදු සැක සහිත ක්‍රියාමාර්ග ඇත්තා වූ, රහසිගත ක්‍රියා ඇත්තා වූ, ශ්‍රමණයෙක් නොවී ශ්‍රමණ ප්‍රතිඥා ඇත්තා වූ, බ්‍රහ්මචාරියෙක් නොවී බ්‍රහ්මචාරී ප්‍රතිඥා ඇත්තා වූ, ඇතුළත කුණු වූ, ආශ්‍රවයන්ගෙන් කාන්දු වන්නා වූ, සාරය නැති කුණු කසළ වැන්නා වූ යම් පුද්ගලයෙකුට, බලවත් පුරුෂයෙක් තියුණු, තෙලින් මඳින ලද හෙල්ලයකින් පපුවට පහර දීම මීට වඩා උතුම් වන්නේය. එයට හේතුව කුමක්ද?\"\n\nභික්‍ෂූණි, එහෙයින්, ඔහු මරණයට පත්විය හැකි ය, නැතහොත් මරණ පමණ වූ දුකකට පත්විය හැකි ය. නමුත්, ඒ හේතුවෙන් කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැනක උපත ලබන්නේ නැත. භික්‍ෂූණි, යම් ඒ දුස්සීල, පාපධර්ම ඇත්තා වූ, කුණු පණුවා හා සමාන වූ පුද්ගලයා ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ (පූජනීය වශයෙන්) දෙනු ලබන දානමාන පිළිගනී ද, ඒකාන්තයෙන් ම, භික්‍ෂූණි, එය ඔහුට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් වන්නේ ය. කය බිඳී, මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැනක උපත ලබන්නේ ය.\n\nභික්‍ෂූණි, ඔබ මේ කුමක් සිතන්නෙහි ද, මේ දෙකෙන් කුමක් නම් ශ්‍රේෂ්ඨ ද? යම් බලවත් පුරුෂයෙක් තැවූ, ඇවිළුණු, දිලිසෙන, ජෝතිමත් වූ යකඩ පටකින් කය ඔතයි ද, නැතහොත්, ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ ශ්‍රද්ධාවෙන් දෙන ලද සිවුරක් පරිභෝග කරයි ද?\n\nභාග්‍යවතුන් වහන්ස, ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ ශ්‍රද්ධාවෙන් දෙන ලද සිවුරක් පරිභෝග කිරීම ම ශ්‍රේෂ්ඨ ය. භාග්‍යවතුන් වහන්ස, බලවත් පුරුෂයෙක් තැවූ, ඇවිළුණු, දිලිසෙන, ජෝතිමත් වූ යකඩ පටකින් කය ඔතන්නේ නම්, ඒකාන්තයෙන් ම එය දුකකි.\n\nභික්‍ෂූණි, මම ඔබට ප්‍රකාශ කරමි, භික්‍ෂූණි, මම ඔබට දන්වමි. ඒ දුස්සීල වූ, කුණු පණුවා හා සමාන වූ පුද්ගලයාට, බලවත් පුරුෂයෙක් තැවූ, ඇවිළුණු, දිලිසෙන, ජෝතිමත් වූ යකඩ පටකින් කය ඔතනවා යනු ම ශ්‍රේෂ්ඨ වන්නේ ය. එයට හේතුව කුමක් ද? භික්‍ෂූණි, එහෙයින්, ඔහු මරණයට පත්විය හැකි ය, නැතහොත් මරණ පමණ වූ දුකකට පත්විය හැකි ය. නමුත්, ඒ හේතුවෙන් කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැනක උපත ලබන්නේ නැත. භික්‍ෂූණි, යම් ඒ දුස්සීල වූ, කුණු පණුවා හා සමාන වූ පුද්ගලයා ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ ශ්‍රද්ධාවෙන් දෙන ලද සිවුරක් පරිභෝග කරයි ද, ඒකාන්තයෙන් ම, භික්‍ෂූණි, එය ඔහුට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් වන්නේ ය. කය බිඳී, මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැනක උපත ලබන්නේ ය.\n\nභික්‍ෂූණි, ඔබ මේ කුමක් සිතන්නෙහි ද, මේ දෙකෙන් කුමක් නම් ශ්‍රේෂ්ඨ ද? යම් බලවත් පුරුෂයෙක් තැවූ යකඩ කටුවකින් කට විවෘත කර, තැවූ, ඇවිළුණු, දිලිසෙන, ජෝතිමත් වූ යකඩ ගුලියක් කටට දමයි ද, එය ඔහුගේ තොල් ද දවයි, මුඛය ද දවයි, දිව ද දවයි, උගුර ද දවයි, පපුව ද දවයි, අන්ත්‍ර ද, අන්ත්‍ර ආශ්‍රිත කොටස් ද ගෙන පහළට ගොස් පිටතට යයි ද, නැතහොත්, ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ ශ්‍රද්ධාවෙන් දෙන ලද පිණ්ඩපාතයක් පරිභෝග කරයි ද?\n\nභාග්‍යවතුන් වහන්ස, ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ ශ්‍රද්ධාවෙන් දෙන ලද පිණ්ඩපාතයක් පරිභෝග කිරීම ම ශ්‍රේෂ්ඨ ය. භාග්‍යවතුන් වහන්ස, බලවත් පුරුෂයෙක් තැවූ යකඩ කටුවකින් කට විවෘත කර, තැවූ, ඇවිළුණු, දිලිසෙන, ජෝතිමත් වූ යකඩ ගුලියක් කටට දමන්නේ නම් – එය ඔහුගේ තොල් ද දවයි, මුඛය ද දවයි, දිව ද දවයි, උගුර ද දවයි, පපුව ද දවයි, අන්ත්‍ර ද, අන්ත්‍ර ආශ්‍රිත කොටස් ද ගෙන පහළට ගොස් පිටතට යන්නේ නම්, ඒකාන්තයෙන් ම එය දුකකි.\n\nභික්‍ෂූණි, මම ඔබට ප්‍රකාශ කරමි, භික්‍ෂූණි, මම ඔබට දන්වමි. ඒ දුස්සීල වූ, කුණු පණුවා හා සමාන වූ පුද්ගලයාට, බලවත් පුරුෂයෙක් තැවූ යකඩ කටුවකින් කට විවෘත කර, තැවූ, ඇවිළුණු, දිලිසෙන, ජෝතිමත් වූ යකඩ ගුලියක් කටට දමන්නේ නම් – එය ඔහුගේ තොල් ද දවයි, මුඛය ද දවයි, දිව ද දවයි, උගුර ද දවයි, පපුව ද දවයි, අන්ත්‍ර ද, අන්ත්‍ර ආශ්‍රිත කොටස් ද ගෙන පහළට ගොස් පිටතට යන්නේ නම්, ඒකාන්තයෙන් ම එය ශ්‍රේෂ්ඨ වන්නේ ය. එයට හේතුව කුමක් ද? භික්‍ෂූණි, එහෙයින්, ඔහු මරණයට පත්විය හැකි ය, නැතහොත් මරණ පමණ වූ දුකකට පත්විය හැකි ය. නමුත්, ඒ හේතුවෙන් කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැනක උපත ලබන්නේ නැත. භික්‍ෂූණි, යම් ඒ දුස්සීල, පාපධර්ම ඇත්තා වූ, කුණු පණුවා හා සමාන වූ පුද්ගලයා ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ ශ්‍රද්ධාවෙන් දෙන ලද පිණ්ඩපාතයක් පරිභෝග කරයි ද, ඒකාන්තයෙන් ම, එය ඔහුට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් වන්නේ ය. කය බිඳී, මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැනක උපත ලබන්නේ ය.\n\nභික්‍ෂූණි, ඔබ මේ කුමක් සිතන්නෙහි ද, මේ දෙකෙන් කුමක් නම් ශ්‍රේෂ්ඨ ද? යම් බලවත් පුරුෂයෙක් හිසින් හෝ කරෙන් හෝ අල්ලාගෙන තැවූ යකඩ මංචකයක් හෝ යකඩ පුටුවක් හෝ මත වාඩි කරවයි ද, නැතහොත් හාන්සි කරවයි ද, නැතහොත්, ක්ෂත්‍රීය මහාශාලාවලින් හෝ බ්‍රාහ්මණ මහාශාලාවලින් හෝ ගෘහපති මහාශාලාවලින් හෝ ශ්‍රද්ධාවෙන් දෙන ලද ආසන හා මංචක පරිභෝග කරයි ද?\n\nඑයම යහපති ස්වාමීනි, යම් හෙයකින් මහේශාක්‍ය ක්ෂත්‍රියයන්ගේ හෝ මහේශාක්‍ය බ්‍රාහ්මණයන්ගේ හෝ මහේශාක්‍ය ගෘහපතියන්ගේ හෝ ශ්‍රද්ධාවෙන් දෙන ලද යහන් ආසන පරිභෝග කරන්නේ නම්. ස්වාමීනි, බලවත් පුරුෂයෙක් යම් අයෙකුගේ හිසින් අල්ලා හෝ කරින් අල්ලා හෝ රත්වූ යකඩ යහනක හෝ යකඩ පුටුවක හෝ හිඳුවන්නේ නම් හෝ හෝන්සේ නම් හෝ එය දුකකි.\n\nමහණෙනි, මම ඔබට දන්වමි; මහණෙනි, මම ඔබට පැහැදිලි කරමි. ඒ දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති, කුණු කසළ වැනි පුද්ගලයාට, බලවත් පුරුෂයෙක් හිසින් අල්ලා හෝ කරින් අල්ලා හෝ රත්වූ යකඩ යහනක හෝ යකඩ පුටුවක හෝ හිඳුවන්නේ නම් හෝ හෝන්සේ නම් හෝ එයම යහපත් වේ. එයට හේතුව කුමක්ද? මහණෙනි, එය හේතුකොටගෙන ඔහු මරණයට පත්වන්නේ හෝ මරණය හා සමාන දුකකට පත්වන්නේ හෝ වේ. නමුත් ඒ හේතුවෙන් ඔහු කය බිඳී, මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන සතර දුර්ගතිවල උපදින්නේ නැත. මහණෙනි, යම් හෙයකින් ඒ දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති, කුණු කසළ වැනි පුද්ගලයා මහේශාක්‍ය ක්ෂත්‍රියයන්ගේ හෝ මහේශාක්‍ය බ්‍රාහ්මණයන්ගේ හෝ මහේශාක්‍ය ගෘහපතියන්ගේ හෝ ශ්‍රද්ධාවෙන් දෙන ලද යහන් ආසන පරිභෝග කරන්නේද, මහණෙනි, එය ඔහුට බොහෝ කලක් අහිත පිණිසත් දුක් පිණිසත් වන්නේය. ඔහු කය බිඳී, මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන සතර දුර්ගතිවල උපදී.\n\nමහණෙනි, ඒ කුමක් සිතන්නෙහිද? කුමක්ද උතුම් වන්නේ – බලවත් පුරුෂයෙක් යම් අයෙකුගේ හිස පහතටත්, පාද ඉහළටත් වන සේ ගෙන, ඇවිලී, දැවී, ජ්වලිතව පවතින රත්වූ යකඩ තාච්චියක දමන්නේ නම්, ඔහු එහි පෙන නංවමින් තැම්බෙමින් සමහර විට ඉහළට යන්නේය, සමහර විට පහළට යන්නේය, සමහර විට තිරශ්චීනව යන්නේය. එසේ නොමැතිව මහේශාක්‍ය ක්ෂත්‍රියයන්ගේ හෝ මහේශාක්‍ය බ්‍රාහ්මණයන්ගේ හෝ මහේශාක්‍ය ගෘහපතියන්ගේ හෝ ශ්‍රද්ධාවෙන් දෙන ලද විහාරය පරිභෝග කරන්නේ නම්, කුමක්ද උතුම් වන්නේ?\n\nඑයම යහපති ස්වාමීනි, යම් හෙයකින් මහේශාක්‍ය ක්ෂත්‍රියයන්ගේ හෝ මහේශාක්‍ය බ්‍රාහ්මණයන්ගේ හෝ මහේශාක්‍ය ගෘහපතියන්ගේ හෝ ශ්‍රද්ධාවෙන් දෙන ලද විහාරය පරිභෝග කරන්නේ නම්. ස්වාමීනි, බලවත් පුරුෂයෙක් යම් අයෙකුගේ හිස පහතටත්, පාද ඉහළටත් වන සේ ගෙන, ඇවිලී, දැවී, ජ්වලිතව පවතින රත්වූ යකඩ තාච්චියක දමන්නේ නම්, ඔහු එහි පෙන නංවමින් තැම්බෙමින් සමහර විට ඉහළට යන්නේය, සමහර විට පහළට යන්නේය, සමහර විට තිරශ්චීනව යන්නේය. එය දුකකි.\n\nමහණෙනි, මම ඔබට දන්වමි; මහණෙනි, මම ඔබට පැහැදිලි කරමි. ඒ දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති, කුණු කසළ වැනි පුද්ගලයාට, බලවත් පුරුෂයෙක් හිස පහතටත්, පාද ඉහළටත් වන සේ ගෙන, ඇවිලී, දැවී, ජ්වලිතව පවතින රත්වූ යකඩ තාච්චියක දමන්නේ නම්, ඔහු එහි පෙන නංවමින් තැම්බෙමින් සමහර විට ඉහළට යන්නේය, සමහර විට පහළට යන්නේය, සමහර විට තිරශ්චීනව යන්නේය. එයම යහපත් වේ. එයට හේතුව කුමක්ද? මහණෙනි, එය හේතුකොටගෙන ඔහු මරණයට පත්වන්නේ හෝ මරණය හා සමාන දුකකට පත්වන්නේ හෝ වේ. නමුත් ඒ හේතුවෙන් ඔහු කය බිඳී, මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන සතර දුර්ගතිවල උපදින්නේ නැත. මහණෙනි, යම් හෙයකින් ඒ දුශ්ශීල වූ, පාපී ස්වභාවයක් ඇති, කුණු කසළ වැනි පුද්ගලයා මහේශාක්‍ය ක්ෂත්‍රියයන්ගේ හෝ මහේශාක්‍ය බ්‍රාහ්මණයන්ගේ හෝ මහේශාක්‍ය ගෘහපතියන්ගේ හෝ ශ්‍රද්ධාවෙන් දෙන ලද විහාරය පරිභෝග කරන්නේද, මහණෙනි, එය ඔහුට බොහෝ කලක් අහිත පිණිසත් දුක් පිණිසත් වන්නේය. ඔහු කය බිඳී, මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන සතර දුර්ගතිවල උපදී.\n\nඑබැවින් මහණෙනි, මෙහිදී මෙසේ හික්මිය යුතුය – ‘යම් අයගේ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර අපි පරිභෝග කරන්නෙමුද, ඔවුන්ගේ ඒ ක්‍රියා මහාඵලදාවන, මහානිසංස ඇති වනු ඇත. අපගේ මේ පැවිද්ද ද වඳ නොවූ, ඵල ඇති, සප්‍රතිලාභී වනු ඇත’ යනුවෙනි. මහණෙනි, මෙසේ හික්මිය යුතුය – ‘මහණෙනි, තමාගේ අර්ථය දකිමින් වුවද අප්‍රමාදයෙන් යුතුව සම්පූර්ණ කිරීමට සුදුසුය. මහණෙනි, අනුන්ගේ අර්ථය දකිමින් වුවද අප්‍රමාදයෙන් යුතුව සම්පූර්ණ කිරීමට සුදුසුය. මහණෙනි, දෙලොවම අර්ථය දකිමින් වුවද අප්‍රමාදයෙන් යුතුව සම්පූර්ණ කිරීමට සුදුසුය.’\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මේ විස්තර දේශනාව දේශනා කරද්දී හැටක් පමණ භික්ෂූන් වහන්සේලාට උණු ලේ මුඛයෙන් පිට විය. හැටක් පමණ භික්ෂූන් වහන්සේලා ‘ස්වාමීනි, ඉතාමත් දුෂ්කරය, ස්වාමීනි, ඉතාමත් දුෂ්කරය’ යැයි පවසමින් ශික්ෂාව අත්හැර හීනාවර්තනය වූහ. හැටක් පමණ භික්ෂූන් වහන්සේලාගේ සිත කිසිදු උපාදානයකින් තොරව ආසවයන්ගෙන් මිදුණි. අටවෙනි සූත්‍රයයි.",
      "paliTitle": "Aggikkhandhopamasuttaṃ",
      "englishTitle": "The Mass of Fire Sutta",
      "sinhalaTitle": "අග්ගික්ඛන්ධෝපම සූත්‍රය"
    },
    {
      "number": 73,
      "pali": "[a. ni. 6.54; 7.66] ‘‘Bhūtapubbaṃ, bhikkhave, sunetto nāma satthā ahosi titthakaro kāmesu vītarāgo. Sunettassa kho pana, bhikkhave, satthuno anekāni sāvakasatāni ahesuṃ. Sunetto satthā sāvakānaṃ brahmalokasahabyatāya dhammaṃ desesi. Ye kho pana, bhikkhave [ye kho bhikkhave (sī. syā.)], sunettassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni nappasādesuṃ te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjiṃsu. Ye kho pana, bhikkhave, sunettassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni pasādesuṃ te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjiṃsu. ‘‘Bhūtapubbaṃ, bhikkhave, mūgapakkho nāma satthā ahosi…pe… aranemi nāma satthā ahosi… pe… kuddālako [kuddālo (sī. syā.)] nāma satthā ahosi…pe… hatthipālo nāma satthā ahosi…pe… jotipālo nāma satthā ahosi…pe… arako nāma satthā ahosi titthakaro kāmesu vītarāgo. Arakassa kho pana, bhikkhave, satthuno anekāni sāvakasatāni ahesuṃ. Arako nāma satthā sāvakānaṃ brahmalokasahabyatāya dhammaṃ desesi. Ye kho pana, bhikkhave, arakassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni nappasādesuṃ, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjiṃsu. Ye kho pana, bhikkhave, arakassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni pasādesuṃ, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjiṃsu. ‘‘Taṃ kiṃ maññatha, bhikkhave, yo ime satta satthāre titthakare kāmesu vītarāge anekasataparivāre sasāvakasaṅghe paduṭṭhacitto akkoseyya paribhāseyya, bahuṃ so apuññaṃ pasaveyyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yo, bhikkhave, ime satta satthāre titthakare kāmesu vītarāge anekasataparivāre sasāvakasaṅghe paduṭṭhacitto akkoseyya paribhāseyya, bahuṃ so apuññaṃ pasaveyya. Yo ekaṃ diṭṭhisampannaṃ puggalaṃ paduṭṭhacitto akkosati paribhāsati, ayaṃ tato bahutaraṃ apuññaṃ pasavati. Taṃ kissa hetu? Nāhaṃ, bhikkhave, ito bahiddhā evarūpiṃ khantiṃ vadāmi yathāmaṃ sabrahmacārīsu’’. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘na no sabrahmacārīsu [na tveva amhaṃ sabrahmacārīsu (syā.) aṅguttaranikāye aññathā dissati] cittāni paduṭṭhāni bhavissantī’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ.",
      "english": "Monks, in the past, there was a teacher named Sunetta, a founder of a sect, who was dispassionate towards sensual pleasures. Indeed, monks, the teacher Sunetta had many hundreds of disciples. The teacher Sunetta taught the Dhamma to his disciples for companionship with the Brahma world. However, monks, those who did not gladden their minds towards the teacher Sunetta as he taught the Dhamma for companionship with the Brahma world, they, with the breaking up of the body, after death, reappeared in a state of deprivation, a bad destination, a downfall, in hell. But those, monks, who gladdened their minds towards the teacher Sunetta as he taught the Dhamma for companionship with the Brahma world, they, with the breaking up of the body, after death, reappeared in a good destination, in a heavenly world.\n\nMonks, in the past, there was also a teacher named Mugapakkha, a founder of a sect, who was dispassionate towards sensual pleasures. Indeed, that teacher had many hundreds of disciples. He taught the Dhamma to his disciples for companionship with the Brahma world. Those who did not gladden their minds towards him as he taught, they, with the breaking up of the body, after death, reappeared in a state of deprivation, a bad destination, a downfall, in hell. Those who gladdened their minds towards him, they, with the breaking up of the body, after death, reappeared in a good destination, in a heavenly world. Similarly, there was a teacher named Aranemi, a founder of a sect, who was dispassionate towards sensual pleasures. Indeed, that teacher had many hundreds of disciples. He taught the Dhamma to his disciples for companionship with the Brahma world. Those who did not gladden their minds towards him as he taught, they, with the breaking up of the body, after death, reappeared in a state of deprivation, a bad destination, a downfall, in hell. Those who gladdened their minds towards him, they, with the breaking up of the body, after death, reappeared in a good destination, in a heavenly world. Similarly, there was a teacher named Kuddalaka, a founder of a sect, who was dispassionate towards sensual pleasures. Indeed, that teacher had many hundreds of disciples. He taught the Dhamma to his disciples for companionship with the Brahma world. Those who did not gladden their minds towards him as he taught, they, with the breaking up of the body, after death, reappeared in a state of deprivation, a bad destination, a downfall, in hell. Those who gladdened their minds towards him, they, with the breaking up of the body, after death, reappeared in a good destination, in a heavenly world. Similarly, there was a teacher named Hatthalipala, a founder of a sect, who was dispassionate towards sensual pleasures. Indeed, that teacher had many hundreds of disciples. He taught the Dhamma to his disciples for companionship with the Brahma world. Those who did not gladden their minds towards him as he taught, they, with the breaking up of the body, after death, reappeared in a state of deprivation, a bad destination, a downfall, in hell. Those who gladdened their minds towards him, they, with the breaking up of the body, after death, reappeared in a good destination, in a heavenly world. Similarly, there was a teacher named Jotapala, a founder of a sect, who was dispassionate towards sensual pleasures. Indeed, that teacher had many hundreds of disciples. He taught the Dhamma to his disciples for companionship with the Brahma world. Those who did not gladden their minds towards him as he taught, they, with the breaking up of the body, after death, reappeared in a state of deprivation, a bad destination, a downfall, in hell. Those who gladdened their minds towards him, they, with the breaking up of the body, after death, reappeared in a good destination, in a heavenly world.\n\nMonks, in the past, there was also a teacher named Araka, a founder of a sect, who was dispassionate towards sensual pleasures. Indeed, monks, the teacher Araka had many hundreds of disciples. The teacher Araka taught the Dhamma to his disciples for companionship with the Brahma world. However, monks, those who did not gladden their minds towards the teacher Araka as he taught the Dhamma for companionship with the Brahma world, they, with the breaking up of the body, after death, reappeared in a state of deprivation, a bad destination, a downfall, in hell. But those, monks, who gladdened their minds towards the teacher Araka as he taught the Dhamma for companionship with the Brahma world, they, with the breaking up of the body, after death, reappeared in a good destination, in a heavenly world.\n\nWhat do you think, monks? If someone were to revile and insult with a corrupted mind these seven teachers — founders of sects, dispassionate towards sensual pleasures, surrounded by many hundreds of disciples, together with their assemblies of disciples — would they generate much demerit?\n“Yes, Venerable Sir.”\n“Monks, if someone were to revile and insult with a corrupted mind these seven teachers — founders of sects, dispassionate towards sensual pleasures, surrounded by many hundreds of disciples, together with their assemblies of disciples — they would generate much demerit. But if someone, with a corrupted mind, reviles and insults a single person who is accomplished in right view, that person generates far greater demerit than that. And why is that? Monks, I do not declare such a standard of patience and mutual respect outside of this community as I do among my fellow practitioners.”\n\n“Therefore, monks, you should train yourselves thus: ‘Our minds will not be corrupted towards our fellow practitioners.’ That is how you should train yourselves, monks.”",
      "sinhala": "භික්ෂූණි, පෙර කල්හි සුනෙත්ත නම් ශාස්තෘවරයෙක් විය. ඔහු තීර්ථකයන්ගේ නායකයෙක් වූ අතර කාමයන් කෙරෙහි වීතරාගී විය. භික්ෂූණි, ඒ සුනෙත්ත ශාස්තෘවරයාට අനേක ශ්‍රාවක සිය ගණනක් සිටියහ. සුනෙත්ත ශාස්තෘවරයා තම ශ්‍රාවකයන්ට බ්‍රහ්ම ලෝකයේ සහයෝගයට (උපත ලැබීමට) හේතු වන ධර්මය දේශනා කළේය. භික්ෂූණි, යම් අයෙක් සුනෙත්ත ශාස්තෘවරයා බ්‍රහ්ම ලෝකයේ සහයෝගයට හේතු වන ධර්මය දේශනා කරන විට සිත පහදවා නොගත්තෝද, ඔවුහු කය බිඳී මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන තැන්හි උපන්නාහ. භික්ෂූණි, යම් අයෙක් සුනෙත්ත ශාස්තෘවරයා බ්‍රහ්ම ලෝකයේ සහයෝගයට හේතු වන ධර්මය දේශනා කරන විට සිත පහදවා ගත්තෝද, ඔවුහු කය බිඳී මරණයෙන් පසු සුගති, ස්වර්ග ලෝකයන්හි උපන්නාහ.\n\nභික්ෂූණි, පෙර කල්හි මූගපක්ඛ නම් ශාස්තෘවරයෙක් විය. ඔහු තීර්ථකයන්ගේ නායකයෙක් වූ අතර කාමයන් කෙරෙහි වීතරාගී විය. භික්ෂූණි, අරණේමි නම් ශාස්තෘවරයෙක් විය. ඔහුද තීර්ථකයන්ගේ නායකයෙක් වූ අතර කාමයන් කෙරෙහි වීතරාගී විය. භික්ෂූණි, කුද්දාලක නම් ශාස්තෘවරයෙක් විය. ඔහුද තීර්ථකයන්ගේ නායකයෙක් වූ අතර කාමයන් කෙරෙහි වීතරාගී විය. භික්ෂූණි, හත්ථිපාල නම් ශාස්තෘවරයෙක් විය. ඔහුද තීර්ථකයන්ගේ නායකයෙක් වූ අතර කාමයන් කෙරෙහි වීතරාගී විය. භික්ෂූණි, ජෝතිපාල නම් ශාස්තෘවරයෙක් විය. ඔහුද තීර්ථකයන්ගේ නායකයෙක් වූ අතර කාමයන් කෙරෙහි වීතරාගී විය. භික්ෂූණි, අරක් නම් ශාස්තෘවරයෙක් විය. ඔහුද තීර්ථකයන්ගේ නායකයෙක් වූ අතර කාමයන් කෙරෙහි වීතරාගී විය. භික්ෂූණි, ඒ අරක් ශාස්තෘවරයාට අനേක ශ්‍රාවක සිය ගණනක් සිටියහ. අරක් ශාස්තෘවරයා තම ශ්‍රාවකයන්ට බ්‍රහ්ම ලෝකයේ සහයෝගයට හේතු වන ධර්මය දේශනා කළේය. භික්ෂූණි, යම් අයෙක් අරක් ශාස්තෘවරයා බ්‍රහ්ම ලෝකයේ සහයෝගයට හේතු වන ධර්මය දේශනා කරන විට සිත පහදවා නොගත්තෝද, ඔවුහු කය බිඳී මරණයෙන් පසු අපාය, දුගති, විනිපාත, නිරය යන තැන්හි උපන්නාහ. භික්ෂූණි, යම් අයෙක් අරක් ශාස්තෘවරයා බ්‍රහ්ම ලෝකයේ සහයෝගයට හේතු වන ධර්මය දේශනා කරන විට සිත පහදවා ගත්තෝද, ඔවුහු කය බිඳී මරණයෙන් පසු සුගති, ස්වර්ග ලෝකයන්හි උපන්නාහ.\n\nභික්ෂූණි, මේ ගැන කුමක් සිතන්නෙහිද? යම් අයෙක් කාමයන් කෙරෙහි වීතරාගී වූ, අനേක ශ්‍රාවක සිය ගණනක් පිරිවරා සිටි, මේ සත් තීර්ථක ශාස්තෘවරුන්ට හා ඔවුන්ගේ ශ්‍රාවක සංඝයාට දුෂ්ට සිතින් බණිනවා නම්, පරිභව කරනවා නම්, ඔහු බොහෝ අකුසල් රැස් කරගන්නවා නොවේදැයි විමසූ සේක.\n“එසේය, භාග්‍යවතුන් වහන්ස.”\n“භික්ෂූණි, යම් අයෙක් කාමයන් කෙරෙහි වීතරාගී වූ, අനേක ශ්‍රාවක සිය ගණනක් පිරිවරා සිටි, මේ සත් තීර්ථක ශාස්තෘවරුන්ට හා ඔවුන්ගේ ශ්‍රාවක සංඝයාට දුෂ්ට සිතින් බණිනවා නම්, පරිභව කරනවා නම්, ඔහු බොහෝ අකුසල් රැස් කරගනී. යම් අයෙක් එක් දෘෂ්ටි සම්පන්න පුද්ගලයෙකුට දුෂ්ට සිතින් බණීද, පරිභව කරීද, ඔහු ඊටත් වඩා බොහෝ අකුසල් රැස් කරගනී. ඒ කවර හෙයින්ද යත්? භික්ෂූණි, මාගේ බ්‍රහ්මචාරීන් අතර යම් ඉවසීමක් වේද, එබඳු ඉවසීමක් මේ ශාසනයෙන් පිටත (අන්‍ය ශාසනවල) ඇතැයි මම නොකියමි.”\n“එබැවින්, භික්ෂූණි, මෙසේ හික්මිය යුතුය – ‘අපගේ බ්‍රහ්මචාරීන් කෙරෙහි සිත දූෂ්‍ය නොවන්නේය’ යනුවෙනි. භික්ෂූණි, ඔබ මෙසේම හික්මිය යුතු වන්නේය.”",
      "paliTitle": "Sunettasuttaṃ",
      "englishTitle": "The Discourse about Sunetta",
      "sinhalaTitle": "සුනෙත්ත සූත්‍රය"
    },
    {
      "number": 74,
      "pali": "‘‘Bhūtapubbaṃ, bhikkhave, arako nāma satthā ahosi titthakaro kāmesu vītarāgo. Arakassa kho pana, bhikkhave, satthuno anekāni sāvakasatāni ahesuṃ. Arako satthā sāvakānaṃ evaṃ dhammaṃ deseti – appakaṃ, brāhmaṇa, jīvitaṃ manussānaṃ parittaṃ lahukaṃ [lahusaṃ (ṭīkā)] bahudukkhaṃ bahupāyāsaṃ mantāyaṃ [mantāya (sabbattha) ṭīkā passitabbā] boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. ‘‘Seyyathāpi, brāhmaṇa, tiṇagge ussāvabindu sūriye uggacchante khippaṃyeva paṭivigacchati, na ciraṭṭhitikaṃ hoti; evamevaṃ kho, brāhmaṇa, ussāvabindūpamaṃ jīvitaṃ manussānaṃ parittaṃ lahukaṃ bahudukkhaṃ bahupāyāsaṃ mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. ‘‘Seyyathāpi, brāhmaṇa, thullaphusitake deve vassante udakabubbuḷaṃ [udakapupphuḷaṃ (ka.)] khippaṃyeva paṭivigacchati, na ciraṭṭhitikaṃ hoti; evamevaṃ kho, brāhmaṇa, udakabubbuḷūpamaṃ jīvitaṃ manussānaṃ parittaṃ lahukaṃ bahudukkhaṃ bahupāyāsaṃ mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. ‘‘Seyyathāpi, brāhmaṇa, udake daṇḍarāji khippaṃyeva paṭivigacchati, na ciraṭṭhitikā hoti; evamevaṃ kho, brāhmaṇa, udake daṇḍarājūpamaṃ jīvitaṃ manussānaṃ parittaṃ…pe… natthi jātassa amaraṇaṃ. ‘‘Seyyathāpi, brāhmaṇa, nadī pabbateyyā dūraṅgamā sīghasotā hārahārinī, natthi so khaṇo vā layo vā muhutto vā yaṃ sā [yāya (ka.)] āvattati [tharati (sī.), dharati (syā.), avatiṭṭheyya (?)], atha kho sā gacchateva vattateva sandateva; evamevaṃ kho, brāhmaṇa, nadīpabbateyyūpamaṃ jīvitaṃ manussānaṃ parittaṃ lahukaṃ…pe… natthi jātassa amaraṇaṃ. ‘‘Seyyathāpi, brāhmaṇa, balavā puriso jivhagge kheḷapiṇḍaṃ saṃyūhitvā akasireneva vameyya [patāpeyya (ka.)]; evamevaṃ kho, brāhmaṇa, kheḷapiṇḍūpamaṃ jīvitaṃ manussānaṃ parittaṃ…pe… natthi jātassa amaraṇaṃ. ‘‘Seyyathāpi, brāhmaṇa, divasaṃsantatte ayokaṭāhe maṃsapesi [maṃsapesī (sī. syā.)] pakkhittā khippaṃyeva paṭivigacchati, na ciraṭṭhitikā hoti; evamevaṃ kho, brāhmaṇa, maṃsapesūpamaṃ jīvitaṃ manussānaṃ parittaṃ…pe… natthi jātassa amaraṇaṃ. ‘‘Seyyathāpi, brāhmaṇa, gāvī vajjhā āghātanaṃ nīyamānā yaṃ yadeva pādaṃ uddharati, santikeva hoti vadhassa santikeva maraṇassa; evamevaṃ kho, brāhmaṇa, govajjhūpamaṃ [gāvīvajjhūpamaṃ (sī. syā.)] jīvitaṃ manussānaṃ parittaṃ lahukaṃ bahudukkhaṃ bahupāyāsaṃ mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇa’’nti. ‘‘Tena kho pana, bhikkhave, samayena manussānaṃ saṭṭhivassasahassāni āyuppamāṇaṃ ahosi, pañcavassasatikā kumārikā alaṃpateyyā ahosi. Tena kho pana, bhikkhave, samayena manussānaṃ chaḷeva ābādhā ahesuṃ – sītaṃ, uṇhaṃ, jighacchā, pipāsā, uccāro, passāvo. So hi nāma, bhikkhave, arako satthā evaṃ dīghāyukesu manussesu evaṃ ciraṭṭhitikesu evaṃ appābādhesu sāvakānaṃ evaṃ dhammaṃ desessati – ‘appakaṃ, brāhmaṇa, jīvitaṃ manussānaṃ parittaṃ lahukaṃ bahudukkhaṃ bahupāyāsaṃ mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇa’’’nti. ‘‘Etarahi taṃ, bhikkhave, sammā vadamāno vadeyya – ‘appakaṃ jīvitaṃ manussānaṃ parittaṃ lahukaṃ bahudukkhaṃ bahupāyāsaṃ mantāyaṃ boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇa’nti. Etarahi, bhikkhave, yo ciraṃ jīvati so vassasataṃ appaṃ vā bhiyyo. Vassasataṃ kho pana, bhikkhave, jīvanto tīṇiyeva utusatāni jīvati – utusataṃ hemantānaṃ, utusataṃ gimhānaṃ, utusataṃ vassānaṃ. Tīṇi kho pana, bhikkhave, utusatāni jīvanto dvādasa [dvādasaṃ (sī. ka.)] yeva māsasatāni jīvati – cattāri māsasatāni hemantānaṃ, cattāri māsasatāni gimhānaṃ, cattāri māsasatāni vassānaṃ. Dvādasa kho pana, bhikkhave, māsasatāni jīvanto catuvīsatiyeva addhamāsasatāni jīvati – aṭṭhaddhamāsasatāni hemantānaṃ, aṭṭhaddhamāsasatāni gimhānaṃ, aṭṭhaddhamāsasatāni vassānaṃ. Catuvīsati kho pana, bhikkhave, addhamāsasatāni jīvanto chattiṃsaṃyeva rattisahassāni jīvati – dvādasa rattisahassāni hemantānaṃ, dvādasa rattisahassāni gimhānaṃ, dvādasa rattisahassāni vassānaṃ. Chattiṃsaṃ kho pana, bhikkhave, rattisahassāni jīvanto dvesattatiyeva [dvesattatiññeva (syā.), dvesattatiñceva (ka.)] bhattasahassāni bhuñjati – catuvīsati bhattasahassāni hemantānaṃ, catuvīsati bhattasahassāni gimhānaṃ, catuvīsati bhattasahassāni vassānaṃ saddhiṃ mātuthaññāya saddhiṃ bhattantarāyena. ‘‘Tatrime bhattantarāyā kapimiddhopi bhattaṃ na bhuñjati, dukkhitopi bhattaṃ na bhuñjati, byādhitopi bhattaṃ na bhuñjati, uposathikopi bhattaṃ na bhuñjati, alābhakenapi bhattaṃ na bhuñjati. Iti kho, bhikkhave, mayā vassasatāyukassa manussassa āyupi saṅkhāto [saṅkhātaṃ (?)], āyuppamāṇampi saṅkhātaṃ, utūpi saṅkhātā, saṃvaccharāpi saṅkhātā, māsāpi saṅkhātā, addhamāsāpi saṅkhātā, rattipi saṅkhātā, divāpi saṅkhātā, bhattāpi saṅkhātā, bhattantarāyāpi saṅkhātā. Yaṃ, bhikkhave, satthārā karaṇīyaṃ sāvakānaṃ hitesinā anukampakena anukampaṃ upādāya; kataṃ vo taṃ mayā etāni, bhikkhave, rukkhamūlāni etāni suññāgārāni. Jhāyatha, bhikkhave, mā pamādattha; mā pacchā vippaṭisārino ahuvattha. Ayaṃ vo amhākaṃ anusāsanī’’ti. Dasamaṃ. ",
      "english": "Once upon a time, monks, there was a teacher named Araka, a founder of a sect, who was free from passion for sensual pleasures. Indeed, monks, the teacher Araka had many hundreds of disciples. The teacher Araka taught his disciples the Dhamma in this way: “O brahmins, the life of human beings is short, meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\n“Just as, O brahmins, a dewdrop on a blade of grass quickly vanishes when the sun rises, and does not last long; in the same way, O brahmins, the life of human beings is like a dewdrop: meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\n“Just as, O brahmins, when it rains in heavy drops, a water bubble quickly vanishes and does not last long; in the same way, O brahmins, the life of human beings is like a water bubble: meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\n“Just as, O brahmins, a line drawn on water quickly vanishes and does not last long; in the same way, O brahmins, the life of human beings is like a line drawn on water: meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\n“Just as, O brahmins, a mountain river, flowing far, with a swift current, carrying away all obstacles, there is no moment, no instant, no second when it pauses or stands still; rather, it just flows on, rolls on, and rushes on; in the same way, O brahmins, the life of human beings is like a mountain river: meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\n“Just as, O brahmins, a strong man might gather a ball of phlegm on the tip of his tongue and effortlessly spit it out; in the same way, O brahmins, the life of human beings is like a ball of spit: meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\n“Just as, O brahmins, a piece of meat placed on an iron pan heated all day quickly shrivels away and does not last long; in the same way, O brahmins, the life of human beings is like a piece of meat: meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\n“Just as, O brahmins, a condemned cow being led to the slaughterhouse, with every step it lifts, draws closer to slaughter, closer to death; in the same way, O brahmins, the life of human beings is like a condemned cow: meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.”\n\nNow at that time, monks, the lifespan of human beings was sixty thousand years, and a maiden of five hundred years was considered marriageable. And at that time, monks, human beings had only six ailments: cold, heat, hunger, thirst, defecation, and urination. Indeed, monks, such a teacher as Araka, when humans were so long-lived, so long-enduring, and so free from ailments, taught his disciples this Dhamma: “‘O brahmins, the life of human beings is short, meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.’”\n\nBut now, monks, one who would speak rightly would say: “The life of human beings is short, meager, swift, full of suffering, and full of tribulation. It should be understood with deep reflection, wholesome deeds should be done, the holy life should be lived, for there is no escape from death for one who is born.” Currently, monks, one who lives long lives for a hundred years, or a little more. And indeed, monks, one who lives a hundred years lives for only three hundred seasons – a hundred winter seasons, a hundred summer seasons, a hundred rainy seasons. And indeed, monks, one who lives three hundred seasons lives for only twelve hundred months – four hundred months of winter, four hundred months of summer, four hundred months of rainy season. And indeed, monks, one who lives twelve hundred months lives for only twenty-four hundred half-months – eight hundred half-months of winter, eight hundred half-months of summer, eight hundred half-months of rainy season. And indeed, monks, one who lives twenty-four hundred half-months lives for only thirty-six thousand nights and days – twelve thousand nights and days of winter, twelve thousand nights and days of summer, twelve thousand nights and days of rainy season.\n\nIndeed, monks, one living for thirty-six thousand nights eats exactly seventy-two thousand meals: twenty-four thousand meals in winter, twenty-four thousand meals in summer, and twenty-four thousand meals in the rainy season, including the period of mother's milk and accounting for meal interruptions. These are the meal interruptions: one does not eat food when drowsy, one does not eat food when suffering, one does not eat food when sick, one does not eat food when observing Uposatha, and one does not eat food when there is no gain. Thus, monks, for a human with a lifespan of one hundred years, I have calculated life, the measure of life, the seasons, the years, the months, the half-months, the nights, the days, the meals, and the meal interruptions. Monks, whatever a Teacher, being benevolent and compassionate, should do out of compassion for his disciples – that has been done by me for you. Here, monks, are these tree roots, here are these empty dwellings. Meditate, monks! Do not be heedless! Do not have remorse later! This is our instruction to you.",
      "sinhala": "භික්‍ෂූණි, පෙර කාලයෙහි අරක නම් වූ ශාස්තෘවරයෙක්, තීර්ථක නායකයෙක්, කාමයන් කෙරෙහි වීතරාගීව විසීය. භික්‍ෂූණි, අරක නම් වූ ඒ ශාස්තෘවරයාට ශ්‍රාවකයන් සිය ගණන් සිටියෝය. අරක ශාස්තෘවරයා තම ශ්‍රාවකයන්ට මෙසේ ධර්මය දේශනා කළේය: \"බමුණ, මිනිසුන්ගේ ජීවිතය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\"\n\nබමුණ, යම් සේ තණ අග පිහිටි පිනි බිඳුවක් හිරු උදාවත්ම ක්ෂණයකින්ම අතුරුදහන් වී යයිද, වැඩි කල් නොපවතීද, එපරිද්දෙන්ම බමුණ, මිනිසුන්ගේ ජීවිතය පිනි බිඳුවක් හා සමාන ය. එය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\n\nබමුණ, යම් සේ මහ වැසි වසින කල්හි ජල බුබුළක් ක්ෂණයකින්ම අතුරුදහන් වී යයිද, වැඩි කල් නොපවතීද, එපරිද්දෙන්ම බමුණ, මිනිසුන්ගේ ජීවිතය ජල බුබුළක් හා සමාන ය. එය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\n\nබමුණ, යම් සේ දණ්ඩකින් ජලය මත ඇඳි රේඛාවක් ක්ෂණයකින්ම අතුරුදහන් වී යයිද, වැඩි කල් නොපවතීද, එපරිද්දෙන්ම බමුණ, මිනිසුන්ගේ ජීවිතය ජලය මත ඇඳි රේඛාවක් හා සමාන ය. එය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\n\nබමුණ, යම් සේ කඳුකර ගංගාවක් දුර ගලා බසින්නීය, වේගවත් දිය පහරකින් යුක්තය, ගසාගෙන යන්නීය. එය නතර වන මොහොතක්, ලයෙක් හෝ මුහූර්තයක් නැත. එය ගලා බසින්නේමය, දිව යන්නේමය, පෙරළෙන්නේමය. එපරිද්දෙන්ම බමුණ, මිනිසුන්ගේ ජීවිතය කඳුකර ගංගාවක් හා සමාන ය. එය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\n\nබමුණ, යම් සේ බලවත් පුරුෂයෙක් දිව අග කෙළ පිඩක් එක් රැස් කරගෙන අපහසුවකින් තොරවම එය කෙළ ගසන්නේද, එපරිද්දෙන්ම බමුණ, මිනිසුන්ගේ ජීවිතය කෙළ පිඩක් හා සමාන ය. එය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\n\nබමුණ, යම් සේ දවස පුරා රත් වූ යකඩ තැටියක් මත දමන ලද මස් කැබැල්ලක් ක්ෂණයකින්ම අතුරුදහන් වී යයිද, වැඩි කල් නොපවතීද, එපරිද්දෙන්ම බමුණ, මිනිසුන්ගේ ජීවිතය මස් කැබැල්ලක් හා සමාන ය. එය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\n\nබමුණ, යම් සේ මරණයට නියම වූ ගව දෙනක් ඝාතන භූමියට ගෙන යන කල්හි, ඇය යම් යම් පියවරක් ඔසවා තබන්නේද, ඒ සෑම පියවරක් පාසාම මරණයට හා සමීප වෙයිද, එපරිද්දෙන්ම බමුණ, මිනිසුන්ගේ ජීවිතය මරණයට නියම වූ ගව දෙනක් හා සමාන ය. එය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\n\nභික්‍ෂූණි, ඒ කාලයෙහි මිනිසුන්ගේ ආයුෂ ප්‍රමාණය වර්ෂ හැටදහසක් විය. පන්සිය වසක් වයසැති කුමාරිකාවක් විවාහයට සුදුසු වූවාය. භික්‍ෂූණි, ඒ කාලයෙහි මිනිසුන්ට තිබුණේ හය ආකාරයක රෝග පමණි – සීතල, උෂ්ණය, බඩගින්න, පිපාසය, මළපහ කිරීම, මුත්‍රා කිරීම. භික්‍ෂූණි, අරක නම් ඒ ශාස්තෘවරයා, එබඳු දීර්ඝායුෂ ඇති, එබඳු කල්පවතින, එබඳු අල්ප රෝග ඇති මිනිසුන්ට, තම ශ්‍රාවකයන්ට, මෙසේ ධර්මය දේශනා කරනු ඇත: \"බමුණ, මිනිසුන්ගේ ජීවිතය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත.\"\n\nභික්‍ෂූණි, දැන් යමෙක් නිවැරදිව කියන්නේ නම්, 'මිනිසුන්ගේ ජීවිතය ඉතා අල්පය, ස්වල්පය, සැහැල්ලුය, බොහෝ දුක් සහිතය, බොහෝ වෙහෙසකරය. මේ මොහොතේ කළ යුතු දේ අවබෝධ කරගත යුත්තකි. කුසලය කළ යුත්තකි. බ්‍රහ්මචර්යාව පිරිය යුත්තකි. උපන් කිසිවකුට අමරණීය බවක් නැත' යනුවෙන් පැවසිය යුතුමය. භික්‍ෂූණි, දැන් යමෙක් දීර්ඝායුෂ විඳින්නේ නම්, ඔහු අවුරුදු සියයක් හෝ ඊට මඳක් වැඩියෙන් ජීවත් වේ. භික්‍ෂූණි, අවුරුදු සියයක් ජීවත් වන අයෙක්, ඍතු සියයක් බැගින් ඍතු තුන්සියයක් පමණක් ජීවත් වේ – හේමන්ත ඍතු සියයක්, ග්‍රීෂ්ම ඍතු සියයක්, වස්සාන ඍතු සියයක්. භික්‍ෂූණි, ඍතු තුන්සියයක් ජීවත් වන අයෙක්, මාස දොළොස්සියයක් පමණක් ජීවත් වේ – හේමන්ත මාස හාරසියයක්, ග්‍රීෂ්ම මාස හාරසියයක්, වස්සාන මාස හාරසියයක්. භික්‍ෂූණි, මාස දොළොස්සියයක් ජීවත් වන අයෙක්, අඩමාස විසිහතරසියයක් පමණක් ජීවත් වේ – හේමන්ත අඩමාස අටසියයක්, ග්‍රීෂ්ම අඩමාස අටසියයක්, වස්සාන අඩමාස අටසියයක්. භික්‍ෂූණි, අඩමාස විසිහතරසියයක් ජීවත් වන අයෙක්, රාත්‍රී තිස්හය දහසක් පමණක් ජීවත් වේ – හේමන්ත රාත්‍රී දොළොස් දහසක්, ග්‍රීෂ්ම රාත්‍රී දොළොස් දහසක්, වස්සාන රාත්‍රී දොළොස් දහසක්.\n\nමහණෙනි, යමෙක් තිස්හය දහසක් රාත්‍රීන් (වසර සියයක් පමණ) ජීවත් වුවහොත්, ඔහු හැත්තෑදෙදාහක් පමණක් ආහාර වළඳයි. එයින් විසිහතර දහසක් හේමන්ත ඍතුවේදී, විසිහතර දහසක් ගිම්හාන ඍතුවේදී, විසිහතර දහසක් වස්සාන ඍතුවේදී, මව් කිරි බීම සමඟින් හා ආහාර නොගන්නා අන්තරාවන් ද සමඟය. එහි මේවා ආහාර නොවැළඳෙන අන්තරායන් වෙති: කම්මැලිකමින් හෝ නිදිමතෙන් සිටින විට ආහාර වළඳන්නේ නැත, දුකට පත්ව සිටින විට ආහාර වළඳන්නේ නැත, රෝගාතුරව සිටින විට ආහාර වළඳන්නේ නැත, උපෝසථ සීලය සමාදන්ව සිටින විට ආහාර වළඳන්නේ නැත, ආහාර නොලැබුණු විටද ආහාර වළඳන්නේ නැත. මහණෙනි, මෙසේ මා විසින් අවුරුදු සියයක් ආයුෂ ඇති මනුෂ්‍යයාගේ ආයුෂයද ගණනය කරන ලදී, ආයු ප්‍රමාණයද ගණනය කරන ලදී, ඍතුද ගණනය කරන ලදී, වර්ෂද ගණනය කරන ලදී, මාසද ගණනය කරන ලදී, අර්ධ මාසද ගණනය කරන ලදී, රාත්‍රීන්ද ගණනය කරන ලදී, දිනද ගණනය කරන ලදී, ආහාරද ගණනය කරන ලදී, ආහාර නොවැළඳෙන අන්තරාවන්ද ගණනය කරන ලදී. මහණෙනි, ශ්‍රාවකයන්ගේ හිතසුව කැමති, අනුකම්පාවෙන් යුත්, අනුකම්පාව පෙරදැරි කරගෙන ශාස්තෘවරයකු විසින් කටයුතු යමක් වේද, එය මා විසින් ඔබට කරන ලදී. මහණෙනි, මේවා රුක්මුල් ය. මේවා හිස් ගෙවල් ය. මහණෙනි, භාවනා කරන්න. ප්‍රමාද නොවන්න. පසුව පසුතැවෙන්නට සිදුනොවේවා. මෙය ඔබට අපගේ අනුශාසනාවයි.",
      "paliTitle": "Arakasuttaṃ",
      "englishTitle": "Araka Sutta",
      "sinhalaTitle": "අරක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Mahāvaggo sattamo. Tassuddānaṃ – Hirīsūriyaṃ upamā, dhammaññū pārichattakaṃ; Sakkaccaṃ bhāvanā aggi, sunettaarakena cāti.",
    "english": "The seventh Great Chapter. The summary of it: Shame, Simile of the Sun, One who knows the Dhamma, the Coral Tree; Respect, Development, Fire, Sunetta, and with Araka.",
    "sinhala": "සත්වන මහා වර්ගයයි. එහි උද්දානය නම්: හිරි, සූරියූපම, ධම්මඤ්ඤූ, පාරිඡත්තක, සක්කච්ඡ, භාවනා, අග්ගි, සුනෙත්ත සහ අරක සූත්‍රයි."
  }
}