{
  "id": "an7.2",
  "title": {
    "pali": "Anusayavaggo",
    "english": "The Section on Latent Tendencies",
    "sinhala": "අනුසය වර්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "‘‘Sattime, bhikkhave, anusayā. Katame satta? Kāmarāgānusayo, paṭighānusayo, diṭṭhānusayo, vicikicchānusayo, mānānusayo, bhavarāgānusayo, avijjānusayo. Ime kho, bhikkhave, satta anusayā’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these seven latent tendencies. What are these seven? The latent tendency of sensual lust, the latent tendency of aversion, the latent tendency of views, the latent tendency of doubt, the latent tendency of conceit, the latent tendency of attachment to existence, and the latent tendency of ignorance. These, monks, are the seven latent tendencies.",
      "sinhala": "මහණෙනි, මේ අනුසයෝ සතක් වෙති. ඒ කවර සතක්ද? කාමරාග අනුසය, පටිඝ අනුසය, දෘෂ්ටි අනුසය, විචිකිච්ඡා අනුසය, මාන අනුසය, භවරාග අනුසය, අවිද්‍යා අනුසය යන මේවායි. මහණෙනි, මේ අනුසයෝ සතක් වෙති.",
      "paliTitle": "Paṭhamaanusayasuttaṃ",
      "englishTitle": "The First Discourse on Underlying Tendencies",
      "sinhalaTitle": "පළමු අනුසය සූත්‍රය"
    },
    {
      "number": 12,
      "pali": "‘‘Sattannaṃ, bhikkhave, anusayānaṃ pahānāya samucchedāya brahmacariyaṃ vussati. Katamesaṃ sattannaṃ? Kāmarāgānusayassa pahānāya samucchedāya brahmacariyaṃ vussati, paṭighānusayassa…pe… diṭṭhānusayassa… vicikicchānusayassa… mānānusayassa… bhavarāgānusayassa… avijjānusayassa pahānāya samucchedāya brahmacariyaṃ vussati. Imesaṃ kho, bhikkhave, sattannaṃ anusayānaṃ pahānāya samucchedāya brahmacariyaṃ vussati. ‘‘Yato ca kho, bhikkhave, bhikkhuno kāmarāgānusayo pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Paṭighānusayo…pe… diṭṭhānusayo… vicikicchānusayo… mānānusayo… bhavarāgānusayo… avijjānusayo pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Ayaṃ vuccati, bhikkhave, bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’ti. Dutiyaṃ.",
      "english": "Monks, the holy life is lived for the abandonment and complete eradication of seven latent tendencies. Which seven? The holy life is lived for the abandonment and complete eradication of the latent tendency of sensual desire; of the latent tendency of aversion; of the latent tendency of wrong view; of the latent tendency of doubt; of the latent tendency of conceit; of the latent tendency of desire for existence; and of the latent tendency of ignorance. Indeed, Monks, the holy life is lived for the abandonment and complete eradication of these seven latent tendencies.\n\nBut when, Monks, for a bhikkhu, the latent tendency of sensual desire has been abandoned, uprooted, rendered like a palm-stump, made non-existent, and is no longer liable to arise in the future; and when the latent tendency of aversion, the latent tendency of wrong view, the latent tendency of doubt, the latent tendency of conceit, the latent tendency of desire for existence, and the latent tendency of ignorance have also been abandoned, uprooted, rendered like a palm-stump, made non-existent, and are no longer liable to arise in the future: such a bhikkhu, Monks, is said to have cut off craving, to have undone the fetters, and, through the complete penetration of conceit, to have made an end to suffering.",
      "sinhala": "මහණෙනි, යටිකුරු වී පවතින කෙලෙස් සතක් ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. ඒ සත කුමන සතක්ද? කාමරාග අනුසය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. පටිඝ අනුසය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. දිට්ඨි අනුසය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. විචිකිච්ඡා අනුසය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. මාන අනුසය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. භවරාග අනුසය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. අවිජ්ජා අනුසය ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. මහණෙනි, මෙලෙස යටිකුරු වී පවතින මේ අනුසය සත ප්‍රහාණය කිරීම පිණිසත්, මුලිනුපුටා දැමීම පිණිසත් බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ.\n\nමහණෙනි, යම් කලක භික්ෂුවකගේ කාමරාග අනුසය ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, අනාගතයේ යළි නූපදින ස්වභාවයට පත් වී ඇත්ද; පටිඝ අනුසය ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, අනාගතයේ යළි නූපදින ස්වභාවයට පත් වී ඇත්ද; දිට්ඨි අනුසය ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, අනාගතයේ යළි නූපදින ස්වභාවයට පත් වී ඇත්ද; විචිකිච්ඡා අනුසය ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, අනාගතයේ යළි නූපදින ස්වභාවයට පත් වී ඇත්ද; මාන අනුසය ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, අනාගතයේ යළි නූපදින ස්වභාවයට පත් වී ඇත්ද; භවරාග අනුසය ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, අනාගතයේ යළි නූපදින ස්වභාවයට පත් වී ඇත්ද; අවිජ්ජා අනුසය ප්‍රහීණ වී, මුලින් උදුරා දමා, තල් කඳක් මෙන් අභාවයට පත් කර, අනාගතයේ යළි නූපදින ස්වභාවයට පත් වී ඇත්ද; මහණෙනි, මේ භික්ෂුව තෘෂ්ණාව සිඳලූ, සංයෝජන දුරු කළ, මානය සම්‍යක් අවබෝධයෙන් දුක කෙළවර කළ භික්ෂුවක් ලෙස කියනු ලැබේ.",
      "paliTitle": "Dutiyaanusayasuttaṃ",
      "englishTitle": "Second Sutta on Underlying Tendencies",
      "sinhalaTitle": "දුතිය අනුසය සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "‘‘Sattahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ, upagantvā vā nālaṃ upanisīdituṃ. Katamehi sattahi? Na manāpena paccuṭṭhenti, na manāpena abhivādenti, na manāpena āsanaṃ denti, santamassa pariguhanti, bahukampi thokaṃ denti, paṇītampi lūkhaṃ denti, asakkaccaṃ denti no sakkaccaṃ. Imehi kho, bhikkhave, sattahi aṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ, upagantvā vā nālaṃ upanisīdituṃ. ‘‘Sattahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ upanisīdituṃ. Katamehi sattahi? Manāpena paccuṭṭhenti, manāpena abhivādenti, manāpena āsanaṃ denti, santamassa na pariguhanti, bahukampi bahukaṃ denti, paṇītampi paṇītaṃ denti, sakkaccaṃ denti no asakkaccaṃ. Imehi kho, bhikkhave, sattahi aṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ upanisīditu’’nti. Tatiyaṃ.",
      "english": "Monks, a family endowed with seven qualities is not worthy of being approached; and having approached, it is not worthy of being sat with. Which seven? They do not rise to greet with respect, they do not salute with respect, they do not offer a seat with respect. They conceal what they have. Even if they have much, they give little. Even if they have excellent food, they give coarse food. They give disrespectfully, not respectfully. Monks, a family endowed with these seven qualities is not worthy of being approached; and having approached, it is not worthy of being sat with.\n\nMonks, a family endowed with seven qualities is worthy of being approached; and having approached, it is worthy of being sat with. Which seven? They rise to greet with respect, they salute with respect, they offer a seat with respect. They do not conceal what they have. Even if they have much, they give much. Even if they have excellent food, they give excellent food. They give respectfully, not disrespectfully. Monks, a family endowed with these seven qualities is worthy of being approached; and having approached, it is worthy of being sat with.",
      "sinhala": "භික්‍ෂූනි, අංග සතකින් සමන්වාගත වූ යම් කුලයක් වේ නම්, එවැනි කුලයකට යෑම සුදුසු නොවේ. එසේ ගියා නම් එහි ළඟ සිටීම ද සුදුසු නොවේ. ඒ කවර සතකින් ද? ඔවුහු ප්‍රිය වචනයෙන් පිළිනොගනිති, ප්‍රිය වචනයෙන් ආමන්ත්‍රණය නොකරති, ප්‍රිය වචනයෙන් අසුනක් නොදෙති, තමන් සතු දෙය වසන් කරති, බොහෝ දේ තිබුණත් ස්වල්පයක් දෙති, ප්‍රණීත දෙයක් තිබුණත් රළු දෙයක් දෙති, අගෞරවයෙන් දෙති, ගෞරවයෙන් නොදෙති. භික්‍ෂූනි, මේ සත් අංගයන්ගෙන් සමන්වාගත වූ කුලයකට යෑම සුදුසු නොවේ. එසේ ගියා නම් එහි ළඟ සිටීම ද සුදුසු නොවේ.\n\nභික්‍ෂූනි, අංග සතකින් සමන්වාගත වූ යම් කුලයක් වේ නම්, එවැනි කුලයකට යෑම සුදුසු වේ. එසේ ගියා නම් එහි ළඟ සිටීම ද සුදුසු වේ. ඒ කවර සතකින් ද? ඔවුහු ප්‍රිය වචනයෙන් පිළිගනිති, ප්‍රිය වචනයෙන් ආමන්ත්‍රණය කරති, ප්‍රිය වචනයෙන් අසුනක් දෙති, තමන් සතු දෙය වසන් නොකරති, බොහෝ දේ තිබුණා නම් බොහෝ දේ ම දෙති, ප්‍රණීත දෙයක් තිබුණා නම් ප්‍රණීත දෙය ම දෙති, ගෞරවයෙන් ම දෙති, අගෞරවයෙන් නොදෙති. භික්‍ෂූනි, මේ සත් අංගයන්ගෙන් සමන්වාගත වූ කුලයකට යෑම සුදුසු වේ. එසේ ගියා නම් එහි ළඟ සිටීම ද සුදුසු වේ.\nතතියං.",
      "paliTitle": "Kulasuttaṃ",
      "englishTitle": "The Discourse on Families",
      "sinhalaTitle": "කුල සූත්‍රය"
    },
    {
      "number": 14,
      "pali": "‘‘Sattime, bhikkhave, puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa. Katame satta? Ubhatobhāgavimutto, paññāvimutto, kāyasakkhī, diṭṭhippatto [diṭṭhappatto (ka.)], saddhāvimutto, dhammānusārī, saddhānusārī. Ime kho, bhikkhave, satta puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassā’’ti. Catutthaṃ.",
      "english": "Monks, these seven persons are worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and are the unsurpassed field of merit for the world.\n\nWhich seven?\n\nA person liberated in both ways, a person liberated by wisdom, a body-witness, one attained to vision, a person liberated by faith, a Dhamma-follower, and a faith-follower.\n\nIndeed, monks, these seven persons are worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and are the unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ සත් දෙන ලෝකයාගේ ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ අනුත්තර පුණ්‍යක්ෂේත්‍රයෝ වෙති.\n\nඒ සත් දෙනා කවරහුද?\n\nඋභතෝභාගවිමුක්ත පුද්ගලයා, ප‍්‍රඥාවිමුක්ත පුද්ගලයා, කායසාක්ෂී පුද්ගලයා, දිට්ඨිප්පත්ත පුද්ගලයා, ශ‍්‍රද්ධා[ක්‍ර]විමුක්ත පුද්ගලයා, ධම්මානුසාරී පුද්ගලයා, ශ‍්‍රද්ධා[ක්‍ර]නුසාරී පුද්ගලයා යන මේ සත් දෙනාය.\n\nමහණෙනි, මේ පුද්ගලයෝ සත් දෙන ලෝකයාගේ ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ අනුත්තර පුණ්‍යක්ෂේත්‍රයෝම වෙති.",
      "paliTitle": "Puggalasuttaṃ",
      "englishTitle": "The Discourse on Persons",
      "sinhalaTitle": "පුග්ගල සූත්‍රය"
    },
    {
      "number": 15,
      "pali": "‘‘Sattime, bhikkhave, udakūpamā puggalā santo saṃvijjamānā lokasmiṃ. Katame satta? [pu. pa. 203; kathā. 852] Idha, bhikkhave, ekacco puggalo sakiṃ nimuggo nimuggova hoti; idha pana, bhikkhave, ekacco puggalo ummujjitvā nimujjati; idha pana, bhikkhave, ekacco puggalo ummujjitvā ṭhito hoti; idha pana, bhikkhave, ekacco puggalo ummujjitvā vipassati viloketi; idha pana, bhikkhave, ekacco puggalo ummujjitvā patarati; idha pana, bhikkhave, ekacco puggalo ummujjitvā patigādhappatto hoti; idha pana, bhikkhave, ekacco puggalo ummujjitvā tiṇṇo hoti pāraṅgato [pāragato (sī. syā. kaṃ.)] thale tiṭṭhati brāhmaṇo. ‘‘Kathañca, bhikkhave, puggalo sakiṃ nimuggo nimuggova hoti? Idha bhikkhave, ekacco puggalo samannāgato hoti ekantakāḷakehi akusalehi dhammehi. Evaṃ kho, bhikkhave, puggalo sakiṃ nimuggo nimuggova hoti. ‘‘Kathañca, bhikkhave, puggalo ummujjitvā nimujjati? Idha, bhikkhave, ekacco puggalo ummujjati sādhu saddhā kusalesu dhammesu, sādhu hirī…pe… sādhu ottappaṃ… sādhu vīriyaṃ [viriyaṃ (sī. syā. kaṃ. pī.)] … sādhu paññā kusalesu dhammesūti. Tassa sā saddhā neva tiṭṭhati no vaḍḍhati hāyatiyeva, tassa sā hirī…pe… tassa taṃ ottappaṃ… tassa taṃ vīriyaṃ… tassa sā paññā neva tiṭṭhati no vaḍḍhati hāyatiyeva. Evaṃ kho, bhikkhave, puggalo ummujjitvā nimujjati. ‘‘Kathañca, bhikkhave, puggalo ummujjitvā ṭhito hoti? Idha, bhikkhave, ekacco puggalo ummujjati sādhu saddhā kusalesu dhammesu, sādhu hirī…pe… sādhu ottappaṃ… sādhu vīriyaṃ… sādhu paññā kusalesu dhammesūti. Tassa sā saddhā neva hāyati no vaḍḍhati ṭhitā hoti. Tassa sā hirī…pe… tassa taṃ ottappaṃ… tassa taṃ vīriyaṃ… tassa sā paññā neva hāyati no vaḍḍhati ṭhitā hoti. Evaṃ kho, bhikkhave, puggalo ummujjitvā ṭhito hoti. ‘‘Kathañca, bhikkhave, puggalo ummujjitvā vipassati viloketi? Idha, bhikkhave, ekacco puggalo ummujjati sādhu saddhā kusalesu dhammesu, sādhu hirī…pe… sādhu ottappaṃ… sādhu vīriyaṃ… sādhu paññā kusalesu dhammesūti. So tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Evaṃ kho, bhikkhave, puggalo ummujjitvā vipassati viloketi. ‘‘Kathañca, bhikkhave, puggalo ummujjitvā patarati? Idha, bhikkhave, ekacco puggalo ummujjati sādhu saddhā kusalesu dhammesu, sādhu hirī…pe… sādhu ottappaṃ… sādhu vīriyaṃ… sādhu paññā kusalesu dhammesūti. So tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva [sakiṃdeva (ka.)] imaṃ lokaṃ āgantvā dukkhassantaṃ karoti [dukkhassantakaro hoti (ka.)]. Evaṃ kho, bhikkhave, puggalo ummujjitvā patarati. ‘‘Kathañca, bhikkhave, puggalo ummujjitvā patigādhappatto hoti? Idha, bhikkhave, ekacco puggalo ummujjati sādhu saddhā kusalesu dhammesu, sādhu hirī…pe… sādhu ottappaṃ… sādhu vīriyaṃ… sādhu paññā kusalesu dhammesūti. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Evaṃ kho, bhikkhave, puggalo ummujjitvā patigādhappatto hoti. ‘‘Kathañca, bhikkhave, puggalo ummujjitvā tiṇṇo hoti pāraṅgato thale tiṭṭhati brāhmaṇo. Idha, bhikkhave, ekacco puggalo ummujjati sādhu saddhā kusalesu dhammesu, sādhu hirī…pe… sādhu ottappaṃ… sādhu vīriyaṃ… sādhu paññā kusalesu dhammesūti. So āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, puggalo ummujjitvā tiṇṇo hoti pāraṅgato thale tiṭṭhati brāhmaṇo. ‘‘Ime kho, bhikkhave, satta udakūpamā puggalā santo saṃvijjamānā lokasmi’’nti. Pañcamaṃ.",
      "english": "Monks, these seven persons, comparable to water, are found existing in the world. Which seven?\n\nHere, monks, a certain person once plunged, remains plunged. Here, monks, a certain person emerges and then plunges again. Here, monks, a certain person emerges and remains stable. Here, monks, a certain person emerges and observes with insight. Here, monks, a certain person emerges and makes progress. Here, monks, a certain person emerges and reaches a firm footing. Here, monks, a certain person emerges, has crossed over, gone to the other shore, stands on dry ground, a perfected one.\n\nAnd how, monks, is a person once plunged, one who remains plunged? Here, monks, a certain person is wholly possessed by dark, unwholesome states. This is how, monks, a person is once plunged, one who remains plunged.\n\nAnd how, monks, is a person one who emerges and then plunges? Here, monks, a certain person emerges with good faith in wholesome states, with good moral shame, with good moral dread, with good energy, with good wisdom in wholesome states. That faith of theirs neither remains stable nor grows, but only declines. That moral shame of theirs, that moral dread of theirs, that energy of theirs, that wisdom of theirs also neither remains stable nor grows, but only declines. This is how, monks, a person emerges and then plunges.\n\nAnd how, monks, is a person one who emerges and remains stable? Here, monks, a certain person emerges with good faith in wholesome states, with good moral shame, with good moral dread, with good energy, with good wisdom in wholesome states. That faith of theirs neither declines nor grows, but remains stable. That moral shame of theirs, that moral dread of theirs, that energy of theirs, that wisdom of theirs also neither declines nor grows, but remains stable. This is how, monks, a person emerges and remains stable.\n\nAnd how, monks, is a person one who emerges and observes with insight? Here, monks, a certain person emerges with good faith in wholesome states, with good moral shame, with good moral dread, with good energy, with good wisdom in wholesome states. With the utter destruction of the three fetters, they become a Stream-Enterer, not subject to falling into lower realms, fixed, and bound for full enlightenment. This is how, monks, a person emerges and observes with insight.\n\nAnd how, monks, is a person one who emerges and makes progress? Here, monks, a certain person emerges with good faith in wholesome states, with good moral shame, with good moral dread, with good energy, with good wisdom in wholesome states. With the utter destruction of the three fetters and with the attenuation of lust, hatred, and delusion, they become a Once-Returner, who, having come to this world just one more time, will make an end of suffering. This is how, monks, a person emerges and makes progress.\n\nAnd how, monks, is a person one who emerges and reaches a firm footing? Here, monks, a certain person emerges with good faith in wholesome states, with good moral shame, with good moral dread, with good energy, with good wisdom in wholesome states. With the utter destruction of the five lower fetters, they become spontaneously reborn in a pure abode, attaining final Nibbana there, not subject to returning from that world. This is how, monks, a person emerges and reaches a firm footing.\n\nAnd how, monks, is a person one who emerges, has crossed over, gone to the other shore, stands on dry ground, a perfected one? Here, monks, a certain person emerges with good faith in wholesome states, with good moral shame, with good moral dread, with good energy, with good wisdom in wholesome states. With the destruction of the taints, having realized for themselves with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, they abide therein. This is how, monks, a person emerges, has crossed over, gone to the other shore, stands on dry ground, a perfected one.\n\nThese, monks, are the seven persons comparable to water, existing and found in the world.",
      "sinhala": "භික්ෂූණි, මේ ලෝකයෙහි ජලය උපමා කොට දැක්විය හැකි පුද්ගලයන් සත් දෙනෙක් වෙති, සිටිති. ඒ කවර සත් දෙනෙක් ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් වරක් ගිලුණේ ද, ඔහු ගිලුණාම ය. නැවත භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් ජලයෙන් මතු වී නැවත ගිලී යන්නේ ය. නැවත භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් ජලයෙන් මතු වී නොගිලී සිටින්නේ ය. නැවත භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් ජලයෙන් මතු වී අවට බලමින් විමසන්නේ ය. නැවත භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් ජලයෙන් මතු වී ඉදිරියට පිහිනා යන්නේ ය. නැවත භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් ජලයෙන් මතු වී ගොඩට ළඟා වන්නේ ය. නැවත භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් ජලයෙන් මතු වී එතෙර වී, එගොඩට පැමිණ, බ්‍රාහ්මණයෙකු මෙන් ස්ථිර බිමක සිටින්නේ ය.\n\nභික්ෂූණි, යම් පුද්ගලයෙක් වරක් ගිලුණේ ද, ඔහු ගිලුණාම ය යනුවෙන් කියනු ලබන්නේ කෙසේ ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් නිරන්තරයෙන් ම අතිශයින් කළු වූ අකුසල ධ‍ර්මයන්ගෙන් යුක්ත වන්නේ ය. භික්ෂූණි, මෙසේ යම් පුද්ගලයෙක් වරක් ගිලුණේ ද, ඔහු ගිලුණාම ය යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, යම් පුද්ගලයෙක් මතු වී නැවත ගිලී යන්නේ ය යනුවෙන් කියනු ලබන්නේ කෙසේ ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් කුසල ධ‍ර්මයන් කෙරෙහි යහපත් ශ‍්‍රද්ධාවකින් යුක්තව මතු වන්නේ ය. යහපත් හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව යන කුසල ධ‍ර්මයන්ගෙන් යුක්ත වන්නේ ය. ඔහුගේ ඒ ශ‍්‍රද්ධාව නොපවතින අතර, නොවැඩෙයි, පිරිහී යන්නේ ම ය. ඔහුගේ ඒ හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව ද නොපවතින අතර, නොවැඩෙයි, පිරිහී යන්නේ ම ය. භික්ෂූණි, මෙසේ යම් පුද්ගලයෙක් මතු වී නැවත ගිලී යන්නේ ය යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, යම් පුද්ගලයෙක් මතු වී නොගිලී සිටින්නේ ය යනුවෙන් කියනු ලබන්නේ කෙසේ ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් කුසල ධ‍ර්මයන් කෙරෙහි යහපත් ශ‍්‍රද්ධාවකින් යුක්තව මතු වන්නේ ය. යහපත් හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව යන කුසල ධ‍ර්මයන්ගෙන් යුක්ත වන්නේ ය. ඔහුගේ ඒ ශ‍්‍රද්ධාව නොපිරිහෙයි, නොවැඩෙයි, එසේ ම පවතින්නේ ය. ඔහුගේ ඒ හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව ද නොපිරිහෙයි, නොවැඩෙයි, එසේ ම පවතින්නේ ය. භික්ෂූණි, මෙසේ යම් පුද්ගලයෙක් මතු වී නොගිලී සිටින්නේ ය යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, යම් පුද්ගලයෙක් මතු වී අවට බලමින් විමසන්නේ ය යනුවෙන් කියනු ලබන්නේ කෙසේ ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් කුසල ධ‍ර්මයන් කෙරෙහි යහපත් ශ‍්‍රද්ධාවකින් යුක්තව මතු වන්නේ ය. යහපත් හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව යන කුසල ධ‍ර්මයන්ගෙන් යුක්ත වන්නේ ය. හෙතෙම සංයෝජන තුනක් ක්ෂය කිරීමෙන් සෝවාන් වන්නේ ය. අපායට නොවැටෙන ස්වභාවයෙන් යුක්ත, නියත වූ සම්බෝධිය පරම කොට ඇත්තෙක් වන්නේ ය. භික්ෂූණි, මෙසේ යම් පුද්ගලයෙක් මතු වී අවට බලමින් විමසන්නේ ය යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, යම් පුද්ගලයෙක් මතු වී ඉදිරියට පිහිනා යන්නේ ය යනුවෙන් කියනු ලබන්නේ කෙසේ ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් කුසල ධ‍ර්මයන් කෙරෙහි යහපත් ශ‍්‍රද්ධාවකින් යුක්තව මතු වන්නේ ය. යහපත් හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව යන කුසල ධ‍ර්මයන්ගෙන් යුක්ත වන්නේ ය. හෙතෙම සංයෝජන තුන ක්ෂය කිරීමෙන් ද, රාගය, ද්වේෂය, මෝහය යන කෙලෙස් තුනී කිරීමෙන් ද සකදාගාමී වන්නේ ය. ඔහු එක් වරක් ම මේ ලෝකයට පැමිණ දුක කෙළවර කරන්නේ ය. භික්ෂූණි, මෙසේ යම් පුද්ගලයෙක් මතු වී ඉදිරියට පිහිනා යන්නේ ය යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, යම් පුද්ගලයෙක් මතු වී ගොඩට ළඟා වන්නේ ය යනුවෙන් කියනු ලබන්නේ කෙසේ ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් කුසල ධ‍ර්මයන් කෙරෙහි යහපත් ශ‍්‍රද්ධාවකින් යුක්තව මතු වන්නේ ය. යහපත් හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව යන කුසල ධ‍ර්මයන්ගෙන් යුක්ත වන්නේ ය. හෙතෙම ඕරම්භාගීය සංයෝජන පහ ක්ෂය කිරීමෙන් ඕපපාතිකව උපදින්නේ ය. එහි දී පිරිනිවන් පාන්නේ ය. ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්ත වන්නේ ය. භික්ෂූණි, මෙසේ යම් පුද්ගලයෙක් මතු වී ගොඩට ළඟා වන්නේ ය යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, යම් පුද්ගලයෙක් මතු වී එතෙර වී, එගොඩට පැමිණ, බ්‍රාහ්මණයෙකු මෙන් ස්ථිර බිමක සිටින්නේ ය යනුවෙන් කියනු ලබන්නේ කෙසේ ද? භික්ෂූණි, මේ ශාසනයෙහි යම් පුද්ගලයෙක් කුසල ධ‍ර්මයන් කෙරෙහි යහපත් ශ‍්‍රද්ධාවකින් යුක්තව මතු වන්නේ ය. යහපත් හිරි ඔතප්, වීර්යය, ප‍්‍රඥාව යන කුසල ධ‍ර්මයන්ගෙන් යුක්ත වන්නේ ය. හෙතෙම ආශ‍්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය ද ප‍්‍රඥාවිමුක්තිය ද මේ ආත්ම භාවයේදීම තමා විසින් ම අවබෝධයෙන් ප‍්‍රත‍්‍යක්ෂ කොට වාසය කරන්නේ ය. භික්ෂූණි, මෙසේ යම් පුද්ගලයෙක් මතු වී එතෙර වී, එගොඩට පැමිණ, බ්‍රාහ්මණයෙකු මෙන් ස්ථිර බිමක සිටින්නේ ය යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, මේ ලෝකයෙහි ජලය උපමා කොට දැක්විය හැකි පුද්ගලයන් සත් දෙනෙක් වෙති, සිටිති.",
      "paliTitle": "Udakūpamāsuttaṃ",
      "englishTitle": "The Discourse on the Water Simile",
      "sinhalaTitle": "උදකූපමා සූත්‍රය"
    },
    {
      "number": 16,
      "pali": "‘‘Sattime, bhikkhave, puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa. Katame satta? Idha, bhikkhave, ekacco puggalo sabbasaṅkhāresu aniccānupassī viharati, aniccasaññī, aniccapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. So āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Ayaṃ, bhikkhave, paṭhamo puggalo āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbasaṅkhāresu aniccānupassī viharati, aniccasaññī, aniccapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. Tassa apubbaṃ acarimaṃ āsavapariyādānañca hoti jīvitapariyādānañca. Ayaṃ, bhikkhave, dutiyo puggalo āhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo sabbasaṅkhāresu aniccānupassī viharati, aniccasaññī, aniccapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti… pe… upahaccaparinibbāyī hoti…pe… asaṅkhāraparinibbāyī hoti…pe… sasaṅkhāraparinibbāyī hoti… pe… uddhaṃsoto hoti akaniṭṭhagāmī. Ayaṃ, bhikkhave, sattamo puggalo āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Ime kho, bhikkhave, satta puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these seven individuals are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and are the unsurpassed field of merit for the world. Which seven? Here, monks, a certain individual dwells contemplating impermanence in all conditioned phenomena, perceiving impermanence, experiencing impermanence, continually, constantly, uninterruptedly discerning it with the mind, deeply penetrating it with wisdom. He, through the destruction of the taints, directly knows and realizes for himself, in this very life, freedom of mind and freedom through wisdom, and having entered upon it, he dwells therein. This, monks, is the first individual worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unsurpassed field of merit for the world.\n\nAgain, monks, a certain individual dwells contemplating impermanence in all conditioned phenomena, perceiving impermanence, experiencing impermanence, continually, constantly, uninterruptedly discerning it with the mind, deeply penetrating it with wisdom. For him, simultaneously, without precedence or sequence, there is the exhaustion of the taints and the exhaustion of life. This, monks, is the second individual worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unsurpassed field of merit for the world.\n\nAgain, monks, a certain individual dwells contemplating impermanence in all conditioned phenomena, perceiving impermanence, experiencing impermanence, continually, constantly, uninterruptedly discerning it with the mind, deeply penetrating it with wisdom. He, with the utter destruction of the five lower fetters, becomes one who attains final Nibbāna in the interval; or one who attains final Nibbāna upon landing; or one who attains final Nibbāna without effort; or one who attains final Nibbāna with effort; or one who is upstream-bound, heading for the Akaniṭṭha realm. This, monks, is the seventh individual worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unsurpassed field of merit for the world. Indeed, monks, these seven individuals are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and are the unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයන් සත් දෙනෙක් ලෝකයාට ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ අනුත්තර පුණ්‍යක්‍ෂේත්‍රයක් වෙති. ඒ සත් දෙනා කවරහුද?\n\nමහණෙනි, මේ ශාසනයෙහි එක්තරා පුද්ගලයෙක් සියලු සංස්කාර ධර්මයන් අනිත්‍ය වශයෙන් නිතර මෙනෙහි කරමින් වාසය කරයි. ඔහුට අනිත්‍ය සංඥාව ඇත. අනිත්‍යය ප්‍රත්‍යක්‍ෂ කරනසුළු වූයේය. නොකඩවා, නොහැර, සිතින් අධිමුක්තව, ප්‍රඥාවෙන් ගැඹුරට විනිවිද දකිමින් වාසය කරයි. ඒ පුද්ගලයා ආශ්‍රවයන්ගේ ක්ෂය කිරීම නිසා, ආශ්‍රව රහිත වූ චිත්ත විමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයෙහිදීම තමා විසින් අවබෝධ කොට, සාක්ෂාත් කොට, ප්‍රත්‍යක්‍ෂ කොට, ඒවාට පැමිණ වාසය කරයි. මහණෙනි, මේ ලෝකයාට ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ අනුත්තර පුණ්‍යක්‍ෂේත්‍රයක් වන පළමු වන පුද්ගලයාය.\n\nනැවතත් මහණෙනි, මේ ශාසනයෙහි එක්තරා පුද්ගලයෙක් සියලු සංස්කාර ධර්මයන් අනිත්‍ය වශයෙන් නිතර මෙනෙහි කරමින් වාසය කරයි. ඔහුට අනිත්‍ය සංඥාව ඇත. අනිත්‍යය ප්‍රත්‍යක්‍ෂ කරනසුළු වූයේය. නොකඩවා, නොහැර, සිතින් අධිමුක්තව, ප්‍රඥාවෙන් ගැඹුරට විනිවිද දකිමින් වාසය කරයි. ඔහුගේ ආශ්‍රවයන්ගේ කෙළවරවීමත්, ජීවිතයේ කෙළවරවීමත් අපූර්ව වශයෙන්, නොපමාව එකම මොහොතක සිදුවේ. මහණෙනි, මේ ලෝකයාට ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ අනුත්තර පුණ්‍යක්‍ෂේත්‍රයක් වන දෙවැනි පුද්ගලයාය.\n\nනැවතත් මහණෙනි, මේ ශාසනයෙහි එක්තරා පුද්ගලයෙක් සියලු සංස්කාර ධර්මයන් අනිත්‍ය වශයෙන් නිතර මෙනෙහි කරමින් වාසය කරයි. ඔහුට අනිත්‍ය සංඥාව ඇත. අනිත්‍යය ප්‍රත්‍යක්‍ෂ කරනසුළු වූයේය. නොකඩවා, නොහැර, සිතින් අධිමුක්තව, ප්‍රඥාවෙන් ගැඹුරට විනිවිද දකිමින් වාසය කරයි. ඒ පුද්ගලයා පස්වැදෑරුම් ඕරම්භාගීය සංයෝජනයන්ගේ ක්ෂය කිරීම නිසා, අන්තරාපරිනිර්වායී වේ. උපහච්චපරිනිර්වායී වේ. අසංඛාරපරිනිර්වායී වේ. සසංඛාරපරිනිර්වායී වේ. ඌර්ධ්වශ්‍රෝතස්වී අකනිට්ඨගාමී වේ. මහණෙනි, මේ ලෝකයාට ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ අනුත්තර පුණ්‍යක්‍ෂේත්‍රයක් වන සත්වැනි පුද්ගලයාය.\n\nමහණෙනි, මේ පුද්ගලයන් සත් දෙනෙක් ලෝකයාට ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ අනුත්තර පුණ්‍යක්‍ෂේත්‍රයක් වෙති.",
      "paliTitle": "Aniccānupassīsuttaṃ",
      "englishTitle": "Contemplating Impermanence Sutta",
      "sinhalaTitle": "අනිච්චානුපස්සී සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "Sattime, bhikkhave, puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassa. Katame satta? Idha, bhikkhave, ekacco puggalo sabbasaṅkhāresu dukkhānupassī viharati…pe…. Sattamaṃ.",
      "english": "These seven persons, monks, are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, the unsurpassed field of merit for the world.\n\nWhich seven? Here, monks, a certain person dwells contemplating suffering in all formations, and so forth, up to the seventh.",
      "sinhala": "භික්‍ෂූණි, මේ සත් පුද්ගලයෝ ආහුණෙය්‍ය (පිළිගැනීමට සුදුසු), පාහුණෙය්‍ය (ආගන්තුක සත්කාරයට සුදුසු), දක්ඛිණෙය්‍ය (දක්‍ෂිණාවට සුදුසු), අඤ්ජලිකරණීය (දෝත මුදුන් තබා වැඳීමට සුදුසු) වෙති. ලෝකයාට අනුත්තර පුණ්‍යක්‍ෂේත්‍රයෝ වෙති. කවරහුද ඒ සත් දෙනා? භික්‍ෂූණි, මෙහි යම් කිසි පුද්ගලයෙක් සියලු සංඛාරයන්හි දුක්ඛානුපස්සීව වාසය කරයි. ආදී වශයෙන් සත්වැනියාද (මෙබඳු වේ).",
      "paliTitle": "Dukkhānupassīsuttaṃ",
      "englishTitle": "Observing Suffering Sutta",
      "sinhalaTitle": "දුක්ඛානුපස්සී සූත්‍රය"
    },
    {
      "number": 18,
      "pali": "Sabbesu dhammesu anattānupassī viharati…pe…. Aṭṭhamaṃ.",
      "english": "He dwells observing non-self in all phenomena. The eighth.",
      "sinhala": "සියලු ධර‍්මයන් අනාත්ම වශයෙන් මෙනෙහි කරමින් වෙසෙයි.",
      "paliTitle": "Anattānupassīsuttaṃ",
      "englishTitle": "Contemplating Non-Self Sutta",
      "sinhalaTitle": "අනත්තානුපස්සී සූත්‍රය"
    },
    {
      "number": 19,
      "pali": "[kathā. 547-548] ‘‘Nibbāne sukhānupassī viharati sukhasaññī sukhapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. So āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Ayaṃ bhikkhave, paṭhamo puggalo āhuneyyo…pe… puññakkhettaṃ lokassa. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo nibbāne sukhānupassī viharati sukhasaññī sukhapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. Tassa apubbaṃ acarimaṃ āsavapariyādānañca hoti jīvitapariyādānañca. Ayaṃ, bhikkhave, dutiyo puggalo āhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. ‘‘Puna caparaṃ, bhikkhave, idhekacco puggalo nibbāne sukhānupassī viharati sukhasaññī sukhapaṭisaṃvedī satataṃ samitaṃ abbokiṇṇaṃ cetasā adhimuccamāno paññāya pariyogāhamāno. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti…pe… upahaccaparinibbāyī hoti…pe… asaṅkhāraparinibbāyī hoti…pe… sasaṅkhāraparinibbāyī hoti…pe… uddhaṃsoto hoti akaniṭṭhagāmī. Ayaṃ, bhikkhave, sattamo puggalo āhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. Ime kho, bhikkhave, satta puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Navamaṃ.",
      "english": "He dwells contemplating Nibbāna as happiness, perceiving happiness, experiencing happiness, continuously, constantly, uninterruptedly resolving it with his mind, penetrating it with wisdom. He, through the destruction of the influxes, having realized and attained liberation for himself in this very life, dwells. This, bhikkhus, is the first person worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.\n\nFurthermore, bhikkhus, there is another person who dwells contemplating Nibbāna as happiness, perceiving happiness, experiencing happiness, continuously, constantly, uninterruptedly resolving it with his mind, penetrating it with wisdom. For him, the cessation of the influxes and the cessation of life occur simultaneously, without one preceding the other. This, bhikkhus, is the second person worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.\n\nFurthermore, bhikkhus, there is another person who dwells contemplating Nibbāna as happiness, perceiving happiness, experiencing happiness, continuously, constantly, uninterruptedly resolving it with his mind, penetrating it with wisdom. He, through the complete destruction of the five lower fetters, becomes one who attains Nibbāna in the interval; or one who attains Nibbāna upon striking; or one who attains Nibbāna without much effort; or one who attains Nibbāna with effort; or one who goes upstream to the Akaniṭṭha realm. This, bhikkhus, is the seventh person worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world. These, bhikkhus, are the seven persons worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් නිර්වාණය සැපතක් ලෙස අනුපස්සනා කරමින්, සැප සංඥාවක් වශයෙන්, සැපයක් අත්දකිමින්, නිරතුරුව, නොකඩවා සිතින් අධිමුක්තව, ප්‍රඥාවෙන් ගැඹුරින් අවබෝධ කරමින් වාසය කරයි. ඔහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් සත්‍යය ප්‍රත්‍යක්ෂ කොට, එයට පැමිණ වාසය කරයි. මහණෙනි, මේ පළමු පුද්ගලයා පූජාවට, ආගන්තුක සත්කාරයට, දක්ෂිණාවට සුදුසු වූ, අතින් ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු වූ, ලෝකයාට පුණ්‍යක්ෂේත්‍රයකි.\n\nමහණෙනි, තවද මෙලොව ඇතැම් පුද්ගලයෙක් නිර්වාණය සැපතක් ලෙස අනුපස්සනා කරමින්, සැප සංඥාවක් වශයෙන්, සැපයක් අත්දකිමින්, නිරතුරුව, නොකඩවා සිතින් අධිමුක්තව, ප්‍රඥාවෙන් ගැඹුරින් අවබෝධ කරමින් වාසය කරයි. ඔහුට පෙර හෝ පසු නොමැතිව, ආශ්‍රවයන්ගේ අවසන් වීමද, ජීවිතයේ අවසන් වීමද සිදුවේ. මහණෙනි, මේ දෙවැනි පුද්ගලයා පූජාවට, ආගන්තුක සත්කාරයට, දක්ෂිණාවට සුදුසු වූ, අතින් ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු වූ, ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයකි.\n\nමහණෙනි, තවද මෙලොව ඇතැම් පුද්ගලයෙක් නිර්වාණය සැපතක් ලෙස අනුපස්සනා කරමින්, සැප සංඥාවක් වශයෙන්, සැපයක් අත්දකිමින්, නිරතුරුව, නොකඩවා සිතින් අධිමුක්තව, ප්‍රඥාවෙන් ගැඹුරින් අවබෝධ කරමින් වාසය කරයි. ඔහු ඕරම්භාගීය සංයෝජන පහ ක්ෂය කිරීමෙන් අන්තරාපරිනිබ්බායී වේ, උපහච්චපරිනිබ්බායී වේ, අසංඛාරපරිනිබ්බායී වේ, සසංඛාරපරිනිබ්බායී වේ, හෝ උද්ධංසෝතෝ අකනිට්ඨගාමී වේ. මහණෙනි, මේ සත්වැනි පුද්ගලයා පූජාවට, ආගන්තුක සත්කාරයට, දක්ෂිණාවට සුදුසු වූ, අතින් ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු වූ, ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයකි. මහණෙනි, මේ සත් දෙනා පූජාවට, ආගන්තුක සත්කාරයට, දක්ෂිණාවට සුදුසු වූ, අතින් ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු වූ, ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයෝ වෙති.",
      "paliTitle": "Nibbānasuttaṃ",
      "englishTitle": "Nibbāna Sutta",
      "sinhalaTitle": "නිබ්බාන සූත්‍රය"
    },
    {
      "number": 20,
      "pali": "‘‘Sattimāni, bhikkhave, niddasavatthūni. Katamāni satta? Idha, bhikkhave, bhikkhu sikkhāsamādāne tibbacchando hoti āyatiñca sikkhāsamādāne avigatapemo [adhigatapemo (syā.) a. ni. 7.42; dī. ni. 3.331], dhammanisantiyā tibbacchando hoti āyatiñca dhammanisantiyā avigatapemo, icchāvinaye tibbacchando hoti āyatiñca icchāvinaye avigatapemo, paṭisallāne tibbacchando hoti āyatiñca paṭisallāne avigatapemo, vīriyārambhe [vīriyārabbhe (ka.)] tibbacchando hoti āyatiñca vīriyārambhe avigatapemo, satinepakke tibbacchando hoti āyatiñca satinepakke avigatapemo, diṭṭhipaṭivedhe tibbacchando hoti āyatiñca diṭṭhipaṭivedhe avigatapemo. Imāni kho, bhikkhave, satta niddasavatthūnī’’ti. Dasamaṃ. ",
      "english": "Monks, there are these seven grounds for instruction. Which seven? Here, monks, a monk is keenly desirous of undertaking the training, and in the future has unflagging affection for undertaking the training. He is keenly desirous of the scrutiny of the Dhamma, and in the future has unflagging affection for the scrutiny of the Dhamma. He is keenly desirous of the discipline of desires, and in the future has unflagging affection for the discipline of desires. He is keenly desirous of seclusion, and in the future has unflagging affection for seclusion. He is keenly desirous of the arousal of energy, and in the future has unflagging affection for the arousal of energy. He is keenly desirous of mindfulness and discernment, and in the future has unflagging affection for mindfulness and discernment. He is keenly desirous of the penetration of right view, and in the future has unflagging affection for the penetration of right view. These, monks, are the seven grounds for instruction.",
      "sinhala": "මහණෙනි, මේ කරුණු සතක් නිදර්ශන වස්තූන් වශයෙන් පවතී. කවරේද ඒ සත?\n\nමහණෙනි, මෙහිලා භික්ෂුව ශික්ෂා සමාදානයෙහි තීව\\u200D්‍ර ඡන්දයකින් යුක්ත වේ. අනාගතයෙහි ද ශික්ෂා සමාදානයෙහි ඔහුගේ ප\\u200D්‍රේමය නොනැසී පවතී. ධර\\u200D්ම විනිශ්චයෙහි ද තීව\\u200D්‍ර ඡන්දයකින් යුක්ත වේ. අනාගතයෙහි ද ධර\\u200D්ම විනිශ්චයෙහි ඔහුගේ ප\\u200D්‍රේමය නොනැසී පවතී. ආශාවන් දුරුකිරීමෙහි ද තීව\\u200D්‍ර ඡන්දයකින් යුක්ත වේ. අනාගතයෙහි ද ආශාවන් දුරුකිරීමෙහි ඔහුගේ ප\\u200D්‍රේමය නොනැසී පවතී. ප\\u200D්‍රතිසල්ලානයෙහි ද තීව\\u200D්‍ර ඡන්දයකින් යුක්ත වේ. අනාගතයෙහි ද ප\\u200D්‍රතිසල්ලානයෙහි ඔහුගේ ප\\u200D්‍රේමය නොනැසී පවතී. වීර්යය ආරම්භ කිරීමෙහි ද තීව\\u200D්‍ර ඡන්දයකින් යුක්ත වේ. අනාගතයෙහි ද වීර්යය ආරම්භ කිරීමෙහි ඔහුගේ ප\\u200D්‍රේමය නොනැසී පවතී. සති නුවණින් යුක්ත වීමෙහි ද තීව\\u200D්‍ර ඡන්දයකින් යුක්ත වේ. අනාගතයෙහි ද සති නුවණින් යුක්ත වීමෙහි ඔහුගේ ප\\u200D්‍රේමය නොනැසී පවතී. දෘෂ්\\u200Dටි ප\\u200D්‍රතිවේධයෙහි ද තීව\\u200D්‍ර ඡන්දයකින් යුක්ත වේ. අනාගතයෙහි ද දෘෂ්\\u200Dටි ප\\u200D්‍රතිවේධයෙහි ඔහුගේ ප\\u200D්‍රේමය නොනැසී පවතී.\n\nමහණෙනි, මේවාය නිදර්ශන වස්තූන් සතයි.",
      "paliTitle": "Niddasavatthusuttaṃ",
      "englishTitle": "Grounds for Mastery Sutta",
      "sinhalaTitle": "නිද්දසවත්ථු සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Anusayavaggo dutiyo. Tassuddānaṃ – Duve anusayā kulaṃ, puggalaṃ udakūpamaṃ; Aniccaṃ dukkhaṃ anattā ca, nibbānaṃ niddasavatthu cāti.",
    "english": "The second chapter on Underlying Tendencies. The summary of it: Two on Underlying Tendencies, Family, Person, Simile of Water; Impermanence, Suffering, Non-self, Nibbāna, and Grounds for Criticism.",
    "sinhala": "දෙවන අනුසය වර්ගයයි. එහි උද්දානය නම්: අනුසය සූත්‍ර දෙකක්, කුල, පුද්ගල, උදකූපම, අනිච්ඡ, දුක්ඛ, අනත්ත, නිබ්බාන සහ නිද්දසවත්ථු සූත්‍රයි."
  }
}