{
  "id": "an8.9",
  "title": {
    "pali": "Sativaggo",
    "english": "The Chapter on Mindfulness",
    "sinhala": "සති වග්ගය"
  },
  "sections": [
    {
      "number": 81,
      "pali": "‘‘Satisampajaññe, bhikkhave, asati satisampajaññavipannassa hatūpanisaṃ hoti hirottappaṃ. Hirottappe asati hirottappavipannassa hatūpaniso hoti indriyasaṃvaro. Indriyasaṃvare asati indriyasaṃvaravipannassa hatūpanisaṃ hoti sīlaṃ. Sīle asati sīlavipannassa hatūpaniso hoti sammāsamādhi. Sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ. Yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo. Nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, satisampajaññe asati satisampajaññavipannassa hatūpanisaṃ hoti hirottappaṃ; hirottappe asati hirottappavipannassa hatūpaniso hoti…pe… vimuttiñāṇadassanaṃ. ‘‘Satisampajaññe, bhikkhave, sati satisampajaññasampannassa upanisasampannaṃ hoti hirottappaṃ. Hirottappe sati hirottappasampannassa upanisasampanno hoti indriyasaṃvaro. Indriyasaṃvare sati indriyasaṃvarasampannassa upanisasampannaṃ hoti sīlaṃ. Sīle sati sīlasampannassa upanisasampanno hoti sammāsamādhi. Sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ. Yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo. Nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, satisampajaññe sati satisampajaññasampannassa upanisasampannaṃ hoti hirottappaṃ; hirottappe sati hirottappasampannassa upanisasampanno hoti… pe… vimuttiñāṇadassana’’nti. Paṭhamaṃ.",
      "english": "Monks, when there is no mindfulness and clear comprehension, for one deficient in mindfulness and clear comprehension, shame and moral dread lose their foundation. When there is no shame and moral dread, for one deficient in shame and moral dread, the guarding of the sense doors loses its foundation. When there is no guarding of the sense doors, for one deficient in the guarding of the sense doors, moral virtue loses its foundation. When there is no moral virtue, for one deficient in moral virtue, right concentration loses its foundation. When there is no right concentration, for one deficient in right concentration, knowledge and vision of things as they actually are lose their foundation. When there is no knowledge and vision of things as they actually are, for one deficient in knowledge and vision of things as they actually are, disenchantment and dispassion lose their foundation. When there is no disenchantment and dispassion, for one deficient in disenchantment and dispassion, knowledge and vision of liberation loses its foundation. Just as, monks, a tree that is deficient in branches and leaves — its bark does not come to full maturity, nor its inner bark, nor its sapwood, nor its heartwood. Even so, monks, when there is no mindfulness and clear comprehension, for one deficient in mindfulness and clear comprehension, shame and moral dread lose their foundation; when there is no shame and moral dread, for one deficient in shame and moral dread, the guarding of the sense doors loses its foundation; when there is no guarding of the sense doors, for one deficient in the guarding of the sense doors, moral virtue loses its foundation; when there is no moral virtue, for one deficient in moral virtue, right concentration loses its foundation; when there is no right concentration, for one deficient in right concentration, knowledge and vision of things as they actually are lose their foundation; when there is no knowledge and vision of things as they actually are, for one deficient in knowledge and vision of things as they actually are, disenchantment and dispassion lose their foundation; and when there is no disenchantment and dispassion, for one deficient in disenchantment and dispassion, knowledge and vision of liberation loses its foundation.\n\nMonks, when there is mindfulness and clear comprehension, for one endowed with mindfulness and clear comprehension, shame and moral dread have a complete foundation. When there is shame and moral dread, for one endowed with shame and moral dread, the guarding of the sense doors has a complete foundation. When there is guarding of the sense doors, for one endowed with the guarding of the sense doors, moral virtue has a complete foundation. When there is moral virtue, for one endowed with moral virtue, right concentration has a complete foundation. When there is right concentration, for one endowed with right concentration, knowledge and vision of things as they actually are has a complete foundation. When there is knowledge and vision of things as they actually are, for one endowed with knowledge and vision of things as they actually are, disenchantment and dispassion have a complete foundation. When there is disenchantment and dispassion, for one endowed with disenchantment and dispassion, knowledge and vision of liberation has a complete foundation. Just as, monks, a tree that is endowed with branches and leaves — its bark comes to full maturity, its inner bark, its sapwood, and its heartwood also come to full maturity. Even so, monks, when there is mindfulness and clear comprehension, for one endowed with mindfulness and clear comprehension, shame and moral dread have a complete foundation; when there is shame and moral dread, for one endowed with shame and moral dread, the guarding of the sense doors has a complete foundation; when there is guarding of the sense doors, for one endowed with the guarding of the sense doors, moral virtue has a complete foundation; when there is moral virtue, for one endowed with moral virtue, right concentration has a complete foundation; when there is right concentration, for one endowed with right concentration, knowledge and vision of things as they actually are has a complete foundation; when there is knowledge and vision of things as they actually are, for one endowed with knowledge and vision of things as they actually are, disenchantment and dispassion have a complete foundation; and when there is disenchantment and dispassion, for one endowed with disenchantment and dispassion, knowledge and vision of liberation has a complete foundation.",
      "sinhala": "භික්ෂූනි, සති සම්පජඤ්ඤය නොමැති කල්හි, සති සම්පජඤ්ඤයෙන් තොර වූ තැනැත්තාට හිරි ඔතප් දෙකෙහි උපනිශ්‍රය නැති වී යයි. හිරි ඔතප් දෙක නොමැති කල්හි, හිරි ඔතප් දෙකින් තොර වූ තැනැත්තාට ඉන්ද්‍රිය සංවරයෙහි උපනිශ්‍රය නැති වී යයි. ඉන්ද්‍රිය සංවරය නොමැති කල්හි, ඉන්ද්‍රිය සංවරයෙන් තොර වූ තැනැත්තාට ශීලයෙහි උපනිශ්‍රය නැති වී යයි. ශීලය නොමැති කල්හි, ශීලයෙන් තොර වූ තැනැත්තාට සම්මා සමාධියෙහි උපනිශ්‍රය නැති වී යයි. සම්මා සමාධිය නොමැති කල්හි, සම්මා සමාධියෙන් තොර වූ තැනැත්තාට යථාභූත ඥාන දර්ශනයෙහි උපනිශ්‍රය නැති වී යයි. යථාභූත ඥාන දර්ශනය නොමැති කල්හි, යථාභූත ඥාන දර්ශනයෙන් තොර වූ තැනැත්තාට නිබ්බිදා විරාගයෙහි උපනිශ්‍රය නැති වී යයි. නිබ්බිදා විරාගය නොමැති කල්හි, නිබ්බිදා විරාගයෙන් තොර වූ තැනැත්තාට විමුක්ති ඥාන දර්ශනයෙහි උපනිශ්‍රය නැති වී යයි.\n\nභික්ෂූනි, අතුපතරින් තොර වූ ගසක් යම්සේද, එහි පොත්ත පවා සම්පූර්ණ නොවෙයි, පොතුමත පොත්තත්, අරටු නොවන කොටසත්, අරටුවත් සම්පූර්ණ නොවෙයි. භික්ෂූනි, එපරිද්දෙන්ම, සති සම්පජඤ්ඤය නොමැති කල්හි, සති සම්පජඤ්ඤයෙන් තොර වූ තැනැත්තාට හිරි ඔතප් දෙකෙහි උපනිශ්‍රය නැති වී යයි; හිරි ඔතප් දෙක නොමැති කල්හි, හිරි ඔතප් දෙකින් තොර වූ තැනැත්තාට ඉන්ද්‍රිය සංවරයෙහි උපනිශ්‍රය නැති වී යයි. එලෙසින්ම ක්‍රමානුකූලව විමුක්ති ඥාන දර්ශනය දක්වා වූ (ඉතිරි සියලු දේවල) උපනිශ්‍රය නැති වී යයි.\n\nභික්ෂූනි, සති සම්පජඤ්ඤය ඇති කල්හි, සති සම්පජඤ්ඤයෙන් යුක්ත වූ තැනැත්තාට හිරි ඔතප් දෙකෙහි උපනිශ්‍රය සම්පූර්ණ වේ. හිරි ඔතප් දෙක ඇති කල්හි, හිරි ඔතප් දෙකෙන් යුක්ත වූ තැනැත්තාට ඉන්ද්‍රිය සංවරයෙහි උපනිශ්‍රය සම්පූර්ණ වේ. ඉන්ද්‍රිය සංවරය ඇති කල්හි, ඉන්ද්‍රිය සංවරයෙන් යුක්ත වූ තැනැත්තාට ශීලයෙහි උපනිශ්‍රය සම්පූර්ණ වේ. ශීලය ඇති කල්හි, ශීලයෙන් යුක්ත වූ තැනැත්තාට සම්මා සමාධියෙහි උපනිශ්‍රය සම්පූර්ණ වේ. සම්මා සමාධිය ඇති කල්හි, සම්මා සමාධියෙන් යුක්ත වූ තැනැත්තාට යථාභූත ඥාන දර්ශනයෙහි උපනිශ්‍රය සම්පූර්ණ වේ. යථාභූත ඥාන දර්ශනය ඇති කල්හි, යථාභූත ඥාන දර්ශනයෙන් යුක්ත වූ තැනැත්තාට නිබ්බිදා විරාගයෙහි උපනිශ්‍රය සම්පූර්ණ වේ. නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගයෙන් යුක්ත වූ තැනැත්තාට විමුක්ති ඥාන දර්ශනයෙහි උපනිශ්‍රය සම්පූර්ණ වේ.\n\nභික්ෂූනි, අතුපතරින් යුක්ත වූ ගසක් යම්සේද, එහි පොත්ත පවා සම්පූර්ණ වෙයි, පොතුමත පොත්තත්, අරටු නොවන කොටසත්, අරටුවත් සම්පූර්ණ වෙයි. භික්ෂූනි, එපරිද්දෙන්ම, සති සම්පජඤ්ඤය ඇති කල්හි, සති සම්පජඤ්ඤයෙන් යුක්ත වූ තැනැත්තාට හිරි ඔතප් දෙකෙහි උපනිශ්‍රය සම්පූර්ණ වේ; හිරි ඔතප් දෙක ඇති කල්හි, හිරි ඔතප් දෙකෙන් යුක්ත වූ තැනැත්තාට ඉන්ද්‍රිය සංවරයෙහි උපනිශ්‍රය සම්පූර්ණ වේ. එලෙසින්ම ක්‍රමානුකූලව විමුක්ති ඥාන දර්ශනය දක්වා වූ (ඉතිරි සියලු දේවල) උපනිශ්‍රය සම්පූර්ණ වේ.",
      "paliTitle": "Satisampajaññasuttaṃ",
      "englishTitle": "Mindfulness and Clear Comprehension Discourse",
      "sinhalaTitle": "සති සම්පජඤ්ඤ සූත්‍රය"
    },
    {
      "number": 82,
      "pali": "Atha kho āyasmā puṇṇiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā puṇṇiyo bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo yena appekadā tathāgataṃ dhammadesanā paṭibhāti, appekadā na paṭibhātī’’ti? ‘‘Saddho ca, puṇṇiya, bhikkhu hoti, no cupasaṅkamitā; neva tathāgataṃ dhammadesanā paṭibhāti. Yato ca kho, puṇṇiya, bhikkhu saddho ca hoti, upasaṅkamitā ca; evaṃ tathāgataṃ dhammadesanā paṭibhāti. Saddho ca, puṇṇiya, bhikkhu hoti, upasaṅkamitā ca, no ca payirupāsitā…pe… payirupāsitā ca, no ca paripucchitā… paripucchitā ca, no ca ohitasoto dhammaṃ suṇāti… ohitasoto ca dhammaṃ suṇāti, no ca sutvā dhammaṃ dhāreti… sutvā ca dhammaṃ dhāreti, no ca dhātānaṃ dhammānaṃ atthaṃ upaparikkhati… dhātānañca dhammānaṃ atthaṃ upaparikkhati, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti. Neva tāva tathāgataṃ dhammadesanā paṭibhāti. ‘‘Yato ca kho, puṇṇiya, bhikkhu saddho ca hoti, upasaṅkamitā ca, payirupāsitā ca, paripucchitā ca, ohitasoto ca dhammaṃ suṇāti, sutvā ca dhammaṃ dhāreti, dhātānañca dhammānaṃ atthaṃ upaparikkhati, atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; evaṃ tathāgataṃ dhammadesanā paṭibhāti. Imehi kho, puṇṇiya, aṭṭhahi dhammehi samannāgatā [samannāgato (sī. pī.), samannāgataṃ (syā. ka.)] ekantapaṭibhānā [ekantapaṭibhānaṃ (sabbattha) a. ni. 10.83 pana passitabbaṃ] tathāgataṃ dhammadesanā hotī’’ti. Dutiyaṃ.",
      "english": "Then indeed, the Venerable Puṇṇiya approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Venerable Puṇṇiya said to the Blessed One, \"Venerable sir, what is the reason, what is the condition, by which sometimes a Dhamma discourse manifests to the Tathāgata, and sometimes it does not manifest?\"\n\n\"Puṇṇiya, if a monastic has faith, but does not approach, then a Dhamma discourse does not manifest to the Tathāgata. However, when a monastic has faith and also approaches, then a Dhamma discourse does manifest to the Tathāgata.\"\n\n\"Puṇṇiya, if a monastic has faith and approaches, but does not attend closely, then a Dhamma discourse does not manifest to the Tathāgata. If he has faith, approaches, and attends closely, but does not inquire, then a Dhamma discourse does not manifest to the Tathāgata. If he has faith, approaches, attends closely, and inquires, but does not listen to the Dhamma with an attentive ear, then a Dhamma discourse does not manifest to the Tathāgata. If he has faith, approaches, attends closely, inquires, and listens to the Dhamma with an attentive ear, but does not retain the Dhamma after hearing it, then a Dhamma discourse does not manifest to the Tathāgata. If he has faith, approaches, attends closely, inquires, listens to the Dhamma with an attentive ear, and retains the Dhamma after hearing it, but does not examine the meaning of the retained Dhamma, then a Dhamma discourse does not manifest to the Tathāgata. If he has faith, approaches, attends closely, inquires, listens to the Dhamma with an attentive ear, retains the Dhamma after hearing it, and examines the meaning of the retained Dhamma, but does not practice in accordance with the Dhamma after understanding both the meaning and the Dhamma itself, then a Dhamma discourse does not manifest to the Tathāgata.\"\n\n\"However, when, Puṇṇiya, a monastic has faith, and approaches, and attends closely, and inquires, and listens to the Dhamma with an attentive ear, and retains the Dhamma after hearing it, and examines the meaning of the retained Dhamma, and practices in accordance with the Dhamma after understanding both the meaning and the Dhamma itself, then a Dhamma discourse does manifest to the Tathāgata.\"\n\n\"Puṇṇiya, it is when one is endowed with these eight qualities that a Dhamma discourse to the Tathāgata is certain to manifest.\"",
      "sinhala": "එවිට ආයුෂ්මත් පුණ්ණිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹුණේය; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩසිටි ආයුෂ්මත් පුණ්ණිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසුවා: ‘‘ස්වාමීනී, ඇතැම් විට තථාගතයන් වහන්සේට ධර්ම දේශනාව ප්‍රතිභානය වන (වැටහෙන) යම් හේතුවක්, යම් ප්‍රත්‍යයක් ඇද්ද, ඇතැම් විට ප්‍රතිභානය නොවන (නොවැටහෙන) යම් හේතුවක්, යම් ප්‍රත්‍යයක් ඇද්ද?”\n\n‘‘පුණ්ණිය, මහණ තෙමේ ශ්‍රද්ධාවන්තයෙක් වී නම්, එහෙත් (තථාගතයන් වහන්සේ වෙත) නොපැමිණෙන්නේ නම්, තථාගතයන් වහන්සේට ධර්ම දේශනාව ප්‍රතිභානය නොවේ. යම් හෙයකින් පුණ්ණිය, මහණ තෙමේ ශ්‍රද්ධාවන්තයෙක් ද වේ, (තථාගතයන් වහන්සේ වෙත) පැමිණෙන්නෙක් ද වේ නම්, මෙසේ තථාගතයන් වහන්සේට ධර්ම දේශනාව ප්‍රතිභානය වේ. පුණ්ණිය, මහණ තෙමේ ශ්‍රද්ධාවන්තයෙක් වී නම්, පැමිණෙන්නෙක් ද වී නම්, නමුත් (ආදරයෙන්, ගෞරවයෙන්) ඇසුරු නොකරයි නම්; (ආදරයෙන්, ගෞරවයෙන්) ඇසුරු කර, නමුත් (විමසා) නොඅසයි නම්; (විමසා) අසා, නමුත් සවන් යොමා ධර්මය නොඅසයි නම්; සවන් යොමා ධර්මය අසා, නමුත් අසා ධර්මය සිත්හි නොදරයි නම්; අසා ධර්මය සිත්හි දරා, නමුත් දරාගත් ධර්මයන්ගේ අර්ථය විමසා නොබලයි නම්; දරාගත් ධර්මයන්ගේ අර්ථය විමසා බලා, නමුත් අර්ථය දැන, ධර්මය දැන ධර්මානුධර්ම ප්‍රතිපදාවේ නොපිහිටයි නම්, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාව ප්‍රතිභානය නොවේ.\n\n‘‘යම් හෙයකින් පුණ්ණිය, මහණ තෙමේ ශ්‍රද්ධාවන්තයෙක් ද වේ, (තථාගතයන් වහන්සේ වෙත) පැමිණෙන්නෙක් ද වේ, (ආදරයෙන්, ගෞරවයෙන්) ඇසුරු කරන්නෙක් ද වේ, (විමසා) අසන්නෙක් ද වේ, සවන් යොමා ධර්මය අසන්නෙක් ද වේ, අසා ධර්මය සිත්හි දරන්නෙක් ද වේ, දරාගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් ද වේ, අර්ථය දැන, ධර්මය දැන ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටින්නෙක් ද වේ නම්, මෙසේ තථාගතයන් වහන්සේට ධර්ම දේශනාව ප්‍රතිභානය වේ. පුණ්ණිය, මේ අට කරුණින් සමන්විත වූ කල්හි තථාගතයන් වහන්සේට ධර්ම දේශනාව නියතයෙන්ම ප්‍රතිභානය වේ.’’",
      "paliTitle": "Puṇṇiyasuttaṃ",
      "englishTitle": "Puṇṇiya Sutta",
      "sinhalaTitle": "පුණ්ණිය සූත‍්‍රය"
    },
    {
      "number": 83,
      "pali": "[a. ni. 10.58 passitabbaṃ] ‘‘Sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kiṃmūlakā, āvuso, sabbe dhammā, kiṃsambhavā sabbe dhammā, kiṃsamudayā sabbe dhammā, kiṃsamosaraṇā sabbe dhammā, kiṃpamukhā sabbe dhammā, kiṃadhipateyyā sabbe dhammā, kiṃuttarā sabbe dhammā, kiṃsārā sabbe dhammā’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ kinti byākareyyāthā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā, bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kiṃmūlakā, āvuso, sabbe dhammā, kiṃsambhavā sabbe dhammā, kiṃsamudayā sabbe dhammā, kiṃsamosaraṇā sabbe dhammā, kiṃpamukhā sabbe dhammā, kiṃadhipateyyā sabbe dhammā, kiṃuttarā sabbe dhammā, kiṃsārā sabbe dhammā’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘chandamūlakā, āvuso, sabbe dhammā, manasikārasambhavā sabbe dhammā, phassasamudayā sabbe dhammā, vedanāsamosaraṇā sabbe dhammā, samādhippamukhā sabbe dhammā, satādhipateyyā sabbe dhammā, paññuttarā sabbe dhammā, vimuttisārā sabbe dhammā’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyāthā’’ti. Tatiyaṃ.",
      "english": "\"Monks, if other ascetics of different sects were to ask you this: ‘Friends, what are all phenomena rooted in? What do all phenomena arise from? What do all phenomena originate from? Where do all phenomena converge? What are all phenomena led by? What are all phenomena governed by? What is supreme among all phenomena? What is the essence of all phenomena?’ – Monks, when asked this by those other ascetics, how would you answer them?\" \"For us, Venerable Sir, phenomena are rooted in the Blessed One, led by the Blessed One, and have the Blessed One as their refuge. It would be good, Venerable Sir, if the meaning of this statement would occur to the Blessed One himself. Having heard it from the Blessed One, the monastics will remember it.\" \"In that case, monks, I will teach it. Listen to it, attend carefully; I will speak.\" \"Yes, Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"Monks, if other ascetics of different sects were to ask you this: ‘Friends, what are all phenomena rooted in? What do all phenomena arise from? What do all phenomena originate from? Where do all phenomena converge? What are all phenomena led by? What are all phenomena governed by? What is supreme among all phenomena? What is the essence of all phenomena?’ – Monks, when asked this by those other ascetics, you should answer them in this way: ‘Friends, all phenomena are rooted in intention, all phenomena arise from mental engagement, all phenomena originate from contact, all phenomena converge in feeling, all phenomena are led by concentration, all phenomena are governed by mindfulness, wisdom is supreme among all phenomena, and the essence of all phenomena is liberation.’ – Monks, when asked this by those other ascetics, you should answer them in this way.\"\n\nThe Third.",
      "sinhala": "මහණෙනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ අසන්නාහු නම්: ‘ඇවැත්නි, සියලු ධර්මයන්ට මුල කුමක්ද? සියලු ධර්මයන්ගේ සම්භවය කුමක්ද? සියලු ධර්මයන්ගේ සමුදය කුමක්ද? සියලු ධර්මයන්ගේ සමෝසරණය කුමක්ද? සියලු ධර්මයන්ගේ ප්‍රමුඛය කුමක්ද? සියලු ධර්මයන්ගේ අධිපතීත්වය කුමක්ද? සියලු ධර්මයන්ගේ උත්තරීතර භාවය කුමක්ද? සියලු ධර්මයන්ගේ සාරය කුමක්දැයි?’ මහණෙනි, මෙසේ අසන ලද ඔබලා එම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට කෙසේ පිළිතුරු දෙන්නෙහිද?\n\n“ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහුය. භාග්‍යවතුන් වහන්සේ ප්‍රධාන කොට ඇත්තාහුය. භාග්‍යවතුන් වහන්සේ කරා මඟ පෙන්වීම ඇත්තාහුය. භාග්‍යවතුන් වහන්සේම පිළිසරණ කොට ඇත්තාහුය. ස්වාමීනි, මැනවි, මේ වචනයේ අර්ථය භාග්‍යවතුන් වහන්සේටම පැහැදිලි වේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය සිත්හි දරා ගන්නාහ” යි.\n\n“එසේ නම් මහණෙනි, මම දේශනා කරන්නෙමි. එය අසන්න, මැනවින් මෙනෙහි කරව්; මම කියන්නෙමි” යි. “එසේය, ස්වාමීනි” යි එම භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“මහණෙනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ අසන්නාහු නම්: ‘ඇවැත්නි, සියලු ධර්මයන්ට මුල කුමක්ද? සියලු ධර්මයන්ගේ සම්භවය කුමක්ද? සියලු ධර්මයන්ගේ සමුදය කුමක්ද? සියලු ධර්මයන්ගේ සමෝසරණය කුමක්ද? සියලු ධර්මයන්ගේ ප්‍රමුඛය කුමක්ද? සියලු ධර්මයන්ගේ අධිපතීත්වය කුමක්ද? සියලු ධර්මයන්ගේ උත්තරීතර භාවය කුමක්ද? සියලු ධර්මයන්ගේ සාරය කුමක්දැයි?’ මහණෙනි, මෙසේ අසන ලද ඔබලා එම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතුය: ‘ඇවැත්නි, සියලු ධර්මයෝ ඡන්දය මුල් කොට ඇත්තාහ. සියලු ධර්මයෝ මනසිකාරය සම්භවය කොට ඇත්තාහ. සියලු ධර්මයෝ ස්පර්ශය සමුදය කොට ඇත්තාහ. සියලු ධර්මයෝ වේදනාව සමෝසරණය කොට ඇත්තාහ. සියලු ධර්මයෝ සමාධිය ප්‍රමුඛ කොට ඇත්තාහ. සියලු ධර්මයෝ සතිය අධිපතීත්වය කොට ඇත්තාහ. සියලු ධර්මයෝ ප්‍රඥාව උත්තරීතර කොට ඇත්තාහ. සියලු ධර්මයෝ විමුක්තිය සාරය කොට ඇත්තාහ’ යි. මහණෙනි, මෙසේ අසන ලද ඔබලා එම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතුය.”",
      "paliTitle": "Mūlakasuttaṃ",
      "englishTitle": "The Root Discourse",
      "sinhalaTitle": "මූල සූත්‍රය"
    },
    {
      "number": 84,
      "pali": "‘‘Aṭṭhahi, bhikkhave, aṅgehi samannāgato mahācoro khippaṃ pariyāpajjati, na ciraṭṭhitiko hoti. Katamehi aṭṭhahi? Appaharantassa paharati, anavasesaṃ ādiyati, itthiṃ hanati, kumāriṃ dūseti, pabbajitaṃ vilumpati, rājakosaṃ vilumpati, accāsanne kammaṃ karoti, na ca nidhānakusalo hoti. Imehi kho, bhikkhave, aṭṭhahaṅgehi samannāgato mahācoro khippaṃ pariyāpajjati, na ciraṭṭhitiko hoti. ‘‘Aṭṭhahi, bhikkhave, aṅgehi samannāgato mahācoro na khippaṃ pariyāpajjati, ciraṭṭhitiko hoti. Katamehi aṭṭhahi? Na appaharantassa paharati, na anavasesaṃ ādiyati, na itthiṃ hanati, na kumāriṃ dūseti, na pabbajitaṃ vilumpati, na rājakosaṃ vilumpati, na accāsanne kammaṃ karoti, nidhānakusalo ca hoti. Imehi kho, bhikkhave, aṭṭhahaṅgehi samannāgato mahācoro na khippaṃ pariyāpajjati, ciraṭṭhitiko hotī’’ti. Catutthaṃ.",
      "english": "Monks, a great thief endowed with eight qualities quickly comes to ruin and does not last long. Which eight?\nHe strikes those who do not strike back; he takes everything without remainder; he kills women; he violates virgins; he plunders renunciants; he plunders the royal treasury; he commits deeds in too close proximity; and he is not skilled in concealment. Monks, a great thief endowed with these eight qualities quickly comes to ruin and does not last long.\n\nMonks, a great thief endowed with eight qualities does not quickly come to ruin and lasts long. Which eight?\nHe does not strike those who do not strike back; he does not take everything without remainder; he does not kill women; he does not violate virgins; he does not plunder renunciants; he does not plunder the royal treasury; he does not commit deeds in too close proximity; and he is skilled in concealment. Monks, a great thief endowed with these eight qualities does not quickly come to ruin and lasts long.",
      "sinhala": "මහණෙනි, අට අංගයකින් යුක්ත වූ මහා සොරෙක් ඉක්මනින් විනාශයට පත්වෙයි, බොහෝ කල් නොපවතී. කවර අටකින්ද? පහර නොදෙන්නාට පහර දෙයි, කිසිවක් නොඉතිරිව පැහැර ගනියි, ස්ත්‍රීන් මරයි, කන්‍යාවන් දූෂණය කරයි, පැවිද්දන් කොල්ලකයි, රාජකීය භාණ්ඩාගාරය කොල්ලකයි, ඉතා ආසන්නයේ කම් කරයි, සැඟවීමට දක්‍ෂ නොවෙයි. මහණෙනි, මේ අට අංගයන්ගෙන් යුක්ත වූ මහා සොරෙක් ඉක්මනින් විනාශයට පත්වෙයි, බොහෝ කල් නොපවතී.\n\nමහණෙනි, අට අංගයකින් යුක්ත වූ මහා සොරෙක් ඉක්මනින් විනාශයට පත් නොවෙයි, බොහෝ කල් පවතී. කවර අටකින්ද? පහර නොදෙන්නාට පහර නොදෙයි, කිසිවක් නොඉතිරිව පැහැර නොගනියි, ස්ත්‍රීන් නොමරයි, කන්‍යාවන් දූෂණය නොකරයි, පැවිද්දන් නොකොල්ලකයි, රාජකීය භාණ්ඩාගාරය නොකොල්ලකයි, ඉතා ආසන්නයේ කම් නොකරයි, සැඟවීමට ද දක්‍ෂ වෙයි. මහණෙනි, මේ අට අංගයන්ගෙන් යුක්ත වූ මහා සොරෙක් ඉක්මනින් විනාශයට පත් නොවෙයි, බොහෝ කල් පවතී.",
      "paliTitle": "Corasuttaṃ",
      "englishTitle": "The Thief Sutta",
      "sinhalaTitle": "සොර සූත්‍රය"
    },
    {
      "number": 85,
      "pali": "‘‘‘Samaṇo’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. ‘Brāhmaṇo’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. ‘Vedagū’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. ‘Bhisakko’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. ‘Nimmalo’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. ‘Vimalo’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. ‘Ñāṇī’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. ‘Vimutto’ti, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassā’’ti. ‘‘Yaṃ samaṇena pattabbaṃ, brāhmaṇena vusīmatā; Yaṃ vedagunā pattabbaṃ, bhisakkena anuttaraṃ. ‘‘Yaṃ nimmalena pattabbaṃ, vimalena sucīmatā; Yaṃ ñāṇinā ca pattabbaṃ, vimuttena anuttaraṃ. ‘‘Sohaṃ vijitasaṅgāmo, mutto mocemi bandhanā; Nāgomhi paramadanto, asekho parinibbuto’’ti. pañcamaṃ;",
      "english": "Monks, 'Recluse' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One. Monks, 'Holy One' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One. Monks, 'Master of True Knowledge' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One. Monks, 'Physician' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One. Monks, 'Spotless One' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One. Monks, 'Pure One' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One. Monks, 'Knower' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One. Monks, 'Liberated One' is an appellation for the Tathāgata, the Arahant, the Fully Awakened One.\n\nThat which is to be attained by a recluse, by a holy one who has fulfilled the holy life; that which is to be attained by one who has penetrated true knowledge, by the unsurpassed Physician—\n\nThat which is to be attained by the Spotless One, by the Pure and Immaculate One; and that which is to be attained by the Knower, by the unsurpassed Liberated One—\n\nI am that one who has conquered the battle. Having been freed, I liberate from bondage. I am the Great One, supremely tamed, beyond training, fully extinguished.",
      "sinhala": "භික්ෂූන් වහන්ස, 'ශ්‍රමණයෝ' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි. භික්ෂූන් වහන්ස, 'බ්‍රාහ්මණයෝ' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි. භික්ෂූන් වහන්ස, 'වේදගූ' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි. භික්ෂූන් වහන්ස, 'භිෂක්' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි. භික්ෂූන් වහන්ස, 'නිර්මල' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි. භික්ෂූන් වහන්ස, 'විමල' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි. භික්ෂූන් වහන්ස, 'ඥානී' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි. භික්ෂූන් වහන්ස, 'විමුක්ත' යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර කරන නාමයකි.\n\nශ්‍රමණයකු විසින්ද, බ්‍රහ්මචාරීව වාසය කළ බ්‍රාහ්මණයකු විසින්ද පැමිණිය යුතු යමක් වේද, වේදගූවරයකු විසින්ද, අනුත්තර වූ භිෂක්වරයකු විසින්ද පැමිණිය යුතු යමක් වේද, නිර්මල කෙනෙකු විසින්ද, පාරිශුද්ධ වූ විමල කෙනෙකු විසින්ද පැමිණිය යුතු යමක් වේද, ඥානීන් විසින්ද, අනුත්තර වූ විමුක්ත කෙනෙකු විසින්ද පැමිණිය යුතු යමක් වේද, මම කෙලෙස් සංග්‍රාමය ජයගත් කෙනෙක්මි. (කෙලෙස්) බන්ධනයන්ගෙන් මිදුණු මම, අන්‍යයන්ද බන්ධනයන්ගෙන් මුදවමි. මම පරම දමනය කරගත් නාගයෙක්මි. මම අසෙඛ වූ, පිරිනිවුණු කෙනෙක්මි.",
      "paliTitle": "Samaṇasuttaṃ",
      "englishTitle": "Discourse on the Ascetic",
      "sinhalaTitle": "සමණසූත‍්‍රය"
    },
    {
      "number": 86,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena icchānaṅgalaṃ nāma kosalānaṃ brāhmaṇagāmo tadavasari. Tatra sudaṃ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Assosuṃ kho icchānaṅgalakā brāhmaṇagahapatikā – ‘‘samaṇo khalu bho gotamo sakyaputto sakyakulā pabbajito icchānaṅgalaṃ anuppatto icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho…pe… sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’’ti. Atha kho icchānaṅgalakā brāhmaṇagahapatikā tassā rattiyā accayena pahutaṃ khādanīyaṃ bhojanīyaṃ ādāya yena icchānaṅgalavanasaṇḍo tenupasaṅkamiṃsu; upasaṅkamitvā bahidvārakoṭṭhake aṭṭhaṃsu uccāsaddā mahāsaddā. Tena kho pana samayena āyasmā nāgito bhagavato upaṭṭhāko hoti. Atha kho bhagavā āyasmantaṃ nāgitaṃ āmantesi – ‘‘ke pana te, nāgita, uccāsaddā mahāsaddā kevaṭṭā maññe macchavilope’’ti? ‘‘Ete, bhante, icchānaṅgalakā brāhmaṇagahapatikā pahutaṃ khādanīyaṃ bhojanīyaṃ ādāya bahidvārakoṭṭhake ṭhitā bhagavantaṃyeva uddissa bhikkhusaṅghañcā’’ti. ‘‘Māhaṃ, nāgita, yasena samāgamaṃ, mā ca mayā yaso. Yo kho, nāgita, nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī assa akicchalābhī akasiralābhī. Yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī [nikāmalābhī assaṃ (bahūsu) a. ni. 5.30 passitabbaṃ. tattha hi ayaṃ pāṭhabhedā natthi] akicchalābhī akasiralābhī, so taṃ mīḷhasukhaṃ middhasukhaṃ lābhasakkārasilokasukhaṃ sādiyeyyā’’ti. ‘‘Adhivāsetu dāni, bhante, bhagavā. Adhivāsetu sugato. Adhivāsanakālo dāni, bhante, bhagavato. Yena yeneva dāni, bhante, bhagavā gamissati tanninnāva bhavissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Seyyathāpi, bhante, thullaphusitake deve vassante yathāninnaṃ udakāni pavattanti; evamevaṃ kho, bhante, yena yeneva dāni bhagavā gamissati tanninnāva bhavissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Taṃ kissa hetu? Tathā hi, bhante, bhagavato sīlapaññāṇa’’nti. ‘‘Māhaṃ, nāgita, yasena samāgamaṃ, mā ca mayā yaso. Yo kho, nāgita, nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī assa akicchalābhī akasiralābhī. Yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī, so taṃ mīḷhasukhaṃ middhasukhaṃ lābhasakkārasilokasukhaṃ sādiyeyya. ‘‘Devatāpi kho, nāgita, ekaccā nayimassa [ekaccā imassa (?)] nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhiniyo assu [idaṃ padaṃ katthaci natthi] akicchalābhiniyo [nikāmalābhiniyo akicchalābhiniyo (?)] akasiralābhiniyo, yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. Tumhākampi [tāsampi (?)] kho, nāgita, saṅgamma samāgamma saṅgaṇikavihāraṃ anuyuttānaṃ viharataṃ [anuyutte viharante disvā (?)] evaṃ hoti – ‘na hi nūname [na hanūname (sī. syā. pī.)] āyasmanto imassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhino assu [idaṃ padaṃ katthaci natthi] akicchalābhino akasiralābhino. Yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. Tathā hi pana me āyasmanto saṅgamma samāgamma saṅgaṇikavihāraṃ anuyuttā viharanti’’’. ‘‘Idhāhaṃ, nāgita, bhikkhū passāmi aññamaññaṃ aṅgulipatodakena [aṅgulipatodakehi (sī. pī. ka.)] sañjagghante saṅkīḷante. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘na hi nūname āyasmanto imassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhino assu akicchalābhino akasiralābhino. Yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. Tathā hi pana me āyasmanto aññamaññaṃ aṅgulipatodakena sañjagghanti saṅkīḷanti’’’. ‘‘Idha panāhaṃ [idhāhaṃ (sī. pī. ka.)], nāgita, bhikkhū passāmi yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutte viharante. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘na hi nūname āyasmanto imassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhino assu akicchalābhino akasiralābhino. Yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. Tathā hi pana me āyasmanto yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyuttā viharanti’’’. ‘‘Idhāhaṃ [idha panāhaṃ (?)], nāgita, bhikkhuṃ passāmi gāmantavihāriṃ samāhitaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idāni imaṃ [idānimaṃ (katthaci) a. ni. 6.42] āyasmantaṃ ārāmiko vā upaṭṭhahissati [paccessati (sī. pī.), upaṭṭhahati (ka.)] samaṇuddeso vā. Taṃ tamhā [so tamhā (ka. sī.), so taṃ tamhā (?)] samādhimhā cāvessatī’ti. Tenāhaṃ, nāgita, tassa bhikkhuno na attamano homi gāmantavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ araññe pacalāyamānaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idāni ayamāyasmā imaṃ niddākilamathaṃ paṭivinodetvā araññasaññaṃyeva manasi karissati ekatta’nti. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ araññe asamāhitaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idāni ayamāyasmā asamāhitaṃ vā cittaṃ samādahissati [samādahessati (katthaci)], samāhitaṃ vā cittaṃ anurakkhissatī’ti. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ araññe samāhitaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idāni ayamāyasmā avimuttaṃ vā cittaṃ vimuccissati, vimuttaṃ vā cittaṃ anurakkhissatī’ti. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi gāmantavihāriṃ lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. So taṃ lābhasakkārasilokaṃ nikāmayamāno riñcati paṭisallānaṃ, riñcati araññavanapatthāni pantāni senāsanāni; gāmanigamarājadhāniṃ osaritvā vāsaṃ kappeti. Tenāhaṃ, nāgita, tassa bhikkhuno na attamano homi gāmantavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. So taṃ lābhasakkārasilokaṃ paṭipaṇāmetvā na riñcati paṭisallānaṃ, na riñcati araññavanapatthāni pantāni senāsanāni. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. [[ ] etthantare pāṭho a. ni. 6.42 chakkanipāteyeva dissati, na ettha aṭṭhakanipāte] ‘‘Yasmāhaṃ [yasmiṃhaṃ (katthaci)], nāgita, samaye addhānamaggappaṭipanno na kañci passāmi purato vā pacchato vā, phāsu me, nāgita, tasmiṃ samaye hoti antamaso uccārapassāvakammāyā’’ti. Chaṭṭhaṃ.",
      "english": "At one time, the Blessed One, while wandering in the Kosala country together with a large community of monastics, arrived at Icchānaṅgala, a brahmin village of the Kosalans. There, it is said, the Blessed One dwelt in Icchānaṅgala, in the Icchānaṅgala forest grove. Now the brahmin householders of Icchānaṅgala heard, \"Indeed, good sirs, the ascetic Gotama, a son of the Sakyans, gone forth from the Sakyan clan, has arrived at Icchānaṅgala and is dwelling in Icchānaṅgala, in the Icchānaṅgala forest grove. And concerning that venerable Gotama, such an excellent reputation has spread: 'Indeed, that Blessed One is an Arahant, a Perfectly Self-Awakened One, endowed with wisdom and conduct, a Fortunate One, knower of worlds, unsurpassed leader of persons to be tamed, teacher of devas and humans, a Buddha, a Blessed One.' It is indeed good to see such Arahants.\" Then, after the passing of that night, the brahmin householders of Icchānaṅgala, having taken abundant hard and soft food, approached the Icchānaṅgala forest grove; having approached, they stood outside the entrance portal, making a loud and great noise. Now at that time, Venerable Nāgita was the Blessed One's attendant. Then the Blessed One addressed Venerable Nāgita, \"Who, Nāgita, are these making a loud and great noise? Are they perhaps fishermen disturbing fish?\" \"Bhante, these are the brahmin householders of Icchānaṅgala, having taken abundant hard and soft food, standing outside the entrance portal, intending to offer it to the Blessed One and the community of monastics.\" \"Nāgita, may I not associate with fame, and may fame not associate with me. Indeed, Nāgita, if one is not a willing recipient of, a recipient without difficulty, a recipient without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening, such a one would delight in that happiness of excrement, happiness of drowsiness, happiness of gains, honor, and praise. But I am a willing recipient of, a recipient without difficulty, a recipient without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening, and therefore I do not delight in that happiness of excrement, happiness of drowsiness, happiness of gains, honor, and praise.\"\n\n\"Bhante, may the Blessed One now acquiesce. May the Fortunate One acquiesce. Bhante, it is now time for the Blessed One to acquiesce. Bhante, wherever the Blessed One goes now, the brahmin householders, townsfolk, and country folk will be inclined towards him. Just as, Bhante, when heavy rain falls, the waters flow according to the slope; even so, Bhante, wherever the Blessed One goes now, the brahmin householders, townsfolk, and country folk will be inclined towards him. What is the reason for this? For thus, Bhante, is the Blessed One's virtue and wisdom.\"\n\n\"Nāgita, may I not associate with fame, and may fame not associate with me. Indeed, Nāgita, if one is not a willing recipient of, a recipient without difficulty, a recipient without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening, such a one would delight in that happiness of excrement, happiness of drowsiness, happiness of gains, honor, and praise. But I am a willing recipient of, a recipient without difficulty, a recipient without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening, and therefore I do not delight in that happiness of excrement, happiness of drowsiness, happiness of gains, honor, and praise. Even some devas, Nāgita, are not willing recipients of, recipients without difficulty, recipients without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening, while I am a willing recipient of, a recipient without difficulty, a recipient without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening. And to you all, Nāgita, who gather together, associate together, and live devoted to society, it occurs thus: 'Surely these venerable ones are not willing recipients of, recipients without difficulty, recipients without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening, while I am a willing recipient of, a recipient without difficulty, a recipient without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening. For indeed, these venerable ones of mine gather together, associate together, and live devoted to society.'\"\n\n\"Here, Nāgita, I see monastics poking one another with fingers, laughing loudly, and playing. To me, Nāgita, it occurs thus: 'Surely these venerable ones are not willing recipients of, recipients without difficulty, recipients without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening, while I am a willing recipient of, a recipient without difficulty, a recipient without trouble, of this happiness of renunciation, happiness of solitude, happiness of tranquility, happiness of awakening. For indeed, these venerable ones of mine poke one another with fingers, laugh loudly, and play.'\"\n\n\"Moreover, Nāgita, here I see monastics, having eaten their fill, to the point of stretching their stomachs, dwelling devoted to the happiness of lying down, the happiness of slumber, the happiness of drowsiness.\"\n\nThen, Nāgita, it occurs to me, ‘Surely these venerable ones do not attain, without difficulty or trouble, as they wish, this happiness of renunciation, happiness of seclusion, happiness of tranquility, and happiness of awakening. Whereas I am able to attain, without difficulty or trouble, as I wish, this happiness of renunciation, happiness of seclusion, happiness of tranquility, and happiness of awakening. Yet, these venerable ones of mine, having eaten their fill until their stomachs are distended, live devoted to the happiness of lying down, the happiness of drowsiness, and the happiness of sluggishness.’\n\nHere, Nāgita, I see a monk dwelling near a village, sitting in concentration. It occurs to me, Nāgita, ‘Now, either a monastery attendant or a novice will attend upon this venerable one and disturb him from that concentration.’ Therefore, Nāgita, I am not pleased with that monk dwelling near a village.\n\nBut here, Nāgita, I see a forest monk sitting in the forest, nodding off. It occurs to me, Nāgita, ‘Now, this venerable one, having dispelled this weariness of sleep, will focus his mind solely on the perception of the forest and solitude.’ Therefore, Nāgita, I am pleased with that monk dwelling in the forest.\n\nBut here, Nāgita, I see a forest monk sitting in the forest, not concentrated. It occurs to me, Nāgita, ‘Now, this venerable one will either concentrate his unconcentrated mind, or he will maintain his concentrated mind.’ Therefore, Nāgita, I am pleased with that monk dwelling in the forest.\n\nBut here, Nāgita, I see a forest monk sitting in the forest, concentrated. It occurs to me, Nāgita, ‘Now, this venerable one will either liberate his unliberated mind, or he will maintain his liberated mind.’ Therefore, Nāgita, I am pleased with that monk dwelling in the forest.\n\nBut here, Nāgita, I see a monk dwelling near a village who obtains robes, alms-food, lodgings, and requisites for the sick, including medicine. Desiring such gains, honor, and renown, he gives up solitude, he gives up remote abodes in forests, wildernesses, and thickets; he moves to a village, town, or royal capital and dwells there. Therefore, Nāgita, I am not pleased with that monk dwelling near a village.\n\nBut here, Nāgita, I see a forest monk who obtains robes, alms-food, lodgings, and requisites for the sick, including medicine. Having rejected such gains, honor, and renown, he does not give up solitude, he does not give up remote abodes in forests, wildernesses, and thickets. Therefore, Nāgita, I am pleased with that monk dwelling in the forest. Indeed, Nāgita, when I am travelling on a long journey and see no one in front or behind me, it is convenient for me at that time, even for the purpose of urinating or defecating.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයෙහි චාරිකාවේ වඩමින් මහත් භික්ෂුසංඝයා වහන්සේලා සමඟ කෝසල ජනපදයට අයත් ඉච්ඡානංගල නම් බ්‍රාහ්මණ ගම කරා වැඩම කළ සේක. එහි භාග්‍යවතුන් වහන්සේ ඉච්ඡානංගල ගම අසල ඉච්ඡානංගල වනසණ්ඩයෙහි වාසය කළ සේක.\n\nඑකල්හි ඉච්ඡානංගල වැසි බ්‍රාහ්මණ ගෘහපතියෝ මෙසේ අසන්නට ලැබුණාහ: \"භවත් ගෞතම ශ්‍රමණයන් වහන්සේ, ශාක්‍ය පුත්‍රයාණන් වහන්සේ, ශාක්‍ය කුලයෙන් පැවිදිවූවන් වහන්සේ ඉච්ඡානංගලයට පැමිණ, ඉච්ඡානංගල වනසණ්ඩයෙහි වාසය කරන සේක. ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳව, ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං සම්මාසම්බුද්ධයහ... (මේ ආදී වශයෙන්) මේ අයුරින් යහපත් කීර්ති ඝෝෂාවක් පැතිරී ඇත. ඒ අයුරින් අරහතුන් වහන්සේලා දැකීම සුදුසු වන්නේය’ යනුවෙන්.\"\n\nඑකල්හි ඉච්ඡානංගල වැසි බ්‍රාහ්මණ ගෘහපතියෝ ඒ රාත්‍රිය අවසන් වූ කල්හි බොහෝ කැවිලි හා භෝජන වර්ග රැගෙන ඉච්ඡානංගල වනසණ්ඩය වෙත එළඹුණාහ. එළඹ, වනසණ්ඩයේ දොරටුවෙන් පිටත උස් හඬින්, මහත් ශබ්ද නගමින් සිටියාහ. එකල්හි ආයුෂ්මත් නාගිත තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේගේ උපස්ථායකව සිටි සේක.\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් නාගිත තෙරුන් වහන්සේ අමතා මෙසේ වදාළ සේක: \"නාගිත, මේ කවරහුද මෙතරම් උස් හඬින්, මහත් ශබ්ද නගන්නේ? මට නම් සිතෙන්නේ මේ මසුන් අල්ලන්නන් (ධීවරයන්) මසුන් දඟලවන ශබ්දය කියාය.\" \"ස්වාමීනි, මේ ඉච්ඡානංගල වැසි බ්‍රාහ්මණ ගෘහපතියෝ බොහෝ කැවිලි හා භෝජන වර්ග රැගෙන, භාග්‍යවතුන් වහන්සේත් භික්ෂුසංඝයා වහන්සේත් උදෙසා (දන් දීමට) දොරටුවෙන් පිටත සිටිති.\"\n\n\"නාගිත, මම කීර්තිය සමඟ එක් නොවේවා, කීර්තිය මා සමඟ නොවේවා. නාගිත, යමෙක් මේ නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව නොලබන්නේ නම්, ඔහු නම් ඒ අසූචි සැපය, නිද්‍රා සැපය, ලාභ සත්කාර ප්‍රශංසා සැපය ප්‍රිය කරන්නේය. මම නම් නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව ලබමි.\"\n\n\"ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ මේ දානය පිළිගන්නා සේක්වා. සුගතයන් වහන්සේ පිළිගන්නා සේක්වා. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේට දානය පිළිගැනීමට කාලයයි. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ කොයි කොයි දිශාවට වැඩියත්, නගර වැසියෝ සහ ජනපද වැසියෝ වන බ්‍රාහ්මණ ගෘහපතියෝ උන්වහන්සේටම නැඹුරු වන්නාහ. ස්වාමීනි, යම් සේ මහ වර්ෂාවක් වසින කල්හි ජලය බෑවුම් සහිත පෙදෙස් කරා ගලා බසින්නේද; එපරිද්දෙන්ම ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ කොයි කොයි දිශාවට වැඩියත්, නගර වැසියෝ සහ ජනපද වැසියෝ වන බ්‍රාහ්මණ ගෘහපතියෝ උන්වහන්සේටම නැඹුරු වන්නාහ. ඒ කවර හෙයින්ද? ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ සිල්වත්කම හා ප්‍රඥාව එබඳු බැවිනි.\"\n\n\"නාගිත, මම කීර්තිය සමඟ එක් නොවේවා, කීර්තිය මා සමඟ නොවේවා. නාගිත, යමෙක් මේ නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව නොලබන්නේ නම්, ඔහු නම් ඒ අසූචි සැපය, නිද්‍රා සැපය, ලාභ සත්කාර ප්‍රශංසා සැපය ප්‍රිය කරන්නේය. මම නම් නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව ලබමි.\"\n\n\"නාගිත, සමහර දෙවිවරුද මේ නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව නොලබන්නෝ වෙත්. මා නම් නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව ලබමි. නාගිත, ඔබලාද එකට එක්වී, සමූහ වශයෙන් වාසය කිරීමට යොමුවී සිටිනු දකින ඇතැම් දෙවිවරුන්ට මෙසේ සිතෙන්නේය – 'මේ ආයුෂ්මත්වරු නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව නොලබන්නෝ විය යුතුයි. මා නම් නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව ලබමි. එසේ තිබියදී මාගේ මේ ආයුෂ්මත්වරු එකට එක්වී, සමූහ වශයෙන් වාසය කිරීමට යොමුවී සිටින බැවිනි.'\"\n\n\"නාගිත, මෙහි මම භික්ෂූන් වහන්සේලා අන්‍යෝන්‍ය වශයෙන් ඇඟිලි තුඩු වලින් ඇන (විහිළු කරමින්) මහත් සේ සිනාසෙමින්, ක්‍රීඩා කරනු දකිමි. එවිට නාගිත, මට මෙසේ සිතේ – 'මේ ආයුෂ්මත්වරු නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව නොලබන්නෝ විය යුතුයි. මා නම් නෛෂ්ක්‍රම්‍ය සැපය, විවේක සැපය, උපශම සැපය, සම්බෝධි සැපය කැමැති සේ පහසුවෙන්, වෙහෙසකින් තොරව ලබමි. මක්නිසාද යත්, මාගේ මේ ආයුෂ්මත්වරු අන්‍යෝන්‍ය වශයෙන් ඇඟිලි තුඩු වලින් ඇන (විහිළු කරමින්) මහත් සේ සිනාසෙමින්, ක්‍රීඩා කරන බැවිනි.'\"\n\n\"නාගිත, තවද මෙහි මම භික්ෂූන් වහන්සේලා කුස පිරෙන තුරු අනුභව කර, නිදාගැනීමේ සැපය, ඇලී සිටීමේ සැපය, නිද්‍රාශීලී සැපයෙහි යෙදී වාසය කරනු දකිමි.\"\n\nනාගිත, මට මෙසේ සිතේ: ‘මේ ආයුෂ්මත් භික්ෂූහු නෛෂ්ක්‍රම්‍ය සුඛය, ප්‍රවිවේක සුඛය, උපශම සුඛය, සම්බෝධි සුඛය යන මේ සුඛයන් කැමති පරිදි, අසීරු නැතිව, දුෂ්කර නැතිව ලබන්නෝ නොවෙති. යම් මම නෛෂ්ක්‍රම්‍ය සුඛය, ප්‍රවිවේක සුඛය, උපශම සුඛය, සම්බෝධි සුඛය යන මේ සුඛයන් කැමති පරිදි, අසීරු නැතිව, දුෂ්කර නැතිව ලබන්නා වෙමි. එසේ වුව ද, මේ ආයුෂ්මත් භික්ෂූහු උදරය පුරවාගෙන අනුභව කොට සැතපීමෙහි සැපය, ඇලකම් සැපය, නිද්‍රා සැපය යන මේවාට යෙදී වාසය කරති.’\n\nනාගිත, මෙහි මම ගමක් අසල වාසය කරන, සමාධිමත් ව හිඳ සිටින භික්ෂුවක් දකිමි. නාගිත, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මතුන් වහන්සේට ආරාමිකයෙක් හෝ සාමණේර කෙනෙක් හෝ උපස්ථාන කරනු ඇත. ඔවුන් ඒ භික්ෂුව ඒ සමාධියෙන් චලනය කරනු ඇතැ’යි. එබැවින්, නාගිත, මම ඒ භික්ෂුවගේ ගමක් අසල වාසය කිරීම ගැන සතුටු නොවෙමි.\n\nනාගිත, මෙහි මම වනගත භික්ෂුවක් වනයෙහි නිදිමතින් කැලඹෙමින් හිඳ සිටිනවා දකිමි. නාගිත, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මත් භික්ෂුව මේ නිදිමත වෙහෙස දුරු කොට වනය පිළිබඳ සඤ්ඤාවම එකඟ කොට මෙනෙහි කරනු ඇතැ’යි. එබැවින්, නාගිත, මම ඒ භික්ෂුවගේ වනවාසය ගැන සතුටු වෙමි.\n\nනාගිත, මෙහි මම වනගත භික්ෂුවක් වනයෙහි සමාධි රහිත ව හිඳ සිටිනවා දකිමි. නාගිත, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මත් භික්ෂුව අසමාහිත වූ සිත සමාධිමත් කරනු ඇත, නැතහොත් සමාධිමත් වූ සිත ආරක්ෂා කරනු ඇතැ’යි. එබැවින්, නාගිත, මම ඒ භික්ෂුවගේ වනවාසය ගැන සතුටු වෙමි.\n\nනාගිත, මෙහි මම වනගත භික්ෂුවක් වනයෙහි සමාධිමත් ව හිඳ සිටිනවා දකිමි. නාගිත, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මත් භික්ෂුව නොමුදවා ගත් සිත මුදවා ගනු ඇත, නැතහොත් මුදවා ගත් සිත ආරක්ෂා කරනු ඇතැ’යි. එබැවින්, නාගිත, මම ඒ භික්ෂුවගේ වනවාසය ගැන සතුටු වෙමි.\n\nනාගිත, මෙහි මම ගමක් අසල වාසය කරන, සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර ලබන භික්ෂුවක් දකිමි. ඔහු ඒ ලාභ සත්කාර කීර්ති ප්‍රශංසා කැමති වෙමින් ප්‍රවිවේකය ද අත්හරියි, ප්‍රත්‍යන්ත සේනාසන වූ අරණ්‍ය වනාන්තර ද අත්හරියි; ගම්, නියම්ගම්, රාජධානිවලට බැස වාසය කරයි. එබැවින්, නාගිත, මම ඒ භික්ෂුවගේ ගමක් අසල වාසය කිරීම ගැන සතුටු නොවෙමි.\n\nනාගිත, මෙහි මම වනගත භික්ෂුවක් වන, සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර ලබන භික්ෂුවක් දකිමි. ඔහු ඒ ලාභ සත්කාර කීර්ති ප්‍රශංසා බැහැර කොට, ප්‍රවිවේකය ද අත්නොහරියි, ප්‍රත්‍යන්ත සේනාසන වූ අරණ්‍ය වනාන්තර ද අත්නොහරියි. එබැවින්, නාගිත, මම ඒ භික්ෂුවගේ වනවාසය ගැන සතුටු වෙමි.\n\nයම් කලෙක, නාගිත, මම මග ගමන් කරමින් සිටින විට ඉදිරියෙන් හෝ පසුපසින් හෝ කිසිවකු නොදකිමි ද, ඒ කල, නාගිත, මට සැප පහසු වෙයි, අවම වශයෙන් මලමුත්‍ර පහකිරීමට වුව ද.",
      "paliTitle": "Yasasuttaṃ",
      "englishTitle": "The Yasa Sutta",
      "sinhalaTitle": "යස සූත‍්‍රය"
    },
    {
      "number": 87,
      "pali": "[cūḷava. 265] ‘‘Aṭṭhahi, bhikkhave, aṅgehi samannāgatassa upāsakassa ākaṅkhamāno saṅgho pattaṃ nikkujjeyya [nikujjeyya (ka.)]. Katamehi aṭṭhahi? Bhikkhūnaṃ alābhāya parisakkati, bhikkhūnaṃ anatthāya parisakkati, bhikkhūnaṃ avāsāya [anāvāsāya (sī. syā.)] parisakkati, bhikkhū akkosati paribhāsati, bhikkhū bhikkhūhi bhedeti [vibhedeti (bahūsu)], buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati. Imehi kho, bhikkhave, aṭṭhahaṅgehi samannāgatassa upāsakassa ākaṅkhamāno saṅgho pattaṃ nikkujjeyya. ‘‘Aṭṭhahi, bhikkhave, aṅgehi samannāgatassa upāsakassa ākaṅkhamāno saṅgho pattaṃ ukkujjeyya. Katamehi aṭṭhahi? Na bhikkhūnaṃ alābhāya parisakkati, na bhikkhūnaṃ anatthāya parisakkati, na bhikkhūnaṃ avāsāya parisakkati, na bhikkhū akkosati paribhāsati, na bhikkhū bhikkhūhi bhedeti, buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Imehi kho, bhikkhave, aṭṭhahaṅgehi samannāgatassa upāsakassa ākaṅkhamāno saṅgho pattaṃ ukkujjeyyā’’ti. Sattamaṃ.",
      "english": "Bhikkhus, if a lay follower is endowed with eight qualities, the Sangha, if it so wishes, may overturn the alms-bowl for him. Which eight? He strives for the bhikkhus’ loss of gains; he strives for the bhikkhus’ disadvantage; he strives for the bhikkhus’ inability to reside peacefully; he abuses and reviles bhikkhus; he causes division among bhikkhus; he speaks dispraise of the Buddha; he speaks dispraise of the Dhamma; he speaks dispraise of the Sangha. Bhikkhus, if a lay follower is endowed with these eight qualities, the Sangha, if it so wishes, may overturn the alms-bowl for him.\n\nBhikkhus, if a lay follower is endowed with eight qualities, the Sangha, if it so wishes, may turn up the alms-bowl for him. Which eight? He does not strive for the bhikkhus’ loss of gains; he does not strive for the bhikkhus’ disadvantage; he does not strive for the bhikkhus’ inability to reside peacefully; he does not abuse or revile bhikkhus; he does not cause division among bhikkhus; he speaks praise of the Buddha; he speaks praise of the Dhamma; he speaks praise of the Sangha. Bhikkhus, if a lay follower is endowed with these eight qualities, the Sangha, if it so wishes, may turn up the alms-bowl for him.",
      "sinhala": "මහණෙනි, අට අංගයකින් සමන්විත උපාසකයෙකුට, සංඝයා වහන්සේ කැමති නම්, පාත්‍‌රය පෙරළිය හැකියි. ඒ අට කවරේද? භික්ෂූන්ට ලාභ අහිමි කිරීම පිණිස කටයුතු කරයි, භික්ෂූන්ට අහිත පිණිස කටයුතු කරයි, භික්ෂූන්ට වාසස්ථාන අහිමි කිරීම පිණිස කටයුතු කරයි, භික්ෂූන්ට බණියි, පරිභව කරයි, භික්ෂූන් භික්ෂූන්ගෙන් භේද කරයි, බුදුරජාණන් වහන්සේට අවර්ණ කියයි, ධර්‍මයට අවර්ණ කියයි, සංඝයා වහන්සේට අවර්ණ කියයි. මහණෙනි, මේ අට අංගයෙන් සමන්විත උපාසකයෙකුට, සංඝයා වහන්සේ කැමති නම්, පාත්‍‌රය පෙරළිය හැකියි.\n\nමහණෙනි, අට අංගයකින් සමන්විත උපාසකයෙකුට, සංඝයා වහන්සේ කැමති නම්, නැවත පාත්‍‌රය පිළිගත හැකියි. ඒ අට කවරේද? භික්ෂූන්ට ලාභ අහිමි කිරීම පිණිස කටයුතු නොකරයි, භික්ෂූන්ට අහිත පිණිස කටයුතු නොකරයි, භික්ෂූන්ට වාසස්ථාන අහිමි කිරීම පිණිස කටයුතු නොකරයි, භික්ෂූන්ට බණින්නේ හෝ පරිභව කරන්නේ නැත, භික්ෂූන් භික්ෂූන්ගෙන් භේද කරන්නේ නැත, බුදුරජාණන් වහන්සේට වර්ණ කියයි, ධර්‍මයට වර්ණ කියයි, සංඝයා වහන්සේට වර්ණ කියයි. මහණෙනි, මේ අට අංගයෙන් සමන්විත උපාසකයෙකුට, සංඝයා වහන්සේ කැමති නම්, නැවත පාත්‍‌රය පිළිගත හැකියි.",
      "paliTitle": "Pattanikujjanasuttaṃ",
      "englishTitle": "Discourse on Overturning the Bowl",
      "sinhalaTitle": "පාත‍්‍ර නිකුජ්ජන සූත‍්‍රය"
    },
    {
      "number": 88,
      "pali": "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgatassa bhikkhuno ākaṅkhamānā upāsakā appasādaṃ pavedeyyuṃ. Katamehi aṭṭhahi? Gihīnaṃ alābhāya parisakkati, gihīnaṃ anatthāya parisakkati, gihī akkosati paribhāsati, gihī gihīhi bhedeti, buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati, agocare ca naṃ passanti. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgatassa bhikkhuno ākaṅkhamānā upāsakā appasādaṃ pavedeyyuṃ. ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgatassa bhikkhuno ākaṅkhamānā upāsakā pasādaṃ pavedeyyuṃ. Katamehi aṭṭhahi? Na gihīnaṃ alābhāya parisakkati, na gihīnaṃ anatthāya parisakkati, na gihī akkosati paribhāsati, na gihī gihīhi bhedeti, buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati, gocare ca naṃ passanti. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgatassa bhikkhuno ākaṅkhamānā upāsakā pasādaṃ pavedeyyu’’nti. Aṭṭhamaṃ.",
      "english": "“Monks, when a bhikkhu is endowed with eight qualities, lay followers, if they wish, may declare their lack of confidence. What are these eight? He strives for the lay followers' loss; he strives for the lay followers' detriment; he insults and reviles lay followers; he causes division among lay followers; he speaks dispraise of the Buddha; he speaks dispraise of the Dhamma; he speaks dispraise of the Saṅgha; and they see him engaging in improper conduct. Indeed, monks, when a bhikkhu is endowed with these eight qualities, lay followers, if they wish, may declare their lack of confidence.\n\n“Monks, when a bhikkhu is endowed with eight qualities, lay followers, if they wish, may declare their confidence. What are these eight? He does not strive for the lay followers' loss; he does not strive for the lay followers' detriment; he does not insult or revile lay followers; he does not cause division among lay followers; he speaks praise of the Buddha; he speaks praise of the Dhamma; he speaks praise of the Saṅgha; and they see him engaging in proper conduct. Indeed, monks, when a bhikkhu is endowed with these eight qualities, lay followers, if they wish, may declare their confidence.”",
      "sinhala": "භික්ෂූණි, අට_U+200D_ධ_U+200D_ර්මයන්ගෙන් සමන්වාගත වූ භික්ෂුවකට කැමති වන උපාසකවරු අප්‍රසාදය ප්‍රකාශ කරති. කවර අට_U+200D_ධ_U+200D_ර්මයන්ගෙන්ද? ගිහියන්ට අලාභය පිණිස වෙර දරයි. ගිහියන්ට අන_U+200D_ර්ථය පිණිස වෙර දරයි. ගිහියන්ට බණියි, නින්දා කරයි. ගිහියන් ගිහියන් හා බිඳවයි. බුදුරදුන්ගේ අවර්ණ_U+200D_ය කියයි. ධර්මයේ අවර්ණ_U+200D_ය කියයි. සංඝයාගේ අවර්ණ_U+200D_ය කියයි. අගෝචර ස්ථානයන්හිදී ඔහුව ද දකිති. භික්ෂූණි, මේ අට_U+200D_ධ_U+200D_ර්මයන්ගෙන් යුක්ත වූ භික්ෂුවකට කැමති වන උපාසකවරු අප්‍රසාදය ප්‍රකාශ කරති.\n\nභික්ෂූණි, අට_U+200D_ධ_U+200D_ර්මයන්ගෙන් සමන්වාගත වූ භික්ෂුවකට කැමති වන උපාසකවරු ප්‍රසාදය ප්‍රකාශ කරති. කවර අට_U+200D_ධ_U+200D_ර්මයන්ගෙන්ද? ගිහියන්ට අලාභය පිණිස වෙර නොදරයි. ගිහියන්ට අන_U+200D_ර්ථය පිණිස වෙර නොදරයි. ගිහියන්ට බණින්නේ හෝ නින්දා කරන්නේ හෝ නැත. ගිහියන් ගිහියන් හා බිඳවන්නේ නැත. බුදුරදුන්ගේ වර්ණ_U+200D_ය කියයි. ධර්මයේ වර්ණ_U+200D_ය කියයි. සංඝයාගේ වර්ණ_U+200D_ය කියයි. ගෝචර ස්ථානයන්හිදී ඔහුව ද දකිති. භික්ෂූණි, මේ අට_U+200D_ධ_U+200D_ර්මයන්ගෙන් යුක්ත වූ භික්ෂුවකට කැමති වන උපාසකවරු ප්‍රසාදය ප්‍රකාශ කරති.",
      "paliTitle": "Appasādapavedanīyasuttaṃ",
      "englishTitle": "Discourse on Declaring Lack of Faith",
      "sinhalaTitle": "අප්‍රසාද ප්‍රකාශන සූත්‍රය"
    },
    {
      "number": 89,
      "pali": "[cūḷava. 39 thokaṃ visadisaṃ] ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho paṭisāraṇīyakammaṃ kareyya. Katamehi aṭṭhahi? Gihīnaṃ alābhāya parisakkati, gihīnaṃ anatthāya parisakkati, gihī akkosati paribhāsati, gihī gihīhi bhedeti, buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati, dhammikañca gihipaṭissavaṃ na saccāpeti. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho paṭisāraṇīyaṃ kammaṃ kareyya. ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho paṭisāraṇīyakammaṃ paṭippassambheyya. Katamehi aṭṭhahi? Na gihīnaṃ alābhāya parisakkati, na gihīnaṃ anatthāya parisakkati, na gihī akkosati paribhāsati, na gihī gihīhi bhedeti, buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati, dhammikañca gihipaṭissavaṃ saccāpeti. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho paṭisāraṇīyakammaṃ paṭippassambheyyā’’ti. Navamaṃ.",
      "english": "Monks, if a monk is endowed with eight qualities, the Saṅgha, if it wishes, may carry out the act of reconciliation against him. Which eight? He strives for the loss of gain for laypeople; he strives for the disadvantage of laypeople; he abuses and reviles laypeople; he causes division among laypeople with other laypeople; he speaks dispraise of the Buddha; he speaks dispraise of the Dhamma; he speaks dispraise of the Saṅgha; and he does not fulfill a righteous promise made to laypeople. Monks, if a monk is endowed with these eight qualities, the Saṅgha, if it wishes, may carry out the act of reconciliation against him.\n\nMonks, if a monk is endowed with eight qualities, the Saṅgha, if it wishes, may rescind the act of reconciliation against him. Which eight? He does not strive for the loss of gain for laypeople; he does not strive for the disadvantage of laypeople; he does not abuse or revile laypeople; he does not cause division among laypeople with other laypeople; he speaks praise of the Buddha; he speaks praise of the Dhamma; he speaks praise of the Saṅgha; and he fulfills a righteous promise made to laypeople. Monks, if a monk is endowed with these eight qualities, the Saṅgha, if it wishes, may rescind the act of reconciliation against him.",
      "sinhala": "භික්ෂූනි, අට ධර්මයකින් සමන්විත වූ භික්ෂුවකට සංඝයා වහන්සේලා කැමති නම් ප්‍රතිසාරණීය කර්මය කළ හැකිය. කිනම් අටකින් ද?\n\nගිහියන්ගේ අලාභය පිණිස වෙර දරයි. ගිහියන්ගේ අනර්ථය පිණිස වෙර දරයි. ගිහියන්ට බැණ වදින්නේය, පරිභව කරන්නේය. ගිහියන් ගිහියන් සමග භේද භින්න කරන්නේය. බුදුරජාණන් වහන්සේගේ අවර්ණ කියන්නේය. ධර්මයෙහි අවර්ණ කියන්නේය. සංඝයා වහන්සේලාගේ අවර්ණ කියන්නේය. ධාර්මික වූ ගිහි පොරොන්දුවක් ඉටු නොකරන්නේය. භික්ෂූනි, මේ අට ධර්මයකින් සමන්විත වූ භික්ෂුවකට සංඝයා වහන්සේලා කැමති නම් ප්‍රතිසාරණීය කර්මය කළ හැකිය.\n\nභික්ෂූනි, අට ධර්මයකින් සමන්විත වූ භික්ෂුවකට සංඝයා වහන්සේලා කැමති නම් ප්‍රතිසාරණීය කර්මය අවලංගු කළ හැකිය. කිනම් අටකින් ද?\n\nගිහියන්ගේ අලාභය පිණිස වෙර නොදරයි. ගිහියන්ගේ අනර්ථය පිණිස වෙර නොදරයි. ගිහියන්ට බැණ නොවදින්නේය, පරිභව නොකරන්නේය. ගිහියන් ගිහියන් සමග භේද භින්න නොකරන්නේය. බුදුරජාණන් වහන්සේගේ වර්ණ කියන්නේය. ධර්මයෙහි වර්ණ කියන්නේය. සංඝයා වහන්සේලාගේ වර්ණ කියන්නේය. ධාර්මික වූ ගිහි පොරොන්දුවක් ඉටු කරන්නේය. භික්ෂූනි, මේ අට ධර්මයකින් සමන්විත වූ භික්ෂුවකට සංඝයා වහන්සේලා කැමති නම් ප්‍රතිසාරණීය කර්මය අවලංගු කළ හැකිය.",
      "paliTitle": "Paṭisāraṇīyasuttaṃ",
      "englishTitle": "The Reconciliation Sutta",
      "sinhalaTitle": "පටිසාරණීය සූත්‍රය"
    },
    {
      "number": 90,
      "pali": "[cūḷava. 211] ‘‘Tassapāpiyasikakammakatena, bhikkhave, bhikkhunā aṭṭhasu dhammesu sammā vattitabbaṃ – na upasampādetabbo, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo, na bhikkhunovādakasammuti sāditabbā, sammatenapi bhikkhuniyo na ovaditabbā, na kāci saṅghasammuti sāditabbā, na kismiñci paccekaṭṭhāne ṭhapetabbo, na ca tena mūlena vuṭṭhāpetabbo. Tassapāpiyasikakammakatena, bhikkhave, bhikkhunā imesu aṭṭhasu dhammesu sammā vattitabba’’nti. Dasamaṃ. ",
      "english": "Monks, a monk who has been subjected to the act of formal degradation due to unrighteousness must conduct himself properly in eight matters: He should not confer higher ordination; he should not grant dependence; he should not attend to a novice; he should not accept an appointment as an instructor of nuns; even if appointed, he should not instruct nuns; he should not accept any Sangha appointment; he should not be appointed to any individual office; nor should he be reinstated on that account. Monks, a monk who has been subjected to the act of formal degradation due to unrighteousness must conduct himself properly in these eight matters.",
      "sinhala": "භික්ෂූණි, යම් භික්ෂුවක් සම්බන්ධයෙන් 'තස්සපාපියසිකා කම්ම' නමැති කර්මය සිදු කර ඇත්නම්, ඔහු කරුණු අටක් සම්බන්ධයෙන් නිවැරදිව පැවැතිය යුතුය. එනම්: උපසම්පදාව නොදිය යුතුය, නිස්සය නොදිය යුතුය, සාමණේරයන්ට උපස්ථාන නොකළ යුතුය, භික්ෂුණෝවාදක සම්මුතිය භාර නොගත යුතුය, සම්මත කරනු ලැබ සිටියත් භික්ෂුණීන්ට අවවාද නොකළ යුතුය, කිසිදු සංඝ සම්මුතියක් භාර නොගත යුතුය, කිසිදු පෞද්ගලික තනතුරක නොතැබිය යුතුය, තවද, එම මූලික හේතුව නිවැරදි නොකර, ඔහු නැවත ප්\\u200Dර\\u200Dතිස්ථාපනය නොකළ යුතුය. භික්ෂූණි, යම් භික්ෂුවක් සම්බන්ධයෙන් 'තස්සපාපියසිකා කම්ම' නමැති කර්මය සිදු කර ඇත්නම්, ඔහු මේ කරුණු අට සම්බන්ධයෙන් නිවැරදිව පැවැතිය යුතුය.",
      "paliTitle": "Sammāvattanasuttaṃ",
      "englishTitle": "Discourse on Right Conduct",
      "sinhalaTitle": "සම්මා‌වත්තන සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sativaggo catuttho.",
    "english": "The Fourth Chapter on Mindfulness",
    "sinhala": "සිවුවන සති වග්ගය"
  }
}