{
  "id": "an8.4",
  "title": {
    "pali": "Dānavaggo",
    "english": "The Chapter on Giving",
    "sinhala": "දාන වග්ගය"
  },
  "sections": [
    {
      "number": 31,
      "pali": "[dī. ni. 3.336] ‘‘Aṭṭhimāni, bhikkhave, dānāni. Katamāni aṭṭha? Āsajja dānaṃ deti, bhayā dānaṃ deti, ‘adāsi me’ti dānaṃ deti, ‘dassati me’ti dānaṃ deti, ‘sāhu dāna’nti dānaṃ deti, ‘ahaṃ pacāmi, ime na pacanti; nārahāmi pacanto apacantānaṃ dānaṃ adātu’nti dānaṃ deti, ‘imaṃ me dānaṃ dadato kalyāṇo kittisaddo abbhuggacchatī’ti dānaṃ deti, cittālaṅkāracittaparikkhāratthaṃ dānaṃ deti. Imāni kho, bhikkhave, aṭṭha dānānī’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these eight kinds of giving. Which eight?\nOne gives contemptuously. One gives out of fear. One gives thinking, ‘They gave to me.’ One gives thinking, ‘They will give to me.’ One gives thinking, ‘Giving is good.’ One gives thinking, ‘I cook, they do not. It is not right for me, who cooks, not to give to those who do not cook.’ One gives thinking, ‘By my giving this gift, a good reputation will arise for me.’ One gives for the adornment and equipment of the mind.\nMonks, these indeed are the eight kinds of giving.",
      "sinhala": "මහණෙනි, මේ දන් අටකි. කවරේද ඒ අට? තරවටු කර දන් දෙයි, බියෙන් දන් දෙයි, ‘මට දුන්නේය’ යි දන් දෙයි, ‘මට දෙනු ඇත’ යි දන් දෙයි, ‘දානය හොඳය’ යි දන් දෙයි, ‘මම පිස කමි, මොවුහු නොපිස කති; පිස කන්නකු වූ මට නොපිස කන්නන්ට දන් නොදීම නුසුදුසුය’ යි දන් දෙයි, ‘මා විසින් දෙනු ලබන මේ දානය නිසා යහපත් කීර්ති ඝෝෂාවක් නැඟේවා’ යි දන් දෙයි, චිත්තාලංකාරය පිණිසත්, චිත්ත පරිෂ්කාරය පිණිසත් දන් දෙයි. මහණෙනි, සැබවින්ම මේවා ඒ අට දානයෝය.",
      "paliTitle": "Paṭhamadānasuttaṃ",
      "englishTitle": "The First Discourse on Giving",
      "sinhalaTitle": "ප්‍රථම දාන සූත්‍රය"
    },
    {
      "number": 32,
      "pali": "[kathā. 480] ‘‘Saddhā hiriyaṃ kusalañca dānaṃ, Dhammā ete sappurisānuyātā; Etañhi maggaṃ diviyaṃ vadanti, Etena hi gacchati devaloka’’nti. dutiyaṃ;",
      "english": "Faith, moral shame, and wholesome giving—these are the qualities practiced by good people. Indeed, they call this the divine path. Indeed, by this one goes to the heavenly realm.",
      "sinhala": "ශ්‍රද්ධාව, හිරි, කුසල් සහ දානය යන මේ ධර්ම සත්පුරුෂයන් විසින් අනුගමනය කරනු ලබයි. මෙයම දිව්‍යමය මාර්ගය යැයි කියනු ලැබේ. මේ මාර්ගයෙන්ම දෙව්ලොවට යයි.",
      "paliTitle": "Dutiyadānasuttaṃ",
      "englishTitle": "Second Discourse on Giving",
      "sinhalaTitle": "දෙවන දාන සූත්‍රය"
    },
    {
      "number": 33,
      "pali": "‘‘Aṭṭhimāni, bhikkhave, dānavatthūni. Katamāni aṭṭha? Chandā dānaṃ deti, dosā dānaṃ deti, mohā dānaṃ deti, bhayā dānaṃ deti, ‘dinnapubbaṃ katapubbaṃ pitupitāmahehi, nārahāmi porāṇaṃ kulavaṃsaṃ hāpetu’nti dānaṃ deti, ‘imāhaṃ dānaṃ datvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti dānaṃ deti, ‘imaṃ me dānaṃ dadato cittaṃ pasīdati, attamanatā somanassaṃ upajāyatī’ti dānaṃ deti, cittālaṅkāracittaparikkhāratthaṃ dānaṃ deti. Imāni kho, bhikkhave, aṭṭha dānavatthūnī’’ti. Tatiyaṃ.",
      "english": "Monks, these are the eight reasons for giving. Which eight?\n\nOne gives a gift out of desire, one gives a gift out of aversion, one gives a gift out of delusion, one gives a gift out of fear. One gives a gift, thinking: 'This was given before, performed before by my fathers and grandfathers; I ought not to abandon the ancient family tradition.' One gives a gift, thinking: 'Having given this gift, with the breaking up of the body, after death, I shall reappear in a happy destination, in a heavenly world.' One gives a gift, thinking: 'As I give this gift, my mind becomes serene; satisfaction and joy arise.' One gives a gift for the adornment of the mind, as a requisite for the mind's development.\n\nMonks, these are indeed the eight reasons for giving.",
      "sinhala": "මහණෙනි, දන් දීමට හේතු අටක් ඇත. ඒ අට කවරේද? ඡන්දයෙන් දන් දෙයි, ද්වේෂයෙන් දන් දෙයි, මෝහයෙන් දන් දෙයි, භයෙන් දන් දෙයි, 'දෙමව්පියන් සහ මුතුන් මිත්තන් විසින් පෙර දන් දීම සිදුකර ඇත, පෙර සිට පැවත එන කුල සිරිත නැති කිරීමට මට සුදුසු නැත' යි දන් දෙයි, 'මා මේ දානය දී, කය බිඳී මරණින් මතු සුගති ස්වර්ග ලෝකයට උපදින්නෙමි' යි දන් දෙයි, 'මා මේ දානය දෙන විට මගේ සිත පැහැදේ, ආත්ම තෘප්තියක් සහ සොම්නසක් ඇති වේ' යි දන් දෙයි, සිත අලංකාර කිරීම පිණිස, සිත පරිෂ්කාර කිරීම පිණිස දන් දෙයි. මහණෙනි, දන් දීමට හේතු වන කරුණු අට මේවාය.",
      "paliTitle": "Dānavatthusuttaṃ",
      "englishTitle": "Discourse on the Story of Giving",
      "sinhalaTitle": "දාන වස්තුව සූත්‍රය"
    },
    {
      "number": 34,
      "pali": "‘‘Aṭṭhaṅgasamannāgate, bhikkhave, khette bījaṃ vuttaṃ na mahapphalaṃ hoti na mahassādaṃ na phātiseyyaṃ [na phātiseyyanti (sī. syā. ka.), na phātiseyyā (katthaci)]. Kathaṃ aṭṭhaṅgasamannāgate? Idha, bhikkhave, khettaṃ unnāmaninnāmi ca hoti, pāsāṇasakkharikañca hoti, ūsarañca hoti, na ca gambhīrasitaṃ hoti, na āyasampannaṃ hoti, na apāyasampannaṃ hoti, na mātikāsampannaṃ hoti, na mariyādasampannaṃ hoti. Evaṃ aṭṭhaṅgasamannāgate, bhikkhave, khette bījaṃ vuttaṃ na mahapphalaṃ hoti na mahassādaṃ na phātiseyyaṃ. ‘‘Evamevaṃ kho, bhikkhave, aṭṭhaṅgasamannāgatesu samaṇabrāhmaṇesu dānaṃ dinnaṃ na mahapphalaṃ hoti na mahānisaṃsaṃ na mahājutikaṃ na mahāvipphāraṃ. Kathaṃ aṭṭhaṅgasamannāgatesu? Idha, bhikkhave, samaṇabrāhmaṇā micchādiṭṭhikā honti, micchāsaṅkappā, micchāvācā, micchākammantā, micchāājīvā, micchāvāyāmā, micchāsatino, micchāsamādhino. Evaṃ aṭṭhaṅgasamannāgatesu, bhikkhave, samaṇabrāhmaṇesu dānaṃ dinnaṃ na mahapphalaṃ hoti na mahānisaṃsaṃ na mahājutikaṃ na mahāvipphāraṃ. ‘‘Aṭṭhaṅgasamannāgate, bhikkhave, khette bījaṃ vuttaṃ mahapphalaṃ hoti mahassādaṃ phātiseyyaṃ. Kathaṃ aṭṭhaṅgasamannāgate? Idha, bhikkhave, khettaṃ anunnāmāninnāmi ca hoti, apāsāṇasakkharikañca hoti, anūsarañca hoti, gambhīrasitaṃ hoti, āyasampannaṃ hoti, apāyasampannaṃ hoti, mātikāsampannaṃ hoti, mariyādasampannaṃ hoti. Evaṃ aṭṭhaṅgasamannāgate, bhikkhave, khette bījaṃ vuttaṃ mahapphalaṃ hoti mahassādaṃ phātiseyyaṃ. ‘‘Evamevaṃ kho, bhikkhave, aṭṭhaṅgasamannāgatesu samaṇabrāhmaṇesu dānaṃ dinnaṃ mahapphalaṃ hoti mahānisaṃsaṃ mahājutikaṃ mahāvipphāraṃ. Kathaṃ aṭṭhaṅgasamannāgatesu? Idha, bhikkhave, samaṇabrāhmaṇā sammādiṭṭhikā honti, sammāsaṅkappā, sammāvācā, sammākammantā, sammāājīvā, sammāvāyāmā, sammāsatino, sammāsamādhino. Evaṃ aṭṭhaṅgasamannāgatesu, bhikkhave, samaṇabrāhmaṇesu dānaṃ dinnaṃ mahapphalaṃ hoti mahānisaṃsaṃ mahājutikaṃ mahāvipphāra’’nti. ‘‘Yathāpi khette sampanne, pavuttā bījasampadā; Deve sampādayantamhi [sañjāyantamhi (ka.)], hoti dhaññassa sampadā. ‘‘Anītisampadā hoti, virūḷhī bhavati sampadā; Vepullasampadā hoti, phalaṃ ve hoti sampadā. ‘‘Evaṃ sampannasīlesu, dinnā bhojanasampadā; Sampadānaṃ upaneti, sampannaṃ hissa taṃ kataṃ. ‘‘Tasmā sampadamākaṅkhī, sampannatthūdha puggalo; Sampannapaññe sevetha, evaṃ ijjhanti sampadā. ‘‘Vijjācaraṇasampanne, laddhā cittassa sampadaṃ; Karoti kammasampadaṃ, labhati catthasampadaṃ. ‘‘Lokaṃ ñatvā yathābhūtaṃ, pappuyya diṭṭhisampadaṃ; Maggasampadamāgamma, yāti sampannamānaso. ‘‘Odhunitvā malaṃ sabbaṃ, patvā nibbānasampadaṃ; Muccati sabbadukkhehi, sā hoti sabbasampadā’’ti. catutthaṃ;",
      "english": "Monks, when a seed is sown in a field possessing eight characteristics, it does not yield great fruit, nor great flavor, nor great productivity. How is it possessing eight characteristics? Here, monks, the field is uneven with high and low ground, it is stony and gravelly, it is saline and barren, it is not deeply irrigated, it is not well-supplied with water inlets, it is not well-supplied with water outlets, it is not well-supplied with main water channels, and it is not well-supplied with proper boundaries. Thus, monks, when a seed is sown in a field possessing these eight characteristics, it does not yield great fruit, nor great flavor, nor great productivity.\n\nIn the same way, monks, when a gift is given among ascetics and brahmins possessing eight characteristics, it does not yield great fruit, nor great benefit, nor great radiance, nor great pervasiveness. How are they possessing eight characteristics? Here, monks, those ascetics and brahmins are of wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong concentration. Thus, monks, when a gift is given among ascetics and brahmins possessing these eight characteristics, it does not yield great fruit, nor great benefit, nor great radiance, nor great pervasiveness.\n\nMonks, when a seed is sown in a field possessing eight characteristics, it yields great fruit, great flavor, and great productivity. How is it possessing eight characteristics? Here, monks, the field is not uneven with high and low ground, it is not stony and gravelly, it is not saline and barren, it is deeply irrigated, it is well-supplied with water inlets, it is well-supplied with water outlets, it is well-supplied with main water channels, and it is well-supplied with proper boundaries. Thus, monks, when a seed is sown in a field possessing these eight characteristics, it yields great fruit, great flavor, and great productivity.\n\nIn the same way, monks, when a gift is given among ascetics and brahmins possessing eight characteristics, it yields great fruit, great benefit, great radiance, and great pervasiveness. How are they possessing eight characteristics? Here, monks, those ascetics and brahmins are of right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. Thus, monks, when a gift is given among ascetics and brahmins possessing these eight characteristics, it yields great fruit, great benefit, great radiance, and great pervasiveness.\n\nJust as when an excellent field receives excellent seeds, when the celestial one causes it to prosper, there is an abundance of grain.\n\nThere is accomplishment in freedom from calamities, there is accomplishment in growth, there is accomplishment in fullness, and truly, there is accomplishment in fruit.\n\nIn the same way, among those accomplished in virtue, an excellent offering of food given brings about accomplishments; truly, that is made to be excellent.\n\nTherefore, a person in this world desiring accomplishment, seeking excellent aims, should associate with those accomplished in wisdom. Thus, accomplishments are achieved.\n\nHaving associated with those accomplished in knowledge and conduct, and gaining accomplishment of mind, one brings about accomplishment in action and obtains accomplishment of purpose.\n\nKnowing the world as it truly is, attaining accomplishment of view, and approaching the accomplishment of the path, one goes with an accomplished mind.\n\nHaving shaken off all defilements and reached the accomplishment of Nibbana, one is liberated from all suffering. That is the ultimate accomplishment.",
      "sinhala": "භික්ෂූණි, අට අංගයන්ගෙන් යුක්ත වූ කෙතක වපුරන ලද බීජය මහත් ඵල දරන්නේ නැත, මහත් රසවත් වන්නේ නැත, සශ්‍රීක වන්නේද නැත. කෙසේ නම් අට අංගයන්ගෙන් යුක්ත වේද? භික්ෂූණි, මෙහි කෙත උස් පහත් ස්ථානවලින් යුක්ත වේ, ගල් හා වැලි කැට වලින් යුක්ත වේ, ඌෂර (වඳ) වේ, ගැඹුරට ජලය නොමැත, ජලය ඇතුල් වීමට පහසු නොවේ, ජලය පිට කිරීමට පහසු නොවේ, පෝෂක පසෙන් යුක්ත නොවේ, මායිම් (බැමි/වැටකඩොලු) වලින් යුක්ත නොවේ. භික්ෂූණි, මෙසේ අට අංගයන්ගෙන් යුක්ත වූ කෙතක වපුරන ලද බීජය මහත් ඵල දරන්නේ නැත, මහත් රසවත් වන්නේ නැත, සශ්‍රීක වන්නේද නැත.\n\nභික්ෂූණි, එලෙසම අට අංගයන්ගෙන් යුක්ත වූ ශ්‍රමණයන් හා බ්‍රාහ්මණයන් කෙරෙහි දෙන ලද දානය මහත් ඵලදායක වන්නේ නැත, මහත් ආනිශංස සහිත වන්නේ නැත, මහත් දීප්තිමත් වන්නේ නැත, මහත් විහිදීමක් (මහත් ප්‍රභාවක්) ඇත්තේ නැත. කෙසේ නම් අට අංගයන්ගෙන් යුක්ත වේද? භික්ෂූණි, මෙහි ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ මිථ්‍යාදෘෂ්ටික වෙති (වැරදි දැකීම් ඇත්තෝ වෙති), මිථ්‍යාසංකප්ප ඇත්තෝ වෙති (වැරදි කල්පනා ඇත්තෝ වෙති), මිථ්‍යාවාචා ඇත්තෝ වෙති (වැරදි වචන ඇත්තෝ වෙති), මිථ්‍යාකම්මන්ත ඇත්තෝ වෙති (වැරදි ක්‍රියාවන් ඇත්තෝ වෙති), මිථ්‍යාආජීව ඇත්තෝ වෙති (වැරදි ජීවනෝපාය ඇත්තෝ වෙති), මිථ්‍යාවායාම ඇත්තෝ වෙති (වැරදි වෑයම් ඇත්තෝ වෙති), මිථ්‍යාසති ඇත්තෝ වෙති (වැරදි සිහි ඇත්තෝ වෙති), මිථ්‍යාසමාධි ඇත්තෝ වෙති (වැරදි සමාධි ඇත්තෝ වෙති). භික්ෂූණි, මෙසේ අට අංගයන්ගෙන් යුක්ත වූ ශ්‍රමණයන් හා බ්‍රාහ්මණයන් කෙරෙහි දෙන ලද දානය මහත් ඵලදායක වන්නේ නැත, මහත් ආනිශංස සහිත වන්නේ නැත, මහත් දීප්තිමත් වන්නේ නැත, මහත් විහිදීමක් ඇත්තේ නැත.\n\nභික්ෂූණි, අට අංගයන්ගෙන් යුක්ත වූ කෙතක වපුරන ලද බීජය මහත් ඵල දරයි, මහත් රසවත් වේ, සශ්‍රීක වේ. කෙසේ නම් අට අංගයන්ගෙන් යුක්ත වේද? භික්ෂූණි, මෙහි කෙත උස් පහත් ස්ථානවලින් යුක්ත නොවේ, ගල් හා වැලි කැට වලින් යුක්ත නොවේ, ඌෂර (වඳ) නොවේ, ගැඹුරට ජලය ඇත, ජලය ඇතුල් වීමට පහසු වේ, ජලය පිට කිරීමට පහසු වේ, පෝෂක පසෙන් යුක්ත වේ, මායිම් (බැමි/වැටකඩොලු) වලින් යුක්ත වේ. භික්ෂූණි, මෙසේ අට අංගයන්ගෙන් යුක්ත වූ කෙතක වපුරන ලද බීජය මහත් ඵල දරයි, මහත් රසවත් වේ, සශ්‍රීක වේ.\n\nභික්ෂූණි, එලෙසම අට අංගයන්ගෙන් යුක්ත වූ ශ්‍රමණයන් හා බ්‍රාහ්මණයන් කෙරෙහි දෙන ලද දානය මහත් ඵලදායක වේ, මහත් ආනිශංස සහිත වේ, මහත් දීප්තිමත් වේ, මහත් විහිදීමක් ඇත්තේ වේ. කෙසේ නම් අට අංගයන්ගෙන් යුක්ත වේද? භික්ෂූණි, මෙහි ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ සම්මාදිට්ඨික වෙති (නිවැරදි දැකීම් ඇත්තෝ වෙති), සම්මාසංකප්ප ඇත්තෝ වෙති (නිවැරදි කල්පනා ඇත්තෝ වෙති), සම්මාවාචා ඇත්තෝ වෙති (නිවැරදි වචන ඇත්තෝ වෙති), සම්මාකම්මන්ත ඇත්තෝ වෙති (නිවැරදි ක්‍රියාවන් ඇත්තෝ වෙති), සම්මාආජීව ඇත්තෝ වෙති (නිවැරදි ජීවනෝපාය ඇත්තෝ වෙති), සම්මාවායාම ඇත්තෝ වෙති (නිවැරදි වෑයම් ඇත්තෝ වෙති), සම්මාසති ඇත්තෝ වෙති (නිවැරදි සිහි ඇත්තෝ වෙති), සම්මාසමාධි ඇත්තෝ වෙති (නිවැරදි සමාධි ඇත්තෝ වෙති). භික්ෂූණි, මෙසේ අට අංගයන්ගෙන් යුක්ත වූ ශ්‍රමණයන් හා බ්‍රාහ්මණයන් කෙරෙහි දෙන ලද දානය මහත් ඵලදායක වේ, මහත් ආනිශංස සහිත වේ, මහත් දීප්තිමත් වේ, මහත් විහිදීමක් ඇත්තේ වේ.\n\nයම් සේ සශ්‍රීක කෙතක, මනා කොට වපුරන ලද බීජ සම්පත්තිය, දෙවියන් (වැස්ස) මනාව ලබා දෙන විට, ධාන්‍ය සම්පත්තිය (අස්වැන්න) ඇති වේ.\n\nඑහි කිසිදු උපද්‍රවයක් (හානියක්) නැති සම්පත්තියක් (ලබාගැනීමක්) වේ, වර්ධන සම්පත්තියක් වේ; විපුල සම්පත්තිය (ප්‍රමාණයෙන් විශාල බව) වේ, නියත වශයෙන්ම ඵල සම්පත්තිය වේ.\n\nඑලෙසම, සපිරි සිල් ඇත්තන් කෙරෙහි, පූජා කරන ලද භෝජන සම්පත්තිය, ඒ දානය සම්පත්තීන් කරා පමුණුවයි, මන්ද එය සැබවින්ම සපල වූවකි.\n\nඑබැවින්, සම්පත්තිය අපේක්ෂා කරන, මෙලොවෙහි පරමාර්ථය පතන පුද්ගලයා, සම්පූර්ණ ප්‍රඥාවෙන් යුක්ත අය සේවනය කළ යුතුය, මෙසේ සම්පත්තියෝ ඉටු වෙති.\n\nවිද්‍යාචරණ සම්පන්න වූවකුට (නුවණ හා හැසිරීමෙන් යුක්ත වූවකුට), සිතේ සම්පත්තිය (සිතේ පිරිසිදු බව) ලැබූ විට, කර්ම සම්පත්තිය ඇති කර ගනී, සහ අර්ථ සම්පත්තිය (පරමාර්ථ සම්පත්තිය) ලබයි.\n\nලෝකය යථාභූතව (ඇති සැටියෙන්) දැන, දෘෂ්ටි සම්පත්තිය (නිවැරදි දැක්ම) ලබා, මාර්ග සම්පත්තියට (ආර්ය අෂ්ටාංගික මාර්ගයට) පැමිණ, සම්පූර්ණ සිතින් යුක්තව (ක්ලේශයන්ගෙන් පිරිසිදු වූ සිතින්) ගමන් කරයි.\n\nසියලු කෙලෙස් දුරු කොට, නිර්වාණ සම්පත්තිය (නිවන් සුවය) ලබා, සියලු දුක් වලින් මිදෙයි, එයම සියලු සම්පත්තියන්ගෙන් උතුම් වූ සම්පත්තිය වේ.",
      "paliTitle": "Khettasuttaṃ",
      "englishTitle": "The Field Discourse",
      "sinhalaTitle": "ක‍්ෂේත‍්‍ර සූත‍්‍රය"
    },
    {
      "number": 35,
      "pali": "[dī. ni. 3.337] ‘‘Aṭṭhimā, bhikkhave, dānūpapattiyo. Katamā aṭṭha? Idha, bhikkhave, ekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati [paccāsiṃsati (sī. syā. kaṃ. pī.)]. So passati khattiyamahāsāle vā brāhmaṇamahāsāle vā gahapatimahāsāle vā pañcahi kāmaguṇehi samappite samaṅgībhūte paricārayamāne. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā sahabyataṃ upapajjeyya’nti! So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti. Tassa taṃ cittaṃ hīne vimuttaṃ [hīnedhimuttaṃ (syā. pī.) vimuttanti adhimuttaṃ, vimuttanti vā vissaṭṭhaṃ (ṭīkāsaṃvaṇṇanā)], uttari abhāvitaṃ, tatrūpapattiyā saṃvattati. Kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā sahabyataṃ upapajjati. Tañca kho sīlavato vadāmi, no dussīlassa. Ijjhati, bhikkhave, sīlavato cetopaṇidhi visuddhattā. ‘‘Idha pana, bhikkhave, ekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati. Tassa sutaṃ hoti – ‘cātumahārājikā [cātummahārājikā (sī. syā. kaṃ. pī.)] devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti. Tassa taṃ cittaṃ hīne vimuttaṃ, uttari abhāvitaṃ, tatrūpapattiyā saṃvattati. Kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjati. Tañca kho sīlavato vadāmi, no dussīlassa. Ijjhati, bhikkhave, sīlavato cetopaṇidhi visuddhattā. ‘‘Idha pana, bhikkhave, ekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati. Tassa sutaṃ hoti – tāvatiṃsā devā…pe… yāmā devā… tusitā devā… nimmānaratī devā… paranimmitavasavattī devā dīghāyukā vaṇṇavanto sukhabahulāti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti. Tassa taṃ cittaṃ hīne vimuttaṃ, uttari abhāvitaṃ, tatrūpapattiyā saṃvattati. Kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjati. Tañca kho sīlavato vadāmi, no dussīlassa. Ijjhati, bhikkhave, sīlavato cetopaṇidhi visuddhattā. ‘‘Idha pana, bhikkhave, ekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati. Tassa sutaṃ hoti – ‘brahmakāyikā devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti. Tassa taṃ cittaṃ hīne vimuttaṃ, uttari abhāvitaṃ, tatrūpapattiyā saṃvattati. Kāyassa bhedā paraṃ maraṇā brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Tañca kho sīlavato vadāmi, no dussīlassa; vītarāgassa, no sarāgassa. Ijjhati, bhikkhave, sīlavato cetopaṇidhi vītarāgattā. Imā kho, bhikkhave, aṭṭha dānūpapattiyo’’ti. Pañcamaṃ.",
      "english": "Monks, there are these eight ways of giving that lead to rebirth. Which eight?\n\nHere, monks, a certain person gives a gift to an ascetic or a brahmin: food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, dwellings, and lamps. What he gives, he does so with the expectation of a return. He sees great noble families, or great brahmin families, or great householder families, fully equipped with and enjoying the five objects of sensual pleasure. He thinks: ‘Oh, if only after the dissolution of the body, after death, I might be reborn into companionship with great noble families, or great brahmin families, or great householder families!’ He fixes his mind on that aspiration, he resolves his mind on that, he develops his mind on that. His mind, being elevated above inferior states, yet not developed further for ultimate liberation, leads to rebirth in that destination. After the dissolution of the body, after death, he is reborn into companionship with great noble families, or great brahmin families, or great householder families. And this I declare, monks, for one who is virtuous, not for one who is unvirtuous. Monks, the aspiration of a virtuous person succeeds because of its purity.\n\nHere again, monks, a certain person gives a gift to an ascetic or a brahmin: food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, dwellings, and lamps. What he gives, he does so with the expectation of a return. He has heard: ‘The Devas of the Four Great Kings are long-lived, beautiful, and abundant in happiness.’ He thinks: ‘Oh, if only after the dissolution of the body, after death, I might be reborn into companionship with the Devas of the Four Great Kings!’ He fixes his mind on that aspiration, he resolves his mind on that, he develops his mind on that. His mind, being elevated above inferior states, yet not developed further for ultimate liberation, leads to rebirth in that destination. After the dissolution of the body, after death, he is reborn into companionship with the Devas of the Four Great Kings. And this I declare, monks, for one who is virtuous, not for one who is unvirtuous. Monks, the aspiration of a virtuous person succeeds because of its purity.\n\nHere again, monks, a certain person gives a gift to an ascetic or a brahmin: food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, dwellings, and lamps. What he gives, he does so with the expectation of a return. He has heard: ‘The Tāvatiṃsa Devas, the Yama Devas, the Tusita Devas, the Nimmānaratī Devas, the Paranimmitavasavattī Devas are long-lived, beautiful, and abundant in happiness.’ He thinks: ‘Oh, if only after the dissolution of the body, after death, I might be reborn into companionship with the Paranimmitavasavattī Devas!’ He fixes his mind on that aspiration, he resolves his mind on that, he develops his mind on that. His mind, being elevated above inferior states, yet not developed further for ultimate liberation, leads to rebirth in that destination. After the dissolution of the body, after death, he is reborn into companionship with the Paranimmitavasavattī Devas. And this I declare, monks, for one who is virtuous, not for one who is unvirtuous. Monks, the aspiration of a virtuous person succeeds because of its purity.\n\nHere again, monks, a certain person gives a gift to an ascetic or a brahmin: food, drink, clothing, vehicles, garlands, perfumes, unguents, bedding, dwellings, and lamps. What he gives, he does so with the expectation of a return. He has heard: ‘The Brahmakāyika Devas are long-lived, beautiful, and abundant in happiness.’ He thinks: ‘Oh, if only after the dissolution of the body, after death, I might be reborn into companionship with the Brahmakāyika Devas!’ He fixes his mind on that aspiration, he resolves his mind on that, he develops his mind on that. His mind, being elevated above inferior states, yet not developed further for ultimate liberation, leads to rebirth in that destination. After the dissolution of the body, after death, he is reborn into companionship with the Brahmakāyika Devas. And this I declare, monks, for one who is virtuous, not for one who is unvirtuous; for one who is free from lust, not for one who is with lust. Monks, the aspiration of a virtuous person succeeds because of being free from lust.\nThese, monks, are the eight ways of giving that lead to rebirth.",
      "sinhala": "භික්ෂූණි, දන් දීමෙන් ලැබෙන උපත් අටක් තිබේ. ඒ අට කවරේ ද? භික්ෂූණි, මෙහි ඇතැම් පුද්ගලයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන, මාලා, ගන්ධ, විලේවන, සයනාසන, වාසස්ථාන සහ පහන් පූජා කරයි. ඔහු යමක් දෙන්නේ ද, ඔහු ඒ පිළිබඳව අභිලාෂයෙන් පසුවෙයි. ඔහු ක්ෂත්‍රීය මහාසාලවරුන් හෝ බ්‍රාහ්මණ මහාසාලවරුන් හෝ ගෘහපති මහාසාලවරුන් හෝ පස්කම් ගුණවලින් යුතුව, සම්පූර්ණ වී, භුක්ති විඳිමින් සිටිනවා දකී. ඔහුට මෙසේ සිතේ: ‘අහෝ! මගේ ශරීරය බිඳී මරණයෙන් පසු, මම ක්ෂත්‍රීය මහාසාලවරුන්ගේ හෝ බ්‍රාහ්මණ මහාසාලවරුන්ගේ හෝ ගෘහපති මහාසාලවරුන්ගේ හෝ ඇසුර ලැබීමට උපදින්නට ලැබුණා නම්!’ කියා. ඔහු ඒ සිත යොමු කරයි, ඒ සිත අධිෂ්ඨාන කරයි, ඒ සිත වඩයි. එම සිත පහත් දේ කෙරෙහි නොබැඳී, උසස් දියුණුවක් නොලැබූවක්ව, එම උපත සඳහා හේතු වේ. ශරීරය බිඳී මරණයෙන් පසු, ඔහු ක්ෂත්‍රීය මහාසාලවරුන්ගේ හෝ බ්‍රාහ්මණ මහාසාලවරුන්ගේ හෝ ගෘහපති මහාසාලවරුන්ගේ හෝ ඇසුර ලැබීමට උපදී. මෙය ශීලවන්තයාට ය, දුශ්ශීලයාට නොවේ යැයි මම ප්‍රකාශ කරමි. භික්ෂූණි, ශීලවන්තයාගේ චේතෝප්‍රණිධිය පිරිසිදුකම නිසා සාර්ථක වේ.\n\nභික්ෂූණි, මෙහි තවත් සමහර පුද්ගලයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන, මාලා, ගන්ධ, විලේවන, සයනාසන, වාසස්ථාන සහ පහන් පූජා කරයි. ඔහු යමක් දෙන්නේ ද, ඔහු ඒ පිළිබඳව අභිලාෂයෙන් පසුවෙයි. ඔහුට මෙසේ අසන්නට ලැබේ: ‘චාතුර්මහාරාජික දෙවිවරු දීර්ඝායුෂ්ක ය, වර්ණවත් ය, බොහෝ සැප ඇත්තෝ ය’ කියා. ඔහුට මෙසේ සිතේ: ‘අහෝ! මගේ ශරීරය බිඳී මරණයෙන් පසු, මම චාතුර්මහාරාජික දෙවිවරුන්ගේ ඇසුර ලැබීමට උපදින්නට ලැබුණා නම්!’ කියා. ඔහු ඒ සිත යොමු කරයි, ඒ සිත අධිෂ්ඨාන කරයි, ඒ සිත වඩයි. එම සිත පහත් දේ කෙරෙහි නොබැඳී, උසස් දියුණුවක් නොලැබූවක්ව, එම උපත සඳහා හේතු වේ. ශරීරය බිඳී මරණයෙන් පසු, ඔහු චාතුර්මහාරාජික දෙවිවරුන්ගේ ඇසුර ලැබීමට උපදී. මෙය ශීලවන්තයාට ය, දුශ්ශීලයාට නොවේ යැයි මම ප්‍රකාශ කරමි. භික්ෂූණි, ශීලවන්තයාගේ චේතෝප්‍රණිධිය පිරිසිදුකම නිසා සාර්ථක වේ.\n\nභික්ෂූණි, මෙහි තවත් සමහර පුද්ගලයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන, මාලා, ගන්ධ, විලේවන, සයනාසන, වාසස්ථාන සහ පහන් පූජා කරයි. ඔහු යමක් දෙන්නේ ද, ඔහු ඒ පිළිබඳව අභිලාෂයෙන් පසුවෙයි. ඔහුට මෙසේ අසන්නට ලැබේ: ‘තාවතිංස දෙවිවරු, යාම දෙවිවරු, තුසිත දෙවිවරු, නිර්මාණරති දෙවිවරු, පරනිර්මිතවශවර්තී දෙවිවරු දීර්ඝායුෂ්ක ය, වර්ණවත් ය, බොහෝ සැප ඇත්තෝ ය’ කියා. ඔහුට මෙසේ සිතේ: ‘අහෝ! මගේ ශරීරය බිඳී මරණයෙන් පසු, මම පරනිර්මිතවශවර්තී දෙවිවරුන්ගේ ඇසුර ලැබීමට උපදින්නට ලැබුණා නම්!’ කියා. ඔහු ඒ සිත යොමු කරයි, ඒ සිත අධිෂ්ඨාන කරයි, ඒ සිත වඩයි. එම සිත පහත් දේ කෙරෙහි නොබැඳී, උසස් දියුණුවක් නොලැබූවක්ව, එම උපත සඳහා හේතු වේ. ශරීරය බිඳී මරණයෙන් පසු, ඔහු පරනිර්මිතවශවර්තී දෙවිවරුන්ගේ ඇසුර ලැබීමට උපදී. මෙය ශීලවන්තයාට ය, දුශ්ශීලයාට නොවේ යැයි මම ප්‍රකාශ කරමි. භික්ෂූණි, ශීලවන්තයාගේ චේතෝප්‍රණිධිය පිරිසිදුකම නිසා සාර්ථක වේ.\n\nභික්ෂූණි, මෙහි තවත් සමහර පුද්ගලයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ ආහාර, පාන, වස්ත්‍ර, යාන, මාලා, ගන්ධ, විලේවන, සයනාසන, වාසස්ථාන සහ පහන් පූජා කරයි. ඔහු යමක් දෙන්නේ ද, ඔහු ඒ පිළිබඳව අභිලාෂයෙන් පසුවෙයි. ඔහුට මෙසේ අසන්නට ලැබේ: ‘බ්‍රහ්මකායික දෙවිවරු දීර්ඝායුෂ්ක ය, වර්ණවත් ය, බොහෝ සැප ඇත්තෝ ය’ කියා. ඔහුට මෙසේ සිතේ: ‘අහෝ! මගේ ශරීරය බිඳී මරණයෙන් පසු, මම බ්‍රහ්මකායික දෙවිවරුන්ගේ ඇසුර ලැබීමට උපදින්නට ලැබුණා නම්!’ කියා. ඔහු ඒ සිත යොමු කරයි, ඒ සිත අධිෂ්ඨාන කරයි, ඒ සිත වඩයි. එම සිත පහත් දේ කෙරෙහි නොබැඳී, උසස් දියුණුවක් නොලැබූවක්ව, එම උපත සඳහා හේතු වේ. ශරීරය බිඳී මරණයෙන් පසු, ඔහු බ්‍රහ්මකායික දෙවිවරුන්ගේ ඇසුර ලැබීමට උපදී. මෙය ශීලවන්තයාට ය, දුශ්ශීලයාට නොවේ යැයි ද, වීතරාගී පුද්ගලයාට ය, රාග සහිත පුද්ගලයාට නොවේ යැයි ද මම ප්‍රකාශ කරමි. භික්ෂූණි, ශීලවන්තයාගේ චේතෝප්‍රණිධිය වීතරාගී බව නිසා සාර්ථක වේ. භික්ෂූණි, මේ දන් දීමෙන් ලැබෙන අට ආකාර වූ උපත් ය.",
      "paliTitle": "Dānūpapattisuttaṃ",
      "englishTitle": "Discourse on Rebirth from Generosity",
      "sinhalaTitle": "දානූපපත‍්ති සූත‍්‍රය"
    },
    {
      "number": 36,
      "pali": "‘‘Tīṇimāni, bhikkhave, puññakiriyavatthūni. Katamāni tīṇi? Dānamayaṃ puññakiriyavatthu [puññakiriyavatthuṃ (sī. pī.) evamuparipi], sīlamayaṃ puññakiriyavatthu, bhāvanāmayaṃ puññakiriyavatthu. Idha, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu parittaṃ kataṃ hoti, sīlamayaṃ puññakiriyavatthu parittaṃ kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ [puññakiriyavatthu (syā.)] nābhisambhoti. So kāyassa bhedā paraṃ maraṇā manussadobhagyaṃ upapajjati. ‘‘Idha pana, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu mattaso kataṃ hoti, sīlamayaṃ puññakiriyavatthu mattaso kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ nābhisambhoti. So kāyassa bhedā paraṃ maraṇā manussasobhagyaṃ upapajjati. ‘‘Idha pana, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, sīlamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ nābhisambhoti. So kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjati. Tatra, bhikkhave, cattāro mahārājāno dānamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, sīlamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, cātumahārājike deve dasahi ṭhānehi adhigaṇhanti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi. ‘‘Idha pana, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, sīlamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ nābhisambhoti. So kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjati. Tatra, bhikkhave, sakko devānamindo dānamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā sīlamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā tāvatiṃse deve dasahi ṭhānehi adhigaṇhāti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi. ‘‘Idha pana, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, sīlamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ nābhisambhoti. So kāyassa bhedā paraṃ maraṇā yāmānaṃ devānaṃ sahabyataṃ upapajjati. Tatra, bhikkhave, suyāmo devaputto dānamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, sīlamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, yāme deve dasahi ṭhānehi adhigaṇhāti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi. ‘‘Idha pana, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, sīlamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ nābhisambhoti. So kāyassa bhedā paraṃ maraṇā tusitānaṃ devānaṃ sahabyataṃ upapajjati. Tatra, bhikkhave, santusito devaputto dānamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, sīlamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, tusite deve dasahi ṭhānehi adhigaṇhāti – dibbena āyunā…pe… dibbehi phoṭṭhabbehi. ‘‘Idha pana, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, sīlamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ nābhisambhoti. So kāyassa bhedā paraṃ maraṇā nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjati. Tatra, bhikkhave, sunimmito devaputto dānamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, sīlamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, nimmānaratīdeve dasahi ṭhānehi adhigaṇhāti – dibbena āyunā… pe… dibbehi phoṭṭhabbehi. ‘‘Idha pana, bhikkhave, ekaccassa dānamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, sīlamayaṃ puññakiriyavatthu adhimattaṃ kataṃ hoti, bhāvanāmayaṃ puññakiriyavatthuṃ nābhisambhoti. So kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjati. Tatra, bhikkhave, vasavattī devaputto dānamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, sīlamayaṃ puññakiriyavatthuṃ atirekaṃ karitvā, paranimmitavasavattīdeve dasahi ṭhānehi adhigaṇhāti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena, dibbehi rūpehi, dibbehi saddehi, dibbehi gandhehi, dibbehi rasehi, dibbehi phoṭṭhabbehi. Imāni kho, bhikkhave, tīṇi puññakiriyavatthūnī’’ti. Chaṭṭhaṃ.",
      "english": "“Bhikkhus, there are these three bases for meritorious action. Which three? The basis for meritorious action consisting of giving, the basis for meritorious action consisting of moral conduct, and the basis for meritorious action consisting of mental development. Here, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a slight extent, the basis for meritorious action consisting of moral conduct is performed to a slight extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in a state of human misfortune.\n\n“Here again, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a moderate extent, the basis for meritorious action consisting of moral conduct is performed to a moderate extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in a state of human good fortune.\n\n“Here again, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a great extent, the basis for meritorious action consisting of moral conduct is performed to a great extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in companionship with the devas of the Four Great Kings. There, bhikkhus, the Four Great Kings surpass the devas of the Four Great Kings in ten respects, having performed the basis for meritorious action consisting of giving to an extraordinary degree and the basis for meritorious action consisting of moral conduct to an extraordinary degree: in divine lifespan, divine beauty, divine happiness, divine renown, divine authority, divine sights, divine sounds, divine smells, divine tastes, and divine tactile objects.\n\n“Here again, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a great extent, the basis for meritorious action consisting of moral conduct is performed to a great extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in companionship with the devas of Tāvatiṃsa. There, bhikkhus, Sakka, the king of devas, surpasses the devas of Tāvatiṃsa in ten respects, having performed the basis for meritorious action consisting of giving to an extraordinary degree and the basis for meritorious action consisting of moral conduct to an extraordinary degree: in divine lifespan, divine beauty, divine happiness, divine renown, divine authority, divine sights, divine sounds, divine smells, divine tastes, and divine tactile objects.\n\n“Here again, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a great extent, the basis for meritorious action consisting of moral conduct is performed to a great extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in companionship with the devas of Yāma. There, bhikkhus, Suyāma, the deva prince, surpasses the devas of Yāma in ten respects, having performed the basis for meritorious action consisting of giving to an extraordinary degree and the basis for meritorious action consisting of moral conduct to an extraordinary degree: in divine lifespan, divine beauty, divine happiness, divine renown, divine authority, divine sights, divine sounds, divine smells, divine tastes, and divine tactile objects.\n\n“Here again, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a great extent, the basis for meritorious action consisting of moral conduct is performed to a great extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in companionship with the devas of Tusita. There, bhikkhus, Santusita, the deva prince, surpasses the devas of Tusita in ten respects, having performed the basis for meritorious action consisting of giving to an extraordinary degree and the basis for meritorious action consisting of moral conduct to an extraordinary degree: in divine lifespan, divine beauty, divine happiness, divine renown, divine authority, divine sights, divine sounds, divine smells, divine tastes, and divine tactile objects.\n\n“Here again, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a great extent, the basis for meritorious action consisting of moral conduct is performed to a great extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in companionship with the devas who delight in creation. There, bhikkhus, Sunimmito, the deva prince, surpasses the devas who delight in creation in ten respects, having performed the basis for meritorious action consisting of giving to an extraordinary degree and the basis for meritorious action consisting of moral conduct to an extraordinary degree: in divine lifespan, divine beauty, divine happiness, divine renown, divine authority, divine sights, divine sounds, divine smells, divine tastes, and divine tactile objects.\n\n“Here again, bhikkhus, for some person, the basis for meritorious action consisting of giving is performed to a great extent, the basis for meritorious action consisting of moral conduct is performed to a great extent, and they do not achieve the basis for meritorious action consisting of mental development. After the breakdown of the body, following death, such a one reappears in companionship with the devas who wield power over others' creations. There, bhikkhus, Vasavattī, the deva prince, surpasses the devas who wield power over others' creations in ten respects, having performed the basis for meritorious action consisting of giving to an extraordinary degree and the basis for meritorious action consisting of moral conduct to an extraordinary degree: in divine lifespan, divine beauty, divine happiness, divine renown, divine authority, divine sights, divine sounds, divine smells, divine tastes, and divine tactile objects. These, bhikkhus, are the three bases for meritorious action.”",
      "sinhala": "මහණෙනි, මේ පින්කම් වස්තු තුනකි. ඒ කවර තුනක්ද? දානමය පින්කම් වස්තුව, සීලමය පින්කම් වස්තුව, භාවනාමය පින්කම් වස්තුව යන මේවාය. මහණෙනි, මේ ශාසනයෙහි සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව අල්ප මාත්‍ර වශයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව අල්ප මාත්‍ර වශයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව මිනිස් ලොව අභාග්‍යසම්පන්න පුද්ගලයෙකු ලෙස උපදී.\n\nමහණෙනි, මේ ශාසනයෙහි තවත් සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව මධ්‍යස්ථ ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව මධ්‍යස්ථ ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව මිනිස් ලොව භාග්‍යසම්පන්න පුද්ගලයෙකු ලෙස උපදී.\n\nමහණෙනි, මේ ශාසනයෙහි තවත් සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව චාතුම්මහාරාජික දෙවියන්ගේ සහවාසයට උපදී. මහණෙනි, එහිදී සතරවරම් මහරජවරු දානමය පින්කම් වස්තුව අතිරේකව කර, සීලමය පින්කම් වස්තුව අතිරේකව කර, චාතුම්මහාරාජික දෙවියන් දස කාරණාවකින් අභිබවා සිටිති. එනම් දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන්, දිව්‍යමය රූපයන්ගෙන්, දිව්‍යමය ශබ්දයන්ගෙන්, දිව්‍යමය ගන්ධයන්ගෙන්, දිව්‍යමය රසයන්ගෙන්, දිව්‍යමය ස්පර්ශයන්ගෙන් යන මේවාය.\n\nමහණෙනි, මේ ශාසනයෙහි තවත් සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව තාවතිංස දෙවියන්ගේ සහවාසයට උපදී. මහණෙනි, එහිදී සක් දෙවිඳු දානමය පින්කම් වස්තුව අතිරේකව කර, සීලමය පින්කම් වස්තුව අතිරේකව කර, තාවතිංස දෙවියන් දස කාරණාවකින් අභිබවා සිටියි. එනම් දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන්, දිව්‍යමය රූපයන්ගෙන්, දිව්‍යමය ශබ්දයන්ගෙන්, දිව්‍යමය ගන්ධයන්ගෙන්, දිව්‍යමය රසයන්ගෙන්, දිව්‍යමය ස්පර්ශයන්ගෙන් යන මේවාය.\n\nමහණෙනි, මේ ශාසනයෙහි තවත් සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව යාම දෙවියන්ගේ සහවාසයට උපදී. මහණෙනි, එහිදී සුයාම නම් දෙව්පුත් දානමය පින්කම් වස්තුව අතිරේකව කර, සීලමය පින්කම් වස්තුව අතිරේකව කර, යාම දෙවියන් දස කාරණාවකින් අභිබවා සිටියි. එනම් දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන්, දිව්‍යමය රූපයන්ගෙන්, දිව්‍යමය ශබ්දයන්ගෙන්, දිව්‍යමය ගන්ධයන්ගෙන්, දිව්‍යමය රසයන්ගෙන්, දිව්‍යමය ස්පර්ශයන්ගෙන් යන මේවාය.\n\nමහණෙනි, මේ ශාසනයෙහි තවත් සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව තුසිත දෙවියන්ගේ සහවාසයට උපදී. මහණෙනි, එහිදී සන්තුසිත නම් දෙව්පුත් දානමය පින්කම් වස්තුව අතිරේකව කර, සීලමය පින්කම් වස්තුව අතිරේකව කර, තුසිත දෙවියන් දස කාරණාවකින් අභිබවා සිටියි. එනම් දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන්, දිව්‍යමය රූපයන්ගෙන්, දිව්‍යමය ශබ්දයන්ගෙන්, දිව්‍යමය ගන්ධයන්ගෙන්, දිව්‍යමය රසයන්ගෙන්, දිව්‍යමය ස්පර්ශයන්ගෙන් යන මේවාය.\n\nමහණෙනි, මේ ශාසනයෙහි තවත් සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව නිම්මානරතී දෙවියන්ගේ සහවාසයට උපදී. මහණෙනි, එහිදී සුනිම්මිත නම් දෙව්පුත් දානමය පින්කම් වස්තුව අතිරේකව කර, සීලමය පින්කම් වස්තුව අතිරේකව කර, නිම්මානරතී දෙවියන් දස කාරණාවකින් අභිබවා සිටියි. එනම් දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන්, දිව්‍යමය රූපයන්ගෙන්, දිව්‍යමය ශබ්දයන්ගෙන්, දිව්‍යමය ගන්ධයන්ගෙන්, දිව්‍යමය රසයන්ගෙන්, දිව්‍යමය ස්පර්ශයන්ගෙන් යන මේවාය.\n\nමහණෙනි, මේ ශාසනයෙහි තවත් සමහර පුද්ගලයෙකු විසින් දානමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. සීලමය පින්කම් වස්තුව ඉතා අධික ප්‍රමාණයෙන් කරන ලද්දක් වෙයි. භාවනාමය පින්කම් වස්තුව ඇතිකර ගැනීමට සමත් නොවෙයි. හෙතෙම කය බිඳීමෙන් මරණයෙන් පසුව පරනිම්මිතවසවත්තී දෙවියන්ගේ සහවාසයට උපදී. මහණෙනි, එහිදී වසවත්තී නම් දෙව්පුත් දානමය පින්කම් වස්තුව අතිරේකව කර, සීලමය පින්කම් වස්තුව අතිරේකව කර, පරනිම්මිතවසවත්තී දෙවියන් දස කාරණාවකින් අභිබවා සිටියි. එනම් දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන්, දිව්‍යමය රූපයන්ගෙන්, දිව්‍යමය ශබ්දයන්ගෙන්, දිව්‍යමය ගන්ධයන්ගෙන්, දිව්‍යමය රසයන්ගෙන්, දිව්‍යමය ස්පර්ශයන්ගෙන් යන මේවාය. මහණෙනි, මේවා පින්කම් වස්තු තුනයි.",
      "paliTitle": "Puññakiriyavatthusuttaṃ",
      "englishTitle": "Discourse on the Bases of Meritorious Action",
      "sinhalaTitle": "පින්‍200dකිරිය වස්තු සූත්‍රය"
    },
    {
      "number": 37,
      "pali": "‘‘Aṭṭhimāni, bhikkhave, sappurisadānāni. Katamāni aṭṭha? Suciṃ deti, paṇītaṃ deti, kālena deti, kappiyaṃ deti, viceyya deti, abhiṇhaṃ deti, dadaṃ cittaṃ pasādeti, datvā attamano hoti. Imāni kho, bhikkhave, aṭṭha sappurisadānānī’’ti. ‘‘Suciṃ paṇītaṃ kālena, kappiyaṃ pānabhojanaṃ; Abhiṇhaṃ dadāti dānaṃ, sukhettesu [sukhette (sī. pī.)] brahmacārisu. ‘‘Neva [na ca (sī. pī.)] vippaṭisārissa, cajitvā āmisaṃ bahuṃ; Evaṃ dinnāni dānāni, vaṇṇayanti vipassino. ‘‘Evaṃ yajitvā medhāvī, saddho muttena cetasā; Abyābajjhaṃ [abyāpajjhaṃ (ka.) a. ni. 4.40; 6.37] sukhaṃ lokaṃ, paṇḍito upapajjatī’’ti. sattamaṃ;",
      "english": "“Monks, these are the eight gifts of a virtuous person. Which are these eight? One gives what is pure, one gives what is excellent, one gives at the proper time, one gives what is appropriate, one gives after careful consideration, one gives frequently, when giving one gladdens the mind, and having given one feels joy. Monks, these indeed are the eight gifts of a virtuous person.”\n\nOne gives pure, excellent, timely, and appropriate food and drink. Such a gift is given frequently to those of pure conduct who are good fields for merit.\n\nHaving given up abundant material things, one does not regret it. Gifts given in this manner are praised by those with insight.\n\nHaving thus performed offerings, the wise person, endowed with faith and a liberated mind, the sagacious one is reborn into a world of non-affliction and happiness.",
      "sinhala": "මහණෙනි, මේවා සත්පුරුෂ දාන අටකි. ඒ අට කවරේද? පිරිසිදු දේ දෙයි, ප්‍රණීත දේ දෙයි, කලට දෙයි, කප්පිය දේ දෙයි, විමසා බලා දෙයි, නිරන්තරයෙන් දෙයි, දෙන කල්හි සිත පහදවා ගනියි, දී අවසන් කොට සතුටු වෙයි. මහණෙනි, මේවා සත්පුරුෂ දාන අටයි.\n\nපිරිසිදු වූ, ප්‍රණීත වූ, කලට දෙන ලද, කප්පිය වූ පාන භෝජන ආදිය, බ්‍රහ්මචාරීන් වන සුඛේත්‍රයන්හට නිරන්තරයෙන් දානය ලෙස දෙයි. නොපසුතැවිලි බවින් යුතුව, බොහෝ ආමිස වස්තු පරිත්‍යාග කොට, මෙලෙසින් දෙන ලද දානයන් විදර්ශනා කරන්නාවූ ඥානවන්තයෝ වර්ණනා කරති. මෙසේ ශ්‍රද්ධාවන්තව, මුදාහළ සිත් ඇතිව, (දානයන්) දුන් ප්‍රඥාවන්තයා, කිසිදු උපද්‍රවයක් නැති, සැපවත් වූ ලෝකයකට උපත ලබයි.",
      "paliTitle": "Sappurisadānasuttaṃ",
      "englishTitle": "Discourse on the Giving of a Good Person",
      "sinhalaTitle": "සත්පුරුෂ දාන සූත්‍රය"
    },
    {
      "number": 38,
      "pali": "‘‘Sappuriso, bhikkhave, kule jāyamāno bahuno janassa atthāya hitāya sukhāya hoti – mātāpitūnaṃ atthāya hitāya sukhāya hoti, puttadārassa atthāya hitāya sukhāya hoti, dāsakammakaraporisassa atthāya hitāya sukhāya hoti, mittāmaccānaṃ atthāya hitāya sukhāya hoti, pubbapetānaṃ atthāya hitāya sukhāya hoti, rañño atthāya hitāya sukhāya hoti, devatānaṃ atthāya hitāya sukhāya hoti, samaṇabrāhmaṇānaṃ atthāya hitāya sukhāya hoti. ‘‘Seyyathāpi, bhikkhave, mahāmegho sabbasassāni sampādento bahuno janassa atthāya hitāya sukhāya [hitāya…pe… (syā. ka.)] hoti; evamevaṃ kho, bhikkhave, sappuriso kule jāyamāno bahuno janassa atthāya hitāya sukhāya hoti – mātāpitūnaṃ atthāya hitāya sukhāya hoti, puttadārassa atthāya hitāya sukhāya hoti, dāsakammakaraporisassa atthāya hitāya sukhāya hoti, mittāmaccānaṃ atthāya hitāya sukhāya hoti, pubbapetānaṃ atthāya hitāya sukhāya hoti, rañño atthāya hitāya sukhāya hoti, devatānaṃ atthāya hitāya sukhāya hoti, samaṇabrāhmaṇānaṃ atthāya hitāya sukhāya hotī’’ti. ‘‘Bahūnaṃ [bahunnaṃ (sī. pī.)] vata atthāya, sappañño gharamāvasaṃ; Mātaraṃ pitaraṃ pubbe, rattindivamatandito. ‘‘Pūjeti sahadhammena, pubbekatamanussaraṃ; Anāgāre pabbajite, apace brahmacārayo [brahmacārino (syā.)]. ‘‘Niviṭṭhasaddho pūjeti, ñatvā dhamme ca pesalo [pesale (ka.)]; Rañño hito devahito, ñātīnaṃ sakhinaṃ hito. ‘‘Sabbesaṃ [sabbesu (ka.)] so [sa (syā. pī. ka.)] hito hoti, saddhamme suppatiṭṭhito; Vineyya maccheramalaṃ, sa lokaṃ bhajate siva’’nti. aṭṭhamaṃ;",
      "english": "Monks, a virtuous person, when born into a family, is for the welfare, benefit, and happiness of many people – for the welfare, benefit, and happiness of mother and father; for the welfare, benefit, and happiness of children and spouse; for the welfare, benefit, and happiness of servants, workers, and retainers; for the welfare, benefit, and happiness of friends and ministers; for the welfare, benefit, and happiness of departed relatives; for the welfare, benefit, and happiness of the king; for the welfare, benefit, and happiness of devas; for the welfare, benefit, and happiness of ascetics and brahmins.\n\nJust as, monks, a great cloud bringing forth all crops is for the welfare, benefit, and happiness of many people, even so, monks, a virtuous person, when born into a family, is for the welfare, benefit, and happiness of many people – for the welfare, benefit, and happiness of mother and father; for the welfare, benefit, and happiness of children and spouse; for the welfare, benefit, and happiness of servants, workers, and retainers; for the welfare, benefit, and happiness of friends and ministers; for the welfare, benefit, and happiness of departed relatives; for the welfare, benefit, and happiness of the king; for the welfare, benefit, and happiness of devas; for the welfare, benefit, and happiness of ascetics and brahmins.\n\nTruly for the benefit of many is a wise person residing in a household. Day and night, without idleness, he first honors mother and father, remembering their past kindness, and he supports monastics who have gone forth from the home life, the celibate ones. With deep faith established, he venerates, being adept in the Dhamma. He is beneficial to the king, beneficial to devas, beneficial to relatives, beneficial to friends. He is beneficial to all, firmly established in the True Dhamma. Having overcome the stain of stinginess, he attains a blissful state.",
      "sinhala": "මහණෙනි, සත්පුරුෂ තෙමේ කුලයක උපදින්නේ බොහෝ ජනයාට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි. එනම්, මව්පියන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; දූපුතුන්ට සහ බිරිඳට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; දාස කම්කරුවන්ට හා පෝරියාට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; මිත්‍රයන්ට හා අමාත්‍යයන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; පෙරේතයන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; රජුට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; දෙවියන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; ශ්‍රමණ බ්‍රාහ්මණයන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි.\n\nමහණෙනි, යම් සේ මහා මේඝයක් සියලු සශ්‍රීක භෝග සපයමින්, බොහෝ ජනයාට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි ද; එපරිද්දෙන්ම මහණෙනි, සත්පුරුෂ තෙමේ කුලයක උපදින්නේ බොහෝ ජනයාට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි. එනම්, මව්පියන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; දූපුතුන්ට සහ බිරිඳට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; දාස කම්කරුවන්ට හා පෝරියාට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; මිත්‍රයන්ට හා අමාත්‍යයන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; පෙරේතයන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; රජුට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; දෙවියන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි; ශ්‍රමණ බ්‍රාහ්මණයන්ට අර්ථය පිණිස, හිත පිණිස, සුවය පිණිස වෙයි.\n\nඅහෝ, ප්‍රඥාවන්තයා ගිහිගෙයි වසමින් බොහෝ දෙනාගේ අර්ථය පිණිස වෙයි. මවටත් පියාටත් පෙර කළ උපකාර සිහි කරමින්, රෑ දවල් නොපමාව ධර්මයෙන් යුතුව පුද කරයි.\n\nගිහිගෙන් නික්ම පැවිදි වූ අයටත්, මනා සේ හැසිරෙන බ්‍රහ්මචාරීන්ටත් ධර්මයෙන් යුතුව පුද කරයි.\n\nධර්මයෙහි ද දක්ෂ බව දැන, අචල ශ්‍රද්ධාවෙන් යුක්තව පුද කරයි. ඔහු රජුට හිතවත් ය, දෙවියන්ට හිතවත් ය, ඥාතීන්ටත්, මිත්‍රයන්ටත් හිතවත් ය.\n\nසද්ධර්මයෙහි මනා සේ පිහිටියා වූ ඔහු සියල්ලන්ටම හිතවත් වෙයි. මසුරු මල පහකොට ඔහු ශාන්තිය වූ ලෝකය අත්දකී.",
      "paliTitle": "Sappurisasuttaṃ",
      "englishTitle": "The Good Person Discourse",
      "sinhalaTitle": "සත්පුරුෂ සූත්‍රය"
    },
    {
      "number": 39,
      "pali": "‘‘Aṭṭhime, bhikkhave, puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā, iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Katame aṭṭha? Idha, bhikkhave, ariyasāvako buddhaṃ saraṇaṃ gato hoti. Ayaṃ, bhikkhave, paṭhamo puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko, iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako dhammaṃ saraṇaṃ gato hoti. Ayaṃ, bhikkhave, dutiyo puññābhisando…pe… saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako saṅghaṃ saraṇaṃ gato hoti. Ayaṃ, bhikkhave, tatiyo puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko, iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. [kathā. 480] ‘‘Pañcimāni, bhikkhave, dānāni mahādānāni aggaññāni rattaññāni vaṃsaññāni porāṇāni asaṃkiṇṇāni asaṃkiṇṇapubbāni, na saṃkiyanti na saṃkiyissanti, appaṭikuṭṭhāni [appatikuṭṭhāni (sī.)] samaṇehi brāhmaṇehi viññūhi. Katamāni pañca? Idha, bhikkhave, ariyasāvako pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti. Pāṇātipātā paṭivirato, bhikkhave, ariyasāvako aparimāṇānaṃ sattānaṃ abhayaṃ deti, averaṃ deti, abyābajjhaṃ [abyāpajjhaṃ (ka.) evamuparipi] deti. Aparimāṇānaṃ sattānaṃ abhayaṃ datvā averaṃ datvā abyābajjhaṃ datvā aparimāṇassa abhayassa averassa abyābajjhassa bhāgī hoti. Idaṃ, bhikkhave, paṭhamaṃ dānaṃ mahādānaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkiyati na saṃkiyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. Ayaṃ, bhikkhave, catuttho puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko, iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako adinnādānaṃ pahāya adinnādānā paṭivirato hoti…pe… kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti…pe… musāvādaṃ pahāya musāvādā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Surāmerayamajjapamādaṭṭhānā paṭivirato, bhikkhave, ariyasāvako aparimāṇānaṃ sattānaṃ abhayaṃ deti averaṃ deti abyābajjhaṃ deti. Aparimāṇānaṃ sattānaṃ abhayaṃ datvā averaṃ datvā abyābajjhaṃ datvā, aparimāṇassa abhayassa averassa abyābajjhassa bhāgī hoti. Idaṃ, bhikkhave, pañcamaṃ dānaṃ mahādānaṃ aggaññaṃ rattaññaṃ vaṃsaññaṃ porāṇaṃ asaṃkiṇṇaṃ asaṃkiṇṇapubbaṃ, na saṃkiyati na saṃkiyissati, appaṭikuṭṭhaṃ samaṇehi brāhmaṇehi viññūhi. Ayaṃ kho, bhikkhave, aṭṭhamo puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko, iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. Ime kho, bhikkhave, aṭṭha puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā, iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattantī’’ti. Navamaṃ.",
      "english": "Monks, these are eight streams of merit, streams of wholesome karma, nourishers of happiness, conducive to a good destination, bringing pleasant results, leading to rebirth in a good destination, and conducive to what is desired, agreeable, pleasing, beneficial, and happiness. Which eight?\n\nHere, monks, a noble disciple has gone for refuge to the Buddha. This, monks, is the first stream of merit, stream of wholesome karma, nourisher of happiness, conducive to a good destination, bringing pleasant results, leading to rebirth in a good destination, and conducive to what is desired, agreeable, pleasing, beneficial, and happiness.\n\nFurthermore, monks, a noble disciple has gone for refuge to the Dhamma. This, monks, is the second stream of merit, stream of wholesome karma, nourisher of happiness, conducive to a good destination, bringing pleasant results, leading to rebirth in a good destination, and conducive to what is desired, agreeable, pleasing, beneficial, and happiness.\n\nFurthermore, monks, a noble disciple has gone for refuge to the Saṅgha. This, monks, is the third stream of merit, stream of wholesome karma, nourisher of happiness, conducive to a good destination, bringing pleasant results, leading to rebirth in a good destination, and conducive to what is desired, agreeable, pleasing, beneficial, and happiness.\n\nMonks, these five gifts are great gifts, foremost, long-standing, traditional, ancient, unmixed and unmixed in the past, not censured now, nor will they be censured, and unreproached by recluses, brahmins, and the wise. Which five?\n\nHere, monks, a noble disciple has abandoned the taking of life and abstains from the taking of life. Abstaining from the taking of life, monks, a noble disciple gives fearlessness, non-ill-will, and non-harming to countless beings. Having given fearlessness, non-ill-will, and non-harming to countless beings, he partakes in countless fearlessness, non-ill-will, and non-harming. This, monks, is the first gift, a great gift, foremost, long-standing, traditional, ancient, unmixed and unmixed in the past, not censured now, nor will it be censured, and unreproached by recluses, brahmins, and the wise. This, monks, is the fourth stream of merit, stream of wholesome karma, nourisher of happiness, conducive to a good destination, bringing pleasant results, leading to rebirth in a good destination, and conducive to what is desired, agreeable, pleasing, beneficial, and happiness.\n\nFurthermore, monks, a noble disciple has abandoned taking what is not given and abstains from taking what is not given. Furthermore, a noble disciple has abandoned sexual misconduct and abstains from sexual misconduct. Furthermore, a noble disciple has abandoned false speech and abstains from false speech. Furthermore, a noble disciple has abandoned alcoholic drinks, which are the basis for heedlessness, and abstains from alcoholic drinks, which are the basis for heedlessness.\n\nAbstaining from alcoholic drinks, which are the basis for heedlessness, monks, a noble disciple gives fearlessness, non-ill-will, and non-harming to countless beings. Having given fearlessness, non-ill-will, and non-harming to countless beings, he partakes in countless fearlessness, non-ill-will, and non-harming. This, monks, is the fifth gift, a great gift, foremost, long-standing, traditional, ancient, unmixed and unmixed in the past, not censured now, nor will it be censured, and unreproached by recluses, brahmins, and the wise. This, monks, is the eighth stream of merit, stream of wholesome karma, nourisher of happiness, conducive to a good destination, bringing pleasant results, leading to rebirth in a good destination, and conducive to what is desired, agreeable, pleasing, beneficial, and happiness.\n\nThese, monks, are the eight streams of merit, streams of wholesome karma, nourishers of happiness, conducive to a good destination, bringing pleasant results, leading to rebirth in a good destination, and conducive to what is desired, agreeable, pleasing, beneficial, and happiness.",
      "sinhala": "භික්ෂූනි, මේ පින් ගංගා අටක් වෙති, කුසල් ගංගා අටක් වෙති, සැපයට හේතු වන්නෝ වෙති, සුගතියට හේතු වන්නෝ වෙති, සැප විපාක ඇත්තෝ වෙති, ස්වර්ගයෙහි උපතට පමුණුවන්නෝ වෙති, කැමති වූ, ප්‍රිය වූ, සිත් ගන්නා වූ, හිතවත් වූ, සැපයට පමුණුවන්නෝ වෙති. ඒ අට කවරේද?\n\nභික්ෂූනි, මෙහිලා ආර්ය ශ්‍රාවක තෙමේ බුදුන් සරණ ගිය කෙනෙක් වෙයි. භික්ෂූනි, මෙය පළමුවන පින් ගංගාවය, කුසල් ගංගාවය, සැපයට හේතුවය, සුගතියට හේතුවය, සැප විපාක ඇත්තකි, ස්වර්ගයෙහි උපතට පමුණුවන්නකි, කැමති වූ, ප්‍රිය වූ, සිත් ගන්නා වූ, හිතවත් වූ, සැපයට පමුණුවන්නකි.\n\nභික්ෂූනි, නැවතත් ආර්ය ශ්‍රාවක තෙමේ ධර්මය සරණ ගිය කෙනෙක් වෙයි. භික්ෂූනි, මෙය දෙවන පින් ගංගාවය, කුසල් ගංගාවය, සැපයට හේතුවය, සුගතියට හේතුවය, සැප විපාක ඇත්තකි, ස්වර්ගයෙහි උපතට පමුණුවන්නකි, කැමති වූ, ප්‍රිය වූ, සිත් ගන්නා වූ, හිතවත් වූ, සැපයට පමුණුවන්නකි.\n\nභික්ෂූනි, නැවතත් ආර්ය ශ්‍රාවක තෙමේ සංඝයා සරණ ගිය කෙනෙක් වෙයි. භික්ෂූනි, මෙය තෙවන පින් ගංගාවය, කුසල් ගංගාවය, සැපයට හේතුවය, සුගතියට හේතුවය, සැප විපාක ඇත්තකි, ස්වර්ගයෙහි උපතට පමුණුවන්නකි, කැමති වූ, ප්‍රිය වූ, සිත් ගන්නා වූ, හිතවත් වූ, සැපයට පමුණුවන්නකි.\n\nභික්ෂූනි, මේ පස් දානයෝ මහා දානයෝ වෙති, ශ්‍රේෂ්ඨ වූ දානයෝ වෙති, රත්තඥ වූ දානයෝ වෙති, වංශඥ වූ දානයෝ වෙති, පුරාණ වූ දානයෝ වෙති, මුසු නොවූ දානයෝ වෙති, පෙරද මුසු නොවූ දානයෝ වෙති, මුසු නොවෙති, මුසු නොවන්නාහ, ශ්‍රමණ බ්‍රාහ්මණ විඤ්ඤූන් විසින් දොස් නොකියන ලද දානයෝ වෙති. ඒ පස කවරේද?\n\nභික්ෂූනි, මෙහිලා ආර්ය ශ්‍රාවක තෙමේ ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වළකින්නේ වෙයි. භික්ෂූනි, ප්‍රාණඝාතයෙන් වළකින්නා වූ ආර්ය ශ්‍රාවක තෙමේ අප්‍රමාණ සත්ත්වයන්ට අභය දෙයි, වෛර නොකිරීම දෙයි, හිංසා නොකිරීම දෙයි. අප්‍රමාණ සත්ත්වයන්ට අභය දී, වෛර නොකිරීම දී, හිංසා නොකිරීම දී, අප්‍රමාණ අභය ලැබීමටත්, වෛර නොකිරීම ලැබීමටත්, හිංසා නොකිරීම ලැබීමටත් භාග්‍යවන්තයෙක් වෙයි. භික්ෂූනි, මෙය පළමුවන මහා දානයය, ශ්‍රේෂ්ඨ වූ, රත්තඥ වූ, වංශඥ වූ, පුරාණ වූ, මුසු නොවූ, පෙරද මුසු නොවූ, මුසු නොවන්නා වූ, ශ්‍රමණ බ්‍රාහ්මණ විඤ්ඤූන් විසින් දොස් නොකියන ලද දානයකි. භික්ෂූනි, මෙය සතරවන පින් ගංගාවය, කුසල් ගංගාවය, සැපයට හේතුවය, සුගතියට හේතුවය, සැප විපාක ඇත්තකි, ස්වර්ගයෙහි උපතට පමුණුවන්නකි, කැමති වූ, ප්‍රිය වූ, සිත් ගන්නා වූ, හිතවත් වූ, සැපයට පමුණුවන්නකි.\n\nභික්ෂූනි, නැවතත් ආර්ය ශ්‍රාවක තෙමේ අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වළකින්නේ වෙයි. භික්ෂූනි, නැවතත් ආර්ය ශ්‍රාවක තෙමේ කාමයන්හි වරදවා හැසිරීම අත්හැර, කාමයන්හි වරදවා හැසිරීමෙන් වළකින්නේ වෙයි. භික්ෂූනි, නැවතත් ආර්ය ශ්‍රාවක තෙමේ මුසාවාදය අත්හැර, මුසාවාදයෙන් වළකින්නේ වෙයි. භික්ෂූනි, නැවතත් ආර්ය ශ්‍රාවක තෙමේ සුරාමේරය මත්පැන් පානය කිරීම අත්හැර, සුරාමේරය මත්පැන් පානය කිරීමෙන් වළකින්නේ වෙයි.\n\nභික්ෂූනි, සුරාමේරය මත්පැන් පානය කිරීමෙන් වළකින්නා වූ ආර්ය ශ්‍රාවක තෙමේ අප්‍රමාණ සත්ත්වයන්ට අභය දෙයි, වෛර නොකිරීම දෙයි, හිංසා නොකිරීම දෙයි. අප්‍රමාණ සත්ත්වයන්ට අභය දී, වෛර නොකිරීම දී, හිංසා නොකිරීම දී, අප්‍රමාණ අභය ලැබීමටත්, වෛර නොකිරීම ලැබීමටත්, හිංසා නොකිරීම ලැබීමටත් භාග්‍යවන්තයෙක් වෙයි. භික්ෂූනි, මෙය පස්වන මහා දානයය, ශ්‍රේෂ්ඨ වූ, රත්තඥ වූ, වංශඥ වූ, පුරාණ වූ, මුසු නොවූ, පෙරද මුසු නොවූ, මුසු නොවන්නා වූ, ශ්‍රමණ බ්‍රාහ්මණ විඤ්ඤූන් විසින් දොස් නොකියන ලද දානයකි. භික්ෂූනි, මෙය අටවන පින් ගංගාවය, කුසල් ගංගාවය, සැපයට හේතුවය, සුගතියට හේතුවය, සැප විපාක ඇත්තකි, ස්වර්ගයෙහි උපතට පමුණුවන්නකි, කැමති වූ, ප්‍රිය වූ, සිත් ගන්නා වූ, හිතවත් වූ, සැපයට පමුණුවන්නකි.\n\nභික්ෂූනි, මේවා ම ය, අට පින් ගංගාවෝය, කුසල් ගංගාවෝය, සැපයට හේතුවෝය, සුගතියට හේතුවෝය, සැප විපාක ඇත්තෝය, ස්වර්ගයෙහි උපතට පමුණුවන්නෝය, කැමති වූ, ප්‍රිය වූ, සිත් ගන්නා වූ, හිතවත් වූ, සැපයට පමුණුවන්නෝය.",
      "paliTitle": "Abhisandasuttaṃ",
      "englishTitle": "Discourse on Blessings",
      "sinhalaTitle": "ආනිසංස සූත්‍රය"
    },
    {
      "number": 40,
      "pali": "‘‘Pāṇātipāto, bhikkhave, āsevito bhāvito bahulīkato nirayasaṃvattaniko tiracchānayonisaṃvattaniko pettivisayasaṃvattaniko. Yo sabbalahuso [sabbalahusoti sabbalahuko (syā. aṭṭha.)] pāṇātipātassa vipāko, manussabhūtassa appāyukasaṃvattaniko hoti. ‘‘Adinnādānaṃ, bhikkhave, āsevitaṃ bhāvitaṃ bahulīkataṃ nirayasaṃvattanikaṃ tiracchānayonisaṃvattanikaṃ pettivisayasaṃvattanikaṃ. Yo sabbalahuso adinnādānassa vipāko, manussabhūtassa bhogabyasanasaṃvattaniko hoti. ‘‘Kāmesumicchācāro, bhikkhave, āsevito bhāvito bahulīkato nirayasaṃvattaniko tiracchānayonisaṃvattaniko pettivisayasaṃvattaniko. Yo sabbalahuso kāmesumicchācārassa vipāko, manussabhūtassa sapattaverasaṃvattaniko hoti. ‘‘Musāvādo, bhikkhave, āsevito bhāvito bahulīkato nirayasaṃvattaniko tiracchānayonisaṃvattaniko pettivisayasaṃvattaniko. Yo sabbalahuso musāvādassa vipāko, manussabhūtassa abhūtabbhakkhānasaṃvattaniko hoti. ‘‘Pisuṇā, bhikkhave, vācā āsevitā bhāvitā bahulīkatā nirayasaṃvattanikā tiracchānayonisaṃvattanikā pettivisayasaṃvattanikā. Yo sabbalahuso pisuṇāya vācāya vipāko, manussabhūtassa mittehi bhedanasaṃvattaniko hoti. ‘‘Pharusā, bhikkhave, vācā āsevitā bhāvitā bahulīkatā nirayasaṃvattanikā tiracchānayonisaṃvattanikā pettivisayasaṃvattanikā. Yo sabbalahuso pharusāya vācāya vipāko, manussabhūtassa amanāpasaddasaṃvattaniko hoti. ‘‘Samphappalāpo, bhikkhave, āsevito bhāvito bahulīkato nirayasaṃvattaniko tiracchānayonisaṃvattaniko pettivisayasaṃvattaniko. Yo sabbalahuso samphappalāpassa vipāko, manussabhūtassa anādeyyavācāsaṃvattaniko hoti. ‘‘Surāmerayapānaṃ, bhikkhave, āsevitaṃ bhāvitaṃ bahulīkataṃ nirayasaṃvattanikaṃ tiracchānayonisaṃvattanikaṃ pettivisayasaṃvattanikaṃ. Yo sabbalahuso surāmerayapānassa vipāko, manussabhūtassa ummattakasaṃvattaniko hotī’’ti. Dasamaṃ. ",
      "english": "Monks, the repeated practice, development, and extensive cultivation of the destruction of life leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of the destruction of life, when one is reborn as a human being, is conducive to a short lifespan.\n\nMonks, the repeated practice, development, and extensive cultivation of taking what is not given leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of taking what is not given, when one is reborn as a human being, is conducive to the loss of one's possessions.\n\nMonks, the repeated practice, development, and extensive cultivation of sexual misconduct leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of sexual misconduct, when one is reborn as a human being, is conducive to animosity from rivals.\n\nMonks, the repeated practice, development, and extensive cultivation of false speech leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of false speech, when one is reborn as a human being, is conducive to being falsely accused.\n\nMonks, the repeated practice, development, and extensive cultivation of slanderous speech leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of slanderous speech, when one is reborn as a human being, is conducive to the breaking of friendships.\n\nMonks, the repeated practice, development, and extensive cultivation of harsh speech leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of harsh speech, when one is reborn as a human being, is conducive to hearing unpleasant sounds.\n\nMonks, the repeated practice, development, and extensive cultivation of frivolous speech leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of frivolous speech, when one is reborn as a human being, is conducive to having one's words disregarded.\n\nMonks, the repeated practice, development, and extensive cultivation of alcoholic drinks and intoxicants leads to rebirth in the lower realms of hell, the animal kingdom, or the realm of hungry ghosts. Even the least severe karmic result of alcoholic drinks and intoxicants, when one is reborn as a human being, is conducive to madness.",
      "sinhala": "මහණෙනි, ප්‍රාණඝාතය පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. ප්‍රාණඝාතයේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, කෙටි ආයුෂ ලැබීමට හේතු වීමයි.\n\nමහණෙනි, අදත්තාදානය පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. අදත්තාදානයේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, භෝග සම්පත් විනාශ වීමට හේතු වීමයි.\n\nමහණෙනි, කාමයේ වරදවා හැසිරීම පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. කාමයේ වරදවා හැසිරීමේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, සතුරු වෛරයන්ට මුහුණ දීමට හේතු වීමයි.\n\nමහණෙනි, මුසාවාදය පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. මුසාවාදයේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, අභූත චෝදනාවලට ලක් වීමට හේතු වීමයි.\n\nමහණෙනි, පිසුණු වචනය (කේළාම් කීම) පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. පිසුණු වචනයේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, මිත්‍රයන්ගෙන් භේදවීමට (මිත්‍රයන් අහිමි වීමට) හේතු වීමයි.\n\nමහණෙනි, ඵරුෂ වචනය (අයහපත් වචන කීම) පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. ඵරුෂ වචනයේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, අමනාප කරන ශබ්ද (නොපහන් වචන) ඇසීමට හේතු වීමයි.\n\nමහණෙනි, සම්ඵප්පලාපය (නිෂ්ඵල කතා) පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. සම්ඵප්පලාපයේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, තමාගේ වචනය අනාදරයට (පිළිනොගැනීමට) ලක් වීමට හේතු වීමයි.\n\nමහණෙනි, සුරාමේරය පානය පුරුදු කළ, වැඩූ, බහුල වශයෙන් කළ දෙයකි. එය නිරයගාමී වීමට, තිරිසන් යෝනියට යාමට, ප්‍රේත ලෝකයට යාමට හේතු වේ. සුරාමේරය පානයේ අතිශය මෘදු වූ විපාකය නම්, මිනිසත් බව ලැබූ කල්හි, උන්මත්තක භාවයට (පිස්සුවට) පත් වීමට හේතු වීමයි.",
      "paliTitle": "Duccaritavipākasuttaṃ",
      "englishTitle": "Discourse on the Result of Misconduct",
      "sinhalaTitle": "දුශ්චරිත විපාක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Dānavaggo catuttho. Tassuddānaṃ – Dve dānāni vatthuñca, khettaṃ dānūpapattiyo; Kiriyaṃ dve sappurisā, abhisando vipāko cāti.",
    "english": "The Fourth Chapter on Giving",
    "sinhala": "සිව්වැනි දාන ව‍ර්ගය"
  }
}