{
  "id": "an8.3",
  "title": {
    "pali": "Gahapativaggo",
    "english": "The Chapter on Householders",
    "sinhala": "ගෘහපති වග්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tatra kho bhagavā bhikkhū āmantesi ‘‘aṭṭhahi, bhikkhave, acchariyehi abbhutehi dhammehi [abbhutadhammehi (syā. ka.)] samannāgataṃ uggaṃ gahapatiṃ vesālikaṃ dhārethā’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi. Atha kho aññataro bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena uggassa gahapatino vesālikassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho uggo gahapati vesāliko yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho uggaṃ gahapatiṃ vesālikaṃ so bhikkhu etadavoca – ‘‘Aṭṭhahi kho tvaṃ, gahapati, acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato. Katame te, gahapati, aṭṭha acchariyā abbhutā dhammā, yehi tvaṃ samannāgato bhagavatā byākato’’ti? ‘‘Na kho ahaṃ, bhante, jānāmi – katamehi aṭṭhahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākatoti. Api ca, bhante, ye me aṭṭha acchariyā abbhutā dhammā saṃvijjanti, taṃ suṇohi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, gahapatī’’ti kho so bhikkhu uggassa gahapatino vesālikassa paccassosi. Uggo gahapati vesāliko etadavoca – ‘‘yadāhaṃ, bhante, bhagavantaṃ paṭhamaṃ dūratova addasaṃ; saha dassaneneva me, bhante, bhagavato cittaṃ pasīdi. Ayaṃ kho me, bhante, paṭhamo acchariyo abbhuto dhammo saṃvijjati’’. ‘‘So kho ahaṃ, bhante, pasannacitto bhagavantaṃ payirupāsiṃ. Tassa me bhagavā anupubbiṃ kathaṃ kathesi, seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ; kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ, nekkhamme ānisaṃsaṃ pakāsesi. Yadā maṃ bhagavā aññāsi kallacittaṃ muducittaṃ vinīvaraṇacittaṃ udaggacittaṃ pasannacittaṃ, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā taṃ pakāsesi – dukkhaṃ, samudayaṃ, nirodhaṃ, maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya; evamevaṃ kho me tasmiṃyeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’nti. So kho ahaṃ, bhante, diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṃkatho vesārajjappatto aparappaccayo satthusāsane tattheva buddhañca dhammañca saṅghañca saraṇaṃ agamāsiṃ, brahmacariyapañcamāni ca sikkhāpadāni samādiyiṃ. Ayaṃ kho me, bhante, dutiyo acchariyo abbhuto dhammo saṃvijjati. ‘‘Tassa mayhaṃ, bhante, catasso komāriyo pajāpatiyo ahesuṃ. Atha khvāhaṃ, bhante, yena tā pajāpatiyo tenupasaṅkamiṃ; upasaṅkamitvā tā pajāpatiyo etadavacaṃ – ‘mayā kho, bhaginiyo, brahmacariyapañcamāni sikkhāpadāni samādinnāni [samādiṇṇāni (sī. ka.)]. Yā icchati sā idheva bhoge ca bhuñjatu puññāni ca karotu, sakāni vā ñātikulāni gacchatu. Hoti vā pana purisādhippāyo, kassa vo dammī’ti? Evaṃ vutte sā, bhante, jeṭṭhā pajāpati maṃ etadavoca – ‘itthannāmassa maṃ, ayyaputta, purisassa dehī’ti. Atha kho ahaṃ, bhante, taṃ purisaṃ pakkosāpetvā vāmena hatthena pajāpatiṃ gahetvā dakkhiṇena hatthena bhiṅgāraṃ gahetvā tassa purisassa oṇojesiṃ. Komāriṃ kho panāhaṃ, bhante, dāraṃ pariccajanto nābhijānāmi cittassa aññathattaṃ. Ayaṃ kho me, bhante, tatiyo acchariyo abbhuto dhammo saṃvijjati. ‘‘Saṃvijjanti kho pana me, bhante, kule bhogā. Te ca kho appaṭivibhattā sīlavantehi kalyāṇadhammehi. Ayaṃ kho me, bhante, catuttho acchariyo abbhuto dhammo saṃvijjati. ‘‘Yaṃ kho panāhaṃ, bhante, bhikkhuṃ payirupāsāmi; sakkaccaṃyeva payirupāsāmi, no asakkaccaṃ. Ayaṃ kho me, bhante, pañcamo acchariyo abbhuto dhammo saṃvijjati. ‘‘So ce, bhante, me āyasmā dhammaṃ deseti; sakkaccaṃyeva suṇomi, no asakkaccaṃ. No ce me so āyasmā dhammaṃ deseti, ahamassa dhammaṃ desemi. Ayaṃ kho me, bhante chaṭṭho acchariyo abbhuto dhammo saṃvijjati. ‘‘Anacchariyaṃ kho pana maṃ, bhante, devatā upasaṅkamitvā ārocenti – ‘svākkhāto, gahapati, bhagavatā dhammo’ti. Evaṃ vutte ahaṃ, bhante, tā devatā evaṃ vadāmi – ‘vadeyyātha vā evaṃ kho tumhe devatā no vā vadeyyātha, atha kho svākkhāto bhagavatā dhammo’ti. Na kho panāhaṃ, bhante, abhijānāmi tatonidānaṃ cittassa unnatiṃ [uṇṇatiṃ (ka.) dha. sa. 1121; vibha. 843, 845 passitabbaṃ] – ‘maṃ vā devatā upasaṅkamanti, ahaṃ vā devatāhi saddhiṃ sallapāmī’ti. Ayaṃ kho me, bhante, sattamo acchariyo abbhuto dhammo saṃvijjati. ‘‘Yānimāni, bhante, bhagavatā desitāni pañcorambhāgiyāni saṃyojanāni, nāhaṃ tesaṃ kiñci attani appahīnaṃ samanupassāmi. Ayaṃ kho me, bhante, aṭṭhamo acchariyo abbhuto dhammo saṃvijjati. Ime kho me, bhante, aṭṭha acchariyā abbhutā dhammā saṃvijjanti. Na ca kho ahaṃ jānāmi – katamehi cāhaṃ [katamehipahaṃ (sī.), katamehipāhaṃ (pī. ka.)] aṭṭhahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato’’ti. Atha kho so bhikkhu uggassa gahapatino vesālikassa nivesane piṇḍapātaṃ gahetvā uṭṭhāyāsanā pakkāmi. Atha kho so bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu yāvatako ahosi uggena gahapatinā vesālikena saddhiṃ kathāsallāpo, taṃ sabbaṃ bhagavato ārocesi. ‘‘Sādhu sādhu, bhikkhu! Yathā taṃ uggo gahapati vesāliko sammā byākaramāno byākareyya, imeheva kho, bhikkhu, aṭṭhahi acchariyehi abbhutehi dhammehi samannāgato uggo gahapati vesāliko mayā byākato. Imehi ca pana, bhikkhu, aṭṭhahi acchariyehi abbhutehi dhammehi samannāgataṃ uggaṃ gahapatiṃ vesālikaṃ dhārehī’’ti. Paṭhamaṃ.",
      "english": "At one time the Blessed One was dwelling in Vesāli, in the Great Wood, in the Gabled Hall. There, the Blessed One addressed the monks: “Monks, remember Ugga, the householder of Vesāli, as possessing eight wonderful and astonishing qualities.” This is what the Blessed One said. Having said this, the Fortunate One rose from his seat and entered his dwelling.\n\nThen, in the morning, a certain monk dressed, took his bowl and robe, and went to the dwelling of Ugga, the householder of Vesāli; having gone there, he sat down on the seat prepared for him. Then Ugga, the householder of Vesāli, approached that monk; having approached and saluted the monk, he sat down to one side. To Ugga, the householder of Vesāli, sitting to one side, that monk said this: “Householder, the Blessed One has declared that you are endowed with eight wonderful and astonishing qualities. What, householder, are these eight wonderful and astonishing qualities with which you are endowed, as declared by the Blessed One?” “Venerable sir, I do not know with which eight wonderful and astonishing qualities I am endowed, as declared by the Blessed One. But, venerable sir, listen to those eight wonderful and astonishing qualities that are found in me, pay close attention; I will speak.” “Yes, householder,” that monk replied to Ugga, the householder of Vesāli. Ugga, the householder of Vesāli, said this: “Venerable sir, when I first saw the Blessed One from afar, my mind was immediately gladdened by the sight of the Blessed One. This, venerable sir, is the first wonderful and astonishing quality found in me.”\n\n“Venerable sir, with a gladdened mind, I attended upon the Blessed One. To me, the Blessed One gave a progressive discourse, that is, a discourse on generosity, a discourse on moral conduct, a discourse on heaven; he revealed the danger, the degradation, and the defilement of sensual pleasures, and the benefit of renunciation. When the Blessed One perceived my mind to be ready, pliable, free from hindrances, uplifted, and confident, then he expounded the teaching peculiar to the Buddhas: suffering, its origin, its cessation, and the path. Just as a clean cloth, free from stains, would perfectly absorb dye, so too, right on that very seat, there arose in me the dustless, stainless vision of Dhamma: ‘Whatever is subject to arising is subject to cessation.’ Having seen the Dhamma, attained the Dhamma, understood the Dhamma, penetrated the Dhamma, having overcome doubt, having cast off perplexity, having gained confidence, and having become independent of others in the Teacher's dispensation, I then and there went for refuge to the Buddha, the Dhamma, and the Saṅgha, and undertook the training rules that culminate in the holy life. This, venerable sir, is the second wonderful and astonishing quality found in me.”\n\n“Venerable sir, I had four young wives. Then, venerable sir, I went to those wives; having approached, I said to them: ‘Sisters, I have undertaken the training rules that culminate in the holy life. Whoever wishes may enjoy wealth here and make merit, or go back to her own relatives. Or if there is a man you prefer, to whom shall I give you?’ When this was said, venerable sir, my eldest wife said to me: ‘Give me, my lord, to so-and-so man.’ Then, venerable sir, I had that man called, and holding my wife with my left hand, and taking a water vessel with my right hand, I bestowed her upon that man. But, venerable sir, I am not aware of any change in my mind when I gave away a young wife. This, venerable sir, is the third wonderful and astonishing quality found in me.”\n\n“Venerable sir, there are riches in my family. And these are always shared with the virtuous and those of good conduct. This, venerable sir, is the fourth wonderful and astonishing quality found in me.”\n\n“Venerable sir, when I attend upon a monk, I attend upon him respectfully, not disrespectfully. This, venerable sir, is the fifth wonderful and astonishing quality found in me.”\n\n“Venerable sir, if that venerable one teaches me the Dhamma, I listen respectfully, not disrespectfully. If that venerable one does not teach me the Dhamma, I teach the Dhamma to him. This, venerable sir, is the sixth wonderful and astonishing quality found in me.”\n\n“Venerable sir, it is not uncommon for deities to approach me and announce: ‘Householder, the Dhamma has been well-expounded by the Blessed One!’ When this is said, venerable sir, I say to those deities: ‘Whether you deities say so or not, the Dhamma has indeed been well-expounded by the Blessed One.’ Yet, venerable sir, I am not aware of any elation of mind on that account – that ‘deities approach me, or that I converse with deities.’ This, venerable sir, is the seventh wonderful and astonishing quality found in me.”\n\n“Venerable sir, as to these five lower fetters declared by the Blessed One, I do not discern any of them as not abandoned in myself. This, venerable sir, is the eighth wonderful and astonishing quality found in me. These, venerable sir, are the eight wonderful and astonishing qualities found in me. But I do not know which eight wonderful and astonishing qualities the Blessed One declared me to be endowed with.”\n\nThen that monk, after receiving alms-food in the dwelling of Ugga, the householder of Vesāli, rose from his seat and departed. Then, having returned from his alms-round after his meal, that monk went to the Blessed One; having approached, he saluted the Blessed One and sat down to one side. Sitting to one side, that monk reported to the Blessed One the entire conversation he had had with Ugga, the householder of Vesāli.\n\n“Good, good, monk! Just as Ugga, the householder of Vesāli, would rightly explain, it is with these very eight wonderful and astonishing qualities, monk, that I declared Ugga, the householder of Vesāli, to be endowed. So, monk, remember Ugga, the householder of Vesāli, as possessing these eight wonderful and astonishing qualities.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ විශාලාවේ මහ වනයෙහි කූටාගාර ශාලාවේ වැඩ වාසය කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, විශාලාවේ උග්ග ගෘහපතියා පුදුම සහ ආශ්චර්යමත් වූ ධර්ම අටකින් යුක්ත බව සිහිතබා ගනිවු.\" භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගතයන් වහන්සේ හුන් අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක.\n\nඉන්පසු එක්තරා භික්ෂුවක් පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු රැගෙන විශාලාවේ උග්ග ගෘහපතියාගේ නිවස වෙත ගියේය. එහි පැමිණ, පනවන ලද අසුනක වාඩි විය. ඉන්පසු විශාලාවේ උග්ග ගෘහපතියා ඒ භික්ෂුව වෙත පැමිණියේය. පැමිණ, ඒ භික්ෂුවට ආචාර කොට එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි විශාලාවේ උග්ග ගෘහපතියාට ඒ භික්ෂුව මෙසේ කීවේය: \"ගෘහපතිය, ඔබ පුදුම සහ ආශ්චර්යමත් වූ ධර්ම අටකින් යුක්ත යැයි භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලදී. ගෘහපතිය, ඔබ ඒ පුදුම සහ ආශ්චර්යමත් වූ ධර්ම අටෙන් යුක්ත යැයි භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දේ කුමන ධර්ම අටකින් ද?\" \"වහන්ස, මා කුමන පුදුම සහ ආශ්චර්යමත් වූ ධර්ම අටකින් යුක්ත යැයි භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දේ දැයි මම නොදනිමි. එහෙත් වහන්ස, මා තුළ ඇති පුදුම සහ ආශ්චර්යමත් ධර්ම අටක් වේ නම්, ඒවා ඔබ සවන් දෙන්න, මැනවින් මෙනෙහි කරන්න; මම කියමි.\" \"එසේය, ගෘහපතිය,\" යැයි ඒ භික්ෂුව විශාලාවේ උග්ග ගෘහපතියාට පිළිවදන් දුන්නේය. විශාලාවේ උග්ග ගෘහපතියා මෙසේ කීවේය:\n\n\"වහන්ස, මම භාග්‍යවතුන් වහන්සේ මුලින්ම දුර සිටම දුටු විට, දැකීමත් සමඟම වහන්ස, භාග්‍යවතුන් වහන්සේ කෙරෙහි මගේ සිත පැහැදුණේය. වහන්ස, මා තුළ ඇති පළමු පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි.\"\n\n\"වහන්ස, එසේ පැහැදුණු සිත් ඇති මම භාග්‍යවතුන් වහන්සේට උපස්ථාන කළෙමි. උන්වහන්සේ මට දාන කතාව, සීල කතාව, ස්වර්ග කතාව යන මේ අනුපිළිවෙළින් ධර්ම දේශනා කළ සේක; කාමයන්ගේ ආදීනවය, හීන බව, කෙලෙස් සහිත බවත්, නික්ලේශී බවේ ඇති ආනිසංසත් ප්‍රකාශ කළ සේක. භාග්‍යවතුන් වහන්සේ මාගේ සිත සූදානම්, මෘදු, නීවරණ රහිත, උද්දාම වූ, පැහැදුණු සිතක් බව දැනගත් විට, එවිට බුදුවරුන්ගේ අතිශයින් උසස් වූ ධර්ම දේශනාව වන දුක, දුකට හේතුව, දුක නැතිකිරීම, දුක නැතිකිරීමේ මාර්ගය යන චතුරාර්ය සත්‍යය දේශනා කළ සේක. යම් සේ පිරිසිදු, පැල්ලම් රහිත වස්ත්‍රයක් මැනවින් වර්ණය උරා ගන්නේද; එලෙසින්ම වහන්ස, ඒ ආසනයේදී මට විරජෝ භාවයෙන් යුක්ත, පහ වූ කෙලෙස් ඇති ධර්ම චක්ෂුව පහළ විය – 'යම් කිසිවක් හටගැනීමේ ස්වභාවයෙන් යුක්ත ද, ඒ සියල්ල නැතිවීමේ ස්වභාවයෙන් යුක්ත ය' කියා. වහන්ස, එසේ ධර්මය දැක, ධර්මය ලබා, ධර්මය අවබෝධ කර, ධර්මය තුළට කිඳා බැස, සැකයෙන් එතෙර වී, කුමක්ද කියා කියන සැකය පහ වී, නිර්භීතභාවයට පත් වූ, අනුන් කෙරෙන් නොලැබූ ශාස්තෘන් වහන්සේගේ ශාසනයෙහි, එතැන් සිටම බුදුන්, දහම්, සඟුන් සරණ ගියෙමි. බ්‍රහ්මචරිය පස්වැනි කොට ඇති සික්ෂාපද ද සමාදන් වීමි. වහන්ස, මා තුළ ඇති දෙවන පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි.\"\n\n\"වහන්ස, මට තරුණ භාර්යාවන් සතර දෙනෙක් සිටියහ. එවිට වහන්ස, මම ඒ භාර්යාවන් වෙත ගියෙමි. ගොස් ඒ භාර්යාවන්ට මෙසේ කීවෙමි: ‘නංගියනි, මා විසින් බ්‍රහ්මචරිය පස්වැනි කොට ඇති සික්ෂාපද සමාදන් කරගන්නා ලදී. යමෙක් කැමති නම්, ඇය මෙහිම භෝග සම්පත් විඳීවා, පින් ද කරත්වා. නැතිනම් තමන්ගේ ඥාති කුලවලට යත්වා. නැතිනම්, පිරිමියෙකු කෙරෙහි කැමැත්තක් ඇත්නම්, කවරෙකුට නුඹලා දෙම්දැයි?’ මෙසේ කී කල්හි වහන්ස, ඒ වැඩිමහල් භාර්යාව මට මෙසේ කීවාය: ‘ආර්ය පුත්‍රය, මාව අසවල් නමැති පුරුෂයාට දෙන්න’ කියා. එවිට වහන්ස, මම ඒ පුරුෂයා කැඳවා, වම් අතින් භාර්යාව අල්ලාගෙන, දකුණු අතින් කෙන්ඩිය ගෙන ඒ පුරුෂයාට පවරා දුන්නෙමි. වහන්ස, තරුණ භාර්යාව පරිත්‍යාග කරද්දී මම සිතේ වෙනස්වීමක් අත්නොදනිමි. වහන්ස, මා තුළ ඇති තුන්වන පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි.\"\n\n\"වහන්ස, මාගේ කුලයේ භෝග සම්පත් තිබේ. ඒවා සීලවන්ත, කල්‍යාණ ධර්මයන් ඇති අය සමඟ බෙදා නොගෙන නොසිටිමි. වහන්ස, මා තුළ ඇති සිව්වන පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි.\"\n\n\"වහන්ස, මම යම් භික්ෂුවකට උපස්ථාන කරන්නේද; ඒ භික්ෂුවට ගෞරවයෙන්ම උපස්ථාන කරමි, අගෞරවයෙන් නොවේ. වහන්ස, මා තුළ ඇති පස්වන පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි.\"\n\n\"වහන්ස, ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේ මට ධර්මය දේශනා කරන්නේ නම්; මම ගෞරවයෙන්ම අසමි, අගෞරවයෙන් නොවේ. ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේ මට ධර්මය දේශනා නොකරන්නේ නම්, මම උන්වහන්සේට ධර්මය දේශනා කරමි. වහන්ස, මා තුළ ඇති සයවන පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි.\"\n\n\"වහන්ස, දේවතාවන් මා වෙත පැමිණ ‘ගෘහපතිය, භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාව දේශනා කරන ලදී’ කියා පුදුම නොවන ලෙස දන්වති. මෙසේ කී කල්හි වහන්ස, මම ඒ දේවතාවන්ට මෙසේ කියමි: ‘දේවතාවනි, නුඹලා මෙය කියත්වා හෝ නොකියත්වා, භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාව දේශනා කරන ලද්දේය’ කියා. වහන්ස, දේවතාවන් මා වෙත පැමිණෙන බව හෝ මම දේවතාවන් සමඟ කතා කරන බව හේතු කොටගෙන සිතේ උඩඟු වීමක් ඇති බවක් මම නොදනිමි. වහන්ස, මා තුළ ඇති සත්වන පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි.\"\n\n\"වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ පහළ කොටසට අයත් වූ පංච ඕරම්භාගීය සංයෝජන නම් වූ ධර්මයන් අතුරෙන්, මා තුළ පහ නොකරන ලද කිසිවක් මම නොදකිමි. වහන්ස, මා තුළ ඇති අටවන පුදුම සහ ආශ්චර්යමත් ධර්මය මෙයයි. වහන්ස, මා තුළ මේ පුදුම සහ ආශ්චර්යමත් ධර්ම අට තිබේ. එහෙත් මා කුමන පුදුම සහ ආශ්චර්යමත් ධර්ම අටකින් යුක්ත යැයි භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දේ දැයි මම නොදනිමි.\"\n\nඉන්පසු ඒ භික්ෂුව විශාලාවේ උග්ග ගෘහපතියාගේ නිවසේදී පිණ්ඩපාතය ලබාගෙන, හුන් අසුනෙන් නැගිට පිටත් විය. ඉන්පසු ඒ භික්ෂුව දහවල් ආහාරයෙන් පසුව, පිණ්ඩපාතය ගෙන ආපසු පැමිණ, භාග්‍යවතුන් වහන්සේ වෙත ගියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි ඒ භික්ෂුව, විශාලාවේ උග්ග ගෘහපතියා සමඟ කළ සියලු කතාබහ භාග්‍යවතුන් වහන්සේට දැන්වීය.\n\n\"සාදු සාදු මහණ! විශාලාවේ උග්ග ගෘහපතියා මැනවින් ප්‍රකාශ කරන්නේ නම්, එසේ ප්‍රකාශ කළේය. මහණ, මා විසින් විශාලාවේ උග්ග ගෘහපතියා ප්‍රකාශ කරන ලද්දේ මේ පුදුම සහ ආශ්චර්යමත් ධර්ම අටකින්ම යුක්ත වූවෙක් වශයෙනි. මහණ, මේ පුදුම සහ ආශ්චර්යමත් ධර්ම අටකින් යුක්ත වූ විශාලාවේ උග්ග ගෘහපතියා ඔබ සිහිතබා ගනිවු.\"\n\nපළමුව.",
      "paliTitle": "Paṭhamauggasuttaṃ",
      "englishTitle": "The First Ugga Sutta",
      "sinhalaTitle": "පළමු උග්ග සූත්‍රය"
    },
    {
      "number": 22,
      "pali": "Ekaṃ samayaṃ bhagavā vajjīsu viharati hatthigāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘aṭṭhahi, bhikkhave, acchariyehi abbhutehi dhammehi samannāgataṃ uggaṃ gahapatiṃ hatthigāmakaṃ dhārethā’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi. Atha kho aññataro bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena uggassa gahapatino hatthigāmakassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho uggo gahapati hatthigāmako yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho uggaṃ gahapatiṃ hatthigāmakaṃ so bhikkhu etadavoca – ‘‘aṭṭhahi kho tvaṃ, gahapati, acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato. Katame te, gahapati, aṭṭha acchariyā abbhutā dhammā, yehi tvaṃ samannāgato bhagavatā byākato’’ti? ‘‘Na kho ahaṃ, bhante, jānāmi – katamehi aṭṭhahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākatoti. Api ca, bhante, ye me aṭṭha acchariyā abbhutā dhammā saṃvijjanti, taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, gahapatī’’ti kho so bhikkhu uggassa gahapatino hatthigāmakassa paccassosi. Uggo gahapati hatthigāmako etadavoca – ‘‘yadāhaṃ, bhante, nāgavane paricaranto bhagavantaṃ paṭhamaṃ dūratova addasaṃ; saha dassaneneva me, bhante, bhagavato cittaṃ pasīdi, surāmado ca pahīyi. Ayaṃ kho me, bhante, paṭhamo acchariyo abbhuto dhammo saṃvijjati. ‘‘So kho ahaṃ, bhante, pasannacitto bhagavantaṃ payirupāsiṃ. Tassa me bhagavā anupubbiṃ kathaṃ kathesi, seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ; kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ, nekkhamme ānisaṃsaṃ pakāsesi. Yadā maṃ bhagavā aññāsi kallacittaṃ muducittaṃ vinīvaraṇacittaṃ udaggacittaṃ pasannacittaṃ, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā taṃ pakāsesi – dukkhaṃ, samudayaṃ, nirodhaṃ, maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya; evamevaṃ kho me tasmiṃyeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’nti. So kho ahaṃ, bhante, diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṃkatho vesārajjappatto aparappaccayo satthusāsane tattheva buddhañca dhammañca saṅghañca saraṇaṃ agamāsiṃ, brahmacariyapañcamāni ca sikkhāpadāni samādiyiṃ. Ayaṃ kho me, bhante, dutiyo acchariyo abbhuto dhammo saṃvijjati. ‘‘Tassa mayhaṃ, bhante, catasso komāriyo pajāpatiyo ahesuṃ. Atha khvāhaṃ, bhante, yena tā pajāpatiyo tenupasaṅkamiṃ; upasaṅkamitvā tā pajāpatiyo etadavacaṃ – ‘mayā kho, bhaginiyo, brahmacariyapañcamāni sikkhāpadāni samādinnāni. Yā icchati sā idheva bhoge ca bhuñjatu puññāni ca karotu, sakāni vā ñātikulāni gacchatu. Hoti vā pana purisādhippāyo, kassa vo dammī’ti? Evaṃ vutte sā, bhante, jeṭṭhā pajāpati maṃ etadavoca – ‘itthannāmassa maṃ, ayyaputta, purisassa dehī’ti. Atha kho ahaṃ, bhante, taṃ purisaṃ pakkosāpetvā vāmena hatthena pajāpatiṃ gahetvā dakkhiṇena hatthena bhiṅgāraṃ gahetvā tassa purisassa oṇojesiṃ. Komāriṃ kho panāhaṃ, bhante, dāraṃ pariccajanto nābhijānāmi cittassa aññathattaṃ. Ayaṃ kho me, bhante, tatiyo acchariyo abbhuto dhammo saṃvijjati. ‘‘Saṃvijjanti kho pana me, bhante, kule bhogā. Te ca kho appaṭivibhattā sīlavantehi kalyāṇadhammehi. Ayaṃ kho me, bhante, catuttho acchariyo abbhuto dhammo saṃvijjati. ‘‘Yaṃ kho panāhaṃ, bhante, bhikkhuṃ payirupāsāmi; sakkaccaṃyeva payirupāsāmi, no asakkaccaṃ. So ce me āyasmā dhammaṃ deseti; sakkaccaṃyeva suṇomi, no asakkaccaṃ. No ce me so āyasmā dhammaṃ deseti, ahamassa dhammaṃ desemi. Ayaṃ kho me, bhante, pañcamo acchariyo abbhuto dhammo saṃvijjati. ‘‘Anacchariyaṃ kho pana, bhante, saṅghe nimantite devatā upasaṅkamitvā ārocenti – ‘asuko, gahapati, bhikkhu ubhatobhāgavimutto asuko paññāvimutto asuko kāyasakkhī asuko diṭṭhippatto [diṭṭhappatto (ka.)] asuko saddhāvimutto asuko dhammānusārī asuko saddhānusārī asuko sīlavā kalyāṇadhammo asuko dussīlo pāpadhammo’ti. Saṅghaṃ kho panāhaṃ, bhante, parivisanto nābhijānāmi evaṃ cittaṃ uppādento – ‘imassa vā thokaṃ demi imassa vā bahuka’nti. Atha khvāhaṃ, bhante, samacittova demi. Ayaṃ kho me, bhante, chaṭṭho acchariyo abbhuto dhammo saṃvijjati. ‘‘Anacchariyaṃ kho pana maṃ, bhante, devatā upasaṅkamitvā ārocenti – ‘svākkhāto, gahapati, bhagavatā dhammo’ti. Evaṃ vutte ahaṃ, bhante, tā devatā evaṃ vademi – ‘vadeyyātha vā evaṃ kho tumhe devatā no vā vadeyyātha, atha kho svākkhāto bhagavatā dhammo’ti. Na kho panāhaṃ, bhante, abhijānāmi tatonidānaṃ cittassa unnatiṃ – ‘maṃ tā devatā upasaṅkamanti, ahaṃ vā devatāhi saddhiṃ sallapāmī’ti. Ayaṃ kho me, bhante, sattamo acchariyo abbhuto dhammo saṃvijjati. ‘‘Sace kho panāhaṃ, bhante, bhagavato paṭhamataraṃ kālaṃ kareyyaṃ, anacchariyaṃ kho panetaṃ yaṃ maṃ bhagavā evaṃ byākareyya – ‘natthi taṃ saṃyojanaṃ yena saṃyutto uggo gahapati hatthigāmako puna imaṃ lokaṃ āgaccheyyā’ti. Ayaṃ kho me, bhante, aṭṭhamo acchariyo abbhuto dhammo saṃvijjati. Ime kho me, bhante, aṭṭha acchariyā abbhutā dhammā saṃvijjanti. Na ca kho ahaṃ jānāmi – katamehi cāhaṃ aṭṭhahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato’’ti. ‘‘Atha kho so bhikkhu uggassa gahapatino hatthigāmakassa nivesane piṇḍapātaṃ gahetvā uṭṭhāyāsanā pakkāmi. Atha kho so bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu yāvatako ahosi uggena gahapatinā hatthigāmakena saddhiṃ kathāsallāpo, taṃ sabbaṃ bhagavato ārocesi. ‘‘Sādhu sādhu, bhikkhu! Yathā taṃ uggo gahapati hatthigāmako sammā byākaramāno byākareyya, imeheva kho bhikkhu, aṭṭhahi acchariyehi abbhutehi dhammehi samannāgato uggo gahapati hatthigāmako mayā byākato. Imehi ca pana, bhikkhu, aṭṭhahi acchariyehi abbhutehi dhammehi samannāgataṃ uggaṃ gahapatiṃ hatthigāmakaṃ dhārehī’’ti. Dutiyaṃ.",
      "english": "At one time the Blessed One was staying among the Vajjians in Hatthigāma. There the Blessed One addressed the bhikkhus: “Bhikkhus, remember Ugga, the householder of Hatthigāma, as one endowed with eight wonderful and amazing qualities.” This is what the Blessed One said. Having said this, the Fortunate One rose from his seat and entered the monastery. Then, a certain bhikkhu, having dressed in the morning and taken his bowl and robe, went to the residence of Ugga, the householder of Hatthigāma; having approached, he sat down on the seat prepared for him. Then Ugga, the householder of Hatthigāma, approached that bhikkhu; having approached, he paid homage to that bhikkhu and sat down to one side. To Ugga, the householder of Hatthigāma, who was sitting to one side, that bhikkhu said this: “Householder, the Blessed One has declared you to be endowed with eight wonderful and amazing qualities. What, householder, are those eight wonderful and amazing qualities with which you are endowed, as declared by the Blessed One?” “Indeed, venerable sir, I do not know with which eight wonderful and amazing qualities I have been declared by the Blessed One to be endowed. But, venerable sir, hear those eight wonderful and amazing qualities that exist in me; pay careful attention, I will speak.” “Yes, householder,” replied that bhikkhu to Ugga, the householder of Hatthigāma. Ugga, the householder of Hatthigāma, said this: “When, venerable sir, I first saw the Blessed One from afar while traveling in Nāgavana, immediately upon seeing him, venerable sir, my mind became clear and joyful, and my intoxication with liquor ceased. This, venerable sir, is the first wonderful and amazing quality that exists in me.”\n\n“So then, venerable sir, with a mind made clear and joyful, I attended upon the Blessed One. To me, the Blessed One delivered a gradual discourse, that is to say, a discourse on giving, a discourse on morality, a discourse on heaven; he explained the drawbacks, the degradation, the defilement of sensual pleasures, and the benefits of renunciation. When the Blessed One perceived my mind to be ready, pliable, free from hindrances, elevated, and clear, then he expounded the teaching peculiar to the Buddhas: suffering, its origin, its cessation, and the path. Just as a clean cloth, free from stains, readily absorbs dye, even so, right on that very seat, there arose in me the dust-free, stain-free Dhamma-eye: ‘Whatever is of the nature to arise, all that is of the nature to cease.’ Then, venerable sir, having seen the Dhamma, attained the Dhamma, understood the Dhamma, penetrated the Dhamma, having overcome doubt, shed perplexity, gained confidence, and become independent of others in the Teacher’s Dispensation, right there I went for refuge to the Buddha, the Dhamma, and the Saṅgha, and I undertook the training rules that have celibacy as the fifth. This, venerable sir, is the second wonderful and amazing quality that exists in me.”\n\n“To me, venerable sir, there were four young wives. Then, venerable sir, I approached those wives; having approached, I said to those wives: ‘Sisters, I have undertaken the training rules that have celibacy as the fifth. Whoever wishes may enjoy wealth here and make merit, or she may go to her own family. Or if there is a man she prefers, to whom should I give you?’ When this was said, venerable sir, my eldest wife said to me: ‘Give me, dear sir, to such-and-such a man.’ Then, venerable sir, I had that man called, and holding my wife with my left hand, and taking a water pitcher with my right hand, I bestowed her upon that man. And, venerable sir, when giving away my young wife, I am not aware of any change in my mind. This, venerable sir, is the third wonderful and amazing quality that exists in me.”\n\n“Furthermore, venerable sir, there are riches in my household. And these are shared without reservation with the virtuous and those of good conduct. This, venerable sir, is the fourth wonderful and amazing quality that exists in me.”\n\n“And furthermore, venerable sir, when I attend upon a bhikkhu, I attend upon him respectfully, not disrespectfully. If that venerable one teaches me the Dhamma, I listen respectfully, not disrespectfully. If that venerable one does not teach me the Dhamma, I teach him the Dhamma. This, venerable sir, is the fifth wonderful and amazing quality that exists in me.”\n\n“And it is not uncommon, venerable sir, that when the Saṅgha is invited, devas come and inform me: ‘Householder, such-and-such a bhikkhu is liberated in both ways, such-and-such is liberated through wisdom, such-and-such is a body-witness, such-and-such has attained vision, such-and-such is liberated through faith, such-and-such is a Dhamma-follower, such-and-such is a faith-follower, such-and-such is virtuous and of good conduct, such-and-such is unvirtuous and of bad conduct.’ And venerable sir, when I serve the Saṅgha, I am not aware of generating such a thought as: ‘I will give a little to this one, or a lot to that one.’ Rather, venerable sir, I give with an equal mind. This, venerable sir, is the sixth wonderful and amazing quality that exists in me.”\n\n“And it is not uncommon, venerable sir, that devas come and inform me: ‘Well-expounded, householder, is the Dhamma by the Blessed One.’ When this is said, venerable sir, I say to those devas: ‘Whether you devas say this or not, still the Dhamma is well-expounded by the Blessed One.’ And venerable sir, I am not aware of any elation of mind on account of that—that ‘those devas approach me, or that I converse with devas.’ This, venerable sir, is the seventh wonderful and amazing quality that exists in me.”\n\n“And if, venerable sir, I were to pass away before the Blessed One, it would be no surprise if the Blessed One were to declare concerning me: ‘There is no fetter by which Ugga, the householder of Hatthigāma, is bound, that would bring him back to this world again.’ This, venerable sir, is the eighth wonderful and amazing quality that exists in me. These, venerable sir, are the eight wonderful and amazing qualities that exist in me. Yet I do not know with which eight wonderful and amazing qualities I have been declared by the Blessed One to be endowed.”\n\nThen that bhikkhu, having received alms food at the residence of Ugga, the householder of Hatthigāma, rose from his seat and departed. Then that bhikkhu, having returned from his alms round after his meal, approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, that bhikkhu reported to the Blessed One the entire conversation he had had with Ugga, the householder of Hatthigāma. “Excellent, excellent, bhikkhu! Just as Ugga, the householder of Hatthigāma, would correctly explain, so too, bhikkhu, Ugga, the householder of Hatthigāma, has been declared by me to be endowed with these very eight wonderful and amazing qualities. Therefore, bhikkhu, remember Ugga, the householder of Hatthigāma, as one endowed with these eight wonderful and amazing qualities.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වජ්ජීන් අතර හත්ථිග්‍රාමයේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: “මහණෙනි, හත්ථිග්‍රාමක උග්ග ගෘහපති අට අශ්චර්ය අද්භූත ධර්මයන්ගෙන් සමන්විත යැයි සිහි තබා ගන්න.” භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගතයන් වහන්සේ ආසනයෙන් නැගිට විහාරයට වැඩිය සේක.\n\nඑවිට එක්තරා භික්ෂුවක් පෙරවරුවේ සිවුරු පොරවා, පාත්‍ර සිවුරු රැගෙන, හත්ථිග්‍රාමක උග්ග ගෘහපතිගේ නිවස වෙත වැඩම කළේය. වැඩම කොට පනවන ලද අසුනක වැඩ සිටියේය. එවිට හත්ථිග්‍රාමක උග්ග ගෘහපති, ඒ භික්ෂුව වැඩ සිටි තැනට පැමිණියේය. පැමිණ ඒ භික්ෂුවට වැඳ එකත්පස්ව හිඳගත්තේය. එකත්පස්ව හිඳ සිටි හත්ථිග්‍රාමක උග්ග ගෘහපතිට ඒ භික්ෂුව මෙසේ කීවේය: “ගෘහපතිය, භාග්‍යවතුන් වහන්සේ ඔබ අට අශ්චර්ය අද්භූත ධර්මයන්ගෙන් සමන්විත යැයි ප්‍රකාශ කළ සේක. ගෘහපතිය, භාග්‍යවතුන් වහන්සේ ඔබ සමන්විත යැයි ප්‍රකාශ කළ ඒ අට අශ්චර්ය අද්භූත ධර්ම කවරේද?” “පින්වතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ මා කවර අට අශ්චර්ය අද්භූත ධර්මයන්ගෙන් සමන්විත යැයි ප්‍රකාශ කළ සේක්දැයි මම නොදනිමි. එහෙත් පින්වතුන් වහන්ස, මා තුළ පවතින අට අශ්චර්ය අද්භූත ධර්මයන් අසන්න, මනාකොට මෙනෙහි කරන්න; මම කියමි.” “එසේය, ගෘහපතිය,” යැයි ඒ භික්ෂුව හත්ථිග්‍රාමක උග්ග ගෘහපතිට පිළිතුරු දුන්නේය. හත්ථිග්‍රාමක උග්ග ගෘහපති මෙසේ කීවේය:\n\n“පින්වතුන් වහන්ස, මම නාගවනයේ හැසිරෙද්දී භාග්‍යවතුන් වහන්සේ මුලින්ම දුරදීම දුටුවෙමි. පින්වතුන් වහන්ස, දුටු සැණින්ම භාග්‍යවතුන් වහන්සේ කෙරෙහි මගේ සිත පහන් විය, සුරා මදයද පහ විය. පින්වතුන් වහන්ස, මා තුළ පවතින පළමු වන අශ්චර්ය අද්භූත ධර්මය මෙයයි.\n\nපින්වතුන් වහන්ස, පහන් වූ සිතින් මම භාග්‍යවතුන් වහන්සේට උවටන් කළෙමි. ඒ මට භාග්‍යවතුන් වහන්සේ අනුපූර්ව කතාවක් වදාළ සේක. එනම්, දාන කතාව, ශීල කතාව, ස්වර්ග කතාවයි. කාමයන්ගේ ආදීනවය, අශුචි බව, කෙලෙස් බවද, නෛෂ්ක්‍රම්‍යයේ ආනිසංසයද ප්‍රකාශ කළ සේක. භාග්‍යවතුන් වහන්සේ මගේ සිත සුදුසු බව, මෘදු බව, නීවරණ රහිත බව, ප්‍රීතිමත් බව, පහන් බව දැනගත් විට, බුදුවරුන්ගේ අතිශයින් උතුම් වූ ධර්ම දේශනාව, එනම් දුක, සමුදය, නිරෝධය, මාර්ගය ප්‍රකාශ කළ සේක. යම්සේ කිලුටු රහිත පිරිසිදු වස්ත්‍රයක් මනාව පැහැ ගන්නේද, එසේම ඒ ආසනයේම මා තුළ විරජස් වූ, විතමල වූ ධර්ම චක්ෂුව පහළ විය: ‘යම් කිසි හටගන්නා ධර්මයක් වේද, ඒ සියල්ල නැති වන්නා වූ ධර්මයකි’ යනුයි. පින්වතුන් වහන්ස, ධර්මය දැක්කේ, ධර්මයට පැමිණියේ, ධර්මය අවබෝධ කළේ, ධර්මය ප්‍රත්‍යක්ෂ කළේ, සැකයෙන් එතෙර වූයේ, කතාබහ දුරු කළේ, විශාරදභාවයට පත් වූයේ, ගුරු ශාසනයෙහි අන්‍යයන් මත නොරඳන මා ඒ මොහොතේදීම බුදුන්, දහම්, සඟුන් සරණ ගියෙමි. පස්වෙනි කොට බ්‍රහ්මචාරී වන ශික්ෂා පදද සමාදන් වීමි. පින්වතුන් වහන්ස, මා තුළ පවතින දෙවන අශ්චර්ය අද්භූත ධර්මය මෙයයි.\n\nපින්වතුන් වහන්ස, මට කුමාරිකාවන් වූ භාර්යාවෝ සතර දෙනෙක් සිටියෝය. පින්වතුන් වහන්ස, එවිට මම ඒ භාර්යාවන් වෙත ගියෙමි. ගොස් ඒ භාර්යාවන්ට මෙසේ කීවෙමි: ‘සහෝදරියනි, මා විසින් පස්වෙනි කොට බ්‍රහ්මචාරී වන ශික්ෂා පද සමාදන් කරගන්නා ලදී. යමෙක් කැමති නම්, මෙහිදීම භෝග සම්පත් භුක්ති විඳින්නද, පින් ද කරන්නද; එසේ නැත්නම් තම නෑදෑ ගෙවල්වලට යන්නද. නැතහොත් පුරුෂයෙකු කෙරෙහි කැමැත්තක් ඇත්නම්, කවරෙකුටද මා දෙන්නේ?’ මෙසේ පැවසූ විට පින්වතුන් වහන්ස, ඒ වැඩිමහල් භාර්යාව මට මෙසේ කීවාය: ‘අයියපුත්ත, අසුවල් නම් වූ පුරුෂයාට මාව දෙන්න’ කියාය. පින්වතුන් වහන්ස, එවිට මම ඒ පුරුෂයා කැඳවාගෙන, වම් අතින් භාර්යාව අල්ලාගෙන, දකුණු අතින් කිල්ලෝටයක් ගෙන ඒ පුරුෂයාට භාර දුන්නෙමි. පින්වතුන් වහන්ස, කුමාරිකා භාර්යාවක් පරිත්‍යාග කරද්දී සිතේ වෙනසක් වූ බව මට මතක නැත. පින්වතුන් වහන්ස, මා තුළ පවතින තුන්වන අශ්චර්ය අද්භූත ධර්මය මෙයයි.\n\nපින්වතුන් වහන්ස, මාගේ කුලයේ භෝග සම්පත් පවතී. ඒවා සිල්වත් කල්‍යාණ ධර්ම ඇත්තවුන් සමග නොබෙදා දෙන්නා වූ ඒවාය. පින්වතුන් වහන්ස, මා තුළ පවතින සිව්වන අශ්චර්ය අද්භූත ධර්මය මෙයයි.\n\nපින්වතුන් වහන්ස, යම් භික්ෂුවකට මම උවටන් කරමිද, ගෞරවයෙන්ම උවටන් කරමි, අගෞරවයෙන් නොවේ. ඒ ආයුෂ්මත් තෙරුන් මට ධර්ම දේශනා කරයි නම්, ගෞරවයෙන්ම අසමි, අගෞරවයෙන් නොවේ. ඒ ආයුෂ්මත් තෙරුන් මට ධර්ම දේශනා නොකරයි නම්, මම ඔහුට ධර්ම දේශනා කරමි. පින්වතුන් වහන්ස, මා තුළ පවතින පස්වන අශ්චර්ය අද්භූත ධර්මය මෙයයි.\n\nපින්වතුන් වහන්ස, සංඝයා වහන්සේලාට ආරාධනා කළ විට දෙවිවරු පැමිණ ‘ගෘහපතිය, අසුවල් භික්ෂුව උභතෝභාග විමුක්තය, අසුවල් භික්ෂුව ප්‍රඥා විමුක්තය, අසුවල් භික්ෂුව කායසක්ඛීය, අසුවල් භික්ෂුව දිට්ඨිප්පත්තය, අසුවල් භික්ෂුව සද්ධා විමුක්තය, අසුවල් භික්ෂුව ධම්මානුසාරීය, අසුවල් භික්ෂුව සද්ධානුසාරීය, අසුවල් භික්ෂුව සීලවන්තය, කල්‍යාණ ධර්ම ඇත්තෙකි, අසුවල් භික්ෂුව දුශ්ශීලය, පාපධර්ම ඇත්තෙකි’ යැයි දැනුම් දීම ආශ්චර්යයක් නොවේ. එහෙත් පින්වතුන් වහන්ස, සංඝයා වහන්සේට දන් දෙද්දී ‘මේ භික්ෂුවට ටිකක් දෙමි, මේ භික්ෂුවට වැඩියෙන් දෙමි’ යැයි මෙබඳු සිතක් ඇතිකරගන්නා බවක් මට මතක නැත. එහෙත් පින්වතුන් වහන්ස, මම සම සිතිනි දෙමි. පින්වතුන් වහන්ස, මා තුළ පවතින සයවන අශ්චර්ය අද්භූත ධර්මය මෙයයි.\n\nපින්වතුන් වහන්ස, දෙවිවරු පැමිණ මට ‘ගෘහපතිය, භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාකොට දේශනා කර ඇත’ යැයි දැනුම් දීම ආශ්චර්යයක් නොවේ. මෙසේ පැවසූ විට පින්වතුන් වහන්ස, මම ඒ දෙවිවරුන්ට මෙසේ කියමි: ‘නුඹලා දෙවිවරු එසේ කියන්න හෝ නොකියන්න, කෙසේ වෙතත් භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාකොට දේශනා කර ඇත’ කියාය. එහෙත් පින්වතුන් වහන්ස, ‘මා වෙත ඒ දෙවිවරු පැමිණෙති, නැතහොත් මම දෙවිවරුන් සමග කතාබහ කරමි’ යැයි එයින් සිතේ උදම් වීමක් වූ බව මට මතක නැත. පින්වතුන් වහන්ස, මා තුළ පවතින සත්වන අශ්චර්ය අද්භූත ධර්මය මෙයයි.\n\nපින්වතුන් වහන්ස, යම් හෙයකින් මම භාග්‍යවතුන් වහන්සේට පෙර කාලක්‍රියා කරන්නේ නම්, ‘හත්ථිග්‍රාමක උග්ග ගෘහපති යම් සංයෝජනයකින් බැඳී නැවත මේ ලොවට එන්නේය’ යැයි භාග්‍යවතුන් වහන්සේ මා ගැන මෙසේ ප්‍රකාශ කරන්නේ නම් එය ආශ්චර්යයක් නොවේ. පින්වතුන් වහන්ස, මා තුළ පවතින අටවන අශ්චර්ය අද්භූත ධර්මය මෙයයි. පින්වතුන් වහන්ස, මේ අෂ්ටාශ්චර්ය අද්භූත ධර්මයන් මා තුළ පවතී. එහෙත් මා කවර අට අශ්චර්ය අද්භූත ධර්මයන්ගෙන් සමන්විත යැයි භාග්‍යවතුන් වහන්සේ ප්‍රකාශ කළ සේක්දැයි මම නොදනිමි.”\n\nඑවිට ඒ භික්ෂුව හත්ථිග්‍රාමක උග්ග ගෘහපතිගේ නිවසේ පිණ්ඩපාතය රැගෙන ආසනයෙන් නැගිට පිටත් විය. එවිට ඒ භික්ෂුව දානය වැළඳීමෙන් පසු පිණ්ඩපාතයෙන් ආපසු පැමිණ භාග්‍යවතුන් වහන්සේ වෙත වැඩම කළේය. වැඩම කොට භාග්‍යවතුන් වහන්සේට වැඳ එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂුව හත්ථිග්‍රාමක උග්ග ගෘහපති සමග වූ සියලු කතාබහ භාග්‍යවතුන් වහන්සේට දැන්වීය.\n\n“ඉතා හොඳයි, ඉතා හොඳයි මහණෙනි! හත්ථිග්‍රාමක උග්ග ගෘහපති නිවැරදිව ප්‍රකාශ කරන ආකාරයටම, මහණෙනි, මේ අට අශ්චර්ය අද්භූත ධර්මයන්ගෙන් සමන්විත යැයි හත්ථිග්‍රාමක උග්ග ගෘහපති මා විසින් ප්‍රකාශ කරන ලද්දේය. මහණෙනි, මේ අට අශ්චර්ය අද්භූත ධර්මයන්ගෙන් සමන්විත උග්ග ගෘහපතිව සිහි තබා ගන්න.”",
      "paliTitle": "Dutiyauggasuttaṃ",
      "englishTitle": "The Second Ugga Sutta",
      "sinhalaTitle": "දෙවන උග්ග සූත්‍රය"
    },
    {
      "number": 23,
      "pali": "Ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati aggāḷave cetiye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘sattahi, bhikkhave, acchariyehi abbhutehi dhammehi samannāgataṃ hatthakaṃ āḷavakaṃ dhāretha. Katamehi sattahi? Saddho hi, bhikkhave, hatthako āḷavako; sīlavā, bhikkhave, hatthako āḷavako; hirīmā, bhikkhave, hatthako āḷavako; ottappī, bhikkhave, hatthako āḷavako; bahussuto, bhikkhave, hatthako āḷavako; cāgavā, bhikkhave, hatthako āḷavako; paññavā, bhikkhave, hatthako āḷavako – imehi kho, bhikkhave, sattahi acchariyehi abbhutehi dhammehi samannāgataṃ hatthakaṃ āḷavakaṃ dhārethā’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi. Atha kho aññataro bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena hatthakassa āḷavakassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho hatthako āḷavako yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho hatthakaṃ āḷavakaṃ so bhikkhu etadavoca – ‘‘Sattahi kho tvaṃ, āvuso, acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato. Katamehi sattahi? ‘Saddho, bhikkhave, hatthako āḷavako; sīlavā…pe… hirimā… ottappī… bahussuto… cāgavā… paññavā, bhikkhave, hatthako āḷavako’ti. Imehi kho tvaṃ, āvuso, sattahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato’’ti. ‘‘Kaccittha, bhante, na koci gihī ahosi odātavasano’’ti? ‘‘Na hettha, āvuso, koci gihī ahosi odātavasano’’ti. ‘‘Sādhu, bhante, yadettha na koci gihī ahosi odātavasano’’ti. Atha kho so bhikkhu hatthakassa āḷavakassa nivesane piṇḍapātaṃ gahetvā uṭṭhāyāsanā pakkāmi. Atha kho so bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena hatthakassa āḷavakassa nivesanaṃ tenupasaṅkamiṃ; upasaṅkamitvā paññatte āsane nisīdiṃ. Atha kho, bhante, hatthako āḷavako yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhante, hatthakaṃ āḷavakaṃ etadavacaṃ – ‘sattahi kho tvaṃ, āvuso, acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato. Katamehi sattahi? Saddho, bhikkhave, hatthako āḷavako; sīlavā…pe… hirimā… ottappī… bahussuto… cāgavā… paññavā, bhikkhave, hatthako āḷavakoti. Imehi kho tvaṃ, āvuso, sattahi acchariyehi abbhutehi dhammehi samannāgato bhagavatā byākato’ti. ‘‘Evaṃ vutte, bhante, hatthako maṃ etadavoca – ‘kaccittha, bhante, na koci gihī ahosi odātavasano’ti? ‘Na hettha, āvuso, koci gihī ahosi odātavasano’ti. ‘Sādhu, bhante, yadettha na koci gihī ahosi odātavasano’’’ti. ‘‘Sādhu sādhu, bhikkhu! Appiccho so, bhikkhu, kulaputto. Santeyeva attani kusaladhamme na icchati parehi ñāyamāne [paññāpayamāne (ka.)]. Tena hi tvaṃ, bhikkhu, imināpi aṭṭhamena acchariyena abbhutena dhammena samannāgataṃ hatthakaṃ āḷavakaṃ dhārehi, yadidaṃ appicchatāyā’’ti. Tatiyaṃ.",
      "english": "Once the Blessed One was staying in Āḷavī, at the Aggāḷava shrine. There the Blessed One addressed the bhikkhus, \"Bhikkhus, remember Hatthaka of Āḷavī as endowed with seven wonderful and amazing qualities. Which seven? Bhikkhus, Hatthaka of Āḷavī is a man of faith; Bhikkhus, Hatthaka of Āḷavī is virtuous; Bhikkhus, Hatthaka of Āḷavī is conscientious; Bhikkhus, Hatthaka of Āḷavī is heedful; Bhikkhus, Hatthaka of Āḷavī is learned; Bhikkhus, Hatthaka of Āḷavī is generous; Bhikkhus, Hatthaka of Āḷavī is wise. Bhikkhus, remember Hatthaka of Āḷavī as endowed with these seven wonderful and amazing qualities.\" This is what the Blessed One said. Having said this, the Sugata rose from his seat and entered his dwelling.\n\nThen, in the morning, a certain bhikkhu dressed himself, took his bowl and robe, and went to the dwelling of Hatthaka of Āḷavī; having gone there, he sat down on the seat prepared for him. Then Hatthaka of Āḷavī went to where that bhikkhu was; having gone there, he paid homage to that bhikkhu and sat down to one side. As Hatthaka of Āḷavī was sitting to one side, that bhikkhu said to him, \"Friend, the Blessed One has declared you to be endowed with seven wonderful and amazing qualities. Which seven? 'Bhikkhus, Hatthaka of Āḷavī is a man of faith; virtuous; conscientious; heedful; learned; generous; wise.' Friend, the Blessed One has declared you to be endowed with these seven wonderful and amazing qualities.\" \"Venerable sir, was there no layperson in white clothes present there?\" \"No, friend, there was no layperson in white clothes present there.\" \"It is good, venerable sir, that no layperson in white clothes was present there.\" Then that bhikkhu, having received alms food at Hatthaka of Āḷavī's dwelling, rose from his seat and departed.\n\nThen, after his meal, having returned from his alms round, that bhikkhu went to where the Blessed One was; having gone there, he paid homage to the Blessed One and sat down to one side. As he was sitting to one side, that bhikkhu said to the Blessed One, \"Here, venerable sir, in the morning, I dressed myself, took my bowl and robe, and went to the dwelling of Hatthaka of Āḷavī; having gone there, I sat down on the seat prepared for me. Then, venerable sir, Hatthaka of Āḷavī came to where I was; having gone there, he paid homage to me and sat down to one side. As he was sitting to one side, venerable sir, I said to Hatthaka of Āḷavī, 'Friend, the Blessed One has declared you to be endowed with seven wonderful and amazing qualities. Which seven? Bhikkhus, Hatthaka of Āḷavī is a man of faith; virtuous; conscientious; heedful; learned; generous; wise. Friend, the Blessed One has declared you to be endowed with these seven wonderful and amazing qualities.' When I said this, venerable sir, Hatthaka said to me, 'Venerable sir, was there no layperson in white clothes present there?' 'No, friend, there was no layperson in white clothes present there.' 'It is good, venerable sir, that no layperson in white clothes was present there.'\"\n\n\"Excellent, excellent, bhikkhu! That young man of good family is of few desires. He does not wish for his wholesome qualities, which are present in him, to be known by others. Therefore, bhikkhu, remember Hatthaka of Āḷavī as endowed with this eighth wonderful and amazing quality as well: that is, being of few desires.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ආළවියෙහි අග්ගාළව නම් චේතියෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, පුදුම සහ විශ්මයජනක වූ කරුණු සතකින් යුක්ත වූ ආළවක හත්ථක ගෘහපතියා සිහි කර තබාගන්න. ඒ සත කුමක්ද? මහණෙනි, ආළවක හත්ථක ශ්‍රද්ධාවෙන් යුක්ත ය; මහණෙනි, ආළවක හත්ථක සිල්වත් ය; මහණෙනි, ආළවක හත්ථක හිරි ඇති ය; මහණෙනි, ආළවක හත්ථක ඔතප් ඇති ය; මහණෙනි, ආළවක හත්ථක බහුශ්‍රැත ය; මහණෙනි, ආළවක හත්ථක ත්‍යාගශීලී ය; මහණෙනි, ආළවක හත්ථක ප්‍රඥාවන්ත ය. මහණෙනි, මේ පුදුම සහ විශ්මයජනක වූ කරුණු සතින් යුක්ත වූ ආළවක හත්ථක ගෘහපතියා සිහි කර තබාගන්න.” භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගතයන් වහන්සේ මෙය වදාළ පසු ආසනයෙන් නැඟිට විහාරයට වැඩිය සේක.\n\nඉක්බිති එක්තරා භික්ෂුවක් පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන ආළවක හත්ථකගේ නිවස වෙත වැඩියේ ය; එහි ගොස් පනවන ලද අසුනෙහි වැඩසිටියේ ය. එවිට ආළවක හත්ථක ඒ භික්ෂුව සිටි තැනට පැමිණියේ ය; එහි පැමිණ ඒ භික්ෂුවට ආචාර කර එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ආළවක හත්ථක හට ඒ භික්ෂුව මෙය කීවේ ය: “ඇවැත්නි, පුදුම සහ විශ්මයජනක වූ කරුණු සතකින් යුක්ත බව භාග්‍යවතුන් වහන්සේ විසින් ඔබ ගැන ප්‍රකාශ කරන ලදී. ඒ සත කුමක්ද? ‘මහණෙනි, ආළවක හත්ථක ශ්‍රද්ධාවෙන් යුක්ත ය; සිල්වත් ය; හිරි ඇති ය; ඔතප් ඇති ය; බහුශ්‍රැත ය; ත්‍යාගශීලී ය; ප්‍රඥාවන්ත ය’ යනුවෙනි. ඇවැත්නි, මේ පුදුම සහ විශ්මයජනක වූ කරුණු සතින් යුක්ත බව භාග්‍යවතුන් වහන්සේ විසින් ඔබ ගැන ප්‍රකාශ කරන ලදී.” “ස්වාමීනි, එහි කිසිදු සුදු වස්ත්‍ර හැඳගත් ගිහියෙක් නොසිටියේ ද?” “ඇවැත්නි, එහි කිසිදු සුදු වස්ත්‍ර හැඳගත් ගිහියෙක් නොසිටියේ ය.” “ස්වාමීනි, එහි කිසිදු සුදු වස්ත්‍ර හැඳගත් ගිහියෙක් නොසිටීම ඉතා යහපත් ය.”\n\nඉක්බිති ඒ භික්ෂුව ආළවක හත්ථකගේ නිවසේ දී පිණ්ඩපාතය වළඳා, අසුනෙන් නැඟිට පිටත්ව ගියේ ය. ඉක්බිති ඒ භික්ෂුව දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් වළකින්නා වූ භාග්‍යවතුන් වහන්සේ වෙත වැඩියේ ය; එහි පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කර එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙය කීවේ ය: “ස්වාමීනි, මම මෙහි දී පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන ආළවක හත්ථකගේ නිවස වෙත ගියෙමි; එහි ගොස් පනවන ලද අසුනෙහි වැඩසිටියෙමි. එවිට ස්වාමීනි, ආළවක හත්ථක මා සිටි තැනට පැමිණියේ ය; එහි පැමිණ මට ආචාර කර එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ආළවක හත්ථක හට ස්වාමීනි, මම මෙය කීවෙමි – ‘ඇවැත්නි, පුදුම සහ විශ්මයජනක වූ කරුණු සතකින් යුක්ත බව භාග්‍යවතුන් වහන්සේ විසින් ඔබ ගැන ප්‍රකාශ කරන ලදී. ඒ සත කුමක්ද? මහණෙනි, ආළවක හත්ථක ශ්‍රද්ධාවෙන් යුක්ත ය; සිල්වත් ය; හිරි ඇති ය; ඔතප් ඇති ය; බහුශ්‍රැත ය; ත්‍යාගශීලී ය; ප්‍රඥාවන්ත ය’ යනුවෙනි. ඇවැත්නි, මේ පුදුම සහ විශ්මයජනක වූ කරුණු සතින් යුක්ත බව භාග්‍යවතුන් වහන්සේ විසින් ඔබ ගැන ප්‍රකාශ කරන ලදී” යනුවෙනි. “ස්වාමීනි, මෙසේ කී කල්හි ආළවක හත්ථක මට මෙය කීවේ ය – ‘ස්වාමීනි, එහි කිසිදු සුදු වස්ත්‍ර හැඳගත් ගිහියෙක් නොසිටියේ ද?’ ‘ඇවැත්නි, එහි කිසිදු සුදු වස්ත්‍ර හැඳගත් ගිහියෙක් නොසිටියේ ය.’ ‘ස්වාමීනි, එහි කිසිදු සුදු වස්ත්‍ර හැඳගත් ගිහියෙක් නොසිටීම ඉතා යහපත් ය’” යනුවෙනි.\n\n“යහපත් ය, යහපත් ය, මහණ! මහණ, ඒ කුලපුත්‍රයා අල්පේච්ඡ ය. තමා තුළ පවතින කුසලධර්ම අනුන් විසින් දැනගනු ලබනවාට ඔහු කැමති නැත. එහෙයින් මහණ, අල්පේච්ඡ බව නම් වූ මේ අටවෙනි පුදුම සහ විශ්මයජනක වූ කරුණින් ද යුක්ත වූ ආළවක හත්ථක ගෘහපතියා සිහි කර තබාගන්න”යි වදාළ සේක.",
      "paliTitle": "Paṭhamahatthakasuttaṃ",
      "englishTitle": "The First Hatthaka Sutta",
      "sinhalaTitle": "පළමු හත්ථක සූත්‍රය"
    },
    {
      "number": 24,
      "pali": "Ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati aggāḷave cetiye. Atha kho hatthako āḷavako pañcamattehi upāsakasatehi parivuto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho hatthakaṃ āḷavakaṃ bhagavā etadavoca – ‘‘mahatī kho tyāyaṃ, hatthaka, parisā. Kathaṃ pana tvaṃ, hatthaka, imaṃ mahatiṃ parisaṃ saṅgaṇhāsī’’ti? ‘‘Yānimāni, bhante, bhagavatā desitāni [a. ni. 4.32; dī. ni. 3.313] cattāri saṅgahavatthūni, tehāhaṃ [tenāhaṃ (sī.)] imaṃ mahatiṃ parisaṃ saṅgaṇhāmi. Ahaṃ, bhante, yaṃ jānāmi – ‘ayaṃ dānena saṅgahetabbo’ti, taṃ dānena saṅgaṇhāmi; yaṃ jānāmi – ‘ayaṃ peyyavajjena saṅgahetabbo’ti, taṃ peyyavajjena saṅgaṇhāmi; yaṃ jānāmi – ‘ayaṃ atthacariyāya saṅgahetabbo’ti, taṃ atthacariyāya saṅgaṇhāmi; yaṃ jānāmi – ‘ayaṃ samānattatāya saṅgahetabbo’ti, taṃ samānattatāya saṅgaṇhāmi. Saṃvijjanti kho pana me, bhante, kule bhogā. Daliddassa kho no tathā sotabbaṃ maññantī’’ti. ‘‘Sādhu sādhu, hatthaka! Yoni kho tyāyaṃ, hatthaka, mahatiṃ parisaṃ saṅgahetuṃ. Ye hi keci, hatthaka, atītamaddhānaṃ mahatiṃ parisaṃ saṅgahesuṃ, sabbe te imeheva catūhi saṅgahavatthūhi mahatiṃ parisaṃ saṅgahesuṃ. Yepi hi keci, hatthaka, anāgatamaddhānaṃ mahatiṃ parisaṃ saṅgaṇhissanti, sabbe te imeheva catūhi saṅgahavatthūhi mahatiṃ parisaṃ saṅgaṇhissanti. Yepi hi keci, hatthaka, etarahi mahatiṃ parisaṃ saṅgaṇhanti, sabbe te imeheva catūhi saṅgahavatthūhi mahatiṃ parisaṃ saṅgaṇhantī’’ti. Atha kho hatthako āḷavako bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā acirapakkante hatthake āḷavake bhikkhū āmantesi – ‘‘aṭṭhahi, bhikkhave, acchariyehi abbhutehi dhammehi samannāgataṃ hatthakaṃ āḷavakaṃ dhāretha. Katamehi aṭṭhahi? Saddho, bhikkhave, hatthako āḷavako; sīlavā, bhikkhave…pe… hirīmā… ottappī… bahussuto… cāgavā… paññavā, bhikkhave, hatthako āḷavako; appiccho, bhikkhave, hatthako āḷavako. Imehi kho, bhikkhave, aṭṭhahi acchariyehi abbhutehi dhammehi samannāgataṃ hatthakaṃ āḷavakaṃ dhārethā’’ti. Catutthaṃ.",
      "english": "One time, the Blessed One was dwelling in Āḷavī, at the Aggāḷava shrine. Then Hatthaka of Āḷavī, accompanied by about five hundred lay followers, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. To Hatthaka of Āḷavī, who was sitting to one side, the Blessed One said, \"Hatthaka, this assembly of yours is very large. How then, Hatthaka, do you keep this large assembly together?\"\n\n\"Venerable sir, I keep this large assembly together by means of the four bases of communal amity taught by the Blessed One. Venerable sir, when I know, 'This one should be kept together by giving,' I keep him together by giving. When I know, 'This one should be kept together by kindly speech,' I keep him together by kindly speech. When I know, 'This one should be kept together by beneficial conduct,' I keep him together by beneficial conduct. When I know, 'This one should be kept together by impartiality,' I keep him together by impartiality. Moreover, Venerable sir, there are riches in my family. Poor people are not regarded as worthy of being listened to in the same way.\"\n\n\"Excellent, excellent, Hatthaka! This is indeed the way, Hatthaka, to keep a large assembly together. For whatsoever people, Hatthaka, in the past kept a large assembly together, all of them kept that large assembly together by means of these same four bases of communal amity. And whatsoever people, Hatthaka, in the future will keep a large assembly together, all of them will keep that large assembly together by means of these same four bases of communal amity. And whatsoever people, Hatthaka, at present keep a large assembly together, all of them keep that large assembly together by means of these same four bases of communal amity.\"\n\nThen Hatthaka of Āḷavī, having been instructed, incited, uplifted, and gladdened by the Blessed One with a Dhamma talk, rose from his seat, paid homage to the Blessed One, circumambulated him with his right side towards him, and departed. Then, not long after Hatthaka of Āḷavī had departed, the Blessed One addressed the bhikkhus, \"Bhikkhus, remember Hatthaka of Āḷavī as endowed with eight astonishing and wonderful qualities. Which eight? Bhikkhus, Hatthaka of Āḷavī is faithful; bhikkhus, Hatthaka of Āḷavī is virtuous; bhikkhus, Hatthaka of Āḷavī is conscientious; bhikkhus, Hatthaka of Āḷavī is discreet; bhikkhus, Hatthaka of Āḷavī is learned; bhikkhus, Hatthaka of Āḷavī is generous; bhikkhus, Hatthaka of Āḷavī is wise; bhikkhus, Hatthaka of Āḷavī has few wishes. Bhikkhus, remember Hatthaka of Āḷavī as endowed with these eight astonishing and wonderful qualities.\"",
      "sinhala": "එක් සමයෙක භාග්‍ය‌වතුන් වහන්සේ ආළවියෙහි අග්ගාළව චේතියෙහි වැඩවසන සේක. ඉක්බිති ආළවක හත්ථක උපාසකයන් පන්සියයක් පමණ පිරිසක් පිරිවරා භාග්‍ය‌වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍ය‌වතුන් වහන්සේට ආචාර කොට, එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි ආළවක හත්ථක හට භාග්‍ය‌වතුන් වහන්සේ මෙසේ වදාළ සේක: “හත්ථක, ඔබට ඉතා මහත් පිරිසක් සිටී. හත්ථක, ඔබ මේ මහත් පිරිස රැස් කරගන්නේ කෙසේද?” “ස්වාමීනි, භාග්‍ය‌වතුන් වහන්සේ විසින් දේශනා කරන ලද සතර සංග්‍රහ වස්තූන් යම් ඒවා වේද, ඒ දේවල් වලින් මම මේ මහත් පිරිස රැස් කරගනිමි. ස්වාමීනි, ‘මේ තැනැත්තා දානයෙන් රැස් කරගත යුතුය’ යැයි මම යමක් දනිමි නම්, ඔහු දානයෙන් රැස් කරගනිමි; ‘මේ තැනැත්තා ප්‍රිය වචනයෙන් රැස් කරගත යුතුය’ යැයි මම යමක් දනිමි නම්, ඔහු ප්‍රිය වචනයෙන් රැස් කරගනිමි; ‘මේ තැනැත්තා අර්ථ චර්යාවෙන් රැස් කරගත යුතුය’ යැයි මම යමක් දනිමි නම්, ඔහු අර්ථ චර්යාවෙන් රැස් කරගනිමි; ‘මේ තැනැත්තා සමානාත්මතාවයෙන් රැස් කරගත යුතුය’ යැයි මම යමක් දනිමි නම්, ඔහු සමානාත්මතාවයෙන් රැස් කරගනිමි. ස්වාමීනි, මාගේ කුලයේ භෝග සම්පත් තිබේ. දුප්පත් කෙනෙකුගේ වචන ඒ තරම් අසන්නට ඔවුන් නොසිතයි.” “සාදු සාදු, හත්ථක! හත්ථක, මහත් පිරිසක් රැස් කරගැනීමට මෙය නිවැරදි ක්‍රමයයි. හත්ථක, අතීත කාලයේ යම් කිසිවෙක් මහත් පිරිසක් රැස් කරගත්තා නම්, ඒ සියල්ලෝම මේ සතර සංග්‍රහ වස්තූන්ගෙන්ම මහත් පිරිසක් රැස් කරගත්තාහුය. හත්ථක, අනාගත කාලයේ යම් කිසිවෙක් මහත් පිරිසක් රැස් කරගන්නවා නම්, ඒ සියල්ලෝම මේ සතර සංග්‍රහ වස්තූන්ගෙන්ම මහත් පිරිසක් රැස් කරගන්නවා ඇත. හත්ථක, වර්තමාන කාලයේ යම් කිසිවෙක් මහත් පිරිසක් රැස් කරගන්නවා නම්, ඒ සියල්ලෝම මේ සතර සංග්‍රහ වස්තූන්ගෙන්ම මහත් පිරිසක් රැස් කරගනිති.” ඉක්බිති ආළවක හත්ථක, භාග්‍ය‌වතුන් වහන්සේ විසින් ධර්ම කථාවකින් පෙන්වා දෙන ලද, සමාදන් කරවන ලද, උනන්දු කරවන ලද, සතුටු කරවන ලද, අසුනෙන් නැගිට, භාග්‍ය‌වතුන් වහන්සේට ආචාර කොට, ප්‍රදක්ෂිණා කොට පිටත්ව ගියේය.\n\nඉක්බිති භාග්‍ය‌වතුන් වහන්සේ ආළවක හත්ථක ගොස් වැඩි කල් නොගොස් භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, ආළවක හත්ථක අට ආකාර වූ ආශ්චර්යවත් හා අද්භූත ධර්මයන්ගෙන් සමන්විත බව සිහි තබාගන්න. ඒ අට කුමක්ද? මහණෙනි, ආළවක හත්ථක ශ්‍ර‌ද්ධාවන්තයෙකි; මහණෙනි, ඔහු සිල්වත්ය; හිරි ඇති අයෙකි; ඔතප් ඇති අයෙකි; බහුශ්‍ර‌ැතයෙකි; ත්‍යාගශීලීය; මහණෙනි, ආළවක හත්ථක ප්‍ර‌ඥාවන්තයෙකි; මහණෙනි, ආළවක හත්ථක අල්පේච්ඡයෙකි. මහණෙනි, මේ අට ආකාර වූ ආශ්චර්යවත් හා අද්භූත ධර්මයන්ගෙන් සමන්විත ආළවක හත්ථක සිහි තබාගන්න”යි. (මේ සූත්‍රය) සිව්වැනි වන්නේය.",
      "paliTitle": "Dutiyahatthakasuttaṃ",
      "englishTitle": "The Second Discourse on Hatthaka",
      "sinhalaTitle": "දෙවන හත්ථක සූත්‍\\u200Dරය"
    },
    {
      "number": 25,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo sakko bhagavantaṃ etadavoca – ‘‘kittāvatā nu kho, bhante, upāsako hotī’’ti? ‘‘Yato kho, mahānāma, buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti; ettāvatā kho, mahānāma, upāsako hotī’’ti. ‘‘Kittāvatā pana, bhante, upāsako sīlavā hotī’’ti? ‘‘Yato kho, mahānāma, upāsako pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti; ettāvatā kho, mahānāma, upāsako sīlavā hotī’’ti. ‘‘Kittāvatā pana, bhante, upāsako attahitāya paṭipanno hoti, no parahitāyā’’ti? ‘‘Yato kho, mahānāma, upāsako attanāva saddhāsampanno hoti, no paraṃ saddhāsampadāya samādapeti [samādāpeti (?)]; attanāva sīlasampanno hoti, no paraṃ sīlasampadāya samādapeti; attanāva cāgasampanno hoti, no paraṃ cāgasampadāya samādapeti; attanāva bhikkhūnaṃ dassanakāmo hoti, no paraṃ bhikkhūnaṃ dassane samādapeti; attanāva saddhammaṃ sotukāmo hoti, no paraṃ saddhammassavane samādapeti; attanāva sutānaṃ dhammānaṃ dhāraṇajātiko hoti, no paraṃ dhammadhāraṇāya samādapeti; attanāva sutānaṃ dhammānaṃ atthūpaparikkhitā hoti, no paraṃ atthūpaparikkhāya samādapeti; attanāva atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti, no paraṃ dhammānudhammappaṭipattiyā samādapeti. Ettāvatā kho, mahānāma, upāsako attahitāya paṭipanno hoti, no parahitāyā’’ti. ‘‘Kittāvatā pana, bhante, upāsako attahitāya ca paṭipanno hoti parahitāya cā’’ti? ‘‘Yato kho, mahānāma, upāsako attanā ca saddhāsampanno hoti, parañca saddhāsampadāya samādapeti; attanā ca sīlasampanno hoti, parañca sīlasampadāya samādapeti; attanā ca cāgasampanno hoti, parañca cāgasampadāya samādapeti; attanā ca bhikkhūnaṃ dassanakāmo hoti, parañca bhikkhūnaṃ dassane samādapeti; attanā ca saddhammaṃ sotukāmo hoti, parañca saddhammassavane samādapeti; attanā ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti, parañca dhammadhāraṇāya samādapeti; attanā ca sutānaṃ dhammānaṃ atthūpaparikkhitā hoti, parañca atthūpaparikkhāya samādapeti, attanā ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti, parañca dhammānudhammappaṭipattiyā samādapeti. Ettāvatā kho, mahānāma, upāsako attahitāya ca paṭipanno hoti parahitāya cā’’ti. Pañcamaṃ.",
      "english": "At one time the Blessed One was dwelling among the Sakyans at Kapilavatthu, in Nigrodha's Park. Then Mahānāma the Sakyan approached the Blessed One, and having approached and respectfully saluted him, sat down to one side. Seated to one side, Mahānāma the Sakyan said this to the Blessed One: \"To what extent, venerable sir, is one a lay follower?\" \"When, Mahānāma, one has gone for refuge to the Buddha, has gone for refuge to the Dhamma, and has gone for refuge to the Sangha, to that extent, Mahānāma, one is a lay follower.\" \"But to what extent, venerable sir, is a lay follower virtuous?\" \"When, Mahānāma, a lay follower abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from alcoholic drinks and intoxicants, which are the basis for heedlessness, to that extent, Mahānāma, a lay follower is virtuous.\" \"But to what extent, venerable sir, is a lay follower practicing for their own welfare, not for the welfare of others?\" \"When, Mahānāma, a lay follower is themselves endowed with faith but does not encourage others to be endowed with faith; is themselves endowed with virtue but does not encourage others to be endowed with virtue; is themselves endowed with generosity but does not encourage others to be endowed with generosity; is themselves desirous of seeing monks but does not encourage others to see monks; is themselves desirous of hearing the true Dhamma but does not encourage others to hear the true Dhamma; is themselves naturally inclined to remember the Dhamma they have heard but does not encourage others to remember the Dhamma; is themselves an examiner of the meaning of the Dhamma they have heard but does not encourage others to examine the meaning; is themselves practicing in accordance with the Dhamma, understanding the meaning and understanding the Dhamma, but does not encourage others to practice in accordance with the Dhamma — to that extent, Mahānāma, a lay follower is practicing for their own welfare, not for the welfare of others.\" \"But to what extent, venerable sir, is a lay follower practicing for their own welfare and for the welfare of others?\" \"When, Mahānāma, a lay follower is themselves endowed with faith and encourages others to be endowed with faith; is themselves endowed with virtue and encourages others to be endowed with virtue; is themselves endowed with generosity and encourages others to be endowed with generosity; is themselves desirous of seeing monks and encourages others to see monks; is themselves desirous of hearing the true Dhamma and encourages others to hear the true Dhamma; is themselves naturally inclined to remember the Dhamma they have heard and encourages others to remember the Dhamma; is themselves an examiner of the meaning of the Dhamma they have heard and encourages others to examine the meaning; is themselves practicing in accordance with the Dhamma, understanding the meaning and understanding the Dhamma, and encourages others to practice in accordance with the Dhamma — to that extent, Mahānāma, a lay follower is practicing for their own welfare and for the welfare of others.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශාක්‍ය දේශයෙහි කපිලවස්තු නුවර නිග්‍රෝධාරාමයෙහි වැඩවසන සේක. ඉක්බිති මහානාම ශාක්‍ය තෙමේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි මහානාම ශාක්‍ය තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීනි, කොපමණකින් නම් උපාසකයෙක් වන්නේද?”\n\n“මහානාමය, යම් කලක බුදුන් සරණ ගිය කෙනෙක් වේද, දහම් සරණ ගිය කෙනෙක් වේද, සඟුන් සරණ ගිය කෙනෙක් වේද; මහානාමය, මෙපමණකින් උපාසකයෙක් වන්නේය.” “ස්වාමීනි, කොපමණකින් නම් උපාසකයෙක් සීලවන්ත වන්නේද?”\n\n“මහානාමය, යම් කලක උපාසක තෙමේ පණ නැසීමෙන් වැළකුණේ වේද, අනුන් සතු දේ ගැනීමෙන් වැළකුණේ වේද, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණේ වේද, බොරු කීමෙන් වැළකුණේ වේද, සුරා-මිරිස් පානය හා මත් බවට කරුණු වන දෙයින් වැළකුණේ වේද; මහානාමය, මෙපමණකින් උපාසක තෙමේ සීලවන්ත වන්නේය.”\n\n“ස්වාමීනි, කොපමණකින් නම් උපාසකයෙක් තමාගේ යහපත පිණිස ප්‍රතිපදාවේ පිහිටන්නේ වේද, අනුන්ගේ යහපත පිණිස නොවේද?” “මහානාමය, යම් කලක උපාසක තෙමේ තමන් විසින්ම ශ්‍රද්ධා සම්පූර්ණ වේද, අනුන්ව ශ්‍රද්ධාවෙන් යුක්ත කිරීමට පොළඹවන්නේ නැද්ද; තමන් විසින්ම සීල සම්පූර්ණ වේද, අනුන්ව සීල සම්පූර්ණ කිරීමට පොළඹවන්නේ නැද්ද; තමන් විසින්ම ත්‍යාග සම්පූර්ණ වේද, අනුන්ව ත්‍යාග සම්පූර්ණ කිරීමට පොළඹවන්නේ නැද්ද; තමන් විසින්ම භික්ෂූන් දැකීමට කැමති වේද, අනුන්ව භික්ෂූන් දැකීමට පොළඹවන්නේ නැද්ද; තමන් විසින්ම සද්ධර්මය ශ්‍රවණය කිරීමට කැමති වේද, අනුන්ව සද්ධර්ම ශ්‍රවණයට පොළඹවන්නේ නැද්ද; තමන් විසින්ම අසන ලද දහම් දරාගන්නා ස්වභාවයෙන් යුක්ත වේද, අනුන්ව දහම් දැරීමට පොළඹවන්නේ නැද්ද; තමන් විසින්ම අසන ලද දහම්වල අර්ථ විමසන්නේ වේද, අනුන්ව අර්ථ විමසීමට පොළඹවන්නේ නැද්ද; තමන් විසින්ම අර්ථය දැන, ධර්මය දැන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටින්නේ වේද, අනුන්ව ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටුවීමට පොළඹවන්නේ නැද්ද; මහානාමය, මෙපමණකින් උපාසක තෙමේ තමාගේ යහපත පිණිස ප්‍රතිපදාවේ පිහිටන්නේ වේද, අනුන්ගේ යහපත පිණිස නොවේද.”\n\n“ස්වාමීනි, කොපමණකින් නම් උපාසකයෙක් තමාගේ යහපත පිණිසත් අනුන්ගේ යහපත පිණිසත් ප්‍රතිපදාවේ පිහිටන්නේ වේද?” “මහානාමය, යම් කලක උපාසක තෙමේ තමන් විසින්ම ශ්‍රද්ධා සම්පූර්ණ වේද, අනුන්වද ශ්‍රද්ධාවෙන් යුක්ත කිරීමට පොළඹවන්නේද; තමන් විසින්ම සීල සම්පූර්ණ වේද, අනුන්වද සීල සම්පූර්ණ කිරීමට පොළඹවන්නේද; තමන් විසින්ම ත්‍යාග සම්පූර්ණ වේද, අනුන්වද ත්‍යාග සම්පූර්ණ කිරීමට පොළඹවන්නේද; තමන් විසින්ම භික්ෂූන් දැකීමට කැමති වේද, අනුන්වද භික්ෂූන් දැකීමට පොළඹවන්නේද; තමන් විසින්ම සද්ධර්මය ශ්‍රවණය කිරීමට කැමති වේද, අනුන්වද සද්ධර්ම ශ්‍රවණයට පොළඹවන්නේද; තමන් විසින්ම අසන ලද දහම් දරාගන්නා ස්වභාවයෙන් යුක්ත වේද, අනුන්වද දහම් දැරීමට පොළඹවන්නේද; තමන් විසින්ම අසන ලද දහම්වල අර්ථ විමසන්නේ වේද, අනුන්වද අර්ථ විමසීමට පොළඹවන්නේද; තමන් විසින්ම අර්ථය දැන, ධර්මය දැන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටින්නේ වේද, අනුන්වද ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටුවීමට පොළඹවන්නේද; මහානාමය, මෙපමණකින් උපාසක තෙමේ තමාගේ යහපත පිණිසත් අනුන්ගේ යහපත පිණිසත් ප්‍රතිපදාවේ පිහිටන්නේ වේ.”",
      "paliTitle": "Mahānāmasuttaṃ",
      "englishTitle": "Mahānāma Sutta",
      "sinhalaTitle": "මහානාම සූත්‍රය"
    },
    {
      "number": 26,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati jīvakambavane. Atha kho jīvako komārabhacco yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jīvako komārabhacco bhagavantaṃ etadavoca – ‘‘kittāvatā nu kho, bhante, upāsako hotī’’ti? ‘‘Yato kho, jīvaka, buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti; ettāvatā kho jīvaka, upāsako hotī’’ti. ‘‘Kittāvatā pana, bhante, upāsako sīlavā hotī’’ti? ‘‘Yato kho, jīvaka, upāsako pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti; ettāvatā kho, jīvaka, upāsako sīlavā hotī’’ti. ‘‘Kittāvatā pana, bhante, upāsako attahitāya paṭipanno hoti, no parahitāyā’’ti? ‘‘Yato kho, jīvaka, upāsako attanāva saddhāsampanno hoti, no paraṃ saddhāsampadāya samādapeti…pe… attanāva atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti, no paraṃ dhammānudhammappaṭipattiyā samādapeti. Ettāvatā kho, jīvaka, upāsako attahitāya paṭipanno hoti, no parahitāyā’’ti. ‘‘Kittāvatā pana, bhante, upāsako attahitāya ca paṭipanno hoti parahitāya cā’’ti? ‘‘Yato kho, jīvaka, upāsako attanā ca saddhāsampanno hoti, parañca saddhāsampadāya samādapeti; attanā ca sīlasampanno hoti, parañca sīlasampadāya samādapeti; attanā ca cāgasampanno hoti, parañca cāgasampadāya samādapeti; attanā ca bhikkhūnaṃ dassanakāmo hoti, parañca bhikkhūnaṃ dassane samādapeti; attanā ca saddhammaṃ sotukāmo hoti, parañca saddhammassavane samādapeti; attanā ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti, parañca dhammadhāraṇāya samādapeti; attanā ca sutānaṃ dhammānaṃ atthūpaparikkhitā hoti, parañca atthūpaparikkhāya samādapeti; attanā ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti, parañca dhammānudhammappaṭipattiyā samādapeti. Ettāvatā kho, jīvaka, upāsako attahitāya ca paṭipanno hoti parahitāya cā’’ti. Chaṭṭhaṃ.",
      "english": "Once the Blessed One was staying in Rājagaha, in Jīvaka’s Mango Grove. Then Jīvaka the royal physician approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side.\n\nAs he sat to one side, Jīvaka the royal physician said to the Blessed One, “To what extent, Venerable Sir, is one a lay follower?”\n\n“Jīvaka, when one has gone for refuge to the Buddha, to the Dhamma, and to the Saṅgha, to that extent, Jīvaka, one is a lay follower.”\n\n“But to what extent, Venerable Sir, is a lay follower virtuous?”\n\n“Jīvaka, when a lay follower abstains from the destruction of life, ...and so on, abstains from distilled and fermented intoxicants that are a basis for heedlessness, to that extent, Jīvaka, one is a virtuous lay follower.”\n\n“But to what extent, Venerable Sir, is a lay follower practicing for their own welfare, not for the welfare of others?”\n\n“Jīvaka, when a lay follower is himself accomplished in faith, but does not encourage others to be accomplished in faith; ...and so on, up to... is himself practicing in accordance with the Dhamma after understanding the meaning and understanding the Dhamma, but does not encourage others to practice in accordance with the Dhamma. To that extent, Jīvaka, a lay follower is practicing for their own welfare, not for the welfare of others.”\n\n“But to what extent, Venerable Sir, is a lay follower practicing for their own welfare and for the welfare of others?”\n\n“Jīvaka, when a lay follower is himself accomplished in faith and encourages others to be accomplished in faith; is himself accomplished in virtue and encourages others to be accomplished in virtue; is himself accomplished in generosity and encourages others to be accomplished in generosity; has himself a desire to see monastics and encourages others to see monastics; has himself a desire to hear the true Dhamma and encourages others to hear the true Dhamma; is himself one who remembers the Dhamma he has heard and encourages others to remember the Dhamma; is himself one who examines the meaning of the Dhamma he has heard and encourages others to examine the meaning; is himself practicing in accordance with the Dhamma after understanding the meaning and understanding the Dhamma, and encourages others to practice in accordance with the Dhamma. To that extent, Jīvaka, a lay follower is practicing for their own welfare and for the welfare of others.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ජීවක අඹ වනයේ වැඩවසන සේක. ඉන්පසු ජීවක කෝමාරභච්ච තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි ජීවක කෝමාරභච්ච තෙමේ භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය – \"ස්වාමීනි, කවර කරුණු සම්පූර්ණ කිරීමෙන් උපාසකයෙක් වන්නේද?\"\n\n\"ජීවකය, යමෙක් බුදුන් සරණ ගිය කල්හි, දහම් සරණ ගිය කල්හි, සඟුන් සරණ ගිය කල්හි; ජීවකය, මෙපමණකින් උපාසකයෙක් වේ.\"\n\n\"එහෙත් ස්වාමීනි, කවර කරුණු සම්පූර්ණ කිරීමෙන් උපාසකයෙක් සිල්වත් වන්නේද?\"\n\n\"ජීවකය, යමෙක් උපාසකයෙක් වී ප්‍රාණඝාතයෙන් වැළකී සිටින්නේද, අදත්තාදානයෙන් වැළකී සිටින්නේද, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටින්නේද, මුසාවාදයෙන් වැළකී සිටින්නේද, මත්පැන් පානයෙන් සිදුවන ප්‍රමාදයට හේතුවන කරුණෙන් වැළකී සිටින්නේද; ජීවකය, මෙපමණකින් උපාසකයෙක් සිල්වත් වේ.\"\n\n\"එහෙත් ස්වාමීනි, කවර කරුණු සම්පූර්ණ කිරීමෙන් උපාසකයෙක් තම යහපත පිණිස පමණක් පිළිපදින්නෙක් වේද, අනුන්ගේ යහපත පිණිස පිළිනොපදින්නෙක් වේද?\"\n\n\"ජීවකය, යමෙක් උපාසකයෙක් වී තමාම ශ්‍රද්ධාවෙන් යුක්ත වන්නේද, අනුන් ශ්‍රද්ධා සම්පත්තියෙහි නොපිහිටුවන්නේද; තමාම ශීලයෙන් යුක්ත වන්නේද, අනුන් ශීල සම්පත්තියෙහි නොපිහිටුවන්නේද; තමාම ත්‍යාගයෙන් යුක්ත වන්නේද, අනුන් ත්‍යාග සම්පත්තියෙහි නොපිහිටුවන්නේද; තමාම භික්ෂූන් දැකීමට කැමති වන්නේද, අනුන් භික්ෂූන් දැකීමෙහි නොපිහිටුවන්නේද; තමාම සද්ධර්මය ඇසීමට කැමති වන්නේද, අනුන් සද්ධර්ම ශ්‍රවණයෙහි නොපිහිටුවන්නේද; තමාම ඇසූ ධර්මයන් දරාගන්නා ස්වභාව ඇත්තෙක් වන්නේද, අනුන් ධර්ම ධාරණයෙහි නොපිහිටුවන්නේද; තමාම ඇසූ ධර්මයන්ගේ අර්ථය විමසන සුළු වන්නේද, අනුන් අර්ථය විමසීමෙහි නොපිහිටුවන්නේද; තමාම අර්ථයද ධර්මයද දැන ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටින්නේද, අනුන් ධර්මානුධර්ම ප්‍රතිපදාවෙහි නොපිහිටුවන්නේද; ජීවකය, මෙපමණකින් උපාසකයෙක් තම යහපත පිණිස පමණක් පිළිපදින්නෙක් වේ, අනුන්ගේ යහපත පිණිස පිළිනොපදින්නෙක් වේ.\"\n\n\"එහෙත් ස්වාමීනි, කවර කරුණු සම්පූර්ණ කිරීමෙන් උපාසකයෙක් තම යහපත පිණිසද, අනුන්ගේ යහපත පිණිසද පිළිපදින්නෙක් වේද?\"\n\n\"ජීවකය, යමෙක් උපාසකයෙක් වී තමාද ශ්‍රද්ධාවෙන් යුක්ත වන්නේද, අනුන් ශ්‍රද්ධා සම්පත්තියෙහි පිහිටුවන්නේද; තමාද ශීලයෙන් යුක්ත වන්නේද, අනුන් ශීල සම්පත්තියෙහි පිහිටුවන්නේද; තමාද ත්‍යාගයෙන් යුක්ත වන්නේද, අනුන් ත්‍යාග සම්පත්තියෙහි පිහිටුවන්නේද; තමාද භික්ෂූන් දැකීමට කැමති වන්නේද, අනුන් භික්ෂූන් දැකීමෙහි පිහිටුවන්නේද; තමාද සද්ධර්මය ඇසීමට කැමති වන්නේද, අනුන් සද්ධර්ම ශ්‍රවණයෙහි පිහිටුවන්නේද; තමාද ඇසූ ධර්මයන් දරාගන්නා ස්වභාව ඇත්තෙක් වන්නේද, අනුන් ධර්ම ධාරණයෙහි පිහිටුවන්නේද; තමාද ඇසූ ධර්මයන්ගේ අර්ථය විමසන සුළු වන්නේද, අනුන් අර්ථය විමසීමෙහි පිහිටුවන්නේද; තමාද අර්ථයද ධර්මයද දැන ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා සිටින්නේද, අනුන් ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටුවන්නේද; ජීවකය, මෙපමණකින් උපාසකයෙක් තම යහපත පිණිසද, අනුන්ගේ යහපත පිණිසද පිළිපදින්නෙක් වේ.\"",
      "paliTitle": "Jīvakasuttaṃ",
      "englishTitle": "The Discourse on Jīvaka",
      "sinhalaTitle": "ජීවක සූත්‍රය"
    },
    {
      "number": 27,
      "pali": "‘‘Aṭṭhimāni, bhikkhave, balāni. Katamāni aṭṭha? Ruṇṇabalā, bhikkhave, dārakā, kodhabalā mātugāmā, āvudhabalā corā, issariyabalā rājāno, ujjhattibalā bālā, nijjhattibalā paṇḍitā, paṭisaṅkhānabalā bahussutā, khantibalā samaṇabrāhmaṇā – imāni kho, bhikkhave, aṭṭha balānī’’ti. Sattamaṃ.",
      "english": "Monks, these are eight powers. Which eight? Monks, children have the power of crying; women have the power of anger; thieves have the power of weapons; kings have the power of sovereignty; fools have the power of finding fault; the wise have the power of discernment; the learned have the power of reflection; and ascetics and brahmins have the power of patience. Monks, these are indeed the eight powers.",
      "sinhala": "භික්ෂූණි, මේ බල අටකි. ඒ අට කවරේද? භික්ෂූණි, ළමයින්ගේ බලය හැඬීම යි. කාන්තාවන්ගේ බලය ක්‍[ZWJ]රෝධය යි. සොරුන්ගේ බලය ආයුධ යි. රජවරුන්ගේ බලය ආධිපත්‍[ZWJ]යය යි. අඥයන්ගේ බලය නින්දා කිරීම යි. පණ්ඩිතයන්ගේ බලය විමසීම යි. බහුශ්‍[ZWJ]රැතයන්ගේ බලය ප්‍[ZWJ]රතිසංඛ්‍[ZWJ]යානය යි. ශ්‍[ZWJ]රමණ බ්‍[ZWJ]රාහ්මණයන්ගේ බලය ක්‍[ZWJ]ෂාන්තිය යි. භික්ෂූණි, මේ බල අට යි.",
      "paliTitle": "Paṭhamabalasuttaṃ",
      "englishTitle": "The First Discourse on Powers",
      "sinhalaTitle": "ප්U+0DCAU+200Dරථම බල සූත්U+0DCAU+200Dරය"
    },
    {
      "number": 28,
      "pali": "Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca – ‘‘kati nu kho, sāriputta, khīṇāsavassa bhikkhuno balāni, yehi balehi samannāgato khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti? ‘‘Aṭṭha, bhante, khīṇāsavassa bhikkhuno balāni, yehi balehi samannāgato khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. ‘‘Katamāni aṭṭha? [a. ni. 10.90; paṭi. ma. 2.44] Idha, bhante, khīṇāsavassa bhikkhuno aniccato sabbe saṅkhārā yathābhūtaṃ sammappaññāya sudiṭṭhā honti. Yampi, bhante, khīṇāsavassa bhikkhuno aniccato sabbe saṅkhārā yathābhūtaṃ sammappaññāya sudiṭṭhā honti, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno aṅgārakāsūpamā kāmā yathābhūtaṃ sammappaññāya sudiṭṭhā honti. Yampi, bhante, khīṇāsavassa bhikkhuno aṅgārakāsūpamā kāmā yathābhūtaṃ sammappaññāya sudiṭṭhā honti, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno vivekaninnaṃ cittaṃ hoti vivekapoṇaṃ vivekapabbhāraṃ vivekaṭṭhaṃ nekkhammābhirataṃ byantibhūtaṃ sabbaso āsavaṭṭhāniyehi dhammehi. Yampi, bhante, khīṇāsavassa bhikkhuno vivekaninnaṃ cittaṃ hoti vivekapoṇaṃ vivekapabbhāraṃ vivekaṭṭhaṃ nekkhammābhirataṃ byantibhūtaṃ sabbaso āsavaṭṭhāniyehi dhammehi, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno cattāro satipaṭṭhānā bhāvitā honti subhāvitā. Yampi, bhante, khīṇāsavassa bhikkhuno cattāro satipaṭṭhānā bhāvitā honti subhāvitā, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno cattāro iddhipādā bhāvitā honti subhāvitā…pe… pañcindriyāni bhāvitāni honti subhāvitāni…pe… satta bojjhaṅgā bhāvitā honti subhāvitā…pe… ariyo aṭṭhaṅgiko maggo bhāvito hoti subhāvito. Yampi, bhante, khīṇāsavassa bhikkhuno ariyo aṭṭhaṅgiko maggo bhāvito hoti subhāvito, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. ‘‘Imāni kho, bhante, aṭṭha khīṇāsavassa bhikkhuno balāni, yehi balehi samannāgato khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. Aṭṭhamaṃ.",
      "english": "Then the Venerable Sāriputta approached the Blessed One, bowed to him, and sat down to one side.\n\nAs the Venerable Sāriputta sat to one side, the Blessed One said to him: “Sāriputta, how many powers does a bhikkhu possess, whose taints are destroyed, by virtue of which he declares the destruction of the taints, saying: ‘My taints are destroyed’?”\n\n“Venerable Sir, there are eight powers of a bhikkhu whose taints are destroyed, by virtue of which he declares the destruction of the taints, saying: ‘My taints are destroyed’.”\n\n“Which eight? Here, Venerable Sir, for a bhikkhu whose taints are destroyed, all formations are well seen as impermanent, as they really are, with right wisdom.”\n\nAnd because, Venerable Sir, for a bhikkhu whose taints are destroyed, all formations are well seen as impermanent, as they really are, with right wisdom—this too, Venerable Sir, is a power for a bhikkhu whose taints are destroyed, relying on which he declares the destruction of the taints, saying: ‘My taints are destroyed.’\n\nFurthermore, Venerable Sir, for a bhikkhu whose taints are destroyed, sense pleasures are well seen as like a pit of burning coals, as they really are, with right wisdom.\n\nAnd because, Venerable Sir, for a bhikkhu whose taints are destroyed, sense pleasures are well seen as like a pit of burning coals, as they really are, with right wisdom—this too, Venerable Sir, is a power for a bhikkhu whose taints are destroyed, relying on which he declares the destruction of the taints, saying: ‘My taints are destroyed.’\n\nFurthermore, Venerable Sir, for a bhikkhu whose taints are destroyed, his mind inclines towards seclusion, tends towards seclusion, gravitates towards seclusion, stands in seclusion, delights in renunciation, and is completely separated from all things that lead to taints.\n\nAnd because, Venerable Sir, for a bhikkhu whose taints are destroyed, his mind inclines towards seclusion, tends towards seclusion, gravitates towards seclusion, stands in seclusion, delights in renunciation, and is completely separated from all things that lead to taints—this too, Venerable Sir, is a power for a bhikkhu whose taints are destroyed, relying on which he declares the destruction of the taints, saying: ‘My taints are destroyed.’\n\nFurthermore, Venerable Sir, for a bhikkhu whose taints are destroyed, the four establishments of mindfulness are developed and well developed.\n\nAnd because, Venerable Sir, for a bhikkhu whose taints are destroyed, the four establishments of mindfulness are developed and well developed—this too, Venerable Sir, is a power for a bhikkhu whose taints are destroyed, relying on which he declares the destruction of the taints, saying: ‘My taints are destroyed.’\n\nFurthermore, Venerable Sir, for a bhikkhu whose taints are destroyed, the four bases of spiritual power are developed and well developed; the five spiritual faculties are developed and well developed; the seven factors of enlightenment are developed and well developed; and the Noble Eightfold Path is developed and well developed.\n\nAnd because, Venerable Sir, for a bhikkhu whose taints are destroyed, the Noble Eightfold Path is developed and well developed—this too, Venerable Sir, is a power for a bhikkhu whose taints are destroyed, relying on which he declares the destruction of the taints, saying: ‘My taints are destroyed.’\n\n“These, Venerable Sir, are the eight powers of a bhikkhu whose taints are destroyed, by virtue of which he declares the destruction of the taints, saying: ‘My taints are destroyed’.”",
      "sinhala": "එවිට ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේගෙන් භාග්‍යවතුන් වහන්සේ මෙසේ විමසූ සේක: “ශාරිපුත්‍රය, ආශ්‍රවයන් ක්ෂය කළ භික්ෂුවකට කොපමණ බලයන් තිබේද? යම් බලයන්ගෙන් යුක්තව ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“ස්වාමීනී, ආශ්‍රවයන් ක්ෂය කළ භික්ෂුවකට බලයන් අටක් ඇත. යම් බලයන්ගෙන් යුක්තව ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේය.” “ඒ අට කවරේද?”\n\n“ස්වාමීනී, මෙහිලා ක්ෂීණාශ්‍රව භික්ෂුවකට සියලු සංස්කාර ධර්ම අනිත්‍ය වශයෙන් යථාභූත ඥානයෙන් මැනවින් දක්නා ලද්දාහු වෙති. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවකට සියලු සංස්කාර ධර්ම අනිත්‍ය වශයෙන් යථාභූත ඥානයෙන් මැනවින් දක්නා ලද්දාහු වෙද්ද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“නැවතද ස්වාමීනී, ක්ෂීණාශ්‍රව භික්ෂුවකට කාමයන් ගිනි අඟුරු වළකට උපමා කොට යථාභූත ඥානයෙන් මැනවින් දක්නා ලද්දාහු වෙති. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවකට කාමයන් ගිනි අඟුරු වළකට උපමා කොට යථාභූත ඥානයෙන් මැනවින් දක්නා ලද්දාහු වෙද්ද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“නැවතද ස්වාමීනී, ක්ෂීණාශ්‍රව භික්ෂුවගේ සිත විවේකයට නැමුණේය, විවේකයට බර වූයේය, විවේකය කරා ගියේය, විවේකයෙහි පිහිටියේය, නෛෂ්ක්‍රම්‍යයෙහි ඇලුණේය, සියලු ආශ්‍රවයන්ට හේතු වන ධර්මයන්ගෙන් පූර්ණයෙන් දුරු වූයේය. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවගේ සිත විවේකයට නැමුණේය, විවේකයට බර වූයේය, විවේකය කරා ගියේය, විවේකයෙහි පිහිටියේය, නෛෂ්ක්‍රම්‍යයෙහි ඇලුණේය, සියලු ආශ්‍රවයන්ට හේතු වන ධර්මයන්ගෙන් පූර්ණයෙන් දුරු වූයේද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“නැවතද ස්වාමීනී, ක්ෂීණාශ්‍රව භික්ෂුව විසින් සතර සතිපට්ඨානයන් වඩන ලද්දාහු වෙති, මැනවින් වඩන ලද්දාහු වෙති. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුව විසින් සතර සතිපට්ඨානයන් වඩන ලද්දාහු වෙද්ද, මැනවින් වඩන ලද්දාහු වෙද්ද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“නැවතද ස්වාමීනී, ක්ෂීණාශ්‍රව භික්ෂුව විසින් සතර ඉර්ධිපාදයන් වඩන ලද්දාහු වෙති, මැනවින් වඩන ලද්දාහු වෙති. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුව විසින් සතර ඉර්ධිපාදයන් වඩන ලද්දාහු වෙද්ද, මැනවින් වඩන ලද්දාහු වෙද්ද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“නැවතද ස්වාමීනී, ක්ෂීණාශ්‍රව භික්ෂුව විසින් පස් ඉඳුරන් වඩන ලද්දාහු වෙති, මැනවින් වඩන ලද්දාහු වෙති. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුව විසින් පස් ඉඳුරන් වඩන ලද්දාහු වෙද්ද, මැනවින් වඩන ලද්දාහු වෙද්ද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“නැවතද ස්වාමීනී, ක්ෂීණාශ්‍රව භික්ෂුව විසින් සත් බෝධ්‍යංගයන් වඩන ලද්දාහු වෙති, මැනවින් වඩන ලද්දාහු වෙති. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුව විසින් සත් බෝධ්‍යංගයන් වඩන ලද්දාහු වෙද්ද, මැනවින් වඩන ලද්දාහු වෙද්ද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“නැවතද ස්වාමීනී, ක්ෂීණාශ්‍රව භික්ෂුව විසින් ආර්ය අෂ්ටාංගික මාර්ගය වඩන ලද්දේ වෙයි, මැනවින් වඩන ලද්දේ වෙයි. ස්වාමීනී, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුව විසින් ආර්ය අෂ්ටාංගික මාර්ගය වඩන ලද්දේ වෙද්ද, මැනවින් වඩන ලද්දේ වෙද්ද, ස්වාමීනී, මෙයද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් අරබයා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”\n\n“ස්වාමීනී, මේවා ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයන් අට වේ. යම් බලයන්ගෙන් යුක්තව ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වී ගියහ’ යනුවෙන් ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරන්නේද?”",
      "paliTitle": "Dutiyabalasuttaṃ",
      "englishTitle": "The Second Discourse on Power",
      "sinhalaTitle": "දෙවන බල සූත‍්‍රය"
    },
    {
      "number": 29,
      "pali": "‘‘‘Khaṇakicco loko, khaṇakicco loko’ti, bhikkhave, assutavā puthujjano bhāsati, no ca kho so jānāti khaṇaṃ vā akkhaṇaṃ vā. Aṭṭhime, bhikkhave, akkhaṇā asamayā brahmacariyavāsāya. Katame aṭṭha? Idha, bhikkhave, tathāgato ca loke uppanno hoti arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā, dhammo ca desiyati opasamiko parinibbāniko sambodhagāmī sugatappavedito; ayañca puggalo nirayaṃ upapanno hoti. Ayaṃ, bhikkhave, paṭhamo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ, bhikkhave, tathāgato ca loke uppanno hoti…pe… satthā devamanussānaṃ buddho bhagavā, dhammo ca desiyati opasamiko parinibbāniko sambodhagāmī sugatappavedito; ayañca puggalo tiracchānayoniṃ upapanno hoti…pe…. ‘‘Puna caparaṃ, bhikkhave…pe… ayañca puggalo pettivisayaṃ upapanno hoti…pe…. ‘‘Puna caparaṃ, bhikkhave…pe… ayañca puggalo aññataraṃ dīghāyukaṃ devanikāyaṃ upapanno hoti…pe…. ‘‘Puna caparaṃ, bhikkhave…pe… ayañca puggalo paccantimesu janapadesu paccājāto hoti, so ca hoti aviññātāresu milakkhesu [milakkhūsu (syā. ka.) dī. ni. 3.358], yattha natthi gati bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ…pe… pañcamo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ, bhikkhave…pe… ayañca puggalo majjhimesu janapadesu paccājāto hoti, so ca hoti micchādiṭṭhiko viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammā paṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti…pe…. ‘‘Puna caparaṃ, bhikkhave…pe… ayañca puggalo majjhimesu janapadesu paccājāto hoti, so ca hoti duppañño jaḷo eḷamūgo appaṭibalo subhāsitadubbhāsitassa atthamaññātuṃ. Ayaṃ, bhikkhave, sattamo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ, bhikkhave, tathāgato ca loke anuppanno hoti arahaṃ sammāsambuddho…pe… satthā devamanussānaṃ buddho bhagavā. Dhammo ca na desiyati opasamiko parinibbāniko sambodhagāmī sugatappavedito. Ayañca puggalo majjhimesu janapadesu paccājāto hoti, so ca hoti paññavā ajaḷo aneḷamūgo paṭibalo subhāsitadubbhāsitassa atthamaññātuṃ. Ayaṃ, bhikkhave, aṭṭhamo akkhaṇo asamayo brahmacariyavāsāya. ‘Ime kho, bhikkhave, aṭṭha akkhaṇā asamayā brahmacariyavāsāya’’’. ‘‘Ekova kho, bhikkhave, khaṇo ca samayo ca brahmacariyavāsāya. Katamo eko? Idha, bhikkhave, tathāgato ca loke uppanno hoti arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. Dhammo ca desiyati opasamiko parinibbāniko sambodhagāmī sugatappavedito. Ayañca puggalo majjhimesu janapadesu paccājāto hoti, so ca hoti paññavā ajaḷo aneḷamūgo paṭibalo subhāsitadubbhāsitassa atthamaññātuṃ. Ayaṃ, bhikkhave, ekova khaṇo ca samayo ca brahmacariyavāsāyā’’ti. ‘‘Manussalābhaṃ [manussalokaṃ (syā.)] laddhāna, saddhamme suppavedite; Ye khaṇaṃ nādhigacchanti, atināmenti te khaṇaṃ. ‘‘Bahū hi akkhaṇā vuttā, maggassa antarāyikā; Kadāci karahaci loke, uppajjanti tathāgatā. ‘‘Tayidaṃ [tassidaṃ (ka.)] sammukhībhūtaṃ, yaṃ lokasmiṃ sudullabhaṃ; Manussapaṭilābho ca, saddhammassa ca desanā; Alaṃ vāyamituṃ tattha, attakāmena [atthakāmena (sī. syā. ka.)] jantunā. ‘‘Kathaṃ vijaññā saddhammaṃ, khaṇo ve [vo (syā.)] mā upaccagā; Khaṇātītā hi socanti, nirayamhi samappitā. ‘‘Idha ce naṃ virādheti, saddhammassa niyāmataṃ [niyāmitaṃ (syā.)]; Vāṇijova atītattho, cirattaṃ [cirantaṃ (ka.)] anutapissati. ‘‘Avijjānivuto poso, saddhammaṃ aparādhiko; Jātimaraṇasaṃsāraṃ, ciraṃ paccanubhossati. ‘‘Ye ca laddhā manussattaṃ, saddhamme suppavedite; Akaṃsu satthu vacanaṃ, karissanti karonti vā. ‘‘Khaṇaṃ paccaviduṃ loke, brahmacariyaṃ anuttaraṃ; Ye maggaṃ paṭipajjiṃsu, tathāgatappaveditaṃ. ‘‘Ye saṃvarā cakkhumatā, desitādiccabandhunā; Tesu [tesaṃ (ka.)] gutto sadā sato, vihare anavassuto. ‘‘Sabbe anusaye chetvā, māradheyyaparānuge; Te ve pāraṅgatā [pāragatā (sī. syā. pī.)] loke, ye pattā āsavakkhaya’’nti. navamaṃ;",
      "english": "“The world has a duty to be done in this moment, the world has a duty to be done in this moment,” so speaks the uninstructed ordinary person, monks, but he does not truly know what a moment of opportunity is or what a lack of opportunity is. These eight, monks, are non-moments, inappropriate times for leading the holy life. Which eight?\n\nHere, monks, a Tathāgata, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One, has arisen in the world, and the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught; but this particular person has been reborn in hell. This, monks, is the first non-moment, inappropriate time for leading the holy life.\n\nFurthermore, monks, a Tathāgata has arisen in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One; and the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught; but this particular person has been reborn in the animal realm.\n\nFurthermore, monks, a Tathāgata has arisen in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One; and the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught; but this particular person has been reborn in the realm of hungry ghosts.\n\nFurthermore, monks, a Tathāgata has arisen in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One; and the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught; but this particular person has been reborn among a certain group of long-lived deities.\n\nFurthermore, monks, a Tathāgata has arisen in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One; and the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught; but this particular person has been reborn in remote borderlands, and he is among uncivilized people whose speech is unintelligible, where there is no coming and going of monks, nuns, male lay followers, or female lay followers. This is the fifth non-moment, inappropriate time for leading the holy life.\n\nFurthermore, monks, a Tathāgata has arisen in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One; and the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught; but this particular person has been reborn in central lands, and he holds wrong views, a distorted outlook, asserting: ‘There is no merit in giving, no merit in offerings, no merit in sacrifices; there is no fruit or result of good or bad actions; there is no this world, no other world; there is no mother, no father; there are no spontaneously born beings; there are no ascetics or brahmins in the world who are rightly gone, rightly practicing, who, having themselves directly known and realized this world and the other world, proclaim it.’\n\nFurthermore, monks, a Tathāgata has arisen in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One; and the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught; but this particular person has been reborn in central lands, and he is dull-witted, stupid, a mute idiot, incapable of understanding the meaning of what is well-spoken or ill-spoken. This, monks, is the seventh non-moment, inappropriate time for leading the holy life.\n\nFurthermore, monks, a Tathāgata, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One, has *not* arisen in the world. And the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is *not* being taught. But this particular person has been reborn in central lands, and he is intelligent, not stupid, not a mute idiot, capable of understanding the meaning of what is well-spoken or ill-spoken. This, monks, is the eighth non-moment, inappropriate time for leading the holy life. These, monks, are the eight non-moments, inappropriate times for leading the holy life.\n\nThere is just one moment of opportunity, monks, just one appropriate time for leading the holy life. Which one? Here, monks, a Tathāgata, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One, has arisen in the world. And the Dhamma, leading to inner peace, to the complete extinguishing of suffering, to full awakening, proclaimed by the Fortunate One, is being taught. And this particular person has been reborn in central lands, and he is intelligent, not stupid, not a mute idiot, capable of understanding the meaning of what is well-spoken or ill-spoken. This, monks, is the one moment of opportunity, the one appropriate time for leading the holy life.\n\nHaving obtained human birth, when the True Dhamma is well-proclaimed, those who do not seize the moment of opportunity let that moment pass them by.\n\nIndeed, many non-moments have been declared as obstacles to the path. Only occasionally, now and then, do Tathāgatas arise in the world.\n\nThis rare opportunity, exceedingly difficult to obtain in the world – the gaining of human existence and the teaching of the True Dhamma – has now come to be present. It is enough for a sentient being who desires their own welfare to strive diligently for that.\n\nHow should one discern the True Dhamma? Let not the moment of opportunity pass you by. For those who let the moment pass lament, immersed in hell.\n\nIf one here misses the fixed course of the True Dhamma, like a merchant who has missed his profit, one will long regret it.\n\nA person enveloped in ignorance, who neglects the True Dhamma, will long experience the cycle of birth and death.\n\nBut those who, having gained human existence when the True Dhamma is well-proclaimed, have acted, will act, or are acting according to the Teacher's word.\n\nThey have realized the moment of opportunity in the world, the unsurpassed holy life – those who have entered upon the path proclaimed by the Tathāgata.\n\nOne should dwell unblemished, always mindful, guarded by those self-restraints taught by the One with Vision, the Kinsman of the Sun.\n\nHaving cut off all underlying tendencies that follow in the wake of Māra’s dominion, they indeed have gone to the far shore in the world, those who have attained the destruction of the taints.",
      "sinhala": "මහණෙනි, 'ලෝකයෙහි ක්ෂණික කාර්‍යයක් ඇත, ලෝකයෙහි ක්ෂණික කාර්‍යයක් ඇත' යැයි අශ්‍රැතවත් පෘථග්ජනයා කියයි. එහෙත් ඔහු ක්ෂණය (සුදුසු මොහොත) හෝ අක්ෂණය (නුසුදුසු මොහොත) හෝ නොදනියි. මහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට නුසුදුසු, අක්ෂණ අටක් වෙති. කවරේද ඒ අට?\n\nමහණෙනි, මෙහිදී අරහං සම්මාසම්බුද්ධ වූ, විජ්ජාචරණ සම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, අනුත්තර වූ පුරිසදම්ම සාරථී වූ, දෙවිමිනිසුනට ශාස්තෲ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ ලෝකයෙහි පහළ වී සිටිති. ඔපශමික වූ, පරිනිර්‍වාණගාමී වූ, සම්බෝධිගාමී වූ, සුගතයන් වහන්සේ විසින් ප්‍රකාශිත වූ ධර්මය ද දේශනා කරනු ලබයි. එහෙත් මේ පුද්ගලයා නිරයෙහි උපත ලබා සිටියි. මහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට නුසුදුසු වූ පළමු වන අක්ෂණය මෙයයි.\n\nනැවතද මහණෙනි, තථාගතයන් වහන්සේ ලෝකයෙහි පහළ වී සිටිති... දෙවිමිනිසුනට ශාස්තෲ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ... ඔපශමික වූ, පරිනිර්‍වාණගාමී වූ, සම්බෝධිගාමී වූ, සුගතයන් වහන්සේ විසින් ප්‍රකාශිත වූ ධර්මය ද දේශනා කරනු ලබයි. එහෙත් මේ පුද්ගලයා තිරිසන් යෝනියෙහි උපත ලබා සිටියි...\n\nනැවතද මහණෙනි... එහෙත් මේ පුද්ගලයා ප්‍රේත විෂයයෙහි උපත ලබා සිටියි...\n\nනැවතද මහණෙනි... එහෙත් මේ පුද්ගලයා යම්කිසි දීර්ඝායුෂ ඇති දෙව් නිකායක උපත ලබා සිටියි...\n\nනැවතද මහණෙනි... එහෙත් මේ පුද්ගලයා දුර බැහැර ජනපදවල උපත ලබා සිටියි. ඔහු නොදන්නා ම්ලේච්ඡයන් අතර සිටියි. භික්ෂූන්, භික්ෂුණීන්, උපාසකයන්, උපාසිකාවන් යන අයට එහි යාමට මාර්ගයක් නැත... මහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට නුසුදුසු වූ පස්වෙනි අක්ෂණය මෙයයි.\n\nනැවතද මහණෙනි... එහෙත් මේ පුද්ගලයා මධ්‍යම ප්‍රදේශවල උපත ලබා සිටියි. ඔහු මිථ්‍යා දෘෂ්ටිකයෙක් වන අතර, විපරීත දර්ශනයෙන් යුක්තය. 'දෙන ලද දෙයක් නැත, පූජා කරන ලද්දක් නැත, හෝම කරන ලද්දක් නැත, හොඳ නරක කර්මවල ඵල විපාක නැත, මේ ලෝකයක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත, ලෝකයෙහි තමන් විසින්ම මේ ලෝකයත් පරලොවත් අවබෝධ කර සත්‍ය වශයෙන්ම ප්‍රකාශ කරන සෘජු මාර්ගයට ගිය, නිවැරදිව පිළිපන් ශ්‍රමණ බ්‍රාහ්මණයෝ නැත' යනුවෙන් (ඔහු මිථ්‍යා දෘෂ්ටි දරයි)...\n\nනැවතද මහණෙනි... එහෙත් මේ පුද්ගලයා මධ්‍යම ප්‍රදේශවල උපත ලබා සිටියි. ඔහු දුෂ්ප්‍රඥ වූ, අඥ වූ, ගොළු වූ, සුභාෂිත දුර්භාෂිත වචනවල තේරුම අවබෝධ කරගැනීමට නොහැකි පුද්ගලයෙකි. මහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට නුසුදුසු වූ සත්වෙනි අක්ෂණය මෙයයි.\n\nනැවතද මහණෙනි, අරහං සම්මාසම්බුද්ධ වූ... දෙවිමිනිසුනට ශාස්තෲ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ ලෝකයෙහි පහළ වී නොසිටිති. ඔපශමික වූ, පරිනිර්‍වාණගාමී වූ, සම්බෝධිගාමී වූ, සුගතයන් වහන්සේ විසින් ප්‍රකාශිත වූ ධර්මය ද දේශනා කරනු නොලැබේ. එහෙත් මේ පුද්ගලයා මධ්‍යම ප්‍රදේශවල උපත ලබා සිටියි. ඔහු ප්‍රඥාවන්ත වූ, අඥානයෙක් නොවන, ගොළුවෙක් නොවන, සුභාෂිත දුර්භාෂිත වචනවල තේරුම අවබෝධ කරගැනීමට හැකි පුද්ගලයෙකි. මහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට නුසුදුසු වූ අටවෙනි අක්ෂණය මෙයයි. මහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට නුසුදුසු මේ අක්ෂණ අට මේවාය.\n\nමහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට සුදුසු වූ එක් ක්ෂණයක් (අවස්ථාවක්) හා සමයක් ඇත. ඒ එක කවරේද? මහණෙනි, මෙහිදී අරහං සම්මාසම්බුද්ධ වූ, විජ්ජාචරණ සම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, අනුත්තර වූ පුරිසදම්ම සාරථී වූ, දෙවිමිනිසුනට ශාස්තෲ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ ලෝකයෙහි පහළ වී සිටිති. ඔපශමික වූ, පරිනිර්‍වාණගාමී වූ, සම්බෝධිගාමී වූ, සුගතයන් වහන්සේ විසින් ප්‍රකාශිත වූ ධර්මය ද දේශනා කරනු ලබයි. එහෙත් මේ පුද්ගලයා මධ්‍යම ප්‍රදේශවල උපත ලබා සිටියි. ඔහු ප්‍රඥාවන්ත වූ, අඥානයෙක් නොවන, ගොළුවෙක් නොවන, සුභාෂිත දුර්භාෂිත වචනවල තේරුම අවබෝධ කරගැනීමට හැකි පුද්ගලයෙකි. මහණෙනි, බ්‍රහ්මචර්‍යාවෙහි වාසය කිරීමට සුදුසු වූ ඒ එකම ක්ෂණය හා සමය මෙයයි.\n\nමනුෂ්‍ය භාවය ලබා, සද්ධර්මය මැනවින් දේශනා කරන කල්හි, යම් කෙනෙක් මේ ක්ෂණය (අවස්ථාව) නොලබත්ද, ඔවුහු ඒ ක්ෂණය නිකරුණේ ගත කරති.\n\nමාර්ගයට අන්තරාය වන නුසුදුසු අවස්ථා (අක්ෂණ) බොහෝ ප්‍රකාශ කරන ලදී. තථාගතයන් වහන්සේලා ලෝකයෙහි පහළ වන්නේ කලාතුරකිනි.\n\nලෝකයෙහි ඉතා දුර්ලභ වූ මේ මනුෂ්‍ය භාවය ලැබීමත්, සද්ධර්ම දේශනාවත් දැන් ඔබට සමීපව ඇත. තමාගේ යහපත කැමති පුද්ගලයාට එහි වෑයම් කිරීමට එය ප්‍රමාණවත් වේ.\n\nසද්ධර්මය කෙසේ දැනගත යුතුද? මේ ක්ෂණය (අවස්ථාව) ඔබ ඉක්මවා නොයවන්න. ක්ෂණය ඉක්මවා ගියෝ නිරයට පත්ව ශෝක කරති.\n\nමෙහිදී යමෙක් සද්ධර්මයේ ස්ථිර භාවය (නිර්‍වාණ මාර්ගය) අහිමි කරගනී නම්, ඔහු ලාභය අහිමි කරගත් වෙළෙන්දෙකු මෙන් දිගු කලක් පසුතැවෙනු ඇත.\n\nඅවිද්‍යාවෙන් වසන ලද පුද්ගලයා, සද්ධර්මය නොසලකා හැරියහොත්, ඔහු ජාති-මරණ සංසාරයෙහි දිගු කලක් දුක් විඳිනු ඇත.\n\nමනුෂ්‍යත්වය ලබා, සද්ධර්මය මැනවින් දේශනා කරන කල්හි, යම් කෙනෙක් ශාස්තෲන් වහන්සේගේ වචනයට අනුව කටයුතු කළාහුද, කටයුතු කරන්නේද, කටයුතු කරනු ඇත්තාහුද,\n\nතථාගතයන් වහන්සේ විසින් ප්‍රකාශිත වූ අනුත්තර බ්‍රහ්මචර්‍යාවට වූ මාර්ගයෙහි පිළිපන් යම් කෙනෙක් සිටිත්ද, ඔවුහු ලෝකයෙහි සුදුසු ක්ෂණය (අවස්ථාව) තේරුම් ගත්තාහුය.\n\nචක්ෂුස්මාන්ත වූ, ආදිත්‍ය බන්ධු වූ බුදුරජාණන් වහන්සේ විසින් දේශනා කරන ලද යම් සංවරයක් (ඉන්ද්‍රිය සංවරයක්) ඇත්ද, ඒවායෙහි ආරක්ෂා වී, නිරතුරුව සිහි නුවණින් යුක්තව, කෙලෙස්වලින් තෙමී නොසිට වාසය කළ යුතුය.\n\nමාරයාගේ වසඟයට යටත් වන සියලු අනුසය ධර්මයන් සිඳ දමා, යම් කෙනෙක් ආශ්‍රවයන්ගේ ක්ෂය භාවයට පත්වූවාහුද, ඔවුහු ලෝකයෙහි සැබවින්ම පරතෙරට පැමිණියෝ වෙති.",
      "paliTitle": "Akkhaṇasuttaṃ",
      "englishTitle": "Discourse on Inopportune Moments",
      "sinhalaTitle": "අක‍්ඛණ සූත‍්‍රය"
    },
    {
      "number": 30,
      "pali": "Ekaṃ samayaṃ bhagavā bhaggesu viharati suṃsumāragire bhesakaḷāvane migadāye. Tena kho pana samayena āyasmā anuruddho cetīsu viharati pācīnavaṃsadāye. Atha kho āyasmato anuruddhassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘appicchassāyaṃ dhammo, nāyaṃ dhammo mahicchassa; santuṭṭhassāyaṃ dhammo, nāyaṃ dhammo asantuṭṭhassa; pavivittassāyaṃ dhammo, nāyaṃ dhammo saṅgaṇikārāmassa; āraddhavīriyassāyaṃ dhammo, nāyaṃ dhammo kusītassa; upaṭṭhitassatissāyaṃ [upaṭṭhitasatissāyaṃ (sī. syā. pī.)] dhammo, nāyaṃ dhammo muṭṭhassatissa [muṭṭhasatissa (sī. syā. pī.)]; samāhitassāyaṃ dhammo, nāyaṃ dhammo asamāhitassa; paññavato ayaṃ dhammo, nāyaṃ dhammo duppaññassā’’ti. Atha kho bhagavā āyasmato anuruddhassa cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evamevaṃ – bhaggesu suṃsumāragire bhesakaḷāvane migadāye antarahito cetīsu pācīnavaṃsadāye āyasmato anuruddhassa sammukhe pāturahosi. Nisīdi bhagavā paññatte āsane. Āyasmāpi kho anuruddho bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ Nisinnaṃ kho āyasmantaṃ anuruddhaṃ bhagavā etadavoca – ‘‘Sādhu sādhu, anuruddha! Sādhu kho tvaṃ, anuruddha, (yaṃ taṃ mahāpurisavitakkaṃ) [satta mahāpurisavitakke (sī. pī.) dī. ni. 3.358] vitakkesi – ‘appicchassāyaṃ dhammo, nāyaṃ dhammo mahicchassa; santuṭṭhassāyaṃ dhammo, nāyaṃ dhammo asantuṭṭhassa; pavivittassāyaṃ dhammo, nāyaṃ dhammo saṅgaṇikārāmassa; āraddhavīriyassāyaṃ dhammo, nāyaṃ dhammo kusītassa; upaṭṭhitassatissāyaṃ dhammo, nāyaṃ dhammo muṭṭhassatissa; samāhitassāyaṃ dhammo, nāyaṃ dhammo asamāhitassa; paññavato ayaṃ dhammo, nāyaṃ dhammo duppaññassā’ti. Tena hi tvaṃ, anuruddha, imampi aṭṭhamaṃ mahāpurisavitakkaṃ vitakkehi – ‘nippapañcārāmassāyaṃ dhammo nippapañcaratino, nāyaṃ dhammo papañcārāmassa papañcaratino’’’ti. ‘‘Yato kho tvaṃ, anuruddha, ime aṭṭha mahāpurisavitakke vitakkessasi, tato tvaṃ, anuruddha, yāvadeva [yāvade (saṃ. ni. 2.152)] ākaṅkhissasi, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharissasi. ‘‘Yato kho tvaṃ, anuruddha, ime aṭṭha mahāpurisavitakke vitakkessasi, tato tvaṃ, anuruddha, yāvadeva ākaṅkhissasi, vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharissasi. ‘‘Yato kho tvaṃ, anuruddha, ime aṭṭha mahāpurisavitakke vitakkessasi, tato tvaṃ, anuruddha, yāvadeva ākaṅkhissasi, pītiyā ca virāgā upekkhako ca viharissasi sato ca sampajāno sukhañca kāyena paṭisaṃvedissasi yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharissasi. ‘‘Yato kho tvaṃ, anuruddha, ime aṭṭha mahāpurisavitakke vitakkessasi, tato tvaṃ, anuruddha, yāvadeva ākaṅkhissasi, sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharissasi. ‘‘Yato kho tvaṃ, anuruddha, ime ca aṭṭha mahāpurisavitakke vitakkessasi, imesañca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī bhavissasi akicchalābhī akasiralābhī, tato tuyhaṃ, anuruddha, seyyathāpi nāma gahapatissa vā gahapatiputtassa vā nānārattānaṃ dussānaṃ dussakaraṇḍako pūro; evamevaṃ te paṃsukūlacīvaraṃ khāyissati santuṭṭhassa viharato ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. ‘‘Yato kho tvaṃ, anuruddha, ime ca aṭṭha mahāpurisavitakke vitakkessasi, imesañca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī bhavissasi akicchalābhī akasiralābhī, tato tuyhaṃ, anuruddha, seyyathāpi nāma gahapatissa vā gahapatiputtassa vā sālīnaṃ odano vicitakāḷako anekasūpo anekabyañjano; evamevaṃ te piṇḍiyālopabhojanaṃ khāyissati santuṭṭhassa viharato ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. ‘‘Yato kho tvaṃ, anuruddha, ime ca aṭṭha mahāpurisavitakke vitakkessasi, imesañca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī bhavissasi akicchalābhī akasiralābhī, tato tuyhaṃ, anuruddha, seyyathāpi nāma gahapatissa vā gahapatiputtassa vā kūṭāgāraṃ ullittāvalittaṃ nivātaṃ phusitaggaḷaṃ pihitavātapānaṃ; evamevaṃ te rukkhamūlasenāsanaṃ khāyissati santuṭṭhassa viharato ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. ‘‘Yato kho tvaṃ, anuruddha, ime ca aṭṭha mahāpurisavitakke vitakkessasi, imesañca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī bhavissasi akicchalābhī akasiralābhī, tato tuyhaṃ, anuruddha, seyyathāpi nāma gahapatissa vā gahapatiputtassa vā pallaṅko gonakatthato paṭikatthato paṭalikatthato kadalimigapavarapaccattharaṇo [kādali… paccattharaṇo (sī.)] sauttaracchado ubhatolohitakūpadhāno; evamevaṃ te tiṇasanthārakasayanāsanaṃ khāyissati santuṭṭhassa viharato ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. ‘‘Yato kho tvaṃ, anuruddha, ime ca aṭṭha mahāpurisavitakke vitakkessasi, imesañca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī bhavissasi akicchalābhī akasiralābhī, tato tuyhaṃ, anuruddha, seyyathāpi nāma gahapatissa vā gahapatiputtassa vā nānābhesajjāni, seyyathidaṃ – sappi navanītaṃ telaṃ madhu phāṇitaṃ; evamevaṃ te pūtimuttabhesajjaṃ khāyissati santuṭṭhassa viharato ratiyā aparitassāya phāsuvihārāya okkamanāya nibbānassa. Tena hi tvaṃ, anuruddha, āyatikampi vassāvāsaṃ idheva cetīsu pācīnavaṃsadāye vihareyyāsī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā anuruddho bhagavato paccassosi. Atha kho bhagavā āyasmantaṃ anuruddhaṃ iminā ovādena ovaditvā – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ – cetīsu pācīnavaṃsadāye antarahito bhaggesu suṃsumāragire bhesakaḷāvane migadāye pāturahosīti. Nisīdi bhagavā paññatte āsane. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘aṭṭha kho, bhikkhave, mahāpurisavitakke desessāmi, taṃ suṇātha…pe… katame ca, bhikkhave, aṭṭha mahāpurisavitakkā? Appicchassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo mahicchassa; santuṭṭhassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo asantuṭṭhassa; pavivittassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo saṅgaṇikārāmassa; āraddhavīriyassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo kusītassa; upaṭṭhitassatissāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo muṭṭhassatissa; samāhitassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo asamāhitassa; paññavato ayaṃ, bhikkhave, dhammo, nāyaṃ dhammo duppaññassa; nippapañcārāmassāyaṃ, bhikkhave, dhammo nippapañcaratino, nāyaṃ dhammo papañcārāmassa papañcaratino’’. ‘‘‘Appicchassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo mahicchassā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu appiccho samāno ‘appicchoti maṃ jāneyyu’nti na icchati, santuṭṭho samāno ‘santuṭṭhoti maṃ jāneyyu’nti na icchati, pavivitto samāno ‘pavivittoti maṃ jāneyyu’nti na icchati, āraddhavīriyo samāno ‘āraddhavīriyoti maṃ jāneyyu’nti na icchati, upaṭṭhitassati samāno ‘upaṭṭhitassatīti maṃ jāneyyu’nti na icchati, samāhito samāno ‘samāhitoti maṃ jāneyyu’nti na icchati, paññavā samāno ‘paññavāti maṃ jāneyyu’nti na icchati, nippapañcārāmo samāno ‘nippapañcārāmoti maṃ jāneyyu’nti na icchati. ‘Appicchassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo mahicchassā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Santuṭṭhassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo asantuṭṭhassā’ti, iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. ‘Santuṭṭhassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo asantuṭṭhassā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Pavivittassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo saṅgaṇikārāmassā’ti, iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhuno pavivittassa viharato bhavanti upasaṅkamitāro bhikkhū bhikkhuniyo upāsakā upāsikāyo rājāno rājamahāmattā titthiyā titthiyasāvakā. Tatra bhikkhu vivekaninnena cittena vivekapoṇena vivekapabbhārena vivekaṭṭhena nekkhammābhiratena aññadatthu uyyojanikapaṭisaṃyuttaṃyeva kathaṃ kattā [pavattā (ka.)] hoti. ‘Pavivittassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo saṅgaṇikārāmassā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Āraddhavīriyassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo kusītassā’ti, iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. ‘Āraddhavīriyassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo kusītassā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Upaṭṭhitassatissāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo muṭṭhassatissā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu satimā hoti paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. ‘Upaṭṭhitassatissāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo, muṭṭhassatissā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Samāhitassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo asamāhitassā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. ‘Samāhitassāyaṃ, bhikkhave, dhammo, nāyaṃ dhammo asamāhitassā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Paññavato ayaṃ, bhikkhave, dhammo, nāyaṃ dhammo duppaññassā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. ‘Paññavato ayaṃ, bhikkhave, dhammo, nāyaṃ dhammo duppaññassā’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Nippapañcārāmassāyaṃ, bhikkhave, dhammo nippapañcaratino, nāyaṃ dhammo papañcārāmassa papañcaratino’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhuno papañcanirodhe cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. ‘Nippapañcārāmassāyaṃ, bhikkhave, dhammo, nippapañcaratino, nāyaṃ dhammo papañcārāmassa papañcaratino’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Atha kho āyasmā anuruddho āyatikampi vassāvāsaṃ tattheva cetīsu pācīnavaṃsadāye vihāsi. Atha kho āyasmā anuruddho eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā anuruddho arahataṃ ahosīti. Atha kho āyasmā anuruddho arahattappatto tāyaṃ velāyaṃ imā gāthāyo abhāsi – [theragā. 901-903] ‘‘Mama saṅkappamaññāya, satthā loke anuttaro; Manomayena kāyena, iddhiyā upasaṅkami. ‘‘Yathā me ahu saṅkappo, tato uttari desayi; Nippapañcarato buddho, nippapañcaṃ adesayi. ‘‘Tassāhaṃ dhammamaññāya, vihāsiṃ sāsane rato; Tisso vijjā anuppattā, kataṃ buddhassa sāsana’’nti. dasamaṃ; ",
      "english": "One time, the Blessed One was dwelling among the Bhaggas, at Sumsumaragira, in the Bhesakalāvana Deer Park. Now, at that time, the Venerable Anuruddha was dwelling among the Cetis, in the Eastern Bamboo Grove. Then, while the Venerable Anuruddha was in solitary retreat, a thought arose in his mind thus: \"This Dhamma is for one with few desires, not for one with many desires; this Dhamma is for one who is contented, not for one who is discontented; this Dhamma is for one who is secluded, not for one who delights in company; this Dhamma is for one who has aroused energy, not for one who is lazy; this Dhamma is for one whose mindfulness is established, not for one whose mindfulness is confused; this Dhamma is for one who is concentrated, not for one who is unconcentrated; this Dhamma is for one with wisdom, not for one with poor wisdom.\"\n\nThen the Blessed One, having known with his mind the mental deliberation of the Venerable Anuruddha – just as a strong man might extend his flexed arm or flex his extended arm – disappeared from the Bhesakalāvana Deer Park at Sumsumaragira, among the Bhaggas, and appeared before the Venerable Anuruddha in the Eastern Bamboo Grove, among the Cetis. The Blessed One sat down on the seat that had been prepared. The Venerable Anuruddha, after bowing to the Blessed One, sat down to one side. As he sat to one side, the Blessed One said to the Venerable Anuruddha: \"Good, good, Anuruddha! It is good, Anuruddha, that you have deliberated upon these thoughts of a great man – 'This Dhamma is for one with few desires, not for one with many desires; this Dhamma is for one who is contented, not for one who is discontented; this Dhamma is for one who is secluded, not for one who delights in company; this Dhamma is for one who has aroused energy, not for one who is lazy; this Dhamma is for one whose mindfulness is established, not for one whose mindfulness is confused; this Dhamma is for one who is concentrated, not for one who is unconcentrated; this Dhamma is for one with wisdom, not for one with poor wisdom.' Therefore, Anuruddha, you should also deliberate upon this eighth thought of a great man – 'This Dhamma is for one who delights in non-proliferation, who enjoys non-proliferation, not for one who delights in proliferation, who enjoys proliferation.'\"\n\n\"When you, Anuruddha, have deliberated upon these eight thoughts of a great man, then, Anuruddha, as much as you wish, quite secluded from sensual pleasures, secluded from unwholesome states, you will enter and dwell in the first jhana, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and pleasure.\n\n\"When you, Anuruddha, have deliberated upon these eight thoughts of a great man, then, Anuruddha, as much as you wish, with the subsiding of initial application and sustained application, through the inner tranquilization and unification of the mind, you will enter and dwell in the second jhana, which is without initial application and sustained application, born of concentration, filled with rapture and pleasure.\n\n\"When you, Anuruddha, have deliberated upon these eight thoughts of a great man, then, Anuruddha, as much as you wish, with the fading of rapture, you will dwell in equanimity, mindful and clearly comprehending, and you will experience pleasure with the body, of which the Noble Ones declare: 'He dwells in pleasure with equanimity and mindfulness.' Thus you will enter and dwell in the third jhana.\n\n\"When you, Anuruddha, have deliberated upon these eight thoughts of a great man, then, Anuruddha, as much as you wish, with the abandoning of pleasure and pain, and with the prior disappearance of joy and grief, you will enter and dwell in the fourth jhana, which is beyond pleasure and pain, and purified by equanimity and mindfulness.\n\n\"When you, Anuruddha, have deliberated upon these eight thoughts of a great man, and you are a willing recipient, an effortless recipient, a recipient without difficulty, of these four jhanas, these mental states pertaining to the higher mind, which are a pleasant abiding in this very life – then, Anuruddha, just as a householder or a householder's son might have a basket full of garments of various colors, even so, your rag-robes will seem agreeable to you as you dwell contented, for your delight, for your untroubled abiding, for your comfortable dwelling, for leading on to Nibbāna.\n\n\"When you, Anuruddha, have deliberated upon these eight thoughts of a great man, and you are a willing recipient, an effortless recipient, a recipient without difficulty, of these four jhanas, these mental states pertaining to the higher mind, which are a pleasant abiding in this very life – then, Anuruddha, just as a householder or a householder's son might have a bowl of choice black-grained rice, with many sauces and many curries, even so, your almsfood will seem agreeable to you as you dwell contented, for your delight, for your untroubled abiding, for your comfortable dwelling, for leading on to Nibbāna.\"\n\nWhen you, Anuruddha, shall ponder these eight thoughts of a great man, and shall easily attain, without difficulty or trouble, these four jhānas – the higher mental states, the pleasant abidings in this very life – then, Anuruddha, just as a householder or a householder’s son might enjoy a peaked house, plastered inside and out, free from drafts, with its bolts fastened, and its windows closed, even so will a lodging at the root of a tree seem pleasing to you, dwelling content, without anxiety, for your comfortable abiding, for the penetration to Nibbāna.\n\nWhen you, Anuruddha, shall ponder these eight thoughts of a great man, and shall easily attain, without difficulty or trouble, these four jhānas – the higher mental states, the pleasant abidings in this very life – then, Anuruddha, just as a householder or a householder’s son might enjoy a luxurious couch spread with a long-haired rug, a white woolen rug, an embroidered rug, a splendid deerskin coverlet, with a canopy above and scarlet pillows at both ends, even so will a bed of straw seem pleasing to you, dwelling content, without anxiety, for your comfortable abiding, for the penetration to Nibbāna.\n\nWhen you, Anuruddha, shall ponder these eight thoughts of a great man, and shall easily attain, without difficulty or trouble, these four jhānas – the higher mental states, the pleasant abidings in this very life – then, Anuruddha, just as a householder or a householder’s son might enjoy various medicines, namely ghee, fresh butter, oil, honey, and treacle, even so will putrid urine as medicine seem pleasing to you, dwelling content, without anxiety, for your comfortable abiding, for the penetration to Nibbāna.\n\nTherefore, Anuruddha, you should continue to dwell here in the Eastern Bamboo Grove among the Cetī for the coming rainy season.\n\n“Yes, Venerable Sir,” replied the Venerable Anuruddha to the Blessed One.\n\nThen, after admonishing the Venerable Anuruddha with this instruction, the Blessed One vanished from the Eastern Bamboo Grove among the Cetī, just as a strong man might extend his flexed arm or flex his extended arm, and reappeared in the Bhesakaḷāvana deer park at Suṃsumāragiri in the Bhagga country.\n\nThe Blessed One sat down on the prepared seat.\n\nHaving sat down, the Blessed One addressed the monks: “Monks, I will teach you the eight thoughts of a great man. Listen to them… What, monks, are the eight thoughts of a great man?\n\nThis Dhamma, monks, is for one of few desires, not for one of many desires; this Dhamma is for one who is content, not for one who is discontent; this Dhamma is for one who is secluded, not for one who delights in company; this Dhamma is for one whose energy is aroused, not for one who is lazy; this Dhamma is for one whose mindfulness is established, not for one whose mindfulness is confused; this Dhamma is for one who is concentrated, not for one who is unconcentrated; this Dhamma is for one who is wise, not for one who is unwise; this Dhamma is for one who delights in non-proliferation, not for one who delights in proliferation.”\n\n““This Dhamma, monks, is for one of few desires, not for one of many desires”—this was said. And with reference to what was this said? Here, monks, a monk, being one of few desires, does not wish, “May others know me as one of few desires.” Being content, he does not wish, “May others know me as content.” Being secluded, he does not wish, “May others know me as secluded.” Being one whose energy is aroused, he does not wish, “May others know me as one whose energy is aroused.” Being one whose mindfulness is established, he does not wish, “May others know me as one whose mindfulness is established.” Being concentrated, he does not wish, “May others know me as concentrated.” Being wise, he does not wish, “May others know me as wise.” Being one who delights in non-proliferation, he does not wish, “May others know me as one who delights in non-proliferation.” “This Dhamma, monks, is for one of few desires, not for one of many desires”—what was said, was said with reference to this.\n\n““This Dhamma, monks, is for one who is content, not for one who is discontent”—this was said. And with reference to what was this said? Here, monks, a monk is content with whatever robes, almsfood, lodging, and medicinal requisites for the sick he receives. “This Dhamma, monks, is for one who is content, not for one who is discontent”—what was said, was said with reference to this.\n\n““This Dhamma, monks, is for one who is secluded, not for one who delights in company”—this was said. And with reference to what was this said? Here, monks, when a monk dwells secluded, there come to him those who seek him out: monks, nuns, laymen, laywomen, kings, royal ministers, sectarians, and disciples of sectarians.\n\nThere, a monk, with a mind inclined towards solitude, tending towards solitude, leaning towards solitude, established in solitude, delighting in renunciation, speaks only talk connected with detachment. That which was stated thus, ‘This Dhamma, monks, is for one who is secluded, not for one delighting in company,’ was stated in reference to this. This was indeed stated: ‘This Dhamma, monks, is for one with aroused energy, not for one who is lazy.’ And what was it stated in reference to? Here, monks, a monk dwells with aroused energy for the abandoning of unwholesome states and for the acquiring of wholesome states, possessing strength, with firm effort, not abandoning the burden of practice regarding wholesome states. That which was stated thus, ‘This Dhamma, monks, is for one with aroused energy, not for one who is lazy,’ was stated in reference to this. This was indeed stated: ‘This Dhamma, monks, is for one with established mindfulness, not for one with lost mindfulness.’ And what was it stated in reference to? Here, monks, a monk is mindful, endowed with utmost vigilance and discernment, remembering and recollecting what was done and said long ago. That which was stated thus, ‘This Dhamma, monks, is for one with established mindfulness, not for one with lost mindfulness,’ was stated in reference to this. This was indeed stated: ‘This Dhamma, monks, is for one who is concentrated, not for one who is unconcentrated.’ And what was it stated in reference to? Here, monks, a monk, quite secluded from sensual pleasures... enters and dwells in the fourth jhāna. That which was stated thus, ‘This Dhamma, monks, is for one who is concentrated, not for one who is unconcentrated,’ was stated in reference to this. This was indeed stated: ‘This Dhamma, monks, is for one who is wise, not for one who is unwise.’ And what was it stated in reference to? Here, monks, a monk is wise, endowed with the wisdom that discerns rise and fall, noble, penetrative, leading to the complete destruction of suffering. That which was stated thus, ‘This Dhamma, monks, is for one who is wise, not for one who is unwise,’ was stated in reference to this. This was indeed stated: ‘This Dhamma, monks, is for one who delights in non-proliferation and rejoices in non-proliferation, not for one who delights in proliferation and rejoices in proliferation.’ And what was it stated in reference to? Here, monks, in the cessation of proliferation, the mind leaps forward, gains confidence, becomes firm, and is liberated. That which was stated thus, ‘This Dhamma, monks, is for one who delights in non-proliferation and rejoices in non-proliferation, not for one who delights in proliferation and rejoices in proliferation,’ was stated in reference to this.\n\nThen indeed, Venerable Anuruddha dwelt for another rainy season right there among the Cetis, in the Eastern Bamboo Grove. Then indeed, Venerable Anuruddha, dwelling alone, secluded, diligent, ardent, and resolute, before long—for the sake of which clansmen rightly go forth from the home life into homelessness, that supreme culmination of the holy life—he realized it for himself with direct knowledge in this very life, and entering upon it, he dwelled therein. He directly knew: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.\" And Venerable Anuruddha became one of the Arahants.\n\nThen indeed, Venerable Anuruddha, having attained arahantship, on that occasion uttered these verses:\n\"Having understood my thoughts, the Teacher, supreme in the world,\nWith a mind-made body, approached me through psychic power.\nJust as my thought had been, he taught even further than that.\nThe Buddha, delighting in non-proliferation, taught non-proliferation.\nHaving understood his Dhamma, I dwelled delighting in the Teaching.\nThe three knowledges have been attained, the Buddha's dispensation has been fulfilled.\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ භග්ග දේශයේ, සුංසුමාරගිරි නම් ස්ථානයේ, භේසකළා වනය නම් වූ මුව උයනේ වැඩසිටියහ. එ සමයෙහි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ චේතී ජනපදයේ, පාචීනවංස නම් වූ මුව උයනේ වැඩසිටියහ. එකල්හි හුදෙකලාව භාවනානුයෝගීව වැඩසිටි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙබඳු චිත්ත විතර්කයක් පහළ විය: \"මේ ධර්මය අල්පේච්ඡ පුද්ගලයා සඳහාය, මහේච්ඡ පුද්ගලයා සඳහා නොවේ; මේ ධර්මය සතුටු වූ පුද්ගලයා සඳහාය, අසතුටු පුද්ගලයා සඳහා නොවේ; මේ ධර්මය හුදෙකලාව වාසය කරන පුද්ගලයා සඳහාය, සමූහයන් කෙරෙහි ඇලෙන පුද්ගලයා සඳහා නොවේ; මේ ධර්මය වීර්යය ආරම්භ කළ පුද්ගලයා සඳහාය, අලස පුද්ගලයා සඳහා නොවේ; මේ ධර්මය පිහිටුවාගත් සිහිය ඇති පුද්ගලයා සඳහාය, සිහි කල්පනාව නැති වූ පුද්ගලයා සඳහා නොවේ; මේ ධර්මය සමාධියට පත් වූ පුද්ගලයා සඳහාය, සමාධියට නොපැමිණි පුද්ගලයා සඳහා නොවේ; මේ ධර්මය ප්‍රඥාවන්ත පුද්ගලයා සඳහාය, දුෂ්ප්‍රඥ පුද්ගලයා සඳහා නොවේ.\"\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේගේ සිතෙහි පහළ වූ චිත්ත විතර්කය තමන් වහන්සේගේ සිතින් දැන, යම් සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුව දිග හරින්නේද, දිග හැරී බාහුව හැකිලින්නේද, එපරිද්දෙන්ම භග්ග දේශයේ සුංසුමාරගිරි නම් ස්ථානයේ භේසකළා වනය නම් වූ මුව උයනේ සිට අතුරුදහන් වී, චේතී ජනපදයේ පාචීනවංස නම් වූ මුව උයනේදී ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ඉදිරියේ පහළ වූ සේක. භාග්‍යවතුන් වහන්සේ පනවන ලද අසුනෙහි වැඩසිටි සේක. ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ද භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩසිටි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"සාදු සාදු අනුරුද්ධය! අනුරුද්ධය, ඔබ විසින් \"මේ ධර්මය අල්පේච්ඡ පුද්ගලයා සඳහාය, මහේච්ඡ පුද්ගලයා සඳහා නොවේ; මේ ධර්මය සතුටු වූ පුද්ගලයා සඳහාය, අසතුටු පුද්ගලයා සඳහා නොවේ; මේ ධර්මය හුදෙකලාව වාසය කරන පුද්ගලයා සඳහාය, සමූහයන් කෙරෙහි ඇලෙන පුද්ගලයා සඳහා නොවේ; මේ ධර්මය වීර්යය ආරම්භ කළ පුද්ගලයා සඳහාය, අලස පුද්ගලයා සඳහා නොවේ; මේ ධර්මය පිහිටුවාගත් සිහිය ඇති පුද්ගලයා සඳහාය, සිහි කල්පනාව නැති වූ පුද්ගලයා සඳහා නොවේ; මේ ධර්මය සමාධියට පත් වූ පුද්ගලයා සඳහාය, සමාධියට නොපැමිණි පුද්ගලයා සඳහා නොවේ; මේ ධර්මය ප්‍රඥාවන්ත පුද්ගලයා සඳහාය, දුෂ්ප්‍රඥ පුද්ගලයා සඳහා නොවේ\" යන මේ මහාපුරුෂ විතර්කයන් මෙනෙහි කිරීම යහපති. එහෙයින් අනුරුද්ධය, ඔබ \"මේ ධර්මය ප්‍රපංච රහිත බවෙහි ඇලෙන, ප්‍රපංච රහිත බවෙහි ඇලීමෙන් සතුටු වන පුද්ගලයා සඳහාය, ප්‍රපංචයන්හි ඇලෙන, ප්‍රපංචයන්හි ඇලීමෙන් සතුටු වන පුද්ගලයා සඳහා නොවේ\" යන මේ අටවැනි මහාපුරුෂ විතර්කය ද මෙනෙහි කරන්න.\"\n\n\"අනුරුද්ධය, යම් කලෙක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නෙහිද, එකල්හි අනුරුද්ධය, ඔබ යම්තාක් කල් කැමති වන්නෙහිද, කාමයන්ගෙන් වෙන්ව ද, අකුසල ධර්මයන්ගෙන් වෙන්ව ද, විතර්ක සහිත වූ ද විචාර සහිත වූ ද විවේකයෙන් හටගත් ප්‍රීති සුවයෙන් යුක්ත වූ ද පළමු ධ්‍යානයට එළඹ වාසය කරන්නෙහි ය.\"\n\n\"අනුරුද්ධය, යම් කලෙක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නෙහිද, එකල්හි අනුරුද්ධය, ඔබ යම්තාක් කල් කැමති වන්නෙහිද, විතර්ක සහ විචාර සංසිඳීමෙන්, සිතේ අභ්‍යන්තර පැහැදීමෙන්, සිතේ එකඟ බවෙන් යුක්ත වූ, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුවයෙන් යුක්ත වූ දෙවෙනි ධ්‍යානයට එළඹ වාසය කරන්නෙහි ය.\"\n\n\"අනුරුද්ධය, යම් කලෙක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නෙහිද, එකල්හි අනුරුද්ධය, ඔබ යම්තාක් කල් කැමති වන්නෙහිද, ප්‍රීතිය කෙරෙහි ද නොඇලීමෙන්, උපේක්ෂාවෙන් ද වාසය කරමින්, සිහියෙන් හා මනා දැනීමෙන් යුක්තව, ශරීරයෙන් සුවය ද අත්විඳිමින්, ආර්යයෝ යමක් \"උපේක්ෂාවෙන් යුක්තව, සිහි නුවණින් යුක්තව, සුවයෙන් වාසය කරන්නේය\" යැයි කියත්ද, එබඳු තෙවෙනි ධ්‍යානයට එළඹ වාසය කරන්නෙහි ය.\"\n\n\"අනුරුද්ධය, යම් කලෙක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නෙහිද, එකල්හි අනුරුද්ධය, ඔබ යම්තාක් කල් කැමති වන්නෙහිද, සුවය ද දුක ද අත්හැරීමෙන්, පෙර පැවති සෝමනස්ස ද දෝමනස්ස ද නැතිවීමෙන්, දුක් නොවන සුව නොවන උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරන්නෙහි ය.\"\n\n\"අනුරුද්ධය, යම් කලෙක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නෙහිද, අභිචේතසික වූ ද, මේ ආත්මභාවයේදීම සුව විහරණය පිණිස පවතින මේ සතර ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නෙක් වන්නෙහිද, එකල්හි අනුරුද්ධය, ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ නානා වර්ණ වස්ත්‍ර පිරුණු වස්ත්‍ර කූඩයක් ඇත්තාක් මෙන්, තෘප්තිමත් ව වාසය කරන ඔබට, ඇලීම පිණිස ද, නොකැලඹීම පිණිස ද, සුවසේ විසීම පිණිස ද, නිවනට පිවිසීම පිණිස ද පන්සുകൂල චීවරය ප්‍රිය වනු ඇත.\"\n\n\"අනුරුද්ධය, යම් කලෙක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නෙහිද, අභිචේතසික වූ ද, මේ ආත්මභාවයේදීම සුව විහරණය පිණිස පවතින මේ සතර ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නෙක් වන්නෙහිද, එකල්හි අනුරුද්ධය, ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ ඉතා පිරිසිදු, බොහෝ ව්‍යංජන හා බොහෝ අනුභවයන්ගෙන් යුක්ත වූ සහල් බතක් ඇත්තාක් මෙන්, තෘප්තිමත් ව වාසය කරන ඔබට, ඇලීම පිණිස ද, නොකැලඹීම පිණිස ද, සුවසේ විසීම පිණිස ද, නිවනට පිවිසීම පිණිස ද පිණ්ඩපාතයෙන් ලබන භෝජනය ප්‍රිය වනු ඇත.\"\n\nඅනුරුද්ධයෙනි, යම් කලක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නේද, සිතෙහි විශේෂ දියුණුවක් වූ, මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිස පවතින සතර ධ්‍යානයන් කැමැති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන සුළු වන්නේද; එවිට අනුරුද්ධයෙනි, යම්සේ ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට ආලේප කර පිරිසිදු කරන ලද, සුළං රහිත වූ, දැඩි අගුලු ලන ලද, කවුළු වසා ඇති කුළුගෙයක් ප්‍රිය වන්නේද; එපරිද්දෙන්ම, සතුටින් වාසය කරන ඔබට ගස් මුල වාසය ඇලුම් කිරීම පිණිසත්, තැවීමෙන් තොරවීමටත්, පහසුවෙන් විහරණය පිණිසත්, නිවනට පිවිසීම පිණිසත් ප්‍රිය වන්නේය.\n\nඅනුරුද්ධයෙනි, යම් කලක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නේද, සිතෙහි විශේෂ දියුණුවක් වූ, මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිස පවතින සතර ධ්‍යානයන් කැමැති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන සුළු වන්නේද; එවිට අනුරුද්ධයෙනි, යම්සේ ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට එළුලොම් ඇතිරිලි ඇති, සුදු එළුලොම් ඇතිරිලි ඇති, විවිධ වර්ණ ඇතිරිලි ඇති, කදලි මුව සමින් කළ උසස් ඇතිරිලි ඇති, උඩුවියන් සහිත, දෙපස රතු කොට්ට ඇති පලඟක් ප්‍රිය වන්නේද; එපරිද්දෙන්ම, සතුටින් වාසය කරන ඔබට තණ ඇතිරිලි සහිත සයනය ඇලුම් කිරීම පිණිසත්, තැවීමෙන් තොරවීමටත්, පහසුවෙන් විහරණය පිණිසත්, නිවනට පිවිසීම පිණිසත් ප්‍රිය වන්නේය.\n\nඅනුරුද්ධයෙනි, යම් කලක ඔබ මේ අට මහාපුරුෂ විතර්කයන් මෙනෙහි කරන්නේද, සිතෙහි විශේෂ දියුණුවක් වූ, මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිස පවතින සතර ධ්‍යානයන් කැමැති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන සුළු වන්නේද; එවිට අනුරුද්ධයෙනි, යම්සේ ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට ගිතෙල්, වෙඬරු, තෙල්, මී පැණි, උක්සකුරු යන මේ නානා බෙහෙත් ප්‍රිය වන්නේද; එපරිද්දෙන්ම, සතුටින් වාසය කරන ඔබට පූතිමූත්‍ර ඖෂධය ඇලුම් කිරීම පිණිසත්, තැවීමෙන් තොරවීමටත්, පහසුවෙන් විහරණය පිණිසත්, නිවනට පිවිසීම පිණිසත් ප්‍රිය වන්නේය. එහෙයින් අනුරුද්ධයෙනි, ඉදිරි වස්කාලයේදීම ඔබ චේතිය ජනපදයේ නැගෙනහිර උණ වනයේම වාසය කරන්න.\"\n\n\"එසේය, භාග්‍යවතුන් වහන්ස\" යැයි ආයුෂ්මත් අනුරුද්ධ තෙරුන් භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. ඉන්පසු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් අනුරුද්ධ තෙරුන්ට මේ අවවාදය දී, යම්සේ බලවත් පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නේ හෝ දිග හැරී අතක් හැකිලන්නේද; එපරිද්දෙන්ම චේතිය ජනපදයේ නැගෙනහිර උණ වනයෙන් අතුරුදහන් වී භග්ග ජනපදයේ, සුංසුමාරගිරි නම් ස්ථානයේ, භේසකළා වනයේ මුව උයනේ පහළ විය.\n\nභාග්‍යවතුන් වහන්සේ පනවන ලද ආසනයෙහි වැඩහුන් සේක. වැඩහිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මම ඔබට අට මහාපුරුෂ විතර්ක දේශනා කරන්නෙමි. එය ශ්‍රවණය කරන්න... මහණෙනි, කවරේද ඒ අට මහාපුරුෂ විතර්ක? මහණෙනි, මේ ධර්මය අල්පේච්ඡ පුද්ගලයාට මිස මහා ඉච්ඡා ඇති පුද්ගලයාට නොවේ; මහණෙනි, මේ ධර්මය සතුටින් යුත් පුද්ගලයාට මිස අසතුටු පුද්ගලයාට නොවේ; මහණෙනි, මේ ධර්මය අරණ්‍ය සේනාසනවල තනිව විවේකීව වසන්නාට මිස සමූහයන්ට ඇලුණු පුද්ගලයාට නොවේ; මහණෙනි, මේ ධර්මය වීර්යය අරඹා වාසය කරන්නාට මිස කම්මැළියාට නොවේ; මහණෙනි, මේ ධර්මය සිහි කල්පනාව එළඹ සිටින්නාට මිස සිහිය නැති පුද්ගලයාට නොවේ; මහණෙනි, මේ ධර්මය සමාධියෙන් යුක්ත පුද්ගලයාට මිස අසමාහිත පුද්ගලයාට නොවේ; මහණෙනි, මේ ධර්මය ප්‍රඥාවන්තයාට මිස දුෂ්ප්‍රඥයාට නොවේ; මහණෙනි, මේ ධර්මය ප්‍රපංච රහිත බවෙහි ඇලුම් කරන්නාට හා ප්‍රපංච රහිත බවෙහි ඇලී සිටින්නාට මිස ප්‍රපංචයන්හි ඇලුම් කරන්නාට හා ප්‍රපංචයන්හි ඇලී සිටින්නාට නොවේ.\"\n\n\"මහණෙනි, මේ ධර්මය අල්පේච්ඡ පුද්ගලයාට මිස මහා ඉච්ඡා ඇති පුද්ගලයාට නොවේ\" යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දක්ද? මහණෙනි, මෙහි භික්ෂුව අල්පේච්ඡව සිට, \"මා අල්පේච්ඡයෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. සතුටු පුද්ගලයෙකු වී, \"මා සතුටු පුද්ගලයෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. විවේකීව වසන්නෙකු වී, \"මා විවේකීව වසන්නෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. වීර්යය අරඹා වසන්නෙකු වී, \"මා වීර්යය අරඹා වසන්නෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. සිහි කල්පනාව එළඹ සිටින්නෙකු වී, \"මා සිහි කල්පනාව එළඹ සිටින්නෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. සමාධියෙන් යුක්ත පුද්ගලයෙකු වී, \"මා සමාධියෙන් යුක්ත පුද්ගලයෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. ප්‍රඥාවන්තයෙකු වී, \"මා ප්‍රඥාවන්තයෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. ප්‍රපංච රහිත බවෙහි ඇලුම් කරන්නෙකු වී, \"මා ප්‍රපංච රහිත බවෙහි ඇලුම් කරන්නෙක් යැයි අන් අය දනිත්වා\" යැයි නොසිතයි. \"මහණෙනි, මේ ධර්මය අල්පේච්ඡ පුද්ගලයාට මිස මහා ඉච්ඡා ඇති පුද්ගලයාට නොවේ\" යැයි යමක් කියන ලද්දේද, එය මේ කරුණ අරමුණු කොට කියන ලද්දක්මය.\n\n\"මහණෙනි, මේ ධර්මය සතුටින් යුත් පුද්ගලයාට මිස අසතුටු පුද්ගලයාට නොවේ\" යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දක්ද? මහණෙනි, මෙහි භික්ෂුව ඕනෑම චීවරයකින්, ඕනෑම පිණ්ඩපාතයකින්, ඕනෑම සේනාසනයකින්, ඕනෑම ගිලන්පස බෙහෙත් පිරිකරකින් සතුටු වන්නේය. \"මහණෙනි, මේ ධර්මය සතුටින් යුත් පුද්ගලයාට මිස අසතුටු පුද්ගලයාට නොවේ\" යැයි යමක් කියන ලද්දේද, එය මේ කරුණ අරමුණු කොට කියන ලද්දක්මය.\n\n\"මහණෙනි, මේ ධර්මය අරණ්‍ය සේනාසනවල තනිව විවේකීව වසන්නාට මිස සමූහයන්ට ඇලුණු පුද්ගලයාට නොවේ\" යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දක්ද? මහණෙනි, මෙහි විවේකීව වසන භික්ෂුව වෙත පැමිණෙන්නෝ වෙති. එනම්: භික්ෂූහු, භික්ෂුණීහු, උපාසකවරු, උපාසිකාවෝ, රජවරු, රාජ මහාමාත්‍යවරු, තීර්ථකයෝ, තීර්ථක ශ්‍රාවකයෝය.\n\nඑහිලා භික්ෂුවක් හුදෙකලා බවට නැමුණු සිත් ඇතිව, හුදෙකලා බවට බර වූ, හුදෙකලා බවට යොමු වූ, හුදෙකලා බවෙහි පිහිටි, නෛෂ්ක්‍රම්‍යයට ප්‍රිය කරන්නෙක්ව, වෙනත් කිසිවක් නොව, විරාගයට අනුකුල වන කතාවම කරයි. “මහණෙනි, මේ ධර්මය හුදෙකලා වූවන් සඳහාය, මෙය සමූහයාට ප්‍රිය කරන්නෙකු සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, මෙය අරමුණු කොටම කියන ලදී. “මහණෙනි, මේ ධර්මය වීර්යය අරඹා වාසය කරන්නා සඳහාය, මෙය කම්මැලි පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දේද? මහණෙනි, මෙහිලා භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් සම්පූර්ණ කිරීම පිණිසත්, ශක්තිසම්පන්නව, දැඩි වීර්යයෙන් යුතුව, කුසල ධර්මයන්හි තම බර නොනැමුණු තත්වයෙන් (නොකඩවා වීර්යයෙන් යුතුව) වාසය කරයි. “මහණෙනි, මේ ධර්මය වීර්යය අරඹා වාසය කරන්නා සඳහාය, මෙය කම්මැලි පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, මෙය අරමුණු කොටම කියන ලදී. “මහණෙනි, මේ ධර්මය පිහිටි සිහි ඇති පුද්ගලයා සඳහාය, මෙය මුළා වූ සිහි ඇති පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දේද? මහණෙනි, මෙහිලා භික්ෂුව ඉතා ශ්‍රේෂ්ඨ සිහි නුවණින් යුක්තව සිහි ඇතිව වාසය කරයි. කලකට පෙර කරන ලද දෙයද, කලකට පෙර කියන ලද දෙයද සිහි කරයි, නැවත නැවත සිහි කරයි. “මහණෙනි, මේ ධර්මය පිහිටි සිහි ඇති පුද්ගලයා සඳහාය, මෙය මුළා වූ සිහි ඇති පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, මෙය අරමුණු කොටම කියන ලදී. “මහණෙනි, මේ ධර්මය සමාධියට පත් වූ පුද්ගලයා සඳහාය, මෙය සමාධියට පත් නොවූ පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දේද? මහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්ව... සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. “මහණෙනි, මේ ධර්මය සමාධියට පත් වූ පුද්ගලයා සඳහාය, මෙය සමාධියට පත් නොවූ පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, මෙය අරමුණු කොටම කියන ලදී. “මහණෙනි, මේ ධර්මය ප්‍රඥාවන්තයා සඳහාය, මෙය දුර්වල ප්‍රඥා ඇති පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දේද? මහණෙනි, මෙහිලා භික්ෂුව ආර්ය වූ, විනිවිද යන්නා වූ, දුක් ක්ෂය කරා මනාකොට පමුණුවන, උදයාස්තය දකින ප්‍රඥාවෙන් යුක්තව ප්‍රඥාවන්තයෙක්ව වාසය කරයි. “මහණෙනි, මේ ධර්මය ප්‍රඥාවන්තයා සඳහාය, මෙය දුර්වල ප්‍රඥා ඇති පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, මෙය අරමුණු කොටම කියන ලදී. “මහණෙනි, මේ ධර්මය ප්‍රපංච රහිත බවෙහි ඇලෙන්නා වූ, ප්‍රපංච රහිත බවට ප්‍රිය කරන්නා වූ පුද්ගලයා සඳහාය; මෙය ප්‍රපංචයට ඇලෙන්නා වූ, ප්‍රපංචයට ප්‍රිය කරන්නා වූ පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, එය කුමක් අරමුණු කොට කියන ලද්දේද? මහණෙනි, මෙහිලා භික්ෂුවගේ සිත ප්‍රපංච නිරෝධය (ප්‍රපංචයන්ගේ නැතිවීම) කෙරෙහි නැමෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. “මහණෙනි, මේ ධර්මය ප්‍රපංච රහිත බවෙහි ඇලෙන්නා වූ, ප්‍රපංච රහිත බවට ප්‍රිය කරන්නා වූ පුද්ගලයා සඳහාය; මෙය ප්‍රපංචයට ඇලෙන්නා වූ, ප්‍රපංචයට ප්‍රිය කරන්නා වූ පුද්ගලයා සඳහා වූ ධර්මයක් නොවේ” යැයි යමක් කියන ලද්දේද, මෙය අරමුණු කොටම කියන ලදී.\n\nඉන්පසු ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ඉදිරි වස් කාලයද, ඒ චේති ජනපදයේම, පෙරදිග උණ කැලයේම වැඩ වාසය කළ සේක. ඉන්පසු ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ තනිව, හුදෙකලාව, අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන් යුතුව, අධිෂ්ඨාන පූර්වකව වාසය කරමින්, නොබෝ කලකින්ම, යම් අර්ථයක් උදෙසා කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචාරී ජීවිතයේ කෙළවර, මෙලොවදීම තමන් විසින්ම විශේෂ ඥානයෙන් සාක්ෂාත් කොට ප්‍රත්‍යක්ෂ කොට වාසය කළ සේක. “ජාතිය ක්ෂය විය, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, නැවත මේ භවය පිණිස කළ යුතු දෙයක් නැත” යැයි උන්වහන්සේ අවබෝධ කළ සේක. තවද, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ රහතන් වහන්සේලාගෙන් කෙනෙක් වූ සේක.\n\nඉන්පසු ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ අරහත්වයට පත්වූ ඒ වේලෙහි, මේ ගාථාවන් වදාළ සේක:\n“මාගේ සංකල්පය දැන, ලොවට අනුත්තර වූ ශාස්තෘන් වහන්සේ, මනෝමය ශරීරයකින් ඍද්ධියෙන් මා වෙත පැමිණි සේක.\nමාගේ සංකල්පය යම්සේ වීද, එයටත් වඩා උතුම් ලෙස උන්වහන්සේ ධර්මය දේශනා කළ සේක. ප්‍රපංච රහිත බවෙහි ඇලුණු බුදුරජාණන් වහන්සේ, ප්‍රපංච රහිත බවම දේශනා කළ සේක.\nඋන්වහන්සේගේ ඒ ධර්මය අවබෝධ කොට, මම ශාසනයෙහි ඇලී වාසය කළෙමි. තිදස් විද්‍යාවෝ උපදවා ගන්නා ලදී, බුදුරජාණන් වහන්සේගේ ශාසනය සම්පූර්ණ කරන ලදී.”",
      "paliTitle": "Anuruddhamahāvitakkasuttaṃ",
      "englishTitle": "Anuruddha's Great Reflections Sutta",
      "sinhalaTitle": "අනුරුද්ධ මහා විතර්‍ක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Gahapativaggo tatiyo. Tassuddānaṃ – Dve uggā dve ca hatthakā, mahānāmena jīvako; Dve balā akkhaṇā vuttā, anuruddhena te dasāti.",
    "english": "The Third Section on Householders",
    "sinhala": "තෙවැනි ගහපති වග්ගය"
  }
}