{
  "id": "an8.5",
  "title": {
    "pali": "Uposathavaggo",
    "english": "The Chapter on Observance Days",
    "sinhala": "උපෝසථ වර්ගය"
  },
  "sections": [
    {
      "number": 41,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Aṭṭhaṅgasamannāgato, bhikkhave, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena [imināpi aṅgena (sī. pī.) a. ni. 3.71] arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti. ‘‘‘Yāvajīvaṃ arahanto adinnādānaṃ pahāya adinnādānā paṭiviratā dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ adinnādānaṃ pahāya adinnādānā paṭivirato dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā dutiyena aṅgena samannāgato hoti. ‘‘‘Yāvajīvaṃ arahanto abrahmacariyaṃ pahāya brahmacārino ārācārino viratā methunā gāmadhammā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ abrahmacariyaṃ pahāya brahmacārī ārācārī [anācārī (ka.)] virato methunā gāmadhammā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā tatiyena aṅgena samannāgato hoti. ‘‘‘Yāvajīvaṃ arahanto musāvādaṃ pahāya musāvādā paṭiviratā saccavādino saccasandhā thetā paccayikā avisaṃvādako lokassa. Ahaṃ pajja imañca rattiṃ imañca divasaṃ musāvādaṃ pahāya musāvādā paṭivirato saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā catutthena aṅgena samannāgato hoti. ‘‘‘Yāvajīvaṃ arahanto surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭiviratā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭivirato. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā pañcamena aṅgena samannāgato hoti. ‘‘‘Yāvajīvaṃ arahanto ekabhattikā rattūparatā viratā vikālabhojanā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ ekabhattiko rattūparato virato vikālabhojanā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā chaṭṭhena aṅgena samannāgato hoti. ‘‘‘Yāvajīvaṃ arahanto naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānaṃ pahāya naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭiviratā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānaṃ pahāya naccagītavāditavisūkadassanamālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā sattamena aṅgena samannāgato hoti. ‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Sāvatthī, at Jetavana, Anāthapiṇḍika’s Monastery.\nThere the Blessed One addressed the bhikkhus, ‘Bhikkhus.’ ‘Venerable Sir,’ those bhikkhus replied to the Blessed One. The Blessed One spoke this: ‘Bhikkhus, when the Uposatha possessed of eight factors is observed, it is of great fruit, of great benefit, of great splendor, of great pervasiveness.\n\nAnd how, Bhikkhus, is the Uposatha possessed of eight factors observed so that it is of great fruit, of great benefit, of great splendor, of great pervasiveness? Here, Bhikkhus, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned the taking of life; they are abstinent from the taking of life, having laid down rod and weapon, scrupulous, compassionate, dwelling with sympathy for all living beings. I too, for this day and night, abandon the taking of life; I am abstinent from the taking of life, having laid down rod and weapon, scrupulous, compassionate, dwelling with sympathy for all living beings. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this first factor.\n\n‘Throughout their lives, the Arahants have abandoned taking what is not given; they are abstinent from taking what is not given, taking only what is given, expecting only what is given, dwelling with an undefiled and pure self. I too, for this day and night, abandon taking what is not given; I am abstinent from taking what is not given, taking only what is given, expecting only what is given, dwelling with an undefiled and pure self. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this second factor.\n\n‘Throughout their lives, the Arahants have abandoned unchastity; they are celibate, living apart, abstaining from sexual intercourse, which is a village custom. I too, for this day and night, abandon unchastity; I am celibate, living apart, abstaining from sexual intercourse, which is a village custom. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this third factor.\n\n‘Throughout their lives, the Arahants have abandoned false speech; they are abstinent from false speech, speakers of truth, bound to truth, firm, reliable, not a deceiver of the world. I too, for this day and night, abandon false speech; I am abstinent from false speech, a speaker of truth, bound to truth, firm, reliable, not a deceiver of the world. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this fourth factor.\n\n‘Throughout their lives, the Arahants have abandoned intoxicants, which are a basis for heedlessness; they are abstinent from intoxicants, which are a basis for heedlessness. I too, for this day and night, abandon intoxicants, which are a basis for heedlessness; I am abstinent from intoxicants, which are a basis for heedlessness. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this fifth factor.\n\n‘Throughout their lives, the Arahants are one-mealers, abstaining from food at night, abstinent from food at the wrong time. I too, for this day and night, am a one-mealer, abstaining from food at night, abstinent from food at the wrong time. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this sixth factor.\n\n‘Throughout their lives, the Arahants have abandoned dancing, singing, music, and unseemly shows, and the wearing of garlands, perfumes, and ointments, and the use of adornments and embellishments; they are abstinent from dancing, singing, music, and unseemly shows, and the wearing of garlands, perfumes, and ointments, and the use of adornments and embellishments. I too, for this day and night, abandon dancing, singing, music, and unseemly shows, and the wearing of garlands, perfumes, and ointments, and the use of adornments and embellishments; I am abstinent from dancing, singing, music, and unseemly shows, and the wearing of garlands, perfumes, and ointments, and the use of adornments and embellishments. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this seventh factor.\n\n‘Throughout their lives, the Arahants have abandoned high and luxurious beds; they are abstinent from high and luxurious beds, making use of a low sleeping place – a small bed or a mat of straw. I too, for this day and night, abandon high and luxurious beds; I am abstinent from high and luxurious beds, making use of a low sleeping place – a small bed or a mat of straw. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is possessed of this eighth factor.\n\nIt is in this way, Bhikkhus, that the Uposatha possessed of eight factors, when observed, is of great fruit, of great benefit, of great splendor, of great pervasiveness.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි” කියා. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“මහණෙනි, අටඟින් යුක්ත වූ උපෝසථය රැක්කේ මහත් ඵල ඇත්තේ වෙයි, මහත් ආනිශංස ඇත්තේ වෙයි, මහත් තේජස් ඇත්තේ වෙයි, මහත් විහිදීමක් ඇත්තේ වෙයි. මහණෙනි, කෙසේ රැක්කේ නම් අටඟින් යුක්ත වූ උපෝසථය මහත් ඵල ඇත්තේ වෙයිද, මහත් ආනිශංස ඇත්තේ වෙයිද, මහත් තේජස් ඇත්තේ වෙයිද, මහත් විහිදීමක් ඇත්තේ වෙයිද?\n\nමහණෙනි, මෙහිලා ආර්ය ශ්‍රාවක තෙම මෙසේ සිහිනුවණින් විමසයි: ‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වෙන් වූවාහු, දඬුමුගුරු බහා තැබූවාහු, අවි ආයුධ බහා තැබූවාහු, පවට ලැදියාවක් නැත්තාහු, දයාවෙන් යුක්ත වූවාහු, සියලු සත්ව භූතයන්ගේ හිතසුව කැමති වන්නාහු වාසය කරති. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වෙන් වූයෙම්, දඬුමුගුරු බහා තැබූයෙම්, අවි ආයුධ බහා තැබූයෙම්, පවට ලැදියාවක් නැත්තෙම්, දයාවෙන් යුක්ත වූයෙම්, සියලු සත්ව භූතයන්ගේ හිතසුව කැමති වන්නෙම් වාසය කරමි. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ පළමුවන අංගයෙන් යුක්ත වන්නේය.\n\n‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වෙන් වූවාහු, දෙනු ලබන දෙය පමණක් ගන්නාහු, දෙනු ලබන දෙයක් බලාපොරොත්තු වන්නාහු, සොර සිතක් නැති පිරිසිදු ආත්මභාවයකින් වාසය කරති. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වෙන් වූයෙම්, දෙනු ලබන දෙය පමණක් ගන්නෙම්, දෙනු ලබන දෙයක් බලාපොරොත්තු වන්නෙම්, සොර සිතක් නැති පිරිසිදු ආත්මභාවයකින් වාසය කරමි. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ දෙවන අංගයෙන් යුක්ත වන්නේය.\n\n‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා අබ්‍රහ්මචර්යාව අත්හැර, බ්‍රහ්මචාරී වූවාහු, දුරාචාරයෙන් ඉතා දුරස් වූවාහු, මෛථුන ග්‍රාම්‍ය ධර්මයෙන් වෙන් වූවාහු වෙති. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද අබ්‍රහ්මචර්යාව අත්හැර, බ්‍රහ්මචාරී වූයෙම්, දුරාචාරයෙන් ඉතා දුරස් වූයෙම්, මෛථුන ග්‍රාම්‍ය ධර්මයෙන් වෙන් වූයෙම් වාසය කරමි. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ තෙවන අංගයෙන් යුක්ත වන්නේය.\n\n‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා මුසාවාදය අත්හැර, මුසාවාදයෙන් වෙන් වූවාහු, සත්‍යවාදී වූවාහු, සත්‍යයට අනුකූල වූවාහු, ස්ථිර වූවාහු, විශ්වාස කටයුතු වූවාහු, ලෝකයා රවටන්නෝ නො වූවාහු වෙති. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද මුසාවාදය අත්හැර, මුසාවාදයෙන් වෙන් වූයෙම්, සත්‍යවාදී වූයෙම්, සත්‍යයට අනුකූල වූයෙම්, ස්ථිර වූයෙම්, විශ්වාස කටයුතු වූයෙම්, ලෝකයා රවටන්නෙක් නො වූයෙම් වාසය කරමි. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ සතරවන අංගයෙන් යුක්ත වන්නේය.\n\n‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා සුරා මේරය මද්‍යපානයෙන් සිදු වන ප්‍රමාදයට හේතු වන සියල්ල අත්හැර, සුරා මේරය මද්‍යපානයෙන් සිදු වන ප්‍රමාදයට හේතු වන සියල්ලෙන් වෙන් වූවාහු වෙති. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද සුරා මේරය මද්‍යපානයෙන් සිදු වන ප්‍රමාදයට හේතු වන සියල්ල අත්හැර, සුරා මේරය මද්‍යපානයෙන් සිදු වන ප්‍රමාදයට හේතු වන සියල්ලෙන් වෙන් වූයෙම් වාසය කරමි. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ පස්වන අංගයෙන් යුක්ත වන්නේය.\n\n‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා එක් වේලක් පමණක් වළඳන්නාහු, රාත්‍රියෙහි ආහාර ගැනීමෙන් වැළකුණාහු, විකාල භෝජනයෙන් වෙන් වූවාහු වෙති. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද එක් වේලක් පමණක් වළඳන්නෙම්, රාත්‍රියෙහි ආහාර ගැනීමෙන් වැළකුණා වූයෙම්, විකාල භෝජනයෙන් වෙන් වූයෙම් වාසය කරමි. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ සයවන අංගයෙන් යුක්ත වන්නේය.\n\n‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා නැටුම්, ගීත ගැයීම්, වාදනයන්, විවිධ වූ නුසුදුසු දැකීම්, මල් ගන්ධ විලවුන් දැරීම්, මණ්ඩනයන්, විභූෂණයන් අත්හැර, නැටුම්, ගීත ගැයීම්, වාදනයන්, විවිධ වූ නුසුදුසු දැකීම්, මල් ගන්ධ විලවුන් දැරීම්, මණ්ඩනයන්, විභූෂණයන්ගෙන් වෙන් වූවාහු වෙති. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද නැටුම්, ගීත ගැයීම්, වාදනයන්, විවිධ වූ නුසුදුසු දැකීම්, මල් ගන්ධ විලවුන් දැරීම්, මණ්ඩනයන්, විභූෂණයන් අත්හැර, නැටුම්, ගීත ගැයීම්, වාදනයන්, විවිධ වූ නුසුදුසු දැකීම්, මල් ගන්ධ විලවුන් දැරීම්, මණ්ඩනයන්, විභූෂණයන්ගෙන් වෙන් වූයෙම් වාසය කරමි. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ සත්වන අංගයෙන් යුක්ත වන්නේය.\n\n‘යම්තාක් කල් ජීවත් වනවාද, ඒ තාක් කල් රහතන් වහන්සේලා උස් අසුන් මහා අසුන් අත්හැර, උස් අසුන් මහා අසුන්ගෙන් වෙන් වූවාහු, පහත් සයනයක් කල්පනය කරති – එනම් ලී මංචකයක හෝ තණ ඇතිරිල්ලක හෝය. මමද අද මේ රාත්‍රියෙහිද, මේ දිවා කාලයෙහිද උස් අසුන් මහා අසුන් අත්හැර, උස් අසුන් මහා අසුන්ගෙන් වෙන් වූයෙම්, පහත් සයනයක් කල්පනය කරමි – එනම් ලී මංචකයක හෝ තණ ඇතිරිල්ලක හෝය. මේ අංගයෙන්ද මම රහතන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද රක්නා ලද්දක් වන්නේය’ කියා. මේ අටවන අංගයෙන් යුක්ත වන්නේය.\n\nමහණෙනි, මෙසේ රක්නා ලද්දා වූ අටඟින් යුක්ත උපෝසථය මහත් ඵල ඇත්තේ වෙයි, මහත් ආනිශංස ඇත්තේ වෙයි, මහත් තේජස් ඇත්තේ වෙයි, මහත් විහිදීමක් ඇත්තේ වෙයි” යි වදාළ සේක.\nපළමුවෙනි සූත්‍රයයි.",
      "paliTitle": "Saṅkhittūposathasuttaṃ",
      "englishTitle": "Brief Uposatha Sutta",
      "sinhalaTitle": "සංක්ෂිප්ත උපෝසථ සූත්‍රය"
    },
    {
      "number": 42,
      "pali": "‘‘Aṭṭhaṅgasamannāgato, bhikkhave, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…. ‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bhikkhave, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. ‘‘Kīvamahapphalo hoti kīvamahānisaṃso kīvamahājutiko kīvamahāvipphāro? Seyyathāpi, bhikkhave, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ [pahūtasattaratanānaṃ (sī. syā. kaṃ. pī.) a. ni. 3.71 pāḷiyā ṭīkāyaṃ dassitapāḷiyeva. tadaṭṭhakathāpi passitabbā] issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ [majjānaṃ (ka.)] sūrasenānaṃ assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ [ekaṃ (ka.)] kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, bhikkhave, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya. ‘‘Yāni, bhikkhave, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo [rattidivo (ka.)]. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, bhikkhave, mānusakāni vassasatāni, tāvatiṃsānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbaṃ vassasahassaṃ tāvatiṃsānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, bhikkhave, mānusakāni dve vassasatāni, yāmānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni dve vassasahassāni yāmānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā yāmānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, bhikkhave, mānusakāni cattāri vassasatāni, tusitānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni cattāri vassasahassāni tusitānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tusitānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, bhikkhave, mānusakāni aṭṭha vassasatāni, nimmānaratīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni aṭṭha vassasahassāni nimmānaratīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā nimmānaratīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, bhikkhave, mānusakāni soḷasa vassasatāni, paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bhikkhave, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti. ‘‘Pāṇaṃ na haññe [hāne (sī.), hena (ka.) a. ni. 3.71] na cadinnamādiye, Musā na bhāse na ca majjapo siyā; Abrahmacariyā virameyya methunā, Rattiṃ na bhuñjeyya vikālabhojanaṃ. ‘‘Mālaṃ na dhāre na ca gandhamācare [gandhamādhare (ka.)], Mañce chamāyaṃ va sayetha santhate; Etañhi aṭṭhaṅgikamāhuposathaṃ, Buddhena dukkhantagunā pakāsitaṃ. ‘‘Cando ca suriyo ca ubho sudassanā, Obhāsayaṃ anupariyanti yāvatā; Tamonudā te pana antalikkhagā, Nabhe pabhāsanti disāvirocanā. ‘‘Etasmiṃ yaṃ vijjati antare dhanaṃ, Muttā maṇi veḷuriyañca bhaddakaṃ; Siṅgīsuvaṇṇaṃ atha vāpi kañcanaṃ, Yaṃ jātarūpaṃ haṭakanti vuccati. ‘‘Aṭṭhaṅgupetassa uposathassa, Kalampi te nānubhavanti soḷasiṃ; Candappabhā tāragaṇā ca sabbe. ‘‘Tasmā hi nārī ca naro ca sīlavā, Aṭṭhaṅgupetaṃ upavassuposathaṃ; Puññāni katvāna sukhudrayāni, Aninditā saggamupenti ṭhāna’’nti. dutiyaṃ;",
      "english": "Monks, the Uposatha observance, when observed with its eight factors, is of great fruit, great benefit, great splendor, and great pervasiveness. And how, monks, is the Uposatha observance, when observed with its eight factors, of great fruit, great benefit, great splendor, and great pervasiveness? Here, monks, a noble disciple wisely reflects: ‘As long as they live, the Arahants, having abandoned the taking of life, abstain from the taking of life, having laid aside rod and weapon, are conscientious and full of compassion, dwelling with compassionate concern for the welfare of all living beings. Today, for this night and this day, I, having abandoned the taking of life, abstain from the taking of life, having laid aside rod and weapon, am conscientious and full of compassion, dwelling with compassionate concern for the welfare of all living beings. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is endowed with this first factor, and so forth.\n\n‘As long as they live, the Arahants, having abandoned high and luxurious beds and seats, abstain from high and luxurious beds and seats, and make low beds – on a cot or on a straw mat. Today, for this night and this day, I, having abandoned high and luxurious beds and seats, abstain from high and luxurious beds and seats, and make a low bed – on a cot or on a straw mat. By this factor, I emulate the Arahants, and my Uposatha will be observed.’ He is endowed with this eighth factor. It is in this way, monks, that the Uposatha observance, when observed with its eight factors, is of great fruit, great benefit, great splendor, and great pervasiveness.\n\nOf what great fruit, what great benefit, what great splendor, what great pervasiveness is it? Monks, suppose someone would rule with sovereignty and supreme power over these sixteen great countries, which are endowed with abundant precious things – namely, Anga, Magadha, Kasi, Kosala, Vajji, Malla, Ceti, Vanga, Kuru, Pañcala, Maccha, Surasena, Assaka, Avanti, Gandhara, and Kamboja – this would not be worth a sixteenth part of the Uposatha endowed with its eight factors. For what reason? Monks, human sovereignty is paltry compared to divine bliss.\n\nMonks, fifty human years are one day and night for the devas of the Four Great Kings. Thirty such nights make a month. Twelve such months make a year. By that year, the lifespan of the devas of the Four Great Kings is five hundred divine years. And there is this possibility, monks, that a certain man or woman here, having observed the Uposatha endowed with its eight factors, after the dissolution of the body and after death, would be reborn in the company of the devas of the Four Great Kings. It is with reference to this, monks, that it was said: ‘Human sovereignty is paltry compared to divine bliss.’\n\nMonks, one hundred human years are one day and night for the Tāvatiṃsā devas. Thirty such nights make a month. Twelve such months make a year. By that year, the lifespan of the Tāvatiṃsā devas is one thousand divine years. And there is this possibility, monks, that a certain man or woman here, having observed the Uposatha endowed with its eight factors, after the dissolution of the body and after death, would be reborn in the company of the Tāvatiṃsā devas. It is with reference to this, monks, that it was said: ‘Human sovereignty is paltry compared to divine bliss.’\n\nMonks, two hundred human years are one day and night for the Yāmā devas. Thirty such nights make a month. Twelve such months make a year. By that year, the lifespan of the Yāmā devas is two thousand divine years. And there is this possibility, monks, that a certain man or woman here, having observed the Uposatha endowed with its eight factors, after the dissolution of the body and after death, would be reborn in the company of the Yāmā devas. It is with reference to this, monks, that it was said: ‘Human sovereignty is paltry compared to divine bliss.’\n\nMonks, four hundred human years are one day and night for the Tusitā devas. Thirty such nights make a month. Twelve such months make a year. By that year, the lifespan of the Tusitā devas is four thousand divine years. And there is this possibility, monks, that a certain man or woman here, having observed the Uposatha endowed with its eight factors, after the dissolution of the body and after death, would be reborn in the company of the Tusitā devas. It is with reference to this, monks, that it was said: ‘Human sovereignty is paltry compared to divine bliss.’\n\nBhikkhus, eight hundred human years constitute one day and night for the Nimmānaratī gods. Thirty such days and nights constitute their month. By that month, twelve months make their year. By that year, eight thousand divine years is the lifespan of the Nimmānaratī gods. Indeed, Bhikkhus, this is a possibility, that some woman or man, having observed the Uposatha endowed with eight factors, upon the breaking up of the body, after death, might reappear in companionship with the Nimmānaratī gods. It was with this in mind, Bhikkhus, that it was said: ‘Human kingship is wretched compared to divine happiness.’ Bhikkhus, sixteen hundred human years constitute one day and night for the Paranimmitavasavattī gods. Thirty such days and nights constitute their month. By that month, twelve months make their year. By that year, sixteen thousand divine years is the lifespan of the Paranimmitavasavattī gods. Indeed, Bhikkhus, this is a possibility, that some woman or man, having observed the Uposatha endowed with eight factors, upon the breaking up of the body, after death, might reappear in companionship with the Paranimmitavasavattī gods. It was with this in mind, Bhikkhus, that it was said: ‘Human kingship is wretched compared to divine happiness.’\n\nOne should not kill living beings, nor take what is not given. One should not speak falsely, nor be a consumer of intoxicants. One should abstain from unchastity, from sexual intercourse. One should not eat in the night, at the wrong time. One should not wear garlands, nor apply perfumes. One should lie on a low bed or on a mat spread on the ground. This, indeed, is called the eight-factored Uposatha, proclaimed by the Buddha, the one who knows the end of suffering.\n\nThe moon and the sun, both beautiful to behold, illuminate as they revolve to their full extent. They dispel darkness, moving through the sky, shining in the firmament, illuminating the quarters. Whatever wealth exists within this sphere – pearls, gems, fine lapis lazuli, pure gold or indeed gold, which is called refined gold; all those things, including the moon's radiance and all the star clusters – do not amount to even a sixteenth part of the eight-factored Uposatha.\n\nTherefore, any virtuous woman or man, who observes the Uposatha endowed with eight factors, having performed meritorious deeds conducive to happiness, blameless, reaches the heavenly state.",
      "sinhala": "මහණෙනි, අට'ග සම'ගින් යුත් උපෝසථය සමාදන් වූ කල්හි මහත් ඵලදායකය, මහත් ආනිසංස ඇතිය, මහත් තේජස් ඇතිය, මහත් ප්‍රභාවක් විහිදුවයි. මහණෙනි, අට'ග සම'ගින් යුත් උපෝසථය කෙසේ සමාදන් වූ කල්හි මහත් ඵලදායක වන්නේද, මහත් ආනිසංස ඇති වන්නේද, මහත් තේජස් ඇති වන්නේද, මහත් ප්‍රභාවක් විහිදුවන්නේද? මහණෙනි, මෙහිදී ආර්‍ය්‍ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘යම්තාක් කල් රහතන් වහන්සේලා ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකී, දඬුමුගුරු බහා තබා, අවි ආයුධ බහා තබා, හිරි ඇතිව, කරුණාවෙන් යුතුව, සියලු සත්ත්වයන්ට හිතසුව පිණිස අනුකම්පාවෙන් වාසය කරති. මම අද මේ රැය සහ මේ දවස ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකී, දඬුමුගුරු බහා තබා, අවි ආයුධ බහා තබා, හිරි ඇතිව, කරුණාවෙන් යුතුව, සියලු සත්ත්වයන්ට හිතසුව පිණිස අනුකම්පාවෙන් වාසය කරමි. මේ අංගයෙන් මම රහතන් වහන්සේලා අනුකරණය කරමි, එබැවින් මා විසින් සමාදන් වූ උපෝසථය සිදුවන්නේය.’ මේ පළමු අංගයෙන් යුක්ත වන්නේය. ...යම්තාක් කල් රහතන් වහන්සේලා උස් ආසන මහා ආසන අත්හැර, උස් ආසන මහා ආසනවලින් වැළකී, යහනක හෝ තණ ඇතිරිල්ලක හෝ පහත් සයනයන් (නිදන ඇඳන්) භාවිතා කරති. මම අද මේ රැය සහ මේ දවස උස් ආසන මහා ආසන අත්හැර, උස් ආසන මහා ආසනවලින් වැළකී, යහනක හෝ තණ ඇතිරිල්ලක හෝ පහත් සයනයන් (නිදන ඇඳන්) භාවිතා කරමි. මේ අංගයෙන් මම රහතන් වහන්සේලා අනුකරණය කරමි, එබැවින් මා විසින් සමාදන් වූ උපෝසථය සිදුවන්නේය.’ මේ අටවෙනි අංගයෙන් යුක්ත වන්නේය. මහණෙනි, මෙසේ සමාදන් වූ අට'ග සම'ගින් යුත් උපෝසථය මහත් ඵලදායකය, මහත් ආනිසංස ඇතිය, මහත් තේජස් ඇතිය, මහත් ප්‍රභාවක් විහිදුවයි.\n\nමහණෙනි, කෙතරම් මහා ඵලදායකද, කෙතරම් මහා ආනිසංස ඇතිද, කෙතරම් මහත් තේජස් ඇතිද, කෙතරම් මහත් ප්‍රභාවක් විහිදුවයිද? මහණෙනි, යම් සේ මේ සොළොස් මහා ජනපදයන්හි (ඒවා නම්: අංග, මගධ, කාසි, කෝසල, වජ්ජී, මල්ල, චේති, වංග, කුරු, පංචාල, මච්ඡ, සූරසේන, අස්සක, අවන්තී, ගාන්ධාර, කාම්බෝජ) බොහෝ රත්න සම්පත් ඇති, ඉසුරු භාවයත් ආධිපත්‍යයත් ඇති රාජ්‍යයක් යමෙක් පාලනය කරන්නේ නම්, අට'ග සම'ගින් යුත් උපෝසථයට එයින් (එනම්, මේ රාජ්‍ය සම්පත්තියෙන්) සොළොස් කලාවෙන් එකක් තරම් වටින්නේ නැත. එයට හේතුව කුමක්ද? මහණෙනි, දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය ඉතා අල්පය.\n\nමහණෙනි, මනුෂ්‍ය වර්ෂ පනහක් යනු චාතුම්මහාරාජික දෙවියන්ගේ එක් දිනක් හා එක් රාත්‍රියකි. ඒ රාත්‍රියෙන් (දිනයෙන්) තිස් රාත්‍රියක් (දිනක්) මාසයකි. ඒ මාසයෙන් දොළොස් මාසයක් වර්ෂයකි. ඒ වර්ෂයෙන් දිව්‍ය වර්ෂ පන්සියයක් චාතුම්මහාරාජික දෙවියන්ගේ ආයුෂ ප්‍රමාණයයි. මහණෙනි, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අට'ග සම'ගින් යුත් උපෝසථය සමාදන්ව, ශරීරය බිඳී මරණින් මතු චාතුම්මහාරාජික දෙවියන්ගේ සහවාසයට පැමිණිය හැකිය යන මෙය සිදුවිය හැකි කරුණකි. මහණෙනි, ‘දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය ඉතා අල්පය’ යන මේ කාරණය අරභයා මේ කියන ලද්දේය.\n\nමහණෙනි, මනුෂ්‍ය වර්ෂ සියයක් යනු තාවතිංස දෙවියන්ගේ එක් දිනක් හා එක් රාත්‍රියකි. ඒ රාත්‍රියෙන් (දිනයෙන්) තිස් රාත්‍රියක් (දිනක්) මාසයකි. ඒ මාසයෙන් දොළොස් මාසයක් වර්ෂයකි. ඒ වර්ෂයෙන් දිව්‍ය වර්ෂ දහසක් තාවතිංස දෙවියන්ගේ ආයුෂ ප්‍රමාණයයි. මහණෙනි, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අට'ග සම'ගින් යුත් උපෝසථය සමාදන්ව, ශරීරය බිඳී මරණින් මතු තාවතිංස දෙවියන්ගේ සහවාසයට පැමිණිය හැකිය යන මෙය සිදුවිය හැකි කරුණකි. මහණෙනි, ‘දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය ඉතා අල්පය’ යන මේ කාරණය අරභයා මේ කියන ලද්දේය.\n\nමහණෙනි, මනුෂ්‍ය වර්ෂ දෙසීයක් යනු යාම දෙවියන්ගේ එක් දිනක් හා එක් රාත්‍රියකි. ඒ රාත්‍රියෙන් (දිනයෙන්) තිස් රාත්‍රියක් (දිනක්) මාසයකි. ඒ මාසයෙන් දොළොස් මාසයක් වර්ෂයකි. ඒ වර්ෂයෙන් දිව්‍ය වර්ෂ දෙදහසක් යාම දෙවියන්ගේ ආයුෂ ප්‍රමාණයයි. මහණෙනි, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අට'ග සම'ගින් යුත් උපෝසථය සමාදන්ව, ශරීරය බිඳී මරණින් මතු යාම දෙවියන්ගේ සහවාසයට පැමිණිය හැකිය යන මෙය සිදුවිය හැකි කරුණකි. මහණෙනි, ‘දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය ඉතා අල්පය’ යන මේ කාරණය අරභයා මේ කියන ලද්දේය.\n\nමහණෙනි, මනුෂ්‍ය වර්ෂ හාරසීයක් යනු තුසිත දෙවියන්ගේ එක් දිනක් හා එක් රාත්‍රියකි. ඒ රාත්‍රියෙන් (දිනයෙන්) තිස් රාත්‍රියක් (දිනක්) මාසයකි. ඒ මාසයෙන් දොළොස් මාසයක් වර්ෂයකි. ඒ වර්ෂයෙන් දිව්‍ය වර්ෂ හාරදහසක් තුසිත දෙවියන්ගේ ආයුෂ ප්‍රමාණයයි. මහණෙනි, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අට'ග සම'ගින් යුත් උපෝසථය සමාදන්ව, ශරීරය බිඳී මරණින් මතු තුසිත දෙවියන්ගේ සහවාසයට පැමිණිය හැකිය යන මෙය සිදුවිය හැකි කරුණකි. මහණෙනි, ‘දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය ඉතා අල්පය’ යන මේ කාරණය අරභයා මේ කියන ලද්දේය.\n\nභික්‍ෂූනි, මිනිස් වර්ෂ අටසියයක් යනු නිම්මානරතී දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රී තිහක් ඔවුන්ගේ එක් මාසයකි. ඒ මාස දොළහක් ඔවුන්ගේ එක් වර්ෂයකි. එම වර්ෂයෙන් දිව්‍යමය වර්ෂ අටදහසක් නිම්මානරතී දෙවියන්ගේ ආයුෂ ප්‍රමාණය වේ. භික්‍ෂූනි, යම් ස්ත්‍රියක් හෝ පුරුෂයෙක් අට අඟකින් යුක්ත වූ පොහොය සීලය සමාදන්ව, කය බිඳී මරණින් මතු නිම්මානරතී දෙවියන් සමඟ සහවාසයට පත්වීම නම් වූ කරුණක් ඇත. භික්‍ෂූනි, 'දිව්‍යමය සැපය හා සසඳන කල මිනිස් රාජ්‍යය දුප්පත් ය' යැයි මෙසේ දේශනා කරන ලද්දේ මේ කරුණ අරමුණු කරගෙනය.\n\nභික්‍ෂූනි, මිනිස් වර්ෂ දහසයසියයක් යනු පරනිම්මිතවසවත්ති දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රී තිහක් ඔවුන්ගේ එක් මාසයකි. ඒ මාස දොළහක් ඔවුන්ගේ එක් වර්ෂයකි. එම වර්ෂයෙන් දිව්‍යමය වර්ෂ දහසයදහසක් පරනිම්මිතවසවත්ති දෙවියන්ගේ ආයුෂ ප්‍රමාණය වේ. භික්‍ෂූනි, යම් ස්ත්‍රියක් හෝ පුරුෂයෙක් අට අඟකින් යුක්ත වූ පොහොය සීලය සමාදන්ව, කය බිඳී මරණින් මතු පරනිම්මිතවසවත්ති දෙවියන් සමඟ සහවාසයට පත්වීම නම් වූ කරුණක් ඇත. භික්‍ෂූනි, 'දිව්‍යමය සැපය හා සසඳන කල මිනිස් රාජ්‍යය දුප්පත් ය' යැයි මෙසේ දේශනා කරන ලද්දේ මේ කරුණ අරමුණු කරගෙනය.\n\nප්‍රාණඝාතයෙන් වැළකිය යුතුය, අනුන් සතු නොවූ දෙයක් නොගත යුතුය.\nබොරු නොකළ යුතුය, මත්පැන් නොබොන සුළු විය යුතුය.\nකාම සේවනයෙන් වැළකිය යුතුය.\nරාත්‍රී කාලයේ විකාල භෝජනය නොගත යුතුය.\n\nමල්මාලා නොදැරිය යුතුය, සුවඳ විලවුන් නොගැල්විය යුතුය.\nඋස් අසුන් හා මහා ආසන, සයනයන්ගෙන් වැළකී බිම හෝ සරල ඇතිරිල්ලක සයනය කළ යුතුය.\nමේ අංග අටකින් යුතු පොහොය සීලය, දුක කෙළවර කිරීමේ ගුණයෙන් යුතු බුදුරජාණන් වහන්සේ විසින් ප්‍රකාශ කරන ලදී.\n\nසඳ හා හිරු දෙදෙනාම ඉතා ප්‍රිය දසුන් ය.\nප්‍රබෝධමත් කරමින් හැම තැනම සැරිසරති.\nඔවුන් අන්ධකාරය දුරු කරන්නෝ ය, අහසෙහි ගමන් කරන්නෝ ය.\nදිශාවන් ආලෝකවත් කරමින් අහසෙහි බබළති.\n\nමේ අතරමැද ඇති යම් ධනයක් වේ ද,\nමුතු, මැණික්, යහපත් වෛවූර්‍යය ද වේ ද,\nසීග්‍ර රන්, එසේත් නැතහොත් කාංචන රන්, හෝ\nයමක් ජාත රූප හටක ලෙස කියනු ලැබේ ද,\n\nඅට අඟකින් යුතු වූ පොහොය සීලයේ කුසලයට, පෙර කී ධනය ද, සඳ එළිය හා සියලු තාරකා සමූහයාගේ ආලෝකය ද, දහසයයෙන් එක් කොටසකටවත් සම නොවේ.\n\nඑබැවින්, සිල්වත් ස්ත්‍රී පුරුෂ දෙදෙනා, අට අඟකින් යුතු පොහොය සීලය සමාදන්ව වාසය කළ යුතුය. සැප ගෙන දෙන පින් රැස්කර ගෙන, නින්දාවට පත් නොවී, ස්වර්ග නම් ස්ථානයට පැමිණෙති.",
      "paliTitle": "Vitthatūposathasuttaṃ",
      "englishTitle": "The Detailed Uposatha Discourse",
      "sinhalaTitle": "විස්තීර්‍ණ උපෝසථ සූත්‍රය"
    },
    {
      "number": 43,
      "pali": "[a. ni. 3.71] Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca – ‘‘aṭṭhaṅgasamannāgato kho, visākhe, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, visākhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, visākhe, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’’’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…. ‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, visākhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. ‘‘Kīvamahapphalo hoti, kīvamahānisaṃso, kīvamahājutiko, kīvamahāvipphāro? Seyyathāpi, visākhe, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ sūrasenānaṃ assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, visākhe, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya. ‘‘Yāni, visākhe, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yaṃ, visākhe, mānusakaṃ vassasataṃ, tāvatiṃsānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena vassasahassaṃ tāvatiṃsānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā tāvatiṃsānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yāni, visākhe, mānusakāni dve vassasatāni…pe… cattāri vassasatāni…pe… aṭṭha vassasatāni… pe… soḷasa vassasatāni paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, visākhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, visākhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti. ‘‘Pāṇaṃ na haññe na cadinnamādiye, Musā na bhāse na ca majjapo siyā; Abrahmacariyā virameyya methunā, Rattiṃ na bhuñjeyya vikālabhojanaṃ. ‘‘Mālaṃ na dhāre na ca gandhamācare, Mañce chamāyaṃ va sayetha santhate; Etañhi aṭṭhaṅgikamāhuposathaṃ, Buddhena dukkhantagunā pakāsitaṃ. ‘‘Cando ca suriyo ca ubho sudassanā, Obhāsayaṃ anupariyanti yāvatā; Tamonudā te pana antalikkhagā, Nabhe pabhāsanti disāvirocanā. ‘‘Etasmiṃ yaṃ vijjati antare dhanaṃ, Muttā maṇi veḷuriyañca bhaddakaṃ; Siṅgīsuvaṇṇaṃ atha vāpi kañcanaṃ, Yaṃ jātarūpaṃ haṭakanti vuccati. ‘‘Aṭṭhaṅgupetassa uposathassa, Kalampi te nānubhavanti soḷasiṃ; Candappabhā tāragaṇā ca sabbe. ‘‘Tasmā hi nārī ca naro ca sīlavā, Aṭṭhaṅgupetaṃ upavassuposathaṃ; Puññāni katvāna sukhudrayāni, Aninditā saggamupenti ṭhāna’’nti. tatiyaṃ;",
      "english": "On one occasion the Blessed One was dwelling at Sāvatthī, in the Eastern Monastery, in Migāra's Mother's Palace. Then Visākhā, Migāra's mother, approached the Blessed One. Having approached, she paid homage to the Blessed One and sat down to one side. To Visākhā, Migāra's mother, who was seated to one side, the Blessed One spoke thus:\n\n\"Visākhā, when the Uposatha, endowed with eight factors, is observed, it is of great fruit, of great benefit, of great splendor, of great pervasiveness. And how, Visākhā, when observed, is the Uposatha, endowed with eight factors, of great fruit, of great benefit, of great splendor, of great pervasiveness?\n\nHere, Visākhā, a noble disciple reflects thus: 'For their entire lives, the Arahants, abandoning the destruction of life, abstain from the destruction of life, having laid down the rod, having laid down the weapon, conscientious, full of compassion, dwelling with sympathy for the welfare of all living beings. Today, for this night and this day, I, abandoning the destruction of life, abstain from the destruction of life, having laid down the rod, having laid down the weapon, conscientious, full of compassion, dwelling with sympathy for the welfare of all living beings. By this factor, I emulate the Arahants, and my Uposatha will be observed.' With this first factor, one is endowed.\n\n'For their entire lives, the Arahants, abandoning high and luxurious beds, abstain from high and luxurious beds; they make use of a low sleeping place – either on a couch or on a straw mat. Today, for this night and this day, I, abandoning high and luxurious beds, abstain from high and luxurious beds; I make use of a low sleeping place – either on a couch or on a straw mat. By this factor, I emulate the Arahants, and my Uposatha will be observed.' With this eighth factor, one is endowed.\n\nVisākhā, when the Uposatha, endowed with eight factors, is observed in this way, it is of great fruit, of great benefit, of great splendor, of great pervasiveness.\n\n'Of what great fruit is it, of what great benefit, of what great splendor, of what great pervasiveness? Just as, Visākhā, if someone were to rule over these sixteen great countries – which are abundant with various treasures – exercising sovereignty and dominion, namely, Aṅga, Magadha, Kāsī, Kosala, Vajji, Malla, Cetī, Vaṅga, Kurū, Pañcāla, Maccha, Sūrasena, Assaka, Avantī, Gandhāra, Kambojā – this [rule] is not worth a sixteenth part of the Uposatha endowed with eight factors. And why is that? Because, Visākhā, human sovereignty is paltry compared to divine happiness.'\n\n'Visākhā, fifty human years amount to one day and night for the devas of the Four Great Kings. Thirty such days and nights make one month. Twelve such months make one year. And by that year, the lifespan of the devas of the Four Great Kings is five hundred divine years. It is indeed possible, Visākhā, that some woman or man here, having observed the Uposatha endowed with eight factors, upon the breaking up of the body, after death, may be reborn into the companionship of the devas of the Four Great Kings. It was with this in mind, Visākhā, that it was said: \"Human sovereignty is paltry compared to divine happiness.\"'\n\n'Visākhā, one hundred human years amount to one day and night for the devas of the Tāvatiṃsa realm. Thirty such days and nights make one month. Twelve such months make one year. And by that year, the lifespan of the Tāvatiṃsa devas is one thousand divine years. It is indeed possible, Visākhā, that some woman or man here, having observed the Uposatha endowed with eight factors, upon the breaking up of the body, after death, may be reborn into the companionship of the Tāvatiṃsa devas. It was with this in mind, Visākhā, that it was said: \"Human sovereignty is paltry compared to divine happiness.\"'\n\n'Visākhā, sixteen hundred human years amount to one day and night for the devas who Wield Power over Others' Creations. Thirty such days and nights make one month. Twelve such months make one year. And by that year, the lifespan of the devas who Wield Power over Others' Creations is sixteen thousand divine years. It is indeed possible, Visākhā, that some woman or man here, having observed the Uposatha endowed with eight factors, upon the breaking up of the body, after death, may be reborn into the companionship of the devas who Wield Power over Others' Creations. It was with this in mind, Visākhā, that it was said: \"Human sovereignty is paltry compared to divine happiness.\"'\n\n'One should not kill living beings, nor take what is not given.\nOne should not speak falsely, nor indulge in intoxicants.\nOne should abstain from unchastity and sexual intercourse.\nOne should not eat at night, out of time.\n\nOne should not wear garlands, nor use perfumes.\nOne should sleep on a low bed or a mat on the ground.\nThis indeed is called the eight-factored Uposatha,\nproclaimed by the Buddha, who possesses the qualities leading to the end of suffering.'\n\nThe moon and the sun, both are pleasant to behold, illuminating all as far as they wander. They are dispellers of darkness, moving through space, shining in the sky and illuminating the directions.\n\nWhatever wealth exists on earth, such as pearls, jewels, excellent lapis lazuli, fine gold, or even raw gold, that which is called native gold—\n\nThe moon’s radiance and all the clusters of stars do not amount to even a sixteenth part of the Uposatha observance endowed with eight factors.\n\nTherefore, both women and men who are virtuous, having undertaken the Uposatha endowed with eight factors, and having performed meritorious deeds leading to happiness, unblamed, they go to a heavenly abode.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයෙහි මිගාරමාතු ප්‍රාසාදයෙහි වැඩවසන සේක. එකල්හි විශාඛා මිගාරමාතාවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියාය. එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක වැඩහුන්නාය. එකත්පසෙක වැඩහුන් විශාඛා මිගාරමාතාවට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"විශාඛාවෙනි, අටඟ සමන්විත වූ උපවාසයෙහි (උපෝසථ සීලයෙහි) හික්මුණා වූ පුද්ගලයාට මහත් ඵල ඇත්තේය, මහත් ආනිශංස ඇත්තේය, මහත් තේජස් ඇත්තේය, මහත් විහිදීමක් ඇත්තේය. විශාඛාවෙනි, කෙසේ හික්මුණු කල අටඟ සමන්විත උපවාසය (උපෝසථ සීලය) මහත් ඵල ඇත්තේ, මහත් ආනිශංස ඇත්තේ, මහත් තේජස් ඇත්තේ, මහත් විහිදීමක් ඇත්තේ වන්නේද? විශාඛාවෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: 'අරහත්හු ජීවිතාන්තය දක්වා ප්‍රාණඝාතයෙන් වැළකී, ප්‍රාණඝාතය දුරුකොට, දඬු බහා තබා, අවි බහා තබා, ලජ්ජා ඇත්තෝ, දයා සිත් ඇත්තෝ, සියලු සත්ත්වයන්ට හිතසුව කැමතිව වාසය කරති. මම අද මේ රාත්‍රියෙහිද මේ දිවා කාලයෙහිද ප්‍රාණඝාතයෙන් වැළකී, ප්‍රාණඝාතය දුරුකොට, දඬු බහා තබා, අවි බහා තබා, ලජ්ජා ඇත්තෙක්, දයා සිත් ඇත්තෙක්ව, සියලු සත්ත්වයන්ට හිතසුව කැමතිව වාසය කරමි. මේ අංගයෙන් මම අරහතුන් අනුකරණය කරමි, මාගේ උපවාසයද (උපෝසථ සීලයද) සුරැකුණක් වන්නේය.' මෙසේ ඔහු පළමු අංගයෙන් යුක්ත වන්නේය. (ඒ අයුරින්ම දෙවෙනි, තෙවෙනි, සිවුවෙනි, පස්වෙනි, සයවෙනි, සත්වෙනි අංගයන්ගෙන්ද යුක්ත වන්නේය.) 'අරහත්හු ජීවිතාන්තය දක්වා උස් අසුන් හා මහා අසුන් අත්හැර, ඒවායෙන් වැළකී, පහත් අසුන් පනවති— යහනක හෝ තණ සයනයක හෝ. මම අද මේ රාත්‍රියෙහිද මේ දිවා කාලයෙහිද උස් අසුන් හා මහා අසුන් අත්හැර, ඒවායෙන් වැළකී, පහත් අසුන් පනවමි— යහනක හෝ තණ සයනයක හෝ. මේ අංගයෙන් මම අරහතුන් අනුකරණය කරමි, මාගේ උපවාසයද (උපෝසථ සීලයද) සුරැකුණක් වන්නේය.' මෙසේ ඔහු අටවෙනි අංගයෙන් යුක්ත වන්නේය. විශාඛාවෙනි, මෙසේ හික්මුණු අටඟ සමන්විත උපවාසය (උපෝසථ සීලය) මහත් ඵල ඇත්තේය, මහත් ආනිශංස ඇත්තේය, මහත් තේජස් ඇත්තේය, මහත් විහිදීමක් ඇත්තේය.\n\n\"එය කෙතරම් මහත් ඵල ඇත්තේද, කෙතරම් මහත් ආනිශංස ඇත්තේද, කෙතරම් මහත් තේජස් ඇත්තේද, කෙතරම් මහත් විහිදීමක් ඇත්තේද? විශාඛාවෙනි, යම්කිසිවෙක් අංග, මගධ, කාසි, කෝසල, වජ්ජි, මල්ල, චේති, වංග, කුරු, පංචාල, මච්ඡ, සූරසේන, අස්සක, අවන්ති, ගන්ධාර, කම්බෝජ යන මේ රත්න බහුල වූ මහා ජනපද දහසයෙහි අධිපතිත්වය හා රාජ්‍යය පාලනය කරන්නේ නම්, අටඟ සමන්විත උපවාසයෙහි (උපෝසථ සීලයෙහි) ඵලයට මේ සියල්ලේම අගය, දහසයෙන් කොටසකුදු වටින්නේ නැත. එයට හේතු කවරේද? විශාඛාවෙනි, දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය අල්ප වන්නේය.\"\n\n\"විශාඛාවෙනි, යම් මනුෂ්‍ය වර්ෂ පනහක් වේද, එය සිව්මහරාජික දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළොසක් වර්ෂයකි. ඒ වර්ෂයෙන් සිව්මහරාජික දෙවියන්ගේ ආයු ප්‍රමාණය දිව්‍ය වර්ෂ පන්සියයකි. විශාඛාවෙනි, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අටඟ සමන්විත උපවාසයෙහි (උපෝසථ සීලයෙහි) හික්මී, කය බිඳී මරණින් මතු සිව්මහරාජික දෙවියන්ගේ සහභාවයට පැමිණීම සිදුවිය හැකි කරුණකි. විශාඛාවෙනි, 'දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය අල්ප වන්නේය' යි මෙය අරභයා වදාළ සේක.\"\n\n\"විශාඛාවෙනි, යම් මනුෂ්‍ය වර්ෂ සියයක් වේද, එය තව්තිසා දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළොසක් වර්ෂයකි. ඒ වර්ෂයෙන් තව්තිසා දෙවියන්ගේ ආයු ප්‍රමාණය දිව්‍ය වර්ෂ දහසකි. විශාඛාවෙනි, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අටඟ සමන්විත උපවාසයෙහි (උපෝසථ සීලයෙහි) හික්මී, කය බිඳී මරණින් මතු තව්තිසා දෙවියන්ගේ සහභාවයට පැමිණීම සිදුවිය හැකි කරුණකි. විශාඛාවෙනි, 'දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය අල්ප වන්නේය' යි මෙය අරභයා වදාළ සේක.\"\n\n\"විශාඛාවෙනි, යම් මනුෂ්‍ය වර්ෂ දෙසීයක් වේද, එය යාම දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළොසක් වර්ෂයකි. ඒ වර්ෂයෙන් යාම දෙවියන්ගේ ආයු ප්‍රමාණය දිව්‍ය වර්ෂ දෙදහසකි. විශාඛාවෙනි, යම් මනුෂ්‍ය වර්ෂ හාරසීයක් වේද, එය තුසිත දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළොසක් වර්ෂයකි. ඒ වර්ෂයෙන් තුසිත දෙවියන්ගේ ආයු ප්‍රමාණය දිව්‍ය වර්ෂ හාරදහසකි. විශාඛාවෙනි, යම් මනුෂ්‍ය වර්ෂ අටසීයක් වේද, එය නිර්මාණරතී දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළොසක් වර්ෂයකි. ඒ වර්ෂයෙන් නිර්මාණරතී දෙවියන්ගේ ආයු ප්‍රමාණය දිව්‍ය වර්ෂ අටදහසකි. විශාඛාවෙනි, යම් මනුෂ්‍ය වර්ෂ දහසයසීයක් වේද, එය පරනිර්මිත වසවර්තී දෙවියන්ගේ එක් දිනක් හා රාත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළොසක් වර්ෂයකි. ඒ වර්ෂයෙන් පරනිර්මිත වසවර්තී දෙවියන්ගේ ආයු ප්‍රමාණය දිව්‍ය වර්ෂ දහසයදහසකි. විශාඛාවෙනි, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අටඟ සමන්විත උපවාසයෙහි (උපෝසථ සීලයෙහි) හික්මී, කය බිඳී මරණින් මතු පරනිර්මිත වසවර්තී දෙවියන්ගේ සහභාවයට පැමිණීම සිදුවිය හැකි කරුණකි. විශාඛාවෙනි, 'දිව්‍ය සැපයට සාපේක්ෂව මනුෂ්‍ය රාජ්‍යය අල්ප වන්නේය' යි මෙය අරභයා වදාළ සේක.\"\n\n\"ප්‍රාණීන් නොනැසිය යුතුය, අනුන් නොදුන් දෙය නොගත යුතුය. බොරු නොකිව යුතුය, මත්පැන් නොබිය යුතුය.\nඅබ්‍රහ්මචරියාවෙන් වැළකිය යුතුය. රාත්‍රී කාලයේදී ආහාර නොගත යුතුය.\nමල්දම් නොදැරිය යුතුය, සුවඳ විලවුන් ආලේප නොකළ යුතුය. උස් යහන් හා මහා යහන් අත්හැර, පහත් යහනක හෝ තණ සයනයක හෝ නිදාගත යුතුය.\nදුක් කෙළවර කළ බුදුරජාණන් වහන්සේ විසින් ප්‍රකාශ කරන ලද මේ අට අංගයෙන් යුක්ත උපෝසථ සීලය යැයි කියනු ලැබේ.\"\n\nසඳුත්, හිරුත් යන දෙදෙනාම මනාකොට දර්ශනීය වෙති. යම්තාක් දුරකට ආලෝකවත් කරමින් ගමන් කරති. අඳුර දුරු කරන්නා වූ ඔවුහු අහසෙහි ගමන් කරන්නෝ වෙති. අහසෙහි බබළමින්, දිශාවන් ආලෝකමත් කරන්නෝ වෙති.\n\nමේ ලෝකය තුළ යම් ධනයක් පවතී නම්, එනම් මුතු, මැණික්, යහපත් වෛදූර්යයද, සිඟී රන් හෝ එසේත් නැත්නම් කහ රන් වේ, යම් උසස් රත්‍රන් 'හාටක' යැයි කියනු ලැබේ.\n\nපෙර සඳහන් කළ ධනය ද, සඳෙහි ආලෝකය ද, සියලු තාරකා සමූහයා ද, අට අංගයන්ගෙන් යුක්ත වූ උපෝසථ සීලයේ අනුසස් හා සසඳන කල එහි දහසයවෙන් පංගුවක්වත් අත් නොදකිත්.\n\nඑබැවින් සිල්වත් ස්ත්‍රි‍්‍ර පුරුෂ දෙදෙනා, අට අංගයන්ගෙන් යුක්ත වූ උපෝසථ සීලය සමාදන් වෙත්වා! සැප විපාක දෙන පින් රැස් කර, කිසිදු නින්දාවකට පත් නොවී, සුගති ස්වර්ග ලෝකයට පැමිණෙත්වා!",
      "paliTitle": "Visākhāsuttaṃ",
      "englishTitle": "Visākhā Sutta",
      "sinhalaTitle": "විසාඛා සූත්‍රය"
    },
    {
      "number": 44,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho vāseṭṭho upāsako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho vāseṭṭhaṃ upāsakaṃ bhagavā etadavoca – ‘‘aṭṭhaṅgasamannāgato, vāseṭṭha, uposatho upavuttho mahapphalo hoti…pe… aninditā saggamupenti ṭhāna’’nti. Evaṃ vutte vāseṭṭho upāsako bhagavantaṃ etadavoca – ‘‘piyā me, bhante, ñātisālohitā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, piyānampi me assa ñātisālohitānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, khattiyā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, bhante, brāhmaṇā…pe… vessā … suddā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Evametaṃ, vāseṭṭha, evametaṃ, vāseṭṭha! Sabbe cepi, vāseṭṭha, khattiyā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa khattiyānaṃ dīgharattaṃ hitāya sukhāya. Sabbe cepi, vāseṭṭha, brāhmaṇā…pe… vessā… suddā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, sabbesampissa suddānaṃ dīgharattaṃ hitāya sukhāya. Sadevako cepi, vāseṭṭha, loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ [upavaseyya (?)], sadevakassapissa [sadevakassa (sabbattha) a. ni. 4.193; ma. ni. 3.64 passitabbaṃ] lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya dīgharattaṃ hitāya sukhāya. Ime cepi, vāseṭṭha, mahāsālā aṭṭhaṅgasamannāgataṃ uposathaṃ upavaseyyuṃ, imesampissa mahāsālānaṃ dīgharattaṃ hitāya sukhāya ( ) [(sace ceteyyuṃ) katthaci atthi. a. ni. 4.193 passitabbaṃ]. Ko pana vādo manussabhūtassā’’ti! Catutthaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Vesālī, in the Great Wood, at the Peaked Hall. Then indeed, the lay follower Vāseṭṭha approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side.\n\nTo the lay follower Vāseṭṭha, who was seated to one side, the Blessed One said this: \"Vāseṭṭha, the Uposatha observed, endowed with eight factors, is of great fruit, of great benefit, of great splendor, of great renown. Blameless, they arrive at a heavenly state.\"\n\nWhen this was said, the lay follower Vāseṭṭha said this to the Blessed One: \"Venerable sir, may my dear relatives and kinsmen observe the Uposatha endowed with eight factors. May this be for the long-term welfare and happiness even of my dear relatives and kinsmen. And if, Venerable sir, all khattiyas were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those khattiyas. And if all brahmins were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those brahmins. And if all merchants were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those merchants. And if all sudras were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those sudras.\"\n\n\"It is so, Vāseṭṭha, it is so, Vāseṭṭha! And if, Vāseṭṭha, all khattiyas were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those khattiyas. And if all brahmins were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those brahmins. And if all merchants were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those merchants. And if all sudras were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of all those sudras. And if, Vāseṭṭha, the world with its devas, with Māra, with Brahmā, the generation of ascetics and brahmins, with its devas and humans, were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of that world with its devas, with Māra, with Brahmā, the generation of ascetics and brahmins, with its devas and humans. And if, Vāseṭṭha, even these great Sāla trees were to observe the Uposatha endowed with eight factors, it would be for the long-term welfare and happiness of these great Sāla trees. How much more so for a human being!\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෛශාලි නුවර මහාවනයෙහි කූටාගාරශාලාවෙහි වැඩවසන සේක. එක් දිනක් වාසෙට්ඨ නම් උපාසක තෙම භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි වාසෙට්ඨ උපාසකයාට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “වාසෙට්ඨය, අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වූ තැනැත්තාට මහත් ඵල ලැබෙයි, කෙලෙස් රහිතව, ස්වර්ගයට පිවිසේ.”\n\nමෙසේ වදාළ කල්හි වාසෙට්ඨ උපාසක තෙම භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීනි, මාගේ ප්‍රිය ඥාති ලේ ඥාතීන් අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වුවහොත්, ඒ මාගේ ප්‍රිය ඥාති ලේ ඥාතීන්ට බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය. ස්වාමීනි, සියලුම ක්ෂත්‍රියයෝ අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වුවහොත්, ඒ සියලුම ක්ෂත්‍රියයන්ට බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය. ස්වාමීනි, සියලුම බ්‍රාහ්මණයෝ... සියලුම වෛශ්‍යයෝ... සියලුම ශුද්‍රයෝ අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වුවහොත්, ඒ සියලුම ශුද්‍රයන්ට බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය.”\n\n“වාසෙට්ඨය, එසේමය, වාසෙට්ඨය, එසේමය! වාසෙට්ඨය, සියලුම ක්ෂත්‍රියයෝ අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වුවහොත්, ඒ සියලුම ක්ෂත්‍රියයන්ට බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය. වාසෙට්ඨය, සියලුම බ්‍රාහ්මණයෝ... සියලුම වෛශ්‍යයෝ... සියලුම ශුද්‍රයෝ අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වුවහොත්, ඒ සියලුම ශුද්‍රයන්ට බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය. වාසෙට්ඨය, දෙවියන් සහිත වූද, මාරයා සහිත වූද, බඹුන් සහිත වූද, ශ්‍රමණයින් හා බ්‍රාහ්මණයින් සහිත වූද, දෙවි මිනිසුන් සහිත වූද මුළු ලෝකයාම අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වුවහොත්, දෙවියන් සහිත වූද, මාරයා සහිත වූද, බඹුන් සහිත වූද, ශ්‍රමණයින් හා බ්‍රාහ්මණයින් සහිත වූද, දෙවි මිනිසුන් සහිත වූද මුළු ලෝකයාටම බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය. වාසෙට්ඨය, මේ මහාසාර ගස් පවා අට අංගයන්ගෙන් සමන්විත උපෝසථය සමාදන් වීමට චේතනා කරන්නේ නම්, මේ මහාසාර ගස්වලටද බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය. මිනිසෙකු ගැන කුමන කතාද!”",
      "paliTitle": "Vāseṭṭhasuttaṃ",
      "englishTitle": "The Vasettha Sutta",
      "sinhalaTitle": "වාසේට්‍ඨ සූත්‍රය"
    },
    {
      "number": 45,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bojjhā upāsikā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho bojjhaṃ upāsikaṃ bhagavā etadavoca – ‘‘Aṭṭhaṅgasamannāgato, bojjhe, uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bojjhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bojjhe, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā, sabbapāṇabhūtahitānukampino viharanti. Ahaṃ pajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe…. ‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā. Ahaṃ pajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi, uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bojjhe, aṭṭhaṅgasamannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. ‘‘Kīvamahapphalo hoti, kīvamahānisaṃso, kīvamahājutiko, kīvamahāvipphāro? Seyyathāpi, bojjhe, yo imesaṃ soḷasannaṃ mahājanapadānaṃ pahūtarattaratanānaṃ issariyādhipaccaṃ rajjaṃ kāreyya, seyyathidaṃ – aṅgānaṃ magadhānaṃ kāsīnaṃ kosalānaṃ vajjīnaṃ mallānaṃ cetīnaṃ vaṅgānaṃ kurūnaṃ pañcālānaṃ macchānaṃ sūrasenānaṃ assakānaṃ avantīnaṃ gandhārānaṃ kambojānaṃ, aṭṭhaṅgasamannāgatassa uposathassa etaṃ kalaṃ nāgghati soḷasiṃ. Taṃ kissa hetu? Kapaṇaṃ, bojjhe, mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya. ‘‘Yāni, bojjhe, mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni pañca vassasatāni cātumahārājikānaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bojjhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bojjhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāya’’’. ‘‘Yaṃ, bojjhe, mānusakaṃ vassasataṃ…pe… tāni, bojjhe, mānusakāni dve vassasatāni…pe… cattāri vassasatāni…pe… aṭṭha vassasatāni…pe… soḷasa vassasatāni paranimmitavasavattīnaṃ devānaṃ eso eko rattindivo. Tāya rattiyā tiṃsarattiyo māso. Tena māsena dvādasamāsiyo saṃvaccharo. Tena saṃvaccharena dibbāni soḷasa vassasahassāni paranimmitavasavattīnaṃ devānaṃ āyuppamāṇaṃ. Ṭhānaṃ kho panetaṃ, bojjhe, vijjati yaṃ idhekacco itthī vā puriso vā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasitvā kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya. Idaṃ kho panetaṃ, bojjhe, sandhāya bhāsitaṃ – ‘kapaṇaṃ mānusakaṃ rajjaṃ dibbaṃ sukhaṃ upanidhāyā’’’ti. ‘‘Pāṇaṃ na haññe na cadinnamādiye, Musā na bhāse na ca majjapo siyā; Abrahmacariyā virameyya methunā, Rattiṃ na bhuñjeyya vikālabhojanaṃ. ‘‘Mālaṃ na dhāre na ca gandhamācare, Mañce chamāyaṃ va sayetha santhate; Etañhi aṭṭhaṅgikamāhuposathaṃ, Buddhena dukkhantagunā pakāsitaṃ. ‘‘Cando ca suriyo ca ubho sudassanā, Obhāsayaṃ anupariyanti yāvatā; Tamonudā te pana antalikkhagā, Nabhe pabhāsanti disāvirocanā. ‘‘Etasmiṃ yaṃ vijjati antare dhanaṃ, Muttā maṇi veḷuriyañca bhaddakaṃ; Siṅgīsuvaṇṇaṃ atha vāpi kañcanaṃ, Yaṃ jātarūpaṃ haṭakanti vuccati. ‘‘Aṭṭhaṅgupetassa uposathassa, Kalampi te nānubhavanti soḷasiṃ; Candappabhā tāragaṇā ca sabbe. ‘‘Tasmā hi nārī ca naro ca sīlavā, Aṭṭhaṅgupetaṃ upavassuposathaṃ; Puññāni katvāna sukhudrayāni, Aninditā saggamupenti ṭhāna’’nti. pañcamaṃ;",
      "english": "At one time, the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Monastery.\n\nThen, the lay follower Bojjhā approached the Blessed One. Having approached and paid homage to the Blessed One, she sat down to one side. To the lay follower Bojjhā, as she sat to one side, the Blessed One said this:\n\n\"Bojjhā, when the Uposatha, observed with eight factors, is undertaken, it is of great fruit, great benefit, great radiance, and great pervasiveness. And how, Bojjhā, when undertaken, does the Uposatha, endowed with eight factors, become of great fruit, great benefit, great radiance, and great pervasiveness?\n\n\"Here, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned the taking of life, abstained from the taking of life, laid aside the rod and the weapon, are conscientious, full of compassion, and dwell with kindness for all living beings. Today, for this night and this day, I too have abandoned the taking of life, abstained from the taking of life, laid aside the rod and the weapon, am conscientious, full of compassion, and dwell with kindness for all living beings. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this first factor.\n\n\"Again, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned the taking of what is not given, abstained from the taking of what is not given, are takers of what is given, expecting what is given, not thievish, and dwell purified. Today, for this night and this day, I too have abandoned the taking of what is not given, abstained from the taking of what is not given, am a taker of what is given, expecting what is given, not thievish, and dwell purified. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this second factor.\n\n\"Again, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned unchastity, abstained from unchastity, live chastely, dwelling zealous for the pure holy life. Today, for this night and this day, I too have abandoned unchastity, abstained from unchastity, live chastely, dwelling zealous for the pure holy life. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this third factor.\n\n\"Again, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned false speech, abstained from false speech, speak truth, are truthful, firm, reliable, and do not deceive the world. Today, for this night and this day, I too have abandoned false speech, abstained from false speech, speak truth, am truthful, firm, reliable, and do not deceive the world. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this fourth factor.\n\n\"Again, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned intoxicating drinks and drugs, which are the basis for heedlessness, and abstain from intoxicating drinks and drugs, which are the basis for heedlessness. Today, for this night and this day, I too have abandoned intoxicating drinks and drugs, which are the basis for heedlessness, and abstain from intoxicating drinks and drugs, which are the basis for heedlessness. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this fifth factor.\n\n\"Again, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned untimely eating, abstained from untimely eating, eat only once a day, refraining from food at night. Today, for this night and this day, I too have abandoned untimely eating, abstained from untimely eating, eat only once a day, refraining from food at night. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this sixth factor.\n\n\"Again, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned dancing, singing, music, and unseemly shows, and the adorning, beautifying, and embellishing oneself with garlands, perfumes, and cosmetics, and abstain from these. Today, for this night and this day, I too have abandoned dancing, singing, music, and unseemly shows, and the adorning, beautifying, and embellishing oneself with garlands, perfumes, and cosmetics, and abstain from these. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this seventh factor.\n\n\"Again, Bojjhā, a noble disciple reflects thus: ‘Throughout their lives, the Arahants have abandoned high and luxurious beds, abstained from high and luxurious beds, and sleep in a low bed — either on a couch or on a mat of grass. Today, for this night and this day, I too have abandoned high and luxurious beds, abstained from high and luxurious beds, and sleep in a low bed — either on a couch or on a mat of grass. By this factor, I imitate the Arahants, and my Uposatha will be observed.’ He is endowed with this eighth factor.\n\n\"Thus, Bojjhā, when observed, the Uposatha, endowed with eight factors, is of great fruit, great benefit, great radiance, and great pervasiveness.\n\n\"How great is this fruit, this benefit, this radiance, this pervasiveness? Suppose, Bojjhā, someone were to rule over these sixteen great countries, rich in abundant jewels — namely, Aṅga, Magadha, Kāsī, Kosala, Vajji, Malla, Cetī, Vaṅga, Kurū, Pañcāla, Maccha, Sūrasena, Assaka, Avantī, Gandhāra, and Kamboja — yet this is not worth even a sixteenth part of the Uposatha endowed with eight factors. Why is that? Because, Bojjhā, human kingship is paltry compared to heavenly happiness.\n\n\"Bojjhā, fifty human years correspond to one day and night for the gods of the Four Great Kings. Thirty such days and nights make one month, twelve such months make one year, and five hundred such divine years are the lifespan of the gods of the Four Great Kings. And it is possible, Bojjhā, that some woman or man, having observed the Uposatha endowed with eight factors, with the breaking up of the body, after death, may reappear in the company of the gods of the Four Great Kings. It was with this in mind, Bojjhā, that it was said: ‘human kingship is paltry compared to heavenly happiness.’\n\n\"Bojjhā, a hundred human years correspond to one day and night for the Tāvatiṃsa devas. Thirty such days and nights make one month, twelve such months make one year, and one thousand such divine years are the lifespan of the Tāvatiṃsa devas. And it is possible, Bojjhā, that some woman or man, having observed the Uposatha endowed with eight factors, with the breaking up of the body, after death, may reappear in the company of the Tāvatiṃsa devas. It was with this in mind, Bojjhā, that it was said: ‘human kingship is paltry compared to heavenly happiness.’\n\n\"Bojjhā, two hundred human years correspond to one day and night for the Yāma devas. Thirty such days and nights make one month, twelve such months make one year, and two thousand such divine years are the lifespan of the Yāma devas. And it is possible, Bojjhā, that some woman or man, having observed the Uposatha endowed with eight factors, with the breaking up of the body, after death, may reappear in the company of the Yāma devas. It was with this in mind, Bojjhā, that it was said: ‘human kingship is paltry compared to heavenly happiness.’\n\n\"Bojjhā, four hundred human years correspond to one day and night for the Tusita devas. Thirty such days and nights make one month, twelve such months make one year, and four thousand such divine years are the lifespan of the Tusita devas. And it is possible, Bojjhā, that some woman or man, having observed the Uposatha endowed with eight factors, with the breaking up of the body, after death, may reappear in the company of the Tusita devas. It was with this in mind, Bojjhā, that it was said: ‘human kingship is paltry compared to heavenly happiness.’\n\n\"Bojjhā, eight hundred human years correspond to one day and night for the Nimmānarati devas. Thirty such days and nights make one month, twelve such months make one year, and eight thousand such divine years are the lifespan of the Nimmānarati devas. And it is possible, Bojjhā, that some woman or man, having observed the Uposatha endowed with eight factors, with the breaking up of the body, after death, may reappear in the company of the Nimmānarati devas. It was with this in mind, Bojjhā, that it was said: ‘human kingship is paltry compared to heavenly happiness.’\n\n\"Bojjhā, sixteen hundred human years correspond to one day and night for the Paranimmitavasavattī devas. Thirty such days and nights make one month, twelve such months make one year, and sixteen thousand such divine years are the lifespan of the Paranimmitavasavattī devas. And it is possible, Bojjhā, that some woman or man, having observed the Uposatha endowed with eight factors, with the breaking up of the body, after death, may reappear in the company of the Paranimmitavasavattī devas. It was with this in mind, Bojjhā, that it was said: ‘human kingship is paltry compared to heavenly happiness.’\"\n\nOne should not harm a living being, nor take what is not given. One should not speak falsely, nor be a drinker of intoxicants. One should abstain from unchastity and sexual activity. One should not eat at night, nor take untimely food.\n\nOne should not wear garlands, nor use perfumes. One should sleep on a bed on the ground or on a mat. This, indeed, is called the Uposatha of eight factors, declared by the Buddha, who has transcended suffering.\n\nThe moon and the sun, both beautiful to behold, illuminate as far as they range. Dispelling darkness, they traverse the sky, shining in the heavens, lighting up the cardinal directions.\n\nWhatever wealth exists within this realm—pearls, gems, beautiful lapis lazuli, gold from the river Jambu, or pure gold, all that is called native gold or refined gold—\n\nThese do not amount to even a sixteenth part of the Uposatha endowed with eight factors, nor does the radiance of the moon and all the hosts of stars.\n\nTherefore, women and men, if virtuous, should observe the Uposatha endowed with eight factors. Having performed wholesome deeds that lead to happiness, blameless, they go to a heavenly abode.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් ආරාමයෙහි අනේපිඬු සිටුතුමා විසින් කරවන ලද විහාරයෙහි වැඩසිටින සේක. එකල්හි බෝජ්ඣා උපාසිකාව භාග්‍යවතුන් වහන්සේ වෙත පැමිණියාය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙකින් වාඩි වූවාය. එක් පසෙක වාඩි වී සිටි බෝජ්ඣා උපාසිකාවට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “බෝජ්ඣා, අෂ්ටාංග සමන්නාගත වූ උපෝසථය සමාදන් වූ කල්හි මහත් ඵල ඇති, මහත් ආනිසංස ඇති, මහත් තේජස් ඇති, මහත් විහිදීමක් ඇති වේ. බෝජ්ඣා, කෙසේ සමාදන් වූ අෂ්ටාංග සමන්නාගත උපෝසථය මහත් ඵල ඇති, මහත් ආනිසංස ඇති, මහත් තේජස් ඇති, මහත් විහිදීමක් ඇති වේද?”\n\n“බෝජ්ඣා, මෙහි අරිය ශ්‍රාවකයා මෙසේ කල්පනා කරයි: 'අරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා ප්‍රාණඝාතයෙන් වැළකී, ප්‍රාණඝාතය දුරු කොට, දඬු මුගුරු බහා තබා, අවි ආයුධ බහා තබා, ලජ්ජාශීලීව, දයාවෙන් යුතුව, සියලු සත්ත්වයන්ගේ හිත සුව කැමැත්තෙන් වාසය කරති. මාද අද මේ රැය සහ මේ දවස, ප්‍රාණඝාතය දුරු කොට, ප්‍රාණඝාතයෙන් වැළකී, දඬු මුගුරු බහා තබා, අවි ආයුධ බහා තබා, ලජ්ජාශීලීව, දයාවෙන් යුතුව, සියලු සත්ත්වයන්ගේ හිත සුව කැමැත්තෙන් වාසය කරමි. මේ අංගයෙන් මම අරහතුන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද සමාදන් කර ගත්තක් වන්නේය.' මේ පළමු අංගයෙන් යුක්ත වේ. ... (අනෙකුත් අංගයන්ද මෙලෙසින්ම) ... 'අරහතුන් වහන්සේලා ජීවිතාන්තය දක්වා උස ආසන හා මහා ආසන හැර, උස ආසන හා මහා ආසන වලින් වැළකී, පහත් ආසන, එනම් යහන් මත හෝ තණ සයනයන්හි වාසය කරති. මාද අද මේ රැය සහ මේ දවස, උස ආසන හා මහා ආසන හැර, උස ආසන හා මහා ආසන වලින් වැළකී, පහත් ආසන, එනම් යහන් මත හෝ තණ සයනයන්හි වාසය කරමි. මේ අංගයෙන් මම අරහතුන් වහන්සේලා අනුකරණය කරමි. මාගේ උපෝසථයද සමාදන් කර ගත්තක් වන්නේය.' මේ අටවැනි අංගයෙන් යුක්ත වේ. බෝජ්ඣා, මෙසේ සමාදන් වූ අෂ්ටාංග සමන්නාගත උපෝසථය මහත් ඵල ඇති, මහත් ආනිසංස ඇති, මහත් තේජස් ඇති, මහත් විහිදීමක් ඇති වේ.”\n\n“කෙතරම් මහත් ඵල ඇති, කෙතරම් මහත් ආනිසංස ඇති, කෙතරම් මහත් තේජස් ඇති, කෙතරම් මහත් විහිදීමක් ඇති වේද? බෝජ්ඣා, යම් සේ මේ මහජනපද දහසයෙහි, එනම්: අංග, මගධ, කාසි, කෝසල, වජ්ජි, මල්ල, චේති, වංග, කුරු, පංචාල, මච්ඡ, සූරසේන, අස්සක, අවන්ති, ගන්ධාර, කාම්බෝජ යන රජ දහසයෙහි බොහෝ රන් රුවන් පිරී පවතී නම්, එහි ඊශ්වරභාවයද, අධිපතිභාවයද, රාජ්‍යයද යමෙක් පාලනය කරන්නේ නම්, අෂ්ටාංග සමන්නාගත වූ උපෝසථයට ඒ රාජ්‍ය සම්පත්තිය දහසයෙන් එකකටවත් සම නොවේ. ඊට හේතුව කුමක්ද? බෝජ්ඣා, මනුෂ්‍ය රාජ්‍යය දිව්‍ය සැපයට සාපේක්ෂව අල්පය.\n\nබෝජ්ඣා, මනුෂ්‍ය වර්ෂ පනහක් යනු චාතුම්මහාරාජික දෙවියන්ට එක් දිවා රත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළහක් වර්ෂයකි. ඒ වර්ෂයෙන් දිව්‍ය වර්ෂ පන්සියයක් චාතුම්මහාරාජික දෙවියන්ගේ ආයුෂ ප්‍රමාණය වේ. බෝජ්ඣා, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අෂ්ටාංග සමන්නාගත උපෝසථය සමාදන් වී, කය භින්න වීමෙන් මරණින් මතු චාතුම්මහාරාජික දෙවියන් අතර සහවාසයට පත්වීම නම් වූ කරුණක් ඇත. බෝජ්ඣා, ‘මනුෂ්‍ය රාජ්‍යය දිව්‍ය සැපයට සාපේක්ෂව අල්පය’ යැයි කීවේ මේ කරුණ අරබයායි.\n\nබෝජ්ඣා, යම් මනුෂ්‍ය වර්ෂ සියයක් (යාම දෙවියන්ට එක් දිවා රත්‍රියක් වන) ආකාරයට... එසේම, මනුෂ්‍ය වර්ෂ දහසය සියයක් යනු පරනිම්මිතවසවත්ති දෙවියන්ට එක් දිවා රත්‍රියකි. ඒ රාත්‍රියෙන් තිස් රාත්‍රියක් මාසයකි. ඒ මාසයෙන් මාස දොළහක් වර්ෂයකි. ඒ වර්ෂයෙන් දිව්‍ය වර්ෂ දහසය දහසක් පරනිම්මිතවසවත්ති දෙවියන්ගේ ආයුෂ ප්‍රමාණය වේ. බෝජ්ඣා, යම්කිසි ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ අෂ්ටාංග සමන්නාගත උපෝසථය සමාදන් වී, කය භින්න වීමෙන් මරණින් මතු පරනිම්මිතවසවත්ති දෙවියන් අතර සහවාසයට පත්වීම නම් වූ කරුණක් ඇත. බෝජ්ඣා, ‘මනුෂ්‍ය රාජ්‍යය දිව්‍ය සැපයට සාපේක්ෂව අල්පය’ යැයි කීවේ මේ කරුණ අරබයායි.”\n\nසතුන් නොනසන්නේ, අනුන් සතු දේ නොගන්නේ.\nබොරු නොකියන්නේ, මත්පැන් නොබොන්නේ.\nඅබ්‍රහ්මචර්යාවෙන් (මෙථුනධර්මයෙන්) වැළකෙන්නේ.\nවිකාල භෝජනයෙන් වැළකී, රැයෙහි ආහාර නොගන්නේය.\n\nමල්මාලා නොපළඳින්නේ, සුවඳ විලවුන් නොගල්වන්නේ.\nඋස් අසුන් හා මහා අසුන් හැර, බිම එලූ සයනයක හෝ තණ මත සයනය කරන්නේය.\nමේ අෂ්ටාංග උපෝසථය යැයි කියනු ලැබේ.\nදුක කෙළවර කිරීමේ ගුණයෙන් යුක්තව බුදුරජාණන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දකි.\n\nචන්ද්‍රයාද, සූර්යයාද යන දෙදෙනාම මනා දැක්මක් ඇතිව,\nයම් තාක් දුරකට එළිය කරමින් දිවෙත්ද,\nඅන්ධකාරය දුරු කරන ඔවුහු අහසෙහි ගමන් කරමින්,\nදස දිශා බබළවමින් බබළති.\n\nඒ සීමාව තුළ යම් ධන සම්පත් ඇත්ද,\nමුතු, මැණික්, වෛදූර්‍යයද යහපත් වූ\nසියලුම රන් රිදී ආදී වස්තු සම්භාරය, එනම් හාටක රන් යැයි කියනු ලබන ජාතරූප රන් ආදියද ඇත්ද,\n\nඅෂ්ටාංගයෙන් යුක්ත වූ උපෝසථයට (එම ධන සම්පත්) දහසයෙන් එකකටවත් සම නොවේ. චන්ද්‍රයාගේ ප්‍රභාවද, සියලු තාරකා සමූහයා ද (උපෝසථයේ ආනිසංස හා සසඳන විට) එලෙසම අල්පය.\n\nඑහෙයින්ම සිල්වත් ස්ත්‍රීහුද පුරුෂයෝද,\nඅෂ්ටාංගයෙන් යුක්ත වූ උපෝසථය සමාදන් වන්නාහුය.\nසැප ලැබීමට හේතුවන පින්කම් කොට,\nඅවිනින්දිතව ස්වර්ග ලෝකයට පැමිණෙත්.",
      "paliTitle": "Bojjhasuttaṃ",
      "englishTitle": "Discourse on the Factors of Awakening",
      "sinhalaTitle": "බොජ්ඣ සූත‍්‍රය"
    },
    {
      "number": 46,
      "pali": "Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena āyasmā anuruddho divāvihāraṃ gato hoti paṭisallīno. Atha kho sambahulā manāpakāyikā devatā yenāyasmā anuruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ anuruddhaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā devatā āyasmantaṃ anuruddhaṃ etadavocuṃ – ‘‘mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā tīsu ṭhānesu issariyaṃ kārema vasaṃ vattema. Mayaṃ, bhante anuruddha, yādisakaṃ vaṇṇaṃ ākaṅkhāma tādisakaṃ vaṇṇaṃ ṭhānaso paṭilabhāma; yādisakaṃ saraṃ ākaṅkhāma tādisakaṃ saraṃ ṭhānaso paṭilabhāma; yādisakaṃ sukhaṃ ākaṅkhāma tādisakaṃ sukhaṃ ṭhānaso paṭilabhāma. Mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā imesu tīsu ṭhānesu issariyaṃ kārema vasaṃ vattemā’’ti. Atha kho āyasmato anuruddhassa etadahosi – ‘‘aho vatimā devatā sabbāva nīlā assu nīlavaṇṇā nīlavatthā nīlālaṅkārā’’ti. Atha kho tā devatā āyasmato anuruddhassa cittamaññāya sabbāva nīlā ahesuṃ nīlavaṇṇā nīlavatthā nīlālaṅkārā. Atha kho āyasmato anuruddhassa etadahosi – ‘‘aho vatimā devatā sabbāva pītā assu…pe… sabbāva lohitakā assu… sabbāva odātā assu odātavaṇṇā odātavatthā odātālaṅkārā’’ti. Atha kho tā devatā āyasmato anuruddhassa cittamaññāya sabbāva odātā ahesuṃ odātavaṇṇā odātavatthā odātālaṅkārā. Atha kho tā devatā ekā ca [ko (sī.), ekāva (syā. pī.)] gāyi ekā ca [ekā pana (sī.), ekāva (syā. pī.)] nacci ekā ca [ekā (sī.), ekāva (syā. pī.)] accharaṃ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa [turiyassa (sī. syā. pī.)] suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṃ tāsaṃ devatānaṃ alaṅkārānaṃ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha kho āyasmā anuruddho indriyāni okkhipi. Atha kho tā devatā ‘‘na khvayyo anuruddho sādiyatī’’ti [sādayatīti (saddanītidhātumālā)] tatthevantaradhāyiṃsu. Atha kho āyasmā anuruddho sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca – ‘‘Idhāhaṃ, bhante, divāvihāraṃ gato homi paṭisallīno. Atha kho, bhante, sambahulā manāpakāyikā devatā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhante, tā devatā maṃ etadavocuṃ – ‘mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā tīsu ṭhānesu issariyaṃ kārema vasaṃ vattema. Mayaṃ, bhante anuruddha, yādisakaṃ vaṇṇaṃ ākaṅkhāma tādisakaṃ vaṇṇaṃ ṭhānaso paṭilabhāma; yādisakaṃ saraṃ ākaṅkhāma tādisakaṃ saraṃ ṭhānaso paṭilabhāma; yādisakaṃ sukhaṃ ākaṅkhāma tādisakaṃ sukhaṃ ṭhānaso paṭilabhāma. Mayaṃ, bhante anuruddha, manāpakāyikā nāma devatā imesu tīsu ṭhānesu issariyaṃ kārema vasaṃ vattemā’ti. Tassa mayhaṃ, bhante, etadahosi – ‘aho vatimā devatā sabbāva nīlā assu nīlavaṇṇā nīlavatthā nīlālaṅkārā’ti. Atha kho, bhante, tā devatā mama cittamaññāya sabbāva nīlā ahesuṃ nīlavaṇṇā nīlavatthā nīlālaṅkārā. ‘‘Tassa mayhaṃ, bhante, etadahosi – ‘aho vatimā devatā sabbāva pītā assu…pe… sabbāva lohitakā assu…pe… sabbāva odātā assu odātavaṇṇā odātavatthā odātālaṅkārā’ti. Atha kho, bhante, tā devatā mama cittamaññāya sabbāva odātā ahesuṃ odātavaṇṇā odātavatthā odātālaṅkārā. ‘‘Atha kho, bhante, tā devatā ekā ca gāyi ekā ca nacci ekā ca accharaṃ vādesi. Seyyathāpi nāma pañcaṅgikassa tūriyassa suvinītassa suppaṭipatāḷitassa kusalehi susamannāhatassa saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca; evamevaṃ tāsaṃ devatānaṃ alaṅkārānaṃ saddo hoti vaggu ca rajanīyo ca kamanīyo ca pemanīyo ca madanīyo ca. Atha khvāhaṃ, bhante, indriyāni okkhipiṃ. ‘‘Atha kho, bhante, tā devatā ‘na khvayyo anuruddho sādiyatī’ti tatthevantaradhāyiṃsu. Katihi nu kho, bhante, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Aṭṭhahi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, anuruddha, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī. ‘‘Ye te bhattu garuno [guruno (ka.)] honti – mātāti vā pitāti vā samaṇabrāhmaṇāti vā – te sakkaroti, garuṃ karoti [garukaroti (sī. syā. pī.)], māneti, pūjeti, abbhāgate ca āsanodakena paṭipūjeti. ‘‘Ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya [tatrūpāyāya (sī.), a. ni. 4.35; 11.14] vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ. ‘‘Yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena [paccayena (syā.), paccattaṃsena (ka.) a. ni. 5.33] saṃvibhajati. ‘‘Yaṃ bhattu āharati dhanaṃ vā dhaññaṃ vā jātarūpaṃ vā taṃ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā. ‘‘Upāsikā kho pana hoti buddhaṃ saraṇaṃ gatā dhammaṃ saraṇaṃ gatā saṅghaṃ saraṇaṃ gatā. ‘‘Sīlavatī kho pana hoti – pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjapamādaṭṭhānā paṭiviratā. ‘‘Cāgavatī kho pana hoti. Vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā [muttacāgī (syā.)] payatapāṇinī [payatapāṇi (sī.), payatapāṇī (syā. pī. ka.)] vossaggaratā yācayogā dānasaṃvibhāgaratā. ‘‘Imehi kho, anuruddha, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. ‘‘Yo naṃ bharati sabbadā, niccaṃ ātāpi ussuko; Taṃ sabbakāmadaṃ [taṃ sabbakāmaharaṃ (sī. syā. pī.) sabbakāmaharaṃ (a. ni. 5.33] posaṃ, bhattāraṃ nātimaññati. ‘‘Na cāpi sotthi bhattāraṃ, issāvādena rosaye; Bhattu ca garuno sabbe, paṭipūjeti paṇḍitā. ‘‘Uṭṭhāhikā [uṭṭhāyikā (ka.)] analasā, saṅgahitaparijjanā; Bhattu manāpaṃ carati, sambhataṃ anurakkhati. ‘‘Yā evaṃ vattati nārī, bhattu chandavasānugā; Manāpā nāma te [manāpakāyikā (sī. ka.)] devā, yattha sā upapajjatī’’ti. chaṭṭhaṃ;",
      "english": "Once, the Blessed One was staying in Kosambi, at Ghosita's Park. Now at that time, Venerable Anuruddha had gone for his day's abiding, secluded. Then, several deities of pleasing forms approached Venerable Anuruddha. Having approached, they paid homage to Venerable Anuruddha and stood to one side. Standing to one side, those deities said to Venerable Anuruddha, \"Venerable Anuruddha, we are called the deities of pleasing forms, and we exercise mastery and wield control in three respects. Venerable Anuruddha, whatever color we desire, we obtain that color instantly; whatever sound we desire, we obtain that sound instantly; whatever pleasure we desire, we obtain that pleasure instantly. Venerable Anuruddha, we are the deities of pleasing forms, and we exercise mastery and wield control in these three respects.\"\n\nThen, it occurred to Venerable Anuruddha, \"Oh, if only all these deities were blue, of blue complexion, wearing blue garments, and adorned with blue ornaments!\" Then, those deities, knowing Venerable Anuruddha's thought, all became blue, of blue complexion, wearing blue garments, and adorned with blue ornaments. Then, it occurred to Venerable Anuruddha, \"Oh, if only all these deities were yellow, of yellow complexion, wearing yellow garments, and adorned with yellow ornaments! Oh, if only all of them were red, of red complexion, wearing red garments, and adorned with red ornaments! Oh, if only all of them were white, of white complexion, wearing white garments, and adorned with white ornaments!\" Then, those deities, knowing Venerable Anuruddha's thought, all became white, of white complexion, wearing white garments, and adorned with white ornaments. Then, one of those deities sang, another danced, and another played a musical instrument. Just as the sound of a well-trained, well-struck five-component musical instrument, skillfully played by experts, is charming, captivating, delightful, endearing, and intoxicating, so too was the sound of the ornaments of those deities: charming, captivating, delightful, endearing, and intoxicating. Then, Venerable Anuruddha withdrew his faculties. Then those deities, realizing \"Venerable Anuruddha is not pleased,\" vanished right there.\n\nThen, Venerable Anuruddha, having emerged from his seclusion in the evening, approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, Venerable Anuruddha said to the Blessed One, \"Here, Bhante, I had gone for my day's abiding, secluded. Then, Bhante, several deities of pleasing forms approached me. Having approached, they paid homage to me and stood to one side. Standing to one side, Bhante, those deities said to me, 'Venerable Anuruddha, we are called the deities of pleasing forms, and we exercise mastery and wield control in three respects. Venerable Anuruddha, whatever color we desire, we obtain that color instantly; whatever sound we desire, we obtain that sound instantly; whatever pleasure we desire, we obtain that pleasure instantly. Venerable Anuruddha, we are the deities of pleasing forms, and we exercise mastery and wield control in these three respects.' Then, Bhante, it occurred to me, 'Oh, if only all these deities were blue, of blue complexion, wearing blue garments, and adorned with blue ornaments!' Then, Bhante, those deities, knowing my thought, all became blue, of blue complexion, wearing blue garments, and adorned with blue ornaments.\n\n\"Then, Bhante, it occurred to me, 'Oh, if only all these deities were yellow, of yellow complexion, wearing yellow garments, and adorned with yellow ornaments! Oh, if only all of them were red, of red complexion, wearing red garments, and adorned with red ornaments! Oh, if only all of them were white, of white complexion, wearing white garments, and adorned with white ornaments!' Then, Bhante, those deities, knowing my thought, all became white, of white complexion, wearing white garments, and adorned with white ornaments. \"Then, Bhante, one of those deities sang, another danced, and another played a musical instrument. Just as the sound of a well-trained, well-struck five-component musical instrument, skillfully played by experts, is charming, captivating, delightful, endearing, and intoxicating, so too was the sound of the ornaments of those deities: charming, captivating, delightful, endearing, and intoxicating. Then, Bhante, I withdrew my faculties. \"Then, Bhante, those deities, realizing 'Venerable Anuruddha is not pleased,' vanished right there. Bhante, by being endowed with how many qualities does a woman, at the breakup of the body, after death, reappear in the company of the deities of pleasing forms?\"\n\n\"Anuruddha, a woman endowed with eight qualities, at the breakup of the body, after death, reappears in the company of the deities of pleasing forms. With which eight?\n\nHere, Anuruddha, a woman whose parents give her to a husband, out of a desire for his welfare, being solicitous and compassionate, becomes for him one who rises before him, lies down after him, is obedient to his commands, acts pleasingly, and speaks kindly.\n\nShe treats with deference, holds in esteem, honors, and reveres those who are respected by her husband – be they mother, father, recluses, or brahmins. And she receives guests with a seat and water.\n\nWhatever domestic tasks are her husband's concern – be it wool or cotton work – she is skillful and not lazy in them, endowed with the appropriate understanding, capable of doing them and capable of organizing them.\n\nWhatever household staff her husband has – be they slaves, servants, or workers – she knows what has been done as done, and what has not been done as not done; she knows the strength and weakness of the sick among them, and she distributes food and provisions to them according to their individual portions.\n\nWhatever wealth her husband brings in – be it money, grain, or gold – she protects it with care and vigilance, and in regard to it, she is not given to dissipation, not a thief, not a drunkard, and not wasteful.\n\nFurthermore, she is a lay follower who has gone for refuge to the Buddha, gone for refuge to the Dhamma, and gone for refuge to the Saṅgha.\n\nFurthermore, she is virtuous – abstaining from the destruction of life, abstaining from taking what is not given, abstaining from misconduct in sensual pleasures, abstaining from false speech, and abstaining from fermented and distilled liquors which are the basis for heedlessness.\n\nFurthermore, she is generous. She dwells in a home with a mind free from the stain of stinginess, being open-handed, clean-handed, delighting in relinquishing, responsive to requests, and delighting in the distribution of gifts.\n\nAnuruddha, a woman endowed with these eight qualities, upon the breaking up of the body, after death, reappears in the company of the pleasing deities.\n\nShe does not despise her husband, that man who always supports her, always diligent and energetic, and who grants all her desires.\n\nNor does she ever provoke her husband with jealous words. And the wise woman reveres all those respected by her husband.\n\nEnergetic and not lazy, she manages her household staff well; she acts pleasingly to her husband, and she guards what has been accumulated.\n\nThe woman who thus conducts herself, following her husband's wishes, reappears among those deities called the Pleasing-bodied ones.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසම්බියෙහි ඝෝෂිතාරාමයේ වැඩසිටින සේක. ඒ කල්හි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ දහවල් විහරණයට වැඩ සිටි සේක, තනිව භාවනා කරමින්. ඉක්බිති බොහෝ මනාපකායික නම් දෙවියෝ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ වෙත පැමිණියහ; පැමිණ, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට වන්දනා කොට, එක් පසෙක සිටියහ. එක් පසෙක සිටි ඒ දෙවියෝ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: \"භාග්‍යවතුන් වහන්ස, අනුරුද්ධයෙනි, අපි මනාපකායික නම් දෙවියෝ තෙස්ථානයන්හි අධිපතිත්වය කරන්නෙමු, බලය පවත්වන්නෙමු. භාග්‍යවතුන් වහන්ස, අනුරුද්ධයෙනි, අප යම් වර්ණයක් පතන්නෙමු ද, ඒ වර්ණය එසැණින් ම ලබමු; යම් ශබ්දයක් පතන්නෙමු ද, ඒ ශබ්දය එසැණින් ම ලබමු; යම් සැපයක් පතන්නෙමු ද, ඒ සැපය එසැණින් ම ලබමු. භාග්‍යවතුන් වහන්ස, අනුරුද්ධයෙනි, අපි මනාපකායික නම් දෙවියෝ මේ තෙස්ථානයන්හි අධිපතිත්වය කරන්නෙමු, බලය පවත්වන්නෙමු.\"\n\nඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"අහෝ, මේ දෙවියෝ සියල්ලෝ ම නිල් පැහැ ඇත්තෝ, නිල් වර්ණ ඇත්තෝ, නිල් වස්ත්‍ර ඇත්තෝ, නිල් ආභරණ ඇත්තෝ වෙත්වා!\" ඉක්බිති ඒ දෙවියෝ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේගේ සිත දැන, සියල්ලෝ ම නිල් පැහැ ඇත්තෝ, නිල් වර්ණ ඇත්තෝ, නිල් වස්ත්‍ර ඇත්තෝ, නිල් ආභරණ ඇත්තෝ වූහ. ඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"අහෝ, මේ දෙවියෝ සියල්ලෝ ම කහ පැහැ ඇත්තෝ වෙත්වා!... සියල්ලෝ ම රතු පැහැ ඇත්තෝ වෙත්වා!... සියල්ලෝ ම සුදු පැහැ ඇත්තෝ, සුදු වර්ණ ඇත්තෝ, සුදු වස්ත්‍ර ඇත්තෝ, සුදු ආභරණ ඇත්තෝ වෙත්වා!\" ඉක්බිති ඒ දෙවියෝ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේගේ සිත දැන, සියල්ලෝ ම සුදු පැහැ ඇත්තෝ, සුදු වර්ණ ඇත්තෝ, සුදු වස්ත්‍ර ඇත්තෝ, සුදු ආභරණ ඇත්තෝ වූහ.\n\nඉක්බිති ඒ දෙවියන්ගෙන් එක් දෙවඟනක් ගායනා කළා ය, එක් දෙවඟනක් නැටුවා ය, එක් දෙවඟනක් වීණා වාදනය කළා ය. යම්සේ, මනා කොට පුරුදු කරන ලද, මනා කොට වාදනය කරන ලද, දක්ෂයන් විසින් මනා කොට අනුනාද කරන ලද පංචාංගික තූර්ය භාණ්ඩයක ශබ්දය මනහර ද, සිත් වසඟ කරනසුලු ද, සිත් ගන්නාසුලු ද, ප්‍රිය මනාප ද, මත් කරවනසුලු ද වෙයි ද; එපරිද්දෙන් ම ඒ දෙවඟනන්ගේ ආභරණවල ශබ්දය මනහර ද, සිත් වසඟ කරනසුලු ද, සිත් ගන්නාසුලු ද, ප්‍රිය මනාප ද, මත් කරවනසුලු ද විය. ඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ඉන්ද්‍රියයන් සංවර කර ගත් සේක. ඉක්බිති ඒ දෙවියෝ \"ආයුෂ්මත් අනුරුද්ධයන් වහන්සේ මෙය අනුමෝදන් නොකරන සේකැ\"යි සිතා, එතැනින් ම අතුරුදහන් වූහ.\n\nඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සවස් කාලයෙහි භාවනානුයෝගීත්වයෙන් නැගිට, භාග්‍යවතුන් වහන්සේ වෙත පැමිණි සේක; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක වැඩසිටි සේක. එක් පසෙක වැඩසිටි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූ සේක: \"භාග්‍යවතුන් වහන්ස, මෙහි මම දහවල් විහරණයට වැඩ සිටියෙමි, තනිව භාවනා කරමින්. ඉක්බිති භාග්‍යවතුන් වහන්ස, බොහෝ මනාපකායික නම් දෙවියෝ මා වෙත පැමිණියහ; පැමිණ, මට වන්දනා කොට, එක් පසෙක සිටියහ. එක් පසෙක සිටි භාග්‍යවතුන් වහන්ස, ඒ දෙවියෝ මට මෙය පැවසූහ: 'භාග්‍යවතුන් වහන්ස, අනුරුද්ධයෙනි, අපි මනාපකායික නම් දෙවියෝ තෙස්ථානයන්හි අධිපතිත්වය කරන්නෙමු, බලය පවත්වන්නෙමු. භාග්‍යවතුන් වහන්ස, අනුරුද්ධයෙනි, අප යම් වර්ණයක් පතන්නෙමු ද, ඒ වර්ණය එසැණින් ම ලබමු; යම් ශබ්දයක් පතන්නෙමු ද, ඒ ශබ්දය එසැණින් ම ලබමු; යම් සැපයක් පතන්නෙමු ද, ඒ සැපය එසැණින් ම ලබමු. භාග්‍යවතුන් වහන්ස, අනුරුද්ධයෙනි, අපි මනාපකායික නම් දෙවියෝ මේ තෙස්ථානයන්හි අධිපතිත්වය කරන්නෙමු, බලය පවත්වන්නෙමු.' එවිට භාග්‍යවතුන් වහන්ස, මට මෙසේ සිතුණි: 'අහෝ, මේ දෙවියෝ සියල්ලෝ ම නිල් පැහැ ඇත්තෝ, නිල් වර්ණ ඇත්තෝ, නිල් වස්ත්‍ර ඇත්තෝ, නිල් ආභරණ ඇත්තෝ වෙත්වා!' ඉක්බිති භාග්‍යවතුන් වහන්ස, ඒ දෙවියෝ මගේ සිත දැන, සියල්ලෝ ම නිල් පැහැ ඇත්තෝ, නිල් වර්ණ ඇත්තෝ, නිල් වස්ත්‍ර ඇත්තෝ, නිල් ආභරණ ඇත්තෝ වූහ.\n\n\"තවද භාග්‍යවතුන් වහන්ස, මට මෙසේ සිතුණි: 'අහෝ, මේ දෙවියෝ සියල්ලෝ ම කහ පැහැ ඇත්තෝ වෙත්වා!... සියල්ලෝ ම රතු පැහැ ඇත්තෝ වෙත්වා!... සියල්ලෝ ම සුදු පැහැ ඇත්තෝ, සුදු වර්ණ ඇත්තෝ, සුදු වස්ත්‍ර ඇත්තෝ, සුදු ආභරණ ඇත්තෝ වෙත්වා!' ඉක්බිති භාග්‍යවතුන් වහන්ස, ඒ දෙවියෝ මගේ සිත දැන, සියල්ලෝ ම සුදු පැහැ ඇත්තෝ, සුදු වර්ණ ඇත්තෝ, සුදු වස්ත්‍ර ඇත්තෝ, සුදු ආභරණ ඇත්තෝ වූහ.\n\n\"තවද භාග්‍යවතුන් වහන්ස, ඒ දෙවියන්ගෙන් එක් දෙවඟනක් ගායනා කළා ය, එක් දෙවඟනක් නැටුවා ය, එක් දෙවඟනක් වීණා වාදනය කළා ය. යම්සේ, මනා කොට පුරුදු කරන ලද, මනා කොට වාදනය කරන ලද, දක්ෂයන් විසින් මනා කොට අනුනාද කරන ලද පංචාංගික තූර්ය භාණ්ඩයක ශබ්දය මනහර ද, සිත් වසඟ කරනසුලු ද, සිත් ගන්නාසුලු ද, ප්‍රිය මනාප ද, මත් කරවනසුලු ද වෙයි ද; එපරිද්දෙන් ම ඒ දෙවඟනන්ගේ ආභරණවල ශබ්දය මනහර ද, සිත් වසඟ කරනසුලු ද, සිත් ගන්නාසුලු ද, ප්‍රිය මනාප ද, මත් කරවනසුලු ද විය. එවිට භාග්‍යවතුන් වහන්ස, මම ඉන්ද්‍රියයන් සංවර කර ගතිමි.\n\n\"තවද භාග්‍යවතුන් වහන්ස, ඒ දෙවියෝ 'ආයුෂ්මත් අනුරුද්ධයන් වහන්සේ මෙය අනුමෝදන් නොකරන සේකැ'යි සිතා, එතැනින් ම අතුරුදහන් වූහ. භාග්‍යවතුන් වහන්ස, කෙතෙක් ධර්මයන්ගෙන් යුක්ත වූ ස්ත්‍රියක් නම් කය බිඳී මරණින් මතු මනාපකායික දෙවියන්ගේ සහභාවයට පැමිණෙන්නේ ද?\" \"අනුරුද්ධය, අට ධර්මයන්ගෙන් යුක්ත වූ ස්ත්‍රියක් කය බිඳී මරණින් මතු මනාපකායික දෙවියන්ගේ සහභාවයට පැමිණෙන්නී ය. කවර අටකින් ද?\n\nඅනුරුද්ධයෙනි, මෙහිලා යම් ස්ත්‍රියකගේ දෙමාපියන් ඇය ස්වාමිපුරුෂයාට භාර දෙන්නේ ද, යහපත කැමතිව, හිතැතිව, අනුකම්පාවෙන් අනුකම්පාව උපදවාගෙන; ඇය ස්වාමිපුරුෂයාට පළමුවෙන් අවදි වන්නී, පසුව නින්දට යන්නී, කුමක් කළ යුතු දැයි විමසන්නී, සිත් සේ හැසිරෙන්නී, ප්‍රිය වචන කතා කරන්නී වන්නීය.\n\nයම් අය ස්වාමිපුරුෂයාගේ ගරු කටයුතු පුද්ගලයෝ වෙත් ද, එනම් මව හෝ පියා හෝ ශ්‍රමණබ්‍රාහ්මණයෝ හෝ වෙත් ද; ඇය ඔවුන්ට සත්කාර කරයි, ගරු කරයි, මානයෙන් තොරව සලකයි, පුදයි. පැමිණෙන අමුත්තන්ට ද ආසන-ජලයෙන් සංග්‍රහ කරයි.\n\nයම් ස්වාමිපුරුෂයාගේ ගෘහස්ථ කටයුතු වෙත් ද, එනම් ලොම් කටයුතු හෝ පුළුන් කටයුතු වැනි දෑ වෙත් ද; ඇය එහි දක්ෂ වන්නීය, කම්මැලි නො වන්නීය, එම කටයුතු වලට සුදුසු උපාය මාර්ගයන් විමසා දැනුමෙන් යුක්ත වන්නීය. ඒවා මැනවින් කිරීමටත්, මැනවින් සංවිධානය කිරීමටත් සමත් වන්නීය.\n\nයම් ස්වාමිපුරුෂයාගේ අභ්‍යන්තර ගෘහස්ථ ජනයා වෙත් ද, එනම් දාසයෝ හෝ මෙහෙකරුවෝ හෝ කම්කරුවෝ හෝ වෙත් ද; ඇය ඔවුන්ගේ කරන ලද දෑ කළ දෑ ලෙස ද, නොකරන ලද දෑ නොකළ දෑ ලෙස ද දන්නීය. රෝගී වූවන්ගේ ශක්තිමත් බව හා දුර්වල බව ද දන්නීය. ඔවුන්ට අනුභව කළ යුතු දෑ හා භෝජන දෑ සුදුසු ප්‍රමාණයෙන් බෙදා දෙන්නීය.\n\nස්වාමිපුරුෂයා යම් ධනයක් හෝ ධාන්‍යයක් හෝ රන් රිදී ආදිය ගෙන එන්නේ ද; ඇය එය රැකවරණයෙන් යුතුව ආරක්ෂා කරයි. එහි දී ඇය සූදු කෙළින්නියක් නො වෙයි, සොරකම් කරන්නියක් නො වෙයි, මත්පැන් බොන්නියක් නො වෙයි, විනාශ කරන්නියක් නො වෙයි.\n\nඇය උපාසිකාවක් වන්නීය; බුදුන් සරණ ගිය, ධර්මය සරණ ගිය, සංඝයා සරණ ගිය තැනැත්තියක් වන්නීය.\n\nඇය සීලවන්තියක් වන්නීය; පර පණ නැසීමෙන් වැළකුණා වූ, අනුන් සතු දේ නොගෙනීමෙන් වැළකුණා වූ, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණා වූ, බොරු කීමෙන් වැළකුණා වූ, මත්පැන් පානය කිරීමෙන් හා ප්‍රමාදයට කරුණුවන මත්ද්‍රව්‍ය ගැනීමෙන් වැළකුණා වූ තැනැත්තියක් වන්නීය.\n\nඇය ත්‍යාගශීලී වන්නීය. පහ වූ මසුරු මල ඇති සිතින් යුක්තව ගිහිගෙය වාසය කරන්නීය. විවෘත දානයන් කරන්නීය, පිරිසිදු අත් ඇති, කැප කිරීමෙහි ඇලී සිටින්නීය, ඉල්වන අයට දෙන සුලු, දන් දීමෙහිත් බෙදා දීමෙහිත් ඇලී සිටින්නීය.\n\nඅනුරුද්ධයෙනි, මේ අට කරුණුවලින් යුක්ත වූ ස්ත්‍රිය ශරීරය බිඳීමෙන්, මරණින් මතු මනාපකායික නම් දෙවියන්ගේ සහභාවයට පැමිණෙයි.\n\nයම් ස්වාමිපුරුෂයෙක් ඇය නිතර පෝෂණය කරන්නේ ද, නිරතුරුව උත්සාහයෙන් වීර්යයෙන් යුක්තව කටයුතු කරන්නේ ද; සියලු අවශ්‍යතා සපයන ඒ පුද්ගලයාට, ස්වාමිපුරුෂයාට ඇය අගෞරව නොකරන්නීය.\n\nඇය ස්වාමිපුරුෂයාට හොඳින් සිටින්නට සලස්වයි; ඊර්ෂ්‍යා සහගත වචනයකින් ඔහු කෝප නොකරයි. ස්වාමිපුරුෂයාගේ සියලු ගරු කටයුතු පුද්ගලයන්ට ද නුවණැති ඇය ගෞරවයෙන් පුද සත්කාර කරයි.\n\nඇය උත්සාහවන්තිය, කම්මැලි නො වන්නීය, පිරිවර (නිසි පරිදි) රැස් කර ගන්නිය (හසුරුවන්නිය) වන්නීය; ස්වාමිපුරුෂයාට ප්‍රිය වන අයුරින් හැසිරෙයි, උපයාගත් දේ ආරක්ෂා කරයි.\n\nයම් ස්ත්‍රියක් මෙසේ ස්වාමිපුරුෂයාගේ කැමැත්තට අනුව යමින් හැසිරෙයි ද; ඇය මනාප නම් වූ දෙවියන් අතරේ උපදී.",
      "paliTitle": "Anuruddhasuttaṃ",
      "englishTitle": "Anuruddha Sutta",
      "sinhalaTitle": "අනුරුද්ධ සූත්‍රය"
    },
    {
      "number": 47,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā…pe… ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca – ‘‘Aṭṭhahi kho, visākhe, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, visākhe, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī…pe…. ‘‘Cāgavatī kho pana hoti. Vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā. Imehi kho, visākhe, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. ‘‘Yo naṃ bharati sabbadā, niccaṃ ātāpi ussuko; Taṃ sabbakāmadaṃ posaṃ, bhattāraṃ nātimaññati. ‘‘Na cāpi sotthi bhattāraṃ, issāvādena rosaye; Bhattu ca garuno sabbe, paṭipūjeti paṇḍitā. ‘‘Uṭṭhāhikā analasā, saṅgahitaparijjanā; Bhattu manāpaṃ carati, sambhataṃ anurakkhati. ‘‘Yā evaṃ vattati nārī, bhattu chandavasānugā; Manāpā nāma te [manāpakāyikā (sī. ka.)] devā, yattha sā upapajjatī’’ti. sattamaṃ;",
      "english": "At one time, the Blessed One was dwelling in Sāvatthī, in the Eastern Park, in the palace of Migāra’s mother. Then Visākhā, Migāra’s mother, approached the Blessed One, paid homage, and sat down to one side. As Visākhā, Migāra’s mother, was sitting to one side, the Blessed One said this to her: “Visākhā, a woman endowed with eight qualities, upon the dissolution of the body, after death, reappears in the company of the gods whose bodies are delightful. Which eight? Here, Visākhā, a woman whom her parents give to a husband, desiring her welfare, wishing her good, out of compassion, out of sympathy, becomes one who rises before him, goes to bed after him, is attentive to what needs to be done, performs pleasing actions, speaks pleasantly, is virtuous, and is wise.\n\nFurthermore, she is generous. She dwells in the household with a mind free from the stain of avarice, open-handed, pure in hand, delighting in relinquishing, responsive to requests, delighting in sharing gifts. Visākhā, a woman endowed with these eight qualities, upon the dissolution of the body, after death, reappears in the company of the gods whose bodies are delightful.”\n\nShe does not scorn the husband who always supports her, who is ever ardent and diligent, that provider of all her needs.\n\nNor does she, by words of jealousy, provoke her husband to anger. And all respected ones of her husband, being wise, she pays due reverence.\n\nShe is diligent and not lazy, she manages the household staff well. She acts in a way pleasing to her husband, and she protects what has been acquired.\n\nThe woman who thus conducts herself, being obedient to her husband’s will — those gods are called 'Delightful Ones,' where she reappears.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයේ මිගාරමාතු ප්‍රාසාදයේ වැඩවසන සේක. එවිට භාග්‍යවතුන් වහන්සේ එකත්පසෙක වාඩි වී සිටි විශාඛා මිගාරමාතාවට මෙය වදාළ සේක:\n\n\"විශාඛාවෙනි, කරුණු අටකින් යුක්ත වූ මවක් කය බිඳී මරණයෙන් පසු මනංපකායික නම් දෙවියන්ගේ සහභාගීත්වය ලබයි. ඒ කරුණු අට කවරේද? විශාඛාවෙනි, මෙලොව යම් ස්ත්‍රියක් තමන්ගේ මව්පියන් විසින් යහපත කැමතිව, හිත සුව කැමතිව, අනුකම්පාවෙන් යුක්තව අනුකම්පාව උපදවා යම් පුරුෂයෙකුට දෙනු ලැබුවාද, ඇය ඔහුට භාර්යාව වී පළමුවෙන් නැගිටින්නියක්, පසුව නිදන්නියක්, කුමක් කරම්දැයි විමසන්නියක්, මනාප වූ හැසිරීම් ඇත්තියක්, ප්‍රිය වචන කියන්නියක් වේ. ත්‍යාගශීලී වන්නියක් ද වේ. කිළිටි මසුරුමල පහකළ සිතින් ගිහිගෙය වාසය කරයි. මුදාහළ ත්‍යාගයෙන් යුක්තව, පිරිසිදු අත් ඇතිව, පරිත්‍යාගයට ඇලුණා වූ, යාචනයට සුදුසු වූ, දන් දීමෙහිත් බෙදාදීමෙහිත් ඇලුණා වූ තැනැත්තියක් වේ. විශාඛාවෙනි, මේ කරුණු අටකින් යුක්ත වූ මවක් කය බිඳී මරණයෙන් පසු මනංපකායික නම් දෙවියන්ගේ සහභාගීත්වය ලබන්නේය.\"\n\n\"යම් පුරුෂයෙක් ඇයව නිරතුරුව පෝෂණය කරන්නේ ද, නිතර වීර්යයෙන් යුක්තව උත්සාහවන්තව කටයුතු කරන්නේ ද; සියලු කැමැති දේ සපයන ඒ පුරුෂයාට, සැමියාට අවමන් නොකරන්නීය.\n\nයහපත් වූ ඕ තොමෝ සැමියා ඊර්ෂ්‍යා සහගත වචනයෙන් කිපවන්නේ ද නොවේ; සැමියාට ගරු කරන්නා වූ සියලු දෙනාට ද බුද්ධිමත් ඇය පුද සත්කාර කරන්නේ ය.\n\nවීර්යයෙන් යුක්තව කටයුතු කරන්නියක්, අලස නොවන, පිරිස රැකගන්නියක්, සැමියාට මනාප ලෙස හැසිරෙයි, උපයාගත් ධනය රැකගන්නීය.\n\nයම් ස්ත්‍රියක් මෙසේ හැසිරෙන්නේ ද, සැමියාගේ කැමැත්තට අනුව කටයුතු කරන්නේ ද; ඇය මනංපකායික නම් දෙවියන් අතර උපදින්නීය.\"",
      "paliTitle": "Dutiyavisākhāsuttaṃ",
      "englishTitle": "The Second Visakha Discourse",
      "sinhalaTitle": "දෙවන විශාඛා සූත්‍රය"
    },
    {
      "number": 48,
      "pali": "Ekaṃ samayaṃ bhagavā bhaggesu viharati suṃsumāragire [suṃsumāragire (sī. syā. pī.)] bhesakaḷāvane migadāye. Atha kho nakulamātā gahapatānī yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe…. Ekamantaṃ nisinnaṃ kho nakulamātaraṃ gahapatāniṃ bhagavā etadavoca – ‘‘Aṭṭhahi kho, nakulamāte, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Katamehi aṭṭhahi? Idha, nakulamāte, mātugāmo yassa mātāpitaro bhattuno denti atthakāmā hitesino anukampakā anukampaṃ upādāya tassa hoti pubbuṭṭhāyinī pacchānipātinī kiṅkārapaṭissāvinī manāpacārinī piyavādinī. ‘‘Ye te bhattu garuno honti – mātāti vā pitāti vā samaṇabrāhmaṇāti vā – te sakkaroti garuṃ karoti māneti pūjeti, abbhāgate ca āsanodakena paṭipūjeti. ‘‘Ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ. ‘‘Yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena saṃvibhajati. ‘‘Yaṃ bhattā āharati dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā taṃ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā. ‘‘Upāsikā kho pana hoti buddhaṃ saraṇaṃ gatā dhammaṃ saraṇaṃ gatā saṅghaṃ saraṇaṃ gatā. ‘‘Sīlavatī kho pana hoti – pāṇātipātā paṭiviratā…pe… surāmerayamajjapamādaṭṭhānā paṭiviratā… pe…. ‘‘Cāgavatī kho pana hoti vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā. ‘‘Imehi kho, nakulamāte, aṭṭhahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. ‘‘Yo naṃ bharati sabbadā, niccaṃ ātāpi ussuko; Taṃ sabbakāmadaṃ posaṃ, bhattāraṃ nātimaññati. ‘‘Na cāpi sotthi bhattāraṃ, issāvādena rosaye; Bhattu ca garuno sabbe, paṭipūjeti paṇḍitā. ‘‘Uṭṭhāhikā analasā, saṅgahitaparijjanā; Bhattu manāpaṃ carati, sambhataṃ anurakkhati. ‘‘Yā evaṃ vattati nārī, bhattu chandavasānugā; Manāpā nāma te [manāpakāyikā (sī.)] devā, yattha sā upapajjatī’’ti. aṭṭhamaṃ;",
      "english": "At one time, the Blessed One was dwelling among the Bhaggas, at Suṃsumāragira, in the Bhesakaḷāvana Deer Park. Then Nakulamātā the lay follower woman approached the Blessed One, paid homage, and sat down to one side. To Nakulamātā the lay follower woman, sitting to one side, the Blessed One said this: \"Indeed, Nakulamātā, a woman endowed with eight qualities, upon the breaking up of the body, after death, reappears in the company of the devas of delightful form. With which eight?\n\nHere, Nakulamātā, a woman whom her parents give to a husband, desiring his welfare and acting out of compassion, is one who rises before him, goes to bed after him, is responsive to his needs, acts pleasingly, and speaks kindly. She honors, respects, esteems, and reveres those who are respected by her husband – be they mother, father, recluses, or brahmins – and she attends to arriving guests with a seat and water. She is skilled and diligent in her husband's domestic duties – whether it be wool or cotton work – she is endowed with the appropriate discernment to manage them, able to accomplish them and organize them. She knows her husband's household staff – whether servants, employees, or laborers – she knows what has been done as done and what has not been done as not done; she knows the strength and weakness of the sick among them; and she distributes food and drink to them according to their portion. Whatever wealth her husband brings home – be it wealth or grain, silver or gold – she manages it with care and protection, and she is not given to gambling, thieving, drinking, or squandering. Furthermore, she is a lay follower who has gone for refuge to the Buddha, to the Dhamma, and to the Saṅgha. Furthermore, she is virtuous – abstaining from the destruction of life, from taking what is not given, from sexual misconduct, from false speech, and from fermented and distilled liquors which are the basis of heedlessness. Furthermore, she is generous, dwelling at home with a mind free from the stain of stinginess, open-handed, pure in intention, delighting in relinquishment, responsive to requests, and delighting in sharing gifts. Indeed, Nakulamātā, a woman endowed with these eight qualities, upon the breaking up of the body, after death, reappears in the company of the devas of delightful form.\"\n\n\"She who always supports her husband, who is ever diligent and ardent, that provider of all her needs, she does not despise him. Nor does she, being virtuous, anger her husband with jealous words; and being wise, she fully honors all those respected by her husband. She is energetic and not lazy, carefully managing her dependents; she acts in a way pleasing to her husband, and protects what has been gathered. A woman who behaves in this way, conforming to her husband's will, reappears among the devas of delightful form where she is reborn.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ භග්ග නම් ජනපදයෙහි, සුංසුමාරගිර නම් නුවර, භේසකළාවන නම් මුවවනයෙහි වැඩසිටින සේක. එකල්හි නකුලමාතා ගෘහපති භාර්යාව භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියාය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වාඩිවූවාය. එකත්පසෙක වැඩසිටි නකුලමාතා ගෘහපති භාර්යාවට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"නකුලමාතය, ස්ත්‍රියක් කරුණු අටකින් යුක්ත වුවහොත්, කය බිඳී මරණයෙන් පසු, මනාපකායික නම් දෙවියන්ගේ සහභාග්‍යයට උපදී. කවර අටකින්ද? නකුලමාතය, මෙහිලා ස්ත්‍රිය, යම් ස්වාමිපුරුෂයෙකුට ඇගේ මව්පියන් හිත කැමතිව, යහපත කැමතිව, අනුකම්පාවෙන් යුක්තව, අනුකම්පාව පෙරදැරිව භාර දෙන්නේද, ඔහුට ඇය පළමුවෙන් නැගිටින්නියක්, පසුව නිදාගන්නියක්, 'කුමක්ද කළ යුත්තේ' යැයි අසමින් කීකරු වන්නියක්, මනාව හැසිරෙන්නියක්, ප්‍රිය වචන කථා කරන්නියක් ද වෙයි.\n\n\"යම් කෙනෙක් ස්වාමිපුරුෂයාට ගරු කටයුතු අය වෙත්ද – එනම් මව හෝ පියා හෝ ශ්‍රමණ බ්‍රාහ්මණයන් හෝ වෙත්ද – ඔවුන්ට ඇය සත්කාර කරයි, ගරු කරයි, සලකයි, පුදයි. පැමිණෙන්නන්ට ද අසුනක් සහ දියෙන් සංග්‍රහ කරයි.\n\n\"ස්වාමිපුරුෂයාගේ යම් අභ්‍යන්තර කටයුතු – එනම් ලොම් වැඩ හෝ පුළුන් වැඩ හෝ වෙත්ද – එහි ඇය දක්ෂ වෙයි, අලස නොවෙයි, ඒ සඳහා සුදුසු උපක්‍රමශීලී විමංසාවෙන් යුක්ත වෙයි, එය කිරීමට සමත් වෙයි, එය සංවිධානය කිරීමට සමත් වෙයි.\n\n\"ස්වාමිපුරුෂයාගේ යම් අභ්‍යන්තර ගෘහස්ථ ජනයා – එනම් දාසයෝ හෝ සේවකයෝ හෝ කම්කරුවෝ හෝ වෙත්ද – ඔවුන්ගේ කරන ලද දේ කරන ලද ලෙස දනී, නොකරන ලද දේ නොකර ලද ලෙස දනී; රෝගී වූවන්ගේ ශක්තිය හා දුර්වලතාව දනී, ඔවුන්ට ආහාරපාන නිසි කොටසින් බෙදා දෙයි.\n\n\"ස්වාමිපුරුෂයා යම් ධනයක් උපයාගෙන එයිද – එනම් ධනය හෝ ධාන්‍ය හෝ රිදී හෝ රන් හෝ වෙයිද – එය ආරක්ෂා සහිතව, ආරක්ෂා සහිත බවින් යුතුව මැනවින් පවත්වා ගනියි, එහිදී ඇය සූදු කෙළින්නියක් නොවෙයි, සොරකම් කරන්නියක් නොවෙයි, මත්පැන් බොන්නියක් නොවෙයි, විනාශ කරන්නියක් නොවෙයි.\n\n\"තවද ඇය බුදුන් සරණ ගිය, දහම් සරණ ගිය, සඟුන් සරණ ගිය උපාසිකාවක් වෙයි.\n\n\"තවද ඇය සිල්වත් වෙයි – ප්‍රාණඝාතයෙන් වැළකුණියක් වෙයි, අදත්තාදානයෙන් වැළකුණියක් වෙයි, කාමමිථ්‍යාචාරයෙන් වැළකුණියක් වෙයි, මුසාවාදයෙන් වැළකුණියක් වෙයි, සුරාමේරය මත්පැන් පානයෙන් වැළකුණියක් වෙයි.\n\n\"තවද ඇය ත්‍යාගශීලී වෙයි, කෙලෙස් මලින් තොර මසුරුකමින් තොර සිතකින් යුතුව ගිහි ගෙයි වාසය කරයි, නිදහසේ දන්දෙන්නියක් වෙයි, පිරිසිදු දෑත් ඇත්තියක් වෙයි, දන් දීමෙහි ඇලුණියක් වෙයි, ඉල්ලන දේ දෙන්නියක් වෙයි, දන් බෙදා දීමෙහි ඇලුණියක් වෙයි.\n\n\"නකුලමාතය, ස්ත්‍රියක් මේ කරුණු අටෙන් යුක්ත වුවහොත්, කය බිඳී මරණයෙන් පසු, මනාපකායික නම් දෙවියන්ගේ සහභාග්‍යයට උපදී.\"\n\n\"යමෙක් සැමවිටම ඇයව පෝෂණය කරන්නේද, නිරන්තරයෙන් උත්සාහවත්ව, වීර්යවත්ව සිටින්නේද; සියලු ආශාවන් සම්පූර්ණ කරන ඒ ස්වාමිපුරුෂයාට ඇය අවමන් නොකරයි.\n\n\"තවද, ඇය තම ස්වාමිපුරුෂයා ඊර්ෂ්‍යාවෙන් යුත් වචනවලින් කිපවන්නේද නැත; ස්වාමිපුරුෂයාට ගරු කටයුතු සියලු දෙනාට, ප්‍රඥාවන්තිය වන ඇය මැනවින් සත්කාර කරයි.\n\n\"ඇය උත්සාහවත්ව, අලස නොවී, පිරිසට සංග්‍රහ කරන්නියක් වෙයි; ස්වාමිපුරුෂයාට ප්‍රිය උපදවන ලෙස හැසිරෙයි, රැස් කරන ලද ධනය ආරක්ෂා කරයි.\n\n\"යම් ස්ත්‍රියක් මෙසේ හැසිරෙයිද, ස්වාමිපුරුෂයාගේ කැමැත්තට අනුව යයිද; ඒ මනාපකායික නම් දෙවියන් අතර ඇය උපදී.\"",
      "paliTitle": "Nakulamātāsuttaṃ",
      "englishTitle": "Mother Nakula Discourse",
      "sinhalaTitle": "නකුලමාතා සූත‍්‍රය"
    },
    {
      "number": 49,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami…pe…. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā etadavoca – ‘‘Catūhi kho, visākhe, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo susaṃvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṃ carati, sambhataṃ anurakkhati. ‘‘Kathañca, visākhe, mātugāmo susaṃvihitakammanto hoti? Idha, visākhe, mātugāmo ye te bhattu abbhantarā kammantā – uṇṇāti vā kappāsāti vā – tattha dakkhā hoti analasā tatrupāyāya vīmaṃsāya samannāgatā alaṃ kātuṃ alaṃ saṃvidhātuṃ. Evaṃ kho, visākhe, mātugāmo susaṃvihitakammanto hoti. ‘‘Kathañca, visākhe, mātugāmo saṅgahitaparijano hoti? Idha, visākhe, mātugāmo yo so bhattu abbhantaro antojano – dāsāti vā pessāti vā kammakarāti vā – tesaṃ katañca katato jānāti akatañca akatato jānāti, gilānakānañca balābalaṃ jānāti khādanīyaṃ bhojanīyañcassa paccaṃsena saṃvibhajati. Evaṃ kho, visākhe, mātugāmo saṅgahitaparijano hoti. ‘‘Kathañca, visākhe, mātugāmo bhattu manāpaṃ carati? Idha, visākhe, mātugāmo yaṃ bhattu amanāpasaṅkhātaṃ taṃ jīvitahetupi na ajjhācarati. Evaṃ kho, visākhe, mātugāmo bhattu manāpaṃ carati. ‘‘Kathañca, visākhe, mātugāmo sambhataṃ anurakkhati? Idha, visākhe, mātugāmo yaṃ bhattā āharati dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā taṃ ārakkhena guttiyā sampādeti, tattha ca hoti adhuttī athenī asoṇḍī avināsikā. Evaṃ kho, visākhe, mātugāmo sambhataṃ anurakkhati. Imehi kho, visākhe, catūhi dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. ‘‘Catūhi kho, visākhe, dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hoti. Katamehi catūhi? Idha, visākhe, mātugāmo saddhāsampanno hoti, sīlasampanno hoti, cāgasampanno hoti, paññāsampanno hoti. ‘‘Kathañca, visākhe, mātugāmo saddhāsampanno hoti? Idha, visākhe, mātugāmo saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Evaṃ kho, visākhe, mātugāmo saddhāsampanno hoti. ‘‘Kathañca, visākhe, mātugāmo sīlasampanno hoti? Idha, visākhe, mātugāmo pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṃ kho, visākhe, mātugāmo sīlasampanno hoti. ‘‘Kathañca, visākhe, mātugāmo cāgasampanno hoti? Idha, visākhe, mātugāmo vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgā payatapāṇinī vossaggaratā yācayogā dānasaṃvibhāgaratā. Evaṃ kho, visākhe, mātugāmo cāgasampanno hoti. ‘‘Kathañca, visākhe, mātugāmo paññāsampanno hoti? Idha, visākhe, mātugāmo paññavā hoti… pe… evaṃ kho, visākhe, mātugāmo paññāsampanno hoti. Imehi kho, visākhe, catūhi dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hotī’’ti. ‘‘Susaṃvihitakammantā, saṅgahitaparijjanā; Bhattu manāpaṃ carati, sambhataṃ anurakkhati. ‘‘Saddhā sīlena sampannā, vadaññū vītamaccharā; Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ. ‘‘Iccete aṭṭha dhammā ca, yassā vijjanti nāriyā; Tampi sīlavatiṃ āhu, dhammaṭṭhaṃ saccavādiniṃ. ‘‘Soḷasākārasampannā, aṭṭhaṅgasusamāgatā; Tādisī sīlavatī upāsikā; Upapajjati devalokaṃ manāpa’’nti. navamaṃ;",
      "english": "On one occasion, The Blessed One was staying in Sāvatthī, at the Eastern Park, in Migāra’s mother’s palace. Then Visākhā, Migāra’s mother, approached The Blessed One. Having approached, she paid homage to The Blessed One, sat down to one side, and The Blessed One addressed her, as she sat there to one side, saying:\n\n“Visākhā, a woman endowed with four qualities is embarked upon a path to success in this world; for her, the well-being of this world is secured. Which four? Here, Visākhā, a woman is well-organized in her work, she cares for her household, she acts pleasingly to her husband, and she safeguards what is accumulated.\n\n“And how, Visākhā, is a woman well-organized in her work? Here, Visākhā, in whatever domestic duties of her husband there are – whether in processing wool or cotton – she is diligent and not lazy, endowed with skillful inquiry regarding them, capable of doing and capable of organizing them. In this way, Visākhā, a woman is well-organized in her work.\n\n“And how, Visākhā, does a woman care for her household? Here, Visākhā, regarding her husband’s internal household staff—whether male slaves, female slaves, or workers—she knows what has been done as done, and what has not been done as not done. She knows the strength and weakness of the sick among them. She distributes food and drink to them according to their portions. In this way, Visākhā, a woman cares for her household.\n\n“And how, Visākhā, does a woman act pleasingly to her husband? Here, Visākhā, whatever her husband considers disagreeable, she does not commit it even for the sake of her life. In this way, Visākhā, a woman acts pleasingly to her husband.\n\n“And how, Visākhā, does a woman safeguard what is accumulated? Here, Visākhā, whatever wealth her husband brings home – whether money, grain, silver, or gold – she manages it with protection and safeguarding. She is not given to gambling, not a thief, not addicted to intoxicants, and not destructive. In this way, Visākhā, a woman safeguards what is accumulated.\n\n“Visākhā, a woman endowed with these four qualities is embarked upon a path to success in this world; for her, the well-being of this world is secured.\n\n“Visākhā, a woman endowed with four qualities is embarked upon a path to success in the next world; for her, the well-being of the next world is secured. Which four? Here, Visākhā, a woman is endowed with faith, endowed with moral conduct, endowed with generosity, and endowed with wisdom.\n\n“And how, Visākhā, is a woman endowed with faith? Here, Visākhā, a woman is faithful; she places her faith in the awakening of the Tathāgata, believing: ‘Indeed, The Blessed One is Accomplished, Perfectly Self-Awakened, Endowed with Knowledge and Conduct, Fortunate, Knower of Worlds, Unsurpassed Trainer of Persons to be Tamed, Teacher of gods and humans, The Awakened One, The Exalted One.’ In this way, Visākhā, a woman is endowed with faith.\n\n“And how, Visākhā, is a woman endowed with moral conduct? Here, Visākhā, a woman abstains from killing living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from alcoholic drinks and drugs which are the basis for heedlessness. In this way, Visākhā, a woman is endowed with moral conduct.\n\n“And how, Visākhā, is a woman endowed with generosity? Here, Visākhā, a woman lives at home with a mind free from the stain of stinginess, freely generous, with open hands, delighting in relinquishing, responsive to requests, delighting in giving and sharing. In this way, Visākhā, a woman is endowed with generosity.\n\n“And how, Visākhā, is a woman endowed with wisdom? Here, Visākhā, a woman is wise, endowed with wisdom that observes the nature of things, which is noble, penetrative, and leads to the complete eradication of suffering. In this way, Visākhā, a woman is endowed with wisdom.\n\n“Visākhā, a woman endowed with these four qualities is embarked upon a path to success in the next world; for her, the well-being of the next world is secured.”\n\n“Well-organized in her work, caring for her household,\nActing pleasingly to her husband, safeguarding what is accumulated;\nEndowed with faith and moral conduct, generous, free from stinginess,\nShe constantly purifies the path for well-being in the future.\nThus, when these eight qualities are found in a woman,\nThey call her morally virtuous, firm in the Dhamma, and truthful.\nSuch a virtuous female lay follower,\nEndowed with sixteen aspects and perfectly possessed of eight factors,\nIs reborn into a delightful heavenly world.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයේ මිගාරමාතු ප්‍රාසාදයේ වැඩ වාසය කරන සේක. එකල්හි මිගාරමාතා විශාඛා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියාය. එක්පසෙක වැඩහුන් මිගාරමාතා විශාඛාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"විශාඛා, ස්ත්‍රියක් මේ ධර්ම සතරින් යුක්ත වුවහොත් මෙලොව ජය ගැනීම පිණිස පිළිපන් තැනැත්තියක් වේ, ඇයට මේ ලෝකය මනාව ආරම්භ වූවක් වේ. කවර සතරකින්ද? විශාඛා, මෙහිලා ස්ත්‍රිය මනාව සංවිධානය කරන ලද කාර්යයන් ඇත්තියක් වේ, පිරිවර ජනයා එක්රැස් කරගත්තියක් වේ, ස්වාමියාට ප්‍රිය මනාප දේ සිදුකරන්නියක් වේ, රැස් කළ ධනය රැකබලා ගන්නියක් වේ.\"\n\n\"විශාඛා, ස්ත්‍රියක් මනාව සංවිධානය කරන ලද කාර්යයන් ඇත්තියක් වන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය, ස්වාමියාගේ ගෘහස්ථ කාර්යයන් වන ලොම් කටයුතු හෝ පුළුන් කටයුතු වේවා, ඒ පිළිබඳව දක්ෂ වේ, අලස නොවේ, ඒ කටයුතුවලට අවශ්‍ය උපක්‍රමශීලී විමංසාවෙන් යුක්ත වේ, ඒවා කිරීමට සමත් වේ, මනාව සංවිධානය කිරීමට සමත් වේ. විශාඛා, මෙලෙසින් ස්ත්‍රිය මනාව සංවිධානය කරන ලද කාර්යයන් ඇත්තියක් වේ.\"\n\n\"විශාඛා, ස්ත්‍රියක් පිරිවර ජනයා එක්රැස් කරගත්තියක් වන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය, ස්වාමියාගේ ගෘහස්ථ සේවක පිරිස වන දාසයන් හෝ පේෂ කර්මාන්තයේ යෙදෙන අය හෝ කම්කරුවන් වේවා, ඔවුන් කළ දේ කළ ලෙසින් දනී, නොකළ දේ නොකළ ලෙසින් දනී, රෝගී වූවන්ගේ ශක්තිය හා දුබලතාවය දනී, ඔවුන්ට ආහාරපාන නිසි කොටසින් බෙදා දෙයි. විශාඛා, මෙලෙසින් ස්ත්‍රිය පිරිවර ජනයා එක්රැස් කරගත්තියක් වේ.\"\n\n\"විශාඛා, ස්ත්‍රියක් ස්වාමියාට ප්‍රිය මනාප දේ සිදුකරන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය, ස්වාමියාට අප්‍රිය මනාප යැයි සලකන යමක් වේ නම්, ජීවිතය හේතුකොටගෙන වුවද එය අනුගමනය නොකරයි. විශාඛා, මෙලෙසින් ස්ත්‍රිය ස්වාමියාට ප්‍රිය මනාප දේ සිදුකරයි.\"\n\n\"විශාඛා, ස්ත්‍රියක් රැස් කළ ධනය රැකබලා ගන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය, ස්වාමියා ගෙනෙන ධනය හෝ ධාන්‍ය හෝ රිදී හෝ රන් වේවා, එය ආරක්ෂා කිරීමෙන් හා රැකවරණයෙන් යුතුව පවත්වා ගනී, එහිදී සූදු කෙළින්නියක් නොවේ, සොරකම් කරන්නියක් නොවේ, මත්ද්‍රව්‍යවලට ඇබ්බැහි වූවක් නොවේ, නාස්තිකාරියක් නොවේ. විශාඛා, මෙලෙසින් ස්ත්‍රිය රැස් කළ ධනය රැකබලා ගනී. විශාඛා, මේ ධර්ම සතරින් යුක්ත වූ ස්ත්‍රිය මෙලොව ජය ගැනීම පිණිස පිළිපන් තැනැත්තියක් වේ, ඇයට මේ ලෝකය මනාව ආරම්භ වූවක් වේ.\"\n\n\"විශාඛා, තවද ධර්ම සතරකින් යුක්ත වූ ස්ත්‍රිය පරලොව ජය ගැනීම පිණිස පිළිපන් තැනැත්තියක් වේ, ඇයට පරලොව මනාව ආරම්භ වූවක් වේ. කවර සතරකින්ද? විශාඛා, මෙහිලා ස්ත්‍රිය ශ්‍රද්ධා සම්පන්න වේ, ශීල සම්පන්න වේ, ත්‍යාග සම්පන්න වේ, ප්‍රඥා සම්පන්න වේ.\"\n\n\"විශාඛා, ස්ත්‍රියක් ශ්‍රද්ධා සම්පන්න වන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය ශ්‍රද්ධාවන්ත වේ, තථාගතයන් වහන්සේගේ බෝධිය විශ්වාස කරයි – 'ඒ භාග්‍යවතුන් වහන්සේ අරහත්, සම්මා සම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර පුරිසදම්ම සාරථී, දෙව්මිනිසුන්ගේ ශාස්තෘ, බුද්ධ, භාග්‍යවතුන් වහන්සේ ය' යනුවෙනි. විශාඛා, මෙලෙසින් ස්ත්‍රිය ශ්‍රද්ධා සම්පන්න වේ.\"\n\n\"විශාඛා, ස්ත්‍රියක් ශීල සම්පන්න වන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය සතුන් මැරීමෙන්, සොරකම් කිරීමෙන්, කාමමිථ්‍යාචාරයෙන්, බොරු කීමෙන්, මත්පැන් පානයෙන් වැළකුණියක් වේ. විශාඛා, මෙලෙසින් ස්ත්‍රිය ශීල සම්පන්න වේ.\"\n\n\"විශාඛා, ස්ත්‍රියක් ත්‍යාග සම්පන්න වන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය පහවූ මසුරු මල සහිත සිතකින් ගෘහ ජීවිතය ගත කරයි, නිදහස් ත්‍යාගයෙන් යුක්තව, පිරිසිදු දෑත් ඇතිව, කැපකිරීමට ඇලී, දානයට සුදුසු අයහට, දන් දීමෙහි හා බෙදා දීමෙහි ඇලී සිටින්නියක් වේ. විශාඛා, මෙලෙසින් ස්ත්‍රිය ත්‍යාග සම්පන්න වේ.\"\n\n\"විශාඛා, ස්ත්‍රියක් ප්‍රඥා සම්පන්න වන්නේ කෙසේද? විශාඛා, මෙහිලා ස්ත්‍රිය ප්‍රඥාවන්ත වේ, යම් ප්‍රඥාවකින් යුක්තව ඉපදීම හා මරණය කෙරෙහි ඇති නොමග යවන ස්වභාවය අවබෝධ කරගනිමින් දුක මුළුමනින්ම අවසන් කිරීමට හේතු වන ආර්ය මාර්ගයට පැමිණේද, ඒ ප්‍රඥාවෙන් යුක්ත වේ. විශාඛා, මෙලෙසින් ස්ත්‍රිය ප්‍රඥා සම්පන්න වේ. විශාඛා, මේ ධර්ම සතරින් යුක්ත වූ ස්ත්‍රිය පරලොව ජය ගැනීම පිණිස පිළිපන් තැනැත්තියක් වේ, ඇයට පරලොව මනාව ආරම්භ වූවක් වේ.\"\n\nමනාව සංවිධානය කරන ලද කාර්යයන් ඇත්තියක්,\nපිරිවර ජනයා එක්රැස් කරගත්තියක්,\nස්වාමියාට ප්‍රිය මනාප දේ සිදුකරන්නියක්,\nරැස් කළ ධනය රැකබලා ගන්නියක් වේ.\n\nශ්‍රද්ධාවෙන් හා ශීලයෙන් යුක්ත වූ,\nත්‍යාගශීලී වූ, පහවූ මසුරුකම් ඇත්තී,\nනිරතුරුව පරලොව යහපත පිණිස මාර්ගය පිරිසිදු කරන්නියක් වේ.\n\nමේ ධර්ම අට කවර ස්ත්‍රියකට ඇත්ද,\nඇය ශීලවන්තියක්, ධර්මයේ පිහිටියක්, සත්‍යවාදිනියක් ලෙස හඳුන්වනු ලැබේ.\nදහසය ආකාරයක ගුණධර්මයන්ගෙන් සමන්විත වූ,\nඅෂ්ටාංගික වශයෙන් මනාව යුක්ත වූ,\nඑවැනි ශීලවන්ත උපාසිකාව ප්‍රිය මනාප දෙව්ලොව උපදී.",
      "paliTitle": "Paṭhamaidhalokikasuttaṃ",
      "englishTitle": "The First Worldly Discourse",
      "sinhalaTitle": "පළමුවන ඉහලෞකික සූත්‍රය"
    },
    {
      "number": 50,
      "pali": "‘‘Catūhi, bhikkhave, dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. Katamehi catūhi? Idha, bhikkhave, mātugāmo susaṃvihitakammanto hoti, saṅgahitaparijano, bhattu manāpaṃ carati, sambhataṃ anurakkhati. ‘‘Kathañca, bhikkhave, mātugāmo susaṃvihitakammanto hoti? Idha, bhikkhave, mātugāmo ye te bhattu abbhantarā kammantā…pe… evaṃ kho, bhikkhave, mātugāmo susaṃvihitakammanto hoti. ‘‘Kathañca, bhikkhave, mātugāmo saṅgahitaparijano hoti? Idha, bhikkhave, mātugāmo yo so bhattu abbhantaro antojano…pe… evaṃ kho, bhikkhave, mātugāmo saṅgahitaparijano hoti. ‘‘Kathañca, bhikkhave, mātugāmo bhattu manāpaṃ carati? Idha, bhikkhave, mātugāmo yaṃ bhattu amanāpasaṅkhātaṃ taṃ jīvitahetupi na ajjhācarati. Evaṃ kho, bhikkhave, mātugāmo bhattu manāpaṃ carati. ‘‘Kathañca, bhikkhave, mātugāmo sambhataṃ anurakkhati? Idha, bhikkhave, mātugāmo yaṃ bhattā āharati…pe… evaṃ kho, bhikkhave, mātugāmo sambhataṃ anurakkhati. Imehi kho, bhikkhave, catūhi dhammehi samannāgato mātugāmo idhalokavijayāya paṭipanno hoti, ayaṃsa loko āraddho hoti. ‘‘Catūhi, bhikkhave, dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hoti. Katamehi catūhi? Idha, bhikkhave, mātugāmo saddhāsampanno hoti, sīlasampanno hoti, cāgasampanno hoti, paññāsampanno hoti. ‘‘Kathañca, bhikkhave, mātugāmo saddhāsampanno hoti? Idha, bhikkhave, mātugāmo saddho hoti…pe… evaṃ kho, bhikkhave, mātugāmo saddhāsampanno hoti. ‘‘Kathañca, bhikkhave, mātugāmo sīlasampanno hoti? Idha, bhikkhave, mātugāmo pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Evaṃ kho, bhikkhave, mātugāmo sīlasampanno hoti. ‘‘Kathañca, bhikkhave, mātugāmo cāgasampanno hoti? Idha, bhikkhave, mātugāmo vigatamalamaccherena cetasā agāraṃ ajjhāvasati…pe… evaṃ kho, bhikkhave, mātugāmo cāgasampanno hoti. ‘‘Kathañca, bhikkhave, mātugāmo paññāsampanno hoti? Idha, bhikkhave, mātugāmo paññavā hoti…pe… evaṃ kho, bhikkhave, mātugāmo paññāsampanno hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato mātugāmo paralokavijayāya paṭipanno hoti, paraloko āraddho hotī’’ti. ‘‘Susaṃvihitakammantā, saṅgahitaparijjanā; Bhattu manāpaṃ carati, sambhataṃ anurakkhati. ‘‘Saddhā sīlena sampannā, vadaññū vītamaccharā; Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ. ‘‘Iccete aṭṭha dhammā ca, yassā vijjanti nāriyā; Tampi sīlavatiṃ āhu, dhammaṭṭhaṃ saccavādiniṃ. ‘‘Soḷasākārasampannā, aṭṭhaṅgasusamāgatā; Tādisī sīlavatī upāsikā, upapajjati devalokaṃ manāpa’’nti. dasamaṃ; ",
      "english": "Monks, a woman endowed with four qualities is devoted to success in this world; this world's well-being is attained by her. Which four? Here, monks, a woman manages her duties well, looks after her dependents, conducts herself in a way pleasing to her husband, and guards what has been acquired.\n\nAnd how, monks, does a woman manage her duties well? Here, monks, a woman attends to the domestic tasks that belong to her husband, doing them skillfully, diligently, and completely. Thus, monks, a woman manages her duties well.\n\nAnd how, monks, does a woman look after her dependents? Here, monks, a woman properly cares for the household staff and other dependents who belong to her husband, ensuring their well-being and managing them appropriately. Thus, monks, a woman looks after her dependents.\n\nAnd how, monks, does a woman conduct herself in a way pleasing to her husband? Here, monks, a woman does not commit what is considered displeasing to her husband, even for the sake of her life. Thus, monks, a woman conducts herself in a way pleasing to her husband.\n\nAnd how, monks, does a woman guard what has been acquired? Here, monks, a woman diligently protects what her husband brings in, whether it be wealth, grain, silver, or gold, ensuring it is not wasted, lost, or damaged. Thus, monks, a woman guards what has been acquired.\n\nMonks, a woman endowed with these four qualities is devoted to success in this world; this world's well-being is attained by her.\n\nMonks, a woman endowed with four qualities is devoted to success in the next world; the next world's well-being is attained by her. Which four? Here, monks, a woman is endowed with faith, endowed with virtue, endowed with generosity, and endowed with wisdom.\n\nAnd how, monks, is a woman endowed with faith? Here, monks, a woman has faith, believing in the Awakened One’s awakening, in the Teaching as well-proclaimed, and in the Saṅgha as practicing well, possessing a firm conviction in the Triple Gem. Thus, monks, a woman is endowed with faith.\n\nAnd how, monks, is a woman endowed with virtue? Here, monks, a woman abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from distilled and fermented liquors that are a basis for heedlessness. Thus, monks, a woman is endowed with virtue.\n\nAnd how, monks, is a woman endowed with generosity? Here, monks, a woman dwells at home with a mind free from the stain of stinginess, being open-handed, delighting in giving, responsive to requests, and delighted in sharing gifts. Thus, monks, a woman is endowed with generosity.\n\nAnd how, monks, is a woman endowed with wisdom? Here, monks, a woman is wise, possessing the wisdom that sees rise and fall, noble and penetrative, leading to the complete destruction of suffering. Thus, monks, a woman is endowed with wisdom.\n\nMonks, a woman endowed with these four qualities is devoted to success in the next world; the next world's well-being is attained by her.\n\nManaging her duties well, looking after her dependents,\nShe conducts herself in a way pleasing to her husband, and guards what has been acquired.\nEndowed with faith and virtue, generous and free from stinginess,\nShe constantly purifies the path that leads to well-being in the future life.\nIndeed, these eight qualities, when found in a woman,\nThey call her virtuous, righteous, and truthful.\nEndowed with sixteen aspects, perfectly furnished with eight components,\nSuch a virtuous female lay follower is reborn into a delightful heavenly realm.",
      "sinhala": "භික්ෂූණි, කාන්තාවක් සතර ධර්මයකින් යුක්තව මේ ආත්මයෙහි ජයග්‍රහණය පිණිස පිළිපදින්නියක් වෙයි. මේ ලෝකය ඇයට අරඹන ලද්දක් (සාර්ථක කරගත්තක්) වෙයි. කවර සතරකින්ද? භික්ෂූණි, මෙහිලා කාන්තාව හොඳින් සංවිධානය කරන ලද කටයුතු ඇත්තියක් වෙයි, පිරිවර හොඳින් රැකබලාගන්නියක් වෙයි, ස්වාමියාට ප්‍රිය මනාප වන පරිදි හැසිරෙයි, රැස් කරගත් දේ රකිනු ලබන්නියක් වෙයි.\n\nභික්ෂූණි, කාන්තාව හොඳින් සංවිධානය කරන ලද කටයුතු ඇත්තියක් වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව ස්වාමියාගේ යම් ගෘහස්ථ කටයුතු වේද, ඒවා කම්මැලි නොවී, දක්ෂව, කඩිසරව, සියලු කටයුතු හොඳින් සංවිධානය කර සම්පූර්ණ කරන්නියක් වෙයි. භික්ෂූණි, මෙසේ කාන්තාව හොඳින් සංවිධානය කරන ලද කටයුතු ඇත්තියක් වෙයි.\n\nභික්ෂූණි, කාන්තාව පිරිවර හොඳින් රැකබලාගන්නියක් වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව ස්වාමියාගේ යම් ගෘහස්ථ පිරිවරක් (සේවකයන්, නෑදෑයන්) වේද, ඔවුන්ට ආදරයෙන්, කරුණාවෙන්, හොඳින් සලකමින්, ඔවුන් එකතු කරගෙන (පෝෂණය කරමින්) කටයුතු කරන්නියක් වෙයි. භික්ෂූණි, මෙසේ කාන්තාව පිරිවර හොඳින් රැකබලාගන්නියක් වෙයි.\n\nභික්ෂූණි, කාන්තාව ස්වාමියාට ප්‍රිය මනාප වන පරිදි හැසිරෙන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව ස්වාමියාට අප්‍රිය දේ යම් වේද, ඒවා ජීවිතය හේතුකොටගෙනවත් නොකරයි. භික්ෂූණි, මෙසේ කාන්තාව ස්වාමියාට ප්‍රිය මනාප වන පරිදි හැසිරෙයි.\n\nභික්ෂූණි, කාන්තාව රැස් කරගත් දේ රකිනු ලබන්නියක් වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව ස්වාමියා යම් ධනයක් (ධාන්‍ය, රන්, රිදී ආදිය) උපයාගෙන එන්නේද, ලබාගත් ධනය සුරක්ෂිතව තබාගන්නියක් වෙයි, එය අපතේ නොයවා, සොරුන්ගෙන් ආරක්ෂා කර, හොඳින් කළමනාකරණය කරන්නියක් වෙයි. භික්ෂූණි, මෙසේ කාන්තාව රැස් කරගත් දේ රකිනු ලබන්නියක් වෙයි. භික්ෂූණි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ කාන්තාව මේ ආත්මයෙහි ජයග්‍රහණය පිණිස පිළිපදින්නියක් වෙයි. මේ ලෝකය ඇයට අරඹන ලද්දක් වෙයි.\n\nභික්ෂූණි, කාන්තාවක් සතර ධර්මයකින් යුක්තව පරලොව ජයග්‍රහණය පිණිස පිළිපදින්නියක් වෙයි. පරලොව ඇයට අරඹන ලද්දක් (සාර්ථක කරගත්තක්) වෙයි. කවර සතරකින්ද? භික්ෂූණි, මෙහිලා කාන්තාව ශ්‍රද්ධා සම්පන්න වෙයි, සීල සම්පන්න වෙයි, ත්‍යාග සම්පන්න වෙයි, ප්‍රඥා සම්පන්න වෙයි.\n\nභික්ෂූණි, කාන්තාව ශ්‍රද්ධා සම්පන්න වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව ශ්‍රද්ධාවන්ත වෙයි, බුදුන් වහන්සේ, ධර්මය හා සංඝයා කෙරෙහි නොසෙල්වෙන ශ්‍රද්ධාවෙන් යුක්ත වෙයි. භික්ෂූණි, මෙසේ කාන්තාව ශ්‍රද්ධා සම්පන්න වෙයි.\n\nභික්ෂූණි, කාන්තාව සීල සම්පන්න වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව ප්‍රාණඝාතයෙන්, සොරකම් කිරීමෙන්, වැරදි කාම සේවනයෙන්, මුසාවාදයෙන් වැළකුණියක් වෙයි. තවද, සුරාමේරය මත්පැන් පානයෙන් හා ප්‍රමාදයට හේතුවන දේවලින් වැළකුණියක් වෙයි. භික්ෂූණි, මෙසේ කාන්තාව සීල සම්පන්න වෙයි.\n\nභික්ෂූණි, කාන්තාව ත්‍යාග සම්පන්න වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව පහව ගිය මසුරු මල ඇති සිතින් යුක්තව ගෘහයෙහි වාසය කරයි, දන්දීමට ප්‍රිය කරන, පරිත්‍යාගශීලී, බෙදාහදා ගැනීමට කැමති සිතින් යුක්තව වාසය කරයි. භික්ෂූණි, මෙසේ කාන්තාව ත්‍යාග සම්පන්න වෙයි.\n\nභික්ෂූණි, කාන්තාව ප්‍රඥා සම්පන්න වන්නේ කෙසේද? භික්ෂූණි, මෙහිලා කාන්තාව ප්‍රඥාවන්ත වෙයි, උතුම් ආර්ය සත්‍යයන් අවබෝධ කරගෙන, දුක් කෙළවර කිරීමේ මාර්ගය දකින්නියක් වෙයි. භික්ෂූණි, මෙසේ කාන්තාව ප්‍රඥා සම්පන්න වෙයි. භික්ෂූණි, මේ සතර ධර්මයන්ගෙන් යුක්ත වූ කාන්තාව පරලොව ජයග්‍රහණය පිණිස පිළිපදින්නියක් වෙයි. පරලොව ඇයට අරඹන ලද්දක් වෙයි.\n\nහොඳින් සංවිධානය කරන ලද කටයුතු ඇත්තිය, පිරිවර රැකබලාගත්තිය,\nස්වාමියාට ප්‍රිය මනාප වන ලෙස හැසිරෙන්නිය, රැස් කරගත් දේ රකින්නිය.\n\nශ්‍රද්ධාවෙන් හා සීලයෙන් යුක්ත වූ, ත්‍යාගශීලී වූ, මසුරුකමින් තොර වූ,\nසැමවිටම පරලොව යහපත පිණිස මාර්ගය පිරිසිදු කරන්නිය.\n\nයම් ස්ත්‍රියක වෙත මේ අට ධර්මයෝ ඇත්තාහුද,\nඇය සිල්වත් යයිද, ධර්මයෙහි පිහිටියා යයිද, සත්‍යවාදී යයිද කියනු ලැබේ.\n\nෂෝඩශ ආකාරයෙන් (සියලු ආකාරයෙන්) සම්පූර්ණ වූ, අෂ්ටාංගිකව මැනවින් යුක්ත වූ,\nඑවැනි සිල්වත් උපාසිකාව ප්‍රිය මනාප වූ දෙව්ලොවක උපදී.",
      "paliTitle": "Dutiyaidhalokikasuttaṃ",
      "englishTitle": "Second Worldly Discourse",
      "sinhalaTitle": "දෙවන ඉහලෝකික සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Uposathavaggo pañcamo. Tassuddānaṃ – Saṃkhitte vitthate visākhe, vāseṭṭho bojjhāya pañcamaṃ; Anuruddhaṃ puna visākhe, nakulā idhalokikā dveti. Paṭhamapaṇṇāsakaṃ samattaṃ.",
    "english": "The Fifth Uposatha Chapter",
    "sinhala": "පස්වැනි උපෝසථ වග‍්ගය. ප්‍රථම පණ‍්ණාසකය සමාප්තයි."
  }
}