{
  "id": "an8.8",
  "title": {
    "pali": "Yamakavaggo",
    "english": "The Chapter of Pairs",
    "sinhala": "යමක වග්‍ගය"
  },
  "sections": [
    {
      "number": 71,
      "pali": "‘‘Saddho ca [saddho (syā.) ettheva. a. ni. 9.4], bhikkhave, bhikkhu hoti, no ca [no (syā.) evamuparipi ‘‘no’’tveva dissati] sīlavā. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ sīlavā cā’ti. Yato ca kho, bhikkhave, bhikkhu saddho ca hoti sīlavā ca, evaṃ so tenaṅgena paripūro hoti. ‘‘Saddho ca, bhikkhave, bhikkhu hoti sīlavā ca, no ca bahussuto. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ, sīlavā ca, bahussuto cā’ti. Yato ca kho, bhikkhave, bhikkhu saddho ca hoti sīlavā ca bahussuto ca, evaṃ so tenaṅgena paripūro hoti. ‘‘Saddho ca, bhikkhave, bhikkhu hoti sīlavā ca bahussuto ca, no ca dhammakathiko…pe… dhammakathiko ca, no ca parisāvacaro…pe… parisāvacaro ca, no ca visārado parisāya dhammaṃ deseti…pe… visārado ca parisāya dhammaṃ deseti, no ca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī…pe… catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, no ca āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseyyaṃ, catunnañca jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī assaṃ akicchalābhī akasiralābhī, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’’’nti. ‘‘Yato ca kho, bhikkhave, bhikkhu saddho ca hoti, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseti, catunnañca jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; evaṃ so tenaṅgena paripūro hoti. Imehi, kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu samantapāsādiko ca hoti sabbākāraparipūro cā’’ti. Paṭhamaṃ.",
      "english": "And, bhikkhus, if a monk is endowed with faith, but not with virtue, then he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him, thinking: ‘How may I be endowed with faith and also with virtue?’ When, however, bhikkhus, a monk is endowed with faith and also with virtue, then he is complete in that aspect.\n\nAnd, bhikkhus, if a monk is endowed with faith and virtue, but not learned, then he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him, thinking: ‘How may I be endowed with faith, and also with virtue, and also be learned?’ When, however, bhikkhus, a monk is endowed with faith, virtue, and is learned, then he is complete in that aspect.\n\nAnd, bhikkhus, if a monk is endowed with faith, virtue, and is learned, but not a Dharma teacher; or if he is a Dharma teacher, but not familiar with assemblies; or if he is familiar with assemblies, but does not confidently teach the Dharma in an assembly; or if he confidently teaches the Dharma in an assembly, but is not a ready obtainer of the four jhānas pertaining to the higher mind, providing a pleasant abiding in this very life, obtaining them easily, without difficulty, without trouble; or if he is a ready obtainer of the four jhānas pertaining to the higher mind, providing a pleasant abiding in this very life, obtaining them easily, without difficulty, without trouble, but by the destruction of the taints, does not dwell having realized for himself, with direct knowledge, in this very life, the taintless liberation of mind and liberation through wisdom; then, in this way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him, thinking: ‘How may I be endowed with faith, virtuous, learned, a Dharma teacher, familiar with assemblies, confidently teach the Dharma to an assembly, be a ready obtainer of the four jhānas pertaining to the higher mind, providing a pleasant abiding in this very life, obtaining them easily, without difficulty, without trouble, and also, by the destruction of the taints, dwell having realized for myself, with direct knowledge, in this very life, the taintless liberation of mind and liberation through wisdom?’\n\nWhen, however, bhikkhus, a monk is endowed with faith, virtue, learned, a Dharma teacher, familiar with assemblies, confidently teaches the Dharma to an assembly, is a ready obtainer of the four jhānas pertaining to the higher mind, providing a pleasant abiding in this very life, obtaining them easily, without difficulty, without trouble, and also, by the destruction of the taints, dwells having realized for himself, with direct knowledge, in this very life, the taintless liberation of mind and liberation through wisdom, then he is complete in that aspect. Endowed with these eight qualities, bhikkhus, a monk is all-around inspiring and complete in every way.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වුවද, සීලයෙන් යුක්ත නොවන්නේද, මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. ‘කෙසේ නම් මම ශ්‍රද්ධාවෙන් යුක්ත වන්නෙම්ද, සීලයෙන් ද යුක්ත වන්නෙම්දැ’යි ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුත්තේය. මහණෙනි, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද යුක්ත වේද, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වුවද, සීලයෙන් යුක්ත වුවද, බහුශ්‍රැත නොවන්නේද, මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. ‘කෙසේ නම් මම ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද යුක්ත වන්නෙම්දැ’යි ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුත්තේය. මහණෙනි, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද යුක්ත වේද, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වුවද, සීලයෙන් යුක්ත වුවද, බහුශ්‍රැත වුවද, ධර්ම කථික නොවන්නේද, මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. ‘කෙසේ නම් මම ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද යුක්ත වන්නෙම්දැ’යි ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුත්තේය. මහණෙනි, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද යුක්ත වේද, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වුවද, සීලයෙන් යුක්ත වුවද, බහුශ්‍රැත වුවද, ධර්ම කථික වුවද, පිරිස් අතර හැසිරීමට සමර්ථ නොවන්නේද, මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. ‘කෙසේ නම් මම ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද යුක්ත වන්නෙම්දැ’යි ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුත්තේය. මහණෙනි, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද යුක්ත වේද, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වුවද, සීලයෙන් යුක්ත වුවද, බහුශ්‍රැත වුවද, ධර්ම කථික වුවද, පිරිස් අතර හැසිරීමට සමර්ථ වුවද, සභා මැද නිර්භීතව ධර්මය නොදෙසන්නේද, මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. ‘කෙසේ නම් මම ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද, සභා මැද නිර්භීතව ධර්මය දෙසීමට ද යුක්ත වන්නෙම්දැ’යි ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුත්තේය. මහණෙනි, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද, සභා මැද නිර්භීතව ධර්මය දෙසීමට ද යුක්ත වේද, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වුවද, සීලයෙන් යුක්ත වුවද, බහුශ්‍රැත වුවද, ධර්ම කථික වුවද, පිරිස් අතර හැසිරීමට සමර්ථ වුවද, සභා මැද නිර්භීතව ධර්මය දෙසීමට සමර්ථ වුවද, අධිචෛතසික වූ, මේ ආත්මභාවයේදීම සුඛ විහරණ පිණිස පවතින සතර ධ්‍යාන කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව නොලබන්නේද, මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. ‘කෙසේ නම් මම ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද, සභා මැද නිර්භීතව ධර්මය දෙසීමට ද, අධිචෛතසික වූ, මේ ආත්මභාවයේදීම සුඛ විහරණ පිණිස පවතින සතර ධ්‍යාන කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලැබීමට ද යුක්ත වන්නෙම්දැ’යි ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුත්තේය. මහණෙනි, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද, සභා මැද නිර්භීතව ධර්මය දෙසීමට ද, අධිචෛතසික වූ, මේ ආත්මභාවයේදීම සුඛ විහරණ පිණිස පවතින සතර ධ්‍යාන කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලැබීමට ද යුක්ත වේද, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් ද යුක්ත වුවද, සීලයෙන් ද යුක්ත වුවද, බහුශ්‍රැත භාවයෙන් ද යුක්ත වුවද, ධර්ම කථිකත්වයෙන් ද යුක්ත වුවද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද යුක්ත වුවද, සභා මැද නිර්භීතව ධර්මය දෙසීමට ද සමර්ථ වුවද, අධිචෛතසික වූ, මේ ආත්මභාවයේදීම සුඛ විහරණ පිණිස පවතින සතර ධ්‍යාන කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලැබීමට ද යුක්ත වුවද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමාගේ උසස් ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට නොවසන්නේද, මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. ‘කෙසේ නම් මම ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද, බහුශ්‍රැත භාවයෙන් ද, ධර්ම කථිකත්වයෙන් ද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද, සභා මැද නිර්භීතව ධර්මය දෙසීමට ද, අධිචෛතසික වූ, මේ ආත්මභාවයේදීම සුඛ විහරණ පිණිස පවතින සතර ධ්‍යාන කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලැබීමට ද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමාගේ උසස් ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කිරීමට ද යුක්ත වන්නෙම්දැ’යි ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුත්තේය.\n\nමහණෙනි, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් ද යුක්ත වේද, සීලයෙන් ද යුක්ත වේද, බහුශ්‍රැත භාවයෙන් ද යුක්ත වේද, ධර්ම කථිකත්වයෙන් ද යුක්ත වේද, පිරිස් අතර හැසිරීමට සමර්ථ භාවයෙන් ද යුක්ත වේද, සභා මැද නිර්භීතව ධර්මය දෙසීමට ද සමර්ථ වේද, අධිචෛතසික වූ, මේ ආත්මභාවයේදීම සුඛ විහරණ පිණිස පවතින සතර ධ්‍යාන කැමති සේ, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලැබීමට ද යුක්ත වේද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමාගේ උසස් ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරන්නේද, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ. මහණෙනි, මේ අට අංගයන්ගෙන් යුක්ත වූ භික්ෂුව, සෑම අතින්ම ප්‍රසන්න ද වේ, සෑම අයුරින්ම පරිපූර්ණ ද වේ.",
      "paliTitle": "Paṭhamasaddhāsuttaṃ",
      "englishTitle": "The First Discourse on Faith",
      "sinhalaTitle": "පළමුවන ශ‍්‍රද්ධා සූත‍්‍රය"
    },
    {
      "number": 72,
      "pali": "‘‘Saddho ca, bhikkhave, bhikkhu hoti, no ca sīlavā. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ sīlavā cā’ti. Yato ca kho, bhikkhave, bhikkhu saddho ca hoti sīlavā ca, evaṃ so tenaṅgena paripūro hoti. ‘‘Saddho ca, bhikkhave, bhikkhu hoti sīlavā ca, no ca bahussuto…pe… bahussuto ca, no ca dhammakathiko…pe… dhammakathiko ca, no ca parisāvacaro…pe… parisāvacaro ca, no ca visārado parisāya dhammaṃ deseti …pe… visārado ca parisāya dhammaṃ deseti, no ca ye te santā vimokkhā atikkamma rūpe āruppā te kāyena phusitvā viharati…pe… ye te santā vimokkhā atikkamma rūpe āruppā te kāyena phusitvā viharati, no ca āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseyyaṃ, ye te santā vimokkhā atikkamma rūpe āruppā te kāyena phusitvā vihareyyaṃ, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’’’nti. ‘‘Yato ca kho, bhikkhave, bhikkhu saddho ca hoti, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseti. Ye te santā vimokkhā atikkamma rūpe āruppā te ca kāyena phusitvā viharati, āsavānañca khayā…pe… sacchikatvā upasampajja viharati; evaṃ so tenaṅgena paripūro hoti. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu samantapāsādiko ca hoti sabbākāraparipūro cā’’ti. Dutiyaṃ.",
      "english": "A monastic, monks, might be endowed with faith, but not with ethical conduct. In that way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him: 'How can I be endowed with both faith and ethical conduct?' When, monks, a monastic is endowed with both faith and ethical conduct, in that way he is complete in that aspect.\n\nA monastic, monks, might be endowed with faith and ethical conduct, but not be learned. In that way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him: 'How can I be endowed with faith, ethical conduct, and be learned?' When, monks, a monastic is endowed with faith, ethical conduct, and is learned, in that way he is complete in that aspect.\nA monastic, monks, might be endowed with faith, ethical conduct, and be learned, but not be a speaker of Dhamma. In that way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him: 'How can I be endowed with faith, ethical conduct, learned, and be a speaker of Dhamma?' When, monks, a monastic is endowed with faith, ethical conduct, learned, and is a speaker of Dhamma, in that way he is complete in that aspect.\nA monastic, monks, might be endowed with faith, ethical conduct, learned, and be a speaker of Dhamma, but not be one who frequents assemblies. In that way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him: 'How can I be endowed with faith, ethical conduct, learned, a speaker of Dhamma, and one who frequents assemblies?' When, monks, a monastic is endowed with faith, ethical conduct, learned, a speaker of Dhamma, and one who frequents assemblies, in that way he is complete in that aspect.\nA monastic, monks, might be endowed with faith, ethical conduct, learned, a speaker of Dhamma, and one who frequents assemblies, but not teach Dhamma in an assembly with confidence. In that way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him: 'How can I be endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, and teach Dhamma in an assembly with confidence?' When, monks, a monastic is endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, and teaches Dhamma in an assembly with confidence, in that way he is complete in that aspect.\nA monastic, monks, might be endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, and teach Dhamma in an assembly with confidence, but not dwell having personally experienced with the body those peaceful liberations that transcend form and are formless. In that way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him: 'How can I be endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, teach Dhamma in an assembly with confidence, and dwell having personally experienced with the body those peaceful liberations that transcend form and are formless?' When, monks, a monastic is endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, teaches Dhamma in an assembly with confidence, and dwells having personally experienced with the body those peaceful liberations that transcend form and are formless, in that way he is complete in that aspect.\nA monastic, monks, might be endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, teach Dhamma in an assembly with confidence, and dwell having personally experienced with the body those peaceful liberations that transcend form and are formless, but not enter and dwell in the Stainless Liberation of Mind and Liberation by Wisdom, having realized it for himself with direct knowledge in this very life, through the destruction of the taints. In that way, he is incomplete in that aspect. Therefore, that aspect should be fulfilled by him: 'How can I be endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, teach Dhamma in an assembly with confidence, dwell having personally experienced with the body those peaceful liberations that transcend form and are formless, and, through the destruction of the taints, enter and dwell in the Stainless Liberation of Mind and Liberation by Wisdom, having realized it for myself with direct knowledge in this very life?'\nWhen, monks, a monastic is endowed with faith, ethical conduct, learned, a speaker of Dhamma, one who frequents assemblies, teaches Dhamma in an assembly with confidence, dwells having personally experienced with the body those peaceful liberations that transcend form and are formless, and, through the destruction of the taints, enters and dwells in the Stainless Liberation of Mind and Liberation by Wisdom, having realized it for himself with direct knowledge in this very life, in that way he is complete in that aspect. A monastic endowed with these eight qualities, monks, is entirely delightful and perfectly complete in all respects.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවන්ත වේ නම්, නමුත් සීලවන්ත නොවේ නම්, ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. එබැවින් ඔහු ‘මා කෙසේ නම් ශ්‍රද්ධාවන්ත ද, සීලවන්ත ද වන්නෙම්දැයි’ සිතා ඒ අංගය සම්පූර්ණ කළ යුතුය. මහණෙනි, යම් කලක භික්ෂුව ශ්‍රද්ධාවන්ත ද වේ, සීලවන්ත ද වේ නම්, මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවන්ත ද, සීලවන්ත ද වේ නම්, නමුත් බහුශ්‍රැත නොවේ නම්; බහුශ්‍රැත ද වේ නම්, නමුත් ධර්ම කථික නොවේ නම්; ධර්ම කථික ද වේ නම්, නමුත් පිරිස් මැදට නොයන්නේ නම්; පිරිස් මැදට යන්නේ ද වේ නම්, නමුත් පිරිස් මැද නිර්භයව ධර්මය නොදෙසයි නම්; පිරිස් මැද නිර්භයව ධර්මය දෙසයි ද වේ නම්, නමුත් රූප ඉක්මවූ අරූප ලෝකයන්ට අයත් ඒ ශාන්ත විමෝක්ෂයන් කයින් ස්පර්ශ කොට වාසය නොකරයි නම්; රූප ඉක්මවූ අරූප ලෝකයන්ට අයත් ඒ ශාන්ත විමෝක්ෂයන් කයින් ස්පර්ශ කොට වාසය කරයි ද වේ නම්, නමුත් ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමාගේම විශිෂ්ට ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කොට වාසය නොකරයි නම්; මෙසේ ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. එබැවින් ඔහු ‘මා කෙසේ නම් ශ්‍රද්ධාවන්ත ද, සීලවන්ත ද, බහුශ්‍රැත ද, ධර්ම කථික ද, පිරිස් මැදට යන්නේ ද, පිරිස් මැද නිර්භයව ධර්මය දෙසන්නේ ද වන්නෙම්ද, රූප ඉක්මවූ අරූප ලෝකයන්ට අයත් ඒ ශාන්ත විමෝක්ෂයන් කයින් ස්පර්ශ කොට වාසය කරන්නේ ද වන්නෙම්ද, ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමාගේම විශිෂ්ට ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කොට වාසය කරන්නේ ද වන්නෙම්දැයි’ සිතා ඒ අංගය සම්පූර්ණ කළ යුතුය.\n\nමහණෙනි, යම් කලක භික්ෂුව ශ්‍රද්ධාවන්ත ද වේ, සීලවන්ත ද වේ, බහුශ්‍රැත ද වේ, ධර්ම කථික ද වේ, පිරිස් මැදට යන්නේ ද වේ, පිරිස් මැද නිර්භයව ධර්මය දෙසයි ද වේ. තවද රූප ඉක්මවූ අරූප ලෝකයන්ට අයත් ඒ ශාන්ත විමෝක්ෂයන් කයින් ස්පර්ශ කොට වාසය කරයි, ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමාගේම විශිෂ්ට ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කොට වාසය කරයි; මෙසේ ඔහු ඒ අංගයෙන් පරිපූර්ණ වේ. මහණෙනි, මේ අට වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව සර්වාකාරයෙන් ප්‍රසාද ජනක ද වේ, සියලු ආකාරයෙන් පරිපූර්ණ ද වේ.",
      "paliTitle": "Dutiyasaddhāsuttaṃ",
      "englishTitle": "The Second Discourse on Faith",
      "sinhalaTitle": "දෙවන ශ්‍රද්ධා සූත්‍රය"
    },
    {
      "number": 73,
      "pali": "Ekaṃ samayaṃ bhagavā nātike [nādike (sī. syā.), nāṭike (pī.) a. ni. 6.19] viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. Bhāvetha no tumhe, bhikkhave, maraṇassati’’nti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘ahaṃ kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu [bahuṃ (sī. pī.)] vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ divasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ upaḍḍhadivasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ upaḍḍhapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā [saṅkharitvā (ka.)] ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā [saṅkharitvā (ka.)] ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ assasitvā vā passasāmi, passasitvā vā assasāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante bhāvemi maraṇassati’’nti. Evaṃ vutte bhagavā te bhikkhū etadavoca – ‘‘yvāyaṃ [yo cāyaṃ (ka. sī.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Yo cāyaṃ [yo pāyaṃ (ka.) a. ni. 6.19 passitabbaṃ], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ divasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti; yo cāyaṃ [yo pāyaṃ (ka.) a. ni. 6.19 passitabbaṃ], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ upaḍḍhadivasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Yo cāyaṃ [yo pāyaṃ (ka.) a. ni. 6.19 passitabbaṃ], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti; yo cāyaṃ [yo pāyaṃ (ka.) a. ni. 6.19 passitabbaṃ], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ upaḍḍhapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Yo cāyaṃ [yo pāyaṃ (ka.) a. ni. 6.19 passitabbaṃ], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti – ime vuccanti, bhikkhave, ‘bhikkhū pamattā viharanti, dandhaṃ maraṇassatiṃ bhāventi āsavānaṃ khayāya’’’. ‘‘Yo ca khvāyaṃ [yo cāyaṃ (syā.), yo ca kho yaṃ (ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Yo cāyaṃ [yo pāyaṃ (ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ assasitvā vā passasāmi, passasitvā vā assasāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti – ime vuccanti, bhikkhave, ‘bhikkhū appamattā viharanti, tikkhaṃ maraṇassatiṃ bhāventi āsavānaṃ khayāya’’’. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāma, tikkhaṃ maraṇassatiṃ bhāvayissāma āsavānaṃ khayāyā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Tatiyaṃ.",
      "english": "Once, the Blessed One was dwelling in Nātika, at the Brick Hall. There, the Blessed One addressed the monks, saying, \"Monks.\"\n\n\"Venerable sir,\" those monks replied to the Blessed One. The Blessed One spoke this: \"Monks, mindfulness of death, when developed and cultivated frequently, is of great fruit, of great benefit, rooted in the Deathless, and culminates in the Deathless. Therefore, monks, develop mindfulness of death.\"\n\nWhen this was said, a certain monk said to the Blessed One, \"Venerable sir, I indeed develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for a day and night, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nAnother monk also said to the Blessed One, \"Venerable sir, I too develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for a day, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nAnother monk also said to the Blessed One, \"Venerable sir, I too develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for half a day, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nAnother monk also said to the Blessed One, \"Venerable sir, I too develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for the time it takes to eat one alms-meal, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nAnother monk also said to the Blessed One, \"Venerable sir, I too develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for the time it takes to eat half an alms-meal, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nAnother monk also said to the Blessed One, \"Venerable sir, I too develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for the time it takes to chew and swallow four or five mouthfuls, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nAnother monk also said to the Blessed One, \"Venerable sir, I too develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for the time it takes to chew and swallow one mouthful, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nAnother monk also said to the Blessed One, \"Venerable sir, I too develop mindfulness of death.\" \"How then, monk, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: ‘Oh, if only I might live for the time it takes to exhale after inhaling, or inhale after exhaling, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ It is in this way, venerable sir, that I develop mindfulness of death.\"\n\nWhen this was said, the Blessed One spoke to those monks: \"Monks, whoever among these monks develops mindfulness of death thus: ‘Oh, if only I might live for a day and night, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ And whoever, monks, among these monks develops mindfulness of death thus: ‘Oh, if only I might live for a day, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ And whoever, monks, among these monks develops mindfulness of death thus: ‘Oh, if only I might live for half a day, I would bear in mind the Dispensation of the Blessed One. Truly, much would have been done by me.’ And whoever, monks, among these monks develops mindfulness of death thus:\n\nMonks, a monk cultivates mindfulness of death in this way: \"Alas, may I live for as long as it takes to eat one alms-meal, so that I might bear in mind the Teaching of the Blessed One; truly, much would have been accomplished by me!\" And again, monks, a monk cultivates mindfulness of death in this way: \"Alas, may I live for as long as it takes to eat half an alms-meal, so that I might bear in mind the Teaching of the Blessed One; truly, much would have been accomplished by me!\" And again, monks, a monk cultivates mindfulness of death in this way: \"Alas, may I live for as long as it takes to chew and swallow four or five mouthfuls of food, so that I might bear in mind the Teaching of the Blessed One; truly, much would have been accomplished by me!\" These, monks, are called 'monks who dwell heedlessly, who cultivate mindfulness of death sluggishly for the destruction of the taints.'\n\nBut this monk, monks, cultivates mindfulness of death in this way: \"Alas, may I live for as long as it takes to chew and swallow one mouthful of food, so that I might bear in mind the Teaching of the Blessed One; truly, much would have been accomplished by me!\" And again, monks, this monk cultivates mindfulness of death in this way: \"Alas, may I live for as long as it takes to breathe in and then breathe out, or breathe out and then breathe in, so that I might bear in mind the Teaching of the Blessed One; truly, much would have been accomplished by me!\" These, monks, are called 'monks who dwell heedfully, who cultivate mindfulness of death intensely for the destruction of the taints.'\n\nTherefore, monks, this is how you should train yourselves: \"We will dwell heedfully, and we will cultivate mindfulness of death intensely for the destruction of the taints.\" Indeed, monks, this is how you must train yourselves.",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ නාතිකයේ, ගිඤ්ජකාවසථ නම් විහාරයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා, \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, මරණානුස්සතිය වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී, මහත් ඵල ඇත්තී වේ, මහත් ආනිසංස ඇත්තී වේ, අමා මහා නිවනට පමුණුවන්නී වේ, අමා මහා නිවනින් කෙළවර වන්නී වේ. මහණෙනි, නුඹලා මරණානුස්සතිය වඩව්.\"\n\nමෙසේ වදාළ කල්හි එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම නම් මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම රෑ ද දවල් ද ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nතවත් එක් භික්ෂුවක් ද භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම ද මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම දවසක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nතවත් එක් භික්ෂුවක් ද භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම ද මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම අඩ දවසක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nතවත් එක් භික්ෂුවක් ද භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම ද මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම එක් පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nතවත් එක් භික්ෂුවක් ද භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම ද මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම අඩ පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nතවත් එක් භික්ෂුවක් ද භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම ද මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම සතර පහක් කටගැස්ම කටට ගෙන ගිල දමන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nතවත් එක් භික්ෂුවක් ද භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම ද මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම එක කටගැස්මක් කටට ගෙන ගිල දමන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nතවත් එක් භික්ෂුවක් ද භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, මම ද මරණානුස්සතිය වඩමි.\" \"මහණ, එසේනම් නුඹ කෙසේද මරණානුස්සතිය වඩන්නේ?\" \"වහන්ස, මෙහිලා මට මෙසේ සිතේ: 'අහෝ, මම ආශ්වාස කර නැවත ප්‍රශ්වාස කරන තරම් කාලයක්, නැතහොත් ප්‍රශ්වාස කර නැවත ආශ්වාස කරන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇත.' වහන්ස, මම මෙසේ මරණානුස්සතිය වඩමි.\"\n\nමෙසේ වදාළ කල්හි භාග්‍යවතුන් වහන්සේ ඒ භික්ෂූන්ට මෙය වදාළ සේක: \"මහණෙනි, යම් භික්ෂුවක් 'අහෝ, මම රෑ ද දවල් ද ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද; යම් භික්ෂුවක් 'අහෝ, මම දවසක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද; යම් භික්ෂුවක් 'අහෝ, මම අඩ දවසක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද; යම් භික්ෂුවක් 'අහෝ, මම එක් පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද; යම් භික්ෂුවක් 'අහෝ, මම අඩ පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද; යම් භික්ෂුවක් 'අහෝ, මම සතර පහක් කටගැස්ම කටට ගෙන ගිල දමන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද; යම් භික්ෂුවක් 'අහෝ, මම එක කටගැස්මක් කටට ගෙන ගිල දමන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද; යම් භික්ෂුවක් 'අහෝ, මම ආශ්වාස කර නැවත ප්‍රශ්වාස කරන තරම් කාලයක්, නැතහොත් ප්‍රශ්වාස කර නැවත ආශ්වාස කරන තරම් කාලයක් ජීවත් වන්නෙම් නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතට ගන්නෙම් නම්, මට බොහෝ කුසල් රැස් කරගත හැකි වනු ඇතැ'යි මෙසේ මරණානුස්සතිය වඩන්නේ ද;\"\n\nමහණෙනි, යම් භික්ෂුවක් මෙසේ මරණානුස්සතිය වඩන්නේය: ‘අහෝ! මම එක පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත්වීමි නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතෙහි තබාගන්නෙමි, ම විසින් බොහෝ දේ කරනු ලබන්නේය.’ මහණෙනි, යම් භික්ෂුවක් මෙසේ මරණානුස්සතිය වඩන්නේය: ‘අහෝ! මම අඩ පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත්වීමි නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතෙහි තබාගන්නෙමි, ම විසින් බොහෝ දේ කරනු ලබන්නේය.’ මහණෙනි, යම් භික්ෂුවක් මෙසේ මරණානුස්සතිය වඩන්නේය: ‘අහෝ! මම සතරක් හෝ පහක් හෝ බත් කටක් සපා ගිල දමන තරම් කාලයක් ජීවත්වීමි නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතෙහි තබාගන්නෙමි, ම විසින් බොහෝ දේ කරනු ලබන්නේය.’ මහණෙනි, මොවුන් ‘ප්‍රමාදීව වාසය කරන්නාවූ, ආසවයන්ගේ ක්ෂය පිණිස මරණානුස්සතිය සෙමින් වඩන්නාවූ භික්ෂූහු’ යැයි කියනු ලැබේ.\n\nමහණෙනි, යම් භික්ෂුවක් මෙසේ මරණානුස්සතිය වඩන්නේය: ‘අහෝ! මම එක බත් කටක් සපා ගිල දමන තරම් කාලයක් ජීවත්වීමි නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතෙහි තබාගන්නෙමි, ම විසින් බොහෝ දේ කරනු ලබන්නේය.’ මහණෙනි, යම් භික්ෂුවක් මෙසේ මරණානුස්සතිය වඩන්නේය: ‘අහෝ! මම ආශ්වාස කර නැවත ප්‍රශ්වාස කරන තරම් හෝ, ප්‍රශ්වාස කර නැවත ආශ්වාස කරන තරම් හෝ කාලයක් ජීවත්වීමි නම්, භාග්‍යවතුන් වහන්සේගේ ශාසනය සිතෙහි තබාගන්නෙමි, ම විසින් බොහෝ දේ කරනු ලබන්නේය.’ මහණෙනි, මොවුන් ‘අප්‍රමාදීව වාසය කරන්නාවූ, ආසවයන්ගේ ක්ෂය පිණිස මරණානුස්සතිය තියුණු ලෙස වඩන්නාවූ භික්ෂූහු’ යැයි කියනු ලැබේ.\n\nඑබැවින්, මහණෙනි, මෙසේ හික්මිය යුතුය: ‘අප්‍රමාදීව වාසය කරන්නෙමු, ආසවයන්ගේ ක්ෂය පිණිස මරණානුස්සතිය තියුණු ලෙස වඩන්නෙමු.’ මහණෙනි, ඔබ විසින් මෙසේම හික්මිය යුතුය.",
      "paliTitle": "Paṭhamamaraṇassatisuttaṃ",
      "englishTitle": "First Discourse on Mindfulness of Death",
      "sinhalaTitle": "පළමු මරණානුස්සති සූත්‍රය"
    },
    {
      "number": 74,
      "pali": "Ekaṃ samayaṃ bhagavā nātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi …pe… maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. ‘‘Kathaṃ bhāvitā ca, bhikkhave, maraṇassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā? Idha, bhikkhave, bhikkhu divase nikkhante rattiyā patihitāya [paṭihitāya (pī.), (a. ni. 6.20 passitabbaṃ)] iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā. So mama assa [mamassa (a. ni. 6.20)] antarāyo. Upakkhalitvā vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya, semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ, manussā vā maṃ upakkameyyuṃ, amanussā vā maṃ upakkameyyuṃ; tena me assa kālakiriyā. So mama assa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā ye me assu rattiṃ kālaṃ karontassa antarāyāyā’’’ti. ‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthi me pāpakā akusalā dhammā appahīnā ye me assu rattiṃ kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘natthi me pāpakā akusalā dhammā appahīnā ye me assu rattiṃ kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu. ‘‘Idha pana, bhikkhave, bhikkhu rattiyā nikkhantāya divase patihite iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā. So mama assa antarāyo. Upakkhalitvā vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya, semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ, manussā vā maṃ upakkameyyuṃ, amanussā vā maṃ upakkameyyuṃ; tena me assa kālakiriyā. So mama assa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā ye me assu divā kālaṃ karontassa antarāyāyā’’’ti. ‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthi me pāpakā akusalā dhammā appahīnā ye me assu divā kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘natthi me pāpakā akusalā dhammā appahīnā ye me assu divā kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu. Evaṃ bhāvitā kho, bhikkhave, maraṇassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Catutthaṃ.",
      "english": "At one time the Blessed One was staying in Nātika, in the Brick House. There, the Blessed One addressed the bhikkhus, saying:\n\n\"Bhikkhus, mindfulness of death, when developed and frequently practiced, is of great fruit, of great benefit, ending in the Deathless, culminating in the Deathless.\n\n\"And how, bhikkhus, is mindfulness of death developed and frequently practiced so that it is of great fruit, of great benefit, ending in the Deathless, culminating in the Deathless? Here, bhikkhus, a bhikkhu, when the day has ended and the night has set in, reflects thus: 'Many indeed are the causes of my death. A snake might bite me, a scorpion might sting me, a centipede might bite me; thereby my death could occur. That would be an obstruction for me. Or I might stumble and fall, or the food I have eaten might disagree with me, or my bile might be agitated, or my phlegm might be agitated, or the sharp winds in my body might be agitated, or humans might attack me, or non-humans might attack me; thereby my death could occur. That would be an obstruction for me.' Then, bhikkhus, that bhikkhu should reflect thus: 'Are there any evil, unwholesome states unabandoned in me which might be an obstruction to me should I die tonight?'\"\n\n\"If, bhikkhus, while reflecting, a bhikkhu knows thus: 'There are evil, unwholesome states unabandoned in me which might be an obstruction to me should I die tonight,' then, bhikkhus, for the abandonment of those very evil, unwholesome states, extraordinary desire, effort, zeal, strenuousness, indefatigability, mindfulness, and clear comprehension should be aroused. Just as, bhikkhus, if one's clothes or head were on fire, one would arouse extraordinary desire, effort, zeal, strenuousness, indefatigability, mindfulness, and clear comprehension to extinguish those clothes or that head; even so, bhikkhus, that bhikkhu should arouse extraordinary desire, effort, zeal, strenuousness, indefatigability, mindfulness, and clear comprehension for the abandonment of those very evil, unwholesome states.\n\n\"But if, bhikkhus, while reflecting, a bhikkhu knows thus: 'There are no evil, unwholesome states unabandoned in me which might be an obstruction to me should I die tonight,' then, bhikkhus, that bhikkhu should dwell in that same joy and gladness, continuing to train in wholesome states day and night.\n\n\"Furthermore, bhikkhus, here a bhikkhu, when the night has ended and the day has set in, reflects thus: 'Many indeed are the causes of my death. A snake might bite me, a scorpion might sting me, a centipede might bite me; thereby my death could occur. That would be an obstruction for me. Or I might stumble and fall, or the food I have eaten might disagree with me, or my bile might be agitated, or my phlegm might be agitated, or the sharp winds in my body might be agitated, or humans might attack me, or non-humans might attack me; thereby my death could occur. That would be an obstruction for me.' Then, bhikkhus, that bhikkhu should reflect thus: 'Are there any evil, unwholesome states unabandoned in me which might be an obstruction to me should I die during the day?'\"\n\n\"If, bhikkhus, while reflecting, a bhikkhu knows thus: 'There are evil, unwholesome states unabandoned in me which might be an obstruction to me should I die during the day,' then, bhikkhus, for the abandonment of those very evil, unwholesome states, extraordinary desire, effort, zeal, strenuousness, indefatigability, mindfulness, and clear comprehension should be aroused. Just as, bhikkhus, if one's clothes or head were on fire, one would arouse extraordinary desire, effort, zeal, strenuousness, indefatigability, mindfulness, and clear comprehension to extinguish those clothes or that head; even so, bhikkhus, that bhikkhu should arouse extraordinary desire, effort, zeal, strenuousness, indefatigability, mindfulness, and clear comprehension for the abandonment of those very evil, unwholesome states.\n\n\"But if, bhikkhus, while reflecting, a bhikkhu knows thus: 'There are no evil, unwholesome states unabandoned in me which might be an obstruction to me should I die during the day,' then, bhikkhus, that bhikkhu should dwell in that same joy and gladness, continuing to train in wholesome states day and night.\n\n\"It is in this way, bhikkhus, that mindfulness of death, when developed and frequently practiced, is of great fruit, of great benefit, ending in the Deathless, culminating in the Deathless.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ නාතික ගම්මානයෙහි ගිඤ්ජකාවසථය නම් ගඩොල් ගෙයෙහි වැඩසිටියහ. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙය වදාළ සේක: “මහණෙනි, මරණානුස්සතිය භාවනා කරන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී මහාඵල ඇත්තක් වෙයි, මහත් ආනිසංස ඇත්තක් වෙයි, අමා මහ නිවනට ග්‍රාහක වන, අමා මහ නිවනින් කෙළවර වන ධර්මයකි.”\n\n“මහණෙනි, මරණානුස්සතිය කෙසේ වඩන ලද්දී, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දී මහාඵල ඇත්තක් වෙයිද, මහත් ආනිසංස ඇත්තක් වෙයිද, අමා මහ නිවනට ග්‍රාහක වන, අමා මහ නිවනින් කෙළවර වන ධර්මයක් වෙයිද?”\n\n“මහණෙනි, මෙහිලා භික්ෂුවක් දහවල් කාලය ගෙවී රාත්‍රිය එළඹුණු කල්හි මෙසේ මෙනෙහි කරයි: ‘මාගේ මරණයට හේතු බොහෝය. සර්පයෙක් මා දෂ්ට කරනු ඇත, නැතහොත් වෘශ්චිකයෙක් මා දෂ්ට කරනු ඇත, නැතහොත් සතපදියෙක් මා දෂ්ට කරනු ඇත; එයින් මගේ කලුරිය කිරීම සිදුවිය හැකිය. එය මට බාධාවක් වනු ඇත. නැතහොත් මම ලිස්සා වැටෙන්නට පුළුවන, මා අනුභව කළ භෝජනයෙන් රෝගයක් ඇතිවිය හැකිය, නැතහොත් මගේ පිත කුපිත විය හැකිය, නැතහොත් මගේ සෙම කුපිත විය හැකිය, නැතහොත් තීව්‍ර වාත රෝග කුපිත විය හැකිය, නැතහොත් මනුෂ්‍යයෝ මා පෙළන්නට පුළුවන, නැතහොත් අමනුෂ්‍යයෝ මා පෙළන්නට පුළුවන; එයින් මගේ කලුරිය කිරීම සිදුවිය හැකිය. එය මට බාධාවක් වනු ඇත’ යි. මහණෙනි, ඒ භික්ෂුව විසින් මෙසේ මෙනෙහි කළ යුතුයි: ‘මා රාත්‍රියේදී කලුරිය කරන්නේ නම්, මට අන්තරායක් වීමට ඉඩ ඇති, මා විසින් ප්‍රහීණ නොකරන ලද පාපී අකුසල ධර්මයන් මා තුළ ඇත්තේද’ යි.”\n\n“මහණෙනි, යම් හෙයකින් භික්ෂුවක් සිහි නුවණින් විමසමින් මෙසේ දන්නේ නම්: ‘මා රාත්‍රියේදී කලුරිය කරන්නේ නම්, මට අන්තරායක් වීමට ඉඩ ඇති, මා විසින් ප්‍රහීණ නොකරන ලද පාපී අකුසල ධර්මයන් මා තුළ ඇත්තේය’ යි, මහණෙනි, ඒ භික්ෂුව විසින් එම පාපී අකුසල ධර්මයන් ප්‍රහාණය පිණිස අතිශයින් වැඩි ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සෝළියද, නොපසුබස්නා වීරියද, සතියද, සම්පජඤ්ඤයද කළ යුතුය.”\n\n“මහණෙනි, යම්සේ ගිනිගත් වස්ත්‍රයක් ඇති හෝ ගිනිගත් හිසක් ඇති පුද්ගලයෙක් එම වස්ත්‍රය හෝ හිස නිවීම පිණිස අතිශයින් වැඩි ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සෝළියද, නොපසුබස්නා වීරියද, සතියද, සම්පජඤ්ඤයද කරන්නේද; එපරිද්දෙන්ම මහණෙනි, ඒ භික්ෂුව විසින් එම පාපී අකුසල ධර්මයන් ප්‍රහාණය පිණිස අතිශයින් වැඩි ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සෝළියද, නොපසුබස්නා වීරියද, සතියද, සම්පජඤ්ඤයද කළ යුතුය.”\n\n“මහණෙනි, යම් හෙයකින් භික්ෂුවක් සිහි නුවණින් විමසමින් මෙසේ දන්නේ නම්: ‘මා රාත්‍රියේදී කලුරිය කරන්නේ නම්, මට අන්තරායක් වීමට ඉඩ ඇති, මා විසින් ප්‍රහීණ නොකරන ලද පාපී අකුසල ධර්මයන් මා තුළ නැත්තේය’ යි, මහණෙනි, ඒ භික්ෂුව විසින් එම ප්‍රීතියෙන් හා ප්‍රමෝදයෙන්ම දිවා රෑ දෙකෙහිම කුසල ධර්මයන්හි පුහුණු වෙමින් වාසය කළ යුතුය.”\n\n“මහණෙනි, මෙහිලා භික්ෂුවක් රාත්‍රිය ගෙවී දහවල් කාලය එළඹුණු කල්හි මෙසේ මෙනෙහි කරයි: ‘මාගේ මරණයට හේතු බොහෝය. සර්පයෙක් මා දෂ්ට කරනු ඇත, නැතහොත් වෘශ්චිකයෙක් මා දෂ්ට කරනු ඇත, නැතහොත් සතපදියෙක් මා දෂ්ට කරනු ඇත; එයින් මගේ කලුරිය කිරීම සිදුවිය හැකිය. එය මට බාධාවක් වනු ඇත. නැතහොත් මම ලිස්සා වැටෙන්නට පුළුවන, මා අනුභව කළ භෝජනයෙන් රෝගයක් ඇතිවිය හැකිය, නැතහොත් මගේ පිත කුපිත විය හැකිය, නැතහොත් මගේ සෙම කුපිත විය හැකිය, නැතහොත් තීව්‍ර වාත රෝග කුපිත විය හැකිය, නැතහොත් මනුෂ්‍යයෝ මා පෙළන්නට පුළුවන, නැතහොත් අමනුෂ්‍යයෝ මා පෙළන්නට පුළුවන; එයින් මගේ කලුරිය කිරීම සිදුවිය හැකිය. එය මට බාධාවක් වනු ඇත’ යි. මහණෙනි, ඒ භික්ෂුව විසින් මෙසේ මෙනෙහි කළ යුතුයි: ‘මා දහවල් කාලයේදී කලුරිය කරන්නේ නම්, මට අන්තරායක් වීමට ඉඩ ඇති, මා විසින් ප්‍රහීණ නොකරන ලද පාපී අකුසල ධර්මයන් මා තුළ ඇත්තේද’ යි.”\n\n“මහණෙනි, යම් හෙයකින් භික්ෂුවක් සිහි නුවණින් විමසමින් මෙසේ දන්නේ නම්: ‘මා දහවල් කාලයේදී කලුරිය කරන්නේ නම්, මට අන්තරායක් වීමට ඉඩ ඇති, මා විසින් ප්‍රහීණ නොකරන ලද පාපී අකුසල ධර්මයන් මා තුළ ඇත්තේය’ යි, මහණෙනි, ඒ භික්ෂුව විසින් එම පාපී අකුසල ධර්මයන් ප්‍රහාණය පිණිස අතිශයින් වැඩි ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සෝළියද, නොපසුබස්නා වීරියද, සතියද, සම්පජඤ්ඤයද කළ යුතුය.”\n\n“මහණෙනි, යම්සේ ගිනිගත් වස්ත්‍රයක් ඇති හෝ ගිනිගත් හිසක් ඇති පුද්ගලයෙක් එම වස්ත්‍රය හෝ හිස නිවීම පිණිස අතිශයින් වැඩි ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සෝළියද, නොපසුබස්නා වීරියද, සතියද, සම්පජඤ්ඤයද කරන්නේද; එපරිද්දෙන්ම මහණෙනි, ඒ භික්ෂුව විසින් එම පාපී අකුසල ධර්මයන් ප්‍රහාණය පිණිස අතිශයින් වැඩි ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, උත්සෝළියද, නොපසුබස්නා වීරියද, සතියද, සම්පජඤ්ඤයද කළ යුතුය.”\n\n“මහණෙනි, යම් හෙයකින් භික්ෂුවක් සිහි නුවණින් විමසමින් මෙසේ දන්නේ නම්: ‘මා දහවල් කාලයේදී කලුරිය කරන්නේ නම්, මට අන්තරායක් වීමට ඉඩ ඇති, මා විසින් ප්‍රහීණ නොකරන ලද පාපී අකුසල ධර්මයන් මා තුළ නැත්තේය’ යි, මහණෙනි, ඒ භික්ෂුව විසින් එම ප්‍රීතියෙන් හා ප්‍රමෝදයෙන්ම දිවා රෑ දෙකෙහිම කුසල ධර්මයන්හි පුහුණු වෙමින් වාසය කළ යුතුය.”\n\n“මහණෙනි, මෙලෙස වඩන ලද මරණානුස්සතිය, මෙලෙස බහුල වශයෙන් පුරුදු කරන ලද්දී මහාඵල ඇත්තක් වෙයි, මහත් ආනිසංස ඇත්තක් වෙයි, අමා මහ නිවනට ග්‍රාහක වන, අමා මහ නිවනින් කෙළවර වන ධර්මයකි.”",
      "paliTitle": "Dutiyamaraṇassatisuttaṃ",
      "englishTitle": "The Second Discourse on Mindfulness of Death",
      "sinhalaTitle": "දෙවැනි මරණානුස්‍‌සති සූත්‍‌රය"
    },
    {
      "number": 75,
      "pali": "‘‘Aṭṭhimā, bhikkhave, sampadā. Katamā aṭṭha? [a. ni. 8.54] Uṭṭhānasampadā, ārakkhasampadā, kalyāṇamittatā, samajīvitā, saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā – imā kho, bhikkhave, aṭṭha sampadā’’ti. ‘‘Uṭṭhātā kammadheyyesu, appamatto vidhānavā; Samaṃ kappeti jīvikaṃ, sambhataṃ anurakkhati. ‘‘Saddho sīlena sampanno, vadaññū vītamaccharo; Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ. ‘‘Iccete aṭṭha dhammā ca, saddhassa gharamesino; Akkhātā saccanāmena, ubhayattha sukhāvahā. ‘‘Diṭṭhadhammahitatthāya, samparāyasukhāya ca; Evametaṃ gahaṭṭhānaṃ, cāgo puññaṃ pavaḍḍhatī’’ti. pañcamaṃ;",
      "english": "“Monks, there are these eight accomplishments. Which eight? The accomplishment of diligent effort, the accomplishment of protection, noble friendship, a balanced livelihood, the accomplishment of faith, the accomplishment of moral conduct, the accomplishment of generosity, and the accomplishment of wisdom – these, monks, are the eight accomplishments.”\n\nOne who is diligent in their endeavors, heedful and skillful in management, maintains a balanced livelihood, and protects what has been accumulated.\n\nFaithful and endowed with moral conduct, gracious in speech and free from stinginess, one constantly purifies the path to well-being in future existences.\n\nIndeed, these eight qualities, for a faithful householder, are rightly designated as bringing happiness in both this world and the next.\n\nFor the benefit and welfare in this present life, and for happiness in future existences – thus, for householders, generosity increases their merit.",
      "sinhala": "මහණෙනි, මේ සම්පත් අටකි. ඒ අට කවරේද යත්: උට්ඨාන සම්පදාව, ආරක‍්ෂා සම්පදාව, කල්‍යාණමිත්‍රතාව, සමාජීවිතාය, ශ්‍ර\\u200dද්‍ධා සම්පදාව, සීල සම්පදාව, ත්‍යාග සම්පදාව, ප්‍ර\\u200dඥා සම්පදාව යන මේවා යි. මහණෙනි, මේවා අට සම්පදායෝ වෙති.\n\nතමාගේ කර්මාන්තයන්හි (උපයන කටයුතුවලදී) උත්සාහවත් වූ, අප්‍ර\\u200dමාදී වූ, කටයුතු සංවිධානය කිරීමට දක‍්ෂ වූ තැනැත්තා, තම ජීවිකාව සමබරව පවත්වා ගනී. එසේ උපයාගත් ධනය ආරක‍්ෂා කරයි.\n\nශ්‍ර\\u200dද්‍ධාවෙන් හා සීලයෙන් සම්පූර්ණ වූ, ත්‍යාගශීලී වූ, මසුරුකම දුරු කළ තැනැත්තා, පරලොව සුගතිය පිණිස ඇති මාර්ගය නිරතුරුවම පිරිසිදු කරගනී.\n\nමෙසේ, ශ්‍ර\\u200dද්‍ධාවන්ත ගිහි ගෘහපතියෙකුට, සත්‍ය නාමයෙන් (සත්‍ය වූ ලෙසටම) දේශනා කරන ලද මේ ධර්ම අට, මෙලොව හා පරලොව යන දෙකෙහිම සැප සලසා දෙයි.\n\nමෙලොව යහපත පිණිසත්, පරලොව සැපය පිණිසත්, ගෘහපතියන්ගේ ත්‍යාගය මෙසේ පින වඩවයි.",
      "paliTitle": "Paṭhamasampadāsuttaṃ",
      "englishTitle": "The First Attainment Discourse",
      "sinhalaTitle": "ප්‍​රථම සම්පදා සූත්‍රය"
    },
    {
      "number": 76,
      "pali": "‘‘Aṭṭhimā, bhikkhave, sampadā. Katamā aṭṭha? Uṭṭhānasampadā, ārakkhasampadā, kalyāṇamittatā, samajīvitā, saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā. Katamā ca, bhikkhave, uṭṭhānasampadā? Idha, bhikkhave, kulaputto yena kammaṭṭhānena jīvitaṃ kappeti – yadi kasiyā yadi vaṇijjāya yadi gorakkhena yadi issattena yadi rājaporisena yadi sippaññatarena – tattha dakkho hoti analaso, tatrupāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātunti. Ayaṃ vuccati, bhikkhave, uṭṭhānasampadā. ‘‘Katamā ca, bhikkhave, ārakkhasampadā? Idha, bhikkhave, kulaputtassa bhogā honti uṭṭhānavīriyādhigatā bāhābalaparicitā sedāvakkhittā dhammikā dhammaladdhā te ārakkhena guttiyā sampādeti – ‘kinti me bhoge neva rājāno hareyyuṃ, na corā hareyyuṃ, na aggi ḍaheyya, na udakaṃ vaheyya, na appiyā dāyādā hareyyu’nti. Ayaṃ vuccati, bhikkhave, ārakkhasampadā. ‘‘Katamā ca, bhikkhave, kalyāṇamittatā? Idha, bhikkhave, kulaputto yasmiṃ gāme vā nigame vā paṭivasati, tattha ye te honti gahapatī vā gahapatiputtā vā daharā vā vuddhasīlino vuddhā vā vuddhasīlino saddhāsampannā sīlasampannā cāgasampannā paññāsampannā, tehi saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati; yathārūpānaṃ saddhāsampannānaṃ saddhāsampadaṃ anusikkhati, yathārūpānaṃ sīlasampannānaṃ sīlasampadaṃ anusikkhati, yathārūpānaṃ cāgasampannānaṃ cāgasampadaṃ anusikkhati, yathārūpānaṃ paññāsampannānaṃ paññāsampadaṃ anusikkhati. Ayaṃ vuccati, bhikkhave, kalyāṇamittatā. ‘‘Katamā ca, bhikkhave, samajīvitā? Idha, bhikkhave, kulaputto āyañca bhogānaṃ viditvā vayañca bhogānaṃ viditvā samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Seyyathāpi, bhikkhave, tulādhāro vā tulādhārantevāsī vā tulaṃ paggahetvā jānāti – ‘ettakena vā onataṃ, ettakena vā unnata’nti; evamevaṃ kho, bhikkhave, kulaputto āyañca bhogānaṃ viditvā vayañca bhogānaṃ viditvā samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Sacāyaṃ, bhikkhave, kulaputto appāyo samāno uḷāraṃ jīvikaṃ kappeti, tassa bhavanti vattāro ‘udumbarakhādī vāyaṃ kulaputto bhoge khādatī’ti. Sace panāyaṃ, bhikkhave, kulaputto mahāyo samāno kasiraṃ jīvikaṃ kappeti, tassa bhavanti vattāro – ‘ajeṭṭhamaraṇaṃ vāyaṃ kulaputto marissatī’ti. Yato ca khoyaṃ, bhikkhave, kulaputto āyañca bhogānaṃ viditvā vayañca bhogānaṃ viditvā samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Ayaṃ vuccati, bhikkhave, samajīvitā. ‘‘Katamā ca bhikkhave, saddhāsampadā? Idha, bhikkhave, kulaputto saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Ayaṃ vuccati, bhikkhave, saddhāsampadā. ‘‘Katamā ca, bhikkhave, sīlasampadā? Idha, bhikkhave, kulaputto pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṃ vuccati, bhikkhave, sīlasampadā. ‘‘Katamā ca, bhikkhave, cāgasampadā? Idha, bhikkhave, kulaputto vigatamalamaccherena cetasā agāraṃ ajjhāvasati…pe… yācayogo dānasaṃvibhāgarato. Ayaṃ vuccati, bhikkhave, cāgasampadā. ‘‘Katamā ca, bhikkhave, paññāsampadā? Idha, bhikkhave, kulaputto paññavā hoti…pe… sammā dukkhakkhayagāminiyā. Ayaṃ vuccati, bhikkhave, paññāsampadā. Imā kho, bhikkhave, aṭṭha sampadā’’ti. ‘‘Uṭṭhātā kammadheyyesu, appamatto vidhānavā; Samaṃ kappeti jīvikaṃ, sambhataṃ anurakkhati. ‘‘Saddho sīlena sampanno, vadaññū vītamaccharo; Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ. ‘‘Iccete aṭṭha dhammā ca, saddhassa gharamesino; Akkhātā saccanāmena, ubhayattha sukhāvahā. ‘‘Diṭṭhadhammahitatthāya, samparāyasukhāya ca; Evametaṃ gahaṭṭhānaṃ, cāgo puññaṃ pavaḍḍhatī’’ti. chaṭṭhaṃ;",
      "english": "Monks, there are these eight accomplishments. Which eight? They are the accomplishment of industriousness, the accomplishment of protection, noble friendship, balanced livelihood, the accomplishment of faith, the accomplishment of virtue, the accomplishment of generosity, and the accomplishment of wisdom.\n\nAnd what, monks, is the accomplishment of industriousness? Here, monks, a householder's son supports his life by whatever means of work – whether by farming, or by trade, or by cattle-keeping, or by archery, or by royal service, or by any other craft – there he is skilled and not lazy, endowed with investigative discernment into the means to accomplish it, able to do and able to manage it. This, monks, is called the accomplishment of industriousness.\n\nAnd what, monks, is the accomplishment of protection? Here, monks, a householder's son has wealth acquired by diligent effort, amassed by the strength of his arms, earned by the sweat of his brow, righteous and lawfully obtained; these he protects with care and security, thinking: ‘How might kings not confiscate my wealth, nor thieves steal it, nor fire burn it, nor floods carry it away, nor unpleasant heirs take it?’ This, monks, is called the accomplishment of protection.\n\nAnd what, monks, is noble friendship? Here, monks, a householder's son, in whatever village or town he resides, associates with, converses with, and engages in discussion with those householders or householders' sons, whether young and mature in virtue or old and mature in virtue, who are accomplished in faith, accomplished in virtue, accomplished in generosity, and accomplished in wisdom; he emulates the accomplishment of faith of those who are accomplished in faith, he emulates the accomplishment of virtue of those who are accomplished in virtue, he emulates the accomplishment of generosity of those who are accomplished in generosity, and he emulates the accomplishment of wisdom of those who are accomplished in wisdom. This, monks, is called noble friendship.\n\nAnd what, monks, is balanced livelihood? Here, monks, a householder's son, having understood his income and his expenses, maintains a balanced livelihood, neither excessively extravagant nor excessively meager, thinking: ‘In this way, my income will stand in excess of my expenses, and my expenses will not exceed my income.’ Just as, monks, a scale-bearer or his apprentice, having picked up a scale, knows: ‘By so much it is depressed, by so much it is raised’; in the same way, monks, a householder's son, having understood his income and his expenses, maintains a balanced livelihood, neither excessively extravagant nor excessively meager, thinking: ‘In this way, my income will stand in excess of my expenses, and my expenses will not exceed my income.’ If, monks, this householder's son, having little income, maintains an extravagant livelihood, then people will say of him: ‘This householder's son consumes his wealth like one eating fig-fruits’ – meaning, he squanders it without limit. But if, monks, this householder's son, having great income, maintains a meager livelihood, then people will say of him: ‘This householder's son will die like one without heirs’ – meaning, he lives a life of hardship despite his wealth, as if he had no reason to enjoy it, like someone saving for no apparent heir. But when, monks, this householder's son, having understood his income and his expenses, maintains a balanced livelihood, neither excessively extravagant nor excessively meager, thinking: ‘In this way, my income will stand in excess of my expenses, and my expenses will not exceed my income,’ this, monks, is called balanced livelihood.\n\nAnd what, monks, is the accomplishment of faith? Here, monks, a householder's son is endowed with faith, he places his faith in the Buddha’s awakening, believing: ‘Indeed, the Blessed One is an Arahant, perfectly enlightened, endowed with wisdom and conduct, sublime, knower of the worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.’ This, monks, is called the accomplishment of faith.\n\nAnd what, monks, is the accomplishment of virtue? Here, monks, a householder's son abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from intoxicating drinks and drugs which are the basis for heedlessness. This, monks, is called the accomplishment of virtue.\n\nAnd what, monks, is the accomplishment of generosity? Here, monks, a householder's son dwells at home with a mind free from the stain of stinginess, generous, open-handed, delighting in giving, responsive to requests, delighting in the distribution of gifts. This, monks, is called the accomplishment of generosity.\n\nAnd what, monks, is the accomplishment of wisdom? Here, monks, a householder's son is wise, endowed with wisdom that discerns rise and fall, noble, penetrative, leading to the right destruction of suffering. This, monks, is called the accomplishment of wisdom.\n\nThese, monks, are the eight accomplishments.\n\nOne who is diligent in his occupations, heedful and methodical;\nMaintains a balanced livelihood, and guards what he has acquired.\n\nEndowed with faith and virtue, generous and free from stinginess;\nAlways purifies the path that leads to well-being in the future life.\n\nThese eight principles, for a faithful householder,\nAre truly declared to bring happiness in both lives.\n\nFor the welfare in this present life, and for happiness in future lives;\nThus, for householders, generosity increases merit.",
      "sinhala": "භික්‍ෂූණි, මේ සම්පත් අටකි. කවර අටක් ද? එනම්, උට්ඨානසම්පදාව, ආරක්‍ෂාසම්පදාව, කල්‍යාණමිත්‍රතාවය, සමජීවිතාවය, ශ්‍රද්ධාසම්පදාව, ශීලසම්පදාව, ත්‍යාගසම්පදාව, ප්‍රඥාසම්පදාවයි.\n\nභික්‍ෂූණි, උට්ඨානසම්පදාව කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙක් ගොවිතැනින් හෝ වෙළඳාමෙන් හෝ ගවපාලනයෙන් හෝ ඊතල කර්මාන්තයෙන් හෝ රජයේ සේවයෙන් හෝ වෙනත් ශිල්පයකින් හෝ ජීවත් වේ නම්, ඔහු එම කටයුතුවල දක්‍ෂ වේ, අලස නොවේ, ඊට අනුකූල කල්පනාවලින් (ක්‍රියාමාර්ගවලින්) යුක්ත වේ, එම කටයුතු කිරීමට සමත් වේ, ඒවා මනා ලෙස සංවිධානය කිරීමට සමත් වේ. භික්‍ෂූණි, මෙය උට්ඨානසම්පදාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, ආරක්‍ෂාසම්පදාව කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙකුට තම උත්සාහය හා වීර්යය, තම බාහු බලය, දහදිය හැලීම, ධර්මානුකූල බව, සහ ධර්මානුකූල ලෙස ලබාගත් සම්පත් ඇත්නම්, ඔහු ඒ සම්පත් 'රජවරුන් විසින් මගේ සම්පත් පැහැර නොගන්නවා නම්, සොර සතුරන් විසින් පැහැර නොගන්නවා නම්, ගින්නෙන් නොදැවෙනවා නම්, ජලයෙන් ගසාගෙන නොයනවා නම්, අමිත්‍ර දායාදයන් විසින් පැහැර නොගන්නවා නම්' යනුවෙන් ආරක්‍ෂාවෙන් හා රැකවරණයෙන් යුතුව පවත්වා ගනී. භික්‍ෂූණි, මෙය ආරක්‍ෂාසම්පදාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, කල්‍යාණමිත්‍රතාවය කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙක් යම් ගමක හෝ නියම්ගමක හෝ වාසය කරයි ද, එහි යම් ගෘහපතියන් හෝ ගෘහපති පුත්‍රයන් හෝ තරුණ වුව ද වැඩිහිටි ගුණ ඇති, වැඩිහිටි වුව ද වැඩිහිටි ගුණ ඇති, ශ්‍රද්ධාවෙන් යුක්ත වූ, ශීලයෙන් යුක්ත වූ, ත්‍යාගයෙන් යුක්ත වූ, ප්‍රඥාවෙන් යුක්ත වූ පුද්ගලයෝ වෙත් ද, ඔහු ඔවුන් සමඟ ආශ්‍රය කරයි, කථා බස් කරයි, සාකච්ඡා කරයි. යම් ආකාරයකින් ශ්‍රද්ධාවෙන් යුක්ත වූවන්ගේ ශ්‍රද්ධාසම්පදාව අනුගමනය කරයි ද, යම් ආකාරයකින් ශීලයෙන් යුක්ත වූවන්ගේ ශීලසම්පදාව අනුගමනය කරයි ද, යම් ආකාරයකින් ත්‍යාගයෙන් යුක්ත වූවන්ගේ ත්‍යාගසම්පදාව අනුගමනය කරයි ද, යම් ආකාරයකින් ප්‍රඥාවෙන් යුක්ත වූවන්ගේ ප්‍රඥාසම්පදාව අනුගමනය කරයි ද, භික්‍ෂූණි, මෙය කල්‍යාණමිත්‍රතාවය යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, සමජීවිතාවය කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙක් සම්පත් ලැබීම්ද, සම්පත් වැයවීම්ද දැනගෙන, 'මාගේ ආදායම වියදම ඉක්මවා පවතින්නේය, මාගේ වියදම ආදායම ඉක්මවා නොපවතින්නේය' යනුවෙන්, අතිශයින් වියදම් නොකරමින් ද, අතිශයින් අඩු වියදම් නොකරමින් ද සමව ජීවත් වේ. භික්‍ෂූණි, යම් සේ තරාදියක් ගත් තරාදි හිමියෙක් හෝ තරාදි හිමියාගේ අතවැසියා හෝ 'මෙපමණකින් පහත් විය, මෙපමණකින් ඉහළ ගියේය' යනුවෙන් දනී ද; එපරිද්දෙන්ම භික්‍ෂූණි, කුලපුත්‍රයා සම්පත් ලැබීම්ද, සම්පත් වැයවීම්ද දැනගෙන, 'මාගේ ආදායම වියදම ඉක්මවා පවතින්නේය, මාගේ වියදම ආදායම ඉක්මවා නොපවතින්නේය' යනුවෙන්, අතිශයින් වියදම් නොකරමින් ද, අතිශයින් අඩු වියදම් නොකරමින් ද සමව ජීවත් වේ. භික්‍ෂූණි, යම් හෙයකින් මේ කුලපුත්‍රයා අඩු ආදායමක් ඇතිව මහත් පරිභෝගයෙන් යුතුව ජීවත් වේ නම්, 'මේ කුලපුත්‍රයා උදුම්බර ගෙඩි කන්නාක් මෙන් සම්පත් විනාශ කරයි' යනුවෙන් ඔහුට කියන්නෝ වෙත්. යම් හෙයකින් මේ කුලපුත්‍රයා මහත් ආදායමක් ඇතිව දුෂ්කර ලෙස ජීවත් වේ නම්, 'මේ කුලපුත්‍රයා වැඩිමහල් අභාවයකට පත් නොවී මිය යන්නේය' යනුවෙන් ඔහුට කියන්නෝ වෙත්. භික්‍ෂූණි, යම් හෙයකින් මේ කුලපුත්‍රයා සම්පත් ලැබීම්ද, සම්පත් වැයවීම්ද දැනගෙන, 'මාගේ ආදායම වියදම ඉක්මවා පවතින්නේය, මාගේ වියදම ආදායම ඉක්මවා නොපවතින්නේය' යනුවෙන්, අතිශයින් වියදම් නොකරමින් ද, අතිශයින් අඩු වියදම් නොකරමින් ද සමව ජීවත් වේ ද, භික්‍ෂූණි, මෙය සමජීවිතාවය යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, ශ්‍රද්ධාසම්පදාව කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙක් ශ්‍රද්ධාවන්ත වේ ද, 'ඒ භාග්‍යවතුන් වහන්සේ අරහං...ආදී වශයෙන් දෙවි මිනිසුන්ගේ ශාස්තෘ වූ, බුදු වූ, භාග්‍යවත් වූ සේක' යනුවෙන් තථාගතයන් වහන්සේගේ බෝධිය (පරම පවිත්‍ර ඥානය) විශ්වාස කරයි ද, භික්‍ෂූණි, මෙය ශ්‍රද්ධාසම්පදාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, ශීලසම්පදාව කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙක් ප්‍රාණඝාතයෙන් වැළකී සිටී ද... මත්පැන් පානයෙන් (මදයට හා ප්‍රමාදයට හේතුවන) වැළකී සිටී ද, භික්‍ෂූණි, මෙය ශීලසම්පදාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, ත්‍යාගසම්පදාව කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙක් පහකළ මසුරුමල සහිත සිතකින් ගිහි දිවිය ගත කරයි ද... යදින පුද්ගලයන්ට දීමට සුදුසු (දීමට සුදානම්) වේ ද, දන් බෙදා දීමට ප්‍රිය කරයි ද, භික්‍ෂූණි, මෙය ත්‍යාගසම්පදාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, ප්‍රඥාසම්පදාව කවරී ද? භික්‍ෂූණි, මෙහි යම් කුලපුත්‍රයෙක් ප්‍රඥාවන්ත වේ ද... දුක ක්ෂය කිරීම සඳහා යන මාර්ගය පිළිබඳව ඇති ප්‍රඥාවෙන් යුක්ත වේ ද, භික්‍ෂූණි, මෙය ප්‍රඥාසම්පදාව යැයි කියනු ලැබේ. භික්‍ෂූණි, මේ සම්පත් අටයි.\n\nතම කටයුතුවල උත්සාහවත් වූ, අප්‍රමාදී වූ, කල්පනාවෙන් යුක්ත වූ පුද්ගලයා,\nසමව ජීවත් වේ, රැස් කළ සම්පත් ආරක්‍ෂා කරයි.\n\nශ්‍රද්ධාවෙන් හා ශීලයෙන් යුක්ත වූ, මසුරුමල දුරු කළ, කථාවට දක්‍ෂ වූ (ත්‍යාගවන්ත වූ) පුද්ගලයා,\nසෑම විටම පරලොවට සුවදායක වන නිවනට මඟ පිරිසිදු කරයි.\n\nමෙසේ ශ්‍රද්ධාවන්ත ගෘහ ජීවිතයක් ගත කරන්නාට,\nසත්‍ය වූ නාමයෙන් කියන ලද මේ අට ධර්මයන් මෙලොව හා පරලොව යන දෙකෙහිම සුවය ගෙන දෙයි.\n\nමෙලොවට හිත පිණිසත්, පරලොවට සුව පිණිසත්,\nගිහිගෙයි වෙසෙන්නන්ගේ ත්‍යාගය හා පින මේ ආකාරයෙන් වැඩි දියුණු වේ.",
      "paliTitle": "Dutiyasampadāsuttaṃ",
      "englishTitle": "The Second Attainment Discourse",
      "sinhalaTitle": "දෙවන සම්පදා සූත්‍රය"
    },
    {
      "number": 77,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhavo’’ti! ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – [a. ni. 8.61] ‘‘Aṭṭhime, āvuso, puggalā santo saṃvijjamānā lokasmiṃ. Katame aṭṭha? Idhāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato, ghaṭato, vāyamato lābhāya lābho nuppajjati. So tena alābhena socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati, ghaṭati, vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’. ‘‘Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena majjati pamajjati pamādamāpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca, madī ca pamādī ca, cuto ca saddhammā’’’. ‘‘Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho nuppajjati. So tena alābhena socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’. ‘‘Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho uppajjati. So tena lābhena majjati pamajjati pamādamāpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati na ghaṭati na vāyamati lābhāya, lābhī ca, madī ca pamādī ca, cuto ca saddhammā’’’. ‘‘Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato, ghaṭato, vāyamato lābhāya, lābho nuppajjati. So tena alābhena na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’. ‘‘Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati, ghaṭati, vāyamati lābhāya. Tassa uṭṭhahato, ghaṭato, vāyamato lābhāya, lābho uppajjati. So tena lābhena na majjati na pamajjati na pamādamāpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, uṭṭhahati, ghaṭati, vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā’’’. ‘‘Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya, lābho nuppajjati. So tena alābhena na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’. ‘‘Idha panāvuso, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya, lābho uppajjati. So tena lābhena na majjati na pamajjati na pamādamāpajjati. Ayaṃ vuccatāvuso, ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā’. Ime kho, āvuso, aṭṭha puggalā santo saṃvijjamānā lokasmi’’nti. Sattamaṃ.",
      "english": "At that time, Venerable Sāriputta addressed the bhikkhus, \"Friends, bhikkhus!\" And those bhikkhus replied to Venerable Sāriputta, \"Friend!\" Venerable Sāriputta said this:\n\n\"Friends, these eight types of individuals exist and are found in the world. Which eight?\n\n\"Here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He strives, exerts himself, and endeavors for gain. For him, striving, exerting himself, and endeavoring for gain, no gain arises. Because of that lack of gain, he grieves, is distressed, laments, beats his breast, and falls into bewilderment. This, friends, is called a bhikkhu who dwells desiring gain, strives, exerts himself, and endeavors for gain, but does not obtain gain; he grieves and laments, and has fallen away from the True Dhamma.\n\n\"But here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He strives, exerts himself, and endeavors for gain. For him, striving, exerting himself, and endeavoring for gain, gain arises. Because of that gain, he becomes intoxicated, heedless, and falls into heedlessness. This, friends, is called a bhikkhu who dwells desiring gain, strives, exerts himself, and endeavors for gain, and is a gainer; he is one who is intoxicated and heedless, and has fallen away from the True Dhamma.\n\n\"But here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He does not strive, does not exert himself, and does not endeavor for gain. For him, not striving, not exerting himself, and not endeavoring for gain, no gain arises. Because of that lack of gain, he grieves, is distressed, laments, beats his breast, and falls into bewilderment. This, friends, is called a bhikkhu who dwells desiring gain, does not strive, does not exert himself, and does not endeavor for gain, and does not obtain gain; he grieves and laments, and has fallen away from the True Dhamma.\n\n\"But here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He does not strive, does not exert himself, and does not endeavor for gain. For him, not striving, not exerting himself, and not endeavoring for gain, gain arises. Because of that gain, he becomes intoxicated, heedless, and falls into heedlessness. This, friends, is called a bhikkhu who dwells desiring gain, does not strive, does not exert himself, and does not endeavor for gain, and is a gainer; he is one who is intoxicated and heedless, and has fallen away from the True Dhamma.\n\n\"But here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He strives, exerts himself, and endeavors for gain. For him, striving, exerting himself, and endeavoring for gain, no gain arises. Because of that lack of gain, he does not grieve, is not distressed, does not lament, does not beat his breast, and does not fall into bewilderment. This, friends, is called a bhikkhu who dwells desiring gain, strives, exerts himself, and endeavors for gain, but does not obtain gain; he neither grieves nor laments, and has not fallen away from the True Dhamma.\n\n\"But here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He strives, exerts himself, and endeavors for gain. For him, striving, exerting himself, and endeavoring for gain, gain arises. Because of that gain, he does not become intoxicated, is not heedless, and does not fall into heedlessness. This, friends, is called a bhikkhu who dwells desiring gain, strives, exerts himself, and endeavors for gain, and is a gainer; he is neither intoxicated nor heedless, and has not fallen away from the True Dhamma.\n\n\"But here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He does not strive, does not exert himself, and does not endeavor for gain. For him, not striving, not exerting himself, and not endeavoring for gain, no gain arises. Because of that lack of gain, he does not grieve, is not distressed, does not lament, does not beat his breast, and does not fall into bewilderment. This, friends, is called a bhikkhu who dwells desiring gain, does not strive, does not exert himself, and does not endeavor for gain, and does not obtain gain; he neither grieves nor laments, and has not fallen away from the True Dhamma.\n\n\"But here, friends, a bhikkhu dwelling in seclusion, living independently, develops a desire for gain. He does not strive, does not exert himself, and does not endeavor for gain. For him, not striving, not exerting himself, and not endeavoring for gain, gain arises. Because of that gain, he does not become intoxicated, is not heedless, and does not fall into heedlessness. This, friends, is called a bhikkhu who dwells desiring gain, does not strive, does not exert himself, and does not endeavor for gain, and is a gainer; he is neither intoxicated nor heedless, and has not fallen away from the True Dhamma.\n\n\"These, friends, are the eight types of individuals who exist and are found in the world.\"",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා, \"ඇවැත්නි භික්ෂූනි!\" යි වදාළහ. \"ඇවැත්නි!\" යි ඒ භික්ෂූහු ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මෙය වදාළහ: \"ඇවැත්නි, මේ ලෝකයෙහි පවත්නා වූ, සම්පූර්ණයෙන් ම විද්‍යමාන වන පුද්ගලයෝ අට දෙනෙක් වෙති. ඒ අට දෙනා කවරහු ද?\n\nඇවැත්නි, මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි. එසේ ලාභ සඳහා උත්සාහ කරන, වෙහෙස වන, වෑයම් කරන ඔහුට ලාභ නොලැබේ. හෙතෙම ඒ අලාභය නිසා ශෝක කරයි, වෙහෙසට පත්වෙයි, වැලපෙයි, පපුවට තළමින් හඬයි, මුළා බවට පත්වෙයි. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි, එහෙත් ලාභ නොලබයි, ශෝකයෙන් හා වැලපීමෙන් යුක්ත වෙයි, සද්ධර්මයෙන් පිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, තවද මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි. එසේ ලාභ සඳහා උත්සාහ කරන, වෙහෙස වන, වෑයම් කරන ඔහුට ලාභ ලැබේ. හෙතෙම ඒ ලාභය නිසා උඩඟු වෙයි, ප්‍රමාදයට පත් වෙයි, උදාසීන බවට පත්වෙයි. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි, ලාභ ලබන්නෙකි, උඩඟු බවින් හා ප්‍රමාදයෙන් යුක්ත වෙයි, සද්ධර්මයෙන් පිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, තවද මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි. එසේ ලාභ සඳහා උත්සාහ නොකරන, වෙහෙස නොවන, වෑයම් නොකරන ඔහුට ලාභ නොලැබේ. හෙතෙම ඒ අලාභය නිසා ශෝක කරයි, වෙහෙසට පත්වෙයි, වැලපෙයි, පපුවට තළමින් හඬයි, මුළා බවට පත්වෙයි. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි, එහෙත් ලාභ නොලබයි, ශෝකයෙන් හා වැලපීමෙන් යුක්ත වෙයි, සද්ධර්මයෙන් පිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, තවද මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි. එසේ ලාභ සඳහා උත්සාහ නොකරන, වෙහෙස නොවන, වෑයම් නොකරන ඔහුට ලාභ ලැබේ. හෙතෙම ඒ ලාභය නිසා උඩඟු වෙයි, ප්‍රමාදයට පත් වෙයි, උදාසීන බවට පත්වෙයි. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි, ලාභ ලබන්නෙකි, උඩඟු බවින් හා ප්‍රමාදයෙන් යුක්ත වෙයි, සද්ධර්මයෙන් පිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, තවද මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි. එසේ ලාභ සඳහා උත්සාහ කරන, වෙහෙස වන, වෑයම් කරන ඔහුට ලාභ නොලැබේ. හෙතෙම ඒ අලාභය නිසා ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැලපෙයි, පපුවට තළමින් නොහඬයි, මුළා බවට පත් නොවේ. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි, එහෙත් ලාභ නොලබයි, ශෝකයෙන් හෝ වැලපීමෙන් යුක්ත නොවෙයි, සද්ධර්මයෙන් නොපිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, තවද මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි. එසේ ලාභ සඳහා උත්සාහ කරන, වෙහෙස වන, වෑයම් කරන ඔහුට ලාභ ලැබේ. හෙතෙම ඒ ලාභය නිසා උඩඟු නොවේ, ප්‍රමාදයට පත් නොවේ, උදාසීන බවට පත් නොවේ. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ කරයි, වෙහෙස වෙයි, වෑයම් කරයි, ලාභ ලබන්නෙකි, උඩඟු බවින් හෝ ප්‍රමාදයෙන් යුක්ත නොවෙයි, සද්ධර්මයෙන් නොපිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, තවද මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි. එසේ ලාභ සඳහා උත්සාහ නොකරන, වෙහෙස නොවන, වෑයම් නොකරන ඔහුට ලාභ නොලැබේ. හෙතෙම ඒ අලාභය නිසා ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැලපෙයි, පපුවට තළමින් නොහඬයි, මුළා බවට පත් නොවේ. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි, එහෙත් ලාභ නොලබයි, ශෝකයෙන් හෝ වැලපීමෙන් යුක්ත නොවෙයි, සද්ධර්මයෙන් නොපිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, තවද මෙහිලා යම් භික්ෂුවක් විවේකීව, අන්‍යයන් මත යැපීමකින් තොරව වාසය කරන කල්හි, ලාභ සඳහා ආශාවක් උපදී. හෙතෙම ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි. එසේ ලාභ සඳහා උත්සාහ නොකරන, වෙහෙස නොවන, වෑයම් නොකරන ඔහුට ලාභ ලැබේ. හෙතෙම ඒ ලාභය නිසා උඩඟු නොවේ, ප්‍රමාදයට පත් නොවේ, උදාසීන බවට පත් නොවේ. ඇවැත්නි, මේ භික්ෂුව \"ලාභ සඳහා කැමැත්තෙන් වාසය කරයි, ලාභ සඳහා උත්සාහ නොකරයි, වෙහෙස නොවෙයි, වෑයම් නොකරයි, ලාභ ලබන්නෙකි, උඩඟු බවින් හෝ ප්‍රමාදයෙන් යුක්ත නොවෙයි, සද්ධර්මයෙන් නොපිරිහී ගිය අයෙකි\" යැයි කියනු ලැබේ.\n\nඇවැත්නි, මේ ලෝකයෙහි පවත්නා වූ, සම්පූර්ණයෙන් ම විද්‍යමාන වන පුද්ගලයෝ අට දෙනා වෙති.",
      "paliTitle": "Icchāsuttaṃ",
      "englishTitle": "Discourse on Desire",
      "sinhalaTitle": "ඉච‍්ඡා සූත‍්‍රය"
    },
    {
      "number": 78,
      "pali": "[a. ni. 8.62] Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… chahāvuso, dhammehi samannāgato bhikkhu alaṃ attano, alaṃ paresaṃ. Katamehi chahi? Idhāvuso, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, āvuso, chahi dhammehi samannāgato bhikkhu alaṃ attano, alaṃ paresaṃ. ‘‘Pañcahāvuso, dhammehi samannāgato bhikkhu alaṃ attano, alaṃ paresaṃ. Katamehi pañcahi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti…pe… sandassako ca hoti…pe… sabrahmacārīnaṃ. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṃ attano, alaṃ paresaṃ. ‘‘Catūhāvuso, dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. Katamehi catūhi? Idhāvuso, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti…pe… no ca sandassako hoti…pe… sabrahmacārīnaṃ. Imehi kho, āvuso, catūhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. ‘‘Catūhāvuso, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi catūhi? Idhāvuso, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti…pe… sandassako ca hoti…pe… sabrahmacārīnaṃ. Imehi kho, āvuso, catūhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. ‘‘Tīhāvuso, dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. Katamehi tīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti…pe… no ca sandassako hoti…pe… sabrahmacārīnaṃ. Imehi kho, āvuso, tīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. ‘‘Tīhāvuso, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi tīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti…pe… atthassa viññāpaniyā, sandassako ca hoti…pe… sabrahmacārīnaṃ. Imehi kho, āvuso, tīhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. ‘‘Dvīhāvuso, dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. Katamehi dvīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti…pe… no ca sandassako hoti…pe… sabrahmacārīnaṃ. Imehi kho, āvuso, dvīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. ‘‘Dvīhāvuso, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi dvīhi? Idhāvuso, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, āvuso, dvīhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano’’ti. Aṭṭhamaṃ.",
      "english": "Then, the Venerable Sāriputta addressed the bhikkhus, saying: “Friends, a bhikkhu endowed with six qualities is capable for himself and capable for others. Which six? Here, friends, a bhikkhu is quick to grasp wholesome states; he is naturally capable of retaining the teachings he has heard; he is an examiner of the meaning of the teachings he has retained; having understood the meaning and understood the teaching, he practices in accordance with the teaching and its sub-teachings; he has excellent speech and an excellent voice, endowed with a cultured, clear, unhesitant, and meaningful voice; and he is an instructor, an inspirer, an encourager, and an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these six qualities is capable for himself and capable for others.\n\n“Friends, a bhikkhu endowed with five qualities is capable for himself and capable for others. Which five? Here, friends, a bhikkhu is not quick to grasp wholesome states; yet he is naturally capable of retaining the teachings he has heard; he is an examiner of the meaning of the teachings he has retained; having understood the meaning and understood the teaching, he practices in accordance with the teaching and its sub-teachings; he has excellent speech and an excellent voice, endowed with a cultured, clear, unhesitant, and meaningful voice; and he is an instructor, an inspirer, an encourager, and an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these five qualities is capable for himself and capable for others.\n\n“Friends, a bhikkhu endowed with four qualities is capable for himself, but not capable for others. Which four? Here, friends, a bhikkhu is quick to grasp wholesome states; he is naturally capable of retaining the teachings he has heard; he is an examiner of the meaning of the teachings he has retained; having understood the meaning and understood the teaching, he practices in accordance with the teaching and its sub-teachings; but he does not have excellent speech nor an excellent voice, nor is he endowed with a cultured, clear, unhesitant, and meaningful voice; nor is he an instructor, an inspirer, an encourager, or an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these four qualities is capable for himself, but not capable for others.\n\n“Friends, a bhikkhu endowed with four qualities is capable for others, but not capable for himself. Which four? Here, friends, a bhikkhu is quick to grasp wholesome states; he is naturally capable of retaining the teachings he has heard; but he is not an examiner of the meaning of the teachings he has retained, nor, having understood the meaning and understood the teaching, does he practice in accordance with the teaching and its sub-teachings; yet he has excellent speech and an excellent voice, endowed with a cultured, clear, unhesitant, and meaningful voice; and he is an instructor, an inspirer, an encourager, and an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these four qualities is capable for others, but not capable for himself.\n\n“Friends, a bhikkhu endowed with three qualities is capable for himself, but not capable for others. Which three? Here, friends, a bhikkhu is not quick to grasp wholesome states; yet he is naturally capable of retaining the teachings he has heard; he is an examiner of the meaning of the teachings he has retained; having understood the meaning and understood the teaching, he practices in accordance with the teaching and its sub-teachings; but he does not have excellent speech nor an excellent voice, nor is he endowed with a cultured, clear, unhesitant, and meaningful voice; nor is he an instructor, an inspirer, an encourager, or an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these three qualities is capable for himself, but not capable for others.\n\n“Friends, a bhikkhu endowed with three qualities is capable for others, but not capable for himself. Which three? Here, friends, a bhikkhu is not quick to grasp wholesome states; yet he is naturally capable of retaining the teachings he has heard; but he is not an examiner of the meaning of the teachings he has retained, nor, having understood the meaning and understood the teaching, does he practice in accordance with the teaching and its sub-teachings; yet he has excellent speech and an excellent voice, endowed with a cultured, clear, unhesitant, and meaningful voice; and he is an instructor, an inspirer, an encourager, and an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these three qualities is capable for others, but not capable for himself.\n\n“Friends, a bhikkhu endowed with two qualities is capable for himself, but not capable for others. Which two? Here, friends, a bhikkhu is not quick to grasp wholesome states, nor is he naturally capable of retaining the teachings he has heard; yet he is an examiner of the meaning of the teachings he has retained; having understood the meaning and understood the teaching, he practices in accordance with the teaching and its sub-teachings; but he does not have excellent speech nor an excellent voice, nor is he endowed with a cultured, clear, unhesitant, and meaningful voice; nor is he an instructor, an inspirer, an encourager, or an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these two qualities is capable for himself, but not capable for others.\n\n“Friends, a bhikkhu endowed with two qualities is capable for others, but not capable for himself. Which two? Here, friends, a bhikkhu is not quick to grasp wholesome states, nor is he naturally capable of retaining the teachings he has heard, nor is he an examiner of the meaning of the teachings he has retained, nor, having understood the meaning and understood the teaching, does he practice in accordance with the teaching and its sub-teachings; yet he has excellent speech and an excellent voice, endowed with a cultured, clear, unhesitant, and meaningful voice; and he is an instructor, an inspirer, an encourager, and an uplifter for his fellow practitioners. Friends, a bhikkhu endowed with these two qualities is capable for others, but not capable for himself.”",
      "sinhala": "එහිදී පින්වත් ශාරීපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කළ සේක.\n\n\"ආයුෂ්මත්නි, සය වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුවක් තමාටද ප්‍රමාණවත් වේ, අනුන්ටද ප්‍රමාණවත් වේ. කවර සය වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් වේ; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වේ; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් වේ; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් වේ; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත වේ; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් වේ. ආයුෂ්මත්නි, මේ සය වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ටද ප්‍රමාණවත් වේ.\"\n\n\"ආයුෂ්මත්නි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ටද ප්‍රමාණවත් වේ. කවර පස් වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් නොවෙයි; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වේ; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් වේ; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් වේ; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත වේ; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් වේ. ආයුෂ්මත්නි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ටද ප්‍රමාණවත් වේ.\"\n\n\"ආයුෂ්මත්නි, සතර වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ට ප්‍රමාණවත් නොවෙයි. කවර සතර වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් වේ; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වේ; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් වේ; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් වේ; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත නොවෙයි; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් නොවෙයි. ආයුෂ්මත්නි, මේ සතර වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ට ප්‍රමාණවත් නොවෙයි.\"\n\n\"ආයුෂ්මත්නි, සතර වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව අනුන්ට ප්‍රමාණවත් වේ, තමාට ප්‍රමාණවත් නොවෙයි. කවර සතර වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් වේ; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වේ; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් නොවෙයි; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් නොවෙයි; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත වේ; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් වේ. ආයුෂ්මත්නි, මේ සතර වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව අනුන්ට ප්‍රමාණවත් වේ, තමාට ප්‍රමාණවත් නොවෙයි.\"\n\n\"ආයුෂ්මත්නි, තුන් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ට ප්‍රමාණවත් නොවෙයි. කවර තුන් වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් නොවෙයි; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වේ; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් වේ; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් වේ; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත නොවෙයි; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් නොවෙයි. ආයුෂ්මත්නි, මේ තුන් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ට ප්‍රමාණවත් නොවෙයි.\"\n\n\"ආයුෂ්මත්නි, තුන් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව අනුන්ට ප්‍රමාණවත් වේ, තමාට ප්‍රමාණවත් නොවෙයි. කවර තුන් වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් නොවෙයි; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වේ; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් නොවෙයි; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් නොවෙයි; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත වේ; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් වේ. ආයුෂ්මත්නි, මේ තුන් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව අනුන්ට ප්‍රමාණවත් වේ, තමාට ප්‍රමාණවත් නොවෙයි.\"\n\n\"ආයුෂ්මත්නි, දෙ වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ට ප්‍රමාණවත් නොවෙයි. කවර දෙ වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් නොවෙයි; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත නොවෙයි; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් වේ; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් වේ; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත නොවෙයි; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් නොවෙයි. ආයුෂ්මත්නි, මේ දෙ වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව තමාටද ප්‍රමාණවත් වේ, අනුන්ට ප්‍රමාණවත් නොවෙයි.\"\n\n\"ආයුෂ්මත්නි, දෙ වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව අනුන්ට ප්‍රමාණවත් වේ, තමාට ප්‍රමාණවත් නොවෙයි. කවර දෙ වැදෑරුම් ධර්මයන්ගෙන් ද? ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කුසල ධර්මයන් පිළිබඳව ඉක්මනින් අවබෝධ කරගැනීමේ හැකියාව ඇත්තෙක් නොවෙයි; සවන් දුන් ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත නොවෙයි; ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නෙක් නොවෙයි; අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා ක්‍රියා කරන්නෙක් නොවෙයි; මනා වචන ඇති, මනා ප්‍රකාශන ශක්තියක් ඇති, පැහැදිලි, නොපැකිළෙන, අර්ථය දැනවිය හැකි, සංස්කෘතික වූ කතාවෙන් යුක්ත වේ; සබ්‍රහ්මචාරීන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උද්‍යෝගිමත් කරවන්නෙක්, සතුටු කරවන්නෙක් වේ. ආයුෂ්මත්නි, මේ දෙ වැදෑරුම් ධර්මයන්ගෙන් යුක්ත භික්ෂුව අනුන්ට ප්‍රමාණවත් වේ, තමාට ප්‍රමාණවත් නොවෙයි.\"",
      "paliTitle": "Alaṃsuttaṃ",
      "englishTitle": "The Discourse on Sufficiency",
      "sinhalaTitle": "අලං සූත්‍රය"
    },
    {
      "number": 79,
      "pali": "‘‘Aṭṭhime, bhikkhave, dhammā sekhassa bhikkhuno parihānāya saṃvattanti. Katame aṭṭha? Kammārāmatā, bhassārāmatā, niddārāmatā, saṅgaṇikārāmatā, indriyesu aguttadvāratā, bhojane amattaññutā, saṃsaggārāmatā, papañcārāmatā – ime kho, bhikkhave, aṭṭha dhammā sekhassa bhikkhuno parihānāya saṃvattanti. ‘‘Aṭṭhime, bhikkhave, dhammā sekhassa bhikkhuno aparihānāya saṃvattanti. Katame aṭṭha? Na kammārāmatā, na bhassārāmatā, na niddārāmatā, na saṅgaṇikārāmatā, indriyesu guttadvāratā, bhojane mattaññutā, asaṃsaggārāmatā, nippapañcārāmatā – ime kho, bhikkhave, aṭṭha dhammā sekhassa bhikkhuno aparihānāya saṃvattantī’’ti. Navamaṃ.",
      "english": "Monastics, these eight qualities lead to the decline of a monastic under training. Which eight? Delight in excessive activity, delight in idle chatter, delight in excessive sleep, delight in company, unguardedness of the sense doors, immoderation in food, delight in association, and delight in mental proliferation—these eight qualities, monastics, lead to the decline of a monastic under training.\n\nMonastics, these eight qualities lead to the non-decline of a monastic under training. Which eight? Non-delight in excessive activity, non-delight in idle chatter, non-delight in excessive sleep, non-delight in company, guardedness of the sense doors, moderation in food, non-delight in association, and non-delight in mental proliferation—these eight qualities, monastics, lead to the non-decline of a monastic under training.",
      "sinhala": "මහණෙනි, මේ ධර්‍ම අටක් ශෛක්‍ෂ භික්‍ෂුවගේ පිරිහීම පිණිස පවතී. ඒ අට කවරේද? කටයුතුවලට ඇලීම, විකාථාවට ඇලීම, නිදාගැනීමට ඇලීම, ගැවසීමට ඇලීම, ඉන්ද්‍රියයන්හි අරක්‍ෂිත ද්වාර භාවය, භෝජනයෙහි පමණ නොදැනීම, මිශ්‍රවීමට ඇලීම, පපඤ්චයට ඇලීම – මහණෙනි, මේ ධර්‍ම අට ශෛක්‍ෂ භික්‍ෂුවගේ පිරිහීම පිණිස පවතී.\n\nමහණෙනි, මේ ධර්‍ම අටක් ශෛක්‍ෂ භික්‍ෂුවගේ නොපිරිහීම පිණිස පවතී. ඒ අට කවරේද? කටයුතුවලට නොඇලීම, විකාථාවට නොඇලීම, නිදාගැනීමට නොඇලීම, ගැවසීමට නොඇලීම, ඉන්ද්‍රියයන්හි ආරක්‍ෂිත ද්වාර භාවය, භෝජනයෙහි පමණ දැනීම, මිශ්‍රවීමට නොඇලීම, පපඤ්චයට නොඇලීම – මහණෙනි, මේ ධර්‍ම අට ශෛක්‍ෂ භික්‍ෂුවගේ නොපිරිහීම පිණිස පවතී.",
      "paliTitle": "Parihānasuttaṃ",
      "englishTitle": "Discourse on Decline",
      "sinhalaTitle": "පරිහානි සූත්‍රය"
    },
    {
      "number": 80,
      "pali": "[di. ni. 3.334, 358] ‘‘Aṭṭhimāni, bhikkhave, kusītavatthūni. Katamāni aṭṭha? Idha, bhikkhave, bhikkhunā kammaṃ kattabbaṃ hoti. Tassa evaṃ hoti – ‘kammaṃ kho me kattabbaṃ bhavissati. Kammaṃ kho pana me karontassa kāyo kilamissati. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ, bhikkhave, paṭhamaṃ kusītavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhunā kammaṃ kataṃ hoti. Tassa evaṃ hoti – ‘ahaṃ kho kammaṃ akāsiṃ. Kammaṃ kho pana me karontassa kāyo kilanto. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ, bhikkhave, dutiyaṃ kusītavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhunā maggo gantabbo hoti. Tassa evaṃ hoti – ‘maggo me gantabbo bhavissati. Maggaṃ kho pana me gacchantassa kāyo kilamissati. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ, bhikkhave, tatiyaṃ kusītavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhunā maggo gato hoti. Tassa evaṃ hoti – ‘ahaṃ kho maggaṃ agamāsiṃ. Maggaṃ kho pana me gacchantassa kāyo kilanto. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ bhikkhave, catutthaṃ kusītavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto na labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ‘ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto nālatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa me kāyo kilanto akammañño. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati…pe… idaṃ, bhikkhave, pañcamaṃ kusītavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ‘ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto alatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa me kāyo garuko akammañño māsācitaṃ maññe. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati…pe… idaṃ, bhikkhave, chaṭṭhaṃ kusītavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno uppanno hoti appamattako ābādho. Tassa evaṃ hoti – ‘uppanno kho me ayaṃ appamattako ābādho atthi kappo nipajjituṃ. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati…pe… idaṃ, bhikkhave, sattamaṃ kusītavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu gilānā vuṭṭhito [a. ni. 6.16 suttavaṇṇanā ṭīkā oloketabbā] hoti aciravuṭṭhito gelaññā. Tassa evaṃ hoti – ‘ahaṃ kho gilānā vuṭṭhito aciravuṭṭhito gelaññā. Tassa me kāyo dubbalo akammañño. Handāhaṃ nipajjāmī’ti. So nipajjati, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ, bhikkhave, aṭṭhamaṃ kusītavatthu. Imāni kho, bhikkhave, aṭṭha kusītavatthūni. [dī. ni. 3.335, 358] ‘‘Aṭṭhimāni, bhikkhave, ārambhavatthūni. Katamāni aṭṭha? Idha, bhikkhave, bhikkhunā kammaṃ kattabbaṃ hoti. Tassa evaṃ hoti – ‘kammaṃ kho me kattabbaṃ bhavissati. Kammaṃ kho mayā karontena na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ. Handāhaṃ paṭikacceva vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. So vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ, bhikkhave, paṭhamaṃ ārambhavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhunā kammaṃ kataṃ hoti. Tassa evaṃ hoti – ‘ahaṃ kho kammaṃ akāsiṃ. Kammaṃ kho panāhaṃ karonto nāsakkhiṃ buddhānaṃ sāsanaṃ manasi kātuṃ. Handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. So vīriyaṃ ārabhati. Idaṃ, bhikkhave, dutiyaṃ ārambhavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhunā maggo gantabbo hoti. Tassa evaṃ hoti – maggo kho me gantabbo bhavissati. Maggaṃ kho pana me gacchantena na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ. Handāhaṃ vīriyaṃ…pe… idaṃ, bhikkhave, tatiyaṃ ārambhavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhunā maggo gato hoti. Tassa evaṃ hoti – ahaṃ kho maggaṃ agamāsiṃ. Maggaṃ kho panāhaṃ gacchanto nāsakkhiṃ buddhānaṃ sāsanaṃ manasi kātuṃ. Handāhaṃ vīriyaṃ ārabhāmi…pe… idaṃ, bhikkhave, catutthaṃ ārambhavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto na labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto nālatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa me kāyo lahuko kammañño. Handāhaṃ vīriyaṃ ārabhāmi…pe… idaṃ, bhikkhave, pañcamaṃ ārambhavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto alatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa me kāyo balavā kammañño. Handāhaṃ vīriyaṃ ārabhāmi…pe… idaṃ, bhikkhave, chaṭṭhaṃ ārambhavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno uppanno hoti appamattako ābādho. Tassa evaṃ hoti – uppanno kho me ayaṃ appamattako ābādho. Ṭhānaṃ kho panetaṃ vijjati yaṃ me ābādho pavaḍḍheyya. Handāhaṃ paṭikacceva vīriyaṃ ārabhāmi…pe… idaṃ, bhikkhave, sattamaṃ ārambhavatthu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu gilānā vuṭṭhito hoti aciravuṭṭhito gelaññā. Tassa evaṃ hoti – ‘ahaṃ kho gilānā vuṭṭhito aciravuṭṭhito gelaññā. Ṭhānaṃ kho panetaṃ vijjati yaṃ me ābādho paccudāvatteyya. Handāhaṃ paṭikacceva vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. So vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ, bhikkhave, aṭṭhamaṃ ārambhavatthu. Imāni kho, bhikkhave, aṭṭha ārambhavatthūnī’’ti. Dasamaṃ. ",
      "english": "Monks, there are these eight grounds for idleness. Which eight? Here, monks, a monk has a task to perform. He thinks: ‘I will have this task to perform. While I am performing this task, my body will become weary. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the first ground for idleness.\n\nAgain, monks, a monk has performed a task. He thinks: ‘I have performed a task. While I was performing this task, my body became weary. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the second ground for idleness.\n\nAgain, monks, a monk has a journey to undertake. He thinks: ‘I will have this journey to undertake. While I am undertaking this journey, my body will become weary. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the third ground for idleness.\n\nAgain, monks, a monk has completed a journey. He thinks: ‘I have completed a journey. While I was undertaking this journey, my body became weary. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the fourth ground for idleness.\n\nAgain, monks, a monk, having wandered for alms in a village or a town, does not obtain sufficient coarse or fine food. He thinks: ‘I wandered for alms in a village or a town but did not obtain sufficient coarse or fine food. My body is weary and unfit for work. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the fifth ground for idleness.\n\nAgain, monks, a monk, having wandered for alms in a village or a town, obtains sufficient coarse or fine food. He thinks: ‘I wandered for alms in a village or a town and obtained sufficient coarse or fine food. My body feels heavy and unfit for work, as if I've eaten too much. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the sixth ground for idleness.\n\nAgain, monks, a monk has a slight illness arisen. He thinks: ‘This slight illness has arisen in me; it is proper to lie down. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the seventh ground for idleness.\n\nAgain, monks, a monk has recently recovered from an illness, having just arisen from his sickness. He thinks: ‘I have recovered from an illness, having just arisen from my sickness. My body is weak and unfit for work. Let me lie down now.’ So he lies down; he does not arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the eighth ground for idleness. These, monks, are the eight grounds for idleness.\n\nMonks, there are these eight grounds for arousing energy. Which eight? Here, monks, a monk has a task to perform. He thinks: ‘I will have this task to perform. While I am performing this task, it will not be easy to attend to the Teaching of the Buddhas. Let me, therefore, arouse energy in advance for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized.’ So he arouses energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the first ground for arousing energy.\n\nAgain, monks, a monk has performed a task. He thinks: ‘I have performed a task. While I was performing this task, I was unable to attend to the Teaching of the Buddhas. Let me, therefore, arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized.’ So he arouses energy. This, monks, is the second ground for arousing energy.\n\nAgain, monks, a monk has a journey to undertake. He thinks: ‘I will have this journey to undertake. While I am undertaking this journey, it will not be easy to attend to the Teaching of the Buddhas. Let me, therefore, arouse energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized.’ So he arouses energy for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, for the realization of the as-yet-unrealized. This, monks, is the third ground for arousing energy.\n\nAgain, moreover, monks, a monk has completed a journey. It occurs to him thus: \"Indeed, I have completed a journey. But while I was on the journey, I was unable to apply my mind to the teaching of the Buddhas. Come now, I will arouse energy...\" Monks, this is the fourth ground for arousing energy.\n\nAgain, moreover, monks, a monk, while wandering for alms in a village or town, does not obtain a sufficient quantity of food, whether coarse or refined. It occurs to him thus: \"Indeed, while wandering for alms in a village or town, I did not obtain a sufficient quantity of food, whether coarse or refined. My body is light and pliable, fit for spiritual exertion. Come now, I will arouse energy...\" Monks, this is the fifth ground for arousing energy.\n\nAgain, moreover, monks, a monk, while wandering for alms in a village or town, obtains a sufficient quantity of food, whether coarse or refined. It occurs to him thus: \"Indeed, while wandering for alms in a village or town, I obtained a sufficient quantity of food, whether coarse or refined. My body is strong and pliable, fit for spiritual exertion. Come now, I will arouse energy...\" Monks, this is the sixth ground for arousing energy.\n\nAgain, moreover, monks, a monk has a minor illness arisen. It occurs to him thus: \"Indeed, this minor illness has arisen in me. But it is possible that my illness might grow worse. Come now, I will arouse energy while there is still time...\" Monks, this is the seventh ground for arousing energy.\n\nAgain, moreover, monks, a monk has recently recovered from an illness, having just arisen from sickness. It occurs to him thus: \"Indeed, I have recovered from an illness, having just arisen from sickness. It is possible that my illness might recur. Come now, I will arouse energy while there is still time, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, for the direct experience of what has not yet been directly experienced.\" He arouses energy for the attainment of what has not yet been attained, for the realization of what has not yet been realized, for the direct experience of what has not yet been directly experienced. Monks, this is the eighth ground for arousing energy.\n\nMonks, these are the eight grounds for arousing energy.",
      "sinhala": "මහණෙනි, මේ අලසකමට හේතු වන කරුණු අටක් ඇත. ඒ අට කවරේද? මහණෙනි, මෙහිලා භික්ෂුවකට යම් කාර්යයක් කිරීමට තිබේ. ඔහුට මෙසේ සිතේ – ‘මට යම් කාර්යයක් කිරීමට තිබේ. ඒ කාර්යය කරන විට මාගේ ශරීරය වෙහෙසට පත් වනු ඇත. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය පළමුවන අලසකමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, භික්ෂුවක් විසින් යම් කාර්යයක් කර අවසන් වී ඇත. ඔහුට මෙසේ සිතේ – ‘මා විසින් කාර්යය කර අවසන් කරන ලදී. ඒ කාර්යය කරන විට මාගේ ශරීරය වෙහෙසට පත් විය. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය දෙවෙනි අලසකමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, භික්ෂුවකට යම් ගමනක් යාමට තිබේ. ඔහුට මෙසේ සිතේ – ‘මට ගමනක් යාමට තිබේ. ඒ ගමන යන විට මාගේ ශරීරය වෙහෙසට පත් වනු ඇත. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය තුන්වෙනි අලසකමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, භික්ෂුවක් ගමනක් ගොස් අවසන් වී ඇත. ඔහුට මෙසේ සිතේ – ‘මා ගමනක් ගොස් අවසන් කළෙමි. ඒ ගමන යන විට මාගේ ශරීරය වෙහෙසට පත් විය. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය සතරවෙනි අලසකමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, යම් භික්ෂුවක් ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතයෙහි හැසිරෙද්දී රළු හෝ ප්‍රණීත හෝ භෝජනයකින් අවශ්‍ය පමණ සම්පූර්ණ කරගැනීමට නොලබයි. ඔහුට මෙසේ සිතේ – ‘මම ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතයෙහි හැසිරෙද්දී රළු හෝ ප්‍රණීත හෝ භෝජනයකින් අවශ්‍ය පමණ සම්පූර්ණ කරගැනීමට නොලැබුවෙමි. එබැවින් මාගේ ශරීරය වෙහෙසට පත්වී, ක්‍රියා කිරීමට නොහැකිව ඇත. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය පස්වෙනි අලසකමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, යම් භික්ෂුවක් ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතයෙහි හැසිරෙද්දී රළු හෝ ප්‍රණීත හෝ භෝජනයකින් අවශ්‍ය පමණ සම්පූර්ණ කරගැනීමට ලබයි. ඔහුට මෙසේ සිතේ – ‘මම ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතයෙහි හැසිරෙද්දී රළු හෝ ප්‍රණීත හෝ භෝජනයකින් අවශ්‍ය පමණ සම්පූර්ණ කරගැනීමට ලැබුවෙමි. එබැවින් මාගේ ශරීරය බර වී, ක්‍රියා කිරීමට නොහැකිව ඇතැයි මම සිතමි. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය සයවෙනි අලසකමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, භික්ෂුවකට සුළු ආබාධයක් ඇති වී ඇත. ඔහුට මෙසේ සිතේ – ‘මට මේ සුළු ආබාධය ඇති වී ඇත, සැතපී සිටීමට සුදුසු කාලයකි. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය සත්වෙනි අලසකමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, භික්ෂුවක් රෝගයකින් නැගිට, රෝගයෙන් නැගිට වැඩි කලක් ගත වී නැත. ඔහුට මෙසේ සිතේ – ‘මම රෝගයකින් නැගිට වැඩි කලක් ගත වී නැත. එබැවින් මාගේ ශරීරය දුර්වල වී, ක්‍රියා කිරීමට නොහැකිව ඇත. එබැවින් මම දැන් සැතපෙන්නෙමි’යි. ඔහු සැතපෙයි, ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නේ නැත. මහණෙනි, මෙය අටවෙනි අලසකමට හේතු වන කරුණයි. මහණෙනි, මේවා අලසකමට හේතු වන කරුණු අටයි.\n\nමහණෙනි, මේ වීර්යය ඇරඹීමට හේතු වන කරුණු අටක් ඇත. ඒ අට කවරේද? මහණෙනි, මෙහිලා භික්ෂුවකට යම් කාර්යයක් කිරීමට තිබේ. ඔහුට මෙසේ සිතේ – ‘මට යම් කාර්යයක් කිරීමට තිබේ. ඒ කාර්යය මා විසින් කරන විට බුදුවරුන්ගේ ශාසනය සිතට ගැනීම පහසු නොවේ. එබැවින් මම කලින්ම ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නෙමි’යි. ඔහු ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹයි. මහණෙනි, මෙය පළමුවන වීර්යය ඇරඹීමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, භික්ෂුවක් විසින් යම් කාර්යයක් කර අවසන් වී ඇත. ඔහුට මෙසේ සිතේ – ‘මා විසින් කාර්යය කර අවසන් කරන ලදී. ඒ කාර්යය කරන විට බුදුවරුන්ගේ ශාසනය සිතට ගැනීමට මට නොහැකි විය. එබැවින් මම ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නෙමි’යි. ඔහු වීර්යය අරඹයි. මහණෙනි, මෙය දෙවෙනි වීර්යය ඇරඹීමට හේතු වන කරුණයි.\n\nතවද මහණෙනි, භික්ෂුවකට යම් ගමනක් යාමට තිබේ. ඔහුට මෙසේ සිතේ – ‘මට ගමනක් යාමට තිබේ. ඒ ගමන යන විට බුදුවරුන්ගේ ශාසනය සිතට ගැනීම පහසු නොවේ. එබැවින් මම ලබා නොගත් දේ ලබාගැනීම පිණිසත්, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම පිණිසත්, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම පිණිසත් වීර්යය අරඹන්නෙමි’යි. ඔහු වීර්යය අරඹයි. මහණෙනි, මෙය තුන්වෙනි වීර්යය ඇරඹීමට හේතු වන කරුණයි.\n\n‘‘නැවතත්, මහණෙනි, භික්‍ෂුවක් මාර්ගයේ ගමන් කර ඇත. ඔහුට මෙසේ සිතේ: ‘මම මාර්ගයේ ගමන් කළෙමි. මාර්ගය දිගේ යන අතරතුර මට බුදුවරුන්ගේ ශ්‍රාසනය සිත්හි මෙනෙහි කිරීමට නොහැකි විය. එහෙයින් මම නොලැබූ දේ ලැබීමට, අවබෝධ නොකළ දේ අවබෝධ කිරීමට, සාක්‍ෂාත් නොකළ දේ සාක්‍ෂාත් කිරීමට වීර්යය අරඹමි.’ මහණෙනි, මෙය සතරවන වීර්යය ආරම්භ කිරීමට හේතුවයි.\n\n‘‘නැවතත්, මහණෙනි, භික්‍ෂුවක් ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතය පිණිස හැසිරෙන කල්හි රළු හෝ ප්‍රණීත ආහාරවලින් ප්‍රමාණවත් තරම් පිරවීමක් නොලබයි. ඔහුට මෙසේ සිතේ: ‘මා ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතයෙහි හැසිරෙද්දී රළු හෝ ප්‍රණීත ආහාරවලින් ප්‍රමාණවත් තරම් පිරවීමක් නොලැබුවෙමි. එහෙයින් මාගේ ශරීරය සැහැල්ලුය, ක්‍රියාශීලීය. එහෙයින් මම නොලැබූ දේ ලැබීමට, අවබෝධ නොකළ දේ අවබෝධ කිරීමට, සාක්‍ෂාත් නොකළ දේ සාක්‍ෂාත් කිරීමට වීර්යය අරඹමි.’ මහණෙනි, මෙය පස්වන වීර්යය ආරම්භ කිරීමට හේතුවයි.\n\n‘‘නැවතත්, මහණෙනි, භික්‍ෂුවක් ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතය පිණිස හැසිරෙන කල්හි රළු හෝ ප්‍රණීත ආහාරවලින් ප්‍රමාණවත් තරම් පිරවීමක් ලබයි. ඔහුට මෙසේ සිතේ: ‘මා ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතයෙහි හැසිරෙද්දී රළු හෝ ප්‍රණීත ආහාරවලින් ප්‍රමාණවත් තරම් පිරවීමක් ලැබුවෙමි. එහෙයින් මාගේ ශරීරය බලවත්ය, ක්‍රියාශීලීය. එහෙයින් මම නොලැබූ දේ ලැබීමට, අවබෝධ නොකළ දේ අවබෝධ කිරීමට, සාක්‍ෂාත් නොකළ දේ සාක්‍ෂාත් කිරීමට වීර්යය අරඹමි.’ මහණෙනි, මෙය සයවන වීර්යය ආරම්භ කිරීමට හේතුවයි.\n\n‘‘නැවතත්, මහණෙනි, භික්‍ෂුවකට සුළු ආබාධයක් හටගෙන ඇත. ඔහුට මෙසේ සිතේ: ‘ඉතින්, මට මේ සුළු ආබාධය හටගෙන ඇත. මාගේ ආබාධය වර්ධනය විය හැකි කරුණකි. එහෙයින්, මාගේ ආබාධය වර්ධනය වීමට පෙර මම නොලැබූ දේ ලැබීමට, අවබෝධ නොකළ දේ අවබෝධ කිරීමට, සාක්‍ෂාත් නොකළ දේ සාක්‍ෂාත් කිරීමට වීර්යය අරඹමි.’ මහණෙනි, මෙය සත්වන වීර්යය ආරම්භ කිරීමට හේතුවයි.\n\n‘‘නැවතත්, මහණෙනි, භික්‍ෂුවක් රෝගාබාධයකින් නැගී සිටි, රෝගී තත්ත්වයෙන් මෑතදී සුවය ලැබූ කෙනෙකි. ඔහුට මෙසේ සිතේ: ‘ඉතින්, මම රෝගාබාධයකින් නැගී සිටියෙමි, රෝගී තත්ත්වයෙන් මෑතදී සුවය ලැබුවෙමි. මාගේ ආබාධය නැවත ඇතිවිය හැකි කරුණකි. එහෙයින්, මාගේ ආබාධය නැවත ඇතිවීමට පෙර, නොලැබූ දේ ලැබීමට, අවබෝධ නොකළ දේ අවබෝධ කිරීමට, සාක්‍ෂාත් නොකළ දේ සාක්‍ෂාත් කිරීමට මම වීර්යය අරඹමි.’ ඔහු නොලැබූ දේ ලැබීමට, අවබෝධ නොකළ දේ අවබෝධ කිරීමට, සාක්‍ෂාත් නොකළ දේ සාක්‍ෂාත් කිරීමට වීර්යය අරඹයි. මහණෙනි, මෙය අටවන වීර්යය ආරම්භ කිරීමට හේතුවයි. මහණෙනි, මේවා අට වීර්යය ආරම්භ කිරීමට හේතූන් ය.",
      "paliTitle": "Kusītārambhavatthusuttaṃ",
      "englishTitle": "Discourse on Idleness and Effort",
      "sinhalaTitle": "කුසීත ආරම්භ වස්තුව සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Yamakavaggo tatiyo. Tassuddānaṃ – Dve saddhā dve maraṇassatī, dve sampadā athāpare; Icchā alaṃ parihānaṃ, kusītārambhavatthūnīti.",
    "english": "The Third Chapter of Pairs",
    "sinhala": "තෙවැනි යමක වග්‍ගය"
  }
}