{
  "id": "an8.7",
  "title": {
    "pali": "Bhūmicālavaggo",
    "english": "The Chapter on Earth Tremors",
    "sinhala": "භූමිකම්පා වග්ගය"
  },
  "sections": [
    {
      "number": 61,
      "pali": "[a. ni. 8.77] ‘‘Aṭṭhime, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame aṭṭha? Idha, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho nuppajjati. So tena alābhena socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’. ‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena majjati pamajjati pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca madī ca pamādī ca, cuto ca saddhammā’’’. ‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati na ghaṭati na vāyamati lābhāya. Tassa anuṭṭhahato aghaṭato avāyamato lābhāya lābho nuppajjati. So tena alābhena socati, kilamati, paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati na ghaṭati na vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’. ‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho uppajjati. So tena lābhena majjati, pamajjati, pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati na ghaṭati na vāyamati lābhāya, lābhī ca madī ca, pamādī ca, cuto ca saddhammā’’’. ‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho nuppajjati. So tena alābhena na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’. ‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena na majjati, na pamajjati, na pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā’’’. ‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho nuppajjati. So tena alābhena na socati, na kilamati, na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’. ‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato aghaṭato avāyamato lābhāya lābho uppajjati. So tena lābhena na majjati, na pamajjati, na pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā ’. Ime kho, bhikkhave, aṭṭha puggalā santo saṃvijjamānā lokasmi’’nti. Paṭhamaṃ.",
      "english": "Monks, these eight types of individuals exist and are found in the world. Which eight?\n\nHere, monks, a monk living in solitude, living independently, develops a desire for gain. He strives, exerts himself, and makes effort for gain. But as he strives, exerts himself, and makes effort for gain, no gain arises for him. Due to that lack of gain, he grieves, laments, weeps, beats his breast, and falls into confusion. This one, monks, is called: 'A monk who lives desiring gain, strives, exerts himself, and makes effort for gain, but does not obtain gain, and grieves and laments, and has fallen away from the true Dhamma.'\n\nAgain, monks, here a monk living in solitude, living independently, develops a desire for gain. He strives, exerts himself, and makes effort for gain. As he strives, exerts himself, and makes effort for gain, gain arises for him. Due to that gain, he becomes intoxicated, heedless, and falls into heedlessness. This one, monks, is called: 'A monk who lives desiring gain, strives, exerts himself, and makes effort for gain, and obtains gain, and is intoxicated and heedless, and has fallen away from the true Dhamma.'\n\nAgain, monks, here a monk living in solitude, living independently, develops a desire for gain. But he does not strive, does not exert himself, and does not make effort for gain. As he does not strive, does not exert himself, and does not make effort for gain, no gain arises for him. Due to that lack of gain, he grieves, laments, weeps, beats his breast, and falls into confusion. This one, monks, is called: 'A monk who lives desiring gain, but does not strive, does not exert himself, and does not make effort for gain, and does not obtain gain, and grieves and laments, and has fallen away from the true Dhamma.'\n\nAgain, monks, here a monk living in solitude, living independently, develops a desire for gain. But he does not strive, does not exert himself, and does not make effort for gain. As he does not strive, does not exert himself, and does not make effort for gain, gain arises for him. Due to that gain, he becomes intoxicated, heedless, and falls into heedlessness. This one, monks, is called: 'A monk who lives desiring gain, but does not strive, does not exert himself, and does not make effort for gain, and obtains gain, and is intoxicated and heedless, and has fallen away from the true Dhamma.'\n\nAgain, monks, here a monk living in solitude, living independently, develops a desire for gain. He strives, exerts himself, and makes effort for gain. But as he strives, exerts himself, and makes effort for gain, no gain arises for him. Due to that lack of gain, he does not grieve, does not lament, does not weep, does not beat his breast, and does not fall into confusion. This one, monks, is called: 'A monk who lives desiring gain, strives, exerts himself, and makes effort for gain, but does not obtain gain, and does not grieve nor lament, and has not fallen away from the true Dhamma.'\n\nAgain, monks, here a monk living in solitude, living independently, develops a desire for gain. He strives, exerts himself, and makes effort for gain. As he strives, exerts himself, and makes effort for gain, gain arises for him. Due to that gain, he does not become intoxicated, does not become heedless, and does not fall into heedlessness. This one, monks, is called: 'A monk who lives desiring gain, strives, exerts himself, and makes effort for gain, and obtains gain, and is neither intoxicated nor heedless, and has not fallen away from the true Dhamma.'\n\nAgain, monks, here a monk living in solitude, living independently, develops a desire for gain. But he does not strive, does not exert himself, and does not make effort for gain. As he does not strive, does not exert himself, and does not make effort for gain, no gain arises for him. Due to that lack of gain, he does not grieve, does not lament, does not weep, does not beat his breast, and does not fall into confusion. This one, monks, is called: 'A monk who lives desiring gain, but does not strive, does not exert himself, and does not make effort for gain, and does not obtain gain, and does not grieve nor lament, and has not fallen away from the true Dhamma.'\n\nAgain, monks, here a monk living in solitude, living independently, develops a desire for gain. But he does not strive, does not exert himself, and does not make effort for gain. As he does not strive, does not exert himself, and does not make effort for gain, gain arises for him. Due to that gain, he does not become intoxicated, does not become heedless, and does not fall into heedlessness. This one, monks, is called: 'A monk who lives desiring gain, but does not strive, does not exert himself, and does not make effort for gain, and obtains gain, and is neither intoxicated nor heedless, and has not fallen away from the true Dhamma.' These, monks, are the eight types of individuals existing and found in the world.",
      "sinhala": "භික්ෂූණි, මේ ලෝකයෙහි පුද්ගලයන් අට දෙනෙක් සිටිති, දක්නට ලැබෙති. කවර අට දෙනෙක්ද?\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි. එලෙස ලාභය පිණිස උත්සාහ කරන, වෙහෙසෙන, වීර්යය කරන ඔහුට ලාභයක් නොලැබෙයි. හෙතෙම ඒ ලාභ නොලැබීම නිසා ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, ළයෙහි අත් ගසා හඬයි, මුළාවට පත්වෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි, එහෙත් ලාභ ලබන්නෙක් නොවෙයි, ශෝක කරන්නෙක් ද වැළපෙන්නෙක් ද වෙයි, සද්ධර්මයෙන් පිරිහුණෙක් ද වෙයි’.\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි. එලෙස ලාභය පිණිස උත්සාහ කරන, වෙහෙසෙන, වීර්යය කරන ඔහුට ලාභයක් ලැබෙයි. හෙතෙම ඒ ලාභය නිසා මත් වෙයි, ප්‍රමාද වෙයි, ප්‍රමාදයට පත්වෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි, ලාභ ලබන්නෙක් ද වෙයි, මත්වූවෙක් ද ප්‍රමාද වූවෙක් ද වෙයි, සද්ධර්මයෙන් පිරිහුණෙක් ද වෙයි’.\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි. එලෙස ලාභය පිණිස උත්සාහ නොකරන, වෙහෙස නොකරන, වීර්යය නොකරන ඔහුට ලාභයක් නොලැබෙයි. හෙතෙම ඒ ලාභ නොලැබීම නිසා ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, ළයෙහි අත් ගසා හඬයි, මුළාවට පත්වෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි, ලාභ ලබන්නෙක් ද නොවෙයි, ශෝක කරන්නෙක් ද වැළපෙන්නෙක් ද වෙයි, සද්ධර්මයෙන් පිරිහුණෙක් ද වෙයි’.\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි. එලෙස ලාභය පිණිස උත්සාහ නොකරන, වෙහෙස නොකරන, වීර්යය නොකරන ඔහුට ලාභයක් ලැබෙයි. හෙතෙම ඒ ලාභය නිසා මත් වෙයි, ප්‍රමාද වෙයි, ප්‍රමාදයට පත්වෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි, ලාභ ලබන්නෙක් ද මත්වූවෙක් ද ප්‍රමාද වූවෙක් ද වෙයි, සද්ධර්මයෙන් පිරිහුණෙක් ද වෙයි’.\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි. එලෙස ලාභය පිණිස උත්සාහ කරන, වෙහෙසෙන, වීර්යය කරන ඔහුට ලාභයක් නොලැබෙයි. හෙතෙම ඒ ලාභ නොලැබීම නිසා ශෝක නොකරයි, වෙහෙසට පත් නොවෙයි, වැළපෙන්නේ නැත, ළයෙහි අත් ගසා හඬන්නේ නැත, මුළාවට පත් නොවෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි, එහෙත් ලාභ ලබන්නෙක් නොවෙයි, ශෝක කරන්නෙක් ද වැළපෙන්නෙක් ද නොවෙයි, සද්ධර්මයෙන් නොපිරිහුණෙක් ද වෙයි’.\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි. එලෙස ලාභය පිණිස උත්සාහ කරන, වෙහෙසෙන, වීර්යය කරන ඔහුට ලාභයක් ලැබෙයි. හෙතෙම ඒ ලාභය නිසා මත් නොවෙයි, ප්‍රමාද නොවෙයි, ප්‍රමාදයට පත් නොවෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ කරයි, වෙහෙසෙයි, වීර්යය කරයි, ලාභ ලබන්නෙක් ද වෙයි, එහෙත් මත්වූවෙක් ද ප්‍රමාද වූවෙක් ද නොවෙයි, සද්ධර්මයෙන් නොපිරිහුණෙක් ද වෙයි’.\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි. එලෙස ලාභය පිණිස උත්සාහ නොකරන, වෙහෙස නොකරන, වීර්යය නොකරන ඔහුට ලාභයක් නොලැබෙයි. හෙතෙම ඒ ලාභ නොලැබීම නිසා ශෝක නොකරයි, වෙහෙසට පත් නොවෙයි, වැළපෙන්නේ නැත, ළයෙහි අත් ගසා හඬන්නේ නැත, මුළාවට පත් නොවෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි, ලාභ ලබන්නෙක් ද නොවෙයි, ශෝක කරන්නෙක් ද වැළපෙන්නෙක් ද නොවෙයි, සද්ධර්මයෙන් නොපිරිහුණෙක් ද වෙයි’.\n\nභික්ෂූණි, මෙහිලා යම් භික්ෂුවකට අන් මත යැපීමෙන් තොරව, හුදෙකලාවේ වාසය කරන කල්හි, ලාභයක් පිළිබඳව ආශාවක් හටගනියි. හෙතෙම ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි. එලෙස ලාභය පිණිස උත්සාහ නොකරන, වෙහෙස නොකරන, වීර්යය නොකරන ඔහුට ලාභයක් ලැබෙයි. හෙතෙම ඒ ලාභය නිසා මත් නොවෙයි, ප්‍රමාද නොවෙයි, ප්‍රමාදයට පත් නොවෙයි. භික්ෂූණි, මොහු මෙලෙස කියනු ලැබේ: ‘භික්ෂුවක් ලාභයට කැමතිව වාසය කරයි, ලාභය පිණිස උත්සාහ නොකරයි, වෙහෙස නොකරයි, වීර්යය නොකරයි, ලාභ ලබන්නෙක් ද වෙයි, එහෙත් මත්වූවෙක් ද ප්‍රමාද වූවෙක් ද නොවෙයි, සද්ධර්මයෙන් නොපිරිහුණෙක් ද වෙයි’. භික්ෂූණි, මේ පුද්ගලයන් අට දෙනා ලෝකයෙහි සිටින, දක්නට ලැබෙන අය වෙති.",
      "paliTitle": "Icchāsuttaṃ",
      "englishTitle": "The Discourse on Desire",
      "sinhalaTitle": "ඉච්ඡා සූත්‍රය"
    },
    {
      "number": 62,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko [dhārakajātiko (sī. syā. pī.) a. ni. 8.78] hoti; dhātānañca [dhatānañca (sī. syā. pī.)] dhammānaṃ atthūpaparikkhitā [atthūpavarikkhī (sī. syā. pī.)] hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako [samādāpako (?)] samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti…pe… atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ. ‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ. Katamehi catūhi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ. ‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ paresaṃ nālaṃ attano. Katamehi catūhi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; na ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo…pe… atthassa viññāpaniyā; sandassako ca hoti…pe… sabrahmacārīnaṃ. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. ‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ. Katamehi tīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. ‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi tīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti…pe… atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. ‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. Katamehi dvīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti…pe… atthassa viññāpaniyā; no ca sandassako hoti…pe… sabrahmacārīnaṃ. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. ‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi dvīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano’’ti. Dutiyaṃ.",
      "english": "Monks, a bhikkhu endowed with six qualities is capable for himself and capable for others. Which six? Here, monks, a bhikkhu is quick to comprehend wholesome teachings; is naturally disposed to retain the teachings he has heard; examines the meaning of the teachings he has retained; having understood the meaning and the teaching, practices in accordance with the Dhamma; is good in speech and articulation, endowed with a cultured, clear, unhesitant voice that conveys the meaning effectively; and is one who instructs, encourages, inspires, and gladdens fellow practitioners. Monks, a bhikkhu endowed with these six qualities is capable for himself and capable for others.\n\nMonks, a bhikkhu endowed with five qualities is capable for himself and capable for others. Which five? Here, monks, a bhikkhu is indeed not quick to comprehend wholesome teachings; yet is naturally disposed to retain the teachings he has heard; examines the meaning of the teachings he has retained; having understood the meaning and the teaching, practices in accordance with the Dhamma; is good in speech and articulation, endowed with a cultured, clear, unhesitant voice that conveys the meaning effectively; and is one who instructs, encourages, inspires, and gladdens fellow practitioners. Monks, a bhikkhu endowed with these five qualities is capable for himself and capable for others.\n\nMonks, a bhikkhu endowed with four qualities is capable for himself but not capable for others. Which four? Here, monks, a bhikkhu is quick to comprehend wholesome teachings; is naturally disposed to retain the teachings he has heard; examines the meaning of the teachings he has retained; and having understood the meaning and the teaching, practices in accordance with the Dhamma; but is not good in speech and articulation, nor endowed with a cultured, clear, unhesitant voice that conveys the meaning effectively; and is not one who instructs, encourages, inspires, or gladdens fellow practitioners. Monks, a bhikkhu endowed with these four qualities is capable for himself but not capable for others.\n\nMonks, a bhikkhu endowed with four qualities is capable for others but not capable for himself. Which four? Here, monks, a bhikkhu is quick to comprehend wholesome teachings; is naturally disposed to retain the teachings he has heard; but does not examine the meaning of the teachings he has retained; nor, having understood the meaning and the teaching, does he practice in accordance with the Dhamma; yet is good in speech and articulation, endowed with a cultured, clear, unhesitant voice that conveys the meaning effectively; and is one who instructs, encourages, inspires, and gladdens fellow practitioners. Monks, a bhikkhu endowed with these four qualities is capable for others but not capable for himself.\n\nMonks, a bhikkhu endowed with three qualities is capable for himself but not capable for others. Which three? Here, monks, a bhikkhu is indeed not quick to comprehend wholesome teachings; yet is naturally disposed to retain the teachings he has heard; examines the meaning of the teachings he has retained; and having understood the meaning and the teaching, practices in accordance with the Dhamma; but is not good in speech and articulation, nor endowed with a cultured, clear, unhesitant voice that conveys the meaning effectively; and is not one who instructs, encourages, inspires, or gladdens fellow practitioners. Monks, a bhikkhu endowed with these three qualities is capable for himself but not capable for others.\n\nMonks, a bhikkhu endowed with three qualities is capable for others but not capable for himself. Which three? Here, monks, a bhikkhu is indeed not quick to comprehend wholesome teachings; yet is naturally disposed to retain the teachings he has heard; but does not examine the meaning of the teachings he has retained; nor, having understood the meaning and the teaching, does he practice in accordance with the Dhamma; yet is good in speech and articulation, endowed with a cultured, clear, unhesitant voice that conveys the meaning effectively; and is one who instructs, encourages, inspires, and gladdens fellow practitioners. Monks, a bhikkhu endowed with these three qualities is capable for others but not capable for himself.\n\nMonks, a bhikkhu endowed with two qualities is capable for himself but not capable for others. Which two? Here, monks, a bhikkhu is indeed not quick to comprehend wholesome teachings; nor is naturally disposed to retain the teachings he has heard; yet examines the meaning of the teachings he has retained; and having understood the meaning and the teaching, practices in accordance with the Dhamma; but is not good in speech and articulation, nor endowed with a cultured, clear, unhesitant voice that conveys the meaning effectively; and is not one who instructs, encourages, inspires, or gladdens fellow practitioners. Monks, a bhikkhu endowed with these two qualities is capable for himself but not capable for others.\n\nMonks, a bhikkhu endowed with two qualities is capable for others but not capable for himself. Which two?\n\nHere, bhikkhus, a monk is not quick in understanding wholesome states, nor is he one who retains the teachings he has heard, nor is he one who examines the meaning of the teachings he has retained, nor, having understood the meaning and the teaching, does he practice in accordance with the teaching. However, he is one who has good speech, good enunciation, endowed with refined, clear, articulate speech that conveys the meaning, and he is one who points out, encourages, inspires, and gladdens his fellow practitioners. Bhikkhus, a monk endowed with these two qualities is fit for others, but not fit for himself.",
      "sinhala": "මහණෙනි, ධර්මයන් සයකින් යුක්ත වූ භික්‍ෂුව තමාට ද ප්‍රමාණවත් ය, අනුන්ට ද ප්‍රමාණවත් ය. කවර ධර්ම සයකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගන්නෙක් වෙයි. අසන ලද ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වෙයි. ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසන්නෙක් වෙයි. අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටා ක්‍රියා කරන්නෙක් වෙයි. මනා වූ වචන ඇත්තෙක් ද, මනා ලෙස වචන භාවිතා කරන්නෙක් ද වෙයි. එසේම, ශිෂ්ට වූ, පැහැදිලි වූ, නොතැතිලෙන සුළු වූ, අර්ථය පහදා දෙන වූ වචනයෙන් යුක්ත වෙයි. තම සබ්‍රහ්මචාරීන් හට ධර්මය පෙන්වා දෙන්නෙක් ද, සමාදන් කරවන්නෙක් ද, උනන්දු කරවන්නෙක් ද, සතුටු කරවන්නෙක් ද වෙයි. මහණෙනි, මේ ධර්මයන් සයකින් යුක්ත වූ භික්‍ෂුව තමාට ද ප්‍රමාණවත් ය, අනුන්ට ද ප්‍රමාණවත් ය.\n\nමහණෙනි, ධර්මයන් පසකින් යුක්ත වූ භික්‍ෂුව තමාට ද ප්‍රමාණවත් ය, අනුන්ට ද ප්‍රමාණවත් ය. කවර ධර්ම පසකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගන්නෙක් නොවේ. අසන ලද ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වෙයි. ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසන්නෙක් වෙයි. අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටා ක්‍රියා කරන්නෙක් වෙයි. මනා වූ වචන ඇත්තෙක් ද, මනා ලෙස වචන භාවිතා කරන්නෙක් ද වෙයි. එසේම, ශිෂ්ට වූ, පැහැදිලි වූ, නොතැතිලෙන සුළු වූ, අර්ථය පහදා දෙන වූ වචනයෙන් යුක්ත වෙයි. තම සබ්‍රහ්මචාරීන් හට ධර්මය පෙන්වා දෙන්නෙක් ද, සමාදන් කරවන්නෙක් ද, උනන්දු කරවන්නෙක් ද, සතුටු කරවන්නෙක් ද වෙයි. මහණෙනි, මේ ධර්මයන් පසකින් යුක්ත වූ භික්‍ෂුව තමාට ද ප්‍රමාණවත් ය, අනුන්ට ද ප්‍රමාණවත් ය.\n\nමහණෙනි, ධර්මයන් සතරකින් යුක්ත වූ භික්‍ෂුව තමාට ප්‍රමාණවත් ය, අනුන්ට ප්‍රමාණවත් නොවේ. කවර ධර්ම සතරකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගන්නෙක් වෙයි. අසන ලද ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වෙයි. ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසන්නෙක් වෙයි. අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටා ක්‍රියා කරන්නෙක් වෙයි. එහෙත්, සුමිහිරි වචන ඇත්තෙක් ද, මනා ලෙස වචන භාවිතා කරන්නෙක් ද නොවේ. ශිෂ්ට වූ, පැහැදිලි වූ, නොතැතිලෙන සුළු වූ, අර්ථය පහදා දෙන වූ වචනයෙන් යුක්ත ද නොවේ. තම සබ්‍රහ්මචාරීන් හට ධර්මය පෙන්වා දෙන්නෙක් ද, සමාදන් කරවන්නෙක් ද, උනන්දු කරවන්නෙක් ද, සතුටු කරවන්නෙක් ද නොවේ. මහණෙනි, මේ ධර්මයන් සතරකින් යුක්ත වූ භික්‍ෂුව තමාට ප්‍රමාණවත් ය, අනුන්ට ප්‍රමාණවත් නොවේ.\n\nමහණෙනි, ධර්මයන් සතරකින් යුක්ත වූ භික්‍ෂුව අනුන්ට ප්‍රමාණවත් ය, තමාට ප්‍රමාණවත් නොවේ. කවර ධර්ම සතරකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගන්නෙක් වෙයි. අසන ලද ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වෙයි. එහෙත්, ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසන්නෙක් නොවේ. අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටා ක්‍රියා කරන්නෙක් ද නොවේ. මනා වූ වචන ඇත්තෙක් ද, මනා ලෙස වචන භාවිතා කරන්නෙක් ද වෙයි. එසේම, ශිෂ්ට වූ, පැහැදිලි වූ, නොතැතිලෙන සුළු වූ, අර්ථය පහදා දෙන වූ වචනයෙන් යුක්ත වෙයි. තම සබ්‍රහ්මචාරීන් හට ධර්මය පෙන්වා දෙන්නෙක් ද, සමාදන් කරවන්නෙක් ද, උනන්දු කරවන්නෙක් ද, සතුටු කරවන්නෙක් ද වෙයි. මහණෙනි, මේ ධර්මයන් සතරකින් යුක්ත වූ භික්‍ෂුව අනුන්ට ප්‍රමාණවත් ය, තමාට ප්‍රමාණවත් නොවේ.\n\nමහණෙනි, ධර්මයන් තුනකින් යුක්ත වූ භික්‍ෂුව තමාට ප්‍රමාණවත් ය, අනුන්ට ප්‍රමාණවත් නොවේ. කවර ධර්ම තුනකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගන්නෙක් නොවේ. අසන ලද ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වෙයි. ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසන්නෙක් වෙයි. අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටා ක්‍රියා කරන්නෙක් වෙයි. එහෙත්, සුමිහිරි වචන ඇත්තෙක් ද, මනා ලෙස වචන භාවිතා කරන්නෙක් ද නොවේ. ශිෂ්ට වූ, පැහැදිලි වූ, නොතැතිලෙන සුළු වූ, අර්ථය පහදා දෙන වූ වචනයෙන් යුක්ත ද නොවේ. තම සබ්‍රහ්මචාරීන් හට ධර්මය පෙන්වා දෙන්නෙක් ද, සමාදන් කරවන්නෙක් ද, උනන්දු කරවන්නෙක් ද, සතුටු කරවන්නෙක් ද නොවේ. මහණෙනි, මේ ධර්මයන් තුනකින් යුක්ත වූ භික්‍ෂුව තමාට ප්‍රමාණවත් ය, අනුන්ට ප්‍රමාණවත් නොවේ.\n\nමහණෙනි, ධර්මයන් තුනකින් යුක්ත වූ භික්‍ෂුව අනුන්ට ප්‍රමාණවත් ය, තමාට ප්‍රමාණවත් නොවේ. කවර ධර්ම තුනකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගන්නෙක් නොවේ. අසන ලද ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත වෙයි. එහෙත්, ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසන්නෙක් නොවේ. අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටා ක්‍රියා කරන්නෙක් ද නොවේ. මනා වූ වචන ඇත්තෙක් ද, මනා ලෙස වචන භාවිතා කරන්නෙක් ද වෙයි. එසේම, ශිෂ්ට වූ, පැහැදිලි වූ, නොතැතිලෙන සුළු වූ, අර්ථය පහදා දෙන වූ වචනයෙන් යුක්ත වෙයි. තම සබ්‍රහ්මචාරීන් හට ධර්මය පෙන්වා දෙන්නෙක් ද, සමාදන් කරවන්නෙක් ද, උනන්දු කරවන්නෙක් ද, සතුටු කරවන්නෙක් ද වෙයි. මහණෙනි, මේ ධර්මයන් තුනකින් යුක්ත වූ භික්‍ෂුව අනුන්ට ප්‍රමාණවත් ය, තමාට ප්‍රමාණවත් නොවේ.\n\nමහණෙනි, ධර්මයන් දෙකකින් යුක්ත වූ භික්‍ෂුව තමාට ප්‍රමාණවත් ය, අනුන්ට ප්‍රමාණවත් නොවේ. කවර ධර්ම දෙකකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගන්නෙක් නොවේ. අසන ලද ධර්මයන් ධාරණය කරගැනීමේ ස්වභාවයෙන් යුක්ත ද නොවේ. ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසන්නෙක් වෙයි. අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවෙහි පිහිටා ක්‍රියා කරන්නෙක් වෙයි. එහෙත්, සුමිහිරි වචන ඇත්තෙක් ද, මනා ලෙස වචන භාවිතා කරන්නෙක් ද නොවේ. ශිෂ්ට වූ, පැහැදිලි වූ, නොතැතිලෙන සුළු වූ, අර්ථය පහදා දෙන වූ වචනයෙන් යුක්ත ද නොවේ. තම සබ්‍රහ්මචාරීන් හට ධර්මය පෙන්වා දෙන්නෙක් ද, සමාදන් කරවන්නෙක් ද, උනන්දු කරවන්නෙක් ද, සතුටු කරවන්නෙක් ද නොවේ. මහණෙනි, මේ ධර්මයන් දෙකකින් යුක්ත වූ භික්‍ෂුව තමාට ප්‍රමාණවත් ය, අනුන්ට ප්‍රමාණවත් නොවේ.\n\nමහණෙනි, ධර්මයන් දෙකකින් යුක්ත වූ භික්‍ෂුව අනුන්ට ප්‍රමාණවත් ය, තමාට ප්‍රමාණවත් නොවේ. කවර ධර්ම දෙකකින් ද?\n\nභික්ෂූන් වහන්ස, මෙහිලා යම් භික්ෂුවක් කුසල ධර්‍මයන්හිදී ඉක්මනින් දත යුතු දේ නොදන්නා සුලු වෙයි. ඇසූ ධර්‍මයන් ධාරණය කරගන්නා ස්වභාවයෙන් යුක්ත නොවේ. ධාරණය කරගත් ධර්‍මයන්ගේ අර්‍ථය විමසන්නෙක් නොවේ. අර්‍ථයද දැන, ධර්‍මයද දැන, ධර්‍මානුධර්‍ම ප්‍ර‍තිපදාවෙහි නොපිහිටයි.\n\nඑහෙත් ඔහු සුන්දර වචන ඇති, සුන්දර වාක්‍‍ය කතා කරන කෙනෙක් වෙයි. නාගරික, ශිෂ්ට වූ වාග් විලාසයකින් යුක්ත වෙයි. පැහැදිලි, නොපැකිළෙන, අර්‍ථය දැනවිය හැකි කතාවකින් යුක්ත වෙයි. තවද, ඔහු සබ්‍ර‍හ්මචාරීන්ට කරුණු පෙන්වා දෙන, සමාදන් කරවන, උද්යෝගවත් කරන, සතුටු කරවන කෙනෙක් වෙයි.\n\nභික්ෂූන් වහන්ස, මේ ද්විත්ව ධර්‍මයන්ගෙන් යුක්ත වූ භික්ෂුවක් අනුන්ට ප්‍ර‍මාණවත් වන නමුත් තමාට ප්‍ර‍මාණවත් නොවේ.",
      "paliTitle": "Alaṃsuttaṃ",
      "englishTitle": "The Discourse on Sufficiency",
      "sinhalaTitle": "අලං සූත්‍‌රය"
    },
    {
      "number": 63,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Evamevaṃ panidhekacce moghapurisā mamaññeva ajjhesanti. Dhamme ca bhāsite mamaññeva anubandhitabbaṃ maññantī’’ti. ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ, desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ ājāneyyaṃ, appeva nāmāhaṃ bhagavato bhāsitassa dāyādo assa’’nti. ‘‘Tasmātiha te, bhikkhu evaṃ sikkhitabbaṃ – ‘ajjhattaṃ me cittaṃ ṭhitaṃ bhavissati susaṇṭhitaṃ, na ca uppannā pāpakā akusalā dhammā cittaṃ pariyādāya ṭhassantī’ti. Evañhi te, bhikkhu, sikkhitabbaṃ’’. ‘‘Yato kho te, bhikkhu, ajjhattaṃ cittaṃ ṭhitaṃ hoti susaṇṭhitaṃ, na ca uppannā pāpakā akusalā dhammā cittaṃ pariyādāya tiṭṭhanti, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘mettā me cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi te, bhikkhu, sikkhitabbaṃ. ‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkampi savicāraṃ [savitakkasavicārampi (ka.)] bhāveyyāsi, avitakkampi vicāramattaṃ [avitakkavicāramattampi (ka.) visuddhi. 1.271 passitabbaṃ] bhāveyyāsi, avitakkampi avicāraṃ [avitakkaavicārampi (ka.)] bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi. ‘‘Yato kho, te bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘karuṇā me cetovimutti… muditā me cetovimutti… upekkhā me cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi te, bhikkhu, sikkhitabbaṃ. ‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkasavicārampi bhāveyyāsi, avitakkavicāramattampi bhāveyyāsi, avitakkaavicārampi bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi. ‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘kāye kāyānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti. Evañhi te, bhikkhu, sikkhitabbaṃ. ‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkasavicārampi bhāveyyāsi, avitakkavicāramattampi bhāveyyāsi, avitakkaavicārampi bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi. ‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘vedanāsu vedanānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti; citte cittānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti; dhammesu dhammānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti. Evañhi te, bhikkhu, sikkhitabbaṃ. ‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkasavicārampi bhāveyyāsi, avitakkavicāramattampi bhāveyyāsi, avitakkaavicārampi bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi. ‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato tvaṃ, bhikkhu, yena yeneva gagghasi phāsuṃyeva gagghasi, yattha yattha ṭhassasi phāsuṃyeva ṭhassasi, yattha yattha nisīdissasi phāsuṃyeva nisīdissasi, yattha yattha seyyaṃ kappessasi phāsuṃyeva seyyaṃ kappessasī’’ti. Atha kho so bhikkhu bhagavatā iminā ovādena ovadito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca pana so bhikkhu arahataṃ ahosīti. Tatiyaṃ.",
      "english": "Then a certain bhikkhu approached the Blessed One, and having approached, having saluted, having sat down to one side, that bhikkhu said to the Blessed One: “It would be good for me, venerable sir, if the Blessed One would teach me the Dhamma in brief, so that, having heard the Dhamma from the Blessed One, I might dwell alone, secluded, diligent, ardent, and resolute.” “Indeed, some deluded men here request only me. And when the Dhamma is taught, they consider it to be only about me.” “Venerable sir, may the Blessed One teach me the Dhamma in brief; may the Fortunate One teach me the Dhamma in brief. Perhaps I might understand the meaning of what the Blessed One says, perhaps I might become an heir to what the Blessed One says.”\n\n“Therefore, bhikkhu, you should train yourself thus: ‘My mind within will be steady, well-established, and unwholesome states that have arisen will not overwhelm my mind.’ That is how you should train yourself, bhikkhu.”\n\n“When, bhikkhu, your mind within is steady and well-established, and unwholesome states that have arisen do not overwhelm your mind, then, bhikkhu, you should train yourself thus: ‘My liberation of mind through loving-kindness will be developed, much practiced, made a vehicle, made a basis, steadily maintained, well-accumulated, and thoroughly undertaken.’ That is how you should train yourself, bhikkhu.”\n\n“When, bhikkhu, this concentration is thus developed and much practiced, then, bhikkhu, you should develop this concentration with initial application and sustained application; you should develop it without initial application, with only sustained application; you should develop it without initial application and without sustained application; you should develop it with rapture; you should develop it without rapture; you should develop it accompanied by pleasure; you should develop it accompanied by equanimity.”\n\n“When, bhikkhu, this concentration is thus developed and well-developed, then, bhikkhu, you should train yourself thus: ‘My liberation of mind through compassion... my liberation of mind through appreciative joy... my liberation of mind through equanimity will be developed, much practiced, made a vehicle, made a basis, steadily maintained, well-accumulated, and thoroughly undertaken.’ That is how you should train yourself, bhikkhu.”\n\n“When, bhikkhu, this concentration is thus developed and well-developed, then, bhikkhu, you should develop this concentration with initial application and sustained application; you should develop it without initial application, with only sustained application; you should develop it without initial application and without sustained application; you should develop it with rapture; you should develop it without rapture; you should develop it accompanied by pleasure; you should develop it accompanied by equanimity.”\n\n“When, bhikkhu, this concentration is thus developed and well-developed, then, bhikkhu, you should train yourself thus: ‘I will dwell contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.’ That is how you should train yourself, bhikkhu.”\n\n“When, bhikkhu, this concentration is thus developed and much practiced, then, bhikkhu, you should develop this concentration with initial application and sustained application; you should develop it without initial application, with only sustained application; you should develop it without initial application and without sustained application; you should develop it with rapture; you should develop it without rapture; you should develop it accompanied by pleasure; you should develop it accompanied by equanimity.”\n\n“When, bhikkhu, this concentration is thus developed and well-developed, then, bhikkhu, you should train yourself thus: ‘I will dwell contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world’; ‘I will dwell contemplating mind in mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world’; ‘I will dwell contemplating mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.’ That is how you should train yourself, bhikkhu.”\n\n“When, bhikkhu, this concentration is thus developed and much practiced, then, bhikkhu, you should develop this concentration with initial application and sustained application; you should develop it without initial application, with only sustained application; you should develop it without initial application and without sustained application; you should develop it with rapture; you should develop it without rapture; you should develop it accompanied by pleasure; you should develop it accompanied by equanimity.”\n\n“When, bhikkhu, this concentration is thus developed and well-developed, then, bhikkhu, wherever you walk, you will walk in comfort; wherever you stand, you will stand in comfort; wherever you sit, you will sit in comfort; wherever you lie down, you will lie down in comfort.”\n\nThen that bhikkhu, having been exhorted by the Blessed One with this instruction, rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed.\n\nThen indeed, that bhikkhu, dwelling solitary, withdrawn, diligent, ardent, and resolute, not long afterwards, having realized for himself with direct knowledge and attained in this very life that unsurpassed culmination of the holy life for the sake of which good families' sons rightly go forth from home into homelessness, he dwelt therein. He directly knew: \"Birth is destroyed; the holy life has been lived; what was to be done has been done; there is no more for this state of being.\" And that bhikkhu, furthermore, became one of the Arahants.",
      "sinhala": "එවිට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, භාග්‍යවතුන් වහන්සේ මට සංක්ෂිප්තයෙන් ධර්මය දේශනා කළ මැනව. භාග්‍යවතුන් වහන්සේගේ ධර්මය අසා, මම एकांतව, අප්‍රමාදීව, වීර්යවත්ව, අරමුණෙහි පිහිටි සිතින් යුතුව වාසය කරම්වා!”\n\n“මෙලෙසම මෙහි සමහර හිස් පුරුෂයෝ මා වෙතින්ම ඉල්ලති. ධර්මය දේශනා කළ විට මා පසුපසින්ම අනුගමනය කළ යුතු යැයි සිතති.”\n\n“වහන්ස, භාග්‍යවතුන් වහන්සේ මට සංක්ෂිප්තයෙන් ධර්මය දේශනා කළ මැනව. සුගතයන් වහන්සේ සංක්ෂිප්තයෙන් ධර්මය දේශනා කළ මැනව. භාග්‍යවතුන් වහන්සේ වදාළ දේශනාවේ අර්ථය මම අවබෝධ කරගන්නෙම්වා! භාග්‍යවතුන් වහන්සේ වදාළ දේශනාවේ දායාදකරුවෙක් වන්නෙම්වා!”\n\n“එහෙයින් මහණ, තොප විසින් මෙසේ හික්මිය යුතුය: ‘මගේ සිත අභ්‍යන්තරයෙහි පිහිටා, මනා කොට පිහිටා තිබෙන්නේය. හටගත් පාපී අකුසල ධර්මයන් සිත වෙළාගෙන නොසිටින්නේය.’ මහණ, තොප විසින් මෙසේම හික්මිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ සිත අභ්‍යන්තරයෙහි පිහිටා, මනා කොට පිහිටා තිබේද, හටගත් පාපී අකුසල ධර්මයන් සිත වෙළාගෙන නොසිටීද, එවිට මහණ, තොප විසින් මෙසේ හික්මිය යුතුය: ‘මගේ මෙත්තා චේතෝවිමුක්තිය වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක්, යානයක් බඳු වූ, අරමුණක් කොට ගත්, මනාකොට පිහිටුවා ගත්, හොඳින් පුරුදු කරන ලද, මනාකොට අරඹන ලද්දක් වන්නේය.’ මහණ, තොප විසින් මෙසේම හික්මිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක් වේද, එවිට මහණ, තොප විසින් මේ සමාධිය විතර්ක සහිත, විචාර සහිතවද, විතර්ක රහිත, විචාර පමණක් සහිතවද, විතර්ක රහිත, විචාර රහිතවද, ප්‍රීතිය සහිතවද, ප්‍රීති රහිතවද, සැප සහිතවද, උපේක්ෂා සහගතවද වැඩිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, මනාකොට වඩන ලද්දක් වේද, එවිට මහණ, තොප විසින් මෙසේ හික්මිය යුතුය: ‘මගේ කරුණා චේතෝවිමුක්තිය... මුදිතා චේතෝවිමුක්තිය... උපේක්ෂා චේතෝවිමුක්තිය වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක්, යානයක් බඳු වූ, අරමුණක් කොට ගත්, මනාකොට පිහිටුවා ගත්, හොඳින් පුරුදු කරන ලද, මනාකොට අරඹන ලද්දක් වන්නේය.’ මහණ, තොප විසින් මෙසේම හික්මිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, මනාකොට වඩන ලද්දක් වේද, එවිට මහණ, තොප විසින් මේ සමාධිය විතර්ක සහිත, විචාර සහිතවද, විතර්ක රහිත, විචාර පමණක් සහිතවද, විතර්ක රහිත, විචාර රහිතවද, ප්‍රීතිය සහිතවද, ප්‍රීති රහිතවද, සැප සහිතවද, උපේක්ෂා සහගතවද වැඩිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, මනාකොට වඩන ලද්දක් වේද, එවිට මහණ, තොප විසින් මෙසේ හික්මිය යුතුය: ‘කයෙහි කය අනුව දකිමින්, වීර්යවත්ව, මනා සිහි නුවණින් යුතුව, ලෝකයෙහි ඇති දැඩි ලෝභය හා දොම්නස දුරු කොට, මම වාසය කරන්නෙමි.’ මහණ, තොප විසින් මෙසේම හික්මිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක් වේද, එවිට මහණ, තොප විසින් මේ සමාධිය විතර්ක සහිත, විචාර සහිතවද, විතර්ක රහිත, විචාර පමණක් සහිතවද, විතර්ක රහිත, විචාර රහිතවද, ප්‍රීතිය සහිතවද, ප්‍රීති රහිතවද, සැප සහිතවද, උපේක්ෂා සහගතවද වැඩිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, මනාකොට වඩන ලද්දක් වේද, එවිට මහණ, තොප විසින් මෙසේ හික්මිය යුතුය: ‘වේදනාවන්හි වේදනාවන් අනුව දකිමින්, වීර්යවත්ව, මනා සිහි නුවණින් යුතුව, ලෝකයෙහි ඇති දැඩි ලෝභය හා දොම්නස දුරු කොට, මම වාසය කරන්නෙමි.’ ‘සිතෙහි සිත අනුව දකිමින්, වීර්යවත්ව, මනා සිහි නුවණින් යුතුව, ලෝකයෙහි ඇති දැඩි ලෝභය හා දොම්නස දුරු කොට, මම වාසය කරන්නෙමි.’ ‘ධර්මයන්හි ධර්මයන් අනුව දකිමින්, වීර්යවත්ව, මනා සිහි නුවණින් යුතුව, ලෝකයෙහි ඇති දැඩි ලෝභය හා දොම්නස දුරු කොට, මම වාසය කරන්නෙමි.’ මහණ, තොප විසින් මෙසේම හික්මිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක් වේද, එවිට මහණ, තොප විසින් මේ සමාධිය විතර්ක සහිත, විචාර සහිතවද, විතර්ක රහිත, විචාර පමණක් සහිතවද, විතර්ක රහිත, විචාර රහිතවද, ප්‍රීතිය සහිතවද, ප්‍රීති රහිතවද, සැප සහිතවද, උපේක්ෂා සහගතවද වැඩිය යුතුය.”\n\n“මහණ, යම් කලෙක තොපගේ මේ සමාධිය මෙසේ වඩන ලද්දක්, මනාකොට වඩන ලද්දක් වේද, එවිට මහණ, තොප කුමන කුමන තැනකට ගමන් කරන්නේද, සැපසේම ගමන් කරන්නෙහි. කොතැන කොතැන සිටින්නෙහිද, සැපසේම සිටින්නෙහි. කොතැන කොතැන හිඳින්නෙහිද, සැපසේම හිඳින්නෙහි. කොතැන කොතැන සැතපෙන්නේද, සැපසේම සැතපෙන්නෙහි.”\n\nඑවිට ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේ විසින් මේ අනුශාසනාවෙන් අනුශාසනා කරන ලද්දේ, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, පැදකුණු කොට නික්ම ගියේය.\n\nඑසමයෙහි ඒ භික්ෂුව තනිව, හුදෙකලාව, අප්‍රමාදීව, වීර්යවත්ව, අත්දමන ලද සිතින් යුතුව වාසය කරමින්, වැඩි කලක් නොගොස්ම – කුලපුත්‍රයෝ යම් අරමුණක් උදෙසා නිවැරදිව ගිහිගෙයින් නික්ම අනගාරිකත්වයට පැවිදි වෙත් ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යාවේ කෙළවර – මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් ප්‍රත්‍යක්ෂ කොට, සාක්ෂාත් කොට, අවබෝධ කොට වාසය කළේය. \"ජාතිය ක්ෂය විය. බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී. කළ යුතුව තිබූ දේ සිදු කරන ලදී. මේ සඳහා තවදුරටත් කටයුත්තක් නැතැ\"යි ඔහු අවබෝධ කළේය. තවද, ඒ භික්ෂුව රහතන් වහන්සේලා අතරින් එක් නමක් විය.",
      "paliTitle": "Saṃkhittasuttaṃ",
      "englishTitle": "The Brief Discourse",
      "sinhalaTitle": "සංක්ෂිප්ත සූත්‍රය"
    },
    {
      "number": 64,
      "pali": "Ekaṃ samayaṃ bhagavā gayāyaṃ viharati gayāsīse. Tatra kho bhagavā bhikkhū āmantesi… pe… ‘‘pubbāhaṃ, bhikkhave, sambodhā anabhisambuddho bodhisattova samāno obhāsaññeva kho sañjānāmi, no ca rūpāni passāmi’’. ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ rūpāni ca passeyyaṃ; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti. ‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi; no ca kho tāhi devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi. ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti. ‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi; no ca kho tā devatā jānāmi – imā devatā amukamhā vā amukamhā vā devanikāyāti. ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ, tā ca devatā jāneyyaṃ – imā devatā amukamhā vā amukamhā vā devanikāyā’ti; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti. ‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi, tā ca devatā jānāmi – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti; no ca kho tā devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti…pe… tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti; no ca kho tā devatā jānāmi – ‘imā devatā imassa kammassa vipākena evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti …pe… tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti; no ca kho tā devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti…pe… tā ca devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti; no ca kho tā devatā jānāmi yadi vā me imāhi devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti. ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ, tā ca devatā jāneyyaṃ – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti, tā ca devatā jāneyyaṃ – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti, tā ca devatā jāneyyaṃ – ‘imā devatā evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti, tā ca devatā jāneyyaṃ – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti, tā ca devatā jāneyyaṃ yadi vā me imāhi devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti. ‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi, tā ca devatā jānāmi – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti, tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti, tā ca devatā jānāmi – ‘imā devatā evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti, tā ca devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti, tā ca devatā jānāmi yadi vā me devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti. ‘‘Yāvakīvañca me, bhikkhave, evaṃ aṭṭhaparivaṭṭaṃ adhidevañāṇadassanaṃ na suvisuddhaṃ ahosi, neva tāvāhaṃ, bhikkhave, ‘sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddho’ti [abhisambuddho (sī. syā. pī.)] paccaññāsiṃ. Yato ca kho me, bhikkhave, evaṃ aṭṭhaparivaṭṭaṃ adhidevañāṇadassanaṃ suvisuddhaṃ ahosi, athāhaṃ, bhikkhave, ‘sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ; ñāṇañca pana me dassanaṃ udapādi; akuppā me cetovimutti [vimutti (ka. sī. ka.)]; ayamantimā jāti natthi dāni punabbhavo’’ti. Catutthaṃ.",
      "english": "At one time the Blessed One was staying in Gayā, at Gayā Head. There, indeed, the Blessed One addressed the bhikkhus, saying:\n\n“Monks, before my full enlightenment, while I was still an unenlightened Bodhisatta, I perceived only light, but I did not see forms.”\n\n“Then, monks, it occurred to me: ‘If I were to perceive light and also see forms, then this knowledge and vision of mine would be much purer.’”\n\n“So, monks, at a later time, dwelling heedfully, ardently, and with resolute mind, I perceived light and also saw forms; yet I did not stand, converse, or engage in discussion with those devas.”\n\n“Then, monks, it occurred to me: ‘If I were to perceive light, see forms, and also stand, converse, and engage in discussion with those devas, then this knowledge and vision of mine would be much purer.’”\n\n“So, monks, at a later time, dwelling heedfully, ardently, and with resolute mind, I perceived light, saw forms, stood, conversed, and engaged in discussion with those devas; yet I did not know those devas—that ‘these devas belong to such and such a class of devas or such and such a class of devas.’”\n\n“Then, monks, it occurred to me: ‘If I were to perceive light, see forms, stand, converse, and engage in discussion with those devas, and also know those devas—that ‘these devas belong to such and such a class of devas or such and such a class of devas’—then this knowledge and vision of mine would be much purer.’”\n\n“So, monks, at a later time, dwelling heedfully, ardently, and with resolute mind, I perceived light, saw forms, stood, conversed, and engaged in discussion with those devas, and I knew those devas—that ‘these devas belong to such and such a class of devas or such and such a class of devas’; yet I did not know those devas—that ‘these devas, due to the result of such and such kamma, have passed away from here and reappeared there.’ Subsequently, I came to know those devas—that ‘these devas, due to the result of such and such kamma, have passed away from here and reappeared there’; yet I did not know those devas—that ‘these devas, due to the result of such and such kamma, are thus nourished and thus experience pleasure and pain.’ Subsequently, I came to know those devas—that ‘these devas, due to the result of such and such kamma, are thus nourished and thus experience pleasure and pain’; yet I did not know those devas—that ‘these devas are thus long-lived and thus long-lasting.’ Subsequently, I came to know those devas—that ‘these devas are thus long-lived and thus long-lasting’; yet I did not know whether I had dwelt together with these devas before or not.”\n\n“Then, monks, it occurred to me: ‘If I were to perceive light, see forms, stand, converse, and engage in discussion with those devas, and also know those devas—that ‘these devas belong to such and such a class of devas or such and such a class of devas,’ and also know those devas—that ‘these devas, due to the result of such and such kamma, have passed away from here and reappeared there,’ and also know those devas—that ‘these devas are thus nourished and thus experience pleasure and pain,’ and also know those devas—that ‘these devas are thus long-lived and thus long-lasting,’ and also know whether I had dwelt together with these devas before or not; then this knowledge and vision of mine would be much purer.’”\n\n“So, monks, at a later time, dwelling heedfully, ardently, and with resolute mind, I perceived light, saw forms, stood, conversed, and engaged in discussion with those devas, and I knew those devas—that ‘these devas belong to such and such a class of devas or such and such a class of devas,’ and I knew those devas—that ‘these devas, due to the result of such and such kamma, have passed away from here and reappeared there,’ and I knew those devas—that ‘these devas are thus nourished and thus experience pleasure and pain,’ and I knew those devas—that ‘these devas are thus long-lived and thus long-lasting,’ and I knew whether I had dwelt together with these devas before or not.”\n\n“And, monks, as long as this divine knowledge and vision of mine, perfected in these eight aspects, was not utterly purified, I did not declare myself, monks, to have awakened to the unexcelled perfect self-awakening in this world with its devas, Māras, and Brahmās, among the ascetics and brahmins, and among this generation of devas and humans.”\n\nAnd when, O bhikkhus, this eightfold perfected superhuman knowledge and vision of mine became utterly purified, then I, O bhikkhus, declared: 'In this world, with its devas, Māras, and Brahmās, and its population of ascetics and brahmins, devas and humans, I have perfectly awakened to the unexcelled complete enlightenment.' And for me, knowledge and vision arose: 'My liberation of mind is unshakeable; this is my last birth; there is now no further becoming.'",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ගයාවේ, ගයාශීර්ෂයේ වැඩසිටි සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: \"මහණෙනි, මම සම්බුද්ධත්වයට පත් නොවූ, අවබෝධය නොලැබූ බෝධිසත්වයෙකු ලෙස සිටියදී, ආලෝකය පමණක් දැනගත්තෙමි, එහෙත් රූප නොදුටුවෙමි.\"\n\n\"මහණෙනි, එවිට මට මෙසේ සිතුණි: ‘යම් හෙයකින් මම ආලෝකයද දැනගත්තෙම් නම්, රූපද දුටුවෙම් නම්, මෙලෙස මාගේ මේ ඥානදර්ශනය වඩාත් පිරිසිදු වන්නේය’.\"\n\n\"මහණෙනි, ඉන්පසු මම අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, සිත යොමු කරමින් වාසය කරද්දී, ආලෝකයද දැනගත්තෙමි, රූපද දුටුවෙමි; එහෙත් ඒ දෙවිවරුන් සමග නොසිටියෙමි, කථා නොකළෙමි, සාකච්ඡා නොකළෙමි.\"\n\n\"මහණෙනි, එවිට මට මෙසේ සිතුණි: ‘යම් හෙයකින් මම ආලෝකයද දැනගත්තෙම් නම්, රූපද දුටුවෙම් නම්, ඒ දෙවිවරුන් සමගද සිටියෙම් නම්, කථා කළෙම් නම්, සාකච්ඡා කළෙම් නම්, මෙලෙස මාගේ මේ ඥානදර්ශනය වඩාත් පිරිසිදු වන්නේය’.\"\n\n\"මහණෙනි, ඉන්පසු මම අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, සිත යොමු කරමින් වාසය කරද්දී, ආලෝකයද දැනගත්තෙමි, රූපද දුටුවෙමි, ඒ දෙවිවරුන් සමගද සිටියෙමි, කථා කළෙමි, සාකච්ඡා කළෙමි; එහෙත් ඒ දෙවිවරුන් කුමන දෙව්ලොවින් පැමිණි අයදැයි නොදැන සිටියෙමි.\"\n\n\"මහණෙනි, එවිට මට මෙසේ සිතුණි: ‘යම් හෙයකින් මම ආලෝකයද දැනගත්තෙම් නම්, රූපද දුටුවෙම් නම්, ඒ දෙවිවරුන් සමගද සිටියෙම් නම්, කථා කළෙම් නම්, සාකච්ඡා කළෙම් නම්, ඒ දෙවිවරුන් කුමන දෙව්ලොවින් පැමිණි අයදැයි දැනගත්තෙම් නම්, මෙලෙස මාගේ මේ ඥානදර්ශනය වඩාත් පිරිසිදු වන්නේය’.\"\n\n\"මහණෙනි, ඉන්පසු මම අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, සිත යොමු කරමින් වාසය කරද්දී, ආලෝකයද දැනගත්තෙමි, රූපද දුටුවෙමි, ඒ දෙවිවරුන් සමගද සිටියෙමි, කථා කළෙමි, සාකච්ඡා කළෙමි, ඒ දෙවිවරුන් කුමන දෙව්ලොවින් පැමිණි අයදැයි දැනගත්තෙමි; එහෙත් ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් මෙතැනින් චුතව (මිය ගොස්) කොහි උපන්නෝදැයි නොදැන සිටියෙමි. පසුව මම ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් මෙතැනින් චුතව කොහි උපන්නෝදැයි දැනගත්තෙමි; එහෙත් ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් කවර ආහාර ඇත්තෝද, කෙසේ සැපදුක් විඳින්නෝදැයි නොදැන සිටියෙමි. පසුව මම ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් කවර ආහාර ඇත්තෝද, කෙසේ සැපදුක් විඳින්නෝදැයි දැනගත්තෙමි; එහෙත් ඒ දෙවිවරුන් කෙතරම් දීර්ඝායුෂ ඇත්තෝද, කෙතරම් කලක් පවතින්නෝදැයි නොදැන සිටියෙමි. පසුව මම ඒ දෙවිවරුන් කෙතරම් දීර්ඝායුෂ ඇත්තෝද, කෙතරම් කලක් පවතින්නෝදැයි දැනගත්තෙමි; එහෙත් මට ඒ දෙවිවරුන් සමග පෙර වාසය කර තිබේද, නැද්ද යන්න නොදැන සිටියෙමි.\"\n\n\"මහණෙනි, එවිට මට මෙසේ සිතුණි: ‘යම් හෙයකින් මම ආලෝකයද දැනගත්තෙම් නම්, රූපද දුටුවෙම් නම්, ඒ දෙවිවරුන් සමගද සිටියෙම් නම්, කථා කළෙම් නම්, සාකච්ඡා කළෙම් නම්, ඒ දෙවිවරුන් කුමන දෙව්ලොවින් පැමිණි අයදැයි දැනගත්තෙම් නම්, ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් මෙතැනින් චුතව කොහි උපන්නෝදැයි දැනගත්තෙම් නම්, ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් කවර ආහාර ඇත්තෝද, කෙසේ සැපදුක් විඳින්නෝදැයි දැනගත්තෙම් නම්, ඒ දෙවිවරුන් කෙතරම් දීර්ඝායුෂ ඇත්තෝද, කෙතරම් කලක් පවතින්නෝදැයි දැනගත්තෙම් නම්, මට ඒ දෙවිවරුන් සමග පෙර වාසය කර තිබේද, නැද්ද යන්නද දැනගත්තෙම් නම්, මෙලෙස මාගේ මේ ඥානදර්ශනය වඩාත් පිරිසිදු වන්නේය’.\"\n\n\"මහණෙනි, ඉන්පසු මම අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, සිත යොමු කරමින් වාසය කරද්දී, ආලෝකයද දැනගත්තෙමි, රූපද දුටුවෙමි, ඒ දෙවිවරුන් සමගද සිටියෙමි, කථා කළෙමි, සාකච්ඡා කළෙමි, ඒ දෙවිවරුන් කුමන දෙව්ලොවින් පැමිණි අයදැයි දැනගත්තෙමි, ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් මෙතැනින් චුතව කොහි උපන්නෝදැයි දැනගත්තෙමි, ඒ දෙවිවරුන් කුමන කර්මයක විපාකයෙන් කවර ආහාර ඇත්තෝද, කෙසේ සැපදුක් විඳින්නෝදැයි දැනගත්තෙමි, ඒ දෙවිවරුන් කෙතරම් දීර්ඝායුෂ ඇත්තෝද, කෙතරම් කලක් පවතින්නෝදැයි දැනගත්තෙමි, මට ඒ දෙවිවරුන් සමග පෙර වාසය කර තිබේද, නැද්ද යන්නද දැනගත්තෙමි.\"\n\n\"මහණෙනි, මාගේ මේ අෂ්ට පරිවර්තන සහිත අධිදේව ඥානදර්ශනය යම්තාක් කල් මැනවින් පිරිසිදු නොවීද, එතෙක් කල් මම, මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ-බ්‍රාහ්මණ ප්‍රජාවන් සහිත, දෙවිමිනිසුන් සහිත මේ ලෝකයෙහි නිරුත්තර සම්‍යක් සම්බෝධිය අවබෝධ කළායැයි ප්‍රතිඥා නොදුන්නෙමි.\"\n\nමහණෙනි, මා හට මෙලෙසින් අට වැදෑරුම් වූ අධිදේව ඥානදර්ශනය මැනවින් පිරිසිදු වූයේ යම් කලක ද, එකල්හි මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ‍්‍රමණ බ‍්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත ලෝකයෙහි අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළා යැයි මම ප‍්‍රත්‍යඥා කළෙමි. තව ද, මා හට ඥානය ද දර්ශනය ද පහළ විය. මාගේ චේතෝවිමුක්තිය නොසෙල්වෙන්නකි. මෙය අවසන් ජාතිය යි. දැන් නැවත භවයක් නොමැත.",
      "paliTitle": "Gayāsīsasuttaṃ",
      "englishTitle": "Gayasisa Sutta",
      "sinhalaTitle": "ගයාසීස සූත‍්‍රය"
    },
    {
      "number": 65,
      "pali": "[dī. ni. 3.338, 358; a. ni. 10.29] ‘‘Aṭṭhimāni, bhikkhave, abhibhāyatanāni. Katamāni aṭṭha? Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ paṭhamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ dutiyaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ tatiyaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ catutthaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ pañcamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ chaṭṭhaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ sattamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ aṭṭhamaṃ abhibhāyatanaṃ. Imāni kho, bhikkhave, aṭṭha abhibhāyatanānī’’ti. Pañcamaṃ.",
      "english": "“Monks, there are these eight bases for mastery. Which eight?\n\nIn the first case, one who perceives forms internally sees external forms that are limited, both beautiful and ugly. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the first base for mastery.\n\nIn the second case, one who perceives forms internally sees external forms that are vast, both beautiful and ugly. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the second base for mastery.\n\nIn the third case, one who does not perceive forms internally sees external forms that are limited, both beautiful and ugly. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the third base for mastery.\n\nIn the fourth case, one who does not perceive forms internally sees external forms that are vast, both beautiful and ugly. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the fourth base for mastery.\n\nIn the fifth case, one who does not perceive forms internally sees external forms that are blue, blue in color, blue in appearance, blue in luster. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the fifth base for mastery.\n\nIn the sixth case, one who does not perceive forms internally sees external forms that are yellow, yellow in color, yellow in appearance, yellow in luster. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the sixth base for mastery.\n\nIn the seventh case, one who does not perceive forms internally sees external forms that are red, red in color, red in appearance, red in luster. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the seventh base for mastery.\n\nIn the eighth case, one who does not perceive forms internally sees external forms that are white, white in color, white in appearance, white in luster. One is thus aware: ‘Having mastered these, I know and I see them.’ This is the eighth base for mastery.\n\nThese, Monks, are the eight bases for mastery.”",
      "sinhala": "මහණෙනි, මේ අභිභායතන අටකි. ඒ අට කවරේද?\n\nතමා තුළ රූප සංඥා ඇති එක් භික්ෂුවක්, පිටතින් ඇති කුඩා, මනරම් හෝ අමනරම් රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය පළමුවන අභිභායතනයයි.\n\nතමා තුළ රූප සංඥා ඇති එක් භික්ෂුවක්, පිටතින් ඇති අප්‍රමාණ, මනරම් හෝ අමනරම් රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය දෙවන අභිභායතනයයි.\n\nතමා තුළ රූප සංඥා නැති එක් භික්ෂුවක්, පිටතින් ඇති කුඩා, මනරම් හෝ අමනරම් රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය තෙවන අභිභායතනයයි.\n\nතමා තුළ රූප සංඥා නැති එක් භික්ෂුවක්, පිටතින් ඇති අප්‍රමාණ, මනරම් හෝ අමනරම් රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය සිව්වන අභිභායතනයයි.\n\nතමා තුළ රූප සංඥා නැති එක් භික්ෂුවක්, පිටතින් ඇති නිල්වන්, නිල් පැහැයෙන් යුත්, නිල් පැහැයෙන් පෙනෙන, නිල් පැහැයෙන් බැබලෙන රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය පස්වන අභිභායතනයයි.\n\nතමා තුළ රූප සංඥා නැති එක් භික්ෂුවක්, පිටතින් ඇති කහවන්, කහ පැහැයෙන් යුත්, කහ පැහැයෙන් පෙනෙන, කහ පැහැයෙන් බැබලෙන රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය සයවන අභිභායතනයයි.\n\nතමා තුළ රූප සංඥා නැති එක් භික්ෂුවක්, පිටතින් ඇති රතු පැහැති, රතු පැහැයෙන් යුත්, රතු පැහැයෙන් පෙනෙන, රතු පැහැයෙන් බැබලෙන රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය සත්වන අභිභායතනයයි.\n\nතමා තුළ රූප සංඥා නැති එක් භික්ෂුවක්, පිටතින් ඇති සුදු පැහැති, සුදු පැහැයෙන් යුත්, සුදු පැහැයෙන් පෙනෙන, සුදු පැහැයෙන් බැබලෙන රූප දකියි. 'ඒවා අභිබවා මම දැනගනිමි, දකිමි' යන සංඥාව ඔහුට ඇතිවේ. මෙය අටවන අභිභායතනයයි.\n\nමහණෙනි, මේවා අභිභායතන අටයි.",
      "paliTitle": "Abhibhāyatanasuttaṃ",
      "englishTitle": "Discourse on the Spheres of Mastery",
      "sinhalaTitle": "අභිභායතන සූත්‍රය"
    },
    {
      "number": 66,
      "pali": "‘‘Aṭṭhime, bhikkhave, vimokkhā. Katame aṭṭha? Rūpī rūpāni passati. Ayaṃ paṭhamo vimokkho. ‘‘Ajjhattaṃ arūpasaññī, bahiddhā [arūpasaññī eko bahiddhā (syā. pī. ka.) dī. ni. 2.129; dī. ni. 3.338, 358; a. ni. 8.119; ma. ni. 2.248 passitabbaṃ] rūpāni passati. Ayaṃ dutiyo vimokkho. ‘‘Subhanteva adhimutto hoti. Ayaṃ tatiyo vimokkho. ‘‘Sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Ayaṃ catuttho vimokkho. ‘‘Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Ayaṃ pañcamo vimokkho. ‘‘Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Ayaṃ chaṭṭho vimokkho. ‘‘Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Ayaṃ sattamo vimokkho. ‘‘Sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati. Ayaṃ aṭṭhamo vimokkho. Ime kho, bhikkhave, aṭṭha vimokkhā’’ti. Chaṭṭhaṃ.",
      "english": "These, monks, are the eight liberations. Which eight? The first liberation is when one, being of material form, sees material forms. The second liberation is when, internally mindful of formlessness, one sees material forms externally. The third liberation is when one is intent upon the beautiful. The fourth liberation is when, with the complete transcending of perceptions of form, with the disappearance of perceptions of sensory impingement, and with not attending to perceptions of diversity, one enters and abides in the dimension of infinite space, perceiving ‘Space is infinite’. The fifth liberation is when, with the complete transcending of the dimension of infinite space, one enters and abides in the dimension of infinite consciousness, perceiving ‘Consciousness is infinite’. The sixth liberation is when, with the complete transcending of the dimension of infinite consciousness, one enters and abides in the dimension of nothingness, perceiving ‘There is nothing’. The seventh liberation is when, with the complete transcending of the dimension of nothingness, one enters and abides in the dimension of neither perception nor non-perception. The eighth liberation is when, with the complete transcending of the dimension of neither perception nor non-perception, one enters and abides in the cessation of perception and feeling. These, monks, are the eight liberations.",
      "sinhala": "මහණෙනි, මේ අෂ්ට විමොක්ෂයෝ වෙති.\n\nඒ අට කවරහුද?\n\nරූපය ඇති තැනැත්තා රූපයන් දකියි. මෙය පළමුවන විමොක්ෂයයි.\n\nතමා තුළ අරූප සංඥාව ඇතිව, පිටතින් රූපයන් දකියි. මෙය දෙවන විමොක්ෂයයි.\n\nසුභය යනුවෙන් ම අධිමුක්තව වාසය කරයි. මෙය තෙවන විමොක්ෂයයි.\n\nසියලු ආකාරයෙන් රූප සංඥාවන් ඉක්මවීමෙන් ද, ප්‍ර​තිඝ සංඥාවන් නැති කිරීමෙන් ද, නානත්ව සංඥාවන් අමනසිකාර කිරීමෙන් ද, ‘ආකාශය අනන්තයි’ යැයි මෙනෙහි කරමින් ආකාශානන්ත්‍යා​යතනයට පැමිණ වාසය කරයි. මෙය සතරවන විමොක්ෂයයි.\n\nසියලු ආකාරයෙන් ආකාශානන්ත්‍යා​යතනය ඉක්මවා, ‘විඥානය අනන්තයි’ යැයි මෙනෙහි කරමින් විඥානානන්ත්‍යා​යතනයට පැමිණ වාසය කරයි. මෙය පස්වන විමොක්ෂයයි.\n\nසියලු ආකාරයෙන් විඥානානන්ත්‍යා​යතනය ඉක්මවා, ‘කිසිවක් නැතැයි’ යැයි මෙනෙහි කරමින් ආකිංචඤ්ඤායතනයට පැමිණ වාසය කරයි. මෙය සයවන විමොක්ෂයයි.\n\nසියලු ආකාරයෙන් ආකිංචඤ්ඤායතනය ඉක්මවා, නේවසංඥානාසංඥායතනයට පැමිණ වාසය කරයි. මෙය සත්වන විමොක්ෂයයි.\n\nසියලු ආකාරයෙන් නේවසංඥානාසංඥායතනය ඉක්මවා, සංඥාවේදයිතනිරෝධයට පැමිණ වාසය කරයි. මෙය අටවන විමොක්ෂයයි.\n\nමහණෙනි, මේ අෂ්ට විමොක්ෂයෝ වෙති.",
      "paliTitle": "Vimokkhasuttaṃ",
      "englishTitle": "Discourse on Deliverance",
      "sinhalaTitle": "විමෝක්‍ෂ සූත්‍රය"
    },
    {
      "number": 67,
      "pali": "‘‘Aṭṭhime, bhikkhave, anariyavohārā. Katame aṭṭha? Adiṭṭhe diṭṭhavāditā, asute sutavāditā, amute mutavāditā, aviññāte viññātavāditā, diṭṭhe adiṭṭhavāditā, sute asutavāditā, mute amutavāditā, viññāte aviññātavāditā. Ime kho, bhikkhave, aṭṭha anariyavohārā’’ti. Sattamaṃ.",
      "english": "Monks, these are the eight ignoble ways of speaking: declaring as seen that which was not seen; declaring as heard that which was not heard; declaring as sensed that which was not sensed; declaring as known that which was not known; declaring as not seen that which was seen; declaring as not heard that which was heard; declaring as not sensed that which was sensed; declaring as not known that which was known. These, monks, are the eight ignoble ways of speaking.",
      "sinhala": "අටක් වූ මේ, මහණෙනි, අනාරිය ව්‍යවහාරයෝ වෙති. ඒ අට කවරේද යත්: නොදුටු දෙයක් දුටුවා යැයි කීම, නොඇසූ දෙයක් ඇසූවා යැයි කීම, නොවිඳින ලද දෙයක් විඳින ලදැයි කීම, නොදැනගත් දෙයක් දැනගත් යැයි කීම, දුටු දෙයක් නොදුටුවා යැයි කීම, ඇසූ දෙයක් නොඇසූවා යැයි කීම, විඳින ලද දෙයක් නොවිඳින ලදැයි කීම, දැනගත් දෙයක් නොදැනගත් යැයි කීම යන මේවාය. මහණෙනි, මේ අට අනාරිය ව්‍යවහාරයෝ වෙති.",
      "paliTitle": "Anariyavohārasuttaṃ",
      "englishTitle": "Discourse on Ignoble Speech",
      "sinhalaTitle": "අනාරිය ව්‍යවහාර සූත්‍රය"
    },
    {
      "number": 68,
      "pali": "‘‘Aṭṭhime, bhikkhave, ariyavohārā. Katame aṭṭha? Adiṭṭhe adiṭṭhavāditā, asute asutavāditā, amute amutavāditā, aviññāte aviññātavāditā, diṭṭhe diṭṭhavāditā, sute sutavāditā, mute mutavāditā, viññāte viññātavāditā. Ime kho, bhikkhave, aṭṭha ariyavohārā’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, these are the eight noble ways of speaking. Which eight?\nSpeaking of the unseen as unseen; speaking of the unheard as unheard; speaking of the unsensed as unsensed; speaking of the unknown as unknown.\nSpeaking of the seen as seen; speaking of the heard as heard; speaking of the sensed as sensed; speaking of the known as known.\nIndeed, monks, these are the eight noble ways of speaking.”",
      "sinhala": "භික්ෂූනි, මේවා ආර්‍ය ව්‍යවහාර අටකි. කවරේද ඒ අට? නොදුටු දෙය නොදුටු බව පැවසීම, නොඇසූ දෙය නොඇසූ බව පැවසීම, නොවිඳි දෙය නොවිඳි බව පැවසීම, නොදැනගත් දෙය නොදැනගත් බව පැවසීම; දුටු දෙය දුටු බව පැවසීම, ඇසූ දෙය ඇසූ බව පැවසීම, විඳි දෙය විඳි බව පැවසීම, දැනගත් දෙය දැනගත් බව පැවසීම යනුයි. මහණෙනි, මේවා ඇත්තෙන්ම ආර්‍ය ව්‍යවහාර අටකි.",
      "paliTitle": "Ariyavohārasuttaṃ",
      "englishTitle": "The Discourse on Noble Speech",
      "sinhalaTitle": "ආර්‍ය ව්‍යවහාර සූත්‍රය"
    },
    {
      "number": 69,
      "pali": "‘‘Aṭṭhimā, bhikkhave, parisā. Katamā aṭṭha? Khattiyaparisā, brāhmaṇaparisā, gahapatiparisā, samaṇaparisā, cātumahārājikaparisā, tāvatiṃsaparisā, māraparisā, brahmaparisā. Abhijānāmi kho panāhaṃ, bhikkhave, anekasataṃ khattiyaparisaṃ upasaṅkamitā. Tatrapi mayā sannisinnapubbañceva sallapitapubbañca sākacchā ca samāpannapubbā. Tattha yādisako tesaṃ vaṇṇo hoti tādisako mayhaṃ vaṇṇo hoti, yādisako tesaṃ saro hoti tādisako mayhaṃ saro hoti. Dhammiyā ca kathāya sandassemi samādapemi samuttejemi sampahaṃsemi. Bhāsamānañca maṃ na jānanti – ‘ko nu kho ayaṃ bhāsati devo vā manusso vā’ti. Dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā antaradhāyāmi. Antarahitañca maṃ na jānanti – ‘ko nu kho ayaṃ antarahito devo vā manusso vā’’’ti. ‘‘Abhijānāmi kho panāhaṃ, bhikkhave, anekasataṃ brāhmaṇaparisaṃ…pe… gahapatiparisaṃ… samaṇaparisaṃ… cātumahārājikaparisaṃ… tāvatiṃsaparisaṃ… māraparisaṃ… brahmaparisaṃ upasaṅkamitā. Tatrapi mayā sannisinnapubbañceva sallapitapubbañca sākacchā ca samāpannapubbā. Tattha yādisako tesaṃ vaṇṇo hoti tādisako mayhaṃ vaṇṇo hoti, yādisako tesaṃ saro hoti tādisako mayhaṃ saro hoti. Dhammiyā ca kathāya sandassemi samādapemi samuttejemi sampahaṃsemi. Bhāsamānañca maṃ na jānanti – ‘ko nu kho ayaṃ bhāsati devo vā manusso vā’ti. Dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā antaradhāyāmi. Antarahitañca maṃ na jānanti – ‘ko nu kho ayaṃ antarahito devo vā manusso vā’ti. Imā kho, bhikkhave, aṭṭha parisā’’ti. Navamaṃ.",
      "english": "Monks, there are these eight assemblies. Which eight? The assembly of nobles, the assembly of brahmins, the assembly of householders, the assembly of ascetics, the assembly of the Four Great Kings, the assembly of the Tāvatiṃsa devas, the assembly of Māra, and the assembly of Brahmā. And I recollect, monks, having approached many hundreds of assemblies of nobles. There too, I have previously sat together with them, conversed with them, and engaged in discussions. Whatever their appearance was, such was my appearance; whatever their voice was, such was my voice. And with a discourse on the Dhamma, I instructed, encouraged, inspired, and gladdened them. And while I was speaking, they did not recognize me, thinking, \"Who is this who speaks? Is it a god or a human being?\" After instructing, encouraging, inspiring, and gladdening them with a discourse on the Dhamma, I disappeared. And after I had disappeared, they did not recognize me, thinking, \"Who is this who has disappeared? Is it a god or a human being?\"\n\nI recollect, monks, having approached many hundreds of assemblies of brahmins, many hundreds of assemblies of householders, many hundreds of assemblies of ascetics, many hundreds of assemblies of the Four Great Kings, many hundreds of assemblies of the Tāvatiṃsa devas, many hundreds of assemblies of Māra, and many hundreds of assemblies of Brahmā. There too, I have previously sat together with them, conversed with them, and engaged in discussions. Whatever their appearance was, such was my appearance; whatever their voice was, such was my voice. And with a discourse on the Dhamma, I instructed, encouraged, inspired, and gladdened them. And while I was speaking, they did not recognize me, thinking, \"Who is this who speaks? Is it a god or a human being?\" After instructing, encouraging, inspiring, and gladdening them with a discourse on the Dhamma, I disappeared. And after I had disappeared, they did not recognize me, thinking, \"Who is this who has disappeared? Is it a god or a human being?\"\n\nThese, monks, are the eight assemblies.",
      "sinhala": "භික්ෂූණි, මේ සභා අටක් ඇත. ඒ අට කවරේද? ක්ෂත්‍රිය පිරිස, බ්‍රාහ්මණ පිරිස, ගෘහපති පිරිස, ශ්‍රමණ පිරිස, චාතුමහාරාජික පිරිස, තාවතිංස පිරිස, මාර පිරිස, බ්‍රහ්ම පිරිස යන මේවාය. භික්ෂූණි, මා විසින් බොහෝ සිය ගණන් ක්ෂත්‍රිය පිරිස් වෙත එළඹුණු බව මම දනිමි. එහිදී ද මා විසින් කලින් හිඳගෙන සිටි බවත්, කලින් කතාබස් කළ බවත්, සාකච්ඡා පැවැත්වූ බවත් වෙයි. එහිදී ඔවුන්ගේ යම් ස්වරූපයක් වේද, මාගේ ස්වරූපය ද එවැනිම වේ. ඔවුන්ගේ යම් හඬක් වේද, මාගේ හඬ ද එවැනිම වේ. තවද, මම ඔවුන්ට ධර්මයෙන් කරුණු පැහැදිලි කරමි, සමාදන් කරවමි, උනන්දු කරවමි, සතුටු කරමි. මා ධර්ම දේශනා කරන කල්හි මොහු කවරෙක්ද, දෙවියෙක්ද, මනුෂ්‍යයෙක්දැයි ඔවුහු නොදනිති. ධර්මයෙන් කරුණු පැහැදිලි කරවා, සමාදන් කරවා, උනන්දු කරවා, සතුටු කරවා, මම අතුරුදහන් වෙමි. මා අතුරුදහන් වූ කල්හි මොහු කවරෙක්ද, දෙවියෙක්ද, මනුෂ්‍යයෙක්දැයි ඔවුහු නොදනිති.\n\nභික්ෂූණි, මා විසින් බොහෝ සිය ගණන් බ්‍රාහ්මණ පිරිස් වෙතද, ගෘහපති පිරිස් වෙතද, ශ්‍රමණ පිරිස් වෙතද, චාතුමහාරාජික පිරිස් වෙතද, තාවතිංස පිරිස් වෙතද, මාර පිරිස් වෙතද, බ්‍රහ්ම පිරිස් වෙතද එළඹුණු බව මම දනිමි. එහිදී ද මා විසින් කලින් හිඳගෙන සිටි බවත්, කලින් කතාබස් කළ බවත්, සාකච්ඡා පැවැත්වූ බවත් වෙයි. එහිදී ඔවුන්ගේ යම් ස්වරූපයක් වේද, මාගේ ස්වරූපය ද එවැනිම වේ. ඔවුන්ගේ යම් හඬක් වේද, මාගේ හඬ ද එවැනිම වේ. තවද, මම ඔවුන්ට ධර්මයෙන් කරුණු පැහැදිලි කරමි, සමාදන් කරවමි, උනන්දු කරවමි, සතුටු කරමි. මා ධර්ම දේශනා කරන කල්හි මොහු කවරෙක්ද, දෙවියෙක්ද, මනුෂ්‍යයෙක්දැයි ඔවුහු නොදනිති. ධර්මයෙන් කරුණු පැහැදිලි කරවා, සමාදන් කරවා, උනන්දු කරවා, සතුටු කරවා, මම අතුරුදහන් වෙමි. මා අතුරුදහන් වූ කල්හි මොහු කවරෙක්ද, දෙවියෙක්ද, මනුෂ්‍යයෙක්දැයි ඔවුහු නොදනිති. භික්ෂූණි, මේ සභා අට මේවාය.\n\nනවවැනිය.",
      "paliTitle": "Parisāsuttaṃ",
      "englishTitle": "The Assembly Discourse",
      "sinhalaTitle": "පරිසා සූත්‍රය"
    },
    {
      "number": 70,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘gaṇhāhi, ānanda, nisīdanaṃ. Yena cāpālaṃ cetiyaṃ [pāvālacetiyaṃ (syā.), cāpālacetiyaṃ (pī. ka.)] tenupasaṅkamissāma divāvihārāyā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi. Atha kho bhagavā yena cāpālaṃ cetiyaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtakaṃ cetiyaṃ; ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti, yathā taṃ mārena pariyuṭṭhitacitto. Dutiyampi kho bhagavā…pe… tatiyampi kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtakaṃ cetiyaṃ, ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā…pe… ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti, yathā taṃ mārena pariyuṭṭhitacitto. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gaccha tvaṃ [gaccha kho tvaṃ (saṃ. ni. 5.822) udā. 51 passitabbaṃ], ānanda, yassa dāni kālaṃ maññasī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā bhagavato avidūre aññatarasmiṃ rukkhamūle nisīdi. Atha kho māro pāpimā acirapakkante āyasmante ānande bhagavantaṃ etadavoca – ‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā pattayogakkhemā [idaṃ padaṃ dī. ni. 2.168 ca saṃ. ni. 5.822 ca na dissati] bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’ti. Etarahi, bhante, bhikkhū bhagavato sāvakā viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. ‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhuniyo na sāvikā bhavissanti…pe… yāva me upāsakā na sāvakā bhavissanti…pe… yāva me upāsikā na sāvikā bhavissanti viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’ti. Etarahi, bhante, upāsikā bhagavato sāvikā viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. ‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me idaṃ brahmacariyaṃ na iddhañceva bhavissati phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ, yāva devamanussehi suppakāsita’nti. Etarahi, bhante, bhagavato brahmacariyaṃ iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ, yāva devamanussehi suppakāsitaṃ. ‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato’’ti. ‘‘Appossukko tvaṃ, pāpima, hohi. Naciraṃ tathāgatassa parinibbānaṃ bhavissati. Ito tiṇṇaṃ māsānaṃ accayena tathāgato parinibbāyissatī’’ti. Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṃ ossaji. Ossaṭṭhe ca bhagavatā āyusaṅkhāre mahābhūmicālo ahosi bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi – ‘‘Tulamatulañca sambhavaṃ, bhavasaṅkhāramavassaji muni; Ajjhattarato samāhito, abhindi kavacamivattasambhava’’nti. Atha kho āyasmato ānandassa etadahosi – ‘‘mahā vatāyaṃ bhūmicālo; sumahā vatāyaṃ bhūmicālo bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Ko nu kho hetu, ko paccayo mahato bhūmicālassa pātubhāvāyā’’ti? Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘mahā vatāyaṃ, bhante, bhūmicālo; sumahā vatāyaṃ, bhante, bhūmicālo bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Ko nu kho, bhante, hetu, ko paccayo mahato bhūmicālassa pātubhāvāyā’’ti? ‘‘Aṭṭhime, ānanda, hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāya. Katame aṭṭha? Ayaṃ, ānanda, mahāpathavī udake patiṭṭhitā; udakaṃ vāte patiṭṭhitaṃ; vāto ākāsaṭṭho hoti. So, ānanda, samayo yaṃ mahāvātā vāyanti; mahāvātā vāyantā udakaṃ kampenti; udakaṃ kampitaṃ pathaviṃ kampeti. Ayaṃ, ānanda, paṭhamo hetu, paṭhamo paccayo mahato bhūmicālassa pātubhāvāya. ‘‘Puna caparaṃ, ānanda, samaṇo vā brāhmaṇo vā iddhimā cetovasippatto devatā vā mahiddhikā mahānubhāvā. Tassa parittā pathavīsaññā bhāvitā hoti, appamāṇā āposaññā. So imaṃ pathaviṃ kampeti saṅkampeti sampakampeti sampavedheti. Ayaṃ, ānanda, dutiyo hetu, dutiyo paccayo mahato bhūmicālassa pātubhāvāya. ‘‘Puna caparaṃ, ānanda, yadā bodhisatto tusitā kāyā cavitvā sato sampajāno mātukucchiṃ okkamati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, tatiyo hetu; tatiyo paccayo mahato bhūmicālassa pātubhāvāya. ‘‘Puna caparaṃ, ānanda, yadā bodhisatto sato sampajāno mātukucchismā nikkhamati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, catuttho hetu, catuttho paccayo mahato bhūmicālassa pātubhāvāya. ‘‘Puna caparaṃ, ānanda, yadā tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, pañcamo hetu, pañcamo paccayo mahato bhūmicālassa pātubhāvāya. ‘‘Puna caparaṃ, ānanda, yadā tathāgato anuttaraṃ dhammacakkaṃ pavatteti, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, chaṭṭho hetu, chaṭṭho paccayo mahato bhūmicālassa pātubhāvāya. ‘‘Puna caparaṃ, ānanda, yadā tathāgato sato sampajāno āyusaṅkhāraṃ ossajjati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, sattamo hetu, sattamo paccayo mahato bhūmicālassa pātubhāvāya. ‘‘Puna caparaṃ, ānanda, yadā tathāgato anupādisesāya nibbānadhātuyā parinibbāyati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, aṭṭhamo hetu, aṭṭhamo paccayo mahato bhūmicālassa pātubhāvāya. Ime kho, ānanda, aṭṭha hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāyā’’ti. Dasamaṃ. ",
      "english": "On one occasion, the Blessed One was staying at Vesāli, in the Great Wood, in the Hall with the Gabled Roof. Then, in the forenoon, the Blessed One dressed, took his bowl and robe, and entered Vesāli for alms. After wandering for alms in Vesāli and returning from his alms round, the Blessed One addressed the Venerable Ānanda, \"Take up the sitting mat, Ānanda. We shall go to the Cāpāla Shrine for our day's abiding.\" \"Yes, Bhante,\" replied the Venerable Ānanda to the Blessed One, and taking up the sitting mat, he followed closely behind the Blessed One. Then the Blessed One went to the Cāpāla Shrine; having arrived there, he sat down on the seat that had been prepared. Having sat down, the Blessed One addressed the Venerable Ānanda: \"Delightful, Ānanda, is Vesāli. Delightful is the Udena Shrine. Delightful is the Gotamaka Shrine. Delightful is the Sattamba Shrine. Delightful is the Bahuputtaka Shrine. Delightful is the Sārandada Shrine. Delightful is the Cāpāla Shrine. Whoever, Ānanda, has cultivated, frequently practiced, made a vehicle of, made a basis of, established, continuously trained in, and fully mastered the four bases of spiritual power, such a one, if he wishes, could remain for an eon or for the remainder of an eon. Indeed, Ānanda, the Tathāgata has cultivated, frequently practiced, made a vehicle of, made a basis of, established, continuously trained in, and fully mastered the four bases of spiritual power. Therefore, Ānanda, if the Tathāgata wishes, he could remain for an eon or for the remainder of an eon.\" Even though the Blessed One was thus making such a clear sign and giving such a clear indication, the Venerable Ānanda was unable to penetrate its meaning and did not entreat the Blessed One, saying, \"May the Blessed One remain for an eon, Bhante! May the Fortunate One remain for an eon, for the benefit of many, for the happiness of many, out of compassion for the world, for the welfare, benefit, and happiness of devas and humans!\" This was because his mind was overcome by Māra. For a second time, the Blessed One addressed the Venerable Ānanda, and for a third time, the Blessed One addressed the Venerable Ānanda: \"Delightful, Ānanda, is Vesāli. Delightful is the Udena Shrine. Delightful is the Gotamaka Shrine. Delightful is the Sattamba Shrine. Delightful is the Bahuputtaka Shrine. Delightful is the Sārandada Shrine. Delightful is the Cāpāla Shrine. Whoever, Ānanda, has cultivated, frequently practiced, made a vehicle of, made a basis of, established, continuously trained in, and fully mastered the four bases of spiritual power, such a one, if he wishes, could remain for an eon or for the remainder of an eon. Indeed, Ānanda, the Tathāgata has cultivated, frequently practiced, made a vehicle of, made a basis of, established, continuously trained in, and fully mastered the four bases of spiritual power. Therefore, Ānanda, if the Tathāgata wishes, he could remain for an eon or for the remainder of an eon.\" Even though the Blessed One was thus making such a clear sign and giving such a clear indication, the Venerable Ānanda was unable to penetrate its meaning and did not entreat the Blessed One, saying, \"May the Blessed One remain for an eon, Bhante! May the Fortunate One remain for an eon, for the benefit of many, for the happiness of many, out of compassion for the world, for the welfare, benefit, and happiness of devas and humans!\" This was because his mind was overcome by Māra. Then the Blessed One addressed the Venerable Ānanda, \"Go now, Ānanda, do what you think is timely.\" \"Yes, Bhante,\" replied the Venerable Ānanda to the Blessed One, and rising from his seat, he paid homage to the Blessed One, circumambulated him clockwise, and sat down at the root of a certain tree not far from the Blessed One.\n\nThen Māra, the Evil One, not long after the Venerable Ānanda had departed, approached the Blessed One and said this: \"Now, Bhante, let the Blessed One attain final Nibbāna; let the Fortunate One attain final Nibbāna. It is now time for the Blessed One to attain final Nibbāna. For this statement, Bhante, was spoken by the Blessed One: 'I shall not attain final Nibbāna, Evil One, until my bhikkhus, my disciples, become accomplished, well-trained, confident, having attained the secure state, learned, preservers of the Dhamma, practicing in conformity with the Dhamma, practicing correctly, and living in accordance with the Dhamma. Having learned their own teacher's doctrine, they will teach, expound, declare, establish, clarify, analyze, and make manifest the Dhamma. Having refuted and thoroughly suppressed any opposing doctrines that may arise, with the Dhamma, they will teach the Dhamma with its wonders.' Now, Bhante, the bhikkhus, the Blessed One's disciples, are accomplished, well-trained, confident, having attained the secure state, learned, preservers of the Dhamma, practicing in conformity with the Dhamma, practicing correctly, and living in accordance with the Dhamma. Having learned their own teacher's doctrine, they teach, expound, declare, establish, clarify, analyze, and make manifest the Dhamma. Having refuted and thoroughly suppressed any opposing doctrines that may arise, with the Dhamma, they teach the Dhamma with its wonders. Now, Bhante, let the Blessed One attain final Nibbāna; let the Fortunate One attain final Nibbāna. It is now time for the Blessed One to attain final Nibbāna.\n\nIndeed, Venerable Sir, this statement was made by the Blessed One: ‘I shall not attain final Nibbāna, O Evil One, until my bhikkhunīs have become disciples; until my male lay followers have become disciples; until my female lay followers have become disciples—accomplished, well-trained, confident, having attained security from bondage, widely learned, upholders of the Dhamma, practicing in conformity with the Dhamma, practicing properly, following the Dhamma; having learned their own teacher's doctrine, they will teach, explain, declare, establish, reveal, analyze, make clear; and having fully refuted any arisen opposing doctrine in accordance with the Dhamma, they will teach the Dhamma with its wonder.’ But now, Venerable Sir, the Blessed One's female lay followers are disciples, accomplished, well-trained, confident, having attained security from bondage, widely learned, upholders of the Dhamma, practicing in conformity with the Dhamma, practicing properly, following the Dhamma; having learned their own teacher's doctrine, they teach, explain, declare, establish, reveal, analyze, make clear; and having fully refuted any arisen opposing doctrine in accordance with the Dhamma, they teach the Dhamma with its wonder. ‘May the Blessed One now attain final Nibbāna, Venerable Sir! May the Fortunate One attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna, Venerable Sir. Indeed, Venerable Sir, this statement was made by the Blessed One: ‘I shall not attain final Nibbāna, O Evil One, until this holy life of mine is not yet prosperous, flourishing, widespread, popular, and extensive, until it is not yet well-proclaimed among gods and humans.’ But now, Venerable Sir, the Blessed One's holy life is prosperous, flourishing, widespread, popular, and extensive, and well-proclaimed among gods and humans. ‘May the Blessed One now attain final Nibbāna, Venerable Sir! May the Fortunate One attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna, Venerable Sir.’\n\n‘Be unconcerned, O Evil One. The Tathagata's final Nibbāna will not be long from now. In three months from now, the Tathagata will attain final Nibbāna.’ Then, the Blessed One, at the Cāpāla Shrine, mindful and clearly comprehending, renounced the life-determining formations. When the Blessed One had renounced the life-determining formations, a great earthquake occurred, terrifying and causing the hair to stand on end, and divine drums resounded mightily. Then the Blessed One, understanding this matter, at that moment uttered this inspired utterance:\n‘The Sage renounced the aggregates of existence, both measurable and immeasurable, the life-generating formations.\nDelighting inwardly, concentrated, he shattered the armor of self-existence.’\n\nThen it occurred to Venerable Ānanda: ‘What a great earthquake! Indeed, what a very great earthquake, terrifying and causing the hair to stand on end, and divine drums resounded mightily! What, I wonder, is the cause, what is the reason for the manifestation of this great earthquake?’ Then Venerable Ānanda approached the Blessed One, paid homage to him, and sat down to one side. Seated to one side, Venerable Ānanda said to the Blessed One: ‘Venerable Sir, what a great earthquake! Indeed, Venerable Sir, what a very great earthquake, terrifying and causing the hair to stand on end, and divine drums resounded mightily! What, I wonder, Venerable Sir, is the cause, what is the reason for the manifestation of this great earthquake?’\n\n‘There are these eight causes, Ānanda, eight reasons for the manifestation of a great earthquake. Which eight? Here, Ānanda, this great earth is established on water; water is established on wind; wind is established on space. There comes a time, Ānanda, when great winds blow. As the great winds blow, they cause the water to tremble. The water, being trembled, causes the earth to tremble. This, Ānanda, is the first cause, the first reason for the manifestation of a great earthquake.\n\n‘Furthermore, Ānanda, when a renunciant or brahmin, potent, a master of mental faculties, or a deity of great power and might, has cultivated a limited perception of earth and an immeasurable perception of water, he causes this earth to tremble, shake, rock, and quake. This, Ānanda, is the second cause, the second reason for the manifestation of a great earthquake.\n\n‘Furthermore, Ānanda, when a Bodhisatta, departing from the Tusita realm, mindfully and clearly comprehending, descends into his mother's womb, at that time this earth trembles, shakes, rock, and quakes. This, Ānanda, is the third cause, the third reason for the manifestation of a great earthquake.\n\n‘Furthermore, Ānanda, when a Bodhisatta, mindfully and clearly comprehending, emerges from his mother's womb, at that time this earth trembles, shakes, rock, and quakes. This, Ānanda, is the fourth cause, the fourth reason for the manifestation of a great earthquake.\n\n‘Furthermore, Ānanda, when the Tathagata fully awakens to unsurpassed perfect self-awakening, at that time this earth trembles, shakes, rock, and quakes. This, Ānanda, is the fifth cause, the fifth reason for the manifestation of a great earthquake.\n\nFurthermore, Ananda, when the Tathāgata sets in motion the unsurpassed Wheel of Dhamma, then this earth quakes, is greatly shaken, is thoroughly shaken, and trembles. This, Ananda, is the sixth cause, the sixth reason for the appearance of a great earthquake.\n\nFurthermore, Ananda, when the Tathāgata, mindful and clearly comprehending, relinquishes the life-formation, then this earth quakes, is greatly shaken, is thoroughly shaken, and trembles. This, Ananda, is the seventh cause, the seventh reason for the appearance of a great earthquake.\n\nFurthermore, Ananda, when the Tathāgata attains final Nibbāna with no remainder of clinging, then this earth quakes, is greatly shaken, is thoroughly shaken, and trembles. This, Ananda, is the eighth cause, the eighth reason for the appearance of a great earthquake.\n\nThese, Ananda, are the eight causes, the eight reasons for the appearance of a great earthquake.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෛශාලියෙහි මහවනයෙහි වූ කූටාගාර ශාලාවෙහි වැඩසිටි සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍ර සිවුරු ගෙන වෛශාලියට පිඬුසිඟා වැඩිය සේක. වෛශාලියෙහි පිඬුසිඟා වඩාරා දහවල් ආහාරයෙන් පසු පිණ්ඩපාතයෙන් ආපසු වඩිනා ලද්දාහු ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: \"ආනන්දය, අසුනක් ගනු මැනව. චාපාල චෛත්‍යය යම් තැනක වේද, දහවල් විහරණය පිණිස එතැනට යමු.\" \"එසේය, භාග්‍යවතුන් වහන්ස\" යි ආයුෂ්මත් ආනන්ද හිමියෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, අසුනක් ගෙන භාග්‍යවතුන් වහන්සේ පසුපසින්ම ගිය සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ චාපාල චෛත්‍යය යම් තැනක වේද එතැනට වැඩිය සේක; එතැනට වැඩ, පනවන ලද අසුනෙහි වැඩසිටි සේක. වැඩහිඳගත් භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: \"ආනන්දය, වෛශාලිය රමණීයයි. උදේන චෛත්‍යය රමණීයයි. ගෝතමක චෛත්‍යය රමණීයයි. සත්තම්බ චෛත්‍යය රමණීයයි. බහුපුත්‍රක චෛත්‍යය රමණීයයි; සාරන්දද චෛත්‍යය රමණීයයි, චාපාල චෛත්‍යය රමණීයයි. ආනන්දය, යම් කිසිවකු විසින් සතර ඉර්ධිපාද වඩන ලද්දාහු, බහුල වශයෙන් පුරුදු කරන ලද්දාහු, යානයක් මෙන් කරන ලද්දාහු, වස්තුවක් මෙන් කරන ලද්දාහු, මැනවින් පිහිටුවන ලද්දාහු, මැනවින් පුරුදු කරන ලද්දාහු, මැනවින් ආරම්භ කරන ලද්දාහු වේද, ඒ තැනැත්තා කැමති නම්, ආනන්දය, කල්පයක් හෝ කල්පයක අවශේෂ කාලයක් හෝ සිටිනු ඇත. ආනන්දය, තථාගතයන් වහන්සේ විසින්ද සතර ඉර්ධිපාද වඩන ලද්දාහු, බහුල වශයෙන් පුරුදු කරන ලද්දාහු, යානයක් මෙන් කරන ලද්දාහු, වස්තුවක් මෙන් කරන ලද්දාහු, මැනවින් පිහිටුවන ලද්දාහු, මැනවින් පුරුදු කරන ලද්දාහු, මැනවින් ආරම්භ කරන ලද්දාහු වේ. ආනන්දය, තථාගතයන් වහන්සේ කැමති නම්, කල්පයක් හෝ කල්පයක අවශේෂ කාලයක් හෝ සිටිනු ඇත\" යි. මෙසේ වුවද භාග්‍යවතුන් වහන්සේ විසින් මහා නිමිති දක්වන කල්හි, මහා ආලෝකයක් කරන කල්හි ආයුෂ්මත් ආනන්ද හිමියන්ට එය තේරුම් ගැනීමට නොහැකි වූහ; මාරයා විසින් සිත වසන ලද බැවින් \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා! සුගතයන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා! බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, ලෝකයාට අනුකම්පා පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස\" යි භාග්‍යවතුන් වහන්සේගෙන් නොඇයැද සිටියහ. දෙවෙනි වරටද භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: \"ආනන්දය, වෛශාලිය රමණීයයි. උදේන චෛත්‍යය රමණීයයි. ගෝතමක චෛත්‍යය රමණීයයි. සත්තම්බ චෛත්‍යය රමණීයයි. බහුපුත්‍රක චෛත්‍යය රමණීයයි; සාරන්දද චෛත්‍යය රමණීයයි, චාපාල චෛත්‍යය රමණීයයි. ආනන්දය, යම් කිසිවකු විසින් සතර ඉර්ධිපාද වඩන ලද්දාහු, බහුල වශයෙන් පුරුදු කරන ලද්දාහු, යානයක් මෙන් කරන ලද්දාහු, වස්තුවක් මෙන් කරන ලද්දාහු, මැනවින් පිහිටුවන ලද්දාහු, මැනවින් පුරුදු කරන ලද්දාහු, මැනවින් ආරම්භ කරන ලද්දාහු වේද, ඒ තැනැත්තා කැමති නම්, ආනන්දය, කල්පයක් හෝ කල්පයක අවශේෂ කාලයක් හෝ සිටිනු ඇත. ආනන්දය, තථාගතයන් වහන්සේ විසින්ද සතර ඉර්ධිපාද වඩන ලද්දාහු, බහුල වශයෙන් පුරුදු කරන ලද්දාහු, යානයක් මෙන් කරන ලද්දාහු, වස්තුවක් මෙන් කරන ලද්දාහු, මැනවින් පිහිටුවන ලද්දාහු, මැනවින් පුරුදු කරන ලද්දාහු, මැනවින් ආරම්භ කරන ලද්දාහු වේ. ආනන්දය, තථාගතයන් වහන්සේ කැමති නම්, කල්පයක් හෝ කල්පයක අවශේෂ කාලයක් හෝ සිටිනු ඇත\" යි. මෙසේ වුවද භාග්‍යවතුන් වහන්සේ විසින් මහා නිමිති දක්වන කල්හි, මහා ආලෝකයක් කරන කල්හි ආයුෂ්මත් ආනන්ද හිමියන්ට එය තේරුම් ගැනීමට නොහැකි වූහ; මාරයා විසින් සිත වසන ලද බැවින් \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා! සුගතයන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා! බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, ලෝකයාට අනුකම්පා පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස\" යි භාග්‍යවතුන් වහන්සේගෙන් නොඇයැද සිටියහ. තුන්වෙනි වරටද භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: \"ආනන්දය, වෛශාලිය රමණීයයි. උදේන චෛත්‍යය රමණීයයි. ගෝතමක චෛත්‍යය රමණීයයි. සත්තම්බ චෛත්‍යය රමණීයයි. බහුපුත්‍රක චෛත්‍යය රමණීයයි; සාරන්දද චෛත්‍යය රමණීයයි, චාපාල චෛත්‍යය රමණීයයි. ආනන්දය, යම් කිසිවකු විසින් සතර ඉර්ධිපාද වඩන ලද්දාහු, බහුල වශයෙන් පුරුදු කරන ලද්දාහු, යානයක් මෙන් කරන ලද්දාහු, වස්තුවක් මෙන් කරන ලද්දාහු, මැනවින් පිහිටුවන ලද්දාහු, මැනවින් පුරුදු කරන ලද්දාහු, මැනවින් ආරම්භ කරන ලද්දාහු වේද, ඒ තැනැත්තා කැමති නම්, ආනන්දය, කල්පයක් හෝ කල්පයක අවශේෂ කාලයක් හෝ සිටිනු ඇත. ආනන්දය, තථාගතයන් වහන්සේ විසින්ද සතර ඉර්ධිපාද වඩන ලද්දාහු, බහුල වශයෙන් පුරුදු කරන ලද්දාහු, යානයක් මෙන් කරන ලද්දාහු, වස්තුවක් මෙන් කරන ලද්දාහු, මැනවින් පිහිටුවන ලද්දාහු, මැනවින් පුරුදු කරන ලද්දාහු, මැනවින් ආරම්භ කරන ලද්දාහු වේ. ආනන්දය, තථාගතයන් වහන්සේ කැමති නම්, කල්පයක් හෝ කල්පයක අවශේෂ කාලයක් හෝ සිටිනු ඇත\" යි. මෙසේ වුවද භාග්‍යවතුන් වහන්සේ විසින් මහා නිමිති දක්වන කල්හි, මහා ආලෝකයක් කරන කල්හි ආයුෂ්මත් ආනන්ද හිමියන්ට එය තේරුම් ගැනීමට නොහැකි වූහ; මාරයා විසින් සිත වසන ලද බැවින් \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා! සුගතයන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා! බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, ලෝකයාට අනුකම්පා පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස\" යි භාග්‍යවතුන් වහන්සේගෙන් නොඇයැද සිටියහ.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: \"ආනන්දය, දැන් යාමට කල් යැයි යමක් ඔබ සිතන්නේ නම්, ඔබ යනු මැනව.\" \"එසේය, භාග්‍යවතුන් වහන්ස\" යි ආයුෂ්මත් ආනන්ද හිමියෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වැඳ, පැදකුණු කොට, භාග්‍යවතුන් වහන්සේට නුදුරුව වූ එක්තරා රුක් මුලක වැඩහිඳගත් සේක. ඉන්පසු පාපී මාරයා ආයුෂ්මත් ආනන්ද හිමියන් පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමටත් පෙර භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පානු මැනව. සුගතයන් වහන්සේ පිරිනිවන් පානු මැනව. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවන් පෑමට කල් එළඹ ඇත. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් මෙම වචනය වදාරන ලද්දක් නොවේද: 'පවිටු මාරය, මාගේ ශ්‍රාවක භික්ෂූහු දක්ෂ, විනයට පුරුදු වූ, විශාරද වූ, යෝගක්ෂේමය (උතුම් නිදහස) ලැබූ, බහුශ්‍රැත වූ, ධර්මධර වූ, ධර්මානුධර්ම ප්‍රතිපත්තිවල පිහිටියා වූ, ධර්මයට අනුව හැසිරෙන්නා වූ, ධර්මානුකූලව හැසිරෙන්නා වූ, තමන්ගේ ආචාර්ය ධර්මය උගෙන ප්‍රකාශ කරන්නේද, දේශනා කරන්නේද, පනවා දක්වන්නේද, පිහිටුවා දක්වන්නේද, විවෘත කරන්නේද, විභාග කරන්නේද, පැහැදිලි කරන්නේද, උපන්නා වූ අන්‍යවාදයන් ස්වකීය ධර්මයෙන් හොඳින් මැඩ ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරන්නේද, එතෙක් මා පිරිනිවන් නොපාමි' යි. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක භික්ෂූහු දක්ෂයෝය, විනයට පුරුදු වූවෝය, විශාරදයෝය, යෝගක්ෂේමය (උතුම් නිදහස) ලැබූවෝය, බහුශ්‍රැතයෝය, ධර්මධරයෝය, ධර්මානුධර්ම ප්‍රතිපත්තිවල පිහිටියාවෝය, ධර්මයට අනුව හැසිරෙන්නෝය, ධර්මානුකූලව හැසිරෙන්නෝය. තමන්ගේ ආචාර්ය ධර්මය උගෙන ප්‍රකාශ කරති, දේශනා කරති, පනවා දක්වති, පිහිටුවා දක්වති, විවෘත කරති, විභාග කරති, පැහැදිලි කරති, උපන්නා වූ අන්‍යවාදයන් ස්වකීය ධර්මයෙන් හොඳින් මැඩ ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරති. \"ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පානු මැනව. සුගතයන් වහන්සේ පිරිනිවන් පානු මැනව. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවන් පෑමට කල් එළඹ ඇත.\"\n\nස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් මෙම වචනය වදාළ සේක: ‘පව්කාර මාරය, මාගේ භික්ෂුණීහු ශ්‍රාවිකාවෝ නොවන තාක් මම පිරිනිවන් පාන්නේ නැත. මාගේ භික්ෂූහු ශ්‍රාවකයෝ නොවන තාක් මම පිරිනිවන් පාන්නේ නැත. මාගේ උපාසකයෝ ශ්‍රාවකයෝ නොවන තාක් මම පිරිනිවන් පාන්නේ නැත. මාගේ උපාසිකාවෝ දක්ෂවූ, විනීතවූ, විශාරදවූ, යෝගක්ෂේමයට පැමිණි, බහුශ්‍රැතවූ, ධර්මය දරන, ධර්මයට අනුව පිළිපදින, සුදුසු පරිදි පිළිපදින, ධර්මයට අනුව හැසිරෙන, තම ආචාර්ය සම්ප්‍රදාය (තමන් උගත් ධර්මය) මැනවින් ඉගෙන ගෙන එය අන් අයට පවසන, දේශනා කරන, පනවනු ලබන, පිහිටුවනු ලබන, විවෘත කරන, බෙදා වෙන් කරන, පැහැදිලි කරන, නැගී එන පරවාද ධර්මයෙන්ම මැනවින් යටපත් කොට, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරන ශ්‍රාවිකාවෝ නොවන තාක් මම පිරිනිවන් පාන්නේ නැත.’ දැන්, ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ උපාසිකාවෝ දක්ෂවූ, විනීතවූ, විශාරදවූ, යෝගක්ෂේමයට පැමිණි, බහුශ්‍රැතවූ, ධර්මය දරන, ධර්මයට අනුව පිළිපදින, සුදුසු පරිදි පිළිපදින, ධර්මයට අනුව හැසිරෙන ශ්‍රාවිකාවෝ වෙති. ඔවුහු තම ආචාර්ය සම්ප්‍රදාය මැනවින් ඉගෙන ගෙන එය අන් අයට පවසති, දේශනා කරති, පනවති, පිහිටුවති, විවෘත කරති, බෙදා වෙන් කරති, පැහැදිලි කරති, නැගී එන පරවාද ධර්මයෙන්ම මැනවින් යටපත් කොට, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරති.\n\n‘ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! සුගතයන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවන් පෑමේ කාලයයි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් මෙම වචනය වදාළ සේක: ‘පව්කාර මාරය, මාගේ මෙම බ්‍රහ්මචර්යාව සශ්‍රීක, වර්ධනය වූ, විස්තාරවත්, බොහෝ ජනයා විසින් පිළිගත්, ව්‍යාප්ත වූ, දෙවිමිනිසුන් විසින් මැනවින් ප්‍රකාශිත වන තුරු මම පිරිනිවන් පාන්නේ නැත.’ දැන්, ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ බ්‍රහ්මචර්යාව සශ්‍රීක වී ඇත, වර්ධනය වී ඇත, විස්තාරවත් වී ඇත, බොහෝ ජනයා විසින් පිළිගෙන ඇත, ව්‍යාප්ත වී ඇත, දෙවිමිනිසුන් විසින් මැනවින් ප්‍රකාශිත වී ඇත. ‘ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! සුගතයන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවන් පෑමේ කාලයයි.’\n\n‘පව්කාර මාරය, නුඹ උත්සාහය අත්හැර නිශ්චල වුව මැනව! නොබෝ කලකින් තථාගතයන් වහන්සේගේ පිරිනිවීම සිදුවනු ඇත. මෙතැන් සිට තෙමසක් ඇතුළත තථාගතයන් වහන්සේ පිරිනිවන් පානු ඇතැ’යි.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ චාපාල චෛත්‍යයෙහි සිහි නුවණින් යුක්තව සිට ආයුසංස්කාරය අත්හැරිය සේක. භාග්‍යවතුන් වහන්සේ විසින් ආයුසංස්කාරය අත්හරිනු ලැබූ කල්හි භයංකර, රෝම කූප කෙළින් කරවන මහා පොළොව කම්පාවක් ඇතිවිය. දෙව්දත් බෙරද පිපිරුණි. ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ අරුත දැන, ඒ වේලෙහි මෙම උදානය පහළ කළ සේක: ‘මුනිවරයාණෝ, තූල්‍ය වූද අතූල්‍ය වූද (සියලු ආකාරයේ) භවයන් උපදින සංස්කාරයන් අත්හැරිය සේක. තමන් තුළම ඇලී, සමහිතව, ආත්ම භවය නමැති කවචය බිඳ දැමූ සේක.’\n\nඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: ‘මෙය මහා භූමි කම්පාවකි; මෙය භයංකර වූ, රෝම කූප කෙළින් කරවන අතිමහත් භූමි කම්පාවකි, දෙව්දත් බෙරද පිපිරුණි. මහා භූමි කම්පාවක් ඇතිවීමට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’\n\nඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පසෙක වැඩසිටියහ. එකත්පසෙක වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූ සේක: ‘ස්වාමීනි, මෙය මහා භූමි කම්පාවකි; ස්වාමීනි, මෙය භයංකර වූ, රෝම කූප කෙළින් කරවන අතිමහත් භූමි කම්පාවකි, දෙව්දත් බෙරද පිපිරුණි. ස්වාමීනි, මහා භූමි කම්පාවක් ඇතිවීමට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’\n\n‘ආනන්දය, මහා භූමි කම්පාවක් ඇතිවීමට හේතු අටක් ඇත, ප්‍රත්‍යයන් අටක් ඇත. ඒ අට කුමක්ද? ආනන්දය, මෙම මහා පෘථිවිය ජලය මත පිහිටා ඇත; ජලය සුළඟ මත පිහිටා ඇත; සුළඟ අවකාශයෙහි පිහිටා ඇත. ආනන්දය, මහා සුළං හමන කල, ඒ මහා සුළං හමන විට ජලය කම්පා කරයි; කම්පා වූ ජලය පෘථිවිය කම්පා කරයි. ආනන්දය, මෙය මහා භූමි කම්පාවක් ඇතිවීමට පළමු හේතුවයි, පළමු ප්‍රත්‍යයයි.\n\n‘ආනන්දය, තවද, යම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ සෘද්ධිමත් නම්, චේතෝවසිත්වයට පැමිණියේ නම්, යම් දෙවියෙක් හෝ මහා සෘද්ධිමත්, මහත් ආනුභාව සම්පන්න නම්. ඔහුට හෝ ඇයට පෘථිවි සංඥාව අල්ප වශයෙන් වැඩී ඇත, ආපෝ සංඥාව අප්‍රමාණව වැඩී ඇත. ඔහු හෝ ඇය මෙම පෘථිවිය කම්පා කරයි, හොඳින් කම්පා කරයි, මුළුමනින් කම්පා කරයි, හොඳින් සෙලවෙයි. ආනන්දය, මෙය මහා භූමි කම්පාවක් ඇතිවීමට දෙවන හේතුවයි, දෙවන ප්‍රත්‍යයයි.\n\n‘ආනන්දය, තවද, බෝධිසත්වයන් වහන්සේ තව්තිසා දෙව්ලොවින් චුතව, සිහි නුවණින් යුක්තව මවකගේ කුසට පිවිසෙන කල, එවිට මෙම පෘථිවිය කම්පා වේ, හොඳින් කම්පා වේ, මුළුමනින් කම්පා වේ, හොඳින් සෙලවෙයි. ආනන්දය, මෙය මහා භූමි කම්පාවක් ඇතිවීමට තෙවන හේතුවයි, තෙවන ප්‍රත්‍යයයි.\n\n‘ආනන්දය, තවද, බෝධිසත්වයන් වහන්සේ සිහි නුවණින් යුක්තව මවකගේ කුසින් පිටතට පැමිණෙන කල, එවිට මෙම පෘථිවිය කම්පා වේ, හොඳින් කම්පා වේ, මුළුමනින් කම්පා වේ, හොඳින් සෙලවෙයි. ආනන්දය, මෙය මහා භූමි කම්පාවක් ඇතිවීමට සිව්වන හේතුවයි, සිව්වන ප්‍රත්‍යයයි.\n\n‘ආනන්දය, තවද, තථාගතයන් වහන්සේ අනුත්තර සම්මා සම්බෝධිය අවබෝධ කරගන්නා කල, එවිට මෙම පෘථිවිය කම්පා වේ, හොඳින් කම්පා වේ, මුළුමනින් කම්පා වේ, හොඳින් සෙලවෙයි. ආනන්දය, මෙය මහා භූමි කම්පාවක් ඇතිවීමට පස්වන හේතුවයි, පස්වන ප්‍රත්‍යයයි.\n\nතවද, ආනන්දයෙනි, යම් කලක තථාගතයන් වහන්සේ අනුත්තර වූ ධර්මචක්‍රය ප්‍රවර්තනය කරන සේක්ද, එකල්හි මේ පෘථිවිය කම්පා වෙයි, හොඳින් කම්පා වෙයි, ඉතා හොඳින් කම්පා වෙයි, වෙව්ලා යයි. ආනන්දයෙනි, මේ මහා භූමිචාලය පහළ වීමට සයවැනි හේතුවයි, සයවැනි ප්‍රත්‍යයයි.\n\nතවද, ආනන්දයෙනි, යම් කලක තථාගතයන් වහන්සේ සිහි ඇතිව, මනා නුවණින් යුක්තව, ආයුසංස්කාරය අත්හරින සේක්ද, එකල්හි මේ පෘථිවිය කම්පා වෙයි, හොඳින් කම්පා වෙයි, ඉතා හොඳින් කම්පා වෙයි, වෙව්ලා යයි. ආනන්දයෙනි, මේ මහා භූමිචාලය පහළ වීමට සත්වැනි හේතුවයි, සත්වැනි ප්‍රත්‍යයයි.\n\nතවද, ආනන්දයෙනි, යම් කලක තථාගතයන් වහන්සේ කිසිදු උපාදානයකින් තොර වූ නිර්වාණ ධාතුවෙන් පිරිනිවන් පාන සේක්ද, එකල්හි මේ පෘථිවිය කම්පා වෙයි, හොඳින් කම්පා වෙයි, ඉතා හොඳින් කම්පා වෙයි, වෙව්ලා යයි. ආනන්දයෙනි, මේ මහා භූමිචාලය පහළ වීමට අටවැනි හේතුවයි, අටවැනි ප්‍රත්‍යයයි.\n\nආනන්දයෙනි, මහා භූමිචාලය පහළ වීමට මේ අට හේතුන් ද, මේ අට ප්‍රත්‍යයන් ද වෙති.",
      "paliTitle": "Bhūmicālasuttaṃ",
      "englishTitle": "The Earthquake Discourse",
      "sinhalaTitle": "භූමිචාල සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Bhūmicālavaggo dutiyo. Tassuddānaṃ – Icchā alañca saṃkhittaṃ, gayā abhibhunā saha; Vimokkho dve ca vohārā, parisā bhūmicālenāti.",
    "english": "Second Chapter on Earthquakes",
    "sinhala": "දෙවන භූමිචාල වර්‍ගය"
  }
}