{
  "id": "an8.6",
  "title": {
    "pali": "Gotamīvaggo",
    "english": "The Chapter on Gotami",
    "sinhala": "ගෝතමී වග්ගය"
  },
  "sections": [
    {
      "number": 51,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho mahāpajāpatī [mahāpajāpati (syā.) cūḷava. 402] gotamī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho mahāpajāpatī gotamī bhagavantaṃ etadavoca – ‘‘sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. ‘‘Alaṃ, gotami! Mā te rucci mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajjā’’ti. Dutiyampi kho mahāpajāpatī gotamī bhagavantaṃ etadavoca – ‘‘sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. ‘‘Alaṃ, gotami! Mā te rucci mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajjā’’ti. ‘‘Tatiyampi kho mahāpajāpatī gotamī bhagavantaṃ etadavoca – ‘‘sādhu bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. ‘‘Alaṃ, gotami! Mā te rucci mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajjā’’ti. Atha kho mahāpajāpatī gotamī ‘‘na bhagavā anujānāti mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti dukkhī dummanā assumukhī rudamānā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā kapilavatthusmiṃ yathābhirantaṃ viharitvā yena vesālī tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena vesālī tadavasari. Tatra sudaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho mahāpajāpatī gotamī kese chedāpetvā kāsāyāni vatthāni acchādetvā sambahulāhi sākiyānīhi saddhiṃ yena vesālī tena pakkāmi. Anupubbena yena vesālī mahāvanaṃ kūṭāgārasālā tenupasaṅkami. Atha kho mahāpajāpatī gotamī sūnehi pādehi rajokiṇṇena gattena dukkhī dummanā assumukhī rudamānā bahidvārakoṭṭhake aṭṭhāsi. Addasā kho āyasmā ānando mahāpajāpatiṃ gotamiṃ sūnehi pādehi rajokiṇṇena gattena dukkhiṃ dummanaṃ assumukhiṃ rudamānaṃ bahidvārakoṭṭhake ṭhitaṃ. Disvāna mahāpajāpatiṃ gotamiṃ etadavoca – ‘‘kiṃ nu tvaṃ, gotami, sūnehi pādehi rajokiṇṇena gattena dukkhī dummanā assumukhī rudamānā bahidvārakoṭṭhake ṭhitā’’ti? ‘‘Tathā hi pana, bhante ānanda, na bhagavā anujānāti mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. ‘‘Tena hi tvaṃ, gotami, muhuttaṃ idheva tāva hohi, yāvāhaṃ bhagavantaṃ yācāmi mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘esā, bhante, mahāpajāpatī gotamī sūnehi pādehi rajokiṇṇena gattena dukkhī dummanā assumukhī rudamānā bahidvārakoṭṭhake ṭhitā – ‘na bhagavā anujānāti mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’nti. Sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. ‘‘Alaṃ, ānanda! Mā te rucci mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajjā’’ti. Dutiyampi kho…pe… tatiyampi kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. ‘‘Alaṃ, ānanda! Mā te rucci mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajjā’’ti. Atha kho āyasmato ānandassa etadahosi – ‘‘na bhagavā anujānāti mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajjaṃ. Yaṃnūnāhaṃ aññenapi pariyāyena bhagavantaṃ yāceyyaṃ mātugāmassa tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. Atha kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘bhabbo nu kho, bhante, mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaphalaṃ vā sacchikātu’’nti? ‘‘Bhabbo, ānanda, mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā sotāpattiphalampi sakadāgāmiphalampi anāgāmiphalampi arahattaphalampi sacchikātu’’nti. ‘‘Sace, bhante, bhabbo mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā sotāpattiphalampi…pe… arahattaphalampi sacchikātuṃ, bahukārā, bhante, mahāpajāpatī gotamī bhagavato mātucchā āpādikā posikā khīrassa dāyikā; bhagavantaṃ janettiyā kālaṅkatāya thaññaṃ pāyesi. Sādhu, bhante, labheyya mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajja’’nti. ‘‘Sace, ānanda, mahāpajāpatī gotamī aṭṭha garudhamme paṭiggaṇhāti, sāvassā hotu upasampadā – [pāci. 149; cūḷava. 403] ‘‘Vassasatūpasampannāya bhikkhuniyā tadahūpasampannassa bhikkhuno abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ kattabbaṃ. Ayampi dhammo sakkatvā garuṃ katvā [garukatvā (sī. syā. pī.)] mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Na bhikkhuniyā abhikkhuke āvāse vassaṃ upagantabbaṃ. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Anvaḍḍhamāsaṃ bhikkhuniyā bhikkhusaṅghato dve dhammā paccāsīsitabbā [paccāsiṃsitabbā (sī. syā. pī.)] – uposathapucchakañca, ovādūpasaṅkamanañca. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Vassaṃvuṭṭhāya bhikkhuniyā ubhatosaṅghe tīhi ṭhānehi pavāretabbaṃ – diṭṭhena vā sutena vā parisaṅkāya vā. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Garudhammaṃ ajjhāpannāya bhikkhuniyā ubhatosaṅghe pakkhamānattaṃ caritabbaṃ. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Dve vassāni chasu dhammesu sikkhitasikkhāya sikkhamānāya ubhatosaṅghe upasampadā pariyesitabbā. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Na kenaci pariyāyena bhikkhuniyā bhikkhu akkositabbo paribhāsitabbo. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Ajjatagge ovaṭo bhikkhunīnaṃ bhikkhūsu vacanapatho, anovaṭo bhikkhūnaṃ bhikkhunīsu vacanapatho. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. ‘‘Sace, ānanda, mahāpajāpatī gotamī ime aṭṭha garudhamme paṭiggaṇhāti, sāvassā hotu upasampadā’’ti. Atha kho āyasmā ānando bhagavato santike ime aṭṭha garudhamme uggahetvā yena mahāpajāpatī gotamī tenupasaṅkami; upasaṅkamitvā mahāpajāpatiṃ gotamiṃ etadavoca – ‘‘Sace kho tvaṃ, gotami, aṭṭha garudhamme paṭiggaṇheyyāsi, sāva te bhavissati upasampadā – ‘‘Vassasatūpasampannāya bhikkhuniyā tadahūpasampannassa bhikkhuno abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ kattabbaṃ. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo…pe…. ‘‘Ajjatagge ovaṭo bhikkhunīnaṃ bhikkhūsu vacanapatho, anovaṭo bhikkhūnaṃ bhikkhunīsu vacanapatho. Ayampi dhammo sakkatvā garuṃ katvā mānetvā pūjetvā yāvajīvaṃ anatikkamanīyo. Sace kho tvaṃ, gotami, ime aṭṭha garudhamme paṭiggaṇheyyāsi, sāva te bhavissati upasampadā’’ti. ‘‘Seyyathāpi, bhante ānanda, itthī vā puriso vā daharo yuvā maṇḍanakajātiko [maṇḍanakajātiyo (sī. pī.)] sīsaṃnhāto [sīsaṃnahāto (sī. pī.), sīsanahāto (syā.)] uppalamālaṃ vā vassikamālaṃ vā adhimuttakamālaṃ [atimuttakamālaṃ (sī.)] vā labhitvā ubhohi hatthehi paṭiggahetvā uttamaṅge sirasmiṃ patiṭṭhāpeyya; evamevaṃ kho ahaṃ, bhante ānanda, ime aṭṭha garudhamme paṭiggaṇhāmi yāvajīvaṃ anatikkamanīye’’ti. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘paṭiggahitā, bhante, mahāpajāpatiyā gotamiyā aṭṭha garudhammā yāvajīvaṃ anatikkamanīyā’’ti. ‘‘Sace, ānanda, nālabhissa mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajjaṃ, ciraṭṭhitikaṃ, ānanda, brahmacariyaṃ abhavissa, vassasahassameva saddhammo tiṭṭheyya. Yato ca kho, ānanda, mātugāmo tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajito, na dāni, ānanda, brahmacariyaṃ ciraṭṭhitikaṃ bhavissati. Pañceva dāni, ānanda, vassasatāni saddhammo ṭhassati. ‘‘Seyyathāpi, ānanda, yāni kānici kulāni bahutthikāni [bahukitthikāni (sī. pī.), bahuitthikāni (syā.)] appapurisakāni, tāni suppadhaṃsiyāni honti corehi kumbhatthenakehi; evamevaṃ kho, ānanda, yasmiṃ dhammavinaye labhati mātugāmo agārasmā anagāriyaṃ pabbajjaṃ, na taṃ brahmacariyaṃ ciraṭṭhitikaṃ hoti. ‘‘Seyyathāpi, ānanda, sampanne sālikkhette setaṭṭhikā nāma rogajāti nipatati, evaṃ taṃ sālikkhettaṃ na ciraṭṭhitikaṃ hoti; evamevaṃ kho, ānanda, yasmiṃ dhammavinaye labhati mātugāmo agārasmā anagāriyaṃ pabbajjaṃ, na taṃ brahmacariyaṃ ciraṭṭhitikaṃ hoti. ‘‘Seyyathāpi, ānanda, sampanne ucchukkhette mañjiṭṭhikā [mañjeṭṭhikā (sī. syā.)] nāma rogajāti nipatati, evaṃ taṃ ucchukkhettaṃ na ciraṭṭhitikaṃ hoti; evamevaṃ kho, ānanda, yasmiṃ dhammavinaye labhati mātugāmo agārasmā anagāriyaṃ pabbajjaṃ, na taṃ brahmacariyaṃ ciraṭṭhitikaṃ hoti. ‘‘Seyyathāpi, ānanda, puriso mahato taḷākassa paṭikacceva [paṭigacceva (sī. pī.)] āḷiṃ bandheyya yāvadeva udakassa anatikkamanāya; evamevaṃ kho, ānanda, mayā paṭikacceva bhikkhunīnaṃ aṭṭha garudhammā paññattā yāvajīvaṃ anatikkamanīyā’’ti. Paṭhamaṃ.",
      "english": "On one occasion, the Blessed One was staying among the Sakyans, in Kapilavatthu, at the Nigrodha Park. Then Mahāpajāpatī Gotamī approached the Blessed One, and having approached, she paid homage to the Blessed One and stood to one side. As she stood to one side, Mahāpajāpatī Gotamī said to the Blessed One: \"Venerable sir, it would be good if women might obtain the going forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.\" \"Enough, Gotamī! Do not desire the going forth from home into homelessness for women in the Dhamma and Discipline proclaimed by the Tathāgata.\" A second time Mahāpajāpatī Gotamī said to the Blessed One: \"Venerable sir, it would be good if women might obtain the going forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.\" \"Enough, Gotamī! Do not desire the going forth from home into homelessness for women in the Dhamma and Discipline proclaimed by the Tathāgata.\" A third time Mahāpajāpatī Gotamī said to the Blessed One: \"Venerable sir, it would be good if women might obtain the going forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.\" \"Enough, Gotamī! Do not desire the going forth from home into homelessness for women in the Dhamma and Discipline proclaimed by the Tathāgata.\" Then Mahāpajāpatī Gotamī, thinking, \"The Blessed One does not permit women to go forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata,\" sorrowful, disheartened, with tear-stained face, weeping, paid homage to the Blessed One, circumambulated him clockwise, and departed.\n\nThen the Blessed One, having stayed in Kapilavatthu for as long as he wished, set out on a wandering tour towards Vesālī. Wandering by stages, he arrived at Vesālī. There, indeed, the Blessed One was staying in Vesālī, in the Great Wood, at the Gabled Hall.\n\nThen Mahāpajāpatī Gotamī, having had her hair cut off and having donned saffron robes, set out towards Vesālī together with many Sakyan women. By stages, she approached Vesālī, the Great Wood, and the Gabled Hall. Then Mahāpajāpatī Gotamī, with swollen feet and a dust-covered body, sorrowful, disheartened, with tear-stained face, weeping, stood outside the main gate.\n\nThen the Venerable Ānanda saw Mahāpajāpatī Gotamī standing outside the main gate, with swollen feet, a dust-covered body, sorrowful, disheartened, with tear-stained face, weeping. Having seen Mahāpajāpatī Gotamī, he said to her: \"Gotamī, why are you standing outside the main gate with swollen feet, a dust-covered body, sorrowful, disheartened, with tear-stained face, weeping?\" \"It is indeed so, Venerable Ānanda, for the Blessed One does not permit women to go forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.\" \"In that case, Gotamī, stay here for a moment, while I request the Blessed One for the going forth from home into homelessness for women in the Dhamma and Discipline proclaimed by the Tathāgata.\"\n\nThen the Venerable Ānanda approached the Blessed One, and having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, the Venerable Ānanda said to the Blessed One: \"Venerable sir, Mahāpajāpatī Gotamī is standing outside the main gate with swollen feet, a dust-covered body, sorrowful, disheartened, with tear-stained face, weeping, thinking, 'The Blessed One does not permit women to go forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.' Venerable sir, it would be good if women might obtain the going forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.\" \"Enough, Ānanda! Do not desire the going forth from home into homelessness for women in the Dhamma and Discipline proclaimed by the Tathāgata.\" A second time... a third time, the Venerable Ānanda said to the Blessed One: \"Venerable sir, it would be good if women might obtain the going forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.\" \"Enough, Ānanda! Do not desire the going forth from home into homelessness for women in the Dhamma and Discipline proclaimed by the Tathāgata.\" Then it occurred to the Venerable Ānanda: \"The Blessed One does not permit women to go forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata. What if I were to request the Blessed One for the going forth from home into homelessness for women in the Dhamma and Discipline proclaimed by the Tathāgata by another means?\" Then the Venerable Ānanda said to the Blessed One: \"Venerable sir, are women, having gone forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata, capable of realizing the fruit of stream-entry, or the fruit of once-returning, or the fruit of non-returning, or the fruit of arahantship?\" \"Ānanda, women are capable, having gone forth from home into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata, of realizing the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, and the fruit of arahantship.\"\n\nVenerable Sir, if women are capable of going forth from the home life into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata, and realizing the fruit of stream-entry, and so on, up to the fruit of arahatship, then Mahāpajāpatī Gotamī, the maternal aunt, foster-mother, nurse, and giver of milk to the Blessed One, who suckled him when his mother passed away, has been greatly beneficial. It would be good, Venerable Sir, if women could obtain ordination, going forth from the home life into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata.\n\nIf, Ānanda, Mahāpajāpatī Gotamī accepts the eight weighty rules, then that will serve as her full ordination:\n\nA bhikkhunī, even if she has been fully ordained for a hundred years, must greet, rise up for, perform the añjali gesture, and offer respectful services to a bhikkhu, even one fully ordained on that very day. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nA bhikkhunī must not undertake the rains retreat in a dwelling where there are no bhikkhus. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nEvery half-month, a bhikkhunī should expect two things from the Saṅgha of bhikkhus: the asking concerning the Uposatha observance day and the approaching for instruction. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nAfter the rains retreat, a bhikkhunī must perform the pavāraṇā before both Saṅghas in three respects: concerning what has been seen, heard, or suspected. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nA bhikkhunī who has violated a weighty rule must undergo penance for half a month before both Saṅghas. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nA female probationer, having trained for two years in the six rules, must seek full ordination from both Saṅghas. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nA bhikkhunī must not revile or abuse a bhikkhu in any way. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nFrom this day forward, the way of admonition is closed to bhikkhunīs regarding bhikkhus, but it is not closed to bhikkhus regarding bhikkhunīs. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life.\n\nIf, Ānanda, Mahāpajāpatī Gotamī accepts these eight weighty rules, then that will serve as her full ordination.\n\nThen the Venerable Ānanda, having learned these eight weighty rules from the Blessed One, approached Mahāpajāpatī Gotamī. Having approached her, he said to Mahāpajāpatī Gotamī: \"If, Gotamī, you accept these eight weighty rules, that will serve as your full ordination: A bhikkhunī, even if she has been fully ordained for a hundred years, must greet, rise up for, perform the añjali gesture, and offer respectful services to a bhikkhu, even one fully ordained on that very day. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life. ... And so on ... From this day forward, the way of admonition is closed to bhikkhunīs regarding bhikkhus, but it is not closed to bhikkhus regarding bhikkhunīs. This rule is to be respected, held weighty, honored, and revered, and is not to be transgressed throughout life. If, Gotamī, you accept these eight weighty rules, that will serve as your full ordination.\"\n\n\"Just as, Venerable Ānanda, a young, fresh, and adornment-loving woman or man, having bathed their head, would receive a lotus garland, a jasmine garland, or a great jasmine garland, and taking it with both hands, would place it on their head, on their crown; even so, Venerable Ānanda, do I accept these eight weighty rules, not to be transgressed throughout life.\"\n\nThen the Venerable Ānanda approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Venerable Ānanda said to the Blessed One: \"Venerable Sir, Mahāpajāpatī Gotamī has accepted the eight weighty rules, which are not to be transgressed throughout life.\"\n\nIf, Ānanda, women had not obtained ordination, going forth from the home life into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata, then the holy life, Ānanda, would have endured for a long time; the True Dhamma would have endured for a thousand years. But since, Ānanda, women have gone forth from the home life into homelessness in the Dhamma and Discipline proclaimed by the Tathāgata, now, Ānanda, the holy life will not endure for a long time. Now the True Dhamma will endure for only five hundred years. Just as, Ānanda, in any families that have many women...\n\nPlaces with many women and few men are easily assailable by thieves and housebreakers. Just so, Ananda, in any Dhamma and Discipline where women obtain ordination from the home life into the homeless life, that holy life does not endure long.\n\nJust as, Ananda, when a disease called 'white rust' afflicts a flourishing rice field, that rice field does not endure long. Just so, Ananda, in any Dhamma and Discipline where women obtain ordination from the home life into the homeless life, that holy life does not endure long.\n\nJust as, Ananda, when a disease called 'red rot' afflicts a flourishing sugarcane field, that sugarcane field does not endure long. Just so, Ananda, in any Dhamma and Discipline where women obtain ordination from the home life into the homeless life, that holy life does not endure long.\n\nJust as, Ananda, a man would build a strong dam for a great reservoir in advance, specifically to prevent the water from overflowing. Just so, Ananda, have the Eight Weighty Rules been laid down by me in advance for the bhikkhunis, never to be transgressed throughout their lives.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශාක්‍යයන් අතර කපිලවස්තු නුවර නිග්‍රෝධාරාමයෙහි වැඩවසන සේක. එකල්හි මහාප්‍රජාපතී ගෝතමිය භාග්‍යවතුන් වහන්සේ වෙත පැමිණියාය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක සිට ගත්තාය. එක් පසෙක සිට ගත් මහාප්‍රජාපතී ගෝතමිය භාග්‍යවතුන් වහන්සේට මෙසේ කීවාය: “වහන්ස, යහපති, ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබීමට අවසර ලැබේවා!” “ගෝතමිය, එපා! ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව කැමති නොවන්න.” දෙවැනි වරට ද මහාප්‍රජාපතී ගෝතමිය භාග්‍යවතුන් වහන්සේට මෙසේ කීවාය: “වහන්ස, යහපති, ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබීමට අවසර ලැබේවා!” “ගෝතමිය, එපා! ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව කැමති නොවන්න.” තුන්වැනි වරට ද මහාප්‍රජාපතී ගෝතමිය භාග්‍යවතුන් වහන්සේට මෙසේ කීවාය: “වහන්ස, යහපති, ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබීමට අවසර ලැබේවා!” “ගෝතමිය, එපා! ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව කැමති නොවන්න.” එකල්හි මහාප්‍රජාපතී ගෝතමිය “භාග්‍යවතුන් වහන්සේ ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට අවසර නොදෙන සේකැ”යි දුකට පත්ව, දොම්නස්ව, කඳුළු පිරි මුහුණින්, හඬමින්, භාග්‍යවතුන් වහන්සේට වන්දනා කොට ප්‍රදක්ෂිණා කර පිටව ගියාය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ කපිලවස්තු නුවර යථාපරිදි විවේකයෙන් වැඩසිට, යම් දිශාවක වෙසාලිය තිබුණේ ද, ඒ දිශාවට චාරිකාවේ වැඩිය සේක. අනුපිළිවෙළින් චාරිකා කරමින්, යම් දිශාවක වෙසාලිය තිබුණේ ද, එතැනට වැඩි සේක. එසමයෙහි භාග්‍යවතුන් වහන්සේ වෙසාලි නුවර මහා වනයෙහි කූටාගාර ශාලාවෙහි වැඩවසන සේක.\n\nඑකල්හි මහාප්‍රජාපතී ගෝතමිය කෙස් කැපවීමට සලස්වා, කහවත් හැඳ, බොහෝ ශාක්‍ය ස්ත්‍රීන් සමඟ යම් දිශාවක වෙසාලිය තිබුණේ ද, ඒ දිශාවට පිටව ගියාය. අනුපිළිවෙළින් යම් දිශාවක වෙසාලි මහා වනයෙහි කූටාගාර ශාලාව තිබුණේ ද, එතැනට පැමිණියාය. එකල්හි මහාප්‍රජාපතී ගෝතමිය ඉදිමුණු දෙපයින්, දූවිලි වැකුණු ශරීරයෙන්, දුකට පත්ව, දොම්නස්ව, කඳුළු පිරි මුහුණින්, හඬමින් දොරටුවේ පිටත සිට ගත්තාය.\n\nආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ඉදිමුණු දෙපයින්, දූවිලි වැකුණු ශරීරයෙන්, දුකට පත්ව, දොම්නස්ව, කඳුළු පිරි මුහුණින්, හඬමින් දොරටුවේ පිටත සිටගෙන සිටින මහාප්‍රජාපතී ගෝතමිය දුටු සේක. මහාප්‍රජාපතී ගෝතමිය දැක මෙසේ කී සේක: “ගෝතමිය, කුමක් නිසාද ඔබ ඉදිමුණු දෙපයින්, දූවිලි වැකුණු ශරීරයෙන්, දුකට පත්ව, දොම්නස්ව, කඳුළු පිරි මුහුණින්, හඬමින් දොරටුවේ පිටත සිටගෙන සිටින්නේ?” “වහන්ස ආනන්ද, කාරණය මෙයයි, භාග්‍යවතුන් වහන්සේ ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට අවසර නොදෙන සේක.” “එසේ නම් ගෝතමිය, මා ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලබා දෙන ලෙස භාග්‍යවතුන් වහන්සේගෙන් අයදින තුරු ඔබ මඳ වේලාවක් මෙහිම සිටින්න.”\n\nඑකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණි සේක; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක වාඩි වූ සේක. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කී සේක: “වහන්ස, මේ මහාප්‍රජාපතී ගෝතමිය ඉදිමුණු දෙපයින්, දූවිලි වැකුණු ශරීරයෙන්, දුකට පත්ව, දොම්නස්ව, කඳුළු පිරි මුහුණින්, හඬමින් දොරටුවේ පිටත සිටගෙන සිටින්නේය – ‘භාග්‍යවතුන් වහන්සේ ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට අවසර නොදෙන සේක’ යැයි. වහන්ස, යහපති, ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබීමට අවසර ලැබේවා!” “ආනන්ද, එපා! ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව කැමති නොවන්න.” දෙවැනි වරට ද... තුන්වැනි වරට ද ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කී සේක: “වහන්ස, යහපති, ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබීමට අවසර ලැබේවා!” “ආනන්ද, එපා! ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව කැමති නොවන්න.”\n\nඑකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: “භාග්‍යවතුන් වහන්සේ ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට අවසර නොදෙන සේක. මම වෙනත් ක්‍රමයකින් භාග්‍යවතුන් වහන්සේගෙන් ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ඉල්ලිය යුතු යැ”යි. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කී සේක: “වහන්ස, ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වී සෝවාන් ඵලය හෝ සකෘදාගාමී ඵලය හෝ අනාගාමී ඵලය හෝ අරහත් ඵලය සාක්ෂාත් කිරීමට හැකියාව තිබේද?” “ආනන්ද, ස්ත්‍රීන්ට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වී සෝවාන් ඵලයද, සකෘදාගාමී ඵලයද, අනාගාමී ඵලයද, අරහත් ඵලයද සාක්ෂාත් කිරීමට හැකියාව ඇත.”\n\n“ස්වාමීනි, මාතුග්‍රාමය තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වී සෝවාන් ඵලය පවා... රහත් ඵලය පවා සාක්ෂාත් කිරීමට සමත් නම්, ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ මෑණියන්ගේ සොහොයුරිය වූත්, වැඩූ තැනැත්තිය වූත්, පෝෂණය කළ තැනැත්තිය වූත්, කිරි දුන් තැනැත්තිය වූත්, මෑණියන් කලුරිය කළ කල්හි භාග්‍යවතුන් වහන්සේට කිරි පෙවූ තැනැත්තිය වූත් මහා ප්‍රජාපතී ගෝතමිය මහත් උපකාර කළාය. ස්වාමීනි, මාතුග්‍රාමයට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වීමට අවස්ථාව ලැබේවා!”\n\n“ආනන්දය, මහා ප්‍රජාපතී ගෝතමිය අට ගරුධර්ම පිළිගන්නේ නම්, ඇයට උපසම්පදාව ලැබේවා. – (පැවිදි වී) වසර සියයක් වූ භික්ෂුණියක් විසින් එදිනම උපසම්පදා වූ භික්ෂුවකට පවා වැඳීම, හුනස්නෙන් නැගිටීම, ඇඳිලි බැඳීම, හා සුදුසු පරිදි ගෞරව දැක්වීම කළ යුතුය. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nභික්ෂුණියක් විසින් භික්ෂූන් රහිත ආවාසයක වස් විසීම නොකළ යුතුය. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nඅඩමසකට වරක් භික්ෂුණියක් විසින් භික්ෂු සංඝයාගෙන් කරුණු දෙකක් අපේක්ෂා කළ යුතුය: එනම් පොහොය විචාරීම සහ අවවාද සඳහා ළඟා වීමයි. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nවස් වසා නිම කළ භික්ෂුණියක් විසින් දෙපිරිස් සංඝයා අබියසදී කරුණු තුනකින් පවාරණය කළ යුතුය: එනම් දුටු දෙයක්, ඇසූ දෙයක් හෝ සැක උපන් දෙයක් පිළිබඳවයි. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nගරුධර්මයක් ඉක්මවා ගිය භික්ෂුණියක් විසින් දෙපිරිස් සංඝයා අබියසදී අඩමසක් මානත් පිරීම සිදු කළ යුතුය. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nවසර දෙකක් තිස්සේ සික්ඛාමානා ප්‍රතිපදාවෙහි හෙවත් ධර්ම හයක් හික්මුණු ශික්ෂමානාවක් විසින් දෙපිරිස් සංඝයාගෙන් උපසම්පදාව අයැදිය යුතුය. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nකිසිදු ආකාරයකින් භික්ෂුණියක් විසින් භික්ෂුවකට බැන වැදීම හෝ අපහාස කිරීම නොකළ යුතුය. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nඅද පටන් භික්ෂුණීන්ට භික්ෂූන් අමතා කතා කිරීමේ මාර්ගය වැසී ඇත. එහෙත් භික්ෂූන්ට භික්ෂුණීන් අමතා කතා කිරීමේ මාර්ගය විවෘතව ඇත. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය.\n\nආනන්දය, මහා ප්‍රජාපතී ගෝතමිය මේ අට ගරුධර්ම පිළිගන්නේ නම්, ඇයට උපසම්පදාව ලැබේවා.”\n\nඑවිට ආයුෂ්මත් ආනන්ද තෙරුන් භාග්‍යවතුන් වහන්සේ සමීපයෙහිදී මේ අට ගරුධර්ම උගෙන, මහා ප්‍රජාපතී ගෝතමිය වෙත එළඹියාය. එළඹ, මහා ප්‍රජාපතී ගෝතමියට මෙය කීවාය: “ගෝතමිය, ඔබ මේ අට ගරුධර්ම පිළිගන්නේ නම්, ඔබට උපසම්පදාව ලැබේවා. – වසර සියයක් උපසම්පදා වූ භික්ෂුණියක් විසින් එදිනම උපසම්පදා වූ භික්ෂුවකට පවා වැඳීම, හුනස්නෙන් නැගිටීම, ඇඳිලි බැඳීම, හා සුදුසු පරිදි ගෞරව දැක්වීම කළ යුතුය. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය... අද පටන් භික්ෂුණීන්ට භික්ෂූන් අමතා කතා කිරීමේ මාර්ගය වැසී ඇත. එහෙත් භික්ෂූන්ට භික්ෂුණීන් අමතා කතා කිරීමේ මාර්ගය විවෘතව ඇත. මේ ධර්මයද ගරු කොට, මැනවින් සලකා, පූජනීය කොට සලකා ජීවිතාන්තය දක්වා නොකඩවා ආරක්ෂා කළ යුතුය. ගෝතමිය, ඔබ මේ අට ගරුධර්ම පිළිගන්නේ නම්, ඔබට උපසම්පදාව ලැබේවා.”\n\n“ආනන්ද ස්වාමීනි, යම් සේ තරුණ, යුවති, සැරසීමට කැමැති, හිස සේදූ ස්ත්‍රියක් හෝ පුරුෂයෙක් නෙළුම් මාලාවක් හෝ පිච්ච මාලාවක් හෝ සපු මාලාවක් හෝ ලබාගෙන දෙඅතින්ම පිළිගෙන හිස මුදුනේ තබා ගන්නේද, එසේම, ආනන්ද ස්වාමීනි, මමද ජීවිතාන්තය දක්වා කඩ නොකළ යුතු මේ අට ගරුධර්ම පිළිගනිමි”යි කීවාය.\n\nඉක්බිති ආයුෂ්මත් ආනන්ද තෙරුන් භාග්‍යවතුන් වහන්සේ වෙත එළඹියාය. එළඹ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් ආනන්ද තෙරුන් භාග්‍යවතුන් වහන්සේට මෙය කීවාය: “ස්වාමීනි, මහා ප්‍රජාපතී ගෝතමිය විසින් ජීවිතාන්තය දක්වා කඩ නොකළ යුතු අට ගරුධර්ම පිළිගෙන ඇත.”\n\n“ආනන්දය, මාතුග්‍රාමයට තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වීමට අවස්ථාව නොලැබුණේ නම්, ආනන්දය, බ්‍රහ්මචාරී ප්‍රතිපදාව බොහෝ කල් පැවතීමට ඉඩ තිබුණි. සද්ධර්මය වසර දහසක් පමණ පැවතිය යුතුව තිබුණි. යම් හෙයකින් ආනන්දය, මාතුග්‍රාමය තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්මවිනයෙහි ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූ බැවින්, දැන් ආනන්දය, බ්‍රහ්මචාරී ප්‍රතිපදාව බොහෝ කල් නොපවතිනු ඇත. දැන් ආනන්දය, සද්ධර්මය පන්සිය වසරක් පමණක් පවතිනු ඇත. ආනන්දය, යම් සේ යම් කිසි පවුලක බොහෝ ස්ත්‍රීහු සිටිත්ද...\n\nස්‍ත්‍රීන් බහුල වූ ද, පුරුෂයන් ස්වල්ප වූ ද යම් තැනක් වේ ද, ඒවා සොරුන් විසින් ද, නිවාස බිඳින්නන් විසින් ද පහසුවෙන් මැඩලිය හැකි වේ; ආනන්දයෙනි, ඒ ආකාරයෙන්ම, යම් ධර්‍ම විනයක කාන්තාවකට ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබේද, ඒ බ්‍රහ්මචර්‍යාව බොහෝ කලක් නොපවතී.\n\nආනන්දයෙනි, යම් සේ සශ්‍රීක වූ සාලි කෙතකට 'සෙතට්ඨිකා' නම් වූ රෝග වර්ගයක් වැටේ ද, එලෙසින් ඒ සාලි කෙත බොහෝ කලක් නොපවතී ද; ආනන්දයෙනි, ඒ ආකාරයෙන්ම, යම් ධර්‍ම විනයක කාන්තාවකට ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබේද, ඒ බ්‍රහ්මචර්‍යාව බොහෝ කලක් නොපවතී.\n\nආනන්දයෙනි, යම් සේ සශ්‍රීක වූ උක් කෙතකට 'මඤ්ජිට්ඨිකා' නම් වූ රෝග වර්ගයක් වැටේ ද, එලෙසින් ඒ උක් කෙත බොහෝ කලක් නොපවතී ද; ආනන්දයෙනි, ඒ ආකාරයෙන්ම, යම් ධර්‍ම විනයක කාන්තාවකට ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාව ලැබේද, ඒ බ්‍රහ්මචර්‍යාව බොහෝ කලක් නොපවතී.\n\nආනන්දයෙනි, යම් සේ යම් පුරුෂයෙක් මහත් තලාවක ජලය පිටාර නොයන පිණිස කලින්ම බැම්මක් බඳී ද; ආනන්දයෙනි, ඒ ආකාරයෙන්ම, මා විසින්ද භික්‍ෂුණීන්ට යම් ජීවත්වන තුරු නොඉක්මවිය යුතු අට ගරුධර්‍මයන් කලින්ම පනවා ඇතැයි (වදාළ සේක).",
      "paliTitle": "Gotamīsuttaṃ",
      "englishTitle": "The Gotami Sutta",
      "sinhalaTitle": "ගෝතමී සූත්‍රය"
    },
    {
      "number": 52,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘katihi nu kho, bhante, dhammehi samannāgato bhikkhu bhikkhunovādako sammannitabbo’’ti? [pāci. 147] ‘‘Aṭṭhahi kho, ānanda, dhammehi samannāgato bhikkhu bhikkhunovādako sammannitabbo. Katamehi aṭṭhahi? Idhānanda, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso; kalyāṇavāco hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya [visaṭṭhāya (ka.)] anelagaḷāya [aneḷagaḷāya (sī. ka.)] atthassa viññāpaniyā; paṭibalo hoti bhikkhunisaṅghassa dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ; yebhuyyena bhikkhunīnaṃ piyo hoti manāpo; na kho panetaṃ bhagavantaṃ uddissa pabbajitāya kāsāyavatthanivasanāya garudhammaṃ ajjhāpannapubbo hoti; vīsativasso vā hoti atirekavīsativasso vā. Imehi kho, ānanda, aṭṭhahi dhammehi samannāgato bhikkhu bhikkhunovādako sammannitabbo’’ti. Dutiyaṃ.",
      "english": "At one time, the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Then indeed, the Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Venerable Ānanda said this to the Blessed One: \"By how many qualities, venerable sir, must a monk endowed with them be authorized as an instructor of bhikkhunīs?\"\n\n\"With eight qualities, Ānanda, must a monk endowed with them be authorized as an instructor of bhikkhunīs. Which eight? Here, Ānanda, a monk is virtuous; he dwells restrained by the Pātimokkha, perfect in conduct and resort, seeing danger in the slightest faults, he trains himself by undertaking the training precepts. He is learned, having heard much, remembered much, accumulated much; the teachings that are good in the beginning, good in the middle, good in the end, with their meaning and their letter, he declares a completely perfect and purified holy life — such teachings he has learned well, held well in mind, recited well, examined well with wisdom, and penetrated well with right view. Both Pātimokkha codes are thoroughly mastered by him in detail, well-analyzed, well-recited, well-discerned, both according to the discourses and according to their detailed clauses. He is skilled in speech and articulation, endowed with a courteous voice that is clear, unhesitating, and able to make the meaning understood. He is capable of instructing, encouraging, inspiring, and gladdening the bhikkhunī community with a talk on the Dhamma. For the most part, he is dear and pleasing to the bhikkhunīs. He has never transgressed a grave rule concerning a woman who has gone forth for the Blessed One, wearing the saffron robe. He is twenty years old or more than twenty years old. With these eight qualities, Ānanda, must a monk endowed with them be authorized as an instructor of bhikkhunīs.\"",
      "sinhala": "එක් කලෙක භාග්‍ය​වතුන් වහන්සේ වෙසාලියෙහි මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩසිටියාහ. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේ වෙත පැමිණ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේට මෙය පැවසුවාහ: \"ස්වාමීනි, භික්ෂුණීන්ට අවවාද කරන්නෙක් වශයෙන් භික්ෂුවක් පත් කළ යුත්තේ කවර ධර්ම අංග අටකින් සමන්විත වූ විටද?\"\n\n\"ආනන්දය, ධර්ම අංග අටකින් සමන්විත වූ භික්ෂුවක් භික්ෂුණීන්ට අවවාද කරන්නෙක් වශයෙන් පත් කළ යුතුය. කවර අටකින්ද? ආනන්දය, මෙහිලා භික්ෂුව සීලවන්තයෙක් වේ. ප්‍රාතිමෝක්ෂ සංවර ශීලයෙන් යුක්තව වාසය කරයි. ආචාර ගෝචර සම්පන්න වේ. අනුමාත්‍ර වරදෙහි පවා භය දක්නේ වේ. ශික්ෂා පද සමාදන්ව හික්මෙන සුළු වේ.\n\nබහුශ්‍රැතයෙක් වේ. ධර්මය හා විනය මැනවින් අසා, ධාරණය කොට, වචනයෙන් පුරුදු කොට, මනසින් විමසා බලා, දෘෂ්ටියෙන් මැනවින් අවබෝධ කරගත්තේය. තවද, ඔහුට භික්ෂු ප්‍රාතිමෝක්ෂය ද, භික්ෂුණී ප්‍රාතිමෝක්ෂය ද යන උභය ප්‍රාතිමෝක්ෂයම විස්තර වශයෙන් මැනවින් ප්‍රගුණ කර ඇත. ඒවා මැනවින් බෙදා වෙන් කර ඇත. මැනවින් ක්‍රියාත්මක වන අයුරින් අවබෝධ කරගෙන ඇත. සූත්‍ර ක්‍රමයෙන්ද අනුපද ක්‍රමයෙන්ද මැනවින් විනිශ්චය කර ඇත.\n\nකල්‍යාණ වාචා ඇත්තේය. කල්‍යාණ ව්‍යාකරණ ඇත්තේය. ශ්‍රේෂ්ඨ වූ, විවෘත වූ, නිරර්ගල වූ, අර්ථය පහදවා දීමට සමත් වූ වචනයෙන් යුක්ත වේ. භික්ෂුණී සංඝයාට ධර්ම කථාවකින් ධර්මය දක්වාලීමට, සමාදන් කරවීමට, උනන්දු කරවීමට, සතුටු කරවීමට සමර්ථ වේ. බොහෝ දුරට භික්ෂුණීන්ට ප්‍රිය වේ, මනාප වේ. භාග්‍ය​වතුන් වහන්සේ අරභයා පැවිදි වූ, කසාවත් හැඳ සිටින කිසිම භික්ෂුණියකට පූර්වයෙහි ගරු ධර්මයක් (බරපතල වරදක්) ඉක්මවා ගොස් ඇත්තෙක් නොවේ. විසි වයස් පිරුණු වේ, හෝ විසි වයසට වැඩි වේ. ආනන්දය, මේ ධර්ම අටින් සමන්විත වූ භික්ෂුවක් භික්ෂුණීන්ට අවවාද කරන්නෙක් වශයෙන් පත් කළ යුතුය.\"",
      "paliTitle": "Ovādasuttaṃ",
      "englishTitle": "The Discourse on Advice",
      "sinhalaTitle": "ඕවාද සූත්‍රය"
    },
    {
      "number": 53,
      "pali": "[cūḷava. 406] Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho mahāpajāpatī gotamī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho sā mahāpajāpatī gotamī bhagavantaṃ etadavoca – ‘‘Sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā ekā vūpakaṭṭhā appamattā ātāpinī pahitattā vihareyya’’nti. ‘‘Ye kho tvaṃ, gotami, dhamme jāneyyāsi – ‘ime dhammā sarāgāya saṃvattanti, no virāgāya; saṃyogāya saṃvattanti, no visaṃyogāya; ācayāya saṃvattanti, no apacayāya; mahicchatāya saṃvattanti, no appicchatāya; asantuṭṭhiyā saṃvattanti, no santuṭṭhiyā; saṅgaṇikāya saṃvattanti, no pavivekāya; kosajjāya saṃvattanti, no vīriyārambhāya; dubbharatāya saṃvattanti, no subharatāyā’ti, ekaṃsena, gotami, dhāreyyāsi – ‘neso dhammo, neso vinayo, netaṃ satthusāsana’’’nti. ‘‘Ye ca kho tvaṃ, gotami, dhamme jāneyyāsi – ‘ime dhammā virāgāya saṃvattanti, no sarāgāya; visaṃyogāya saṃvattanti, no saṃyogāya; apacayāya saṃvattanti, no ācayāya; appicchatāya saṃvattanti, no mahicchatāya; santuṭṭhiyā saṃvattanti, no asantuṭṭhiyā; pavivekāya saṃvattanti, no saṅgaṇikāya; vīriyārambhāya saṃvattanti, no kosajjāya; subharatāya saṃvattanti, no dubbharatāyā’ti, ekaṃsena, gotami, dhāreyyāsi – ‘eso dhammo, eso vinayo, etaṃ satthusāsana’’’nti. Tatiyaṃ.",
      "english": "One time, the Blessed One was dwelling in Vesālī, in the Great Forest, at the Gabled Hall. Then Mahāpajāpatī Gotamī approached the Blessed One. Having approached and paid homage to the Blessed One, she stood to one side. Standing to one side, Mahāpajāpatī Gotamī said to the Blessed One, \"It would be good, venerable sir, if the Blessed One would teach me the Dhamma in brief, so that having heard the Dhamma from the Blessed One, I might dwell alone, secluded, diligent, ardent, and resolute.\"\n\n\"Gotamī, those things about which you might know: 'These things lead to attachment, not to dispassion; they lead to bondage, not to release; they lead to accumulation, not to shedding; they lead to great desires, not to few desires; they lead to discontent, not to contentment; they lead to entanglement in company, not to seclusion; they lead to laziness, not to the arousal of energy; they lead to being difficult to support, not to being easy to support'—Gotamī, you may definitively hold that 'This is not the Dhamma, this is not the Vinaya, this is not the Teacher's instruction.'\"\n\n\"But, Gotamī, those things about which you might know: 'These things lead to dispassion, not to attachment; they lead to release, not to bondage; they lead to shedding, not to accumulation; they lead to few desires, not to great desires; they lead to contentment, not to discontent; they lead to seclusion, not to entanglement in company; they lead to the arousal of energy, not to laziness; they lead to being easy to support, not to being difficult to support'—Gotamī, you may definitively hold that 'This is the Dhamma, this is the Vinaya, this is the Teacher's instruction.'\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ වෛශාලියෙහි මහාවනයෙහි කූටාගාරශාලාවෙහි වැඩවසන සේක. ඉන්පසු මහාප්‍රජාපතී ගෝතමිය භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙක සිටියාය. එකත්පසෙක සිටියා වූ ඒ මහාප්‍රජාපතී ගෝතමිය භාග්‍යවතුන් වහන්සේට මෙය කීවාය: \"ස්වාමීනී, භාග්‍යවතුන් වහන්සේ මට සංක්ෂිප්තයෙන් ධර්මය දේශනා කරන සේක්වා! මම භාග්‍යවතුන් වහන්සේගේ ධර්මය ශ්‍රවණය කොට, තනිව, වෙන්ව වාසය කරමින්, අප්‍රමාදීව, වීර්යයෙන් යුක්තව, සිත යොමා වාසය කරන්නට හැකි වන්නෙමි.\"\n\n\"ගෝතමිය, යම් ධර්මයන් පිළිබඳව ඔබ මෙසේ දැනගන්නේ නම් – ‘මේ ධර්මයන් රාගය පිණිස පවතී, විරාගය පිණිස නොපවතී; බැඳීම් පිණිස පවතී, බැඳීම් වලින් මිදීම පිණිස නොවේ; (දෝෂ) වැඩීම පිණිස පවතී, ක්ෂය වීම පිණිස නොවේ; මහත් වූ ආශාව පිණිස පවතී, අල්පේච්ඡභාවය පිණිස නොවේ; නොසතුට පිණිස පවතී, සතුට පිණිස නොවේ; සමූහයක් සමඟ සිටීම පිණිස පවතී, හුදකලාව පිණිස නොවේ; අලසකම පිණිස පවතී, වීර්යය ආරම්භ කිරීම පිණිස නොවේ; දුෂ්කර ලෙස ජීවත්වීම පිණිස පවතී, පහසු ලෙස ජීවත්වීම පිණිස නොවේ’යි, ගෝතමිය, ඔබ ඒකාන්තයෙන්ම මෙය ධාරණය කරගන්න – ‘ඒ ධර්මයක් නොවේ, ඒ විනයක් නොවේ, ඒ ශාස්තෘන් වහන්සේගේ ශාසනය නොවේ’\"\n\n\"තවද, ගෝතමිය, යම් ධර්මයන් පිළිබඳව ඔබ මෙසේ දැනගන්නේ නම් – ‘මේ ධර්මයන් විරාගය පිණිස පවතී, රාගය පිණිස නොපවතී; බැඳීම් වලින් මිදීම පිණිස පවතී, බැඳීම් පිණිස නොවේ; (දෝෂ) ක්ෂය වීම පිණිස පවතී, වැඩීම පිණිස නොවේ; අල්පේච්ඡභාවය පිණිස පවතී, මහත් වූ ආශාව පිණිස නොවේ; සතුට පිණිස පවතී, නොසතුට පිණිස නොවේ; හුදකලාව පිණිස පවතී, සමූහයක් සමඟ සිටීම පිණිස නොවේ; වීර්යය ආරම්භ කිරීම පිණිස පවතී, අලසකම පිණිස නොවේ; පහසු ලෙස ජීවත්වීම පිණිස පවතී, දුෂ්කර ලෙස ජීවත්වීම පිණිස නොවේ’යි, ගෝතමිය, ඔබ ඒකාන්තයෙන්ම මෙය ධාරණය කරගන්න – ‘ඒ ධර්මයයි, ඒ විනයයි, ඒ ශාස්තෘන් වහන්සේගේ ශාසනයයි’\"",
      "paliTitle": "Saṃkhittasuttaṃ",
      "englishTitle": "The Concise Discourse",
      "sinhalaTitle": "සංඛිත්ත සූත්‍‌රය"
    },
    {
      "number": 54,
      "pali": "Ekaṃ samayaṃ bhagavā koliyesu viharati kakkarapattaṃ nāma koliyānaṃ nigamo. Atha kho dīghajāṇu koliyaputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho dīghajāṇu koliyaputto bhagavantaṃ etadavoca – ‘‘mayaṃ, bhante, gihī kāmabhogino [kāmabhogī (sī. syā. pī.)] puttasambādhasayanaṃ ajjhāvasāma, kāsikacandanaṃ paccanubhoma, mālāgandhavilepanaṃ dhārayāma, jātarūparajataṃ sādayāma. Tesaṃ no, bhante, bhagavā amhākaṃ tathā dhammaṃ desetu ye amhākaṃ assu dhammā diṭṭhadhammahitāya diṭṭhadhammasukhāya, samparāyahitāya samparāyasukhāyā’’ti. ‘‘Cattārome, byagghapajja, dhammā kulaputtassa diṭṭhadhammahitāya saṃvattanti diṭṭhadhammasukhāya. Katame cattāro? Uṭṭhānasampadā, ārakkhasampadā, kalyāṇamittatā, samajīvitā [samajīvikatā (sī.) a. ni. 8.75]. Katamā ca, byagghapajja, uṭṭhānasampadā? Idha, byagghapajja, kulaputto yena kammaṭṭhānena jīvikaṃ [jīvitaṃ (ka.)] kappeti – yadi kasiyā, yadi vaṇijjāya, yadi gorakkhena, yadi issattena [issatthena (sī. syā. pī.)], yadi rājaporisena, yadi sippaññatarena – tattha dakkho hoti analaso, tatrupāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. Ayaṃ vuccati, byagghapajja, uṭṭhānasampadā. ‘‘Katamā ca, byagghapajja, ārakkhasampadā? Idha, byagghapajja, kulaputtassa bhogā honti uṭṭhānavīriyādhigatā bāhābalaparicitā, sedāvakkhittā, dhammikā dhammaladdhā. Te ārakkhena guttiyā sampādeti – ‘kinti me ime bhoge neva rājāno hareyyuṃ, na corā hareyyuṃ, na aggi ḍaheyya, na udakaṃ vaheyya, na appiyā dāyādā hareyyu’nti! Ayaṃ vuccati, byagghapajja, ārakkhasampadā. ‘‘Katamā ca, byagghapajja, kalyāṇamittatā? Idha, byagghapajja, kulaputto yasmiṃ gāme vā nigame vā paṭivasati, tattha ye te honti – gahapatī vā gahapatiputtā vā daharā vā vuddhasīlino, vuddhā vā vuddhasīlino, saddhāsampannā, sīlasampannā, cāgasampannā, paññāsampannā – tehi saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati; yathārūpānaṃ saddhāsampannānaṃ saddhāsampadaṃ anusikkhati, yathārūpānaṃ sīlasampannānaṃ sīlasampadaṃ anusikkhati, yathārūpānaṃ cāgasampannānaṃ cāgasampadaṃ anusikkhati, yathārūpānaṃ paññāsampannānaṃ paññāsampadaṃ anusikkhati. Ayaṃ vuccati, byagghapajja, kalyāṇamittatā. ‘‘Katamā ca, byagghapajja, samajīvitā? Idha, byagghapajja, kulaputto āyañca bhogānaṃ viditvā, vayañca bhogānaṃ viditvā, samaṃ jīvikaṃ [samajīvikaṃ (syā.), samajīvitaṃ (ka.)] kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Seyyathāpi, byagghapajja, tulādhāro vā tulādhārantevāsī vā tulaṃ paggahetvā jānāti – ‘ettakena vā onataṃ [oṇataṃ (ka.)], ettakena vā unnata’nti [uṇṇatanti (ka.)]; evamevaṃ kho, byagghapajja, kulaputto āyañca bhogānaṃ viditvā, vayañca bhogānaṃ viditvā, samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Sacāyaṃ, byagghapajja, kulaputto appāyo samāno uḷāraṃ jīvikaṃ [jīvitaṃ (ka.)] kappeti, tassa bhavanti vattāro – ‘udumbarakhādīvāyaṃ [udumbarakhādikaṃ vāyaṃ (sī. pī.), udumbarakhādakaṃ cāyaṃ (syā.)] kulaputto bhoge khādatī’ti. Sace panāyaṃ, byagghapajja, kulaputto mahāyo samāno kasiraṃ jīvikaṃ [jīvitaṃ (ka.)] kappeti, tassa bhavanti vattāro – ‘ajeṭṭhamaraṇaṃvāyaṃ [ajaddhumārikaṃ vāyaṃ (sī. pī.), addhamārakaṃ cāyaṃ (syā.), ettha jaddhūti asanaṃ = bhattabhuñjanaṃ, tasmā ajaddhumārikanti anasanamaraṇanti vuttaṃ hoti. ma. ni. 1.379 adholipiyā ‘‘ajaddhuka’’nti padaṃ dassitaṃ] kulaputto marissatī’ti. Yato ca khoyaṃ, byagghapajja, kulaputto āyañca bhogānaṃ viditvā, vayañca bhogānaṃ viditvā, samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Ayaṃ vuccati, byagghapajja, samajīvitā. ‘‘Evaṃ samuppannānaṃ, byagghapajja, bhogānaṃ cattāri apāyamukhāni honti – itthidhutto, surādhutto, akkhadhutto, pāpamitto pāpasahāyo pāpasampavaṅko. Seyyathāpi, byagghapajja, mahato taḷākassa cattāri ceva āyamukhāni, cattāri ca apāyamukhāni. Tassa puriso yāni ceva āyamukhāni tāni pidaheyya, yāni ca apāyamukhāni tāni vivareyya; devo ca na sammā dhāraṃ anuppaveccheyya. Evañhi tassa, byagghapajja, mahato taḷākassa parihāniyeva pāṭikaṅkhā, no vuddhi; evamevaṃ, byagghapajja, evaṃ samuppannānaṃ bhogānaṃ cattāri apāyamukhāni honti – itthidhutto, surādhutto, akkhadhutto, pāpamitto pāpasahāyo pāpasampavaṅko. ‘‘Evaṃ samuppannānaṃ, byagghapajja, bhogānaṃ cattāri āyamukhāni honti – na itthidhutto, na surādhutto, na akkhadhutto, kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko. Seyyathāpi, byagghapajja, mahato taḷākassa cattāri ceva āyamukhāni, cattāri ca apāyamukhāni. Tassa puriso yāni ceva āyamukhāni tāni vivareyya, yāni ca apāyamukhāni tāni pidaheyya; devo ca sammā dhāraṃ anuppaveccheyya. Evañhi tassa, byagghapajja, mahato taḷākassa vuddhiyeva pāṭikaṅkhā, no parihāni; evamevaṃ kho, byagghapajja, evaṃ samuppannānaṃ bhogānaṃ cattāri āyamukhāni honti – na itthidhutto, na surādhutto, na akkhadhutto, kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko. Ime kho, byagghapajja, cattāro dhammā kulaputtassa diṭṭhadhammahitāya saṃvattanti diṭṭhadhammasukhāya. ‘‘Cattārome, byagghapajja, dhammā kulaputtassa samparāyahitāya saṃvattanti samparāyasukhāya. Katame cattāro? Saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā. Katamā ca, byagghapajja, saddhāsampadā? Idha, byagghapajja, kulaputto saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Ayaṃ vuccati, byagghapajja, saddhāsampadā. ‘‘Katamā ca, byagghapajja, sīlasampadā? Idha, byagghapajja, kulaputto pāṇātipātā paṭivirato hoti… pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṃ vuccati, byagghapajja, sīlasampadā. ‘‘Katamā ca, byagghapajja, cāgasampadā? Idha, byagghapajja, kulaputto vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato. Ayaṃ vuccati, byagghapajja, cāgasampadā. ‘‘Katamā ca, byagghapajja, paññāsampadā? Idha, byagghapajja, kulaputto paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Ayaṃ vuccati, byagghapajja, paññāsampadā. Ime kho, byagghapajja, cattāro dhammā kulaputtassa samparāyahitāya saṃvattanti samparāyasukhāyā’’ti. ‘‘Uṭṭhātā kammadheyyesu, appamatto vidhānavā; Samaṃ kappeti jīvikaṃ [jīvitaṃ (ka.)], sambhataṃ anurakkhati. ‘‘Saddho sīlena sampanno, vadaññū vītamaccharo; Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ. ‘‘Iccete aṭṭha dhammā ca, saddhassa gharamesino; Akkhātā saccanāmena, ubhayattha sukhāvahā. ‘‘Diṭṭhadhammahitatthāya, samparāyasukhāya ca; Evametaṃ gahaṭṭhānaṃ, cāgo puññaṃ pavaḍḍhatī’’ti. catutthaṃ;",
      "english": "At one time the Blessed One was dwelling among the Koliyans, in a Koliyan town called Kakkarapatta. Then Dīghajāṇu, a Koliyan son, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, Dīghajāṇu, the Koliyan son, said this to the Blessed One: \"Venerable Sir, we are householders who enjoy sensual pleasures, who dwell in a home crowded with children, who use Kasi sandalwood, who wear garlands, scents, and ointments, and who delight in gold and silver. For us, Venerable Sir, may the Blessed One teach a doctrine that leads to our welfare and happiness in this present life, and to our welfare and happiness in future lives.\"\n\n\"There are, Vyagghapajja, these four qualities that lead to a householder's welfare and happiness in this very life. Which four? Accomplishment in persistent effort, accomplishment in protection, good friendship, and balanced livelihood.\"\n\n\"And what, Vyagghapajja, is accomplishment in persistent effort? Here, Vyagghapajja, a householder, by whatever occupation he earns his living – be it by farming, by trade, by cattle-breeding, by archery, by government service, or by any other craft – in that work he is skillful and diligent, endowed with an analytical approach to its methods, capable of doing it and capable of arranging it. This, Vyagghapajja, is called accomplishment in persistent effort.\"\n\n\"And what, Vyagghapajja, is accomplishment in protection? Here, Vyagghapajja, a householder has wealth acquired through energetic endeavor, accumulated by the strength of his arms, earned by the sweat of his brow, justly gained and lawfully obtained. He safeguards that wealth with protection and care, thinking: 'How can I prevent kings from seizing these possessions, thieves from stealing them, fire from burning them, floods from carrying them away, or undesirable heirs from squandering them?' This, Vyagghapajja, is called accomplishment in protection.\"\n\n\"And what, Vyagghapajja, is good friendship? Here, Vyagghapajja, a householder living in any village or town, associates with those householders or sons of householders, be they young in years but mature in virtue, or elderly and mature in virtue, who are accomplished in faith, accomplished in virtue, accomplished in generosity, and accomplished in wisdom – he sits together with them, converses with them, and engages in discussions with them; he emulates the accomplishment in faith of those who are accomplished in faith, he emulates the accomplishment in virtue of those who are accomplished in virtue, he emulates the accomplishment in generosity of those who are accomplished in generosity, and he emulates the accomplishment in wisdom of those who are accomplished in wisdom. This, Vyagghapajja, is called good friendship.\"\n\n\"And what, Vyagghapajja, is balanced livelihood? Here, Vyagghapajja, a householder, having understood his income and his expenses, maintains a balanced livelihood, neither overly extravagant nor excessively frugal – thinking: 'Thus my income will be sufficient for my expenses, and my expenses will not exceed my income.' Just as, Vyagghapajja, a weigh-master or his apprentice, holding up a scale, knows: 'It has dipped by this much, or risen by this much'; even so, Vyagghapajja, a householder, having understood his income and his expenses, maintains a balanced livelihood, neither overly extravagant nor excessively frugal – thinking: 'Thus my income will be sufficient for my expenses, and my expenses will not exceed my income.' If, Vyagghapajja, this householder, having little income, maintains an extravagant livelihood, then those who observe him say: 'This householder is consuming his wealth like one who eats udumbara fruits.' If, however, Vyagghapajja, this householder, having great income, maintains a meager livelihood, then those who observe him say: 'This householder will die like a starvation victim.' But when, Vyagghapajja, a householder, having understood his income and his expenses, maintains a balanced livelihood, neither overly extravagant nor excessively frugal – thinking: 'Thus my income will be sufficient for my expenses, and my expenses will not exceed my income' – this, Vyagghapajja, is called balanced livelihood.\"\n\n\"For wealth thus acquired, Vyagghapajja, there are these four gateways to its dissipation: being addicted to women, being addicted to strong drinks, being addicted to gambling, and having evil friends, evil companions, and evil associates. Just as, Vyagghapajja, a large pond has four inlets and four outlets.\"\n\nIf a man were to close its inlets and open its outlets, and the sky were not to send down proper rain, then, Vyagghapajja, for that great pond, only a decrease is to be expected, not an increase. In the same way, Vyagghapajja, for wealth thus acquired, there are four avenues of depletion: addiction to women, addiction to intoxicants, addiction to gambling, and having evil friends, evil companions, and evil associates. For wealth thus acquired, Vyagghapajja, there are four avenues of growth: not being addicted to women, not being addicted to intoxicants, not being addicted to gambling, and having admirable friends, admirable companions, and admirable associates.\n\nJust as, Vyagghapajja, for a great pond, there are four inlets and four outlets. If a man were to open its inlets and close its outlets, and the sky were to send down proper rain, then, Vyagghapajja, for that great pond, only an increase is to be expected, not a decrease. Exactly so, Vyagghapajja, for wealth thus acquired, there are four avenues of growth: not being addicted to women, not being addicted to intoxicants, not being addicted to gambling, and having admirable friends, admirable companions, and admirable associates. Indeed, Vyagghapajja, these four qualities lead to the welfare and happiness of a householder in this very life.\n\nThese four qualities, Vyagghapajja, lead to the welfare and happiness of a householder in the future life. Which four? Accomplishment in faith, accomplishment in virtue, accomplishment in generosity, and accomplishment in wisdom. And what, Vyagghapajja, is accomplishment in faith? Here, Vyagghapajja, a householder is endowed with faith; he has faith in the Tathāgata's Enlightenment, believing: 'Indeed, the Blessed One is Accomplished, Fully Enlightened, endowed with knowledge and conduct, sublime, knower of worlds, unsurpassed guide of those who wish to train, teacher of gods and humans, the Buddha, the Blessed One.' This, Vyagghapajja, is called accomplishment in faith. And what, Vyagghapajja, is accomplishment in virtue? Here, Vyagghapajja, a householder abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from fermented and distilled intoxicants which are a basis for heedlessness. This, Vyagghapajja, is called accomplishment in virtue. And what, Vyagghapajja, is accomplishment in generosity? Here, Vyagghapajja, a householder dwells at home with a mind free from the stain of stinginess, open-handed, pure in hand, delighting in relinquishment, responsive to requests, and delighting in distributing gifts. This, Vyagghapajja, is called accomplishment in generosity. And what, Vyagghapajja, is accomplishment in wisdom? Here, Vyagghapajja, a householder is wise; he is endowed with wisdom that discerns rise and fall, noble, penetrative, and leading to the complete destruction of suffering. This, Vyagghapajja, is called accomplishment in wisdom. Indeed, Vyagghapajja, these four qualities lead to the welfare and happiness of a householder in the future life.\n\nEnergetic in his undertakings, heedful and capable,\nHe manages his livelihood appropriately and protects what he has acquired.\n\nEndowed with faith and virtue, eloquent and free from stinginess,\nHe constantly purifies the path to future well-being.\n\nThus, these eight qualities of the faithful householder,\nDeclared by the Truth-Speaker, lead to happiness in both worlds.\n\nFor the welfare in this present life and happiness in the future life,\nFor householders, in this way, generosity and merit increase.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කෝලියවරුන් අතර කක්කරපත්ත නම් කෝලියවරුන්ගේ නියම්ගමෙහි වැඩවසන සේක. එවිට දීඝජාණු නම් කෝලිය පුත්‍රයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වූ දීඝජාණු කෝලිය පුත්‍රයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – ‘‘ස්වාමීනි, අපි ගිහිවූ, කාමභෝගීවූ අය වෙමු. දරුවන්ගේ ගැටීමෙන් පීඩාකාරී වූ සයනයෙහි (ගෘහජීවිතයෙහි) වාසය කරන්නෙමු. කසී සුවඳ සඳුන් පරිභෝග කරන්නෙමු. මල්, සුවඳ විලවුන් දරන්නෙමු. රන් රිදී ආදිය රස විඳින්නෙමු (පරිභෝග කරන්නෙමු). ස්වාමීනි, අපට මේ ආත්මභාවයෙහි හිත පිණිසත්, මේ ආත්මභාවයෙහි සැප පිණිසත්, පරලොව හිත පිණිසත්, පරලොව සැප පිණිසත් හේතුවන ධර්මයන් භාග්‍යවතුන් වහන්සේ දේශනා කරන සේක්වා!’’\n\n‘‘ව්‍යාඝ්‍රපද, මේ ධර්ම සතර කුල පුත්‍රයෙකුට මේ ආත්මභාවයෙහි හිත පිණිසත්, මේ ආත්මභාවයෙහි සැප පිණිසත් පවතී. ඒ සතර කවරේද? උට්ඨාන සම්පදාව, ආරක්ඛ සම්පදාව, කල්‍යාණ මිත්‍රත්වය, සමජීවිකාව.\n\nව්‍යාඝ්‍රපද, උට්ඨාන සම්පදාව කවරේද? ව්‍යාඝ්‍රපද, මෙහිලා කුල පුත්‍රයා යම් කර්මාන්තයකින් ජීවත් වන්නේද – ගොවිතැනින් හෝ වේවා, වෙළඳාමෙන් හෝ වේවා, ගව පාලනයෙන් හෝ වේවා, දුනු ශිල්පයෙන් හෝ වේවා, රාජ්‍ය සේවයෙන් හෝ වේවා, අන් යම්කිසි ශිල්පයකින් හෝ වේවා – එහි දක්ෂ වේ, අලස නොවේ. එහි උපාය මාර්ග විමසා බැලීමෙන් යුක්ත වේ. එය කිරීමට ද, එය සංවිධානය කිරීමට ද සමත් වේ. ව්‍යාඝ්‍රපද, මෙය උට්ඨාන සම්පදාව යැයි කියනු ලැබේ.\n\n‘‘ව්‍යාඝ්‍රපද, ආරක්ඛ සම්පදාව කවරේද? ව්‍යාඝ්‍රපද, මෙහිලා කුල පුත්‍රයෙකුට උට්ඨාන වීර්යයෙන් ලබාගත්, අත්වල ශක්තියෙන් පුරුදු කළ, දහඩියෙන් උපයාගත්, ධර්මානුකූලව ලද භෝග සම්පත් ඇත. ඒවා ‘රජවරුන් විසින් නොගනු ලැබේවා, සොරුන් විසින් නොගනු ලැබේවා, ගින්නෙන් නොදැවේවා, ජලයෙන් ගසාගෙන නොයනු ලැබේවා, අප්‍රිය දායාදයන් විසින් නොගනු ලැබේවා’ යනුවෙන් ආරක්ෂා කොට සුරක්ෂිතව තබා ගනියි. ව්‍යාඝ්‍රපද, මෙය ආරක්ඛ සම්පදාව යැයි කියනු ලැබේ.\n\n‘‘ව්‍යාඝ්‍රපද, කල්‍යාණ මිත්‍රත්වය කවරේද? ව්‍යාඝ්‍රපද, මෙහිලා කුල පුත්‍රයා යම් ගමක හෝ නියම්ගමක වාසය කරන්නේද, එහි යම් ගෘහපතියෝ හෝ ගෘහපති පුත්‍රයෝ හෝ බාල වුවද වෘද්ධශීලී වූ, වැඩිහිටි වුවද වෘද්ධශීලී වූ, ශ්‍රද්ධාවෙන් යුක්ත වූ, ශීලයෙන් යුක්ත වූ, ත්‍යාගයෙන් යුක්ත වූ, ප්‍රඥාවෙන් යුක්ත වූ අය සිටිත්ද – ඔවුන් සමඟ එක්ව සිටියි, කතාබස් කරයි, සාකච්ඡාවට පැමිණෙයි; යම් ආකාරයේ ශ්‍රද්ධාවෙන් යුක්ත වූවන්ගේ ශ්‍රද්ධා සම්පදාවට අනුව හික්මෙයි, යම් ආකාරයේ ශීලයෙන් යුක්ත වූවන්ගේ ශීල සම්පදාවට අනුව හික්මෙයි, යම් ආකාරයේ ත්‍යාගයෙන් යුක්ත වූවන්ගේ ත්‍යාග සම්පදාවට අනුව හික්මෙයි, යම් ආකාරයේ ප්‍රඥාවෙන් යුක්ත වූවන්ගේ ප්‍රඥා සම්පදාවට අනුව හික්මෙයි. ව්‍යාඝ්‍රපද, මෙය කල්‍යාණ මිත්‍රත්වය යැයි කියනු ලැබේ.\n\n‘‘ව්‍යාඝ්‍රපද, සමජීවිකාව කවරේද? ව්‍යාඝ්‍රපද, මෙහිලා කුල පුත්‍රයා භෝගයන්ගේ ආදායම ද, භෝගයන්ගේ වියදම ද දැනගෙන, ඉතා අධික නොවූ, ඉතා පහත් නොවූ සම වූ ජීවිකාවක් පවත්වා ගනියි. ‘මෙසේ මාගේ ආදායම වියදම ඉක්මවා පවතීවා, මාගේ වියදම ආදායම ඉක්මවා නොපවතීවා’ යනුවෙන් (සිතා). ව්‍යාඝ්‍රපද, යම් සේ තරාදි දරන්නෙකු හෝ තරාදි දරන්නෙකුගේ අතවැසියෙකු හෝ තරාදියක් ගෙන ‘මේ ප්‍රමාණයෙන් බරවී ඇත, මේ ප්‍රමාණයෙන් සැහැල්ලු වී ඇත’ යැයි දන්නේද; එලෙසින්ම ව්‍යාඝ්‍රපද, කුල පුත්‍රයා භෝගයන්ගේ ආදායම ද, භෝගයන්ගේ වියදම ද දැනගෙන, ඉතා අධික නොවූ, ඉතා පහත් නොවූ සම වූ ජීවිකාවක් පවත්වා ගනියි. ‘මෙසේ මාගේ ආදායම වියදම ඉක්මවා පවතීවා, මාගේ වියදම ආදායම ඉක්මවා නොපවතීවා’ යනුවෙන් (සිතා). ව්‍යාඝ්‍රපද, යම් හෙයකින් මේ කුල පුත්‍රයා අඩු ආදායමක් ඇතිව මහත් වූ ජීවිකාවක් පවත්වා ගනියි නම්, ඒ පිළිබඳව කියන්නෝ සිටිති – ‘මේ කුල පුත්‍රයා උදුම්බරා කනවාක් මෙන් (පමණක්) භෝග විනාශ කරයි’ කියා. නමුත් ව්‍යාඝ්‍රපද, යම් හෙයකින් මේ කුල පුත්‍රයා මහත් ආදායමක් ඇතිව දුෂ්කර ජීවිකාවක් පවත්වා ගනියි නම්, ඒ පිළිබඳව කියන්නෝ සිටිති – ‘මේ කුල පුත්‍රයා අත්හැරීමකින් තොරව (කුසගින්නේ) මියයනු ඇත’ කියා. ව්‍යාඝ්‍රපද, මේ කුල පුත්‍රයා භෝගයන්ගේ ආදායම ද, භෝගයන්ගේ වියදම ද දැනගෙන, ඉතා අධික නොවූ, ඉතා පහත් නොවූ සම වූ ජීවිකාවක් පවත්වා ගන්නේ ‘මෙසේ මාගේ ආදායම වියදම ඉක්මවා පවතීවා, මාගේ වියදම ආදායම ඉක්මවා නොපවතීවා’ යනුවෙනි. ව්‍යාඝ්‍රපද, මෙය සමජීවිකාව යැයි කියනු ලැබේ.\n\n‘‘ව්‍යාඝ්‍රපද, මෙසේ උපයාගත් භෝගයන්ට අපායමුඛ (විනාශ වීමට හේතු) සතරක් වෙති – ස්ත්‍රී දුශ්චරිතයෙහි ඇලීම, සුරාපානයෙහි ඇලීම, සූදුවෙහි ඇලීම, පාප මිත්‍රයන් ඇසුරු කිරීම, පාප සහාය වීම, පාප මිත්‍රයන් සමඟ මිශ්‍ර වීම. ව්‍යාඝ්‍රපද, යම් සේ මහත් පොකුණකට ආදායම් මාර්ග හතරක්ද, අපාය මාර්ග (ජලය බැස යා හැකි මාර්ග) හතරක්ද ඇත්තාක් මෙනි.\n\nඒ පුරුෂයා යම් ආදායම් මාර්ග ඇත්තේද, ඒවා වසා දමන්නේය. යම් විනාශකාරී වියදම් මාර්ග ඇත්තේද, ඒවා විවෘත කරන්නේය. වැස්සද නිවැරදිව ජල ධාරා ඇතුළු නොකරන්නේය. ව්‍යාඝ්‍රපද්‍යයෙනි, එසේනම් එම විශාල පොකුණට හානියක්ම මිස දියුණුවක් බලාපොරොත්තු විය යුතුය. ව්‍යාඝ්‍රපද්‍යයෙනි, එලෙසම උපදවාගත් භෝග (වස්තු) වලට අපාය (විනාශකාරී වියදම්) මාර්ග සතරක් ඇත – ස්ත්‍රී ලාලසාවන්ට ඇලීම, සුරාපානයට ඇලීම, සූදුවට ඇලීම, දුර්මිත්‍රයන් ඇසුරු කිරීම, දුර්මිත්‍රයන් සමග වාසය කිරීම.\n\nව්‍යාඝ්‍රපද්‍යයෙනි, එලෙසම උපදවාගත් භෝග (වස්තු) වලට ආය (ආදායම්) මාර්ග සතරක් ඇත – ස්ත්‍රී ලාලසාවන්ට ඇලීමෙන් තොරවීම, සුරාපානයට ඇලීමෙන් තොරවීම, සූදුවට ඇලීමෙන් තොරවීම, කල්‍යාණ මිත්‍රයන් ඇසුරු කිරීම, කල්‍යාණ මිත්‍රයන් සමග වාසය කිරීම. ව්‍යාඝ්‍රපද්‍යයෙනි, යම්සේ මහත් පොකුණකට ආදායම් මාර්ග සතරක්ද, විනාශකාරී වියදම් මාර්ග සතරක්ද ඇත්තේද, ඒ පුරුෂයා යම් ආදායම් මාර්ග ඇත්තේද, ඒවා විවෘත කරන්නේය. යම් විනාශකාරී වියදම් මාර්ග ඇත්තේද, ඒවා වසා දමන්නේය. වැස්සද නිවැරදිව ජල ධාරා ඇතුළු කරන්නේය. ව්‍යාඝ්‍රපද්‍යයෙනි, එසේනම් එම විශාල පොකුණට දියුණුවක්ම මිස හානියක් බලාපොරොත්තු විය යුතුය. ව්‍යාඝ්‍රපද්‍යයෙනි, එලෙසම උපදවාගත් භෝග (වස්තු) වලට ආදායම් මාර්ග සතරක් ඇත – ස්ත්‍රී ලාලසාවන්ට ඇලීමෙන් තොරවීම, සුරාපානයට ඇලීමෙන් තොරවීම, සූදුවට ඇලීමෙන් තොරවීම, කල්‍යාණ මිත්‍රයන් ඇසුරු කිරීම, කල්‍යාණ මිත්‍රයන් සමග වාසය කිරීම. ව්‍යාඝ්‍රපද්‍යයෙනි, මේ ධර්ම සතර කුලපුත්‍රයාට මේ ආත්ම භාවයේ හිත පිණිසත්, මේ ආත්ම භාවයේ සැප පිණිසත් පවතී.\n\nව්‍යාඝ්‍රපද්‍යයෙනි, මේ ධර්ම සතර කුලපුත්‍රයාට මතු ආත්ම භාවයේ හිත පිණිසත්, මතු ආත්ම භාවයේ සැප පිණිසත් පවතී. කවරේද ඒ සතර? ශ්‍රද්ධා සම්පදාව, ශීල සම්පදාව, ත්‍යාග සම්පදාව, ප්‍රඥා සම්පදාව. ව්‍යාඝ්‍රපද්‍යයෙනි, ශ්‍රද්ධා සම්පදාව කවරේද? ව්‍යාඝ්‍රපද්‍යයෙනි, මෙහිලා කුලපුත්‍රයා ශ්‍රද්ධාවන්ත වෙයි. තථාගතයන් වහන්සේගේ අවබෝධය විශ්වාස කරයි – ‘එසේ ද ඒ භාග්‍යවතුන් වහන්සේ... (යන ආදී වශයෙන්)... දෙවි මිනිසුන්ට ශාස්තෘ වූ, බුදු වූ, භාග්‍යවතුන් වහන්සේය’ යනුවෙනි. ව්‍යාඝ්‍රපද්‍යයෙනි, මේ ශ්‍රද්ධා සම්පදාව යැයි කියනු ලැබේ. ව්‍යාඝ්‍රපද්‍යයෙනි, ශීල සම්පදාව කවරේද? ව්‍යාඝ්‍රපද්‍යයෙනි, මෙහිලා කුලපුත්‍රයා පණ නැසීමෙන් වළක්නාසුලු වෙයි... (යන ආදී වශයෙන්)... සුරා-මේරය-මද්‍යපමාදස්ථානයෙන් (මත්පැන් පානයෙන්) වළක්නාසුලු වෙයි. ව්‍යාඝ්‍රපද්‍යයෙනි, මේ ශීල සම්පදාව යැයි කියනු ලැබේ. ව්‍යාඝ්‍රපද්‍යයෙනි, ත්‍යාග සම්පදාව කවරේද? ව්‍යාඝ්‍රපද්‍යයෙනි, මෙහිලා කුලපුත්‍රයා පහව ගිය මසුරු මල ඇති සිතින් යුතුව ගිහි ගෙයි වසයි. මුදාහළ දන් ඇත්තෙක්, පිරිසිදු දෑත් ඇත්තෙක්, අත්හැරීමට ඇලුණෙක්, යදින්නන්ට යොමු වූවෙක්, දන් බෙදා දීමට ඇලුණෙක් වෙයි. ව්‍යාඝ්‍රපද්‍යයෙනි, මේ ත්‍යාග සම්පදාව යැයි කියනු ලැබේ. ව්‍යාඝ්‍රපද්‍යයෙනි, ප්‍රඥා සම්පදාව කවරේද? ව්‍යාඝ්‍රපද්‍යයෙනි, මෙහිලා කුලපුත්‍රයා ප්‍රඥාවන්ත වෙයි. ඇතිවීම සහ නැතිවීම දකින ප්‍රඥාවෙන් යුක්ත වෙයි. ආර්ය වූ, (සත්‍යය) විනිවිද දකින, දුක් ක්ෂය කිරීම කරා නිවැරදිව පමුණුවන ප්‍රඥාවෙන් යුක්ත වෙයි. ව්‍යාඝ්‍රපද්‍යයෙනි, මේ ප්‍රඥා සම්පදාව යැයි කියනු ලැබේ. ව්‍යාඝ්‍රපද්‍යයෙනි, මේ ධර්ම සතර කුලපුත්‍රයාට මතු ආත්ම භාවයේ හිත පිණිසත්, මතු ආත්ම භාවයේ සැප පිණිසත් පවතී.\n\nකටයුතු වලදී උත්සාහවත් වූ, නොපමා වූ, ක්‍රමවත් වූ යමෙක්,\nජීවිතය සම සේ පවත්වාගෙන යයි, රැස්කරගත් වස්තු රැකබලා ගනියි.\n\nශ්‍රද්ධාවෙන් යුක්ත වූ, සීලයෙන් සම්පූර්ණ වූ, (දීමෙහි) පුරුදු වූ, මසුරු මල පහ කළ යමෙක්,\nනිරතුරුව මතු ලෝකයේ යහපත (නිවන) පිණිස මාර්ගය පිරිසිදු කරන්නේය.\n\nමෙලෙස, මේ ධර්ම අට ශ්‍රද්ධාවන්ත ගිහියාට,\nසත්‍ය වශයෙන්ම පවසා ඇත්තේ, උභය අර්ථය පිණිස සැප ගෙන දෙන්නා වූ දහම් ලෙසිනි.\n\nමේ ආත්ම භාවයේ හිත පිණිසත්, මතු ආත්ම භාවයේ සැප පිණිසත්,\nමෙලෙස ගෘහස්ථයාගේ ත්‍යාගය හා පින දියුණු වෙයි.",
      "paliTitle": "Dīghajāṇusuttaṃ",
      "englishTitle": "The Dīghajāṇu Sutta",
      "sinhalaTitle": "දීඝජාණු සූත්‍‌රය"
    },
    {
      "number": 55,
      "pali": "Atha kho ujjayo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho ujjayo brāhmaṇo bhagavantaṃ etadavoca – ‘‘mayaṃ, bho gotama, pavāsaṃ gantukāmā. Tesaṃ no bhavaṃ gotamo amhākaṃ tathā dhammaṃ desetu – ye amhākaṃ assu dhammā diṭṭhadhammahitāya, diṭṭhadhammasukhāya, samparāyahitāya, samparāyasukhāyā’’ti. ‘‘Cattārome, brāhmaṇa, dhammā kulaputtassa diṭṭhadhammahitāya saṃvattanti, diṭṭhadhammasukhāya. Katame cattāro? Uṭṭhānasampadā, ārakkhasampadā, kalyāṇamittatā, samajīvitā. Katamā ca, brāhmaṇa, uṭṭhānasampadā? Idha, brāhmaṇa, kulaputto yena kammaṭṭhānena jīvikaṃ kappeti – yadi kasiyā, yadi vaṇijjāya, yadi gorakkhena, yadi issattena, yadi rājaporisena, yadi sippaññatarena – tattha dakkho hoti analaso, tatrupāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. Ayaṃ vuccati, brāhmaṇa, uṭṭhānasampadā. ‘‘Katamā ca, brāhmaṇa, ārakkhasampadā? Idha, brāhmaṇa, kulaputtassa bhogā honti uṭṭhānavīriyādhigatā, bāhābalaparicitā, sedāvakkhittā, dhammikā dhammaladdhā. Te ārakkhena guttiyā sampādeti – ‘kinti me ime bhoge neva rājāno hareyyuṃ, na corā hareyyuṃ, na aggi ḍaheyya, na udakaṃ vaheyya, na appiyā dāyādā hareyyu’nti. Ayaṃ vuccati, brāhmaṇa, ārakkhasampadā. ‘‘Katamā ca, brāhmaṇa, kalyāṇamittatā? Idha, brāhmaṇa, kulaputto yasmiṃ gāme vā nigame vā paṭivasati tatra ye te honti – gahapatī vā gahapatiputtā vā daharā vā vuddhasīlino, vuddhā vā vuddhasīlino, saddhāsampannā, sīlasampannā, cāgasampannā, paññāsampannā – tehi saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati; yathārūpānaṃ saddhāsampannānaṃ saddhāsampadaṃ anusikkhati, yathārūpānaṃ sīlasampannānaṃ sīlasampadaṃ anusikkhati, yathārūpānaṃ cāgasampannānaṃ cāgasampadaṃ anusikkhati, yathārūpānaṃ paññāsampannānaṃ paññāsampadaṃ anusikkhati. Ayaṃ vuccati, brāhmaṇa, kalyāṇamittatā. ‘‘Katamā ca, brāhmaṇa, samajīvitā? Idha, brāhmaṇa, kulaputto āyañca bhogānaṃ viditvā vayañca bhogānaṃ viditvā samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Seyyathāpi, brāhmaṇa, tulādhāro vā tulādhārantevāsī vā tulaṃ paggahetvā jānāti – ‘ettakena vā onataṃ, ettakena vā unnata’nti; evamevaṃ kho, brāhmaṇa, kulaputto āyañca bhogānaṃ viditvā vayañca bhogānaṃ viditvā samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti. Sacāyaṃ, brāhmaṇa, kulaputto appāyo samāno uḷāraṃ jīvikaṃ kappeti, tassa bhavanti vattāro – ‘udumbarakhādīvāyaṃ kulaputto bhoge khādatī’ti. Sace panāyaṃ, brāhmaṇa, kulaputto mahāyo samāno kasiraṃ jīvikaṃ kappeti, tassa bhavanti vattāro – ‘ajeṭṭhamaraṇaṃvāyaṃ kulaputto marissatī’ti. Yato ca khoyaṃ, brāhmaṇa, kulaputto āyañca bhogānaṃ viditvā vayañca bhogānaṃ viditvā samaṃ jīvikaṃ kappeti nāccogāḷhaṃ nātihīnaṃ – ‘evaṃ me āyo vayaṃ pariyādāya ṭhassati, na ca me vayo āyaṃ pariyādāya ṭhassatī’ti, ayaṃ vuccati, brāhmaṇa, samajīvitā. ‘‘Evaṃ samuppannānaṃ, brāhmaṇa, bhogānaṃ cattāri apāyamukhāni honti – itthidhutto, surādhutto, akkhadhutto, pāpamitto pāpasahāyo pāpasampavaṅko. Seyyathāpi, brāhmaṇa, mahato taḷākassa cattāri ceva āyamukhāni, cattāri ca apāyamukhāni. Tassa puriso yāni ceva āyamukhāni tāni pidaheyya, yāni ca apāyamukhāni tāni vivareyya; devo ca na sammā dhāraṃ anuppaveccheyya. Evañhi tassa brāhmaṇa, mahato taḷākassa parihāniyeva pāṭikaṅkhā, no vuddhi; evamevaṃ kho, brāhmaṇa, evaṃ samuppannānaṃ bhogānaṃ cattāri apāyamukhāni honti – itthidhutto, surādhutto, akkhadhutto, pāpamitto pāpasahāyo pāpasampavaṅko. ‘‘Evaṃ samuppannānaṃ, brāhmaṇa, bhogānaṃ cattāri āyamukhāni honti – na itthidhutto, na surādhutto, na akkhadhutto, kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko. Seyyathāpi, brāhmaṇa, mahato taḷākassa cattāri ceva āyamukhāni cattāri ca apāyamukhāni. Tassa puriso yāni ceva āyamukhāni tāni vivareyya, yāni ca apāyamukhāni tāni pidaheyya; devo ca sammā dhāraṃ anuppaveccheyya. Evañhi tassa, brāhmaṇa, mahato taḷākassa vuddhiyeva pāṭikaṅkhā, no parihāni; evamevaṃ kho, brāhmaṇa, evaṃ samuppannānaṃ bhogānaṃ cattāri āyamukhāni honti – na itthidhutto…pe… kalyāṇasampavaṅko. Ime kho, brāhmaṇa, cattāro dhammā kulaputtassa diṭṭhadhammahitāya saṃvattanti diṭṭhadhammasukhāya. ‘‘Cattārome, brāhmaṇa, kulaputtassa dhammā samparāyahitāya saṃvattanti samparāyasukhāya. Katame cattāro? Saddhāsampadā, sīlasampadā, cāgasampadā, paññāsampadā. Katamā ca, brāhmaṇa, saddhāsampadā? Idha, brāhmaṇa, kulaputto saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Ayaṃ vuccati, brāhmaṇa, saddhāsampadā. ‘‘Katamā ca, brāhmaṇa, sīlasampadā? Idha, brāhmaṇa, kulaputto pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Ayaṃ vuccati, brāhmaṇa, sīlasampadā. ‘‘Katamā ca, brāhmaṇa, cāgasampadā? Idha, brāhmaṇa, kulaputto vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato. Ayaṃ vuccati, brāhmaṇa, cāgasampadā. ‘‘Katamā ca, brāhmaṇa, paññāsampadā? Idha, brāhmaṇa, kulaputto paññavā hoti…pe… sammā dukkhakkhayagāminiyā. Ayaṃ vuccati, brāhmaṇa, paññāsampadā. Ime kho, brāhmaṇa, cattāro dhammā kulaputtassa samparāyahitāya saṃvattanti samparāyasukhāyā’’ti. ‘‘Uṭṭhātā kammadheyyesu, appamatto vidhānavā; Samaṃ kappeti jīvikaṃ, sambhataṃ anurakkhati. ‘‘Saddho sīlena sampanno, vadaññū vītamaccharo; Niccaṃ maggaṃ visodheti, sotthānaṃ samparāyikaṃ. ‘‘Iccete aṭṭha dhammā ca, saddhassa gharamesino; Akkhātā saccanāmena, ubhayattha sukhāvahā. ‘‘Diṭṭhadhammahitatthāya, samparāyasukhāya ca; Evametaṃ gahaṭṭhānaṃ, cāgo puññaṃ pavaḍḍhatī’’ti. pañcamaṃ;",
      "english": "Then Ujjaya the brahmin approached the Blessed One. Having approached, he exchanged courteous greetings with the Blessed One. After exchanging such cordial and memorable talk, he sat down to one side. Seated to one side, Ujjaya the brahmin said to the Blessed One, \"Reverend Gotama, we wish to go on a journey. May Reverend Gotama teach us such a Dhamma that would lead to our welfare and happiness in this present life, and to our welfare and happiness in future lives.\"\n\n\"Brahmin, there are these four things that conduce to a noble son's welfare and happiness in this present life. What are these four? Accomplishment in diligence, accomplishment in protection, good friendship, and balanced livelihood. And what, brahmin, is accomplishment in diligence? Here, brahmin, a noble son, by whatever occupation he earns his living—whether by farming, by trading, by cattle-herding, by archery, by royal service, or by any other craft—in that he is skillful and not lazy, endowed with an intelligent investigation into the means of doing it, capable of doing it and capable of organizing it. This, brahmin, is called accomplishment in diligence.\"\n\n\"And what, brahmin, is accomplishment in protection? Here, brahmin, a noble son has wealth acquired by energetic striving, accumulated by the strength of his arms, earned by the sweat of his brow, rightfully obtained and righteously gained. He protects this wealth with vigilance and security, thinking: 'How can kings not confiscate this wealth, nor thieves steal it, nor fire burn it, nor floods carry it away, nor unpleasant heirs appropriate it?' This, brahmin, is called accomplishment in protection.\"\n\n\"And what, brahmin, is good friendship? Here, brahmin, in whatever village or town a noble son dwells, there are householders or sons of householders, whether young people mature in virtue or elders mature in virtue, who are accomplished in faith, accomplished in virtue, accomplished in generosity, and accomplished in wisdom. He associates with them, converses with them, and engages in discussion with them. He emulates the accomplishment in faith of those who are accomplished in faith, he emulates the accomplishment in virtue of those who are accomplished in virtue, he emulates the accomplishment in generosity of those who are accomplished in generosity, and he emulates the accomplishment in wisdom of those who are accomplished in wisdom. This, brahmin, is called good friendship.\"\n\n\"And what, brahmin, is balanced livelihood? Here, brahmin, a noble son, knowing his income and expenses regarding wealth, maintains an equitable livelihood, neither excessively lavish nor excessively frugal, thinking: 'Thus will my income cover my expenses, and my expenses will not outstrip my income.' Just as, brahmin, a scale-bearer or a scale-bearer's apprentice, holding up the scale, knows: 'By so much it is depressed, by so much it is raised'; even so, brahmin, a noble son, knowing his income and expenses regarding wealth, maintains an equitable livelihood, neither excessively lavish nor excessively frugal, thinking: 'Thus will my income cover my expenses, and my expenses will not outstrip my income.' If, brahmin, this noble son, having little income, maintains a lavish livelihood, people will say of him: 'This noble son consumes his wealth like one who eats udumbara fruit.' But if, brahmin, this noble son, having much income, maintains a meager livelihood, people will say of him: 'This noble son will die like one who starves even when food is available.' But when, brahmin, a noble son, knowing his income and expenses regarding wealth, maintains an equitable livelihood, neither excessively lavish nor excessively frugal, thinking: 'Thus will my income cover my expenses, and my expenses will not outstrip my income,' this, brahmin, is called balanced livelihood.\"\n\n\"For wealth thus acquired, brahmin, there are these four gateways to dissipation: addiction to women, addiction to alcohol, addiction to gambling, and having evil friends, evil companions, and evil associates. Just as, brahmin, a great reservoir might have four inlets and four outlets. If a man were to close the inlets and open the outlets, and the sky were not to send down proper rain, then, brahmin, a decline of that great reservoir is to be expected, not an increase. Even so, brahmin, for wealth thus acquired, there are these four gateways to dissipation: addiction to women, addiction to alcohol, addiction to gambling, and having evil friends, evil companions, and evil associates.\"\n\n\"For wealth thus acquired, brahmin, there are these four gateways to accumulation: not addicted to women, not addicted to alcohol, not addicted to gambling, and having good friends, good companions, and good associates. Just as, brahmin, a great reservoir might have four inlets and four outlets. If a man were to open the inlets and close the outlets, and the sky were to send down proper rain.\"\n\nIndeed, O brahmin, for that great reservoir, growth is to be expected, not decline. Just so, O brahmin, for wealth thus acquired, there are four avenues of increase: not being addicted to women, not addicted to strong drinks, not addicted to gambling, and associating with good friends. These four principles, O brahmin, conduce to the welfare and happiness of a person of good family in this very life.\n\n\"These four principles, O brahmin, for a person of good family, conduce to welfare and happiness in the life to come. Which four? Accomplishment in faith, accomplishment in virtue, accomplishment in generosity, and accomplishment in wisdom.\n\n\"And what, O brahmin, is accomplishment in faith? Here, O brahmin, a person of good family is faithful; he has faith in the Perfect One's enlightenment, believing: 'Indeed, that Blessed One is worthy and perfectly self-enlightened, endowed with knowledge and conduct, sublime, knower of worlds, an unsurpassed leader of persons to be tamed, a teacher of gods and humans, the Buddha, the Blessed One.' This, O brahmin, is called accomplishment in faith.\n\n\"And what, O brahmin, is accomplishment in virtue? Here, O brahmin, a person of good family abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from distilled and fermented intoxicants which are the basis of heedlessness. This, O brahmin, is called accomplishment in virtue.\n\n\"And what, O brahmin, is accomplishment in generosity? Here, O brahmin, a person of good family dwells at home with a mind free from the stain of stinginess, is freely generous, with open hands, delighting in relinquishment, responsive to requests, and delighting in sharing gifts. This, O brahmin, is called accomplishment in generosity.\n\n\"And what, O brahmin, is accomplishment in wisdom? Here, O brahmin, a person of good family is wise; he is endowed with the noble discerning wisdom that penetrates to the rise and fall of phenomena, which is noble and leads to the right destruction of suffering. This, O brahmin, is called accomplishment in wisdom.\n\n\"These four principles, O brahmin, conduce to the welfare and happiness of a person of good family in the life to come.\"\n\n\"Diligent in his duties, heedful and skilled in management, he maintains a balanced livelihood and guards what he has acquired.\n\n\"Faithful and endowed with virtue, gracious and free from stinginess, he constantly purifies the path that leads to well-being in the life to come.\n\n\"Thus these eight principles, declared by the Truth-speaker for a faithful householder, are conducive to happiness in both worlds.\n\n\"For the sake of welfare in this very life and happiness in the life to come, in this way, for householders, generosity and merit increase.\"",
      "sinhala": "එවිට උජ්ජය බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සමගි සාකච්ඡා කළේය. සුහද කථා බස් හමාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි උජ්ජය බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “භවත් ගෞතමයන් වහන්ස, අපි පරදේශයට යෑමට කැමැත්තෙන් සිටිමු. අපට මේ ආත්ම භාවයේදී වැඩ පිණිසත්, සැප පිණිසත්, පරලොවදී වැඩ පිණිසත්, සැප පිණිසත් වන පරිදි භවත් ගෞතමයන් වහන්සේ අපට ධර්මය දේශනා කරන සේක්වා!”\n\n“බ්‍රාහ්මණය, මේ ධර්ම සතරක් කුලපුත්‍රයාහට මේ ආත්ම භාවයේදීම වැඩ පිණිසත්, සැප පිණිසත් පවතී. ඒ සතර කුමක්ද? උට්ඨාන සම්පදාව, ආරක්ඛ සම්පදාව, කල්‍යාණමිත්‍රතාව, සමජීවිකතාවයි. බ්‍රාහ්මණය, උට්ඨාන සම්පදාව කවරේද? බ්‍රාහ්මණය, මෙහිලා යම් කුලපුත්‍රයෙක් යම් කර්මාන්තයකින් ජීවත් වන්නේද – ගොවිතැනින් හෝ, වෙළඳාමෙන් හෝ, ගව පාලනයෙන් හෝ, ධනු ශිල්පයෙන් හෝ, රාජ සේවයෙන් හෝ, අන් යම් ශිල්පයකින් හෝ වේවා – එහිදී ඔහු දක්ෂයෙකි, අලස නොවේ. ඔහු ඒ පිළිබඳ උපක්‍රමශීලී විමංසාවෙන් යුක්තය, එය කිරීමටත්, එය සංවිධානය කිරීමටත් සමර්ථය. බ්‍රාහ්මණය, මෙය උට්ඨාන සම්පදාව යැයි කියනු ලැබේ.\n\n“බ්‍රාහ්මණය, ආරක්ඛ සම්පදාව කවරේද? බ්‍රාහ්මණය, මෙහිලා යම් කුලපුත්‍රයෙකුට උට්ඨාන වීර්යයෙන් ලබාගත්, බාහු බලයෙන් උපයාගත්, දහඩිය හෙළා රැස් කළ, ධර්මානුකූලව ලද, ධාර්මික භෝග සම්පත් තිබේ නම්, ඔහු ‘කෙසේ නම් රජුන් මේ භෝග පැහැර නොගනීද, සොරෝ නොගනීද, ගින්නෙන් නොදැවේද, ජලයෙන් ගසාගෙන නොයයිද, අප්‍රිය දායාදයන්ට නොගනියිද’ යනුවෙන් රැකවරණයෙන් යුතුව ඒවා ආරක්ෂා කරයි. බ්‍රාහ්මණය, මෙය ආරක්ඛ සම්පදාව යැයි කියනු ලැබේ.\n\n“බ්‍රාහ්මණය, කල්‍යාණමිත්‍රතාව කවරේද? බ්‍රාහ්මණය, මෙහිලා යම් කුලපුත්‍රයෙක් යම් ගමක හෝ නගරයක වාසය කරන්නේද, එහි සිටින ගෘහපතිවරුන් හෝ ගෘහපති පුත්‍රයන් හෝ තරුණ වුවත් වෘද්ධ ශීලයෙන් යුක්ත වූවන් හෝ වෘද්ධ වුවත් වෘද්ධ ශීලයෙන් යුක්ත වූවන් හෝ, ශ්‍රද්ධා සම්පන්න වූවන් හෝ, සීල සම්පන්න වූවන් හෝ, ත්‍යාග සම්පන්න වූවන් හෝ, ප්‍රඥා සම්පන්න වූවන් හෝ සමඟ ඇසුරු කරයි, කතාබහ කරයි, සාකච්ඡා කරයි. යම් ස්වභාවයකින් යුතු ශ්‍රද්ධා සම්පන්න පුද්ගලයන්ගේ ශ්‍රද්ධා සම්පදාව ඉගෙන ගනීද, යම් ස්වභාවයකින් යුතු සීල සම්පන්න පුද්ගලයන්ගේ සීල සම්පදාව ඉගෙන ගනීද, යම් ස්වභාවයකින් යුතු ත්‍යාග සම්පන්න පුද්ගලයන්ගේ ත්‍යාග සම්පදාව ඉගෙන ගනීද, යම් ස්වභාවයකින් යුතු ප්‍රඥා සම්පන්න පුද්ගලයන්ගේ ප්‍රඥා සම්පදාව ඉගෙන ගනීද, බ්‍රාහ්මණය, මෙය කල්‍යාණමිත්‍රතාව යැයි කියනු ලැබේ.\n\n“බ්‍රාහ්මණය, සමජීවිකතාව කවරේද? බ්‍රාහ්මණය, මෙහිලා කුලපුත්‍රයෙක් භෝගයන්ගේ ආදායමද, වියදමද දැන, ‘මගේ ආදායම වියදම ඉක්මවා පවතින්නේය, මගේ වියදම ආදායම ඉක්මවා නොපවතින්නේය’ යනුවෙන් මඳක්වත් වැඩිපුර වියදම් නොකොට, මඳක්වත් අඩුපුර වියදම් නොකොට, සමබර ජීවිතයක් ගත කරයි. බ්‍රාහ්මණය, යම්සේ තරාදියක් දරන්නෙක් හෝ තරාදි දරන්නාගේ ශිෂ්‍යයෙක් හෝ තරාදියක් ඔසවා ‘මෙපමණකින් පහතට නැමුණි, මෙපමණකින් උඩට නැගුණි’ යනුවෙන් දැනගනීද, එසේම බ්‍රාහ්මණය, කුලපුත්‍රයෙක් භෝගයන්ගේ ආදායමද, වියදමද දැන, ‘මගේ ආදායම වියදම ඉක්මවා පවතින්නේය, මගේ වියදම ආදායම ඉක්මවා නොපවතින්නේය’ යනුවෙන් මඳක්වත් වැඩිපුර වියදම් නොකොට, මඳක්වත් අඩුපුර වියදම් නොකොට, සමබර ජීවිතයක් ගත කරයි. බ්‍රාහ්මණය, යම් හෙයකින් මේ කුලපුත්‍රයා ස්වල්ප ආදායමක් ඇතිව මහත් වියදමක් සහිත ජීවිතයක් ගත කරයි නම්, ‘මේ කුලපුත්‍රයා උදුම්බරා කන්නා සේ භෝග විනාශ කරයි’ යැයි ඔහුට කියන්නෝ වෙති. යම් හෙයකින් මේ කුලපුත්‍රයා මහත් ආදායමක් ඇතිව දුක්ඛිත ජීවිතයක් ගත කරයි නම්, ‘මේ කුලපුත්‍රයා අජේෂ්ඨ මරණයකින් මරණයට පත් වන්නේය’ යැයි ඔහුට කියන්නෝ වෙති. බ්‍රාහ්මණය, යම් හෙයකින් මේ කුලපුත්‍රයා භෝගයන්ගේ ආදායමද, වියදමද දැන, ‘මගේ ආදායම වියදම ඉක්මවා පවතින්නේය, මගේ වියදම ආදායම ඉක්මවා නොපවතින්නේය’ යනුවෙන් මඳක්වත් වැඩිපුර වියදම් නොකොට, මඳක්වත් අඩුපුර වියදම් නොකොට, සමබර ජීවිතයක් ගත කරයිද, බ්‍රාහ්මණය, මෙය සමජීවිකතාව යැයි කියනු ලැබේ.\n\n“බ්‍රාහ්මණය, මෙසේ උපයාගත් භෝගයන්ට විනාශ මුඛ සතරක් වෙති – ස්ත්‍රීන් කෙරෙහි ලොල් වීම, මත්පැන් පානයට ලොල් වීම, සූදුවට ලොල් වීම, නරක මිතුරන්, නරක සහායකයන්, නරක ඇසුරු කරන්නන් ඇතිවීම යන මේවායි. බ්‍රාහ්මණය, යම්සේ මහත් පොකුණකට ආය මූඛ සතරක්ද, අපාය මූඛ සතරක්ද වේද, යම් පුරුෂයෙක් ඒ ආය මූඛයන් වසා, අපාය මූඛයන් විවෘත කරයිද, වැසිද මනාව ජල ධාරා නොපවත්වයිද, බ්‍රාහ්මණය, ඒ මහත් පොකුණේ පිරිහීමම අපේක්ෂා කළ යුතුය, දියුණුවක් නොවේ. එසේම බ්‍රාහ්මණය, මෙසේ උපයාගත් භෝගයන්ට විනාශ මුඛ සතරක් වෙති – ස්ත්‍රීන් කෙරෙහි ලොල් වීම, මත්පැන් පානයට ලොල් වීම, සූදුවට ලොල් වීම, නරක මිතුරන්, නරක සහායකයන්, නරක ඇසුරු කරන්නන් ඇතිවීම යන මේවායි.\n\n“බ්‍රාහ්මණය, මෙසේ උපයාගත් භෝගයන්ට ආය මුඛ සතරක් වෙති – ස්ත්‍රීන් කෙරෙහි ලොල් නොවීම, මත්පැන් පානයට ලොල් නොවීම, සූදුවට ලොල් නොවීම, කල්‍යාණ මිතුරන්, කල්‍යාණ සහායකයන්, කල්‍යාණ ඇසුරු කරන්නන් ඇතිවීම යන මේවායි. බ්‍රාහ්මණය, යම්සේ මහත් පොකුණකට ආය මූඛ සතරක්ද, අපාය මූඛ සතරක්ද වේද, යම් පුරුෂයෙක් ඒ ආය මූඛයන් විවෘත කොට, අපාය මූඛයන් වසා තබයිද, වැසිද මනාව ජල ධාරා පවත්වයිද.\n\nබ්‍රාහ්මණය, එසේ හෙයින් ඒ මහත් වූ පොකුණේ වර්ධනයම අපේක්ෂා කළ හැකිය, පරිහානියක් නොවේ. බ්‍රාහ්මණය, එසේම මෙසේ උපදවාගත් භෝග සම්පත් වලට ආයමුඛ හතරක් (සපැමිණීමේ මාර්ග හතරක්) වේ. (එනම්) ස්ත්‍රීධූර්තයෙක් නොවේ, සුරාධූර්තයෙක් නොවේ, අක්ඛධූර්තයෙක් (දුදකෙළි ලෝලියෙක්) නොවේ, පාපමිත්‍රයෙක් නොවේ, කල්‍යාණමිත්‍රයෙක්, කල්‍යාණසහයෙක්, කල්‍යාණසම්ප්‍රවංකයෙක් (යහපත් ගතිගුණ ඇති අය හා ඇසුරු කරන්නෙක්) වේ. බ්‍රාහ්මණය, මේ ධර්ම සතර කුලපුත්‍රයාට මේ භවයේ හිත සුව පිණිසම හේතු වේ.\n\nබ්‍රාහ්මණය, කුලපුත්‍රයාට මේ ධර්ම සතර පරලොව හිත සුව පිණිසම හේතු වේ. කවර ධර්ම සතරක් ද? එනම් ශ්‍රද්ධා සම්පදාව, සීල සම්පදාව, ත්‍යාග සම්පදාව සහ ප්‍රඥා සම්පදාවයි. බ්‍රාහ්මණය, ශ්‍රද්ධා සම්පදාව කවරී ද? බ්‍රාහ්මණය, මෙහිලා කුලපුත්‍රයා ශ්‍රද්ධාවන්ත වේ. \"ඒ භාග්‍යවතුන් වහන්සේ අර්හත් වූ සේක, සම්මා සම්බුද්ධ වූ සේක, විද්‍යාචරණ සම්පන්න වූ සේක, සුගත වූ සේක, ලෝකවිදූ වූ සේක, අනුත්තර පුරිසදම්මසාරථී වූ සේක, දෙවි මිනිසුන්ට ශාස්තෘ වූ සේක, බුද්ධ වූ සේක, භාග්‍යවත් වූ සේක\" යැයි තථාගතයන් වහන්සේගේ බෝධිය විශ්වාස කරයි. බ්‍රාහ්මණය, මේ ශ්‍රද්ධා සම්පදාව යැයි කියනු ලැබේ. බ්‍රාහ්මණය, සීල සම්පදාව කවරී ද? බ්‍රාහ්මණය, මෙහිලා කුලපුත්‍රයා ප්‍රාණඝාතයෙන් වැළකී සිටියි, අදත්තාදානයෙන් වැළකී සිටියි, කාමයේ වරදවා හැසිරීමෙන් වැළකී සිටියි, මුසාවාදයෙන් වැළකී සිටියි, සුරාමේරය මද්‍යපානයෙන් මත්වීම හා ප්‍රමාදයට හේතුවන ස්ථානවලින් වැළකී සිටියි. බ්‍රාහ්මණය, මේ සීල සම්පදාව යැයි කියනු ලැබේ. බ්‍රාහ්මණය, ත්‍යාග සම්පදාව කවරී ද? බ්‍රාහ්මණය, මෙහිලා කුලපුත්‍රයා මසුරු මල පහකළ සිත් ඇතිව ගිහි ගෙයි වෙසේ. ඔහු මුදා හැරීම (දීම) සිරිත කරගත්, පිවිතුරු දෑත් ඇති, අත්හැරීමට ප්‍රිය කරන, (යමෙකුට) දිය යුතු දේ ඇති කල්හි දන්දීමෙහි හා බෙදාදීමෙහි ඇලුණු පුද්ගලයෙක් වේ. බ්‍රාහ්මණය, මේ ත්‍යාග සම්පදාව යැයි කියනු ලැබේ. බ්‍රාහ්මණය, ප්‍රඥා සම්පදාව කවරී ද? බ්‍රාහ්මණය, මෙහිලා කුලපුත්‍රයා ප්‍රඥාවන්ත වේ. අවිද්‍යාව දුරුකොට, ආර්ය වූ, විනිවිද දකින, මැනවින් දුක් කෙළවර කිරීම පිණිස පවත්නා ප්‍රඥාවෙන් යුක්ත වේ. බ්‍රාහ්මණය, මේ ප්‍රඥා සම්පදාව යැයි කියනු ලැබේ. බ්‍රාහ්මණය, මේ ධර්ම සතර කුලපුත්‍රයාට පරලොව හිත සුව පිණිසම හේතු වේ.\n\nකටයුතු වලදී උත්සාහවන්ත, අප්‍රමාදී, විධිමත් සැලසුම් ඇති පුද්ගලයා,\nසමව ජීවිකාව පවත්වයි, රැස්කරගත් ධනය ආරක්ෂා කරයි.\n\nශ්‍රද්ධාවන්ත වූ, සීලයෙන් සම්පූර්ණ වූ, (උදව් ඉල්ලන්නන් හට) 'දෙන්න' යැයි කියන්නට හැකි (ත්‍යාගශීලී), මසුරුකම දුරු කළ පුද්ගලයා,\nපරලොව සුගතිය පිණිස වූ මාර්ගය නිරතුරුව පිරිසිදු කරයි.\n\nමෙසේ මේ ධර්ම අට ශ්‍රද්ධාවන්ත ගිහියාට,\nසත්‍ය ලෙස ප්‍රකාශ කරන ලද්දේ, දෙලොවටම සුවය ගෙන දෙන්නා වූ ධර්මයෝ වෙති.\nමේ භවයේ හිත සුව පිණිස ද, පරලොව සුවය පිණිස ද, මෙසේ ගෘහස්ථයන්ට ත්‍යාගය හා පින වර්ධනය වේ.",
      "paliTitle": "Ujjayasuttaṃ",
      "englishTitle": "Ujjaya Discourse",
      "sinhalaTitle": "උජ්ජය සූ‍ත්‍රය"
    },
    {
      "number": 56,
      "pali": "‘‘‘Bhaya’nti [cūḷani. khaggavisāṇasuttaniddesa 137], bhikkhave, kāmānametaṃ adhivacanaṃ. ‘Dukkha’nti, bhikkhave, kāmānametaṃ adhivacanaṃ. ‘Rogo’ti, bhikkhave, kāmānametaṃ adhivacanaṃ. ‘Gaṇḍo’ti, bhikkhave, kāmānametaṃ adhivacanaṃ. ‘Salla’nti, bhikkhave, kāmānametaṃ adhivacanaṃ. ‘Saṅgo’ti, bhikkhave, kāmānametaṃ adhivacanaṃ. ‘Paṅko’ti, bhikkhave, kāmānametaṃ adhivacanaṃ. ‘Gabbho’ti, bhikkhave, kāmānametaṃ adhivacanaṃ. Kasmā ca, bhikkhave, ‘bhaya’nti kāmānametaṃ adhivacanaṃ? Yasmā ca kāmarāgarattāyaṃ, bhikkhave, chandarāgavinibaddho diṭṭhadhammikāpi bhayā na parimuccati, samparāyikāpi bhayā na parimuccati, tasmā ‘bhaya’nti kāmānametaṃ adhivacanaṃ. Kasmā ca, bhikkhave, ‘dukkha’nti…pe… ‘rogo’ti… ‘gaṇḍo’ti… ‘salla’nti… ‘saṅgo’ti… ‘paṅko’ti… ‘gabbho’ti kāmānametaṃ adhivacanaṃ? Yasmā ca kāmarāgarattāyaṃ, bhikkhave, chandarāgavinibaddho diṭṭhadhammikāpi gabbhā na parimuccati, samparāyikāpi gabbhā na parimuccati, tasmā ‘gabbho’ti kāmānametaṃ adhivacanaṃ’’. ‘‘Bhayaṃ dukkhañca rogo ca, gaṇḍo sallañca saṅgo ca; Paṅko gabbho ca ubhayaṃ, ete kāmā pavuccanti; Yattha satto puthujjano. ‘‘Otiṇṇo sātarūpena, puna gabbhāya gacchati; Yato ca bhikkhu ātāpī, sampajaññaṃ [sampajañño (syā. ka.) saṃ. ni. 4.251 passitabbaṃ] na riccati. ‘‘So imaṃ palipathaṃ duggaṃ, atikkamma tathāvidho; Pajaṃ jātijarūpetaṃ, phandamānaṃ avekkhatī’’ti. chaṭṭhaṃ;",
      "english": "\"Fear,\" monks, is a designation for sensual pleasures. \"Suffering,\" monks, is a designation for sensual pleasures. \"Illness,\" monks, is a designation for sensual pleasures. \"A pustule,\" monks, is a designation for sensual pleasures. \"A dart,\" monks, is a designation for sensual pleasures. \"Attachment,\" monks, is a designation for sensual pleasures. \"Mud,\" monks, is a designation for sensual pleasures. \"Rebirth,\" monks, is a designation for sensual pleasures. And why, monks, is \"fear\" a designation for sensual pleasures? Because, monks, one who is stained by sensual passion, bound by lustful desire, is not freed from fear in this present life, nor is he freed from fear in future lives. Therefore, \"fear\" is a designation for sensual pleasures. And why, monks, is \"suffering\"... \"illness\"... \"a pustule\"... \"a dart\"... \"attachment\"... \"mud\"... \"rebirth\" a designation for sensual pleasures? Because, monks, one who is stained by sensual passion, bound by lustful desire, is not freed from rebirth in this present life, nor is he freed from rebirth in future lives. Therefore, \"rebirth\" is a designation for sensual pleasures.\n\nFear, suffering, and illness; a pustule, a dart, and attachment; mud and rebirth – these two are called sensual pleasures, to which the ordinary person is attached.\n\nHaving fallen into them in the form of gratification, one goes again to rebirth. But when a bhikkhu is ardent and does not abandon clear comprehension, such a one, having overcome this difficult, miry path, observes the populace, afflicted by birth and old age, trembling.",
      "sinhala": "මහණෙනි, 'භය' යනු කාමයන්ට නමෙකි. මහණෙනි, 'දුක්ඛ' යනු කාමයන්ට නමෙකි. මහණෙනි, 'රෝග' යනු කාමයන්ට නමෙකි. මහණෙනි, 'ගණ්ඩ' යනු කාමයන්ට නමෙකි. මහණෙනි, 'සල්ල' යනු කාමයන්ට නමෙකි. මහණෙනි, 'සංග' යනු කාමයන්ට නමෙකි. මහණෙනි, 'පංක' යනු කාමයන්ට නමෙකි. මහණෙනි, 'ගබ්භ' යනු කාමයන්ට නමෙකි. මහණෙනි, කාමයන්ට 'භය' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? යමක් නිසා කාමරාගයෙන් ඇලුණා වූ, ඡන්දරාගයෙන් බැඳුනාවූ තැනැත්තා මේ ආත්මයේදී ඇතිවන භයන්ගෙන්ද මිදෙන්නේ නැද්ද, පරලොවදී ඇතිවන භයන්ගෙන්ද මිදෙන්නේ නැද්ද, එබැවින් 'භය' යනු කාමයන්ට නමෙකි. මහණෙනි, කාමයන්ට 'දුක්ඛ' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? මහණෙනි, කාමයන්ට 'රෝග' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? මහණෙනි, කාමයන්ට 'ගණ්ඩ' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? මහණෙනි, කාමයන්ට 'සල්ල' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? මහණෙනි, කාමයන්ට 'සංග' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? මහණෙනි, කාමයන්ට 'පංක' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? මහණෙනි, කාමයන්ට 'ගබ්භ' යනු නමෙකැයි කියන්නේ කුමක් නිසාද? යමක් නිසා කාමරාගයෙන් ඇලුණා වූ, ඡන්දරාගයෙන් බැඳුනාවූ තැනැත්තා මේ ආත්මයේදී ඇතිවන ගබ්භයන්ගෙන්ද මිදෙන්නේ නැද්ද, පරලොවදී ඇතිවන ගබ්භයන්ගෙන්ද මිදෙන්නේ නැද්ද, එබැවින් 'ගබ්භ' යනු කාමයන්ට නමෙකි.\n\nභය, දුක්, රෝග, ගණ්ඩ, සල්ල, සංග යන මේවාද; පංක, ගබ්භ යන මේ දෙකද, මේවා කාමයන් ලෙසින් කියනු ලැබේ. පෘථග්ජනයා මේවාට ඇලී බැඳී සිටිති.\n\nසතුටු ස්වභාවයෙන් (සැපයැයි මුළා වී) ඇතුළුවූ තැනැත්තා නැවත නැවතත් ගබ්භයන් කරා (භවයන් කරා) යයි. යම් කලක භික්ෂුවක් වීර්යයෙන් යුතුව, සම්පජඤ්ඤයෙන් නොපිරිහෙන්නේද.\n\nඑබඳු වූ ඔහු මේ දුෂ්කර වගුරු සහිත මඟ ඉක්මවා (සසර කතරින් එතෙර වී); ජාතියෙන් හා ජරාවෙන් පෙළෙන, තැතිගන්නා වූ සත්ත්ව සමූහයා දකී.",
      "paliTitle": "Bhayasuttaṃ",
      "englishTitle": "Discourse on Fear",
      "sinhalaTitle": "භය සූත්‍රය"
    },
    {
      "number": 57,
      "pali": "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu sīlavā hoti …pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko; sammādiṭṭhiko hoti, sammādassanena samannāgato; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati; dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti; āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ.",
      "english": "Monks, a bhikkhu endowed with eight qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of salutation with joined hands, an unsurpassed field of merit for the world. What are these eight?\n\nHere, monks, a bhikkhu is virtuous, restrained in accordance with the Pāṭimokkha, perfect in conduct and resort, seeing danger in the slightest faults, and undertaking and training in the training rules. He is learned, having heard much, holding it, accumulating it, the teachings that are beautiful in the beginning, beautiful in the middle, beautiful in the end, with their meaning and phrasing, proclaiming a holy life that is utterly perfect and pure; these teachings are mastered by him, committed to memory, investigated by him, and well penetrated by his understanding. He is a good friend, a good companion, a good associate. He has right view, is endowed with right vision. He attains at will, without difficulty or hardship, the four jhānas—states of mind belonging to the higher consciousness, which provide a pleasant dwelling in this very life. He recollects his manifold past lives, that is, one birth, two births, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births, many eons of world-dissolution, many eons of world-evolution, many eons of world-dissolution and evolution: ‘There I had such a name, belonged to such a clan, had such an appearance, such was my food, such my experience of pleasure and pain, such my life-span; passing away from there, I reappeared elsewhere; there too I had such a name, belonged to such a clan, had such an appearance, such was my food, such my experience of pleasure and pain, such my life-span; passing away from there, I reappeared here’—thus he recollects his manifold past lives with their characteristics and details. With the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, ignoble and noble, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare on according to their karma. Through the destruction of the taints, having realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, he enters and abides in it.\n\nMonks, a bhikkhu endowed with these eight qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of salutation with joined hands, an unsurpassed field of merit for the world.",
      "sinhala": "භික්ෂූනි, අට ධර්මයකින් යුක්ත වූ භික්ෂුවක් ආහුණෙය්‍ය (දුර සිට ගෙනා දේ පිළිගැනීමට සුදුසු) වෙයි, පාහුණෙය්‍ය (අමුත්තන්ට කරන සත්කාරයට සුදුසු) වෙයි, දක්ෂිණෙය්‍ය (දක්ෂිණාවට සුදුසු, පින් කැමත්තවුන් විසින් දෙන දේ පිළිගැනීමට සුදුසු) වෙයි, අඤ්ජලිකරණීය (ඇඳිලි කොට වැඳීමට සුදුසු) වෙයි, ලෝකයාගේ අනුත්තර පුණ්‍යක්ෂේත්‍රය (උතුම්ම පින් කෙත) වෙයි. කවර අටකින් ද?\n\nභික්ෂූනි, මෙහිලා භික්ෂුව සීලවන්ත වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ විහරණය කරයි. ආචාර ගෝචර සම්පන්න වෙයි. අල්ප මාත්‍ර වූ වරදෙහි ද භය දක්නේ, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. බහුශ්‍රැත වෙයි. ඔහුට අසන ලද්දා වූ දේ ධාරණය වී තිබේ. අසන ලද්දා වූ දේ රැස් කොට ගනී. යම් ඒ ධර්මයන් මුලදී මැනවින්, මැදදී මැනවින්, කෙළවරදී මැනවින්, අර්ථ සහිත වූ, ව්‍යඤ්ජන සහිත වූ, පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේ ද, එබඳු ධර්මයන් ඔහුට බොහෝ සෙයින් අසා ධාරණය කරගෙන, වචනයෙන් පුරුදු කර, සිතින් විමසා, දෘෂ්ටියෙන් මනාකොට විනිවිද දකින ලද්දේ වෙයි. කල්‍යාණ මිත්‍රයෙක් වෙයි, කල්‍යාණ සහායයෙක් වෙයි, කල්‍යාණ සම්පවංක (යහපත් ඇසුරක් ඇත්තෙක්) වෙයි. සම්මා දිට්ඨික වෙයි, සම්මා දර්ශනයෙන් යුක්ත වෙයි. අධිචෛතසික වූ, මේ ආත්මභාවයේම සැප විහරණ පිණිස වූ සිව් ධ්‍යානයන්ගේ කැමති කැමති පරිදි ලාභී වෙයි, අපහසුවක් නැතිව ලාභී වෙයි, දුෂ්කරතාවක් නැතිව ලාභී වෙයි. නොයෙක් ආකාර වූ පෙර විසූ කඳපිළිවෙළ සිහි කරයි. එනම් – එක් ජාතියක් ද, දෙකක් ද, තුනක් ද, සතරක් ද, පහක් ද, දශයක් ද, විස්සක් ද, තිහක් ද, සතළිහක් ද, පනහක් ද, සියයක් ද, දහසක් ද, ලක්ෂයක් ද, නොයෙක් සංවට්ට කල්පයන් ද, නොයෙක් විවට්ට කල්පයන් ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන් ද සිහි කරයි. මෙසේ ආකාර සහිතව, අරමුණු සහිතව නොයෙක් ආකාර වූ පෙර විසූ කඳපිළිවෙළ සිහි කරයි. පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින්, චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුන්දර වූ, විරූපී වූ, සැපයට පත් වූ, දුකට පත් වූ සත්වයන් දකී. කම් වලට අනුව පසුවන සත්වයන් දැනගනී. ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝ විමුක්තිය සහ ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම දැන, ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කරයි.\n\nභික්ෂූනි, මේ අට ධර්මයෙන් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වෙයි, පාහුණෙය්‍ය වෙයි, දක්ෂිණෙය්‍ය වෙයි, අඤ්ජලිකරණීය වෙයි, ලෝකයාගේ අනුත්තර පුණ්‍යක්ෂේත්‍රය වෙයි.",
      "paliTitle": "Paṭhamaāhuneyyasuttaṃ",
      "englishTitle": "First Sutta on the Worthy of Offerings",
      "sinhalaTitle": "පළමු ආහුණෙය්‍ය සූත්‍‍රය"
    },
    {
      "number": 58,
      "pali": "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu sīlavā hoti …pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; āraddhavīriyo viharati thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu; āraññiko hoti pantasenāsano; aratiratisaho hoti, uppannaṃ aratiṃ abhibhuyya abhibhuyya viharati; bhayabheravasaho hoti, uppannaṃ bhayabheravaṃ abhibhuyya abhibhuyya viharati; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu āhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a bhikkhu endowed with eight qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of veneration, an unsurpassed field of merit for the world. Which eight?\n\nHere, monks, a bhikkhu is virtuous; he dwells restrained by the restraint of the Pātimokkha, perfect in conduct and resort, seeing danger in the slightest faults, and undertakes and trains himself in the training rules. He is learned, retaining what he has heard, accumulating what he has heard. The teachings that are good in the beginning, good in the middle, good in the end, with their meaning and their letter, proclaiming the entirely complete and purified holy life – such teachings are much heard by him, retained, recited, pondered in mind, and well-penetrated by his understanding. He dwells with aroused energy, persevering, firm in his effort, not having laid down the burden with regard to wholesome states. He is a forest dweller, having a secluded dwelling. He endures discontent, dwelling having repeatedly overcome any arisen discontent. He endures fear and terror, dwelling having repeatedly overcome any arisen fear and terror. He obtains at will, without difficulty, without trouble, the four jhānas — the states of purified mind, pleasant dwellings in this very life. Through the destruction of the taints, he, by his own direct knowledge, in this very life, realizes and enters upon the taintless liberation of mind and liberation by wisdom, and dwells therein.\n\nMonks, a bhikkhu endowed with these eight qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of veneration, an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, කරුණු අටකින් යුක්ත භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින්කෙතක් වේ. කවර අටකින්ද යත්:\n\nමහණෙනි, මෙහිලා භික්ෂුව සීලවන්ත වේ. ප්‍රාතිමෝක්ෂ සංවර සීලයෙන් යුක්තව වාසය කරයි. ආචාර ගෝචර සම්පන්න වේ. අල්ප මාත්‍ර වූ වරදෙහිද භය දක්නාසුලු වේ. සිල් පදයන් සමාදන්ව හික්මෙයි. බහුශ්‍රැත වේ. අසා ඇති ධර්මය ධාරණය කර ගත්තේ වේ. ඒ ධර්මය කට පාඩම් කර ගෙන, වචනයෙන් හුරු පුරුදු කර ගෙන, මනසින් විමසා බලා, දෘෂ්ටියෙන් මනා කොට අවබෝධ කරගෙන සිටියි. කුසල ධර්මයන්හි නො හෙළූ බර ඇත්තෙක්ව, වීර්‍ය්‍යය ආරම්භ කළේ ස්ථිර වීර්‍ය්‍යය ඇත්තෙක්ව, දැඩි පරාක්‍රම ඇත්තෙක්ව වාසය කරයි. ආරණ්‍යක වේ, හුදෙකලා සේනාසනයන්හි වාසය කරයි. අරතියට දරා ගන්නා සුළු වේ. උපන් අරතිය වරින් වර ජය ගෙන ජය ගෙන වාසය කරයි. භය භේරවයන්ට දරා ගන්නා සුළු වේ. උපන් භය භේරවය වරින් වර ජය ගෙන ජය ගෙන වාසය කරයි. අධිචෛතසික වූ, මේ ආත්මභාවයේදීම සුවසේ වාසය පිණිස වූ සිව් ධ්‍යානයන් කැමති සේ ලබන්නෙක්, අපහසුවකින් තොරව ලබන්නෙක්, දුෂ්කරතාවයකින් තොරව ලබන්නෙක් වේ. ආශ්‍රවයන් ක්ෂය කිරීමෙන්, අනාස්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් සාක්ෂාත් කොට, සම්පූර්ණයෙන් පසක් කොට වාසය කරයි.\n\nමහණෙනි, මේ කරුණු අටෙන් යුක්ත භික්ෂුව ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින්කෙතක් වේ.",
      "paliTitle": "Dutiyaāhuneyyasuttaṃ",
      "englishTitle": "The Second Worthy of Offerings Discourse",
      "sinhalaTitle": "දෙවන ආහුණෙය්‍ය සූත්‍රය"
    },
    {
      "number": 59,
      "pali": "‘‘Aṭṭhime bhikkhave, puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa? Katame aṭṭha? Sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno, sakadāgāmī, sakadāgāmiphalasacchikiriyāya paṭipanno, anāgāmī, anāgāmiphalasacchikiriyāya paṭipanno, arahā, arahattāya paṭipanno. Ime kho, bhikkhave, aṭṭha puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. ‘‘Cattāro ca paṭipannā, cattāro ca phale ṭhitā; Esa saṅgho ujubhūto, paññāsīlasamāhito. ‘‘Yajamānānaṃ manussānaṃ, puññapekkhāna pāṇinaṃ; Karotaṃ opadhikaṃ puññaṃ, saṅghe dinnaṃ mahapphala’’nti. navamaṃ;",
      "english": "Monks, these eight individuals are worthy of offerings from afar, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world. Which eight? The Stream-enterer; one practicing for the realization of the fruit of stream-entry; the Once-returner; one practicing for the realization of the fruit of once-returning; the Non-returner; one practicing for the realization of the fruit of non-returning; the Arahant; one practicing for Arahantship. These, monks, are the eight individuals who are worthy of offerings from afar, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.\n\nFour are on the path, and four are established in the fruits; this Sangha is upright, endowed with wisdom and virtue. For human beings making offerings, for living beings seeking merit, who are accumulating merit leading to future happiness, that which is given to the Sangha yields great fruit.",
      "sinhala": "මහණෙනි, දූර පළාත්වලින් ගෙනෙන දානයන්ට සුදුසු, පිළිගැනීමට සුදුසු, දන් දීමට සුදුසු, දෝත මුදුන් තබා වැඳීමට සුදුසු, ලොවට අනුත්තර වූ පින් කෙත වන මේ පුද්ගලයන් අට දෙනෙක් වෙති. ඒ අට දෙනා කවරහුද? සෝවාන් වූ පුද්ගලයා, සෝවාන් ඵලය සාක්ෂාත් කිරීම සඳහා පිළිපන් පුද්ගලයා, සකදාගාමී වූ පුද්ගලයා, සකදාගාමී ඵලය සාක්ෂාත් කිරීම සඳහා පිළිපන් පුද්ගලයා, අනාගාමී වූ පුද්ගලයා, අනාගාමී ඵලය සාක්ෂාත් කිරීම සඳහා පිළිපන් පුද්ගලයා, අරහත් වූ පුද්ගලයා, අරහත් ඵලය සාක්ෂාත් කිරීම සඳහා පිළිපන් පුද්ගලයා යනුයි. මහණෙනි, ලොවට අනුත්තර වූ පින් කෙත වන, දූර පළාත්වලින් ගෙනෙන දානයන්ට සුදුසු, පිළිගැනීමට සුදුසු, දන් දීමට සුදුසු, දෝත මුදුන් තබා වැඳීමට සුදුසු මේ අට දෙනා ඒ පුද්ගලයන් අට දෙනා වෙති.\n\nසතර දෙනෙක් මාර්ගයෙහි පිළිපන්නාහු වෙති. සතර දෙනෙක් ඵලයෙහි පිහිටියාහු වෙති. ඒ සංඝයා ඍජු භාවයට පත් වූ, ප්‍රඥා​වෙන් හා සීලයෙන් සමන්විත වූ සංඝයා යි.\n\nපුණ්‍ය අපේක්ෂාවෙන් යුත්, පුණ්‍ය කර්ම කරන්නා වූ මිනිසුන් විසින් කරන ලද (සසර ගමනට උපකාර වන) කුසල කර්මයන් අතුරින් සංඝයාට දෙන ලද දානය මහත් ඵල ඇති වේ.",
      "paliTitle": "Paṭhamapuggalasuttaṃ",
      "englishTitle": "First Person Discourse",
      "sinhalaTitle": "පඨම පුග්ගල සූත‍්‍රය"
    },
    {
      "number": 60,
      "pali": "‘‘Aṭṭhime, bhikkhave, puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassa. Katame aṭṭha? Sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno…pe… arahā, arahattāya paṭipanno. Ime kho, bhikkhave, aṭṭha puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. ‘‘Cattāro ca paṭipannā, cattāro ca phale ṭhitā; Esa saṅgho samukkaṭṭho, sattānaṃ aṭṭha puggalā. ‘‘Yajamānānaṃ manussānaṃ, puññapekkhāna pāṇinaṃ; Karotaṃ opadhikaṃ puññaṃ, ettha dinnaṃ mahapphala’’nti. dasamaṃ; ",
      "english": "These eight individuals, monks, are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world. Who are these eight? One practicing for the realization of the fruit of stream-entry, the stream-enterer; one practicing for the realization of the fruit of once-returning, the once-returner; one practicing for the realization of the fruit of non-returning, the non-returner; one practicing for Arahantship, the Arahant. These, monks, are the eight individuals worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.\n\nFour are on the path, and four are established in the fruits; this Sangha, comprising these eight individuals among beings, is supreme.\n\nFor human beings who make offerings, for beings seeking merit, who are performing meritorious deeds leading to renewed existence, an offering given to this Sangha brings great fruit.",
      "sinhala": "මහණෙනි, ලෝකයාගේ ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ, නිරුත්තර වූ පින් කෙත වන පුද්ගලයෝ අට දෙනෙක් වෙති. ඒ අට දෙනා කවරහුද? සෝවාන් වූ පුද්ගලයා, සෝවාන් ඵලය ප්‍රත්‍යක්ෂ කිරීම පිණිස පිළිපන් පුද්ගලයා, සකදාගාමී වූ පුද්ගලයා, සකදාගාමී ඵලය ප්‍රත්‍යක්ෂ කිරීම පිණිස පිළිපන් පුද්ගලයා, අනාගාමී වූ පුද්ගලයා, අනාගාමී ඵලය ප්‍රත්‍යක්ෂ කිරීම පිණිස පිළිපන් පුද්ගලයා, අර්හත් වූ පුද්ගලයා, අර්හත්වය පිණිස පිළිපන් පුද්ගලයා යන මොවුහුයි. මහණෙනි, මේ අට දෙනා වනාහි ලෝකයාගේ ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, අඤ්ජලිකරණීය වූ, නිරුත්තර වූ පින් කෙත වන පුද්ගලයෝ වෙති.\n\nසතර දෙනෙක් මාර්ගයට පිළිපන්නාහුය, සතර දෙනෙක් ඵලයන්හි පිහිටියාහුය.\nසත්ත්වයන් අතර ඇති මේ අට දෙනා වහන්සේලාගේ සංඝ රත්නය උතුම්ය.\nපින් බලාපොරොත්තු වන, සසර පැවැත්මට හේතු වන පින්කම් කරන, දන් දෙන මනුෂ්‍යයන්ට,\nමෙහි (මෙම සංඝයාට) දෙනු ලබන දානය මහත් ඵල ඇත්තේය.",
      "paliTitle": "Dutiyapuggalasuttaṃ",
      "englishTitle": "The Second Person",
      "sinhalaTitle": "ද්‍​විතීය පුද්‍​ගල සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Gotamīvaggo paṭhamo. Tassuddānaṃ – Gotamī ovādaṃ saṃkhittaṃ, dīghajāṇu ca ujjayo; Bhayā dve āhuneyyā ca, dve ca aṭṭha puggalāti.",
    "english": "The First Chapter on Gotami",
    "sinhala": "ගෝතමී වග්‍ගය පළමු"
  }
}