{
  "id": "an8.1",
  "title": {
    "pali": "Mettāvaggo",
    "english": "The Chapter on Loving-kindness",
    "sinhala": "මෛත‌්‍රී වග්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – [a. ni. 11.15] ‘‘Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya aṭṭhānisaṃsā pāṭikaṅkhā. Katame aṭṭha? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, manussānaṃ piyo hoti, amanussānaṃ piyo hoti, devatā rakkhanti, nāssa aggi vā visaṃ vā satthaṃ vā kamati, uttariṃ appaṭivijjhanto brahmalokūpago hoti. Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ime aṭṭhānisaṃsā pāṭikaṅkhā’’ti. ‘‘Yo ca mettaṃ bhāvayati, appamāṇaṃ paṭissato [patissato (sī.)]; Tanū saṃyojanā honti, passato upadhikkhayaṃ. ‘‘Ekampi ce pāṇamaduṭṭhacitto, Mettāyati kusalī tena hoti; Sabbe ca pāṇe manasānukampī, Pahūtamariyo pakaroti puññaṃ. ‘‘Ye sattasaṇḍaṃ pathaviṃ vijetvā, Rājisayo yajamānā anupariyagā; Assamedhaṃ purisamedhaṃ, Sammāpāsaṃ vājapeyyaṃ niraggaḷaṃ. ‘‘Mettassa cittassa subhāvitassa, Kalampi te nānubhavanti soḷasiṃ; Candappabhā tāragaṇāva sabbe, Yathā na agghanti kalampi soḷasiṃ [ayaṃ pādo bahūsu na dissati]. ‘‘Yo na hanti na ghāteti, na jināti na jāpaye; Mettaṃso sabbabhūtānaṃ, veraṃ tassa na kenacī’’ti. paṭhamaṃ;",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. There, indeed, the Blessed One addressed the monks, \"Monks!\" \"Venerable sir,\" those monks replied to the Blessed One. The Blessed One spoke thus:\n\n\"Monks, when the liberation of mind through loving-kindness is cultivated, developed, repeatedly practiced, made a vehicle, made a basis, firmly established, consolidated, and properly undertaken, eight benefits are to be expected. Which eight? One sleeps peacefully; one wakes up peacefully; one does not see bad dreams; one is dear to human beings; one is dear to non-human beings; devas protect one; fire, poison, or weapons do not affect one; if one does not penetrate to higher stages, one is reborn in the Brahma-world. Monks, when the liberation of mind through loving-kindness is cultivated, developed, repeatedly practiced, made a vehicle, made a basis, firmly established, consolidated, and properly undertaken, these eight benefits are to be expected.\"\n\nOne who cultivates loving-kindness, boundless and mindful,\nHis fetters become attenuated, as he sees the destruction of substrata of existence.\n\nIf one's mind is without ill-will towards even a single living being,\nAnd cultivates loving-kindness, one is wholesome by that.\nOne who mentally sympathizes with all living beings\nGenerates abundant noble merit.\n\nThose royal sages who, having conquered the whole earth,\nWent about performing sacrifices:\nThe horse sacrifice, the human sacrifice,\nThe sammāpāsa sacrifice, the vājapeyya sacrifice, and the niraggaḷa sacrifice.\n\nCompared to a well-developed mind of loving-kindness,\nThey do not amount to a sixteenth part;\nJust as all the star clusters\nAre not worth a sixteenth part of the moon's radiance.\n\nOne who does not strike, nor causes to strike,\nNor conquers, nor causes to conquer;\nPossessing loving-kindness towards all beings,\nHe has no enmity with anyone.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩ වාසය කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"ස්වාමීනි\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, මෛත්‍රී චේතෝවිමුක්තිය සේවනය කළ කල්හි, භාවනා කළ කල්හි, බහුල වශයෙන් කළ කල්හි, යානාවක් මෙන් කළ කල්හි, වස්තුවක් මෙන් කළ කල්හි, නැවත නැවත කරන ලද කල්හි, පුරුදු කළ කල්හි, මනාව ආරම්භ කළ කල්හි ආනිසංස අටක් බලාපොරොත්තු විය හැකිය.\n\nඒ අට කවරේද? සැපසේ නිදයි, සැපසේ පිබිදෙයි, නරක සිහින නොදකියි, මිනිසුන්ට ප්‍රිය වෙයි, අමනුෂ්‍යයන්ට ප්‍රිය වෙයි, දෙවි දේවතාවෝ රක්ෂා කරති, ගිනි, විෂ හෝ ආයුධ ඔහුට බලපාන්නේ නැත, (එතැන් සිට) උසස් අරහත්වය අවබෝධ නොකරන කල්හි බ්‍රහ්ම ලෝකයට පැමිණෙයි. මහණෙනි, මෛත්‍රී චේතෝවිමුක්තිය සේවනය කළ, භාවනා කළ, බහුල වශයෙන් කළ, යානාවක් මෙන් කළ, වස්තුවක් මෙන් කළ, නැවත නැවත කරන ලද, පුරුදු කළ, මනාව ආරම්භ කළ කල්හි මේ ආනිසංස අට බලාපොරොත්තු විය හැකියි.\"\n\n\"යම් කෙනෙක් අප්‍රමාණව සිහි කල්පනාවෙන් යුක්තව මෛත්‍රිය වඩයිද, උපාධීන්ගේ ක්ෂය වීම දකින ඔහුගේ සංයෝජන තුනී වෙයි.\n\nයම් කෙනෙක් එක් ප්‍රාණියකු කෙරෙහි හෝ අදූෂිත සිතින් මෛත්‍රී කරයි නම්, ඔහු එයින් කුසල් ඇත්තෙක් වෙයි. සියලු සත්වයන් කෙරෙහි සිතින් අනුකම්පා කරන්නේ මහත් වූ ආර්ය පුණ්‍යයක් කරයි.\n\nයම් කෙනෙක් සත්ත්ව සමූහයක් සහිත පොළොවක් ජයගෙන, රාජඍෂිවරුන් යාග කරමින් අනුගමනය කළාක් මෙන්, අශ්වමේධ, පුරිසමේධ, සම්මාපාස, වාජපෙය්‍ය ආදී බාධාවකින් තොර වූ (මහත්) යාගයන් පවත්වයි.\n\nමනාව වැඩූ මෛත්‍රී සිතක (ආනිසංස), ඒ (යාගවලින් ලැබෙන පිනේ) සෝලොස්වන කලාවකට වත් නොපැමිණෙයි. සියලු තාරකා සමූහය සඳෙහි එළිය සෝලොස්වන කලාවකට වත් නොවටින්නාක් මෙන්.\n\nයම් කෙනෙක් (කිසිවකුට) නොමරයි, නොමරවයි, නොදිනයි, නොදිනවයිද, සියලු සත්වයන් කෙරෙහි මෛත්‍රී සහගත වූ ඔහුට කිසිවකුගෙන් වෛරයක් නැත.\"",
      "paliTitle": "Mettāsuttaṃ",
      "englishTitle": "Discourse on Loving-Kindness",
      "sinhalaTitle": "මෛත්‍රී සූත්‍රය"
    },
    {
      "number": 2,
      "pali": "‘‘Aṭṭhime, bhikkhave, hetū aṭṭha paccayā ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattanti. Katame aṭṭha? Idha, bhikkhave, bhikkhu satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca. Ayaṃ, bhikkhave, paṭhamo hetu paṭhamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘So taṃ satthāraṃ upanissāya viharanto aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemaṃ gāravo ca, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ; imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānī karonti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Ayaṃ, bhikkhave, dutiyo hetu dutiyo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘So taṃ dhammaṃ sutvā dvayena vūpakāsena sampādeti – kāyavūpakāsena ca cittavūpakāsena ca. Ayaṃ, bhikkhave, tatiyo hetu tatiyo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Ayaṃ, bhikkhave, catuttho hetu catuttho paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘Bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [satthā sabyañjanā (ka. sī.)] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā [dhatā (sī. syā. kaṃ. pī.)] vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Ayaṃ, bhikkhave, pañcamo hetu pañcamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘Āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Ayaṃ, bhikkhave, chaṭṭho hetu chaṭṭho paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘Saṅghagato kho pana anānākathiko hoti atiracchānakathiko. Sāmaṃ vā dhammaṃ bhāsati paraṃ vā ajjhesati ariyaṃ vā tuṇhībhāvaṃ nātimaññati. Ayaṃ, bhikkhave, sattamo hetu sattamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘Pañcasu kho pana upādānakkhandhesu udayabbayānupassī viharati – ‘iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā, iti vedanāya samudayo, iti vedanāya atthaṅgamo; iti saññā…pe… iti saṅkhārā…pe… iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti. Ayaṃ, bhikkhave, aṭṭhamo hetu aṭṭhamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati. ‘‘Tamenaṃ sabrahmacārī evaṃ sambhāventi – ‘ayaṃ kho āyasmā satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya [piyatāya garutāya (syā.)] bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘‘Taṃ kho panāyamāyasmā satthāraṃ upanissāya viharanto aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – idaṃ, bhante, kathaṃ; imassa ko atthoti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānī karonti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘‘Taṃ kho panāyamāyasmā dhammaṃ sutvā dvayena vūpakāsena sampādeti – kāyavūpakāsena ca cittavūpakāsena ca. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘‘Sīlavā kho panāyamāyasmā pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘‘Bahussuto kho panāyamāyasmā sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘‘Āraddhavīriyo kho panāyamāyasmā viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘‘Saṅghagato kho panāyamāyasmā anānākathiko hoti atiracchānakathiko. Sāmaṃ vā dhammaṃ bhāsati paraṃ vā ajjhesati ariyaṃ vā tuṇhībhāvaṃ nātimaññati. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘‘Pañcasu kho panāyamāyasmā upādānakkhandhesu udayabbayānupassī viharati – iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā…pe… iti saññā…pe… iti saṅkhārā…pe… iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamoti. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘Ime kho, bhikkhave, aṭṭha hetū aṭṭha paccayā ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattantī’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, these eight reasons and eight conditions lead to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired. Which eight? Here, bhikkhus, a bhikkhu lives relying on the Teacher, or on some venerable co-celibate, towards whom he has intense conscientiousness and moral dread, together with love and respect. This, bhikkhus, is the first reason, the first condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nLiving relying on that Teacher, or on some venerable co-celibate, towards whom he has intense conscientiousness and moral dread, together with love and respect, he approaches them from time to time and questions and inquires: ‘Venerable sir, how is this? What is the meaning of this?’ Those venerable ones reveal what was unrevealed to him, make plain what was not made plain, and dispel his doubt about various doubtful points concerning the Dhamma. This, bhikkhus, is the second reason, the second condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nHaving heard that Dhamma, he accomplishes twofold seclusion: seclusion of body and seclusion of mind. This, bhikkhus, is the third reason, the third condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nHe is virtuous; he dwells restrained by the Pātimokkha restraint, perfect in conduct and domain, seeing danger in the slightest faults, and undertaking the training in the training rules. This, bhikkhus, is the fourth reason, the fourth condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nHe is learned, retaining what he has heard, accumulating what he has heard. Those teachings that are good in the beginning, good in the middle, and good in the end, with their meaning and their phrasing, proclaiming the entirely complete and purified spiritual life—such teachings are much heard by him, retained, recited verbally, contemplated mentally, and penetrated well by understanding. This, bhikkhus, is the fifth reason, the fifth condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nHe dwells with aroused energy for the abandoning of unwholesome states and for the acquisition of wholesome states, steadfast, firm in exertion, not laying aside the burden in regard to wholesome states. This, bhikkhus, is the sixth reason, the sixth condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nWhen he goes to the assembly, he is not one who engages in diverse talk or common gossip. He himself speaks Dhamma, or he encourages another to speak, or he does not disparage the noble silence. This, bhikkhus, is the seventh reason, the seventh condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nFurthermore, he dwells contemplating the rise and fall in the five aggregates subject to clinging: ‘Such is form, such is the origin of form, such is the passing away of form; such is feeling, such is the origin of feeling, such is the passing away of feeling; such is perception, such is the origin of perception, such is the passing away of perception; such are volitional formations, such is the origin of volitional formations, such is the passing away of volitional formations; such is consciousness, such is the origin of consciousness, such is the passing away of consciousness.’ This, bhikkhus, is the eighth reason, the eighth condition, that leads to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.\n\nThen his co-celibates think about him thus: ‘This venerable one lives relying on the Teacher, or on some venerable co-celibate, towards whom he has intense conscientiousness and moral dread, together with love and respect. Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\n‘Furthermore, living relying on that Teacher, or on some venerable co-celibate, towards whom he has intense conscientiousness and moral dread, together with love and respect, he approaches them from time to time and questions and inquires: “Venerable sir, how is this? What is the meaning of this?” Those venerable ones reveal what was unrevealed to him, make plain what was not made plain, and dispel his doubt about various doubtful points concerning the Dhamma. Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\n‘Furthermore, having heard that Dhamma, this venerable one accomplishes twofold seclusion: seclusion of body and seclusion of mind. Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\n‘Furthermore, this venerable one is virtuous; he dwells restrained by the Pātimokkha restraint, perfect in conduct and domain, seeing danger in the slightest faults, and undertaking the training in the training rules. Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\n‘Furthermore, this venerable one is learned, retaining what he has heard, accumulating what he has heard. Those teachings that are good in the beginning, good in the middle, and good in the end, with their meaning and their phrasing, proclaiming the entirely complete and purified spiritual life—such teachings are much heard by him, retained, recited verbally, contemplated mentally, and penetrated well by understanding. Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\n‘Furthermore, this venerable one dwells with aroused energy for the abandoning of unwholesome states and for the acquisition of wholesome states, steadfast, firm in exertion, not laying aside the burden in regard to wholesome states. Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\n‘Furthermore, when this venerable one goes to the assembly, he is not one who engages in diverse talk or common gossip. He himself speaks Dhamma, or he encourages another to speak, or he does not disparage the noble silence. Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\n‘Furthermore, this venerable one dwells contemplating the rise and fall in the five aggregates subject to clinging: “Such is form, such is the origin of form, such is the passing away of form; such is feeling, such is the origin of feeling, such is the passing away of feeling; such is perception, such is the origin of perception, such is the passing away of perception; such are volitional formations, such is the origin of volitional formations, such is the passing away of volitional formations; such is consciousness, such is the origin of consciousness, such is the passing away of consciousness.” Surely, this venerable one knows what he knows and sees what he sees!’ This too leads to endearment, to respect, to development, to harmony, and to unity.\n\nThese, bhikkhus, are the eight reasons, the eight conditions, that lead to the acquisition of wisdom pertaining to the fundamental spiritual life, to its increase, growth, development, and fulfillment when acquired.",
      "sinhala": "මහණෙනි, මේ මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් හේතූන් අටක්, ප්‍රත්‍යයන් අටක් පවතී. කවරේද ඒ අට?\n\nමහණෙනි, මේ ශාසනයෙහි භික්‍ෂුවක් ශාස්තෲන් වහන්සේට උපනිශ්‍රය වී වාසය කරයි. නැතහොත් ගරු කළ යුතු යම්කිසි සබ්‍රහ්මචාරියෙකුට උපනිශ්‍රය වී වාසය කරයි. යම් තැනැත්තෙකු කෙරෙහි ඔහුට දැඩි හිරි-ඔතප් දෙකක්ද, ප්‍රේමයද, ගෞරවයද පිහිටා තිබේ. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින පළමු වන හේතුවයි, පළමු වන ප්‍රත්‍යයයි.\n\nඔහු ශාස්තෲන් වහන්සේට හෝ යම් ගරු කළ යුතු සබ්‍රහ්මචාරියෙකුට උපනිශ්‍රය වී වාසය කරන්නේ, යම් තැනැත්තෙකු කෙරෙහි ඔහුට දැඩි හිරි-ඔතප් දෙකක්ද, ප්‍රේමයද, ගෞරවයද පිහිටා තිබේද, ඔවුන් වෙත කලින් කල පැමිණ, ‘ස්වාමීනි, මේ කෙසේද? මෙහි අර්ථය කුමක්දැයි’ විමසා අසයි. එවිට ඒ ආයුෂ්මත්හු ඔහුට නොවිවෘත වූ දේ විවෘත කරති, නුපුහුණු දේ පුහුණු කරති, නොයෙක් ආකාර සැක උපදවන ධර්‍මයන්හි ඔහුගේ සැකය දුරු කරති. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින දෙවැනි හේතුවයි, දෙවැනි ප්‍රත්‍යයයි.\n\nඔහු ඒ ධර්‍මය අසා ආකාර දෙකක විවේකයකින් යුක්ත වේ. එනම්, කාය විවේකයෙන්ද, චිත්ත විවේකයෙන්ද යුක්ත වේ. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින තුන්වැනි හේතුවයි, තුන්වැනි ප්‍රත්‍යයයි.\n\nඔහු සිල්වත්ව සිටී. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාර සම්පන්නවද, ගෝචර සම්පන්නවද සිටී. ස්වල්ප මාත්‍ර වූ වරදකදී පවා බිය දකියි. ශික්‍ෂා පදයන් සමාදන්ව හික්මෙයි. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින සිව්වැනි හේතුවයි, සිව්වැනි ප්‍රත්‍යයයි.\n\nඔහු බොහෝ ඇසූ පිරූ තැන් ඇත්තෙක් වේ. ඇසූ දේ දරාගත්තෙක් වේ. ඇසූ දේ ගබඩා කරගත්තෙක් වේ. යම් ඒ ධර්‍මයන් මුල යහපත්ද, මැද යහපත්ද, කෙළවර යහපත්ද, අර්ථ සහිතද, ව්‍යංජන සහිතද, සකල අයුරින්ම සම්පූර්ණද, පිරිසිදු වූ බඹසර ප්‍රකාශ කරන්නේද, එවැනි ධර්‍මයන් ඔහුට බොහෝ සෙයින් අසන ලද, දරා ගන්නා ලද, වචනයෙන් පුරුදු කරන ලද, සිතින් විමසන ලද, නුවණින් මැනවින් අවබෝධ කරන ලද ඒවා වෙයි. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින පස්වැනි හේතුවයි, පස්වැනි ප්‍රත්‍යයයි.\n\nඔහු අකුසල ධර්‍මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්‍මයන් උපදවා ගැනීම පිණිසත්, වීර්යය අරඹා වාසය කරයි. ශක්තිසම්පන්නව, දැඩි පරාක්‍රමයකින් යුතුව, කුසල ධර්‍මයන්හි බර අත් නොහැර වාසය කරයි. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින සවැනි හේතුවයි, සවැනි ප්‍රත්‍යයයි.\n\nඔහු සංඝයා අතරට ගිය කල නොයෙක් කතා ඇති අයෙක් නොවේ, තිරශ්චීන කතා ඇති අයෙක් නොවේ. ඔහු තමාම ධර්‍මය දේශනා කරයි, නැතහොත් අනුන් ලවා දේශනා කරවයි, නැතහොත් ආර්ය තූෂ්ණීම්භාවය හෙළා නොදකියි. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින සත්වැනි හේතුවයි, සත්වැනි ප්‍රත්‍යයයි.\n\nඔහු පංච උපාදානස්කන්ධයන්හි උදය-ව්‍යය අනුපස්සීව වාසය කරයි. ‘මේ රූපයයි, මේ රූපයේ හටගැනීමයි, මේ රූපයේ නැතිවීමයි; මේ වේදනාවයි, මේ වේදනාවේ හටගැනීමයි, මේ වේදනාවේ නැතිවීමයි; මේ සංඥාවයි, මේ සංඥාවේ හටගැනීමයි, මේ සංඥාවේ නැතිවීමයි; මේ සංස්කාරයි, මේ සංස්කාරයන්ගේ හටගැනීමයි, මේ සංස්කාරයන්ගේ නැතිවීමයි; මේ විඤ්ඤාණයයි, මේ විඤ්ඤාණයේ හටගැනීමයි, මේ විඤ්ඤාණයේ නැතිවීමයි’ කියාය. මහණෙනි, මෙය මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් පවතින අටවැනි හේතුවයි, අටවැනි ප්‍රත්‍යයයි.\n\nඒ භික්‍ෂුව අරබයා සබ්‍රහ්මචාරීහු මෙසේ සලකති. ‘මේ ආයුෂ්මත් ශාස්තෲන් වහන්සේට හෝ යම් ගරු කළ යුතු සබ්‍රහ්මචාරියෙකුට උපනිශ්‍රය වී වාසය කරයි, යම් තැනැත්තෙකු කෙරෙහි ඔහුට දැඩි හිරි-ඔතප් දෙකක්ද, ප්‍රේමයද, ගෞරවයද පිහිටා තිබේද. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\n‘එමෙන්ම මේ ආයුෂ්මත් ශාස්තෲන් වහන්සේට හෝ යම් ගරු කළ යුතු සබ්‍රහ්මචාරියෙකුට උපනිශ්‍රය වී වාසය කරන්නේ, යම් තැනැත්තෙකු කෙරෙහි ඔහුට දැඩි හිරි-ඔතප් දෙකක්ද, ප්‍රේමයද, ගෞරවයද පිහිටා තිබේද, ඔවුන් වෙත කලින් කල පැමිණ, ‘ස්වාමීනි, මේ කෙසේද? මෙහි අර්ථය කුමක්දැයි’ විමසා අසයි. එවිට ඒ ආයුෂ්මත්හු ඔහුට නොවිවෘත වූ දේ විවෘත කරති, නුපුහුණු දේ පුහුණු කරති, නොයෙක් ආකාර සැක උපදවන ධර්‍මයන්හි ඔහුගේ සැකය දුරු කරති. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\n‘එමෙන්ම මේ ආයුෂ්මත් ඒ ධර්‍මය අසා ආකාර දෙකක විවේකයකින් යුක්ත වේ. එනම්, කාය විවේකයෙන්ද, චිත්ත විවේකයෙන්ද යුක්ත වේ. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\n‘එමෙන්ම මේ ආයුෂ්මත් සිල්වත්ව සිටී. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාර සම්පන්නවද, ගෝචර සම්පන්නවද සිටී. ස්වල්ප මාත්‍ර වූ වරදකදී පවා බිය දකියි. ශික්‍ෂා පදයන් සමාදන්ව හික්මෙයි. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\n‘එමෙන්ම මේ ආයුෂ්මත් බොහෝ ඇසූ පිරූ තැන් ඇත්තෙක් වේ. ඇසූ දේ දරාගත්තෙක් වේ. ඇසූ දේ ගබඩා කරගත්තෙක් වේ. යම් ඒ ධර්‍මයන් මුල යහපත්ද, මැද යහපත්ද, කෙළවර යහපත්ද, අර්ථ සහිතද, ව්‍යංජන සහිතද, සකල අයුරින්ම සම්පූර්ණද, පිරිසිදු වූ බඹසර ප්‍රකාශ කරන්නේද, එවැනි ධර්‍මයන් ඔහුට බොහෝ සෙයින් අසන ලද, දරා ගන්නා ලද, වචනයෙන් පුරුදු කරන ලද, සිතින් විමසන ලද, නුවණින් මැනවින් අවබෝධ කරන ලද ඒවා වෙයි. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\n‘එමෙන්ම මේ ආයුෂ්මත් අකුසල ධර්‍මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්‍මයන් උපදවා ගැනීම පිණිසත්, වීර්යය අරඹා වාසය කරයි. ශක්තිසම්පන්නව, දැඩි පරාක්‍රමයකින් යුතුව, කුසල ධර්‍මයන්හි බර අත් නොහැර වාසය කරයි. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\n‘එමෙන්ම මේ ආයුෂ්මත් සංඝයා අතරට ගිය කල නොයෙක් කතා ඇති අයෙක් නොවේ, තිරශ්චීන කතා ඇති අයෙක් නොවේ. ඔහු තමාම ධර්‍මය දේශනා කරයි, නැතහොත් අනුන් ලවා දේශනා කරවයි, නැතහොත් ආර්ය තූෂ්ණීම්භාවය හෙළා නොදකියි. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\n‘එමෙන්ම මේ ආයුෂ්මත් පංච උපාදානස්කන්ධයන්හි උදය-ව්‍යය අනුපස්සීව වාසය කරයි. ‘මේ රූපයයි, මේ රූපයේ හටගැනීමයි, මේ රූපයේ නැතිවීමයි; මේ වේදනාවයි, මේ වේදනාවේ හටගැනීමයි, මේ වේදනාවේ නැතිවීමයි; මේ සංඥාවයි, මේ සංඥාවේ හටගැනීමයි, මේ සංඥාවේ නැතිවීමයි; මේ සංස්කාරයි, මේ සංස්කාරයන්ගේ හටගැනීමයි, මේ සංස්කාරයන්ගේ නැතිවීමයි; මේ විඤ්ඤාණයයි, මේ විඤ්ඤාණයේ හටගැනීමයි, මේ විඤ්ඤාණයේ නැතිවීමයි’ කියාය. සැබැවින්ම මේ ආයුෂ්මත් දන්නා දෙය දනියි, දකින දෙය දකියි!’ මේ ධර්‍මයද ප්‍රියභාවය පිණිසත්, ගෞරවභාවය පිණිසත්, වැඩීම පිණිසත්, සාමාන්‍ය බව පිණිසත්, එකමුතු බව පිණිසත් පවතී.\n\nමහණෙනි, මුල් බඹසරට අයත් ප්‍රඥාව නොලද තැනැත්තාට ලැබීම පිණිසත්, ලැබූ තැනැත්තාට වැඩි දියුණු වීම පිණිසත්, මහත් වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් මේ හේතූන් අට, ප්‍රත්‍යයන් අට පවතී.",
      "paliTitle": "Paññāsuttaṃ",
      "englishTitle": "The Wisdom Discourse",
      "sinhalaTitle": "ප්‍රඥා සූත්‍රය"
    },
    {
      "number": 3,
      "pali": "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu appiyapasaṃsī ca hoti, piyagarahī ca, lābhakāmo ca, sakkārakāmo ca, ahiriko ca, anottappī ca, pāpiccho ca, micchādiṭṭhi ca. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu na appiyapasaṃsī ca hoti, na piyagarahī ca, na lābhakāmo ca, na sakkārakāmo ca, hirīmā ca hoti, ottappī ca, appiccho ca, sammādiṭṭhi ca. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Tatiyaṃ.",
      "english": "Monks, a bhikkhu endowed with eight qualities becomes disliked, unpleasant, disrespectful, and unworthy of esteem by his fellow practitioners. Which eight? Here, monks, a bhikkhu praises what is unpleasing, disparages what is pleasing, is desirous of gain, is desirous of honor, is shameless, is without moral dread, has evil desires, and holds wrong view. Monks, it is with these eight qualities that a bhikkhu becomes disliked, unpleasant, disrespectful, and unworthy of esteem by his fellow practitioners.\n\nMonks, a bhikkhu endowed with eight qualities becomes dear, pleasing, respected, and worthy of esteem by his fellow practitioners. Which eight? Here, monks, a bhikkhu does not praise what is unpleasing, does not disparage what is pleasing, is not desirous of gain, is not desirous of honor, is conscientious, has moral dread, has few desires, and holds right view. Monks, it is with these eight qualities that a bhikkhu becomes dear, pleasing, respected, and worthy of esteem by his fellow practitioners.",
      "sinhala": "භික්ෂූනි, කරුණු අටකින් යුක්ත භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රි‍ය ද වේ, නොමනාප ද වේ, ගරු නොකටයුතු ද වේ, නොවැඩිය යුතු ද වේ. ඒ අට කුමක් ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් අප්‍රි‍ය පුද්ගලයන්ට ප්‍රශංසා කරන්නෙක් ද වේ, ප්‍රිය පුද්ගලයන්ට නින්දා කරන්නෙක් ද වේ, ලාභ කැමති කෙනෙක් ද වේ, සත්කාර කැමති කෙනෙක් ද වේ, ලජ්ජා නැති කෙනෙක් ද වේ, පවට බිය නැති කෙනෙක් ද වේ, නපුරු සිත් ඇති කෙනෙක් ද වේ, මිථ්‍යා දෘෂ්ටික කෙනෙක් ද වේ. භික්ෂූනි, මේ කරුණු අටෙන් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රි‍ය ද වේ, නොමනාප ද වේ, ගරු නොකටයුතු ද වේ, නොවැඩිය යුතු ද වේ.\n\nභික්ෂූනි, කරුණු අටකින් යුක්ත භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, මනාප ද වේ, ගරු කටයුතු ද වේ, වැඩිය යුතු ද වේ. ඒ අට කුමක් ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් අප්‍රි‍ය පුද්ගලයන්ට ප්‍රශංසා නොකරන්නෙක් ද වේ, ප්‍රිය පුද්ගලයන්ට නින්දා නොකරන්නෙක් ද වේ, ලාභ කැමති නොවන කෙනෙක් ද වේ, සත්කාර කැමති නොවන කෙනෙක් ද වේ, ලජ්ජා ඇත්තෙක් ද වේ, පවට බිය ඇත්තෙක් ද වේ, අල්පේච්ඡ කෙනෙක් ද වේ, සම්මා දෘෂ්ටික කෙනෙක් ද වේ. භික්ෂූනි, මේ කරුණු අටෙන් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, මනාප ද වේ, ගරු කටයුතු ද වේ, වැඩිය යුතු ද වේ.",
      "paliTitle": "Paṭhamaappiyasuttaṃ",
      "englishTitle": "First Discourse on the Unpleasant",
      "sinhalaTitle": "පළමු අප්‍රිය සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu lābhakāmo ca hoti, sakkārakāmo ca, anavaññattikāmo ca, akālaññū ca, amattaññū ca, asuci ca, bahubhāṇī ca, akkosakaparibhāsako ca sabrahmacārīnaṃ. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu na lābhakāmo ca hoti, na sakkārakāmo ca, na anavaññattikāmo ca, kālaññū ca, mattaññū ca, suci ca, na bahubhāṇī ca, anakkosakaparibhāsako ca sabrahmacārīnaṃ. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Catutthaṃ.",
      "english": "Monks, a monk endowed with eight qualities is disliked by his fellow monastics, displeasing, disrespected, and not worthy of esteem. What are these eight? Here, monks, a monk is fond of gain, fond of honor, fond of not being despised, does not discern the proper time, does not discern moderation, is unclean, is garrulous, and is abusive and reviling towards his fellow monastics. Indeed, monks, a monk endowed with these eight qualities is disliked by his fellow monastics, displeasing, disrespected, and not worthy of esteem.\n\nMonks, a monk endowed with eight qualities is dear to his fellow monastics, pleasing, respected, and worthy of esteem. What are these eight? Here, monks, a monk is not fond of gain, not fond of honor, not fond of not being despised, discerns the proper time, discerns moderation, is clean, is not garrulous, and is not abusive and not reviling towards his fellow monastics. Indeed, monks, a monk endowed with these eight qualities is dear to his fellow monastics, pleasing, respected, and worthy of esteem.",
      "sinhala": "මහණෙනි, ධර්‍ම අටකින් සමන්විත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වේ, අප්‍රසන්න ද වේ, අගරු ද වේ, භාවනීය නොවන ද වේ. කවර අටකින් ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ලාභයට කැමති ද වේ, සත්කාරයට කැමති ද වේ, අවඥාවට අකමැති ද වේ, කාලය නොදන්නා ද වේ, මාත්‍රාව නොදන්නා ද වේ, අපිරිසිදු ද වේ, බොහෝ දේ කතා කරන ද වේ, සබ්‍රහ්මචාරීන්ට බැන වදිනසුළු ද, දොස් පවරනසුළු ද වේ. මහණෙනි, මේ අට ධර්‍මයන්ගෙන් සමන්විත වූ භික්ෂුව සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වේ, අප්‍රසන්න ද වේ, අගරු ද වේ, භාවනීය නොවන ද වේ.\n\nමහණෙනි, ධර්‍ම අටකින් සමන්විත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, ප්‍රසන්න ද වේ, ගරු ද වේ, භාවනීය ද වේ. කවර අටකින් ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ලාභයට කැමති නොවේ, සත්කාරයට කැමති නොවේ, අවඥාවට අකමැති නොවේ, කාලය දන්නා ද වේ, මාත්‍රාව දන්නා ද වේ, පිරිසිදු ද වේ, බොහෝ දේ කතා කරන නොවේ, සබ්‍රහ්මචාරීන්ට බැන වදිනසුළු ද, දොස් පවරනසුළු ද නොවේ. මහණෙනි, මේ අට ධර්‍මයන්ගෙන් සමන්විත වූ භික්ෂුව සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, ප්‍රසන්න ද වේ, ගරු ද වේ, භාවනීය ද වේ.",
      "paliTitle": "Dutiyaappiyasuttaṃ",
      "englishTitle": "The Second Discourse on the Unpleasant",
      "sinhalaTitle": "දෙවන අප්‍ර‌ිය සූත්‍‌රය"
    },
    {
      "number": 5,
      "pali": "‘‘Aṭṭhime, bhikkhave, lokadhammā lokaṃ anuparivattanti, loko ca aṭṭha lokadhamme anuparivattati. Katame aṭṭha? Lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañca. Ime kho, bhikkhave, aṭṭha lokadhammā lokaṃ anuparivattanti, loko ca ime aṭṭha lokadhamme anuparivattatī’’ti. ‘‘Lābho alābho ca yasāyaso ca, Nindā pasaṃsā ca sukhaṃ dukhañca; Ete aniccā manujesu dhammā, Asassatā vipariṇāmadhammā. ‘‘Ete ca ñatvā satimā sumedho, Avekkhati vipariṇāmadhamme; Iṭṭhassa dhammā na mathenti cittaṃ, Aniṭṭhato no paṭighātameti. ‘‘Tassānurodhā atha vā virodhā, Vidhūpitā atthaṅgatā na santi; Padañca ñatvā virajaṃ asokaṃ, Sammappajānāti bhavassa pāragū’’ti. pañcamaṃ;",
      "english": "Monks, these eight worldly conditions revolve around the world, and the world revolves around these eight worldly conditions. Which eight? Gain and loss, fame and disrepute, blame and praise, pleasure and pain. These eight worldly conditions, monks, revolve around the world, and the world revolves around these eight worldly conditions.\n\nGain and loss, fame and disrepute,\nBlame and praise, pleasure and pain;\nThese things among humans are impermanent,\nNon-eternal, subject to change.\n\nHaving understood these things, a mindful, wise person\nContemplates those that are subject to change;\nPleasant things do not disturb their mind,\nNor do unpleasant things lead to resistance.\n\nTheir attraction and aversion\nAre dispelled, extinguished, and no longer exist;\nHaving known the dustless, sorrowless state,\nThey fully understand, having reached the far shore of existence.",
      "sinhala": "මහණෙනි, මේ අෂ්ට ලෝක ධර්මයෝ ලෝකය අනුව හැසිරෙති. ලෝකය ද මේ අෂ්ට ලෝක ධර්මයන් අනුව හැසිරෙයි. කවර අටක් ද? ලාභය ද, අලාභය ද, යසස ද, අයසස ද, නින්දා ද, ප්‍රශංසා ද, සැපය ද, දුක ද යන මේවාය. මහණෙනි, ඇත්ත වශයෙන්ම මේ අෂ්ට ලෝක ධර්මයෝ ලෝකය අනුව හැසිරෙති. ලෝකය ද මේ අෂ්ට ලෝක ධර්මයන් අනුව හැසිරෙයි.\n\nලාභය ද අලාභය ද, යසස ද අයසස ද, නින්දා ද ප්‍රශංසා ද, සැපය ද දුක ද යන මේවා මනුෂ්‍යයන් අතර ඇති අනිත්‍ය ධර්මයෝ වෙති. මේවා සදාකාලික නොවන, වෙනස් වන ස්වභාවයෙන් යුත් ධර්මයෝ වෙති.\n\nසිහි ඇත්තා වූ, මනා නුවණැත්තා වූ යෝගී තැනැත්තා මේ ධර්මයන් දැන, වෙනස් වන ස්වභාවයෙන් යුත් දේ කෙරෙහි මෙනෙහි කරයි. ඔහුට කැමති ධර්මයන් ඔහුගේ සිත නොකැලඹයි. අකැමැති දේ නිසා ඔහුට ගැටීමක් ද ඇති නොවේ.\n\nඔහුට අනුරෝධයෝ (කැමැත්තෙන් බැඳීම්) හෝ විරෝධයෝ (අකැමැත්තෙන් ගැටීම්) හෝ දුරු කරන ලද, නැති කරන ලද බැවින් නොපවතී. කෙලෙස් රහිත වූ, ශෝක රහිත වූ නිර්වාණ පදය දැන, භවයේ පරතෙරට ගිය තැනැත්තා මැනවින් අවබෝධ කරයි.",
      "paliTitle": "Paṭhamalokadhammasuttaṃ",
      "englishTitle": "First Discourse on Worldly Conditions",
      "sinhalaTitle": "ප්‍රථම ලෝකධ‌ර්ම සූත්‍රය"
    },
    {
      "number": 6,
      "pali": "‘‘Aṭṭhime, bhikkhave, lokadhammā lokaṃ anuparivattanti, loko ca aṭṭha lokadhamme anuparivattati. Katame aṭṭha? Lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañca. Ime kho, bhikkhave, aṭṭha lokadhammā lokaṃ anuparivattanti, loko ca ime aṭṭha lokadhamme anuparivattati. ‘‘Assutavato, bhikkhave, puthujjanassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṃsāpi sukhampi dukkhampi. Sutavatopi, bhikkhave, ariyasāvakassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṃsāpi sukhampi dukkhampi. Tatra, bhikkhave, ko viseso ko adhippayāso [adhippāyo (sī.), adhippāyaso (syā. kaṃ.) adhi + pa + yasu + ṇa = adhippayāso] kiṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘assutavato, bhikkhave, puthujjanassa uppajjati lābho. So na iti paṭisañcikkhati – ‘uppanno kho me ayaṃ lābho; so ca kho anicco dukkho vipariṇāmadhammo’ti yathābhūtaṃ nappajānāti. Uppajjati alābho…pe… uppajjati yaso… uppajjati ayaso… uppajjati nindā… uppajjati pasaṃsā… uppajjati sukhaṃ… uppajjati dukkhaṃ. So na iti paṭisañcikkhati – ‘uppannaṃ kho me idaṃ dukkhaṃ; tañca kho aniccaṃ dukkhaṃ vipariṇāmadhamma’nti yathābhūtaṃ nappajānāti’’. ‘‘Tassa lābhopi cittaṃ pariyādāya tiṭṭhati, alābhopi cittaṃ pariyādāya tiṭṭhati, yasopi cittaṃ pariyādāya tiṭṭhati, ayasopi cittaṃ pariyādāya tiṭṭhati, nindāpi cittaṃ pariyādāya tiṭṭhati, pasaṃsāpi cittaṃ pariyādāya tiṭṭhati, sukhampi cittaṃ pariyādāya tiṭṭhati, dukkhampi cittaṃ pariyādāya tiṭṭhati. So uppannaṃ lābhaṃ anurujjhati, alābhe paṭivirujjhati; uppannaṃ yasaṃ anurujjhati, ayase paṭivirujjhati; uppannaṃ pasaṃsaṃ anurujjhati, nindāya paṭivirujjhati; uppannaṃ sukhaṃ anurujjhati, dukkhe paṭivirujjhati. So evaṃ anurodhavirodhasamāpanno na parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. ‘Na parimuccati dukkhasmā’ti vadāmi’’. ‘‘Sutavato ca kho, bhikkhave, ariyasāvakassa uppajjati lābho. So iti paṭisañcikkhati – ‘uppanno kho me ayaṃ lābho; so ca kho anicco dukkho vipariṇāmadhammo’ti yathābhūtaṃ pajānāti. Uppajjati alābho…pe… uppajjati yaso… uppajjati ayaso… uppajjati nindā… uppajjati pasaṃsā… uppajjati sukhaṃ… uppajjati dukkhaṃ. So iti paṭisañcikkhati – ‘uppannaṃ kho me idaṃ dukkhaṃ; tañca kho aniccaṃ dukkhaṃ vipariṇāmadhamma’nti yathābhūtaṃ pajānāti’’. ‘‘Tassa lābhopi cittaṃ na pariyādāya tiṭṭhati, alābhopi cittaṃ na pariyādāya tiṭṭhati, yasopi cittaṃ na pariyādāya tiṭṭhati, ayasopi cittaṃ na pariyādāya tiṭṭhati, nindāpi cittaṃ na pariyādāya tiṭṭhati, pasaṃsāpi cittaṃ na pariyādāya tiṭṭhati, sukhampi cittaṃ na pariyādāya tiṭṭhati, dukkhampi cittaṃ na pariyādāya tiṭṭhati. So uppannaṃ lābhaṃ nānurujjhati, alābhe nappaṭivirujjhati; uppannaṃ yasaṃ nānurujjhati, ayase nappaṭivirujjhati; uppannaṃ pasaṃsaṃ nānurujjhati, nindāya nappaṭivirujjhati; uppannaṃ sukhaṃ nānurujjhati, dukkhe nappaṭivirujjhati. So evaṃ anurodhavirodhavippahīno parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. ‘Parimuccati dukkhasmā’ti vadāmi. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti. ‘‘Lābho alābho ca yasāyaso ca, Nindā pasaṃsā ca sukhaṃ dukhañca; Ete aniccā manujesu dhammā, Asassatā vipariṇāmadhammā. ‘‘Ete ca ñatvā satimā sumedho, Avekkhati vipariṇāmadhamme; Iṭṭhassa dhammā na mathenti cittaṃ, Aniṭṭhato no paṭighātameti. ‘‘Tassānurodhā atha vā virodhā, Vidhūpitā atthaṅgatā na santi; Padañca ñatvā virajaṃ asokaṃ, Sammappajānāti bhavassa pāragū’’ti. chaṭṭhaṃ;",
      "english": "Monks, these eight worldly conditions revolve around the world, and the world revolves around these eight worldly conditions. Which eight? Gain and loss, fame and disrepute, blame and praise, pleasure and pain. Indeed, monks, these eight worldly conditions revolve around the world, and the world revolves around these eight worldly conditions.\n\nMonks, gain arises for the uninstructed ordinary person, and loss arises, fame arises, and disrepute arises, blame arises, and praise arises, pleasure arises, and pain arises. Monks, gain also arises for the instructed noble disciple, and loss arises, fame arises, and disrepute arises, blame arises, and praise arises, pleasure arises, and pain arises. So then, monks, what is the distinction, what is the difference, what is the differentiating factor between the instructed noble disciple and the uninstructed ordinary person? \"Venerable Sir, for us, the teachings have the Blessed One as their root, the Blessed One as their guide, the Blessed One as their refuge. It would be good, Venerable Sir, if the Blessed One himself would illuminate the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.\" \"In that case, monks, listen, attend carefully; I shall speak.\" \"Yes, Venerable Sir,\" those monks replied to the Blessed One.\n\nThe Blessed One said this: \"Monks, when gain arises for the uninstructed ordinary person, he does not reflect thus: 'This gain that has arisen for me is impermanent, unsatisfactory, and subject to change.' He does not understand it as it actually is. Similarly for loss, fame, disrepute, blame, praise, and pleasure. When pain arises, he does not reflect thus: 'This pain that has arisen for me is impermanent, unsatisfactory, and subject to change.' He does not understand it as it actually is.\"\n\nFor him, gain seizes his mind, loss seizes his mind, fame seizes his mind, disrepute seizes his mind, blame seizes his mind, praise seizes his mind, pleasure seizes his mind, and pain seizes his mind. He is attached to arisen gain, he is averse to loss; he is attached to arisen fame, he is averse to disrepute; he is attached to arisen praise, he is averse to blame; he is attached to arisen pleasure, he is averse to pain. Thus, being caught up in attachment and aversion, he is not freed from birth, aging, death, sorrows, lamentations, pains, distresses, and despairs. 'He is not freed from suffering,' I say.\"\n\n\"However, monks, when gain arises for the instructed noble disciple, he reflects thus: 'This gain that has arisen for me is impermanent, unsatisfactory, and subject to change.' He understands it as it actually is. Similarly for loss, fame, disrepute, blame, praise, and pleasure. When pain arises, he reflects thus: 'This pain that has arisen for me is impermanent, unsatisfactory, and subject to change.' He understands it as it actually is.\"\n\nFor him, gain does not seize his mind, loss does not seize his mind, fame does not seize his mind, disrepute does not seize his mind, blame does not seize his mind, praise does not seize his mind, pleasure does not seize his mind, and pain does not seize his mind. He is not attached to arisen gain, he is not averse to loss; he is not attached to arisen fame, he is not averse to disrepute; he is not attached to arisen praise, he is not averse to blame; he is not attached to arisen pleasure, he is not averse to pain. Thus, having abandoned attachment and aversion, he is freed from birth, aging, death, sorrows, lamentations, pains, distresses, and despairs. 'He is freed from suffering,' I say. This, monks, is the distinction, this is the difference, this is the differentiating factor between the instructed noble disciple and the uninstructed ordinary person.\"\n\n\"Gain and loss, fame and disrepute, blame and praise, pleasure and pain—these are impermanent conditions among humans, non-eternal, and subject to change.\n\nKnowing these, the mindful and wise one reflects on conditions subject to change. Desirable conditions do not overwhelm his mind, and he does not react with aversion to undesirable ones.\n\nFor him, attachment and aversion are dispelled, gone to their end, and do not exist. Knowing the stainless, sorrowless state, the one who has reached the far shore of existence rightly comprehends.\"",
      "sinhala": "මහණෙනි, මේ අට ලෝ දහම් ලෝකය වටා කැරකෙයි. ලෝකයද මේ අට ලෝ දහම් වටා කැරකෙයි. කවර අටක්ද? ලාභයද, අලාභයද, යසසද, අයසද, නින්දාවද, ප්‍රශංසාවද, සැපයද, දුකද යන මේ අටයි. මහණෙනි, ඇත්තෙන්ම මේ අට ලෝ දහම් ලෝකය වටා කැරකෙයි. ලෝකයද මේ අට ලෝ දහම් වටා කැරකෙයි.\n\nමහණෙනි, අශ්‍රැතවත් පෘථග්ජනයාට ලාභයද, අලාභයද, යසසද, අයසද, නින්දාවද, ප්‍රශංසාවද, සැපයද, දුකද ඇතිවේ. මහණෙනි, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයාටද ලාභයද, අලාභයද, යසසද, අයසද, නින්දාවද, ප්‍රශංසාවද, සැපයද, දුකද ඇතිවේ. මහණෙනි, එහිදී ශ්‍රැතවත් ආර්ය ශ්‍රාවකයාටත්, අශ්‍රැතවත් පෘථග්ජනයාටත් අතර ඇති වෙනස කුමක්ද? ඇති විශේෂ අදහස කුමක්ද? ඇති වෙනස්කම කුමක්ද?\n\nවහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. වහන්ස, යහපති! මේ කියමනේ අර්ථය භාග්‍යවතුන් වහන්සේටම පහළ වේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහ. එසේ නම් මහණෙනි, අසව්. මැනවින් මෙනෙහි කරව්; මම දේශනා කරන්නෙමි. 'එසේය, වහන්සැ'යි කියා ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\nමහණෙනි, අශ්‍රැතවත් පෘථග්ජනයාට ලාභය ඇතිවේ. ඔහු මෙසේ මෙනෙහි නොකරයි: 'මට මේ ලාභය ඇතිවී තිබේ; එය අනිත්‍යය, දුක්ඛය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය' යනුවෙන් යථාභූතව නොදනී. අලාභය ඇතිවේ... යසස ඇතිවේ... අයස ඇතිවේ... නින්දාව ඇතිවේ... ප්‍රශංසාව ඇතිවේ... සැපය ඇතිවේ... දුක ඇතිවේ. ඔහු මෙසේ මෙනෙහි නොකරයි: 'මට මේ දුක ඇතිවී තිබේ; එය අනිත්‍යය, දුක්ඛය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය' යනුවෙන් යථාභූතව නොදනී.\n\nඔහුගේ සිත ලාභයෙන්ද මුළාවේ. අලාභයෙන්ද මුළාවේ. යසසින්ද මුළාවේ. අයසින්ද මුළාවේ. නින්දාවෙන්ද මුළාවේ. ප්‍රශංසාවෙන්ද මුළාවේ. සැපයෙන්ද මුළාවේ. දුකෙන්ද මුළාවේ. ඔහු ඇතිවූ ලාභයට ඇලෙයි. අලාභයට ගැටෙයි. ඇතිවූ යසසට ඇලෙයි. අයසට ගැටෙයි. ඇතිවූ ප්‍රශංසාවට ඇලෙයි. නින්දාවට ගැටෙයි. ඇතිවූ සැපයට ඇලෙයි. දුකට ගැටෙයි. මෙසේ ඇලීම් හා ගැටීම් වලින් යුක්ත වූ ඔහු, ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, කායික දුකෙන්, මානසික දුකෙන්, හා උපායාසයෙන් (ව්‍යාකුල බවින්) නිදහස් නොවේ. 'ඔහු දුකින් නිදහස් නොවේ' යැයි මම කියමි.\n\nමහණෙනි, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයාට ලාභය ඇතිවේ. ඔහු මෙසේ මෙනෙහි කරයි: 'මට මේ ලාභය ඇතිවී තිබේ; එය අනිත්‍යය, දුක්ඛය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය' යනුවෙන් යථාභූතව දනී. අලාභය ඇතිවේ... යසස ඇතිවේ... අයස ඇතිවේ... නින්දාව ඇතිවේ... ප්‍රශංසාව ඇතිවේ... සැපය ඇතිවේ... දුක ඇතිවේ. ඔහු මෙසේ මෙනෙහි කරයි: 'මට මේ දුක ඇතිවී තිබේ; එය අනිත්‍යය, දුක්ඛය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය' යනුවෙන් යථාභූතව දනී.\n\nඔහුගේ සිත ලාභයෙන් මුළා නොවේ. අලාභයෙන් මුළා නොවේ. යසසින් මුළා නොවේ. අයසින් මුළා නොවේ. නින්දාවෙන් මුළා නොවේ. ප්‍රශංසාවෙන් මුළා නොවේ. සැපයෙන් මුළා නොවේ. දුකෙන් මුළා නොවේ. ඔහු ඇතිවූ ලාභයට නොඇලෙයි. අලාභයට නොගැටෙයි. ඇතිවූ යසසට නොඇලෙයි. අයසට නොගැටෙයි. ඇතිවූ ප්‍රශංසාවට නොඇලෙයි. නින්දාවට නොගැටෙයි. ඇතිවූ සැපයට නොඇලෙයි. දුකට නොගැටෙයි. මෙසේ ඇලීම් හා ගැටීම් අත්හළ ඔහු ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැලපීමෙන්, කායික දුකෙන්, මානසික දුකෙන්, හා උපායාසයෙන් නිදහස් වේ. 'ඔහු දුකින් නිදහස් වේ' යැයි මම කියමි. මහණෙනි, මේ නම් ශ්‍රැතවත් ආර්ය ශ්‍රාවකයාටත්, අශ්‍රැතවත් පෘථග්ජනයාටත් අතර ඇති වෙනසය, මේ විශේෂ අදහසය, මේ වෙනස්කමය.\n\nලාභය අලාභය හා යසස අයසද,\nනින්දාව ප්‍රශංසාව හා සැපය දුකද;\nමේ දහම් මනුෂ්‍යයන් අතර අනිත්‍යය,\nසදාකාලික නොවන්නාහ, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තවන්නාහ.\n\nමේවා දැනගෙන සිහි නුවණ ඇති ප්‍රඥාවන්තයා වෙනස්වන සුළු මේ ස්වභාවයන් නුවණින් විමසයි.\nඔහුට ප්‍රිය දහම් සිත නොකලඹයි. අප්‍රිය දහම් නිසා ඔහුට ගැටීමක් ඇති නොවේ.\n\nඔහුගේ ඇලීම් හෝ ගැටීම් පහව ගොස්, නැතිවී ගොස්, නොපවතී.\nකෙලෙස් රහිත වූ, ශෝක රහිත වූ (නිවන නම්) තත්ත්වය දැන, භවයෙන් එතෙර වූ ඔහු සම්‍යක් ප්‍රඥාවෙන් අවබෝධ කරයි.",
      "paliTitle": "Dutiyalokadhammasuttaṃ",
      "englishTitle": "Second Discourse on Worldly Conditions",
      "sinhalaTitle": "දෙවන ලෝකධර්ම සූත්‍රය"
    },
    {
      "number": 7,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra bhagavā devadattaṃ ārabbha bhikkhū āmantesi – ‘‘sādhu, bhikkhave, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hoti. Aṭṭhahi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho’’. [cūḷava. 348] ‘‘Katamehi aṭṭhahi? Lābhena hi, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Alābhena, bhikkhave…pe… yasena, bhikkhave… ayasena, bhikkhave… sakkārena, bhikkhave… asakkārena, bhikkhave… pāpicchatāya, bhikkhave… pāpamittatāya, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Imehi kho, bhikkhave, aṭṭhahi asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. ‘‘Sādhu, bhikkhave, bhikkhu uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ … uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya. ‘‘Kiñca [kathañca (ka.)], bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya? ‘‘Yaṃ hissa, bhikkhave, uppannaṃ lābhaṃ anabhibhuyya [anabhibhūyya anabhibhūyya (ka.)] viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ lābhaṃ abhibhuyya [abhibhūyya abhibhūyya (ka.)] viharato evaṃsa te āsavā vighātapariḷāhā na honti. Yaṃ hissa, bhikkhave, uppannaṃ alābhaṃ… pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ pāpamittataṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ … uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhaṃ abhibhuyya abhibhuyya viharissāma, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ.",
      "english": "On one occasion, the Blessed One was staying near Rājagaha, on Vulture Peak Mountain, not long after Devadatta had departed. There, the Blessed One addressed the bhikkhus concerning Devadatta, saying: “It is good, bhikkhus, for a bhikkhu from time to time to reflect on his own failures. It is good, bhikkhus, for a bhikkhu from time to time to reflect on the failures of others. It is good, bhikkhus, for a bhikkhu from time to time to reflect on his own achievements. It is good, bhikkhus, for a bhikkhu from time to time to reflect on the achievements of others. Devadatta, bhikkhus, overcome and overwhelmed in mind by eight unwholesome things, is destined for a miserable state, for hell, to remain for an eon, beyond remedy.”\n\n“Which eight? Indeed, bhikkhus, overcome and overwhelmed in mind by gain, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Overcome and overwhelmed in mind by lack of gain, bhikkhus, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Overcome and overwhelmed in mind by fame, bhikkhus, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Overcome and overwhelmed in mind by lack of fame, bhikkhus, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Overcome and overwhelmed in mind by honor, bhikkhus, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Overcome and overwhelmed in mind by dishonor, bhikkhus, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Overcome and overwhelmed in mind by evil desires, bhikkhus, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Overcome and overwhelmed in mind by evil friendship, bhikkhus, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy. Indeed, bhikkhus, by these eight unwholesome things, overcome and overwhelmed in mind, Devadatta is destined for a miserable state, for hell, to remain for an eon, beyond remedy.”\n\n“It is good, bhikkhus, for a bhikkhu to dwell having repeatedly overcome arisen gain, to dwell having repeatedly overcome arisen lack of gain, to dwell having repeatedly overcome arisen fame, to dwell having repeatedly overcome arisen lack of fame, to dwell having repeatedly overcome arisen honor, to dwell having repeatedly overcome arisen dishonor, to dwell having repeatedly overcome arisen evil desires, to dwell having repeatedly overcome arisen evil friendship.”\n\n“And for what purpose, bhikkhus, should a bhikkhu dwell having repeatedly overcome arisen gain, dwell having repeatedly overcome arisen lack of gain, dwell having repeatedly overcome arisen fame, dwell having repeatedly overcome arisen lack of fame, dwell having repeatedly overcome arisen honor, dwell having repeatedly overcome arisen dishonor, dwell having repeatedly overcome arisen evil desires, dwell having repeatedly overcome arisen evil friendship?”\n\n“For if, bhikkhus, dwelling without having overcome arisen gain, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen gain, such defilements, vexations, and fevers do not arise for him. For if, bhikkhus, dwelling without having overcome arisen lack of gain, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen lack of gain, such defilements, vexations, and fevers do not arise for him. For if, bhikkhus, dwelling without having overcome arisen fame, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen fame, such defilements, vexations, and fevers do not arise for him. For if, bhikkhus, dwelling without having overcome arisen lack of fame, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen lack of fame, such defilements, vexations, and fevers do not arise for him. For if, bhikkhus, dwelling without having overcome arisen honor, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen honor, such defilements, vexations, and fevers do not arise for him. For if, bhikkhus, dwelling without having overcome arisen dishonor, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen dishonor, such defilements, vexations, and fevers do not arise for him. For if, bhikkhus, dwelling without having overcome arisen evil desires, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen evil desires, such defilements, vexations, and fevers do not arise for him. For if, bhikkhus, dwelling without having overcome arisen evil friendship, defilements, vexations, and fevers would arise. But by dwelling having overcome arisen evil friendship, such defilements, vexations, and fevers do not arise for him. This indeed, bhikkhus, is the purpose for which a bhikkhu should dwell having repeatedly overcome arisen gain, should dwell having repeatedly overcome arisen lack of gain, should dwell having repeatedly overcome arisen fame, should dwell having repeatedly overcome arisen lack of fame, should dwell having repeatedly overcome arisen honor, should dwell having repeatedly overcome arisen dishonor, should dwell having repeatedly overcome arisen evil desires, should dwell having repeatedly overcome arisen evil friendship.”\n\n“Therefore, bhikkhus, you should train yourselves thus: ‘We will dwell having repeatedly overcome arisen gain, we will dwell having repeatedly overcome arisen lack of gain, we will dwell having repeatedly overcome arisen fame, we will dwell having repeatedly overcome arisen lack of fame, we will dwell having repeatedly overcome arisen honor, we will dwell having repeatedly overcome arisen dishonor, we will dwell having repeatedly overcome arisen evil desires, we will dwell having repeatedly overcome arisen evil friendship.’ That is how you should train yourselves, bhikkhus.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ දෙවදත්ත තෙරණුවන් වහන්සේ නොබෝ කලකට පෙර නික්ම ගිය පසු රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වැඩ වාසය කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ දෙවදත්ත තෙරණුවන් අරභයා භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, කලින් කල තමාගේ විපත්තිය සිහි කිරීම භික්ෂුවකට යහපති. මහණෙනි, කලින් කල අනුන්ගේ විපත්තිය සිහි කිරීම භික්ෂුවකට යහපති. මහණෙනි, කලින් කල තමාගේ සම්පත්තිය සිහි කිරීම භික්ෂුවකට යහපති. මහණෙනි, කලින් කල අනුන්ගේ සම්පත්තිය සිහි කිරීම භික්ෂුවකට යහපති. මහණෙනි, අට අසද්ධර්මයන්ගෙන් යටපත් වූ, සිත මුළුමනින්ම අල්ලා ගත් දෙවදත්ත තෙරණුවෝ අපායට පැමිණෙන, නිරයට පැමිණෙන, කල්පයක් තිස්සේ එහි සිටින, සුව කළ නොහැකි තත්ත්වයක සිටිති.”\n\n“කවර අටකින්ද? මහණෙනි, ලාභයෙන් යටපත් වූ, සිත මුළුමනින්ම අල්ලා ගත් දෙවදත්ත තෙරණුවෝ අපායට පැමිණෙන, නිරයට පැමිණෙන, කල්පයක් තිස්සේ එහි සිටින, සුව කළ නොහැකි තත්ත්වයක සිටිති. මහණෙනි, එසේම අලාභයෙන්, යසසින්, අයසසින්, සත්කාරයෙන්, අසත්කාරයෙන්, පාපිච්ඡතාවයෙන් සහ පාපමිත්‍රතාවයෙන් යටපත් වූ, සිත මුළුමනින්ම අල්ලා ගත් දෙවදත්ත තෙරණුවෝද අපායට පැමිණෙන, නිරයට පැමිණෙන, කල්පයක් තිස්සේ එහි සිටින, සුව කළ නොහැකි තත්ත්වයක සිටිති. මහණෙනි, සැබවින්ම දෙවදත්ත තෙරණුවෝ මේ අට අසද්ධර්මයන්ගෙන් යටපත් වූ, සිත මුළුමනින්ම අල්ලා ගත් හෙයින් අපායට පැමිණෙන, නිරයට පැමිණෙන, කල්පයක් තිස්සේ එහි සිටින, සුව කළ නොහැකි තත්ත්වයක සිටිති.”\n\n“මහණෙනි, හටගත් ලාභය දිනා දිනා වාසය කිරීම භික්ෂුවකට යහපති. හටගත් අලාභය, හටගත් යසස, හටගත් අයසස, හටගත් සත්කාරය, හටගත් අසත්කාරය, හටගත් පාපිච්ඡතාවය සහ හටගත් පාපමිත්‍රතාවයද දිනා දිනා වාසය කිරීම යහපති.”\n\n“මහණෙනි, භික්ෂුව කුමන අර්ථයක් නිසාද හටගත් ලාභය දිනා දිනා වාසය කළ යුත්තේ? එසේම හටගත් අලාභය, හටගත් යසස, හටගත් අයසස, හටගත් සත්කාරය, හටගත් අසත්කාරය, හටගත් පාපිච්ඡතාවය සහ හටගත් පාපමිත්‍රතාවයද දිනා දිනා වාසය කළ යුත්තේ කුමන අර්ථයක් නිසාද?”\n\n“මහණෙනි, හටගත් ලාභය දිනා දිනා නොසිටින්නාවූ ඔහුට ආශ්‍රව, විඝාත, පරිළාහයන් උපදී. එහෙත් හටගත් ලාභය දිනා දිනා වාසය කරන්නාට නම් එම ආශ්‍රව, විඝාත, පරිළාහයන් ඇති නොවෙති. එසේම, මහණෙනි, හටගත් අලාභය, යසස, අයසස, සත්කාරය, අසත්කාරය, පාපිච්ඡතාවය, පාපමිත්‍රතාවය දිනා දිනා නොසිටින්නාවූ ඔහුට ආශ්‍රව, විඝාත, පරිළාහයන් උපදී. එහෙත් හටගත් අලාභය, යසස, අයසස, සත්කාරය, අසත්කාරය, පාපිච්ඡතාවය සහ පාපමිත්‍රතාවය දිනා දිනා වාසය කරන්නාට නම් එම ආශ්‍රව, විඝාත, පරිළාහයන් ඇති නොවෙති. මහණෙනි, භික්ෂුව හටගත් ලාභය දිනා දිනා වාසය කළ යුත්තේ, එසේම හටගත් අලාභය, යසස, අයසස, සත්කාරය, අසත්කාරය, පාපිච්ඡතාවය සහ පාපමිත්‍රතාවයද දිනා දිනා වාසය කළ යුත්තේ සැබවින්ම මේ අර්ථය නිසාය.”\n\n“එබැවින් මහණෙනි, මෙසේ හික්මිය යුතුය: ‘අපි හටගත් ලාභය දිනා දිනා වාසය කරන්නෙමු. හටගත් අලාභය, යසස, අයසස, සත්කාරය, අසත්කාරය, පාපිච්ඡතාවය සහ පාපමිත්‍රතාවයද දිනා දිනා වාසය කරන්නෙමු’යි. මහණෙනි, සැබවින්ම ඔබ මෙසේ හික්මිය යුතුය.”",
      "paliTitle": "Devadattavipattisuttaṃ",
      "englishTitle": "Discourse on Devadatta's Ruin",
      "sinhalaTitle": "දේවදත්‍ත විපත්‍ති සූත්‍රය"
    },
    {
      "number": 8,
      "pali": "Ekaṃ samayaṃ āyasmā uttaro mahisavatthusmiṃ viharati saṅkheyyake pabbate vaṭajālikāyaṃ [dhavajālikāyaṃ (sī.), vaṭṭajālikāyaṃ (syā.)]. Tatra kho āyasmā uttaro bhikkhū āmantesi – ‘‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hotī’’ti. Tena kho pana samayena vessavaṇo mahārājā uttarāya disāya dakkhiṇaṃ disaṃ gacchati kenacideva karaṇīyena. Assosi kho vessavaṇo mahārājā āyasmato uttarassa mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ bhikkhūnaṃ evaṃ dhammaṃ desentassa – ‘‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hotī’’ti. Atha kho vessavaṇṇo mahārājā – seyyathāpi nāma balavā puriso samiñjitaṃ [sammiñjitaṃ (sī. syā. kaṃ. pī.)] vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya [sammiñjeyya (sī. syā. kaṃ. pī.)], evamevaṃ mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ antarahito devesu tāvatiṃsesu pāturahosi. Atha kho vessavaṇṇo mahārājā yena sakko devānamindo tenupasaṅkami; upasaṅkamitvā sakkaṃ devānamindaṃ etadavoca – ‘‘yagghe mārisa, jāneyyāsi! Eso āyasmā uttaro mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hotī’’’ti. Atha kho sakko devānamindo seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ devesu tāvatiṃsesu antarahito mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ āyasmato uttarassa sammukhe pāturahosi. Atha kho sakko devānamindo yenāyasmā uttaro tenupasaṅkami; upasaṅkamitvā āyasmantaṃ uttaraṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sakko devānamindo āyasmantaṃ uttaraṃ etadavoca – ‘‘Saccaṃ kira, bhante, āyasmā uttaro bhikkhūnaṃ evaṃ dhammaṃ desesi – ‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti, sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hotī’’’ ti? ‘‘Evaṃ, devānamindā’’ti. ‘‘Kiṃ panidaṃ [kiṃ pana (syā.)], bhante, āyasmato uttarassa sakaṃ paṭibhānaṃ [sakapaṭibhānaṃ upādāya (ka.)], udāhu tassa bhagavato vacanaṃ arahato sammāsambuddhassā’’ti? ‘‘Tena hi, devānaminda, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājāna’’nti. ‘‘Seyyathāpi, devānaminda, gāmassa vā nigamassa vā avidūre mahādhaññarāsi. Tato mahājanakāyo dhaññaṃ āhareyya – kājehipi piṭakehipi ucchaṅgehipi añjalīhipi. Yo nu kho, devānaminda, taṃ mahājanakāyaṃ upasaṅkamitvā evaṃ puccheyya – ‘kuto imaṃ dhaññaṃ āharathā’ti, kathaṃ byākaramāno nu kho, devānaminda, so mahājanakāyo sammā byākaramāno byākareyyā’’ti? ‘‘‘Amumhā mahādhaññarāsimhā āharāmā’ti kho, bhante, so mahājanakāyo sammā byākaramāno byākareyyā’’ti. ‘‘Evamevaṃ kho, devānaminda, yaṃ kiñci subhāsitaṃ sabbaṃ taṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa. Tato upādāyupādāya mayaṃ caññe ca bhaṇāmā’’ti. ‘‘Acchariyaṃ, bhante, abbhutaṃ bhante! Yāva subhāsitaṃ cidaṃ āyasmatā uttarena – ‘yaṃ kiñci subhāsitaṃ sabbaṃ taṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa. Tato upādāyupādāya mayaṃ caññe ca bhaṇāmā’ti. Ekamidaṃ, bhante uttara, samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra kho bhagavā devadattaṃ ārabbha bhikkhū āmantesi – ‘‘Sādhu, bhikkhave, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hoti. Aṭṭhahi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi aṭṭhahi? Lābhena hi, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho; alābhena, bhikkhave…pe… yasena, bhikkhave … ayasena, bhikkhave… sakkārena, bhikkhave… asakkārena, bhikkhave… pāpicchatāya, bhikkhave… pāpamittatāya, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Imehi kho, bhikkhave, aṭṭhahi asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. ‘‘Sādhu, bhikkhave, bhikkhu uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya; uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya. ‘‘Kiñca, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya; uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya? ‘‘Yaṃ hissa, bhikkhave, uppannaṃ lābhaṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ lābhaṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Yaṃ hissa, bhikkhave, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ pāpamittataṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya; uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ … uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – uppannaṃ lābhaṃ abhibhuyya abhibhuyya viharissāma, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya viharissāmāti. Evañhi vo, bhikkhave, sikkhitabba’’nti. ‘‘Ettāvatā, bhante uttara, manussesu catasso parisā – bhikkhū, bhikkhuniyo, upāsakā, upāsikāyo. Nāyaṃ dhammapariyāyo kismiñci upaṭṭhito [patiṭṭhito (sī. syā.)]. Uggaṇhatu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Pariyāpuṇātu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Dhāretu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Atthasaṃhito ayaṃ, bhante, dhammapariyāyo ādibrahmacariyako’’ti [ādibrahmacariyiko (sī. ka.)]. Aṭṭhamaṃ.",
      "english": "At one time, the venerable Uttara was staying at Vaṭajālikā on Saṅkheyya mountain in Mahisavatthu. There, the venerable Uttara addressed the monastics: \"Friends, it is good for a monastic to reflect on his own failures from time to time. Friends, it is good for a monastic to reflect on the failures of others from time to time. Friends, it is good for a monastic to reflect on his own achievements from time to time. Friends, it is good for a monastic to reflect on the achievements of others from time to time.\"\n\nNow at that time, King Vessavaṇa was traveling from the northern direction to the southern direction for some business. King Vessavaṇa heard the venerable Uttara teaching the Dhamma to the monastics at Vaṭajālikā on Saṅkheyya mountain in Mahisavatthu thus: \"Friends, it is good for a monastic to reflect on his own failures from time to time. Friends, it is good for a monastic to reflect on the failures of others from time to time. Friends, it is good for a monastic to reflect on his own achievements from time to time. Friends, it is good for a monastic to reflect on the achievements of others from time to time.\" Then King Vessavaṇa, just as a strong man might extend his flexed arm or flex his extended arm, vanished from Vaṭajālikā on Saṅkheyya mountain in Mahisavatthu and reappeared among the Tāvatiṃsa gods. Then King Vessavaṇa approached Sakka, ruler of the gods; having approached, he said to Sakka, ruler of the gods: \"Please, sir, be aware! The venerable Uttara is teaching the Dhamma to the monastics at Vaṭajālikā on Saṅkheyya mountain in Mahisavatthu thus: 'Friends, it is good for a monastic to reflect on his own failures from time to time. Friends, it is good for a monastic to reflect on the failures of others from time to time. Friends, it is good for a monastic to reflect on his own achievements from time to time. Friends, it is good for a monastic to reflect on the achievements of others from time to time.'\" Then Sakka, ruler of the gods, just as a strong man might extend his flexed arm or flex his extended arm, vanished from among the Tāvatiṃsa gods and reappeared in front of the venerable Uttara at Vaṭajālikā on Saṅkheyya mountain in Mahisavatthu. Then Sakka, ruler of the gods, approached the venerable Uttara; having approached, he paid homage to the venerable Uttara and stood to one side. Standing to one side, Sakka, ruler of the gods, said to the venerable Uttara: \"Is it true, venerable sir, that you, the venerable Uttara, taught the Dhamma to the monastics thus: 'Friends, it is good for a monastic to reflect on his own failures from time to time. Friends, it is good for a monastic to reflect on the failures of others from time to time. Friends, it is good for a monastic to reflect on his own achievements from time to time. Friends, it is good for a monastic to reflect on the achievements of others from time to time'?\" \"Yes, ruler of the gods,\" he replied. \"But venerable sir, is this your own spontaneous insight, or is it the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One?\" \"In that case, ruler of the gods, I shall give you an analogy. By means of an analogy, some discerning people understand the meaning of what has been said.\" \"Suppose, ruler of the gods, not far from a village or town, there was a great heap of grain. From that, a large crowd of people might carry away grain – with carrying-poles, in baskets, in their laps, and in their cupped hands. If someone were to approach that large crowd of people and ask them, 'From where are you carrying this grain?', how would that large crowd of people correctly answer?\" \"'Venerable sir, that large crowd of people would correctly answer, \"We are carrying it from that great heap of grain.\"'\" \"Even so, ruler of the gods, whatever is well-spoken, all of that is the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One. Taking from that source, we and others speak.\"\n\n\"Marvelous, venerable sir! Wonderful, venerable sir! How well said this is by the venerable Uttara: 'Whatever is well-spoken, all of that is the word of the Blessed One, the Arahant, the Perfectly Self-Awakened One. Taking from that source, we and others speak.'\" \"Venerable Uttara, on one occasion, the Blessed One was staying in Rājagaha, on Gijjhakūṭa mountain, not long after Devadatta had departed. There, the Blessed One, with reference to Devadatta, addressed the monastics: 'Monastics, it is good for a monastic to reflect on his own failures from time to time. Monastics, it is good for a monastic to reflect on the failures of others from time to time. Monastics, it is good for a monastic to reflect on his own achievements from time to time. Monastics, it is good for a monastic to reflect on the achievements of others from time to time. Monastics, Devadatta, overcome by eight unwholesome conditions, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery.' 'By which eight? Monastics, Devadatta, overcome by gain, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery. Monastics, overcome by loss, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery. Monastics, overcome by fame, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery. Monastics, overcome by disrepute, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery. Monastics, overcome by homage, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery. Monastics, overcome by lack of homage, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery. Monastics, overcome by evil desires, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery. Monastics, overcome by evil companionship, with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery.' 'Monastics, by these eight unwholesome conditions, Devadatta, overcome and with his mind consumed, is consigned to the lower realms, to hell, for an eon, beyond recovery.' 'Monastics, it is good for a monastic to live having repeatedly overcome arisen gain; having repeatedly overcome arisen loss; having repeatedly overcome arisen fame; having repeatedly overcome arisen disrepute; having repeatedly overcome arisen homage; having repeatedly overcome arisen lack of homage; having repeatedly overcome arisen evil desires; having repeatedly overcome arisen evil companionship.' 'And for what purpose, monastics, should a monastic live having repeatedly overcome arisen gain; having repeatedly overcome arisen loss; having repeatedly overcome arisen fame; having repeatedly overcome arisen disrepute; having repeatedly overcome arisen homage; having repeatedly overcome arisen lack of homage; having repeatedly overcome arisen evil desires; having repeatedly overcome arisen evil companionship?' 'For, monastics, if a monastic were to live without overcoming arisen gain, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen gain, then those defilements, vexation, and fever do not arise. For, monastics, if a monastic were to live without overcoming arisen loss, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen loss, then those defilements, vexation, and fever do not arise. For, monastics, if a monastic were to live without overcoming arisen fame, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen fame, then those defilements, vexation, and fever do not arise. For, monastics, if a monastic were to live without overcoming arisen disrepute, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen disrepute, then those defilements, vexation, and fever do not arise. For, monastics, if a monastic were to live without overcoming arisen homage, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen homage, then those defilements, vexation, and fever do not arise. For, monastics, if a monastic were to live without overcoming arisen lack of homage, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen lack of homage, then those defilements, vexation, and fever do not arise. For, monastics, if a monastic were to live without overcoming arisen evil desires, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen evil desires, then those defilements, vexation, and fever do not arise. For, monastics, if a monastic were to live without overcoming arisen evil companionship, defilements, vexation, and fever would arise. But if a monastic lives having overcome arisen evil companionship, then those defilements, vexation, and fever do not arise. This, monastics, is the purpose for which a monastic should live having repeatedly overcome arisen gain; having repeatedly overcome arisen loss; having repeatedly overcome arisen fame; having repeatedly overcome arisen disrepute; having repeatedly overcome arisen homage; having repeatedly overcome arisen lack of homage; having repeatedly overcome arisen evil desires; having repeatedly overcome arisen evil companionship.' 'Therefore, monastics, you should train yourselves thus: \"We will live having repeatedly overcome arisen gain; we will live having repeatedly overcome arisen loss; we will live having repeatedly overcome arisen fame; we will live having repeatedly overcome arisen disrepute; we will live having repeatedly overcome arisen homage; we will live having repeatedly overcome arisen lack of homage; we will live having repeatedly overcome arisen evil desires; we will live having repeatedly overcome arisen evil companionship.\" This is how you should train yourselves, monastics.\" \"Venerable Uttara, there are four assemblies of humans: monastics, nuns, male lay followers, and female lay followers. This discourse on the Dhamma is not yet established among any of them. Venerable Uttara, please learn this discourse on the Dhamma. Venerable Uttara, please master this discourse on the Dhamma. Venerable Uttara, please remember this discourse on the Dhamma. Venerable sir, this discourse on the Dhamma is beneficial and fundamental to the holy life.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ මහීසවත්ථු නම් නගරයේ සංඛෙය්‍යක නම් පර්වතයේ වටජාලිකාවෙහි වැඩවසන සේක. එහිදී ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: “පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම දියුණුව පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ දියුණුව පිරික්සිය යුතුයි.”\n\nඑසමයෙහි වෛශ්‍රවණ මහා රාජයා කිසියම් කාරණයක් නිසා උතුරු දිශාවේ සිට දකුණු දිශාවට ගමන් කරමින් සිටියේය. එවිට වෛශ්‍රවණ මහා රාජයාට, ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ මහීසවත්ථු නගරයේ සංඛෙය්‍යක පර්වතයේ වටජාලිකාවෙහි භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරන ශබ්දය ඇසිණි: “පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම දියුණුව පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ දියුණුව පිරික්සිය යුතුයි.”\n\nඉක්බිති වෛශ්‍රවණ මහා රාජයා, යම්සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුව දික් කරන්නේද, දික් කළ බාහුව හකුළුවන්නේද, එපරිද්දෙන්ම මහීසවත්ථු නගරයේ සංඛෙය්‍යක පර්වතයේ වටජාලිකාවෙන් අතුරුදහන් වී තව්තිසා දෙවියන් අතර පහළ විය. ඉක්බිති වෛශ්‍රවණ මහා රාජයා ශක්‍ර දේවේන්ද්‍රයා වෙත එළඹියේය; එළඹ ශක්‍ර දේවේන්ද්‍රයාට මෙසේ කීවේය: “පින්වත්නි, ඔබ මේ කාරණය දැනගන්න! මේ ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ මහීසවත්ථු නගරයේ සංඛෙය්‍යක පර්වතයේ වටජාලිකාවෙහි භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරති: ‘පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම දියුණුව පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ දියුණුව පිරික්සිය යුතුයි.’”\n\nඉක්බිති ශක්‍ර දේවේන්ද්‍රයා, යම්සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුව දික් කරන්නේද, දික් කළ බාහුව හකුළුවන්නේද, එපරිද්දෙන්ම තව්තිසා දෙවියන් අතරින් අතුරුදහන් වී මහීසවත්ථු නගරයේ සංඛෙය්‍යක පර්වතයේ වටජාලිකාවෙහි ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ ඉදිරියේ පහළ විය. ඉක්බිති ශක්‍ර දේවේන්ද්‍රයා ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ වෙත එළඹියේය; එළඹ ආයුෂ්මත් උත්තර තෙරුන් වහන්සේට වන්දනා කොට එකත්පස්ව සිටියේය. එකත්පස්ව සිටි ශක්‍ර දේවේන්ද්‍රයා ආයුෂ්මත් උත්තර තෙරුන් වහන්සේට මෙසේ කීවේය: “සැබැවින්ම, ස්වාමීනි, ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා කළ සේක්ද: ‘පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ වැරදි පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට තම දියුණුව පිරික්සිය යුතුයි. පින්වත් මහණෙනි, භික්ෂුව කලින් කලට අනුන්ගේ දියුණුව පිරික්සිය යුතුයි’ කියා?”\n\n“එසේය, දේවේන්ද්‍රයෙනි.” “ස්වාමීනි, මේ ආයුෂ්මත් උත්තර තෙරුන් වහන්සේගේ තමන්ගේම ප්‍රතිභානයක්ද, නැතහොත් ඒ අරහත් සම්මා සම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයක්ද?” “එසේ නම්, දේවේන්ද්‍රයෙනි, ඔබට උපමාවක් දක්වන්නෙමි. උපමාවෙන් සමහර නුවණැති පුරුෂයෝ කියන ලද අර්ථය තේරුම් ගනිති.”\n\n“දේවේන්ද්‍රයෙනි, යම්සේ ගමකට හෝ නියම්ගමකට හෝ නුදුරින් විශාල ධාන්‍ය රාශියක් ඇත්ද. එතැනින් බොහෝ ජනයා කරපටිවලින්ද, කූඩවලින්ද, ඇඳුම් පොටවල්වලින්ද, අත් ඉහඳින්ද ධාන්‍ය ගෙනෙත්. යමෙක්, දේවේන්ද්‍රයෙනි, ඒ බොහෝ ජනයා වෙත එළඹ මෙසේ අසන්නේ නම් – ‘ඔබ මේ ධාන්‍ය ගෙනෙන්නේ කොහෙන්දැ’යි, දේවේන්ද්‍රයෙනි, ඒ බොහෝ ජනයා නිවැරදිව පිළිතුරු දෙන්නේ නම් කෙසේ පිළිතුරු දෙන්නේද?” “‘අර විශාල ධාන්‍ය රාශියෙන් ගෙනෙමු’ කියාය, ස්වාමීනි, ඒ බොහෝ ජනයා නිවැරදිව පිළිතුරු දෙනු ඇත.”\n\n“එපරිද්දෙන්ම, දේවේන්ද්‍රයෙනි, යම් කිසි සුභාෂිතයක් ඇත්ද ඒ සියල්ල ඒ අරහත් සම්මා සම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයයි. එයින් උපුටාගෙන උපුටාගෙන අපිද අන්‍යයෝද දේශනා කරන්නෙමු.” “ආශ්චර්‍යයයි, ස්වාමීනි! අද්භූතයි, ස්වාමීනි! ‘යම් කිසි සුභාෂිතයක් ඇත්ද ඒ සියල්ල ඒ අරහත් සම්මා සම්බුදු භාග්‍යවතුන් වහන්සේගේ වචනයයි. එයින් උපුටාගෙන උපුටාගෙන අපිද අන්‍යයෝද දේශනා කරන්නෙමු’ කියා ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ විසින් කෙතරම් මැනවින් මෙය දේශනා කරන ලද්දක්ද!”\n\n“ස්වාමීනි උත්තර, එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ඣකූට පර්වතයේ වැඩවසන සේක, දේවදත්ත මෑතදී අපවත්ව ගිය කාලයෙහි. එහිදී භාග්‍යවතුන් වහන්සේ දේවදත්ත මුල්කරගෙන භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, යහපත් වන්නේ භික්ෂුව කලින් කලට තම වැරදි පිරික්සන්නේ නම්ය. මහණෙනි, යහපත් වන්නේ භික්ෂුව කලින් කලට අනුන්ගේ වැරදි පිරික්සන්නේ නම්ය. මහණෙනි, යහපත් වන්නේ භික්ෂුව කලින් කලට තම දියුණුව පිරික්සන්නේ නම්ය. මහණෙනි, යහපත් වන්නේ භික්ෂුව කලින් කලට අනුන්ගේ දියුණුව පිරික්සන්නේ නම්ය. මහණෙනි, අසද්ධර්ම අටකින් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත. ඒ අට කුමක්ද?”\n\n“මහණෙනි, ලාභයෙන් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත; මහණෙනි, අලාභයෙන් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත; මහණෙනි, යසසින් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත; මහණෙනි, අයසසින් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත; මහණෙනි, සත්කාරයෙන් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත; මහණෙනි, අසත්කාරයෙන් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත; මහණෙනි, පාපී අභිලාෂයෙන් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත; මහණෙනි, පාප මිත්‍ර සේවනයෙන් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත. මහණෙනි, මේ අසද්ධර්ම අටින් යටපත් වී, සිත් වසඟ වී දේවදත්ත අපායගාමී වී, නිරයට වැටී, කල්පයක් පුරා සිටින්නට සිදුවී, ප්‍රතිකාර කළ නොහැකි තත්වයට පත් වී ඇත.”\n\n“මහණෙනි, යහපත් වන්නේ භික්ෂුව පහළ වන ලාභය යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය; පහළ වන අලාභය යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය; පහළ වන යසස යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය; පහළ වන අයසස යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය; පහළ වන සත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය; පහළ වන අසත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය; පහළ වන පාපී අභිලාෂය යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය; පහළ වන පාප මිත්‍ර සේවනය යටපත් කොට යටපත් කොට වාසය කරන්නේ නම්ය.”\n\n“මහණෙනි, කුමන අර්ථයක් අරභයා භික්ෂුව පහළ වන ලාභය යටපත් කොට යටපත් කොට වාසය කරන්නේද; පහළ වන අලාභය යටපත් කොට යටපත් කොට වාසය කරන්නේද; පහළ වන යසස යටපත් කොට යටපත් කොට වාසය කරන්නේද; පහළ වන අයසස යටපත් කොට යටපත් කොට වාසය කරන්නේද; පහළ වන සත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නේද; පහළ වන අසත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නේද; පහළ වන පාපී අභිලාෂය යටපත් කොට යටපත් කොට වාසය කරන්නේද; පහළ වන පාප මිත්‍ර සේවනය යටපත් කොට යටපත් කොට වාසය කරන්නේද?”\n\n“මහණෙනි, යම් කෙනෙකුට පහළ වන ලාභය යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන ලාභය යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, යම් කෙනෙකුට පහළ වන අලාභය යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන අලාභය යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, යම් කෙනෙකුට පහළ වන යසස යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන යසස යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, යම් කෙනෙකුට පහළ වන අයසස යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන අයසස යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, යම් කෙනෙකුට පහළ වන සත්කාරය යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන සත්කාරය යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, යම් කෙනෙකුට පහළ වන අසත්කාරය යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන අසත්කාරය යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, යම් කෙනෙකුට පහළ වන පාපී අභිලාෂය යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන පාපී අභිලාෂය යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, යම් කෙනෙකුට පහළ වන පාප මිත්‍ර සේවනය යටපත් නොකොට වාසය කරන්නාට ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද උපදිත්ද, පහළ වන පාප මිත්‍ර සේවනය යටපත් කොට වාසය කරන්නාට ඒ ආශ්‍රවයෝද, විඝාතයෝද, පරිළාහයෝද ඇති නොවේ. මහණෙනි, මේ අර්ථය අරභයාය භික්ෂුව පහළ වන ලාභය යටපත් කොට යටපත් කොට වාසය කරන්නේ; පහළ වන අලාභය යටපත් කොට යටපත් කොට වාසය කරන්නේ; පහළ වන යසස යටපත් කොට යටපත් කොට වාසය කරන්නේ; පහළ වන අයසස යටපත් කොට යටපත් කොට වාසය කරන්නේ; පහළ වන සත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නේ; පහළ වන අසත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නේ; පහළ වන පාපී අභිලාෂය යටපත් කොට යටපත් කොට වාසය කරන්නේ; පහළ වන පාප මිත්‍ර සේවනය යටපත් කොට යටපත් කොට වාසය කරන්නේ.”\n\n“මහණෙනි, එහෙයින් මෙසේ හික්මිය යුතුය – ‘පහළ වන ලාභය යටපත් කොට යටපත් කොට වාසය කරන්නෙමු. පහළ වන අලාභය යටපත් කොට යටපත් කොට වාසය කරන්නෙමු. පහළ වන යසස යටපත් කොට යටපත් කොට වාසය කරන්නෙමු. පහළ වන අයසස යටපත් කොට යටපත් කොට වාසය කරන්නෙමු. පහළ වන සත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නෙමු. පහළ වන අසත්කාරය යටපත් කොට යටපත් කොට වාසය කරන්නෙමු. පහළ වන පාපී අභිලාෂය යටපත් කොට යටපත් කොට වාසය කරන්නෙමු. පහළ වන පාප මිත්‍ර සේවනය යටපත් කොට යටපත් කොට වාසය කරන්නෙමු’ කියා. මහණෙනි, ඔබ මෙසේම හික්මිය යුතුය.”\n\n“ස්වාමීනි උත්තර, මේ දක්වා මිනිසුන් අතර සතර පිරිසක් සිටිති – භික්ෂූන්, භික්ෂුණීන්, උපාසකයන්, උපාසිකාවන්. මේ ධර්ම පර්යාය කිසිවෙකුට පහළ වී නොමැත. ස්වාමීනි, ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ මේ ධර්ම පර්යාය ඉගෙන ගනිත්වා. ස්වාමීනි, ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ මේ ධර්ම පර්යාය හොඳින් පුරුදු කෙරේවා. ස්වාමීනි, ආයුෂ්මත් උත්තර තෙරුන් වහන්සේ මේ ධර්ම පර්යාය ධාරණය කෙරේවා. ස්වාමීනි, මේ ධර්ම පර්යාය අර්ථයෙන් යුක්තය, මුල් බඹසරට අයත්ය.” අටවෙනි සූත්‍රයයි.",
      "paliTitle": "Uttaravipattisuttaṃ",
      "englishTitle": "Discourse on Further Adversity",
      "sinhalaTitle": "උත්තර විපත්ති සූත්‍රය"
    },
    {
      "number": 9,
      "pali": "‘‘‘Kulaputto’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Balavā’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Pāsādiko’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Tibbarāgo’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. Kimaññatra, bhikkhave, nando indriyesu guttadvāro, bhojane mattaññū, jāgariyaṃ anuyutto, satisampajaññena samannāgato, yehi [yena (ka.)] nando sakkoti paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carituṃ! Tatridaṃ, bhikkhave, nandassa indriyesu guttadvāratāya hoti. Sace, bhikkhave, nandassa puratthimā disā āloketabbā hoti, sabbaṃ cetasā samannāharitvā nando puratthimaṃ disaṃ āloketi – ‘evaṃ me puratthimaṃ disaṃ ālokayato nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti. ‘‘Sace, bhikkhave, nandassa pacchimā disā āloketabbā hoti…pe… uttarā disā āloketabbā hoti… dakkhiṇā disā āloketabbā hoti… uddhaṃ ulloketabbā hoti… adho oloketabbā hoti… anudisā anuviloketabbā hoti, sabbaṃ cetasā samannāharitvā nando anudisaṃ anuviloketi – ‘evaṃ me anudisaṃ anuvilokayato nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti. Idaṃ kho, bhikkhave, nandassa indriyesu guttadvāratāya hoti. ‘‘Tatridaṃ, bhikkhave, nandassa bhojane mattaññutāya hoti. Idha, bhikkhave, nando paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. Idaṃ kho, bhikkhave, nandassa bhojane mattaññutāya hoti. ‘‘Tatridaṃ, bhikkhave, nandassa jāgariyānuyogasmiṃ hoti. Idha, bhikkhave, nando divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti; rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti; rattiyā majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeti pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā; rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti. Idaṃ kho, bhikkhave, nandassa jāgariyānuyogasmiṃ hoti. ‘‘Tatridaṃ, bhikkhave, nandassa satisampajaññasmiṃ hoti. Idha, bhikkhave, nandassa viditā vedanā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti; viditā saññā…pe… viditā vitakkā… pe… abbhatthaṃ gacchanti. Idaṃ kho, bhikkhave, nandassa satisampajaññasmiṃ hoti. ‘‘Kimaññatra, bhikkhave, nando indriyesu guttadvāro, bhojane mattaññū, jāgariyaṃ anuyutto, satisampajaññena samannāgato, yehi nando sakkoti paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ caritu’’nti! Navamaṃ.",
      "english": "“Monks, one might rightly say of Nanda: ‘He is a man of good family.’ Monks, one might rightly say of Nanda: ‘He is strong.’ Monks, one might rightly say of Nanda: ‘He is charming.’ Monks, one might rightly say of Nanda: ‘He is strongly passionate.’ But how, monks, could Nanda be anything other than one who guards the sense doors, is moderate in eating, devoted to wakefulness, and endowed with mindfulness and clear comprehension, by which Nanda is able to live the complete and utterly purified holy life!\n\n“Now, monks, this is how Nanda guards the sense doors. If, monks, Nanda has to look towards the eastern direction, he looks towards the eastern direction, fully attending to it with his mind, thinking: ‘As I look towards the eastern direction in this way, covetousness and displeasure, evil unwholesome states, will not flow into me.’ Thus, he is clearly comprehending there. If, monks, Nanda has to look towards the western direction, he looks towards the western direction, fully attending to it with his mind, thinking: ‘As I look towards the western direction in this way, covetousness and displeasure, evil unwholesome states, will not flow into me.’ Thus, he is clearly comprehending there. If, monks, Nanda has to look towards the northern direction, he looks towards the northern direction, fully attending to it with his mind, thinking: ‘As I look towards the northern direction in this way, covetousness and displeasure, evil unwholesome states, will not flow into me.’ Thus, he is clearly comprehending there. If, monks, Nanda has to look towards the southern direction, he looks towards the southern direction, fully attending to it with his mind, thinking: ‘As I look towards the southern direction in this way, covetousness and displeasure, evil unwholesome states, will not flow into me.’ Thus, he is clearly comprehending there. If, monks, Nanda has to look upwards, he looks upwards, fully attending to it with his mind, thinking: ‘As I look upwards in this way, covetousness and displeasure, evil unwholesome states, will not flow into me.’ Thus, he is clearly comprehending there. If, monks, Nanda has to look downwards, he looks downwards, fully attending to it with his mind, thinking: ‘As I look downwards in this way, covetousness and displeasure, evil unwholesome states, will not flow into me.’ Thus, he is clearly comprehending there. If, monks, Nanda has to look in the intermediate directions, he looks in the intermediate directions, fully attending to it with his mind, thinking: ‘As I look in the intermediate directions in this way, covetousness and displeasure, evil unwholesome states, will not flow into me.’ Thus, he is clearly comprehending there. This, monks, is how Nanda guards the sense doors.\n\n“Now, monks, this is how Nanda is moderate in eating. Here, monks, Nanda partakes food wisely, reflecting thus: ‘Not for sport, not for intoxication, not for embellishment, not for adornment, but only for the upkeep and sustenance of this body, for ending harm, for aiding the holy life—thus I will allay old feelings and not give rise to new ones; and there will be for me maintenance, blamelessness, and a comfortable abiding.’ This, monks, is how Nanda is moderate in eating.\n\n“Now, monks, this is how Nanda is devoted to wakefulness. Here, monks, during the day, by walking and sitting, Nanda purifies his mind of obstructive states. During the first watch of the night, by walking and sitting, he purifies his mind of obstructive states. During the middle watch of the night, he lies down in the lion’s posture on his right side, placing one foot on the other, mindful and clearly comprehending, having kept the perception of arising in mind. During the last watch of the night, having arisen, by walking and sitting, he purifies his mind of obstructive states. This, monks, is how Nanda is devoted to wakefulness.\n\n“Now, monks, this is how Nanda is endowed with mindfulness and clear comprehension. Here, monks, feelings arise for Nanda known, they persist known, they disappear known. Perceptions arise for Nanda known, they persist known, they disappear known. Thoughts arise for Nanda known, they persist known, they disappear known. This, monks, is how Nanda is endowed with mindfulness and clear comprehension.\n\n“How, monks, could Nanda be anything other than one who guards the sense doors, is moderate in eating, devoted to wakefulness, and endowed with mindfulness and clear comprehension, by which Nanda is able to live the complete and utterly purified holy life!”",
      "sinhala": "මහණෙනි, නන්දට නිවැරදිව කියන්නේ නම්, 'කුලපුත්‍රයෙක්' කියා කියයි. මහණෙනි, නන්දට නිවැරදිව කියන්නේ නම්, 'බලවන්තයෙක්' කියා කියයි. මහණෙනි, නන්දට නිවැරදිව කියන්නේ නම්, 'ප්‍රසන්න වූවෙක්' කියා කියයි. මහණෙනි, නන්දට නිවැරදිව කියන්නේ නම්, 'තීව්‍ර රාග ඇත්තෙක්' කියා කියයි. මහණෙනි, නන්දට ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර භාවයද, භෝජනයෙහි පමණ දැනීමද, ජාගරියානුයෝගයෙහි යෙදීමද, සිහි නුවණින් යුක්ත භාවයද අන් කුමක්ද? මේවා හේතුකොටගෙන නන්දට පරිපූර්ණ වූ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කළ හැකිය!\n\nමහණෙනි, නන්දගේ ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර භාවය මෙසේය. මහණෙනි, නන්දට පෙරදිග බැලිය යුතු නම්, සියල්ල සිතින් මෙනෙහි කර, 'මෙසේ මා පෙරදිග බලන විට අභිධ්‍යා-දෝමනස්සය සහිත පව් අකුසල් දහම් මට ඇතුල් නොවෙත්වා' යනුවෙන් සිතා පෙරදිග බලයි. මෙසේ ඔහු එහි සිහි නුවණින් යුක්ත වේ. මහණෙනි, නන්දට බස්නාහිර දිශාව බැලිය යුතු නම්... උතුරු දිශාව බැලිය යුතු නම්... දකුණු දිශාව බැලිය යුතු නම්... උඩ බැලිය යුතු නම්... යට බැලිය යුතු නම්... අනුදිශා (අතරමැදි දිශා) බැලිය යුතු නම්, සියල්ල සිතින් මෙනෙහි කර, 'මෙසේ මා අනුදිශා බලන විට අභිධ්‍යා-දෝමනස්සය සහිත පව් අකුසල් දහම් මට ඇතුල් නොවෙත්වා' යනුවෙන් සිතා අනුදිශා බලයි. මෙසේ ඔහු එහි සිහි නුවණින් යුක්ත වේ. මහණෙනි, මෙය නන්දගේ ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර භාවයයි.\n\nමහණෙනි, නන්දගේ භෝජනයෙහි පමණ දැනීම මෙසේය. මහණෙනි, මෙහිලා නන්ද මනා ලෙස නුවණින් විමසා ආහාර ගනියි – 'ක්‍රීඩා පිණිස නොවේ, මත්වීම පිණිස නොවේ, අලංකාරය පිණිස නොවේ, සැරසීම පිණිස නොවේ, මේ ශරීරයෙහි පැවැත්ම පිණිසත්, යාපනය පිණිසත්, හිංසා නැවැත්වීම පිණිසත්, බ්‍රහ්මචාරී ජීවිතයට අනුග්‍රහය පිණිසත් පමණකි. මෙසේ මම පැරණි වේදනාව (බඩගින්න) දුරු කරමි, අලුත් වේදනාවක් (අජීර්ණය ආදිය) ඇති නොකරමි. මගේ ජීවනයද සිදුවන්නේය, වැරදක්ද නැත්තේය, සැප විහරණයද වන්නේය' යනුවෙනි. මහණෙනි, මෙය නන්දගේ භෝජනයෙහි පමණ දැනීමයි.\n\nමහණෙනි, නන්දගේ ජාගරියානුයෝගය (නොනිදා සිටීමේ පිළිවෙත) මෙසේය. මහණෙනි, මෙහිලා නන්ද දවල් කාලයෙහි සක්මන් කිරීමෙන්ද, හුන් ඉරියව්වෙන්ද, ආවරණීය (බාධා කරන) ධර්මයන්ගෙන් සිත පිරිසිදු කරයි. රාත්‍රියෙහි පළමු යාමයෙහිද සක්මන් කිරීමෙන්ද, හුන් ඉරියව්වෙන්ද, ආවරණීය ධර්මයන්ගෙන් සිත පිරිසිදු කරයි. රාත්‍රියෙහි මැද යාමයෙහි නම්, සිහි නුවණින් යුක්තව, පා පිට පා තබා, නැගිටීමේ සිහිය සිතෙහි පිහිටුවාගෙන, දකුණු පසින් සිංහ සෙය්‍යාවෙන් සැතපෙයි. රාත්‍රියෙහි අවසාන යාමයෙහි නැවත නැගිට, සක්මන් කිරීමෙන්ද, හුන් ඉරියව්වෙන්ද, ආවරණීය ධර්මයන්ගෙන් සිත පිරිසිදු කරයි. මහණෙනි, මෙය නන්දගේ ජාගරියානුයෝගයයි.\n\nමහණෙනි, නන්දගේ සිහි නුවණ මෙසේය. මහණෙනි, මෙහිලා නන්දට වේදනා උපදින්නේද දැනගෙනය, පවතින්නේද දැනගෙනය, නැතිව යන්නේද දැනගෙනය. සංඥා උපදින්නේද දැනගෙනය, පවතින්නේද දැනගෙනය, නැතිව යන්නේද දැනගෙනය. විතර්ක උපදින්නේද දැනගෙනය, පවතින්නේද දැනගෙනය, නැතිව යන්නේද දැනගෙනය. මහණෙනි, මෙය නන්දගේ සිහි නුවණයි.\n\nමහණෙනි, නන්දට ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර භාවයද, භෝජනයෙහි පමණ දැනීමද, ජාගරියානුයෝගයෙහි යෙදීමද, සිහි නුවණින් යුක්ත භාවයද අන් කුමක්ද? මේවා හේතුකොටගෙන නන්දට පරිපූර්ණ වූ පිරිසිදු බ්‍රහ්මචාරී ජීවිතයක් ගත කළ හැකිය!",
      "paliTitle": "Nandasuttaṃ",
      "englishTitle": "Nanda Sutta",
      "sinhalaTitle": "නන්ද සූත‍්‍රය"
    },
    {
      "number": 10,
      "pali": "Ekaṃ samayaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Tena kho pana samayena bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno aññenāññaṃ paṭicarati, bahiddhā kathaṃ apanāmeti, kopañca dosañca appaccayañca pātukaroti. Atha kho bhagavā bhikkhū āmantesi – ‘‘niddhamathetaṃ, bhikkhave, puggalaṃ; niddhamathetaṃ, bhikkhave, puggalaṃ. Apaneyyeso [apaneyyo so (sī.), apaneyyo (syā.)], bhikkhave, puggalo. Kiṃ vo tena paraputtena visodhitena [kiṃ voparaputto viheṭhiyati (sī.), kiṃ paraputto viheṭheti (syā.), kiṃ vo paraputtā viheṭheti (pī.), kiṃ so paraputto visodheti (ka.)]! Idha, bhikkhave, ekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ [samaṇarūpī (ka.)] samaṇapalāpo samaṇakāraṇḍavo’ti [samaṇakaraṇḍavoti (ka.)]. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesī’’ti! ‘‘Seyyathāpi, bhikkhave, sampanne yavakaraṇe yavadūsī [yavarūpī (ka.)] jāyetha yavapalāpo yavakāraṇḍavoti. Tassa tādisaṃyeva mūlaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ; tādisaṃyeva nāḷaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ; tādisaṃyeva pattaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ – yāvassa sīsaṃ na nibbattati. Yato ca khvassa sīsaṃ nibbattati, tamenaṃ evaṃ jānanti – ‘yavadūsīvāyaṃ yavapalāpo yavakāraṇḍavo’ti. Tamenaṃ iti viditvā samūlaṃ uppāṭetvā bahiddhā yavakaraṇassa chaḍḍenti. Taṃ kissa hetu? Mā aññe bhaddake yave dūsesīti! ‘‘Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesīti. ‘‘Seyyathāpi, bhikkhave, mahato dhaññarāsissa phuṇamānassa [vuyhamānassa (sī. pī.), phusayamānassa (syā.), punamānassa (?)] tattha yāni tāni dhaññāni daḷhāni sāravantāni tāni ekamantaṃ puñjaṃ hoti, yāni pana tāni dhaññāni dubbalāni palāpāni tāni vāto ekamantaṃ apavahati [apakassati (sī.)]. Tamenaṃ sāmikā sammajjaniṃ gahetvā bhiyyosomattāya apasammajjanti. Taṃ kissa hetu? Mā aññe bhaddake dhaññe dūsesīti! Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesīti. ‘‘Seyyathāpi, bhikkhave, puriso udapānapanāḷiyatthiko tiṇhaṃ kuṭhāriṃ [kudhāriṃ (syā. kaṃ. ka.)] ādāya vanaṃ paviseyya. So yaṃ yadeva rukkhaṃ kuṭhāripāsena ākoṭeyya tattha yāni tāni rukkhāni daḷhāni sāravantāni tāni kuṭhāripāsena ākoṭitāni kakkhaḷaṃ paṭinadanti; yāni pana tāni rukkhāni antopūtīni avassutāni kasambujātāni tāni kuṭhāripāsena ākoṭitāni daddaraṃ paṭinadanti. Tamenaṃ mūle chindati, mūle chinditvā agge chindati, agge chinditvā anto suvisodhitaṃ visodheti, anto suvisodhitaṃ visodhetvā udapānapanāḷiṃ yojeti. Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesī’’ti. ‘‘Saṃvāsāyaṃ vijānātha, pāpiccho kodhano iti; Makkhī thambhī paḷāsī ca, issukī maccharī saṭho. ‘‘Santavāco janavati, samaṇo viya bhāsati; Raho karoti karaṇaṃ, pāpadiṭṭhi anādaro. ‘‘Saṃsappī ca musāvādī, taṃ viditvā yathātathaṃ; Sabbe samaggā hutvāna, abhinibbajjayātha [abhinibbijjayetha (ka.)] naṃ. ‘‘Kāraṇḍavaṃ [karaṇḍavaṃ (ka.) su. ni. 283 passitabbaṃ] niddhamatha, kasambuṃ apakassatha [avakassatha (ka.)]; Tato palāpe vāhetha, assamaṇe samaṇamānine. ‘‘Niddhamitvāna pāpicche, pāpaācāragocare; Suddhāsuddhehi saṃvāsaṃ, kappayavho patissatā; Tato samaggā nipakā, dukkhassantaṃ karissathā’’ti. dasamaṃ; ",
      "english": "At one time the Bhagavā was staying in Campā, on the bank of the Gaggara pond. Now at that time, monks were admonishing a certain monk for an offense. That monk, being admonished by the monks for an offense, would resort to evasion, deflect the conversation outwards, and display anger, ill-will, and resentment.\n\nThen the Bhagavā addressed the monks: “Expel this person, monks! Expel this person, monks! This person, monks, should be removed. Why should you be troubled by such an outsider!\n\nHere, monks, the deportment—the going forth and back, the looking ahead and around, the bending and stretching, and the wearing of the outer robe, bowl, and inner robe—of some individual is just like that of other good monks, as long as the monks do not see his offense. But when the monks see his offense, they recognize him thus: ‘This is a defiler of monastics, a mere husk of a monk, a rotten core of a monk.’ Having recognized him thus, they cast him out. For what reason? So that he may not defile other good monks!\n\nJust as, monks, in a field of ripe barley, there might grow a defiler of barley, a mere husk of barley, a rotten core of barley. Its roots would be just like those of other good barley; its stalk would be just like those of other good barley; its leaves would be just like those of other good barley—as long as its head has not yet emerged. But when its head emerges, they recognize it thus: ‘This is a defiler of barley, a mere husk of barley, a rotten core of barley.’ Having recognized it thus, they pull it out by the roots and cast it outside the barley field. For what reason? So that it may not defile other good barley!\n\nIn the same way, monks, the deportment—the going forth and back, the looking ahead and around, the bending and stretching, and the wearing of the outer robe, bowl, and inner robe—of some individual here is just like that of other good monks, as long as the monks do not see his offense. But when the monks see his offense, they recognize him thus: ‘This is a defiler of monastics, a mere husk of a monk, a rotten core of a monk.’ Having recognized him thus, they cast him out. For what reason? So that he may not defile other good monks!\n\nJust as, monks, when a great heap of grain is being winnowed, the firm, substantial grains accumulate in one pile, while the weak, mere husks are blown away by the wind into another pile. Then the owners take a broom and sweep them even further away. For what reason? So that they may not defile other good grains!\n\nIn the same way, monks, the deportment—the going forth and back, the looking ahead and around, the bending and stretching, and the wearing of the outer robe, bowl, and inner robe—of some individual here is just like that of other good monks, as long as the monks do not see his offense. But when the monks see his offense, they recognize him thus: ‘This is a defiler of monastics, a mere husk of a monk, a rotten core of a monk.’ Having recognized him thus, they cast him out. For what reason? So that he may not defile other good monks!\n\nJust as, monks, a man, seeking a water-pipe, might take a sharp axe and enter a forest. Whatever tree he strikes with the axe-blade, those trees that are strong and solid resonate with a firm sound when struck by the axe-blade; but those trees that are rotten inside, oozing, and full of sap-rot resonate with a hollow sound when struck by the axe-blade. He cuts it at the base; having cut it at the base, he cuts off the top; having cut off the top, he thoroughly cleans out the inside; having thoroughly cleaned out the inside, he fits it as a water-pipe.\n\nIn the same way, monks, the deportment—the going forth and back, the looking ahead and around, the bending and stretching, and the wearing of the outer robe, bowl, and inner robe—of some individual here is just like that of other good monks, as long as the monks do not see his offense. But when the monks see his offense, they recognize him thus: ‘This is a defiler of monastics, a mere husk of a monk, a rotten core of a monk.’ Having recognized him thus, they cast him out. For what reason? So that he may not defile other good monks!\n\n“Recognize for companionship one who is ill-willed and angry; envious, stubborn, spiteful; jealous, avaricious, and deceitful. He speaks gently to people, speaks like a monastic; but secretly he acts wickedly, holding wrong views and disrespecting others. He is insidious and a liar. Having truly recognized such a one, all of you should unite and expel him.\n\nExpel the rotten core, cast away the sap-rot; then drive out the husks—those who pretend to be monastics but are not. Having expelled the ill-willed, those with bad conduct and resorts, dwell then, mindful, among the pure and those of mixed purity. Then, united and prudent, you will make an end to suffering.”",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ චම්පා නුවර ගග්ගරා නම් පොකුණේ වෙරළෙහි වැඩවසන සේක. එකල භික්ෂූන් වහන්සේලා එක්තරා භික්ෂුවකට වරදක් සම්බන්ධයෙන් චෝදනා කරමින් සිටියහ. ඒ භික්ෂුව, භික්ෂූන් වහන්සේලා විසින් වරදක් සම්බන්ධයෙන් චෝදනා කරනු ලැබූ කල්හි, වෙනත් දේවලින් ප්‍රතිචාර දැක්වීය, කතාව වෙනතකට යොමු කළේය, කෝපයද, ද්වේෂයද, අසතුටද ප්‍රකට කළේය. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලා අමතා වදාළ සේක: \"මහණෙනි, මේ පුද්ගලයා නෙරපන්න; මහණෙනි, මේ පුද්ගලයා නෙරපන්න. මහණෙනි, මේ පුද්ගලයා ඉවත් කළ යුතුයි. ඔබට ඒ පරපුත්‍රයා [අන්‍ය වූ පුත්‍රයා] ශුද්ධ කරන්නේ කුමකටද!\"\n\nමහණෙනි, මෙහි ඇතැම් පුද්ගලයෙකුගේ යාම් ඊම්, ඉදිරිය බැලීම්, වටපිට බැලීම්, හකුලුවාගැනීම්, දිගහැරීම්, සංඝාටිය, පාත්‍රය, සිවුරු දැරීම් අනෙකුත් යහපත් භික්ෂූන් වහන්සේලාගේ මෙන් ම වෙයි. යම්තාක් කල් භික්ෂූන් වහන්සේලා ඔහුගේ වරදක් නොදකිතිද, එතෙක් කල්ය. යම් කලක භික්ෂූන් වහන්සේලා ඔහුගේ වරද දකිත්ද, එකල්හි ඔහු 'මේ ශ්‍රමණයා දුෂිතයෙක්, මේ ශ්‍රමණයා පලාපයෙක්, මේ ශ්‍රමණයා කරඬුවක් [නිසරු යමක්]' යැයි හඳුනති. ඔහු මෙසේ දැනගෙන, ඔහුව සංඝයාගෙන් පිටතට නෙරපා හරිති. ඒ කුමක් නිසාද? අනෙකුත් යහපත් භික්ෂූන් වහන්සේලා අපවිත්‍ර නොකරනු පිණිසයි!\n\nමහණෙනි, යම්සේ සම්පූර්ණ වූ යව කෙතක, යව දූෂිතයෙක්, යව පලාපයෙක්, යව කරඬුවක් [නිසරු යමක්] උපදීද, එහි මුල අනෙකුත් යහපත් යව පැළවල මුල මෙන් ම වෙයි; එහි කඳ අනෙකුත් යහපත් යව පැළවල කඳ මෙන් ම වෙයි; එහි පත්‍රය අනෙකුත් යහපත් යව පැළවල පත්‍රය මෙන් ම වෙයි. යම්තාක් කල් එහි කරළ හට නොගනීද, එතෙක් කල්ය. යම් කලක එහි කරළ හටගනීද, එකල්හි එය 'මේ යව දූෂිතයෙක්, මේ යව පලාපයෙක්, මේ යව කරඬුවක්' යැයි හඳුනති. එය මෙසේ දැනගෙන, මුලින්ම උදුරා දමා, යව කෙතෙන් පිටතට විසි කරති. ඒ කුමක් නිසාද? අනෙකුත් යහපත් යව පැළ අපවිත්‍ර නොකරනු පිණිසයි!\n\nමහණෙනි, එසේම මෙහි ඇතැම් පුද්ගලයෙකුගේ යාම් ඊම්, ඉදිරිය බැලීම්, වටපිට බැලීම්, හකුලුවාගැනීම්, දිගහැරීම්, සංඝාටිය, පාත්‍රය, සිවුරු දැරීම් අනෙකුත් යහපත් භික්ෂූන් වහන්සේලාගේ මෙන් ම වෙයි. යම්තාක් කල් භික්ෂූන් වහන්සේලා ඔහුගේ වරදක් නොදකිතිද, එතෙක් කල්ය. යම් කලක භික්ෂූන් වහන්සේලා ඔහුගේ වරද දකිත්ද, එකල්හි ඔහු 'මේ ශ්‍රමණයා දුෂිතයෙක්, මේ ශ්‍රමණයා පලාපයෙක්, මේ ශ්‍රමණයා කරඬුවක්' යැයි හඳුනති. ඔහු මෙසේ දැනගෙන, ඔහුව සංඝයාගෙන් පිටතට නෙරපා හරිති. ඒ කුමක් නිසාද? අනෙකුත් යහපත් භික්ෂූන් වහන්සේලා අපවිත්‍ර නොකරනු පිණිසයි!\n\nමහණෙනි, යම්සේ විශාල ධාන්‍ය ගොඩක් සුළං කරන විට, එහි යම් ධාන්‍ය දැඩිය, සාරවත්ය, ඒවා එක් පසෙක ගොඩක් වෙයි. නමුත් යම් ධාන්‍ය දුර්වලය, පලාපය [නිසරු] යි, ඒවා සුළඟින් එක් පසකට ගසාගෙන යයි. එවිට අයිතිකරුවන්, කොස්සක් ගෙන, ඒවා තව තවත් අතුගා දමති. ඒ කුමක් නිසාද? අනෙකුත් යහපත් ධාන්‍ය අපවිත්‍ර නොකරනු පිණිසයි!\n\nමහණෙනි, එසේම මෙහි ඇතැම් පුද්ගලයෙකුගේ යාම් ඊම්, ඉදිරිය බැලීම්, වටපිට බැලීම්, හකුලුවාගැනීම්, දිගහැරීම්, සංඝාටිය, පාත්‍රය, සිවුරු දැරීම් අනෙකුත් යහපත් භික්ෂූන් වහන්සේලාගේ මෙන් ම වෙයි. යම්තාක් කල් භික්ෂූන් වහන්සේලා ඔහුගේ වරදක් නොදකිතිද, එතෙක් කල්ය. යම් කලක භික්ෂූන් වහන්සේලා ඔහුගේ වරද දකිත්ද, එකල්හි ඔහු 'මේ ශ්‍රමණයා දුෂිතයෙක්, මේ ශ්‍රමණයා පලාපයෙක්, මේ ශ්‍රමණයා කරඬුවක්' යැයි හඳුනති. ඔහු මෙසේ දැනගෙන, ඔහුව සංඝයාගෙන් පිටතට නෙරපා හරිති. ඒ කුමක් නිසාද? අනෙකුත් යහපත් භික්ෂූන් වහන්සේලා අපවිත්‍ර නොකරනු පිණිසයි!\n\nමහණෙනි, යම්සේ පුද්ගලයෙක් දිය නළයක් අපේක්ෂා කරන කල්හි, තියුණු පොරවක් ගෙන වනයට පිවිසෙයි. ඔහු යම් යම් ගසක් පොරොවේ තලයෙන් තට්ටු කරයිද, එහි යම් ගස් දැඩිය, සාරවත්ය, ඒවා පොරොවේ තලයෙන් තට්ටු කළ විට ඝන ශබ්දයක් නිකුත් කරයි. නමුත් යම් ගස් ඇතුළතින් කුණු වී ඇත්ද, තෙත් ගතියෙන් යුක්තද, නිසරු ද්‍රව්‍යවලින් යුක්තද, ඒවා පොරොවේ තලයෙන් තට්ටු කළ විට කුහර සහිත ශබ්දයක් නිකුත් කරයි. එවිට ඔහු එය මුලින් කපයි; මුලින් කපා, අගින් කපයි; අගින් කපා, ඇතුළත හොඳින් පිරිසිදු කරයි; ඇතුළත හොඳින් පිරිසිදු කර, දිය නළයක් යොදයි.\n\nමහණෙනි, එසේම මෙහි ඇතැම් පුද්ගලයෙකුගේ යාම් ඊම්, ඉදිරිය බැලීම්, වටපිට බැලීම්, හකුලුවාගැනීම්, දිගහැරීම්, සංඝාටිය, පාත්‍රය, සිවුරු දැරීම් අනෙකුත් යහපත් භික්ෂූන් වහන්සේලාගේ මෙන් ම වෙයි. යම්තාක් කල් භික්ෂූන් වහන්සේලා ඔහුගේ වරදක් නොදකිතිද, එතෙක් කල්ය. යම් කලක භික්ෂූන් වහන්සේලා ඔහුගේ වරද දකිත්ද, එකල්හි ඔහු 'මේ ශ්‍රමණයා දුෂිතයෙක්, මේ ශ්‍රමණයා පලාපයෙක්, මේ ශ්‍රමණයා කරඬුවක්' යැයි හඳුනති. ඔහු මෙසේ දැනගෙන, ඔහුව සංඝයාගෙන් පිටතට නෙරපා හරිති. ඒ කුමක් නිසාද? අනෙකුත් යහපත් භික්ෂූන් වහන්සේලා අපවිත්‍ර නොකරනු පිණිසයි!\n\n\"සංවාසයෙහිදී ඔහු නපුරු කැමැත්තෙන් යුක්ත, කෝපයට පත් අයෙකු බව දැනගන්න. ඔහු මත්සරිය, ස්ථම්භය, පලාසය, ඊර්ෂ්‍යාව, මසුරුකම, වංචාකාරී බව ඇත්තෙකි.\n\nඔහු මිනිසුන්ට සන්සුන්ව කතා කරයි, ශ්‍රමණයෙකු මෙන් කතා කරයි; රහසේ දේ කරයි, නරක දෘෂ්ටියක් ඇත්තෙකි, අනාදරයෙකි.\n\nඔහු හොර රහසේ ක්‍රියා කරයි, බොරු කියන්නෙකි; ඔහුව මෙසේ ඇත්ත වශයෙන්ම දැනගෙන, ඔබ සියල්ලෝම සමගි වී, ඔහුව සම්පූර්ණයෙන්ම නෙරපා හරින්න.\n\nනිසරු දේ නෙරපන්න, කසළ ඉවත් කරන්න; එවිට පලාපයන්, ශ්‍රමණයන් නොවී ශ්‍රමණ යැයි සලකන්නන්, ඉවත් කරන්න.\n\nනපුරු කැමැත්තෙන් යුක්ත අය, නපුරු චර්යා හා ගෝචර ඇත්තන් නෙරපා හැර, සිහියෙන් යුක්තව ශුද්ධ වූ අය සමඟ පිරිසිදුව සංවාසය පවත්වන්න. එවිට සමගිව, ප්‍රඥාවන්තව, දුකේ කෙළවර කරන්නාහුය.\"",
      "paliTitle": "Kāraṇḍavasuttaṃ",
      "englishTitle": "The Kāraṇḍava Discourse",
      "sinhalaTitle": "කාරණ්ඩව සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Mettāvaggo paṭhamo. Tassuddānaṃ – Mettaṃ paññā ca dve piyā, dve lokā dve vipattiyo; Devadatto ca uttaro, nando kāraṇḍavena cāti.",
    "english": "The First Chapter on Loving-kindness",
    "sinhala": "පළමුවන මෙත්තා වග්ගය"
  }
}