{
  "id": "an8.11",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Section on Lust",
    "sinhala": "රාග පෙය්‍යාලය"
  },
  "sections": [
    {
      "number": 117,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya aṭṭha dhammā bhāvetabbā. Katame aṭṭha? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi – rāgassa, bhikkhave, abhiññāya ime aṭṭha dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the full comprehension of lust, eight factors should be cultivated. Which eight? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration—Monks, for the full comprehension of lust, these eight factors should be cultivated.",
      "sinhala": "මහණෙනි, රාගය පිරිසිඳ දැනගැනීම පිණිස ධර්ම අටක් වැඩිය යුතු යි. ඒ අට කවරහු ද? සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යි. මහණෙනි, රාගය පිරිසිඳ දැනගැනීම පිණිස මේ ධර්ම අට වැඩිය යුතු යි.",
      "paliTitle": ""
    },
    {
      "number": 118,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya aṭṭha dhammā bhāvetabbā. Katame aṭṭha? Ajjhattaṃ rūpasaññī bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni, tāni abhibhuyya ‘jānāmi passāmī’ti evaṃsaññī hoti. Ajjhattaṃ rūpasaññī bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni, tāni abhibhuyya ‘jānāmi passāmī’ti evaṃsaññī hoti. Ajjhattaṃ arūpasaññī bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni, tāni abhibhuyya ‘jānāmi passāmī’ti evaṃsaññī hoti. Ajjhattaṃ arūpasaññī bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni, tāni abhibhuyya ‘jānāmi passāmī’ti evaṃsaññī hoti. Ajjhattaṃ arūpasaññī bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni pītāni pītavaṇṇāni…pe… lohitakāni lohitakavaṇṇāni…pe… odātāni odātavaṇṇāni…pe… odātanibhāsāni, tāni abhibhuyya ‘jānāmi passāmī’ti evaṃsaññī hoti – rāgassa, bhikkhave, abhiññāya ime aṭṭha dhammā bhāvetabbā’’.",
      "english": "Monks, eight practices are to be developed for the direct knowledge of lust. Which eight? Perceiving forms internally, one sees external forms, whether beautiful or ugly, that are limited. Having overcome them, one becomes thus perceiving, 'I know, I see.' Perceiving forms internally, one sees external forms, whether beautiful or ugly, that are immeasurable. Having overcome them, one becomes thus perceiving, 'I know, I see.' Perceiving non-forms internally, one sees external forms, whether beautiful or ugly, that are limited. Having overcome them, one becomes thus perceiving, 'I know, I see.' Perceiving non-forms internally, one sees external forms, whether beautiful or ugly, that are immeasurable. Having overcome them, one becomes thus perceiving, 'I know, I see.' Perceiving non-forms internally, one sees external forms that are blue, blue in color, blue in appearance, blue in luster. Having overcome them, one becomes thus perceiving, 'I know, I see.' Perceiving non-forms internally, one sees external forms that are yellow, yellow in color, yellow in appearance, yellow in luster. Having overcome them, one becomes thus perceiving, 'I know, I see.' Perceiving non-forms internally, one sees external forms that are red, red in color, red in appearance, red in luster. Having overcome them, one becomes thus perceiving, 'I know, I see.' Perceiving non-forms internally, one sees external forms that are white, white in color, white in appearance, white in luster. Having overcome them, one becomes thus perceiving, 'I know, I see.' Monks, these eight practices are to be developed for the direct knowledge of lust.",
      "sinhala": "මහණෙනි, රාගය අවබෝධය පිණිස ධර්‍ම අටක් වැඩිය යුතුයි. ඒ අට කවරේද?\n\nතමන් තුළ රූප සංඥාව ඇතිව, බාහිර කුඩා වූ ලස්සන හා අවලස්සන රූප දකිමින්, ඒවා අභිභවනය කරමින් ‘මම දනිමි, මම දකිමි’ යනුවෙන් සංඥා ඇතිවේ.\n\nතමන් තුළ රූප සංඥාව ඇතිව, බාහිර අප්‍රමාණ වූ ලස්සන හා අවලස්සන රූප දකිමින්, ඒවා අභිභවනය කරමින් ‘මම දනිමි, මම දකිමි’ යනුවෙන් සංඥා ඇතිවේ.\n\nතමන් තුළ අරූප සංඥාව ඇතිව, බාහිර කුඩා වූ ලස්සන හා අවලස්සන රූප දකිමින්, ඒවා අභිභවනය කරමින් ‘මම දනිමි, මම දකිමි’ යනුවෙන් සංඥා ඇතිවේ.\n\nතමන් තුළ අරූප සංඥාව ඇතිව, බාහිර අප්‍රමාණ වූ ලස්සන හා අවලස්සන රූප දකිමින්, ඒවා අභිභවනය කරමින් ‘මම දනිමි, මම දකිමි’ යනුවෙන් සංඥා ඇතිවේ.\n\nතමන් තුළ අරූප සංඥාව ඇතිව, බාහිර නිල් පැහැති, නිල් වර්ණ, නිල් පැහැයෙන් පෙනෙන, නිල් පැහැයෙන් බැබලෙන රූප, කහ පැහැති, කහ වර්ණ, කහ පැහැයෙන් පෙනෙන, කහ පැහැයෙන් බැබලෙන රූප, රතු පැහැති, රතු වර්ණ, රතු පැහැයෙන් පෙනෙන, රතු පැහැයෙන් බැබලෙන රූප, සහ සුදු පැහැති, සුදු වර්ණ, සුදු පැහැයෙන් පෙනෙන, සුදු පැහැයෙන් බැබලෙන රූප දකිමින්, ඒ සියල්ල අභිභවනය කරමින් ‘මම දනිමි, මම දකිමි’ යනුවෙන් සංඥා ඇතිවේ.\n\nමහණෙනි, රාගය අවබෝධය පිණිස මේ ධර්‍ම අට වැඩිය යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 119,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya aṭṭha dhammā bhāvetabbā. Katame aṭṭha? Rūpī rūpāni passati, ajjhattaṃ arūpasaññī bahiddhā rūpāni passati, subhanteva adhimutto hoti, sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati, sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati, sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati, sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati, sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati – rāgassa, bhikkhave, abhiññāya ime aṭṭha dhammā bhāvetabbā’’.",
      "english": "Monks, for the full understanding of passion, eight practices should be developed. Which eight?\n\nOne with a body sees forms. Internally not perceiving forms, one sees external forms. One is intent on the beautiful. By completely transcending perceptions of form, by the disappearance of perceptions of impingement, by not attending to perceptions of diversity, one attains and abides in the sphere of infinite space, thinking: ‘Space is infinite’. By completely transcending the sphere of infinite space, one attains and abides in the sphere of infinite consciousness, thinking: ‘Consciousness is infinite’. By completely transcending the sphere of infinite consciousness, one attains and abides in the sphere of nothingness, thinking: ‘There is nothing at all’. By completely transcending the sphere of nothingness, one attains and abides in the sphere of neither perception nor non-perception. By completely transcending the sphere of neither perception nor non-perception, one attains and abides in the cessation of perception and feeling.\n\nMonks, for the full understanding of passion, these eight practices should be developed.",
      "sinhala": "භික්ෂූනි, රාගය අවබෝධය පිණිස ධර්ම අටක් වඩනු ලැබිය යුතුය.\n\nඒ අට කවරේද?\n\nරූපී වූ පුද්ගලයා රූප දකියි. තමා තුළ අරූප සංඥාවෙන් යුක්තව පිටත රූප දකියි. ශුභයෙහිම අධිමුක්ත වෙයි.\n\nසියලු රූප සංඥාවන් සම්පූර්ණයෙන් ඉක්මවා, ප්‍රතිඝ සංඥාවන් අස්තංගත කිරීමෙන් ද, නානත්ව සංඥාවන් අමනසිකාරයෙන් ද, 'ආකාශය අනන්තයි' යනුවෙන් සිතා ආකාසානංචායතනයට එළඹ වාසය කරයි.\n\nසියලු ආකාසානංචායතනය සම්පූර්ණයෙන් ඉක්මවා, 'විඤ්ඤාණය අනන්තයි' යනුවෙන් සිතා විඤ්ඤාණංචායතනයට එළඹ වාසය කරයි.\n\nසියලු විඤ්ඤාණංචායතනය සම්පූර්ණයෙන් ඉක්මවා, 'කිසිවක් නැත' යනුවෙන් සිතා ආකිංචඤ්ඤායතනයට එළඹ වාසය කරයි.\n\nසියලු ආකිංචඤ්ඤායතනය සම්පූර්ණයෙන් ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනයට එළඹ වාසය කරයි.\n\nසියලු නේවසඤ්ඤානාසඤ්ඤායතනය සම්පූර්ණයෙන් ඉක්මවා, සංඥා වේදයිත නිරෝධයට එළඹ වාසය කරයි.\n\nභික්ෂූනි, රාගය අවබෝධය පිණිස මේ ධර්ම අට වඩනු ලැබිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 120,
      "pali": "‘‘Rāgassa, bhikkhave, pariññāya…pe… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya…pe… ime aṭṭha dhammā bhāvetabbā’’.",
      "english": "Monks, for the full understanding of passion, for its complete destruction, for its abandoning, for its ending, for its fading away, for its dispassion, for its cessation, for its relinquishment, for its letting go – these eight qualities should be developed.",
      "sinhala": "මහණෙනි, රාගය පිරිසිඳ දැනගැනීම, පිරිහෙළීම, ප්‍රහාණය, ක්ෂය කිරීම, වියැකීම, විරාගය, නිරෝධය, චාගය සහ ප්‍රතිනිස්සර්ගය පිණිස මේ අට ධර්මයන් වැඩිය යුතු ය.",
      "paliTitle": ""
    },
    {
      "number": 147,
      "pali": "‘‘Dosassa…pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa … māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa abhiññāya…pe… pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya…pe… ime aṭṭha dhammā bhāvetabbā’’ti.",
      "english": "For the direct knowledge, full comprehension, utter destruction, abandoning, destruction, passing away, dispassion, cessation, relinquishment, and renunciation of hatred, delusion, anger, hostility, denigration, rivalry, envy, stinginess, deceit, craftiness, obstinacy, arrogance, conceit, excessive pride, intoxication, and heedlessness, these eight qualities should be developed.",
      "sinhala": "ද්වේෂයෙහි, මෝහයෙහි, ක‍්‍රෝධයෙහි, උපනාහයෙහි, මක්ඛයෙහි, පලාසයෙහි, ඊර්ෂ්‍යාවෙහි, මසුරුකමෙහි, මායාවෙහි, සාඨෙය්‍යයෙහි, ථම්භයෙහි, සාරම්භයෙහි, මානයෙහි, අතිමානයෙහි, මදයෙහි, ප‍්‍රමාදයෙහි අභිඥාව පිණිස, පරඥාව පිණිස, පිරිසිඳ ක්ෂය කිරීම පිණිස, ප‍්‍රහාණය පිණිස, ක්ෂය කිරීම පිණිස, වැනසීම පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, ත්‍යාගය පිණිස, ප‍්‍රතිනිස්සර්ගය පිණිස මේ අට ධර්මයන් වැඩිය යුතු ය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ",
    "english": "Lust Series Concluded",
    "sinhala": "රාග පෙය්‍යාළය නිමි"
  }
}