{
  "id": "an8.2",
  "title": {
    "pali": "Mahāvaggo",
    "english": "The Great Chapter",
    "sinhala": "මහාවග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "[pārā. 1 ādayo] Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā verañjāyaṃ viharati naḷerupucimandamūle. Atha kho verañjo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ [sārāṇīyaṃ (sī. syā. kaṃ. pī.)] vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho verañjo brāhmaṇo bhagavantaṃ etadavoca – ‘‘Sutaṃ metaṃ, bho gotama – ‘na samaṇo gotamo brāhmaṇe jiṇṇe vuḍḍhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimantetī’ti. Tayidaṃ, bho gotama, tatheva. Na hi bhavaṃ gotamo brāhmaṇe jiṇṇe vuḍḍhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimanteti. Tayidaṃ, bho gotama, na sampannamevā’’ti. ‘‘Nāhaṃ taṃ, brāhmaṇa, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yamahaṃ abhivādeyyaṃ vā paccuṭṭheyyaṃ vā āsanena vā nimanteyyaṃ. Yañhi, brāhmaṇa, tathāgato abhivādeyya vā paccuṭṭheyya vā āsanena vā nimanteyya, muddhāpi tassa vipateyyā’’ti. ‘‘Arasarūpo bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘arasarūpo samaṇo gotamo’ti. Ye te, brāhmaṇa, rūparasā saddarasā gandharasā rasarasā phoṭṭhabbarasā, te tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā [anabhāvakatā (sī. pī.)] āyatiṃ anuppādadhammā. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘arasarūpo samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesī’’ti [vadesi (sī. ka.)]. ‘‘Nibbhogo bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘nibbhogo samaṇo gotamo’ti. Ye te, brāhmaṇa, rūpabhogā saddabhogā gandhabhogā rasabhogā phoṭṭhabbabhogā, te tathāgatassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘nibbhogo samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. ‘‘Akiriyavādo bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘akiriyavādo samaṇo gotamo’ti. Ahañhi, brāhmaṇa, akiriyaṃ vadāmi kāyaduccaritassa vacīduccaritassa manoduccaritassa; anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ akiriyaṃ vadāmi. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘akiriyavādo samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. ‘‘Ucchedavādo bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘ucchedavādo samaṇo gotamo’ti. Ahañhi, brāhmaṇa, ucchedaṃ vadāmi rāgassa dosassa mohassa; anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ ucchedaṃ vadāmi. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘ucchedavādo samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. ‘‘Jegucchī bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘jegucchī samaṇo gotamo’ti. Ahañhi, brāhmaṇa, jigucchāmi kāyaduccaritena vacīduccaritena manoduccaritena; jigucchāmi anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘jegucchī samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. ‘‘Venayiko bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘venayiko samaṇo gotamo’ti. Ahañhi, brāhmaṇa, vinayāya dhammaṃ desemi rāgassa dosassa mohassa; anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ vinayāya dhammaṃ desemi. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘venayiko samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. ‘‘Tapassī bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘tapassī samaṇo gotamo’ti. Tapanīyāhaṃ, brāhmaṇa, pāpake akusale dhamme vadāmi kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ. Yassa kho, brāhmaṇa, tapanīyā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, tamahaṃ ‘tapassī’ti vadāmi. Tathāgatassa kho, brāhmaṇa, tapanīyā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘tapassī samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. ‘‘Apagabbho bhavaṃ gotamo’’ti! ‘‘Atthi khvesa, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘apagabbho samaṇo gotamo’ti. Yassa kho, brāhmaṇa, āyatiṃ gabbhaseyyā punabbhavābhinibbatti pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, tamahaṃ ‘apagabbho’ti vadāmi. Tathāgatassa kho, brāhmaṇa, āyatiṃ gabbhaseyyā punabbhavābhinibbatti pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Ayaṃ kho, brāhmaṇa, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘apagabbho samaṇo gotamo’ti, no ca kho yaṃ tvaṃ sandhāya vadesi. ‘‘Seyyathāpi, brāhmaṇa, kukkuṭiyā aṇḍāni aṭṭha vā dasa vā dvādasa vā. Tānāssu kukkuṭiyā sammā adhisayitāni sammā pariseditāni sammā paribhāvitāni. Yo nu kho tesaṃ kukkuṭacchāpakānaṃ paṭhamataraṃ pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṃ padāletvā sotthinā abhinibbhijjeyya, kinti svāssa vacanīyo – ‘jeṭṭho vā kaniṭṭho vā’’’ti? ‘‘Jeṭṭho tissa, bho gotama, vacanīyo. So hi nesaṃ, bho gotama, jeṭṭho hotī’’ti. ‘‘Evamevaṃ kho ahaṃ, brāhmaṇa, avijjāgatāya pajāya aṇḍabhūtāya pariyonaddhāya avijjaṇḍakosaṃ padāletvā ekova loke anuttaraṃ sammāsambodhiṃ abhisambuddho. Ahañhi, brāhmaṇa, jeṭṭho seṭṭho lokassa. Āraddhaṃ kho pana me, brāhmaṇa, vīriyaṃ ahosi asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ. ‘‘So kho ahaṃ, brāhmaṇa, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi; vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi; pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi; sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharāmi. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhininnāmesiṃ. So anekavihitaṃ pubbenivāsaṃ anussarāmi, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto. So tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto. So tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. ‘‘Ayaṃ kho me, brāhmaṇa, rattiyā paṭhame yāme paṭhamā vijjā adhigatā; avijjā vihatā vijjā uppannā; tamo vihato āloko uppanno, yathā taṃ appamattassa ātāpino pahitattassa viharato. Ayaṃ kho me, brāhmaṇa, paṭhamā abhinibbhidā ahosi kukkuṭacchāpakasseva aṇḍakosamhā. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhininnāmesiṃ. So dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāmi – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā, vacīduccaritena samannāgatā, manoduccaritena samannāgatā, ariyānaṃ upavādakā, micchādiṭṭhikā, micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannāti. Ime vā pana bhonto sattā kāyasucaritena samannāgatā, vacīsucaritena samannāgatā, manosucaritena samannāgatā, ariyānaṃ anupavādakā, sammādiṭṭhikā, sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāmi. ‘‘Ayaṃ kho me, brāhmaṇa, rattiyā majjhime yāme dutiyā vijjā adhigatā; avijjā vihatā vijjā uppannā; tamo vihato āloko uppanno, yathā taṃ appamattassa ātāpino pahitattassa viharato. Ayaṃ kho me, brāhmaṇa, dutiyā abhinibbhidā ahosi kukkuṭacchāpakasseva aṇḍakosamhā. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhininnāmesiṃ. So ‘idaṃ dukkha’nti yathābhūtaṃ abbhaññāsiṃ, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ abbhaññāsiṃ, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ abbhaññāsiṃ, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ abbhaññāsiṃ; ‘ime āsavā’ti yathābhūtaṃ abbhaññāsiṃ, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ abbhaññāsiṃ, ‘ayaṃ āsavanirodho’ti yathābhūtaṃ abbhaññāsiṃ, ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ abbhaññāsiṃ. Tassa me evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccittha, bhavāsavāpi cittaṃ vimuccittha, avijjāsavāpi cittaṃ vimuccittha. Vimuttasmiṃ vimuttamiti ñāṇaṃ ahosi. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti abbhaññāsiṃ. ‘‘Ayaṃ kho me, brāhmaṇa, rattiyā pacchime yāme tatiyā vijjā adhigatā; avijjā vihatā vijjā uppannā; tamo vihato āloko uppanno, yathā taṃ appamattassa ātāpino pahitattassa viharato. Ayaṃ kho me, brāhmaṇa, tatiyā abhinibbhidā ahosi kukkuṭacchāpakasseva aṇḍakosamhā’’ti. Evaṃ vutte verañjo brāhmaṇo bhagavantaṃ etadavoca – ‘‘jeṭṭho bhavaṃ gotamo, seṭṭho bhavaṃ gotamo. Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ [nikujjitaṃ (ka.)] vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Verañjā, at the root of a Naḷeru-pucimanda tree.\n\nThen the brahmin Verañja approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging cordial greetings, he sat down to one side.\n\nSeated to one side, the brahmin Verañja said to the Blessed One: ‘I have heard this, Master Gotama: “The recluse Gotama does not greet brahmins who are old, aged, advanced in years, having come to the last stage of life, nor does he rise up for them, nor does he invite them to a seat.” This, Master Gotama, is indeed true. For Master Gotama does not greet brahmins who are old, aged, advanced in years, having come to the last stage of life, nor does he rise up for them, nor does he invite them to a seat. This, Master Gotama, is not proper.’\n\n‘Brahmin, I do not see anyone in the world with its deities, Māras, and Brahmās, in this generation with its recluses and brahmins, its gods and humans, whom I should greet, rise up for, or invite to a seat. For if the Tathāgata were to greet, rise up for, or invite someone to a seat, that one’s head would surely split apart.’\n\n‘Master Gotama is without taste!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is without taste.” Those tastes of forms, tastes of sounds, tastes of odors, tastes of flavors, tastes of tactile objects – these have been abandoned by the Tathāgata, cut off at the root, made like a palm stump, brought to non-existence, and are incapable of future arising. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is without taste,” but not in the sense that you mean.’\n\n‘Master Gotama is devoid of enjoyments!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is devoid of enjoyments.” Those enjoyments of forms, enjoyments of sounds, enjoyments of odors, enjoyments of flavors, enjoyments of tactile objects – these have been abandoned by the Tathāgata, cut off at the root, made like a palm stump, brought to non-existence, and are incapable of future arising. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is devoid of enjoyments,” but not in the sense that you mean.’\n\n‘Master Gotama is an advocate of non-action!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is an advocate of non-action.” For, brahmin, I advocate non-action regarding misconduct by body, misconduct by speech, and misconduct by mind. I advocate non-action regarding various kinds of evil and unwholesome states. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is an advocate of non-action,” but not in the sense that you mean.’\n\n‘Master Gotama is an annihilationist!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is an annihilationist.” For, brahmin, I advocate the annihilation of lust, hatred, and delusion. I advocate the annihilation of various kinds of evil and unwholesome states. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is an annihilationist,” but not in the sense that you mean.’\n\n‘Master Gotama is an abhorrer!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is an abhorrer.” For, brahmin, I abhor misconduct by body, misconduct by speech, and misconduct by mind. I abhor the entering into various kinds of evil and unwholesome states. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is an abhorrer,” but not in the sense that you mean.’\n\n‘Master Gotama is a disciplinarian!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is a disciplinarian.” For, brahmin, I teach the Dhamma for the removal of lust, hatred, and delusion. I teach the Dhamma for the removal of various kinds of evil and unwholesome states. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is a disciplinarian,” but not in the sense that you mean.’\n\n‘Master Gotama is an ascetic!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is an ascetic.” For, brahmin, I declare evil and unwholesome states to be scorching; namely, misconduct by body, misconduct by speech, and misconduct by mind. If, brahmin, those scorching evil and unwholesome states have been abandoned, cut off at the root, made like a palm stump, brought to non-existence, and are incapable of future arising, then I call that person an ascetic. For the Tathāgata, brahmin, those scorching evil and unwholesome states have been abandoned, cut off at the root, made like a palm stump, brought to non-existence, and are incapable of future arising. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is an ascetic,” but not in the sense that you mean.’\n\n‘Master Gotama is one who is free from rebirth in a womb!’\n\n‘Brahmin, there is indeed a way in which one, speaking rightly, might say of me: “The recluse Gotama is one who is free from rebirth in a womb.” If, brahmin, future rebirth in a womb and the renewed existence that implies have been abandoned, cut off at the root, made like a palm stump, brought to non-existence, and are incapable of future arising, then I call that person one who is free from rebirth in a womb. For the Tathāgata, brahmin, future rebirth in a womb and the renewed existence that implies have been abandoned, cut off at the root, made like a palm stump, brought to non-existence, and are incapable of future arising. This, brahmin, is the way in which one, speaking rightly, might say of me: “The recluse Gotama is one who is free from rebirth in a womb,” but not in the sense that you mean.\n\n‘Just as, brahmin, there might be eight, ten, or twelve hen’s eggs. These eggs would be well brooded over, well incubated, well nurtured by the hen. Then, whichever of those chicks first breaks through the eggshell with the tip of its claw or with its beak and emerges safely, what would that one be called – the eldest or the youngest?’\n\n‘It would be called the eldest, Master Gotama. For that one, Master Gotama, would be the eldest.’\n\n‘Even so, brahmin, I alone, having broken through the eggshell of ignorance, which enveloped this generation steeped in ignorance and egg-bound, have attained unsurpassed perfect self-awakening in the world. I am, brahmin, the eldest and the foremost in the world. Furthermore, brahmin, my energy was aroused and unflagging, my mindfulness was established and unconfused, my body was tranquil and unagitated, my mind was concentrated and one-pointed.\n\n‘Then, brahmin, quite secluded from sensual pleasures, secluded from unwholesome states, I entered upon and abided in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and happiness. With the stilling of initial and sustained application, I entered upon and abided in the second jhāna, which has internal assurance and unification of mind, is without initial application and sustained application, born of concentration, and filled with rapture and happiness. With the fading away of rapture, I abided in equanimity, mindful and clearly comprehending, and I experienced happiness with the body, of which the noble ones declare: “He abides in happiness with equanimity and mindfulness.” Thus, I entered upon and abided in the third jhāna. With the abandoning of pleasure and pain, and with the prior disappearance of joy and grief, I entered upon and abided in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness.\n\n‘With the mind thus concentrated, purified, cleansed, unblemished, rid of defilement, pliant, workable, steady, and attained to imperturbability, I directed it to the knowledge of recollecting past lives. I recollected my manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. “There I was of such a name, such a clan, such a complexion, such a diet, I experienced such pleasure and pain, and my life span was such. Having passed away from there, I reappeared elsewhere. There too I was of such a name, such a clan, such a complexion, such a diet, I experienced such pleasure and pain, and my life span was such. Having passed away from there, I reappeared here.” Thus, with their aspects and particulars, I recollected my manifold past lives.\n\n‘This, brahmin, was the first knowledge attained by me in the first watch of the night; ignorance was dispelled, knowledge arose; darkness was dispelled, light arose, as is fitting for one who abides diligent, ardent, and resolute. This, brahmin, was my first breakthrough, like that of the chick from its eggshell.\n\n‘With the mind thus concentrated, purified, cleansed, unblemished, rid of defilement, pliant, workable, steady, and attained to imperturbability, I directed it to the knowledge of the passing away and reappearance of beings. With the divine eye, purified and surpassing that of humans, I saw beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and I understood how beings fare according to their actions. “These beings, alas, engaged in misconduct by body, speech, and mind, revilers of noble ones, holding wrong views, and undertaking actions based on wrong views, with the breakup of the body, after death, have reappeared in a state of deprivation, a bad destination, a lower realm, hell. But these beings, alas, engaged in good conduct by body, speech, and mind, not revilers of noble ones, holding right views, and undertaking actions based on right views, with the breakup of the body, after death, have reappeared in a good destination, a heavenly world.” Thus, with the divine eye, purified and surpassing that of humans, I saw beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and I understood how beings fare according to their actions.\n\n‘This, brahmin, was the second knowledge attained by me in the middle watch of the night; ignorance was dispelled, knowledge arose; darkness was dispelled, light arose, as is fitting for one who abides diligent, ardent, and resolute. This, brahmin, was my second breakthrough, like that of the chick from its eggshell.\n\n‘With the mind thus concentrated, purified, cleansed, unblemished, rid of defilement, pliant, workable, steady, and attained to imperturbability, I directed it to the knowledge of the destruction of the taints. I directly knew as it actually is: “This is suffering”; I directly knew as it actually is: “This is the origin of suffering”; I directly knew as it actually is: “This is the cessation of suffering”; I directly knew as it actually is: “This is the path leading to the cessation of suffering.” I directly knew as it actually is: “These are the taints”; I directly knew as it actually is: “This is the origin of the taints”; I directly knew as it actually is: “This is the cessation of the taints”; I directly knew as it actually is: “This is the path leading to the cessation of the taints.” When I knew and saw thus, my mind was liberated from the taint of sensual desire, my mind was liberated from the taint of existence, and my mind was liberated from the taint of ignorance. With liberation, there arose the knowledge: “Liberated.” I directly knew: “Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.”\n\n‘This, brahmin, was the third knowledge attained by me in the last watch of the night; ignorance was dispelled, knowledge arose; darkness was dispelled, light arose, as is fitting for one who abides diligent, ardent, and resolute. This, brahmin, was my third breakthrough, like that of the chick from its eggshell.’\n\nWhen this was said, the brahmin Verañja said to the Blessed One: ‘Master Gotama is the eldest, Master Gotama is the foremost! Excellent, Master Gotama, excellent! Just as, Master Gotama, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or carry a lamp into the darkness so that those with eyes might see forms – in the same way, the Dhamma has been made clear in various ways by Master Gotama. I go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let Master Gotama remember me as a lay follower who has gone for refuge from this day forth as long as life lasts.’",
      "sinhala": "මා විසින් මෙසේ අසන ලදි – එක් කලෙක භාග්‍යවතුන් වහන්සේ වේරංජා නුවර නළේරුපූචිමන්ද නම් රුක්මුලෙහි වාසය කරති. ඉක්බිති වේරංජා බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා බස් නිමවා එකත්පසෙකින් හිඳගත්තේය. එකත්පසෙකින් හිඳගත් වේරංජා බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය: “භවත් ගෞතමයන් වහන්ස, මා මේ කාරණය අසා ඇත: ‘ගෞතම ශ්‍රමණයා වයසට ගිය, මහලු, වියපත්, ජීවිතයේ අවසාන භාගයට පැමිණ සිටින බමුණන්ට ආචාර කරන්නේ හෝ නැගිට හිඳින්නට ආරාධනා කරන්නේ හෝ ආසනයකින් සංග්‍රහ කරන්නේ නැත’ යනුවෙනි. භවත් ගෞතමයන් වහන්ස, ඒ කාරණය එසේමය. භවත් ගෞතමයන් වහන්සේ වයසට ගිය, මහලු, වියපත්, ජීවිතයේ අවසාන භාගයට පැමිණ සිටින බමුණන්ට ආචාර කරන්නේ හෝ නැගිට හිඳින්නට ආරාධනා කරන්නේ හෝ ආසනයකින් සංග්‍රහ කරන්නේ නැත. භවත් ගෞතමයන් වහන්ස, ඒ කාරණය සුදුසු නොවේ.”\n\n“බ්‍රාහ්මණය, දෙවිවරුන් සහිත මරුන් සහිත බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණ සහිත වූ, දෙවි මිනිසුන් සහිත වූ මේ ලෝකයේ මම එවැනි අයෙක් නොදකිමි, යමෙකුට මා ආචාර කළ යුතු හෝ නැගිට ආසනයක් දිය යුතු හෝ ආසනයකින් සංග්‍රහ කළ යුතු හෝ වේද. බ්‍රාහ්මණය, යමෙකුට තථාගතයාණන් වහන්සේ ආචාර කරන්නේ නම්, හෝ නැගිටින්නේ නම්, හෝ ආසනයකින් සංග්‍රහ කරන්නේ නම්, ඔහුගේ හිස පවා පිපිරී යන්නේය.”\n\n“භවත් ගෞතමයන් වහන්සේ රස රහිත කෙනෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා රස රහිතය’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, යම් රූප රසයන්, ශබ්ද රසයන්, ගන්ධ රසයන්, රසයන්, ස්පර්ශ රසයන් වේද, ඒවා තථාගතයාණන් වහන්සේට ප්‍රහීණ කරනු ලැබ, මුල් සිඳ දමනු ලැබ, තල් ගසක් මෙන් හිස් කරනු ලැබ, අභාවයට පත් කරනු ලැබ, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා රස රහිතය’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“භවත් ගෞතමයන් වහන්සේ භෝග රහිත කෙනෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා භෝග රහිතය’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, යම් රූප භෝගයන්, ශබ්ද භෝගයන්, ගන්ධ භෝගයන්, රස භෝගයන්, ස්පර්ශ භෝගයන් වේද, ඒවා තථාගතයාණන් වහන්සේට ප්‍රහීණ කරනු ලැබ, මුල් සිඳ දමනු ලැබ, තල් ගසක් මෙන් හිස් කරනු ලැබ, අභාවයට පත් කරනු ලැබ, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා භෝග රහිතය’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“භවත් ගෞතමයන් වහන්සේ අක්‍රියවාදියෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා අක්‍රියවාදියෙකි’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, මම කාය දුෂ්චරිතයේ, වචී දුෂ්චරිතයේ, මනෝ දුෂ්චරිතයේ අක්‍ියාව (නොකර සිටීම) ගැන කියමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන් නොකිරීම ගැන මම කියමි. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා අක්‍රියවාදියෙකි’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“භවත් ගෞතමයන් වහන්සේ උච්ඡේදවාදියෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා උච්ඡේදවාදියෙකි’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, මම රාගයේ, ද්වේෂයේ, මෝහයේ උච්ඡේදය (විනාශ කිරීම) ගැන කියමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන් විනාශ කිරීම ගැන මම කියමි. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා උච්ඡේදවාදියෙකි’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“භවත් ගෞතමයන් වහන්සේ පිළිකුල් කරන කෙනෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා පිළිකුල් කරන කෙනෙකි’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, මම කාය දුෂ්චරිතයට, වචී දුෂ්චරිතයට, මනෝ දුෂ්චරිතයට පිළිකුල් කරමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන්ට සමවැදීම (යෙදීම) මම පිළිකුල් කරමි. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා පිළිකුල් කරන කෙනෙකි’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“භවත් ගෞතමයන් වහන්සේ විනය කාරක කෙනෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා විනය කාරක කෙනෙකි’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, මම රාගය, ද්වේෂය, මෝහය විනය කිරීමට (සංවර කිරීමට, දුරලීමට) ධර්මය දේශනා කරමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන් දුරලීම පිණිස මම ධර්මය දේශනා කරමි. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා විනය කාරක කෙනෙකි’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“භවත් ගෞතමයන් වහන්සේ තපස් රකින කෙනෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා තපස් රකින කෙනෙකි’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, මම කාය දුෂ්චරිතය, වචී දුෂ්චරිතය, මනෝ දුෂ්චරිතය යන පාපී අකුසල ධර්මයන් තැවිය යුතු (දුරු කළ යුතු) දේ ලෙස පවසමි. බ්‍රාහ්මණය, යමෙකුට තැවිය යුතු පාපී අකුසල ධර්මයන් ප්‍රහීණ කරනු ලැබ, මුල් සිඳ දමනු ලැබ, තල් ගසක් මෙන් හිස් කරනු ලැබ, අභාවයට පත් කරනු ලැබ, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත්ද, මම ඔහු ‘තපස් රකින කෙනෙකි’යි කියමි. බ්‍රාහ්මණය, තථාගතයාණන් වහන්සේට තැවිය යුතු පාපී අකුසල ධර්මයන් ප්‍රහීණ කරනු ලැබ, මුල් සිඳ දමනු ලැබ, තල් ගසක් මෙන් හිස් කරනු ලැබ, අභාවයට පත් කරනු ලැබ, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා තපස් රකින කෙනෙකි’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“භවත් ගෞතමයන් වහන්සේ ගැබ් ගැනීමෙන් තොර කෙනෙකි!”\n\n“බ්‍රාහ්මණය, යම් ආකාරයකින් මා නිවැරදිව ‘ගෞතම ශ්‍රමණයා ගැබ් ගැනීමෙන් තොර කෙනෙකි’යි කියන්නේ නම්, එයට ක්‍රමයක් ඇත. බ්‍රාහ්මණය, යමෙකුට අනාගතයේදී ගැබ්ගැනීම්, නැවත භවයක් ඇතිවීම් ප්‍රහීණ කරනු ලැබ, මුල් සිඳ දමනු ලැබ, තල් ගසක් මෙන් හිස් කරනු ලැබ, අභාවයට පත් කරනු ලැබ, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත්ද, මම ඔහු ‘ගැබ් ගැනීමෙන් තොර කෙනෙකි’යි කියමි. බ්‍රාහ්මණය, තථාගතයාණන් වහන්සේට අනාගතයේදී ගැබ්ගැනීම්, නැවත භවයක් ඇතිවීම් ප්‍රහීණ කරනු ලැබ, මුල් සිඳ දමනු ලැබ, තල් ගසක් මෙන් හිස් කරනු ලැබ, අභාවයට පත් කරනු ලැබ, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. බ්‍රාහ්මණය, මා ‘ගෞතම ශ්‍රමණයා ගැබ් ගැනීමෙන් තොර කෙනෙකි’යි නිවැරදිව කියන්නේ නම්, එයට ඇති ක්‍රමය මෙයයි. එහෙත් ඔබ අදහස් කරන කාරණය නම් නොවේ.”\n\n“බ්‍රාහ්මණය, යම්සේ කිකිළියකගේ බිත්තර අටක් හෝ දහයක් හෝ දොළහක් වේද, ඒවා කිකිළිය විසින් මනාව උණුසුම් කරනු ලැබ, මනාව සෙවණ කරනු ලැබ, මනාව පෝෂණය කරනු ලැබ ඇත්තාහ. ඒ කිකිළි පැටවුන් අතුරින් යමෙක් පළමුවෙන් පාදයේ නිය තුඩකින් හෝ හොට තුඩකින් හෝ බිත්තර කවචය බිඳගෙන ආරක්ෂිතව පිටතට එන්නේද, ඔහුට ‘ජ්‍යේෂ්ඨයාද, කනිට්ඨයාද’ කියා කුමක් කිය යුතුද?” “භවත් ගෞතමයන් වහන්ස, ඔහුට ‘ජ්‍යේෂ්ඨයා’ කියා කිය යුතුය. මක්නිසාද යත්, භවත් ගෞතමයන් වහන්ස, ඔහු ඔවුන් අතුරින් ජ්‍යේෂ්ඨයා වන බැවිනි.”\n\n“බ්‍රාහ්මණය, එපරිද්දෙන්ම අවිද්‍යාවෙන් පෙළෙන, බිත්තරයක් මෙන් වැසීගත්, අවිද්‍යා කවචයෙන් බැඳී සිටින සත්ව ප්‍රජාවට, අවිද්‍යා බිත්තර කවචය බිඳ දමා, මම එකම තැනැත්තා ලෙස ලෝකයේ අනුත්තර වූ සම්මා සම්බෝධියට පැමිණියෙමි. බ්‍රාහ්මණය, මම ලෝකයට ජ්‍යේෂ්ඨයා ද ශ්‍රේෂ්ඨයා ද වෙමි. බ්‍රාහ්මණය, මාගේ වීර්යය අලස බවකින් තොරව ආරම්භ කර තිබිණි. සිහිය මුළා නොවී උපස්ථිත විය. කය සන්සුන් විය, නොසන්සුන් නොවීය. සිත එකඟ විය, සමාධිගත විය.\n\n“බ්‍රාහ්මණය, මම කාමයන්ගෙන් වෙන්ව ද අකුසල ධර්මයන්ගෙන් වෙන්ව ද විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සුඛය සහිත වූ පළමු ධ්‍යානයට පැමිණ වාසය කළෙමි. විතර්ක විචාරයන් සංසිඳීමෙන්, අභ්‍යන්තර පැහැදීමෙන්, චිත්ත ඒකාග්‍රතාවයෙන්, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීති සුඛය සහිත වූ දෙවන ධ්‍යානයට පැමිණ වාසය කළෙමි. ප්‍රීතිය ද වෙන් කිරීමෙන්, උපේක්ෂාවෙන් යුතුව වාසය කරමින්, සිහි ඇතිව, මනා ප්‍රඥාවෙන් යුතුව, කයින් සුඛය අත්විඳිමින්, ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්තව, සිහි ඇතිව, සුඛ විහරණයෙන් යුක්තව වාසය කරයි’යි පවසන, තෙවන ධ්‍යානයට පැමිණ වාසය කළෙමි. සුඛය ද ප්‍රහීණ කිරීමෙන්, දුක්ඛය ද ප්‍රහීණ කිරීමෙන්, පෙර තිබූ සෝමනස්ස දෝමනස්සයන් අතුරුදන් වීමෙන්, දුක් නොවන සුඛ නොවන උපේක්ෂා සිහි පිරිසිදු බව සහිත වූ සිව්වන ධ්‍යානයට පැමිණ වාසය කළෙමි.\n\n“මා එසේ සමාධිගත වූ, පිරිසිදු වූ, පවිත්‍ර වූ, කෙලෙස් රහිත වූ, පහව ගිය උපක්ලේශ ඇති, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, චලනයෙන් තොර වූ සිත පූර්ව නිවාස අනුස්සති ඥානය සඳහා යොමු කළෙමි. මම නොයෙක් ආකාර වූ පූර්ව නිවාස සිහිපත් කළෙමි. එනම්, එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙක් සංවට්ට කල්පයන් ද, නොයෙක් විවට්ට කල්පයන් ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන් ද සිහිපත් කළෙමි. එනම්: ‘මම අසවල් තැන, මේ නම ඇති, මේ ගෝත්‍රය ඇති, මේ වර්ණය ඇති, මේ ආහාර ඇති, මෙසේ සුඛ දුක් අත්විඳිමින්, මේ ආයුෂ අවසන් කළ කෙනෙක් වීමි. මම එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එතැනද මම මේ නම ඇති, මේ ගෝත්‍රය ඇති, මේ වර්ණය ඇති, මේ ආහාර ඇති, මෙසේ සුඛ දුක් අත්විඳිමින්, මේ ආයුෂ අවසන් කළ කෙනෙක් වීමි. මම එතැනින් චුත වී මෙතැන උපන්නෙමි’ කියාය. මෙසේ ස්වභාවයන් සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පූර්ව නිවාස මම සිහිපත් කළෙමි. බ්‍රාහ්මණය, රාත්‍රියේ පළමු යාමයේදී මා විසින් මේ පළමු විද්‍යාව අවබෝධ කරගන්නා ලදි. අවිද්‍යාව පහ කරන ලදි. විද්‍යාව පහළ විය. අන්ධකාරය දුරු කරන ලදි. ආලෝකය පහළ විය. යම්සේ අප්‍රමාදීව, වීර්යවත්ව, ස්වකීය සිත යොදවා වාසය කරන කෙනෙකුට එය සිදු වේද එසේය. බ්‍රාහ්මණය, කිකිළි පැටවෙකුට බිත්තර කවචයෙන් පිටතට ඒම මෙන්, මාගේ මේ පළමු අවබෝධය විය.\n\n“මා එසේ සමාධිගත වූ, පිරිසිදු වූ, පවිත්‍ර වූ, කෙලෙස් රහිත වූ, පහව ගිය උපක්ලේශ ඇති, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, චලනයෙන් තොර වූ සිත සත්වයන්ගේ චුති-උපත් ඥානය සඳහා යොමු කළෙමි. මම පිරිසිදු, මනුෂ්‍ය ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින්, සත්වයන් චුත වන අයුරු ද උපදින අයුරු ද, හීන වූ අය ද ප්‍රණීත වූ අය ද, සුන්දර වූ අය ද අවලක්ෂණ වූ අය ද, සුගතිගාමී වූ අය ද දුර්ගතිගාමී වූ අය ද දකිමි. කර්මානුරූපව ගමන් කරන සත්වයන් මෙසේ හඳුනාගනිමි: ‘මේ භවත් සත්වයෝ කාය දුෂ්චරිතයෙන් යුක්තව, වචී දුෂ්චරිතයෙන් යුක්තව, මනෝ දුෂ්චරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස කරන්නන් ලෙස, මිථ්‍යා දෘෂ්ටිකයන් ලෙස, මිථ්‍යා දෘෂ්ටික කර්ම සමාදන් වූවන් ලෙස සිටියහ. ඔවුන් කය බිඳී මරණින් පසු අපාය නම් දුර්ගතියට, විනිපාත නම් නිරයට උපන්නාහ. මේ භවත් සත්වයෝ කාය සුචරිතයෙන් යුක්තව, වචී සුචරිතයෙන් යුක්තව, මනෝ සුචරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස නොකරන්නන් ලෙස, සම්මා දෘෂ්ටිකයන් ලෙස, සම්මා දෘෂ්ටික කර්ම සමාදන් වූවන් ලෙස සිටියහ. ඔවුන් කය බිඳී මරණින් පසු සුගතියට, ස්වර්ග ලෝකයට උපන්නාහ’ කියාය. මෙසේ පිරිසිදු, මනුෂ්‍ය ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින්, සත්වයන් චුත වන අයුරු ද උපදින අයුරු ද, හීන වූ අය ද ප්‍රණීත වූ අය ද, සුන්දර වූ අය ද අවලක්ෂණ වූ අය ද, සුගතිගාමී වූ අය ද දුර්ගතිගාමී වූ අය ද දකිමි. කර්මානුරූපව ගමන් කරන සත්වයන් හඳුනාගනිමි. බ්‍රාහ්මණය, රාත්‍රියේ මැද යාමයේදී මා විසින් මේ දෙවන විද්‍යාව අවබෝධ කරගන්නා ලදි. අවිද්‍යාව පහ කරන ලදි. විද්‍යාව පහළ විය. අන්ධකාරය දුරු කරන ලදි. ආලෝකය පහළ විය. යම්සේ අප්‍රමාදීව, වීර්යවත්ව, ස්වකීය සිත යොදවා වාසය කරන කෙනෙකුට එය සිදු වේද එසේය. බ්‍රාහ්මණය, කිකිළි පැටවෙකුට බිත්තර කවචයෙන් පිටතට ඒම මෙන්, මාගේ මේ දෙවන අවබෝධය විය.\n\n“මා එසේ සමාධිගත වූ, පිරිසිදු වූ, පවිත්‍ර වූ, කෙලෙස් රහිත වූ, පහව ගිය උපක්ලේශ ඇති, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, චලනයෙන් තොර වූ සිත ආශ්‍රව ක්ෂය ඥානය සඳහා යොමු කළෙමි. මම ‘මෙය දුකයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. ‘මෙය දුක හටගැනීමයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. ‘මෙය දුක නැතිකිරීමයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. ‘මෙය දුක නැති කිරීමට යන මාර්ගයයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. ‘මේවා ආශ්‍රවයෝ’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. ‘මෙය ආශ්‍රවයන් හටගැනීමයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. ‘මෙය ආශ්‍රවයන් නැතිකිරීමයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. ‘මෙය ආශ්‍රවයන් නැති කිරීමට යන මාර්ගයයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කළෙමි. මා මෙසේ දන්නා, මෙසේ දකින කල්හි කාමාශ්‍රවයෙන් ද සිත මිදුණේය. භවාශ්‍රවයෙන් ද සිත මිදුණේය. අවිද්‍යාශ්‍රවයෙන් ද සිත මිදුණේය. මිදුණ කල්හි, ‘මිදුණා’ යන ඥානය ඇති විය. ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව වාසය කරන ලදි, කළ යුතු දේ කරන ලදි, මේ තත්ත්වයෙන් (අර්හත් බවෙන්) පසුව තවත් භවයක් නැත’ කියා අවබෝධ කළෙමි. බ්‍රාහ්මණය, රාත්‍රියේ අවසාන යාමයේදී මා විසින් මේ තෙවන විද්‍යාව අවබෝධ කරගන්නා ලදි. අවිද්‍යාව පහ කරන ලදි. විද්‍යාව පහළ විය. අන්ධකාරය දුරු කරන ලදි. ආලෝකය පහළ විය. යම්සේ අප්‍රමාදීව, වීර්යවත්ව, ස්වකීය සිත යොදවා වාසය කරන කෙනෙකුට එය සිදු වේද එසේය. බ්‍රාහ්මණය, කිකිළි පැටවෙකුට බිත්තර කවචයෙන් පිටතට ඒම මෙන්, මාගේ මේ තෙවන අවබෝධය විය.”\n\nමෙසේ පැවසූ කල්හි වේරංජා බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය: “භවත් ගෞතමයන් වහන්සේ ජ්‍යේෂ්ඨයෙකි, භවත් ගෞතමයන් වහන්සේ ශ්‍රේෂ්ඨයෙකි. භවත් ගෞතමයන් වහන්ස, ඉතා මනහරයි, ඉතා මනහරයි! භවත් ගෞතමයන් වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මඟ මුළා වූවෙකුට මඟ පෙන්වන්නේද, අන්ධකාරයේ තෙල් පහනක් දල්වන්නේද – ඇස් ඇත්තෝ රූප දකින්නාක් මෙන්, එසේම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරන ලදි. මම භවත් ගෞතමයන් වහන්සේ ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Verañjasuttaṃ",
      "englishTitle": "The Verañja Sutta",
      "sinhalaTitle": "වේරඤ්ඤ සූත්‍රය"
    },
    {
      "number": 12,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena sambahulā abhiññātā abhiññātā licchavī santhāgāre [sandhāgāre (ka.)] sannisinnā sannipatitā anekapariyāyena buddhassa vaṇṇaṃ bhāsanti, dhammassa vaṇṇaṃ bhāsanti, saṅghassa vaṇṇaṃ bhāsanti. Tena kho pana samayena sīho senāpati nigaṇṭhasāvako tassaṃ parisāyaṃ nisinno hoti. Atha kho sīhassa senāpatissa etadahosi – ‘‘nissaṃsayaṃ kho so bhagavā arahaṃ sammāsambuddho bhavissati, tathā hime sambahulā abhiññātā abhiññātā licchavī santhāgāre sannisinnā sannipatitā anekapariyāyena buddhassa vaṇṇaṃ bhāsanti, dhammassa vaṇṇaṃ bhāsanti, saṅghassa vaṇṇaṃ bhāsanti. Yaṃnūnāhaṃ taṃ bhagavantaṃ dassanāya upasaṅkameyyaṃ arahantaṃ sammāsambuddha’’nti. Atha kho sīho senāpati yena nigaṇṭho nāṭaputto [nāthaputto (ka. sī.), nātaputto (ka. sī.)] tenupasaṅkami; upasaṅkamitvā nigaṇṭhaṃ nāṭaputtaṃ etadavoca – ‘‘icchāmahaṃ, bhante, samaṇaṃ gotamaṃ dassanāya upasaṅkamitu’’nti. ‘‘Kiṃ pana tvaṃ, sīha, kiriyavādo samāno akiriyavādaṃ samaṇaṃ gotamaṃ dassanāya upasaṅkamissasi? Samaṇo hi, sīha, gotamo akiriyavādo, akiriyāya dhammaṃ deseti, tena ca sāvake vinetī’’ti. Atha kho sīhassa senāpatissa yo ahosi gamiyābhisaṅkhāro [gamikābhisaṅkhāro (ka. sī.) mahāva. 290] bhagavantaṃ dassanāya, so paṭippassambhi. Dutiyampi kho sambahulā abhiññātā abhiññātā licchavī santhāgāre sannisinnā sannipatitā anekapariyāyena buddhassa…pe… dhammassa…pe… saṅghassa vaṇṇaṃ bhāsanti. Dutiyampi kho sīhassa senāpatissa etadahosi – ‘‘nissaṃsayaṃ kho so bhagavā arahaṃ sammāsambuddho bhavissati, tathā hime sambahulā abhiññātā abhiññātā licchavī santhāgāre sannisinnā sannipatitā anekapariyāyena buddhassa vaṇṇaṃ bhāsanti, dhammassa…pe… saṅghassa vaṇṇaṃ bhāsanti. Yaṃnūnāhaṃ taṃ bhagavantaṃ dassanāya upasaṅkameyyaṃ arahantaṃ sammāsambuddha’’nti. Atha kho sīho senāpati yena nigaṇṭho nāṭaputto tenupasaṅkami; upasaṅkamitvā nigaṇṭhaṃ nāṭaputtaṃ etadavoca – ‘‘icchāmahaṃ, bhante, samaṇaṃ gotamaṃ dassanāya upasaṅkamitu’’nti. ‘‘Kiṃ pana tvaṃ, sīha, kiriyavādo samāno akiriyavādaṃ samaṇaṃ gotamaṃ dassanāya upasaṅkamissasi? Samaṇo hi, sīha, gotamo akiriyavādo akiriyāya dhammaṃ deseti, tena ca sāvake vinetī’’ti. Dutiyampi kho sīhassa senāpatissa yo ahosi gamiyābhisaṅkhāro bhagavantaṃ dassanāya, so paṭippassambhi. Tatiyampi kho sambahulā abhiññātā abhiññātā licchavī santhāgāre sannisinnā sannipatitā anekapariyāyena buddhassa…pe… dhammassa…pe… saṅghassa vaṇṇaṃ bhāsanti. Tatiyampi kho sīhassa senāpatissa etadahosi – ‘‘nissaṃsayaṃ kho so bhagavā arahaṃ sammāsambuddho bhavissati, tathā hime sambahulā abhiññātā abhiññātā licchavī santhāgāre sannisinnā sannipatitā anekapariyāyena buddhassa vaṇṇaṃ bhāsanti, dhammassa vaṇṇaṃ bhāsanti, saṅghassa vaṇṇaṃ bhāsanti. Kiṃ hime karissanti nigaṇṭhā apalokitā vā anapalokitā vā? Yaṃnūnāhaṃ anapaloketvāva nigaṇṭhe [nigaṇṭhaṃ (syā. ka.) mahāva. 290 passitabbaṃ] taṃ bhagavantaṃ dassanāya upasaṅkameyyaṃ arahantaṃ sammāsambuddha’’nti. Atha kho sīho senāpati pañcamattehi rathasatehi divādivassa vesāliyā niyyāsi bhagavantaṃ dassanāya. Yāvatikā yānassa bhūmi, yānena gantvā yānā paccorohitvā pattikova agamāsi. Atha kho sīho senāpati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sīho senāpati bhagavantaṃ etadavoca – ‘‘Sutaṃ metaṃ, bhante – ‘akiriyavādo samaṇo gotamo, akiriyāya dhammaṃ deseti, tena ca sāvake vinetī’ti. Ye te, bhante, evamāhaṃsu – ‘akiriyavādo samaṇo gotamo, akiriyāya dhammaṃ deseti, tena ca sāvake vinetī’ti, kacci te, bhante, bhagavato vuttavādino na ca bhagavantaṃ abhūtena abbhācikkhanti dhammassa cānudhammaṃ byākaronti na ca koci sahadhammiko vādānuvādo [vādānupāto (ka. sī. syā.) a. ni. 3.58; 5.5] gārayhaṃ ṭhānaṃ āgacchati? Anabbhakkhātukāmā hi mayaṃ, bhante, bhagavanta’’nti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘akiriyavādo samaṇo gotamo, akiriyāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘kiriyavādo samaṇo gotamo, kiriyāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘ucchedavādo samaṇo gotamo, ucchedāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘jegucchī samaṇo gotamo, jegucchitāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘venayiko samaṇo gotamo, vinayāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘tapassī samaṇo gotamo, tapassitāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘apagabbho samaṇo gotamo, apagabbhatāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Atthi, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘assāsako samaṇo gotamo, assāsāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘akiriyavādo samaṇo gotamo, akiriyāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Ahañhi, sīha, akiriyaṃ vadāmi kāyaduccaritassa vacīduccaritassa manoduccaritassa; anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ akiriyaṃ vadāmi. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘akiriyavādo samaṇo gotamo, akiriyāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘kiriyavādo samaṇo gotamo, kiriyāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Ahañhi, sīha, kiriyaṃ vadāmi kāyasucaritassa vacīsucaritassa manosucaritassa; anekavihitānaṃ kusalānaṃ dhammānaṃ kiriyaṃ vadāmi. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘kiriyavādo samaṇo gotamo, kiriyāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘ucchedavādo samaṇo gotamo, ucchedāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Ahañhi, sīha, ucchedaṃ vadāmi rāgassa dosassa mohassa; anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ ucchedaṃ vadāmi. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘ucchedavādo samaṇo gotamo, ucchedāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘jegucchī samaṇo gotamo, jegucchitāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Ahañhi, sīha, jigucchāmi kāyaduccaritena vacīduccaritena manoduccaritena; jigucchāmi anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘jegucchī samaṇo gotamo, jegucchitāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘venayiko samaṇo gotamo, vinayāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Ahañhi, sīha, vinayāya dhammaṃ desemi rāgassa dosassa mohassa; anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ vinayāya dhammaṃ desemi. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘venayiko samaṇo gotamo, vinayāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘tapassī samaṇo gotamo, tapassitāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Tapanīyāhaṃ, sīha, pāpake akusale dhamme vadāmi kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ. Yassa kho, sīha, tapanīyā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, tamahaṃ ‘tapassī’ti vadāmi. Tathāgatassa kho, sīha, tapanīyā pāpakā akusalā dhammā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘tapassī samaṇo gotamo, tapassitāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘apagabbho samaṇo gotamo, apagabbhatāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Yassa kho, sīha, āyatiṃ gabbhaseyyā punabbhavābhinibbatti pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, tamahaṃ ‘apagabbho’ti vadāmi. Tathāgatassa kho, sīha, āyatiṃ gabbhaseyyā punabbhavābhinibbatti pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘apagabbho samaṇo gotamo, apagabbhatāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. ‘‘Katamo ca, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘assāsako samaṇo gotamo, assāsāya dhammaṃ deseti, tena ca sāvake vinetī’ti? Ahañhi, sīha, assāsako paramena assāsena, assāsāya dhammaṃ desemi, tena ca sāvake vinemi. Ayaṃ kho, sīha, pariyāyo, yena maṃ pariyāyena sammā vadamāno vadeyya – ‘assāsako samaṇo gotamo, assāsāya dhammaṃ deseti, tena ca sāvake vinetī’’’ti. Evaṃ vutte sīho senāpati bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante, abhikkantaṃ, bhante… pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. ‘‘Anuviccakāraṃ kho, sīha, karohi. Anuviccakāro tumhādisānaṃ ñātamanussānaṃ sādhu hotī’’ti. ‘‘Imināpāhaṃ, bhante, bhagavato bhiyyosomattāya attamano abhiraddho, yaṃ maṃ bhagavā evamāha – ‘anuviccakāraṃ kho, sīha, karohi. Anuviccakāro tumhādisānaṃ ñātamanussānaṃ sādhu hotī’ti. Mañhi, bhante, aññatitthiyā sāvakaṃ labhitvā kevalakappaṃ vesāliṃ paṭākaṃ parihareyyuṃ – ‘sīho amhākaṃ senāpati sāvakattaṃ upagato’ti. Atha ca pana bhagavā evamāha – ‘anuviccakāraṃ, sīha, karohi. Anuviccakāro tumhādisānaṃ ñātamanussānaṃ sādhu hotī’ti. Esāhaṃ, bhante, dutiyampi bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. ‘‘Dīgharattaṃ kho te, sīha, nigaṇṭhānaṃ opānabhūtaṃ kulaṃ, yena nesaṃ upagatānaṃ piṇḍakaṃ dātabbaṃ maññeyyāsī’’ti. ‘‘Imināpāhaṃ, bhante, bhagavato bhiyyosomattāya attamano abhiraddho, yaṃ maṃ bhagavā evamāha – ‘dīgharattaṃ kho te, sīha, nigaṇṭhānaṃ opānabhūtaṃ kulaṃ, yena nesaṃ upagatānaṃ piṇḍakaṃ dātabbaṃ maññeyyāsī’ti. Sutaṃ metaṃ, bhante – ‘samaṇo gotamo evamāha – mayhameva dānaṃ dātabbaṃ, mayhameva sāvakānaṃ dātabbaṃ; mayhameva dinnaṃ mahapphalaṃ, na aññesaṃ dinnaṃ mahapphalaṃ; mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, na aññesaṃ sāvakānaṃ dinnaṃ mahapphala’nti, atha ca pana maṃ bhagavā nigaṇṭhesupi dāne samādapeti [samādāpeti (?)]. Api ca, bhante, mayamettha kālaṃ jānissāma. Esāhaṃ, bhante, tatiyampi bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Atha kho bhagavā sīhassa senāpatissa anupubbiṃ kathaṃ [anupubbikathaṃ (sabbattha)] kathesi, seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ, kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nekkhamme ānisaṃsaṃ pakāsesi. Yadā bhagavā aññāsi sīhaṃ senāpatiṃ kallacittaṃ muducittaṃ vinīvaraṇacittaṃ udaggacittaṃ pasannacittaṃ, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā taṃ pakāsesi – dukkhaṃ samudayaṃ nirodhaṃ maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya; evamevaṃ sīhassa senāpatissa tasmiṃyeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’’nti. Atha kho sīho senāpati diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṃkatho vesārajjappatto aparappaccayo satthusāsane bhagavantaṃ etadavoca – ‘‘adhivāsetu me, bhante, bhagavā svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho sīho senāpati bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho sīho senāpati aññataraṃ purisaṃ āmantesi – ‘‘gaccha tvaṃ, ambho purisa, pavattamaṃsaṃ jānāhī’’ti. Atha kho sīho senāpati tassā rattiyā accayena sake nivesane paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā bhagavato kālaṃ ārocāpesi – ‘‘kālo, bhante! Niṭṭhitaṃ bhatta’’nti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena sīhassa senāpatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi saddhiṃ bhikkhusaṅghena. Tena kho pana samayena sambahulā nigaṇṭhā vesāliyaṃ rathikāya rathikaṃ [rathiyāya rathiyaṃ (bahūsu)] siṅghāṭakena siṅghāṭakaṃ bāhā paggayha kandanti – ‘‘ajja sīhena senāpatinā thūlaṃ pasuṃ vadhitvā samaṇassa gotamassa bhattaṃ kataṃ. Taṃ samaṇo gotamo jānaṃ uddissakataṃ maṃsaṃ paribhuñjati paṭiccakamma’’nti. Atha kho aññataro puriso yena sīho senāpati tenupasaṅkami; upasaṅkamitvā sīhassa senāpatissa upakaṇṇake ārocesi – ‘‘yagghe, bhante, jāneyyāsi! Ete sambahulā nigaṇṭhā vesāliyaṃ rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ bāhā paggayha kandanti – ‘ajja sīhena senāpatinā thūlaṃ pasuṃ vadhitvā samaṇassa gotamassa bhattaṃ kataṃ. Taṃ samaṇo gotamo jānaṃ uddissakataṃ maṃsaṃ paribhuñjati paṭiccakamma’nti. Alaṃ ayyo dīgharattañhi te āyasmanto avaṇṇakāmā buddhassa avaṇṇakāmā dhammassa avaṇṇakāmā saṅghassa. Na ca panete āyasmanto jiridanti taṃ bhagavantaṃ asatā tucchā musā abhūtena abbhācikkhituṃ; na ca mayaṃ jīvitahetupi sañcicca pāṇaṃ jīvitā voropeyyāmā’’ti. Atha kho sīho senāpati buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho sīho senāpati bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho sīhaṃ senāpatiṃ bhagavā dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmīti. Dutiyaṃ.",
      "english": "At one time, the Blessed One was staying in Vesālī, in the Gabled Hall of the Great Wood. Now at that time, many well-known and distinguished Licchavis were sitting together, gathered in the assembly hall, speaking in many ways in praise of the Buddha, in praise of the Dhamma, and in praise of the Saṅgha. At that time, General Sīha, a follower of the Nigaṇṭhas, was sitting in that assembly. Then it occurred to General Sīha: \"Surely, that Blessed One must be an Arahant, a Fully Self-Enlightened One, since these many well-known and distinguished Licchavis are sitting together, gathered in the assembly hall, speaking in many ways in praise of the Buddha, in praise of the Dhamma, and in praise of the Saṅgha. What if I were to go to see that Blessed One, the Arahant, the Fully Self-Enlightened One?\" Then General Sīha approached Nigaṇṭha Nāṭaputta, and having approached him, he said to Nigaṇṭha Nāṭaputta: \"Venerable sir, I wish to go to see the ascetic Gotama.\" \"But Sīha, being one who teaches action, why do you wish to go to see the ascetic Gotama, who teaches non-action? Indeed, Sīha, the ascetic Gotama is a teacher of non-action; he teaches non-action, and by that he trains his disciples.\" Then the impulse that General Sīha had to go see the Blessed One subsided. A second time, many well-known and distinguished Licchavis were sitting together, gathered in the assembly hall, speaking in many ways in praise of the Buddha, in praise of the Dhamma, and in praise of the Saṅgha. A second time, it occurred to General Sīha: \"Surely, that Blessed One must be an Arahant, a Fully Self-Enlightened One, since these many well-known and distinguished Licchavis are sitting together, gathered in the assembly hall, speaking in many ways in praise of the Buddha, in praise of the Dhamma, and in praise of the Saṅgha. What if I were to go to see that Blessed One, the Arahant, the Fully Self-Enlightened One?\" Then General Sīha approached Nigaṇṭha Nāṭaputta, and having approached him, he said to Nigaṇṭha Nāṭaputta: \"Venerable sir, I wish to go to see the ascetic Gotama.\" \"But Sīha, being one who teaches action, why do you wish to go to see the ascetic Gotama, who teaches non-action? Indeed, Sīha, the ascetic Gotama is a teacher of non-action; he teaches non-action, and by that he trains his disciples.\" A second time, the impulse that General Sīha had to go see the Blessed One subsided. A third time, many well-known and distinguished Licchavis were sitting together, gathered in the assembly hall, speaking in many ways in praise of the Buddha, in praise of the Dhamma, and in praise of the Saṅgha. A third time, it occurred to General Sīha: \"Surely, that Blessed One must be an Arahant, a Fully Self-Enlightened One, since these many well-known and distinguished Licchavis are sitting together, gathered in the assembly hall, speaking in many ways in praise of the Buddha, in praise of the Dhamma, and in praise of the Saṅgha. What will these Nigaṇṭhas do to me, whether I consult them or not? What if I were to go to see that Blessed One, the Arahant, the Fully Self-Enlightened One, without consulting the Nigaṇṭhas?\" Then General Sīha, with about five hundred chariots, set out from Vesālī in broad daylight to see the Blessed One. He went by vehicle as far as the ground was passable for vehicles, then he dismounted from his vehicle and proceeded on foot. Then General Sīha approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side.\n\nSeated to one side, General Sīha said to the Blessed One: \"Venerable sir, I have heard it said: 'The ascetic Gotama is a teacher of non-action; he teaches non-action, and by that he trains his disciples.' Venerable sir, are those who say this – 'The ascetic Gotama is a teacher of non-action; he teaches non-action, and by that he trains his disciples' – speaking in accordance with what the Blessed One has said, and are they not misrepresenting the Blessed One with what is untrue, and do they explain the Dhamma in accordance with the Dhamma, and is there no co-dharmic dispute or argument that would lead to censure? For we do not wish to misrepresent the Blessed One.\"\n\n\"There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a teacher of non-action; he teaches non-action, and by that he trains his disciples.' There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a teacher of action; he teaches action, and by that he trains his disciples.' There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is an annihilationist; he teaches annihilation, and by that he trains his disciples.' There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who detests; he teaches detestation, and by that he trains his disciples.' There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a disciplinarian; he teaches discipline, and by that he trains his disciples.' There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is an ascetic; he teaches ascetic practice, and by that he trains his disciples.' There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who is free from rebirth; he teaches freedom from rebirth, and by that he trains his disciples.' There is a way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who brings comfort; he teaches comfort, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a teacher of non-action; he teaches non-action, and by that he trains his disciples'? Indeed, Sīha, I teach non-doing of bad bodily conduct, bad verbal conduct, and bad mental conduct. I teach non-doing of various evil, unwholesome states. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a teacher of non-action; he teaches non-action, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a teacher of action; he teaches action, and by that he trains his disciples'? Indeed, Sīha, I teach doing of good bodily conduct, good verbal conduct, and good mental conduct. I teach doing of various wholesome states. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a teacher of action; he teaches action, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is an annihilationist; he teaches annihilation, and by that he trains his disciples'? Indeed, Sīha, I teach the annihilation of lust, hatred, and delusion. I teach the annihilation of various evil, unwholesome states. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is an annihilationist; he teaches annihilation, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who detests; he teaches detestation, and by that he trains his disciples'? Indeed, Sīha, I detest bad bodily conduct, bad verbal conduct, and bad mental conduct. I detest the accumulation of various evil, unwholesome states. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who detests; he teaches detestation, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a disciplinarian; he teaches discipline, and by that he trains his disciples'? Indeed, Sīha, I teach the discipline of lust, hatred, and delusion. I teach the discipline of various evil, unwholesome states. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is a disciplinarian; he teaches discipline, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is an ascetic; he teaches ascetic practice, and by that he trains his disciples'? Indeed, Sīha, I describe evil, unwholesome states as things to be burnt away – bad bodily conduct, bad verbal conduct, bad mental conduct. And for whomever, Sīha, these evil, unwholesome states to be burnt away have been abandoned, uprooted, made like a palm-stump, annihilated, and are no longer subject to future arising – him I call 'an ascetic'. For the Tathāgata, Sīha, these evil, unwholesome states to be burnt away have been abandoned, uprooted, made like a palm-stump, annihilated, and are no longer subject to future arising. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is an ascetic; he teaches ascetic practice, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who is free from rebirth; he teaches freedom from rebirth, and by that he trains his disciples'? And for whomever, Sīha, future conception in a womb and rebirth have been abandoned, uprooted, made like a palm-stump, annihilated, and are no longer subject to future arising – him I call 'one who is free from rebirth'. For the Tathāgata, Sīha, future conception in a womb and rebirth have been abandoned, uprooted, made like a palm-stump, annihilated, and are no longer subject to future arising. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who is free from rebirth; he teaches freedom from rebirth, and by that he trains his disciples.'\"\n\n\"And what is the way, Sīha, in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who brings comfort; he teaches comfort, and by that he trains his disciples'? Indeed, Sīha, I am one who brings comfort with the highest comfort. I teach comfort, and by that I train my disciples. This, Sīha, is the way in which one would be speaking rightly when saying of me: 'The ascetic Gotama is one who brings comfort; he teaches comfort, and by that he trains his disciples.'\"\n\nWhen this was said, General Sīha said to the Blessed One: \"Magnificent, Venerable sir! Magnificent, Venerable sir! Just as if one were to set upright what was overturned, or to reveal what was hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes could see forms—in the same way has the Dhamma been made clear in many ways by the Blessed One. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May the Blessed One accept me as a lay follower who has taken refuge from this day forth as long as life lasts.\"\n\n\"Consider carefully, Sīha. Careful consideration is good for well-known people like yourself.\"\n\n\"Venerable sir, by this I am even more pleased and satisfied with the Blessed One, that the Blessed One tells me: 'Consider carefully, Sīha. Careful consideration is good for well-known people like yourself.' For if other sects, Venerable sir, had gained me as a disciple, they would carry a banner throughout all of Vesālī, proclaiming: 'General Sīha has become our disciple!' Yet the Blessed One tells me: 'Consider carefully, Sīha. Careful consideration is good for well-known people like yourself.' A second time, Venerable sir, I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May the Blessed One accept me as a lay follower who has taken refuge from this day forth as long as life lasts.\"\n\n\"For a long time, Sīha, your family has been a source of support for the Nigaṇṭhas. You should consider giving them alms when they come.\"\n\n\"Venerable sir, by this I am even more pleased and satisfied with the Blessed One, that the Blessed One tells me: 'For a long time, Sīha, your family has been a source of support for the Nigaṇṭhas. You should consider giving them alms when they come.' Venerable sir, I have heard it said: 'The ascetic Gotama says this: \"Alms should be given only to me, alms should be given only to my disciples; that which is given to me is of great fruit, that which is given to others is not of great fruit; that which is given to my disciples is of great fruit, that which is given to the disciples of others is not of great fruit.\"' Yet the Blessed One exhorts me to give alms even to the Nigaṇṭhas! Nevertheless, Venerable sir, we will know the proper time for this. A third time, Venerable sir, I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May the Blessed One accept me as a lay follower who has taken refuge from this day forth as long as life lasts.\"\n\nThen the Blessed One gave General Sīha a graduated discourse, that is to say, a discourse on giving, a discourse on morality, a discourse on heaven; he explained the danger, the degradation, and the defilement of sensual pleasures, and the advantages of renunciation. When the Blessed One perceived that General Sīha's mind was prepared, receptive, unhindered, uplifted, and confident, he then expounded the special teaching of the Buddhas: suffering, its origin, its cessation, and the path. Just as a clean cloth, free from stains, would perfectly absorb dye, so too, right there on that very seat, General Sīha's Dhamma-eye arose, pure and stainless, realizing: \"Whatever is subject to arising is subject to cessation.\"\n\nThen General Sīha, having seen the Dhamma, attained the Dhamma, understood the Dhamma, penetrated the Dhamma, having overcome doubt, having dispelled perplexity, having gained perfect confidence, and having become independent of others in the Teacher's Dispensation, said to the Blessed One: \"Venerable sir, may the Blessed One accept a meal from me tomorrow, together with the community of bhikkhus.\" The Blessed One accepted by remaining silent. Then General Sīha, understanding the Blessed One's acceptance, rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed.\n\nThen General Sīha addressed a certain man: \"Go, good man, and find out about fresh meat.\" Then, after that night, General Sīha had exquisite hard and soft food prepared in his own residence and announced the time to the Blessed One: \"It is time, Venerable sir! The meal is ready.\" Then the Blessed One, having dressed in the morning, took his bowl and robe and went to General Sīha's residence, and having arrived, he sat down on the prepared seat together with the community of bhikkhus.\n\nNow at that time, many Nigaṇṭhas were crying out in Vesālī, going from street to street and from crossroads to crossroads, with arms upraised: \"Today, General Sīha has killed a large animal and prepared a meal for the ascetic Gotama. The ascetic Gotama knowingly eats meat specifically prepared for him, meat obtained through another's action.\" Then a certain man approached General Sīha, and having approached, he whispered in General Sīha's ear: \"Please, Venerable sir, be aware! These many Nigaṇṭhas are crying out in Vesālī, going from street to street and from crossroads to crossroads, with arms upraised: 'Today, General Sīha has killed a large animal and prepared a meal for the ascetic Gotama. The ascetic Gotama knowingly eats meat specifically prepared for him, meat obtained through another's action.' Enough, good sir. For a long time, these venerable ones have been eager to malign the Buddha, to malign the Dhamma, and to malign the Saṅgha. Indeed, these venerable ones are not shy about disparaging the Blessed One with what is false, empty, vain, and untrue. We ourselves would not intentionally deprive any living being of life, even for the sake of our own lives.\"\n\nThen General Sīha, with his own hands, satisfied and amply fed the community of bhikkhus headed by the Buddha with exquisite hard and soft food. When the Blessed One had finished eating and had withdrawn his hand from the bowl, General Sīha sat down to one side. The Blessed One then, with a Dhamma talk, instructed, encouraged, inspired, and delighted General Sīha, who was sitting to one side. Then he rose from his seat and departed.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ වෛශාලී නුවර මහවනයෙහි කූටාගාර ශාලාවෙහි වැඩ සිටින සේක. එකල බොහෝ ප්‍රකට ලිච්ඡවී රජවරු සන්ථාගාරයෙහි රැස්වී, එක්රැස්වී, නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේ ගුණ වර්ණනා කරති, ධර්මයෙහි ගුණ වර්ණනා කරති, සංඝයා වහන්සේගේ ගුණ වර්ණනා කරති. එකල නිගණ්ඨ ශ්‍රාවකයෙකු වූ සිංහ සේනාපති ඒ පිරිස අතර වාඩි වී සිටියේය. එවිට සිංහ සේනාපතිට මෙසේ සිතුණි: \"නියත වශයෙන්ම ඒ භාග්‍යවතුන් වහන්සේ අරහත් සම්මාසම්බුදුන් වහන්සේ වන සේක. මේ ප්‍රකට ප්‍රකට ලිච්ඡවීවරු සන්ථාගාරයෙහි රැස්වී, එක්රැස්වී, නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේ ගුණ වර්ණනා කරති, ධර්මයෙහි ගුණ වර්ණනා කරති, සංඝයා වහන්සේගේ ගුණ වර්ණනා කරති. කෙසේ හෝ මම ඒ අරහත් සම්මාසම්බුදුන් වහන්සේ දැකීමට යන්නෙම් නම්.\"\n\nඉක්බිති සිංහ සේනාපති නිගණ්ඨ නාටපුත්ත වෙත පැමිණියේය. පැමිණ නිගණ්ඨ නාටපුත්තට මෙසේ කීවේය: \"ස්වාමීනි, මම ශ්‍රමණ ගෞතමයන් වහන්සේ දැකීමට යාමට කැමැත්තෙමි.\" \"සිංහය, ඔබ ක්‍රියා වාදියෙක්ව සිටිමින් අක්‍රියා වාදියෙකු වූ ශ්‍රමණ ගෞතමයන් වහන්සේ දැකීමට යන්නේ ඇයි? සිංහය, ශ්‍රමණ ගෞතමයන් වහන්සේ අක්‍රියා වාදියෙකි, අක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි.\" එවිට සිංහ සේනාපතිට භාග්‍යවතුන් වහන්සේ දැකීමට තිබූ ගමනට වූ අදහස දුර්වල විය.\n\nදෙවන වරටත් බොහෝ ප්‍රකට ලිච්ඡවී රජවරු සන්ථාගාරයෙහි රැස්වී, එක්රැස්වී, නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේ ගුණ වර්ණනා කළහ, ධර්මයෙහි ගුණ වර්ණනා කළහ, සංඝයා වහන්සේගේ ගුණ වර්ණනා කළහ. දෙවන වරටත් සිංහ සේනාපතිට මෙසේ සිතුණි: \"නියත වශයෙන්ම ඒ භාග්‍යවතුන් වහන්සේ අරහත් සම්මාසම්බුදුන් වහන්සේ වන සේක. මේ ප්‍රකට ප්‍රකට ලිච්ඡවීවරු සන්ථාගාරයෙහි රැස්වී, එක්රැස්වී, නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේ ගුණ වර්ණනා කරති, ධර්මයෙහි ගුණ වර්ණනා කරති, සංඝයා වහන්සේගේ ගුණ වර්ණනා කරති. කෙසේ හෝ මම ඒ අරහත් සම්මාසම්බුදුන් වහන්සේ දැකීමට යන්නෙම් නම්.\"\n\nඉක්බිති සිංහ සේනාපති නිගණ්ඨ නාටපුත්ත වෙත පැමිණියේය. පැමිණ නිගණ්ඨ නාටපුත්තට මෙසේ කීවේය: \"ස්වාමීනි, මම ශ්‍රමණ ගෞතමයන් වහන්සේ දැකීමට යාමට කැමැත්තෙමි.\" \"සිංහය, ඔබ ක්‍රියා වාදියෙක්ව සිටිමින් අක්‍රියා වාදියෙකු වූ ශ්‍රමණ ගෞතමයන් වහන්සේ දැකීමට යන්නේ ඇයි? සිංහය, ශ්‍රමණ ගෞතමයන් වහන්සේ අක්‍රියා වාදියෙකි, අක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි.\" දෙවන වරටත් සිංහ සේනාපතිට භාග්‍යවතුන් වහන්සේ දැකීමට තිබූ ගමනට වූ අදහස දුර්වල විය.\n\nතුන්වන වරටත් බොහෝ ප්‍රකට ලිච්ඡවී රජවරු සන්ථාගාරයෙහි රැස්වී, එක්රැස්වී, නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේ ගුණ වර්ණනා කළහ, ධර්මයෙහි ගුණ වර්ණනා කළහ, සංඝයා වහන්සේගේ ගුණ වර්ණනා කළහ. තුන්වන වරටත් සිංහ සේනාපතිට මෙසේ සිතුණි: \"නියත වශයෙන්ම ඒ භාග්‍යවතුන් වහන්සේ අරහත් සම්මාසම්බුදුන් වහන්සේ වන සේක. මේ ප්‍රකට ප්‍රකට ලිච්ඡවීවරු සන්ථාගාරයෙහි රැස්වී, එක්රැස්වී, නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේ ගුණ වර්ණනා කරති, ධර්මයෙහි ගුණ වර්ණනා කරති, සංඝයා වහන්සේගේ ගුණ වර්ණනා කරති. මේ නිගණ්ඨයෝ මා නොදන්වා හෝ දැනුම් දී හෝ කුමක් කරන්නද? කෙසේ හෝ මම නිගණ්ඨයන්ට නොදන්වාම ඒ අරහත් සම්මාසම්බුදුන් වහන්සේ දැකීමට යන්නෙම් නම්.\"\n\nඉක්බිති සිංහ සේනාපති රථ පන්සියයකින් යුතුව දහවල් කාලයේ වෛශාලී නුවරින් පිටත් වී භාග්‍යවතුන් වහන්සේ දැකීමට ගමන් කළේය. යානාවට යා හැකි දුරක් යානාවෙන් ගොස්, යානාවෙන් බැස, පයින්ම ගමන් කළේය. ඉක්බිති සිංහ සේනාපති භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය.\n\nඑක් පසෙකින් වාඩි වී සිටි සිංහ සේනාපති භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, මට අසන්නට ලැබුණි - 'ශ්‍රමණ ගෞතමයන් වහන්සේ අක්‍රියා වාදියෙකි, අක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' කියා. ස්වාමීනි, යම් කෙනෙක් මෙසේ කියත්ද - 'ශ්‍රමණ ගෞතමයන් වහන්සේ අක්‍රියා වාදියෙකි, අක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' කියා - ඒ අය භාග්‍යවතුන් වහන්සේගේ වචන කියන්නෝ වෙත්ද? භාග්‍යවතුන් වහන්සේට අභූත චෝදනා නොකරත්ද? ධර්මයට අනුකූලව කරුණු පැහැදිලි කරතිද? කිසිදු ධර්මානුකූල වාදයක් නින්දාවට ලක්වන තැනකට නොපැමිණේද? ස්වාමීනි, භාග්‍යවතුන් වහන්සේට අභූත චෝදනා කිරීමට අපි අකමැත්තෙමු.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ අක්‍රියා වාදියෙකි, අක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ ක්‍රියා වාදියෙකි, ක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ උච්ඡේදවාදියෙකි, උච්ඡේදය උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ පිළිකුල් කරන්නෙකි (ජිගුච්ඡී), පිළිකුල් කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ වෛනයිකයෙකි (දුරු කරන්නෙකි), දුරු කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ තපස්සියෙකි (තපස් කරන්නේකි), තපස් කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ අපගබ්භයෙකි (ගැබ් සයනයෙන් තොර වූවෙකි), අපගබ්භභාවය උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ ආශ්වාසකයෙකි (සැනසීම දෙන), සැනසීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්, එයට ක්‍රමයක් ඇත.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ අක්‍රියා වාදියෙකි, අක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, මම නම් කයෙන් කරන දුශ්චරිතයෙහි, වචනයෙන් කරන දුශ්චරිතයෙහි, සිතින් කරන දුශ්චරිතයෙහි අක්‍රියාව දේශනා කරමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන්හි අක්‍රියාව මම දේශනා කරමි. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ අක්‍රියා වාදියෙකි, අක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ ක්‍රියා වාදියෙකි, ක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, මම නම් කයෙන් කරන සුචරිතයෙහි, වචනයෙන් කරන සුචරිතයෙහි, සිතින් කරන සුචරිතයෙහි ක්‍රියාව දේශනා කරමි. නොයෙක් ආකාර වූ කුසල ධර්මයන්හි ක්‍රියාව මම දේශනා කරමි. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ ක්‍රියා වාදියෙකි, ක්‍රියාව උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ උච්ඡේදවාදියෙකි, උච්ඡේදය උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, මම නම් රාගයෙහි, ද්වේෂයෙහි, මෝහයෙහි උච්ඡේදය (මුලින් සිඳලීම) දේශනා කරමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන්හි උච්ඡේදය මම දේශනා කරමි. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ උච්ඡේදවාදියෙකි, උච්ඡේදය උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ පිළිකුල් කරන්නෙකි (ජිගුච්ඡී), පිළිකුල් කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, මම නම් කයෙන් කරන දුශ්චරිතය, වචනයෙන් කරන දුශ්චරිතය, සිතින් කරන දුශ්චරිතය පිළිකුල් කරමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන් හා සම වැදීම මම පිළිකුල් කරමි. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ පිළිකුල් කරන්නෙකි (ජිගුච්ඡී), පිළිකුල් කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ වෛනයිකයෙකි (දුරු කරන්නෙකි), දුරු කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, මම නම් රාගයෙහි, ද්වේෂයෙහි, මෝහයෙහි දුරු කිරීම (විනය) උදෙසා ධර්මය දේශනා කරමි. නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන් දුරු කිරීම උදෙසා ධර්මය දේශනා කරමි. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ වෛනයිකයෙකි (දුරු කරන්නෙකි), දුරු කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ තපස්සියෙකි (තපස් කරන්නේකි), තපස් කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, මම නම් කයෙන් කරන දුශ්චරිතය, වචනයෙන් කරන දුශ්චරිතය, සිතින් කරන දුශ්චරිතය යන පාපී අකුසල ධර්මයන් තාපනීය (පිළිස්සෙන/දවන) ධර්මයන් ලෙස දේශනා කරමි. සිංහය, යම් කෙනෙකුගේ තාපනීය වූ පාපී අකුසල ධර්මයන් ප්‍රහීණ කරනු ලැබූ, මුලින් උදුරා දමන ලද, තල් ගසක මුදුන කපා දැමුවා සේ නැති කරන ලද, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද, අනාගතයේ නොකෙරෙන සුලු වූ ඒවා වෙත්ද, ඒ තැනැත්තා මම 'තපස්සී' යැයි කියමි. සිංහය, තථාගතයන් වහන්සේගේ තාපනීය වූ පාපී අකුසල ධර්මයන් ප්‍රහීණ කරනු ලැබූ, මුලින් උදුරා දමන ලද, තල් ගසක මුදුන කපා දැමුවා සේ නැති කරන ලද, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද, අනාගතයේ නොකෙරෙන සුලු ඒවාය. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ තපස්සියෙකි (තපස් කරන්නේකි), තපස් කිරීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ අපගබ්භයෙකි (ගැබ් සයනයෙන් තොර වූවෙකි), අපගබ්භභාවය උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, යම් කෙනෙකුගේ අනාගතයේ ගැබ් සයනය හා නැවත භවයන්හි උපත ප්‍රහීණ කරනු ලැබූ, මුලින් උදුරා දමන ලද, තල් ගසක මුදුන කපා දැමුවා සේ නැති කරන ලද, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද, අනාගතයේ නොකෙරෙන සුලු ඒවා වෙත්ද, ඒ තැනැත්තා මම 'අපගබ්භ' යැයි කියමි. සිංහය, තථාගතයන් වහන්සේගේ අනාගතයේ ගැබ් සයනය හා නැවත භවයන්හි උපත ප්‍රහීණ කරනු ලැබූ, මුලින් උදුරා දමන ලද, තල් ගසක මුදුන කපා දැමුවා සේ නැති කරන ලද, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද, අනාගතයේ නොකෙරෙන සුලු ඒවාය. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ අපගබ්භයෙකි (ගැබ් සයනයෙන් තොර වූවෙකි), අපගබ්භභාවය උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\n\"සිංහය, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ ආශ්වාසකයෙකි (සැනසීම දෙන), සැනසීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේද, ඒ ක්‍රමය කවරේද? සිංහය, මම නම් උතුම්ම සැනසීම දෙන්නෙක්මි, සැනසීම උදෙසා ධර්මය දේශනා කරමි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවමි. සිංහය, මේ ක්‍රමයයි, යම් ආකාරයකින් මා නිවැරදිව කියන්නෙක් 'ශ්‍රමණ ගෞතමයන් වහන්සේ ආශ්වාසකයෙකි (සැනසීම දෙන), සැනසීම උදෙසා ධර්මය දේශනා කරයි, ඒ අයුරින්ම ශ්‍රාවකයන් හික්මවයි' යැයි කියන්නේ නම්.\"\n\nමෙසේ කී කල්හි සිංහ සේනාපති භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, ඉතා අලංකාරයි! ස්වාමීනි, ඉතා අලංකාරයි! ... ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අද පටන් මා දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!\"\n\n\"සිංහය, හොඳින් විමසා බලා කටයුතු කරන්න. ඔබ වැනි ප්‍රකට පුද්ගලයන්ට විමසා බලා කටයුතු කිරීම යහපත්ය.\"\n\n\"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මා හට 'සිංහය, හොඳින් විමසා බලා කටයුතු කරන්න. ඔබ වැනි ප්‍රකට පුද්ගලයන්ට විමසා බලා කටයුතු කිරීම යහපත්ය' යැයි කියන මේ කාරණයෙන් මම භාග්‍යවතුන් වහන්සේ කෙරෙහි වඩාත් සතුටට පත් වීමි, පැහැදීමට පත් වීමි. ස්වාමීනි, අන්‍ය තීර්ථකයෝ ශ්‍රාවකයෙකු ලබාගෙන මුළු වෛශාලී නුවරම කොඩි ඔසවා ප්‍රසිද්ධ කරන්නෝය - 'සිංහ සේනාපති අපගේ ශ්‍රාවක භාවයට පත් විය' කියා. එහෙත් භාග්‍යවතුන් වහන්සේ මෙසේ කියන සේක: 'සිංහය, හොඳින් විමසා බලා කටයුතු කරන්න. ඔබ වැනි ප්‍රකට පුද්ගලයන්ට විමසා බලා කටයුතු කිරීම යහපත්ය' කියා. ස්වාමීනි, මම දෙවන වරටත් භාග්‍යවතුන් වහන්සේ සරණ යමි, ධර්මය සරණ යමි, භික්ෂු සංඝයා සරණ යමි. භාග්‍යවතුන් වහන්සේ අද පටන් මා දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!\"\n\n\"සිංහය, ඔබගේ කුලය නම් දිගු කලක් තිස්සේ නිගණ්ඨයන්ට උල්පතක් (දානය දෙන තැනක්) වී ඇත. එම නිසා ඔවුන් පැමිණි විට ඔවුන්ට දානයක් දිය යුතු යැයි සලකන්න.\"\n\n\"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ 'සිංහය, ඔබගේ කුලය නම් දිගු කලක් තිස්සේ නිගණ්ඨයන්ට උල්පතක් වී ඇත. එම නිසා ඔවුන් පැමිණි විට ඔවුන්ට දානයක් දිය යුතු යැයි සලකන්න' යැයි කියන මේ කාරණයෙන් මම භාග්‍යවතුන් වහන්සේ කෙරෙහි වඩාත් සතුටට පත් වීමි, පැහැදීමට පත් වීමි. ස්වාමීනි, මට අසන්නට ලැබුණි - 'ශ්‍රමණ ගෞතමයන් වහන්සේ මෙසේ කියන සේක - මටම දානය දිය යුතුය, මගේම ශ්‍රාවකයන්ට දානය දිය යුතුය; මට දුන් දානය මහත් ඵල මහානිසංස ඇති කරයි, අන්‍යයන්ට දුන් දානය මහත් ඵල මහානිසංස ඇති නොකරයි; මගේම ශ්‍රාවකයන්ට දුන් දානය මහත් ඵල මහානිසංස ඇති කරයි, අන්‍ය ශ්‍රාවකයන්ට දුන් දානය මහත් ඵල මහානිසංස ඇති නොකරයි' කියා. එහෙත් භාග්‍යවතුන් වහන්සේ නිගණ්ඨයන්ට පවා දානය දීමට මා පොලඹවන සේක. තවද, ස්වාමීනි, අපි මේ පිළිබඳව කාලය දැනගන්නෙමු (නිසි වේලාව බලමු). ස්වාමීනි, මම තුන්වන වරටත් භාග්‍යවතුන් වහන්සේ සරණ යමි, ධර්මය සරණ යමි, භික්ෂු සංඝයා සරණ යමි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අද පටන් මා දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!\"\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ සිංහ සේනාපතිට අනුපූර්ව කථාව දේශනා කළ සේක. එනම්: දාන කථාව, සීල කථාව, ස්වර්ග කථාව; කාමයන්ගේ ආදීනවය, අවකැරය, කෙලෙස් සහිත බව; නෛෂ්ක්‍රම්‍යයෙහි (කාමයන්ගෙන් වෙන්වීමේ) ආනිසංස ප්‍රකාශ කළ සේක.\n\nභාග්‍යවතුන් වහන්සේ සිංහ සේනාපතිගේ සිත කල්ප සිතක්, මෘදු සිතක්, නීවරණ රහිත සිතක්, උදග් සිතක්, ප්‍රසන්න සිතක් බව දැනගත් විට, බුදුවරුන්ට විශේෂ වූ ධර්ම දේශනාව ප්‍රකාශ කළ සේක - දුක, දුක හටගැනීම, දුක නැති කිරීම, දුක නැති කරන මාර්ගය. යම්සේ කිලිටි රහිත පිරිසිදු වස්ත්‍රයක් වහාම සායම් උරාගන්නේද, එපරිද්දෙන්ම සිංහ සේනාපතිට ඒ ආසනයේම කෙලෙස් රහිත, මල රහිත ධර්ම චක්ෂුව පහළ විය - \"යමක් හටගැනීමේ ස්වභාවයෙන් යුක්තද, ඒ සියල්ල නැතිවීමේ ස්වභාවයෙන් යුක්තය\" යනුවෙනි.\n\nඉක්බිති ධර්මය දැකපු, ධර්මය අවබෝධ කළ, ධර්මය තේරුම්ගත්, ධර්මයෙහි ගැඹුරට පිවිසුණු, සැකයෙන් එතෙර වූ, කවරක්දැයි යන සැකයෙන් තොර වූ, නිර්භීත භාවයට පත් වූ, ශාස්තෘන් වහන්සේගේ ශාසනයෙහි අන්‍යයන්ගෙන් ස්වායත්ත වූ සිංහ සේනාපති භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ හෙට දවස සඳහා භික්ෂු සංඝයා සමග මගේ භෝජනය පිළිගන්නා සේක්වා!\" භාග්‍යවතුන් වහන්සේ නිශ්ශබ්ද භාවයෙන් එය පිළිගත් සේක. ඉක්බිති සිංහ සේනාපති භාග්‍යවතුන් වහන්සේගේ පිළිගැනීම දැනගෙන, ආසනයෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කර, ප්‍රදක්ෂිණා කර පිටව ගියේය.\n\nඉක්බිති සිංහ සේනාපති යම්කිසි පුරුෂයෙකු අමතා මෙසේ කීවේය: \"ඇවැත් පුරුෂය, ගොස් (අප උදෙසා නොමරණ ලද) දැනට තිබෙන මස් සොයා බලව!\"\n\nඉක්බිති සිංහ සේනාපති ඒ රාත්‍රිය අවසන් වූ පසු තමන්ගේ නිවසේ ප්‍රණීත වූ කෑම බීම පිළියෙළ කරවා භාග්‍යවතුන් වහන්සේට කාලය දැන්වූයේය: \"ස්වාමීනි, කාලයයි! දානය සූදානම්ය.\" ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන, සිංහ සේනාපතිගේ නිවස වෙත වැඩිය සේක. වැඩමකර, භික්ෂු සංඝයා සමග පනවා තිබූ ආසනයෙහි වැඩ සිටි සේක.\n\nඑකල බොහෝ නිගණ්ඨයෝ වෛශාලී නුවර වීථියෙන් වීථියට, හන්දි හන්දියට, දෑත් ඔසවාගෙන කෑගසති: \"අද සිංහ සේනාපති මහත් සත්වයෙකු මරා ශ්‍රමණ ගෞතමයන් වහන්සේට දානයක් පිළියෙළ කළේය. ඒ ශ්‍රමණ ගෞතමයන් වහන්සේ දැන දැනම, තමන් උදෙසාම මරවන ලද මස් අනුභව කරයි, එය අකුසල කර්මයකි.\"\n\nඉක්බිති යම්කිසි පුරුෂයෙක් සිංහ සේනාපති වෙත පැමිණියේය. පැමිණ සිංහ සේනාපතිගේ කනට කර මෙසේ කීවේය: \"පින්වත, දැනගත යුතුයි! මේ බොහෝ නිගණ්ඨයෝ වෛශාලී නුවර වීථියෙන් වීථියට, හන්දි හන්දියට, දෑත් ඔසවාගෙන කෑගසති - 'අද සිංහ සේනාපති මහත් සත්වයෙකු මරා ශ්‍රමණ ගෞතමයන් වහන්සේට දානයක් පිළියෙළ කළේය. ඒ ශ්‍රමණ ගෞතමයන් වහන්සේ දැන දැනම, තමන් උදෙසාම මරවන ලද මස් අනුභව කරයි, එය අකුසල කර්මයකි' කියා. ඒ පින්වතුන් වහන්සේලා බුදුරජාණන් වහන්සේට අපකීර්ති කිරීමට කැමති අයයි, ධර්මයට අපකීර්ති කිරීමට කැමති අයයි, සංඝයාට අපකීර්ති කිරීමට කැමති අයයි. ඒ පින්වතුන් වහන්සේලා ඒ භාග්‍යවතුන් වහන්සේට අසත්‍ය වූ, හිස් වූ, බොරු වූ, අභූත චෝදනා කිරීමට ලැජ්ජා නොවෙති. අප නම් දිවි පිණිස වත් සිතා මතා සතෙකුගේ ජීවිතය නැති නොකරන්නෙමු.\"\n\nඉක්බිති සිංහ සේනාපති බුදුරජාණන් වහන්සේ ප්‍රමුඛ භික්ෂු සංඝයාට ප්‍රණීත කෑම බීම වලින් ස්වකීය අතින් සතුටු කළේය, පිරිනැමුවේය. ඉක්බිති සිංහ සේනාපති භාග්‍යවතුන් වහන්සේ දානය වළඳා, පාත්‍රයෙන් අත ඉවත් කළ පසු, එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි සිංහ සේනාපතිට භාග්‍යවතුන් වහන්සේ ධර්ම කථාවකින් පෙන්වා, සමාදන් කරවා, උත්සාහවත් කරවා, සතුටු කරවා, ආසනයෙන් නැගිට පිටත් වී වදාළ සේක. දෙවැන්න.",
      "paliTitle": "Sīhasuttaṃ",
      "englishTitle": "The Lion Discourse",
      "sinhalaTitle": "සිංහ සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "‘‘Aṭṭhahi, bhikkhave, aṅgehi samannāgato rañño bhaddo assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi aṭṭhahi? Idha, bhikkhave, rañño bhaddo assājānīyo ubhato sujāto hoti – mātito ca pitito ca. Yassaṃ disāyaṃ aññepi bhaddā assājānīyā jāyanti, tassaṃ disāyaṃ jāto hoti. Yaṃ kho panassa bhojanaṃ denti – allaṃ vā sukkhaṃ vā – taṃ sakkaccaṃyeva paribhuñjati avikiranto. Jegucchī hoti uccāraṃ vā passāvaṃ vā abhinisīdituṃ vā abhinipajjituṃ vā. Sorato hoti sukhasaṃvāso, na ca aññe asse ubbejetā. Yāni kho panassa honti [yāni kho panassa tāni (syā.)] sāṭheyyāni kūṭeyyāni jimheyyāni vaṅkeyyāni, tāni yathābhūtaṃ sārathissa āvikattā hoti. Tesamassa sārathi abhinimmadanāya vāyamati. Vāhī kho pana hoti. ‘Kāmaññe assā vahantu vā mā vā, ahamettha vahissāmī’ti cittaṃ uppādeti. Gacchanto kho pana ujumaggeneva gacchati. Thāmavā hoti yāva jīvitamaraṇapariyādānā thāmaṃ upadaṃsetā. Imehi kho, bhikkhave, aṭṭhahi aṅgehi samannāgato rañño bhaddo assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Yaṃ kho panassa bhojanaṃ denti – lūkhaṃ vā paṇītaṃ vā – taṃ sakkaccaṃyeva paribhuñjati avihaññamāno. Jegucchī hoti kāyaduccaritena vacīduccaritena manoduccaritena; jegucchī hoti anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Sorato hoti sukhasaṃvāso, na aññe bhikkhū ubbejetā. Yāni kho panassa honti sāṭheyyāni kūṭeyyāni jimheyyāni vaṅkeyyāni, tāni yathābhūtaṃ āvikattā hoti satthari vā viññūsu vā sabrahmacārīsu. Tesamassa satthā vā viññū vā sabrahmacārī abhinimmadanāya vāyamati. Sikkhitā kho pana hoti. ‘Kāmaññe bhikkhū sikkhantu vā mā vā, ahamettha sikkhissāmī’ti cittaṃ uppādeti. Gacchanto kho pana ujumaggeneva gacchati; tatrāyaṃ ujumaggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Āraddhavīriyo viharati – ‘kāmaṃ taco ca nhāru [nahāru (sī. syā. kaṃ. pī.)] ca aṭṭhi ca avasissatu, sarīre upasussatu maṃsalohitaṃ; yaṃ taṃ purisathāmena purisavīriyena purisaparakkamena pattabbaṃ, na taṃ apāpuṇitvā vīriyassa saṇṭhānaṃ bhavissatī’ti. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Tatiyaṃ.",
      "english": "Monks, endowed with eight qualities, a good royal thoroughbred horse is worthy of a king, a possession of a king, and is counted as a king’s asset. Which eight? Here, monks, a good royal thoroughbred horse is well-born on both sides – from its mother and from its father. It is born in a region where other good thoroughbred horses are born. Whatever food is given to it – whether wet or dry – it consumes it carefully, without scattering it. It finds defecating or urinating, or sitting or lying down in its own excrement, repulsive. It is docile, easy to manage, and does not cause distress to other horses. Whatever deceit, cunning, crookedness, or deviousness it may have, it reveals them truly to its charioteer. Its charioteer then endeavors to overcome them. Furthermore, it is a bearer of burdens. It generates the thought: ‘Let other horses bear burdens or not, I will bear them here.’ Moreover, when it walks, it walks along a straight path. It is strong, demonstrating its strength until the end of its life. Monks, endowed with these eight qualities, a good royal thoroughbred horse is worthy of a king, a possession of a king, and is counted as a king’s asset.\n\nIn the same way, monks, a monk endowed with eight qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and an unsurpassed field of merit for the world. Which eight? Here, monks, a monk is virtuous, living restrained by the Patimokkha rules, perfect in conduct and domain, seeing danger in the slightest faults, and undertaking training in the training rules. Whatever food is given to him – whether coarse or refined – he consumes it carefully, without becoming disheartened. He is disgusted by misconduct of body, speech, and mind; he is disgusted by engaging in various kinds of evil and unwholesome states. He is docile, easy to live with, and does not cause distress to other monks. Whatever deceit, cunning, crookedness, or deviousness he may have, he reveals them truly to the Teacher, or to discerning fellow practitioners, or to knowledgeable companions in the holy life. Then the Teacher, or the discerning ones, or his fellow practitioners, endeavor to overcome them. Furthermore, he is one who trains. He generates the thought: ‘Let other monks train or not, I will train here.’ Moreover, when he walks, he walks along a straight path; and this straight path is as follows: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. He dwells with aroused energy, thinking: ‘Let my skin, sinews, and bones remain; let my flesh and blood dry up in my body; but I will not cease my effort until I have attained what is to be attained by human strength, human energy, and human endeavor.’ Monks, a monk endowed with these eight qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, අංග අටකින් යුක්ත රාජකීය හොඳ අශ්ව ජාතියක් රජුට සුදුසු ය, රජුට පරිභෝග කිරීමට සුදුසු ය, රජුගේ අංගයක් ලෙස ගණන් ගනු ලැබේ. ඒ අට කවරේද? මහණෙනි, මෙහිලා රාජකීය හොඳ අශ්ව ජාතියක් මවගෙන් ද පියාගෙන් ද යන දෙපසින් ම මැනවින් උපන්නේ වේ. යම් දිශාවක අන් හොඳ අශ්ව ජාතීන් උපදිත් ද, ඒ දිශාවෙහි උපන්නේ වේ. තවද, ඔහුට යම් භෝජනයක් දෙත් ද – තෙත් වූ හෝ වියළි වූ හෝ – එය නොවිසිරුවා මැනවින් පරිභෝග කරන්නේ ය. මල-මුත්‍ර කිරීම හෝ ඒවා මත හිඳීම හෝ සැතපීම හෝ පිළිකුල් කරන්නේ ය. මිත්‍රශීලී ය, පහසුවෙන් ඇසුරු කළ හැකි ය, අන් අශ්වයන් නොපෙළන්නේ ය. තවද, ඔහුට යම් වංචා, කපටිකම්, වංකකම්, දඟකාරකම් ඇද්ද, ඒවා සැබෑ පරිදි සාරථියාට හෙළි කරන්නේ ය. ඔහුගේ සාරථියා ඒවා යටපත් කිරීමට උත්සාහ කරන්නේ ය. තවද, බර දරන්නෙක් වන්නේ ය. ‘අන් අශ්වයෝ බර දරත්වා හෝ නොදරත්වා හෝ, මම මෙහි බර දරන්නෙමි’යි සිත උපදවන්නේ ය. තවද, යනවිට සෘජු මාර්ගයෙන් ම යන්නේ ය. බල සම්පන්න ය, ජීවිතය අවසන් වන තුරු ම ශක්තිය දක්වන්නේ ය. මහණෙනි, මේ අංග අටෙන් යුක්ත රාජකීය හොඳ අශ්ව ජාතියක් රජුට සුදුසු ය, රජුට පරිභෝග කිරීමට සුදුසු ය, රජුගේ අංගයක් ලෙස ගණන් ගනු ලැබේ.\n\nඑපරිද්දෙන් ම, මහණෙනි, අංග අටකින් යුක්ත භික්ෂුවක් ආහුණෙය්‍ය (පිළිගැනීමට සුදුසු) වේ, පාහුණෙය්‍ය (අමුත්තන්ට පිදීමට සුදුසු) වේ, දක්ඛිණෙය්‍ය (දකුණත් පෙරටු කොට දීමට සුදුසු) වේ, අංජලිකරණීය (ඇඳිලි බැඳ වැඳීමට සුදුසු) වේ, ලෝකයාට අනුත්තර පුණ්‍යකෙතක් වේ. ඒ අට කවරේද? මහණෙනි, මෙහිලා භික්ෂුවක් සිල්වත් වේ, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ ආචාර ගෝචර සම්පන්නව වාසය කරයි, අණු මාත්‍ර වූ වරදෙහි ද භය දක්නා සුළු ය, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. තවද, ඔහුට යම් භෝජනයක් දෙත් ද – රළු හෝ ප්‍රණීත හෝ – එය නොපෙළෙමින් මැනවින් පරිභෝග කරන්නේ ය. කාය දුෂ්චරිතය, වචී දුෂ්චරිතය, මනෝ දුෂ්චරිතය පිළිබඳව පිළිකුල් කරන්නේ ය; නොයෙක් ආකාර වූ පාපී අකුසල ධර්මයන්ට සමවැදීම පිළිබඳව පිළිකුල් කරන්නේ ය. මිත්‍රශීලී ය, පහසුවෙන් ඇසුරු කළ හැකි ය, අන් භික්ෂූන් නොපෙළන්නේ ය. තවද, ඔහුට යම් වංචා, කපටිකම්, වංකකම්, දඟකාරකම් ඇද්ද, ඒවා සැබෑ පරිදි ශාස්තෘන් වහන්සේට හෝ නුවණැති සබ්‍රහ්මචාරීන්ට හෝ හෙළි කරන්නේ ය. ඔහුගේ ශාස්තෘන් වහන්සේ හෝ නුවණැති සබ්‍රහ්මචාරීන් හෝ ඒවා යටපත් කිරීමට උත්සාහ කරන්නේ ය. තවද, හික්මුණු කෙනෙක් වන්නේ ය. ‘අන් භික්ෂූහු හික්මෙත්වා හෝ නොහික්මෙත්වා හෝ, මම මෙහි හික්මෙන්නෙමි’යි සිත උපදවන්නේ ය. තවද, යනවිට සෘජු මාර්ගයෙන් ම යන්නේ ය; එහි මේ සෘජු මාර්ගය නම්, එනම් – සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධියයි. ඇරඹූ වීර්ය ඇතිව වාසය කරන්නේ ය – ‘කැමති සේ සම ද, නහර ද, ඇට ද ඉතිරි වේවා, ශරීරයෙහි මස් ලේ සිඳී වේළී යේවා; යම් ඒ පුරුෂ ශක්තියෙන්, පුරුෂ වීර්යයෙන්, පුරුෂ පරාක්‍රමයෙන් පැමිණිය යුතු ද, එයට නොපැමිණ වීර්යය නැවැත්වීමක් ඇති නොවන්නේ ය’යි. මහණෙනි, මේ ධර්ම අටෙන් යුක්ත භික්ෂුවක් ආහුණෙය්‍ය (පිළිගැනීමට සුදුසු) වේ, පාහුණෙය්‍ය (අමුත්තන්ට පිදීමට සුදුසු) වේ, දක්ඛිණෙය්‍ය (දකුණත් පෙරටු කොට දීමට සුදුසු) වේ, අංජලිකරණීය (ඇඳිලි බැඳ වැඳීමට සුදුසු) වේ, ලෝකයාට අනුත්තර පුණ්‍යකෙතක් වේ.",
      "paliTitle": "Assājānīyasuttaṃ",
      "englishTitle": "The Noble Horse Sutta",
      "sinhalaTitle": "අශ‍්වාජානීය සූත‍්‍රය"
    },
    {
      "number": 14,
      "pali": "‘‘Aṭṭha ca [aṭṭha (syā.)], bhikkhave, assakhaḷuṅke [assakhaluṅke (sī.)] desessāmi aṭṭha ca assadose, aṭṭha ca purisakhaḷuṅke aṭṭha ca purisadose. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katame ca, bhikkhave, aṭṭha assakhaḷuṅkā aṭṭha ca assadosā? Idha, bhikkhave, ekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā pacchato paṭikkamati, piṭṭhito rathaṃ pavatteti. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, paṭhamo assadoso. ‘‘Puna caparaṃ, bhikkhave, idhekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā pacchā laṅghati, kubbaraṃ hanati, tidaṇḍaṃ bhañjati. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, dutiyo assadoso. ‘‘Puna caparaṃ, bhikkhave, idhekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā rathīsāya satthiṃ ussajjitvā rathīsaṃyeva ajjhomaddati. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, tatiyo assadoso. ‘‘Puna caparaṃ, bhikkhave, idhekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā ummaggaṃ gaṇhati, ubbaṭumaṃ rathaṃ karoti. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, catuttho assadoso. ‘‘Puna caparaṃ, bhikkhave, idhekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā laṅghati purimakāyaṃ paggaṇhati purime pāde. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, pañcamo assadoso. ‘‘Puna caparaṃ, bhikkhave, idhekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā anādiyitvā sārathiṃ anādiyitvā patodalaṭṭhiṃ [patodaṃ (sī. pī.), patodayaṭṭhiṃ (syā. kaṃ.)] dantehi mukhādhānaṃ [mukhāṭhānaṃ (ka.)] vidhaṃsitvā yena kāmaṃ pakkamati. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, chaṭṭho assadoso. ‘‘Puna caparaṃ, bhikkhave, idhekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā neva abhikkamati no paṭikkamati tattheva khīlaṭṭhāyī ṭhito hoti. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, sattamo assadoso. ‘‘Puna caparaṃ, bhikkhave, idhekacco assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā purime ca pāde saṃharitvā pacchime ca pāde saṃharitvā [saṅkharitvā (ka.)] tattheva cattāro pāde abhinisīdati. Evarūpopi, bhikkhave, idhekacco assakhaḷuṅko hoti. Ayaṃ, bhikkhave, aṭṭhamo assadoso. Ime kho, bhikkhave, aṭṭha assakhaḷuṅkā aṭṭha ca assadosā. [vibha. 956] ‘‘Katame ca, bhikkhave, aṭṭha purisakhaḷuṅkā aṭṭha ca purisadosā? Idha, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno ‘na sarāmī’ti asatiyā nibbeṭheti. Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā pacchato paṭikkamati, piṭṭhito rathaṃ vatteti; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, paṭhamo purisadoso. ‘‘Puna caparaṃ, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno codakaṃyeva paṭippharati – ‘kiṃ nu kho tuyhaṃ bālassa abyattassa bhaṇitena! Tvampi nāma bhaṇitabbaṃ maññasī’ti! Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā pacchā laṅghati, kubbaraṃ hanati, tidaṇḍaṃ bhañjati; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, dutiyo purisadoso. ‘‘Puna caparaṃ, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno codakasseva paccāropeti – ‘tvaṃ khosi itthannāmaṃ āpattiṃ āpanno, tvaṃ tāva paṭhamaṃ paṭikarohī’ti. Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā rathīsāya satthiṃ ussajjitvā rathīsaṃyeva ajjhomaddati; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, tatiyo purisadoso. ‘‘Puna caparaṃ, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno aññenāññaṃ paṭicarati, bahiddhā kathaṃ apanāmeti, kopañca dosañca appaccayañca pātukaroti. Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā ummaggaṃ gaṇhati, ubbaṭumaṃ rathaṃ karoti; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, catuttho purisadoso. ‘‘Puna caparaṃ, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno saṅghamajjhe bāhuvikkhepaṃ karoti. Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā laṅghati, purimakāyaṃ paggaṇhati purime pāde; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, pañcamo purisadoso. ‘‘Puna caparaṃ, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno anādiyitvā saṅghaṃ anādiyitvā codakaṃ sāpattikova yena kāmaṃ pakkamati. Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā anādiyitvā sārathiṃ anādiyitvā patodalaṭṭhiṃ dantehi mukhādhānaṃ vidhaṃsitvā yena kāmaṃ pakkamati; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, chaṭṭho purisadoso. ‘‘Puna caparaṃ, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno ‘nevāhaṃ āpannomhi, na panāhaṃ āpannomhī’ti so tuṇhībhāvena saṅghaṃ viheṭheti [viheseti (pī. ka.)]. Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā neva abhikkamati no paṭikkamati tattheva khīlaṭṭhāyī ṭhito hoti; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, sattamo purisadoso. ‘‘Puna caparaṃ, bhikkhave, bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno evamāha – ‘kiṃ nu kho tumhe āyasmanto atibāḷhaṃ mayi byāvaṭā yāva [idaṃ padaṃ sīhaḷapotthake natthi] idānāhaṃ sikkhaṃ paccakkhāya hīnāyāvattissāmī’ti. So sikkhaṃ paccakkhāya hīnāyāvattitvā evamāha – ‘idāni kho tumhe āyasmanto attamanā hothā’ti? Seyyathāpi so, bhikkhave, assakhaḷuṅko ‘pehī’ti vutto, viddho samāno codito sārathinā purime ca pāde saṃharitvā pacchime ca pāde saṃharitvā tattheva cattāro pāde abhinisīdati; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco purisakhaḷuṅko hoti. Ayaṃ, bhikkhave, aṭṭhamo purisadoso. Ime kho, bhikkhave, aṭṭha purisakhaḷuṅkā aṭṭha ca purisadosā’’ti. Catutthaṃ.",
      "english": "“Monks, I shall teach you about eight faulty horses and eight faults of horses, and eight faulty individuals and eight faults of individuals. Listen to it, pay careful attention; I shall speak.” “Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One then said this:\n\n“And what, monks, are the eight faulty horses and the eight faults of horses? Here, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, retreats backward, causing the chariot to move backward. Such a faulty horse, monks, is found here. This, monks, is the first fault of a horse.\n\n“Again, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, kicks backward, strikes the pole, and breaks the crossbar. Such a faulty horse, monks, is found here. This, monks, is the second fault of a horse.\n\n“Again, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, lowers its thigh against the chariot pole, pressing itself hard against the pole itself. Such a faulty horse, monks, is found here. This, monks, is the third fault of a horse.\n\n“Again, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, takes to a wrong path, causing the chariot to be overturned. Such a faulty horse, monks, is found here. This, monks, is the fourth fault of a horse.\n\n“Again, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, leaps, raising its forequarters and its forelegs. Such a faulty horse, monks, is found here. This, monks, is the fifth fault of a horse.\n\n“Again, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, disregards the charioteer, disregards the goad-stick, and, destroying the bit with its teeth, goes wherever it wishes. Such a faulty horse, monks, is found here. This, monks, is the sixth fault of a horse.\n\n“Again, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, neither goes forward nor retreats backward, but stands still right there, as if rooted to the spot. Such a faulty horse, monks, is found here. This, monks, is the seventh fault of a horse.\n\n“Again, monks, a certain faulty horse, when told ‘Go!’, being pricked and urged by the charioteer, brings its forelegs together and its hindlegs together, and sits down right there on all four legs. Such a faulty horse, monks, is found here. This, monks, is the eighth fault of a horse. These, monks, are the eight faulty horses and the eight faults of horses.\n\n“And what, monks, are the eight faulty individuals and the eight faults of individuals? Here, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, tries to extricate himself by claiming 'I do not remember' due to forgetfulness. Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, retreats backward, causing the chariot to move backward; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the first fault of an individual.\n\n“Again, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, strikes back at the admonisher, saying: ‘What is the point of your foolish, inexperienced talk! Do you even think you are capable of speaking?’ Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, kicks backward, strikes the pole, and breaks the crossbar; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the second fault of an individual.\n\n“Again, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, turns the accusation back on the admonisher, saying: ‘You yourself have committed such-and-such an offense; you first attend to that!’ Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, lowers its thigh against the chariot pole, pressing itself hard against the pole itself; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the third fault of an individual.\n\n“Again, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, responds with irrelevant remarks, diverts the conversation outwards, and reveals anger, ill-will, and displeasure. Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, takes to a wrong path, causing the chariot to be overturned; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the fourth fault of an individual.\n\n“Again, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, makes agitated gestures in the midst of the Saṅgha. Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, leaps, raising its forequarters and its forelegs; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the fifth fault of an individual.\n\n“Again, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, disregards the Saṅgha, disregards the admonisher, and, while still guilty of the offense, goes wherever he wishes. Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, disregards the charioteer, disregards the goad-stick, and, destroying the bit with its teeth, goes wherever it wishes; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the sixth fault of an individual.\n\n“Again, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, troubles the Saṅgha with his silence, saying: ‘I have not committed an offense, nor have I committed an offense!’ Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, neither goes forward nor retreats backward, but stands still right there, as if rooted to the spot; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the seventh fault of an individual.\n\n“Again, monks, monks admonish a monk for an offense. That monk, being admonished by the monks for an offense, says: ‘Why are you Venerables so exceedingly concerned with me, so much so that I will now renounce the training and return to a lower life?’ Having renounced the training and returned to a lower life, he then says: ‘Now, Venerables, are you pleased?’ Just as that faulty horse, monks, when told ‘Go!’, being pricked and urged by the charioteer, brings its forelegs together and its hindlegs together, and sits down right there on all four legs; similar to that, I declare, is this person. Such a faulty individual, monks, is found here. This, monks, is the eighth fault of an individual. These, monks, are the eight faulty individuals and the eight faults of individuals.”",
      "sinhala": "\"මහණෙනි, අටක් වූ අශ්වදණ්ඩයන්ද, අටක් වූ අශ්වදෝෂයන්ද, අටක් වූ පුරිසදණ්ඩයන්ද, අටක් වූ පුරිසදෝෂයන්ද මම දේශනා කරන්නෙමි. එය අසන්න, මනාව මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\" \"එසේය, භාග්‍යවතුන් වහන්ස!\" කියා ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළසේක:\n\n\"මහණෙනි, අටක් වූ අශ්වදණ්ඩයෝද, අටක් වූ අශ්වදෝෂයෝද කවරහුද?\"\n\nමහණෙනි, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, පසුපසට යන්නේ, රථය පිටුපසට පදවයි. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ පළමු වන අශ්වදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, පසුපසට පනින්නේ, බඳින ලීයට පහර දෙන්නේ, ත්‍රිදණ්ඩය කඩා බිඳ දමයි. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ දෙවැනි අශ්වදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, රථීසාව සමඟ කලවා ඔසවා රථීසාවම පාගා දමයි. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ තුන්වැනි අශ්වදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, වැරදි මඟට ගොස්, රථය පෙරළා දමයි. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ සතරවැනි අශ්වදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, පනින්නේ, ඉදිරි කඳ ඔසවා, ඉදිරි පාද ඔසවයි. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ පස්වැනි අශ්වදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, සාරථියා නොතකා, කටුකෝටුව නොතකා, දත්වලින් මුඛාධනය බිඳ දමා කැමති දිශාවකට යයි. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ සයවැනි අශ්වදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, ඉදිරියට නොයයි, පසුපසට නොයයි, එතැනම ඇණයක් මෙන් සිටී. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ සත්වැනි අශ්වදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි ඇතැම් අශ්වදණ්ඩයෙක් 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, ඉදිරි පාද දෙකද එකතු කරගෙන, පසුපස පාද දෙකද එකතු කරගෙන, එතැනම සිව්පාදයෙන්ම හිඳගනී. මහණෙනි, මෙබඳු අශ්වදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ අටවැනි අශ්වදෝෂයයි.\n\nමහණෙනි, මේ අටක් වූ අශ්වදණ්ඩයෝද, අටක් වූ අශ්වදෝෂයෝද වෙති.\n\n\"මහණෙනි, අටක් වූ පුරිසදණ්ඩයෝද, අටක් වූ පුරිසදෝෂයෝද කවරහුද?\"\n\nමහණෙනි, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, 'මට මතක නැත' යැයි අසතියෙන් එය නිදහස් කරගනී. මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, පසුපසට යන්නේ, රථය පිටුපසට පදවයිද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ පළමු වන පුරිසදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, දොස් පවරන්නාටම හරස් වෙයි – 'නුඹ මෝඩ, අවිඥාත පුද්ගලයාගේ කීමට මොකක්ද? නුඹද කියන්නට යමක් ඇතැයි සිතන්නෙහිද!' මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, පසුපසට පනින්නේ, බඳින ලීයට පහර දෙන්නේ, ත්‍රිදණ්ඩය කඩා බිඳ දමයිද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ දෙවැනි පුරිසදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, දොස් පවරන්නාටම ආපසු චෝදනා කරයි – 'නුඹද මේ නමින් වූ ආපත්තියට පැමිණියෙහිය, නුඹ පළමුව එය පිළියම් කරගන්න!' මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, රථීසාව සමඟ කලවා ඔසවා රථීසාවම පාගා දමයිද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ තුන්වැනි පුරිසදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, අන් දෙයින් අන් දෙයක් ගැන කියයි, කථාව පිටතට හරවා යවයි, කෝපයද, ද්වේෂයද, අසතුටද පහළ කරයි. මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, වැරදි මඟට ගොස්, රථය පෙරළා දමයිද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ සතරවැනි පුරිසදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, සංඝයා මැද අත් විකෘති කරයි. මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, පනින්නේ, ඉදිරි කඳ ඔසවා, ඉදිරි පාද ඔසවයිද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ පස්වැනි පුරිසදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, සංඝයා නොතකා, දොස් පවරන්නා නොතකා, ආපත්තිය සහිතවම කැමති තැනකට යයි. මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, සාරථියා නොතකා, කටුකෝටුව නොතකා, දත්වලින් මුඛාධනය බිඳ දමා කැමති දිශාවකට යයිද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ සයවැනි පුරිසදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, 'මම ආපත්තියට පත් වූවෙක් නොවෙමි, ආපත්තියට පත් වූවෙක් නොවෙමි' යැයි නිශ්ශබ්දතාවයෙන් සංඝයාට හිංසා කරයි. මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, ඉදිරියට නොයයි, පසුපසට නොයයි, එතැනම ඇණයක් මෙන් සිටීද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ සත්වැනි පුරිසදෝෂයයි.\n\nමහණෙනි, තවද, මෙහි භික්ෂූහු භික්ෂුවකට ආපත්තියකින් දොස් පවරති. ඒ භික්ෂුව භික්ෂූන් විසින් ආපත්තියකින් දොස් පවරනු ලැබ, මෙසේ කියයි – 'ඇවැත්නි, නුඹලා මා කෙරෙහි මෙතරම් දැඩි ලෙස ඇලී සිටින්නේ කුමටද, දැන් මම ශික්ෂාව අත්හැර හීන මාර්ගයට හැරෙන්නෙමි.' හෙතෙම ශික්ෂාව අත්හැර හීන මාර්ගයට හැරී මෙසේ කියයි – 'ඇවැත්නි, දැන් නුඹලා සතුටු වන්නහුද?' මහණෙනි, යම්සේ ඒ අශ්වදණ්ඩයා 'යව' යැයි කී කල්හි, සාරථියා විසින් තළනු ලැබ, පොළඹවනු ලැබ, ඉදිරි පාද දෙකද එකතු කරගෙන, පසුපස පාද දෙකද එකතු කරගෙන, එතැනම සිව්පාදයෙන්ම හිඳගනීද; මහණෙනි, මේ පුද්ගලයා උපමා කරන්නේ ඒ අශ්වදණ්ඩයාටය. මහණෙනි, මෙබඳු පුරිසදණ්ඩයෙක්ද ඇත. මහණෙනි, මේ අටවැනි පුරිසදෝෂයයි.\n\nමහණෙනි, මේ අටක් වූ පුරිසදණ්ඩයෝද, අටක් වූ පුරිසදෝෂයෝද වෙති.",
      "paliTitle": "Assakhaḷuṅkasuttaṃ",
      "englishTitle": "The Colt Discourse",
      "sinhalaTitle": "දුර්දාන්ත අශ්ව සූත්‍‍රය"
    },
    {
      "number": 15,
      "pali": "‘‘Aṭṭhimāni, bhikkhave, malāni. Katamāni aṭṭha? Asajjhāyamalā, bhikkhave, mantā; anuṭṭhānamalā, bhikkhave, gharā; malaṃ, bhikkhave, vaṇṇassa kosajjaṃ; pamādo, bhikkhave, rakkhato malaṃ; malaṃ, bhikkhave, itthiyā duccaritaṃ; maccheraṃ, bhikkhave, dadato malaṃ; malā, bhikkhave, pāpakā akusalā dhammā asmiṃ loke paramhi ca; tato [tato ca (syā. pī.)], bhikkhave, malā malataraṃ avijjā paramaṃ malaṃ. Imāni kho, bhikkhave, aṭṭha malānī’’ti. ‘‘Asajjhāyamalā mantā, anuṭṭhānamalā gharā; Malaṃ vaṇṇassa kosajjaṃ, pamādo rakkhato malaṃ. ‘‘Malitthiyā duccaritaṃ, maccheraṃ dadato malaṃ; Malā ve pāpakā dhammā, asmiṃ loke paramhi ca; Tato malā malataraṃ, avijjā paramaṃ mala’’nti. pañcamaṃ;",
      "english": "Monks, these are eight impurities. Which eight? Monks, lack of recitation is the impurity of sacred texts; monks, inactivity is the impurity of houses; monks, laziness is the impurity of appearance; monks, heedlessness is the impurity of a guardian; monks, misconduct is the impurity of a woman; monks, stinginess is the impurity of a giver; monks, evil, unwholesome states are impurities in this world and in the next; monks, greater than those impurities, ignorance is the supreme impurity. Monks, these are indeed the eight impurities.\n\nLack of recitation is the impurity of sacred texts, inactivity is the impurity of houses; laziness is the impurity of appearance, heedlessness is the impurity of a guardian. Misconduct is the impurity of a woman, stinginess is the impurity of a giver; indeed, evil, unwholesome states are impurities in this world and in the next; greater than those impurities, ignorance is the supreme impurity.",
      "sinhala": "මහණෙනි, මේ මල අටකි. ඒ අට කවරේද යත්: මහණෙනි, උගත් දේ නොපෙරළීම මලයකි. මහණෙනි, ගෙවල්වලට අලස බව මලයකි. මහණෙනි, ස්වරූපයට කම්මැලිකම මලයකි. මහණෙනි, රකින්නාට ප්‍රමාදය මලයකි. මහණෙනි, ස්ත්‍රියකට දුශ්චරිතය මලයකි. මහණෙනි, දන්දෙන්නාට මසුරුකම මලයකි. මහණෙනි, මේ ලෝකයෙහිද පරලෝකයෙහිද පාපී වූ අකුසල ධර්ම මලයෝ වෙති. මහණෙනි, ඒ මලටත් වඩා මල, අවිද්‍යාව නම් වූ පරම මලය වේ. මහණෙනි, මේ මල අට වේ.\n\nඋගත් දේ නොපෙරළීම මලයකි,\nගෙවල්වලට අලස බව මලයකි;\nස්වරූපයට කම්මැලිකම මලයකි,\nරකින්නාට ප්‍රමාදය මලයකි.\n\nස්ත්‍රියකට දුශ්චරිතය මලයකි,\nදන්දෙන්නාට මසුරුකම මලයකි;\nමේ ලෝකයෙහිද පරලෝකයෙහිද පාපී ධර්ම මලයෝ වෙති;\nඒ මලටත් වඩා මල, අවිද්‍යාව නම් වූ පරම මලය වේ.",
      "paliTitle": "Malasuttaṃ",
      "englishTitle": "Discourse on Impurities",
      "sinhalaTitle": "මල සූත‍්‍රය"
    },
    {
      "number": 16,
      "pali": "[cūḷava. 347] ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu dūteyyaṃ gantumarahati. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu sotā ca hoti, sāvetā ca, uggahetā ca, dhāretā ca, viññātā ca, viññāpetā ca, kusalo ca sahitāsahitassa, no ca kalahakārako – imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu dūteyyaṃ gantumarahati. Aṭṭhahi, bhikkhave, dhammehi samannāgato sāriputto dūteyyaṃ gantumarahati. Katamehi aṭṭhahi? Idha, bhikkhave, sāriputto sotā ca hoti, sāvetā ca, uggahetā ca, dhāretā ca, viññātā ca, viññāpetā ca, kusalo ca sahitāsahitassa, no ca kalahakārako. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato sāriputto dūteyyaṃ gantumarahatī’’ti. ‘‘Yo ve na byathati [na vedhati (sī.), na byādhati (syā. pī.)] patvā, parisaṃ uggavādiniṃ [uggavādinaṃ (sī.), uggahavādinaṃ (syā. pī.), uggatavādiniṃ (ka.)]; Na ca hāpeti vacanaṃ, na ca chādeti sāsanaṃ. ‘‘Asandiddhañca bhaṇati [asandiddho ca akkhāti (cūḷava. 347)], pucchito na ca kuppati; Sa ve tādisako bhikkhu, dūteyyaṃ gantumarahatī’’ti. chaṭṭhaṃ;",
      "english": "Monks, a bhikkhu endowed with eight qualities is fit to go on a mission. What are these eight? Here, monks, a bhikkhu is a listener, an expounder, a learner, a retainer, an understander, an explainer, skilled in discerning what is beneficial and what is unbeneficial, and is not a quarrel-maker. Indeed, monks, a bhikkhu endowed with these eight qualities is fit to go on a mission. Monks, Sāriputta is endowed with eight qualities and is fit to go on a mission. What are these eight? Here, monks, Sāriputta is a listener, an expounder, a learner, a retainer, an understander, an explainer, skilled in discerning what is beneficial and what is unbeneficial, and is not a quarrel-maker. Indeed, monks, Sāriputta, endowed with these eight qualities, is fit to go on a mission.\n\nWhoever, when encountering an assembly of harsh speakers, is not disturbed; and does not neglect the word, nor conceal the teaching; and speaks without doubt, and when questioned, does not become angry – such a bhikkhu, indeed, is fit to go on a mission.",
      "sinhala": "මහණෙනි, කරුණු අටකින් යුක්ත වූ භික්ෂුවක් දූත මෙහෙවරට යාමට සුදුසු ය. කවර අටකින්ද? මහණෙනි, මෙහිලා භික්ෂුව ශ්‍රවණ කරන්නෙක් ද වෙයි, අන්‍යයන්ට අසවන්නෙක් ද වෙයි, දරාගන්නෙක් ද වෙයි, සිහි තබාගන්නෙක් ද වෙයි, අවබෝධ කරගන්නෙක් ද වෙයි, අන්‍යයන්ට අවබෝධ කරවන්නෙක් ද වෙයි, හිතකර හා අහිතකර දේ පිළිබඳ දක්ෂ යි, කලහ කරන්නෙක් ද නොවෙයි. මහණෙනි, මේ කරුණු අටින් යුක්ත වූ භික්ෂුවක් දූත මෙහෙවරට යාමට සුදුසු ය.\n\nමහණෙනි, කරුණු අටකින් යුක්ත වූ සාරිපුත්ත ස්ථවිරයන් වහන්සේ ද දූත මෙහෙවරට යාමට සුදුසු ය. කවර අටකින්ද? මහණෙනි, මෙහිලා සාරිපුත්ත ස්ථවිරයන් වහන්සේ ශ්‍රවණ කරන්නෙක් ද වෙයි, අන්‍යයන්ට අසවන්නෙක් ද වෙයි, දරාගන්නෙක් ද වෙයි, සිහි තබාගන්නෙක් ද වෙයි, අවබෝධ කරගන්නෙක් ද වෙයි, අන්‍යයන්ට අවබෝධ කරවන්නෙක් ද වෙයි, හිතකර හා අහිතකර දේ පිළිබඳ දක්ෂ යි, කලහ කරන්නෙක් ද නොවෙයි. මහණෙනි, මේ කරුණු අටින් යුක්ත වූ සාරිපුත්ත ස්ථවිරයන් වහන්සේ ද දූත මෙහෙවරට යාමට සුදුසු ය.\n\nයමෙක් ප්‍රචණ්ඩ කතා ඇති පිරිසකට පැමිණ නොසැලෙයි ද, ධර්මයේ වචන හීන නොකරයි ද, ශාසනය නොසඟවයි ද, නොසැකැවින් ධර්මය පවසයි ද, ප්‍රශ්න කළ විට නොකිපෙයි ද, ඒ වැනි භික්ෂුවක් දූත මෙහෙවරට යාමට සුදුසු ය.",
      "paliTitle": "Dūteyyasuttaṃ",
      "englishTitle": "Discourse on Messengership",
      "sinhalaTitle": "දූත සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "‘‘Aṭṭhahi, bhikkhave, ākārehi itthī purisaṃ bandhati. Katamehi aṭṭhahi? Ruṇṇena, bhikkhave, itthī purisaṃ bandhati; hasitena, bhikkhave, itthī purisaṃ bandhati; bhaṇitena, bhikkhave, itthī purisaṃ bandhati; ākappena, bhikkhave, itthī purisaṃ bandhati; vanabhaṅgena, bhikkhave, itthī purisaṃ bandhati; gandhena, bhikkhave, itthī purisaṃ bandhati; rasena, bhikkhave, itthī purisaṃ bandhati; phassena, bhikkhave, itthī purisaṃ bandhati. Imehi kho, bhikkhave, aṭṭhahākārehi itthī purisaṃ bandhati. Te, bhikkhave, sattā subaddhā [subandhā (sī. syā. ka.)], ye [yeva (syā. pī. ka.)] phassena baddhā’’ti [bandhāti (sī. syā. ka.)]. Sattamaṃ.",
      "english": "Monks, a woman binds a man by eight modes. Which eight?\nMonks, a woman binds a man by weeping; monks, a woman binds a man by smiling; monks, a woman binds a man by her speech; monks, a woman binds a man by her deportment; monks, a woman binds a man by her adornment; monks, a woman binds a man by scent; monks, a woman binds a man by taste; monks, a woman binds a man by touch. Indeed, monks, a woman binds a man by these eight modes. Monks, those beings are truly bound who are bound by touch.",
      "sinhala": "මහණෙනි, ස්ත්‍රියක් පුරුෂයෙකුව ආකාර අටකින් බඳියි. ඒ කුමන අටකින්ද?\n\nමහණෙනි, ස්ත්‍රියක් හැඬීමෙන් පුරුෂයෙකුව බඳියි; මහණෙනි, ස්ත්‍රියක් සිනාසීමෙන් පුරුෂයෙකුව බඳියි; මහණෙනි, ස්ත්‍රියක් කතාකිරීමෙන් පුරුෂයෙකුව බඳියි; මහණෙනි, ස්ත්‍රියක් ඇවතුම් පැවතුම් වලින් පුරුෂයෙකුව බඳියි; මහණෙනි, ස්ත්‍රියක් ශරීරය අලංකාර කිරීමෙන් පුරුෂයෙකුව බඳියි; මහණෙනි, ස්ත්‍රියක් සුවඳින් පුරුෂයෙකුව බඳියි; මහණෙනි, ස්ත්‍රියක් රසයෙන් පුරුෂයෙකුව බඳියි; මහණෙනි, ස්ත්‍රියක් ස්පර්ශයෙන් පුරුෂයෙකුව බඳියි. මහණෙනි, සැබවින්ම ස්ත්‍රියක් මේ ආකාර අටකින් පුරුෂයෙකුව බඳියි. මහණෙනි, ස්පර්ශයෙන් බැඳී සිටින සත්ත්වයෝ තදින්ම බැඳී සිටින්නෝය.",
      "paliTitle": "Paṭhamabandhanasuttaṃ",
      "englishTitle": "The First Bond Discourse",
      "sinhalaTitle": "පළමු බන්ධන සූත්‍රය"
    },
    {
      "number": 18,
      "pali": "‘‘Aṭṭhahi, bhikkhave, ākārehi puriso itthiṃ bandhati. Katamehi aṭṭhahi? Ruṇṇena, bhikkhave, puriso itthiṃ bandhati; hasitena, bhikkhave, puriso itthiṃ bandhati; bhaṇitena, bhikkhave, puriso itthiṃ bandhati; ākappena, bhikkhave, puriso itthiṃ bandhati; vanabhaṅgena, bhikkhave, puriso itthiṃ bandhati; gandhena, bhikkhave, puriso itthiṃ bandhati; rasena, bhikkhave, puriso itthiṃ bandhati; phassena, bhikkhave, puriso itthiṃ bandhati. Imehi kho, bhikkhave, aṭṭhahākārehi puriso itthiṃ bandhati. Te, bhikkhave, sattā subaddhā, ye phassena baddhā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a man binds a woman by eight modes. Which eight?\nMonks, a man binds a woman by weeping; monks, a man binds a woman by laughter; monks, a man binds a woman by speech; monks, a man binds a woman by demeanor; monks, a man binds a woman by adornment; monks, a man binds a woman by fragrance; monks, a man binds a woman by taste; monks, a man binds a woman by physical contact. Indeed, monks, it is by these eight modes that a man binds a woman.\n\nMonks, those beings are strongly bound who are bound by physical contact.",
      "sinhala": "මහණෙනි, පුරුෂයා ස්ත්‍රිය අට ආකාරයකින් බඳියි. ඒ කවර අටකින්ද? මහණෙනි, පුරුෂයා ස්ත්‍රිය හැඬීමෙන් බඳියි; මහණෙනි, පුරුෂයා ස්ත්‍රිය සිනාසීමෙන් බඳියි; මහණෙනි, පුරුෂයා ස්ත්‍රිය කතාවෙන් බඳියි; මහණෙනි, පුරුෂයා ස්ත්‍රිය ඇවතුමෙන් බඳියි; මහණෙනි, පුරුෂයා ස්ත්‍රිය ත්‍යාග දීමෙන් බඳියි; මහණෙනි, පුරුෂයා ස්ත්‍රිය සුවඳින් බඳියි; මහණෙනි, පුරුෂයා ස්ත්‍රිය රසයෙන් බඳියි; මහණෙනි, පුරුෂයා ස්ත්‍රිය ස්පර්ශයෙන් බඳියි. මහණෙනි, සැබවින්ම මේ අට ආකාරයෙන් පුරුෂයා ස්ත්‍රිය බඳියි. මහණෙනි, යම් සත්වයෝ ස්පර්ශයෙන් බැඳී සිටිත්ද, ඒ සත්වයෝ මනාව බැඳුනෝ වෙති.",
      "paliTitle": "Dutiyabandhanasuttaṃ",
      "englishTitle": "The Second Discourse on Bonds",
      "sinhalaTitle": "දෙවන බන්ධන සූත්‍රය"
    },
    {
      "number": 19,
      "pali": "Ekaṃ samayaṃ bhagavā verañjāyaṃ vi harati naḷerupucimandamūle. Atha kho pahārādo asurindo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho pahārādaṃ asurindaṃ bhagavā etadavoca – ‘‘Api [kiṃ (ka.)] pana, pahārāda, asurā mahāsamudde abhiramantī’’ti? ‘‘Abhiramanti, bhante, asurā mahāsamudde’’ti. ‘‘Kati pana, pahārāda, mahāsamudde acchariyā abbhutā dhammā [abbhutadhammā (syā. ka.) cūḷava. 384 passitabbaṃ], ye disvā disvā asurā mahāsamudde abhiramantī’’ti? ‘‘Aṭṭha, bhante, mahāsamudde acchariyā abbhutā dhammā, ye disvā disvā asurā mahāsamudde abhiramanti. Katame aṭṭha? Mahāsamuddo, bhante, anupubbaninno anupubbapoṇo anupubbapabbhāro, na āyatakeneva papāto. Yampi, bhante, mahāsamuddo anupubbaninno anupubbapoṇo anupubbapabbhāro, na āyatakeneva papāto. Ayaṃ, bhante, mahāsamudde paṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Puna caparaṃ, bhante, mahāsamuddo ṭhitadhammo velaṃ nātivattati. Yampi, bhante, mahāsamuddo ṭhitadhammo velaṃ nātivattati; ayaṃ [ayampi (ka.)], bhante, mahāsamudde dutiyo acchariyo abbhuto dhammo yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Puna caparaṃ, bhante, mahāsamuddo na matena kuṇapena saṃvasati [saṃvattati (syā.)]. Yaṃ hoti mahāsamudde mataṃ kuṇapaṃ, taṃ khippameva [khippaṃyeva (sī.), khippaṃeva (pī.), khippaññeva (cūḷava. 384)] tīraṃ vāheti, thalaṃ ussāreti. Yampi, bhante, mahāsamuddo na matena kuṇapena saṃvasati, yaṃ hoti mahāsamudde mataṃ kuṇapaṃ, taṃ khippameva tīraṃ vāheti, thalaṃ ussāreti; ayaṃ, bhante, mahāsamudde tatiyo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Puna caparaṃ, bhante, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā yamunā aciravatī sarabhū mahī, tā mahāsamuddaṃ patvā [pattā (ka., cūḷava. 384)] jahanti purimāni nāmagottāni, ‘mahāsamuddo’ tveva saṅkhaṃ gacchanti. Yampi, bhante, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā yamunā aciravatī sarabhū mahī, tā mahāsamuddaṃ patvā jahanti purimāni nāmagottāni, ‘mahāsamuddo’ tveva saṅkhaṃ gacchanti; ayaṃ, bhante, mahāsamudde catuttho acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Puna caparaṃ, bhante, yā ca [yā kāci (syā. pī. ka.)] loke savantiyo mahāsamuddaṃ appenti yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati. Yampi, bhante, yā ca loke savantiyo mahāsamuddaṃ appenti yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati; ayaṃ, bhante, mahāsamudde pañcamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Puna caparaṃ, bhante, mahāsamuddo ekaraso loṇaraso. Yampi, bhante, mahāsamuddo ekaraso loṇaraso; ayaṃ, bhante, mahāsamudde chaṭṭho acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Puna caparaṃ, bhante, mahāsamuddo bahuratano [pahūtaratano (ka.)] anekaratano. Tatrimāni ratanāni, seyyathidaṃ – muttā maṇi veḷuriyo saṅkho silā pavāḷaṃ rajataṃ jātarūpaṃ lohitako masāragallaṃ. Yampi, bhante, mahāsamuddo bahuratano anekaratano; tatrimāni ratanāni, seyyathidaṃ – muttā maṇi veḷuriyo saṅkho silā pavāḷaṃ rajataṃ jātarūpaṃ lohitako masāragallaṃ. Ayaṃ, bhante, mahāsamudde sattamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Puna caparaṃ, bhante, mahāsamuddo mahataṃ bhūtānaṃ āvāso. Tatrime bhūtā – timi timiṅgalo timirapiṅgalo [timitimiṅgalā timirapiṅgalā (sī.), timitimiṅgalā timiramiṅgalā (syā. pī.)] asurā nāgā gandhabbā. Santi mahāsamudde yojanasatikāpi attabhāvā, dviyojanasatikāpi attabhāvā, tiyojanasatikāpi attabhāvā, catuyojanasatikāpi attabhāvā, pañcayojanasatikāpi attabhāvā. Yampi, bhante, mahāsamuddo mahataṃ bhūtānaṃ āvāso; tatrime bhūtā – timi timiṅgalo timirapiṅgalo asurā nāgā gandhabbā; santi mahāsamudde yojanasatikāpi attabhāvā…pe… dviyojana… tiyojana… catuyojana… pañcayojanasatikāpi attabhāvā; ayaṃ, bhante, mahāsamudde aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. Ime kho, bhante, mahāsamudde aṭṭha acchariyā abbhutā dhammā, ye disvā disvā asurā mahāsamudde abhiramantīti. ‘‘Api pana, bhante, bhikkhū imasmiṃ dhammavinaye abhiramantī’’ti? ‘‘Abhiramanti, pahārāda, bhikkhū imasmiṃ dhammavinaye’’ti. ‘‘Kati pana, bhante, imasmiṃ dhammavinaye acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramantī’’ti? ‘‘Aṭṭha, pahārāda, imasmiṃ dhammavinaye acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. Katame aṭṭha? Seyyathāpi, pahārāda, mahāsamuddo anupubbaninno anupubbapoṇo anupubbapabbhāro, na āyatakeneva papāto; evamevaṃ kho, pahārāda, imasmiṃ dhammavinaye anupubbasikkhā anupubbakiriyā anupubbapaṭipadā, na āyatakeneva aññāpaṭivedho. Yampi, pahārāda, imasmiṃ dhammavinaye anupubbasikkhā anupubbakiriyā anupubbapaṭipadā, na āyatakeneva aññāpaṭivedho. Ayaṃ, pahārāda, imasmiṃ dhammavinaye paṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Seyyathāpi, pahārāda, mahāsamuddo ṭhitadhammo velaṃ nātivattati; evamevaṃ kho, pahārāda, yaṃ mayā sāvakānaṃ sikkhāpadaṃ paññattaṃ taṃ mama sāvakā jīvitahetupi nātikkamanti. Yampi, pahārāda, mayā sāvakānaṃ sikkhāpadaṃ paññattaṃ taṃ mama sāvakā jīvitahetupi nātikkamanti. Ayaṃ, pahārāda, imasmiṃ dhammavinaye dutiyo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Seyyathāpi, pahārāda, mahāsamuddo na matena kuṇapena saṃvasati. Yaṃ hoti mahāsamudde mataṃ kuṇapaṃ, taṃ khippameva tīraṃ vāheti thalaṃ ussāreti; evamevaṃ kho, pahārāda, yo so puggalo dussīlo pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto, na tena saṅgho saṃvasati; khippameva naṃ sannipatitvā ukkhipati. ‘‘Kiñcāpi so hoti majjhe bhikkhusaṅghassa sannisinno, atha kho so ārakāva saṅghamhā saṅgho ca tena. Yampi, pahārāda, yo so puggalo dussīlo pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto, na tena saṅgho saṃvasati; khippameva naṃ sannipatitvā ukkhipati; kiñcāpi so hoti majjhe bhikkhusaṅghassa sannisinno, atha kho so ārakāva saṅghamhā saṅgho ca tena. Ayaṃ, pahārāda, imasmiṃ dhammavinaye tatiyo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Seyyathāpi, pahārāda, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā yamunā aciravatī sarabhū mahī, tā mahāsamuddaṃ patvā jahanti purimāni nāmagottāni, ‘mahāsamuddo’ tveva saṅkhaṃ gacchanti; evamevaṃ kho, pahārāda, cattārome vaṇṇā – khattiyā, brāhmaṇā, vessā, suddā, te tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā jahanti purimāni nāmagottāni, ‘samaṇā sakyaputtiyā’ tveva [samaṇo sakyaputtiyo tveva (syā. ka.)] saṅkhaṃ gacchanti. Yampi, pahārāda, cattārome vaṇṇā – khattiyā, brāhmaṇā, vessā, suddā, te tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā jahanti purimāni nāmagottāni, ‘samaṇā sakyaputtiyā’ tveva saṅkhaṃ gacchanti. Ayaṃ, pahārāda, imasmiṃ dhammavinaye catuttho acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Seyyathāpi, pahārāda, yā ca loke savantiyo mahāsamuddaṃ appenti yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati; evamevaṃ kho, pahārāda, bahū cepi bhikkhū anupādisesāya nibbānadhātuyā parinibbāyanti, na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā paññāyati. Yampi, pahārāda, bahū cepi bhikkhū anupādisesāya nibbānadhātuyā parinibbāyanti, na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā paññāyati. Ayaṃ, pahārāda, imasmiṃ dhammavinaye pañcamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Seyyathāpi, pahārāda, mahāsamuddo ekaraso loṇaraso; evamevaṃ kho, pahārāda, ayaṃ dhammavinayo ekaraso, vimuttiraso. Yampi pahārāda, ayaṃ dhammavinayo ekaraso, vimuttiraso; ayaṃ, pahārāda, imasmiṃ dhammavinaye chaṭṭho acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Seyyathāpi, pahārāda, mahāsamuddo bahuratano anekaratano; tatrimāni ratanāni, seyyathidaṃ – muttā maṇi veḷuriyo saṅkho silā pavāḷaṃ rajataṃ jātarūpaṃ lohitako masāragallaṃ; evamevaṃ kho, pahārāda, ayaṃ dhammavinayo bahuratano anekaratano. Tatrimāni ratanāni, seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo. Yampi, pahārāda, ayaṃ dhammavinayo bahuratano anekaratano; tatrimāni ratanāni, seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo; ayaṃ, pahārāda, imasmiṃ dhammavinaye sattamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Seyyathāpi, pahārāda, mahāsamuddo mahataṃ bhūtānaṃ āvāso; tatrime bhūtā – timi timiṅgalo timirapiṅgalo asurā nāgā gandhabbā; santi mahāsamudde yojanasatikāpi attabhāvā, dviyojanasatikāpi attabhāvā, tiyojanasatikāpi attabhāvā, catuyojanasatikāpi attabhāvā, pañcayojanasatikāpi attabhāvā; evamevaṃ kho, pahārāda, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso; tatrime bhūtā – sotāpanno sotāpattiphalasacchikiriyāya paṭipanno, sakadāgāmī sakadāgāmiphalasacchikiriyāya paṭipanno, anāgāmī anāgāmiphalasacchikiriyāya paṭipanno, arahā arahattāya paṭipanno. Yampi, pahārāda, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso; tatrime bhūtā – sotāpanno sotāpattiphalasacchikiriyāya paṭipanno, sakadāgāmī sakadāgāmiphalasacchikiriyāya paṭipanno, anāgāmī anāgāmiphalasacchikiriyāya paṭipanno, arahā arahattāya paṭipanno; ayaṃ, pahārāda, imasmiṃ dhammavinaye aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. Ime kho, pahārāda, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramantī’’ti. Navamaṃ.",
      "english": "Once the Blessed One was staying at Verañjā, at the root of a Naḷeru-pucimanda tree. Then Pahārāda, the lord of the Asuras, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. To Pahārāda, the lord of the Asuras, standing to one side, the Blessed One said: \"Pahārāda, do the Asuras delight in the great ocean?\" \"They do delight in the great ocean, Venerable Sir,\" he replied. \"How many, Pahārāda, are there in the great ocean amazing and wonderful qualities, seeing which again and again the Asuras delight in the great ocean?\" \"There are eight, Venerable Sir, amazing and wonderful qualities in the great ocean, seeing which again and again the Asuras delight in the great ocean. What are these eight? The great ocean, Venerable Sir, slopes gradually, shelves gradually, recedes gradually, and does not drop off abruptly. Because the great ocean, Venerable Sir, slopes gradually, shelves gradually, recedes gradually, and does not drop off abruptly, this, Venerable Sir, is the first amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"Furthermore, Venerable Sir, the great ocean remains constant, not overstepping its boundaries. Because the great ocean, Venerable Sir, remains constant, not overstepping its boundaries, this, Venerable Sir, is the second amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"Furthermore, Venerable Sir, the great ocean does not tolerate a dead corpse. Any dead corpse in the great ocean it quickly washes ashore, casting it onto the dry land. Because the great ocean, Venerable Sir, does not tolerate a dead corpse, and any dead corpse in the great ocean it quickly washes ashore, casting it onto the dry land, this, Venerable Sir, is the third amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"Furthermore, Venerable Sir, all the great rivers, namely, the Ganga, Yamuna, Aciravatī, Sarabhū, and Mahī, on reaching the great ocean, abandon their former names and identities and are simply known as 'the great ocean'. Because, Venerable Sir, all the great rivers, namely, the Ganga, Yamuna, Aciravatī, Sarabhū, and Mahī, on reaching the great ocean, abandon their former names and identities and are simply known as 'the great ocean', this, Venerable Sir, is the fourth amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"Furthermore, Venerable Sir, though all the streams in the world flow into the great ocean, and all the rains fall from the sky, no decrease or increase in the great ocean is discernible thereby. Because, Venerable Sir, though all the streams in the world flow into the great ocean, and all the rains fall from the sky, no decrease or increase in the great ocean is discernible thereby, this, Venerable Sir, is the fifth amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"Furthermore, Venerable Sir, the great ocean has a single taste, the taste of salt. Because the great ocean, Venerable Sir, has a single taste, the taste of salt, this, Venerable Sir, is the sixth amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"Furthermore, Venerable Sir, the great ocean is rich in many kinds of gems. These are the gems: pearls, sapphires, cat's-eyes, conch shells, crystal, coral, silver, gold, ruby, and white-quartz. Because, Venerable Sir, the great ocean is rich in many kinds of gems, and these are the gems: pearls, sapphires, cat's-eyes, conch shells, crystal, coral, silver, gold, ruby, and white-quartz, this, Venerable Sir, is the seventh amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"Furthermore, Venerable Sir, the great ocean is the abode of mighty beings. These are those beings: the Timi, the Timingala, the Timirapingala, Asuras, Nāgas, and Gandharvas. There are beings in the great ocean whose bodies are one hundred leagues, two hundred leagues, three hundred leagues, four hundred leagues, or five hundred leagues in extent. Because, Venerable Sir, the great ocean is the abode of mighty beings, and these are those beings: the Timi, the Timingala, the Timirapingala, Asuras, Nāgas, and Gandharvas, and there are beings in the great ocean whose bodies are one hundred leagues, two hundred leagues, three hundred leagues, four hundred leagues, or five hundred leagues in extent, this, Venerable Sir, is the eighth amazing and wonderful quality in the great ocean, seeing which again and again the Asuras delight in the great ocean. These, Venerable Sir, are the eight amazing and wonderful qualities in the great ocean, seeing which again and again the Asuras delight in the great ocean.\"\n\n\"But, Venerable Sir, do the bhikkhus delight in this Dhamma and Discipline?\" \"They do delight, Pahārāda, in this Dhamma and Discipline,\" replied the Blessed One. \"How many, Venerable Sir, are there in this Dhamma and Discipline amazing and wonderful qualities, seeing which again and again the bhikkhus delight in this Dhamma and Discipline?\" \"There are eight, Pahārāda, amazing and wonderful qualities in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline. What are these eight? Just as, Pahārāda, the great ocean slopes gradually, shelves gradually, recedes gradually, and does not drop off abruptly, even so, Pahārāda, in this Dhamma and Discipline there is a gradual training, a gradual practice, a gradual path, and no abrupt penetration to final knowledge. Because, Pahārāda, in this Dhamma and Discipline there is a gradual training, a gradual practice, a gradual path, and no abrupt penetration to final knowledge, this, Pahārāda, is the first amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"\n\n\"Just as, Pahārāda, the great ocean remains constant, not overstepping its boundaries, even so, Pahārāda, whatever training rule I have laid down for my disciples, my disciples would not transgress it even for the sake of their lives. Because, Pahārāda, whatever training rule I have laid down for my disciples, my disciples would not transgress it even for the sake of their lives, this, Pahārāda, is the second amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"\n\n\"Just as, Pahārāda, the great ocean does not tolerate a dead corpse, and any dead corpse in the great ocean it quickly washes ashore, casting it onto the dry land, even so, Pahārāda, that person who is immoral, of wicked nature, impure and of doubtful conduct, with concealed actions, who is no ascetic though claiming to be one, no celibate though claiming to be one, inwardly corrupt, overflowing with defilements, rotten to the core – the Sangha does not tolerate him. Having quickly gathered, the Sangha expels him. Even if he is sitting right in the midst of the community of bhikkhus, he is far from the Sangha, and the Sangha is far from him. Because, Pahārāda, that person who is immoral, of wicked nature, impure and of doubtful conduct, with concealed actions, who is no ascetic though claiming to be one, no celibate though claiming to be one, inwardly corrupt, overflowing with defilements, rotten to the core – the Sangha does not tolerate him, and having quickly gathered, the Sangha expels him, and even if he is sitting right in the midst of the community of bhikkhus, he is far from the Sangha, and the Sangha is far from him, this, Pahārāda, is the third amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"\n\n\"Just as, Pahārāda, all the great rivers, namely, the Ganga, Yamuna, Aciravatī, Sarabhū, and Mahī, on reaching the great ocean, abandon their former names and identities and are simply known as 'the great ocean', even so, Pahārāda, these four castes—Khattiyas, Brahmins, Vessas, and Suddas—having gone forth from home to homelessness in the Dhamma and Discipline proclaimed by the Tathāgata, abandon their former names and identities and are simply known as 'ascetics, sons of the Sakya'. Because, Pahārāda, these four castes—Khattiyas, Brahmins, Vessas, and Suddas—having gone forth from home to homelessness in the Dhamma and Discipline proclaimed by the Tathāgata, abandon their former names and identities and are simply known as 'ascetics, sons of the Sakya', this, Pahārāda, is the fourth amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"\n\n\"Just as, Pahārāda, though all the streams in the world flow into the great ocean, and all the rains fall from the sky, no decrease or increase in the great ocean is discernible thereby, even so, Pahārāda, though many bhikkhus pass away into the Nibbāna-element without any remainder of clinging, no decrease or increase in the Nibbāna-element is discernible thereby. Because, Pahārāda, though many bhikkhus pass away into the Nibbāna-element without any remainder of clinging, no decrease or increase in the Nibbāna-element is discernible thereby, this, Pahārāda, is the fifth amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"\n\n\"Just as, Pahārāda, the great ocean has a single taste, the taste of salt, even so, Pahārāda, this Dhamma and Discipline has a single taste, the taste of liberation. Because, Pahārāda, this Dhamma and Discipline has a single taste, the taste of liberation, this, Pahārāda, is the sixth amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"\n\n\"Just as, Pahārāda, the great ocean is rich in many kinds of gems, and these are the gems: pearls, sapphires, cat's-eyes, conch shells, crystal, coral, silver, gold, ruby, and white-quartz, even so, Pahārāda, this Dhamma and Discipline is rich in many kinds of gems. These are the gems: the four foundations of mindfulness, the four right exertions, the four bases of psychic power, the five spiritual faculties, the five spiritual powers, the seven factors of awakening, and the Noble Eightfold Path. Because, Pahārāda, this Dhamma and Discipline is rich in many kinds of gems, and these are the gems: the four foundations of mindfulness, the four right exertions, the four bases of psychic power, the five spiritual faculties, the five spiritual powers, the seven factors of awakening, and the Noble Eightfold Path, this, Pahārāda, is the seventh amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"\n\n\"Just as, Pahārāda, the great ocean is the abode of mighty beings, and these are those beings: the Timi, the Timingala, the Timirapingala, Asuras, Nāgas, and Gandharvas, and there are beings in the great ocean whose bodies are one hundred leagues, two hundred leagues, three hundred leagues, four hundred leagues, or five hundred leagues in extent, even so, Pahārāda, this Dhamma and Discipline is the abode of mighty beings. These are those beings: the stream-enterer, one practicing for the realization of the fruit of stream-entry; the once-returner, one practicing for the realization of the fruit of once-returning; the non-returner, one practicing for the realization of the fruit of non-returning; the Arahant, one practicing for Arahantship. Because, Pahārāda, this Dhamma and Discipline is the abode of mighty beings, and these are those beings: the stream-enterer, one practicing for the realization of the fruit of stream-entry; the once-returner, one practicing for the realization of the fruit of once-returning; the non-returner, one practicing for the realization of the fruit of non-returning; the Arahant, one practicing for Arahantship, this, Pahārāda, is the eighth amazing and wonderful quality in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline. These, Pahārāda, are the eight amazing and wonderful qualities in this Dhamma and Discipline, seeing which again and again the bhikkhus delight in this Dhamma and Discipline.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වේරංජායෙහි, නළේරුපුචිමන්ද නම් වෘක්ෂය මුල වැඩසිටින සේක. එකල්හී පහරාද නම් අසුරේන්ද්‍රයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පස්ව සිටියේය. එකත්පස්ව සිටි පහරාද අසුරේන්ද්‍රයාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"පහරාද, අසුරයෝ මහා මුහුදෙහි ඇලුම් කරත් ද?\" \"ස්වාමීනි, අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\"\n\n\"පහරාද, මහා මුහුදෙහි කොපමණ ආශ්චර්යවත් අද්භූත ධර්මයන් ඇත් ද, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරත් ද?\" \"ස්වාමීනි, මහා මුහුදෙහි ආශ්චර්යවත් අද්භූත ධර්ම අටක් ඇත, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති. ඒ අට කවරේ ද?\"\n\nස්වාමීනි, මහා මුහුද ක්‍රමයෙන් පහළට බසියි, ක්‍රමයෙන් බෑවුම් වේ, ක්‍රමයෙන් ගැඹුරු වේ. එකවරම අගාධයක් නොවේ. ස්වාමීනි, මහා මුහුද ක්‍රමයෙන් පහළට බසින, ක්‍රමයෙන් බෑවුම් වන, ක්‍රමයෙන් ගැඹුරු වන, එකවරම අගාධයක් නොවන හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති පළමු ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\nස්වාමීනි, තව ද මහා මුහුද ස්ථිර ස්වභාව ඇත්තක් වෙයි, වෙරළ ඉක්මවා නොයයි. ස්වාමීනි, මහා මුහුද ස්ථිර ස්වභාව ඇති බැවින් වෙරළ ඉක්මවා නොයන හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති දෙවෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\nස්වාමීනි, තව ද මහා මුහුද මළ කුණුපයක් සමඟ නොරැඳේ. මහා මුහුදෙහි යම් මළ කුණුපයක් ඇත් ද, එය ඉක්මනින්ම වෙරළට ගසාගෙන යයි, ගොඩබිමට දමයි. ස්වාමීනි, මහා මුහුද මළ කුණුපයක් සමඟ නොරැඳෙන හෙයින් ද, යම් මළ කුණුපයක් ඇත් ද, එය ඉක්මනින්ම වෙරළට ගසාගෙන යන, ගොඩබිමට දමන හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති තුන්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\nස්වාමීනි, තව ද ගංගා, යමුනා, අචිරවතී, සරභූ, මහා යන යම් මහා නදීන් ඇත් ද, ඒවා මහා මුහුදට පැමිණ තම පෙර නාමගෝත්‍රයන් අත්හරිති, 'මහා මුහුද' යන නාමයෙන්ම ගණනට ගැනේ. ස්වාමීනි, ගංගා, යමුනා, අචිරවතී, සරභූ, මහා යන යම් මහා නදීන් ඇත් ද, ඒවා මහා මුහුදට පැමිණ තම පෙර නාමගෝත්‍රයන් අත්හරින, 'මහා මුහුද' යන නාමයෙන්ම ගණනට ගැනෙන හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති සිව්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\nස්වාමීනි, තව ද ලෝකයෙහි ගලා බසින යම් ජල ධාරාවෝ මහා මුහුදට ඇතුළු වෙත් ද, අහසින් වැටෙන යම් වර්ෂා ධාරාවෝ ඇත් ද, ඒ කිසිවකින් මහා මුහුදෙහි අඩුවක් හෝ පිරී යෑමක් හෝ දක්නට නොලැබේ. ස්වාමීනි, ලෝකයෙහි ගලා බසින යම් ජල ධාරාවෝ මහා මුහුදට ඇතුළු වෙත් ද, අහසින් වැටෙන යම් වර්ෂා ධාරාවෝ ඇත් ද, ඒ කිසිවකින් මහා මුහුදෙහි අඩුවක් හෝ පිරී යෑමක් හෝ දක්නට නොලැබෙන හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති පස්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\nස්වාමීනි, තව ද මහා මුහුද එක් රසැත්තක් වෙයි, එනම් ලුණු රසයයි. ස්වාමීනි, මහා මුහුද එක් රසැත්තක්, එනම් ලුණු රස ඇති හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති සයවෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\nස්වාමීනි, තව ද මහා මුහුද බොහෝ රත්නයන්ගෙන් යුක්ත වෙයි, නොයෙක් රත්නයන්ගෙන් යුක්ත වෙයි. එහි මේ රත්නයෝ ඇත්තාහ, එනම්: මුතු, මැණික්, වෛදූර්‍යය, සක්, ගල්, පබළු, රිදී, රන්, රතු මැණික්, මසාරගල් ය. ස්වාමීනි, මහා මුහුද බොහෝ රත්නයන්ගෙන්, නොයෙක් රත්නයන්ගෙන් යුක්ත වන, එහි මුතු, මැණික්, වෛදූර්‍යය, සක්, ගල්, පබළු, රිදී, රන්, රතු මැණික්, මසාරගල් යන මේ රත්නයන් ඇති හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති සත්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\nස්වාමීනි, තව ද මහා මුහුද මහත් වූ සත්වයින්ට වාසස්ථානයක් වෙයි. එහි මේ සත්වයෝ ඇත්තාහ, එනම්: තිමි, තිමිංගල, තිමිරපිංගල, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ ය. මහා මුහුදෙහි යොදුන් සියයක් පමණ ද, යොදුන් දෙසියයක් පමණ ද, යොදුන් තුන්සියයක් පමණ ද, යොදුන් හාරසියයක් පමණ ද, යොදුන් පන්සියයක් පමණ ද වූ ශරීර ඇති සත්වයෝ සිටිති. ස්වාමීනි, මහා මුහුද මහත් වූ සත්වයින්ට වාසස්ථානයක් වන හෙයින් ද, එහි තිමි, තිමිංගල, තිමිරපිංගල, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ යන මේ සත්වයෝ ඇති හෙයින් ද, මහා මුහුදෙහි යොදුන් සියයක් පමණ ද, යොදුන් දෙසියයක් පමණ ද, යොදුන් තුන්සියයක් පමණ ද, යොදුන් හාරසියයක් පමණ ද, යොදුන් පන්සියයක් පමණ ද වූ ශරීර ඇති සත්වයෝ සිටින හෙයින් ද, ස්වාමීනි, මෙය මහා මුහුදෙහි ඇති අටවෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති. ස්වාමීනි, මහා මුහුදෙහි ඇති ආශ්චර්යවත් අද්භූත ධර්ම අට නම් මේවා ය, යමක් දැක දැක අසුරයෝ මහා මුහුදෙහි ඇලුම් කරති.\n\n\"ස්වාමීනි, එසේනම් භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරත් ද?\" \"පහරාද, භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\" \"ස්වාමීනි, එසේනම් මේ ධර්ම විනයෙහි කොපමණ ආශ්චර්යවත් අද්භූත ධර්මයන් ඇත් ද, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරත් ද?\" \"පහරාද, මේ ධර්ම විනයෙහි ආශ්චර්යවත් අද්භූත ධර්ම අටක් ඇත, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති. ඒ අට කවරේ ද?\"\n\nපහරාද, යම් සේ මහා මුහුද ක්‍රමයෙන් පහළට බසී ද, ක්‍රමයෙන් බෑවුම් වේ ද, ක්‍රමයෙන් ගැඹුරු වේ ද, එකවරම අගාධයක් නොවේ ද, එසේම පහරාද, මේ ධර්ම විනයෙහි ක්‍රමයෙන් සික්ෂා කිරීම් ඇත්තේ ය, ක්‍රමයෙන් පිළිපැදීම් ඇත්තේ ය, ක්‍රමයෙන් ප්‍රතිපත්ති පිරීම් ඇත්තේ ය. එකවරම අරහත් ඵල අවබෝධයක් නොවේ. පහරාද, මේ ධර්ම විනයෙහි ක්‍රමයෙන් සික්ෂා කිරීම් ඇති, ක්‍රමයෙන් පිළිපැදීම් ඇති, ක්‍රමයෙන් ප්‍රතිපත්ති පිරීම් ඇති, එකවරම අරහත් ඵල අවබෝධයක් නොවන හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති පළමු ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\n\nපහරාද, යම් සේ මහා මුහුද ස්ථිර ස්වභාව ඇත්තක් වෙයි, වෙරළ ඉක්මවා නොයයි ද, එසේම පහරාද, මා විසින් ශ්‍රාවකයන්ට යම් සික්ෂා පදයක් පනවන ලද්දේ ද, මාගේ ඒ ශ්‍රාවකයෝ ජීවිත හේතුවෙන් වුව ද එය ඉක්මවා නොයති. පහරාද, මා විසින් ශ්‍රාවකයන්ට යම් සික්ෂා පදයක් පනවන ලද්දේ ද, මාගේ ඒ ශ්‍රාවකයෝ ජීවිත හේතුවෙන් වුව ද එය ඉක්මවා නොයන හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති දෙවෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\n\nපහරාද, යම් සේ මහා මුහුද මළ කුණුපයක් සමඟ නොරැඳේ ද, මහා මුහුදෙහි යම් මළ කුණුපයක් ඇත් ද, එය ඉක්මනින්ම වෙරළට ගසාගෙන යයි, ගොඩබිමට දමයි ද, එසේම පහරාද, යම් පුද්ගලයෙක් දුසිල්වත් ද, පව්කම් ඇත්තෙක් ද, අපිරිසුදු චර්යාවෙන් යුක්ත ද, සැක සහිත හැසිරීම් ඇත්තෙක් ද, රහසිගත ක්‍රියා ඇත්තෙක් ද, ශ්‍රමණයෙක් නොවී ශ්‍රමණයෙකැයි පවසන ද, බ්‍රහ්මචාරී නොවී බ්‍රහ්මචාරියෙකැයි පවසන ද, ඇතුළත කුණු වී ඇති, කාන්දු වන, මලකඩ කැණක් බඳු වූ ද, ඒ පුද්ගලයා සමඟ සංඝයා වහන්සේලා නොරැඳෙති; ඉක්මනින්ම එක්රැස් වී ඔහුව නෙරපා දමති. යම් හෙයකින් ඔහු භික්ෂු සංඝයා මැද වාඩි වී සිටිය ද, ඔහු සංඝයාගෙන් දුරස් වී සිටින්නෙක් වෙයි, සංඝයා වහන්සේලා ද ඔහුගෙන් දුරස් වී සිටිති. පහරාද, යම් පුද්ගලයෙක් දුසිල්වත් ද, පව්කම් ඇත්තෙක් ද, අපිරිසුදු චර්යාවෙන් යුක්ත ද, සැක සහිත හැසිරීම් ඇත්තෙක් ද, රහසිගත ක්‍රියා ඇත්තෙක් ද, ශ්‍රමණයෙක් නොවී ශ්‍රමණයෙකැයි පවසන ද, බ්‍රහ්මචාරී නොවී බ්‍රහ්මචාරියෙකැයි පවසන ද, ඇතුළත කුණු වී ඇති, කාන්දු වන, මලකඩ කැණක් බඳු වූ ද, ඒ පුද්ගලයා සමඟ සංඝයා වහන්සේලා නොරැඳෙන හෙයින් ද, ඉක්මනින්ම එක්රැස් වී ඔහුව නෙරපා දමන හෙයින් ද; යම් හෙයකින් ඔහු භික්ෂු සංඝයා මැද වාඩි වී සිටිය ද, ඔහු සංඝයාගෙන් දුරස් වී සිටින්නෙක් වන, සංඝයා වහන්සේලා ද ඔහුගෙන් දුරස් වී සිටින හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති තුන්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\n\nපහරාද, යම් සේ ගංගා, යමුනා, අචිරවතී, සරභූ, මහා යන යම් මහා නදීන් ඇත් ද, ඒවා මහා මුහුදට පැමිණ තම පෙර නාමගෝත්‍රයන් අත්හරිති, 'මහා මුහුද' යන නාමයෙන්ම ගණනට ගැනේ ද, එසේම පහරාද, ක්‍ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශූද්‍ර යන මේ සිව්වර්ණයෙහිලා වූ පුද්ගලයෝ, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනයෙහි ගිහි ගෙයින් නික්ම අනගාරික බවට පැමිණි පසු, තම පෙර නාමගෝත්‍රයන් අත්හරිති, 'ශාක්‍යපුත්‍ර ශ්‍රමණයෝ' යන නාමයෙන්ම ගණනට ගැනෙති. පහරාද, ක්‍ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශූද්‍ර යන මේ සිව්වර්ණයෙහිලා වූ පුද්ගලයෝ, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනයෙහි ගිහි ගෙයින් නික්ම අනගාරික බවට පැමිණි පසු, තම පෙර නාමගෝත්‍රයන් අත්හරින, 'ශාක්‍යපුත්‍ර ශ්‍රමණයෝ' යන නාමයෙන්ම ගණනට ගැනෙන හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති සිව්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\n\nපහරාද, යම් සේ ලෝකයෙහි ගලා බසින යම් ජල ධාරාවෝ මහා මුහුදට ඇතුළු වෙත් ද, අහසින් වැටෙන යම් වර්ෂා ධාරාවෝ ඇත් ද, ඒ කිසිවකින් මහා මුහුදෙහි අඩුවක් හෝ පිරී යෑමක් හෝ දක්නට නොලැබේ ද, එසේම පහරාද, බොහෝ භික්ෂූහු අනුපාදිශේෂ නිර්වාණ ධාතුවෙන් පිරිනිවන් පාන හෙයින් ද, ඒ කිසිවකින් නිර්වාණ ධාතුවෙහි අඩුවක් හෝ පිරී යෑමක් හෝ දක්නට නොලැබේ. පහරාද, බොහෝ භික්ෂූහු අනුපාදිශේෂ නිර්වාණ ධාතුවෙන් පිරිනිවන් පාන හෙයින් ද, ඒ කිසිවකින් නිර්වාණ ධාතුවෙහි අඩුවක් හෝ පිරී යෑමක් හෝ දක්නට නොලැබෙන හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති පස්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\n\nපහරාද, යම් සේ මහා මුහුද එක් රසැත්තක් වෙයි, එනම් ලුණු රසයයි ද, එසේම පහරාද, මේ ධර්ම විනය එක් රසැත්තක් වෙයි, එනම් විමුක්ති රසයයි. පහරාද, මේ ධර්ම විනය එක් රසැත්තක්, එනම් විමුක්ති රස ඇති හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති සයවෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\n\nපහරාද, යම් සේ මහා මුහුද බොහෝ රත්නයන්ගෙන් යුක්ත ද, නොයෙක් රත්නයන්ගෙන් යුක්ත ද; එහි මුතු, මැණික්, වෛදූර්‍යය, සක්, ගල්, පබළු, රිදී, රන්, රතු මැණික්, මසාරගල් යන මේ රත්නයෝ ඇත්තාහ ද, එසේම පහරාද, මේ ධර්ම විනය බොහෝ රත්නයන්ගෙන් යුක්ත වෙයි, නොයෙක් රත්නයන්ගෙන් යුක්ත වෙයි. එහි මේ රත්නයෝ ඇත්තාහ, එනම්: සිව් සතිපට්ඨාන, සිව් සම්‍යක්ප්‍රධාන, සිව් සෘද්ධිපාද, පංචෙන්ද්‍රිය, පංච බල, සප්ත බොජ්ඣංග, ආර්ය අෂ්ටාංගික මාර්ගය යි. පහරාද, මේ ධර්ම විනය බොහෝ රත්නයන්ගෙන්, නොයෙක් රත්නයන්ගෙන් යුක්ත වන, එහි සිව් සතිපට්ඨාන, සිව් සම්‍යක්ප්‍රධාන, සිව් සෘද්ධිපාද, පංචෙන්ද්‍රිය, පංච බල, සප්ත බොජ්ඣංග, ආර්ය අෂ්ටාංගික මාර්ගය යන මේ රත්නයන් ඇති හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති සත්වෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.\n\nපහරාද, යම් සේ මහා මුහුද මහත් වූ සත්වයින්ට වාසස්ථානයක් ද; එහි තිමි, තිමිංගල, තිමිරපිංගල, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ යන මේ සත්වයෝ ඇත්තාහ ද; මහා මුහුදෙහි යොදුන් සියයක් පමණ ද, යොදුන් දෙසියයක් පමණ ද, යොදුන් තුන්සියයක් පමණ ද, යොදුන් හාරසියයක් පමණ ද, යොදුන් පන්සියයක් පමණ ද වූ ශරීර ඇති සත්වයෝ සිටිත් ද, එසේම පහරාද, මේ ධර්ම විනය මහත් වූ සත්වයින්ට වාසස්ථානයක් වෙයි. එහි මේ සත්වයෝ ඇත්තාහ, එනම්: සෝවාන් ඵලය සාක්ෂාත් කර ගැනීම සඳහා පිළිපදින සෝවාන් වූ පුද්ගලයා, සකෘදාගාමී ඵලය සාක්ෂාත් කර ගැනීම සඳහා පිළිපදින සකෘදාගාමී වූ පුද්ගලයා, අනාගාමී ඵලය සාක්ෂාත් කර ගැනීම සඳහා පිළිපදින අනාගාමී වූ පුද්ගලයා, අරහත්වය සඳහා පිළිපදින අරහත් වූ පුද්ගලයා යි. පහරාද, මේ ධර්ම විනය මහත් වූ සත්වයින්ට වාසස්ථානයක් වන හෙයින් ද, එහි සෝවාන් ඵලය සාක්ෂාත් කර ගැනීම සඳහා පිළිපදින සෝවාන් වූ පුද්ගලයා, සකෘදාගාමී ඵලය සාක්ෂාත් කර ගැනීම සඳහා පිළිපදින සකෘදාගාමී වූ පුද්ගලයා, අනාගාමී ඵලය සාක්ෂාත් කර ගැනීම සඳහා පිළිපදින අනාගාමී වූ පුද්ගලයා, අරහත්වය සඳහා පිළිපදින අරහත් වූ පුද්ගලයා යන මේ සත්වයෝ ඇති හෙයින් ද, පහරාද, මෙය මේ ධර්ම විනයෙහි ඇති අටවෙනි ආශ්චර්යවත් අද්භූත ධර්මයයි, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති. පහරාද, මේ ධර්ම විනයෙහි ඇති ආශ්චර්යවත් අද්භූත ධර්ම අට නම් මේවා ය, යමක් දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ඇලුම් කරති.",
      "paliTitle": "Pahārādasuttaṃ",
      "englishTitle": "Pahārāda Discourse",
      "sinhalaTitle": "පහාරාද සූත්‍රය"
    },
    {
      "number": 20,
      "pali": "[cūḷava. 383; udā. 45; kathā. 346] Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho āyasmā ānando abhikkantāya rattiyā, nikkhante paṭhame yāme, uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā, bhante, ratti, nikkhanto paṭhamo yāmo, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. Evaṃ vutte bhagavā tuṇhī ahosi. Dutiyampi kho āyasmā ānando abhikkantāya rattiyā, nikkhante majjhime yāme, uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā, bhante, ratti, nikkhanto majjhimo yāmo, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. Dutiyampi kho bhagavā tuṇhī ahosi. Tatiyampi kho āyasmā ānando abhikkantāya rattiyā, nikkhante pacchime yāme, uddhaste aruṇe, nandimukhiyā rattiyā uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā, bhante, ratti, nikkhanto pacchimo yāmo, uddhastaṃ aruṇaṃ, nandimukhī ratti; ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. ‘‘Aparisuddhā, ānanda, parisā’’ti. Atha kho āyasmato mahāmoggallānassa etadahosi – ‘‘kaṃ nu kho bhagavā puggalaṃ sandhāya evamāha – ‘aparisuddhā, ānanda, parisā’’’ti? Atha kho āyasmā mahāmoggallāno sabbāvantaṃ bhikkhusaṅghaṃ cetasā ceto paricca manasākāsi. Addasā kho āyasmā mahāmoggallāno taṃ puggalaṃ dussīlaṃ pāpadhammaṃ asuciṃ saṅkassarasamācāraṃ paṭicchannakammantaṃ assamaṇaṃ samaṇapaṭiññaṃ abrahmacāriṃ brahmacāripaṭiññaṃ antopūtiṃ avassutaṃ kasambujātaṃ majjhe bhikkhusaṅghassa nisinnaṃ; disvāna uṭṭhāyāsanā yena so puggalo tenupasaṅkami; upasaṅkamitvā taṃ puggalaṃ etadavoca – ‘‘uṭṭhehāvuso, diṭṭhosi bhagavatā. Natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Evaṃ vutte so puggalo tuṇhī ahosi. Dutiyampi kho āyasmā mahāmoggallāno taṃ puggalaṃ etadavoca – ‘‘uṭṭhehāvuso, diṭṭhosi bhagavatā. Natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Dutiyampi kho so puggalo tuṇhī ahosi. Tatiyampi kho āyasmā mahāmoggallāno taṃ puggalaṃ etadavoca – ‘‘uṭṭhehāvuso, diṭṭhosi bhagavatā. Natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Tatiyampi kho so puggalo tuṇhī ahosi. Atha kho āyasmā mahāmoggallāno taṃ puggalaṃ bāhāyaṃ gahetvā bahidvārakoṭṭhakā nikkhāmetvā sūcighaṭikaṃ datvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘nikkhāmito so, bhante, puggalo mayā. Parisuddhā parisā. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. ‘‘Acchariyaṃ, moggallāna, abbhutaṃ, moggallāna! Yāva bāhā gahaṇāpi nāma so moghapuriso āgamissatī’’ti! Atha kho bhagavā bhikkhū āmantesi – ‘‘tumheva dāni, bhikkhave, uposathaṃ kareyyātha, pātimokkhaṃ uddiseyyātha. Na dānāhaṃ, bhikkhave, ajjatagge uposathaṃ karissāmi, pātimokkhaṃ uddisissāmi. Aṭṭhānametaṃ, bhikkhave, anavakāso yaṃ tathāgato aparisuddhāya parisāya pātimokkhaṃ uddiseyya’’. ‘‘Aṭṭhime, bhikkhave, mahāsamudde acchariyā abbhutā dhammā, ye disvā disvā asurā mahāsamudde abhiramanti. Katame aṭṭha? Mahāsamuddo, bhikkhave, anupubbaninno anupubbapoṇo anupubbapabbhāro, na āyatakeneva papāto. Yampi, bhikkhave, mahāsamuddo anupubbaninno anupubbapoṇo anupubbapabbhāro, na āyatakeneva papāto; ayaṃ, bhikkhave, mahāsamudde paṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti…pe… (yathā purime tathā vitthāretabbo). ‘‘Puna caparaṃ, bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso. Tatrime bhūtā – timi timiṅgalo timirapiṅgalo asurā nāgā gandhabbā. Vasanti mahāsamudde yojanasatikāpi attabhāvā…pe… pañcayojanasatikāpi attabhāvā. Yampi, bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso; tatrime bhūtā – timi timiṅgalo timirapiṅgalo asurā nāgā gandhabbā; vasanti mahāsamudde yojanasatikāpi attabhāvā…pe… pañcayojanasatikāpi attabhāvā; ayaṃ, bhikkhave, mahāsamudde aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. Ime kho, bhikkhave, mahāsamudde aṭṭha acchariyā abbhutā dhammā, yaṃ disvā disvā asurā mahāsamudde abhiramanti. ‘‘Evamevaṃ kho, bhikkhave, aṭṭha imasmiṃ dhammavinaye acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. Katame aṭṭha? Seyyathāpi, bhikkhave, mahāsamuddo anupubbaninno anupubbapoṇo anupubbapabbhāro, na āyatakeneva papāto; evamevaṃ kho, bhikkhave, imasmiṃ dhammavinaye anupubbasikkhā anupubbakiriyā anupubbapaṭipadā, na āyatakeneva aññāpaṭivedho. Yampi, bhikkhave, imasmiṃ dhammavinaye anupubbasikkhā anupubbakiriyā anupubbapaṭipadā, na āyatakeneva aññāpaṭivedho; ayaṃ, bhikkhave, imasmiṃ dhammavinaye paṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti…pe… seyyathāpi, bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso; tatrime bhūtā – timi timiṅgalo timirapiṅgalo asurā nāgā gandhabbā, vasanti mahāsamudde yojanasatikāpi attabhāvā… pe… pañcayojanasatikāpi attabhāvā; evamevaṃ kho, bhikkhave, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso. Tatrime bhūtā – sotāpanno sotāpattiphalasacchikiriyāya paṭipanno…pe… arahā arahattāya paṭipanno. Yampi, bhikkhave, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso; tatrime bhūtā – sotāpanno sotāpattiphalasacchikiriyāya paṭipanno…pe… arahā arahattāya paṭipanno; ayaṃ, bhikkhave, imasmiṃ dhammavinaye aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. Ime kho, bhikkhave, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramantī’’ti. Dasamaṃ. ",
      "english": "Once the Blessed One was staying at Sāvatthī, in the Eastern Park, in Migāra's mother's mansion. Now on that occasion, on the Uposatha day, the Blessed One was seated, surrounded by the assembly of bhikkhus. Then, when the night was far advanced, when the first watch of the night had passed, Venerable Ānanda rose from his seat, arranged his upper robe over one shoulder, extended his joined hands towards the Blessed One, and said to him: \"The night, venerable sir, is far advanced, the first watch has passed, and the community of bhikkhus has been seated for a long time. May the Blessed One, venerable sir, recite the Pātimokkha for the bhikkhus.\" When this was said, the Blessed One remained silent. For a second time, when the night was far advanced, when the middle watch of the night had passed, Venerable Ānanda rose from his seat, arranged his upper robe over one shoulder, extended his joined hands towards the Blessed One, and said to him: \"The night, venerable sir, is far advanced, the middle watch has passed, and the community of bhikkhus has been seated for a long time. May the Blessed One, venerable sir, recite the Pātimokkha for the bhikkhus.\" For a second time, the Blessed One remained silent. For a third time, when the night was far advanced, when the last watch of the night had passed, when dawn had broken, when the night was joyful, Venerable Ānanda rose from his seat, arranged his upper robe over one shoulder, extended his joined hands towards the Blessed One, and said to him: \"The night, venerable sir, is far advanced, the last watch has passed, dawn has broken, the night is joyful; and the community of bhikkhus has been seated for a long time. May the Blessed One, venerable sir, recite the Pātimokkha for the bhikkhus.\" \"Ānanda, the assembly is impure.\"\n\nThen it occurred to Venerable Mahāmoggallāna: \"Which individual could the Blessed One be referring to when he says, 'Ānanda, the assembly is impure'?\" Then Venerable Mahāmoggallāna encompassed the entire community of bhikkhus with his mind, penetrating their minds. Venerable Mahāmoggallāna saw that individual, who was immoral, of wicked nature, impure, of doubtful conduct, with hidden deeds, not a recluse but claiming to be one, not a celibate but claiming to be one, rotten within, leaky, sprung up from rubbish, sitting in the midst of the community of bhikkhus. Having seen him, he rose from his seat and approached that individual. Having approached him, he said to that individual: \"Get up, friend! You have been seen by the Blessed One. You have no fellowship with the bhikkhus.\" When this was said, that individual remained silent. For a second time, Venerable Mahāmoggallāna said to that individual: \"Get up, friend! You have been seen by the Blessed One. You have no fellowship with the bhikkhus.\" For a second time, that individual remained silent. For a third time, Venerable Mahāmoggallāna said to that individual: \"Get up, friend! You have been seen by the Blessed One. You have no fellowship with the bhikkhus.\" For a third time, that individual remained silent. Then Venerable Mahāmoggallāna took that individual by the arm, led him out through the outer door, locked the bolt, and approached the Blessed One. Having approached him, he said to the Blessed One: \"That individual, venerable sir, has been expelled by me. The assembly is pure. May the Blessed One, venerable sir, recite the Pātimokkha for the bhikkhus.\" \"It is amazing, Moggallāna, it is astounding, Moggallāna! That foolish man would wait until he was taken by the arm!\" Then the Blessed One addressed the bhikkhus: \"Now, bhikkhus, you yourselves should perform the Uposatha and recite the Pātimokkha. From this day forward, bhikkhus, I will not perform the Uposatha nor recite the Pātimokkha. It is impossible, bhikkhus, it cannot happen that a Tathāgata would recite the Pātimokkha in an impure assembly.\"\n\n\"Bhikkhus, there are these eight amazing and astounding qualities in the great ocean, which, upon seeing, the asuras delight in the great ocean. Which eight? Bhikkhus, the great ocean gradually slopes, gradually inclines, gradually deepens, and does not drop off abruptly. That the great ocean, bhikkhus, gradually slopes, gradually inclines, gradually deepens, and does not drop off abruptly; this, bhikkhus, is the first amazing and astounding quality in the great ocean, which, upon seeing, the asuras delight in the great ocean.\n\n\"Furthermore, bhikkhus, the great ocean is the dwelling place of mighty beings. These are those beings: the Timi-fish, the Timingala-fish, the Timirapingala-fish, asuras, nāgas, and gandhabbas. Beings live in the great ocean with bodies one hundred yojanas long... up to five hundred yojanas long. That the great ocean, bhikkhus, is the dwelling place of mighty beings; these are those beings: the Timi-fish, the Timingala-fish, the Timirapingala-fish, asuras, nāgas, and gandhabbas; and beings live in the great ocean with bodies one hundred yojanas long... up to five hundred yojanas long; this, bhikkhus, is the eighth amazing and astounding quality in the great ocean, which, upon seeing, the asuras delight in the great ocean. These, bhikkhus, are the eight amazing and astounding qualities in the great ocean, which, upon seeing, the asuras delight in the great ocean.\"\n\n\"In the same way, bhikkhus, there are these eight amazing and astounding qualities in this Dhamma-Vinaya, which, upon seeing, bhikkhus delight in this Dhamma-Vinaya. Which eight? Just as, bhikkhus, the great ocean gradually slopes, gradually inclines, gradually deepens, and does not drop off abruptly; even so, bhikkhus, in this Dhamma-Vinaya there is a gradual training, a gradual practice, a gradual path, and no sudden penetration of knowledge. That in this Dhamma-Vinaya, bhikkhus, there is a gradual training, a gradual practice, a gradual path, and no sudden penetration of knowledge; this, bhikkhus, is the first amazing and astounding quality in this Dhamma-Vinaya, which, upon seeing, bhikkhus delight in this Dhamma-Vinaya.\n\n\"Just as, bhikkhus, the great ocean is the dwelling place of mighty beings; these are those beings: the Timi-fish, the Timingala-fish, the Timirapingala-fish, asuras, nāgas, and gandhabbas, and beings live in the great ocean with bodies one hundred yojanas long... up to five hundred yojanas long; even so, bhikkhus, this Dhamma-Vinaya is the dwelling place of mighty beings. These are those beings: the stream-enterer, one practicing for the realization of the fruit of stream-entry; the once-returner, one practicing for the realization of the fruit of once-returning; the non-returner, one practicing for the realization of the fruit of non-returning; the Arahant, one practicing for the realization of Arahantship. That this Dhamma-Vinaya, bhikkhus, is the dwelling place of mighty beings; these are those beings: the stream-enterer, one practicing for the realization of the fruit of stream-entry; the once-returner, one practicing for the realization of the fruit of once-returning; the non-returner, one practicing for the realization of the fruit of non-returning; the Arahant, one practicing for the realization of Arahantship; this, bhikkhus, is the eighth amazing and astounding quality in this Dhamma-Vinaya, which, upon seeing, bhikkhus delight in this Dhamma-Vinaya. These, bhikkhus, are the eight amazing and astounding qualities in this Dhamma-Vinaya, which, upon seeing, bhikkhus delight in this Dhamma-Vinaya.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයේ මිගාරමාතුප්‍රාසාදයේ වැඩවසන සේක. එවිට භාග්‍යවතුන් වහන්සේ එදින උපෝසථ දින භික්ෂුසංඝයා පිරිවරා වැඩ සිටි සේක. ඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවීරයන් වහන්සේ රාත්‍රිය ඉක්ම ගිය කල්හි, පළමු යාමය ගත වූ පසු, අසුනෙන් නැගිට, උතුරුසළුව එක අතකට කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටින දිශාවට ඇඳිලි බැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, රාත්‍රිය ඉක්ම ගියේය, පළමු යාමය ගතවූයේය, භික්ෂුසංඝයා බොහෝ වේලා සිටියේය. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට ප්‍රාතිමෝක්ෂය දේශනා කරන සේක්වා!” එසේ පැවසූ කල්හි භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දව වැඩසිටි සේක. දෙවන වරටත් ආයුෂ්මත් ආනන්ද ස්ථවීරයන් වහන්සේ රාත්‍රිය ඉක්ම ගිය කල්හි, මැද යාමය ගත වූ පසු, අසුනෙන් නැගිට, උතුරුසළුව එක අතකට කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටින දිශාවට ඇඳිලි බැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, රාත්‍රිය ඉක්ම ගියේය, මැද යාමය ගතවූයේය, භික්ෂුසංඝයා බොහෝ වේලා සිටියේය. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට ප්‍රාතිමෝක්ෂය දේශනා කරන සේක්වා!” දෙවන වරටත් භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දව වැඩසිටි සේක. තෙවන වරටත් ආයුෂ්මත් ආනන්ද ස්ථවීරයන් වහන්සේ රාත්‍රිය ඉක්ම ගිය කල්හි, අවසන් යාමය ගත වූ පසු, අරුණ නැඟී ආ පසු, ප්‍රීතිමත් රාත්‍රියේදී, අසුනෙන් නැගිට, උතුරුසළුව එක අතකට කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටින දිශාවට ඇඳිලි බැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, රාත්‍රිය ඉක්ම ගියේය, අවසන් යාමය ගතවූයේය, අරුණ නැඟී ආවේය, ප්‍රීතිමත් රාත්‍රියයි; භික්ෂුසංඝයා බොහෝ වේලා සිටියේය. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට ප්‍රාතිමෝක්ෂය දේශනා කරන සේක්වා!”\n\n“ආනන්දයෙනි, පිරිස අපිරිසිදුය.” එවිට ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවීරයන් වහන්සේට මේ සිත පහළ විය: “කවර පුද්ගලයෙකු අරභයාද භාග්‍යවතුන් වහන්සේ ‘ආනන්දයෙනි, පිරිස අපිරිසිදුය’ යැයි මෙසේ වදාළේ?” ඉන්පසු ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවීරයන් වහන්සේ සමස්ත භික්ෂුසංඝයාම චේතසිකව චේතසිකව මෙනෙහි කළ සේක. ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවීරයන් වහන්සේ භික්ෂුසංඝයා මැද හිඳ සිටි, දුශ්ශීල, පාපධර්ම ඇති, අපිරිසිදු, සැක සහිත හැසිරීම් ඇති, රහසිගත ක්‍රියා ඇති, ශ්‍රමණයෙකු නොවී ශ්‍රමණ ප්‍රතිඥා ඇති, බ්‍රහ්මචාරී නොවී බ්‍රහ්මචාරී ප්‍රතිඥා ඇති, අභ්‍යන්තරයෙන් දිරාගිය, සිඳුරු සහිත, කුණුපයක් බඳු වූ ඒ පුද්ගලයා දුටු සේක. එම පුද්ගලයා දැක, අසුනෙන් නැගිට, ඔහු වෙත එළඹ, ඒ පුද්ගලයාට මෙසේ පැවසූහ: “ඇවැත්නි, නැගිටින්න, භාග්‍යවතුන් වහන්සේ ඔබ දුටු සේක. ඔබට භික්ෂූන් සමඟ වාසය කිරීමක් නැත.” එසේ පැවසූ කල්හි ඒ පුද්ගලයා නිශ්ශබ්දව සිටියේය. දෙවන වරටත් ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවීරයන් වහන්සේ ඒ පුද්ගලයාට මෙසේ පැවසූහ: “ඇවැත්නි, නැගිටින්න, භාග්‍යවතුන් වහන්සේ ඔබ දුටු සේක. ඔබට භික්ෂූන් සමඟ වාසය කිරීමක් නැත.” දෙවන වරටත් ඒ පුද්ගලයා නිශ්ශබ්දව සිටියේය. තෙවන වරටත් ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවීරයන් වහන්සේ ඒ පුද්ගලයාට මෙසේ පැවසූහ: “ඇවැත්නි, නැගිටින්න, භාග්‍යවතුන් වහන්සේ ඔබ දුටු සේක. ඔබට භික්ෂූන් සමඟ වාසය කිරීමක් නැත.” තෙවන වරටත් ඒ පුද්ගලයා නිශ්ශබ්දව සිටියේය. ඉන්පසු ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවීරයන් වහන්සේ ඒ පුද්ගලයාගේ බාහුවෙන් අල්ලා දොරකඩින් පිටතට ගෙන ගොස්, අගුල දමා, භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹි සේක. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, ඒ පුද්ගලයා මා විසින් පිටතට ගෙන යන ලදී. පිරිස පිරිසිදුය. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට ප්‍රාතිමෝක්ෂය දේශනා කරන සේක්වා!”\n\n“මොග්ගල්ලානයෙනි, ආශ්චර්යයකි, මොග්ගල්ලානයෙනි, අද්භූතයකි! ඒ මෝඝ පුරුෂයා බාහුවෙන් අල්ලාගෙන යන්නා තුරුත් සිටියා නේද!” ඉන්පසු භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, දැන් නුඹලාම උපෝසථය කරව්, ප්‍රාතිමෝක්ෂය දේශනා කරව්. මහණෙනි, අද පටන් මම උපෝසථය නොකරමි, ප්‍රාතිමෝක්ෂය දේශනා නොකරමි. මහණෙනි, තථාගතයන් වහන්සේ අපිරිසිදු පිරිසක් ඉදිරියේ ප්‍රාතිමෝක්ෂය දේශනා කිරීම අස්ථානයකි, අවස්ථාවක් නැත්තකි.”\n\n“මහණෙනි, මේ මහා සාගරයෙහි ආශ්චර්යවත් අද්භූත ධර්ම අටක් ඇත. ඒවා දැක දැක අසුරයෝ මහා සාගරයෙහි ප්‍රීති වෙති. ඒ අට කවරේද? මහණෙනි, මහා සාගරය ක්‍රමයෙන් ගැඹුරු වන්නේය, ක්‍රමයෙන් බෑවුම් වන්නේය, ක්‍රමයෙන් බහින්නේය, එකවරම අගාධයක් නොවන්නේය. මහණෙනි, යමක් මහා සාගරය ක්‍රමයෙන් ගැඹුරු වන්නේද, ක්‍රමයෙන් බෑවුම් වන්නේද, ක්‍රමයෙන් බහින්නේද, එකවරම අගාධයක් නොවන්නේද; මහණෙනි, මෙය මහා සාගරයෙහි පළමු වන ආශ්චර්යවත් අද්භූත ධර්මයයි. එය දැක දැක අසුරයෝ මහා සාගරයෙහි ප්‍රීති වෙති. තවද මහණෙනි, මහා සාගරය මහා සතුන්ගේ වාසස්ථානයයි. එහි මේ සත්ත්වයෝ සිටිති – තිමි, තිමිංගල, තිමිරපිංගල, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ. යොදුන් සියයක් පමණ වූ ශරීර ඇති සත්ත්වයෝද මහා සාගරයෙහි වාසය කරති... යොදුන් පන්සියයක් පමණ වූ ශරීර ඇති සත්ත්වයෝද වාසය කරති. මහණෙනි, යමක් මහා සාගරය මහා සතුන්ගේ වාසස්ථානය වන්නේද; එහි මේ සත්ත්වයෝ සිටිති – තිමි, තිමිංගල, තිමිරපිංගල, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ; යොදුන් සියයක් පමණ වූ ශරීර ඇති සත්ත්වයෝද මහා සාගරයෙහි වාසය කරති... යොදුන් පන්සියයක් පමණ වූ ශරීර ඇති සත්ත්වයෝද වාසය කරති; මහණෙනි, මෙය මහා සාගරයෙහි අටවන ආශ්චර්යවත් අද්භූත ධර්මයයි. එය දැක දැක අසුරයෝ මහා සාගරයෙහි ප්‍රීති වෙති. මහණෙනි, මේ මහා සාගරයෙහි ආශ්චර්යවත් අද්භූත ධර්ම අටක් ඇත. ඒවා දැක දැක අසුරයෝ මහා සාගරයෙහි ප්‍රීති වෙති.”\n\n“මහණෙනි, එපරිද්දෙන්ම මේ ධර්ම විනයෙහිද ආශ්චර්යවත් අද්භූත ධර්ම අටක් ඇත. ඒවා දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ප්‍රීති වෙති. ඒ අට කවරේද? මහණෙනි, යම්සේ මහා සාගරය ක්‍රමයෙන් ගැඹුරු වන්නේද, ක්‍රමයෙන් බෑවුම් වන්නේද, ක්‍රමයෙන් බහින්නේද, එකවරම අගාධයක් නොවන්නේද; එපරිද්දෙන්ම මහණෙනි, මේ ධර්ම විනයෙහි ක්‍රමවත් ශික්ෂාවක් ඇත, ක්‍රමවත් ක්‍රියාවක් ඇත, ක්‍රමවත් ප්‍රතිපදාවක් ඇත, එකවරම අරහත් ඵල අවබෝධයක් නැත. මහණෙනි, යමක් මේ ධර්ම විනයෙහි ක්‍රමවත් ශික්ෂාවක්, ක්‍රමවත් ක්‍රියාවක්, ක්‍රමවත් ප්‍රතිපදාවක් ඇත්තේද, එකවරම අරහත් ඵල අවබෝධයක් නැත්තේද; මහණෙනි, මෙය මේ ධර්ම විනයෙහි පළමු වන ආශ්චර්යවත් අද්භූත ධර්මයයි. එය දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ප්‍රීති වෙති. මහණෙනි, යම්සේ මහා සාගරය මහා සතුන්ගේ වාසස්ථානය වන්නේද; එහි මේ සත්ත්වයෝ සිටිති – තිමි, තිමිංගල, තිමිරපිංගල, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ, යොදුන් සියයක් පමණ වූ ශරීර ඇති සත්ත්වයෝද මහා සාගරයෙහි වාසය කරති... යොදුන් පන්සියයක් පමණ වූ ශරීර ඇති සත්ත්වයෝද වාසය කරති; එපරිද්දෙන්ම මහණෙනි, මේ ධර්ම විනය මහා සත්ත්වයන්ගේ වාසස්ථානයයි. එහි මේ සත්ත්වයෝ සිටිති – සෝවාන් ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, සෝවාන් ඵලයට පත් වූ අය, සකදාගාමී ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, සකදාගාමී ඵලයට පත් වූ අය, අනාගාමී ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, අනාගාමී ඵලයට පත් වූ අය, අරහත් ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, අරහත් ඵලයට පත් වූ අය. මහණෙනි, යමක් මේ ධර්ම විනය මහා සත්ත්වයන්ගේ වාසස්ථානය වන්නේද; එහි මේ සත්ත්වයෝ සිටිති – සෝවාන් ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, සෝවාන් ඵලයට පත් වූ අය, සකදාගාමී ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, සකදාගාමී ඵලයට පත් වූ අය, අනාගාමී ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, අනාගාමී ඵලයට පත් වූ අය, අරහත් ඵලය සාක්ෂාත් කරගැනීම සඳහා පිළිපන් අය, අරහත් ඵලයට පත් වූ අය; මහණෙනි, මෙය මේ ධර්ම විනයෙහි අටවන ආශ්චර්යවත් අද්භූත ධර්මයයි. එය දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ප්‍රීති වෙති. මහණෙනි, මේ ධර්ම විනයෙහි ආශ්චර්යවත් අද්භූත ධර්ම අටක් ඇත. ඒවා දැක දැක භික්ෂූහු මේ ධර්ම විනයෙහි ප්‍රීති වෙති.”",
      "paliTitle": "Uposathasuttaṃ",
      "englishTitle": "The Uposatha Sutta",
      "sinhalaTitle": "උපෝසථ සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Mahāvaggo dutiyo. Tassuddānaṃ – Verañjo sīho ājaññaṃ, khaḷuṅkena malāni ca; Dūteyyaṃ dve ca bandhanā, pahārādo uposathoti.",
    "english": "Second Great Chapter: Its Summary",
    "sinhala": "දෙවෙනි මහාවග්ගය"
  }
}