{
  "id": "sn.4.8",
  "title": {
    "pali": "Gāmaṇisaṃyuttaṃ",
    "english": "The Connected Discourses with Headmen",
    "sinhala": "ගාමණි සංයුත්තය"
  },
  "sections": [
    {
      "number": 353,
      "pali": "Sāvatthinidānaṃ. Atha kho caṇḍo gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho caṇḍo gāmaṇi bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo yena midhekacco caṇḍo caṇḍotveva [yena midhekacco caṇḍoteva (sī. pī.)] saṅkhaṃ gacchati. Ko pana, bhante, hetu, ko paccayo yena midhekacco sorato soratotveva [yena midhekacco suratoteva (sī. pī.)] saṅkhaṃ gacchatī’’ti? ‘‘Idha, gāmaṇi, ekaccassa rāgo appahīno hoti. Rāgassa appahīnattā pare kopenti, parehi kopiyamāno kopaṃ pātukaroti. So caṇḍotveva saṅkhaṃ gacchati. Doso appahīno hoti. Dosassa appahīnattā pare kopenti, parehi kopiyamāno kopaṃ pātukaroti. So caṇḍotveva saṅkhaṃ gacchati. Moho appahīno hoti. Mohassa appahīnattā pare kopenti, parehi kopiyamāno kopaṃ pātukaroti. So caṇḍotveva saṅkhaṃ gacchati. Ayaṃ kho, gāmaṇi, hetu, ayaṃ paccayo yena midhekacco caṇḍo caṇḍotveva saṅkhaṃ gacchati’’. ‘‘Idha pana, gāmaṇi, ekaccassa rāgo pahīno hoti. Rāgassa pahīnattā pare na kopenti, parehi kopiyamāno kopaṃ na pātukaroti. So soratotveva saṅkhaṃ gacchati. Doso pahīno hoti. Dosassa pahīnattā pare na kopenti, parehi kopiyamāno kopaṃ na pātukaroti. So soratotveva saṅkhaṃ gacchati. Moho pahīno hoti. Mohassa pahīnattā pare na kopenti, parehi kopiyamāno kopaṃ na pātukaroti. So soratotveva saṅkhaṃ gacchati. Ayaṃ kho, gāmaṇi, hetu ayaṃ paccayo yena midhekacco sorato soratotveva saṅkhaṃ gacchatī’’ti. Evaṃ vutte, caṇḍo gāmaṇi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante, abhikkantaṃ, bhante! Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Paṭhamaṃ.",
      "english": "The discourse at Savatthi. Then Headman Canda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side.\n\nSeated to one side, Headman Canda said to the Blessed One, \"What, venerable sir, is the reason, what is the condition, by which a certain person here is reckoned as fierce? And what, venerable sir, is the reason, what is the condition, by which a certain person here is reckoned as gentle?\"\n\n\"Here, headman, for a certain person, lust is not abandoned. Because lust is not abandoned, others provoke him; being provoked by others, he displays anger. He is reckoned as fierce.\n\nHatred is not abandoned. Because hatred is not abandoned, others provoke him; being provoked by others, he displays anger. He is reckoned as fierce.\n\nDelusion is not abandoned. Because delusion is not abandoned, others provoke him; being provoked by others, he displays anger. He is reckoned as fierce.\n\nThis, headman, is the reason, this is the condition, by which a certain person here is reckoned as fierce.\"\n\n\"But here, headman, for a certain person, lust is abandoned. Because lust is abandoned, others do not provoke him; being provoked by others, he does not display anger. He is reckoned as gentle.\n\nHatred is abandoned. Because hatred is abandoned, others do not provoke him; being provoked by others, he does not display anger. He is reckoned as gentle.\n\nDelusion is abandoned. Because delusion is abandoned, others do not provoke him; being provoked by others, he does not display anger. He is reckoned as gentle.\n\nThis, headman, is the reason, this is the condition, by which a certain person here is reckoned as gentle.\"\n\nWhen this was said, Headman Canda said to the Blessed One, \"Excellent, venerable sir, excellent, venerable sir!\n\nJust as, venerable sir, one might set upright what was overturned, or uncover what was hidden, or point out the path to one who was lost, or hold up an oil lamp in the darkness so that those with eyes might see forms; even so has the Blessed One made the Dhamma clear in various ways.\n\nI go for refuge to the Blessed One, to the Dhamma, and to the community of monastics. May the Blessed One remember me as a lay follower who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "සාවත්ථියෙහිදී මේ සිද්ධිය සිදු විය. ඉන්පසු චණ්ඩ ගාමණී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි චණ්ඩ ගාමණී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, යම් පුද්ගලයෙක් දරුණු පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙන්නේ, ඊට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද? නැවතත් වහන්ස, යම් පුද්ගලයෙක් ඉවසිලිවන්ත පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙන්නේ, ඊට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?\"\n\n\"ගාමණී, මෙහිදී ඇතැම් පුද්ගලයෙකුගේ රාගය ප්‍රහීණ වී නොමැත. රාගය ප්‍රහීණ වී නොමැති හෙයින් අනුන් ඔහුව කෝපයට පත් කරති. අනුන් විසින් කෝපයට පත් කරනු ලබන විට ඔහු කෝපය ප්‍රකට කරයි. ඔහු දරුණු පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙයි. ද්වේෂය ප්‍රහීණ වී නොමැත. ද්වේෂය ප්‍රහීණ වී නොමැති හෙයින් අනුන් ඔහුව කෝපයට පත් කරති. අනුන් විසින් කෝපයට පත් කරනු ලබන විට ඔහු කෝපය ප්‍රකට කරයි. ඔහු දරුණු පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙයි. මෝහය ප්‍රහීණ වී නොමැත. මෝහය ප්‍රහීණ වී නොමැති හෙයින් අනුන් ඔහුව කෝපයට පත් කරති. අනුන් විසින් කෝපයට පත් කරනු ලබන විට ඔහු කෝපය ප්‍රකට කරයි. ඔහු දරුණු පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙයි. ගාමණී, යම් පුද්ගලයෙක් දරුණු පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙන්නේ, ඊට මේ හේතුවයි, මේ ප්‍රත්‍යයයි.\"\n\n\"ගාමණී, මෙහිදී ඇතැම් පුද්ගලයෙකුගේ රාගය ප්‍රහීණ වී ඇත. රාගය ප්‍රහීණ වී ඇති හෙයින් අනුන් ඔහුව කෝපයට පත් නොකරති. අනුන් විසින් කෝපයට පත් කරනු ලබන විට ඔහු කෝපය ප්‍රකට නොකරයි. ඔහු ඉවසිලිවන්ත පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙයි. ද්වේෂය ප්‍රහීණ වී ඇත. ද්වේෂය ප්‍රහීණ වී ඇති හෙයින් අනුන් ඔහුව කෝපයට පත් නොකරති. අනුන් විසින් කෝපයට පත් කරනු ලබන විට ඔහු කෝපය ප්‍රකට නොකරයි. ඔහු ඉවසිලිවන්ත පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙයි. මෝහය ප්‍රහීණ වී ඇත. මෝහය ප්‍රහීණ වී ඇති හෙයින් අනුන් ඔහුව කෝපයට පත් නොකරති. අනුන් විසින් කෝපයට පත් කරනු ලබන විට ඔහු කෝපය ප්‍රකට නොකරයි. ඔහු ඉවසිලිවන්ත පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙයි. ගාමණී, යම් පුද්ගලයෙක් ඉවසිලිවන්ත පුද්ගලයෙක් ලෙසින්ම ගණන් ගැනෙන්නේ, ඊට මේ හේතුවයි, මේ ප්‍රත්‍යයයි.\"\n\nමෙසේ වදාළ විට, චණ්ඩ ගාමණී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"අතිශයින්ම මනරම්ය, වහන්ස, අතිශයින්ම මනරම්ය, වහන්ස! වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වැසී ඇති දෙයක් විවෘත කරන්නේද, මග මුළා වූවෙකුට මග පෙන්වන්නේද, නැතහොත් ඇස් ඇති අයට රූප පෙනෙනු පිණිස අඳුරෙහි තෙල් පහනක් දල්වන්නේද; එලෙසින්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරනු ලැබ ඇත. වහන්ස, මම ඒ භාග්‍යවතුන් වහන්සේ සරණ යමි, ධර්මය සරණ යමි, භික්ෂුසංඝයා සරණ යමි. භාග්‍යවතුන් වහන්සේ මා අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස සලකන සේක්වා.\"\nපළමුවැන්නයි.",
      "paliTitle": "Caṇḍasuttaṃ",
      "vagga": "",
      "englishTitle": "The Fierce Sutta",
      "sinhalaTitle": "චණ්ඩ සූත්‍රය"
    },
    {
      "number": 354,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho tālapuṭo [tālaputto (sī. syā. kaṃ.)] naṭagāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho tālapuṭo naṭagāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, pubbakānaṃ ācariyapācariyānaṃ naṭānaṃ bhāsamānānaṃ – ‘yo so naṭo raṅgamajjhe samajjamajjhe saccālikena janaṃ hāseti rameti, so kāyassa bhedā paraṃ maraṇā pahāsānaṃ devānaṃ sahabyataṃ upapajjatī’ti. Idha bhagavā kimāhā’’ti? ‘‘Alaṃ, gāmaṇi, tiṭṭhatetaṃ. Mā maṃ etaṃ pucchī’’ti. Dutiyampi kho tālapuṭo naṭagāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, pubbakānaṃ ācariyapācariyānaṃ naṭānaṃ bhāsamānānaṃ – ‘yo so naṭo raṅgamajjhe samajjamajjhe saccālikena janaṃ hāseti rameti, so kāyassa bhedā paraṃ maraṇā pahāsānaṃ devānaṃ sahabyataṃ upapajjatī’ti. Idha bhagavā kimāhā’’ti? ‘‘Alaṃ, gāmaṇi, tiṭṭhatetaṃ. Mā maṃ etaṃ pucchī’’ti. Tatiyampi kho tālapuṭo naṭagāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, pubbakānaṃ ācariyapācariyānaṃ naṭānaṃ bhāsamānānaṃ – ‘yo so naṭo raṅgamajjhe samajjamajjhe saccālikena janaṃ hāseti rameti, so kāyassa bhedā paraṃ maraṇā pahāsānaṃ devānaṃ sahabyataṃ upapajjatī’ti. Idha bhagavā kimāhā’’ti? ‘‘Addhā kho tyāhaṃ, gāmaṇi, na labhāmi [nālatthaṃ (syā. kaṃ. pī. ka.)] – ‘alaṃ, gāmaṇi, tiṭṭhatetaṃ, mā maṃ etaṃ pucchī’ti. Api ca tyāhaṃ byākarissāmi. Pubbe kho, gāmaṇi, sattā avītarāgā rāgabandhanabaddhā. Tesaṃ naṭo raṅgamajjhe samajjamajjhe ye dhammā rajanīyā te upasaṃharati bhiyyosomattāya. Pubbe kho, gāmaṇi, sattā avītadosā dosabandhanabaddhā. Tesaṃ naṭo raṅgamajjhe samajjamajjhe ye dhammā dosanīyā te upasaṃharati bhiyyosomattāya. Pubbe kho, gāmaṇi, sattā avītamohā mohabandhanabaddhā. Tesaṃ naṭo raṅgamajjhe samajjamajjhe ye dhammā mohanīyā te upasaṃharati bhiyyosomattāya. So attanā matto pamatto pare madetvā pamādetvā kāyassa bhedā paraṃ maraṇā pahāso nāma nirayo tattha upapajjati. Sace kho panassa evaṃdiṭṭhi hoti – ‘yo so naṭo raṅgamajjhe samajjamajjhe saccālikena janaṃ hāseti rameti, so kāyassa bhedā paraṃ maraṇā pahāsānaṃ devānaṃ sahabyataṃ upapajjatī’ti, sāssa hoti micchādiṭṭhi. Micchādiṭṭhikassa kho panāhaṃ, gāmaṇi, purisapuggalassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – nirayaṃ vā tiracchānayoniṃ vā’’ti. Evaṃ vutte, tālapuṭo naṭagāmaṇi, parodi, assūni pavattesi. ‘‘Etaṃ kho tyāhaṃ, gāmaṇi, nālatthaṃ – ‘alaṃ, gāmaṇi, tiṭṭhatetaṃ; mā maṃ etaṃ pucchī’’’ti. ‘‘Nāhaṃ, bhante, etaṃ rodāmi yaṃ maṃ bhagavā evamāha; api cāhaṃ, bhante, pubbakehi ācariyapācariyehi naṭehi dīgharattaṃ nikato vañcito paluddho – ‘yo so naṭo raṅgamajjhe samajjamajjhe saccālikena janaṃ hāseti rameti so kāyassa bhedā paraṃ maraṇā pahāsānaṃ devānaṃ sahabyataṃ upapajjatī’’’ti. ‘‘Abhikkantaṃ, bhante, abhikkantaṃ, bhante! Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṃ, bhante, bhagavato santike pabbajjaṃ, labheyyaṃ upasampada’’nti. Alattha kho tālapuṭo naṭagāmaṇi bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno ca panāyasmā tālapuṭo…pe… arahataṃ ahosīti. Dutiyaṃ.",
      "english": "At one time the Blessed One was staying in Rājagaha, in the Bamboo Grove at Kalandakanivāpa. Then Tālapuṭa the Chief Actor approached the Blessed One. Having approached and paid respects to the Blessed One, he sat down to one side. As he sat to one side, Tālapuṭa the Chief Actor said to the Blessed One: \"Venerable Sir, I have heard it said by the former teachers and master actors, our predecessors, that 'Any actor who, in the midst of a performance, in the midst of a festival, makes people laugh and delights them with both truth and falsehood, is reborn after the dissolution of the body and after death into the companionship of the Laughing Devas.' What does the Blessed One say about this?\" \"Enough, Chief! Let that be. Do not ask me about this.\" For a second time, Tālapuṭa the Chief Actor said to the Blessed One: \"Venerable Sir, I have heard it said by the former teachers and master actors, our predecessors, that 'Any actor who, in the midst of a performance, in the midst of a festival, makes people laugh and delights them with both truth and falsehood, is reborn after the dissolution of the body and after death into the companionship of the Laughing Devas.' What does the Blessed One say about this?\" \"Enough, Chief! Let that be. Do not ask me about this.\" For a third time, Tālapuṭa the Chief Actor said to the Blessed One: \"Venerable Sir, I have heard it said by the former teachers and master actors, our predecessors, that 'Any actor who, in the midst of a performance, in the midst of a festival, makes people laugh and delights them with both truth and falsehood, is reborn after the dissolution of the body and after death into the companionship of the Laughing Devas.' What does the Blessed One say about this?\" \"Indeed, Chief, I cannot make you stop from asking, saying: 'Enough, Chief, let that be, do not ask me about this.' Therefore, I will explain it to you. In the past, Chief, beings were unpurified of lust, bound by the fetter of lust. For them, an actor, in the midst of a performance, in the midst of a festival, presents things that excite lust, causing it to increase even more. In the past, Chief, beings were unpurified of hatred, bound by the fetter of hatred. For them, an actor, in the midst of a performance, in the midst of a festival, presents things that excite hatred, causing it to increase even more. In the past, Chief, beings were unpurified of delusion, bound by the fetter of delusion. For them, an actor, in the midst of a performance, in the midst of a festival, presents things that excite delusion, causing it to increase even more. Such a person, himself intoxicated and heedless, having intoxicated and caused others to be heedless, is reborn, after the dissolution of the body and after death, into a hell called Pahāsa (Hell of Laughter/Mockery). If, furthermore, he holds such a view as this: 'Any actor who, in the midst of a performance, in the midst of a festival, makes people laugh and delights them with both truth and falsehood, is reborn after the dissolution of the body and after death into the companionship of the Laughing Devas,' then that is his wrong view. And I declare to such a person, Chief, to such an individual holding wrong view, one of two destinations: either hell or the animal realm.\"\n\nWhen this was said, Tālapuṭa the Chief Actor wept and shed tears. \"Chief, I was unable to make you stop, saying: 'Enough, Chief, let that be; do not ask me about this.'\" \"Venerable Sir, I do not weep because the Blessed One said this to me; rather, Venerable Sir, I have long been deceived, cheated, and deluded by those former teachers and master actors who said: 'Any actor who, in the midst of a performance, in the midst of a festival, makes people laugh and delights them with both truth and falsehood, is reborn after the dissolution of the body and after death into the companionship of the Laughing Devas.'\"\n\n\"Excellent, Venerable Sir! Excellent, Venerable Sir! Just as, Venerable Sir, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or carry an oil lamp in the darkness so that those with eyes may see forms; in the same way, the Dhamma has been made clear by the Blessed One in various ways. Venerable Sir, I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha of monks. May I receive the going forth in the Blessed One's presence, and may I receive the full ordination.\"\n\nThen Tālapuṭa the Chief Actor received the going forth in the Blessed One's presence, and he received the full ordination. Not long after his full ordination, Venerable Tālapuṭa became an Arahant.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලන්දක නිවාප නම් ස්ථානයේ වැඩසිටියාහ. එකල්හි තාලපුට නම් වූ නාටක ගාමණි භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි තාලපුට නාටක ගාමණි භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, මා විසින් අසා ඇත, පෙර සිටි ගුරු පරම්පරාවල නළු නාටක ශිල්පීන් පවසන දෙයක් නම්, 'යම් ඒ නළුවෙක් වේද, ඔහු රංග වේදිකාව මැද, සභා මැද, සත්‍ය අසත්‍ය මිශ්‍ර දේවලින් ජනයා සිනහ ගන්වා, විනෝද කරවන්නේද, ඔහු කය බිඳී මරණින් මතු 'පහාස' නම් දෙවියන්ගේ සහවාසයට උපදියි' කියායි. මේ පිළිබඳව භාග්‍යවතුන් වහන්සේ කුමක් පවසන සේක්ද?\" \"ගාමණි, එය ප්‍රමාණවත්ය, එය එසේම තිබේවා. මාගෙන් මේ ගැන නොවිමසන්න.\"\n\nදෙවෙනි වරටත් තාලපුට නාටක ගාමණි භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, මා විසින් අසා ඇත, පෙර සිටි ගුරු පරම්පරාවල නළු නාටක ශිල්පීන් පවසන දෙයක් නම්, 'යම් ඒ නළුවෙක් වේද, ඔහු රංග වේදිකාව මැද, සභා මැද, සත්‍ය අසත්‍ය මිශ්‍ර දේවලින් ජනයා සිනහ ගන්වා, විනෝද කරවන්නේද, ඔහු කය බිඳී මරණින් මතු 'පහාස' නම් දෙවියන්ගේ සහවාසයට උපදියි' කියායි. මේ පිළිබඳව භාග්‍යවතුන් වහන්සේ කුමක් පවසන සේක්ද?\" \"ගාමණි, එය ප්‍රමාණවත්ය, එය එසේම තිබේවා. මාගෙන් මේ ගැන නොවිමසන්න.\"\n\nතෙවෙනි වරටත් තාලපුට නාටක ගාමණි භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, මා විසින් අසා ඇත, පෙර සිටි ගුරු පරම්පරාවල නළු නාටක ශිල්පීන් පවසන දෙයක් නම්, 'යම් ඒ නළුවෙක් වේද, ඔහු රංග වේදිකාව මැද, සභා මැද, සත්‍ය අසත්‍ය මිශ්‍ර දේවලින් ජනයා සිනහ ගන්වා, විනෝද කරවන්නේද, ඔහු කය බිඳී මරණින් මතු 'පහාස' නම් දෙවියන්ගේ සහවාසයට උපදියි' කියායි. මේ පිළිබඳව භාග්‍යවතුන් වහන්සේ කුමක් පවසන සේක්ද?\" \"ගාමණි, 'එය ප්‍රමාණවත්ය, එය එසේම තිබේවා, මාගෙන් මේ ගැන නොවිමසන්න' කියා මා පැවසුවත්, නුඹ මට ඉඩ නොදෙන බව සැබැවින්ම දකිමි. එහෙයින්, මම නුඹට මෙය විවරණය කරන්නෙමි.\"\n\n\"ගාමණි, පෙර සිටම සත්ත්වයෝ තෘෂ්ණාවෙන් මිදුණේ නැත, රාග බන්ධනයෙන් බැඳී සිටිති. ඔවුන්ට නළුවා රංග වේදිකාව මැද, සභා මැද, රාගය උපදවන යම් ධර්ම කාරණා වේද, ඒවා වඩාත් තදින් ඉදිරිපත් කරයි. ගාමණි, පෙර සිටම සත්ත්වයෝ ද්වේෂයෙන් මිදුණේ නැත, ද්වේෂ බන්ධනයෙන් බැඳී සිටිති. ඔවුන්ට නළුවා රංග වේදිකාව මැද, සභා මැද, ද්වේෂය උපදවන යම් ධර්ම කාරණා වේද, ඒවා වඩාත් තදින් ඉදිරිපත් කරයි. ගාමණි, පෙර සිටම සත්ත්වයෝ මෝහයෙන් මිදුණේ නැත, මෝහ බන්ධනයෙන් බැඳී සිටිති. ඔවුන්ට නළුවා රංග වේදිකාව මැද, සභා මැද, මෝහය උපදවන යම් ධර්ම කාරණා වේද, ඒවා වඩාත් තදින් ඉදිරිපත් කරයි. ඔහු (නළුවා) තමාම මත් වී, පමා වී, අනුන් මත් කරවා, පමා කරවා, කය බිඳී මරණින් මතු 'පහාස' නම් නිරයෙහි උපදියි.\"\n\n\"යම් හෙයකින් ඔහුට (නළුවාට) මෙවන් මිථ්‍යා දෘෂ්ටියක් වේද, එනම්, 'යම් ඒ නළුවෙක් වේද, ඔහු රංග වේදිකාව මැද, සභා මැද, සත්‍ය අසත්‍ය මිශ්‍ර දේවලින් ජනයා සිනහ ගන්වා, විනෝද කරවන්නේද, ඔහු කය බිඳී මරණින් මතු 'පහාස' නම් දෙවියන්ගේ සහවාසයට උපදියි' කියා, එය ඔහුගේ මිථ්‍යා දෘෂ්ටියක් වේ. ගාමණි, එවන් මිථ්‍යා දෘෂ්ටියක් ඇති පුද්ගලයෙකුට මම ගති දෙකෙන් එක ගතියක් පවසමි – එනම් නිරය හෝ තිරිසන් යෝනියයි.\"\n\nමෙසේ පැවසූ කල්හි, තාලපුට නාටක ගාමණි හඬා වැටුණේය, කඳුළු සැලුවේය. \"ගාමණි, 'එය ප්‍රමාණවත්ය, එය එසේම තිබේවා, මාගෙන් මේ ගැන නොවිමසන්න' කියා මා ඔබට පැවසූයේ මේ නිසයි.\" එවිට තාලපුට නාටක ගාමණි මෙසේ පැවසීය: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මෙසේ පැවසීම නිසා මම හඬන්නේ නැත. එහෙත් ස්වාමීනි, 'යම් ඒ නළුවෙක් වේද, ඔහු රංග වේදිකාව මැද, සභා මැද, සත්‍ය අසත්‍ය මිශ්‍ර දේවලින් ජනයා සිනහ ගන්වා, විනෝද කරවන්නේද, ඔහු කය බිඳී මරණින් මතු 'පහාස' නම් දෙවියන්ගේ සහවාසයට උපදියි' කියා, මා දීර්ඝ කාලයක් මුළුල්ලේ පෙර සිටි ගුරු පරම්පරාවල නළු ශිල්පීන් විසින් රැවටීමට ලක් කරනු ලැබූ හෙයින්, වංචා කරනු ලැබූ හෙයින්, මුලා කරනු ලැබූ හෙයින් මම හඬමි.\"\n\n\"ඉතා යහපත්ය ස්වාමීනි, ඉතා යහපත්ය ස්වාමීනි! ස්වාමීනි, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කර දක්වන්නේද, මඟ වැරදුන කෙනෙකුට මඟ පෙන්වන්නේද, අඳුරේ සිටින්නෙකුට තෙල් පහනක් දල්වා තබන්නේද – ඇස් ඇති අය රූප දකින්නා සේ; එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරන ලදී. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ සරණ යමි, ධර්මයද, භික්‍ෂුසංඝයාද සරණ යමි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලබන්නට මට අවසර ලැබේවා, උපසම්පදාව ලබන්නට මට අවසර ලැබේවා.\"\n\nතාලපුට නාටක ගාමණි භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලැබීය, උපසම්පදාවද ලැබීය. වැඩි කලක් නොගොස් ආයුෂ්මත් තාලපුට රහත් භාවයට පත්විය.",
      "paliTitle": "Tālapuṭasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse to Tālapuṭa",
      "sinhalaTitle": "තාලපුට සූත්‍රය"
    },
    {
      "number": 355,
      "pali": "Atha kho yodhājīvo gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe… ekamantaṃ nisinno kho yodhājīvo gāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, pubbakānaṃ ācariyapācariyānaṃ yodhājīvānaṃ bhāsamānānaṃ – ‘yo so yodhājīvo saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’ti. Idha bhagavā kimāhā’’ti? ‘‘Alaṃ, gāmaṇi, tiṭṭhatetaṃ; mā maṃ etaṃ pucchī’’ti. Dutiyampi kho…pe… tatiyampi kho yodhājīvo gāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, pubbakānaṃ ācariyapācariyānaṃ yodhājīvānaṃ bhāsamānānaṃ – ‘yo so yodhājīvo saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’ti. Idha bhagavā kimāhā’’ti? ‘‘Addhā kho tyāhaṃ, gāmaṇi, na labhāmi – ‘alaṃ, gāmaṇi, tiṭṭhatetaṃ; mā maṃ etaṃ pucchī’ti. Api ca tyāhaṃ byākarissāmi. Yo so, gāmaṇi, yodhājīvo saṅgāme ussahati vāyamati, tassa taṃ cittaṃ pubbe gahitaṃ [hīnaṃ (sī. pī.)] dukkaṭaṃ duppaṇihitaṃ – ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesuṃ iti vā’ti. Tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti; so kāyassa bhedā paraṃ maraṇā parajito nāma nirayo tattha upapajjatīti. Sace kho panassa evaṃ diṭṭhi hoti – ‘yo so yodhājīvo saṅgāme ussahati vāyamati tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’ti, sāssa hoti micchādiṭṭhi. Micchādiṭṭhikassa kho panāhaṃ, gāmaṇi, purisapuggalassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – nirayaṃ vā tiracchānayoniṃ vā’’ti. Evaṃ vutte, yodhājīvo gāmaṇi parodi, assūni pavattesi. ‘‘Etaṃ kho tyāhaṃ, gāmaṇi, nālatthaṃ – ‘alaṃ, gāmaṇi, tiṭṭhatetaṃ; mā maṃ etaṃ pucchī’’’ti. ‘‘Nāhaṃ, bhante, etaṃ rodāmi yaṃ maṃ bhagavā evamāha; apicāhaṃ, bhante, pubbakehi ācariyapācariyehi yodhājīvehi dīgharattaṃ nikato vañcito paluddho – ‘yo so yodhājīvo saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’’’ti. ‘‘Abhikkantaṃ, bhante…pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Tatiyaṃ.",
      "english": "Then, the warrior chieftain Yodhājīva approached the Blessed One. Having approached, exchanged greetings, and sat down to one side, the warrior chieftain Yodhājīva said this to the Blessed One: “Venerable Sir, I have heard from the warrior chieftains, my former teachers and their teachers, speaking thus: ‘That warrior who, in battle, strives and exerts himself, and while striving and exerting himself, others strike him down and destroy him—upon the breaking up of the body, after death, he reappears in the company of the vanquished devas.’ What does the Blessed One say regarding this?”\n\n“Enough, Chieftain, let that be. Do not ask me about this.”\n\nA second time, and a third time, the warrior chieftain Yodhājīva said this to the Blessed One: “Venerable Sir, I have heard from the warrior chieftains, my former teachers and their teachers, speaking thus: ‘That warrior who, in battle, strives and exerts himself, and while striving and exerting himself, others strike him down and destroy him—upon the breaking up of the body, after death, he reappears in the company of the vanquished devas.’ What does the Blessed One say regarding this?”\n\n“Certainly, Chieftain, I cannot prevent you by saying, ‘Enough, Chieftain, let that be; do not ask me about this.’ Nevertheless, I will explain it to you. That warrior, Chieftain, who strives and exerts himself in battle, his mind was previously taken up by a base, unskillful, and wrongly directed intention: ‘May these beings be slain, or bound, or annihilated, or destroyed, or may they not exist!’ And while he is striving and exerting himself, others strike him down and destroy him. Upon the breaking up of the body, after death, he reappears in a hell called 'The Vanquished'. If, furthermore, he holds such a view as this: ‘That warrior who, in battle, strives and exerts himself, and while striving and exerting himself, others strike him down and destroy him—upon the breaking up of the body, after death, he reappears in the company of the vanquished devas,’ that is his wrong view. And for a person holding wrong view, Chieftain, I declare one of two destinations: either hell or the animal realm.”\n\nWhen this was said, the warrior chieftain Yodhājīva wept and shed tears.\n\n“This, Chieftain, I could not prevent you from hearing by saying, ‘Enough, Chieftain, let that be; do not ask me about this.’”\n\n“Venerable Sir, I do not weep because the Blessed One spoke to me thus. Rather, Venerable Sir, for a long time I have been deceived, cheated, and deluded by the warrior chieftains, my former teachers and their teachers, who taught: ‘That warrior who, in battle, strives and exerts himself, and while striving and exerting himself, others strike him down and destroy him—upon the breaking up of the body, after death, he reappears in the company of the vanquished devas.’”\n\n“Excellent, Venerable Sir! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes might see forms—in the same way has the Blessed One made the Dhamma clear in various ways. I go to the Blessed One for refuge, to the Dhamma, and to the Saṅgha of bhikkhus. From this day forth, for as long as life lasts, I take refuge in them.”",
      "sinhala": "එවිට යෝධාජීව ගාමණී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව වාඩි වී, භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ස්වාමීනි, මම පෙර විසූ ආචාර්ය ප්‍රාචාර්යවරුන් වූ යෝධාජීවයන් කතා කරන විට මෙය අසා ඇත්තෙමි: ‘යම් යෝධාජීවයෙක් යුධබිමේ උත්සාහ කරන්නේ නම්, වෑයම් කරන්නේ නම්, උත්සාහ කරමින් වෑයම් කරමින් සිටින ඔහුට අන්‍යයන් විසින් පහර දී මරා දමනු ලැබේ නම්, ඔහු කය බිඳී මරණින් මතු පරාජිත නම් දෙවියන්ගේ සහවාසයට පැමිණෙන්නේය’ කියා. මේ පිළිබඳව භාග්‍යවතුන් වහන්සේ කුමක් වදාරන සේක්ද?”\n\n“ගාමණී, මෙය නවත්වන්න. මාගෙන් මෙය අසන්න එපා.”\n\nදෙවැනි වරටත් යෝධාජීව ගාමණී භාග්‍යවතුන් වහන්සේට මෙය කීවේය. තෙවැනි වරටත් යෝධාජීව ගාමණී භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ස්වාමීනි, මම පෙර විසූ ආචාර්ය ප්‍රාචාර්යවරුන් වූ යෝධාජීවයන් කතා කරන විට මෙය අසා ඇත්තෙමි: ‘යම් යෝධාජීවයෙක් යුධබිමේ උත්සාහ කරන්නේ නම්, වෑයම් කරන්නේ නම්, උත්සාහ කරමින් වෑයම් කරමින් සිටින ඔහුට අන්‍යයන් විසින් පහර දී මරා දමනු ලැබේ නම්, ඔහු කය බිඳී මරණින් මතු පරාජිත නම් දෙවියන්ගේ සහවාසයට පැමිණෙන්නේය’ කියා. මේ පිළිබඳව භාග්‍යවතුන් වහන්සේ කුමක් වදාරන සේක්ද?”\n\n“ගාමණී, ‘ගාමණී, මෙය නවත්වන්න. මාගෙන් මෙය අසන්න එපා’ යැයි කීමට නියත වශයෙන්ම මා හට නොලැබේ. එහෙත් මම ඔබට පැහැදිලි කරන්නෙමි. ගාමණී, යම් යෝධාජීවයෙක් යුධබිමේ උත්සාහ කරන්නේ නම්, වෑයම් කරන්නේ නම්, ඔහුගේ ඒ සිත ‘මේ සත්වයෝ මැරෙත්වා හෝ, බැඳගනිත්වා හෝ, විනාශ වෙත්වා හෝ, නැති වී යත්වා හෝ, නැතිම වෙත්වා හෝ’ යනුවෙන් පෙර සිටම ඇතිකරගත් දුෂ්කර වූ, වැරදි ලෙස පිහිටුවා ගත් අකුසල සිතිවිල්ලකි. උත්සාහ කරමින් වෑයම් කරමින් සිටින ඔහුට අන්‍යයන් විසින් පහර දී මරා දමනු ලැබුවහොත්, ඔහු කය බිඳී මරණින් මතු පරාජිත නම් වූ නිරයට එහි උපදී. යම් හෙයකින් ඔහුගේ දෘෂ්ටිය මෙසේ වේ නම්: ‘යම් යෝධාජීවයෙක් යුධබිමේ උත්සාහ කරන්නේ නම්, වෑයම් කරන්නේ නම්, උත්සාහ කරමින් වෑයම් කරමින් සිටින ඔහුට අන්‍යයන් විසින් පහර දී මරා දමනු ලැබේ නම්, ඔහු කය බිඳී මරණින් මතු පරාජිත නම් දෙවියන්ගේ සහවාසයට පැමිණෙන්නේය’ කියා, එය ඔහුගේ මිත්‍යාදෘෂ්ටිය වේ. ගාමණී, මිත්‍යාදෘෂ්ටික වූ ඒ පුද්ගලයාට මම ගති දෙකෙන් එක ගතියක් කියමි; එනම් නිරය හෝ තිරිසන් යෝනිය හෝ යනුවෙනි.”\n\nමෙසේ කී කල්හි, යෝධාජීව ගාමණී හැඬුවේය, කඳුළු වගුරුවා. “ගාමණී, ‘ගාමණී, මෙය නවත්වන්න. මාගෙන් මෙය අසන්න එපා’ යනුවෙන් කීමට නියත වශයෙන්ම මට නොලැබුණේ මෙයයි.”\n\n“ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මා හට මෙසේ වදාළ නිසා මම හඬන්නේ නැත. එහෙත්, ස්වාමීනි, ‘යම් යෝධාජීවයෙක් යුධබිමේ උත්සාහ කරන්නේ නම්, වෑයම් කරන්නේ නම්, උත්සාහ කරමින් වෑයම් කරමින් සිටින ඔහුට අන්‍යයන් විසින් පහර දී මරා දමනු ලැබේ නම්, ඔහු කය බිඳී මරණින් මතු පරාජිත නම් දෙවියන්ගේ සහවාසයට පැමිණෙන්නේය’ යනුවෙන් පෙර විසූ ආචාර්ය ප්‍රාචාර්යවරුන් වූ යෝධාජීවයන් විසින් දීර්ඝ කාලයක් මුළුල්ලේ මම රැවටී, වංචාවට හසුවී, මුළා වී සිටියෙමි.”\n\n“ස්වාමීනි, ඉතා යහපත්ය, ඉතා යහපත්ය! ස්වාමීනි, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මග පෙන්වන්නේද, අඳුරෙහි තෙල් පහනක් දල්වන්නේද, ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යි සිතා; එලෙසින්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය දේශනා කරනු ලැබුවේය. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ සරණ යමි, ධර්මය සරණ යමි, සංඝයා සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Yodhājīvasuttaṃ",
      "vagga": "",
      "englishTitle": "The Warrior Sutta",
      "sinhalaTitle": "යෝධාජීව සූත්‍රය"
    },
    {
      "number": 356,
      "pali": "Atha kho hatthāroho gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe… ajjatagge pāṇupetaṃ saraṇaṃ gatanti. Catutthaṃ.",
      "english": "Then, the village headman Hatthāroha approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side and declared: 'From this day forth, for as long as life lasts, I go for refuge.'",
      "sinhala": "ඉක්බිති හත්ථාරෝහ ගාමණී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, අද පටන් ජීවිතය පවතින තාක් සරණ ගියේය. හතරවැන්නයි.",
      "paliTitle": "Hatthārohasuttaṃ",
      "vagga": "",
      "englishTitle": "The Elephant Rider Sutta",
      "sinhalaTitle": "හත්ථාරෝහ සූත්‍රය"
    },
    {
      "number": 357,
      "pali": "Atha kho assāroho gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho assāroho gāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, pubbakānaṃ ācariyapācariyānaṃ assārohānaṃ bhāsamānānaṃ – ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’ti. Idha bhagavā kimāhā’’ti? ‘‘Alaṃ, gāmaṇi, tiṭṭhatetaṃ; mā maṃ etaṃ pucchī’’ti. Dutiyampi kho…pe… tatiyampi kho assāroho gāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, pubbakānaṃ ācariyapācariyānaṃ assārohānaṃ bhāsamānānaṃ – ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’ti. Idha bhagavā kimāhā’’ti? ‘‘Addhā kho tyāhaṃ, gāmaṇi, na labhāmi – ‘alaṃ, gāmaṇi, tiṭṭhatetaṃ; mā maṃ etaṃ pucchī’ti. Api ca kho tyāhaṃ byākarissāmi. Yo so, gāmaṇi, assāroho saṅgāme ussahati vāyamati tassa taṃ cittaṃ pubbe gahitaṃ dukkaṭaṃ duppaṇihitaṃ – ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā ahesuṃ iti vā’ti. Tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajito nāma nirayo tattha upapajjati. Sace kho panassa evaṃ diṭṭhi hoti – ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’ti, sāssa hoti micchādiṭṭhi. Micchādiṭṭhikassa kho panāhaṃ gāmaṇi, purisapuggalassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – nirayaṃ vā tiracchānayoniṃ vā’’ti. Evaṃ vutte, assāroho gāmaṇi parodi, assūni pavattesi. ‘‘Etaṃ kho tyāhaṃ, gāmaṇi, nālatthaṃ – ‘alaṃ, gāmaṇi, tiṭṭhatetaṃ; mā maṃ etaṃ pucchī’’’ti. ‘‘Nāhaṃ, bhante, etaṃ rodāmi yaṃ maṃ bhagavā evamāha. Apicāhaṃ, bhante, pubbakehi ācariyapācariyehi assārohehi dīgharattaṃ nikato vañcito paluddho – ‘yo so assāroho saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti, so kāyassa bhedā paraṃ maraṇā parajitānaṃ devānaṃ sahabyataṃ upapajjatī’’’ti. ‘‘Abhikkantaṃ, bhante…pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ.",
      "english": "Then indeed, the horseman chief approached the Blessed One. Having approached, he sat down to one side. Sitting to one side, the horseman chief said to the Blessed One, \"I have heard, venerable sir, from the senior teachers and master teachers of horsemen, speaking thus: ‘That horseman who strives and exerts himself in battle, and while he strives and exerts himself, others strike him down and destroy him, upon the breaking up of the body, after death, he reappears in the company of the vanquished devas.’ What does the Blessed One say about this?\" \"Enough, chief, let that be. Do not ask me about this.\"\n\nA second time... and a third time too, the horseman chief said to the Blessed One, \"I have heard, venerable sir, from the senior teachers and master teachers of horsemen, speaking thus: ‘That horseman who strives and exerts himself in battle, and while he strives and exerts himself, others strike him down and destroy him, upon the breaking up of the body, after death, he reappears in the company of the vanquished devas.’ What does the Blessed One say about this?\" \"It is certain, chief, that I cannot get you to stop – ‘Enough, chief, let that be; do not ask me about this.’ Therefore, I will explain it to you.\"\n\n\"That horseman, chief, who strives and exerts himself in battle, his mind was previously seized by ill-will, wrongly directed – with thoughts such as, ‘May these beings be slain, or bound, or annihilated, or destroyed, or may they not exist!’ And while he strives and exerts himself, others strike him down and destroy him, upon the breaking up of the body, after death, he reappears in the hell called 'the vanquished'. If, moreover, he holds such a view – ‘That horseman who strives and exerts himself in battle, and while he strives and exerts himself, others strike him down and destroy him, upon the breaking up of the body, after death, he reappears in the company of the vanquished devas’ – that is his wrong view. For such a person, chief, who holds a wrong view, I declare one of two destinations: either hell or the animal realm.\"\n\nWhen this was said, the horseman chief cried, shedding tears. \"Indeed, chief, I was unable to get you to stop – ‘Enough, chief, let that be; do not ask me about this.’\"\n\n\"I am not crying, venerable sir, because the Blessed One said this to me. But rather, venerable sir, for a long time I have been deceived, cheated, and deluded by my senior teachers and master teachers of horsemen, who said: ‘That horseman who strives and exerts himself in battle, and while he strives and exerts himself, others strike him down and destroy him, upon the breaking up of the body, after death, he reappears in the company of the vanquished devas.’\" \"Excellent, venerable sir! Excellent, venerable sir! Just as if someone were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes could see forms, in the same way has the Blessed One made the Dhamma clear in various ways. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May the Blessed One remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "ඉන්පසු අස්ආරෝහ ගාමණී භාග්‍යවතුන් වහන්සේ වෙත එළඹ, එළඹ එක්පසෙක වාඩි විය. එක්පසෙක වාඩි වී සිටි අස්ආරෝහ ගාමණී භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ස්වාමීනි, පෙර සිටි ආචාර්ය-ප්‍රාචාර්ය අස්ආරෝහකයින් කතා කළ දේ මම අසා ඇත්තෙමි – ‘යම් අස්ආරෝහකයෙක් සටනේදී උත්සාහ කරයි, වීර්යය කරයිද, උත්සාහ කරන, වීර්යය කරන ඔහුට අන්‍යයෝ පහර දී විනාශ කරති, ඔහු කය බිඳී මරණයෙන් පසු පරාජිත නම් දෙවිවරුන්ගේ සහභාගිත්වයට පැමිණෙන්නේය’ කියා. මෙහිදී භාග්‍යවතුන් වහන්සේ කුමක් වදාරන සේක්ද?\" \"ගාමණී, එය නවතන්න; මාගෙන් ඒ පිළිබඳව නොඅසන්න\" යැයි වදාළ සේක. දෙවෙනි වරටත්, තෙවෙනි වරටත් අස්ආරෝහ ගාමණී භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ස්වාමීනි, පෙර සිටි ආචාර්ය-ප්‍රාචාර්ය අස්ආරෝහකයින් කතා කළ දේ මම අසා ඇත්තෙමි – ‘යම් අස්ආරෝහකයෙක් සටනේදී උත්සාහ කරයි, වීර්යය කරයිද, උත්සාහ කරන, වීර්යය කරන ඔහුට අන්‍යයෝ පහර දී විනාශ කරති, ඔහු කය බිඳී මරණයෙන් පසු පරාජිත නම් දෙවිවරුන්ගේ සහභාගිත්වයට පැමිණෙන්නේය’ කියා. මෙහිදී භාග්‍යවතුන් වහන්සේ කුමක් වදාරන සේක්ද?\" \"ගාමණී, 'එය නවතන්න, මාගෙන් ඒ පිළිබඳව නොඅසන්න' යැයි කියා ඔබට එයින් වළක්වාලීමට මට නොහැක. එහෙත් මම ඔබට එය විස්තර කරමි. ගාමණී, යම් අස්ආරෝහකයෙක් සටනේදී උත්සාහ කරයි, වීර්යය කරයිද, ඔහුගේ ඒ සිත ‘මේ සත්ත්වයෝ මැරෙත්වා, බැඳී යත්වා, සිඳී යත්වා, විනාශ වෙත්වා, නැති වෙත්වා’ යන අදහසින් පෙරදී දුෂ්කෘත වූ, නපුරු ලෙස පිහිටුවා ගත් එකකි. උත්සාහ කරන, වීර්යය කරන ඔහුට අන්‍යයෝ පහර දී විනාශ කරති, ඔහු කය බිඳී මරණයෙන් පසු පරාජිත නම් නිරයෙහි උපදී. යම් හෙයකින් ඔහුට ‘යම් අස්ආරෝහකයෙක් සටනේදී උත්සාහ කරයි, වීර්යය කරයිද, උත්සාහ කරන, වීර්යය කරන ඔහුට අන්‍යයෝ පහර දී විනාශ කරති, ඔහු කය බිඳී මරණයෙන් පසු පරාජිත නම් දෙවිවරුන්ගේ සහභාගිත්වයට පැමිණෙන්නේය’ යන මෙවැනි දෘෂ්ටියක් වේ නම්, ඒ ඔහුගේ මිථ්‍යාදෘෂ්ටියක් වේ. ගාමණී, මිථ්‍යාදෘෂ්ටියක් ඇති ඒ පුරුෂ පුද්ගලයාට මම ගති දෙකකින් එක ගතියක් කියමි – නිරය හෝ තිරිසන් යෝනිය වේ\" යැයි වදාළ සේක.\n\nමෙසේ වදාළ කල්හි, අස්ආරෝහ ගාමණී හැඬුවේය, කඳුළු හෙලීය. \"ගාමණී, 'එය නවතන්න; මාගෙන් ඒ පිළිබඳව නොඅසන්න' යැයි කියා ඔබට එයින් වළක්වාලීමට මට නොහැකි විය.\" \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට මෙසේ වදාළ නිසා මම හඬන්නේ නැත. එහෙත් ස්වාමීනි, ‘යම් අස්ආරෝහකයෙක් සටනේදී උත්සාහ කරයි, වීර්යය කරයිද, උත්සාහ කරන, වීර්යය කරන ඔහුට අන්‍යයෝ පහර දී විනාශ කරති, ඔහු කය බිඳී මරණයෙන් පසු පරාජිත නම් දෙවිවරුන්ගේ සහභාගිත්වයට පැමිණෙන්නේය’ කියා පෙර සිටි ආචාර්ය-ප්‍රාචාර්ය අස්ආරෝහකයින් විසින් මම දීර්ඝ කාලයක් මුළුල්ලේ රැවටී, වංචා කර, මුලා කරනු ලැබ සිටිමි.\" \"අතිශයින් මැනවි, ස්වාමීනි! ස්වාමීනි, යමෙක් පෙරළා දැමූවක් උඩුකුරු කරන්නා සේ, වැසූවක් විවෘත කරන්නා සේ, මඟ මුළාවූවෙකුට මඟ පෙන්වන්නා සේ, ඇස් ඇත්තෝ රූප දකිනු පිණිස අන්ධකාරයේ තෙල් පහනක් දරන්නා සේ, එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකා රයෙන් ධර්මය ප්‍රකාශ කරනු ලැබීය. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේද, ධර්මයද, සංඝයාද සරණ යමි. භාග්‍යවතුන් වහන්සේ මා අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Assārohasuttaṃ",
      "vagga": "",
      "englishTitle": "The Horseman Sutta",
      "sinhalaTitle": "අස්සාරෝහ සූත්‍රය"
    },
    {
      "number": 358,
      "pali": "Ekaṃ samayaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Atha kho asibandhakaputto gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho asibandhakaputto gāmaṇi bhagavantaṃ etadavoca – ‘‘brāhmaṇā, bhante, pacchā bhūmakā kāmaṇḍalukā sevālamālikā udakorohakā aggiparicārakā. Te mataṃ kālaṅkataṃ uyyāpenti nāma saññāpenti nāma saggaṃ nāma okkāmenti. Bhagavā pana, bhante, arahaṃ sammāsambuddho pahoti tathā kātuṃ yathā sabbo loko kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyā’’ti? ‘‘Tena hi, gāmaṇi, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṃ byākareyyāsī’’ti. ‘‘Taṃ kiṃ maññasi, gāmaṇi, idhassa puriso pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhiko. Tamenaṃ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya – ‘ayaṃ puriso kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatū’ti. Taṃ kiṃ maññasi, gāmaṇi, api nu so puriso mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Seyyathāpi, gāmaṇi, puriso mahatiṃ puthusilaṃ gambhīre udakarahade pakkhipeyya. Tamenaṃ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya – ‘ummujja, bho puthusile, uplava, bho puthusile, thalamuplava, bho puthusile’ti. Taṃ kiṃ maññasi, gāmaṇi, api nu sā puthusilā mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā ummujjeyya vā uplaveyya vā thalaṃ vā uplaveyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Evameva kho, gāmaṇi, yo so puriso pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhiko. Kiñcāpi taṃ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya – ‘ayaṃ puriso kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatū’’’ti, atha kho so puriso kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. ‘‘Taṃ kiṃ maññasi, gāmaṇi, idhassa [idha (ka.), idha cassa (?)] puriso pāṇātipātā paṭivirato adinnādānā paṭivirato kāmesumicchācārā paṭivirato musāvādā paṭivirato pisuṇāya vācāya paṭivirato pharusāya vācāya paṭivirato samphappalāpā paṭivirato anabhijjhālu abyāpannacitto sammādiṭṭhiko. Tamenaṃ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya – ‘ayaṃ puriso kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatū’ti. Taṃ kiṃ maññasi, gāmaṇi, api nu so puriso mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Seyyathāpi, gāmaṇi, puriso sappikumbhaṃ vā telakumbhaṃ vā gambhīre udakarahade ogāhetvā bhindeyya. Tatra yāssa sakkharā vā kaṭhalā vā sā adhogāmī [adhogāminī (?)] assa; yañca khvassa tatra sappi vā telaṃ vā taṃ uddhaṃ gāmi assa. Tamenaṃ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya – ‘osīda, bho sappitela, saṃsīda, bho sappitela, adho gaccha, bho sappitelā’ti. Taṃ kiṃ maññasi, gāmaṇi, api nu taṃ sappitelaṃ mahato janakāyassa āyācanahetu vā thomanahetu vā pañjalikā anuparisakkanahetu vā osīdeyya vā saṃsīdeyya vā adho vā gaccheyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Evameva kho, gāmaṇi, yo so puriso pāṇātipātā paṭivirato, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, pisuṇāya vācāya paṭivirato, pharusāya vācāya paṭivirato, samphappalāpā paṭivirato, anabhijjhālu, abyāpannacitto, sammādiṭṭhiko, kiñcāpi taṃ mahā janakāyo saṅgamma samāgamma āyāceyya thomeyya pañjaliko anuparisakkeyya – ‘ayaṃ puriso kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatū’ti, atha kho so puriso kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyā’’ti. Evaṃ vutte, asibandhakaputto gāmaṇi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante…pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Chaṭṭhaṃ.",
      "english": "At one time, the Blessed One was staying in Nāḷandā, in Pāvārika’s Mango Grove. Then Asibandhakaputta, the headman, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, Asibandhakaputta, the headman, said to the Blessed One: \"Revered sir, there are brahmins who stand on a raised platform, carry a water-pot, wear garlands of moss, perform ritual bathing, and worship fire. They claim to send the dead, the departed, to heaven, to usher them into heaven. But could the Blessed One, the Arahant, the Fully Awakened One, accomplish such a thing, so that all people, with the breakdown of the body, after death, might be reborn in a good destination, a heavenly world?\" \"In that case, headman, I shall ask you a question in return. Please answer it as you see fit.\"\n\n\"What do you think, headman? Suppose there is a person who is a killer of living beings, a taker of what is not given, an unchaste person, a liar, a slanderer, one of harsh speech, one of idle chatter, covetous, with an ill will in his heart, and one of wrong view. A large crowd might gather and implore him, praise him, and with cupped hands respectfully request: ‘May this person, with the breakdown of the body, after death, be reborn in a good destination, a heavenly world.’ What do you think, headman? Would that person, because of the entreaties or praises or respectful requests with cupped hands of that great crowd, be reborn in a good destination, a heavenly world, with the breakdown of the body, after death?\" \"No, revered sir.\" \"Just as, headman, a person might throw a large slab of stone into a deep pool of water. A large crowd might gather and implore it, praise it, and with cupped hands respectfully request: ‘Rise, O slab of stone! Float, O slab of stone! Come to the shore and float, O slab of stone!’ What do you think, headman? Would that slab of stone, because of the entreaties or praises or respectful requests with cupped hands of that great crowd, rise up, or float, or come to the shore and float?\" \"No, revered sir.\" \"In the same way, headman, that person who is a killer of living beings, a taker of what is not given, an unchaste person, a liar, a slanderer, one of harsh speech, one of idle chatter, covetous, with an ill will in his heart, and one of wrong view—even if a large crowd were to gather and implore him, praise him, and with cupped hands respectfully request: ‘May this person, with the breakdown of the body, after death, be reborn in a good destination, a heavenly world,’ yet that person, with the breakdown of the body, after death, would be reborn in a state of deprivation, a bad destination, a downfall, in hell.\"\n\n\"What do you think, headman? Suppose there is a person who abstains from killing living beings, abstains from taking what is not given, abstains from unchastity, abstains from lying, abstains from slanderous speech, abstains from harsh speech, abstains from idle chatter, is not covetous, with a benevolent heart, and one of right view. A large crowd might gather and implore him, praise him, and with cupped hands respectfully request: ‘May this person, with the breakdown of the body, after death, be reborn in a state of deprivation, a bad destination, a downfall, in hell.’ What do you think, headman? Would that person, because of the entreaties or praises or respectful requests with cupped hands of that great crowd, be reborn in a state of deprivation, a bad destination, a downfall, in hell, with the breakdown of the body, after death?\" \"No, revered sir.\" \"Just as, headman, a person might submerge a jar of ghee or a jar of oil in a deep pool of water and then break it. There, whatever grit or gravel was in it would sink downwards; but whatever ghee or oil was in it would rise upwards. A large crowd might gather and implore it, praise it, and with cupped hands respectfully request: ‘Sink, O ghee and oil! Submerge, O ghee and oil! Go downwards, O ghee and oil!’ What do you think, headman? Would that ghee and oil, because of the entreaties or praises or respectful requests with cupped hands of that great crowd, sink, or submerge, or go downwards?\" \"No, revered sir.\" \"In the same way, headman, that person who abstains from killing living beings, abstains from taking what is not given, abstains from unchastity, abstains from lying, abstains from slanderous speech, abstains from harsh speech, abstains from idle chatter, is not covetous, with a benevolent heart, and one of right view—even if a large crowd were to gather and implore him, praise him, and with cupped hands respectfully request: ‘May this person, with the breakdown of the body, after death, be reborn in a state of deprivation, a bad destination, a downfall, in hell,’ yet that person, with the breakdown of the body, after death, would be reborn in a good destination, a heavenly world.\" When this was said, Asibandhakaputta, the headman, said to the Blessed One: \"Excellent, revered sir! Excellent, revered sir! Just as if one were to set upright what had been overthrown, or to reveal what was hidden, or to show the way to one who was lost, or to light a lamp in the darkness so that those with eyes could see forms—in the same way has the Blessed One made the Dhamma clear in various ways. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha of monks. May the Blessed One remember me as a lay follower who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ නාළන්දාවේ පාවාරික අඹ වනයේ වැඩසිටින සේක. එවිට අසිබන්ධකපුත්‍ර ගාමිණී භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹියේය. එළඹී භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි අසිබන්ධකපුත්‍ර ගාමිණී භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ස්වාමීනි, පශ්චාත්භූමික බ්‍රාහ්මණයෝ කමඬලු දරන්නෝය, සේවාල මාලා දරන්නෝය, දිය නාන්නෝය, ගිනි පුද කරන්නෝය. ඔවුහු මිය ගිය, කලුරිය කළ අයව දිව්‍යලෝකයට යවති, දිව්‍යලෝකයට පමුණුවති, දිව්‍යලෝකයට ඇතුළු කරවති යැයි කියති. නමුත් ස්වාමීනි, භාග්‍යවතුන් වහන්සේ රහත් වූ සම්‍යක්‌ සම්බුදු කෙනෙකු වන සේක. මුළු ලෝකයාම ශරීරය බිඳී මරණයෙන් පසු සුගතියට, දිව්‍යලෝකයට පැමිණෙන පරිදි එසේ කිරීමට සමර්ථ වන සේක්ද?”\n\n“එසේ නම්, ගාමිණී, මම ඔබෙන්ම මේ පිළිබඳව ප්‍රතිප්‍රශ්නයක් අසමි. යම් ලෙසකින් ඔබට කැමති නම්, එලෙස එයට පිළිතුරු දෙන්නැ”යි වදාළ සේක.\n\n“ගාමිණී, ඔබ මේ කුමක් සිතන්නෙහිද? මෙහි යම් පුරුෂයෙක් ප්‍රාණඝාත කරන්නෙක්, අදත්තාදානයෙහි නිරත වූවෙක්, කාමයන්හි වරදවා හැසිරෙන්නෙක්, මුසාවාදී වූවෙක්, පිසුණු වචන කියන්නෙක්, ඵරුෂ වචන කියන්නෙක්, සම්ඵප්ප්‍රලාප කියන්නෙක්, අභිධ්‍යා සහිත වූවෙක්, ව්‍යාපාද සිත් ඇත්තෙක්, මිථ්‍යා දෘෂ්ටි ඇත්තෙක් වේ. මේ පුද්ගලයා උදෙසා මහත් ජන සමූහයක් එක්රැස් වී, එකට එකතු වී, ‘මේ පුරුෂයා ශරීරය බිඳී, මරණයෙන් පසු සුගතියට, දිව්‍යලෝකයට පැමිණේවා!’ යැයි දෑත් එක් කොට යාඥා කරමින්, ප්‍රශංසා කරමින්, වටකරගෙන කන්නලව් කරමින් ඉල්ලති. ගාමිණී, ඔබ මේ කුමක් සිතන්නෙහිද? එම පුරුෂයා මහත් ජන සමූහයකගේ යාඥා කිරීම් හේතුවෙන් හෝ, ප්‍රශංසා කිරීම් හේතුවෙන් හෝ, දෑත් එක් කොට කන්නලව් කිරීම් හේතුවෙන් හෝ ශරීරය බිඳී, මරණයෙන් පසු සුගතියට, දිව්‍යලෝකයට පැමිණෙන්නේද?”\n\n“ස්වාමීනි, එසේ නොවන්නේමය.”\n\n“ගාමිණී, යම්සේ පුරුෂයෙක් ගැඹුරු දිය දහරා ඇති විලකට මහත් ගල් පතුරක් දමයි. මේ ගල් පතුර උදෙසා මහත් ජන සමූහයක් එක්රැස් වී, එකට එකතු වී, ‘අහෝ ගල් පතුර, මතුවනු මැනව! අහෝ ගල් පතුර, පාවී යනු මැනව! අහෝ ගල් පතුර, ගොඩබිම මත පාවී යනු මැනව!’ යැයි දෑත් එක් කොට යාඥා කරමින්, ප්‍රශංසා කරමින්, වටකරගෙන කන්නලව් කරති. ගාමිණී, ඔබ මේ කුමක් සිතන්නෙහිද? එම ගල් පතුර මහත් ජන සමූහයකගේ යාඥා කිරීම් හේතුවෙන් හෝ, ප්‍රශංසා කිරීම් හේතුවෙන් හෝ, දෑත් එක් කොට කන්නලව් කිරීම් හේතුවෙන් හෝ මතුවන්නේද? පාවී යන්නේද? ගොඩබිම මත පාවී යන්නේද?”\n\n“ස්වාමීනි, එසේ නොවන්නේමය.”\n\n“ගාමිණී, එපරිද්දෙන්ම යම් පුරුෂයෙක් ප්‍රාණඝාත කරන්නෙක්, අදත්තාදානයෙහි නිරත වූවෙක්, කාමයන්හි වරදවා හැසිරෙන්නෙක්, මුසාවාදී වූවෙක්, පිසුණු වචන කියන්නෙක්, ඵරුෂ වචන කියන්නෙක්, සම්ඵප්ප්‍රලාප කියන්නෙක්, අභිධ්‍යා සහිත වූවෙක්, ව්‍යාපාද සිත් ඇත්තෙක්, මිථ්‍යා දෘෂ්ටි ඇත්තෙක් වේ. එම පුරුෂයා උදෙසා මහත් ජන සමූහයක් එක්රැස් වී, එකට එකතු වී, ‘මේ පුරුෂයා ශරීරය බිඳී, මරණයෙන් පසු සුගතියට, දිව්‍යලෝකයට පැමිණේවා!’ යැයි දෑත් එක් කොට යාඥා කරමින්, ප්‍රශංසා කරමින්, වටකරගෙන කන්නලව් කළද, එම පුරුෂයා ශරීරය බිඳී, මරණයෙන් පසු අපායට, දුගතියට, විනිපාතයට, නිරයටම පැමිණෙන්නේය.”\n\n“ගාමිණී, ඔබ මේ කුමක් සිතන්නෙහිද? මෙහි යම් පුරුෂයෙක් ප්‍රාණඝාතයෙන් වැළකුණෙක්, අදත්තාදානයෙන් වැළකුණෙක්, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණෙක්, මුසාවාදයෙන් වැළකුණෙක්, පිසුණු වචන කීමෙන් වැළකුණෙක්, ඵරුෂ වචන කීමෙන් වැළකුණෙක්, සම්ඵප්ප්‍රලාප කීමෙන් වැළකුණෙක්, අභිධ්‍යා රහිත වූවෙක්, ව්‍යාපාද සිත් රහිත වූවෙක්, සම්මා දෘෂ්ටි ඇත්තෙක් වේ. මේ පුද්ගලයා උදෙසා මහත් ජන සමූහයක් එක්රැස් වී, එකට එකතු වී, ‘මේ පුරුෂයා ශරීරය බිඳී, මරණයෙන් පසු අපායට, දුගතියට, විනිපාතයට, නිරයට පැමිණේවා!’ යැයි දෑත් එක් කොට යාඥා කරමින්, ප්‍රශංසා කරමින්, වටකරගෙන කන්නලව් කරති. ගාමිණී, ඔබ මේ කුමක් සිතන්නෙහිද? එම පුරුෂයා මහත් ජන සමූහයකගේ යාඥා කිරීම් හේතුවෙන් හෝ, ප්‍රශංසා කිරීම් හේතුවෙන් හෝ, දෑත් එක් කොට කන්නලව් කිරීම් හේතුවෙන් හෝ ශරීරය බිඳී, මරණයෙන් පසු අපායට, දුගතියට, විනිපාතයට, නිරයට පැමිණෙන්නේද?”\n\n“ස්වාමීනි, එසේ නොවන්නේමය.”\n\n“ගාමිණී, යම්සේ පුරුෂයෙක් ගැඹුරු දිය දහරා ඇති විලකට ගිතෙල් කළයක් හෝ තෙල් කළයක් හෝ ගිල්වා බිඳ දමයි. එහි යම් බොරලු හෝ කැබලිති වේද, ඒවා යටටම යන්නේය. එහි යම් ගිතෙල් හෝ තෙල් වේද, ඒවා උඩටම යන්නේය. මේ ගිතෙල් සහ තෙල් උදෙසා මහත් ජන සමූහයක් එක්රැස් වී, එකට එකතු වී, ‘අහෝ ගිතෙල් තෙල්, යටටම යනු මැනව! අහෝ ගිතෙල් තෙල්, යටටම ගිලී යනු මැනව! අහෝ ගිතෙල් තෙල්, පහළට යනු මැනව!’ යැයි දෑත් එක් කොට යාඥා කරමින්, ප්‍රශංසා කරමින්, වටකරගෙන කන්නලව් කරති. ගාමිණී, ඔබ මේ කුමක් සිතන්නෙහිද? එම ගිතෙල් සහ තෙල් මහත් ජන සමූහයකගේ යාඥා කිරීම් හේතුවෙන් හෝ, ප්‍රශංසා කිරීම් හේතුවෙන් හෝ, දෑත් එක් කොට කන්නලව් කිරීම් හේතුවෙන් හෝ යටටම යන්නේද? යටටම ගිලී යන්නේද? පහළට යන්නේද?”\n\n“ස්වාමීනි, එසේ නොවන්නේමය.”\n\n“ගාමිණී, එපරිද්දෙන්ම යම් පුරුෂයෙක් ප්‍රාණඝාතයෙන් වැළකුණෙක්, අදත්තාදානයෙන් වැළකුණෙක්, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණෙක්, මුසාවාදයෙන් වැළකුණෙක්, පිසුණු වචන කීමෙන් වැළකුණෙක්, ඵරුෂ වචන කීමෙන් වැළකුණෙක්, සම්ඵප්ප්‍රලාප කීමෙන් වැළකුණෙක්, අභිධ්‍යා රහිත වූවෙක්, ව්‍යාපාද සිත් රහිත වූවෙක්, සම්මා දෘෂ්ටි ඇත්තෙක් වේ. එම පුරුෂයා උදෙසා මහත් ජන සමූහයක් එක්රැස් වී, එකට එකතු වී, ‘මේ පුරුෂයා ශරීරය බිඳී, මරණයෙන් පසු අපායට, දුගතියට, විනිපාතයට, නිරයට පැමිණේවා!’ යැයි දෑත් එක් කොට යාඥා කරමින්, ප්‍රශංසා කරමින්, වටකරගෙන කන්නලව් කළද, එම පුරුෂයා ශරීරය බිඳී, මරණයෙන් පසු සුගතියට, දිව්‍යලෝකයටම පැමිණෙන්නේය.”\n\nමෙසේ වදාළ විට, අසිබන්ධකපුත්‍ර ගාමිණී භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “අතිශය ශ්‍රේෂ්ඨයි ස්වාමීනි! අතිශය ශ්‍රේෂ්ඨයි ස්වාමීනි! ස්වාමීනි, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේද, ඇස් ඇති අයට රූප දැකීමට හැකි වන පරිදි අඳුරෙහි තෙල් පහනක් දල්වන්නේද, එලෙසම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය දේශනා කරන ලදී. එබැවින් මම අද පටන් දිවි හිමියෙන් භාග්‍යවතුන් වහන්සේද, ධර්මයද, සංඝයාද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Asibandhakaputtasuttaṃ",
      "vagga": "",
      "englishTitle": "The Son of Asibandhaka Sutta",
      "sinhalaTitle": "අසිබන්ධකපුත්ත සූත්‍රය"
    },
    {
      "number": 359,
      "pali": "Ekaṃ samayaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Atha kho asibandhakaputto gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho asibandhakaputto gāmaṇi bhagavantaṃ etadavoca – ‘‘nanu, bhante, bhagavā sabbapāṇabhūtahitānukampī viharatī’’ti? ‘‘Evaṃ, gāmaṇi, tathāgato sabbapāṇabhūtahitānukampī viharatī’’ti. ‘‘Atha kiñcarahi, bhante, bhagavā ekaccānaṃ sakkaccaṃ dhammaṃ deseti, ekaccānaṃ no tathā sakkaccaṃ dhammaṃ desetī’’ti? ‘‘Tena hi, gāmaṇi, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, gāmaṇi, idhassu [idha (sī. syā. kaṃ. pī.)] kassakassa gahapatino tīṇi khettāni – ekaṃ khettaṃ aggaṃ, ekaṃ khettaṃ majjhimaṃ, ekaṃ khettaṃ hīnaṃ jaṅgalaṃ ūsaraṃ pāpabhūmi. Taṃ kiṃ maññasi, gāmaṇi, asu kassako gahapati bījāni patiṭṭhāpetukāmo kattha paṭhamaṃ patiṭṭhāpeyya, yaṃ vā aduṃ khettaṃ aggaṃ, yaṃ vā aduṃ khettaṃ majjhimaṃ, yaṃ vā aduṃ khettaṃ hīnaṃ jaṅgalaṃ ūsaraṃ pāpabhūmī’’ti? ‘‘Asu, bhante, kassako gahapati bījāni patiṭṭhāpetukāmo yaṃ aduṃ khettaṃ aggaṃ tattha patiṭṭhāpeyya. Tattha patiṭṭhāpetvā yaṃ aduṃ khettaṃ majjhimaṃ tattha patiṭṭhāpeyya. Tattha patiṭṭhāpetvā yaṃ aduṃ khettaṃ hīnaṃ jaṅgalaṃ ūsaraṃ pāpabhūmi tattha patiṭṭhāpeyyapi, nopi patiṭṭhāpeyya. Taṃ kissa hetu? Antamaso gobhattampi bhavissatī’’ti. ‘‘Seyyathāpi, gāmaṇi, yaṃ aduṃ khettaṃ aggaṃ; evameva mayhaṃ bhikkhubhikkhuniyo. Tesāhaṃ dhammaṃ desemi – ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ, sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsemi. Taṃ kissa hetu? Ete hi, gāmaṇi, maṃdīpā maṃleṇā maṃtāṇā maṃsaraṇā viharanti. Seyyathāpi, gāmaṇi, yaṃ aduṃ khettaṃ majjhimaṃ; evameva mayhaṃ upāsakaupāsikāyo. Tesaṃ pāhaṃ dhammaṃ desemi – ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ, sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsemi. Taṃ kissa hetu? Ete hi, gāmaṇi, maṃdīpā maṃleṇā maṃtāṇā maṃsaraṇā viharanti. Seyyathāpi, gāmaṇi, yaṃ aduṃ khettaṃ hīnaṃ jaṅgalaṃ ūsaraṃ pāpabhūmi; evameva mayhaṃ aññatitthiyā samaṇabrāhmaṇaparibbājakā. Tesaṃ pāhaṃ dhammaṃ desemi – ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsemi. Taṃ kissa hetu? Appeva nāma ekaṃ padampi ājāneyyuṃ taṃ nesaṃ assa dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Seyyathāpi, gāmaṇi, purisassa tayo udakamaṇikā – eko udakamaṇiko acchiddo ahārī aparihārī, eko udakamaṇiko acchiddo hārī parihārī, eko udakamaṇiko chiddo hārī parihārī. Taṃ kiṃ maññasi, gāmaṇi, asu puriso udakaṃ nikkhipitukāmo kattha paṭhamaṃ nikkhipeyya, yo vā so udakamaṇiko acchiddo ahārī aparihārī, yo vā so udakamaṇiko acchiddo hārī parihārī, yo vā so udakamaṇiko chiddo hārī parihārī’’ti? ‘‘Asu, bhante, puriso udakaṃ nikkhipitukāmo, yo so udakamaṇiko acchiddo ahārī aparihārī tattha nikkhipeyya, tattha nikkhipitvā, yo so udakamaṇiko acchiddo hārī parihārī tattha nikkhipeyya, tattha nikkhipitvā, yo so udakamaṇiko chiddo hārī parihārī tattha nikkhipeyyapi, nopi nikkhipeyya. Taṃ kissa hetu? Antamaso bhaṇḍadhovanampi bhavissatī’’ti. ‘‘Seyyathāpi, gāmaṇi, yo so udakamaṇiko acchiddo ahārī aparihārī; evameva mayhaṃ bhikkhubhikkhuniyo. Tesāhaṃ dhammaṃ desemi – ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsemi. Taṃ kissa hetu? Ete hi, gāmaṇi, maṃdīpā maṃleṇā maṃtāṇā maṃsaraṇā viharanti. Seyyathāpi, gāmaṇi, yo so udakamaṇiko acchiddo hārī parihārī; evameva mayhaṃ upāsakaupāsikāyo. Tesāhaṃ dhammaṃ desemi – ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsemi. Taṃ kissa hetu? Ete hi, gāmaṇi, maṃdīpā maṃleṇā maṃtāṇā maṃsaraṇā viharanti. Seyyathāpi, gāmaṇi, yo so udakamaṇiko chiddo hārī parihārī; evameva mayhaṃ aññatitthiyā samaṇabrāhmaṇaparibbājakā. Tesāhaṃ dhammaṃ desemi – ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsemi. Taṃ kissa hetu? Appeva nāma ekaṃ padampi ājāneyyuṃ, taṃ nesaṃ assa dīgharattaṃ hitāya sukhāyā’’ti. Evaṃ vutte, asibandhakaputto gāmaṇi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante…pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Sattamaṃ.",
      "english": "At one time, the Blessed One was staying in Nāḷandā, in Pāvārika's mango grove. Then Asibandhakaputta, the headman, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, Asibandhakaputta, the headman, said to the Blessed One: \"Isn't it true, Venerable Sir, that the Blessed One dwells with compassion for the welfare of all living beings?\" \"Indeed, headman, the Tathāgata dwells with compassion for the welfare of all living beings.\" \"Then why is it, Venerable Sir, that the Blessed One teaches the Dhamma thoroughly to some, but not so thoroughly to others?\" \"In that case, headman, I shall question you on this matter. You should answer as you see fit. What do you think, headman? Suppose there is a farmer, a householder, who has three fields: one field is excellent, one field is middling, and one field is poor, wild, barren, and infertile soil. What do you think, headman? Where would that farmer, that householder, wanting to plant seeds, first plant them? In the field that is excellent, or in the field that is middling, or in the field that is poor, wild, barren, and infertile soil?\" \"Venerable Sir, that farmer, that householder, wanting to plant seeds, would first plant them in the field that is excellent. Having planted there, he would then plant in the field that is middling. Having planted there, he might also plant in the field that is poor, wild, barren, and infertile soil, or he might not. Why is that? Because at the very least, it might provide fodder for cattle.\" \"Just as, headman, that field is excellent, even so are my bhikkhus and bhikkhunis. To them, I teach the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with both meaning and expression, proclaiming the entirely complete and perfectly pure spiritual life. Why is that? Because these, headman, dwell as my own island, my own shelter, my own protection, my own refuge. Just as, headman, that field is middling, even so are my male and female lay followers. To them also, I teach the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with both meaning and expression, proclaiming the entirely complete and perfectly pure spiritual life. Why is that? Because these, headman, dwell as my own island, my own shelter, my own protection, my own refuge. Just as, headman, that field is poor, wild, barren, and infertile soil, even so are my renunciants, brahmins, and wandering ascetics of other sects. To them also, I teach the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with both meaning and expression, proclaiming the entirely complete and perfectly pure spiritual life. Why is that? Perhaps they might understand even a single word, and that would be for their welfare and happiness for a long time.\"\n\n\"Just as, headman, a man might have three water jars: one water jar is without a hole, does not leak, and does not lose water; one water jar is without a hole, but it leaks and loses water; and one water jar has a hole, leaks, and loses water. What do you think, headman? Where would that man, wanting to pour water, first pour it? Into the water jar that is without a hole, does not leak, and does not lose water; or into the water jar that is without a hole, but leaks and loses water; or into the water jar that has a hole, leaks, and loses water?\" \"Venerable Sir, that man, wanting to pour water, would first pour it into the water jar that is without a hole, does not leak, and does not lose water. Having poured there, he would then pour into the water jar that is without a hole, but leaks and loses water. Having poured there, he might also pour into the water jar that has a hole, leaks, and loses water, or he might not. Why is that? Because at the very least, it might be used for washing pots and pans.\" \"Just as, headman, that water jar is without a hole, does not leak, and does not lose water, even so are my bhikkhus and bhikkhunis. To them, I teach the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with both meaning and expression, proclaiming the entirely complete and perfectly pure spiritual life. Why is that? Because these, headman, dwell as my own island, my own shelter, my own protection, my own refuge. Just as, headman, that water jar is without a hole, but leaks and loses water, even so are my male and female lay followers. To them, I teach the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with both meaning and expression, proclaiming the entirely complete and perfectly pure spiritual life. Why is that? Because these, headman, dwell as my own island, my own shelter, my own protection, my own refuge. Just as, headman, that water jar has a hole, leaks, and loses water, even so are my renunciants, brahmins, and wandering ascetics of other sects. To them, I teach the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with both meaning and expression, proclaiming the entirely complete and perfectly pure spiritual life. Why is that?\"\n\nPerhaps they might understand even a single word, and that would be for their long-term benefit and happiness.\n\nWhen this was said, Asibandhakaputta the village headman said to the Blessed One: \"Excellent, venerable sir! Excellent, venerable sir! Just as if one were to set upright what had been overthrown, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms — in the same way has the Blessed One made the Dhamma clear in various ways. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May the Blessed One remember me as a lay follower who has gone for refuge from this day forward as long as life lasts.\"\n\nThe Seventh.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ නාලන්දා නුවර පාවාරික අඹ වනයේ වැඩවසන සේක. එවිට අසිබන්ධක පුත්‍ර ගාමණී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි අසිබන්ධක පුත්‍ර ගාමණී භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සියලු ප්‍රාණීන්ගේ, සියලු සත්ත්වයින්ගේ හිත පිණිස අනුකම්පාවෙන් නොවැ වැඩවසන සේක්ද?” (භාග්‍යවතුන් වහන්සේ පිළිතුරු දුන් සේක:) “එසේය, ගාමණී, තථාගතයාණෝ සියලු ප්‍රාණීන්ගේ, සියලු සත්ත්වයින්ගේ හිත පිණිස අනුකම්පාවෙන් වැඩවසන සේක.” (ගාමණී නැවතත් ඇසීය:) “එසේ නම්, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සමහර අයට සැලකිල්ලෙන් ධර්මය දේශනා කරන්නේ, සමහර අයට එතරම් සැලකිල්ලෙන් ධර්මය දේශනා නොකරන්නේ කුමක් නිසාද?”\n\n(භාග්‍යවතුන් වහන්සේ වදාළ සේක:) “එසේනම්, ගාමණී, මම ඔබගෙන්ම මේ පිළිබඳව විමසන්නෙමි. ඔබට යෝග්‍ය යැයි හැඟෙන අයුරින් එය විස්තර කරන්න. ගාමණී, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මෙහි සිටින එක් ගොවි ගෘහපතියෙකුට කෙත්වතු තුනක් ඇත. එක් කෙතක් උසස් ය, එක් කෙතක් මධ්‍යම ය, එක් කෙතක් දුර්වල, ජරාජීර්ණ, ඌෂර, පවට හේතු වන බිමකි. ගාමණී, ඔබ කුමක් සිතන්නෙහිද? ඒ ගොවි ගෘහපතියා බීජ රෝපණය කිරීමට කැමති නම්, ඔහු මුලින්ම රෝපණය කරන්නේ කොතැනද? උසස් කෙතේද? නැතහොත් මධ්‍යම කෙතේද? නැතහොත් දුර්වල, ජරාජීර්ණ, ඌෂර, පවට හේතු වන බිමේද?”\n\n(ගාමණී පිළිතුරු දුන්නේය:) “ස්වාමීනි, ඒ ගොවි ගෘහපතියා බීජ රෝපණය කිරීමට කැමති නම්, ඔහු මුලින්ම උසස් කෙතේ රෝපණය කරන්නේය. එහි රෝපණය කිරීමෙන් පසු, ඔහු මධ්‍යම කෙතේ රෝපණය කරන්නේය. එහි රෝපණය කිරීමෙන් පසු, ඔහු දුර්වල, ජරාජීර්ණ, ඌෂර, පවට හේතු වන බිමේ ද රෝපණය කළ හැකිය, නැතහොත් නොකළ හැකිය. එයට හේතුව කුමක්ද? අවම වශයෙන් ගවයන්ට ආහාර වේලක් හෝ ලැබෙනු ඇත.”\n\n(භාග්‍යවතුන් වහන්සේ වදාළ සේක:) “ගාමණී, යම්සේ ඒ උසස් කෙතක් ඇත්තේද, එපරිද්දෙන්ම මගේ භික්ෂු භික්ෂුණීහු ද වෙති. ඔවුන්ට මම ධර්මය දේශනා කරමි – මුල යහපත්, මැද යහපත්, කෙළවර යහපත්, අර්ථ සහිත, ව්‍යංජන (වචන) සහිත, පිරිපුන්, පිරිසිදු වූ බ්‍රහ්මචාරී ජීවිතය ප්‍රකාශ කරමි. එයට හේතුව කුමක්ද? ගාමණී, මොවුන් මාගේ පිහිටය, මාගේ රැකවරණය, මාගේ ආරක්ෂාව, මාගේ සරණය කොට වසති.\n\nගාමණී, යම්සේ ඒ මධ්‍යම කෙතක් ඇත්තේද, එපරිද්දෙන්ම මගේ උපාසක උපාසිකාවෝ ද වෙති. ඔවුන්ට ද මම ධර්මය දේශනා කරමි – මුල යහපත්, මැද යහපත්, කෙළවර යහපත්, අර්ථ සහිත, ව්‍යංජන සහිත, පිරිපුන්, පිරිසිදු වූ බ්‍රහ්මචාරී ජීවිතය ප්‍රකාශ කරමි. එයට හේතුව කුමක්ද? ගාමණී, මොවුන් ද මාගේ පිහිටය, මාගේ රැකවරණය, මාගේ ආරක්ෂාව, මාගේ සරණය කොට වසති.\n\nගාමණී, යම්සේ ඒ දුර්වල, ජරාජීර්ණ, ඌෂර, පවට හේතු වන බිමක් ඇත්තේද, එපරිද්දෙන්ම මාගේ අන්‍ය තීර්ථක ශ්‍රමණයෝ ද, බ්‍රාහ්මණ පිරිවැජියෝ ද වෙති. ඔවුන්ට ද මම ධර්මය දේශනා කරමි – මුල යහපත්, මැද යහපත්, කෙළවර යහපත්, අර්ථ සහිත, ව්‍යංජන සහිත, පිරිපුන්, පිරිසිදු වූ බ්‍රහ්මචාරී ජීවිතය ප්‍රකාශ කරමි. එයට හේතුව කුමක්ද? ඔවුන් එක් වචනයක් හෝ තේරුම් ගනිත්වා. එය දීර්ඝ කාලයක් ඔවුන්ට හිත පිණිසත්, සැප පිණිසත් වන්නේය.”\n\n“ගාමණී, යම්සේ එක් පුරුෂයෙකුට ජල භාජන තුනක් ඇත. එක් ජල භාජනයක් අසිදුරුය, ජලය කාන්දු නොවන සුළුය, ජලය නැති නොවන සුළුය. එක් ජල භාජනයක් අසිදුරුය, එහෙත් ජලය කාන්දු වන සුළුය, ජලය නැති වන සුළුය. එක් ජල භාජනයක් සිදුරු සහිතය, ජලය කාන්දු වන සුළුය, ජලය නැති වන සුළුය. ගාමණී, ඔබ කුමක් සිතන්නෙහිද? ඒ පුරුෂයා ජලය තැන්පත් කිරීමට කැමති නම්, ඔහු මුලින්ම තැන්පත් කරන්නේ කොතැනද? අසිදුරු, ජලය කාන්දු නොවන, නැති නොවන භාජනයේ ද? නැතහොත් අසිදුරු, එහෙත් ජලය කාන්දු වන, නැති වන භාජනයේ ද? නැතහොත් සිදුරු සහිත, ජලය කාන්දු වන, නැති වන භාජනයේ ද?”\n\n(ගාමණී පිළිතුරු දුන්නේය:) “ස්වාමීනි, ඒ පුරුෂයා ජලය තැන්පත් කිරීමට කැමති නම්, ඔහු මුලින්ම අසිදුරු, ජලය කාන්දු නොවන, නැති නොවන භාජනයේ තැන්පත් කරන්නේය. එහි තැන්පත් කිරීමෙන් පසු, ඔහු අසිදුරු, එහෙත් ජලය කාන්දු වන, නැති වන භාජනයේ තැන්පත් කරන්නේය. එහි තැන්පත් කිරීමෙන් පසු, ඔහු සිදුරු සහිත, ජලය කාන්දු වන, නැති වන භාජනයේ ද තැන්පත් කළ හැකිය, නැතහොත් නොකළ හැකිය. එයට හේතුව කුමක්ද? අවම වශයෙන් බඩු සේදීමකට හෝ ප්‍රයෝජනවත් වනු ඇත.”\n\n(භාග්‍යවතුන් වහන්සේ වදාළ සේක:) “ගාමණී, යම්සේ ඒ අසිදුරු, ජලය කාන්දු නොවන, නැති නොවන ජල භාජනයක් ඇත්තේද, එපරිද්දෙන්ම මගේ භික්ෂු භික්ෂුණීහු ද වෙති. ඔවුන්ට මම ධර්මය දේශනා කරමි – මුල යහපත්, මැද යහපත්, කෙළවර යහපත්, අර්ථ සහිත, ව්‍යංජන සහිත, පිරිපුන්, පිරිසිදු වූ බ්‍රහ්මචාරී ජීවිතය ප්‍රකාශ කරමි. එයට හේතුව කුමක්ද? ගාමණී, මොවුන් මාගේ පිහිටය, මාගේ රැකවරණය, මාගේ ආරක්ෂාව, මාගේ සරණය කොට වසති.\n\nගාමණී, යම්සේ ඒ අසිදුරු, එහෙත් ජලය කාන්දු වන, නැති වන ජල භාජනයක් ඇත්තේද, එපරිද්දෙන්ම මගේ උපාසක උපාසිකාවෝ ද වෙති. ඔවුන්ට ද මම ධර්මය දේශනා කරමි – මුල යහපත්, මැද යහපත්, කෙළවර යහපත්, අර්ථ සහිත, ව්‍යංජන සහිත, පිරිපුන්, පිරිසිදු වූ බ්‍රහ්මචාරී ජීවිතය ප්‍රකාශ කරමි. එයට හේතුව කුමක්ද? ගාමණී, මොවුන් ද මාගේ පිහිටය, මාගේ රැකවරණය, මාගේ ආරක්ෂාව, මාගේ සරණය කොට වසති.\n\nගාමණී, යම්සේ ඒ සිදුරු සහිත, ජලය කාන්දු වන, නැති වන ජල භාජනයක් ඇත්තේද, එපරිද්දෙන්ම මාගේ අන්‍ය තීර්ථක ශ්‍රමණයෝ ද, බ්‍රාහ්මණ පිරිවැජියෝ ද වෙති. ඔවුන්ට ද මම ධර්මය දේශනා කරමි – මුල යහපත්, මැද යහපත්, කෙළවර යහපත්, අර්ථ සහිත, ව්‍යංජන සහිත, පිරිපුන්, පිරිසිදු වූ බ්‍රහ්මචාරී ජීවිතය ප්‍රකාශ කරමි. එයට හේතුව කුමක්ද?\n\nසමහරවිට, ඔවුන් එක් පදයක් හෝ අවබෝධ කරගනු ඇත. එය ඔවුන්ට දිගු කලක් හිතසුව පිණිස පවතිනු ඇත.\nමෙසේ පැවසූ කල්හි, අසිබන්ධකපුත්ත ගාමනි භාග්‍U+200Dයවතුන් වහන්සේට මෙසේ පැවසුවේය: \"ඉතා ම මැනවි, වහන්ස! යම් සේ යටිකුරු කරන ලද්දක් උඩුකුරු කරන්නේද, සැඟවූවක් හෙළි කරන්නේද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේද, අඳුරෙහි තෙල් පහනක් දල්වා ඇස් ඇති අයට රූප දැකීමට සලස්වන්නේද, එසේම භාග්‍U+200Dයවතුන් වහන්සේ විසින් ධර්මය නොයෙක් අයුරින් පැහැදිලි කරන ලද්දේය. අද පටන් ජීවිතය තිබෙන තාක් මම සරණ යමි.\"",
      "paliTitle": "Khettūpamasuttaṃ",
      "vagga": "",
      "englishTitle": "Simile of the Field Sutta",
      "sinhalaTitle": "ඛෙත්තූපම සූත්‍රය"
    },
    {
      "number": 360,
      "pali": "Ekaṃ samayaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Atha kho asibandhakaputto gāmaṇi nigaṇṭhasāvako yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho asibandhakaputtaṃ gāmaṇiṃ bhagavā etadavoca – ‘‘kathaṃ nu kho, gāmaṇi, nigaṇṭho nāṭaputto sāvakānaṃ dhammaṃ desetī’’ti? ‘‘Evaṃ kho, bhante, nigaṇṭho nāṭaputto sāvakānaṃ dhammaṃ deseti – ‘yo koci pāṇaṃ atipāteti, sabbo so āpāyiko nerayiko, yo koci adinnaṃ ādiyati, sabbo so āpāyiko nerayiko, yo koci kāmesu micchā carati, sabbo so āpāyiko nerayiko, yo koci musā bhaṇati sabbo, so āpāyiko nerayiko. Yaṃbahulaṃ yaṃbahulaṃ viharati, tena tena nīyatī’ti. Evaṃ kho, bhante, nigaṇṭho nāṭaputto sāvakānaṃ dhammaṃ desetī’’ti. ‘‘‘Yaṃbahulaṃ yaṃbahulañca, gāmaṇi, viharati, tena tena nīyati’, evaṃ sante na koci āpāyiko nerayiko bhavissati, yathā nigaṇṭhassa nāṭaputtassa vacanaṃ’’. ‘‘Taṃ kiṃ maññasi, gāmaṇi, yo so puriso pāṇātipātī rattiyā vā divasassa vā samayāsamayaṃ upādāya, katamo bahutaro samayo, yaṃ vā so pāṇamatipāteti, yaṃ vā so pāṇaṃ nātipātetī’’ti? ‘‘Yo so, bhante, puriso pāṇātipātī rattiyā vā divasassa vā samayāsamayaṃ upādāya, appataro so samayo yaṃ so pāṇamatipāteti, atha kho sveva bahutaro samayo yaṃ so pāṇaṃ nātipātetī’’ti. ‘‘‘Yaṃbahulaṃ yaṃbahulañca, gāmaṇi, viharati tena tena nīyatī’ti, evaṃ sante na koci āpāyiko nerayiko bhavissati, yathā nigaṇṭhassa nāṭaputtassa vacanaṃ’’. ‘‘Taṃ kiṃ maññasi, gāmaṇi, yo so puriso adinnādāyī rattiyā vā divasassa vā samayāsamayaṃ upādāya, katamo bahutaro samayo, yaṃ vā so adinnaṃ ādiyati, yaṃ vā so adinnaṃ nādiyatī’’ti. ‘‘Yo so, bhante, puriso adinnādāyī rattiyā vā divasassa vā samayāsamayaṃ upādāya appataro so samayo, yaṃ so adinnaṃ ādiyati, atha kho sveva bahutaro samayo, yaṃ so adinnaṃ nādiyatī’’ti. ‘‘‘Yaṃbahulaṃ yaṃbahulañca, gāmaṇi, viharati tena tena nīyatī’ti, evaṃ sante na koci āpāyiko nerayiko bhavissati, yathā nigaṇṭhassa nāṭaputtassa vacanaṃ’’. ‘‘Taṃ kiṃ maññasi, gāmaṇi, yo so puriso kāmesumicchācārī rattiyā vā divasassa vā samayāsamayaṃ upādāya, katamo bahutaro samayo, yaṃ vā so kāmesu micchā carati, yaṃ vā so kāmesu micchā na caratī’’ti? ‘‘Yo so, bhante, puriso kāmesumicchācārī rattiyā vā divasassa vā samayāsamayaṃ upādāya, appataro so samayo yaṃ so kāmesu micchā carati, atha kho sveva bahutaro samayo, yaṃ so kāmesu micchā na caratī’’ti. ‘‘‘Yaṃbahulaṃ yaṃbahulañca, gāmaṇi, viharati tena tena nīyatī’ti, evaṃ sante na koci āpāyiko nerayiko bhavissati, yathā nigaṇṭhassa nāṭaputtassa vacanaṃ’’. ‘‘Taṃ kiṃ maññasi, gāmaṇi, yo so puriso musāvādī rattiyā vā divasassa vā samayāsamayaṃ upādāya, katamo bahutaro samayo, yaṃ vā so musā bhaṇati, yaṃ vā so musā na bhaṇatī’’ti? ‘‘Yo so, bhante, puriso musāvādī rattiyā vā divasassa vā samayāsamayaṃ upādāya, appataro so samayo, yaṃ so musā bhaṇati, atha kho sveva bahutaro samayo, yaṃ so musā na bhaṇatī’’ti. ‘‘‘Yaṃbahulaṃ yaṃbahulañca, gāmaṇi, viharati tena tena nīyatī’ti, evaṃ sante na koci āpāyiko nerayiko bhavissati, yathā nigaṇṭhassa nāṭaputtassa vacanaṃ’’. ‘‘Idha, gāmaṇi, ekacco satthā evaṃvādī hoti evaṃdiṭṭhi [evaṃdiṭṭhī (ka.)] – ‘yo koci pāṇamatipāteti, sabbo so āpāyiko nerayiko, yo koci adinnaṃ ādiyati, sabbo so āpāyiko nerayiko, yo koci kāmesu micchā carati, sabbo so āpāyiko nerayiko, yo koci musā bhaṇati, sabbo so āpāyiko nerayiko’ti. Tasmiṃ kho pana, gāmaṇi, satthari sāvako abhippasanno hoti. Tassa evaṃ hoti – ‘mayhaṃ kho satthā evaṃvādī evaṃdiṭṭhi – yo koci pāṇamatipāteti, sabbo so āpāyiko nerayikoti. Atthi kho pana mayā pāṇo atipātito, ahampamhi āpāyiko nerayikoti diṭṭhiṃ paṭilabhati. Taṃ, gāmaṇi, vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā yathābhataṃ nikkhitto evaṃ niraye. Mayhaṃ kho satthā evaṃvādī evaṃdiṭṭhi – yo koci adinnaṃ ādiyati, sabbo so āpāyiko nerayikoti. Atthi kho pana mayā adinnaṃ ādinnaṃ ahampamhi āpāyiko nerayikoti diṭṭhiṃ paṭilabhati. Taṃ, gāmaṇi, vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā yathābhataṃ nikkhitto evaṃ niraye. Mayhaṃ kho satthā evaṃvādī evaṃdiṭṭhi – yo koci kāmesu micchā carati, sabbo so āpāyiko nerayiko’ti. Atthi kho pana mayā kāmesu micchā ciṇṇaṃ. ‘Ahampamhi āpāyiko nerayiko’ti diṭṭhiṃ paṭilabhati. Taṃ, gāmaṇi, vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā yathābhataṃ nikkhitto evaṃ niraye. Mayhaṃ kho satthā evaṃvādī evaṃdiṭṭhi – yo koci musā bhaṇati, sabbo so āpāyiko nerayikoti. Atthi kho pana mayā musā bhaṇitaṃ. ‘Ahampamhi āpāyiko nerayiko’ti diṭṭhiṃ paṭilabhati. Taṃ, gāmaṇi, vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā yathābhataṃ nikkhitto evaṃ niraye. ‘‘Idha pana, gāmaṇi, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So anekapariyāyena pāṇātipātaṃ garahati vigarahati, ‘pāṇātipātā viramathā’ti cāha. Adinnādānaṃ garahati vigarahati, ‘adinnādānā viramathā’ti cāha. Kāmesumicchācāraṃ garahati, vigarahati ‘kāmesumicchācārā viramathā’ti cāha. Musāvādaṃ garahati vigarahati ‘musāvādā viramathā’ti cāha. Tasmiṃ kho pana, gāmaṇi, satthari sāvako abhippasanno hoti. So iti paṭisañcikkhati – ‘bhagavā kho anekapariyāyena pāṇātipātaṃ garahati vigarahati, pāṇātipātā viramathāti cāha. Atthi kho pana mayā pāṇo atipātito yāvatako vā tāvatako vā. Yo kho pana mayā pāṇo atipātito yāvatako vā tāvatako vā, taṃ na suṭṭhu, taṃ na sādhu. Ahañceva [ahañce (?)] kho pana tappaccayā vippaṭisārī assaṃ. Na metaṃ pāpaṃ kammaṃ [pāpakammaṃ (syā. kaṃ. pī. ka.)] akataṃ bhavissatī’ti. So iti paṭisaṅkhāya tañceva pāṇātipātaṃ pajahati. Āyatiñca pāṇātipātā paṭivirato hoti. Evametassa pāpassa kammassa pahānaṃ hoti. Evametassa pāpassa kammassa samatikkamo hoti. ‘‘‘Bhagavā kho anekapariyāyena adinnādānaṃ garahati vigarahati, adinnādānā viramathāti cāha. Atthi kho pana mayā adinnaṃ ādinnaṃ yāvatakaṃ vā tāvatakaṃ vā. Yaṃ kho pana mayā adinnaṃ ādinnaṃ yāvatakaṃ vā tāvatakaṃ vā taṃ na suṭṭhu, taṃ na sādhu. Ahañceva kho pana tappaccayā vippaṭisārī assaṃ, na metaṃ pāpaṃ kammaṃ akataṃ bhavissatī’ti. So iti paṭisaṅkhāya tañceva adinnādānaṃ pajahati. Āyatiñca adinnādānā paṭivirato hoti. Evametassa pāpassa kammassa pahānaṃ hoti. Evametassa pāpassa kammassa samatikkamo hoti. ‘‘‘Bhagavā kho pana anekapariyāyena kāmesumicchācāraṃ garahati vigarahati, kāmesumicchācārā viramathāti cāha. Atthi kho pana mayā kāmesu micchā ciṇṇaṃ yāvatakaṃ vā tāvatakaṃ vā. Yaṃ kho pana mayā kāmesu micchā ciṇṇaṃ yāvatakaṃ vā tāvatakaṃ vā taṃ na suṭṭhu, taṃ na sādhu. Ahañceva kho pana tappaccayā vippaṭisārī assaṃ, na metaṃ pāpaṃ kammaṃ akataṃ bhavissatī’ti. So iti paṭisaṅkhāya tañceva kāmesumicchācāraṃ pajahati, āyatiñca kāmesumicchācārā paṭivirato hoti. Evametassa pāpassa kammassa pahānaṃ hoti. Evametassa pāpassa kammassa samatikkamo hoti. ‘‘‘Bhagavā kho pana anekapariyāyena musāvādaṃ garahati vigarahati, musāvādā viramathāti cāha. Atthi kho pana mayā musā bhaṇitaṃ yāvatakaṃ vā tāvatakaṃ vā. Yaṃ kho pana mayā musā bhaṇitaṃ yāvatakaṃ vā tāvatakaṃ vā taṃ na suṭṭhu, taṃ na sādhu. Ahañceva kho pana tappaccayā vippaṭisārī assaṃ, na metaṃ pāpaṃ kammaṃ akataṃ bhavissatī’ti. So iti paṭisaṅkhāya tañceva musāvādaṃ pajahati, āyatiñca musāvādā paṭivirato hoti. Evametassa pāpassa kammassa pahānaṃ hoti. Evametassa pāpassa kammassa samatikkamo hoti. ‘‘So pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti. Adinnādānaṃ pahāya adinnādānā paṭivirato hoti. Kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti. Musāvādaṃ pahāya musāvādā paṭivirato hoti. Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti. Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti. Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti. Abhijjhaṃ pahāya anabhijjhālu hoti. Byāpādappadosaṃ pahāya abyāpannacitto hoti. Micchādiṭṭhiṃ pahāya sammādiṭṭhiko hoti. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Seyyathāpi, gāmaṇi, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; evameva kho, gāmaṇi, evaṃ bhāvitāya mettāya cetovimuttiyā evaṃ bahulīkatāya yaṃ pamāṇakataṃ kammaṃ, na taṃ tatrāvasissati, na taṃ tatrāvatiṭṭhati. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe…. Upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Seyyathāpi, gāmaṇi, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; evameva kho, gāmaṇi, evaṃ bhāvitāya upekkhāya cetovimuttiyā evaṃ bahulīkatāya yaṃ pamāṇakataṃ kammaṃ na taṃ tatrāvasissati, na taṃ tatrāvatiṭṭhatī’’ti. Evaṃ vutte, asibandhakaputto gāmaṇi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante, abhikkantaṃ, bhante…pe… upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Aṭṭhamaṃ.",
      "english": "At one time, the Blessed One was dwelling in Nāḷandā, in Pāvārika's Mango Grove. Then Asibandhakaputta the Headman, a disciple of the Nigaṇṭhas, approached the Blessed One. Having approached, he sat down to one side. Asibandhakaputta the Headman, who was sitting to one side, was addressed by the Blessed One thus: \"How, Headman, does the Nigaṇṭha Nāṭaputta teach the Dhamma to his disciples?\" \"Venerable sir, the Nigaṇṭha Nāṭaputta teaches the Dhamma to his disciples in this way: 'Whoever destroys life, all such a one goes to the lower realms, to hell. Whoever takes what is not given, all such a one goes to the lower realms, to hell. Whoever engages in sexual misconduct, all such a one goes to the lower realms, to hell. Whoever speaks falsehood, all such a one goes to the lower realms, to hell. One is led by that which one frequently dwells upon.' This is how, Venerable sir, the Nigaṇṭha Nāṭaputta teaches the Dhamma to his disciples.\"\n\n\" 'If one is led by that which one frequently dwells upon, Headman, then according to the words of the Nigaṇṭha Nāṭaputta, no one would go to the lower realms, no one would go to hell.' \"What do you think, Headman? Regarding a person who destroys life, considering the various times of day and night, which time is more frequent: when he destroys life, or when he does not destroy life?\" \"Venerable sir, regarding a person who destroys life, considering the various times of day and night, the time when he destroys life is less frequent. Indeed, the time when he does not destroy life is much more frequent.\" \" 'If one is led by that which one frequently dwells upon, Headman, then according to the words of the Nigaṇṭha Nāṭaputta, no one would go to the lower realms, no one would go to hell.' \"What do you think, Headman? Regarding a person who takes what is not given, considering the various times of day and night, which time is more frequent: when he takes what is not given, or when he does not take what is not given?\" \"Venerable sir, regarding a person who takes what is not given, considering the various times of day and night, the time when he takes what is not given is less frequent. Indeed, the time when he does not take what is not given is much more frequent.\" \" 'If one is led by that which one frequently dwells upon, Headman, then according to the words of the Nigaṇṭha Nāṭaputta, no one would go to the lower realms, no one would go to hell.' \"What do you think, Headman? Regarding a person who engages in sexual misconduct, considering the various times of day and night, which time is more frequent: when he engages in sexual misconduct, or when he does not engage in sexual misconduct?\" \"Venerable sir, regarding a person who engages in sexual misconduct, considering the various times of day and night, the time when he engages in sexual misconduct is less frequent. Indeed, the time when he does not engage in sexual misconduct is much more frequent.\" \" 'If one is led by that which one frequently dwells upon, Headman, then according to the words of the Nigaṇṭha Nāṭaputta, no one would go to the lower realms, no one would go to hell.' \"What do you think, Headman? Regarding a person who speaks falsehood, considering the various times of day and night, which time is more frequent: when he speaks falsehood, or when he does not speak falsehood?\" \"Venerable sir, regarding a person who speaks falsehood, considering the various times of day and night, the time when he speaks falsehood is less frequent. Indeed, the time when he does not speak falsehood is much more frequent.\" \" 'If one is led by that which one frequently dwells upon, Headman, then according to the words of the Nigaṇṭha Nāṭaputta, no one would go to the lower realms, no one would go to hell.' \"\n\n\"Here, Headman, some teacher holds such a doctrine and such a view: 'Whoever destroys life, all such a one goes to the lower realms, to hell. Whoever takes what is not given, all such a one goes to the lower realms, to hell. Whoever engages in sexual misconduct, all such a one goes to the lower realms, to hell. Whoever speaks falsehood, all such a one goes to the lower realms, to hell.' Now, Headman, a disciple has deep faith in that teacher. This thought occurs to him: 'My teacher holds such a doctrine and such a view: \"Whoever destroys life, all such a one goes to the lower realms, to hell.\" But I have destroyed life, so I too will go to the lower realms, to hell.' Thus, he adopts this view. Headman, not having abandoned that speech, not having abandoned that thought, not having relinquished that view, he is deposited in hell just as he was brought. 'My teacher holds such a doctrine and such a view: \"Whoever takes what is not given, all such a one goes to the lower realms, to hell.\" But I have taken what is not given, so I too will go to the lower realms, to hell.' Thus, he adopts this view. Headman, not having abandoned that speech, not having abandoned that thought, not having relinquished that view, he is deposited in hell just as he was brought.\n\nMy teacher says this, holds this view: ‘Whoever practices misconduct in sensual pleasures, such a one is entirely bound for the lower realms, bound for hell.’ Indeed, I have practiced misconduct in sensual pleasures. He acquires the view, ‘I too am bound for the lower realms, bound for hell.’ Gāmaṇi, without abandoning that statement, without abandoning that intention, without relinquishing that view, he is deposited into hell, just as if he were carried there.\n\nMy teacher says this, holds this view: ‘Whoever speaks falsely, such a one is entirely bound for the lower realms, bound for hell.’ Indeed, I have spoken falsely. He acquires the view, ‘I too am bound for the lower realms, bound for hell.’ Gāmaṇi, without abandoning that statement, without abandoning that intention, without relinquishing that view, he is deposited into hell, just as if he were carried there.\n\nBut here, Gāmaṇi, a Tathāgata arises in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, sublime, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Enlightened One, the Blessed One. He, in many ways, rebukes and denounces the taking of life, and also says, ‘Abstain from taking life.’ He rebukes and denounces taking what is not given, and also says, ‘Abstain from taking what is not given.’ He rebukes and denounces misconduct in sensual pleasures, and also says, ‘Abstain from misconduct in sensual pleasures.’ He rebukes and denounces false speech, and also says, ‘Abstain from false speech.’\n\nBut then, Gāmaṇi, a disciple becomes deeply confident in that Teacher. He reflects thus: ‘Indeed, the Blessed One, in many ways, rebukes and denounces the taking of life, and also says, \"Abstain from taking life.\" But I have taken life, whether a little or much. Whatever life I have taken, whether a little or much, that is not good, that is not wholesome. And if I were to feel remorse because of that, this unwholesome deed would not become undone for me.’ So, having reflected in this way, he abandons that taking of life itself. And for the future, he refrains from taking life. Thus there is the abandoning of that unwholesome action. Thus there is the transcending of that unwholesome action.\n\n‘Indeed, the Blessed One, in many ways, rebukes and denounces taking what is not given, and also says, \"Abstain from taking what is not given.\" But I have taken what was not given, whether a little or much. Whatever I have taken that was not given, whether a little or much, that is not good, that is not wholesome. And if I were to feel remorse because of that, this unwholesome deed would not become undone for me.’ So, having reflected in this way, he abandons that taking of what is not given itself. And for the future, he refrains from taking what is not given. Thus there is the abandoning of that unwholesome action. Thus there is the transcending of that unwholesome action.\n\n‘Indeed, the Blessed One, in many ways, rebukes and denounces misconduct in sensual pleasures, and also says, \"Abstain from misconduct in sensual pleasures.\" But I have practiced misconduct in sensual pleasures, whether a little or much. Whatever misconduct in sensual pleasures I have practiced, whether a little or much, that is not good, that is not wholesome. And if I were to feel remorse because of that, this unwholesome deed would not become undone for me.’ So, having reflected in this way, he abandons that misconduct in sensual pleasures itself. And for the future, he refrains from misconduct in sensual pleasures. Thus there is the abandoning of that unwholesome action. Thus there is the transcending of that unwholesome action.\n\n‘Indeed, the Blessed One, in many ways, rebukes and denounces false speech, and also says, \"Abstain from false speech.\" But I have spoken falsely, whether a little or much. Whatever false speech I have spoken, whether a little or much, that is not good, that is not wholesome. And if I were to feel remorse because of that, this unwholesome deed would not become undone for me.’ So, having reflected in this way, he abandons that false speech itself. And for the future, he refrains from false speech. Thus there is the abandoning of that unwholesome action. Thus there is the transcending of that unwholesome action.\n\nHaving abandoned the taking of life, he abstains from the taking of life. Having abandoned taking what is not given, he abstains from taking what is not given. Having abandoned misconduct in sensual pleasures, he abstains from misconduct in sensual pleasures. Having abandoned false speech, he abstains from false speech. Having abandoned divisive speech, he abstains from divisive speech. Having abandoned harsh speech, he abstains from harsh speech. Having abandoned frivolous talk, he abstains from frivolous talk. Having abandoned covetousness, he is not covetous. Having abandoned ill-will and malice, he is without an ill-willed mind. Having abandoned wrong view, he holds right view.\n\nSuch a noble disciple, Gāmaṇi, having thus abandoned covetousness, having abandoned ill-will, unconfused, clearly comprehending, and mindful, dwells pervading one direction with a mind imbued with loving-kindness; similarly the second, similarly the third, similarly the fourth.\n\nThus, above, below, and across, everywhere, in all ways, one dwells pervading the entire world with a mind accompanied by loving-kindness, vast, exalted, immeasurable, without hostility, and without ill-will. Just as, O headman, a strong conch-blower might easily make himself heard in all four directions; even so, O headman, when the liberation of mind through loving-kindness has been thus developed and thus frequently cultivated, any limited action performed does not remain there, nor does it stand firm there.\n\nThat noble disciple, O headman, being thus free from covetousness, free from ill-will, undeluded, clearly comprehending, and mindful, dwells pervading the entire world with a mind accompanied by compassion, vast, exalted, immeasurable, without hostility, and without ill-will. In the same way, one dwells pervading the entire world with a mind accompanied by appreciative joy, vast, exalted, immeasurable, without hostility, and without ill-will. Furthermore, one dwells pervading one direction with a mind accompanied by equanimity. Likewise, the second, likewise the third, likewise the fourth. Thus, above, below, and across, everywhere, in all ways, one dwells pervading the entire world with a mind accompanied by equanimity, vast, exalted, immeasurable, without hostility, and without ill-will. Just as, O headman, a strong conch-blower might easily make himself heard in all four directions; even so, O headman, when the liberation of mind through equanimity has been thus developed and thus frequently cultivated, any limited action performed does not remain there, nor does it stand firm there.\n\nWhen this was said, Asibandhakaputta, the headman, said to the Blessed One: \"Excellent, Venerable Sir! Excellent, Venerable Sir! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to hold up a lamp in the darkness so that those with eyes could see forms – in the same way has the Blessed One made the Dhamma clear in various ways. I go to the Blessed One for refuge, to the Dhamma, and to the Saṅgha. May the Blessed One accept me as a lay follower, who has gone for refuge from today onwards as long as life lasts.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ නාළන්දා නුවර පාවාරික අඹ උයනෙහි වැඩසිටියහ. එකල්හි නාටපුත්ත නම් වූ නිගණ්ඨයාගේ ශ්‍රාවකයෙකු වූ අසිබන්ධකපුත්ත ගාමනී භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අසිබන්ධකපුත්ත ගාමනීට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ගාමණය, නිගණ්ඨ නාටපුත්ත තම ශ්‍රාවකයන්ට ධර්මය දේශනා කරන්නේ කෙසේද?”\n\n“භාග්‍යවතුන් වහන්ස, නිගණ්ඨ නාටපුත්ත තම ශ්‍රාවකයන්ට ධර්මය දේශනා කරන්නේ මෙසේය: ‘යම් කිසිවෙක් ප්‍රාණඝාතය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය. යම් කිසිවෙක් අදත්තාදානය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය. යම් කිසිවෙක් කාමයන්හි මිථ්‍යාචාරය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය. යම් කිසිවෙක් මුසාවාද කියන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය. යම් දෙයකින් බහුලව වාසය කරන්නේද, ඒ දෙය අනුව ඔහු යයි.’ භාග්‍යවතුන් වහන්ස, නිගණ්ඨ නාටපුත්ත තම ශ්‍රාවකයන්ට ධර්මය දේශනා කරන්නේ මෙසේය.”\n\n“‘ගාමණය, යම් දෙයකින් බහුලව වාසය කරන්නේද, ඒ දෙය අනුව ඔහු යයි’ යනුවෙන් කියතොත්, එසේ නම්, නිගණ්ඨ නාටපුත්තගේ වචනය අනුව කිසිවෙක් අපායික හෝ නිරයගාමී නොවනු ඇත.”\n\n“ගාමණය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? යම් පුද්ගලයෙක් ප්‍රාණඝාතය කරන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක ප්‍රාණඝාතය කරන්නේද, යම් කලෙක ප්‍රාණඝාතය නොකරන්නේද, මේ දෙකින් වැඩි කාලය කුමක්ද?”\n\n“භාග්‍යවතුන් වහන්ස, යම් පුද්ගලයෙක් ප්‍රාණඝාතය කරන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක ප්‍රාණඝාතය කරන්නේද, ඒ කාලය ස්වල්පය. යම් කලෙක ප්‍රාණඝාතය නොකරන්නේද, ඒ කාලයම බොහෝය.”\n\n“‘ගාමණය, යම් දෙයකින් බහුලව වාසය කරන්නේද, ඒ දෙය අනුව ඔහු යයි’ යනුවෙන් කියතොත්, එසේ නම්, නිගණ්ඨ නාටපුත්තගේ වචනය අනුව කිසිවෙක් අපායික හෝ නිරයගාමී නොවනු ඇත.”\n\n“ගාමණය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? යම් පුද්ගලයෙක් අදත්තාදානය කරන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක අදත්තාදානය කරන්නේද, යම් කලෙක අදත්තාදානය නොකරන්නේද, මේ දෙකින් වැඩි කාලය කුමක්ද?”\n\n“භාග්‍යවතුන් වහන්ස, යම් පුද්ගලයෙක් අදත්තාදානය කරන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක අදත්තාදානය කරන්නේද, ඒ කාලය ස්වල්පය. යම් කලෙක අදත්තාදානය නොකරන්නේද, ඒ කාලයම බොහෝය.”\n\n“‘ගාමණය, යම් දෙයකින් බහුලව වාසය කරන්නේද, ඒ දෙය අනුව ඔහු යයි’ යනුවෙන් කියතොත්, එසේ නම්, නිගණ්ඨ නාටපුත්තගේ වචනය අනුව කිසිවෙක් අපායික හෝ නිරයගාමී නොවනු ඇත.”\n\n“ගාමණය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? යම් පුද්ගලයෙක් කාමයන්හි මිථ්‍යාචාරය කරන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක කාමයන්හි මිථ්‍යාචාරය කරන්නේද, යම් කලෙක කාමයන්හි මිථ්‍යාචාරය නොකරන්නේද, මේ දෙකින් වැඩි කාලය කුමක්ද?”\n\n“භාග්‍යවතුන් වහන්ස, යම් පුද්ගලයෙක් කාමයන්හි මිථ්‍යාචාරය කරන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක කාමයන්හි මිථ්‍යාචාරය කරන්නේද, ඒ කාලය ස්වල්පය. යම් කලෙක කාමයන්හි මිථ්‍යාචාරය නොකරන්නේද, ඒ කාලයම බොහෝය.”\n\n“‘ගාමණය, යම් දෙයකින් බහුලව වාසය කරන්නේද, ඒ දෙය අනුව ඔහු යයි’ යනුවෙන් කියතොත්, එසේ නම්, නිගණ්ඨ නාටපුත්තගේ වචනය අනුව කිසිවෙක් අපායික හෝ නිරයගාමී නොවනු ඇත.”\n\n“ගාමණය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? යම් පුද්ගලයෙක් මුසාවාද කියන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක මුසාවාද කියන්නේද, යම් කලෙක මුසාවාද නොකියන්නේද, මේ දෙකින් වැඩි කාලය කුමක්ද?”\n\n“භාග්‍යවතුන් වහන්ස, යම් පුද්ගලයෙක් මුසාවාද කියන්නේ නම්, රාත්‍රියෙහි හෝ දවල්හි හෝ යම් කලෙක මුසාවාද කියන්නේද, ඒ කාලය ස්වල්පය. යම් කලෙක මුසාවාද නොකියන්නේද, ඒ කාලයම බොහෝය.”\n\n“‘ගාමණය, යම් දෙයකින් බහුලව වාසය කරන්නේද, ඒ දෙය අනුව ඔහු යයි’ යනුවෙන් කියතොත්, එසේ නම්, නිගණ්ඨ නාටපුත්තගේ වචනය අනුව කිසිවෙක් අපායික හෝ නිරයගාමී නොවනු ඇත.”\n\n“ගාමණය, මෙහි ඇතැම් ශාස්තෘවරයෙක් මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටියක් ඇත්තේ වෙයි: ‘යම් කිසිවෙක් ප්‍රාණඝාතය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය. යම් කිසිවෙක් අදත්තාදානය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය. යම් කිසිවෙක් කාමයන්හි මිථ්‍යාචාරය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය. යම් කිසිවෙක් මුසාවාද කියන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය’ යනුවෙනි. ගාමණය, ඒ ශාස්තෘවරයා කෙරෙහි ශ්‍රාවකයෙක් ඉතා ප්‍රසන්න භාවයට පැමිණ සිටී. ඔහුට මෙසේ සිතේ: ‘මාගේ ශාස්තෘවරයා මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටියක් ඇත්තේය: “යම් කිසිවෙක් ප්‍රාණඝාතය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය” කියා. මා විසින් ප්‍රාණඝාතය කරනු ලැබූයේ නම්, මමත් අපායිකයෙමි, නිරයගාමී වෙමි’ යනුවෙන් දෘෂ්ටියක් ඇති කරගනී. ගාමණය, ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත් නොහැර, නිරයට දමන ලද්දේය යන ලෙසටම නිරයෙහි වැටේ. ‘මාගේ ශාස්තෘවරයා මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටියක් ඇත්තේය: “යම් කිසිවෙක් අදත්තාදානය කරන්නේද, ඒ සියලු දෙනා අපායිකයෝය, නිරයගාමීහුය” කියා. මා විසින් අදත්තාදානය කරනු ලැබූයේ නම්, මමත් අපායිකයෙමි, නිරයගාමී වෙමි’ යනුවෙන් දෘෂ්ටියක් ඇති කරගනී. ගාමණය, ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත් නොහැර, නිරයට දමන ලද්දේය යන ලෙසටම නිරයෙහි වැටේ.\n\nමගේ ශාස්තෘවරයාගේ දේශනාව මෙබඳුය, දෘෂ්ටිය මෙබඳුය – යමෙක් කාමයන්හි වරදවා හැසිරෙන්නේද, ඔහු සියල්ලෝම අපායට වැටෙන්නෝය, නිරයට වැටෙන්නෝය යනුයි. මා විසින් කාමයන්හි වරදවා හැසිරී ඇත. ‘මම ද අපායට වැටෙන්නෙක්මි, නිරයට වැටෙන්නෙක්මි’ යන දෘෂ්ටිය ඔහු ලබයි. ගාමණය, ඒ වචනය (ප්‍රකාශය) නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත්නොහැර, ගෙනවිත් දැමුවා සේම ඔහු නිරයේ වැටෙන්නේය.\n\nමගේ ශාස්තෘවරයාගේ දේශනාව මෙබඳුය, දෘෂ්ටිය මෙබඳුය – යමෙක් බොරු කියන්නේද, ඔහු සියල්ලෝම අපායට වැටෙන්නෝය, නිරයට වැටෙන්නෝය යනුයි. මා විසින් බොරු කියා ඇත. ‘මම ද අපායට වැටෙන්නෙක්මි, නිරයට වැටෙන්නෙක්මි’ යන දෘෂ්ටිය ඔහු ලබයි. ගාමණය, ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත්නොහැර, ගෙනවිත් දැමුවා සේම ඔහු නිරයේ වැටෙන්නේය.\n\nගාමණය, මේ ශාසනයෙහි අරහත් වූ, සම්මා සම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, අනුත්තර පුරිසදම්ම සාරථී වූ, දෙවිමිනිසුනට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවත් වූ තථාගතයන් වහන්සේ ලෝකයේ පහළ වෙති. උන්වහන්සේ නොයෙක් ආකාරයෙන් ප්‍රාණඝාතය ගරහා හෙළා දකිමින්, ‘ප්‍රාණඝාතයෙන් වළකින්න’ යැයි වදාරණ සේක. අදත්තාදානය ගරහා හෙළා දකිමින්, ‘අදත්තාදානයෙන් වළකින්න’ යැයි වදාරණ සේක. කාමයන්හි වරදවා හැසිරීම ගරහා හෙළා දකිමින්, ‘කාමයන්හි වරදවා හැසිරීමෙන් වළකින්න’ යැයි වදාරණ සේක. මුසාවාදය ගරහා හෙළා දකිමින්, ‘මුසාවාදයෙන් වළකින්න’ යැයි වදාරණ සේක.\n\nගාමණය, ඒ ශාස්තෘවරයා කෙරෙහි ශ්‍රාවකයෙක් (ගැඹුරු) පැහැදීමෙන් යුක්ත වන්නේය. ඔහු මෙසේ සිහි කරයි – ‘භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාරයෙන් ප්‍රාණඝාතය ගරහා හෙළා දකිමින්, ප්‍රාණඝාතයෙන් වළකින්න යැයි වදාරණ සේක. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ ප්‍රාණඝාතය කර ඇත. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ කරන ලද ඒ ප්‍රාණඝාතය මනා නොවෙයි, යහපත් නොවෙයි. එහෙයින් මට ඒ ගැන පසුතැවීමක් ඇතිවේ නම්, ඒ පාපකර්මය මා විසින් නොකරන ලද්දක් සේ නොවන්නේය.’ ඔහු මෙසේ නුවණින් සලකා ඒ ප්‍රාණඝාතයම අත්හරියි. අනාගතයෙහි ද ප්‍රාණඝාතයෙන් වළකින්නේය. මෙසේ ඒ පාපකර්මයේ ප්‍රහාණය වන්නේය. මෙසේ ඒ පාපකර්මය ඉක්මවීම වන්නේය.\n\n‘භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාරයෙන් අදත්තාදානය ගරහා හෙළා දකිමින්, අදත්තාදානයෙන් වළකින්න යැයි වදාරණ සේක. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ අදත්තාදානය කර ඇත. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ කරන ලද ඒ අදත්තාදානය මනා නොවෙයි, යහපත් නොවෙයි. එහෙයින් මට ඒ ගැන පසුතැවීමක් ඇතිවේ නම්, ඒ පාපකර්මය මා විසින් නොකරන ලද්දක් සේ නොවන්නේය.’ ඔහු මෙසේ නුවණින් සලකා ඒ අදත්තාදානයම අත්හරියි. අනාගතයෙහි ද අදත්තාදානයෙන් වළකින්නේය. මෙසේ ඒ පාපකර්මයේ ප්‍රහාණය වන්නේය. මෙසේ ඒ පාපකර්මය ඉක්මවීම වන්නේය.\n\n‘භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාරයෙන් කාමයන්හි වරදවා හැසිරීම ගරහා හෙළා දකිමින්, කාමයන්හි වරදවා හැසිරීමෙන් වළකින්න යැයි වදාරණ සේක. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ කාමයන්හි වරදවා හැසිරී ඇත. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ කරන ලද ඒ කාමයන්හි වරදවා හැසිරීම මනා නොවෙයි, යහපත් නොවෙයි. එහෙයින් මට ඒ ගැන පසුතැවීමක් ඇතිවේ නම්, ඒ පාපකර්මය මා විසින් නොකරන ලද්දක් සේ නොවන්නේය.’ ඔහු මෙසේ නුවණින් සලකා ඒ කාමයන්හි වරදවා හැසිරීමම අත්හරියි. අනාගතයෙහි ද කාමයන්හි වරදවා හැසිරීමෙන් වළකින්නේය. මෙසේ ඒ පාපකර්මයේ ප්‍රහාණය වන්නේය. මෙසේ ඒ පාපකර්මය ඉක්මවීම වන්නේය.\n\n‘භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාරයෙන් මුසාවාදය ගරහා හෙළා දකිමින්, මුසාවාදයෙන් වළකින්න යැයි වදාරණ සේක. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ මුසාවාදය කර ඇත. මා විසින් යම් පමණක් හෝ යම් තරමක් හෝ කරන ලද ඒ මුසාවාදය මනා නොවෙයි, යහපත් නොවෙයි. එහෙයින් මට ඒ ගැන පසුතැවීමක් ඇතිවේ නම්, ඒ පාපකර්මය මා විසින් නොකරන ලද්දක් සේ නොවන්නේය.’ ඔහු මෙසේ නුවණින් සලකා ඒ මුසාවාදයම අත්හරියි. අනාගතයෙහි ද මුසාවාදයෙන් වළකින්නේය. මෙසේ ඒ පාපකර්මයේ ප්‍රහාණය වන්නේය. මෙසේ ඒ පාපකර්මය ඉක්මවීම වන්නේය.\n\nඔහු ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වළකින්නේය. අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වළකින්නේය. කාමයන්හි වරදවා හැසිරීම අත්හැර, කාමයන්හි වරදවා හැසිරීමෙන් වළකින්නේය. මුසාවාදය අත්හැර, මුසාවාදයෙන් වළකින්නේය. පිසුනු වචන (කේළාම් කීම) අත්හැර, පිසුනු වචනවලින් වළකින්නේය. ඵරුෂ වචන (රළු බස්) අත්හැර, ඵරුෂ වචනවලින් වළකින්නේය. සම්ප්‍රප්පලාප (නිෂ්ඵල කතා) අත්හැර, සම්ප්‍රප්පලාපයෙන් වළකින්නේය. අභිධ්‍යාව (අනුන් සතු දේට ආශා කිරීම) අත්හැර, අභිධ්‍යාවෙන් තොර වන්නේය. ව්‍යාපාද ද්වේෂය (අනුන්ට අයහපතක් පැතීම) අත්හැර, ව්‍යාපාදයෙන් තොර සිතැත්තෙක් වන්නේය. මිථ්‍යාදෘෂ්ටිය අත්හැර, සම්මාදිට්ඨික (සම්මා දිට්ඨියෙන් යුක්ත) වන්නේය.\n\nගාමණය, ඒ ආර්යශ්‍රාවක තෙම මෙසේ අභිධ්‍යාව දුරු කළේ, ව්‍යාපාදය දුරු කළේ, මුළා නොවූයේ, මනා සිහි නුවණින් යුක්ත වූයේ, මෛත්‍රී සහගත සිතින් එක් දිශාවක් පැතිරී වාසය කරයි. එසේම දෙවැනි දිශාවක් ද, එසේම තෙවැනි දිශාවක් ද, එසේම සතරවැනි දිශාවක් ද (පැතිරී වාසය කරයි).\n\nමෙසේ ඔහු ඉහළට, පහළට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, මුළු ලෝකයම මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ මෛත්‍රී සහගත සිතින් පතුරුවා වාසය කරයි.\n\nගාමණී, යම්සේ බලවත් සක් පිඹින්නෙක් අසීරු නැතිවම සතර දිශාවට තම හඬ පැතිරවීමෙන් පණිවිඩයක් දන්වා සිටින්නේද, ගාමණී, එලෙසින්ම මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද මෛත්‍රී චේතෝවිමුක්තිය හමුවේ, යම් සීමා සහිත කර්මයක් ඇත්ද, එය එහි නොනවතියි, එහි පිහිටා නොපවතියි.\n\nගාමණී, ඒ ආර්යශ්‍රාවකයා මෙසේ කෙලෙස් රහිත වූ, ව්‍යාපාද රහිත වූ, මුළා නොවුණු, මනා නුවණින් යුක්ත වූ, සිහි ඇතිව, කරුණා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද පතුරුවා වාසය කරයි. මෙසේ ඔහු ඉහළට, පහළට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, මුළු ලෝකයම මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ කරුණා සහගත සිතින් පතුරුවා වාසය කරයි. එලෙසම ඔහු මුදිතා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද පතුරුවා වාසය කරයි. මෙසේ ඔහු ඉහළට, පහළට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, මුළු ලෝකයම මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ මුදිතා සහගත සිතින් පතුරුවා වාසය කරයි. ඔහු උපේක්ෂා සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි, එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද පතුරුවා වාසය කරයි. මෙසේ ඔහු ඉහළට, පහළට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, මුළු ලෝකයම මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ උපේක්ෂා සහගත සිතින් පතුරුවා වාසය කරයි.\n\nගාමණී, යම්සේ බලවත් සක් පිඹින්නෙක් අසීරු නැතිවම සතර දිශාවට තම හඬ පැතිරවීමෙන් පණිවිඩයක් දන්වා සිටින්නේද, ගාමණී, එලෙසින්ම මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද උපේක්ෂා චේතෝවිමුක්තිය හමුවේ, යම් සීමා සහිත කර්මයක් ඇත්ද, එය එහි නොනවතියි, එහි පිහිටා නොපවතියි.”\n\nමෙසේ පැවසූ කල්හි, අසිබන්ධකපුත්ත ගාමණී භාග්‍ය‍වතුන් වහන්සේට මෙය පැවසුවේය: “භාග්‍ය‍වතුන් වහන්ස, ඉතා මැනවි, භාග්‍ය‍වතුන් වහන්ස, ඉතා මැනවි! යම්සේ යටිකුරු කරන ලද්දක් උඩුකුරු කරන්නේද, වසා තබන ලද්දක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මාර්ගය පෙන්වන්නේද, අඳුරේදී තෙල් පහනක් දල්වා ඇස් ඇති අයට රූප දැකිය හැකි වන පරිද්දෙන්ද, එලෙසම භාග්‍ය‍වතුන් වහන්සේ නොයෙක් අයුරින් ධර්‍මය ප්‍ර‍කාශ කළ සේක. භාග්‍ය‍වතුන් වහන්ස, මම භාග්‍ය‍වතුන් වහන්සේද, ධර්‍මයද, සංඝයාද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භාග්‍ය‍වතුන් වහන්සේ දරාගන්නා සේක්වා.”",
      "paliTitle": "Saṅkhadhamasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Conch Blower",
      "sinhalaTitle": "සංඛධම සූත්‍රය"
    },
    {
      "number": 361,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena nāḷandā tadavasari. Tatra sudaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Tena kho pana samayena nāḷandā dubbhikkhā hoti dvīhitikā setaṭṭhikā salākāvuttā. Tena kho pana samayena nigaṇṭho nāṭaputto nāḷandāyaṃ paṭivasati mahatiyā nigaṇṭhaparisāya saddhiṃ. Atha kho asibandhakaputto gāmaṇi nigaṇṭhasāvako yena nigaṇṭho nāṭaputto tenupasaṅkami; upasaṅkamitvā nigaṇṭhaṃ nāṭaputtaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho asibandhakaputtaṃ gāmaṇiṃ nigaṇṭho nāṭaputto etadavoca – ‘‘ehi tvaṃ, gāmaṇi, samaṇassa gotamassa vādaṃ āropehi. Evaṃ te kalyāṇo kittisaddo abbhuggacchissati – ‘asibandhakaputtena gāmaṇinā samaṇassa gotamassa evaṃmahiddhikassa evaṃmahānubhāvassa vādo āropito’’’ti. ‘‘Kathaṃ panāhaṃ, bhante, samaṇassa gotamassa evaṃmahiddhikassa evaṃmahānubhāvassa vādaṃ āropessāmī’’ti? ‘‘Ehi tvaṃ, gāmaṇi, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā samaṇaṃ gotamaṃ evaṃ vadehi – ‘nanu, bhante, bhagavā anekapariyāyena kulānaṃ anuddayaṃ [anudayaṃ (syā. kaṃ. pī. ka.)] vaṇṇeti, anurakkhaṃ vaṇṇeti, anukampaṃ vaṇṇetī’ti? Sace kho, gāmaṇi, samaṇo gotamo evaṃ puṭṭho evaṃ byākaroti – ‘evaṃ, gāmaṇi, tathāgato anekapariyāyena kulānaṃ anuddayaṃ vaṇṇeti, anurakkhaṃ vaṇṇeti, anukampaṃ vaṇṇetī’ti, tamenaṃ tvaṃ evaṃ vadeyyāsi – ‘atha kiñcarahi, bhante, bhagavā dubbhikkhe dvīhitike setaṭṭhike salākāvutte mahatā bhikkhusaṅghena saddhiṃ cārikaṃ carati? Ucchedāya bhagavā kulānaṃ paṭipanno, anayāya bhagavā kulānaṃ paṭipanno, upaghātāya bhagavā kulānaṃ paṭipanno’ti! Imaṃ kho te, gāmaṇi, samaṇo gotamo ubhatokoṭikaṃ pañhaṃ puṭṭho neva sakkhati [sakkhiti (sī.) ma. ni. 2.83] uggilituṃ, neva sakkhati ogilitu’’nti. ‘‘Evaṃ, bhante’’ti kho asibandhakaputto gāmaṇi nigaṇṭhassa nāṭaputtassa paṭissutvā uṭṭhāyāsanā nigaṇṭhaṃ nāṭaputtaṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho asibandhakaputto gāmaṇi bhagavantaṃ etadavoca – ‘‘Nanu, bhante, bhagavā anekapariyāyena kulānaṃ anuddayaṃ vaṇṇeti, anurakkhaṃ vaṇṇeti, anukampaṃ vaṇṇetī’’ti? ‘‘Evaṃ, gāmaṇi, tathāgato anekapariyāyena kulānaṃ anuddayaṃ vaṇṇeti, anurakkhaṃ vaṇṇeti, anukampaṃ vaṇṇetī’’ti. ‘‘Atha kiñcarahi, bhante, bhagavā dubbhikkhe dvīhitike setaṭṭhike salākāvutte mahatā bhikkhusaṅghena saddhiṃ cārikaṃ carati? Ucchedāya bhagavā kulānaṃ paṭipanno, anayāya bhagavā kulānaṃ paṭipanno, upaghātāya bhagavā kulānaṃ paṭipanno’’ti. ‘‘Ito so, gāmaṇi, ekanavutikappe [ekanavuto kappo (syā. kaṃ.), ekanavutikappo (pī.)] yamahaṃ anussarāmi, nābhijānāmi kiñci kulaṃ pakkabhikkhānuppadānamattena upahatapubbaṃ. Atha kho yāni tāni kulāni aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni, sabbāni tāni dānasambhūtāni ceva saccasambhūtāni ca sāmaññasambhūtāni ca. Aṭṭha kho, gāmaṇi, hetū, aṭṭha paccayā kulānaṃ upaghātāya. Rājato vā kulāni upaghātaṃ gacchanti, corato vā kulāni upaghātaṃ gacchanti, aggito vā kulāni upaghātaṃ gacchanti, udakato vā kulāni upaghātaṃ gacchanti, nihitaṃ vā ṭhānā vigacchati [nihitaṃ vā nādhigacchanti (sī. pī.)], duppayuttā vā kammantā vipajjanti, kule vā kulaṅgāroti [kulānaṃ vā kulaṅgāro (sī.)] uppajjati, yo te bhoge vikirati vidhamati viddhaṃseti, aniccatāye aṭṭhamīti. Ime kho, gāmaṇi, aṭṭha hetū, aṭṭha paccayā kulānaṃ upaghātāya. Imesu kho, gāmaṇi, aṭṭhasu hetūsu, aṭṭhasu paccayesu saṃvijjamānesu yo maṃ evaṃ vadeyya – ‘ucchedāya bhagavā kulānaṃ paṭipanno, anayāya bhagavā kulānaṃ paṭipanno, upaghātāya bhagavā kulānaṃ paṭipanno’ti, taṃ, gāmaṇi, vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā yathābhataṃ nikkhitto evaṃ niraye’’ti. Evaṃ vutte, asibandhakaputto gāmaṇi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante, abhikkantaṃ, bhante…pe… upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Navamaṃ.",
      "english": "On one occasion, the Blessed One, while wandering in the Kosala country with a large community of monastics, arrived at Nāḷandā. There, indeed, the Blessed One resided in Nāḷandā, in the Pāvārika mango grove. Now, at that time, Nāḷandā was suffering from a famine, with food hard to come by, people emaciated, and food distributed by ticket. At that time, the ascetic Nigaṇṭha Nāṭaputta was residing in Nāḷandā with a large assembly of Nigaṇṭhas.\n\nThen, the headman Asibandhakaputta, a disciple of the Nigaṇṭhas, went to where the ascetic Nigaṇṭha Nāṭaputta was. Having approached and paid respects to the ascetic Nigaṇṭha Nāṭaputta, he sat down to one side. To Asibandhakaputta, the headman, who was sitting to one side, the ascetic Nigaṇṭha Nāṭaputta said this: \"Come, headman, challenge the doctrine of the ascetic Gotama. Then a fine reputation will arise for you: ‘Headman Asibandhakaputta has challenged the doctrine of the ascetic Gotama, who is of such great power and influence.’\"\n\n\"But how, venerable sir, shall I challenge the doctrine of the ascetic Gotama, who is of such great power and influence?\"\n\n\"Come, headman, go to where the ascetic Gotama is; having approached him, say this to the ascetic Gotama: ‘Venerable sir, does the Blessed One not, in many ways, praise compassion for families, protection of families, and sympathy for families?’ If, headman, the ascetic Gotama, when asked thus, answers thus: ‘Indeed, headman, the Tathāgata, in many ways, praises compassion for families, protection of families, and sympathy for families,’ then you should say this to him: ‘Then why, venerable sir, does the Blessed One wander with a large community of monastics in a famine-stricken place where food is hard to come by, where people are emaciated, and food is distributed by ticket? The Blessed One is devoted to the ruin of families, to the destruction of families, to the annihilation of families!’ When asked this double-edged question, headman, the ascetic Gotama will be unable to swallow it, nor will he be able to spit it out.\"\n\n\"‘Yes, venerable sir,’ replied headman Asibandhakaputta to the ascetic Nigaṇṭha Nāṭaputta. Rising from his seat, and having paid respects to the ascetic Nigaṇṭha Nāṭaputta, circumambulating him clockwise, he went to where the Blessed One was. Having approached and paid respects to the Blessed One, he sat down to one side. To the Blessed One, Asibandhakaputta, the headman, who was sitting to one side, said this: \"‘Venerable sir, does the Blessed One not, in many ways, praise compassion for families, protection of families, and sympathy for families?’\"\n\n\"‘Indeed, headman, the Tathāgata, in many ways, praises compassion for families, protection of families, and sympathy for families.’\"\n\n\"‘Then why, venerable sir, does the Blessed One wander with a large community of monastics in a famine-stricken place where food is hard to come by, where people are emaciated, and food is distributed by ticket? The Blessed One is devoted to the ruin of families, to the destruction of families, to the annihilation of families!’\"\n\n\"‘Headman, I recall ninety-one aeons ago; I do not know of any family that has ever been harmed merely by providing alms-food to renunciants. Indeed, those families that are prosperous, wealthy, and of great possessions, having abundant gold and silver, having abundant goods and resources, having abundant stored wealth and grain—all these have come about through giving, through truthfulness, and through virtuous conduct.\n\n‘Headman, there are eight causes and eight conditions for the ruin of families: Families are ruined by kings, or by thieves, or by fire, or by water, or buried treasure disappears from its place, or badly managed businesses fail, or a black sheep arises in the family who squanders, disperses, and destroys their wealth. Impermanence is the eighth. These, headman, are the eight causes and eight conditions for the ruin of families. Headman, when these eight causes and eight conditions exist, whoever would say to me thus: ‘The Blessed One is devoted to the ruin of families, to the destruction of families, to the annihilation of families,’ that person, headman, without abandoning that speech, without abandoning that thought, without relinquishing that view, will be cast into hell just as they are brought there.’\"\n\nWhen this was said, Asibandhakaputta, the headman, said to the Blessed One: \"‘Excellent, venerable sir! Excellent, venerable sir! It is as if someone were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms—in the same way has the Blessed One made the Dhamma clear in many ways. Let the Blessed One remember me as a lay follower who has gone for refuge from this day forth, as long as life lasts.’\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මහත් භික්ෂුසංඝයා වහන්සේලා සමඟ කෝසල ජනපදයෙහි චාරිකාවේ වඩිමින් නාලන්දා නුවරට වැඩම කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ නාලන්දා නුවර පාවාරික අඹ වනයේ වැඩ විසූ සේක. ඒ කාලයෙහි නාලන්දා නුවර දුර්භික්ෂයකට පත්ව, ආහාර ලබාගැනීම ඉතා අපහසු වී, ධාන්‍ය හිඟයෙන් සුදු ඇට පමණක් ඉතිරිව, සලාක ක්‍රමයට ආහාර බෙදා දෙන තත්ත්වයක පැවතිණි. ඒ කාලයෙහි නිගණ්ඨනාථපුත්‍ර තෙමේ මහත් වූ නිගණ්ඨ පිරිසක් සමඟ නාලන්දා නුවර වාසය කරන්නේය.\n\nඉක්බිති අසිබන්ධකපුත්‍ර ගාමණී නම් නිගණ්ඨ ශ්‍රාවක තෙමේ නිගණ්ඨනාථපුත්‍ර සිටින තැනට පැමිණියේය; පැමිණ, නිගණ්ඨනාථපුත්‍රට වැඳ, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අසිබන්ධකපුත්‍ර ගාමණීට නිගණ්ඨනාථපුත්‍ර මෙසේ කීවේය – “ගාමණී, එනු, ඔබ ශ්‍රමණ ගෞතමයන්ට වාදයක් නගනු. එසේ කළහොත් ඔබට යහපත් කීර්ති රාවයක් පැතිර යනු ඇත – ‘අසිබන්ධකපුත්‍ර ගාමණී විසින් මෙබඳු මහත් ඉර්ධි ඇති, මෙබඳු මහානුභාව සම්පන්න ශ්‍රමණ ගෞතමයන්ට වාදයක් නගන ලදී’ යනුවෙනි.” “ස්වාමීනි, එසේනම් මෙබඳු මහත් ඉර්ධි ඇති, මෙබඳු මහානුභාව සම්පන්න ශ්‍රමණ ගෞතමයන්ට මම කෙසේ වාදයක් නගන්නද?” “ගාමණී, එනු, ඔබ ශ්‍රමණ ගෞතමයන් සිටින තැනට යනු; පැමිණ ශ්‍රමණ ගෞතමයන්ට මෙසේ කියනු – ‘භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ නොයෙක් අයුරින් කුලයන් කෙරෙහි අනුකම්පාව, ආරක්ෂාව සහ කරුණාව වර්ණනා නොකරන සේක්ද?’ ගාමණී, ශ්‍රමණ ගෞතමයන් එසේ විමසූ විට මෙසේ පිළිතුරු දෙන්නේ නම් – ‘එසේය, ගාමණී, තථාගතයන් වහන්සේ නොයෙක් අයුරින් කුලයන් කෙරෙහි අනුකම්පාව, ආරක්ෂාව සහ කරුණාව වර්ණනා කරන සේකැ’යි කියා, එවිට ඔබ උන්වහන්සේට මෙසේ කියනු – ‘එසේනම්, භාග්‍යවතුන් වහන්ස, දුර්භික්ෂයකට පත්ව, ආහාර ලබාගැනීම ඉතා අපහසු වී, ධාන්‍ය හිඟයෙන් සුදු ඇට පමණක් ඉතිරිව, සලාක ක්‍රමයට ආහාර බෙදා දෙන තත්ත්වයක මහත් වූ භික්ෂුසංඝයා වහන්සේලා සමඟ භාග්‍යවතුන් වහන්සේ චාරිකාවේ වඩින්නේ මක්නිසාද? භාග්‍යවතුන් වහන්සේ කුලයන් විනාශ කිරීමට පිළිපන්නා සේක, භාග්‍යවතුන් වහන්සේ කුලයන් පිරිහීමට පිළිපන්නා සේක, භාග්‍යවතුන් වහන්සේ කුලයන්ට හානි කිරීමට පිළිපන්නා සේක’යි කියා! ගාමණී, මේ දෙකෙළවරින්ම දොස් නැගිය හැකි ප්‍රශ්නය (උභතෝකෝටික ප්‍රශ්නය) ශ්‍රමණ ගෞතමයන්ට විමසූ විට, උන්වහන්සේට එය ප්‍රතික්ෂේප කිරීමටවත්, පිළිගැනීමටවත් නොහැකි වනු ඇත.”\n\n“එසේය, ස්වාමීනි” යැයි අසිබන්ධකපුත්‍ර ගාමණී නිගණ්ඨනාථපුත්‍රට පිළිතුරු දී, ආසනයෙන් නැගිට, නිගණ්ඨනාථපුත්‍රට වැඳ, පැදකුණු කොට, භාග්‍යවතුන් වහන්සේ සිටින තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අසිබන්ධකපුත්‍ර ගාමණී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – “භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ නොයෙක් අයුරින් කුලයන් කෙරෙහි අනුකම්පාව, ආරක්ෂාව සහ කරුණාව වර්ණනා නොකරන සේක්ද?” “එසේය, ගාමණී, තථාගතයන් වහන්සේ නොයෙක් අයුරින් කුලයන් කෙරෙහි අනුකම්පාව, ආරක්ෂාව සහ කරුණාව වර්ණනා කරන සේක.” “එසේනම්, භාග්‍යවතුන් වහන්ස, දුර්භික්ෂයකට පත්ව, ආහාර ලබාගැනීම ඉතා අපහසු වී, ධාන්‍ය හිඟයෙන් සුදු ඇට පමණක් ඉතිරිව, සලාක ක්‍රමයට ආහාර බෙදා දෙන තත්ත්වයක මහත් වූ භික්ෂුසංඝයා වහන්සේලා සමඟ භාග්‍යවතුන් වහන්සේ චාරිකාවේ වඩින්නේ මක්නිසාද? භාග්‍යවතුන් වහන්සේ කුලයන් විනාශ කිරීමට පිළිපන්නා සේක, භාග්‍යවතුන් වහන්සේ කුලයන් පිරිහීමට පිළිපන්නා සේක, භාග්‍යවතුන් වහන්සේ කුලයන්ට හානි කිරීමට පිළිපන්නා සේක.”\n\n“ගාමණී, මෙයින් අනූඑක් කල්පයකට පෙර මම අනුස්මරණය කරමි, කිසිදු කුලයක් පිසූ දානය දීමෙන් පමණක් පිරිහීමට පත්ව ඇති බවක් මම නොදනිමි. එහෙත් යම් ඒ කුලයන් ධනවත් වූ, මහත් ධනය ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇතිව සිටිත්ද, ඒ සියල්ල දන් දීමෙන් ද, සත්‍ය පැවැත්වීමෙන් ද, ශ්‍රමණ ආදීන්ට උපස්ථාන කිරීමෙන් ද ඇති වූ ඒවාය. ගාමණී, කුලයන් පිරිහීමට හේතු අටක් ද, ප්‍රත්‍යයන් අටක් ද ඇත. රාජ්‍ය (විපත්) නිසා හෝ කුලයන් විනාශයට යති, සොර සතුරන් නිසා හෝ කුලයන් විනාශයට යති, ගින්නෙන් හෝ කුලයන් විනාශයට යති, ජලයෙන් හෝ කුලයන් විනාශයට යති, තැන්පත් කළ වස්තුව නැති වී යයි, අයහපත් ලෙස කරන ලද කර්මාන්ත (ව්‍යාපාර) විනාශයට පත් වේ, නැතහොත් කුලයෙහි කුලයට අඟුරු වන්නෙක් (කුලය විනාශ කරන්නෙක්) උපදී, ඔහු ඒ භෝග සම්පත් විසුරුවා හරියි, විනාශ කරයි, නැති කරයි. අටවැන්න නම් අනිත්‍ය ස්වභාවයයි. ගාමණී, කුලයන් පිරිහීමට මේ හේතු අට ද, ප්‍රත්‍යයන් අට ද වේ. ගාමණී, මේ හේතු අට ද, ප්‍රත්‍යයන් අට ද පවතිද්දී, යමෙක් මා කෙරෙහි මෙසේ කියන්නේ නම් – ‘භාග්‍යවතුන් වහන්සේ කුලයන් විනාශ කිරීමට පිළිපන්නා සේක, භාග්‍යවතුන් වහන්සේ කුලයන් පිරිහීමට පිළිපන්නා සේක, භාග්‍යවතුන් වහන්සේ කුලයන්ට හානි කිරීමට පිළිපන්නා සේක’යි කියා, ගාමණී, ඒ වචනයත් නොහැර, ඒ සිතත් නොහැර, ඒ දෘෂ්ටියත් අත්නොහැර, ඔහු ගෙන ගොස් දැමුවාක් මෙන් නිරයටම වැටෙන්නේය.”\n\nමෙසේ වදාළ විට, අසිබන්ධකපුත්‍ර ගාමණී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – “ඉතා මැනවි, භාග්‍යවතුන් වහන්ස, ඉතා මැනවි, භාග්‍යවතුන් වහන්ස, (ආදී වශයෙන් කරුණු පැහැදිලි වූ බැවින්), අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස භාග්‍යවතුන් වහන්සේ මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Kulasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Families",
      "sinhalaTitle": "කුල සූත්‍රය"
    },
    {
      "number": 362,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena rājantepure rājaparisāya sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘kappati samaṇānaṃ sakyaputtiyānaṃ jātarūparajataṃ, sādiyanti samaṇā sakyaputtiyā jātarūparajataṃ, paṭiggaṇhanti samaṇā sakyaputtiyā jātarūparajata’’nti! Tena kho pana samayena maṇicūḷako gāmaṇi tassaṃ parisāyaṃ nisinno hoti. Atha kho maṇicūḷako gāmaṇi taṃ parisaṃ etadavoca – ‘‘mā ayyo [ayyā (sī. pī.)] evaṃ avacuttha. Na kappati samaṇānaṃ sakyaputtiyānaṃ jātarūparajataṃ, na sādiyanti samaṇā sakyaputtiyā jātarūparajataṃ, nappaṭiggaṇhanti samaṇā sakyaputtiyā jātarūparajataṃ, nikkhittamaṇisuvaṇṇā samaṇā sakyaputtiyā apetajātarūparajatā’’ti. Asakkhi kho maṇicūḷako gāmaṇi taṃ parisaṃ saññāpetuṃ. Atha kho maṇicūḷako gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho maṇicūḷako gāmaṇi bhagavantaṃ etadavoca – ‘‘idha, bhante, rājantepure rājaparisāya sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘kappati samaṇānaṃ sakyaputtiyānaṃ jātarūparajataṃ, sādiyanti samaṇā sakyaputtiyā jātarūparajataṃ, paṭiggaṇhanti samaṇā sakyaputtiyā jātarūparajata’nti. Evaṃ vutte, ahaṃ, bhante, taṃ parisaṃ etadavocaṃ – ‘mā ayyo evaṃ avacuttha. Na kappati samaṇānaṃ sakyaputtiyānaṃ jātarūparajataṃ, na sādiyanti samaṇā sakyaputtiyā jātarūparajataṃ, nappaṭiggaṇhanti samaṇā sakyaputtiyā jātarūparajataṃ, nikkhittamaṇisuvaṇṇā samaṇā sakyaputtiyā apetajātarūparajatā’ti. Asakkhiṃ khvāhaṃ, bhante, taṃ parisaṃ saññāpetuṃ. Kaccāhaṃ, bhante, evaṃ byākaramāno vuttavādī ceva bhagavato homi, na ca bhagavantaṃ abhūtena abbhācikkhāmi, dhammassa cānudhammaṃ byākaromi, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchatī’’ti? ‘‘Taggha tvaṃ, gāmaṇi, evaṃ byākaramāno vuttavādī ceva me hosi, na ca maṃ abhūtena abbhācikkhasi, dhammassa cānudhammaṃ byākarosi, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchati. Na hi, gāmaṇi, kappati samaṇānaṃ sakyaputtiyānaṃ jātarūparajataṃ, na sādiyanti samaṇā sakyaputtiyā jātarūparajataṃ, nappaṭiggaṇhanti samaṇā sakyaputtiyā jātarūparajataṃ, nikkhittamaṇisuvaṇṇā samaṇā sakyaputtiyā apetajātarūparajatā. Yassa kho, gāmaṇi, jātarūparajataṃ kappati, pañcapi tassa kāmaguṇā kappanti. Yassa pañca kāmaguṇā kappanti ( ) [(tassapi jātarūparajataṃ kappati,) (syā. kaṃ.)], ekaṃsenetaṃ, gāmaṇi, dhāreyyāsi assamaṇadhammo asakyaputtiyadhammoti. Api cāhaṃ, gāmaṇi, evaṃ vadāmi – tiṇaṃ tiṇatthikena pariyesitabbaṃ, dāru dārutthikena pariyesitabbaṃ, sakaṭaṃ sakaṭatthikena pariyesitabbaṃ, puriso purisatthikena pariyesitabbo [pariyesitabbo’’ti (?)]. Natvevāhaṃ, gāmaṇi, kenaci pariyāyena ‘jātarūparajataṃ sāditabbaṃ pariyesitabba’nti vadāmī’’ti. Dasamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. Now at that time, in the king's inner palace, among the royal assembly who were gathered and seated, this conversation arose: \"Is it allowable for the recluses, the Sakyan sons, to possess gold and silver? Do the recluses, the Sakyan sons, accept gold and silver? Do the recluses, the Sakyan sons, receive gold and silver?\"\n\nNow at that time, the headman Maṇicūḷaka was seated in that assembly. Then the headman Maṇicūḷaka said to that assembly, \"Sirs, do not speak thus. It is not allowable for the recluses, the Sakyan sons, to possess gold and silver. The recluses, the Sakyan sons, do not accept gold and silver. The recluses, the Sakyan sons, do not receive gold and silver. The recluses, the Sakyan sons, have renounced jewels and gold; they are devoid of gold and silver.\" Indeed, the headman Maṇicūḷaka was able to convince that assembly.\n\nThen the headman Maṇicūḷaka approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, the headman Maṇicūḷaka said to the Blessed One, \"Here, venerable sir, in the king's inner palace, among the royal assembly who were gathered and seated, this conversation arose: 'Is it allowable for the recluses, the Sakyan sons, to possess gold and silver? Do the recluses, the Sakyan sons, accept gold and silver? Do the recluses, the Sakyan sons, receive gold and silver?' When this was said, venerable sir, I said to that assembly, 'Sirs, do not speak thus. It is not allowable for the recluses, the Sakyan sons, to possess gold and silver. The recluses, the Sakyan sons, do not accept gold and silver. The recluses, the Sakyan sons, do not receive gold and silver. The recluses, the Sakyan sons, have renounced jewels and gold; they are devoid of gold and silver.' I, venerable sir, was able to convince that assembly. Venerable sir, in speaking thus, am I indeed speaking in accordance with what the Blessed One has taught? Do I not misrepresent the Blessed One with what is untrue? Do I declare the Dhamma in accordance with the Dhamma? And does no legitimate criticism from a fellow practitioner arise?\"\n\n\"Indeed, headman, in speaking thus, you are speaking in accordance with what I have taught, and you do not misrepresent me with what is untrue, and you declare the Dhamma in accordance with the Dhamma, and no legitimate criticism from a fellow practitioner arises. For indeed, headman, it is not allowable for the recluses, the Sakyan sons, to possess gold and silver. The recluses, the Sakyan sons, do not accept gold and silver. The recluses, the Sakyan sons, do not receive gold and silver. The recluses, the Sakyan sons, have renounced jewels and gold; they are devoid of gold and silver. For whoever, headman, finds gold and silver allowable, for that person, the five strands of sensual pleasure are also allowable. For whoever finds the five strands of sensual pleasure allowable, you should firmly hold this, headman: that is not the way of a recluse, not the way of a Sakyan son. Furthermore, headman, I say this: Grass should be sought by one who needs grass. Wood should be sought by one who needs wood. A cart should be sought by one who needs a cart. A person should be sought by one who needs a person. But I, headman, in no way whatsoever say that 'gold and silver should be accepted or sought'.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දක නිවාපයේ වැඩසිටින සේක. එකල රජ මාළිගාව තුළ, රාජ සභාවෙහි එක්ව රැස්ව සිටි පිරිසක් අතරේ මේ කතාව ඇති විය – \"ශාක්‍යපුත්‍ර ශ්‍රමණවරුන්ට රන්රිදී භාරගැනීම සුදුසු ය. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී පිළිගනිති. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී සතුටින් පරිහරණය කරති!\" එකල මණිචූලක ගාමණී ද ඒ සභාවෙහි වාඩි වී සිටියේ ය. එවිට මණිචූලක ගාමණී ඒ පිරිසට මෙසේ කීවේ ය – \"ඇවැත්නි, එසේ නොකියනු මැනවි. ශාක්‍යපුත්‍ර ශ්‍රමණවරුන්ට රන්රිදී භාරගැනීම සුදුසු නොවේ. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී පිළිගන්නේ නැත. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී සතුටින් පරිහරණය කරන්නේ ද නැත. ශාක්‍යපුත්‍ර ශ්‍රමණවරු මැණික් රන් රිදී අත්හළෝ ය. රන්රිදී කෙරෙන් පහ වූවෝ ය.\" මණිචූලක ගාමණී ඒ පිරිසට අවබෝධ කරවීමට සමත් විය.\n\nඉන්පසු මණිචූලක ගාමණී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේ ය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි මණිචූලක ගාමණී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේ ය – \"වහන්ස, මෙහි රජ මාළිගාව තුළ, රාජ සභාවෙහි එක්ව රැස්ව සිටි පිරිසක් අතරේ මේ කතාව ඇති විය – 'ශාක්‍යපුත්‍ර ශ්‍රමණවරුන්ට රන්රිදී භාරගැනීම සුදුසු ය. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී පිළිගනිති. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී සතුටින් පරිහරණය කරති' කියා ය. වහන්ස, එසේ කී කල්හි මම ඒ පිරිසට මෙසේ කීවෙමි – 'ඇවැත්නි, එසේ නොකියනු මැනවි. ශාක්‍යපුත්‍ර ශ්‍රමණවරුන්ට රන්රිදී භාරගැනීම සුදුසු නොවේ. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී පිළිගන්නේ නැත. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී සතුටින් පරිහරණය කරන්නේ ද නැත. ශාක්‍යපුත්‍ර ශ්‍රමණවරු මැණික් රන් රිදී අත්හළෝ ය. රන්රිදී කෙරෙන් පහ වූවෝ ය' කියා ය. වහන්ස, මම ඒ පිරිසට අවබෝධ කරවීමට සමත් වූයෙමි. වහන්ස, මා මෙසේ ප්‍රකාශ කිරීමෙන් භාග්‍යවතුන් වහන්සේ වදාළ දේ ම කීවා වන්නේ ද? භාග්‍යවතුන් වහන්සේට අසත්‍යයෙන් චෝදනා නොකළේ වන්නේ ද? ධර්මයට අනුකූලව ධර්මය ප්‍රකාශ කළේ වන්නේ ද? කිසිදු සදහම් පිළිවෙතක් ඇත්තෙකුගේ වාදයක් හෝ විවාදයක් නින්දාවට ලක්වන ස්ථානයකට පත් නොවේ ද?\"\n\n\"ගාමණී, සැබවින් ම නුඹ මෙසේ ප්‍රකාශ කිරීමෙන් මා වදාළ දේ ම කීවා වන්නෙහි ය. මට අසත්‍යයෙන් චෝදනා නොකළෙහි ය. ධර්මයට අනුකූලව ධර්මය ප්‍රකාශ කළෙහි ය. කිසිදු සදහම් පිළිවෙතක් ඇත්තෙකුගේ වාදයක් හෝ විවාදයක් නින්දාවට ලක්වන ස්ථානයකට පත් නොවේ. ගාමණී, ශාක්‍යපුත්‍ර ශ්‍රමණවරුන්ට රන්රිදී භාරගැනීම සුදුසු නොවේ. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී පිළිගන්නේ නැත. ශාක්‍යපුත්‍ර ශ්‍රමණවරු රන්රිදී සතුටින් පරිහරණය කරන්නේ ද නැත. ශාක්‍යපුත්‍ර ශ්‍රමණවරු මැණික් රන් රිදී අත්හළෝ ය. රන්රිදී කෙරෙන් පහ වූවෝ ය. ගාමණී, යමෙකුට රන්රිදී සුදුසු වේ ද, පස්කම් ගුණය ද ඔහුට සුදුසු වේ. යමෙකුට පස්කම් ගුණය සුදුසු වේ ද, ඔහුට රන්රිදී ද සුදුසු වේ. ගාමණී, එය අසමණයෙකුගේ ධර්මය යි, අශාක්‍යපුත්‍රයෙකුගේ ධර්මය යි කියා තිරසාරව ම තේරුම් ගත යුතු ය. තව ද, ගාමණී, මම මෙසේ ද කියමි – තණ අවශ්‍ය කෙනෙකු විසින් තණ සොයාගත යුතු ය. දර අවශ්‍ය කෙනෙකු විසින් දර සොයාගත යුතු ය. කරත්තයක් අවශ්‍ය කෙනෙකු විසින් කරත්තයක් සොයාගත යුතු ය. මිනිසෙකු අවශ්‍ය කෙනෙකු විසින් මිනිසෙකු සොයාගත යුතු ය. නමුත්, ගාමණී, කිසිදු ආකාරයකින් 'රන්රිදී පරිහරණය කළ යුතු ය, සොයාගත යුතු ය' කියා මම නොකියමි.\"",
      "paliTitle": "Maṇicūḷakasuttaṃ",
      "vagga": "",
      "englishTitle": "To Maṇicūḷaka Sutta",
      "sinhalaTitle": "මණිචූළක සූත්‍රය"
    },
    {
      "number": 363,
      "pali": "Ekaṃ samayaṃ bhagavā mallesu viharati uruvelakappaṃ nāma mallānaṃ nigamo. Atha kho bhadrako gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhadrako gāmaṇi bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā dukkhassa samudayañca atthaṅgamañca desetū’’ti. ‘‘Ahañce [ahañca (syā. kaṃ. ka.)] te, gāmaṇi, atītamaddhānaṃ ārabbha dukkhassa samudayañca atthaṅgamañca deseyyaṃ – ‘evaṃ ahosi atītamaddhāna’nti, tatra te siyā kaṅkhā, siyā vimati. Ahaṃ ce [ahañca (syā. kaṃ. ka.)] te, gāmaṇi, anāgatamaddhānaṃ ārabbha dukkhassa samudayañca atthaṅgamañca deseyyaṃ – ‘evaṃ bhavissati anāgatamaddhāna’nti, tatrāpi te siyā kaṅkhā, siyā vimati. Api cāhaṃ, gāmaṇi, idheva nisinno ettheva te nisinnassa dukkhassa samudayañca atthaṅgamañca desessāmi. Taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho bhadrako gāmaṇi bhagavato paccassosi. Bhagavā etadavoca – ‘‘Taṃ kiṃ maññasi, gāmaṇi, atthi te uruvelakappe manussā yesaṃ te vadhena vā bandhena vā jāniyā vā garahāya vā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Atthi me, bhante, uruvelakappe manussā yesaṃ me vadhena vā bandhena vā jāniyā vā garahāya vā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti. ‘‘Atthi pana te, gāmaṇi, uruvelakappe manussā yesaṃ te vadhena vā bandhena vā jāniyā vā garahāya vā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Atthi me, bhante, uruvelakappe manussā yesaṃ me vadhena vā bandhena vā jāniyā vā garahāya vā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti. ‘‘Ko nu kho, gāmaṇi, hetu, ko paccayo yena te ekaccānaṃ uruvelakappiyānaṃ manussānaṃ vadhena vā bandhena vā jāniyā vā garahāya vā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Yesaṃ me, bhante, uruvelakappiyānaṃ manussānaṃ vadhena vā bandhena vā jāniyā vā garahāya vā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā, atthi me tesu chandarāgo. Yesaṃ pana, bhante, uruvelakappiyānaṃ manussānaṃ vadhena vā bandhena vā jāniyā vā garahāya vā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā, natthi me tesu chandarāgo’’ti. ‘‘Iminā tvaṃ, gāmaṇi, dhammena diṭṭhena viditena akālikena pattena pariyogāḷhena atītānāgate nayaṃ nehi – ‘yaṃ kho kiñci atītamaddhānaṃ dukkhaṃ uppajjamānaṃ uppajji [uppajjati (sabbattha)] sabbaṃ taṃ chandamūlakaṃ chandanidānaṃ. Chando hi mūlaṃ dukkhassa. Yampi hi kiñci anāgatamaddhānaṃ dukkhaṃ uppajjamānaṃ uppajjissati, sabbaṃ taṃ chandamūlakaṃ chandanidānaṃ. Chando hi mūlaṃ dukkhassā’’’ti. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāva subhāsitaṃ cidaṃ [subhāsitamidaṃ (sī. pī.)], bhante, bhagavatā [yaṅkiñci atītamaddhānaṃ dukkhaṃ uppajjamānaṃ uppajjati, sabbantaṃ chandamūlakaṃ chandanidānaṃ, chando hi mūlaṃ dukkhassāti, yaṅkiñci anāgatamaddhānaṃ dukkhaṃ uppajjamānaṃ uppajjissati sabbantaṃ chandamūlakaṃ chandanidānaṃ, chando hi mūlaṃ dukkhassā’’ti (syā. kaṃ.)] – ‘yaṃ kiñci dukkhaṃ uppajjamānaṃ uppajjati, sabbaṃ taṃ chandamūlakaṃ chandanidānaṃ. Chando hi mūlaṃ dukkhassā’ti. [‘‘yaṅkiñci atītamaddhānaṃ dukkhaṃ uppajjamānaṃ uppajjati, sabbantaṃ chandamūlakaṃ chandanidānaṃ, chando hi mūlaṃ dūkkhassāti, yaṅkiñci anāgatamaddhānaṃ dukkhaṃ uppajjamānaṃ uppajjissati, sabbantaṃ chandamūlakaṃ chandanidānaṃ, chando hi mūlaṃ dukkhassā’’ti (syā. kaṃ)] Atthi me, bhante, ciravāsī nāma kumāro bahi āvasathe [āvesane (?)] paṭivasati. So khvāhaṃ, bhante, kālasseva vuṭṭhāya purisaṃ uyyojemi [uyyojesiṃ (ka.)] – ‘gaccha, bhaṇe, ciravāsiṃ kumāraṃ jānāhī’ti. Yāvakīvañca, bhante, so puriso nāgacchati, tassa me hoteva aññathattaṃ – ‘mā heva ciravāsissa kumārassa kiñci ābādhayitthā’’’ti [ābādhayethāti (syā. kaṃ. pī. ka.)]. ‘‘Taṃ kiṃ maññasi, gāmaṇi, ciravāsissa kumārassa vadhena vā bandhena vā jāniyā vā garahāya vā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Ciravāsissa me, bhante, kumārassa vadhena vā bandhena vā jāniyā vā garahāya vā jīvitassapi siyā aññathattaṃ, kiṃ pana me nuppajjissanti sokaparidevadukkhadomanassupāyāsā’’ti. ‘‘Imināpi kho etaṃ, gāmaṇi, pariyāyena veditabbaṃ – ‘yaṃ kiñci dukkhaṃ uppajjamānaṃ uppajjati, sabbaṃ taṃ chandamūlakaṃ chandanidānaṃ. Chando hi mūlaṃ dukkhassā’’’ti. ‘‘Taṃ kiṃ maññasi, gāmaṇi, yadā te ciravāsimātā [ciravāsissa mātā (sī. pī.)] adiṭṭhā ahosi, assutā ahosi, te ciravāsimātuyā chando vā rāgo vā pemaṃ vā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Dassanaṃ vā te, gāmaṇi, āgamma savanaṃ vā evaṃ te ahosi – ‘ciravāsimātuyā chando vā rāgo vā pemaṃ vā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, gāmaṇi, ciravāsimātuyā te vadhena vā bandhena vā jāniyā vā garahāya vā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Ciravāsimātuyā me, bhante, vadhena vā bandhena vā jāniyā vā garahāya vā jīvitassapi siyā aññathattaṃ, kiṃ pana me nuppajjissanti sokaparidevadukkhadomanassupāyāsā’’ti! ‘‘Imināpi kho etaṃ, gāmaṇi, pariyāyena veditabbaṃ – ‘yaṃ kiñci dukkhaṃ uppajjamānaṃ uppajjati, sabbaṃ taṃ chandamūlakaṃ chandanidānaṃ. Chando hi mūlaṃ dukkhassā’’’ti. Ekādasamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling among the Mallas, at an agglomeration of villages of the Mallas named Uruvelakappa. Then indeed, Bhadraka the headman approached the Blessed One, and having approached, he paid homage to the Blessed One and sat down to one side. As he was sitting to one side, Bhadraka the headman said to the Blessed One, \"Venerable Sir, it would be good if the Blessed One would teach me the origin and cessation of suffering.\"\n\n\"Headman, if I were to teach you the origin and cessation of suffering concerning the past, saying, 'Thus it was in the past,' you might have doubt, you might have perplexity concerning it. Headman, if I were to teach you the origin and cessation of suffering concerning the future, saying, 'Thus it will be in the future,' you might also have doubt, you might have perplexity concerning that. But Headman, while I am sitting right here and you are sitting right here, I will teach you the origin and cessation of suffering. Listen to that, attend carefully; I will speak.\" \"Yes, Venerable Sir,\" Bhadraka the headman replied to the Blessed One.\n\nThe Blessed One said this: \"What do you think, Headman? Are there people in Uruvelakappa such that if they were killed or bound or suffered loss or censure, sorrow, lamentation, pain, displeasure, and despair would arise for you?\" \"Yes, Venerable Sir, there are people in Uruvelakappa such that if they were killed or bound or suffered loss or censure, sorrow, lamentation, pain, displeasure, and despair would arise for me.\" \"But Headman, are there people in Uruvelakappa such that if they were killed or bound or suffered loss or censure, sorrow, lamentation, pain, displeasure, and despair would not arise for you?\" \"Yes, Venerable Sir, there are people in Uruvelakappa such that if they were killed or bound or suffered loss or censure, sorrow, lamentation, pain, displeasure, and despair would not arise for me.\" \"What then, Headman, is the reason, what is the cause, by which for some people of Uruvelakappa, by their killing or binding or loss or censure, sorrow, lamentation, pain, displeasure, and despair would arise for you?\" \"Venerable Sir, for those people of Uruvelakappa for whom, by their killing or binding or loss or censure, sorrow, lamentation, pain, displeasure, and despair would arise for me, I have passionate desire for them. But Venerable Sir, for those people of Uruvelakappa for whom, by their killing or binding or loss or censure, sorrow, lamentation, pain, displeasure, and despair would not arise for me, I have no passionate desire for them.\"\n\n\"Headman, by this Dhamma, seen, known, immediately effective, attained, and fathomed, you should draw the conclusion regarding the past and the future: 'Whatever suffering arose in the past, all of that had desire as its root, had desire as its source. For indeed, desire is the root of suffering. And whatever suffering will arise in the future, all of that will have desire as its root, will have desire as its source. For indeed, desire is the root of suffering.'\"\n\n\"Amazing, Venerable Sir! Wondrous, Venerable Sir! How well spoken is this by the Blessed One: 'Whatever suffering arises, all of that has desire as its root, has desire as its source. For indeed, desire is the root of suffering.' Venerable Sir, I have a young man named Ciravāsī who lives outside in the lodging. So, Venerable Sir, having risen early, I send a man, saying, 'Go, friend, find out about young Ciravāsī.' And as long as, Venerable Sir, that man has not returned, I am then distressed, thinking, 'May nothing bad have happened to young Ciravāsī.'\" \"What do you think, Headman? If young Ciravāsī were killed or bound or suffered loss or censure, would sorrow, lamentation, pain, displeasure, and despair arise for you?\" \"Venerable Sir, if young Ciravāsī were killed or bound or suffered loss or censure, my very life might be affected. How then could sorrow, lamentation, pain, displeasure, and despair not arise for me?\"\n\nIndeed, Gāmaṇi, by this means too, it should be understood that whatever suffering arises, all of it has desire as its root, has desire as its source. For desire is the root of suffering.\n\nWhat do you think, Gāmaṇi? When your long-absent mother was unseen, was unheard of, did you have desire, or passion, or affection for that long-absent mother?\n\nNo, Venerable Sir.\n\nWas it upon seeing, Gāmaṇi, or upon hearing, that you came to have desire, or passion, or affection for that long-absent mother?\n\nYes, Venerable Sir.\n\nWhat do you think, Gāmaṇi? If that long-absent mother were to suffer death, or imprisonment, or loss, or blame, would sorrow, lamentation, pain, displeasure, and despair arise in you?\n\nVenerable Sir, if that long-absent mother were to suffer death, or imprisonment, or loss, or blame, my very life might be transformed. How then could sorrow, lamentation, pain, displeasure, and despair not arise in me!\n\nIndeed, Gāmaṇi, by this means too, it should be understood that whatever suffering arises, all of it has desire as its root, has desire as its source. For desire is the root of suffering.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ මල්ලවරුන්ගේ උරුවේලකප්ප නම් නියම්ගමෙහි වැඩසිටියහ. එවිට භද්‍රක ගාමණී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පැත්තක වාඩි විය. එක් පැත්තක වාඩි වී සිටි භද්‍රක ගාමණී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට දුකෙහි හටගැනීමත්, නැතිවීමත් දේශනා කළ මැනව.” “ගාමණී, මම ඔබට අතීත කාලය අරභයා දුකෙහි හටගැනීමත්, නැතිවීමත් ‘අතීත කාලයෙහි මෙසේ විය’ යි දේශනා කළහොත්, එහිදී ඔබට සැකයක්, විමතියක් ඇතිවිය හැක. ගාමණී, මම ඔබට අනාගත කාලය අරභයා දුකෙහි හටගැනීමත්, නැතිවීමත් ‘අනාගත කාලයෙහි මෙසේ වනු ඇත’ යි දේශනා කළහොත්, එහිදීත් ඔබට සැකයක්, විමතියක් ඇතිවිය හැක. එහෙත් ගාමණී, මම මෙතැනම හිඳගෙන, ඔබටත් මෙතැනම හිඳගෙන සිටියදී දුකෙහි හටගැනීමත්, නැතිවීමත් දේශනා කරන්නෙමි. ඒ කාරණය හොඳින් අසන්න. මැනවින් මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි.” “එසේය, ස්වාමීනි” යි භද්‍රක ගාමණී භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය.\n\nභාග්‍යවතුන් වහන්සේ මෙසේ වදාළහ: “ගාමණී, ඔබ මේ කුමක් සිතන්නෙහිද? උරුවේලකප්ප නම් නියම්ගමෙහි ඔබට යම් මිනිසුන් සිටීද, ඔවුන්ගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ ඔබට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස හටගන්නේද?” “ස්වාමීනි, උරුවේලකප්ප නම් නියම්ගමෙහි මට යම් මිනිසුන් සිටීද, ඔවුන්ගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ මට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස හටගනිති.” “නැවතත් ගාමණී, උරුවේලකප්ප නම් නියම්ගමෙහි ඔබට යම් මිනිසුන් සිටීද, ඔවුන්ගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ ඔබට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස නොහටගන්නේද?” “ස්වාමීනි, උරුවේලකප්ප නම් නියම්ගමෙහි මට යම් මිනිසුන් සිටීද, ඔවුන්ගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ මට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස නොහටගනිති.” “ගාමණී, කුමක්ද හේතුව, කුමක්ද ප්‍රත්‍යය, යම් නිසා ඔබට උරුවේලකප්පයේ සමහර මිනිසුන්ගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස හටගනිති?” “ස්වාමීනි, යම් උරුවේලකප්පයේ මිනිසුන්ගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ මට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස හටගනිතිද, ඔවුන් කෙරෙහි මට ඡන්දරාගය ඇත. නැවතත් ස්වාමීනි, යම් උරුවේලකප්පයේ මිනිසුන්ගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ මට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස නොහටගනිතිද, ඔවුන් කෙරෙහි මට ඡන්දරාගය නැත.”\n\n“ගාමණී, ඔබ මේ තමා විසින්ම දැකිය හැකි, නුවණින් දත හැකි, කල් නොයවා පල දෙන, සාක්ෂාත් කළ හැකි, ගැඹුරට පිවිසිය හැකි මේ ධර්මය තුළින් අතීතයටත්, අනාගතයටත් කරුණු ගලපා බලන්න. යම් කිසි දුකක් අතීත කාලයෙහි හටගත්තේද, ඒ සියල්ල ඡන්දය මුල් කරගෙන හටගත්තේය, ඡන්දය නිදානය කරගෙන හටගත්තේය. ඡන්දයම දුකෙහි මූලයයි. යම් කිසි දුකක් අනාගත කාලයෙහි හටගන්නේද, ඒ සියල්ල ඡන්දය මුල් කරගෙන හටගන්නේය, ඡන්දය නිදානය කරගෙන හටගන්නේය. ඡන්දයම දුකෙහි මූලයයි.” “ආශ්චර්යයකි, ස්වාමීනි! අද්භූතයකි, ස්වාමීනි! යම්කිසි දුකක් හටගන්නේ නම්, ඒ සියල්ල ඡන්දය මුල් කරගෙන හටගන්නේය, ඡන්දය නිදානය කරගෙන හටගන්නේය. ඡන්දයම දුකෙහි මූලයයි. භාග්‍යවතුන් වහන්සේ විසින් කොතරම් මැනවින් මෙය දේශනා කර තිබේද! ස්වාමීනි, මට චිරවාසී නම් කුමාරයෙක් පිටත ආවාසයක පදිංචි වී සිටී. ස්වාමීනි, මම ඉතා උදෑසනින් අවදි වී මිනිසකු යවමි: ‘මිත්‍රය, ගොස් චිරවාසී කුමාරයා ගැන විමසා බලන්න’ කියා. ස්වාමීනි, ඒ මිනිසා නැවත එන තෙක්, ‘සමහරවිට චිරවාසී කුමාරයාට කිසිදු කරදරයක් සිදු නොවී නම් හොඳයි’ යනුවෙන් මගේ සිතෙහි වෙනස්වීමක් හටගනී.” “ගාමණී, ඔබ කුමක් සිතන්නෙහිද? චිරවාසී කුමාරයාගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ ඔබට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස හටගන්නේද?” “ස්වාමීනි, චිරවාසී කුමාරයාගේ මැරීමෙන් හෝ බැඳීමෙන් හෝ විනාශයෙන් හෝ නින්දා කිරීමෙන් හෝ මගේ ජීවිතයට පවා වෙනස්වීමක් සිදුවිය හැක. එසේ නම්, මට ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස නොහටගන්නේ කෙසේද?”\n\nගාමණි, යම්කිසි දුකක් හටගන්නේ නම්, ඒ සියල්ල ඡන්දය මුල්කරගෙන, ඡන්දය නිසාම හටගන්නා බවත්, ඡන්දයම දුකෙහි මූලය වන බවත්, මේ ක්‍රමය අනුවද ඔබ විසින් දැනගත යුතුයි. ගාමණි, ඔබ කුමක් සිතනවාද? ඔබට කලක් තිස්සේ ඇසුරු කළ මව නොදැක සිටි කාලයේ, ඇගේ හඬ නොඇසී සිටි කාලයේ, ඒ මව කෙරෙහි ඔබට ඡන්දයක් හෝ රාගයක් හෝ ප්‍රේමයක් තිබුණාද? නැත, භාග්‍යවතුන් වහන්ස. ගාමණි, දැකීමක් හෝ ඇසීමක් නිසාද ඔබට ඒ කලක් ඇසුරු කළ මව කෙරෙහි ඡන්දයක් හෝ රාගයක් හෝ ප්‍රේමයක් ඇතිවුණේ? එසේය, භාග්‍යවතුන් වහන්ස. ගාමණි, ඔබ කුමක් සිතනවාද? ඔබගේ ඒ කලක් ඇසුරු කළ මවට මරණයක් හෝ හිරගෙට දැමීමක් හෝ යම් පාඩුවක් හෝ නින්දාවක් ඇතිවුවහොත් ඔබට ශෝකය, වැලපීම, ශාරීරික දුක, දොම්නස, දැඩි කලකිරීම් වැනි දෑ ඇතිවේද? භාග්‍යවතුන් වහන්ස, මාගේ ඒ කලක් ඇසුරු කළ මවට මරණයක් හෝ හිරගෙට දැමීමක් හෝ යම් පාඩුවක් හෝ නින්දාවක් ඇතිවුවහොත් මාගේ ජීවිතයට පවා වෙනසක් සිදුවිය හැකියි. එසේ නම්, මට ශෝකය, වැලපීම, ශාරීරික දුක, දොම්නස, දැඩි කලකිරීම් වැනි දෑ ඇති නොවන්නේ කෙසේද! ගාමණි, යම්කිසි දුකක් හටගන්නේ නම්, ඒ සියල්ල ඡන්දය මුල්කරගෙන, ඡන්දය නිසාම හටගන්නා බවත්, ඡන්දයම දුකෙහි මූලය වන බවත්, මේ ක්‍රමය අනුවද ඔබ විසින් දැනගත යුතුයි.",
      "paliTitle": "Bhadrakasuttaṃ",
      "vagga": "",
      "englishTitle": "Bhadraka Sutta",
      "sinhalaTitle": "භද්‍රක සූත්‍රය"
    },
    {
      "number": 364,
      "pali": "Atha kho rāsiyo gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rāsiyo gāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante, ‘samaṇo gotamo sabbaṃ tapaṃ garahati, sabbaṃ tapassiṃ lūkhajīviṃ ekaṃsena upavadati upakkosatī’ti [upakkosati upavadatīti (dī. ni. 1.381)]. Ye te, bhante, evamāhaṃsu – ‘samaṇo gotamo sabbaṃ tapaṃ garahati, sabbaṃ tapassiṃ lūkhajīviṃ ekaṃsena upavadati upakkosatī’ti, kacci te, bhante, bhagavato vuttavādino, na ca bhagavantaṃ abhūtena abbhācikkhanti, dhammassa cānudhammaṃ byākaronti, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchatī’’ti? ‘‘Ye te, gāmaṇi, evamāhaṃsu – ‘samaṇo gotamo sabbaṃ tapaṃ garahati, sabbaṃ tapassiṃ lūkhajīviṃ ekaṃsena upavadati upakkosatī’ti, na me te vuttavādino, abbhācikkhanti ca pana maṃ te asatā tucchā abhūtena’’. ‘‘Dveme, gāmaṇi, antā pabbajitena na sevitabbā – yo cāyaṃ kāmesu kāmasukhallikānuyogo hīno gammo pothujjaniko anariyo anatthasaṃhito, yo cāyaṃ attakilamathānuyogo dukkho anariyo anatthasaṃhito. Ete te, gāmaṇi, ubho ante anupagamma majjhimā paṭipadā tathāgatena abhisambuddhā – cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Katamā ca sā, gāmaṇi, majjhimā paṭipadā tathāgatena abhisambuddhā – cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṃvattati? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Ayaṃ kho sā, gāmaṇi, majjhimā paṭipadā tathāgatena abhisambuddhā – cakkhukaraṇī ñāṇakaraṇī upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. ‘‘Tayo kho me, gāmaṇi, kāmabhogino santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, gāmaṇi, ekacco kāmabhogī adhammena bhoge pariyesati, sāhasena adhammena bhoge pariyesitvā sāhasena na attānaṃ sukheti na pīṇeti na saṃvibhajati na puññāni karoti. Idha pana, gāmaṇi, ekacco kāmabhogī adhammena bhoge pariyesati sāhasena. Adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti, na saṃvibhajati na puññāni karoti. Idha pana, gāmaṇi, ekacco kāmabhogī adhammena bhoge pariyesati sāhasena. Adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. ‘‘Idha pana, gāmaṇi, ekacco kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi. Dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi na attānaṃ sukheti, na pīṇeti, na saṃvibhajati, na puññāni karoti. Idha pana, gāmaṇi, ekacco kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi. Dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti, na saṃvibhajati, na puññāni karoti. Idha pana, gāmaṇi, ekacco kāmabhogī dhammādhammena bhoge pariyesati, sāhasenapi asāhasenapi. Dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. ‘‘Idha pana, gāmaṇi, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena. Dhammena bhoge pariyesitvā asāhasena na attānaṃ sukheti, na pīṇeti, na saṃvibhajati, na puññāni karoti. Idha pana, gāmaṇi, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena. Dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti, na saṃvibhajati, na puññāni karoti. Idha pana, gāmaṇi, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena. Dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. Te ca bhoge gadhito [gathito (sī.)] mucchito ajjhopanno anādīnavadassāvī anissaraṇapañño paribhuñjati. Idha pana, gāmaṇi, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena. Dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. Te ca bhoge agadhito amucchito anajjhopanno ādīnavadassāvī nissaraṇapañño paribhuñjati. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī adhammena bhoge pariyesati sāhasena, adhammena bhoge pariyesitvā sāhasena na attānaṃ sukheti, na pīṇeti, na saṃvibhajati, na puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī tīhi ṭhānehi gārayho. Katamehi tīhi ṭhānehi gārayho? Adhammena bhoge pariyesati sāhasenāti, iminā paṭhamena ṭhānena gārayho. Na attānaṃ sukheti na pīṇetīti, iminā dutiyena ṭhānena gārayho. Na saṃvibhajati, na puññāni karotīti, iminā tatiyena ṭhānena gārayho. Ayaṃ, gāmaṇi, kāmabhogī imehi tīhi ṭhānehi gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī adhammena bhoge pariyesati sāhasena, adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti, na saṃvibhajati, na puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī dvīhi ṭhānehi gārayho, ekena ṭhānena pāsaṃso. Katamehi dvīhi ṭhānehi gārayho? Adhammena bhoge pariyesati sāhasenāti, iminā paṭhamena ṭhānena gārayho. Na saṃvibhajati, na puññāni karotīti, iminā dutiyena ṭhānena gārayho. Katamena ekena ṭhānena pāsaṃso? Attānaṃ sukheti pīṇetīti, iminā ekena ṭhānena pāsaṃso. Ayaṃ, gāmaṇi, kāmabhogī imehi dvīhi ṭhānehi gārayho, iminā ekena ṭhānena pāsaṃso. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī adhammena bhoge pariyesati sāhasena, adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī ekena ṭhānena gārayho, dvīhi ṭhānehi pāsaṃso. Katamena ekena ṭhānena gārayho? Adhammena bhoge pariyesati sāhasenāti, iminā ekena ṭhānena gārayho. Katamehi dvīhi ṭhānehi pāsaṃso? Attānaṃ sukheti pīṇetīti, iminā paṭhamena ṭhānena pāsaṃso. Saṃvibhajati puññāni karotīti, iminā dutiyena ṭhānena pāsaṃso. Ayaṃ, gāmaṇi, kāmabhogī, iminā ekena ṭhānena gārayho, imehi dvīhi ṭhānehi pāsaṃso. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi, dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi na attānaṃ sukheti, na pīṇeti, na saṃvibhajati, na puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī ekena ṭhānena pāsaṃso, tīhi ṭhānehi gārayho. Katamena ekena ṭhānena pāsaṃso? Dhammena bhoge pariyesati asāhasenāti, iminā ekena ṭhānena pāsaṃso. Katamehi tīhi ṭhānehi gārayho? Adhammena bhoge pariyesati sāhasenāti, iminā paṭhamena ṭhānena gārayho. Na attānaṃ sukheti, na pīṇetīti, iminā dutiyena ṭhānena gārayho. Na saṃvibhajati, na puññāni karotīti, iminā tatiyena ṭhānena gārayho. Ayaṃ, gāmaṇi, kāmabhogī iminā ekena ṭhānena pāsaṃso, imehi tīhi ṭhānehi gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi, dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti, na saṃvibhajati, na puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī dvīhi ṭhānehi pāsaṃso, dvīhi ṭhānehi gārayho. Katamehi dvīhi ṭhānehi pāsaṃso? Dhammena bhoge pariyesati asāhasenāti, iminā paṭhamena ṭhānena pāsaṃso. Attānaṃ sukheti pīṇetīti, iminā dutiyena ṭhānena pāsaṃso. Katamehi dvīhi ṭhānehi gārayho? Adhammena bhoge pariyesati sāhasenāti, iminā paṭhamena ṭhānena gārayho. Na saṃvibhajati, na puññāni karotīti, iminā dutiyena ṭhānena gārayho. Ayaṃ, gāmaṇi, kāmabhogī imehi dvīhi ṭhānehi pāsaṃso, imehi dvīhi ṭhānehi gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi, dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī tīhi ṭhānehi pāsaṃso, ekena ṭhānena gārayho. Katamehi tīhi ṭhānehi pāsaṃso? Dhammena bhoge pariyesati asāhasenāti, iminā paṭhamena ṭhānena pāsaṃso. Attānaṃ sukheti pīṇetīti, iminā dutiyena ṭhānena pāsaṃso. Saṃvibhajati puññāni karotīti, iminā tatiyena ṭhānena pāsaṃso. Katamena ekena ṭhānena gārayho? Adhammena bhoge pariyesati sāhasenāti, iminā ekena ṭhānena gārayho. Ayaṃ, gāmaṇi, kāmabhogī imehi tīhi ṭhānehi pāsaṃso, iminā ekena ṭhānena gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena, na attānaṃ sukheti, na pīṇeti, na saṃvibhajati, na puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī ekena ṭhānena pāsaṃso, dvīhi ṭhānehi gārayho. Katamena ekena ṭhānena pāsaṃso? Dhammena bhoge pariyesati asāhasenāti, iminā ekena ṭhānena pāsaṃso. Katamehi dvīhi ṭhānehi gārayho? Na attānaṃ sukheti, na pīṇetīti, iminā paṭhamena ṭhānena gārayho. Na saṃvibhajati, na puññāni karotīti, iminā dutiyena ṭhānena gārayho. Ayaṃ, gāmaṇi, kāmabhogī iminā ekena ṭhānena pāsaṃso, imehi dvīhi ṭhānehi gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti, na saṃvibhajati, na puññāni karoti. Ayaṃ, gāmaṇi, kāmabhogī dvīhi ṭhānehi pāsaṃso, ekena ṭhānena gārayho. Katamehi dvīhi ṭhānehi pāsaṃso? Dhammena bhoge pariyesati asāhasenāti, iminā paṭhamena ṭhānena pāsaṃso. Attānaṃ sukheti pīṇetīti, iminā dutiyena ṭhānena pāsaṃso. Katamena ekena ṭhānena gārayho? Na saṃvibhajati, na puññāni karotīti, iminā ekena ṭhānena gārayho. Ayaṃ, gāmaṇi, kāmabhogī imehi dvīhi ṭhānehi pāsaṃso, iminā ekena ṭhānena gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti, te ca bhoge gadhito mucchito ajjhopanno anādīnavadassāvī anissaraṇapañño paribhuñjati. Ayaṃ, gāmaṇi, kāmabhogī tīhi ṭhānehi pāsaṃso, ekena ṭhānena gārayho. Katamehi tīhi ṭhānehi pāsaṃso? Dhammena bhoge pariyesati asāhasenāti, iminā paṭhamena ṭhānena pāsaṃso. Attānaṃ sukheti pīṇetīti, iminā dutiyena ṭhānena pāsaṃso. Saṃvibhajati puññāni karotīti, iminā tatiyena ṭhānena pāsaṃso. Katamena ekena ṭhānena gārayho? Te ca bhoge gadhito mucchito ajjhopanno anādīnavadassāvī anissaraṇapañño paribhuñjatīti, iminā ekena ṭhānena gārayho. Ayaṃ, gāmaṇi, kāmabhogī imehi tīhi ṭhānehi pāsaṃso, iminā ekena ṭhānena gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. Te ca bhoge agadhito amucchito anajjhopanno ādīnavadassāvī nissaraṇapañño paribhuñjati. Ayaṃ, gāmaṇi, kāmabhogī catūhi ṭhānehi pāsaṃso. Katamehi catūhi ṭhānehi pāsaṃso? Dhammena bhoge pariyesati asāhasenāti, iminā paṭhamena ṭhānena pāsaṃso. Attānaṃ sukheti pīṇetīti, iminā dutiyena ṭhānena pāsaṃso. Saṃvibhajati puññāni karotīti, iminā tatiyena ṭhānena pāsaṃso. Te ca bhoge agadhito amucchito anajjhopanno ādīnavadassāvī nissaraṇapañño paribhuñjatīti, iminā catutthena ṭhānena pāsaṃso. Ayaṃ, gāmaṇi, kāmabhogī imehi catūhi ṭhānehi pāsaṃso. ‘‘Tayome, gāmaṇi, tapassino lūkhajīvino santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, gāmaṇi, ekacco tapassī lūkhajīvī saddhā agārasmā anagāriyaṃ pabbajito hoti – ‘appeva nāma kusalaṃ dhammaṃ adhigaccheyyaṃ, appeva nāma uttarimanussadhammā alamariyañāṇadassanavisesaṃ sacchikareyya’nti. So attānaṃ ātāpeti paritāpeti, kusalañca dhammaṃ nādhigacchati, uttari ca manussadhammā alamariyañāṇadassanavisesaṃ na sacchikaroti. ‘‘Idha pana, gāmaṇi, ekacco tapassī lūkhajīvī saddhā agārasmā anagāriyaṃ pabbajito hoti – ‘appeva nāma kusalaṃ dhammaṃ adhigaccheyyaṃ, appeva nāma uttarimanussadhammā alamariyañāṇadassanavisesaṃ sacchikareyya’nti. So attānaṃ ātāpeti paritāpeti, kusalañhi kho dhammaṃ adhigacchati, uttarimanussadhammā alamariyañāṇadassanavisesaṃ na sacchikaroti. ‘‘Idha pana, gāmaṇi, ekacco tapassī lūkhajīvī saddhā agārasmā anagāriyaṃ pabbajito hoti – ‘appeva nāma kusalaṃ dhammaṃ adhigaccheyyaṃ, appeva nāma uttarimanussadhammā alamariyañāṇadassanavisesaṃ sacchikareyya’nti. So attānaṃ ātāpeti paritāpeti, kusalañca dhammaṃ adhigacchati, uttari ca manussadhammā alamariyañāṇadassanavisesaṃ sacchikaroti. ‘‘Tatra, gāmaṇi, yvāyaṃ tapassī lūkhajīvī attānaṃ ātāpeti paritāpeti, kusalañca dhammaṃ nādhigacchati, uttari ca manussadhammā alamariyañāṇadassanavisesaṃ na sacchikaroti. Ayaṃ, gāmaṇi, tapassī lūkhajīvī tīhi ṭhānehi gārayho. Katamehi tīhi ṭhānehi gārayho? Attānaṃ ātāpeti paritāpetīti, iminā paṭhamena ṭhānena gārayho. Kusalañca dhammaṃ nādhigacchatīti, iminā dutiyena ṭhānena gārayho. Uttari ca manussadhammā alamariyañāṇadassanavisesaṃ na sacchikarotīti, iminā tatiyena ṭhānena gārayho. Ayaṃ, gāmaṇi, tapassī lūkhajīvī, imehi tīhi ṭhānehi gārayho. ‘‘Tatra, gāmaṇi, yvāyaṃ tapassī lūkhajīvī attānaṃ ātāpeti paritāpeti, kusalañhi kho dhammaṃ adhigacchati, uttari ca manussadhammā alamariyañāṇadassanavisesaṃ na sacchikaroti. Ayaṃ, gāmaṇi, tapassī lūkhajīvī dvīhi ṭhānehi gārayho, ekena ṭhānena pāsaṃso. Katamehi dvīhi ṭhānehi gārayho? Attānaṃ ātāpeti paritāpetīti, iminā paṭhamena ṭhānena gārayho. Uttari ca manussadhammā alamariyañāṇadassanavisesaṃ na sacchikarotīti, iminā dutiyena ṭhānena gārayho. Katamena ekena ṭhānena pāsaṃso? Kusalañhi kho dhammaṃ adhigacchatīti, iminā ekena ṭhānena pāsaṃso. Ayaṃ, gāmaṇi, tapassī lūkhajīvī imehi dvīhi ṭhānehi gārayho, iminā ekena ṭhānena pāsaṃso. ‘‘Tatra, gāmaṇi, yvāyaṃ tapassī lūkhajīvī attānaṃ ātāpeti paritāpeti, kusalañca dhammaṃ adhigacchati, uttari ca manussadhammā alamariyañāṇadassanavisesaṃ sacchikaroti. Ayaṃ, gāmaṇi, tapassī lūkhajīvī ekena ṭhānena gārayho, dvīhi ṭhānehi pāsaṃso. Katamena ekena ṭhānena gārayho? Attānaṃ ātāpeti paritāpetīti, iminā ekena ṭhānena gārayho. Katamehi dvīhi ṭhānehi pāsaṃso? Kusalañca dhammaṃ adhigacchatīti, iminā paṭhamena ṭhānena pāsaṃso. Uttari ca manussadhammā alamariyañāṇadassanavisesaṃ sacchikarotīti, iminā dutiyena ṭhānena pāsaṃso. Ayaṃ, gāmaṇi, tapassī lūkhajīvī iminā ekena ṭhānena gārayho, imehi dvīhi ṭhānehi pāsaṃso. ‘‘Tisso imā, gāmaṇi, sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Katamā tisso? Yaṃ ratto rāgādhikaraṇaṃ attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti. Rāge pahīne nevattabyābādhāya ceteti, na parabyābādhāya ceteti, na ubhayabyābādhāya ceteti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Yaṃ duṭṭho dosādhikaraṇaṃ attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti. Dose pahīne nevattabyābādhāya ceteti, na parabyābādhāya ceteti, na ubhayabyābādhāya ceteti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Yaṃ mūḷho mohādhikaraṇaṃ attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti. Mohe pahīne nevattabyābādhāya ceteti, na parabyābādhāya ceteti, na ubhayabyābādhāya ceteti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhi. Imā kho, gāmaṇi, tisso sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhī’’ti. Evaṃ vutte, rāsiyo gāmaṇi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante…pe… upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dvādasamaṃ.",
      "english": "Then Rāsiyo the Headman approached the Bhagavā. Having approached, he paid homage to the Bhagavā and sat down to one side. As he sat to one side, Rāsiyo the Headman said to the Bhagavā: \"I have heard this, Venerable Sir, that 'the recluse Gotama disparages all ascetic practices, and condemns and blames all ascetics leading a harsh life without exception.' Those, Venerable Sir, who have said this — 'the recluse Gotama disparages all ascetic practices, and condemns and blames all ascetics leading a harsh life without exception' — are they, Venerable Sir, speaking in accordance with what the Bhagavā has said? Do they not misrepresent the Bhagavā with what is untrue? Do they explain the Dhamma in accordance with the Dhamma? And does no co-dharmic statement lead to a censurable position?\" \"Headman, those who have said this — 'the recluse Gotama disparages all ascetic practices, and condemns and blames all ascetics leading a harsh life without exception' — they are not speaking in accordance with what I have said. Rather, they misrepresent me with what is false, empty, and untrue.\"\n\n\"Headman, these two extremes should not be practiced by one who has gone forth: that which is devotion to sensual pleasure in sense objects, which is low, vulgar, worldly, ignoble, and unbeneficial; and that which is devotion to self-mortification, which is painful, ignoble, and unbeneficial. Headman, avoiding these two extremes, the Middle Way has been fully awakened to by the Tathāgata, which brings about vision, brings about knowledge, and leads to peace, direct knowledge, full awakening, and Nibbāna. And what, Headman, is that Middle Way fully awakened to by the Tathāgata, which brings about vision, brings about knowledge, and leads to peace, direct knowledge, full awakening, and Nibbāna? It is simply this Noble Eightfold Path, that is to say: Right View... and so on... Right Concentration. This, Headman, is that Middle Way fully awakened to by the Tathāgata, which brings about vision, brings about knowledge, and leads to peace, direct knowledge, full awakening, and Nibbāna.\"\n\n\"Headman, there are these three types of sensual enjoyers existing in the world. Which three? Here, Headman, a certain sensual enjoyer seeks wealth unrighteously, with violence. Having sought wealth unrighteously, with violence, he does not gladden himself, does not nourish himself, does not share, and does not perform meritorious deeds. Here again, Headman, a certain sensual enjoyer seeks wealth unrighteously, with violence. Having sought wealth unrighteously, with violence, he gladdens himself, nourishes himself, but does not share and does not perform meritorious deeds. Here again, Headman, a certain sensual enjoyer seeks wealth unrighteously, with violence. Having sought wealth unrighteously, with violence, he gladdens himself, nourishes himself, shares, and performs meritorious deeds.\"\n\n\"Here again, Headman, a certain sensual enjoyer seeks wealth both righteously and unrighteously, both with violence and without violence. Having sought wealth both righteously and unrighteously, both with violence and without violence, he does not gladden himself, does not nourish himself, does not share, and does not perform meritorious deeds. Here again, Headman, a certain sensual enjoyer seeks wealth both righteously and unrighteously, both with violence and without violence. Having sought wealth both righteously and unrighteously, both with violence and without violence, he gladdens himself, nourishes himself, but does not share and does not perform meritorious deeds. Here again, Headman, a certain sensual enjoyer seeks wealth both righteously and unrighteously, both with violence and without violence. Having sought wealth both righteously and unrighteously, both with violence and without violence, he gladdens himself, nourishes himself, shares, and performs meritorious deeds.\"\n\n\"Here again, Headman, a certain sensual enjoyer seeks wealth righteously, without violence. Having sought wealth righteously, without violence, he does not gladden himself, does not nourish himself, does not share, and does not perform meritorious deeds. Here again, Headman, a certain sensual enjoyer seeks wealth righteously, without violence. Having sought wealth righteously, without violence, he gladdens himself, nourishes himself, but does not share and does not perform meritorious deeds. Here again, Headman, a certain sensual enjoyer seeks wealth righteously, without violence. Having sought wealth righteously, without violence, he gladdens himself, nourishes himself, shares, and performs meritorious deeds. And he consumes those possessions, covetous of them, infatuated by them, bound to them, not seeing their danger, without understanding of escape. Here again, Headman, a certain sensual enjoyer seeks wealth righteously, without violence. Having sought wealth righteously, without violence, he gladdens himself, nourishes himself, shares, and performs meritorious deeds. And he consumes those possessions, uncovetous of them, uninfatuated by them, unbound to them, seeing their danger, with understanding of escape.\"\n\n\"Among these, Headman, this sensual enjoyer who seeks wealth unrighteously, with violence; having sought wealth unrighteously, with violence, he does not gladden himself, does not nourish himself, does not share, and does not perform meritorious deeds. This sensual enjoyer, Headman, is censurable in three respects. In which three respects is he censurable? He seeks wealth unrighteously, with violence; by this first respect, he is censurable.\"\n\nHe does not make himself happy, nor does he nourish himself – by this second criterion, he is blameworthy. He does not share, nor does he perform meritorious deeds – by this third criterion, he is blameworthy. This sensual pleasure-seeker, headman, is blameworthy by these three criteria.\n\nHere, headman, when a sensual pleasure-seeker acquires wealth unrighteously, through force; having acquired wealth unrighteously, through force, he makes himself happy and nourishes himself, but he does not share, nor does he perform meritorious deeds. This sensual pleasure-seeker, headman, is blameworthy by two criteria and praiseworthy by one criterion. By which two criteria is he blameworthy? He acquires wealth unrighteously, through force – by this first criterion, he is blameworthy. He does not share, nor does he perform meritorious deeds – by this second criterion, he is blameworthy. By which one criterion is he praiseworthy? He makes himself happy and nourishes himself – by this one criterion, he is praiseworthy. This sensual pleasure-seeker, headman, is blameworthy by these two criteria and praiseworthy by this one criterion.\n\nHere, headman, when a sensual pleasure-seeker acquires wealth unrighteously, through force; having acquired wealth unrighteously, through force, he makes himself happy, nourishes himself, shares, and performs meritorious deeds. This sensual pleasure-seeker, headman, is blameworthy by one criterion and praiseworthy by two criteria. By which one criterion is he blameworthy? He acquires wealth unrighteously, through force – by this one criterion, he is blameworthy. By which two criteria is he praiseworthy? He makes himself happy and nourishes himself – by this first criterion, he is praiseworthy. He shares and performs meritorious deeds – by this second criterion, he is praiseworthy. This sensual pleasure-seeker, headman, is blameworthy by this one criterion and praiseworthy by these two criteria.\n\nHere, headman, when a sensual pleasure-seeker acquires wealth partly righteously and partly unrighteously, through force and without force; having acquired wealth partly righteously and partly unrighteously, through force and without force, he does not make himself happy, nor does he nourish himself, nor does he share, nor does he perform meritorious deeds. This sensual pleasure-seeker, headman, is praiseworthy by one criterion and blameworthy by three criteria. By which one criterion is he praiseworthy? He acquires wealth righteously, without force – by this one criterion, he is praiseworthy. By which three criteria is he blameworthy? He acquires wealth unrighteously, through force – by this first criterion, he is blameworthy. He does not make himself happy, nor does he nourish himself – by this second criterion, he is blameworthy. He does not share, nor does he perform meritorious deeds – by this third criterion, he is blameworthy. This sensual pleasure-seeker, headman, is praiseworthy by this one criterion and blameworthy by these three criteria.\n\nHere, headman, when a sensual pleasure-seeker acquires wealth partly righteously and partly unrighteously, through force and without force; having acquired wealth partly righteously and partly unrighteously, through force and without force, he makes himself happy and nourishes himself, but he does not share, nor does he perform meritorious deeds. This sensual pleasure-seeker, headman, is praiseworthy by two criteria and blameworthy by two criteria. By which two criteria is he praiseworthy? He acquires wealth righteously, without force – by this first criterion, he is praiseworthy. He makes himself happy and nourishes himself – by this second criterion, he is praiseworthy. By which two criteria is he blameworthy? He acquires wealth unrighteously, through force – by this first criterion, he is blameworthy. He does not share, nor does he perform meritorious deeds – by this second criterion, he is blameworthy. This sensual pleasure-seeker, headman, is praiseworthy by these two criteria and blameworthy by these two criteria.\n\nHere, headman, when a sensual pleasure-seeker acquires wealth partly righteously and partly unrighteously, through force and without force; having acquired wealth partly righteously and partly unrighteously, through force and without force, he makes himself happy, nourishes himself, shares, and performs meritorious deeds. This sensual pleasure-seeker, headman, is praiseworthy by three criteria and blameworthy by one criterion. By which three criteria is he praiseworthy? He acquires wealth righteously, without force – by this first criterion, he is praiseworthy. He makes himself happy and nourishes himself – by this second criterion, he is praiseworthy. He shares and performs meritorious deeds – by this third criterion, he is praiseworthy. By which one criterion is he blameworthy? He acquires wealth unrighteously, through force – by this one criterion, he is blameworthy. This sensual pleasure-seeker, headman, is praiseworthy by these three criteria and blameworthy by this one criterion.\n\nHere, headman, when a sensual pleasure-seeker acquires wealth righteously, without force; having acquired wealth righteously, without force, he does not make himself happy, nor does he nourish himself, nor does he share, nor does he perform meritorious deeds. This sensual pleasure-seeker, headman, is praiseworthy by one criterion and blameworthy by two criteria. By which one criterion is he praiseworthy? He acquires wealth righteously, without force – by this one criterion, he is praiseworthy. By which two criteria is he blameworthy? He does not make himself happy, nor does he nourish himself – by this first criterion, he is blameworthy. He does not share, nor does he perform meritorious deeds – by this second criterion, he is blameworthy. This sensual pleasure-seeker, headman, is praiseworthy by this one criterion and blameworthy by these two criteria.\n\nNow, Headman, there is a certain enjoyer of sensual pleasures who seeks wealth righteously, without coercion. Having sought wealth righteously, without coercion, he makes himself happy and contented, but he does not share it, nor does he perform meritorious deeds. This enjoyer of sensual pleasures, Headman, is praiseworthy in two respects, and blameworthy in one respect. In which two respects is he praiseworthy? ‘He seeks wealth righteously, without coercion’ – in this first respect he is praiseworthy. ‘He makes himself happy and contented’ – in this second respect he is praiseworthy. In which one respect is he blameworthy? ‘He does not share it, nor does he perform meritorious deeds’ – in this one respect he is blameworthy. This enjoyer of sensual pleasures, Headman, is praiseworthy in these two respects, and blameworthy in this one respect.\n\nNow, Headman, there is a certain enjoyer of sensual pleasures who seeks wealth righteously, without coercion. Having sought wealth righteously, without coercion, he makes himself happy and contented, shares it, and performs meritorious deeds; yet he consumes those enjoyments clinging to them, infatuated with them, immersed in them, not seeing their danger, and without insight into their escape. This enjoyer of sensual pleasures, Headman, is praiseworthy in three respects, and blameworthy in one respect. In which three respects is he praiseworthy? ‘He seeks wealth righteously, without coercion’ – in this first respect he is praiseworthy. ‘He makes himself happy and contented’ – in this second respect he is praiseworthy. ‘He shares it and performs meritorious deeds’ – in this third respect he is praiseworthy. In which one respect is he blameworthy? ‘He consumes those enjoyments clinging to them, infatuated with them, immersed in them, not seeing their danger, and without insight into their escape’ – in this one respect he is blameworthy. This enjoyer of sensual pleasures, Headman, is praiseworthy in these three respects, and blameworthy in this one respect.\n\nNow, Headman, there is a certain enjoyer of sensual pleasures who seeks wealth righteously, without coercion. Having sought wealth righteously, without coercion, he makes himself happy and contented, shares it, and performs meritorious deeds; and he consumes those enjoyments without clinging, without infatuation, without being immersed in them, seeing their danger, and with insight into their escape. This enjoyer of sensual pleasures, Headman, is praiseworthy in four respects. In which four respects is he praiseworthy? ‘He seeks wealth righteously, without coercion’ – in this first respect he is praiseworthy. ‘He makes himself happy and contented’ – in this second respect he is praiseworthy. ‘He shares it and performs meritorious deeds’ – in this third respect he is praiseworthy. ‘He consumes those enjoyments without clinging, without infatuation, without being immersed in them, seeing their danger, and with insight into their escape’ – in this fourth respect he is praiseworthy. This enjoyer of sensual pleasures, Headman, is praiseworthy in these four respects.\n\nHeadman, there are these three ascetics with a harsh way of life existing in the world. Which three? Here, Headman, some ascetic with a harsh way of life, out of faith, has gone forth from the home life into homelessness, thinking: ‘Perhaps I might attain skillful qualities, perhaps I might realize a special superior human state, a noble knowledge and vision.’ He torments and afflicts himself, but he does not attain skillful qualities, nor does he realize a special superior human state, a noble knowledge and vision.\n\nBut here, Headman, some ascetic with a harsh way of life, out of faith, has gone forth from the home life into homelessness, thinking: ‘Perhaps I might attain skillful qualities, perhaps I might realize a special superior human state, a noble knowledge and vision.’ He torments and afflicts himself, and he does attain skillful qualities, but he does not realize a special superior human state, a noble knowledge and vision.\n\nBut here, Headman, some ascetic with a harsh way of life, out of faith, has gone forth from the home life into homelessness, thinking: ‘Perhaps I might attain skillful qualities, perhaps I might realize a special superior human state, a noble knowledge and vision.’ He torments and afflicts himself, and he does attain skillful qualities, and he does realize a special superior human state, a noble knowledge and vision.\n\nNow, Headman, that ascetic with a harsh way of life who torments and afflicts himself, but does not attain skillful qualities, nor does he realize a special superior human state, a noble knowledge and vision. This ascetic with a harsh way of life, Headman, is blameworthy in three respects. In which three respects is he blameworthy? ‘He torments and afflicts himself’ – in this first respect he is blameworthy. ‘He does not attain skillful qualities’ – in this second respect he is blameworthy. ‘He does not realize a special superior human state, a noble knowledge and vision’ – in this third respect he is blameworthy. This ascetic with a harsh way of life, Headman, is blameworthy in these three respects.\n\nNow, Headman, that ascetic with a harsh way of life who torments and afflicts himself, and does attain skillful qualities, but does not realize a special superior human state, a noble knowledge and vision. This ascetic with a harsh way of life, Headman, is blameworthy in two respects, and praiseworthy in one respect. In which two respects is he blameworthy?\n\nHe afflicts and torments himself; by this first ground he is censurable. Furthermore, he does not realize any special distinction of noble knowledge and vision that is superior to human states; by this second ground he is censurable. By what single ground is he praiseworthy? For he attains wholesome states; by this single ground he is praiseworthy. This ascetic, O village headman, who lives a harsh life, is censurable on these two grounds, and praiseworthy on this one ground.\n\nNow, O village headman, take the case where an ascetic living a harsh life afflicts and torments himself, yet also attains wholesome states, and realizes a special distinction of noble knowledge and vision that is superior to human states. This ascetic, O village headman, living a harsh life, is censurable on one ground, and praiseworthy on two grounds. By what single ground is he censurable? He afflicts and torments himself; by this single ground he is censurable. By what two grounds is he praiseworthy? He attains wholesome states; by this first ground he is praiseworthy. And he realizes a special distinction of noble knowledge and vision superior to human states; by this second ground he is praiseworthy. This ascetic, O village headman, living a harsh life, is censurable on this one ground, and praiseworthy on these two grounds.\n\nThese three, O village headman, are immediate cessations of defilements, timeless, inviting inspection, leading onwards, and to be personally experienced by the wise. Which three? When one is infatuated, based on lust, one intends harm to oneself, one intends harm to others, and one intends harm to both. With lust abandoned, one does not intend harm to oneself, nor harm to others, nor harm to both. This is an immediate cessation of defilements, timeless, inviting inspection, leading onwards, and to be personally experienced by the wise. When one is malicious, based on hatred, one intends harm to oneself, one intends harm to others, and one intends harm to both. With hatred abandoned, one does not intend harm to oneself, nor harm to others, nor harm to both. This is an immediate cessation of defilements, timeless, inviting inspection, leading onwards, and to be personally experienced by the wise. When one is deluded, based on ignorance, one intends harm to oneself, one intends harm to others, and one intends harm to both. With ignorance abandoned, one does not intend harm to oneself, nor harm to others, nor harm to both. This is an immediate cessation of defilements, timeless, inviting inspection, leading onwards, and to be personally experienced by the wise. These three, O village headman, are immediate cessations of defilements, timeless, inviting inspection, leading onwards, and to be personally experienced by the wise.\n\nWhen this was said, Rasiya the village headman said to the Blessed One: \"Excellent, Venerable Sir! Excellent, Venerable Sir! It is as if someone were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to hold up a lamp in the darkness so that those with eyes could see forms. In the same way has the Blessed One made the Dhamma clear in various ways. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May the Blessed One remember me as a lay follower who has gone for refuge from this day forth as long as life lasts.\"",
      "sinhala": "එවිට රාසියෝ ගාමණී භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි රාසියෝ ගාමණී භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘වහන්ස, ‘ශ්‍රමණ ගෞතම සියලු තපස් ක්‍රියා හෙළා දකී, සියලු තපස්වීන් හෙළා දකිමින්, අප්‍රිය වූ රළු ජීවිතයක් ගතකරන බවට නිග්‍රහ කරයි’ යනුවෙන් මා අසා ඇත. වහන්ස, ‘ශ්‍රමණ ගෞතම සියලු තපස් ක්‍රියා හෙළා දකී, සියලු තපස්වීන් හෙළා දකිමින්, අප්‍රිය වූ රළු ජීවිතයක් ගතකරන බවට නිග්‍රහ කරයි’ යනුවෙන් යමෙක් කියත්ද, වහන්ස, ඔවුන් භාග්‍යවතුන් වහන්සේගේ වචනයම කියන්නේද? භාග්‍යවතුන් වහන්සේට අසත්‍යයෙන් අපවාද නොකියත්ද? ධර්මයට අනුකූලව දේශනා කරත්ද? ධර්මයට අනුකූලව ඇති කිසිදු වාද විවාදයකදී ඔවුන්ට දොස් පැවරිය යුතු තැනකට නොපැමිණෙත්ද?’’\n\n‘‘ගාමණී, ‘ශ්‍රමණ ගෞතම සියලු තපස් ක්‍රියා හෙළා දකී, සියලු තපස්වීන් හෙළා දකිමින්, අප්‍රිය වූ රළු ජීවිතයක් ගතකරන බවට නිග්‍රහ කරයි’ යනුවෙන් යමෙක් කියත්ද, ඔවුහු මාගේ වචනයම කියන්නෝ නොවෙති. ඔවුහු මා සත්‍යයෙන් තොර, හිස්, අභූත චෝදනාවලින් අවලාද නගති.’’\n\n‘‘ගාමණී, පැවිද්දකු විසින් සේවනය නොකළ යුතු අන්ත දෙකක් මේවාය. යම් මේ කාමයන්හි කාමසුඛල්ලිකානුයෝගයෙක් ඇත්ද, එය පහත්ය, ග්‍රාම්‍යය, පෘථග්ජන ස්වභාවයෙන් යුක්තය, ආර්ය නොවේ, අර්ථයකින් තොරය. යම් මේ අත්තකිලමථානුයෝගයෙක් ඇත්ද, එය දුක් සහිතය, ආර්ය නොවේ, අර්ථයකින් තොරය. ගාමණී, ඒ අන්ත දෙකට නොපැමිණ, තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද මධ්‍යම ප්‍රතිපදාවක් ඇත. එය චක්ෂුස් ඇති කරයි, ඥානය ඇති කරයි, උපශාන්තියට, අභිඥාවට, සම්බෝධියට, නිර්වාණයට පමුණුවයි. ගාමණී, චක්ෂුස් ඇති කරන, ඥානය ඇති කරන, උපශාන්තියට, අභිඥාවට, සම්බෝධියට, නිර්වාණයට පමුණුවන, තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද ඒ මධ්‍යම ප්‍රතිපදාව කවරේද? මෙයම ආර්ය අෂ්ටාංගික මාර්ගයයි. එනම් – සම්‍යක්දෘෂ්ටිය... [ආදී වශයෙන්]... සම්‍යක්සමාධියයි. ගාමණී, චක්ෂුස් ඇති කරන, ඥානය ඇති කරන, උපශාන්තියට, අභිඥාවට, සම්බෝධියට, නිර්වාණයට පමුණුවන, තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද ඒ මධ්‍යම ප්‍රතිපදාව මෙයයි.\n\n‘‘ගාමණී, කාම භුක්ති විඳින්නන් තිදෙනෙක් ලෝකයේ සිටිති, පවතී. ඒ තිදෙනා කවරහුද? ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයා තමා සතුටු නොකරයි, පිනවන්නේ නැත, බෙදා දෙන්නේ නැත, පින්කම් නොකරයි. ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයා තමා සතුටු කරයි, පිනවයි, බෙදා දෙන්නේ නැත, පින්කම් නොකරයි. ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයා තමා සතුටු කරයි, පිනවයි, බෙදා දෙයි, පින්කම් කරයි.\n\n‘‘ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් සහ බලහත්කාරයකින් තොරව භෝග සොයයි. ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් සහ බලහත්කාරයකින් තොරව භෝග සොයා තමා සතුටු නොකරයි, පිනවන්නේ නැත, බෙදා දෙන්නේ නැත, පින්කම් නොකරයි. ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් සහ බලහත්කාරයකින් තොරව භෝග සොයයි. ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් සහ බලහත්කාරයකින් තොරව භෝග සොයා තමා සතුටු කරයි, පිනවයි, බෙදා දෙන්නේ නැත, පින්කම් නොකරයි. ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් සහ බලහත්කාරයකින් තොරව භෝග සොයයි. ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් සහ බලහත්කාරයකින් තොරව භෝග සොයා තමා සතුටු කරයි, පිනවයි, බෙදා දෙයි, පින්කම් කරයි.\n\n‘‘ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයා තමා සතුටු නොකරයි, පිනවන්නේ නැත, බෙදා දෙන්නේ නැත, පින්කම් නොකරයි. ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයා තමා සතුටු කරයි, පිනවයි, බෙදා දෙන්නේ නැත, පින්කම් නොකරයි. ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයා තමා සතුටු කරයි, පිනවයි, බෙදා දෙයි, පින්කම් කරයි. එම භෝගයන් දැඩිව බැඳී, දැඩිව ඇලී, දැඩිව ගැලී, ඒවායේ ආදීනව නොදක්නාසුලුව, ඒවායින් මිදීමට නුවණ නැත්තෙක්ව පරිභෝග කරයි. ගාමණී, මෙහි ඇතැම් කාම භුක්ති විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව භෝග සොයා තමා සතුටු කරයි, පිනවයි, බෙදා දෙයි, පින්කම් කරයි. එම භෝගයන් දැඩිව නොබැඳී, දැඩිව නොඇලී, දැඩිව නොගැලී, ඒවායේ ආදීනව දක්නාසුලුව, ඒවායින් මිදීමට නුවණ ඇත්තෙක්ව පරිභෝග කරයි.\n\n‘‘ගාමණී, ඒ කාම භුක්ති විඳින්නන් අතුරින් යමෙක් අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයා තමා සතුටු නොකරයි, පිනවන්නේ නැත, බෙදා දෙන්නේ නැත, පින්කම් නොකරයි. ගාමණී, මේ කාම භුක්ති විඳින්නා කරුණු තුනකින් දොස් පැවරිය යුත්තෙකි. කවර කරුණු තුනකින් දොස් පැවරිය යුත්තේද? අධර්මයෙන්, බලහත්කාරයෙන් භෝග සොයයි යන මේ පළමු කරුණෙන් දොස් පැවරිය යුත්තෙකි.\n\nතමා සතුටු නොකරයි, නොපිනවයි යන මේ දෙවෙනි කරුණෙන් නින්දා කටයුතුය. නො බෙදා දෙයි, නො පින් කරයි යන මේ තුන්වෙනි කරුණෙන් නින්දා කටයුතුය. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා මේ කරුණු තුනෙන් නින්දා කටයුතුය.\n\nගාමණි, යම් කම්සැප භුක්ති විඳින්නෙක් අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගනීද, අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගෙන තමා සතුටු කරයිද, පිනවයිද, නො බෙදා දෙයිද, නො පින් කරයිද. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා කරුණු දෙකකින් නින්දා කටයුතුය, එක් කරුණකින් ප්‍රශංසා කටයුතුය. කවර කරුණු දෙකකින් නින්දා කටයුතුද? අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගනී යන මේ පළමු කරුණෙන් නින්දා කටයුතුය. නො බෙදා දෙයි, නො පින් කරයි යන මේ දෙවෙනි කරුණෙන් නින්දා කටයුතුය. කවර එක් කරුණකින් ප්‍රශංසා කටයුතුද? තමා සතුටු කරයි, පිනවයි යන මේ එක් කරුණෙන් ප්‍රශංසා කටයුතුය. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා මේ කරුණු දෙකෙන් නින්දා කටයුතුය, මේ එක් කරුණෙන් ප්‍රශංසා කටයුතුය.\n\nගාමණි, යම් කම්සැප භුක්ති විඳින්නෙක් අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගනීද, අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගෙන තමා සතුටු කරයිද, පිනවයිද, බෙදා දෙයිද, පින් කරයිද. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා එක් කරුණකින් නින්දා කටයුතුය, කරුණු දෙකකින් ප්‍රශංසා කටයුතුය. කවර එක් කරුණකින් නින්දා කටයුතුද? අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගනී යන මේ එක් කරුණෙන් නින්දා කටයුතුය. කවර කරුණු දෙකකින් ප්‍රශංසා කටයුතුද? තමා සතුටු කරයි, පිනවයි යන මේ පළමු කරුණෙන් ප්‍රශංසා කටයුතුය. බෙදා දෙයි, පින් කරයි යන මේ දෙවෙනි කරුණෙන් ප්‍රශංසා කටයුතුය. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා මේ එක් කරුණකින් නින්දා කටයුතුය, මේ කරුණු දෙකෙන් ප්‍රශංසා කටයුතුය.\n\nගාමණි, යම් කම්සැප භුක්ති විඳින්නෙක් ධර්මයෙන්ද, අධර්මයෙන්ද, බලහත්කාරයෙන්ද, බලහත්කාරයෙන් නොවන ලෙසින්ද භෝගයන් සොයාගනීද, ධර්මයෙන්ද, අධර්මයෙන්ද, බලහත්කාරයෙන්ද, බලහත්කාරයෙන් නොවන ලෙසින්ද භෝගයන් සොයාගෙන තමා සතුටු නොකරයිද, නොපිනවයිද, නොබෙදා දෙයිද, නොපින් කරයිද. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා එක් කරුණකින් ප්‍රශංසා කටයුතුය, කරුණු තුනකින් නින්දා කටයුතුය. කවර එක් කරුණකින් ප්‍රශංසා කටයුතුද? ධර්මයෙන් බලහත්කාරයෙන් නොවන ලෙසින් භෝගයන් සොයාගනී යන මේ එක් කරුණෙන් ප්‍රශංසා කටයුතුය. කවර කරුණු තුනකින් නින්දා කටයුතුද? අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගනී යන මේ පළමු කරුණෙන් නින්දා කටයුතුය. තමා සතුටු නොකරයි, නොපිනවයි යන මේ දෙවෙනි කරුණෙන් නින්දා කටයුතුය. නො බෙදා දෙයි, නො පින් කරයි යන මේ තුන්වෙනි කරුණෙන් නින්දා කටයුතුය. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා මේ එක් කරුණකින් ප්‍රශංසා කටයුතුය, මේ කරුණු තුනෙන් නින්දා කටයුතුය.\n\nගාමණි, යම් කම්සැප භුක්ති විඳින්නෙක් ධර්මයෙන්ද, අධර්මයෙන්ද, බලහත්කාරයෙන්ද, බලහත්කාරයෙන් නොවන ලෙසින්ද භෝගයන් සොයාගනීද, ධර්මයෙන්ද, අධර්මයෙන්ද, බලහත්කාරයෙන්ද, බලහත්කාරයෙන් නොවන ලෙසින්ද භෝගයන් සොයාගෙන තමා සතුටු කරයිද, පිනවයිද, නො බෙදා දෙයිද, නො පින් කරයිද. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා කරුණු දෙකකින් ප්‍රශංසා කටයුතුය, කරුණු දෙකකින් නින්දා කටයුතුය. කවර කරුණු දෙකකින් ප්‍රශංසා කටයුතුද? ධර්මයෙන් බලහත්කාරයෙන් නොවන ලෙසින් භෝගයන් සොයාගනී යන මේ පළමු කරුණෙන් ප්‍රශංසා කටයුතුය. තමා සතුටු කරයි, පිනවයි යන මේ දෙවෙනි කරුණෙන් ප්‍රශංසා කටයුතුය. කවර කරුණු දෙකකින් නින්දා කටයුතුද? අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගනී යන මේ පළමු කරුණෙන් නින්දා කටයුතුය. නො බෙදා දෙයි, නො පින් කරයි යන මේ දෙවෙනි කරුණෙන් නින්දා කටයුතුය. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා මේ කරුණු දෙකෙන් ප්‍රශංසා කටයුතුය, මේ කරුණු දෙකෙන් නින්දා කටයුතුය.\n\nගාමණි, යම් කම්සැප භුක්ති විඳින්නෙක් ධර්මයෙන්ද, අධර්මයෙන්ද, බලහත්කාරයෙන්ද, බලහත්කාරයෙන් නොවන ලෙසින්ද භෝගයන් සොයාගනීද, ධර්මයෙන්ද, අධර්මයෙන්ද, බලහත්කාරයෙන්ද, බලහත්කාරයෙන් නොවන ලෙසින්ද භෝගයන් සොයාගෙන තමා සතුටු කරයිද, පිනවයිද, බෙදා දෙයිද, පින් කරයිද. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා කරුණු තුනකින් ප්‍රශංසා කටයුතුය, එක් කරුණකින් නින්දා කටයුතුය. කවර කරුණු තුනකින් ප්‍රශංසා කටයුතුද? ධර්මයෙන් බලහත්කාරයෙන් නොවන ලෙසින් භෝගයන් සොයාගනී යන මේ පළමු කරුණෙන් ප්‍රශංසා කටයුතුය. තමා සතුටු කරයි, පිනවයි යන මේ දෙවෙනි කරුණෙන් ප්‍රශංසා කටයුතුය. බෙදා දෙයි, පින් කරයි යන මේ තුන්වෙනි කරුණෙන් ප්‍රශංසා කටයුතුය. කවර එක් කරුණකින් නින්දා කටයුතුද? අධර්මයෙන් බලහත්කාරයෙන් භෝගයන් සොයාගනී යන මේ එක් කරුණෙන් නින්දා කටයුතුය. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා මේ කරුණු තුනෙන් ප්‍රශංසා කටයුතුය, මේ එක් කරුණෙන් නින්දා කටයුතුය.\n\nගාමණි, යම් කම්සැප භුක්ති විඳින්නෙක් ධර්මයෙන් බලහත්කාරයෙන් නොවන ලෙසින් භෝගයන් සොයාගනීද, ධර්මයෙන් බලහත්කාරයෙන් නොවන ලෙසින් භෝගයන් සොයාගෙන තමා සතුටු නොකරයිද, නොපිනවයිද, නොබෙදා දෙයිද, නොපින් කරයිද. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා එක් කරුණකින් ප්‍රශංසා කටයුතුය, කරුණු දෙකකින් නින්දා කටයුතුය. කවර එක් කරුණකින් ප්‍රශංසා කටයුතුද? ධර්මයෙන් බලහත්කාරයෙන් නොවන ලෙසින් භෝගයන් සොයාගනී යන මේ එක් කරුණෙන් ප්‍රශංසා කටයුතුය. කවර කරුණු දෙකකින් නින්දා කටයුතුද? තමා සතුටු නොකරයි, නොපිනවයි යන මේ පළමු කරුණෙන් නින්දා කටයුතුය. නො බෙදා දෙයි, නො පින් කරයි යන මේ දෙවෙනි කරුණෙන් නින්දා කටයුතුය. ගාමණි, මේ කම්සැප භුක්ති විඳින්නා මේ එක් කරුණකින් ප්‍රශංසා කටයුතුය, මේ කරුණු දෙකෙන් නින්දා කටයුතුය.\n\nගාමණි, යම් කාමභෝගියෙක් ධාර්මිකව, අසාහසින් (පීඩාවකින් තොරව) භෝගයන් සොයන්නේද, ධාර්මිකව, අසාහසින් භෝගයන් සොයා තමන්ව සුවපත් කරන්නේද, පෝෂණය කරන්නේද, නමුත් අනුන්ට බෙදා නොදෙයිද, පින්කම් නොකරයිද, ගාමණි, මේ කාමභෝගියා කරුණු දෙකකින් ප්‍රශංසාවට ලක්විය යුතු අතර, එක් කරුණකින් ගැරහීමට ලක්විය යුතුය. කවර කරුණු දෙකකින් ප්‍රශංසාවට ලක්විය යුතුද? \"ධාර්මිකව, අසාහසින් භෝගයන් සොයයි\" යන මේ පළමු කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. \"තමන්ව සුවපත් කරයි, පෝෂණය කරයි\" යන මේ දෙවන කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. කවර එක් කරුණකින් ගැරහීමට ලක්විය යුතුද? \"අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි\" යන මේ එක් කරුණෙන් ගැරහීමට ලක්විය යුතුය. ගාමණි, මේ කාමභෝගියා මේ කරුණු දෙකෙන් ප්‍රශංසාවට ලක්විය යුතු අතර, මේ එක් කරුණෙන් ගැරහීමට ලක්විය යුතුය.\n\nගාමණි, යම් කාමභෝගියෙක් ධාර්මිකව, අසාහසින් භෝගයන් සොයන්නේද, ධාර්මිකව, අසාහසින් භෝගයන් සොයා තමන්ව සුවපත් කරන්නේද, පෝෂණය කරන්නේද, අනුන්ට බෙදා දෙයිද, පින්කම් කරයිද, නමුත් ඒ භෝගයන් කෙරෙහි ගිජු වී, මුසපත් වී, ඇලී ගැලී, එහි ආදීනවය නොදකින, එයින් මිදීමට ප්‍රඥාවක් නැතිව පරිභෝග කරයිද, ගාමණි, මේ කාමභෝගියා කරුණු තුනකින් ප්‍රශංසාවට ලක්විය යුතු අතර, එක් කරුණකින් ගැරහීමට ලක්විය යුතුය. කවර කරුණු තුනකින් ප්‍රශංසාවට ලක්විය යුතුද? \"ධාර්මිකව, අසාහසින් භෝගයන් සොයයි\" යන මේ පළමු කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. \"තමන්ව සුවපත් කරයි, පෝෂණය කරයි\" යන මේ දෙවන කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. \"අනුන්ට බෙදා දෙයි, පින්කම් කරයි\" යන මේ තුන්වන කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. කවර එක් කරුණකින් ගැරහීමට ලක්විය යුතුද? \"ඒ භෝගයන් කෙරෙහි ගිජු වී, මුසපත් වී, ඇලී ගැලී, එහි ආදීනවය නොදකින, එයින් මිදීමට ප්‍රඥාවක් නැතිව පරිභෝග කරයි\" යන මේ එක් කරුණෙන් ගැරහීමට ලක්විය යුතුය. ගාමණි, මේ කාමභෝගියා මේ කරුණු තුනෙන් ප්‍රශංසාවට ලක්විය යුතු අතර, මේ එක් කරුණෙන් ගැරහීමට ලක්විය යුතුය.\n\nගාමණි, යම් කාමභෝගියෙක් ධාර්මිකව, අසාහසින් භෝගයන් සොයන්නේද, ධාර්මිකව, අසාහසින් භෝගයන් සොයා තමන්ව සුවපත් කරන්නේද, පෝෂණය කරන්නේද, අනුන්ට බෙදා දෙයිද, පින්කම් කරයිද, ඒ භෝගයන් කෙරෙහි නොගිජු වී, මුසපත් නොවුණු, ඇලී ගැලී නොසිට, එහි ආදීනවය දකින, එයින් මිදීමට ප්‍රඥාවක් ඇතිව පරිභෝග කරයිද, ගාමණි, මේ කාමභෝගියා කරුණු සතරකින් ප්‍රශංසාවට ලක්විය යුතුය. කවර කරුණු සතරකින් ප්‍රශංසාවට ලක්විය යුතුද? \"ධාර්මිකව, අසාහසින් භෝගයන් සොයයි\" යන මේ පළමු කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. \"තමන්ව සුවපත් කරයි, පෝෂණය කරයි\" යන මේ දෙවන කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. \"අනුන්ට බෙදා දෙයි, පින්කම් කරයි\" යන මේ තුන්වන කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. \"ඒ භෝගයන් කෙරෙහි නොගිජු වී, මුසපත් නොවුණු, ඇලී ගැලී නොසිට, එහි ආදීනවය දකින, එයින් මිදීමට ප්‍රඥාවක් ඇතිව පරිභෝග කරයි\" යන මේ සිව්වන කරුණෙන් ප්‍රශංසාවට ලක්විය යුතුය. ගාමණි, මේ කාමභෝගියා මේ කරුණු සතරෙන් ප්‍රශංසාවට ලක්විය යුතුය.\n\nගාමණි, ලෝකයේ මේ තපස්වී වූ, ලූඛ ජීවී වූ තැනැත්තන් තිදෙනෙක් සිටිති. ඒ කවර තිදෙනෙක්ද? ගාමණි, මෙලොව ඇතැම් තපස්වී, ලූඛ ජීවී තැනැත්තෙක් ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්මී අනගාරිකව පැවිදි වී සිටී – \"කවර නම් කුසල ධර්මයක් අවබෝධ කරගන්නවා නම් හොඳයිද, කවර නම් උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වය සාක්ෂාත් කරගන්නවා නම් හොඳයිද\" කියා (බලාපොරොත්තුවෙන්). ඔහු තමන්ව තවනවා, පීඩා කරනවා, නමුත් කුසල ධර්මයක් අවබෝධ කරගන්නේ නැත, උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වයද සාක්ෂාත් කරගන්නේ නැත.\n\nගාමණි, මෙලොව තවත් ඇතැම් තපස්වී, ලූඛ ජීවී තැනැත්තෙක් ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්මී අනගාරිකව පැවිදි වී සිටී – \"කවර නම් කුසල ධර්මයක් අවබෝධ කරගන්නවා නම් හොඳයිද, කවර නම් උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වය සාක්ෂාත් කරගන්නවා නම් හොඳයිද\" කියා (බලාපොරොත්තුවෙන්). ඔහු තමන්ව තවනවා, පීඩා කරනවා, නමුත් කුසල ධර්මයක් අවබෝධ කරගනී, උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වය සාක්ෂාත් කරගන්නේ නැත.\n\nගාමණි, මෙලොව තවත් ඇතැම් තපස්වී, ලූඛ ජීවී තැනැත්තෙක් ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්මී අනගාරිකව පැවිදි වී සිටී – \"කවර නම් කුසල ධර්මයක් අවබෝධ කරගන්නවා නම් හොඳයිද, කවර නම් උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වය සාක්ෂාත් කරගන්නවා නම් හොඳයිද\" කියා (බලාපොරොත්තුවෙන්). ඔහු තමන්ව තවනවා, පීඩා කරනවා, කුසල ධර්මයක් අවබෝධ කරගනී, උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වයද සාක්ෂාත් කරගනී.\n\nගාමණි, යම් තපස්වී, ලූඛ ජීවී තැනැත්තෙක් තමන්ව තවනවා, පීඩා කරනවාද, කුසල ධර්මයක් අවබෝධ කරගන්නේ නැතිද, උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වයද සාක්ෂාත් කරගන්නේ නැතිද, ගාමණි, මේ තපස්වී, ලූඛ ජීවී තැනැත්තා කරුණු තුනකින් ගැරහීමට ලක්විය යුතුය. කවර කරුණු තුනකින් ගැරහීමට ලක්විය යුතුද? \"තමන්ව තවනවා, පීඩා කරනවා\" යන මේ පළමු කරුණෙන් ගැරහීමට ලක්විය යුතුය. \"කුසල ධර්මයක් අවබෝධ කරගන්නේ නැත\" යන මේ දෙවන කරුණෙන් ගැරහීමට ලක්විය යුතුය. \"උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වය සාක්ෂාත් කරගන්නේ නැත\" යන මේ තුන්වන කරුණෙන් ගැරහීමට ලක්විය යුතුය. ගාමණි, මේ තපස්වී, ලූඛ ජීවී තැනැත්තා මේ කරුණු තුනෙන් ගැරහීමට ලක්විය යුතුය.\n\nගාමණි, යම් තපස්වී, ලූඛ ජීවී තැනැත්තෙක් තමන්ව තවනවා, පීඩා කරනවාද, නමුත් කුසල ධර්මයක් අවබෝධ කරගනීද, උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ආර්ය ඥාන දර්ශන විශිෂ්ටත්වය සාක්ෂාත් කරගන්නේ නැතිද, ගාමණි, මේ තපස්වී, ලූඛ ජීවී තැනැත්තා කරුණු දෙකකින් ගැරහීමට ලක්විය යුතු අතර, එක් කරුණකින් ප්‍රශංසාවට ලක්විය යුතුය. කවර කරුණු දෙකකින් ගැරහීමට ලක්විය යුතුද?\n\nතමන්වම තවයි, පීඩාවට පත් කරයි. මේ පළමු කරුණ නිසා ඔහු නින්දාවට පත්වේ. උත්තරීතර මනුෂ්‍ය ධර්මයන්, ආර්ය ඥාන දර්ශනයේ විශිෂ්ටත්වය සාක්ෂාත් නොකරයි. මේ දෙවන කරුණ නිසා ඔහු නින්දාවට පත්වේ. කුමන එක් කරුණක් නිසා ඔහු ප්‍රශංසාවට පත්වේද? ඔහු කුසල ධර්මය අධිගමනය කරයි. මේ එක් කරුණක් නිසා ඔහු ප්‍රශංසාවට පත්වේ. ගාමණි, මේ තපස්වී වූ දුෂ්කර ජීවිතයක් ගත කරන පුද්ගලයා මේ කරුණු දෙක නිසා නින්දාවට පත්වේ, මේ එක් කරුණ නිසා ප්‍රශංසාවට පත්වේ.\n\nගාමණි, යම් තපස්වී වූ දුෂ්කර ජීවිතයක් ගත කරන පුද්ගලයෙක් තමන්වම තවමින්, පීඩාවට පත් කරමින්, කුසල ධර්මය අධිගමනය කරමින්, උත්තරීතර මනුෂ්‍ය ධර්මයන්, ආර්ය ඥාන දර්ශනයේ විශිෂ්ටත්වය සාක්ෂාත් කරයි නම්. ගාමණි, මේ තපස්වී වූ දුෂ්කර ජීවිතයක් ගත කරන පුද්ගලයා එක් කරුණක් නිසා නින්දාවට පත්වේ, කරුණු දෙකක් නිසා ප්‍රශංසාවට පත්වේ. කුමන එක් කරුණක් නිසා ඔහු නින්දාවට පත්වේද? තමන්වම තවයි, පීඩාවට පත් කරයි. මේ එක් කරුණ නිසා ඔහු නින්දාවට පත්වේ. කුමන කරුණු දෙකක් නිසා ඔහු ප්‍රශංසාවට පත්වේද? ඔහු කුසල ධර්මය අධිගමනය කරයි. මේ පළමු කරුණ නිසා ඔහු ප්‍රශංසාවට පත්වේ. උත්තරීතර මනුෂ්‍ය ධර්මයන්, ආර්ය ඥාන දර්ශනයේ විශිෂ්ටත්වය සාක්ෂාත් කරයි. මේ දෙවන කරුණ නිසා ඔහු ප්‍රශංසාවට පත්වේ. ගාමණි, මේ තපස්වී වූ දුෂ්කර ජීවිතයක් ගත කරන පුද්ගලයා මේ එක් කරුණ නිසා නින්දාවට පත්වේ, මේ කරුණු දෙක නිසා ප්‍රශංසාවට පත්වේ.\n\nගාමණි, මේ ක්ෂයවීම් තුනක් ඇත. මේවා තමන් විසින්ම දැකිය හැකි, කල් නොයවා විපාක දෙන, පැමිණ බැලිය හැකි, නිවනට පමුණුවන, ප්‍රඥාවන්තයින් විසින් තමන් තුළින්ම අත්දැකිය යුතු ධර්මයන්ය. ඒ කුමන තුනක්ද? යමෙක් රාගයෙන්, රාගය අරමුණු කරගෙන තමන්ගේ විනාශයටද සිතයි, අනුන්ගේ විනාශයටද සිතයි, දෙදෙනාගේම විනාශයටද සිතයි. රාගය ප්‍රහීණ වූ කල්හි තමන්ගේ විනාශයටද නොසිතයි, අනුන්ගේ විනාශයටද නොසිතයි, දෙදෙනාගේම විනාශයටද නොසිතයි. මේවා තමන් විසින්ම දැකිය හැකි, කල් නොයවා විපාක දෙන, පැමිණ බැලිය හැකි, නිවනට පමුණුවන, ප්‍රඥාවන්තයින් විසින් තමන් තුළින්ම අත්දැකිය යුතු ධර්මයන්ය. යමෙක් ද්වේෂයෙන්, ද්වේෂය අරමුණු කරගෙන තමන්ගේ විනාශයටද සිතයි, අනුන්ගේ විනාශයටද සිතයි, දෙදෙනාගේම විනාශයටද සිතයි. ද්වේෂය ප්‍රහීණ වූ කල්හි තමන්ගේ විනාශයටද නොසිතයි, අනුන්ගේ විනාශයටද නොසිතයි, දෙදෙනාගේම විනාශයටද නොසිතයි. මේවා තමන් විසින්ම දැකිය හැකි, කල් නොයවා විපාක දෙන, පැමිණ බැලිය හැකි, නිවනට පමුණුවන, ප්‍රඥාවන්තයින් විසින් තමන් තුළින්ම අත්දැකිය යුතු ධර්මයන්ය. යමෙක් මෝහයෙන්, මෝහය අරමුණු කරගෙන තමන්ගේ විනාශයටද සිතයි, අනුන්ගේ විනාශයටද සිතයි, දෙදෙනාගේම විනාශයටද සිතයි. මෝහය ප්‍රහීණ වූ කල්හි තමන්ගේ විනාශයටද නොසිතයි, අනුන්ගේ විනාශයටද නොසිතයි, දෙදෙනාගේම විනාශයටද නොසිතයි. මේවා තමන් විසින්ම දැකිය හැකි, කල් නොයවා විපාක දෙන, පැමිණ බැලිය හැකි, නිවනට පමුණුවන, ප්‍රඥාවන්තයින් විසින් තමන් තුළින්ම අත්දැකිය යුතු ධර්මයන්ය. ගාමණි, සැබැවින්ම මේ ක්ෂයවීම් තුන තමන් විසින්ම දැකිය හැකි, කල් නොයවා විපාක දෙන, පැමිණ බැලිය හැකි, නිවනට පමුණුවන, ප්‍රඥාවන්තයින් විසින් තමන් තුළින්ම අත්දැකිය යුතු ධර්මයන්ය. මෙසේ පැවසූ කල්හි රාසි ගාමණී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය. “භාග්‍යවතුන් වහන්ස, ඉතා යහපත්ය... අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා සිහි කරනු මැනව.” දොළොස්වැන්නයි.",
      "paliTitle": "Rāsiyasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Rāsiya",
      "sinhalaTitle": "රාසිය සූත්‍රය"
    },
    {
      "number": 365,
      "pali": "Ekaṃ samayaṃ bhagavā koliyesu viharati uttaraṃ nāma [uttarakaṃ nāma (sī.)] koliyānaṃ nigamo. Atha kho pāṭaliyo gāmaṇi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho pāṭaliyo gāmaṇi bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bhante – ‘samaṇo gotamo māyaṃ jānātī’ti. Ye te, bhante, evamāhaṃsu – ‘samaṇo gotamo māyaṃ jānātī’ti, kacci te, bhante, bhagavato vuttavādino, na ca bhagavantaṃ abhūtena abbhācikkhanti, dhammassa cānudhammaṃ byākaronti, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchati? Anabbhācikkhitukāmā hi mayaṃ, bhante, bhagavanta’’nti. ‘‘Ye te, gāmaṇi, evamāhaṃsu – ‘samaṇo gotamo māyaṃ jānātī’ti, vuttavādino ceva me, te na ca maṃ abhūtena abbhācikkhanti, dhammassa cānudhammaṃ byākaronti, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchatīti, saccaṃyeva kira, bho, mayaṃ tesaṃ samaṇabrāhmaṇānaṃ na saddahāma – ‘samaṇo gotamo māyaṃ jānātīti, samaṇo khalu bho gotamo māyāvī’ti. Yo nu kho, gāmaṇi, evaṃ vadeti – ‘ahaṃ māyaṃ jānāmī’ti, so evaṃ vadeti – ‘ahaṃ māyāvī’ti. Tatheva taṃ bhagavā hoti, tatheva taṃ sugata hotī’’ti. Tena hi, gāmaṇi, taññevettha paṭipucchissāmi; yathā te khameyya, tathā taṃ byākareyyāsi – ‘‘Taṃ kiṃ maññasi, gāmaṇi, jānāsi tvaṃ koliyānaṃ lambacūḷake bhaṭe’’ti? ‘‘Jānāmahaṃ, bhante, koliyānaṃ lambacūḷake bhaṭe’’ti. ‘‘Taṃ kiṃ maññasi, gāmaṇi, kimatthiyā koliyānaṃ lambacūḷakā bhaṭā’’ti? ‘‘Ye ca, bhante, koliyānaṃ corā te ca paṭisedhetuṃ, yāni ca koliyānaṃ dūteyyāni tāni ca vahātuṃ [tāni ca pahātuṃ (syā. kaṃ.), tāni ca yātuṃ (katthaci), tāni cāvahātuṃ (?)], etadatthiyā, bhante, koliyānaṃ lambacūḷakā bhaṭā’’ti. ‘‘Taṃ kiṃ maññasi, gāmaṇi, jānāsi tvaṃ koliyānaṃ lambacūḷake bhaṭe sīlavante vā te dussīle vā’’ti? ‘‘Jānāmahaṃ, bhante, koliyānaṃ lambacūḷake bhaṭe dussīle pāpadhamme; ye ca loke dussīlā pāpadhammā koliyānaṃ lambacūḷakā bhaṭā tesaṃ aññatarā’’ti. ‘‘Yo nu kho, gāmaṇi, evaṃ vadeyya – ‘pāṭaliyo gāmaṇi jānāti koliyānaṃ lambacūḷake bhaṭe dussīle pāpadhamme, pāṭaliyopi gāmaṇi dussīlo pāpadhammo’ti, sammā nu kho so vadamāno vadeyyā’’ti? ‘‘No hetaṃ, bhante! Aññe, bhante, koliyānaṃ lambacūḷakā bhaṭā, aññohamasmi. Aññathādhammā koliyānaṃ lambacūḷakā bhaṭā, aññathādhammohamasmī’’ti. ‘‘Tvañhi nāma, gāmaṇi, lacchasi – ‘pāṭaliyo gāmaṇi jānāti koliyānaṃ lambacūḷake bhaṭe dussīle pāpadhamme, na ca pāṭaliyo gāmaṇi dussīlo pāpadhammo’ti, kasmā tathāgato na lacchati – ‘tathāgato māyaṃ jānāti, na ca tathāgato māyāvī’ti? Māyaṃ cāhaṃ, gāmaṇi, pajānāmi, māyāya ca vipākaṃ, yathāpaṭipanno ca māyāvī kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi’’. ‘‘Pāṇātipātaṃ cāhaṃ, gāmaṇi, pajānāmi, pāṇātipātassa ca vipākaṃ, yathāpaṭipanno ca pāṇātipātī kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Adinnādānaṃ cāhaṃ, gāmaṇi, pajānāmi, adinnādānassa ca vipākaṃ, yathāpaṭipanno ca adinnādāyī kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Kāmesumicchācāraṃ cāhaṃ, gāmaṇi, pajānāmi, kāmesumicchācārassa ca vipākaṃ, yathāpaṭipanno ca kāmesumicchācārī kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Musāvādaṃ cāhaṃ, gāmaṇi, pajānāmi, musāvādassa ca vipākaṃ, yathāpaṭipanno ca musāvādī kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Pisuṇavācaṃ cāhaṃ, gāmaṇi, pajānāmi, pisuṇavācāya ca vipākaṃ, yathāpaṭipanno ca pisuṇavāco kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Pharusavācaṃ cāhaṃ, gāmaṇi, pajānāmi, pharusavācāya ca vipākaṃ, yathāpaṭipanno ca pharusavāco kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Samphappalāpaṃ cāhaṃ, gāmaṇi, pajānāmi, samphappalāpassa ca vipākaṃ, yathāpaṭipanno ca samphappalāpī kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Abhijjhaṃ cāhaṃ, gāmaṇi, pajānāmi, abhijjhāya ca vipākaṃ, yathāpaṭipanno ca abhijjhālu kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Byāpādapadosaṃ cāhaṃ, gāmaṇi, pajānāmi, byāpādapadosassa ca vipākaṃ, yathāpaṭipanno ca byāpannacitto kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. Micchādiṭṭhiṃ cāhaṃ, gāmaṇi, pajānāmi, micchādiṭṭhiyā ca vipākaṃ, yathāpaṭipanno ca micchādiṭṭhiko kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati tañca pajānāmi. ‘‘Santi hi, gāmaṇi, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yo koci pāṇamatipāteti, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayati. Yo koci adinnaṃ ādiyati, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayati. Yo koci kāmesu micchā carati, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayati. Yo koci musā bhaṇati, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayatī’’’ti. ‘‘Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī sunhāto [sunahāto (sī. syā. kaṃ. pī.)] suvilitto kappitakesamassu itthikāmehi rājā maññe paricārento. Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricāretī’ti? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso rañño paccatthikaṃ pasayha jīvitā voropesi. Tassa rājā attamano abhihāramadāsi. Tenāyaṃ puriso mālī kuṇḍalī sunhāto suvilitto kappitakesamassu, itthikāmehi rājā maññe paricāretī’’’ti. ‘‘Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathiyāya rathiyaṃ [rathikāya rathikaṃ (sī.)] siṅghāṭakena siṅghāṭakaṃ parinetvā, dakkhiṇena dvārena nikkhāmetvā, dakkhiṇato nagarassa sīsaṃ chijjamāno. Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi, daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathiyāya rathiyaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindatī’ti [chijjatīti (katthaci)]? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso rājaverī itthiṃ vā purisaṃ vā jīvitā voropesi, tena naṃ rājāno gahetvā evarūpaṃ kammakāraṇaṃ kārentī’’’ti. ‘‘Taṃ kiṃ maññasi, gāmaṇi, api nu te evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. ‘‘Tatra, gāmaṇi, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yo koci pāṇamatipāteti, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayatī’ti, saccaṃ vā te āhaṃsu musā vā’’ti? ‘‘Musā, bhante’’. ‘‘Ye pana te tucchaṃ musā vilapanti, sīlavanto vā te dussīlā vā’’ti? ‘‘Dussīlā, bhante’’. ‘‘Ye pana te dussīlā pāpadhammā micchāpaṭipannā vā te sammāpaṭipannā vā’’ti? ‘‘Micchāpaṭipannā, bhante’’. ‘‘Ye pana te micchāpaṭipannā micchādiṭṭhikā vā te sammādiṭṭhikā vā’’ti? ‘‘Micchādiṭṭhikā, bhante’’. ‘‘Ye pana te micchādiṭṭhikā kallaṃ nu tesu pasīditu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī…pe… itthikāmehi rājā maññe paricārento. Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi mālī kuṇḍalī…pe… itthikāmehi rājā maññe paricāretī’ti? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso rañño paccatthikassa pasayha ratanaṃ ahāsi [pasayha adinnaṃ ratanaṃ ādiyi (ka.)]. Tassa rājā attamano abhihāramadāsi. Tenāyaṃ puriso mālī kuṇḍalī…pe… itthikāmehi rājā maññe paricāretī’’’ti. ‘‘Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā…pe… dakkhiṇato nagarassa sīsaṃ chijjamāno tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi daḷhāya rajjuyā…pe… dakkhiṇato nagarassa sīsaṃ chindatī’ti? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso gāmā vā araññā vā adinnaṃ theyyasaṅkhātaṃ ādiyi. Tena naṃ rājāno gahetvā evarūpaṃ kammakāraṇaṃ kārentī’ti. Taṃ kiṃ maññasi, gāmaṇi, api nu te evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. ‘‘Tatra, gāmaṇi, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yo koci adinnaṃ ādiyati, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayatī’ti, saccaṃ vā te āhaṃsu musā vāti… pe… kallaṃ nu tesu pasīditu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī…pe… itthikāmehi rājā maññe paricārento. Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi mālī kuṇḍalī…pe… itthikāmehi rājā maññe paricāretī’ti? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso rañño paccatthikassa dāresu cārittaṃ āpajji. Tassa rājā attamano abhihāramadāsi. Tenāyaṃ puriso mālī kuṇḍalī…pe… itthikāmehi rājā maññe paricāretī’’’ti. ‘‘Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā…pe… dakkhiṇato nagarassa sīsaṃ chijjamāno. Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi daḷhāya rajjuyā…pe… dakkhiṇato nagarassa sīsaṃ chindatī’ti? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kulitthīsu kulakumārīsu cārittaṃ āpajji, tena naṃ rājāno gahetvā evarūpaṃ kammakāraṇaṃ kārentī’ti. Taṃ kiṃ maññasi, gāmaṇi, api nu te evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. ‘‘Tatra, gāmaṇi, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yo koci kāmesu micchā carati, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayatī’ti, saccaṃ vā te āhaṃsu musā vāti…pe… kallaṃ nu tesu pasīditu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Dissati kho pana, gāmaṇi, idhekacco mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricārento. Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricāretī’ti? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso rājānaṃ musāvādena hāsesi. Tassa rājā attamano abhihāramadāsi. Tenāyaṃ puriso mālī kuṇḍalī sunhāto suvilitto kappitakesamassu itthikāmehi rājā maññe paricāretī’’’ti. ‘‘Dissati kho, gāmaṇi, idhekacco daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathiyāya rathiyaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chijjamāno. Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso kiṃ akāsi daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathiyāya rathiyaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā, dakkhiṇena dvārena nikkhāmetvā, dakkhiṇato nagarassa sīsaṃ chindatī’ti? Tamenaṃ evamāhaṃsu – ‘ambho! Ayaṃ puriso gahapatissa vā gahapatiputtassa vā musāvādena atthaṃ bhañji, tena naṃ rājāno gahetvā evarūpaṃ kammakāraṇaṃ kārentī’ti. Taṃ kiṃ maññasi, gāmaṇi, api nu te evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. ‘‘Tatra, gāmaṇi, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yo koci musā bhaṇati, sabbo so diṭṭheva dhamme dukkhaṃ domanassaṃ paṭisaṃvedayatī’ti, saccaṃ vā te āhaṃsu musā vā’’ti? ‘‘Musā, bhante’’. ‘‘Ye pana te tucchaṃ musā vilapanti sīlavanto vā te dussīlā vā’’ti? ‘‘Dussīlā, bhante’’. ‘‘Ye pana te dussīlā pāpadhammā micchāpaṭipannā vā te sammāpaṭipannā vā’’ti? ‘‘Micchāpaṭipannā, bhante’’. ‘‘Ye pana te micchāpaṭipannā micchādiṭṭhikā vā te sammādiṭṭhikā vā’’ti? ‘‘Micchādiṭṭhikā, bhante’’. ‘‘Ye pana te micchādiṭṭhikā kallaṃ nu tesu pasīditu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Atthi me, bhante, āvasathāgāraṃ. Tattha atthi mañcakāni, atthi āsanāni, atthi udakamaṇiko, atthi telappadīpo. Tattha yo samaṇo vā brāhmaṇo vā vāsaṃ upeti, tenāhaṃ yathāsatti yathābalaṃ saṃvibhajāmi. Bhūtapubbaṃ, bhante, cattāro satthāro nānādiṭṭhikā nānākhantikā nānārucikā, tasmiṃ āvasathāgāre vāsaṃ upagacchuṃ’’. ‘‘Eko satthā evaṃvādī evaṃdiṭṭhi – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko. Natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’’’ti. ‘‘Eko satthā evaṃvādī evaṃdiṭṭhi – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā, ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’’’ti. ‘‘Eko satthā evaṃvādī evaṃdiṭṭhi – ‘karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṃ ādiyato, sandhiṃ chindato, nillopaṃ harato, ekāgārikaṃ karoto, paripanthe tiṭṭhato, paradāraṃ gacchato, musā bhaṇato, karoto na karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṃ maṃsakhalaṃ ekaṃ maṃsapuñjaṃ kareyya, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Dakkhiṇaṃ cepi gaṅgāya tīraṃ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Uttaraṃ cepi gaṅgāya tīraṃ gaccheyya dadanto dāpento yajanto yajāpento, natthi tatonidānaṃ puññaṃ, natthi puññassa āgamo. Dānena damena saṃyamena saccavajjena natthi puññaṃ, natthi puññassa āgamo’’’ti. ‘‘Eko satthā evaṃvādī evaṃdiṭṭhi – ‘karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṃ ādiyato, sandhiṃ chindato, nillopaṃ harato, ekāgārikaṃ karoto, paripanthe tiṭṭhato, paradāraṃ gacchato, musā bhaṇato, karoto karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṃ maṃsakhalaṃ ekaṃ maṃsapuñjaṃ kareyya, atthi tatonidānaṃ pāpaṃ, atthi pāpassa āgamo. Dakkhiṇaṃ cepi gaṅgāya tīraṃ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, atthi tatonidānaṃ pāpaṃ, atthi pāpassa āgamo. Uttaraṃ cepi gaṅgāya tīraṃ gaccheyya dadanto dāpento, yajanto yajāpento, atthi tatonidānaṃ puññaṃ, atthi puññassa āgamo. Dānena damena saṃyamena saccavajjena atthi puññaṃ, atthi puññassa āgamo’’’ti. ‘‘Tassa mayhaṃ, bhante, ahudeva kaṅkhā, ahu vicikicchā – ‘kosu nāma imesaṃ bhavataṃ samaṇabrāhmaṇānaṃ saccaṃ āha, ko musā’’’ti? ‘‘Alañhi te, gāmaṇi, kaṅkhituṃ, alaṃ vicikicchituṃ. Kaṅkhanīye ca pana te ṭhāne vicikicchā uppannā’’ti. ‘‘Evaṃ pasannohaṃ, bhante, bhagavati. Pahoti me bhagavā tathā dhammaṃ desetuṃ yathāhaṃ imaṃ kaṅkhādhammaṃ pajaheyya’’nti. ‘‘Atthi, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi. Evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. Katamo ca, gāmaṇi, dhammasamādhi? Idha, gāmaṇi, ariyasāvako pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti, adinnādānaṃ pahāya adinnādānā paṭivirato hoti, kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti, musāvādaṃ pahāya musāvādā paṭivirato hoti, pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti, pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti, samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti, abhijjhaṃ pahāya anabhijjhālu hoti, byāpādapadosaṃ pahāya abyāpannacitto hoti, micchādiṭṭhiṃ pahāya sammādiṭṭhiko hoti. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā, sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. ‘Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ [yohaṃ (sī. syā. kaṃ. pī.)] na kiñci [kañci (?)] byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha [ubhayattha me (?) ma. ni. 2.95 pāḷiyā saṃsandetabbaṃ] kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti [paraṃ maraṇā na upapajjissāmīti (?)]. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā, sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. ‘Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ na kiñci byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṃ ādiyato, sandhiṃ chindato, nillopaṃ harato, ekāgārikaṃ karoto, paripanthe tiṭṭhato, paradāraṃ gacchato, musā bhaṇato, karoto na karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṃ maṃsakhalaṃ ekaṃ maṃsapuñjaṃ kareyya, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṃ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Uttarañcepi gaṅgāya tīraṃ gaccheyya dadanto dāpento, yajanto yajāpento, natthi tatonidānaṃ puññaṃ, natthi puññassa āgamo. Dānena damena saṃyamena saccavajjena natthi puññaṃ, natthi puññassa āgamo’ti. ‘Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ na kiñci byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti [paraṃ maraṇā na upapajjissāmīti (?)]. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagate cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṃ ādiyato, sandhiṃ chindato, nillopaṃ harato, ekāgārikaṃ karoto, paripanthe tiṭṭhato, paradāraṃ gacchato, musā bhaṇato, karoto karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṃ maṃsakhalaṃ ekaṃ maṃsapuñjaṃ kareyya, atthi tatonidānaṃ pāpaṃ, atthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṃ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, atthi tatonidānaṃ pāpaṃ, atthi pāpassa āgamo. Uttarañcepi gaṅgāya tīraṃ gaccheyya dadanto dāpento, yajanto yajāpento, atthi tatonidānaṃ puññaṃ, atthi puññassa āgamo. Dānena damena saṃyamena saccavajjena atthi puññaṃ atthi puññassa āgamoti. Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ na kiñci byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato karuṇāsahagate cetasā ekaṃ disaṃ pharitvā viharati…pe… muditāsahagatena cetasā ekaṃ disaṃ pharitvā viharati…pe…. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagate cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko natthi paro loko, natthi mātā natthi pitā natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentīti. Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ na kiñci byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagate cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko atthi paro loko, atthi mātā atthi pitā atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentīti. Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ na kiñci byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagate cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – karoto kārayato, chedato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṃ ādiyato, sandhiṃ chindato, nillopaṃ harato, ekāgārikaṃ karoto, paripanthe tiṭṭhato, paradāraṃ gacchato, musā bhaṇato, karoto na karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṃ maṃsakhalaṃ ekaṃ maṃsapuñjaṃ kareyya, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṃ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Uttarañcepi gaṅgāya tīraṃ gaccheyya dadanto dāpento, yajanto yajāpento, natthi tatonidānaṃ puññaṃ, natthi puññassa āgamo. Dānena damena saṃyamena saccavajjena natthi puññaṃ, natthi puññassa āgamo’ti. ‘Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ na kiñci byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsi. ‘‘Sa kho so, gāmaṇi, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato upekkhāsahagate cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So iti paṭisañcikkhati – ‘yvāyaṃ satthā evaṃvādī evaṃdiṭṭhi – karoto kārayato, chindato chedāpayato, pacato pācāpayato, socayato socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātayato, adinnaṃ ādiyato, sandhiṃ chindato, nillopaṃ harato, ekāgārikaṃ karoto, paripanthe tiṭṭhato, paradāraṃ gacchato, musā bhaṇato, karoto karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṃ maṃsakhalaṃ ekaṃ maṃsapuñjaṃ kareyya, atthi tatonidānaṃ pāpaṃ, atthi pāpassa āgamo. Dakkhiṇañcepi gaṅgāya tīraṃ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, atthi tatonidānaṃ pāpaṃ, atthi pāpassa āgamo. Uttarañcepi gaṅgāya tīraṃ gaccheyya dadanto dāpento, yajanto yajāpento, atthi tatonidānaṃ puññaṃ, atthi puññassa āgamo. Dānena damena saṃyamena saccavajjena atthi puññaṃ, atthi puññassa āgamo’ti. ‘Sace tassa bhoto satthuno saccaṃ vacanaṃ, apaṇṇakatāya mayhaṃ, yvāhaṃ na kiñci byābādhemi tasaṃ vā thāvaraṃ vā? Ubhayamettha kaṭaggāho, yaṃ camhi kāyena saṃvuto vācāya saṃvuto manasā saṃvuto, yañca kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmī’ti. Tassa pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedayati. Sukhino cittaṃ samādhiyati. Ayaṃ kho, gāmaṇi, dhammasamādhi. Tatra ce tvaṃ cittasamādhiṃ paṭilabheyyāsi, evaṃ tvaṃ imaṃ kaṅkhādhammaṃ pajaheyyāsī’’ti. Evaṃ vutte, pāṭaliyo gāmaṇi bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante, abhikkantaṃ, bhante…pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Terasamaṃ. ",
      "english": "At one time, the Blessed One was dwelling among the Koliyans, in a Koliyan town named Uttara. Then Pāṭaliya, the village headman, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, Pāṭaliya the village headman said to the Blessed One: \"Venerable sir, I have heard it said: 'The recluse Gotama understands illusion.' Venerable sir, those who say, 'The recluse Gotama understands illusion,' are they correctly stating what the Blessed One has said, and are they not misrepresenting the Blessed One with what is untrue? Do they declare the Dhamma in accordance with the Dhamma, and does no co-dhamma follower's argument or counter-argument lead to a blameworthy conclusion? For, Venerable sir, we do not wish to misrepresent the Blessed One.\"\n\n\"Village headman, those who say, 'The recluse Gotama understands illusion,' are indeed correctly stating what I have said, and they do not misrepresent me with what is untrue. They declare the Dhamma in accordance with the Dhamma, and no co-dhamma follower's argument or counter-argument leads to a blameworthy conclusion. Truly, sir, I do not agree with those recluses and brahmins who assert: 'The recluse Gotama understands illusion, and therefore the recluse Gotama is an illusionist.' Indeed, village headman, when someone says, 'I understand illusion,' they are by that very statement saying, 'I am an illusionist.' And that is how they regard the Blessed One; that is how they regard the Fortunate One.\"\n\n\"Well then, village headman, I shall ask you a question in return. Please answer as you see fit: What do you think, village headman, do you know the Koliyan soldiers with plaited hair?\"\n\n\"Yes, Venerable sir, I know the Koliyan soldiers with plaited hair.\"\n\n\"What do you think, village headman, for what purpose do the Koliyan soldiers with plaited hair exist?\"\n\n\"Venerable sir, they are for restraining the thieves among the Koliyans, and for carrying out the messages and duties of the Koliyans. For this purpose, Venerable sir, do the Koliyan soldiers with plaited hair exist.\"\n\n\"What do you think, village headman, do you know whether those Koliyan soldiers with plaited hair are virtuous or unvirtuous?\"\n\n\"Yes, Venerable sir, I know the Koliyan soldiers with plaited hair to be unvirtuous and of evil ways. Among those in the world who are unvirtuous and of evil ways, these Koliyan soldiers with plaited hair are some of them.\"\n\n\"Now, village headman, if someone were to say, 'Pāṭaliya the village headman knows the Koliyan soldiers with plaited hair to be unvirtuous and of evil ways, therefore Pāṭaliya the village headman is also unvirtuous and of evil ways,' would that person be speaking correctly?\"\n\n\"No, Venerable sir! The Koliyan soldiers with plaited hair are one thing, and I am another. The Koliyan soldiers with plaited hair have one kind of nature, and I have another kind of nature.\"\n\n\"So then, village headman, you may rightly claim: 'Pāṭaliya the village headman knows the Koliyan soldiers with plaited hair to be unvirtuous and of evil ways, but Pāṭaliya the village headman is not unvirtuous and of evil ways.' Why then may the Tathāgata not rightly claim: 'The Tathāgata understands illusion, but the Tathāgata is not an illusionist?'\"\n\n\"Indeed, village headman, I understand illusion, and I understand the outcome of illusion. I also understand how an illusionist, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell.\"\n\n\"Indeed, village headman, I understand the taking of life, and I understand the outcome of the taking of life. I also understand how a life-taker, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell. Indeed, village headman, I understand the taking of what is not given, and I understand the outcome of the taking of what is not given. I also understand how one who takes what is not given, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell. Indeed, village headman, I understand sexual misconduct, and I understand the outcome of sexual misconduct. I also understand how one who commits sexual misconduct, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell. Indeed, village headman, I understand false speech, and I understand the outcome of false speech. I also understand how one who speaks falsely, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell. Indeed, village headman, I understand divisive speech, and I understand the outcome of divisive speech. I also understand how one who speaks divisively, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell. Indeed, village headman, I understand harsh speech, and I understand the outcome of harsh speech. I also understand how one who speaks harshly, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell. Indeed, village headman, I understand idle chatter, and I understand the outcome of idle chatter. I also understand how one who engages in idle chatter, after the dissolution of the body and after death, reappears in a state of deprivation, in a bad destination, in a lower realm, in hell.\"\n\nChief, I understand covetousness, and I understand the karmic result of covetousness, and I understand how a person practicing covetousness, upon the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a downward fall, in hell. Chief, I understand ill-will, and I understand the karmic result of ill-will, and I understand how a person whose mind is pervaded by ill-will, upon the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a downward fall, in hell. Chief, I understand wrong view, and I understand the karmic result of wrong view, and I understand how a person holding wrong views, upon the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a downward fall, in hell.\n\nIndeed, Chief, there are some ascetics and brahmins who speak and hold such a view: ‘Whoever destroys life, they all experience suffering and mental pain in this very life. Whoever takes what is not given, they all experience suffering and mental pain in this very life. Whoever engages in sexual misconduct, they all experience suffering and mental pain in this very life. Whoever speaks falsely, they all experience suffering and mental pain in this very life.’\n\nBut, Chief, here someone is seen garlanded, wearing earrings, well-bathed, perfumed, with hair and beard trimmed, enjoying sensual pleasures as if a king. People then say to him, ‘Sir! What did this man do, that he is garlanded, wearing earrings, well-bathed, perfumed, with hair and beard trimmed, enjoying sensual pleasures as if a king?’ People then say to them, ‘Sir! This man forcibly deprived an enemy of the king of life. The king, being pleased, gave him a reward. That is why this man is garlanded, wearing earrings, well-bathed, perfumed, with hair and beard trimmed, enjoying sensual pleasures as if a king.’\n\nMoreover, Chief, here someone is seen, having been tightly bound behind the back with a strong rope, shaved bald, paraded from street to street, from crossroads to crossroads, with a harsh-sounding drum, then led out through the southern gate, and beheaded south of the city. People then say to him, ‘Sir! What did this man do, that he is tightly bound behind the back with a strong rope, shaved bald, paraded from street to street, from crossroads to crossroads, with a harsh-sounding drum, then led out through the southern gate, and beheaded south of the city?’ People then say to them, ‘Sir! This man was an enemy of the king; he deprived a woman or a man of life. Therefore, the king’s men apprehended him and are subjecting him to such a punishment.’\n\nWhat do you think, Chief, have you ever seen or heard such a thing?\" \"Yes, Venerable Sir, we have seen it, and we have heard it, and we will continue to hear it.\" \"In that case, Chief, those ascetics and brahmins who speak and hold such a view, ‘Whoever destroys life, they all experience suffering and mental pain in this very life’—did they speak truthfully or falsely?\" \"Falsely, Venerable Sir.\" \"And those who utter such empty falsehoods, are they virtuous or immoral?\" \"Immoral, Venerable Sir.\" \"And those immoral people, those with evil doctrines, are they practicing wrongly or rightly?\" \"Wrongly practicing, Venerable Sir.\" \"And those who are practicing wrongly, do they hold wrong views or right views?\" \"Wrong views, Venerable Sir.\" \"And regarding those who hold wrong views, is it proper to have confidence in them?\" \"No, Venerable Sir.\"\n\nFurthermore, Chief, here someone is seen garlanded, wearing earrings, well-bathed, perfumed, with hair and beard trimmed, enjoying sensual pleasures as if a king. People then say to him, ‘Sir! What did this man do, that he is garlanded, wearing earrings, well-bathed, perfumed, with hair and beard trimmed, enjoying sensual pleasures as if a king?’ People then say to them, ‘Sir! This man forcibly took a treasure from an enemy of the king, what was not given. The king, being pleased, gave him a reward. That is why this man is garlanded, wearing earrings, well-bathed, perfumed, with hair and beard trimmed, enjoying sensual pleasures as if a king.’\nMoreover, Chief, here someone is seen, having been tightly bound behind the back with a strong rope, shaved bald, paraded from street to street, from crossroads to crossroads, with a harsh-sounding drum, then led out through the southern gate, and beheaded south of the city. People then say to him, ‘Sir! What did this man do, that he is tightly bound behind the back with a strong rope, shaved bald, paraded from street to street, from crossroads to crossroads, with a harsh-sounding drum, then led out through the southern gate, and beheaded south of the city?’ People then say to them, ‘Sir! This man took what was not given, amounting to theft, from a village or a forest. Therefore, the king’s men apprehended him and are subjecting him to such a punishment.’ What do you think, Chief, have you ever seen or heard such a thing?\" \"Yes, Venerable Sir, we have seen it, and we have heard it, and we will continue to hear it.\"\n\nNow, headman, as to those ascetics and brahmins who hold such views and speak thus: ‘Whoever takes what is not given, everyone of them experiences suffering and distress in this very life.’ Did they speak truthfully or falsely? Is it proper to have confidence in them?\"\n\"No, venerable sir.\"\n\"But, headman, one person is seen here wearing garlands, earrings, adorned, enjoying himself with women as if served by a king. People ask about him, ‘Sir, what did this man do to be wearing garlands, earrings, adorned, enjoying himself with women as if served by a king?’ Others say about him, ‘Sir, this man had an affair with the wives of the king's enemies. The king, pleased, gave him gifts. That is why this man is wearing garlands, earrings, adorned, enjoying himself with women as if served by a king.’\"\n\"Furthermore, headman, one person is seen here bound tightly with a strong rope, and having his head cut off south of the city. People ask about him, ‘Sir, what did this man do to be bound tightly with a strong rope and having his head cut off south of the city?’ Others say about him, ‘Sir, this man had affairs with respectable women and young ladies from good families. Therefore, the kings arrested him and subjected him to such a punishment.’ What do you think, headman, have you seen or heard of such a thing?\"\n\"Yes, venerable sir, we have seen it and we have heard it, and it will be heard of again.\"\n\n\"Now, headman, as to those ascetics and brahmins who hold such views and speak thus: ‘Whoever engages in sexual misconduct, everyone of them experiences suffering and distress in this very life.’ Did they speak truthfully or falsely?\"\n\"No, venerable sir.\"\n\"But, headman, one person is seen here wearing garlands, earrings, bathed, anointed, with hair and beard trimmed, enjoying himself with women as if served by a king. People ask about him, ‘Sir, what did this man do to be wearing garlands, earrings, bathed, anointed, with hair and beard trimmed, enjoying himself with women as if served by a king?’ Others say about him, ‘Sir, this man made the king laugh with false speech. The king, pleased, gave him gifts. That is why this man is wearing garlands, earrings, bathed, anointed, with hair and beard trimmed, enjoying himself with women as if served by a king.’\"\n\"Furthermore, headman, one person is seen here bound tightly with a strong rope, his arms tied behind his back, his head shaved, paraded from street to street and square to square with a harsh-sounding drum, led out through the southern gate, and having his head cut off south of the city. People ask about him, ‘Sir, what did this man do to be bound tightly with a strong rope, his arms tied behind his back, his head shaved, paraded from street to street and square to square with a harsh-sounding drum, led out through the southern gate, and having his head cut off south of the city?’ Others say about him, ‘Sir, this man ruined the affairs of a householder or a householder's son with false speech. Therefore, the kings arrested him and subjected him to such a punishment.’ What do you think, headman, have you seen or heard of such a thing?\"\n\"Yes, venerable sir, we have seen it and we have heard it, and it will be heard of again.\"\n\n\"Now, headman, as to those ascetics and brahmins who hold such views and speak thus: ‘Whoever speaks falsely, everyone of them experiences suffering and distress in this very life.’ Did they speak truthfully or falsely?\"\n\"Falsely, venerable sir.\"\n\"Are those who speak empty falsehoods virtuous or unvirtuous?\"\n\"Unvirtuous, venerable sir.\"\n\"Are those unvirtuous ones, of evil conduct, engaged in wrong practice or right practice?\"\n\"Wrong practice, venerable sir.\"\n\"Are those engaged in wrong practice holding wrong view or right view?\"\n\"Wrong view, venerable sir.\"\n\"Is it proper to have confidence in those who hold wrong view?\"\n\"No, venerable sir.\"\n\n\"It is wonderful, venerable sir! It is amazing, venerable sir! I have a guesthouse, venerable sir. In it are couches, seats, a water-pot, and an oil lamp. Any ascetic or brahmin who stays there, I provide for them according to my ability and strength. Formerly, venerable sir, four teachers of different views, different preferences, and different inclinations came to stay in that guesthouse.\"\n\"One teacher held such a view and spoke thus: ‘There is no gift, no offering, no sacrifice. There is no fruit or result of good and bad deeds. There is no this world, no other world, no mother, no father. There are no spontaneously arisen beings. There are no ascetics or brahmins in the world who are rightly gone, rightly practicing, who, having themselves realized and directly known this world and the other world, proclaim it.’\"\n\n\"One teacher holds such a view and speaks thus: 'There is what is given, there is what is offered, there is what is sacrificed. There is fruit and result of good and bad deeds. There is this world and there is a next world. There is mother and there is father. There are spontaneously arisen beings. There are recluses and brahmins in the world who are well-gone and practice rightly, and who, having themselves realized and experienced this world and the next, proclaim them.'\"\n\n\"There is another teacher who holds such a view and speaks thus: 'One who acts, causes others to act, cuts, causes others to cut, cooks, causes others to cook, grieves, causes others to grieve, wearies, causes others to weary, trembles, causes others to tremble, takes life, takes what is not given, breaks into houses, plunders, commits single-house robbery, ambushes on the road, commits adultery, speaks falsehood – in doing these, no evil is done. Even if one were to make all beings on this earth into a single heap of flesh, a single pile of flesh with a disc whose rim is as sharp as a razor, there is no evil from that, and no evil accumulates. Even if one were to go to the southern bank of the Ganges, killing, causing to kill, cutting, causing to cut, cooking, causing to cook, there is no evil from that, and no evil accumulates. Even if one were to go to the northern bank of the Ganges, giving, causing to give, sacrificing, causing to sacrifice, there is no merit from that, and no merit accumulates. Through giving, through self-control, through restraint, through truthful speech, there is no merit, and no merit accumulates.'\"\n\n\"There is yet another teacher who holds such a view and speaks thus: 'One who acts, causes others to act, cuts, causes others to cut, cooks, causes others to cook, grieves, causes others to grieve, wearies, causes others to weary, trembles, causes others to tremble, takes life, takes what is not given, breaks into houses, plunders, commits single-house robbery, ambushes on the road, commits adultery, speaks falsehood – in doing these, evil is done. Even if one were to make all beings on this earth into a single heap of flesh, a single pile of flesh with a disc whose rim is as sharp as a razor, there is evil from that, and evil accumulates. Even if one were to go to the southern bank of the Ganges, killing, causing to kill, cutting, causing to cut, cooking, causing to cook, there is evil from that, and evil accumulates. Even if one were to go to the northern bank of the Ganges, giving, causing to give, sacrificing, causing to sacrifice, there is merit from that, and merit accumulates. Through giving, through self-control, through restraint, through truthful speech, there is merit, and merit accumulates.'\"\n\n\"Regarding this, venerable sir, doubt and perplexity indeed arose in me: 'Which of these venerable recluses and brahmins speaks the truth, and which speaks falsely?'\"\n\"It is fitting for you, village headman, to doubt; it is fitting for you to be perplexed. Indeed, perplexity has arisen in you regarding a matter that deserves perplexity.\"\n\n\"So greatly am I confident, venerable sir, in the Blessed One. The Blessed One is capable of teaching me the Dhamma in such a way that I may abandon this state of doubt.\"\n\"There is, village headman, a concentration based on Dhamma. If you could gain mental concentration therein, then you would abandon this state of doubt. And what, village headman, is this concentration based on Dhamma? Here, village headman, a noble disciple, having abandoned the taking of life, abstains from taking life. Having abandoned taking what is not given, abstains from taking what is not given. Having abandoned sexual misconduct, abstains from sexual misconduct. Having abandoned false speech, abstains from false speech. Having abandoned divisive speech, abstains from divisive speech. Having abandoned harsh speech, abstains from harsh speech. Having abandoned idle chatter, abstains from idle chatter. Having abandoned covetousness, is not covetous. Having abandoned ill-will and malice, has a mind free from ill-will. Having abandoned wrong view, holds right view.\"\n\n\"That noble disciple, village headman, thus freed from covetousness, freed from ill-will, undeluded, clearly comprehending, and mindful, dwells pervading one direction with a mind imbued with loving-kindness. Likewise, he pervades the second, the third, and the fourth direction. Thus, upwards, downwards, across, everywhere, in every way, he dwells pervading the entire world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility and without ill-will. He then reflects thus: 'If that teacher, who holds such a view and speaks thus: \"There is nothing given, nothing offered, nothing sacrificed. There is no fruit or result of good and bad deeds. There is no this world, no next world. There is no mother, no father. There are no spontaneously arisen beings. There are no recluses and brahmins in the world who are well-gone and practice rightly, and who, having themselves realized and experienced this world and the next, proclaim them\"— if the words of that venerable teacher are true, then through my indisputable practice, whereby I harm no being, trembling or firm, in both cases, my deed is good, in both cases, my action is skillful.'\"\n\nThis is a sure foundation: that I am restrained in body, restrained in speech, restrained in mind, and that with the breaking up of the body, after death, I shall reappear in a good destination, a heavenly world. Joy arises in him. For one who is joyful, rapture arises. For one whose mind is rapturous, the body becomes tranquil. For one whose body is tranquil, he experiences happiness. For one who is happy, the mind becomes concentrated. This, indeed, O chieftain, is concentration based on wholesome states. If you could attain such concentration of mind, you would thus abandon this wavering state of doubt.\n\nThat noble disciple, O chieftain, being thus free from covetousness, free from ill-will, undeluded, clearly comprehending, and mindful, abides pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all circumstances, he abides pervading the entire world with a mind imbued with loving-kindness—vast, exalted, immeasurable, without hostility, without ill-will. He reflects thus: ‘This Teacher has such a doctrine and such a view: There is what is given, there is what is offered in sacrifice, there is what is presented as an oblation. There is fruit and ripening of well-done and ill-done actions. There is this world, there is the next world. There is mother, there is father. There are spontaneously arisen beings. There are in the world ascetics and brahmins who are rightly gone, who are rightly practicing, who, having themselves realized and experienced this world and the next world through direct knowledge, proclaim them.’\n\n‘If the word of that venerable Teacher is true, then it is for my certain good, since I harm nothing, neither moving nor still. In this matter, there is a sure foundation on both counts: that I am restrained in body, restrained in speech, restrained in mind, and that with the breaking up of the body, after death, I shall reappear in a good destination, a heavenly world.’ Joy arises in him. For one who is joyful, rapture arises. For one whose mind is rapturous, the body becomes tranquil. For one whose body is tranquil, he experiences happiness. For one who is happy, the mind becomes concentrated. This, indeed, O chieftain, is concentration based on wholesome states. If you could attain such concentration of mind, you would thus abandon this wavering state of doubt.\n\nThat noble disciple, O chieftain, being thus free from covetousness, free from ill-will, undeluded, clearly comprehending, and mindful, abides pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all circumstances, he abides pervading the entire world with a mind imbued with loving-kindness—vast, exalted, immeasurable, without hostility, without ill-will. He reflects thus: ‘This Teacher has such a doctrine and such a view: To him who acts, or causes to act; who mutilates, or causes to mutilate; who tortures, or causes to torture; who causes sorrow, or causes others to sorrow; who causes fatigue, or causes others to be fatigued; who causes trembling, or causes others to tremble; who takes life; who takes what is not given; who breaks into houses; who plunders property; who commits burglary; who lies in wait; who commits adultery; who speaks falsehoods – to him, by doing these things, no evil is done. Even if one were to make the living beings on this earth into a single heap of flesh, a single mass of flesh, with a razor-sharp discus, there would be no evil from that cause, no increase of evil. Even if one were to go to the south bank of the Ganges, killing and causing to kill, mutilating and causing to mutilate, torturing and causing to torture, there would be no evil from that cause, no increase of evil. Even if one were to go to the north bank of the Ganges, giving and causing to give, sacrificing and causing to sacrifice, there would be no merit from that cause, no increase of merit. By giving, by self-control, by restraint, by speaking truth, there is no merit, no increase of merit.’\n\n‘If the word of that venerable Teacher is true, then it is for my certain good, since I harm nothing, neither moving nor still. In this matter, there is a sure foundation on both counts: that I am restrained in body, restrained in speech, restrained in mind, and that with the breaking up of the body, after death, I shall reappear in a good destination, a heavenly world.’ Joy arises in him. For one who is joyful, rapture arises. For one whose mind is rapturous, the body becomes tranquil. For one whose body is tranquil, he experiences happiness. For one who is happy, the mind becomes concentrated. This, indeed, O chieftain, is concentration based on wholesome states. If you could attain such concentration of mind, you would thus abandon this wavering state of doubt.\n\nThat noble disciple, O chieftain, being thus free from covetousness, free from ill-will, undeluded, clearly comprehending, and mindful, abides pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all circumstances, he abides pervading the entire world with a mind imbued with loving-kindness—vast, exalted, immeasurable, without hostility, without ill-will.\n\nHe reflects thus: ‘This teacher who holds such a doctrine and such a view: by one who acts, causes to act; by one who cuts, causes to cut; by one who tortures, causes to torture; by one who grieves, causes to grieve; by one who wearies, causes to weary; by one who agitates, causes to agitate; by one who takes life, takes what is not given, breaks into houses, plunders, commits burglary, lies in wait on the road, commits adultery, speaks falsehood – by doing these, evil is committed. Even if one were to turn all living beings on this earth into a single heap of flesh, a single pile of flesh with a razor-sharp discus, there is evil on account of that, there is an accumulation of evil. Even if one were to go to the southern bank of the Ganges, killing, slaughtering, cutting, causing to cut, torturing, causing to torture, there is evil on account of that, there is an accumulation of evil. Even if one were to go to the northern bank of the Ganges, giving, causing to give, sacrificing, causing to sacrifice, there is merit on account of that, there is an accumulation of merit. Through giving, through self-control, through restraint, through speaking the truth, there is merit, there is an accumulation of merit.’ If the words of that venerable teacher are true, then it is a definite certainty for me that I who harm no living creature, neither trembling nor firm, will certainly have two advantages: that I am restrained in body, restrained in speech, and restrained in mind, and that upon the dissolution of the body, after death, I will be reborn in a good destination, a heavenly world. Joy arises in him. To one joyful, rapture arises. With a rapturous mind, the body becomes tranquil. One with a tranquil body experiences happiness. For one who is happy, the mind becomes concentrated. This, Gāmaṇi, is the concentration of the Dhamma. If you were to gain this mental concentration, you would thus abandon this doubtful state.\n\nThat noble disciple, Gāmaṇi, thus free from covetousness, free from ill will, unconfused, clearly comprehending, mindful, dwells pervading one direction with a mind imbued with compassion… similarly, he dwells pervading one direction with a mind imbued with appreciative joy…\n\nThat noble disciple, Gāmaṇi, thus free from covetousness, free from ill will, unconfused, clearly comprehending, mindful, dwells pervading one direction with a mind imbued with equanimity; similarly, the second; similarly, the third; similarly, the fourth. Thus, above, below, across, everywhere, in all circumstances, the entire world, he dwells pervading with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility, without ill will. He reflects thus: ‘This teacher who holds such a doctrine and such a view: there is no gift, no offering, no sacrifice; there is no fruit or result of good and bad deeds; there is no this world, no other world; there is no mother, no father; there are no spontaneously arisen beings; there are no ascetics and brahmins in the world who are rightly gone, rightly practicing, who, having themselves realized and directly known this world and the other world, declare it.’ If the words of that venerable teacher are true, then it is a definite certainty for me that I who harm no living creature, neither trembling nor firm, will certainly have two advantages: that I am restrained in body, restrained in speech, and restrained in mind, and that upon the dissolution of the body, after death, I will be reborn in a good destination, a heavenly world. Joy arises in him. To one joyful, rapture arises. With a rapturous mind, the body becomes tranquil. One with a tranquil body experiences happiness. For one who is happy, the mind becomes concentrated. This, Gāmaṇi, is the concentration of the Dhamma. If you were to gain this mental concentration, you would thus abandon this doubtful state.\n\nThat noble disciple, Gāmaṇi, thus free from covetousness, free from ill will, unconfused, clearly comprehending, mindful, dwells pervading one direction with a mind imbued with equanimity; similarly, the second; similarly, the third; similarly, the fourth. Thus, above, below, across, everywhere, in all circumstances, the entire world, he dwells pervading with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility, without ill will. He reflects thus: ‘This teacher who holds such a doctrine and such a view: there is gift, there is offering, there is sacrifice; there is fruit and result of good and bad deeds; there is this world, there is another world; there is mother, there is father; there are spontaneously arisen beings; there are ascetics and brahmins in the world who are rightly gone, rightly practicing, who, having themselves realized and directly known this world and the other world, declare it.’ If the words of that venerable teacher are true, then it is a definite certainty for me that I who harm no living creature, neither trembling nor firm, will certainly have two advantages: that I am restrained in body, restrained in speech, and restrained in mind, and that upon the dissolution of the body, after death, I will be reborn in a good destination, a heavenly world. Joy arises in him. To one joyful, rapture arises. With a rapturous mind, the body becomes tranquil. One with a tranquil body experiences happiness. For one who is happy, the mind becomes concentrated. This, Gāmaṇi, is the concentration of the Dhamma.\n\nIf you were to gain mental concentration in that, then you would abandon this state of doubt. Indeed, Gāmaṇi, such a noble disciple, free from covetousness, free from ill-will, undeluded, clearly comprehending, and mindful, dwells pervading one direction with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth; thus above, below, across, everywhere, in all circumstances, pervading the entire world with a mind imbued with equanimity, vast, exalted, immeasurable, free from animosity, free from ill-will. He reflects thus: ‘There is this teacher who holds such a doctrine and such a view: when one acts or causes to act, cuts or causes to cut, cooks or causes to cook, grieves or causes to grieve, wearies or causes to weary, trembles or causes to tremble, takes life, takes what is not given, breaks into houses, plunders property, robs a single house, commits highway robbery, goes after another’s wife, speaks falsehood – when one acts, no evil is done. Even if, with a razor-sharp wheel, one were to make the living beings on this earth into a single heap of flesh, a single pile of flesh, there would be no evil from that cause, no increase of evil. Even if one were to go to the southern bank of the Gaṅgā, killing and causing to kill, cutting and causing to cut, cooking and causing to cook, there would be no evil from that cause, no increase of evil. Even if one were to go to the northern bank of the Gaṅgā, giving and causing to give, sacrificing and causing to sacrifice, there would be no merit from that cause, no increase of merit. Through giving, self-restraint, control, and truthfulness, there is no merit, no increase of merit.’ ‘If the words of that venerable teacher are true, then it is certain for me, who harms nothing, neither moving nor unmoving beings. In this situation, both outcomes are firmly established for me: that I am restrained in body, restrained in speech, and restrained in mind; and that, with the breaking up of the body, after death, I shall reappear in a good destination, a heavenly world.’ Joy arises for him. With joy, rapture arises. With a rapturous mind, his body becomes tranquil. With a tranquil body, he experiences happiness. With a happy mind, his mind becomes concentrated. Indeed, Gāmaṇi, this is concentration based on the Dhamma. If you were to gain mental concentration in that, then you would abandon this state of doubt.\n\nIndeed, Gāmaṇi, such a noble disciple, free from covetousness, free from ill-will, undeluded, clearly comprehending, and mindful, dwells pervading one direction with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth; thus above, below, across, everywhere, in all circumstances, pervading the entire world with a mind imbued with equanimity, vast, exalted, immeasurable, free from animosity, free from ill-will. He reflects thus: ‘There is this teacher who holds such a doctrine and such a view: when one acts or causes to act, cuts or causes to cut, cooks or causes to cook, grieves or causes to grieve, wearies or causes to weary, trembles or causes to tremble, takes life, takes what is not given, breaks into houses, plunders property, robs a single house, commits highway robbery, goes after another’s wife, speaks falsehood – when one acts, evil is done. Even if, with a razor-sharp wheel, one were to make the living beings on this earth into a single heap of flesh, a single pile of flesh, there would be evil from that cause, there would be an increase of evil. Even if one were to go to the southern bank of the Gaṅgā, killing and causing to kill, cutting and causing to cut, cooking and causing to cook, there would be evil from that cause, there would be an increase of evil. Even if one were to go to the northern bank of the Gaṅgā, giving and causing to give, sacrificing and causing to sacrifice, there would be merit from that cause, there would be an increase of merit. Through giving, self-restraint, control, and truthfulness, there is merit, there is an increase of merit.’ ‘If the words of that venerable teacher are true, then it is certain for me, who harms nothing, neither moving nor unmoving beings. In this situation, both outcomes are firmly established for me: that I am restrained in body, restrained in speech, and restrained in mind; and that, with the breaking up of the body, after death, I shall reappear in a good destination, a heavenly world.’ Joy arises for him. With joy, rapture arises. With a rapturous mind, his body becomes tranquil. With a tranquil body, he experiences happiness. With a happy mind, his mind becomes concentrated. Indeed, Gāmaṇi, this is concentration based on the Dhamma. If you were to gain mental concentration in that, then you would abandon this state of doubt.\n\nWhen this was said, Pāṭaliya the village headman said to the Blessed One: ‘Excellent, venerable sir! Excellent, venerable sir! From this day forth, I go for refuge for life.’",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝලියවරුන් අතර උත්තර නම් කෝලිය නගරයෙහි වැඩවසන සේක. එවිට පාටලිය ගාමණී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි පාටලිය ගාමණී භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"ස්වාමීනි, 'ශ්‍රමණ ගෞතමයන් වහන්සේ මායාව දනිති'යි මා අසා ඇත. ස්වාමීනි, 'ශ්‍රමණ ගෞතමයන් වහන්සේ මායාව දනිති'යි යමෙක් එසේ පැවසූවා නම්, ඔවුහු භාග්‍යවතුන් වහන්සේගේ වචනයම කියන්නෝද? භාග්‍යවතුන් වහන්සේට අසත්‍යයෙන් චෝදනා නොකරන්නෝද? ධර්මයට අනුකූලව ධර්මය ප්‍රකාශ කරන්නෝද? ධර්මානුකූල වාද විවාදයකදී කිසිදු දෝෂාරෝපණයකට ලක්වන තැනකට නොපැමිණෙන්නෝද? ස්වාමීනි, අපි භාග්‍යවතුන් වහන්සේට අසත්‍යයෙන් චෝදනා කිරීමට අකැමැත්තෙමු.\"\n\n\"ගාමණී, 'ශ්‍රමණ ගෞතමයන් වහන්සේ මායාව දනිති'යි යමෙක් එසේ පැවසූවා නම්, ඔවුහු මාගේ වචනයම කියන්නෝ වෙති. ඔවුහු මට අසත්‍යයෙන් චෝදනා නොකරති, ධර්මයට අනුකූලව ධර්මය ප්‍රකාශ කරති, ධර්මානුකූල වාද විවාදයකදී කිසිදු දෝෂාරෝපණයකට ලක්වන තැනකට නොපැමිණෙති. භවත්නි, 'ශ්‍රමණ ගෞතමයන් වහන්සේ මායාව දනිති'යි පවසා, 'ශ්‍රමණ ගෞතමයන් වහන්සේ මායාකාරයෙකි' යැයිද කියන ඒ ශ්‍රමණ බ්‍රාහ්මණයන්ගේ වචනය අපි සැබැවින්ම විශ්වාස නොකරමු. ගාමණී, යමෙක් 'මම මායාව දනිමි'යි මෙසේ කියන්නේද, හෙතෙම 'මම මායාකාරයෙක්මි'යි මෙසේ කියන්නේය. එසේ නම් භාග්‍යවතුන් වහන්සේත්, සුගතයන් වහන්සේත් එසේම වන සේක්ද?\"\n\n\"එසේ නම්, ගාමණී, මම ඔබගෙන්ම මේ පිළිබඳව විමසමි; ඔබට සුදුසු යැයි හැඟෙන පරිදි එය විස්තර කරන්න. ගාමණී, ඔබ මේ කුමක් සිතන්නෙහිද? ඔබ කෝලියවරුන්ගේ ලම්බචූලක භටයන් දන්නෙහිද?\" \"ස්වාමීනි, මම කෝලියවරුන්ගේ ලම්බචූලක භටයන් දනිමි.\" \"ගාමණී, ඔබ මේ කුමක් සිතන්නෙහිද? කෝලියවරුන්ගේ ලම්බචූලක භටයෝ කුමක් සඳහා සිටින්නෝද?\" \"ස්වාමීනි, කෝලියවරුන්ගේ සිටින සොර නඩුව මැඩපැවැත්වීමටද, කෝලියවරුන්ගේ රාජකාරි දූත මෙහෙවර ඉටුකිරීමටද, මේ සඳහාමයි ස්වාමීනි, කෝලියවරුන්ගේ ලම්බචූලක භටයෝ සිටින්නේ.\" \"ගාමණී, ඔබ මේ කුමක් සිතන්නෙහිද? ඔබ කෝලියවරුන්ගේ ලම්බචූලක භටයන් දන්නේ, ඔවුන් සිල්වන්තයන් ලෙසද, නැතහොත් දුසිල්වතුන් ලෙසද?\" \"ස්වාමීනි, මම කෝලියවරුන්ගේ ලම්බචූලක භටයන් දුසිල්වත් වූ, පාපී ස්වභාව ඇති අය ලෙස දනිමි. ලෝකයේ සිටින දුසිල්වත් වූ, පාපී ස්වභාව ඇති යම් අය වෙත්ද, කෝලියවරුන්ගේ ලම්බචූලක භටයෝ ඔවුන් අතරින් එක් කොටසක් වෙති.\" \"ගාමණී, යමෙක් මෙසේ කියන්නේ නම්: 'පාටලිය ගාමණී කෝලියවරුන්ගේ දුසිල්වත්, පාපී ස්වභාව ඇති ලම්බචූලක භටයන් දනී, එබැවින් පාටලිය ගාමණීද දුසිල්වත්, පාපී ස්වභාව ඇත්තෙකි' කියා, හෙතෙම එසේ කියන්නේ නිවැරදිවද?\" \"ස්වාමීනි, එය එසේ නොවේ! ස්වාමීනි, කෝලියවරුන්ගේ ලම්බචූලක භටයෝ වෙනත් අය වෙති, මම වෙනත් අයෙක්මි. කෝලියවරුන්ගේ ලම්බචූලක භටයෝ වෙනත් ස්වභාව ඇත්තෝය, මම වෙනත් ස්වභාව ඇත්තෙක්මි.\" \"ගාමණී, 'පාටලිය ගාමණී කෝලියවරුන්ගේ දුසිල්වත්, පාපී ස්වභාව ඇති ලම්බචූලක භටයන් දනී, එහෙත් පාටලිය ගාමණී දුසිල්වත්, පාපී ස්වභාව ඇත්තෙක් නොවේ' යැයි ඔබට පිළිගත හැකි නම්, 'තථාගතයන් වහන්සේ මායාව දනිති, එහෙත් තථාගතයන් වහන්සේ මායාකාරයෙක් නොවේ' යැයි තථාගතයන් වහන්සේට පිළිගත නොහැක්කේ මන්ද? ගාමණී, මම මායාවද දනිමි, මායාවේ විපාකද දනිමි, මායාකාරයෙක් කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි.\"\n\n\"ගාමණී, මම ප්‍රාණඝාතයද දනිමි, ප්‍රාණඝාතයේ විපාකද දනිමි, ප්‍රාණඝාතකයා කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි. ගාමණී, මම අදත්තාදානයද දනිමි, අදත්තාදානයේ විපාකද දනිමි, අදත්තාදායකයා කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි. ගාමණී, මම කාමමිථ්‍යාචාරයද දනිමි, කාමමිථ්‍යාචාරයේ විපාකද දනිමි, කාමමිථ්‍යාචාරියා කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි. ගාමණී, මම මුසාවාදයද දනිමි, මුසාවාදයේ විපාකද දනිමි, මුසාවාදියා කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි. ගාමණී, මම පිසුණුවාචාවද දනිමි, පිසුණුවාචාවේ විපාකද දනිමි, පිසුණුවාචාවෙන් යුක්ත තැනැත්තා කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි. ගාමණී, මම ඵරුසවාචාවද දනිමි, ඵරුසවාචාවේ විපාකද දනිමි, ඵරුසවාචාවෙන් යුක්ත තැනැත්තා කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි. ගාමණී, මම සම්ඵප්පලාපයද දනිමි, සම්ඵප්පලාපයේ විපාකද දනිමි, සම්ඵප්පලාපයෙන් යුක්ත තැනැත්තා කයින් මියැදීමෙන් පසු අපාය, දුර්ගති, විනිපාතය, නිරය වෙත උපදින්නේ කෙසේද කියාද මම දනිමි.\"\n\nගාමණි, මම අභිධ්‍යාව (අනුන්ගේ සම්පත් කෙරෙහි දැඩි තණ්හාව) ද, අභිධ්‍යාවේ විපාක ද, අභිධ්‍යාලු පුද්ගලයා කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදින ආකාරය ද දනිමි. ගාමණි, මම ව්‍යාපාද දෝෂය (ද්වේෂය) ද, ව්‍යාපාද දෝෂයේ විපාක ද, ව්‍යාපාද චිත්ත ඇති පුද්ගලයා කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදින ආකාරය ද දනිමි. ගාමණි, මම මිත්‍යාදෘෂ්ටිය ද, මිත්‍යාදෘෂ්ටියේ විපාක ද, මිත්‍යාදෘෂ්ටික පුද්ගලයා කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදින ආකාරය ද දනිමි.\n\n“ගාමණි, සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ මෙවැනි වාද ඇත්තෝ වෙති, මෙවැනි දෘෂ්ටි ඇත්තෝ වෙති: ‘යමෙක් ප්‍රාණඝාතය කරන්නේ ද, ඔහු සියල්ලෝම මේ දිට්ඨධම්මයේ දී (මේ ජීවිතයේ දී ම) දුක් ද දෝමනස්ස ද විඳිත්. යමෙක් අනුන් සතු දෙයක් හොරෙන් ගන්නේ ද, ඔහු සියල්ලෝම මේ දිට්ඨධම්මයේ දී දුක් ද දෝමනස්ස ද විඳිත්. යමෙක් කාමයන්හි වරදවා හැසිරෙන්නේ ද, ඔහු සියල්ලෝම මේ දිට්ඨධම්මයේ දී දුක් ද දෝමනස්ස ද විඳිත්. යමෙක් මුසාවාද කියන්නේ ද, ඔහු සියල්ලෝම මේ දිට්ඨධම්මයේ දී දුක් ද දෝමනස්ස ද විඳිත්’ යනුවෙනි.”\n\n“ගාමණි, මෙලොවෙහි මල්මාලා පැලඳ, කර්ණාභරණ පැලඳ, හොඳින් නා, සුවඳ විලවුන් ගල්වා, කෙස් රැවුල් කපා සකසා ගත්, කාන්තාවන් සමඟ රජෙකු මෙන් සැප විඳින යම් පුද්ගලයෙක් දක්නට ලැබේ. ඔහුව දැක මිනිස්සු මෙසේ කියති: ‘අනේ, මේ මල්මාලා පැලඳ, කර්ණාභරණ පැලඳ, හොඳින් නා, සුවඳ විලවුන් ගල්වා, කෙස් රැවුල් කපා සකසා ගත්, කාන්තාවන් සමඟ රජෙකු මෙන් සැප විඳින මේ පුද්ගලයා කුමක් කළේ ද?’ එවිට ඔවුහු මෙසේ කියති: ‘අනේ, මේ පුද්ගලයා රජුගේ සතුරෙකුගේ ජීවිතය බලහත්කාරයෙන් නැති කළේය. රජු ඔහු කෙරෙහි සතුටු වී තෑගි බෝග දුන්නේය. ඒ නිසා මේ පුද්ගලයා මල්මාලා පැලඳ, කර්ණාභරණ පැලඳ, හොඳින් නා, සුවඳ විලවුන් ගල්වා, කෙස් රැවුල් කපා සකසා ගත්, කාන්තාවන් සමඟ රජෙකු මෙන් සැප විඳියි’ යනුවෙනි.”\n\n“ගාමණි, මෙලොවෙහි ම ශක්තිමත් කඹයකින් අත් පිටුපසට කර තදින් බැඳ, හිස මුඩු කර, ගොරෝසු හඬින් යුත් බෙරයක් නාද කරමින් වීදියෙන් වීදියට, සන්ධියෙන් සන්ධියට පෙරහරින් ගෙන ගොස්, නගරයේ දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයට දකුණු පසින් හිස සිඳ දමන යම් පුද්ගලයෙක් දක්නට ලැබේ. ඔහුව දැක මිනිස්සු මෙසේ කියති: ‘අනේ, මේ ශක්තිමත් කඹයකින් අත් පිටුපසට කර තදින් බැඳ, හිස මුඩු කර, ගොරෝසු හඬින් යුත් බෙරයක් නාද කරමින් වීදියෙන් වීදියට, සන්ධියෙන් සන්ධියට පෙරහරින් ගෙන ගොස්, නගරයේ දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයට දකුණු පසින් හිස සිඳ දමන මේ පුද්ගලයා කුමක් කළේ ද?’ එවිට ඔවුහු මෙසේ කියති: ‘අනේ, මේ පුද්ගලයා රජුගේ සතුරෙකි. ඔහු ස්ත්‍රියකගේ හෝ පුරුෂයෙකුගේ හෝ ජීවිතය නැති කළේය. ඒ නිසා රජවරුන් ඔහුව අල්ලා මෙවැනි දඬුවමක් පමුණුවති’ යනුවෙනි.”\n\n“ගාමණි, ඔබ මේ ගැන කුමක් සිතන්නේ ද? මේ ආකාරයේ දේවල් ඔබ දැක තිබේ ද? අසා තිබේ ද?” “ස්වාමීනි, අපි දැක ද ඇත්තෙමු, අසා ද ඇත්තෙමු, තවමත් අසන්නට ද ලැබේ.” “එසේ නම් ගාමණි, ‘යමෙක් ප්‍රාණඝාතය කරන්නේ ද, ඔහු සියල්ලෝම මේ දිට්ඨධම්මයේ දී දුක් ද දෝමනස්ස ද විඳිත්’ යැයි මෙවැනි වාද ඇත්තා වූ, මෙවැනි දෘෂ්ටි ඇත්තා වූ ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ සත්‍යයක් කීවාහු ද, අසත්‍යයක් කීවාහු ද?” “ස්වාමීනි, අසත්‍යයකි.” “එසේ නම්, හිස් වූ අසත්‍ය දොඩන ඒ අය සීලවන්තයෝ ද, දුස්සීලයෝ ද?” “ස්වාමීනි, දුස්සීලයෝ ය.” “එසේ නම්, ඒ දුස්සීල වූ පාපී ධර්ම ඇත්තෝ වැරදි පිළිවෙතක සිටින්නෝ ද, නිවැරදි පිළිවෙතක සිටින්නෝ ද?” “ස්වාමීනි, වැරදි පිළිවෙතක සිටින්නෝ ය.” “එසේ නම්, ඒ වැරදි පිළිවෙතක සිටින්නෝ මිත්‍යාදෘෂ්ටිකයෝ ද, සම්මාදෘෂ්ටිකයෝ ද?” “ස්වාමීනි, මිත්‍යාදෘෂ්ටිකයෝ ය.” “එසේ නම්, ඒ මිත්‍යාදෘෂ්ටිකයන් කෙරෙහි පැහැදීම යෝග්‍ය වන්නේ ද?” “නැත ස්වාමීනි.”\n\n“ගාමණි, මෙලොවෙහි මල්මාලා පැලඳ, කර්ණාභරණ පැලඳ, හොඳින් නා, සුවඳ විලවුන් ගල්වා, කෙස් රැවුල් කපා සකසා ගත්, කාන්තාවන් සමඟ රජෙකු මෙන් සැප විඳින යම් පුද්ගලයෙක් දක්නට ලැබේ. ඔහුව දැක මිනිස්සු මෙසේ කියති: ‘අනේ, මේ මල්මාලා පැලඳ, කර්ණාභරණ පැලඳ, හොඳින් නා, සුවඳ විලවුන් ගල්වා, කෙස් රැවුල් කපා සකසා ගත්, කාන්තාවන් සමඟ රජෙකු මෙන් සැප විඳින මේ පුද්ගලයා කුමක් කළේ ද?’ එවිට ඔවුහු මෙසේ කියති: ‘අනේ, මේ පුද්ගලයා රජුගේ සතුරෙකුගේ වස්තුව බලහත්කාරයෙන් පැහැර ගත්තේය. රජු ඔහු කෙරෙහි සතුටු වී තෑගි බෝග දුන්නේය. ඒ නිසා මේ පුද්ගලයා මල්මාලා පැලඳ, කර්ණාභරණ පැලඳ, හොඳින් නා, සුවඳ විලවුන් ගල්වා, කෙස් රැවුල් කපා සකසා ගත්, කාන්තාවන් සමඟ රජෙකු මෙන් සැප විඳියි’ යනුවෙනි.”\n\n“ගාමණි, මෙලොවෙහි ම ශක්තිමත් කඹයකින් අත් පිටුපසට කර තදින් බැඳ, හිස මුඩු කර, ගොරෝසු හඬින් යුත් බෙරයක් නාද කරමින් වීදියෙන් වීදියට, සන්ධියෙන් සන්ධියට පෙරහරින් ගෙන ගොස්, නගරයේ දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයට දකුණු පසින් හිස සිඳ දමන යම් පුද්ගලයෙක් දක්නට ලැබේ. ඔහුව දැක මිනිස්සු මෙසේ කියති: ‘අනේ, මේ ශක්තිමත් කඹයකින් අත් පිටුපසට කර තදින් බැඳ, හිස මුඩු කර, ගොරෝසු හඬින් යුත් බෙරයක් නාද කරමින් වීදියෙන් වීදියට, සන්ධියෙන් සන්ධියට පෙරහරින් ගෙන ගොස්, නගරයේ දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයට දකුණු පසින් හිස සිඳ දමන මේ පුද්ගලයා කුමක් කළේ ද?’ එවිට ඔවුහු මෙසේ කියති: ‘අනේ, මේ පුද්ගලයා ගමකින් හෝ අරණ්‍යයකින් හෝ සොරකමක් වශයෙන් අන්සතු දෙයක් ගත්තේය. ඒ නිසා රජවරුන් ඔහුව අල්ලා මෙවැනි දඬුවමක් පමුණුවති’ යනුවෙනි.” “ගාමණි, ඔබ මේ ගැන කුමක් සිතන්නේ ද? මේ ආකාරයේ දේවල් ඔබ දැක තිබේ ද? අසා තිබේ ද?” “ස්වාමීනි, අපි දැක ද ඇත්තෙමු, අසා ද ඇත්තෙමු, තවමත් අසන්නට ද ලැබේ.”\n\nගාමණි, එහිලා යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘යම් කිසිවෙක් නොදෙන දෙයක් ගන්නේද, හෙතෙම මේ දක්නට ලැබෙන ධර්‍මයෙහිම දුක සහ දොම්නස අත්විඳින්නේය’ යැයි මෙසේ කියන්නෝත්, මෙසේ දකින්නෝත් වෙත්ද, ඔවුහු සැබෑ දෙයක්ද කීවෝ, නැත්නම් බොරු දෙයක්ද? ... (ඔවුන් කෙරෙහි) ප්‍ර‍සන්න වීමට සුදුසුද?”\n“එසේ නොවේ, භන්තේ.”\n“එහෙත් ගාමණි, මෙලොවෙහි ඇතැම් පුද්ගලයෙක් මාල පළඳින්නෙක්ද, කුණ්ඩලාභරණ දරන්නෙක්ද, කාමභෝගීව රජෙකු මෙන් සැප විඳින්නෙක්ද සිටිනු දක්නට ලැබේ. ඔහුව අරභයා මෙසේ කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා කුමක් කර මාල පළඳින්නෙක්ද, කුණ්ඩලාභරණ දරන්නෙක්ද, කාමභෝගීව රජෙකු මෙන් සැප විඳින්නෙක්ද වී සිටින්නේ?’ කියාය. ඔහුව අරභයා මෙසේද කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා රජුගේ සතුරෙකුගේ බිරින්දෑවරුන් සමග හැසිරී ඇත. ඒ නිසා රජු සතුටු වී ඔහුට තෑගි බෝග දුන්නේය. එබැවින් මේ පුරුෂයා මාල පළඳින්නෙක්ද, කුණ්ඩලාභරණ දරන්නෙක්ද, කාමභෝගීව රජෙකු මෙන් සැප විඳින්නෙක්ද වී සිටින්නේය’ කියාය.”\n\n“ගාමණි, තවද, මෙලොවෙහි ඇතැම් පුද්ගලයෙක් තද ලණු වලින් (බැඳ)... නගරයෙන් දකුණු දෙසින් හිස සිඳ දමනු ලබන බව දක්නට ලැබේ. ඔහුව අරභයා මෙසේ කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා කුමක් කර තද ලණු වලින් (බැඳ)... නගරයෙන් දකුණු දෙසින් හිස සිඳ දමනු ලබන්නේද?’ කියාය. ඔහුව අරභයා මෙසේද කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා උතුම් ස්ත්‍රීන් සමගද, උතුම් කුමරියන් සමගද හැසිරී ඇත. ඒ නිසා රජවරු ඔහුව අල්ලා මෙවැනි දඬුවම් කරවති’ කියාය. ගාමණි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? ඔබට මෙවැනි දේ දැකීමට හෝ ඇසීමට ලැබී තිබේද?”\n“අපට දැකීමටද ලැබී ඇත, භන්තේ, ඇසීමටද ලැබී ඇත, තවදුරටත් ඇසීමටද ලැබේවි.”\n\n“ගාමණි, එහිලා යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘යම් කිසිවෙක් කාමයන්හි වරදවා හැසිරෙන්නේද, හෙතෙම මේ දක්නට ලැබෙන ධර්‍මයෙහිම දුක සහ දොම්නස අත්විඳින්නේය’ යැයි මෙසේ කියන්නෝත්, මෙසේ දකින්නෝත් වෙත්ද, ඔවුහු සැබෑ දෙයක්ද කීවෝ, නැත්නම් බොරු දෙයක්ද? ... (ඔවුන් කෙරෙහි) ප්‍ර‍සන්න වීමට සුදුසුද?”\n“එසේ නොවේ, භන්තේ.”\n“එහෙත් ගාමණි, මෙලොවෙහි ඇතැම් පුද්ගලයෙක් මාල පළඳින්නෙක්ද, කුණ්ඩලාභරණ දරන්නෙක්ද, මනා කොට ස්නානය කළ, මනා කොට ආලේප කළ, රැවුලද හිසකෙස්ද සකස් කළ, කාමභෝගීව රජෙකු මෙන් සැප විඳින්නෙක්ද සිටිනු දක්නට ලැබේ. ඔහුව අරභයා මෙසේ කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා කුමක් කර මාල පළඳින්නෙක්ද, කුණ්ඩලාභරණ දරන්නෙක්ද, මනා කොට ස්නානය කළ, මනා කොට ආලේප කළ, රැවුලද හිසකෙස්ද සකස් කළ, කාමභෝගීව රජෙකු මෙන් සැප විඳින්නෙක්ද වී සිටින්නේ?’ කියාය. ඔහුව අරභයා මෙසේද කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා බොරු කීමෙන් රජුව සතුටු කළේය. ඒ නිසා රජු සතුටු වී ඔහුට තෑගි බෝග දුන්නේය. එබැවින් මේ පුරුෂයා මාල පළඳින්නෙක්ද, කුණ්ඩලාභරණ දරන්නෙක්ද, මනා කොට ස්නානය කළ, මනා කොට ආලේප කළ, රැවුලද හිසකෙස්ද සකස් කළ, කාමභෝගීව රජෙකු මෙන් සැප විඳින්නෙක්ද වී සිටින්නේය’ කියාය.”\n\n“ගාමණි, තවද, මෙලොවෙහි ඇතැම් පුද්ගලයෙක් තද ලණු වලින් පිටුපසට දෑත් තදින් බැඳ, හිස මුඩු කර, තියුණු ශබ්ද ඇති බෙර හඬින් (ඝෝෂා කරවමින්) වීදියෙන් වීදියට, සන්ධියෙන් සන්ධියට කැඳවාගෙන ගොස්, දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයෙන් දකුණු දෙසින් හිස සිඳ දමනු ලබන බව දක්නට ලැබේ. ඔහුව අරභයා මෙසේ කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා කුමක් කර තද ලණු වලින් පිටුපසට දෑත් තදින් බැඳ, හිස මුඩු කර, තියුණු ශබ්ද ඇති බෙර හඬින් (ඝෝෂා කරවමින්) වීදියෙන් වීදියට, සන්ධියෙන් සන්ධියට කැඳවාගෙන ගොස්, දකුණු දොරටුවෙන් පිටතට ගෙන ගොස්, නගරයෙන් දකුණු දෙසින් හිස සිඳ දමනු ලබන්නේද?’ කියාය. ඔහුව අරභයා මෙසේද කියති: ‘ආශ්චර්‍ය‍යකි! මේ පුරුෂයා ගෘහපතියෙකුගේ හෝ ගෘහපති පුත්‍රයෙකුගේ හෝ කටයුත්තක් බොරු කීමෙන් විනාශ කළේය. ඒ නිසා රජවරු ඔහුව අල්ලා මෙවැනි දඬුවම් කරවති’ කියාය. ගාමණි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? ඔබට මෙවැනි දේ දැකීමට හෝ ඇසීමට ලැබී තිබේද?”\n“අපට දැකීමටද ලැබී ඇත, භන්තේ, ඇසීමටද ලැබී ඇත, තවදුරටත් ඇසීමටද ලැබේවි.”\n\n“ගාමණි, එහිලා යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘යම් කිසිවෙක් බොරු කියන්නේද, හෙතෙම මේ දක්නට ලැබෙන ධර්‍මයෙහිම දුක සහ දොම්නස අත්විඳින්නේය’ යැයි මෙසේ කියන්නෝත්, මෙසේ දකින්නෝත් වෙත්ද, ඔවුහු සැබෑ දෙයක්ද කීවෝ, නැත්නම් බොරු දෙයක්ද?”\n“බොරු, භන්තේ.”\n“යම් ඒ පුද්ගලයෝ නිෂ්ඵල බොරු කියමින් විලාප නගන්නෝද, ඔවුහු සිල්වන්තයෝද, නැත්නම් දුස්සීලයෝද?”\n“දුස්සීලයෝ, භන්තේ.”\n“යම් ඒ දුස්සීල වූ, පාපධර්ම ඇත්තෝ වෙත්ද, ඔවුහු වැරදි මාර්ගයේ ගියෝද, නැත්නම් නිවැරදි මාර්ගයේ ගියෝද?”\n“වැරදි මාර්ගයේ ගියෝ, භන්තේ.”\n“යම් ඒ වැරදි මාර්ගයේ ගියෝ වෙත්ද, ඔවුහු මිත්‍යා දෘෂ්ටිකයෝද, නැත්නම් සම්මා දෘෂ්ටිකයෝද?”\n“මිත්‍යා දෘෂ්ටිකයෝ, භන්තේ.”\n“යම් ඒ මිත්‍යා දෘෂ්ටිකයෝ වෙත්ද, ඔවුන් කෙරෙහි ප්‍ර‍සන්න වීමට සුදුසුද?”\n“එසේ නොවේ, භන්තේ.”\n“ආශ්චර්‍ය‍යයි, භන්තේ! පුදුම සහගතයි, භන්තේ! මට, භන්තේ, ආගන්තුක ශාලාවක් තිබේ. එහි ඇඳන් ඇත, ආසන ඇත, ජල භාජනයක් ඇත, තෙල් පහනක් ඇත. එහි යම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ වාසය කරන්නේද, ඔහුට මා හැකි පමණින්, ශක්ති පමණින් දන් දෙමි. පෙර භන්තේ, විවිධ දෘෂ්ටීන් ඇති, විවිධ ඉවසීම් ඇති, විවිධ කැමැත්තන් ඇති ශාස්තෘවරු සතර දෙනෙක් ඒ ආගන්තුක ශාලාවෙහි වාසය කිරීමට පැමිණියෝය.”\n\n“එක් ශාස්තෘවරයෙක් මෙසේ කියන්නෙක්ද, මෙසේ දකින්නෙක්ද විය – ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත, හෝම කළ දෙයක් නැත, හොඳ නරක කර්මයන්ගේ ඵල විපාක නැත. මේ ලෝකය නැත, පරලොව නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත, මේ ලෝකයද පරලොවද තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍ර‍කා‍ශ කරන්නාවූ ලෝකයෙහි නිවැරදි ගමන් කළ, නිවැරදිව පිළිපන් ශ්‍ර‍ම‍ණ බ්‍රාහ්මණයෝ නැත’ කියාය.”\n\nඑක් ශාස්තෘවරයෙක් මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටි ඇත්තේ වෙයි – ‘දුන් දේ විපාක දෙන්නේය, පිදූ දේ විපාක දෙන්නේය, හෝම කළ දේ විපාක දෙන්නේය, හොඳින් කරන ලද නරකෙන් කරන ලද කර්මයන්ට ඵල විපාක ඇත්තේය, මේ ලෝකය ඇත්තේය, පරලොව ඇත්තේය, මව ඇත්තේය, පියා ඇත්තේය, ඕපපාතික සත්වයෝ ඇත්තාහ, මේ ලෝකයේ සම්පූර්ණයෙන් යහපත් මාර්ගයට පැමිණි, මනාව පිළිපන්, තමන් විසින්ම මේ ලෝකයත් පරලොවක් අවබෝධයෙන් සාක්ෂාත් කොට ප්‍රකාශ කරන්නා වූ ශ්‍රමණ බ්‍රාහ්මණයෝ ඇත්තාහ’ කියාය.\n\nතව ශාස්තෘවරයෙක් මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටි ඇත්තේ වෙයි – ‘යමක් කරන විට හෝ කරවන විට, යමක් කපන විට හෝ කප්පවන විට, යමක් පෙළන විට හෝ පෙළවන විට, යමක් ශෝක කරන විට හෝ ශෝක කරවන විට, යමක් වෙහෙසන විට හෝ වෙහෙසවන විට, යමක් කලබල කරන විට හෝ කලබල කරවන විට, සතුන් මරන විට, නොදුන් දේ ගන්නා විට, සොරකම් කරන විට, මංකොල්ලකන විට, ගෙවල් බිඳින විට, මහා මාර්ගය අවහිර කරන විට, අනුන්ගේ භාර්යාවන් වෙත යන විට, බොරු කියන විට, යමක් කිරීමෙන් පවක් සිදු නොවේ. කෙළවර තියුණු තල ඇති චක්‍රයකින් මේ පෘථිවියේ සතුන් මරා මස් ගොඩක්, මස් රාශියක් කරන්නේ නම්, එතෙකින් පවක් සිදු නොවේ, පවක් රැස්වීමක් නොවේ. ගංගා නදියෙන් දකුණු තීරයට ගොස් මරමින්, හිංසා කරමින්, කපමින්, කප්පවමින්, පෙළමින්, පෙළවමින් සිටින්නේ නම්, එතෙකින් පවක් සිදු නොවේ, පවක් රැස්වීමක් නොවේ. ගංගා නදියෙන් උතුරු තීරයට ගොස් දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එතෙකින් පිනක් සිදු නොවේ, පිනක් රැස්වීමක් නොවේ. දීමෙන්, දමනයෙන්, සංවරයෙන්, සත්‍ය කීමෙන් පිනක් සිදු නොවේ, පිනක් රැස්වීමක් නොවේ’ කියාය.\n\nතව ශාස්තෘවරයෙක් මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටි ඇත්තේ වෙයි – ‘යමක් කරන විට හෝ කරවන විට, යමක් කපන විට හෝ කප්පවන විට, යමක් පෙළන විට හෝ පෙළවන විට, යමක් ශෝක කරන විට හෝ ශෝක කරවන විට, යමක් වෙහෙසන විට හෝ වෙහෙසවන විට, යමක් කලබල කරන විට හෝ කලබල කරවන විට, සතුන් මරන විට, නොදුන් දේ ගන්නා විට, සොරකම් කරන විට, මංකොල්ලකන විට, ගෙවල් බිඳින විට, මහා මාර්ගය අවහිර කරන විට, අනුන්ගේ භාර්යාවන් වෙත යන විට, බොරු කියන විට, යමක් කිරීමෙන් පවක් සිදු වේ. කෙළවර තියුණු තල ඇති චක්‍රයකින් මේ පෘථිවියේ සතුන් මරා මස් ගොඩක්, මස් රාශියක් කරන්නේ නම්, එතෙකින් පවක් සිදු වේ, පවක් රැස්වීමක් වේ. ගංගා නදියෙන් දකුණු තීරයට ගොස් මරමින්, හිංසා කරමින්, කපමින්, කප්පවමින්, පෙළමින්, පෙළවමින් සිටින්නේ නම්, එතෙකින් පවක් සිදු වේ, පවක් රැස්වීමක් වේ. ගංගා නදියෙන් උතුරු තීරයට ගොස් දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එතෙකින් පිනක් සිදු වේ, පිනක් රැස්වීමක් වේ. දීමෙන්, දමනයෙන්, සංවරයෙන්, සත්‍ය කීමෙන් පිනක් සිදු වේ, පිනක් රැස්වීමක් වේ’ කියාය.\n\n‘ස්වාමීනි, ඒ මට මෙබඳු සැකයක් ඇති විය, මෙබඳු විචිකිච්ඡාවක් ඇති විය – ‘මේ භවත් ශ්‍රමණ බ්‍රාහ්මණයන්ගෙන් කවුද සත්‍ය කියා සිටින්නේ, කවුද අසත්‍ය කියා සිටින්නේ’ කියාය. ‘ගාමණිය, නුඹට සැක කිරීමට සුදුසුය, විචිකිච්ඡා කිරීමට සුදුසුය. සැක කළ යුතු තැනකම නුඹට විචිකිච්ඡාව උපන්නේය.’\n\n‘ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ කෙරෙහි මෙසේ පැහැදී සිටිමි. මේ සැක සහිත ධර්මය මා අත්හරින අයුරින් මට ධර්මය දේශනා කිරීමට භාග්‍යවතුන් වහන්සේට පුළුවන.’ ‘ගාමණිය, ධර්ම සමාධියක් ඇත්තේය. එහිදී යම් හෙයකින් නුඹ චිත්ත සමාධිය ලබන්නේ නම්, මෙසේ නුඹට මේ සැක සහිත ධර්මය අත්හැරිය හැකි වන්නේය.’\n\nගාමණිය, ධර්ම සමාධිය යනු කුමක්ද? ගාමණිය, මෙහිදී ආර්ය ශ්‍රාවකයා ප්‍රාණඝාතය අත්හැර ප්‍රාණඝාතයෙන් වැළකී සිටියි. අදත්තාදානය අත්හැර අදත්තාදානයෙන් වැළකී සිටියි. කාමයන්හි මිත්‍යාචාරය අත්හැර කාමයන්හි මිත්‍යාචාරයෙන් වැළකී සිටියි. මුසාවාදය අත්හැර මුසාවාදයෙන් වැළකී සිටියි. පිසුනු වචනය අත්හැර පිසුනු වචනයෙන් වැළකී සිටියි. ඵරුෂ වචනය අත්හැර ඵරුෂ වචනයෙන් වැළකී සිටියි. සම්ඵප්පලාපය අත්හැර සම්ඵප්පලාපයෙන් වැළකී සිටියි. අභිධ්‍යාව අත්හැර අභිධ්‍යා රහිත වෙයි. ව්‍යාපාදය සහ ද්වේෂය අත්හැර ව්‍යාපාද රහිත සිත් ඇත්තෙක් වෙයි. මිත්‍යාදෘෂ්ටිය අත්හැර සම්මාදිට්ඨියෙන් යුක්ත වෙයි.\n\nගාමණිය, එසේ වීතරාගී වූ, ව්‍යාපාද රහිත වූ, මුළා නොවුණු, සිහි නුවණින් යුත්, සිහි කල්පනාවෙන් යුත් ඒ ආර්ය ශ්‍රාවකයා මෛත්‍රියෙන් යුත් සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසින්ම දෙවන දිශාව, එලෙසින්ම තෙවන දිශාව, එලෙසින්ම සිව්වන දිශාවද, මෙසේ ඉහළ, පහළ, හරහට, සෑම තැනම, සෑම ආකාරයකින්ම, මුළු ලෝකයම, මහත් වූ, උතුම් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ මෛත්‍රියෙන් යුත් සිතින් පතුරුවා වාසය කරයි. ඔහු මෙසේ මෙනෙහි කරයි – ‘යම් ශාස්තෘවරයෙක් මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටි ඇත්තේ වෙයි – ‘දුන් දේ විපාක නොදෙන්නේය, පිදූ දේ විපාක නොදෙන්නේය, හෝම කළ දේ විපාක නොදෙන්නේය, හොඳින් කරන ලද නරකෙන් කරන ලද කර්මයන්ට ඵල විපාක ඇත්තේ නැත, මේ ලෝකය ඇත්තේ නැත, පරලොව ඇත්තේ නැත, මව ඇත්තේ නැත, පියා ඇත්තේ නැත, ඕපපාතික සත්වයෝ ඇත්තේ නැත, මේ ලෝකයේ සම්පූර්ණයෙන් යහපත් මාර්ගයට පැමිණි, මනාව පිළිපන්, තමන් විසින්ම මේ ලෝකයත් පරලොවක් අවබෝධයෙන් සාක්ෂාත් කොට ප්‍රකාශ කරන්නා වූ ශ්‍රමණ බ්‍රාහ්මණයෝ ඇත්තේ නැත’ කියාය. ‘යම් හෙයකින් ඒ භවත් ශාස්තෘවරයාගේ වචනය සත්‍ය නම්, සෙලවෙන හෝ නොසෙලවෙන කිසිවෙකුට හානියක් නොකරන මාගේ අපණ්ණක ප්‍රතිපදාව හේතුවෙන්, මේ දෙලොවේදීම මාහට කිසිදු හානියක් සිදු නොවේ.’\n\nගාමණි, මෙය කටග්‍රාහයකි; එනම්, මම කයින් සංවර වූයෙමි, වචනයෙන් සංවර වූයෙමි, සිතින් සංවර වූයෙමි, තවද කය බිඳීමෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදින්නෙමි’ යනුවෙනි. ඔහුට ප්‍රීතිය උපදී. ප්‍රමුදිත වූ තැනැත්තාට පිනා යාම උපදී. පිනා ගිය සිතක් ඇති තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කයක් ඇති තැනැත්තා සුවය විඳියි. සුවපත් වූ තැනැත්තාගේ සිත සමාධිමත් වේ. ගාමණි, මෙය ධර්ම සමාධියයි. එහිදී ඔබ සිතේ සමාධියක් ලබන්නේ නම්, මෙලෙස ඔබ මේ සැක සහිත ස්වභාවය දුරු කරනු ඇත.\n\nගාමණි, ඒ ආර්‍ය්‍ය ශ්‍රාවක තෙමේ මෙසේ, රාගයෙන් තොර වූ, ද්වේෂයෙන් තොර වූ, මුළා නො වූ, මනා අවබෝධයෙන් යුක්ත වූ, සිහි ඇති කල්හි මෛත්‍රී සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසම දෙවන දිශාවද, තෙවන දිශාවද, සතරවන දිශාවද පතුරුවයි. මෙලෙස ඉහළට, පහළට, හරහට, සියලු තැන, සියලු ආකාරයෙන්, මුළු ලෝකයම මෛත්‍රී සහගත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කරයි.\n\nඔහු මෙසේ සිහි කරයි: ‘මේ ශාස්තෘන් වහන්සේ මෙබඳු දේශනාවක් හා මෙබඳු දෘෂ්ටියක් ඇති සේක – දෙන ලද දේ (දානය) ඇත, පූජා කරන ලද දේ (යාග) ඇත, හෝම කරන ලද දේ ඇත, හොඳින් කරන ලද සහ නරකින් කරන ලද කර්මයන්ගේ ඵල විපාක ඇත, මේ ලෝකය ඇත, පරලොව ඇත, මව ඇත, පියා ඇත, ඕපපාතික සත්වයන් ඇත, මේ ලෝකයෙහිද, පරලෝකයෙහිද තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කරගෙන ප්‍රකාශ කරන්නා වූ සම්‍යක්‌ මාර්ගයට පැමිණි, සම්‍යක්‌ ප්‍රතිපදාවෙහි පිහිටි ශ්‍රමණ බ්‍රාහ්මණයෝ ඇත’ යනුවෙනි.\n\n‘ඒ භාග්‍යවත් ශාස්තෘන් වහන්සේගේ වචනය සත්‍ය නම්, චංචල හෝ ස්ථාවර කිසිවෙකුට හෝ හිංසා නොකරන මා හට මෙය සැක රහිත නිගමනයකි. මෙහිදී දෙයාකාරයෙන්ම මේ කටග්‍රාහය පවතී; එනම්, මම කයින් සංවර වූයෙමි, වචනයෙන් සංවර වූයෙමි, සිතින් සංවර වූයෙමි, තවද කය බිඳීමෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදින්නෙමි’ යනුවෙනි. ඔහුට ප්‍රීතිය උපදී. ප්‍රමුදිත වූ තැනැත්තාට පිනා යාම උපදී. පිනා ගිය සිතක් ඇති තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කයක් ඇති තැනැත්තා සුවය විඳියි. සුවපත් වූ තැනැත්තාගේ සිත සමාධිමත් වේ. ගාමණි, මෙය ධර්ම සමාධියයි. එහිදී ඔබ සිතේ සමාධියක් ලබන්නේ නම්, මෙලෙස ඔබ මේ සැක සහිත ස්වභාවය දුරු කරනු ඇත.\n\nගාමණි, ඒ ආර්‍ය්‍ය ශ්‍රාවක තෙමේ මෙසේ, රාගයෙන් තොර වූ, ද්වේෂයෙන් තොර වූ, මුළා නො වූ, මනා අවබෝධයෙන් යුක්ත වූ, සිහි ඇති කල්හි මෛත්‍රී සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසම දෙවන දිශාවද, තෙවන දිශාවද, සතරවන දිශාවද පතුරුවයි. මෙලෙස ඉහළට, පහළට, හරහට, සියලු තැන, සියලු ආකාරයෙන්, මුළු ලෝකයම මෛත්‍රී සහගත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කරයි.\n\nඔහු මෙසේ සිහි කරයි: ‘මේ ශාස්තෘන් වහන්සේ මෙබඳු දේශනාවක් හා මෙබඳු දෘෂ්ටියක් ඇති සේක – ක්‍රියා කරන විටත්, අන් අය ලවා ක්‍රියා කරවන විටත්, ඡේදනය කරන විටත්, අන් අය ලවා ඡේදනය කරවන විටත්, පීඩා කරන විටත්, අන් අය ලවා පීඩා කරවන විටත්, ශෝක කරන විටත්, අන් අය ලවා ශෝක කරවන විටත්, වෙහෙසට පත් කරන විටත්, අන් අය ලවා වෙහෙසට පත් කරවන විටත්, සලවමින්, අන් අය සලවමින්, සත්ව ඝාතනය කරන විටත්, නො දෙන ලද දේ ගන්නා විටත්, ගෙවල් බිඳින විටත්, සොරබඩු පැහැර ගන්නා විටත්, හුදකලා ගෙවල් කොල්ලකන විටත්, මංපහරණයේ යෙදෙන විටත්, අන් භාර්යාවන් වෙත යන විටත්, බොරු කියන විටත්, මේවා කරන විට පවක් සිදු නොවේ. රැවුල් තලයක් මෙන් තියුණු දාරයක් ඇති චක්‍රයකින් මෙපොළොවේ සත්වයන් එක් මස් ගොඩක්, එක් මස් පිඬක් බවට පත් කළත්, එයින් පවක් සිදු නොවේ, පවක් රැස් වීමක් නොවේ. ගංගාවේ දකුණු ඉවුරට ගොස් මරමින්, මරවමින්, කපමින්, කපවමින්, පීඩා කරමින්, පීඩා කරවමින් සිටියත්, එයින් පවක් සිදු නොවේ, පවක් රැස් වීමක් නොවේ. ගංගාවේ උතුරු ඉවුරට ගොස් දෙමින්, දෙවමින්, පූජා කරමින්, පූජා කරවමින් සිටියත්, එයින් පිනක් සිදු නොවේ, පිනක් රැස් වීමක් නොවේ. දානයෙන්, දමනයෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් සිදු නොවේ, පිනක් රැස් වීමක් නොවේ’ යනුවෙනි.\n\n‘ඒ භාග්‍යවත් ශාස්තෘන් වහන්සේගේ වචනය සත්‍ය නම්, චංචල හෝ ස්ථාවර කිසිවෙකුට හෝ හිංසා නොකරන මා හට මෙය සැක රහිත නිගමනයකි. මෙහිදී දෙයාකාරයෙන්ම මේ කටග්‍රාහය පවතී; එනම්, මම කයින් සංවර වූයෙමි, වචනයෙන් සංවර වූයෙමි, සිතින් සංවර වූයෙමි, තවද කය බිඳීමෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදින්නෙමි’ යනුවෙනි. ඔහුට ප්‍රීතිය උපදී. ප්‍රමුදිත වූ තැනැත්තාට පිනා යාම උපදී. පිනා ගිය සිතක් ඇති තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කයක් ඇති තැනැත්තා සුවය විඳියි. සුවපත් වූ තැනැත්තාගේ සිත සමාධිමත් වේ. ගාමණි, මෙය ධර්ම සමාධියයි. එහිදී ඔබ සිතේ සමාධියක් ලබන්නේ නම්, මෙලෙස ඔබ මේ සැක සහිත ස්වභාවය දුරු කරනු ඇත.\n\nගාමණි, ඒ ආර්‍ය්‍ය ශ්‍රාවක තෙමේ මෙසේ, රාගයෙන් තොර වූ, ද්වේෂයෙන් තොර වූ, මුළා නො වූ, මනා අවබෝධයෙන් යුක්ත වූ, සිහි ඇති කල්හි මෛත්‍රී සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසම දෙවන දිශාවද, තෙවන දිශාවද, සතරවන දිශාවද පතුරුවයි. මෙලෙස ඉහළට, පහළට, හරහට, සියලු තැන, සියලු ආකාරයෙන්, මුළු ලෝකයම මෛත්‍රී සහගත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වාසය කරයි.\n\nඔහු මෙසේ මෙනෙහි කරයි: ‘යම් ශාස්තෘවරයෙක් මෙබඳු වාද ඇති, මෙබඳු දෘෂ්ටි ඇති කෙනෙක් වේ නම්: (ඔහු කියන්නේ) කරන්නාට, කරවන්නාට, කපන්නාට, කප්පවන්නාට, දවන්නාට, දවවන්නාට, ශෝක කරන්නාට, ශෝක කරවන්නාට, වෙහෙසවන්නාට, වෙහෙසවන්නාට, කම්පා කරන්නාට, කම්පා කරවන්නාට, ප්‍රාණඝාත කරන්නාට, නොදුන් දෙයක් ගන්නාට, සොරකම් කරන්නාට, කොල්ලකන්නාට, ගෙවල් බිඳින්නාට, මහා මග සිටින්නාට, අනුන්ගේ බිරින්දන් ළඟට යන්නාට, බොරු කියන්නාට, (මේවා) කරන්නාට පව් සිදු වේය යන්නයි. යමෙක් තියුණු තල ඇති රෝදයකින් (කැත්තකින් හෝ පිහියකින්) මේ පොළොවේ සිටින සතුන් එකම මස් ගොඩක්, එකම මස් පිඬක් බවට පත් කළත්, එයින් පාපයක් ඇති වේ. පාපයේ ආගමනයක් (සමුදායක්) ඇත. යමෙක් ගංගා නදියේ දකුණු ඉවුරට ගොස් පහර දෙමින්, මරමින්, සිඳිමින්, සිඳුවමින්, දවමින්, දවවමින් ක්‍රියා කළත්, එයින් පාපයක් ඇති වේ. පාපයේ ආගමනයක් ඇත. යමෙක් ගංගා නදියේ උතුරු ඉවුරට ගොස් දෙමින්, දෙවමින්, යහමින්, යහමින් ක්‍රියා කළත්, එයින් පිනක් ඇති වේ. පිනේ ආගමනයක් ඇත. දානයෙන්, දමනයෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් ඇත. පිනේ ආගමනයක් ඇතැයි (ඔහු කියයි).’ යම් හෙයකින් ඒ භාග්‍යවත් ශාස්තෘවරයාගේ වචනය සත්‍ය නම්, චංචල හෝ ස්ථාවර කිසිවකුට පීඩා නොකරන මාහට එය නිසැකවම වාසිදායක තත්ත්වයක් වේ. මේ දෙකෙහිම නිසැකවම වාසියක් ඇත. මම කයින් සංවර වූයේ, වචනයෙන් සංවර වූයේ, සිතින් සංවර වූයේ නම්, කය බිඳීමෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයෙහි උපදින්නෙමි.’ ඔහුට ප්‍රමෝදය හට ගනී. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය හට ගනී. ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංහිඳේ. සංසිඳුණු කය ඇති තැනැත්තා සැප විඳියි. සැප ඇත්තාගේ සිත සමාධිගත වේ. ගාමිණිය, මෙය ධර්ම සමාධියයි. එහිදී ඔබ සිතේ සමාධියක් ලබා ගන්නේ නම්, මෙසේ ඔබ මේ සැක සහිත ධර්මය ප්‍රහාණය කරනු ඇත. ගාමිණිය, ඒ ආර්ය ශ්‍රාවකයා මෙසේ පහ වූ අභිධ්‍යා ඇත්තෙක්, පහ වූ ව්‍යාපාද ඇත්තෙක්, මුළා නොවුණු තැනැත්තෙක්, මනා සිහි ඇති, සිහි නුවණින් යුක්ත ව දයානුකම්පාවෙන් යුක්ත සිතින් එක දිශාවක් පුරා වැඩ වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව පුරා ද වැඩ වාසය කරයි. මෙසේ උඩ, යට, හරහට, සෑම තැනකින්ම, සියලු අයුරින්ම, මුළු ලෝකයම දයානුකම්පාවෙන් යුක්ත සිතින් පතුරුවා වැඩ වාසය කරයි. මුදිතාවෙන් යුක්ත සිතින් එක දිශාවක් පුරා වැඩ වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව පුරා ද වැඩ වාසය කරයි. මෙසේ උඩ, යට, හරහට, සෑම තැනකින්ම, සියලු අයුරින්ම, මුළු ලෝකයම මුදිතාවෙන් යුක්ත සිතින් පතුරුවා වැඩ වාසය කරයි.\n\nගාමිණිය, ඒ ආර්ය ශ්‍රාවකයා මෙසේ පහ වූ අභිධ්‍යා ඇත්තෙක්, පහ වූ ව්‍යාපාද ඇත්තෙක්, මුළා නොවුණු තැනැත්තෙක්, මනා සිහි ඇති, සිහි නුවණින් යුක්ත ව උපේක්ෂාවෙන් යුක්ත සිතින් එක දිශාවක් පුරා වැඩ වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව පුරා ද වැඩ වාසය කරයි. මෙසේ උඩ, යට, හරහට, සෑම තැනකින්ම, සියලු අයුරින්ම, මුළු ලෝකයම උපේක්ෂාවෙන් යුක්ත වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වැඩ වාසය කරයි.\n\nඔහු මෙසේ මෙනෙහි කරයි: ‘යම් ශාස්තෘවරයෙක් මෙබඳු වාද ඇති, මෙබඳු දෘෂ්ටි ඇති කෙනෙක් වේ නම්: දුන් දෙයක් නැත, පිදුම් කළ දෙයක් නැත, දේව පූජා කළ දෙයක් නැත, යහපත් හා අයහපත් කර්මයන්හි ඵල විපාකයක් නැත, මේ ලෝකයක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත, මේ ලොව හා පරලොව තමන් විසින්ම අවබෝධ කර සාක්ෂාත් කරගෙන ප්‍රකාශ කරන සම්‍යක් මාර්ගයට පැමිණි, සම්‍යක් ප්‍රතිපදාවේ පිහිටි කිසිදු ශ්‍රමණ බ්‍රාහ්මණයෙක් නැතැයි’ (ඔහු කියයි).’ යම් හෙයකින් ඒ භාග්‍යවත් ශාස්තෘවරයාගේ වචනය සත්‍ය නම්, චංචල හෝ ස්ථාවර කිසිවකුට පීඩා නොකරන මාහට එය නිසැකවම වාසිදායක තත්ත්වයක් වේ. මේ දෙකෙහිම නිසැකවම වාසියක් ඇත. මම කයින් සංවර වූයේ, වචනයෙන් සංවර වූයේ, සිතින් සංවර වූයේ නම්, කය බිඳීමෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයෙහි උපදින්නෙමි.’ ඔහුට ප්‍රමෝදය හට ගනී. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය හට ගනී. ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංහිඳේ. සංසිඳුණු කය ඇති තැනැත්තා සැප විඳියි. සැප ඇත්තාගේ සිත සමාධිගත වේ. ගාමිණිය, මෙය ධර්ම සමාධියයි. එහිදී ඔබ සිතේ සමාධියක් ලබා ගන්නේ නම්, මෙසේ ඔබ මේ සැක සහිත ධර්මය ප්‍රහාණය කරනු ඇත.\n\nගාමිණිය, ඒ ආර්ය ශ්‍රාවකයා මෙසේ පහ වූ අභිධ්‍යා ඇත්තෙක්, පහ වූ ව්‍යාපාද ඇත්තෙක්, මුළා නොවුණු තැනැත්තෙක්, මනා සිහි ඇති, සිහි නුවණින් යුක්ත ව උපේක්ෂාවෙන් යුක්ත සිතින් එක දිශාවක් පුරා වැඩ වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව පුරා ද වැඩ වාසය කරයි. මෙසේ උඩ, යට, හරහට, සෑම තැනකින්ම, සියලු අයුරින්ම, මුළු ලෝකයම උපේක්ෂාවෙන් යුක්ත වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් පතුරුවා වැඩ වාසය කරයි.\n\nඔහු මෙසේ මෙනෙහි කරයි: ‘යම් ශාස්තෘවරයෙක් මෙබඳු වාද ඇති, මෙබඳු දෘෂ්ටි ඇති කෙනෙක් වේ නම්: දුන් දෙයක් ඇත, පිදුම් කළ දෙයක් ඇත, දේව පූජා කළ දෙයක් ඇත, යහපත් හා අයහපත් කර්මයන්හි ඵල විපාකයක් ඇත, මේ ලෝකයක් ඇත, පරලොවක් ඇත, මවක් ඇත, පියෙක් ඇත, ඕපපාතික සත්වයෝ ඇත, මේ ලොව හා පරලොව තමන් විසින්ම අවබෝධ කර සාක්ෂාත් කරගෙන ප්‍රකාශ කරන සම්‍යක් මාර්ගයට පැමිණි, සම්‍යක් ප්‍රතිපදාවේ පිහිටි ශ්‍රමණ බ්‍රාහ්මණයෝ ලොව ඇතැයි’ (ඔහු කියයි).’ යම් හෙයකින් ඒ භාග්‍යවත් ශාස්තෘවරයාගේ වචනය සත්‍ය නම්, චංචල හෝ ස්ථාවර කිසිවකුට පීඩා නොකරන මාහට එය නිසැකවම වාසිදායක තත්ත්වයක් වේ. මේ දෙකෙහිම නිසැකවම වාසියක් ඇත. මම කයින් සංවර වූයේ, වචනයෙන් සංවර වූයේ, සිතින් සංවර වූයේ නම්, කය බිඳීමෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයෙහි උපදින්නෙමි.’ ඔහුට ප්‍රමෝදය හට ගනී. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය හට ගනී. ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංහිඳේ. සංසිඳුණු කය ඇති තැනැත්තා සැප විඳියි. සැප ඇත්තාගේ සිත සමාධිගත වේ. ගාමිණිය, මෙය ධර්ම සමාධියයි.\n\nයම් හෙයකින් ඔබට එහිදී චිත්ත සමාධියක් ලබාගත හැකිවේ නම්, එසේ කිරීමෙන් ඔබ මෙම සැක සහිත ස්වභාවය දුරු කරනු ඇත. \"ගාමණි, ඒ ආර්ය ශ්‍රාවකයා මෙසේ ආශාවන්ගෙන් තොරව, ව්‍යාපාද ද්වේෂයෙන් තොරව, මෝහයෙන් තොරව, මනා සිහියෙන් යුක්තව, මනා ප්‍රඥාවෙන් යුක්තව, උපේක්ෂාවෙන් යුත් සිතින් එක් දිශාවක් මෛත්‍රියෙන් පුරවා වාසය කරයි; එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද පුරවයි; මෙසේ උඩ, යට, හරහට, සෑම තැනකම, සියලු ආකාරයෙන්ම, මුළු ලෝකයම උපේක්ෂාවෙන් යුත්, විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ සිතින් පුරවා වාසය කරයි. ඔහු මෙසේ සලකයි – ‘යම් ශාස්තෘවරයෙක් මෙසේ පවසන, මෙබඳු දෘෂ්ටියක් ඇති කෙනෙක් වේ නම් – කරවන, කපන, කැපවීමට සලස්වන, පුළුස්සන, පුළුස්සවන්නට සලස්වන, ශෝක කරවන, ශෝක කරවන්නට සලස්වන, වෙහෙසට පත් කරවන, වෙහෙසට පත් කරවන්නට සලස්වන, කම්පා කරවන, කම්පා කරවන්නට සලස්වන, ප්‍රාණඝාතය කරන, නොදුන් දෙයක් ගන්නා, සොරකම් කරන, මංකොල්ල කන, නිවෙස්වලට ඇතුළු වන, මංපහරන, අනුන්ගේ භාර්යාවන් වෙත යන, බොරු කියන කල්හි පවක් සිදු නොවේ. තවද, යමෙක් මේ පොළොවේ සිටින ප්‍රාණීන් රැවුල් පිහියක මුවහත් කෙළවරක් බඳු චක්‍රයකින් එක මස් ගොඩක්, එක මස් පුඤ්ජයක් කරයිද, එයින් පවක් සිදු නොවේ, පවක් පැමිණීමක් ද නැත. ගංගා නදියෙහි දකුණු ඉවුරට ගොස් මරමින්, මරවමින්, කපමින්, කපවමින්, පුළුස්සමින්, පුළුස්සවමින් සිටියද, එයින් පවක් සිදු නොවේ, පවක් පැමිණීමක් ද නැත. ගංගා නදියෙහි උතුරු ඉවුරට ගොස් දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටියද, එයින් පිනක් සිදු නොවේ, පිනක් පැමිණීමක් ද නැත. දානයෙන්, දමනයෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් සිදු නොවේ, පිනක් පැමිණීමක් ද නැතැයි යමෙක් පවසයි.’ ‘යම් හෙයකින් ඒ පූජ්‍ය ශාස්තෘවරයාගේ වචනය සත්‍යයක් නම්, මට නිසැකයෙන්ම යහපතකි. මක්නිසාද යත්, මම කිසිදු චංචල වූ හෝ ස්ථාවර වූ සතෙකුට හිංසා නොකරමි. මෙහිදී මට ද්විත්ව ප්‍රතිලාභයක් ඇත, එනම්, මම කයින් සංවර වූයේ, වචනයෙන් සංවර වූයේ, සිතින් සංවර වූයේ වෙමි; තවද, කාය භේදයෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදින්නෙමි.’ ඔහුට ප්‍රමෝදය ඇතිවේ. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය උපදී. ප්‍රීතිමත් සිතක් ඇති කෙනෙකුගේ කය සන්සිඳෙයි. සන්සිඳුණු කයක් ඇති තැනැත්තාට සැප විඳියි. සැප විඳින්නාගේ සිත සමාධිමත් වේ. ගාමණි, මෙය ධර්ම සමාධියයි. යම් හෙයකින් ඔබට එහිදී චිත්ත සමාධියක් ලබාගත හැකිවේ නම්, එසේ කිරීමෙන් ඔබ මෙම සැක සහිත ස්වභාවය දුරු කරනු ඇත.\n\n\"ගාමණි, ඒ ආර්ය ශ්‍රාවකයා මෙසේ ආශාවන්ගෙන් තොරව, ව්‍යාපාද ද්වේෂයෙන් තොරව, මෝහයෙන් තොරව, මනා සිහියෙන් යුක්තව, මනා ප්‍රඥාවෙන් යුක්තව, උපේක්ෂාවෙන් යුත් සිතින් එක් දිශාවක් මෛත්‍රියෙන් පුරවා වාසය කරයි; එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද පුරවයි; මෙසේ උඩ, යට, හරහට, සෑම තැනකම, සියලු ආකාරයෙන්ම, මුළු ලෝකයම උපේක්ෂාවෙන් යුත්, විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ව්‍යාපාදයෙන් තොර වූ සිතින් පුරවා වාසය කරයි. ඔහු මෙසේ සලකයි – ‘යම් ශාස්තෘවරයෙක් මෙසේ පවසන, මෙබඳු දෘෂ්ටියක් ඇති කෙනෙක් වේ නම් – කරවන, කපන, කැපවීමට සලස්වන, පුළුස්සන, පුළුස්සවන්නට සලස්වන, ශෝක කරවන, ශෝක කරවන්නට සලස්වන, වෙහෙසට පත් කරවන, වෙහෙසට පත් කරවන්නට සලස්වන, කම්පා කරවන, කම්පා කරවන්නට සලස්වන, ප්‍රාණඝාතය කරන, නොදුන් දෙයක් ගන්නා, සොරකම් කරන, මංකොල්ල කන, නිවෙස්වලට ඇතුළු වන, මංපහරන, අනුන්ගේ භාර්යාවන් වෙත යන, බොරු කියන කල්හි පවක් සිදු වේ. තවද, යමෙක් මේ පොළොවේ සිටින ප්‍රාණීන් රැවුල් පිහියක මුවහත් කෙළවරක් බඳු චක්‍රයකින් එක මස් ගොඩක්, එක මස් පුඤ්ජයක් කරයිද, එයින් පවක් සිදු වේ, පවක් පැමිණීමක් ද ඇත. ගංගා නදියෙහි දකුණු ඉවුරට ගොස් මරමින්, මරවමින්, කපමින්, කපවමින්, පුළුස්සමින්, පුළුස්සවමින් සිටියද, එයින් පවක් සිදු වේ, පවක් පැමිණීමක් ද ඇත. ගංගා නදියෙහි උතුරු ඉවුරට ගොස් දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටියද, එයින් පිනක් සිදු වේ, පිනක් පැමිණීමක් ද ඇත. දානයෙන්, දමනයෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් සිදු වේ, පිනක් පැමිණීමක් ද ඇතැයි යමෙක් පවසයි.’ ‘යම් හෙයකින් ඒ පූජ්‍ය ශාස්තෘවරයාගේ වචනය සත්‍යයක් නම්, මට නිසැකයෙන්ම යහපතකි. මක්නිසාද යත්, මම කිසිදු චංචල වූ හෝ ස්ථාවර වූ සතෙකුට හිංසා නොකරමි. මෙහිදී මට ද්විත්ව ප්‍රතිලාභයක් ඇත, එනම්, මම කයින් සංවර වූයේ, වචනයෙන් සංවර වූයේ, සිතින් සංවර වූයේ වෙමි; තවද, කාය භේදයෙන් මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදින්නෙමි.’ ඔහුට ප්‍රමෝදය ඇතිවේ. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය උපදී. ප්‍රීතිමත් සිතක් ඇති කෙනෙකුගේ කය සන්සිඳෙයි. සන්සිඳුණු කයක් ඇති තැනැත්තාට සැප විඳියි. සැප විඳින්නාගේ සිත සමාධිමත් වේ. ගාමණි, මෙය ධර්ම සමාධියයි. යම් හෙයකින් ඔබට එහිදී චිත්ත සමාධියක් ලබාගත හැකිවේ නම්, එසේ කිරීමෙන් ඔබ මෙම සැක සහිත ස්වභාවය දුරු කරනු ඇතැයි වදාළ සේක.\n\nමෙසේ වදාළ කල්හි පාටලිය ගාමණි භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – \"භාග්‍යවතුන් වහන්ස, ඉතා මැනවි! භාග්‍යවතුන් වහන්ස, ඉතා මැනවි! ... අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Pāṭaliyasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Pāṭaliya",
      "sinhalaTitle": "පාටලිය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Gāmaṇisaṃyuttaṃ samattaṃ. Tassuddānaṃ – Caṇḍo puṭo yodhājīvo, hatthasso asibandhako; Desanā saṅkhakulaṃ maṇicūḷaṃ, bhadrarāsiyapāṭalīti.",
    "english": "The Linked Discourses with Headmen is complete. The summary of it: Caṇḍa, Puṭa, The Warrior, The Elephant Trainer, The Horse Trainer, Asibandhaka; Teaching, Conch-blower, Family, Maṇicūḷa, Bhadraka, Rāsiya, and Pāṭalī.",
    "sinhala": "ගාමණි සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: චණ්ඩ, පූට, යෝධාජීව, හත්ථාරෝහ, අස්සාරෝහ, අසිබන්ධකපුත්ත, දේසනා, සංඛධම, කුල, මණිචූළක, භද්‍රක, රාසිය සහ පාටලි සූත්‍රයි."
  }
}