{
  "id": "sn.4.7",
  "title": {
    "pali": "Cittasaṃyuttaṃ",
    "english": "The Connected Discourses on Mind",
    "sinhala": "චිත්‍තසංයුත්‍තය"
  },
  "sections": [
    {
      "number": 343,
      "pali": "Ekaṃ samayaṃ sambahulā therā bhikkhū macchikāsaṇḍe viharanti ambāṭakavane. Tena kho pana samayena sambahulānaṃ therānaṃ bhikkhūnaṃ pacchābhattaṃ piṇḍapātapaṭikkantānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā nānatthā nānābyañjanā udāhu ekatthā byañjanameva nāna’’nti? Tatrekaccehi therehi bhikkhūhi evaṃ byākataṃ hoti – ‘‘‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā nānatthā ceva nānābyañjanā cā’’ti. Ekaccehi therehi bhikkhūhi evaṃ byākataṃ hoti – ‘‘‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā ekatthā byañjanameva nāna’’nti. Tena kho pana samayena citto gahapati migapathakaṃ anuppatto hoti kenacideva karaṇīyena. Assosi kho citto gahapati sambahulānaṃ kira therānaṃ bhikkhūnaṃ pacchābhattaṃ piṇḍapātapaṭikkantānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā nānatthā nānābyañjanā udāhu ekatthā byañjanameva nāna’’nti? Tatrekaccehi therehi bhikkhūhi evaṃ byākataṃ – ‘‘‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā nānatthā ceva nānābyañjanā cā’’ti. Ekaccehi therehi bhikkhūhi evaṃ byākataṃ ‘saṃyojana’nti vā, āvuso ‘saṃyojaniyā dhammā’ti vā ime dhammā ekatthā byañjanameva nānanti. Atha kho citto gahapati yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati there bhikkhū etadavoca – ‘‘sutaṃ metaṃ, bhante, sambahulānaṃ kira therānaṃ bhikkhūnaṃ pacchābhattaṃ piṇḍapātapaṭikkantānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā nānatthā nānābyañjanā udāhu ekatthā byañjanameva nāna’’nti? Ekaccehi therehi bhikkhūhi evaṃ byākataṃ – ‘‘‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā nānatthā ceva nānābyañjanā cā’’ti. Ekaccehi therehi bhikkhūhi evaṃ byākataṃ ‘‘‘saṃyojana’nti vā, āvuso, ‘saṃyojaniyā dhammā’ti vā ime dhammā ekatthā byañjanameva nāna’’nti. ‘‘Evaṃ, gahapatī’’ti. ‘‘‘Saṃyojana’nti vā, bhante, ‘saṃyojaniyā dhammā’ti vā ime dhammā nānatthā ceva nānābyañjanā ca. Tena hi, bhante, upamaṃ vo karissāmi. Upamāyapidhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Seyyathāpi, bhante, kāḷo ca balībaddo odāto ca balībaddo ekena dāmena vā yottena vā saṃyuttā assu. Yo nu kho evaṃ vadeyya – ‘kāḷo balībaddo odātassa balībaddassa saṃyojanaṃ, odāto balībaddo kāḷassa balībaddassa saṃyojana’nti, sammā nu kho so vadamāno vadeyyā’’ti? ‘‘No hetaṃ, gahapati! Na kho, gahapati, kāḷo balībaddo odātassa balībaddassa saṃyojanaṃ, napi odāto balībaddo kāḷassa baḷībaddassa saṃyojanaṃ; yena kho te ekena dāmena vā yottena vā saṃyuttā taṃ tattha saṃyojana’’nti. ‘‘Evameva kho, bhante, na cakkhu rūpānaṃ saṃyojanaṃ, na rūpā cakkhussa saṃyojanaṃ; yañca tattha tadubhayaṃ paṭicca uppajjati chandarāgo taṃ tattha saṃyojanaṃ. Na sotaṃ saddānaṃ… na ghānaṃ gandhānaṃ… na jivhā rasānaṃ… na kāyo phoṭṭhabbānaṃ saṃyojanaṃ, na phoṭṭhabbā kāyassa saṃyojanaṃ; yañca tattha tadubhayaṃ paṭicca uppajjati chandarāgo taṃ tattha saṃyojanaṃ. Na mano dhammānaṃ saṃyojanaṃ, na dhammā manassa saṃyojanaṃ; yañca tattha tadubhayaṃ paṭicca uppajjati chandarāgo taṃ tattha saṃyojana’’nti. ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati, yassa te gambhīre buddhavacane paññācakkhu kamatī’’ti. Paṭhamaṃ.",
      "english": "At one time, many elder bhikkhus were dwelling in the Ambāṭaka Grove near Macchikāsaṇḍa. Now at that time, after their meal, having returned from their alms round, many elder bhikkhus were sitting together in the circular hall, and this discussion arose among them: \"Friends, are the terms 'fetter' (saṃyojana) and 'things that tend to fetter' (saṃyojaniyā dhammā) different in meaning and different in expression, or are they one in meaning with only different expressions?\"\n\nSome of those elder bhikkhus explained it thus: \"Friends, the terms 'fetter' and 'things that tend to fetter' are indeed different in meaning and different in expression.\" Other elder bhikkhus explained it thus: \"Friends, the terms 'fetter' and 'things that tend to fetter' are one in meaning, with only different expressions.\"\n\nNow at that time, Citta the householder had arrived at Migapathaka for some reason. Citta the householder heard that a discussion had arisen among many elder bhikkhus who, after their meal, having returned from their alms round, were sitting together in the circular hall: \"Friends, are the terms 'fetter' and 'things that tend to fetter' different in meaning and different in expression, or are they one in meaning with only different expressions?\" Some of those elder bhikkhus had explained it thus: \"Friends, the terms 'fetter' and 'things that tend to fetter' are indeed different in meaning and different in expression.\" Other elder bhikkhus had explained it thus: \"Friends, the terms 'fetter' and 'things that tend to fetter' are one in meaning, with only different expressions.\"\n\nThen Citta the householder approached those elder bhikkhus; having approached them and respectfully greeted them, he sat down to one side. Having sat down to one side, Citta the householder said to the elder bhikkhus: \"Venerable sirs, I heard that a discussion arose among many elder bhikkhus who, after their meal, having returned from their alms round, were sitting together in the circular hall: 'Friends, are the terms \"fetter\" and \"things that tend to fetter\" different in meaning and different in expression, or are they one in meaning with only different expressions?' Some of those elder bhikkhus had explained it thus: 'Friends, the terms \"fetter\" and \"things that tend to fetter\" are indeed different in meaning and different in expression.' Other elder bhikkhus had explained it thus: 'Friends, the terms \"fetter\" and \"things that tend to fetter\" are one in meaning, with only different expressions.'\" \"Yes, householder,\" they replied.\n\n\"Venerable sirs, the terms 'fetter' and 'things that tend to fetter' are indeed different in meaning and different in expression. In that case, venerable sirs, I shall offer you a simile. Through a simile, some intelligent people understand the meaning of what is said. Just as, venerable sirs, a black ox and a white ox might be yoked together by a single rope or a single harness. If someone were to say, 'The black ox is a fetter for the white ox, and the white ox is a fetter for the black ox,' would that person be speaking correctly?\" \"No, householder! The black ox is not a fetter for the white ox, nor is the white ox a fetter for the black ox. That which binds them together, the single rope or single harness, that is the fetter there.\"\n\n\"Even so, venerable sirs, neither is the eye a fetter for forms, nor are forms a fetter for the eye; but the desire and lust that arises there dependent on both of these – that is the fetter there. Neither is the ear a fetter for sounds, nor are sounds a fetter for the ear; but the desire and lust that arises there dependent on both of these – that is the fetter there. Neither is the nose a fetter for smells, nor are smells a fetter for the nose; but the desire and lust that arises there dependent on both of these – that is the fetter there. Neither is the tongue a fetter for tastes, nor are tastes a fetter for the tongue; but the desire and lust that arises there dependent on both of these – that is the fetter there. Neither is the body a fetter for tangible objects, nor are tangible objects a fetter for the body; but the desire and lust that arises there dependent on both of these – that is the fetter there. Neither is the mind a fetter for mental phenomena, nor are mental phenomena a fetter for the mind; but the desire and lust that arises there dependent on both of these – that is the fetter there.\"\n\n\"It is your gain, householder; well-gained it is for you, in whom the eye of wisdom penetrates the profound teaching of the Buddha.\"",
      "sinhala": "එක් සමයෙක බොහෝ ථෙර භික්‍ෂූහු මච්ඡිකාසණ්ඩයේ අම්බාටක වනයේ වැඩසිටියාහ. ඒ වේලාවෙහි, බොහෝ ථෙර භික්‍ෂූහු දානය වැළඳීමෙන් පසුව, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, මණ්ඩප මාලයෙහි රැස්ව වාඩි වී සිටියදී, මෙබඳු කතාබහක් ඇතිවිය: “ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් නානා අර්ථ ඇති, නානා ප්‍රකාශන ඇති ද, එසේත් නැතිනම් එක් අර්ථයක්ම ඇති, ප්‍රකාශනය පමණක් නානා වූ ද?” එහිදී ඇතැම් ථෙර භික්‍ෂූන් විසින් මෙසේ ප්‍රකාශ කරන ලදි: “ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් නානා අර්ථ ඇති, නානා ප්‍රකාශන ඇති ඒවා වෙති.” ඇතැම් ථෙර භික්‍ෂූන් විසින් මෙසේ ප්‍රකාශ කරන ලදි: “ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් එක් අර්ථයක්ම ඇති, ප්‍රකාශනය පමණක් නානා වූ ඒවා වෙති.”\n\nඒ වේලාවෙහි චිත්ත ගෘහපති යම්කිසි කාරණයක් පිණිස මගට පැමිණ සිටියේය. චිත්ත ගෘහපතිට ඇසිණි, “බොහෝ ථෙර භික්‍ෂූන්ට දානය වැළඳීමෙන් පසුව, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, මණ්ඩප මාලයෙහි රැස්ව වාඩි වී සිටියදී, මෙබඳු කතාබහක් ඇතිවූ බව: ‘ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් නානා අර්ථ ඇති, නානා ප්‍රකාශන ඇති ද, එසේත් නැතිනම් එක් අර්ථයක්ම ඇති, ප්‍රකාශනය පමණක් නානා වූ ද?’ එහිදී ඇතැම් ථෙර භික්‍ෂූන් විසින් මෙසේ ප්‍රකාශ කරන ලදි: ‘ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් නානා අර්ථ ඇති, නානා ප්‍රකාශන ඇති ඒවා වෙති.’ ඇතැම් ථෙර භික්‍ෂූන් විසින් මෙසේ ප්‍රකාශ කරන ලදි: ‘ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් එක් අර්ථයක්ම ඇති, ප්‍රකාශනය පමණක් නානා වූ ඒවා වෙති.”\n\nඉක්බිති චිත්ත ගෘහපති, ඒ ථෙර භික්‍ෂූන් වහන්සේලා වැඩසිටි තැනට පැමිණියේය. පැමිණ, ඒ ථෙර භික්‍ෂූන් වහන්සේලාට ආදරයෙන් වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ චිත්ත ගෘහපති ඒ ථෙර භික්‍ෂූන් වහන්සේලාට මෙසේ කීවේය: “ස්වාමීනි, මට අසන්නට ලැබුණා, බොහෝ ථෙර භික්‍ෂූන්ට දානය වැළඳීමෙන් පසුව, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, මණ්ඩප මාලයෙහි රැස්ව වාඩි වී සිටියදී මෙබඳු කතාබහක් ඇතිවූ බව: ‘ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් නානා අර්ථ ඇති, නානා ප්‍රකාශන ඇති ද, එසේත් නැතිනම් එක් අර්ථයක්ම ඇති, ප්‍රකාශනය පමණක් නානා වූ ද?’ එහිදී ඇතැම් ථෙර භික්‍ෂූන් විසින් මෙසේ ප්‍රකාශ කරන ලදි: ‘ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් නානා අර්ථ ඇති, නානා ප්‍රකාශන ඇති ඒවා වෙති.’ ඇතැම් ථෙර භික්‍ෂූන් විසින් මෙසේ ප්‍රකාශ කරන ලදි: ‘ආයුෂ්මතුනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් එක් අර්ථයක්ම ඇති, ප්‍රකාශනය පමණක් නානා වූ ඒවා වෙති.” “එසේය, ගෘහපතිය.”\n\n“ස්වාමීනි, ‘සංයෝජනය’ යයිද, ‘සංයෝජනීය ධර්ම’ යයිද යන මේ ධර්මයන් නානා අර්ථ ඇති, නානා ප්‍රකාශන ඇති ඒවා වෙති. එහෙයින් ස්වාමීනි, මම ඔබට උපමාවක් ගෙනහැර දක්වන්නෙමි. උපමාවකින් ද ඇතැම් නුවණැති පුරුෂයෝ දේශනා කරන ලද අර්ථය අවබෝධ කරගනිති. ස්වාමීනි, යම්සේ කළු ගවයෙකුත්, සුදු ගවයෙකුත් එක් පටියකින් හෝ වියගසකින් (පොටකින්) බඳන ලද්දාහු වෙත් නම්, යම් කෙනෙක් මෙසේ කියන්නේ නම්, ‘කළු ගවයා සුදු ගවයාට සංයෝජනයකි, සුදු ගවයා කළු ගවයාට සංයෝජනයකි’ කියා, ඔහු නිවැරදිව කියන්නේ වේද?”\n\n“එසේ නොවේ, ගෘහපතිය! ගෘහපතිය, කළු ගවයා සුදු ගවයාට සංයෝජනයක් නොවේ, සුදු ගවයා ද කළු ගවයාට සංයෝජනයක් නොවේ. යම්කිසි එක් පටියකින් හෝ වියගසකින් ඔවුන් බැඳ තිබේ ද, ඒ දේ එහි සංයෝජනයයි.”\n\n“එසේමයි ස්වාමීනි, ඇස රූපයන්ට සංයෝජනයක් නොවේ, රූපයන් ද ඇසට සංයෝජනයක් නොවේ. යම්කිසි දෙයක් එහි ඒ දෙක (ඇස සහ රූප) හේතු කොටගෙන උපදින ඡන්දරාගය (කැමැත්ත සහ ඇලීම) වේද, ඒ දේ එහි සංයෝජනයයි. කණ ශබ්දයන්ට සංයෝජනයක් නොවේ... නාසය ගන්ධයන්ට සංයෝජනයක් නොවේ... දිව රසයන්ට සංයෝජනයක් නොවේ... කය ස්පර්ශයන්ට සංයෝජනයක් නොවේ, ස්පර්ශයෝ ද කයට සංයෝජනයක් නොවේ. යම්කිසි දෙයක් එහි ඒ දෙක හේතු කොටගෙන උපදින ඡන්දරාගය වේද, ඒ දේ එහි සංයෝජනයයි. මනස ධර්මයන්ට සංයෝජනයක් නොවේ, ධර්මයෝ ද මනසට සංයෝජනයක් නොවේ. යම්කිසි දෙයක් එහි ඒ දෙක හේතු කොටගෙන උපදින ඡන්දරාගය වේද, ඒ දේ එහි සංයෝජනයයි.”\n\n“ගෘහපතිය, ඔබට ලාභයකි. ගෘහපතිය, ඔබට මනා කොට ලැබුණකි. යම් හෙයකින් ගැඹුරු බුද්ධ වචනයෙහි ඔබේ ප්‍රඥා චක්‍ෂුව (නුවණැස) ක්‍රියාත්මක වේ ද.” පළමුවැන්නයි.",
      "paliTitle": "Saṃyojanasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Fetters",
      "sinhalaTitle": "සංයෝජන සූත්‍රය"
    },
    {
      "number": 344,
      "pali": "Ekaṃ samayaṃ sambahulā therā bhikkhū macchikāsaṇḍe viharanti ambāṭakavane. Atha kho citto gahapati yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati there bhikkhū etadavoca – ‘‘adhivāsentu me, bhante, therā svātanāya bhatta’’nti. Adhivāsesuṃ kho therā bhikkhū tuṇhībhāvena. Atha kho citto gahapati therānaṃ bhikkhūnaṃ adhivāsanaṃ viditvā uṭṭhāyāsanā there bhikkhū abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho therā bhikkhū tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena cittassa gahapatissa nivesanaṃ tenupasaṅkamiṃsu; upasaṅkamitvā paññatte āsane nisīdiṃsu. Atha kho citto gahapati yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati āyasmantaṃ theraṃ etadavoca – ‘‘‘dhātunānattaṃ, dhātunānatta’nti, bhante thera, vuccati. Kittāvatā nu kho, bhante, dhātunānattaṃ vuttaṃ bhagavatā’’ti? Evaṃ vutte āyasmā thero tuṇhī ahosi. Dutiyampi kho citto gahapati āyasmantaṃ theraṃ etadavoca – ‘‘‘dhātunānattaṃ, dhātunānatta’nti, bhante thera, vuccati. Kittāvatā nu kho, bhante, dhātunānattaṃ vuttaṃ bhagavatā’’ti? Dutiyampi kho āyasmā thero tuṇhī ahosi. Tatiyampi kho citto gahapati āyasmantaṃ theraṃ etadavoca – ‘‘‘dhātunānattaṃ, dhātunānatta’nti, bhante thera, vuccati. Kittāvatā nu kho, bhante, dhātunānattaṃ vuttaṃ bhagavatā’’ti? Tatiyampi kho āyasmā thero tuṇhī ahosi. Tena kho pana samayena āyasmā isidatto tasmiṃ bhikkhusaṅghe sabbanavako hoti. Atha kho āyasmā isidatto āyasmantaṃ theraṃ etadavoca – ‘‘byākaromahaṃ, bhante thera, cittassa gahapatino etaṃ pañha’’nti? ‘‘Byākarohi tvaṃ, āvuso isidatta, cittassa gahapatino etaṃ pañha’’nti. ‘‘Evañhi tvaṃ, gahapati, pucchasi – ‘dhātunānattaṃ, dhātunānattanti, bhante thera, vuccati. Kittāvatā nu kho, bhante, dhātunānattaṃ, vuttaṃ bhagavatā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Idaṃ kho, gahapati, dhātunānattaṃ vuttaṃ bhagavatā – cakkhudhātu, rūpadhātu, cakkhuviññāṇadhātu…pe… manodhātu, dhammadhātu, manoviññāṇadhātu. Ettāvatā kho, gahapati, dhātunānattaṃ vuttaṃ bhagavatā’’ti. Atha kho citto gahapati āyasmato isidattassa bhāsitaṃ abhinanditvā anumoditvā there bhikkhū paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho therā bhikkhū bhuttāvino onītapattapāṇino uṭṭhāyāsanā pakkamiṃsu. Atha kho āyasmā thero āyasmantaṃ isidattaṃ etadavoca – ‘‘sādhu kho taṃ, āvuso isidatta, eso pañho paṭibhāsi, neso pañho maṃ paṭibhāsi. Tenahāvuso isidatta, yadā aññathāpi [yadā aññadāpi (sī. pī.) aññadāpi (?)] evarūpo pañho āgaccheyya, taññevettha paṭibhāseyyā’’ti. Dutiyaṃ.",
      "english": "At one time, many elder monks were dwelling in the Ambāṭaka Grove near Macchikāsaṇḍa. Then, Citta the householder approached where the elder monks were; having approached, he paid respects to the elder monks and sat down to one side. As he sat to one side, Citta the householder said to the elder monks, \"Sirs, please accept tomorrow's meal from me.\" The elder monks accepted by their silence. Then, Citta the householder, understanding the elder monks' acceptance, rose from his seat, paid respects to the elder monks, circumambulated them respectfully, and departed.\n\nThen, when that night had passed, in the morning the elder monks, having dressed and taken their bowls and robes, approached Citta the householder's dwelling; having approached, they sat down on the seats prepared for them. Then, Citta the householder approached where the elder monks were; having approached, he paid respects to the elder monks and sat down to one side. As he sat to one side, Citta the householder said to a certain venerable elder, \"Venerable sir, it is said, 'diversity of elements, diversity of elements.' To what extent, venerable sir, has the Blessed One spoken of the diversity of elements?\" When this was said, the venerable elder remained silent. A second time Citta the householder said to the venerable elder, \"Venerable sir, it is said, 'diversity of elements, diversity of elements.' To what extent, venerable sir, has the Blessed One spoken of the diversity of elements?\" A second time the venerable elder remained silent. A third time Citta the householder said to the venerable elder, \"Venerable sir, it is said, 'diversity of elements, diversity of elements.' To what extent, venerable sir, has the Blessed One spoken of the diversity of elements?\" A third time the venerable elder remained silent.\n\nNow at that time, Venerable Isidatta was the youngest of that assembly of monks. Then Venerable Isidatta said to the venerable elder, \"Venerable sir, may I explain this question for Citta the householder?\" \"Please do explain this question for Citta the householder, friend Isidatta,\" replied the venerable elder. Then he said, \"Householder, you are asking this: 'Venerable sir, it is said, \"diversity of elements, diversity of elements.\" To what extent, venerable sir, has the Blessed One spoken of the diversity of elements?'\" \"Yes, venerable sir,\" he replied. \"Indeed, householder, this is the extent to which the diversity of elements has been spoken of by the Blessed One: the eye element, the visible form element, the eye-consciousness element... and so on... the mind element, the mental phenomena element, the mind-consciousness element. It is to this extent, householder, that the diversity of elements has been spoken of by the Blessed One.\"\n\nThen, Citta the householder, having approved and rejoiced in the words of Venerable Isidatta, personally served and satisfied the elder monks with exquisite hard and soft foods. Then, the elder monks, having finished their meal and removed their hands from their bowls, rose from their seats and departed.\n\nThen the venerable elder said to Venerable Isidatta, \"It is excellent, friend Isidatta, that this question occurred to you, for it did not occur to me. Therefore, friend Isidatta, whenever such a question arises on another occasion, you should explain it then.\"",
      "sinhala": "එක් සමයෙක බොහෝ තෙර භික්ෂූහු මච්ඡිකාසණ්ඩ නම් නගරයේ අම්බටකවනයෙහි වාසය කළහ. එල්බතෙක් චිත්ත ගෘහපති තෙමේ යම් තැනෙක තෙර භික්ෂූහු වැඩසිටියාහු ද එතැනට පැමිණියේය. පැමිණ, තෙර භික්ෂූන්ට ආචාර කොට එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි චිත්ත ගෘහපති තෙමේ තෙර භික්ෂූන්ට මෙසේ කීවේය: \"වහන්ස, තෙරවරු හෙට දිනය සඳහා මගේ දානය පිළිගන්නා සේක්වා!\" තෙර භික්ෂූහු නිශ්ශබ්දතාවයෙන් (එය) පිළිගත්හ. එල්බතෙක් චිත්ත ගෘහපති තෙමේ තෙර භික්ෂූන්ගේ පිළිගැනීම දැන, ආසනයෙන් නැගිට, තෙර භික්ෂූන්ට ආචාර කොට, පැදකුණු කොට පිටත්ව ගියේය.\n\nඑල්බතෙක් තෙර භික්ෂූහු ඒ රාත්‍රිය ඉක්ම ගිය පසු පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන, යම් තැනෙක චිත්ත ගෘහපතිගේ නිවස පිහිටියේද එතැනට පැමිණියාහුය. පැමිණ, පනවන ලද අසුන්වල වාඩි වූහ. එල්බතෙක් චිත්ත ගෘහපති තෙමේ යම් තැනෙක තෙර භික්ෂූහු වැඩසිටියාහු ද එතැනට පැමිණියේය. පැමිණ, තෙර භික්ෂූන්ට ආචාර කොට එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි චිත්ත ගෘහපති තෙමේ ආයුෂ්මත් තෙරුන්ට මෙසේ කීවේය: \"වහන්ස, තෙරුන් වහන්ස, 'ධාතූන්ගේ නානත්වය, ධාතූන්ගේ නානත්වය' යැයි කියනු ලැබේ. වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ධාතූන්ගේ නානත්වය කෙතරම් ප්‍රමාණයකින් දේශනා කර ඇත්ද?\" මෙසේ කී කල්හි ආයුෂ්මත් තෙරුන් වහන්සේ නිහඬ විය. දෙවන වරටත් චිත්ත ගෘහපති තෙමේ ආයුෂ්මත් තෙරුන්ට මෙසේ කීවේය: \"වහන්ස, තෙරුන් වහන්ස, 'ධාතූන්ගේ නානත්වය, ධාතූන්ගේ නානත්වය' යැයි කියනු ලැබේ. වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ධාතූන්ගේ නානත්වය කෙතරම් ප්‍රමාණයකින් දේශනා කර ඇත්ද?\" දෙවන වරටත් ආයුෂ්මත් තෙරුන් වහන්සේ නිහඬ විය. තුන්වන වරටත් චිත්ත ගෘහපති තෙමේ ආයුෂ්මත් තෙරුන්ට මෙසේ කීවේය: \"වහන්ස, තෙරුන් වහන්ස, 'ධාතූන්ගේ නානත්වය, ධාතූන්ගේ නානත්වය' යැයි කියනු ලැබේ. වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ධාතූන්ගේ නානත්වය කෙතරම් ප්‍රමාණයකින් දේශනා කර ඇත්ද?\" තුන්වන වරටත් ආයුෂ්මත් තෙරුන් වහන්සේ නිහඬ විය.\n\nඑකල්හි ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ ඒ භික්ෂු සංඝයා අතර සියලු දෙනාටම වඩා නවක තෙරණුවෝ වූහ. එල්බතෙක් ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ (ජ්‍යෙෂ්ඨ) ආයුෂ්මත් තෙරුන්ට මෙසේ කීහ: \"වහන්ස, තෙරුන් වහන්ස, චිත්ත ගෘහපතිගේ මේ ප්‍රශ්නය මා විසින් විස්තර කළ හැකිද?\" \"ඇවැත් ඉසිදත්ත, ඔබ චිත්ත ගෘහපතිගේ මේ ප්‍රශ්නය විස්තර කරන්න\" යැයි කීහ. \"ගෘහපතිය, ඔබ මෙසේ අසන සේක් ද: 'වහන්ස, තෙරුන් වහන්ස, \"ධාතූන්ගේ නානත්වය, ධාතූන්ගේ නානත්වය\" යැයි කියනු ලැබේ. වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ධාතූන්ගේ නානත්වය කෙතරම් ප්‍රමාණයකින් දේශනා කර ඇත්ද?'\" \"එසේය, වහන්ස\" යැයි චිත්ත ගෘහපති කීවේය. \"ගෘහපතිය, භාග්‍යවතුන් වහන්සේ විසින් ධාතූන්ගේ නානත්වය මෙසේ දේශනා කර ඇත: චක්ඛු ධාතුව, රූප ධාතුව, චක්ඛු විඤ්ඤාණ ධාතුව ... (සෙසු ධාතුද සහිතව) ... මනෝ ධාතුව, ධම්ම ධාතුව, මනෝ විඤ්ඤාණ ධාතුව වශයෙනි. ගෘහපතිය, මෙපමණ ප්‍රමාණයකින් භාග්‍යවතුන් වහන්සේ විසින් ධාතූන්ගේ නානත්වය දේශනා කර ඇත\" යැයි කීවේය. එල්බතෙක් චිත්ත ගෘහපති තෙමේ ආයුෂ්මත් ඉසිදත්ත තෙරුන්ගේ භාෂිතය අභිනන්දනය කොට අනුමෝදන් වී, තෙර භික්ෂූන් වහන්සේලා ප්‍රණීත වූ කෑ යුතු, බුදිය යුතු දේවලින් තම දෑතින් සතුටු කළේය, පිනවූයේය. එල්බතෙක් තෙර භික්ෂූහු අනුභව කොට අවසන් වූ පසු, පාත්‍රය අතින් පහ කොට (එනම් පාත්‍රය ගෙන ආහාර අනුභව කිරීම අවසන් වූ පසු), අසුන්වලින් නැගිට පිටත්ව ගියාහුය. එල්බතෙක් ආයුෂ්මත් (ජ්‍යෙෂ්ඨ) තෙරුන් වහන්සේ ආයුෂ්මත් ඉසිදත්ත තෙරුන්ට මෙසේ කීහ: \"ඇවැත් ඉසිදත්ත, ඔබ විසින් මේ ප්‍රශ්නයට යහපත් ලෙස පිළිතුරු දෙනු ලැබුවේය. මේ ප්‍රශ්නය මා හට සිහිපත් නොවීය. එබැවින් ඇවැත් ඉසිදත්ත, යම් කලෙක මෙවැනි වෙනත් ප්‍රශ්නයක් පැමිණෙන්නේ නම්, ඔබම ඊට පිළිතුරු දෙනු මැනැව!\"",
      "paliTitle": "Paṭhamaisidattasuttaṃ",
      "vagga": "",
      "englishTitle": "The First Discourse to Isidatta",
      "sinhalaTitle": "පළමු ඉසිදත්ත සූත්‍රය"
    },
    {
      "number": 345,
      "pali": "Ekaṃ samayaṃ sambahulā therā bhikkhū macchikāsaṇḍe viharanti ambāṭakavane. Atha kho citto gahapati yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati there bhikkhū etadavoca – ‘‘adhivāsentu me, bhante therā, svātanāya bhatta’’nti. Adhivāsesuṃ kho therā bhikkhū tuṇhībhāvena. Atha kho citto gahapati therānaṃ bhikkhūnaṃ adhivāsanaṃ viditvā uṭṭhāyāsanā there bhikkhū abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho therā bhikkhū tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena cittassa gahapatissa nivesanaṃ tenupasaṅkamiṃsu; upasaṅkamitvā paññatte āsane nisīdiṃsu. Atha kho citto gahapati yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati āyasmantaṃ theraṃ etadavoca – ‘‘yā imā, bhante thera, anekavihitā diṭṭhiyo loke uppajjanti – ‘sassato lokoti vā, asassato lokoti vā, antavā lokoti vā, anantavā lokoti vā, taṃ jīvaṃ taṃ sarīranti vā, aññaṃ jīvaṃ aññaṃ sarīranti vā, hoti tathāgato paraṃ maraṇāti vā, na hoti tathāgato paraṃ maraṇāti vā, hoti ca na ca hoti tathāgato paraṃ maraṇāti vā, neva hoti na na hoti tathāgato paraṃ maraṇā’ti vā. Yāni cimāni dvāsaṭṭhi diṭṭhigatāni brahmajāle bhaṇitāni; imā nu kho, bhante, diṭṭhiyo kismiṃ sati honti, kismiṃ asati na hontī’’ti? Evaṃ vutte, āyasmā thero tuṇhī ahosi. Dutiyampi kho citto gahapati…pe… tatiyampi kho citto gahapati āyasmantaṃ theraṃ etadavoca – ‘‘yā imā, bhante thera, anekavihitā diṭṭhiyo loke uppajjanti – sassato lokoti vā, asassato lokoti vā, antavā lokoti vā, anantavā lokoti vā, taṃ jīvaṃ taṃ sarīranti vā, aññaṃ jīvaṃ aññaṃ sarīranti vā, hoti tathāgato paraṃ maraṇāti vā, na hoti tathāgato paraṃ maraṇāti vā, hoti ca na ca hoti tathāgato paraṃ maraṇāti vā, neva hoti na na hoti tathāgato paraṃ maraṇāti vā. Yāni cimāni dvāsaṭṭhi diṭṭhigatāni brahmajāle bhaṇitāni; imā nu kho, bhante, diṭṭhiyo kismiṃ sati honti, kismiṃ asati na hontī’’ti? Tatiyampi kho āyasmā thero tuṇhī ahosi. Tena kho pana samayena āyasmā isidatto tasmiṃ bhikkhusaṅghe sabbanavako hoti. Atha kho āyasmā isidatto āyasmantaṃ theraṃ etadavoca – ‘‘byākaromahaṃ, bhante thera, cittassa gahapatino etaṃ pañha’’nti? ‘‘Byākarohi tvaṃ, āvuso isidatta, cittassa gahapatino etaṃ pañha’’nti. ‘‘Evañhi tvaṃ, gahapati, pucchasi – ‘yā imā, bhante thera, anekavihitā diṭṭhiyo loke uppajjanti – sassato lokoti vā… pe…; imā nu kho, bhante, diṭṭhiyo kismiṃ sati honti, kismiṃ asati na hontī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yā imā, gahapati, anekavihitā diṭṭhiyo loke uppajjanti – ‘sassato lokoti vā, asassato lokoti vā, antavā lokoti vā anantavā lokoti vā, taṃ jīvaṃ taṃ sarīranti vā, aññaṃ jīvaṃ aññaṃ sarīranti vā, hoti tathāgato paraṃ maraṇāti vā, na hoti tathāgato paraṃ maraṇāti vā, hoti ca na ca hoti tathāgato paraṃ maraṇāti vā, neva hoti na na hoti tathāgato paraṃ maraṇāti vā. Yāni cimāni dvāsaṭṭhi diṭṭhigatāni brahmajāle bhaṇitāni; imā kho, gahapati, diṭṭhiyo sakkāyadiṭṭhiyā sati honti, sakkāyadiṭṭhiyā asati na hontī’’’ti. ‘‘Kathaṃ pana, bhante, sakkāyadiṭṭhi hotī’’ti? ‘‘Idha, gahapati, assutavā puthujjano ariyānaṃ adassāvī ariyadhammassa akovido ariyadhamme avinīto, sappurisānaṃ adassāvī sappurisadhammassa akovido sappurisadhamme avinīto rūpaṃ attato samanupassati, rūpavantaṃ vā attānaṃ, attani vā rūpaṃ, rūpasmiṃ vā attānaṃ; vedanaṃ attato samanupassati…pe… saññaṃ… saṅkhāre… viññāṇaṃ attato samanupassati, viññāṇavantaṃ vā attānaṃ, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Evaṃ kho, gahapati, sakkāyadiṭṭhi hotī’’ti. ‘‘Kathaṃ pana, bhante, sakkāyadiṭṭhi na hotī’’ti? ‘‘Idha, gahapati, sutavā ariyasāvako ariyānaṃ dassāvī ariyadhammassa kovido ariyadhamme suvinīto sappurisānaṃ dassāvī sappurisadhammassa kovido sappurisadhamme suvinīto na rūpaṃ attato samanupassati, na rūpavantaṃ vā attānaṃ, na attani vā rūpaṃ, na rūpasmiṃ vā attānaṃ; na vedanaṃ… na saññaṃ… na saṅkhāre… na viññāṇaṃ attato samanupassati, na viññāṇavantaṃ vā attānaṃ, na attani vā viññāṇaṃ, na viññāṇasmiṃ vā attānaṃ. Evaṃ kho, gahapati, sakkāyadiṭṭhi na hotī’’ti. ‘‘Kuto, bhante, ayyo isidatto āgacchatī’’ti? ‘‘Avantiyā kho, gahapati, āgacchāmī’’ti. ‘‘Atthi, bhante, avantiyā isidatto nāma kulaputto amhākaṃ adiṭṭhasahāyo pabbajito? Diṭṭho so āyasmatā’’ti? ‘‘Evaṃ, gahapatī’’ti. ‘‘Kahaṃ nu kho so, bhante, āyasmā etarahi viharatī’’ti? Evaṃ vutte, āyasmā isidatto tuṇhī ahosi. ‘‘Ayyo no, bhante, isidatto’’ti? ‘‘Evaṃ, gahapatī’’ti. ‘‘Abhiramatu, bhante, ayyo isidatto macchikāsaṇḍe. Ramaṇīyaṃ ambāṭakavanaṃ. Ahaṃ ayyassa isidattassa ussukkaṃ karissāmi cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārāna’’nti. ‘‘Kalyāṇaṃ vuccati, gahapatī’’ti. Atha kho citto gahapati āyasmato isidattassa bhāsitaṃ abhinanditvā anumoditvā there bhikkhū paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho therā bhikkhū bhuttāvino onītapattapāṇino uṭṭhāyāsanā pakkamiṃsu. Atha kho āyasmā thero āyasmantaṃ isidattaṃ etadavoca – ‘‘sādhu kho taṃ, āvuso isidatta, eso pañho paṭibhāsi. Neso pañho maṃ paṭibhāsi. Tenahāvuso isidatta, yadā aññathāpi evarūpo pañho āgaccheyya, taññevettha paṭibhāseyyā’’ti. Atha kho āyasmā isidatto senāsanaṃ saṃsāmetvā pattacīvaramādāya macchikāsaṇḍamhā pakkāmi. Yaṃ macchikāsaṇḍamhā pakkāmi, tathā pakkantova ahosi, na puna paccāgacchīti. Tatiyaṃ.",
      "english": "At one time, many elder monks were staying in the Ambāṭaka Wood at Macchikāsaṇḍa. Then Citta the householder approached those elder monks; having approached them, he respectfully saluted the elder monks and sat down to one side. Sitting to one side, Citta the householder said to the elder monks, \"Venerable sirs, may the elder monks consent to accept my meal tomorrow.\" The elder monks consented by remaining silent. Then Citta the householder, understanding the elder monks' consent, rose from his seat, saluted the elder monks, circumambulated them respectfully, and departed.\n\nThen, when that night had passed, in the morning, the elder monks dressed, took their bowls and robes, and went to Citta the householder's residence; having arrived, they sat down on the prepared seats. Then Citta the householder approached those elder monks; having approached them, he respectfully saluted the elder monks and sat down to one side. Sitting to one side, Citta the householder said to an elder venerable, \"Venerable elder, these various views that arise in the world — such as 'the world is eternal,' or 'the world is not eternal,' or 'the world is finite,' or 'the world is infinite,' or 'the soul is the same as the body,' or 'the soul is one thing and the body another,' or 'the Tathāgata exists after death,' or 'the Tathāgata does not exist after death,' or 'the Tathāgata both exists and does not exist after death,' or 'the Tathāgata neither exists nor does not exist after death' — these sixty-two speculative views that are taught in the Brahmajāla Sutta; do these views arise, venerable sir, when what is present, and do they not arise when what is absent?\"\n\nWhen this was said, the venerable elder remained silent. A second time Citta the householder said to the venerable elder, \"Venerable elder, these various views that arise in the world — such as 'the world is eternal,' or 'the world is not eternal,' or 'the world is finite,' or 'the world is infinite,' or 'the soul is the same as the body,' or 'the soul is one thing and the body another,' or 'the Tathāgata exists after death,' or 'the Tathāgata does not exist after death,' or 'the Tathāgata both exists and does not exist after death,' or 'the Tathāgata neither exists nor does not exist after death' — these sixty-two speculative views that are taught in the Brahmajāla Sutta; do these views arise, venerable sir, when what is present, and do they not arise when what is absent?\" A third time the venerable elder remained silent.\n\nNow at that time, Venerable Isidatta was the youngest of that community of monks. Then Venerable Isidatta said to the venerable elder, \"Venerable elder, may I answer Citta the householder's question?\" \"Answer that question for Citta the householder, friend Isidatta,\" said the elder. \"Indeed, householder, you are asking, 'Venerable elder, these various views that arise in the world — such as 'the world is eternal,' or 'the world is not eternal,' or 'the world is finite,' or 'the world is infinite,' or 'the soul is the same as the body,' or 'the soul is one thing and the body another,' or 'the Tathāgata exists after death,' or 'the Tathāgata does not exist after death,' or 'the Tathāgata both exists and does not exist after death,' or 'the Tathāgata neither exists nor does not exist after death' — do these views arise, venerable sir, when what is present, and do they not arise when what is absent?'\" \"Yes, venerable sir.\"\n\n\"Householder, these various views that arise in the world — such as 'the world is eternal,' or 'the world is not eternal,' or 'the world is finite,' or 'the world is infinite,' or 'the soul is the same as the body,' or 'the soul is one thing and the body another,' or 'the Tathāgata exists after death,' or 'the Tathāgata does not exist after death,' or 'the Tathāgata both exists and does not exist after death,' or 'the Tathāgata neither exists nor does not exist after death' — these sixty-two speculative views that are taught in the Brahmajāla Sutta; these views, householder, arise when the view of self-identity is present, and they do not arise when the view of self-identity is absent.\"\n\n\"But how, venerable sir, does the view of self-identity arise?\" \"Here, householder, an untaught ordinary person, who is not skilled in seeing the Noble Ones, not conversant with the Noble Dhamma, and undisciplined in the Noble Dhamma; who is not skilled in seeing good persons, not conversant with the Dhamma of good persons, and undisciplined in the Dhamma of good persons — regards form as self, or self as possessing form, or form as being in self, or self as being in form. He regards feeling as self, or self as possessing feeling, or feeling as being in self, or self as being in feeling. He regards perception as self, or self as possessing perception, or perception as being in self, or self as being in perception. He regards volitional formations as self, or self as possessing volitional formations, or volitional formations as being in self, or self as being in volitional formations. He regards consciousness as self, or self as possessing consciousness, or consciousness as being in self, or self as being in consciousness. This, householder, is how the view of self-identity arises.\"\n\n\"But how, venerable sir, does the view of self-identity not arise?\" \"Here, householder, a well-taught noble disciple, who is skilled in seeing the Noble Ones, conversant with the Noble Dhamma, and well-disciplined in the Noble Dhamma; who is skilled in seeing good persons, conversant with the Dhamma of good persons, and well-disciplined in the Dhamma of good persons — does not regard form as self, or self as possessing form, or form as being in self, or self as being in form. He does not regard feeling as self, or self as possessing feeling, or feeling as being in self, or self as being in feeling. He does not regard perception as self, or self as possessing perception, or perception as being in self, or self as being in perception. He does not regard volitional formations as self, or self as possessing volitional formations, or volitional formations as being in self, or self as being in volitional formations. He does not regard consciousness as self, or self as possessing consciousness, or consciousness as being in self, or self as being in consciousness.\"\n\nThus, householder, there is no identity view.\n“From where, Venerable Sir, does the venerable Isidatta come?”\n“Indeed, householder, I come from Avanti.”\n“Venerable Sir, is there a clansman named Isidatta from Avanti, an unseen friend of ours, who has gone forth? Has he been seen by the venerable one?”\n“Yes, householder.”\n“Indeed, Venerable Sir, where does that venerable one reside now?”\nWhen this was said, the venerable Isidatta remained silent.\n“Venerable Sir, are you Isidatta?”\n“Yes, householder.”\n“May the venerable Isidatta delight in Macchikāsaṇḍa. The Ambāṭaka Grove is charming. I will diligently attend to the venerable Isidatta’s requisites of robes, almsfood, lodging, and medicinal provisions for the sick.”\n“That is well said, householder.”\n\nThen, Citta the householder, having rejoiced in and approved of the venerable Isidatta’s discourse, personally served and satisfied the elder monks with choice hard and soft foods. Then the elder monks, having finished their meal and withdrawn their hands from their bowls, rose from their seats and departed.\n\nThen the elder Venerable said to the venerable Isidatta, “It was good, friend Isidatta, that this question occurred to you. This question did not occur to me. Therefore, friend Isidatta, whenever such a question arises on another occasion, you yourself should answer it.” Then the venerable Isidatta, having put away his lodging, and taking his bowl and robe, departed from Macchikāsaṇḍa. Having departed from Macchikāsaṇḍa, he remained departed and never returned. Thus concludes the third section.",
      "sinhala": "එක් සමයෙක බොහෝ තෙරණුවෝ භික්ෂූහු මච්ඡිකාසණ්ඩයේ අම්බාටක වනයෙහි වැඩවසති. එකල්හී චිත්ත ගෘහපතියා යම් තැනක තෙරණුවෝ භික්ෂූහු වැඩසිටියාහුද, එතැනට පැමිණ, ඒ තෙරණුවන් භික්ෂූන්ට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි චිත්ත ගෘහපතියා ඒ තෙරණුවෝ භික්ෂූන්ට මෙසේ කීවේය: \"පින්වත් ස්වාමීන් වහන්සලා, හෙට දවස සඳහා මගේ දානය භාරගන්නා සේක්වා!\" ඒ තෙරණුවෝ භික්ෂූහු නිශ්ශබ්දතාවයෙන් භාරගත්හ. එකල්හී චිත්ත ගෘහපතියා ඒ තෙරණුවෝ භික්ෂූන්ගේ භාරගැනීම දැන, අසුනෙන් නැගිට, ඒ තෙරණුවෝ භික්ෂූන්ට වන්දනා කොට, ප්‍රදක්ෂිණා කොට පිටත්ව ගියේය. එකල්හී ඒ තෙරණුවෝ භික්ෂූහු ඒ රාත්‍රිය ඉක්ම ගිය පසු, පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු රැගෙන, යම් තැනක චිත්ත ගෘහපතියාගේ නිවස පිහිටියේද, එතැනට වැඩම කළහ. වැඩම කොට, පනවන ලද අසුන්හි වැඩසිටියහ. එකල්හී චිත්ත ගෘහපතියා යම් තැනක තෙරණුවෝ භික්ෂූහු වැඩසිටියාහුද, එතැනට පැමිණ, ඒ තෙරණුවන් භික්ෂූන්ට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි චිත්ත ගෘහපතියා ආයුෂ්මත් තෙරුන්ට මෙසේ කීවේය: \"පින්වත් ස්වාමීන් වහන්ස, මේ යම් නොයෙක් ආකාර දෘෂ්ටි ලෝකයේ පහළ වෙත්ද, එනම්: 'ලෝකය සදාකාලිකය' යනු ද, 'ලෝකය අසදාකාලිකය' යනු ද, 'ලෝකයට සීමාවක් ඇත' යනු ද, 'ලෝකයට සීමාවක් නැත' යනු ද, 'ඒ ජීවයම ඒ ශරීරය' යනු ද, 'ජීවය වෙනය, ශරීරය වෙනය' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත්' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩ නොසිටිත්' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත් ද වැඩ නොසිටිත් ද' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත් ද නොසිටිත් ද නොවේ' යනු ද යන මේ යම් හැටදෙකක් වූ දෘෂ්ටි බ්‍රහ්මජාල සූත්‍රයෙහි දේශනා කළේද, පින්වත් ස්වාමීන් වහන්ස, මේ දෘෂ්ටි කවරක් තිබෙන කල්හි ඇති වෙත්ද, කවරක් නැති කල්හි ඇති නොවේද?\" මෙසේ කී කල්හි ආයුෂ්මත් තෙරණුවෝ නිශ්ශබ්ද වූහ. දෙවෙනි වරටත් චිත්ත ගෘහපතියා... තෙවෙනි වරටත් චිත්ත ගෘහපතියා ආයුෂ්මත් තෙරුන්ට මෙසේ කීවේය: \"පින්වත් ස්වාමීන් වහන්ස, මේ යම් නොයෙක් ආකාර දෘෂ්ටි ලෝකයේ පහළ වෙත්ද, එනම්: 'ලෝකය සදාකාලිකය' යනු ද, 'ලෝකය අසදාකාලිකය' යනු ද, 'ලෝකයට සීමාවක් ඇත' යනු ද, 'ලෝකයට සීමාවක් නැත' යනු ද, 'ඒ ජීවයම ඒ ශරීරය' යනු ද, 'ජීවය වෙනය, ශරීරය වෙනය' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත්' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩ නොසිටිත්' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත් ද වැඩ නොසිටිත් ද' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත් ද නොසිටිත් ද නොවේ' යනු ද යන මේ යම් හැටදෙකක් වූ දෘෂ්ටි බ්‍රහ්මජාල සූත්‍රයෙහි දේශනා කළේද, පින්වත් ස්වාමීන් වහන්ස, මේ දෘෂ්ටි කවරක් තිබෙන කල්හි ඇති වෙත්ද, කවරක් නැති කල්හි ඇති නොවේද?\" තෙවෙනි වරටත් ආයුෂ්මත් තෙරණුවෝ නිශ්ශබ්ද වූහ. එකල්හී ඒ සමයෙහි ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ ඒ භික්ෂු සංඝයා අතරින් සියල්ලටම අලුතින් පැවිදි වූ නවාගත භික්ෂුව වූහ. එකල්හී ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ ආයුෂ්මත් තෙරුන්ට මෙසේ කීවේය: \"පින්වත් ස්වාමීන් වහන්ස, මම චිත්ත ගෘහපතියාගේ මේ ප්‍රශ්නයට පිළිතුරු දෙන්නද?\" \"ඇවැත් ඉසිදත්ත, ඔබ චිත්ත ගෘහපතියාගේ මේ ප්‍රශ්නයට පිළිතුරු දෙන්න.\" \"ගෘහපතිය, ඔබ මෙසේ අසන්නෙහිය: 'පින්වත් ස්වාමීන් වහන්ස, මේ යම් නොයෙක් ආකාර දෘෂ්ටි ලෝකයේ පහළ වෙත්ද, එනම්: 'ලෝකය සදාකාලිකය' යනු ද... (ආදී වශයෙන්)... පින්වත් ස්වාමීන් වහන්ස, මේ දෘෂ්ටි කවරක් තිබෙන කල්හි ඇති වෙත්ද, කවරක් නැති කල්හි ඇති නොවේද?'\" \"එසේය, පින්වත් ස්වාමීන් වහන්ස.\" \"ගෘහපතිය, මේ යම් නොයෙක් ආකාර දෘෂ්ටි ලෝකයේ පහළ වෙත්ද, එනම්: 'ලෝකය සදාකාලිකය' යනු ද, 'ලෝකය අසදාකාලිකය' යනු ද, 'ලෝකයට සීමාවක් ඇත' යනු ද, 'ලෝකයට සීමාවක් නැත' යනු ද, 'ඒ ජීවයම ඒ ශරීරය' යනු ද, 'ජීවය වෙනය, ශරීරය වෙනය' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත්' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩ නොසිටිත්' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත් ද වැඩ නොසිටිත් ද' යනු ද, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත් ද නොසිටිත් ද නොවේ' යනු ද යන මේ යම් හැටදෙකක් වූ දෘෂ්ටි බ්‍රහ්මජාල සූත්‍රයෙහි දේශනා කළේද, ගෘහපතිය, මේ දෘෂ්ටි සක්කායදිට්ඨිය තිබෙන කල්හි ඇති වෙත්, සක්කායදිට්ඨිය නැති කල්හි ඇති නොවේ.\" \"එසේනම්, පින්වත් ස්වාමීන් වහන්ස, සක්කායදිට්ඨිය ඇති වන්නේ කෙසේද?\" \"ගෘහපතිය, මෙහිලා, අශ්‍රැතවත් පෘථග්ජනයා ආර්යයන් නොදුටු, ආර්ය ධර්මයෙහි අදක්ෂ වූ, ආර්ය ධර්මයෙහි නොහික්මුණු, සත්පුරුෂයන් නොදුටු, සත්පුරුෂ ධර්මයෙහි අදක්ෂ වූ, සත්පුරුෂ ධර්මයෙහි නොහික්මුණු පුද්ගලයා රූපය ආත්මය කොට සලකයි. නැතහොත් ආත්මය රූපය ඇති කොට සලකයි. නැතහොත් ආත්මය තුළ රූපය ඇතැයි සලකයි. නැතහොත් රූපය තුළ ආත්මය ඇතැයි සලකයි. වේදනාව ආත්මය කොට සලකයි. නැතහොත් ආත්මය වේදනාව ඇති කොට සලකයි. නැතහොත් ආත්මය තුළ වේදනාව ඇතැයි සලකයි. නැතහොත් වේදනාව තුළ ආත්මය ඇතැයි සලකයි. සංඥාව ආත්මය කොට සලකයි. නැතහොත් ආත්මය සංඥාව ඇති කොට සලකයි. නැතහොත් ආත්මය තුළ සංඥාව ඇතැයි සලකයි. නැතහොත් සංඥාව තුළ ආත්මය ඇතැයි සලකයි. සංස්කාර ආත්මය කොට සලකයි. නැතහොත් ආත්මය සංස්කාර ඇති කොට සලකයි. නැතහොත් ආත්මය තුළ සංස්කාර ඇතැයි සලකයි. නැතහොත් සංස්කාර තුළ ආත්මය ඇතැයි සලකයි. විඤ්ඤාණය ආත්මය කොට සලකයි. නැතහොත් ආත්මය විඤ්ඤාණය ඇති කොට සලකයි. නැතහොත් ආත්මය තුළ විඤ්ඤාණය ඇතැයි සලකයි. නැතහොත් විඤ්ඤාණය තුළ ආත්මය ඇතැයි සලකයි. ගෘහපතිය, මෙසේ සක්කායදිට්ඨිය ඇති වේ.\" \"එසේනම්, පින්වත් ස්වාමීන් වහන්ස, සක්කායදිට්ඨිය ඇති නොවන්නේ කෙසේද?\" \"ගෘහපතිය, මෙහිලා, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා ආර්යයන් දුටු, ආර්ය ධර්මයෙහි දක්ෂ වූ, ආර්ය ධර්මයෙහි මැනවින් හික්මුණු, සත්පුරුෂයන් දුටු, සත්පුරුෂ ධර්මයෙහි දක්ෂ වූ, සත්පුරුෂ ධර්මයෙහි මැනවින් හික්මුණු පුද්ගලයා රූපය ආත්මය කොට නොසලකයි. නැතහොත් ආත්මය රූපය ඇති කොට නොසලකයි. නැතහොත් ආත්මය තුළ රූපය ඇතැයි නොසලකයි. නැතහොත් රූපය තුළ ආත්මය ඇතැයි නොසලකයි. වේදනාව ආත්මය කොට නොසලකයි. නැතහොත් ආත්මය වේදනාව ඇති කොට නොසලකයි. නැතහොත් ආත්මය තුළ වේදනාව ඇතැයි නොසලකයි. නැතහොත් වේදනාව තුළ ආත්මය ඇතැයි නොසලකයි. සංඥාව ආත්මය කොට නොසලකයි. නැතහොත් ආත්මය සංඥාව ඇති කොට නොසලකයි. නැතහොත් ආත්මය තුළ සංඥාව ඇතැයි නොසලකයි. නැතහොත් සංඥාව තුළ ආත්මය ඇතැයි නොසලකයි. සංස්කාර ආත්මය කොට නොසලකයි. නැතහොත් ආත්මය සංස්කාර ඇති කොට නොසලකයි. නැතහොත් ආත්මය තුළ සංස්කාර ඇතැයි නොසලකයි. නැතහොත් සංස්කාර තුළ ආත්මය ඇතැයි නොසලකයි. විඤ්ඤාණය ආත්මය කොට නොසලකයි. නැතහොත් ආත්මය විඤ්ඤාණය ඇති කොට නොසලකයි. නැතහොත් ආත්මය තුළ විඤ්ඤාණය ඇතැයි නොසලකයි. නැතහොත් විඤ්ඤාණය තුළ ආත්මය ඇතැයි නොසලකයි.\"\n\nමේ අයුරින්මයි, ගෘහපතිය, සක්කායදිට්ඨිය හට නොගනියි. ස්වාමීනී, ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ කොහෙන්ද වඩින්නේ? ගෘහපතිය, මම අවන්තියෙන් වඩින්නෙමි. ස්වාමීනී, අවන්තියේ ඉසිදත්ත නම් අපගේ නොදුටු මිතුරෙක් පැවිදි වූ කුලපුත්‍රයෙක් සිටිනවාද? ආයුෂ්මත් ඔබ වහන්සේ ඔහු දැක තිබේද? එසේය, ගෘහපතිය. ස්වාමීනී, ඒ ආයුෂ්මත් තෙරණුවෝ දැන් කොහේද වාසය කරන්නේ? එසේ කී කල්හි, ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ නිහඬ වූහ. ස්වාමීනී, ඔබ වහන්සේ අපගේ ඉසිදත්ත තෙරණුවෝද? එසේය, ගෘහපතිය. ස්වාමීනී, ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ මච්ඡිකාසණ්ඩයෙහි සතුටු සිතින් වැඩවසනු මැනවි. අඹවනය ඉතා රමණීයය. මම ආයුෂ්මත් ඉසිදත්ත තෙරණුවන්ට සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර යන මේවා සම්පාදනය කිරීම සඳහා උත්සාහ කරන්නෙමි. ගෘහපතිය, ඔබ කියන්නේ යහපත් දෙයකි. ඉක්බිති චිත්ත ගෘහපතියා ආයුෂ්මත් ඉසිදත්ත තෙරුන්ගේ බසට සතුටු වී අනුමෝදන් වී, ප‍්‍රණීත වූ කැවිලි පෙවිලි සහ ආහාර වර්ග වලින් තමන්ගේම දෑතින් මහතෙරුන් වහන්සේලා සතුටු කළේය, පිළිගැන්වූයේය. ඉක්බිති මහතෙරුන් වහන්සේලා ආහාර වළඳා, පාත්‍රය හා දෑත් ඉවත් කරගෙන, ආසන වලින් නැගිට නික්ම ගියහ. ඉක්බිති මහතෙරුන් වහන්සේ ආයුෂ්මත් ඉසිදත්ත තෙරුන්ට මෙය පැවසූහ – \"ආයුෂ්මත් ඉසිදත්ත, මේ ප‍්‍රශ්නය ඔබට පහළ වූයේ ඉතා යහපති. මේ ප‍්‍රශ්නය මට පහළ නොවුණි. එහෙයින්, ආයුෂ්මත් ඉසිදත්ත, වෙනත් අවස්ථාවකදීද මෙබඳු ප‍්‍රශ්නයක් ඇති වුවහොත්, එහිදී ඔබ විසින්ම එයට පිළිතුරු දිය යුතුය.\" ඉක්බිති ආයුෂ්මත් ඉසිදත්ත තෙරණුවෝ තමන්ගේ සේනාසනය පිළියෙල කොට, පාත්‍රය සහ සිවුර ගෙන, මච්ඡිකාසණ්ඩයෙන් නික්ම ගියහ. ඔහු මච්ඡිකාසණ්ඩයෙන් නික්ම ගිය කල්හි, එසේම නික්ම ගිය කල්හි, නැවත නොපැමිණියේය.\n\nතෙවැන්න.",
      "paliTitle": "Dutiyaisidattasuttaṃ",
      "vagga": "",
      "englishTitle": "Second Sutta with Isidatta",
      "sinhalaTitle": "දුතිය ඉසිදත්ත සූත්‍රය"
    },
    {
      "number": 346,
      "pali": "Ekaṃ samayaṃ sambahulā therā bhikkhū macchikāsaṇḍe viharanti ambāṭakavane. Atha kho citto gahapati yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati there bhikkhū etadavoca – ‘‘adhivāsentu me, bhante therā, svātanāya gokule bhatta’’nti. Adhivāsesuṃ kho therā bhikkhū tuṇhībhāvena. Atha kho citto gahapati therānaṃ bhikkhūnaṃ adhivāsanaṃ viditvā uṭṭhāyāsanā there bhikkhū abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho therā bhikkhū tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena cittassa gahapatino gokulaṃ tenupasaṅkamiṃsu; upasaṅkamitvā paññatte āsane nisīdiṃsu. Atha kho citto gahapati there bhikkhū paṇītena sappipāyāsena sahatthā santappesi sampavāresi. Atha kho therā bhikkhū bhuttāvino onītapattapāṇino uṭṭhāyāsanā pakkamiṃsu. Cittopi kho gahapati ‘sesakaṃ vissajjethā’ti vatvā there bhikkhū piṭṭhito piṭṭhito anubandhi. Tena kho pana samayena uṇhaṃ hoti kuthitaṃ [kuṭṭhitaṃ (sī. syā. kaṃ. pī.)]; te ca therā bhikkhū paveliyamānena maññe kāyena gacchanti, yathā taṃ bhojanaṃ bhuttāvino. Tena kho pana samayena āyasmā mahako tasmiṃ bhikkhusaṅghe sabbanavako hoti. Atha kho āyasmā mahako āyasmantaṃ theraṃ etadavoca – ‘‘sādhu khvassa, bhante thera, sītako ca vāto vāyeyya, abbhasampilāpo [abbhasaṃbilāpo (sī.), abbhasaṃvilāpo (pī.)] ca assa, devo ca ekamekaṃ phusāyeyyā’’ti. ‘‘Sādhu khvassa, āvuso mahaka, yaṃ sītako ca vāto vāyeyya, abbhasampilāpo ca assa, devo ca ekamekaṃ phusāyeyyā’’ti. Atha kho āyasmā mahako tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhari [abhisaṅkhāsi (sī.)] yathā sītako ca vāto vāyi, abbhasampilāpo ca assa [āsi (?)], devo ca ekamekaṃ phusi. Atha kho cittassa gahapatino etadahosi – ‘‘yo kho imasmiṃ bhikkhusaṅghe sabbanavako bhikkhu tassāyaṃ evarūpo iddhānubhāvo’’ti. Atha kho āyasmā mahako ārāmaṃ sampāpuṇitvā āyasmantaṃ theraṃ etadavoca – ‘‘alamettāvatā, bhante therā’’ti? ‘‘Alamettāvatā, āvuso mahaka! Katamettāvatā, āvuso mahaka! Pūjitamettāvatā, āvuso mahako’’ti. Atha kho therā bhikkhū yathāvihāraṃ agamaṃsu. Āyasmāpi mahako sakaṃ vihāraṃ agamāsi. Atha kho citto gahapati yenāyasmā mahako tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahakaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati āyasmantaṃ mahakaṃ etadavoca – ‘‘sādhu me, bhante, ayyo mahako uttarimanussadhammaṃ iddhipāṭihāriyaṃ dassetū’’ti. ‘‘Tena hi tvaṃ, gahapati, ālinde uttarāsaṅgaṃ paññapetvā tiṇakalāpaṃ okāsehī’’ti. ‘‘Evaṃ, bhante’’ti kho citto gahapati āyasmato mahakassa paṭissutvā ālinde uttarāsaṅgaṃ paññapetvā tiṇakalāpaṃ okāsesi. Atha kho āyasmā mahako vihāraṃ pavisitvā sūcighaṭikaṃ datvā tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhari yathā tālacchiggaḷena ca aggaḷantarikāya ca acci nikkhamitvā tiṇāni jhāpesi, uttarāsaṅgaṃ na jhāpesi. Atha kho citto gahapati uttarāsaṅgaṃ papphoṭetvā saṃviggo lomahaṭṭhajāto ekamantaṃ aṭṭhāsi. Atha kho āyasmā mahako vihārā nikkhamitvā cittaṃ gahapatiṃ etadavoca – ‘‘alamettāvatā, gahapatī’’ti? ‘‘Alamettāvatā, bhante mahaka! Katamettāvatā, bhante, mahaka! Pūjitamettāvatā, bhante mahaka! Abhiramatu, bhante, ayyo mahako macchikāsaṇḍe. Ramaṇīyaṃ ambāṭakavanaṃ. Ahaṃ ayyassa mahakassa ussukkaṃ karissāmi cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārāna’’nti. ‘‘Kalyāṇaṃ vuccati, gahapatī’’ti. Atha kho āyasmā mahako senāsanaṃ saṃsāmetvā pattacīvaramādāya macchikāsaṇḍamhā pakkāmi. Yaṃ macchikāsaṇḍamhā pakkāmi, tathā pakkantova ahosi; na puna paccāgacchīti. Catutthaṃ.",
      "english": "At one time, many elder monks were dwelling in the Ambāṭaka Wood in Macchikāsaṇḍa. Then Citta the householder approached the elder monks; having approached, he saluted the elder monks and sat down to one side. As he sat to one side, Citta the householder said to the elder monks, \"Venerable sirs, elders, may you consent to accept a meal from me at the cattle pen tomorrow.\" The elder monks consented by their silence. Then Citta the householder, understanding the elder monks' consent, rose from his seat, saluted the elder monks, circumambulated them respectfully, and departed. Then, when that night had passed, in the morning, the elder monks dressed, took their bowls and robes, and approached the cattle pen of Citta the householder; having approached, they sat down on the seats prepared for them. Then Citta the householder, with his own hands, satisfied and served the elder monks with choice ghee-rice-porridge. Then, when the elder monks had finished their meal and removed their hands from their bowls, they rose from their seats and departed.\n\nCitta the householder, saying, \"Please dispose of the remainder,\" followed behind the elder monks. Now at that time, it was hot and stifling; and the elder monks, having consumed their meal, walked, as it were, with their bodies perspiring. Now at that time, the Venerable Mahaka was the newest among that assembly of monks. Then the Venerable Mahaka said to the elder monk, \"It would be good, venerable sir, elder, if a cool wind were to blow, if there were a gathering of clouds, and if rain were to sprinkle drop by drop.\" \"It would be good, friend Mahaka, if a cool wind were to blow, if there were a gathering of clouds, and if rain were to sprinkle drop by drop.\" Then the Venerable Mahaka performed such a feat of psychic power that a cool wind blew, clouds gathered, and rain sprinkled drop by drop. Then it occurred to Citta the householder, \"The monk who is the newest in this assembly has such psychic power!\" Then, upon reaching the park, the Venerable Mahaka said to the elder monk, \"Is this enough, venerable sirs, elders?\" \"This is enough, friend Mahaka! This has been accomplished, friend Mahaka! This has been honored, friend Mahaka!\"\n\nThen the elder monks went to their respective dwelling places. The Venerable Mahaka also went to his own dwelling place. Then Citta the householder approached the Venerable Mahaka; having approached, he saluted the Venerable Mahaka and sat down to one side. As he sat to one side, Citta the householder said to the Venerable Mahaka, \"It would be good for me, venerable sir, if the Venerable Mahaka were to display a superhuman feat of psychic power.\" \"In that case, householder, lay out your upper robe in the portico and spread a bundle of grass on it.\" \"Yes, venerable sir,\" Citta the householder replied to the Venerable Mahaka, and he laid out his upper robe in the portico and spread a bundle of grass on it. Then the Venerable Mahaka entered his dwelling, fastened the door-bar, and performed such a feat of psychic power that a flame emerged through the window-hole and through the gap in the door-bar, burning the grass but not burning the upper robe. Then Citta the householder shook out his upper robe, filled with awe and his hair standing on end, and stood to one side. Then the Venerable Mahaka emerged from his dwelling and said to Citta the householder, \"Is this enough, householder?\" \"This is enough, venerable Mahaka! This has been accomplished, venerable Mahaka! This has been honored, venerable Mahaka! Venerable Mahaka, please take delight in Macchikāsaṇḍa. The Ambāṭaka Wood is charming. I will diligently provide the Venerable Mahaka with robes, almsfood, lodging, and requisites of medicine for the sick.\" \"Well spoken, householder.\" Then the Venerable Mahaka put his dwelling in order, took his bowl and robes, and departed from Macchikāsaṇḍa. Once he had departed from Macchikāsaṇḍa, he remained departed; he never returned again.",
      "sinhala": "එක් සමයෙක්හි බොහෝ තෙර භික්‍ෂූහු මච්ඡිකාසණ්ඩයේ අම්බාටක වනයේ වැඩසිටියාහ. එකල්හි චිත්ත ගෘහපතියා යම් තැනෙක ඒ තෙර භික්‍ෂූහු වැඩසිටිත් ද එතැනට පැමිණියේය; පැමිණ, ඒ තෙර භික්‍ෂූන් වහන්සේලාට ආදරයෙන් වන්දනා කොට එක් පසෙක වාඩිවිය. එක් පසෙක වාඩි වී සිටි චිත්ත ගෘහපතියා ඒ තෙර භික්‍ෂූන් වහන්සේලාට මෙසේ කීවේය: \"ස්වාමීනි තෙරවරුනි, හෙට දවස සඳහා මාගේ ගොකුල නිවසේ දානය පිළිගන්නා සේක්වා!\" ඒ තෙර භික්‍ෂූහු නිහඬ භාවයෙන් පිළිගත්තාහ. එකල්හි චිත්ත ගෘහපතියා ඒ තෙර භික්‍ෂූන් වහන්සේලාගේ පිළිගැනීම දැන, අසුනෙන් නැගිට, ඒ තෙර භික්‍ෂූන් වහන්සේලාට වන්දනා කොට, ප්‍+රදක්‍ෂිණා කොට පිටත්ව ගියේය.\n\nඑකල්හි ඒ තෙර භික්‍ෂූහු ඒ රාත්‍රිය ඉක්ම ගිය පසු පෙරවරු කාලයෙහි හැඳ, පාත්‍ර සිවුරු රැගෙන යම් තැනෙක චිත්ත ගෘහපතියාගේ ගොකුල නිවස ද එතැනට වැඩියාහ; වැඩ, පනවා තිබූ අසුන්වල වැඩසිටියාහ. එකල්හි චිත්ත ගෘහපතියා ස්වකීය අතින් ප්‍+රණීත වූ සෙල්දෙල් මිශ්‍ර කිරි ආහාරයෙන් ඒ තෙර භික්‍ෂූන් වහන්සේලා සතුටු කොට, පිරිනැමුවේය. එකල්හි ඒ තෙර භික්‍ෂූහු භෝජනය වැළඳූවෝ, පාත්‍රයෙන් අත් ඉවත් කළෝ, අසුන්වලින් නැගිට පිටත්ව ගියාහ. චිත්ත ගෘහපතියා ද \"ඉතිරි ආහාරය (දායකයන්ට) මුදාහරිනු\" යැයි කියා ඒ තෙර භික්‍ෂූන් වහන්සේලා පසුපසින්ම ගියේය. ඒ සමයෙහි නම් උණුසුම් විය, ක්ලාන්ත කරවන සුළු විය; ඒ තෙර භික්‍ෂූහු ද (බිඳී යන) ක්ලාන්ත වූ කය ඇතිව යන්නාක් මෙන් ගියාහ, ආහාර වැළඳූවන්හට එලෙස වන්නාක් මෙනි. ඒ සමයෙහි නම් ආයුෂ්මත් මහාක තෙරණුවෝ ඒ භික්‍ෂු සංඝයා අතර සියලු දෙනාටම වඩා නවක තෙරණුවෝ වූහ. එකල්හි ආයුෂ්මත් මහාක තෙරණුවෝ ආයුෂ්මත් තෙරණුවන්ට මෙසේ කීහ: \"ස්වාමීනි තෙරණුවනි, සිසිල් සුළඟක් හමන්නේ නම්, අහස වලාකුළින් වැසී පවතින්නේ නම්, වර්ෂාව ද බිඳු බිඳුව වැගිරෙන්නේ නම් මැනවි.\" \"මැනවි, ආයුෂ්මත් මහාක, සිසිල් සුළඟක් හමන්නේ නම්, අහස වලාකුළින් වැසී පවතින්නේ නම්, වර්ෂාව ද බිඳු බිඳුව වැගිරෙන්නේ නම් මැනවි.\" එකල්හි ආයුෂ්මත් මහාක තෙරණුවෝ එවන් ඍද්ධි අභිසංඛාරයක් සිදු කළහ, යම්සේ සිසිල් සුළඟක් හමා ගියේ ද, අහස වලාකුළින් වැසී පැවතියේ ද, වර්ෂාව ද බිඳු බිඳුව වැගිරුණේ ද එලෙසය. එකල්හි චිත්ත ගෘහපතියාට මෙසේ සිතුණේය: \"යම් භික්‍ෂුවක් මේ භික්‍ෂු සංඝයා අතර සියලු දෙනාටම වඩා නවක ද, ඔහුට මෙවන් ඍද්ධි අනුභාවයක් ඇත.\" එකල්හි ආයුෂ්මත් මහාක තෙරණුවෝ ආරාමයට ළඟා වී ආයුෂ්මත් තෙරණුවන්ට මෙසේ කීහ: \"ස්වාමීනි තෙරණුවනි, මේ ප්‍+රමාණය ප්‍+රමාණවත් නොවේ ද?\" \"ආයුෂ්මත් මහාක, මේ ප්‍+රමාණය ප්‍+රමාණවත්ය! ආයුෂ්මත් මහාක, මේ ප්‍+රමාණය සිදු කළා සේය! ආයුෂ්මත් මහාක, මේ ප්‍+රමාණය (වැඩසිටි) පූජා කළා සේය!\" එකල්හි ඒ තෙර භික්‍ෂූහු තමන්ගේ විහාරයට වැඩියාහ. ආයුෂ්මත් මහාක තෙරණුවෝ ද තමන්ගේ විහාරයට වැඩියාහ.\n\nඑකල්හි චිත්ත ගෘහපතියා යම් තැනෙක ආයුෂ්මත් මහාක තෙරණුවෝ වැඩසිටිත් ද එතැනට පැමිණියේය; පැමිණ, ආයුෂ්මත් මහාක තෙරණුවන්ට වන්දනා කොට එක් පසෙක වාඩිවිය. එක් පසෙක වාඩි වී සිටි චිත්ත ගෘහපතියා ආයුෂ්මත් මහාක තෙරණුවන්ට මෙසේ කීවේය: \"ස්වාමීනි, මට මැනවි, ආර්ය මහාක තෙරණුවනි, උත්තරි මනුෂ්‍ය ධර්මය වූ ඍද්ධි ප්‍+රාතිහාර්යයක් දක්වන්නා සේක්වා!\" \"එසේ නම්, ගෘහපතියාණෙනි, ඔබ ආලින්දයේ ඇතිරිල්ලක් අතුරා තණ මිටියක් අසුරන්න.\" \"එසේය, ස්වාමීනි\" යැයි චිත්ත ගෘහපතියා ආයුෂ්මත් මහාක තෙරණුවන්ගේ වචනයට පිළිතුරු දී, ආලින්දයේ ඇතිරිල්ලක් අතුරා තණ මිටියක් ඇසිරුවේය. එකල්හි ආයුෂ්මත් මහාක තෙරණුවෝ විහාරයට පිවිස, (දොරට) අගුලක් දමා, එවන් ඍද්ධි අභිසංඛාරයක් සිදු කළහ, යම්සේ තල් ඉරකින් (ගොතන ලද කවුළුවකින්) ද, දොරගුළු අතර සිදුරකින් ද, ගිනිදැල්ලක් නික්ම ගොස් තණ පුළුස්සා දැමුවේ ද, එහෙත් ඇතිරිල්ල නොපිළිස්සී ද, එලෙසය. එකල්හි චිත්ත ගෘහපතියා ඇතිරිල්ල ගසා, සංවේගයට පත් වී, ලොමුදැහැ ගැන්වුණේ එක් පසෙක සිටියේය. එකල්හි ආයුෂ්මත් මහාක තෙරණුවෝ විහාරයෙන් නික්ම චිත්ත ගෘහපතියාට මෙසේ කීහ: \"ගෘහපතියාණෙනි, මේ ප්‍+රමාණය ප්‍+රමාණවත් නොවේ ද?\" \"ස්වාමීනි මහාක තෙරණුවනි, මේ ප්‍+රමාණය ප්‍+රමාණවත්ය! ස්වාමීනි මහාක, මේ ප්‍+රමාණය සිදු කළා සේය! ස්වාමීනි මහාක, මේ ප්‍+රමාණය පූජා කළා සේය! ස්වාමීනි, ආර්ය මහාක තෙරණුවෝ මච්ඡිකාසණ්ඩයේ සතුටින් වැඩසිටින සේක්වා! අම්බාටක වනය සුන්දරය. මම ආර්ය මහාක තෙරණුවන්ගේ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස හා බෙහෙත් පිරිකර සම්බන්ධයෙන් උත්සුක වන්නෙමි.\" \"ගෘහපතියාණෙනි, යහපත් දෙයකි කියන්නේ.\" එකල්හි ආයුෂ්මත් මහාක තෙරණුවෝ සේනාසනය සකස් කොට, පාත්‍ර සිවුරු රැගෙන මච්ඡිකාසණ්ඩයෙන් පිටත්ව ගියාහ. යම්සේ මච්ඡිකාසණ්ඩයෙන් පිටත්ව ගියාහු ද, එසේ පිටත්ව ගිය සේක; නැවත නොවැඩියාහ.",
      "paliTitle": "Mahakapāṭihāriyasuttaṃ",
      "vagga": "",
      "englishTitle": "The Great Miracle Sutta",
      "sinhalaTitle": "මහකප්පාටිහාරිය සූත්‍රය"
    },
    {
      "number": 347,
      "pali": "Ekaṃ samayaṃ āyasmā kāmabhū macchikāsaṇḍe viharati ambāṭakavane. Atha kho citto gahapati yenāyasmā kāmabhū tenupasaṅkami; upasaṅkamitvā āyasmantaṃ kāmabhuṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho cittaṃ gahapatiṃ āyasmā kāmabhū etadavoca – ‘‘Vuttamidaṃ, gahapati – ‘‘Nelaṅgo setapacchādo, ekāro vattatī ratho; Anīghaṃ passa āyantaṃ [appattaṃ (syā. kaṃ. ka.)], chinnasotaṃ abandhana’’nti. ‘‘Imassa nu kho, gahapati, saṃkhittena bhāsitassa kathaṃ vitthārena attho daṭṭhabbo’’ti? ‘‘Kiṃ nu kho etaṃ, bhante, bhagavatā bhāsita’’nti? ‘‘Evaṃ, gahapatī’’ti. ‘‘Tena hi, bhante, muhuttaṃ āgamehi yāvassa atthaṃ pekkhāmī’’ti. Atha kho citto gahapati muhuttaṃ tuṇhī hutvā āyasmantaṃ kāmabhuṃ etadavoca – ‘‘‘Nelaṅga’nti kho, bhante, sīlānametaṃ adhivacanaṃ. ‘Setapacchādo’ti kho, bhante, vimuttiyā etaṃ adhivacanaṃ. ‘Ekāro’ti kho, bhante, satiyā etaṃ adhivacanaṃ. ‘Vattatī’ti kho, bhante, abhikkamapaṭikkamassetaṃ adhivacanaṃ. ‘Ratho’ti kho, bhante, imassetaṃ cātumahābhūtikassa kāyassa adhivacanaṃ mātāpettikasambhavassa odanakummāsūpacayassa aniccucchādanaparimaddanabhedanaviddhaṃsanadhammassa. Rāgo kho, bhante, nīgho, doso nīgho, moho nīgho. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṃ anuppādadhammā. Tasmā khīṇāsavo bhikkhu ‘anīgho’ti vuccati. ‘Āyanta’nti kho, bhante, arahato etaṃ adhivacanaṃ. ‘Soto’ti kho, bhante, taṇhāyetaṃ adhivacanaṃ. Sā khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṃ anuppādadhammā. Tasmā khīṇāsavo bhikkhu ‘chinnasoto’ti vuccati. Rāgo kho, bhante, bandhanaṃ, doso bandhanaṃ, moho bandhanaṃ. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṃ anuppādadhammā. Tasmā khīṇāsavo bhikkhu ‘abandhano’ti vuccati. Iti kho, bhante, yaṃ taṃ bhagavatā vuttaṃ – ‘‘Nelaṅgo setapacchādo, ekāro vattatī ratho; Anīghaṃ passa āyantaṃ, chinnasotaṃ abandhana’’nti. ‘‘Imassa kho, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmī’’ti. ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te gambhīre buddhavacane paññācakkhu kamatī’’ti. Pañcamaṃ.",
      "english": "At one time, the Venerable Kāmabhū was dwelling in Macchikāsaṇḍa, in the Ambāṭakavana. Then, Citta the householder approached the Venerable Kāmabhū. Having approached and paid respects to the Venerable Kāmabhū, he sat down to one side. As Citta the householder sat to one side, the Venerable Kāmabhū said this to him: \"Householder, this was said: ‘The chariot moves, unblemished, white-covered, with a single axle. See the one who has arrived, free from affliction, with the stream cut off, unattached.’ Householder, how should the meaning of this brief statement be understood in detail?\" \"Venerable sir, was this spoken by the Blessed One?\" \"Yes, householder.\" \"In that case, Venerable sir, please wait a moment while I reflect on its meaning.\"\n\nThen, after remaining silent for a moment, Citta the householder said this to the Venerable Kāmabhū: \"‘Unblemished,’ Venerable sir, is a term for virtue. ‘White-covered,’ Venerable sir, is a term for liberation. ‘Single-axled,’ Venerable sir, is a term for mindfulness. ‘Moves,’ Venerable sir, is a term for coming and going. ‘Chariot,’ Venerable sir, is a term for this body, composed of the four great elements, born of mother and father, sustained by rice and gruel, subject to impermanence, anointing, massage, disintegration, and destruction. Lust, Venerable sir, is affliction; hatred is affliction; delusion is affliction. For a monk whose taints are destroyed, these are abandoned, uprooted, made like a palm-stump, brought to non-existence, and are no longer subject to future arising. Therefore, a monk whose taints are destroyed is called ‘free from affliction’. ‘One who has arrived,’ Venerable sir, is a term for an Arahant. ‘Stream,’ Venerable sir, is a term for craving. For a monk whose taints are destroyed, this is abandoned, uprooted, made like a palm-stump, brought to non-existence, and is no longer subject to future arising. Therefore, a monk whose taints are destroyed is called ‘with the stream cut off’. Lust, Venerable sir, is a fetter; hatred is a fetter; delusion is a fetter. For a monk whose taints are destroyed, these are abandoned, uprooted, made like a palm-stump, brought to non-existence, and are no longer subject to future arising. Therefore, a monk whose taints are destroyed is called ‘unattached’. Thus, Venerable sir, the Blessed One's saying: ‘The chariot moves, unblemished, white-covered, with a single axle. See the one who has arrived, free from affliction, with the stream cut off, unattached.’ Venerable sir, I understand the meaning of this brief statement spoken by the Blessed One in such detail.\"\n\n\"It is a gain for you, householder, indeed well-gained, householder! Your eye of wisdom penetrates the profound teaching of the Buddha.\"",
      "sinhala": "එක් කලෙක ආයුෂ්මත් කාමභූ ස්ථවිරයන් වහන්සේ මච්ඡිකාසණ්ඩ නම් නියම්ගම අම්බටකවනයෙහි වැඩසිටින සේක. එකල්හි චිත්ත ගෘහපති ආයුෂ්මත් කාමභූ ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට පැමිණියේය; පැමිණ, ආයුෂ්මත් කාමභූ ස්ථවිරයන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩිවිය.\n\nඑකත්පසෙකින් වාඩි වී සිටි චිත්ත ගෘහපතිට ආයුෂ්මත් කාමභූ ස්ථවිරයන් වහන්සේ මෙය පැවසුවෝය – ‘‘ගෘහපතිය, මෙය වදාළ සේක – ‘කිළිටි නැති, සුදු වියනක් ඇති, එක අරයක් ඇති රථය ගමන් කරයි; කෙලෙස් රහිත වූ, පැමිණෙන්නා වූ, තෘෂ්ණා ප්‍රවාහය සිඳලූ, බැඳීම් නැත්තා වූ තැනැත්තා බලනු’ කියාය.’’ ‘‘ගෘහපතිය, සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ (වචන) වල අර්ථය විස්තර වශයෙන් කෙසේ දැක්ක යුතුද?’’\n\n‘‘භන්තේ, මේ වදාළේ භාග්‍යවතුන් වහන්සේ විසින්ද?’’ ‘‘එසේය, ගෘහපතිය.’’ ‘‘එසේ නම්, භන්තේ, මම එහි අර්ථය සිතා බලන තුරු මොහොතක් ඉවසන්න.’’\n\nඑකල්හි චිත්ත ගෘහපති මොහොතක් නිහඬව සිට, ආයුෂ්මත් කාමභූ ස්ථවිරයන් වහන්සේට මෙය පැවසුවේය – ‘‘භන්තේ, ‘නෙළඟු’ යනු සීලයට නමකි. ‘සුදු වියනක් ඇති’ යනු විමුක්තියට නමකි. ‘එක අරයක් ඇති’ යනු සතියට නමකි. ‘ගමන් කරයි’ යනු ඉදිරියට යාමටත්, පසුපසට ඒමටත් නමකි. ‘රථය’ යනු භන්තේ, මවගෙන් සහ පියාගෙන් හටගත්, බත් සහ කැඳ ආදියෙන් වැඩුණු, අනිත්‍ය වූ, අතුගා දැමීමට, පිරිමැදීමට, බිඳීමට, විසිරුවා හැරීමට සුදුසු ස්වභාවයක් ඇති මේ සිව්මහාභූතයන්ගෙන් සෑදුණු ශරීරයට නමකි.\n\nභන්තේ, රාගය නම් ඊඝයකි (ක්ලේශයකි), ද්වේෂය ඊඝයකි, මෝහය ඊඝයකි. ඒ ක්ෂීණාශ්‍රව භික්ෂුවකට ප්‍රහීණ කරනු ලැබූ, මුල් සිඳ දමනු ලැබූ, තල් ගසක් මුලින් උදුරා දැමුවා සේ නැති කරන ලද, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද, අනාගතයේදී නැවත නූපදින ධර්ම ස්වභාවයක් ඇත්තේය. එබැවින් ක්ෂීණාශ්‍රව භික්ෂුව ‘අනීඝ’ යැයි කියනු ලැබේ.\n\n‘පැමිණෙන්නා වූ’ යනු භන්තේ, අරහතුන් වහන්සේට නමකි. ‘සෝතය’ යනු භන්තේ, තෘෂ්ණාවට නමකි. ඒ (තෘෂ්ණාව) ක්ෂීණාශ්‍රව භික්ෂුවකට ප්‍රහීණ කරනු ලැබූ, මුල් සිඳ දමනු ලැබූ, තල් ගසක් මුලින් උදුරා දැමුවා සේ නැති කරන ලද, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද, අනාගතයේදී නැවත නූපදින ධර්ම ස්වභාවයක් ඇත්තේය. එබැවින් ක්ෂීණාශ්‍රව භික්ෂුව ‘ඡින්නසෝත’ යැයි කියනු ලැබේ.\n\nභන්තේ, රාගය නම් බැඳීමකි, ද්වේෂය බැඳීමකි, මෝහය බැඳීමකි. ඒ (රාග, ද්වේෂ, මෝහ යන බැඳීම්) ක්ෂීණාශ්‍රව භික්ෂුවකට ප්‍රහීණ කරනු ලැබූ, මුල් සිඳ දමනු ලැබූ, තල් ගසක් මුලින් උදුරා දැමුවා සේ නැති කරන ලද, නැවත ඇති නොවන ස්වභාවයට පත් කරන ලද, අනාගතයේදී නැවත නූපදින ධර්ම ස්වභාවයක් ඇත්තේය. එබැවින් ක්ෂීණාශ්‍රව භික්ෂුව ‘අබන්ධන’ යැයි කියනු ලැබේ.\n\nභන්තේ, භාග්‍යවතුන් වහන්සේ විසින් වදාළ – ‘කිළිටි නැති, සුදු වියනක් ඇති, එක අරයක් ඇති රථය ගමන් කරයි; කෙලෙස් රහිත වූ, පැමිණෙන්නා වූ, තෘෂ්ණා ප්‍රවාහය සිඳලූ, බැඳීම් නැත්තා වූ තැනැත්තා බලනු’ යන මේ ගාථාවේ අර්ථය මෙසේ විස්තර වශයෙන් මම දනිමි.’’\n\n‘‘ගෘහපතිය, ඔබට ලාභයකි, ඔබට මනාකොට ලැබුණකි! යම් හෙයකින් ගැඹුරු වූ බුද්ධ වචනයෙහි ඔබේ ප්‍රඥා චක්ෂුස ක්‍රියාත්මක වේද!’’",
      "paliTitle": "Paṭhamakāmabhūsuttaṃ",
      "vagga": "",
      "englishTitle": "The First Discourse to Kāmabhū",
      "sinhalaTitle": "පළමු කාමභූ සූත්‍රය"
    },
    {
      "number": 348,
      "pali": "Ekaṃ samayaṃ āyasmā kāmabhū macchikāsaṇḍe viharati ambāṭakavane. Atha kho citto gahapati yenāyasmā kāmabhū tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati āyasmantaṃ kāmabhuṃ etadavoca – ‘‘kati nu kho, bhante, saṅkhārā’’ti? ‘‘Tayo kho, gahapati, saṅkhārā – kāyasaṅkhāro, vacīsaṅkhāro, cittasaṅkhāro’’ti. ‘‘Sādhu, bhante’’ti kho citto gahapati āyasmato kāmabhussa bhāsitaṃ abhinanditvā anumoditvā āyasmantaṃ kāmabhuṃ uttariṃ pañhaṃ apucchi – ‘‘katamo pana, bhante, kāyasaṅkhāro, katamo vacīsaṅkhāro, katamo cittasaṅkhāro’’ti? ‘‘Assāsapassāsā kho, gahapati, kāyasaṅkhāro, vitakkavicārā vacīsaṅkhāro, saññā ca vedanā ca cittasaṅkhāro’’ti. ‘‘Sādhu, bhante’’ti kho citto gahapati…pe… uttariṃ pañhaṃ apucchi – ‘‘kasmā pana, bhante, assāsapassāsā kāyasaṅkhāro, kasmā vitakkavicārā vacīsaṅkhāro, kasmā saññā ca vedanā ca cittasaṅkhāro’’ti? ‘‘Assāsapassāsā kho, gahapati, kāyikā. Ete dhammā kāyappaṭibaddhā, tasmā assāsapassāsā kāyasaṅkhāro. Pubbe kho, gahapati, vitakketvā vicāretvā pacchā vācaṃ bhindati, tasmā vitakkavicārā vacīsaṅkhāro. Saññā ca vedanā ca cetasikā. Ete dhammā cittappaṭibaddhā, tasmā saññā ca vedanā ca cittasaṅkhāro’’ti. Sādhu…pe… uttariṃ pañhaṃ apucchi – ‘‘kathaṃ pana, bhante, saññāvedayitanirodhasamāpatti hotī’’ti? ‘‘Na kho, gahapati, saññāvedayitanirodhaṃ samāpajjantassa bhikkhuno evaṃ hoti – ‘ahaṃ saññāvedayitanirodhaṃ samāpajjissa’nti vā ‘ahaṃ saññāvedayitanirodhaṃ samāpajjāmī’ti vā ‘ahaṃ saññāvedayitanirodhaṃ samāpanno’ti vā. Atha khvassa pubbeva tathā cittaṃ bhāvitaṃ hoti yaṃ taṃ tathattāya upanetī’’ti. Sādhu …pe… uttariṃ pañhaṃ apucchi – ‘‘saññāvedayitanirodhaṃ samāpajjantassa pana, bhante, bhikkhuno katame dhammā paṭhamaṃ nirujjhanti, yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi vā cittasaṅkhāro’’ti? ‘‘Saññāvedayitanirodhaṃ samāpajjantassa kho, gahapati, bhikkhuno vacīsaṅkhāro paṭhamaṃ nirujjhati, tato kāyasaṅkhāro, tato cittasaṅkhāro’’ti. Sādhu…pe… uttariṃ pañhaṃ apucchi – ‘‘yvāyaṃ, bhante, mato kālaṅkato, yo cāyaṃ bhikkhu saññāvedayitanirodhaṃ samāpanno, imesaṃ kiṃ nānākaraṇa’’nti? ‘‘Yvāyaṃ gahapati, mato kālaṅkato tassa kāyasaṅkhāro niruddho paṭippassaddho, vacīsaṅkhāro niruddho paṭippassaddho, cittasaṅkhāro niruddho paṭippassaddho, āyu parikkhīṇo, usmā vūpasantā, indriyāni viparibhinnāni. Yo ca khvāyaṃ, gahapati, bhikkhu saññāvedayitanirodhaṃ samāpanno, tassapi kāyasaṅkhāro niruddho paṭippassaddho, vacīsaṅkhāro niruddho paṭippassaddho, cittasaṅkhāro niruddho paṭippassaddho, āyu aparikkhīṇo, usmā avūpasantā, indriyāni vippasannāni. Yvāyaṃ, gahapati, mato kālaṅkato, yo cāyaṃ bhikkhu saññāvedayitanirodhaṃ samāpanno, idaṃ nesaṃ nānākaraṇa’’nti. Sādhu…pe… uttariṃ pañhaṃ apucchi – ‘‘kathaṃ pana, bhante, saññāvedayitanirodhasamāpattiyā vuṭṭhānaṃ hotī’’ti? ‘‘Na kho, gahapati, saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa bhikkhuno evaṃ hoti – ‘ahaṃ saññāvedayitanirodhasamāpattiyā vuṭṭhahissa’nti vā ‘ahaṃ saññāvedayitanirodhasamāpattiyā vuṭṭhahāmī’ti vā ‘ahaṃ saññāvedayitanirodhasamāpattiyā vuṭṭhito’ti vā. Atha khvassa pubbeva tathā cittaṃ bhāvitaṃ hoti, yaṃ taṃ tathattāya upanetī’’ti. Sādhu, bhante…pe… uttariṃ pañhaṃ apucchi – ‘‘saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa pana, bhante, bhikkhuno katame dhammā paṭhamaṃ uppajjanti, yadi vā kāyasaṅkhāro, yadi vā vacīsaṅkhāro, yadi vā cittasaṅkhāro’’ti? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhahantassa, gahapati, bhikkhuno cittasaṅkhāro paṭhamaṃ uppajjati, tato kāyasaṅkhāro, tato vacīsaṅkhāro’’ti. Sādhu…pe… uttariṃ pañhaṃ apucchi – ‘‘saññāvedayitanirodhasamāpattiyā vuṭṭhitaṃ pana, bhante, bhikkhuṃ kati phassā phusanti’’? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitaṃ kho, gahapati, bhikkhuṃ tayo phassā phusanti – suññato phasso, animitto phasso, appaṇihito phasso’’ti. Sādhu…pe… uttariṃ pañhaṃ apucchi – ‘‘saññāvedayitanirodhasamāpattiyā vuṭṭhitassa pana, bhante, bhikkhuno kiṃninnaṃ cittaṃ hoti, kiṃpoṇaṃ, kiṃpabbhāra’’nti? ‘‘Saññāvedayitanirodhasamāpattiyā vuṭṭhitassa kho, gahapati, bhikkhuno vivekaninnaṃ cittaṃ hoti vivekapoṇaṃ vivekapabbhāra’’nti. ‘‘Sādhu, bhante’’ti kho citto gahapati āyasmato kāmabhussa bhāsitaṃ abhinanditvā anumoditvā āyasmantaṃ kāmabhuṃ uttariṃ pañhaṃ apucchi – ‘‘saññāvedayitanirodhasamāpattiyā pana, bhante, kati dhammā bahūpakārā’’ti? ‘‘Addhā kho tvaṃ, gahapati, yaṃ paṭhamaṃ pucchitabbaṃ taṃ pucchasi. Api ca tyāhaṃ byākarissāmi. Saññāvedayitanirodhasamāpattiyā kho, gahapati, dve dhammā bahūpakārā – samatho ca vipassanā cā’’ti. Chaṭṭhaṃ.",
      "english": "At one time, the venerable Kāmabhū was staying in Macchikāsaṇḍa, in the Ambāṭaka Wood. Then Citta the householder approached the venerable Kāmabhū; having approached, he sat down to one side. As he sat to one side, Citta the householder said to the venerable Kāmabhū, “Venerable sir, how many formations are there?”\n\n“Householder, there are three formations: bodily formation, verbal formation, and mental formation.” “Good, venerable sir,” Citta the householder, having rejoiced in and appreciated the venerable Kāmabhū’s statement, asked the venerable Kāmabhū a further question: “But venerable sir, what is bodily formation, what is verbal formation, and what is mental formation?”\n\n“Householder, in-and-out breaths are bodily formation; initial and sustained application of mind are verbal formation; and perception and feeling are mental formation.” “Good, venerable sir,” Citta the householder… asked a further question: “But venerable sir, why are in-and-out breaths bodily formation? Why are initial and sustained application of mind verbal formation? Why are perception and feeling mental formation?”\n\n“Householder, in-and-out breaths are bodily. These phenomena are connected with the body, therefore in-and-out breaths are bodily formation. Householder, having first initiated and sustained thought, one then breaks forth into speech. Therefore, initial and sustained application of mind are verbal formation. Perception and feeling are mental. These phenomena are connected with the mind, therefore perception and feeling are mental formation.” “Good, venerable sir,” Citta the householder… asked a further question: “But venerable sir, how does the attainment of the cessation of perception and feeling come about?”\n\n“Householder, when a bhikkhu enters the cessation of perception and feeling, it does not occur to him, ‘I will enter the cessation of perception and feeling,’ or ‘I am entering the cessation of perception and feeling,’ or ‘I have entered the cessation of perception and feeling.’ Rather, his mind has been developed beforehand in such a way that it leads him to that state.” “Good, venerable sir,” Citta the householder… asked a further question: “But venerable sir, when a bhikkhu enters the cessation of perception and feeling, which of these phenomena cease first: bodily formation, verbal formation, or mental formation?”\n\n“Householder, when a bhikkhu enters the cessation of perception and feeling, verbal formation ceases first, then bodily formation, then mental formation.” “Good, venerable sir,” Citta the householder… asked a further question: “Venerable sir, what is the difference between one who is dead and passed away and a bhikkhu who has attained the cessation of perception and feeling?”\n\n“Householder, for one who is dead and passed away, his bodily formation has ceased and subsided, his verbal formation has ceased and subsided, his mental formation has ceased and subsided; his life force is exhausted, his body warmth has ceased, and his faculties are completely disintegrated. But for a bhikkhu who has attained the cessation of perception and feeling, his bodily formation has also ceased and subsided, his verbal formation has ceased and subsided, and his mental formation has ceased and subsided; however, his life force is not exhausted, his body warmth has not ceased, and his faculties are fully clear. This, householder, is the difference between one who is dead and passed away and a bhikkhu who has attained the cessation of perception and feeling.”\n\n“Good, venerable sir,” Citta the householder… asked a further question: “But venerable sir, how does one emerge from the attainment of the cessation of perception and feeling?”\n\n“Householder, when a bhikkhu emerges from the attainment of the cessation of perception and feeling, it does not occur to him, ‘I will emerge from the attainment of the cessation of perception and feeling,’ or ‘I am emerging from the attainment of the cessation of perception and feeling,’ or ‘I have emerged from the attainment of the cessation of perception and feeling.’ Rather, his mind has been developed beforehand in such a way that it leads him to that state.”\n\n“Good, venerable sir,” Citta the householder… asked a further question: “But venerable sir, when a bhikkhu emerges from the attainment of the cessation of perception and feeling, which of these phenomena arise first: bodily formation, verbal formation, or mental formation?”\n\n“Householder, when a bhikkhu emerges from the attainment of the cessation of perception and feeling, mental formation arises first, then bodily formation, then verbal formation.”\n\n“Good, venerable sir,” Citta the householder… asked a further question: “But venerable sir, how many types of contact touch a bhikkhu who has emerged from the attainment of the cessation of perception and feeling?”\n\n“Householder, three types of contact touch a bhikkhu who has emerged from the attainment of the cessation of perception and feeling: emptiness contact, signless contact, and undirected contact.”\n\n“Good, venerable sir,” Citta the householder… asked a further question: “But venerable sir, when a bhikkhu has emerged from the attainment of the cessation of perception and feeling, towards what is his mind inclined, prone, and directed?”\n\nFor a monk, householder, who has emerged from the attainment of the cessation of perception and feeling, the mind inclines towards solitude, tends towards solitude, and gravitates towards solitude.\n\n‘Excellent, venerable sir,’ said Citto the householder, and having delighted in and rejoiced at the Venerable Kāmabhu's words, he then asked the Venerable Kāmabhu a further question: ‘But venerable sir, how many qualities are of great assistance for the attainment of the cessation of perception and feeling?’\n\n‘Indeed, householder, you are asking what should have been asked first. Nevertheless, I will explain it to you. Indeed, householder, two qualities are of great assistance for the attainment of the cessation of perception and feeling: serenity and insight.’",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් කාමභූ ස්ථ​විරයන් වහන්සේ මච්ඡිකාසණ්ඩ නම් නියම්ගම අඹවනයෙහි වැඩසිටියහ. එකල්හී චිත්ත ගෘහපතිතුමා ආයුෂ්මත් කාමභූ ස්ථ​විරයන් වහන්සේ වැඩසිටි තැනට පැමිණ, පැමිණ, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි චිත්ත ගෘහපතිතුමා ආයුෂ්මත් කාමභූ ස්ථ​විරයන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, සංස්කාර කීයක් නම් ඇත්ද?” “ගෘහපති, සංස්කාර තුනක් ඇත්තේය – කාය සංස්කාරය, වචී සංස්කාරය, චිත්ත සංස්කාරය.” “එසේය, ස්වාමීනි,” යි චිත්ත ගෘහපතිතුමා ආයුෂ්මත් කාමභූ ස්ථ​විරයන් වහන්සේගේ බස පිළිගෙන අනුමෝදන්ව, ආයුෂ්මත් කාමභූ ස්ථ​විරයන් වහන්සේගෙන් තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, කාය සංස්කාරය කවරේද? වචී සංස්කාරය කවරේද? චිත්ත සංස්කාරය කවරේද?” “ගෘහපති, ආශ්වාස ප්‍ර​ශ්වාසයෝ කාය සංස්කාරය වෙති. විතර්ක විචාරයෝ වචී සංස්කාරය වෙති. සංඥා​ව සහ වේදනාව චිත්ත සංස්කාරය වෙති.” “එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, ආශ්වාස ප්‍ර​ශ්වාසයෝ කාය සංස්කාරය වන්නේ කවර හෙයින්ද? විතර්ක විචාරයෝ වචී සංස්කාරය වන්නේ කවර හෙයින්ද? සංඥා​ව සහ වේදනාව චිත්ත සංස්කාරය වන්නේ කවර හෙයින්ද?” “ගෘහපති, ආශ්වාස ප්‍ර​ශ්වාසයෝ කායික වෙති. මේ ධර්මයන් කය හා බැඳී පවතී. එබැවින් ආශ්වාස ප්‍ර​ශ්වාසයෝ කාය සංස්කාරය වෙති. ගෘහපති, පළමුව විතර්ක කර, විචාර කර, පසුව වචනය ප්‍ර​කාශ කරනු ලැබේ. එබැවින් විතර්ක විචාරයෝ වචී සංස්කාරය වෙති. සංඥා​ව සහ වේදනාව චෛතසිකයෝ වෙති. මේ ධර්මයන් සිත හා බැඳී පවතී. එබැවින් සංඥා​ව සහ වේදනාව චිත්ත සංස්කාරය වෙති.” “එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, සංඥා වේදයිත නිරෝධ සමාපත්තිය ඇතිවන්නේ කෙසේද?” “ගෘහපති, සංඥා වේදයිත නිරෝධයට සමවදින භික්ෂු​වකට ‘මම සංඥා වේදයිත නිරෝධයට සමවදිමි’ යි හෝ ‘මම සංඥා වේදයිත නිරෝධයට සමවදිමින් සිටිමි’ යි හෝ ‘මම සංඥා වේදයිත නිරෝධයට සමවදින ලද්දෙමි’ යි හෝ මෙසේ සිතක් ඇති නොවේ. එහෙත් ඔහුට පෙර සිටම එබඳු ස්වභාවයකට පත්වන සේ සිත භාවනා කර ඇත.”\n\n“එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, සංඥා වේදයිත නිරෝධයට සමවදින භික්ෂු​වකට පළමුව නිරුද්ධ වන්නේ කවර ධර්මයන්ද? කාය සංස්කාරයද, වචී සංස්කාරයද, නැතහොත් චිත්ත සංස්කාරයද?” “ගෘහපති, සංඥා වේදයිත නිරෝධයට සමවදින භික්ෂු​වකට පළමුව වචී සංස්කාරය නිරුද්ධ වේ. ඉන්පසු කාය සංස්කාරයද, ඉන්පසු චිත්ත සංස්කාරයද නිරුද්ධ වේ.”\n\n“එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, යමෙක් මිය ගොස් කලුරිය කර ඇත්තේද, යම් භික්ෂු​වක් සංඥා වේදයිත නිරෝධයට සමව සිටින්නේද, මොවුන් දෙදෙනා අතර ඇති වෙනස කුමක්ද?” “ගෘහපති, යම් කෙනෙක් මිය ගොස් කලුරිය කර ඇත්තේද, ඔහුගේ කාය සංස්කාරය නිරුද්ධ වී සංසිඳී ඇත. වචී සංස්කාරය නිරුද්ධ වී සංසිඳී ඇත. චිත්ත සංස්කාරය නිරුද්ධ වී සංසිඳී ඇත. ආයුෂ ක්ෂය වී ඇත. උෂ්ණය සංසිඳී ඇත. ඉන්ද්‍රියයන් බිඳී විසිරී ඇත. ගෘහපති, යම් භික්ෂු​වක් සංඥා වේදයිත නිරෝධයට සමව සිටින්නේද, ඔහුගේද කාය සංස්කාරය නිරුද්ධ වී සංසිඳී ඇත. වචී සංස්කාරය නිරුද්ධ වී සංසිඳී ඇත. චිත්ත සංස්කාරය නිරුද්ධ වී සංසිඳී ඇත. ආයුෂ ක්ෂය වී නැත. උෂ්ණය සංසිඳී නැත. ඉන්ද්‍රියයන් ප්‍ර​සන්නව පවතී. ගෘහපති, යම් කෙනෙක් මිය ගොස් කලුරිය කර ඇත්තේද, යම් භික්ෂු​වක් සංඥා වේදයිත නිරෝධයට සමව සිටින්නේද, මොවුන් අතර ඇති වෙනස මෙයයි.”\n\n“එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටීම සිදුවන්නේ කෙසේද?” “ගෘහපති, සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටින භික්ෂු​වකට ‘මම සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටිමි’ යි හෝ ‘මම සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටිමින් සිටිමි’ යි හෝ ‘මම සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටියෙමි’ යි හෝ මෙසේ සිතක් ඇති නොවේ. එහෙත් ඔහුට පෙර සිටම එබඳු ස්වභාවයකට පත්වන සේ සිත භාවනා කර ඇත.”\n\n“එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටින භික්ෂු​වකට පළමුව ඇතිවන්නේ කවර ධර්මයන්ද? කාය සංස්කාරයද, වචී සංස්කාරයද, නැතහොත් චිත්ත සංස්කාරයද?” “ගෘහපති, සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටින භික්ෂු​වකට පළමුව චිත්ත සංස්කාරය ඇතිවේ. ඉන්පසු කාය සංස්කාරයද, ඉන්පසු වචී සංස්කාරයද ඇතිවේ.”\n\n“එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටි භික්ෂු​වකට කවර ස්පර්ශ කීයක් ස්පර්ශ වේද?” “ගෘහපති, සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටි භික්ෂු​වකට ස්පර්ශ තුනක් ස්පර්ශ වේ – ශුන්‍ය​ත ස්පර්ශය, අනිමිත්ත ස්පර්ශය, අප්‍ර​ණිහිත ස්පර්ශය.”\n\n“එසේය, ස්වාමීනි,” යි (චිත්ත ගෘහපතිතුමා) තවත් ප්‍ර​ශ්නයක් ඇසුවේය – “ස්වාමීනි, සංඥා වේදයිත නිරෝධ සමාපත්තියෙන් නැගී සිටි භික්ෂු​වගේ සිත කුමකට නැඹුරු වූවක්ද, කුමකට බර වූවක්ද, කුමකට ළං වූවක්ද?”\n\nගෘහපතිය, සංඥා‍​-වේදයිත-නිරෝධ-සමාපත්තියෙන් වැඩ සිටි භික්ෂූන් වහන්සේගේ සිත විවේකය කෙරෙහි නැඹුරු වූවක් ද, විවේකය කරා බර වූවක් ද, විවේකය වෙතටම ඇදී යන සුළු වූවක් ද වෙයි.\n\n\"එසේය, ස්වාමීන් වහන්ස!\" යි චිත්ත ගෘහපතිතුමා ආයුෂ්මත් කාමභූ ස්ථවිරයන් වහන්සේගේ දෙසුම සතුටින් පිළිගෙන අනුමෝදන් වී, ආයුෂ්මත් කාමභූ ස්ථවිරයන් වහන්සේගෙන් තවත් ප්‍රශ්නයක් විමසුවේය: \"ස්වාමීන් වහන්ස, සංඥා‍​-වේදයිත-නිරෝධ-සමාපත්තියට කුමන ධර්ම කාරණා කීයක් මහත් උපකාරී වේද?\"\n\n\"ගෘහපතිය, ඔබ ඇසිය යුතු දේ අතුරින් ප්‍රථමයෙන්ම ඇසිය යුත්ත අසා සිටින්නෙහි. එහෙත්, මම ඔබට ඒ ගැන පිළිතුරු දෙන්නෙමි. ගෘහපතිය, සංඥා‍​-වේදයිත-නිරෝධ-සමාපත්තියට ධර්ම කාරණා දෙකක් මහත් උපකාරී වේ. එනම්: සමථය සහ විදර්ශනාවයි.\"",
      "paliTitle": "Dutiyakāmabhūsuttaṃ",
      "vagga": "",
      "englishTitle": "Second Sutta with Kāmabhū",
      "sinhalaTitle": "දුතිය කාමභූ සූත්‍රය"
    },
    {
      "number": 349,
      "pali": "Ekaṃ samayaṃ āyasmā godatto macchikāsaṇḍe viharati ambāṭakavane. Atha kho citto gahapati yenāyasmā godatto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ godattaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho cittaṃ gahapatiṃ āyasmā godatto etadavoca – ‘‘yā cāyaṃ, gahapati, appamāṇā cetovimutti, yā ca ākiñcaññā cetovimutti, yā ca suññatā cetovimutti, yā ca animittā cetovimutti, ime dhammā nānatthā nānābyañjanā udāhu ekatthā byañjanameva nāna’’nti? ‘‘Atthi, bhante, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā nānatthā ceva nānābyañjanā ca. Atthi pana, bhante, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā ekatthā byañjanameva nāna’’nti. ‘‘Katamo ca, bhante, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā nānatthā ceva nānābyañjanā ca? Idha, bhante, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ [catutthiṃ (?)]. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena [abyāpajjhena (sī. syā. kaṃ. pī.), abyābajjhena (?)] pharitvā viharati. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ, tathā tatiyaṃ, tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Ayaṃ vuccati, bhante, appamāṇā cetovimutti. ‘‘Katamā ca, bhante, ākiñcaññā cetovimutti? Idha, bhante, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma, ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Ayaṃ vuccati, bhante, ākiñcaññā cetovimutti. ‘‘Katamā ca, bhante, suññatā cetovimutti? Idha, bhante, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘suññamidaṃ attena vā attaniyena vā’ti. Ayaṃ vuccati, bhante, suññatā cetovimutti. ‘‘Katamā ca, bhante, animittā cetovimutti? Idha, bhante, bhikkhu sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja viharati. Ayaṃ vuccati, bhante, animittā cetovimutti. Ayaṃ kho, bhante, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā nānatthā ceva nānābyañjanā ca. ‘‘Katamo ca, bhante, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā ekatthā byañjanameva nānaṃ? Rāgo, bhante, pamāṇakaraṇo, doso pamāṇakaraṇo, moho pamāṇakaraṇo. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṃ anuppādadhammā. Yāvatā kho, bhante, appamāṇā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho pana akuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena. Rāgo kho, bhante, kiñcanaṃ, doso kiñcanaṃ, moho kiñcanaṃ. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṃ anuppādadhammā. Yāvatā kho, bhante, ākiñcaññā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho pana akuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena. Rāgo kho, bhante, nimittakaraṇo, doso nimittakaraṇo, moho nimittakaraṇo. Te khīṇāsavassa bhikkhuno pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṅkatā āyatiṃ anuppādadhammā. Yāvatā kho, bhante, animittā cetovimuttiyo, akuppā tāsaṃ cetovimutti aggamakkhāyati. Sā kho pana akuppā cetovimutti suññā rāgena, suññā dosena, suññā mohena. Ayaṃ kho, bhante, pariyāyo yaṃ pariyāyaṃ āgamma ime dhammā ekatthā byañjanameva nāna’’nti. ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te gambhīre buddhavacane paññācakkhu kamatī’’ti. Sattamaṃ.",
      "english": "At one time, the Venerable Godatta was dwelling at Macchikāsaṇḍa in the Ambāṭaka forest. Then Citta the householder approached the Venerable Godatta; having approached and greeted the Venerable Godatta, he sat down to one side.\n\nAs Citta the householder was sitting to one side, the Venerable Godatta said to him: \"Householder, these mental liberations – the immeasurable mental liberation, the mental liberation of nothingness, the mental liberation of emptiness, and the mental liberation of signlessness – are these phenomena different in meaning and different in phrasing, or are they one in meaning with only different phrasing?\"\n\n\"Venerable sir, there is a way in which, based on that way, these phenomena are different in meaning and also different in phrasing. But then again, Venerable sir, there is a way in which, based on that way, these phenomena are one in meaning with only different phrasing.\"\n\n\"And what, Venerable sir, is the way in which, based on that way, these phenomena are different in meaning and also different in phrasing? Here, Venerable sir, a monk dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, he dwells pervading the entire world—upwards, downwards, across, everywhere, in every respect, with a vast, expansive, immeasurable mind imbued with loving-kindness, free from enmity and ill-will.\n\nHe dwells pervading one direction with a mind imbued with compassion, likewise the second, likewise the third, likewise the fourth. Thus, he dwells pervading the entire world—upwards, downwards, across, everywhere, in every respect, with a vast, expansive, immeasurable mind imbued with compassion, free from enmity and ill-will.\n\nHe dwells pervading one direction with a mind imbued with appreciative joy, likewise the second, likewise the third, likewise the fourth. Thus, he dwells pervading the entire world—upwards, downwards, across, everywhere, in every respect, with a vast, expansive, immeasurable mind imbued with appreciative joy, free from enmity and ill-will.\n\nHe dwells pervading one direction with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus, he dwells pervading the entire world—upwards, downwards, across, everywhere, in every respect, with a vast, expansive, immeasurable mind imbued with equanimity, free from enmity and ill-will. This, Venerable sir, is called the immeasurable mental liberation.\n\n\"And what, Venerable sir, is the mental liberation of nothingness? Here, Venerable sir, a monk, having entirely transcended the sphere of infinite consciousness, enters and dwells in the sphere of nothingness, perceiving ‘there is nothing at all.’ This, Venerable sir, is called the mental liberation of nothingness.\n\n\"And what, Venerable sir, is the mental liberation of emptiness? Here, Venerable sir, a monk, having gone to a forest, or to the root of a tree, or to an empty dwelling, thus reflects: ‘This is empty of self or anything pertaining to self.’ This, Venerable sir, is called the mental liberation of emptiness.\n\n\"And what, Venerable sir, is the mental liberation of signlessness? Here, Venerable sir, a monk, by not attending to any signs, enters and dwells in the signless concentration of mind. This, Venerable sir, is called the mental liberation of signlessness.\n\n\"This, Venerable sir, is the way in which, based on that way, these phenomena are different in meaning and also different in phrasing.\"\n\n\"And what, Venerable sir, is the way in which, based on that way, these phenomena are one in meaning with only different phrasing? Greed, Venerable sir, creates measure; hatred creates measure; delusion creates measure. For a monk whose taints are destroyed, these are abandoned, uprooted, made like a palm stump, brought to non-existence, and are no longer subject to future arising. As far as immeasurable mental liberations are concerned, Venerable sir, the unshakeable mental liberation is declared to be the foremost among them. That unshakeable mental liberation, moreover, is empty of greed, empty of hatred, and empty of delusion.\n\n\"Greed, Venerable sir, is somethingness; hatred is somethingness; delusion is somethingness. For a monk whose taints are destroyed, these are abandoned, uprooted, made like a palm stump, brought to non-existence, and are no longer subject to future arising. As far as mental liberations of nothingness are concerned, Venerable sir, the unshakeable mental liberation is declared to be the foremost among them. That unshakeable mental liberation, moreover, is empty of greed, empty of hatred, and empty of delusion.\n\n\"Greed, Venerable sir, creates signs; hatred creates signs; delusion creates signs. For a monk whose taints are destroyed, these are abandoned, uprooted, made like a palm stump, brought to non-existence, and are no longer subject to future arising. As far as mental liberations of signlessness are concerned, Venerable sir, the unshakeable mental liberation is declared to be the foremost among them. That unshakeable mental liberation, moreover, is empty of greed, empty of hatred, and empty of delusion.\n\n\"This, Venerable sir, is the way in which, based on that way, these phenomena are one in meaning with only different phrasing.\"\n\n\"It is your gain, householder, well-gained by you, householder! Your eye of wisdom penetrates the profound teaching of the Buddha.\"",
      "sinhala": "එක් සමයක ආයුෂ්මත් ගොදත්ත ස්ථවිරයන් වහන්සේ මච්ඡිකාසණ්ඩයේ අම්බාටක වනයේ වැඩසිටියහ. එකල්හි චිත්ත ගෘහපතිතුමා ආයුෂ්මත් ගොදත්ත ස්ථවිරයන් වහන්සේ වෙත පැමිණ, උන්වහන්සේට වන්දනා කර එක් පසෙකින් වාඩිවිය. එක් පසෙකින් වාඩි වී සිටි චිත්ත ගෘහපතිතුමාට ආයුෂ්මත් ගොදත්ත ස්ථවිරයන් වහන්සේ මෙසේ වදාළහ: \"ගෘහපති, යම් මේ අප්පමාණා චේතෝවිමුක්තියක් වේද, යම් මේ ආකිඤ්චඤ්ඤා චේතෝවිමුක්තියක් වේද, යම් මේ සූඤ්ඤතා චේතෝවිමුක්තියක් වේද, යම් මේ අනිමිත්තා චේතෝවිමුක්තියක් වේද, මේ ධර්මයන් අර්ථයෙන් ද වෙනස්ද, ව්‍යංජනයෙන් ද වෙනස්ද? නැතහොත් අර්ථයෙන් එකක්ව, ව්‍යංජනයෙන් පමණක් වෙනස්ද?\" \"භන්තේ, යම් කරුණක් අරමුණු කොට මේ ධර්මයන් අර්ථයෙන් ද වෙනස්ව, ව්‍යංජනයෙන් ද වෙනස් වන පර්යායක් ඇත. භන්තේ, යම් කරුණක් අරමුණු කොට මේ ධර්මයන් අර්ථයෙන් එකක්ව, ව්‍යංජනයෙන් පමණක් වෙනස් වන පර්යායක් ද ඇත.\"\n\n\"භන්තේ, යම් කරුණක් අරමුණු කොට මේ ධර්මයන් අර්ථයෙන් ද වෙනස්ව, ව්‍යංජනයෙන් ද වෙනස් වන පර්යාය කුමක්ද? භන්තේ, මෙහිලා භික්ෂුවක් මෙත් සිතින් යුක්තව එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවැනි දිශාව, එසේම තුන්වැනි දිශාව, එසේම සිව්වැනි දිශාව ද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියල්ලන් තුළින්, සියලු ලෝකය විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ මෙත් සිතින් පැතිර වාසය කරයි. එසේම, භික්ෂුව කරුණා සිතින් යුක්තව එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවැනි දිශාව, එසේම තුන්වැනි දිශාව, එසේම සිව්වැනි දිශාව ද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියල්ලන් තුළින්, සියලු ලෝකය විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ කරුණා සිතින් පැතිර වාසය කරයි. එසේම, භික්ෂුව මුදිතා සිතින් යුක්තව එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවැනි දිශාව, එසේම තුන්වැනි දිශාව, එසේම සිව්වැනි දිශාව ද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියල්ලන් තුළින්, සියලු ලෝකය විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ මුදිතා සිතින් පැතිර වාසය කරයි. එසේම, භික්ෂුව උපේක්ඛා සිතින් යුක්තව එක් දිශාවක් පැතිර වාසය කරයි, එසේම දෙවැනි දිශාව, එසේම තුන්වැනි දිශාව, එසේම සිව්වැනි දිශාව ද පැතිර වාසය කරයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියල්ලන් තුළින්, සියලු ලෝකය විපුල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ උපේක්ඛා සිතින් පැතිර වාසය කරයි. භන්තේ, මේ අප්පමාණා චේතෝවිමුක්තිය යැයි කියනු ලැබේ.\"\n\n\"භන්තේ, ආකිඤ්චඤ්ඤා චේතෝවිමුක්තිය කවරේද? භන්තේ, මෙහිලා භික්ෂුවක් සියලු ආකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා, 'කිසිවක් නැතැ'යි සිතා ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. භන්තේ, මේ ආකිඤ්චඤ්ඤා චේතෝවිමුක්තිය යැයි කියනු ලැබේ.\"\n\n\"භන්තේ, සූඤ්ඤතා චේතෝවිමුක්තිය කවරේද? භන්තේ, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගිය කල, හෝ රුක් මුලකට ගිය කල, හෝ හිස් ගෙයකට ගිය කල, 'මෙය ආත්මයෙන් හෝ ආත්මයට අයත් දෙයකින් හෝ හිස් ය' යි මෙසේ මෙනෙහි කරයි. භන්තේ, මේ සූඤ්ඤතා චේතෝවිමුක්තිය යැයි කියනු ලැබේ.\"\n\n\"භන්තේ, අනිමිත්තා චේතෝවිමුක්තිය කවරේද? භන්තේ, මෙහිලා භික්ෂුවක් සියලු නිමිතිවලට මනසිකාර නොකිරීමෙන්, අනිමිත්ත චේතෝසමාධියට පැමිණ වාසය කරයි. භන්තේ, මේ අනිමිත්තා චේතෝවිමුක්තිය යැයි කියනු ලැබේ. භන්තේ, යම් කරුණක් අරමුණු කොට මේ ධර්මයන් අර්ථයෙන් ද වෙනස්ව, ව්‍යංජනයෙන් ද වෙනස් වන පර්යාය මෙයයි.\"\n\n\"භන්තේ, යම් කරුණක් අරමුණු කොට මේ ධර්මයන් අර්ථයෙන් එකක්ව, ව්‍යංජනයෙන් පමණක් වෙනස් වන පර්යාය කුමක්ද? භන්තේ, රාගය සීමා කරන්නකි, ද්වේෂය සීමා කරන්නකි, මෝහය සීමා කරන්නකි. ඒ රාග, ද්වේෂ, මෝහ ක්ෂීණාශ්‍රව භික්ෂුවකට ප්‍රහීණ කරනු ලැබ ඇත, මුලින් සිඳලනු ලැබ ඇත, තල් ගසක මුදුන කපා දැමූ කලක් මෙන් නැති කරනු ලැබ ඇත, නැවත ඇති නොවන ස්වභාවයට පත් කරනු ලැබ ඇත, අනාගතයේදී ඇති නොවන ධර්මතාවයෙන් යුක්තය. භන්තේ, යම්තාක් අප්පමාණා චේතෝවිමුක්ති ඇද්ද, ඒ සියල්ල අතුරින් අකුප්පා චේතෝවිමුක්තිය අග්‍ර යැයි කියනු ලැබේ. එම අකුප්පා චේතෝවිමුක්තිය රාගයෙන් ද හිස් ය, ද්වේෂයෙන් ද හිස් ය, මෝහයෙන් ද හිස් ය. භන්තේ, රාගය බැඳීම් ඇති කරන්නකි, ද්වේෂය බැඳීම් ඇති කරන්නකි, මෝහය බැඳීම් ඇති කරන්නකි. ඒ රාග, ද්වේෂ, මෝහ ක්ෂීණාශ්‍රව භික්ෂුවකට ප්‍රහීණ කරනු ලැබ ඇත, මුලින් සිඳලනු ලැබ ඇත, තල් ගසක මුදුන කපා දැමූ කලක් මෙන් නැති කරනු ලැබ ඇත, නැවත ඇති නොවන ස්වභාවයට පත් කරනු ලැබ ඇත, අනාගතයේදී ඇති නොවන ධර්මතාවයෙන් යුක්තය. භන්තේ, යම්තාක් ආකිඤ්චඤ්ඤා චේතෝවිමුක්ති ඇද්ද, ඒ සියල්ල අතුරින් අකුප්පා චේතෝවිමුක්තිය අග්‍ර යැයි කියනු ලැබේ. එම අකුප්පා චේතෝවිමුක්තිය රාගයෙන් ද හිස් ය, ද්වේෂයෙන් ද හිස් ය, මෝහයෙන් ද හිස් ය. භන්තේ, රාගය නිමිති ඇති කරන්නකි, ද්වේෂය නිමිති ඇති කරන්නකි, මෝහය නිමිති ඇති කරන්නකි. ඒ රාග, ද්වේෂ, මෝහ ක්ෂීණාශ්‍රව භික්ෂුවකට ප්‍රහීණ කරනු ලැබ ඇත, මුලින් සිඳලනු ලැබ ඇත, තල් ගසක මුදුන කපා දැමූ කලක් මෙන් නැති කරනු ලැබ ඇත, නැවත ඇති නොවන ස්වභාවයට පත් කරනු ලැබ ඇත, අනාගතයේදී ඇති නොවන ධර්මතාවයෙන් යුක්තය. භන්තේ, යම්තාක් අනිමිත්තා චේතෝවිමුක්ති ඇද්ද, ඒ සියල්ල අතුරින් අකුප්පා චේතෝවිමුක්තිය අග්‍ර යැයි කියනු ලැබේ. එම අකුප්පා චේතෝවිමුක්තිය රාගයෙන් ද හිස් ය, ද්වේෂයෙන් ද හිස් ය, මෝහයෙන් ද හිස් ය. භන්තේ, යම් කරුණක් අරමුණු කොට මේ ධර්මයන් අර්ථයෙන් එකක්ව, ව්‍යංජනයෙන් පමණක් වෙනස් වන පර්යාය මෙයයි.\"\n\n\"ගෘහපති, ඔබට ලාභයකි, ඔබට මනාකොට ලැබුණකි! මක්නිසාද යත්, ගැඹුරු වූ බුද්ධ වචනයෙහි ඔබගේ ප්‍රඥා චක්ෂුස විනිවිද යයි.\"",
      "paliTitle": "Godattasuttaṃ",
      "vagga": "",
      "englishTitle": "Godatta Sutta",
      "sinhalaTitle": "ගෝදත්ත සූත්‍රය"
    },
    {
      "number": 350,
      "pali": "Tena kho pana samayena nigaṇṭho nāṭaputto [nātaputto (sī.)] macchikāsaṇḍaṃ anuppatto hoti mahatiyā nigaṇṭhaparisāya saddhiṃ. Assosi kho citto gahapati – ‘‘nigaṇṭho kira nāṭaputto macchikāsaṇḍaṃ anuppatto mahatiyā nigaṇṭhaparisāya saddhi’’nti. Atha kho citto gahapati sambahulehi upāsakehi saddhiṃ yena nigaṇṭho nāṭaputto tenupasaṅkami; upasaṅkamitvā nigaṇṭhena nāṭaputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho cittaṃ gahapatiṃ nigaṇṭho nāṭaputto etadavoca – ‘‘saddahasi tvaṃ, gahapati, samaṇassa gotamassa – atthi avitakko avicāro samādhi, atthi vitakkavicārānaṃ nirodho’’ti? ‘‘Na khvāhaṃ ettha, bhante, bhagavato saddhāya gacchāmi. Atthi avitakko avicāro samādhi, atthi vitakkavicārānaṃ nirodho’’ti. Evaṃ vutte, nigaṇṭho nāṭaputto ulloketvā [sakaṃ parisaṃ apaloketvā (sī. syā. kaṃ.), oloketvā (sī. aṭṭha. syā. aṭṭha.)] etadavoca – ‘‘idaṃ bhavanto passantu, yāva ujuko cāyaṃ citto gahapati, yāva asaṭho cāyaṃ citto gahapati, yāva amāyāvī cāyaṃ citto gahapati, vātaṃ vā so jālena bādhetabbaṃ maññeyya, yo vitakkavicāre nirodhetabbaṃ maññeyya, sakamuṭṭhinā vā so gaṅgāya sotaṃ āvāretabbaṃ maññeyya, yo vitakkavicāre nirodhetabbaṃ maññeyyā’’ti. ‘‘Taṃ kiṃ maññasi, bhante, katamaṃ nu kho paṇītataraṃ – ñāṇaṃ vā saddhā vā’’ti? ‘‘Saddhāya kho, gahapati, ñāṇaṃyeva paṇītatara’’nti. ‘‘Ahaṃ kho, bhante, yāvadeva ākaṅkhāmi, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Ahaṃ kho, bhante, yāvadeva ākaṅkhāmi, vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharāmi. Ahaṃ kho, bhante, yāvadeva ākaṅkhāmi, pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharāmi. Ahaṃ kho, bhante, yāvadeva ākaṅkhāmi, sukhassa ca pahānā… pe… catutthaṃ jhānaṃ upasampajja viharāmi. Na so khvāhaṃ, bhante, evaṃ jānanto evaṃ passanto kassa aññassa samaṇassa vā brāhmaṇassa vā saddhāya gamissāmi? Atthi avitakko avicāro samādhi, atthi vitakkavicārānaṃ nirodho’’ti. Evaṃ vutte, nigaṇṭho nāṭaputto sakaṃ parisaṃ apaloketvā etadavoca – ‘‘idaṃ bhavanto passantu, yāva anujuko cāyaṃ citto gahapati, yāva saṭho cāyaṃ citto gahapati, yāva māyāvī cāyaṃ citto gahapatī’’ti. ‘‘Idāneva kho te [idāneva ca pana (syā. kaṃ. ka.)] mayaṃ, bhante, bhāsitaṃ – ‘evaṃ ājānāma idaṃ bhavanto passantu, yāva ujuko cāyaṃ citto gahapati, yāva asaṭho cāyaṃ citto gahapati, yāva amāyāvī cāyaṃ citto gahapatī’ti. Idāneva ca pana mayaṃ, bhante, bhāsitaṃ – ‘evaṃ ājānāma idaṃ bhavanto passantu, yāva anujuko cāyaṃ citto gahapati, yāva saṭho cāyaṃ citto gahapati, yāva māyāvī cāyaṃ citto gahapatī’ti. Sace te, bhante, purimaṃ saccaṃ, pacchimaṃ te micchā. Sace pana te, bhante, purimaṃ micchā, pacchimaṃ te saccaṃ. Ime kho pana, bhante, dasa sahadhammikā pañhā āgacchanti. Yadā nesaṃ atthaṃ ājāneyyāsi, atha maṃ paṭihareyyāsi saddhiṃ nigaṇṭhaparisāya. Eko pañho, eko uddeso, ekaṃ veyyākaraṇaṃ. Dve pañhā, dve uddesā, dve veyyākaraṇāni. Tayo pañhā, tayo uddesā, tīṇi veyyākaraṇāni. Cattāro pañhā, cattāro uddesā, cattāri veyyākaraṇāni. Pañca pañhā, pañca uddesā, pañca veyyākaraṇāni. Cha pañhā, cha uddesā, cha veyyākaraṇāni. Satta pañhā, satta uddesā, satta veyyākaraṇāni. Aṭṭha pañhā, aṭṭha uddesā, aṭṭha veyyākaraṇāni. Nava pañhā, nava uddesā, nava veyyākaraṇāni. Dasa pañhā, dasa uddesā, dasa veyyākaraṇānī’’ti. Atha kho citto gahapati nigaṇṭhaṃ nāṭaputtaṃ ime dasa sahadhammike pañhe āpucchitvā uṭṭhāyāsanā pakkāmīti. Aṭṭhamaṃ.",
      "english": "Now at that time, the ascetic Nāṭaputta had arrived at Macchikāsaṇḍa with a large assembly of Nigaṇṭhas. The householder Citta heard, \"Indeed, the ascetic Nāṭaputta has arrived at Macchikāsaṇḍa with a large assembly of Nigaṇṭhas.\" Then the householder Citta, together with several lay followers, went to where the ascetic Nāṭaputta was. Having approached, he exchanged courteous and memorable greetings with the ascetic Nāṭaputta, and then sat down to one side.\n\nTo the householder Citta, seated to one side, the ascetic Nāṭaputta spoke thus: \"Householder, do you believe the recluse Gotama when he says that there is concentration without initial application and sustained application, and that there is the cessation of initial application and sustained application?\" Citta replied, \"Venerable sir, in this matter, I do not proceed by mere faith in the Blessed One. There is concentration without initial application and sustained application; there is indeed the cessation of initial application and sustained application.\"\n\nWhen this was said, the ascetic Nāṭaputta looked around and then spoke thus: \"Sirs, observe this! How straightforward this householder Citta is, how guileless this householder Citta is, how free from deceit this householder Citta is! He who imagines one could stop initial application and sustained application might as well think he could restrain the wind with a net. Or he who imagines one could stop initial application and sustained application might as well think he could hold back the current of the Ganges with his fist.\"\n\n\"What do you think, Venerable sir,\" Citta asked, \"which is superior: knowledge or faith?\" \"Householder,\" replied Nāṭaputta, \"knowledge is indeed superior to faith.\"\n\n\"Venerable sir, whenever I wish, quite secluded from sensual pleasures and secluded from unwholesome states, I enter and remain in the first absorption, which is accompanied by initial application and sustained application, born of seclusion, with rapture and pleasure. Venerable sir, whenever I wish, with the subsiding of initial application and sustained application, I enter and remain in the second absorption, which is internal assurance and unification of mind, without initial application and sustained application, born of concentration, with rapture and pleasure. Venerable sir, whenever I wish, with the fading away of rapture, I abide in equanimity, mindful and clearly comprehending, and I experience pleasure with the body; I enter and remain in the third absorption, of which the Noble Ones declare: 'He is equanimous and mindful, dwelling in pleasure.' Venerable sir, whenever I wish, with the abandoning of pleasure and pain, and with the previous disappearance of joy and distress, I enter and remain in the fourth absorption, which is neither painful nor pleasant, and purified by equanimity and mindfulness. Knowing thus, seeing thus, Venerable sir, shall I then proceed by mere faith in any other recluse or brahmin? There is indeed concentration without initial application and sustained application; there is the cessation of initial application and sustained application.\"\n\nWhen this was said, the ascetic Nāṭaputta looked at his assembly and spoke thus: \"Sirs, observe this! How crooked this householder Citta is, how cunning this householder Citta is, how deceitful this householder Citta is!\"\n\n\"Venerable sir, just now you spoke, and we understood, 'Sirs, observe this! How straightforward this householder Citta is, how guileless this householder Citta is, how free from deceit this householder Citta is!' And just now you also spoke, and we understood, 'Sirs, observe this! How crooked this householder Citta is, how cunning this householder Citta is, how deceitful this householder Citta is!' If your former statement was true, then your latter statement is false. But if your former statement was false, then your latter statement is true. And Venerable sir, these ten questions concerning the Dhamma arise. When you understand their meaning, then you may approach me with your Nigaṇṭha assembly. One question, one topic, one explanation. Two questions, two topics, two explanations. Three questions, three topics, three explanations. Four questions, four topics, four explanations. Five questions, five topics, five explanations. Six questions, six topics, six explanations. Seven questions, seven topics, seven explanations. Eight questions, eight topics, eight explanations. Nine questions, nine topics, nine explanations. Ten questions, ten topics, ten explanations.\" Then the householder Citta, having asked these ten Dhamma-related questions of the ascetic Nāṭaputta, rose from his seat and departed.",
      "sinhala": "ඒ දවසෙහි නිගණ්ඨ නාටපුත්ත මහත් නිගණ්ඨ පිරිසක් සමඟ මැච්ඡිකාසණ්ඩයට පැමිණ සිටියේය. චිත්ත ගෘහපතිට ආරංචි විය, “නිගණ්ඨ නාටපුත්ත මහත් නිගණ්ඨ පිරිසක් සමඟ මැච්ඡිකාසණ්ඩයට පැමිණ සිටින්නේය” කියා. ඉක්බිති චිත්ත ගෘහපති බොහෝ උපාසකවරුන් සමඟ නිගණ්ඨ නාටපුත්ත සිටි තැනට පැමිණියේය; පැමිණ නිගණ්ඨ නාටපුත්ත සමඟ ප්‍රියසම්භාෂණයේ යෙදිණි. සුහදශීලී, සිත් සතුටු කරවන කතාබහක් පවත්වා එක්පසෙකින් වාඩි විය. එක්පසෙකින් වාඩි වී සිටි චිත්ත ගෘහපතිට නිගණ්ඨ නාටපුත්ත මෙසේ කීවේය: “ගෘහපතිය, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේගේ මේ වචනය විශ්වාස කරනවාද? එනම්, විතර්ක රහිත වූද, විචාර රහිත වූද සමාධියක් ඇත, විතර්ක හා විචාරයන්ගේ නිරෝධයක් ඇත” යනුවෙන්? “පින්වත, මෙහිදී මම භාග්‍යවතුන් වහන්සේගේ වචනය විශ්වාසයෙන් පිළිගන්නේ නැත. විතර්ක රහිත වූද, විචාර රහිත වූද සමාධියක් ඇත, විතර්ක හා විචාරයන්ගේ නිරෝධයක්ද ඇත.” මෙසේ කී කල්හි නිගණ්ඨ නාටපුත්ත තම පිරිස දෙස බලා මෙසේ කීවේය: “පින්වතුනි, මෙය බලන්න! මේ චිත්ත ගෘහපති කෙතරම් ඍජු කෙනෙක්ද, කෙතරම් වංචා රහිත කෙනෙක්ද, කෙතරම් මායා රහිත කෙනෙක්දැයි! යමෙක් විතර්ක හා විචාරයන් නිරුද්ධ කළ හැකි යැයි සිතන්නේද, ඔහු දැලකින් සුළඟ බැඳිය හැකි යැයි සිතන්නකු බඳුය. නැතහොත් යමෙක් විතර්ක හා විචාරයන් නිරුද්ධ කළ හැකි යැයි සිතන්නේද, ඔහු තම මිටෙන් ගංගා ප්‍රවාහය අවහිර කළ හැකි යැයි සිතන්නකු බඳුය.”\n\n“පින්වත, ඔබ කුමක් සිතනවාද? ඥානයද, නැතිනම් ශ්‍රද්ධාවද, මේ දෙකින් වඩා උසස් කුමක්ද?” “ගෘහපතිය, ශ්‍රද්ධාවට වඩා ඥානයම උසස්ය.”\n\n“පින්වත, මම යම්තාක් කැමති වෙම්ද, කාමයන්ගෙන් සම්පූර්ණයෙන්ම වෙන්වද, අකුසල ධර්මයන්ගෙන් සම්පූර්ණයෙන්ම වෙන්වද, විතර්ක සහිත වූද, විචාර සහිත වූද, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති, ප්‍රථම ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මම යම්තාක් කැමති වෙම්ද, විතර්ක හා විචාරයන්ගේ සංසිඳීමෙන්, ඇතුළත පැහැදීමෙන්, සිතේ එකඟ භාවයෙන් හටගත්, විතර්ක රහිත, විචාර රහිත, සමාධිජ ප්‍රීති-සැප ඇති, දෙවෙනි ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මම යම්තාක් කැමති වෙම්ද, ප්‍රීතියේ විරාගයෙන්, උපේක්ෂා සහගතව වාසය කරමි; සිහි නුවණින් යුක්තව කයින් සුවය විඳිමි, යමක් ආර්යයෝ උපේක්ෂා සහිත සිහි නුවණින් යුක්තව සුවසේ වාසය කරනවා යැයි පවසත්ද, ඒ තෙවෙනි ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මම යම්තාක් කැමති වෙම්ද, සැපයද පහ කිරීමෙන්, දුකද පහ කිරීමෙන්, පෙර තිබූ සෝමනස්ස හා දෝමනස්සයන්ගේ අතුරුදන් වීමෙන්, දුක් රහිත වූද, සැප රහිත වූද, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිවුවෙනි ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මෙසේ දන්නා, මෙසේ දක්නා වූ මම අන් කිසිදු ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකුගේ වචනය විශ්වාසයෙන් පිළිගන්නෙම්ද? විතර්ක රහිත වූද, විචාර රහිත වූද සමාධියක් ඇත, විතර්ක හා විචාරයන්ගේ නිරෝධයක්ද ඇත.”\n\nමෙසේ කී කල්හි නිගණ්ඨ නාටපුත්ත තම පිරිස දෙස බලා මෙසේ කීවේය: “පින්වතුනි, මෙය බලන්න! මේ චිත්ත ගෘහපති කෙතරම් ඍජු නොවන කෙනෙක්ද, කෙතරම් වංචනික කෙනෙක්ද, කෙතරම් මායාවී කෙනෙක්දැයි!” “(චිත්ත ගෘහපති කීවේය) “පින්වත, දැන්ම ඔබ අපට මෙසේ කීවේය: ‘පින්වතුනි, බලන්න, මේ චිත්ත ගෘහපති කෙතරම් ඍජු කෙනෙක්ද, කෙතරම් වංචා රහිත කෙනෙක්ද, කෙතරම් මායා රහිත කෙනෙක්දැයි!’ නැවතත්, දැන්ම ඔබ අපට මෙසේ කීවේය: ‘පින්වතුනි, බලන්න, මේ චිත්ත ගෘහපති කෙතරම් ඍජු නොවන කෙනෙක්ද, කෙතරම් වංචනික කෙනෙක්ද, කෙතරම් මායාවී කෙනෙක්දැයි!’ පින්වත, ඔබගේ පෙර කථාව සත්‍ය නම්, පසුව කී කථාව මිත්‍යාවකි. නැතහොත්, පින්වත, ඔබගේ පෙර කථාව මිත්‍යා නම්, පසුව කී කථාව සත්‍යයකි. පින්වත, ධර්මයට අනුකූල වූ මේ ප්‍රශ්න දහයක් පැන නගී. ඔබ යම් කලෙක ඒවායේ අර්ථය අවබෝධ කරගන්නේද, එවිට නිගණ්ඨ පිරිස සමඟින් මා වෙත නැවත පැමිණෙන්න. එක් ප්‍රශ්නයකි, එක් විස්තරයකි, එක් විවරණයකි. ප්‍රශ්න දෙකකි, විස්තර දෙකකි, විවරණ දෙකකි. ප්‍රශ්න තුනකි, විස්තර තුනකි, විවරණ තුනකි. ප්‍රශ්න සතරකි, විස්තර සතරකි, විවරණ සතරකි. ප්‍රශ්න පහකි, විස්තර පහකි, විවරණ පහකි. ප්‍රශ්න හයකි, විස්තර හයකි, විවරණ හයකි. ප්‍රශ්න හතකි, විස්තර හතකි, විවරණ හතකි. ප්‍රශ්න අටකි, විස්තර අටකි, විවරණ අටකි. ප්‍රශ්න නවයකි, විස්තර නවයකි, විවරණ නවයකි. ප්‍රශ්න දහයකි, විස්තර දහයකි, විවරණ දහයකි.” ඉක්බිති චිත්ත ගෘහපති නිගණ්ඨ නාටපුත්තගෙන් ධර්මයට අනුකූල වූ මේ ප්‍රශ්න දහය අසා, ආසනයෙන් නැගිට පිටත්ව ගියේය.",
      "paliTitle": "Nigaṇṭhanāṭaputtasuttaṃ",
      "vagga": "",
      "englishTitle": "To Nigaṇṭha Nāṭaputta Sutta",
      "sinhalaTitle": "නිගණ්ඨනාටපුත්ත සූත්‍රය"
    },
    {
      "number": 351,
      "pali": "Tena kho pana samayena acelo kassapo macchikāsaṇḍaṃ anuppatto hoti cittassa gahapatino purāṇagihisahāyo. Assosi kho citto gahapati – ‘‘acelo kira kassapo macchikāsaṇḍaṃ anuppatto amhākaṃ purāṇagihisahāyo’’ti. Atha kho citto gahapati yena acelo kassapo tenupasaṅkami; upasaṅkamitvā acelena kassapena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho citto gahapati acelaṃ kassapaṃ etadavoca – ‘‘kīvaciraṃ pabbajitassa, bhante, kassapā’’ti? ‘‘Tiṃsamattāni kho me, gahapati, vassāni pabbajitassā’’ti. ‘‘Imehi pana te, bhante, tiṃsamattehi vassehi atthi koci uttarimanussadhammā [uttarimanussadhammo (syā. kaṃ.)] alamariyañāṇadassanaviseso adhigato phāsuvihāro’’ti? ‘‘Imehi kho me, gahapati, tiṃsamattehi vassehi pabbajitassa natthi koci uttarimanussadhammā alamariyañāṇadassanaviseso adhigato phāsuvihāro, aññatra naggeyyā ca muṇḍeyyā ca pāvaḷanipphoṭanāya cā’’ti. Evaṃ vutte, citto gahapati acelaṃ kassapaṃ etadavoca – ‘‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Dhammassa svākkhātatā [sabbatthapi evameva dissati] yatra hi nāma tiṃsamattehi vassehi na koci uttarimanussadhammā alamariyañāṇadassanaviseso adhigato abhavissa phāsuvihāro, aññatra naggeyyā ca muṇḍeyyā ca pāvaḷanipphoṭanāya cā’’ti! ‘‘Tuyhaṃ pana, gahapati, kīvaciraṃ upāsakattaṃ upagatassā’’ti? ‘‘Mayhampi kho pana, bhante, tiṃsamattāni vassāni upāsakattaṃ upagatassā’’ti. ‘‘Imehi pana te, gahapati, tiṃsamattehi vassehi atthi koci uttarimanussadhammā alamariyañāṇadassanaviseso adhigato phāsuvihāro’’ti? ‘‘Gihinopi siyā, bhante. Ahañhi, bhante, yāvadeva ākaṅkhāmi, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Ahañhi, bhante, yāvadeva ākaṅkhāmi, vitakkavicārānaṃ vūpasamā …pe… dutiyaṃ jhānaṃ upasampajja viharāmi. Ahañhi, bhante, yāvadeva ākaṅkhāmi, pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharāmi. Ahañhi, bhante, yāvadeva ākaṅkhāmi, sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharāmi. Sace kho panāhaṃ, bhante, bhagavato [bhagavatā (syā. kaṃ.)] paṭhamataraṃ kālaṃ kareyyaṃ, anacchariyaṃ kho panetaṃ yaṃ maṃ bhagavā evaṃ byākareyya – ‘natthi taṃ saṃyojanaṃ yena saṃyojanena saṃyutto citto gahapati puna imaṃ lokaṃ āgaccheyyā’’’ti. Evaṃ vutte, acelo kassapo cittaṃ gahapatiṃ etadavoca – ‘‘acchariyaṃ vata bho, abbhutaṃ vata bho! Dhammassa svākkhātatā, yatra hi nāma gihī odātavasano [gihī odātavasanā (sī. pī.)] evarūpaṃ uttarimanussadhammā alamariyañāṇadassanavisesaṃ adhigamissati [adhigamissanti (sī. pī.)] phāsuvihāraṃ. Labheyyāhaṃ, gahapati, imasmiṃ dhammavinaye pabbajjaṃ, labheyyaṃ upasampada’’nti. Atha kho citto gahapati acelaṃ kassapaṃ ādāya yena therā bhikkhū tenupasaṅkami; upasaṅkamitvā there bhikkhū etadavoca – ‘‘ayaṃ, bhante, acelo kassapo amhākaṃ purāṇagihisahāyo. Imaṃ therā pabbājentu upasampādentu. Ahamassa ussukkaṃ karissāmi cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārāna’’nti. Alattha kho acelo kassapo imasmiṃ dhammavinaye pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno ca panāyasmā kassapo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā kassapo arahataṃ ahosīti. Navamaṃ.",
      "english": "Now at that time, the naked ascetic Kassapa had arrived at Macchikāsaṇḍa. He was an old householder friend of Citta the householder. Citta the householder heard, \"Indeed, the naked ascetic Kassapa, our old householder friend, has arrived at Macchikāsaṇḍa.\" Then Citta the householder approached the naked ascetic Kassapa; having approached, he exchanged greetings with the naked ascetic Kassapa. Having concluded courteous and memorable talk, he sat down to one side. As he sat to one side, Citta the householder said to the naked ascetic Kassapa, \"How long has it been since you went forth, venerable Kassapa?\" \"Householder, it has been approximately thirty years since I went forth.\" \"And venerable sir, in these thirty years, have you attained any superhuman states, any distinction in noble knowledge and vision, or comfortable abiding?\" \"Householder, in these thirty years since I went forth, I have not attained any superhuman states, any distinction in noble knowledge and vision, or comfortable abiding, apart from being naked, having a shaven head, and pulling out my beard.\" When this was said, Citta the householder said to the naked ascetic Kassapa, \"Indeed, it is amazing, indeed it is astounding! How well proclaimed the Dhamma is, that in thirty years, one would not attain any superhuman states, any distinction in noble knowledge and vision, or comfortable abiding, apart from being naked, having a shaven head, and pulling out one's beard!\" \"And you, householder, how long has it been since you became a lay follower?\" \"Venerable sir, it has also been approximately thirty years since I became a lay follower.\" \"And you, householder, in these thirty years, have you attained any superhuman states, any distinction in noble knowledge and vision, or comfortable abiding?\" \"Venerable sir, even a householder may attain such. For I, venerable sir, whenever I wish, secluded from sensual pleasures, secluded from unskillful qualities, with directed thought and evaluation, born of seclusion, with rapture and pleasure, I enter and remain in the first jhāna. For I, venerable sir, whenever I wish, with the stilling of directed thought and evaluation, with internal assurance, unification of mind, without directed thought and evaluation, born of concentration, with rapture and pleasure, I enter and remain in the second jhāna. For I, venerable sir, whenever I wish, with the fading away of rapture, I dwell in equanimity, mindful and clearly comprehending, experiencing pleasure with the body, of which the Noble Ones declare: 'Dwelling in equanimity, mindful, and experiencing pleasure,' I enter and remain in the third jhāna. For I, venerable sir, whenever I wish, with the abandoning of pleasure and the abandoning of pain, and with the previous disappearance of joy and grief, I enter and remain in the fourth jhāna, which is neither painful nor pleasant, but purified by equanimity and mindfulness. And if, venerable sir, I were to pass away before the Blessed One, it would not be surprising if the Blessed One were to declare concerning me: 'There is no fetter by which Citta the householder is bound that would cause him to return to this world.'\" When this was said, the naked ascetic Kassapa said to Citta the householder, \"Indeed, it is amazing, indeed it is astounding! How well proclaimed the Dhamma is, whereby a householder, dressed in white, would attain such superhuman states, such a distinction in noble knowledge and vision, such comfortable abiding! Householder, may I receive ordination in this Dhamma and Discipline, may I receive full admission.\" Then Citta the householder, taking the naked ascetic Kassapa, approached the elder monks; having approached, he said to the elder monks, \"Venerable sirs, this naked ascetic Kassapa is our old householder friend. May the venerable sirs ordain him and give him full admission. I will take responsibility for his robes, almsfood, lodging, and requisites for the sick, including medicine.\" Then the naked ascetic Kassapa received ordination in this Dhamma and Discipline; he received full admission. And not long after his full admission, Venerable Kassapa, dwelling alone, secluded, diligent, ardent, and resolute, before long, with his own direct knowledge, in this very life, realized, entered, and remained in that unsurpassed culmination of the holy life for the sake of which clansmen rightly go forth from home into homelessness. He understood: \"Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.\" And Venerable Kassapa became one of the Arahants.",
      "sinhala": "එසමයෙහි අචේල කාශ්‍යප නම් වූ තවුසා මැක්කෑසණ්ඩයට පැමිණ සිටියේය. හෙතෙමේ සිටි ගෘහපතිගේ පෙර ගිහි මිතුරා විය.\nසිටි ගෘහපති තෙමේ, “අපගේ පෙර ගිහි මිත්‍ර වූ අචේල කාශ්‍යප නම් තවුසා මැක්කෑසණ්ඩයට පැමිණ සිටී” යැයි ඇසීය.\nඉක්බිති සිටි ගෘහපති තෙමේ, අචේල කාශ්‍යප තවුසා සිටි තැනට එළඹියේය; එළඹ, අචේල කාශ්‍යප තවුසා සමඟ සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බස් නිමවා එකත්පසෙක වාඩි විය.\nඑකත්පසෙක වාඩි වූ සිටි ගෘහපති තෙමේ අචේල කාශ්‍යප තවුසාට මෙය කීය: “පින්වත් කාශ්‍යපයන් වහන්ස, කොපමණ කලකට පෙර පැවිදි වූ කෙනෙක්ද?”\n“ගෘහපතිය, මම පැවිදි වී වසර තිහක් පමණ වේ.”\n“පින්වත්නි, ඔබ මෙම තිස් වසර තුළදී කිසියම් උත්තරිමනුස්ස ධර්මයක්, ආර්ය වූ ඥාණදර්ශන විශේෂයක් හෝ සුව විහරණයක් ලබා ගත්තේද?”\n“ගෘහපතිය, මා පැවිදි වී ගත වූ මෙම තිස් වසර තුළදී කිසිදු උත්තරිමනුස්ස ධර්මයක්, ආර්ය වූ ඥාණදර්ශන විශේෂයක් හෝ සුව විහරණයක් ලබාගෙන නැත, නග්න භාවයද, හිස මුඩු කිරීමද, කෙස් සින්දීමද හැර.”\nමෙලෙස කී විට, සිටි ගෘහපති තෙමේ අචේල කාශ්‍යප තවුසාට මෙසේ කීය: “පුදුමයක්මය, පින්වත, ආශ්චර්යයක්මය, පින්වත! ධර්මය කෙතරම් මැනවින් ප්‍රකාශ කර ඇත්තේද යත්, මෙහිදී තිස් වසරක් පමණ පැවිදිව සිටි තැනැත්තකුට, නග්න භාවයද, හිස මුඩු කිරීමද, කෙස් සින්දීමද හැර, කිසිදු උත්තරිමනුස්ස ධර්මයක්, ආර්ය වූ ඥාණදර්ශන විශේෂයක් හෝ සුව විහරණයක් අත් වී නැත!”\n“ගෘහපතිය, ඔබ උපාසක භාවයට පත් වී කොපමණ කලක්ද?”\n“පින්වත, මාද උපාසක භාවයට පත් වී වසර තිහක් පමණ වේ.”\n“ගෘහපතිය, ඔබ මෙම තිස් වසර තුළදී කිසියම් උත්තරිමනුස්ස ධර්මයක්, ආර්ය වූ ඥාණදර්ශන විශේෂයක් හෝ සුව විහරණයක් ලබා ගත්තේද?”\n“පින්වත, ගිහි වූවකුට වුවද එය විය හැකිය. පින්වත, මා යම්තාක් කල් කැමතිනම්, කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූද, විචාර සහිත වූද, විවේකයෙන් හටගත් ප්‍රීති සහ සුඛය ඇති පළමු ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මා යම්තාක් කල් කැමතිනම්, විතර්ක විචාරයන් සංසිඳුවීමෙන්, අධ්‍යාත්මිකව පහදවා ගැනීමෙන්, සිතේ එකඟ භාවය ඇති කරගෙන, විතර්ක රහිතව, විචාර රහිතව, සමාධියෙන් හටගත් ප්‍රීති සහ සුඛය ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මා යම්තාක් කල් කැමතිනම්, ප්‍රීතිය කෙරෙහිද නොඇල්මෙන්, උපේක්ෂාවෙන් යුතුව වාසය කරමින්, සිහියෙන් හා මනා දැනුමෙන් යුතුව, කයින්ද සුඛය අනුභව කරමින්, “උපේක්ෂාවෙන් යුක්ත වූද, සිහි ඇත්තා වූද, සුව විහරණ ඇත්තා වූද තැනැත්තා” යැයි ආර්යයෝ යමක් හඳුන්වද්ද, ඒ තෙවන ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මා යම්තාක් කල් කැමතිනම්, සුඛය දුරු කිරීමෙන්ද, දුක දුරු කිරීමෙන්ද, පෙරදී පැවති සෝමනස්ස දෝමනස්සයන්ගේ අභාවයෙන්ද, දුක් රහිත වූද, සුඛ රහිත වූද, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට එළඹ වාසය කරමි. පින්වත, මම භාග්‍යවතුන් වහන්සේට පළමුව කලක් කළොත්, මා පිළිබඳව භාග්‍යවතුන් වහන්සේ මෙසේ ප්‍රකාශ කරන්නේ නම් එය පුදුමයක් නොවේ: ‘යම් සංයෝජනයකින් බැඳී සිටි සිටි ගෘහපති නැවත මේ ලෝකයට පැමිණෙන්නේද, එවන් සංයෝජනයක් නැතැ’ යි.”\nමෙලෙස කී විට, අචේල කාශ්‍යප තෙමේ සිටි ගෘහපතිට මෙසේ කීය: “පුදුමයක්මය, පින්වත, ආශ්චර්යයක්මය, පින්වත! ධර්මය කෙතරම් මැනවින් ප්‍රකාශ කර ඇත්තේද යත්, මෙහිදී සුදු වස්ත්‍ර හැඳගත් ගිහියෙකුට වුවද එවැනි උත්තරිමනුස්ස ධර්මයක්, ආර්ය වූ ඥාණදර්ශන විශේෂයක් වූ සුව විහරණයක් ලබා ගත හැකිය. ගෘහපතිය, මේ ධර්ම විනයෙහි මට පැවිද්ද ලැබෙන්නේ නම්, උපසම්පදාව ලැබෙන්නේ නම්!”\nඉක්බිති සිටි ගෘහපති තෙමේ අචේල කාශ්‍යප තවුසාද කැටුව, ථේර භික්ෂූන් වහන්සේලා සිටි තැනට එළඹියේය; එළඹ, ථේර භික්ෂූන් වහන්සේලාට මෙසේ කීය: “පින්වත්නි, මේ අචේල කාශ්‍යප අපගේ පෙර ගිහි මිතුරායි. ඔබ වහන්සේලා මොහු පැවිදි කරවනු මැනවි, උපසම්පදා කරවනු මැනවි. මම මොහුට සිවුරු, පිණ්ඩපාත, සේනාසන සහ ගිලන්පස බෙහෙත් පිරිකර පිළිබඳව උත්සුක වන්නෙමි.”\nඅචේල කාශ්‍යප තෙමේ මේ ධර්ම විනයෙහි පැවිද්දද ලැබීය, උපසම්පදාවද ලැබීය.\nවැඩි කලක් නොගොස් උපසම්පදාව ලැබූ ආයුෂ්මත් කාශ්‍යප තෙමේ තනිව, වෙන්ව, අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් වාසය කරමින්, කුලපුත්‍රයන් නිසි ලෙස ගිහිගෙයින් නික්ම අනගාරිකභාවයට පැවිදි වන්නේ යම් අරමුණක් සඳහාද, ඒ අනුත්තර වූ බ්‍රහ්මචර්‍යාවේ කෙළවර වූ අරහත් ඵලය මේ අත්භවයෙහිදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට, එයට එළඹ වාසය කළේය.\n“ජාතිය ක්ෂය විය, බ්‍රහ්මචර්‍යාව විසූ සේක, කළ යුතු දේ කෙළේය, මේ සඳහා නැවත කළ යුතු කිසිවක් නැතැ” යි ඔහු අවබෝධ කළේය.\nඒ ආයුෂ්මත් කාශ්‍යප තෙමේ අරහතුන් වහන්සේලාගෙන් එක් නමක් විය.",
      "paliTitle": "Acelakassapasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Naked Ascetic Kassapa",
      "sinhalaTitle": "අචේලකස්සප සූත්‍රය"
    },
    {
      "number": 352,
      "pali": "Tena kho pana samayena citto gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho sambahulā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā saṅgamma samāgamma cittaṃ gahapatiṃ etadavocuṃ – ‘‘paṇidhehi, gahapati, anāgatamaddhānaṃ rājā assaṃ cakkavattī’’ti. Evaṃ vutte, citto gahapati tā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā etadavoca – ‘‘tampi aniccaṃ, tampi addhuvaṃ, tampi pahāya gamanīya’’nti. Evaṃ vutte, cittassa gahapatino mittāmaccā ñātisālohitā cittaṃ gahapatiṃ etadavocuṃ – ‘‘satiṃ, ayyaputta, upaṭṭhapehi, mā vippalapī’’ti. ‘‘Kiṃ tāhaṃ vadāmi yaṃ maṃ tumhe evaṃ vadetha – ‘satiṃ, ayyaputta, upaṭṭhapehi, mā vippalapī’’’ti? ‘‘Evaṃ kho tvaṃ, ayyaputta, vadesi – ‘tampi aniccaṃ, tampi addhuvaṃ, tampi pahāya gamanīya’’’nti. ‘‘Tathā hi pana maṃ ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā evamāhaṃsu – ‘paṇidhehi, gahapati, anāgatamaddhānaṃ rājā assaṃ cakkavattī’ti. Tāhaṃ evaṃ vadāmi – ‘tampi aniccaṃ…pe… tampi pahāya gamanīya’’’nti. ‘‘Kiṃ pana tā, ayyaputta, ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā atthavasaṃ sampassamānā evamāhaṃsu – ‘paṇidhehi, gahapati, anāgatamaddhānaṃ rājā assaṃ cakkavattī’’’ti? ‘‘Tāsaṃ kho ārāmadevatānaṃ vanadevatānaṃ rukkhadevatānaṃ osadhitiṇavanappatīsu adhivatthānaṃ devatānaṃ evaṃ hoti – ‘ayaṃ kho citto gahapati, sīlavā [sīlavanto (ka.)] kalyāṇadhammo. Sace paṇidahissati – anāgatamaddhānaṃ rājā assaṃ cakkavattī’ti, ‘tassa kho ayaṃ ijjhissati, sīlavato cetopaṇidhi visuddhattā dhammiko dhammikaṃ phalaṃ anupassatī’ti. Imaṃ kho tā ārāmadevatā vanadevatā rukkhadevatā osadhitiṇavanappatīsu adhivatthā devatā atthavasaṃ sampassamānā evamāhaṃsu – ‘paṇidhehi, gahapati, anāgatamaddhānaṃ rājā assaṃ cakkavattī’ti. Tāhaṃ evaṃ vadāmi – ‘tampi aniccaṃ, tampi addhuvaṃ, tampi pahāya gamanīya’’’nti. ‘‘Tena hi, ayyaputta, amhepi ovadāhī’’ti. ‘‘Tasmā hi vo evaṃ sikkhitabbaṃ – buddhe aveccappasādena samannāgatā bhavissāma – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Dhamme aveccappasādena samannāgatā bhavissāma – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Saṅghe aveccappasādena samannāgatā bhavissāma – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Yaṃ kho pana kiñci kule deyyadhammaṃ sabbaṃ taṃ appaṭivibhattaṃ bhavissati sīlavantehi kalyāṇadhammehīti evañhi vo sikkhitabba’’nti. Atha kho citto gahapati mittāmacce ñātisālohite buddhe ca dhamme ca saṅghe ca cāge ca samādapetvā kālamakāsīti. Dasamaṃ. ",
      "english": "At that time, Citta the householder was afflicted, suffering, gravely ill. Then, many devas dwelling in parks, forest devas, tree devas, and devas residing in herbs, grasses, and shrubs, having gathered together, addressed Citta the householder thus: \"Make a resolve, householder, that in the future you shall be a Wheel-turning Monarch.\" When this was said, Citta the householder replied to those devas dwelling in parks, forest devas, tree devas, and devas residing in herbs, grasses, and shrubs: \"That too is impermanent, that too is unstable, that too is to be abandoned and departed from.\"\n\nWhen this was said, Citta the householder’s friends, ministers, relatives, and kinsmen addressed Citta the householder thus: \"Maintain your mindfulness, dear son, do not babble incoherently.\" \"What did I say that you tell me this: 'Maintain your mindfulness, dear son, do not babble incoherently'?\" \"Indeed, dear son, you said this: 'That too is impermanent, that too is unstable, that too is to be abandoned and departed from.'\" \"Because the devas dwelling in parks, forest devas, tree devas, and devas residing in herbs, grasses, and shrubs told me this: 'Make a resolve, householder, that in the future you shall be a Wheel-turning Monarch.' It is to them that I say: 'That too is impermanent, that too is unstable, that too is to be abandoned and departed from.'\"\n\n\"For what reason, dear son, did those devas dwelling in parks, forest devas, tree devas, and devas residing in herbs, grasses, and shrubs, seeing some benefit, tell you this: 'Make a resolve, householder, that in the future you shall be a Wheel-turning Monarch'?\" \"It was to those devas dwelling in parks, forest devas, tree devas, and devas residing in herbs, grasses, and shrubs that this thought occurred: 'This Citta the householder is virtuous and of beautiful conduct. If he makes a resolve to be a Wheel-turning Monarch in the future, then this resolve will succeed for him, because the mental aspiration of a virtuous person, being purified, leads to a righteous, wholesome fruit.' Seeing this benefit, those devas dwelling in parks, forest devas, tree devas, and devas residing in herbs, grasses, and shrubs told me this: 'Make a resolve, householder, that in the future you shall be a Wheel-turning Monarch.' It is to them that I say: 'That too is impermanent, that too is unstable, that too is to be abandoned and departed from.'\"\n\n\"Then, dear son, instruct us too.\" \"Therefore, you should train yourselves thus: 'We shall be endowed with unwavering faith in the Buddha: \"Indeed, the Blessed One is an Arahant, perfectly enlightened, accomplished in knowledge and conduct, sublime, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.\" We shall be endowed with unwavering faith in the Dhamma: \"The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, leading inwards, to be personally experienced by the wise.\" We shall be endowed with unwavering faith in the Saṅgha: \"The Saṅgha of the Blessed One's disciples is practicing well, the Saṅgha of the Blessed One's disciples is practicing uprightly, the Saṅgha of the Blessed One's disciples is practicing insightfully, the Saṅgha of the Blessed One's disciples is practicing properly—that is, the four pairs of persons, the eight types of individuals. This Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.\" And whatever gifts there are in the household, all those shall be shared unreservedly with the virtuous and those of beautiful conduct. This is how you should train yourselves.'\"\n\nThen, Citta the householder, having thus established his friends, ministers, relatives, and kinsmen in the Buddha, the Dhamma, the Saṅgha, and in generosity, passed away.",
      "sinhala": "ඒ දවසෙහි චිත්ත ගෘහපති තදබල ලෙස ගිලන්ව, දුකට පත්ව, රෝගාතුරව සිටියේය.\n\nඉන්පසු බොහෝ ආරාම දේවතාවෝ, වන දේවතාවෝ, රුක් දේවතාවෝ, ඖෂධ, තෘණ, වෘක්‍ෂලතාවන්හි අධිගෘහිත දේවතාවෝ රැස්වී එක්වී චිත්ත ගෘහපතිට මෙය කීහ: \"ගෘහපතිය, ඔබ මතු කාලයේදී චක්‍රවර්ති රජෙක් වන්නට ප්‍රාර්ථනා කරන්න.\"\n\nමෙසේ කී කල්හි චිත්ත ගෘහපති ඒ ආරාම දේවතාවන්ට, වන දේවතාවන්ට, රුක් දේවතාවන්ට, ඖෂධ, තෘණ, වෘක්‍ෂලතාවන්හි අධිගෘහිත දේවතාවන්ට මෙය කීවේය: \"එයද අනිත්‍යය, එයද අස්ථිරය, එයද අත්හැර යා යුත්තකි.\"\n\nමෙසේ කී කල්හි චිත්ත ගෘහපතිගේ මිත්‍රයෝ, අමාත්‍යයෝ, ඥාති-ලේ ඥාතීහු චිත්ත ගෘහපතිට මෙය කීහ: \"පුත්‍රය, සිහිය පිහිටුවා ගන්න, දොඩවන්න එපා.\"\n\n\"(ඔබ) මට 'පුත්‍රය, සිහිය පිහිටුවා ගන්න, දොඩවන්න එපා' කියා මෙසේ කියන විට මා කුමක් කියන්නේද?\"\n\n\"පුත්‍රය, ඔබ 'එයද අනිත්‍යය, එයද අස්ථිරය, එයද අත්හැර යා යුත්තකි' කියා මෙසේ කියන්නෙහි.\"\n\n\"එසේමය, මට ආරාම දේවතාවෝ, වන දේවතාවෝ, රුක් දේවතාවෝ, ඖෂධ, තෘණ, වෘක්‍ෂලතාවන්හි අධිගෘහිත දේවතාවෝ මෙසේ කීහ: 'ගෘහපතිය, ඔබ මතු කාලයේදී චක්‍රවර්ති රජෙක් වන්නට ප්‍රාර්ථනා කරන්න' කියා. එබැවින් මා 'එයද අනිත්‍යය, එයද අස්ථිරය, එයද අත්හැර යා යුත්තකි' කියා මෙසේ කියමි.\"\n\n\"පුත්‍රය, එහෙත් ඒ ආරාම දේවතාවෝ, වන දේවතාවෝ, රුක් දේවතාවෝ, ඖෂධ, තෘණ, වෘක්‍ෂලතාවන්හි අධිගෘහිත දේවතාවෝ කුමන විශේෂ කාරණයක් අරභයා 'ගෘහපතිය, ඔබ මතු කාලයේදී චක්‍රවර්ති රජෙක් වන්නට ප්‍රාර්ථනා කරන්න' කියා මෙසේ කීවාද?\"\n\n\"ඒ ආරාම දේවතාවන්ට, වන දේවතාවන්ට, රුක් දේවතාවන්ට, ඖෂධ, තෘණ, වෘක්‍ෂලතාවන්හි අධිගෘහිත දේවතාවන්ට මෙසේ සිතුණි: 'මෙම චිත්ත ගෘහපති සිල්වත්ය, යහපත් ගතිගුණ ඇත්තෙකි. යම් හෙයකින් ඔහු 'මතු කාලයේදී චක්‍රවර්ති රජෙක් වන්නට ප්‍රාර්ථනා කරන්නෙමි' කියා ප්‍රාර්ථනා කරන්නේ නම්, එය ඔහුට සඵල වනු ඇත. සිල්වතුන්ගේ චේතනාවෙන් කරන ප්‍රාර්ථනා පිරිසිදු බැවින්, එය ධර්මානුකූල වූ, ධර්මානුකූල ඵලයක් ගෙන දෙන දෙයක් වනු ඇත' කියා. මේ විශේෂ කාරණය දැකීමෙන් ඒ ආරාම දේවතාවෝ, වන දේවතාවෝ, රුක් දේවතාවෝ, ඖෂධ, තෘණ, වෘක්‍ෂලතාවන්හි අධිගෘහිත දේවතාවෝ 'ගෘහපතිය, ඔබ මතු කාලයේදී චක්‍රවර්ති රජෙක් වන්නට ප්‍රාර්ථනා කරන්න' කියා මෙසේ කීහ. එබැවින් මා 'එයද අනිත්‍යය, එයද අස්ථිරය, එයද අත්හැර යා යුත්තකි' කියා මෙසේ කියමි.\"\n\n\"එසේ නම්, පුත්‍රය, අපටත් අවවාද කරන්න\" කීහ.\n\n\"එබැවින් ඔබ විසින් මෙසේ හික්මිය යුතුය: 'ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථි, සත්ථා දේවමනුස්සානං, බුද්ධෝ, භගවා යන ගුණාංගවලින් යුක්තය' කියා බුදුරදුන් කෙරෙහි ස්ථිර ප්‍රසාදයෙන් යුක්ත වන්නෙමු. 'භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ, සාන්දිට්ඨික වූ, අකාලික වූ, ඒහිපස්සික වූ, ඕපනයික වූ, ප්‍රත්‍යත්තං වේදිතබ්බෝ විඤ්ඤූහි වූ ධර්මයයි' කියා ධර්මය කෙරෙහි ස්ථිර ප්‍රසාදයෙන් යුක්ත වන්නෙමු. 'භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා සුප්‍රතිපන්නය, උජුප්‍රතිපන්නය, ඤායප්‍රතිපන්නය, සාමීචිප්‍රතිපන්නය. ඒ කියන්නේ සතර පුරුෂ යුග්මවූ අට මහා පුරුෂ පුද්ලයන්ය. භාග්‍යවතුන් වහන්සේගේ ඒ ශ්‍රාවක සංඝයා ආහුනෙය්‍යය, පාහුනෙය්‍යය, දක්ඛිණෙය්‍යය, අඤ්ජලිකරණීයය, ලෝකයාගේ අනුත්තර පුණ්‍යක්‍ෂේත්‍රයයි' කියා සංඝයා කෙරෙහි ස්ථිර ප්‍රසාදයෙන් යුක්ත වන්නෙමු. තවද, යම් කිසි දිය යුතු වස්තුවක් (දෙය්‍යධර්මයක්) කුලයක් තුළ ඇත්තේ නම්, ඒ සියල්ල සිල්වත්වූ, යහපත් ගතිගුණ ඇති අය සමඟ බෙදා ගන්නේ වන්නෙමු කියා මෙසේම ඔබ විසින් හික්මිය යුතුය.\"\n\nඉන්පසු චිත්ත ගෘහපති තම මිත්‍රයන්, අමාත්‍යයන්, ඥාති-ලේ ඥාතීන් බුදුරදුන් කෙරෙහිත්, ධර්මය කෙරෙහිත්, සංඝයා කෙරෙහිත්, ත්‍යාගය කෙරෙහිත් සමාදන් කරවා කාලක්‍රියා කළේය.",
      "paliTitle": "Gilānadassanasuttaṃ",
      "vagga": "",
      "englishTitle": "Seeing the Sick Sutta",
      "sinhalaTitle": "ගිලානදස්සන සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Cittasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Saṃyojanaṃ dve isidattā, mahako kāmabhūpi ca; Godatto ca nigaṇṭho ca, acelena gilānadassananti.",
    "english": "The Linked Discourses with Citta is complete. The summary of it: Fetter, two with Isidatta, Mahaka, and also Kāmabhū; Godatta, Nigaṇṭha, with the Naked Ascetic, and Seeing the Sick.",
    "sinhala": "චිත්ත සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: සංයෝජන, ඉසිදත්ත දෙකක්, මහක, කාමභූ, ගෝදත්ත, නිගණ්ඨ, අචේල සහ ගිලානදස්සන සූත්‍රයි."
  }
}