{
  "id": "sn.4.5",
  "title": {
    "pali": "Sāmaṇḍakasaṃyuttaṃ",
    "english": "The Connected Discourses with Sāmaṇḍaka",
    "sinhala": "සාමණ්ඩක සංයුත්තය"
  },
  "sections": [
    {
      "number": 330,
      "pali": "Ekaṃ samayaṃ āyasmā sāriputto vajjīsu viharati ukkacelāyaṃ gaṅgāya nadiyā tīre. Atha kho sāmaṇḍako [sāmaṇḍakāni (sī.)] paribbājako yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sāmaṇḍako paribbājako āyasmantaṃ sāriputtaṃ etadavoca – ‘‘‘Nibbānaṃ, nibbāna’nti, āvuso sāriputta, vuccati. Katamaṃ nu kho, āvuso, nibbāna’’nti? ‘‘Yo kho, āvuso, rāgakkhayo dosakkhayo mohakkhayo – idaṃ vuccati nibbāna’’nti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etassa nibbānassa sacchikiriyāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etassa nibbānassa sacchikiriyāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā etassa nibbānassa sacchikiriyāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etassa nibbānassa sacchikiriyāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etassa nibbānassa sacchikiriyāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etassa nibbānassa sacchikiriyāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Paṭhamaṃ. (Yathā jambukhādakasaṃyuttaṃ, tathā vitthāretabbaṃ).",
      "english": "On one occasion, the venerable Sāriputta was dwelling among the Vajjī people, at Ukkacelā, on the bank of the river Gaṅgā. Then, the wandering ascetic Sāmaṇḍaka approached where the venerable Sāriputta was. Having approached, he exchanged greetings with the venerable Sāriputta. After concluding a cordial and memorable conversation, he sat down to one side.\n\nAs he was sitting to one side, the wandering ascetic Sāmaṇḍaka said this to the venerable Sāriputta: \"‘Nibbāna, Nibbāna’—thus it is said, friend Sāriputta. What exactly, friend, is Nibbāna?\" \"That which, friend, is the destruction of greed, the destruction of hatred, the destruction of delusion—this is called Nibbāna.\" \"But is there, friend, a path, is there a way of practice for the direct realization of this Nibbāna?\" \"There is indeed, friend, a path, there is a way of practice for the direct realization of this Nibbāna.\" \"What, then, friend, is that path, what is that way of practice for the direct realization of this Nibbāna?\" \"This Noble Eightfold Path itself, friend, is for the direct realization of this Nibbāna. That is to say: Right Understanding, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, friend, is the path, this is the way of practice for the direct realization of this Nibbāna.\" \"Excellent, friend, is the path; excellent is the way of practice for the direct realization of this Nibbāna. And truly, friend Sāriputta, this is sufficient ground for the exercise of diligence.\"",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් ශ්‍රී‍රපුත්‍ර තෙරුන් වහන්සේ වජ්ජීහුන් අතර, ගංගා නදිය අසල උක්කචෙලා නම් ස්ථානයේ වැඩ වාසය කළහ. එකල්හි සාමණ්ඩක පිරිවැසියා ආයුෂ්මත් ශ්‍රී‍රපුත්‍ර තෙරුන් වහන්සේ වෙත පැමිණියේය; පැමිණ, ආයුෂ්මත් ශ්‍රී‍රපුත්‍ර තෙරුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා බස් හුවමාරු කරගෙන ඔහු එකත්පස්ව වාඩි විය. එකත්පස්ව සිටි සාමණ්ඩක පිරිවැසියා ආයුෂ්මත් ශ්‍රී‍රපුත්‍ර තෙරුන් වහන්සේට මෙය පැවසීය: \"ඇවැත් ශ්‍රී‍රපුත්‍රයෙනි, 'නිර්වාණය, නිර්වාණය' යැයි කියනු ලැබේ. ඇවැත්නි, මේ නිර්වාණය යනු කුමක්දැයි?\" \"ඇවැත්නි, යම් හෙයකින් රාගය ක්ෂය කිරීම, ද්වේෂය ක්ෂය කිරීම, මෝහය ක්ෂය කිරීම වේද, මෙය නිර්වාණය යැයි කියනු ලැබේ.\" \"ඇවැත්නි, මේ නිර්වාණය අවබෝධ කර ගැනීම පිණිස මාර්ගයක් තිබේද, ප්‍රතිපදාවක් තිබේද?\" \"ඇවැත්නි, මේ නිර්වාණය අවබෝධ කර ගැනීම පිණිස මාර්ගයක් ඇත, ප්‍රතිපදාවක් ඇත.\" \"ඇවැත්නි, එසේ නම් කුමන මාර්ගයක්ද, කුමන ප්‍රතිපදාවක්ද මේ නිර්වාණය අවබෝධ කර ගැනීම පිණිස?\" \"ඇවැත්නි, මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේ, මේ නිර්වාණය අවබෝධ කර ගැනීම පිණිසයි, එනම්: සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධියයි. ඇවැත්නි, මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි, මේ නිර්වාණය අවබෝධ කර ගැනීම පිණිස.\" \"ඇවැත්නි, මේ නිර්වාණය අවබෝධ කර ගැනීම පිණිස ඇති මාර්ගය උතුම්ය, ප්‍රතිපදාව උතුම්ය. ඇවැත් ශ්‍රී‍රපුත්‍රයෙනි, අප්‍රමාදීව කටයුතු කිරීමට මෙය ප්‍රමාණවත්ය.\"",
      "paliTitle": "Sāmaṇḍakasuttaṃ",
      "vagga": ""
    },
    {
      "number": 331,
      "pali": "‘‘Kiṃ nu kho, āvuso sāriputta, imasmiṃ dhammavinaye dukkara’’nti? ‘‘Pabbajjā kho, āvuso, imasmiṃ dhammavinaye dukkarā’’ti. ‘‘Pabbajitena panāvuso, kiṃ dukkara’’nti? ‘‘Pabbajitena kho, āvuso, abhirati dukkarā’’ti. ‘‘Abhiratena panāvuso, kiṃ dukkara’’nti? ‘‘Abhiratena kho, āvuso, dhammānudhammappaṭipatti dukkarā’’ti. ‘‘Kīvaciraṃ panāvuso, dhammānudhammappaṭipanno bhikkhu arahaṃ assā’’ti? ‘‘Naciraṃ, āvuso’’ti. Soḷasamaṃ. (Purimakasadisaṃ uddānaṃ.) ",
      "english": "\"Now, what is difficult in this Dhamma and Discipline, friend Sāriputta?\" \"Indeed, going forth into monastic life is difficult in this Dhamma and Discipline, friend.\" \"But for one who has gone forth, friend, what is difficult?\" \"Indeed, for one who has gone forth, friend, finding contentment in the monastic life is difficult.\" \"But for one who is content, friend, what is difficult?\" \"Indeed, for one who is content, friend, practicing in accordance with the Dhamma and its principles is difficult.\" \"But for how long, friend, would a monk who practices in accordance with the Dhamma and its principles become an Arahant?\" \"Not for long, friend.\"",
      "sinhala": "ඇවැත්නි ශාරිපුත්තය, මේ ධර්මවිනයෙහි දුෂ්කර දෙය කුමක්ද?\n\nඇවැත්නි, මේ ධර්මවිනයෙහි පැවිදි වීම දුෂ්කරය.\n\nඑහෙත් ඇවැත්නි, පැවිදි වූ කෙනෙකුට දුෂ්කර දෙය කුමක්ද?\n\nඇවැත්නි, පැවිදි වූ කෙනෙකුට (පැවිදි දිවියේ) ඇලී වාසය කිරීම දුෂ්කරය.\n\nඑහෙත් ඇවැත්නි, (පැවිදි දිවියේ) ඇලී වාසය කරන කෙනෙකුට දුෂ්කර දෙය කුමක්ද?\n\nඇවැත්නි, (පැවිදි දිවියේ) ඇලී වාසය කරන කෙනෙකුට ධර්මානුධර්ම ප්‍රතිපත්තිය දුෂ්කරය.\n\nඑහෙත් ඇවැත්නි, ධර්මානුධර්ම ප්‍රතිපත්තිය පුරන භික්ෂුවක් කොපමණ කල් ගත වී රහත් වේද?\n\nඇවැත්නි, වැඩි කලක් ගත නොවෙයි.",
      "paliTitle": "Dukkarasuttaṃ",
      "vagga": ""
    }
  ],
  "footer": {
    "pali": "Sāmaṇḍakasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}