{
  "id": "sn.4.3",
  "title": {
    "pali": "Mātugāmasaṃyuttaṃ",
    "english": "The Connected Discourses on Women",
    "sinhala": "මාතුගාම සංයුත්තය"
  },
  "sections": [
    {
      "number": 280,
      "pali": "‘‘Pañcahi, bhikkhave, aṅgehi samannāgato mātugāmo ekantaamanāpo hoti purisassa. Katamehi pañcahi? Na ca rūpavā hoti, na ca bhogavā hoti, na ca sīlavā hoti, alaso ca hoti, pajañcassa na labhati – imehi kho, bhikkhave, pañcahi aṅgehi samannāgato mātugāmo ekantaamanāpo hoti purisassa. Pañcahi, bhikkhave, aṅgehi samannāgato mātugāmo ekantamanāpo hoti purisassa. Katamehi pañcahi? Rūpavā ca hoti, bhogavā ca hoti, sīlavā ca hoti, dakkho ca hoti analaso, pajañcassa labhati – imehi kho, bhikkhave, pañcahi aṅgehi samannāgato mātugāmo ekantamanāpo hoti purisassā’’ti. Paṭhamaṃ.",
      "english": "Monks, a woman endowed with five qualities is utterly displeasing to a man. Which five? She is not beautiful, she is not wealthy, she is not virtuous, she is lazy, and she does not bear him children. Indeed, monks, a woman endowed with these five qualities is utterly displeasing to a man.\n\nMonks, a woman endowed with five qualities is utterly pleasing to a man. Which five? She is beautiful, she is wealthy, she is virtuous, she is diligent and not lazy, and she bears him children. Indeed, monks, a woman endowed with these five qualities is utterly pleasing to a man.",
      "sinhala": "භික්‍ෂූන් වහන්ස, කරුණු පසකින් යුක්ත වූ මාතුගාමයා පුරුෂයෙකුට ඒකාන්තයෙන්ම අප්‍රිය වේ. ඒ පස් කරුණ කුමක්ද? එනම්, ඇය රූපවත් නොවන්නීය, භෝග සම්පත් ඇත්තී නොවන්නීය, සිල්වත් නොවන්නීය, අලස වන්නීය, ප්‍රඥාව නොලබන්නීය. භික්‍ෂූන් වහන්ස, මේ කරුණු පසින් යුක්ත වූ මාතුගාමයා පුරුෂයෙකුට ඒකාන්තයෙන්ම අප්‍රිය වේ.\n\nභික්‍ෂූන් වහන්ස, කරුණු පසකින් යුක්ත වූ මාතුගාමයා පුරුෂයෙකුට ඒකාන්තයෙන්ම ප්‍රිය වේ. ඒ පස් කරුණ කුමක්ද? එනම්, ඇය රූපවත් වන්නීය, භෝග සම්පත් ඇත්තී වන්නීය, සිල්වත් වන්නීය, දක්‍ෂ වූ අලස නොවන්නීය, ප්‍රඥාව ලබන්නීය. භික්‍ෂූන් වහන්ස, මේ කරුණු පසින් යුක්ත වූ මාතුගාමයා පුරුෂයෙකුට ඒකාන්තයෙන්ම ප්‍රිය වේ.",
      "paliTitle": "Mātugāmasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 281,
      "pali": "‘‘Pañcahi, bhikkhave, aṅgehi samannāgato puriso ekantaamanāpo hoti mātugāmassa. Katamehi pañcahi? Na ca rūpavā hoti, na ca bhogavā hoti, na ca sīlavā hoti, alaso ca hoti, pajañcassa na labhati – imehi kho, bhikkhave, pañcahi aṅgehi samannāgato puriso ekantaamanāpo hoti mātugāmassa. Pañcahi, bhikkhave, aṅgehi samannāgato puriso ekantamanāpo hoti mātugāmassa. Katamehi pañcahi? Rūpavā ca hoti, bhogavā ca hoti, sīlavā ca hoti, dakkho ca hoti analaso, pajañcassa labhati – imehi kho, bhikkhave, pañcahi aṅgehi samannāgato puriso ekantamanāpo hoti mātugāmassā’’ti. Dutiyaṃ.",
      "english": "Monks, a person endowed with five factors is absolutely displeasing to women. Which five? He is not handsome, he has no wealth, he has no virtue, he is lazy, and he lacks discernment. Indeed, monks, a person endowed with these five factors is absolutely displeasing to women.\n\nMonks, a person endowed with five factors is absolutely pleasing to women. Which five? He is handsome, he has wealth, he has virtue, he is diligent and skillful, and he acquires discernment. Indeed, monks, a person endowed with these five factors is absolutely pleasing to women.",
      "sinhala": "භික්ෂූනි, අංග පහකින් යුක්ත පුරුෂයා ස්ත්‍රීන්ට එකාන්තයෙන්ම අප්‍රිය වෙයි. කවර අංග පහකින්ද?\nරූප සම්පත්තියෙන් යුක්ත නොවෙයි, භෝග සම්පත්තියෙන් යුක්ත නොවෙයි, සීල සම්පත්තියෙන් යුක්ත නොවෙයි, කම්මැලියෙක්ද වෙයි, ප්‍ර‍ඥාවක්ද නොලබයි. භික්ෂූනි, මේ අංග පහකින් යුක්ත පුරුෂයා ස්ත්‍රීන්ට එකාන්තයෙන්ම අප්‍රිය වන්නේය.\n\nභික්ෂූනි, අංග පහකින් යුක්ත පුරුෂයා ස්ත්‍රීන්ට එකාන්තයෙන්ම ප්‍රි‍ය වෙයි. කවර අංග පහකින්ද?\nරූප සම්පත්තියෙන්ද යුක්ත වෙයි, භෝග සම්පත්තියෙන්ද යුක්ත වෙයි, සීල සම්පත්තියෙන්ද යුක්ත වෙයි, දක්ෂයෙක්ද වෙයි, කම්මැලි නොවෙයි, ප්‍ර‍ඥාවක්ද ලබයි. භික්ෂූනි, මේ අංග පහකින් යුක්ත පුරුෂයා ස්ත්‍රීන්ට එකාන්තයෙන්ම ප්‍රි‍ය වන්නේය.",
      "paliTitle": "Purisasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 282,
      "pali": "‘‘Pañcimāni, bhikkhave, mātugāmassa āveṇikāni dukkhāni, yāni mātugāmo paccanubhoti, aññatreva purisehi. Katamāni pañca? Idha, bhikkhave, mātugāmo daharova samāno patikulaṃ gacchati, ñātakehi vinā hoti. Idaṃ, bhikkhave, mātugāmassa paṭhamaṃ āveṇikaṃ dukkhaṃ, yaṃ mātugāmo paccanubhoti, aññatreva purisehi. Puna caparaṃ, bhikkhave, mātugāmo utunī hoti. Idaṃ, bhikkhave, mātugāmassa dutiyaṃ āveṇikaṃ dukkhaṃ, yaṃ mātugāmo paccanubhoti, aññatreva purisehi. Puna caparaṃ, bhikkhave, mātugāmo gabbhinī hoti. Idaṃ, bhikkhave, mātugāmassa tatiyaṃ āveṇikaṃ dukkhaṃ, yaṃ mātugāmo paccanubhoti, aññatreva purisehi. Puna caparaṃ, bhikkhave, mātugāmo vijāyati. Idaṃ, bhikkhave, mātugāmassa catutthaṃ āveṇikaṃ dukkhaṃ, yaṃ mātugāmo paccanubhoti, aññatreva purisehi. Puna caparaṃ, bhikkhave, mātugāmo purisassa pāricariyaṃ upeti. Idaṃ kho, bhikkhave, mātugāmassa pañcamaṃ āveṇikaṃ dukkhaṃ, yaṃ mātugāmo paccanubhoti, aññatreva purisehi. Imāni kho, bhikkhave, pañca mātugāmassa āveṇikāni dukkhāni, yāni mātugāmo paccanubhoti, aññatreva purisehī’’ti. Tatiyaṃ.",
      "english": "Monks, these five sufferings are exclusive to women, which women experience, distinct from men. Which five? Here, monks, a woman, while still young, goes to her husband’s family and is separated from her own relatives. This, monks, is the first exclusive suffering of women, which women experience, distinct from men. Furthermore, monks, a woman experiences menstruation. This, monks, is the second exclusive suffering of women, which women experience, distinct from men. Furthermore, monks, a woman becomes pregnant. This, monks, is the third exclusive suffering of women, which women experience, distinct from men. Furthermore, monks, a woman gives birth. This, monks, is the fourth exclusive suffering of women, which women experience, distinct from men. Furthermore, monks, a woman enters into the service of a man. Indeed, monks, this is the fifth exclusive suffering of women, which women experience, distinct from men. Indeed, monks, these are the five exclusive sufferings of women, which women experience, distinct from men.",
      "sinhala": "මහණෙනි, පුරුෂයන්ට නොවන, ස්ත්‍රීන් පමණක් අත්විඳින, ආවේණික වූ දුක් පසක් ඇත. ඒ පස කුමක්ද?\n\nමහණෙනි, මෙහිලා ස්ත්‍රිය ළාබාල වියේ සිටියදීම පතිකුලයට යයි. (එවිට) ඇය ඥාතීන්ගෙන් වෙන්ව සිටින්නීය. මහණෙනි, පුරුෂයන්ට නොවන, ස්ත්‍රියක් අත්විඳින පළමු ආවේණික දුක මෙයයි. තවද, මහණෙනි, ස්ත්‍රිය ඔසප් වීම අත්විඳින්නීය. මහණෙනි, පුරුෂයන්ට නොවන, ස්ත්‍රියක් අත්විඳින දෙවන ආවේණික දුක මෙයයි. තවද, මහණෙනි, ස්ත්‍රිය ගැබ්ගන්නීය. මහණෙනි, පුරුෂයන්ට නොවන, ස්ත්‍රියක් අත්විඳින තුන්වන ආවේණික දුක මෙයයි. තවද, මහණෙනි, ස්ත්‍රිය දරුවකු බිහි කරන්නීය. මහණෙනි, පුරුෂයන්ට නොවන, ස්ත්‍රියක් අත්විඳින සිව්වන ආවේණික දුක මෙයයි. තවද, මහණෙනි, ස්ත්‍රිය පුරුෂයකුට සේවය කිරීමට සිදුවේ. මහණෙනි, පුරුෂයන්ට නොවන, ස්ත්‍රියක් අත්විඳින පස්වන ආවේණික දුක මෙයමයි.\n\nමහණෙනි, පුරුෂයන්ට නොවන, ස්ත්‍රීන් පමණක් අත්විඳින ආවේණික දුක් පස මේවායී.",
      "paliTitle": "Āveṇikadukkhasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 283,
      "pali": "‘‘Tīhi, bhikkhave, dhammehi samannāgato mātugāmo yebhuyyena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi tīhi? Idha, bhikkhave, mātugāmo pubbaṇhasamayaṃ maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati. Majjhanhikasamayaṃ issāpariyuṭṭhitena cetasā agāraṃ ajjhāvasati. Sāyanhasamayaṃ kāmarāgapariyuṭṭhitena cetasā agāraṃ ajjhāvasati. Imehi kho, bhikkhave, tīhi dhammehi samannāgato mātugāmo yebhuyyena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Catutthaṃ.",
      "english": "Monks, a woman who is endowed with three qualities is, for the most part, reborn into a state of deprivation, a woeful destination, a lower realm, to hell, with the breaking up of the body, after death. Which three? Here, monks, a woman in the forenoon dwells in the home with a mind overwhelmed by the defilement of stinginess. At midday she dwells in the home with a mind overwhelmed by envy. In the evening she dwells in the home with a mind overwhelmed by sensual lust. Indeed, monks, a woman who is endowed with these three qualities is, for the most part, reborn into a state of deprivation, a woeful destination, a lower realm, to hell, with the breaking up of the body, after death.",
      "sinhala": "භික්ෂූනි, කරුණු තුනකින් සමන්විත වූ ස්ත්‍ZWJරියක් බොහෝ විට කය බිඳී, මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරය යන ස්ථානවල උපදියි. ඒ කවර කරුණු තුනකින් ද? භික්ෂූනි, මෙහිලා ස්ත්‍ZWJරියක් උදෑසන මසුරුබව නැමති කෙලෙස් මලින් පෙලී ගිය සිතින් ගිහි ගෙදර වාසය කරයි. දහවල් කාලයේදී ඊර්ෂ්‍ZWJයාව නැමති කෙලෙස් මලින් පෙලී ගිය සිතින් ගිහි ගෙදර වාසය කරයි. සවස කාලයේදී කාමරාගය නැමති කෙලෙස් මලින් පෙලී ගිය සිතින් ගිහි ගෙදර වාසය කරයි. භික්ෂූනි, මෙන්න මේ කරුණු තුනින් සමන්විත වූ ස්ත්‍ZWJරියක් බොහෝ විට කය බිඳී, මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරය යන ස්ථානවල උපදියි.",
      "paliTitle": "Tīhidhammehisuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 284,
      "pali": "Atha kho āyasmā anuruddho yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, mātugāmaṃ passāmi dibbena cakkhunā visuddhena atikkantamānusakena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantaṃ. Katīhi nu kho, bhante, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti? ‘‘Pañcahi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, kodhano ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Pañcamaṃ.",
      "english": "Then, the Venerable Anuruddha approached the Blessed One; having approached, he sat down to one side. As he sat to one side, the Venerable Anuruddha said this to the Blessed One: \"Here, Venerable Sir, I see a woman, by means of the purified divine eye that surpasses human sight, who, with the breaking up of the body, after death, is reborn into a state of deprivation, an unhappy destination, a ruinous realm, hell. Venerable Sir, by how many qualities is a woman endowed such that, with the breaking up of the body, after death, she is reborn into a state of deprivation, an unhappy destination, a ruinous realm, hell?\"\n\n\"Anuruddha, a woman endowed with five qualities is reborn, with the breaking up of the body, after death, into a state of deprivation, an unhappy destination, a ruinous realm, hell.\" \"Which five?\" \"She is faithless, she is shameless, she is without moral dread, she is wrathful, and she is unwise. Anuruddha, it is with these five qualities that a woman is reborn, with the breaking up of the body, after death, into a state of deprivation, an unhappy destination, a ruinous realm, hell.\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, පැමිණ එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"ස්වාමීනී, මෙහිදී මම පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් කාන්තාවන් දකිමි. ඔවුන් කය බිඳී, මරණින් පසු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට වැටෙනවා. ස්වාමීනී, කාන්තාවන් කී ධර්මයකින් යුක්ත වීමෙන්ද කය බිඳී, මරණින් පසු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට වැටෙන්නේ?\"\n\n\"අනුරුද්ධය, කාන්තාවන් ධර්මයන් පහකින් යුක්ත වීමෙන් කය බිඳී, මරණින් පසු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට වැටෙති. ඒ කවර පහකින්ද? ඔවුන් ශ්‍රද්ධාවෙන් තොර වෙති, පව් කිරීමට ලජ්ජා නැති වෙති, පව් කිරීමට බිය නැති වෙති, කෝපයෙන් යුක්ත වෙති, දුෂ්ප්‍රඥා ඇත්තෝ වෙති. අනුරුද්ධය, මේ ධර්මයන් පහකින් යුක්ත වූ කාන්තාවෝ කය බිඳී, මරණින් පසු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට වැටෙති.\"",
      "paliTitle": "Kodhanasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 285,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, upanāhī ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Chaṭṭhaṃ.",
      "english": "Anuruddha, a woman endowed with five qualities, upon the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a state of woe, hell. Which five? She is without conviction, she is without moral shame, she is without moral dread, she is resentful, and she is unwise. Indeed, Anuruddha, a woman endowed with these five qualities, upon the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a state of woe, hell.",
      "sinhala": "අනුරුද්ධය, ධර්මයන් පහකින් යුක්ත වූ ස්ත්‍රියක්, කය බිඳී මරණයෙන් පසුව, අපාය, දුග්ගති, විනිපාතය, නිරය යන දුගති වලට උපදී. කවර පහකින්ද? ඇය අශ්‍රද්ධාවන්ත වෙයි, අහිරික වෙයි, අනොතප්පී වෙයි, උපනාහි වෙයි, දුෂ්ප්‍රාඥ වෙයි. අනුරුද්ධය, ඇත්තෙන්ම මේ ධර්මයන් පහකින් යුක්ත වූ ස්ත්‍රියක්, කය බිඳී මරණයෙන් පසුව, අපාය, දුග්ගති, විනිපාතය, නිරය යන දුගති වලටම උපදී.",
      "paliTitle": "Upanāhīsuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 286,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, issukī ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Sattamaṃ.",
      "english": "“Endowed with five qualities, O Anuruddha, a woman, upon the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a ruinous state, and hell. Which five? She is without conviction, she is shameless, she is without moral dread, she is envious, and she is unwise. With these five qualities, O Anuruddha, a woman, upon the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a ruinous state, and hell.”",
      "sinhala": "අනුරුද්ධයෙනි, පස් ආකාර වූ ධර්මයන්ගෙන් සමන්වාගත වූ ස්ත්‍රියක් කය බිඳී මරණයෙන් පසු අපාය, දුගති, විනිපාතය, නිරය යන අසත් ස්ථානයන්හි උපදී.\n\nඒ කවර පස් ආකාර වූ ධර්මයන්ගෙන්ද?\n\nඑනම්, ඇය අශ්‍රද්ධාවන්තයෙක් වේ, අහිරිකියෙක් වේ, අනොතප්පියෙක් වේ, ඊර්ෂ්‍යා සහගතයෙක් වේ, දුෂ්ප්‍රඥයෙක් වේ. අනුරුද්ධයෙනි, මේ පස් ආකාර වූ ධර්මයන්ගෙන් සමන්වාගත වූ ස්ත්‍රියක් කය බිඳී මරණයෙන් පසු අපාය, දුගති, විනිපාතය, නිරය යන අසත් ස්ථානයන්හි උපදී.",
      "paliTitle": "Issukīsuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 287,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, maccharī ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo…pe… apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Aṭṭhamaṃ.",
      "english": "Anuruddha, a woman endowed with five qualities is reborn, at the breaking up of the body, after death, into a state of deprivation, a bad destination, a lower realm, hell. Which five? She is lacking in faith, lacking in moral shame, lacking in moral dread, stingy, and devoid of wisdom. Indeed, Anuruddha, a woman endowed with these five qualities is reborn, at the breaking up of the body, after death, into a state of deprivation, a bad destination, a lower realm, hell.",
      "sinhala": "අනුරුද්ධයෙනි, ධර්මයන් පහකින් සමන්විත වූ කාන්තාවක්, කය බිඳී මරණයෙන් පසුව, අපාය, දුර්ගති, විනිපාත, නිරය යන තැන්වල උපදියි. කවර පහකින්ද? ඇය ශ්‍රද්ධාවෙන් තොර වෙයි, පවට ලැජ්ජා නැති වෙයි, පවට භයක් නැති වෙයි, මසුරු වෙයි, ප්‍රඥා රහිත වෙයි. අනුරුද්ධයෙනි, ධර්මයන් පහකින් සමන්විත වූ කාන්තාවක්, කය බිඳී මරණයෙන් පසුව, අපාය, දුර්ගති, විනිපාත, නිරය යන තැන්වල උපදියි. අටවැනි සූත්‍රයයි.",
      "paliTitle": "Maccharīsuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 288,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo…pe… apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, aticārī ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo…pe… upapajjatī’’ti. Navamaṃ.",
      "english": "Anuruddha, a woman endowed with five qualities — upon the breaking up of the body, after death — is reborn in the states of deprivation, a bad destination, the lower worlds, hell. Which five? She is faithless, she is without moral shame, she is without moral dread, she is unchaste, and she is unwise. It is with these five qualities, Anuruddha, that a woman — upon the breaking up of the body, after death — is reborn in the states of deprivation, a bad destination, the lower worlds, hell.",
      "sinhala": "අනුරුද්ධය, පස් ධර්මයන්ගෙන් යුක්ත වූ ස්ත්‍රියක් අපාය, දුර්ගති, විනිපාත, නිරය යන දුගති භූමීන්හී උපදී. ඒ කිනම් පස් ධර්මයන්ගෙන් ද? ඇය අශ්‍රද්ධාවන්ත වේ, අහිරික වේ, අනොත්තප්පී වේ, අතිචාරී වේ, දුෂ්ප්‍රාඥ වේ. අනුරුද්ධය, මේ පස් ධර්මයන්ගෙන් යුක්ත වූ ස්ත්‍රියක් අපාය, දුර්ගති, විනිපාත, නිරය යන දුගති භූමීන්හී උපදී.",
      "paliTitle": "Aticārīsuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 289,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, dussīlo ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjatī’’ti. Dasamaṃ.",
      "english": "“Anuruddha, a woman endowed with five qualities is reborn in a state of woe. Which five qualities? She is lacking in conviction, without moral shame, without moral dread, immoral in conduct, and lacking in wisdom. Indeed, Anuruddha, a woman endowed with these five qualities is reborn in a state of woe.”",
      "sinhala": "අනුරුද්ධය, ධර්මයන් පසකින් සමන්වාගත වූ ස්ත්‍රිය නිරයෙහි උපදී. ඒ ධර්මයෝ පස්දෙනා කවරහුද? ඒ ස්ත්‍රිය අශ්‍රද්ධාවන්ත වෙයි, අහිරික වෙයි, අනෝතප්පී වෙයි, දුශ්ශීල වෙයි, දුෂ්ප්‍රඥ වෙයි. අනුරුද්ධය, මේ ධර්මයන් පසින් සමන්වාගත වූ ස්ත්‍රිය නිරයෙහිම උපදින්නීය.",
      "paliTitle": "Dussīlasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 290,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, appassuto ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjatī’’ti. Ekādasamaṃ.",
      "english": "O Anuruddha, a woman endowed with five qualities, upon the breaking up of the body, after death, is reborn in a state of deprivation, a miserable destination, the lower realms, hell. Which five? She is lacking in conviction, and she is shameless, and she is reckless, and she is uninstructed, and she is lacking in wisdom. Indeed, O Anuruddha, a woman endowed with these five qualities, upon the breaking up of the body, after death, is reborn in a state of deprivation, a miserable destination, the lower realms, hell.",
      "sinhala": "අනුරුද්ධය, ධර්මයන් පසකින් සමන්වාගතවූ ස්ත්‍රියක්, කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයට උපදී.\n\nඒ පස් කවරේද?\n\nඒ ස්ත්‍රිය අශ්‍රද්ධාවන්තයෙක් වෙයි. අහිරිකියෙක් වෙයි. අනොතප්පී කෙනෙක් වෙයි. අල්ප ශ්‍රැතවත් කෙනෙක් වෙයි. දුෂ්ප්‍රාඥ කෙනෙක් වෙයි. අනුරුද්ධය, මෙවන් ධර්මයන් පසකින් සමන්වාගතවූ ස්ත්‍රියක්, කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයටම උපදී.",
      "paliTitle": "Appassutasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 291,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, kusīto ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo…pe… apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Dvādasamaṃ.",
      "english": "There are five qualities, Anuruddha, with which a woman is endowed, such that with the breakup of the body, after death, she reappears in the lower realms, in a bad destination, in a state of woe, in hell.\n\nWhich five?\n\nShe is without faith, without moral shame, without moral dread, lazy, and unwise. Indeed, Anuruddha, it is with these five qualities that a woman is endowed, such that with the breakup of the body, after death, she reappears in the lower realms, in a bad destination, in a state of woe, in hell.",
      "sinhala": "අනුරුද්ධයෙනි, පස් කරුණකින් සමන්වාගත වූ ස්ත්‍රියක් නිරයෙහි උපදී.\n\nඒ පස් කරුණ කවරේද?\n\nඇය අශ්‍රද්ධාවන්තය, අහිරිකය, අනොත්තප්පීය, කුසීතය, දුෂ්ප්‍රාඥය – අනුරුද්ධයෙනි, සැබවින්ම මේ පස් කරුණින් සමන්වාගත වූ ස්ත්‍රියක් අපාය, දුර්ගති, විනිපාත, නිරයෙහි උපදී.",
      "paliTitle": "Kusītasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 292,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjati. Katamehi pañcahi? Assaddho ca hoti, ahiriko ca hoti, anottappī ca hoti, muṭṭhassati ca hoti, duppañño ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjatī’’ti. Terasamaṃ.",
      "english": "Anuruddha, a woman endowed with five qualities, with the breakup of the body, after death, is reborn in a state of deprivation, in an unhappy destination, in a lower realm, in hell. Which five? She is without faith, she is without moral shame, she is without moral dread, she is forgetful of mindfulness, and she is without wisdom. These, Anuruddha, are the five qualities with which a woman endowed, with the breakup of the body, after death, is reborn in a state of deprivation, in an unhappy destination, in a lower realm, in hell.",
      "sinhala": "අනුරුද්ධය, යම් කාන්තාවක් පස් ආකාර ධර්මයන්ගෙන් සමන්වාගතව සිටින්නීය. ඇය නිරයේ උපදී. ඒ පස් කරුණු කවරේද? ඇය අශ්‍රද්ධාවන්ත වෙයි, අහිරික වෙයි, අනෝතප්පී වෙයි, මුට්ඨස්සති වෙයි, දුර්ප්‍රඥ වෙයි. අනුරුද්ධය, මේ පස් ආකාර ධර්මයන්ගෙන් සමන්වාගත වූ කාන්තාව නිරයේ උපදින්නීය.",
      "paliTitle": "Muṭṭhassatisuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 293,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo…pe… nirayaṃ upapajjati. Katamehi pañcahi? Pāṇātipātī ca hoti, adinnādāyī ca hoti, kāmesumicchācārī ca hoti, musāvādī ca hoti, surāmerayamajjappamādaṭṭhāyī ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Cuddasamaṃ. Paṭhamapeyyālavaggo. Tassuddānaṃ – Mātugāmo puriso ca, āveṇikā tidhammo ca [dve manāpāmanāpāca, āveṇikā tīhi anuruddho (sabbattha)]; Kodhano upanāhī ca, issukī maccharena ca; Aticārī ca dussīlo, appassuto ca kusīto; Muṭṭhassati pañcaveraṃ, kaṇhapakkhe pakāsito.",
      "english": "Endowed with five qualities, O Anuruddha, a woman, after the dissolution of the body, after death, is reborn in a state of deprivation, a bad destination, a ruinous state, hell.\n\nWith which five?\n\nShe is one who destroys life; she is one who takes what is not given; she is one who engages in sexual misconduct; she is one who speaks falsehoods; and she is one who indulges in intoxicating drinks and drugs that lead to heedlessness.\n\nIndeed, O Anuruddha, it is with these five qualities that a woman, after the dissolution of the body, after death, is reborn in a state of deprivation, a bad destination, a ruinous state, hell.",
      "sinhala": "අනුරුද්ධය, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්තවූ ස්ත‍්‍රියක් ශරීරය බිඳී මරණයෙන් පසු අපාය නම්වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදී. කවර පස් වැදෑරුම් ධර්මයන්ගෙන් ද? ප‍්‍රාණඝාතය කරන්නියක් වේ. අදත්තාදානය කරන්නියක් වේ. කාමයන්හි වරදවා හැසිරෙන්නියක් වේ. මුසාවාද කියන්නියක් වේ. සුරාමේරය මත්පැන් පානය කිරීමෙන් ප‍්‍රමාදයට පැමිණෙන්නියක් වේ. අනුරුද්ධය, සැබැවින්ම මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්තවූ ස්ත‍්‍රියක් ශරීරය බිඳී මරණයෙන් පසු අපාය නම්වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදී.\n\nදහහතරවන සූත්‍රයයි. පළමු පෙය්‍යාලවග්ගයයි. එහි උද්දානය නම්: ස්ත‍්‍රි පුරුෂ සූත්‍රය ද, ත‍්‍රිධර්ම සූත්‍රය ද, ක‍්‍රෝධ කරන්නා සහ වෛර බඳින්නා පිළිබඳ සූත්‍රය ද, ඊර්ෂ්‍යා කරන්නා සහ මසුරු කරන්නා පිළිබඳ සූත්‍රය ද, කාමයන්හි වරදවා හැසිරෙන්නා සහ දුසිල්වත් වූවන් පිළිබඳ සූත්‍රය ද, අල්පශ‍්‍රැත වූවන් සහ අලස වූවන් පිළිබඳ සූත්‍රය ද, මුළාවූ සිහිය ඇත්තන් සහ පස්වැදෑරුම් වෛරය පිළිබඳ සූත්‍රය ද, මෙසේ කළු පැත්තේ විස්තර කරන ලදී.",
      "paliTitle": "Pañcaverasuttaṃ",
      "vagga": "Paṭhamapeyyālavaggo"
    },
    {
      "number": 294,
      "pali": "Atha kho āyasmā anuruddho yena bhagavā tenupasaṅkami; upasaṅkamitvā…pe… ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, mātugāmaṃ passāmi dibbena cakkhunā visuddhena atikkantamānusakena kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantaṃ. Katīhi nu kho, bhante, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’’ti? ‘‘Pañcahi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Katamehi pañcahi? Saddho ca hoti, hirimā ca hoti, ottappī ca hoti, akkodhano ca hoti, paññavā ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’’ti. Paṭhamaṃ.",
      "english": "Then Venerable Anuruddha approached the Blessed One, and having approached and paid homage, he sat down to one side. Sitting to one side, Venerable Anuruddha said this to the Blessed One: \"Here, venerable sir, I see a woman with the purified divine eye, which surpasses human vision, who, after the dissolution of the body and after death, is reborn in a happy destination, in the heavenly world. Endowed with how many qualities, venerable sir, does a woman, after the dissolution of the body and after death, become reborn in a happy destination, in the heavenly world?\"\n\n\"Anuruddha, a woman endowed with five qualities, after the dissolution of the body and after death, is reborn in a happy destination, in the heavenly world. Which five? She has conviction; she has a sense of moral shame; she has moral dread; she is not given to anger; and she is discerning. Anuruddha, a woman endowed with these five qualities, after the dissolution of the body and after death, is reborn in a happy destination, in the heavenly world.\"",
      "sinhala": "එකල්හි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භාග්‍ය<U+200D>වතුන් වහන්සේ වැඩසිටි තැනට එළඹ, භාග්‍ය<U+200D>වතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වැඩහිඳ, භාග්‍ය<U+200D>වතුන් වහන්සේට මෙය පැවසූ සේක: ‘‘වහන්ස, මෙහි මා විසින් පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂූසින් (දිවැසින්) ස්ත්‍රියක්, කය බිඳීමෙන්, මරණයෙන් පසුව සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපදිනු දකිමි. වහන්ස, කවර නම් ධ<U+200D>ර්ම කීයකින් සමන්විත වූ ස්ත්‍රියක්ද කය බිඳීමෙන්, මරණයෙන් පසුව සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපදින්නේද?’’\n\n‘‘අනුරුද්ධය, ධ<U+200D>ර්ම පසකින් සමන්විත වූ ස්ත්‍රියක් කය බිඳීමෙන්, මරණයෙන් පසුව සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපදී. කවර නම් පසකින් ද? ඇය ශ්‍ර<U+200D>ද්ධාවන්තියක් වෙයි, ඇය හිරි ඇත්තියක් වෙයි, ඇය ඔත්තප්ප ඇත්තියක් වෙයි, ඇය අක්‍රෝධි වෙයි, ඇය ප්‍ර<U+200D>ඥාවන්තියක් වෙයි. අනුරුද්ධය, මේ පංච ධ<U+200D>ර්මයන්ගෙන් සමන්විත වූ ස්ත්‍රියක් කය බිඳීමෙන්, මරණයෙන් පසුව සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපදී’’ යැයි වදාළ සේක.",
      "paliTitle": "Akkodhanasuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 295,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Katamehi pañcahi? Saddho ca hoti, hirimā ca hoti, ottappī ca hoti, anupanāhī ca hoti, paññavā ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’’ti. Dutiyaṃ.",
      "english": "Anuruddha, a woman endowed with five qualities, after the breakup of the body, after death, reappears in a good destination, a heavenly world. Which five? She has conviction, she is conscientious, she is scrupulous, she is not resentful, and she is wise. Anuruddha, a woman endowed with these five qualities, after the breakup of the body, after death, reappears in a good destination, a heavenly world.",
      "sinhala": "අනුරුද්ධයෙනි, යම් ස්‍ත්‍රියක් ධර‍්මයන් පසකින් යුක්ත වේද, ඇය කය බිඳීමෙන්, මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයේ උපදී.\nකවර පසකින්ද?\nඇය සද්ධාවන්ත වන්නී ය, හිරිමත් වන්නී ය, ඔත්තප්පවත් වන්නී ය, අනුපනාහී වන්නී ය, ප්‍ර‍ඥාවන්ත වන්නී ය. අනුරුද්ධයෙනි, සැබවින්ම මේ ධර‍්මයන් පසින් යුක්ත වූ ස්‍ත්‍රියක් කය බිඳීමෙන්, මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයේ උපදී.",
      "paliTitle": "Anupanāhīsuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 296,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Katamehi pañcahi? Saddho ca hoti, hirimā ca hoti, ottappī ca hoti, anissukī ca hoti, paññavā ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’’ti. Tatiyaṃ.",
      "english": "Anuruddha, a woman endowed with five qualities is reborn in a happy destination, a heavenly world, after the dissolution of the body and subsequent to death. Which five? She possesses confident faith, she possesses a sense of moral shame, she possesses moral dread, she is not envious, and she possesses wisdom. Anuruddha, a woman endowed with these five qualities is reborn in a happy destination, a heavenly world, after the dissolution of the body and subsequent to death.",
      "sinhala": "අනුරුද්ධයෙනි, ධර්ම පහකින් සමන්විත වූ මාතෘගාමයක් කය බිඳී, මරණයෙන් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදී. කවර ධර්ම පහකින්ද? ඒ ස්ත්‍රිය ශ්‍රද්ධාවන්ත වේ, හිරිමත් වේ, ඔතප්පත් වේ, ඊර්ෂ්‍යා රහිත වේ, ප්‍රඥාවන්ත වේ. අනුරුද්ධයෙනි, සැබවින්ම මේ ධර්ම පහකින් සමන්විත වූ මාතෘගාමයක් කය බිඳී, මරණයෙන් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදී.",
      "paliTitle": "Anissukīsuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 297,
      "pali": "Amaccharī ca hoti, paññavā ca hoti…pe…. Catutthaṃ.",
      "english": "He is unselfish and he is wise. The fourth.",
      "sinhala": "ඔහු අලෝභී ද වේ, ප්‍රඥාවන්ත ද වේ, යනාදී ගුණධර්මයන්ගෙන් ද යුක්ත වේ. මෙය සිව්වැන්නයි.",
      "paliTitle": "Amaccharīsuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 298,
      "pali": "Anaticārī ca hoti, paññavā ca hoti…pe…. Pañcamaṃ.",
      "english": "He is one who does not transgress, and he is wise, and so forth. This is the fifth.",
      "sinhala": "අතික්‍රමණය නොකරන්නෙක් ද වෙයි, ප්‍රඥාවන්තයෙක් ද වෙයි.\n\nපස්වැන්න.",
      "paliTitle": "Anaticārīsuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 299,
      "pali": "Sīlavā ca hoti, paññavā ca hoti…pe…. Chaṭṭhaṃ.",
      "english": "One is endowed with ethical discipline and endowed with wisdom, and so forth. This is the Sixth.",
      "sinhala": "සිල්වත්වන්නෙක් ද වෙයි, ප්‍රඥාවන්තයෙක් ද වෙයි, ආදී වශයෙන් සයවැන්නයි.",
      "paliTitle": "Susīlasuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 300,
      "pali": "Bahussuto ca hoti, paññavā ca hoti…pe…. Sattamaṃ.",
      "english": "He is well-learned, and he is wise; this is the seventh quality in the series.",
      "sinhala": "ඔහු බහුශ්‍රැත වේ. ප්‍රඥාවන්ත ද වේ. යනාදී ගුණධර්මයන්ගෙන් ද යුක්ත වේ. සත්වන කොටසයි.",
      "paliTitle": "Bahussutasuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 301,
      "pali": "Āraddhavīriyo ca hoti, paññavā ca hoti…pe…. Aṭṭhamaṃ.",
      "english": "He has aroused energy, and he is endowed with wisdom, and so on. The eighth.",
      "sinhala": "ඔහු නිරතුරුව වීර්යය වඩන අයෙක් ද වෙයි, ප\\u200d්‍රඥාවෙන් යුක්ත අයෙක් ද වෙයි, ආදී වශයෙන් ද වෙයි. අටවැනිය.",
      "paliTitle": "Āraddhavīriyasuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 302,
      "pali": "‘‘Upaṭṭhitassati ca hoti, paññavā ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’’ti. Navamaṃ. Ime aṭṭha suttantasaṅkhepā.",
      "english": "One is mindful and discerning – indeed, Anuruddha, a woman endowed with these five qualities, upon the dissolution of the body, after death, is reborn in a good destination, a heavenly world. The Ninth. These are eight brief summaries of suttas.",
      "sinhala": "අනුරුද්ධය, සිහිය පිහිටුවාගෙන සිටින්නියක ද වන, ප්‍රඥාවන්ත තැනැත්තියක ද වන යම් මාතෘ ග්‍රාමයක් මේ පංච ධර්මයන්ගෙන් සමන්වාගත වේද, ඇය කාය භේදයෙන් පසුව, මරණයෙන් අනතුරුව සුගතියක් වූ ස්වර්ග ලෝකයක උපදී.\n\nනවවැනියයි.\n\nමේවා සූත්‍රාන්ත සංක්ෂේප අටයි.",
      "paliTitle": "Upaṭṭhitassatisuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 303,
      "pali": "‘‘Pañcahi, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Katamehi pañcahi? Pāṇātipātā paṭivirato ca hoti, adinnādānā paṭivirato ca hoti, kāmesumicchācārā paṭivirato ca hoti, musāvādā paṭivirato ca hoti, surāmerayamajjappamādaṭṭhānā paṭivirato ca hoti – imehi kho, anuruddha, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’’ti. Dasamaṃ. Dutiyapeyyālavaggo. Tassuddānaṃ – Dutiye ca [anuruddho (sabbattha)] akkodhano, anupanāhī anissukī; Amaccharī anaticārī, sīlavā ca bahussuto; Vīriyaṃ sati sīlañca, sukkapakkhe pakāsito.",
      "english": "“Anuruddha, a woman endowed with five qualities is reborn, with the breaking up of the body, after death, in a good destination, a heavenly world. Which five? She abstains from the destruction of life; she abstains from taking what is not given; she abstains from misconduct in sensual pleasures; she abstains from false speech; and she abstains from fermented and distilled intoxicants that are a basis for heedlessness. Indeed, Anuruddha, a woman endowed with these five qualities is reborn, with the breaking up of the body, after death, in a good destination, a heavenly world.”\n\nThis is the tenth discourse of the Second Repetition Section. Its summary is: The second discourse speaks of one who is not angry, not resentful, not envious, not stingy, not an adulterer, but is virtuous and greatly learned. Energy, mindfulness, and virtue are proclaimed as belonging to the bright side.",
      "sinhala": "අනුරුද්ධයෙනි, පස් වැදෑරුම් ධර්මයන්ගෙන් සමන්වාගත වූ ස්ත්‍රියක් කය බිඳී මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයේ උපදී.\n\nකවර පස් වැදෑරුම් ධර්මයන්ගෙන් ද?\n\nඑනම්, ප්‍රාණඝාතයෙන් වැළකී සිටින්නී ය; අදත්තාදානයෙන් වැළකී සිටින්නී ය; කාමයන්හි මිථ්‍යාචාරයෙන් වැළකී සිටින්නී ය; මුසාවාදයෙන් වැළකී සිටින්නී ය; සුරාමේරය මද්‍යප්‍රමාදස්ථානයෙන් වැළකී සිටින්නී ය. අනුරුද්ධයෙනි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් සමන්වාගත වූ ස්ත්‍රියක් කය බිඳී මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයේ උපදී.\n\nදසවන සූත්‍රයයි. දෙවන පේය්‍යාල වර්ගය යි.\n\nඑහි උද්දානය යි:\nදෙවන කොටසෙහි, අනුරුද්ධ (සූත්‍රය) සෑම තැනම (කියැවිණි). අක්‍රෝධී බව, උදහස් නොගැනීම, ඊර්ෂ්‍යා නොකිරීම, මසුරු නොවීම, අනාචාරයේ නොයෙදීම, සිල්වත් බව, බහුශ්‍රැත බව, වීර්යය, සතිය සහ ශීලය යන සුක්කපක්‍ෂ ධර්ම මෙහිදී ප්‍රකාශ කරන ලදී.",
      "paliTitle": "Pañcasīlasuttaṃ",
      "vagga": "Dutiyapeyyālavaggo"
    },
    {
      "number": 304,
      "pali": "‘‘Pañcimāni, bhikkhave, mātugāmassa balāni. Katamāni pañca? Rūpabalaṃ, bhogabalaṃ, ñātibalaṃ, puttabalaṃ, sīlabalaṃ – imāni kho, bhikkhave, pañca mātugāmassa balāni. Imehi kho, bhikkhave, pañcahi balehi samannāgato mātugāmo visārado agāraṃ ajjhāvasatī’’ti. Paṭhamaṃ.",
      "english": "Monks, these are the five strengths of a woman. Which five? The strength of beauty, the strength of wealth, the strength of relatives, the strength of children, and the strength of virtue – these, monks, are the five strengths of a woman. Monks, a woman endowed with these five strengths dwells in her home with confidence.",
      "sinhala": "මහණෙනි, ස්ත්‍රියට මේ බල පසක් ඇත්තේය. කවරේද ඒ පහ? රූප බලය, භෝග බලය, ඥාති බලය, පුත්‍ර බලය, සීල බලයයි. මහණෙනි, ස්ත්‍රියට මේ බල පස ඇත්තේය. මහණෙනි, මේ බල පසින් සමන්විත ස්ත්‍රිය නිවසෙහි නිර්භයව වාසය කරයි.",
      "paliTitle": "Visāradasuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 305,
      "pali": "‘‘Pañcimāni, bhikkhave, mātugāmassa balāni. Katamāni pañca? Rūpabalaṃ, bhogabalaṃ, ñātibalaṃ, puttabalaṃ, sīlabalaṃ – imāni kho, bhikkhave, pañca mātugāmassa balāni. Imehi kho, bhikkhave, pañcahi balehi samannāgato mātugāmo sāmikaṃ pasayha agāraṃ ajjhāvasatī’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, there are these five strengths for a woman. Which five? The strength of beauty, the strength of wealth, the strength of relatives, the strength of children, and the strength of virtue – these, bhikkhus, are the five strengths for a woman. Possessing these five strengths, bhikkhus, a woman lives in her home prevailing over her husband.",
      "sinhala": "මහණෙනි, ස්ත්‍රියට මේ බලයන් පසක් ඇත. ඒ කවර පසක්ද? රූපබලය, භෝගබලය, ඥාතිබලය, පුත්‍රබලය, සීලබලය යන මේවාය. මහණෙනි, ස්ත්‍රියට මේ බලයන් පසක් ඇත. මහණෙනි, මේ බලයන් පසින් යුක්ත වූ ස්ත්‍රිය ස්වාමියා අභිබවා ගෙහි වාසය කරයි.",
      "paliTitle": "Pasayhasuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 306,
      "pali": "‘‘Pañcimāni, bhikkhave, mātugāmassa balāni. Katamāni pañca? Rūpabalaṃ, bhogabalaṃ, ñātibalaṃ, puttabalaṃ, sīlabalaṃ – imāni kho, bhikkhave, pañca mātugāmassa balāni. Imehi kho, bhikkhave, pañcahi balehi samannāgato mātugāmo sāmikaṃ abhibhuyya vattatī’’ti. Tatiyaṃ.",
      "english": "Monks, these are the five strengths of a woman. Which five? The strength of beauty, the strength of wealth, the strength of relatives, the strength of children, and the strength of moral conduct—these, monks, are the five strengths of a woman. Monks, a woman who is endowed with these five strengths indeed prevails over her husband.",
      "sinhala": "මහණෙනි, ස්ත්‍රියට මේ බලයන් පසක් ඇත. කවරේද ඒ පස? රූපබලය, භෝගබලය, ඥාතිබලය, පුත‍්‍රබලය, සීලබලය – මහණෙනි, ස්ත්‍රියට ඇති බලයන් පස නම් මේවාය.\n\nමහණෙනි, මේ බලයන් පසින් යුක්ත වූ ස්ත්‍රිය ස්වාමිපුරුෂයා යටපත් කරමින් වාසය කරයි.",
      "paliTitle": "Abhibhuyyasuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 307,
      "pali": "‘‘Ekena ca kho, bhikkhave, balena samannāgato puriso mātugāmaṃ abhibhuyya vattati. Katamena ekena balena? Issariyabalena abhibhūtaṃ mātugāmaṃ neva rūpabalaṃ tāyati, na bhogabalaṃ tāyati, na ñātibalaṃ tāyati, na puttabalaṃ tāyati, na sīlabalaṃ tāyatī’’ti. Catutthaṃ.",
      "english": "Monks, a man endowed with one power proceeds by dominating a woman. What is that one power? A woman, when overcome by the power of authority, is protected neither by the power of beauty, nor by the power of wealth, nor by the power of relatives, nor by the power of children, nor by the power of moral conduct.",
      "sinhala": "භික්ෂූන් වහන්ස, එක්තරා බලයකින් යුක්ත වූ පුද්ගලයෙක් ස්ත්‍රියක් කෙරෙහි ආධිපත්‍යය දරමින් කටයුතු කරයි. ඒ එක් බලය කුමක්ද? ආධිපත්‍ය බලයෙන් අභිබවා සිටින ස්ත්‍රියක් රූප බලය ආරක්ෂා නොකරයි, ධන බලය ආරක්ෂා නොකරයි, ඥාති බලය ආරක්ෂා නොකරයි, පුත්‍ර බලය ආරක්ෂා නොකරයි, ශීල බලය ආරක්ෂා නොකරයි.",
      "paliTitle": "Ekasuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 308,
      "pali": "‘‘Pañcimāni, bhikkhave, mātugāmassa balāni. Katamāni pañca? Rūpabalaṃ, bhogabalaṃ, ñātibalaṃ, puttabalaṃ, sīlabalaṃ. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, na ca bhogabalena – evaṃ so tenaṅgena aparipūro hoti. Yato ca kho, bhikkhave, mātugāmo rūpabalena ca samannāgato hoti, bhogabalena ca – evaṃ so tenaṅgena paripūro hoti. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, bhogabalena ca, na ca ñātibalena – evaṃ so tenaṅgena aparipūro hoti. Yato ca kho, bhikkhave, mātugāmo rūpabalena ca samannāgato hoti, bhogabalena ca, ñātibalena ca – evaṃ so tenaṅgena paripūro hoti. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, bhogabalena ca, ñātibalena ca, na ca puttabalena – evaṃ so tenaṅgena aparipūro hoti. Yato ca kho, bhikkhave, mātugāmo rūpabalena ca samannāgato hoti, bhogabalena ca, ñātibalena ca, puttabalena ca – evaṃ so tenaṅgena paripūro hoti. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, bhogabalena ca, ñātibalena ca, puttabalena ca, na ca sīlabalena – evaṃ so tenaṅgena aparipūro hoti. Yato ca kho, bhikkhave, mātugāmo rūpabalena ca samannāgato hoti, bhogabalena ca, ñātibalena ca, puttabalena ca, sīlabalena ca – evaṃ so tenaṅgena paripūro hoti. Imāni kho, bhikkhave, pañca mātugāmassa balānī’’ti. Pañcamaṃ.",
      "english": "Monks, these five are the strengths of a woman. Which five? The strength of beauty, the strength of wealth, the strength of relatives, the strength of children, and the strength of virtue. And if, monks, a woman is endowed with the strength of beauty, but not with the strength of wealth, then she is incomplete in that respect. But if, monks, a woman is endowed with the strength of beauty and also with the strength of wealth, then she is complete in that respect. And if, monks, a woman is endowed with the strength of beauty and the strength of wealth, but not with the strength of relatives, then she is incomplete in that respect. But if, monks, a woman is endowed with the strength of beauty, the strength of wealth, and also with the strength of relatives, then she is complete in that respect. And if, monks, a woman is endowed with the strength of beauty, the strength of wealth, and the strength of relatives, but not with the strength of children, then she is incomplete in that respect. But if, monks, a woman is endowed with the strength of beauty, the strength of wealth, the strength of relatives, and also with the strength of children, then she is complete in that respect. And if, monks, a woman is endowed with the strength of beauty, the strength of wealth, the strength of relatives, and the strength of children, but not with the strength of virtue, then she is incomplete in that respect. But if, monks, a woman is endowed with the strength of beauty, the strength of wealth, the strength of relatives, the strength of children, and also with the strength of virtue, then she is complete in that respect. These, monks, are the five strengths of a woman.",
      "sinhala": "මහණෙනි, ස්ත්‍රියකට බලධර්ම පහක් ඇත. කවරේද ඒ පහ? රූප බලය, භෝග බලය, ඥාති බලය, පුත්‍ර බලය, සීල බලය.\n\nමහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන් යුක්ත වුවත් භෝග බලයෙන් යුක්ත නොවන්නේ නම්, ඇය ඒ අංගයෙන් අසම්පූර්ණ වේ. මහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන්ද, භෝග බලයෙන්ද යුක්ත වන්නේ නම්, ඇය ඒ අංගයෙන් සම්පූර්ණ වේ. මහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන්ද, භෝග බලයෙන්ද යුක්ත වුවත් ඥාති බලයෙන් යුක්ත නොවන්නේ නම්, ඇය ඒ අංගයෙන් අසම්පූර්ණ වේ. මහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන්ද, භෝග බලයෙන්ද, ඥාති බලයෙන්ද යුක්ත වන්නේ නම්, ඇය ඒ අංගයෙන් සම්පූර්ණ වේ. මහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන්ද, භෝග බලයෙන්ද, ඥාති බලයෙන්ද යුක්ත වුවත් පුත්‍ර බලයෙන් යුක්ත නොවන්නේ නම්, ඇය ඒ අංගයෙන් අසම්පූර්ණ වේ. මහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන්ද, භෝග බලයෙන්ද, ඥාති බලයෙන්ද, පුත්‍ර බලයෙන්ද යුක්ත වන්නේ නම්, ඇය ඒ අංගයෙන් සම්පූර්ණ වේ. මහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන්ද, භෝග බලයෙන්ද, ඥාති බලයෙන්ද, පුත්‍ර බලයෙන්ද යුක්ත වුවත් සීල බලයෙන් යුක්ත නොවන්නේ නම්, ඇය ඒ අංගයෙන් අසම්පූර්ණ වේ. මහණෙනි, යම් ස්ත්‍රියක් රූප බලයෙන්ද, භෝග බලයෙන්ද, ඥාති බලයෙන්ද, පුත්‍ර බලයෙන්ද, සීල බලයෙන්ද යුක්ත වන්නේ නම්, ඇය ඒ අංගයෙන් සම්පූර්ණ වේ. මහණෙනි, ස්ත්‍රියකට ඇති බලධර්ම පහක් නම් මේවායි.",
      "paliTitle": "Aṅgasuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 309,
      "pali": "‘‘Pañcimāni, bhikkhave, mātugāmassa balāni. Katamāni pañca? Rūpabalaṃ, bhogabalaṃ, ñātibalaṃ, puttabalaṃ, sīlabalaṃ. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, na ca sīlabalena, nāsenteva naṃ, kule na vāsenti. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, bhogabalena ca, na ca sīlabalena, nāsenteva naṃ, kule na vāsenti. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, bhogabalena ca, ñātibalena ca, na ca sīlabalena, nāsenteva naṃ, kule na vāsenti. Rūpabalena ca, bhikkhave, mātugāmo samannāgato hoti, bhogabalena ca, ñātibalena ca, puttabalena ca, na ca sīlabalena, nāsenteva naṃ, kule na vāsenti. Sīlabalena ca, bhikkhave, mātugāmo samannāgato hoti, na ca rūpabalena, vāsenteva naṃ, kule na nāsenti. Sīlabalena ca, bhikkhave, mātugāmo samannāgato hoti, na ca bhogabalena, vāsenteva naṃ, kule na nāsenti. Sīlabalena ca, bhikkhave, mātugāmo samannāgato hoti, na ca ñātibalena, vāsenteva naṃ, kule na nāsenti. Sīlabalena ca, bhikkhave, mātugāmo samannāgato hoti, na ca puttabalena, vāsenteva naṃ, kule na nāsenti. Imāni kho, bhikkhave, pañca mātugāmassa balānī’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, there are these five strengths for a woman. What are these five? The strength of beauty, the strength of wealth, the strength of relatives, the strength of children, and the strength of moral conduct. Monks, if a woman is endowed with the strength of beauty, but not with the strength of moral conduct, they cast her out and do not keep her in the family. Monks, if a woman is endowed with the strength of beauty and the strength of wealth, but not with the strength of moral conduct, they cast her out and do not keep her in the family. Monks, if a woman is endowed with the strength of beauty, the strength of wealth, and the strength of relatives, but not with the strength of moral conduct, they cast her out and do not keep her in the family. Monks, if a woman is endowed with the strength of beauty, the strength of wealth, the strength of relatives, and the strength of children, but not with the strength of moral conduct, they cast her out and do not keep her in the family. Monks, if a woman is endowed with the strength of moral conduct, but not with the strength of beauty, they keep her and do not cast her out of the family. Monks, if a woman is endowed with the strength of moral conduct, but not with the strength of wealth, they keep her and do not cast her out of the family. Monks, if a woman is endowed with the strength of moral conduct, but not with the strength of relatives, they keep her and do not cast her out of the family. Monks, if a woman is endowed with the strength of moral conduct, but not with the strength of children, they keep her and do not cast her out of the family. These, monks, are the five strengths for a woman.”",
      "sinhala": "මහණෙනි, ස්ත්‍රියකට බලයන් පසක් ඇත. කවරේද ඒ පහ? රූපබලය, භෝගබලය, ඥාත‌ිබලය, පුත්‍රබලය, සීලබලය යන මේවාය.\n\nමහණෙනි, යම් ස්ත්‍ර‌ියක් රූපබලයෙන් යුක්තව සිටියත්, සීලබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව විනාශ කර දමයි; පවුල තුළ රඳවා නොගනිති. මහණෙනි, යම් ස්ත්‍ර‌ියක් රූපබලයෙන් හා භෝගබලයෙන් යුක්තව සිටියත්, සීලබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව විනාශ කර දමයි; පවුල තුළ රඳවා නොගනිති. මහණෙනි, යම් ස්ත්‍ර‌ියක් රූපබලයෙන්, භෝගබලයෙන් හා ඥාත‌ිබලයෙන් යුක්තව සිටියත්, සීලබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව විනාශ කර දමයි; පවුල තුළ රඳවා නොගනිති. මහණෙනි, යම් ස්ත්‍ර‌ියක් රූපබලයෙන්, භෝගබලයෙන්, ඥාත‌ිබලයෙන් හා පුත්‍රබලයෙන් යුක්තව සිටියත්, සීලබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව විනාශ කර දමයි; පවුල තුළ රඳවා නොගනිති.\n\nමහණෙනි, යම් ස්ත්‍ර‌ියක් සීලබලයෙන් යුක්තව සිටියත්, රූපබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව රඳවා තබාගනිති; පවුල තුළ ඇයව විනාශ නොකරති. මහණෙනි, යම් ස්ත්‍ර‌ියක් සීලබලයෙන් යුක්තව සිටියත්, භෝගබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව රඳවා තබාගනිති; පවුල තුළ ඇයව විනාශ නොකරති. මහණෙනි, යම් ස්ත්‍ර‌ියක් සීලබලයෙන් යුක්තව සිටියත්, ඥාත‌ිබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව රඳවා තබාගනිති; පවුල තුළ ඇයව විනාශ නොකරති. මහණෙනි, යම් ස්ත්‍ර‌ියක් සීලබලයෙන් යුක්තව සිටියත්, පුත්‍රබලයෙන් යුක්ත නොවන්නේ නම්, ඔවුන් ඇයව රඳවා තබාගනිති; පවුල තුළ ඇයව විනාශ නොකරති. මහණෙනි, ස්ත්‍රියකට ඇති බලයන් මේ පසයි.",
      "paliTitle": "Nāsentisuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 310,
      "pali": "‘‘Pañcimāni, bhikkhave, mātugāmassa balāni. Katamāni pañca? Rūpabalaṃ, bhogabalaṃ, ñātibalaṃ, puttabalaṃ, sīlabalaṃ. Na, bhikkhave, mātugāmo rūpabalahetu vā bhogabalahetu vā ñātibalahetu vā puttabalahetu vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Sīlabalahetu kho, bhikkhave, mātugāmo kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Imāni kho, bhikkhave, pañca mātugāmassa balānī’’ti. Sattamaṃ.",
      "english": "Monks, these five are the strengths of women. Which five? The strength of beauty, the strength of wealth, the strength of relatives, the strength of children, and the strength of virtue. Monks, it is not because of the strength of beauty, or the strength of wealth, or the strength of relatives, or the strength of children, that a woman, with the breaking up of the body, after death, is reborn in a good destination, a heavenly world. Indeed, Monks, it is because of the strength of virtue that a woman, with the breaking up of the body, after death, is reborn in a good destination, a heavenly world. Indeed, Monks, these are the five strengths of women.",
      "sinhala": "භික්‍ෂූන් වහන්ස, කාන්තාවකට බලයන් පසක් ඇත.\nඒ පස කවරේද?\nරූප බලය, භෝග බලය, ඥාති බලය, පුත‍්‍ර බලය, ශීල බලය යනුයි.\nභික්‍ෂූන් වහන්ස, කාන්තාවක් රූප බලය හේතුවෙන් හෝ, භෝග බලය හේතුවෙන් හෝ, ඥාති බලය හේතුවෙන් හෝ, පුත‍්‍ර බලය හේතුවෙන් හෝ ශරීරය බිඳී, මරණයෙන් පසු සුගතියකට, ස්වර්ග ලෝකයකට උපදින්නේ නැත.\nඑහෙත්, භික්‍ෂූන් වහන්ස, කාන්තාවක් ශීල බලය හේතුවෙන් නම් ශරීරය බිඳී, මරණයෙන් පසු සුගතියකට, ස්වර්ග ලෝකයකට උපදී.\nභික්‍ෂූන් වහන්ස, කාන්තාවකට ඇති බලයන් පස නම් මේවායි.",
      "paliTitle": "Hetusuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 311,
      "pali": "‘‘Pañcimāni, bhikkhave, ṭhānāni dullabhāni akatapuññena mātugāmena. Katamāni pañca? Patirūpe kule jāyeyyanti – idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ dullabhaṃ akatapuññena mātugāmena. Patirūpe kule jāyitvā patirūpaṃ kulaṃ gaccheyyanti – idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ dullabhaṃ akatapuññena mātugāmena. Patirūpe kule jāyitvā, patirūpaṃ kulaṃ gantvā, asapatti agāraṃ ajjhāvaseyyanti – idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ dullabhaṃ akatapuññena mātugāmena. Patirūpe kule jāyitvā, patirūpaṃ kulaṃ gantvā, asapatti agāraṃ ajjhāvasantī puttavatī assanti – idaṃ, bhikkhave, catutthaṃ ṭhānaṃ dullabhaṃ akatapuññena mātugāmena. Patirūpe kule jāyitvā, patirūpaṃ kulaṃ gantvā, asapatti agāraṃ ajjhāvasantī puttavatī samānā sāmikaṃ abhibhuyya vatteyyanti – idaṃ, bhikkhave, pañcamaṃ ṭhānaṃ dullabhaṃ akatapuññena mātugāmena. Imāni kho, bhikkhave, pañca ṭhānāni dullabhāni akatapuññena mātugāmenāti. ‘‘Pañcimāni, bhikkhave, ṭhānāni sulabhāni katapuññena mātugāmena. Katamāni pañca? Patirūpe kule jāyeyyanti – idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ sulabhaṃ katapuññena mātugāmena. Patirūpe kule jāyitvā patirūpaṃ kulaṃ gaccheyyanti – idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ sulabhaṃ katapuññena mātugāmena. Patirūpe kule jāyitvā patirūpaṃ kulaṃ gantvā asapatti agāraṃ ajjhāvaseyyanti – idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ sulabhaṃ katapuññena mātugāmena. Patirūpe kule jāyitvā patirūpaṃ kulaṃ gantvā asapatti agāraṃ ajjhāvasantī puttavatī assanti – idaṃ, bhikkhave, catutthaṃ ṭhānaṃ sulabhaṃ katapuññena mātugāmena. Patirūpe kule jāyitvā patirūpaṃ kulaṃ gantvā asapatti agāraṃ ajjhāvasantī puttavatī samānā sāmikaṃ abhibhuyya vatteyyanti – idaṃ, bhikkhave, pañcamaṃ ṭhānaṃ sulabhaṃ katapuññena mātugāmena. Imāni kho, bhikkhave, pañca ṭhānāni sulabhāni katapuññena mātugāmenā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these five conditions are hard for a woman who has not performed meritorious deeds to attain. Which five? That she be born into a suitable family – this, monks, is the first condition hard for a woman who has not performed meritorious deeds to attain. Having been born into a suitable family, that she then go to a suitable family in marriage – this, monks, is the second condition hard for a woman who has not performed meritorious deeds to attain. Having been born into a suitable family, having gone to a suitable family, that she then dwell in a household without co-wives or rivals – this, monks, is the third condition hard for a woman who has not performed meritorious deeds to attain. Having been born into a suitable family, having gone to a suitable family, dwelling in a household without co-wives or rivals, that she then have children – this, monks, is the fourth condition hard for a woman who has not performed meritorious deeds to attain. Having been born into a suitable family, having gone to a suitable family, dwelling in a household without co-wives or rivals, and having children, that she then live having gained dominance over her husband – this, monks, is the fifth condition hard for a woman who has not performed meritorious deeds to attain. Indeed, monks, these five conditions are hard for a woman who has not performed meritorious deeds to attain.\n\nMonks, these five conditions are easy for a woman who has performed meritorious deeds to attain. Which five? That she be born into a suitable family – this, monks, is the first condition easy for a woman who has performed meritorious deeds to attain. Having been born into a suitable family, that she then go to a suitable family in marriage – this, monks, is the second condition easy for a woman who has performed meritorious deeds to attain. Having been born into a suitable family, having gone to a suitable family, that she then dwell in a household without co-wives or rivals – this, monks, is the third condition easy for a woman who has performed meritorious deeds to attain. Having been born into a suitable family, having gone to a suitable family, dwelling in a household without co-wives or rivals, that she then have children – this, monks, is the fourth condition easy for a woman who has performed meritorious deeds to attain. Having been born into a suitable family, having gone to a suitable family, dwelling in a household without co-wives or rivals, and having children, that she then live having gained dominance over her husband – this, monks, is the fifth condition easy for a woman who has performed meritorious deeds to attain. Indeed, monks, these five conditions are easy for a woman who has performed meritorious deeds to attain.",
      "sinhala": "මහණෙනි, පින් නොකළ ස්ත්‍රියකට දුර්ලභ වූ කරුණු (ස්ථාන) පහක් මේවා වෙති. කවරේද ඒ පහ? සුදුසු කුලයක උපදින්නට ලැබීම - මහණෙනි, පින් නොකළ ස්ත්‍රියකට මෙය දුර්ලභ වූ පළමුවන කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී යාම - මහණෙනි, පින් නොකළ ස්ත්‍රියකට මෙය දුර්ලභ වූ දෙවෙනි කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී ගොස්, සපත්නියන් රහිත ගෘහයක වාසය කිරීම - මහණෙනි, පින් නොකළ ස්ත්‍රියකට මෙය දුර්ලභ වූ තුන්වන කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී ගොස්, සපත්නියන් රහිත ගෘහයක වාසය කරමින් දරුවන් ඇති ස්ත්‍රියක් වීම - මහණෙනි, පින් නොකළ ස්ත්‍රියකට මෙය දුර්ලභ වූ සතරවන කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී ගොස්, සපත්නියන් රහිත ගෘහයක වාසය කරමින් දරුවන් ඇති ස්ත්‍රියක් වී ස්වාමියාට වඩා වැදගත් තැනක් ලබා වාසය කිරීම - මහණෙනි, පින් නොකළ ස්ත්‍රියකට මෙය දුර්ලභ වූ පස්වන කරුණයි. මහණෙනි, පින් නොකළ ස්ත්‍රියකට මේ කරුණු පහ දුර්ලභ වෙති.\n\nමහණෙනි, පින් කළ ස්ත්‍රියකට සුලභ වන කරුණු (ස්ථාන) පහක් මේවාය. කවරේද ඒ පහ? සුදුසු කුලයක උපදින්නට ලැබීම - මහණෙනි, පින් කළ ස්ත්‍රියකට මෙය සුලභ වූ පළමුවන කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී යාම - මහණෙනි, පින් කළ ස්ත්‍රියකට මෙය සුලභ වූ දෙවෙනි කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී ගොස්, සපත්නියන් රහිත ගෘහයක වාසය කිරීම - මහණෙනි, පින් කළ ස්ත්‍රියකට මෙය සුලභ වූ තුන්වන කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී ගොස්, සපත්නියන් රහිත ගෘහයක වාසය කරමින් දරුවන් ඇති ස්ත්‍රියක් වීම - මහණෙනි, පින් කළ ස්ත්‍රියකට මෙය සුලභ වූ සතරවන කරුණයි. සුදුසු කුලයක උපදින්නට ලැබී, සුදුසු කුලයකට විවාහ වී ගොස්, සපත්නියන් රහිත ගෘහයක වාසය කරමින් දරුවන් ඇති ස්ත්‍රියක් වී ස්වාමියාට වඩා වැදගත් තැනක් ලබා වාසය කිරීම - මහණෙනි, පින් කළ ස්ත්‍රියකට මෙය සුලභ වූ පස්වන කරුණයි. මහණෙනි, පින් කළ ස්ත්‍රියකට මේ කරුණු පහ සුලභ වෙති.",
      "paliTitle": "Ṭhānasuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 312,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato mātugāmo visārado agāraṃ ajjhāvasati. Katamehi pañcahi? Pāṇātipātā paṭivirato ca hoti, adinnādānā paṭivirato ca hoti, kāmesumicchācārā paṭivirato ca hoti, musāvādā paṭivirato ca hoti, surāmerayamajjappamādaṭṭhānā paṭivirato ca hoti – imehi kho, bhikkhave, pañcahi dhammehi samannāgato mātugāmo visārado agāraṃ ajjhāvasatī’’ti. Navamaṃ.",
      "english": "Monks, a woman endowed with five qualities dwells in a home with confidence. Which five? She abstains from the destruction of life, she abstains from taking what is not given, she abstains from sexual misconduct, she abstains from false speech, and she abstains from intoxicating drinks and drugs that are a basis for heedlessness. Indeed, Monks, a woman endowed with these five qualities dwells in a home with confidence.",
      "sinhala": "මහණෙනි, ගුණධර්ම පහකින් යුක්ත වූ ස්ත්‍රියක් නිර්භයව ගෘහ ජීවිතය ගත කරයි. ඒ කවර පහක්ද?\n\nප‍්‍රාණඝාතයෙන් වැළකී සිටින්නියක වේ, අදත්තාදානයෙන් වැළකී සිටින්නියක වේ, කාමමිථ්‍යාචාරයෙන් වැළකී සිටින්නියක වේ, මුසාවාදයෙන් වැළකී සිටින්නියක වේ, සුරා-මේරය නම් වූ මත්පැන් පානයෙන් හටගන්නා ප‍්‍රමාදයට හේතුවන කාරණාවලින් වැළකී සිටින්නියක වේ. මහණෙනි, මේ ගුණධර්ම පහකින් යුක්ත වූ ස්ත්‍රියක් නිර්භයව ගෘහ ජීවිතය ගත කරයි.",
      "paliTitle": "Pañcasīlavisāradasuttaṃ",
      "vagga": "Balavaggo"
    },
    {
      "number": 313,
      "pali": "‘‘Pañcahi, bhikkhave, vaḍḍhīhi vaḍḍhamānā ariyasāvikā ariyāya vaḍḍhiyā vaḍḍhati sārādāyinī ca hoti varādāyinī ca kāyassa. Katamehi pañcahi? Saddhāya vaḍḍhati, sīlena vaḍḍhati, sutena vaḍḍhati, cāgena vaḍḍhati, paññāya vaḍḍhati – imehi kho, bhikkhave, pañcahi vaḍḍhīhi vaḍḍhamānā ariyasāvikā ariyāya vaḍḍhiyā vaḍḍhati, sārādāyinī ca hoti, varādāyinī ca kāyassā’’ti. ‘‘Saddhāya sīlena ca yādha vaḍḍhati, Paññāya cāgena sutena cūbhayaṃ; Sā tādisī sīlavatī upāsikā, Ādīyati sāramidheva attano’’ti. dasamaṃ; Balavaggo tatiyo. Tassuddānaṃ – Visāradā pasayha abhibhuyya, ekaṃ aṅgena pañcamaṃ; Nāsenti hetu ṭhānañca, visārado vaḍḍhinā dasāti. ",
      "english": "“Monks, an noble female disciple who grows with these five kinds of growth, grows with the noble growth, and she becomes one who extracts the essence and takes the best from this very existence. With which five? She grows in conviction, she grows in moral virtue, she grows in learning, she grows in generosity, she grows in wisdom – Monks, an noble female disciple who grows with these five kinds of growth, grows with the noble growth, and she becomes one who extracts the essence and takes the best from this very existence.”\n\n“One who grows here with conviction and moral virtue, and both with wisdom, generosity, and learning; such a virtuous female lay follower extracts the very essence for herself.”",
      "sinhala": "භික්ෂූනි, කරුණු පසකින් වැඩෙන ආර්ය ශ්‍රාවිකාව ආර්ය වර්ධනයෙන් වැඩෙයි. ඇය සාරය ගත්තියක් ද වෙයි, ශරීරයෙන් උතුම් වූ දේ ලබා ගත්තියක් ද වෙයි. ඒ කවර කරුණු පසකින් ද යත්: ශ්‍රද්ධාවෙන් වැඩෙයි, සීලයෙන් වැඩෙයි, ශ්‍රවණයෙන් වැඩෙයි, ත්‍යාගයෙන් වැඩෙයි, ප්‍රඥාවෙන් වැඩෙයි. භික්ෂූනි, මේ කරුණු පසකින් වැඩෙන ආර්ය ශ්‍රාවිකාව ආර්ය වර්ධනයෙන් වැඩෙයි, ඇය සාරය ගත්තියක් ද වෙයි, ශරීරයෙන් උතුම් වූ දේ ලබා ගත්තියක් ද වෙයි.\n\nයම් ශ්‍රාවිකාවක් මෙලොව ශ්‍රද්ධාවෙන් හා සීලයෙන් ද, ප්‍රඥාවෙන් ද, ත්‍යාගයෙන් ද, ශ්‍රවණයෙන් ද යන මේ සියල්ලෙන් දියුණු වෙයි ද, ඒ ශ්‍රේෂ්ඨ සිල්වත් උපාසිකාව තමාගේම ජීවිතයේ සාරය මැනවින් ලබා ගනී.",
      "paliTitle": "Vaḍḍhīsuttaṃ",
      "vagga": "Balavaggo"
    }
  ],
  "footer": {
    "pali": "Mātugāmasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}