{
  "id": "sn.4.4",
  "title": {
    "pali": "Jambukhādakasaṃyuttaṃ",
    "english": "The Connected Discourses with Jambukhādaka",
    "sinhala": "ජම්බුඛාදක සංයුත්තය"
  },
  "sections": [
    {
      "number": 314,
      "pali": "Ekaṃ samayaṃ āyasmā sāriputto magadhesu viharati nālakagāmake. Atha kho jambukhādako paribbājako yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jambukhādako paribbājako āyasmantaṃ sāriputtaṃ etadavoca – ‘‘‘Nibbānaṃ, nibbāna’nti, āvuso sāriputta, vuccati. Katamaṃ nu kho, āvuso, nibbāna’’nti? ‘‘Yo kho, āvuso, rāgakkhayo dosakkhayo mohakkhayo – idaṃ vuccati nibbāna’’nti. ‘‘Atthi panāvuso, maggo atthi paṭipadā etassa nibbānassa sacchikiriyāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā etassa nibbānassa sacchikiriyāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā etassa nibbānassa sacchikiriyāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo etassa nibbānassa sacchikiriyāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā etassa nibbānassa sacchikiriyāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā etassa nibbānassa sacchikiriyāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Paṭhamaṃ.",
      "english": "One time, the Venerable Sāriputta was dwelling in Magadha, at Nālaka village. Then, the wandering ascetic Jambukhādaka approached the Venerable Sāriputta; having approached, he exchanged greetings with the Venerable Sāriputta. Having concluded the courteous and memorable talk, he sat down to one side. Seated to one side, the wandering ascetic Jambukhādaka said this to the Venerable Sāriputta: \"Nibbāna, Nibbāna,\" friend Sāriputta, is spoken of. \"What, now, friend, is Nibbāna?\" \"Friend, the destruction of lust, the destruction of hatred, the destruction of delusion – this is called Nibbāna.\" \"Is there, friend, a path, is there a practice for the realization of this Nibbāna?\" \"There is, friend, a path, there is a practice for the realization of this Nibbāna.\" \"What, now, friend, is that path, what is that practice for the realization of this Nibbāna?\" \"It is, friend, this Noble Eightfold Path for the realization of this Nibbāna, namely: right understanding, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This, friend, is the path, this is the practice for the realization of this Nibbāna.\" \"Excellent, friend, is the path, excellent is the practice for the realization of this Nibbāna. And it is indeed enough, friend Sāriputta, for one to be diligent.\"",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මගධ දේශයෙහි නාලක ග්‍රාමයෙහි වැඩවසන සේක. එවිට ජම්බුඛාදක පරිබ්‍රාජක තෙමේ ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බස් කථා කොට එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි ජම්බුඛාදක පරිබ්‍රාජක තෙමේ ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට මෙසේ කීවේය – ‘‘ආයුෂ්මත් ශාරිපුත්‍රයන් වහන්ස, ‘නිර්වාණය, නිර්වාණය’ යැයි කියනු ලැබේ. ආයුෂ්මතුන් වහන්ස, නිර්වාණය යනු කුමක්දැයි?’’ ‘‘ආයුෂ්මත, යම් රාගය ක්ෂය කිරීමක්, ද්වේෂය ක්ෂය කිරීමක්, මෝහය ක්ෂය කිරීමක් වේද, මෙය නිර්වාණය යැයි කියනු ලැබේ.’’ ‘‘ආයුෂ්මතුන් වහන්ස, ඒ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිස මාර්ගයක්, ප්‍රතිපදාවක් ඇත්තේද?’’ ‘‘ආයුෂ්මත, ඒ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිස මාර්ගයක්, ප්‍රතිපදාවක් ඇත.’’ ‘‘ආයුෂ්මතුන් වහන්ස, ඒ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිස ඇති මාර්ගය කුමක්ද, ප්‍රතිපදාව කුමක්ද?’’ ‘‘ආයුෂ්මත, ඒ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිස ඇති මාර්ගය නම් ආර්ය අෂ්ටාංගික මාර්ගයයි. එනම්: සම්මා දිට්ඨි (නිවැරදි දැක්ම), සම්මා සංකප්ප (නිවැරදි අදහස), සම්මා වාචා (නිවැරදි වචනය), සම්මා කම්මන්ත (නිවැරදි ක්‍රියාව), සම්මා ආජීව (නිවැරදි ජීවනෝපාය), සම්මා වායාම (නිවැරදි උත්සාහය), සම්මා සති (නිවැරදි සිහිය), සම්මා සමාධි (නිවැරදි සමාධිය) යන මේවාය. ආයුෂ්මත, මේ මාර්ගය, මේ ප්‍රතිපදාව ඒ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිස පවතී.’’ ‘‘ආයුෂ්මතුන් වහන්ස, ඒ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිස ඇති මේ මාර්ගය මැනවි, මේ ප්‍රතිපදාව මැනවි. ආයුෂ්මත් ශාරිපුත්‍රයන් වහන්ස, මේ අප්‍රමාදය පිණිස ප්‍රමාණවත්ය.’’",
      "paliTitle": "Nibbānapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Question on Nibbāna Sutta",
      "sinhalaTitle": "නිබ්බානපඤ්හා සූත්‍රය"
    },
    {
      "number": 315,
      "pali": "‘‘‘Arahattaṃ, arahatta’nti, āvuso sāriputta, vuccati. Katamaṃ nu kho, āvuso, arahatta’’nti? ‘‘Yo kho, āvuso, rāgakkhayo dosakkhayo mohakkhayo – idaṃ vuccati arahatta’’nti. ‘‘Atthi panāvuso, maggo atthi paṭipadā etassa arahattassa sacchikiriyāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā etassa arahattassa sacchikiriyāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā etassa arahattassa sacchikiriyāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo etassa arahattassa sacchikiriyāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho āvuso, maggo, ayaṃ paṭipadā etassa arahattassa sacchikiriyāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā etassa arahattassa sacchikiriyāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Dutiyaṃ.",
      "english": "“Arahantship, Arahantship” is spoken of, friend Sāriputta. Now, what is Arahantship, friend? Friend, the destruction of lust, the destruction of hatred, the destruction of delusion – this is called Arahantship. But friend, is there a path, is there a practice for the realization of this Arahantship? Indeed, friend, there is a path, there is a practice for the realization of this Arahantship. Now, friend, what is that path, what is that practice for the realization of this Arahantship? Friend, it is precisely this Noble Eightfold Path for the realization of this Arahantship, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, friend, is the path; this is the practice for the realization of this Arahantship. Excellent, friend, is this path; excellent is this practice for the realization of this Arahantship. And indeed, friend Sāriputta, it is sufficient for heedfulness.",
      "sinhala": "‘‘ආයුෂ්මත් ශාරිපුත්‍රයෙනි, ‘අරහත්වයට, අරහත්වයට’ යැයි කියනු ලැබේ. ආයුෂ්මත්නි, ඇත්තෙන්ම අරහත්වය යනු කුමක්ද?’’ ‘‘ආයුෂ්මත්නි, යම් හෙයකින් රාගක්ෂය, ද්වේෂක්ෂය, මෝහක්ෂය වේද, මෙය අරහත්වය යැයි කියනු ලැබේ.’’ ‘‘ආයුෂ්මත්නි, ඇත්තෙන්ම මේ අරහත්වය සාක්ෂාත් කරගැනීම පිණිස මාර්ගයක් තිබේද, පිළිවෙතක් තිබේද?’’ ‘‘ආයුෂ්මත්නි, ඇත්තෙන්ම මේ අරහත්වය සාක්ෂාත් කරගැනීම පිණිස මාර්ගයක් ඇත, පිළිවෙතක් ඇත.’’ ‘‘ආයුෂ්මත්නි, ඇත්තෙන්ම මේ අරහත්වය සාක්ෂාත් කරගැනීම පිණිස ඇති මාර්ගය කුමක්ද, පිළිවෙත කුමක්ද?’’ ‘‘ආයුෂ්මත්නි, මේ අරහත්වය සාක්ෂාත් කරගැනීම පිණිස ඇත්තේ ආර්ය අෂ්ටාංගික මාර්ගයමය. එනම්: සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යනුයි. ආයුෂ්මත්නි, මේ මාර්ගයයි, මේ පිළිවෙතයි මේ අරහත්වය සාක්ෂාත් කරගැනීම පිණිස ඇත්තේ.’’ ‘‘ආයුෂ්මත්නි, මේ අරහත්වය සාක්ෂාත් කරගැනීම පිණිස ඇති මාර්ගය ඉතා යහපත්ය, පිළිවෙත ඉතා යහපත්ය. ආයුෂ්මත් ශාරිපුත්‍රයෙනි, අප්‍රමාදීව කටයුතු කිරීමට මේ කරුණු සෑහේ.’’\n\nදෙවැනි වරට.",
      "paliTitle": "Arahattapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Question on Arahantship Sutta",
      "sinhalaTitle": "අරහත්ත පඤ්හ සූත්‍රය"
    },
    {
      "number": 316,
      "pali": "‘‘Ke nu kho, āvuso sāriputta, loke dhammavādino, ke loke suppaṭipannā, ke loke sugatā’’ti? ‘‘Ye kho, āvuso, rāgappahānāya dhammaṃ desenti, dosappahānāya dhammaṃ desenti, mohappahānāya dhammaṃ desenti, te loke dhammavādino. Ye kho, āvuso, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā. Yesaṃ kho, āvuso, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, doso pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, te loke sugatā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti. ‘‘Katamo, panāvuso, maggo katamā paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo etassa rāgassa dosassa mohassa pahānāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etassa rāgassa dosassa mohassa pahānāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Tatiyaṃ.",
      "english": "“Friends Sāriputta, who in the world are those who proclaim the Dhamma? Who in the world are those who practice correctly? Who in the world are the well-gone ones?”\n\n“Friends, those who proclaim the Dhamma for the abandoning of lust, who proclaim the Dhamma for the abandoning of aversion, who proclaim the Dhamma for the abandoning of delusion—these in the world are those who proclaim the Dhamma. Friends, those who have entered upon the practice for the abandoning of lust, who have entered upon the practice for the abandoning of aversion, who have entered upon the practice for the abandoning of delusion—these in the world are those who practice correctly. Friends, those for whom lust is abandoned, uprooted, made like a palm stump, rendered non-existent, not liable to arise again in the future; for whom aversion is abandoned, uprooted, made like a palm stump, rendered non-existent, not liable to arise again in the future; for whom delusion is abandoned, uprooted, made like a palm stump, rendered non-existent, not liable to arise again in the future—these in the world are the well-gone ones.”\n\n“But friends, is there a path, is there a practice for the abandoning of this lust, aversion, and delusion?”\n\n“Friends, there is indeed a path, there is a practice for the abandoning of this lust, aversion, and delusion.”\n\n“But friends, what is that path, what is that practice for the abandoning of this lust, aversion, and delusion?”\n\n“Friends, this Noble Eightfold Path is the path for the abandoning of this lust, aversion, and delusion, namely: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. Friends, this is that path, this is that practice for the abandoning of this lust, aversion, and delusion.”\n\n“Friends, excellent is this path, excellent is this practice, for the abandoning of this lust, aversion, and delusion. And friends Sāriputta, it is sufficient for heedfulness.”",
      "sinhala": "ආයුෂ්මත් ශාරිපුත්තයෙනි, ලෝකයේ ධර්මය ප්‍රකාශ කරන්නෝ කවරහුද? ලෝකයේ යහපත් ප්‍රතිපදාවෙන් යුක්තවූවෝ කවරහුද? ලෝකයේ සුගතවූවෝ කවරහුද?\n\nආයුෂ්මත්වරයාණෙනි, යම් කෙනෙක් රාගය ප්‍ර‍හාණය කිරීම පිණිස ධර්මය දේශනා කරත්ද, ද්වේෂය ප්‍ර‍හාණය කිරීම පිණිස ධර්මය දේශනා කරත්ද, මෝහය ප්‍ර‍හාණය කිරීම පිණිස ධර්මය දේශනා කරත්ද, ඔවුහු ලෝකයේ ධර්මය ප්‍ර‍කාශ කරන්නෝ වෙති. යම් කෙනෙක් රාගය ප්‍ර‍හාණය කිරීම පිණිස පිළිපදින්නෝ වෙත්ද, ද්වේෂය ප්‍ර‍හාණය කිරීම පිණිස පිළිපදින්නෝ වෙත්ද, මෝහය ප්‍ර‍හාණය කිරීම පිණිස පිළිපදින්නෝ වෙත්ද, ඔවුහු ලෝකයේ යහපත් ප්‍රතිපදාවෙන් යුක්තවූවෝ වෙති. ආයුෂ්මත්වරයාණෙනි, යම් අයෙකුගේ රාගය ප්‍ර‍හීණ වී, මුලින් සිඳී, තල් ගසක් මුලින් උදුරා දැමූවාක් මෙන් නැවත හට නොගන්නා සේ අභාවයට පත් කොට, අනාගතයේ නැවත නූපදින ස්වභාවයට පත්වී ඇත්ද; ද්වේෂය ප්‍ර‍හීණ වී, මුලින් සිඳී, තල් ගසක් මුලින් උදුරා දැමූවාක් මෙන් නැවත හට නොගන්නා සේ අභාවයට පත් කොට, අනාගතයේ නැවත නූපදින ස්වභාවයට පත්වී ඇත්ද; මෝහය ප්‍ර‍හීණ වී, මුලින් සිඳී, තල් ගසක් මුලින් උදුරා දැමූවාක් මෙන් නැවත හට නොගන්නා සේ අභාවයට පත් කොට, අනාගතයේ නැවත නූපදින ස්වභාවයට පත්වී ඇත්ද, ඔවුහු ලෝකයේ සුගතවූවෝ වෙති.\n\nආයුෂ්මත්වරයාණෙනි, මේ රාගය, ද්වේෂය, මෝහය ප්‍ර‍හාණය කිරීම පිණිස මාර්ගයක් ඇද්ද, ප්‍රතිපදාවක් ඇද්ද?\n\nආයුෂ්මත්වරයාණෙනි, මේ රාගය, ද්වේෂය, මෝහය ප්‍ර‍හාණය කිරීම පිණිස මාර්ගයක් ඇත, ප්‍රතිපදාවක් ඇත.\n\nආයුෂ්මත්වරයාණෙනි, මේ රාගය, ද්වේෂය, මෝහය ප්‍ර‍හාණය කිරීම පිණිස කවර මාර්ගයක්ද? කවර ප්‍රතිපදාවක්ද?\n\nආයුෂ්මත්වරයාණෙනි, මේ රාගය, ද්වේෂය, මෝහය ප්‍ර‍හාණය කිරීම පිණිස මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේ. එනම්: සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධියයි. ආයුෂ්මත්වරයාණෙනි, මේ රාගය, ද්වේෂය, මෝහය ප්‍ර‍හාණය කිරීම පිණිස මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි.\n\nආයුෂ්මත්වරයාණෙනි, මේ රාගය, ද්වේෂය, මෝහය ප්‍ර‍හාණය කිරීම පිණිස යහපත් මාර්ගයකි, යහපත් ප්‍රතිපදාවකි. ආයුෂ්මත් ශාරිපුත්තයෙනි, අප්‍ර‍මාදීව කටයුතු කිරීමට මේ ප්‍ර‍මාණවත්ය.",
      "paliTitle": "Dhammavādīpañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Questions on One Who Speaks Dhamma Sutta",
      "sinhalaTitle": "ධම්මවාදීපඤ්හ සූත්‍රය"
    },
    {
      "number": 317,
      "pali": "‘‘Kimatthiyaṃ, āvuso sāriputta, samaṇe gotame brahmacariyaṃ vussatī’’ti? ‘‘Dukkhassa kho, āvuso, pariññatthaṃ bhagavati brahmacariyaṃ vussatī’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā etassa dukkhassa pariññāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etassa dukkhassa pariññāyā’’ti? ‘‘Katamo panāvuso, maggo katamā paṭipadā, etassa dukkhassa pariññāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etassa dukkhassa pariññāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā etassa dukkhassa pariññāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etassa dukkhassa pariññāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Catutthaṃ.",
      "english": "\"For what purpose, friend Sāriputta, is the holy life lived under the recluse Gotama?\" \"Indeed, friend, the holy life is lived under the Blessed One for the full comprehension of suffering.\" \"Is there then, friend, a path, a way of practice, for the full comprehension of this suffering?\" \"Indeed there is, friend, a path, a way of practice, for the full comprehension of this suffering.\" \"Which then, friend, is that path, that way of practice, for the full comprehension of this suffering?\" \"Indeed, friend, it is this Noble Eightfold Path for the full comprehension of this suffering, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. Indeed, friend, this is the path, this is the way of practice, for the full comprehension of this suffering.\" \"Excellent indeed, friend, is this path, excellent is this way of practice, for the full comprehension of this suffering. And sufficient, friend Sāriputta, for the cultivation of heedfulness!\"",
      "sinhala": "\"ඇවැත් සාරිපුත්තයෙනි, ශ්‍රමණ ගෞතමයන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාව පුරනු ලබන්නේ කුමන අරමුණකින්ද?\" \"ඇවැත්නි, භාග්‍යවතුන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාව පුරනු ලබන්නේ දුක මුළුමනින්ම අවබෝධ කිරීම පිණිසය.\" \"ඇවැත්නි, මේ දුක මුළුමනින්ම අවබෝධ කිරීම පිණිස මාර්ගයක් තිබේද? පිළිවෙතක් තිබේද?\" \"ඇවැත්නි, මේ දුක මුළුමනින්ම අවබෝධ කිරීම පිණිස මාර්ගයක් තිබේ. පිළිවෙතක් තිබේ.\" \"ඇවැත්නි, මේ දුක මුළුමනින්ම අවබෝධ කිරීම පිණිස ඒ මාර්ගය කුමක්ද? ඒ පිළිවෙත කුමක්ද?\" \"ඇවැත්නි, මේ දුක මුළුමනින්ම අවබෝධ කිරීම පිණිස ඒ ආර්ය අෂ්ටාංගික මාර්ගය මෙයමය. එනම්: සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යනුයි. ඇවැත්නි, මේ දුක මුළුමනින්ම අවබෝධ කිරීම පිණිස ඇති මාර්ගයද, පිළිවෙතද මෙයයි.\" \"ඇවැත්නි, මේ දුක මුළුමනින්ම අවබෝධ කිරීම පිණිස ඇති මාර්ගයද, පිළිවෙතද ඉතා යහපත්ය. ඇවැත් සාරිපුත්තයෙනි, (මේ මාර්ගය හා පිළිවෙත) අප්‍රමාදීව කටයුතු කිරීම පිණිස ප්‍රමාණවත්ය.\"",
      "paliTitle": "Kimatthiyasuttaṃ",
      "vagga": "",
      "englishTitle": "For What Purpose Sutta",
      "sinhalaTitle": "කිමත්ථිය සූත්‍රය"
    },
    {
      "number": 318,
      "pali": "‘‘‘Assāsappatto, assāsappatto’ti, āvuso sāriputta, vuccati. Kittāvatā nu kho, āvuso, assāsappatto hotī’’ti? ‘‘Yato kho, āvuso, bhikkhu channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti, ettāvatā kho, āvuso, assāsappatto hotī’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etassa assāsassa sacchikiriyāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etassa assāsassa sacchikiriyāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etassa assāsassa sacchikiriyāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo etassa assāsassa sacchikiriyāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etassa assāsassa sacchikiriyāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etassa assāsassa sacchikiriyāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Pañcamaṃ.",
      "english": "“‘Attained relief, attained relief’ – this is what is said, friend Sāriputta. To what extent, friend, is one said to have attained relief?” “When, friend, a bhikkhu understands as it really is the origin, the passing away, the gratification, the danger, and the escape in regard to the six bases of contact, to that extent, friend, is he said to have attained relief.” “Is there, friend, a path, a practice for the realization of this relief?” “There is, friend, a path, a practice for the realization of this relief.” “Which, friend, is that path, which is that practice for the realization of this relief?” “This, friend, is the Noble Eightfold Path for the realization of this relief, namely: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This, friend, is that path, this is that practice for the realization of this relief.” “This is an excellent path, friend, an excellent practice for the realization of this relief. And it is enough, friend Sāriputta, for earnest diligence.”",
      "sinhala": "‘‘‘සුවය ලැබූ තැනැත්තා, සුවය ලැබූ තැනැත්තා’යි ආයුෂ්මත් ශ්‍රාරිපුත්‍රයෙනි, කියනු ලැබේ. ආයුෂ්මත්ව, කිනම් අයුරකින් සුවය ලැබූ තැනැත්තෙක් වන්නේද?’’ ‘‘ආයුෂ්මත්ව, යම් කලෙක භික්ෂුවක් ෂඩ්පර්ශායතනවල හටගැනීමද, නැතිවීමද, ආස්වාදයද, ආදීනවයද, නිස්සරණයද යථාභූතව (ඇති සැටියෙන්) අවබෝධ කරන්නේද, ආයුෂ්මත්ව, ඒ තරමින් (එසේ අවබෝධ කිරීමෙන්) සුවය ලැබූ තැනැත්තෙක් වන්නේය.’’ ‘‘ආයුෂ්මත්ව, මේ සුවය සාක්ෂාත් කරගැනීම සඳහා මාර්ගයක් තිබේද? පිළිවෙතක් තිබේද?’’ ‘‘ආයුෂ්මත්ව, මේ සුවය සාක්ෂාත් කරගැනීම සඳහා මාර්ගයක් තිබේ. පිළිවෙතක් තිබේ.’’ ‘‘ආයුෂ්මත්ව, මේ සුවය සාක්ෂාත් කරගැනීම සඳහා කිනම් මාර්ගයද? කිනම් පිළිවෙතද?’’ ‘‘ආයුෂ්මත්ව, මේ සුවය සාක්ෂාත් කරගැනීම සඳහා මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේ. එනම්: සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යනුයි. ආයුෂ්මත්ව, මේ සුවය සාක්ෂාත් කරගැනීම සඳහා මේ මාර්ගයයි, මේ පිළිවෙතයි.’’ ‘‘ආයුෂ්මත්ව, මේ සුවය සාක්ෂාත් කරගැනීම සඳහා මේ මාර්ගය ඉතා යහපත්ය, මේ පිළිවෙත ඉතා යහපත්ය. ආයුෂ්මත් ශ්‍රාරිපුත්‍රයෙනි, මේ (දක්වන ලද කරුණු) අප්‍රමාදීව (වීර්යයෙන් යුතුව) කටයුතු කිරීමට ප්‍රමාණවත්ය!’’",
      "paliTitle": "Assāsappattasuttaṃ",
      "vagga": "",
      "englishTitle": "One Who Has Attained Relief Sutta",
      "sinhalaTitle": "අස්සාසප්පත්ත සූත්‍රය"
    },
    {
      "number": 319,
      "pali": "‘‘‘Paramassāsappatto, paramassāsappatto’ti, āvuso sāriputta, vuccati. Kittāvatā nu kho, āvuso, paramassāsappatto hotī’’ti? ‘‘Yato kho, āvuso, bhikkhu channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto hoti, ettāvatā kho, āvuso, paramassāsappatto hotī’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etassa paramassāsassa sacchikiriyāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etassa paramassāsassa sacchikiriyāyā’’ti. ‘‘Katamo pana, āvuso, maggo katamā paṭipadā, etassa paramassāsassa sacchikiriyāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo etassa paramassāsassa sacchikiriyāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etassa paramassāsassa sacchikiriyāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etassa paramassāsassa sacchikiriyāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Chaṭṭhaṃ.",
      "english": "\"The one who has attained ultimate solace, the one who has attained ultimate solace,\" so it is said, friend Sāriputta. To what extent, friend, is one said to have attained ultimate solace?\"\n\n\"When, friend, a monastic, having understood as it actually is the origin, cessation, gratification, danger, and escape regarding the six sense bases, is liberated without clinging, to that extent, friend, one is said to have attained ultimate solace.\"\n\n\"Is there, friend, a path, is there a practice for the realization of this ultimate solace?\"\n\n\"There is indeed, friend, a path, there is a practice for the realization of this ultimate solace.\"\n\n\"And what, friend, is that path, what is that practice for the realization of this ultimate solace?\"\n\n\"It is, friend, this Noble Eightfold Path for the realization of this ultimate solace, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, friend, is the path, this is the practice for the realization of this ultimate solace.\"\n\n\"Excellent, friend, is this path; excellent is this practice for the realization of this ultimate solace. And indeed, friend Sāriputta, it is sufficient for heedfulness.\"\n\nSixth.",
      "sinhala": "‘පරම සහනයට පත් වූ තැනැත්තා, පරම සහනයට පත් වූ තැනැත්තා’ යැයි, ආයුෂ්මත් ශාරිපුත්‍රයෙනි, කියනු ලැබේ. ආයුෂ්මතුනි, කවර පමණකින් නම් පරම සහනයට පත් වූවෙක් වේද? ආයුෂ්මතුනි, යම් හෙයකින් භික්ෂුව ෂඩ් ස්පර්ශායතන වල හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාභූතව දැනගෙන, උපාදාන රහිතව විමුක්ත වන්නේද, ආයුෂ්මතුනි, මෙපමණකින් පරම සහනයට පත් වූවෙක් වේ. ආයුෂ්මතුනි, ඒ පරම සහනය ප්‍රත්‍යක්ෂ කිරීම පිණිස මාර්ගයක් ඇත්තේද, පිළිවෙතක් ඇත්තේද? ආයුෂ්මතුනි, ඒ පරම සහනය ප්‍රත්‍යක්ෂ කිරීම පිණිස මාර්ගයක් ඇත, පිළිවෙතක් ඇත. එසේනම්, ආයුෂ්මතුනි, ඒ පරම සහනය ප්‍රත්‍යක්ෂ කිරීම පිණිස කවර මාර්ගයක්ද, කවර පිළිවෙතක්ද? ආයුෂ්මතුනි, මේ ආර්ය අෂ්ටාංගික මාර්ගයම ඒ පරම සහනය ප්‍රත්‍යක්ෂ කිරීම පිණිස වේ. එනම්: සම්මා දිට්ඨි (නිරවුල් දැක්ම), සම්මා සංකප්ප (නිරවුල් අදහස), සම්මා වාචා (නිරවුල් වචනය), සම්මා කම්මන්ත (නිරවුල් ක්‍රියාව), සම්මා ආජීව (නිරවුල් ජීවනෝපාය), සම්මා වායාම (නිරවුල් උත්සාහය), සම්මා සති (නිරවුල් සිහිය), සම්මා සමාධි (නිරවුල් සමාධිය) යි. ආයුෂ්මතුනි, මේ මාර්ගයයි, මේ පිළිවෙතයි, ඒ පරම සහනය ප්‍රත්‍යක්ෂ කිරීම පිණිස වේ. ආයුෂ්මතුනි, ඒ පරම සහනය ප්‍රත්‍යක්ෂ කිරීම පිණිස වූ මාර්ගය යහපත්ය, පිළිවෙත යහපත්ය. ආයුෂ්මත් ශාරිපුත්‍රයෙනි, මේ (ඔබගේ ධර්ම දේශනාව) අප්‍රමාදීව කටයුතු කිරීමට ප්‍රමාණවත්ය.",
      "paliTitle": "Paramassāsappattasuttaṃ",
      "vagga": "",
      "englishTitle": "Attaining the Supreme Solace Sutta",
      "sinhalaTitle": "පරමස්සාසප්පත්ත සූත්‍රය"
    },
    {
      "number": 320,
      "pali": "‘‘‘Vedanā, vedanā’ti, āvuso sāriputta, vuccati. Katamā nu kho, āvuso, vedanā’’ti? ‘‘Tisso imāvuso, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, āvuso, tisso vedanā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etāsaṃ tissannaṃ vedanānaṃ pariññāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etāsaṃ tissannaṃ vedanānaṃ pariññāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etāsaṃ tissannaṃ vedanānaṃ pariññāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etāsaṃ tissannaṃ vedanānaṃ pariññāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etāsaṃ tissannaṃ vedanānaṃ pariññāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etāsaṃ tissannaṃ vedanānaṃ pariññāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Sattamaṃ.",
      "english": "“Feeling, feeling” it is said, friend Sāriputta. But what, precisely, friend, is feeling? Friend, there are these three feelings. Which three? Pleasant feeling, painful feeling, and neither-pleasant-nor-painful feeling — these, friend, are the three feelings. But is there, friend, a path, is there a practice, for the complete comprehension of these three feelings? Indeed, friend, there is a path, there is a practice, for the complete comprehension of these three feelings. But what, friend, is that path, what is that practice, for the complete comprehension of these three feelings? It is precisely this Noble Eightfold Path, friend, for the complete comprehension of these three feelings, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, and Right Concentration. This, friend, is the path, this is the practice, for the complete comprehension of these three feelings. Excellent, friend, is this path, excellent is this practice, for the complete comprehension of these three feelings. And indeed, friend Sāriputta, this is sufficient for earnestness.",
      "sinhala": "ආයුෂ්මත් ශාරිපුත්‍රයන් වහන්ස, 'වේදනා, වේදනා' යැයි කියනු ලැබේ. ආයුෂ්මත්නි, වේදනාව යනු කවරේද?\n\nආයුෂ්මත්නි, මේ වේදනා තුනකි. කවරේද ඒ තුන? සැප වේදනාව, දුක් වේදනාව, දුක්‌ නොවන සැප‌ නොවන වේදනාව – ආයුෂ්මත්නි, මේ වේදනා තුනයි.\n\nආයුෂ්මත්නි, එසේ නම්, මේ වේදනා තුන පිරිසිඳ දැනගැනීම සඳහා මාර්ගයක් තිබේද? ප්‍ර​තිපදාවක් තිබේද?\n\nආයුෂ්මත්නි, ඇත්තෙන්ම මේ වේදනා තුන පිරිසිඳ දැනගැනීම සඳහා මාර්ගයක් ඇත, ප්‍ර​තිපදාවක් ඇත.\n\nආයුෂ්මත්නි, එසේ නම්, මේ වේදනා තුන පිරිසිඳ දැනගැනීම සඳහා කවර මාර්ගයක්ද? කවර ප්‍ර​තිපදාවක්ද?\n\nආයුෂ්මත්නි, මේ වේදනා තුන පිරිසිඳ දැනගැනීම සඳහා ආර්ය අෂ්ටාංගික මාර්ගයම වේ. එනම්: නිවැරදි දැක්ම, නිවැරදි අරමුණ, නිවැරදි වචනය, නිවැරදි ක්‍රියාව, නිවැරදි ජීවනෝපාය, නිවැරදි වෑයම, නිවැරදි සිහිය, නිවැරදි සමාධිය යනුයි. ආයුෂ්මත්නි, මේ වේදනා තුන පිරිසිඳ දැනගැනීම සඳහා මාර්ගය මෙයයි, ප්‍ර​තිපදාව මෙයයි.\n\nආයුෂ්මත්නි, මේ වේදනා තුන පිරිසිඳ දැනගැනීම සඳහා මේ මාර්ගය යහපත්ය, මේ ප්‍ර​තිපදාව යහපත්ය. ආයුෂ්මත් ශාරිපුත්‍රයන් වහන්ස, මේ දහම් දේශනාව අප්‍ර​මාදයට ප්‍ර​මාණවත් වේ.",
      "paliTitle": "Vedanāpañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Questions about Feeling",
      "sinhalaTitle": "වේදනාපඤ්හා සූත්‍රය"
    },
    {
      "number": 321,
      "pali": "‘‘‘Āsavo, āsavo’ti, āvuso sāriputta, vuccati. Katamo nu kho, āvuso, āsavo’’ti? ‘‘Tayo me, āvuso, āsavā. Kāmāsavo, bhavāsavo, avijjāsavo – ime kho, āvuso, tayo āsavā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā etesaṃ āsavānaṃ pahānāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā etesaṃ āsavānaṃ pahānāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā etesaṃ āsavānaṃ pahānāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo etesaṃ āsavānaṃ pahānāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etesaṃ āsavānaṃ pahānāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etesaṃ āsavānaṃ pahānāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Aṭṭhamaṃ.",
      "english": "“Friend Sāriputta, it is said, ‘Influx, influx.’ But what, friend, is an influx?”\n\n“Friend, there are these three influxes: the influx of sensual desire, the influx of becoming, and the influx of ignorance – these, friend, are the three influxes.”\n\n“But, friend, is there a path, is there a practice for the abandoning of these influxes?”\n\n“Indeed, friend, there is a path, there is a practice for the abandoning of these influxes.”\n\n“But what, friend, is that path, what is that practice for the abandoning of these influxes?”\n\n“It is this Noble Eightfold Path, friend, for the abandoning of these influxes, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, friend, is the path, this is the practice for the abandoning of these influxes.”\n\n“Excellent, friend, is this path, excellent is this practice for the abandoning of these influxes. And, friend Sāriputta, this is sufficient for heedfulness.”",
      "sinhala": "\"ආයුෂ්මත් ශාරිපුත්ත, 'ආශ්‍රව, ආශ්‍රව' යැයි කියනු ලැබේ. ආයුෂ්මත්, ආශ්‍රව යනු කුමක්ද?\"\n\n\"ආයුෂ්මත්, මේ ආශ්‍රව තුනකි. එනම්: කාමාශ්‍රවය, භවාශ්‍රවය, අවිද්‍යාශ්‍රවයයි. ආයුෂ්මත්, මේවාය තුන් ආශ්‍රවයෝ වෙති.\"\n\n\"ආයුෂ්මත්, එසේ නම් මේ ආශ්‍රවයන් ප්‍රහාණය කිරීම සඳහා මාර්ගයක් තිබේද? ප්‍රතිපදාවක් තිබේද?\"\n\n\"ආයුෂ්මත්, මේ ආශ්‍රවයන් ප්‍රහාණය කිරීම සඳහා මාර්ගයක් තිබේ. ප්‍රතිපදාවක්ද තිබේ.\"\n\n\"ආයුෂ්මත්, එසේ නම් මේ ආශ්‍රවයන් ප්‍රහාණය කිරීම සඳහා මාර්ගය කුමක්ද? ප්‍රතිපදාව කුමක්ද?\"\n\n\"ආයුෂ්මත්, මේ ආශ්‍රවයන් ප්‍රහාණය කිරීම සඳහා ඇත්තේ මේ ආර්ය අෂ්ටාංගික මාර්ගයයි. එනම්: සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධියයි. ආයුෂ්මත්, මේ ආශ්‍රවයන් ප්‍රහාණය කිරීම සඳහා ඇත්තේ මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි.\"\n\n\"ආයුෂ්මත්, මේ ආශ්‍රවයන් ප්‍රහාණය කිරීම සඳහා අතිශයින් යහපත් මාර්ගයකි, අතිශයින් යහපත් ප්‍රතිපදාවකි. ආයුෂ්මත් ශාරිපුත්ත, අප්‍රමාදව සිටීමට මෙය ප්‍රමාණවත්ය.\"",
      "paliTitle": "Āsavapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Questions about Taints",
      "sinhalaTitle": "ආසවපඤ්හා සූත්‍රය"
    },
    {
      "number": 322,
      "pali": "‘‘‘Avijjā, avijjā’ti, āvuso sāriputta, vuccati. Katamā nu kho, āvuso, avijjā’’ti? ‘‘Yaṃ kho, āvuso, dukkhe aññāṇaṃ, dukkhasamudaye aññāṇaṃ, dukkhanirodhe aññāṇaṃ, dukkhanirodhagāminiyā paṭipadāya aññāṇaṃ – ayaṃ vuccatāvuso, avijjā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etissā avijjāya pahānāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etissā avijjāya pahānāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etissā avijjāya pahānāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etissā avijjāya pahānāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etissā avijjāya pahānāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etissā avijjāya pahānāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Navamaṃ.",
      "english": "\"Ignorance, ignorance,\" is said, friend Sāriputta. But what, friend, is ignorance? That which, friend, is not knowing suffering, not knowing the origin of suffering, not knowing the cessation of suffering, not knowing the path leading to the cessation of suffering – this, friend, is called ignorance.\n\nBut is there, friend, a path, a practice, for the abandoning of this ignorance? Indeed, friend, there is a path, there is a practice, for the abandoning of this ignorance. But what, friend, is that path, what is that practice, for the abandoning of this ignorance? This Noble Eightfold Path itself, friend, is for the abandoning of this ignorance, namely: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This, friend, is the path; this is the practice, for the abandoning of this ignorance.\n\nExcellent, friend, is this path; excellent is this practice for the abandoning of this ignorance. And it is enough, friend Sāriputta, for earnestness.",
      "sinhala": "\"අවිද්‍යාව, අවිද්‍යාව\" යැයි ආයුෂ්මත් ශාරිපුත්‍රයන් වහන්සේට කියනු ලැබේ. ආයුෂ්මත්නි, අවිද්‍යාව යනු කවරේද?\nආයුෂ්මත්නි, දුකෙහි ඇති අවබෝධයක් නැතිකම, දුක හටගැනීමෙහි ඇති අවබෝධයක් නැතිකම, දුක නැති කිරීමෙහි ඇති අවබෝධයක් නැතිකම, දුක නැති කිරීමේ මාර්ගයෙහි ඇති අවබෝධයක් නැතිකම – ආයුෂ්මත්නි, මේ අවිද්‍යාව යැයි කියනු ලැබේ.\nආයුෂ්මත්නි, මේ අවිද්‍යාව ප්‍රහීණ කිරීම පිණිස මාර්ගයක් තිබේද, පිළිවෙතක් තිබේද?\nආයුෂ්මත්නි, මේ අවිද්‍යාව ප්‍රහීණ කිරීම පිණිස මාර්ගයක් ඇත, පිළිවෙතක් ඇත.\nආයුෂ්මත්නි, මේ අවිද්‍යාව ප්‍රහීණ කිරීම පිණිස කවර මාර්ගයක්ද, කවර පිළිවෙතක්ද?\nආයුෂ්මත්නි, මේ අවිද්‍යාව ප්‍රහීණ කිරීම පිණිස මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේ. එනම්: සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යනුයි. ආයුෂ්මත්නි, අවිද්‍යාව ප්‍රහීණ කිරීම පිණිස මේ මාර්ගයයි, මේ පිළිවෙතයි.\nආයුෂ්මත්නි, මේ අවිද්‍යාව ප්‍රහීණ කිරීම පිණිස මේ මාර්ගය ඉතා යහපත්ය, මේ පිළිවෙත ඉතා යහපත්ය. ආයුෂ්මත් ශාරිපුත්‍රයෙනි, අප්‍රමාදයට මෙය සෑහේ.",
      "paliTitle": "Avijjāpañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Questions on Ignorance Sutta",
      "sinhalaTitle": "අවිජ්ජා පඤ්හ සූත්‍රය"
    },
    {
      "number": 323,
      "pali": "‘‘‘Taṇhā, taṇhā’ti, āvuso sāriputta, vuccati. Katamā nu kho, āvuso, taṇhā’’ti? ‘‘Tisso imā, āvuso, taṇhā. Kāmataṇhā, bhavataṇhā, vibhavataṇhā – imā kho, āvuso, tisso taṇhā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etāsaṃ taṇhānaṃ pahānāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etāsaṃ taṇhānaṃ pahānāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etāsaṃ taṇhānaṃ pahānāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etāsaṃ taṇhānaṃ pahānāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etāsaṃ taṇhānaṃ pahānāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etāsaṃ taṇhānaṃ pahānāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Dasamaṃ.",
      "english": "“‘Craving, craving’ is spoken of, friend Sāriputta. But what, friend, is craving?” “There are these three cravings, friend: craving for sensual pleasures, craving for existence, and craving for non-existence. These, friend, are the three cravings.” “But is there, friend, a path, is there a practice for the abandonment of these cravings?” “Indeed, friend, there is a path, there is a practice for the abandonment of these cravings.” “But what, friend, is that path, what is that practice for the abandonment of these cravings?” “It is, friend, precisely this Noble Eightfold Path for the abandonment of these cravings, that is to say: right understanding, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This, friend, is the path, this is the practice for the abandonment of these cravings.” “Excellent, friend, is this path; excellent is this practice for the abandonment of these cravings. And it is indeed sufficient, friend Sāriputta, for heedfulness.”",
      "sinhala": "‘තණ්හා, තණ්හා’ යැයි ආයුෂ්මත් ශාරිපුත්‍රයෙනි, කියනු ලැබේ. ආයුෂ්මත්නි, තණ්හාව යනු කුමක්ද?\n\nආයුෂ්මත්නි, මේ තණ්හා තුනකි. එනම්, කාම තණ්හාව, භව තණ්හාව, විභව තණ්හාව යනුයි. ආයුෂ්මත්නි, මේවා තණ්හා තුනයි.\n\nආයුෂ්මත්නි, මේ තණ්හා ප්‍රහාණය කිරීම පිණිස මාර්ගයක් තිබේද, ප්‍රතිපදාවක් තිබේද?\n\nආයුෂ්මත්නි, මේ තණ්හා ප්‍රහාණය කිරීම පිණිස මාර්ගයක් ඇත, ප්‍රතිපදාවක් ඇත.\n\nආයුෂ්මත්නි, මේ තණ්හා ප්‍රහාණය කිරීම පිණිස කුමක්ද ඒ මාර්ගය, කුමක්ද ඒ ප්‍රතිපදාව?\n\nආයුෂ්මත්නි, මේ තණ්හා ප්‍රහාණය කිරීම පිණිස, එනම් සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධිය යන මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේ. ආයුෂ්මත්නි, මේ තණ්හා ප්‍රහාණය කිරීම පිණිස මේමයි ඒ මාර්ගය, මේමයි ඒ ප්‍රතිපදාව.\n\nආයුෂ්මත්නි, මේ තණ්හා ප්‍රහාණය කිරීම පිණිස මේ මාර්ගය යහපත්ය, මේ ප්‍රතිපදාව යහපත්ය. ආයුෂ්මත් ශාරිපුත්‍රයෙනි, අප්‍රමාදයට මෙය සෑහේ.",
      "paliTitle": "Taṇhāpañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Questions about Craving",
      "sinhalaTitle": "තණ්හාපඤ්හා සූත්‍රය"
    },
    {
      "number": 324,
      "pali": "‘‘‘Ogho, ogho’ti, āvuso sāriputta, vuccati. Katamo nu kho, āvuso, ogho’’ti? ‘‘Cattārome, āvuso, oghā. Kāmogho, bhavogho, diṭṭhogho, avijjogho – ime kho, āvuso, cattāro oghā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etesaṃ oghānaṃ pahānāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etesaṃ oghānaṃ pahānāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etesaṃ oghānaṃ pahānāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etesaṃ oghānaṃ pahānāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etesaṃ oghānaṃ pahānāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etesaṃ oghānaṃ pahānāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Ekādasamaṃ.",
      "english": "“Friend Sāriputta, it is said, ‘A flood, a flood!’ But what, friend, is this flood?” “Friend, there are these four floods: the flood of sensual desire, the flood of existence, the flood of views, and the flood of ignorance. These, friend, are the four floods.” “But friend, is there a path, is there a way of practice, for the abandonment of these floods?” “Indeed, friend, there is a path, there is a way of practice, for the abandonment of these floods.” “But what, friend, is this path, what is this way of practice, for the abandonment of these floods?” “Friend, it is precisely this Noble Eightfold Path for the abandonment of these floods, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, and Right Concentration. This, friend, is the path, this is the way of practice, for the abandonment of these floods.” “Excellent, friend, is this path! Excellent is this way of practice for the abandonment of these floods. And it is indeed sufficient, friend Sāriputta, for diligence.”",
      "sinhala": "‘ඕඝය, ඕඝය’ යැයි ආයුෂ්මත් සාරිපුත්ත, කියනු ලැබේ. ආයුෂ්මතුනි, ඕඝය යනු කුමක්ද? ආයුෂ්මතුනි, මේ ඕඝ සතරක් ඇත. කාම ඕඝය, භව ඕඝය, දිට්ඨි ඕඝය, අවිජ්ජා ඕඝය – ආයුෂ්මතුනි, මේවා ඕඝ සතරයි. ආයුෂ්මතුනි, මේ ඕඝයන් ප්‍ර​හාණය කිරීමට මාර්ගයක් තිබේද? ප්‍රතිපදාවක් තිබේද? ආයුෂ්මතුනි, මේ ඕඝයන් ප්‍ර​හාණය කිරීමට මාර්ගයක් තිබේ, ප්‍රතිපදාවක් තිබේ. ආයුෂ්මතුනි, මේ ඕඝයන් ප්‍ර​හාණය කිරීම සඳහා ඇති මාර්ගය කුමක්ද? ප්‍රතිපදාව කුමක්ද? ආයුෂ්මතුනි, මේ ඕඝයන් ප්‍ර​හාණය කිරීම සඳහා මේ ආර්ය අෂ්ටාංගික මාර්ගයමයි. එනම්: සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචා, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධියයි. ආයුෂ්මතුනි, මේ ඕඝයන් ප්‍ර​හාණය කිරීම සඳහා මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි. ආයුෂ්මතුනි, මේ ඕඝයන් ප්‍ර​හාණය කිරීම සඳහා මේ මාර්ගය යහපත්ය, මේ ප්‍රතිපදාව යහපත්ය. ආයුෂ්මත් සාරිපුත්ත, අප්‍රමාදයෙන් යුතුව කටයුතු කිරීමට මෙය ප්‍ර​මාණවත් වේ.",
      "paliTitle": "Oghapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Questions on the Floods Sutta",
      "sinhalaTitle": "ඕඝපඤ්හා සූත්‍රය"
    },
    {
      "number": 325,
      "pali": "‘‘‘Upādānaṃ, upādāna’nti, āvuso sāriputta, vuccati. Katamaṃ nu kho, āvuso, upādāna’’nti? ‘‘Cattārimāni, āvuso, upādānāni. Kāmupādānaṃ, diṭṭhupādānaṃ sīlabbatupādānaṃ, attavādupādānaṃ – imāni kho, āvuso, cattāri upādānānī’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etesaṃ upādānānaṃ pahānāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etesaṃ upādānānaṃ pahānāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etesaṃ upādānānaṃ pahānāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etesaṃ upādānānaṃ pahānāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etesaṃ upādānānaṃ pahānāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etesaṃ upādānānaṃ pahānāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Dvādasamaṃ.",
      "english": "“Clinging, clinging,” friend Sāriputta, it is said. But what, friend, is clinging? “Friend, there are these four kinds of clinging: clinging to sensual pleasures, clinging to views, clinging to rites and rituals, and clinging to a doctrine of self. These, friend, are the four kinds of clinging.” “But, friend, is there a path, is there a way of practice for the abandonment of these clingings?” “Indeed, friend, there is a path, there is a way of practice for the abandonment of these clingings.” “But which, friend, is that path, which is that way of practice for the abandonment of these clingings?” “It is, friend, this Noble Eightfold Path for the abandonment of these clingings, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, and Right Concentration. This, friend, is that path, this is that way of practice for the abandonment of these clingings.” “Excellent, friend, is this path; excellent is this way of practice for the abandonment of these clingings. And sufficient, friend Sāriputta, is it for heedfulness.”",
      "sinhala": "‘‘ආයුෂ්මත් ශාරිපුත්තයෙනි, ‘උපාදානය, උපාදානය’ යැයි කියනු ලැබේ. ආයුෂ්මතුනි, උපාදානය යනු කවරේද?’’ ‘‘ආයුෂ්මතුනි, මේ උපාදාන සතරක් ඇත. එනම්: කාම උපාදානය, දිට්ඨි උපාදානය, සීලබ්බත උපාදානය, අත්තවාද උපාදානය – ආයුෂ්මතුනි, මේවා උපාදාන සතරයි.’’ ‘‘ආයුෂ්මතුනි, මේ උපාදානයන් ප්‍රහාණය කිරීම සඳහා මාර්ගයක්, ප්‍රතිපදාවක් තිබේද?’’ ‘‘ආයුෂ්මතුනි, මේ උපාදානයන් ප්‍රහාණය කිරීම සඳහා මාර්ගයක්, ප්‍රතිපදාවක් ඇත.’’ ‘‘ආයුෂ්මතුනි, මේ උපාදානයන් ප්‍රහාණය කිරීම සඳහා මාර්ගය කවරේද, ප්‍රතිපදාව කවරේද?’’ ‘‘ආයුෂ්මතුනි, මේ උපාදානයන් ප්‍රහාණය කිරීම සඳහා ආර්ය අෂ්ටාංගික මාර්ගයමයි. එනම්: සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධියයි. ආයුෂ්මතුනි, මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි, මේ උපාදානයන් ප්‍රහාණය කිරීම සඳහා.’’ ‘‘ආයුෂ්මතුනි, මේ උපාදානයන් ප්‍රහාණය කිරීම සඳහා මේ මාර්ගය යහපත්ය, මේ ප්‍රතිපදාව යහපත්ය. ආයුෂ්මත් ශාරිපුත්තයෙනි, මේ (මාර්ගය) අප්‍රමාදීව කටයුතු කිරීමට ප්‍රමාණවත්ය.’’ දොළොස්වැන්නයි.",
      "paliTitle": "Upādānapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Questions about Grasping",
      "sinhalaTitle": "උපාදානපඤ්හා සූත්‍රය"
    },
    {
      "number": 326,
      "pali": "‘‘‘Bhavo, bhavo’ti, āvuso sāriputta, vuccati. Katamo nu kho, āvuso, bhavo’’ti? ‘‘Tayo me, āvuso, bhavā. Kāmabhavo, rūpabhavo, arūpabhavo – ime kho, āvuso, tayo bhavā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etesaṃ bhavānaṃ pariññāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etesaṃ bhavānaṃ pariññāyā’’ti. ‘‘Katamo, panāvuso, maggo katamā paṭipadā, etesaṃ bhavānaṃ pariññāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etesaṃ bhavānaṃ pariññāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etesaṃ bhavānaṃ pariññāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etesaṃ bhavānaṃ pariññāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Terasamaṃ.",
      "english": "\"Becoming, becoming,\" friend Sāriputta, it is said. But what, friend, is this becoming? \"There are these three modes of becoming, friend: sense-sphere becoming, fine-material becoming, and immaterial becoming. These, friend, are the three modes of becoming.\" \"Is there, friend, a path, is there a way of practice, for the full comprehension of these modes of becoming?\" \"Indeed, friend, there is a path, there is a way of practice, for the full comprehension of these modes of becoming.\" \"But what, friend, is that path, what is that way of practice, for the full comprehension of these modes of becoming?\" \"It is precisely this Noble Eightfold Path, friend, for the full comprehension of these modes of becoming, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, friend, is the path; this is the way of practice for the full comprehension of these modes of becoming.\" \"Excellent, friend, is this path; excellent is this way of practice for the full comprehension of these modes of becoming. And this, friend Sāriputta, is indeed sufficient for the cultivation of heedfulness.\"",
      "sinhala": "‘භවය, භවය’ යැයි, ඇවැත්නි සාරිපුත්ත, කියනු ලැබේ. ඇවැත්නි, භවය යනු කුමක්ද?\n\nඇවැත්නි, භවයන් තුනක් ඇත. කාමභවය, රූපභවය, අරූපභවය – ඇවැත්නි, මේ භවයෝ තුන වෙති.\n\nඇවැත්නි, මේ භවයන් පිරිසිඳ දැනීම පිණිස මාර්ගයක්, ප්‍රතිපදාවක් තිබේද?\n\nඇවැත්නි, මේ භවයන් පිරිසිඳ දැනීම පිණිස මාර්ගයක්, ප්‍රතිපදාවක් ඇත.\n\nඇවැත්නි, මේ භවයන් පිරිසිඳ දැනීම පිණිස කවර මාර්ගයක්ද, කවර ප්‍රතිපදාවක්ද?\n\nඇවැත්නි, මේ භවයන් පිරිසිඳ දැනීම පිණිස ආර්ය අෂ්ටාංගික මාර්ගය මෙයමයි. එනම්: සම්මාදිට්ඨි, සම්මාසංකප්ප, සම්මාවාචා, සම්මාකම්මන්ත, සම්මාආජීව, සම්මාවායාම, සම්මාසති, සම්මාසමාධි යනුයි. ඇවැත්නි, මේ භවයන් පිරිසිඳ දැනීම පිණිස මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි.\n\nඇවැත්නි, මේ භවයන් පිරිසිඳ දැනීම පිණිස මාර්ගය යහපත්ය, ප්‍රතිපදාව යහපත්ය. ඇවැත්නි සාරිපුත්ත, අප්‍රමාදය පිණිස මෙය ප්‍රමාණවත්ය.",
      "paliTitle": "Bhavapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Questions on Existence Sutta",
      "sinhalaTitle": "භව පඤ්හ සූත්‍රය"
    },
    {
      "number": 327,
      "pali": "‘‘‘Dukkhaṃ, dukkha’nti, āvuso sāriputta, vuccati. Katamaṃ nu kho, āvuso, dukkha’’nti? ‘‘Tisso imā, āvuso, dukkhatā. Dukkhadukkhatā, saṅkhāradukkhatā, vipariṇāmadukkhatā – imā kho, āvuso, tisso dukkhatā’’ti. ‘‘Atthi panāvuso maggo atthi paṭipadā, etāsaṃ dukkhatānaṃ pariññāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etāsaṃ dukkhatānaṃ pariññāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etāsaṃ dukkhatānaṃ pariññāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etāsaṃ dukkhatānaṃ pariññāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etāsaṃ dukkhatānaṃ pariññāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etāsaṃ dukkhatānaṃ pariññāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Cuddasamaṃ.",
      "english": "“’Suffering, suffering!’ it is said, friend Sāriputta. But what, friend, is suffering?”\n\n“Friend, there are these three kinds of suffering: the suffering inherent in pain, the suffering inherent in formations, and the suffering inherent in change. These, friend, are the three kinds of suffering.”\n\n“But is there, friend, a path, a way of practice for the full understanding of these kinds of suffering?”\n\n“Indeed, friend, there is a path, there is a way of practice for the full understanding of these kinds of suffering.”\n\n“But what, friend, is that path, what is that way of practice for the full understanding of these kinds of suffering?”\n\n“Friend, it is precisely this Noble Eightfold Path for the full understanding of these kinds of suffering, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, and Right Concentration. This, friend, is the path, this is the way of practice for the full understanding of these kinds of suffering.”\n\n“Excellent, friend, is this path! Excellent is this way of practice for the full understanding of these kinds of suffering! And truly, friend Sāriputta, this is sufficient to arouse diligence!”",
      "sinhala": "‘දුක, දුක’ යැයි ආයුෂ්මත් සාරිපුත්තයෙනි, කියනු ලැබේ. ආයුෂ්මත්නි, දුක නම් කුමක්ද?\n\nආයුෂ්මත්නි, මේ දුක්ඛතා තුනකි. එනම්: දුක්ඛදුක්ඛතාය, සංඛාරදුක්ඛතාය, විපරිණාමදුක්ඛතාය යි. ආයුෂ්මත්නි, මේ දුක්ඛතා තුනයි.\n\nආයුෂ්මත්නි, මේ දුක්ඛතා අවබෝධ කිරීම පිණිස මාර්‍ගයක් තිබේද? පිළිවෙතක් තිබේද?\n\nආයුෂ්මත්නි, මේ දුක්ඛතා අවබෝධ කිරීම පිණිස මාර්‍ගයක් ඇත, පිළිවෙතක් ඇත.\n\nආයුෂ්මත්නි, මේ දුක්ඛතා අවබෝධ කිරීම පිණිස මාර්‍ගය කුමක්ද? පිළිවෙත කුමක්ද?\n\nආයුෂ්මත්නි, මේ දුක්ඛතා අවබෝධ කිරීම පිණිස මේ ආර්‍ය අෂ‍්ටාංගික මාර්‍ගයම වේ. එනම්: සම්මාදිට්ඨිය, සම්මාසංකප්පය, සම්මාවාචාව, සම්මාකම්මන්තය, සම්මාආජීවය, සම්මාවායාමය, සම්මාසතිය, සම්මාසමාධිය යි. ආයුෂ්මත්නි, මේ දුක්ඛතා අවබෝධ කිරීම පිණිස මේ මාර්‍ගයයි, මේ පිළිවෙතයි.\n\nආයුෂ්මත්නි, මේ දුක්ඛතා අවබෝධ කිරීම පිණිස මේ මාර්‍ගය යහපත්ය, මේ පිළිවෙත යහපත්ය. ආයුෂ්මත් සාරිපුත්තයෙනි, අප‍්‍රමාදීව කටයුතු කිරීමටද මෙය ප‍්‍රමාණවත්ය.",
      "paliTitle": "Dukkhapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Questions About Suffering",
      "sinhalaTitle": "දුක්ඛපඤ්හා සූත්‍රය"
    },
    {
      "number": 328,
      "pali": "‘‘‘Sakkāyo, sakkāyo’ti, āvuso sāriputta, vuccati. Katamo nu kho, āvuso, sakkāyo’’ti? ‘‘Pañcime, āvuso, upādānakkhandhā sakkāyo vutto bhagavatā, seyyathidaṃ – rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ime kho, āvuso, pañcupādānakkhandhā sakkāyo vutto bhagavatā’’ti. ‘‘Atthi panāvuso, maggo atthi paṭipadā, etassa sakkāyassa pariññāyā’’ti? ‘‘Atthi kho, āvuso, maggo atthi paṭipadā, etassa sakkāyassa pariññāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā, etassa sakkāyassa pariññāyā’’ti? ‘‘Ayameva kho, āvuso, ariyo aṭṭhaṅgiko maggo, etassa sakkāyassa pariññāya, seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā, etassa sakkāyassa pariññāyā’’ti. ‘‘Bhaddako, āvuso, maggo bhaddikā paṭipadā, etassa sakkāyassa pariññāya. Alañca panāvuso sāriputta, appamādāyā’’ti. Pannarasamaṃ.",
      "english": "\"Self-identification is spoken of, self-identification,\" friend Sāriputta. \"What, friend, is self-identification?\" \"Friend, the Blessed One has declared that these five clinging-aggregates constitute self-identification: namely, the clinging-aggregate of form, the clinging-aggregate of feeling, the clinging-aggregate of perception, the clinging-aggregate of mental formations, and the clinging-aggregate of consciousness. Indeed, friend, these five clinging-aggregates have been declared by the Blessed One to constitute self-identification.\" \"But, friend, is there a path, is there a way, for the full understanding of this self-identification?\" \"Indeed, friend, there is a path, there is a way, for the full understanding of this self-identification.\" \"What then, friend, is this path, what is this way, for the full understanding of this self-identification?\" \"This, friend, is precisely the Noble Eightfold Path for the full understanding of this self-identification: namely, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. This, friend, is the path, this is the way, for the full understanding of this self-identification.\" \"Excellent, friend, is this path, excellent is this way, for the full understanding of this self-identification. And it is indeed sufficient, friend Sāriputta, for earnestness.\"",
      "sinhala": "‘සක්කාය, සක්කාය’ යැයි ආයුෂ්මත් ශාරිපුත්‍රයෙනි, කියනු ලැබේ. ආයුෂ්මත්නි, සක්කාය යනු කුමක්ද?\n\nආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ විසින් සක්කාය යැයි වදාළේ මේ පංච උපාදානස්කන්ධයෝය. එනම්, රූප උපාදානස්කන්ධය, වේදනා උපාදානස්කන්ධය, සංඥා උපාදානස්කන්ධය, සංස්කාර උපාදානස්කන්ධය, විඤ්ඤාණ උපාදානස්කන්ධය යි. ආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ විසින් සක්කාය යැයි වදාළේ මේ පංච උපාදානස්කන්ධයෝමයි.\n\nආයුෂ්මත්නි, මේ සක්කාය පිරිසිඳ දැනගැනීම සඳහා මාර්ගයක්, පිළිවෙතක් තිබේද?\n\nආයුෂ්මත්නි, සක්කාය පිරිසිඳ දැනගැනීම සඳහා මාර්ගයක්, පිළිවෙතක් තිබේ.\n\nආයුෂ්මත්නි, මේ සක්කාය පිරිසිඳ දැනගැනීම සඳහා වන මාර්ගය කුමක්ද? පිළිවෙත කුමක්ද?\n\nආයුෂ්මත්නි, සක්කාය පිරිසිඳ දැනගැනීම සඳහා මේ ආර්ය අෂ්ටාංගික මාර්ගයයි. එනම්: සම්මා දිට්ඨි, සම්මා සංකල්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යනුයි. ආයුෂ්මත්නි, සක්කාය පිරිසිඳ දැනගැනීම සඳහා මේ මාර්ගයයි, මේ පිළිවෙතයි.\n\nආයුෂ්මත්නි, සක්කාය පිරිසිඳ දැනගැනීම සඳහා මේ මාර්ගය උතුම්ය, මේ පිළිවෙත උතුම්ය. ආයුෂ්මත් ශාරිපුත්‍රයෙනි, අප්‍රමාදීව කටයුතු කිරීමට මෙය ප්‍රමාණවත්ය.",
      "paliTitle": "Sakkāyapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Questions on Identity",
      "sinhalaTitle": "සක්කායපඤ්හා සූත්‍රය"
    },
    {
      "number": 329,
      "pali": "‘‘Kiṃ nu kho, āvuso sāriputta, imasmiṃ dhammavinaye dukkara’’nti? ‘‘Pabbajjā kho, āvuso, imasmiṃ dhammavinaye dukkarā’’ti. ‘‘Pabbajitena panāvuso, kiṃ dukkara’’nti? ‘‘Pabbajitena kho, āvuso, abhirati dukkarā’’ti. ‘‘Abhiratena panāvuso, kiṃ dukkara’’nti? ‘‘Abhiratena kho, āvuso, dhammānudhammappaṭipatti dukkarā’’ti. ‘‘Kīvaciraṃ panāvuso, dhammānudhammappaṭipanno bhikkhu arahaṃ assā’’ti? ‘‘Naciraṃ, āvuso’’ti. Soḷasamaṃ. ",
      "english": "\"What indeed, friend Sāriputta, is difficult in this teaching and discipline?\"\n\"Ordination, friend, is difficult in this teaching and discipline.\"\n\"But for one who has gone forth, friend, what is difficult?\"\n\"For one who has gone forth, friend, finding delight in the holy life is difficult.\"\n\"But for one who finds delight, friend, what is difficult?\"\n\"For one who finds delight, friend, practicing in accordance with the Dhamma and its sub-principles is difficult.\"\n\"But how long, friend, would a monk who practices in accordance with the Dhamma and its sub-principles become an Arahant?\"\n\"Not long, friend.\"",
      "sinhala": "ආයුෂ්මත් ශාරිපුත්තයෙනි, මේ ධර්‍මවිනයෙහි දුෂ්කර දෙය කුමක්ද? ආයුෂ්මතිය, මේ ධර්‍මවිනයෙහි පැවිදිවීම දුෂ්කරය. එසේ පැවිදි වූ කෙනකුට ආයුෂ්මතිය, දුෂ්කර දෙය කුමක්ද? ආයුෂ්මතිය, පැවිදි වූ කෙනකුට සතුටින් වාසය කිරීම දුෂ්කරය. එසේ සතුටින් වාසය කරන්නාහට ආයුෂ්මතිය, දුෂ්කර දෙය කුමක්ද? ආයුෂ්මතිය, සතුටින් වාසය කරන්නාහට ධර්‍මයට අනුකූලව ධර්‍මය පිළිපැදීම දුෂ්කරය. ආයුෂ්මතිය, ධර්‍මයට අනුකූලව ධර්‍මය පිළිපදින භික්ෂුවක් කොපමණ කල් පසුව අරහත් වේද? ආයුෂ්මතිය, වැඩි කලක් ගත නොවේ. දහසයවෙනි.",
      "paliTitle": "Dukkarapañhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Questions on What is Hard to Do Sutta",
      "sinhalaTitle": "දුක්කරපඤ්හ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Jambukhādakasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Nibbānaṃ arahattañca, dhammavādī kimatthiyaṃ; Assāso paramassāso, vedanā āsavāvijjā; Taṇhā oghā upādānaṃ, bhavo dukkhañca sakkāyo. Imasmiṃ dhammavinaye dukkaranti.",
    "english": "The Linked Discourses with Jambukhādaka is complete. The summary of it: Nibbāna, Arahantship, Proclaimer of Dhamma, For what purpose; Solace, Supreme Solace, Feeling, Defilements, Ignorance; Craving, Floods, Grasping, Existence, Suffering, and Identity; and What is difficult in this Dhamma and Discipline.",
    "sinhala": "ජම්බුඛාදක සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: නිබ්බාන, අරහත්ත, ධම්මවාදී, කිමත්ථිය, අස්සාස, පරමස්සාස, වේදනා, ආසව, අවිජ්ජා, තණ්හා, ඕඝ, උපාදාන, භව, දුක්ඛ, සක්කාය සහ දුක්කර යන සූත්‍රයි."
  }
}