{
  "id": "sn.4.2",
  "title": {
    "pali": "Vedanāsaṃyuttaṃ",
    "english": "The Connected Discourses on Feeling",
    "sinhala": "වේදනා සංයුත්තය"
  },
  "sections": [
    {
      "number": 249,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, bhikkhave, tisso vedanāti. ‘‘Samāhito sampajāno, sato buddhassa sāvako; Vedanā ca pajānāti, vedanānañca sambhavaṃ. ‘‘Yattha cetā nirujjhanti, maggañca khayagāminaṃ; Vedanānaṃ khayā bhikkhu, nicchāto parinibbuto’’ti. paṭhamaṃ;",
      "english": "Bhikkhus, these are three feelings. Which three? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling – these, bhikkhus, are indeed the three feelings. A disciple of the Buddha, concentrated, clearly comprehending, and mindful, understands feelings and their origin. He understands where these feelings cease, and the path leading to their cessation. Through the cessation of feelings, a bhikkhu, freed from craving, attains complete liberation.",
      "sinhala": "මහණෙනි, මේ වේදනා තුනකි. කවරහුද ඒ තුන? සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව යන මේවාය, මහණෙනි, වේදනා තුන.\n\nසමාහිතව, සම්පජානුව, සිහි නුවණින් යුක්තව සිටින බුදුරජාණන් වහන්සේගේ ශ්‍රාවකයා වේදනාද මනාව දනියි, වේදනාවන්ගේ හටගැනීමද දනියි.\n\nමේවා නිරුද්ධ වන තැනද දනියි, ක්ෂයට පමුණුවන මාර්ගයද දනියි. වේදනාවන් ක්ෂය වීමෙන් භික්ෂුව තණ්හාවෙන් තොරව පිරිනිවන් පායි.",
      "paliTitle": "Samādhisuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 250,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, bhikkhave, tisso vedanāti. ‘‘Sukhaṃ vā yadi vā dukkhaṃ, adukkhamasukhaṃ saha; Ajjhattañca bahiddhā ca, yaṃ kiñci atthi veditaṃ. ‘‘Etaṃ dukkhanti ñatvāna, mosadhammaṃ palokinaṃ; Phussa phussa vayaṃ passaṃ, evaṃ tattha virajjatī’’ti. dutiyaṃ;",
      "english": "These three feelings, monks. Which three? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling – these, monks, are the three feelings.\n\nWhether pleasant or painful, or neither-painful-nor-pleasant too; whatever is felt, whether internal or external:\n\nKnowing this to be suffering, of a deceiving and perishable nature; perceiving its dissolution again and again, one thus becomes dispassionate towards it.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ වේදනා තුනකි. ඒ මොනවාද තුන? සැප වේදනාව, දුක් වේදනාව, දුක් නොවන සැප නොවන වේදනාව​ය. භික්ෂූන් වහන්ස, මේවා වේදනා තුනකි.\n\nසැප වේවා, දුක් වේවා, දුක් නොවන සැප නොවන වේවා, තමන් තුළ වේවා, පිටතින් වේවා, යම් කිසි වේදනයක් වේද, එය දුකක් යැයිද, මුලාවනසුලු බවද, විනාශවනසුලු බවද දැනගෙන, නිරන්තරයෙන් අත්විඳිමින් එහි වියැකී යාම දකිමින්, එසේ එහි නොඇලී සිටියි.",
      "paliTitle": "Sukhasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 251,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Sukhāya, bhikkhave, vedanāya rāgānusayo pahātabbo, dukkhāya vedanāya paṭighānusayo pahātabbo, adukkhamasukhāya vedanāya avijjānusayo pahātabbo. Yato kho, bhikkhave, bhikkhuno sukhāya vedanāya rāgānusayo pahīno hoti, dukkhāya vedanāya paṭighānusayo pahīno hoti, adukkhamasukhāya vedanāya avijjānusayo pahīno hoti, ayaṃ vuccati, bhikkhave, ‘bhikkhu niranusayo sammaddaso acchecchi [acchejji (bahūsu)] taṇhaṃ, vivattayi [vāvattayi (sī.)] saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’’ti. ‘‘Sukhaṃ vedayamānassa [vediyamānassa (sī. pī.)], vedanaṃ appajānato; So rāgānusayo hoti, anissaraṇadassino. ‘‘Dukkhaṃ vedayamānassa, vedanaṃ appajānato; Paṭighānusayo hoti, anissaraṇadassino. ‘‘Adukkhamasukhaṃ santaṃ, bhūripaññena desitaṃ; Tañcāpi abhinandati, neva dukkhā pamuccati. ‘‘Yato ca bhikkhu ātāpī, sampajaññaṃ na riñcati; Tato so vedanā sabbā, parijānāti paṇḍito. ‘‘So vedanā pariññāya, diṭṭhe dhamme anāsavo; Kāyassa bhedā dhammaṭṭho, saṅkhyaṃ nopeti vedagū’’ti. tatiyaṃ;",
      "english": "“Monks, there are these three feelings. Which three? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. Monks, with pleasant feeling, the underlying tendency of lust should be abandoned; with painful feeling, the underlying tendency of aversion should be abandoned; with neither-painful-nor-pleasant feeling, the underlying tendency of ignorance should be abandoned. Monks, when a monk’s underlying tendency of lust has been abandoned with pleasant feeling, his underlying tendency of aversion has been abandoned with painful feeling, and his underlying tendency of ignorance has been abandoned with neither-painful-nor-pleasant feeling, then, Monks, such a monk is called ‘one who is free from underlying tendencies, one who sees rightly, who has cut off craving, who has unrolled the fetters, and by rightly comprehending conceit has made an end of suffering.’\n\n“For one experiencing pleasant feeling, not understanding that feeling,\nThat is the underlying tendency of lust, for one who does not see the escape.\n\nFor one experiencing painful feeling, not understanding that feeling,\nThat is the underlying tendency of aversion, for one who does not see the escape.\n\nEven the neither-painful-nor-pleasant, taught by the one of profound wisdom,\nIf one still delights in that, one is not freed from suffering.\n\nBut when a monk is ardent and does not abandon clear comprehension,\nThen that wise one fully understands all feelings.\n\nHaving fully understood feelings, he is without taints in this very life;\nBeing established in the Dhamma, upon the body’s dissolution, that master of feelings cannot be reckoned.”",
      "sinhala": "මහණෙනි, මේ වේදනා තුනකි. කවරේද ඒ තුන? සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව. මහණෙනි, සුඛ වේදනාවෙන් රාගානුසය ප්‍රහීණ කළ යුතුය. දුක්ඛ වේදනාවෙන් පටිඝානුසය ප්‍රහීණ කළ යුතුය. අදුක්ඛමසුඛ වේදනාවෙන් අවිද්‍යානුසය ප්‍රහීණ කළ යුතුය. මහණෙනි, යම් කලෙක භික්ෂුවකට සුඛ වේදනාවෙන් රාගානුසය ප්‍රහීණ වීද, දුක්ඛ වේදනාවෙන් පටිඝානුසය ප්‍රහීණ වීද, අදුක්ඛමසුඛ වේදනාවෙන් අවිද්‍යානුසය ප්‍රහීණ වීද, මහණෙනි, මේ භික්ෂුව ‘අනුසය රහිත වූ, මනාකොට දකින්නාවූ, තෘෂ්ණාව සිඳලූ, සංයෝජන දුරුකළ, මානය මනාකොට ප්‍රහාණය කිරීමෙන් දුක කෙළවර කළ’ භික්ෂුවක් යැයි කියනු ලැබේ.\n\nසුඛ වේදනාව විඳිනා නමුත්, වේදනාව නියම අයුරින් නොදන්නා පුද්ගලයාට, මිදීම නොදක්නා හෙයින් රාගානුසය ඇතිවේ.\n\nදුක්ඛ වේදනාව විඳිනා නමුත්, වේදනාව නියම අයුරින් නොදන්නා පුද්ගලයාට, මිදීම නොදක්නා හෙයින් පටිඝානුසය ඇතිවේ.\n\nනොදුක් නොසැප වූ වේදනාව, මහා ප්‍රඥාවන්තයාණන් වහන්සේ විසින් දේශනා කරන ලද්දක් වුවද, එයටද යමෙක් ඇලෙන්නේ නම්, හෙතෙම දුකින් නොමිදේ.\n\nයම් කලෙක භික්ෂුවක් කෙලෙස් තවන වීර්යයෙන් යුක්තව, මනා සිහි නුවණ අත්නොහරින්නේ නම්, එතෙම පණ්ඩිත පුද්ගලයා සියලු වේදනා මනාකොට පිරිසිඳ දනියි.\n\nඑසේ හෙතෙම වේදනා පිරිසිඳ දැන, මේ ජීවිතයේදීම කෙලෙස් රහිතව, කය බිඳී යාමෙන් පසු ධර්මයෙහි පිහිටි, වේදනා කෙළවර කළ ඒ පණ්ඩිතයා කිසිදු ගණනකට හෝ උපමාවකට හෝ නොපැමිණේ.",
      "paliTitle": "Pahānasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 252,
      "pali": "‘‘Assutavā, bhikkhave, puthujjano yaṃ vācaṃ bhāsati – ‘atthi mahāsamudde pātālo’ti. Taṃ kho panetaṃ, bhikkhave, assutavā puthujjano asantaṃ avijjamānaṃ evaṃ vācaṃ bhāsati – ‘atthi mahāsamudde pātālo’ti. Sārīrikānaṃ kho etaṃ, bhikkhave, dukkhānaṃ vedanānaṃ adhivacanaṃ yadidaṃ ‘pātālo’ti. Assutavā, bhikkhave, puthujjano sārīrikāya dukkhāya vedanāya phuṭṭho samāno socati kilamati paridevati urattāḷiṃ kandati sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave, ‘assutavā puthujjano pātāle na paccuṭṭhāsi, gādhañca nājjhagā’. Sutavā ca kho, bhikkhave, ariyasāvako sārīrikāya dukkhāya vedanāya phuṭṭho samāno neva socati, na kilamati, na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave, ‘sutavā ariyasāvako pātāle paccuṭṭhāsi, gādhañca ajjhagā’’’ti. ‘‘Yo etā nādhivāseti, uppannā vedanā dukhā; Sārīrikā pāṇaharā, yāhi phuṭṭho pavedhati. ‘‘Akkandati parodati, dubbalo appathāmako; Na so pātāle paccuṭṭhāsi, atho gādhampi nājjhagā. ‘‘Yo cetā adhivāseti, uppannā vedanā dukhā; Sārīrikā pāṇaharā, yāhi phuṭṭho na vedhati; Sa ve pātāle paccuṭṭhāsi, atho gādhampi ajjhagā’’ti. catutthaṃ;",
      "english": "Monks, the uninstructed ordinary person speaks this saying: ‘There is an abyss in the great ocean.’ Indeed, monks, this uninstructed ordinary person speaks of what is not real, what does not exist, when he says: ‘There is an abyss in the great ocean.’ Indeed, monks, this term ‘abyss’ is a designation for bodily painful feelings. Monks, when an uninstructed ordinary person is afflicted by bodily painful feeling, he grieves, laments, weeps, beats his breast, and falls into utter confusion. This one, monks, is called ‘an uninstructed ordinary person who did not emerge from the abyss and did not find firm ground.’ However, monks, when an instructed noble disciple is afflicted by bodily painful feeling, he neither grieves, nor laments, nor weeps, nor beats his breast, nor falls into utter confusion. This one, monks, is called ‘an instructed noble disciple who emerged from the abyss and found firm ground.’\n\nHe who does not endure these painful feelings that have arisen,\nBodily, life-threatening, by which afflicted he trembles;\n\nHe cries out and weeps, weak and without strength;\nHe did not emerge from the abyss, nor did he find firm ground.\n\nBut he who endures these painful feelings that have arisen,\nBodily, life-threatening, by which afflicted he does not tremble;\nHe indeed emerged from the abyss, and indeed found firm ground.",
      "sinhala": "“මහණෙනි, අශ්‍රැතවත් පෘථග්ජනයා, ‘මහා සාගරයේ පාතාලයක් ඇත’යි යම් වචනයක් කියයි. මහණෙනි, අශ්‍රැතවත් පෘථග්ජනයා නොපවතින, නැති දෙයක් ගැන ‘මහා සාගරයේ පාතාලයක් ඇත’යි මෙසේ වචනයක් කියයි. මහණෙනි, යම් මේ ‘පාතාලය’ යැයි කියනු ලැබේ ද, මෙය ශාරීරික දුක්ඛ වේදනාවන්ට නමකි. මහණෙනි, අශ්‍රැතවත් පෘථග්ජනයා ශාරීරික දුක්ඛ වේදනාවෙන් ස්පර්ශ වූ විට ශෝක කරයි, වෙහෙසට පත්වෙයි, පරිදේවනා කරයි, පපුවට තලාගෙන හඬයි, මුළාවට පැමිණෙයි. මහණෙනි, මේ පුද්ගලයා, ‘අශ්‍රැතවත් පෘථග්ජනයා පාතාලයෙන් ගොඩනොනැඟුණේය, ගැඹුරු තැනක්, එනම් ස්ථිර පිහිටීමක් නොලැබුවේය’යි කියනු ලැබේ. මහණෙනි, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා නම් ශාරීරික දුක්ඛ වේදනාවෙන් ස්පර්ශ වූ විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, පරිදේවනා නොකරයි, පපුවට තලාගෙන නොහඬයි, මුළාවට පැමිණෙන්නේ නැත. මහණෙනි, මේ පුද්ගලයා, ‘ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා පාතාලයෙන් ගොඩනැඟුණේය, ගැඹුරු තැනක්, එනම් ස්ථිර පිහිටීමක් ලැබුවේය’යි කියනු ලැබේ.”\n\n“යම් කෙනෙක් උපන් දුක් වේදනා වූ, ශාරීරික වූ, ප්‍රාණය නසන සුළු වූ, යම් වේදනාවලින් ස්පර්ශ වූ විට කම්පා වෙයි නම්, ඒ වේදනා ඉවසන්නේ නැත්ද,\nහඬා වැටෙයි ද, දුබල වූ, ශක්තියක් නැති ඔහු පාතාලයෙන් ගොඩනැඟුණේ නැත, ගැඹුරු තැනක්, එනම් ස්ථිර පිහිටීමක් ද නොලැබුවේය.\nයම් කෙනෙක් උපන් දුක් වේදනා වූ, ශාරීරික වූ, ප්‍රාණය නසන සුළු වූ, යම් වේදනාවලින් ස්පර්ශ වූ විට කම්පා නොවේ නම්, ඒ වේදනා ඉවසයි ද,\nඔහු නම් පාතාලයෙන් ගොඩනැඟුණේය, ගැඹුරු තැනක්, එනම් ස්ථිර පිහිටීමක් ද ලැබුවේය.”",
      "paliTitle": "Pātālasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 253,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Sukhā, bhikkhave, vedanā dukkhato daṭṭhabbā, dukkhā vedanā sallato daṭṭhabbā, adukkhamasukhā vedanā aniccato daṭṭhabbā. Yato kho, bhikkhave, bhikkhuno sukhā vedanā dukkhato diṭṭhā hoti, dukkhā vedanā sallato diṭṭhā hoti, adukkhamasukhā vedanā aniccato diṭṭhā hoti – ayaṃ vuccati, bhikkhave, ‘bhikkhu sammaddaso acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’’ti. ‘‘Yo sukhaṃ dukkhato adda, dukkhamaddakkhi sallato; Adukkhamasukhaṃ santaṃ, addakkhi naṃ aniccato. ‘‘Sa ve sammaddaso bhikkhu, parijānāti vedanā; So vedanā pariññāya, diṭṭhe dhamme anāsavo; Kāyassa bhedā dhammaṭṭho, saṅkhyaṃ nopeti vedagū’’ti. pañcamaṃ;",
      "english": "These, monks, are three feelings. Which three? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. Pleasant feeling, monks, should be seen as suffering; painful feeling should be seen as a dart; neither-painful-nor-pleasant feeling should be seen as impermanent. When, monks, for a monk, pleasant feeling has been seen as suffering, painful feeling has been seen as a dart, and neither-painful-nor-pleasant feeling has been seen as impermanent, then, monks, such a monk is called 'one who sees rightly, who has cut off craving, has unbound the fetters, and, by rightly comprehending conceit, has made an end to suffering.'\n\nOne who saw pleasure as suffering,\nSaw pain as a dart;\nAnd the neither-painful-nor-pleasant, existing tranquilly,\nSaw it as impermanent.\n\nThat monk, indeed, who sees rightly, fully comprehends feelings. Having fully comprehended feelings, he becomes taintless in this very life. With the breaking up of the body, one established in the Dhamma, a master of feelings, cannot be reckoned.",
      "sinhala": "භික්ෂූණි, මේ වේදනා තුනකි. ඒ කවර තුනක්ද? සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව යනුයි. භික්ෂූණි, සුඛ වේදනාව දුකක් ලෙසද, දුක්ඛ වේදනාව හුලක් ලෙසද, අදුක්ඛමසුඛ වේදනාව අනිත්‍ය වශයෙන්ද දැක්ක යුතුය. භික්ෂූණි, යම් විටෙක භික්ෂුවකට සුඛ වේදනාව දුකක් ලෙස දක්නා ලද්දේ වේද, දුක්ඛ වේදනාව හුලක් ලෙස දක්නා ලද්දේ වේද, අදුක්ඛමසුඛ වේදනාව අනිත්‍ය වශයෙන් දක්නා ලද්දේ වේද, භික්ෂූණි, මේ භික්ෂුව ‘මැනවින් දක්නා ලද්දේය, තණ්හාව සිඳලීය, සංයෝජන දුරලීය, මැනවින් මානය අවබෝධ කරගැනීමෙන් දුක කෙළවර කළේය’ යි කියනු ලැබේ.\n\nයම් පුද්ගලයෙක් සුඛ වේදනාව දුකක් ලෙසද, දුක්ඛ වේදනාව හුලක් ලෙසද දැක්කේය. පවතින අදුක්ඛමසුඛ වේදනාව අනිත්‍ය වශයෙන් දැක්කේය.\n\nනිසැකයෙන්ම, ඒ මැනවින් දක්නා භික්ෂුව වේදනා මැනවින් අවබෝධ කරයි. හෙතෙම වේදනා මැනවින් අවබෝධ කොට, මේ ආත්මභාවයේදීම ආශ්‍රව රහිත වේ. කය බිඳී යාමෙන් පසු, ධර්‍මයෙහි පිහිටි ඒ වේදනා දන්නා තැනැත්තා කිසිදු සංඛ්‍යාවකට ඇතුළත් නොවේ.",
      "paliTitle": "Daṭṭhabbasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 254,
      "pali": "‘‘Assutavā, bhikkhave, puthujjano sukhampi vedanaṃ vedayati [vediyati (sī. pī.)], dukkhampi vedanaṃ vedayati, adukkhamasukhampi vedanaṃ vedayati. Sutavā, bhikkhave, ariyasāvako sukhampi vedanaṃ vedayati, dukkhampi vedanaṃ vedayati, adukkhamasukhampi vedanaṃ vedayati. Tatra, bhikkhave, ko viseso ko adhippayāso [adhippāyo (sī. ka.), adhippāyaso (syā. kaṃ.), adhippāyoso (pī.)] kiṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… assutavā. Bhikkhave, puthujjano dukkhāya vedanāya phuṭṭho samāno socati kilamati paridevati urattāḷiṃ kandati sammohaṃ āpajjati. So dve vedanā vedayati – kāyikañca, cetasikañca. Seyyathāpi, bhikkhave, purisaṃ sallena vijjheyya [sallena anuvijjheyyuṃ (sī. syā. kaṃ. pī.)]. Tamenaṃ dutiyena sallena anuvedhaṃ vijjheyya [sallena anuvijjheyyuṃ (sī.), sallena anuvedhaṃ vijjheyyuṃ (syā. kaṃ.), sallena vijjheyyuṃ (pī.)]. Evañhi so, bhikkhave, puriso dvisallena vedanaṃ vedayati. Evameva kho, bhikkhave, assutavā puthujjano dukkhāya vedanāya phuṭṭho samāno socati kilamati paridevati urattāḷiṃ kandati sammohaṃ āpajjati. So dve vedanā vedayati – kāyikañca, cetasikañca. Tassāyeva kho pana dukkhāya vedanāya phuṭṭho samāno paṭighavā hoti. Tamenaṃ dukkhāya vedanāya paṭighavantaṃ, yo dukkhāya vedanāya paṭighānusayo, so anuseti. So dukkhāya vedanāya phuṭṭho samāno kāmasukhaṃ abhinandati. Taṃ kissa hetu? Na hi so, bhikkhave, pajānāti assutavā puthujjano aññatra kāmasukhā dukkhāya vedanāya nissaraṇaṃ, tassa kāmasukhañca abhinandato, yo sukhāya vedanāya rāgānusayo, so anuseti. So tāsaṃ vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānāti. Tassa tāsaṃ vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ appajānato, yo adukkhamasukhāya vedanāya avijjānusayo, so anuseti. So sukhañce vedanaṃ vedayati, saññutto naṃ vedayati. Dukkhañce vedanaṃ vedayati, saññutto naṃ vedayati. Adukkhamasukhañce vedanaṃ vedayati, saññutto naṃ vedayati. Ayaṃ vuccati, bhikkhave, ‘assutavā puthujjano saññutto jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, saññutto dukkhasmā’ti vadāmi. ‘‘Sutavā ca kho, bhikkhave, ariyasāvako dukkhāya vedanāya phuṭṭho samāno na socati, na kilamati, na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. So ekaṃ vedanaṃ vedayati – kāyikaṃ, na cetasikaṃ. ‘‘Seyyathāpi, bhikkhave, purisaṃ sallena vijjheyya. Tamenaṃ dutiyena sallena anuvedhaṃ na vijjheyya. Evañhi so, bhikkhave, puriso ekasallena vedanaṃ vedayati. Evameva kho, bhikkhave, sutavā ariyasāvako dukkhāya vedanāya phuṭṭho samāno na socati, na kilamati, na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. So ekaṃ vedanaṃ vedayati – kāyikaṃ, na cetasikaṃ. Tassāyeva kho pana dukkhāya vedanāya phuṭṭho samāno paṭighavā na hoti. Tamenaṃ dukkhāya vedanāya appaṭighavantaṃ, yo dukkhāya vedanāya paṭighānusayo, so nānuseti. So dukkhāya vedanāya phuṭṭho samāno kāmasukhaṃ nābhinandati. Taṃ kissa hetu? Pajānāti hi so, bhikkhave, sutavā ariyasāvako aññatra kāmasukhā dukkhāya vedanāya nissaraṇaṃ. Tassa kāmasukhaṃ nābhinandato yo sukhāya vedanāya rāgānusayo, so nānuseti. So tāsaṃ vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavaṃ ca nissaraṇañca yathābhūtaṃ pajānāti. Tassa tāsaṃ vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānato, yo adukkhamasukhāya vedanāya avijjānusayo, so nānuseti. So sukhañce vedanaṃ vedayati, visaññutto naṃ vedayati. Dukkhañce vedanaṃ vedayati, visaññutto naṃ vedayati. Adukkhamasukhañce vedanaṃ vedayati, visaññutto naṃ vedayati. Ayaṃ vuccati, bhikkhave, ‘sutavā ariyasāvako visaññutto jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi, visaññutto dukkhasmā’ti vadāmi. Ayaṃ kho, bhikkhave, viseso, ayaṃ adhippayāso, idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti. ‘‘Na vedanaṃ vedayati sapañño, Sukhampi dukkhampi bahussutopi; Ayañca dhīrassa puthujjanena, Mahā [ayaṃ (syā. kaṃ. ka.)] viseso kusalassa hoti. ‘‘Saṅkhātadhammassa bahussutassa, Vipassato [sampassato (sī. pī.)] lokamimaṃ parañca; Iṭṭhassa dhammā na mathenti cittaṃ, Aniṭṭhato no paṭighātameti. ‘‘Tassānurodhā athavā virodhā, Vidhūpitā atthagatā na santi; Padañca ñatvā virajaṃ asokaṃ, Sammā pajānāti bhavassa pāragū’’ti. chaṭṭhaṃ;",
      "english": "Monks, an unschooled ordinary person experiences pleasant feeling, experiences painful feeling, and experiences neither-painful-nor-pleasant feeling. Monks, an instructed noble disciple also experiences pleasant feeling, experiences painful feeling, and experiences neither-painful-nor-pleasant feeling. Monks, what then is the distinction, what is the peculiarity, what is the difference between an instructed noble disciple and an unschooled ordinary person?\n\nVenerable Sir, the teachings have the Blessed One as their root, their guide, their refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Hearing it from the Blessed One, the monks will remember it.\n\nMonks, when an unschooled ordinary person is touched by painful feeling, they sorrow, grieve, lament, beat their breast, cry out, and fall into confusion. They experience two feelings: a bodily one and a mental one. Just as, monks, if a person were struck by an arrow, and then they were struck by a second arrow following the first, in the same way, monks, that person would experience a feeling from two arrows. Even so, monks, when an unschooled ordinary person is touched by painful feeling, they sorrow, grieve, lament, beat their breast, cry out, and fall into confusion. They experience two feelings: a bodily one and a mental one. When touched by that painful feeling, they are possessed by aversion. As they are possessed by aversion towards that painful feeling, the latent tendency of aversion towards painful feeling underlies them. When touched by painful feeling, they delight in sensual pleasures. And why is that? Because, monks, the unschooled ordinary person does not understand any escape from painful feeling other than sensual pleasure. As they delight in sensual pleasure, the latent tendency of lust for pleasant feeling underlies them. They do not understand as it actually is the origin, the cessation, the gratification, the danger, and the escape from those feelings. As they do not understand as it actually is the origin, the cessation, the gratification, the danger, and the escape from those feelings, the latent tendency of ignorance towards neither-painful-nor-pleasant feeling underlies them. If they experience a pleasant feeling, they experience it as connected. If they experience a painful feeling, they experience it as connected. If they experience a neither-painful-nor-pleasant feeling, they experience it as connected. This, monks, is what is called an unschooled ordinary person who is connected with birth, aging, death, sorrow, lamentation, pain, dejection, and despair; I say they are connected with suffering.\n\nBut, monks, when an instructed noble disciple is touched by painful feeling, they do not sorrow, do not grieve, do not lament, do not beat their breast, do not cry out, and do not fall into confusion. They experience one feeling: a bodily one, not a mental one. Just as, monks, if a person were struck by an arrow, but they were not struck by a second arrow following the first, in the same way, monks, that person would experience a feeling from one arrow. Even so, monks, when an instructed noble disciple is touched by painful feeling, they do not sorrow, do not grieve, do not lament, do not beat their breast, do not cry out, and do not fall into confusion. They experience one feeling: a bodily one, not a mental one. When touched by that painful feeling, they are not possessed by aversion. As they are not possessed by aversion towards that painful feeling, the latent tendency of aversion towards painful feeling does not underlie them. When touched by painful feeling, they do not delight in sensual pleasures. And why is that? Because, monks, the instructed noble disciple understands an escape from painful feeling other than sensual pleasure. As they do not delight in sensual pleasure, the latent tendency of lust for pleasant feeling does not underlie them. They understand as it actually is the origin, the cessation, the gratification, the danger, and the escape from those feelings. As they understand as it actually is the origin, the cessation, the gratification, the danger, and the escape from those feelings, the latent tendency of ignorance towards neither-painful-nor-pleasant feeling does not underlie them. If they experience a pleasant feeling, they experience it as disconnected. If they experience a painful feeling, they experience it as disconnected. If they experience a neither-painful-nor-pleasant feeling, they experience it as disconnected. This, monks, is what is called an instructed noble disciple who is disconnected from birth, aging, death, sorrow, lamentation, pain, dejection, and despair; I say they are disconnected from suffering. This, monks, is the distinction, this is the peculiarity, this is the difference between an instructed noble disciple and an unschooled ordinary person.\n\nThe wise one, though learned, does not experience feelings as binding, whether pleasant or painful. And this is the great distinction for the discerning, skilled one compared to the ordinary person.\n\nFor one who has discerned the Dhamma, who is widely learned, and who discerns this world and the next, pleasant things do not disturb their mind, nor do unpleasant things cause them to react with aversion.\n\nFor such a one, inclinations and dislikes are dispelled, have ceased, and are no more. Having understood the taintless, sorrowless state, one who has crossed over to the far shore of existence rightly comprehends.",
      "sinhala": "“මහණෙනි, අශ්‍රැතවත් වූ පුහුදුන් පුද්ගලයා සැප වේදනාවක් ද විඳියි, දුක් වේදනාවක් ද විඳියි, දුක් නොවන සැප නොවන වේදනාවක් ද විඳියි. මහණෙනි, ශ්‍ර​ැතවත් වූ ආර්ය ශ්‍ර​ාවකයා ද සැප වේදනාවක් විඳියි, දුක් වේදනාවක් විඳියි, දුක් නොවන සැප නොවන වේදනාවක් ද විඳියි. මහණෙනි, මේ ශ්‍ර​ැතවත් ආර්ය ශ්‍ර​ාවකයා හා අශ්‍රැතවත් පුහුදුන් පුද්ගලයා අතර ඇති විශේෂය කුමක්ද, ප්‍ර​යෝජනය කුමක්ද, වෙනස කුමක්ද?” (මෙසේ ඇසූ කල්හි) “ස්වාමීනි, භාග්‍​යවතුන් වහන්සේ මුල්කොට ඇති ධර්මයෝ අපට ආශ්‍රය වෙති...”\n\n“මහණෙනි, අශ්‍රැතවත් පුහුදුන් පුද්ගලයා දුක් වේදනාවෙන් ස්පර්ශ වූ විට සොවින් පෙළෙයි, වෙහෙසට පත්වෙයි, හැඬූ කඳුළින් සිටියි, පපුවට තලා ගනී, මෝහයට පත්වෙයි. හෙතෙම වේදනා දෙකක් විඳියි – කායික වූ වේදනාව ද, චෛතසික වූ වේදනාව ද යි. මහණෙනි, යම් සේ පුරුෂයකු ඊතලයකින් විදිනු ලබයි. එයට පසුව දෙවැනි ඊතලයකින් ද විදිනු ලබයි. මහණෙනි, එපරිද්දෙන් ම ඒ පුරුෂයා ඊතල දෙකක වේදනාව විඳියි. මහණෙනි, එපරිද්දෙන් ම අශ්‍රැතවත් පුහුදුන් පුද්ගලයා දුක් වේදනාවෙන් ස්පර්ශ වූ විට සොවින් පෙළෙයි, වෙහෙසට පත්වෙයි, හැඬූ කඳුළින් සිටියි, පපුවට තලා ගනී, මෝහයට පත්වෙයි. හෙතෙම වේදනා දෙකක් විඳියි – කායික වූ වේදනාව ද, චෛතසික වූ වේදනාව ද යි.\n\nඒ දුක් වේදනාවෙන් ස්පර්ශ වූ ඔහුට ප්‍ර​තිඝය හටගනී. දුක් වේදනාවෙන් ප්‍ර​තිඝය ඇතිවූ ඔහුගේ, දුක් වේදනාව කෙරෙහි ඇති ප්‍ර​තිඝානුසය (නිරතුරුව) අනුසය වශයෙන් පවතී. හෙතෙම දුක් වේදනාවෙන් ස්පර්ශ වූ විට කාම සුඛය අභිනන්දනය කරයි. එයට හේතුව කුමක් ද? මහණෙනි, අශ්‍රැතවත් පුහුදුන් පුද්ගලයා කාම සුඛයට හැර, දුක් වේදනාවෙන් මිදීමට මාර්ගයක් නොදන්නේ ය. කාම සුඛය අභිනන්දනය කරන ඔහුගේ, සැප වේදනාව කෙරෙහි ඇති රාගානුසය (නිරතුරුව) අනුසය වශයෙන් පවතී. හෙතෙම ඒ වේදනාවන්ගේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් අවබෝධ නොකරයි. ඒ වේදනාවන්ගේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් අවබෝධ නොකරන ඔහුගේ, දුක් නොවන සැප නොවන වේදනාව කෙරෙහි ඇති අවිද්‍යානුසය (නිරතුරුව) අනුසය වශයෙන් පවතී. හෙතෙම සැප වේදනාවක් විඳින්නේ නම්, එය බැඳුනු ලෙස විඳියි. දුක් වේදනාවක් විඳින්නේ නම්, එය බැඳුනු ලෙස විඳියි. දුක් නොවන සැප නොවන වේදනාවක් විඳින්නේ නම්, එය බැඳුනු ලෙස විඳියි. මහණෙනි, මේ පුද්ගලයා ‘අශ්‍රැතවත් පුහුදුන් පුද්ගලයා ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැළපීමෙන්, දුකෙන්, දොම්නසින්, ආයාසයෙන් බැඳුනෙක් ම වෙයි; දුකෙන් බැඳුනෙක් යැයි මම කියමි’ යනු කියනු ලැබේ.\n\n“මහණෙනි, ශ්‍ර​ැතවත් ආර්ය ශ්‍ර​ාවකයා දුක් වේදනාවෙන් ස්පර්ශ වූ විට සොවින් නොපෙළෙයි, වෙහෙසට නොපත්වෙයි, නොවැළපෙයි, පපුවට නොතලා ගනී, මෝහයට නොපත්වෙයි. හෙතෙම එක් වේදනාවක් විඳියි – කායික වූ වේදනාව පමණක් විඳියි, චෛතසික වේදනාවක් නොවේ.\n\nමහණෙනි, යම් සේ පුරුෂයකු ඊතලයකින් විදිනු ලබයි. දෙවැනි ඊතලයකින් එයට පසුව විදිනු නොලබයි. මහණෙනි, එපරිද්දෙන් ම ඒ පුරුෂයා එක් ඊතලයක වේදනාව විඳියි. මහණෙනි, එපරිද්දෙන් ම ශ්‍ර​ැතවත් ආර්ය ශ්‍ර​ාවකයා දුක් වේදනාවෙන් ස්පර්ශ වූ විට සොවින් නොපෙළෙයි, වෙහෙසට නොපත්වෙයි, නොවැළපෙයි, පපුවට නොතලා ගනී, මෝහයට නොපත්වෙයි. හෙතෙම එක් වේදනාවක් විඳියි – කායික වූ වේදනාව පමණක් විඳියි, චෛතසික වේදනාවක් නොවේ.\n\nඒ දුක් වේදනාවෙන් ස්පර්ශ වූ ඔහුට ප්‍ර​තිඝය ඇති නොවේ. දුක් වේදනාව කෙරෙහි ප්‍ර​තිඝය නැති ඔහුගේ, දුක් වේදනාව කෙරෙහි ඇති ප්‍ර​තිඝානුසය (නිරතුරුව) අනුසය වශයෙන් නොපවතී. හෙතෙම දුක් වේදනාවෙන් ස්පර්ශ වූ විට කාම සුඛය අභිනන්දනය නොකරයි. එයට හේතුව කුමක් ද? මහණෙනි, ශ්‍ර​ැතවත් ආර්ය ශ්‍ර​ාවකයා කාම සුඛයට හැර, දුක් වේදනාවෙන් මිදීමට මාර්ගයක් දන්නේ ය. කාම සුඛය අභිනන්දනය නොකරන ඔහුගේ, සැප වේදනාව කෙරෙහි ඇති රාගානුසය (නිරතුරුව) අනුසය වශයෙන් නොපවතී. හෙතෙම ඒ වේදනාවන්ගේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් අවබෝධ කරයි. ඒ වේදනාවන්ගේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් අවබෝධ කරන ඔහුගේ, දුක් නොවන සැප නොවන වේදනාව කෙරෙහි ඇති අවිද්‍යානුසය (නිරතුරුව) අනුසය වශයෙන් නොපවතී. හෙතෙම සැප වේදනාවක් විඳින්නේ නම්, එය නොබැඳුනු ලෙස විඳියි. දුක් වේදනාවක් විඳින්නේ නම්, එය නොබැඳුනු ලෙස විඳියි. දුක් නොවන සැප නොවන වේදනාවක් විඳින්නේ නම්, එය නොබැඳුනු ලෙස විඳියි. මහණෙනි, මේ පුද්ගලයා ‘ශ්‍ර​ැතවත් ආර්ය ශ්‍ර​ාවකයා ජාතියෙන්, ජරාවෙන්, මරණයෙන්, ශෝකයෙන්, වැළපීමෙන්, දුකෙන්, දොම්නසින්, ආයාසයෙන් නොබැඳුනෙක් ම වෙයි; දුකින් නොබැඳුනෙක් යැයි මම කියමි’ යනු කියනු ලැබේ.\n\nමහණෙනි, මේ වන්නේ ශ්‍ර​ැතවත් ආර්ය ශ්‍ර​ාවකයා හා අශ්‍රැතවත් පුහුදුන් පුද්ගලයා අතර ඇති විශේෂය යි, මේ වන්නේ ප්‍ර​යෝජනය යි, මේ වන්නේ වෙනස යි.\n\nප්‍ර​ඥාවන්තයා (කෙලෙස් සහිත) වේදනාව නොවිඳියි. සැප වේවා දුක් වේවා, ඔහු ධර්මය පිළිබඳ බොහෝ ඇසූ කෙනෙක් වුව ද වේ.\nමේ ධීර වූ කුසල පුද්ගලයාගේ පුහුදුන් පුද්ගලයාගෙන් ඇති මහා විශේෂය වෙයි.\n\nසකල ධර්මයන් මැනවින් අවබෝධ කළ, බහුශ්‍රැත වූ, මේ ලෝකයත් පරලෝකයත් යථාර්ථයෙන් දකින පුද්ගලයාගේ සිත කැමති දේ නිසා කැලඹෙන්නේ නැත. අකැමැති දේ නිසා කිසිදු ගැටීමක් හෝ ක්‍රෝධයක් ඇති නොවේ.\n\nඔහුගේ ඇලීම් (අනුරෝධ) හෝ විරෝධ (ගැටීම්) දුරු කර දමා ඇත; ඒවා පහව ගොස් ඇත. කිලිටි නැති, ශෝක නැති නිර්වාණ පදය අවබෝධ කරගෙන, භවයේ පරතෙරට පත් වූ උත්තමයා මැනවින් දනියි.",
      "paliTitle": "Sallasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 255,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena gilānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘Sato, bhikkhave, bhikkhu sampajāno kālaṃ āgameyya. Ayaṃ vo amhākaṃ anusāsanī. ‘‘Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti. ‘‘Kathañca, bhikkhave, bhikkhu sampajāno hoti? Idha, bhikkhave, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. Evaṃ kho, bhikkhave, bhikkhu sampajānakārī hoti. Sato, bhikkhave, bhikkhu sampajāno kālaṃ āgameyya. Ayaṃ vo amhākaṃ anusāsanī. ‘‘Tassa ce, bhikkhave, bhikkhuno evaṃ satassa sampajānassa appamattassa ātāpino pahitattassa viharato uppajjati sukhā vedanā, so evaṃ pajānāti – ‘uppannā kho myāyaṃ sukhā vedanā. Sā ca kho paṭicca, no appaṭicca. Kiṃ paṭicca? Imameva kāyaṃ paṭicca. Ayaṃ kho pana kāyo anicco saṅkhato paṭiccasamuppanno. Aniccaṃ kho pana saṅkhataṃ paṭiccasamuppannaṃ kāyaṃ paṭicca uppannā sukhā vedanā kuto niccā bhavissatī’ti! So kāye ca sukhāya ca vedanāya aniccānupassī viharati, vayānupassī viharati, virāgānupassī viharati, nirodhānupassī viharati, paṭinissaggānupassī viharati. Tassa kāye ca sukhāya ca vedanāya aniccānupassino viharato, vayānupassino viharato, virāgānupassino viharato, nirodhānupassino viharato, paṭinissaggānupassino viharato, yo kāye ca sukhāya ca vedanāya rāgānusayo, so pahīyati. ‘‘Tassa ce, bhikkhave, bhikkhuno evaṃ satassa sampajānassa appamattassa ātāpino pahitattassa viharato uppajjati dukkhā vedanā. So evaṃ pajānāti – ‘uppannā kho myāyaṃ dukkhā vedanā. Sā ca kho paṭicca, no appaṭicca. Kiṃ paṭicca? Imameva kāyaṃ paṭicca. Ayaṃ kho pana kāyo anicco saṅkhato paṭiccasamuppanno. Aniccaṃ kho pana saṅkhataṃ paṭiccasamuppannaṃ kāyaṃ paṭicca uppannā dukkhā vedanā kuto niccā bhavissatī’ti! So kāye ca dukkhāya vedanāya aniccānupassī viharati, vayānupassī viharati, virāgānupassī viharati, nirodhānupassī viharati, paṭinissaggānupassī viharati. Tassa kāye ca dukkhāya ca vedanāya aniccānupassino viharato…pe… paṭinissaggānupassino viharato, yo kāye ca dukkhāya ca vedanāya paṭighānusayo, so pahīyati. ‘‘Tassa ce, bhikkhave, bhikkhuno evaṃ satassa sampajānassa appamattassa ātāpino pahitattassa viharato uppajjati adukkhamasukhā vedanā, so evaṃ pajānāti – ‘uppannā kho myāyaṃ adukkhamasukhā vedanā. Sā ca kho paṭicca, no appaṭicca. Kiṃ paṭicca? Imameva kāyaṃ paṭicca. Ayaṃ kho pana kāyo anicco saṅkhato paṭiccasamuppanno. Aniccaṃ kho pana saṅkhataṃ paṭiccasamuppannaṃ kāyaṃ paṭicca uppannā adukkhamasukhā vedanā kuto niccā bhavissatī’ti! So kāye ca adukkhamasukhāya ca vedanāya aniccānupassī viharati, vayānupassī viharati, virāgānupassī viharati, nirodhānupassī viharati, paṭinissaggānupassī viharati. Tassa kāye ca adukkhamasukhāya ca vedanāya aniccānupassino viharato… pe… paṭinissaggānupassino viharato, yo kāye ca adukkhamasukhāya ca vedanāya avijjānusayo, so pahīyati. ‘‘So sukhañce vedanaṃ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti; dukkhañce vedanaṃ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti; adukkhamasukhañce vedanaṃ vedayati, sā aniccāti pajānāti, anajjhositāti pajānāti, anabhinanditāti pajānāti. So sukhañce vedanaṃ vedayati, visaññutto naṃ vedayati; dukkhañce vedanaṃ vedayati, visaññutto naṃ vedayati; adukkhamasukhañce vedanaṃ vedayati, visaññutto naṃ vedayati. So kāyapariyantikaṃ vedanaṃ vedayamāno ‘kāyapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti, jīvitapariyantikaṃ vedanaṃ vedayamāno ‘jīvitapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti. ‘Kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti [sītibhavissantīti (sī. pī. ka.)] pajānāti. ‘‘Seyyathāpi, bhikkhave, telañca paṭicca vaṭṭiñca paṭicca telappadīpo jhāyeyya, tasseva telassa ca vaṭṭiyā ca pariyādānā anāhāro nibbāyeyya; evameva kho, bhikkhave, bhikkhu kāyapariyantikaṃ vedanaṃ vedayamāno ‘kāyapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti. Jīvitapariyantikaṃ vedanaṃ vedayamāno ‘jīvitapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti. ‘Kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānātī’’ti. Sattamaṃ.",
      "english": "One time, the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall.\n\nThen, in the evening, the Blessed One arose from his seclusion and approached the sick ward. Having approached, he sat down on the appointed seat. Having sat down, the Blessed One addressed the monks: “Monks, a monk should await his time, mindful and clearly comprehending. This is our instruction to you.\n\n“And how, monks, is a monk mindful? Here, monks, a monk dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. He dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. He dwells contemplating consciousness in consciousness, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. He dwells contemplating mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. This is how, monks, a monk is mindful.\n\n“And how, monks, is a monk clearly comprehending? Here, monks, a monk acts with clear comprehension when going forward and returning; he acts with clear comprehension when looking ahead and looking around; he acts with clear comprehension when bending and extending his limbs; he acts with clear comprehension when carrying his outer robe, bowl, and inner robe; he acts with clear comprehension when eating, drinking, chewing, and tasting; he acts with clear comprehension when defecating and urinating; he acts with clear comprehension when walking, standing, sitting, sleeping, waking, speaking, and remaining silent. This is how, monks, a monk is clearly comprehending. Monks, a monk should await his time, mindful and clearly comprehending. This is our instruction to you.\n\n“If, monks, while a monk is thus mindful, clearly comprehending, diligent, ardent, and resolute, a pleasant feeling arises, he understands thus: ‘This pleasant feeling has arisen in me. It is dependently arisen, not arisen without a cause. What is it dependent upon? It is dependent upon this very body. Now, this body is impermanent, conditioned, dependently originated. Since a pleasant feeling has arisen dependent upon this impermanent, conditioned, dependently originated body, how could that feeling be permanent?’ He dwells contemplating impermanence in the body and in that pleasant feeling; he dwells contemplating fading away; he dwells contemplating dispassion; he dwells contemplating cessation; he dwells contemplating relinquishment. As he dwells contemplating impermanence in the body and in that pleasant feeling, contemplating fading away, contemplating dispassion, contemplating cessation, contemplating relinquishment, the underlying tendency of passion for the body and for that pleasant feeling is abandoned.\n\n“If, monks, while a monk is thus mindful, clearly comprehending, diligent, ardent, and resolute, a painful feeling arises, he understands thus: ‘This painful feeling has arisen in me. It is dependently arisen, not arisen without a cause. What is it dependent upon? It is dependent upon this very body. Now, this body is impermanent, conditioned, dependently originated. Since a painful feeling has arisen dependent upon this impermanent, conditioned, dependently originated body, how could that feeling be permanent?’ He dwells contemplating impermanence in the body and in that painful feeling; he dwells contemplating fading away; he dwells contemplating dispassion; he dwells contemplating cessation; he dwells contemplating relinquishment. As he dwells contemplating impermanence in the body and in that painful feeling, contemplating fading away, contemplating dispassion, contemplating cessation, contemplating relinquishment, the underlying tendency of aversion for the body and for that painful feeling is abandoned.\n\n“If, monks, while a monk is thus mindful, clearly comprehending, diligent, ardent, and resolute, a neutral feeling (neither painful nor pleasant) arises, he understands thus: ‘This neutral feeling has arisen in me. It is dependently arisen, not arisen without a cause. What is it dependent upon? It is dependent upon this very body. Now, this body is impermanent, conditioned, dependently originated. Since a neutral feeling has arisen dependent upon this impermanent, conditioned, dependently originated body, how could that feeling be permanent?’ He dwells contemplating impermanence in the body and in that neutral feeling; he dwells contemplating fading away; he dwells contemplating dispassion; he dwells contemplating cessation; he dwells contemplating relinquishment. As he dwells contemplating impermanence in the body and in that neutral feeling, contemplating fading away, contemplating dispassion, contemplating cessation, contemplating relinquishment, the underlying tendency of ignorance for the body and for that neutral feeling is abandoned.\n\n“If he feels a pleasant feeling, he understands that it is impermanent, not clung to, not delighted in. If he feels a painful feeling, he understands that it is impermanent, not clung to, not delighted in. If he feels a neutral feeling, he understands that it is impermanent, not clung to, not delighted in. If he feels a pleasant feeling, he feels it disjoined. If he feels a painful feeling, he feels it disjoined. If he feels a neutral feeling, he feels it disjoined.\n\nExperiencing a feeling that is body-bound, he understands, \"I am experiencing a feeling that is body-bound.\" Experiencing a feeling that is life-bound, he understands, \"I am experiencing a feeling that is life-bound.\" He understands, \"With the breaking up of the body, and upon the exhaustion of life, all feelings, not having been delighted in, will become cool right here.\"\n\n\"Just as, monks, an oil lamp burns dependent on oil and dependent on a wick, and with the exhaustion of that very oil and wick, it would be extinguished without fuel; even so, monks, a monk, experiencing a feeling that is body-bound, understands, 'I am experiencing a feeling that is body-bound.' Experiencing a feeling that is life-bound, he understands, 'I am experiencing a feeling that is life-bound.' He understands, 'With the breaking up of the body, and upon the exhaustion of life, all feelings, not having been delighted in, will become cool right here.'\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි මහ වනයෙහි කූටාගාර ශාලාවෙහි වැඩ විසූ සේක. එකල්හි භාග්‍යවතුන් වහන්සේ සවස් වේලාවෙහි පටිසල්ලානයෙන් නැගිට, යම් තැනක රෝගීන්ගේ ශාලාව වීද, ඒ තැනට වැඩම කළ සේක; වැඩම කොට පනවන ලද අසුනෙහි වැඩ හුන් සේක. වැඩ හිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, සිහි ඇතිව, මනා ප්‍රඥාවෙන් යුක්තව, භික්ෂුව නිසි කල්හි කළ යුතු දේ කළ යුතුය. මේ නුඹලාට අපගේ අනුශාසනාවයි.”\n\n“මහණෙනි, භික්ෂුව කෙසේ නම් සිහි ඇත්තෙක් වන්නේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව කයෙහි කය අනුව දකිමින්, දැඩි වීර්යයෙන් යුක්තව, මනා ප්‍රඥාවෙන් යුක්තව, සිහි ඇත්තෙක්ව, ලෝකයෙහි ඇති ලෝභය හා දොම්නස දුරු කොට වාසය කරයි. වේදනාවන්හි වේදනා අනුව දකිමින් වාසය කරයි… සිතෙහි සිත අනුව දකිමින් වාසය කරයි… ධර්මයන්හි ධර්මයන් අනුව දකිමින්, දැඩි වීර්යයෙන් යුක්තව, මනා ප්‍රඥාවෙන් යුක්තව, සිහි ඇත්තෙක්ව, ලෝකයෙහි ඇති ලෝභය හා දොම්නස දුරු කොට වාසය කරයි. මහණෙනි, භික්ෂුව සිහි ඇත්තෙක් වන්නේ මෙසේය.\n\n“මහණෙනි, භික්ෂුව කෙසේ නම් මනා ප්‍රඥාවෙන් යුක්ත වන්නේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ඉදිරියට යෑමෙහි හා ආපසු ඒමෙහි මනා ප්‍රඥාවෙන් යුක්තව කටයුතු කරයි. බැලීමෙහි හා හැරී බැලීමෙහි මනා ප්‍රඥාවෙන් යුක්තව කටයුතු කරයි. අත් පා හැකිලීමෙහි හා දිගහැරීමෙහි මනා ප්‍රඥාවෙන් යුක්තව කටයුතු කරයි. සඟළ, පාත්‍ර, සිවුරු දැරීමෙහි මනා ප්‍රඥාවෙන් යුක්තව කටයුතු කරයි. අනුභව කිරීමෙහි, පානය කිරීමෙහි, කෑමෙහි, රස බැලීමෙහි මනා ප්‍රඥාවෙන් යුක්තව කටයුතු කරයි. මලපහ කිරීමෙහි හා මුත්‍රා කිරීමෙහි මනා ප්‍රඥාවෙන් යුක්තව කටයුතු කරයි. යෑමෙහි, සිටීමෙහි, හිඳීමෙහි, නිදාගැනීමෙහි, අවදිව සිටීමෙහි, කථා කිරීමෙහි, නිශ්ශබ්දව සිටීමෙහි මනා ප්‍රඥාවෙන් යුක්තව කටයුතු කරයි. මහණෙනි, භික්ෂුව මනා ප්‍රඥාවෙන් යුක්ත වන්නේ මෙසේය. මහණෙනි, සිහි ඇතිව, මනා ප්‍රඥාවෙන් යුක්තව, භික්ෂුව නිසි කල්හි කළ යුතු දේ කළ යුතුය. මේ නුඹලාට අපගේ අනුශාසනාවයි.”\n\n“මහණෙනි, යම් හෙයකින් ඒ සිහි ඇති, මනා ප්‍රඥාවෙන් යුත්, අප්‍රමාදී, දැඩි වීර්යය ඇති, ධෛර්යය පහළ කරගත් භික්ෂුව වාසය කරන කල්හි සැප වේදනාවක් උපදීද, ඔහු මෙසේ දැනගනී: ‘මට මේ සැප වේදනාව උපන්නේය. එය ප්‍රත්‍යයකින් හටගත්තේය, ප්‍රත්‍යයක් නැතිව හටගත්තේ නොවේ. කුමක් නිසාද? මේ කයම නිසාය. මේ කය අනිත්‍යය, සංඛතය, ප්‍රත්‍යයෙන් හටගත්තේය. අනිත්‍ය වූ, සංඛත වූ, ප්‍රත්‍යයෙන් හටගත් කය නිසා උපන්නා වූ සැප වේදනාව කෙසේ නම් නිත්‍ය වන්නේදැයි!’ ඔහු කයෙහිද සැප වේදනාවෙහිද අනිත්‍යභාවය අනුව දකිමින් වාසය කරයි, ක්ෂය වීම අනුව දකිමින් වාසය කරයි, විරාගය (ඇල්ම නැතිකම) අනුව දකිමින් වාසය කරයි, නිරෝධය (නැතිවීම) අනුව දකිමින් වාසය කරයි, අත්හැරීම අනුව දකිමින් වාසය කරයි. කයෙහිද සැප වේදනාවෙහිද අනිත්‍යභාවය අනුව දකිමින්, ක්ෂය වීම අනුව දකිමින්, විරාගය අනුව දකිමින්, නිරෝධය අනුව දකිමින්, අත්හැරීම අනුව දකිමින් වාසය කරන ඔහුට කයෙහිද සැප වේදනාවෙහිද යම් රාගානුශයක් (රාගය නමැති යටින් ගලා යන ක්ලේශයක්) වේද, එය ප්‍රහීණ වේ.\n\n“මහණෙනි, යම් හෙයකින් ඒ සිහි ඇති, මනා ප්‍රඥාවෙන් යුත්, අප්‍රමාදී, දැඩි වීර්යය ඇති, ධෛර්යය පහළ කරගත් භික්ෂුව වාසය කරන කල්හි දුක් වේදනාවක් උපදීද, ඔහු මෙසේ දැනගනී: ‘මට මේ දුක් වේදනාව උපන්නේය. එය ප්‍රත්‍යයකින් හටගත්තේය, ප්‍රත්‍යයක් නැතිව හටගත්තේ නොවේ. කුමක් නිසාද? මේ කයම නිසාය. මේ කය අනිත්‍යය, සංඛතය, ප්‍රත්‍යයෙන් හටගත්තේය. අනිත්‍ය වූ, සංඛත වූ, ප්‍රත්‍යයෙන් හටගත් කය නිසා උපන්නා වූ දුක් වේදනාව කෙසේ නම් නිත්‍ය වන්නේදැයි!’ ඔහු කයෙහිද දුක් වේදනාවෙහිද අනිත්‍යභාවය අනුව දකිමින් වාසය කරයි, ක්ෂය වීම අනුව දකිමින් වාසය කරයි, විරාගය අනුව දකිමින් වාසය කරයි, නිරෝධය අනුව දකිමින් වාසය කරයි, අත්හැරීම අනුව දකිමින් වාසය කරයි. කයෙහිද දුක් වේදනාවෙහිද අනිත්‍යභාවය අනුව දකිමින්, ක්ෂය වීම අනුව දකිමින්, විරාගය අනුව දකිමින්, නිරෝධය අනුව දකිමින්, අත්හැරීම අනුව දකිමින් වාසය කරන ඔහුට කයෙහිද දුක් වේදනාවෙහිද යම් ප්‍රතිඝානුශයක් (ක්‍රෝධය නමැති යටින් ගලා යන ක්ලේශයක්) වේද, එය ප්‍රහීණ වේ.\n\n“මහණෙනි, යම් හෙයකින් ඒ සිහි ඇති, මනා ප්‍රඥාවෙන් යුත්, අප්‍රමාදී, දැඩි වීර්යය ඇති, ධෛර්යය පහළ කරගත් භික්ෂුව වාසය කරන කල්හි දුක් ද නොවූ සැප ද නොවූ (උපේක්ෂා) වේදනාවක් උපදීද, ඔහු මෙසේ දැනගනී: ‘මට මේ දුක් ද නොවූ සැප ද නොවූ වේදනාව උපන්නේය. එය ප්‍රත්‍යයකින් හටගත්තේය, ප්‍රත්‍යයක් නැතිව හටගත්තේ නොවේ. කුමක් නිසාද? මේ කයම නිසාය. මේ කය අනිත්‍යය, සංඛතය, ප්‍රත්‍යයෙන් හටගත්තේය. අනිත්‍ය වූ, සංඛත වූ, ප්‍රත්‍යයෙන් හටගත් කය නිසා උපන්නා වූ දුක් ද නොවූ සැප ද නොවූ වේදනාව කෙසේ නම් නිත්‍ය වන්නේදැයි!’ ඔහු කයෙහිද දුක් ද නොවූ සැප ද නොවූ වේදනාවෙහිද අනිත්‍යභාවය අනුව දකිමින් වාසය කරයි, ක්ෂය වීම අනුව දකිමින් වාසය කරයි, විරාගය අනුව දකිමින් වාසය කරයි, නිරෝධය අනුව දකිමින් වාසය කරයි, අත්හැරීම අනුව දකිමින් වාසය කරයි. කයෙහිද දුක් ද නොවූ සැප ද නොවූ වේදනාවෙහිද අනිත්‍යභාවය අනුව දකිමින්, ක්ෂය වීම අනුව දකිමින්, විරාගය අනුව දකිමින්, නිරෝධය අනුව දකිමින්, අත්හැරීම අනුව දකිමින් වාසය කරන ඔහුට කයෙහිද දුක් ද නොවූ සැප ද නොවූ වේදනාවෙහිද යම් අවිජ්ජානුශයක් (අවිද්‍යාව නමැති යටින් ගලා යන ක්ලේශයක්) වේද, එය ප්‍රහීණ වේ.\n\n“ඔහු සැප වේදනාවක් විඳින්නේ නම්, ‘ඒ සැප වේදනාව අනිත්‍යය’ කියා දනී, ‘ඒ සැප වේදනාවට තණ්හාවෙන් නොඇලී සිටිය යුතුය’ කියා දනී, ‘ඒ සැප වේදනාවට අභිනන්දනයක් නැත’ කියා දනී. දුක් වේදනාවක් විඳින්නේ නම්, ‘ඒ දුක් වේදනාව අනිත්‍යය’ කියා දනී, ‘ඒ දුක් වේදනාවට තණ්හාවෙන් නොඇලී සිටිය යුතුය’ කියා දනී, ‘ඒ දුක් වේදනාවට අභිනන්දනයක් නැත’ කියා දනී. දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳින්නේ නම්, ‘ඒ දුක් ද නොවූ සැප ද නොවූ වේදනාව අනිත්‍යය’ කියා දනී, ‘ඒ දුක් ද නොවූ සැප ද නොවූ වේදනාවට තණ්හාවෙන් නොඇලී සිටිය යුතුය’ කියා දනී, ‘ඒ දුක් ද නොවූ සැප ද නොවූ වේදනාවට අභිනන්දනයක් නැත’ කියා දනී. ඔහු සැප වේදනාවක් විඳින්නේ නම්, ඒ වේදනාවෙන් විසංයුක්තව (වෙන්වී) එය විඳියි. දුක් වේදනාවක් විඳින්නේ නම්, ඒ වේදනාවෙන් විසංයුක්තව එය විඳියි. දුක් ද නොවූ සැප ද නොවූ වේදනාවක් විඳින්නේ නම්, ඒ වේදනාවෙන් විසංයුක්තව එය විඳියි.”\n\nඔහු කායපරියන්තික වේදනාවක් විඳිමින් ‘කායපරියන්තික වේදනාවක් විඳිමි’යි ප්‍රඥාවෙන් දනී. ජීවිතපරියන්තික වේදනාවක් විඳිමින් ‘ජීවිතපරියන්තික වේදනාවක් විඳිමි’යි ප්‍රඥාවෙන් දනී. ‘කය බිඳී යාමෙන් පසු, ජීවිතය ක්ෂය වීමෙන්, මෙහිදීම සියලු වේදනා අභිනන්දනය නොකළ, ආශා නොකළ, සන්සිඳී යන්නේය’යි ප්‍රඥාවෙන් දනී.\n\nමහණෙනි, යම්සේ නම් තෙලද හේතුකොටගෙන, වැටියද හේතුකොටගෙන, තෙල් පහනක් දැල්වේද, ඒ තෙලද, වැටියද ක්ෂය වීමෙන් අනුභවයක් නැති හෙයින් නිවේද; එපරිද්දෙන්ම මහණෙනි, භික්ෂුව කායපරියන්තික වේදනාවක් විඳිමින් ‘කායපරියන්තික වේදනාවක් විඳිමි’යි ප්‍රඥාවෙන් දනී. ජීවිතපරියන්තික වේදනාවක් විඳිමින් ‘ජීවිතපරියන්තික වේදනාවක් විඳිමි’යි ප්‍රඥාවෙන් දනී. ‘කය බිඳී යාමෙන් පසු, ජීවිතය ක්ෂය වීමෙන්, මෙහිදීම සියලු වේදනා අභිනන්දනය නොකළ, ආශා නොකළ, සන්සිඳී යන්නේය’යි ප්‍රඥාවෙන් දනී.",
      "paliTitle": "Paṭhamagelaññasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 256,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena gilānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘Sato, bhikkhave, bhikkhu sampajāno kālaṃ āgameyya. Ayaṃ vo amhākaṃ anusāsanī. ‘‘Kathañca, bhikkhave, bhikkhu sato hoti? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu vedanānupassī viharati… citte cittānupassī viharati… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu sato hoti. ‘‘Kathañca, bhikkhave, bhikkhu sampajāno hoti? Idha, bhikkhave, bhikkhu abhikkante paṭikkante sampajānakārī hoti…pe… bhāsite tuṇhībhāve sampajānakārī hoti. Evaṃ kho, bhikkhave, bhikkhu sampajāno hoti. Sato, bhikkhave, bhikkhu sampajāno kālaṃ āgameyya. Ayaṃ vo amhākaṃ anusāsanī. ‘‘Tassa ce, bhikkhave, bhikkhuno evaṃ satassa sampajānassa appamattassa ātāpino pahitattassa viharato uppajjati sukhā vedanā. So evaṃ pajānāti – ‘uppannā kho myāyaṃ sukhā vedanā; sā ca kho paṭicca, no appaṭicca. Kiṃ paṭicca? Imameva phassaṃ paṭicca. Ayaṃ kho pana phasso anicco saṅkhato paṭiccasamuppanno. Aniccaṃ kho pana saṅkhataṃ paṭiccasamuppannaṃ phassaṃ paṭicca uppannā sukhā vedanā kuto niccā bhavissatī’ti! So phasse ca sukhāya ca vedanāya aniccānupassī viharati, vayānupassī viharati, virāgānupassī viharati, nirodhānupassī viharati, paṭinissaggānupassī viharati. Tassa phasse ca sukhāya ca vedanāya aniccānupassino viharato, vayānupassino viharato, virāgānupassino viharato, nirodhānupassino viharato, paṭinissaggānupassino viharato yo phasse ca sukhāya ca vedanāya rāgānusayo, so pahīyati. ‘‘Tassa ce, bhikkhave, bhikkhuno evaṃ satassa…pe… viharato uppajjati dukkhā vedanā…pe… uppajjati adukkhamasukhā vedanā. So evaṃ pajānāti – ‘uppannā kho myāyaṃ adukkhamasukhā vedanā; sā ca kho paṭicca, no appaṭicca. Kiṃ paṭicca? Imameva phassaṃ paṭicca…pe… kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānāti’’. ‘‘Seyyathāpi, bhikkhave, telañca paṭicca vaṭṭiñca paṭicca telappadīpo jhāyeyya, tasseva telassa ca vaṭṭiyā ca pariyādānā anāhāro nibbāyeyya; evameva kho, bhikkhave, bhikkhu kāyapariyantikaṃ vedanaṃ vedayamāno ‘kāyapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti. Jīvitapariyantikaṃ vedanaṃ vedayamāno ‘jīvitapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti. ‘Kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānātī’’ti. Aṭṭhamaṃ.",
      "english": "At one time, the Blessed One was staying in Vesālī, in the Great Wood, at the Gabled Hall. Then, in the evening, the Blessed One arose from seclusion and went to the sick ward; having approached, he sat down on the seat prepared for him. Having sat down, the Blessed One addressed the bhikkhus: \"A bhikkhu, monks, should await his time mindful and clearly comprehending. This is our instruction to you.\"\n\n\"And how, monks, is a bhikkhu mindful? Here, monks, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world; he dwells contemplating feelings in feelings; he dwells contemplating mind in mind; he dwells contemplating mental phenomena in mental phenomena, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world. Thus, monks, is a bhikkhu mindful.\"\n\n\"And how, monks, is a bhikkhu clearly comprehending? Here, monks, when going forward and returning, looking ahead and looking around, bending and stretching his limbs, wearing the robes and carrying the alms-bowl, eating, drinking, chewing, and tasting, defecating and urinating, walking, standing, sitting, falling asleep, waking up, speaking, and remaining silent, he acts with clear comprehension. Thus, monks, is a bhikkhu clearly comprehending. A bhikkhu, monks, should await his time mindful and clearly comprehending. This is our instruction to you.\"\n\n\"If, monks, a pleasant feeling arises for such a bhikkhu dwelling mindful, clearly comprehending, diligent, ardent, and resolute, he understands thus: 'This pleasant feeling has arisen in me; it is dependent, not independent. Dependent on what? Dependent on this very contact. Now, this contact is impermanent, conditioned, dependently arisen. A pleasant feeling that has arisen dependent on impermanent, conditioned, dependently arisen contact—how could it be permanent?' He dwells contemplating impermanence in that contact and that pleasant feeling, contemplating disappearance, contemplating dispassion, contemplating cessation, contemplating relinquishment. As he dwells contemplating impermanence in that contact and that pleasant feeling, contemplating disappearance, contemplating dispassion, contemplating cessation, contemplating relinquishment, the latent tendency to lust for that contact and that pleasant feeling is abandoned.\"\n\n\"If, monks, a painful feeling arises for such a bhikkhu dwelling mindful, clearly comprehending, diligent, ardent, and resolute, he understands thus: 'This painful feeling has arisen in me; it is dependent, not independent. Dependent on what? Dependent on this very contact. This contact is impermanent, conditioned, dependently arisen. A painful feeling that has arisen dependent on impermanent, conditioned, dependently arisen contact—how could it be permanent?' If a neither-painful-nor-pleasant feeling arises, he understands thus: 'This neither-painful-nor-pleasant feeling has arisen in me; it is dependent, not independent. Dependent on what? Dependent on this very contact. This contact is impermanent, conditioned, dependently arisen. A neither-painful-nor-pleasant feeling that has arisen dependent on impermanent, conditioned, dependently arisen contact—how could it be permanent? With the breaking up of the body, with the exhaustion of life, all feelings, no longer delighted in, will become cool right here.'\"\n\n\"Just as, monks, an oil lamp burns dependent on oil and wick, and with the exhaustion of that oil and wick, it is extinguished for lack of fuel; in the same way, monks, a bhikkhu experiencing a feeling bounded by the body understands: 'I am experiencing a feeling bounded by the body.' Experiencing a feeling bounded by life, he understands: 'I am experiencing a feeling bounded by life.' He understands: 'With the breaking up of the body, with the exhaustion of life, all feelings, no longer delighted in, will become cool right here.'\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි මහා වනයෙහි කූටාගාර ශාලාවෙහි වැඩසිටින සේක. එවිට භාග්‍යවතුන් වහන්සේ සවස් වේලෙහි භාවනානුයෝගී විවේකයෙන් නැගී සිටි සේක. ඉන්පසු ගිලන්හල වෙත එළඹි සේක. එළඹවා පනවන ලද අසුනෙහි වැඩසිටි සේක. වැඩසිට භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: “මහණෙනි, සිහි නුවණින් යුතුවූ භික්ෂුව තමාගේ අවසානය නොපමා වී බලාපොරොත්තුවෙන් සිටිය යුතුයි. මෙය නුඹලාට අපගේ අනුශාසනාවයි.\n\n“මහණෙනි, භික්ෂුව සිහි ඇත්තෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව කාය අනුපස්සනාවෙන් යුතුව, කෙලෙස් තවන වීරියෙන්, මනා සිහියෙන් හා නුවණින් ලෝකයෙහි ඇති දැඩි ආශාවන් සහ මානසික පීඩාවන් දුරු කරමින් කයෙහි කය අනුපස්සනාවෙන් වාසය කරයි. වේදනාවන්හි වේදනා අනුපස්සනාවෙන් වාසය කරයි, සිතෙහි සිත් අනුපස්සනාවෙන් වාසය කරයි, ධර්මයන්හි ධර්ම අනුපස්සනාවෙන් යුතුව, කෙලෙස් තවන වීරියෙන්, මනා සිහියෙන් හා නුවණින් ලෝකයෙහි ඇති දැඩි ආශාවන් සහ මානසික පීඩාවන් දුරු කරමින් වාසය කරයි. මහණෙනි, භික්ෂුව සිහි ඇත්තෙක් වන්නේ මෙසේය.\n\n“මහණෙනි, භික්ෂුව නුවණැත්තෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව ඉදිරියට යනවිටත්, ආපසු එනවිටත් මනා නුවණින් යුතුව කටයුතු කරයි; එලෙසම, කතා කරන විටත්, නිහඬව සිටින විටත් මනා නුවණින් යුතුව කටයුතු කරයි. මහණෙනි, භික්ෂුව මනා නුවණින් යුක්ත වන්නේ මෙසේය. මහණෙනි, සිහි නුවණින් යුතුවූ භික්ෂුව තමාගේ අවසානය නොපමා වී බලාපොරොත්තුවෙන් සිටිය යුතුයි. මෙය නුඹලාට අපගේ අනුශාසනාවයි.\n\n“මහණෙනි, මෙසේ සිහි නුවණින් යුතුව, මනා නුවණින් යුතුව, අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන්, වීර්යයෙහි යෙදුණු සිතින් වාසය කරන භික්ෂුවට යම් හෙයකින් සැප වේදනාවක් උපදී නම්, ඔහු මෙසේ දනී: ‘මේ උපන් සැප වේදනාව කිසියම් හේතුවක් නිසා ඇති වූවකි, හේතු රහිතව ඇති වූවක් නොවේ. කුමක් නිසාද? මේ පහසම (ස්පර්ශයම) නිසාය. මේ පහස අනිත්‍යයයි, සංස්කාර ධර්මයකි, පටිච්චසමුප්පන්නව හටගත්තකි. අනිත්‍යවූ, සංස්කාරවූ, පටිච්චසමුප්පන්නව හටගත්තාවූ පහසක් නිසා උපන් සැප වේදනාව නිරතුරුව පවතින්නක් වන්නේ කෙසේදැ’යි (ඔහු දනී). ඔහු පහසෙහි ද, සැප වේදනාවෙහි ද අනිත්‍ය වශයෙන් දකිමින්, නැතිවීම් වශයෙන් දකිමින්, නොඇලීම් වශයෙන් දකිමින්, නිරෝධය වශයෙන් දකිමින්, මුදාහැරීම් වශයෙන් දකිමින් වාසය කරයි. ඔහු පහසෙහි ද, සැප වේදනාවෙහි ද අනිත්‍ය වශයෙන් දකිමින්, නැතිවීම් වශයෙන් දකිමින්, නොඇලීම් වශයෙන් දකිමින්, නිරෝධය වශයෙන් දකිමින්, මුදාහැරීම් වශයෙන් දකිමින් වාසය කරන කල්හි පහස හා සැප වේදනාව කෙරෙහි යම් රාගානුසය ක්ලේශයක් වේ නම්, එය ප්‍රහීණ වේ.\n\n“මහණෙනි, මෙසේ සිහි නුවණින් යුතුව, මනා නුවණින් යුතුව, අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන්, වීර්යයෙහි යෙදුණු සිතින් වාසය කරන භික්ෂුවට යම් හෙයකින් දුක් වේදනාවක් උපදී නම්, නැතහොත් දුක් ද නොවන, සැප ද නොවන උපේක්ෂා වේදනාවක් උපදී නම්, ඔහු මෙසේ දනී: ‘මේ උපන් දුක් ද නොවන, සැප ද නොවන උපේක්ෂා වේදනාව කිසියම් හේතුවක් නිසා ඇති වූවකි, හේතු රහිතව ඇති වූවක් නොවේ. කුමක් නිසාද? මේ පහසම නිසාය... කයේ බිඳීමෙන් පසු, ආයුෂ ක්ෂයවීමෙන් පසු, මෙහිම සියලු වේදනා අත්හැරී සිසිල් වන බව (උපශාන්ත වන බව) දනී’’.\n\n“මහණෙනි, යම් සේ තෙලත්, පහන් වැටියත් හේතුකොටගෙන තෙල් පහනක් දැල්වේද, ඒ තෙලත්, පහන් වැටියත් ක්ෂයවීමෙන් පසුව ආහාර රහිතව නිවී යයිද; එලෙසින්ම මහණෙනි, භික්ෂුව කය කෙළවර කොට ඇති වේදනාවක් විඳින කල්හි ‘මම කය කෙළවර කොට ඇති වේදනාවක් විඳිමි’යි දනී. ජීවිතය කෙළවර කොට ඇති වේදනාවක් විඳින කල්හි ‘මම ජීවිතය කෙළවර කොට ඇති වේදනාවක් විඳිමි’යි දනී. ‘කයේ බිඳීමෙන් පසු, ආයුෂ ක්ෂයවීමෙන් පසු, මෙහිම සියලු වේදනා අත්හැරී සිසිල් වන බව (උපශාන්ත වන බව) දනී’’.",
      "paliTitle": "Dutiyagelaññasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 257,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, bhikkhave, tisso vedanā aniccā saṅkhatā paṭiccasamuppannā khayadhammā vayadhammā virāgadhammā nirodhadhammā’’ti. Navamaṃ.",
      "english": "Monastics, these three feelings are impermanent, conditioned, dependently arisen, subject to destruction, subject to dissolution, subject to dispassion, and subject to cessation. Which three? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These three feelings, monastics, are impermanent, conditioned, dependently arisen, subject to destruction, subject to dissolution, subject to dispassion, and subject to cessation.",
      "sinhala": "මහණෙනි, මේ වේදනා තුනක් අනිත‍්යයි, සංඛතයි, පටිච්චසමුප්පන්නයි, ක‍්ෂය වන ස්වභාවයෙන් යුක්තයි, වය වන ස්වභාවයෙන් යුක්තයි, විරාග වන ස්වභාවයෙන් යුක්තයි, නිරෝධ වන ස්වභාවයෙන් යුක්තයි.\n\nඒවා මොනවාද?\n\nසැප වේදනාව, දුක් වේදනාව, දුක්‌ නොවන සැප නොවන වේදනාව යන මේ වේදනා තුන, මහණෙනි, අනිත‍්යයි, සංඛතයි, පටිච්චසමුප්පන්නයි, ක‍්ෂය වන ස්වභාවයෙන් යුක්තයි, වය වන ස්වභාවයෙන් යුක්තයි, විරාග වන ස්වභාවයෙන් යුක්තයි, නිරෝධ වන ස්වභාවයෙන් යුක්තයි.",
      "paliTitle": "Aniccasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 258,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā phassajā phassamūlakā phassanidānā phassapaccayā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Sukhavedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati sukhā vedanā. Tasseva sukhavedaniyassa phassassa nirodhā, yaṃ tajjaṃ vedayitaṃ sukhavedaniyaṃ phassaṃ paṭicca uppannā sukhā vedanā, sā nirujjhati, sā vūpasammati. Dukkhavedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati dukkhā vedanā. Tasseva dukkhavedaniyassa phassassa nirodhā, yaṃ tajjaṃ vedayitaṃ dukkhavedaniyaṃ phassaṃ paṭicca uppannā dukkhā vedanā, sā nirujjhati, sā vūpasammati. Adukkhamasukhavedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati adukkhamasukhā vedanā. Tasseva adukkhamasukhavedaniyassa phassassa nirodhā, yaṃ tajjaṃ vedayitaṃ adukkhamasukhavedaniyaṃ phassaṃ paṭicca uppannā adukkhamasukhā vedanā, sā nirujjhati, sā vūpasammati. Seyyathāpi, bhikkhave, dvinnaṃ kaṭṭhānaṃ saṅghaṭṭanasamodhānā [saṅkhattā tassa samodhānā (syā. kaṃ.) saṅghattā tassa samodhānā (ka.) saṃ. ni. 2.62 passitabbaṃ] usmā jāyati, tejo abhinibbattati. Tesaṃyeva kaṭṭhānaṃ nānābhāvā vinikkhepā, yā tajjā usmā, sā nirujjhati, sā vūpasammati. Evameva kho, bhikkhave, imā tisso vedanā phassajā phassamūlakā phassanidānā phassapaccayā. Tajjaṃ phassaṃ paṭicca tajjā vedanā uppajjanti. Tajjassa phassassa nirodhā tajjā vedanā nirujjhantī’’ti. Dasamaṃ. Sagāthāvaggo paṭhamo. Tassuddānaṃ – Samādhi sukhaṃ pahānena, pātālaṃ daṭṭhabbena ca; Sallena ceva gelaññā, anicca phassamūlakāti.",
      "english": "These three feelings, bhikkhus, are born of contact, rooted in contact, originate from contact, and are conditioned by contact. Which three? Pleasant feeling, painful feeling, and neither-pleasant-nor-painful feeling. Conditioned by a contact that is felt as pleasant, bhikkhus, a pleasant feeling arises. With the cessation of that very contact that is felt as pleasant, that feeling, that pleasant feeling arisen conditioned by that pleasant-feeling-producing contact, it ceases, it subsides. Conditioned by a contact that is felt as painful, bhikkhus, a painful feeling arises. With the cessation of that very contact that is felt as painful, that feeling, that painful feeling arisen conditioned by that painful-feeling-producing contact, it ceases, it subsides. Conditioned by a contact that is felt as neither-pleasant-nor-painful, bhikkhus, a neither-pleasant-nor-painful feeling arises. With the cessation of that very contact that is felt as neither-pleasant-nor-painful, that feeling, that neither-pleasant-nor-painful feeling arisen conditioned by that neither-pleasant-nor-painful-feeling-producing contact, it ceases, it subsides. Just as, bhikkhus, from the friction and coming together of two pieces of wood, heat is generated, fire arises. With the separation and dispersal of those very pieces of wood, that resultant heat ceases, it subsides. In the same way, bhikkhus, these three feelings are born of contact, rooted in contact, originate from contact, and are conditioned by contact. Conditioned by the respective contact, the respective feelings arise. With the cessation of the respective contact, the respective feelings cease.",
      "sinhala": "මහණෙනි, මේ වේදනා තුනක් ස්පර්ශයෙන් හටගත්තා වූ ද, ස්පර්ශය මුල් කොට ඇත්තා වූ ද, ස්පර්ශය හේතු කොට ඇත්තා වූ ද, ස්පර්ශය ප්‍රත්‍යය කොට ඇත්තා වූ ද වේ. ඒ තුන කවරේද? සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව යි.\n\nමහණෙනි, සැප උපදවන ස්පර්ශයක් හේතු කොටගෙන සුඛ වේදනාව උපදියි. ඒ සැප උපදවන ස්පර්ශය නිරුද්ධ වීමෙන්, යම් ඒ සැප උපදවන ස්පර්ශයක් හේතු කොටගෙන හටගත් සුඛ වේදනාවක් වේ ද, එය නිරුද්ධ වේ, එය සංසිඳේ. මහණෙනි, දුක් උපදවන ස්පර්ශයක් හේතු කොටගෙන දුක්ඛ වේදනාව උපදියි. ඒ දුක් උපදවන ස්පර්ශය නිරුද්ධ වීමෙන්, යම් ඒ දුක් උපදවන ස්පර්ශයක් හේතු කොටගෙන හටගත් දුක්ඛ වේදනාවක් වේ ද, එය නිරුද්ධ වේ, එය සංසිඳේ. මහණෙනි, දුක් ද නොවන සැප ද නොවන ස්පර්ශයක් හේතු කොටගෙන අදුක්ඛමසුඛ වේදනාව උපදියි. ඒ දුක් ද නොවන සැප ද නොවන ස්පර්ශය නිරුද්ධ වීමෙන්, යම් ඒ දුක් ද නොවන සැප ද නොවන ස්පර්ශයක් හේතු කොටගෙන හටගත් අදුක්ඛමසුඛ වේදනාවක් වේ ද, එය නිරුද්ධ වේ, එය සංසිඳේ.\n\nමහණෙනි, යම් සේ දඬු දෙකක් එකට ගැටීමෙන් හා එක්වීමෙන් (එකිනෙකට උරච්චි කිරීමෙන්) උෂ්ණය හටගනී ද, තේජස (ගින්න) පහළ වේ ද, ඒ දඬු දෙක වෙන වෙනම තිබීමෙන්, වෙන් කිරීමෙන් යම් ඒ උෂ්ණයක් (ගින්නක්) වේ ද, එය නිරුද්ධ වේ, එය සංසිඳේ. මහණෙනි, එලෙසින්ම මේ වේදනා තුන ස්පර්ශයෙන් හටගත්තා වූ ද, ස්පර්ශය මුල් කොට ඇත්තා වූ ද, ස්පර්ශය හේතු කොට ඇත්තා වූ ද, ස්පර්ශය ප්‍රත්‍යය කොට ඇත්තා වූ ද වේ. ඒ ඒ ස්පර්ශය හේතු කොටගෙන ඒ ඒ වේදනා උපදිති. ඒ ඒ ස්පර්ශය නිරුද්ධ වීමෙන් ඒ ඒ වේදනා නිරුද්ධ වෙති.\n\nදස වැන්න යි. සගාථා වර්ගය පළමුවැන්න යි. එහි උද්දානය (මාතෘකා සංග්‍රහය) මෙසේය: සමාධි, සුඛ, ප්‍රහාණය, පාතාල, දැක්ක යුතු දේ ද; සල්ල (හී), ගිලන් වීම, අනිත්‍ය, ස්පර්ශය මුල් කොට ඇත්තේ යි.",
      "paliTitle": "Phassamūlakasuttaṃ",
      "vagga": "Sagāthāvaggo"
    },
    {
      "number": 259,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘tisso vedanā vuttā bhagavatā. Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā tisso vedanā vuttā bhagavatā. Vuttaṃ kho panetaṃ bhagavatā – ‘yaṃ kiñci vedayitaṃ taṃ dukkhasmi’nti. Kiṃ nu kho etaṃ bhagavatā sandhāya bhāsitaṃ – ‘yaṃ kiñci vedayitaṃ taṃ dukkhasmi’’’nti? ‘‘Sādhu sādhu, bhikkhu! Tisso imā, bhikkhu, vedanā vuttā mayā. Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā tisso vedanā vuttā mayā. Vuttaṃ kho panetaṃ, bhikkhu, mayā – ‘yaṃ kiñci vedayitaṃ, taṃ dukkhasmi’nti. Taṃ kho panetaṃ, bhikkhu, mayā saṅkhārānaṃyeva aniccataṃ sandhāya bhāsitaṃ – ‘yaṃ kiñci vedayitaṃ taṃ dukkhasmi’nti. Taṃ kho panetaṃ, bhikkhu, mayā saṅkhārānaṃyeva khayadhammataṃ…pe… vayadhammataṃ…pe… virāgadhammataṃ …pe… nirodhadhammataṃ…pe… vipariṇāmadhammataṃ sandhāya bhāsitaṃ – ‘yaṃ kiñci vedayitaṃ taṃ dukkhasmi’nti. Atha kho pana, bhikkhu, mayā anupubbasaṅkhārānaṃ nirodho akkhāto. Paṭhamaṃ jhānaṃ samāpannassa vācā niruddhā hoti. Dutiyaṃ jhānaṃ samāpannassa vitakkavicārā niruddhā honti. Tatiyaṃ jhānaṃ samāpannassa pīti niruddhā hoti. Catutthaṃ jhānaṃ samāpannassa assāsapassāsā niruddhā honti. Ākāsānañcāyatanaṃ samāpannassa rūpasaññā niruddhā hoti. Viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññā niruddhā hoti. Ākiñcaññāyatanaṃ samāpannassa viññāṇañcāyatanasaññā niruddhā hoti. Nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññā niruddhā hoti. Saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca niruddhā honti. Khīṇāsavassa bhikkhuno rāgo niruddho hoti, doso niruddho hoti, moho niruddho hoti. Atha kho, bhikkhu, mayā anupubbasaṅkhārānaṃ vūpasamo akkhāto. Paṭhamaṃ jhānaṃ samāpannassa vācā vūpasantā hoti. Dutiyaṃ jhānaṃ samāpannassa vitakkavicārā vūpasantā honti…pe… saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca vūpasantā honti. Khīṇāsavassa bhikkhuno rāgo vūpasanto hoti, doso vūpasanto hoti, moho vūpasanto hoti. Chayimā, bhikkhu, passaddhiyo. Paṭhamaṃ jhānaṃ samāpannassa vācā paṭippassaddhā hoti. Dutiyaṃ jhānaṃ samāpannassa vitakkavicārā paṭippassaddhā honti. Tatiyaṃ jhānaṃ samāpannassa pīti paṭippassaddhā hoti. Catutthaṃ jhānaṃ samāpannassa assāsapassāsā paṭippassaddhā honti. Saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca paṭippassaddhā honti. Khīṇāsavassa bhikkhuno rāgo paṭippassaddho hoti, doso paṭippassaddho hoti, moho paṭippassaddho hotī’’ti. Paṭhamaṃ.",
      "english": "Then a certain bhikkhu approached the Blessed One. Having approached and respectfully saluted the Blessed One, he sat down to one side. As he sat to one side, that bhikkhu said this to the Blessed One: \"Here, venerable sir, as I was alone in seclusion, this thought arose in my mind: 'Three feelings have been declared by the Blessed One: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling – these three feelings have been declared by the Blessed One.' But it has also been stated by the Blessed One: 'Whatever is felt, that is suffering.' What, then, did the Blessed One have in mind when he spoke this: 'Whatever is felt, that is suffering'?\"\n\n\"Good, good, bhikkhu! These three feelings, bhikkhu, have been declared by me: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling – these three feelings have been declared by me. But it has also been stated by me, bhikkhu: 'Whatever is felt, that is suffering.'\n\nAnd that, bhikkhu, was spoken by me with reference to the impermanence of all conditioned phenomena, that 'Whatever is felt, that is suffering.' And that, bhikkhu, was spoken by me with reference to the nature of all conditioned phenomena to decay, to vanish, to fade away, to cease, and to change, that 'Whatever is felt, that is suffering.'\n\nFurthermore, bhikkhu, the gradual cessation of conditioned phenomena has been declared by me. For one who has attained the first jhāna, speech has ceased. For one who has attained the second jhāna, applied thought and sustained thought have ceased. For one who has attained the third jhāna, rapture has ceased. For one who has attained the fourth jhāna, in-breaths and out-breaths have ceased. For one who has attained the base of infinite space, the perception of form has ceased. For one who has attained the base of infinite consciousness, the perception of the base of infinite space has ceased. For one who has attained the base of nothingness, the perception of the base of infinite consciousness has ceased. For one who has attained the base of neither perception nor non-perception, the perception of the base of nothingness has ceased. For one who has attained the cessation of perception and feeling, perception and feeling have ceased. For a bhikkhu whose defilements are destroyed, greed has ceased, aversion has ceased, and delusion has ceased.\n\nFurthermore, bhikkhu, the gradual appeasement of conditioned phenomena has been declared by me. For one who has attained the first jhāna, speech is appeased. For one who has attained the second jhāna, applied thought and sustained thought are appeased, and so on, up to: for one who has attained the cessation of perception and feeling, perception and feeling are appeased. For a bhikkhu whose defilements are destroyed, greed is appeased, aversion is appeased, and delusion is appeased.\n\nThere are these six kinds of tranquillity, bhikkhu. For one who has attained the first jhāna, speech is tranquilized. For one who has attained the second jhāna, applied thought and sustained thought are tranquilized. For one who has attained the third jhāna, rapture is tranquilized. For one who has attained the fourth jhāna, in-breaths and out-breaths are tranquilized. For one who has attained the cessation of perception and feeling, perception and feeling are tranquilized. For a bhikkhu whose defilements are destroyed, greed is tranquilized, aversion is tranquilized, and delusion is tranquilized.\"",
      "sinhala": "එවිට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීනි, මෙහිදී මට තනිව වාසය කරන කල්හි, භාවනාවේ යෙදී සිටින කල්හි මෙසේ සිතුවිල්ලක් පහළ විය: ‘වේදනා තුනක් භාග්‍යවතුන් වහන්සේ විසින් වදාළ සේක. සැප වේදනාව, දුක් වේදනාව, දුක්‌නොවන-සැප‌නොවන වේදනාව - මේ වේදනා තුන භාග්‍යවතුන් වහන්සේ විසින් වදාළ සේක. නමුත් භාග්‍යවතුන් වහන්සේ විසින් මෙසේ ද වදාරණ ලද්දේය: 'යම් කිසි වේදනාවක් ඇද්ද, ඒ සියල්ල දුක්ය' කියා. 'යම් කිසි වේදනාවක් ඇද්ද, ඒ සියල්ල දුක්ය' කියා භාග්‍යවතුන් වහන්සේ මේ දෙසුම කුමක් අරමුණු කරගෙන වදාළ සේක් ද?”\n\n“සාදු සාදු, මහණ! මහණ, මේ වේදනා තුන මා විසින් වදාළ ලද්දේය. සැප වේදනාව, දුක් වේදනාව, දුක්‌නොවන-සැප‌නොවන වේදනාව - මේ වේදනා තුන මා විසින් වදාළ ලද්දේය. මහණ, 'යම් කිසි වේදනාවක් ඇද්ද, ඒ සියල්ල දුක්ය' කියා මා විසින් ද වදාරණ ලද්දේය. මහණ, ඒ දෙසුම මා විසින් සංස්කාරයන්ගේම අනිත්‍යභාවය අරමුණු කරගෙන වදාළ ලද්දේය - 'යම් කිසි වේදනාවක් ඇද්ද, ඒ සියල්ල දුක්ය' කියාය. මහණ, ඒ දෙසුම මා විසින් සංස්කාරයන්ගේම ක්ෂය වන ස්වභාවය ද, විනාශ වන ස්වභාවය ද, නොඇලෙන ස්වභාවය ද, නිරුද්ධ වන ස්වභාවය ද, වෙනස් වන ස්වභාවය ද අරමුණු කරගෙන වදාළ ලද්දේය - 'යම් කිසි වේදනාවක් ඇද්ද, ඒ සියල්ල දුක්ය' කියාය.\n\nඑසේම, මහණ, මා විසින් අනුක්‍රමයෙන් සංස්කාරයන්ගේ නිරෝධය දෙසන ලද්දේය. පළමු ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ වචනය නිරුද්ධ වේ. දෙවෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ විතර්ක හා විචාර නිරුද්ධ වේ. තුන්වෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ප්‍රීතිය නිරුද්ධ වේ. සිවුවෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ආශ්වාස ප්‍රශ්වාස නිරුද්ධ වේ. ආකාසානඤ්චායතනයට සමවැදුණු පුද්ගලයාගේ රූප සංඥාව නිරුද්ධ වේ. විඤ්ඤාණඤ්චායතනයට සමවැදුණු පුද්ගලයාගේ ආකාසානඤ්චායතන සංඥාව නිරුද්ධ වේ. ආකිඤ්චඤ්ඤායතනයට සමවැදුණු පුද්ගලයාගේ විඤ්ඤාණඤ්චායතන සංඥාව නිරුද්ධ වේ. නේවසඤ්ඤානාසඤ්ඤායතනයට සමවැදුණු පුද්ගලයාගේ ආකිඤ්චඤ්ඤායතන සංඥාව නිරුද්ධ වේ. සංඥා වේදයිත නිරෝධයට සමවැදුණු පුද්ගලයාගේ සංඥාව ද වේදනාව ද නිරුද්ධ වේ. ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය නිරුද්ධ වේ, ද්වේෂය නිරුද්ධ වේ, මෝහය නිරුද්ධ වේ.\n\nඑසේම, මහණ, මා විසින් අනුක්‍රමයෙන් සංස්කාරයන්ගේ සංසිඳීම දෙසන ලද්දේය. පළමු ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ වචනය සංසිඳී පවතී. දෙවෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ විතර්ක හා විචාර සංසිඳී පවතී. තුන්වෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ප්‍රීතිය සංසිඳී පවතී. සිවුවෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ආශ්වාස ප්‍රශ්වාස සංසිඳී පවතී. ආකාසානඤ්චායතනයට සමවැදුණු පුද්ගලයාගේ රූප සංඥාව සංසිඳී පවතී. විඤ්ඤාණඤ්චායතනයට සමවැදුණු පුද්ගලයාගේ ආකාසානඤ්චායතන සංඥාව සංසිඳී පවතී. ආකිඤ්චඤ්ඤායතනයට සමවැදුණු පුද්ගලයාගේ විඤ්ඤාණඤ්චායතන සංඥාව සංසිඳී පවතී. නේවසඤ්ඤානාසඤ්ඤායතනයට සමවැදුණු පුද්ගලයාගේ ආකිඤ්චඤ්ඤායතන සංඥාව සංසිඳී පවතී. සංඥා වේදයිත නිරෝධයට සමවැදුණු පුද්ගලයාගේ සංඥාව ද වේදනාව ද සංසිඳී පවතී. ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය සංසිඳී පවතී, ද්වේෂය සංසිඳී පවතී, මෝහය සංසිඳී පවතී.\n\nමහණ, මේවා සංසිඳීම් (පස්සද්ධි) හයකි. පළමු ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ වචනය මුළුමනින්ම සංසිඳී පවතී. දෙවෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ විතර්ක හා විචාර මුළුමනින්ම සංසිඳී පවතී. තුන්වෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ප්‍රීතිය මුළුමනින්ම සංසිඳී පවතී. සිවුවෙනි ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ආශ්වාස ප්‍රශ්වාස මුළුමනින්ම සංසිඳී පවතී. සංඥා වේදයිත නිරෝධයට සමවැදුණු පුද්ගලයාගේ සංඥාව ද වේදනාව ද මුළුමනින්ම සංසිඳී පවතී. ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය මුළුමනින්ම සංසිඳී පවතී, ද්වේෂය මුළුමනින්ම සංසිඳී පවතී, මෝහය මුළුමනින්ම සංසිඳී පවතී.",
      "paliTitle": "Rahogatasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 260,
      "pali": "‘‘Seyyathāpi, bhikkhave, ākāse vividhā vātā vāyanti. Puratthimāpi vātā vāyanti, pacchimāpi vātā vāyanti, uttarāpi vātā vāyanti, dakkhiṇāpi vātā vāyanti, sarajāpi vātā vāyanti, arajāpi vātā vāyanti, sītāpi vātā vāyanti, uṇhāpi vātā vāyanti, parittāpi vātā vāyanti, adhimattāpi vātā vāyanti. Evameva kho, bhikkhave, imasmiṃ kāyasmiṃ vividhā vedanā uppajjanti, sukhāpi vedanā uppajjati, dukkhāpi vedanā uppajjati, adukkhamasukhāpi vedanā uppajjatī’’ti. ‘‘Yathāpi vātā ākāse, vāyanti vividhā puthū; Puratthimā pacchimā cāpi, uttarā atha dakkhiṇā. ‘‘Sarajā arajā capi, sītā uṇhā ca ekadā; Adhimattā parittā ca, puthū vāyanti mālutā. ‘‘Tathevimasmiṃ kāyasmiṃ, samuppajjanti vedanā; Sukhadukkhasamuppatti, adukkhamasukhā ca yā. ‘‘Yato ca bhikkhu ātāpī, sampajaññaṃ na riñcati [sampajāno nirūpadhi (ka.)]; Tato so vedanā sabbā, parijānāti paṇḍito. ‘‘So vedanā pariññāya, diṭṭhe dhamme anāsavo; Kāyassa bhedā dhammaṭṭho, saṅkhyaṃ nopeti vedagū’’ti. dutiyaṃ;",
      "english": "Just as, monks, various winds blow in the sky. Eastern winds blow, western winds blow, northern winds blow, southern winds blow, dusty winds blow, dustless winds blow, cold winds blow, hot winds blow, gentle winds blow, and strong winds blow. Even so, monks, various feelings arise in this body: pleasant feelings arise, painful feelings arise, and neither-painful-nor-pleasant feelings arise.\n\nJust as diverse and manifold winds blow in the sky—eastern, western, northern, and southern;\nDusty and dustless, cold and hot at times, strong and gentle—these manifold winds blow.\nJust so, feelings arise in this body: pleasant, painful, and that which is neither-painful-nor-pleasant.\nWhen a monk, ardent, does not abandon clear comprehension, then that wise one fully understands all feelings.\nHaving fully understood those feelings, in this very life, he is without taints. With the break-up of the body, that one, established in the Dhamma and having gone beyond all feelings, does not enter into reckoning.",
      "sinhala": "මහණෙනි, යම් සේ අහසෙහි නොයෙකුත් සුළං හමා යයි ද, පෙරදිගින් හමන සුළං ද, අපරදිගින් හමන සුළං ද, උතුරුදිගින් හමන සුළං ද, දකුණුදිගින් හමන සුළං ද හමා යයි. දූවිලි සහිත සුළං ද, දූවිලි රහිත සුළං ද හමා යයි. සීතල සුළං ද, උණුසුම් සුළං ද හමා යයි. මඳ සුළං ද, අධික සුළං ද හමා යයි. එපරිද්දෙන්ම, මහණෙනි, මේ ශරීරයෙහි නොයෙකුත් වේදනා උපදී. සැප වේදනා ද උපදී, දුක් වේදනා ද උපදී, දුක් ද නොවන සැප ද නොවන වේදනා ද උපදී.\n\nයම් සේ අහසෙහි නොයෙක් ආකාරයෙන් විවිධ වූ සුළං හමා යයි ද, පෙරදිගින් ද, අපරදිගින් ද, උතුරුදිගින් ද, දකුණුදිගින් ද හමා යයි.\n\nදූවිලි සහිත වූ ද, දූවිලි රහිත වූ ද, සීතල වූ ද, උණුසුම් වූ ද සුළං ද, අධික වූ ද, මඳ වූ ද නොයෙක් ආකාර සුළං හමා යයි.\n\nඑපරිද්දෙන්ම මේ ශරීරයෙහි වේදනා පහළ වේ. සැප වේදනා ද, දුක් වේදනා ද උපදී, දුක් ද නොවන සැප ද නොවන යම් වේදනා ඇද්ද ඒවා ද උපදී.\n\nයම් හෙයින් මහණ තෙම තද වීර්යයෙන් යුක්ත ව සම්පජඤ්ඤය අත් නොහරියි ද, එහෙයින් ඒ පණ්ඩිත තෙම සියලු වේදනා පිරිසිඳ දනියි.\n\nඒ තෙම වේදනා පිරිසිඳ දැන, මේ ආත්මභාවයෙහි ම ආශ්‍ර‍ව රහිත වූයේ, කය බිඳී යාමෙන් පසු ධර්මයෙහි පිහිටියේ, වේදනා පිළිබඳ කෙළවරට පත් වූ ඒ අරහත් තැනැත්තා කිසිදු ගණනකට ඇතුළත් නොවේ.",
      "paliTitle": "Paṭhamaākāsasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 261,
      "pali": "‘‘Seyyathāpi, bhikkhave, ākāse vividhā vātā vāyanti. Puratthimāpi vātā vāyanti…pe… adhimattāpi vātā vāyanti. Evameva kho, bhikkhave, imasmiṃ kāyasmiṃ vividhā vedanā uppajjanti, sukhāpi vedanā uppajjati, dukkhāpi vedanā uppajjati, adukkhamasukhāpi vedanā uppajjatī’’ti. Tatiyaṃ.",
      "english": "Just as, monks, various winds blow in the sky. Winds from the east blow, and similarly, winds from other directions and of various intensities, even exceedingly strong winds, blow. Just in the same way, monks, various feelings arise in this body: pleasant feelings arise, painful feelings arise, and neither-pleasant-nor-painful feelings arise.",
      "sinhala": "මහණෙනි, අහසේ නොයෙකුත් සුළං හමනවාක් මෙනි. නැගෙනහිරින් සුළං හමයි, බටහිරින් සුළං හමයි, උතුරුදිගින් සුළං හමයි, දකුණුදිගින් සුළං හමයි, මඳ සුළං හමයි, දැඩි සුළං හමයි, ඉතා දැඩි සුළං හමයි. මහණෙනි, එලෙසම මේ කයෙහි නොයෙකුත් වේදනා හට ගනී. සැප වේදනා හට ගනී, දුක් වේදනා හට ගනී, දුක්-නොවූ-සැප-නොවූ වේදනා හට ගනී.",
      "paliTitle": "Dutiyaākāsasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 262,
      "pali": "‘‘Seyyathāpi, bhikkhave, āgantukāgāraṃ. Tattha puratthimāyapi disāya āgantvā vāsaṃ kappenti, pacchimāyapi disāya āgantvā vāsaṃ kappenti, uttarāyapi disāya āgantvā vāsaṃ kappenti, dakkhiṇāyapi disāya āgantvā vāsaṃ kappenti. Khattiyāpi āgantvā vāsaṃ kappenti, brāhmaṇāpi āgantvā vāsaṃ kappenti, vessāpi āgantvā vāsaṃ kappenti, suddāpi āgantvā vāsaṃ kappenti. Evameva kho, bhikkhave, imasmiṃ kāyasmiṃ vividhā vedanā uppajjanti. Sukhāpi vedanā uppajjati, dukkhāpi vedanā uppajjati, adukkhamasukhāpi vedanā uppajjati. Sāmisāpi sukhā vedanā uppajjati, sāmisāpi dukkhā vedanā uppajjati, sāmisāpi adukkhamasukhā vedanā uppajjati. Nirāmisāpi sukhā vedanā uppajjati, nirāmisāpi dukkhā vedanā uppajjati, nirāmisāpi adukkhamasukhā vedanā uppajjatī’’ti. Catutthaṃ.",
      "english": "Just as, monks, there is a guest house. There, coming from the eastern direction, people settle and stay; coming from the western direction, people settle and stay; coming from the northern direction, people settle and stay; coming from the southern direction, people settle and stay. Khattiyas come and settle and stay; Brahmins come and settle and stay; Vessas come and settle and stay; Suddas come and settle and stay.\n\nJust in the same way, monks, in this very body, various feelings arise. Pleasant feelings arise, unpleasant feelings arise, and neither-pleasant-nor-unpleasant feelings arise. Pleasant feelings that are worldly arise, unpleasant feelings that are worldly arise, and neither-pleasant-nor-unpleasant feelings that are worldly arise. Pleasant feelings that are unworldly arise, unpleasant feelings that are unworldly arise, and neither-pleasant-nor-unpleasant feelings that are unworldly arise.",
      "sinhala": "යම් සේ මහණෙනි, ආගන්තුක ශාලාවක් වේ ද, එහි නැගෙනහිර දිශාවෙන් ද පැමිණ වාසය කරත් ද, බටහිර දිශාවෙන් ද පැමිණ වාසය කරත් ද, උතුරු දිශාවෙන් ද පැමිණ වාසය කරත් ද, දකුණු දිශාවෙන් ද පැමිණ වාසය කරත් ද. ක්ෂත්‍රියයෝ ද පැමිණ වාසය කරත් ද, බ්‍රාහ්මණයෝ ද පැමිණ වාසය කරත් ද, වෛශ්‍යයෝ ද පැමිණ වාසය කරත් ද, ශුද්‍රයෝ ද පැමිණ වාසය කරත් ද.\n\nඑසෙයින්ම මහණෙනි, මේ කයෙහි නොයෙක් වේදනා හටගනිත්. සැප වේදනාව ද හටගනී, දුක් වේදනාව ද හටගනී, දුක්‌ නොවන, සැප නොවන වේදනාව ද හටගනී. ආමිස වූ සැප වේදනාව ද හටගනී, ආමිස වූ දුක් වේදනාව ද හටගනී, ආමිස වූ දුක්‌ නොවන, සැප නොවන වේදනාව ද හටගනී. නිරාමිස වූ සැප වේදනාව ද හටගනී, නිරාමිස වූ දුක් වේදනාව ද හටගනී, නිරාමිස වූ දුක්‌ නොවන, සැප නොවන වේදනාව ද හටගනී.",
      "paliTitle": "Agārasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 263,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi, ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘katamā nu kho, bhante, vedanā, katamo vedanāsamudayo, katamo vedanānirodho, katamā vedanānirodhagāminī paṭipadā? Ko vedanāya assādo, ko ādīnavo, kiṃ nissaraṇanti? Tisso imā, ānanda, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā vuccanti, ānanda, vedanā. Phassasamudayā vedanāsamudayo; phassanirodhā vedanānirodho. Ayameva ariyo aṭṭhaṅgiko maggo vedanānirodhagāminī paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Yaṃ vedanaṃ paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ vedanāya assādo. Yā vedanā aniccā dukkhā vipariṇāmadhammā, ayaṃ vedanāya ādīnavo. Yo vedanāya chandarāgavinayo chandarāgappahānaṃ, idaṃ vedanāya nissaraṇaṃ. Atha kho panānanda, mayā anupubbasaṅkhārānaṃ nirodho akkhāto. Paṭhamaṃ jhānaṃ samāpannassa vācā niruddhā hoti…pe… saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca niruddhā honti. Khīṇāsavassa bhikkhuno rāgo niruddho hoti, doso niruddho hoti, moho niruddho hoti. Atha kho panānanda, mayā anupubbasaṅkhārānaṃ vūpasamo akkhāto. Paṭhamaṃ jhānaṃ samāpannassa vācā vūpasantā hoti…pe… saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca vūpasantā honti. Khīṇāsavassa bhikkhuno rāgo vūpasanto hoti, doso vūpasanto hoti, moho vūpasanto hoti. Atha kho panānanda, mayā anupubbasaṅkhārānaṃ paṭippassaddhi akkhātā. Paṭhamaṃ jhānaṃ samāpannassa vācā paṭippassaddhā hoti…pe… ākāsānañcāyatanaṃ samāpannassa rūpasaññā paṭippassaddhā hoti. Viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññā paṭippassaddhā hoti. Ākiñcaññāyatanaṃ samāpannassa viññāṇañcāyatanasaññā paṭippassaddhā hoti. Nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññā paṭippassaddhā hoti. Saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca paṭippassaddhā honti. Khīṇāsavassa bhikkhuno rāgo paṭippassaddho hoti, doso paṭippassaddho hoti, moho paṭippassaddho hotī’’ti. Pañcamaṃ.",
      "english": "Then, the Venerable Ananda approached the Blessed One. Having approached and sat down to one side, the Venerable Ananda said this to the Blessed One: \"What, venerable sir, is feeling? What is the origin of feeling? What is the cessation of feeling? What is the path leading to the cessation of feeling? What is the gratification in feeling? What is the danger in feeling? What is the escape from feeling?\"\n\n\"There are these three feelings, Ananda: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, Ananda, are called feelings. With the origin of contact comes the origin of feeling; with the cessation of contact comes the cessation of feeling. This Noble Eightfold Path itself is the path leading to the cessation of feeling, namely: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. That pleasant joy which arises in dependence on feeling, this is the gratification in feeling. That feeling is impermanent, unsatisfactory, and subject to change, this is the danger in feeling. The discipline of desire and lust for feeling, the abandonment of desire and lust for feeling, this is the escape from feeling.\"\n\n\"And Ananda, I have declared the cessation of successive fabrications. For one who has attained the first jhana, speech has ceased; for one who has attained the cessation of perception and feeling, perception and feeling have ceased. For a monk whose taints are destroyed, lust has ceased, hatred has ceased, delusion has ceased.\"\n\n\"And Ananda, I have declared the calming of successive fabrications. For one who has attained the first jhana, speech is calmed; for one who has attained the cessation of perception and feeling, perception and feeling are calmed. For a monk whose taints are destroyed, lust is calmed, hatred is calmed, delusion is calmed.\"\n\n\"And Ananda, I have declared the tranquilization of successive fabrications. For one who has attained the first jhana, speech is tranquilized; for one who has attained the sphere of infinite space, the perception of form is tranquilized. For one who has attained the sphere of infinite consciousness, the perception of the sphere of infinite space is tranquilized. For one who has attained the sphere of nothingness, the perception of the sphere of infinite consciousness is tranquilized. For one who has attained the sphere of neither perception nor non-perception, the perception of the sphere of nothingness is tranquilized. For one who has attained the cessation of perception and feeling, perception and feeling are tranquilized. For a monk whose taints are destroyed, lust is tranquilized, hatred is tranquilized, delusion is tranquilized.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹුණ සේක. එළඹ එකත්පස්ව වැඩසිටියේය. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"ස්වාමීනි, වේදනාව කවරේද? වේදනා සමුදය කවරේද? වේදනා නිරෝධය කවරේද? වේදනා නිරෝධයට පමුණුවන ප්‍රතිපදාව කවරේද? වේදනාවේ ආස්වාදය කවරේද? ආදීනවය කවරේද? නිස්සරණය කවරේද?\"\n\n\"ආනන්දය, මේ වේදනා තුනකි: සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව වශයෙනි. ආනන්දය, මේවා වේදනා යැයි කියනු ලැබේ. ඵස්සය හෙවත් ස්පර්ශය ඇතිවීමෙන් වේදනා සමුදය වේ. ඵස්සය හෙවත් ස්පර්ශය නිරුද්ධවීමෙන් වේදනා නිරෝධය වේ. වේදනා නිරෝධයට පමුණුවන ප්‍රතිපදාව නම් මේ ආර්ය අෂ්ටාංගික මාර්ගයමයි. එනම්, සම්මාදිට්ඨිය... ආදී වශයෙන් සම්මාසමාධිය තෙක් වේ. යම් වේදනාවක් මුල් කරගෙන සුවයක් හා සතුටක් උපදීද, මෙය වේදනාවේ ආස්වාදයයි. යම් වේදනාවක් අනිත්‍ය නම්, දුක්ඛ නම්, විපරිනාම වන ස්වභාවයෙන් යුක්ත නම්, මෙය වේදනාවේ ආදීනවයයි. වේදනාව කෙරෙහි යම් ඡන්දරාගය දුරු කිරීමක්, ඡන්දරාගය ප්‍රහාණය කිරීමක් වේද, මෙය වේදනාවේ නිස්සරණයයි.\"\n\n\"ආනන්දය, ම විසින් අනුපූර්ව සංස්කාරයන්ගේ නිරෝධය දේශනා කරන ලදී. පළමු ධ්‍යානයට සමවැදුණහුගේ වචන සංස්කාරය නිරුද්ධ වේ... ආදී වශයෙන් සංඥා වේදයිත නිරෝධයට සමවැදුණහුගේ සංඥාව හා වේදනාව නිරුද්ධ වේ. ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය නිරුද්ධ වේ, ද්වේෂය නිරුද්ධ වේ, මෝහය නිරුද්ධ වේ.\"\n\n\"ආනන්දය, ම විසින් අනුපූර්ව සංස්කාරයන්ගේ වූපශමය දේශනා කරන ලදී. පළමු ධ්‍යානයට සමවැදුණහුගේ වචන සංස්කාරය වූපශාන්ත වේ... ආදී වශයෙන් සංඥා වේදයිත නිරෝධයට සමවැදුණහුගේ සංඥාව හා වේදනාව වූපශාන්ත වේ. ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය වූපශාන්ත වේ, ද්වේෂය වූපශාන්ත වේ, මෝහය වූපශාන්ත වේ.\"\n\n\"ආනන්දය, ම විසින් අනුපූර්ව සංස්කාරයන්ගේ ප්‍රතිප්‍රශ්‍රබ්ධිය දේශනා කරන ලදී. පළමු ධ්‍යානයට සමවැදුණහුගේ වචන සංස්කාරය ප්‍රතිප්‍රශ්‍රබ්ධ වේ... ආදී වශයෙන් ආකාසානඤ්චායතනයට සමවැදුණහුගේ රූප සංඥාව ප්‍රතිප්‍රශ්‍රබ්ධ වේ. විඤ්ඤාණඤ්චායතනයට සමවැදුණහුගේ ආකාසානඤ්චායතන සංඥාව ප්‍රතිප්‍රශ්‍රබ්ධ වේ. ආකිංචඤ්ඤායතනයට සමවැදුණහුගේ විඤ්ඤාණඤ්චායතන සංඥාව ප්‍රතිප්‍රශ්‍රබ්ධ වේ. නේවසඤ්ඤානාසඤ්ඤායතනයට සමවැදුණහුගේ ආකිංචඤ්ඤායතන සංඥාව ප්‍රතිප්‍රශ්‍රබ්ධ වේ. සංඥා වේදයිත නිරෝධයට සමවැදුණහුගේ සංඥාව හා වේදනාව ප්‍රතිප්‍රශ්‍රබ්ධ වේ. ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය ප්‍රතිප්‍රශ්‍රබ්ධ වේ, ද්වේෂය ප්‍රතිප්‍රශ්‍රබ්ධ වේ, මෝහය ප්‍රතිප්‍රශ්‍රබ්ධ වේ යැයි.\"",
      "paliTitle": "Paṭhamaānandasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 264,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘katamā nu kho, ānanda, vedanā, katamo vedanāsamudayo, katamo vedanānirodho, katamā vedanānirodhagāminī paṭipadā? Ko vedanāya assādo, ko ādīnavo, kiṃ nissaraṇa’’nti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavannettikā bhagavampaṭisaraṇā. Sādhu, bhante, bhagavantaññeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, ānanda, suṇohi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca – ‘‘tisso imā, ānanda, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā vuccanti, ānanda, vedanā…pe… phassasamudayā…pe… khīṇāsavassa bhikkhuno rāgo paṭippassaddho hoti, doso paṭippassaddho hoti, moho paṭippassaddho hotī’’ti. Chaṭṭhaṃ.",
      "english": "Then indeed, the Venerable Ānanda approached the Blessed One, and having approached and paid homage, sat down to one side. To the Venerable Ānanda, thus seated to one side, the Blessed One spoke this: \"What, Ānanda, is feeling? What is the origin of feeling? What is the cessation of feeling? What is the path leading to the cessation of feeling? What is the gratification in feeling? What is the danger in feeling? What is the escape from feeling?\"\n\n\"Venerable sir, for us, these teachings have the Blessed One as their root, the Blessed One as their guide, and the Blessed One as their refuge. It would be excellent, venerable sir, if the Blessed One himself would elucidate the meaning of this statement. Having heard it from the Blessed One, the monastics will bear it in mind.\"\n\n\"In that case, Ānanda, listen and pay careful attention; I shall speak.\"\n\n\"Yes, venerable sir,\" replied the Venerable Ānanda to the Blessed One.\n\nThe Blessed One spoke this: \"These three, Ānanda, are feelings: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, Ānanda, are called feelings. The origin of feeling is due to the origin of contact; the cessation of feeling is due to the cessation of contact. The path leading to the cessation of feeling is precisely the Noble Eightfold Path—namely, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. The gratification in feeling is the pleasure and joy that arise dependent on feeling. The danger in feeling is that feeling is impermanent, unsatisfactory, and subject to change. The escape from feeling is the removal and abandoning of desire and craving for feeling. For a monastic whose defilements are destroyed, lust is fully quelled, hatred is fully quelled, and delusion is fully quelled.\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹුණු සේක. එළඹී, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වැඩසිටි සේක. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “ආනන්දයෙනි, වේදනාව යනු කවරේද? වේදනාවේ හටගැනීම කවරේද? වේදනාවේ නිරෝධය කවරේද? වේදනාවේ නිරෝධයට පමුණුවන ප‍්‍රතිපදාව කවරේද? වේදනාවේ ආශ්වාදය කවරේද? ආදීනවය කවරේද? නිස්සරණය කවරේද?”\n\n“ස්වාමීනි, ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ; භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ; භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. ස්වාමීනි, ඒ කාරණයෙහි අර්ථය භාග්‍යවතුන් වහන්සේටම වැටහේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහුය.”\n\n“එසේ වී නම්, ආනන්දයෙනි, අසන්න, මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.”\n\n“එසේය, ස්වාමීනි” යැයි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන් සේක. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “ආනන්දයෙනි, මේ වේදනා තුනකි – සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව – ආනන්දයෙනි, මේවා වේදනා යැයි කියනු ලැබේ… ස්පර්ශය හටගැනීමෙන් වේදනාව හටගනී… ක්ෂීණාශ‍්‍රව භික්ෂුවකගේ රාගය සංසිඳී ඇත, ද්වේෂය සංසිඳී ඇත, මෝහය සංසිඳී ඇත.”\n\nහයවැනි සූත්‍රය.",
      "paliTitle": "Dutiyaānandasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 265,
      "pali": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘katamā nu kho, bhante, vedanā, katamo vedanāsamudayo, katamo vedanānirodho, katamā vedanānirodhagāminī paṭipadā? Ko vedanāya assādo, ko ādīnavo, kiṃ nissaraṇa’’nti? ‘‘Tisso imā, bhikkhave, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā vuccanti, bhikkhave, vedanā. Phassasamudayā vedanāsamudayo; phassanirodhā vedanānirodho. Ayameva ariyo aṭṭhaṅgiko maggo vedanānirodhagāminī paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Yaṃ vedanaṃ paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ vedanāya assādo. Yā vedanā aniccā dukkhā vipariṇāmadhammā, ayaṃ vedanāya ādīnavo. Yo vedanāya chandarāgavinayo chandarāgappahānaṃ, idaṃ vedanāya nissaraṇaṃ. ‘‘Atha kho pana, bhikkhave, mayā anupubbasaṅkhārānaṃ nirodho akkhāto. Paṭhamaṃ jhānaṃ samāpannassa vācā niruddhā hoti…pe… khīṇāsavassa bhikkhuno rāgo niruddho hoti, doso niruddho hoti, moho niruddho hoti. Atha kho pana, bhikkhave, mayā anupubbasaṅkhārānaṃ vūpasamo akkhāto. Paṭhamaṃ jhānaṃ samāpannassa vācā vūpasantā hoti…pe… khīṇāsavassa bhikkhuno rāgo vūpasanto hoti, doso vūpasanto hoti, moho vūpasanto hoti. Chayimā, bhikkhave, passaddhiyo. Paṭhamaṃ jhānaṃ samāpannassa vācā paṭippassaddhā hoti. Dutiyaṃ jhānaṃ samāpannassa vitakkavicārā paṭippassaddhā honti. Tatiyaṃ jhānaṃ samāpannassa pīti paṭippassaddhā hoti. Catutthaṃ jhānaṃ samāpannassa assāsapassāsā paṭippassaddhā honti. Saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca paṭippassaddhā honti. Khīṇāsavassa bhikkhuno rāgo paṭippassaddho hoti, doso paṭippassaddho hoti, moho paṭippassaddho hotī’’ti. Sattamaṃ.",
      "english": "Then many bhikkhus approached the Blessed One. Having approached, they bowed to the Blessed One and sat down to one side. Seated to one side, those bhikkhus said to the Blessed One: \"What, Venerable Sir, is feeling? What is the origin of feeling? What is the cessation of feeling? What is the path leading to the cessation of feeling? What is the gratification in feeling? What is the danger in feeling? What is the escape from feeling?\"\n\n\"Monks, there are these three feelings: pleasant feeling, painful feeling, and neither-pleasant-nor-painful feeling. These, monks, are called feelings. With the origin of contact comes the origin of feeling; with the cessation of contact comes the cessation of feeling. This Noble Eightfold Path itself is the path leading to the cessation of feeling, namely: right view… to right concentration. That pleasure and joy which arises dependent on feeling is the gratification in feeling. That feeling which is impermanent, unsatisfactory, and subject to change is the danger in feeling. The subduing of desire and passion for feeling, the abandoning of desire and passion for feeling, this is the escape from feeling.\n\n\"Furthermore, monks, I have declared the cessation of successive formations. For one who has attained the first jhana, speech has ceased… for a bhikkhu whose taints are destroyed, lust has ceased, hatred has ceased, delusion has ceased.\n\n\"Furthermore, monks, I have declared the tranquilization of successive formations. For one who has attained the first jhana, speech is tranquilized… for a bhikkhu whose taints are destroyed, lust is tranquilized, hatred is tranquilized, delusion is tranquilized.\n\n\"Monks, there are these six tranquilizations. For one who has attained the first jhana, speech is fully tranquilized. For one who has attained the second jhana, thought and examination are fully tranquilized. For one who has attained the third jhana, rapture is fully tranquilized. For one who has attained the fourth jhana, in-breaths and out-breaths are fully tranquilized. For one who has attained the cessation of perception and feeling, perception and feeling are fully tranquilized. For a bhikkhu whose taints are destroyed, lust is fully tranquilized, hatred is fully tranquilized, delusion is fully tranquilized.\"",
      "sinhala": "එවිට බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: “වහන්ස, වේදනාව යනු කවරේද? වේදනා සමුදය යනු කවරේද? වේදනා නිරෝධය යනු කවරේද? වේදනා නිරෝධයට ගාමී ප්‍රතිපදාව යනු කවරේද? වේදනාවේ ආශ්වාදය යනු කවරේද? ආදීනවය යනු කවරේද? නිස්සරණය යනු කවරේද?”\n\n“මහණෙනි, මේ වේදනා තුනකි. එනම්, සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාවයි. මහණෙනි, මේවා වේදනා යයි කියනු ලැබේ. ස්පර්ශයේ හටගැනීමෙන් වේදනාව හටගනී; ස්පර්ශයේ නිරෝධයෙන් වේදනාව නිරුද්ධ වේ. මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේදනා නිරෝධයට ගාමී ප්‍රතිපදාවයි. එනම්, සම්මා දිට්ඨියෙන් ආරම්භ වී සම්මා සමාධිය දක්වා වූ මාර්ගයයි. යම් වේදනාවක් අරභයා සැපයක් හෝ සෝමනස්සයක් උපදීද, මෙය වේදනාවේ ආශ්වාදයයි. යම් වේදනාවක් අනිත්‍ය වූ, දුක්ඛ වූ, විපරිණාම ධර්මයක් වේද, මෙය වේදනාවේ ආදීනවයයි. යම් වේදනාවක් කෙරෙහි ඇති ඡන්දරාගය හික්මවීම ද, ඡන්දරාගය ප්‍රහාණය කිරීම ද, මෙය වේදනාවෙන් නිස්සරණයයි.\n\n“මහණෙනි, තවද මා විසින් අනුපූර්ව සංඛාරයන්ගේ නිරෝධය දේශනා කරන ලදී. පළමු ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ වචනය නිරුද්ධ වී ඇත. මෙසේ, ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය නිරුද්ධ වී ඇත, ද්වේෂය නිරුද්ධ වී ඇත, මෝහය නිරුද්ධ වී ඇත.\n\n“මහණෙනි, තවද මා විසින් අනුපූර්ව සංඛාරයන්ගේ උපශමනය දේශනා කරන ලදී. පළමු ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ වචනය උපශාන්ත වී ඇත. මෙසේ, ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය උපශාන්ත වී ඇත, ද්වේෂය උපශාන්ත වී ඇත, මෝහය උපශාන්ත වී ඇත.\n\n“මහණෙනි, මේ ප්‍රශ්‍රබ්ධීන් සයකි. පළමු ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ වචනය ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත. දෙවන ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ විතර්ක විචාර ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත. තෙවන ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ප්‍රීතිය ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත. සිව්වන ධ්‍යානයට සමවැදුණු පුද්ගලයාගේ ආශ්වාස ප්‍රශ්වාස ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත. සඤ්ඤා වේදයිත නිරෝධයට සමවැදුණු පුද්ගලයාගේ සඤ්ඤාව ද වේදනාව ද ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත. ක්ෂීණාශ්‍රව භික්ෂුවකගේ රාගය ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත, ද්වේෂය ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත, මෝහය ප්‍රතිප්‍රශ්‍රබ්ධ වී ඇත.”",
      "paliTitle": "Paṭhamasambahulasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 266,
      "pali": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu…pe… ekamantaṃ nisinnā kho te bhikkhū bhagavā etadavoca – ‘‘katamā nu kho, bhikkhave, vedanā, katamo vedanāsamudayo, katamo vedanānirodho, katamā vedanānirodhagāminī paṭipadā? Ko vedanāya assādo, ko ādīnavo, kiṃ nissaraṇa’’nti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā…pe…’’ ‘‘tisso imā, bhikkhave, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā vuccanti, bhikkhave, vedanā…pe… phassasamudayā…pe…. (Yathā purimasuttante, tathā vitthāretabbo.) Aṭṭhamaṃ.",
      "english": "Then many bhikkhus approached the Blessed One, paid homage, and sat down to one side. Seated thus, the Blessed One addressed them: \"What, bhikkhus, is feeling? What is the origin of feeling? What is the cessation of feeling? What is the path leading to the cessation of feeling? What is the gratification in feeling? What is the danger in feeling? What is the escape from feeling?\"\n\n\"Venerable Sir, our teachings are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as their refuge. It would be excellent if the Blessed One would explain the meaning of these statements. Having heard it from the Blessed One, the bhikkhus will bear it in mind.\"\n\n\"There are these three feelings, bhikkhus: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, bhikkhus, are called feelings. With the origination of contact comes the origination of feeling. With the cessation of contact comes the cessation of feeling. The path leading to the cessation of feeling is just this Noble Eightfold Path: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. The gratification in feeling is the pleasure and joy that arises in dependence on feeling. The danger in feeling is that it is impermanent, subject to suffering, and liable to change. The escape from feeling is the removal and abandonment of desire and lust for feeling.\"",
      "sinhala": "එවිට බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩහුන් ඒ භික්ෂූන් වහන්සේලාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“මහණෙනි, වේදනාව කවරී ද? වේදනා සමුදය කවරේ ද? වේදනා නිරෝධය කවරේ ද? වේදනා නිරෝධගාමිනී ප්‍රතිපදාව කවරී ද? වේදනාවේ ආස්වාදය කවරේ ද? වේදනාවේ ආදීනවය කවරේ ද? වේදනාවෙන් නිස්සරණය කවරේ දැ”යි වදාළ සේක.\n\n“ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. ස්වාමීනි, මේ වදාළ දෙයෙහි අර්ථය භාග්‍යවතුන් වහන්සේට ම පහළ වේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූන් වහන්සේලා එය ධාරණය කරගන්නවා ඇතැ”යි කීහ.\n\n“මහණෙනි, මේ වේදනා තුනකි. එනම්, සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව යි. මහණෙනි, මේවා වේදනා යැයි කියනු ලැබේ.\n\nවේදනාවේ සමුදය (හටගැනීම) නම්, ස්පර්ශයේ සමුදය (හටගැනීම) යි.\nවේදනාවේ නිරෝධය (නැතිකිරීම) නම්, ස්පර්ශයේ නිරෝධය (නැතිකිරීම) යි.\nවේදනා නිරෝධගාමිනී ප්‍රතිපදාව නම්, සම්‍යක් දෘෂ්ටිය, සම්‍යක් සංකල්පය, සම්‍යක් වචනය, සම්‍යක් කර්මාන්තය, සම්‍යක් ආජීවය, සම්‍යක් ව්‍යායාමය, සම්‍යක් ස්මෘතිය, සම්‍යක් සමාධිය යන ආර්ය අෂ්ටාංගික මාර්ගය ම යි.\n\nමහණෙනි, වේදනාව හේතු කොටගෙන යම් සුවයක් හෝ සෝමනස්සයක් උපදී ද, මෙය වේදනාවේ ආස්වාදය යි.\nමහණෙනි, වේදනාව අනිත්‍ය, දුක්ඛ, විපරිණාම ධර්මයක් වීම, මෙය වේදනාවේ ආදීනවය යි.\nමහණෙනි, වේදනාව කෙරෙහි යම් ඡන්ද රාගයක් දුරුකිරීමක්, ඡන්ද රාගය අත්හැරීමක් වේ ද, මෙය වේදනාවෙන් නිස්සරණය යි.”",
      "paliTitle": "Dutiyasambahulasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 267,
      "pali": "Atha kho pañcakaṅgo thapati yenāyasmā udāyī tenupasaṅkami; upasaṅkamitvā āyasmantaṃ udāyiṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho pañcakaṅgo thapati āyasmantaṃ udāyiṃ etadavoca – ‘‘kati nu kho, bhante udāyi, vedanā vuttā bhagavatā’’ti? ‘‘Tisso kho, thapati, vedanā vuttā bhagavatā. Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, thapati, tisso vedanā vuttā bhagavatā’’ti. Evaṃ vutte, pañcakaṅgo thapati āyasmantaṃ udāyiṃ etadavoca – ‘‘na kho, bhante udāyi, tisso vedanā vuttā bhagavatā. Dve vedanā vuttā bhagavatā – sukhā vedanā, dukkhā vedanā. Yāyaṃ, bhante, adukkhamasukhā vedanā, santasmiṃ esā paṇīte sukhe vuttā bhagavatā’’ti. Dutiyampi kho āyasmā udāyī pañcakaṅgaṃ thapatiṃ etadavoca – ‘‘na kho, thapati, dve vedanā vuttā bhagavatā. Tisso vedanā vuttā bhagavatā. Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā tisso vedanā vuttā bhagavatā’’ti. Dutiyampi kho pañcakaṅgo thapati āyasmantaṃ udāyiṃ etadavoca – ‘‘na kho, bhante udāyi, tisso vedanā vuttā bhagavatā. Dve vedanā vuttā bhagavatā – sukhā vedanā, dukkhā vedanā. Yāyaṃ, bhante, adukkhamasukhā vedanā, santasmiṃ esā paṇīte sukhe vuttā bhagavatā’’ti. Tatiyampi kho āyasmā udāyī pañcakaṅgaṃ thapatiṃ etadavoca – ‘‘na kho, thapati, dve vedanā vuttā bhagavatā. Tisso vedanā vuttā bhagavatā. Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā tisso vedanā vuttā bhagavatā’’ti. Tatiyampi kho pañcakaṅgo thapati āyasmantaṃ udāyiṃ etadavoca – ‘‘na kho, bhante udāyi, tisso vedanā vuttā bhagavatā. Dve vedanā vuttā bhagavatā – sukhā vedanā, dukkhā vedanā. Yāyaṃ, bhante, adukkhamasukhā vedanā, santasmiṃ esā paṇīte sukhe vuttā bhagavatā’’ti. Neva sakkhi āyasmā udāyī pañcakaṅgaṃ thapatiṃ saññāpetuṃ, na panāsakkhi pañcakaṅgo thapati āyasmantaṃ udāyiṃ saññāpetuṃ. Assosi kho āyasmā ānando āyasmato udāyissa pañcakaṅgena thapatinā saddhiṃ imaṃ kathāsallāpaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando yāvatako āyasmato udāyissa pañcakaṅgena thapatinā saddhiṃ ahosi kathāsallāpo taṃ sabbaṃ bhagavato ārocesi. ‘‘Santameva, ānanda, pariyāyaṃ pañcakaṅgo thapati udāyissa bhikkhuno nābbhanumodi; santañca panānanda, pariyāyaṃ udāyī bhikkhu pañcakaṅgassa thapatino nābbhanumodi. Dvepi mayā, ānanda, vedanā vuttā pariyāyena. Tissopi mayā vedanā vuttā pariyāyena. Pañcapi mayā vedanā vuttā pariyāyena. Chapi mayā vedanā vuttā pariyāyena. Aṭṭhārasāpi mayā vedanā vuttā pariyāyena. Chattiṃsāpi mayā vedanā vuttā pariyāyena. Aṭṭhasatampmppi mayā vedanā vuttā pariyāyena. Evaṃ pariyāyadesito kho, ānanda, mayā dhammo. Evaṃ pariyāyadesite kho, ānanda, mayā dhamme ye aññamaññassa subhāsitaṃ sulapitaṃ, na samanumaññissanti, na samanujānissanti, na samanumodissanti, tesaṃ etaṃ pāṭikaṅkhaṃ – bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharissantīti [viharissanti (sī. pī. ka.)]. Evaṃ pariyāyadesito kho, ānanda, mayā dhammo. Evaṃ pariyāyadesite kho, ānanda, mayā dhamme ye aññamaññassa subhāsitaṃ sulapitaṃ samanumaññissanti samanujānissanti samanumodissanti, tesaṃ etaṃ pāṭikaṅkhaṃ – samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharissantī’’ti. ‘‘Pañcime, ānanda, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā…pe… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Ime kho, ānanda, pañca kāmaguṇā. Yaṃ kho, ānanda, ime pañca kāmaguṇe paṭicca uppajjati sukhaṃ somanassaṃ – idaṃ vuccati kāmasukhaṃ. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu, vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso rūpasaññānaṃ samatikkamā, paṭighasaññānaṃ atthaṅgamā, nānattasaññānaṃ amanasikārā, ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma, ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma, ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. Ye kho, ānanda, evaṃ vadeyyuṃ – ‘etaṃparamaṃ santaṃ sukhaṃ somanassaṃ paṭisaṃvedentī’ti – idaṃ nesāhaṃ nānujānāmi. Taṃ kissa hetu? Atthānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Katamañcānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca? Idhānanda, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati. Idaṃ kho, ānanda, etamhā sukhā aññaṃ sukhaṃ abhikkantatarañca paṇītatarañca. ‘‘Ṭhānaṃ kho panetaṃ, ānanda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘saññāvedayitanirodhaṃ samaṇo gotamo āha, tañca sukhasmiṃ paññapeti. Tayidaṃ kiṃsu, tayidaṃ kathaṃsū’ti? Evaṃvādino, ānanda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘na kho, āvuso, bhagavā sukhaññeva vedanaṃ sandhāya sukhasmiṃ paññapeti. Yattha yattha, āvuso, sukhaṃ upalabbhati, yahiṃ yahiṃ [yaṃ hiyaṃ hi sukhaṃ (sī. pī.), yahiṃ yahiṃ sukhaṃ (syā. kaṃ. ka.) ma. ni. 2.91], taṃ taṃ tathāgato sukhasmiṃ paññapetī’’’ti. Navamaṃ.",
      "english": "Then the householder Pañcakaṅga went to the Venerable Udāyī. Having approached, he greeted the Venerable Udāyī and sat down to one side. As he sat to one side, the householder Pañcakaṅga said to the Venerable Udāyī: \"Venerable Udāyī, how many feelings have been declared by the Blessed One?\"\n\n\"Householder, three feelings have been declared by the Blessed One: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, householder, are the three feelings declared by the Blessed One.\"\n\nWhen this was said, the householder Pañcakaṅga said to the Venerable Udāyī: \"Venerable Udāyī, not three feelings have been declared by the Blessed One. Two feelings have been declared by the Blessed One: pleasant feeling and painful feeling. As for that, Venerable, which is neither-painful-nor-pleasant feeling, it has been declared by the Blessed One as a peaceful, refined pleasantness.\"\n\nA second time, the Venerable Udāyī said to the householder Pañcakaṅga: \"Householder, not two feelings have been declared by the Blessed One. Three feelings have been declared by the Blessed One: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These are the three feelings declared by the Blessed One.\"\n\nA second time, the householder Pañcakaṅga said to the Venerable Udāyī: \"Venerable Udāyī, not three feelings have been declared by the Blessed One. Two feelings have been declared by the Blessed One: pleasant feeling and painful feeling. As for that, Venerable, which is neither-painful-nor-pleasant feeling, it has been declared by the Blessed One as a peaceful, refined pleasantness.\"\n\nA third time, the Venerable Udāyī said to the householder Pañcakaṅga: \"Householder, not two feelings have been declared by the Blessed One. Three feelings have been declared by the Blessed One: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These are the three feelings declared by the Blessed One.\"\n\nA third time, the householder Pañcakaṅga said to the Venerable Udāyī: \"Venerable Udāyī, not three feelings have been declared by the Blessed One. Two feelings have been declared by the Blessed One: pleasant feeling and painful feeling. As for that, Venerable, which is neither-painful-nor-pleasant feeling, it has been declared by the Blessed One as a peaceful, refined pleasantness.\"\n\nThe Venerable Udāyī was unable to convince the householder Pañcakaṅga, nor was the householder Pañcakaṅga able to convince the Venerable Udāyī.\n\nNow the Venerable Ānanda overheard this conversation between the Venerable Udāyī and the householder Pañcakaṅga. Then the Venerable Ānanda went to the Blessed One. Having approached, he sat down to one side. As he sat to one side, the Venerable Ānanda reported to the Blessed One the entire conversation that had taken place between the Venerable Udāyī and the householder Pañcakaṅga.\n\n\"Ānanda, it is indeed fitting that the householder Pañcakaṅga did not approve of the bhikkhu Udāyī's exposition, and it is indeed fitting, Ānanda, that the bhikkhu Udāyī did not approve of the householder Pañcakaṅga's exposition. Ānanda, I have declared feelings in terms of two categories. I have declared feelings in terms of three categories. I have declared feelings in terms of five categories. I have declared feelings in terms of six categories. I have declared feelings in terms of eighteen categories. I have declared feelings in terms of thirty-six categories. I have declared feelings in terms of one hundred and eight categories. Thus, Ānanda, the Dhamma has been taught by me with these various classifications. In this Dhamma taught by me with various classifications, those who do not approve, do not accept, and do not rejoice in what is well-spoken and well-expressed by others – for them, this is to be expected: they will live in contention, strife, and dispute, piercing one another with the darts of their mouths.\"\n\n\"Ānanda, the Dhamma has been taught by me with these various classifications. In this Dhamma taught by me with various classifications, those who do approve, do accept, and do rejoice in what is well-spoken and well-expressed by others – for them, this is to be expected: they will live in harmony, delighting in one another, without dispute, mingled like milk and water, regarding each other with affectionate eyes.\"\n\n\"Ānanda, there are these five cords of sensual pleasure. Which five? Forms cognizable by the eye that are desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; sounds cognizable by the ear that are desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; odors cognizable by the nose that are desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; flavors cognizable by the tongue that are desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; and tangible objects cognizable by the body that are desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing. These, Ānanda, are the five cords of sensual pleasure. Ānanda, the pleasure and happiness that arise dependent on these five cords of sensual pleasure – this is called sensual pleasure. Ānanda, if anyone should say, 'This is the supreme peaceful pleasure and happiness that one experiences' – I do not approve of that. Why is that? Because, Ānanda, there is another pleasure, superior and more refined than this pleasure.\"\n\n\"And what, Ānanda, is that other pleasure, superior and more refined than this pleasure? Here, Ānanda, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and remains in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and pleasure. This, Ānanda, is that other pleasure, superior and more refined than that pleasure.\"\n\nIndeed, Ānanda, if anyone were to say, ‘This experience of peaceful happiness and mental joy is the ultimate,’ I do not endorse that. Why is that? Ānanda, there is another happiness, more distinguished and more sublime than this happiness. And what, Ānanda, is that other happiness that is more distinguished and more sublime than this happiness? Here, Ānanda, a monk, with the stilling of initial thought and sustained thought, with internal serenity and unification of mind, enters and abides in the second jhāna, which is without initial thought and sustained thought, born of concentration, and filled with rapture and happiness. Indeed, Ānanda, this happiness is another happiness that is more distinguished and more sublime than that earlier happiness. Indeed, Ānanda, if anyone were to say, ‘This experience of peaceful happiness and mental joy is the ultimate,’ I do not endorse that. Why is that? Ānanda, there is another happiness, more distinguished and more sublime than this happiness. And what, Ānanda, is that other happiness that is more distinguished and more sublime than this happiness? Here, Ānanda, a monk, with the fading of rapture, abides in equanimity, mindful and clearly comprehending, and experiences happiness with the body—that state of which the Noble Ones declare, ‘He is equanimous, mindful, and dwells happily’—enters and abides in the third jhāna. Indeed, Ānanda, this happiness is another happiness that is more distinguished and more sublime than that earlier happiness. Indeed, Ānanda, if anyone were to say, ‘This experience of peaceful happiness and mental joy is the ultimate,’ I do not endorse that. Why is that? Ānanda, there is another happiness, more distinguished and more sublime than this happiness. And what, Ānanda, is that other happiness that is more distinguished and more sublime than this happiness? Here, Ānanda, a monk, with the abandoning of pleasure and pain, and with the prior disappearance of mental joy and sorrow, enters and abides in the fourth jhāna, which is beyond pleasure and pain, and is purified by equanimity and mindfulness. Indeed, Ānanda, this happiness is another happiness that is more distinguished and more sublime than that earlier happiness. Indeed, Ānanda, if anyone were to say, ‘This experience of peaceful happiness and mental joy is the ultimate,’ I do not endorse that. Why is that? Ānanda, there is another happiness, more distinguished and more sublime than this happiness. And what, Ānanda, is that other happiness that is more distinguished and more sublime than this happiness? Here, Ānanda, a monk, by completely surmounting perceptions of form, with the disappearance of perceptions of sensory impingement, and by not attending to perceptions of diversity, perceiving ‘space is infinite,’ enters and abides in the dimension of infinite space. Indeed, Ānanda, this happiness is another happiness that is more distinguished and more sublime than that earlier happiness. Indeed, Ānanda, if anyone were to say, ‘This experience of peaceful happiness and mental joy is the ultimate,’ I do not endorse that. Why is that? Ānanda, there is another happiness, more distinguished and more sublime than this happiness. And what, Ānanda, is that other happiness that is more distinguished and more sublime than this happiness? Here, Ānanda, a monk, by completely surmounting the dimension of infinite space, perceiving ‘consciousness is infinite,’ enters and abides in the dimension of infinite consciousness. Indeed, Ānanda, this happiness is another happiness that is more distinguished and more sublime than that earlier happiness. Indeed, Ānanda, if anyone were to say, ‘This experience of peaceful happiness and mental joy is the ultimate,’ I do not endorse that. Why is that? Ānanda, there is another happiness, more distinguished and more sublime than this happiness. And what, Ānanda, is that other happiness that is more distinguished and more sublime than this happiness? Here, Ānanda, a monk, by completely surmounting the dimension of infinite consciousness, perceiving ‘there is nothing,’ enters and abides in the dimension of nothingness. Indeed, Ānanda, this happiness is another happiness that is more distinguished and more sublime than that earlier happiness. Indeed, Ānanda, if anyone were to say, ‘This experience of peaceful happiness and mental joy is the ultimate,’ I do not endorse that. Why is that? Ānanda, there is another happiness, more distinguished and more sublime than this happiness. And what, Ānanda, is that other happiness that is more distinguished and more sublime than this happiness? Here, Ānanda, a monk, by completely surmounting the dimension of nothingness, enters and abides in the dimension of neither perception nor non-perception. Indeed, Ānanda, this happiness is another happiness that is more distinguished and more sublime than that earlier happiness. Here, Ānanda, a monk, by completely surmounting the dimension of neither perception nor non-perception, enters and abides in the cessation of perception and feeling.\n\nIndeed, Ānanda, another happiness, distinct from this happiness, is more excellent and more sublime. It is possible, Ānanda, that wanderers of other sects might speak thus: 'The ascetic Gotama declares the cessation of perception and feeling, and he designates it as happiness. What is this, and how can this be so?' Ananda, if wanderers of other sects speak in this way, they should be told: 'Friends, the Blessed One does not designate happiness solely by referring to pleasant feeling. Wherever happiness is found, wherever happiness is experienced, that the Tathāgata designates as happiness.'",
      "sinhala": "එවිට පස්වකංග සිටුවරයා ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ වෙත පැමිණියේය. පැමිණ ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට වැඳ එකත්පසෙක වාඩිවිය. එකත්පසෙක වාඩි වූ පස්වකංග සිටුවරයා ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: “පින්වත් උදායි ස්ථවිරයන් වහන්ස, වේදනා කීයක් භාග්‍යවතුන් වහන්සේ විසින් දේශනා කර ඇත්ද?” “සිටුවරය, භාග්‍යවතුන් වහන්සේ විසින් ත්‍රිවිධ වේදනාවෝ දේශනා කර ඇත. එනම්, සැප වේදනාව, දුක් වේදනාව, සහ දුක්‌නොවන-සැප‌නොවන වේදනාවයි. සිටුවරය, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද්දේ මේ ත්‍රිවිධ වේදනාවෝය.” මෙසේ පැවසූ කල්හි, පස්වකංග සිටුවරයා ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: “පින්වත් උදායි ස්ථවිරයන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ත්‍රිවිධ වේදනාවෝ දේශනා කර නැත. භාග්‍යවතුන් වහන්සේ විසින් ද්විවිධ වේදනාවෝ දේශනා කර ඇත. එනම්, සැප වේදනාව සහ දුක් වේදනාවයි. පින්වත්නි, මේ දුක්‌නොවන-සැප‌නොවන වේදනාව, භාග්‍යවතුන් වහන්සේ විසින් ප්‍රණීත වූ සැපයෙහිලා දේශනා කර ඇත.” දෙවෙනි වරටත් ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ පස්වකංග සිටුවරයාට මෙසේ කීවේය: “සිටුවරය, භාග්‍යවතුන් වහන්සේ විසින් ද්විවිධ වේදනාවෝ දේශනා කර නැත. භාග්‍යවතුන් වහන්සේ විසින් ත්‍රිවිධ වේදනාවෝ දේශනා කර ඇත. එනම්, සැප වේදනාව, දුක් වේදනාව, සහ දුක්‌නොවන-සැප‌නොවන වේදනාවයි. භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද්දේ මේ ත්‍රිවිධ වේදනාවෝය.” දෙවෙනි වරටත් පස්වකංග සිටුවරයා ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: “පින්වත් උදායි ස්ථවිරයන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ත්‍රිවිධ වේදනාවෝ දේශනා කර නැත. භාග්‍යවතුන් වහන්සේ විසින් ද්විවිධ වේදනාවෝ දේශනා කර ඇත. එනම්, සැප වේදනාව සහ දුක් වේදනාවයි. පින්වත්නි, මේ දුක්‌නොවන-සැප‌නොවන වේදනාව, භාග්‍යවතුන් වහන්සේ විසින් ප්‍රණීත වූ සැපයෙහිලා දේශනා කර ඇත.” තුන්වෙනි වරටත් ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ පස්වකංග සිටුවරයාට මෙසේ කීවේය: “සිටුවරය, භාග්‍යවතුන් වහන්සේ විසින් ද්විවිධ වේදනාවෝ දේශනා කර නැත. භාග්‍යවතුන් වහන්සේ විසින් ත්‍රිවිධ වේදනාවෝ දේශනා කර ඇත. එනම්, සැප වේදනාව, දුක් වේදනාව, සහ දුක්‌නොවන-සැප‌නොවන වේදනාවයි. භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද්දේ මේ ත්‍රිවිධ වේදනාවෝය.” තුන්වෙනි වරටත් පස්වකංග සිටුවරයා ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: “පින්වත් උදායි ස්ථවිරයන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ත්‍රිවිධ වේදනාවෝ දේශනා කර නැත. භාග්‍යවතුන් වහන්සේ විසින් ද්විවිධ වේදනාවෝ දේශනා කර ඇත. එනම්, සැප වේදනාව සහ දුක් වේදනාවයි. පින්වත්නි, මේ දුක්‌නොවන-සැප‌නොවන වේදනාව, භාග්‍යවතුන් වහන්සේ විසින් ප්‍රණීත වූ සැපයෙහිලා දේශනා කර ඇත.” ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට පස්වකංග සිටුවරයාට ඒත්තු ගැන්වීමට නොහැකි විය. පස්වකංග සිටුවරයාට ද ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට ඒත්තු ගැන්වීමට නොහැකි විය.\n\nආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ සහ පස්වකංග සිටුවරයා අතර වූ මේ කථාසල්ලාපයට සවන් දුන්නේය. එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ එකත්පසෙක වාඩිවිය. එකත්පසෙක වාඩි වූ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ සහ පස්වකංග සිටුවරයා අතර වූ සම්පූර්ණ කථාසල්ලාපය භාග්‍යවතුන් වහන්සේට දැන්වූයේය. “ආනන්දය, එක් ක්‍රමයකින් (පරියාය වශයෙන්) දේශනා කරන ලද ධර්මය පස්වකංග සිටුවරයා උදායි භික්ෂුවගේ දේශනාව අනුමත නොකළේය; ආනන්දය, එක් ක්‍රමයකින් (පරියාය වශයෙන්) දේශනා කරන ලද ධර්මය උදායි භික්ෂුව පස්වකංග සිටුවරයාගේ දේශනාව අනුමත නොකළේය. ආනන්දය, මා විසින් ද්විවිධ වේදනාවෝ දේශනා කර ඇත, එක් ක්‍රමයකිනි. මා විසින් ත්‍රිවිධ වේදනාවෝ දේශනා කර ඇත, එක් ක්‍රමයකිනි. මා විසින් පංචවිධ වේදනාවෝ දේශනා කර ඇත, එක් ක්‍රමයකිනි. මා විසින් ෂඩ්විධ වේදනාවෝ දේශනා කර ඇත, එක් ක්‍රමයකිනි. මා විසින් අටළොස්‌විධ වේදනාවෝ දේශනා කර ඇත, එක් ක්‍රමයකිනි. මා විසින් තිස්‌හය‌විධ වේදනාවෝ දේශනා කර ඇත, එක් ක්‍රමයකිනි. මා විසින් එකසියඅට‌විධ වේදනාවෝ දේශනා කර ඇත, එක් ක්‍රමයකිනි. ආනන්දය, මේ ආකාරයෙන් මා විසින් ධර්මය විවිධ ක්‍රම මගින් (පරියාය වශයෙන්) දේශනා කර ඇත. ආනන්දය, මේ ආකාරයෙන් මා විසින් විවිධ ක්‍රම මගින් දේශනා කරන ලද ධර්මය සම්බන්ධයෙන් යම් අයෙක් අන්‍යෝන්‍ය වශයෙන් හොඳින් කියන ලද දේ, හොඳින් කථා කරන ලද දේ අනුමත නොකරන්නේ නම්, පිළිනොගන්නේ නම්, සතුටු නොකරන්නේ නම්, ඔවුන් වාද විවාද ඇති කර ගනිමින්, කලහයට පැමිණ, එකිනෙකාට වචන රූපාකාරී හීවලින් අනින්නන් මෙන් වාසය කරනු ඇතැයි අපේක්ෂා කළ යුත්තේය. ආනන්දය, මේ ආකාරයෙන් මා විසින් ධර්මය විවිධ ක්‍රම මගින් දේශනා කර ඇත. ආනන්දය, මේ ආකාරයෙන් මා විසින් විවිධ ක්‍රම මගින් දේශනා කරන ලද ධර්මය සම්බන්ධයෙන් යම් අයෙක් අන්‍යෝන්‍ය වශයෙන් හොඳින් කියන ලද දේ, හොඳින් කථා කරන ලද දේ අනුමත කරන්නේ නම්, පිළිගන්නේ නම්, සතුටු කරන්නේ නම්, ඔවුන් සමගියෙන්, සතුටු වෙමින්, විවාද නොකරමින්, කිරි සහ වතුර මෙන් එක්ව, එකිනෙකාට ප්‍රිය ඇස්වලින් බලමින් වාසය කරනු ඇතැයි අපේක්ෂා කළ යුත්තේය.”\n\n“ආනන්දය, මේ පංච කාම ගුණයෝය. ඒ පංච කාම ගුණයන් කවරේද? ඇසට විඤ්ඤාණය වන, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය ස්වරූප ඇති, කාමයට උපචිත වූ, රාගය ඇති කරන රූපයන්ය... එලෙසම කයට විඤ්ඤාණය වන, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය ස්වරූප ඇති, කාමයට උපචිත වූ, රාගය ඇති කරන ස්පර්ශයන්ය. ආනන්දය, මේ පංච කාම ගුණයෝය. ආනන්දය, මේ පංච කාම ගුණයන් නිසා යම් සැපයක් හා සෝමනස්සයක් (සතුටක්) උපදින්නේද, මෙය කාමසුඛය යැයි කියනු ලැබේ. ආනන්දය, යම් අයෙක් ‘මෙයමයි උත්තරීතර වූ, ශාන්ත වූ සැපය සහ සෝමනස්සය’ යැයි පවසන්නේ නම්, එය මම අනුමත නොකරමි. එයට හේතුව කුමක්ද? ආනන්දය, මේ සැපයට වඩා උසස් වූ ද ප්‍රණීත වූ ද වෙනත් සැපයක් ඇත. “ආනන්දය, මේ සැපයට වඩා උසස් වූ ද ප්‍රණීත වූ ද වෙනත් සැපය කුමක්ද? ආනන්දය, මෙහිලා භික්ෂුව කාමයන්ගෙන් මුළුමනින්ම වෙන්ව, අකුසල ධර්මයන්ගෙන් මුළුමනින්ම වෙන්ව, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ආනන්දය, මේ සැපය, පෙර කී සැපයට වඩා උසස් වූ ද ප්‍රණීත වූ ද වෙනත් සැපයකි.”\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව විතර්ක සහ විචාරයන්ගේ සංසිඳීමෙන් අභ‍්‍යන්තරයේ පහළවන පැහැදීමෙන්ද, සිතේ එකඟ භාවයෙන්ද, විතර්ක රහිත වූද, විචාර රහිත වූද, සමාධියෙන් උපන් පීති සහගත සුවය සහිත වූ දෙවන ධ‍්‍යානයට පැමිණ වාසය කරයි. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය නම් මෙයයි.\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව පීතියෙන්ද වෙන්වීමෙන්, උපේක්‍ෂා සහගතව වාසය කරයි. සිහියෙන් හා මනා දැනීමෙන් යුක්තව ශරීරයෙන් සුවය විඳියි. යමක් ආර්‍යයෝ ‘උපේක්‍ෂා සහගත වූ සිහි නුවණින් යුක්තව සුවසේ වාසය කරන්නා’ යැයි පවසත්ද, ඒ තෙවන ධ‍්‍යානයට පැමිණ වාසය කරයි. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය නම් මෙයයි.\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව සුවයද ප්‍රහීණ කිරීමෙන්, දුකද ප්‍රහීණ කිරීමෙන්, පෙර තිබූ සොම්නස්-දොම්නස් අතුරුදහන් වීමෙන්, දුක්ද නොවන සුවද නොවන උපේක්‍ෂා-සති පාරිශුද්‍ධිය ඇති සිවුවන ධ‍්‍යානයට පැමිණ වාසය කරයි. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය නම් මෙයයි.\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව සියලු රූප සංඥාවන් අතික්‍රමණය කිරීමෙන්, ගැටීම් සංඥාවන් අතුරුදහන් වීමෙන්, නානාවිධ සංඥාවන් මෙනෙහි නොකිරීමෙන්, ‘අනන්තය ආකාශය’ යැයි සලකා ආකාශානන්‍ත්‍යායතනයට පැමිණ වාසය කරයි. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය නම් මෙයයි.\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව සියලු ආකාශානන්‍ත්‍යායතනයන් අතික්‍රමණය කොට ‘අනන්තය විඥානය’ යැයි සලකා විඥ්‍ඤාණානන්‍ත්‍යායතනයට පැමිණ වාසය කරයි. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය නම් මෙයයි.\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව සියලු විඥ්‍ඤාණානන්‍ත්‍යායතනයන් අතික්‍රමණය කොට ‘කිසිවක් නැත’ යැයි සලකා ආකිඤ‍්චන්‍යායතනයට පැමිණ වාසය කරයි. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය නම් මෙයයි.\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව සියලු ආකිඤ‍්චන්‍යායතනයන් අතික්‍රමණය කොට නේවසංඥානාසංඥායතනයට පැමිණ වාසය කරයි. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය නම් මෙයයි.\n\nආනන්දයෙනි, යම්කිසි කෙනෙක් ‘මෙයමයි පරම වූ, ශාන්ත වූ සැපයත්, සොම්නසත් විඳින්නේ’ යැයි මෙසේ කියන්නේ නම්, එය මම අනුදන්නේ නැත. ඒ කුමන හේතුවක් නිසාද? ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපයක් ඇත. ආනන්දයෙනි, මේ සැපයට වඩා උත්කෘෂ්‍ට වූද, ප්‍රණීත වූද වෙනත් සැපය කුමක්ද?\n\nආනන්දයෙනි, මෙහිලා භික්‍ෂුව සියලු නේවසංඥානාසංඥායතනයන් අතික්‍රමණය කොට සංඥා වේදයිත නිරෝධයට (සංඥා සහ වේදනා නිරෝධයට) පැමිණ වාසය කරයි.\n\nආනන්දය, මේ සැපයට වඩා අතිශයින් උසස් වූද, විශිෂ්ට වූද වෙනත් සැපයක් ඇත. ආනන්දය, මෙයද සිදුවිය හැකි අවස්ථාවකි. අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ කියන්නට පුළුවන: ‘ශ්‍රමණ ගෞතමයන් වහන්සේ සංඥා වේදනා නිරෝධය පවසති, එයද සැපයක් ලෙස පනවති. මෙය කුමක්ද, මෙය කෙසේද?’ ආනන්දය, එසේ කියන අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පැවසිය යුතුය: ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ සැපයක් වන වේදනාව පමණක් අරමුණු කරගෙන සැපයක් ලෙස පනවන්නේ නැත. ඇවැත්නි, යම් තැනක යම් ආකාරයකින් සැපයක් දක්නට ලැබේ නම්, ඒ ඒ දෙය තථාගතයන් වහන්සේ සැපයක් ලෙස පනවති.’",
      "paliTitle": "Pañcakaṅgasuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 268,
      "pali": "‘‘Dvepi mayā, bhikkhave, vedanā vuttā pariyāyena, tissopi mayā vedanā vuttā pariyāyena, pañcapi mayā vedanā vuttā pariyāyena, chapi mayā vedanā vuttā pariyāyena, aṭṭhārasāpi mayā vedanā vuttā pariyāyena, chattiṃsāpi mayā vedanā vuttā pariyāyena, aṭṭhasatampi mayā vedanā vuttā pariyāyena. Evaṃ pariyāyadesito, bhikkhave, mayā dhammo. Evaṃ pariyāyadesite kho, bhikkhave, mayā dhamme ye aññamaññassa subhāsitaṃ sulapitaṃ na samanumaññissanti, na samanujānissanti, na samanumodissanti, tesaṃ etaṃ pāṭikaṅkhaṃ – bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharissantīti. Evaṃ pariyāyadesito, bhikkhave, mayā dhammo. Evaṃ pariyāyadesite kho, bhikkhave, mayā dhamme ye aññamaññassa subhāsitaṃ sulapitaṃ samanumaññissanti samanujānissanti samanumodissanti, tesaṃ etaṃ pāṭikaṅkhaṃ – samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharissantīti. ‘‘Pañcime, bhikkhave, kāmaguṇā…pe… ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘saññāvedayitanirodhaṃ samaṇo gotamo āha, tañca sukhasmiṃ paññapeti. Tayidaṃ kiṃsu, tayidaṃ kathaṃsū’ti? Evaṃvādino, bhikkhave, aññatitthiyā paribbājakā evamassu vacanīyā – ‘na kho, āvuso, bhagavā sukhaññeva vedanaṃ sandhāya sukhasmiṃ paññapeti. Yattha yattha, āvuso, sukhaṃ upalabbhati yahiṃ yahiṃ [yaṃ hi yaṃ hi (sī. pī.)], taṃ taṃ tathāgato sukhasmiṃ paññapetī’’ti. Dasamaṃ. Rahogatavaggo dutiyo. Tassuddānaṃ – Rahogataṃ dve ākāsaṃ, agāraṃ dve ca ānandā; Sambahulā duve vuttā, pañcakaṅgo ca bhikkhunāti.",
      "english": "Monks, I have taught feeling by classification as being of two kinds, and also of three kinds, of five kinds, of six kinds, of eighteen kinds, of thirty-six kinds, and of one hundred and eight kinds. Monks, the Dhamma has been taught by me in this classified manner. Monks, regarding this Dhamma taught by me in such a classified manner, those who do not approve, endorse, or rejoice in each other's well-spoken and well-expressed words, can expect to dwell engaged in quarrels, strife, and disputes, piercing one another with verbal daggers. Monks, the Dhamma has been taught by me in this classified manner. Monks, regarding this Dhamma taught by me in such a classified manner, those who approve, endorse, and rejoice in each other's well-spoken and well-expressed words, can expect to dwell in concord, rejoicing together, without dispute, blended like milk and water, regarding one another with loving eyes.\n\nMonks, these are the five strands of sensual pleasure. Monks, it is indeed possible that other wanderers and ascetics might say: \"The ascetic Gotama speaks of the cessation of perception and feeling, and he declares that to be happiness. What is this? How can this be?\" Monks, when other wanderers and ascetics speak thus, they should be told: \"Friends, the Blessed One does not declare happiness with reference solely to pleasant feeling. Wherever happiness is found, whatever its nature, that the Tathāgata declares to be happiness.\"",
      "sinhala": "මහණෙනි, මා විසින් වේදනා දෙකක්ද, වේදනා තුනක්ද, වේදනා පහක්ද, වේදනා හයක්ද, වේදනා දහඅටක්ද, වේදනා තිස්හයක්ද, වේදනා සියඅටක්ද වශයෙන් විවිධ ක්‍රම මගින් දේශනා කර ඇත. මහණෙනි, මා විසින් ධර්මය මෙලෙස විවිධ ක්‍රම මගින් දේශනා කර ඇත. මහණෙනි, මා විසින් මෙලෙස විවිධ ක්‍රම මගින් දේශනා කරන ලද මේ ධර්මය සම්බන්ධයෙන්, යම් අයෙක් එකිනෙකාගේ යහපත් ප්‍රකාශයන්ට හා මනාව කථා කරන ලද දේට එකඟ නොවෙත්ද, අනුමත නොවෙත්ද, අනුමෝදන් නොවෙත්ද, ඔවුන්ගෙන් මේ දේ අපේක්ෂා කළ හැකිය. එනම්, ඔවුහු භේද භින්න වී, කලහකාරී වී, විවාදයට පැමිණ, එකිනෙකාට වචන ඊතලවලින් විදින්නන් මෙන් වාසය කරනු ඇත.\n\nමහණෙනි, මා විසින් ධර්මය මෙලෙස විවිධ ක්‍රම මගින් දේශනා කර ඇත. මහණෙනි, මා විසින් මෙලෙස විවිධ ක්‍රම මගින් දේශනා කරන ලද මේ ධර්මය සම්බන්ධයෙන්, යම් අයෙක් එකිනෙකාගේ යහපත් ප්‍රකාශයන්ට හා මනාව කථා කරන ලද දේට එකඟ වෙත්ද, අනුමත වෙත්ද, අනුමෝදන් වෙත්ද, ඔවුන්ගෙන් මේ දේ අපේක්ෂා කළ හැකිය. එනම්, ඔවුහු සමගිව, ප්‍රීතිමත් ව, විවාදයකින් තොරව, කිරි හා වතුර මෙන් එකට මිශ්‍ර වී, එකිනෙකාට ප්‍රිය දෑසින් බලමින් වාසය කරනු ඇත.\n\nමහණෙනි, මේ පස්වැදෑරුම් කාම ගුණ ඇත... මහණෙනි, වෙනත් තීර්ථක පරිබ්‍රාජකයින් මෙසේ කියන අවස්ථාද ඇත: ‘ගෞතම ශ්‍රමණයන් විසින් සංඥා වේදයිත නිරෝධය දේශනා කරන ලදී. එය සුඛයක් ලෙස පනවයි. මේ කුමක්ද? මේ කෙසේද?’ මහණෙනි, මෙසේ කියන වෙනත් තීර්ථක පරිබ්‍රාජකයින්ට මෙසේ කිව යුතුය: ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ සුවය යනු වේදනාවක් පමණක් සලකා සුඛය ලෙස නොපනවති. ඇවැත්නි, කොතැන කොතැන සුඛයක් උපදින්නේද, ඒ ඒ තැන තථාගතයන් වහන්සේ එය සුඛයක් ලෙස පනවති.’ දහවැනි සූත්‍රයයි. රහෝගත වග්ගය දෙවැන්නයි. එහි උද්දානය මෙසේය: රහෝගත, ආකාස සූත්‍ර දෙකක්, අගාර, ආනන්ද සූත්‍ර දෙකක්; සම්බහුල සූත්‍ර දෙකක් දේශනා කරන ලදී, පඤ්චකංග සහ භික්ඛුණී සූත්‍රය.",
      "paliTitle": "Bhikkhusuttaṃ",
      "vagga": "Rahogatavaggo"
    },
    {
      "number": 269,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho moḷiyasīvako paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho moḷiyasīvako paribbājako bhagavantaṃ etadavoca – ‘‘santi, bho gotama, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ pubbekatahetū’ti. Idha [idha pana (syā. kaṃ. pī. ka.)] bhavaṃ gotamo kimāhā’’ti? ‘‘Pittasamuṭṭhānānipi kho, sīvaka, idhekaccāni vedayitāni uppajjanti. Sāmampi kho etaṃ, sīvaka, veditabbaṃ [evaṃ veditabbaṃ (syā. kaṃ. ka.)] yathā pittasamuṭṭhānānipi idhekaccāni vedayitāni uppajjanti; lokassapi kho etaṃ, sīvaka, saccasammataṃ yathā pittasamuṭṭhānānipi idhekaccāni vedayitāni uppajjanti. Tatra, sīvaka, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ pubbekatahetū’ti. Yañca sāmaṃ ñātaṃ tañca atidhāvanti, yañca loke saccasammataṃ tañca atidhāvanti. Tasmā tesaṃ samaṇabrāhmaṇānaṃ micchāti vadāmi. ‘‘Semhasamuṭṭhānānipi kho, sīvaka…pe… vātasamuṭṭhānānipi kho, sīvaka…pe… sannipātikānipi kho, sīvaka…pe… utupariṇāmajānipi kho, sīvaka…pe… visamaparihārajānipi kho, sīvaka…pe… opakkamikānipi kho, sīvaka…pe… kammavipākajānipi kho, sīvaka, idhekaccāni vedayitāni uppajjanti. Sāmampi kho etaṃ, sīvaka, veditabbaṃ. Yathā kammavipākajānipi idhekaccāni vedayitāni uppajjanti; lokassapi kho etaṃ, sīvaka, saccasammataṃ. Yathā kammavipākajānipi idhekaccāni vedayitāni uppajjanti; tatra, sīvaka, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā sabbaṃ taṃ pubbekatahetū’ti. Yañca sāmaṃ ñātaṃ tañca atidhāvanti yañca loke saccasammataṃ tañca atidhāvanti. Tasmā tesaṃ samaṇabrāhmaṇānaṃ micchāti vadāmīti. Evaṃ vutte, moḷiyasīvako paribbājako bhagavantaṃ etadavoca – ‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama …pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’’nti. ‘‘Pittaṃ semhañca vāto ca, sannipātā utūni ca; Visamaṃ opakkamikaṃ, kammavipākena aṭṭhamī’’ti. paṭhamaṃ;",
      "english": "At one time the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. Then the wanderer Moḷiyasīvaka approached the Blessed One; having approached, he exchanged greetings with the Blessed One. Having exchanged polite and cordial greetings, he sat down to one side. Sitting to one side, the wanderer Moḷiyasīvaka said to the Blessed One: \"Venerable Gotama, there are some ascetics and brahmins who hold such a doctrine and view, saying: 'Whatever this individual experiences – be it pleasant, painful, or neither pleasant nor painful – all of that is due to actions performed in the past.'\" \"What does Venerable Gotama say concerning this?\"\n\n\"Some feelings, Sīvaka, also arise due to bile. It can be known by oneself, Sīvaka, how some feelings arise due to bile; and it is also accepted as true by the world, Sīvaka, how some feelings arise due to bile. Regarding that, Sīvaka, those ascetics and brahmins who hold such a doctrine and view, saying: 'Whatever this individual experiences – be it pleasant, painful, or neither pleasant nor painful – all of that is due to actions performed in the past'—they disregard what is known by oneself, and they disregard what is accepted as true by the world. Therefore, I declare that those ascetics and brahmins are wrong. Some feelings, Sīvaka, also arise due to phlegm. Some feelings, Sīvaka, also arise due to wind. Some feelings, Sīvaka, also arise due to the combination of humours. Some feelings, Sīvaka, also arise due to changes in season. Some feelings, Sīvaka, also arise due to improper care. Some feelings, Sīvaka, also arise due to external causes. And some feelings, Sīvaka, also arise due to the ripening of karma. It can be known by oneself, Sīvaka, how some feelings arise due to the ripening of karma; and it is also accepted as true by the world, Sīvaka, how some feelings arise due to the ripening of karma. Regarding that, Sīvaka, those ascetics and brahmins who hold such a doctrine and view, saying: 'Whatever this individual experiences – be it pleasant, painful, or neither pleasant nor painful – all of that is due to actions performed in the past'—they disregard what is known by oneself, and they disregard what is accepted as true by the world. Therefore, I declare that those ascetics and brahmins are wrong.\"\n\nWhen this was said, the wanderer Moḷiyasīvaka said to the Blessed One: \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as if one were to set upright what was overturned, or reveal what was hidden, or show the path to one who was lost, or carry a lamp into the darkness so that those with eyes might see forms—in the same way has the Venerable Gotama made the Dhamma clear in many ways. I go for refuge to the Blessed One, and to the Dhamma, and to the Saṅgha of bhikkhus. From this day forth, let Venerable Gotama remember me as a lay follower who has gone for refuge for life.\"\n\nBile, phlegm, and wind, and combinations of humours, and seasons; improper care, external causes, and ripening of karma as the eighth.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලඳක නිවාප නම් ස්ථානයේ වැඩවසන සේක.\n\nඑකල්හි මෝලියසීවක පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා බස් නිමවා එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වූ මෝලියසීවක පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “භවත් ගෞතමයන් වහන්ස, ඇතැම් ශ්‍රමණබ්‍රාහ්මණයෝ මෙවැනි වාද ඇත්තෝ, මෙවැනි දෘෂ්ටි ඇත්තෝ වෙති: ‘යම් කිසි පුරුෂ පුද්ගලයෙක් සැප හෝ දුක් හෝ දුක් නොවන සැප නොවන වේදනාවක් අත්විඳින්නේද, ඒ සියල්ල පෙර කරන ලද කර්ම හේතුවෙන් යැ’යි. මේ පිළිබඳව භවත් ගෞතමයන් වහන්සේ කුමක් වදාරන සේක්ද?”\n\n“සීවක, සමහර වේදනා පිත් සමුට්ඨානයෙන් ද උපදී. සීවක, සමහර වේදනා පිත් සමුට්ඨානයෙන් ද උපදින බව තමා විසින් ම ද දැනගත යුතුය. සීවක, සමහර වේදනා පිත් සමුට්ඨානයෙන් ද උපදින බව ලෝකයා විසින් ද සත්‍ය වශයෙන් පිළිගන්නා ලද්දකි. සීවක, එහෙයින් යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘යම් කිසි පුරුෂ පුද්ගලයෙක් සැප හෝ දුක් හෝ දුක් නොවන සැප නොවන වේදනාවක් අත්විඳින්නේද, ඒ සියල්ල පෙර කරන ලද කර්ම හේතුවෙන් යැ’යි මෙවැනි වාද ඇත්තෝ, මෙවැනි දෘෂ්ටි ඇත්තෝ වෙත් ද, තමා විසින් දැනගත් දෙයත්, ලෝකයා විසින් සත්‍ය යැයි පිළිගත් දෙයත් ඔවුහු ඉක්මවා යති. එහෙයින් ඒ ශ්‍රමණබ්‍රාහ්මණයන්ගේ දෘෂ්ටිය මිථ්‍යා යැයි මම පවසමි.\n\nසීවක, සමහර වේදනා සෙම් සමුට්ඨානයෙන් ද උපදී. සීවක, සමහර වේදනා වාත සමුට්ඨානයෙන් ද උපදී. සීවක, සමහර වේදනා සන්නිපාතයෙන් ද උපදී. සීවක, සමහර වේදනා ඍතු විපර්යාසයෙන් ද උපදී. සීවක, සමහර වේදනා විෂම පරිහාරයෙන් ද උපදී. සීවක, සමහර වේදනා උපක්‍රමයෙන් ද උපදී. සීවක, සමහර වේදනා කර්ම විපාකයෙන් ද උපදී. සීවක, සමහර වේදනා කර්ම විපාකයෙන් ද උපදින බව තමා විසින් ම ද දැනගත යුතුය. සීවක, සමහර වේදනා කර්ම විපාකයෙන් ද උපදින බව ලෝකයා විසින් ද සත්‍ය වශයෙන් පිළිගන්නා ලද්දකි. සීවක, එහෙයින් යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘යම් කිසි පුරුෂ පුද්ගලයෙක් සැප හෝ දුක් හෝ දුක් නොවන සැප නොවන වේදනාවක් අත්විඳින්නේද, ඒ සියල්ල පෙර කරන ලද කර්ම හේතුවෙන් යැ’යි මෙවැනි වාද ඇත්තෝ, මෙවැනි දෘෂ්ටි ඇත්තෝ වෙත් ද, තමා විසින් දැනගත් දෙයත්, ලෝකයා විසින් සත්‍ය යැයි පිළිගත් දෙයත් ඔවුහු ඉක්මවා යති. එහෙයින් ඒ ශ්‍රමණබ්‍රාහ්මණයන්ගේ දෘෂ්ටිය මිථ්‍යා යැයි මම පවසමි.”\n\nමෙසේ වදාළ කල්හි මෝලියසීවක පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි. භවත් ගෞතමයන් වහන්ස, යම් සේ පෙරළු අතක් නිවැරදි කරන්නේ ද, වැසූ දෙයක් හෙළි කරන්නේ ද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේ ද, ඇස් ඇත්තවුන්ට රූප පෙනෙත්වා යැයි අන්ධකාරයේ තෙල් පහනක් දරන්නේ ද, එසේම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. භවත් ගෞතමයන් වහන්සේ අද පටන් ජීවිතාන්තය දක්වා සරණ ගිය උපාසකයෙකු ලෙස මා සලකන සේක්වා.”\n\n“පිත්, සෙම්, වාත ද, සන්නිපාතය, ඍතු ද; විෂම පරිහාරය, උපක්‍රමය, කර්ම විපාකය වශයෙන් අටවැන්න ද (වේදනා ඇතිවීමට හේතු වෙයි).”\n\nමෙය පළමුවැන්නයි.",
      "paliTitle": "Sīvakasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 270,
      "pali": "‘‘Aṭṭhasatapariyāyaṃ vo, bhikkhave, dhammapariyāyaṃ desessāmi. Taṃ suṇātha. Katamo ca, bhikkhave, aṭṭhasatapariyāyo, dhammapariyāyo? Dvepi mayā, bhikkhave, vedanā vuttā pariyāyena; tissopi mayā vedanā vuttā pariyāyena; pañcapi mayā vedanā vuttā pariyāyena; chapi mayā vedanā vuttā pariyāyena; aṭṭhārasāpi mayā vedanā vuttā pariyāyena; chattiṃsāpi mayā vedanā vuttā pariyāyena; aṭṭhasatampi mayā vedanā vuttā pariyāyena. ‘‘Katamā ca, bhikkhave, dve vedanā? Kāyikā ca cetasikā ca – imā vuccanti, bhikkhave, dve vedanā. Katamā ca, bhikkhave, tisso vedanā? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā vuccanti, bhikkhave, tisso vedanā. Katamā ca, bhikkhave, pañca vedanā? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ – imā vuccanti, bhikkhave, pañca vedanā. Katamā ca, bhikkhave, cha vedanā? Cakkhusamphassajā vedanā… pe… manosamphassajā vedanā – imā vuccanti, bhikkhave, cha vedanā. Katamā ca, bhikkhave, aṭṭhārasa vedanā? Cha somanassūpavicārā, cha domanassūpavicārā, cha upekkhūpavicārā – imā vuccanti, bhikkhave, aṭṭhārasa vedanā. Katamā ca, bhikkhave, chattiṃsa vedanā? Cha gehasitāni [gehassitāni (aṭṭha.)] somanassāni, cha nekkhammasitāni [nekkhammassitāni (aṭṭha.)] somanassāni, cha gehasitāni domanassāni, cha nekkhammasitāni domanassāni, cha gehasitā upekkhā, cha nekkhammasitā upekkhā – imā vuccanti, bhikkhave, chattiṃsa vedanā. Katamañca, bhikkhave, aṭṭhasataṃ vedanā? Atītā chattiṃsa vedanā, anāgatā chattiṃsa vedanā, paccuppannā chattiṃsa vedanā – imā vuccanti, bhikkhave, aṭṭhasataṃ vedanā. Ayaṃ, bhikkhave, aṭṭhasatapariyāyo dhammapariyāyo’’ti. Dutiyaṃ.",
      "english": "Monks, I will teach you an exposition of the Dhamma that consists of 108 aspects. Listen to it. And what, monks, is that exposition of the Dhamma consisting of 108 aspects? Monks, I have taught feelings in terms of two aspects; I have taught feelings in terms of three aspects; I have taught feelings in terms of five aspects; I have taught feelings in terms of six aspects; I have taught feelings in terms of eighteen aspects; I have taught feelings in terms of thirty-six aspects; and I have taught feelings in terms of one hundred and eight aspects.\n\nAnd what, monks, are the two feelings? They are physical and mental. These, monks, are called the two feelings.\n\nAnd what, monks, are the three feelings? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, monks, are called the three feelings.\n\nAnd what, monks, are the five feelings? They are the faculty of pleasure, the faculty of pain, the faculty of joy, the faculty of distress, and the faculty of equanimity. These, monks, are called the five feelings.\n\nAnd what, monks, are the six feelings? They are feeling born of eye-contact, feeling born of ear-contact, feeling born of nose-contact, feeling born of tongue-contact, feeling born of body-contact, and feeling born of mind-contact. These, monks, are called the six feelings.\n\nAnd what, monks, are the eighteen feelings? They are six explorations of joy, six explorations of distress, and six explorations of equanimity. These, monks, are called the eighteen feelings.\n\nAnd what, monks, are the thirty-six feelings? They are six joys rooted in household life, six joys rooted in renunciation; six distresses rooted in household life, six distresses rooted in renunciation; six equanimities rooted in household life, and six equanimities rooted in renunciation. These, monks, are called the thirty-six feelings.\n\nAnd what, monks, are the one hundred and eight feelings? They are the thirty-six past feelings, the thirty-six future feelings, and the thirty-six present feelings. These, monks, are called the one hundred and eight feelings.\n\nMonks, this is the exposition of the Dhamma consisting of 108 aspects.",
      "sinhala": "මහණෙනි, මම ඔබට සිය අට පරියාය නම් වූ ධර්ම පරියාය දේශනා කරමි. එය අසනු. මහණෙනි, සිය අට පරියාය නම් වූ ධර්ම පරියාය කවරේද?\n\nමහණෙනි, මා විසින් පරියාය වශයෙන් වේදනා දෙයාකාරයෙන්ද, තුන් ආකාරයෙන්ද, පස් ආකාරයෙන්ද, සය ආකාරයෙන්ද, අටළොස් ආකාරයෙන්ද, තිස්හය ආකාරයෙන්ද, සිය අට ආකාරයෙන්ද දේශනා කරන ලදී.\n\nමහණෙනි, දෙයාකාර වේදනා කවරේද? කායික වේදනාවද, චෛතසික වේදනාවද යනු මේ දෙයාකාර වේදනා යයි මහණෙනි, කියනු ලැබේ.\n\nමහණෙනි, තුන් ආකාර වේදනා කවරේද? සැප වේදනාව, දුක් වේදනාව, අදුක්ඛමසුඛ වේදනාව යනු මේ තුන් ආකාර වේදනා යයි මහණෙනි, කියනු ලැබේ.\n\nමහණෙනි, පස් ආකාර වේදනා කවරේද? සුඛින්‍ද්‍රිය, දුක්ඛින්‍ද්‍රිය, සෝමනස්සින්‍ද්‍රිය, දෝමනස්සින්‍ද්‍රිය, උපේක්ඛින්‍ද්‍රිය යනු මේ පස් ආකාර වේදනා යයි මහණෙනි, කියනු ලැබේ.\n\nමහණෙනි, සය ආකාර වේදනා කවරේද? චක්ඛුසම්ඵස්සජා වේදනාව ආදී කොට මනෝසම්ඵස්සජා වේදනාව දක්වා වූ මේ සය ආකාර වේදනා යයි මහණෙනි, කියනු ලැබේ.\n\nමහණෙනි, අටළොස් ආකාර වේදනා කවරේද? සය ආකාර වූ සෝමනස්සෝපවිචාර, සය ආකාර වූ දෝමනස්සෝපවිචාර, සය ආකාර වූ උපෙක්ඛෝපවිචාර යනු මේ අටළොස් ආකාර වේදනා යයි මහණෙනි, කියනු ලැබේ.\n\nමහණෙනි, තිස්හය ආකාර වේදනා කවරේද? සය ආකාර වූ ගේහසිත සෝමනස්සයන්, සය ආකාර වූ නෙක්ඛම්මසිත සෝමනස්සයන්, සය ආකාර වූ ගේහසිත දෝමනස්සයන්, සය ආකාර වූ නෙක්ඛම්මසිත දෝමනස්සයන්, සය ආකාර වූ ගේහසිත උපේක්ඛාවන්, සය ආකාර වූ නෙක්ඛම්මසිත උපේක්ඛාවන් යනු මේ තිස්හය ආකාර වේදනා යයි මහණෙනි, කියනු ලැබේ.\n\nමහණෙනි, සිය අට ආකාර වේදනා කවරේද? අතීත වූ තිස්හය ආකාර වේදනා, අනාගත වූ තිස්හය ආකාර වේදනා, වර්තමාන වූ තිස්හය ආකාර වේදනා යනු මේ සිය අට ආකාර වේදනා යයි මහණෙනි, කියනු ලැබේ.\n\nමහණෙනි, මේ සිය අට පරියාය නම් වූ ධර්ම පරියායයි.",
      "paliTitle": "Aṭṭhasatasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 271,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘katamā nu kho, bhante, vedanā, katamo vedanāsamudayo, katamā vedanāsamudayagāminī paṭipadā? Katamo vedanānirodho, katamā vedanānirodhagāminī paṭipadā? Ko vedanāya assādo, ko ādīnavo, kiṃ nissaraṇa’’nti? ‘‘Tisso imā, bhikkhu, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Imā vuccanti, bhikkhu, vedanā. Phassasamudayā vedanāsamudayo. Taṇhā vedanāsamudayagāminī paṭipadā. Phassanirodhā vedanānirodho. Ayameva ariyo aṭṭhaṅgiko maggo vedanānirodhagāminī paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Yaṃ vedanaṃ paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ vedanāya assādo; yā vedanā aniccā dukkhā vipariṇāmadhammā, ayaṃ vedanāya ādīnavo; yo vedanāya chandarāgavinayo chandarāgappahānaṃ, idaṃ vedanāya nissaraṇa’’nti. Tatiyaṃ.",
      "english": "Then, a certain bhikkhu approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, that bhikkhu said to the Blessed One: \"Venerable Sir, what is feeling? What is the origin of feeling? What is the path leading to the origin of feeling? What is the cessation of feeling? What is the path leading to the cessation of feeling? What is the gratification in feeling? What is the danger in feeling? What is the escape from feeling?\"\n\n\"Bhikkhu, these are the three feelings: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, bhikkhu, are called feelings. The origin of feeling is the origin of contact. Craving is the path leading to the origin of feeling. The cessation of feeling is the cessation of contact. This Noble Eightfold Path is the path leading to the cessation of feeling, namely: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. That happiness and joy which arises dependent on feeling is the gratification in feeling. That feeling is impermanent, unsatisfactory, and subject to change—this is the danger in feeling. The removal of desire and lust for feeling, the abandonment of desire and lust for feeling—this is the escape from feeling.\"",
      "sinhala": "එතකොට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"වහන්ස, වේදනාව කවරේද? වේදනා සමුදය කවරේද? වේදනා සමුදයගාමිනී ප්‍රතිපදාව කවරේද? වේදනා නිරෝධය කවරේද? වේදනා නිරෝධගාමිනී ප්‍රතිපදාව කවරේද? වේදනාවේ ආශ්වාදය කවරේද? ආදීනවය කවරේද? නිස්සරණය කවරේද?\"\n\n\"මහණ, මේ වේදනා තුනක් ඇත – සැප වේදනාව, දුක් වේදනාව, දුක්-නොවන-සැප-නොවන වේදනාවයි. මහණ, මේවා වේදනා යැයි කියනු ලැබේ. ස්පර්ශය හටගැනීමෙන් වේදනාව හටගනී. තණ්හාව වේදනා සමුදයගාමිනී ප්‍රතිපදාවයි. ස්පර්ශය නිරුද්ධ වීමෙන් වේදනාව නිරුද්ධ වේ. මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේදනා නිරෝධගාමිනී ප්‍රතිපදාවයි. එනම් – සම්මා දිට්ඨි... (ආදී වශයෙන්) සම්මා සමාධියයි. යම් වේදනාවක් හේතු කොටගෙන සැපයක් හා සොම්නසක් හටගනීද, මෙය වේදනාවේ ආශ්වාදයයි; යම් වේදනාවක් අනිත්‍ය, දුක් සහ වෙනස් වන ස්වභාවයෙන් යුක්තද, මෙය වේදනාවේ ආදීනවයයි; වේදනාව පිළිබඳව ඇති ඡන්දරාගය (කැමැත්ත සහ ඇලීම) නැති කිරීමත්, ඡන්දරාගය ප්‍රහාණය කිරීමත්, මෙය වේදනාවේ නිස්සරණයයි.\"\n\nතෙවැනි සූත්‍රයයි.",
      "paliTitle": "Aññatarabhikkhusuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 272,
      "pali": "‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘katamā nu kho vedanā, katamo vedanāsamudayo, katamā vedanāsamudayagāminī paṭipadā, katamo vedanānirodho, katamā vedanānirodhagāminī paṭipadā? Ko vedanāya assādo, ko ādīnavo, kiṃ nissaraṇa’nti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘tisso imā vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Imā vuccanti vedanā. Phassasamudayā vedanāsamudayo. Taṇhā vedanāsamudayagāminī paṭipadā…pe… yo vedanāya chandarāgavinayo chandarāgappahānaṃ. Idaṃ vedanāya nissaraṇa’’’nti. Catutthaṃ.",
      "english": "Before my full enlightenment, bhikkhus, while I was still an unenlightened Bodhisatta, this thought occurred to me: ‘What is feeling? What is the origin of feeling? What is the path leading to the origin of feeling? What is the cessation of feeling? What is the path leading to the cessation of feeling? What is the gratification in feeling? What is the danger in feeling? What is the escape from feeling?’ Then, bhikkhus, this thought occurred to me: ‘These are the three feelings: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These are called feelings. From the origin of contact comes the origin of feeling. Craving is the path leading to the origin of feeling. With the cessation of craving comes the cessation of feeling. The Noble Eightfold Path is the path leading to the cessation of feeling. The pleasure and joy that arises in dependence on feeling—this is its gratification. That feeling is impermanent, unsatisfactory, and subject to change—this is its danger. The removal of desire and passion for feeling, the abandonment of desire and passion for feeling—this is its escape.’",
      "sinhala": "මහණෙනි, මම සම්බුද්ධත්වයට පත් නොවූ, අවබෝධය නොලැබූ බෝධිසත්වයකු වශයෙන් සිටියදී, මට මෙසේ සිතුණි: 'වේදනාව කවරේද? වේදනා සමුදය කවරේද? වේදනා සමුදයගාමිනී ප්‍ර​තිපදාව කවරේද? වේදනා නිරෝධය කවරේද? වේදනා නිරෝධගාමිනී ප්‍ර​තිපදාව කවරේද? වේදනාවේ ආශ්වාදය කවරේද? වේදනාවේ ආදීනවය කවරේද? වේදනාවෙන් නිස්සරණය කවරේද?' මහණෙනි, එවිට මට මෙසේ සිතුණි: 'මේ වේදනා තුනකි – සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව. මේවා වේදනා යැයි කියනු ලැබේ. ස්පර්ශය හටගැනීමෙන් වේදනා හටගැනීම සිදු වේ. තණ්හාව යනු වේදනා සමුදයගාමිනී ප්‍ර​තිපදාවයි...පෙ... යම් වේදනාව පිළිබඳ ඡන්දරාගය දුරලීමක්, ඡන්දරාගය ප්‍ර​හාණය කිරීමක් වේද, මෙය වේදනාවෙන් නිස්සරණයයි.'",
      "paliTitle": "Pubbasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 273,
      "pali": "‘‘‘Imā vedanā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘Ayaṃ vedanāsamudayo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi…pe… āloko udapādi. ‘Ayaṃ vedanāsamudayagāminī paṭipadā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi…pe… ‘ayaṃ vedanānirodho’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi …pe… ‘ayaṃ vedanānirodhagāminī paṭipadā’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi… pe… ‘ayaṃ vedanāya assādo’ti me, bhikkhave, pubbe ananussutesu dhammesu…pe… ‘ayaṃ vedanāya ādīnavo’ti me, bhikkhave, pubbe ananussutesu dhammesu…pe… ‘idaṃ kho nissaraṇa’nti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādī’’ti. Pañcamaṃ.",
      "english": "“These are feelings”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.\n“This is the origin of feeling”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.\n“This is the path leading to the origin of feeling”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.\n“This is the cessation of feeling”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.\n“This is the path leading to the cessation of feeling”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.\n“This is the gratification in feeling”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.\n“This is the danger in feeling”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.\n“This truly is the escape from feeling”—thus, bhikkhus, regarding these teachings never heard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.",
      "sinhala": "‘‘මහණෙනි, ‘මේ වේදනා යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. මහණෙනි, ‘මේ වේදනා සමුදය යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. මහණෙනි, ‘මේ වේදනා සමුදය කරා යන ප්‍ර‍‌තිපදාව යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. මහණෙනි, ‘මේ වේදනා නිරෝධය යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. මහණෙනි, ‘මේ වේදනා නිරෝධය කරා යන ප්‍ර‍‌තිපදාව යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. මහණෙනි, ‘මේ වේදනාවෙහි ආස්වාදය යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. මහණෙනි, ‘මේ වේදනාවෙහි ආදීනවය යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. මහණෙනි, ‘මෙය ම නිස්සරණය යි’ පෙර අසා නොතිබූ ධර්‍මයන් පිළිබඳව මට නුවණැස පහළ විය, ඥානය පහළ විය, ප්‍ර‍‌ඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය.",
      "paliTitle": "Ñāṇasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 274,
      "pali": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā…pe… ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘katamā nu kho, bhante, vedanā, katamo vedanāsamudayo, katamā vedanāsamudayagāminī paṭipadā? Katamo vedanānirodho, katamā vedanānirodhagāminī paṭipadā? Ko vedanāya assādo, ko ādīnavo, kiṃ nissaraṇa’’nti? ‘‘Tisso imā, bhikkhave, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Imā vuccanti, bhikkhave, vedanā. Phassasamudayā vedanāsamudayo. Taṇhā vedanāsamudayagāminī paṭipadā. Phassanirodhā… pe… yo vedanāya chandarāgavinayo chandarāgappahānaṃ. Idaṃ vedanāya nissaraṇa’’nti. Chaṭṭhaṃ.",
      "english": "Then, many bhikkhus approached the Blessed One. Having approached, paid homage, and sat down to one side, those bhikkhus said to the Blessed One: \"Venerable sir, what exactly is feeling? What is the origin of feeling? What is the path leading to the origin of feeling? What is the cessation of feeling? What is the path leading to the cessation of feeling? What is the gratification in feeling? What is the danger in feeling? What is the escape from feeling?\"\n\n\"Bhikkhus, these three are feelings: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, bhikkhus, are called feelings. From the arising of contact comes the arising of feeling. Craving is the path leading to the origin of feeling. From the cessation of contact comes the cessation of feeling. The Noble Eightfold Path is the path leading to the cessation of feeling. The gratification in feeling is the pleasure and joy that arises in dependence on feeling. The danger in feeling is that feeling is impermanent, unsatisfactory, and subject to change. The removal of desire-passion for feeling, the abandoning of desire-passion – this is the escape from feeling.\"",
      "sinhala": "එවිට බොහෝ භික්ෂූන් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව වාඩි වූ ඒ භික්ෂූන් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: \"ස්වාමීනි, වේදනාව කවරේද? වේදනාවේ හටගැනීම කවරේද? වේදනාවේ හටගැනීමට හේතුවන ප්‍රතිපදාව කවරේද? වේදනා නිරෝධය කවරේද? වේදනා නිරෝධයට හේතුවන ප්‍රතිපදාව කවරේද? වේදනාවේ ආශ්වාදය කවරේද? ආදීනවය කවරේද? නිස්සරණය කවරේද?\"\n\n\"මහණෙනි, මේ වේදනා තුනකි: සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව වශයෙනි. මහණෙනි, මේවා වේදනා යැයි කියනු ලැබේ. ස්පර්ශය හටගැනීමෙන් වේදනාව හටගනී. තෘෂ්ණාව වේදනා හටගැනීමට හේතුවන ප්‍රතිපදාවයි. ස්පර්ශය නිරුද්ධ වීමෙන් වේදනා නිරෝධය වේ. ආර්ය අෂ්ටාංගික මාර්ගය වේදනා නිරෝධයට හේතුවන ප්‍රතිපදාවයි. වේදනාවෙන් යම් සැපයක්, සොම්නසක් වේද, එය ආශ්වාදයයි. වේදනාවේ යම් අනිත්‍යභාවයක්, දුක් සහගත බවක්, වෙනස්වන සුළු ස්වභාවයක් වේද, එය ආදීනවයයි. යම් වේදනාව පිළිබඳව ඇති ඡන්දරාගය දුරු කිරීමක්, ඡන්දරාගය ප්‍රහාණය කිරීමක් වේද, මෙය වේදනාවේ නිස්සරණයයි.\"",
      "paliTitle": "Sambahulabhikkhusuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 275,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā imāsaṃ tissannaṃ vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti. Na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā imāsaṃ tissannaṃ vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavaṃ ca nissaraṇañca yathābhūtaṃ pajānanti. Te kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā. Te ca panāyasmanto sāmaññatthañca brahmaññatthañca, diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Sattamaṃ.",
      "english": "Monks, these are the three feelings. Which three? Pleasant feeling, painful feeling, and neither pleasant nor painful feeling.\n\nMonks, any ascetics or brahmins who do not fully understand, as it actually is, the origin, the cessation, the gratification, the danger, and the escape in regard to these three feelings – I do not consider such ascetics or brahmins to be truly ascetics among ascetics, nor truly brahmins among brahmins. Nor do those venerable ones, having realized through their own direct knowledge and attained, dwell in the fruit of asceticism or the fruit of brahminhood in this very life.\n\nHowever, Monks, any ascetics or brahmins who do fully understand, as it actually is, the origin, the cessation, the gratification, the danger, and the escape in regard to these three feelings – I do consider such ascetics or brahmins to be truly ascetics among ascetics, and truly brahmins among brahmins. And those venerable ones, having realized through their own direct knowledge and attained, dwell in the fruit of asceticism and the fruit of brahminhood in this very life.",
      "sinhala": "භික්‍ෂූනි, මේ වේදනා තුනකි. කවරේද ඒ තුන? සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව යන මේවාය. භික්‍ෂූනි, යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ වේදනා තුනේ හටගැනීමත්, නැතිවීමත්, ආශ්වාදයත්, ආදීනවයත්, නිස්සරණයත් ඇති සැටියෙන් නොදනිත් ද; භික්‍ෂූනි, ඔවුන් මට ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස පිළිගත්තෝ හෝ බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස පිළිගත්තෝ නොවෙති. එම ආයුෂ්මතුන් මේ දෘෂ්ටධර්මයේ දී ම තමන් විසින් විශිෂ්ට ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, ශ්‍රමණත්වයේ අරමුණ හෝ බ්‍රාහ්මණත්වයේ අරමුණ සම්පූර්ණ කොට වාසය නොකරත්.\n\nභික්‍ෂූනි, යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ වේදනා තුනේ හටගැනීමත්, නැතිවීමත්, ආශ්වාදයත්, ආදීනවයත්, නිස්සරණයත් ඇති සැටියෙන් දනිත් ද; භික්‍ෂූනි, ඔවුන් මට ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස පිළිගත්තෝ ද වෙති, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස පිළිගත්තෝ ද වෙති. එම ආයුෂ්මතුන් මේ දෘෂ්ටධර්මයේ දී ම තමන් විසින් විශිෂ්ට ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, ශ්‍රමණත්වයේ අරමුණ ද බ්‍රාහ්මණත්වයේ අරමුණ ද සම්පූර්ණ කොට වාසය කරත්.",
      "paliTitle": "Paṭhamasamaṇabrāhmaṇasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 276,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā imāsaṃ tissannaṃ vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti…pe… pajānanti…pe… sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these three are feelings. Which three? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. Any recluses or brahmins, monks, who do not understand as they truly are the origin, the disappearance, the gratification, the danger, and the escape from these three feelings, do not directly realize for themselves nor abide having attained the ultimate state. However, those who *do* understand as they truly are the origin, the disappearance, the gratification, the danger, and the escape from these three feelings, having directly realized it for themselves, they abide having attained it.",
      "sinhala": "මහණෙනි, මේ වේදනා තුනකි. කවරේද ඒ තුන? සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව යන මේවාය.\n\nමහණෙනි, යම්කිසි ශ‍්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ මේ වේදනා තුනේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද තත්‍වාකාරයෙන් නොදන්නේ නම්, ඔවුහු ශ‍්‍රමණයන් අතර ශ‍්‍රමණයන් ලෙස හෝ බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස හෝ නොසැලකෙති. තමන් විසින් අභිඥා ඥානයෙන් අවබෝධ කරගෙන, ප‍්‍රත්‍යක්ෂ කරගෙන, ශ‍්‍රමණභාවයේ හෝ බ්‍රාහ්මණභාවයේ පරමාර්ථය වන නිවනට පැමිණ වාසය කරන්නේ යැයි ද කිව නොහැක. එහෙත් යම්කිසි ශ‍්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ මේ වේදනා තුනේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද තත්‍වාකාරයෙන් දන්නේ නම්, ඔවුහු ශ‍්‍රමණයන් අතර ශ‍්‍රමණයන් ලෙස හෝ බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස හෝ සැලකෙති. ඔවුහු තමන් විසින්ම අභිඥා ඥානයෙන් අවබෝධ කරගෙන, ප‍්‍රත්‍යක්ෂ කරගෙන, ශ‍්‍රමණභාවයේ හෝ බ්‍රාහ්මණභාවයේ පරමාර්ථය වන නිවනට පැමිණ වාසය කරති.",
      "paliTitle": "Dutiyasamaṇabrāhmaṇasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 277,
      "pali": "‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā vedanaṃ nappajānanti, vedanāsamudayaṃ nappajānanti, vedanānirodhaṃ nappajānanti, vedanānirodhagāminiṃ paṭipadaṃ nappajānanti…pe… pajānanti…pe… sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Navamaṃ.",
      "english": "Indeed, monks, whatever ascetics or brahmins do not fully understand feeling, do not fully understand the origin of feeling, do not fully understand the cessation of feeling, and do not fully understand the path leading to the cessation of feeling—those venerable ones are not truly reckoned as ascetics or brahmins among ascetics and brahmins, nor do they acknowledge themselves to be true ascetics or brahmins.\n\nHowever, monks, whatever ascetics or brahmins *do* fully understand feeling, *do* fully understand the origin of feeling, *do* fully understand the cessation of feeling, and *do* fully understand the path leading to the cessation of feeling—those venerable ones *are* truly reckoned as ascetics and brahmins among ascetics and brahmins, and they *do* acknowledge themselves to be true ascetics and brahmins. Having directly known and realized it for themselves, they attain and abide.",
      "sinhala": "මහණෙනි, යම් කිසි මහණ බමුණෝ වේවා, බමුණෝ වේවා, වේදනාවත්, වේදනාවේ හටගැනීමත්, වේදනාවේ නැතිවීමත්, වේදනාව නැතිවීමේ මාර්ගයත් මැනවින් නොදනිත් ද; එසේම දන්නා යුතු අනෙකුත් සියලු ධර්මයන් ද මැනවින් නොදනිත් ද; එහෙත්, යම් කිසි මහණ බමුණෝ වේදනාවත්, වේදනාවේ හටගැනීමත්, වේදනාවේ නැතිවීමත්, වේදනාව නැතිවීමේ මාර්ගයත් මැනවින් දනිත් ද; එසේම දන්නා යුතු අනෙකුත් සියලු ධර්මයන් ද මැනවින් දනිත් ද; ඔවුහු තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට අවබෝධ කොට වාසය කරති.",
      "paliTitle": "Tatiyasamaṇabrāhmaṇasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 278,
      "pali": "‘‘Tisso imā, bhikkhave, vedanā. Katamā tisso? Sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā – imā kho, bhikkhave, tisso vedanā’’ti. Dasamaṃ.",
      "english": "Monks, there are these three feelings. Which three? Pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling. These, monks, are indeed the three feelings.",
      "sinhala": "භික්ෂූණි, මේ වේදනාවෝ තුනක් වෙති. එම තුන කවරේද? සැප වේදනාව, දුක් වේදනාව, දුක් ද නොවන සැප ද නොවන වේදනාව - භික්ෂූණි, මේ වේදනාවෝ තුන යි.",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    },
    {
      "number": 279,
      "pali": "‘‘Atthi, bhikkhave, sāmisā pīti, atthi nirāmisā pīti, atthi nirāmisā nirāmisatarā pīti; atthi sāmisaṃ sukhaṃ, atthi nirāmisaṃ sukhaṃ, atthi nirāmisā nirāmisataraṃ sukhaṃ; atthi sāmisā upekkhā, atthi nirāmisā upekkhā, atthi nirāmisā nirāmisatarā upekkhā; atthi sāmiso vimokkho, atthi nirāmiso vimokkho, atthi nirāmisā nirāmisataro vimokkho. Katamā ca, bhikkhave, sāmisā pīti? Pañcime, bhikkhave, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā…pe… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Ime kho, bhikkhave, pañca kāmaguṇā. Yā kho, bhikkhave, ime pañca kāmaguṇe paṭicca uppajjati pīti, ayaṃ vuccati, bhikkhave, sāmisā pīti. ‘‘Katamā ca, bhikkhave, nirāmisā pīti? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, nirāmisā pīti. ‘‘Katamā ca, bhikkhave, nirāmisā nirāmisatarā pīti? Yā kho, bhikkhave, khīṇāsavassa bhikkhuno rāgā cittaṃ vimuttaṃ paccavekkhato, dosā cittaṃ vimuttaṃ paccavekkhato, mohā cittaṃ vimuttaṃ paccavekkhato uppajjati pīti, ayaṃ vuccati, bhikkhave, nirāmisā nirāmisatarā pīti. ‘‘Katamañca, bhikkhave, sāmisaṃ sukhaṃ? Pañcime, bhikkhave, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā…pe… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Ime kho, bhikkhave, pañca kāmaguṇā. Yaṃ kho, bhikkhave, ime pañca kāmaguṇe paṭicca uppajjati sukhaṃ somanassaṃ, idaṃ vuccati, bhikkhave, sāmisaṃ sukhaṃ. ‘‘Katamañca, bhikkhave, nirāmisaṃ sukhaṃ? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati, bhikkhave, nirāmisaṃ sukhaṃ. ‘‘Katamañca, bhikkhave, nirāmisā nirāmisataraṃ sukhaṃ? Yaṃ kho, bhikkhave, khīṇāsavassa bhikkhuno rāgā cittaṃ vimuttaṃ paccavekkhato, dosā cittaṃ vimuttaṃ paccavekkhato, mohā cittaṃ vimuttaṃ paccavekkhato uppajjati sukhaṃ somanassaṃ, idaṃ vuccati, bhikkhave, nirāmisā nirāmisataraṃ sukhaṃ. ‘‘Katamā ca, bhikkhave, sāmisā upekkhā? Pañcime, bhikkhave, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā…pe… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Ime kho, bhikkhave, pañca kāmaguṇā. Yā kho, bhikkhave, ime pañca kāmaguṇe paṭicca uppajjati upekkhā, ayaṃ vuccati, bhikkhave, sāmisā upekkhā. ‘‘Katamā ca, bhikkhave, nirāmisā upekkhā? Idha, bhikkhave, bhikkhu sukhassa ca pahānā, dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā, adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, nirāmisā upekkhā. ‘‘Katamā ca, bhikkhave, nirāmisā nirāmisatarā upekkhā? Yā kho, bhikkhave, khīṇāsavassa bhikkhuno rāgā cittaṃ vimuttaṃ paccavekkhato, dosā cittaṃ vimuttaṃ paccavekkhato, mohā cittaṃ vimuttaṃ paccavekkhato uppajjati upekkhā, ayaṃ vuccati, bhikkhave, nirāmisā nirāmisatarā upekkhā. ‘‘Katamo ca, bhikkhave, sāmiso vimokkho? Rūpappaṭisaṃyutto vimokkho sāmiso vimokkho. ‘‘Katamo ca, bhikkhave, nirāmiso vimokkho? Arūpappaṭisaṃyutto vimokkho nirāmiso vimokkho. ‘‘Katamo ca, bhikkhave, nirāmisā nirāmisataro vimokkho? Yo kho, bhikkhave, khīṇāsavassa bhikkhuno rāgā cittaṃ vimuttaṃ paccavekkhato, dosā cittaṃ vimuttaṃ paccavekkhato, mohā cittaṃ vimuttaṃ paccavekkhato uppajjati vimokkho, ayaṃ vuccati, bhikkhave, nirāmisā nirāmisataro vimokkho’’ti. Ekādasamaṃ. Aṭṭhasatapariyāyavaggo tatiyo. Tassuddānaṃ – Sīvakaaṭṭhasataṃ bhikkhu, pubbe ñāṇañca bhikkhunā; Samaṇabrāhmaṇā tīṇi, suddhikañca nirāmisanti. ",
      "english": "There are, monks, material rapture, there is spiritual rapture, there is rapture even more sublime than spiritual rapture. There is material happiness, there is spiritual happiness, there is happiness even more sublime than spiritual happiness. There is material equanimity, there is spiritual equanimity, there is equanimity even more sublime than spiritual equanimity. There is material liberation, there is spiritual liberation, there is liberation even more sublime than spiritual liberation.\n\nAnd what, monks, is material rapture? These five, monks, are strands of sensual pleasure. Which five? Visible forms cognizable by the eye; sounds cognizable by the ear; odours cognizable by the nose; tastes cognizable by the tongue; and tangible objects cognizable by the body—all of which are desirable, agreeable, pleasing, lovely, connected with sensual desire, and stimulating passion. These, monks, are the five strands of sensual pleasure. The rapture, monks, that arises dependent on these five strands of sensual pleasure, this is called material rapture.\n\nAnd what, monks, is spiritual rapture? Here, monks, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, with rapture and happiness. With the subsiding of applied thought and sustained thought, he attains internal purification and unification of mind, and enters and dwells in the second jhāna, which is without applied thought and sustained thought, born of concentration, with rapture and happiness. This, monks, is called spiritual rapture.\n\nAnd what, monks, is rapture even more sublime than spiritual rapture? The rapture, monks, that arises for a monk whose taints are destroyed, who reviews his mind as liberated from lust, liberated from hatred, and liberated from delusion—this is called rapture even more sublime than spiritual rapture.\n\nAnd what, monks, is material happiness? These five, monks, are strands of sensual pleasure. Which five? Visible forms cognizable by the eye; sounds cognizable by the ear; odours cognizable by the nose; tastes cognizable by the tongue; and tangible objects cognizable by the body—all of which are desirable, agreeable, pleasing, lovely, connected with sensual desire, and stimulating passion. These, monks, are the five strands of sensual pleasure. The happiness and joy, monks, that arise dependent on these five strands of sensual pleasure, this is called material happiness.\n\nAnd what, monks, is spiritual happiness? Here, monks, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, with rapture and happiness. With the subsiding of applied thought and sustained thought, he attains internal purification and unification of mind, and enters and dwells in the second jhāna, which is without applied thought and sustained thought, born of concentration, with rapture and happiness. With the fading of rapture, he dwells in equanimity, mindful and clearly comprehending, and he experiences happiness with the body about which the noble ones declare: ‘He dwells in happiness with equanimity and mindfulness.’ Thus he enters and dwells in the third jhāna. This, monks, is called spiritual happiness.\n\nAnd what, monks, is happiness even more sublime than spiritual happiness? The happiness and joy, monks, that arise for a monk whose taints are destroyed, who reviews his mind as liberated from lust, liberated from hatred, and liberated from delusion—this is called happiness even more sublime than spiritual happiness.\n\nAnd what, monks, is material equanimity? These five, monks, are strands of sensual pleasure. Which five? Visible forms cognizable by the eye; sounds cognizable by the ear; odours cognizable by the nose; tastes cognizable by the tongue; and tangible objects cognizable by the body—all of which are desirable, agreeable, pleasing, lovely, connected with sensual desire, and stimulating passion. These, monks, are the five strands of sensual pleasure. The equanimity, monks, that arises dependent on these five strands of sensual pleasure, this is called material equanimity.\n\nAnd what, monks, is spiritual equanimity? Here, monks, a monk, by the abandoning of pleasure and by the abandoning of pain—and with the previous disappearance of joy and grief—enters and dwells in the fourth jhāna, which is neither painful nor pleasurable, and is purified by equanimity and mindfulness. This, monks, is called spiritual equanimity.\n\nAnd what, monks, is equanimity even more sublime than spiritual equanimity? The equanimity, monks, that arises for a monk whose taints are destroyed, who reviews his mind as liberated from lust, liberated from hatred, and liberated from delusion—this is called equanimity even more sublime than spiritual equanimity.\n\nAnd what, monks, is material liberation? Liberation connected with form is material liberation.\n\nAnd what, monks, is spiritual liberation? Liberation connected with the formless is spiritual liberation.\n\nAnd what, monks, is liberation even more sublime than spiritual liberation? The liberation, monks, that arises for a monk whose taints are destroyed, who reviews his mind as liberated from lust, liberated from hatred, and liberated from delusion—this is called liberation even more sublime than spiritual liberation.\n\nThe Third Chapter: The Chapter on the One Hundred and Eight Modes. Its summary is: Sīvaka's One Hundred and Eight, a Monk, and Past Knowledge by a Monk; three Suttas on Recluses and Brahmins, the Pure, and the Disinterested.",
      "sinhala": "භික්‍ෂූනි, ආමිස ප්‍රීතියක් ඇත, නිරාමිස ප්‍රීතියක් ඇත, නිරාමිස ප්‍රීතියටත් වඩා නිරාමිස ප්‍රීතියක් ඇත; ආමිස සැපයක් ඇත, නිරාමිස සැපයක් ඇත, නිරාමිස සැපයටත් වඩා නිරාමිස සැපයක් ඇත; ආමිස උපේක්‍ෂාවක් ඇත, නිරාමිස උපේක්‍ෂාවක් ඇත, නිරාමිස උපේක්‍ෂාවටත් වඩා නිරාමිස උපේක්‍ෂාවක් ඇත; ආමිස විමුක්තියක් ඇත, නිරාමිස විමුක්තියක් ඇත, නිරාමිස විමුක්තියටත් වඩා නිරාමිස විමුක්තියක් ඇත.\n\nභික්‍ෂූනි, ආමිස ප්‍රීතිය කවරේද? භික්‍ෂූනි, මේ පංච කාමගුණයෝය. කවර පංච කාමගුණයෝද? ඇසින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය රූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු රූපයෝය…පෙ… කයින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය රූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු ඵොට්ඨබ්බයෝය. භික්‍ෂූනි, මේ පංච කාමගුණයෝය. භික්‍ෂූනි, මේ පංච කාමගුණයන් අරමුණු කොට යම් ප්‍රීතියක් උපදී ද, භික්‍ෂූනි, මෙය ආමිස ප්‍රීතිය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, නිරාමිස ප්‍රීතිය කවරේද? භික්‍ෂූනි, මෙහිලා භික්‍ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක විචාරයන් සංසිඳීමෙන්, අභ්‍යන්තර පැහැදීම ඇති, සිතේ එකඟ බව ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. භික්‍ෂූනි, මෙය නිරාමිස ප්‍රීතිය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, නිරාමිස ප්‍රීතියටත් වඩා නිරාමිස ප්‍රීතිය කවරේද? භික්‍ෂූනි, ක්ෂීණාශ්‍රව භික්‍ෂුවකට රාගයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, ද්වේෂයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, මෝහයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට යම් ප්‍රීතියක් උපදී ද, භික්‍ෂූනි, මෙය නිරාමිස ප්‍රීතියටත් වඩා නිරාමිස ප්‍රීතිය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, ආමිස සැපය කවරේද? භික්‍ෂූනි, මේ පංච කාමගුණයෝය. කවර පංච කාමගුණයෝද? ඇසින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය රූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු රූපයෝය…පෙ… කයින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය රූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු ඵොට්ඨබ්බයෝය. භික්‍ෂූනි, මේ පංච කාමගුණයෝය. භික්‍ෂූනි, මේ පංච කාමගුණයන් අරමුණු කොට යම් සැපයක්, සෝමනස්සයක් උපදී ද, භික්‍ෂූනි, මෙය ආමිස සැපය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, නිරාමිස සැපය කවරේද? භික්‍ෂූනි, මෙහිලා භික්‍ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක විචාරයන් සංසිඳීමෙන්, අභ්‍යන්තර පැහැදීම ඇති, සිතේ එකඟ බව ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියේ ද විරාගය නිසා, උපේක්‍ෂාවෙන් වාසය කරයි, සිහි ඇතිව, මනා නුවණින් යුතුව ශරීරයෙන් සැපය අත්විඳී. ‘උපේක්‍ෂා ඇත්තෙක්, සිහි ඇත්තෙක්, සැප විහරණයෙන් යුක්තයෙක්’ යැයි ආර්යයෝ යමක් පවසත් ද, එබඳු තෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. භික්‍ෂූනි, මෙය නිරාමිස සැපය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, නිරාමිස සැපයටත් වඩා නිරාමිස සැපය කවරේද? භික්‍ෂූනි, ක්ෂීණාශ්‍රව භික්‍ෂුවකට රාගයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, ද්වේෂයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, මෝහයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට යම් සැපයක්, සෝමනස්සයක් උපදී ද, භික්‍ෂූනි, මෙය නිරාමිස සැපයටත් වඩා නිරාමිස සැපය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, ආමිස උපේක්‍ෂාව කවරේද? භික්‍ෂූනි, මේ පංච කාමගුණයෝය. කවර පංච කාමගුණයෝද? ඇසින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය රූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු රූපයෝය…පෙ… කයින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය රූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු ඵොට්ඨබ්බයෝය. භික්‍ෂූනි, මේ පංච කාමගුණයෝය. භික්‍ෂූනි, මේ පංච කාමගුණයන් අරමුණු කොට යම් උපේක්‍ෂාවක් උපදී ද, භික්‍ෂූනි, මෙය ආමිස උපේක්‍ෂාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, නිරාමිස උපේක්‍ෂාව කවරේද? භික්‍ෂූනි, මෙහිලා භික්‍ෂුව සැපය ද දුක ද ප්‍රහාණය කිරීමෙන්, පෙර විසූ සෝමනස්ස දොමනස්සයන්ගේ අස්තංගමයෙන්, දුක් ද නොවන, සැප ද නොවන, උපේක්‍ෂා-සති පාරිශුද්ධිය ඇති සිව්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි. භික්‍ෂූනි, මෙය නිරාමිස උපේක්‍ෂාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, නිරාමිස උපේක්‍ෂාවටත් වඩා නිරාමිස උපේක්‍ෂාව කවරේද? භික්‍ෂූනි, ක්ෂීණාශ්‍රව භික්‍ෂුවකට රාගයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, ද්වේෂයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, මෝහයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට යම් උපේක්‍ෂාවක් උපදී ද, භික්‍ෂූනි, මෙය නිරාමිස උපේක්‍ෂාවටත් වඩා නිරාමිස උපේක්‍ෂාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, ආමිස විමුක්තිය කවරේද? රූපයට සම්බන්ධ වූ විමුක්තිය ආමිස විමුක්තිය වේ.\n\nභික්‍ෂූනි, නිරාමිස විමුක්තිය කවරේද? අරූපයට සම්බන්ධ වූ විමුක්තිය නිරාමිස විමුක්තිය වේ.\n\nභික්‍ෂූනි, නිරාමිස විමුක්තියටත් වඩා නිරාමිස විමුක්තිය කවරේද? භික්‍ෂූනි, ක්ෂීණාශ්‍රව භික්‍ෂුවකට රාගයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, ද්වේෂයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට, මෝහයෙන් සිත මිදුණු බව ප්‍රත්‍යවේක්‍ෂා කරන විට යම් විමුක්තියක් උපදී ද, භික්‍ෂූනි, මෙය නිරාමිස විමුක්තියටත් වඩා නිරාමිස විමුක්තිය යැයි කියනු ලැබේ.\n\nතෙවැනි වග්ගය අටසත පරියාය වග්ගය යි.\nඑහි උද්දානය නම්: සීවක, අටසත, භික්ෂූ; පෙර ඥාණය ද භික්ෂුන් විසින්; සමණයෝ බ්‍ර​ාහ්මණයෝ තුණ; සුද්ධික ද නිරාමිස ද යන මේවා යි.",
      "paliTitle": "Nirāmisasuttaṃ",
      "vagga": "Aṭṭhasatapariyāyavaggo"
    }
  ],
  "footer": {
    "pali": "Vedanāsaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}