{
  "id": "sn.5.9",
  "title": {
    "pali": "Jhānasaṃyuttaṃ",
    "english": "The Connected Discourses on Meditative Absorption",
    "sinhala": "ධ්‍යාන සංයුත්තය"
  },
  "sections": [
    {
      "number": 923,
      "numberRange": "923-934",
      "pali": "Sāvatthinidānaṃ ‘‘cattāro me, bhikkhave, jhānā. Katame cattāro? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Ime kho, bhikkhave, cattāro jhānā’’ti. ‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro jhāne bhāvento cattāro jhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu cattāro jhāne bhāvento cattāro jhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu cattāro jhāne bhāvento cattāro jhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. Gaṅgāpeyyālavaggo paṭhamo. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamādavaggo vitthāretabbo. Tassuddānaṃ – Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sāro ca vassikaṃ; Rājā candimasūriyā, vatthena dasamaṃ padanti. Balakaraṇīyavaggo vitthāretabbo. Tassuddānaṃ – Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā; Ākāsena ca dve meghā, nāvā āgantukā nadīti. Esanāvaggo vitthāretabbo. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "“Monks, these are the four jhānas. Which four?\n\nHere, monks, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and pleasure. With the fading away of initial and sustained application, he enters and dwells in the second jhāna, which has internal confidence and unification of mind, is without initial application and sustained application, born of concentration, filled with rapture and pleasure. With the fading of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body; he enters and dwells in the third jhāna, of which the Noble Ones declare: ‘He is equanimous, mindful, one who dwells in pleasure.’ With the abandonment of pleasure and pain, and with the previous disappearance of joy and sorrow, he enters and dwells in the fourth jhāna, which is beyond pleasure and pain, purified by equanimity and mindfulness. These, monks, are the four jhānas.\n\nJust as, monks, the river Ganges flows, tends, and inclines towards the east, so too, monks, a bhikkhu who develops the four jhānas, who frequently practices the four jhānas, flows, tends, and inclines towards Nibbāna. And how, monks, does a bhikkhu who develops the four jhānas, who frequently practices the four jhānas, flow, tend, and incline towards Nibbāna? Here, monks, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and pleasure. With the fading away of initial and sustained application, he enters and dwells in the second jhāna, which has internal confidence and unification of mind, is without initial application and sustained application, born of concentration, filled with rapture and pleasure. With the fading of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body; he enters and dwells in the third jhāna, of which the Noble Ones declare: ‘He is equanimous, mindful, one who dwells in pleasure.’ With the abandonment of pleasure and pain, and with the previous disappearance of joy and sorrow, he enters and dwells in the fourth jhāna, which is beyond pleasure and pain, purified by equanimity and mindfulness. It is in this way, monks, that a bhikkhu who develops the four jhānas, who frequently practices the four jhānas, flows, tends, and inclines towards Nibbāna.\n\nThe twelfth. The first is the Chapter on the Ganges with the Refrain. Its summary verses are:\nSix are those that incline to the east, and six are those that incline to the ocean;\nThese two sets of six make twelve, thus the chapter is declared.\nThe Chapter on Diligence is to be expanded. Its summary verses are:\nTathāgata, Foot, Peak, Root, Essence, Rainy season;\nKing, Moon, Sun, Cloak are the tenth item.\nThe Chapter on Conditions for Strength is to be expanded. Its summary verses are:\nStrength, Seed, Nāga, Tree, Pot, Ear of corn;\nTwo clouds by sky, Boat, Guest, River.\nThe Chapter on Investigations is to be expanded. Its summary verses are:\nInvestigation, Speculation, Fermentation, Becoming, and Threefold Suffering;\nFallow land, Stain, Affliction, and Feeling, Craving, Thirst.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\n“මහණෙනි, මේ ධ්‍යාන සතරකි. කවරේද ඒ සතර? මහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීති සහ සුඛය සහිත වූ පළමු ධ්‍යානය උපදවාගෙන වාසය කරයි. විතර්ක සහ විචාරයන් සංසිඳීමෙන්, අධ්‍යාත්මිකව සිත පහදවා ගැනීමෙන්, සිතේ එකඟතාවය ඇතිකර ගැනීමෙන්, විතර්ක රහිතව, විචාර රහිතව, සමාධියෙන් හටගත් ප්‍රීති සහ සුඛය සහිත වූ දෙවන ධ්‍යානය උපදවාගෙන වාසය කරයි. ප්‍රීතිය කෙරෙහි නොඇල්මෙන් යුක්තව, උපේක්ෂාවෙන් යුක්තව වාසය කරයි. සිහි නුවණින් යුක්තව, කයින් සුවය විඳියි. යමක් ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්ත වූ, සිහි නුවණින් යුක්ත වූ, සුවයෙන් වාසය කරන්නා වූ පුද්ගලයා’ යැයි පවසත්ද, එබඳු වූ තෙවන ධ්‍යානය උපදවාගෙන වාසය කරයි. සුවයත් දුකත් ප්‍රහාණය කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන්ගේ අස්තංගමණයෙන්, දුක් ද නොවන සුව ද නොවන, උපේක්ෂාවෙන් හා ස්මෘතියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානය උපදවාගෙන වාසය කරයි. මහණෙනි, මේ ධ්‍යාන සතර නම් මේවාය.”\n\n“මහණෙනි, යම්සේ ගංගා නදිය නැගෙනහිරට නැඹුරු වී ද, නැගෙනහිරට බර වී ද, නැගෙනහිරට ගලා බසී ද; එපරිද්දෙන්ම, මහණෙනි, භික්ෂුව ධ්‍යාන සතර වඩන විට, ධ්‍යාන සතර බහුල වශයෙන් කරන විට, නිර්වාණයට නැඹුරු වූවෙක්, නිර්වාණයට බර වූවෙක්, නිර්වාණයට ගලා බසින්නෙක් වේ. මහණෙනි, භික්ෂුව ධ්‍යාන සතර වඩන විට, ධ්‍යාන සතර බහුල වශයෙන් කරන විට, කෙසේ නම් නිර්වාණයට නැඹුරු වූවෙක්, නිර්වාණයට බර වූවෙක්, නිර්වාණයට ගලා බසින්නෙක් වේ ද? මහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීති සහ සුඛය සහිත වූ පළමු ධ්‍යානය උපදවාගෙන වාසය කරයි. විතර්ක සහ විචාරයන් සංසිඳීමෙන්, අධ්‍යාත්මිකව සිත පහදවා ගැනීමෙන්, සිතේ එකඟතාවය ඇතිකර ගැනීමෙන්, විතර්ක රහිතව, විචාර රහිතව, සමාධියෙන් හටගත් ප්‍රීති සහ සුඛය සහිත වූ දෙවන ධ්‍යානය උපදවාගෙන වාසය කරයි. ප්‍රීතිය කෙරෙහි නොඇල්මෙන් යුක්තව, උපේක්ෂාවෙන් යුක්තව වාසය කරයි. සිහි නුවණින් යුක්තව, කයින් සුවය විඳියි. යමක් ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්ත වූ, සිහි නුවණින් යුක්ත වූ, සුවයෙන් වාසය කරන්නා වූ පුද්ගලයා’ යැයි පවසත්ද, එබඳු වූ තෙවන ධ්‍යානය උපදවාගෙන වාසය කරයි. සුවයත් දුකත් ප්‍රහාණය කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන්ගේ අස්තංගමණයෙන්, දුක් ද නොවන සුව ද නොවන, උපේක්ෂාවෙන් හා ස්මෘතියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානය උපදවාගෙන වාසය කරයි. මහණෙනි, මෙසේ භික්ෂුව ධ්‍යාන සතර වඩන විට, ධ්‍යාන සතර බහුල වශයෙන් කරන විට, නිර්වාණයට නැඹුරු වූවෙක්, නිර්වාණයට බර වූවෙක්, නිර්වාණයට ගලා බසින්නෙක් වේ.”\n\nදොළොස්වන සූත්‍රයයි.\n\nගංගාපෙය්‍යාල වග්ගය පළමුවැන්නයි. එහි උද්දානය –\nනැගෙනහිරට නැඹුරු වූ සූත්‍ර සයක්, සමුද්‍රයට නැඹුරු වූ සූත්‍ර සයක්;\nඒ සය දෙක දොළොසක් වේ, ඒ නිසා වග්ගය එසේ කියනු ලැබේ.\n\nඅප්‍රමාද වග්ගය විස්තර කළ යුතුයි. එහි උද්දානය –\nතථාගත, පද, කූට, මූල, සාර, වස්සික; රාජා, චන්ද්‍රිමා, සූරියා, වත්ථ යන දස පදයෝ වෙති.\n\nබලකරණීය වග්ගය විස්තර කළ යුතුයි. එහි උද්දානය –\nබල, බීජ, නාග, රුක්ඛ, කුම්භ, සූකී; ආකාස, මෙඝ දෙක, නාවා, ආගන්තුක, නදී යන පදයෝ වෙති.\n\nඑසනා වග්ගය විස්තර කළ යුතුයි. එහි උද්දානය –\nඑසනා, විධා, ආසව, භව, දුක්ඛතා තුනක්; ඛිල, මල, නීඝ, වේදනා, තණ්හා, තසිනා යන පදයෝ වෙති.",
      "paliTitle": "Jhānādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo"
    },
    {
      "number": 967,
      "numberRange": "967-976",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro jhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro jhānā bhāvetabbā’’ti vitthāretabbaṃ. Dasamaṃ. (Yathā maggasaṃyuttaṃ tathā vitthāretabbaṃ). Oghavaggo pañcamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti. ",
      "english": "Monks, there are these five higher fetters. Which five? Craving for form existence, craving for formless existence, conceit, restlessness, and ignorance – these, monks, are the five higher fetters. For the direct knowledge, full understanding, utter destruction, and relinquishment of these five higher fetters, the four meditative absorptions must be developed. Which four? Here, monks, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first meditative absorption, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and pleasure. With the fading away of initial application and sustained application, with internal tranquility and unification of mind, he enters and dwells in the second meditative absorption, which is without initial application and sustained application, born of concentration, and filled with rapture and pleasure. With the fading of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body, and enters and dwells in the third meditative absorption, of which the Noble Ones declare: 'He dwells in equanimity, mindful, and blissful.' With the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, he enters and dwells in the fourth meditative absorption, which is neither painful nor pleasant, but is purified by equanimity and mindfulness. For the direct knowledge, full understanding, utter destruction, and relinquishment of these five higher fetters, these four meditative absorptions must be developed.",
      "sinhala": "මහණෙනි, මේ ඉහළ භවයන්ට සම්බන්ධ වූ සංයෝජන (කෙලෙස්) පහකි. ඒ පහ කවරේද? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාවයි. මහණෙනි, මේවා නම් ඉහළ භවයන්ට සම්බන්ධ වූ සංයෝජන පහයි. මහණෙනි, මේ ඉහළ භවයන්ට සම්බන්ධ වූ සංයෝජන පහ පිළිබඳව අවබෝධය පිණිසත්, පිරිසිඳ දැකීම පිණිසත්, ක්ෂය කිරීම පිණිසත්, ප්‍රහාණය කිරීම පිණිසත් ධ්‍යාන සතරක් වැඩිය යුතුයි. ඒ සතර කවරේද?\n\nමහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්ව ද, අකුසල ධර්මයන්ගෙන් වෙන්ව ද විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක විචාරයන් සංසිඳීමෙන් අභ්‍යන්තරයේ පැහැදීම ඇති, සිතේ එකඟතාව ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති දෙවන ධ්‍යානයට...තෙවන ධ්‍යානයට...සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. මහණෙනි, මේ ඉහළ භවයන්ට සම්බන්ධ වූ සංයෝජන පහ පිළිබඳව අවබෝධය පිණිසත්, පිරිසිඳ දැකීම පිණිසත්, ක්ෂය කිරීම පිණිසත්, ප්‍රහාණය කිරීම පිණිසත් මේ ධ්‍යාන සතර වැඩිය යුතු යැයි මෙසේ විස්තර කළ යුතුයි.\n\nදසවැන්නයි. ඕඝවර්ගය පස්වැන්නයි. එහි සූත්‍ර නාමාවලිය: ඕඝය, යෝගය, උපාදානය, ග්‍රන්ථ (බැඳීම්), අනුශය; කාමගුණ, නීවරණ, ස්කන්ධ, ඕරම්භාගීය (පහළ භවයන්ට සම්බන්ධ) සහ උද්ධම්භාගීය (ඉහළ භවයන්ට සම්බන්ධ) වේ.",
      "paliTitle": "Oghādisuttaṃ",
      "vagga": "Oghavaggo"
    }
  ],
  "footer": {
    "pali": "Jhānasaṃyuttaṃ navamaṃ.",
    "english": "",
    "sinhala": ""
  }
}