{
  "id": "sn.5.6",
  "title": {
    "pali": "Balasaṃyuttaṃ",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 705,
      "numberRange": "705-716",
      "pali": "‘‘Pañcimāni, bhikkhave, balāni. Katamāni pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – imāni kho, bhikkhave, pañca balānīti. Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu pañca balāni bhāvento pañcabalāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu saddhābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, vīriyabalaṃ…pe… satibalaṃ… samādhibalaṃ… paññābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. Gaṅgāpeyyālavaggo paṭhamo. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamādavaggo vitthāretabbo. Tassuddānaṃ – Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sārena vassikaṃ; Rājā candimasūriyā, vatthena dasamaṃ padanti. Balakaraṇīyavaggo vitthāretabbo. Tassuddānaṃ – Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā; Ākāsena ca dve meghā, nāvā āgantukā nadīti. Esanāvaggo vitthāretabbo. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Balādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo"
    },
    {
      "number": 749,
      "numberRange": "749-758",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya pañca balāni bhāvetabbāni. Katamāni pañca? Idha, bhikkhave, bhikkhu, saddhābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, vīriyabalaṃ… pe… satibalaṃ…pe… samādhibalaṃ…pe… paññābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya imāni pañca balāni bhāvetabbānī’’ti. (Evaṃ vitthāretabbā). Dasamaṃ. Oghavaggo pañcamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo"
    },
    {
      "number": 759,
      "numberRange": "759-770",
      "pali": "‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu, saddhābalaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ…pe… evaṃ kho, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. (Vitthāretabbā) dvādasamaṃ. Gaṅgāpeyyālavaggo chaṭṭho. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamāda-balakaraṇīyavaggā vitthāretabbā.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pācīnādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo"
    },
    {
      "number": 792,
      "numberRange": "792-802",
      "pali": "Evaṃ esanāpāḷi vitthāretabbā – rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ. Esanāvaggo navamo. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Esanādisuttadvādasakaṃ",
      "vagga": "Esanāvaggo"
    },
    {
      "number": 803,
      "numberRange": "803-812",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya pañca balāni bhāvetabbāni. Katamāni pañca? Idha, bhikkhave, bhikkhu saddhābalaṃ bhāveti…pe… paññābalaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya imāni pañca balāni bhāvetabbānī’’ti. Dasamaṃ. Oghavaggo dasamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo"
    }
  ],
  "footer": {
    "pali": "Balasaṃyuttaṃ chaṭṭhaṃ.",
    "english": "",
    "sinhala": ""
  }
}