{
  "id": "sn.5.6",
  "title": {
    "pali": "Balasaṃyuttaṃ",
    "english": "The Connected Discourses on Powers",
    "sinhala": "බල සංයුත්තය"
  },
  "sections": [
    {
      "number": 705,
      "numberRange": "705-716",
      "pali": "‘‘Pañcimāni, bhikkhave, balāni. Katamāni pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – imāni kho, bhikkhave, pañca balānīti. Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu pañca balāni bhāvento pañcabalāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu saddhābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, vīriyabalaṃ…pe… satibalaṃ… samādhibalaṃ… paññābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. Gaṅgāpeyyālavaggo paṭhamo. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamādavaggo vitthāretabbo. Tassuddānaṃ – Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sārena vassikaṃ; Rājā candimasūriyā, vatthena dasamaṃ padanti. Balakaraṇīyavaggo vitthāretabbo. Tassuddānaṃ – Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā; Ākāsena ca dve meghā, nāvā āgantukā nadīti. Esanāvaggo vitthāretabbo. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "Monks, there are these five powers. Which five? The power of conviction, the power of persistent effort, the power of mindfulness, the power of concentration, the power of wisdom – these, monks, are the five powers. Just as, monks, the river Ganges slopes, inclines, and tends towards the east; in the same way, monks, a bhikkhu who develops these five powers, who makes them abundant, slopes, inclines, and tends towards Nibbāna. And how, monks, does a bhikkhu who develops these five powers, who makes them abundant, slope, incline, and tend towards Nibbāna? Here, monks, a bhikkhu develops the power of conviction, supported by seclusion, supported by dispassion, supported by cessation, culminating in relinquishment. He develops the power of persistent effort, supported by seclusion, supported by dispassion, supported by cessation, culminating in relinquishment. He develops the power of mindfulness, supported by seclusion, supported by dispassion, supported by cessation, culminating in relinquishment. He develops the power of concentration, supported by seclusion, supported by dispassion, supported by cessation, culminating in relinquishment. He develops the power of wisdom, supported by seclusion, supported by dispassion, supported by cessation, culminating in relinquishment. It is in this way, monks, that a bhikkhu who develops these five powers, who makes them abundant, slopes, inclines, and tends towards Nibbāna.\n\nThe twelfth. The first section on the Ganges repetitions. Its summary: Six tend to the east, and six tend to the ocean; these two sets of six make twelve, thus the section is named.\n\nThe section on heedfulness is to be elaborated. Its summary: The Tathāgata, the path, the peak, the root, the essence, the rainy season; the king, the moon and sun, the cloth is the tenth point.\n\nThe section on things to be done with power is to be elaborated. Its summary: Power, and the seed, and the serpent, the tree, with the pot, the ear of grain; by means of the sky, and two clouds, the boat, the stranger, the river.\n\nThe section on seeking is to be elaborated. Its summary: Seeking, and ways, the defilement, and becoming, the three kinds of suffering; the fallow, and defilement, and vexation, and feeling, craving, and thirst.",
      "sinhala": "භික්ෂූණි, මේ බලධර්ම පසක් ඇත. කවරේද ඒ පස? ශ‍්‍රද්ධා බලය, වීර්ය බලය, සති බලය, සමාධි බලය, ප‍්‍රඥා බලය යන මේවාය. භික්ෂූණි, මේ බලධර්ම පසයි.\n\nභික්ෂූණි, යම්සේ ගංගා නදිය නැගෙනහිරට පහත බසින්නියක්, නැගෙනහිරට බරවූවක්, නැගෙනහිරට නැබුරුවූවක් වේද; එපරිද්දෙන්ම භික්ෂූණි, යම් භික්ෂුවක් මේ බලධර්ම පස වඩන්නේ නම්, බලධර්ම පස බහුල කරන්නේ නම්, ඔහු නිවනට පහත බසින්නෙක් වේ, නිවනට බරවූවෙක් වේ, නිවනට නැබුරුවූවෙක් වේ.\n\nභික්ෂූණි, කෙසේ නම් භික්ෂුවක් මේ බලධර්ම පස වඩන්නේ නම්, බලධර්ම පස බහුල කරන්නේ නම්, ඔහු නිවනට පහත බසින්නෙක් වේ, නිවනට බරවූවෙක් වේ, නිවනට නැබුරුවූවෙක් වේද?\n\nභික්ෂූණි, මෙහිලා භික්ෂුව විවේකය (තණ්හාදියෙන් වෙන්වීම) පිහිටකොට ගත්, විරාගය (රාගයෙන් මිදීම) පිහිටකොට ගත්, නිරෝධය (දුක් නිරෝධය) පිහිටකොට ගත්, අත්හැරීමට නැඹුරු වූ ශ‍්‍රද්ධා බලය වඩයි. විවේකය පිහිටකොට ගත්, විරාගය පිහිටකොට ගත්, නිරෝධය පිහිටකොට ගත්, අත්හැරීමට නැඹුරු වූ වීර්ය බලය වඩයි. විවේකය පිහිටකොට ගත්, විරාගය පිහිටකොට ගත්, නිරෝධය පිහිටකොට ගත්, අත්හැරීමට නැඹුරු වූ සති බලය වඩයි. විවේකය පිහිටකොට ගත්, විරාගය පිහිටකොට ගත්, නිරෝධය පිහිටකොට ගත්, අත්හැරීමට නැඹුරු වූ සමාධි බලය වඩයි. විවේකය පිහිටකොට ගත්, විරාගය පිහිටකොට ගත්, නිරෝධය පිහිටකොට ගත්, අත්හැරීමට නැඹුරු වූ ප‍්‍රඥා බලය වඩයි.\n\nභික්ෂූණි, මෙපරිද්දෙන්ම භික්ෂුව බලධර්ම පස වඩන්නේ නම්, බලධර්ම පස බහුල කරන්නේ නම්, ඔහු නිවනට පහත බසින්නෙක් වේ, නිවනට බරවූවෙක් වේ, නිවනට නැබුරුවූවෙක් වේ.\n\nදොළොස්වන සූත්‍රයයි. ගංගාපෙය්යාල වර්ගය පළමුවැන්නයි.\n\nඑහි උද්දානය (අනුක‍්‍රමික සාරාංශය) මෙයයි – නැගෙනහිරට නැබුරු වූ සූත්‍ර සයකි, මුහුදට නැබුරු වූ සූත්‍ර සයකි; ඒ සය දෙකක් දොළොසක් වේ, එමගින් වර්ගය කියනු ලැබේ.\n\nඅප්පමාද වර්ගය විස්තර කළ යුතුය.\n\nඑහි උද්දානය මෙයයි – තථාගත, පද, කූට, මූල, සාර, වස්සික; රාජා, චන්දිම, සූරිය, වත්ථ යන දසවන පද වේ.\n\nබලකරණීය වර්ගය විස්තර කළ යුතුය.\n\nඑහි උද්දානය මෙයයි – බල, බීජ, නාග, රුක්ඛ, කුම්භ, සූකියා; ආකාස, ද්වේ මේඝ, නාවා, ආගන්තුක, නදී යන සූත්‍ර වේ.\n\nඑසනා වර්ගය විස්තර කළ යුතුය.\n\nඑහි උද්දානය මෙයයි – එසනා, විධා, ආසව, භව, දුක්ඛතා තිස්සෝ (දුක්ඛ තුන), ඛිල, මල, නීඝ, වේදනා, තණ්හා, තසිනා යන සූත්‍ර වේ.",
      "paliTitle": "Balādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo",
      "englishTitle": "The Twelve Discourses beginning with Power",
      "sinhalaTitle": "බලාදි සූත්‍ර ද්වාදසකය",
      "vaggaEnglish": "Chapter on the Ganges Repetition Series",
      "vaggaSinhala": "ගංගා පෙය්‍යාල වර්ගය"
    },
    {
      "number": 749,
      "numberRange": "749-758",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya pañca balāni bhāvetabbāni. Katamāni pañca? Idha, bhikkhave, bhikkhu, saddhābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, vīriyabalaṃ… pe… satibalaṃ…pe… samādhibalaṃ…pe… paññābalaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya imāni pañca balāni bhāvetabbānī’’ti. (Evaṃ vitthāretabbā). Dasamaṃ. Oghavaggo pañcamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti.",
      "english": "Monks, there are these five higher fetters. Which five are they? Attachment to form, attachment to formlessness, conceit, restlessness, and ignorance – these, Monks, are the five higher fetters. For the direct knowing, thorough comprehension, utter destruction, and complete abandonment of these five higher fetters, Monks, five powers must be developed. Which five are they? Here, Monks, a monk develops the power of faith, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the power of effort, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the power of mindfulness, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the power of concentration, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the power of wisdom, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. For the direct knowing, thorough comprehension, utter destruction, and complete abandonment of these five higher fetters, Monks, these five powers must be developed.",
      "sinhala": "මහණෙනි, මේ උද්ධම්භාගීය සංයෝජන පසකි. කවරේ ද ඒ පස? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාව – මහණෙනි, මේවා ඒ උද්ධම්භාගීය සංයෝජන පසයි. මහණෙනි, මේ උද්ධම්භාගීය සංයෝජන පස අභිඥා ව පිණිස, පිරිඥා ව පිණිස, පරික්ෂ ය පිණිස, ප්‍රහාණය පිණිස බලධර්ම පසක් වැඩිය යුතු යි. කවරේ ද ඒ පස? මහණෙනි, මෙහිලා භික්ෂුව විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ශ්‍රද්ධා බලය වඩයි. (ඒ හා සමානවම) විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති වීර්ය බලය, සති බලය, සමාධි බලය සහ ප්‍රඥා බලය ද වඩයි. මහණෙනි, මේ උද්ධම්භාගීය සංයෝජන පස අභිඥා ව පිණිස, පිරිඥා ව පිණිස, පරික්ෂ ය පිණිස, ප්‍රහාණය පිණිස, මේ බලධර්ම පස වැඩිය යුතු යි.",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo",
      "englishTitle": "The Ten Discourses beginning with the Flood",
      "sinhalaTitle": "ඕඝාදි සූත්‍ර දසකය",
      "vaggaEnglish": "Chapter on Floods",
      "vaggaSinhala": "ඕඝ වර්ගය"
    },
    {
      "number": 759,
      "numberRange": "759-770",
      "pali": "‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu, saddhābalaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ…pe… evaṃ kho, bhikkhave, bhikkhu pañca balāni bhāvento pañca balāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. (Vitthāretabbā) dvādasamaṃ. Gaṅgāpeyyālavaggo chaṭṭho. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamāda-balakaraṇīyavaggā vitthāretabbā.",
      "english": "Just as, monks, the river Ganges slopes, inclines, and tends towards the east, so too, monks, a monk who develops and repeatedly cultivates the five powers slopes, inclines, and tends towards Nibbana.\n\nAnd how, monks, does a monk who develops and repeatedly cultivates the five powers slope, incline, and tend towards Nibbana?\n\nHere, monks, a monk develops the power of faith, which has the ultimate aim of the removal of lust, the ultimate aim of the removal of hatred, and the ultimate aim of the removal of delusion. He develops the power of energy, which has the ultimate aim of the removal of lust, the ultimate aim of the removal of hatred, and the ultimate aim of the removal of delusion. He develops the power of mindfulness, which has the ultimate aim of the removal of lust, the ultimate aim of the removal of hatred, and the ultimate aim of the removal of delusion. He develops the power of concentration, which has the ultimate aim of the removal of lust, the ultimate aim of the removal of hatred, and the ultimate aim of the removal of delusion. He develops the power of wisdom, which has the ultimate aim of the removal of lust, the ultimate aim of the removal of hatred, and the ultimate aim of the removal of delusion. It is in this way, monks, that a monk who develops and repeatedly cultivates the five powers slopes, inclines, and tends towards Nibbana.",
      "sinhala": "මහණෙනි, යම් සේ ගංගා නදිය නැගෙනහිරට බරව, නැගෙනහිරට නැඹුරුව, නැගෙනහිරට ආනතව ගලා යයි ද, මහණෙනි, එපරිද්දෙන්ම භික්ෂුව පංච බලයන් වඩවමින්, පංච බලයන් බහුල කරමින් නිවනට බරව, නිවනට නැඹුරුව, නිවනට ආනතව පවතී.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව පංච බලයන් වඩවමින්, පංච බලයන් බහුල කරමින් නිවනට බරව, නිවනට නැඹුරුව, නිවනට ආනතව පවතී ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව, රාගය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තේ ද එබඳු ශ්‍රද්ධා බලය වඩවයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තේ ද එබඳු විරිය බලය වඩවයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තේ ද එබඳු සති බලය වඩවයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තේ ද එබඳු සමාධි බලය වඩවයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තේ ද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තේ ද එබඳු ප්‍රඥා බලය වඩවයි.\n\nමහණෙනි, මෙසේ භික්ෂුව පංච බලයන් වඩවමින්, පංච බලයන් බහුල කරමින් නිවනට බරව, නිවනට නැඹුරුව, නිවනට ආනතව පවතී.",
      "paliTitle": "Pācīnādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo",
      "englishTitle": "The Twelve Discourses beginning with Flowing East",
      "sinhalaTitle": "පාචීනාදි සූත්‍ර ද්වාදසකය",
      "vaggaEnglish": "Chapter on the Ganges Repetition Series",
      "vaggaSinhala": "ගංගා පෙය්‍යාල වර්ගය"
    },
    {
      "number": 792,
      "numberRange": "792-802",
      "pali": "Evaṃ esanāpāḷi vitthāretabbā – rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ. Esanāvaggo navamo. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "Thus, the section on seeking should be elaborated, culminating in the eradication of greed, the eradication of aversion, and the eradication of delusion.\n\nThe chapter on Seeking is the ninth. Its summary is: Seeking, modes, influxes, becoming, and the three kinds of suffering; barrenness, defilements, and afflictions, feeling, craving, and thirst.",
      "sinhala": "මේ තෘෂ්ණා ගවේෂණ පාලිය, රාගය දුරු කිරීමෙන්ද, ද්වේෂය දුරු කිරීමෙන්ද, මෝහය දුරු කිරීමෙන්ද කෙළවර වන පරිදි විස්තර කළ යුතු යි.\n\nගවේෂණ වග්ගය නවවැනි යි.\n\nඑහි උද්දානය මෙයයි: ගවේෂණය, විධි, ආශ්‍රව, භවයද, දුක්ඛතාවෝ තිදෙනාද, ඛිල, මලද, නීඝද, වේදනා, තෘෂ්ණා, තසිනාද යනුයි.",
      "paliTitle": "Esanādisuttadvādasakaṃ",
      "vagga": "Esanāvaggo",
      "englishTitle": "Twelve Suttas on Searches and Other Topics",
      "sinhalaTitle": "ඒසනාදි සූත්‍ර ද්වාදසකය",
      "vaggaEnglish": "Chapter on Searches (or Quests)",
      "vaggaSinhala": "ඒසනා වර්ගය"
    },
    {
      "number": 803,
      "numberRange": "803-812",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya pañca balāni bhāvetabbāni. Katamāni pañca? Idha, bhikkhave, bhikkhu saddhābalaṃ bhāveti…pe… paññābalaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya imāni pañca balāni bhāvetabbānī’’ti. Dasamaṃ. Oghavaggo dasamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti. ",
      "english": "Monks, there are these five higher fetters. Which five? Attachment to the form realms, attachment to the formless realms, conceit, restlessness, and ignorance – these, monks, are the five higher fetters.\n\nFor the direct knowledge, thorough understanding, utter destruction, and abandonment of these five higher fetters, five powers must be developed. Which five? Here, monks, a monk develops the power of conviction, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom, culminating in the eradication of lust, culminating in the eradication of hatred, and culminating in the eradication of delusion. For the direct knowledge, thorough understanding, utter destruction, and abandonment of these five higher fetters, these five powers must be developed.",
      "sinhala": "මහණෙනි, මේ උද්ධම්භාගීය සංයෝජන පස් දෙනක් ඇත. කවරේද ඒ පස් දෙන? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාව යන මේවායි. මහණෙනි, මේවා උද්ධම්භාගීය සංයෝජන පස් දෙන වේ. මහණෙනි, මේ පස් ආකාර වූ උද්ධම්භාගීය සංයෝජන සෘජුව දැනගැනීම සඳහා, පිරිසිඳ දැනගැනීම සඳහා, ක්ෂය කිරීම සඳහා, ප්‍රහාණය කිරීම සඳහා බලධර්ම පස් දෙනක් වැඩිය යුතු ය. කවරේද ඒ පස් දෙන?\n\nමහණෙනි, මෙහිලා භික්‍ෂුවක් ශ්‍රද්ධා බලය වඩයි, වීර්ය බලය වඩයි, සති බලය වඩයි, සමාධි බලය වඩයි, ප්‍රඥා බලය වඩයි. මේවා රාගය දුරු කිරීමෙන් කෙළවර වන, ද්වේෂය දුරු කිරීමෙන් කෙළවර වන, මෝහය දුරු කිරීමෙන් කෙළවර වන අයුරින් වඩයි. මහණෙනි, මේ පස් ආකාර වූ උද්ධම්භාගීය සංයෝජන සෘජුව දැනගැනීම සඳහා, පිරිසිඳ දැනගැනීම සඳහා, ක්ෂය කිරීම සඳහා, ප්‍රහාණය කිරීම සඳහා මේ බලධර්ම පස් දෙන වඩනු ලැබිය යුතුය.\n\nදස වැන්නයි. ඕඝවග්ගය දස වැන්නයි. එහි උද්දානය (සංග්‍රහ ගාථාව) මෙසේය:\nඕඝය, යෝගය, උපාදානය, ගන්ථ, අනුසය ද;\nකාමගුණ, නීවරණ, ඛන්ධ, ඕරම්භාගීය යන මේවායි.",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo",
      "englishTitle": "The Ten Discourses beginning with the Flood",
      "sinhalaTitle": "ඕඝාදි සූත්‍ර දසකය",
      "vaggaEnglish": "Chapter on Floods",
      "vaggaSinhala": "ඕඝ වර්ගය"
    }
  ],
  "footer": {
    "pali": "Balasaṃyuttaṃ chaṭṭhaṃ.",
    "english": "The Linked Discourses on the Powers, the sixth.",
    "sinhala": "බල සංයුක්තය සයවන කොටසයි."
  }
}