{
  "id": "sn.5.10",
  "title": {
    "pali": "Ānāpānasaṃyuttaṃ",
    "english": "The Connected Discourses on Mindfulness of Breathing",
    "sinhala": "ආනාපාන සංයුත‍්තය"
  },
  "sections": [
    {
      "number": 977,
      "pali": "Sāvatthinidānaṃ. Tatra kho…pe… etadavoca – ‘‘ekadhammo, bhikkhave, bhāvito bahulīkato mahapphalo hoti mahānisaṃso. Katamo ekadhammo? Ānāpānassati [ānāpānasati (sī. pī.)]. Kathaṃ bhāvitā ca, bhikkhave, ānāpānassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova [sato (bahūsu) tatiyapārājikepi] passasati. Dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti, dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti; rassaṃ vā assasanto ‘rassaṃ assasāmī’ti pajānāti, rassaṃ vā passasanto ‘rassaṃ passasāmī’ti pajānāti; ‘sabbakāyappaṭisaṃvedī assasissāmī’ti sikkhati, ‘sabbakāyappaṭisaṃvedī passasissāmī’ti sikkhati; ‘passambhayaṃ kāyasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ kāyasaṅkhāraṃ passasissāmī’ti sikkhati; ‘pītippaṭisaṃvedī assasissāmī’ti sikkhati, ‘pītippaṭisaṃvedī passasissāmī’ti sikkhati; ‘sukhappaṭisaṃvedī assasissāmī’ti sikkhati, ‘sukhappaṭisaṃvedī passasissāmī’ti sikkhati; ‘cittasaṅkhārappaṭisaṃvedī assasissāmī’ti sikkhati, ‘cittasaṅkhārappaṭisaṃvedī passasissāmī’ti sikkhati; ‘passambhayaṃ cittasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ cittasaṅkhāraṃ passasissāmī’ti sikkhati; ‘cittappaṭisaṃvedī assasissāmī’ti sikkhati, ‘cittappaṭisaṃvedī passasissāmī’ti sikkhati; ‘abhippamodayaṃ cittaṃ assasissāmī’ti sikkhati, ‘abhippamodayaṃ cittaṃ passasissāmī’ti sikkhati; ‘samādahaṃ cittaṃ assasissāmī’ti sikkhati, ‘samādahaṃ cittaṃ passasissāmī’ti sikkhati; ‘vimocayaṃ cittaṃ assasissāmī’ti sikkhati, ‘vimocayaṃ cittaṃ passasissāmī’ti sikkhati; ‘aniccānupassī assasissāmī’ti sikkhati, ‘aniccānupassī passasissāmī’ti sikkhati; ‘virāgānupassī assasissāmī’ti sikkhati, ‘virāgānupassī passasissāmī’ti sikkhati; ‘nirodhānupassī assasissāmī’ti sikkhati, ‘nirodhānupassī passasissāmī’ti sikkhati; ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvitā kho, bhikkhave, ānāpānassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā’’ti. Paṭhamaṃ.",
      "english": "Monks, one quality, when developed and frequently practiced, is of great fruit and great benefit. Which one quality? Mindfulness of breathing.\n\nAnd how, monks, is mindfulness of breathing developed and frequently practiced so as to be of great fruit and great benefit?\n\nHere, monks, a monk, having gone to the forest, or to the root of a tree, or to an empty dwelling, sits down, having folded his legs crosswise, set his body erect, and established mindfulness at the forefront of his awareness. Mindful, he breathes in; mindful, he breathes out. Breathing in long, he discerns, 'I breathe in long'; breathing out long, he discerns, 'I breathe out long.' Breathing in short, he discerns, 'I breathe in short'; breathing out short, he discerns, 'I breathe out short.' He trains himself, 'I will breathe in experiencing the whole body of breath'; he trains himself, 'I will breathe out experiencing the whole body of breath.' He trains himself, 'I will breathe in tranquilizing the bodily formation'; he trains himself, 'I will breathe out tranquilizing the bodily formation.' He trains himself, 'I will breathe in experiencing rapture'; he trains himself, 'I will breathe out experiencing rapture.' He trains himself, 'I will breathe in experiencing pleasure'; he trains himself, 'I will breathe out experiencing pleasure.' He trains himself, 'I will breathe in experiencing the mental formations'; he trains himself, 'I will breathe out experiencing the mental formations.' He trains himself, 'I will breathe in tranquilizing the mental formations'; he trains himself, 'I will breathe out tranquilizing the mental formations.' He trains himself, 'I will breathe in experiencing the mind'; he trains himself, 'I will breathe out experiencing the mind.' He trains himself, 'I will breathe in gladdening the mind'; he trains himself, 'I will breathe out gladdening the mind.' He trains himself, 'I will breathe in concentrating the mind'; he trains himself, 'I will breathe out concentrating the mind.' He trains himself, 'I will breathe in liberating the mind'; he trains himself, 'I will breathe out liberating the mind.' He trains himself, 'I will breathe in contemplating impermanence'; he trains himself, 'I will breathe out contemplating impermanence.' He trains himself, 'I will breathe in contemplating fading away'; he trains himself, 'I will breathe out contemplating fading away.' He trains himself, 'I will breathe in contemplating cessation'; he trains himself, 'I will breathe out contemplating cessation.' He trains himself, 'I will breathe in contemplating relinquishment'; he trains himself, 'I will breathe out contemplating relinquishment.'\n\nIt is in this way, monks, that mindfulness of breathing, when developed and frequently practiced, is of great fruit and great benefit.",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදි. එහිදී... භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:\n\n‘‘මහණෙනි, එකම ධර්මයක් ඇත. එය වඩන ලද්දේ ද, නිතර නිතර පුහුණු කරන ලද්දේ ද මහාඵල ගෙන දෙයි, මහානිසංස ගෙන දෙයි. ඒ එකම ධර්මය කුමක්ද? ආනාපානසතියයි. මහණෙනි, ආනාපානසතිය කෙසේ වඩන ලද්දේ ද, කෙසේ නිතර නිතර පුහුණු කරන ලද්දේ ද මහාඵල ගෙන දෙයි, මහානිසංස ගෙන දෙයි? මහණෙනි, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගිය කල හෝ, ගසක් මුලකට ගිය කල හෝ, හිස් ගෙයකට ගිය කල හෝ, පලක් බැඳ, කය ඍජුව තබා, සිහිය මුහුණත පිහිටුවා වාඩිවෙයි. හේ සිහි ඇතිවම ආශ්වාස කරයි, සිහි ඇතිවම ප්‍රශ්වාස කරයි.\n\nදීර්ඝව ආශ්වාස කරන්නේ, ‘මම දීර්ඝව ආශ්වාස කරමි’යි දැන ගනී. දීර්ඝව ප්‍රශ්වාස කරන්නේ, ‘මම දීර්ඝව ප්‍රශ්වාස කරමි’යි දැන ගනී. කෙටියෙන් ආශ්වාස කරන්නේ, ‘මම කෙටියෙන් ආශ්වාස කරමි’යි දැන ගනී. කෙටියෙන් ප්‍රශ්වාස කරන්නේ, ‘මම කෙටියෙන් ප්‍රශ්වාස කරමි’යි දැන ගනී. ‘සම්පූර්ණ කයම (ආශ්වාස ප්‍රශ්වාස ක්‍රියාවලිය) විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සම්පූර්ණ කයම විඳිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘කය ක්‍රියාකරවන හුස්ම පිළිබඳ සංස්කාරය සංසිඳුවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘කය ක්‍රියාකරවන හුස්ම පිළිබඳ සංස්කාරය සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘ප්‍රීතිය විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘ප්‍රීතිය විඳිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සතුට (සුවය) විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සතුට (සුවය) විඳිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘චිත්ත සංස්කාරයන් (වේදනා, සංඥා) විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘චිත්ත සංස්කාරයන් විඳිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘චිත්ත සංස්කාරයන් සංසිඳුවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘චිත්ත සංස්කාරයන් සංසිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත විඳිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත සතුටු කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත සතුටු කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත සමාධිමත් කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත සමාධිමත් කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත මුදවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘සිත මුදවමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘අනිත්‍යය අනුපස්සනා කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘අනිත්‍යය අනුපස්සනා කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘විරාගය අනුපස්සනා කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘විරාගය අනුපස්සනා කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘නිරෝධය අනුපස්සනා කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘නිරෝධය අනුපස්සනා කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘ප්‍රතිනිස්සර්ගය (කෙලෙස් අත්හැරීම) අනුපස්සනා කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘ප්‍රතිනිස්සර්ගය අනුපස්සනා කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි.\n\nමහණෙනි, මෙසේ වඩන ලද්දේ ද, මෙසේ නිතර නිතර පුහුණු කරන ලද්දේ ද ආනාපානසතිය මහාඵල ගෙන දෙයි, මහානිසංස ගෙන දෙයි.’’\n(මෙය) පළමුවැන්නයි.",
      "paliTitle": "Ekadhammasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 978,
      "pali": "‘‘Ānāpānassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā. Kathaṃ bhāvitā ca, bhikkhave, ānāpānassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā? Idha, bhikkhave, bhikkhu ānāpānassatisahagataṃ satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, ānāpānassatisahagataṃ dhammavicayasambojjhaṅgaṃ bhāveti… pe… ānāpānassatisahagataṃ upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ bhāvitā kho, bhikkhave, ānāpānassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā’’ti. Dutiyaṃ.",
      "english": "Monks, mindfulness of breathing, when developed and frequently cultivated, brings great fruit and great benefit. And how, monks, is mindfulness of breathing developed and frequently cultivated to bring great fruit and great benefit? Here, monks, a monk develops the enlightenment factor of mindfulness, accompanied by mindfulness of breathing, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. He develops the enlightenment factor of investigation of phenomena, accompanied by mindfulness of breathing; the enlightenment factor of energy, accompanied by mindfulness of breathing; the enlightenment factor of rapture, accompanied by mindfulness of breathing; the enlightenment factor of tranquility, accompanied by mindfulness of breathing; the enlightenment factor of concentration, accompanied by mindfulness of breathing; and the enlightenment factor of equanimity, accompanied by mindfulness of breathing – all dependent on detachment, dependent on dispassion, dependent on cessation, and culminating in relinquishment. It is in this way, monks, that mindfulness of breathing, when developed and frequently cultivated, brings great fruit and great benefit.",
      "sinhala": "මහණෙනි, ආනාපානසතිය වඩන ලද්දී, බහුලීකරණය කරන ලද්දී මහත් ඵල ඇති වේ, මහත් ආනිශංස ඇති වේ. මහණෙනි, කෙසේ වඩන ලද්දී ද, කෙසේ බහුලීකරණය කරන ලද්දී ද ආනාපානසතිය මහත් ඵල ඇති වේ ද, මහත් ආනිශංස ඇති වේ ද? මහණෙනි, මෙහිලා මහණෙක් ආනාපානසතිය හා සමඟ පවත්නා සති සම්බොජ්ඣංගය වඩයි; විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ස්වභාවයෙන් යුතුව. ආනාපානසතිය හා සමඟ පවත්නා ධම්මවිචය සම්බොජ්ඣංගය වඩයි; විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ස්වභාවයෙන් යුතුව. ආනාපානසතිය හා සමඟ පවත්නා විරිය සම්බොජ්ඣංගය වඩයි; විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ස්වභාවයෙන් යුතුව. ආනාපානසතිය හා සමඟ පවත්නා පීති සම්බොජ්ඣංගය වඩයි; විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ස්වභාවයෙන් යුතුව. ආනාපානසතිය හා සමඟ පවත්නා පස්සද්ධි සම්බොජ්ඣංගය වඩයි; විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ස්වභාවයෙන් යුතුව. ආනාපානසතිය හා සමඟ පවත්නා සමාධි සම්බොජ්ඣංගය වඩයි; විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ස්වභාවයෙන් යුතුව. ආනාපානසතිය හා සමඟ පවත්නා උපේක්ෂා සම්බොජ්ඣංගය වඩයි; විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ස්වභාවයෙන් යුතුව. මහණෙනි, මෙලෙස වඩන ලද්දී ද, මෙලෙස බහුලීකරණය කරන ලද්දී ද ආනාපානසතිය මහත් ඵල ඇති වේ, මහත් ආනිශංස ඇති වේ.",
      "paliTitle": "Bojjhaṅgasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 979,
      "pali": "‘‘Ānāpānassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā. Kathaṃ bhāvitā ca, bhikkhave, ānāpānassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvitā kho, bhikkhave, ānāpānassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā’’ti. Tatiyaṃ.",
      "english": "Monks, mindfulness of breathing, when developed and repeatedly cultivated, is of great fruit and great benefit. And how, monks, is mindfulness of breathing developed and repeatedly cultivated so as to be of great fruit and great benefit? Here, monks, a monk, having gone to the forest, or to the root of a tree, or to an empty dwelling, sits down, folding his legs crosswise, setting his body upright, and establishing mindfulness to the fore. Mindfully he breathes in, mindfully he breathes out... He trains himself, 'I will breathe in contemplating relinquishment'; he trains himself, 'I will breathe out contemplating relinquishment.' It is in this way, monks, that mindfulness of breathing, when developed and repeatedly cultivated, is of great fruit and great benefit.",
      "sinhala": "මහණෙනි, ආනාපානසතිය වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක් මහාඵල ඇත්තී වේ, මහානිසංස ඇත්තී වේ.\n\nමහණෙනි, ආනාපානසතිය කෙසේ වඩන ලද්දක් වූ විටද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දක් වූ විටද මහාඵල ඇත්තී වේද, මහානිසංස ඇත්තී වේද?\n\nමහණෙනි, මේ ශාසනයෙහි මහණෙක් අරණ්‍යයකට ගියේ හෝ, රුක් මූලයකට ගියේ හෝ, ශූන්‍යාගාරයකට ගියේ හෝ, පලක් බැඳගෙන, ඍජු සිරුර පිහිටුවාගෙන, ඉදිරියෙහි සිහිය පිහිටුවාගෙන හිඳගනී.\n\nහෙතෙම සිහියෙන් ම ආශ්වාස කරයි, සිහියෙන් ම ප්‍රශ්වාස කරයි...පෙ... ‘ප්‍රතිනිස්සර්ගානුපස්සීව ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘ප්‍රතිනිස්සර්ගානුපස්සීව ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි.\n\nමහණෙනි, මෙසේ වඩන ලද්දක්, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දක් වූ ආනාපානසතිය මහාඵල ඇත්තී වේ, මහානිසංස ඇත්තී වේ.",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 980,
      "pali": "‘‘Ānāpānassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā. Kathaṃ bhāvitā ca, bhikkhave, ānāpānassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvitā kho, bhikkhave, ānāpānassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā. Evaṃ bhāvitāya kho, bhikkhave, ānāpānassatiyā evaṃ bahulīkatāya dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Catutthaṃ.",
      "english": "Monks, mindfulness of breathing, when developed and repeatedly practiced, is greatly fruitful and greatly beneficial. And how, monks, is mindfulness of breathing developed and repeatedly practiced so that it is greatly fruitful and greatly beneficial? Here, monks, a monk, having gone to a wilderness, to the root of a tree, or to an empty dwelling, sits down, folding his legs crosswise, straightening his body, and establishing mindfulness in front of him. He breathes in mindfully, he breathes out mindfully. He trains himself thus: ‘I will breathe in contemplating relinquishment.’ He trains himself thus: ‘I will breathe out contemplating relinquishment.’ Monks, mindfulness of breathing, when developed in this way and repeatedly practiced in this way, is greatly fruitful and greatly beneficial. Monks, for mindfulness of breathing thus developed and thus repeatedly practiced, one of two fruits can be expected: either full enlightenment in this very life, or, if there is a remainder of clinging, the state of non-returning.",
      "sinhala": "භික්ෂූණි, ආනාපානසති භාවනාව වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි මහත් ඵල ද මහත් ආනිශංස ද වන්නේය.\n\nභික්ෂූණි, ආනාපානසති භාවනාව කෙසේ වැඩූ කල්හි ද කෙසේ බහුල වශයෙන් පුරුදු කළ කල්හි ද මහත් ඵල ද මහත් ආනිශංස ද වන්නේ ද? භික්ෂූණි, මෙහිලා භික්ෂුවක් වනයකට ගියේ හෝ, රුක් මුලකට ගියේ හෝ, ශූන්‍යාගාරයකට ගියේ හෝ, පලක් බැඳ, සෘජුව කය පිහිටුවාගෙන, මුහුණට මුහුණ ලා සිහිය පිහිටුවා ගෙන හිඳියි. හෙතෙම සිහියෙන් යුතුව ආශ්වාස කරයි, සිහියෙන් යුතුව ප්‍ර‍ශ්වාස කරයි... (ඉන්පසු) 'ප්‍ර‍තිනිස්සර්ගය අනුපස්සනා කරමින් ආශ්වාස කරන්නෙමි' යි හික්මෙයි, 'ප්‍ර‍තිනිස්සර්ගය අනුපස්සනා කරමින් ප්‍ර‍ශ්වාස කරන්නෙමි' යි හික්මෙයි.\n\nභික්ෂූණි, මෙසේ වැඩූ කල්හි, මෙසේ බහුල වශයෙන් පුරුදු කළ කල්හි ආනාපානසති භාවනාව මහත් ඵල ද මහත් ආනිශංස ද වන්නේය. භික්ෂූණි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද ආනාපානසතියට මේ ඵල දෙකින් එක ඵලයක් අපේක්ෂා කළ යුතුය: මේ ආත්මභාවයේදීම අර්හත්වය අවබෝධ කිරීම හෝ, සසර අවශේෂයක් (ඉතිරි වූ ක්ලේශයන්) ඇත්නම් අනාගාමීත්වය අවබෝධ කිරීම හෝ යි.\n\nසතරවෙනි සූත්‍රයයි.",
      "paliTitle": "Paṭhamaphalasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 981,
      "pali": "‘‘Ānāpānassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā. Kathaṃ bhāvitā ca, bhikkhave, ānāpānassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvitā kho, bhikkhave, ānāpānassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā. ‘‘Evaṃ bhāvitāya kho, bhikkhave, ānāpānassatiyā evaṃ bahulīkatāya satta phalā sattānisaṃsā pāṭikaṅkhā. Katame satta phalā sattānisaṃsā? Diṭṭheva dhamme paṭikacca aññaṃ ārādheti; no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti. Atha maraṇakāle aññaṃ ārādheti; no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti, no ce maraṇakāle aññaṃ ārādheti. Atha pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti… upahaccaparinibbāyī hoti… asaṅkhāraparinibbāyī hoti… sasaṅkhāraparinibbāyī hoti… uddhaṃsoto hoti akaniṭṭhagāmī – evaṃ bhāvitāya kho, bhikkhave, ānāpānassatiyā evaṃ bahulīkatāya ime satta phalā sattānisaṃsā pāṭikaṅkhā’’ti. Pañcamaṃ.",
      "english": "Monks, mindfulness of breathing, when developed and repeatedly cultivated, is of great fruit and great benefit. And how, monks, is mindfulness of breathing developed and repeatedly cultivated so as to be of great fruit and great benefit? Here, monks, a monk, having gone to the wilderness, or to the root of a tree, or to an empty dwelling, sits down, having folded his legs crosswise, holding his body erect, and establishing mindfulness at the fore. He breathes in mindfully, he breathes out mindfully. He trains himself, 'I will breathe in contemplating relinquishment,' he trains himself, 'I will breathe out contemplating relinquishment.' Thus, monks, when mindfulness of breathing is developed and repeatedly cultivated in this way, it is of great fruit and great benefit.\n\nMonks, when mindfulness of breathing is developed and repeatedly cultivated in this way, seven fruits and seven benefits are to be expected. Which are these seven fruits and seven benefits? He realizes final knowledge immediately in this very life. If he does not realize final knowledge immediately in this very life, then he realizes final knowledge at the time of death. If he does not realize final knowledge immediately in this very life, nor at the time of death, then with the utter destruction of the five lower fetters, he becomes one who attains Nibbana in the interim. He becomes one who attains Nibbana upon landing. He becomes one who attains Nibbana without exertion. He becomes one who attains Nibbana with exertion. He becomes an upstream-bound one, going to the Akaniṭṭha realm. Thus, monks, when mindfulness of breathing is developed and repeatedly cultivated in this way, these seven fruits and seven benefits are to be expected.",
      "sinhala": "මහණෙනි, වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ ආනාපානසතිය මහත් ඵල මහානිසංස ඇති කරයි. මහණෙනි, කෙසේ වඩන ලද්දා වූද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දා වූද ආනාපානසතිය මහත් ඵල මහානිසංස ඇති කරයිද? මහණෙනි, මෙහිලා මහණෙක් අරණ්‍යයකට ගිය කල හෝ, රුක් මුලකට ගිය කල හෝ, ශූන්‍යාගාරයකට ගිය කල හෝ, පලක් බැඳගෙන, කය ඍජුකොට, මනාකොට සිහිය පිහිටුවාගෙන හිඳගනියි. හෙතෙම සිහි නුවණින්ම ආශ්වාස කරයි, සිහි නුවණින්ම ප්‍ර​ශ්වාස කරයි... ‘අතහැරීම අනුදකිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘අතහැරීම අනුදකිමින් ප්‍ර​ශ්වාස කරන්නෙමි’යි හික්මෙයි. මහණෙනි, මෙසේ වඩන ලද්දා වූ, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දා වූ ආනාපානසතිය මහත් ඵල මහානිසංස ඇති කරයි.\n\nමහණෙනි, මෙසේ වඩන ලද්දා වූ, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දා වූ ආනාපානසතියෙන් සත් ඵල ද, සත් අනුසස් ද අපේක්ෂා කළ හැකිය. ඒ සත් ඵල සහ සත් අනුසස් කවරේද? මේ ආත්මභාවයෙහිදීම විශේෂ ඥානය (අරහත් ඵලය) අවබෝධ කරයි. යම් හෙයකින් මේ ආත්මභාවයෙහිදීම විශේෂ ඥානය අවබෝධ නොකරයි නම්, එසේනම් මරණාසන්න කාලයේදී විශේෂ ඥානය අවබෝධ කරයි. යම් හෙයකින් මේ ආත්මභාවයෙහිදීම හෝ මරණාසන්න කාලයේදී හෝ විශේෂ ඥානය අවබෝධ නොකරයි නම්, එසේනම් ඕරම්භාගීය සංයෝජන පහ ක්ෂය කිරීමෙන් අන්තරාපරිනිර්වාණගාමී වේ... උපහච්චපරිනිර්වාණගාමී වේ... අසංඛාරපරිනිර්වාණගාමී වේ... සසංඛාරපරිනිර්වාණගාමී වේ... ඌර්ධ්වශ්‍රෝතස් වේ, අකනිට්ඨගාමී වේ. මහණෙනි, මෙසේ වඩන ලද්දා වූ, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දා වූ ආනාපානසතියෙන් මේ සත් ඵල ද, සත් අනුසස් ද අපේක්ෂා කළ හැකිය.",
      "paliTitle": "Dutiyaphalasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 982,
      "pali": "Sāvatthinidānaṃ. Tatra kho bhagavā…pe… etadavoca – ‘‘bhāvetha no tumhe bhikkhave, ānāpānassati’’nti? Evaṃ vutte āyasmā ariṭṭho bhagavantaṃ etadavoca – ‘‘ahaṃ kho, bhante, bhāvemi ānāpānassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, ariṭṭha, bhāvesi ānāpānassati’’nti? ‘‘Atītesu me, bhante, kāmesu kāmacchando pahīno, anāgatesu me kāmesu kāmacchando vigato, ajjhattabahiddhā [ajjhattaṃ bahiddhā (syā. kaṃ. pī. ka.)] ca me dhammesu paṭighasaññā suppaṭivinītā. So [sohaṃ (?)] satova assasissāmi, satova passasissāmi. Evaṃ khvāhaṃ, bhante, bhāvemi ānāpānassati’’nti. ‘‘‘Atthesā, ariṭṭha, ānāpānassati, nesā natthī’ti vadāmi. Api ca, ariṭṭha, yathā ānāpānassati vitthārena paripuṇṇā hoti taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ariṭṭho bhagavato paccassosi. Bhagavā etadavoca – ‘‘Kathañca, ariṭṭha, ānāpānassati vitthārena paripuṇṇā hoti? Idha, ariṭṭha, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati. Dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ kho, ariṭṭha, ānāpānassati vitthārena paripuṇṇā hotī’’ti. Chaṭṭhaṃ.",
      "english": "There, indeed, the Fortunate One said this: \"Do you, monks, cultivate mindfulness of breathing?\"\n\nWhen this was said, Venerable Ariṭṭha said to the Fortunate One: \"Indeed, Venerable Sir, I cultivate mindfulness of breathing.\"\n\n\"But in what way, Ariṭṭha, do you cultivate mindfulness of breathing?\"\n\n\"Venerable Sir, my sensual desire for past sensual pleasures is abandoned, my sensual desire for future sensual pleasures is departed, and my perception of aversion regarding internal and external phenomena is thoroughly eliminated. So, being mindful, I shall breathe in; being mindful, I shall breathe out. It is in this way, Venerable Sir, that I cultivate mindfulness of breathing.\"\n\n\"Ariṭṭha, I say that this mindfulness of breathing exists; it does not not exist. However, Ariṭṭha, listen to how mindfulness of breathing becomes fully developed, pay close attention; I shall speak.\"\n\n\"Yes, Venerable Sir,\" Venerable Ariṭṭha replied to the Fortunate One.\n\nThe Fortunate One said this: \"And how, Ariṭṭha, does mindfulness of breathing become fully developed? Here, Ariṭṭha, a monk, having gone to the wilderness, or to the foot of a tree, or to an empty dwelling, sits down, folding his legs crosswise, setting his body upright, and establishing mindfulness at the forefront. Mindful, he breathes in; mindful, he breathes out. Breathing in long, he understands ‘I breathe in long’… he trains himself, ‘I shall breathe in contemplating relinquishment’; he trains himself, ‘I shall breathe out contemplating relinquishment.’ It is in this way, Ariṭṭha, that mindfulness of breathing becomes fully developed.\"",
      "sinhala": "සැවැත් නුවරදී භාග්‍යවතුන් වහන්සේ වැඩසිටින සමයෙහි භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට මෙය වදාළ සේක: “මහණෙනි, නුඹලා ආනාපානසතිය වඩන්නේ නැද්ද?”\n\nමෙසේ වදාළ විට ආයුෂ්මත් අරිෂ්ඨ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “වහන්ස, මම නම් ආනාපානසතිය වඩමි.”\n\n“අරිෂ්ඨය, එසේනම් නුඹ ආනාපානසතිය වඩන්නේ කෙසේද?”\n\n“වහන්ස, අතීත වූ කාමයන් කෙරෙහි මගේ කාමච්ඡන්දය ප්‍රහීණ වී ඇත. අනාගත වූ කාමයන් කෙරෙහි මගේ කාමච්ඡන්දය පහව ගොස් ඇත. අධ්‍යාත්මික හා බාහිර ධර්මයන් කෙරෙහි මගේ ප්‍රතිඝ සංඥාව ඉතා හොඳින් දුරු වී ඇත. මම සිහියෙන්ම ආශ්වාස කරමි, සිහියෙන්ම ප්‍රශ්වාස කරමි. වහන්ස, මම මෙසේ ආනාපානසතිය වඩමි.”\n\n“අරිෂ්ඨය, මෙය ආනාපානසතියක්මය, මෙය ආනාපානසතියක් නොවේ යැයි මම නොකියමි. එහෙත් අරිෂ්ඨය, ආනාපානසතිය විස්තර වශයෙන් සම්පූර්ණ වන්නේ කෙසේදැයි එය අසන්න, මනාව සිතට ගන්න; මම දේශනා කරන්නෙමි.”\n\n“එසේය, වහන්ස” යැයි ආයුෂ්මත් අරිෂ්ඨ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “අරිෂ්ඨය, ආනාපානසතිය විස්තර වශයෙන් සම්පූර්ණ වන්නේ කෙසේද? අරිෂ්ඨය, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගිය කල හෝ ගසක් මුලකට ගිය කල හෝ ශූන්‍යාගාරයකට ගිය කල හෝ පලක් බැඳ, කය ඍජුව පිහිටුවාගෙන, සිහිය මුහුණට එළවාගෙන වාඩි වෙයි. හෙතෙම සිහියෙන්ම ආශ්වාස කරයි, සිහියෙන්ම ප්‍රශ්වාස කරයි. දිගු හුස්මක් ගනිද්දී ‘මම දිගු හුස්මක් ගනිමි’යි දනී. (මෙසේ ආනාපානසති භාවනාවේ අනෙකුත් සියලු පියවරයන් වඩමින්), ‘ප්‍රතිනිස්සර්ගානුපස්සීව ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘ප්‍රතිනිස්සර්ගානුපස්සීව ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. අරිෂ්ඨය, මෙසේ ආනාපානසතිය විස්තර වශයෙන් සම්පූර්ණ වෙයි.”",
      "paliTitle": "Ariṭṭhasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 983,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena āyasmā mahākappino bhagavato avidūre nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. Addasā kho bhagavā āyasmantaṃ mahākappinaṃ avidūre nisinnaṃ pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. Disvāna bhikkhū āmantesi – ‘‘Passatha no tumhe, bhikkhave, etassa bhikkhuno kāyassa iñjitattaṃ vā phanditattaṃ vā’’ti? ‘‘Yadāpi mayaṃ, bhante, taṃ āyasmantaṃ passāma saṅghamajjhe vā nisinnaṃ ekaṃ vā raho nisinnaṃ, tadāpi mayaṃ tassa āyasmato na passāma kāyassa iñjitattaṃ vā phanditattaṃ vā’’ti. ‘‘Yassa, bhikkhave, samādhissa bhāvitattā bahulīkatattā neva kāyassa iñjitattaṃ vā hoti phanditattaṃ vā, na cittassa iñjitattaṃ vā hoti phanditattaṃ vā, tassa so, bhikkhave, bhikkhu samādhissa nikāmalābhī akicchalābhī akasiralābhī. Katamassa ca, bhikkhave, samādhissa bhāvitattā bahulīkatattā neva kāyassa iñjitattaṃ vā hoti phanditattaṃ vā, na cittassa iñjitattaṃ vā hoti phanditattaṃ vā? ‘‘Ānāpānassatisamādhissa, bhikkhave, bhāvitattā bahulīkatattā neva kāyassa iñjitattaṃ vā hoti phanditattaṃ vā, na cittassa iñjitattaṃ vā hoti phanditattaṃ vā. Kathaṃ bhāvite ca, bhikkhave, ānāpānassatisamādhimhi kathaṃ bahulīkate neva kāyassa iñjitattaṃ vā hoti phanditattaṃ vā, na cittassa iñjitattaṃ vā hoti phanditattaṃ vā? ‘‘Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati… pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvite ca kho, bhikkhave, ānāpānassatisamādhimhi evaṃ bahulīkate neva kāyassa iñjitattaṃ vā hoti phanditattaṃ vā, na cittassa iñjitattaṃ vā hoti phanditattaṃ vā’’ti. Sattamaṃ.",
      "english": "At Sāvatthī. At that time, the Venerable Mahākappina was seated not far from the Blessed One, having crossed his legs, straightened his body, and established mindfulness right in front of him.\n\nThe Blessed One saw the Venerable Mahākappina seated not far away, having crossed his legs, straightened his body, and established mindfulness right in front of him. Having seen him, the Blessed One addressed the monks: “Monks, do you observe any tremor or wavering in the body of this monk?”\n\n“Indeed, Venerable Sir, whenever we see that venerable one, whether he is seated in the midst of the Saṅgha or seated alone in solitude, we do not observe any tremor or wavering in the body of that venerable one.”\n\n“Monks, in one for whom a certain concentration has been developed and cultivated, there is neither tremor nor wavering of the body, nor tremor nor wavering of the mind. That monk, Monks, is a master of that concentration, easily acquiring it, effortlessly obtaining it.”\n\n“And what concentration, Monks, having been developed and cultivated, results in there being neither tremor nor wavering of the body, nor tremor nor wavering of the mind?”\n\n“Monks, it is the concentration through mindfulness of breathing, having been developed and cultivated, that results in there being neither tremor nor wavering of the body, nor tremor nor wavering of the mind.”\n\n“And how, Monks, is the concentration through mindfulness of breathing developed and cultivated so that there is neither tremor nor wavering of the body, nor tremor nor wavering of the mind?”\n\n“Here, Monks, a monk, having gone to a forest, or to the root of a tree, or to an empty dwelling, sits down, having crossed his legs, straightened his body, and established mindfulness right in front of him.\n\nHe breathes in mindfully, he breathes out mindfully… He trains himself, ‘I will breathe in contemplating relinquishment’; he trains himself, ‘I will breathe out contemplating relinquishment.’\n\nWhen the concentration through mindfulness of breathing is thus developed and thus cultivated, Monks, there is neither tremor nor wavering of the body, nor tremor nor wavering of the mind.”",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලදී.\n\nඑකල ආයුෂ්මත් මහාකප්පින තෙරණුවෝ භාග්‍යවතුන් වහන්සේට නුදුරින්, පර්යංකයක් බැඳ, කය ඍජුව තබාගෙන, සිහිය ඉදිරියෙන් පිහිටුවාගෙන වැඩසිටියහ. භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් මහාකප්පින තෙරණුවෝ නුදුරින් වැඩසිටින, පර්යංකයක් බැඳ, කය ඍජුව තබාගෙන, සිහිය ඉදිරියෙන් පිහිටුවාගෙන වැඩසිටින අයුරු දුටු සේක. දුටු කල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, නුඹලා ඒ භික්ෂුවගේ කයේ කිසිදු සෙලවීමක් හෝ වෙවුලීමක් දකින්නහුද?” “ස්වාමීනි, අපි ඒ ආයුෂ්මත් තෙරණුවන් සංඝයා මැද වැඩසිටින කල්හි හෝ තනිව රහසින් වැඩසිටින කල්හි හෝ, උන්වහන්සේගේ කයේ කිසිදු සෙලවීමක් හෝ වෙවුලීමක් නොදක්නෙමු.”\n\n“මහණෙනි, යම් සමාධියක් වඩා බහුල වශයෙන් පුරුදු කිරීමෙන් කයේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද, සිතේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද, මහණෙනි, ඒ භික්ෂුව එම සමාධිය කැමති පරිදි ලබන, අමාරුවක් නැතිව ලබන, දුෂ්කරතාවක් නැතිව ලබන භික්ෂුවක් වේ. මහණෙනි, යම් සමාධියක් වඩා බහුල වශයෙන් පුරුදු කිරීමෙන් කයේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද, සිතේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද, ඒ කවර සමාධියක්ද?\n\n“මහණෙනි, ආනාපානසති සමාධිය වඩා බහුල වශයෙන් පුරුදු කිරීමෙන් කයේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද, සිතේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද. මහණෙනි, ආනාපානසති සමාධිය කෙසේ වැඩූ කල්හිද, කෙසේ බහුල වශයෙන් පුරුදු කළ කල්හිද, කයේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද, සිතේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද?\n\n“මහණෙනි, මෙහිලා භික්ෂුවක් වනයට ගියේ හෝ, රුක් මුලකට ගියේ හෝ, හිස් ගෙයකට ගියේ හෝ, පර්යංකයක් බැඳ, කය ඍජුව තබාගෙන, සිහිය ඉදිරියෙන් පිහිටුවාගෙන වැඩහිඳියි. ඔහු සිහියෙන් යුතුව ආශ්වාස කරයි, සිහියෙන් යුතුව ප්‍රශ්වාස කරයි... ‘ප්‍රතිනිස්සර්ගය (කෙලෙස් දුරුකිරීම) අනුව දකිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘ප්‍රතිනිස්සර්ගය (කෙලෙස් දුරුකිරීම) අනුව දකිමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. මහණෙනි, මෙලෙස ආනාපානසති සමාධිය වැඩූ කල්හි, මෙලෙස බහුල වශයෙන් පුරුදු කළ කල්හි, කයේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද, සිතේ සෙලවීමක් හෝ වෙවුලීමක් නොවේද.”\n\nසත්වන සූත්‍රයයි.",
      "paliTitle": "Mahākappinasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 984,
      "pali": "‘‘Ānāpānassatisamādhi, bhikkhave, bhāvito bahulīkato mahapphalo hoti mahānisaṃso. Kathaṃ bhāvito ca, bhikkhave, ānāpānassatisamādhi kathaṃ bahulīkato mahapphalo hoti mahānisaṃso? ‘‘Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati. Dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvito kho, bhikkhave, ānāpānassatisamādhi evaṃ bahulīkato mahapphalo hoti mahānisaṃso. ‘‘Ahampi sudaṃ, bhikkhave, pubbeva sambodhā anabhisambuddho bodhisattova samāno iminā vihārena bahulaṃ viharāmi. Tassa mayhaṃ, bhikkhave, iminā vihārena bahulaṃ viharato neva kāyo kilamati na cakkhūni; anupādāya ca me āsavehi cittaṃ vimucci. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘neva me kāyo kilameyya na cakkhūni, anupādāya ca me āsavehi cittaṃ vimucceyyā’ti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘ye me gehasitā sarasaṅkappā te pahīyeyyu’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘paṭikūle ca appaṭikūle ca paṭikūlasaññī vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘appaṭikūlañca paṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha bhikkhave, bhikkhu cepi ākaṅkheyya – ‘pītiyā ca virāgā upekkhako ca vihareyyaṃ sato ca sampajāno, sukhañca kāyena paṭisaṃvedeyyaṃ, yaṃ taṃ ariyā ācikkhanti – upekkhako satimā sukhavihārīti tatiyaṃ jhānaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Tasmātiha, bhikkhave, bhikkhu cepi ākaṅkheyya – ‘sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja vihareyya’nti, ayameva ānāpānassatisamādhi sādhukaṃ manasi kātabbo. ‘‘Evaṃ bhāvite kho, bhikkhave, ānāpānassatisamādhimhi evaṃ bahulīkate, sukhaṃ ce vedanaṃ vedayati, sā ‘aniccā’ti pajānāti, ‘anajjhositā’ti pajānāti, ‘anabhinanditā’ti pajānāti; dukkhaṃ ce vedanaṃ vedayati, ‘sā aniccā’ti pajānāti, ‘anajjhositā’ti pajānāti, ‘anabhinanditā’ti pajānāti; adukkhamasukhaṃ ce vedanaṃ vedayati, ‘sā aniccā’ti pajānāti, ‘anajjhositā’ti pajānāti, ‘anabhinanditā’ti pajānāti’’. ‘‘Sukhaṃ [so sukhaṃ (sī. syā. kaṃ. pī.) ma. ni. 3.364 aṭṭhakathāṭīkā oloketabbā] ce vedanaṃ vedayati, visaṃyutto naṃ vedayati; dukkhaṃ ce vedanaṃ vedayati, visaṃyutto naṃ vedayati; adukkhamasukhaṃ ce vedanaṃ vedayati, visaṃyutto naṃ vedayati. So kāyapariyantikaṃ vedanaṃ vedayamāno ‘kāyapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti, jīvitapariyantikaṃ vedanaṃ vedayamāno ‘jīvitapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti, ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānāti’’. ‘‘Seyyathāpi, bhikkhave, telañca paṭicca, vaṭṭiñca paṭicca telappadīpo jhāyeyya, tasseva telassa ca vaṭṭiyā ca pariyādānā anāhāro nibbāyeyya; evameva kho, bhikkhave, bhikkhu kāyapariyantikaṃ vedanaṃ vedayamāno ‘kāyapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti, jīvitapariyantikaṃ vedanaṃ vedayamāno ‘jīvitapariyantikaṃ vedanaṃ vedayāmī’ti pajānāti, ‘kāyassa bhedā uddhaṃ jīvitapariyādānā idheva sabbavedayitāni anabhinanditāni sītībhavissantī’ti pajānātī’’ti. Aṭṭhamaṃ.",
      "english": "“Mindfulness of breathing, monks, when developed and frequently practiced, is of great fruit and great benefit. And how, monks, is mindfulness of breathing developed and frequently practiced so as to be of great fruit and great benefit? Here, monks, a monk, having gone to the wilderness, or to the root of a tree, or to an empty dwelling, sits down, having folded his legs crosswise, set his body upright, and established mindfulness in front of him. Mindful he breathes in, mindful he breathes out. Breathing in long, he discerns, ‘I breathe in long’; breathing out long, he discerns, ‘I breathe out long.’ Breathing in short, he discerns, ‘I breathe in short’; breathing out short, he discerns, ‘I breathe out short.’ He trains himself, ‘I will breathe in experiencing the entire body’; he trains himself, ‘I will breathe out experiencing the entire body.’ He trains himself, ‘I will breathe in tranquilizing the bodily formation’; he trains himself, ‘I will breathe out tranquilizing the bodily formation.’ He trains himself, ‘I will breathe in experiencing rapture’; he trains himself, ‘I will breathe out experiencing rapture.’ He trains himself, ‘I will breathe in experiencing happiness’; he trains himself, ‘I will breathe out experiencing happiness.’ He trains himself, ‘I will breathe in experiencing the mental formation’; he trains himself, ‘I will breathe out experiencing the mental formation.’ He trains himself, ‘I will breathe in tranquilizing the mental formation’; he trains himself, ‘I will breathe out tranquilizing the mental formation.’ He trains himself, ‘I will breathe in experiencing the mind’; he trains himself, ‘I will breathe out experiencing the mind.’ He trains himself, ‘I will breathe in gladdening the mind’; he trains himself, ‘I will breathe out gladdening the mind.’ He trains himself, ‘I will breathe in concentrating the mind’; he trains himself, ‘I will breathe out concentrating the mind.’ He trains himself, ‘I will breathe in liberating the mind’; he trains himself, ‘I will breathe out liberating the mind.’ He trains himself, ‘I will breathe in contemplating impermanence’; he trains himself, ‘I will breathe out contemplating impermanence.’ He trains himself, ‘I will breathe in contemplating fading away’; he trains himself, ‘I will breathe out contemplating fading away.’ He trains himself, ‘I will breathe in contemplating cessation’; he trains himself, ‘I will breathe out contemplating cessation.’ He trains himself, ‘I will breathe in contemplating relinquishment’; he trains himself, ‘I will breathe out contemplating relinquishment.’ It is in this way, monks, that mindfulness of breathing, when developed and frequently practiced, is of great fruit and great benefit.\n\nIndeed, monks, before my full enlightenment, when I was still an unenlightened Bodhisatta, I frequently dwelled in this dwelling. As I frequently dwelled in this dwelling, monks, my body did not become fatigued, nor did my eyes; and my mind was liberated from the defilements through non-clinging.\n\nTherefore, monks, if a monk should wish, ‘May my body not become fatigued, nor my eyes, and may my mind be liberated from the defilements through non-clinging,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May those thoughts connected with the household life and based on desire be abandoned in me,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I dwell perceiving the repulsive in what is unrepulsive,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I dwell perceiving the unrepulsive in what is repulsive,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I dwell perceiving the repulsive in both what is repulsive and what is unrepulsive,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I dwell perceiving the unrepulsive in both what is repulsive and what is unrepulsive,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I dwell in equanimity, mindful and clearly comprehending, having abandoned both the unrepulsive and the repulsive,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I enter upon and dwell in the first jhāna, which is detached from sensual pleasures and unwholesome states, accompanied by initial application and sustained application, born of detachment, filled with rapture and happiness,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I enter upon and dwell in the second jhāna, which is free from initial application and sustained application, with internal assurance, unification of mind, free from initial application and sustained application, born of concentration, filled with rapture and happiness,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I, with the fading of rapture, dwell in equanimity, mindful and clearly comprehending, and experience happiness with the body, of which the noble ones declare: \"The one in equanimity is mindful, dwelling happily,\" and so enter upon and dwell in the third jhāna,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I, with the abandoning of pleasure and pain, and with the previous disappearance of joy and sorrow, enter upon and dwell in the fourth jhāna, which is beyond pleasure and pain, purified by equanimity and mindfulness,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, by not attending to perceptions of diversity, thinking, \"Space is infinite,\" enter upon and dwell in the sphere of infinite space,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I, by completely transcending the sphere of infinite space, thinking, \"Consciousness is infinite,\" enter upon and dwell in the sphere of infinite consciousness,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I, by completely transcending the sphere of infinite consciousness, thinking, \"There is nothing,\" enter upon and dwell in the sphere of nothingness,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, ‘May I, by completely transcending the sphere of nothingness, enter upon and dwell in the sphere of neither perception nor non-perception,’ then this very mindfulness of breathing should be well attended to.\n\nTherefore, monks, if a monk should wish, 'Having fully transcended the dimension of neither perception nor non-perception, may I enter upon and dwell in the cessation of perception and feeling,' then this very mindfulness of breathing concentration should be thoroughly attended to.\n\nIndeed, monks, when this mindfulness of breathing concentration is thus developed and frequently practiced, if he experiences a pleasant feeling, he understands, 'It is impermanent,' he understands, 'It is not clung to,' he understands, 'It is not delighted in.' If he experiences a painful feeling, he understands, 'It is impermanent,' he understands, 'It is not clung to,' he understands, 'It is not delighted in.' If he experiences a neutral feeling, he understands, 'It is impermanent,' he understands, 'It is not clung to,' he understands, 'It is not delighted in.'\n\nIf he experiences a pleasant feeling, he experiences it disjoined. If he experiences a painful feeling, he experiences it disjoined. If he experiences a neutral feeling, he experiences it disjoined. Experiencing a feeling that terminates with the body, he understands, 'I am experiencing a feeling that terminates with the body.' Experiencing a feeling that terminates with life, he understands, 'I am experiencing a feeling that terminates with life.' He understands, 'With the breakup of the body, upon the exhaustion of life, all feelings, not delighted in, will here and now become cool.'\n\nJust as, monks, an oil lamp might burn by depending on oil and a wick, and upon the exhaustion of that very oil and wick, without fuel, it would be extinguished; in the same way, monks, a monk experiencing a feeling that terminates with the body understands, 'I am experiencing a feeling that terminates with the body.' Experiencing a feeling that terminates with life, he understands, 'I am experiencing a feeling that terminates with life.' He understands, 'With the breakup of the body, upon the exhaustion of life, all feelings, not delighted in, will here and now become cool.'",
      "sinhala": "මහණෙනි, ආනාපානසති සමාධිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ මහත් ඵල ඇති, මහත් ආනිසංස ඇති වේ. මහණෙනි, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ ද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ ද මහත් ඵල ඇති, මහත් ආනිසංස ඇති වේ ද? මහණෙනි, මෙහිලා භික්ෂුවක් වනගතව හෝ, රුක්මුල් ගතව හෝ, ශූන්‍යාගාර ගතව හෝ, පලක් බැඳ, ඍජු කය පිහිටුවා, ඉදිරියෙන් සිහිය පිහිටුවාගෙන වාඩි වෙයි. හෙතෙම සිහියෙන් ම ආශ්වාස කරයි, සිහියෙන් ම ප්‍රශ්වාස කරයි. දිගු කොට ආශ්වාස කරන්නේ 'දිගු කොට ආශ්වාස කරමි' යි දනී; 'කෙලෙස් අත්හැරීම අනුපස්සනා කරමින් ආශ්වාස කරන්නෙමි' යි හික්මෙයි, 'කෙලෙස් අත්හැරීම අනුපස්සනා කරමින් ප්‍රශ්වාස කරන්නෙමි' යි හික්මෙයි. මහණෙනි, මෙසේ වඩන ලද්දේ, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ ආනාපානසති සමාධිය මහත් ඵල ඇති, මහත් ආනිසංස ඇති වේ.\n\nමහණෙනි, සම්බුද්ධත්වයට පත්වීමට පෙර, තවමත් සම්බුද්ධත්වයට නොපැමිණි බෝධිසත්වයකු වශයෙන් සිටිය දී, මමත් මේ විහරණයෙන් බහුල වශයෙන් වාසය කළෙමි. මහණෙනි, මා විසින් මේ විහරණයෙන් බහුල වශයෙන් වාසය කරන කල්හි මගේ කය ද වෙහෙසට පත් නො විය, ඇස් ද වෙහෙසට පත් නො විය; උපාදානයකින් තොරව මගේ සිත ආශ්‍රවයන්ගෙන් මිදුණේ ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'මගේ කය ද වෙහෙසට පත් නො වේවා, ඇස් ද වෙහෙසට පත් නො වේවා, උපාදානයකින් තොරව මගේ සිත ආශ්‍රවයන්ගෙන් මිදේවා' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'මාගේ ගිහි ජීවිතය මුල් කරගත් රාග සංකල්ප පහව යේවා' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'පිළිකුල් නොවන දෙයෙහි පිළිකුල් බව සලකමින් වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'පිළිකුල් දෙයෙහි පිළිකුල් නොවන බව සලකමින් වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'පිළිකුල් දේ සහ පිළිකුල් නොවන දේ යන දෙකෙහිම පිළිකුල් බව සලකමින් වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'පිළිකුල් දේ සහ පිළිකුල් නොවන දේ යන දෙකෙහිම පිළිකුල් නොවන බව සලකමින් වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'පිළිකුල් නොවන දේ සහ පිළිකුල් දේ යන දෙකම මුළුමනින් බැහැර කොට, සිහියෙන් හා මනා දැනුමෙන් යුතුව උපේක්ෂාවෙන් වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'විතර්ක හා විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මිකව සිත පහදවා ගැනීමෙන්, සිතේ එකඟතාව ඇතිවීමෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'ප්‍රීතියෙන් ද නොඇලීමෙන්, උපේක්ෂා සහගතව ද සිහියෙන් හා මනා දැනුමෙන් යුතුව ද වාසය කරමින්, ආර්යයෝ 'උපේක්ෂා සහගත වූ, සිහියෙන් යුක්ත වූ, සැප විහරණයෙන් යුක්ත වූවෙක්' යැයි කියන යම් ඒ සුඛයක් කයින් අත්විඳිමින්, තෙවන ධ්‍යානයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'සැපය ද දුක ද ප්‍රහාණය කිරීමෙන්, පෙර තිබූ සෝමනස්ස දෝමනස්සයන්ගේ අස්තංගමණය නිසා දුක් ද නොවන, සැප ද නොවන උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'සියලු රූප සංඥාවන් මුළුමනින් ඉක්මවීමෙන්, ගැටීම් සංඥාවන්ගේ අස්තංගමණයෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, 'ආකාශය අනන්තයි' යනුවෙන් සලකමින් ආකාසානඤ්චායතනයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'සියලු ආකාසානඤ්චායතනය මුළුමනින් ඉක්මවා 'විඤ්ඤාණය අනන්තයි' යනුවෙන් සලකමින් විඤ්ඤාණඤ්චායතනයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'සියලු විඤ්ඤාණඤ්චායතනය මුළුමනින් ඉක්මවා 'කිසිවක් නැත' යනුවෙන් සලකමින් ආකිඤ්චඤ්ඤායතනයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින් මහණෙනි, භික්ෂුවක් මේ අයුරින් ප්‍රාර්ථනා කරන්නේ නම් – 'සියලු ආකිඤ්චඤ්ඤායතනය මුළුමනින් ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට එළඹ වාසය කරන්නෙමි' යි, මේ ආනාපානසති සමාධිය ම මැනවින් මෙනෙහි කළ යුතු ය.\n\nඑහෙයින්, මහණෙනි, යම් මහණෙක් ‘මුළුමනින්ම නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා සංඥා හා වේදනා නිරෝධයට පැමිණ වාසය කරන්නේ නම්’ මේ ආනාපානසති සමාධිය මැනවින් මෙනෙහි කළ යුත්තේය.\n\nමහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද ආනාපානසති සමාධිය ඇති කල්හි, යම් හෙයකින් සැප වේදනාවක් විඳින්නේ නම්, එය අනිත්‍ය යැයි දනී, එයට නොඇලී සිටිමි යැයි දනී, එය අභිනන්දනය නොකරමි යැයි දනී. යම් හෙයකින් දුක් වේදනාවක් විඳින්නේ නම්, එය අනිත්‍ය යැයි දනී, එයට නොඇලී සිටිමි යැයි දනී, එය අභිනන්දනය නොකරමි යැයි දනී. යම් හෙයකින් දුක්‌ද නොවූ, සැපද නොවූ වේදනාවක් විඳින්නේ නම්, එය අනිත්‍ය යැයි දනී, එයට නොඇලී සිටිමි යැයි දනී, එය අභිනන්දනය නොකරමි යැයි දනී.\n\nයම් හෙයකින් සැප වේදනාවක් විඳින්නේ නම්, කෙලෙස්‌ වලින් වෙන්වූවකු මෙන් එය විඳියි. යම් හෙයකින් දුක් වේදනාවක් විඳින්නේ නම්, කෙලෙස්‌ වලින් වෙන්වූවකු මෙන් එය විඳියි. යම් හෙයකින් දුක්‌ද නොවූ, සැපද නොවූ වේදනාවක් විඳින්නේ නම්, කෙලෙස්‌ වලින් වෙන්වූවකු මෙන් එය විඳියි. ඔහු කාය පර්යන්ත වූ වේදනාවක් විඳිමින් ‘කාය පර්යන්ත වූ වේදනාවක් විඳිමි’ යැයි දනී. ජීවිත පර්යන්ත වූ වේදනාවක් විඳිමින් ‘ජීවිත පර්යන්ත වූ වේදනාවක් විඳිමි’ යැයි දනී. ‘ශරීරය බිඳී යාමෙන් පසු, ජීවිතය අවසන් වීමෙන් පසු, මෙහිම සියලු නොඅභිනන්දිත වේදනා සිසිල් වනු ඇත’ යැයි දනී.\n\nමහණෙනි, යම් සේ තෙලද, පහන් තිරයද හේතු කොටගෙන තෙල් පහන දැල්වෙන්නේද, ඒ තෙල් හා තිරය අවසන් වීමෙන්, ආහාර නැති බැවින් එය නිවී යන්නේද; එසෙවම, මහණෙනි, මහණෙක් කාය පර්යන්ත වූ වේදනාවක් විඳිමින් ‘කාය පර්යන්ත වූ වේදනාවක් විඳිමි’ යැයි දනී. ජීවිත පර්යන්ත වූ වේදනාවක් විඳිමින් ‘ජීවිත පර්යන්ත වූ වේදනාවක් විඳිමි’ යැයි දනී. ‘ශරීරය බිඳී යාමෙන් පසු, ජීවිතය අවසන් වීමෙන් පසු, මෙහිම සියලු නොඅභිනන්දිත වේදනා සිසිල් වනු ඇත’ යැයි දනී.",
      "paliTitle": "Padīpopamasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 985,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena bhagavā bhikkhūnaṃ anekapariyāyena asubhakathaṃ katheti, asubhāya vaṇṇaṃ bhāsati, asubhabhāvanāya vaṇṇaṃ bhāsati. Atha kho bhagavā bhikkhū āmantesi – ‘‘icchāmahaṃ, bhikkhave, aḍḍhamāsaṃ paṭisallīyituṃ. Nāmhi kenaci upasaṅkamitabbo, aññatra ekena piṇḍapātanīhārakenā’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paṭissutvā nāssudha koci bhagavantaṃ upasaṅkamati, aññatra ekena piṇḍapātanīhārakena. Atha kho te bhikkhū – ‘‘bhagavā anekapariyāyena asubhakathaṃ katheti, asubhāya vaṇṇaṃ bhāsati, asubhabhāvanāya vaṇṇaṃ bhāsatī’’ti anekākāravokāraṃ asubhabhāvanānuyogamanuyuttā viharanti. Te iminā kāyena aṭṭīyamānā [aṭṭiyamānā (sī. syā. kaṃ. pī. ka.)] harāyamānā jigucchamānā satthahārakaṃ pariyesanti. Dasapi bhikkhū ekāhena satthaṃ āharanti, vīsampi…pe… tiṃsampi bhikkhū ekāhena satthaṃ āharanti. Atha kho bhagavā tassa aḍḍhamāsassa accayena paṭisallānā vuṭṭhito āyasmantaṃ ānandaṃ āmantesi – ‘‘kiṃ nu kho, ānanda, tanubhūto viya bhikkhusaṅgho’’ti? ‘‘Tathā hi pana, bhante, ‘bhagavā bhikkhūnaṃ anekapariyāyena asubhakathaṃ katheti, asubhāya vaṇṇaṃ bhāsati, asubhabhāvanāya vaṇṇaṃ bhāsatī’ti anekākāravokāraṃ asubhabhāvanānuyogamanuyuttā viharanti. Te iminā kāyena aṭṭīyamānā harāyamānā jigucchamānā satthahārakaṃ pariyesanti. Dasapi bhikkhū ekāhena satthaṃ āharanti, vīsampi bhikkhū… tiṃsampi bhikkhū ekāhena satthaṃ āharanti. Sādhu, bhante, bhagavā aññaṃ pariyāyaṃ ācikkhatu yathāyaṃ bhikkhusaṅgho aññāya saṇṭhaheyyā’’ti. ‘‘Tenahānanda, yāvatikā bhikkhū vesāliṃ upanissāya viharanti te sabbe upaṭṭhānasālāyaṃ sannipātehī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā yāvatikā bhikkhū vesāliṃ upanissāya viharanti te sabbe upaṭṭhānasālāyaṃ sannipātetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘sannipatito [sannipātito (sī.)], bhante, bhikkhusaṅgho. Yassa dāni, bhante, bhagavā kālaṃ maññatī’’ti. Atha kho bhagavā yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘ayampi kho, bhikkhave, ānāpānassatisamādhi bhāvito bahulīkato santo ceva paṇīto ca asecanako ca sukho ca vihāro uppannuppanne ca pāpake akusale dhamme ṭhānaso antaradhāpeti vūpasameti’’. ‘‘Seyyathāpi, bhikkhave, gimhānaṃ pacchime māse ūhataṃ rajojallaṃ, tamenaṃ mahāakālamegho ṭhānaso antaradhāpeti vūpasameti; evameva kho, bhikkhave, ānāpānassatisamādhi bhāvito bahulīkato santo ceva paṇīto ca asecanako ca sukho ca vihāro uppannuppanne ca pāpake akusale dhamme ṭhānaso antaradhāpeti vūpasameti. Kathaṃ bhāvito ca, bhikkhave, ānāpānassatisamādhi kathaṃ bahulīkato santo ceva paṇīto ca asecanako ca sukho ca vihāro uppannuppanne ca pāpake akusale dhamme ṭhānaso antaradhāpeti vūpasameti? ‘‘Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati… pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvito kho, bhikkhave, ānāpānassatisamādhi evaṃ bahulīkato santo ceva paṇīto ca asecanako ca sukho ca vihāro uppannuppanne ca pāpake akusale dhamme ṭhānaso antaradhāpeti vūpasametī’’ti. Navamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Now at that time, the Blessed One was teaching the bhikkhus in various ways about foulness, speaking in praise of foulness, and speaking in praise of the development of foulness meditation.\n\nThen the Blessed One addressed the bhikkhus, saying: \"Monks, I wish to seclude myself for half a month. I am not to be approached by anyone, except for one person bringing alms food.\"\n\n\"Yes, Venerable Sir,\" those bhikkhus replied to the Blessed One, and they did not approach the Blessed One, except for one person bringing alms food.\n\nThen those bhikkhus, having been instructed that \"the Blessed One teaches in various ways about foulness, speaks in praise of foulness, and speaks in praise of the development of foulness meditation,\" remained engaged in the practice of foulness meditation in various ways and modes. Feeling tormented by this body, ashamed of it, and disgusted by it, they sought for a weapon-bringer to end their lives. Even ten bhikkhus brought weapons on a single day; even twenty bhikkhus… even thirty bhikkhus brought weapons on a single day.\n\nThen, after that half-month had passed, the Blessed One emerged from seclusion and addressed the Venerable Ānanda, saying: \"Ānanda, why does the monastic community seem to have diminished?\"\n\n\"Indeed, Venerable Sir, because the Blessed One taught the bhikkhus in various ways about foulness, spoke in praise of foulness, and spoke in praise of the development of foulness meditation, they remained engaged in the practice of foulness meditation in various ways and modes. Feeling tormented by this body, ashamed of it, and disgusted by it, they sought for a weapon-bringer. Even ten bhikkhus brought weapons on a single day, even twenty bhikkhus… even thirty bhikkhus brought weapons on a single day. It would be good, Venerable Sir, if the Blessed One would teach another method, so that this monastic community may become established in proper understanding.\"\n\n\"Then, Ānanda, assemble all the bhikkhus who are dwelling dependent on Vesālī in the service hall.\"\n\n\"Yes, Venerable Sir,\" the Venerable Ānanda replied to the Blessed One. Having assembled all the bhikkhus who were dwelling dependent on Vesālī in the service hall, he went to the Blessed One, and on arrival, he said to the Blessed One: \"Venerable Sir, the monastic community is assembled. May the Blessed One now do as he deems fit.\"\n\nThen the Blessed One went to the service hall; on arrival, he sat down on the seat prepared for him. Having sat down, the Blessed One addressed the bhikkhus, saying: \"Monks, this concentration through mindfulness of breathing, when developed and extensively practiced, is peaceful, sublime, an unadulterated pleasure, and a pleasant dwelling, and it extinguishes and appeases any evil unwholesome states that may arise, completely and on the spot.\"\n\n\"Just as, monks, in the last month of the hot season, when dust and dirt have accumulated, a great unseasonal cloud immediately extinguishes and appeases it; in the same way, monks, this concentration through mindfulness of breathing, when developed and extensively practiced, is peaceful, sublime, an unadulterated pleasure, and a pleasant dwelling, and it extinguishes and appeases any evil unwholesome states that may arise, completely and on the spot.\n\n\"And how, monks, is this concentration through mindfulness of breathing developed and extensively practiced so that it is peaceful, sublime, an unadulterated pleasure, and a pleasant dwelling, and it extinguishes and appeases any evil unwholesome states that may arise?\"\n\n\"Here, monks, a bhikkhu, gone to a wilderness, or to the root of a tree, or to an empty hut, sits down, having folded his legs crosswise, set his body upright, and established mindfulness at the forefront. Mindfully he breathes in, mindfully he breathes out… he trains himself, ‘I will breathe in contemplating relinquishment’; he trains himself, ‘I will breathe out contemplating relinquishment.’ It is in this way, monks, that concentration through mindfulness of breathing, when developed and extensively practiced, is peaceful, sublime, an unadulterated pleasure, and a pleasant dwelling, and it extinguishes and appeases any evil unwholesome states that may arise, completely and on the spot.\"",
      "sinhala": "මා හට මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ විශාලා මහනුවර, මහවනයෙහි, කූටාගාර ශාලාවෙහි වැඩසිටින සේක. ඒ කල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට නොයෙක් ක්‍රමවලින් අසුභ කථාව දේශනා කරන සේක, අසුභයේ ගුණ වර්ණනා කරන සේක, අසුභ භාවනාවේ ගුණ වර්ණනා කරන සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මම අඩමසක් පටිසල්ලානයෙහි වැඩසිටින්නට කැමැත්තෙමි. එක් පිණ්ඩපාතය ගෙන එන්නෙකු හැර අන් කිසිවෙක් මා වෙත පැමිණිය යුතු නැත.\" \"එසේය, ස්වාමීනි\" කියා ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, එක් පිණ්ඩපාතය ගෙන එන්නෙකු හැර අන් කිසිවෙක් භාග්‍යවතුන් වහන්සේ වෙත නොපැමිණියේය. ඉක්බිති ඒ භික්ෂූහු \"භාග්‍යවතුන් වහන්සේ නොයෙක් ක්‍රමවලින් අසුභ කථාව දේශනා කරන සේක, අසුභයේ ගුණ වර්ණනා කරන සේක, අසුභ භාවනාවේ ගුණ වර්ණනා කරන සේකැ\"යි සලකා, නොයෙක් අයුරින් අසුභ භාවනාවෙහි නිරතව වාසය කළහ. ඔවුහු මේ කය පිළිබඳව අධික ලෙස පිළිකුල් කරමින්, ලජ්ජා වෙමින්, කිළුටු ලෙස සලකමින්, ශස්ත්‍රය ගෙන එන්නෙකු සොයන්නට වූහ. දස දෙනෙක් ද එක් දිනක් තුළ (තමන්ටම) ආයුධ ගත්හ. විසි දෙනෙක් ද, තිස් දෙනෙක් ද, එක් දිනක් තුළ ආයුධ ගත්හ. ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ අඩමස ගෙවී ගිය පසු පටිසල්ලානයෙන් නැඟිට, ආනන්ද ස්ථවිරයන් වහන්සේ අමතා වදාළ සේක: \"ආනන්දය, භික්ෂු සංඝයා සිහින් වී (අඩු වී) ඇති බවක් පෙනෙන්නේ ඇයි?\" \"ස්වාමීනි, ඒ මක්නිසාද යත්, 'භාග්‍යවතුන් වහන්සේ නොයෙක් ක්‍රමවලින් අසුභ කථාව දේශනා කරන සේක, අසුභයේ ගුණ වර්ණනා කරන සේක, අසුභ භාවනාවේ ගුණ වර්ණනා කරන සේකැ'යි සලකා, ඔවුහු නොයෙක් අයුරින් අසුභ භාවනාවෙහි නිරතව වාසය කරති. ඔවුහු මේ කය පිළිබඳව අධික ලෙස පිළිකුල් කරමින්, ලජ්ජා වෙමින්, කිළුටු ලෙස සලකමින්, ශස්ත්‍රය ගෙන එන්නෙකු සොයති. දස දෙනෙක් ද එක් දිනක් තුළ ආයුධ ගනිති. විසි දෙනෙක් ද, තිස් දෙනෙක් ද, එක් දිනක් තුළ ආයුධ ගනිති. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ වෙනත් ක්‍රමයක් දේශනා කරන සේක්වා, මේ භික්ෂු සංඝයා වෙනත් ආකාරයකින් (නිවැරදි ලෙස) පිහිටා සිටින පිණිස.\" \"එසේනම් ආනන්දය, විශාලාව ඇසුරු කරගෙන වාසය කරන යම්තාක් භික්ෂූහු සිටිත් ද, ඔවුන් සියල්ලන්ම උපස්ථාන ශාලාවට රැස් කරවන්න.\" \"එසේය, ස්වාමීනි\" කියා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, විශාලාව ඇසුරු කරගෙන වාසය කරන යම්තාක් භික්ෂූහු සිටිත් ද, ඔවුන් සියල්ලන්ම උපස්ථාන ශාලාවට රැස් කරවා, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය: \"ස්වාමීනි, භික්ෂු සංඝයා රැස්ව සිටී. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ යමක් සුදුසු යැයි සිතන සේක් ද, එයට සුදුසු කාලයයි.\" ඉක්බිති භාග්‍යවතුන් වහන්සේ උපස්ථාන ශාලාව තිබූ තැනට වැඩියේය. වැඩමවා, පනවන ලද ආසනයක වැඩහුන් සේක. වැඩහිඳ, භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මේ ආනාපානසති සමාධිය ද, වඩන ලද්දේ ද, බහුල වශයෙන් පුරුදු කරන ලද්දේ ද වූ කල්හි, ශාන්ත වූ, ප්‍රණීත වූ, අශුෂ්ක වූ, සැප විහරණයකි. උපදින උපදින පාපී අකුසල ධර්මයන් යම්තැනක ද එතැනින්ම නැති කර දමයි, සන්සිඳවයි. මහණෙනි, යම්සේ ගිම්හාන ඍතුවේ අන්තිම මාසයෙහි නැගී එන දූවිලි හා මඩ, එයට මහත් වූ අකල් වැස්සක් යම්තැනක ද එතැනින්ම නැති කර දමයි, සන්සිඳවයි. එලෙසින්ම, මහණෙනි, ආනාපානසති සමාධිය වඩන ලද්දේ ද, බහුල වශයෙන් පුරුදු කරන ලද්දේ ද වූ කල්හි, ශාන්ත වූ, ප්‍රණීත වූ, අශුෂ්ක වූ, සැප විහරණයකි. උපදින උපදින පාපී අකුසල ධර්මයන් යම්තැනක ද එතැනින්ම නැති කර දමයි, සන්සිඳවයි. මහණෙනි, කෙසේ වඩන ලද්දේ ද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ ද වූ ආනාපානසති සමාධිය ශාන්ත වූ, ප්‍රණීත වූ, අශුෂ්ක වූ, සැප විහරණයක් වන්නේ ද, උපදින උපදින පාපී අකුසල ධර්මයන් යම්තැනක ද එතැනින්ම නැති කර දමන්නේ ද, සන්සිඳවන්නේ ද? මහණෙනි, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගියේ හෝ, රුක් මුලකට ගියේ හෝ, ශූන්‍යාගාරයකට ගියේ හෝ, පලක් බැඳ හිඳ ගනී. කය ඍජු කොට පිහිටුවා, මුහුණ ඉදිරියෙහි සිහිය පිහිටුවාගෙන. ඔහු සිහියෙන් යුතුව ආශ්වාස කරයි, සිහියෙන් යුතුව ප්‍රශ්වාස කරයි... 'අත්හැරීම මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි'යි හික්මෙයි. 'අත්හැරීම මෙනෙහි කරමින් ප්‍රශ්වාස කරන්නෙමි'යි හික්මෙයි. මහණෙනි, මෙසේ වඩන ලද්දේ ද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ ද වූ ආනාපානසති සමාධිය ශාන්ත වූ, ප්‍රණීත වූ, අශුෂ්ක වූ, සැප විහරණයකි. උපදින උපදින පාපී අකුසල ධර්මයන් යම්තැනක ද එතැනින්ම නැති කර දමයි, සන්සිඳවයි.\"",
      "paliTitle": "Vesālīsuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 986,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kimilāyaṃ [kimbilāyaṃ (sī. pī.)] viharati veḷuvane. Tatra kho bhagavā āyasmantaṃ kimilaṃ āmantesi – ‘‘kathaṃ bhāvito nu kho, kimila, ānāpānassatisamādhi kathaṃ bahulīkato mahapphalo hoti mahānisaṃso’’ti? Evaṃ vutte āyasmā kimilo tuṇhī ahosi. Dutiyampi kho bhagavā…pe… tatiyampi kho bhagavā āyasmantaṃ kimilaṃ āmantesi – ‘‘kathaṃ bhāvito nu kho, kimila, ānāpānassatisamādhi kathaṃ bahulīkato mahapphalo hoti mahānisaṃso’’ti? Tatiyampi kho āyasmā kimilo tuṇhī ahosi. Evaṃ vutte āyasmā ānando bhagavantaṃ etadavoca – ‘‘etassa, bhagavā, kālo; etassa, sugata, kālo! Yaṃ bhagavā ānāpānassatisamādhiṃ bhāseyya. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahānanda, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca – ‘‘kathaṃ bhāvito ca, ānanda, ānāpānassatisamādhi kathaṃ bahulīkato mahapphalo hoti mahānisaṃso? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati. Evaṃ bhāvito kho, ānanda, ānāpānassatisamādhi evaṃ bahulīkato mahapphalo hoti mahānisaṃso’’. ‘‘Yasmiṃ samaye, ānanda, bhikkhu dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti, dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti; rassaṃ vā assasanto ‘rassaṃ assasāmī’ti pajānāti, rassaṃ vā passasanto ‘rassaṃ passasāmī’ti pajānāti; ‘sabbakāyappaṭisaṃvedī assasissāmī’ti sikkhati, ‘sabbakāyappaṭisaṃvedī passasissāmī’ti sikkhati; ‘passambhayaṃ kāyasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ kāyasaṅkhāraṃ passasissāmī’ti sikkhati – kāye kāyānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Kāyaññatarāhaṃ, ānanda, etaṃ vadāmi yadidaṃ – assāsapassāsaṃ. Tasmātihānanda, kāye kāyānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, ānanda, bhikkhu ‘pītippaṭisaṃvedī assasissāmī’ti sikkhati, ‘pītippaṭisaṃvedī passasissāmī’ti sikkhati; ‘sukhappaṭisaṃvedī assasissāmī’ti sikkhati, ‘sukhappaṭisaṃvedī passasissāmī’ti sikkhati; ‘cittasaṅkhārappaṭisaṃvedī assasissāmī’ti sikkhati, ‘cittasaṅkhārappaṭisaṃvedī passasissāmī’ti sikkhati; ‘passambhayaṃ cittasaṅkhāraṃ passasissāmī’ti sikkhati – vedanāsu vedanānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Vedanāññatarāhaṃ, ānanda, etaṃ vadāmi, yadidaṃ – assāsapassāsānaṃ [assāsapassāsaṃ (pī. ka.) ma. ni. 3.145] sādhukaṃ manasikāraṃ. Tasmātihānanda, vedanāsu vedanānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, ānanda, bhikkhu ‘cittappaṭisaṃvedī assasissāmī’ti sikkhati, ‘cittappaṭisaṃvedī passasissāmī’ti sikkhati; abhippamodayaṃ cittaṃ…pe… samādahaṃ cittaṃ…pe… ‘vimocayaṃ cittaṃ assasissāmī’ti sikkhati, ‘vimocayaṃ cittaṃ passasissāmī’ti sikkhati – citte cittānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Nāhaṃ, ānanda, muṭṭhassatissa asampajānassa ānāpānassatisamādhibhāvanaṃ vadāmi. Tasmātihānanda, citte cittānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, ānanda, bhikkhu ‘aniccānupassī assasissāmī’ti sikkhati…pe… virāgānupassī… pe… nirodhānupassī…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati – dhammesu dhammānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. So yaṃ taṃ hoti abhijjhādomanassānaṃ pahānaṃ taṃ paññāya disvā sādhukaṃ ajjhupekkhitā hoti. Tasmātihānanda, dhammesu dhammānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Seyyathāpi, ānanda, catumahāpathe [cātummahāpathe (sī. syā. kaṃ.)] mahāpaṃsupuñjo. Puratthimāya cepi disāyaṃ āgaccheyya sakaṭaṃ vā ratho vā, upahanateva taṃ paṃsupuñjaṃ; pacchimāya cepi disāya āgaccheyya…pe… uttarāya cepi disāya…pe… dakkhiṇāya cepi disāya āgaccheyya sakaṭaṃ vā ratho vā, upahanateva taṃ paṃsupuñjaṃ. Evameva kho, ānanda, bhikkhu kāye kāyānupassī viharantopi upahanateva pāpake akusale dhamme; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharantopi upahanateva pāpake akusale dhamme’’ti. Dasamaṃ. Ekadhammavaggo paṭhamo. Tassuddānaṃ – Ekadhammo ca bojjhaṅgo, suddhikañca duve phalā; Ariṭṭho kappino dīpo, vesālī kimilena cāti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Kimilā, in the Veluvana.\n\nThere, the Blessed One addressed the venerable Kimila: \"How is the concentration of mindfulness of breathing developed, Kimila, how is it made much of, so that it yields great fruit and great benefit?\" When this was said, the venerable Kimila remained silent. A second time the Blessed One addressed the venerable Kimila: \"How is the concentration of mindfulness of breathing developed, Kimila, how is it made much of, so that it yields great fruit and great benefit?\" A second time the venerable Kimila remained silent. A third time the Blessed One addressed the venerable Kimila: \"How is the concentration of mindfulness of breathing developed, Kimila, how is it made much of, so that it yields great fruit and great benefit?\" A third time the venerable Kimila remained silent.\n\nWhen this was said, the venerable Ānanda addressed the Blessed One: \"It is time, Blessed One; it is time, Fortunate One! For the Blessed One to expound upon the concentration of mindfulness of breathing. Having heard from the Blessed One, the monastics will remember it.\" \"Then, Ānanda, listen, pay close attention; I will speak.\" \"Yes, Venerable Sir,\" replied the venerable Ānanda to the Blessed One. The Blessed One said this:\n\n\"How, Ānanda, is the concentration of mindfulness of breathing developed, how is it made much of, so that it yields great fruit and great benefit? Here, Ānanda, a monastic, gone to the wilderness, or to the root of a tree, or to an empty dwelling, sits down, having folded his legs crosswise, set his body erect, and established mindfulness in front of him. Mindfully he breathes in, mindfully he breathes out. He trains himself: 'I will breathe in contemplating relinquishment,' he trains himself: 'I will breathe out contemplating relinquishment.' It is in this way, Ānanda, that the concentration of mindfulness of breathing is developed, it is in this way that it is made much of, so that it yields great fruit and great benefit.\"\n\n\"At such time, Ānanda, when a monastic, breathing in long, understands 'I am breathing in long'; or breathing out long, understands 'I am breathing out long'; or breathing in short, understands 'I am breathing in short'; or breathing out short, understands 'I am breathing out short'; he trains himself: 'I will breathe in experiencing the whole body,' he trains himself: 'I will breathe out experiencing the whole body'; he trains himself: 'I will breathe in tranquilizing the bodily formation,' he trains himself: 'I will breathe out tranquilizing the bodily formation'—at that time, Ānanda, the monastic dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. For what reason? Because, Ānanda, I declare that breathing in and breathing out are a certain kind of body. Therefore, Ānanda, at that time the monastic dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\n\"At such time, Ānanda, when a monastic trains himself: 'I will breathe in experiencing rapture,' he trains himself: 'I will breathe out experiencing rapture'; he trains himself: 'I will breathe in experiencing pleasure,' he trains himself: 'I will breathe out experiencing pleasure'; he trains himself: 'I will breathe in experiencing the mental formation,' he trains himself: 'I will breathe out experiencing the mental formation'; he trains himself: 'I will breathe in tranquilizing the mental formation,' he trains himself: 'I will breathe out tranquilizing the mental formation'—at that time, Ānanda, the monastic dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. For what reason? Because, Ānanda, I declare that careful attention to breathing in and breathing out is a certain kind of feeling. Therefore, Ānanda, at that time the monastic dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\n\"At such time, Ānanda, when a monastic trains himself: 'I will breathe in experiencing the mind,' he trains himself: 'I will breathe out experiencing the mind'; he trains himself: 'I will breathe in gladdening the mind,' he trains himself: 'I will breathe out gladdening the mind'; he trains himself: 'I will breathe in concentrating the mind,' he trains himself: 'I will breathe out concentrating the mind'; he trains himself: 'I will breathe in liberating the mind,' he trains himself: 'I will breathe out liberating the mind'—at that time, Ānanda, the monastic dwells contemplating mind in mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. For what reason? Because, Ānanda, I do not declare the development of the concentration of mindfulness of breathing for one who is forgetful and without clear comprehension. Therefore, Ānanda, at that time the monastic dwells contemplating mind in mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\n\"At such time, Ānanda, when a monastic trains himself: 'I will breathe in contemplating impermanence,' he trains himself: 'I will breathe out contemplating impermanence'; he trains himself: 'I will breathe in contemplating dispassion,' he trains himself: 'I will breathe out contemplating dispassion'; he trains himself: 'I will breathe in contemplating cessation,' he trains himself: 'I will breathe out contemplating cessation'; he trains himself: 'I will breathe in contemplating relinquishment,' he trains himself: 'I will breathe out contemplating relinquishment'—at that time, Ānanda, the monastic dwells contemplating mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. Having seen with wisdom the relinquishment of covetousness and displeasure, he remains well-equipoised. Therefore, Ānanda, at that time the monastic dwells contemplating mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\nJust as, Ananda, at a crossroads there is a great heap of dust. Even if a cart or chariot comes from the eastern direction, it certainly scatters that heap of dust; even if a cart or chariot comes from the western direction, it certainly scatters that heap of dust; even if a cart or chariot comes from the northern direction, it certainly scatters that heap of dust; and even if a cart or chariot comes from the southern direction, it certainly scatters that heap of dust.\n\nIn the same way, Ananda, when a monk dwells observing the body in the body, he certainly overcomes evil unwholesome states; when he dwells observing feelings in feelings, he certainly overcomes evil unwholesome states; when he dwells observing consciousness in consciousness, he certainly overcomes evil unwholesome states; and when he dwells observing phenomena in phenomena, he certainly overcomes evil unwholesome states.\n\nThe Tenth. The first chapter is Ekadhamma. Its summary: Ekadhamma and Bojjhanga, Suddhika and the two Phala; Ariṭṭha, Kappina, Dīpa, Vesālī and Kimila.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කිමිලා නුවර, වේළුවනාරාමයෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් කිමිල තෙරුන් අමතා වදාළ සේක: “කිමිල, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ මහාඵල ඇත්තේ ද, මහානිසංස ඇත්තේ ද?” මෙසේ වදාළ කල්හි ආයුෂ්මත් කිමිල තෙරණුවෝ නිහඬ ව සිටියහ. දෙවෙනි වරටත් භාග්‍යවතුන් වහන්සේ ... තෙවෙනි වරටත් භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් කිමිල තෙරුන් අමතා වදාළ සේක: “කිමිල, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ මහාඵල ඇත්තේ ද, මහානිසංස ඇත්තේ ද?” තෙවෙනි වරටත් ආයුෂ්මත් කිමිල තෙරණුවෝ නිහඬ ව සිටියහ. මෙසේ වදාළ කල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි භාග්‍යවතුන් වහන්ස, මේ සඳහා කාලය පැමිණ ඇත. සුගතයන් වහන්ස, මේ සඳහා කාලය පැමිණ ඇත! භාග්‍යවතුන් වහන්සේ ආනාපානසති සමාධිය දේශනා කරනු මැනව. භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණය කොට භික්ෂූහු එය සිත්හි ධාරණය කර ගනිති.” “එසේනම් ආනන්ද, අසන්න, මැනවින් සිතට ගන්න; මම දේශනා කරන්නෙමි”යි වදාළ සේක. “එසේය, ස්වාමීනි”යි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “ආනන්ද, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ ද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ ද මහාඵල ඇත්තේ ද, මහානිසංස ඇත්තේ ද? ආනන්ද, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගොස් හෝ ගසක් මුලට ගොස් හෝ ශුන්‍යාගාරයකට ගොස් හෝ, පර්යංකයක් බැඳ, කය ඍජු ව තබාගෙන, සිහිය ඉදිරියෙහි පිහිටුවා වාඩිවෙයි. හෙතෙම සිහි නුවණින් යුතුව ආශ්වාස කරයි, සිහි නුවණින් යුතුව ප්‍රශ්වාස කරයි... ‘ප්‍රතිනිස්සර්ගය මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි. ‘ප්‍රතිනිස්සර්ගය මෙනෙහි කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි. ආනන්ද, මෙසේ වඩන ලද්දා වූ, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දා වූ ආනාපානසති සමාධිය මහාඵල ඇත්තේ ද, මහානිසංස ඇත්තේ ද වේ.”\n\n“ආනන්ද, යම් කලෙක භික්ෂුවක් දීර්ඝ වශයෙන් ආශ්වාස කරන්නේ ‘මම දීර්ඝ වශයෙන් ආශ්වාස කරමි’යි වටහා ගනී ද, දීර්ඝ වශයෙන් ප්‍රශ්වාස කරන්නේ ‘මම දීර්ඝ වශයෙන් ප්‍රශ්වාස කරමි’යි වටහා ගනී ද; කෙටි වශයෙන් ආශ්වාස කරන්නේ ‘මම කෙටි වශයෙන් ආශ්වාස කරමි’යි වටහා ගනී ද, කෙටි වශයෙන් ප්‍රශ්වාස කරන්නේ ‘මම කෙටි වශයෙන් ප්‍රශ්වාස කරමි’යි වටහා ගනී ද; ‘සමස්ත කයම අනුභව කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සමස්ත කයම අනුභව කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි; ‘කාය සංස්කාරය සන්හිඳුවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘කාය සංස්කාරය සන්හිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි – ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, කය අරමුණු කොට කය අනුව දකිනසුලු ව වාසය කරයි. ඒ කුමන හේතුවක් නිසා ද? ආනන්ද, ආශ්වාස ප්‍රශ්වාසය යනු කයෙහි එක්තරා ස්වභාවයක් යැයි මම කියමි. එහෙයින් ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, කය අරමුණු කොට කය අනුව දකිනසුලු ව වාසය කරයි.\n\n“ආනන්ද, යම් කලෙක භික්ෂුවක් ‘ප්‍රීතිය අනුභව කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘ප්‍රීතිය අනුභව කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි; ‘සුවය අනුභව කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සුවය අනුභව කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි; ‘චිත්ත සංස්කාරය අනුභව කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘චිත්ත සංස්කාරය අනුභව කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි; ‘චිත්ත සංස්කාරය සන්හිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි – ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, වේදනා අරමුණු කොට වේදනා අනුව දකිනසුලු ව වාසය කරයි. ඒ කුමන හේතුවක් නිසා ද? ආනන්ද, ආශ්වාස ප්‍රශ්වාසයන්ට මනා සේ සිත යොමු කිරීම යනු වේදනාවන්ගෙන් එක්තරා ස්වභාවයක් යැයි මම කියමි. එහෙයින් ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, වේදනා අරමුණු කොට වේදනා අනුව දකිනසුලු ව වාසය කරයි.\n\n“ආනන්ද, යම් කලෙක භික්ෂුවක් ‘සිත අනුභව කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත අනුභව කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි; ‘සිත ප්‍රමුදිත කරමින්... සිත සමාධිමත් කරමින්... ‘සිත මුදවාලමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත මුදවාලමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි – ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, සිත අරමුණු කොට සිත අනුව දකිනසුලු ව වාසය කරයි. ඒ කුමන හේතුවක් නිසා ද? ආනන්ද, සිහි මඳ වූ, මනා දැනීම් නැති තැනැත්තාට ආනාපානසති සමාධිය වැඩීමක් ඇතැයි මම නොකියමි. එහෙයින් ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, සිත අරමුණු කොට සිත අනුව දකිනසුලු ව වාසය කරයි.\n\n“ආනන්ද, යම් කලෙක භික්ෂුවක් ‘අනිත්‍යය මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි... ‘විරාගය මෙනෙහි කරමින්... නිරෝධය මෙනෙහි කරමින්... ‘ප්‍රතිනිස්සර්ගය මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘ප්‍රතිනිස්සර්ගය මෙනෙහි කරමින් ප්‍රශ්වාස කරන්නෙමි’යි හික්මෙයි – ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, ධර්මයන් අරමුණු කොට ධර්මයන් අනුව දකිනසුලු ව වාසය කරයි. යම් අභිධ්‍යා හා දෝමනස්සයන් ප්‍රහීණ වීමක් වේ ද, එය ප්‍රඥාවෙන් දැක මනා සේ උපේක්ෂාවෙන් යුක්ත ව සිටියි. එහෙයින් ආනන්ද, ඒ සමයෙහි භික්ෂුව තපස් ඇති ව, මනා දැනීම් ඇති ව, සිහි ඇති ව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කොට, ධර්මයන් අරමුණු කොට ධර්මයන් අනුව දකිනසුලු ව වාසය කරයි.\n\nආනන්දයෙනි, යම් සේ සතර මහා මාර්ග හන්දියක විශාල දූලි ගොඩක් ඇද්ද. පෙර දිශාවෙන් හෝ ගැල් රථයක් හෝ අශ්ව රථයක් හෝ පැමිණෙන්නේ නම්, ඒ දූලි ගොඩ විනාශ කරයිම. බටහිර දිශාවෙන් හෝ පැමිණෙන්නේ නම්, උතුරු දිශාවෙන් හෝ පැමිණෙන්නේ නම්, දකුණු දිශාවෙන් හෝ ගැල් රථයක් හෝ අශ්ව රථයක් හෝ පැමිණෙන්නේ නම්, ඒ දූලි ගොඩ විනාශ කරයිම.\n\nආනන්දයෙනි, එපරිද්දෙන්ම, භික්ෂුව කයෙහි කය අනුව බලමින් (කායානුපස්සීව) වාසය කරන විටත්, වේදනාවන්හි වේදනා අනුව බලමින් (වේදනානුපස්සීව) වාසය කරන විටත්, සිතෙහි සිත අනුව බලමින් (චිත්තානුපස්සීව) වාසය කරන විටත්, ධර්මයන්හි ධර්මයන් අනුව බලමින් (ධම්මානුපස්සීව) වාසය කරන විටත්, පාපී අකුසල ධර්මයන් විනාශ කරයිම.",
      "paliTitle": "Kimilasuttaṃ",
      "vagga": "Ekadhammavaggo"
    },
    {
      "number": 987,
      "pali": "Ekaṃ samayaṃ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘icchāmahaṃ, bhikkhave, temāsaṃ paṭisallīyituṃ. Nāmhi kenaci upasaṅkamitabbo, aññatra ekena piṇḍapātanīhārakenā’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paṭissutvā nāssudha koci bhagavantaṃ upasaṅkamati, aññatra ekena piṇḍapātanīhārakena. Atha kho bhagavā tassa temāsassa accayena paṭisallānā vuṭṭhito bhikkhū āmantesi – ‘‘sace kho, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘katamenāvuso, vihārena samaṇo gotamo vassāvāsaṃ bahulaṃ vihāsī’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘ānāpānassatisamādhinā kho, āvuso, bhagavā vassāvāsaṃ bahulaṃ vihāsī’ti. Idhāhaṃ, bhikkhave, sato assasāmi, sato passasāmi. Dīghaṃ assasanto ‘dīghaṃ assasāmī’ti pajānāmi, dīghaṃ passasanto ‘dīghaṃ passasāmī’ti pajānāmi; rassaṃ assasanto ‘rassaṃ assasāmī’ti pajānāmi, rassaṃ passasanto ‘rassaṃ passasāmī’ti pajānāmi; ‘sabbakāyappaṭisaṃvedī assasissāmī’ti pajānāmi… pe… ‘paṭinissaggānupassī assasissāmī’ti pajānāmi, ‘paṭinissaggānupassī passasissāmī’ti pajānāmi’’. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya – ‘ariyavihāro’ itipi, ‘brahmavihāro’ itipi, ‘tathāgatavihāro’ itipi. Ānāpānassatisamādhiṃ sammā vadamāno vadeyya – ‘ariyavihāro’ itipi, ‘brahmavihāro’ itipi, ‘tathāgatavihāro’ itipi. Ye te, bhikkhave, bhikkhū sekhā appattamānasā anuttaraṃ yogakkhemaṃ patthayamānā viharanti tesaṃ ānāpānassatisamādhi bhāvito bahulīkato āsavānaṃ khayāya saṃvattati. Ye ca kho te, bhikkhave, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññā vimuttā tesaṃ ānāpānassatisamādhi bhāvito bahulīkato diṭṭhadhammasukhavihārāya ceva saṃvattati satisampajaññāya ca. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya – ‘ariyavihāro’ itipi, ‘brahmavihāro’ itipi, ‘tathāgatavihāro’ itipi. Ānāpānassatisamādhiṃ sammā vadamāno vadeyya – ‘ariyavihāro’ itipi, ‘brahmavihāro’ itipi, ‘tathāgatavihāro’ itipī’’ti. Paṭhamaṃ.",
      "english": "Once the Blessed One was dwelling in Icchānaṅgala, in the Icchānaṅgala forest grove. There, the Blessed One addressed the bhikkhus: “Bhikkhus, I wish to seclude myself for three months. I am not to be approached by anyone, except for one person who brings almsfood.” “Yes, Venerable Sir,” those bhikkhus replied to the Blessed One, and no one there approached the Blessed One, except for one person who brought almsfood. Then, after the passing of those three months, having emerged from his seclusion, the Blessed One addressed the bhikkhus: “Bhikkhus, if wanderers of other sects were to ask you, ‘By what dwelling did the ascetic Gotama mostly spend the rainy season?’, when thus questioned, bhikkhus, you should answer those wanderers of other sects thus: ‘Friends, the Blessed One mostly spent the rainy season by means of the concentration through mindfulness of breathing.’ Here, bhikkhus, being mindful, I breathe in; being mindful, I breathe out. Breathing in a long breath, I know ‘I am breathing in a long breath’; breathing out a long breath, I know ‘I am breathing out a long breath.’ Breathing in a short breath, I know ‘I am breathing in a short breath’; breathing out a short breath, I know ‘I am breathing out a short breath.’ I train myself, ‘I will breathe in experiencing the whole body’; I train myself, ‘I will breathe out experiencing the whole body.’ I train myself, ‘I will breathe in calming the bodily formation’; I train myself, ‘I will breathe out calming the bodily formation.’ I train myself, ‘I will breathe in experiencing rapture’; I train myself, ‘I will breathe out experiencing rapture.’ I train myself, ‘I will breathe in experiencing pleasure’; I train myself, ‘I will breathe out experiencing pleasure.’ I train myself, ‘I will breathe in experiencing the mental formation’; I train myself, ‘I will breathe out experiencing the mental formation.’ I train myself, ‘I will breathe in calming the mental formation’; I train myself, ‘I will breathe out calming the mental formation.’ I train myself, ‘I will breathe in experiencing the mind’; I train myself, ‘I will breathe out experiencing the mind.’ I train myself, ‘I will breathe in gladdening the mind’; I train myself, ‘I will breathe out gladdening the mind.’ I train myself, ‘I will breathe in concentrating the mind’; I train myself, ‘I will breathe out concentrating the mind.’ I train myself, ‘I will breathe in liberating the mind’; I train myself, ‘I will breathe out liberating the mind.’ I train myself, ‘I will breathe in discerning impermanence’; I train myself, ‘I will breathe out discerning impermanence.’ I train myself, ‘I will breathe in discerning fading away’; I train myself, ‘I will breathe out discerning fading away.’ I train myself, ‘I will breathe in discerning cessation’; I train myself, ‘I will breathe out discerning cessation.’ I train myself, ‘I will breathe in discerning relinquishment’; I train myself, ‘I will breathe out discerning relinquishment.’”\n\n“Indeed, bhikkhus, if one were to rightly say of something, ‘This is a noble dwelling,’ or ‘This is a divine dwelling,’ or ‘This is a Tathāgata’s dwelling,’ one would rightly say it of the concentration through mindfulness of breathing. Bhikkhus, for those bhikkhus who are trainees, whose minds have not yet attained the goal, who dwell aspiring for the unsurpassed security from bondage, for them, the concentration through mindfulness of breathing, when developed and frequently practiced, conduces to the destruction of the taints. And for those bhikkhus, bhikkhus, who are arahants, whose taints are destroyed, who have lived the holy life, done what had to be done, laid down the burden, attained their own true goal, utterly destroyed the fetters of existence, and are liberated through perfect knowledge, for them, the concentration through mindfulness of breathing, when developed and frequently practiced, conduces to a pleasant abiding in this very life and to mindfulness and clear comprehension. Indeed, bhikkhus, if one were to rightly say of something, ‘This is a noble dwelling,’ or ‘This is a divine dwelling,’ or ‘This is a Tathāgata’s dwelling,’ one would rightly say it of the concentration through mindfulness of breathing.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ඉච්ඡානංගල නම් ගමෙහි ඉච්ඡානංගල වනසණ්ඩයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, මම තුන් මසක් පටිසල්ලීන වීමට කැමැත්තෙමි. පිණ්ඩපාතය ගෙන එන එක් භික්ෂුවක් හැර අන් කිසිවකු මා වෙත නොආ යුතුය.” “එසේය, ස්වාමීනි” යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට ප්‍රතිඥා දී, පිණ්ඩපාතය ගෙන එන එක් භික්ෂුවක් හැර අන් කිසිවකු භාග්‍යවතුන් වහන්සේ වෙත නොපැමිණියේය. ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ තුන් මස ගෙවා පටිසල්ලීන භාවයෙන් නැඟී සිට, භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, යම් හෙයකින් අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ‘ඇවැත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ බොහෝ විට වස්සාන කාලය ගත කළේ කවර විහරණයකින්දැ’ යි මෙසේ අසන්නාහු නම්, මහණෙනි, මෙසේ විමසූ කල්හි නුඹලා ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතුය: ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ බොහෝ විට වස්සාන කාලය ගත කළේ ආනාපානසති සමාධියෙනි’ කියා. මහණෙනි, මෙහිදී මම සිහි නුවණින් යුතුව හුස්ම ගනිමි, සිහි නුවණින් යුතුව හුස්ම හෙළමි. දීර්ඝ හුස්මක් ගනිමින් ‘මම දීර්ඝ හුස්මක් ගනිමි’ යි ප්‍රකටව දනිමි. දීර්ඝ හුස්මක් හෙළමින් ‘මම දීර්ඝ හුස්මක් හෙළමි’ යි ප්‍රකටව දනිමි. කෙටි හුස්මක් ගනිමින් ‘මම කෙටි හුස්මක් ගනිමි’ යි ප්‍රකටව දනිමි. කෙටි හුස්මක් හෙළමින් ‘මම කෙටි හුස්මක් හෙළමි’ යි ප්‍රකටව දනිමි. ‘මුළු කයම (ආශ්වාසය) අත්දකිමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘මුළු කයම (ප්‍රශ්වාසය) අත්දකිමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘කායසංස්කාරය සන්හිඳුවමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘කායසංස්කාරය සන්හිඳුවමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘ප්‍රීතිය අත්දකිමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘ප්‍රීතිය අත්දකිමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘සුවය අත්දකිමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘සුවය අත්දකිමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘චිත්තසංස්කාරය අත්දකිමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘චිත්තසංස්කාරය අත්දකිමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘චිත්තසංස්කාරය සන්හිඳුවමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘චිත්තසංස්කාරය සන්හිඳුවමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘සිත අත්දකිමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘සිත අත්දකිමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘සිත සතුටු කරමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘සිත සතුටු කරමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘සිත සමාධිමත් කරමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘සිත සමාධිමත් කරමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘සිත කෙලෙසුන්ගෙන් මුදවමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘සිත කෙලෙසුන්ගෙන් මුදවමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘අනිත්‍යභාවය අනුපස්සනා කරමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘අනිත්‍යභාවය අනුපස්සනා කරමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘රාගය දුරු කිරීම අනුපස්සනා කරමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘රාගය දුරු කිරීම අනුපස්සනා කරමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘නිරෝධය අනුපස්සනා කරමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘නිරෝධය අනුපස්සනා කරමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි. ‘කෙලෙස් අත්හැරීම අනුපස්සනා කරමින් හුස්ම ගනිමි’ යි ප්‍රකටව දනිමි. ‘කෙලෙස් අත්හැරීම අනුපස්සනා කරමින් හුස්ම හෙළමි’ යි ප්‍රකටව දනිමි.”\n\n“මහණෙනි, යමක් අරියවිහාරය යැයි ද, බ්‍රහ්මවිහාරය යැයි ද, තථාගතවිහාරය යැයි ද නිවැරදිව කියන්නේ නම්, ආනාපානසති සමාධිය නිවැරදිව අරියවිහාරය යැයි ද, බ්‍රහ්මවිහාරය යැයි ද, තථාගතවිහාරය යැයි ද කිව යුතුය. මහණෙනි, යම් ඒ භික්ෂූහු ශික්ෂාව සම්පූර්ණ කර නොගත්, උතුම් වූ යෝගක්ෂේමය පතමින් වාසය කරන ශෛක්ෂ භික්ෂූහු වෙත්ද, ඔවුනට භාවනා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද ආනාපානසති සමාධිය ආශ්‍රවයන් ක්ෂය කිරීමට උපකාර වේ. මහණෙනි, යම් ඒ භික්ෂූහු රහත් වූ, ක්ෂීණාශ්‍රව වූ, බඹසර වසා නිම කළ, කළ යුතු දේ කළ, බර බහා තැබූ, තම අර්ථය අවබෝධ කරගත්, භව සංයෝජන ක්ෂය කළ, සම්‍යක් ප්‍රඥාවෙන් විමුක්ත වූ භික්ෂූහු වෙත්ද, ඔවුනට භාවනා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද ආනාපානසති සමාධිය මේ ආත්මයෙහිම සැප විහරණයට ද, සිහි නුවණින් යුතුව වාසය කිරීමට ද උපකාර වේ.\n\n“මහණෙනි, යමක් අරියවිහාරය යැයි ද, බ්‍රහ්මවිහාරය යැයි ද, තථාගතවිහාරය යැයි ද නිවැරදිව කියන්නේ නම්, ආනාපානසති සමාධිය නිවැරදිව අරියවිහාරය යැයි ද, බ්‍රහ්මවිහාරය යැයි ද, තථාගතවිහාරය යැයි ද කිව යුතුය.”",
      "paliTitle": "Icchānaṅgalasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 988,
      "pali": "Ekaṃ samayaṃ āyasmā lomasakaṃbhiyo [lomasavaṅgiso (sī. pī.)] sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho mahānāmo sakko yenāyasmā lomasakaṃbhiyo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ lomasakaṃbhiyaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo sakko āyasmantaṃ lomasakaṃbhiyaṃ etadavoca – ‘‘so eva nu kho, bhante, sekho vihāro so tathāgatavihāro, udāhu aññova [añño (syā. kaṃ. pī. ka.)] sekho vihāro añño tathāgatavihāro’’ti? ‘‘Na kho, āvuso mahānāma, sveva sekho vihāro, so tathāgatavihāro. Añño kho, āvuso mahānāma, sekho vihāro, añño tathāgatavihāro. Ye te, āvuso mahānāma, bhikkhū sekhā appattamānasā anuttaraṃ yogakkhemaṃ patthayamānā viharanti, te pañca nīvaraṇe pahāya viharanti. Katame pañca? Kāmacchandanīvaraṇaṃ pahāya viharanti, byāpādanīvaraṇaṃ…pe… thinamiddhanīvaraṇaṃ…pe… uddhaccakukkuccanīvaraṇaṃ…pe… vicikicchānīvaraṇaṃ pahāya viharanti. ‘‘Yepi te, āvuso mahānāma, bhikkhū sekhā appattamānasā anuttaraṃ yogakkhemaṃ patthayamānā viharanti, te ime pañca nīvaraṇe pahāya viharanti. ‘‘Ye ca kho te, āvuso mahānāma, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññā vimuttā, tesaṃ pañca nīvaraṇā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā [anabhāvakatā (sī. pī.)] āyatiṃ anuppādadhammā. Katame pañca? Kāmacchandanīvaraṇaṃ pahīnaṃ ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ; byāpādanīvaraṇaṃ pahīnaṃ…pe… thinamiddhanīvaraṇaṃ…pe… uddhaccakukkuccanīvaraṇaṃ…pe… vicikicchānīvaraṇaṃ pahīnaṃ ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ. ‘‘Ye te, āvuso mahānāma, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññā vimuttā, tesaṃ ime pañca nīvaraṇā pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Tadamināpetaṃ, āvuso mahānāma, pariyāyena veditabbaṃ yathā – aññova sekho vihāro, añño tathāgatavihāro. ‘‘Ekamidaṃ, āvuso mahānāma, samayaṃ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Tatra kho, āvuso mahānāma, bhagavā bhikkhū āmantesi – ‘icchāmahaṃ, bhikkhave, temāsaṃ paṭisallīyituṃ. Nāmhi kenaci upasaṅkamitabbo, aññatra ekena piṇḍapātanīhārakenā’ti. ‘Evaṃ, bhante’ti kho, āvuso mahānāma, te bhikkhū bhagavato paṭissutvā nāssudha koci bhagavantaṃ upasaṅkamati, aññatra ekena piṇḍapātanīhārakena. ‘‘Atha kho, āvuso, bhagavā tassa temāsassa accayena paṭisallānā vuṭṭhito bhikkhū āmantesi – ‘sace kho, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – katamenāvuso, vihārena samaṇo gotamo vassāvāsaṃ bahulaṃ vihāsīti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ānāpānassatisamādhinā kho, āvuso, bhagavā vassāvāsaṃ bahulaṃ vihāsīti. Idhāhaṃ, bhikkhave, sato assasāmi, sato passasāmi. Dīghaṃ assasanto dīghaṃ assasāmīti pajānāmi, dīghaṃ passasanto dīghaṃ passasāmīti pajānāmi…pe… paṭinissaggānupassī assasissāmīti pajānāmi, paṭinissaggānupassī passasissāmī’ti pajānāmi’’. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipi. Ānāpānassatisamādhiṃ sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipi. ‘‘Ye te, bhikkhave, bhikkhū sekhā appattamānasā anuttaraṃ yogakkhemaṃ patthayamānā viharanti, tesaṃ ānāpānassatisamādhi bhāvito bahulīkato āsavānaṃ khayāya saṃvattati. ‘‘Ye ca kho te, bhikkhave, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññā vimuttā, tesaṃ ānāpānassatisamādhi bhāvito bahulīkato diṭṭheva dhamme sukhavihārāya ceva saṃvattati satisampajaññāya ca. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipi. Ānāpānassatisamādhiṃ sammā vadamāno vadeyya – ariyavihāro itipi, brahmavihāro itipi, tathāgatavihāro itipī’’ti. ‘‘Iminā kho etaṃ, āvuso mahānāma, pariyāyena veditabbaṃ, yathā – aññova sekho vihāro, añño tathāgatavihāro’’ti. Dutiyaṃ.",
      "english": "Once, the Venerable Lomasakaṃbhiyo was staying among the Sakyans at Nigrodharama in Kapilavatthu. Then Mahānāma the Sakyan approached the Venerable Lomasakaṃbhiyo. Having approached and exchanged greetings with the Venerable Lomasakaṃbhiyo, he sat down to one side. Seated to one side, Mahānāma the Sakyan said to the Venerable Lomasakaṃbhiyo: \"Venerable sir, is the training dwelling indeed the same as the Tathāgata's dwelling, or is the training dwelling one thing and the Tathāgata's dwelling another?\"\n\n\"No, friend Mahānāma, the training dwelling is not the same as the Tathāgata's dwelling. The training dwelling, friend Mahānāma, is one thing, and the Tathāgata's dwelling is another. Those bhikkhus, friend Mahānāma, who are trainees, who have not yet attained their goal, who aspire to the unsurpassed security from bondage, they dwell having abandoned the five hindrances. Which five? They dwell having abandoned the hindrance of sensual desire, the hindrance of ill-will, the hindrance of sloth and torpor, the hindrance of restlessness and remorse, and the hindrance of doubt. Indeed, those bhikkhus, friend Mahānāma, who are trainees, who have not yet attained their goal, who aspire to the unsurpassed security from bondage, they dwell having abandoned these five hindrances. But those bhikkhus, friend Mahānāma, who are Arahants, whose taints are destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached their own true goal, utterly ended the fetters of existence, and are liberated through perfect knowledge, for them the five hindrances are abandoned, uprooted, made like a palm-stump, brought to non-existence, and are incapable of future arising. Which five? The hindrance of sensual desire is abandoned, uprooted, made like a palm-stump, brought to non-existence, and is incapable of future arising; the hindrance of ill-will is abandoned, uprooted, made like a palm-stump, brought to non-existence, and is incapable of future arising; the hindrance of sloth and torpor is abandoned, uprooted, made like a palm-stump, brought to non-existence, and is incapable of future arising; the hindrance of restlessness and remorse is abandoned, uprooted, made like a palm-stump, brought to non-existence, and is incapable of future arising; the hindrance of doubt is abandoned, uprooted, made like a palm-stump, brought to non-existence, and is incapable of future arising. Those bhikkhus, friend Mahānāma, who are Arahants, whose taints are destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached their own true goal, utterly ended the fetters of existence, and are liberated through perfect knowledge, for them these five hindrances are abandoned, uprooted, made like a palm-stump, brought to non-existence, and are incapable of future arising. Thus, friend Mahānāma, it should be understood by this method that the training dwelling is one thing, and the Tathāgata's dwelling is another.\n\n\"Once, friend Mahānāma, the Blessed One was staying at Icchānaṅgala, in the Icchānaṅgala forest thicket. There, friend Mahānāma, the Blessed One addressed the bhikkhus, saying: 'Monks, I wish to seclude myself for three months. No one should approach me, except for one who brings almsfood.' 'Yes, Venerable sir,' friend Mahānāma, those bhikkhus replied to the Blessed One, and no one there approached the Blessed One, except for one who brought almsfood. Then, friend, after the passing of those three months, the Blessed One emerged from his seclusion and addressed the bhikkhus, saying: 'Monks, if other sectarians and wanderers were to ask you, \"Friends, with what dwelling did the recluse Gotama mostly spend the rainy season retreat?\", being thus asked, monks, you should answer those other sectarians and wanderers thus: \"Friends, the Blessed One mostly spent the rainy season retreat with the concentration of mindfulness of breathing.\"' 'Here, monks, I breathe in mindfully, I breathe out mindfully. Breathing in a long breath, I know 'I breathe in a long breath'; breathing out a long breath, I know 'I breathe out a long breath.' Breathing in a short breath, I know 'I breathe in a short breath'; breathing out a short breath, I know 'I breathe out a short breath.' I train myself, 'I shall breathe in experiencing the whole body'; I train myself, 'I shall breathe out experiencing the whole body.' I train myself, 'I shall breathe in tranquilizing the bodily formation'; I train myself, 'I shall breathe out tranquilizing the bodily formation.' I train myself, 'I shall breathe in experiencing rapture'; I train myself, 'I shall breathe out experiencing rapture.' I train myself, 'I shall breathe in experiencing pleasure'; I train myself, 'I shall breathe out experiencing pleasure.' I train myself, 'I shall breathe in experiencing the mental formation'; I train myself, 'I shall breathe out experiencing the mental formation.' I train myself, 'I shall breathe in tranquilizing the mental formation'; I train myself, 'I shall breathe out tranquilizing the mental formation.' I train myself, 'I shall breathe in experiencing the mind'; I train myself, 'I shall breathe out experiencing the mind.' I train myself, 'I shall breathe in gladdening the mind'; I train myself, 'I shall breathe out gladdening the mind.' I train myself, 'I shall breathe in concentrating the mind'; I train myself, 'I shall breathe out concentrating the mind.' I train myself, 'I shall breathe in liberating the mind'; I train myself, 'I shall breathe out liberating the mind.' I train myself, 'I shall breathe in contemplating impermanence'; I train myself, 'I shall breathe out contemplating impermanence.' I train myself, 'I shall breathe in contemplating fading away'; I train myself, 'I shall breathe out contemplating fading away.' I train myself, 'I shall breathe in contemplating cessation'; I train myself, 'I shall breathe out contemplating cessation.' I train myself, 'I shall breathe in contemplating relinquishment'; I train myself, 'I shall breathe out contemplating relinquishment.'' 'If one were to rightly say of something, \"This is the noble dwelling,\" or \"This is the divine dwelling,\" or \"This is the Tathāgata's dwelling,\" it is of the concentration of mindfulness of breathing that one should rightly say this: \"This is the noble dwelling,\" or \"This is the divine dwelling,\" or \"This is the Tathāgata's dwelling.\" Those bhikkhus, monks, who are trainees, who have not yet attained their goal, who aspire to the unsurpassed security from bondage, for them the concentration of mindfulness of breathing, when developed and frequently practiced, conduces to the destruction of the taints. But those bhikkhus, monks, who are Arahants, whose taints are destroyed, who have lived the holy life, done what had to be done, laid down the burden, reached their own true goal, utterly ended the fetters of existence, and are liberated through perfect knowledge, for them the concentration of mindfulness of breathing, when developed and frequently practiced, conduces both to a pleasant dwelling in this very life and to mindfulness and clear comprehension. If one were to rightly say of something, \"This is the noble dwelling,\" or \"This is the divine dwelling,\" or \"This is the Tathāgata's dwelling,\" it is of the concentration of mindfulness of breathing that one should rightly say this: \"This is the noble dwelling,\" or \"This is the divine dwelling,\" or \"This is the Tathāgata's dwelling.\" Thus, friend Mahānāma, it should be understood by this method that the training dwelling is one thing, and the Tathāgata's dwelling is another.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ලෝමසකම්භිය ස්ථවිරයන් වහන්සේ ශාක්‍ය දේශයේ කපිලවස්තු නුවර නිග්‍රෝධාරාමයේ වැඩසිටියහ. එකල්හී මහානාම ශාක්‍යයා ආයුෂ්මත් ලෝමසකම්භිය ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් ලෝමසකම්භිය ස්ථවිරයන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ මහානාම ශාක්‍යයා ආයුෂ්මත් ලෝමසකම්භිය ස්ථවිරයන් වහන්සේට මෙසේ පැවසීය – ‘‘ස්වාමීනී, සේඛ විහරණය සහ තථාගත විහරණය එකම එකක්ද? නැතිනම් සේඛ විහරණය වෙනම එකක්ද, තථාගත විහරණය වෙනම එකක්ද?’’\n\n‘‘ඇවැත් මහානාමයෙනි, සේඛ විහරණය සහ තථාගත විහරණය එකම එකක් නොවේ. ඇවැත් මහානාමයෙනි, සේඛ විහරණය වෙනම එකකි, තථාගත විහරණය වෙනම එකකි. ඇවැත් මහානාමයෙනි, යම් භික්ෂූන් වහන්සේලා සේඛ අවස්ථාවෙහි සිටිමින්, (තවම) අරහත්වය නොලැබූ සිත් ඇතිව, අනුත්තර වූ යෝගක්ෂේමය පතමින් වැඩවසන්නාහුද, උන්වහන්සේලා පංච නීවරණ ප්‍රහීණ කොට වැඩවසති. ඒ කවර පසක්ද? උන්වහන්සේලා කාමච්ඡන්ද නීවරණය ප්‍රහීණ කොට වැඩවසති, ව්‍යාපාද නීවරණය ප්‍රහීණ කොට වැඩවසති, ථීනමිද්ධ නීවරණය ප්‍රහීණ කොට වැඩවසති, උද්ධච්චකුක්කුච්ච නීවරණය ප්‍රහීණ කොට වැඩවසති, විචිකිච්ඡා නීවරණය ප්‍රහීණ කොට වැඩවසති. ඇවැත් මහානාමයෙනි, යම් ඒ භික්ෂූන් වහන්සේලා සේඛ අවස්ථාවෙහි සිටිමින්, (තවම) අරහත්වය නොලැබූ සිත් ඇතිව, අනුත්තර වූ යෝගක්ෂේමය පතමින් වැඩවසන්නාහුද, උන්වහන්සේලා මේ පංච නීවරණ ප්‍රහීණ කොට වැඩවසති.\n\n‘‘ඇවැත් මහානාමයෙනි, යම් ඒ අරහත් වූ, ක්ෂීණාශ්‍රව වූ, බ්‍රහ්මචර්යාව සම්පූර්ණ කළ, කළ යුතු දේ කොට නිම කළ, බර බහා තැබූ, තමන්ගේ පරමාර්ථය අවබෝධ කළ, භව සංයෝජන ප්‍රහීණ කළ, මනාකොට ප්‍රඥාවෙන් විමුක්ත වූ භික්ෂූන් වහන්සේලා සිටිත්ද, උන්වහන්සේලාට පංච නීවරණ උදුරා දමන ලද මුල් ඇති, තල් ගසක් සිඳ දමා නැවත නොවැඩෙන්නාක් මෙන් නැවත ඇති නොවන ස්වභාවයට පත් කර, අනාගතයේදී නැවත නූපදින ධර්ම බවට පත් වී ප්‍රහීණ වී ඇත. ඒ කවර පසක්ද? කාමච්ඡන්ද නීවරණය උදුරා දමන ලද මුල් ඇති, තල් ගසක් සිඳ දමා නැවත නොවැඩෙන්නාක් මෙන් නැවත ඇති නොවන ස්වභාවයට පත් කර, අනාගතයේදී නැවත නූපදින ධර්ම බවට පත් වී ප්‍රහීණ වී ඇත; ව්‍යාපාද නීවරණය උදුරා දමන ලද මුල් ඇති, තල් ගසක් සිඳ දමා නැවත නොවැඩෙන්නාක් මෙන් නැවත ඇති නොවන ස්වභාවයට පත් කර, අනාගතයේදී නැවත නූපදින ධර්ම බවට පත් වී ප්‍රහීණ වී ඇත; ථීනමිද්ධ නීවරණය උදුරා දමන ලද මුල් ඇති, තල් ගසක් සිඳ දමා නැවත නොවැඩෙන්නාක් මෙන් නැවත ඇති නොවන ස්වභාවයට පත් කර, අනාගතයේදී නැවත නූපදින ධර්ම බවට පත් වී ප්‍රහීණ වී ඇත; උද්ධච්චකුක්කුච්ච නීවරණය උදුරා දමන ලද මුල් ඇති, තල් ගසක් සිඳ දමා නැවත නොවැඩෙන්නාක් මෙන් නැවත ඇති නොවන ස්වභාවයට පත් කර, අනාගතයේදී නැවත නූපදින ධර්ම බවට පත් වී ප්‍රහීණ වී ඇත; විචිකිච්ඡා නීවරණය උදුරා දමන ලද මුල් ඇති, තල් ගසක් සිඳ දමා නැවත නොවැඩෙන්නාක් මෙන් නැවත ඇති නොවන ස්වභාවයට පත් කර, අනාගතයේදී නැවත නූපදින ධර්ම බවට පත් වී ප්‍රහීණ වී ඇත. ඇවැත් මහානාමයෙනි, යම් ඒ අරහත් වූ, ක්ෂීණාශ්‍රව වූ, බ්‍රහ්මචර්යාව සම්පූර්ණ කළ, කළ යුතු දේ කොට නිම කළ, බර බහා තැබූ, තමන්ගේ පරමාර්ථය අවබෝධ කළ, භව සංයෝජන ප්‍රහීණ කළ, මනාකොට ප්‍රඥාවෙන් විමුක්ත වූ භික්ෂූන් වහන්සේලා සිටිත්ද, උන්වහන්සේලාට මේ පංච නීවරණ උදුරා දමන ලද මුල් ඇති, තල් ගසක් සිඳ දමා නැවත නොවැඩෙන්නාක් මෙන් නැවත ඇති නොවන ස්වභාවයට පත් කර, අනාගතයේදී නැවත නූපදින ධර්ම බවට පත් වී ප්‍රහීණ වී ඇත. එහෙයින් ඇවැත් මහානාමයෙනි, මේ කරුණෙන්ද සේඛ විහරණය වෙනම එකක් බවත්, තථාගත විහරණය වෙනම එකක් බවත් දැනගත යුතුය.\n\n‘‘ඇවැත් මහානාමයෙනි, එක් සමයෙක භාග්‍යවතුන් වහන්සේ ඉච්ඡානංගල නම් ගමේ ඉච්ඡානංගල වනාන්තරයෙහි වැඩසිටියහ. එහිදී ඇවැත් මහානාමයෙනි, භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලා අමතා මෙසේ වදාළහ – ‘මහණෙනි, මම තුන් මාසයක් තනිවම භාවනා කිරීමට කැමැත්තෙමි. පිණ්ඩපාතය ගෙන එන එක් භික්ෂුවක් හැර වෙන කිසිවෙකු මට සමීප නොවිය යුතුය.’ ඇවැත් මහානාමයෙනි, ‘එසේය ස්වාමීනී’ යි කියා ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, පිණ්ඩපාතය ගෙන එන එක් භික්ෂුවක් හැර වෙන කිසිවෙකු භාග්‍යවතුන් වහන්සේට සමීප නොවූහ.\n\n‘‘ඉන්පසු ඇවැත්නි, භාග්‍යවතුන් වහන්සේ ඒ තුන් මාසය ඉක්ම ගිය පසු භාවනාවෙන් නැගිට භික්ෂූන් වහන්සේලා අමතා මෙසේ වදාළහ – ‘මහණෙනි, යම් හෙයකින් අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ඔබෙන් මෙසේ අසත්ද – ඇවැත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ බොහෝ විට වස් කාලය ගත කළේ කවර විහරණයකින්ද? එසේ අසන ලද මහණෙනි, ඔබ ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතුය – ඇවැත්නි, භාග්‍යවතුන් වහන්සේ බොහෝ විට වස් කාලය ගත කළේ ආනාපානසති සමාධියෙනි. මහණෙනි, මෙහිදී මම සිහි නුවණින් යුතුව හුස්ම ගනිමි, සිහි නුවණින් යුතුව හුස්ම හෙළමි. දීර්ඝ ලෙස හුස්ම ගනිමින් ‘මම දීර්ඝ ලෙස හුස්ම ගනිමි’ යි දැනගනිමි, දීර්ඝ ලෙස හුස්ම හෙළමින් ‘මම දීර්ඝ ලෙස හුස්ම හෙළමි’ යි දැනගනිමි, තවද මුදා හැරීම අනුපස්සනා කරමින් හුස්ම ගනිමි යි දැනගනිමි, මුදා හැරීම අනුපස්සනා කරමින් හුස්ම හෙළමි යි දැනගනිමි.’\n\n‘‘මහණෙනි, යමක් අර්ය විහරණය යැයිද, බ්‍රහ්ම විහරණය යැයිද, තථාගත විහරණය යැයිද මනාකොට කියන්නේ නම්, ආනාපානසති සමාධිය අර්ය විහරණය යැයිද, බ්‍රහ්ම විහරණය යැයිද, තථාගත විහරණය යැයිද මනාකොට කිව යුතුය.\n\n‘‘මහණෙනි, යම් ඒ සේඛ භික්ෂූන් වහන්සේලා, (තවම) අරහත්වය නොලැබූ සිත් ඇතිව, අනුත්තර වූ යෝගක්ෂේමය පතමින් වැඩවසන්නාහුද, උන්වහන්සේලාට ආනාපානසති සමාධිය වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද්දක් වී ආශ්‍රවයන් ක්ෂය කිරීමට හේතු වේ.\n\n‘‘මහණෙනි, යම් ඒ අරහත් වූ, ක්ෂීණාශ්‍රව වූ, බ්‍රහ්මචර්යාව සම්පූර්ණ කළ, කළ යුතු දේ කොට නිම කළ, බර බහා තැබූ, තමන්ගේ පරමාර්ථය අවබෝධ කළ, භව සංයෝජන ප්‍රහීණ කළ, මනාකොට ප්‍රඥාවෙන් විමුක්ත වූ භික්ෂූන් වහන්සේලා සිටිත්ද, උන්වහන්සේලාට ආනාපානසති සමාධිය වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද්දක් වී මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිසද, සිහි නුවණින් යුතුව විසීම පිණිසද පවතී.\n\n‘‘මහණෙනි, යමක් අර්ය විහරණය යැයිද, බ්‍රහ්ම විහරණය යැයිද, තථාගත විහරණය යැයිද මනාකොට කියන්නේ නම්, ආනාපානසති සමාධිය අර්ය විහරණය යැයිද, බ්‍රහ්ම විහරණය යැයිද, තථාගත විහරණය යැයිද මනාකොට කිව යුතුය. එහෙයින් ඇවැත් මහානාමයෙනි, මේ කරුණෙන්ද සේඛ විහරණය වෙනම එකක් බවත්, තථාගත විහරණය වෙනම එකක් බවත් දැනගත යුතුය.",
      "paliTitle": "Kaṅkheyyasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 989,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘atthi nu kho, bhante, ekadhammo [eko dhammo (sī.)] bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti? ‘‘Atthi kho, ānanda, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti. ‘‘Katamo pana, bhante, ekadhammo [eko dhammo (sī.)] bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti? ‘‘Ānāpānassatisamādhi kho, ānanda, ekadhammo bhāvito bahulīkato cattāro satipaṭṭhāne paripūreti, cattāro satipaṭṭhānā bhāvitā bahulīkatā satta bojjhaṅge paripūrenti, satta bojjhaṅgā bhāvitā bahulīkatā vijjāvimuttiṃ paripūrenti’’. ‘‘Kathaṃ bhāvito, ānanda, ānāpānassatisamādhi kathaṃ bahulīkato cattāro satipaṭṭhāne paripūreti? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati. Dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti, dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati’’. ‘‘Yasmiṃ samaye, ānanda, bhikkhu dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti, dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti; rassaṃ vā…pe… ‘passambhayaṃ kāyasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ kāyasaṅkhāraṃ passasissāmī’ti sikkhati – kāye kāyānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Kāyaññatarāhaṃ, ānanda, etaṃ vadāmi, yadidaṃ – assāsapassāsaṃ. Tasmātihānanda, kāye kāyānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ’’. ‘‘Yasmiṃ samaye, ānanda, bhikkhu ‘pītippaṭisaṃvedī assasissāmī’ti sikkhati …pe… sukhappaṭisaṃvedī…pe… cittasaṅkhārappaṭisaṃvedī…pe… ‘passambhayaṃ cittasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ cittasaṅkhāraṃ passasissāmī’ti sikkhati – vedanāsu vedanānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Vedanāññatarāhaṃ, ānanda, etaṃ vadāmi, yadidaṃ – assāsapassāsānaṃ sādhukaṃ manasikāraṃ. Tasmātihānanda, vedanāsu vedanānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, ānanda, bhikkhu ‘cittappaṭisaṃvedī assasissāmī’ti sikkhati, ‘cittappaṭisaṃvedī passasissāmī’ti sikkhati; abhippamodayaṃ cittaṃ…pe… samādahaṃ cittaṃ…pe… ‘vimocayaṃ cittaṃ assasissāmī’ti sikkhati, ‘vimocayaṃ cittaṃ passasissāmī’ti sikkhati – citte cittānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Nāhaṃ, ānanda, muṭṭhassatissa asampajānassa ānāpānassatisamādhibhāvanaṃ vadāmi. Tasmātihānanda, citte cittānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, ānanda, bhikkhu aniccānupassī…pe… virāgānupassī…pe… nirodhānupassī… pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati – dhammesu dhammānupassī, ānanda, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. So yaṃ taṃ hoti abhijjhādomanassānaṃ pahānaṃ taṃ paññāya disvā sādhukaṃ ajjhupekkhitā hoti. Tasmātihānanda, dhammesu dhammānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Evaṃ bhāvito kho, ānanda, ānāpānassatisamādhi evaṃ bahulīkato cattāro satipaṭṭhāne paripūreti. ‘‘Kathaṃ bhāvitā cānanda, cattāro satipaṭṭhānā kathaṃ bahulīkatā satta bojjhaṅge paripūrenti? Yasmiṃ samaye, ānanda, bhikkhu kāye kāyānupassī viharati – upaṭṭhitāssa [upaṭṭhitassati (pī. ka.)] tasmiṃ samaye bhikkhuno [tasmiṃ samaye ānanda bhikkhuno (pī. ka.), tasmiṃ samaye (ma. ni. 3.149)] sati hoti asammuṭṭhā. Yasmiṃ samaye, ānanda, bhikkhuno upaṭṭhitā sati hoti asammuṭṭhā – satisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, satisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, satisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘So tathā sato viharanto taṃ dhammaṃ paññāya pavicinati pavicarati parivīmaṃsamāpajjati. Yasmiṃ samaye, ānanda, bhikkhu tathā sato viharanto taṃ dhammaṃ paññāya pavicinati pavicarati parivīmaṃsamāpajjati – dhammavicayasambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, dhammavicayasambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, dhammavicayasambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Tassa taṃ dhammaṃ paññāya pavicinato pavicarato parivīmaṃsamāpajjato āraddhaṃ hoti vīriyaṃ asallīnaṃ. Yasmiṃ samaye, ānanda, bhikkhuno taṃ dhammaṃ paññāya pavicinato pavicarato parivīmaṃsamāpajjato āraddhaṃ hoti vīriyaṃ asallīnaṃ – vīriyasambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, vīriyasambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, vīriyasambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Āraddhavīriyassa uppajjati pīti nirāmisā. Yasmiṃ samaye, ānanda, bhikkhuno āraddhavīriyassa uppajjati pīti nirāmisā – pītisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, pītisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, pītisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Pītimanassa kāyopi passambhati, cittampi passambhati. Yasmiṃ samaye, ānanda, bhikkhuno pītimanassa kāyopi passambhati, cittampi passambhati – passaddhisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, passaddhisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, passaddhisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Passaddhakāyassa sukhino cittaṃ samādhiyati. Yasmiṃ samaye, ānanda, bhikkhuno passaddhakāyassa sukhino cittaṃ samādhiyati – samādhisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, samādhisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, samādhisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘So tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti. Yasmiṃ samaye, ānanda, bhikkhu tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Yasmiṃ samaye, ānanda, bhikkhu vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati – upaṭṭhitāssa tasmiṃ samaye bhikkhuno sati hoti asammuṭṭhā. Yasmiṃ samaye, ānanda, bhikkhuno upaṭṭhitā sati hoti asammuṭṭhā – satisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, satisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, satisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. (Yathā paṭhamaṃ satipaṭṭhānaṃ, evaṃ vitthāretabbaṃ). ‘‘So tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti. Yasmiṃ samaye, ānanda, bhikkhu tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. Evaṃ bhāvitā kho, ānanda, cattāro satipaṭṭhānā evaṃ bahulīkatā satta bojjhaṅge paripūrenti. ‘‘Kathaṃ bhāvitā, ānanda, satta bojjhaṅgā kathaṃ bahulīkatā vijjāvimuttiṃ paripūrenti? Idhānanda, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, dhammavicayasambojjhaṅgaṃ bhāveti …pe… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ bhāvitā kho, ānanda, satta bojjhaṅgā evaṃ bahulīkatā vijjāvimuttiṃ paripūrentī’’ti. Tatiyaṃ.",
      "english": "Then, the Venerable Ananda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the Venerable Ananda said to the Blessed One: \"Is there, Venerable Sir, one quality, when developed and repeatedly practiced, that perfects four qualities? Do these four qualities, when developed and repeatedly practiced, perfect seven qualities? And do these seven qualities, when developed and repeatedly practiced, perfect two qualities?\"\n\n\"There is, Ananda, one quality, when developed and repeatedly practiced, that perfects four qualities. These four qualities, when developed and repeatedly practiced, perfect seven qualities. And these seven qualities, when developed and repeatedly practiced, perfect two qualities.\"\n\n\"But what, Venerable Sir, is that one quality, which, when developed and repeatedly practiced, perfects four qualities? And which are those four qualities that, when developed and repeatedly practiced, perfect seven qualities? And which are those seven qualities that, when developed and repeatedly practiced, perfect two qualities?\"\n\n\"It is, Ananda, the concentration through mindfulness of breathing, when developed and repeatedly practiced, that perfects the four foundations of mindfulness. These four foundations of mindfulness, when developed and repeatedly practiced, perfect the seven factors of awakening. And these seven factors of awakening, when developed and repeatedly practiced, perfect knowledge and liberation.\"\n\n\"And how, Ananda, is concentration through mindfulness of breathing developed and repeatedly practiced so as to perfect the four foundations of mindfulness? Here, Ananda, a monastic, having gone to the forest, or to the root of a tree, or to an empty dwelling, sits down, having folded his legs crosswise, set his body erect, and established mindfulness in front of him. Mindfully he breathes in, mindfully he breathes out. Breathing in a long breath, he discerns, 'I am breathing in a long breath.' Breathing out a long breath, he discerns, 'I am breathing out a long breath.' He then continues his training through the full sequence of mindfulness of breathing, until he trains himself: 'I will breathe in contemplating relinquishment.' He trains himself: 'I will breathe out contemplating relinquishment.'\"\n\n\"Ananda, when a monastic, breathing in a long breath, discerns, 'I am breathing in a long breath,' or breathing out a long breath, discerns, 'I am breathing out a long breath;' or breathing in a short breath, discerns, 'I am breathing in a short breath,' or breathing out a short breath, discerns, 'I am breathing out a short breath;' or trains himself, 'I will breathe in experiencing the entire body,' or trains himself, 'I will breathe out experiencing the entire body;' or trains himself, 'I will breathe in tranquilizing the bodily formation,' or trains himself, 'I will breathe out tranquilizing the bodily formation' — at that time, Ananda, the monastic abides contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. Why is that? Because, Ananda, I declare that this is a certain kind of body, namely, the in-breaths and out-breaths. Therefore, Ananda, at that time the monastic abides contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\n\"Ananda, when a monastic trains himself, 'I will breathe in experiencing rapture,' or trains himself, 'I will breathe out experiencing rapture;' or trains himself, 'I will breathe in experiencing pleasure,' or trains himself, 'I will breathe out experiencing pleasure;' or trains himself, 'I will breathe in experiencing mental formations,' or trains himself, 'I will breathe out experiencing mental formations;' or trains himself, 'I will breathe in tranquilizing mental formations,' or trains himself, 'I will breathe out tranquilizing mental formations' — at that time, Ananda, the monastic abides contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. Why is that? Because, Ananda, I declare that this is a certain kind of feeling, namely, the careful attention to in-breaths and out-breaths. Therefore, Ananda, at that time the monastic abides contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\n\"Ananda, when a monastic trains himself, 'I will breathe in experiencing the mind,' or trains himself, 'I will breathe out experiencing the mind;' or trains himself, 'I will breathe in gladdening the mind,' or trains himself, 'I will breathe out gladdening the mind;' or trains himself, 'I will breathe in concentrating the mind,' or trains himself, 'I will breathe out concentrating the mind;' or trains himself, 'I will breathe in liberating the mind,' or trains himself, 'I will breathe out liberating the mind' — at that time, Ananda, the monastic abides contemplating mind in mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. Why is that? Because, Ananda, I do not declare the development of concentration through mindfulness of breathing for one who is unmindful and not clearly comprehending. Therefore, Ananda, at that time the monastic abides contemplating mind in mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\n\"Ananda, when a monastic trains himself, 'I will breathe in contemplating impermanence,' or trains himself, 'I will breathe out contemplating impermanence;' or trains himself, 'I will breathe in contemplating dispassion,' or trains himself, 'I will breathe out contemplating dispassion;' or trains himself, 'I will breathe in contemplating cessation,' or trains himself, 'I will breathe out contemplating cessation;' or trains himself, 'I will breathe in contemplating relinquishment,' or trains himself, 'I will breathe out contemplating relinquishment' — at that time, Ananda, the monastic abides contemplating mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. And having seen with wisdom the relinquishment of covetousness and displeasure, he keenly looks on with equanimity. Therefore, Ananda, at that time the monastic abides contemplating mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\"\n\nIt is in this way, Ananda, that concentration through mindfulness of breathing, when developed and repeatedly practiced, perfects the four foundations of mindfulness.\n\n“How, Ananda, are the four establishments of mindfulness developed and frequently practiced so as to perfect the seven factors of awakening?\n\nAnanda, when a monk dwells observing the body in the body, at that time his mindfulness is established, it is unconfused. Ananda, when a monk’s mindfulness is established and unconfused at that time, the awakening factor of mindfulness is aroused in him; at that time the monk develops the awakening factor of mindfulness; at that time the awakening factor of mindfulness comes to full development in him.\n\nDwelling thus mindfully, he investigates, examines, and explores that phenomenon with wisdom. Ananda, when a monk, dwelling thus mindfully, investigates, examines, and explores that phenomenon with wisdom, at that time the awakening factor of discrimination of phenomena is aroused in him; at that time the monk develops the awakening factor of discrimination of phenomena; at that time the awakening factor of discrimination of phenomena comes to full development in him.\n\nAs he investigates, examines, and explores that phenomenon with wisdom, his energy is aroused and unflagging. Ananda, when a monk’s energy is aroused and unflagging as he investigates, examines, and explores that phenomenon with wisdom, at that time the awakening factor of energy is aroused in him; at that time the monk develops the awakening factor of energy; at that time the awakening factor of energy comes to full development in him.\n\nFor one whose energy is aroused, unworldly joy arises. Ananda, when unworldly joy arises for a monk whose energy is aroused, at that time the awakening factor of joy is aroused in him; at that time the monk develops the awakening factor of joy; at that time the awakening factor of joy comes to full development in him.\n\nFor one whose mind is filled with joy, both the body calms down and the mind calms down. Ananda, when for a monk whose mind is filled with joy, both the body calms down and the mind calms down, at that time the awakening factor of tranquility is aroused in him; at that time the monk develops the awakening factor of tranquility; at that time the awakening factor of tranquility comes to full development in him.\n\nFor one whose body is tranquil and who is experiencing happiness, the mind becomes concentrated. Ananda, when for a monk whose body is tranquil and who is experiencing happiness, the mind becomes concentrated, at that time the awakening factor of concentration is aroused in him; at that time the monk develops the awakening factor of concentration; at that time the awakening factor of concentration comes to full development in him.\n\nWith such a concentrated mind, he then truly looks on with equanimity. Ananda, when a monk with such a concentrated mind truly looks on with equanimity, at that time the awakening factor of equanimity is aroused in him; at that time the monk develops the awakening factor of equanimity; at that time the awakening factor of equanimity comes to full development in him.\n\nAnanda, when a monk dwells observing feelings in feelings, mind in mind, or phenomena in phenomena, at that time his mindfulness is established, it is unconfused. Ananda, when a monk’s mindfulness is established and unconfused at that time, the awakening factor of mindfulness is aroused in him; at that time the monk develops the awakening factor of mindfulness; at that time the awakening factor of mindfulness comes to full development in him.\n\nWith such a concentrated mind, he then truly looks on with equanimity. Ananda, when a monk with such a concentrated mind truly looks on with equanimity, at that time the awakening factor of equanimity is aroused in him; at that time the monk develops the awakening factor of equanimity; at that time the awakening factor of equanimity comes to full development in him. It is in this way, Ananda, that the four establishments of mindfulness, developed and frequently practiced, perfect the seven factors of awakening.\n\nHow, Ananda, are the seven factors of awakening developed and frequently practiced so as to perfect true knowledge and liberation? Here, Ananda, a monk develops the awakening factor of mindfulness, relying on seclusion, relying on dispassion, relying on cessation, culminating in relinquishment. He develops the awakening factor of discrimination of phenomena… he develops the awakening factor of equanimity, relying on seclusion, relying on dispassion, relying on cessation, culminating in relinquishment. It is in this way, Ananda, that the seven factors of awakening, developed and frequently practiced, perfect true knowledge and liberation.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඑසමයෙහි ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ භාග්‍ය‌වතුන් වහන්සේ වෙත එළඹුණි; එළඹ, භාග්‍ය‌වතුන් වහන්සේට වන්දනා කර එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ භාග්‍ය‌වතුන් වහන්සේට මෙසේ පැවසූහ: \"ස්වාමීනී, එක් ධර්මයක් ඇතැයි කිව හැකිද, එය වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම සතරක් සම්පූර්ණ කරන්නේද? ධර්ම සතරක් වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම සතක් සම්පූර්ණ කරන්නේද? ධර්ම සතක් වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම දෙකක් සම්පූර්ණ කරන්නේද?\" \"ආනන්දයෙනි, එක් ධර්මයක් ඇත, එය වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම සතරක් සම්පූර්ණ කරයි; ධර්ම සතරක් වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම සතක් සම්පූර්ණ කරයි; ධර්ම සතක් වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම දෙකක් සම්පූර්ණ කරයි.\" \"ස්වාමීනී, එම එක් ධර්මය කුමක්ද, එය වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම සතරක් සම්පූර්ණ කරන්නේද? ධර්ම සතරක් වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම සතක් සම්පූර්ණ කරන්නේද? ධර්ම සතක් වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, ධර්ම දෙකක් සම්පූර්ණ කරන්නේද?\" \"ආනන්දයෙනි, ආනාපානසති සමාධිය නම් වූ එක් ධර්මය වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, සතර සතිපට්ඨාන සම්පූර්ණ කරයි; සතර සතිපට්ඨාන වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, සප්ත බෝධ්‍යංග සම්පූර්ණ කරයි; සප්ත බෝධ්‍යංග වඩන ලද විට, බහුල වශයෙන් පුරුදු කරන ලද විට, විද්‍යාව හා විමුක්තිය සම්පූර්ණ කරයි.\"\n\n\"ආනන්දයෙනි, ආනාපානසති සමාධිය කෙසේ වඩන ලද විට, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද විට, සතර සතිපට්ඨාන සම්පූර්ණ කරන්නේද? ආනන්දයෙනි, මෙහිලා භික්ෂුවක් අරණ්‍ය‌ගතව හෝ, වෘක්ෂමූලයකට ගොස් හෝ, හිස් ගෙයකට ගොස් හෝ, පලක් බැඳ, කය ඍජුව තබාගෙන, මුවදොරෙහි සිහිය පිහිටුවාගෙන හිඳියි. හෙතෙම සිහියෙන් යුතුව ආශ්වාස කරයි, සිහියෙන් යුතුව ප්‍ර‌ශ්වාස කරයි. දීර්ඝ ලෙස ආශ්වාස කරමින් ‘මම දීර්ඝ ලෙස ආශ්වාස කරමි’ යි දැන ගනී, දීර්ඝ ලෙස ප්‍ර‌ශ්වාස කරමින් ‘මම දීර්ඝ ලෙස ප්‍ර‌ශ්වාස කරමි’ යි දැන ගනී. කෙටි ලෙස ආශ්වාස කරමින් ‘මම කෙටි ලෙස ආශ්වාස කරමි’ යි දැන ගනී, කෙටි ලෙස ප්‍ර‌ශ්වාස කරමින් ‘මම කෙටි ලෙස ප්‍ර‌ශ්වාස කරමි’ යි දැන ගනී. ‘සියලු කයම අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘සියලු කයම අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘කාය සංඛාරයන් සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘කාය සංඛාරයන් සන්සිඳුවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘ප්‍රීතිය අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘ප්‍රීතිය අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සැපය අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘සැපය අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘චිත්ත සංඛාරයන් අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘චිත්ත සංඛාරයන් අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘චිත්ත සංඛාරයන් සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘චිත්ත සංඛාරයන් සන්සිඳුවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘සිත අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත ප්‍ර‌මුදිත කරවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘සිත ප්‍ර‌මුදිත කරවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත සමාධිගත කරවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘සිත සමාධිගත කරවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත මුදාලමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘සිත මුදාලමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘අනිත්‍යය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘අනිත්‍යය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘විරාගය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘විරාගය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘නිරෝධය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘නිරෝධය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘ප්‍ර‌තිනිස්සර්ගය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි, ‘ප්‍ර‌තිනිස්සර්ගය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයි.\n\nආනන්දයෙනි, යම් සමයෙක භික්ෂුව දීර්ඝ ලෙස ආශ්වාස කරමින් ‘මම දීර්ඝ ලෙස ආශ්වාස කරමි’ යි දැන ගනීද, දීර්ඝ ලෙස ප්‍ර‌ශ්වාස කරමින් ‘මම දීර්ඝ ලෙස ප්‍ර‌ශ්වාස කරමි’ යි දැන ගනීද; කෙටි ලෙස ආශ්වාස කරමින් ‘මම කෙටි ලෙස ආශ්වාස කරමි’ යි දැන ගනීද, කෙටි ලෙස ප්‍ර‌ශ්වාස කරමින් ‘මම කෙටි ලෙස ප්‍ර‌ශ්වාස කරමි’ යි දැන ගනීද; ‘සියලු කයම අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘සියලු කයම අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘කාය සංඛාරයන් සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘කාය සංඛාරයන් සන්සිඳුවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද – ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට කයෙහි කය අනුපස්සනා කරමින් වාසය කරයි. එයට හේතුව කුමක්ද? ආනන්දයෙනි, මම ආශ්වාස ප්‍ර‌ශ්වාසය කයට අයත් එකක් ලෙස පවසමි. එබැවින් ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට කයෙහි කය අනුපස්සනා කරමින් වාසය කරයි.\n\nආනන්දයෙනි, යම් සමයෙක භික්ෂුව ‘ප්‍රීතිය අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘ප්‍රීතිය අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘සැපය අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘සැපය අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘චිත්ත සංඛාරයන් අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘චිත්ත සංඛාරයන් අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘චිත්ත සංඛාරයන් සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘චිත්ත සංඛාරයන් සන්සිඳුවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද – ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට වේදනාවන්හි වේදනා අනුපස්සනා කරමින් වාසය කරයි. එයට හේතුව කුමක්ද? ආනන්දයෙනි, මම ආශ්වාස ප්‍ර‌ශ්වාසයන් මැනවින් මෙනෙහි කිරීම වේදනා අතරට අයත් එකක් ලෙස පවසමි. එබැවින් ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට වේදනාවන්හි වේදනා අනුපස්සනා කරමින් වාසය කරයි.\n\nආනන්දයෙනි, යම් සමයෙක භික්ෂුව ‘සිත අත්දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘සිත අත්දකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘සිත ප්‍ර‌මුදිත කරවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘සිත ප්‍ර‌මුදිත කරවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘සිත සමාධිගත කරවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘සිත සමාධිගත කරවමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘සිත මුදාලමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘සිත මුදාලමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද – ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරයි. එයට හේතුව කුමක්ද? ආනන්දයෙනි, සිහි නැති, මනා නුවණක් නැති කෙනෙකුට ආනාපානසති සමාධිය වැඩීමක් ඇතැයි මම නොපවසමි. එබැවින් ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරයි.\n\nආනන්දයෙනි, යම් සමයෙක භික්ෂුව ‘අනිත්‍යය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘අනිත්‍යය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘විරාගය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘විරාගය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘නිරෝධය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘නිරෝධය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද; ‘ප්‍ර‌තිනිස්සර්ගය අනුදකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයිද, ‘ප්‍ර‌තිනිස්සර්ගය අනුදකිමින් ප්‍ර‌ශ්වාස කරන්නෙමි’ යි හික්මෙයිද – ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට ධර්මයන්හි ධර්ම අනුපස්සනා කරමින් වාසය කරයි. හෙතෙම යම් අධිජ්ඣා සහ දෝමනස්සයන් ප්‍ර‌හාණය කිරීමක් වේද, එය ප්‍ර‌ඥාවෙන් දැක මැනවින් උපේක්ෂාවෙන් යුක්තව සිටියි. එබැවින් ආනන්දයෙනි, ඒ සමයෙහි භික්ෂුව කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා නුවණින් යුතුව, සිහියෙන් යුතුව, ලෝකය පිළිබඳ අධිජ්ඣා සහ දෝමනස්ස දුරුකොට ධර්මයන්හි ධර්ම අනුපස්සනා කරමින් වාසය කරයි.\n\nආනන්දයෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද ආනාපානසති සමාධිය සතර සතිපට්ඨාන සම්පූර්ණ කරයි.\n\nආනන්දයෙනි, සතර සතිපට්ඨාන ධර්මයන් වඩන ලද්දේ කෙසේද, බහුල වශයෙන් පුරුදු කරන ලද්දේ කෙසේද සප්ත බොජ්ඣංගයන් පිරුණූ බවට පත්වන්නේ? ආනන්දයෙනි, යම් සමයෙක භික්ෂුව කයෙහි කය අනුව බලමින් වාසය කරන්නේද, ඒ සමයෙහි ඔහුට අමුළු නොවූ සිහිය පිහිටා පවතී. ආනන්දයෙනි, යම් සමයෙක භික්ෂුවට අමුළු නොවූ සිහිය පිහිටා පවතීද, ඒ සමයෙහි ඔහුට සතිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව සතිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ සතිසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nඔහු එසේ සිහියෙන් යුක්තව වාසය කරමින් ඒ ධර්මය ප්‍රඥාවෙන් විමසයි, පිරික්සයි, හොඳින් පරීක්ෂා කරයි. ආනන්දයෙනි, යම් සමයෙක භික්ෂුව එසේ සිහියෙන් යුක්තව වාසය කරමින් ඒ ධර්මය ප්‍රඥාවෙන් විමසයිද, පිරික්සයිද, හොඳින් පරීක්ෂා කරයිද, ඒ සමයෙහි ඔහුට ධම්මවිචයසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව ධම්මවිචයසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ ධම්මවිචයසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nඒ ධර්මය ප්‍රඥාවෙන් විමසන, පිරික්සන, හොඳින් පරීක්ෂා කරන ඔහුට නොලැගුණු වීර්යය ආරම්භ වී පවතී. ආනන්දයෙනි, යම් සමයෙක භික්ෂුවට ඒ ධර්මය ප්‍රඥාවෙන් විමසන, පිරික්සන, හොඳින් පරීක්ෂා කරන විට නොලැගුණු වීර්යය ආරම්භ වී පවතීද, ඒ සමයෙහි ඔහුට වීර්යසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව වීර්යසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ වීර්යසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nවීර්යය ආරම්භ කළ ඔහුට නිරාමිස වූ ප්‍රීතිය උපදී. ආනන්දයෙනි, යම් සමයෙක භික්ෂුවට ආරම්භ කළ වීර්යය ඇති කල්හි නිරාමිස වූ ප්‍රීතිය උපදීද, ඒ සමයෙහි ඔහුට ප්‍රීතිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව ප්‍රීතිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ ප්‍රීතිසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nප්‍රීතිමත් වූ සිතක් ඇති ඔහුට කයද සංසිඳේ, සිතද සංසිඳේ. ආනන්දයෙනි, යම් සමයෙක භික්ෂුවට ප්‍රීතිමත් වූ සිතක් ඇති කල්හි කයද සංසිඳේද, සිතද සංසිඳේද, ඒ සමයෙහි ඔහුට පස්සද්ධිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව පස්සද්ධිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ පස්සද්ධිසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nසංසිඳුනු කය ඇති, සැපවත් වූ ඔහුට සිත සමාධිමත් වේ. ආනන්දයෙනි, යම් සමයෙක භික්ෂුවට සංසිඳුනු කය ඇති, සැපවත් වූ කල්හි සිත සමාධිමත් වේද, ඒ සමයෙහි ඔහුට සමාධිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව සමාධිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ සමාධිසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nඔහු එලෙසින් සමාධිගත වූ සිත හොඳින් උපේක්ෂාවෙන් යුතුව විමසයි. ආනන්දයෙනි, යම් සමයෙක භික්ෂුව එලෙසින් සමාධිගත වූ සිත හොඳින් උපේක්ෂාවෙන් යුතුව විමසයිද, ඒ සමයෙහි ඔහුට උපේක්ඛාසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව උපේක්ඛාසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ උපේක්ඛාසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nආනන්දයෙනි, යම් සමයෙක භික්ෂුව වේදනා කෙරෙහි වේදනානුපස්සීව වාසය කරන්නේද, එලෙසම සිත කෙරෙහි චිත්තානුපස්සීවද, ධර්මයන් කෙරෙහි ධම්මානුපස්සීවද වාසය කරන්නේද, ඒ සමයෙහි ඔහුට අමුළු නොවූ සිහිය පිහිටා පවතී. ආනන්දයෙනි, යම් සමයෙක භික්ෂුවට අමුළු නොවූ සිහිය පිහිටා පවතීද, ඒ සමයෙහි ඔහුට සතිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව සතිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ සතිසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි.\n\nඔහු එලෙසින් සමාධිගත වූ සිත හොඳින් උපේක්ෂාවෙන් යුතුව විමසයි. ආනන්දයෙනි, යම් සමයෙක භික්ෂුව එලෙසින් සමාධිගත වූ සිත හොඳින් උපේක්ෂාවෙන් යුතුව විමසයිද, ඒ සමයෙහි ඔහුට උපේක්ඛාසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව උපේක්ඛාසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවගේ උපේක්ඛාසම්බොජ්ඣංගය භාවනා පාරිපූරියට යයි. ආනන්දයෙනි, සතර සතිපට්ඨාන ධර්මයන් මෙලෙස වඩන ලද්දේ, මෙලෙස බහුල වශයෙන් පුරුදු කරන ලද්දේ සප්ත බොජ්ඣංගයන් පිරුණූ බවට පත්වෙති.\n\nආනන්දයෙනි, සප්ත බොජ්ඣංගයන් වඩන ලද්දේ කෙසේද, බහුල වශයෙන් පුරුදු කරන ලද්දේ කෙසේද විද්‍යා විමුක්තිය සම්පූර්ණ කරන්නේ?\n\nආනන්දයෙනි, මෙහිලා භික්ෂුව විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති සතිසම්බොජ්ඣංගය වඩයි. ධම්මවිචයසම්බොජ්ඣංගයද වඩයි, එලෙසම උපේක්ඛාසම්බොජ්ඣංගයද විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගය කෙළවර කොට ඇති ලෙස වඩයි. ආනන්දයෙනි, සප්ත බොජ්ඣංගයන් මෙලෙස වඩන ලද්දේ, මෙලෙස බහුල වශයෙන් පුරුදු කරන ලද්දේ විද්‍යා විමුක්තිය සම්පූර්ණ කරන්නේය.",
      "paliTitle": "Paṭhamaānandasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 990,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘atthi nu kho, ānanda, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā, satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti. Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘atthānanda, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrenti. ‘‘Katamo cānanda, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrenti? Ānāpānassatisamādhi, ānanda, ekadhammo bhāvito bahulīkato cattāro satipaṭṭhāne paripūreti, cattāro satipaṭṭhānā bhāvitā bahulīkatā satta bojjhaṅge paripūrenti, satta bojjhaṅgā bhāvitā bahulīkatā vijjāvimuttiṃ paripūrentī’’ti. ‘‘Kathaṃ bhāvito cānanda, ānāpānassatisamādhi, kathaṃ bahulīkato cattāro satipaṭṭhāne paripūreti? Idhānanda, bhikkhu araññagato vā…pe… evaṃ bhāvitā kho, ānanda, satta bojjhaṅgā evaṃ bahulīkatā vijjāvimuttiṃ paripūrentī’’ti. Catutthaṃ.",
      "english": "Then the venerable Ānanda approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side.\n\nTo the venerable Ānanda, as he was sitting to one side, the Blessed One said this: \"Is there, Ānanda, a single quality, when developed and repeatedly practiced, that brings to perfection four qualities? And when these four qualities are developed and repeatedly practiced, do they bring to perfection seven qualities? And when these seven qualities are developed and repeatedly practiced, do they bring to perfection two qualities?\"\n\n\"Venerable sir, the Dhamma has the Blessed One as its root, the Blessed One as its guide, the Blessed One as its refuge. It would be excellent, venerable sir, if the Blessed One himself would explain the meaning of this statement. Hearing it from the Blessed One, the monks will bear it in mind.\"\n\n\"There is, Ānanda, a single quality, when developed and repeatedly practiced, that brings to perfection four qualities. When these four qualities are developed and repeatedly practiced, they bring to perfection seven qualities. When these seven qualities are developed and repeatedly practiced, they bring to perfection two qualities.\"\n\n\"And what, Ānanda, is that single quality, when developed and repeatedly practiced, that brings to perfection four qualities? And when these four qualities are developed and repeatedly practiced, they bring to perfection seven qualities? And when these seven qualities are developed and repeatedly practiced, they bring to perfection two qualities?\"\n\n\"It is, Ānanda, the concentration through mindfulness of breathing, that single quality, when developed and repeatedly practiced, brings to perfection the four foundations of mindfulness. When the four foundations of mindfulness are developed and repeatedly practiced, they bring to perfection the seven factors of awakening. When the seven factors of awakening are developed and repeatedly practiced, they bring to perfection true knowledge and liberation.\"\n\n\"And how, Ānanda, is the concentration through mindfulness of breathing developed and repeatedly practiced so as to bring to perfection the four foundations of mindfulness? Here, Ānanda, a monk gone to the forest... Thus developed and repeatedly practiced, Ānanda, the seven factors of awakening bring to perfection true knowledge and liberation.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙකින් වැඩ සිටියහ. එකත්පසෙකින් වැඩ සිටි ආයුෂ්මත් ආනන්ද තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්දයෙනි, එක ධර්මයක් වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ සතර ධර්මයන් සම්පූර්ණ කරයිද? සතර ධර්මයන් වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි සත් ධර්මයන් සම්පූර්ණ කරයිද? සත් ධර්මයන් වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි ධර්ම දෙකක් සම්පූර්ණ කරයිද?”\n\n“ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තා වූ, භාග්‍යවතුන් වහන්සේ මග පෙන්වා ඇත්තා වූ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තා වූ ධර්මයෝ වෙති. ස්වාමීනි, භාග්‍යවතුන් වහන්සේම මෙය පැහැදිලි කරන්නේ නම් ඉතා යහපත්ය.” “ආනන්දයෙනි, එක ධර්මයක් වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ සතර ධර්මයන් සම්පූර්ණ කරයි. සතර ධර්මයන් වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි සත් ධර්මයන් සම්පූර්ණ කරයි. සත් ධර්මයන් වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි ධර්ම දෙකක් සම්පූර්ණ කරයි.\n\n“ආනන්දයෙනි, කවර ධර්මයක්ද වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ සතර ධර්මයන් සම්පූර්ණ කරන්නේ? කවර සතර ධර්මයක්ද වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි සත් ධර්මයන් සම්පූර්ණ කරන්නේ? කවර සත් ධර්මයක්ද වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි ධර්ම දෙකක් සම්පූර්ණ කරන්නේ? ආනන්දයෙනි, ආනාපානසති සමාධිය නම් වූ එක ධර්මය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ සතර සතිපට්ඨානයන් සම්පූර්ණ කරයි. සතර සතිපට්ඨානයන් වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි සත් බෝධ්‍යංගයන් සම්පූර්ණ කරයි. සත් බෝධ්‍යංගයන් වඩන ලද්දා වූ, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල්හි විද්‍යාව සහ විමුක්තිය සම්පූර්ණ කරයි.”\n\n“ආනන්දයෙනි, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ සතර සතිපට්ඨානයන් සම්පූර්ණ කරන්නේද?” “ආනන්දයෙනි, මෙහි භික්ෂුවක් අරණ්‍යයකට ගොස් ආනාපානසති භාවනාව වඩමින්, එමගින් සතර සතිපට්ඨානයන් ප්‍රගුණ කරමින්, සත් බෝධ්‍යංගයන් පිරී ඉතිරී යන සේ සම්පූර්ණ කරන්නේය. ආනන්දයෙනි, මෙසේ වඩන ලද්දා වූ, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දා වූ සත් බෝධ්‍යංගයෝ විද්‍යාව සහ විමුක්තිය සම්පූර්ණ කරන්නේය.”",
      "paliTitle": "Dutiyaānandasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 991,
      "pali": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘atthi nu kho, bhante, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti? ‘‘Atthi kho, bhikkhave, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti. ‘‘Katamo pana, bhante, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti? ‘‘Ānāpānassatisamādhi kho, bhikkhave, ekadhammo bhāvito bahulīkato cattāro satipaṭṭhāne paripūreti, cattāro satipaṭṭhānā bhāvitā bahulīkatā satta bojjhaṅge paripūrenti, satta bojjhaṅgā bhāvitā bahulīkatā vijjāvimuttiṃ paripūrentī’’ti. ‘‘Kathaṃ bhāvito ca, bhikkhave, ānāpānassatisamādhi kathaṃ bahulīkato cattāro satipaṭṭhāne paripūreti? Idha, bhikkhave, bhikkhu araññagato vā…pe… evaṃ bhāvitā kho, bhikkhave, satta bojjhaṅgā evaṃ bahulīkatā vijjāvimuttiṃ paripūrentī’’ti. Pañcamaṃ.",
      "english": "Then many monks approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side.\n\nSeated to one side, those monks then said to the Blessed One: “Is there, Venerable Sir, one quality which, when developed and frequently practiced, fulfills four qualities? And do those four qualities, when developed and frequently practiced, fulfill seven qualities? And do those seven qualities, when developed and frequently practiced, fulfill two qualities?”\n\n“There is, monks, one quality which, when developed and frequently practiced, fulfills four qualities; and those four qualities, when developed and frequently practiced, fulfill seven qualities; and those seven qualities, when developed and frequently practiced, fulfill two qualities.”\n\n“Which, then, Venerable Sir, is that one quality which, when developed and frequently practiced, fulfills four qualities? And which are those four qualities which, when developed and frequently practiced, fulfill seven qualities? And which are those seven qualities which, when developed and frequently practiced, fulfill two qualities?”\n\n“The concentration based on mindfulness of breathing, monks, is that one quality which, when developed and frequently practiced, fulfills the four establishments of mindfulness. And the four establishments of mindfulness, when developed and frequently practiced, fulfill the seven factors of awakening. And the seven factors of awakening, when developed and frequently practiced, fulfill true knowledge and liberation.”\n\n“How, monks, is the concentration based on mindfulness of breathing developed and frequently practiced so as to fulfill the four establishments of mindfulness? Here, monks, a monk, having gone to the wilderness... Thus, monks, the seven factors of awakening, when developed and frequently practiced in this manner, fulfill true knowledge and liberation.”",
      "sinhala": "එවිට බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනී, සැබවින්ම, එකම ධර්‍මයක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම සතරක් සම්පූර්ණ කරන්නේද? ධර්‍ම සතරක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම සතක් සම්පූර්ණ කරන්නේද? ධර්‍ම සතක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම දෙකක් සම්පූර්ණ කරන්නේද?”\n\n“මහණෙනි, සැබවින්ම, එකම ධර්‍මයක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම සතරක් සම්පූර්ණ කරයි. ධර්‍ම සතරක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම සතක් සම්පූර්ණ කරයි. ධර්‍ම සතක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම දෙකක් සම්පූර්ණ කරයි.”\n\n“ස්වාමීනී, එසේ නම්, කුමන එක ධර්‍මයක්ද, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම සතරක් සම්පූර්ණ කරන්නේ? ධර්‍ම සතරක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම සතක් සම්පූර්ණ කරන්නේ? ධර්‍ම සතක්, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ධර්‍ම දෙකක් සම්පූර්ණ කරන්නේ?”\n\n“මහණෙනි, ආනාපානසති සමාධියම, එකම ධර්‍මයක් ලෙස වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, සතර සතිපට්ඨානයන් සම්පූර්ණ කරයි. සතර සතිපට්ඨානයෝ, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, සප්ත බොජ්බංගයන් සම්පූර්ණ කරති. සප්ත බොජ්බංගයෝ, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, විජ්ජා විමුක්තිය සම්පූර්ණ කරති.”\n\n“මහණෙනි, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දක් වීද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දක් වීද, සතර සතිපට්ඨානයන් සම්පූර්ණ කරන්නේද? මෙහිලා, මහණෙනි, භික්ෂුවක් අරණ්‍යයකට ගිය කල්හි හෝ (විස්තර වන පරිදි), මෙලෙස වඩන ලද සප්ත බොජ්බංගයෝ, මෙලෙස බහුල වශයෙන් පුරුදු කරන ලදුව, විජ්ජා විමුක්තිය සම්පූර්ණ කරති.”\n\nපස්වැන්න.",
      "paliTitle": "Paṭhamabhikkhusuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 992,
      "pali": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘atthi nu kho, bhikkhave, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrentī’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā…pe… bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Atthi, bhikkhave, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrenti’’. ‘‘Katamo ca, bhikkhave, ekadhammo bhāvito bahulīkato cattāro dhamme paripūreti, cattāro dhammā bhāvitā bahulīkatā satta dhamme paripūrenti, satta dhammā bhāvitā bahulīkatā dve dhamme paripūrenti? Ānāpānassatisamādhi, bhikkhave, ekadhammo bhāvito bahulīkato cattāro satipaṭṭhāne paripūreti, cattāro satipaṭṭhānā bhāvitā bahulīkatā satta bojjhaṅge paripūrenti, satta bojjhaṅgā bhāvitā bahulīkatā vijjāvimuttiṃ paripūrentīti. ‘‘Kathaṃ bhāvito ca, bhikkhave, ānāpānassatisamādhi kathaṃ bahulīkato cattāro satipaṭṭhāne paripūreti? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati, satova passasati…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati’’. ‘‘Yasmiṃ samaye, bhikkhave, bhikkhu dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti, dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti, rassaṃ vā assasanto ‘rassaṃ assasāmī’ti pajānāti…pe… sabbakāyappaṭisaṃvedī…pe… ‘passambhayaṃ kāyasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ kāyasaṅkhāraṃ passasissāmī’ti sikkhati – kāye kāyānupassī, bhikkhave, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Kāyaññatarāhaṃ, bhikkhave, etaṃ vadāmi, yadidaṃ – assāsapassāsaṃ. Tasmātiha, bhikkhave, kāye kāyānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, bhikkhave, bhikkhu pītippaṭisaṃvedī…pe… sukhappaṭisaṃvedī…pe… cittasaṅkhārappaṭisaṃvedī…pe… ‘passambhayaṃ cittasaṅkhāraṃ assasissāmī’ti sikkhati, ‘passambhayaṃ cittasaṅkhāraṃ passasissāmī’ti sikkhati – vedanāsu vedanānupassī, bhikkhave, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Vedanāññatarāhaṃ, bhikkhave, etaṃ vadāmi, yadidaṃ – assāsapassāsānaṃ sādhukaṃ manasikāraṃ. Tasmātiha, bhikkhave, vedanāsu vedanānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, bhikkhave, bhikkhu cittappaṭisaṃvedī…pe… abhippamodayaṃ cittaṃ…pe… ‘samādahaṃ cittaṃ assasissāmī’ti sikkhati, ‘samādahaṃ cittaṃ passasissāmī’ti sikkhati; ‘vimocayaṃ cittaṃ assasissāmī’ti sikkhati, ‘vimocayaṃ cittaṃ passasissāmī’ti sikkhati – citte cittānupassī, bhikkhave, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Taṃ kissa hetu? Nāhaṃ, bhikkhave, muṭṭhassatissa asampajānassa ānāpānassatisamādhibhāvanaṃ vadāmi. Tasmātiha, bhikkhave, citte cittānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Yasmiṃ samaye, bhikkhave, bhikkhu aniccānupassī…pe… virāgānupassī…pe… nirodhānupassī…pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati, ‘paṭinissaggānupassī passasissāmī’ti sikkhati – dhammesu dhammānupassī, bhikkhave, bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. So yaṃ taṃ hoti abhijjhādomanassānaṃ pahānaṃ taṃ paññāya disvā sādhukaṃ ajjhupekkhitā hoti. Tasmātiha, bhikkhave, dhammesu dhammānupassī bhikkhu tasmiṃ samaye viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Evaṃ bhāvito kho, bhikkhave, ānāpānassatisamādhi evaṃ bahulīkato cattāro satipaṭṭhāne paripūreti. ‘‘Kathaṃ bhāvitā ca, bhikkhave, cattāro satipaṭṭhānā kathaṃ bahulīkatā satta bojjhaṅge paripūrenti? Yasmiṃ samaye, bhikkhave, bhikkhu kāye kāyānupassī viharati – upaṭṭhitāssa tasmiṃ samaye bhikkhuno sati hoti asammuṭṭhā. Yasmiṃ samaye, bhikkhave, bhikkhuno upaṭṭhitā sati hoti asammuṭṭhā – satisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, satisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, satisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘So tathā sato viharanto taṃ dhammaṃ paññāya pavicinati pavicarati parivīmaṃsamāpajjati. Yasmiṃ samaye, bhikkhave, bhikkhu tathā sato viharanto taṃ dhammaṃ paññāya pavicinati pavicarati parivīmaṃsamāpajjati – dhammavicayasambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, dhammavicayasambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, dhammavicayasambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Tassa taṃ dhammaṃ paññāya pavicinato pavicarato parivīmaṃsamāpajjato āraddhaṃ hoti vīriyaṃ asallīnaṃ. Yasmiṃ samaye, bhikkhave, bhikkhuno taṃ dhammaṃ paññāya pavicinato pavicarato parivīmaṃsamāpajjato āraddhaṃ hoti vīriyaṃ asallīnaṃ – vīriyasambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, vīriyasambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, vīriyasambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Āraddhavīriyassa uppajjati pīti nirāmisā. Yasmiṃ samaye, bhikkhave, bhikkhuno āraddhavīriyassa uppajjati pīti nirāmisā – pītisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, pītisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, pītisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Pītimanassa kāyopi passambhati, cittampi passambhati. Yasmiṃ samaye, bhikkhave, bhikkhuno pītimanassa kāyopi passambhati, cittampi passambhati – passaddhisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, passaddhisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, passaddhisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Passaddhakāyassa sukhino cittaṃ samādhiyati. Yasmiṃ samaye, bhikkhave, bhikkhuno passaddhakāyassa sukhino cittaṃ samādhiyati – samādhisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, samādhisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, samādhisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘So tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti. Yasmiṃ samaye, bhikkhave, bhikkhu tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. ‘‘Yasmiṃ samaye, bhikkhave, bhikkhu vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati – upaṭṭhitāssa tasmiṃ samaye bhikkhuno sati hoti asammuṭṭhā. Yasmiṃ samaye, bhikkhave, bhikkhuno upaṭṭhitā sati hoti asammuṭṭhā – satisambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, satisambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti – satisambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati…pe…. So tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti. Yasmiṃ samaye, bhikkhave, bhikkhu tathāsamāhitaṃ cittaṃ sādhukaṃ ajjhupekkhitā hoti – upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno āraddho hoti, upekkhāsambojjhaṅgaṃ tasmiṃ samaye bhikkhu bhāveti, upekkhāsambojjhaṅgo tasmiṃ samaye bhikkhuno bhāvanāpāripūriṃ gacchati. Evaṃ bhāvitā kho, bhikkhave, cattāro satipaṭṭhānā evaṃ bahulīkatā satta bojjhaṅge paripūrenti. ‘‘Kathaṃ bhāvitā ca, bhikkhave, satta bojjhaṅgā kathaṃ bahulīkatā vijjāvimuttiṃ paripūrenti? Idha, bhikkhave, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ; dhammavicayasambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ…pe… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ bhāvitā kho, bhikkhave, satta bojjhaṅgā evaṃ bahulīkatā vijjāvimuttiṃ paripūrentī’’ti. Chaṭṭhaṃ.",
      "english": "Then many monks approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side. As those monks sat to one side, the Blessed One said to them: \"Monks, is there one quality which, when developed and frequently practiced, brings to perfection four qualities? Do those four qualities, when developed and frequently practiced, bring to perfection seven qualities? And do those seven qualities, when developed and frequently practiced, bring to perfection two qualities?\"\n\n\"Venerable Sir, our teachings have the Blessed One as their root, are guided by the Blessed One, and have the Blessed One as their refuge. It would be excellent if the Blessed One himself would explain the meaning of these statements. Having heard it from the Blessed One, the monks will remember it.\"\n\n\"There is, monks, one quality which, when developed and frequently practiced, brings to perfection four qualities. Those four qualities, when developed and frequently practiced, bring to perfection seven qualities. And those seven qualities, when developed and frequently practiced, bring to perfection two qualities.\"\n\n\"And which, monks, is that one quality which, when developed and frequently practiced, brings to perfection four qualities? Which four qualities, when developed and frequently practiced, bring to perfection seven qualities? And which seven qualities, when developed and frequently practiced, bring to perfection two qualities? It is, monks, the concentration through mindfulness of breathing. The concentration through mindfulness of breathing, when developed and frequently practiced, brings to perfection the four foundations of mindfulness. The four foundations of mindfulness, when developed and frequently practiced, bring to perfection the seven factors of awakening. And the seven factors of awakening, when developed and frequently practiced, bring to perfection knowledge and liberation.\"\n\n\"And how, monks, is the concentration through mindfulness of breathing developed, how is it frequently practiced, so that it brings to perfection the four foundations of mindfulness? Here, monks, a monk, having gone to the wilderness, or to the root of a tree, or to an empty dwelling, sits down, having folded his legs crosswise, having set his body upright, and having established mindfulness at the forefront of his awareness. Mindful, he breathes in; mindful, he breathes out. He trains himself: ‘I will breathe in long,’ he trains himself: ‘I will breathe out long.’ He trains himself: ‘I will breathe in short,’ he trains himself: ‘I will breathe out short.’ He trains himself: ‘I will breathe in experiencing the whole body,’ he trains himself: ‘I will breathe out experiencing the whole body.’ He trains himself: ‘I will breathe in tranquillizing the bodily formation,’ he trains himself: ‘I will breathe out tranquillizing the bodily formation.’ He trains himself: ‘I will breathe in experiencing rapture,’ he trains himself: ‘I will breathe out experiencing rapture.’ He trains himself: ‘I will breathe in experiencing bliss,’ he trains himself: ‘I will breathe out experiencing bliss.’ He trains himself: ‘I will breathe in experiencing the mental formation,’ he trains himself: ‘I will breathe out experiencing the mental formation.’ He trains himself: ‘I will breathe in tranquillizing the mental formation,’ he trains himself: ‘I will breathe out tranquillizing the mental formation.’ He trains himself: ‘I will breathe in experiencing the mind,’ he trains himself: ‘I will breathe out experiencing the mind.’ He trains himself: ‘I will breathe in gladdening the mind,’ he trains himself: ‘I will breathe out gladdening the mind.’ He trains himself: ‘I will breathe in concentrating the mind,’ he trains himself: ‘I will breathe out concentrating the mind.’ He trains himself: ‘I will breathe in liberating the mind,’ he trains himself: ‘I will breathe out liberating the mind.’ He trains himself: ‘I will breathe in contemplating impermanence,’ he trains himself: ‘I will breathe out contemplating impermanence.’ He trains himself: ‘I will breathe in contemplating fading away,’ he trains himself: ‘I will breathe out contemplating fading away.’ He trains himself: ‘I will breathe in contemplating cessation,’ he trains himself: ‘I will breathe out contemplating cessation.’ He trains himself: ‘I will breathe in contemplating relinquishment,’ he trains himself: ‘I will breathe out contemplating relinquishment.’\"\n\n\"Monks, at the time a monk, breathing in long, understands ‘I breathe in long’; breathing out long, understands ‘I breathe out long’; breathing in short, understands ‘I breathe in short’; breathing out short, understands ‘I breathe out short.’ He trains himself: ‘I will breathe in experiencing the whole body’; he trains himself: ‘I will breathe out experiencing the whole body.’ He trains himself: ‘I will breathe in tranquillizing the bodily formation’; he trains himself: ‘I will breathe out tranquillizing the bodily formation.’ At that time, monks, the monk dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world. For what reason? Monks, I declare this – breathing in and breathing out – to be one among the bodily formations. Therefore, monks, at that time, a monk dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world.\"\n\n\"Monks, at the time a monk trains himself: ‘I will breathe in experiencing rapture’; he trains himself: ‘I will breathe out experiencing rapture.’ He trains himself: ‘I will breathe in experiencing bliss’; he trains himself: ‘I will breathe out experiencing bliss.’ He trains himself: ‘I will breathe in experiencing the mental formation’; he trains himself: ‘I will breathe out experiencing the mental formation.’ He trains himself: ‘I will breathe in tranquillizing the mental formation’; he trains himself: ‘I will breathe out tranquillizing the mental formation.’ At that time, monks, the monk dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world. For what reason? Monks, I declare this – careful attention to breathing in and breathing out – to be one among the feelings. Therefore, monks, at that time, a monk dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world.\"\n\n\"Monks, at the time a monk trains himself: ‘I will breathe in experiencing the mind’; he trains himself: ‘I will breathe out experiencing the mind.’ He trains himself: ‘I will breathe in gladdening the mind’; he trains himself: ‘I will breathe out gladdening the mind.’ He trains himself: ‘I will breathe in concentrating the mind’; he trains himself: ‘I will breathe out concentrating the mind.’ He trains himself: ‘I will breathe in liberating the mind’; he trains himself: ‘I will breathe out liberating the mind.’ At that time, monks, the monk dwells contemplating mind in mind, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world. For what reason? Monks, I do not say that the development of concentration through mindfulness of breathing is for one who is unmindful and without clear comprehension. Therefore, monks, at that time, a monk dwells contemplating mind in mind, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world.\"\n\n\"Monks, at the time a monk trains himself: ‘I will breathe in contemplating impermanence’; he trains himself: ‘I will breathe out contemplating impermanence.’ He trains himself: ‘I will breathe in contemplating fading away’; he trains himself: ‘I will breathe out contemplating fading away.’ He trains himself: ‘I will breathe in contemplating cessation’; he trains himself: ‘I will breathe out contemplating cessation.’ He trains himself: ‘I will breathe in contemplating relinquishment’; he trains himself: ‘I will breathe out contemplating relinquishment.’ At that time, monks, the monk dwells contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world. Having seen with wisdom the relinquishment of covetousness and distress, he carefully maintains equanimity. Therefore, monks, at that time, a monk dwells contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having removed covetousness and distress in the world.\"\n\nIndeed, monks, concentration through mindfulness of breathing, thus developed and thus frequently practiced, brings to perfection the four foundations of mindfulness.\n\nMonks, how are the four foundations of mindfulness cultivated and made much of so as to bring the seven factors of awakening to fulfillment? Monks, at the time when a monk dwells observing the body in the body, his mindfulness is established and unconfused at that time. Monks, at the time when a monk's mindfulness is established and unconfused, the mindfulness factor of awakening is aroused in him at that time; at that time, the monk cultivates the mindfulness factor of awakening; at that time, the mindfulness factor of awakening comes to perfection through his cultivation.\n\nWhile thus dwelling mindfully, he investigates, explores, and engages in thorough examination of that phenomenon with wisdom. Monks, at the time when a monk, thus dwelling mindfully, investigates, explores, and engages in thorough examination of that phenomenon with wisdom, the investigation-of-phenomena factor of awakening is aroused in him at that time; at that time, the monk cultivates the investigation-of-phenomena factor of awakening; at that time, the investigation-of-phenomena factor of awakening comes to perfection through his cultivation.\n\nWhile he is thus investigating, exploring, and engaging in thorough examination of that phenomenon with wisdom, unflagging energy is aroused in him. Monks, at the time when, while he is thus investigating, exploring, and engaging in thorough examination of that phenomenon with wisdom, unflagging energy is aroused in the monk, the energy factor of awakening is aroused in him at that time; at that time, the monk cultivates the energy factor of awakening; at that time, the energy factor of awakening comes to perfection through his cultivation.\n\nIn one whose energy is aroused, unworldly joy arises. Monks, at the time when unworldly joy arises in a monk whose energy is aroused, the joy factor of awakening is aroused in him at that time; at that time, the monk cultivates the joy factor of awakening; at that time, the joy factor of awakening comes to perfection through his cultivation.\n\nIn one whose mind is joyful, the body becomes tranquil, and the mind also becomes tranquil. Monks, at the time when, in a monk whose mind is joyful, the body becomes tranquil and the mind also becomes tranquil, the tranquility factor of awakening is aroused in him at that time; at that time, the monk cultivates the tranquility factor of awakening; at that time, the tranquility factor of awakening comes to perfection through his cultivation.\n\nIn one whose body is tranquil and who feels pleasure, the mind becomes concentrated. Monks, at the time when, in a monk whose body is tranquil and who feels pleasure, the mind becomes concentrated, the concentration factor of awakening is aroused in him at that time; at that time, the monk cultivates the concentration factor of awakening; at that time, the concentration factor of awakening comes to perfection through his cultivation.\n\nHe then carefully looks on that thus concentrated mind with equanimity. Monks, at the time when a monk carefully looks on that thus concentrated mind with equanimity, the equanimity factor of awakening is aroused in him at that time; at that time, the monk cultivates the equanimity factor of awakening; at that time, the equanimity factor of awakening comes to perfection through his cultivation.\n\nMonks, at the time when a monk dwells observing feelings in feelings, observing mind in mind, or observing phenomena in phenomena, his mindfulness is established and unconfused at that time. Monks, at the time when a monk's mindfulness is established and unconfused, the mindfulness factor of awakening is aroused in him at that time; at that time, the monk cultivates the mindfulness factor of awakening; at that time, the mindfulness factor of awakening comes to perfection through his cultivation. In the same way, the investigation-of-phenomena factor of awakening, the energy factor of awakening, the joy factor of awakening, the tranquility factor of awakening, and the concentration factor of awakening are aroused, cultivated, and brought to perfection for feelings, mind, and phenomena. He then carefully looks on that thus concentrated mind with equanimity. Monks, at the time when a monk carefully looks on that thus concentrated mind with equanimity, the equanimity factor of awakening is aroused in him at that time; at that time, the monk cultivates the equanimity factor of awakening; at that time, the equanimity factor of awakening comes to perfection through his cultivation. It is in this way, monks, that the four foundations of mindfulness, when cultivated and made much of, bring the seven factors of awakening to fulfillment.\n\nMonks, how are the seven factors of awakening cultivated and made much of so as to bring knowledge and liberation to fulfillment? Here, monks, a monk cultivates the mindfulness factor of awakening, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. He cultivates the investigation-of-phenomena factor of awakening, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. He cultivates the energy factor of awakening, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. He cultivates the joy factor of awakening, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. He cultivates the tranquility factor of awakening, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. He cultivates the concentration factor of awakening, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. He cultivates the equanimity factor of awakening, dependent on detachment, dependent on dispassion, dependent on cessation, culminating in relinquishment. It is in this way, monks, that the seven factors of awakening, when cultivated and made much of, bring knowledge and liberation to fulfillment.",
      "sinhala": "එවිට බොහෝ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩසිටි ඒ භික්‍ෂූන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද එක ධර්මයක් සතර ධර්මයන් සම්පූර්ණ කරන්නේද? වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සතර ධර්මයක් සත් ධර්මයන් සම්පූර්ණ කරන්නේද? වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සත් ධර්මයක් ධර්ම දෙකක් සම්පූර්ණ කරන්නේද?” “වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තෝය, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තෝය, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තෝය. වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේම මේ වචනයේ අර්ථය පැහැදිලි කරන්නේ නම් එය යෙහෙකි. භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණය කොට භික්‍ෂූහු ඒ ධර්මයන් දරාගන්නාහ”යි කීහ. “මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද එක ධර්මයක් සතර ධර්මයන් සම්පූර්ණ කරන්නේය, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සතර ධර්මයක් සත් ධර්මයන් සම්පූර්ණ කරන්නේය, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සත් ධර්මයක් ධර්ම දෙකක් සම්පූර්ණ කරන්නේය.” “මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද එක ධර්මය කුමක්ද, එය සතර ධර්මයන් සම්පූර්ණ කරන්නේය? වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සතර ධර්මයන් සත් ධර්මයන් සම්පූර්ණ කරන්නේය? වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සත් ධර්මයන් ධර්ම දෙකක් සම්පූර්ණ කරන්නේය? මහණෙනි, ආනාපානසති සමාධිය වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද එක ධර්මයකි. එය සතර සතිපට්ඨාන ධර්මයන් සම්පූර්ණ කරන්නේය. වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සතර සතිපට්ඨාන ධර්මයන් සත් බොජ්ඣංග ධර්මයන් සම්පූර්ණ කරන්නේය. වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද සත් බොජ්ඣංග ධර්මයන් විද්‍යාව හා විමුක්තිය සම්පූර්ණ කරන්නේය.”\n\n“මහණෙනි, ආනාපානසති සමාධිය කෙසේ වැඩූ කල, කෙසේ බහුල වශයෙන් පුරුදු කළ කල සතර සතිපට්ඨාන ධර්මයන් සම්පූර්ණ කරන්නේද? මහණෙනි, මේ ශාසනයෙහි භික්‍ෂුවක් අරණ්‍යයකට ගොස් හෝ, ගසක් මුලට ගොස් හෝ, හිස් ගෙයකට ගොස් හෝ, කය ඍජු කොට, පලක් බැඳ, මුහුණට ඉදිරියෙන් සිහිය පිහිටුවාගෙන හිඳියි. හෙතෙම සිහි කල්පනාවෙන් හුස්ම ගනියි, සිහි කල්පනාවෙන් හුස්ම හෙළයි. ‘සියලු කෙලෙස් අත්හැරීම මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සියලු කෙලෙස් අත්හැරීම මෙනෙහි කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි.”\n\n“මහණෙනි, යම් සමයෙක්හි භික්‍ෂුවක් දීර්ඝ ආශ්වාසයක් කරන්නේ ‘මම දීර්ඝ ආශ්වාසයක් කරමි’යි දැනගනීද, දීර්ඝ ප්‍රාශ්වාසයක් කරන්නේ ‘මම දීර්ඝ ප්‍රාශ්වාසයක් කරමි’යි දැනගනීද, කෙටි ආශ්වාසයක් කරන්නේ ‘මම කෙටි ආශ්වාසයක් කරමි’යි දැනගනීද, කෙටි ප්‍රාශ්වාසයක් කරන්නේ ‘මම කෙටි ප්‍රාශ්වාසයක් කරමි’යි දැනගනීද, ‘මුළු කයම අත්විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘මුළු කයම අත්විඳිමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘කාය සංස්කාරයන් (ශරීර ක්‍රියා) සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘කාය සංස්කාරයන් සන්සිඳුවමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි – මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් කයෙහි කය අනුව බලමින් වාසය කරයි. එයට හේතුව කුමක්ද? මහණෙනි, ආශ්වාස ප්‍රාශ්වාසය කයෙහි එක් කොටසක් ලෙස මම දේශනා කරමි. එබැවින්, මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් කයෙහි කය අනුව බලමින් වාසය කරයි.”\n\n“මහණෙනි, යම් සමයෙක්හි භික්‍ෂුවක් ‘ප්‍රීතිය අත්විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘ප්‍රීතිය අත්විඳිමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සුවය අත්විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සුවය අත්විඳිමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘චිත්ත සංස්කාරයන් (සිතේ ක්‍රියාකාරීත්වයන්) අත්විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘චිත්ත සංස්කාරයන් අත්විඳිමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘චිත්ත සංස්කාරයන් සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘චිත්ත සංස්කාරයන් සන්සිඳුවමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි – මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් වේදනාවන්හි (විඳීම්හි) වේදනාවන් අනුව බලමින් වාසය කරයි. එයට හේතුව කුමක්ද? මහණෙනි, ආශ්වාස ප්‍රාශ්වාස මනාව මෙනෙහි කිරීම වේදනාවන්ගෙන් එකක් ලෙස මම දේශනා කරමි. එබැවින්, මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් වේදනාවන්හි වේදනාවන් අනුව බලමින් වාසය කරයි.”\n\n“මහණෙනි, යම් සමයෙක්හි භික්‍ෂුවක් ‘සිත අත්විඳිමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත අත්විඳිමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත ප්‍රීතිමත් කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත ප්‍රීතිමත් කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත සමාධිමත් කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත සමාධිමත් කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත විමුක්තිය කරා යොමු කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘සිත විමුක්තිය කරා යොමු කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි – මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් සිතෙහි සිත අනුව බලමින් වාසය කරයි. එයට හේතුව කුමක්ද? මහණෙනි, සිහි නැති, මනා සිහි නුවණින් තොර වූ පුද්ගලයාට ආනාපානසති සමාධිය වැඩීමක් මම දේශනා නොකරමි. එබැවින්, මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් සිතෙහි සිත අනුව බලමින් වාසය කරයි.”\n\n“මහණෙනි, යම් සමයෙක්හි භික්‍ෂුවක් ‘අනිත්‍යය මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘අනිත්‍යය මෙනෙහි කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘විරාගය (ඇලීම් රහිත බව) මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘විරාගය මෙනෙහි කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘නිරෝධය (නිරුද්ධ කිරීම) මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘නිරෝධය මෙනෙහි කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘ප්‍රතිනිස්සර්ගය (අත්හැරීම) මෙනෙහි කරමින් ආශ්වාස කරන්නෙමි’යි හික්මෙයි, ‘ප්‍රතිනිස්සර්ගය මෙනෙහි කරමින් ප්‍රාශ්වාස කරන්නෙමි’යි හික්මෙයි – මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් ධර්මයන්හි ධර්ම අනුව බලමින් වාසය කරයි. හෙතෙම එම දැඩි ආශාවන් හා දොම්නස් ප්‍රහීණ වීම ප්‍රඥාවෙන් දැක, එය මනාව උපේක්‍ෂාවෙන් යුතුව සිටියි. එබැවින්, මහණෙනි, ඒ සමයෙහි භික්‍ෂුවක් කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහි නුවණින් යුක්තව, සිහි ඇතිව, ලෝකයෙහි ඇති දැඩි ආශාවන් හා දොම්නස් දුරු කරමින් ධර්මයන්හි ධර්ම අනුව බලමින් වාසය කරයි.”\n\n“මහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද ආනාපානසති සමාධිය සතර සතිපට්ඨාන ධර්මයන් සම්පූර්ණ කරන්නේය.”\n\nමහණෙනි, සතර සතිපට්ඨානයන් කෙසේ භාවනා කිරීමෙන්ද, කෙසේ නිතර පුරුදු කිරීමෙන්ද සප්ත බොජ්ඣංගයන් පිරී පැමිණෙන්නේ? මහණෙනි, යම් සමයෙක්හි භික්ෂුවක් කයෙහි කය අනුව බලමින් වාසය කරන්නේද, ඒ සමයෙහි ඔහුගේ සිහිය මුළා නොවී පිහිටා පවතී. මහණෙනි, යම් සමයෙක්හි භික්ෂුවකට මුළා නොවූ සිහිය පිහිටා පවතීද, ඒ සමයෙහි ඔහුට සතිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව සතිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට සතිසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.\n\nඔහු එලෙසින් සිහි නුවණින් යුක්තව වාසය කරමින්, ඒ ධර්මය ප්‍රඥාවෙන් විමසයි, විචාරයි, විමර්ශනය කරයි. මහණෙනි, යම් සමයෙක්හි භික්ෂුවක් එලෙසින් සිහි නුවණින් යුක්තව වාසය කරමින්, ඒ ධර්මය ප්‍රඥාවෙන් විමසයිද, විචාරයිද, විමර්ශනය කරයිද, ඒ සමයෙහි ඔහුට ධම්මවිචයසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව ධම්මවිචයසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට ධම්මවිචයසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.\n\nඔහු ඒ ධර්මය ප්‍රඥාවෙන් විමසන, විචාරන, විමර්ශනය කරන විට, ඔහුගේ වීර්යය අලස නොවී ආරම්භ වී පවතී. මහණෙනි, යම් සමයෙක්හි භික්ෂුවකට ඒ ධර්මය ප්‍රඥාවෙන් විමසන, විචාරන, විමර්ශනය කරන විට, ඔහුගේ වීර්යය අලස නොවී ආරම්භ වී පවතීද, ඒ සමයෙහි ඔහුට වීර්යසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව වීර්යසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට වීර්යසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.\n\nවීර්යය ආරම්භ කළ තැනැත්තාට නිරාමිස පීතිය හටගනී. මහණෙනි, යම් සමයෙක්හි වීර්යය ආරම්භ කළ භික්ෂුවකට නිරාමිස පීතිය හටගනීද, ඒ සමයෙහි ඔහුට ප්‍රීතිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව ප්‍රීතිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට ප්‍රීතිසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.\n\nපීතියෙන් යුත් සිත ඇති තැනැත්තාගේ කයද සංසිඳේ, සිතද සංසිඳේ. මහණෙනි, යම් සමයෙක්හි පීතියෙන් යුත් සිත ඇති භික්ෂුවකගේ කයද සංසිඳේද, සිතද සංසිඳේද, ඒ සමයෙහි ඔහුට පස්සද්ධිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව පස්සද්ධිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට පස්සද්ධිසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.\n\nසංසිඳුණු කය ඇති, සුවයෙන් යුත් තැනැත්තාගේ සිත සමාධිමත් වේ. මහණෙනි, යම් සමයෙක්හි සංසිඳුණු කය ඇති, සුවයෙන් යුත් භික්ෂුවකගේ සිත සමාධිමත් වේද, ඒ සමයෙහි ඔහුට සමාධිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව සමාධිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට සමාධිසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.\n\nඔහු එලෙසින් සමාධිමත් වූ සිත මැනවින් උපේක්ෂාවෙන් යුතුව බලයි. මහණෙනි, යම් සමයෙක්හි භික්ෂුවක් එලෙසින් සමාධිමත් වූ සිත මැනවින් උපේක්ෂාවෙන් යුතුව බලයිද, ඒ සමයෙහි ඔහුට උපේක්ඛාසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව උපේක්ඛාසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට උපේක්ඛාසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.\n\nමහණෙනි, යම් සමයෙක්හි භික්ෂුවක් වේදනාවන්හි වේදනා අනුව බලමින්, සිතෙහි සිත අනුව බලමින්, ධර්මයන්හි ධර්මයන් අනුව බලමින් වාසය කරයිද, ඒ සමයෙහි ඔහුගේ සිහිය මුළා නොවී පිහිටා පවතී. මහණෙනි, යම් සමයෙක්හි භික්ෂුවකට මුළා නොවූ සිහිය පිහිටා පවතීද, ඒ සමයෙහි ඔහුට සතිසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව සතිසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට සතිසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ. (ඉහත කී ක්‍රමයටම ධම්මවිචයසම්බොජ්ඣංගයේ සිට සමාධිසම්බොජ්ඣංගය දක්වා වූ අනෙකුත් බොජ්ඣංගයන්ද භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ.) ඔහු එලෙසින් සමාධිමත් වූ සිත මැනවින් උපේක්ෂාවෙන් යුතුව බලයි. මහණෙනි, යම් සමයෙක්හි භික්ෂුවක් එලෙසින් සමාධිමත් වූ සිත මැනවින් උපේක්ෂාවෙන් යුතුව බලයිද, ඒ සමයෙහි ඔහුට උපේක්ඛාසම්බොජ්ඣංගය ආරම්භ වී පවතී. ඒ සමයෙහි භික්ෂුව උපේක්ඛාසම්බොජ්ඣංගය වඩයි. ඒ සමයෙහි භික්ෂුවට උපේක්ඛාසම්බොජ්ඣංගය භාවනා වශයෙන් පරිපූර්ණත්වයට පත්වේ. මහණෙනි, මෙලෙස භාවනා කරන ලද, මෙලෙස නිතර පුරුදු කරන ලද සතර සතිපට්ඨානයන් සප්ත බොජ්ඣංගයන් පිරවීමට හේතුවේ.\n\nමහණෙනි, සප්ත බොජ්ඣංගයන් කෙසේ භාවනා කිරීමෙන්ද, කෙසේ නිතර පුරුදු කිරීමෙන්ද විද්‍යාව සහ විමුක්තිය පිරී පැමිණෙන්නේ? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, අත්හැරීමෙහි කෙළවර වන සතිසම්බොජ්ඣංගය වඩයි. ධම්මවිචයසම්බොජ්ඣංගයද විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, අත්හැරීමෙහි කෙළවර වන සේ වඩයි. (වීර්යසම්බොජ්ඣංගයේ සිට සමාධිසම්බොජ්ඣංගය දක්වා වූ අනෙකුත් බොජ්ඣංගයන්ද විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, අත්හැරීමෙහි කෙළවර වන සේ වඩයි.) උපේක්ඛාසම්බොජ්ඣංගයද විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, අත්හැරීමෙහි කෙළවර වන සේ වඩයි. මහණෙනි, මෙලෙස භාවනා කරන ලද, මෙලෙස නිතර පුරුදු කරන ලද සප්ත බොජ්ඣංගයන් විද්‍යාව සහ විමුක්තිය පිරවීමට හේතුවේ.",
      "paliTitle": "Dutiyabhikkhusuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 993,
      "pali": "Ānāpānassatisamādhi, bhikkhave, bhāvito bahulīkato saṃyojanappahānāya saṃvattati…pe…. Sattamaṃ.",
      "english": "Monks, concentration developed through mindfulness of breathing, when cultivated and repeatedly practiced, conduces to the abandoning of fetters, and so on. The seventh.",
      "sinhala": "මහණෙනි, ආනාපානසති සමාධිය වඩන ලද්දේ ද, බහුල වශයෙන් පුරුදු කරන ලද්දේ ද, සංයෝජන ප්‍රහීණය වීම පිණිස හේතු වේ.",
      "paliTitle": "Saṃyojanappahānasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 994,
      "pali": "…Anusayasamugghātāya saṃvattati…. Aṭṭhamaṃ.",
      "english": "…conduces to the complete uprooting of the latent defilements.\nThe eighth.",
      "sinhala": "...අනුසය සමුග්ඝාතය පිණිස පවතී. අටවැන්නයි.",
      "paliTitle": "Anusayasamugghātasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 995,
      "pali": "…Addhānapariññāya saṃvattati…. Navamaṃ.",
      "english": "It leads to the complete understanding of the long duration of existence. The ninth.",
      "sinhala": "...දීර්ඝ සංසාර අද්‍ධානය මනාකොට අවබෝධ කර ගැනීම පිණිස පවතී. නවවැන්න යි.",
      "paliTitle": "Addhānapariññāsuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 996,
      "pali": "Āsavānaṃ khayāya saṃvattati. Kathaṃ bhāvito ca, bhikkhave, ānāpānassatisamādhi kathaṃ bahulīkato saṃyojanappahānāya saṃvattati… anusayasamugghātāya saṃvattati… addhānapariññāya saṃvattati… āsavānaṃ khayāya saṃvattati? Idha, bhikkhave, bhikkhu araññagato vā rukkhamūlagato vā…pe. … paṭinissaggānupassī assasissāmīti sikkhati, paṭinissaggānupassī passasissāmīti sikkhati. Evaṃ bhāvito kho, bhikkhave, ānāpānassatisamādhi evaṃ bahulīkato saṃyojanappahānāya saṃvattati… pe… anusayasamugghātāya saṃvattati…pe… addhānapariññāya saṃvattati…pe… āsavānaṃ khayāya saṃvattatīti. Dasamaṃ. Dutiyo vaggo. Tassuddānaṃ – Icchānaṅgalaṃ kaṅkheyyaṃ, ānandā apare duve; Bhikkhū saṃyojanānusayā, addhānaṃ āsavakkhayanti. ",
      "english": "It leads to the destruction of the intoxicants. How, O bhikkhus, is mindfulness of breathing concentration developed? How is it frequently practiced so that it leads to the abandoning of fetters? How does it lead to the uprooting of underlying tendencies? How does it lead to the full understanding of the path of existence? And how does it lead to the destruction of the intoxicants?\n\nHere, O bhikkhus, a monk, having gone to the wilderness or to the root of a tree, or to an empty hut, sits down, having folded his legs crosswise, set his body erect, and established mindfulness in front of him. He trains himself: 'I will breathe in contemplating relinquishment,' he trains himself: 'I will breathe out contemplating relinquishment.'\n\nThus developed, O bhikkhus, thus frequently practiced, mindfulness of breathing concentration leads to the abandoning of fetters, leads to the uprooting of underlying tendencies, leads to the full understanding of the path of existence, and leads to the destruction of the intoxicants.",
      "sinhala": "ආසවයන්ගේ ක්ෂය වීම සඳහා හේතු වේ. මහණෙනි, ආනාපානසති සමාධිය කෙසේ වඩන ලද්දේ ද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ ද, සංයෝජන ප්‍රහාණය පිණිස හේතු වේද, අනුසයයන් සමුච්ඡේදය පිණිස හේතු වේද, භව ගමන පිළිබඳ පූර්ණ අවබෝධය පිණිස හේතු වේද, ආසවයන්ගේ ක්ෂය වීම පිණිස හේතු වේද? මහණෙනි, මෙහිලා භික්ෂුවක් අරණ්‍යයකට ගියේ හෝ වෘක්ෂ මූලයකට ගියේ හෝ, (මෙසේ ආනාපානසති භාවනාව වඩමින්) මුදා හැරීම අනුදකිමින් ආශ්වාස කරන්නෙමියි පුහුණු වෙයි, මුදා හැරීම අනුදකිමින් ප්‍රශ්වාස කරන්නෙමියි පුහුණු වෙයි. මහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද ආනාපානසති සමාධිය සංයෝජන ප්‍රහාණය පිණිස හේතු වේ, අනුසයයන් සමුච්ඡේදය පිණිස හේතු වේ, භව ගමන පිළිබඳ පූර්ණ අවබෝධය පිණිස හේතු වේ, ආසවයන්ගේ ක්ෂය වීම පිණිස හේතු වේ.\n\nදස වැන්නයි. දෙවන වර්ගයයි.\n\nතේමං උද්දානය – ඉච්ඡානංගල සූත්‍රය, කංඛෙය්‍ය සූත්‍රය, ආනන්ද සූත්‍ර දෙක, භික්ඛූ සූත්‍රය, සංයෝජන සූත්‍රය, අනුසය සූත්‍රය, අද්ධාන සූත්‍රය, ආසවක්ඛය සූත්‍රය යන මේවායි.",
      "paliTitle": "Āsavakkhayasuttaṃ",
      "vagga": "Dutiyavaggo"
    }
  ],
  "footer": {
    "pali": "Ānāpānasaṃyuttaṃ dasamaṃ.",
    "english": "",
    "sinhala": ""
  }
}