{
  "id": "sn.5.4",
  "title": {
    "pali": "Indriyasaṃyuttaṃ",
    "english": "The Connected Discourses on the Faculties",
    "sinhala": "ඉන්‍ද්‍රි‍ය සංයුත්තය"
  },
  "sections": [
    {
      "number": 471,
      "pali": "Sāvatthinidānaṃ. ‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ – imāni kho, bhikkhave, pañcindriyānī’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five faculties. Which five? They are the faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. These, monks, are the five faculties.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පස් දෙනෙකි. කවර පස් දෙනෙක් ද? එනම්, සද්ධින්ද්‍රිය, වීරියින්ද්‍රිය, සතින්ද්‍රිය, සමාධින්ද්‍රිය, ප‍්‍රඥා ඉන්ද්‍රිය යන මේවා යි. මහණෙනි, මේවා යි ඒ පස් ඉන්ද්‍රියෝ.",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": "Suddhikavaggo",
      "englishTitle": "The Simple Discourse (or Discourse on Purity)",
      "sinhalaTitle": "සුද්ධික සූත්‍රය",
      "vaggaEnglish": "The Chapter on Purification",
      "vaggaSinhala": "සුද්ධික වර්ගය"
    },
    {
      "number": 472,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. Yato kho, bhikkhave, ariyasāvako imesaṃ pañcannaṃ indriyānaṃ assādañca [samudayañca atthaṅgamañca assādañca (syā. kaṃ. pī. ka.) saṃ. ni. 2.175] ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti. Dutiyaṃ.",
      "english": "Monks, these are five faculties. Which five? The faith faculty, the energy faculty, the mindfulness faculty, the concentration faculty, and the wisdom faculty. When, monks, a noble disciple understands, as it actually is, the gratification, the danger, and the escape from these five faculties, that noble disciple is called a stream-enterer, not subject to downfall, assured, bound for awakening.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පසකි. ඒ පස කවරේද? එනම්, ශ්‍ර​ද්ධා ඉන්ද්‍රිය, වීර්‍ය්‍ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍ර​ඥා ඉන්ද්‍රිය යන මේවාය. මහණෙනි, යම් කලක ආර්‍ය්‍ය ශ්‍රා​වකයා මේ ඉන්ද්‍රියයන් පසෙහි ආශ්වාදයද, ආදීනවයද, නිස්සරණයද යථාභූතව අවබෝධ කරයිද, මහණෙනි, මේ ආර්‍ය්‍ය ශ්‍රා​වකයා සෝතාපන්නයෙකි, දුර්ගතියට නොවැටෙන ස්වභාවයෙන් යුක්තයෙකි, නියතයෙකි, සම්බෝධිය පරමායනය කොට ඇත්තෙකි යැයි කියනු ලැබේ.\n\nදෙවැනි සූත්‍රයයි.",
      "paliTitle": "Paṭhamasotāpannasuttaṃ",
      "englishTitle": "The First Discourse on the Stream-Enterer",
      "sinhalaTitle": "පළමු සෝතාපන්න සූත්‍රය"
    },
    {
      "number": 473,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. Yato kho, bhikkhave, ariyasāvako imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, there are these five faculties. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Indeed, bhikkhus, when a noble disciple understands as it actually is the origin, the disappearance, the gratification, the danger, and the escape in regard to these five faculties – this noble disciple, bhikkhus, is called a stream-enterer, one who is no longer liable to fall into states of woe, assured, and bound for full enlightenment.",
      "sinhala": "භික්‍ෂූණි, මේ ඉන්ද්‍රියන් පහකි. ඒ පහ කවරේද යත්: ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්යය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේවායි. භික්‍ෂූණි, යම් කලෙක ආර්යය ශ්‍රාවකයෙක් මේ ඉන්ද්‍රියන් පසෙහි හටගැනීමද, නැතිවී යාමද, ආශ්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් අවබෝධ කරන්නේද, භික්‍ෂූණි, එවැනි ආර්යය ශ්‍රාවකයෙක් සෝවාන් වූවෙක් ලෙසත්, අපායගාමී නොවන ස්වභාවය ඇති කෙනෙක් ලෙසත්, නිශ්චිත වශයෙන් සම්බෝධිය පිණිස පිරිනිවන් පාන්නට නියම වූවෙක් ලෙසත් කියනු ලැබේ.",
      "paliTitle": "Dutiyasotāpannasuttaṃ",
      "englishTitle": "Second Sutta on the Stream-enterer",
      "sinhalaTitle": "දුතිය සෝතාපන්න සූත්‍රය"
    },
    {
      "number": 474,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. Yato kho, bhikkhave, ariyasāvako imesaṃ pañcannaṃ indriyānaṃ assādañca [samudayañca atthaṅgamañca assādañca (syā. kaṃ. pī. ka.) saṃ. ni. 2.175] ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto hoti – ayaṃ vuccati, bhikkhave, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto’’ti. Catutthaṃ.",
      "english": "Monks, these five are the faculties. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. When, monks, a noble disciple, having known as it actually is the gratification, the danger, and the escape concerning these five faculties, becomes liberated without clinging – this monk, monks, is called an Arahant, one whose taints are destroyed, one who has lived the holy life, one who has done what had to be done, one who has laid down the burden, one who has attained their true aim, one whose fetters to existence are utterly destroyed, one who is liberated by perfect wisdom.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්යය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේවායි. මහණෙනි, යම් විටෙක ආර්ය ශ්‍රාවක තෙම මේ ඉන්ද්‍රියයන් පසෙහි ඇති ආශ්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් අවබෝධ කරගෙන, උපාදාන රහිතව විමුක්ත වේද, මහණෙනි, මේ භික්ෂුව අරහත්, ක්ෂීණාශ්‍රව, බඹසර වැස නිම කළ, කළ යුතු දේ කළ, බර පහ කළ, තමාගේ සැබෑ අරමුණට පැමිණි, භව සංයෝජන ප්‍රහීණ කළ, මනාකොට ප්‍රඥාවෙන් විමුක්ත වූ භික්ෂුවකැයි කියනු ලැබේ.",
      "paliTitle": "Paṭhamaarahantasuttaṃ",
      "englishTitle": "The First Discourse on the Arahants",
      "sinhalaTitle": "පළමු අරහන්ත සූත්‍රය"
    },
    {
      "number": 475,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. Yato kho, bhikkhave, bhikkhu imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto hoti – ayaṃ vuccati, bhikkhave, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto’’ti. Pañcamaṃ.",
      "english": "Monks, these are the five faculties. Which five? They are the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. When, monks, a monk, having truly understood the origin, the cessation, the gratification, the danger, and the escape from these five faculties as they actually are, becomes liberated through non-clinging – this monk, monks, is called an Arahant, one whose taints are destroyed, who has lived the holy life, who has done what needed to be done, who has laid down the burden, who has attained the ultimate good for himself, whose fetters to becoming are utterly destroyed, and is liberated through perfect knowledge.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පසක් ඇත. ඒ කවර පසක්ද? එනම්: ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යි. මහණෙනි, යම් කලෙක භික්ෂුවක් මේ පංච ඉන්ද්‍රියන්ගේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් අවබෝධ කොට, උපාදාන රහිතව විමුක්ත වේද – මහණෙනි, ඒ භික්ෂුව අරහත් නම් වේ, ක්ෂීණාශ්‍රව නම් වේ, වුසිතවත් නම් වේ, කෘතකරණීය නම් වේ, ඕහිතභාර නම් වේ, අනුප්‍රාප්ත සදත්ථ නම් වේ, පරීක්ෂීණ භව සංයෝජන නම් වේ, සම්‍යග්ඥානයෙන් විමුක්ත නම් වේ යැයි කියනු ලැබේ.\nපස්වැන්නයි.",
      "paliTitle": "Dutiyaarahantasuttaṃ",
      "englishTitle": "Second Sutta on Arahants",
      "sinhalaTitle": "දුතිය අරහන්ත සූත්‍රය"
    },
    {
      "number": 476,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ indriyānaṃ assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti, na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca panete āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. ‘‘Ye ca kho keci [ye ca kho te (syā. kaṃ. ka.) saṃ. ni. 2.174], bhikkhave, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānanti, te kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā; te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, there are these five faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Whosoever, monks, are ascetics or brahmins who do not understand, as they actually are, the gratification, the danger, and the escape concerning these five faculties, such ascetics or brahmins, in my view, are not true ascetics among ascetics nor true brahmins among brahmins. Nor do those venerable ones, in this very life, realize and attain for themselves through direct knowledge the goal of asceticism or the goal of brahminhood, and dwell therein.\n\nBut whosoever, monks, are ascetics or brahmins who understand, as they actually are, the origin, the passing away, the gratification, the danger, and the escape concerning these five faculties, such ascetics or brahmins, in my view, are true ascetics among ascetics and true brahmins among brahmins. Furthermore, those venerable ones, in this very life, realize and attain for themselves through direct knowledge the goal of asceticism and the goal of brahminhood, and dwell therein.”",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පස් දෙනෙකි. කවරහුද ඒ පස් දෙන? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්යය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මොවුහුය. මහණෙනි, යම්කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ පස් ඉන්ද්‍රියයන්ගේ ආස්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් නොදනිත්ද; මහණෙනි, ඔවුහු මා විසින් ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙසද නොසලකනු ලබත්. එමෙන්ම ඒ ආයුෂ්මත්හු මේ දැක්වෙන ධර්මය තුළදීම ශ්‍රමණභාවයේ අර්ථය හෝ බ්‍රහ්මචාරීභාවයේ අර්ථය තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය නොකරත්.\n\nමහණෙනි, යම්කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ පස් ඉන්ද්‍රියයන්ගේ හටගැනීමද, නැතිවීමද, ආස්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් දනිත්ද; මහණෙනි, ඔවුහු මා විසින් ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙසද සලකනු ලබත්. එමෙන්ම ඒ ආයුෂ්මත්හු මේ දැක්වෙන ධර්මය තුළදීම ශ්‍රමණභාවයේ අර්ථයද, බ්‍රහ්මචාරීභාවයේ අර්ථයද තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරත්ය.",
      "paliTitle": "Paṭhamasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The First Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "පළමු සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 477,
      "pali": "‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā saddhindriyaṃ nappajānanti, saddhindriyasamudayaṃ nappajānanti, saddhindriyanirodhaṃ nappajānanti, saddhindriyanirodhagāminiṃ paṭipadaṃ nappajānanti; vīriyindriyaṃ nappajānanti…pe… satindriyaṃ nappajānanti …pe… samādhindriyaṃ nappajānanti…pe… paññindriyaṃ nappajānanti, paññindriyasamudayaṃ nappajānanti, paññindriyanirodhaṃ nappajānanti, paññindriyanirodhagāminiṃ paṭipadaṃ nappajānanti, na me te, bhikkhave samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca panete āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. ‘‘Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā saddhindriyaṃ pajānanti, saddhindriyasamudayaṃ pajānanti, saddhindriyanirodhaṃ pajānanti, saddhindriyanirodhagāminiṃ paṭipadaṃ pajānanti; vīriyindriyaṃ pajānanti, vīriyindriyasamudayaṃ pajānanti, vīriyindriyanirodhaṃ pajānanti, vīriyindriyanirodhagāminiṃ paṭipadaṃ pajānanti; satindriyaṃ pajānanti…pe… samādhindriyaṃ pajānanti…pe… paññindriyaṃ pajānanti, paññindriyasamudayaṃ pajānanti, paññindriyanirodhaṃ pajānanti, paññindriyanirodhagāminiṃ paṭipadaṃ pajānanti, te kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Sattamaṃ.",
      "english": "Whatever recluses or brahmins, bhikkhus, do not understand the faculty of conviction, do not understand the origin of the faculty of conviction, do not understand the cessation of the faculty of conviction, do not understand the path leading to the cessation of the faculty of conviction; do not understand the faculty of energy, do not understand the origin of the faculty of energy, do not understand the cessation of the faculty of energy, do not understand the path leading to the cessation of the faculty of energy; do not understand the faculty of mindfulness, do not understand the origin of the faculty of mindfulness, do not understand the cessation of the faculty of mindfulness, do not understand the path leading to the cessation of the faculty of mindfulness; do not understand the faculty of concentration, do not understand the origin of the faculty of concentration, do not understand the cessation of the faculty of concentration, do not understand the path leading to the cessation of the faculty of concentration; do not understand the faculty of wisdom, do not understand the origin of the faculty of wisdom, do not understand the cessation of the faculty of wisdom, do not understand the path leading to the cessation of the faculty of wisdom – these, bhikkhus, are not regarded by me as recluses among recluses, nor as brahmins among brahmins. Nor do these venerable ones realize for themselves, having directly known it, the goal of recluseship or the goal of brahminhood, and abide in it here and now.\n\nBut whatever recluses or brahmins, bhikkhus, understand the faculty of conviction, understand the origin of the faculty of conviction, understand the cessation of the faculty of conviction, understand the path leading to the cessation of the faculty of conviction; understand the faculty of energy, understand the origin of the faculty of energy, understand the cessation of the faculty of energy, understand the path leading to the cessation of the faculty of energy; understand the faculty of mindfulness, understand the origin of the faculty of mindfulness, understand the cessation of the faculty of mindfulness, understand the path leading to the cessation of the faculty of mindfulness; understand the faculty of concentration, understand the origin of the faculty of concentration, understand the cessation of the faculty of concentration, understand the path leading to the cessation of the faculty of concentration; understand the faculty of wisdom, understand the origin of the faculty of wisdom, understand the cessation of the faculty of wisdom, understand the path leading to the cessation of the faculty of wisdom – these, bhikkhus, are regarded by me as recluses among recluses and as brahmins among brahmins. And these venerable ones realize for themselves, having directly known it, the goal of recluseship and the goal of brahminhood, and abide in it here and now.",
      "sinhala": "මහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සද්ධා ඉන්ද්‍රිය නොදනිත් ද, සද්ධා ඉන්ද්‍රියයේ සමුදය නොදනිත් ද, සද්ධා ඉන්ද්‍රියයේ නිරෝධය නොදනිත් ද, සද්ධා ඉන්ද්‍රියයේ නිරෝධයට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; වීර්ය ඉන්ද්‍රිය නොදනිත් ද, වීර්ය ඉන්ද්‍රිය සමුදය නොදනිත් ද, වීර්ය ඉන්ද්‍රිය නිරෝධය නොදනිත් ද, වීර්ය ඉන්ද්‍රිය නිරෝධයට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; සති ඉන්ද්‍රිය නොදනිත් ද, සති ඉන්ද්‍රිය සමුදය නොදනිත් ද, සති ඉන්ද්‍රිය නිරෝධය නොදනිත් ද, සති ඉන්ද්‍රිය නිරෝධයට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; සමාධි ඉන්ද්‍රිය නොදනිත් ද, සමාධි ඉන්ද්‍රිය සමුදය නොදනිත් ද, සමාධි ඉන්ද්‍රිය නිරෝධය නොදනිත් ද, සමාධි ඉන්ද්‍රිය නිරෝධයට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; ප්‍රඥා ඉන්ද්‍රිය නොදනිත් ද, ප්‍රඥා ඉන්ද්‍රියයේ සමුදය නොදනිත් ද, ප්‍රඥා ඉන්ද්‍රියයේ නිරෝධය නොදනිත් ද, ප්‍රඥා ඉන්ද්‍රියයේ නිරෝධයට පමුණුවන ප්‍රතිපදාව නොදනිත් ද, මහණෙනි, මම ඔවුහු ශ්‍රමණයන් අතර ශ්‍රමණයෝ යැයි හෝ බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයෝ යැයි හෝ නොසලකමි. එම පින්වතුන් ශ්‍රමණභාවයේ ඵලය හෝ බ්‍රාහ්මණභාවයේ ඵලය මේ ආත්මභාවයේ දී ම තමන් විසින් විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය නොකරයි.\n\nමහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සද්ධා ඉන්ද්‍රිය දනිත් ද, සද්ධා ඉන්ද්‍රියයේ සමුදය දනිත් ද, සද්ධා ඉන්ද්‍රියයේ නිරෝධය දනිත් ද, සද්ධා ඉන්ද්‍රියයේ නිරෝධයට පමුණුවන ප්‍රතිපදාව දනිත් ද; වීර්ය ඉන්ද්‍රිය දනිත් ද, වීර්ය ඉන්ද්‍රිය සමුදය දනිත් ද, වීර්ය ඉන්ද්‍රිය නිරෝධය දනිත් ද, වීර්ය ඉන්ද්‍රිය නිරෝධයට පමුණුවන ප්‍රතිපදාව දනිත් ද; සති ඉන්ද්‍රිය දනිත් ද, සති ඉන්ද්‍රිය සමුදය දනිත් ද, සති ඉන්ද්‍රිය නිරෝධය දනිත් ද, සති ඉන්ද්‍රිය නිරෝධයට පමුණුවන ප්‍රතිපදාව දනිත් ද; සමාධි ඉන්ද්‍රිය දනිත් ද, සමාධි ඉන්ද්‍රිය සමුදය දනිත් ද, සමාධි ඉන්ද්‍රිය නිරෝධය දනිත් ද, සමාධි ඉන්ද්‍රිය නිරෝධයට පමුණුවන ප්‍රතිපදාව දනිත් ද; ප්‍රඥා ඉන්ද්‍රිය දනිත් ද, ප්‍රඥා ඉන්ද්‍රියයේ සමුදය දනිත් ද, ප්‍රඥා ඉන්ද්‍රියයේ නිරෝධය දනිත් ද, ප්‍රඥා ඉන්ද්‍රියයේ නිරෝධයට පමුණුවන ප්‍රතිපදාව දනිත් ද, මහණෙනි, මම ඔවුහු ශ්‍රමණයන් අතර ශ්‍රමණයෝ යැයි ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයෝ යැයි ද සලකමි. එම පින්වතුන් ශ්‍රමණභාවයේ ඵලය ද, බ්‍රාහ්මණභාවයේ ඵලය ද මේ ආත්මභාවයේ දී ම තමන් විසින් විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරති.",
      "paliTitle": "Dutiyasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The Second Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "දෙවන සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 478,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ. Kattha ca, bhikkhave, saddhindriyaṃ daṭṭhabbaṃ? Catūsu sotāpattiyaṅgesu – ettha saddhindriyaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, vīriyindriyaṃ daṭṭhabbaṃ? Catūsu sammappadhānesu – ettha vīriyindriyaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, satindriyaṃ daṭṭhabbaṃ? Catūsu satipaṭṭhānesu – ettha satindriyaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, samādhindriyaṃ daṭṭhabbaṃ? Catūsu jhānesu – ettha samādhindriyaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, paññindriyaṃ daṭṭhabbaṃ? Catūsu ariyasaccesu – ettha paññindriyaṃ daṭṭhabbaṃ. Imāni kho, bhikkhave, pañcindriyānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. And where, monks, is the faculty of conviction to be understood? It is to be understood in the four factors of stream-entry. And where, monks, is the faculty of energy to be understood? It is to be understood in the four right exertions. And where, monks, is the faculty of mindfulness to be understood? It is to be understood in the four foundations of mindfulness. And where, monks, is the faculty of concentration to be understood? It is to be understood in the four meditative absorptions. And where, monks, is the faculty of wisdom to be understood? It is to be understood in the four Noble Truths. These, monks, are the five faculties.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස? සද්ධින්ද්‍රිය, වීර්‍ය්‍යින්ද්‍රිය, සතින්ද්‍රිය, සමාධින්ද්‍රිය, ප්‍රඥින්ද්‍රිය යන මේවාය.\n\nමහණෙනි, සද්ධින්ද්‍රිය දැක්ක යුත්තේ කොහිද? සෝතාපත්තියංගයන් සතරෙහි ය. එහි සද්ධින්ද්‍රිය දැක්ක යුතුය. මහණෙනි, වීර්‍ය්‍යින්ද්‍රිය දැක්ක යුත්තේ කොහිද? සම්මප්පධාන සතරෙහි ය. එහි වීර්‍ය්‍යින්ද්‍රිය දැක්ක යුතුය. මහණෙනි, සතින්ද්‍රිය දැක්ක යුත්තේ කොහිද? සතිපට්ඨාන සතරෙහි ය. එහි සතින්ද්‍රිය දැක්ක යුතුය. මහණෙනි, සමාධින්ද්‍රිය දැක්ක යුත්තේ කොහිද? ධ්‍යාන සතරෙහි ය. එහි සමාධින්ද්‍රිය දැක්ක යුතුය. මහණෙනි, ප්‍රඥින්ද්‍රිය දැක්ක යුත්තේ කොහිද? ආර්‍ය්‍යසත්‍යයන් සතරෙහි ය. එහි ප්‍රඥින්ද්‍රිය දැක්ක යුතුය. මහණෙනි, මේ ඉන්ද්‍රියයන් පස මෙසේය.",
      "paliTitle": "Daṭṭhabbasuttaṃ",
      "englishTitle": "The Discourse on What Should Be Seen",
      "sinhalaTitle": "දට්ඨබ්බ සූත්‍රය"
    },
    {
      "number": 479,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ. Katamañca, bhikkhave, saddhindriyaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti – idaṃ vuccati, bhikkhave, saddhindriyaṃ. ‘‘Katamañca, bhikkhave, vīriyindriyaṃ? Idha, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu – idaṃ vuccati, bhikkhave, vīriyindriyaṃ. ‘‘Katamañca, bhikkhave, satindriyaṃ? Idha, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā – idaṃ vuccati, bhikkhave, satindriyaṃ. ‘‘Katamañca, bhikkhave, samādhindriyaṃ? Idha, bhikkhave, ariyasāvako vossaggārammaṇaṃ karitvā labhati samādhiṃ, labhati cittassa ekaggataṃ – idaṃ vuccati, bhikkhave, samādhindriyaṃ. ‘‘Katamañca, bhikkhave, paññindriyaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya, sammā dukkhakkhayagāminiyā – idaṃ vuccati, bhikkhave, paññindriyaṃ. Imāni kho, bhikkhave, pañcindriyānī’’ti. Navamaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom.\n\nAnd what, monks, is the faculty of faith? Here, monks, a noble disciple is endowed with faith; he places his trust in the Tathāgata’s enlightenment, saying: ‘Indeed, the Blessed One is an Arahant, a Fully Self-Awakened One, accomplished in knowledge and conduct, a Fortunate One, knower of the world, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ This, monks, is called the faculty of faith.\n\nAnd what, monks, is the faculty of energy? Here, monks, a noble disciple dwells with energy aroused for the abandonment of unwholesome states and for the acquisition of wholesome states; he is steadfast, firm in effort, not laying down the burden in wholesome states. This, monks, is called the faculty of energy.\n\nAnd what, monks, is the faculty of mindfulness? Here, monks, a noble disciple is mindful, endowed with supreme mindfulness and circumspection, one who remembers and recollects what was done and said long ago. This, monks, is called the faculty of mindfulness.\n\nAnd what, monks, is the faculty of concentration? Here, monks, a noble disciple, having made relinquishment his object, attains concentration, attains unification of mind. This, monks, is called the faculty of concentration.\n\nAnd what, monks, is the faculty of wisdom? Here, monks, a noble disciple is wise, endowed with wisdom that discerns rise and passing away, noble and penetrative, leading to the right destruction of suffering. This, monks, is called the faculty of wisdom.\n\nThese, monks, are the five faculties.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පස්දෙනෙකි. ඒ පස්දෙනා කවරහුද? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මොවුහුයි.\n\nමහණෙනි, ශ්‍රද්ධා ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි අරිය ශ්‍රාවකයා ශ්‍රද්ධාවෙන් යුක්ත වෙයි. ‘ඒ භාග්‍යවතුන් වහන්සේ අරහත්, සම්මාසම්බුද්ධ, විද්‍යාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භාග්‍යවතුන්’ යනුවෙන් තථාගතයන් වහන්සේගේ අවබෝධය විශ්වාස කරයි. මහණෙනි, මෙය ශ්‍රද්ධා ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, වීර්ය ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි අරිය ශ්‍රාවකයා අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, වීර්යය අරඹා වාසය කරයි. ශක්තිමත් බවින් යුක්තව, දැඩි පරාක්‍රමයකින් යුක්තව, කුසල ධර්මයන්හි නොපසුබට උත්සාහයෙන් යුක්තව වාසය කරයි. මහණෙනි, මෙය වීර්ය ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, සති ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි අරිය ශ්‍රාවකයා උතුම් වූ සිහි නුවණින් යුක්තව සිහි ඇතිව වාසය කරයි. කලක් කරන ලද දෙයක් වුවත්, කලක් කියන ලද දෙයක් වුවත් සිහි කරන්නේ, නැවත නැවත සිහිපත් කරන්නේ වාසය කරයි. මහණෙනි, මෙය සති ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, සමාධි ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි අරිය ශ්‍රාවකයා (පංච නීවරණ ආදී) අත්හැරීම අරමුණ කොටගෙන සමාධිය ලබයි. සිත් එකඟ බව ලබයි. මහණෙනි, මෙය සමාධි ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රඥා ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි අරිය ශ්‍රාවකයා ප්‍රඥාවන්ත වෙයි. උදයව්‍යය දකින, ආර්ය වූ, විනිවිද දකින, මනාකොට දුක් ක්ෂය කිරීම කරා පමුණුවන ප්‍රඥාවෙන් යුක්ත වෙයි. මහණෙනි, මෙය ප්‍රඥා ඉන්ද්‍රිය යැයි කියනු ලැබේ. මහණෙනි, මේවා අර ඉන්ද්‍රිය පසයි.",
      "paliTitle": "Paṭhamavibhaṅgasuttaṃ",
      "englishTitle": "The First Discourse on Analysis",
      "sinhalaTitle": "පළමු විභංග සූත්‍රය"
    },
    {
      "number": 480,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ. Katamañca, bhikkhave, saddhindriyaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti – idaṃ vuccati, bhikkhave, saddhindriyaṃ. ‘‘Katamañca, bhikkhave, vīriyindriyaṃ? Idha, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. So anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā [samāpattiyā (syā. kaṃ. ka.)] asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati – idaṃ vuccati, bhikkhave, vīriyindriyaṃ. ‘‘Katamañca, bhikkhave, satindriyaṃ? Idha, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. So kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – idaṃ vuccati, bhikkhave, satindriyaṃ. ‘‘Katamañca, bhikkhave, samādhindriyaṃ? Idha, bhikkhave, ariyasāvako vossaggārammaṇaṃ karitvā labhati samādhiṃ, labhati cittassa ekaggataṃ. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati – idaṃ vuccati, bhikkhave, samādhindriyaṃ. ‘‘Katamañca, bhikkhave, paññindriyaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya, sammā dukkhakkhayagāminiyā. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti – idaṃ vuccati, bhikkhave, paññindriyaṃ. Imāni kho, bhikkhave, pañcindriyānī’’ti. Dasamaṃ. Suddhikavaggo paṭhamo. Tassuddānaṃ – Suddhikañceva dve sotā, arahantā apare duve; Samaṇabrāhmaṇā daṭṭhabbaṃ, vibhaṅgā apare duveti.",
      "english": "Monks, there are these five faculties. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom.\n\nAnd what, monks, is the faculty of conviction? Here, monks, a noble disciple is endowed with conviction; they have faith in the Enlightenment of the Tathāgata, believing: ‘Indeed, that Blessed One is an Arahant, a Fully Self-Awakened One, accomplished in knowledge and conduct, a Fortunate One, a Knower of the worlds, an unsurpassed Trainer of persons to be tamed, a Teacher of gods and humans, the Awakened One, the Blessed One.’ This, monks, is called the faculty of conviction.\n\nAnd what, monks, is the faculty of energy? Here, monks, a noble disciple dwells with aroused energy for the abandonment of unwholesome states and for the acquisition of wholesome states; they are strong, firm in effort, unswerving in their duty regarding wholesome states. They generate desire for the non-arising of unarisen evil, unwholesome states, they make an effort, arouse energy, exert the mind, and strive; they generate desire for the abandonment of arisen evil, unwholesome states, they make an effort, arouse energy, exert the mind, and strive; they generate desire for the arising of unarisen wholesome states, they make an effort, arouse energy, exert the mind, and strive; they generate desire for the maintenance, non-disappearance, increase, development, cultivation, and perfection of arisen wholesome states, they make an effort, arouse energy, exert the mind, and strive. This, monks, is called the faculty of energy.\n\nAnd what, monks, is the faculty of mindfulness? Here, monks, a noble disciple is mindful, endowed with supreme discernment and vigilance, remembering and recalling what was done or said long ago. They dwell observing the body in the body, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world; they dwell observing feelings in feelings... observing the mind in the mind... observing mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world. This, monks, is called the faculty of mindfulness.\n\nAnd what, monks, is the faculty of concentration? Here, monks, a noble disciple, having made relinquishment their object, gains concentration, gains one-pointedness of mind. They, quite secluded from sensual pleasures, secluded from unwholesome states, enter and dwell in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and pleasure. With the fading away of initial application and sustained application, through the internal pacification and unification of the mind, they enter and dwell in the second jhāna, which is without initial application and sustained application, born of concentration, and filled with rapture and pleasure. With the fading of rapture, they dwell in equanimity, mindful and clearly comprehending, and experience pleasure with the body, which the noble ones declare: ‘He dwells in pleasure, equanimous and mindful.’ They enter and dwell in the third jhāna. With the abandoning of pleasure and pain, and with the previous disappearance of joy and sorrow, they enter and dwell in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. This, monks, is called the faculty of concentration.\n\nAnd what, monks, is the faculty of wisdom? Here, monks, a noble disciple is wise, endowed with wisdom that perceives arising and passing away, noble and penetrative, leading to the complete destruction of suffering. They understand as it actually is: ‘This is suffering’; they understand as it actually is: ‘This is the origin of suffering’; they understand as it actually is: ‘This is the cessation of suffering’; they understand as it actually is: ‘This is the path leading to the cessation of suffering.’ This, monks, is called the faculty of wisdom. These, monks, are the five faculties.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පසකි. කවරේද ඒ පස? සද්ධා ඉන්ද්‍රිය...පෙ... ප්‍රඥා ඉන්ද්‍රිය යන මේවායි.\n\nමහණෙනි, සද්ධා ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි ආර්ය ශ්‍රාවක තෙම ශ්‍රද්ධාවන්ත වෙයි. තථාගතයන් වහන්සේගේ බෝධිය (අවබෝධය) විශ්වාස කරයි. ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භගවා යන ගුණාංගයන්ගෙන් යුක්ත සේක’ යි අදහා සිටී. මහණෙනි, මෙය සද්ධා ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, වීර්යය ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි ආර්ය ශ්‍රාවක තෙම අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, ආරම්භ කරන ලද වීර්යයෙන් යුතුව වාසය කරයි. ධෛර්ය සම්පන්නව, ස්ථිර වීර්යයෙන් යුතුව, කුසල ධර්මයන් සම්බන්ධයෙන් බර නොහළ පුද්ගලයෙක් වෙයි. හට නොගත් පවිටු අකුසල ධර්මයන්ගේ නූපදීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කරයි, උත්සාහ කරයි. හටගත් පවිටු අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කරයි, උත්සාහ කරයි. හට නොගත් කුසල ධර්මයන් ඇතිවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කරයි, උත්සාහ කරයි. හටගත් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, විකෘති නොවීමට පිණිස, වැඩි දියුණු වීම පිණිස, ප්‍රගුණ කිරීම පිණිස, පිරී ඉතිරී යාම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩි කරයි, උත්සාහ කරයි. මහණෙනි, මෙය වීර්යය ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, සති ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි ආර්ය ශ්‍රාවක තෙම උතුම් සිහි කල්පනාවෙන් හා නුවණින් යුක්තව සිහියෙන් වාසය කරයි. බොහෝ කලකට පෙර කරන ලද දෙයක් වුවත්, බොහෝ කලකට පෙර කියන ලද දෙයක් වුවත් සිහි කරන්නේය, නැවත නැවත සිහිපත් කරන්නේය. හේ ලෝකයෙහි ඇති අධිච්ඡාදෝමනස්සයන් දුරු කොට, කායෙහි කායානුපස්සීව, කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා දැනුමෙන් යුතුව, සිහියෙන් යුතුව වාසය කරයි. වේදනාවන්හි වේදනානුපස්සීව...පෙ... සිතෙහි චිත්තානුපස්සීව...පෙ... ධර්මයන්හි ධම්මානුපස්සීව, කෙලෙස් තවන වීර්යයෙන් යුතුව, මනා දැනුමෙන් යුතුව, සිහියෙන් යුතුව, ලෝකයෙහි ඇති අධිච්ඡාදෝමනස්සයන් දුරු කොට වාසය කරයි. මහණෙනි, මෙය සති ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, සමාධි ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි ආර්ය ශ්‍රාවක තෙම කෙලෙස් මුදා හැරීම අරමුණු කොට සමාධිය ලබයි, සිතේ එකඟතාවය ලබයි. හේ කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක-විචාරයන් සන්සිඳවීමෙන්, අධ්‍යාත්මිකව සිත පහදවා ගැනීමෙන්, සිතේ එකඟතාවය ඇති කර ගැනීමෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියෙහිද නොඇල්මෙන්, උපේක්ෂාවෙන් යුතුව, සිහියෙන් හා මනා දැනුමෙන් යුතුව වාසය කරන්නේය. කාය සුවයද අත්විඳින්නේය. යම් ධ්‍යානයක් ගැන ආර්යයන් වහන්සේලා ‘උපේක්ෂාවෙන් යුක්තය, සිහියෙන් යුක්තය, සුවයෙන් වාසය කරයි’ යැයි කියත්ද, එබඳු තෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. සැපයද ප්‍රහීණ කිරීමෙන්, දුකද ප්‍රහීණ කිරීමෙන්, කලින්ම සෝමනස්ස-දෝමනස්සයන්ගේ අතුරුදන් වීමෙන්, දුක් රහිත වූ, සැප රහිත වූ, උපේක්ෂා-සති පාරිශුද්ධිය ඇති සිව්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි. මහණෙනි, මෙය සමාධි ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රඥා ඉන්ද්‍රිය යනු කවරේද? මහණෙනි, මෙහි ආර්ය ශ්‍රාවක තෙම නුවණැති වෙයි. ආර්ය වූ, කෙලෙස් විදහා හරිනසුලු, දුක ප්‍රහීණ කිරීම පිණිස නිවැරදිව පවත්නා, හට ගැනීමත් විනාශ වීමත් දකින ප්‍රඥාවෙන් යුක්ත වෙයි. හේ ‘මෙය දුක යි’ යථාභූතව (ඇති සැටියෙන්) දනී. ‘මෙය දුකට හේතුව යි’ යථාභූතව දනී. ‘මෙය දුක නැතිකිරීම යි’ යථාභූතව දනී. ‘මෙය දුක නැතිකිරීමට යන මාර්ගය යි’ යථාභූතව දනී. මහණෙනි, මෙය ප්‍රඥා ඉන්ද්‍රිය යැයි කියනු ලැබේ. මහණෙනි, මේ ඉන්ද්‍රියෝ පස මෙසේය.",
      "paliTitle": "Dutiyavibhaṅgasuttaṃ",
      "englishTitle": "The Second Discourse on Analysis",
      "sinhalaTitle": "දෙවන විභංග සූත්‍රය"
    },
    {
      "number": 481,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ… pe…. Katamañca, bhikkhave, saddhindriyaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti – idaṃ vuccati, bhikkhave, saddhindriyaṃ. ‘‘Katamañca, bhikkhave, vīriyindriyaṃ? Yaṃ kho, bhikkhave, cattāro sammappadhāne ārabbha vīriyaṃ paṭilabhati – idaṃ vuccati, bhikkhave, vīriyindriyaṃ. ‘‘Katamañca, bhikkhave, satindriyaṃ? Yaṃ kho, bhikkhave, cattāro satipaṭṭhāne ārabbha satiṃ paṭilabhati – idaṃ vuccati, bhikkhave, satindriyaṃ. ‘‘Katamañca, bhikkhave, samādhindriyaṃ? Idha, bhikkhave, ariyasāvako vossaggārammaṇaṃ karitvā labhati samādhiṃ, labhati cittassa ekaggataṃ – idaṃ vuccati, bhikkhave, samādhindriyaṃ. ‘‘Katamañca, bhikkhave, paññindriyaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā – idaṃ vuccati, bhikkhave, paññindriyaṃ. Imāni kho, bhikkhave, pañcindriyānī’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five faculties. Which five? They are the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom.\n\nAnd what, monks, is the faculty of faith? Here, monks, a noble disciple is endowed with faith; he places his trust in the Enlightenment of the Tathāgata, believing: ‘Indeed, the Blessed One is an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, sublime, knower of worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.’ This, monks, is called the faculty of faith.\n\nAnd what, monks, is the faculty of energy? That, monks, which is the energy gained by undertaking the four right exertions, this is called the faculty of energy.\n\nAnd what, monks, is the faculty of mindfulness? That, monks, which is the mindfulness gained by undertaking the four foundations of mindfulness, this is called the faculty of mindfulness.\n\nAnd what, monks, is the faculty of concentration? Here, monks, a noble disciple, having made relinquishment his object, attains concentration, attains unification of mind. This, monks, is called the faculty of concentration.\n\nAnd what, monks, is the faculty of wisdom? Here, monks, a noble disciple is wise, endowed with wisdom that discerns rise and fall, noble and penetrative, rightly leading to the complete destruction of suffering. This, monks, is called the faculty of wisdom.\n\nThese, monks, are the five faculties.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පස්දෙනෙකි. කවරහුද ඒ පස්දෙනා?\n\nශ්‍රද්ධා ඉන්ද්‍රිය...ප්‍රඥා ඉන්ද්‍රිය…පෙ….\n\nමහණෙනි, ශ්‍රද්ධා ඉන්ද්‍රිය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා ශ්‍රද්ධාවෙන් යුක්ත වේ. තථාගතයන් වහන්සේගේ බෝධිය විශ්වාස කරයි – ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං වන සේක, සම්මාසම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තරෝ පුරිසදම්මසාරථී වන සේක, සත්ථා දේවමනුස්සානං වන සේක, බුද්ධ වන සේක, භගවා වන සේක’ යනුවෙනි. මහණෙනි, මෙය ශ්‍රද්ධා ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, වීර්යය ඉන්ද්‍රිය කවරේද? මහණෙනි, යම්කිසිවෙක් සතර සම්‍යක් ප්‍රධන් වීර්යයන් අරමුණු කොටගෙන වීර්යය ලබන්නේද – මහණෙනි, මෙය වීර්යය ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, සති ඉන්ද්‍රිය කවරේද? මහණෙනි, යම්කිසිවෙක් සතර සතිපට්ඨාන ධර්මයන් අරමුණු කොටගෙන සතිය ලබන්නේද – මහණෙනි, මෙය සති ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, සමාධි ඉන්ද්‍රිය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා අත්හැරීම අරමුණු කොටගෙන සමාධිය ලබයි, සිතේ එකඟතාවය ලබයි – මහණෙනි, මෙය සමාධි ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රඥා ඉන්ද්‍රිය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා ප්‍රඥාවන්තයෙක් වේ. හටගැනීම හා නැතිවීම දකින, ආර්ය වූ, කෙලෙස් විනිවිද යන, දුක් ක්ෂය කිරීම සඳහා වූ සම්‍යක් ප්‍රඥාවෙන් යුක්ත වේ – මහණෙනි, මෙය ප්‍රඥා ඉන්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, මේ ඉන්ද්‍රියෝ පස්දෙනා වන්නේය.",
      "paliTitle": "Paṭilābhasuttaṃ",
      "vagga": "Mudutaravaggo",
      "englishTitle": "The Discourse on Attainment",
      "sinhalaTitle": "පටිලාභ සූත්‍රය",
      "vaggaEnglish": "The Very Soft Chapter",
      "vaggaSinhala": "මුදුතර වර්ගය"
    },
    {
      "number": 482,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi anāgāmī hoti, tato mudutarehi sakadāgāmī hoti, tato mudutarehi sotāpanno hoti, tato mudutarehi dhammānusārī hoti, tato mudutarehi saddhānusārī hotī’’ti. Dutiyaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Indeed, monks, these are the five faculties. Monks, by the completeness and perfect fulfillment of these five faculties, one becomes an Arahant. With these faculties less developed, one becomes a Non-Returner. With them still less developed, one becomes a Once-Returner. With them even less developed, one becomes a Stream-Enterer. With them further less developed, one becomes a Dhamma-follower. With them yet further less developed, one becomes a faith-follower.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පසක් ඇත. කවරේද ඒ පස? සද්ධින්ද්‍රිය, ... ප‍්‍රඥා ඉන්ද්‍රිය යන මේවායි. මහණෙනි, මේ ඉන්ද්‍රියයන් පසයි. මහණෙනි, මේ පංච ඉන්ද්‍රියයන්හි සම්පූර්ණත්වය හා පරිපූර්ණත්වය හේතුවෙන් අරහත් බවට පැමිණේ. එයිනුදු මෘදු වූ ඉන්ද්‍රියයන්ගෙන් අනාගාමී වේ. එයිනුදු මෘදු වූ ඉන්ද්‍රියයන්ගෙන් සකදාගාමී වේ. එයිනුදු මෘදු වූ ඉන්ද්‍රියයන්ගෙන් සෝවාන් වේ. එයිනුදු මෘදු වූ ඉන්ද්‍රියයන්ගෙන් ධම්මානුසාරී වේ. එයිනුදු මෘදු වූ ඉන්ද්‍රියයන්ගෙන් සද්ධානුසාරී වේ.",
      "paliTitle": "Paṭhamasaṃkhittasuttaṃ",
      "englishTitle": "The First Discourse in Brief",
      "sinhalaTitle": "පළමු සංඛිත්ත සූත්‍රය"
    },
    {
      "number": 483,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi anāgāmī hoti, tato mudutarehi sakadāgāmī hoti, tato mudutarehi sotāpanno hoti, tato mudutarehi dhammānusārī hoti, tato mudutarehi saddhānusārī hoti. Iti kho, bhikkhave, indriyavemattatā phalavemattatā hoti, phalavemattatā puggalavemattatā’’ti. Tatiyaṃ.",
      "english": "Monks, there are these five spiritual faculties. Which five? The faculty of faith, and so on, up to the faculty of wisdom – these, monks, are the five spiritual faculties. Monks, due to the completeness and fulfillment of these five spiritual faculties, one becomes an Arahant. With a slightly lesser development of these faculties, one becomes a Non-returner. With even lesser development, one becomes a Once-returner. With still lesser development, one becomes a Stream-entrant. With yet lesser development, one becomes a Dharma-follower. With the least development among these, one becomes a Faith-follower. Thus, monks, the diversity in the development of the spiritual faculties leads to a diversity in the fruits of the path, and the diversity in the fruits of the path leads to a diversity of individuals.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ඉන්ද්‍රියයන් පහක් ඇත. කවරේද ඒ පහ? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය්‍ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේවායි. භික්ෂූන් වහන්ස, මේවා ඒ ඉන්ද්‍රියයන් පහයි. භික්ෂූන් වහන්ස, මේ ඉන්ද්‍රියයන් පහ සම්පූර්ණ වීමෙන් හා පිරී ඉතිරී යාමෙන් රහතන් වහන්සේ කෙනෙක් වේ. ඉන් මෘදු වූ ඉන්ද්‍රියයන් ඇතිව අනාගාමී වේ. ඉන් මෘදු වූ ඉන්ද්‍රියයන් ඇතිව සකදාගාමී වේ. ඉන් මෘදු වූ ඉන්ද්‍රියයන් ඇතිව සෝතාපන්න වේ. ඉන් මෘදු වූ ඉන්ද්‍රියයන් ඇතිව ධම්මානුසාරී වේ. ඉන් මෘදු වූ ඉන්ද්‍රියයන් ඇතිව සද්ධානුසාරී වේ. භික්ෂූන් වහන්ස, මෙසේ ඉන්ද්‍රියයන්ගේ වෙනස්කම ඵලයන්ගේ වෙනස්කමට හේතු වේ. ඵලයන්ගේ වෙනස්කම පුද්ගලයන්ගේ වෙනස්කමට හේතු වේ.",
      "paliTitle": "Dutiyasaṃkhittasuttaṃ",
      "englishTitle": "Second Sutta in Brief",
      "sinhalaTitle": "දුතිය සංඛිත්ත සූත්‍රය"
    },
    {
      "number": 484,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi anāgāmī hoti, tato mudutarehi sakadāgāmī hoti, tato mudutarehi sotāpanno hoti, tato mudutarehi dhammānusārī hoti, tato mudutarehi saddhānusārī hoti. Iti kho, bhikkhave, paripūraṃ paripūrakārī ārādheti, padesaṃ padesakārī ārādheti. ‘Avañjhāni tvevāhaṃ, bhikkhave, pañcindriyānī’ti vadāmī’’ti. Catutthaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, the faculty of wisdom – these, monks, are the five faculties. Monks, through the complete development and fulfillment of these five faculties, one becomes an Arahant; with those faculties that are less developed, one becomes a non-returner; with those that are still less developed, one becomes a once-returner; with those that are yet less developed, one becomes a stream-enterer; with those that are even less developed, one becomes a Dhamma-follower; with those that are still less developed, one becomes a faith-follower.\n\nThus, monks, one who accomplishes the full development achieves the ultimate goal; one who accomplishes a partial development achieves a partial goal. Indeed, monks, I declare that these five faculties are not barren.",
      "sinhala": "භික්ෂූනි, මේ ඉන්ද්‍රියයන් පහකි. කවරේ ද ඒ පහ? සද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය – භික්ෂූනි, මේ ඉන්ද්‍රියයන් පහ වේ.\n\nභික්ෂූනි, මේ පස් ඉන්ද්‍රියයන්ගේ සම්පූර්ණ වීමෙන්, පිරිපුන් වීමෙන් අරහත් වේ. ඊට වඩා මෘදු වූ (ඒවායින්) අනාගාමී වේ. ඊට වඩා මෘදු වූ (ඒවායින්) සකදාගාමී වේ. ඊට වඩා මෘදු වූ (ඒවායින්) සෝතාපන්න වේ. ඊට වඩා මෘදු වූ (ඒවායින්) ධම්මානුසාරී වේ. ඊට වඩා මෘදු වූ (ඒවායින්) සද්ධානුසාරී වේ.\n\nභික්ෂූනි, මෙසේ පිරිපුන් බව සම්පූර්ණ කරන තැනැත්තා පිරිපුන් බව ම අවබෝධ කරගනී. ප්‍රදේශ වශයෙන් සම්පූර්ණ කරන තැනැත්තා ප්‍රදේශ වශයෙන් අවබෝධ කරගනී. ‘භික්ෂූනි, මේ පස් ඉන්ද්‍රියයන් කිසිසේත් නිෂ්ඵල නොවේ’ යැ යි මම කියමි.",
      "paliTitle": "Tatiyasaṃkhittasuttaṃ",
      "englishTitle": "Third Brief Discourse",
      "sinhalaTitle": "තතිය සංඛිත්ත සූත්‍රය"
    },
    {
      "number": 485,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi antarāparinibbāyī hoti, tato mudutarehi upahaccaparinibbāyī hoti, tato mudutarehi asaṅkhāraparinibbāyī hoti, tato mudutarehi sasaṅkhāraparinibbāyī hoti, tato mudutarehi uddhaṃsoto hoti akaniṭṭhagāmī, tato mudutarehi sakadāgāmī hoti, tato mudutarehi sotāpanno hoti, tato mudutarehi dhammānusārī hoti, tato mudutarehi saddhānusārī hotī’’ti. Pañcamaṃ.",
      "english": "Monks, these are the five spiritual faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Monks, these are the five spiritual faculties.\n\nMonks, due to the completion and fullness of these five spiritual faculties, one becomes an Arahant. With these in a lesser degree, one becomes one who attains final Nibbana between existences. With these in a lesser degree, one becomes one who attains final Nibbana upon landing. With these in a lesser degree, one becomes one who attains final Nibbana without exertion. With these in a lesser degree, one becomes one who attains final Nibbana with exertion. With these in a lesser degree, one becomes an upstream-goer bound for Akaniṭṭha. With these in a lesser degree, one becomes a Once-returner. With these in a lesser degree, one becomes a Stream-entrant. With these in a lesser degree, one becomes a Dhamma-follower. With these in a lesser degree, one becomes a Faith-follower.",
      "sinhala": "භික්ෂූනි, මේ ඉන්ද්‍රියෝ පසකි. කවරේද ඒ පස? ශ්‍ර‍ද්ධා ඉන්ද්‍රිය...ප්‍ර‍ඥා ඉන්ද්‍රියයි. භික්ෂූනි, මේ ඉන්ද්‍රියෝ පසයි. භික්ෂූනි, මේ ඉන්ද්‍රියයන් පසෙහි සම්පූර්ණ වීමෙන් හා පූර්ණ වීමෙන් අරහත් වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා අන්තරාපරිනිර්වාණී වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා උපහච්චපරිනිර්වාණී වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා අසංඛාරපරිනිර්වාණී වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා සසංඛාරපරිනිර්වාණී වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා අකනිට්ඨගාමී වන ඌර්ධ්ව‍ශ්‍රෝතස්වී වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා සකෘදාගාමී වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා සෝවාන් වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා ධම්මානුසාරී වේ; එසේම, ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇත්තා ශ්‍ර‍ද්ධානුසාරී වේ.",
      "paliTitle": "Paṭhamavitthārasuttaṃ",
      "englishTitle": "The First Discourse in Detail",
      "sinhalaTitle": "පළමු විත්ථාර සූත්‍රය"
    },
    {
      "number": 486,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi antarāparinibbāyī hoti, tato mudutarehi upahaccaparinibbāyī hoti, tato mudutarehi asaṅkhāraparinibbāyī hoti, tato mudutarehi sasaṅkhāraparinibbāyī hoti, tato mudutarehi uddhaṃsoto hoti akaniṭṭhagāmī, tato mudutarehi sakadāgāmī hoti, tato mudutarehi sotāpanno hoti, tato mudutarehi dhammānusārī hoti, tato mudutarehi saddhānusārī hoti. Iti kho, bhikkhave, indriyavemattatā phalavemattatā hoti, phalavemattatā puggalavemattatā hotī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these five faculties exist. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom – these, monks, are the five faculties. Through the completeness and perfect fulfillment of these five faculties, monks, one becomes an Arahant.\n\nWith faculties less developed than that, one becomes an intermediate Nibbāna attainee. With faculties even less developed than that, one becomes an attainment-Nibbāna attainee. With faculties even less developed than that, one becomes an effortless Nibbāna attainee. With faculties even less developed than that, one becomes an effortful Nibbāna attainee. With faculties even less developed than that, one becomes an upstream-bound individual destined for the Akanitṭha realm. With faculties even less developed than that, one becomes a Once-returner. With faculties even less developed than that, one becomes a Stream-enterer. With faculties even less developed than that, one becomes a Dhamma-follower. With faculties even less developed than that, one becomes a Faith-follower.\n\nThus, monks, the difference in faculties leads to a difference in the fruits of the path, and the difference in the fruits of the path leads to a difference in individuals.",
      "sinhala": "‘‘භික්ෂූණි, මේ ඉන්ද්‍රියෝ පස්දෙනෙකි. කවරහුද ඒ පස්දෙනා? ශ්‍රද්ධා ඉන්ද්‍රිය, ...පෙ... ප්‍රඥා ඉන්ද්‍රියයි. භික්ෂූණි, මේවා පංච ඉන්ද්‍රියෝ වෙති. භික්ෂූණි, මේ පස් ඉන්ද්‍රියන්ගේ සමෘද්ධියෙන්, පරිපූර්ණත්වයෙන් රහතන් වහන්සේ කෙනෙක් වෙයි. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව අන්තරාපරිනිර්වාණගාමී වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව උපහච්චපරිනිර්වාණගාමී වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව අසංඛාරපරිනිර්වාණගාමී වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව සසංඛාරපරිනිර්වාණගාමී වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව ඌර්ධ්වශ්‍රෝතස්වීව (ඉහළට ගලන) අකනිට්ඨගාමී වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව සකදාගාමී වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව සෝතාපන්න වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව ධම්මානුසාරී වේ. ඊට වඩා මෘදු ඉන්ද්‍රියයන් ඇතිව සද්ධානුසාරී වේ. භික්ෂූණි, මේ අයුරින් ඉන්ද්‍රියයන්ගේ වෙනස්කම ඵලයන්ගේ වෙනස්කම වෙයි. ඵලයන්ගේ වෙනස්කම පුද්ගලයන්ගේ වෙනස්කම වෙයි.’’",
      "paliTitle": "Dutiyavitthārasuttaṃ",
      "englishTitle": "Second Sutta in Detail",
      "sinhalaTitle": "දුතිය විත්ථාර සූත්‍රය"
    },
    {
      "number": 487,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi antarāparinibbāyī hoti, tato mudutarehi upahaccaparinibbāyī hoti, tato mudutarehi asaṅkhāraparinibbāyī hoti, tato mudutarehi sasaṅkhāraparinibbāyī hoti, tato mudutarehi uddhaṃsoto hoti akaniṭṭhagāmī, tato mudutarehi sakadāgāmī hoti, tato mudutarehi sotāpanno hoti, tato mudutarehi dhammānusārī hoti, tato mudutarehi saddhānusārī hoti. Iti kho, bhikkhave, paripūraṃ paripūrakārī ārādheti, padesaṃ padesakārī ārādheti. ‘Avañjhāni tvevāhaṃ, bhikkhave, pañcindriyānī’ti vadāmī’’ti. Sattamaṃ.",
      "english": "Monks, these are five spiritual faculties. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, the faculty of wisdom – these, monks, are the five spiritual faculties.\n\nBy the complete and full development of these five spiritual faculties, one becomes an Arahant. With faculties softer than those, one is an intermediate Nibbāna-attainer. With faculties softer than those, one is an attainer of Nibbāna upon reaching (the Pure Abodes). With faculties softer than those, one is an unprompted Nibbāna-attainer. With faculties softer than those, one is a prompted Nibbāna-attainer. With faculties softer than those, one is an upstream current bound for the Akaniṭṭha realm. With faculties softer than those, one is a Once-returner. With faculties softer than those, one is a Stream-entrant. With faculties softer than those, one is a Dhamma-follower. With faculties softer than those, one is a Faith-follower.\n\nThus, monks, one who fully develops (the faculties) achieves the full (goal), and one who partially develops (the faculties) achieves a partial (goal). Therefore, monks, I declare that these five spiritual faculties are not barren.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පස්දෙනෙක් වෙති. කවරහුද ඒ පස්දෙනා? සද්ධා ඉන්ද්‍රිය, විරිය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය – මහණෙනි, මේ පස් ඉන්ද්‍රියෝ යි.\n\nමහණෙනි, මේ පස් ඉන්ද්‍රියන්ගේ සමව පිහිටීමෙන් හා පරිපූර්ණත්වයෙන් අර්හත් බවට පත්වෙයි. ඊට වඩා මෘදු වූ (ඉන්ද්‍රිය බලයකින් යුක්ත වූ) විට අන්තරාපරිනිර්වාණගාමී වෙයි. ඊට වඩා මෘදු වූ විට උපහච්චපරිනිර්වාණගාමී වෙයි. ඊට වඩා මෘදු වූ විට අසංඛාරපරිනිර්වාණගාමී වෙයි. ඊට වඩා මෘදු වූ විට සසංඛාරපරිනිර්වාණගාමී වෙයි. ඊට වඩා මෘදු වූ විට ඌර්ධ්වශ්‍රෝතස්වී වෙයි, අකනිට්ඨගාමී වෙයි. ඊට වඩා මෘදු වූ විට සකෘදාගාමී වෙයි. ඊට වඩා මෘදු වූ විට සෝතාපන්න වෙයි. ඊට වඩා මෘදු වූ විට ධර්මානුසාරී වෙයි. ඊට වඩා මෘදු වූ විට ශ්‍රද්ධානුසාරී වෙයි.\n\nමහණෙනි, මෙසේ පිරිපුන් වූ තැනැත්තා පිරිපුන් බව සාක්ෂාත් කරයි. කොටසක් දියුණු කළ තැනැත්තා කොටසක් සාක්ෂාත් කරයි. මහණෙනි, මේ පස් ඉන්ද්‍රියෝ කිසිවිටෙකත් නිෂ්ඵල නොවන බව මම කියමි.",
      "paliTitle": "Tatiyavitthārasuttaṃ",
      "englishTitle": "Third Detailed Discourse",
      "sinhalaTitle": "තතිය විත්ථාර සූත්‍රය"
    },
    {
      "number": 488,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi arahattaphalasacchikiriyāya paṭipanno hoti, tato mudutarehi anāgāmī hoti, tato mudutarehi anāgāmiphalasacchikiriyāya paṭipanno hoti, tato mudutarehi sakadāgāmī hoti, tato mudutarehi sakadāgāmiphalasacchikiriyāya paṭipanno hoti, tato mudutarehi sotāpanno hoti, tato mudutarehi sotāpattiphalasacchikiriyāya paṭipanno hoti. Yassa kho, bhikkhave, imāni pañcindriyāni sabbena sabbaṃ sabbathā sabbaṃ natthi, tamahaṃ ‘bāhiro puthujjanapakkhe ṭhito’ti vadāmī’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, there are these five faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom – these, monks, are the five faculties. Through the completeness and fullness of these five faculties, one becomes an Arahant. With those whose faculties are softer than that, one is practicing for the realization of the fruit of Arahantship. With those whose faculties are softer than that, one is a Non-returner. With those whose faculties are softer than that, one is practicing for the realization of the fruit of Non-returnership. With those whose faculties are softer than that, one is a Once-returner. With those whose faculties are softer than that, one is practicing for the realization of the fruit of Once-returnership. With those whose faculties are softer than that, one is a Stream-enterer. With those whose faculties are softer than that, one is practicing for the realization of the fruit of Stream-entry. Whoever, monks, does not possess these five faculties at all, in any way, in their entirety, him I declare to be an outsider, standing among the ordinary unenlightened folk.”",
      "sinhala": "භික්‍ෂූනි, මේ ඉන්ද්‍රියෝ පස් දෙනෙකි. කවර නම් පස් දෙනෙක් ද? සද්ධා ඉන්ද්‍රිය...පෙ...ප්‍රඥා ඉන්ද්‍රිය යි. භික්‍ෂූනි, මේවා ඉන්ද්‍රියෝ පස් දෙනා වේ. භික්‍ෂූනි, මේ පස් ඉන්ද්‍රියන්ගේ පූර්ණත්වය හා පරිපූර්ණත්වය හේතුවෙන් රහතන් වහන්සේ කෙනෙක් වේ. ඊට වඩා මඳක් මෘදු වූ (ඉන්ද්‍රියන්ගෙන්) රහත්ඵලය සාක්‍ෂාත් කර ගැනීම සඳහා පිළිපන් අයෙක් වේ. ඊට වඩා මඳක් මෘදු වූ (ඉන්ද්‍රියන්ගෙන්) අනාගාමී අයෙක් වේ. ඊට වඩා මඳක් මෘදු වූ (ඉන්ද්‍රියන්ගෙන්) අනාගාමී ඵලය සාක්‍ෂාත් කර ගැනීම සඳහා පිළිපන් අයෙක් වේ. ඊට වඩා මඳක් මෘදු වූ (ඉන්ද්‍රියන්ගෙන්) සකෘදාගාමී අයෙක් වේ. ඊට වඩා මඳක් මෘදු වූ (ඉන්ද්‍රියන්ගෙන්) සකෘදාගාමී ඵලය සාක්‍ෂාත් කර ගැනීම සඳහා පිළිපන් අයෙක් වේ. ඊට වඩා මඳක් මෘදු වූ (ඉන්ද්‍රියන්ගෙන්) සෝවාන් අයෙක් වේ. ඊට වඩා මඳක් මෘදු වූ (ඉන්ද්‍රියන්ගෙන්) සෝවාන් ඵලය සාක්‍ෂාත් කර ගැනීම සඳහා පිළිපන් අයෙක් වේ. භික්‍ෂූනි, යම් කෙනෙකු තුළ මේ පස් ඉන්ද්‍රියෝ සම්පූර්ණයෙන්ම, සියලු ආකාරයෙන්, කිසිදු ලෙසකින්ම නැති නම්, ඔහු බාහිරව පෘථග්ජන පක්‍ෂයට අයත් අයෙක් යැයි මම කියමි.",
      "paliTitle": "Paṭipannasuttaṃ",
      "englishTitle": "The Discourse on One Who Has Entered the Way",
      "sinhalaTitle": "පටිපන්න සූත්‍රය"
    },
    {
      "number": 489,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘‘Indriyasampanno, indriyasampanno’ti, bhante, vuccati. Kittāvatā nu kho, bhante, indriyasampanno hotī’’ti? ‘‘Idha, bhikkhu, bhikkhu saddhindriyaṃ bhāveti upasamagāmiṃ sambodhagāmiṃ, vīriyindriyaṃ bhāveti upasamagāmiṃ sambodhagāmiṃ, satindriyaṃ bhāveti upasamagāmiṃ sambodhagāmiṃ, samādhindriyaṃ bhāveti upasamagāmiṃ sambodhagāmiṃ, paññindriyaṃ bhāveti upasamagāmiṃ sambodhagāmiṃ. Ettāvatā kho, bhikkhu, bhikkhu indriyasampanno hotī’’ti. Navamaṃ.",
      "english": "Then a certain bhikkhu approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, that bhikkhu said to the Blessed One, “‘Endowed with the spiritual faculties, endowed with the spiritual faculties,’ Venerable Sir, it is said. To what extent, Venerable Sir, is one said to be endowed with the spiritual faculties?”\n\n“Here, bhikkhu, a bhikkhu cultivates the faculty of faith, leading to tranquility and full awakening. He cultivates the faculty of energy, leading to tranquility and full awakening. He cultivates the faculty of mindfulness, leading to tranquility and full awakening. He cultivates the faculty of concentration, leading to tranquility and full awakening. He cultivates the faculty of wisdom, leading to tranquility and full awakening. To this extent, bhikkhu, a bhikkhu is said to be endowed with the spiritual faculties.”",
      "sinhala": "එවිට එක්තරා භික්‍ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ භික්‍ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, 'ඉන්ද්‍රිය සම්පන්නයි, ඉන්ද්‍රිය සම්පන්නයි' යැයි කියනු ලැබේ. වහන්ස, කෙතරම් ප්‍රමාණයකින් භික්‍ෂුව ඉන්ද්‍රිය සම්පන්න වන්නේද?\"\n\n\"මහණ, මෙහිලා භික්‍ෂුව උපශමයටත්, සම්බෝධියටත් පමුණුවන ශ්‍රද්ධා ඉන්ද්‍රිය වඩයි. උපශමයටත්, සම්බෝධියටත් පමුණුවන වීර්ය ඉන්ද්‍රිය වඩයි. උපශමයටත්, සම්බෝධියටත් පමුණුවන සති ඉන්ද්‍රිය වඩයි. උපශමයටත්, සම්බෝධියටත් පමුණුවන සමාධි ඉන්ද්‍රිය වඩයි. උපශමයටත්, සම්බෝධියටත් පමුණුවන ප්‍රඥා ඉන්ද්‍රිය වඩයි. මහණ, මේ ප්‍රමාණයෙන් භික්‍ෂුව ඉන්ද්‍රිය සම්පන්න වන්නේය.\"",
      "paliTitle": "Sampannasuttaṃ",
      "englishTitle": "The Discourse on the Accomplished",
      "sinhalaTitle": "සම්පන්න සූත්‍රය"
    },
    {
      "number": 490,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dasamaṃ. Mudutaravaggo dutiyo. Tassuddānaṃ – Paṭilābho tayo saṃkhittā, vitthārā apare tayo; Paṭipanno ca sampanno [paṭipanno cūpasamo (syā. kaṃ. pī. ka.)], dasamaṃ āsavakkhayanti.",
      "english": "Bhikkhus, there are these five faculties. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. These, bhikkhus, are the five faculties. Through the cultivation and sustained development of these five faculties, bhikkhus, a bhikkhu, by the destruction of the taints, having realized for himself with direct knowledge the taintless liberation of mind and liberation by wisdom, enters and dwells therein in this very life.\n\nThe Tenth. The Chapter on the Less Gentle is the Second. Its Summary: 'Attainment' is one, three are 'abbreviated', and another three are 'expanded'; 'One who is practicing' and 'One who is accomplished'; the tenth is 'the destruction of taints'.",
      "sinhala": "‘‘භික්ෂූනි, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස? ශ්‍රද්ධා ඉන්ද්‍රිය...පෙ...ප්‍රඥා ඉන්ද්‍රියයි – භික්ෂූනි, මේ ඉන්ද්‍රියයන් පසයි. භික්ෂූනි, මේ ඉන්ද්‍රියයන් පස භාවිත කිරීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් භික්ෂුව ආශ්‍රවයන්ගේ ක්ෂය කිරීම හේතුවෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දැක්වෙන ධර්මය තුළදීම තමන් විසින්ම අභිඥාවෙන් සාක්ෂාත් කරගෙන අත්පත් කරගෙන වාසය කරයි.’’\nදහවැනි සූත්‍රයයි.\nමුදුතර වර්ගය දෙවැන්නයි.\nඑහි සූත්‍ර අනුක්‍රමණිකාව:\nපටිලාභ සූත්‍ර තුනක් සංක්ෂිප්තව,\nවිස්තර වශයෙන් තවත් තුනක්;\nපටිපන්න සහ සම්පන්න,\nදහවැන්න ආසවක්ඛය සූත්‍රයයි.",
      "paliTitle": "Āsavakkhayasuttaṃ",
      "englishTitle": "The Discourse on the Destruction of Taints",
      "sinhalaTitle": "ආසවක්ඛය සූත්‍රය"
    },
    {
      "number": 491,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ. Yāvakīvañcāhaṃ, bhikkhave, imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ [abhisambuddho paccaññāsiṃ (sī. syā. kaṃ.)]. Yato ca khvāhaṃ, bhikkhave, imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti [cetovimutti (sī. pī. ka.)], ayamantimā jāti, natthidāni punabbhavo’’’ti. Paṭhamaṃ.",
      "english": "Monks, these five faculties. Which five? The faculty of faith... and so on... the faculty of wisdom. As long as, monks, I did not directly know, as it really is, the origin, the passing away, the gratification, the danger, and the escape in regard to these five faculties, so long, monks, I did not declare myself to have attained unsurpassed perfect self-awakening in this world with its deities, Māras, and Brahmās, among this generation with its recluses and brahmins, its gods and humans.\n\nBut when, monks, I directly knew, as it really is, the origin, the passing away, the gratification, the danger, and the escape in regard to these five faculties, then, monks, I declared myself to have attained unsurpassed perfect self-awakening in this world with its deities, Māras, and Brahmās, among this generation with its recluses and brahmins, its gods and humans. And then knowledge and vision arose in me: ‘My liberation is unshakeable; this is my last birth; now there is no more renewed existence.’",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේවාය.\n\nමහණෙනි, මා විසින් යම්තාක් කල් මේ ඉන්ද්‍රියයන් පසෙහි හටගැනීම ද, නැවතීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද යථාභූත වශයෙන් අවබෝධ නොකළෙම් ද; මහණෙනි, ඒතාක් කල් දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත වූ, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූ, දෙව් මිනිසුන් සහිත වූ ලෝකයෙහි, ‘අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කරගත්තා වූ සම්‍යක් සම්බුද්ධයෙක්මි’ යැයි මා විසින් ප්‍රකාශ නොකළෙමි.\n\nමහණෙනි, යම් කලක මා විසින් මේ ඉන්ද්‍රියයන් පසෙහි හටගැනීම ද, නැවතීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද යථාභූත වශයෙන් අවබෝධ කළෙම් ද; මහණෙනි, එකල්හි දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත වූ, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූ, දෙව් මිනිසුන් සහිත වූ ලෝකයෙහි, ‘අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කරගත්තා වූ සම්‍යක් සම්බුද්ධයෙක්මි’ යැයි මා විසින් ප්‍රකාශ කළෙමි.\n\nතවද, ‘මාගේ විමුක්තිය කිසිලෙසකින්වත් නොසෙල්වෙන සුළුය, මේ මාගේ අවසාන උපතයි, දැන් නැවත භවයක් නැත’ යන ඥානය හා දර්ශනය මට පහළ විය.",
      "paliTitle": "Punabbhavasuttaṃ",
      "vagga": "Chaḷindriyavaggo",
      "englishTitle": "The Discourse on Rebirth",
      "sinhalaTitle": "පුනබ්භව සූත්‍රය",
      "vaggaEnglish": "The Chapter on the Six Faculties",
      "vaggaSinhala": "ඡළින්ද්‍රිය වර්ගය"
    },
    {
      "number": 492,
      "pali": "‘‘Tīṇimāni, bhikkhave, indriyāni. Katamāni tīṇi? Itthindriyaṃ, purisindriyaṃ, jīvitindriyaṃ – imāni kho, bhikkhave, tīṇi indriyānī’’ti. Dutiyaṃ.",
      "english": "Monks, there are these three faculties. Which three? The faculty of womanhood, the faculty of manhood, and the faculty of life—these, monks, are the three faculties.",
      "sinhala": "භික්‍ෂූනි, මේ ඉන්ද්‍රියෝ තුනකි. ඒ තුන කවරක්ද? ඉත්ථින්‍ද්‍රිය, පුරිසින්‍ද්‍රිය, ජීවිතින්‍ද්‍රිය යනුයි. භික්‍ෂූනි, සැබවින්ම මේවා ඒ ඉන්ද්‍රියෝ තුන වේ.",
      "paliTitle": "Jīvitindriyasuttaṃ",
      "englishTitle": "The Life Faculty Sutta",
      "sinhalaTitle": "ජීවිතින්ද්‍රිය සූත්‍රය"
    },
    {
      "number": 493,
      "pali": "‘‘Tīṇimāni, bhikkhave, indriyāni. Katamāni tīṇi? Anaññātaññassāmītindriyaṃ, aññindriyaṃ, aññātāvindriyaṃ – imāni kho, bhikkhave, tīṇi indriyānī’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, there are these three faculties. Which three? The faculty of 'I shall know the unknown', the faculty of final knowledge, and the faculty of one who has perfectly known – these, bhikkhus, are the three faculties.",
      "sinhala": "භික්ෂූනි, මේ ඉන්ද්‍රියයන් තුනකි. ඒ කවර තුනක්ද? නොදත් දේ දැනගන්නෙමි යන ප්‍රඥා ඉන්ද්‍රිය, දැනගැනීමෙන් යුක්ත වූ ප්‍රඥා ඉන්ද්‍රිය, මුළුමනින්ම දැනගත් ප්‍රඥා ඉන්ද්‍රියයි. භික්ෂූනි, මේවා එම ඉන්ද්‍රියයන් තුනයි.",
      "paliTitle": "Aññindriyasuttaṃ",
      "englishTitle": "The Faculty of Final Knowledge Sutta",
      "sinhalaTitle": "අඤ්ඤින්ද්‍රිය සූත්‍රය"
    },
    {
      "number": 494,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ samattā paripūrattā arahaṃ hoti, tato mudutarehi antarāparinibbāyī hoti, tato mudutarehi upahaccaparinibbāyī hoti, tato mudutarehi asaṅkhāraparinibbāyī hoti, tato mudutarehi sasaṅkhāraparinibbāyī hoti, tato mudutarehi uddhaṃsoto hoti akaniṭṭhagāmī, tato mudutarehi sakadāgāmī hoti, tato mudutarehi ekabījī [ekabīji (ka.)] hoti, tato mudutarehi kolaṃkolo hoti, tato mudutarehi sattakkhattuparamo hoti, tato mudutarehi dhammānusārī hoti, tato mudutarehi saddhānusārī hotī’’ti. Catutthaṃ.",
      "english": "Monks, there are these five spiritual faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom – these, monks, are the five spiritual faculties. By the completeness and perfection of these five spiritual faculties, one becomes an Arahant. With faculties milder than that, one becomes an 'Antarāparinibbāyī' (one who attains final Nibbāna in the interim). With faculties milder than that, one becomes an 'Upahaccaparinibbāyī' (one who attains final Nibbāna upon reaching the destination). With faculties milder than that, one becomes an 'Asaṅkhāraparinibbāyī' (one who attains final Nibbāna without much effort). With faculties milder than that, one becomes a 'Sasaṅkhāraparinibbāyī' (one who attains final Nibbāna with effort). With faculties milder than that, one becomes an 'Uddhaṃsoto akaniṭṭhagāmī' (one who flows upstream to the Akaniṭṭha realm). With faculties milder than that, one becomes a 'Sakadāgāmī' (once-returner). With faculties milder than that, one becomes an 'Ekabījī' (one-seeded). With faculties milder than that, one becomes a 'Kolaṃkolo' (family-to-family). With faculties milder than that, one becomes a 'Sattakkhattuparamo' (one who takes a maximum of seven more births). With faculties milder than that, one becomes a 'Dhammānusārī' (Dhamma-follower). With faculties milder than that, one becomes a 'Saddhānusārī' (faith-follower).",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේවායි. මහණෙනි, මේවා පංච ඉන්ද්‍රියෝ වෙති.\n\nමහණෙනි, මේ පංච ඉන්ද්‍රියයන්ගේ සම්පූර්ණත්වය හා පරිපූර්ණත්වය හේතුවෙන් රහත් වේ. ඊට වඩා මෘදු (අඩු දියුණු) වූ එම ඉන්ද්‍රියයන් ඇත්තා අන්තරාපරිනිබ්බායී වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා උපහච්චපරිනිබ්බායී වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා අසංඛාරපරිනිබ්බායී වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා සසංඛාරපරිනිබ්බායී වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා අකනිට්ඨගාමී වන උද්ධංසෝතෝ වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා සකදාගාමී වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා ඒකබීජී වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා කෝලංකෝලෝ වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා සත්තක්ඛත්තුපරමෝ වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා ධම්මානුසාරී වේ. ඊට වඩා මෘදු වූ (අඩු දියුණු) එම ඉන්ද්‍රියයන් ඇත්තා සද්ධානුසාරී වේ.",
      "paliTitle": "Ekabījīsuttaṃ",
      "englishTitle": "The One-Seeder Sutta",
      "sinhalaTitle": "ඒකබීජී සූත්‍රය"
    },
    {
      "number": 495,
      "pali": "‘‘Chayimāni, bhikkhave, indriyāni. Katamāni cha? Cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ, manindriyaṃ – imāni kho, bhikkhave, cha indriyānī’’ti. Pañcamaṃ.",
      "english": "Monks, there are these six faculties. Which six? The eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty, and the mind faculty. These, monks, are the six faculties.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් සයකි. ඒ කවර සයක්ද? ඇස් ඉන්ද්‍රිය, කන් ඉන්ද්‍රිය, නාස් ඉන්ද්‍රිය, දිව් ඉන්ද්‍රිය, කය ඉන්ද්‍රිය, මන ඉන්ද්‍රිය යන මේවායි. මහණෙනි, මේ ඉන්ද්‍රියයන් සයයි.",
      "paliTitle": "Suddhakasuttaṃ",
      "englishTitle": "The Simple Discourse",
      "sinhalaTitle": "සුද්ධක සූත්‍රය"
    },
    {
      "number": 496,
      "pali": "‘‘Chayimāni, bhikkhave, indriyāni. Katamāni cha? Cakkhundriyaṃ…pe… manindriyaṃ. Yato kho, bhikkhave, ariyasāvako imesaṃ channaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these six sense faculties. Which are the six? The eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty, and the mind faculty. Monks, when a noble disciple truly comprehends, as they really are, the origin, the cessation, the gratification, the danger, and the escape from these six sense faculties – that noble disciple, Monks, is called a stream-enterer, one who is not subject to downfall, and is certain to attain full enlightenment.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයෝ සයකි. කවර ඒවා සයද? ඇසේ ඉන්ද්‍රිය, කනේ ඉන්ද්‍රිය, නාසයේ ඉන්ද්‍රිය, දිවේ ඉන්ද්‍රිය, කයේ ඉන්ද්‍රිය, මනසේ ඉන්ද්‍රිය යන ඉන්ද්‍රියයෝ වෙති. මහණෙනි, යම් හෙයකින් ආර්ය​ශ්‍රා‍වකයා මේ ඉන්ද්‍රියයන් සයේ හටගැනීමත්, නැතිවීමත්, ආශ්වාදයත්, ආදීනවයත්, නිස්සරණයත් ඇති සැටියෙන් අවබෝධ කරන්නේද, මහණෙනි, මේ ආර්ය​ශ්‍රා‍වකයා සෝවාන් වූවෙක්, අපායට නොවැටෙන ස්වභාව ඇත්තෙක්, නියත වූවෙක්, සම්බෝධිය පරම කොට ඇත්තෙක් යැයි කියනු ලැබේ.",
      "paliTitle": "Sotāpannasuttaṃ",
      "englishTitle": "The Discourse on the Stream-Enterer",
      "sinhalaTitle": "සෝතාපන්න සූත්‍රය"
    },
    {
      "number": 497,
      "pali": "‘‘Chayimāni, bhikkhave, indriyāni. Katamāni cha? Cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ, manindriyaṃ. Yato kho, bhikkhave, bhikkhu imesaṃ channaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto hoti – ayaṃ vuccati, bhikkhave, ‘bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto’’’ti. Sattamaṃ.",
      "english": "“Monks, there are these six faculties. Which six? The eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty, and the mind faculty. But when, monks, a bhikkhu, having truly understood the origin, the passing away, the gratification, the danger, and the escape in regard to these six faculties, becomes liberated without clinging – such a bhikkhu, monks, is called a perfected one, one whose defilements are destroyed, one who has lived the holy life, one who has done what needed to be done, one who has laid down the burden, one who has attained the true aim, one whose fetters to existence are utterly destroyed, one truly liberated through perfect wisdom.”",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් හයකි. කවර ඒවා හයක්ද? චක්ඛුන්ද්‍රිය, සෝතින්ද්‍රිය, ඝානින්ද්‍රිය, ජිව්හින්ද්‍රිය, කායින්ද්‍රිය, මනින්ද්‍රිය යන ඉන්ද්‍රියයෝය. මහණෙනි, යම් කලෙක මහණෙක් මේ ඉන්ද්‍රියයන් හයෙහි හටගැනීමද, නැතිවීමද, ආශ්වාදයද, ආදීනවයද, නිස්සරණයද, ඇති සැටියෙන් අවබෝධ කොට, උපාදාන රහිතව විමුක්ත වේද – මහණෙනි, ඔහු ‘අරහත් වූ, ක්ෂීණාශ්‍රව වූ, බඹසර වැස නිම කළ, කළ යුතු සියල්ල කළ, බර බහා තැබූ, තමන්ගේ උතුම් පරමාර්ථය අවබෝධ කරගත්, භව සංයෝජන මුළුමනින්ම ක්ෂය කළ, සම්‍යක් ඥානයෙන් විමුක්ත වූ භික්ෂුවක්’ යැයි කියනු ලැබේ.",
      "paliTitle": "Arahantasuttaṃ",
      "englishTitle": "The Discourse on the Arahants",
      "sinhalaTitle": "අරහන්ත සූත්‍රය"
    },
    {
      "number": 498,
      "pali": "‘‘Chayimāni, bhikkhave, indriyāni. Katamāni cha? Cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ, manindriyaṃ. Yāvakīvañcāhaṃ, bhikkhave, imesaṃ channaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassa maṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Yato ca khvāhaṃ, bhikkhave, imesaṃ channaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti, ayamantimā jāti, natthidāni punabbhavo’’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these six faculties. Which six? The eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty, and the mind faculty. As long as I did not directly comprehend, Monks, as it truly is, the origination, the passing away, the gratification, the danger, and the escape in relation to these six faculties, so long, Monks, I did not declare myself to have fully awakened to the unsurpassed perfect self-awakening in this world with its deities, Māras, and Brahmās, among the generation of ascetics and brahmins, with its deities and humans. But when, Monks, I did directly comprehend, as it truly is, the origination, the passing away, the gratification, the danger, and the escape in relation to these six faculties, then, Monks, I declared myself to have fully awakened to the unsurpassed perfect self-awakening in this world with its deities, Māras, and Brahmās, among the generation of ascetics and brahmins, with its deities and humans. And then, knowledge and vision arose in me: ‘My liberation is unshakeable; this is my final birth; there is now no further renewed existence.’",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් සයකි. ඒ කවර සය ද යත්: චක්ඛුන්ද්‍රිය, සෝතින්ද්‍රිය, ඝානින්ද්‍රිය, ජිව්හින්ද්‍රිය, කායින්ද්‍රිය, මනින්ද්‍රිය යන ඉන්ද්‍රියයන් ය. මහණෙනි, යම්තාක් කල් මම මේ ඉන්ද්‍රියයන් සයේ හටගැනීම ද, විනාශය ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදැක්කෙම් ද, මහණෙනි, එකල්හි මම දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝකයෙහි 'අනුත්තර වූ සම්මාසම්බෝධියට පැමිණියෙමි' යි ප්‍රතිඥා නොකළෙමි. මහණෙනි, යම් හෙයකින් මම මේ ඉන්ද්‍රියයන් සයේ හටගැනීම ද, විනාශය ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දැක්කෙම් ද, මහණෙනි, එකල්හි මම දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝකයෙහි 'අනුත්තර වූ සම්මාසම්බෝධියට පැමිණියෙමි' යි ප්‍රතිඥා කළෙමි. මා හට මේ ඥාන දර්ශනය පහළ විය: 'මාගේ විමුක්තිය අචලය, මෙය අන්තිම ඉපදීමයි, දැන් පුනර්භවයක් නැත' යනුවෙනි.",
      "paliTitle": "Sambuddhasuttaṃ",
      "englishTitle": "The Discourse on the Fully Enlightened One",
      "sinhalaTitle": "සම්බුද්ධ සූත්‍රය"
    },
    {
      "number": 499,
      "pali": "‘‘Chayimāni, bhikkhave, indriyāni. Katamāni cha? Cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ, manindriyaṃ. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā imesaṃ channaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti, na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca panete āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti’’. ‘‘Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā imesaṃ channaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānanti, te kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Navamaṃ.",
      "english": "Monks, there are these six faculties. Which six? The eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty, and the mind faculty. Monks, whatever ascetics or brahmins do not truly understand, as it actually is, the origin, the cessation, the gratification, the danger, and the escape regarding these six faculties, those, Monks, are not considered by me to be true ascetics among ascetics or true brahmins among brahmins. Nor do those venerable ones, having directly known and realized for themselves in this very life the goal of asceticism or the goal of the holy life, attain and dwell therein.\n\nBut, Monks, whatever ascetics or brahmins do truly understand, as it actually is, the origin, the cessation, the gratification, the danger, and the escape regarding these six faculties, those, Monks, are considered by me to be true ascetics among ascetics and true brahmins among brahmins. And those venerable ones, having directly known and realized for themselves in this very life the goal of asceticism and the goal of the holy life, attain and dwell therein.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් සයකි. කවර සයක්ද? චක්ඛුන්ද්‍රිය, සෝතින්ද්‍රිය, ඝානින්ද්‍රිය, ජිව්හින්ද්‍රිය, කායින්ද්‍රිය, මනින්ද්‍රිය යන සයයි. මහණෙනි, යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ ඉන්ද්‍රියයන් සයේ ඇතිවීමද, නැතිවීමද, ආස්වාදයද, ආදීනවයද, නිස්සරණයද යථාභූතව නොදනිත් නම්, මා විසින් ඔවුහු ශ්‍රමණයන් අතර ශ්‍රමණ යයිද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණ යයිද නොසලකනු ලබත්. තවද, ඒ ආයුෂ්මත්හු ශ්‍රමණයන්ගේ ප්‍රයෝජනය හෝ බ්‍රාහ්මණයන්ගේ ප්‍රයෝජනය හෝ මේ ජීවිතයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය නොකරත්.\n\nමහණෙනි, යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ ඉන්ද්‍රියයන් සයේ ඇතිවීමද, නැතිවීමද, ආස්වාදයද, ආදීනවයද, නිස්සරණයද යථාභූතව දනිත් නම්, මා විසින් ඔවුහු ශ්‍රමණයන් අතර ශ්‍රමණ යයිද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණ යයිද සලකනු ලබත්. තවද, ඒ ආයුෂ්මත්හු ශ්‍රමණයන්ගේ ප්‍රයෝජනයද, බ්‍රාහ්මණයන්ගේ ප්‍රයෝජනයද මේ ජීවිතයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරති.",
      "paliTitle": "Paṭhamasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The First Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "පළමු සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 500,
      "pali": "‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā cakkhundriyaṃ nappajānanti, cakkhundriyasamudayaṃ nappajānanti, cakkhundriyanirodhaṃ nappajānanti, cakkhundriyanirodhagāminiṃ paṭipadaṃ nappajānanti; sotindriyaṃ…pe… ghānindriyaṃ…pe… jivhindriyaṃ…pe… kāyindriyaṃ…pe… manindriyaṃ nappajānanti, manindriyasamudayaṃ nappajānanti, manindriyanirodhaṃ nappajānanti, manindriyanirodhagāminiṃ paṭipadaṃ nappajānanti. Na me te, bhikkhave…pe… sayaṃ abhiññā sacchikatvā upasampajja viharanti. ‘‘Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā cakkhundriyaṃ pajānanti, cakkhundriyasamudayaṃ pajānanti, cakkhundriyanirodhaṃ pajānanti, cakkhundriyanirodhagāminiṃ paṭipadaṃ pajānanti, sotindriyaṃ…pe… ghānindriyaṃ…pe… jivhindriyaṃ…pe… kāyindriyaṃ…pe… manindriyaṃ pajānanti, manindriyasamudayaṃ pajānanti, manindriyanirodhaṃ pajānanti, manindriyanirodhagāminiṃ paṭipadaṃ pajānanti, te kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Dasamaṃ. Chaḷindriyavaggo tatiyo. Tassuddānaṃ – Punabbhavo jīvitaññāya, ekabījī ca suddhakaṃ; Soto arahasambuddho, dve ca samaṇabrāhmaṇāti.",
      "english": "Indeed, bhikkhus, whatever recluses or brahmins do not understand the eye faculty, do not understand the origin of the eye faculty, do not understand the cessation of the eye faculty, and do not understand the path leading to the cessation of the eye faculty;\nwho do not understand the ear faculty, do not understand the origin of the ear faculty, do not understand the cessation of the ear faculty, and do not understand the path leading to the cessation of the ear faculty;\nwho do not understand the nose faculty, do not understand the origin of the nose faculty, do not understand the cessation of the nose faculty, and do not understand the path leading to the cessation of the nose faculty;\nwho do not understand the tongue faculty, do not understand the origin of the tongue faculty, do not understand the cessation of the tongue faculty, and do not understand the path leading to the cessation of the tongue faculty;\nwho do not understand the body faculty, do not understand the origin of the body faculty, do not understand the cessation of the body faculty, and do not understand the path leading to the cessation of the body faculty;\nwho do not understand the mind faculty, do not understand the origin of the mind faculty, do not understand the cessation of the mind faculty, and do not understand the path leading to the cessation of the mind faculty—\nSuch venerable ones, bhikkhus, are not regarded by me as recluses among recluses, nor as brahmins among brahmins; nor do they, having directly known and realized for themselves in this very life, attain and dwell in the goal of recluseship and the goal of brahminhood.\n\nBut whatever recluses or brahmins, bhikkhus, understand the eye faculty, understand the origin of the eye faculty, understand the cessation of the eye faculty, and understand the path leading to the cessation of the eye faculty;\nwho understand the ear faculty, understand the origin of the ear faculty, understand the cessation of the ear faculty, and understand the path leading to the cessation of the ear faculty;\nwho understand the nose faculty, understand the origin of the nose faculty, understand the cessation of the nose faculty, and understand the path leading to the cessation of the nose faculty;\nwho understand the tongue faculty, understand the origin of the tongue faculty, understand the cessation of the tongue faculty, and understand the path leading to the cessation of the tongue faculty;\nwho understand the body faculty, understand the origin of the body faculty, understand the cessation of the body faculty, and understand the path leading to the cessation of the body faculty;\nwho understand the mind faculty, understand the origin of the mind faculty, understand the cessation of the mind faculty, and understand the path leading to the cessation of the mind faculty—\nSuch venerable ones, bhikkhus, are regarded by me as recluses among recluses, and as brahmins among brahmins; and they, having directly known and realized for themselves in this very life, attain and dwell in the goal of recluseship and the goal of brahminhood.\n\nThe Tenth. The Chapter on the Six Faculties is the third. Its summary: Renewed existence, Understanding life, One-seeder, Pure, Stream-enterer, Arahant, Fully Enlightened One, and the two Recluses and Brahmins.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ඇස් ඉන්ද්‍රිය (චක්ඛුන්ද්‍රිය) නොදනිත් ද, ඇස් ඉන්ද්‍රිය හටගැනීම නොදනිත් ද, ඇස් ඉන්ද්‍රිය නැතිවීම නොදනිත් ද, ඇස් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් ද; කන් ඉන්ද්‍රිය (සෝතින්ද්‍රිය) නොදනිත් ද, කන් ඉන්ද්‍රිය හටගැනීම නොදනිත් ද, කන් ඉන්ද්‍රිය නැතිවීම නොදනිත් ද, කන් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් ද; නාස් ඉන්ද්‍රිය (ඝානින්ද්‍රිය) නොදනිත් ද, නාස් ඉන්ද්‍රිය හටගැනීම නොදනිත් ද, නාස් ඉන්ද්‍රිය නැතිවීම නොදනිත් ද, නාස් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් ද; දිව් ඉන්ද්‍රිය (ජිව්හින්ද්‍රිය) නොදනිත් ද, දිව් ඉන්ද්‍රිය හටගැනීම නොදනිත් ද, දිව් ඉන්ද්‍රිය නැතිවීම නොදනිත් ද, දිව් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් ද; කය ඉන්ද්‍රිය (කායින්ද්‍රිය) නොදනිත් ද, කය ඉන්ද්‍රිය හටගැනීම නොදනිත් ද, කය ඉන්ද්‍රිය නැතිවීම නොදනිත් ද, කය ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් ද; මනෝ ඉන්ද්‍රිය (මනින්ද්‍රිය) නොදනිත් ද, මනෝ ඉන්ද්‍රිය හටගැනීම නොදනිත් ද, මනෝ ඉන්ද්‍රිය නැතිවීම නොදනිත් ද, මනෝ ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් ද; භික්ෂූන් වහන්ස, මා විසින් ඔවුහු ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද නොසලකනු ලබත්. එමෙන්ම, ඒ ආයුෂ්මත්හු මේ දැක්වෙන ධර්මයෙහි ම තමන් විසින්ම විශේෂ ඥානයෙන් (අභිඥාවෙන්) අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, පසක් කොට ශ්‍රමණත්වයේ අර්ථය ද බ්‍රාහ්මණත්වයේ අර්ථය ද ලබා වාසය නොකරත්.\n\nභික්ෂූන් වහන්ස, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ඇස් ඉන්ද්‍රිය (චක්ඛුන්ද්‍රිය) දනිත් ද, ඇස් ඉන්ද්‍රිය හටගැනීම දනිත් ද, ඇස් ඉන්ද්‍රිය නැතිවීම දනිත් ද, ඇස් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව දනිත් ද; කන් ඉන්ද්‍රිය (සෝතින්ද්‍රිය) දනිත් ද, කන් ඉන්ද්‍රිය හටගැනීම දනිත් ද, කන් ඉන්ද්‍රිය නැතිවීම දනිත් ද, කන් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව දනිත් ද; නාස් ඉන්ද්‍රිය (ඝානින්ද්‍රිය) දනිත් ද, නාස් ඉන්ද්‍රිය හටගැනීම දනිත් ද, නාස් ඉන්ද්‍රිය නැතිවීම දනිත් ද, නාස් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව දනිත් ද; දිව් ඉන්ද්‍රිය (ජිව්හින්ද්‍රිය) දනිත් ද, දිව් ඉන්ද්‍රිය හටගැනීම දනිත් ද, දිව් ඉන්ද්‍රිය නැතිවීම දනිත් ද, දිව් ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව දනිත් ද; කය ඉන්ද්‍රිය (කායින්ද්‍රිය) දනිත් ද, කය ඉන්ද්‍රිය හටගැනීම දනිත් ද, කය ඉන්ද්‍රිය නැතිවීම දනිත් ද, කය ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව දනිත් ද; මනෝ ඉන්ද්‍රිය (මනින්ද්‍රිය) දනිත් ද, මනෝ ඉන්ද්‍රිය හටගැනීම දනිත් ද, මනෝ ඉන්ද්‍රිය නැතිවීම දනිත් ද, මනෝ ඉන්ද්‍රිය නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව දනිත් ද; භික්ෂූන් වහන්ස, මා විසින් ඒ ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද සලකනු ලබත්. එමෙන්ම, ඒ ආයුෂ්මත්හු මේ දැක්වෙන ධර්මයෙහි ම තමන් විසින්ම විශේෂ ඥානයෙන් (අභිඥාවෙන්) අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, පසක් කොට ශ්‍රමණත්වයේ අර්ථය ද බ්‍රාහ්මණත්වයේ අර්ථය ද ලබා වාසය කරත්.\n\nදසවැනි සූත්‍රයයි. ඡළින්ද්‍රිය වග්ගය තෙවැනියි. එහි සාරාංශය මෙසේය:\nපුණබ්භව, ජීවිතඤ්ඤාය, එකබීජී ද, සුද්ධක; සෝත, අරහසම්බුද්ධ, ශ්‍රමණබ්‍රාහ්මණ සූත්‍ර දෙකයි.",
      "paliTitle": "Dutiyasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The Second Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "දෙවන සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 501,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ – imāni kho, bhikkhave, pañcindriyānī’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of physical pleasure, the faculty of physical pain, the faculty of mental well-being, the faculty of mental distress, and the faculty of equanimity – these, monks, are the five faculties.",
      "sinhala": "භික්ෂූණි, මේ ඉන්‍ද්‍රියෝ පසකි. කවරේද ඒ පස? එනම්, සුඛේන්‍ද්‍රිය, දුක්ඛේන්‍ද්‍රිය, සෝමනස්සින්‍ද්‍රිය, දෝමනස්සින්‍ද්‍රිය, උපේක්ඛින්‍ද්‍රිය යන ඉන්‍ද්‍රිය ධර‍්මයෝය. භික්ෂූණි, මේ පස් ඉන්‍ද්‍රිය ධර‍්මයෝම වෙති.",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": "Sukhindriyavaggo",
      "englishTitle": "The Simple Discourse (or Discourse on Purity)",
      "sinhalaTitle": "සුද්ධික සූත්‍රය",
      "vaggaEnglish": "The Chapter on the Faculty of Pleasure",
      "vaggaSinhala": "සුඛින්ද්‍රිය වර්ගය"
    },
    {
      "number": 502,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. Yato kho, bhikkhave, ariyasāvako imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti. Dutiyaṃ.",
      "english": "There are these five faculties, bhikkhus. Which five? The faculty of pleasure, the faculty of pain, the faculty of mental joy, the faculty of mental distress, and the faculty of equanimity. When, bhikkhus, a noble disciple truly understands the origin, the disappearance, the gratification, the danger, and the escape from these five faculties as they actually are, this noble disciple, bhikkhus, is called a stream-entrant, one not subject to falling into states of woe, assured, and bound for full enlightenment.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පසකි. කවරක්ද ඒ පස? ඒවා නම්, සුඛේන්ද්‍රිය, දුක්ඛේන්ද්‍රිය, සෝමනස්සින්ද්‍රිය, දෝමනස්සින්ද්‍රිය, උපේක්ඛින්ද්‍රිය යි. මහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවකයා මේ පඤ්ච ඉන්ද්‍රියයන්ගේ හටගැනීම ද, නැතිවීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාභූතව ප්‍රඥාවෙන් දකී ද; මහණෙනි, මේ ආර්ය ශ්‍රාවකයා සෝතාපන්න කෙනෙක් යැයි ද, හීනගතිවලට නොවැටෙන ස්වභාවය ඇති කෙනෙක් යැයි ද, නිශ්චිත වශයෙන් සම්බෝධියට පැමිණෙන කෙනෙක් යැයි ද, සම්බෝධිය පරම කොට ඇති කෙනෙක් යැයි ද කියනු ලැබේ.",
      "paliTitle": "Sotāpannasuttaṃ",
      "englishTitle": "The Discourse on the Stream-Enterer",
      "sinhalaTitle": "සෝතාපන්න සූත්‍රය"
    },
    {
      "number": 503,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. Yato kho, bhikkhave, bhikkhu imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto hoti – ayaṃ vuccati, bhikkhave, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto’’ti. Tatiyaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of pleasure, the faculty of pain, the faculty of mental joy, the faculty of mental distress, and the faculty of equanimity. When, monks, a monk, having truly understood the origin, the passing away, the gratification, the danger, and the escape from these five faculties, is liberated without clinging – this monk, monks, is called an Arahant, one whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who has laid down the burden, who has attained their own true goal, whose fetters of existence are utterly destroyed, one who is rightly liberated through perfect knowledge.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස? සුඛේන්ද්‍රිය, දුක්ඛේන්ද්‍රිය, සෝමනස්සෙන්ද්‍රිය, දෝමනස්සෙන්ද්‍රිය, උපේක්ඛේන්ද්‍රිය යන මේවාය. භික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් මේ ඉන්ද්‍රියයන් පසෙහි හටගැනීමත්, නැතිවීමත්, ආශ්වාදයත්, ආදීනවයත්, එයින් නිස්සරණයත් (මිදීමත්) ඇති සැටියෙන් අවබෝධ කරගෙන උපාදානයෙන් තොරව (කිසිවකට නොඇලී) විමුක්ත වේද, භික්ෂූන් වහන්ස, මේ භික්ෂුව අරහත්, ක්ෂීණාශ්‍රව, බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කළ, කළයුතු සියල්ල කළ, දුක නමැති බර බැහැර කළ, තමන්ගේ පරමාර්ථය සාක්ෂාත් කරගත්, භව සංයෝජන සියල්ල ප්‍රහීණ කළ, සම්‍යක් ප්‍රඥාවෙන් විමුක්ත වූයේයැයි කියනු ලැබේ.",
      "paliTitle": "Arahantasuttaṃ",
      "englishTitle": "The Discourse on the Arahants",
      "sinhalaTitle": "අරහන්ත සූත්‍රය"
    },
    {
      "number": 504,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti, na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca panete āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. ‘‘Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ indriyānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānanti, te kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Catutthaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of pleasure, the faculty of pain, the faculty of mental joy, the faculty of mental distress, and the faculty of equanimity. Monks, any recluses or brahmins who do not understand as it actually is the origin, the cessation, the gratification, the drawback, and the escape from these five faculties – such recluses or brahmins are not reckoned by me as recluses among recluses, nor as brahmins among brahmins. Nor do these venerable ones realize for themselves with direct knowledge in this very life the goal of recluseship or the goal of brahminhood, and dwell having attained it.\n\nBut, monks, any recluses or brahmins who do understand as it actually is the origin, the cessation, the gratification, the drawback, and the escape from these five faculties – such recluses or brahmins are reckoned by me as recluses among recluses, and as brahmins among brahmins. And these venerable ones realize for themselves with direct knowledge in this very life the goal of recluseship and the goal of brahminhood, and dwell having attained it.",
      "sinhala": "භික්ෂූණි, මේ ඉන්ද්‍රියයන් පහකි. ඒ කවර පහක්ද? සුඛෙන්ද්‍රිය, දුක්ඛෙන්ද්‍රිය, සෝමනස්සෙන්ද්‍රිය, දෝමනස්සෙන්ද්‍රිය, උපේක්ඛෙන්ද්‍රිය යන ඉන්ද්‍රියන්ය. භික්ෂූණි, යම්කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ පඤ්ච ඉන්ද්‍රියයන්ගේ හටගැනීම ද, නැතිවීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාර්ථය පරිදි නොදනිත්ද; භික්ෂූණි, ඔවුහු මා විසින් ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස හෝ බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස හෝ සම්මත නොවෙති. ඒ පින්වත්හු මෙලොවදීම ශ්‍රමණත්වයේ අර්ථය හෝ බ්‍රාහ්මණත්වයේ අර්ථය හෝ තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය නොකරති.\n\nභික්ෂූණි, යම්කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ පඤ්ච ඉන්ද්‍රියයන්ගේ හටගැනීම ද, නැතිවීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාර්ථය පරිදි දනිත්ද; භික්ෂූණි, ඔවුහු මා විසින් ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද සම්මත වෙති. ඒ පින්වත්හු මෙලොවදීම ශ්‍රමණත්වයේ අර්ථය ද බ්‍රාහ්මණත්වයේ අර්ථය ද තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරති.",
      "paliTitle": "Paṭhamasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The First Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "පළමු සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 505,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā sukhindriyaṃ nappajānanti, sukhindriyasamudayaṃ nappajānanti, sukhindriyanirodhaṃ nappajānanti, sukhindriyanirodhagāminiṃ paṭipadaṃ nappajānanti; dukkhindriyaṃ nappajānanti…pe… somanassindriyaṃ nappajānanti…pe… domanassindriyaṃ nappajānanti …pe… upekkhindriyaṃ nappajānanti, upekkhindriyasamudayaṃ nappajānanti, upekkhindriyanirodhaṃ nappajānanti, upekkhindriyanirodhagāminiṃ paṭipadaṃ nappajānanti; na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca panete āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. ‘‘Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā sukhindriyaṃ pajānanti, sukhindriyasamudayaṃ pajānanti, sukhindriyanirodhaṃ pajānanti, sukhindriyanirodhagāminiṃ paṭipadaṃ pajānanti; dukkhindriyaṃ pajānanti…pe… somanassindriyaṃ pajānanti… domanassindriyaṃ pajānanti… upekkhindriyaṃ pajānanti, upekkhindriyasamudayaṃ pajānanti, upekkhindriyanirodhaṃ pajānanti, upekkhindriyanirodhagāminiṃ paṭipadaṃ pajānanti, te ca kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Pañcamaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of pleasure, the faculty of pain, the faculty of joy, the faculty of distress, and the faculty of equanimity. Monks, whatever recluses or brahmins do not understand the faculty of pleasure, do not understand the origin of the faculty of pleasure, do not understand the cessation of the faculty of pleasure, do not understand the path leading to the cessation of the faculty of pleasure; do not understand the faculty of pain, do not understand the origin of the faculty of pain, do not understand the cessation of the faculty of pain, do not understand the path leading to the cessation of the faculty of pain; do not understand the faculty of joy, do not understand the origin of the faculty of joy, do not understand the cessation of the faculty of joy, do not understand the path leading to the cessation of the faculty of joy; do not understand the faculty of distress, do not understand the origin of the faculty of distress, do not understand the cessation of the faculty of distress, do not understand the path leading to the cessation of the faculty of distress; do not understand the faculty of equanimity, do not understand the origin of the faculty of equanimity, do not understand the cessation of the faculty of equanimity, do not understand the path leading to the cessation of the faculty of equanimity; such recluses or brahmins, Monks, are not considered true recluses among recluses, nor true brahmins among brahmins. Nor do these venerable ones, having realized for themselves through direct knowledge, attain and abide in the goal of recluseship or the goal of brahminhood in this very life.\n\nHowever, Monks, whatever recluses or brahmins understand the faculty of pleasure, understand the origin of the faculty of pleasure, understand the cessation of the faculty of pleasure, understand the path leading to the cessation of the faculty of pleasure; understand the faculty of pain, understand the origin of the faculty of pain, understand the cessation of the faculty of pain, understand the path leading to the cessation of the faculty of pain; understand the faculty of joy, understand the origin of the faculty of joy, understand the cessation of the faculty of joy, understand the path leading to the cessation of the faculty of joy; understand the faculty of distress, understand the origin of the faculty of distress, understand the cessation of the faculty of distress, understand the path leading to the cessation of the faculty of distress; understand the faculty of equanimity, understand the origin of the faculty of equanimity, understand the cessation of the faculty of equanimity, understand the path leading to the cessation of the faculty of equanimity; such recluses or brahmins, Monks, are truly considered recluses among recluses and brahmins among brahmins. And these venerable ones, having realized for themselves through direct knowledge, attain and abide in the goal of recluseship and the goal of brahminhood in this very life.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පසකි. කවරේද ඒ පස? ඒවා නම්, සුඛේන්ද්‍රිය, දුක්ඛේන්ද්‍රිය, සෝමනස්සින්ද්‍රිය, දෝමනස්සින්ද්‍රිය, උපේක්ඛින්ද්‍රිය යන ඉන්ද්‍රියෝයි. මහණෙනි, යම්කිසි ශ්‍රමණ‍ කෙනෙක් හෝ බ්‍රාහ්මණයෝ හෝ සුඛේන්ද්‍රිය නොදනිත් නම්, සුඛේන්ද්‍රියෙහි හටගැනීම නොදනිත් නම්, සුඛේන්ද්‍රියෙහි නිරෝධය නොදනිත් නම්, සුඛේන්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් නම්; දුක්ඛේන්ද්‍රිය නොදනිත් නම්, දුක්ඛේන්ද්‍රියෙහි හටගැනීම නොදනිත් නම්, දුක්ඛේන්ද්‍රියෙහි නිරෝධය නොදනිත් නම්, දුක්ඛේන්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් නම්; සෝමනස්සින්ද්‍රිය නොදනිත් නම්, සෝමනස්සින්ද්‍රියෙහි හටගැනීම නොදනිත් නම්, සෝමනස්සින්ද්‍රියෙහි නිරෝධය නොදනිත් නම්, සෝමනස්සින්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් නම්; දෝමනස්සින්ද්‍රිය නොදනිත් නම්, දෝමනස්සින්ද්‍රියෙහි හටගැනීම නොදනිත් නම්, දෝමනස්සින්ද්‍රියෙහි නිරෝධය නොදනිත් නම්, දෝමනස්සින්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් නම්; උපේක්ඛින්ද්‍රිය නොදනිත් නම්, උපේක්ඛින්ද්‍රියෙහි හටගැනීම නොදනිත් නම්, උපේක්ඛින්ද්‍රියෙහි නිරෝධය නොදනිත් නම්, උපේක්ඛින්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව නොදනිත් නම්; මහණෙනි, ඒ ශ්‍රමණයන් හෝ බ්‍රාහ්මණයන් හෝ ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද මා විසින් නොපිළිගනු ලැබේ. එම ආයුෂ්මතුන් විසින් මේ ආත්මභාවයේදීම තමන්ගේ උසස් ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, ශ්‍රමණභාවයේ ඵලය හෝ බ්‍රහ්මචරියාවේ ඵලය සාක්ෂාත් කොට වාසය නොකරති.\n\nමහණෙනි, යම්කිසි ශ්‍රමණ‍ කෙනෙක් හෝ බ්‍රාහ්මණයෝ හෝ සුඛේන්ද්‍රිය දනිත් නම්, සුඛේන්ද්‍රියෙහි හටගැනීම දනිත් නම්, සුඛේන්ද්‍රියෙහි නිරෝධය දනිත් නම්, සුඛේන්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව දනිත් නම්; දුක්ඛේන්ද්‍රිය දනිත් නම්, දුක්ඛේන්ද්‍රියෙහි හටගැනීම දනිත් නම්, දුක්ඛේන්ද්‍රියෙහි නිරෝධය දනිත් නම්, දුක්ඛේන්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව දනිත් නම්; සෝමනස්සින්ද්‍රිය දනිත් නම්, සෝමනස්සින්ද්‍රියෙහි හටගැනීම දනිත් නම්, සෝමනස්සින්ද්‍රියෙහි නිරෝධය දනිත් නම්, සෝමනස්සින්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව දනිත් නම්; දෝමනස්සින්ද්‍රිය දනිත් නම්, දෝමනස්සින්ද්‍රියෙහි හටගැනීම දනිත් නම්, දෝමනස්සින්ද්‍රියෙහි නිරෝධය දනිත් නම්, දෝමනස්සින්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව දනිත් නම්; උපේක්ඛින්ද්‍රිය දනිත් නම්, උපේක්ඛින්ද්‍රියෙහි හටගැනීම දනිත් නම්, උපේක්ඛින්ද්‍රියෙහි නිරෝධය දනිත් නම්, උපේක්ඛින්ද්‍රියෙහි නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව දනිත් නම්; මහණෙනි, ඒ ශ්‍රමණයන් හෝ බ්‍රාහ්මණයන් හෝ ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද මා විසින් පිළිගනු ලැබේ. එම ආයුෂ්මතුන් විසින් මේ ආත්මභාවයේදීම තමන්ගේ උසස් ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, ශ්‍රමණභාවයේ ඵලය ද බ්‍රහ්මචරියාවේ ඵලය ද සාක්ෂාත් කොට වාසය කරති.",
      "paliTitle": "Dutiyasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The Second Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "දෙවන සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 506,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. ‘‘Katamañca, bhikkhave, sukhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ sukhaṃ, kāyikaṃ sātaṃ, kāyasamphassajaṃ sukhaṃ sātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, sukhindriyaṃ. ‘‘Katamañca, bhikkhave, dukkhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ dukkhaṃ, kāyikaṃ asātaṃ, kāyasamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, dukkhindriyaṃ. ‘‘Katamañca, bhikkhave, somanassindriyaṃ? Yaṃ kho, bhikkhave, cetasikaṃ sukhaṃ, cetasikaṃ sātaṃ, manosamphassajaṃ sukhaṃ sātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, somanassindriyaṃ. ‘‘Katamañca, bhikkhave, domanassindriyaṃ? Yaṃ kho, bhikkhave, cetasikaṃ dukkhaṃ, cetasikaṃ asātaṃ, manosamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, domanassindriyaṃ. ‘‘Katamañca, bhikkhave, upekkhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ vā cetasikaṃ vā nevasātaṃ nāsātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, upekkhindriyaṃ. Imāni kho, bhikkhave, pañcindriyānī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of pleasure, the faculty of pain, the faculty of mental joy, the faculty of mental distress, and the faculty of equanimity.\n\nAnd what, monks, is the faculty of pleasure? That which, monks, is bodily pleasure, bodily agreeableness, a feeling of pleasure and agreeableness born of bodily contact—this, monks, is called the faculty of pleasure.\n\nAnd what, monks, is the faculty of pain? That which, monks, is bodily pain, bodily disagreeableness, a feeling of pain and disagreeableness born of bodily contact—this, monks, is called the faculty of pain.\n\nAnd what, monks, is the faculty of mental joy? That which, monks, is mental pleasure, mental agreeableness, a feeling of pleasure and agreeableness born of mental contact—this, monks, is called the faculty of mental joy.\n\nAnd what, monks, is the faculty of mental distress? That which, monks, is mental pain, mental disagreeableness, a feeling of pain and disagreeableness born of mental contact—this, monks, is called the faculty of mental distress.\n\nAnd what, monks, is the faculty of equanimity? That which, monks, is a bodily or mental feeling that is neither agreeable nor disagreeable—this, monks, is called the faculty of equanimity.\n\nThese, monks, are the five faculties.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ඉන්ද්‍රියෝ පස්දෙනෙකි. ඒ පස්දෙනා කවරහුද? සුඛේන්ද්‍රිය, දුක්ඛේන්ද්‍රිය, සෝමනස්සින්ද්‍රිය, දෝමනස්සින්ද්‍රිය සහ උපේක්ඛින්ද්‍රිය යන මේවායි.\n\nභික්ෂූන් වහන්ස, සුඛේන්ද්‍රිය යනු කවරේද? භික්ෂූන් වහන්ස, යම් කායික සුවයක් වේද, කායික ප්‍රියශීලී බවක් වේද, කාය ස්පර්ශයෙන් හටගත් සුවයක් ප්‍රියශීලී බවක් වේද, භික්ෂූන් වහන්ස, මෙය සුඛේන්ද්‍රිය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දුක්ඛේන්ද්‍රිය යනු කවරේද? භික්ෂූන් වහන්ස, යම් කායික දුකක් වේද, කායික අප්‍රියශීලී බවක් වේද, කාය ස්පර්ශයෙන් හටගත් දුකක් අප්‍රියශීලී බවක් වේද, භික්ෂූන් වහන්ස, මෙය දුක්ඛේන්ද්‍රිය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, සෝමනස්සින්ද්‍රිය යනු කවරේද? භික්ෂූන් වහන්ස, යම් චෛතසික සුවයක් වේද, චෛතසික ප්‍රියශීලී බවක් වේද, මනෝ ස්පර්ශයෙන් හටගත් සුවයක් ප්‍රියශීලී බවක් වේද, භික්ෂූන් වහන්ස, මෙය සෝමනස්සින්ද්‍රිය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, දෝමනස්සින්ද්‍රිය යනු කවරේද? භික්ෂූන් වහන්ස, යම් චෛතසික දුකක් වේද, චෛතසික අප්‍රියශීලී බවක් වේද, මනෝ ස්පර්ශයෙන් හටගත් දුකක් අප්‍රියශීලී බවක් වේද, භික්ෂූන් වහන්ස, මෙය දෝමනස්සින්ද්‍රිය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, උපේක්ඛින්ද්‍රිය යනු කවරේද? භික්ෂූන් වහන්ස, යම් කායික හෝ චෛතසික හෝ ප්‍රියශීලීද නොවන අප්‍රියශීලීද නොවන වේදනාවක් වේද, භික්ෂූන් වහන්ස, මෙය උපේක්ඛින්ද්‍රිය යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මේවා මේ පංච ඉන්ද්‍රියෝය.",
      "paliTitle": "Paṭhamavibhaṅgasuttaṃ",
      "englishTitle": "The First Discourse on Analysis",
      "sinhalaTitle": "පළමු විභංග සූත්‍රය"
    },
    {
      "number": 507,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. ‘‘Katamañca, bhikkhave, sukhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ sukhaṃ, kāyikaṃ sātaṃ, kāyasamphassajaṃ sukhaṃ sātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, sukhindriyaṃ. ‘‘Katamañca, bhikkhave, dukkhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ dukkhaṃ, kāyikaṃ asātaṃ, kāyasamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, dukkhindriyaṃ. ‘‘Katamañca, bhikkhave, somanassindriyaṃ? Yaṃ kho, bhikkhave, cetasikaṃ sukhaṃ, cetasikaṃ sātaṃ, manosamphassajaṃ sukhaṃ sātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, somanassindriyaṃ. ‘‘Katamañca, bhikkhave, domanassindriyaṃ? Yaṃ kho, bhikkhave, cetasikaṃ dukkhaṃ, cetasikaṃ asātaṃ, manosamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, domanassindriyaṃ. ‘‘Katamañca, bhikkhave, upekkhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ vā cetasikaṃ vā nevasātaṃ nāsātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, upekkhindriyaṃ. ‘‘Tatra, bhikkhave, yañca sukhindriyaṃ yañca somanassindriyaṃ, sukhā sā vedanā daṭṭhabbā. Tatra, bhikkhave, yañca dukkhindriyaṃ yañca domanassindriyaṃ, dukkhā sā vedanā daṭṭhabbā. Tatra, bhikkhave, yadidaṃ upekkhindriyaṃ, adukkhamasukhā sā vedanā daṭṭhabbā. Imāni kho, bhikkhave, pañcindriyānī’’ti. Sattamaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of physical pleasure, the faculty of physical pain, the faculty of mental joy, the faculty of mental grief, and the faculty of equanimity.\n\nAnd what, monks, is the faculty of physical pleasure? That which is a physical pleasure, a physical agreeableness, a feeling of pleasure and agreeableness born of bodily contact – this, monks, is called the faculty of physical pleasure.\n\nAnd what, monks, is the faculty of physical pain? That which is a physical pain, a physical disagreeableness, a feeling of pain and disagreeableness born of bodily contact – this, monks, is called the faculty of physical pain.\n\nAnd what, monks, is the faculty of mental joy? That which is a mental pleasure, a mental agreeableness, a feeling of pleasure and agreeableness born of mental contact – this, monks, is called the faculty of mental joy.\n\nAnd what, monks, is the faculty of mental grief? That which is a mental pain, a mental disagreeableness, a feeling of pain and disagreeableness born of mental contact – this, monks, is called the faculty of mental grief.\n\nAnd what, monks, is the faculty of equanimity? That which is a feeling, whether physical or mental, that is neither agreeable nor disagreeable – this, monks, is called the faculty of equanimity.\n\nTherein, monks, both the faculty of physical pleasure and the faculty of mental joy are to be seen as pleasant feelings.\n\nTherein, monks, both the faculty of physical pain and the faculty of mental grief are to be seen as painful feelings.\n\nTherein, monks, this faculty of equanimity is to be seen as a feeling that is neither painful nor pleasant.\n\nThese, monks, are the five faculties.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස?\n\nසුඛින්ද්‍රිය, දුක්ඛින්ද්‍රිය, සෝමනස්සින්ද්‍රිය, දෝමනස්සින්ද්‍රිය, උපෙක්ඛින්ද්‍රිය යන මේවාය.\n\nමහණෙනි, සුඛින්ද්‍රිය යනු කවරේද? මහණෙනි, යම් ශාරීරික සැපයක් වේද, ශාරීරික සුවයක් වේද, කාය-සම්පර්ශයෙන් හටගත් සැපදායක, ප‍්‍රියජනක වේදනාවක් වේද – මහණෙනි, මෙය සුඛින්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, දුක්ඛින්ද්‍රිය යනු කවරේද? මහණෙනි, යම් ශාරීරික දුකක් වේද, ශාරීරික අප‍්‍රිය බවක් වේද, කාය-සම්පර්ශයෙන් හටගත් දුක් සහිත, අප‍්‍රියජනක වේදනාවක් වේද – මහණෙනි, මෙය දුක්ඛින්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, සෝමනස්සින්ද්‍රිය යනු කවරේද? මහණෙනි, යම් මානසික සැපයක් වේද, මානසික සුවයක් වේද, මනෝ-සම්පර්ශයෙන් හටගත් සැපදායක, ප‍්‍රියජනක වේදනාවක් වේද – මහණෙනි, මෙය සෝමනස්සින්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, දෝමනස්සින්ද්‍රිය යනු කවරේද? මහණෙනි, යම් මානසික දුකක් වේද, මානසික අප‍්‍රිය බවක් වේද, මනෝ-සම්පර්ශයෙන් හටගත් දුක් සහිත, අප‍්‍රියජනක වේදනාවක් වේද – මහණෙනි, මෙය දෝමනස්සින්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, උපෙක්ඛින්ද්‍රිය යනු කවරේද? මහණෙනි, යම් ශාරීරික හෝ මානසික අප‍්‍රියද නොවන, ප‍්‍රියද නොවන වේදනාවක් වේද – මහණෙනි, මෙය උපෙක්ඛින්ද්‍රිය යැයි කියනු ලැබේ.\n\nමහණෙනි, එහිලා යම් සුඛින්ද්‍රියක් වේද, යම් සෝමනස්සින්ද්‍රියක් වේද, එය සැප වේදනාවක් ලෙස දතයුතුය. මහණෙනි, එහිලා යම් දුක්ඛින්ද්‍රියක් වේද, යම් දෝමනස්සින්ද්‍රියක් වේද, එය දුක් වේදනාවක් ලෙස දතයුතුය. මහණෙනි, එහිලා යම් උපෙක්ඛින්ද්‍රියක් වේද, එය දුක්ද නොවන සැපද නොවන වේදනාවක් ලෙස දතයුතුය. මහණෙනි, මේ ඉන්ද්‍රියයන් පස මෙසේය.",
      "paliTitle": "Dutiyavibhaṅgasuttaṃ",
      "englishTitle": "The Second Discourse on Analysis",
      "sinhalaTitle": "දෙවන විභංග සූත්‍රය"
    },
    {
      "number": 508,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. ‘‘Katamañca, bhikkhave, sukhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ sukhaṃ, kāyikaṃ sātaṃ, kāyasamphassajaṃ sukhaṃ sātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, sukhindriyaṃ. ‘‘Katamañca, bhikkhave, dukkhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ dukkhaṃ, kāyikaṃ asātaṃ, kāyasamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, dukkhindriyaṃ. ‘‘Katamañca, bhikkhave, somanassindriyaṃ? Yaṃ kho, bhikkhave, cetasikaṃ sukhaṃ, cetasikaṃ sātaṃ, manosamphassajaṃ sukhaṃ sātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, somanassindriyaṃ. ‘‘Katamañca, bhikkhave, domanassindriyaṃ? Yaṃ kho, bhikkhave, cetasikaṃ dukkhaṃ, cetasikaṃ asātaṃ, manosamphassajaṃ dukkhaṃ asātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, domanassindriyaṃ. ‘‘Katamañca, bhikkhave, upekkhindriyaṃ? Yaṃ kho, bhikkhave, kāyikaṃ vā cetasikaṃ vā neva sātaṃ nāsātaṃ vedayitaṃ – idaṃ vuccati, bhikkhave, upekkhindriyaṃ. ‘‘Tatra, bhikkhave, yañca sukhindriyaṃ yañca somanassindriyaṃ, sukhā sā vedanā daṭṭhabbā. Tatra, bhikkhave, yañca dukkhindriyaṃ yañca domanassindriyaṃ, dukkhā sā vedanā daṭṭhabbā. Tatra, bhikkhave, yadidaṃ upekkhindriyaṃ, adukkhamasukhā sā vedanā daṭṭhabbā. Iti kho, bhikkhave, imāni pañcindriyāni pañca hutvā tīṇi honti, tīṇi hutvā pañca honti pariyāyenā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of pleasure, the faculty of pain, the faculty of mental well-being, the faculty of mental distress, and the faculty of equanimity.\n\nAnd what, monks, is the faculty of pleasure? That, monks, which is bodily pleasure, bodily agreeableness, a feeling of pleasure and agreeableness born of bodily contact – this, monks, is called the faculty of pleasure.\n\nAnd what, monks, is the faculty of pain? That, monks, which is bodily pain, bodily disagreeableness, a feeling of pain and disagreeableness born of bodily contact – this, monks, is called the faculty of pain.\n\nAnd what, monks, is the faculty of mental well-being? That, monks, which is mental pleasure, mental agreeableness, a feeling of pleasure and agreeableness born of mental contact – this, monks, is called the faculty of mental well-being.\n\nAnd what, monks, is the faculty of mental distress? That, monks, which is mental pain, mental disagreeableness, a feeling of pain and disagreeableness born of mental contact – this, monks, is called the faculty of mental distress.\n\nAnd what, monks, is the faculty of equanimity? That, monks, which is a feeling that is neither agreeable nor disagreeable, whether bodily or mental – this, monks, is called the faculty of equanimity.\n\nAmong these, monks, both the faculty of pleasure and the faculty of mental well-being are to be seen as pleasant feeling. Among these, monks, both the faculty of pain and the faculty of mental distress are to be seen as painful feeling. Among these, monks, what is the faculty of equanimity is to be seen as neither painful nor pleasant feeling. Thus, monks, these five faculties become three, and these three become five, by classification.",
      "sinhala": "භික්ෂූණි, මේ ඉන්ද්‍රියෝ පස්දෙනෙක් වෙති. ඒ කවර පස්දෙනෙක්ද? සුඛේන්ද්‍රිය, දුක්ඛේන්ද්‍රිය, සෝමනස්සෙන්ද්‍රිය, දෝමනස්සෙන්ද්‍රිය, උපේක්ඛේන්ද්‍රිය යන මොහුයි.\n\nභික්ෂූණි, සුඛේන්ද්‍රිය නම් කවරේද? භික්ෂූණි, යම් කායික සැපයක් වේද, යම් කායික සුඛ විඳීමක් වේද, කය පහසින් හටගත් යම් සැප විඳීමක් වේද – භික්ෂූණි, මෙය සුඛේන්ද්‍රිය යයි කියනු ලැබේ.\n\nභික්ෂූණි, දුක්ඛේන්ද්‍රිය නම් කවරේද? භික්ෂූණි, යම් කායික දුකක් වේද, යම් කායික අසහන විඳීමක් වේද, කය පහසින් හටගත් යම් දුක් සහිත අසහන විඳීමක් වේද – භික්ෂූණි, මෙය දුක්ඛේන්ද්‍රිය යයි කියනු ලැබේ.\n\nභික්ෂූණි, සෝමනස්සෙන්ද්‍රිය නම් කවරේද? භික්ෂූණි, යම් චෛතසික සැපයක් වේද, යම් චෛතසික සුඛ විඳීමක් වේද, මනෝ පහසින් හටගත් යම් සැප විඳීමක් වේද – භික්ෂූණි, මෙය සෝමනස්සෙන්ද්‍රිය යයි කියනු ලැබේ.\n\nභික්ෂූණි, දෝමනස්සෙන්ද්‍රිය නම් කවරේද? භික්ෂූණි, යම් චෛතසික දුකක් වේද, යම් චෛතසික අසහන විඳීමක් වේද, මනෝ පහසින් හටගත් යම් දුක් සහිත අසහන විඳීමක් වේද – භික්ෂූණි, මෙය දෝමනස්සෙන්ද්‍රිය යයි කියනු ලැබේ.\n\nභික්ෂූණි, උපේක්ඛේන්ද්‍රිය නම් කවරේද? භික්ෂූණි, යම් කායික හෝ චෛතසික වශයෙන් සැපයක් හෝ දුකක් නොවන, මධ්‍යස්ථ ලෙස විඳින ලද විඳීමක් වේද – භික්ෂූණි, මෙය උපේක්ඛේන්ද්‍රිය යයි කියනු ලැබේ.\n\nභික්ෂූණි, එහිලා යම් සුඛේන්ද්‍රියක් වේද, යම් සෝමනස්සෙන්ද්‍රියක් වේද, ඒ වේදනාව සැප වේදනාවක් ලෙස දතයුතුය. භික්ෂූණි, එහිලා යම් දුක්ඛේන්ද්‍රියක් වේද, යම් දෝමනස්සෙන්ද්‍රියක් වේද, ඒ වේදනාව දුක් වේදනාවක් ලෙස දතයුතුය. භික්ෂූණි, එහිලා යම් මේ උපේක්ඛේන්ද්‍රියක් වේද, ඒ වේදනාව අදුක්ඛමසුඛ වේදනාවක් (දුකක්ද නොවූ, සැපයක්ද නොවූ වේදනාවක්) ලෙස දතයුතුය. භික්ෂූණි, මෙසේ මේ ඉන්ද්‍රියෝ පස්දෙන වුවත්, (වේදනා වශයෙන්) තුනක් වෙති; තුනක් වුවත්, (අනෙක් අයුරින්) පස්දෙනක් වෙති යයි දතයුතුය.",
      "paliTitle": "Tatiyavibhaṅgasuttaṃ",
      "englishTitle": "Third Discourse on Analysis",
      "sinhalaTitle": "තතිය විභංග සූත්‍රය"
    },
    {
      "number": 509,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. Sukhavedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati sukhindriyaṃ. So sukhitova samāno ‘sukhitosmī’ti pajānāti. Tasseva sukhavedaniyassa phassassa nirodhā ‘yaṃ tajjaṃ vedayitaṃ sukhavedaniyaṃ phassaṃ paṭicca uppannaṃ sukhindriyaṃ taṃ nirujjhati, taṃ vūpasammatī’ti pajānāti’’. ‘‘Dukkhavedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati dukkhindriyaṃ. So dukkhitova samāno ‘dukkhitosmī’ti pajānāti. Tasseva dukkhavedaniyassa phassassa nirodhā ‘yaṃ tajjaṃ vedayitaṃ dukkhavedaniyaṃ phassaṃ paṭicca uppannaṃ dukkhindriyaṃ taṃ nirujjhati, taṃ vūpasammatī’ti pajānāti’’. ‘‘Somanassavedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati somanassindriyaṃ. So sumanova samāno ‘sumanosmī’ti pajānāti. Tasseva somanassavedaniyassa phassassa nirodhā ‘yaṃ tajjaṃ vedayitaṃ somanassavedaniyaṃ phassaṃ paṭicca uppannaṃ somanassindriyaṃ taṃ nirujjhati, taṃ vūpasammatī’ti pajānāti’’. ‘‘Domanassavedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati domanassindriyaṃ. So dummanova samāno ‘dummanosmī’ti pajānāti. Tasseva domanassavedaniyassa phassassa nirodhā ‘yaṃ tajjaṃ vedayitaṃ domanassavedaniyaṃ phassaṃ paṭicca uppannaṃ domanassindriyaṃ taṃ nirujjhati, taṃ vūpasammatī’ti pajānāti’’. ‘‘Upekkhāvedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati upekkhindriyaṃ. So upekkhakova samāno ‘upekkhakosmī’ti pajānāti. Tasseva upekkhāvedaniyassa phassassa nirodhā ‘yaṃ tajjaṃ vedayitaṃ upekkhāvedaniyaṃ phassaṃ paṭicca uppannaṃ upekkhindriyaṃ taṃ nirujjhati, taṃ vūpasammatī’ti pajānāti’’. ‘‘Seyyathāpi, bhikkhave, dvinnaṃ kaṭṭhānaṃ saṅghaṭṭanasamodhānā [saṃghaṭṭanāsamodhānā (pī. ka.), saṃghaṭanasamodhānā (syā. kaṃ.)] usmā jāyati, tejo abhinibbattati; tesaṃyeva kaṭṭhānaṃ nānābhāvāvinikkhepā yā [nānābhāvanikkhepā (syā. kaṃ. pī. ka.)] tajjā usmā sā nirujjhati sā vūpasammati; evameva kho, bhikkhave, sukhavedaniyaṃ phassaṃ paṭicca uppajjati sukhindriyaṃ. So sukhitova samāno ‘sukhitosmī’ti pajānāti. Tasseva sukhavedaniyassa phassassa nirodhā ‘yaṃ tajjaṃ vedayitaṃ sukhavedaniyaṃ phassaṃ paṭicca uppajjati sukhindriyaṃ taṃ nirujjhati, taṃ vūpasammatī’ti pajānāti’’. ‘‘Dukkhavedaniyaṃ, bhikkhave, phassaṃ paṭicca…pe… somanassavedaniyaṃ, bhikkhave, phassaṃ paṭicca…pe… domanassavedaniyaṃ, bhikkhave, phassaṃ paṭicca…pe… upekkhāvedaniyaṃ, bhikkhave, phassaṃ paṭicca uppajjati upekkhindriyaṃ. So upekkhakova samāno ‘upekkhakosmī’ti pajānāti. Tasseva upekkhāvedaniyassa phassassa nirodhā ‘yaṃ tajjaṃ vedayitaṃ upekkhāvedaniyaṃ phassaṃ paṭicca uppajjati upekkhindriyaṃ taṃ nirujjhati, taṃ vūpasammatī’ti pajānāti’’. Navamaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of pleasure, the faculty of pain, the faculty of mental joy, the faculty of mental distress, and the faculty of equanimity.\n\nMonks, dependent on contact that is felt as pleasant, the faculty of pleasure arises. Being one who experiences pleasure, he discerns, ‘I am experiencing pleasure.’ With the cessation of that very contact felt as pleasant, he discerns, ‘That particular feeling, the faculty of pleasure that arose dependent on contact felt as pleasant, ceases; it subsides.’\n\nMonks, dependent on contact that is felt as painful, the faculty of pain arises. Being one who experiences pain, he discerns, ‘I am experiencing pain.’ With the cessation of that very contact felt as painful, he discerns, ‘That particular feeling, the faculty of pain that arose dependent on contact felt as painful, ceases; it subsides.’\n\nMonks, dependent on contact that is felt as mental joy, the faculty of mental joy arises. Being one who experiences mental joy, he discerns, ‘I am experiencing mental joy.’ With the cessation of that very contact felt as mental joy, he discerns, ‘That particular feeling, the faculty of mental joy that arose dependent on contact felt as mental joy, ceases; it subsides.’\n\nMonks, dependent on contact that is felt as mental distress, the faculty of mental distress arises. Being one who experiences mental distress, he discerns, ‘I am experiencing mental distress.’ With the cessation of that very contact felt as mental distress, he discerns, ‘That particular feeling, the faculty of mental distress that arose dependent on contact felt as mental distress, ceases; it subsides.’\n\nMonks, dependent on contact that is felt as equanimity, the faculty of equanimity arises. Being one who experiences equanimity, he discerns, ‘I am experiencing equanimity.’ With the cessation of that very contact felt as equanimity, he discerns, ‘That particular feeling, the faculty of equanimity that arose dependent on contact felt as equanimity, ceases; it subsides.’\n\nMonks, just as from the friction and combination of two pieces of wood, heat is generated, fire arises; and when those very pieces of wood are separated and scattered, that particular heat ceases, it subsides. In the same way, monks, dependent on contact that is felt as pleasant, the faculty of pleasure arises. Being one who experiences pleasure, he discerns, ‘I am experiencing pleasure.’ With the cessation of that very contact felt as pleasant, he discerns, ‘That particular feeling, the faculty of pleasure that arose dependent on contact felt as pleasant, ceases; it subsides.’\n\nDependent on contact that is felt as painful, the faculty of pain arises. Being one who experiences pain, he discerns, ‘I am experiencing pain.’ With the cessation of that very contact felt as painful, he discerns, ‘That particular feeling, the faculty of pain that arose dependent on contact felt as painful, ceases; it subsides.’ Dependent on contact that is felt as mental joy, the faculty of mental joy arises. Being one who experiences mental joy, he discerns, ‘I am experiencing mental joy.’ With the cessation of that very contact felt as mental joy, he discerns, ‘That particular feeling, the faculty of mental joy that arose dependent on contact felt as mental joy, ceases; it subsides.’ Dependent on contact that is felt as mental distress, the faculty of mental distress arises. Being one who experiences mental distress, he discerns, ‘I am experiencing mental distress.’ With the cessation of that very contact felt as mental distress, he discerns, ‘That particular feeling, the faculty of mental distress that arose dependent on contact felt as mental distress, ceases; it subsides.’ Dependent on contact that is felt as equanimity, the faculty of equanimity arises. Being one who experiences equanimity, he discerns, ‘I am experiencing equanimity.’ With the cessation of that very contact felt as equanimity, he discerns, ‘That particular feeling, the faculty of equanimity that arose dependent on contact felt as equanimity, ceases; it subsides.’",
      "sinhala": "භික්ෂූනි, මේ ඉන්ද්‍රියයන් පහකි. කවරේද ඒ පහ? සුඛෙන්ද්‍රිය, දුක්ඛෙන්ද්‍රිය, සෝමනස්සෙන්ද්‍රිය, දෝමනස්සෙන්ද්‍රිය, උපේක්ෂෙන්ද්‍රිය. භික්ෂූනි, සුඛවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන සුඛෙන්ද්‍රිය උපදී. හෙතෙම සුවපත් වූයේම ‘මම සුවපත් වෙමි’ යි දනී. ඒ සුඛවේදනීය ස්පර්ශය නිරුද්ධවීමෙන්, යම් ඒ සුඛවේදනීය ස්පර්ශය හේතුකොටගෙන උපන් සුඛෙන්ද්‍රිය වේද, එය නිරුද්ධ වේ, එය සංසිඳේ යි දනී. භික්ෂූනි, දුක්ඛවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන දුක්ඛෙන්ද්‍රිය උපදී. හෙතෙම දුකින් පෙළුණේම ‘මම දුකින් පෙළෙමි’ යි දනී. ඒ දුක්ඛවේදනීය ස්පර්ශය නිරුද්ධවීමෙන්, යම් ඒ දුක්ඛවේදනීය ස්පර්ශය හේතුකොටගෙන උපන් දුක්ඛෙන්ද්‍රිය වේද, එය නිරුද්ධ වේ, එය සංසිඳේ යි දනී. භික්ෂූනි, සෝමනස්සවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන සෝමනස්සෙන්ද්‍රිය උපදී. හෙතෙම සතුටු වූයේම ‘මම සතුටු වෙමි’ යි දනී. ඒ සෝමනස්සවේදනීය ස්පර්ශය නිරුද්ධවීමෙන්, යම් ඒ සෝමනස්සවේදනීය ස්පර්ශය හේතුකොටගෙන උපන් සෝමනස්සෙන්ද්‍රිය වේද, එය නිරුද්ධ වේ, එය සංසිඳේ යි දනී. භික්ෂූනි, දෝමනස්සවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන දෝමනස්සෙන්ද්‍රිය උපදී. හෙතෙම සිත් තැවුල් සහිත වූයේම ‘මම සිත් තැවුල් සහිත වෙමි’ යි දනී. ඒ දෝමනස්සවේදනීය ස්පර්ශය නිරුද්ධවීමෙන්, යම් ඒ දෝමනස්සවේදනීය ස්පර්ශය හේතුකොටගෙන උපන් දෝමනස්සෙන්ද්‍රිය වේද, එය නිරුද්ධ වේ, එය සංසිඳේ යි දනී. භික්ෂූනි, උපේක්ෂා වේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන උපේක්ෂෙන්ද්‍රිය උපදී. හෙතෙම උපේක්ෂාවෙන් යුක්ත වූයේම ‘මම උපේක්ෂාවෙන් යුක්ත වෙමි’ යි දනී. ඒ උපේක්ෂා වේදනීය ස්පර්ශය නිරුද්ධවීමෙන්, යම් ඒ උපේක්ෂා වේදනීය ස්පර්ශය හේතුකොටගෙන උපන් උපේක්ෂෙන්ද්‍රිය වේද, එය නිරුද්ධ වේ, එය සංසිඳේ යි දනී.\n\nභික්ෂූනි, යම්සේ දර දඬු දෙකක් එකට අතුල්ලන විට උණුසුම ඇතිවේද, ගින්න හටගනීද, ඒ දර දඬු දෙකම වෙන් වූ විට යම් ඒ උණුසුම වේද, එය නිරුද්ධ වේ, එය සංසිඳේ. එපරිද්දෙන්ම භික්ෂූනි, සුඛවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන සුඛෙන්ද්‍රිය උපදී. හෙතෙම සුවපත් වූයේම ‘මම සුවපත් වෙමි’ යි දනී. ඒ සුඛවේදනීය ස්පර්ශය නිරුද්ධවීමෙන්, යම් ඒ සුඛවේදනීය ස්පර්ශය හේතුකොටගෙන සුඛෙන්ද්‍රිය උපදී ද, එය නිරුද්ධ වේ, එය සංසිඳේ යි දනී. දුක්ඛවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන... යනාදිය... සෝමනස්සවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන... යනාදිය... දෝමනස්සවේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන... යනාදිය... භික්ෂූනි, උපේක්ෂා වේදනා සහිත වූ ස්පර්ශය හේතුකොටගෙන උපේක්ෂෙන්ද්‍රිය උපදී. හෙතෙම උපේක්ෂාවෙන් යුක්ත වූයේම ‘මම උපේක්ෂාවෙන් යුක්ත වෙමි’ යි දනී. ඒ උපේක්ෂා වේදනීය ස්පර්ශය නිරුද්ධවීමෙන්, යම් ඒ උපේක්ෂා වේදනීය ස්පර්ශය හේතුකොටගෙන උපේක්ෂෙන්ද්‍රිය උපදී ද, එය නිරුද්ධ වේ, එය සංසිඳේ යි දනී.",
      "paliTitle": "Kaṭṭhopamasuttaṃ",
      "englishTitle": "Simile of the Log Sutta",
      "sinhalaTitle": "කට්ඨෝපම සූත්‍රය"
    },
    {
      "number": 510,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Dukkhindriyaṃ, domanassindriyaṃ, sukhindriyaṃ, somanassindriyaṃ, upekkhindriyaṃ. Idha, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa viharato uppajjati dukkhindriyaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ dukkhindriyaṃ, tañca kho sanimittaṃ sanidānaṃ sasaṅkhāraṃ sappaccayaṃ. Tañca animittaṃ anidānaṃ asaṅkhāraṃ appaccayaṃ dukkhindriyaṃ uppajjissatīti – netaṃ ṭhānaṃ vijjati’. So dukkhindriyañca pajānāti, dukkhindriyasamudayañca pajānāti, dukkhindriyanirodhañca pajānāti, yattha cuppannaṃ dukkhindriyaṃ aparisesaṃ nirujjhati tañca pajānāti. Kattha cuppannaṃ dukkhindriyaṃ aparisesaṃ nirujjhati? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati, ettha cuppannaṃ dukkhindriyaṃ aparisesaṃ nirujjhati. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aññāsi dukkhindriyassa nirodhaṃ, tadatthāya cittaṃ upasaṃharati’’’. ‘‘Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa viharato uppajjati domanassindriyaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ domanassindriyaṃ, tañca kho sanimittaṃ sanidānaṃ sasaṅkhāraṃ sappaccayaṃ. Tañca animittaṃ anidānaṃ asaṅkhāraṃ appaccayaṃ domanassindriyaṃ uppajjissatīti – netaṃ ṭhānaṃ vijjati’. So domanassindriyañca pajānāti, domanassindriyasamudayañca pajānāti, domanassindriyanirodhañca pajānāti, yattha cuppannaṃ domanassindriyaṃ aparisesaṃ nirujjhati tañca pajānāti. Kattha cuppannaṃ domanassindriyaṃ aparisesaṃ nirujjhati? Idha, bhikkhave, bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati, ettha cuppannaṃ domanassindriyaṃ aparisesaṃ nirujjhati. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aññāsi domanassindriyassa nirodhaṃ, tadatthāya cittaṃ upasaṃharati’’’. ‘‘Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa viharato uppajjati sukhindriyaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ sukhindriyaṃ, tañca kho sanimittaṃ sanidānaṃ sasaṅkhāraṃ sappaccayaṃ. Tañca animittaṃ anidānaṃ asaṅkhāraṃ appaccayaṃ sukhindriyaṃ uppajjissatīti – netaṃ ṭhānaṃ vijjati’. So sukhindriyañca pajānāti, sukhindriyasamudayañca pajānāti, sukhindriyanirodhañca pajānāti, yattha cuppannaṃ sukhindriyaṃ aparisesaṃ nirujjhati tañca pajānāti. Kattha cuppannaṃ sukhindriyaṃ aparisesaṃ nirujjhati? Idha, bhikkhave, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati, ettha cuppannaṃ sukhindriyaṃ aparisesaṃ nirujjhati. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aññāsi sukhindriyassa nirodhaṃ, tadatthāya cittaṃ upasaṃharati’’’. ‘‘Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa viharato uppajjati somanassindriyaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ somanassindriyaṃ, tañca kho sanimittaṃ sanidānaṃ sasaṅkhāraṃ sappaccayaṃ. Tañca animittaṃ anidānaṃ asaṅkhāraṃ appaccayaṃ somanassindriyaṃ uppajjissatīti – netaṃ ṭhānaṃ vijjati’. So somanassindriyañca pajānāti, somanassindriyasamudayañca pajānāti, somanassindriyanirodhañca pajānāti, yattha cuppannaṃ somanassindriyaṃ aparisesaṃ nirujjhati tañca pajānāti. Kattha cuppannaṃ somanassindriyaṃ aparisesaṃ nirujjhati? Idha, bhikkhave, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati, ettha cuppannaṃ somanassindriyaṃ aparisesaṃ nirujjhati. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aññāsi somanassindriyassa nirodhaṃ, tadatthāya cittaṃ upasaṃharati’’’. ‘‘Idha pana, bhikkhave, bhikkhuno appamattassa ātāpino pahitattassa viharato uppajjati upekkhindriyaṃ. So evaṃ pajānāti – ‘uppannaṃ kho me idaṃ upekkhindriyaṃ, tañca kho sanimittaṃ sanidānaṃ sasaṅkhāraṃ sappaccayaṃ. Tañca animittaṃ anidānaṃ asaṅkhāraṃ appaccayaṃ upekkhindriyaṃ uppajjissatīti – netaṃ ṭhānaṃ vijjati’. So upekkhindriyañca pajānāti, upekkhindriyasamudayañca pajānāti, upekkhindriyanirodhañca pajānāti, yattha cuppannaṃ upekkhindriyaṃ aparisesaṃ nirujjhati tañca pajānāti. Kattha cuppannaṃ upekkhindriyaṃ aparisesaṃ nirujjhati? Idha, bhikkhave, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, ettha cuppannaṃ upekkhindriyaṃ aparisesaṃ nirujjhati. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aññāsi upekkhindriyassa nirodhaṃ, tadatthāya cittaṃ upasaṃharatī’’’ti. Dasamaṃ. Sukhindriyavaggo catuttho. Tassuddānaṃ – Suddhikañca soto arahā, duve samaṇabrāhmaṇā; Vibhaṅgena tayo vuttā, kaṭṭho uppaṭipāṭikanti.",
      "english": "Mendicants, there are these five faculties. Which five? The faculty of pain, the faculty of displeasure, the faculty of physical ease, the faculty of mental joy, and the faculty of equanimity. Here, mendicants, when a mendicant dwells heedfully, ardent, and resolute, the faculty of pain arises. He understands this: ‘This faculty of pain has arisen in me, and it is with a sign, with a source, with volitional formations, and with a supporting condition. That a faculty of pain could arise without a sign, without a source, without volitional formations, and without a supporting condition – this is not possible.’ He understands the faculty of pain, he understands the origin of the faculty of pain, he understands the cessation of the faculty of pain, and he understands where and how the arisen faculty of pain ceases completely without remainder. Where and how does the arisen faculty of pain cease completely without remainder? Here, mendicants, a mendicant, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhana, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and joy. It is here that the arisen faculty of pain ceases completely without remainder. This, mendicants, is called a mendicant ‘who has understood the cessation of the faculty of pain, and who directs their mind towards that goal.’\n\nHere, mendicants, when a mendicant dwells heedfully, ardent, and resolute, the faculty of displeasure arises. He understands this: ‘This faculty of displeasure has arisen in me, and it is with a sign, with a source, with volitional formations, and with a supporting condition. That a faculty of displeasure could arise without a sign, without a source, without volitional formations, and without a supporting condition – this is not possible.’ He understands the faculty of displeasure, he understands the origin of the faculty of displeasure, he understands the cessation of the faculty of displeasure, and he understands where and how the arisen faculty of displeasure ceases completely without remainder. Where and how does the arisen faculty of displeasure cease completely without remainder? Here, mendicants, a mendicant, with the calming of initial and sustained application, through the inner stilling and unification of the mind, enters and dwells in the second jhana, which is without initial application and sustained application, born of concentration, and filled with rapture and joy. It is here that the arisen faculty of displeasure ceases completely without remainder. This, mendicants, is called a mendicant ‘who has understood the cessation of the faculty of displeasure, and who directs their mind towards that goal.’\n\nHere, mendicants, when a mendicant dwells heedfully, ardent, and resolute, the faculty of physical ease arises. He understands this: ‘This faculty of physical ease has arisen in me, and it is with a sign, with a source, with volitional formations, and with a supporting condition. That a faculty of physical ease could arise without a sign, without a source, without volitional formations, and without a supporting condition – this is not possible.’ He understands the faculty of physical ease, he understands the origin of the faculty of physical ease, he understands the cessation of the faculty of physical ease, and he understands where and how the arisen faculty of physical ease ceases completely without remainder. Where and how does the arisen faculty of physical ease cease completely without remainder? Here, mendicants, a mendicant, with the fading away of rapture, dwells in equanimity, mindful and clearly comprehending, and experiences joy with the body, of which the noble ones declare: ‘Dwelling in equanimity, mindful, experiencing a pleasant abiding,’ enters and dwells in the third jhana. It is here that the arisen faculty of physical ease ceases completely without remainder. This, mendicants, is called a mendicant ‘who has understood the cessation of the faculty of physical ease, and who directs their mind towards that goal.’\n\nHere, mendicants, when a mendicant dwells heedfully, ardent, and resolute, the faculty of mental joy arises. He understands this: ‘This faculty of mental joy has arisen in me, and it is with a sign, with a source, with volitional formations, and with a supporting condition. That a faculty of mental joy could arise without a sign, without a source, without volitional formations, and without a supporting condition – this is not possible.’ He understands the faculty of mental joy, he understands the origin of the faculty of mental joy, he understands the cessation of the faculty of mental joy, and he understands where and how the arisen faculty of mental joy ceases completely without remainder. Where and how does the arisen faculty of mental joy cease completely without remainder? Here, mendicants, a mendicant, with the abandoning of pleasure and the abandoning of pain, and with the prior passing away of mental joy and displeasure, enters and dwells in the fourth jhana, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. It is here that the arisen faculty of mental joy ceases completely without remainder. This, mendicants, is called a mendicant ‘who has understood the cessation of the faculty of mental joy, and who directs their mind towards that goal.’\n\nHere, mendicants, when a mendicant dwells heedfully, ardent, and resolute, the faculty of equanimity arises. He understands this: ‘This faculty of equanimity has arisen in me, and it is with a sign, with a source, with volitional formations, and with a supporting condition. That an equanimity faculty could arise without a sign, without a source, without volitional formations, and without a supporting condition – this is not possible.’\n\nHe knows the faculty of equanimity, he knows the origin of the faculty of equanimity, he knows the cessation of the faculty of equanimity, and he knows where the arisen faculty of equanimity ceases without remainder.\n\nWhere does the arisen faculty of equanimity cease without remainder? Here, monks, a monk, having entirely transcended the sphere of neither perception nor non-perception, enters and dwells in the cessation of perception and feeling; there the arisen faculty of equanimity ceases without remainder. This is said, monks, as: ‘A monk has known the cessation of the faculty of equanimity, and he directs his mind towards that goal.’\n\nThe Tenth. The chapter on the Faculty of Equanimity is the Fourth. Its summary: The Pure One, and the Stream-Enterer, the Arahant, two ascetics and brahmins; three are taught by way of analysis, Kaṭṭha, and Uppāṭipāṭika.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පසකි. කවරේද ඒ පස? දුක්ඛින්ද්‍රිය, දෝමනස්සින්ද්‍රිය, සුඛින්ද්‍රිය, සෝමනස්සින්ද්‍රිය, උපේක්ඛින්ද්‍රිය යන පසයි.\n\nමහණෙනි, මෙහිලා අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන්, සිත යොමා වසන භික්ෂුවට දුක්ඛින්ද්‍රිය හටගනී. හෙතෙම මෙසේ දනී: ‘මට මේ දුක්ඛින්ද්‍රිය උපන්නේය. එය නිමිති සහිතව, හේතු සහිතව, සංස්කාර සහිතව, ප්‍ර‍ත්‍ය සහිතව උපන්නේය. නිමිති රහිතව, හේතු රහිතව, සංස්කාර රහිතව, ප්‍ර‍ත්‍ය රහිතව දුක්ඛින්ද්‍රියක් උපදිනු ඇතැයි’ කියා එය විය නොහැකි තැනකි. හෙතෙම දුක්ඛින්ද්‍රියද දනී, දුක්ඛින්ද්‍රිය හටගැනීමද දනී, දුක්ඛින්ද්‍රිය නැතිකිරීමද දනී, යම් තැනක උපන් දුක්ඛින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේද, එයද දනී. උපන් දුක්ඛින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වන්නේ කවර තැනකද? මහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්ව, අකුසල ධර‍්මයන්ගෙන් වෙන්ව, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. මෙහිදී උපන් දුක්ඛින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේ. මහණෙනි, මේ භික්ෂුව දුක්ඛින්ද්‍රියෙහි නිරෝධය දැනගත්තේය, එයට සිත යොදවන්නේය යි කියනු ලැබේ.\n\nමහණෙනි, මෙහිලා අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන්, සිත යොමා වසන භික්ෂුවට දෝමනස්සින්ද්‍රිය හටගනී. හෙතෙම මෙසේ දනී: ‘මට මේ දෝමනස්සින්ද්‍රිය උපන්නේය. එය නිමිති සහිතව, හේතු සහිතව, සංස්කාර සහිතව, ප්‍ර‍ත්‍ය සහිතව උපන්නේය. නිමිති රහිතව, හේතු රහිතව, සංස්කාර රහිතව, ප්‍ර‍ත්‍ය රහිතව දෝමනස්සින්ද්‍රියක් උපදිනු ඇතැයි’ කියා එය විය නොහැකි තැනකි. හෙතෙම දෝමනස්සින්ද්‍රියද දනී, දෝමනස්සින්ද්‍රිය හටගැනීමද දනී, දෝමනස්සින්ද්‍රිය නැතිකිරීමද දනී, යම් තැනක උපන් දෝමනස්සින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේද, එයද දනී. උපන් දෝමනස්සින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වන්නේ කවර තැනකද? මහණෙනි, මෙහිලා භික්ෂුව විතර්ක විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මිකව සිත පහදවාගෙන, සිතෙහි ඒකාග්‍රතාවය ඇතිකරගෙන, විතර්ක රහිතව, විචාර රහිතව, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. මෙහිදී උපන් දෝමනස්සින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේ. මහණෙනි, මේ භික්ෂුව දෝමනස්සින්ද්‍රියෙහි නිරෝධය දැනගත්තේය, එයට සිත යොදවන්නේය යි කියනු ලැබේ.\n\nමහණෙනි, මෙහිලා අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන්, සිත යොමා වසන භික්ෂුවට සුඛින්ද්‍රිය හටගනී. හෙතෙම මෙසේ දනී: ‘මට මේ සුඛින්ද්‍රිය උපන්නේය. එය නිමිති සහිතව, හේතු සහිතව, සංස්කාර සහිතව, ප්‍ර‍ත්‍ය සහිතව උපන්නේය. නිමිති රහිතව, හේතු රහිතව, සංස්කාර රහිතව, ප්‍ර‍ත්‍ය රහිතව සුඛින්ද්‍රියක් උපදිනු ඇතැයි’ කියා එය විය නොහැකි තැනකි. හෙතෙම සුඛින්ද්‍රියද දනී, සුඛින්ද්‍රිය හටගැනීමද දනී, සුඛින්ද්‍රිය නැතිකිරීමද දනී, යම් තැනක උපන් සුඛින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේද, එයද දනී. උපන් සුඛින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වන්නේ කවර තැනකද? මහණෙනි, මෙහිලා භික්ෂුව ප්‍රීතියෙන්ද කලකිරී උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව වාසය කරමින්, ආර්යයන් ‘උපේක්ෂා සහගතය, සිහි නුවණ ඇත්තෙකි, සැප විහරණය ඇත්තෙකි’ යැයි කියන යම් ඒ සැපයක් වේද, එය කයින් විඳිමින් තුන්වන ධ්‍යානයට පැමිණ වාසය කරයි. මෙහිදී උපන් සුඛින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේ. මහණෙනි, මේ භික්ෂුව සුඛින්ද්‍රියෙහි නිරෝධය දැනගත්තේය, එයට සිත යොදවන්නේය යි කියනු ලැබේ.\n\nමහණෙනි, මෙහිලා අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන්, සිත යොමා වසන භික්ෂුවට සෝමනස්සින්ද්‍රිය හටගනී. හෙතෙම මෙසේ දනී: ‘මට මේ සෝමනස්සින්ද්‍රිය උපන්නේය. එය නිමිති සහිතව, හේතු සහිතව, සංස්කාර සහිතව, ප්‍ර‍ත්‍ය සහිතව උපන්නේය. නිමිති රහිතව, හේතු රහිතව, සංස්කාර රහිතව, ප්‍ර‍ත්‍ය රහිතව සෝමනස්සින්ද්‍රියක් උපදිනු ඇතැයි’ කියා එය විය නොහැකි තැනකි. හෙතෙම සෝමනස්සින්ද්‍රියද දනී, සෝමනස්සින්ද්‍රිය හටගැනීමද දනී, සෝමනස්සින්ද්‍රිය නැතිකිරීමද දනී, යම් තැනක උපන් සෝමනස්සින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේද, එයද දනී. උපන් සෝමනස්සින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වන්නේ කවර තැනකද? මහණෙනි, මෙහිලා භික්ෂුව සැපයද අත්හැරීමෙන්, දුකද අත්හැරීමෙන්, කලින්ම සෝමනස්ස දෝමනස්සයන් අභාවයට පත්වීමෙන්, දුක්ද නැති, සැපද නැති, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සතර වන ධ්‍යානයට පැමිණ වාසය කරයි. මෙහිදී උපන් සෝමනස්සින්ද්‍රිය ඉතිරි නොවන සේ නිරුද්ධ වේ. මහණෙනි, මේ භික්ෂුව සෝමනස්සින්ද්‍රියෙහි නිරෝධය දැනගත්තේය, එයට සිත යොදවන්නේය යි කියනු ලැබේ.\n\nමහණෙනි, මෙහිලා අප්‍රමාදීව, කෙලෙස් තවන වීරියෙන්, සිත යොමා වසන භික්ෂුවට උපේක්ඛින්ද්‍රිය හටගනී. හෙතෙම මෙසේ දනී: ‘මට මේ උපේක්ඛින්ද්‍රිය උපන්නේය. එය නිමිති සහිතව, හේතු සහිතව, සංස්කාර සහිතව, ප්‍ර‍ත්‍ය සහිතව උපන්නේය. නිමිති රහිතව, හේතු රහිතව, සංස්කාර රහිතව, ප්‍ර‍ත්‍ය රහිතව උපේක්ඛින්ද්‍රියක් උපදිනු ඇතැයි’ කියා එය විය නොහැකි තැනකි.\n\nඔහු උපේක්ඛින්ද්‍රිය ද දනී, උපේක්ඛින්ද්‍රියෙහි හටගැනීම ද දනී, උපේක්ඛින්ද්‍රියෙහි නිරෝධය ද දනී, යම් තැනක හටගත් උපේක්ඛින්ද්‍රිය අවශේෂයක් නැතිව නිරුද්ධ වේද එය ද දනී. හටගත් උපේක්ඛින්ද්‍රිය අවශේෂයක් නැතිව නිරුද්ධ වන්නේ කොතැනකද?\n\nමහණෙනි, මෙහිලා භික්ෂුව නේවසඤ්ඤානාසඤ්ඤායතනය මුළුමනින්ම ඉක්මවා සඤ්ඤාවේදයිතනිරෝධයට පැමිණ වාසය කරයි, මෙහිදී හටගත් උපේක්ඛින්ද්‍රිය අවශේෂයක් නැතිව නිරුද්ධ වේ. මහණෙනි, මෙය මෙසේ කියනු ලැබේ: 'භික්ෂුව උපේක්ඛින්ද්‍රියෙහි නිරෝධය දැනගත්තේය, ඒ සඳහා සිත යොමු කළේය' යනුවෙන්.\n\nදසවෙනි සූත්‍රයයි. සුඛින්ද්‍රිය වර්ගය සිවුවන වර්ගයයි. එහි උද්දානය මෙසේය: සුද්ධික සූත්‍රය ද, සෝත සූත්‍රය ද, අරහ සූත්‍රය ද, ශ්‍රමණබ්‍රාහ්මණ සූත්‍ර දෙක ද, විභංග සූත්‍රයෙන් තුනක් ද කියන ලදී, කට්ඨ සූත්‍රය සහ උප්පටිපාටික සූත්‍රය ද වේ.",
      "paliTitle": "Uppaṭipāṭikasuttaṃ",
      "englishTitle": "The Discourse on the Irregular",
      "sinhalaTitle": "උප්පටිපාටික සූත්‍රය"
    },
    {
      "number": 511,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito pacchātape nisinno hoti piṭṭhiṃ otāpayamāno. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā bhagavato gattāni pāṇinā anomajjanto bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Na cevaṃ dāni, bhante, bhagavato tāva parisuddho chavivaṇṇo pariyodāto, sithilāni ca gattāni sabbāni valiyajātāni, purato pabbhāro ca kāyo, dissati ca indriyānaṃ aññathattaṃ – cakkhundriyassa sotindriyassa ghānindriyassa jivhindriyassa kāyindriyassā’’ti. ‘‘Evañhetaṃ, ānanda, hoti – jarādhammo yobbaññe, byādhidhammo ārogye, maraṇadhammo jīvite. Na ceva tāva parisuddho hoti chavivaṇṇo pariyodāto, sithilāni ca honti gattāni sabbāni valiyajātāni, purato pabbhāro ca kāyo, dissati ca indriyānaṃ aññathattaṃ – cakkhundriyassa sotindriyassa ghānindriyassa jivhindriyassa kāyindriyassā’’ti. ‘‘Idamavoca bhagavā. Idaṃ vatvā ca sugato athāparaṃ etadavoca satthā – ‘‘Dhī taṃ jammi jare atthu, dubbaṇṇakaraṇī jare; Tāva manoramaṃ bimbaṃ, jarāya abhimadditaṃ. ‘‘Yopi vassasataṃ jīve, sopi maccuparāyaṇo [sabbe maccuparāyanā (syā. kaṃ. ka.)]; Na kiñci parivajjeti, sabbamevābhimaddatī’’ti. paṭhamaṃ;",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Sāvatthī, at the Eastern Park, in Migāra's mother's mansion.\n\nAt that time, the Blessed One, having emerged from his solitary retreat in the evening, was seated, warming his back in the setting sun. Then, the Venerable Ānanda approached the Blessed One. Having approached and paid homage to the Blessed One, while gently massaging the Blessed One's limbs with his hand, he said to him:\n\n\"It is wonderful, Venerable Sir! It is astounding, Venerable Sir! For now, Venerable Sir, the Blessed One’s skin color is no longer so pure and radiant, his limbs are all slack and wrinkled, his body is bent forward, and there is a noticeable change in the faculties — the eye-faculty, the ear-faculty, the nose-faculty, the tongue-faculty, and the body-faculty.\"\n\n\"So it is, Ānanda. This is how it is. Youth is subject to aging, health is subject to illness, life is subject to death. For now, the skin color is no longer so pure and radiant, the limbs are all slack and wrinkled, the body is bent forward, and there is a noticeable change in the faculties — the eye-faculty, the ear-faculty, the nose-faculty, the tongue-faculty, and the body-faculty.\"\n\nThis is what the Blessed One said. Having said this, the Sugata, the Teacher, further spoke this:\n\n\"Shame on you, despicable old age! Old age, you maker of ugliness! That once delightful form is now crushed by old age.\nEven one who lives for a hundred years is bound for death. Old age spares nothing; it crushes everything.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී.\n\nඑක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයෙහි මිගාරමාතු ප්‍රාසාදයෙහි වාසය කරන සේක. ඒ කල්හි භාග්‍යවතුන් වහන්සේ සවස් වේලාවෙහි ප්‍රතිසල්ලීන භාවයෙන් නැගිට, පසුපස හිරු රැස් වැටෙන සේ, තමන්ගේ පිට උණුසුම් කරමින් වැඩ සිටි සේක. ඉන්පසු ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, භාග්‍යවතුන් වහන්සේගේ ශරීරය අතින් පිරිමදිමින්, භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: ‘‘ආශ්චර්‍යයකි භාග්‍යවතුන් වහන්ස, අද්භූතයකි භාග්‍යවතුන් වහන්ස! දැන් භාග්‍යවතුන් වහන්සේගේ ශරීර වර්ණය එතරම්ම පිරිසිදු නොවේ, ප්‍රභාමත් නොවේ. සියලුම ශරීර අවයව ලිහිල් වී රැළි වැටී ඇත. ශරීරය ඉදිරියට නැමී ඇත. ඇස්, කන්, නාසා, දිව, ශරීරය යන ඉන්ද්‍රියන්ගේ විපරීත භාවයද දක්නට ලැබේ.’’\n\n‘‘ආනන්දය, මෙය මෙසේම සිදු වේ. යෞවනයෙහි ජරාවට පත්වීම ස්වභාවයකි. නිරෝගී භාවයෙහි රෝගී වීම ස්වභාවයකි. ජීවිතයෙහි මරණයට පත්වීම ස්වභාවයකි. ශරීර වර්ණය එතරම්ම පිරිසිදු නොවේ, ප්‍රභාමත් නොවේ. සියලුම ශරීර අවයව ලිහිල් වී රැළි වැටී ඇත. ශරීරය ඉදිරියට නැමී ඇත. ඇස්, කන්, නාසා, දිව, ශරීරය යන ඉන්ද්‍රියන්ගේ විපරීත භාවයද දක්නට ලැබේ.’’\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මේ කාරණය වදාළ සුගතයන් වහන්සේ ඉන්පසු ශාස්තෘන් වහන්සේ වශයෙන් මෙයද වදාළ සේක:\n\n‘‘දුෂ්ට වූ ජරාවට ධික්කාරය වේවා! වර්ණය විනාශ කරන්නා වූ ජරාවට ධික්කාරය වේවා!\nඑතරම් මනෝරම් වූ ශරීරයක් ද ජරාව විසින් තලා පෙළා දමන ලදී.\nයමෙක් අවුරුදු සියයක් ජීවත් වුවද, ඔහු ද මරණය අවසාන කොට ඇත්තෙකි.\nකිසිවක් ම මඟ හරවා නොගනියි, සියල්ලම තලා පෙළා දමයි.’’",
      "paliTitle": "Jarādhammasuttaṃ",
      "vagga": "Jarāvaggo",
      "englishTitle": "The Nature of Decay Sutta",
      "sinhalaTitle": "ජරාධම්ම සූත්‍රය",
      "vaggaEnglish": "Chapter on Old Age",
      "vaggaSinhala": "ජරා වර්ගය"
    },
    {
      "number": 512,
      "pali": "Sāvatthinidānaṃ. Atha kho uṇṇābho brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uṇṇābho brāhmaṇo bhagavantaṃ etadavoca – ‘‘Pañcimāni, bho gotama, indriyāni nānāvisayāni nānāgocarāni, na aññamaññassa gocaravisayaṃ paccanubhonti. Katamāni pañca? Cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imesaṃ nu kho, bho gotama, pañcannaṃ indriyānaṃ nānāvisayānaṃ nānāgocarānaṃ na aññamaññassa gocaravisayaṃ paccanubhontānaṃ kiṃ paṭisaraṇaṃ, ko ca nesaṃ gocaravisayaṃ paccanubhotī’’ti? ‘‘Pañcimāni, brāhmaṇa, indriyāni nānāvisayāni nānāgocarāni na aññamaññassa gocaravisayaṃ paccanubhonti. Katamāni pañca? Cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. Imesaṃ kho, brāhmaṇa, pañcannaṃ indriyānaṃ nānāvisayānaṃ nānāgocarānaṃ na aññamaññassa gocaravisayaṃ paccanubhontānaṃ mano paṭisaraṇaṃ, manova nesaṃ gocaravisayaṃ paccanubhotī’’ti. ‘‘Manassa pana, bho gotama, kiṃ paṭisaraṇa’’nti? ‘‘Manassa kho, brāhmaṇa, sati paṭisaraṇa’’nti. ‘‘Satiyā pana, bho gotama, kiṃ paṭisaraṇa’’nti? ‘‘Satiyā kho, brāhmaṇa, vimutti paṭisaraṇa’’nti. ‘‘Vimuttiyā pana, bho gotama, kiṃ paṭisaraṇa’’nti? ‘‘Vimuttiyā kho, brāhmaṇa, nibbānaṃ paṭisaraṇa’’nti. ‘‘Nibbānassa pana, bho gotama, kiṃ paṭisaraṇa’’nti? ‘‘Accayāsi [accasarā (sī. syā. kaṃ.), ajjhaparaṃ (pī. ka.)], brāhmaṇa, pañhaṃ, nāsakkhi pañhassa pariyantaṃ gahetuṃ. Nibbānogadhañhi, brāhmaṇa, brahmacariyaṃ vussati nibbānaparāyaṇaṃ nibbānapariyosāna’’nti. Atha kho uṇṇābho brāhmaṇo bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā acirapakkante uṇṇābhe brāhmaṇe bhikkhū āmantesi – ‘‘seyyathāpi, bhikkhave, kūṭāgāre vā kūṭāgārasālāyaṃ vā [rasmiyo (syā. ka.)] pācīnavātapānā sūriye uggacchante vātapānena rasmi [kūṭāgāraṃ vā kūṭāgārasālaṃ vā uttarāya (ka. sī.)] pavisitvā kvāssa [kāya (syā. ka.)] patiṭṭhitā’’ti? ‘‘Pacchimāyaṃ, bhante, bhittiya’’nti. ‘‘Evameva kho, bhikkhave, uṇṇābhassa brāhmaṇassa tathāgate saddhā niviṭṭhā mūlajātā patiṭṭhitā daḷhā asaṃhāriyā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Imamhi ce, bhikkhave, samaye uṇṇābho brāhmaṇo kālaṅkareyya, natthi saṃyojanaṃ yena saṃyojanena saṃyutto uṇṇābho brāhmaṇo puna imaṃ lokaṃ āgaccheyyā’’ti. Dutiyaṃ.",
      "english": "At Sāvatthī.\n\nThen the brahmin Uṇṇābha approached the Blessed One. Having approached, he exchanged courteous and amiable greetings with the Blessed One. When the amiable conversation was concluded, he sat down to one side. Having sat to one side, the brahmin Uṇṇābha said to the Blessed One:\n\n“Good Gotama, these five faculties have different ranges, different pastures, and they do not experience each other’s range and pasture. What are these five? The faculty of sight, the faculty of hearing, the faculty of smell, the faculty of taste, and the faculty of touch. But for these five faculties, Good Gotama, which have different ranges, different pastures, and do not experience each other’s range and pasture, what is their recourse? What is it that experiences their range and pasture?”\n\n“Brahmin, these five faculties have different ranges, different pastures, and they do not experience each other’s range and pasture. What are these five? The faculty of sight, the faculty of hearing, the faculty of smell, the faculty of taste, and the faculty of touch. For these five faculties, brahmin, which have different ranges, different pastures, and do not experience each other’s range and pasture, the mind is their recourse; the mind indeed experiences their range and pasture.”\n\n“But what, Good Gotama, is the mind’s recourse?”\n\n“The mind’s recourse, brahmin, is mindfulness.”\n\n“But what, Good Gotama, is mindfulness’s recourse?”\n\n“Mindfulness’s recourse, brahmin, is liberation.”\n\n“But what, Good Gotama, is liberation’s recourse?”\n\n“Liberation’s recourse, brahmin, is Nibbāna.”\n\n“But what, Good Gotama, is Nibbāna’s recourse?”\n\n“You have overstepped the bounds of the question, brahmin; you were unable to grasp the limit of the question. For the holy life, brahmin, is lived with Nibbāna as its ground, Nibbāna as its destination, Nibbāna as its ultimate goal.”\n\nThen the brahmin Uṇṇābha, having delighted in and approved of the Blessed One’s words, rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed.\n\nThen, not long after the brahmin Uṇṇābha had departed, the Blessed One addressed the bhikkhus: “Just as, bhikkhus, in a peaked house or a gabled hall, when a window faces east, and the sun rises, a sunbeam entering through that window where would it rest?”\n\n“On the western wall, Venerable Sir,” they replied.\n\n“Even so, bhikkhus, for the brahmin Uṇṇābha, faith in the Tathāgata is implanted, rooted, established, firm, and unshakeable by any ascetic, brahmin, deva, Māra, Brahmā, or anyone in the world. If, bhikkhus, at this moment the brahmin Uṇṇābha were to die, there is no fetter by which the brahmin Uṇṇābha is bound, that he would return to this world again.”",
      "sinhala": "සැවැත් නුවරදී කරන ලද ප්‍රකාශයකි.\n\nඉක්බිති උණ්ණාභ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බස් හුවමාරු කරගෙන එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වූ උණ්ණාභ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘භවත් ගෞතමයන් වහන්ස, මේ ඉන්ද්‍රියයන් පසක් ඇත. ඒවා නානාවිධ විෂයයන් ඇත්තාහ, නානාවිධ ගෝචරයන් ඇත්තාහ. ඒවා එකිනෙකාගේ ගෝචර විෂයයන් අනුභව නොකරත්. ඒ පස කවරේද? චක්ඛු ඉන්ද්‍රිය, සෝත ඉන්ද්‍රිය, ඝාණ ඉන්ද්‍රිය, ජිව්හා ඉන්ද්‍රිය, කාය ඉන්ද්‍රිය යන මේවාය. භවත් ගෞතමයන් වහන්ස, මෙසේ නානාවිධ විෂයයන් හා නානාවිධ ගෝචරයන් ඇති, එකිනෙකාගේ ගෝචර විෂයයන් අනුභව නොකරන මේ ඉන්ද්‍රියයන් පසට කුමක්ද පිහිට වන්නේ? කුමක්ද ඒ ඉන්ද්‍රියයන්ගේ ගෝචර විෂයයන් අනුභව කරන්නේ?’’ ‘‘බ්‍රාහ්මණ, මේ ඉන්ද්‍රියයන් පසක් ඇත. ඒවා නානාවිධ විෂයයන් ඇත්තාහ, නානාවිධ ගෝචරයන් ඇත්තාහ. ඒවා එකිනෙකාගේ ගෝචර විෂයයන් අනුභව නොකරත්. ඒ පස කවරේද? චක්ඛු ඉන්ද්‍රිය, සෝත ඉන්ද්‍රිය, ඝාණ ඉන්ද්‍රිය, ජිව්හා ඉන්ද්‍රිය, කාය ඉන්ද්‍රිය යන මේවාය. බ්‍රාහ්මණ, මෙසේ නානාවිධ විෂයයන් හා නානාවිධ ගෝචරයන් ඇති, එකිනෙකාගේ ගෝචර විෂයයන් අනුභව නොකරන මේ ඉන්ද්‍රියයන් පසට මනස පිහිට වෙයි. මනසම ඒවායේ ගෝචර විෂයයන් අනුභව කරයි.’’ ‘‘එසේ නම් භවත් ගෞතමයන් වහන්ස, මනසට කුමක්ද පිහිට වන්නේ?’’ ‘‘බ්‍රාහ්මණ, මනසට සතිය පිහිට වෙයි.’’ ‘‘එසේ නම් භවත් ගෞතමයන් වහන්ස, සතියට කුමක්ද පිහිට වන්නේ?’’ ‘‘බ්‍රාහ්මණ, සතියට විමුක්තිය පිහිට වෙයි.’’ ‘‘එසේ නම් භවත් ගෞතමයන් වහන්ස, විමුක්තියට කුමක්ද පිහිට වන්නේ?’’ ‘‘බ්‍රාහ්මණ, විමුක්තියට නිබ්බාණය පිහිට වෙයි.’’ ‘‘එසේ නම් භවත් ගෞතමයන් වහන්ස, නිබ්බාණයට කුමක්ද පිහිට වන්නේ?’’ ‘‘බ්‍රාහ්මණ, ඔබ ප්‍රශ්නය ඉක්මවා ගියේය. ප්‍රශ්නයේ කෙළවර දැකීමට නොහැකි විය. බ්‍රාහ්මණ, නිබ්බාණය අවසානය කොටගෙන, නිබ්බාණය පරමායනය කොටගෙන, නිබ්බාණය අවසන් කෙළවර කොටගෙන බ්‍රහ්මචරියාව වාසය කරනු ලැබේ.’’ ඉක්බිති උණ්ණාභ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේගේ වචනය අගය කොට, සතුටු වී, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, පැදකුණු කොට නික්ම ගියේය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ උණ්ණාභ බ්‍රාහ්මණයා නික්ම ගොස් වැඩි වේලාවක් ගතවීමටත් පෙර භික්ෂූන් අමතා මෙසේ වදාළ සේක: ‘‘මහණෙනි, යම්සේ පියසිගෙයක හෝ පියසිගෙයි ශාලාවක හෝ නැගෙනහිර දිශාවට ඇති කවුළුවකින් හිරු නැගෙන විට හිරු එළිය ඇතුල් වී කොහි පිහිටා තිබේද?’’ ‘‘වහන්ස, බටහිර බිත්තියේය.’’ ‘‘එසෙවම මහණෙනි, උණ්ණාභ බ්‍රාහ්මණයාගේ තථාගතයන් වහන්සේ කෙරෙහි ඇති ශ්‍රද්ධාව මුල් ඇදගත්, පිහිටා සිටි, ස්ථිර වූ, ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ දෙවියෙකුට හෝ මාරයෙකුට හෝ බ්‍රහ්මයෙකුට හෝ ලෝකයේ කිසිවෙකුටවත් සෙලවිය නොහැකි එකක් වෙයි. මහණෙනි, උණ්ණාභ බ්‍රාහ්මණ තෙමේ මේ මොහොතේ මියයන්නේ නම්, ඔහු යම් සංයෝජනයකින් බැඳී නැවත මේ ලෝකයට එන්නේද, එබඳු සංයෝජනයක් නොමැත.’’",
      "paliTitle": "Uṇṇābhabrāhmaṇasuttaṃ",
      "englishTitle": "Uṇṇābha the Brahmin Sutta",
      "sinhalaTitle": "උණ්ණාභ බ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 513,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sākete viharati añjanavane migadāye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘atthi nu kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma yāni pañcindriyāni tāni pañca balāni honti, yāni pañca balāni tāni pañcindriyāni hontī’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Atthi, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma yāni pañcindriyāni tāni pañca balāni honti, yāni pañca balāni tāni pañcindriyāni honti’’. ‘‘Katamo ca, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma yāni pañcindriyāni tāni pañca balāni honti, yāni pañca balāni tāni pañcindriyāni honti? Yaṃ, bhikkhave, saddhindriyaṃ taṃ saddhābalaṃ, yaṃ saddhābalaṃ taṃ saddhindriyaṃ; yaṃ vīriyindriyaṃ taṃ vīriyabalaṃ, yaṃ vīriyabalaṃ taṃ vīriyindriyaṃ; yaṃ satindriyaṃ taṃ satibalaṃ, yaṃ satibalaṃ taṃ satindriyaṃ; yaṃ samādhindriyaṃ taṃ samādhibalaṃ, yaṃ samādhibalaṃ taṃ samādhindriyaṃ; yaṃ paññindriyaṃ taṃ paññābalaṃ, yaṃ paññābalaṃ taṃ paññindriyaṃ. Seyyathāpi, bhikkhave, nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā, tassa majjhe dīpo. Atthi, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma tassā nadiyā eko soto tveva saṅkhyaṃ gacchati [saṅkhaṃ (sī. syā. kaṃ.)]. Atthi pana, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma tassā nadiyā dve sotāni tveva saṅkhyaṃ gacchanti. ‘‘Katamo ca, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma tassā nadiyā eko soto tveva saṅkhyaṃ gacchati? Yañca, bhikkhave, tassa dīpassa purimante [puratthimante (sī. syā. kaṃ. pī.)] udakaṃ, yañca pacchimante udakaṃ – ayaṃ kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma tassā nadiyā eko soto tveva saṅkhyaṃ gacchati. ‘‘Katamo ca, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma tassā nadiyā dve sotāni tveva saṅkhyaṃ gacchanti? Yañca, bhikkhave, tassa dīpassa uttarante udakaṃ, yañca dakkhiṇante udakaṃ – ayaṃ kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma tassā nadiyā dve sotāni tveva saṅkhyaṃ gacchanti. Evameva kho, bhikkhave, yaṃ saddhindriyaṃ taṃ saddhābalaṃ, yaṃ saddhābalaṃ taṃ saddhindriyaṃ; yaṃ vīriyindriyaṃ taṃ vīriyabalaṃ, yaṃ vīriyabalaṃ taṃ vīriyindriyaṃ; yaṃ satindriyaṃ taṃ satibalaṃ, yaṃ satibalaṃ taṃ satindriyaṃ; yaṃ samādhindriyaṃ taṃ samādhibalaṃ, yaṃ samādhibalaṃ taṃ samādhindriyaṃ; yaṃ paññindriyaṃ taṃ paññābalaṃ, yaṃ paññābalaṃ taṃ paññindriyaṃ. Pañcannaṃ, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Tatiyaṃ.",
      "english": "Thus have I heard – on one occasion, the Blessed One was dwelling in Sāketa, in the Añjana Wood, at the Deer Park. There, the Blessed One addressed the monks: “Is there, monks, a way, by resorting to which way, the five faculties of faith, energy, mindfulness, concentration, and wisdom become the five powers, and the five powers become the five faculties?”\n\nThe monks replied: “For us, Venerable Sir, the teachings have the Blessed One as their root, the Blessed One as their guide, the Blessed One as their refuge. It would be excellent, Venerable Sir, if the Blessed One himself would illuminate the meaning of this statement. Having heard it from the Blessed One, the monks will bear it in mind.”\n\n“There is, monks, a way, by resorting to which way, the five faculties become the five powers, and the five powers become the five faculties.”\n\n“And what, monks, is that way, by resorting to which way, the five faculties become the five powers, and the five powers become the five faculties? The faculty of faith, monks, is the power of faith, and the power of faith is the faculty of faith. The faculty of energy is the power of energy, and the power of energy is the faculty of energy. The faculty of mindfulness is the power of mindfulness, and the power of mindfulness is the faculty of mindfulness. The faculty of concentration is the power of concentration, and the power of concentration is the faculty of concentration. The faculty of wisdom is the power of wisdom, and the power of wisdom is the faculty of wisdom.”\n\n“Just as, monks, there is a river flowing eastward, tending eastward, inclining eastward, and in its middle there is an island. There is, monks, a way, by resorting to which way, that river is reckoned as just one stream. But there is also, monks, a way, by resorting to which way, that river is reckoned as two streams.”\n\n“And what, monks, is that way, by resorting to which way, that river is reckoned as just one stream? When, monks, one considers the water on the eastern side of that island, and the water on its western side – this, monks, is the way, by resorting to which way, that river is reckoned as just one stream.”\n\n“And what, monks, is that way, by resorting to which way, that river is reckoned as two streams? When, monks, one considers the water on the northern side of that island, and the water on its southern side – this, monks, is the way, by resorting to which way, that river is reckoned as two streams.”\n\n“In the same way, monks, the faculty of faith is the power of faith, and the power of faith is the faculty of faith. The faculty of energy is the power of energy, and the power of energy is the faculty of energy. The faculty of mindfulness is the power of mindfulness, and the power of mindfulness is the faculty of mindfulness. The faculty of concentration is the power of concentration, and the power of concentration is the faculty of concentration. The faculty of wisdom is the power of wisdom, and the power of wisdom is the faculty of wisdom.”\n\n“It is by developing and cultivating these five faculties, monks, that a monk, through the destruction of the taints, directly experiences for himself in this very life the taintless liberation of mind and liberation through wisdom, and abides therein.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සාකේත නුවර, අඤ්ජන වනයේ පිහිටි මුවවනයෙහි වැඩසිටින සේක.\n\nඑවේලෙහි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, යම් උපක්‍රමයක් ඇත්තේද, ඒ උපක්‍රමය නිසා යම් පංච ඉන්‍ද්‍රියයෝ පංච බලයන් වෙත්ද, යම් පංච බලයෝ පංච ඉන්‍ද්‍රියයන් වෙත්ද?”\n\n“ස්වාමීනි, අපගේ ධර්මයන්ට භාග්‍යවතුන් වහන්සේ මූලය වෙති. භාග්‍යවතුන් වහන්සේ ම මාර්ගෝපදේශක වෙති. භාග්‍යවතුන් වහන්සේම අපට පිහිට වෙති. ස්වාමීනි, යහපති, මේ වදාළ දේශනාවේ අර්ථය භාග්‍යවතුන් වහන්සේටම පැහැදේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය ධාරණය කරගන්නාහුය”යි.\n\n“මහණෙනි, යම් උපක්‍රමයක් ඇත්තේය, ඒ උපක්‍රමය නිසා යම් පංච ඉන්‍ද්‍රියයෝ පංච බලයන් වෙත්ද, යම් පංච බලයෝ පංච ඉන්‍ද්‍රියයන් වෙත්ද?”\n\n“මහණෙනි, යම් උපක්‍රමයක් නිසා යම් පංච ඉන්‍ද්‍රියයෝ පංච බලයන් වෙත්ද, යම් පංච බලයෝ පංච ඉන්‍ද්‍රියයන් වෙත්ද, ඒ උපක්‍රමය කවරේද? මහණෙනි, යම් ශ්‍රද්ධා ඉන්‍ද්‍රියයක් ඇත්ද, එය ශ්‍රද්ධා බලයයි. යම් ශ්‍රද්ධා බලයක් ඇත්ද, එය ශ්‍රද්ධා ඉන්‍ද්‍රියයයි. යම් වීර්ය ඉන්‍ද්‍රියයක් ඇත්ද, එය වීර්ය බලයයි. යම් වීර්ය බලයක් ඇත්ද, එය වීර්ය ඉන්‍ද්‍රියයයි. යම් සති ඉන්‍ද්‍රියයක් ඇත්ද, එය සති බලයයි. යම් සති බලයක් ඇත්ද, එය සති ඉන්‍ද්‍රියයයි. යම් සමාධි ඉන්‍ද්‍රියයක් ඇත්ද, එය සමාධි බලයයි. යම් සමාධි බලයක් ඇත්ද, එය සමාධි ඉන්‍ද්‍රියයයි. යම් ප්‍රඥා ඉන්‍ද්‍රියයක් ඇත්ද, එය ප්‍රඥා බලයයි. යම් ප්‍රඥා බලයක් ඇත්ද, එය ප්‍රඥා ඉන්‍ද්‍රියයයි.\n\nමහණෙනි, යම් සේ ගංගාවක් ඇත්ද, එය නැගෙනහිරට පහත බසින සුළුය, නැගෙනහිරට නැඹුරුය, නැගෙනහිරට ගලා බසින සුළුය. එහි මැද දූපතක් ඇත. මහණෙනි, යම් උපක්‍රමයක් ඇත්තේය, ඒ උපක්‍රමය නිසා ඒ ගංගාව එකම දහරාවක් ලෙස ගණන් ගනු ලැබේ. මහණෙනි, තවද, යම් උපක්‍රමයක් ඇත්තේය, ඒ උපක්‍රමය නිසා ඒ ගංගාව දහරාවන් දෙකක් ලෙස ගණන් ගනු ලැබේ.\n\n“මහණෙනි, යම් උපක්‍රමයක් නිසා ඒ ගංගාව එකම දහරාවක් ලෙස ගණන් ගනු ලැබේ, ඒ උපක්‍රමය කවරේද? මහණෙනි, ඒ දූපතේ නැගෙනහිර පැත්තේ ඇති ජලයත්, බටහිර පැත්තේ ඇති ජලයත්, මෙයයි ඒ උපක්‍රමය, යම් උපක්‍රමයක් නිසා ඒ ගංගාව එකම දහරාවක් ලෙස ගණන් ගනු ලැබේ.\n\n“මහණෙනි, යම් උපක්‍රමයක් නිසා ඒ ගංගාව දහරාවන් දෙකක් ලෙස ගණන් ගනු ලැබේ, ඒ උපක්‍රමය කවරේද? මහණෙනි, ඒ දූපතේ උතුරු පැත්තේ ඇති ජලයත්, දකුණු පැත්තේ ඇති ජලයත්, මෙයයි ඒ උපක්‍රමය, යම් උපක්‍රමයක් නිසා ඒ ගංගාව දහරාවන් දෙකක් ලෙස ගණන් ගනු ලැබේ.\n\nමහණෙනි, එපරිද්දෙන්ම, යම් ශ්‍රද්ධා ඉන්‍ද්‍රියයක් ඇත්ද, එය ශ්‍රද්ධා බලයයි. යම් ශ්‍රද්ධා බලයක් ඇත්ද, එය ශ්‍රද්ධා ඉන්‍ද්‍රියයයි. යම් වීර්ය ඉන්‍ද්‍රියයක් ඇත්ද, එය වීර්ය බලයයි. යම් වීර්ය බලයක් ඇත්ද, එය වීර්ය ඉන්‍ද්‍රියයයි. යම් සති ඉන්‍ද්‍රියයක් ඇත්ද, එය සති බලයයි. යම් සති බලයක් ඇත්ද, එය සති ඉන්‍ද්‍රියයයි. යම් සමාධි ඉන්‍ද්‍රියයක් ඇත්ද, එය සමාධි බලයයි. යම් සමාධි බලයක් ඇත්ද, එය සමාධි ඉන්‍ද්‍රියයයි. යම් ප්‍රඥා ඉන්‍ද්‍රියයක් ඇත්ද, එය ප්‍රඥා බලයයි. යම් ප්‍රඥා බලයක් ඇත්ද, එය ප්‍රඥා ඉන්‍ද්‍රියයයි. මහණෙනි, මේ පංච ඉන්‍ද්‍රියයන් වැඩීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය මෙලොවදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට වාසය කරයි.”",
      "paliTitle": "Sāketasuttaṃ",
      "englishTitle": "The Discourse at Sāketa",
      "sinhalaTitle": "සාකේත සූත්‍රය"
    },
    {
      "number": 514,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbakoṭṭhake. Tatra kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘saddahasi [saddahāsi (sī. pī.)] tvaṃ, sāriputta – saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosāna’’nti? ‘‘Na khvāhaṃ ettha, bhante, bhagavato saddhāya gacchāmi – saddhindriyaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ. Yesañhetaṃ, bhante, aññātaṃ assa adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ [apassitaṃ (sī. syā. kaṃ. ka.), aphusitaṃ (pī.)] paññāya, te tattha paresaṃ saddhāya gaccheyyuṃ – saddhindriyaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ. Yesañca kho etaṃ, bhante, ñātaṃ diṭṭhaṃ viditaṃ sacchikataṃ phassitaṃ paññāya, nikkaṅkhā te tattha nibbicikicchā – saddhindriyaṃ… pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ. Mayhañca kho etaṃ, bhante, ñātaṃ diṭṭhaṃ viditaṃ sacchikataṃ phassitaṃ paññāya. Nikkaṅkhavāhaṃ tattha nibbicikiccho saddhindriyaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosāna’’nti. ‘‘Sādhu sādhu, sāriputta! Yesañhetaṃ, sāriputta, aññātaṃ assa adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya, te tattha paresaṃ saddhāya gaccheyyuṃ – saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ. Yesañca kho etaṃ, sāriputta, ñātaṃ diṭṭhaṃ viditaṃ sacchikataṃ phassitaṃ paññāya, nikkaṅkhā te tattha nibbicikicchā – saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosāna’’nti. Catutthaṃ.",
      "english": "Thus have I heard – on one occasion the Blessed One was dwelling in Sāvatthī, in the Eastern Park. There, the Blessed One addressed the Venerable Sāriputta: “Do you have faith, Sāriputta, that the faculty of faith, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless; and similarly, that the faculty of wisdom, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless?”\n\n“Bhante, I do not accept this by relying solely on the Blessed One’s statement of faith – that the faculty of faith, and similarly, the faculty of wisdom, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless. For those, Bhante, for whom this is unknown, unseen, uncomprehended, unactualized, and unexperienced by wisdom, they might, in that case, proceed by the faith of others – that the faculty of faith, and similarly, the faculty of wisdom, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless. But for those, Bhante, for whom this is known, seen, comprehended, actualized, and experienced by wisdom, they are without doubt and without perplexity on that matter – that the faculty of faith, and similarly, the faculty of wisdom, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless. And for me, Bhante, this is known, seen, comprehended, actualized, and experienced by wisdom. Therefore, I am without doubt and without perplexity on that matter – that the faculty of faith, and similarly, the faculty of wisdom, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless.”\n\n“Excellent, excellent, Sāriputta! For those, Sāriputta, for whom this is unknown, unseen, uncomprehended, unactualized, and unexperienced by wisdom, they might, in that case, proceed by the faith of others – that the faculty of faith, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless; and similarly, that the faculty of wisdom, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless. But for those, Sāriputta, for whom this is known, seen, comprehended, actualized, and experienced by wisdom, they are without doubt and without perplexity on that matter – that the faculty of faith, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless; and similarly, that the faculty of wisdom, when developed and frequently practiced, leads to the Deathless, has the Deathless as its destination, and culminates in the Deathless.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයෙහි වැඩසිටින සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ශ්‍රී‍්‍ර සාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ ඇමතූ සේක: “සාරිපුත්තය, ශ්‍රද්ධා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්... (මේ අයුරින්ම)... ප්‍රඥා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත් නුඹ විශ්වාස කරන්නෙහිද?”\n\n“වහන්ස, මේ කාරණයෙහිදී මම භාග්‍යවතුන් වහන්සේගේ වචනය විශ්වාස කොට යන්නේ නැත – ශ්‍රද්ධා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්... (මේ අයුරින්ම)... ප්‍රඥා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්.\n\nවහන්ස, යමෙකුට මේ (කාරණය) ප්‍රඥාවෙන් නොදන්නා ලද්දක්, නොදක්නා ලද්දක්, විශේෂයෙන් නොදන්නා ලද්දක්, ප්‍රත්‍යක්ෂ නොකරන ලද්දක්, ස්පර්ශ නොකරන ලද්දක් වේ නම්, ඔවුහු ඒ කාරණයෙහිදී අනුන්ගේ විශ්වාසය මත යන්නාහ – ශ්‍රද්ධා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්... (මේ අයුරින්ම)... ප්‍රඥා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්.\n\nවහන්ස, යමෙකුට මේ (කාරණය) ප්‍රඥාවෙන් දන්නා ලද්දක්, දක්නා ලද්දක්, විශේෂයෙන් දන්නා ලද්දක්, ප්‍රත්‍යක්ෂ කරන ලද්දක්, ස්පර්ශ කරන ලද්දක් වේ නම්, ඔවුහු ඒ කාරණයෙහිදී සැක රහිත වෙති, විචිකිච්ඡා රහිත වෙති – ශ්‍රද්ධා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්... (මේ අයුරින්ම)... ප්‍රඥා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්.\n\nවහන්ස, මට නම් මේ (කාරණය) ප්‍රඥාවෙන් දන්නා ලද්දක්, දක්නා ලද්දක්, විශේෂයෙන් දන්නා ලද්දක්, ප්‍රත්‍යක්ෂ කරන ලද්දක්, ස්පර්ශ කරන ලද්දකි. එබැවින් මම ඒ කාරණයෙහිදී සැක රහිතයෙමි, විචිකිච්ඡා රහිතයෙමි – ශ්‍රද්ධා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්... (මේ අයුරින්ම)... ප්‍රඥා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්.”\n\n“සාධු, සාධු, සාරිපුත්තය! සාරිපුත්තය, යමෙකුට මේ (කාරණය) ප්‍රඥාවෙන් නොදන්නා ලද්දක්, නොදක්නා ලද්දක්, විශේෂයෙන් නොදන්නා ලද්දක්, ප්‍රත්‍යක්ෂ නොකරන ලද්දක්, ස්පර්ශ නොකරන ලද්දක් වේ නම්, ඔවුහු ඒ කාරණයෙහිදී අනුන්ගේ විශ්වාසය මත යන්නාහ – ශ්‍රද්ධා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්... (මේ අයුරින්ම)... ප්‍රඥා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්.\n\nසාරිපුත්තය, යමෙකුට මේ (කාරණය) ප්‍රඥාවෙන් දන්නා ලද්දක්, දක්නා ලද්දක්, විශේෂයෙන් දන්නා ලද්දක්, ප්‍රත්‍යක්ෂ කරන ලද්දක්, ස්පර්ශ කරන ලද්දක් වේ නම්, ඔවුහු ඒ කාරණයෙහිදී සැක රහිත වෙති, විචිකිච්ඡා රහිත වෙති – ශ්‍රද්ධා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්... (මේ අයුරින්ම)... ප්‍රඥා ඉන්ද්‍රිය වඩන ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ, අමා මහ නිවනට පිවිසෙන්නා වූ, අමා මහ නිවන පරම කොට ඇති, අමා මහ නිවන කෙළවර කොට ඇති බවත්.”",
      "paliTitle": "Pubbakoṭṭhakasuttaṃ",
      "englishTitle": "The Discourse at the Eastern Gatehouse",
      "sinhalaTitle": "පුබ්බකෝට්ඨක සූත්‍රය"
    },
    {
      "number": 515,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tatra kho bhagavā bhikkhū āmantesi – ‘‘katinaṃ nu kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘ekassa kho, bhikkhave, indriyassa bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmīti. Katamassa ekassa paññindriyassa paññavato, bhikkhave, ariyasāvakassa tadanvayā saddhā saṇṭhāti, tadanvayaṃ vīriyaṃ saṇṭhāti, tadanvayā sati saṇṭhāti, tadanvayo samādhi saṇṭhāti. Imassa kho, bhikkhave, ekassa indriyassa bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti. Pañcamaṃ.",
      "english": "Thus have I heard. At one time the Blessed One was staying in Sāvatthī, at Pubbārāma, Migāra's mother's mansion. There, the Blessed One addressed the bhikkhus, \"By the development and abundant cultivation of how many faculties, bhikkhus, does a bhikkhu whose taints are destroyed declare profound knowledge: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being beyond this,' so I know?\" \"Venerable sir, our teachings are rooted in the Blessed One, they have the Blessed One as their guide and refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the bhikkhus will remember it.\" \"By the development and abundant cultivation of one faculty, bhikkhus, does a bhikkhu whose taints are destroyed declare profound knowledge: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being beyond this,' so I know.\" \"Which one? The faculty of wisdom. For a noble disciple, bhikkhus, who possesses wisdom, in consequence of that, faith becomes established, in consequence of that, effort becomes established, in consequence of that, mindfulness becomes established, and in consequence of that, concentration becomes established. By the development and abundant cultivation of this one faculty, bhikkhus, does a bhikkhu whose taints are destroyed declare profound knowledge: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being beyond this,' so I know.\" The Fifth.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයේ මිගාරමාතු ප්‍රාසාදයේ වැඩවසන සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, කිනම් ඉන්ද්‍රියයන් කීපයක් වැඩීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන් ක්‍ෂීණාශ්‍රව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ විය, කළ යුතු දේ කෙරිණි, මේ තත්ත්වයෙන් තවත් කිසිවක් කළ යුතු නැතැයි දනිමි’ යැයි අන්‍යත්වය ප්‍රකාශ කරන්නේද?”\n\nවහන්ස, අපගේ ධර්ම කරුණු භාග්‍යවතුන් වහන්සේ මූල කොට ඇත්තේය, භාග්‍යවතුන් වහන්සේ නෙත් කොට ඇත්තේය, භාග්‍යවතුන් වහන්සේ පිළිසරණ කොට ඇත්තේය. වහන්ස, භාග්‍යවතුන් වහන්සේම මේ ධර්ම දේශනාව පැහැදිලි කරන සේක්වා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරන්නාහ.\n\n“මහණෙනි, එකම ඉන්ද්‍රියයක් වැඩීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන් ක්‍ෂීණාශ්‍රව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ විය, කළ යුතු දේ කෙරිණි, මේ තත්ත්වයෙන් තවත් කිසිවක් කළ යුතු නැතැයි දනිමි’ යැයි අන්‍යත්වය ප්‍රකාශ කරන්නේය. ඒ කවර එකක්ද? ප්‍රඥා ඉන්ද්‍රියයයි. මහණෙනි, ප්‍රඥාවන්ත ආර්ය ශ්‍රාවකයාට ඒ අනුව ශ්‍රද්ධාව පිහිටයි, ඒ අනුව වීර්යය පිහිටයි, ඒ අනුව සතිය පිහිටයි, ඒ අනුව සමාධිය පිහිටයි. මහණෙනි, මේ එකම ඉන්ද්‍රියයක් වැඩීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන් ක්‍ෂීණාශ්‍රව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ විය, කළ යුතු දේ කෙරිණි, මේ තත්ත්වයෙන් තවත් කිසිවක් කළ යුතු නැතැයි දනිමි’ යැයි අන්‍යත්වය ප්‍රකාශ කරන්නේය.”\n\nපස්වැන්න.",
      "paliTitle": "Paṭhamapubbārāmasuttaṃ",
      "englishTitle": "The First Discourse at Pubbārāma",
      "sinhalaTitle": "පළමු පුබ්බාරාම සූත්‍රය"
    },
    {
      "number": 516,
      "pali": "Taṃyeva nidānaṃ. ‘‘Katinaṃ nu kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘dvinnaṃ kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmīti. Katamesaṃ dvinnaṃ? Ariyāya ca paññāya, ariyāya ca vimuttiyā. Yā hissa, bhikkhave, ariyā paññā tadassa paññindriyaṃ. Yā hissa, bhikkhave, ariyā vimutti tadassa samādhindriyaṃ. Imesaṃ kho, bhikkhave, dvinnaṃ indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti. Chaṭṭhaṃ.",
      "english": "The setting for this discourse is the same.\n\n“Monks, by the development and cultivation of how many faculties does a bhikkhu whose defilements are destroyed declare knowledge, saying: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for me’?”\n\n“Venerable Sir, our teachings have the Blessed One as their root, their guide, and their refuge. It would be good if the Blessed One would explain the meaning of this statement. Having heard it from the Blessed One, the bhikkhus will remember it.”\n\n“Monks, by the development and cultivation of two faculties does a bhikkhu whose defilements are destroyed declare knowledge, saying: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for me.’ ”\n\n“Which two?”\n\n“Noble wisdom and noble liberation.”\n\n“For indeed, monks, that which is noble wisdom for him is his faculty of wisdom. And indeed, monks, that which is noble liberation for him is his faculty of concentration.”\n\n“Monks, by the development and cultivation of these two faculties does a bhikkhu whose defilements are destroyed declare knowledge, saying: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for me.’ ”\n\nThe Sixth.",
      "sinhala": "එමම නිදානයයි.\n\n“භික්ෂූන් වහන්ස, කොපමණ ඉන්ද්‍රියයන් දියුණු කිරීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන්ද, ඛීණාසව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මේ භවය සඳහා අන් කිසිවක් නැතැයි’ (අන් කිසිවක් කළ යුතු නැතැයි) ප්‍රකාශ කරන්නේ, මෙසේ දන්නේද?”\n\nභාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තා වූ අපගේ ධර්මයෝ වෙති, භාග්‍යවතුන් වහන්සේ විසින් මෙහෙයවනු ලැබුවා වූ ධර්මයෝ වෙති, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තා වූ ධර්මයෝ වෙති. ස්වාමීනි, මේ ප්‍රකාශයේ අර්ථය භාග්‍යවතුන් වහන්සේටම වැටහේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරන්නාහ.\n\n“භික්ෂූන් වහන්ස, ඉන්ද්‍රියයන් දෙකක් දියුණු කිරීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන්, ඛීණාසව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මේ භවය සඳහා අන් කිසිවක් නැතැයි’ (අන් කිසිවක් කළ යුතු නැතැයි) ප්‍රකාශ කරන්නේ, මෙසේ දන්නේය.” ඒ දෙක කවරේද? ආර්ය ප්‍රඥාවෙන්ද, ආර්ය විමුක්තියෙන්ද (යන මේ දෙකයි). භික්ෂූන් වහන්ස, යම් ආර්ය ප්‍රඥාවක් ඔහුට ඇත්තේද, එය ඔහුගේ ප්‍රඥා ඉන්ද්‍රිය වේ. භික්ෂූන් වහන්ස, යම් ආර්ය විමුක්තියක් ඔහුට ඇත්තේද, එය ඔහුගේ සමාධි ඉන්ද්‍රිය වේ. භික්ෂූන් වහන්ස, මේ ඉන්ද්‍රියයන් දෙක දියුණු කිරීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන්, ඛීණාසව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මේ භවය සඳහා අන් කිසිවක් නැතැයි’ (අන් කිසිවක් කළ යුතු නැතැයි) ප්‍රකාශ කරන්නේ, මෙසේ දන්නේය.",
      "paliTitle": "Dutiyapubbārāmasuttaṃ",
      "englishTitle": "Second Sutta at Pubbārāma",
      "sinhalaTitle": "දුතිය පුබ්බාරාම සූත්‍රය"
    },
    {
      "number": 517,
      "pali": "Taṃyeva nidānaṃ. ‘‘Katinaṃ nu kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘catunnaṃ kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmīti. Katamesaṃ catunnaṃ? Vīriyindriyassa, satindriyassa, samādhindriyassa, paññindriyassa – imesaṃ kho, bhikkhave, catunnaṃ indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti. Sattamaṃ.",
      "english": "\"Monks, by the development and cultivation of how many faculties does a monk whose defilements are destroyed make the declaration: 'Birth is destroyed, the spiritual life has been lived, what needed to be done has been done, there is nothing further for this state of being; I understand this'?\"\n\n\"Venerable sir, the teachings have the Blessed One as their root...\"\n\n\"Monks, it is through the development and cultivation of four faculties that a monk whose defilements are destroyed makes the declaration: 'Birth is destroyed, the spiritual life has been lived, what needed to be done has been done, there is nothing further for this state of being; I understand this'.\"\n\n\"Which four? The faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Monks, it is through the development and cultivation of these four faculties that a monk whose defilements are destroyed makes the declaration: 'Birth is destroyed, the spiritual life has been lived, what needed to be done has been done, there is nothing further for this state of being; I understand this'.\"",
      "sinhala": "එකම කාරණයයි.\n\nමහණෙනි, කෙතරම් ඉන්ද්‍රියයන් වැඩූ බැවින්ද, බහුල වශයෙන් පුරුදු කළ බැවින්ද ක්ෂීණාශ්‍රව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදි, කළ යුතු දේ කරන ලදි, මේ සඳහා මින් මත්තට කිසිවක් නැත’ යනුවෙන් (තමන්ගේ) අවබෝධය ප්‍රකාශ කරන්නේ?\n\nවහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ...\n\nමහණෙනි, සතර ඉන්ද්‍රියයන් වැඩූ බැවින්ද, බහුල වශයෙන් පුරුදු කළ බැවින්ද ක්ෂීණාශ්‍රව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදි, කළ යුතු දේ කරන ලදි, මේ සඳහා මින් මත්තට කිසිවක් නැත’ යනුවෙන් (තමන්ගේ) අවබෝධය ප්‍රකාශ කරයි.\n\nඒ සතර කුමක්ද?\n\nවීර්ය්‍ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය –\n\nමහණෙනි, මේ සතර ඉන්ද්‍රියයන් වැඩූ බැවින්ද, බහුල වශයෙන් පුරුදු කළ බැවින්ද ක්ෂීණාශ්‍රව භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදි, කළ යුතු දේ කරන ලදි, මේ සඳහා මින් මත්තට කිසිවක් නැත’ යනුවෙන් (තමන්ගේ) අවබෝධය ප්‍රකාශ කරයි.\n\nසත්වන සූත්‍රයයි.",
      "paliTitle": "Tatiyapubbārāmasuttaṃ",
      "englishTitle": "Third Discourse at the Eastern Monastery",
      "sinhalaTitle": "තතිය පුබ්බාරාම සූත්‍රය"
    },
    {
      "number": 518,
      "pali": "Taṃyeva nidānaṃ. ‘‘Katinaṃ nu kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘pañcannaṃ kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmīti. Katamesaṃ pañcannaṃ? Saddhindriyassa, vīriyindriyassa, satindriyassa, samādhindriyassa, paññindriyassa – imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ bhāvitattā bahulīkatattā khīṇāsavo bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti. Aṭṭhamaṃ.",
      "english": "The same occasion. “By the development and abundant cultivation of how many faculties, bhikkhus, does a bhikkhu whose taints are destroyed declare his supreme knowledge, saying, ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being beyond this’?”\n\n“Our teachings, venerable sir, have the Blessed One as their root, their guide, and their refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the bhikkhus will remember it.”\n\n“It is, bhikkhus, by the development and abundant cultivation of five faculties that a bhikkhu whose taints are destroyed declares his supreme knowledge, saying, ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being beyond this.’\n\nWhich five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. These are the five faculties, bhikkhus, by the development and abundant cultivation of which a bhikkhu whose taints are destroyed declares his supreme knowledge, saying, ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being beyond this.’”",
      "sinhala": "එයම නිදානයයි.\n\n“මහණෙනි, කෙලෙස් ක්ෂය කළ භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, නැවත මේ තත්ත්වයට පැමිණීමක් නැතැයි මම දනිමි’ යනුවෙන් විශේෂඥානය ප්‍රකාශ කරන්නේ කී ඉන්ද්‍රියයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද?”\n\n“වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහුය...පෙ...”.\n\n“මහණෙනි, පස් ඉන්ද්‍රියයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද කෙලෙස් ක්ෂය කළ භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, නැවත මේ තත්ත්වයට පැමිණීමක් නැතැයි මම දනිමි’ යනුවෙන් විශේෂඥානය ප්‍රකාශ කරයි.”\n\n“ඒ පස්දෙනා කවරහුද?”\n\n“සද්ධින්ද්‍රිය, වීරියෙන්ද්‍රිය, සතින්ද්‍රිය, සමාධින්ද්‍රිය, ප්‍රඥින්ද්‍රිය යන මේවායි. මහණෙනි, මේ පස් ඉන්ද්‍රියයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද කෙලෙස් ක්ෂය කළ භික්ෂුවක් ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, නැවත මේ තත්ත්වයට පැමිණීමක් නැතැයි මම දනිමි’ යනුවෙන් විශේෂඥානය ප්‍රකාශ කරයි.”\n\nඅටවැනි සූත්‍රයයි.",
      "paliTitle": "Catutthapubbārāmasuttaṃ",
      "englishTitle": "Fourth Sutta at Pubbārāma",
      "sinhalaTitle": "චතුත්ථ පුබ්බාරාම සූත්‍රය"
    },
    {
      "number": 519,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena āyasmatā piṇḍolabhāradvājena aññā byākatā hoti – ‘‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’ti. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘Āyasmatā, bhante, piṇḍolabhāradvājena aññā byākatā – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmīti. Kiṃ nu kho, bhante, atthavasaṃ sampassamānena āyasmatā piṇḍolabhāradvājena aññā byākatā – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti? ‘‘Tiṇṇannaṃ kho, bhikkhave, indriyānaṃ bhāvitattā bahulīkatattā piṇḍolabhāradvājena bhikkhunā aññā byākatā – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmīti. Katamesaṃ tiṇṇannaṃ? Satindriyassa, samādhindriyassa, paññindriyassa – imesaṃ kho, bhikkhave, tiṇṇannaṃ indriyānaṃ bhāvitattā bahulīkatattā piṇḍolabhāradvājena bhikkhunā aññā byākatā – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmīti. Imāni ca, bhikkhave, tīṇindriyāni kimantāni? Khayantāni. Kissa khayantāni? Jātijarāmaraṇassa. ‘Jātijarāmaraṇaṃ khaya’nti kho, bhikkhave, sampassamānena piṇḍolabhāradvājena bhikkhunā aññā byākatā – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāmī’’ti. Navamaṃ.",
      "english": "Thus have I heard – on one occasion the Blessed One was dwelling in Kosambī, at Ghosita's Park. Now at that time, Venerable Piṇḍola-Bhāradvāja had declared his final knowledge: \"Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for me to realize.\"\n\nThen a number of bhikkhus approached the Blessed One; having approached and paid homage to the Blessed One, they sat down to one side. As they sat to one side, those bhikkhus said to the Blessed One: \"Venerable sir, Venerable Piṇḍola-Bhāradvāja has declared his final knowledge: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for me to realize.’ Venerable sir, seeing what benefit, indeed, has Venerable Piṇḍola-Bhāradvāja declared his final knowledge: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for me to realize’?\"\n\n\"Bhikkhus, it is through developing and frequently practicing three faculties that the bhikkhu Piṇḍola-Bhāradvāja has declared his final knowledge: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for me to realize.’ Which three? The faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Bhikkhus, it is through developing and frequently practicing these three faculties that the bhikkhu Piṇḍola-Bhāradvāja has declared his final knowledge: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for me to realize.’ And what is the culmination of these three faculties, bhikkhus? Their culmination is cessation. The cessation of what? Of birth, aging, and death. Bhikkhus, it is by clearly seeing ‘the cessation of birth, aging, and death’ that the bhikkhu Piṇḍola-Bhāradvāja has declared his final knowledge: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for me to realize.’\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසම්බියෙහි ඝෝෂිතාරාමයෙහි වැඩවසන සේක.\n\nඑසමයෙහි ආයුෂ්මත් පිණ්ඩෝලභාරද්වාජ තෙරුන් වහන්සේ විසින් “ජාතිය ක්ෂය කරණ ලදී, බඹසර විසන ලදී, කළ යුත්ත කරන ලදී, මේ භවය සඳහා අන් කිසිවක් කළ යුත්තෙක් නැතැයි දනිමි” යැයි අර්හත්ඵලය ප්‍රකාශ කරන ලදී.\n\nඉන්පසු බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ – “වහන්ස, ආයුෂ්මත් පිණ්ඩෝලභාරද්වාජ තෙරුන් වහන්සේ විසින් ‘ජාතිය ක්ෂය කරණ ලදී, බඹසර විසන ලදී, කළ යුත්ත කරන ලදී, මේ භවය සඳහා අන් කිසිවක් කළ යුත්තෙක් නැතැයි දනිමි’ යැයි අර්හත්ඵලය ප්‍රකාශ කරන ලදී. වහන්ස, ආයුෂ්මත් පිණ්ඩෝලභාරද්වාජ තෙරුන් වහන්සේ කවර අර්ථයක් දැක, ‘ජාතිය ක්ෂය කරණ ලදී, බඹසර විසන ලදී, කළ යුත්ත කරන ලදී, මේ භවය සඳහා අන් කිසිවක් කළ යුත්තෙක් නැතැයි දනිමි’ යැයි අර්හත්ඵලය ප්‍රකාශ කරන ලද්දේද?”\n\n“මහණෙනි, පිණ්ඩෝලභාරද්වාජ භික්ෂුව විසින් තෙරක් ඉන්ද්‍රියයන් වැඩූ බැවින් ද, බහුල කළ බැවින් ද ‘ජාතිය ක්ෂය කරණ ලදී, බඹසර විසන ලදී, කළ යුත්ත කරන ලදී, මේ භවය සඳහා අන් කිසිවක් කළ යුත්තෙක් නැතැයි දනිමි’ යැයි අර්හත්ඵලය ප්‍රකාශ කරන ලදී. කවර තෙරකට ද? සති ඉන්ද්‍රියයේ ද, සමාධි ඉන්ද්‍රියයේ ද, ප්‍රඥා ඉන්ද්‍රියයේ ද (වැඩූ බැවින්). මහණෙනි, මේ තෙරක් ඉන්ද්‍රියයන් වැඩූ බැවින් ද, බහුල කළ බැවින් ද පිණ්ඩෝලභාරද්වාජ භික්ෂුව විසින් ‘ජාතිය ක්ෂය කරණ ලදී, බඹසර විසන ලදී, කළ යුත්ත කරන ලදී, මේ භවය සඳහා අන් කිසිවක් කළ යුත්තෙක් නැතැයි දනිමි’ යැයි අර්හත්ඵලය ප්‍රකාශ කරන ලදී. මහණෙනි, මේ ඉන්ද්‍රිය තුන කවර අන්තයක් ඇත්තාහු ද? ක්ෂය වන අන්තයක් ඇත්තාහු යි. කවරකගේ ක්ෂයක් ඇත්තාහු ද? ජාති, ජරා, මරණයේ. මහණෙනි, ‘ජාති, ජරා, මරණය ක්ෂය වන බව’ දකිමින් පිණ්ඩෝලභාරද්වාජ භික්ෂුව විසින් ‘ජාතිය ක්ෂය කරණ ලදී, බඹසර විසන ලදී, කළ යුත්ත කරන ලදී, මේ භවය සඳහා අන් කිසිවක් කළ යුත්තෙක් නැතැයි දනිමි’ යැයි අර්හත්ඵලය ප්‍රකාශ කරන ලදී.”",
      "paliTitle": "Piṇḍolabhāradvājasuttaṃ",
      "englishTitle": "The Discourse to Piṇḍola Bhāradvāja",
      "sinhalaTitle": "පිණ්ඩෝලභාරද්වාජ සූත්‍රය"
    },
    {
      "number": 520,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā aṅgesu viharati āpaṇaṃ nāma aṅgānaṃ nigamo. Tatra kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘yo so, sāriputta, ariyasāvako tathāgate ekantagato [ekantigato (sī.)] abhippasanno, na so tathāgate vā tathāgatasāsane vā kaṅkheyya vā vicikiccheyya vā’’ti? ‘‘Yo so, bhante, ariyasāvako tathāgate ekantagato abhippasanno, na so tathāgate vā tathāgatasāsane vā kaṅkheyya vā vicikiccheyya vā. Saddhassa hi, bhante, ariyasāvakassa evaṃ pāṭikaṅkhaṃ yaṃ āraddhavīriyo viharissati – akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yaṃ hissa, bhante, vīriyaṃ tadassa vīriyindriyaṃ. ‘‘Saddhassa hi, bhante, ariyasāvakassa āraddhavīriyassa etaṃ pāṭikaṅkhaṃ yaṃ satimā bhavissati, paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. Yā hissa, bhante, sati tadassa satindriyaṃ. ‘‘Saddhassa hi, bhante, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino etaṃ pāṭikaṅkhaṃ yaṃ vossaggārammaṇaṃ karitvā labhissati samādhiṃ, labhissati cittassa ekaggataṃ. Yo hissa, bhante, samādhi tadassa samādhindriyaṃ. ‘‘Saddhassa hi, bhante, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino samāhitacittassa etaṃ pāṭikaṅkhaṃ yaṃ evaṃ pajānissati – anamataggo kho saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Avijjāya tveva tamokāyassa asesavirāganirodho santametaṃ padaṃ paṇītametaṃ padaṃ, yadidaṃ – sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ [nibbānanti (?)]. Yā hissa, bhante, paññā tadassa paññindriyaṃ. ‘‘Saddho so [sa kho so (sī. syā. kaṃ.)], bhante, ariyasāvako evaṃ padahitvā padahitvā evaṃ saritvā saritvā evaṃ samādahitvā samādahitvā evaṃ pajānitvā pajānitvā evaṃ abhisaddahati – ‘ime kho te dhammā ye me pubbe sutavā ahesuṃ. Tenāhaṃ etarahi kāyena ca phusitvā viharāmi, paññāya ca ativijjha [paṭivijjha (sī. ka.) tadaṭṭhakathāsu pana ativijjhitvāti vaṇṇitaṃ] passāmī’ti. Yā hissa, bhante, saddhā tadassa saddhindriya’’nti. ‘‘Sādhu sādhu, sāriputta! Yo so, sāriputta, ariyasāvako tathāgate ekantagato abhippasanno, na so tathāgate vā tathāgatasāsane vā kaṅkheyya vā vicikiccheyya vā. Saddhassa hi, sāriputta, ariyasāvakassa etaṃ pāṭikaṅkhaṃ yaṃ āraddhavīriyo viharissati – akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yaṃ hissa, sāriputta, vīriyaṃ tadassa vīriyindriyaṃ. ‘‘Saddhassa hi, sāriputta, ariyasāvakassa āraddhavīriyassa etaṃ pāṭikaṅkhaṃ yaṃ satimā bhavissati, paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. Yā hissa, sāriputta, sati tadassa satindriyaṃ. ‘‘Saddhassa hi, sāriputta, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino etaṃ pāṭikaṅkhaṃ yaṃ vossaggārammaṇaṃ karitvā labhissati samādhiṃ, labhissati cittassa ekaggataṃ. Yo hissa, sāriputta, samādhi tadassa samādhindriyaṃ. ‘‘Saddhassa hi, sāriputta, ariyasāvakassa āraddhavīriyassa upaṭṭhitassatino samāhitacittassa etaṃ pāṭikaṅkhaṃ yaṃ evaṃ pajānissati – anamataggo kho saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Avijjāya tveva tamokāyassa asesavirāganirodho santametaṃ padaṃ paṇītametaṃ padaṃ, yadidaṃ – sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ. Yā hissa, sāriputta, paññā tadassa paññindriyaṃ. ‘‘Saddho so [sa kho so (sī. syā. kaṃ. pī.)], sāriputta, ariyasāvako evaṃ padahitvā padahitvā evaṃ saritvā saritvā evaṃ samādahitvā samādahitvā evaṃ pajānitvā pajānitvā evaṃ abhisaddahati – ‘ime kho te dhammā ye me pubbe sutavā ahesuṃ. Tenāhaṃ etarahi kāyena ca phusitvā viharāmi, paññāya ca ativijjha [paṭivijjha (ka. sī. ka.)] passāmī’ti. Yā hissa, sāriputta, saddhā tadassa saddhindriya’’nti. Dasamaṃ. Jarāvaggo pañcamo. Tassuddānaṃ – Jarā uṇṇābho brāhmaṇo, sāketo pubbakoṭṭhako; Pubbārāme ca cattāri, piṇḍolo āpaṇena cāti [saddhena te dasāti (syā. kaṃ. ka.)].",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling among the Angas, at a market town of the Angas named Āpaṇa.\n\nThere the Blessed One addressed Venerable Sāriputta: “Sāriputta, that noble disciple who is firmly established in the Tathāgata and deeply confident, would he doubt or waver concerning the Tathāgata or the Tathāgata’s Dispensation?”\n\n“Venerable sir, that noble disciple who is firmly established in the Tathāgata and deeply confident, would not doubt or waver concerning the Tathāgata or the Tathāgata’s Dispensation. Indeed, Venerable sir, it is to be expected of a noble disciple with faith that he will dwell with aroused energy for the abandoning of unwholesome states and for the acquisition of wholesome states, steadfast, firm in his exertion, not casting off the burden in wholesome states. And that energy of his, Venerable sir, is his faculty of energy.\n\n“Indeed, Venerable sir, it is to be expected of a noble disciple with faith and aroused energy that he will be mindful, endowed with supreme mindfulness and circumspection, one who recollects and remembers what was done and said long ago. And that mindfulness of his, Venerable sir, is his faculty of mindfulness.\n\n“Indeed, Venerable sir, it is to be expected of a noble disciple with faith, aroused energy, and established mindfulness that, having made relinquishment his object, he will attain concentration, he will attain one-pointedness of mind. And that concentration of his, Venerable sir, is his faculty of concentration.\n\n“Indeed, Venerable sir, it is to be expected of a noble disciple with faith, aroused energy, established mindfulness, and a concentrated mind that he will understand thus: ‘Unidentifiable is the beginning of saṃsāra. The prior end is not discerned for beings hindered by ignorance and fettered by craving, who have been transmigrating and wandering on. But with the fading away and cessation of ignorance, the dark mass, without any remainder, this state is peaceful, this state is sublime, namely, the stilling of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna.’ And that wisdom of his, Venerable sir, is his faculty of wisdom.\n\n“That noble disciple, Venerable sir, having exerted himself thus again and again, having recollected thus again and again, having concentrated thus again and again, having understood thus again and again, has such profound faith: ‘These are indeed those teachings that I have previously heard. Therefore, I now dwell having experienced them with the body, and I see them having penetrated them with wisdom.’ And that faith of his, Venerable sir, is his faculty of faith.”\n\n“Good, good, Sāriputta! That noble disciple who is firmly established in the Tathāgata and deeply confident, would not doubt or waver concerning the Tathāgata or the Tathāgata’s Dispensation. Indeed, Sāriputta, it is to be expected of a noble disciple with faith that he will dwell with aroused energy for the abandoning of unwholesome states and for the acquisition of wholesome states, steadfast, firm in his exertion, not casting off the burden in wholesome states. And that energy of his, Sāriputta, is his faculty of energy.\n\n“Indeed, Sāriputta, it is to be expected of a noble disciple with faith and aroused energy that he will be mindful, endowed with supreme mindfulness and circumspection, one who recollects and remembers what was done and said long ago. And that mindfulness of his, Sāriputta, is his faculty of mindfulness.\n\n“Indeed, Sāriputta, it is to be expected of a noble disciple with faith, aroused energy, and established mindfulness that, having made relinquishment his object, he will attain concentration, he will attain one-pointedness of mind. And that concentration of his, Sāriputta, is his faculty of concentration.\n\n“Indeed, Sāriputta, it is to be expected of a noble disciple with faith, aroused energy, established mindfulness, and a concentrated mind that he will understand thus: ‘Unidentifiable is the beginning of saṃsāra. The prior end is not discerned for beings hindered by ignorance and fettered by craving, who have been transmigrating and wandering on. But with the fading away and cessation of ignorance, the dark mass, without any remainder, this state is peaceful, this state is sublime, namely, the stilling of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna.’ And that wisdom of his, Sāriputta, is his faculty of wisdom.\n\n“That noble disciple, Sāriputta, having exerted himself thus again and again, having recollected thus again and again, having concentrated thus again and again, having understood thus again and again, has such profound faith: ‘These are indeed those teachings that I have previously heard. Therefore, I now dwell having experienced them with the body, and I see them having penetrated them with wisdom.’ And that faith of his, Sāriputta, is his faculty of faith.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ අංග ජනපදයේ, එහි ආපණ නම් නියම්ගමෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ශ\\u200D්‍රී සාරිපුත්ත ස්ථවිරයන් වහන්සේ අමතා වදාළ සේක: ‘‘සාරිපුත්තය, යම් ආර්ය ශ\\u200D්‍රාවකයෙක් තථාගතයන් වහන්සේ කෙරෙහි අචල ශ\\u200D්‍රද්ධාවෙන් යුතුව අතිශයින් පැහැදී සිටීද, හෙතෙම තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත සසුන කෙරෙහි හෝ සැක කරන්නේ නැත, දෙගිඩියාවට පත් වන්නේද නැත’’යි.\n\n‘‘වහන්ස, යම් ආර්ය ශ\\u200D්‍රාවකයෙක් තථාගතයන් වහන්සේ කෙරෙහි අචල ශ\\u200D්‍රද්ධාවෙන් යුතුව අතිශයින් පැහැදී සිටීද, හෙතෙම තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත සසුන කෙරෙහි හෝ සැක කරන්නේ නැත, දෙගිඩියාවට පත් වන්නේද නැත. වහන්ස, ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, අකුසල ධර්මයන් ප\\u200D්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, නොනැමුණු වීර්යයෙන්, දැඩි පරාක්\\u200Dරමයකින්, කුසල ධර්මයන්හි නොඅත්හළ කාර්යභාරයක් ඇතුව, වීර්යය අරඹා වාසය කරන බවයි. වහන්ස, ඔහුට යම් වීර්යයක් ඇත්ද, එය ඔහුගේ වීර්ය ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘වහන්ස, වීර්යය ආරම්භ කළ ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, අතිශයින්ම විශිෂ්ට සිහි නුවණින් යුතුව, බොහෝ කලකට පෙර කරන ලද දෙයක් හෝ බොහෝ කලකට පෙර කථා කරන ලද දෙයක් වුව සිහි කරමින්, නැවත නැවත සිහිපත් කරමින්, සිහි ඇත්තෙක් බවට පත් වන බවයි. වහන්ස, ඔහුට යම් සිහියක් ඇත්ද, එය ඔහුගේ සති ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘වහන්ස, වීර්යය ආරම්භ කළ, සිහිය පිහිටුවා ගත්, ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, නිදහස් වීම අරමුණු කොට සමාධිය ලබන බවයි, සිතේ එකඟතාව ලබන බවයි. වහන්ස, ඔහුට යම් සමාධියක් ඇත්ද, එය ඔහුගේ සමාධි ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘වහන්ස, වීර්යය ආරම්භ කළ, සිහිය පිහිටුවා ගත්, සමාහිත සිතක් ඇති ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, මෙසේ ප\\u200D්‍රඥාවෙන් අවබෝධ කරන බවයි: ‘සංසාරය ඇත්තේ මුලක් නොපෙනෙන සේ අනන්තය. අවිද්‍යාවෙන් වැසී, තෘෂ්ණා සංයෝජනයන්ගෙන් බැඳී, සැරිසරන සත්වයන්ගේ පූර්ව කෙළවරක් නොපැනෙයි. එහෙත් මේ අවිද්‍යා නම් අන්ධකාර සමූහය කිසිදු සේසයක් නොමැතිව මුළුමනින්ම දුරුවීමත්, නැති වී යාමත් නම් මේ අතිශයින් ශාන්ත වූ පදයයි, මේ අතිශයින් ප\\u200D්‍රණීත වූ පදයයි. එනම්, සියලු සංස්කාරයන් සංසිඳවීමයි, සියලු උපධීන් අත්හැරීමයි, තෘෂ්ණාව ක්ෂය කිරීමයි, විරාගයයි, නිරෝධයයි, නිර්වාණයයි. වහන්ස, ඔහුට යම් ප\\u200D්‍රඥාවක් ඇත්ද, එය ඔහුගේ ප\\u200D්‍රඥා ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘වහන්ස, ඒ ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයා මෙසේ වීර්යය කරමින් කරමින්, මෙසේ සිහි කරමින් සිහි කරමින්, මෙසේ සමාධිමත් කරමින් සමාධිමත් කරමින්, මෙසේ ප\\u200D්‍රඥාවෙන් අවබෝධ කරමින් අවබෝධ කරමින්, මෙසේ අතිශයින්ම විශ්වාස කරයි. ‘පෙර මා විසින් අසන ලද මේ ධර්මයන්ම යි. එමනිසා මම දැන් කයින්ද ස්පර්ශ කරමින් වාසය කරමි, ප\\u200D්‍රඥාවෙන්ද විනිවිද දකිමි.’ වහන්ස, ඔහුට යම් ශ\\u200D්‍රද්ධාවක් ඇත්ද, එය ඔහුගේ ශ\\u200D්‍රද්ධා ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘සාධු! සාධු! සාරිපුත්තය! සාරිපුත්තය, යම් ආර්ය ශ\\u200D්‍රාවකයෙක් තථාගතයන් වහන්සේ කෙරෙහි අචල ශ\\u200D්‍රද්ධාවෙන් යුතුව අතිශයින් පැහැදී සිටීද, හෙතෙම තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත සසුන කෙරෙහි හෝ සැක කරන්නේ නැත, දෙගිඩියාවට පත් වන්නේද නැත. සාරිපුත්තය, ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, අකුසල ධර්මයන් ප\\u200D්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, නොනැමුණු වීර්යයෙන්, දැඩි පරාක්\\u200Dරමයකින්, කුසල ධර්මයන්හි නොඅත්හළ කාර්යභාරයක් ඇතුව, වීර්යය අරඹා වාසය කරන බවයි. සාරිපුත්තය, ඔහුට යම් වීර්යයක් ඇත්ද, එය ඔහුගේ වීර්ය ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘සාරිපුත්තය, වීර්යය ආරම්භ කළ ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, අතිශයින්ම විශිෂ්ට සිහි නුවණින් යුතුව, බොහෝ කලකට පෙර කරන ලද දෙයක් හෝ බොහෝ කලකට පෙර කථා කරන ලද දෙයක් වුව සිහි කරමින්, නැවත නැවත සිහිපත් කරමින්, සිහි ඇත්තෙක් බවට පත් වන බවයි. සාරිපුත්තය, ඔහුට යම් සිහියක් ඇත්ද, එය ඔහුගේ සති ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘සාරිපුත්තය, වීර්යය ආරම්භ කළ, සිහිය පිහිටුවා ගත්, ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, නිදහස් වීම අරමුණු කොට සමාධිය ලබන බවයි, සිතේ එකඟතාව ලබන බවයි. සාරිපුත්තය, ඔහුට යම් සමාධියක් ඇත්ද, එය ඔහුගේ සමාධි ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘සාරිපුත්තය, වීර්යය ආරම්භ කළ, සිහිය පිහිටුවා ගත්, සමාහිත සිතක් ඇති ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයාට මේ අයුරින් බලාපොරොත්තු විය හැක. එනම්, මෙසේ ප\\u200D්‍රඥාවෙන් අවබෝධ කරන බවයි: ‘සංසාරය ඇත්තේ මුලක් නොපෙනෙන සේ අනන්තය. අවිද්‍යාවෙන් වැසී, තෘෂ්ණා සංයෝජනයන්ගෙන් බැඳී, සැරිසරන සත්වයන්ගේ පූර්ව කෙළවරක් නොපැනෙයි. එහෙත් මේ අවිද්‍යා නම් අන්ධකාර සමූහය කිසිදු සේසයක් නොමැතිව මුළුමනින්ම දුරුවීමත්, නැති වී යාමත් නම් මේ අතිශයින් ශාන්ත වූ පදයයි, මේ අතිශයින් ප\\u200D්‍රණීත වූ පදයයි. එනම්, සියලු සංස්කාරයන් සංසිඳවීමයි, සියලු උපධීන් අත්හැරීමයි, තෘෂ්ණාව ක්ෂය කිරීමයි, විරාගයයි, නිරෝධයයි, නිර්වාණයයි. සාරිපුත්තය, ඔහුට යම් ප\\u200D්‍රඥාවක් ඇත්ද, එය ඔහුගේ ප\\u200D්‍රඥා ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’\n\n‘‘සාරිපුත්තය, ඒ ශ\\u200D්‍රද්ධාවන්ත ආර්ය ශ\\u200D්‍රාවකයා මෙසේ වීර්යය කරමින් කරමින්, මෙසේ සිහි කරමින් සිහි කරමින්, මෙසේ සමාධිමත් කරමින් සමාධිමත් කරමින්, මෙසේ ප\\u200D්‍රඥාවෙන් අවබෝධ කරමින් අවබෝධ කරමින්, මෙසේ අතිශයින්ම විශ්වාස කරයි. ‘පෙර මා විසින් අසන ලද මේ ධර්මයන්ම යි. එමනිසා මම දැන් කයින්ද ස්පර්ශ කරමින් වාසය කරමි, ප\\u200D්‍රඥාවෙන්ද විනිවිද දකිමි.’ සාරිපුත්තය, ඔහුට යම් ශ\\u200D්‍රද්ධාවක් ඇත්ද, එය ඔහුගේ ශ\\u200D්‍රද්ධා ඉන්ද\\u200D්‍රිය බවට පත් වන්නේය.’’",
      "paliTitle": "Āpaṇasuttaṃ",
      "englishTitle": "The Discourse at Āpaṇa",
      "sinhalaTitle": "ආපණ සූත්‍රය"
    },
    {
      "number": 521,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu viharati sālāya brāhmaṇagāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘seyyathāpi, bhikkhave, ye keci tiracchānagatā pāṇā, sīho migarājā tesaṃ aggamakkhāyati, yadidaṃ – thāmena javena sūrena [sūriyena (sī. syā. kaṃ.)]; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāya’’. ‘‘Katame ca, bhikkhave, bodhipakkhiyā dhammā? Saddhindriyaṃ, bhikkhave, bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati; vīriyindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati; satindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati; samādhindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati; paññindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Seyyathāpi, bhikkhave, ye keci tiracchānagatā pāṇā, sīho migarājā tesaṃ aggamakkhāyati, yadidaṃ – thāmena javena sūrena; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāyā’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard: At one time the Blessed One was dwelling among the Kosalans, in the brahmin village of Sālā. There, indeed, the Blessed One addressed the bhikkhus: “Just as, bhikkhus, among whatever sentient beings of the animal realm, the lion, king of beasts, is declared to be the foremost among them, that is, in strength, in swiftness, and in courage; even so, bhikkhus, among whatever qualities pertain to enlightenment, the faculty of wisdom is declared to be the foremost among them, that is, for enlightenment.” “And what, bhikkhus, are the qualities pertaining to enlightenment? The faculty of faith, bhikkhus, is a quality pertaining to enlightenment; it conduces to enlightenment. The faculty of energy is a quality pertaining to enlightenment; it conduces to enlightenment. The faculty of mindfulness is a quality pertaining to enlightenment; it conduces to enlightenment. The faculty of concentration is a quality pertaining to enlightenment; it conduces to enlightenment. The faculty of wisdom is a quality pertaining to enlightenment; it conduces to enlightenment. Just as, bhikkhus, among whatever sentient beings of the animal realm, the lion, king of beasts, is declared to be the foremost among them, that is, in strength, in swiftness, and in courage; even so, bhikkhus, among whatever qualities pertaining to enlightenment, the faculty of wisdom is declared to be the foremost among them, that is, for enlightenment.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයේ සාලා නම් බ්‍රාහ්මණ ගමෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, යම් සේ තිරිසන්ගත ප්‍රාණීන් අතුරෙන් සිංහරාජයා, එනම් ශක්තියෙන්ද, වේගයෙන්ද, ශූරභාවයෙන්ද, අග්‍ර යැයි කියනු ලැබේ ද; එලෙසින්ම මහණෙනි, යම් කිසි බෝධි පාක්ෂික ධර්මයන් වේ ද, ඒ සියල්ල අතුරින් ප්‍රඥා ඉන්ද්‍රිය බෝධිය පිණිස අග්‍ර යැයි කියනු ලැබේ.”\n\n“මහණෙනි, බෝධි පාක්ෂික ධර්මයන් කවරේ ද? මහණෙනි, ශ්‍රද්ධා ඉන්ද්‍රිය බෝධි පාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී; වීර්ය ඉන්ද්‍රිය බෝධි පාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී; සති ඉන්ද්‍රිය බෝධි පාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී; සමාධි ඉන්ද්‍රිය බෝධි පාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී; ප්‍රඥා ඉන්ද්‍රිය බෝධි පාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී. මහණෙනි, යම් සේ තිරිසන්ගත ප්‍රාණීන් අතුරෙන් සිංහරාජයා, එනම් ශක්තියෙන්ද, වේගයෙන්ද, ශූරභාවයෙන්ද, අග්‍ර යැයි කියනු ලැබේ ද; එලෙසින්ම මහණෙනි, යම් කිසි බෝධි පාක්ෂික ධර්මයන් වේ ද, ඒ සියල්ල අතුරින් ප්‍රඥා ඉන්ද්‍රිය බෝධිය පිණිස අග්‍ර යැයි කියනු ලැබේ” යි. පළමුවැන්නයි.",
      "paliTitle": "Sālasuttaṃ",
      "vagga": "Sūkarakhatavaggo",
      "englishTitle": "The Discourse at Sālā",
      "sinhalaTitle": "සාල සූත්‍රය",
      "vaggaEnglish": "The Chapter on the Boar’s Cave",
      "vaggaSinhala": "සූකරඛත වර්ගය"
    },
    {
      "number": 522,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā mallesu [mallakesu (sī. syā. kaṃ.), mallikesu (ka.)] viharati uruvelakappaṃ nāma mallānaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi – ‘‘yāvakīvañca, bhikkhave, ariyasāvakassa ariyañāṇaṃ na uppannaṃ hoti neva tāva catunnaṃ indriyānaṃ saṇṭhiti hoti, neva tāva catunnaṃ indriyānaṃ avaṭṭhiti hoti. Yato ca kho, bhikkhave, ariyasāvakassa ariyañāṇaṃ uppannaṃ hoti, atha catunnaṃ indriyānaṃ saṇṭhiti hoti, atha catunnaṃ indriyānaṃ avaṭṭhiti hoti’’. ‘‘Seyyathāpi, bhikkhave, yāvakīvañca kūṭāgārassa kūṭaṃ na ussitaṃ hoti, neva tāva gopānasīnaṃ saṇṭhiti hoti, neva tāva gopānasīnaṃ avaṭṭhiti hoti. Yato ca kho, bhikkhave, kūṭāgārassa kūṭaṃ ussitaṃ hoti, atha gopānasīnaṃ saṇṭhiti hoti, atha gopānasīnaṃ avaṭṭhiti hoti. Evameva kho, bhikkhave, yāvakīvañca ariyasāvakassa ariyañāṇaṃ na uppannaṃ hoti, neva tāva catunnaṃ indriyānaṃ saṇṭhiti hoti, neva tāva catunnaṃ indriyānaṃ avaṭṭhiti hoti. Yato ca kho, bhikkhave, ariyasāvakassa ariyañāṇaṃ uppannaṃ hoti, atha catunnaṃ indriyānaṃ…pe… avaṭṭhiti hoti. ‘‘Katamesaṃ catunnaṃ? Saddhindriyassa, vīriyindriyassa, satindriyassa, samādhindriyassa. Paññavato, bhikkhave, ariyasāvakassa tadanvayā saddhā saṇṭhāti, tadanvayaṃ vīriyaṃ saṇṭhāti, tadanvayā sati saṇṭhāti, tadanvayo samādhi saṇṭhātī’’ti. Dutiyaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling among the Mallas, in a Malla town named Uruvelakappa. There, the Blessed One addressed the monks: “Monks, as long as noble knowledge has not arisen in a noble disciple, then neither is there a firm establishment nor a stable persistence of the four faculties. But when, monks, noble knowledge has arisen in a noble disciple, then there is a firm establishment of the four faculties, and there is a stable persistence of the four faculties.”\n\n“Just as, monks, as long as the peak of a peaked house has not been raised, then neither is there a firm establishment nor a stable persistence of its roof-rafters. But when, monks, the peak of a peaked house has been raised, then there is a firm establishment of its roof-rafters, and there is a stable persistence of its roof-rafters. In the same way, monks, as long as noble knowledge has not arisen in a noble disciple, then neither is there a firm establishment nor a stable persistence of the four faculties. But when, monks, noble knowledge has arisen in a noble disciple, then there is a firm establishment of the four faculties, and there is a stable persistence of the four faculties.”\n\n“Which four? The faculty of conviction, the faculty of energy, the faculty of mindfulness, and the faculty of concentration. Monks, for a noble disciple endowed with wisdom, there is a conviction that follows from that and is firmly established, energy that follows from that and is firmly established, mindfulness that follows from that and is firmly established, and concentration that follows from that and is firmly established.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යZWJවතුන් වහන්සේ මල්ලවරුන්ගේ උරුවේලකප්ප නම් නගරයෙහි වැඩවසන සේක.\n\nඑසමයෙහි භාග්‍යZWJවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, යම්තාක් කල් ආර්‍ය්‍ය ශ්‍රාZWJවකයාට ආර්‍ය්‍ය ඥානය පහළ වී නොතිබේද, එතෙක් කල් සතර ඉන්ද්‍රියන්ගේ ස්ථිරවීමක් හෝ සතර ඉන්ද්‍රියන්ගේ නොසැලී පැවැත්මක් සිදු නොවේ.\n\nමහණෙනි, යම් කලෙක ආර්‍ය්‍ය ශ්‍රාZWJවකයාට ආර්‍ය්‍ය ඥානය පහළ වේද, එකල්හි සතර ඉන්ද්‍රියන්ගේ ස්ථිරවීමද, සතර ඉන්ද්‍රියන්ගේ නොසැලී පැවැත්මද සිදු වේ.”\n\n“මහණෙනි, යම්සේ යම්තාක් කල් මූණිස්සූ බුමුතුරුණුවලින් යුත් ගෙයක අග මුදුන නොනැඟූවේද, එතෙක් කල් වහලෙහි දඬු ස්ථිරවීමක් හෝ නොසැලී පැවැත්මක් සිදු නොවේ.\n\nමහණෙනි, යම් කලෙක මූණිස්සූ බුමුතුරුණුවලින් යුත් ගෙයක අග මුදුන නඟන ලද්දේද, එකල්හි වහලෙහි දඬු ස්ථිරවීමද, නොසැලී පැවැත්මද සිදු වේ.\n\nමහණෙනි, එපරිද්දෙන්ම යම්තාක් කල් ආර්‍ය්‍ය ශ්‍රාZWJවකයාට ආර්‍ය්‍ය ඥානය පහළ වී නොතිබේද, එතෙක් කල් සතර ඉන්ද්‍රියන්ගේ ස්ථිරවීමක් හෝ සතර ඉන්ද්‍රියන්ගේ නොසැලී පැවැත්මක් සිදු නොවේ.\n\nමහණෙනි, යම් කලෙක ආර්‍ය්‍ය ශ්‍රාZWJවකයාට ආර්‍ය්‍ය ඥානය පහළ වේද, එකල්හි සතර ඉන්ද්‍රියන්ගේ ස්ථිරවීමද, සතර ඉන්ද්‍රියන්ගේ නොසැලී පැවැත්මද සිදු වේ.\n\n“කවර සතරකගේද? ශ්‍රද්ධා ඉන්ද්‍රියයේ, වීර්‍ය්‍ය ඉන්ද්‍රියයේ, සති ඉන්ද්‍රියයේ, සමාධි ඉන්ද්‍රියයේ.\n\nමහණෙනි, ප්‍රZWJඥාවන්ත ආර්‍ය්‍ය ශ්‍රාZWJවකයාට ඒ ප්‍රZWJඥාවට අනුගත වූ ශ්‍රද්ධාව පිහිටයි, ඒ ප්‍රZWJඥාවට අනුගත වූ වීර්‍ය්‍යය පිහිටයි, ඒ ප්‍රZWJඥාවට අනුගත වූ සතිය පිහිටයි, ඒ ප්‍රZWJඥාවට අනුගත වූ සමාධිය පිහිටයි.”",
      "paliTitle": "Mallikasuttaṃ",
      "englishTitle": "To Mallikā Sutta",
      "sinhalaTitle": "මල්ලිකා සූත්‍රය"
    },
    {
      "number": 523,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘atthi nu kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma sekho bhikkhu sekhabhūmiyaṃ ṭhito ‘sekhosmī’ti pajāneyya, asekho bhikkhu asekhabhūmiyaṃ ṭhito ‘asekhosmī’ti pajāneyyā’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘atthi, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma sekho bhikkhu sekhabhūmiyaṃ ṭhito ‘sekhosmī’ti pajāneyya, asekho bhikkhu asekhabhūmiyaṃ ṭhito ‘asekhosmī’ti pajāneyya’’. ‘‘Katamo ca, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma sekho bhikkhu sekhabhūmiyaṃ ṭhito ‘sekhosmī’ti pajānāti? Idha, bhikkhave, sekho bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti – ayampi kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma sekho bhikkhu sekhabhūmiyaṃ ṭhito ‘sekhosmī’ti pajānāti’’. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu iti paṭisañcikkhati – ‘atthi nu kho ito bahiddhā añño samaṇo vā brāhmaṇo vā yo evaṃ bhūtaṃ tacchaṃ tathaṃ dhammaṃ deseti yathā bhagavā’ti? So evaṃ pajānāti – ‘natthi kho ito bahiddhā añño samaṇo vā brāhmaṇo vā yo evaṃ bhūtaṃ tacchaṃ tathaṃ dhammaṃ deseti yathā bhagavā’ti. Ayampi kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma sekho bhikkhu sekhabhūmiyaṃ ṭhito ‘sekhosmī’ti pajānāti’’. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu pañcindriyāni pajānāti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ – yaṃgatikāni yaṃparamāni yaṃphalāni yaṃpariyosānāni. Na heva kho kāyena phusitvā viharati; paññāya ca ativijjha passati. Ayampi kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma sekho bhikkhu sekhabhūmiyaṃ ṭhito ‘sekhosmī’ti pajānāti’’. ‘‘Katamo ca, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma asekho bhikkhu asekhabhūmiyaṃ ṭhito ‘asekhosmī’ti pajānāti? Idha, bhikkhave, asekho bhikkhu pañcindriyāni pajānāti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ – yaṃgatikāni yaṃparamāni yaṃphalāni yaṃpariyosānāni. Kāyena ca phusitvā viharati; paññāya ca ativijjha passati. Ayampi kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma asekho bhikkhu asekhabhūmiyaṃ ṭhito ‘asekhosmī’ti pajānāti’’. ‘‘Puna caparaṃ, bhikkhave, asekho bhikkhu cha indriyāni pajānāti. ‘Cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ, manindriyaṃ – imāni kho cha indriyāni sabbena sabbaṃ sabbathā sabbaṃ aparisesaṃ nirujjhissanti, aññāni ca cha indriyāni na kuhiñci kismiñci uppajjissantī’ti pajānāti. Ayampi kho, bhikkhave, pariyāyo yaṃ pariyāyaṃ āgamma asekho bhikkhu asekhabhūmiyaṃ ṭhito ‘asekhosmī’ti pajānātī’’ti. Tatiyaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Kosambi, at Ghosita's Park.\n\nThere, indeed, the Blessed One addressed the bhikkhus: “Is there, bhikkhus, a way by which a trainee bhikkhu, standing on the path of training, might know, ‘I am a trainee,’ and an adept bhikkhu, standing on the path of adepts, might know, ‘I am an adept’?”\n\n“Our teachings, venerable sir, have the Blessed One as their root, their guide, their refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the bhikkhus will remember it.”\n\n“There is, bhikkhus, a way by which a trainee bhikkhu, standing on the path of training, might know, ‘I am a trainee,’ and an adept bhikkhu, standing on the path of adepts, might know, ‘I am an adept.’ ”\n\n“And what, bhikkhus, is the way by which a trainee bhikkhu, standing on the path of training, knows, ‘I am a trainee’? Here, bhikkhus, a trainee bhikkhu understands suffering as it actually is, understands the origin of suffering as it actually is, understands the cessation of suffering as it actually is, and understands the path leading to the cessation of suffering as it actually is. This, bhikkhus, is a way by which a trainee bhikkhu, standing on the path of training, knows, ‘I am a trainee.’ ”\n\n“Furthermore, bhikkhus, a trainee bhikkhu reflects thus: ‘Is there, apart from this, any other recluse or brahmin who teaches a Dhamma that is so true, so real, so actual, as the Blessed One does?’ He understands thus: ‘Indeed, apart from this, there is no other recluse or brahmin who teaches a Dhamma that is so true, so real, so actual, as the Blessed One does.’ This, bhikkhus, is also a way by which a trainee bhikkhu, standing on the path of training, knows, ‘I am a trainee.’ ”\n\n“Furthermore, bhikkhus, a trainee bhikkhu understands the five spiritual faculties—the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom—knowing their progression, their culmination, their fruit, and their ultimate end. However, he does not yet dwell having directly touched it with the body; rather, he sees it by penetrating with wisdom. This, bhikkhus, is also a way by which a trainee bhikkhu, standing on the path of training, knows, ‘I am a trainee.’ ”\n\n“And what, bhikkhus, is the way by which an adept bhikkhu, standing on the path of adepts, knows, ‘I am an adept’? Here, bhikkhus, an adept bhikkhu understands the five spiritual faculties—the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom—knowing their progression, their culmination, their fruit, and their ultimate end. He dwells having directly touched them with the body; he also sees them by penetrating with wisdom. This, bhikkhus, is a way by which an adept bhikkhu, standing on the path of adepts, knows, ‘I am an adept.’ ”\n\n“Furthermore, bhikkhus, an adept bhikkhu understands the six sense faculties. He understands: ‘The faculty of sight, the faculty of hearing, the faculty of smell, the faculty of taste, the faculty of touch, and the faculty of mind—these six faculties will utterly, completely, and without remainder cease, and no other six faculties will arise anywhere, in any way.’ This, bhikkhus, is also a way by which an adept bhikkhu, standing on the path of adepts, knows, ‘I am an adept.’ ”",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කෝසම්බියෙහි ඝෝසිතාරාමයෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, යම් ක්‍රමයක් හෝ මාර්ගයක් ඇත්ද, ඒ ක්‍රමය හෝ මාර්ගය අරභයා ශික්ෂා කරන භික්ෂුව ශෛක්ෂ භූමියෙහි පිහිටා ‘මම ශික්ෂා කරන්නෙමි’යි දැනගනීද, අශික්ෂිත භික්ෂුව අශෛක්ෂ භූමියෙහි පිහිටා ‘මම අශික්ෂිතයෙක්මි’යි දැනගනීද?\" \"වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ. වහන්ස, එය භාග්‍යවතුන් වහන්සේම පැහැදිලි කළොත් මැනවි. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු සතුටු වන්නාහ.\" \"මහණෙනි, යම් ක්‍රමයක් හෝ මාර්ගයක් ඇත, ඒ ක්‍රමය හෝ මාර්ගය අරභයා ශික්ෂා කරන භික්ෂුව ශෛක්ෂ භූමියෙහි පිහිටා ‘මම ශික්ෂා කරන්නෙමි’යි දැනගනී, අශික්ෂිත භික්ෂුව අශෛක්ෂ භූමියෙහි පිහිටා ‘මම අශික්ෂිතයෙක්මි’යි දැනගනී.\"\n\n\"මහණෙනි, යම් ක්‍රමයක් හෝ මාර්ගයක් අරභයා ශික්ෂා කරන භික්ෂුව ශෛක්ෂ භූමියෙහි පිහිටා ‘මම ශික්ෂා කරන්නෙමි’යි දැනගනීද, ඒ ක්‍රමය හෝ මාර්ගය කුමක්ද? මහණෙනි, මෙහිලා ශික්ෂා කරන භික්ෂුව ‘මේ දුක යැයි’ යථාභූතව දැනගනී, ‘මේ දුක හටගැනීම යැයි’ යථාභූතව දැනගනී, ‘මේ දුක නැතිකිරීම යැයි’ යථාභූතව දැනගනී, ‘මේ දුක නැතිකිරීමට යන මාර්ගය යැයි’ යථාභූතව දැනගනී. මහණෙනි, මේද යම් ක්‍රමයක් හෝ මාර්ගයක් අරභයා ශික්ෂා කරන භික්ෂුව ශෛක්ෂ භූමියෙහි පිහිටා ‘මම ශික්ෂා කරන්නෙමි’යි දැනගනීද ඒ ක්‍රමය හෝ මාර්ගයයි.\"\n\n\"තවද, මහණෙනි, ශික්ෂා කරන භික්ෂුව මෙසේ විමසා බලයි: ‘මේ ශාසනයෙන් පිටත භාග්‍යවතුන් වහන්සේ දේශනා කරන ලද ආකාරයට සත්‍ය, යථාභූත, එසේම පවතින ධර්මයක් දේශනා කරන වෙනත් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් ඇත්ද?’ හෙතෙම මෙසේ දැනගනී: ‘භාග්‍යවතුන් වහන්සේ දේශනා කරන ලද ආකාරයට සත්‍ය, යථාභූත, එසේම පවතින ධර්මයක් දේශනා කරන වෙනත් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් මේ ශාසනයෙන් පිටත නැත.’ මහණෙනි, මේද යම් ක්‍රමයක් හෝ මාර්ගයක් අරභයා ශික්ෂා කරන භික්ෂුව ශෛක්ෂ භූමියෙහි පිහිටා ‘මම ශික්ෂා කරන්නෙමි’යි දැනගනීද ඒ ක්‍රමය හෝ මාර්ගයයි.\"\n\n\"තවද, මහණෙනි, ශික්ෂා කරන භික්ෂුව පංච ඉන්ද්‍රියයන් දැනගනී: ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්යය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය – ඒවායේ ගමන් මඟ, ප්‍රධානත්වය, ඵලය සහ අවසානය කුමක්දැයි දැනගනී. නමුදු, කයින් ස්පර්ශ කොට වාසය නොකරයි; ප්‍රඥාවෙන් විනිවිද දකියි. මහණෙනි, මේද යම් ක්‍රමයක් හෝ මාර්ගයක් අරභයා ශික්ෂා කරන භික්ෂුව ශෛක්ෂ භූමියෙහි පිහිටා ‘මම ශික්ෂා කරන්නෙමි’යි දැනගනීද ඒ ක්‍රමය හෝ මාර්ගයයි.\"\n\n\"මහණෙනි, යම් ක්‍රමයක් හෝ මාර්ගයක් අරභයා අශික්ෂිත භික්ෂුව අශෛක්ෂ භූමියෙහි පිහිටා ‘මම අශික්ෂිතයෙක්මි’යි දැනගනීද, ඒ ක්‍රමය හෝ මාර්ගය කුමක්ද? මහණෙනි, මෙහිලා අශික්ෂිත භික්ෂුව පංච ඉන්ද්‍රියයන් දැනගනී: ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්යය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය – ඒවායේ ගමන් මඟ, ප්‍රධානත්වය, ඵලය සහ අවසානය කුමක්දැයි දැනගනී. කයින්ද ස්පර්ශ කොට වාසය කරයි; ප්‍රඥාවෙන්ද විනිවිද දකියි. මහණෙනි, මේද යම් ක්‍රමයක් හෝ මාර්ගයක් අරභයා අශික්ෂිත භික්ෂුව අශෛක්ෂ භූමියෙහි පිහිටා ‘මම අශික්ෂිතයෙක්මි’යි දැනගනීද ඒ ක්‍රමය හෝ මාර්ගයයි.\"\n\n\"තවද, මහණෙනි, අශික්ෂිත භික්ෂුව ෂඩ් ඉන්ද්‍රියයන් දැනගනී: චක්ඛු ඉන්ද්‍රිය, සෝත ඉන්ද්‍රිය, ඝාණ ඉන්ද්‍රිය, ජිව්හා ඉන්ද්‍රිය, කාය ඉන්ද්‍රිය, මන ඉන්ද්‍රිය – ‘මේ ෂඩ් ඉන්ද්‍රියන් සියල්ල සම්පූර්ණයෙන්ම, සෑම අයුරකින්ම, අවශේෂයකින් තොරව නිරුද්ධ වනු ඇත, වෙනත් ෂඩ් ඉන්ද්‍රියන් කිසිම තැනක, කිසිම කල්හි නැවත හට නොගන්නා බවද’ දැනගනී. මහණෙනි, මේද යම් ක්‍රමයක් හෝ මාර්ගයක් අරභයා අශික්ෂිත භික්ෂුව අශෛක්ෂ භූමියෙහි පිහිටා ‘මම අශික්ෂිතයෙක්මි’යි දැනගනීද ඒ ක්‍රමය හෝ මාර්ගයයි.\"\n\nතෙවැන්න.",
      "paliTitle": "Sekhasuttaṃ",
      "englishTitle": "The Discourse on the Trainee",
      "sinhalaTitle": "සේඛ සූත්‍රය"
    },
    {
      "number": 524,
      "pali": "‘‘Seyyathāpi, bhikkhave, yāni kānici jaṅgalānaṃ [jaṅgamānaṃ (sī. pī.)] pāṇānaṃ padajātāni sabbāni tāni hatthipade samodhānaṃ gacchanti, hatthipadaṃ tesaṃ aggamakkhāyati, yadidaṃ – mahantattena; evameva kho, bhikkhave, yāni kānici padāni bodhāya saṃvattanti, paññindriyaṃ padaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāya. Katamāni ca, bhikkhave, padāni bodhāya saṃvattanti? Saddhindriyaṃ, bhikkhave, padaṃ, taṃ bodhāya saṃvattati; vīriyindriyaṃ padaṃ, taṃ bodhāya saṃvattati; satindriyaṃ padaṃ, taṃ bodhāya saṃvattati; samādhindriyaṃ padaṃ, taṃ bodhāya saṃvattati; paññindriyaṃ padaṃ, taṃ bodhāya saṃvattati. Seyyathāpi, bhikkhave, yāni kānici jaṅgalānaṃ pāṇānaṃ padajātāni sabbāni tāni hatthipade samodhānaṃ gacchanti, hatthipadaṃ tesaṃ aggamakkhāyati, yadidaṃ – mahantattena; evameva kho, bhikkhave, yāni kānici padāni bodhāya saṃvattanti, paññindriyaṃ padaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāyā’’ti. Catutthaṃ.",
      "english": "Just as, monks, whatever foot-tracks of land animals exist, all of them are encompassed within the elephant's footprint; the elephant's footprint is declared the foremost among them, by virtue of its greatness. In the same way, monks, whatever factors lead to awakening, the faculty of wisdom is declared the foremost factor among them, by virtue of its conduciveness to awakening.\n\nAnd what, monks, are the factors that lead to awakening? The faculty of faith, monks, is a factor; it leads to awakening. The faculty of energy is a factor; it leads to awakening. The faculty of mindfulness is a factor; it leads to awakening. The faculty of concentration is a factor; it leads to awakening. The faculty of wisdom is a factor; it leads to awakening.\n\nJust as, monks, whatever foot-tracks of land animals exist, all of them are encompassed within the elephant's footprint; the elephant's footprint is declared the foremost among them, by virtue of its greatness. In the same way, monks, whatever factors lead to awakening, the faculty of wisdom is declared the foremost factor among them, by virtue of its conduciveness to awakening.",
      "sinhala": "මහණෙනි, යම්සේ වනගත ප්‍රාණීන්ගේ යම්කිසි පා සටහන් ඇද්ද, ඒ සියල්ල ඇතෙකුගේ පා සටහනට ඇතුළත් වේ. එනම්, විශාලත්වය හේතුකොටගෙන, ඇතෙකුගේ පා සටහන ඒ සියල්ලට අග්‍ර යැයි කියනු ලැබේ. එලෙසම, මහණෙනි, යම්කිසි මාර්ග අංග බෝධිය පිණිස පවතීද, ප්‍රඥා ඉන්ද්‍රිය නම් වූ මාර්ග අංගය ඒ සියල්ලට අග්‍ර යැයි කියනු ලැබේ. එනම්, බෝධිය (අවබෝධය) පිණිස ය.\n\nමහණෙනි, බෝධිය පිණිස පවතින මාර්ග අංග කවරේද?\n\nමහණෙනි, ශ්‍රද්ධා ඉන්ද්‍රිය නම් වූ මාර්ග අංගය බෝධිය පිණිස පවතී. වීර්‍ය්‍ය ඉන්ද්‍රිය නම් වූ මාර්ග අංගය බෝධිය පිණිස පවතී. සති ඉන්ද්‍රිය නම් වූ මාර්ග අංගය බෝධිය පිණිස පවතී. සමාධි ඉන්ද්‍රිය නම් වූ මාර්ග අංගය බෝධිය පිණිස පවතී. ප්‍රඥා ඉන්ද්‍රිය නම් වූ මාර්ග අංගය බෝධිය පිණිස පවතී.\n\nමහණෙනි, යම්සේ වනගත ප්‍රාණීන්ගේ යම්කිසි පා සටහන් ඇද්ද, ඒ සියල්ල ඇතෙකුගේ පා සටහනට ඇතුළත් වේ. එනම්, විශාලත්වය හේතුකොටගෙන, ඇතෙකුගේ පා සටහන ඒ සියල්ලට අග්‍ර යැයි කියනු ලැබේ. එලෙසම, මහණෙනි, යම්කිසි මාර්ග අංග බෝධිය පිණිස පවතීද, ප්‍රඥා ඉන්ද්‍රිය නම් වූ මාර්ග අංගය ඒ සියල්ලට අග්‍ර යැයි කියනු ලැබේ. එනම්, බෝධිය (අවබෝධය) පිණිස ය.",
      "paliTitle": "Padasuttaṃ",
      "englishTitle": "The Footprint Sutta",
      "sinhalaTitle": "පද සූත්‍රය"
    },
    {
      "number": 525,
      "pali": "‘‘Seyyathāpi, bhikkhave, ye keci sāragandhā, lohitacandanaṃ tesaṃ aggamakkhāyati; evameva kho bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāya. Katame ca, bhikkhave, bodhipakkhiyā dhammā? Saddhindriyaṃ, bhikkhave, bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Vīriyindriyaṃ…pe… satindriyaṃ …pe… samādhindriyaṃ…pe… paññindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Seyyathāpi, bhikkhave, ye keci sāragandhā, lohitacandanaṃ tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāyā’’ti. Pañcamaṃ.",
      "english": "Just as, monks, among all heartwood fragrances, red sandalwood is declared foremost; even so, monks, among all factors conducive to enlightenment, the faculty of wisdom is declared foremost, that is, for the sake of awakening. And what, monks, are the factors conducive to enlightenment? The faculty of faith, monks, is a factor conducive to enlightenment; it leads to awakening. The faculty of effort, monks, is a factor conducive to enlightenment; it leads to awakening. The faculty of mindfulness, monks, is a factor conducive to enlightenment; it leads to awakening. The faculty of concentration, monks, is a factor conducive to enlightenment; it leads to awakening. The faculty of wisdom, monks, is a factor conducive to enlightenment; it leads to awakening. Just as, monks, among all heartwood fragrances, red sandalwood is declared foremost; even so, monks, among all factors conducive to enlightenment, the faculty of wisdom is declared foremost, that is, for the sake of awakening.",
      "sinhala": "මහණෙනි, යම්කිසි සාර ගන්ධ වර්ගයක් ඇද්ද, රත් සඳුන් ඒ අතර අග්‍U+200Dර යැයි කියනු ලැබේ; එපරිද්දෙන්ම මහණෙනි, යම්කිසි බෝධිපාක්ෂික ධර්මයක් ඇද්ද, ප්‍U+200Dරඥා ඉන්ද්‍රිය ඒ අතර අග්‍U+200Dර යැයි කියනු ලැබේ, එනම් බෝධිය සඳහා ය.\n\nමහණෙනි, කවරේද ඒ බෝධිපාක්ෂික ධර්මයෝ? මහණෙනි, ශ්‍රU+200Dද්ධා ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී. මහණෙනි, වීර්ය ඉන්ද්‍රියද බෝධිපාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී. මහණෙනි, සති ඉන්ද්‍රියද බෝධිපාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී. මහණෙනි, සමාධි ඉන්ද්‍රියද බෝධිපාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී. මහණෙනි, ප්‍U+200Dරඥා ඉන්ද්‍රියද බෝධිපාක්ෂික ධර්මයකි, එය බෝධිය පිණිස පවතී.\n\nමහණෙනි, යම්කිසි සාර ගන්ධ වර්ගයක් ඇද්ද, රත් සඳුන් ඒ අතර අග්‍U+200Dර යැයි කියනු ලැබේ; එපරිද්දෙන්ම මහණෙනි, යම්කිසි බෝධිපාක්ෂික ධර්මයක් ඇද්ද, ප්‍U+200Dරඥා ඉන්ද්‍රිය ඒ අතර අග්‍U+200Dර යැයි කියනු ලැබේ, එනම් බෝධිය සඳහා ය.",
      "paliTitle": "Sārasuttaṃ",
      "englishTitle": "The Discourse on the Core",
      "sinhalaTitle": "සාර සූත්‍රය"
    },
    {
      "number": 526,
      "pali": "‘‘Ekadhamme patiṭṭhitassa, bhikkhave, bhikkhuno pañcindriyāni bhāvitāni honti subhāvitāni. Katamasmiṃ ekadhamme? Appamāde. Katamo ca bhikkhave, appamādo? Idha, bhikkhave, bhikkhu cittaṃ rakkhati āsavesu ca sāsavesu ca dhammesu. Tassa cittaṃ rakkhato āsavesu ca sāsavesu ca dhammesu saddhindriyampi bhāvanāpāripūriṃ gacchati. Vīriyindriyampi bhāvanāpāripūriṃ gacchati. Satindriyampi bhāvanāpāripūriṃ gacchati. Samādhindriyampi bhāvanāpāripūriṃ gacchati. Paññindriyampi bhāvanāpāripūriṃ gacchati. Evampi kho, bhikkhave, ekadhamme patiṭṭhitassa bhikkhuno pañcindriyāni bhāvitāni honti subhāvitānī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, for a bhikkhu established in one principle, the five spiritual faculties become developed and well-developed. In which one principle? In heedfulness. And what, monks, is heedfulness? Here, monks, a bhikkhu guards his mind from the influxes and from the phenomena associated with influxes. By thus guarding his mind from the influxes and from the phenomena associated with influxes, even the faculty of faith reaches fullness of development. Even the faculty of energy reaches fullness of development. Even the faculty of mindfulness reaches fullness of development. Even the faculty of concentration reaches fullness of development. Even the faculty of wisdom reaches fullness of development. Thus indeed, monks, for a bhikkhu established in one principle, the five spiritual faculties become developed and well-developed.",
      "sinhala": "මහණෙනි, එක් ධ​ර්ම​යක් තුළ පිහිටා සිටින භික්ෂුවකට පංච ඉන්ද්‍රියයන් වඩන ලද්දේ වෙයි, මැනවින් වඩන ලද්දේ වෙයි. කවර නම් එක් ධ​ර්ම​යක් තුළද? අප්‍රමාදයෙහි යි. මහණෙනි, අප්‍රමාදය නම් කුමක්ද? මහණෙනි, මෙහිලා භික්ෂුව ආශ්‍රවයන්ගෙන්ද, ආශ්‍රවයන් සහිත ධ​ර්ම​යන්ගෙන්ද සිත රකියි. ආශ්‍රවයන්ගෙන්ද, ආශ්‍රවයන් සහිත ධ​ර්ම​යන්ගෙන්ද සිත රකින ඔහුට ශ්‍රද්ධා ඉන්ද්‍රියයද භාවනාවෙන් පිරිපුන් බවට පත්වෙයි. වීර්ය ඉන්ද්‍රියයද භාවනාවෙන් පිරිපුන් බවට පත්වෙයි. සති ඉන්ද්‍රියයද භාවනාවෙන් පිරිපුන් බවට පත්වෙයි. සමාධි ඉන්ද්‍රියයද භාවනාවෙන් පිරිපුන් බවට පත්වෙයි. ප්‍රඥා ඉන්ද්‍රියයද භාවනාවෙන් පිරිපුන් බවට පත්වෙයි. මහණෙනි, මෙලෙසින් එක් ධ​ර්ම​යක් තුළ පිහිටා සිටින භික්ෂුවකට පංච ඉන්ද්‍රියයන් වඩන ලද්දේ වෙයි, මැනවින් වඩන ලද්දේ වෙයි.",
      "paliTitle": "Patiṭṭhitasuttaṃ",
      "englishTitle": "The Discourse on the Established",
      "sinhalaTitle": "පතිට්ඨිත සූත්‍රය"
    },
    {
      "number": 527,
      "pali": "Ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhe paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘pañcindriyāni bhāvitāni bahulīkatāni amatogadhāni honti amataparāyaṇāni amatapariyosānāni. Katamāni pañca? Saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ. Vīriyindriyaṃ…pe… satindriyaṃ…pe… samādhindriyaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ. Imāni pañcindriyāni bhāvitāni bahulīkatāni amatogadhāni honti amataparāyaṇāni amatapariyosānānī’’ti. Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya; evameva brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘evametaṃ, bhagavā, evametaṃ sugata! Pañcindriyāni bhāvitāni bahulīkatāni amatogadhāni honti amataparāyaṇāni amatapariyosānāni. Katamāni pañca? Saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyaṇaṃ amatapariyosānaṃ. Imāni pañcindriyāni bhāvitāni bahulīkatāni amatogadhāni honti amataparāyaṇāni amatapariyosānāni’’. ‘‘Bhūtapubbāhaṃ, bhante, kassape sammāsambuddhe brahmacariyaṃ acariṃ. Tatrapi maṃ evaṃ jānanti – ‘sahako bhikkhu, sahako bhikkhū’ti. So khvāhaṃ, bhante, imesaṃyeva pañcannaṃ indriyānaṃ bhāvitattā bahulīkatattā kāmesu kāmacchandaṃ virājetvā kāyassa bhedā paraṃ maraṇā sugatiṃ brahmalokaṃ upapanno. Tatrapi maṃ evaṃ jānanti – ‘brahmā sahampati, brahmā sahampatī’’’ti. ‘‘Evametaṃ, bhagavā, evametaṃ sugata! Ahametaṃ jānāmi, ahametaṃ passāmi yathā imāni pañcindriyāni bhāvitāni bahulīkatāni amatogadhāni honti amataparāyaṇāni amatapariyosānānī’’ti. Sattamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling at Uruvelā, on the bank of the Nerañjarā River, under the Ajapāla Banyan tree, having just attained full enlightenment.\n\nThen, as the Blessed One was in seclusion, having retired, a thought arose in his mind thus: \"The five spiritual faculties, when developed and cultivated, are immersed in the Deathless, have the Deathless as their destination, and culminate in the Deathless. Which five? The faculty of faith, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of energy, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of mindfulness, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of concentration, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of wisdom, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. These five spiritual faculties, when developed and cultivated, are immersed in the Deathless, have the Deathless as their destination, and culminate in the Deathless.\"\n\nThen Brahmā Sahampati, having understood with his own mind the thought in the Blessed One's mind—just as a strong man might extend his flexed arm or flex his extended arm—vanished from the Brahma-world and appeared before the Blessed One.\n\nThen Brahmā Sahampati, arranging his upper robe over one shoulder, and saluting the Blessed One with joined palms, addressed the Blessed One thus: \"It is so, Blessed One! It is so, Fortunate One! The five spiritual faculties, when developed and cultivated, are immersed in the Deathless, have the Deathless as their destination, and culminate in the Deathless. Which five? The faculty of faith, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of energy, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of mindfulness, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of concentration, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. The faculty of wisdom, when developed and cultivated, is immersed in the Deathless, has the Deathless as its destination, and culminates in the Deathless. These five spiritual faculties, when developed and cultivated, are immersed in the Deathless, have the Deathless as their destination, and culminate in the Deathless.\"\n\n\"In the past, venerable sir, I lived the holy life under Kassapa, the Perfectly Self-Enlightened One. There too, they knew me thus: 'The monk Sahaka, the monk Sahaka!' It was because, venerable sir, of the development and cultivation of these very five faculties, having eradicated sensual desire for sensual pleasures, that with the breaking up of the body, after death, I reappeared in a good destination, the Brahma-world. There too, they know me thus: 'Brahmā Sahampati, Brahmā Sahampati!'\"\n\n\"It is so, Blessed One! It is so, Fortunate One! I know this, I see this, how these five spiritual faculties, when developed and cultivated, are immersed in the Deathless, have the Deathless as their destination, and culminate in the Deathless.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ, පළමුව සම්බුද්ධත්වයට පත් ව, උරුවේලාවෙහි නිරංජරා නදී තීරයෙහි අජපාල නුග රුක මුල වැඩ වාසය කළ සේක. එවිට භාග්‍යවතුන් වහන්සේ තනි ව භාවනායෝගී ව වැඩ සිටින කල්හි, උන් වහන්සේගේ සිතෙහි මෙවැනි සිතුවිල්ලක් පහළ විය: \"පංච ඉන්ද්‍රියන් වැඩීමෙන් හා බහුල වශයෙන් පුරුදු කිරීමෙන් ඒවා අමෘතයෙහි ගැලී සිටින්නාහු ද, අමෘතය පරම පිහිට කොට ඇත්තාහු ද, අමෘතයෙන් කෙළවර වන්නාහු ද වෙති. ඒ පස කුමක්ද? ශ්‍රද්ධා ඉන්ද්‍රිය වැඩීමෙන් හා බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නේ ද, අමෘතය පරම පිහිට කොට ඇත්තේ ද, අමෘතයෙන් කෙළවර වන්නේ ද වේ. වීර්යය ඉන්ද්‍රිය ද...පෙ... සති ඉන්ද්‍රිය ද...පෙ... සමාධි ඉන්ද්‍රිය ද...පෙ... ප්‍රඥා ඉන්ද්‍රිය වැඩීමෙන් හා බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නේ ද, අමෘතය පරම පිහිට කොට ඇත්තේ ද, අමෘතයෙන් කෙළවර වන්නේ ද වේ. මෙම ඉන්ද්‍රියයන් පස භාවනා කිරීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නාහු ද, අමෘතය පරම පිහිට කොට ඇත්තාහු ද, අමෘතයෙන් කෙළවර වන්නාහු ද වෙති.\"\n\nඑවිට සහම්පති බ්‍රහ්මයා භාග්‍යවතුන් වහන්සේගේ සිතෙහි පහළ වූ සිතුවිල්ල තම සිතින් ම දැන, යම් සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුව දිග හරින්නේ ද, දිග හැරී බාහුව හැකිලන්නේ ද, එපරිද්දෙන් ම බ්‍රහ්ම ලෝකයෙන් අතුරුදන් වී භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි පහළ විය. ඉක්බිති සහම්පති බ්‍රහ්මයා එක උරහිසක් වැසෙන සේ උතුරු සළුව පොරවාගෙන, භාග්‍යවතුන් වහන්සේ වැඩ සිටින දිශාවට ඇඳිලි බැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භාග්‍යවතුන් වහන්ස, ඒ එසේමය! සුගතයන් වහන්ස, ඒ එසේමය! ඉන්ද්‍රියයන් පස භාවනා කිරීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නාහු ද, අමෘතය පරම පිහිට කොට ඇත්තාහු ද, අමෘතයෙන් කෙළවර වන්නාහු ද වෙති. ඒ පස කුමක්ද? ශ්‍රද්ධා ඉන්ද්‍රිය වැඩීමෙන් හා බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නේ ද, අමෘතය පරම පිහිට කොට ඇත්තේ ද, අමෘතයෙන් කෙළවර වන්නේ ද වේ...පෙ... ප්‍රඥා ඉන්ද්‍රිය වැඩීමෙන් හා බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නේ ද, අමෘතය පරම පිහිට කොට ඇත්තේ ද, අමෘතයෙන් කෙළවර වන්නේ ද වේ. මෙම ඉන්ද්‍රියයන් පස භාවනා කිරීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නාහු ද, අමෘතය පරම පිහිට කොට ඇත්තාහු ද, අමෘතයෙන් කෙළවර වන්නාහු ද වෙති.\"\n\n\"වහන්ස, පෙර භවයක මම කස්සප සම්මා සම්බුදුරදුන්ගේ ශාසනයෙහි බ්‍රහ්මචර්යාවෙහි හැසිරුණෙමි. එහිදී ද මාව 'සහක භික්ෂුව, සහක භික්ෂුව' යනුවෙන් හැඳින සිටියහ. වහන්ස, එම මම, මේ පංච ඉන්ද්‍රියයන් වැඩූ බැවින් ද, බහුල වශයෙන් පුරුදු කළ බැවින් ද, කාමයන් කෙරෙහි වූ කාමච්ඡන්දය දුරු කොට, ශරීරය බිඳීමෙන් මරණින් මතු සුගතිමත් වූ බ්‍රහ්ම ලෝකයෙහි උපන්නෙමි. එහිදී ද මාව 'සහම්පති බ්‍රහ්මයා, සහම්පති බ්‍රහ්මයා' යනුවෙන් හැඳින සිටියහ.\"\n\n\"භාග්‍යවතුන් වහන්ස, ඒ එසේමය! සුගතයන් වහන්ස, ඒ එසේමය! මේ පංච ඉන්ද්‍රියන් වැඩීමෙන් හා බහුල වශයෙන් පුරුදු කිරීමෙන් අමෘතයෙහි ගැලී සිටින්නාහු ද, අමෘතය පරම පිහිට කොට ඇත්තාහු ද, අමෘතයෙන් කෙළවර වන්නාහු ද වන ආකාරය මම දනිමි, මම දකිමි.\"\n\nසත්වන සූත්‍රයයි.",
      "paliTitle": "Sahampatibrahmasuttaṃ",
      "englishTitle": "The Discourse by Brahma Sahampati",
      "sinhalaTitle": "සහම්පතිබ්‍රහ්ම සූත්‍රය"
    },
    {
      "number": 528,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate sūkarakhatāyaṃ. Tatra kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘kiṃ nu kho, sāriputta, atthavasaṃ sampassamāno khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti [pavattetīti (sī.)]? ‘‘Anuttarañhi, bhante, yogakkhemaṃ sampassamāno khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti. ‘‘Sādhu sādhu, sāriputta! Anuttarañhi, sāriputta, yogakkhemaṃ sampassamāno khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti. ‘‘Katamo ca, sāriputta, anuttaro yogakkhemo yaṃ sampassamāno khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti? ‘‘Idha, bhante, khīṇāsavo bhikkhu saddhindriyaṃ bhāveti upasamagāmiṃ sambodhagāmiṃ, vīriyindriyaṃ bhāveti…pe… satindriyaṃ bhāveti…pe… samādhindriyaṃ bhāveti…pe… paññindriyaṃ bhāveti upasamagāmiṃ sambodhagāmiṃ. Ayaṃ kho, bhante, anuttaro yogakkhemo yaṃ sampassamāno khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti. ‘‘Sādhu sādhu, sāriputta! Eso hi, sāriputta, anuttaro yogakkhemo yaṃ sampassamāno khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti. ‘‘Katamo ca, sāriputta, paramanipaccakāro yaṃ khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti? ‘‘Idha, bhante, khīṇāsavo bhikkhu satthari sagāravo viharati sappatisso [sappaṭisso (syā. kaṃ. ka.)], dhamme sagāravo viharati sappatisso, saṅghe sagāravo viharati sappatisso, sikkhāya sagāravo viharati sappatisso, samādhismiṃ sagāravo viharati sappatisso. Ayaṃ kho, bhante, paramanipaccakāro yaṃ khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti. ‘‘Sādhu sādhu, sāriputta! Eso hi, sāriputta, paramanipaccakāro yaṃ khīṇāsavo bhikkhu tathāgate vā tathāgatasāsane vā paramanipaccakāraṃ pavattamāno pavattatī’’ti. Aṭṭhamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Rājagaha, on Vulture Peak mountain, at the Boar's Cave. There, the Blessed One addressed the Venerable Sāriputta: \"Sāriputta, what benefit does a monk whose defilements are eradicated perceive when he practices the utmost reverence towards the Tathāgata or towards the Tathāgata's Dispensation?\"\n\n\"Venerable sir, it is by perceiving the unsurpassed security from bondage that a monk whose defilements are eradicated practices the utmost reverence towards the Tathāgata or towards the Tathāgata's Dispensation.\"\n\n\"Excellent, excellent, Sāriputta! Indeed, Sāriputta, it is by perceiving the unsurpassed security from bondage that a monk whose defilements are eradicated practices the utmost reverence towards the Tathāgata or towards the Tathāgata's Dispensation.\"\n\n\"And what, Sāriputta, is that unsurpassed security from bondage, by perceiving which a monk whose defilements are eradicated practices the utmost reverence towards the Tathāgata or towards the Tathāgata's Dispensation?\"\n\n\"Here, venerable sir, a monk whose defilements are eradicated develops the faculty of faith, leading to tranquility and leading to perfect enlightenment; develops the faculty of energy, leading to tranquility and leading to perfect enlightenment; develops the faculty of mindfulness, leading to tranquility and leading to perfect enlightenment; develops the faculty of concentration, leading to tranquility and leading to perfect enlightenment; develops the faculty of wisdom, leading to tranquility and leading to perfect enlightenment. This, venerable sir, is that unsurpassed security from bondage, by perceiving which a monk whose defilements are eradicated practices the utmost reverence towards the Tathāgata or towards the Tathāgata's Dispensation.\"\n\n\"Excellent, excellent, Sāriputta! Indeed, Sāriputta, this is that unsurpassed security from bondage, by perceiving which a monk whose defilements are eradicated practices the utmost reverence towards the Tathāgata or towards the Tathāgata's Dispensation.\"\n\n\"And what, Sāriputta, is that utmost reverence which a monk whose defilements are eradicated practices towards the Tathāgata or towards the Tathāgata's Dispensation?\"\n\n\"Here, venerable sir, a monk whose defilements are eradicated dwells respectfully and deferentially towards the Teacher; dwells respectfully and deferentially towards the Dhamma; dwells respectfully and deferentially towards the Saṅgha; dwells respectfully and deferentially towards the training; dwells respectfully and deferentially towards concentration. This, venerable sir, is that utmost reverence, which a monk whose defilements are eradicated practices towards the Tathāgata or towards the Tathāgata's Dispensation.\"\n\n\"Excellent, excellent, Sāriputta! Indeed, Sāriputta, this is that utmost reverence, which a monk whose defilements are eradicated practices towards the Tathāgata or towards the Tathāgata's Dispensation.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජුකුළු පර්වතයෙහි සූකරඛත නම් ස්ථානයෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් අමතා වදාළ සේක: \"ශාරිපුත්‍රය, කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේ කුමන අර්ථයක් (ප්‍රයෝජනයක්) මෙනෙහි කරමින්ද?\"\n\n\"ස්වාමීනි, අනුත්තර වූ යෝගක්ෂේමය (කෙලෙස් බන්ධනයන්ගෙන් මිදීමෙන් ලැබෙන උතුම් අභයභාවය) මෙනෙහි කරමින් කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේය.\"\n\n\"සාදු සාදු, ශාරිපුත්‍රය! ශාරිපුත්‍රය, අනුත්තර වූ යෝගක්ෂේමය මෙනෙහි කරමින් කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේය.\"\n\n\"ශාරිපුත්‍රය, කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේ යම් අනුත්තර යෝගක්ෂේමයක් මෙනෙහි කරමින්ද, ඒ අනුත්තර යෝගක්ෂේමය කවරේද?\"\n\n\"ස්වාමීනි, මේ ශාසනයෙහි කෙලෙස් ක්ෂය කළ භික්ෂුවක් උපශාන්තියට ද සම්බෝධියට ද පමුණුවන ශ්‍රද්ධා ඉන්ද්‍රිය වඩයි. උපශාන්තියට ද සම්බෝධියට ද පමුණුවන වීර්යය ඉන්ද්‍රිය වඩයි. උපශාන්තියට ද සම්බෝධියට ද පමුණුවන සති ඉන්ද්‍රිය වඩයි. උපශාන්තියට ද සම්බෝධියට ද පමුණුවන සමාධි ඉන්ද්‍රිය වඩයි. උපශාන්තියට ද සම්බෝධියට ද පමුණුවන ප්‍රඥා ඉන්ද්‍රිය වඩයි. ස්වාමීනි, කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේ යම් අනුත්තර යෝගක්ෂේමයක් මෙනෙහි කරමින්ද, ඒ අනුත්තර යෝගක්ෂේමය නම් මෙයයි.\"\n\n\"සාදු සාදු, ශාරිපුත්‍රය! ශාරිපුත්‍රය, කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේ යම් අනුත්තර යෝගක්ෂේමයක් මෙනෙහි කරමින්ද, ඒ අනුත්තර යෝගක්ෂේමය නම් මෙයමය.\"\n\n\"ශාරිපුත්‍රය, කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේ යම් පරම ගෞරවයකින් හා භක්තියකින් යුක්තවද, ඒ පරම ගෞරවය හා භක්තිය කවරේද?\"\n\n\"ස්වාමීනි, මේ ශාසනයෙහි කෙලෙස් ක්ෂය කළ භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් හා භක්තියෙන් යුතුව වාසය කරයි. ධර්මය කෙරෙහි ගෞරවයෙන් හා භක්තියෙන් යුතුව වාසය කරයි. සංඝයා කෙරෙහි ගෞරවයෙන් හා භක්තියෙන් යුතුව වාසය කරයි. ශික්ෂාව (සීලය) කෙරෙහි ගෞරවයෙන් හා භක්තියෙන් යුතුව වාසය කරයි. සමාධිය කෙරෙහි ගෞරවයෙන් හා භක්තියෙන් යුතුව වාසය කරයි. ස්වාමීනි, කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේ යම් පරම ගෞරවයකින් හා භක්තියකින් යුක්තවද, ඒ පරම ගෞරවය හා භක්තිය නම් මෙයයි.\"\n\n\"සාදු සාදු, ශාරිපුත්‍රය! ශාරිපුත්‍රය, කෙලෙස් ක්ෂය කළ භික්ෂුවක් තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශාසනය කෙරෙහි හෝ පරම ගෞරවයෙන් හා භක්තියෙන් යුක්තව ක්‍රියා කරන්නේ යම් පරම ගෞරවයකින් හා භක්තියකින් යුක්තවද, ඒ පරම ගෞරවය හා භක්තිය නම් මෙයමය.\"",
      "paliTitle": "Sūkarakhatasuttaṃ",
      "englishTitle": "The Discourse at the Boar’s Cave",
      "sinhalaTitle": "සූකරඛත සූත්‍රය"
    },
    {
      "number": 529,
      "pali": "Sāvatthinidānaṃ. ‘‘Pañcimāni, bhikkhave, indriyāni bhāvitāni bahulīkatāni anuppannāni uppajjanti, nāññatra tathāgatassa pātubhāvā arahato sammāsambuddhassa. Katamāni pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni bhāvitāni bahulīkatāni anuppannāni uppajjanti, nāññatra tathāgatassa pātubhāvā arahato sammāsambuddhassā’’ti. Navamaṃ.",
      "english": "Monks, these five spiritual faculties, when cultivated and repeatedly practiced, arise when they have not arisen, but not otherwise than through the manifestation of a Tathāgata, an Arahant, a Perfectly Self-Enlightened One.\n\nWhich five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom.\n\nThese five spiritual faculties, monks, when cultivated and repeatedly practiced, arise when they have not arisen, but not otherwise than through the manifestation of a Tathāgata, an Arahant, a Perfectly Self-Enlightened One.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nමහණෙනි, මේ ඉන්ද්‍රියයන් පහ, භාවනා කරන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, පෙර නූපන් දෑ වූවද, රහත් වූ, සම්මා සම්බුදුන් වූ තථාගතයන් වහන්සේ නමකගේ පහළවීමකින් මිස, අන් ආකාරයකින් ඇති නොවේ. ඒවා කවරේද? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්යය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යි. මහණෙනි, මේ ඉන්ද්‍රියයන් පහ, භාවනා කරන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, පෙර නූපන් දෑ වූවද, රහත් වූ, සම්මා සම්බුදුන් වූ තථාගතයන් වහන්සේ නමකගේ පහළවීමකින් මිස, අන් ආකාරයකින් ඇති නොවේ. නවවැනි සූත්‍රයයි.",
      "paliTitle": "Paṭhamauppādasuttaṃ",
      "englishTitle": "The First Discourse on Arising",
      "sinhalaTitle": "පළමු උප්පාද සූත්‍රය"
    },
    {
      "number": 530,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni bhāvitāni bahulīkatāni anuppannāni uppajjanti, nāññatra sugatavinayā. Katamāni pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni bhāvitāni bahulīkatāni anuppannāni uppajjanti, nāññatra sugatavinayā’’ti. Dasamaṃ. Sūkarakhatavaggo chaṭṭho. Tassuddānaṃ – Sālaṃ mallikaṃ sekho ca, padaṃ sāraṃ patiṭṭhitaṃ; Brahmasūkarakhatāyo, uppādā apare duveti.",
      "english": "These five faculties, monks, when developed and repeatedly practiced, if not yet arisen, arise, nowhere else but in the discipline of the Fortunate One. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. Indeed, monks, these five faculties, when developed and repeatedly practiced, if not yet arisen, arise, nowhere else but in the discipline of the Fortunate One.\n\nThe tenth. The Sūkarakhata chapter is the sixth.\nIts summary:\nSāla, Mallikā, and Sekha,\nPada, Sāra, Paṭiṭṭhita;\nBrahma, Sūkarakhata,\nand the two other Uppāda suttas.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියෝ පසක් වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, නූපන් දේ උපදී, සුගතයන්ගේ විනයෙහි හැර අන් තැනක නොවේ. ඒ කවර පසක්ද යත්: ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේවායි. මහණෙනි, මේ ඉන්ද්‍රිය පස වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, නූපන් දේ උපදී, සුගතයන්ගේ විනයෙහි හැර අන් තැනක නොවේ.\n\nදසවැනි සූත්‍රයයි. සූකරඛත වග්ගය හයවැන්නයි. එහි උද්දානය: සාල, මල්ලිකා, සේඛ, පද, සාර, ප්‍රතිට්ඨිත, බ්‍රහ්ම, සූකරඛත, උප්පාද යන සූත්‍ර දෙකයි.",
      "paliTitle": "Dutiyauppādasuttaṃ",
      "englishTitle": "Second Sutta on Arising",
      "sinhalaTitle": "දුතිය උප්පාද සූත්‍රය"
    },
    {
      "number": 531,
      "pali": "Sāvatthinidānaṃ. ‘‘Pañcimāni, bhikkhave, indriyāni bhāvitāni bahulīkatāni saṃyojanappahānāya [saṃyojanānaṃ pahānāya (syā. ka.)] saṃvattanti. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni bhāvitāni bahulīkatāni saṃyojanappahānāya saṃvattantī’’ti. Paṭhamaṃ.",
      "english": "Monks, these five spiritual faculties, when developed and frequently cultivated, conduce to the abandoning of the fetters. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. These five spiritual faculties, indeed, Monks, when developed and frequently cultivated, conduce to the abandoning of the fetters.",
      "sinhala": "සැවැත් නුවරදී මේ සූත්‍රය දේශනා කරන ලදී.\n\nමහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ ඉන්ද්‍රියෝ පහ සංයෝජන ප්‍රහාණය පිණිස හේතු වෙති. ඒ පහ කවරේද? එනම්: ශ්‍රද්ධින්ද්‍රිය, වීරියින්ද්‍රිය, සතින්ද්‍රිය, සමාධින්ද්‍රිය, ප්‍රඥින්ද්‍රිය යන මේවායි. මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ පසින්ද්‍රියෝ සංයෝජන ප්‍රහාණය පිණිස හේතු වෙති.\n\nපළමු සූත්‍රයයි.",
      "paliTitle": "Saṃyojanasuttaṃ",
      "vagga": "Bodhipakkhiyavaggo",
      "englishTitle": "The Discourse on Fetters",
      "sinhalaTitle": "සංයෝජන සූත්‍රය",
      "vaggaEnglish": "The Chapter on the Qualities Leading to Enlightenment",
      "vaggaSinhala": "බෝධිපක්ඛිය වර්ගය"
    },
    {
      "number": 532,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni bhāvitāni bahulīkatāni anusayasamugghātāya saṃvattanti. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni bhāvitāni bahulīkatāni anusayasamugghātāya saṃvattantī’’ti. Dutiyaṃ.",
      "english": "Monks, these five spiritual faculties, when developed and repeatedly cultivated, conduce to the eradication of underlying tendencies. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom – these five spiritual faculties, monks, when developed and repeatedly cultivated, conduce to the eradication of underlying tendencies.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පස වඩන ලද කල, බහුල වශයෙන් පුරුදු කරන ලද කල, අනුශයයන් මුලිනුපුටා දැමීම පිණිස පවතී. කවරේ ද ඒ පස? සද්ධා ඉන්ද්‍රිය, වීර්යය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය – මහණෙනි, මේ ඉන්ද්‍රියයන් පස වඩන ලද කල, බහුල වශයෙන් පුරුදු කරන ලද කල, අනුශයයන් මුලිනුපුටා දැමීම පිණිස පවතී.",
      "paliTitle": "Anusayasuttaṃ",
      "englishTitle": "The Discourse on Underlying Tendencies",
      "sinhalaTitle": "අනුසය සූත්‍රය"
    },
    {
      "number": 533,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni bhāvitāni bahulīkatāni addhānapariññāya saṃvattanti. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni bhāvitāni bahulīkatāni addhānapariññāya saṃvattantī’’ti. Tatiyaṃ.",
      "english": "Monks, these five faculties, when developed and frequently practiced, conduce to the complete understanding of the long journey of existence. Which five? The faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom – these five faculties, monks, when developed and frequently practiced, conduce to the complete understanding of the long journey of existence.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රිය පස වඩන ලද්දා වූ කල, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල, සංසාර දුක්ඛයේ දීර්ඝ ගමන සම්පූර්ණයෙන් අවබෝධ කර ගැනීම පිණිස පවතී. කවර පහක් ද? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය – මහණෙනි, මේ ඉන්ද්‍රිය පස වඩන ලද්දා වූ කල, බහුල වශයෙන් පුරුදු කරන ලද්දා වූ කල, සංසාර දුක්ඛයේ දීර්ඝ ගමන සම්පූර්ණයෙන් අවබෝධ කර ගැනීම පිණිස පවතී.",
      "paliTitle": "Pariññāsuttaṃ",
      "englishTitle": "The Discourse on Full Understanding",
      "sinhalaTitle": "පරිඤ්ඤා සූත්‍රය"
    },
    {
      "number": 534,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni bhāvitāni bahulīkatāni āsavānaṃ khayāya saṃvattanti. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni bhāvitāni bahulīkatāni āsavānaṃ khayāya saṃvattantī’’ti. ‘‘Pañcimāni, bhikkhave, indriyāni bhāvitāni bahulīkatāni saṃyojanappahānāya saṃvattanti, anusayasamugghātāya saṃvattanti, addhānapariññāya saṃvattanti, āsavānaṃ khayāya saṃvattanti. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni bhāvitāni bahulīkatāni saṃyojanappahānāya saṃvattanti, anusayasamugghātāya saṃvattanti, addhānapariññāya saṃvattanti, āsavānaṃ khayāya saṃvattantī’’ti. Catutthaṃ.",
      "english": "Monks, these five faculties, when developed and repeatedly cultivated, lead to the destruction of the mental effluents. Which five? The faculty of faith... the faculty of wisdom – these five faculties, monks, when developed and repeatedly cultivated, lead to the destruction of the mental effluents.\n\nMonks, these five faculties, when developed and repeatedly cultivated, lead to the abandoning of the fetters, to the uprooting of the latent tendencies, to the full understanding of the journey of existence, and to the destruction of the mental effluents. Which five? The faculty of faith... the faculty of wisdom – these five faculties, monks, when developed and repeatedly cultivated, lead to the abandoning of the fetters, to the uprooting of the latent tendencies, to the full understanding of the journey of existence, and to the destruction of the mental effluents.",
      "sinhala": "මහණෙනි, වඩනලද, බහුල වශයෙන් පුරුදු කරනලද මේ ඉන්ද්‍රියෝ පස ආශ්‍රවයන් ක්ෂය කිරීම පිණිස පවතින්නාහ. කවර පසක්ද? සද්ධා ඉන්ද්‍රිය... ප්‍රඥා ඉන්ද්‍රිය යන මේ ඉන්ද්‍රියෝ පසම මහණෙනි, වඩනලද, බහුල වශයෙන් පුරුදු කරනලද කල්හි ආශ්‍රවයන් ක්ෂය කිරීම පිණිස පවතින්නාහ.\n\nමහණෙනි, වඩනලද, බහුල වශයෙන් පුරුදු කරනලද මේ ඉන්ද්‍රියෝ පස සංයෝජන ප්‍රහාණය පිණිසද, අනුසය සමුද්ග්‍රාතය පිණිසද, භව ගමනේ අවසානය අවබෝධ කිරීම පිණිසද, ආශ්‍රවයන් ක්ෂය කිරීම පිණිසද පවතින්නාහ. කවර පසක්ද? සද්ධා ඉන්ද්‍රිය... ප්‍රඥා ඉන්ද්‍රිය යන මේ ඉන්ද්‍රියෝ පසම මහණෙනි, වඩනලද, බහුල වශයෙන් පුරුදු කරනලද කල්හි සංයෝජන ප්‍රහාණය පිණිසද, අනුසය සමුද්ග්‍රාතය පිණිසද, භව ගමනේ අවසානය අවබෝධ කිරීම පිණිසද, ආශ්‍රවයන් ක්ෂය කිරීම පිණිසද පවතින්නාහ.",
      "paliTitle": "Āsavakkhayasuttaṃ",
      "englishTitle": "The Discourse on the Destruction of Taints",
      "sinhalaTitle": "ආසවක්ඛය සූත්‍රය"
    },
    {
      "number": 535,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ bhāvitattā bahulīkatattā dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, there are these five faculties. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, the faculty of wisdom – these, bhikkhus, are the five faculties. When these five faculties, bhikkhus, are developed and extensively cultivated, one of two fruits can be expected: complete knowledge (Arahantship) in this very life, or if there is some residual clinging, the state of non-returning.",
      "sinhala": "මහණෙනි, මේ ඉන්ද්‍රියයන් පසකි. කවරේද ඒ පස? ශ්‍රද්ධා ඉන්ද්‍රිය…පෙ…ප්‍රඥා ඉන්ද්‍රිය යන මේවායි මහණෙනි, ඒ පස් ඉන්ද්‍රියන්.\n\nමහණෙනි, මේ පස් ඉන්ද්‍රියන් වර්ධනය කරනු ලැබූ බැවින් ද, බහුල වශයෙන් පුරුදු කරනු ලැබූ බැවින් ද, ප්‍රතිඵල දෙකකින් එකක් බලාපොරොත්තු විය යුතු ය. එනම්, මේ ආත්මභාවයේ දී ම නිරවශේෂ ඥානය ලැබීම හෝ, උපාධිශේෂය පවතිද්දී අනාගාමීඵලය ලැබීම යි.",
      "paliTitle": "Paṭhamaphalasuttaṃ",
      "englishTitle": "The First Discourse on Fruit",
      "sinhalaTitle": "පළමු ඵල සූත්‍රය"
    },
    {
      "number": 536,
      "pali": "‘‘Pañcimāni, bhikkhave, indriyāni. Katamāni pañca? Saddhindriyaṃ…pe… paññindriyaṃ – imāni kho, bhikkhave, pañcindriyāni. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ bhāvitattā bahulīkatattā satta phalā sattānisaṃsā pāṭikaṅkhā. Katame satta phalā sattānisaṃsā? Diṭṭheva dhamme paṭikacca aññaṃ ārādheti, no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti, atha maraṇakāle aññaṃ ārādheti. No ce diṭṭheva dhamme aññaṃ ārādheti, no ce maraṇakāle aññaṃ ārādheti, atha pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti, upahaccaparinibbāyī hoti, asaṅkhāraparinibbāyī hoti, sasaṅkhāraparinibbāyī hoti, uddhaṃsoto hoti akaniṭṭhagāmī. Imesaṃ kho, bhikkhave, pañcannaṃ indriyānaṃ bhāvitattā bahulīkatattā ime satta phalā sattānisaṃsā pāṭikaṅkhā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these five faculties. Which five? The faculty of faith... the faculty of wisdom – these, monks, are the five faculties.\n\nMonks, when these five faculties are developed and cultivated extensively, seven fruits and seven benefits can be expected. Which seven fruits and seven benefits?\n\nRight here and now, in this very life, one fully realizes the ultimate knowledge. If one does not realize the ultimate knowledge right here and now in this very life, then at the time of death, one realizes the ultimate knowledge. If one does not realize the ultimate knowledge right here and now in this very life, and does not realize it at the time of death, then, with the complete destruction of the five lower fetters, one becomes an intermediate Nibbāna-attainer, or one becomes an Nibbāna-attainer by reducing the lifespan, or one becomes an effortless Nibbāna-attainer, or one becomes an effortful Nibbāna-attainer, or one becomes an upward-flowing one, bound for the Akaniṭṭha realm.\n\nMonks, it is because these five faculties are developed and cultivated extensively that these seven fruits and seven benefits can be expected.",
      "sinhala": "භික්‍ෂූනි, මේ ඉන්ද්‍රියයන් පහකි. ඒ කවර පහක් ද? ශ\\u200D්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප\\u200D්‍රඥා ඉන්ද්‍රිය – භික්‍ෂූනි, මේ ඉන්ද්‍රියයන් පහයි. භික්‍ෂූනි, මේ ඉන්ද්‍රියයන් පහ වඩනු ලැබීමෙන් ද, බහුල වශයෙන් පුරුදු කරනු ලැබීමෙන් ද ප්‍රතිඵල සතක් හා ආනිසංස සතක් බලාපොරොත්තු විය යුතු ය. ඒ ප්‍රතිඵල හා ආනිසංස සත කවරේ ද? මේ ආත්මභාවයේදීම, ක්ෂණිකව අර්හත්වය සාක්ෂාත් කරයි. එසේ නොවේ නම්, මරණාසන්න මොහොතේදී අර්හත්වය සාක්ෂාත් කරයි. එසේ ද නොවේ නම්, මේ ආත්මභාවයේදී අර්හත්වය සාක්ෂාත් නොකරන්නේ නම් ද, මරණාසන්න මොහොතේදී අර්හත්වය සාක්ෂාත් නොකරන්නේ නම් ද, පංච ඕරම්භාගීය සංයෝජන ධර්\\u200Dමයන් ක්ෂය කිරීමෙන් අන්තරාපරිනිර්වායි වේ, උපහච්චපරිනිර්වායි වේ, අසංඛාරපරිනිර්වායි වේ, සසංඛාරපරිනිර්වායි වේ, ඌර්\\u200Dධ්වස්\\u200Dරෝතස් ඇතිව අකනිට්ඨගාමී වේ. භික්‍ෂූනි, මේ ඉන්ද්‍රියයන් පහ වඩනු ලැබීමෙන් ද, බහුල වශයෙන් පුරුදු කරනු ලැබීමෙන් ද මේ ප්‍රතිඵල සත හා ආනිසංස සත බලාපොරොත්තු විය යුතු ය.",
      "paliTitle": "Dutiyaphalasuttaṃ",
      "englishTitle": "The Second Discourse on Fruit",
      "sinhalaTitle": "දෙවන ඵල සූත්‍රය"
    },
    {
      "number": 537,
      "pali": "‘‘Seyyathāpi bhikkhave, ye keci jambudīpakā rukkhā, jambū tesaṃ aggamakkhāyati; evameva kho bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāya. Katame ca, bhikkhave, bodhipakkhiyā dhammā? Saddhindriyaṃ, bhikkhave, bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Vīriyindriyaṃ…pe… satindriyaṃ…pe… samādhindriyaṃ…pe… paññindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Seyyathāpi, bhikkhave, ye keci jambudīpakā rukkhā, jambū tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāyā’’ti. Sattamaṃ.",
      "english": "Just as, monks, among all the trees on Jambudīpa, the rose-apple tree is declared to be the foremost; even so, monks, among all the qualities conducive to awakening, the faculty of wisdom is declared to be the foremost, for the sake of awakening.\n\nAnd what, monks, are the qualities conducive to awakening? The faculty of conviction, monks, is a quality conducive to awakening; it conduces to awakening. The faculty of energy is a quality conducive to awakening; it conduces to awakening. The faculty of mindfulness is a quality conducive to awakening; it conduces to awakening. The faculty of concentration is a quality conducive to awakening; it conduces to awakening. The faculty of wisdom is a quality conducive to awakening; it conduces to awakening.\n\nJust as, monks, among all the trees on Jambudīpa, the rose-apple tree is declared to be the foremost; even so, monks, among all the qualities conducive to awakening, the faculty of wisdom is declared to be the foremost, for the sake of awakening.",
      "sinhala": "මහණෙනි, යම් සේ ජම්බුද්වීපයෙහි යම්කිසි වෘක්‍ෂයෝ ඇත්තාහු ද, ජම්බු වෘක්‍ෂය ඒ සියලු වෘක්‍ෂයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; මහණෙනි, එපරිද්දෙන්ම යම්කිසි බෝධිපාක්‍ෂික ධර්‍මයෝ ඇත්තාහු ද, ඒ බෝධිපාක්‍ෂික ධර්‍මයන් අතුරින් ප්‍රඥා ඉන්ද්‍රිය අග්‍ර යැයි කියනු ලැබේ, එය බෝධිය පිණිස පවතින්නකි.\n\nමහණෙනි, බෝධිපාක්‍ෂික ධර්‍මයෝ කවරහු ද? මහණෙනි, ශ්‍රද්ධා ඉන්ද්‍රිය බෝධිපාක්‍ෂික ධර්‍මයකි, එය බෝධිය පිණිස පවතී. වීර්ය ඉන්ද්‍රිය බෝධිපාක්‍ෂික ධර්‍මයකි, එය බෝධිය පිණිස පවතී. සති ඉන්ද්‍රිය බෝධිපාක්‍ෂික ධර්‍මයකි, එය බෝධිය පිණිස පවතී. සමාධි ඉන්ද්‍රිය බෝධිපාක්‍ෂික ධර්‍මයකි, එය බෝධිය පිණිස පවතී. ප්‍රඥා ඉන්ද්‍රිය බෝධිපාක්‍ෂික ධර්‍මයකි, එය බෝධිය පිණිස පවතී.\n\nමහණෙනි, යම් සේ ජම්බුද්වීපයෙහි යම්කිසි වෘක්‍ෂයෝ ඇත්තාහු ද, ජම්බු වෘක්‍ෂය ඒ සියලු වෘක්‍ෂයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; මහණෙනි, එපරිද්දෙන්ම යම්කිසි බෝධිපාක්‍ෂික ධර්‍මයෝ ඇත්තාහු ද, ඒ බෝධිපාක්‍ෂික ධර්‍මයන් අතුරින් ප්‍රඥා ඉන්ද්‍රිය අග්‍ර යැයි කියනු ලැබේ, එය බෝධිය පිණිස පවතින්නකි.",
      "paliTitle": "Paṭhamarukkhasuttaṃ",
      "englishTitle": "The First Discourse on Trees",
      "sinhalaTitle": "පළමු රුක්ඛ සූත්‍රය"
    },
    {
      "number": 538,
      "pali": "‘‘Seyyathāpi, bhikkhave, ye keci devānaṃ tāvatiṃsānaṃ rukkhā, pārichattako tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāya. Katame ca, bhikkhave, bodhipakkhiyā dhammā? Saddhindriyaṃ, bhikkhave, bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Vīriyindriyaṃ…pe… satindriyaṃ…pe… samādhindriyaṃ…pe… paññindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Seyyathāpi, bhikkhave, ye keci devānaṃ tāvatiṃsānaṃ rukkhā, pārichattako tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāyā’’ti. Aṭṭhamaṃ.",
      "english": "Just as, bhikkhus, among all the trees of the Tāvatiṃsa devas, the Pāricchattaka tree is declared as the foremost; even so, bhikkhus, among all the qualities conducive to awakening, the faculty of wisdom is declared as the foremost, namely, for the sake of awakening.\n\nAnd what, bhikkhus, are the qualities conducive to awakening? The faculty of conviction, bhikkhus, is a quality conducive to awakening; it leads to awakening. The faculty of energy is a quality conducive to awakening; it leads to awakening. The faculty of mindfulness is a quality conducive to awakening; it leads to awakening. The faculty of concentration is a quality conducive to awakening; it leads to awakening. The faculty of wisdom is a quality conducive to awakening; it leads to awakening.\n\nJust as, bhikkhus, among all the trees of the Tāvatiṃsa devas, the Pāricchattaka tree is declared as the foremost; even so, bhikkhus, among all the qualities conducive to awakening, the faculty of wisdom is declared as the foremost, namely, for the sake of awakening.",
      "sinhala": "මහණෙනි, යම් සේ තව්තිසා දෙවියන්ගේ වෘක්ෂයන් අතුරෙන් පාරිච්ඡත්තක වෘක්ෂය අග්‍ර යැයි කියනු ලැබේ ද, එපරිද්දෙන්ම මහණෙනි, යම් කිසි බෝධිපාක්ෂික ධර්ම කෙනෙක් ඇත්තාහු ද, ප්‍රඥා ඉන්ද්‍රිය ඒ සියල්ලටම අග්‍ර යැයි කියනු ලැබේ. ඒ නම්, බෝධිය පිණිසයි.\n\nමහණෙනි, බෝධිපාක්ෂික ධර්ම කවරේද? මහණෙනි, ශ්‍රද්ධා ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්මයකි, එය බෝධිය පිණිස හේතු වේ. වීර්යය ඉන්ද්‍රිය ද, සති ඉන්ද්‍රිය ද, සමාධි ඉන්ද්‍රිය ද, ප්‍රඥා ඉන්ද්‍රිය ද බෝධිපාක්ෂික ධර්මයකි, එය බෝධිය පිණිස හේතු වේ.\n\nමහණෙනි, යම් සේ තව්තිසා දෙවියන්ගේ වෘක්ෂයන් අතුරෙන් පාරිච්ඡත්තක වෘක්ෂය අග්‍ර යැයි කියනු ලැබේ ද, එපරිද්දෙන්ම මහණෙනි, යම් කිසි බෝධිපාක්ෂික ධර්ම කෙනෙක් ඇත්තාහු ද, ප්‍රඥා ඉන්ද්‍රිය ඒ සියල්ලටම අග්‍ර යැයි කියනු ලැබේ. ඒ නම්, බෝධිය පිණිසයි.",
      "paliTitle": "Dutiyarukkhasuttaṃ",
      "englishTitle": "Second Sutta on Trees",
      "sinhalaTitle": "දුතිය රුක්ඛ සූත්‍රය"
    },
    {
      "number": 539,
      "pali": "‘‘Seyyathāpi, bhikkhave, ye keci asurānaṃ rukkhā, cittapāṭali tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāya. Katame ca, bhikkhave, bodhipakkhiyā dhammā? Saddhindriyaṃ, bhikkhave, bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati…pe… paññindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Seyyathāpi bhikkhave, ye keci asurānaṃ rukkhā, cittapāṭali tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāyā’’ti. Navamaṃ.",
      "english": "Just as, monks, among all the trees of the asuras, the cittapāṭalī tree is declared the foremost; even so, monks, among all the qualities conducive to awakening, the faculty of wisdom is declared the foremost, namely, for the sake of awakening.\n\nAnd what, monks, are the qualities conducive to awakening? The faculty of faith, monks, is a quality conducive to awakening; it leads to awakening. The faculty of energy, monks, is a quality conducive to awakening; it leads to awakening. The faculty of mindfulness, monks, is a quality conducive to awakening; it leads to awakening. The faculty of concentration, monks, is a quality conducive to awakening; it leads to awakening. The faculty of wisdom, monks, is a quality conducive to awakening; it leads to awakening.\n\nJust as, monks, among all the trees of the asuras, the cittapāṭalī tree is declared the foremost; even so, monks, among all the qualities conducive to awakening, the faculty of wisdom is declared the foremost, namely, for the sake of awakening.",
      "sinhala": "මහණෙනි, යම්සේ අසුරයන්ගේ යම් ගස් ඇත්ද, චිත්තපාටලී වෘක්ෂය ඒ අතුරින් උතුම් යැයි කියනු ලැබේ ද, එසෙයින්ම මහණෙනි, යම් බෝධිපාක්ෂික ධර්‍මයන් ඇත්ද, ඒ අතුරින් ප්‍රඥා ඉන්ද්‍රිය උතුම් යැයි කියනු ලැබේ, ඒ නම්, අවබෝධය පිණිස ය.\n\nමහණෙනි, බෝධිපාක්ෂික ධර්‍මයෝ කවරහුද?\n\nමහණෙනි, ශ්‍රද්ධා ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්‍මයකි, එය අවබෝධය පිණිස පවතී... ප්‍රඥා ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්‍මයකි, එය අවබෝධය පිණිස පවතී.\n\nමහණෙනි, යම්සේ අසුරයන්ගේ යම් ගස් ඇත්ද, චිත්තපාටලී වෘක්ෂය ඒ අතුරින් උතුම් යැයි කියනු ලැබේ ද, එසෙයින්ම මහණෙනි, යම් බෝධිපාක්ෂික ධර්‍මයන් ඇත්ද, ඒ අතුරින් ප්‍රඥා ඉන්ද්‍රිය උතුම් යැයි කියනු ලැබේ, ඒ නම්, අවබෝධය පිණිස ය.",
      "paliTitle": "Tatiyarukkhasuttaṃ",
      "englishTitle": "Third Discourse on the Tree",
      "sinhalaTitle": "තතිය රුක්ඛ සූත්‍රය"
    },
    {
      "number": 540,
      "pali": "‘‘Seyyathāpi, bhikkhave, ye keci supaṇṇānaṃ rukkhā, kūṭasimbalī [koṭasimbali (syā. kaṃ.)] tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāya. Katame ca, bhikkhave, bodhipakkhiyā dhammā? Saddhindriyaṃ, bhikkhave, bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati…pe… paññindriyaṃ bodhipakkhiyo dhammo, taṃ bodhāya saṃvattati. Seyyathāpi, bhikkhave, ye keci supaṇṇānaṃ rukkhā, kūṭasimbalī tesaṃ aggamakkhāyati; evameva kho, bhikkhave, ye keci bodhipakkhiyā dhammā, paññindriyaṃ tesaṃ aggamakkhāyati, yadidaṃ – bodhāyā’’ti. Dasamaṃ. Bodhipakkhiyavaggo sattamo. Tassuddānaṃ – Saṃyojanā anusayā, pariññā āsavakkhayā; Dve phalā caturo rukkhā, vaggo tena pavuccatīti.",
      "english": "Just as, monks, among all towering trees where birds perch, the Kūṭasimbalī tree is declared the foremost; in the same way, monks, among all qualities conducive to awakening, the faculty of wisdom is declared the foremost, that is to say, for the sake of awakening.\n\nAnd what, monks, are the qualities conducive to awakening? The faculty of conviction, monks, is a quality conducive to awakening; it leads to awakening. The faculty of energy, monks, is a quality conducive to awakening; it leads to awakening. The faculty of mindfulness, monks, is a quality conducive to awakening; it leads to awakening. The faculty of concentration, monks, is a quality conducive to awakening; it leads to awakening. The faculty of wisdom, monks, is a quality conducive to awakening; it leads to awakening.\n\nJust as, monks, among all towering trees where birds perch, the Kūṭasimbalī tree is declared the foremost; in the same way, monks, among all qualities conducive to awakening, the faculty of wisdom is declared the foremost, that is to say, for the sake of awakening.",
      "sinhala": "භික්ෂූනි, යම් සේ මහත් පක්ෂීන් වෙසෙන වෘක්ෂයන් අතුරෙන් කූට සිම්බලී වෘක්ෂය ඒ සියල්ලටම අග‍්‍රයයි කියනු ලැබේ ද; භික්ෂූනි, එසේම, යම් කිසි බෝධිපාක්ෂික ධර්මයන් අතුරෙන් ප‍්‍රඥා ඉන්ද්‍රිය ඒ සියල්ලටම අග‍්‍රයයි කියනු ලැබේ, එනම් අවබෝධය පිණිසයි. භික්ෂූනි, බෝධිපාක්ෂික ධර්ම කවරේද? භික්ෂූනි, ශ‍්‍රද්ධා ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්මයකි, එය අවබෝධය පිණිස පවතී. භික්ෂූනි, වීර්යය ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්මයකි, එය අවබෝධය පිණිස පවතී. භික්ෂූනි, සති ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්මයකි, එය අවබෝධය පිණිස පවතී. භික්ෂූනි, සමාධි ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්මයකි, එය අවබෝධය පිණිස පවතී. ප‍්‍රඥා ඉන්ද්‍රිය බෝධිපාක්ෂික ධර්මයකි, එය අවබෝධය පිණිස පවතී. භික්ෂූනි, යම් සේ මහත් පක්ෂීන් වෙසෙන වෘක්ෂයන් අතුරෙන් කූට සිම්බලී වෘක්ෂය ඒ සියල්ලටම අග‍්‍රයයි කියනු ලැබේ ද; භික්ෂූනි, එසේම, යම් කිසි බෝධිපාක්ෂික ධර්මයන් අතුරෙන් ප‍්‍රඥා ඉන්ද්‍රිය ඒ සියල්ලටම අග‍්‍රයයි කියනු ලැබේ, එනම් අවබෝධය පිණිසයි.",
      "paliTitle": "Catuttharukkhasuttaṃ",
      "englishTitle": "Fourth Sutta on Trees",
      "sinhalaTitle": "චතුත්ථ රුක්ඛ සූත්‍රය"
    },
    {
      "number": 541,
      "numberRange": "541-552",
      "pali": "‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu pañcindriyāni bhāvento pañcindriyāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu pañcindriyāni bhāvento pañcindriyāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu saddhindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, vīriyindriyaṃ…pe… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu pañcindriyāni bhāvento pañcindriyāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. Gaṅgāpeyyālavaggo aṭṭhamo. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamādavaggo vitthāretabbo. Tassuddānaṃ – Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sārena vassikaṃ; Rājā candimasūriyā, vatthena dasamaṃ padanti. Balakaraṇīyavaggo vitthāretabbo. Tassuddānaṃ – Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā; Ākāsena ca dve meghā, nāvā āgantukā nadīti. Esanāvaggo vitthāretabbo. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "Just as, monks, the river Ganges inclines, slopes, and gravitates towards the east; in the same way, monks, a monk, developing the five spiritual faculties, cultivating the five spiritual faculties, inclines, slopes, and gravitates towards Nibbāna. And how, monks, does a monk, developing the five spiritual faculties, cultivating the five spiritual faculties, incline, slope, and gravitate towards Nibbāna? Here, monks, a monk develops the faculty of faith, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the faculty of energy... the faculty of mindfulness... the faculty of concentration... the faculty of wisdom, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. It is in this way, monks, that a monk, developing the five spiritual faculties, cultivating the five spiritual faculties, inclines, slopes, and gravitates towards Nibbāna.\n\nThe twelfth.\nThe eighth chapter, the Section on the Ganges Repetitions.\nIts summary: Six inclined towards the east, and six inclined towards the ocean; These two sets of six become twelve, by which this chapter is called.\nThe Chapter on Diligence is to be expanded.\nIts summary: The Tathagata, the footing, the peak, the root, the essence, the rainy season; The king, the moon and the sun, with cloth, these are the ten topics.\nThe Chapter on Things to be Done with Strength is to be expanded.\nIts summary: Strength, seed, and elephant, tree with a pot, and ear of grain; The sky, and two clouds, a ship, a visitor, a river.\nThe Chapter on Searches is to be expanded.\nIts summary: Searches, ways of measuring, cankers, existence, and the three kinds of suffering; Fallow land, defilement, and distress, feeling, craving, and thirst.",
      "sinhala": "මහණෙනි, යම් සේ ගංගා නදිය නැගෙනහිරට බෑවුම් වී, නැගෙනහිරට ගලා බසින්නේ, නැගෙනහිරටම යොමු වී පවතීද; එලෙසින්ම මහණෙනි, භික්ෂුව පංච ඉන්ද්‍රියන් වඩමින්, පංච ඉන්ද්‍රියන් බහුල වශයෙන් පුරුදු කරමින් නිවනටම බෑවුම් වී, නිවනටම ගලා බසින්නේ, නිවනටම යොමු වී පවතී.\n\nමහණෙනි, කෙසේ නම් භික්ෂුව පංච ඉන්ද්‍රියන් වඩමින්, පංච ඉන්ද්‍රියන් බහුල වශයෙන් පුරුදු කරමින් නිවනටම බෑවුම් වී, නිවනටම ගලා බසින්නේ, නිවනටම යොමු වී පවතීද?\n\nමහණෙනි, මෙහිලා භික්ෂුව ශ්‍ර\\u200Dද්ධා ඉන්ද්‍රිය වඩයි. (එය) විවේකය (හුදෙකලාව) පිහිට කොට ඇත්තේය, විරාගය පිහිට කොට ඇත්තේය, නිරෝධය පිහිට කොට ඇත්තේය, වොස්සග්ගය (කෙලෙස් දුරුකිරීම) කෙළවර කොට ඇත්තේය. වීර්ය ඉන්ද්‍රිය… සති ඉන්ද්‍රිය… සමාධි ඉන්ද්‍රිය… ප්‍ර\\u200Dඥා ඉන්ද්‍රිය වඩයි. (ඒ සියල්ලම) විවේකය (හුදෙකලාව) පිහිට කොට ඇත්තේය, විරාගය පිහිට කොට ඇත්තේය, නිරෝධය පිහිට කොට ඇත්තේය, වොස්සග්ගය (කෙලෙස් දුරුකිරීම) කෙළවර කොට ඇත්තේය.\n\nමහණෙනි, මෙලෙසින්ම භික්ෂුව පංච ඉන්ද්‍රියන් වඩමින්, පංච ඉන්ද්‍රියන් බහුල වශයෙන් පුරුදු කරමින් නිවනටම බෑවුම් වී, නිවනටම ගලා බසින්නේ, නිවනටම යොමු වී පවතී.\n\nදොළොස්වෙනි සූ\\u200Dත්‍රයයි.\n\nගංගාපෙය්‍යාල වග්ගය අටවෙනිය.\n\nඑහි උද්දානය මෙසේය – නැගෙනහිරට බෑවුම් වූ සූ\\u200Dත්‍ර හයකි, සාගරයට බෑවුම් වූ සූ\\u200Dත්‍ර හයකි; මේ සූ\\u200Dත්‍ර දොළහ දොළොස්වක් වෙති, ඒ නිසා මෙය වග්ගය ලෙස කියනු ලැබේ.\n\nඅප්පමාද වග්ගය විස්තර කළ යුතුය.\n\nඑහි උද්දානය මෙසේය – තථාගත, පද, කූට, මූල, සාරේන, වස්සිකං; රාජා, චන්දිමසූරියා, වත්ථ යන දසවෙනි පද වෙති.\n\nබලකරණීය වග්ගය විස්තර කළ යුතුය.\n\nඑහි උද්දානය මෙසේය – බලං, බීජඤ්ච, නාගෝ ච, රුක්ඛෝ, කුම්භේන, සූකියා; ආකාසේන ච, ද්වේ මේඝා, නාවා, ආගන්තුකා, නදී යන පද වෙති.\n\nඒසනා වග්ගය විස්තර කළ යුතුය.\n\nඑහි උද්දානය මෙසේය – ඒසනා, විධා, ආසවෝ, භවෝ ච, දුක්ඛතා තිස්සෝ; ඛිලං, මලඤ්ච, නීඝෝ ච, වේදනා, තණ්හා, තසිනා යන පද වෙති.",
      "paliTitle": "Pācīnādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo",
      "englishTitle": "The Twelve Discourses beginning with Flowing East",
      "sinhalaTitle": "පාචීනාදි සූත්‍ර ද්වාදසකය",
      "vaggaEnglish": "Chapter on the Ganges Repetition Series",
      "vaggaSinhala": "ගංගා පෙය්‍යාල වර්ගය"
    },
    {
      "number": 587,
      "numberRange": "587-596",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya pañcindriyāni bhāvetabbāni. Katamāni pañca? Idha, bhikkhave, bhikkhu saddhindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ…pe… paññindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya imāni pañcindriyāni bhāvetabbānī’’ti. Dasamaṃ. (Yathā maggasaṃyuttaṃ, tathā vitthāretabbaṃ.) Oghavaggo dvādasamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti.",
      "english": "“Monks, there are these five higher fetters. Which five? Craving for form, craving for the formless, conceit, restlessness, and ignorance – these, monks, are the five higher fetters.\n\nFor the direct knowledge, the full understanding, the complete destruction, and the abandonment of these five higher fetters, these five spiritual faculties should be developed. Which five?\n\nHere, monks, a monk develops the faculty of faith, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the faculty of energy, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the faculty of mindfulness, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the faculty of concentration, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment. He develops the faculty of wisdom, based on seclusion, based on dispassion, based on cessation, culminating in relinquishment.\n\nFor the direct knowledge, the full understanding, the complete destruction, and the abandonment of these five higher fetters, these five spiritual faculties should be developed.”",
      "sinhala": "භික්ෂූණි, මේ උද්ධම්භාගීය සංයෝජන පහක් ඇත. ඒ පහ කවරේද? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාව යන මේවා භික්ෂූණි, උද්ධම්භාගීය සංයෝජන පහයි. භික්ෂූණි, මේ උද්ධම්භාගීය සංයෝජන පහ ප්‍රත්‍යක්ෂ වශයෙන් දැනගැනීම සඳහාද, පිරිසිඳ දැනගැනීම සඳහාද, ක්ෂය කිරීම සඳහාද, ප්‍රහාණය කිරීම සඳහාද, පංචෙන්ද්‍රියන් වැඩිය යුතුය. ඒ පහ කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, කැපකිරීමෙන් නිමාවන ශ්‍ර‍ද්ධා ඉන්ද්‍රිය වඩයි. විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, කැපකිරීමෙන් නිමාවන වීර්‍ය්‍ය ඉන්ද්‍රිය වඩයි. විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, කැපකිරීමෙන් නිමාවන සති ඉන්ද්‍රිය වඩයි. විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, කැපකිරීමෙන් නිමාවන සමාධි ඉන්ද්‍රිය වඩයි. විවේකය පදනම් කරගත්, විරාගය පදනම් කරගත්, නිරෝධය පදනම් කරගත්, කැපකිරීමෙන් නිමාවන ප්‍ර‍ඥා ඉන්ද්‍රිය වඩයි. භික්ෂූණි, මේ උද්ධම්භාගීය සංයෝජන පහ ප්‍රත්‍යක්ෂ වශයෙන් දැනගැනීම සඳහාද, පිරිසිඳ දැනගැනීම සඳහාද, ක්ෂය කිරීම සඳහාද, ප්‍රහාණය කිරීම සඳහාද, මේ පංචෙන්ද්‍රියන් වැඩිය යුතුය.",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo",
      "englishTitle": "The Ten Discourses beginning with the Flood",
      "sinhalaTitle": "ඕඝාදි සූත්‍ර දසකය",
      "vaggaEnglish": "Chapter on Floods",
      "vaggaSinhala": "ඕඝ වර්ගය"
    },
    {
      "number": 597,
      "numberRange": "597-608",
      "pali": "‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu pañcindriyāni bhāvento pañcindriyāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu pañcindriyāni bhāvento pañcindriyāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu saddhindriyaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ…pe… paññindriyaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ. Evaṃ kho, bhikkhave, bhikkhu pañcindriyāni bhāvento pañcindriyāni bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. Gaṅgāpeyyālavaggo terasamo. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamādavagga-balakaraṇīyavagga-esanāvaggā vitthāretabbā.",
      "english": "Just as, monks, the river Ganges slopes towards the east, inclines towards the east, gravitates towards the east; even so, monks, a monk cultivating the five faculties, making the five faculties abundant, slopes towards Nibbāna, inclines towards Nibbāna, gravitates towards Nibbāna.\n\nAnd how, monks, does a monk cultivating the five faculties, making the five faculties abundant, slope towards Nibbāna, incline towards Nibbāna, gravitate towards Nibbāna? Here, monks, a monk cultivates the faculty of faith, which culminates in the elimination of lust, the elimination of hatred, and the elimination of delusion. He cultivates the faculty of energy, which culminates in the elimination of lust, the elimination of hatred, and the elimination of delusion. He cultivates the faculty of mindfulness, which culminates in the elimination of lust, the elimination of hatred, and the elimination of delusion. He cultivates the faculty of concentration, which culminates in the elimination of lust, the elimination of hatred, and the elimination of delusion. He cultivates the faculty of wisdom, which culminates in the elimination of lust, the elimination of hatred, and the elimination of delusion. It is in this way, monks, that a monk cultivating the five faculties, making the five faculties abundant, slopes towards Nibbāna, inclines towards Nibbāna, gravitates towards Nibbāna.",
      "sinhala": "මහණෙනි, ගංගා නදිය යම්සේ පෙරදිගට බස්නාසුලු ද, පෙරදිගට නැඹුරු වූයේ ද, පෙරදිගට ඇදී ගලන්නේ ද, එපරිද්දෙන්ම මහණෙනි, භික්ෂුව පංච ඉන්ද්‍රියන් වඩන කල්හි, පංච ඉන්ද්‍රියන් බහුල වශයෙන් පුරුදු කරන කල්හි නිවනට බස්නාසුලු වෙයි, නිවනට නැඹුරු වූවෙක් වෙයි, නිවනට ඇදී යනසුලු වෙයි.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් පංච ඉන්ද්‍රියන් වඩන කල්හි, පංච ඉන්ද්‍රියන් බහුල වශයෙන් පුරුදු කරන කල්හි නිවනට බස්නාසුලු වෙයි ද, නිවනට නැඹුරු වූවෙක් වෙයි ද, නිවනට ඇදී යනසුලු වෙයි ද?\n\nමහණෙනි, මේ ශාසනයෙහි භික්ෂුව රාගය දුරු කිරීම කෙළවර කොට ඇති, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇති, මෝහය දුරු කිරීම කෙළවර කොට ඇති ශ්‍රද්ධා ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇති, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇති, මෝහය දුරු කිරීම කෙළවර කොට ඇති වීර්ය ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇති, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇති, මෝහය දුරු කිරීම කෙළවර කොට ඇති සති ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇති, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇති, මෝහය දුරු කිරීම කෙළවර කොට ඇති සමාධි ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇති, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇති, මෝහය දුරු කිරීම කෙළවර කොට ඇති ප්‍රඥා ඉන්ද්‍රිය වඩයි.\n\nමහණෙනි, භික්ෂුව මෙලෙසින්ම පංච ඉන්ද්‍රියන් වඩන කල්හි, පංච ඉන්ද්‍රියන් බහුල වශයෙන් පුරුදු කරන කල්හි නිවනට බස්නාසුලු වෙයි, නිවනට නැඹුරු වූවෙක් වෙයි, නිවනට ඇදී යනසුලු වෙයි.\n\nදොළොස්වැන්නයි. ගංගාපෙය්‍යාල වර්ගය දහතුන්වැන්නයි. එහි සූත්‍ර සාරාංශය: පෙරදිගට බස්නාසුලු සූත්‍ර සයයි, මුහුදට බස්නාසුලු සූත්‍ර සයයි; මේ දෙකෙහි සය බැගින් සූත්‍ර දොළොසක් වෙයි. එමගින් මෙම වර්ගය ප්‍රකාශ කරනු ලැබේ. අප්පමාද වර්ගය, බලකරණීය වර්ගය, ඒසනා වර්ගය විස්තර වශයෙන් පැහැදිලි කළ යුතුය.",
      "paliTitle": "Pācīnādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo",
      "englishTitle": "The Twelve Discourses beginning with Flowing East",
      "sinhalaTitle": "පාචීනාදි සූත්‍ර ද්වාදසකය",
      "vaggaEnglish": "Chapter on the Ganges Repetition Series",
      "vaggaSinhala": "ගංගා පෙය්‍යාල වර්ගය"
    },
    {
      "number": 641,
      "numberRange": "641-650",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya pañcindriyāni bhāvetabbāni. Katamāni pañca? Idha, bhikkhave, bhikkhu saddhindriyaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ. Vīriyindriyaṃ …pe… satindriyaṃ… samādhindriyaṃ … paññindriyaṃ bhāveti rāgavinayapariyosānaṃ dosavinayapariyosānaṃ mohavinayapariyosānaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya imāni pañcindriyāni bhāvetabbānī’’ti. Oghavaggo sattarasamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti. ",
      "english": "Monks, there are these five higher fetters. What are these five? Craving for form-existence, craving for formless-existence, conceit, restlessness, and ignorance – these, monks, are the five higher fetters.\n\nFor the direct knowledge, full comprehension, utter destruction, and abandonment of these five higher fetters, monks, five faculties must be developed. What are these five? Here, monks, a monk develops the faculty of conviction, culminating in the removal of lust, culminating in the removal of aversion, culminating in the removal of delusion. He develops the faculty of energy, culminating in the removal of lust, culminating in the removal of aversion, culminating in the removal of delusion. He develops the faculty of mindfulness, culminating in the removal of lust, culminating in the removal of aversion, culminating in the removal of delusion. He develops the faculty of concentration, culminating in the removal of lust, culminating in the removal of aversion, culminating in the removal of delusion. He develops the faculty of wisdom, culminating in the removal of lust, culminating in the removal of aversion, culminating in the removal of delusion. For the direct knowledge, full comprehension, utter destruction, and abandonment of these five higher fetters, monks, these five faculties must be developed.",
      "sinhala": "මහණෙනි, මේ ඌර්ධ්වභාගීය සංයෝජන පහකි. ඒ කවර පහක්ද යත්: රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාව යන මේවාය. මහණෙනි, මේවා ඌර්ධ්වභාගීය සංයෝජන පහයි. මහණෙනි, මේ ඌර්ධ්වභාගීය සංයෝජන පහ ප්‍රත්‍යක්ෂ ඥානයෙන් අවබෝධ කරගැනීම පිණිසත්, මනාකොට අවබෝධ කිරීම පිණිසත්, ඒවා ක්ෂය කිරීම පිණිසත්, ප්‍රහාණය කිරීම පිණිසත් පංච ඉන්ද්‍රියයන් වඩනු ලැබිය යුතුය.\n\nඒ කවර පහක්ද යත්: මහණෙනි, මෙහි භික්ෂුව රාගය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තා වූද ශ්‍රද්ධා ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තා වූද වීර්ය්‍ය ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තා වූද සති ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තා වූද සමාධි ඉන්ද්‍රිය වඩයි. රාගය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, ද්වේෂය දුරු කිරීම කෙළවර කොට ඇත්තා වූද, මෝහය දුරු කිරීම කෙළවර කොට ඇත්තා වූද ප්‍රඥා ඉන්ද්‍රිය වඩයි. මහණෙනි, මේ ඌර්ධ්වභාගීය සංයෝජන පහ ප්‍රත්‍යක්ෂ ඥානයෙන් අවබෝධ කරගැනීම පිණිසත්, මනාකොට අවබෝධ කිරීම පිණිසත්, ඒවා ක්ෂය කිරීම පිණිසත්, ප්‍රහාණය කිරීම පිණිසත් මේ පංච ඉන්ද්‍රියයන් වඩනු ලැබිය යුතුය.\n\nඕඝවග්ගය දහහත්වන වග්ගයයි. එහි උද්දානය මෙසේය:\nඕඝය, යෝගය, උපාදානය, ග්‍රන්ථය, අනුශය;\nකාමගුණ, නීවරණ, ඛන්ධ, ඕරම්භාගීය (සහ ඌර්ධ්වභාගීය).",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo",
      "englishTitle": "The Ten Discourses beginning with the Flood",
      "sinhalaTitle": "ඕඝාදි සූත්‍ර දසකය",
      "vaggaEnglish": "Chapter on Floods",
      "vaggaSinhala": "ඕඝ වර්ගය"
    }
  ],
  "footer": {
    "pali": "Indriyasaṃyuttaṃ catutthaṃ.",
    "english": "The Linked Discourses on the Faculties, the fourth.",
    "sinhala": "ඉන්ද්‍රිය සංයුක්තය සිව්වන කොටසයි."
  }
}