{
  "id": "sn.5.8",
  "title": {
    "pali": "Anuruddhasaṃyuttaṃ",
    "english": "The Connected Discourses on Anuruddha",
    "sinhala": "අනුරුද්ධ සංයුත්තය"
  },
  "sections": [
    {
      "number": 899,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā anuruddho sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmato anuruddhassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘yesaṃ kesañci cattāro satipaṭṭhānā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci cattāro satipaṭṭhānā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī’’ti. Atha kho āyasmā mahāmoggallāno āyasmato anuruddhassa cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – āyasmato anuruddhassa sammukhe pāturahosi. Atha kho āyasmā mahāmoggallāno āyasmantaṃ anuruddhaṃ etadavoca – ‘‘kittāvatā nu kho, āvuso anuruddha, bhikkhuno cattāro satipaṭṭhānā āraddhā hontī’’ti? ‘‘Idhāvuso, bhikkhu ajjhattaṃ kāye samudayadhammānupassī viharati, ajjhattaṃ kāye vayadhammānupassī viharati, ajjhattaṃ kāye samudayavayadhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Bahiddhā kāye samudayadhammānupassī viharati, bahiddhā kāye vayadhammānupassī viharati, bahiddhā kāye samudayavayadhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattabahiddhā kāye samudayadhammānupassī viharati, ajjhattabahiddhā kāye vayadhammānupassī viharati, ajjhattabahiddhā kāye samudayavayadhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘So sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘appaṭikūlañca paṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. ‘‘Ajjhattaṃ vedanāsu samudayadhammānupassī viharati, ajjhattaṃ vedanāsu vayadhammānupassī viharati, ajjhattaṃ vedanāsu samudayavayadhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Bahiddhā vedanāsu samudayadhammānupassī viharati, bahiddhā vedanāsu vayadhammānupassī viharati, bahiddhā vedanāsu samudayavayadhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattabahiddhā vedanāsu samudayadhammānupassī viharati, ajjhattabahiddhā vedanāsu vayadhammānupassī viharati, ajjhattabahiddhā vedanāsu samudayavayadhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘So sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati; sace ākaṅkhati – ‘appaṭikūlañca paṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. ‘‘Ajjhattaṃ citte…pe… bahiddhā citte…pe… ajjhattabahiddhā citte samudayadhammānupassī viharati… ajjhattabahiddhā citte vayadhammānupassī viharati… ajjhattabahiddhā citte samudayavayadhammānupassī viharati ātāpī…pe… abhijjhādomanassaṃ. ‘‘So sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati…pe… upekkhako tattha viharati sato sampajāno. ‘‘Ajjhattaṃ dhammesu…pe… bahiddhā dhammesu…pe… ajjhattabahiddhā dhammesu samudayadhammānupassī viharati… ajjhattabahiddhā dhammesu vayadhammānupassī viharati… ajjhattabahiddhā dhammesu samudayavayadhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘So sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati…pe… upekkhako tattha viharati sato sampajāno. Ettāvatā kho, āvuso, bhikkhuno cattāro satipaṭṭhānā āraddhā hontī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion, the Venerable Anuruddha was dwelling at Savatthi, in Jeta's Grove, Anathapindika's Park.\n\nThen, while the Venerable Anuruddha was in seclusion, engaged in solitary meditation, a mental reflection arose in him thus: \"For whosoever have neglected the four establishments of mindfulness, for them the Noble Path leading to the complete destruction of suffering is neglected. For whosoever have undertaken the four establishments of mindfulness, for them the Noble Path leading to the complete destruction of suffering is undertaken.\"\n\nThen, the Venerable Mahāmoggallāna, having known with his own mind the mental reflection in the mind of the Venerable Anuruddha – just as a strong man might extend his flexed arm or flex his extended arm – appeared before the Venerable Anuruddha. Then the Venerable Mahāmoggallāna said to the Venerable Anuruddha: \"To what extent, friend Anuruddha, are the four establishments of mindfulness undertaken by a monk?\"\n\n\"Here, friend, a monk dwells observing the phenomenon of origination in the body internally; he dwells observing the phenomenon of disappearance in the body internally; he dwells observing the phenomenon of origination and disappearance in the body internally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in the body externally; he dwells observing the phenomenon of disappearance in the body externally; he dwells observing the phenomenon of origination and disappearance in the body externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in the body internally and externally; he dwells observing the phenomenon of disappearance in the body internally and externally; he dwells observing the phenomenon of origination and disappearance in the body internally and externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world.\n\nIf he wishes: 'May I dwell perceiving repulsion in what is not repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in what is repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'May I dwell perceiving repulsion in both what is not repulsive and what is repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in both what is repulsive and what is not repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'Having avoided both what is not repulsive and what is repulsive, may I dwell equanimous, mindful and clearly comprehending,' he dwells there equanimous, mindful and clearly comprehending.\n\nHe dwells observing the phenomenon of origination in feelings internally; he dwells observing the phenomenon of disappearance in feelings internally; he dwells observing the phenomenon of origination and disappearance in feelings internally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in feelings externally; he dwells observing the phenomenon of disappearance in feelings externally; he dwells observing the phenomenon of origination and disappearance in feelings externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in feelings internally and externally; he dwells observing the phenomenon of disappearance in feelings internally and externally; he dwells observing the phenomenon of origination and disappearance in feelings internally and externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world.\n\nIf he wishes: 'May I dwell perceiving repulsion in what is not repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in what is repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'May I dwell perceiving repulsion in both what is not repulsive and what is repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in both what is repulsive and what is not repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'Having avoided both what is not repulsive and what is repulsive, may I dwell equanimous, mindful and clearly comprehending,' he dwells there equanimous, mindful and clearly comprehending.\n\nHe dwells observing the phenomenon of origination in the mind internally; he dwells observing the phenomenon of disappearance in the mind internally; he dwells observing the phenomenon of origination and disappearance in the mind internally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in the mind externally; he dwells observing the phenomenon of disappearance in the mind externally; he dwells observing the phenomenon of origination and disappearance in the mind externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in the mind internally and externally; he dwells observing the phenomenon of disappearance in the mind internally and externally; he dwells observing the phenomenon of origination and disappearance in the mind internally and externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world.\n\nIf he wishes: 'May I dwell perceiving repulsion in what is not repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in what is repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'May I dwell perceiving repulsion in both what is not repulsive and what is repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in both what is repulsive and what is not repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'Having avoided both what is not repulsive and what is repulsive, may I dwell equanimous, mindful and clearly comprehending,' he dwells there equanimous, mindful and clearly comprehending.\n\nHe dwells observing the phenomenon of origination in mental phenomena internally; he dwells observing the phenomenon of disappearance in mental phenomena internally; he dwells observing the phenomenon of origination and disappearance in mental phenomena internally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in mental phenomena externally; he dwells observing the phenomenon of disappearance in mental phenomena externally; he dwells observing the phenomenon of origination and disappearance in mental phenomena externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world. He dwells observing the phenomenon of origination in mental phenomena internally and externally; he dwells observing the phenomenon of disappearance in mental phenomena internally and externally; he dwells observing the phenomenon of origination and disappearance in mental phenomena internally and externally – ardent, clearly comprehending, and mindful – having removed covetousness and displeasure concerning the world.\n\nIf he wishes: 'May I dwell perceiving repulsion in what is not repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in what is repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'May I dwell perceiving repulsion in both what is not repulsive and what is repulsive,' he dwells there perceiving repulsion. If he wishes: 'May I dwell perceiving non-repulsion in both what is repulsive and what is not repulsive,' he dwells there perceiving non-repulsion. If he wishes: 'Having avoided both what is not repulsive and what is repulsive, may I dwell equanimous, mindful and clearly comprehending,' he dwells there equanimous, mindful and clearly comprehending.\n\nTo this extent, friends, the four establishments of mindfulness are undertaken by a bhikkhu. This is the first.",
      "sinhala": "මා හට මෙසේ අසන ලදී. එක් සමයෙක්හි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සැවැත් නුවර ජේතවන නම් ආරාමයෙහි අනේපිඬු සිටුතුමා විසින් කරවන ලද විහාරයෙහි වාසය කරති. ඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ හුදෙකලා වූ කල්හි, ප්‍රතිසංලීනව සිටි කල්හි, මෙබඳු චිත්ත විතර්කයක් පහළ විය: ‘‘යම් කිසිවෙකුට සිව් සතිපට්ඨානයන් වඩන ලද්දක් නොවන්නේද, ඔහුට දුක සම්පූර්ණයෙන්ම අවසන් කරන්නා වූ ආර්ය මාර්ගය වඩන ලද්දක් නොවේ. යම් කිසිවෙකුට සිව් සතිපට්ඨානයන් වඩන ලද්දක් වන්නේද, ඔහුට දුක සම්පූර්ණයෙන්ම අවසන් කරන්නා වූ ආර්ය මාර්ගය වඩන ලද්දක් වේ.’’ ඉක්බිති ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේගේ සිතින් මෙබඳු සිතුවිල්ල දැනගෙන, බලවත් පුරුෂයෙක් හැකිලූ අතක් දිගහරින්නාක් මෙන් හෝ දිගහළ අතක් හකුළුවන්නාක් මෙන් හෝ, එලෙසම, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ඉදිරියේ පහළ විය. ඉක්බිති ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙය පැවසූ සේක: ‘‘ඇවැත් අනුරුද්ධයෙනි, භික්ෂුවකට සිව් සතිපට්ඨානයන් වඩන ලද්දක් වන්නේ කෙතෙක් ප්‍රමාණයකින්ද?’’\n\n‘‘ඇවැත්නි, මෙහිලා භික්ෂුව තමාගේ කයෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ කයෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ කයෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. අනුන්ගේ කයෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ කයෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ කයෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. තමාගේ හා අනුන්ගේ කයෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ කයෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ කයෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි.\n\nහෙතෙම යම් හෙයකින් 'අප්‍රතිකුල වූ දෙයෙහි පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් දෙයෙහි අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් දෙකෙහිම පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් හා අප්‍රතිකුල දෙකෙහිම අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් යන දෙකම දුරු කර, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, හෙතෙම එහි මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරයි.\n\nතමාගේ වේදනා කෙරෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ වේදනා කෙරෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ වේදනා කෙරෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. අනුන්ගේ වේදනා කෙරෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ වේදනා කෙරෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ වේදනා කෙරෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. තමාගේ හා අනුන්ගේ වේදනා කෙරෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ වේදනා කෙරෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ වේදනා කෙරෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි.\n\nහෙතෙම යම් හෙයකින් 'අප්‍රතිකුල වූ දෙයෙහි පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් දෙයෙහි අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් දෙකෙහිම පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් හා අප්‍රතිකුල දෙකෙහිම අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් යන දෙකම දුරු කර, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, හෙතෙම එහි මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරයි.\n\nතමාගේ සිතෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ සිතෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ සිතෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. අනුන්ගේ සිතෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ සිතෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ සිතෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. තමාගේ හා අනුන්ගේ සිතෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ සිතෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ සිතෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි.\n\nහෙතෙම යම් හෙයකින් 'අප්‍රතිකුල වූ දෙයෙහි පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් දෙයෙහි අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් දෙකෙහිම පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් හා අප්‍රතිකුල දෙකෙහිම අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් යන දෙකම දුරු කර, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, හෙතෙම එහි මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරයි.\n\nතමාගේ ධර්මයන් කෙරෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ ධර්මයන් කෙරෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ ධර්මයන් කෙරෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. අනුන්ගේ ධර්මයන් කෙරෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ ධර්මයන් කෙරෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. අනුන්ගේ ධර්මයන් කෙරෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි. තමාගේ හා අනුන්ගේ ධර්මයන් කෙරෙහි හටගැනීමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ ධර්මයන් කෙරෙහි නැසී යාමේ ස්වභාවය අනුව බලමින් වාසය කරයි. තමාගේ හා අනුන්ගේ ධර්මයන් කෙරෙහි හටගැනීමේ හා නැසී යාමේ ස්වභාවය අනුව බලමින්, වීර්යවත්ව, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි ඇති අධිච්ඡාව හා දොම්නස දුරු කර වාසය කරයි.\n\nහෙතෙම යම් හෙයකින් 'අප්‍රතිකුල වූ දෙයෙහි පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් දෙයෙහි අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් දෙකෙහිම පිළිකුල් සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි පිළිකුල් සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'පිළිකුල් හා අප්‍රතිකුල දෙකෙහිම අප්‍රතිකුල සංඥාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, එහි අප්‍රතිකුල සංඥාවෙන් වාසය කරයි; යම් හෙයකින් 'අප්‍රතිකුල හා පිළිකුල් යන දෙකම දුරු කර, මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරන්නට' යැයි කැමති වන්නේ නම්, හෙතෙම එහි මනා සිහියෙන්, මනා ප්‍රඥාවෙන් යුක්තව උපේක්ෂාවෙන් වාසය කරයි.\n\nමේ අයුරින් ම, ඇවැත්නි, භික්ෂුවක් විසින් සතර සතිපට්ඨානයෝ ආරම්භ කරනු ලැබෙත්.\n\nපළමු කොටස.",
      "paliTitle": "Paṭhamarahogatasuttaṃ",
      "vagga": "Rahogatavaggo",
      "englishTitle": "The First Discourse on Seclusion",
      "sinhalaTitle": "පළමු රහෝගත සූත්‍රය",
      "vaggaEnglish": "Chapter on Seclusion",
      "vaggaSinhala": "රහෝගත වර්ගය"
    },
    {
      "number": 900,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmato anuruddhassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘yesaṃ kesañci cattāro satipaṭṭhānā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī; yesaṃ kesañci cattāro satipaṭṭhānā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī’’ti. Atha kho āyasmā mahāmoggallāno āyasmato anuruddhassa cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – āyasmato anuruddhassa sammukhe pāturahosi. Atha kho āyasmā mahāmoggallāno āyasmantaṃ anuruddhaṃ etadavoca – ‘‘kittāvatā nu kho, āvuso anuruddha, bhikkhuno cattāro satipaṭṭhānā āraddhā hontī’’ti? ‘‘Idhāvuso, bhikkhu ajjhattaṃ kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Bahiddhā kāye kāyānupassī viharati…pe… ajjhattabahiddhā kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Ajjhattaṃ vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Bahiddhā vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ajjhattabahiddhā vedanāsu vedanānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Ajjhattaṃ citte…pe… bahiddhā citte…pe… ajjhattabahiddhā citte cittānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. ‘‘Ajjhattaṃ dhammesu…pe… bahiddhā dhammesu…pe… ajjhattabahiddhā dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ettāvatā kho, āvuso, bhikkhuno cattāro satipaṭṭhānā āraddhā hontī’’ti. Dutiyaṃ.",
      "english": "At Sāvatthī. Then, indeed, Venerable Anuruddha, having gone into seclusion and solitude, had this thought arise in his mind: \"For whosoever the four establishments of mindfulness are neglected, for them the noble path leading to the complete destruction of suffering is neglected. For whosoever the four establishments of mindfulness are aroused, for them the noble path leading to the complete destruction of suffering is aroused.\"\n\nThen, indeed, Venerable Mahāmoggallāna, having known with his own mind the thought process in Venerable Anuruddha's mind—just as a strong man might extend his flexed arm or flex his extended arm—even so, he appeared before Venerable Anuruddha.\n\nThen, indeed, Venerable Mahāmoggallāna said this to Venerable Anuruddha: \"To what extent, friend Anuruddha, are the four establishments of mindfulness aroused for a monk?\"\n\n\"Here, friend, a monk dwells observing the body in the body internally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing the body in the body externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing the body in the body internally and externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world.\"\n\n\"He dwells observing feelings in feelings internally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing feelings in feelings externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing feelings in feelings internally and externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world.\"\n\n\"He dwells observing mind in mind internally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing mind in mind externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing mind in mind internally and externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world.\"\n\n\"He dwells observing phenomena in phenomena internally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing phenomena in phenomena externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world. He dwells observing phenomena in phenomena internally and externally, ardent, clearly comprehending, mindful, having put away covetousness and displeasure concerning the world.\"\n\n\"To this extent, friend, are the four establishments of mindfulness aroused for a monk.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑවිට ආයුෂ්මත් අනුරුද්ධ ස්ථ‌විරයන් වහන්සේ ඒකාන්තයට ගොස්, ධ්‍යානයට සමවන්ව, මෙබඳු චිත්ත විතර්කයක් ඇති කර ගත් සේක – “යම් කිසිවෙකුට සතර සතිපට්ඨානයන් වඩන ලද්දක් නොවේ නම්, දුක් කෙළවර කිරීම පිණිස පවත්නා අරිය මග්ගය ද ඔවුන්ට වඩන ලද්දක් නොවේ; යම් කිසිවෙකුට සතර සතිපට්ඨානයන් වඩන ලද්දේ නම්, දුක් කෙළවර කිරීම පිණිස පවත්නා අරිය මග්ගය ද ඔවුන්ට වඩන ලද්දක් වන්නේ ය.”\n\nඑවිට ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථ‌විරයන් වහන්සේ ආයුෂ්මත් අනුරුද්ධ ස්ථ‌විරයන් වහන්සේගේ සිතින් චිත්ත විතර්කය දැනගෙන – ශක්‌තිමත් පුරුෂයෙකු නැවුණු අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරී අතක් නවා ගන්නාක් මෙන් – එලෙසින්ම ආයුෂ්මත් අනුරුද්ධ ස්ථ‌විරයන් වහන්සේ ඉදිරියේ පහළ වූ සේක.\n\nඉක්බිති ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථ‌විරයන් වහන්සේ ආයුෂ්මත් අනුරුද්ධ ස්ථ‌විරයන් වහන්සේට මෙය වදාළ සේක: “ඇවැත් අනුරුද්ධ, භික්‌ෂුවකට සතර සතිපට්ඨානයන් වඩන ලද්දක් වන්නේ කෙතෙක් දුරකට ද?”\n\n“ඇවැත්නි, මෙහිලා භික්‌ෂුව අධ්‍යාත්මිකව කයෙහි කය අනුව බලමින්, වීර්යයෙන්, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයා පිළිබඳව ඇති තණ්හාව හා ද්‌වේෂය දුරු කොට වාසය කරයි.\n\nබාහිරව කයෙහි කය අනුව බලමින් වාසය කරයි... අධ්‍යාත්මිකව හා බාහිරව කයෙහි කය අනුව බලමින්, වීර්යයෙන්, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයා පිළිබඳව ඇති තණ්හාව හා ද්‌වේෂය දුරු කොට වාසය කරයි.\n\nඅධ්‍යාත්මිකව වේදනායෙහි වේදනා අනුව බලමින්, වීර්යයෙන්, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයා පිළිබඳව ඇති තණ්හාව හා ද්‌වේෂය දුරු කොට වාසය කරයි. බාහිරව වේදනායෙහි වේදනා අනුව බලමින්, වීර්යයෙන්, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයා පිළිබඳව ඇති තණ්හාව හා ද්‌වේෂය දුරු කොට වාසය කරයි. අධ්‍යාත්මිකව හා බාහිරව වේදනායෙහි වේදනා අනුව බලමින්, වීර්යයෙන්, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයා පිළිබඳව ඇති තණ්හාව හා ද්‌වේෂය දුරු කොට වාසය කරයි.\n\nඅධ්‍යාත්මිකව සිතෙහි සිත අනුව බලමින්... බාහිරව සිතෙහි සිත අනුව බලමින්... අධ්‍යාත්මිකව හා බාහිරව සිතෙහි සිත අනුව බලමින්, වීර්යයෙන්, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයා පිළිබඳව ඇති තණ්හාව හා ද්‌වේෂය දුරු කොට වාසය කරයි.\n\nඅධ්‍යාත්මිකව ධර්මයන්හි ධර්මයන් අනුව බලමින්... බාහිරව ධර්මයන්හි ධර්මයන් අනුව බලමින්... අධ්‍යාත්මිකව හා බාහිරව ධර්මයන්හි ධර්මයන් අනුව බලමින්, වීර්යයෙන්, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයා පිළිබඳව ඇති තණ්හාව හා ද්‌වේෂය දුරු කොට වාසය කරයි.\n\n“ඇවැත්නි, මෙපමණෙකින් භික්‌ෂුවකට සතර සතිපට්ඨානයන් වඩන ලද්දක් වන්නේ ය.”",
      "paliTitle": "Dutiyarahogatasuttaṃ",
      "englishTitle": "Second Sutta on Seclusion",
      "sinhalaTitle": "දුතිය රහෝගත සූත්‍රය"
    },
    {
      "number": 901,
      "pali": "Ekaṃ samayaṃ āyasmā anuruddho sāvatthiyaṃ viharati sutanutīre. Atha kho sambahulā bhikkhū yenāyasmā anuruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā anuruddhena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū āyasmantaṃ anuruddhaṃ etadavocuṃ – ‘‘katamesaṃ āyasmā anuruddho dhammānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto’’ti? ‘‘Catunnaṃ khvāhaṃ, āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Katamesaṃ catunnaṃ? Idhāhaṃ, āvuso, kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – imesaṃ khvāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā hīnaṃ dhammaṃ hīnato abbhaññāsiṃ, majjhimaṃ dhammaṃ majjhimato abbhaññāsiṃ, paṇītaṃ dhammaṃ paṇītato abbhaññāsi’’nti. Tatiyaṃ.",
      "english": "At one time, the Venerable Anuruddha was dwelling near Sāvatthī, on the bank of the Sutanu River. Then, a considerable number of monastics approached the Venerable Anuruddha. Having approached, they exchanged friendly greetings with the Venerable Anuruddha. Having concluded their courteous and memorable conversation, they sat down to one side. As they sat to one side, those monastics said to the Venerable Anuruddha: “Venerable Anuruddha, by the development and frequent practice of which phenomena have you attained great supernormal knowledge?”\n\n“Friends, it is by the development and frequent practice of the four foundations of mindfulness that I have attained great supernormal knowledge.”\n\n“Which four?”\n\n“Here, friends, I dwell contemplating the body in the body, ardent, clearly comprehending, and mindful, having removed covetousness and discontent regarding the world. I dwell contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having removed covetousness and discontent regarding the world. I dwell contemplating mind in mind, ardent, clearly comprehending, and mindful, having removed covetousness and discontent regarding the world. I dwell contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having removed covetousness and discontent regarding the world. It is by the development and frequent practice of these four foundations of mindfulness that I have attained great supernormal knowledge.”\n\n“Furthermore, friends, by the development and frequent practice of these four foundations of mindfulness, I understood inferior phenomena as inferior, middling phenomena as middling, and superior phenomena as superior.”",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සැවැත් නුවර සුතනු ගං තෙර වාසය කළහ. එල්බ බොහෝ භික්‍ෂූහු ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සමග සතුටු කථා කළහ. සතුටු විය යුතු, සිහි කළ යුතු කථා පැවැත්වීමෙන් පසු එකත් පසෙක වාඩි වූහ.\n\nඑකත් පසෙක වාඩි වී සිටි ඒ භික්‍ෂූහු ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙසේ පැවසූහ: “ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ කිනම් ධර‍්මයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද මහා අභිඥාවට පත් වූයේදැයි?”\n\n“ආයුෂ්මතුනි, මම සතර සතිපට‍්ඨානයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද මහා අභිඥාවට පත් වීමි. කිනම් සතරකද යත්:\n\nආයුෂ්මතුනි, මෙහිලා මම වීර්යයෙන්, සම්‍යක් ප‍්‍රඥාවෙන් හා සිහියෙන් යුක්තව, ලෝකය කෙරෙහි පවත්නා දැඩි ලෝභය හා ද්වේෂය දුරු කොට, කායයෙහි කායානුපස්සීව වාසය කරමි; වේදනාවන්හි වේදනානුපස්සීව... සිතෙහි චිත්තානුපස්සීව... ධර‍්මයන්හි ධර‍්මානුපස්සීව, වීර්යයෙන්, සම්‍යක් ප‍්‍රඥාවෙන් හා සිහියෙන් යුක්තව, ලෝකය කෙරෙහි පවත්නා දැඩි ලෝභය හා ද්වේෂය දුරු කොට වාසය කරමි. ආයුෂ්මතුනි, මම මේ සතර සතිපට‍්ඨානයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද මහා අභිඥාවට පත් වීමි.\n\nතවද, ආයුෂ්මතුනි, මම මේ සතර සතිපට‍්ඨානයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද, හීන ධර‍්මයන් හීන වශයෙන් අවබෝධ කළෙමි; මධ්‍යම ධර‍්මයන් මධ්‍යම වශයෙන් අවබෝධ කළෙමි; ප‍්‍රණීත ධර‍්මයන් ප‍්‍රණීත වශයෙන් අවබෝධ කළෙමි.”",
      "paliTitle": "Sutanusuttaṃ",
      "englishTitle": "The Discourse on the Sutanu River",
      "sinhalaTitle": "සුතනු සූත්‍රය"
    },
    {
      "number": 902,
      "pali": "Ekaṃ samayaṃ āyasmā ca anuruddho āyasmā ca sāriputto āyasmā ca mahāmoggallāno sākete viharanti kaṇḍakīvane. Atha kho āyasmā ca sāriputto āyasmā ca mahāmoggallāno sāyanhasamayaṃ paṭisallānā vuṭṭhitā yenāyasmā anuruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā anuruddhena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘sekhenāvuso anuruddha, bhikkhunā katame dhammā upasampajja vihātabbā’’ti? ‘‘Sekhenāvuso sāriputta, bhikkhunā cattāro satipaṭṭhānā upasampajja vihātabbā. Katame cattāro? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu …pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – sekhenāvuso sāriputta, bhikkhunā ime cattāro satipaṭṭhānā upasampajja vihātabbā’’ti. Catutthaṃ.",
      "english": "At one time, the Venerable Anuruddha, the Venerable Sāriputta, and the Venerable Mahāmoggallāna were dwelling at Sāketa, in Kaṇḍakī Forest. Then, in the evening, the Venerable Sāriputta and the Venerable Mahāmoggallāna, having emerged from their seclusion, approached the Venerable Anuruddha. Having approached, they exchanged friendly greetings with the Venerable Anuruddha. After exchanging courteous and memorable talk, they sat down to one side. As he sat to one side, the Venerable Sāriputta said to the Venerable Anuruddha: 'Friend Anuruddha, which principles should a trainee monk cultivate and practice?'\n\n'Friend Sāriputta, a trainee monk should cultivate and practice the four foundations of mindfulness.'\n\n'Which four?'\n\n'Here, friend, a monk dwells observing the body in the body, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure concerning the world; he dwells observing feelings in feelings, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure concerning the world; he dwells observing the mind in the mind, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure concerning the world; he dwells observing mental phenomena in mental phenomena, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure concerning the world. Friend Sāriputta, these are the four foundations of mindfulness that a trainee monk should cultivate and practice.'",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් අනුරුද්ධ, ආයුෂ්මත් ශ්‍රීපුත්‍ර සහ ආයුෂ්මත් මහාමොග්ගල්ලාන යන තෙරුන්වහන්සේලා සාකේතයෙහි කණ්ඨකී වනයෙහි වැඩසිටියහ. ඉන්පසු ආයුෂ්මත් ශ්‍රීපුත්‍ර සහ ආයුෂ්මත් මහාමොග්ගල්ලාන යන තෙරුන්වහන්සේලා සවස් වේලෙහි පටිසල්ලානයෙන් නැඟිට, ආයුෂ්මත් අනුරුද්ධ තෙරුන්වහන්සේ වෙත පැමිණියහ. පැමිණ ආයුෂ්මත් අනුරුද්ධ තෙරුන්වහන්සේ සමඟ සතුටු සිත් උපදවන හා සිහිකටයුතු කතා බස් හුවමාරු කරගෙන, එක් පැත්තකින් වාඩි වූහ. එක් පැත්තකින් වාඩි වූ ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරුන්වහන්සේ ආයුෂ්මත් අනුරුද්ධ තෙරුන්වහන්සේට මෙය පැවසූහ: \"ඇවැත් අනුරුද්ධයෙනි, සේඛ භික්ෂුවක් විසින් කවර ධර්මයන්ට එළඹ වාසය කළ යුතුද?\"\n\n\"ඇවැත් ශ්‍රීපුත්‍රයෙනි, සේඛ භික්ෂුවක් විසින් සිව් සතිපට්ඨානයන්ට එළඹ වාසය කළ යුතුයි. කවරවාද ඒ සතර? ඇවැත්නි, මෙහිලා භික්ෂුව කෙලෙස් තවන වීරියෙන් යුක්තව, සම්‍යක් ප්‍රඥාවෙන් යුක්තව, සිහියෙන් යුක්තව කයෙහි කය අනුව බලමින්, ලෝකයෙහි (කයට අරමුණු වූ) අභිජ්ඣා සහ දෝමනස්සය දුරුකර වාසය කරයි; වේදනාවන්හි වේදනා අනුව බලමින්, කෙලෙස් තවන වීරියෙන් යුක්තව, සම්‍යක් ප්‍රඥාවෙන් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි (වේදනාවන්ට අරමුණු වූ) අභිජ්ඣා සහ දෝමනස්සය දුරුකර වාසය කරයි; සිතෙහි සිත අනුව බලමින්, කෙලෙස් තවන වීරියෙන් යුක්තව, සම්‍යක් ප්‍රඥාවෙන් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි (සිතට අරමුණු වූ) අභිජ්ඣා සහ දෝමනස්සය දුරුකර වාසය කරයි; ධර්මයන්හි ධර්මයන් අනුව බලමින්, කෙලෙස් තවන වීරියෙන් යුක්තව, සම්‍යක් ප්‍රඥාවෙන් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි (ධර්මයන්ට අරමුණු වූ) අභිජ්ඣා සහ දෝමනස්සය දුරුකර වාසය කරයි – ඇවැත් ශ්‍රීපුත්‍රයෙනි, සේඛ භික්ෂුවක් විසින් මේ සිව් සතිපට්ඨානයන්ට එළඹ වාසය කළ යුතුයි.\"",
      "paliTitle": "Paṭhamakaṇḍakīsuttaṃ",
      "englishTitle": "The First Discourse at Kaṇḍakī",
      "sinhalaTitle": "පළමු කණ්ඩකී සූත්‍රය"
    },
    {
      "number": 903,
      "pali": "Sāketanidānaṃ. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘asekhenāvuso anuruddha, bhikkhunā katame dhammā upasampajja vihātabbā’’ti? ‘‘Asekhenāvuso sāriputta, bhikkhunā cattāro satipaṭṭhānā upasampajja vihātabbā. Katame cattāro? Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – asekhenāvuso sāriputta, bhikkhunā ime cattāro satipaṭṭhānā upasampajja vihātabbā’’ti. Pañcamaṃ.",
      "english": "The Venerable Sāriputta, sitting to one side, addressed the Venerable Anuruddha thus: “Friend Anuruddha, which states should a monk who is beyond training realize and abide in?”\n\n“Friend Sāriputta, a monk who is beyond training should realize and abide in the four foundations of mindfulness.”\n\n“Which four?”\n\n“Here, friend, a monk abides contemplating the body as body, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure in the world; abides contemplating feelings as feelings, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure in the world; abides contemplating mind as mind, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure in the world; abides contemplating mental qualities as mental qualities, ardent, clearly comprehending, and mindful, having put away covetousness and displeasure in the world. Friend Sāriputta, these four foundations of mindfulness should be realized and abided in by a monk who is beyond training.”",
      "sinhala": "සාකේත නිදානයයි. එකත්පස්ව වැඩසිටි ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙය වදාළ සේක:\n\n‘‘ආයුෂ්මත් අනුරුද්ධයෙනි, අසේක භික්ෂුවක් විසින් කෙලෙසින් ධර‍්මයන්ට සමවැදී වාසය කළ යුතුද?’’\n\n‘‘ආයුෂ්මත් සාරිපුත්තයෙනි, අසේක භික්ෂුවක් විසින් සිහිනුවණ පිහිටුවාගෙන සිව් සතිපට්ඨානයන් වඩමින් වාසය කළ යුතුය. කුමන සතරක්ද?\n\nආයුෂ්මත, මෙහිදී භික්ෂුව ලෝකයේ ඇති ඇල්ම හා දොම්නස දුරු කොට, කායෙහි කායානුපස්සීව, කෙලෙස් තවන වීරියෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහි නුවණින් යුක්තව වාසය කරයි; වේදනාවන්හි වේදනානුපස්සීව, කෙලෙස් තවන වීරියෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහි නුවණින් යුක්තව, ලෝකයේ ඇති ඇල්ම හා දොම්නස දුරු කොට වාසය කරයි; සිත්හි චිත්තානුපස්සීව, කෙලෙස් තවන වීරියෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහි නුවණින් යුක්තව, ලෝකයේ ඇති ඇල්ම හා දොම්නස දුරු කොට වාසය කරයි; ධම්මයන්හි ධම්මානුපස්සීව, කෙලෙස් තවන වීරියෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහි නුවණින් යුක්තව, ලෝකයේ ඇති ඇල්ම හා දොම්නස දුරු කොට වාසය කරයි. ආයුෂ්මත් සාරිපුත්තයෙනි, අසේක භික්ෂුවක් විසින් මේ සිව් සතිපට්ඨානයන් සිහිනුවණ පිහිටුවාගෙන වඩමින් වාසය කළ යුතුය.’’\n\nපස්වන සූත්‍රයයි.",
      "paliTitle": "Dutiyakaṇḍakīsuttaṃ",
      "englishTitle": "Second Sutta at Kaṇḍakī",
      "sinhalaTitle": "දුතිය කණ්ඩකී සූත්‍රය"
    },
    {
      "number": 904,
      "pali": "Sāketanidānaṃ. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘katamesaṃ āyasmā anuruddho dhammānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto’’ti? ‘‘Catunnaṃ khvāhaṃ, āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Katamesaṃ catunnaṃ? Idhāhaṃ, āvuso, kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – imesaṃ khvāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā sahassaṃ lokaṃ abhijānāmī’’ti. Chaṭṭhaṃ.",
      "english": "Seated to one side, the venerable Sāriputta said this to the venerable Anuruddha: “By cultivating and repeatedly practicing which phenomena, venerable Anuruddha, have you attained great direct knowledge?”\n\n“Friend, it is by cultivating and repeatedly practicing the four establishments of mindfulness that I have attained great direct knowledge.”\n\n“Which four?”\n\n“Here, friend, I dwell contemplating the body in the body, contemplating feelings in feelings, contemplating the mind in the mind, and contemplating mental phenomena in mental phenomena – ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world. It is by cultivating and repeatedly practicing these four establishments of mindfulness, friend, that I have attained great direct knowledge. And furthermore, friend, it is by cultivating and repeatedly practicing these four establishments of mindfulness that I directly know a thousand world-systems.”",
      "sinhala": "සාකේත නිදානයයි.\n\nඑක් දවසක් එක් පැත්තක වැඩ සිටි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙය වදාළ සේක: \"ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්ස, කවර ධර්මයන් දියුණු කිරීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන් ඔබ වහන්සේ මහත් අභිඥා ලබාගත්තෙහිද?\" \"ඇවැත්නි, මම සතර සතිපට්ඨාන ධර්මයන් දියුණු කිරීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන් මහත් අභිඥා ලබාගත්තෙමි. කවර සතරක්ද යත්? ඇවැත්නි, මේ ශාසනයෙහි මම කාය වශයෙන් කායානුපස්සීව වාසය කරමි, කෙලෙස් තවන වීරියෙන් යුතුව, මනා නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇති ලෝභය සහ දොම්නස දුරු කොට. වේදනා වශයෙන් වේදනානුපස්සීව වාසය කරමි, කෙලෙස් තවන වීරියෙන් යුතුව, මනා නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇති ලෝභය සහ දොම්නස දුරු කොට. සිත වශයෙන් චිත්තානුපස්සීව වාසය කරමි, කෙලෙස් තවන වීරියෙන් යුතුව, මනා නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇති ලෝභය සහ දොම්නස දුරු කොට. ධර්ම වශයෙන් ධම්මානුපස්සීව වාසය කරමි, කෙලෙස් තවන වීරියෙන් යුතුව, මනා නුවණින් යුතුව, මනා සිහියෙන් යුතුව, ලෝකයෙහි ඇති ලෝභය සහ දොම්නස දුරු කොට – ඇවැත්නි, මම මේ සතර සතිපට්ඨාන ධර්මයන් දියුණු කිරීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන් මහත් අභිඥා ලබාගත්තෙමි. ඇවැත්නි, තවද මම මේ සතර සතිපට්ඨාන ධර්මයන් දියුණු කිරීමෙන් සහ බහුල වශයෙන් පුරුදු කිරීමෙන් දහසක් ලෝකයන් පිළිබඳව විශේෂ ඥානයෙන් අවබෝධ කරගනිමි.\"\n\nසවෙනි සූත්‍රයයි.",
      "paliTitle": "Tatiyakaṇḍakīsuttaṃ",
      "englishTitle": "Third Discourse at Kaṇḍakī",
      "sinhalaTitle": "තතිය කණ්ඩකී සූත්‍රය"
    },
    {
      "number": 905,
      "pali": "Sāvatthinidānaṃ. Tatra kho āyasmā anuruddho bhikkhū āmantesi – ‘‘āvuso bhikkhavo’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato anuruddhassa paccassosuṃ. Āyasmā anuruddho etadavoca – ‘‘Cattārome, āvuso, satipaṭṭhānā bhāvitā bahulīkatā taṇhakkhayāya saṃvattanti. Katame cattāro? Idhāvuso, bhikkhu kāye kāyānupassī viharati…pe… vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – ime kho, āvuso, cattāro satipaṭṭhānā bhāvitā bahulīkatā taṇhakkhayāya saṃvattantī’’ti. Sattamaṃ.",
      "english": "At Sāvatthī.\nThere, indeed, the venerable Anuruddha addressed the monastics, saying, \"Friends, monastics!\"\n\"Friend!\" those monastics replied to the venerable Anuruddha. The venerable Anuruddha spoke thus: \"Friends, these four foundations of mindfulness, when developed and frequently practiced, lead to the destruction of craving. Which four? Here, friends, a monastic dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world. A monastic dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world. A monastic dwells contemplating mind in mind, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world. A monastic dwells contemplating mental qualities in mental qualities, ardent, clearly comprehending, and mindful, having removed covetousness and displeasure concerning the world. These, friends, are the four foundations of mindfulness that, when developed and frequently practiced, lead to the destruction of craving.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී. එහිදී ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා, ‘‘ඇවැත්නි භික්ෂූනි’’ යැයි වදාළ සේක. ‘‘ඇවැත්නි’’ යැයි ඒ භික්ෂූහු ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට පිළිවදන් දුන්හ. ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: ‘‘ඇවැත්නි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ සතර සතිපට්ඨාන ධර්මයෝ තණ්හාව ක්ෂය කිරීම පිණිස පවතී. ඒ සතර කවරේද? ඇවැත්නි, මෙහිලා භික්ෂුව කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහියෙන් යුක්තව, මනා ප්‍රඥාවෙන් යුක්තව, ලෝකයෙහි (ලෝකයට සම්බන්ධ) අභිධ්‍යා හා දෞර්මනස්සය දුරු කර, කායයා කෙරෙහි කාය අනුව බලා වෙසෙයි...පෙ... වේදනා කෙරෙහි වේදනා අනුව බලා වෙසෙයි...පෙ... සිත් කෙරෙහි සිත් අනුව බලා වෙසෙයි...පෙ... ධර්මයන් කෙරෙහි ධර්ම අනුව බලා වෙසෙයි. ඇවැත්නි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ සතර සතිපට්ඨාන ධර්මයෝ තණ්හාව ක්ෂය කිරීම පිණිස පවතී.’’ සත්වන සූත්‍රයයි.",
      "paliTitle": "Taṇhakkhayasuttaṃ",
      "englishTitle": "Destruction of Craving Sutta",
      "sinhalaTitle": "තණ්හක්ඛය සූත්‍රය"
    },
    {
      "number": 906,
      "pali": "Ekaṃ samayaṃ āyasmā anuruddho sāvatthiyaṃ viharati salaḷāgāre. Tatra kho āyasmā anuruddho bhikkhū āmantesi…pe… etadavoca – ‘‘seyyathāpi, āvuso, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā. Atha mahājanakāyo āgaccheyya kuddālapiṭakaṃ [kuddālapiṭakaṃ (bahūsu)] ādāya – ‘mayaṃ imaṃ gaṅgānadiṃ pacchāninnaṃ karissāma pacchāpoṇaṃ pacchāpabbhāra’nti. Taṃ kiṃ maññathāvuso, api nu so mahājanakāyo gaṅgānadiṃ pacchāninnaṃ kareyya pacchāpoṇaṃ pacchāpabbhāra’’nti? ‘‘No hetaṃ, āvuso’’. ‘‘Taṃ kissa hetu’’? ‘‘Gaṅgā, āvuso, nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā. Sā na sukarā pacchāninnaṃ kātuṃ pacchāpoṇaṃ pacchāpabbhāraṃ. Yāvadeva ca pana so mahājanakāyo kilamathassa vighātassa bhāgī assā’’ti. ‘‘Evameva kho, āvuso, bhikkhuṃ cattāro satipaṭṭhāne bhāventaṃ cattāro satipaṭṭhāne bahulīkarontaṃ rājāno vā rājamahāmattā vā mittā vā amaccā vā ñātī vā sālohitā vā bhogehi abhihaṭṭhuṃ pavāreyyuṃ – ‘ehambho purisa, kiṃ te ime kāsāvā anudahanti? Kiṃ muṇḍo kapālamanusañcarasi? Ehi hīnāyāvattitvā bhoge ca bhuñjassu puññāni ca karohī’’’ti. ‘‘So vata, āvuso, bhikkhu cattāro satipaṭṭhāne bhāvento cattāro satipaṭṭhāne bahulīkaronto sikkhaṃ paccakkhāya hīnāyāvattissatīti – netaṃ ṭhānaṃ vijjati. Taṃ kissa hetu? Yañhi taṃ, āvuso, cittaṃ dīgharattaṃ vivekaninnaṃ vivekapoṇaṃ vivekapabbhāraṃ taṃ vata hīnāyāvattissatīti – netaṃ ṭhānaṃ vijjati. Kathañcāvuso, bhikkhu cattāro satipaṭṭhāne bhāveti, cattāro satipaṭṭhāne bahulīkarotīti? Idhāvuso, bhikkhu kāye kāyānupassī viharati…pe… vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Evaṃ kho, āvuso, bhikkhu cattāro satipaṭṭhāne bhāveti, cattāro satipaṭṭhāne bahulīkarotī’’ti. Aṭṭhamaṃ.",
      "english": "At one time, the venerable Anuruddha was dwelling at Savatthi, in the Salaḷa mansion. There, indeed, the venerable Anuruddha addressed the bhikkhus, saying: “Friends, just as the river Ganges flows eastward, inclines eastward, and slopes eastward. Then, a large group of people might come, taking pickaxes and baskets, saying, ‘We will make this river Ganges flow westward, incline westward, and slope westward.’ What do you think, friends, could that large group of people make the river Ganges flow westward, incline westward, and slope westward?”\n\n“No, friends.”\n\n“For what reason?”\n\n“Friends, the river Ganges flows eastward, inclines eastward, and slopes eastward. It is not easy to make it flow westward, incline westward, and slope westward. That large group of people would only become participants in weariness and frustration.”\n\n“Just so, friends, if kings or royal ministers, or friends, or colleagues, or relatives, or kinsmen were to invite a bhikkhu who is cultivating the four foundations of mindfulness, who is developing the four foundations of mindfulness, saying, ‘Come, good man, what good do these yellow robes do you? Why do you wander about bald with an alms-bowl? Come, return to a lower life, enjoy wealth, and perform meritorious deeds!’ For that bhikkhu who is cultivating the four foundations of mindfulness, who is developing the four foundations of mindfulness, that he would renounce the training and return to a lower life – such a thing is impossible.\n\nFor what reason? Friends, for that mind which for a long time has inclined towards seclusion, gravitated towards seclusion, and sloped towards seclusion – for such a mind to return to a lower life – such a thing is impossible. And how, friends, does a bhikkhu cultivate the four foundations of mindfulness, develop the four foundations of mindfulness? Here, friends, a bhikkhu dwells contemplating the body in the body, contemplating feelings in feelings, contemplating mind in mind, contemplating mental phenomena in mental phenomena, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.\n\nIt is in this way, friends, that a bhikkhu cultivates the four foundations of mindfulness, develops the four foundations of mindfulness.”",
      "sinhala": "එක් කලෙක ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සැවැත් නුවර සළළාගාරයෙහි වැඩවසන සේක. එහිදී ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක:\n\n\"ඇවැත්නි, යම් සේ ගංගා නදිය නැගෙනහිරට බෑවුම් සහිත වේ ද, නැගෙනහිරට නැඹුරු වූ ද, නැගෙනහිරට ගලායෑමේ ස්වභාවය ඇත්තී ද, එවිට විශාල ජනකායෙක් උදලු හා කූඩ රැගෙන පැමිණ 'අපි මේ ගංගා නදිය බටහිරට බෑවුම් සහිත, බටහිරට නැඹුරු වූ, බටහිරට ගලායෑමේ ස්වභාවය ඇති කරන්නෙමු' යි කියන්නේ නම්. ඇවැත්නි, ඔබලා ඒ කුමක් සිතන්නහු ද? ඒ මහජනකාය ගංගා නදිය බටහිරට බෑවුම් සහිත, බටහිරට නැඹුරු වූ, බටහිරට ගලායෑමේ ස්වභාවය ඇති කළ හැකි ද?\"\n\n\"ඇවැත්නි, එය එසේ නොවේ.\"\n\n\"ඒ කුමක් හෙයින් ද?\"\n\n\"ඇවැත්නි, ගංගා නදිය නැගෙනහිරට බෑවුම් සහිත, නැගෙනහිරට නැඹුරු වූ, නැගෙනහිරට ගලායෑමේ ස්වභාවය ඇත්තී ය. එය බටහිරට බෑවුම් සහිත, බටහිරට නැඹුරු වූ, බටහිරට ගලායෑමේ ස්වභාවය ඇති කිරීමට පහසු නොවේ. ඒ මහජනකාය හුදෙක් වෙහෙසට හා පීඩාවට භාගී වනු ඇත.\"\n\n\"ඇවැත්නි, එසෙයින් ම සිව් සතිපට්ඨානයන් වඩන, සිව් සතිපට්ඨානයන් බහුල වශයෙන් පුරුදු කරන භික්ෂුවක් රජවරු හෝ රජුගේ මහාමාත්‍ය​වරු හෝ මිත්‍රයෝ හෝ අමාත්‍යයෝ හෝ ඥාතීහු හෝ නෑදෑයෝ හෝ බොහෝ භෝග සම්පත් පිරිනමා, 'නුඹ එන්න, පුරුෂය! නුඹට මේ කසාවත් කුමකට ද? මුඩු හිසින් දන් වැටී හැසිරෙන්නේ කුමකට ද? එන්න, පහත් වූ ගිහි බවට නැවත පැමිණ භෝග සම්පත් ද අනුභව කරන්න, පින් ද කරන්න' යි ආරාධනා කරත් නම්.\"\n\n\"ඇවැත්නි, සිව් සතිපට්ඨානයන් වඩමින්, සිව් සතිපට්ඨානයන් බහුල වශයෙන් පුරුදු කරමින් සිටින ඒ භික්ෂුව ශික්ෂාව හැර දමා පහත් වූ ගිහි බවට නැවත පැමිණෙන්නේ ය යනු මෙවැනි අවස්ථාවක් නොපවතී.\"\n\n\"ඒ කුමක් හෙයින් ද?\"\n\n\"ඇවැත්නි, දීර්ඝ කාලයක් තිස්සේ විවේකය කරා බෑවුම් සහිත වූ, විවේකය කරා නැඹුරු වූ, විවේකය කරා ගලායෑමේ ස්වභාවය ඇති වූ යම් සිතක් වේ ද, ඒ සිත පහත් වූ ගිහි බවට නැවත පැමිණෙන්නේ ය යනු මෙවැනි අවස්ථාවක් නොපවතී.\"\n\n\"ඇවැත්නි, භික්ෂුව කෙසේ නම් සිව් සතිපට්ඨානයන් වඩන්නේ ද, සිව් සතිපට්ඨානයන් බහුල වශයෙන් පුරුදු කරන්නේ ද?\"\n\n\"ඇවැත්නි, මෙහි ලා භික්ෂුව ලෝකයෙහි ඇති දැඩි ලෝභය හා දොම්නස දුරු කරමින්, කෙලෙස් තවන වීරියෙන්, මනා සිහියෙන් හා මනා නුවණින් යුතුව, කයෙහි කය අනුව බලමින් වාසය කරයි. වේදනාවන්හි වේදනා අනුව බලමින් වාසය කරයි. සිතෙහි සිත අනුව බලමින් වාසය කරයි. ධ​ර්මයන්හි ධ​ර්මයන් අනුව බලමින් වාසය කරයි.\"\n\n\"ඇවැත්නි, භික්ෂුව සිව් සතිපට්ඨානයන් වඩන්නේ, සිව් සතිපට්ඨානයන් බහුල වශයෙන් පුරුදු කරන්නේ මෙසේ යි.\"",
      "paliTitle": "Salaḷāgārasuttaṃ",
      "englishTitle": "The Discourse at the Salaḷa Tree House",
      "sinhalaTitle": "සලළාගාර සූත්‍රය"
    },
    {
      "number": 907,
      "pali": "Ekaṃ samayaṃ āyasmā ca anuruddho āyasmā ca sāriputto vesāliyaṃ viharanti ambapālivane. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito…pe… ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ anuruddhaṃ etadavoca – ‘‘Vippasannāni kho te, āvuso anuruddha, indriyāni, parisuddho mukhavaṇṇo pariyodāto. Katamenāyasmā anuruddho vihārena etarahi bahulaṃ viharatī’’ti? ‘‘Catūsu khvāhaṃ, āvuso, satipaṭṭhānesu suppatiṭṭhitacitto etarahi bahulaṃ viharāmi. Katamesu catūsu? Idhāhaṃ, āvuso, kāye kāyānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – imesu khvāhaṃ, āvuso, catūsu satipaṭṭhānesu suppatiṭṭhitacitto etarahi bahulaṃ viharāmi. Yo so, āvuso, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, so imesu catūsu satipaṭṭhānesu suppatiṭṭhitacitto bahulaṃ viharatī’’ti. ‘‘Lābhā vata no, āvuso, suladdhaṃ vata no, āvuso! Ye mayaṃ āyasmato anuruddhassa sammukhāva assumha āsabhiṃ vācaṃ bhāsamānassā’’ti. Navamaṃ.",
      "english": "On one occasion, the venerable Anuruddha and the venerable Sāriputta were dwelling at Vesālī, in Ambapāli’s Grove. Then, in the evening, the venerable Sāriputta, having emerged from his seclusion, approached the venerable Anuruddha. Having exchanged greetings and pleasantries, he sat down to one side and said to the venerable Anuruddha:\n\n“Friend Anuruddha, your faculties are indeed very clear, and your complexion is pure and radiant. With what mode of abiding does the venerable Anuruddha mostly dwell now?”\n\n“Indeed, friend, I mostly dwell now with my mind well-established in the four foundations of mindfulness. In which four? Here, friend, I dwell contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and distress in the world. I dwell contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and distress in the world. I dwell contemplating consciousness in consciousness, ardent, clearly comprehending, and mindful, having overcome covetousness and distress in the world. I dwell contemplating mental phenomena in mental phenomena, ardent, clearly comprehending, and mindful, having overcome covetousness and distress in the world. Indeed, friend, it is in these four foundations of mindfulness that I mostly dwell now, with my mind well-established. That monk, friend, who is an Arahant, whose taints are destroyed, who has lived the holy life, who has completed his task, who has laid down the burden, who has attained his own true goal, whose fetters of existence are utterly destroyed, and who is perfectly liberated through true knowledge – he mostly dwells with his mind well-established in these four foundations of mindfulness.”\n\n“It is indeed our gain, friend; it is indeed our good fortune, friend, that we have been right here in the presence of the venerable Anuruddha while he was speaking such a supreme declaration!”",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ ද විශාලා නුවර අම්බපාලී වනයේ වැඩසිටියහ. එකල්හි ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ සවස් කාලයෙහි භාවනානුයෝගී විවේකයෙන් නැගී සිට… එකත්පසෙක වැඩහිඳ, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙසේ වදාළහ – “ඇවැත් අනුරුද්ධයෙනි, ඇත්තෙන්ම ඔබගේ ඉන්ද්‍රියයන් ඉතා ප්‍ර‌සන්න ය. මුහුණ පැහැපත් ය, දීප්තිමත් ය. මේ දිනවල ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ බහුල වශයෙන් කවර විහරණයකින් වැඩවසන සේක් දැ?”යි.\n\n“ඇවැත්නි, ඇත්තෙන්ම මම මේ දිනවල බහුල වශයෙන් සිව් සතිපට්ඨානයන්හි මනාව පිහිටුවන ලද සිතින් යුතුව වැඩවසමි. කවර සිව් සතිපට්ඨානයන්හි ද? ඇවැත්නි, මෙහි ලෝකයෙහි ඇති ලෝභය හා දොම්නස දුරු කර, කෙලෙස් තවන වීරියෙන්, මනා සිහියෙන්, මනා දැනුමෙන් යුතුව, මම කයෙහි කය අනුව බලමින් වාසය කරමි; වේදනාවන්හි… සිතෙහි… ධ‌ර්‌මයන්හි ධ‌ර්‌මයන් අනුව බලමින් වාසය කරමි. කෙලෙස් තවන වීරියෙන්, මනා සිහියෙන්, මනා දැනුමෙන් යුතුව, ලෝකයෙහි ඇති ලෝභය හා දොම්නස දුරු කරමි. ඇවැත්නි, ඇත්තෙන්ම මම මේ සිව් සතිපට්ඨානයන්හි මනාව පිහිටුවන ලද සිතින් යුතුව, මේ දිනවල බහුල වශයෙන් වැඩවසමි. ඇවැත්නි, යම් භික්ෂුවක් රහත් භාවයට පත් වී, ආශ්‍රවයන් ක්ෂය කොට, බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කොට, කළ යුතු දේ කොට, කෙලෙස් බර බැහැර කොට, තමන්ගේම අරමුණ (අරහත් ඵලය) ලබා, භව සංයෝජන ක්ෂය කොට, සම්‍යක් ප්‍ර‌ඥාවෙන් විමුක්ත වී ඇත්ද, ඔහු ද බහුල වශයෙන් මේ සිව් සතිපට්ඨානයන්හි මනාව පිහිටුවන ලද සිතින් යුතුව වැඩවසන්නේය”යි.\n\n“ඇවැත්නි, ඇත්තෙන්ම අපට ලාභයකි, ඇත්තෙන්ම අපට මනා කොට ලැබුණකි! ඒ යම් හෙයකින්, අපි ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සිංහනාදයක් වැනි වචන වදාරණ සේකැයි අසා සිටි බැවිනි.”",
      "paliTitle": "Ambapālivanasuttaṃ",
      "englishTitle": "Ambapālī’s Grove Sutta",
      "sinhalaTitle": "අම්බපාලිවන සූත්‍රය"
    },
    {
      "number": 908,
      "pali": "Ekaṃ samayaṃ āyasmā anuruddho sāvatthiyaṃ viharati andhavanasmiṃ ābādhiko dukkhito bāḷhagilāno. Atha kho sambahulā bhikkhū yenāyasmā anuruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ anuruddhaṃ etadavocuṃ – ‘‘Katamenāyasmato anuruddhassa vihārena viharato uppannā sārīrikā dukkhā vedanā cittaṃ na pariyādāya tiṭṭhantī’’ti? ‘‘Catūsu kho me, āvuso, satipaṭṭhānesu suppatiṭṭhitacittassa viharato uppannā sārīrikā dukkhā vedanā cittaṃ na pariyādāya tiṭṭhanti. Katamesu catūsu? Idhāhaṃ, āvuso, kāye kāyānupassī viharāmi…pe… vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – imesu kho me, āvuso, catūsu satipaṭṭhānesu suppatiṭṭhitacittassa viharato uppannā sārīrikā dukkhā vedanā cittaṃ na pariyādāya tiṭṭhantī’’ti. Dasamaṃ. Rahogatavaggo paṭhamo. Tassuddānaṃ – Rahogatena dve vuttā, sutanu kaṇḍakī tayo; Taṇhakkhayasalaḷāgāraṃ, ambapāli ca gilānanti.",
      "english": "At one time, the Venerable Anuruddha was dwelling at Sāvatthī, in the Dark Forest, afflicted, suffering, gravely ill. Then, a number of monks approached the Venerable Anuruddha; having approached, they said to the Venerable Anuruddha: “By dwelling in what way, Venerable Anuruddha, do the arisen bodily painful feelings not overwhelm the mind?”\n\n“Friends, while I dwell with my mind well-established in the four foundations of mindfulness, the arisen bodily painful feelings do not overwhelm my mind. Which four? Here, friends, I dwell contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. I dwell contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. I dwell contemplating the mind in the mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. I dwell contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. It is while I dwell with my mind well-established in these four foundations of mindfulness, friends, that the arisen bodily painful feelings do not overwhelm my mind.”\n\nThe Tenth. The Seclusion Chapter, the First. Its summary: Two are stated by Rahogata, three by Sutanu and Kaṇḍakī; Taṇhakkhaya, Salaḷāgāra, Ambapāli, and Gilāna.",
      "sinhala": "එක් කලෙක ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සැවැත් නුවර අන්ධවනයෙහි ආබාධිතව, දුකට පත්ව, දැඩි සේ ගිලන්ව වාසය කළහ.\n\nඉක්බිති බොහෝ භික්ෂූන් වහන්සේලා ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට එළඹියහ; එළඹ ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙය කීහ – ‘‘ආයුෂ්මත් අනුරුද්ධයන් වහන්සේ කවර විහරණයකින් වාසය කරන කල්හිද උපන් ශාරීරික දුක් වේදනා සිත යටපත් කර නොගෙන සිටිත්ද?’’\n\n‘‘ඇවැත්නි, මාගේ සිත සතර සතිපට්ඨානයන්හි මනාකොට පිහිටුවාගෙන වාසය කරන කල්හි උපන් ශාරීරික දුක් වේදනා සිත යටපත් කර නොගෙන සිටිත්. කවර සතරකද? ඇවැත්නි, මෙහිලා මම කෙලෙස් තවන වීරියෙන් යුක්තව, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයෙහි ආශාව සහ දොම්නස දුරු කොට කයෙහි කය අනුව බලමින් වාසය කරමි; වේදනාවන්හි වේදනා අනුව බලමින් වාසය කරමි; සිතෙහි සිත අනුව බලමින් වාසය කරමි; ධර්මයන්හි ධර්ම අනුව බලමින් වාසය කරමි. ඇවැත්නි, මාගේ සිත මේ සතර සතිපට්ඨානයන්හි මනාකොට පිහිටුවාගෙන වාසය කරන කල්හි උපන් ශාරීරික දුක් වේදනා සිත යටපත් කර නොගෙන සිටිත්’’යි.\n\nදසවෙනි සූත්‍රයයි. රහෝගත වර්ගය පළමුවැන්නයි. එහි සූත්‍ර නාමාවලිය: රහෝගත නම් සූත්‍ර දෙකක් ද, සුතනු, කණ්ඩකී යන සූත්‍ර තුනක් ද, තණ්හක්ඛය, සලළාගාර නම් සූත්‍ර ද, අම්බපාලි සහ ගිලාන නම් සූත්‍ර ද (ඒවායේ නම්) වේ.",
      "paliTitle": "Bāḷhagilānasuttaṃ",
      "englishTitle": "Gravely Ill Sutta",
      "sinhalaTitle": "බාළ්හගිලාන සූත්‍රය"
    },
    {
      "number": 909,
      "pali": "Ekaṃ samayaṃ āyasmā anuruddho sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho sambahulā bhikkhū yenāyasmā anuruddho tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā anuruddhena saddhiṃ…pe… ekamantaṃ nisinnā kho te bhikkhū āyasmantaṃ anuruddhaṃ etadavocuṃ – ‘‘Katamesaṃ āyasmā anuruddho dhammānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto’’ti? ‘‘Catunnaṃ khvāhaṃ, āvuso, satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Katamesaṃ catunnaṃ? Idhāhaṃ, āvuso, kāye kāyānupassī viharāmi…pe… vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ – imesaṃ khvāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā mahābhiññataṃ patto. Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā kappasahassaṃ anussarāmī’’ti. Paṭhamaṃ.",
      "english": "At one time, the Venerable Anuruddha was dwelling in Sāvatthī, in Jeta's Grove, at Anāthapiṇḍika's monastery. Then, many monks approached where the Venerable Anuruddha was. Having approached, they exchanged courteous greetings with the Venerable Anuruddha and, after a pleasant conversation, sat down to one side. Having sat down to one side, those monks said this to the Venerable Anuruddha: \"Venerable Anuruddha, by developing and frequently practicing which qualities have you attained great supernormal knowledge?\" \"Friends, it is by developing and frequently practicing the four foundations of mindfulness that I have attained great supernormal knowledge. Which four? Here, friends, I dwell contemplating the body in the body, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world. I dwell contemplating feelings in feelings, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world. I dwell contemplating mind in mind, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world. I dwell contemplating mental phenomena in mental phenomena, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world. Indeed, friends, it is by developing and frequently practicing these four foundations of mindfulness that I have attained great supernormal knowledge. And furthermore, friends, it is by developing and frequently practicing these four foundations of mindfulness that I recollect a thousand eons.\"",
      "sinhala": "එක් කලෙක ආයුෂ‍්මත් අනුරුද්ධ ස‍්ථවිරයන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයේ වාසය කරන සේක. ඉක්බිති බොහෝ භික‍්ෂූන් වහන්සේලා ආයුෂ‍්මත් අනුරුද්ධ ස‍්ථවිරයන් වහන්සේ වැඩසිටින තැනට එළඹියහ; එළඹ, ආයුෂ‍්මත් අනුරුද්ධ ස‍්ථවිරයන් වහන්සේ සමඟ සුහද කථාබස් කොට, එකත්පස‍්ව වාඩි වී, ආයුෂ‍්මත් අනුරුද්ධ ස‍්ථවිරයන් වහන්සේට මෙය පැවසූහ – ‘‘ආයුෂ‍්මත් අනුරුද්ධයන් වහන්ස, කවර ධර‍්මයන් භාවනා කිරීමෙන් හා නිතර පුහුණු කිරීමෙන් ඔබ වහන්සේ මහත් අභිඥා ලබා ඇත්තේද?’’ ‘‘ආයුෂ‍්මතුනි, මම සතරක් වූ සතිපට‍්ඨානයන් භාවනා කිරීමෙන් හා නිතර පුහුණු කිරීමෙන් මහත් අභිඥා ලැබුවෙමි. කවර සතරක්ද? ආයුෂ‍්මතුනි, මෙහි මම කයෙහි කය අනුව බලමින් වාසය කරමි; වේදනාවන්හි වේදනා අනුව බලමින් වාසය කරමි; සිතෙහි සිත අනුව බලමින් වාසය කරමි; ධර‍්මයන්හි ධර‍්මයන් අනුව බලමින් වාසය කරමි, කෙලෙස් තවන වීරියෙන් යුතුව, මනා සිහි නුවණින් යුතුව, සිහි ඇතිව, ලෝකයේ ආශාවන් හා දොම්නස් දුරු කරමිනි. ආයුෂ‍්මතුනි, මේ සතර සතිපට‍්ඨානයන් භාවනා කිරීමෙන් හා නිතර පුහුණු කිරීමෙන් මම මහත් අභිඥා ලැබුවෙමි. තවද, ආයුෂ‍්මතුනි, මම මේ සතර සතිපට‍්ඨානයන් භාවනා කිරීමෙන් හා නිතර පුහුණු කිරීමෙන් කල‍්ප දහසක් සිහි කරමි.’’\n\nපළමුවැන්නයි.",
      "paliTitle": "Kappasahassasuttaṃ",
      "vagga": "Dutiyavaggo",
      "englishTitle": "A Thousand Aeons Sutta",
      "sinhalaTitle": "කප්පසහස්ස සූත්‍රය",
      "vaggaEnglish": "Second Chapter",
      "vaggaSinhala": "දෙවන වර්ගය"
    },
    {
      "number": 910,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā anekavihitaṃ iddhividhaṃ paccanubhomi – ekopi hutvā bahudhā homi…pe… yāva brahmalokāpi kāyena vasaṃ vattemī’’ti. Dutiyaṃ.",
      "english": "And because I have developed and cultivated these four foundations of mindfulness, friends, I experience various kinds of psychic power: being one, I become many; being many, I become one; I appear and vanish; I go unhindered through walls, ramparts, and mountains as if through open space; I dive in and out of the earth as if in water; I walk on water without sinking as if on land; I travel through the sky cross-legged like a winged bird; I touch and stroke with my hand the moon and sun, so mighty and powerful; and I exercise mastery with my body even as far as the Brahma world.",
      "sinhala": "ආයුෂ්මත්වරුනි, මේ සතර සතිපට්ඨාන ධර්මයන් වඩන ලද්දක් හා බහුල වශයෙන් පුරුදු කරන ලද්දක් වූ නිසා, මම නොයෙක් ප්‍ර‌කාර වූ සෘද්ධි ප්‍ර‌ාතිහාර්යයන් අත්විඳිමි – එනම්, එක් අයෙක් ව සිට බොහෝ අයෙක් වෙමි... මේ ආදී වශයෙන්... බ්‍ර‌හ්ම ලෝකය දක්වාම කයින් වසඟයට පත් කරමි.\n\nදෙවැන්නයි.",
      "paliTitle": "Iddhividhasuttaṃ",
      "englishTitle": "The Modes of Psychic Power Sutta",
      "sinhalaTitle": "ඉද්ධිවිධ සූත්‍රය"
    },
    {
      "number": 911,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāmi dibbe ca mānuse ca ye dūre santike cā’’ti. Tatiyaṃ.",
      "english": "And indeed, friends, having cultivated and frequently practiced these four foundations of mindfulness, I hear both divine and human sounds, those that are far and those that are near, with the purified divine ear element that transcends human capabilities.",
      "sinhala": "ආයුෂ්මතුන් වහන්ස, මේ සතර සතිපට්ඨාන ධර්මයන් මා විසින් වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද බැවින්, මනුෂ්‍ය ශ්‍රවණය ඉක්මවා ගිය පිරිසිදු දිව්‍යමය සෝතධාතුවෙන්, දුරින් ඇති ද ළඟින් ඇති ද දිව්‍යමය ශබ්දයන් ද මනුෂ්‍ය ශබ්දයන් ද යන ශබ්ද දෙවර්ගයම මට ඇසේ.",
      "paliTitle": "Dibbasotasuttaṃ",
      "englishTitle": "The Divine Ear Sutta",
      "sinhalaTitle": "දිබ්බසෝත සූත්‍රය"
    },
    {
      "number": 912,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāmi – sarāgaṃ vā cittaṃ ‘sarāgaṃ citta’nti pajānāmi…pe… avimuttaṃ vā cittaṃ ‘avimuttaṃ citta’nti pajānāmī’’ti. Catutthaṃ.",
      "english": "And indeed, friends, because I have cultivated and made much of these four establishments of mindfulness, I comprehend, with my own mind, the minds of other beings, of other individuals: a mind with greed I comprehend as ‘a mind with greed’; a mind without greed I comprehend as ‘a mind without greed’; a mind with aversion I comprehend as ‘a mind with aversion’; a mind without aversion I comprehend as ‘a mind without aversion’; a mind with delusion I comprehend as ‘a mind with delusion’; a mind without delusion I comprehend as ‘a mind without delusion’; a contracted mind I comprehend as ‘a contracted mind’; a distracted mind I comprehend as ‘a distracted mind’; an exalted mind I comprehend as ‘an exalted mind’; an unexalted mind I comprehend as ‘an unexalted mind’; a surpassable mind I comprehend as ‘a surpassable mind’; an unsurpassable mind I comprehend as ‘an unsurpassable mind’; a concentrated mind I comprehend as ‘a concentrated mind’; an unconcentrated mind I comprehend as ‘an unconcentrated mind’; a liberated mind I comprehend as ‘a liberated mind’; an unliberated mind I comprehend as ‘an unliberated mind’.",
      "sinhala": "\"ආවූසෝ, මා විසින් මේ සතර සතිපට්ඨානයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද, අන්‍ය සත්වයන්ගේද, අන්‍ය පුද්ගලයන්ගේද සිත් මාගේ සිතින් පිරිසිඳ දැනගනිමි – රාග සහිත වූ සිත, ‘රාග සහිත සිතැයි’ දැනගනිමි... විමුක්ති රහිත වූ සිත, ‘විමුක්ති රහිත සිතැයි’ දැනගනිමි.\"",
      "paliTitle": "Cetopariyasuttaṃ",
      "englishTitle": "Knowledge of the Minds of Others Sutta",
      "sinhalaTitle": "චේතෝපරිය සූත්‍රය"
    },
    {
      "number": 913,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāmī’’ti. Pañcamaṃ.",
      "english": "And indeed, friends, because I have developed and extensively cultivated these four foundations of mindfulness, I know as they truly are both the proper occasion as the proper occasion, and the improper occasion as the improper occasion.",
      "sinhala": "ආයුෂ්මතුනි, තවද මා විසින් මේ සතර සතිපට්ඨාන ධර්මයන් වඩන ලද හෙයින් ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින් ද, හේතුව හේතුව වශයෙන් ද, අහේතුව අහේතුව වශයෙන් ද, ඇති සැටියෙන් ම අවබෝධ කරමි.",
      "paliTitle": "Ṭhānasuttaṃ",
      "englishTitle": "Subjects for Contemplation Sutta",
      "sinhalaTitle": "ඨාන සූත්‍රය"
    },
    {
      "number": 914,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāmī’’ti. Chaṭṭhaṃ.",
      "english": "And indeed, friends, it is because I have developed and repeatedly cultivated these four foundations of mindfulness that I fully know, as they truly are, the basis, the causes, and the results of past, future, and present volitional actions.",
      "sinhala": "ආයුෂ්මත්නි, මම මේ සතර සතිපට්ඨානයන් වඩන ලද නිසාත්, බහුල වශයෙන් පුරුදු කරන ලද නිසාත්, අතීතයෙහිද, අනාගතයෙහිද, වර්තමානයෙහිද කරන ලද කර්මයන්ගේ විපාක, ඒවායේ ප්‍රතිඵල ඇතිවන ස්වභාවය අනුවද, හේතු වන කරුණු අනුවද, ඇති සැටියෙන් අවබෝධ කරගනිමි.",
      "paliTitle": "Kammasamādānasuttaṃ",
      "englishTitle": "The Undertaking of Kamma Sutta",
      "sinhalaTitle": "කම්මසමාදාන සූත්‍රය"
    },
    {
      "number": 915,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā sabbatthagāminippaṭipadaṃ yathābhūtaṃ pajānāmī’’ti. Sattamaṃ.",
      "english": "And as for these four establishments of mindfulness, friends, because I have developed and frequently cultivated them, I understand the universally applicable practice as it truly is.",
      "sinhala": "ඇවැත්නි, තවද මම මේ සතර සතිපට්ඨානයන් භාවනා කළ හෙයින්ද, බහුල වශයෙන් පුරුදු කළ හෙයින්ද, සර්‍වගාමී ප්‍රතිපදාව යථාභූත ලෙස පසක් කරගනිමි.",
      "paliTitle": "Sabbatthagāminisuttaṃ",
      "englishTitle": "The Discourse on the Way Leading Everywhere",
      "sinhalaTitle": "සබ්බත්ථගාමිනී සූත්‍රය"
    },
    {
      "number": 916,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā anekadhātunānādhātulokaṃ yathābhūtaṃ pajānāmī’’ti. Aṭṭhamaṃ.",
      "english": "And furthermore, friends, because I have cultivated and extensively practiced these four establishments of mindfulness, I directly know the world, with its many and varied elements, as it truly is.",
      "sinhala": "ඇවැත්නි, ඇත්තෙන්ම මම මේ සතර සතිපට්ඨාන ධර්මයන් වැඩූ බැවින්ද, බහුල වශයෙන් පුරුදු කළ බැවින්ද, අනේක ධාතූන් හා නානා ධාතූන්ගෙන් යුක්ත වූ ලෝකය ඇති සැටියෙන් අවබෝධ කරමි.",
      "paliTitle": "Nānādhātusuttaṃ",
      "englishTitle": "Diversity of Elements Sutta",
      "sinhalaTitle": "නානාධාතු සූත්‍රය"
    },
    {
      "number": 917,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāmī’’ti. Navamaṃ.",
      "english": "And moreover, friends, because I have developed and frequently practiced these four establishments of mindfulness, I discern the diversity of beings' inclinations as they truly are.",
      "sinhala": "ඇවැත්නි, තවද, මා විසින් මේ සතර සතිපට්ඨාන භාවනාවන් වැඩූ නිසාත්, බහුල වශයෙන් පුරුදු කළ නිසාත්, සත්වයන්ගේ නානා අධිමුක්ති ස්වභාවය යථාභූත වශයෙන් දනිමි.",
      "paliTitle": "Nānādhimuttisuttaṃ",
      "englishTitle": "Diversity of Inclinations Sutta",
      "sinhalaTitle": "නානාධිමුත්ති සූත්‍රය"
    },
    {
      "number": 918,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāmī’’ti. Dasamaṃ.",
      "english": "And indeed, friends, because I have developed and frequently practiced these four establishments of mindfulness, I understand as it truly is the disposition of the spiritual faculties of other beings, of other individuals.",
      "sinhala": "ආයුෂ්මත්නි, මම මේ සතර සතිපට්ඨාන භාවනා කිරීමෙන්ද, බහුල කිරීමෙන්ද, අනෙකුත් සත්වයන්ගේත්, අනෙකුත් පුද්ගලයන්ගේත් ඉන්ද්‍රියයන්ගේ උස්පහත් භාවය ඇති සැටියෙන්ම ප්‍රඥාවෙන් දනිමි.",
      "paliTitle": "Indriyaparopariyattasuttaṃ",
      "englishTitle": "Knowledge of the Faculties of Others Sutta",
      "sinhalaTitle": "ඉන්ද්‍රියපරෝපරියත්ත සූත්‍රය"
    },
    {
      "number": 919,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ pajānāmī’’ti. Ekādasamaṃ.",
      "english": "And, friends, because I have cultivated and made abundant these four foundations of mindfulness, I understand as they truly are the defilement, the purification, and the emergence from the jhānas, liberations, concentrations, and attainments.",
      "sinhala": "ඇවැත්නි, මම මේ සිව් සතිපට්ඨානයන් වැඩූ බැවින්ද, බහුල කළ බැවින්ද, ඣාන, විමොක්ඛ, සමාධි, සමාපත්ති වල කෙලෙසීමද, පිරිසිදු වීමද, ඒවායින් නික්මීමද යථාභූත වශයෙන් දනිමි.\n\nඑකළොස්වැනිය.",
      "paliTitle": "Jhānādisuttaṃ",
      "englishTitle": "Absorption and Other Topics Sutta",
      "sinhalaTitle": "ජ්ඣානාදි සූත්‍රය"
    },
    {
      "number": 920,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā anekavihitaṃ pubbenivāsaṃ anussarāmi, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmī’’ti. Dvādasamaṃ.",
      "english": "And indeed, friends, by developing and repeatedly practicing these four foundations of mindfulness, I recollect my manifold past existences. That is to say, I recollect one birth, two births… and so forth; thus I recollect my manifold past existences with all their modes and specific characteristics.",
      "sinhala": "ආයුෂ්මත්වරුනි, තවද මා විසින් මේ සතර සතිපට්ඨාන ධර්මයන් වැඩූ හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද, අනේක විධි පූර්ව නිවාස සිහි කරමි. ඒ කෙසේද යත්: එක් ජාතියක්ද, ජාති දෙකක්ද... පෙ. මෙලෙසින්, ආකාර සහිතවද, උද්දේශ සහිතවද, අනේක විධි පූර්ව නිවාස මම අනුස්මරණය කරමි.",
      "paliTitle": "Pubbenivāsasuttaṃ",
      "englishTitle": "The Discourse on Recollecting Past Lives",
      "sinhalaTitle": "පුබ්බේනිවාස සූත්‍රය"
    },
    {
      "number": 921,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne…pe… iti dibbena cakkhunā visuddhena atikkantamānusakena yathākammūpage satte pajānāmī’’ti. Terasamaṃ.",
      "english": "And indeed, friends, it is due to my having developed and extensively cultivated these four establishments of mindfulness that with the purified divine eye, transcending human sight, I see beings passing away and reappearing… Thus, with the purified divine eye, transcending human sight, I discern beings according to their karma.",
      "sinhala": "ආයුෂ්මත්නි, තවද මම මේ සතර සතිපට්ඨාන භාවනා කොට, බහුල වශයෙන් පුරුදු කොට තිබෙන නිසා, පිරිසිදු වූ, මිනිසුන්ගේ දෑසට වඩා අතික්‍රාන්ත වූ දිව්‍ය චක්ෂුසින්, සත්වයන් චුතවන්නා වූ ද, නැවත උපදින්නා වූ ද අයුරු දකිමි. මේ අයුරින්, පිරිසිදු වූ, මිනිසුන්ගේ දෑසට වඩා අතික්‍රාන්ත වූ දිව්‍ය චක්ෂුසින්, කර්මානුරූපව ගමන් කරන්නා වූ සත්වයන් මම ප්‍ර‌කට කොට දනිමි.",
      "paliTitle": "Dibbacakkhusuttaṃ",
      "englishTitle": "The Divine Eye Sutta",
      "sinhalaTitle": "දිබ්බචක්ඛු සූත්‍රය"
    },
    {
      "number": 922,
      "pali": "‘‘Imesañca panāhaṃ, āvuso, catunnaṃ satipaṭṭhānānaṃ bhāvitattā bahulīkatattā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭhe dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmī’’ti. Cuddasamaṃ. Dutiyo vaggo. Tassuddānaṃ – Mahābhiññaṃ iddhi dibbaṃ, cetopariyaṃ ṭhānaṃ kammaṃ; Sabbatthadhātudhimutti, indriyaṃ jhānaṃ tisso vijjāti. ",
      "english": "And indeed, friends, it is through my development and extensive cultivation of these four foundations of mindfulness, and through the destruction of the cankers, that I, having directly known and realized for myself in this very life the undefiled liberation of mind and liberation through wisdom, now dwell having attained them.\n\nThe summary of these suttas is: Great direct knowledge, divine power, knowledge of others' minds, ground, kamma; liberation regarding all elements, faculties, jhana, and the three knowledges.",
      "sinhala": "ආයුෂ්මත්නි, මම නම් මේ සිව් සතිපට්ඨාන ධර්මයන් වඩන ලද බැවින්ද, බහුල වශයෙන් පුරුදු කරන ලද බැවින්ද, ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන්, නිරාශ්‍රව චේතෝවිමුක්තිය හා ප‍්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම මා විසින්ම අභිඥාපූර්වකව සාක්ෂාත් කොට, සම්පූර්ණ කරගෙන වාසය කරමි.\n\nදහහතරවෙනි සූත්‍රයයි. දෙවෙනි වර්ගයයි. එහි සාරාංශය මෙසේය: මහාභිඥාව, සෘද්ධිය, දිව්‍ය‍ ශ‍්‍රවණය; චේතෝපරිය ඥානය, ස්ථානය, කර්මය; සර්වාර්ථ ධාතු විමුක්තිය; ඉන්ද්‍රිය, ධ්‍යානය, තිදේව විද්‍යාව.",
      "paliTitle": "Āsavakkhayasuttaṃ",
      "englishTitle": "The Discourse on the Destruction of Taints",
      "sinhalaTitle": "ආසවක්ඛය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Anuruddhasaṃyuttaṃ aṭṭhamaṃ.",
    "english": "The Linked Discourses with Anuruddha, the eighth.",
    "sinhala": "අනුරුද්ධ සංයුක්තය අටවන කොටසයි."
  }
}