{
  "id": "sn.5.7",
  "title": {
    "pali": "Iddhipādasaṃyuttaṃ",
    "english": "The Connected Discourses on the Bases of Spiritual Power",
    "sinhala": "ඉද්ධිපාද සංයුත්තය"
  },
  "sections": [
    {
      "number": 813,
      "pali": "‘‘Cattārome bhikkhave, iddhipādā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, cittasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā apārā pāraṃ gamanāya saṃvattantī’’ti. Paṭhamaṃ.",
      "english": "Monks, these four bases of spiritual power, when developed and frequently practiced, lead to going from this shore to the other shore. Which four? Here, monks, a monk develops the base of spiritual power accompanied by concentration rooted in aspiration, and by the volitional formations of striving; he develops the base of spiritual power accompanied by concentration rooted in energy, and by the volitional formations of striving; he develops the base of spiritual power accompanied by concentration rooted in mind, and by the volitional formations of striving; he develops the base of spiritual power accompanied by concentration rooted in investigation, and by the volitional formations of striving. These four bases of spiritual power, monks, when developed and frequently practiced, lead to going from this shore to the other shore.",
      "sinhala": "භික්ෂූණි, මේ සතර ඍද්ධිපාද ධර්මයන් වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, මේ සංසාරයෙන් එතෙර වී නිර්වාණයට යාම සඳහා හේතු වෙති. කවරේද ඒ සතර ධර්මයෝ?\n\nභික්ෂූණි, මේ ශාසනයෙහිලා භික්ෂුව ඡන්දය, සමාධිය සහ ප්‍රධාන සංස්කාරයෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. වීර්යය, සමාධිය සහ ප්‍රධාන සංස්කාරයෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. සිත, සමාධිය සහ ප්‍රධාන සංස්කාරයෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. විමංසා (ප්‍රඥාව), සමාධිය සහ ප්‍රධාන සංස්කාරයෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි.\n\nභික්ෂූණි, මේ සතර ඍද්ධිපාද ධර්මයෝම වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, මේ සංසාරයෙන් එතෙර වී නිර්වාණයට යාම සඳහා හේතු වෙති.",
      "paliTitle": "Apārasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 814,
      "pali": "‘‘Yesaṃ kesañci, bhikkhave, cattāro iddhipādā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, cattāro iddhipādā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Yesaṃ kesañci, bhikkhave, ime cattāro iddhipādā viraddhā, viraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī. Yesaṃ kesañci, bhikkhave, ime cattāro iddhipādā āraddhā, āraddho tesaṃ ariyo maggo sammā dukkhakkhayagāmī’’ti. Dutiyaṃ.",
      "english": "Whosoever, monks, has neglected the four bases of spiritual power, for them the noble path that leads to the complete ending of suffering is neglected. Whosoever, monks, has undertaken the four bases of spiritual power, for them the noble path that leads to the complete ending of suffering is undertaken.\n\nWhich are these four? Here, monks, a monk develops the base of spiritual power endowed with concentration due to aspiration and volitional formations of striving; develops the base of spiritual power endowed with concentration due to energy and volitional formations of striving; develops the base of spiritual power endowed with concentration due to mind and volitional formations of striving; develops the base of spiritual power endowed with concentration due to investigation and volitional formations of striving.\n\nWhosoever, monks, has neglected these four bases of spiritual power, for them the noble path that leads to the complete ending of suffering is neglected. Whosoever, monks, has undertaken these four bases of spiritual power, for them the noble path that leads to the complete ending of suffering is undertaken.",
      "sinhala": "මහණෙනි, යම් කිසි භික්‍ෂූන් වහන්සේලාට සතර ඉර්ධිපාදයන් නොවැඩූ කල්හි, ඔවුන්ගේ නිවැරදිවම දුක් ක්ෂය කිරීම කරා යන ආර්ය මාර්ගය ද වැරදී යන්නේය. මහණෙනි, යම් කිසි භික්‍ෂූන් වහන්සේලාට සතර ඉර්ධිපාදයන් වැඩූ කල්හි, ඔවුන්ගේ නිවැරදිවම දුක් ක්ෂය කිරීම කරා යන ආර්ය මාර්ගය ද සාර්ථක වන්නේය. ඒ සතර කුමක්ද? මහණෙනි, මෙහිලා භික්‍ෂුව ඡන්ද සමාධියෙන් හා ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. වීර්‍ය සමාධියෙන් හා ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. චිත්ත සමාධියෙන් හා ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. විමංසා (ප්‍රඥා) සමාධියෙන් හා ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. මහණෙනි, යම් කිසි භික්‍ෂූන් වහන්සේලාට මේ සතර ඉර්ධිපාදයන් නොවැඩූ කල්හි, ඔවුන්ගේ නිවැරදිවම දුක් ක්ෂය කිරීම කරා යන ආර්ය මාර්ගය ද වැරදී යන්නේය. මහණෙනි, යම් කිසි භික්‍ෂූන් වහන්සේලාට මේ සතර ඉර්ධිපාදයන් වැඩූ කල්හි, ඔවුන්ගේ නිවැරදිවම දුක් ක්ෂය කිරීම කරා යන ආර්ය මාර්ගය ද සාර්ථක වන්නේය.",
      "paliTitle": "Viraddhasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 815,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāya. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… iddhipādaṃ bhāveti, vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā ariyā niyyānikā niyyanti takkarassa sammā dukkhakkhayāyā’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, these four bases of spiritual power, when cultivated and often practiced, are noble, lead to liberation, and truly lead one who practices them accordingly to the complete ending of suffering. Which four? Here, bhikkhus, a bhikkhu cultivates the base of spiritual power endowed with concentration based on aspiration, together with the volitional formation of striving. He cultivates the base of spiritual power endowed with concentration based on energy, together with the volitional formation of striving. He cultivates the base of spiritual power endowed with concentration based on mind, together with the volitional formation of striving. He cultivates the base of spiritual power endowed with concentration based on investigation, together with the volitional formation of striving. These four bases of spiritual power, bhikkhus, when cultivated and often practiced, are noble, lead to liberation, and truly lead one who practices them accordingly to the complete ending of suffering.",
      "sinhala": "මහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ආර්ය වන මේ ඉර්ධිපාද සතර, නිවනට මඟ පාදන අතර, ඒ අනුව ක්‍රියා කරන්නාට නිවැරදිව දුක්ඛ​ක්‍ෂය වීම පිණිස පමුණුවයි.\n\nඒවා මොනවාද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව, ඡන්දසමාධියෙන් ද, ප්‍රධාන සංස්කාරයෙන් ද සමන්විත වූ ඉර්ධිපාදය වඩයි. වීර්යසමාධියෙන් ද...පෙ... චිත්තසමාධියෙන් ද...පෙ... විමංසාසමාධියෙන් ද, ප්‍රධාන සංස්කාරයෙන් ද සමන්විත වූ ඉර්ධිපාදය වඩයි.\n\nමහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ආර්ය වන මේ ඉර්ධිපාද සතර, නිවනට මඟ පාදන අතර, ඒ අනුව ක්‍රියා කරන්නාට නිවැරදිව දුක්ඛ​ක්‍ෂය වීම පිණිස පමුණුවයි.",
      "paliTitle": "Ariyasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 816,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattantī’’ti. Catutthaṃ.",
      "english": "These four, monks, are the bases of spiritual power which, when developed and repeatedly cultivated, lead to complete disillusionment, to dispassion, to cessation, to calm, to direct knowledge, to full enlightenment, and to Nibbāna. Which four? Here, monks, a monk develops the base of spiritual power endowed with concentration born of zeal, accompanied by volitional exertion; he develops the base of spiritual power endowed with concentration born of energy, accompanied by volitional exertion; he develops the base of spiritual power endowed with concentration born of mind, accompanied by volitional exertion; he develops the base of spiritual power endowed with concentration born of investigation, accompanied by volitional exertion. These four, monks, are the bases of spiritual power which, when developed and repeatedly cultivated, lead to complete disillusionment, to dispassion, to cessation, to calm, to direct knowledge, to full enlightenment, and to Nibbāna.",
      "sinhala": "මහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුවූ මේ ඉර්ධිපාද සතර ඒකාන්තයෙන් කලකිරීම පිණිස ද, නොඇලීම පිණිස ද, නිරෝධය පිණිස ද, සංසිඳීම පිණිස ද, අභිඥාව පිණිස ද, සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද පවතී.\n\nඒ කවර සතරක් ද? මහණෙනි, මෙහිලා භික්ෂුව ඡන්ද සමාධි ප්‍රධාන සංඛාරයෙන් සමන්වාගත වූ ඉර්ධිපාදය වඩයි. වීර්ය සමාධි ප්‍රධාන සංඛාරයෙන් සමන්වාගත වූ ඉර්ධිපාදය වඩයි. චිත්ත සමාධි ප්‍රධාන සංඛාරයෙන් සමන්වාගත වූ ඉර්ධිපාදය වඩයි. විමංසා සමාධි ප්‍රධාන සංඛාරයෙන් සමන්වාගත වූ ඉර්ධිපාදය වඩයි. මහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුවූ මේ ඉර්ධිපාද සතර ඒකාන්තයෙන් කලකිරීම පිණිස ද, නොඇලීම පිණිස ද, නිරෝධය පිණිස ද, සංසිඳීම පිණිස ද, අභිඥාව පිණිස ද, සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද පවතී.",
      "paliTitle": "Nibbidāsuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 817,
      "pali": "‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādesuṃ sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādessanti sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādenti sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādessanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā iddhipadesaṃ abhinipphādenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Pañcamaṃ.",
      "english": "Monks, whoever, in the past, ascetics or brahmins, accomplished a domain of spiritual power, all of them did so by having developed and repeatedly practiced the four bases of spiritual power. Monks, whoever, in the future, ascetics or brahmins, will accomplish a domain of spiritual power, all of them will do so by having developed and repeatedly practiced the four bases of spiritual power. Monks, whoever, at present, ascetics or brahmins, accomplish a domain of spiritual power, all of them do so by having developed and repeatedly practiced the four bases of spiritual power.\n\nWhich are these four? Here, monks, a monk develops the basis for spiritual power that possesses concentration due to desire and the volitional formations of exertion. He develops the basis for spiritual power that possesses concentration due to energy and the volitional formations of exertion. He develops the basis for spiritual power that possesses concentration due to mind and the volitional formations of exertion. He develops the basis for spiritual power that possesses concentration due to investigation and the volitional formations of exertion. Monks, whoever, in the past, ascetics or brahmins, accomplished a domain of spiritual power, all of them did so by having developed and repeatedly practiced these very four bases of spiritual power. Monks, whoever, in the future, ascetics or brahmins, will accomplish a domain of spiritual power, all of them will do so by having developed and repeatedly practiced these very four bases of spiritual power. Monks, whoever, at present, ascetics or brahmins, accomplish a domain of spiritual power, all of them do so by having developed and repeatedly practiced these very four bases of spiritual power.",
      "sinhala": "මහණෙනි, අතීත කාලයෙහි යම් කිසි ශ‍්‍රමණවරුන් හෝ බ‍්‍රාහ්මණයින් ඍද්ධි ප‍්‍රාතිහාර්යයන් පහළ කළේ නම්, ඒ සියල්ලෝම සතර ඍද්ධිපාදයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද එසේ කළෝය. මහණෙනි, අනාගත කාලයෙහි යම් කිසි ශ‍්‍රමණවරුන් හෝ බ‍්‍රාහ්මණයින් ඍද්ධි ප‍්‍රාතිහාර්යයන් පහළ කරන්නේ නම්, ඒ සියල්ලෝම සතර ඍද්ධිපාදයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද එසේ කරනු ඇත. මහණෙනි, වර්තමාන කාලයෙහි යම් කිසි ශ‍්‍රමණවරුන් හෝ බ‍්‍රාහ්මණයින් ඍද්ධි ප‍්‍රාතිහාර්යයන් පහළ කරන්නේ නම්, ඒ සියල්ලෝම සතර ඍද්ධිපාදයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද එසේ කරති.\n\nඒ සතර කවරේද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ඡන්දය හේතුවෙන් හටගත් සමාධියෙන් සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. වීර්යය හේතුවෙන් හටගත් සමාධියෙන් සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. සිත හේතුවෙන් හටගත් සමාධියෙන් සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. විමංසාව හේතුවෙන් හටගත් සමාධියෙන් සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි.\n\nමහණෙනි, අතීත කාලයෙහි යම් කිසි ශ‍්‍රමණවරුන් හෝ බ‍්‍රාහ්මණයින් ඍද්ධි ප‍්‍රාතිහාර්යයන් පහළ කළේ නම්, ඒ සියල්ලෝම මේ සතර ඍද්ධිපාදයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද එසේ කළෝය. මහණෙනි, අනාගත කාලයෙහි යම් කිසි ශ‍්‍රමණවරුන් හෝ බ‍්‍රාහ්මණයින් ඍද්ධි ප‍්‍රාතිහාර්යයන් පහළ කරන්නේ නම්, ඒ සියල්ලෝම මේ සතර ඍද්ධිපාදයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද එසේ කරනු ඇත. මහණෙනි, වර්තමාන කාලයෙහි යම් කිසි ශ‍්‍රමණවරුන් හෝ බ‍්‍රාහ්මණයින් ඍද්ධි ප‍්‍රාතිහාර්යයන් පහළ කරන්නේ නම්, ඒ සියල්ලෝම මේ සතර ඍද්ධිපාදයන් වඩන ලද හෙයින්ද, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්ද එසේ කරති.",
      "paliTitle": "Iddhipadesasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 818,
      "pali": "‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādesuṃ, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādessanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādenti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādessanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā samattaṃ iddhiṃ abhinipphādenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Chaṭṭhaṃ.",
      "english": "Indeed, monks, whatever ascetics or brahmins in the past fully accomplished psychic power, all of them did so by having developed and repeatedly practiced the four bases of power. Indeed, monks, whatever ascetics or brahmins in the future will fully accomplish psychic power, all of them will do so by having developed and repeatedly practiced the four bases of power. Indeed, monks, whatever ascetics or brahmins in the present fully accomplish psychic power, all of them do so by having developed and repeatedly practiced the four bases of power.\n\nWhich four are these? Here, monks, a monk develops the basis for spiritual power that is endowed with concentration due to desire and with the volitional formations of striving; he develops the basis for spiritual power that is endowed with concentration due to energy and with the volitional formations of striving; he develops the basis for spiritual power that is endowed with concentration due to mind and with the volitional formations of striving; he develops the basis for spiritual power that is endowed with concentration due to investigation and with the volitional formations of striving. Indeed, monks, whatever ascetics or brahmins in the past fully accomplished psychic power, all of them did so by having developed and repeatedly practiced these same four bases of power. Indeed, monks, whatever ascetics or brahmins in the future will fully accomplish psychic power, all of them will do so by having developed and repeatedly practiced these same four bases of power. Indeed, monks, whatever ascetics or brahmins in the present fully accomplish psychic power, all of them do so by having developed and repeatedly practiced these same four bases of power.",
      "sinhala": "මහණෙනි, අතීත කාලයෙහි යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සම්පූර්ණ ඍද්ධියක් සාක්ෂාත් කළාහුද, ඒ සියලු දෙනාම සතර ඍද්ධිපාදයන් වඩන ලද්දෙන් හා බහුල වශයෙන් පුහුණු කරන ලද්දෙන් එසේ කළහ. මහණෙනි, අනාගත කාලයෙහි යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සම්පූර්ණ ඍද්ධියක් සාක්ෂාත් කරන්නාහුද, ඒ සියලු දෙනාම සතර ඍද්ධිපාදයන් වඩන ලද්දෙන් හා බහුල වශයෙන් පුහුණු කරන ලද්දෙන් එසේ කරන්නාහ. මහණෙනි, වර්තමාන කාලයෙහි යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සම්පූර්ණ ඍද්ධියක් සාක්ෂාත් කරන්නාහුද, ඒ සියලු දෙනාම සතර ඍද්ධිපාදයන් වඩන ලද්දෙන් හා බහුල වශයෙන් පුහුණු කරන ලද්දෙන් එසේ කරන්නාහ.\n\nකවර නම් වූ සතරක්ද? මහණෙනි, මෙහිලා භික්‍ෂුව ඡන්දසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි, වීර්යයසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි, චිත්තසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි, විමංසාසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි. මහණෙනි, අතීත කාලයෙහි යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සම්පූර්ණ ඍද්ධියක් සාක්ෂාත් කළාහුද, ඒ සියලු දෙනාම මේ කියන ලද සතර ඍද්ධිපාදයන් වඩන ලද්දෙන් හා බහුල වශයෙන් පුහුණු කරන ලද්දෙන් එසේ කළහ. මහණෙනි, අනාගත කාලයෙහි යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සම්පූර්ණ ඍද්ධියක් සාක්ෂාත් කරන්නාහුද, ඒ සියලු දෙනාම මේ කියන ලද සතර ඍද්ධිපාදයන් වඩන ලද්දෙන් හා බහුල වශයෙන් පුහුණු කරන ලද්දෙන් එසේ කරන්නාහ. මහණෙනි, වර්තමාන කාලයෙහි යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ සම්පූර්ණ ඍද්ධියක් සාක්ෂාත් කරන්නාහුද, ඒ සියලු දෙනාම මේ කියන ලද සතර ඍද්ධිපාදයන් වඩන ලද්දෙන් හා බහුල වශයෙන් පුහුණු කරන ලද්දෙන් එසේ කරන්නාහ.",
      "paliTitle": "Samattasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 819,
      "pali": "‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihariṃsu, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihariṃsu sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi bhikkhū āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Sattamaṃ.",
      "english": "Indeed, whatever monks, O bhikkhus, in the past, through the destruction of the taints, attained and abided in the taintless liberation of mind and liberation through wisdom by directly knowing and realizing it for themselves in this very life, all of them did so by cultivating and repeatedly practicing the four bases of spiritual power. Whatever monks, O bhikkhus, in the future, through the destruction of the taints, will attain and abide in the taintless liberation of mind and liberation through wisdom by directly knowing and realizing it for themselves in this very life, all of them will do so by cultivating and repeatedly practicing the four bases of spiritual power. Whatever monks, O bhikkhus, at present, through the destruction of the taints, attain and abide in the taintless liberation of mind and liberation through wisdom by directly knowing and realizing it for themselves in this very life, all of them do so by cultivating and repeatedly practicing the four bases of spiritual power.\n\nWhich four are these? Here, O bhikkhus, a monk cultivates the basis of spiritual power endowed with concentration due to zeal, accompanied by the volitional formations of exertion; he cultivates the basis of spiritual power endowed with concentration due to energy, accompanied by the volitional formations of exertion; he cultivates the basis of spiritual power endowed with concentration due to mind, accompanied by the volitional formations of exertion; he cultivates the basis of spiritual power endowed with concentration due to investigation, accompanied by the volitional formations of exertion.\n\nIndeed, whatever monks, O bhikkhus, in the past, through the destruction of the taints, attained and abided in the taintless liberation of mind and liberation through wisdom by directly knowing and realizing it for themselves in this very life, all of them did so by cultivating and repeatedly practicing these very four bases of spiritual power. Whatever monks, O bhikkhus, in the future, through the destruction of the taints, will attain and abide in the taintless liberation of mind and liberation through wisdom by directly knowing and realizing it for themselves in this very life, all of them will do so by cultivating and repeatedly practicing these very four bases of spiritual power. Whatever monks, O bhikkhus, at present, through the destruction of the taints, attain and abide in the taintless liberation of mind and liberation through wisdom by directly knowing and realizing it for themselves in this very life, all of them do so by cultivating and repeatedly practicing these very four bases of spiritual power.",
      "sinhala": "“මහණෙනි, අතීත කාලයෙහි යම්කිසි භික්ෂූහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිතවූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කළාහුද, ඒ සියලු දෙනාම සිව් ඉර්ධිපාදයන් වඩනලද, බහුල වශයෙන් පුරුදු කරනලද බැවිනි. මහණෙනි, අනාගත කාලයෙහි යම්කිසි භික්ෂූහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිතවූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරන්නාහුද, ඒ සියලු දෙනාම සිව් ඉර්ධිපාදයන් වඩනලද, බහුල වශයෙන් පුරුදු කරනලද බැවිනි. මහණෙනි, වර්තමාන කාලයෙහි යම්කිසි භික්ෂූහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිතවූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරන්නාහුද, ඒ සියලු දෙනාම සිව් ඉර්ධිපාදයන් වඩනලද, බහුල වශයෙන් පුරුදු කරනලද බැවිනි.\n\nමේ සිව් ඉර්ධිපාදයෝ කවරහුද? මහණෙනි, මෙහිලා භික්ෂුව ඡන්ද සමාධි ප්‍රධාන සංස්කාරයෙන් යුක්තවූ ඉර්ධිපාදය වඩයි, වීර්ය සමාධි ප්‍රධාන සංස්කාරයෙන් යුක්තවූ ඉර්ධිපාදය වඩයි, චිත්ත සමාධි ප්‍රධාන සංස්කාරයෙන් යුක්තවූ ඉර්ධිපාදය වඩයි, විමංසා සමාධි ප්‍රධාන සංස්කාරයෙන් යුක්තවූ ඉර්ධිපාදය වඩයි.\n\nමහණෙනි, අතීත කාලයෙහි යම්කිසි භික්ෂූහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිතවූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කළාහුද, ඒ සියලු දෙනාම මේ සිව් ඉර්ධිපාදයන්ම වඩනලද, බහුල වශයෙන් පුරුදු කරනලද බැවිනි. මහණෙනි, අනාගත කාලයෙහි යම්කිසි භික්ෂූහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිතවූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරන්නාහුද, ඒ සියලු දෙනාම මේ සිව් ඉර්ධිපාදයන්ම වඩනලද, බහුල වශයෙන් පුරුදු කරනලද බැවිනි. මහණෙනි, වර්තමාන කාලයෙහි යම්කිසි භික්ෂූහු ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිතවූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරන්නාහුද, ඒ සියලු දෙනාම මේ සිව් ඉර්ධිපාදයන්ම වඩනලද, බහුල වශයෙන් පුරුදු කරනලද බැවිනි.",
      "paliTitle": "Bhikkhusuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 820,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato ‘arahaṃ sammāsambuddho’ti vuccatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these four bases of spiritual power. What are these four? Here, monks, a monk cultivates the base of spiritual power endowed with concentration born of zeal, together with the volitional formations of striving. He cultivates the base of spiritual power endowed with concentration born of energy, together with the volitional formations of striving. He cultivates the base of spiritual power endowed with concentration born of mind, together with the volitional formations of striving. He cultivates the base of spiritual power endowed with concentration born of investigation, together with the volitional formations of striving. These, monks, are the four bases of spiritual power.\n\nIt is by the cultivation and repeated practice of these four bases of spiritual power that the Tathāgata is called an Arahant, a Perfectly Self-Awakened One.",
      "sinhala": "මහණෙනි, මේ ඉර්ධිපාද සතරකි. ඒ සතර කවරේද?\nමහණෙනි, මෙහිලා භික්ෂුව ඡන්දසමාධිප්‍රධානසංස්කාරසමන්නාගත ඉර්ධිපාදය වඩයි. වීර්යසමාධිප්‍රධානසංස්කාරසමන්නාගත ඉර්ධිපාදය වඩයි. චිත්තසමාධිප්‍රධානසංස්කාරසමන්නාගත ඉර්ධිපාදය වඩයි. විමංසාසමාධිප්‍රධානසංස්කාරසමන්නාගත ඉර්ධිපාදය වඩයි.\nමහණෙනි, මේ ඉර්ධිපාද සතරයි. මහණෙනි, මේ ඉර්ධිපාද සතර වැඩූ බැවින්, බහුල කළ බැවින් තථාගතයන් වහන්සේ ‘අරහං සම්මාසම්බුද්ධෝ’ යැයි කියනු ලැබේ.",
      "paliTitle": "Buddhasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 821,
      "pali": "‘‘‘Ayaṃ chandasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ chandasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘‘‘Ayaṃ vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘‘‘Ayaṃ cittasamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ cittasamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘‘‘Ayaṃ vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādi. ‘So kho panāyaṃ vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo bhāvetabbo’ti me, bhikkhave…pe… ‘bhāvito’ti me, bhikkhave, pubbe ananussutesu dhammesu cakkhuṃ udapādi, ñāṇaṃ udapādi, paññā udapādi, vijjā udapādi, āloko udapādī’’ti. Navamaṃ.",
      "english": "‘This is the base of spiritual power comprising concentration due to aspiration, and endowed with formations of exertion.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to aspiration, and endowed with formations of exertion, is to be developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to aspiration, and endowed with formations of exertion, has been developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This is the base of spiritual power comprising concentration due to energy, and endowed with formations of exertion.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to energy, and endowed with formations of exertion, is to be developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to energy, and endowed with formations of exertion, has been developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This is the base of spiritual power comprising concentration due to mind, and endowed with formations of exertion.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to mind, and endowed with formations of exertion, is to be developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to mind, and endowed with formations of exertion, has been developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This is the base of spiritual power comprising concentration due to investigation, and endowed with formations of exertion.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to investigation, and endowed with formations of exertion, is to be developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose. ‘This base of spiritual power comprising concentration due to investigation, and endowed with formations of exertion, has been developed.’ Thus, Monks, in regard to doctrines unheard before, vision arose in me, knowledge arose, wisdom arose, true knowledge arose, light arose.",
      "sinhala": "මහණෙනි, ‘මෙය ඡන්දය මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය යි’ යනු මට පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය ඡන්දය මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය භාවනා කළ යුතු යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය (එසේ) භාවනා කරන ලදැ යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය.\n\nමහණෙනි, ‘මෙය වීර්‍ය්‍යය මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය යි’ යනු මට පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය වීර්‍ය්‍යය මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය භාවනා කළ යුතු යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය (එසේ) භාවනා කරන ලදැ යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය.\n\nමහණෙනි, ‘මෙය සිත මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය යි’ යනු මට පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය සිත මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය භාවනා කළ යුතු යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය (එසේ) භාවනා කරන ලදැ යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය.\n\nමහණෙනි, ‘මෙය විමංසාව මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය යි’ යනු මට පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය විමංසාව මුල්කොට ඇති සමාධියෙන් හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ සෘද්ධිපාදය භාවනා කළ යුතු යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය. ‘මෙය (එසේ) භාවනා කරන ලදැ යි’ යනු මට මහණෙනි, පෙර අසා නොතිබූ ධර්මයන් පිළිබඳව ඇස පහළ විය, ඤාණය පහළ විය, ප්‍රඥාව පහළ විය, විද්‍යාව පහළ විය, ආලෝකය පහළ විය.",
      "paliTitle": "Ñāṇasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 822,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘gaṇhāhi, ānanda, nisīdanaṃ. Yena cāpālaṃ cetiyaṃ [pāvālacetiyaṃ (syā. kaṃ.)] tenupasaṅkamissāma divāvihārāyā’’ti. ‘‘Evaṃ bhante’’ti kho āyasmā ānando bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi. Atha kho bhagavā yena cāpālaṃ cetiyaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Āyasmāpi kho ānando bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘Ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtaṃ cetiyaṃ [bahuputtakacetiyaṃ (syā. kaṃ. pī. ka.)], ramaṇīyaṃ sārandadaṃ cetiyaṃ [ānandacetiyaṃ (ka.), sānandaraṃ (ka.)], ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ [sugato kappāvasesaṃ (pī. ka.) dī. ni. 2.167] bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti yathā taṃ mārena pariyuṭṭhitacitto. Dutiyampi kho bhagavā…pe… tatiyampi kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtaṃ cetiyaṃ, ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti yathā taṃ mārena pariyuṭṭhitacitto. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gaccha kho tvaṃ, ānanda, yassa dāni kālaṃ maññasī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā avidūre aññatarasmiṃ rukkhamūle nisīdi. Atha kho māro pāpimā, acirapakkante āyasmante ānande, yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘parinibbātu dāni, bhante, bhagavā, parinibbātu dāni sugato [parinibbātu sugato (sī. syā. kaṃ.) evamuparipi]! Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti [uttāniṃ karissanti (ka.), uttānikarissanti (pī.)], uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti. Santi kho pana, bhante, etarahi bhikkhū bhagavato sāvakā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato. ‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhuniyo na sāvikā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti. ‘‘Santi kho pana, bhante, etarahi bhikkhuniyo bhagavato sāvikā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato. ‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me upāsakā…pe… yāva me upāsikā na sāvikā bhavissanti viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’’’ti. ‘‘Santi kho pana, bhante, etarahi upāsakā…pe… upāsikā bhagavato sāvikā viyattā vinītā visāradā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni, sugato! Parinibbānakālo dāni, bhante, bhagavato. ‘‘Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me idaṃ brahmacariyaṃ na iddhañceva bhavissati phītañca vitthāritaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsita’nti. Tayidaṃ, bhante, bhagavato brahmacariyaṃ iddhañceva phītañca vitthāritaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ. Parinibbātu dāni, bhante, bhagavā, parinibbātu dāni sugato. Parinibbānakālo dāni, bhante, bhagavato’’ti. Evaṃ vutte bhagavā māraṃ pāpimantaṃ etadavoca – ‘‘appossukko tvaṃ, pāpima, hohi. Na ciraṃ [nacirasseva (ka.)] tathāgatassa parinibbānaṃ bhavissati. Ito tiṇṇaṃ māsānaṃ accayena tathāgato parinibbāyissatī’’ti. Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṃ ossaji. Ossaṭṭhe ca [osajje pana (ka.)] bhagavatā āyusaṅkhāre mahābhūmicālo ahosi bhiṃsanako lomahaṃso, devadundubhiyo [devadudrabhiyo (ka.)] ca phaliṃsu. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi – ‘‘Tulamatulañca sambhavaṃ, bhavasaṅkhāramavassaji muni; Ajjhattarato samāhito, abhindi kavacamivattasambhava’’nti. dasamaṃ; Cāpālavaggo paṭhamo. Tassuddānaṃ – Apārāpi viraddho ca, ariyā nibbidāpi ca; Padesaṃ samattaṃ bhikkhu, buddhaṃ ñāṇañca cetiyanti.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Vesālī, in the Great Forest, at the Gabled Hall.\n\nThen, in the forenoon, the Blessed One dressed, took his bowl and robes, and entered Vesālī for alms. After wandering for alms in Vesālī and returning from his alms-round after the meal, he addressed the Venerable Ānanda: ‘Take up the sitting mat, Ānanda. Let us go to the Cāpāla Shrine for our day’s abiding.’ ‘Yes, venerable sir,’ replied the Venerable Ānanda to the Blessed One, and taking up the sitting mat, he followed closely behind the Blessed One. Then the Blessed One approached the Cāpāla Shrine; having approached, he sat down on the prepared seat. The Venerable Ānanda also paid homage to the Blessed One and sat down to one side. As the Venerable Ānanda was sitting to one side, the Blessed One said to him: ‘Delightful, Ānanda, is Vesālī. Delightful is the Udena Shrine, delightful is the Gotamaka Shrine, delightful is the Sattamba Shrine, delightful is the Bahuputta Shrine, delightful is the Sārandada Shrine, delightful is the Cāpāla Shrine. Whoever, Ānanda, has developed, cultivated, made a vehicle of, made a basis of, practiced, accumulated, and properly undertaken the four bases of spiritual power, if he wishes, he might remain for a full eon or for the remainder of an eon. The Tathāgata, Ānanda, has developed, cultivated, made a vehicle of, made a basis of, practiced, accumulated, and properly undertaken the four bases of spiritual power. If the Tathāgata wishes, Ānanda, he might remain for a full eon or for the remainder of an eon.’ Even though such a broad hint was given by the Blessed One, such a clear sign revealed, the Venerable Ānanda was unable to comprehend it; he did not entreat the Blessed One, saying: ‘May the Blessed One remain, venerable sir, for an eon! May the Fortunate One remain for an eon, for the welfare of the many, for the happiness of the many, out of compassion for the world, for the good, the benefit, and the happiness of devas and humans!’ For his mind was possessed by Māra. A second time the Blessed One addressed the Venerable Ānanda... A third time the Blessed One addressed the Venerable Ānanda: ‘Delightful, Ānanda, is Vesālī. Delightful is the Udena Shrine, delightful is the Gotamaka Shrine, delightful is the Sattamba Shrine, delightful is the Bahuputta Shrine, delightful is the Sārandada Shrine, delightful is the Cāpāla Shrine. Whoever, Ānanda, has developed, cultivated, made a vehicle of, made a basis of, practiced, accumulated, and properly undertaken the four bases of spiritual power, if he wishes, he might remain for a full eon or for the remainder of an eon. The Tathāgata, Ānanda, has developed, cultivated, made a vehicle of, made a basis of, practiced, accumulated, and properly undertaken the four bases of spiritual power. If the Tathāgata wishes, Ānanda, he might remain for a full eon or for the remainder of an eon.’ Even though such a broad hint was given by the Blessed One, such a clear sign revealed, the Venerable Ānanda was unable to comprehend it; he did not entreat the Blessed One, saying: ‘May the Blessed One remain, venerable sir, for an eon! May the Fortunate One remain for an eon, for the welfare of the many, for the happiness of the many, out of compassion for the world, for the good, the benefit, and the happiness of devas and humans!’ For his mind was possessed by Māra. Then the Blessed One addressed the Venerable Ānanda: ‘Go now, Ānanda, do what you think is timely.’ ‘Yes, venerable sir,’ replied the Venerable Ānanda to the Blessed One. Rising from his seat, paying homage to the Blessed One, and circumambulating him clockwise, he then sat down not far away at the root of a certain tree.\n\nThen Māra, the Evil One, not long after the Venerable Ānanda had departed, approached the Blessed One. Having approached, he said to the Blessed One: ‘May the Blessed One now attain final Nibbāna, venerable sir! May the Fortunate One now attain final Nibbāna! The time for the Blessed One’s final Nibbāna has arrived, venerable sir. For this word, venerable sir, was spoken by the Blessed One: “I will not attain final Nibbāna, Evil One, until my bhikkhus are disciples who are accomplished, trained, confident, learned, preservers of the Dhamma, practicing in accordance with the Dhamma, practicing correctly, living in conformity with the Dhamma; until they have learned their own teacher’s doctrine and can teach it, expound it, proclaim it, establish it, reveal it, explain it in detail, and make it plain; until they can, by means of the Dhamma, properly refute any opposing views that may arise and teach the Dhamma with a miracle.”’\n\nIndeed, venerable sir, there are now disciples of the Blessed One who are monks: accomplished, disciplined, confident, learned, upholders of the Dhamma, practicing in accordance with the Dhamma, practicing appropriately, living in conformity with the Dhamma. Having grasped their own teacher's tradition, they proclaim, teach, establish, set forth, explain, analyze, and make clear; having thoroughly refuted any arisen opposing doctrines with the Dhamma, they teach the Dhamma with its inherent effectiveness. Now, venerable sir, may the Blessed One attain final Nibbāna; may the Accomplished One attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna, venerable sir.\n\nVenerable sir, this statement was indeed made by the Blessed One: ‘Evil One, I will not attain final Nibbāna until my bhikkhunīs become disciples who are accomplished, disciplined, confident, learned, upholders of the Dhamma, practicing in accordance with the Dhamma, practicing appropriately, living in conformity with the Dhamma; until, having grasped their own teacher's tradition, they proclaim, teach, establish, set forth, explain, analyze, and make clear; until, having thoroughly refuted any arisen opposing doctrines with the Dhamma, they teach the Dhamma with its inherent effectiveness.’\n\nIndeed, venerable sir, there are now disciples of the Blessed One who are bhikkhunīs: accomplished, disciplined, confident, learned, upholders of the Dhamma, practicing in accordance with the Dhamma, practicing appropriately, living in conformity with the Dhamma. Having grasped their own teacher's tradition, they proclaim, teach, establish, set forth, explain, analyze, and make clear; having thoroughly refuted any arisen opposing doctrines with the Dhamma, they teach the Dhamma with its inherent effectiveness. Now, venerable sir, may the Blessed One attain final Nibbāna; may the Accomplished One attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna, venerable sir.\n\nVenerable sir, this statement was indeed made by the Blessed One: ‘Evil One, I will not attain final Nibbāna until my laymen disciples become disciples, and until my laywomen disciples become disciples who are accomplished, disciplined, confident, learned, upholders of the Dhamma, practicing in accordance with the Dhamma, practicing appropriately, living in conformity with the Dhamma; until, having grasped their own teacher's tradition, they proclaim, teach, establish, set forth, explain, analyze, and make clear; until, having thoroughly refuted any arisen opposing doctrines with the Dhamma, they teach the Dhamma with its inherent effectiveness.’\n\nIndeed, venerable sir, there are now laymen and laywomen disciples of the Blessed One who are accomplished, disciplined, confident, learned, upholders of the Dhamma, practicing in accordance with the Dhamma, practicing appropriately, living in conformity with the Dhamma. Having grasped their own teacher's tradition, they proclaim, teach, establish, set forth, explain, analyze, and make clear; having thoroughly refuted any arisen opposing doctrines with the Dhamma, they teach the Dhamma with its inherent effectiveness. Now, venerable sir, may the Blessed One attain final Nibbāna; may the Accomplished One attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna, venerable sir.\n\nVenerable sir, this statement was indeed made by the Blessed One: ‘Evil One, I will not attain final Nibbāna until this holy life of mine is prosperous, flourishing, widespread, widely known, and thoroughly proclaimed among gods and humans.’\n\nNow, venerable sir, this holy life of the Blessed One is indeed prosperous, flourishing, widespread, widely known, and thoroughly proclaimed among gods and humans. Now, venerable sir, may the Blessed One attain final Nibbāna; may the Accomplished One attain final Nibbāna! Now is the time for the Blessed One's final Nibbāna, venerable sir.\n\nWhen this was said, the Blessed One addressed Māra, the Evil One, saying: ‘Be at ease, Evil One. The Tathāgata's final Nibbāna will not be long in coming. In three months from now, the Tathāgata will attain final Nibbāna.’\n\nThen, at the Cāpāla Shrine, the Blessed One, mindful and clearly comprehending, renounced the life-formation. And when the Blessed One had renounced the life-formation, a great and terrifying earthquake occurred, causing one's hair to stand on end, and the divine drums burst forth.\n\nThen the Blessed One, understanding this matter, uttered on that occasion this inspired utterance:\n‘The Sage has renounced the birth-potential, both the balanced and the immeasurable, and the formations of existence;\nDelighting inwardly, collected, he has broken through what is born of self, like a coat of mail.’",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ විශාලා මහනුවර මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩසිටින සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරු කාලයෙහි සිවුරු පොරවාගෙන, පාත්‍ර සිවුරු රැගෙන විශාලා නුවරට පිඬු සිඟා වඩින සේක. විශාලා නුවර පිඬු සිඟා වැඩ, දහවල් අහර ගැනීමෙන් පසුව, පිණ්ඩපාතයෙන් ආපසු වැඩමවා ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: “ආනන්දය, අසුන රැගෙන එන්න. චාපාල චෛත්‍යය වෙත දිවා විහරණය සඳහා යමු.” “එසේය, භාග්‍යවතුන් වහන්සැ”යි කියා ආයුෂ්මත් ආනන්ද හිමියෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, අසුන රැගෙන භාග්‍යවතුන් වහන්සේ පසුපසින් ගමන් කළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ චාපාල චෛත්‍යය වෙත වැඩම කළ සේක; එහි වැඩමවා පනවන ලද අසුනෙහි වැඩසිටි සේක. ආයුෂ්මත් ආනන්ද හිමියෝ ද භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙකින් වාඩි වූ සේක.\n\nඑක් පසෙකින් වැඩසිටි ආයුෂ්මත් ආනන්ද හිමියන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්දය, විශාලා නුවර රමණීය යි. උදේන චෛත්‍යය රමණීය යි. ගෝතමක චෛත්‍යය රමණීය යි. සත්තම්බක චෛත්‍යය රමණීය යි. බහුපුත්‍ර චෛත්‍යය රමණීය යි. සාරන්දද චෛත්‍යය රමණීය යි. චාපාල චෛත්‍යය රමණීය යි. ආනන්දය, යම් කිසිවෙකු විසින් සතර ඉර්ධිපාද වඩන ලද ද, බහුල වශයෙන් පුරුදු කරන ලද ද, යානයක් ලෙස කරන ලද ද, පදනමක් ලෙස කරන ලද ද, මනා කොට පිහිටුවන ලද ද, මනා කොට හුරු පුරුදු කරන ලද ද, මනා කොට ආරම්භ කරන ලද ද වේ නම්, හෙතෙම කැමති නම් කල්පයක් හෝ කල්පයක ඉතිරි කාලයක් හෝ ජීවත් විය හැකි ය. ආනන්දය, තථාගතයන් වහන්සේ විසින් ද සතර ඉර්ධිපාද වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද, යානයක් ලෙස කරන ලද, පදනමක් ලෙස කරන ලද, මනා කොට පිහිටුවන ලද, මනා කොට හුරු පුරුදු කරන ලද, මනා කොට ආරම්භ කරන ලද සේක. ආනන්දය, තථාගතයන් වහන්සේ කැමති නම් කල්පයක් හෝ කල්පයක ඉතිරි කාලයක් හෝ ජීවත් විය හැකි සේකැ”යි වදාළ සේක. මෙසේ භාග්‍යවතුන් වහන්සේ විසින් පැහැදිලි නිමිති දක්වන කල්හි, පැහැදිලි ආලෝකයක් ප්‍රකට කරන කල්හි ද, මාරයා විසින් සිත වසාගෙන සිටි බැවින් ආයුෂ්මත් ආනන්ද හිමියෝ එය වටහා ගැනීමට නොහැකි වූ සේක; භාග්‍යවතුන් වහන්සේගෙන් “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා, සුගතයන් වහන්සේ බොහෝ ජනයාගේ හිත පිණිස, බොහෝ ජනයාගේ සැපය පිණිස, ලෝකයා කෙරෙහි අනුකම්පාව පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැපය පිණිස කල්පයක් වැඩසිටින සේක්වා”යි ඉල්ලා සිටියේ ද නැත.\n\nදෙවෙනි වරට ද, තෙවෙනි වරට ද භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන්ට, “ආනන්දය, විශාලා නුවර රමණීය යි. උදේන චෛත්‍යය රමණීය යි. ගෝතමක චෛත්‍යය රමණීය යි. සත්තම්බක චෛත්‍යය රමණීය යි. බහුපුත්‍ර චෛත්‍යය රමණීය යි. සාරන්දද චෛත්‍යය රමණීය යි. චාපාල චෛත්‍යය රමණීය යි. ආනන්දය, යම් කිසිවෙකු විසින් සතර ඉර්ධිපාද වඩන ලද ද, බහුල වශයෙන් පුරුදු කරන ලද ද, යානයක් ලෙස කරන ලද ද, පදනමක් ලෙස කරන ලද ද, මනා කොට පිහිටුවන ලද ද, මනා කොට හුරු පුරුදු කරන ලද ද, මනා කොට ආරම්භ කරන ලද ද වේ නම්, හෙතෙම කැමති නම් කල්පයක් හෝ කල්පයක ඉතිරි කාලයක් හෝ ජීවත් විය හැකි ය. ආනන්දය, තථාගතයන් වහන්සේ විසින් ද සතර ඉර්ධිපාද වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද, යානයක් ලෙස කරන ලද, පදනමක් ලෙස කරන ලද, මනා කොට පිහිටුවන ලද, මනා කොට හුරු පුරුදු කරන ලද, මනා කොට ආරම්භ කරන ලද සේක. ආනන්දය, තථාගතයන් වහන්සේ කැමති නම් කල්පයක් හෝ කල්පයක ඉතිරි කාලයක් හෝ ජීවත් විය හැකි සේකැ”යි නැවතත් එසේ ම වදාළ සේක. එසේ වුව ද, මාරයා විසින් සිත වසාගෙන සිටි බැවින්, භාග්‍යවතුන් වහන්සේ විසින් පැහැදිලි නිමිති දක්වන කල්හි, පැහැදිලි ආලෝකයක් ප්‍රකට කරන කල්හි, ආයුෂ්මත් ආනන්ද හිමියෝ එය වටහා ගැනීමට නොහැකි වූ සේක; භාග්‍යවතුන් වහන්සේගෙන් “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කල්පයක් වැඩසිටින සේක්වා, සුගතයන් වහන්සේ බොහෝ ජනයාගේ හිත පිණිස, බොහෝ ජනයාගේ සැපය පිණිස, ලෝකයා කෙරෙහි අනුකම්පාව පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැපය පිණිස කල්පයක් වැඩසිටින සේක්වා”යි ඉල්ලා සිටියේ ද නැත.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: “ආනන්දය, දැන් ඔබ යම් වේලාවක් සුදුසු යැයි සිතන්නේ නම්, යන්න.” “එසේය, භාග්‍යවතුන් වහන්සැ”යි කියා ආයුෂ්මත් ආනන්ද හිමියෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, ප්‍රදක්ෂිණා කොට, නුදුරුව වූ යම් ගසක් මුලක වාඩි වූ සේක. ඉක්බිති පව්කම් ඇත්තා වූ මාරයා, ආයුෂ්මත් ආනන්ද හිමියන් පිටත්ව ගිය නොබෝ වේලාවකින් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේ ය; පැමිණ භාග්‍යවතුන් වහන්සේට මෙය පැවසී ය: “ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පාන සේක්වා! දැන් සුගතයන් වහන්සේ පිරිනිවන් පාන සේක්වා! ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේට පිරිනිවන් පෑමට කාලය යි. ස්වාමීනි, ‘පව්කම් ඇත්ත, මාගේ භික්ෂූ ශ්‍රාවකයෝ යම්තාක් කල් ව්‍යක්තව, විනීතව, විශාරදව, බහුශ්‍රැතව, ධර්මය දරන්නෝව, ධර්මයට අනුලෝමව පිළිපදින්නෝව, සුදුසු පරිදි පිළිපදින්නෝව, අනුධර්මයෙහි හැසිරෙන්නෝව, තමන්ගේ ආචාර්ය සම්ප්‍රදාය මැනවින් ඉගෙන ගෙන, අන්‍යයන්ට කියා දෙන්නෝව, දේශනා කරන්නෝව, පනවන්නෝව, පිහිටුවන්නෝව, විවෘත කරන්නෝව, විභාග කරන්නෝව, පැහැදිලි කරන්නෝව, ඇති වූ අන්‍ය වාදයක් ධර්මානුකූලව මැනවින් මැඩපවත්වා, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරන්නෝ නොවන තාක් කල්, මම පිරිනිවන් නොපාමි’ යන වචනය භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ ය.”\n\nභාග්‍යවතුන් වහන්ස, මේ වන විට භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක භික්ෂූන් වහන්සේලා දක්ෂ, විනය පුහුණු කළ, විශාරද, බොහෝ ඇසූ පිරූ තැන් ඇති, ධර්මය දරන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටි, නිවැරදි ප්‍රතිපදාවේ පිහිටි, ධර්මානුකූලව හැසිරෙන තත්වයට පත් වී සිටිති. ඔවුහු තමන්ගේ ආචාර්ය සම්ප්‍රදාය මැනවින් ගෙන, එය ප්‍රකාශ කරති, දේශනා කරති, ප්‍රඥප්ත කරති, පිහිටුවති, විවෘත කරති, විභාග කරති, පැහැදිලි කරති. පැන නගින අන්‍ය මතවාද ධර්මානුකූලව මැනවින් මැඩපවත්වා, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරති. භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! සුගතයන් වහන්ස, දැන් පිරිනිවන් පා වදාළ මැනව! භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේගේ පිරිනිවන් පෑමට කාලයයි.\n\nභාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මෙම වචනය වදාරන ලදී: ‘පව්කාර මාරය, මාගේ භික්ෂුණී ශ්‍රාවිකාවන් දක්ෂ, විනය පුහුණු කළ, විශාරද, බොහෝ ඇසූ පිරූ තැන් ඇති, ධර්මය දරන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටි, නිවැරදි ප්‍රතිපදාවේ පිහිටි, ධර්මානුකූලව හැසිරෙන තත්වයට පත් වී, තමන්ගේ ආචාර්ය සම්ප්‍රදාය මැනවින් ගෙන, එය ප්‍රකාශ කරනු, දේශනා කරනු, ප්‍රඥප්ත කරනු, පිහිටුවනු, විවෘත කරනු, විභාග කරනු, පැහැදිලි කරනු, පැන නගින අන්‍ය මතවාද ධර්මානුකූලව මැනවින් මැඩපවත්වා, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරනු ලබන තුරු මම පිරිනිවන් නොපාමි’ යනුවෙනි.\n\nභාග්‍යවතුන් වහන්ස, මේ වන විට භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක භික්ෂුණීන් වහන්සේලා ද දක්ෂ, විනය පුහුණු කළ, විශාරද, බොහෝ ඇසූ පිරූ තැන් ඇති, ධර්මය දරන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටි, නිවැරදි ප්‍රතිපදාවේ පිහිටි, ධර්මානුකූලව හැසිරෙන තත්වයට පත් වී සිටිති. ඔවුහු තමන්ගේ ආචාර්ය සම්ප්‍රදාය මැනවින් ගෙන, එය ප්‍රකාශ කරති, දේශනා කරති, ප්‍රඥප්ත කරති, පිහිටුවති, විවෘත කරති, විභාග කරති, පැහැදිලි කරති. පැන නගින අන්‍ය මතවාද ධර්මානුකූලව මැනවින් මැඩපවත්වා, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරති. භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! සුගතයන් වහන්ස, දැන් පිරිනිවන් පා වදාළ මැනව! භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේගේ පිරිනිවන් පෑමට කාලයයි.\n\nභාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මෙම වචනය වදාරන ලදී: ‘පව්කාර මාරය, මාගේ උපාසක ශ්‍රාවකයින් දක්ෂ, විනය පුහුණු කළ, විශාරද, බොහෝ ඇසූ පිරූ තැන් ඇති, ධර්මය දරන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටි, නිවැරදි ප්‍රතිපදාවේ පිහිටි, ධර්මානුකූලව හැසිරෙන තත්වයට පත් වී, තමන්ගේ ආචාර්ය සම්ප්‍රදාය මැනවින් ගෙන, එය ප්‍රකාශ කරනු, දේශනා කරනු, ප්‍රඥප්ත කරනු, පිහිටුවනු, විවෘත කරනු, විභාග කරනු, පැහැදිලි කරනු, පැන නගින අන්‍ය මතවාද ධර්මානුකූලව මැනවින් මැඩපවත්වා, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරනු ලබන තුරු මම පිරිනිවන් නොපාමි. එමෙන්ම, මාගේ උපාසිකා ශ්‍රාවිකාවන් ද දක්ෂ, විනය පුහුණු කළ, විශාරද, බොහෝ ඇසූ පිරූ තැන් ඇති, ධර්මය දරන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටි, නිවැරදි ප්‍රතිපදාවේ පිහිටි, ධර්මානුකූලව හැසිරෙන තත්වයට පත් වී, තමන්ගේ ආචාර්ය සම්ප්‍රදාය මැනවින් ගෙන, එය ප්‍රකාශ කරනු, දේශනා කරනු, ප්‍රඥප්ත කරනු, පිහිටුවනු, විවෘත කරනු, විභාග කරනු, පැහැදිලි කරනු, පැන නගින අන්‍ය මතවාද ධර්මානුකූලව මැනවින් මැඩපවත්වා, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරනු ලබන තුරු මම පිරිනිවන් නොපාමි’ යනුවෙනි.\n\nභාග්‍යවතුන් වහන්ස, මේ වන විට භාග්‍යවතුන් වහන්සේගේ උපාසක ශ්‍රාවකයින් දක්ෂ, විනය පුහුණු කළ, විශාරද, බොහෝ ඇසූ පිරූ තැන් ඇති, ධර්මය දරන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටි, නිවැරදි ප්‍රතිපදාවේ පිහිටි, ධර්මානුකූලව හැසිරෙන තත්වයට පත් වී සිටිති. එමෙන්ම, භාග්‍යවතුන් වහන්සේගේ උපාසිකා ශ්‍රාවිකාවන් ද දක්ෂ, විනය පුහුණු කළ, විශාරද, බොහෝ ඇසූ පිරූ තැන් ඇති, ධර්මය දරන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටි, නිවැරදි ප්‍රතිපදාවේ පිහිටි, ධර්මානුකූලව හැසිරෙන තත්වයට පත් වී සිටිති. ඔවුහු තමන්ගේ ආචාර්ය සම්ප්‍රදාය මැනවින් ගෙන, එය ප්‍රකාශ කරති, දේශනා කරති, ප්‍රඥප්ත කරති, පිහිටුවති, විවෘත කරති, විභාග කරති, පැහැදිලි කරති. පැන නගින අන්‍ය මතවාද ධර්මානුකූලව මැනවින් මැඩපවත්වා, ප්‍රාතිහාර්යවත් ධර්මය දේශනා කරති. භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! සුගතයන් වහන්ස, දැන් පිරිනිවන් පා වදාළ මැනව! භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේගේ පිරිනිවන් පෑමට කාලයයි.\n\nභාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මෙම වචනය වදාරන ලදී: ‘පව්කාර මාරය, මාගේ මේ බ්‍රහ්මචර්යාව සමෘද්ධ වී, ප්‍රබල වී, විස්තීරණ වී, මහජනයා අතර ප්‍රචලිත වී, දෙවි මිනිසුන් විසින් මැනවින් ප්‍රකාශ කරනු ලබන තුරු මම පිරිනිවන් නොපාමි’ යනුවෙනි. භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේගේ මේ බ්‍රහ්මචර්යාව සමෘද්ධ වී, ප්‍රබල වී, විස්තීරණ වී, මහජනයා අතර ප්‍රචලිත වී, දෙවි මිනිසුන් විසින් මැනවින් ප්‍රකාශ කරනු ලබන තත්වයට පත් වී ඇත. භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේ පිරිනිවන් පා වදාළ මැනව! සුගතයන් වහන්ස, දැන් පිරිනිවන් පා වදාළ මැනව! භාග්‍යවතුන් වහන්ස, දැන් භාග්‍යවතුන් වහන්සේගේ පිරිනිවන් පෑමට කාලයයි.\n\nමෙලෙස කී කල්හි, භාග්‍යවතුන් වහන්සේ පාපී මාරයාට මෙය වදාළ සේක: ‘පව්කාර මාරය, නුඹ නිෂ්ක්‍රීය වන්න. තථාගතයාණන් වහන්සේගේ පිරිනිවන් පෑම නොබෝ කලකින් සිදුවනු ඇත. මෙතැන් සිට මාස තුනක් ගෙවී ගිය පසු තථාගතයාණන් වහන්සේ පිරිනිවන් පානු ඇත’ යනුවෙනි.\n\nඑවිට භාග්‍යවතුන් වහන්සේ චාපාල චේතියේ දී සතියෙන් හා සම්‍යක් ප්‍රඥාවෙන් යුතුව ආයු සංස්කාරය අත්හළ සේක. භාග්‍යවතුන් වහන්සේ විසින් ආයු සංස්කාරය අත්හළ කල්හි, භයානක වූ, ලොමු ඩහගන්වන සුළු වූ මහ පොළොව කම්පා වීමක් ඇති විය. දෙව්දත් බෙර ද පලුදු විය. එවිට භාග්‍යවතුන් වහන්සේ මේ අරුත දැන, ඒ වෙලාවෙහි මෙම උදාන වැකිය වදාළ සේක: ‘මුනිවරයාණන් වහන්සේ, සිය ආත්මභාවයෙන් හටගන්නා වූ, ප්‍රමාණයෙන් තූල්‍ය වූත්, අතූල්‍ය වූත් සියලු භව සංස්කාරයන් අත්හළ සේක. අධ්‍යාත්මික වශයෙන්ම ඇලී, මනාකොට සමාධිමත් වී, ආත්මභාවයෙන් හටගත් කවචය බිඳ හෙළා වදාළ සේක.’",
      "paliTitle": "Cetiyasuttaṃ",
      "vagga": "Cāpālavaggo"
    },
    {
      "number": 823,
      "pali": "Sāvatthinidānaṃ. ‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho hetu, ko paccayo iddhipādabhāvanāyā’ti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘idha bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti’’’. ‘‘Vīriyasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīriyaṃ na ca atilīnaṃ bhavissati, na ca atippaggahitaṃ bhavissati, na ca ajjhattaṃ saṃkhittaṃ bhavissati, na ca bahiddhā vikkhittaṃ bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Cittasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me cittaṃ na ca atilīnaṃ bhavissati, na ca atippaggahitaṃ bhavissati, na ca ajjhattaṃ saṃkhittaṃ bhavissati, na ca bahiddhā vikkhittaṃ bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake; udakepi abhijjamāne [abhijjamāno (sī. pī. ka.)] gacchati, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasati [parāmasati (sī. syā. kaṃ.)] parimajjati; yāva brahmalokāpi kāyena vasaṃ vatteti. ‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti – dibbe ca mānuse ca, dūre santike cāti. ‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti. Sarāgaṃ vā cittaṃ ‘sarāgaṃ citta’nti pajānāti; vītarāgaṃ vā cittaṃ ‘vītarāgaṃ citta’nti pajānāti; sadosaṃ vā cittaṃ ‘sadosaṃ citta’nti pajānāti; vītadosaṃ vā cittaṃ ‘vītadosaṃ citta’nti pajānāti; samohaṃ vā cittaṃ ‘samohaṃ citta’nti pajānāti; vītamohaṃ vā cittaṃ ‘vītamohaṃ citta’nti pajānāti; saṃkhittaṃ vā cittaṃ ‘saṃkhittaṃ citta’nti pajānāti; vikkhittaṃ vā cittaṃ ‘vikkhittaṃ citta’nti pajānāti; mahaggataṃ vā cittaṃ ‘mahaggataṃ citta’nti pajānāti; amahaggataṃ vā cittaṃ ‘amahaggataṃ citta’nti pajānāti; sauttaraṃ vā cittaṃ ‘sauttaraṃ citta’nti pajānāti; anuttaraṃ vā cittaṃ ‘anuttaraṃ citta’nti pajānāti; samāhitaṃ vā cittaṃ ‘samāhitaṃ citta’nti pajānāti; asamāhitaṃ vā cittaṃ ‘asamāhitaṃ citta’nti pajānāti; vimuttaṃ vā cittaṃ ‘vimuttaṃ citta’nti pajānāti; avimuttaṃ vā cittaṃ ‘avimuttaṃ citta’nti pajānāti’’. ‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ [uppādiṃ (sī.)]; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘Evaṃ bhāvitesu kho bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata, bhonto, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana, bhonto, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. ‘‘Evaṃ bhāvitesu kho, bhikkhu, catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Paṭhamaṃ.",
      "english": "At Sāvatthī.\n\nBefore my full awakening, monks, while I was still an unawakened Bodhisatta, this thought occurred to me: \"What is the cause, what is the condition for the development of the bases of spiritual power?\" Then, monks, this thought occurred to me: \"Here, a monk develops the basis of spiritual power endowed with concentration due to fervent wish, and volitional formations of striving. He thinks: 'My fervent wish will not be too slack, nor too overstrained; it will not be inwardly constricted, nor outwardly scattered.' And he dwells perceiving 'front and back': as front, so back; as back, so front. As below, so above; as above, so below. As day, so night; as night, so day. Thus, with an open, unhindered mind, he develops a mind full of luminosity.\"\n\nHe develops the basis of spiritual power endowed with concentration due to energy, and volitional formations of striving. He thinks: \"My energy will not be too slack, nor too overstrained; it will not be inwardly constricted, nor outwardly scattered.\" And he dwells perceiving 'front and back': as front, so back; as back, so front. As below, so above; as above, so below. As day, so night; as night, so day. Thus, with an open, unhindered mind, he develops a mind full of luminosity.\n\nHe develops the basis of spiritual power endowed with concentration due to mind, and volitional formations of striving. He thinks: \"My mind will not be too slack, nor too overstrained; it will not be inwardly constricted, nor outwardly scattered.\" And he dwells perceiving 'front and back': as front, so back; as back, so front. As below, so above; as above, so below. As day, so night; as night, so day. Thus, with an open, unhindered mind, he develops a mind full of luminosity.\n\nHe develops the basis of spiritual power endowed with concentration due to investigation, and volitional formations of striving. He thinks: \"My investigation will not be too slack, nor too overstrained; it will not be inwardly constricted, nor outwardly scattered.\" And he dwells perceiving 'front and back': as front, so back; as back, so front. As below, so above; as above, so below. As day, so night; as night, so day. Thus, with an open, unhindered mind, he develops a mind full of luminosity.\n\nMonk, when these four bases of spiritual power are thus developed and frequently practiced, one experiences various kinds of supernormal power: being one, one becomes many; being many, one becomes one again. One appears and vanishes. One goes unimpeded through walls, through ramparts, through mountains, as if through space. One dives in and out of the earth as if in water. One walks on water without sinking as if on land. One travels through the air cross-legged, like a winged bird. One touches and strokes even the moon and sun, so mighty and powerful. One exercises mastery with the body even as far as the Brahma world.\n\nMonk, when these four bases of spiritual power are thus developed and frequently practiced, with the purified divine ear element, surpassing that of humans, one hears both kinds of sounds: divine and human, those far and those near.\n\nMonk, when these four bases of spiritual power are thus developed and frequently practiced, one comprehends with one's own mind the minds of other beings, other individuals. One discerns a mind with greed as 'a mind with greed'; a mind without greed as 'a mind without greed'; a mind with hatred as 'a mind with hatred'; a mind without hatred as 'a mind without hatred'; a mind with delusion as 'a mind with delusion'; a mind without delusion as 'a mind without delusion'; a constricted mind as 'a constricted mind'; a scattered mind as 'a scattered mind'; a developed mind as 'a developed mind'; an undeveloped mind as 'an undeveloped mind'; a mind with something higher as 'a mind with something higher'; an unsurpassed mind as 'an unsurpassed mind'; a concentrated mind as 'a concentrated mind'; an unconcentrated mind as 'an unconcentrated mind'; a liberated mind as 'a liberated mind'; an unliberated mind as 'an unliberated mind'.\n\nWhen, O monk, these four bases of spiritual power have been thus developed and frequently practiced, he recollects his manifold past existences, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births; many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion: ‘There I was such a one by name, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, with such a life-span. Having passed away from there, I arose elsewhere. There I was such a one by name, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, with such a life-span. Having passed away from there, I have arisen here.’ Thus, with its aspects and details, he recollects his manifold past existences.\n\nWhen, O monk, these four bases of spiritual power have been thus developed and frequently practiced, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions, with the divine eye, which is purified and surpasses that of humans. ‘Indeed, these venerable beings were endowed with misconduct of body, misconduct of speech, and misconduct of mind; they reviled the Noble Ones; they held wrong views and undertook actions based on wrong views. Due to the breaking up of the body, after death, they have reappeared in a state of deprivation, a bad destination, a downfall, in hell. But these other venerable beings were endowed with good conduct of body, good conduct of speech, and good conduct of mind; they did not revile the Noble Ones; they held right views and undertook actions based on right views. Due to the breaking up of the body, after death, they have reappeared in a good destination, in a heavenly world.’ Thus, with the divine eye, which is purified and surpasses that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions.\n\nWhen, O monk, these four bases of spiritual power have been thus developed and frequently practiced, by the destruction of the taints, he realizes for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, and abiding therein.",
      "sinhala": "මහණෙනි, මට සම්බෝධියට පෙර, තවමත් අභිසම්බුද්ධත්වයට නොපැමිණි බෝසතෙකු වශයෙන් සිටියදී මේ අදහස ඇතිවිය – ‘ඉර්ධිපාද භාවනාවට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’ කියා. මහණෙනි, එවිට මට මෙසේ සිතුණි – ‘මෙහි භික්ෂුවක් ඡන්දය (කැමැත්ත), සමාධිය හා ප්‍රධාන සංස්කාරය (වීර්යය) සහිත ඉර්ධිපාදය වඩයි. එසේ වඩන කල්හි මගේ ඡන්දය අධික ලෙස හීන නොවනු ඇත, අධික ලෙස උත්සාහවත් නොවනු ඇත, ඇතුළතට සංකුචිත නොවනු ඇත, පිටතට විසිරී නොයනු ඇත. ඔහු පසුපස හා පෙර යන සිහියෙන් යුතුව වාසය කරයි – පෙර කෙබඳුද, පසු කෙබඳුද; පසු කෙබඳුද, පෙර කෙබඳුද; යට කෙබඳුද, උඩ කෙබඳුද; උඩ කෙබඳුද, යට කෙබඳුද; දහවල් කෙබඳුද, රාත්‍රිය කෙබඳුද; රාත්‍රිය කෙබඳුද, දහවල් කෙබඳුද යන අයුරින්. මෙසේ විවෘත වූ, සීමා රහිත වූ සිතකින් යුතුව, ප්‍රභාසම්පන්න සිතක් වඩයි.\n\nවීර්යය, සමාධිය හා ප්‍රධාන සංස්කාරය සහිත ඉර්ධිපාදය වඩයි. එවිට මගේ වීර්යය අධික ලෙස හීන නොවනු ඇත, අධික ලෙස උත්සාහවත් නොවනු ඇත, ඇතුළතට සංකුචිත නොවනු ඇත, පිටතට විසිරී නොයනු ඇත. ඔහු පසුපස හා පෙර යන සිහියෙන් යුතුව වාසය කරයි – පෙර කෙබඳුද, පසු කෙබඳුද; පසු කෙබඳුද, පෙර කෙබඳුද; යට කෙබඳුද, උඩ කෙබඳුද; උඩ කෙබඳුද, යට කෙබඳුද; දහවල් කෙබඳුද, රාත්‍රිය කෙබඳුද; රාත්‍රිය කෙබඳුද, දහවල් කෙබඳුද යන අයුරින්. මෙසේ විවෘත වූ, සීමා රහිත වූ සිතකින් යුතුව, ප්‍රභාසම්පන්න සිතක් වඩයි.\n\nචිත්තය, සමාධිය හා ප්‍රධාන සංස්කාරය සහිත ඉර්ධිපාදය වඩයි. එවිට මගේ සිත අධික ලෙස හීන නොවනු ඇත, අධික ලෙස උත්සාහවත් නොවනු ඇත, ඇතුළතට සංකුචිත නොවනු ඇත, පිටතට විසිරී නොයනු ඇත. ඔහු පසුපස හා පෙර යන සිහියෙන් යුතුව වාසය කරයි – පෙර කෙබඳුද, පසු කෙබඳුද; පසු කෙබඳුද, පෙර කෙබඳුද; යට කෙබඳුද, උඩ කෙබඳුද; උඩ කෙබඳුද, යට කෙබඳුද; දහවල් කෙබඳුද, රාත්‍රිය කෙබඳුද; රාත්‍රිය කෙබඳුද, දහවල් කෙබඳුද යන අයුරින්. මෙසේ විවෘත වූ, සීමා රහිත වූ සිතකින් යුතුව, ප්‍රභාසම්පන්න සිතක් වඩයි.\n\nවිමංසා (විමසීම), සමාධිය හා ප්‍රධාන සංස්කාරය සහිත ඉර්ධිපාදය වඩයි. එවිට මගේ විමංසා අධික ලෙස හීන නොවනු ඇත, අධික ලෙස උත්සාහවත් නොවනු ඇත, ඇතුළතට සංකුචිත නොවනු ඇත, පිටතට විසිරී නොයනු ඇත. ඔහු පසුපස හා පෙර යන සිහියෙන් යුතුව වාසය කරයි – පෙර කෙබඳුද, පසු කෙබඳුද; පසු කෙබඳුද, පෙර කෙබඳුද; යට කෙබඳුද, උඩ කෙබඳුද; උඩ කෙබඳුද, යට කෙබඳුද; දහවල් කෙබඳුද, රාත්‍රිය කෙබඳුද; රාත්‍රිය කෙබඳුද, දහවල් කෙබඳුද යන අයුරින්. මෙසේ විවෘත වූ, සීමා රහිත වූ සිතකින් යුතුව, ප්‍රභාසම්පන්න සිතක් වඩයි.\n\nමහණෙනි, මෙසේ සතර ඉර්ධිපාදයන් වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද භික්ෂුව අනුන් නොදන්නා නොයෙක් ආකාර වූ ඉර්ධි ප්‍රත්‍යනුභව කරයි – එක් අයෙක් වී බොහෝ දෙනෙක් වෙයි, බොහෝ දෙනෙක් වී එක් අයෙක් වෙයි. පහළ කරයි, නොපෙනී යයි. පවුරු, තාප්ප, පර්වත හරහා බාධාවක් නැතිව අහසෙහි මෙන් ගමන් කරයි. පොළොවෙහි දියෙහි මෙන් ගිලීම් මතු වීම් කරයි. දියෙහි නොබිඳී පොළොවෙහි මෙන් ගමන් කරයි. අහසෙහි පක්ෂියකු මෙන් පලක් බැඳ හිඳගෙන ගමන් කරයි. මෙසේ මහානුභාව සම්පන්න වූ, මහත් ඉර්ධි ඇති මේ චන්ද්‍රයා සහ සූර්යයා ද අතින් පිරිමැද අතගායි. බ්‍රහ්මලෝකය දක්වා ද කයින් වසඟ කොට පවත්වයි.\n\nමහණෙනි, මෙසේ සතර ඉර්ධිපාදයන් වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද භික්ෂුව, මිනිස් කන් ඉක්මවා ගිය, පිරිසිදු දිව්‍යමය වූ ශ්‍රවණ ධාතුවෙන් (කනින්) දිව්‍යමය ද, මනුෂ්‍යමය ද යන දෙලොව ශබ්දයන් ද, දුර සහ ළඟ ඇති ශබ්දයන් ද අසයි.\n\nමහණෙනි, මෙසේ සතර ඉර්ධිපාදයන් වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද භික්ෂුව, අන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිත තම සිතින් දැනගනී. රාග සහිත සිතක් නම්, ‘රාග සහිත සිත’ යැයි දනී. රාග රහිත සිතක් නම්, ‘රාග රහිත සිත’ යැයි දනී. ද්වේෂ සහිත සිතක් නම්, ‘ද්වේෂ සහිත සිත’ යැයි දනී. ද්වේෂ රහිත සිතක් නම්, ‘ද්වේෂ රහිත සිත’ යැයි දනී. මෝහ සහිත සිතක් නම්, ‘මෝහ සහිත සිත’ යැයි දනී. මෝහ රහිත සිතක් නම්, ‘මෝහ රහිත සිත’ යැයි දනී. සංකුචිත සිතක් නම්, ‘සංකුචිත සිත’ යැයි දනී. විසිරුණු සිතක් නම්, ‘විසිරුණු සිත’ යැයි දනී. මහාර්ගත (ධ්‍යානගත) සිතක් නම්, ‘මහාර්ගත සිත’ යැයි දනී. මහාර්ගත නොවන (කාමාවචර) සිතක් නම්, ‘මහාර්ගත නොවන සිත’ යැයි දනී. උසස් භාවයක් සහිත සිතක් නම්, ‘උසස් භාවයක් සහිත සිත’ යැයි දනී. අනුත්තර (අර්හත් මාර්ගයට පැමිණි) සිතක් නම්, ‘අනුත්තර සිත’ යැයි දනී. සමාහිත (සමාධිගත) සිතක් නම්, ‘සමාහිත සිත’ යැයි දනී. අසමාහිත (සමාධිගත නොවන) සිතක් නම්, ‘අසමාහිත සිත’ යැයි දනී. විමුක්ත (රාගාදියෙන් මිදුණු) සිතක් නම්, ‘විමුක්ත සිත’ යැයි දනී. අවිමුක්ත (රාගාදියෙන් නොමිදුණු) සිතක් නම්, ‘අවිමුක්ත සිත’ යැයි දනී.\n\nමහණෙනි, මෙසේ සතර ඉද්ධිපාදයන් වඩන ලද හෙයින්, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්, නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. එනම්: එක් ආත්මභාවයක් ද, දෙආත්මභාවයන් ද, තුන් ආත්මභාවයන් ද, සිව් ආත්මභාවයන් ද, පස් ආත්මභාවයන් ද, දස ආත්මභාවයන් ද, විසි ආත්මභාවයන් ද, තිස් ආත්මභාවයන් ද, සතළිස් ආත්මභාවයන් ද, පනස් ආත්මභාවයන් ද, සියක් ආත්මභාවයන් ද, දහස් ආත්මභාවයන් ද, ලක්ෂයක් ආත්මභාවයන් ද, බොහෝ සංවට්ට කල්පයන් ද, බොහෝ විවට්ට කල්පයන් ද, බොහෝ සංවට්ට-විවට්ට කල්පයන් ද යනාදී වශයෙනි. ‘මම අසුවල් තැන සිටියෙමි. මෙබඳු නමක් ඇති, මෙබඳු ගෝත්‍රයක් ඇති, මෙබඳු වර්ණයක් ඇති, මෙබඳු ආහාරයක් ඇති, මෙබඳු සැපදුක් විඳින, මෙබඳු ආයුෂ කෙළවරක් ඇති අයෙක් වීමි. මම එතනින් චුත වී අසුවල් තැන උපන්නෙමි. එතන ද මම මෙබඳු නමක් ඇති, මෙබඳු ගෝත්‍රයක් ඇති, මෙබඳු වර්ණයක් ඇති, මෙබඳු ආහාරයක් ඇති, මෙබඳු සැපදුක් විඳින, මෙබඳු ආයුෂ කෙළවරක් ඇති අයෙක් වීමි. මම එතනින් චුත වී මෙතැන්හි උපන්නෙමි’යි සිහි කරයි. මෙසේ ආකාර සහිතව, අරමුණු සහිතව නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි.\n\nමහණෙනි, මෙසේ සතර ඉද්ධිපාදයන් වඩන ලද හෙයින්, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්, පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, මනා වර්ණ ඇති, දුර්වර්ණ ඇති, සුගතිගාමී වූ, දුර්ගතිගාමී වූ, කර්මයට අනුව උපදින සත්වයන් දකී. ‘ඇවැත්නි, මේ සත්වයෝ කයෙහි දුසිරිතෙන් යුක්ත වූවාහු, වචනයෙහි දුසිරිතෙන් යුක්ත වූවාහු, මනසෙහි දුසිරිතෙන් යුක්ත වූවාහු, ආර්යයන්ට අපහාස කරන්නා වූවාහු, මිථ්‍යාදෘෂ්ටික වූවාහු, මිථ්‍යාදෘෂ්ටි කර්ම සමාදන් වූවාහු වෙති. ඔවුහු කය බිඳීමෙන් මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැන් වල උපදින්නාහුය. නැතහොත් ඇවැත්නි, මේ සත්වයෝ කයෙහි සුචරිතයෙන් යුක්ත වූවාහු, වචනයෙහි සුචරිතයෙන් යුක්ත වූවාහු, මනසෙහි සුචරිතයෙන් යුක්ත වූවාහු, ආර්යයන්ට අපහාස නොකරන්නා වූවාහු, සම්‍යක්දෘෂ්ටික වූවාහු, සම්‍යක්දෘෂ්ටි කර්ම සමාදන් වූවාහු වෙති. ඔවුහු කය බිඳීමෙන් මරණින් මතු සුගතිගාමීව ස්වර්ග ලෝකයෙහි උපදින්නාහුය’යි දනී. මෙසේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, මනා වර්ණ ඇති, දුර්වර්ණ ඇති, සුගතිගාමී වූ, දුර්ගතිගාමී වූ, කර්මයට අනුව උපදින සත්වයන් දනී.\n\nමහණෙනි, මෙසේ සතර ඉද්ධිපාදයන් වඩන ලද හෙයින්, බහුල වශයෙන් පුරුදු කරන ලද හෙයින්, ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තෙමේම විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරයි.",
      "paliTitle": "Pubbasuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 824,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā. Kathaṃ bhāvitā ca, bhikkhave, cattāro iddhipādā kathaṃ bahulīkatā mahapphalā honti mahānisaṃsā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Evaṃ bhāvitā kho, bhikkhave, cattāro iddhipādā evaṃ bahulīkatā mahapphalā honti mahānisaṃsā. ‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti…pe…. ‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dutiyaṃ.",
      "english": "“Monks, these four bases of spiritual power, when cultivated and frequently practiced, are greatly fruitful and greatly beneficial. How are these four bases of spiritual power cultivated and frequently practiced so as to be greatly fruitful and greatly beneficial?\n\nHere, monks, a monk develops the base of spiritual power endowed with zeal, concentration, and the volitional formations of exertion – saying: ‘My zeal will not be too lax, nor too strained; it will not be inwardly constrained, nor outwardly scattered.’ He abides with the perception of front and back, seeing the front as the back and the back as the front; the below as the above and the above as the below; the day as the night and the night as the day. Thus, with an open and unconstrained mind, he develops a mind of luminosity.\n\nHe develops the base of spiritual power endowed with energy, concentration, and the volitional formations of exertion; the base of spiritual power endowed with mind, concentration, and the volitional formations of exertion; and he develops the base of spiritual power endowed with investigation, concentration, and the volitional formations of exertion – saying: ‘My investigation will not be too lax, nor too strained; it will not be inwardly constrained, nor outwardly scattered.’ He abides with the perception of front and back, seeing the front as the back and the back as the front; the below as the above and the above as the below; the day as the night and the night as the day. Thus, with an open and unconstrained mind, he develops a mind of luminosity. Thus developed and thus frequently practiced, these four bases of spiritual power are greatly fruitful and greatly beneficial.\n\nMonks, when a monk has thus developed and thus frequently practiced these four bases of spiritual power, he experiences various kinds of spiritual power: being one, he becomes many; being many, he becomes one; he appears and vanishes; he passes unhindered through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if in water; he walks on water without sinking as if on land; he flies through the air cross-legged like a winged bird; he touches and strokes the moon and sun with his hand, mighty and powerful as they are; and even up to the Brahma world, he exercises mastery with his body.\n\nMonks, when a monk has thus developed and thus frequently practiced these four bases of spiritual power, through the destruction of the taints, having realized and actualized for himself by direct knowledge, here and now, the taintless liberation of mind and liberation through wisdom, he abides therein.",
      "sinhala": "මහණෙනි, මේ ඉද්ධිපාද සතර භාවනා කරන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහා ඵල ඇති, මහා ආනිසංස ඇති වෙත්. මහණෙනි, මේ ඉද්ධිපාද සතර කෙසේ භාවනා කරන ලද ද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද ද මහා ඵල ඇති, මහා ආනිසංස ඇති වෙත් ද? මහණෙනි, මෙහිලා භික්ෂුවක් ඡන්ද සමාධියෙන්, ප්‍ර‌ධාන සංස්කාරයෙන් යුක්ත ඉද්ධිපාදය වඩයි – ‘මාගේ ඡන්දය (කැමැත්ත) අධික ලෙස හීන වී නොපවතියි, අධික ලෙස උද්දාමයට පත් නොවේ, ඇතුළතට හැකිලී නොපවතියි, පිටතට විසිරී නොපවතියි’ යනුවෙනි. පසු කාලය හා පෙර කාලය පිළිබඳ සංඥාවෙන් යුක්තව වාසය කරයි – කලින් තිබූ අයුරින්ම පසුවද, පසුව තිබූ අයුරින්ම කලින්ද; යට තිබූ අයුරින්ම උඩද, උඩ තිබූ අයුරින්ම යටද; දවල් තිබූ අයුරින්ම රාත්‍රීද, රාත්‍රී තිබූ අයුරින්ම දවල්ද යනුවෙනි. මේ අයුරින් විවෘත වූ සිතින්, සීමා නොකළ, ආලෝකවත් වූ සිතක් වඩයි.\n\nඑලෙසම, වීර්යය සමාධියෙන්, ප්‍ර‌ධාන සංස්කාරයෙන් යුක්ත ඉද්ධිපාදය ද... සිත සමාධියෙන්, ප්‍ර‌ධාන සංස්කාරයෙන් යුක්ත ඉද්ධිපාදය ද... විමංසා සමාධියෙන්, ප්‍ර‌ධාන සංස්කාරයෙන් යුක්ත ඉද්ධිපාදය වඩයි – ‘මාගේ විමංසාව (විමර්ශනය) අධික ලෙස හීන වී නොපවතියි, අධික ලෙස උද්දාමයට පත් නොවේ, ඇතුළතට හැකිලී නොපවතියි, පිටතට විසිරී නොපවතියි’ යනුවෙනි. පසු කාලය හා පෙර කාලය පිළිබඳ සංඥාවෙන් යුක්තව වාසය කරයි – කලින් තිබූ අයුරින්ම පසුවද, පසුව තිබූ අයුරින්ම කලින්ද; යට තිබූ අයුරින්ම උඩද, උඩ තිබූ අයුරින්ම යටද; දවල් තිබූ අයුරින්ම රාත්‍රීද, රාත්‍රී තිබූ අයුරින්ම දවල්ද යනුවෙනි. මේ අයුරින් විවෘත වූ සිතින්, සීමා නොකළ, ආලෝකවත් වූ සිතක් වඩයි. මහණෙනි, මේ අයුරින් භාවනා කරන ලද, මේ අයුරින් බහුල වශයෙන් පුරුදු කරන ලද ඉද්ධිපාද සතර මහා ඵල ඇති, මහා ආනිසංස ඇති වෙත්.\n\nමහණෙනි, මේ අයුරින් භාවනා කරන ලද, මේ අයුරින් බහුල වශයෙන් පුරුදු කරන ලද මේ ඉද්ධිපාද සතරෙන් යුක්ත භික්ෂුව නොයෙක් ආකාරයේ ඍද්ධි ප්‍ර‌භේදයන් අත්දක්වා ප්‍රතිලාභ ලබයි – එකකු වුවත් බොහෝ වේ... (ආදී වශයෙන්), බ්‍රහ්ම ලෝකය දක්වාද කයින් වසඟ කරවයි... (ආදී වශයෙන්).\n\nමහණෙනි, මේ අයුරින් භාවනා කරන ලද, මේ අයුරින් බහුල වශයෙන් පුරුදු කරන ලද මේ ඉද්ධිපාද සතරෙන් යුක්ත භික්ෂුව, ආශ්‍රවයන්ගේ ක්ෂය වීම නිසා ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍ර‌ඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් දැන පසක් කොට ඊට පැමිණ වාසය කරයි.",
      "paliTitle": "Mahapphalasuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 825,
      "pali": "‘‘Chandaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati chandasamādhi. So anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti ayañca chando, ayañca chandasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘chandasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’. ‘‘Vīriyaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘vīriyasamādhi’. So anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca vīriyaṃ, ayañca vīriyasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘vīriyasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’. ‘‘Cittaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘cittasamādhi’. So anuppannānaṃ pāpakānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti idañca cittaṃ, ayañca cittasamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘cittasamādhippadhānasaṅkhārasamannāgato iddhipādo’’’. ‘‘Vīmaṃsaṃ ce, bhikkhave, bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ – ayaṃ vuccati ‘vīmaṃsāsamādhi’. So anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime vuccanti ‘padhānasaṅkhārā’ti. Iti ayañca vīmaṃsā, ayañca vīmaṃsāsamādhi, ime ca padhānasaṅkhārā – ayaṃ vuccati, bhikkhave, ‘vīmaṃsāsamādhippadhānasaṅkhārasamannāgato iddhipādo’’’ti. Tatiyaṃ.",
      "english": "Monks, when a bhikkhu, relying on zeal, attains concentration, attains one-pointedness of mind—this is called concentration born of zeal. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the non-arising of evil, unwholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the abandoning of evil, unwholesome states that have arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the arising of wholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the maintenance, non-disappearance, increase, development, cultivation, and perfection of wholesome states that have arisen. These are called 'factors of exertion.' Thus, this zeal, this concentration born of zeal, and these factors of exertion—this, monks, is called 'the base of spiritual power endowed with concentration born of zeal and factors of exertion.'\n\nMonks, when a bhikkhu, relying on energy, attains concentration, attains one-pointedness of mind—this is called concentration born of energy. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the non-arising of evil, unwholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the abandoning of evil, unwholesome states that have arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the arising of wholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the maintenance, non-disappearance, increase, development, cultivation, and perfection of wholesome states that have arisen. These are called 'factors of exertion.' Thus, this energy, this concentration born of energy, and these factors of exertion—this, monks, is called 'the base of spiritual power endowed with concentration born of energy and factors of exertion.'\n\nMonks, when a bhikkhu, relying on mind, attains concentration, attains one-pointedness of mind—this is called concentration born of mind. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the non-arising of evil, unwholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the abandoning of evil, unwholesome states that have arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the arising of wholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the maintenance, non-disappearance, increase, development, cultivation, and perfection of wholesome states that have arisen. These are called 'factors of exertion.' Thus, this mind, this concentration born of mind, and these factors of exertion—this, monks, is called 'the base of spiritual power endowed with concentration born of mind and factors of exertion.'\n\nMonks, when a bhikkhu, relying on investigation, attains concentration, attains one-pointedness of mind—this is called concentration born of investigation. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the non-arising of evil, unwholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the abandoning of evil, unwholesome states that have arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the arising of wholesome states that have not yet arisen. He generates zeal, exerts effort, initiates energy, applies his mind firmly, and strives for the maintenance, non-disappearance, increase, development, cultivation, and perfection of wholesome states that have arisen. These are called 'factors of exertion.' Thus, this investigation, this concentration born of investigation, and these factors of exertion—this, monks, is called 'the base of spiritual power endowed with concentration born of investigation and factors of exertion.'",
      "sinhala": "භික්ෂූන් වහන්ස, යම් භික්ෂුවක් ඡන්දය මුල් කරගෙන සමාධිය ලබා ගන්නේ ද, සිතේ ඒකග්ගතා භාවය ලබා ගන්නේ ද – මෙය ඡන්දසමාධිය යැයි කියනු ලැබේ. හෙතෙම නූපන් පාපී අකුසල ධර්මයන් නූපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් පාපී අකුසල ධර්මයන් ප්‍ර​හීණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොඅතුරුදහන් වීම පිණිස, වැඩිදියුණු වීම පිණිස, විපුලභාවය පිණිස, භාවනාව පිණිස, සම්පූර්ණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. මේවා ‘ප්‍ර​ධාන සංස්කාර’ යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මෙසේ මේ ඡන්දය ද, මේ ඡන්දසමාධිය ද, මේ ප්‍ර​ධාන සංස්කාර ද – ‘ඡන්දසමාධි​ප්‍ර​ධාන​සංස්කාර​සමන්නාගත සෘද්ධිපාදය’ යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, යම් භික්ෂුවක් වීර්යය මුල් කරගෙන සමාධිය ලබා ගන්නේ ද, සිතේ ඒකග්ගතා භාවය ලබා ගන්නේ ද – මෙය ‘වීර්ය​සමාධිය’ යැයි කියනු ලැබේ. හෙතෙම නූපන් පාපී අකුසල ධර්මයන් නූපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් පාපී අකුසල ධර්මයන් ප්‍ර​හීණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොඅතුරුදහන් වීම පිණිස, වැඩිදියුණු වීම පිණිස, විපුලභාවය පිණිස, භාවනාව පිණිස, සම්පූර්ණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. මේවා ‘ප්‍ර​ධාන සංස්කාර’ යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මෙසේ මේ වීර්යය ද, මේ වීර්ය​සමාධිය ද, මේ ප්‍ර​ධාන සංස්කාර ද – ‘වීර්ය​සමාධි​ප්‍ර​ධාන​සංස්කාර​සමන්නාගත සෘද්ධිපාදය’ යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, යම් භික්ෂුවක් සිත මුල් කරගෙන සමාධිය ලබා ගන්නේ ද, සිතේ ඒකග්ගතා භාවය ලබා ගන්නේ ද – මෙය ‘චිත්තසමාධිය’ යැයි කියනු ලැබේ. හෙතෙම නූපන් පාපී අකුසල ධර්මයන් නූපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් පාපී අකුසල ධර්මයන් ප්‍ර​හීණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොඅතුරුදහන් වීම පිණිස, වැඩිදියුණු වීම පිණිස, විපුලභාවය පිණිස, භාවනාව පිණිස, සම්පූර්ණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. මේවා ‘ප්‍ර​ධාන සංස්කාර’ යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මෙසේ මේ සිත ද, මේ චිත්තසමාධිය ද, මේ ප්‍ර​ධාන සංස්කාර ද – ‘චිත්තසමාධි​ප්‍ර​ධාන​සංස්කාර​සමන්නාගත සෘද්ධිපාදය’ යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, යම් භික්ෂුවක් විමංසාව මුල් කරගෙන සමාධිය ලබා ගන්නේ ද, සිතේ ඒකග්ගතා භාවය ලබා ගන්නේ ද – මෙය ‘විමංසා​සමාධිය’ යැයි කියනු ලැබේ. හෙතෙම නූපන් පාපී අකුසල ධර්මයන් නූපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් පාපී අකුසල ධර්මයන් ප්‍ර​හීණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොඅතුරුදහන් වීම පිණිස, වැඩිදියුණු වීම පිණිස, විපුලභාවය පිණිස, භාවනාව පිණිස, සම්පූර්ණ කිරීම පිණිස ඡන්දය ජනනය කරයි, වෑයම් කරයි, වීර්යය ආරම්භ කරයි, සිත නොලෙලවා තබා ගනී, උත්සාහ කරයි. මේවා ‘ප්‍ර​ධාන සංස්කාර’ යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මෙසේ මේ විමංසාව ද, මේ විමංසා​සමාධිය ද, මේ ප්‍ර​ධාන සංස්කාර ද – ‘විමංසා​සමාධි​ප්‍ර​ධාන​සංස්කාර​සමන්නාගත සෘද්ධිපාදය’ යැයි කියනු ලැබේ.",
      "paliTitle": "Chandasamādhisuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 826,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena sambahulā bhikkhū heṭṭhāmigāramātupāsāde viharanti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā bhantacittā [vibbhantacittā (sī. syā. kaṃ.)] pākatindriyā. Atha kho bhagavā āyasmantaṃ mahāmoggallānaṃ āmantesi – ‘‘ete kho, moggallāna, sabrahmacārino heṭṭhāmigāramātupāsāde viharanti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā bhantacittā pākatindriyā. Gaccha, moggallāna, te bhikkhū saṃvejehī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā mahāmoggallāno bhagavato paṭissutvā tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāresi [abhisaṅkharesi (syā. pī. ka.)] yathā pādaṅguṭṭhakena migāramātupāsādaṃ saṅkampesi sampakampesi sampacālesi. Atha kho te bhikkhū saṃviggā lomahaṭṭhajātā ekamantaṃ aṭṭhaṃsu – ‘‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Nivātañca vata ayañca migāramātupāsādo gambhīranemo sunikhāto acalo asampakampī, atha ca pana saṅkampito sampakampito sampacālito’’ti! Atha kho bhagavā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū bhagavā etadavoca – ‘‘kiṃ nu tumhe, bhikkhave, saṃviggā lomahaṭṭhajātā ekamantaṃ ṭhitā’’ti? ‘‘Acchariyaṃ, bhante, abbhutaṃ bhante! Nivātañca vata ayañca migāramātupāsādo gambhīranemo sunikhāto acalo asampakampī, atha ca pana saṅkampito sampakampito sampacālito’’ti! ‘‘Tumheva kho, bhikkhave, saṃvejetukāmena moggallānena bhikkhunā pādaṅguṭṭhakena migāramātupāsādo, saṅkampito sampakampito sampacālito. Taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā, bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha. Catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo. Katamesaṃ catunnaṃ? Idha, bhikkhave, moggallāno bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati; na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti…pe… imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Catutthaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Sāvatthī, at the Eastern Park, in Migāra's Mother's Palace. Now at that time, many bhikkhus were dwelling below Migāra's Mother's Palace, being unruly, insolent, fickle, talkative, speaking idly, unmindful, without clear comprehension, unconcentrated, with bewildered minds, and with unrestrained faculties.\n\nThen the Blessed One addressed Venerable Mahāmoggallāna: \"Moggallāna, these fellow monastics are dwelling below Migāra's Mother's Palace, being unruly, insolent, fickle, talkative, speaking idly, unmindful, without clear comprehension, unconcentrated, with bewildered minds, and with unrestrained faculties. Go, Moggallāna, and stir up a sense of urgency in those bhikkhus.\" \"Yes, venerable sir,\" Venerable Mahāmoggallāna replied to the Blessed One. Then he performed such a feat of psychic power that he made Migāra's Mother's Palace shake, tremble, and rock with his big toe.\n\nThen those bhikkhus, stirred up and with their hair standing on end, stood to one side, thinking: \"It is amazing, good sirs! It is astonishing, good sirs! This Migāra's Mother's Palace is indeed well-sheltered, with a deep foundation, well-rooted, unmoving, and unshaking, yet it has been shaken, trembled, and rocked!\" Then the Blessed One approached those bhikkhus; and having approached, the Blessed One said to them: \"Bhikkhus, why are you standing to one side, stirred up and with your hair standing on end?\" \"Venerable sir, it is amazing! Venerable sir, it is astonishing! This Migāra's Mother's Palace is indeed well-sheltered, with a deep foundation, well-rooted, unmoving, and unshaking, yet it has been shaken, trembled, and rocked!\"\n\n\"Bhikkhus, it was the bhikkhu Moggallāna, desiring to stir up a sense of urgency in you, who made Migāra's Mother's Palace shake, tremble, and rock with his big toe. What do you think, bhikkhus, by the development and cultivation of which qualities is the bhikkhu Moggallāna of such great psychic power and such great majesty?\" \"Venerable sir, our teachings have the Blessed One as their root, the Blessed One as their guide, and the Blessed One as their refuge. It would be excellent, venerable sir, if the Blessed One himself would reveal the meaning of this statement. Having heard it from the Blessed One, the bhikkhus will remember it.\"\n\n\"In that case, bhikkhus, listen. It is by the development and cultivation of the four bases of spiritual power that the bhikkhu Moggallāna is of such great psychic power and such great majesty. Which four? Here, bhikkhus, the bhikkhu Moggallāna develops the base of spiritual power endowed with concentration due to zeal and the formation of exertion. He develops the base of spiritual power endowed with concentration due to energy and the formation of exertion. He develops the base of spiritual power endowed with concentration due to mind and the formation of exertion. He develops the base of spiritual power endowed with concentration due to investigation and the formation of exertion, thinking: 'Thus my investigation will be neither too lax nor too over-strained; it will be neither internally restricted nor externally scattered.' He dwells perceiving past as future, and future as past; perceiving below as above, and above as below; perceiving day as night, and night as day. Thus, with an open, unconfined mind, he develops a radiant mind. It is by the development and cultivation of these four bases of spiritual power that the bhikkhu Moggallāna is of such great psychic power and such great majesty. Furthermore, bhikkhus, by the development and cultivation of these four bases of spiritual power, the bhikkhu Moggallāna experiences various kinds of psychic power: being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through air; he dives in and out of the earth as if in water; he walks on water without sinking as if on land; he travels through the sky seated cross-legged as if he were a winged bird; with his hand he touches and strokes the moon and sun, so mighty and powerful; he exercises mastery over the body even as far as the Brahma-world. Furthermore, bhikkhus, by the development and cultivation of these four bases of spiritual power, through the destruction of the taints, he enters and dwells in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයේ මිගාරමාතුප්‍රාසාදයේ වැඩවසන සේක. එකල්හි බොහෝ භික්ෂූහු මිගාරමාතුප්‍රාසාදය යට තැන්වල වැඩවසති. මොවුන් උද්ධත වූ, උන්නළ වූ, චපල වූ, මුඛර වූ, විකිණ්ණවාචා වූ, මුට්ඨස්සති වූ, අසම්පජාන වූ, අසමාහිත වූ, භ්‍රාන්තචිත්ත වූ, ප්‍රකටේන්ද්‍රිය වූ භික්ෂූහු වෙති.\n\nඑවිට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් අමතා මෙසේ වදාළ සේක: “මොග්ගල්ලානයෙනි, මේ බ්‍රහ්මචාරීහු මිගාරමාතුප්‍රාසාදය යට තැන්වල වැඩවසති. මොවුන් උද්ධත වූ, උන්නළ වූ, චපල වූ, මුඛර වූ, විකිණ්ණවාචා වූ, මුට්ඨස්සති වූ, අසම්පජාන වූ, අසමාහිත වූ, භ්‍රාන්තචිත්ත වූ, ප්‍රකටේන්ද්‍රිය වූ භික්ෂූහු වෙති. මොග්ගල්ලානයෙනි, ඔබ ගොස් ඒ භික්ෂූන් සංවේගයට පත් කරන්නැ”යි වදාළ සේක. “එසේය, භාග්‍යවතුන් වහන්සැ”යි ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, යම්සේ සිය පා ඇඟිල්ලෙන් මිගාරමාතුප්‍රාසාදය කම්පා කළාද, මනාව කම්පා කළාද, සොලවා දැම්මාද, ඒ ආකාරයෙන් එබඳු ඉර්ධි අභිසංඛාරයක් මනසින් මවා ගත්තාහුය. එවිට ඒ භික්ෂූහු සංවේගයට පත්ව, ලොමුදැහැගැන්මෙන් යුතුව එක් පසෙක සිට ගත්තාහුය. “භවත්නි, මෙය පුදුම දෙයකි! භවත්නි, මෙය ආශ්චර්යයකි! සන්සුන් වූ, ගැඹුරු මුල් ඇති, මනාකොට පිහිටුවන ලද, නොසෙල්වෙන, කම්පා නොවන මේ මිගාරමාතුප්‍රාසාදය කම්පා කරන ලදී, මනාව කම්පා කරන ලදී, සොලවා දමන ලදී!”\n\nඑවිට භාග්‍යවතුන් වහන්සේ ඒ භික්ෂූන් වෙත වැඩම කළ සේක; වැඩම කොට ඒ භික්ෂූන්ට මෙසේ වදාළ සේක: “මහණෙනි, කුමක් නිසා නුඹලා සංවේගයට පත්ව, ලොමුදැහැගැන්මෙන් යුතුව එක් පසෙක සිටගෙන සිටින්නාහුද?” “ස්වාමීනි, පුදුමයකි! ස්වාමීනි, ආශ්චර්යයකි! සන්සුන් වූ, ගැඹුරු මුල් ඇති, මනාකොට පිහිටුවන ලද, නොසෙල්වෙන, කම්පා නොවන මේ මිගාරමාතුප්‍රාසාදය කම්පා කරන ලදී, මනාව කම්පා කරන ලදී, සොලවා දමන ලදී!” “මහණෙනි, නුඹලාම සංවේගයට පත් කිරීමට කැමති වූ මොග්ගල්ලාන භික්ෂුව විසින් සිය පා ඇඟිල්ලෙන් මිගාරමාතුප්‍රාසාදය කම්පා කරන ලදී, මනාව කම්පා කරන ලදී, සොලවා දමන ලදී. මහණෙනි, මෙය කුමක් යැයි සිතන්නාහුද, මොග්ගල්ලාන භික්ෂුව මෙතරම් මහත් ඉර්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති අයෙකු වී ඇත්තේ කිනම් ධර්මයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද?”\n\n“ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහුය, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහුය, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහුය. ස්වාමීනි, මේ වදාළ වචනයේ තේරුම භාග්‍යවතුන් වහන්සේටම වැටහේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය ධාරණය කර ගන්නවා ඇත.” “එසේ නම් මහණෙනි, අසන්න. මහණෙනි, සතර ඉර්ධිපාදයන් වැඩීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් මොග්ගල්ලාන භික්ෂුව මෙතරම් මහත් ඉර්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති අයෙකු වී සිටින්නේය. ඒ සතර කුමක්ද? මහණෙනි, මෙහිලා මොග්ගල්ලාන භික්ෂුව ඡන්දසමාධිප්‍රධානසංඛාරයෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි. වීර්යසමාධිප්‍රධානසංඛාරයෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි. චිත්තසමාධිප්‍රධානසංඛාරයෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි. විමංසාසමාධිප්‍රධානසංඛාරයෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි. – ‘මාගේ මේ විමංසාව අධිකව ලීන නොවන්නේය, අධිකව ප්‍රගෘහිත නොවන්නේය; අධ්‍යාත්මිකව සංක්ෂිප්ත නොවන්නේය, බාහිරව වික්ෂිප්ත නොවන්නේය’ යනුවෙනි. පසු පෙර සඥාවෙන්ද වාසය කරයි. යම්සේ පෙර, එලෙසම පසු; යම්සේ පසු, එලෙසම පෙර; යම්සේ යට, එලෙසම උඩ; යම්සේ උඩ, එලෙසම යට; යම්සේ දවල්, එලෙසම රාත්‍රිය; යම්සේ රාත්‍රිය, එලෙසම දවල්. මේ අයුරින් විවෘත වූ සිතින්, අවෘත නොලද සිතින්, ප්‍රභාසම්පන්න සිතක් වඩයි. මහණෙනි, මේ සතර ඉර්ධිපාදයන් වැඩීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් මොග්ගල්ලාන භික්ෂුව මෙතරම් මහත් ඉර්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති අයෙකු වී සිටින්නේය. තවද මහණෙනි, මේ සතර ඉර්ධිපාදයන් වැඩීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් මොග්ගල්ලාන භික්ෂුව බොහෝ අයුරින් ඉර්ධිවිධි ප්‍රත්‍යක්ෂ කරයි. එනම්: එකෙක්ව බොහෝ වෙයි, බොහෝව එකෙක් වෙයි; පහළ වෙයි, නොපහළ වෙයි; පවුරින්ද, පවුරෙන්ද, කඳුකරයෙන්ද අවුරනු නොලැබ ගුවනේ යන්නා සේ යයි; පොළොවෙහි කිමිදී මතු වෙයි; දියෙහි කිමිදී මතු වන්නාක් මෙන් යයි; දිය මතුපිට කැඩී නොගොස් යයි; පියාපත් ඇති කුරුල්ලෙකු මෙන් අහසින් යයි; මෙතරම් මහත් ඉර්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති සඳුන්, සූර්යයන් අතින් ස්පර්ශ කර, පිරිමදියි; බඹලොව දක්වාද කයින් වසඟයට පත් කරයි. තවද මහණෙනි, මේ සතර ඉර්ධිපාදයන් වැඩීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන් මොග්ගල්ලාන භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තියද, ප්‍රඥාවිමුක්තියද මෙලොවදීම තමා විසින් අවබෝධයෙන් සාක්ෂාත් කර, එයට පැමිණ වාසය කරයි.”",
      "paliTitle": "Moggallānasuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 827,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho uṇṇābho brāhmaṇo yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uṇṇābho brāhmaṇo āyasmantaṃ ānandaṃ etadavoca – ‘‘kimatthiyaṃ nu kho, bho ānanda, samaṇe gotame brahmacariyaṃ vussatī’’ti? ‘‘Chandappahānatthaṃ kho, brāhmaṇa, bhagavati brahmacariyaṃ vussatī’’ti. ‘‘Atthi pana, bho ānanda, maggo atthi paṭipadā etassa chandassa pahānāyā’’ti? ‘‘Atthi kho, brāhmaṇa, maggo atthi paṭipadā etassa chandassa pahānāyā’’ti. ‘‘Katamo pana, bho ānanda, maggo katamā paṭipadā etassa chandassa pahānāyā’’ti? ‘‘Idha, brāhmaṇa, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ kho, brāhmaṇa, maggo ayaṃ paṭipadā etassa chandassa pahānāyā’’ti. ‘‘Evaṃ sante, bho ānanda, santakaṃ hoti no asantakaṃ. Chandeneva chandaṃ pajahissatīti – netaṃ ṭhānaṃ vijjati’’. ‘‘Tena hi, brāhmaṇa, taññevettha paṭipucchissāmi. Yathā te khameyya tathā taṃ byākareyyāsi. Taṃ kiṃ maññasi, brāhmaṇa, ahosi te pubbe chando ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yo tajjo chando so paṭippassaddho’’ti? ‘‘Evaṃ, bho’’. ‘‘Ahosi te pubbe vīriyaṃ ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yaṃ tajjaṃ vīriyaṃ taṃ paṭippassaddha’’nti? ‘‘Evaṃ, bho’’. ‘‘Ahosi te pubbe cittaṃ ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yaṃ tajjaṃ cittaṃ taṃ paṭippassaddha’’nti? ‘‘Evaṃ, bho’’. ‘‘Ahosi te pubbe vīmaṃsā ‘ārāmaṃ gamissāmī’ti? Tassa te ārāmagatassa yā tajjā vīmaṃsā sā paṭippassaddhā’’ti? ‘‘Evaṃ, bho’’. ‘‘Evameva kho, brāhmaṇa, yo so bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, tassa yo pubbe chando ahosi arahattappattiyā, arahattappatte [arahatte patte (sī. syā. kaṃ.)] yo tajjo chando so paṭippassaddho; yaṃ pubbe vīriyaṃ ahosi arahattappattiyā, arahattappatte yaṃ tajjaṃ vīriyaṃ taṃ paṭippassaddhaṃ; yaṃ pubbe cittaṃ ahosi arahattappattiyā, arahattappatte yaṃ tajjaṃ cittaṃ taṃ paṭippassaddhaṃ; yā pubbe vīmaṃsā ahosi arahattappattiyā, arahattappatte yā tajjā vīmaṃsā sā paṭippassaddhā. Taṃ kiṃ maññasi, brāhmaṇa, iti evaṃ sante, santakaṃ vā hoti no asantakaṃ vā’’ti? ‘‘Addhā, bho ānanda, evaṃ sante, santakaṃ hoti no asantakaṃ. Abhikkantaṃ, bho ānanda, abhikkantaṃ, bho ānanda! Seyyathāpi, bho ānanda, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā ānandena anekapariyāyena dhammo pakāsito. Esāhaṃ, bho ānanda, taṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ ānando dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ.",
      "english": "Thus have I heard: On one occasion, the venerable Ānanda was dwelling in Kosambī, at Ghositārāma.\n\nThen indeed, the brahmin Uṇṇābha approached the venerable Ānanda. Having approached, he exchanged greetings with the venerable Ānanda. Having concluded the cordial and memorable talk, he sat down to one side. As he sat to one side, the brahmin Uṇṇābha said to the venerable Ānanda, \"For what purpose, good Ānanda, is the holy life lived under the ascetic Gotama?\"\n\n\"Indeed, brahmin, the holy life is lived under the Blessed One for the abandonment of desire.\"\n\n\"But is there, good Ānanda, a path, a practice for the abandonment of this desire?\"\n\n\"Indeed, brahmin, there is a path, there is a practice for the abandonment of this desire.\"\n\n\"And what, good Ānanda, is that path, what is that practice for the abandonment of this desire?\"\n\n\"Here, brahmin, a monk develops the basis for spiritual power endowed with concentration due to desire and the volitional formations of striving. He develops the basis for spiritual power endowed with concentration due to energy and the volitional formations of striving. He develops the basis for spiritual power endowed with concentration due to mind and the volitional formations of striving. He develops the basis for spiritual power endowed with concentration due to investigation and the volitional formations of striving. This, indeed, brahmin, is the path, this is the practice for the abandonment of this desire.\"\n\n\"If this is the case, good Ānanda, then it is a case of keeping it, not abandoning it. That one will abandon desire by means of desire – this is not possible.\"\n\n\"Then, brahmin, I shall question you in return about this. You should answer as you see fit. What do you think, brahmin? Did you previously have a desire, ‘I will go to the park’? When you had gone to the park, did that particular desire subside?\" \"Yes, good sir.\"\n\n\"Did you previously have energy, ‘I will go to the park’? When you had gone to the park, did that particular energy subside?\" \"Yes, good sir.\"\n\n\"Did you previously have a thought, ‘I will go to the park’? When you had gone to the park, did that particular thought subside?\" \"Yes, good sir.\"\n\n\"Did you previously have an investigation, ‘I will go to the park’? When you had gone to the park, did that particular investigation subside?\" \"Yes, good sir.\"\n\n\"In the same way, brahmin, for that monk who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what was to be done, who has laid down the burden, who has attained his own true goal, whose fetters to existence are utterly destroyed, who is liberated through right knowledge – his desire that he previously had for the attainment of Arahantship, when Arahantship is attained, that particular desire subsides. His energy that he previously had for the attainment of Arahantship, when Arahantship is attained, that particular energy subsides. His thought that he previously had for the attainment of Arahantship, when Arahantship is attained, that particular thought subsides. His investigation that he previously had for the attainment of Arahantship, when Arahantship is attained, that particular investigation subsides. What do you think, brahmin? If this is the case, is it a case of keeping it or not keeping it?\"\n\n\"Certainly, good Ānanda, if this is the case, it is a case of not keeping it, but abandoning it. Excellent, good Ānanda, excellent, good Ānanda! Just as, good Ānanda, one might right what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness so that those with eyes could see forms – even so, has the Dhamma been made clear by the good Ānanda in many ways. I go for refuge, good Ānanda, to that good Gotama, and to the Dhamma, and to the Saṅgha of monks. May the good Ānanda remember me as a lay follower who has gone for refuge from this day forward, for as long as life lasts.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කෝසම්බියෙහි ඝෝෂිතාරාමයේ වැඩසිටියහ.\n\nඉක්බිති උණ්ණාභ බ්‍රාහ්මණ තෙමේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා බස් හුවමාරු කරගෙන, එකත්පසෙකින් වාඩි විය.\n\nඑකත්පසෙකින් වාඩි වී සිටි උණ්ණාභ බ්‍රාහ්මණ තෙමේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය කීවේය: ‘‘භවත් ආනන්දයෙනි, ශ්‍රමණ ගෞතමයන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාව (උතුම් පැවැත්ම) හැසිරෙන්නේ කුමක් පිණිසද?’’\n\n‘‘බ්‍රාහ්මණය, භාග්‍යවතුන් වහන්සේගේ ශාසනයෙහි බ්‍රහ්මචර්යාව (උතුම් පැවැත්ම) හැසිරෙන්නේ ඡන්දය (ඇල්ම, දැඩි කැමැත්ත) ප්‍රහාණය කිරීම පිණිසයි.’’\n\n‘‘භවත් ආනන්දයෙනි, එම ඡන්දය ප්‍රහාණය කිරීම පිණිස මාර්ගයක් තිබේද? පිළිවෙතක් තිබේද?’’\n\n‘‘බ්‍රාහ්මණය, එම ඡන්දය ප්‍රහාණය කිරීම පිණිස මාර්ගයක් තිබේ, පිළිවෙතක් තිබේ.’’\n\n‘‘භවත් ආනන්දයෙනි, එම ඡන්දය ප්‍රහාණය කිරීම පිණිස ඇති ඒ මාර්ගය කවරේද? ඒ පිළිවෙත කවරේද?’’\n\n‘‘බ්‍රාහ්මණය, මෙහිලා භික්ෂුව ඡන්දය හා සමාධිය ප්‍රධාන කොට ඇති වීර්යයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. වීර්යය හා සමාධිය ප්‍රධාන කොට ඇති වීර්යයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. සිත හා සමාධිය ප්‍රධාන කොට ඇති වීර්යයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. විමසීම හා සමාධිය ප්‍රධාන කොට ඇති වීර්යයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. බ්‍රාහ්මණය, එම ඡන්දය ප්‍රහාණය කිරීම පිණිස ඇති මාර්ගය මෙයයි, පිළිවෙත මෙයයි.’’\n\n‘‘භවත් ආනන්දයෙනි, එසේ වුවහොත් එය (ඡන්දය) තවදුරටත් නොපවතින්නක් නොව, පවතින්නක්ම වේ. ඡන්දයෙන්ම ඡන්දය ප්‍රහාණය කරන්නේය යනු විය නොහැක්කකි.’’\n\n‘‘එසේ නම් බ්‍රාහ්මණය, මේ කරුණ පිළිබඳව මම ඔබගෙන්ම යමක් විමසමි. ඔබට කැමති පරිදි එය පැහැදිලි කරන්න.’’\n\n‘‘බ්‍රාහ්මණය, ඔබ මේ ගැන කුමක් සිතනවාද? ‘ආරාමයට යමි’ කියා කලින් ඔබට ඡන්දයක් (කැමැත්තක්) තිබුණේ නැද්ද? එම ආරාමයට ගිය පසු ඒ ආශ්‍රිත වූ ඡන්දය සන්සිඳුණේ නැද්ද?’’ ‘‘එසේය, භවත්නි.’’\n\n‘‘‘ආරාමයට යමි’ කියා කලින් ඔබට වීර්යයක් (උත්සාහයක්) තිබුණේ නැද්ද? එම ආරාමයට ගිය පසු ඒ ආශ්‍රිත වූ වීර්යය සන්සිඳුණේ නැද්ද?’’ ‘‘එසේය, භවත්නි.’’\n\n‘‘‘ආරාමයට යමි’ කියා කලින් ඔබට සිතක් (අවධානයක්) තිබුණේ නැද්ද? එම ආරාමයට ගිය පසු ඒ ආශ්‍රිත වූ සිත සන්සිඳුණේ නැද්ද?’’ ‘‘එසේය, භවත්නි.’’\n\n‘‘‘ආරාමයට යමි’ කියා කලින් ඔබට විමසීමක් (විමංසාවක්) තිබුණේ නැද්ද? එම ආරාමයට ගිය පසු ඒ ආශ්‍රිත වූ විමසීම සන්සිඳුණේ නැද්ද?’’ ‘‘එසේය, භවත්නි.’’\n\n‘‘බ්‍රාහ්මණය, ඒ අයුරින්ම යම් භික්ෂුවක් රහත් වී කෙලෙස් ක්ෂය කර, බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කර, කළ යුතු සියලු දේ කර, බර පහකර, තමාගේ (අරහත්) අරමුණට පැමිණ, භව සංයෝජන ප්‍රහීණ කර, සම්‍යක් ඥානයෙන් (මනා අවබෝධයෙන්) විමුක්ත වී සිටින්නේද, ඔහුට රහත්භාවය ලැබීම පිණිස කලින් යම් ඡන්දයක් (ඇල්මක්) තිබුණේ නම්, රහත්භාවයට පත්වීමත් සමඟම ඒ ආශ්‍රිත වූ ඡන්දය සන්සිඳී යයි; රහත්භාවය ලැබීම පිණිස කලින් යම් වීර්යයක් තිබුණේ නම්, රහත්භාවයට පත්වීමත් සමඟම ඒ ආශ්‍රිත වූ වීර්යය සන්සිඳී යයි; රහත්භාවය ලැබීම පිණිස කලින් යම් සිතක් (අවධානයක්) තිබුණේ නම්, රහත්භාවයට පත්වීමත් සමඟම ඒ ආශ්‍රිත වූ සිත සන්සිඳී යයි; රහත්භාවය ලැබීම පිණිස කලින් යම් විමසීමක් (විමංසාවක්) තිබුණේ නම්, රහත්භාවයට පත්වීමත් සමඟම ඒ ආශ්‍රිත වූ විමසීම සන්සිඳී යයි.\n\n‘‘බ්‍රාහ්මණය, ඔබ මේ ගැන කුමක් සිතනවාද? මෙසේ වූ කල්හි, (ඡන්දය) තවදුරටත් පවතින්නක්ම වේද? නැතිනම් නොපවතින්නක් වේද?’’\n\n‘‘සැබැවින්ම, භවත් ආනන්දයෙනි, එසේ වුවහොත් එය (ඡන්දය) තවදුරටත් නොපවතින්නක්ම වේ. භවත් ආනන්දයෙනි, ඉතා මැනවි, භවත් ආනන්දයෙනි, ඉතා මැනවි! භවත් ආනන්දයෙනි, යම්සේ යමෙක් යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මඟ මුළා වූවෙකුට මඟ පෙන්වන්නේද, අඳුරෙහි තෙල් පහනක් දල්වන්නේද – (එවිට) ඇස් ඇත්තෝ රූප දකින්නාක් මෙන්; ඒ අයුරින්ම භවත් ආනන්ද ස්ථවිරයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය දේශනා කරන ලදී. භවත් ආනන්දයෙනි, මම භාග්‍යවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. භවත් ආනන්ද ස්ථවිරයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Uṇṇābhabrāhmaṇasuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 828,
      "pali": "‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā ahesuṃ mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā bhavissanti mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā mahiddhikā mahānubhāvā, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā ahesuṃ mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā mahiddhikā bhavissanti mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā mahiddhikā mahānubhāvā, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Chaṭṭhaṃ.",
      "english": "Indeed, monks, any recluses or brahmins who in the past were greatly powerful and influential, all of them were so because they had developed and repeatedly practiced the four bases of spiritual power. Indeed, monks, any recluses or brahmins who in the future will be greatly powerful and influential, all of them will be so because they will have developed and repeatedly practiced the four bases of spiritual power. Indeed, monks, any recluses or brahmins who at present are greatly powerful and influential, all of them are so because they have developed and repeatedly practiced the four bases of spiritual power.\n\nWhich four are these? Here, monks, a monastic develops the base of spiritual power endowed with concentration due to aspiration, along with the volitional formations of striving. He develops the base of spiritual power endowed with concentration due to energy, along with the volitional formations of striving. He develops the base of spiritual power endowed with concentration due to mind, along with the volitional formations of striving. He develops the base of spiritual power endowed with concentration due to investigation, along with the volitional formations of striving. Indeed, monks, any recluses or brahmins who in the past were greatly powerful and influential, all of them were so because they had developed and repeatedly practiced these very four bases of spiritual power. Indeed, monks, any recluses or brahmins who in the future will be greatly powerful and influential, all of them will be so because they will have developed and repeatedly practiced these very four bases of spiritual power. Indeed, monks, any recluses or brahmins who at present are greatly powerful and influential, all of them are so because they have developed and repeatedly practiced these very four bases of spiritual power.",
      "sinhala": "මහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ අතීත කාලයෙහි මහා ඍද්ධි ඇතිව, මහා ආනුභාව ඇතිව සිටියාහුද, ඒ සියලු දෙනාම සිව් ඉර්ධිපාදයන් වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද හේතුවෙන්ය.\n\nමහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ අනාගත කාලයෙහි මහා ඍද්ධි ඇතිව, මහා ආනුභාව ඇතිව වන්නාහුද, ඒ සියලු දෙනාම සිව් ඉර්ධිපාදයන් වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද හේතුවෙන්ය.\n\nමහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ වර්තමාන කාලයෙහි මහා ඍද්ධි ඇතිව, මහා ආනුභාව ඇතිව සිටින්නාහුද, ඒ සියලු දෙනාම සිව් ඉර්ධිපාදයන් වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද හේතුවෙන්ය.\n\nමොනවාද ඒ සිව් ඉර්ධිපාදයෝ?\n\nමහණෙනි, මෙහිලා භික්ෂුව ඡන්දයෙන් යුක්ත වූ සමාධිය හා වීර්යය සංස්කාරයන්ගෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි. වීර්යයෙන් යුක්ත වූ සමාධිය හා වීර්යය සංස්කාරයන්ගෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි. සිතින් යුක්ත වූ සමාධිය හා වීර්යය සංස්කාරයන්ගෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි. විමර්ශනයෙන් යුක්ත වූ සමාධිය හා වීර්යය සංස්කාරයන්ගෙන් යුක්ත වූ ඉර්ධිපාදය වඩයි.\n\nමහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ අතීත කාලයෙහි මහා ඍද්ධි ඇතිව, මහා ආනුභාව ඇතිව සිටියාහුද, ඒ සියලු දෙනාම මේ සිව් ඉර්ධිපාදයන්ම වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද හේතුවෙන්ය.\n\nමහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ අනාගත කාලයෙහි මහා ඍද්ධි ඇතිව, මහා ආනුභාව ඇතිව වන්නාහුද, ඒ සියලු දෙනාම මේ සිව් ඉර්ධිපාදයන්ම වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද හේතුවෙන්ය.\n\nමහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ වර්තමාන කාලයෙහි මහා ඍද්ධි ඇතිව, මහා ආනුභාව ඇතිව සිටින්නාහුද, ඒ සියලු දෙනාම මේ සිව් ඉර්ධිපාදයන්ම වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද හේතුවෙන්ය.",
      "paliTitle": "Paṭhamasamaṇabrāhmaṇasuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 829,
      "pali": "‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhosuṃ – ekopi hutvā bahudhā ahesuṃ, bahudhāpi hutvā eko ahesuṃ; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā agamaṃsu, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ akaṃsu, seyyathāpi udake; udakepi abhijjamāne [abhijjamānā (sī. pī. ka.)] agamaṃsu, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamiṃsu, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasiṃsu [parāmasiṃsu (syā. kaṃ. ka.)] parimajjiṃsu; yāva brahmalokāpi kāyena vasaṃ vattesuṃ, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhossanti – ekopi hutvā bahudhā bhavissanti, bahudhāpi hutvā eko bhavissanti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā gamissanti, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karissanti, seyyathāpi udake; udakepi abhijjamāne gamissanti, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamissanti, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasissanti parimajjissanti; yāva brahmalokāpi kāyena vasaṃ vattissanti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Ye hi keci, bhikkhave, etarahi samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhonti – ekopi hutvā bahudhā honti, bahudhāpi hutvā eko honti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānā gacchanti, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karonti, seyyathāpi udake; udakepi abhijjamāne gacchanti, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamanti, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasanti [parāmasanti (syā. kaṃ.)] parimajjanti; yāva brahmalokāpi kāyena vasaṃ vattenti, sabbe te catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattāti. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Ye hi keci, bhikkhave, atītamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhosuṃ – ekopi hutvā bahudhā ahesuṃ…pe… yāva brahmalokāpi kāyena vasaṃ vattesuṃ, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Ye hi keci, bhikkhave, anāgatamaddhānaṃ samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhossanti – ekopi hutvā bahudhā bhavissanti…pe… yāva brahmalokāpi kāyena vasaṃ vattissanti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā. ‘‘Ye hi keci bhikkhave etarahi samaṇā vā brāhmaṇā vā anekavihitaṃ iddhividhaṃ paccanubhonti – ekopi hutvā bahudhā honti…pe… yāva brahmalokāpi kāyena vasaṃ vattenti, sabbe te imesaṃyeva catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā’’ti. Sattamaṃ.",
      "english": "Indeed, bhikkhus, whatever recluses or brahmins in the past experienced various kinds of supernormal power – being one, they became many; being many, they became one; they appeared and vanished; they went unimpeded through walls, ramparts, and mountains, as if through space; they dived in and out of the earth, as if in water; they walked on water without sinking, as if on land; they traveled through the air, sitting cross-legged, as if a winged bird; they touched and stroked with their hands these moon and sun, so mighty, so powerful; they exercised mastery with their body even as far as the Brahma-world – all of them did so because they had developed and frequently practiced the four bases of supernormal power.\n\nIndeed, bhikkhus, whatever recluses or brahmins in the future will experience various kinds of supernormal power – being one, they will become many; being many, they will become one; they will appear and vanish; they will go unimpeded through walls, ramparts, and mountains, as if through space; they will dive in and out of the earth, as if in water; they will walk on water without sinking, as if on land; they will travel through the air, sitting cross-legged, as if a winged bird; they will touch and stroke with their hands these moon and sun, so mighty, so powerful; they will exercise mastery with their body even as far as the Brahma-world – all of them will do so because they will have developed and frequently practiced the four bases of supernormal power.\n\nIndeed, bhikkhus, whatever recluses or brahmins at present experience various kinds of supernormal power – being one, they become many; being many, they become one; they appear and vanish; they go unimpeded through walls, ramparts, and mountains, as if through space; they dive in and out of the earth, as if in water; they walk on water without sinking, as if on land; they travel through the air, sitting cross-legged, as if a winged bird; they touch and stroke with their hands these moon and sun, so mighty, so powerful; they exercise mastery with their body even as far as the Brahma-world – all of them do so because they have developed and frequently practiced the four bases of supernormal power.\n\nWhich are these four? Here, bhikkhus, a bhikkhu develops the basis of supernormal power endowed with concentration due to aspiration and volitional formations of striving; develops the basis of supernormal power endowed with concentration due to energy and volitional formations of striving; develops the basis of supernormal power endowed with concentration due to mind and volitional formations of striving; develops the basis of supernormal power endowed with concentration due to investigation and volitional formations of striving.\n\nIndeed, bhikkhus, whatever recluses or brahmins in the past experienced various kinds of supernormal power – being one, they became many; being many, they became one; they appeared and vanished; they went unimpeded through walls, ramparts, and mountains, as if through space; they dived in and out of the earth, as if in water; they walked on water without sinking, as if on land; they traveled through the air, sitting cross-legged, as if a winged bird; they touched and stroked with their hands these moon and sun, so mighty, so powerful; they exercised mastery with their body even as far as the Brahma-world – all of them did so because they had developed and frequently practiced these very four bases of supernormal power.\n\nIndeed, bhikkhus, whatever recluses or brahmins in the future will experience various kinds of supernormal power – being one, they will become many; being many, they will become one; they will appear and vanish; they will go unimpeded through walls, ramparts, and mountains, as if through space; they will dive in and out of the earth, as if in water; they will walk on water without sinking, as if on land; they will travel through the air, sitting cross-legged, as if a winged bird; they will touch and stroke with their hands these moon and sun, so mighty, so powerful; they will exercise mastery with their body even as far as the Brahma-world – all of them will do so because they will have developed and frequently practiced these very four bases of supernormal power.\n\nIndeed, bhikkhus, whatever recluses or brahmins at present experience various kinds of supernormal power – being one, they become many; being many, they become one; they appear and vanish; they go unimpeded through walls, ramparts, and mountains, as if through space; they dive in and out of the earth, as if in water; they walk on water without sinking, as if on land; they travel through the air, sitting cross-legged, as if a winged bird; they touch and stroke with their hands these moon and sun, so mighty, so powerful; they exercise mastery with their body even as far as the Brahma-world – all of them do so because they have developed and frequently practiced these very four bases of supernormal power.",
      "sinhala": "මහණෙනි, අතීත කාලයෙහි යම් කිසි ශ්‍රමණ‍ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ නොයෙක් ආකාර වූ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දැක්කාහු ද, එනම්: එකෙක්ව සිට බොහෝ දෙනෙක් වූවාහු ද, බොහෝ දෙනෙක්ව සිට එකෙක් වූවාහු ද; ප්‍රකට වීම්, නොපෙනී යෑම් ද; පහසින් තොරව බිත්ති අතරින් ද, ප්‍රාකාර අතරින් ද, පර්වත අතරින් ද අහසෙහි මෙන් ගමන් කළාහු ද; පොළොවෙහි ද ජලයෙහි මෙන් මතුවීම්, කිඳාබැසීම් කළාහු ද; ජලයෙහි ද පොළොවෙහි මෙන් නොබිඳී ගමන් කළාහු ද; අහසෙහි ද පියාපත් ඇති පක්ෂියකු මෙන් පලක් බැඳගෙන ගමන් කළාහු ද; මේ තරම් මහා ඍද්ධි ඇති, මේ තරම් මහා ආනුභාව ඇති හඳ හිරු ද අතින් ස්පර්ශ කළාහු ද, පිරිමැද්දාහු ද; බ්‍රහ්ම ලෝකය දක්වා ද කයින් වශයෙහි පැවැත්වූවාහු ද, ඒ සියල්ලෝම සිව් ඉර්ධිපාදයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් එසේ කළාහු වෙති.\n\nමහණෙනි, අනාගත කාලයෙහි යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ නොයෙක් ආකාර වූ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දකින්නාහු ද, එනම්: එකෙක්ව සිට බොහෝ දෙනෙක් වන්නාහු ද, බොහෝ දෙනෙක්ව සිට එකෙක් වන්නාහු ද; ප්‍රකට වීම්, නොපෙනී යෑම් ද; පහසින් තොරව බිත්ති අතරින් ද, ප්‍රාකාර අතරින් ද, පර්වත අතරින් ද අහසෙහි මෙන් ගමන් කරන්නාහු ද; පොළොවෙහි ද ජලයෙහි මෙන් මතුවීම්, කිඳාබැසීම් කරන්නාහු ද; ජලයෙහි ද පොළොවෙහි මෙන් නොබිඳී ගමන් කරන්නාහු ද; අහසෙහි ද පියාපත් ඇති පක්ෂියකු මෙන් පලක් බැඳගෙන ගමන් කරන්නාහු ද; මේ තරම් මහා ඍද්ධි ඇති, මේ තරම් මහා ආනුභාව ඇති හඳ හිරු ද අතින් ස්පර්ශ කරන්නාහු ද, පිරිමදින්නාහු ද; බ්‍රහ්ම ලෝකය දක්වා ද කයින් වශයෙහි පවත්වන්නාහු ද, ඒ සියල්ලෝම සිව් ඉර්ධිපාදයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් එසේ කරන්නාහු වෙති.\n\nමහණෙනි, වර්තමාන කාලයෙහි යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ නොයෙක් ආකාර වූ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දකින්නාහු ද, එනම්: එකෙක්ව සිට බොහෝ දෙනෙක් වන්නාහු ද, බොහෝ දෙනෙක්ව සිට එකෙක් වන්නාහු ද; ප්‍රකට වීම්, නොපෙනී යෑම් ද; පහසින් තොරව බිත්ති අතරින් ද, ප්‍රාකාර අතරින් ද, පර්වත අතරින් ද අහසෙහි මෙන් ගමන් කරන්නාහු ද; පොළොවෙහි ද ජලයෙහි මෙන් මතුවීම්, කිඳාබැසීම් කරන්නාහු ද; ජලයෙහි ද පොළොවෙහි මෙන් නොබිඳී ගමන් කරන්නාහු ද; අහසෙහි ද පියාපත් ඇති පක්ෂියකු මෙන් පලක් බැඳගෙන ගමන් කරන්නාහු ද; මේ තරම් මහා ඍද්ධි ඇති, මේ තරම් මහා ආනුභාව ඇති හඳ හිරු ද අතින් ස්පර්ශ කරන්නාහු ද, පිරිමදින්නාහු ද; බ්‍රහ්ම ලෝකය දක්වා ද කයින් වශයෙහි පවත්වන්නාහු ද, ඒ සියල්ලෝම සිව් ඉර්ධිපාදයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් එසේ කරන්නාහු වෙති.\n\nඑම සිව් ඉර්ධිපාදයෝ කවරහු ද? මහණෙනි, මෙහි භික්ෂුව ඡන්දසමාධි ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි. වීර්යසමාධි ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි. චිත්තසමාධි ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි. විමංසාසමාධි ප්‍රධාන සංස්කාරයෙන් යුක්ත ඉර්ධිපාදය වඩයි.\n\nමහණෙනි, අතීත කාලයෙහි යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ නොයෙක් ආකාර වූ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දැක්කාහු ද – එකෙක්ව සිට බොහෝ දෙනෙක් වූවාහු ද, යනාදී වශයෙන් බ්‍රහ්ම ලෝකය දක්වා ද කයින් වශයෙහි පැවැත්වූවාහු ද, ඒ සියල්ලෝම මේ සිව් ඉර්ධිපාදයන්ම වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් එසේ කළාහු වෙති.\n\nමහණෙනි, අනාගත කාලයෙහි යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ නොයෙක් ආකාර වූ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දකින්නාහු ද – එකෙක්ව සිට බොහෝ දෙනෙක් වන්නාහු ද, යනාදී වශයෙන් බ්‍රහ්ම ලෝකය දක්වා ද කයින් වශයෙහි පවත්වන්නාහු ද, ඒ සියල්ලෝම මේ සිව් ඉර්ධිපාදයන්ම වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් එසේ කරන්නාහු වෙති.\n\nමහණෙනි, වර්තමාන කාලයෙහි යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ නොයෙක් ආකාර වූ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දකින්නාහු ද – එකෙක්ව සිට බොහෝ දෙනෙක් වන්නාහු ද, යනාදී වශයෙන් බ්‍රහ්ම ලෝකය දක්වා ද කයින් වශයෙහි පවත්වන්නාහු ද, ඒ සියල්ලෝම මේ සිව් ඉර්ධිපාදයන්ම වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් එසේ කරන්නාහු වෙති.",
      "paliTitle": "Dutiyasamaṇabrāhmaṇasuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 830,
      "pali": "‘‘Catunnaṃ, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, it is by developing and repeatedly cultivating the four bases of spiritual power that a monk, through the destruction of the taints, having realized for himself with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, enters upon and dwells therein.\n\nWhich four? Here, monks, a monk develops the base of spiritual power endowed with concentration due to aspiration and the volitional formations of striving; he develops the base of spiritual power endowed with concentration due to energy and the volitional formations of striving; he develops the base of spiritual power endowed with concentration due to mind and the volitional formations of striving; he develops the base of spiritual power endowed with concentration due to investigation and the volitional formations of striving.\n\nIt is by developing and repeatedly cultivating these four bases of spiritual power, monks, that a monk, through the destruction of the taints, having realized for himself with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, enters upon and dwells therein.",
      "sinhala": "භික්ෂූනි, සතර ඍද්ධිපාදයන් මනාව වඩන ලද නිසාත්, බහුල වශයෙන් පුරුදු කරන ලද නිසාත් භික්ෂුව ආස්‍රවයන්ගේ ක්ෂය වීමෙන් ආස්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, එළඹ වාසය කරයි.\n\nකවර සතරක්ද? භික්ෂූනි, මෙහිලා භික්ෂුව ඡන්දය (කැමැත්ත) හේතුකොට ඇති සමාධියත්, ප්‍රධාන සංස්කාරයත් යන අංගයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. වීර්යය හේතුකොට ඇති සමාධියත්, ප්‍රධාන සංස්කාරයත් යන අංගයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. චිත්තය (සිත) හේතුකොට ඇති සමාධියත්, ප්‍රධාන සංස්කාරයත් යන අංගයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. විමංසා (ප්‍රඥාව) හේතුකොට ඇති සමාධියත්, ප්‍රධාන සංස්කාරයත් යන අංගයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි.\n\nභික්ෂූනි, මේ සතර ඍද්ධිපාදයන් මනාව වඩන ලද නිසාත්, බහුල වශයෙන් පුරුදු කරන ලද නිසාත් භික්ෂුව ආස්‍රවයන්ගේ ක්ෂය වීමෙන් ආස්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයෙහිදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, එළඹ වාසය කරයි.",
      "paliTitle": "Bhikkhusuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 831,
      "pali": "‘‘Iddhiṃ vo, bhikkhave, desessāmi iddhipādañca iddhipādabhāvanañca iddhipādabhāvanāgāminiñca paṭipadaṃ. Taṃ suṇātha. ‘‘Katamā ca, bhikkhave, iddhi? Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccati, bhikkhave, iddhi. ‘‘Katamo ca, bhikkhave, iddhipādo? Yo so, bhikkhave, maggo yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccati, bhikkhave, iddhipādo. ‘‘Katamā ca, bhikkhave, iddhipādabhāvanā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccati, bhikkhave, iddhipādabhāvanā. ‘‘Katamā ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi – ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Navamaṃ.",
      "english": "Monks, I will teach you about spiritual power, the basis for spiritual power, the development of the basis for spiritual power, and the path leading to the development of the basis for spiritual power. Listen carefully to this.\n\nAnd what, monks, is spiritual power? Here, monks, a monk experiences various kinds of spiritual power: being one, he becomes many; having become many, he again becomes one... He wields mastery with his body even over the Brahma world. This, monks, is called spiritual power.\n\nAnd what, monks, is the basis for spiritual power? That path, monks, that way of practice which leads to the acquisition and attainment of spiritual power—this, monks, is called the basis for spiritual power.\n\nAnd what, monks, is the development of the basis for spiritual power? Here, monks, a monk develops the basis for spiritual power, endowed with concentration arisen from zeal and accompanied by the volitional formations of striving. He develops the basis for spiritual power, endowed with concentration arisen from energy and accompanied by the volitional formations of striving. He develops the basis for spiritual power, endowed with concentration arisen from mind and accompanied by the volitional formations of striving. He develops the basis for spiritual power, endowed with concentration arisen from investigation and accompanied by the volitional formations of striving. This, monks, is called the development of the basis for spiritual power.\n\nAnd what, monks, is the path leading to the development of the basis for spiritual power? It is this Noble Eightfold Path itself, namely: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. This, monks, is called the path leading to the development of the basis for spiritual power.",
      "sinhala": "මහණෙනි, මම ඔබට ඍද්ධියද, ඍද්ධිපාදද, ඍද්ධිපාද භාවනාවද, ඍද්ධිපාද භාවනාවට පමුණුවන ප‍්‍රතිපදාවද දේශනා කරන්නෙමි. එය ශ‍්‍රවණය කරන්න.\n\nමහණෙනි, ඍද්ධිය නම් කුමක්ද? මහණෙනි, මෙහිලා භික්ෂුවක් නොයෙක් ආකාර වූ ඍද්ධිවිධයන් අත්දක්වයි. එනම්: තනිව සිටියදී බොහෝ දෙනකු වන්නේය, බොහෝ දෙනකු වී සිටියදී තනි වන්නේය... බ්‍රහ්ම ලෝකය දක්වාද කයින් වසඟය පවත්වන්නේය. මහණෙනි, මෙය ඍද්ධිය යැයි කියනු ලැබේ.\n\nමහණෙනි, ඍද්ධිපාද නම් කුමක්ද? මහණෙනි, යම් ඒ මාර්ගයක්, යම් ඒ ප‍්‍රතිපදාවක් ඍද්ධිය ලැබීම පිණිස, ඍද්ධිය සාක්ෂාත් කිරීම පිණිස පවතීද, මහණෙනි, මෙය ඍද්ධිපාද යැයි කියනු ලැබේ.\n\nමහණෙනි, ඍද්ධිපාද භාවනාව නම් කුමක්ද? මහණෙනි, මෙහිලා භික්ෂුවක් ඡන්දය, සමාධිය සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. වීර්යය, සමාධිය සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. චිත්තය, සමාධිය සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. විමංසාව, සමාධිය සහ ප‍්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. මහණෙනි, මෙය ඍද්ධිපාද භාවනාව යැයි කියනු ලැබේ.\n\nමහණෙනි, ඍද්ධිපාද භාවනාවට පමුණුවන ප‍්‍රතිපදාව නම් කුමක්ද? එනම්, මේ ආර්ය අෂ්ටාංගික මාර්ගයමය. ඒ කෙසේද යත් – සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යනුයි. මහණෙනි, මෙය ඍද්ධිපාද භාවනාවට පමුණුවන ප‍්‍රතිපදාව යැයි කියනු ලැබේ.",
      "paliTitle": "Iddhādidesanāsuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 832,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā’’. ‘‘Kathaṃ bhāvitā ca, bhikkhave, cattāro iddhipādā kathaṃ bahulīkatā mahapphalā honti mahānisaṃsā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Katamo ca, bhikkhave, atilīno chando? Yo, bhikkhave, chando kosajjasahagato kosajjasampayutto – ayaṃ vuccati, bhikkhave, atilīno chando. ‘‘Katamo ca, bhikkhave, atippaggahito chando? Yo, bhikkhave, chando uddhaccasahagato uddhaccasampayutto – ayaṃ vuccati, bhikkhave, atippaggahito chando. ‘‘Katamo ca, bhikkhave, ajjhattaṃ saṃkhitto chando? Yo, bhikkhave, chando thinamiddhasahagato thinamiddhasampayutto – ayaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhitto chando. ‘‘Katamo ca, bhikkhave, bahiddhā vikkhitto chando? Yo, bhikkhave, chando bahiddhā pañca kāmaguṇe ārabbha anuvikkhitto anuvisaṭo – ayaṃ vuccati, bhikkhave, bahiddhā vikkhitto chando. ‘‘Kathañca, bhikkhave, bhikkhu pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure? Idha, bhikkhave, bhikkhuno pacchāpuresaññā suggahitā hoti sumanasikatā sūpadhāritā suppaṭividdhā paññāya. Evaṃ kho, bhikkhave, bhikkhu pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure. ‘‘Kathañca, bhikkhave, bhikkhu yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho viharati? Idha, bhikkhave, bhikkhu imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco maṃsaṃ nhāru aṭṭhi aṭṭhimiñjaṃ vakkaṃ hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ antaṃ antaguṇaṃ udariyaṃ karīsaṃ pittaṃ semhaṃ pubbo lohitaṃ sedo medo assu vasā kheḷo siṅghāṇikā lasikā mutta’nti. Evaṃ kho, bhikkhave, bhikkhu yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho viharati. ‘‘Kathañca, bhikkhave, bhikkhu yathā divā tathā rattiṃ, yathā rattiṃ tathā divā viharati? Idha, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi divā chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, so tehi ākārehi tehi liṅgehi tehi nimittehi rattiṃ chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti; yehi vā pana ākārehi yehi liṅgehi yehi nimittehi rattiṃ chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, so tehi ākārehi tehi liṅgehi tehi nimittehi divā chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Evaṃ kho, bhikkhave, bhikkhu yathā divā tathā rattiṃ, yathā rattiṃ tathā divā viharati. ‘‘Kathañca, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti? Idha, bhikkhave, bhikkhuno ālokasaññā suggahitā hoti divāsaññā svādhiṭṭhitā. Evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Katamañca, bhikkhave, atilīnaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ kosajjasahagataṃ kosajjasampayuttaṃ – idaṃ vuccati, bhikkhave, atilīnaṃ vīriyaṃ. ‘‘Katamañca, bhikkhave, atippaggahitaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ uddhaccasahagataṃ uddhaccasampayuttaṃ – idaṃ vuccati, bhikkhave, atippaggahitaṃ vīriyaṃ. ‘‘Katamañca, bhikkhave, ajjhattaṃ saṃkhittaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ thinamiddhasahagataṃ thinamiddhasampayuttaṃ – idaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhittaṃ vīriyaṃ. ‘‘Katamañca, bhikkhave, bahiddhā vikkhittaṃ vīriyaṃ? Yaṃ, bhikkhave, vīriyaṃ bahiddhā pañca kāmaguṇe ārabbha anuvikkhittaṃ anuvisaṭaṃ – idaṃ vuccati, bhikkhave, bahiddhā vikkhittaṃ vīriyaṃ…pe…. ‘‘Kathañca, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti? Idha, bhikkhave, bhikkhuno ālokasaññā suggahitā hoti divāsaññā svādhiṭṭhitā. Evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Katamañca, bhikkhave, atilīnaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ kosajjasahagataṃ kosajjasampayuttaṃ – idaṃ vuccati, bhikkhave, atilīnaṃ cittaṃ. ‘‘Katamañca, bhikkhave, atippaggahitaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ uddhaccasahagataṃ uddhaccasampayuttaṃ – idaṃ vuccati, bhikkhave, atippaggahitaṃ cittaṃ. ‘‘Katamañca, bhikkhave, ajjhattaṃ saṃkhittaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ thinamiddhasahagataṃ thinamiddhasampayuttaṃ – idaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhittaṃ cittaṃ. ‘‘Katamañca, bhikkhave, bahiddhā vikkhittaṃ cittaṃ? Yaṃ, bhikkhave, cittaṃ bahiddhā pañca kāmaguṇe ārabbha anuvikkhittaṃ anuvisaṭaṃ – idaṃ vuccati, bhikkhave, bahiddhā vikkhittaṃ cittaṃ… pe… evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Katamā ca, bhikkhave, atilīnā vīmaṃsā? Yā, bhikkhave, vīmaṃsā kosajjasahagatā kosajjasampayuttā – ayaṃ vuccati, bhikkhave, atilīnā vīmaṃsā. ‘‘Katamā ca, bhikkhave, atippaggahitā vīmaṃsā? Yā, bhikkhave, vīmaṃsā uddhaccasahagatā uddhaccasampayuttā – ayaṃ vuccati, bhikkhave, atippaggahitā vīmaṃsā. ‘‘Katamā ca, bhikkhave, ajjhattaṃ saṃkhittā vīmaṃsā? Yā, bhikkhave, vīmaṃsā thinamiddhasahagatā thinamiddhasampayuttā – ayaṃ vuccati, bhikkhave, ajjhattaṃ saṃkhittā vīmaṃsā. ‘‘Katamā ca, bhikkhave, bahiddhā vikkhittā vīmaṃsā? Yā, bhikkhave, vīmaṃsā bahiddhā pañca kāmaguṇe ārabbha anuvikkhittā anuvisaṭā – ayaṃ vuccati, bhikkhave, bahiddhā vikkhittā vīmaṃsā… pe… evaṃ kho, bhikkhave, bhikkhu vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Evaṃ bhāvitā kho, bhikkhave, cattāro iddhipādā evaṃ bahulīkatā mahapphalā honti mahānisaṃsā. ‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dasamaṃ. Pāsādakampanavaggo dutiyo. Tassuddānaṃ – Pubbaṃ mahapphalaṃ chandaṃ, moggallānañca uṇṇābhaṃ; Dve samaṇabrāhmaṇā bhikkhu, desanā vibhaṅgena cāti.",
      "english": "“Monks, these four bases of spiritual power, when developed and repeatedly practiced, are of great fruit and great benefit.” “And how, monks, are these four bases of spiritual power developed and repeatedly practiced so that they become of great fruit and great benefit? Here, monks, a monk develops the base of spiritual power endowed with concentration born of desire, together with the volitional formations of exertion, thinking: ‘My desire will not be too slack, nor too overstrained, nor inwardly constricted, nor outwardly dispersed.’ And he dwells with the perception of ‘before and after’: ‘Just as it is before, so it is after; just as it is after, so it is before. Just as it is below, so it is above; just as it is above, so it is below. Just as it is by day, so it is by night; just as it is by night, so it is by day.’ Thus, he develops a mind that is open, unconstrained, and luminous. He develops the base of spiritual power endowed with concentration born of energy, together with the volitional formations of exertion. He develops the base of spiritual power endowed with concentration born of mind, together with the volitional formations of exertion. He develops the base of spiritual power endowed with concentration born of investigation, together with the volitional formations of exertion, thinking: ‘My investigation will not be too slack, nor too overstrained, nor inwardly constricted, nor outwardly dispersed.’ And he dwells with the perception of ‘before and after’: ‘Just as it is before, so it is after; just as it is after, so it is before. Just as it is below, so it is above; just as it is above, so it is below. Just as it is by day, so it is by night; just as it is by night, so it is by day.’ Thus, he develops a mind that is open, unconstrained, and luminous.\n\n“And what, monks, is slack desire? Monks, any desire accompanied by laziness, associated with laziness—this is called slack desire.\n\n“And what, monks, is overstrained desire? Monks, any desire accompanied by restlessness, associated with restlessness—this is called overstrained desire.\n\n“And what, monks, is inwardly constricted desire? Monks, any desire accompanied by sloth and torpor, associated with sloth and torpor—this is called inwardly constricted desire.\n\n“And what, monks, is outwardly dispersed desire? Monks, any desire that is outwardly dispersed and scattered, focused on the five strands of sensual pleasure—this is called outwardly dispersed desire.\n\n“And how, monks, does a monk abide with the perception of ‘before and after’: ‘Just as it is before, so it is after; just as it is after, so it is before’? Here, monks, the perception of ‘before and after’ for a monk is well-grasped, well-attended to, well-sustained, and well-penetrated by wisdom. That is how, monks, a monk abides with the perception of ‘before and after’: ‘Just as it is before, so it is after; just as it is after, so it is before.’\n\n“And how, monks, does a monk abide ‘just as it is below, so it is above; just as it is above, so it is below’? Here, monks, a monk reviews this very body, from the soles of the feet upwards, from the tips of the hair downwards, enclosed by skin, full of various kinds of impurity, thus: ‘In this body there are hair, body-hair, nails, teeth, skin, flesh, sinews, bones, bone-marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, intestinal mesentery, stomach, faeces, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, mucus, joint-fluid, urine.’ That is how, monks, a monk abides ‘just as it is below, so it is above; just as it is above, so it is below.’\n\n“And how, monks, does a monk abide ‘just as it is by day, so it is by night; just as it is by night, so it is by day’? Here, monks, the monk who develops the base of spiritual power endowed with concentration born of desire, together with the volitional formations of exertion, by day, with those same aspects, characteristics, and signs, develops that base of spiritual power by night. Or, with whichever aspects, characteristics, and signs he develops the base of spiritual power endowed with concentration born of desire, together with the volitional formations of exertion, by night, with those same aspects, characteristics, and signs he develops that base of spiritual power by day. That is how, monks, a monk abides ‘just as it is by day, so it is by night; just as it is by night, so it is by day.’\n\n“And how, monks, does a monk develop a mind that is open, unconstrained, and luminous? Here, monks, the perception of light for a monk is well-grasped, and the perception of day is well-established. That is how, monks, a monk develops a mind that is open, unconstrained, and luminous.\n\n“And what, monks, is slack energy? Monks, any energy accompanied by laziness, associated with laziness—this is called slack energy.\n\n“And what, monks, is overstrained energy? Monks, any energy accompanied by restlessness, associated with restlessness—this is called overstrained energy.\n\n“And what, monks, is inwardly constricted energy?\n\nMonks, that energy which is accompanied by sloth and torpor, connected with sloth and torpor—this, Monks, is called internally contracted energy. And what, Monks, is externally dispersed energy? Monks, that energy which, concerning the five cords of sensual pleasure, is externally dispersed and scattered—this, Monks, is called externally dispersed energy. And how, Monks, does a monk, with an open mind, an unhindered mind, develop a mind that is radiant? Here, Monks, for a monk, the perception of light is well-grasped, and the perception of day is well-established. Thus, Monks, a monk, with an open mind, an unhindered mind, develops a mind that is radiant.\n\nAnd what, Monks, is an overly sluggish mind? Monks, that mind which is accompanied by idleness, connected with idleness—this, Monks, is called an overly sluggish mind. And what, Monks, is an overly agitated mind? Monks, that mind which is accompanied by restlessness, connected with restlessness—this, Monks, is called an overly agitated mind. And what, Monks, is an internally contracted mind? Monks, that mind which is accompanied by sloth and torpor, connected with sloth and torpor—this, Monks, is called an internally contracted mind. And what, Monks, is an externally dispersed mind? Monks, that mind which, concerning the five cords of sensual pleasure, is externally dispersed and scattered—this, Monks, is called an externally dispersed mind. Thus, Monks, a monk, with an open mind, an unhindered mind, develops a mind that is radiant.\n\nAnd what, Monks, is overly sluggish investigation? Monks, that investigation which is accompanied by idleness, connected with idleness—this, Monks, is called an overly sluggish investigation. And what, Monks, is overly agitated investigation? Monks, that investigation which is accompanied by restlessness, connected with restlessness—this, Monks, is called an overly agitated investigation. And what, Monks, is internally contracted investigation? Monks, that investigation which is accompanied by sloth and torpor, connected with sloth and torpor—this, Monks, is called an internally contracted investigation. And what, Monks, is externally dispersed investigation? Monks, that investigation which, concerning the five cords of sensual pleasure, is externally dispersed and scattered—this, Monks, is called an externally dispersed investigation. Thus, Monks, a monk, with an open mind, an unhindered mind, develops a mind that is radiant.\n\nMonks, when the four bases of spiritual power are thus developed and thus frequently practiced, they are of great fruit and great benefit.\n\nMonks, when a monk has thus developed and frequently practiced these four bases of spiritual power, he experiences various kinds of supernormal powers, such as being one, he becomes many; being many, he becomes one; and he exercises mastery with his body even over the Brahma world. Monks, when a monk has thus developed and frequently practiced these four bases of spiritual power, with the destruction of the taints, he directly knows, realizes for himself, and enters upon the taintless liberation of mind and liberation by wisdom in this very life, and dwells therein.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ඉර්ධිපාද සතර වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහාඵලදායක වෙයි, මහානිසංසදායක වෙයි. භික්ෂූන් වහන්ස, ඉර්ධිපාද සතර කෙසේ වඩන ලද්දේ ද, කෙසේ බහුල වශයෙන් පුරුදු කරන ලද්දේ ද මහාඵලදායක වෙයි ද, මහානිසංසදායක වෙයි ද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුව ඡන්දය (නිවන් ලැබීමට ඇති කැමැත්ත) මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි – ‘මාගේ ඡන්දය අධික ලෙස පසුබට නොවන්නේ ය, අධික ලෙස උත්සාහවත් නොවන්නේ ය, ඇතුළතට හැකිලී නොපවතිනු ඇත, පිටතට විසිරී නොපවතිනු ඇත’ යනුවෙනි. ඔහු පෙර පසු දැනීමෙන් යුක්තව වාසය කරයි – ‘පෙර පැවැත්තාක් මෙන් ම පසු ව ද, පසු ව පැවැත්තාක් මෙන් ම පෙර ද; යට පැවැත්තාක් මෙන් ම උඩ ද, උඩ පැවැත්තාක් මෙන් ම යට ද; දවල් පැවැත්තාක් මෙන් ම රාත්‍රී ව ද, රාත්‍රී ව පැවැත්තාක් මෙන් ම දවල් ද’ යනුවෙනි. මෙසේ විවෘත වූ සිතකින්, සීමා නොකළා වූ සිතකින්, ප්‍රභාස්වර සිතක් වඩයි.\n\nවීර්යය මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි – ‘මාගේ වීර්යය අධික ලෙස පසුබට නොවන්නේ ය, අධික ලෙස උත්සාහවත් නොවන්නේ ය, ඇතුළතට හැකිලී නොපවතිනු ඇත, පිටතට විසිරී නොපවතිනු ඇත’ යනුවෙනි. ඔහු පෙර පසු දැනීමෙන් යුක්තව වාසය කරයි – ‘පෙර පැවැත්තාක් මෙන් ම පසු ව ද, පසු ව පැවැත්තාක් මෙන් ම පෙර ද; යට පැවැත්තාක් මෙන් ම උඩ ද, උඩ පැවැත්තාක් මෙන් ම යට ද; දවල් පැවැත්තාක් මෙන් ම රාත්‍රී ව ද, රාත්‍රී ව පැවැත්තාක් මෙන් ම දවල් ද’ යනුවෙනි. මෙසේ විවෘත වූ සිතකින්, සීමා නොකළා වූ සිතකින්, ප්‍රභාස්වර සිතක් වඩයි.\n\nචිත්තය (සිත) මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි – ‘මාගේ චිත්තය අධික ලෙස පසුබට නොවන්නේ ය, අධික ලෙස උත්සාහවත් නොවන්නේ ය, ඇතුළතට හැකිලී නොපවතිනු ඇත, පිටතට විසිරී නොපවතිනු ඇත’ යනුවෙනි. ඔහු පෙර පසු දැනීමෙන් යුක්තව වාසය කරයි – ‘පෙර පැවැත්තාක් මෙන් ම පසු ව ද, පසු ව පැවැත්තාක් මෙන් ම පෙර ද; යට පැවැත්තාක් මෙන් ම උඩ ද, උඩ පැවැත්තාක් මෙන් ම යට ද; දවල් පැවැත්තාක් මෙන් ම රාත්‍රී ව ද, රාත්‍රී ව පැවැත්තාක් මෙන් ම දවල් ද’ යනුවෙනි. මෙසේ විවෘත වූ සිතකින්, සීමා නොකළා වූ සිතකින්, ප්‍රභාස්වර සිතක් වඩයි.\n\nවිමංසාව (ප්‍රඥාව) මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි – ‘මාගේ විමංසාව අධික ලෙස පසුබට නොවන්නේ ය, අධික ලෙස උත්සාහවත් නොවන්නේ ය, ඇතුළතට හැකිලී නොපවතිනු ඇත, පිටතට විසිරී නොපවතිනු ඇත’ යනුවෙනි. ඔහු පෙර පසු දැනීමෙන් යුක්තව වාසය කරයි – ‘පෙර පැවැත්තාක් මෙන් ම පසු ව ද, පසු ව පැවැත්තාක් මෙන් ම පෙර ද; යට පැවැත්තාක් මෙන් ම උඩ ද, උඩ පැවැත්තාක් මෙන් ම යට ද; දවල් පැවැත්තාක් මෙන් ම රාත්‍රී ව ද, රාත්‍රී ව පැවැත්තාක් මෙන් ම දවල් ද’ යනුවෙනි. මෙසේ විවෘත වූ සිතකින්, සීමා නොකළා වූ සිතකින්, ප්‍රභාස්වර සිතක් වඩයි.\n\nභික්ෂූන් වහන්ස, අධික ලෙස පසුබට වූ ඡන්දය කවරේ ද? භික්ෂූන් වහන්ස, යම් ඡන්දයක් කෝසජ්ජය (අලසකම) සමඟ උපන්නේ ද, කෝසජ්ජයෙන් යුක්ත වූයේ ද, භික්ෂූන් වහන්ස, මේ අධික ලෙස පසුබට වූ ඡන්දය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, අධික ලෙස උත්සාහවත් වූ ඡන්දය කවරේ ද? භික්ෂූන් වහන්ස, යම් ඡන්දයක් උද්ධච්චය (කලබලකම) සමඟ උපන්නේ ද, උද්ධච්චයෙන් යුක්ත වූයේ ද, භික්ෂූන් වහන්ස, මේ අධික ලෙස උත්සාහවත් වූ ඡන්දය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, අභ්‍යන්තරයෙන් හැකිළුණු ඡන්දය කවරේ ද? භික්ෂූන් වහන්ස, යම් ඡන්දයක් ථීනමිද්ධය (අලසකම හා නිදිමත) සමඟ උපන්නේ ද, ථීනමිද්ධයෙන් යුක්ත වූයේ ද, භික්ෂූන් වහන්ස, මේ අභ්‍යන්තරයෙන් හැකිළුණු ඡන්දය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, බාහිරට විසිරුණු ඡන්දය කවරේ ද? භික්ෂූන් වහන්ස, යම් ඡන්දයක් බාහිර වූ පංච කාමගුණ අරමුණු කොට, විසුරුණු, පැතිරී ගිය ඡන්දයක් ද, භික්ෂූන් වහන්ස, මේ බාහිරට විසිරුණු ඡන්දය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, භික්ෂුව කෙසේ නම් පෙර පසු දැනීමෙන් යුක්තව – ‘පෙර පැවැත්තාක් මෙන් ම පසු ව ද, පසු ව පැවැත්තාක් මෙන් ම පෙර ද’ යනුවෙන් වාසය කරයි ද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුවට පෙර පසු දැනීම ප්‍රඥාවෙන් මනා කොට ගත් එකක් වෙයි, මනා කොට මෙනෙහි කළ එකක් වෙයි, මනා කොට ධාරණය කළ එකක් වෙයි, මනා කොට අවබෝධ කළ එකක් වෙයි. භික්ෂූන් වහන්ස, භික්ෂුව මෙසේ පෙර පසු දැනීමෙන් යුක්තව – ‘පෙර පැවැත්තාක් මෙන් ම පසු ව ද, පසු ව පැවැත්තාක් මෙන් ම පෙර ද’ යනුවෙන් වාසය කරයි.\n\nභික්ෂූන් වහන්ස, භික්ෂුව කෙසේ නම් ‘යට පැවැත්තාක් මෙන් ම උඩ ද, උඩ පැවැත්තාක් මෙන් ම යට ද’ යනුවෙන් වාසය කරයි ද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුව මේ ශරීරය පාදවල යටි පතුල්වල සිට ඉහළට ද, හිසකෙස් අග දක්වා පහළට ද, සම කෙළවර කොට, නොයෙක් ආකාර අපිරිසිදු දේවලින් පිරුණු බව මෙනෙහි කරයි – ‘මේ ශරීරයෙහි කෙස්, ලොම්, නිය, දත්, සම, මස්, නහර, ඇට, ඇටමිදුළු, වකුගඩු, හෘදය, අක්මා, දලබුව, පීහකය, පෙනහළු, අන්ත්‍ර, අන්ත්‍රගුණ, අමුපස, මල, පිත්, සෙම්, සැරව, ලේ, දහදිය, මේදස්, කඳුළු, තෙල්, කෙළ, සොටු, ලසිකා, මුත්‍ර’ යනුවෙනි. භික්ෂූන් වහන්ස, භික්ෂුව මෙසේ ‘යට පැවැත්තාක් මෙන් ම උඩ ද, උඩ පැවැත්තාක් මෙන් ම යට ද’ යනුවෙන් වාසය කරයි.\n\nභික්ෂූන් වහන්ස, භික්ෂුව කෙසේ නම් ‘දවල් පැවැත්තාක් මෙන් ම රාත්‍රී ව ද, රාත්‍රී ව පැවැත්තාක් මෙන් ම දවල් ද’ යනුවෙන් වාසය කරයි ද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුව යම් ආකාරයන්ගෙන්, යම් ලක්ෂණයන්ගෙන්, යම් නිමිතිවලින් දවල් කාලයේ දී ඡන්දය මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි ද, ඒ ආකාරයන්ගෙන්, ඒ ලක්ෂණයන්ගෙන්, ඒ නිමිතිවලින් රාත්‍රී කාලයේ දී ද ඡන්දය මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි; යම් ආකාරයන්ගෙන් හෝ යම් ලක්ෂණයන්ගෙන් හෝ යම් නිමිතිවලින් රාත්‍රී කාලයේ දී ඡන්දය මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි ද, ඒ ආකාරයන්ගෙන්, ඒ ලක්ෂණයන්ගෙන්, ඒ නිමිතිවලින් දවල් කාලයේ දී ද ඡන්දය මුල් කරගත් සමාධියෙන් හා වීර්යයෙන් යුක්ත ඉර්ධිපාදය වඩයි. භික්ෂූන් වහන්ස, භික්ෂුව මෙසේ ‘දවල් පැවැත්තාක් මෙන් ම රාත්‍රී ව ද, රාත්‍රී ව පැවැත්තාක් මෙන් ම දවල් ද’ යනුවෙන් වාසය කරයි.\n\nභික්ෂූන් වහන්ස, භික්ෂුව කෙසේ නම් විවෘත වූ සිතකින්, සීමා නොකළා වූ සිතකින්, ප්‍රභාස්වර සිතක් වඩයි ද? භික්ෂූන් වහන්ස, මෙහිලා භික්ෂුවට ආලෝක සංඥාව මනා කොට ගත් එකක් වෙයි, දිවා සංඥාව මනා කොට අධිෂ්ඨාන කොට ඇත. භික්ෂූන් වහන්ස, භික්ෂුව මෙසේ විවෘත වූ සිතකින්, සීමා නොකළා වූ සිතකින්, ප්‍රභාස්වර සිතක් වඩයි.\n\nභික්ෂූන් වහන්ස, අධික ලෙස පසුබට වූ වීර්යය කවරේ ද? භික්ෂූන් වහන්ස, යම් වීර්යයක් කෝසජ්ජය සමඟ උපන්නේ ද, කෝසජ්ජයෙන් යුක්ත වූයේ ද, භික්ෂූන් වහන්ස, මේ අධික ලෙස පසුබට වූ වීර්යය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, අධික ලෙස උත්සාහවත් වූ වීර්යය කවරේ ද? භික්ෂූන් වහන්ස, යම් වීර්යයක් උද්ධච්චය සමඟ උපන්නේ ද, උද්ධච්චයෙන් යුක්ත වූයේ ද, භික්ෂූන් වහන්ස, මේ අධික ලෙස උත්සාහවත් වූ වීර්යය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, අභ්‍යන්තරයෙන් හැකිළුණු වීර්යය කවරේ ද?\n\nමහණෙනි, යම් වීර්‍යයක් ථිනමිද්ධයෙන් යුක්ත වී, ථිනමිද්ධයෙන් සම්ප්‍රයුක්ත වී පවතී ද, මහණෙනි, මෙය අජ්ඣත්ත සංඛිත්ත වීර්‍යය යැයි කියනු ලැබේ. මහණෙනි, බහිද්ධා වික්ඛිත්ත වීර්‍යය යනු කවරේ ද? මහණෙනි, යම් වීර්‍යයක් බාහිරව පංච කාම ගුණ අරමුණු කොටගෙන විසුරුවා හරින ලද, පැතිරී ගිය වීර්‍යයක් වේ ද, මහණෙනි, මෙය බහිද්ධා වික්ඛිත්ත වීර්‍යය යැයි කියනු ලැබේ. මහණෙනි, භික්‍ෂුව විවෘත වූ, අනුරාගයෙන් ආවරණය නොවූ සිතකින් ප්‍රභාෂයෙන් යුක්ත වූ සිතක් වඩන්නේ කෙසේ ද? මහණෙනි, මෙහි දී භික්‍ෂුවට ආලෝක සංඥාව මැනවින් ග්‍රහණය කරගෙන ඇත. දිවා සංඥාව මැනවින් අධිෂ්ඨාන කරගෙන ඇත. මහණෙනි, භික්‍ෂුව විවෘත වූ, අනුරාගයෙන් ආවරණය නොවූ සිතකින් ප්‍රභාෂයෙන් යුක්ත වූ සිතක් වඩන්නේ මෙලෙසින් ම යි. මහණෙනි, අතිලීන වූ සිත යනු කවරේ ද? මහණෙනි, යම් සිතක් කෝසජ්ජයෙන් යුක්ත වී, කෝසජ්ජයෙන් සම්ප්‍රයුක්ත වී පවතී ද, මහණෙනි, මෙය අතිලීන වූ සිත යැයි කියනු ලැබේ. මහණෙනි, අතිප්පග්ගහිත වූ සිත යනු කවරේ ද? මහණෙනි, යම් සිතක් උද්ධච්චයෙන් යුක්ත වී, උද්ධච්චයෙන් සම්ප්‍රයුක්ත වී පවතී ද, මහණෙනි, මෙය අතිප්පග්ගහිත වූ සිත යැයි කියනු ලැබේ. මහණෙනි, අජ්ඣත්ත සංඛිත්ත වූ සිත යනු කවරේ ද? මහණෙනි, යම් සිතක් ථිනමිද්ධයෙන් යුක්ත වී, ථිනමිද්ධයෙන් සම්ප්‍රයුක්ත වී පවතී ද, මහණෙනි, මෙය අජ්ඣත්ත සංඛිත්ත වූ සිත යැයි කියනු ලැබේ. මහණෙනි, බහිද්ධා වික්ඛිත්ත වූ සිත යනු කවරේ ද? මහණෙනි, යම් සිතක් බාහිරව පංච කාම ගුණ අරමුණු කොටගෙන විසුරුවා හරින ලද, පැතිරී ගිය සිතක් වේ ද, මහණෙනි, මෙය බහිද්ධා වික්ඛිත්ත වූ සිත යැයි කියනු ලැබේ. මහණෙනි, භික්‍ෂුව විවෘත වූ, අනුරාගයෙන් ආවරණය නොවූ සිතකින් ප්‍රභාෂයෙන් යුක්ත වූ සිතක් වඩන්නේ මෙලෙසින් ම යි. මහණෙනි, අතිලීන වූ විමංසාව යනු කවරේ ද? මහණෙනි, යම් විමංසාවක් කෝසජ්ජයෙන් යුක්ත වී, කෝසජ්ජයෙන් සම්ප්‍රයුක්ත වී පවතී ද, මහණෙනි, මෙය අතිලීන වූ විමංසාව යැයි කියනු ලැබේ. මහණෙනි, අතිප්පග්ගහිත වූ විමංසාව යනු කවරේ ද? මහණෙනි, යම් විමංසාවක් උද්ධච්චයෙන් යුක්ත වී, උද්ධච්චයෙන් සම්ප්‍රයුක්ත වී පවතී ද, මහණෙනි, මෙය අතිප්පග්ගහිත වූ විමංසාව යැයි කියනු ලැබේ. මහණෙනි, අජ්ඣත්ත සංඛිත්ත වූ විමංසාව යනු කවරේ ද? මහණෙනි, යම් විමංසාවක් ථිනමිද්ධයෙන් යුක්ත වී, ථිනමිද්ධයෙන් සම්ප්‍රයුක්ත වී පවතී ද, මහණෙනි, මෙය අජ්ඣත්ත සංඛිත්ත වූ විමංසාව යැයි කියනු ලැබේ. මහණෙනි, බහිද්ධා වික්ඛිත්ත වූ විමංසාව යනු කවරේ ද? මහණෙනි, යම් විමංසාවක් බාහිරව පංච කාම ගුණ අරමුණු කොටගෙන විසුරුවා හරින ලද, පැතිරී ගිය විමංසාවක් වේ ද, මහණෙනි, මෙය බහිද්ධා වික්ඛිත්ත වූ විමංසාව යැයි කියනු ලැබේ. මහණෙනි, භික්‍ෂුව විවෘත වූ, අනුරාගයෙන් ආවරණය නොවූ සිතකින් ප්‍රභාෂයෙන් යුක්ත වූ සිතක් වඩන්නේ මෙලෙසින් ම යි.\n\nමහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද සතර ඍද්ධිපාද මහත් ඵල ඇත්තාහු ද, මහත් ආනිශංස ඇත්තාහු ද වෙති. මහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද සතර ඍද්ධිපාදයන්හි භික්‍ෂුව නොයෙක් ආකාර වූ ඍද්ධිවිධීන් අත්දකින්නේ ය. එනම්: එකෙක්ව සිටිය දී බොහෝ දෙනෙක් බවට පත් වන්නේ ය, බොහෝ දෙනෙක්ව සිටිය දී එකෙක් බවට පත් වන්නේ ය. නොපෙනී යන්නේ ය, පෙනී යන්නේ ය. පවුරක්, ප්‍රාකාරයක් හෝ කඳුවැටියක් හරහා බාධාවකින් තොරව ගමන් කරන්නේ, හරහා යන්නේ හරියට හිස් අවකාශය මැදින් යන්නාක් මෙනි. පොළොවට කිමිදී යන්නේත්, මතුවන්නේත් හරියට ජලයේ මෙන් ය. ජලය මත නොවදින අයුරින් යන්නේ, හරියට පොළොව මත මෙන් ය. හිස් අවකාශයේ හරහට පලක් බැඳගෙන යන්නේ, හරියට පියාපත් ඇති කුරුල්ලකු මෙන් ය. මෙතරම් මහත් බලයක් ඇති, මෙතරම් මහත් තේජසක් ඇති සඳුන් සහ සූර්යයා තමාගේ අතින් අල්ලා පිරිමදින්නේ ය. බ්‍රහ්ම ලෝකය දක්වා ද කයින් වසඟය පවත්වන්නේ ය. මහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද සතර ඍද්ධිපාදයන්හි භික්‍ෂුව ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේ දී ම තමා විසින් ම අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කරන්නේ ය.\n\nදසවෙනි සූත්‍රයයි.\n\nදෙවෙනි වූ ප්‍රාසාදකම්පන වර්ගයයි.\n\nඑහි උද්දානය නම්:\nපූර්වය, මහාඵලය, ඡන්දය, මොග්ගල්ලාන සහ උණ්ණාභ, දෙසමණබ්‍රාහ්මණ, භික්‍ෂු, දේශනා විභංගය යනුයි.",
      "paliTitle": "Vibhaṅgasuttaṃ",
      "vagga": "Pāsādakampanavaggo"
    },
    {
      "number": 833,
      "pali": "Sāvatthinidānaṃ. ‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho maggo, kā paṭipadā iddhipādabhāvanāyā’ti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘idha bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati. Pacchāpuresaññī ca viharati – yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ yathā rattiṃ tathā divā’ – iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. ‘‘Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Evaṃ bhāvitesu kho, bhikkhave, bhikkhu catūsu iddhipādesu evaṃ bahulīkatesu, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Paṭhamaṃ. (Chapi abhiññāyo vitthāretabbā).",
      "english": "Before my enlightenment, bhikkhus, while I was still an unenlightened Bodhisatta, this thought occurred to me: 'What, now, is the path, what is the way to the development of the bases for spiritual power?' Then, bhikkhus, this thought occurred to me: 'Here, a bhikkhu develops the base for spiritual power, endowed with concentration based on zeal and volitional formations of striving. Thus, my zeal will not be too slack, nor too tense, nor inwardly constricted, nor outwardly scattered. And he dwells perceiving 'after' and 'before': just as 'before', so 'after'; just as 'after', so 'before'; just as 'below', so 'above'; just as 'above', so 'below'; just as 'by day', so 'by night'; just as 'by night', so 'by day'. Thus, with an open, unconfined, and radiant mind, he develops his mind.\n\nHe develops the base for spiritual power, endowed with concentration based on energy and volitional formations of striving. Thus, my energy will not be too slack, nor too tense, nor inwardly constricted, nor outwardly scattered. And he dwells perceiving 'after' and 'before': just as 'before', so 'after'; just as 'after', so 'before'; just as 'below', so 'above'; just as 'above', so 'below'; just as 'by day', so 'by night'; just as 'by night', so 'by day'. Thus, with an open, unconfined, and radiant mind, he develops his mind.\n\nHe develops the base for spiritual power, endowed with concentration based on mind and volitional formations of striving. Thus, my mind will not be too slack, nor too tense, nor inwardly constricted, nor outwardly scattered. And he dwells perceiving 'after' and 'before': just as 'before', so 'after'; just as 'after', so 'before'; just as 'below', so 'above'; just as 'above', so 'below'; just as 'by day', so 'by night'; just as 'by night', so 'by day'. Thus, with an open, unconfined, and radiant mind, he develops his mind.\n\nHe develops the base for spiritual power, endowed with concentration based on investigation and volitional formations of striving. Thus, my investigation will not be too slack, nor too tense, nor inwardly constricted, nor outwardly scattered. And he dwells perceiving 'after' and 'before': just as 'before', so 'after'; just as 'after', so 'before'; just as 'below', so 'above'; just as 'above', so 'below'; just as 'by day', so 'by night'; just as 'by night', so 'by day'. Thus, with an open, unconfined, and radiant mind, he develops his mind.'\n\nWhen, bhikkhus, these four bases for spiritual power are thus developed and thus frequently cultivated, a bhikkhu experiences various kinds of spiritual power: being one he becomes many; being many he becomes one; he goes unimpeded through walls, through ramparts, through mountains as if through air; he dives in and out of the earth as if it were water; he walks on water without sinking as if it were dry land; he travels through the sky seated cross-legged, like a bird on the wing; with his hand he touches and strokes the moon and sun, so mighty and powerful; he exercises mastery with his body even over the Brahma world. When, bhikkhus, these four bases for spiritual power are thus developed and thus frequently cultivated, then, through the destruction of the taints, having realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, he dwells therein.",
      "sinhala": "සැවැත්නුවරදීය.\n\nමහණෙනි, මම සම්බෝධිය අවබෝධ කර ගැනීමට පෙර, තවමත් අභිසම්බුද්ධ නොවූ බෝධිසත්වයකු වශයෙන් සිටියදී, මට මෙවැනි සිතුවිල්ලක් ඇති විය: ‘ඉර්ධිපාදයන් භාවනා කිරීමට මාර්ගය කුමක්ද? පිළිවෙත කුමක්ද?’ යනුවෙනි. මහණෙනි, එවිට මට මෙවැනි සිතුවිල්ලක් ඇති විය: ‘මේ ශාසනයෙහි භික්ෂුවක් ඡන්දය, සමාධිය සහ ප්‍රධානසංස්කාරයන්ගෙන් යුත් ඉර්ධිපාදය වඩයි. එනම්, මාගේ ඡන්දය (කැමැත්ත) අතිශයින් ලිහිල් නොවනු ඇත, අතිශයින් තදින් අල්ලා නොගනු ඇත, ඇතුළතට සංකෝචනය නොවනු ඇත, පිටතට විසිරී නොයනු ඇත.’ ඉදිරිය හා පසුපස සමාන කොට දකිමින් වාසය කරයි. යම්සේ ඉදිරියද, එසේ පසුපසද; යම්සේ පසුපසද, එසේ ඉදිරියද; යම්සේ පහළද, එසේ ඉහළද; යම්සේ ඉහළද, එසේ පහළද; යම්සේ දවාලද, එසේ රාත්‍රියද; යම්සේ රාත්‍රියද, එසේ දවාලද වශයෙන් සලකයි. මෙසේ විවෘත වූ සිත් ඇතිව, සීමා රහිත වූ, බැබලෙන සිතක් වඩයි. වීර්ය සමාධි ප්‍රධානසංස්කාර සමන්විත ඉර්ධිපාදය... (මෙසේම) චිත්ත සමාධි ප්‍රධානසංස්කාර සමන්විත ඉර්ධිපාදය... (මෙසේම) විමංසා සමාධි ප්‍රධානසංස්කාර සමන්විත ඉර්ධිපාදය වඩයි. එනම්, ‘මේ මාගේ විමංසාව (විමර්ශනය) අතිශයින් ලිහිල් නොවනු ඇත, අතිශයින් තදින් අල්ලා නොගනු ඇත, ඇතුළතට සංකෝචනය නොවනු ඇත, පිටතට විසිරී නොයනු ඇත.’ ඉදිරිය හා පසුපස සමාන කොට දකිමින් වාසය කරයි – යම්සේ ඉදිරියද, එසේ පසුපසද; යම්සේ පසුපසද, එසේ ඉදිරියද; යම්සේ පහළද, එසේ ඉහළද; යම්සේ ඉහළද, එසේ පහළද; යම්සේ දවාලද, එසේ රාත්‍රියද; යම්සේ රාත්‍රියද, එසේ දවාලද වශයෙන් සලකයි – මෙසේ විවෘත වූ සිත් ඇතිව, සීමා රහිත වූ, බැබලෙන සිතක් වඩයි.\n\nමහණෙනි, මෙසේ සිව් ඉර්ධිපාදයන් වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද භික්ෂුව, නොයෙක් ආකාර වූ ඉර්ධි ප්‍රාතිහාර්‍යයන් අත්විඳියි. එනම්, එකකු ව සිට බොහෝ දෙනෙකු බවට පත් වෙයි, බොහෝ දෙනෙකු ව සිට එකෙකු බවට පත් වෙයි... (මෙසේම) බ්‍රහ්ම ලෝකය දක්වාද කයින් තම වසඟයට පමුණුවයි.\n\nමහණෙනි, මෙසේ සිව් ඉර්ධිපාදයන් වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද භික්ෂුව, ආශ් ‍රවයන්ගේ ක්ෂය වීමෙන් ආශ් ‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමා විසින්ම අභිඥාවෙන් අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරයි.",
      "paliTitle": "Maggasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 834,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘abhijānāti nu kho, bhante, bhagavā iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamitā’’ti? ‘‘Abhijānāmi khvāhaṃ, ānanda, iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamitā’’ti. ‘‘Abhijānāti pana, bhante, bhagavā iminā cātumahābhūtikena kāyena iddhiyā brahmalokaṃ upasaṅkamitā’’ti? ‘‘Abhijānāmi khvāhaṃ, ānanda, iminā cātumahābhūtikena [cātummahābhūtikena (sī. syā. kaṃ.)] kāyena iddhiyā brahmalokaṃ upasaṅkamitā’’ti. ‘‘Yañca kho, omāti, bhante, bhagavā iddhiyā manomayena kāyena brahmalokaṃ upasaṅkamituṃ, yañca kho abhijānāti, bhante, bhagavā iminā cātumahābhūtikena kāyena iddhiyā brahmalokaṃ upasaṅkamitā, tayidaṃ, bhante, bhagavato acchariyañceva abbhutañcā’’ti. ‘‘Acchariyā ceva, ānanda, tathāgatā acchariyadhammasamannāgatā ca, abbhutā ceva, ānanda, tathāgatā abbhutadhammasamannāgatā ca’’. ‘‘Yasmiṃ, ānanda, samaye tathāgato kāyampi citte samodahati [samādahati (sī. syā. pī.)] cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo lahutaro ceva hoti mudutaro ca kammaniyataro ca pabhassarataro ca. ‘‘Seyyathāpi, ānanda, ayoguḷo divasaṃ santatto lahutaro ceva hoti mudutaro ca kammaniyataro ca pabhassarataro ca; evameva kho, ānanda, yasmiṃ samaye tathāgato kāyampi citte samodahati, cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo lahutaro ceva hoti mudutaro ca kammaniyataro ca pabhassarataro ca. ‘‘Yasmiṃ, ānanda, samaye tathāgato kāyampi citte samodahati, cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo appakasireneva pathaviyā vehāsaṃ abbhuggacchati, so anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. ‘‘Seyyathāpi, ānanda, tūlapicu vā kappāsapicu vā lahuko vātūpādāno appakasireneva pathaviyā vehāsaṃ abbhuggacchati; evameva kho, ānanda, yasmiṃ samaye tathāgato kāyampi citte samodahati, cittampi kāye samodahati, sukhasaññañca lahusaññañca kāye okkamitvā viharati; tasmiṃ, ānanda, samaye tathāgatassa kāyo appakasireneva pathaviyā vehāsaṃ abbhuggacchati, so anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vattetī’’ti. Dutiyaṃ.",
      "english": "Then indeed, the venerable Ananda approached the Blessed One; having approached, paid homage to the Blessed One, and sat down to one side. Sitting to one side, the venerable Ananda then said this to the Blessed One: \"Does the Blessed One, venerable sir, know how to go to the Brahma world by means of psychic power with a mentally-formed body?\" \"Indeed, Ananda, I know how to go to the Brahma world by means of psychic power with a mentally-formed body.\" \"But does the Blessed One, venerable sir, know how to go to the Brahma world by means of psychic power with this body composed of the four great elements?\" \"Indeed, Ananda, I know how to go to the Brahma world by means of psychic power with this body composed of the four great elements.\" \"That the Blessed One, venerable sir, knows how to go to the Brahma world by means of psychic power with a mentally-formed body, and that the Blessed One, venerable sir, also knows how to go to the Brahma world by means of psychic power with this body composed of the four great elements—this, venerable sir, is indeed amazing and astonishing for the Blessed One.\" \"Ananda, Tathāgatas are indeed amazing and endowed with amazing qualities; Ananda, Tathāgatas are indeed astonishing and endowed with astonishing qualities.\"\n\n\"Ananda, when a Tathāgata establishes the body in the mind and the mind in the body, and dwells having entered upon the perception of ease and the perception of lightness in the body; at that time, Ananda, the Tathāgata's body becomes lighter, more pliant, more workable, and more radiant.\"\n\n\"Just as, Ananda, an iron ball heated for a day becomes lighter, more pliant, more workable, and more radiant; in the same way, Ananda, when a Tathāgata establishes the body in the mind and the mind in the body, and dwells having entered upon the perception of ease and the perception of lightness in the body; at that time, Ananda, the Tathāgata's body becomes lighter, more pliant, more workable, and more radiant.\"\n\n\"Ananda, when a Tathāgata establishes the body in the mind and the mind in the body, and dwells having entered upon the perception of ease and the perception of lightness in the body; at that time, Ananda, the Tathāgata's body effortlessly rises into the air from the earth, and he experiences various kinds of psychic power – being one, he becomes many; being many, he becomes one... up to exercising mastery with his body even up to the Brahma world.\"\n\n\"Just as, Ananda, a light tuft of cotton or a tuft of kapok, supported by the wind, effortlessly rises into the air from the earth; in the same way, Ananda, when a Tathāgata establishes the body in the mind and the mind in the body, and dwells having entered upon the perception of ease and the perception of lightness in the body; at that time, Ananda, the Tathāgata's body effortlessly rises into the air from the earth, and he experiences various kinds of psychic power – being one, he becomes many... up to exercising mastery with his body even up to the Brahma world.\"",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලදී.\n\nඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූ සේක. එක් පසෙකින් වැඩ සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූ සේක: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සෘද්ධියෙන් මනෝමය කය (සිතින් නිමැවූ කය) ඇත්තෙකු ලෙස බ්‍රහ්ම ලෝකයට ගිය බව දන්නා සේක්ද?” “ආනන්දය, මම සෘද්ධියෙන් මනෝමය කය ඇත්තෙකු ලෙස බ්‍රහ්ම ලෝකයට ගිය බව දනිමි.” “එහෙත් ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මේ සිව් මහ භූතයන්ගෙන් හටගත් කයෙන් සෘද්ධියෙන් බ්‍රහ්ම ලෝකයට ගිය බව දන්නා සේක්ද?” “ආනන්දය, මම මේ සිව් මහ භූතයන්ගෙන් හටගත් කයෙන් සෘද්ධියෙන් බ්‍රහ්ම ලෝකයට ගිය බව දනිමි.” “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සෘද්ධියෙන් මනෝමය කයෙන් බ්‍රහ්ම ලෝකයට යන බවත්, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මේ සිව් මහ භූතයන්ගෙන් හටගත් කයෙන් සෘද්ධියෙන් බ්‍රහ්ම ලෝකයට යන බවත් දන්නා සේක් නම්, එය භාග්‍යවතුන් වහන්සේගේ ආශ්චර්යයකි, අද්භූතයකි.” “ආනන්දය, තථාගතයන් වහන්සේලා ආශ්චර්යවත් වූ ද, ආශ්චර්යවත් ධර්මයන්ගෙන් යුක්ත වූ ද, අද්භූත වූ ද, අද්භූත ධර්මයන්ගෙන් යුක්ත වූ ද සේක.”\n\n“ආනන්දය, යම් සමයක තථාගතයන් වහන්සේ කය සිතෙහි සමාදන් කර, සිත කයෙහි සමාදන් කර, සැප සංඥාවත්, සැහැල්ලු සංඥාවත් කයෙහි පිහිටුවාගෙන වාසය කරන සේක් නම්, ඒ සමයෙහි තථාගතයන් වහන්සේගේ කය වඩාත් සැහැල්ලු ද වේ, වඩාත් මෘදු ද වේ, ක්‍රියා කිරීමට සුදුසු ද වේ, වඩාත් ප්‍රභාස්වර ද වේ.\n\n“ආනන්දය, යම් සේ දිවා කාලයේ තවන ලද යකඩ ගුලියක් වඩාත් සැහැල්ලු ද වේ, වඩාත් මෘදු ද වේ, ක්‍රියා කිරීමට සුදුසු ද වේ, වඩාත් ප්‍රභාස්වර ද වේ; එපරිද්දෙන්ම, ආනන්දය, යම් සමයක තථාගතයන් වහන්සේ කය සිතෙහි සමාදන් කර, සිත කයෙහි සමාදන් කර, සැප සංඥාවත්, සැහැල්ලු සංඥාවත් කයෙහි පිහිටුවාගෙන වාසය කරන සේක් නම්, ඒ සමයෙහි තථාගතයන් වහන්සේගේ කය වඩාත් සැහැල්ලු ද වේ, වඩාත් මෘදු ද වේ, ක්‍රියා කිරීමට සුදුසු ද වේ, වඩාත් ප්‍රභාස්වර ද වේ.\n\n“ආනන්දය, යම් සමයක තථාගතයන් වහන්සේ කය සිතෙහි සමාදන් කර, සිත කයෙහි සමාදන් කර, සැප සංඥාවත්, සැහැල්ලු සංඥාවත් කයෙහි පිහිටුවාගෙන වාසය කරන සේක් නම්, ඒ සමයෙහි තථාගතයන් වහන්සේගේ කය ඉතා පහසුවෙන් පොළොවෙන් අහසට නැඟේ. උන්වහන්සේ නොයෙක් ආකාර වූ සෘද්ධි ප්‍රාතිහාර්යයන් අත්විඳින සේක – එක් අයෙක් ව සිට බොහෝ අය බවට පත් වේ, බොහෝ අය ව සිට එක් අයෙක් බවට පත් වේ... බ්‍රහ්ම ලෝකය දක්වා ද කයෙන් වසඟයට පමුණුවන සේක.\n\n“ආනන්දය, යම් සේ සැහැල්ලු වූ, සුළඟින් ගෙන යන පුළුන් පොදක් හෝ කපු පුළුන් පොදක් ඉතා පහසුවෙන් පොළොවෙන් අහසට නැඟේ; එපරිද්දෙන්ම, ආනන්දය, යම් සමයක තථාගතයන් වහන්සේ කය සිතෙහි සමාදන් කර, සිත කයෙහි සමාදන් කර, සැප සංඥාවත්, සැහැල්ලු සංඥාවත් කයෙහි පිහිටුවාගෙන වාසය කරන සේක් නම්, ඒ සමයෙහි තථාගතයන් වහන්සේගේ කය ඉතා පහසුවෙන් පොළොවෙන් අහසට නැඟේ. උන්වහන්සේ නොයෙක් ආකාර වූ සෘද්ධි ප්‍රාතිහාර්යයන් අත්විඳින සේක – එක් අයෙක් ව සිට බොහෝ අය බවට පත් වේ... බ්‍රහ්ම ලෝකය දක්වා ද කයෙන් වසඟයට පමුණුවන සේක.”\nදෙවෙනි කොටස නිමි.",
      "paliTitle": "Ayoguḷasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 835,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Tatiyaṃ.",
      "english": "“Mendicants, there are these four bases of spiritual power. Which four? Here, mendicants, a monastic develops the basis of spiritual power endowed with concentration due to zeal and volitional formations of exertion; he develops the basis of spiritual power endowed with concentration due to energy and volitional formations of exertion; he develops the basis of spiritual power endowed with concentration due to the mind and volitional formations of exertion; he develops the basis of spiritual power endowed with concentration due to investigation and volitional formations of exertion. These, mendicants, are the four bases of spiritual power. From having developed and frequently practiced these four bases of spiritual power, a monastic, through the destruction of the taints, realizes for oneself with direct knowledge and attains the taintless liberation of mind and liberation through wisdom, and abides in them in this very life.”",
      "sinhala": "මහණෙනි, මේ ඉර්ධිපාද සතරකි. ඒ සතර කවරේද? මහණෙනි, මෙහිලා භික්‍ෂුව ඡන්දසමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත ඉර්ධිපාදය වඩයි. වීර්යසමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත ඉර්ධිපාදය වඩයි. චිත්තසමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත ඉර්ධිපාදය වඩයි. විමංසාසමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත ඉර්ධිපාදය වඩයි. මහණෙනි, මේවා සතර ඉර්ධිපාදයෝ වෙති. මහණෙනි, මේ සතර ඉර්ධිපාදයන් වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද භික්‍ෂුව ආශ්‍රවයන්ගේ ක්ෂය වීම හේතුවෙන් මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, සාක්‍ෂාත් කොට, අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය ලබාගෙන වාසය කරයි.",
      "paliTitle": "Bhikkhusuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 836,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā’’ti. Catutthaṃ.",
      "english": "These are, monks, the four bases of spiritual power. Which four? Here, monks, a monk develops the base of spiritual power endowed with concentration born of will, together with the volitional formations of exertion. He develops the base of spiritual power endowed with concentration born of energy, together with the volitional formations of exertion. He develops the base of spiritual power endowed with concentration born of mind, together with the volitional formations of exertion. He develops the base of spiritual power endowed with concentration born of investigation, together with the volitional formations of exertion. These, monks, are the four bases of spiritual power.",
      "sinhala": "මහණෙනි, මේ සෘද්ධිපාද සතරක් ඇත. ඒ කවර සතරක්ද?\n\nමහණෙනි, මෙහි මහණ තෙමේ, ඡන්දය හේතු කොටගෙන ඇති වූ සමාධියකින්ද, ප්‍රධාන සංඛාරයන්ගෙන්ද යුක්ත වූ සෘද්ධිපාදය වඩයි. වීර්යය හේතු කොටගෙන ඇති වූ සමාධියකින්ද, ප්‍රධාන සංඛාරයන්ගෙන්ද යුක්ත වූ සෘද්ධිපාදය වඩයි. චිත්තය හේතු කොටගෙන ඇති වූ සමාධියකින්ද, ප්‍රධාන සංඛාරයන්ගෙන්ද යුක්ත වූ සෘද්ධිපාදය වඩයි. විමංසාව හේතු කොටගෙන ඇති වූ සමාධියකින්ද, ප්‍රධාන සංඛාරයන්ගෙන්ද යුක්ත වූ සෘද්ධිපාදය වඩයි. මහණෙනි, මේ සෘද්ධිපාද සතර නම් මේවාය.",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 837,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā bhikkhunā dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Pañcamaṃ.",
      "english": "Monks, there are these four bases of spiritual power. Which four? Here, monks, a monk develops the base of spiritual power endowed with concentration due to aspiration and accompanied by volitional formations of striving; he develops the base of spiritual power endowed with concentration due to energy and accompanied by volitional formations of striving; he develops the base of spiritual power endowed with concentration due to consciousness and accompanied by volitional formations of striving; he develops the base of spiritual power endowed with concentration due to investigation and accompanied by volitional formations of striving. These, monks, are the four bases of spiritual power.\n\nBy developing and repeatedly cultivating these four bases of spiritual power, monks, a monk can expect one of two fruits: either perfect knowledge in this very life, or, if there is still a remnant of clinging, the state of non-returning.",
      "sinhala": "මහණෙනි, මේ ඉර්ධිපාද සතරකි. ඒ සතර කවරේද?\n\nමහණෙනි, මේ ශාසනයෙහි මහණෙක් ඡන්දය මුල්කරගත් සමාධියෙන්ද, ප්‍රධාන වීර්‍ය සංස්කාරයන්ගෙන්ද යුක්ත වූ ඉර්ධිපාදය වඩයි. වීර්‍යය මුල්කරගත් සමාධියෙන්ද, ප්‍රධාන වීර්‍ය සංස්කාරයන්ගෙන්ද යුක්ත වූ ඉර්ධිපාදය වඩයි. සිත මුල්කරගත් සමාධියෙන්ද, ප්‍රධාන වීර්‍ය සංස්කාරයන්ගෙන්ද යුක්ත වූ ඉර්ධිපාදය වඩයි. විමංසාව මුල්කරගත් සමාධියෙන්ද, ප්‍රධාන වීර්‍ය සංස්කාරයන්ගෙන්ද යුක්ත වූ ඉර්ධිපාදය වඩයි. මහණෙනි, මේ ඉර්ධිපාද සතර වේ.\n\nමහණෙනි, මේ සතර ඉර්ධිපාදයන් වඩන ලද නිසාද, බහුල වශයෙන් පුරුදු කරන ලද නිසාද, මහණා විසින් ඵල දෙකෙන් එකක් බලාපොරොත්තු විය යුතුය. ඒ නම්, මේ ආත්මභාවයේදීම අර්හත්වය අවබෝධ කර ගැනීම හෝ, ක්ලේශශේෂයක් ඉතිරිව තිබේ නම් අනාගාමී තත්ත්වයට පත්වීමයි.",
      "paliTitle": "Paṭhamaphalasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 838,
      "pali": "‘‘Cattārome, bhikkhave, iddhipādā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ime kho, bhikkhave, cattāro iddhipādā. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā satta phalā sattānisaṃsā pāṭikaṅkhā. ‘‘Katame satta phalā sattānisaṃsā? Diṭṭheva dhamme paṭikacca [paṭigacca (sī.), paṭihacca (pī.)] aññaṃ ārādheti no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti; atha maraṇakāle aññaṃ ārādheti, no ce diṭṭheva dhamme paṭikacca aññaṃ ārādheti, no ce maraṇakāle aññaṃ ārādheti; atha pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti, upahaccaparinibbāyī hoti, asaṅkhāraparinibbāyī hoti, sasaṅkhāraparinibbāyī hoti, uddhaṃsoto hoti akaniṭṭhagāmī. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā ime satta phalā sattānisaṃsā pāṭikaṅkhā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these four bases of spiritual power. Which four? Here, monks, a monk develops the basis of spiritual power endowed with concentration due to zeal and volitional formations of exertion; he develops the basis of spiritual power endowed with concentration due to energy and volitional formations of exertion; he develops the basis of spiritual power endowed with concentration due to mind and volitional formations of exertion; he develops the basis of spiritual power endowed with concentration due to investigation and volitional formations of exertion – these, monks, are the four bases of spiritual power.\n\nMonks, through the development and frequent practice of these four bases of spiritual power, seven fruits and seven benefits may be expected. Which are these seven fruits and seven benefits? One attains final knowledge in this very life. If one does not attain final knowledge in this very life, then one attains final knowledge at the time of death. If one does not attain final knowledge in this very life, nor at the time of death; then, with the complete eradication of the five lower fetters, one becomes an antarāparinibbāyī (one who attains Nibbāna in the interval between rebirths); an upahaccaparinibbāyī (one who attains Nibbāna upon landing in the new realm); an asaṅkhāraparinibbāyī (one who attains Nibbāna without much effort); a sasaṅkhāraparinibbāyī (one who attains Nibbāna with effort); or one whose stream flows upwards, bound for the Akaniṭṭha realm. Monks, through the development and frequent practice of these four bases of spiritual power, these seven fruits and seven benefits may be expected.",
      "sinhala": "මහණෙනි, මේ සෘද්ධිපාද සතරකි. ඒ කවර සතරක්ද යත්? මහණෙනි, මෙහි භික්ෂුව ඡන්දයෙන් (කැමැත්තෙන්) යුක්ත වූ සමාධිය හා ප්‍රධාන සංඛාරයන් සහිත සෘද්ධිපාදය වඩයි. වීර්යයෙන් යුක්ත වූ සමාධිය හා ප්‍රධාන සංඛාරයන් සහිත සෘද්ධිපාදය වඩයි. සිතින් (චිත්තයෙන්) යුක්ත වූ සමාධිය හා ප්‍රධාන සංඛාරයන් සහිත සෘද්ධිපාදය වඩයි. විමංසාවෙන් (නුවණින්) යුක්ත වූ සමාධිය හා ප්‍රධාන සංඛාරයන් සහිත සෘද්ධිපාදය වඩයි. මහණෙනි, මේ සෘද්ධිපාද සතර යි.\n\nමහණෙනි, මේ සෘද්ධිපාද සතර වැඩූ බැවින්, බහුල වශයෙන් පුරුදු කළ බැවින් සප්ත ඵල සප්ත ආනිසංස බලාපොරොත්තු විය යුතු ය. ඒ සප්ත ඵල සප්ත ආනිසංස කවරේද යත්?\n\nමේ ආත්මභාවයේදීම ප්‍රථමයෙන්ම (ඉක්මනින්ම) අරහත්ඵලය අවබෝධ කරයි. යම් හෙයකින් මේ ආත්මභාවයේදීම ප්‍රථමයෙන්ම අරහත්ඵලය අවබෝධ නොකරයි නම්; එවිට මරණ මොහොතේදී අරහත්ඵලය අවබෝධ කරයි. යම් හෙයකින් මේ ආත්මභාවයේදීම ප්‍රථමයෙන්ම අරහත්ඵලය අවබෝධ නොකරයි නම්, මරණ මොහොතේදීද අරහත්ඵලය අවබෝධ නොකරයි නම්; එවිට පංච ඕරම්භාගීය සංයෝජනයන්ගේ ක්ෂය වීමෙන් අන්තරාපරිනිර්වාණගාමී වේ, උපහච්චපරිනිර්වාණගාමී වේ, අසංඛාරපරිනිර්වාණගාමී වේ, සසංඛාරපරිනිර්වාණගාමී වේ, ඌර්ධ්වශ්‍රෝත වූ අකනිට්ඨගාමී වේ. මහණෙනි, මේ සෘද්ධිපාද සතර වැඩූ බැවින්, බහුල වශයෙන් පුරුදු කළ බැවින් මේ සප්ත ඵල සප්ත ආනිසංස බලාපොරොත්තු විය යුතු ය.",
      "paliTitle": "Dutiyaphalasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 839,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Katamā nu kho, bhante, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? ‘‘Idhānanda, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccatānanda, iddhi’’. ‘‘Katamo cānanda, iddhipādo? Yo, ānanda, maggo yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccatānanda, iddhipādo. ‘‘Katamā cānanda, iddhipādabhāvanā? Idhānanda, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccatānanda, iddhipādabhāvanā. ‘‘Katamā cānanda, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi – ayaṃ vuccatānanda, iddhipādabhāvanāgāminī paṭipadā’’ti. Sattamaṃ.",
      "english": "At Savatthi.\n\nThen the Venerable Ananda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As the Venerable Ananda sat to one side, he said this to the Blessed One: \"What then, O Blessed One, is spiritual power? What is the basis for spiritual power? What is the development of the basis for spiritual power? What is the path leading to the development of the basis for spiritual power?\"\n\n\"Here, Ananda, a monk experiences various kinds of spiritual power: being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if it were water; he walks on water without sinking as if it were earth; he travels through the air, sitting cross-legged, just as a bird with wings; he touches and strokes with his hand the moon and sun, so mighty and powerful; and he wields mastery with his body even up to the Brahma-world. This, Ananda, is called spiritual power.\"\n\n\"And what, Ananda, is the basis for spiritual power? Whatever path, Ananda, whatever practice leads to the acquisition of spiritual power, to the attainment of spiritual power—this, Ananda, is called the basis for spiritual power.\"\n\n\"And what, Ananda, is the development of the basis for spiritual power? Here, Ananda, a monk develops the basis for spiritual power, which is accompanied by concentration and volitional formations of exertion, rooted in will; he develops the basis for spiritual power, which is accompanied by concentration and volitional formations of exertion, rooted in energy; he develops the basis for spiritual power, which is accompanied by concentration and volitional formations of exertion, rooted in mind; he develops the basis for spiritual power, which is accompanied by concentration and volitional formations of exertion, rooted in investigation. This, Ananda, is called the development of the basis for spiritual power.\"\n\n\"And what, Ananda, is the path leading to the development of the basis for spiritual power? It is this very Noble Eightfold Path, that is: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. This, Ananda, is called the path leading to the development of the basis for spiritual power.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඉන්පසු, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍ය\\u200Dවතුන් වහන්සේ වෙත එළඹියහ; එළඹ, භාග්‍ය\\u200Dවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වැඩසිටියහ. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍ය\\u200Dවතුන් වහන්සේට මෙය පැවසූහ: \"ස්වාමීනී, සෘද්ධිය නම් කුමක්ද? සෘද්ධිපාදය නම් කුමක්ද? සෘද්ධිපාද භාවනාව නම් කුමක්ද? සෘද්ධිපාද භාවනාවට පමුණුවන ප්‍ර\\u200Dතිපදාව නම් කුමක්ද?\"\n\n\"ආනන්දය, මෙහිලා භික්ෂුවක් නොයෙක් ආකාර වූ සෘද්ධි විධි අත්දකී: එනම්, තනිව සිටියදී බොහෝ වේ; බොහෝ වී සිටියදී තනි වේ; ... (සැඟවුණු පාඨය) ... බ්‍ර\\u200Dහ්ම ලෝකය දක්වාද කයින් වසඟ කොට පවත්වයි – ආනන්දය, මෙය සෘද්ධිය යැයි කියනු ලැබේ.\"\n\n\"ආනන්දය, සෘද්ධිපාදය නම් කුමක්ද? ආනන්දය, යම් මාර්ගයක්, යම් ප්‍ර\\u200Dතිපදාවක් සෘද්ධි ලාභයට, සෘද්ධි ප්‍රතිලාභයට හේතු වේද – ආනන්දය, මෙය සෘද්ධිපාදය යැයි කියනු ලැබේ.\"\n\n\"ආනන්දය, සෘද්ධිපාද භාවනාව නම් කුමක්ද? ආනන්දය, මෙහිලා භික්ෂුවක් ඡන්දය (කිරීමට ඇති කැමැත්ත) හේතු කොට ඇති ප්‍ර\\u200Dධ්‍යාන සංස්කාරයන්ගෙන් සමන්විත වූ සමාධියෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි; වීර්යය හේතු කොට ඇති ප්‍ර\\u200Dධ්‍යාන සංස්කාරයන්ගෙන් සමන්විත වූ සමාධියෙන් යුක්ත වූ... (සැඟවුණු පාඨය) ...සිත හේතු කොට ඇති ප්‍ර\\u200Dධ්‍යාන සංස්කාරයන්ගෙන් සමන්විත වූ සමාධියෙන් යුක්ත වූ... (සැඟවුණු පාඨය) ...විමංසා (ප්‍ර\\u200Dඥාව) හේතු කොට ඇති ප්‍ර\\u200Dධ්‍යාන සංස්කාරයන්ගෙන් සමන්විත වූ සමාධියෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි – ආනන්දය, මෙය සෘද්ධිපාද භාවනාව යැයි කියනු ලැබේ.\"\n\n\"ආනන්දය, සෘද්ධිපාද භාවනාවට පමුණුවන ප්‍ර\\u200Dතිපදාව නම් කුමක්ද? එනම්, සම්මා දිට්ඨිය (නියම දැක්ම)... (සැඟවුණු පාඨය) ...සම්මා සමාධිය (නියම සමාධිය) දක්වා වූ මේ ආර්ය අෂ්ටාංගික මාර්ගයම වේ – ආනන්දය, මෙය සෘද්ධිපාද භාවනාවට පමුණුවන ප්‍ර\\u200Dතිපදාව යැයි කියනු ලැබේ.\"",
      "paliTitle": "Paṭhamaānandasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 840,
      "pali": "Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘katamā nu kho, ānanda, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe…. ‘‘Idhānanda, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccatānanda, iddhi. ‘‘Katamo cānanda, iddhipādo? Yo, ānanda, maggo yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccatānanda, iddhipādo. ‘‘Katamā cānanda, iddhipādabhāvanā? Idhānanda, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccatānanda, iddhipādabhāvanā. ‘‘Katamā cānanda, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi – ayaṃ vuccatānanda, iddhipādabhāvanāgāminī paṭipadā’’ti. Aṭṭhamaṃ.",
      "english": "To Venerable Ananda, who was seated to one side, the Blessed One said this: \"Now, Ananda, what is spiritual power? What is a base of spiritual power? What is the development of a base of spiritual power? And what is the path leading to the development of the bases of spiritual power?\"\n\n\"Venerable Sir, for us, the teachings have the Blessed One as their root, the Blessed One as their guide.\"\n\n\"Here, Ananda, a monastic experiences various kinds of spiritual power: being one, he becomes many, and so on, up to wielding mastery with his body even up to the Brahma-world. This, Ananda, is called spiritual power.\"\n\n\"And what, Ananda, is a base of spiritual power? That path, Ananda, that way of practice which leads to the acquisition and attainment of spiritual power—this, Ananda, is called a base of spiritual power.\"\n\n\"And what, Ananda, is the development of a base of spiritual power? Here, Ananda, a monastic develops the base of spiritual power endowed with concentration due to aspiration and the volitional formations of striving; he develops the base of spiritual power endowed with concentration due to energy and the volitional formations of striving; he develops the base of spiritual power endowed with concentration due to mind and the volitional formations of striving; he develops the base of spiritual power endowed with concentration due to investigation and the volitional formations of striving. This, Ananda, is called the development of a base of spiritual power.\"\n\n\"And what, Ananda, is the path leading to the development of the bases of spiritual power? It is this Noble Eightfold Path itself, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, Ananda, is called the path leading to the development of the bases of spiritual power.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ එක්පසෙක වැඩහුන් ආයුෂ්මත් ආනන්ද තෙරුන්ට මෙසේ වදාළ සේක: \"ආනන්දය, ඍද්ධිය කවරේද? ඍද්ධිපාදය කවරේද? ඍද්ධිපාද භාවනාව කවරේද? ඍද්ධිපාද භාවනාවට පමුණුවන ප්‍රතිපදාව කවරේද?\"\n\nවහන්ස, අපගේ ධර්මයන්ට භාග්‍යවතුන් වහන්සේම මුලය; භාග්‍යවතුන් වහන්සේම නායකයෝය.\n\n\"ආනන්දය, මේ ශාසනයෙහි භික්ෂුව බොහෝ ආකාර ඍද්ධි විධි අත්දකී. එනම්, එකෙක්ව සිට බොහෝ වේ... (අපේක්ෂිත පරිදි ඍද්ධි විධි සම්පූර්ණයෙන් සඳහන් විය යුතුය)... බඹලොව දක්වා ද කයින් වසඟය පවත්වයි. ආනන්දය, මෙය ඍද්ධිය යැයි කියනු ලැබේ.\"\n\n\"ආනන්දය, ඍද්ධිපාදය කවරේද? ආනන්දය, යම් මාර්ගයක්, යම් ප්‍රතිපදාවක් ඍද්ධි ලාභය පිණිසත්, ඍද්ධි ප්‍රතිලාභය පිණිසත් පවතීද, ආනන්දය, මෙය ඍද්ධිපාදය යැයි කියනු ලැබේ.\"\n\n\"ආනන්දය, ඍද්ධිපාද භාවනාව කවරේද? ආනන්දය, මේ ශාසනයෙහි භික්ෂුව ඡන්දසමාධිය හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි; වීර්ය සමාධිය, ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි...පෙ... චිත්ත සමාධිය, ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි...පෙ... විමංසා සමාධිය හා ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. ආනන්දය, මෙය ඍද්ධිපාද භාවනාව යැයි කියනු ලැබේ.\"\n\n\"ආනන්දය, ඍද්ධිපාද භාවනාවට පමුණුවන ප්‍රතිපදාව කවරේද? ඒ මේ ආර්ය අෂ්ටාංගික මාර්ගයමයි. එනම්, සම්මා දිට්ඨිය...පෙ... සම්මා සමාධියයි. ආනන්දය, මෙය ඍද්ධිපාද භාවනාවට පමුණුවන ප්‍රතිපදාව යැයි කියනු ලැබේ.\"",
      "paliTitle": "Dutiyaānandasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 841,
      "pali": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘katamā nu kho, bhante, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? ‘‘Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti… pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccati, bhikkhave, iddhi. ‘‘Katamo ca, bhikkhave, iddhipādo? Yo, bhikkhave, maggo, yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccati, bhikkhave, iddhipādo. ‘‘Katamā ca, bhikkhave, iddhipādabhāvanā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccati, bhikkhave, iddhipādabhāvanā. ‘‘Katamā ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi – ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Navamaṃ.",
      "english": "Then, many monks approached the Blessed One. Having approached and paid homage to the Blessed One, they sat down to one side. Seated to one side, those monks said this to the Blessed One: \"What, venerable sir, is spiritual power? What is the basis of spiritual power? What is the development of the basis of spiritual power? What is the path leading to the development of the basis of spiritual power?\"\n\n\"Here, monks, a monk experiences various kinds of spiritual power: being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unimpeded through walls, through ramparts, through mountains as if through space; he dives in and out of the earth as if it were water; he walks on water without sinking as if it were dry land; sitting cross-legged, he travels through the air like a winged bird; he touches and strokes with his hand the moon and sun, so mighty and powerful; he exercises mastery with his body even as far as the Brahma world. This, monks, is called spiritual power.\"\n\n\"And what, monks, is the basis of spiritual power? Monks, that path, that practice, that leads to the acquisition of spiritual power, to the attainment of spiritual power—this, monks, is called the basis of spiritual power.\"\n\n\"And what, monks, is the development of the basis of spiritual power? Here, monks, a monk develops the basis of spiritual power endowed with concentration due to desire and volitional formations of striving; he develops the basis of spiritual power endowed with concentration due to energy and volitional formations of striving; he develops the basis of spiritual power endowed with concentration due to consciousness and volitional formations of striving; he develops the basis of spiritual power endowed with concentration due to investigation and volitional formations of striving. This, monks, is called the development of the basis of spiritual power.\"\n\n\"And what, monks, is the path leading to the development of the basis of spiritual power? It is simply this Noble Eightfold Path, namely, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This, monks, is called the path leading to the development of the basis of spiritual power.\"",
      "sinhala": "ඉන්පසු බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"ස්වාමීනි, සෘද්ධිය නම් කවරේද? සෘද්ධිපාදය නම් කවරේද? සෘද්ධිපාද භාවනාව නම් කවරේද? සෘද්ධිපාද භාවනාවට ගාමී ප්‍රතිපදාව නම් කවරේද?\"\n\n\"මහණෙනි, මෙහිලා භික්ෂුව නොයෙක් ප්‍රකාර සෘද්ධි ප්‍රාතිහාර්යයන් අනුභව කරයි. එනම්, තනිව සිටියද බොහෝ දෙනෙකු ලෙස සිටියි... (පෙ)... බඹලොව දක්වාද කයින් වසඟ කොට පවත්වයි. මහණෙනි, මෙය සෘද්ධිය යැයි කියනු ලැබේ. \"මහණෙනි, සෘද්ධිපාදය නම් කවරේද? මහණෙනි, යම් මඟක්, යම් ප්‍රතිපදාවක් සෘද්ධි ලැබීම පිණිසත්, සෘද්ධි ලබාගැනීම පිණිසත් පවතීද, මහණෙනි, මෙය සෘද්ධිපාදය යැයි කියනු ලැබේ. \"මහණෙනි, සෘද්ධිපාද භාවනාව නම් කවරේද? මහණෙනි, මෙහිලා භික්ෂුව ඡන්ද සමාධි ප්‍රධාන සංස්කාරයෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි, වීර්යය සමාධි... (පෙ)... චිත්ත සමාධි... (පෙ)... විමංසා සමාධි ප්‍රධාන සංස්කාරයෙන් යුක්ත වූ සෘද්ධිපාදය වඩයි. මහණෙනි, මෙය සෘද්ධිපාද භාවනාව යැයි කියනු ලැබේ. \"මහණෙනි, සෘද්ධිපාද භාවනාවට ගාමී ප්‍රතිපදාව නම් කවරේද? මෙයම ආර්ය අෂ්ටාංගික මාර්ගයයි, එනම් - සම්‍යක් දෘෂ්ටිය... (පෙ)... සම්‍යක් සමාධියයි. මහණෙනි, මෙය සෘද්ධිපාද භාවනාවට ගාමී ප්‍රතිපදාව යැයි කියනු ලැබේ.\"",
      "paliTitle": "Paṭhamabhikkhusuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 842,
      "pali": "Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu…pe… ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘katamā nu kho, bhikkhave, iddhi, katamo iddhipādo, katamā iddhipādabhāvanā, katamā iddhipādabhāvanāgāminī paṭipadā’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe…. ‘‘Katamā ca, bhikkhave, iddhi? Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti – ayaṃ vuccati, bhikkhave, iddhi. ‘‘Katamo ca, bhikkhave, iddhipādo? Yo, bhikkhave, maggo, yā paṭipadā iddhilābhāya iddhipaṭilābhāya saṃvattati – ayaṃ vuccati, bhikkhave, iddhipādo. ‘‘Katamā ca, bhikkhave, iddhipādabhāvanā? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ayaṃ vuccati, bhikkhave, iddhipādabhāvanā. ‘‘Katamā ca, bhikkhave, iddhipādabhāvanāgāminī paṭipadā? Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Ayaṃ vuccati, bhikkhave, iddhipādabhāvanāgāminī paṭipadā’’ti. Dasamaṃ.",
      "english": "Then, many bhikkhus approached the Blessed One, paid homage, and sat down to one side. When those bhikkhus were seated to one side, the Blessed One spoke to them thus: “What, bhikkhus, is psychic power? What is the basis of psychic power? What is the development of the basis of psychic power? What is the path leading to the development of the basis of psychic power?”\n\n“For us, Venerable Sir, the teachings have the Blessed One as their root, their guide, and their refuge. It would be good if the Blessed One were to explain the meaning of these words. Having heard it from the Blessed One, the bhikkhus will remember it.”\n\n“And what, bhikkhus, is psychic power? Here, bhikkhus, a bhikkhu experiences various kinds of psychic power: being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through air; he dives in and out of the earth as if in water; he walks on water without sinking as if on land; he flies through the air cross-legged like a winged bird; he touches and strokes the moon and sun with his hand, so mighty and powerful as they are; he exercises mastery with his body even as far as the Brahma world. This, bhikkhus, is called psychic power.”\n\n“And what, bhikkhus, is the basis of psychic power? Whatever path, bhikkhus, whatever way conduces to the acquisition and attainment of psychic power—this, bhikkhus, is called the basis of psychic power.”\n\n“And what, bhikkhus, is the development of the basis of psychic power? Here, bhikkhus, a bhikkhu develops the basis of psychic power endowed with concentration born of zeal, together with the volitional formations of striving. He develops the basis of psychic power endowed with concentration born of energy, together with the volitional formations of striving. He develops the basis of psychic power endowed with concentration born of mind, together with the volitional formations of striving. He develops the basis of psychic power endowed with concentration born of investigation, together with the volitional formations of striving. This, bhikkhus, is called the development of the basis of psychic power.”\n\n“And what, bhikkhus, is the path leading to the development of the basis of psychic power? It is precisely this Noble Eightfold Path; namely, right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This, bhikkhus, is called the path leading to the development of the basis of psychic power.”",
      "sinhala": "එවිට බොහෝ භික්ෂූහු භාග්‍ය​වතුන් වහන්සේ වෙත එළඹ, උන්වහන්සේට වන්දනා කොට, එක් පසෙකින් වාඩි වූහ. එක් පසෙකින් වැඩ සිටි ඒ භික්ෂූන්ට භාග්‍ය​වතුන් වහන්සේ මෙය වදාළ සේක: ‘‘මහණෙනි, ඍද්ධිය නම් කුමක්ද? ඍද්ධිපාදය නම් කුමක්ද? ඍද්ධිපාද භාවනාව නම් කුමක්ද? ඍද්ධිපාද භාවනාවට පමුණුවන ප්‍රතිපදාව නම් කුමක්ද?’’\n\n\"වහන්ස, අපගේ ධර්ම​යන්ට මූලය භාග්‍ය​වතුන් වහන්සේය, මග පෙන්වන්නා භාග්‍ය​වතුන් වහන්සේය, එබැවින් භාග්‍ය​වතුන් වහන්සේම මෙය වදාළ මැනව.\"\n\n‘‘මහණෙනි, ඍද්ධිය නම් කුමක්ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුවක් නොයෙකුත් ආකාරයේ ඍද්ධි විධයන් අනුභව කරයි. එනම්, එක් අයෙකු ව සිට බොහෝ දෙනෙකු බවට පත් වෙයි; බොහෝ දෙනෙකු ව සිට එක් අයෙකු බවට පත් වෙයි; ප්‍ර​කටව සිට අතුරුදහන් වෙයි; අතුරුදහන් ව සිට ප්‍ර​කටව පෙනී සිටියි; පවුරු පදනම්, කඳු හරහා කිසිදු බාධාවකින් තොරව ගමන් කරයි, අහසෙහි මෙන්. පොළොවෙහි කිමිදී මතු වෙයි, ජලයෙහි මෙන්. ජලය මත නොකිමී ගමන් කරයි, පොළොවෙහි මෙන්. අහසින් පක්ෂියෙකු සේ, කකුල් හරස් කොට හිඳ ගමන් කරයි. මෙසේ මහානුභාව සම්පන්න වූ සඳුන් හිරුන් පවා අතින් ස්පර්ශ කරයි, පිරිමදී. බ්‍රහ්ම ලෝකය දක්වාත් තම ශරීරයෙන් වසඟයට පත් කරයි. මහණෙනි, මෙය ඍද්ධිය යැයි කියනු ලැබේ.\n\n‘‘මහණෙනි, ඍද්ධිපාදය නම් කුමක්ද? මහණෙනි, ඍද්ධිය ලැබීම සඳහාත්, ඍද්ධියට පැමිණීම සඳහාත්, යම් මාර්ගයක්, යම් ප්‍රතිපදාවක් පවතීද, මහණෙනි, මෙය ඍද්ධිපාදය යැයි කියනු ලැබේ.\n\n‘‘මහණෙනි, ඍද්ධිපාද භාවනාව නම් කුමක්ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුවක්, ඡන්දය (කිරීමේ කැමැත්ත) හා වීර්යය මුල්කරගත්, සමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. වීර්යය හා වීර්යය මුල්කරගත්, සමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. සිත (චිත්තය) හා සිත මුල්කරගත්, සමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. විමංසා (පරීක්ෂා කිරීම) හා විමංසා මුල්කරගත්, සමාධිය සහ ප්‍රධාන සංස්කාරයන්ගෙන් යුක්ත වූ ඍද්ධිපාදය වඩයි. මහණෙනි, මෙය ඍද්ධිපාද භාවනාව යැයි කියනු ලැබේ.\n\n‘‘මහණෙනි, ඍද්ධිපාද භාවනාවට පමුණුවන ප්‍රතිපදාව නම් කුමක්ද? මේ ආර්ය අෂ්ටාංගික මාර්ගයම යි. එනම්: සම්මා දිට්ඨි (නිරවුල් දැක්ම), සම්මා සංකප්ප (නිරවුල් අරමුණ), සම්මා වාචා (නිරවුල් වචනය), සම්මා කම්මන්ත (නිරවුල් ක්‍රියාව), සම්මා ආජීව (නිරවුල් දිවි පෙවෙත), සම්මා වායාම (නිරවුල් වීර්යය), සම්මා සති (නිරවුල් සිහිය), සම්මා සමාධි (නිරවුල් සමාධිය) යි. මහණෙනි, මෙය ඍද්ධිපාද භාවනාවට පමුණුවන ප්‍රතිපදාව යැයි කියනු ලැබේ.’’",
      "paliTitle": "Dutiyabhikkhusuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 843,
      "pali": "Tatra kho bhagavā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’ti? Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā…pe… ‘‘catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo’’. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, moggallāno bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atippaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’…pe… iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu evaṃmahiddhiko evaṃmahānubhāvo. ‘‘Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggalāno bhikkhu evaṃ anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti… pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā moggallāno bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Ekādasamaṃ.",
      "english": "Then the Blessed One addressed the bhikkhus: \"What do you think, monks? By developing and repeatedly practicing which qualities has the bhikkhu Moggallāna become so greatly powerful and mighty?\"\n\nThe bhikkhus replied, \"Venerable sir, our teachings are rooted in the Blessed One, guided by the Blessed One. It would be excellent if the Blessed One himself would reveal the meaning of this.\"\n\n\"Monks, it is by developing and repeatedly practicing the four bases of spiritual power that the bhikkhu Moggallāna has become so greatly powerful and mighty.\"\n\n\"Which four?\"\n\n\"Here, monks, the bhikkhu Moggallāna develops the basis of spiritual power endowed with concentration due to desire and with volitional formations of exertion, (practicing thus): 'Thus, my desire will not be too sluggish, nor too agitated; it will not be inwardly contracted, nor outwardly scattered.' He also dwells perceiving before and after: 'As before, so after; as after, so before. As below, so above; as above, so below. As by day, so by night; as by night, so by day.' In this way, he develops a mind that is open, unconstricted, and luminous.\n\nHe also develops the basis of spiritual power endowed with concentration due to energy and with volitional formations of exertion, ensuring that his energy is neither too sluggish, too agitated, inwardly contracted, nor outwardly scattered. He develops the basis of spiritual power endowed with concentration due to mind and with volitional formations of exertion, ensuring that his mind is neither too sluggish, too agitated, inwardly contracted, nor outwardly scattered. And he develops the basis of spiritual power endowed with concentration due to investigation and with volitional formations of exertion, ensuring that his investigation is neither too sluggish, too agitated, inwardly contracted, nor outwardly scattered. For each of these, he dwells perceiving before and after—'as before, so after; as after, so before; as below, so above; as above, so below; as by day, so by night; as by night, so by day'—and in this way, he develops a mind that is open, unconstricted, and luminous.\n\nMonks, it is by developing and repeatedly practicing these four bases of spiritual power that the bhikkhu Moggallāna has become so greatly powerful and mighty.\n\nFurthermore, monks, by developing and repeatedly practicing these four bases of spiritual power, the bhikkhu Moggallāna experiences various kinds of spiritual power: being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if it were water; he walks on water without sinking as if it were dry land; he travels through the air, sitting cross-legged, like a winged bird; with his hand he touches and strokes the moon and sun, so mighty and powerful; and he exercises bodily mastery even up to the Brahma world.\n\nAnd furthermore, monks, by developing and repeatedly practicing these four bases of spiritual power, the bhikkhu Moggallāna, through the destruction of the taints, enters and dwells in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life.",
      "sinhala": "එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: ‘‘මහණෙනි, නුඹලා මේ කුමක් සිතන්නහුද, කුමන ධර්මයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද, මොග්ගල්ලාන භික්ෂුව මෙසේ මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති කෙනෙක් වන්නේ?’’\n\n‘‘වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේට ම අයත්ය, භාග්‍යවතුන් වහන්සේගේ ම පිහිට ඇති ඒවාය. වහන්ස, භාග්‍යවතුන් වහන්සේ ම මේ කියන ලද වචනයේ අර්ථය පැහැදිලි කර දෙන සේක්වා! භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණය කර, භික්ෂූහු එය සිත්හි දරාගන්නාහුය.’’\n\n‘‘මහණෙනි, සිව් ආකාර වූ ඍද්ධිපාදයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද, මොග්ගල්ලාන භික්ෂුව මෙසේ මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති කෙනෙක් වන්නේය.’’\n\n‘‘ඒ සිව් ආකාර කවරේද?’’\n\n‘‘මහණෙනි, මෙහිලා මොග්ගල්ලාන භික්ෂුව ඡන්දය (කිරීමේ කැමැත්ත) සමාධිය හා ප්‍රධ්‍රාන සංස්කාර (වීරිය) සමඟ යෙදුණු ඍද්ධිපාදය වඩයි. ‘මාගේ ඡන්දය අතිශයින් ලිහිල් වූවක් නොවන්නේය, අතිශයින් දැඩි වූවක්ද නොවන්නේය, ඇතුළත සංකෝචනය වූවක්ද නොවන්නේය, පිටතට වික්ෂිප්ත වූවක්ද නොවන්නේය’ යන අයුරිනි. ඔහු පසුපස හා පෙරද (සමාන වශයෙන්) සංඥා ඇතිව වාසය කරයි – ‘යම් සේ පෙරද, එසේම පසුපසද (දකිමි); යම් සේ පසුපසද, එසේම පෙරද (දකිමි); යම් සේ යටද, එසේම උඩද (දකිමි); යම් සේ උඩද, එසේම යටද (දකිමි); යම් සේ දවල්ද, එසේම රාත්‍රීද (දකිමි); යම් සේ රාත්‍රීද, එසේම දවල්ද (දකිමි)’ යන අයුරිනි. මෙසේ විවෘත වූ සිතින්, අවසාන රහිත වූ සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nවීර්යය සමාධිය හා ප්‍රධ්‍රාන සංස්කාර (වීරිය) සමඟ යෙදුණු ඍද්ධිපාදය වඩයි. ‘මාගේ වීර්යය අතිශයින් ලිහිල් වූවක් නොවන්නේය, අතිශයින් දැඩි වූවක්ද නොවන්නේය, ඇතුළත සංකෝචනය වූවක්ද නොවන්නේය, පිටතට වික්ෂිප්ත වූවක්ද නොවන්නේය’ යන අයුරිනි. ඔහු පසුපස හා පෙරද (සමාන වශයෙන්) සංඥා ඇතිව වාසය කරයි – ‘යම් සේ පෙරද, එසේම පසුපසද (දකිමි); යම් සේ පසුපසද, එසේම පෙරද (දකිමි); යම් සේ යටද, එසේම උඩද (දකිමි); යම් සේ උඩද, එසේම යටද (දකිමි); යම් සේ දවල්ද, එසේම රාත්‍රීද (දකිමි); යම් සේ රාත්‍රීද, එසේම දවල්ද (දකිමි)’ යන අයුරිනි. මෙසේ විවෘත වූ සිතින්, අවසාන රහිත වූ සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nචිත්ත සමාධිය හා ප්‍රධ්‍රාන සංස්කාර (වීරිය) සමඟ යෙදුණු ඍද්ධිපාදය වඩයි. ‘මාගේ සිත අතිශයින් ලිහිල් වූවක් නොවන්නේය, අතිශයින් දැඩි වූවක්ද නොවන්නේය, ඇතුළත සංකෝචනය වූවක්ද නොවන්නේය, පිටතට වික්ෂිප්ත වූවක්ද නොවන්නේය’ යන අයුරිනි. ඔහු පසුපස හා පෙරද (සමාන වශයෙන්) සංඥා ඇතිව වාසය කරයි – ‘යම් සේ පෙරද, එසේම පසුපසද (දකිමි); යම් සේ පසුපසද, එසේම පෙරද (දකිමි); යම් සේ යටද, එසේම උඩද (දකිමි); යම් සේ උඩද, එසේම යටද (දකිමි); යම් සේ දවල්ද, එසේම රාත්‍රීද (දකිමි); යම් සේ රාත්‍රීද, එසේම දවල්ද (දකිමි)’ යන අයුරිනි. මෙසේ විවෘත වූ සිතින්, අවසාන රහිත වූ සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nවිමංසා (විචාරය) සමාධිය හා ප්‍රධ්‍රාන සංස්කාර (වීරිය) සමඟ යෙදුණු ඍද්ධිපාදය වඩයි. ‘මාගේ විමංසාව අතිශයින් ලිහිල් වූවක් නොවන්නේය, අතිශයින් දැඩි වූවක්ද නොවන්නේය, ඇතුළත සංකෝචනය වූවක්ද නොවන්නේය, පිටතට වික්ෂිප්ත වූවක්ද නොවන්නේය’ යන අයුරිනි. ඔහු පසුපස හා පෙරද (සමාන වශයෙන්) සංඥා ඇතිව වාසය කරයි – ‘යම් සේ පෙරද, එසේම පසුපසද (දකිමි); යම් සේ පසුපසද, එසේම පෙරද (දකිමි); යම් සේ යටද, එසේම උඩද (දකිමි); යම් සේ උඩද, එසේම යටද (දකිමි); යම් සේ දවල්ද, එසේම රාත්‍රීද (දකිමි); යම් සේ රාත්‍රීද, එසේම දවල්ද (දකිමි)’ යන අයුරිනි. මෙසේ විවෘත වූ සිතින්, අවසාන රහිත වූ සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nමහණෙනි, මේ සිව් ආකාර වූ ඍද්ධිපාදයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද, මොග්ගල්ලාන භික්ෂුව මෙසේ මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති කෙනෙක් වන්නේය.\n\nතවද, මහණෙනි, මේ සිව් ආකාර වූ ඍද්ධිපාදයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද, මොග්ගල්ලාන භික්ෂුව මෙසේ බොහෝ ආකාර වූ ඍද්ධි ප්‍රභේදයන් අත්දකින්නේය – එකෙක්ව සිට බොහෝ දෙනෙක් වන්නේය, බොහෝ දෙනෙක්ව සිට එකෙක් වන්නේය; ප්‍රකටවද, නොප්‍රකටවද යන්නේය; පවුරක් බිත්තියක් හෝ කඳු පව්වක් හරහා බාධාවකින් තොරව ගමන් කරන්නේය; පොළොවෙහි කිමිදී මතු වන්නේය; වතුර මත බිඳී නොයන ලෙස යන්නේය; අහසින් පියාසර කරන්නේය; හිරු හා සඳු තම අත්ලෙන් අල්ලාගන්නේය; යම්තාක් බ්‍රහ්ම ලෝකය දක්වාද කයින් වසඟ කොට පවත්වන්නේය.\n\nතවද, මහණෙනි, මේ සිව් ආකාර වූ ඍද්ධිපාදයන් වැඩීමෙන්ද, බහුල වශයෙන් පුරුදු කිරීමෙන්ද, මොග්ගල්ලාන භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙහිම මේ භවයෙහිදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරන්නේය.’’",
      "paliTitle": "Moggallānasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 844,
      "pali": "Tatra kho bhagavā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha, bhikkhave, katamesaṃ dhammānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘catunnaṃ kho, bhikkhave, iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo’’. ‘‘Katamesaṃ catunnaṃ? Idha, bhikkhave, tathāgato chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me chando na ca atilīno bhavissati, na ca atippaggahito bhavissati, na ca ajjhattaṃ saṃkhitto bhavissati, na ca bahiddhā vikkhitto bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti – ‘iti me vīmaṃsā na ca atilīnā bhavissati, na ca atipaggahitā bhavissati, na ca ajjhattaṃ saṃkhittā bhavissati, na ca bahiddhā vikkhittā bhavissati’. Pacchāpuresaññī ca viharati – ‘yathā pure tathā pacchā, yathā pacchā tathā pure; yathā adho tathā uddhaṃ, yathā uddhaṃ tathā adho; yathā divā tathā rattiṃ, yathā rattiṃ tathā divā’. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Imesaṃ kho, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato evaṃmahiddhiko evaṃmahānubhāvo. ‘‘Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Imesañca pana, bhikkhave, catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Dvādasamaṃ. (Chapi abhiññāyo vitthāretabbā). Ayoguḷavaggo tatiyo. Tassuddānaṃ – Maggo ayoguḷo bhikkhu, suddhikañcāpi dve phalā; Dve cānandā duve bhikkhū, moggallāno tathāgatoti.",
      "english": "There, indeed, the Blessed One addressed the monks: “What do you think, monks, by the development and cultivation of which qualities does the Tathagata possess such great spiritual power and such great might?”\n“Our teachings, venerable sir, are rooted in the Blessed One, guided by the Blessed One, the Blessed One is our refuge. May the Blessed One himself explain the meaning of this statement. The monks will listen and remember.”\n“Monks, it is by the development and cultivation of the four bases of spiritual power that the Tathagata possesses such great spiritual power and such great might.”\n\n“Which four? Here, monks, the Tathagata develops the base of spiritual power endowed with concentration due to aspiration and volitional formations, thinking: ‘My aspiration will not be excessively slack, nor excessively strained; it will not be inwardly constricted, nor outwardly dispersed.’ And he dwells perceiving past and future: ‘Just as the past, so the future; just as the future, so the past; just as below, so above; just as above, so below; just as by day, so by night; just as by night, so by day.’ Thus, with an open and unconstrained mind, he develops a mind endowed with radiance.”\n\n“He develops the base of spiritual power endowed with concentration due to energy and volitional formations, thinking: ‘My energy will not be excessively slack, nor excessively strained; it will not be inwardly constricted, nor outwardly dispersed.’ And he dwells perceiving past and future: ‘Just as the past, so the future; just as the future, so the past; just as below, so above; just as above, so below; just as by day, so by night; just as by night, so by day.’ Thus, with an open and unconstrained mind, he develops a mind endowed with radiance.\nHe develops the base of spiritual power endowed with concentration due to mind and volitional formations, thinking: ‘My mind will not be excessively slack, nor excessively strained; it will not be inwardly constricted, nor outwardly dispersed.’ And he dwells perceiving past and future: ‘Just as the past, so the future; just as the future, so the past; just as below, so above; just as above, so below; just as by day, so by night; just as by night, so by day.’ Thus, with an open and unconstrained mind, he develops a mind endowed with radiance.\nHe develops the base of spiritual power endowed with concentration due to investigation and volitional formations, thinking: ‘My investigation will not be excessively slack, nor excessively strained; it will not be inwardly constricted, nor outwardly dispersed.’ And he dwells perceiving past and future: ‘Just as the past, so the future; just as the future, so the past; just as below, so above; just as above, so below; just as by day, so by night; just as by night, so by day.’ Thus, with an open and unconstrained mind, he develops a mind endowed with radiance.”\n\n“Monks, it is by the development and cultivation of these four bases of spiritual power that the Tathagata possesses such great spiritual power and such great might.”\n\n“Furthermore, monks, it is by the development and cultivation of these four bases of spiritual power that the Tathagata experiences various kinds of spiritual powers: being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if in water; he walks on water without sinking as if on land; he flies through the air cross-legged like a winged bird; he touches and strokes the moon and sun, so mighty and powerful; he wields mastery with his body even over the Brahma world.”\n\n“Furthermore, monks, it is by the development and cultivation of these four bases of spiritual power that the Tathagata, by the destruction of the taints, dwells having realized for himself, with direct knowledge, in this very life, the taintless liberation of mind and liberation through wisdom.”",
      "sinhala": "එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, කුමක් සිතන්නෙහිද? කුමන ධර්මයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් තථාගතයන් වහන්සේ මෙබඳු මහත් සෘද්ධි බලයකින්ද, මෙබඳු මහත් ආනුභාවයකින්ද යුක්ත වන්නේද?\"\n\n\"වහන්ස, ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේම මේ අර්ථය පහදා දෙන සේක්වා! භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණ කොට භික්ෂූහු එය ධාරණය කර ගනිත්වා!\"\n\n\"මහණෙනි, සතර සෘද්ධිපාදයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් තථාගතයන් වහන්සේ මෙබඳු මහත් සෘද්ධි බලයකින්ද, මෙබඳු මහත් ආනුභාවයකින්ද යුක්ත වන්නේය.\"\n\n\"කුමන සතරක්ද?\"\n\n\"මහණෙනි, මෙහිලා තථාගතයන් වහන්සේ ඡන්දසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත සෘද්ධිපාදය වඩයි – ‘මාගේ ඡන්දය අධික ලෙස හීන නොවන්නේය. අධික ලෙස උද්දාමයට පත් නොවන්නේය. මා තුළටම සංක්ෂිප්ත නොවන්නේය. පිටතට විසිරී නොයන්නේය’ යි. පසුපස හා ඉදිරිපස පිළිබඳ සංඥාවෙන් යුක්තව වාසය කරයි – ‘ඉදිරිය කෙබඳුද, පසුපසද එබඳුය. පසුපස කෙබඳුද, ඉදිරියද එබඳුය. යට කෙබඳුද, උඩද එබඳුය. උඩ කෙබඳුද, යටද එබඳුය. දවල් කෙබඳුද, රාත්‍රියද එබඳුය. රාත්‍රිය කෙබඳුද, දවල්ද එබඳුය’ යි. මේ අයුරින් විවෘත වූ සිතින්, කිසිවකින් බැඳීමක් නැති සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nවීර්යසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත සෘද්ධිපාදය වඩයි – ‘මාගේ වීර්යය අධික ලෙස හීන නොවන්නේය. අධික ලෙස උද්දාමයට පත් නොවන්නේය. මා තුළටම සංක්ෂිප්ත නොවන්නේය. පිටතට විසිරී නොයන්නේය’ යි. පසුපස හා ඉදිරිපස පිළිබඳ සංඥාවෙන් යුක්තව වාසය කරයි – ‘ඉදිරිය කෙබඳුද, පසුපසද එබඳුය. පසුපස කෙබඳුද, ඉදිරියද එබඳුය. යට කෙබඳුද, උඩද එබඳුය. උඩ කෙබඳුද, යටද එබඳුය. දවල් කෙබඳුද, රාත්‍රියද එබඳුය. රාත්‍රිය කෙබඳුද, දවල්ද එබඳුය’ යි. මේ අයුරින් විවෘත වූ සිතින්, කිසිවකින් බැඳීමක් නැති සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nචිත්තසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත සෘද්ධිපාදය වඩයි – ‘මාගේ සිත අධික ලෙස හීන නොවන්නේය. අධික ලෙස උද්දාමයට පත් නොවන්නේය. මා තුළටම සංක්ෂිප්ත නොවන්නේය. පිටතට විසිරී නොයන්නේය’ යි. පසුපස හා ඉදිරිපස පිළිබඳ සංඥාවෙන් යුක්තව වාසය කරයි – ‘ඉදිරිය කෙබඳුද, පසුපසද එබඳුය. පසුපස කෙබඳුද, ඉදිරියද එබඳුය. යට කෙබඳුද, උඩද එබඳුය. උඩ කෙබඳුද, යටද එබඳුය. දවල් කෙබඳුද, රාත්‍රියද එබඳුය. රාත්‍රිය කෙබඳුද, දවල්ද එබඳුය’ යි. මේ අයුරින් විවෘත වූ සිතින්, කිසිවකින් බැඳීමක් නැති සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nවිමංසාසමාධිය හා ප්‍රධාන සංස්කාරයෙන් යුක්ත සෘද්ධිපාදය වඩයි – ‘මාගේ විමංසාව අධික ලෙස හීන නොවන්නේය. අධික ලෙස උද්දාමයට පත් නොවන්නේය. මා තුළටම සංක්ෂිප්ත නොවන්නේය. පිටතට විසිරී නොයන්නේය’ යි. පසුපස හා ඉදිරිපස පිළිබඳ සංඥාවෙන් යුක්තව වාසය කරයි – ‘ඉදිරිය කෙබඳුද, පසුපසද එබඳුය. පසුපස කෙබඳුද, ඉදිරියද එබඳුය. යට කෙබඳුද, උඩද එබඳුය. උඩ කෙබඳුද, යටද එබඳුය. දවල් කෙබඳුද, රාත්‍රියද එබඳුය. රාත්‍රිය කෙබඳුද, දවල්ද එබඳුය’ යි. මේ අයුරින් විවෘත වූ සිතින්, කිසිවකින් බැඳීමක් නැති සිතින්, ප්‍රභාස්වර වූ සිතක් වඩයි.\n\nමහණෙනි, මේ සතර සෘද්ධිපාදයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් තථාගතයන් වහන්සේ මෙබඳු මහත් සෘද්ධි බලයකින්ද, මෙබඳු මහත් ආනුභාවයකින්ද යුක්ත වන්නේය.\n\nතවද, මහණෙනි, මේ සතර සෘද්ධිපාදයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් තථාගතයන් වහන්සේ බොහෝ ආකාර වූ සෘද්ධි ප්‍රභේද අත්දකින සේක – එකකු වී බොහෝ දෙනෙකු බවට පත්වෙයි, බොහෝ දෙනෙකු වී එකෙකු බවට පත්වෙයි, පහළ වෙයි, අතුරුදහන් වෙයි, පවුරෙන්ද පදනමෙන්ද කඳු පවුරෙන්ද බාධාවක් නැතුව යන සේක, පොළොවේ කිමිදෙයි, දිය මත ඇවිද යයි, අහසින්ද පලක් බැඳ යන සේක, සඳ හිරු දෙදෙනා පවා අතින් අතගාන සේක, බ්‍රහ්ම ලෝකයටද කයින් වසඟ කරගෙන සිටියි.\n\nතවද, මහණෙනි, මේ සතර සෘද්ධිපාදයන් වඩන ලද්දෙන්, බහුල වශයෙන් පුරුදු කරන ලද්දෙන් තථාගතයන් වහන්සේ ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කරන සේක.\"",
      "paliTitle": "Tathāgatasuttaṃ",
      "vagga": "Ayoguḷavaggo"
    },
    {
      "number": 845,
      "numberRange": "845-856",
      "pali": "‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. ‘‘Evaṃ kho, bhikkhave, bhikkhu cattāro iddhipāde bhāvento cattāro iddhipāde bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. Gaṅgāpeyyālavaggo catuttho. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. Appamādavaggo vitthāretabbo. Tassuddānaṃ – Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sāro ca vassikaṃ; Rājā candimasūriyā, vatthena dasamaṃ padanti. Balakaraṇīyavaggo vitthāretabbo. Tassuddānaṃ – Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā; Ākāsena ca dve meghā, nāvā āgantukā nadīti. Esanāvaggo vitthāretabbo. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "Just as, monks, the river Ganges inclines towards the east, slopes towards the east, and tends towards the east; even so, monks, a monk, by developing the four bases of spiritual power and repeatedly practicing the four bases of spiritual power, inclines towards Nibbāna, slopes towards Nibbāna, and tends towards Nibbāna. And how, monks, does a monk, by developing the four bases of spiritual power and repeatedly practicing the four bases of spiritual power, incline towards Nibbāna, slope towards Nibbāna, and tend towards Nibbāna? Here, monks, a monk develops the basis of spiritual power endowed with concentration due to aspiration and volitional formations of striving; he develops the basis of spiritual power endowed with concentration due to energy and volitional formations of striving; he develops the basis of spiritual power endowed with concentration due to mind and volitional formations of striving; he develops the basis of spiritual power endowed with concentration due to investigation and volitional formations of striving. It is in this way, monks, that a monk, by developing the four bases of spiritual power and repeatedly practicing the four bases of spiritual power, inclines towards Nibbāna, slopes towards Nibbāna, and tends towards Nibbāna.\n\nThe twelfth.\nThe fourth chapter is the River Ganges Repetition Chapter.\nIts summary verse: Six incline towards the east, and six incline towards the ocean; these two sixes make twelve, by which the chapter is designated.\nThe Chapter on Diligence is to be elaborated.\nIts summary verse: The Tathāgata, foot, peak, root, essence, and rain; king, moon, and sun, with cloth is the tenth item.\nThe Chapter on Things to be Strengthened is to be elaborated.\nIts summary verse: Strength, seed, and serpent, tree, with pot, and ear of grain; with sky and two clouds, boat, guest, and river.\nThe Chapter on Seekings is to be elaborated.\nIts summary verse: Seeking, conceit, taints, becoming, and the three kinds of suffering; barrenness, defilement, and distress, feeling, craving, and thirst.",
      "sinhala": "මහණෙනි, ගඟ නම් වූ නදිය නැඟෙනහිරට නැමුණු ස්වභාවයෙන්ද, නැඟෙනහිරට බර වූ ස්වභාවයෙන්ද, නැඟෙනහිරට බෑවුම් වූ ස්වභාවයෙන්ද යුක්ත වන්නාක් මෙන්, මහණෙනි, එසේම මහණෙක් සතර ඉද්ධිපාදයන් වඩන කල්හි, සතර ඉද්ධිපාදයන් බහුල වශයෙන් පුරුදු කරන කල්හි නිවනට නැමුණේ වෙයි, නිවනට බර වූයේ වෙයි, නිවනට පිළිපන්නේ වෙයි.\n\nමහණෙනි, කෙසේ නම් මහණෙක් සතර ඉද්ධිපාදයන් වඩන කල්හි, සතර ඉද්ධිපාදයන් බහුල වශයෙන් පුරුදු කරන කල්හි නිවනට නැමුණේ වෙයිද, නිවනට බර වූයේ වෙයිද, නිවනට පිළිපන්නේ වෙයිද?\n\nමහණෙනි, මෙහිලා මහණෙක් ඡන්ද (කැමැත්ත) මුල්කරගත් සමාධියෙන්ද, ප\\u200d්‍රධාන සංස්කාරයන්ගෙන්ද සමන්විත වූ ඉද්ධිපාදය වඩයි. වීර්යය මුල්කරගත් සමාධියෙන්ද, ප\\u200d්‍රධාන සංස්කාරයන්ගෙන්ද සමන්විත වූ ඉද්ධිපාදය වඩයි. සිත මුල්කරගත් සමාධියෙන්ද, ප\\u200d්‍රධාන සංස්කාරයන්ගෙන්ද සමන්විත වූ ඉද්ධිපාදය වඩයි. විමංසාව (විමසා බැලීම) මුල්කරගත් සමාධියෙන්ද, ප\\u200d්‍රධාන සංස්කාරයන්ගෙන්ද සමන්විත වූ ඉද්ධිපාදය වඩයි.\n\nමහණෙනි, මෙසේ මහණෙක් සතර ඉද්ධිපාදයන් වඩන කල්හි, සතර ඉද්ධිපාදයන් බහුල වශයෙන් පුරුදු කරන කල්හි නිවනට නැමුණේ වෙයි, නිවනට බර වූයේ වෙයි, නිවනට පිළිපන්නේ වෙයි.\n\nදොළොස්වන සූත්‍රයයි. ගංගා පෙය්‍යාලවග්ගය සතරවැන්නයි. එහි උද්දානය මෙසේය – නැඟෙනහිරට නැමුණු සූත්‍ර සයක්ද, සාගරයට නැමුණු සූත්‍ර සයක්ද වේ; මේ සය දෙක දොළොසක් වෙයි, එමගින් මේ වර්ගය කියනු ලැබේ. අප\\u200d්‍රමාදවග්ගය විස්තර කළ යුතුය. එහි උද්දානය මෙසේය – තථාගත, පද, කූට, මූල, සාර, වස්සික යන සූත්‍රයෝද; රජ, සඳ, හිරු යන සූත්‍රයෝද, වත්ථ නම් සූත්‍රය දසවන පදයයි. බලකරණීයවග්ගය විස්තර කළ යුතුය. එහි උද්දානය මෙසේය – බල, බීජ, නාග, රුක්ඛ, කුම්භ, සූකී යන සූත්‍රයෝය; ආකාස සූත්‍රයෙන්ද, ද්වේ මේඝ, නාවා, ආගන්තුක, නදී යන සූත්‍රයෝය. ඒසනා වර්ගය විස්තර කළ යුතුය. එහි උද්දානය මෙසේය – ඒසනා, විධා, ආසව, භව යන සූත්‍රයෝද; දුක්ඛතා තුනද; ඛිල, මල, නීඝ, වේදනා, තණ්හා, තසිණා යන සූත්‍රයෝද වේ.",
      "paliTitle": "Gaṅgānadīādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo"
    },
    {
      "number": 889,
      "numberRange": "889-898",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro iddhipādā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi …pe… vīmaṃsāsamādhippadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro iddhipādā bhāvetabbā’’ti. (Yathā maggasaṃyuttaṃ tathā vitthāretabbaṃ). Oghavaggo aṭṭhamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti. ",
      "english": "Monks, there are these five higher fetters. Which five? Attachment to form existence, attachment to formless existence, conceit, restlessness, and ignorance – these, monks, are the five higher fetters.\n\nFor the direct knowledge, full understanding, complete destruction, and abandonment of these five higher fetters, the four bases of spiritual power must be developed.\n\nWhich four? Here, monks, a monk develops the base of spiritual power characterized by concentration due to aspiration and volitional formations of striving; he develops the base of spiritual power characterized by concentration due to energy and volitional formations of striving; he develops the base of spiritual power characterized by concentration due to mind and volitional formations of striving; he develops the base of spiritual power characterized by concentration due to investigation and volitional formations of striving.\n\nFor the direct knowledge, full understanding, complete destruction, and abandonment of these five higher fetters, these four bases of spiritual power must be developed.",
      "sinhala": "භික්ෂූණි, මේ ඉහළ භාගයට අයත් සංයෝජන පහකි. ඒ කවරේද පහක්? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාව යන මේවායි භික්ෂූණි, ඉහළ භාගයට අයත් සංයෝජන පහ. භික්ෂූණි, මේ ඉහළ භාගයට අයත් සංයෝජන පහ සෘජුව අවබෝධ කරගැනීම පිණිස, හොඳින් වටහාගැනීම පිණිස, මුළුමනින්ම ක්ෂය කිරීම පිණිස, පහකරලීම පිණිස සතර සෘද්ධිපාදයන් වැඩිය යුතු ය. ඒ සතර කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව ඡන්දය (අධිෂ්ඨානය) හේතු කොටගෙන ඇතිවන සමාධියෙන් ද, ප්‍රධාන සංඛාරයෙන් ද සමන්විත වූ සෘද්ධිපාදය වඩයි. උත්සාහය (වීර්යය) හේතු කොටගෙන ඇතිවන සමාධියෙන් ද, ප්‍රධාන සංඛාරයෙන් ද සමන්විත වූ සෘද්ධිපාදය වඩයි. චිත්තය (සිත) හේතු කොටගෙන ඇතිවන සමාධියෙන් ද, ප්‍රධාන සංඛාරයෙන් ද සමන්විත වූ සෘද්ධිපාදය වඩයි. විමංසාව (විමර්ශනය) හේතු කොටගෙන ඇතිවන සමාධියෙන් ද, ප්‍රධාන සංඛාරයෙන් ද සමන්විත වූ සෘද්ධිපාදය වඩයි. භික්ෂූණි, මේ ඉහළ භාගයට අයත් සංයෝජන පහ සෘජුව අවබෝධ කරගැනීම පිණිස, හොඳින් වටහාගැනීම පිණිස, මුළුමනින්ම ක්ෂය කිරීම පිණිස, පහකරලීම පිණිස මේ සතර සෘද්ධිපාදයන් වැඩිය යුතු යි.",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo"
    }
  ],
  "footer": {
    "pali": "Iddhipādasaṃyuttaṃ sattamaṃ.",
    "english": "",
    "sinhala": ""
  }
}