{
  "id": "sn.5.5",
  "title": {
    "pali": "Sammappadhānasaṃyuttaṃ",
    "english": "The Connected Discourses on Right Exertion",
    "sinhala": "සම්මප්පධාන සංයුත්තය"
  },
  "sections": [
    {
      "number": 651,
      "numberRange": "651-662",
      "pali": "Sāvatthinidānaṃ. Tatra kho bhagavā etadavoca – ‘‘cattārome, bhikkhave, sammappadhānā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ime kho, bhikkhave, cattāro sammappadhānāti’’. ‘‘Seyyathāpi, bhikkhave, gaṅgā nadī pācīnaninnā pācīnapoṇā pācīnapabbhārā; evameva kho, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro. Kathañca, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Evaṃ kho, bhikkhave, bhikkhu cattāro sammappadhāne bhāvento cattāro sammappadhāne bahulīkaronto nibbānaninno hoti nibbānapoṇo nibbānapabbhāro’’ti. Dvādasamaṃ. (Sammappadhānasaṃyuttassa gaṅgāpeyyālī sammappadhānavasena vitthāretabbā). Gaṅgāpeyyālavaggo paṭhamo. Tassuddānaṃ – Cha pācīnato ninnā, cha ninnā ca samuddato; Dvete cha dvādasa honti, vaggo tena pavuccatīti. (Appamādavaggo sammappadhānavasena vitthāretabbo). Tassuddānaṃ – Tathāgataṃ padaṃ kūṭaṃ, mūlaṃ sārena vassikaṃ; Rājā candimasūriyā, vatthena dasamaṃ padanti.",
      "english": "There, the Blessed One said this: “Monks, there are these four Right Exertions. Which four? Here, monks, a monk generates desire, endeavors, arouses energy, exerts his mind, and strives for the non-arising of unarisen evil, unwholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the abandoning of arisen evil, unwholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the arising of unarisen wholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the persistence, for the non-disappearance, for the increase, for the abundance, for the development, and for the culmination of arisen wholesome states. These, monks, are the four Right Exertions.” “Monks, just as the river Ganges flows, tends, and inclines to the east; so too, monks, a monk who develops the four Right Exertions, who makes much of the four Right Exertions, flows, tends, and inclines towards Nibbāna. And how, monks, does a monk who develops the four Right Exertions, who makes much of the four Right Exertions, flow, tend, and incline towards Nibbāna? Here, monks, a monk generates desire, endeavors, arouses energy, exerts his mind, and strives for the non-arising of unarisen evil, unwholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the abandoning of arisen evil, unwholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the arising of unarisen wholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the persistence, for the non-disappearance, for the increase, for the abundance, for the development, and for the culmination of arisen wholesome states. It is in this way, monks, that a monk who develops the four Right Exertions, who makes much of the four Right Exertions, flows, tends, and inclines towards Nibbāna.”\n\nThe Twelfth. (The Ganges repetition section of the Sammappadhāna Saṃyutta is to be expanded by way of the right exertions.) The first chapter is the Ganges Repetition Chapter. Its summary: Six incline to the east, and six incline to the ocean; these two sets of six become twelve, thus the chapter is so called. (The Appamāda Chapter is to be expanded by way of the right exertions.) Its summary: The Tathāgata, the foot, the peak, the root, the essence, the rainy season; the king, the moon, the sun, the tenth word is the robe.",
      "sinhala": "සැවැත්නුවරදීය. එහිදී භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ‘‘මහණෙනි, මේ සම්මප්පධාන හතරයි. කවරේද ඒ සතර? මහණෙනි, මෙහිලා භික්ෂුව නූපන් පව් අකුසල් දහම් නූපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි. උපන් පව් අකුසල් දහම් ප්‍රහීණ කිරීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි. නූපන් කුසල් දහම් ඉපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි. උපන් කුසල් දහම් ස්ථිතිය පිණිස, මුළා නොවී පවත්වා ගැනීම පිණිස, වැඩීම පිණිස, මහත් බව පිණිස, භාවනාව පිණිස, පාරිපූර්ණත්වය පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි. මහණෙනි, මේවා සම්මප්පධාන සතර යි’’.\n\n‘‘මහණෙනි, ගංගා නදිය නැගෙනහිරට බෑවුම් ඇති, නැගෙනහිරට නැඹුරු වූ, නැගෙනහිරට ගලා යන ගංගාවක් වන්නා සේම, මහණෙනි, භික්ෂුව මේ සම්මප්පධාන සතර වඩන්නේ, සම්මප්පධාන සතර බහුල කරන්නේ, නිවනට බෑවුම් ඇති, නිවනට නැඹුරු වූ, නිවනට ගලා යන ස්වභාව ඇති අයෙක් වේ.\n\nමහණෙනි, කෙසේද භික්ෂුව සම්මප්පධාන සතර වඩන්නේ, සම්මප්පධාන සතර බහුල කරන්නේ, නිවනට බෑවුම් ඇති, නිවනට නැඹුරු වූ, නිවනට ගලා යන ස්වභාව ඇති අයෙක් වන්නේ?\n\nමහණෙනි, මෙහිලා භික්ෂුව නූපන් පව් අකුසල් දහම් නූපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි.\n\nඋපන් පව් අකුසල් දහම් ප්‍රහීණ කිරීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි.\n\nනූපන් කුසල් දහම් ඉපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි.\n\nඋපන් කුසල් දහම් ස්ථිතිය පිණිස, මුළා නොවී පවත්වා ගැනීම පිණිස, වැඩීම පිණිස, මහත් බව පිණිස, භාවනාව පිණිස, පාරිපූර්ණත්වය පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත මෙහෙයවයි, උත්සාහ කරයි.\n\n‘‘මහණෙනි, මෙසේ භික්ෂුව සම්මප්පධාන සතර වඩන්නේ, සම්මප්පධාන සතර බහුල කරන්නේ, නිවනට බෑවුම් ඇති, නිවනට නැඹුරු වූ, නිවනට ගලා යන ස්වභාව ඇති අයෙක් වේ’’ යි.",
      "paliTitle": "Pācīnādisuttadvādasakaṃ",
      "vagga": "Gaṅgāpeyyālavaggo, Appamādavaggo"
    },
    {
      "number": 673,
      "numberRange": "673-684",
      "pali": "‘‘Seyyathāpi, bhikkhave, ye keci balakaraṇīyā kammantā kayiranti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete balakaraṇīyā kammantā kayiranti; evameva kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkaroti. Kathañca, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkaroti? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya cattāro sammappadhāne bhāveti, cattāro sammappadhāne bahulīkarotī’’ti. (Evaṃ balakaraṇīyavaggo sammappadhānavasena vitthāretabbo). Dvādasamaṃ. Balakaraṇīyavaggo tatiyo. Tassuddānaṃ – Balaṃ bījañca nāgo ca, rukkho kumbhena sūkiyā; Ākāsena ca dve meghā, nāvā āgantukā nadīti.",
      "english": "Just as, monks, whatever strenuous undertakings are performed, all of them are performed depending on the earth, established on the earth; even so, monks, a monk, depending on virtue, established in virtue, develops and cultivates the four right exertions.\n\nAnd how, monks, does a monk, depending on virtue, established in virtue, develop and cultivate the four right exertions? Here, monks, a monk generates desire for the non-arising of unarisen evil unwholesome states; he endeavors, arouses energy, exerts his mind, and strives. He generates desire for the abandoning of arisen evil unwholesome states; he endeavors, arouses energy, exerts his mind, and strives. He generates desire for the arising of unarisen wholesome states; he endeavors, arouses energy, exerts his mind, and strives. He generates desire for the stability, non-disappearance, further development, abundance, cultivation, and perfection of arisen wholesome states; he endeavors, arouses energy, exerts his mind, and strives. This is how, monks, a monk, depending on virtue, established in virtue, develops and cultivates the four right exertions.",
      "sinhala": "මහණෙනි, යම් සේ යම් කිසි බලය යෙදවිය යුතු කර්මාන්ත කෙරෙත්ද, ඒ සියල්ල පොළොවට නිසර්ග කොට, පොළොවෙහි පිහිටා, එලෙසම මේ බලය යෙදවිය යුතු කර්මාන්ත කෙරෙත්ද; එලෙසම, මහණෙනි, භික්ෂුව සීලය නිසර්ග කොට, සීලයෙහි පිහිටා සිව් සම්‍යක්ප්‍රධාන වඩයි, සිව් සම්‍යක්ප්‍රධාන බහුල කරයි.\n\nමහණෙනි, කෙසේද භික්ෂුව සීලය නිසර්ග කොට, සීලයෙහි පිහිටා සිව් සම්‍යක්ප්‍රධාන වඩන්නේ, සිව් සම්‍යක්ප්‍රධාන බහුල කරන්නේ? මහණෙනි, මෙහිලා භික්ෂුව නූපන් පව් අකුසල ධර්මයන් නූපදීම පිණිස ඡන්දය උපදවයි, උත්සාහ කරයි, වීර්යය අරඹයි, සිත (ඉදිරියට) ගනී, වීර්යය කරයි; එමෙන්ම, උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොමුළුවීම පිණිස, වැඩි දියුණුව පිණිස, මහත් බව පිණිස, වැඩීම පිණිස, පිරී පැවතීම පිණිස ඡන්දය උපදවයි, උත්සාහ කරයි, වීර්යය අරඹයි, සිත (ඉදිරියට) ගනී, වීර්යය කරයි. මහණෙනි, මෙලෙසින්ම භික්ෂුව සීලය නිසර්ග කොට, සීලයෙහි පිහිටා සිව් සම්‍යක්ප්‍රධාන වඩයි, සිව් සම්‍යක්ප්‍රධාන බහුල කරයි.",
      "paliTitle": "Balakaraṇīyādisuttadvādasakaṃ",
      "vagga": "Balakaraṇīyavaggo"
    },
    {
      "number": 685,
      "numberRange": "685-694",
      "pali": "‘‘Tisso imā, bhikkhave, esanā. Katamā tisso? Kāmesanā, bhavesanā, brahmacariyesanā – imā kho, bhikkhave, tisso esanā. Imāsaṃ kho, bhikkhave, tissannaṃ esanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imāsaṃ kho, bhikkhave, tissannaṃ esanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. (Vitthāretabbaṃ). Dasamaṃ. Esanāvaggo catuttho. Tassuddānaṃ – Esanā vidhā āsavo, bhavo ca dukkhatā tisso; Khilaṃ malañca nīgho ca, vedanā taṇhā tasinā cāti.",
      "english": "Bhikkhus, there are these three seekings. Which three? The seeking after sensual pleasures, the seeking after existence, and the seeking after the holy life. Indeed, bhikkhus, these are the three seekings.\n\nIndeed, bhikkhus, for the direct knowledge, for the complete understanding, for the utter ending, and for the abandonment of these three seekings, the four right exertions must be developed. Which four?\n\nHere, bhikkhus, a bhikkhu generates desire, endeavors, arouses energy, exerts his mind, and strives for the non-arising of unarisen unwholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the abandonment of arisen unwholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the arising of unarisen wholesome states. He generates desire, endeavors, arouses energy, exerts his mind, and strives for the maintenance, non-decay, further increase, growth, development, and perfection of arisen wholesome states.\n\nIndeed, bhikkhus, for the direct knowledge, for the complete understanding, for the utter ending, and for the abandonment of these three seekings, these four right exertions must be developed.",
      "sinhala": "මහණෙනි, මේවා එසනා තුනකි. කවරේද ඒ තුන? කාමේසනා, භවේසනා, බ්‍රU+200DහU+200D්මචරියේසනා – මහණෙනි, මේවා එසනා තුනකි. මහණෙනි, මේ එසනා තුන පිළිබඳව අවබෝධ කරගැනීම පිණිසත්, මනාකොට දැනගැනීම පිණිසත්, ක්‍U+200Dෂය කිරීම පිණිසත්, ප‍්‍රU+200Dහාණය කිරීම පිණිසත් සතර සම්‍U+200Dයක්ප‍්‍රU+200Dධානයන් වැඩිය යුතු ය. කවරේද ඒ සතර? මහණෙනි, මෙහි භික්‍U+200Dෂුව නූපන් අකුසල් ධරU+200D්මයන් නූපදවීම පිණිසත්, උපන් අකුසල් ධරU+200D්මයන් ප‍්‍රU+200Dහාණය කිරීම පිණිසත්, නූපන් කුසල් ධරU+200D්මයන් ඉපදවීම පිණිසත්, උපන් කුසල් ධරU+200D්මයන් තත්ත්වයේ තබාගැනීම පිණිසත්, අමතක නොවීම පිණිසත්, වැඩි දියුණු වීම පිණිසත්, වර්ධනය වීම පිණිසත්, වැඩීම පිණිසත්, පිරී ඉතිරී යාම පිණිසත් කැමැත්ත උපදවයි, උත්සාහ කරයි, වීර්U+200Dයය අරඹයි, සිත දැඩිව ගනියි, වීර්U+200Dයය කරයි. මහණෙනි, මේ එසනා තුන පිළිබඳව අවබෝධ කරගැනීම පිණිසත්, මනාකොට දැනගැනීම පිණිසත්, ක්‍U+200Dෂය කිරීම පිණිසත්, ප‍්‍රU+200Dහාණය කිරීම පිණිසත් මේ සතර සම්‍U+200Dයක්ප‍්‍රU+200Dධානයන් වැඩිය යුතු ය.",
      "paliTitle": "Esanādisuttadasakaṃ",
      "vagga": "Esanāvaggo"
    },
    {
      "number": 695,
      "numberRange": "695-704",
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ abhiññāya pariññāya parikkhayāya pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. (Vitthāretabbā). Dasamaṃ. Oghavaggo pañcamo. Tassuddānaṃ – Ogho yogo upādānaṃ, ganthā anusayena ca; Kāmaguṇā nīvaraṇā, khandhā oruddhambhāgiyāti. ",
      "english": "Monks, there are these five fetters pertaining to the higher realms. Which five? They are craving for form, craving for the formless, conceit, restlessness, and ignorance. These, monks, are the five fetters pertaining to the higher realms.\n\nFor the direct knowledge, for the full understanding, for the utter destruction, and for the abandonment of these five fetters pertaining to the higher realms, the four right strivings are to be developed. Which four?\n\nHere, monks, a monk, for the non-arising of unarisen evil unwholesome states, generates desire, strives, arouses energy, exerts his mind, and makes an effort. For the abandonment of arisen evil unwholesome states, he generates desire, strives, arouses energy, exerts his mind, and makes an effort. For the arising of unarisen wholesome states, he generates desire, strives, arouses energy, exerts his mind, and makes an effort. For the maintenance, non-disappearance, increase, development, and perfection of arisen wholesome states, he generates desire, strives, arouses energy, exerts his mind, and makes an effort.\n\nIt is for the direct knowledge, for the full understanding, for the utter destruction, and for the abandonment of these five fetters pertaining to the higher realms that these four right strivings are to be developed.",
      "sinhala": "භික්ෂූණි, මේ උද්ධම්භාගීය සංයෝජන පහකි. ඒ පහ කවරේද? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාව යන මේවා භික්ෂූණි, උද්ධම්භාගීය සංයෝජන පහයි. භික්ෂූණි, මේ උද්ධම්භාගීය සංයෝජන පහ අවබෝධ කරගැනීම පිණිස, හොඳින් දැනගැනීම පිණිස, ක්ෂය කිරීම පිණිස, ප්‍රහාණය කිරීම පිණිස සිව් සම්‍යක්‍ ප්‍රධානයන් වඩනු ලැබිය යුතුය. ඒ සිව් සම්‍යක්‍ ප්‍රධානයන් කවරේද? භික්ෂූණි, මෙහි භික්ෂුව නූපන් අකුසල ධර්මයන් නූපදවීම පිණිස, උපන් අකුසල ධර්මයන් ප්‍රහාණය කිරීම පිණිස, නූපන් කුසල ධර්මයන් ඉපදවීම පිණිස, උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොපිරිහීම පිණිස, දියුණුව පිණිස, වර්ධනය පිණිස, වැඩීම පිණිස, සම්පූර්ණත්වය පිණිස ඡන්දය උපදවයි; වෑයම් කරයි; වීර්යය අරඹයි; සිත දැඩි කරයි; (කුසලයෙහි) යොදවයි. භික්ෂූණි, මේ උද්ධම්භාගීය සංයෝජන පහ අවබෝධ කරගැනීම පිණිස, හොඳින් දැනගැනීම පිණිස, ක්ෂය කිරීම පිණිස, ප්‍රහාණය කිරීම පිණිස, මේ සිව් සම්‍යක්‍ ප්‍රධානයන් වඩනු ලැබිය යුතුය.",
      "paliTitle": "Oghādisuttadasakaṃ",
      "vagga": "Oghavaggo"
    }
  ],
  "footer": {
    "pali": "Sammappadhānasaṃyuttaṃ pañcamaṃ.",
    "english": "",
    "sinhala": ""
  }
}