{
  "id": "cnd.5",
  "title": {
    "pali": "Catutthavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 151,
      "pali": "Rasesu gedhaṃ akaraṃ alolo, anaññaposī sapadānacārī; Kule kule appaṭibaddhacitto, eko care khaggavisāṇakappo. Rasesu gedhaṃ akaraṃ aloloti. Rasoti mūlaraso khandharaso tacaraso pattaraso puppharaso phalaraso, ambilaṃ madhuraṃ tittakaṃ kaṭukaṃ loṇikaṃ khārikaṃ lambikaṃ [lambilaṃ (syā. ka.) passa āyatanavibhaṅge] kasāvo sādu asādu sītaṃ uṇhaṃ. Santeke samaṇabrāhmaṇā rasagiddhā. Te jivhaggena rasaggāni pariyesantā āhiṇḍanti. Te ambilaṃ labhitvā anambilaṃ pariyesanti, anambilaṃ labhitvā ambilaṃ pariyesanti; madhuraṃ labhitvā amadhuraṃ pariyesanti, amadhuraṃ labhitvā madhuraṃ pariyesanti; tittakaṃ labhitvā atittakaṃ pariyesanti, atittakaṃ labhitvā tittakaṃ pariyesanti; kaṭukaṃ labhitvā akuṭakaṃ pariyesanti, akuṭakaṃ labhitvā kaṭukaṃ pariyesanti; loṇikaṃ labhitvā aloṇikaṃ pariyesanti, aloṇikaṃ labhitvā loṇikaṃ pariyesanti; khārikaṃ labhitvā akhārikaṃ pariyesanti, akhārikaṃ labhitvā khārikaṃ pariyesanti; kasāvaṃ labhitvā akasāvaṃ pariyesanti, akasāvaṃ labhitvā kasāvaṃ pariyesanti; lambikaṃ labhitvā alambikaṃ pariyesanti, alambikaṃ labhitvā lambikaṃ pariyesanti; sāduṃ labhitvā asāduṃ pariyesanti, asāduṃ labhitvā sāduṃ pariyesanti; sītaṃ labhitvā uṇhaṃ pariyesanti, uṇhaṃ labhitvā sītaṃ pariyesanti. Te yaṃ yaṃ labhanti tena tena na tussanti, aparāparaṃ pariyesanti. Manāpikesu rasesu rattā giddhā gathitā mucchitā ajjhosannā laggā laggitā palibuddhā. Sā rasataṇhā tassa paccekasambuddhassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Tasmā so paccekasambuddho paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘‘neva davāya na madāya na maṇḍanāya na vibhūsanāya; yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya. Iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’’ti. Yathā vaṇaṃ ālimpeyya yāvadeva āruhaṇatthāya [ropanatthāya (syā.)], yathā vā akkhaṃ abbhañjeyya yāvadeva bhārassa nittharaṇatthāya, yathā puttamaṃsaṃ āhāraṃ āhareyya yāvadeva kantārassa nittharaṇatthāya; evameva so paccekasambuddho paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘‘neva davāya na madāya na maṇḍanāya na vibhūsanāya; yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya. Iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’’ti. Rasataṇhāya ārato virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – rasesu gedhaṃ akaraṃ. Aloloti loluppaṃ vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Sā loluppā taṇhā tassa paccekasambuddhassa pahīnā ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Tasmā paccekasambuddho aloloti – rasesu gedhaṃ akaraṃ alolo. Anaññaposī sapadānacārīti anaññaposīti so paccekasambuddho attānaññeva poseti, na paranti. Anaññaposimaññātaṃ, dantaṃ sāre patiṭṭhitaṃ [sāresu supatiṭṭhitaṃ (syā. ka.) passa udā. 6]; Khīṇāsavaṃ vantadosaṃ, tamahaṃ brūmi brāhmaṇanti. Anaññaposī sapadānacārīti so paccekasambuddho pubbaṇhasamayaṃ [pubbanhasamayaṃ (ka.)] nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati rakkhiteneva kāyena rakkhitāya vācāya rakkhitena cittena upaṭṭhitāya satiyā saṃvutehi indriyehi. Okkhittacakkhu iriyāpathasampanno kulā kulaṃ anatikkamanto piṇḍāya caratīti – anaññaposī sapadānacārī. Kule kule appaṭibaddhacittoti dvīhi kāraṇehi paṭibaddhacitto hoti – attānaṃ vā nīcaṃ ṭhapento paraṃ uccaṃ ṭhapento paṭibaddhacitto hoti, attānaṃ vā uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento paṭibaddhacitto hoti. Kathaṃ attānaṃ nīcaṃ ṭhapento paraṃ uccaṃ ṭhapento paṭibaddhacitto hoti? ‘‘Tumhe me bahūpakārā, ahaṃ tumhe nissāya labhāmi cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhāraṃ. Yampi me aññe dātuṃ vā kātuṃ vā maññanti tumhe nissāya tumhe passantā. Yampi me porāṇaṃ mātāpettikaṃ nāmagottaṃ tampi me antarahitaṃ tumhehi ahaṃ ñāyāmi – ‘asukassa kulupako, asukāya kulupako’’’ti. Evaṃ attānaṃ nīcaṃ ṭhapento paraṃ uccaṃ ṭhapento paṭibaddhacitto hoti. Kathaṃ attānaṃ uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento paṭibaddhacitto hoti? ‘‘Ahaṃ tumhākaṃ bahūpakāro, tumhe maṃ āgamma buddhaṃ saraṇaṃ gatā dhammaṃ saraṇaṃ gatā saṅghaṃ saraṇaṃ gatā, pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjapamādaṭṭhānā paṭiviratā, tumhākaṃ ahaṃ uddesaṃ demi paripucchaṃ demi uposathaṃ ācikkhāmi navakammaṃ adhiṭṭhāmi; atha ca pana tumhe maṃ ujjhitvā aññe sakkarotha garuṃ karotha mānetha pūjethā’’ti. Evaṃ attānaṃ uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento paṭibaddhacitto hoti. Kule kule appaṭibaddhacittoti so paccekasambuddho kulapalibodhena appaṭibaddhacitto hoti, gaṇapalibodhena appaṭibaddhacitto hoti, āvāsapalibodhena appaṭibaddhacitto hoti, cīvarapalibodhena appaṭibaddhacitto hoti, piṇḍapātapalibodhena appaṭibaddhacitto hoti, senāsanapalibodhena appaṭibaddhacitto hoti, gilānapaccayabhesajjaparikkhārapalibodhena appaṭibaddhacitto hotīti – kule kule appaṭibaddhacitto, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Rasesu gedhaṃ akaraṃ alolo, anaññaposī sapadānacārī; Kule kule appaṭibaddhacitto, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 152,
      "pali": "Pahāya pañcāvaraṇāni cetaso, upakkilese byapanujja sabbe; Anissito chetva [chetvā (syā. ka.)] sinehadosaṃ[snehadosaṃ (syā. ka.)], eko care khaggavisāṇakappo. Pahāya pañcāvaraṇāni cetasoti so paccekasambuddho kāmacchandanīvaraṇaṃ pahāya pajahitvā vinodetvā byantīkaritvā anabhāvaṃ gametvā, byāpādanīvaraṇaṃ… thinamiddhanīvaraṇaṃ… uddhaccakukkuccanīvaraṇaṃ… vicikicchānīvaraṇaṃ pahāya pajahitvā vinodetvā byantīkaritvā anabhāvaṃ gametvā vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharatīti – pahāya pañcāvaraṇāni cetaso. Upakkilese byapanujja sabbeti rāgo cittassa upakkileso, doso cittassa upakkileso, moho cittassa upakkileso, kodho… upanāho…pe… sabbākusalābhisaṅkhārā cittassa upakkilesā. Upakkilese byapanujja sabbeti sabbe cittassa upakkilese byapanujja panuditvā pajahitvā vinodetvā byantīkaritvā anabhāvaṃ gametvāti – upakkilese byapanujja sabbe. Anissito chetva sinehadosanti. Anissitoti dve nissayā – taṇhānissayo ca diṭṭhinissayo ca…pe… ayaṃ taṇhānissayo…pe… ayaṃ diṭṭhinissayo. Sinehoti dve snehā – taṇhāsneho ca diṭṭhisneho ca…pe… ayaṃ taṇhāsneho…pe… ayaṃ diṭṭhisneho. Dosoti yo cittassa āghāto paṭighāto paṭighaṃ paṭivirodho kopo pakopo sampakopo doso padoso sampadoso cittassa byāpatti manopadoso kodho kujjhanā kujjhitattaṃ doso dussanā dussitattaṃ byāpatti byāpajjanā byāpajjitattaṃ caṇḍikkaṃ asuropo anattamanatā cittassa. Anissito chetva sinehadosanti so paccekasambuddho taṇhāsnehañca diṭṭhisnehañca dosañca chetvā ucchinditvā samucchinditvā pajahitvā vinodetvā byantīkaritvā anabhāvaṃ gametvā cakkhuṃ anissito, sotaṃ anissito…pe… diṭṭhasutamutaviññātabbe dhamme anissito anallīno anupagato anajjhosito anadhimutto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – anissito chetva sinehadosaṃ, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Pahāya pañcāvaraṇāni cetaso, upakkilese byapanujja sabbe; Anissito chetva sinehadosaṃ, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 153,
      "pali": "Vipiṭṭhikatvāna sukhaṃ dukhañca, pubbeva ca somanassadomanassaṃ; Laddhānupekkhaṃ samathaṃ visuddhaṃ, eko care khaggavisāṇakappo. Vipiṭṭhikatvāna sukhaṃ dukhañca, pubbeva ca somanassadomanassanti so paccekasambuddho sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharatīti – vipiṭṭhikatvāna sukhaṃ dukhañca, pubbeva ca somanassadomanassaṃ. Laddhānupekkhaṃsamathaṃ visuddhanti. Upekkhāti yā catutthajjhāne upekkhā upekkhanā ajjhupekkhanā cittasamatā cittappassaddhatā [cittavisaṭatā (ka.) passa mahāni. 207] majjhattatā cittassa. Samathoti yā cittassa ṭhiti saṇṭhiti avaṭṭhiti avisāhāro [avisaṃhāro (ka.) passa dha. sa. 11, 15] avikkhepo avisāhaṭamānasatā [avisaṃhaṭamānasatā (ka.)] samatho samādhindriyaṃ samādhibalaṃ sammāsamādhi; catutthajjhāne upekkhā ca samatho ca suddhā honti visuddhā pariyodātā anaṅgaṇā vigatūpakkilesā mudubhūtā kammaniyā ṭhitā āneñjappattā. Laddhānupekkhaṃ samathaṃ visuddhanti catutthajjhānaṃ upekkhañca samathañca laddhā labhitvā vinditvā paṭilabhitvāti – laddhānupekkhaṃ samathaṃ visuddhaṃ, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Vipiṭṭhikatvāna sukhaṃ dukhañca, pubbeva ca somanassadomanassaṃ; Laddhānupekkhaṃ samathaṃ visuddhaṃ, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 154,
      "pali": "Āraddhavīriyo paramatthapattiyā, alīnacitto akusītavutti; Daḷhanikkamo thāmabalūpapanno, eko care khaggavisāṇakappo. Āraddhavīriyo paramatthapattiyāti paramatthaṃ vuccati amataṃ nibbānaṃ. Yo so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ. Paramatthassa pattiyā lābhāya paṭilābhāya adhigamāya phassanāya sacchikiriyāya āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ sampadāya thāmavā [thāmasā (ka.)] daḷhaparakkamo anikkhittadhuro kusalesu dhammesūti – āraddhavīriyo paramatthapattiyā. Alīnacitto akusītavuttīti so paccekasambuddho anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati, uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya…pe… anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya…pe… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā [bhāvanāpāripūriyā (syā.)] chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahatīti – evaṃ alīnacitto akusītavutti. Atha vā, ‘‘kāmaṃ taco ca nhāru ca aṭṭhi ca avasissatu [avasussatu (syā.) ma. ni. 2.184; saṃ. ni. 2.22 passitabbaṃ], sarīre upasussatu maṃsalohitaṃ, yaṃ taṃ purisathāmena purisabalena purisavīriyena purisaparakkamena pattabbaṃ na taṃ apāpuṇitvā vīriyassa saṇṭhānaṃ [viriyassa ṭhānaṃ (syā.)] bhavissatī’’ti cittaṃ paggaṇhāti padahati. Evampi alīnacitto akusītavutti. Nāsissaṃ na pivissāmi, vihārato na nikkhame; Napi passaṃ nipātessaṃ, taṇhāsalle anūhateti. Cittaṃ paggaṇhāti padahati. Evampi alīnacitto akusītavutti. ‘‘Na tāvāhaṃ imaṃ pallaṅkaṃ bhindissāmi yāva me na anupādāya āsavehi cittaṃ vimuccissatī’’ti cittaṃ paggaṇhāti padahati. Evampi alīnacitto akusītavutti. ‘‘Na tāvāhaṃ imamhā āsanā vuṭṭhahissāmi yāva me na anupādāya āsavehi cittaṃ vimuccissatī’’ti cittaṃ paggaṇhāti padahati. Evampi alīnacitto akusītavutti. ‘‘Na tāvāhaṃ imamhā caṅkamā orohissāmi…pe… vihārā nikkhamissāmi… aḍḍhayogā nikkhamissāmi… pāsādā nikkhamissāmi… hammiyā nikkhamissāmi… guhāya nikkhamissāmi… leṇā nikkhamissāmi… kuṭiyā nikkhamissāmi… kūṭāgārā nikkhamissāmi… aṭṭā nikkhamissāmi… māḷā nikkhamissāmi… uddaṇḍā nikkhamissāmi … upaṭṭhānasālāya nikkhamissāmi… maṇḍapā nikkhamissāmi… rukkhamūlā nikkhamissāmi yāva me na anupādāya āsavehi cittaṃ vimuccissatī’’ti cittaṃ paggaṇhāti padahati. Evampi alīnacitto akusītavutti. ‘‘Imasmiṃyeva pubbaṇhasamaye [pubbaṇhasamayaṃ (ka.) mahāni. 17] ariyadhammaṃ āharissāmi samāharissāmi adhigacchissāmi phassayissāmi sacchikarissāmī’’ti cittaṃ paggaṇhāti padahati. Evampi alīnacitto akusītavutti. Imasmiṃyeva majjhanhikasamaye…pe… sāyanhasamaye …pe… purebhattaṃ… pacchābhattaṃ… purimayāmaṃ… majjhimayāmaṃ… pacchimayāmaṃ… kāḷe… juṇhe… vasse… hemante … gimhe… purime vayokhandhe… majjhime vayokhandhe… pacchime vayokhandhe ariyadhammaṃ āharissāmi samāharissāmi adhigacchissāmi phassayissāmi sacchikarissāmīti cittaṃ paggaṇhāti padahati. Evampi alīnacitto akusītavutti. Daḷhanikkamo thāmabalūpapannoti so paccekasambuddho daḷhasamādāno ahosi kusalesu dhammesu avaṭṭhitasamādāno kāyasucarite vacīsucarite manosucarite dānasaṃvibhāge sīlasamādāne uposathupavāse matteyyatāya [metteyyatāya (syā. ka.) moggallānabyākaraṇe 4.39 suttaṃ oloketabbaṃ] petteyyatāya sāmaññatāya brahmaññatāya kulejeṭṭhāpacāyitāya aññataraññataresu adhikusalesu dhammesūti – daḷhanikkamo. Thāmabalūpapannoti so paccekasambuddho thāmena ca balena ca vīriyena ca parakkamena ca paññāya ca upeto hoti samupeto upāgato samupāgato upapanno samupapanno samannāgatoti – daḷhanikkamo thāmabalūpapanno, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Āraddhavīriyo paramatthapattiyā, alīnacitto akusītavutti; Daḷhanikkamo thāmabalūpapanno, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 155,
      "pali": "Paṭisallānaṃ jhānamariñcamāno, dhammesu niccaṃ anudhammacārī; Ādīnavaṃsammasitā bhavesu, eko care khaggavisāṇakappo. Paṭisallānaṃ jhānamariñcamānoti so paccekasambuddho paṭisallānārāmo hoti paṭisallānarato ajjhattaṃ cetosamathamanuyutto anirākatajjhāno vipassanāya samannāgato brūhetā suññāgāraṃ jhāyī jhānarato ekattamanuyutto sadatthagarukoti paṭisallānaṃ. Jhānamariñcamānoti so paccekasambuddho dvīhi kāraṇehi jhānaṃ na riñcati – anuppannassa vā paṭhamassa jhānassa uppādāya yutto payutto saṃyutto āyutto samāyutto, anuppannassa vā dutiyassa jhānassa…pe… anuppannassa vā tatiyassa jhānassa… anuppannassa vā catutthassa jhānassa uppādāya yutto payutto saṃyutto āyutto samāyuttoti – evampi jhānaṃ na riñcati. Atha vā, uppannaṃ vā paṭhamaṃ jhānaṃ āsevati bhāveti bahulīkaroti, uppannaṃ vā dutiyaṃ jhānaṃ…pe… uppannaṃ vā tatiyaṃ jhānaṃ… uppannaṃ vā catutthaṃ jhānaṃ āsevati bhāveti bahulīkaroti. Evampi jhānaṃ na riñcatīti – paṭisallānaṃ jhānamariñcamāno. Dhammesu niccaṃ anudhammacārīti dhammā vuccanti cattāro satipaṭṭhānā…pe… ariyo aṭṭhaṅgiko maggo. Katame anudhammā? Sammāpaṭipadā apaccanīkapaṭipadā anvatthapaṭipadā dhammānudhammapaṭipadā sīlesu paripūrakāritā indriyesu guttadvāratā bhojane mattaññutā jāgariyānuyogo satisampajaññaṃ – ime vuccanti anudhammā. Dhammesu niccaṃ anudhammacārīti dhammesu niccakālaṃ dhuvakālaṃ satataṃ samitaṃ avokiṇṇaṃ poṅkhānupoṅkhaṃ udakūmikajātaṃ [udakummijātaṃ (syā.), udakummikajātaṃ (ka.)] Avīcisantatisahitaṃ phassitaṃ purebhattaṃ pacchābhattaṃ purimayāmaṃ majjhimayāmaṃ pacchimayāmaṃ kāḷe juṇhe vasse hemante gimhe purime vayokhandhe majjhime vayokhandhe pacchime vayokhandhe carati viharati iriyati vatteti pāleti yapeti yāpetīti – dhammesu niccaṃ anudhammacārī. Ādīnavaṃ sammasitā bhavesūti ‘‘sabbe saṅkhārā aniccā’’ti ādīnavaṃ sammasitā bhavesu, ‘‘sabbe saṅkhārā dukkhā’’ti…pe… ‘‘sabbe dhammā anattā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’’nti ādīnavaṃ sammasitā bhavesūti – ādīnavaṃ sammasitā bhavesu, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Paṭisallānaṃ jhānamariñcamāno, dhammesu niccaṃ anudhammacārī; Ādīnavaṃ sammasitā bhavesu, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 156,
      "pali": "Taṇhakkhayaṃpatthayamappamatto, aneḷamūgo [anelamūgo (syā. ka.)] sutavā satīmā; Saṅkhātadhammo niyato padhānavā, eko care khaggavisāṇakappo. Taṇhakkhayaṃ patthayamappamattoti. Taṇhāti rūpataṇhā…pe… dhammataṇhā. Taṇhakkhayanti rāgakkhayaṃ dosakkhayaṃ mohakkhayaṃ gatikkhayaṃ upapattikkhayaṃ paṭisandhikkhayaṃ bhavakkhayaṃ saṃsārakkhayaṃ vaṭṭakkhayaṃ patthayanto icchanto sādiyanto pihayanto abhijappantoti – taṇhakkhayaṃ patthayaṃ. Appamattoti so paccekasambuddho sakkaccakārī sātaccakārī…pe… appamādo kusalesu dhammesūti – taṇhakkhayaṃ patthayamappamatto. Aneḷamūgo sutavā satīmāti. Aneḷamūgoti so paccekasambuddho paṇḍito paññavā buddhimā ñāṇī vibhāvī medhāvī. Sutavāti so paccekasambuddho bahussuto hoti sutadharo sutasanniccayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Satīmāti so paccekasambuddho satimā hoti paramena satinepakkena samannāgatattā cirakatampi cirabhāsitampi saritā anussaritāti – aneḷamūgo sutavā satīmā. Saṅkhātadhammo niyato padhānavāti saṅkhātadhammo vuccati ñāṇaṃ. Yā paññā pajānanā… pe… amoho dhammavicayo sammādiṭṭhi. Saṅkhātadhammoti so paccekasambuddho saṅkhātadhammo ñātadhammo tulitadhammo tīritadhammo vibhūtadhammo vibhāvitadhammo ‘‘sabbe saṅkhārā aniccā’’ti saṅkhātadhammo…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti saṅkhātadhammo ñātadhammo tulitadhammo tīritadhammo vibhūtadhammo vibhāvitadhammo. Atha vā, tassa paccekasambuddhassa ca khandhā saṃkhittā dhātuyo saṃkhittā āyatanāni saṃkhittāni gatiyo saṃkhittā upapattiyo saṃkhittā paṭisandhiyo saṃkhittā bhavā saṃkhittā saṃsārā saṃkhittā vaṭṭā saṃkhittā. Atha vā, so paccekasambuddho khandhapariyante ṭhito dhātupariyante ṭhito āyatanapariyante ṭhito gatipariyante ṭhito upapattipariyante ṭhito paṭisandhipariyante ṭhito bhavapariyante ṭhito saṃsārapariyante ṭhito vaṭṭapariyante ṭhito saṅkhārapariyante ṭhito antimabhave [antime bhave (ka.) cūḷani. mettagūmāṇavapucchāniddesa 28] ṭhito antimasamussaye ṭhito antimadehadharo paccekasambuddho. Tassāyaṃ pacchimako bhavo, carimoyaṃ samussayo; Jātimaraṇasaṃsāro [jātijarāmaraṇasaṃsāro (syā.) evamīdisesu ṭhānesu], natthi tassa punabbhavoti. Taṃkāraṇā paccekasambuddho saṅkhātadhammo. Niyatoti niyāmā vuccanti cattāro ariyamaggā. Catūhi ariyamaggehi samannāgatoti niyato. Niyāmaṃ patto sampatto adhigato phassito sacchikato patto niyāmaṃ. Padhānavāti padhānaṃ vuccati vīriyaṃ. So cetaso vīriyārambho nikkamo parakkamo uyyāmo vāyāmo ussāho ussoḷhī thāmo dhiti asithilaparakkamo anikkhittacchandatā anikkhittadhuratā dhurasampaggāho vīriyaṃ vīriyindriyaṃ vīriyabalaṃ sammāvāyāmo. So paccekasambuddho iminā padhānena upeto samupeto upāgato samupāgato upapanno samupapanno samannāgato. Tasmā so paccekasambuddho padhānavāti – saṅkhātadhammo niyato padhānavā, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Taṇhakkhayaṃ patthayamappamatto, aneḷamūgo sutavā satīmā; Saṅkhātadhammo niyato padhānavā, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 157,
      "pali": "Sīhova saddesu asantasanto, vātova jālamhi asajjamāno; Padumaṃva toyena alimpamāno [alippamāno, su. ni. 71], eko care khaggavisāṇakappo. Sīhova saddesu asantasantoti yathā sīho migarājā saddesu asantāsī aparisantāsī anutrāsī anubbiggo anussaṅkī [anussukī (syā.)] anutrāso abhīrū acchambhī anutrāsī apalāyī, paccekasambuddhopi saddesu asantāsī aparisantāsī anutrāsī anubbiggo anussaṅkī anutrāso abhīrū acchambhī anutrāsī apalāyī pahīnabhayabheravo vigatalomahaṃso viharatīti – sīhova saddesu asantasanto. Vātova jālamhi asajjamānoti. Vātoti puratthimā vātā pacchimā vātā uttarā vātā dakkhiṇā vātā sarajā vātā arajā vātā sītā vātā uṇhā vātā parittā vātā adhimattā vātā verambhavātā pakkhavātā [pakkhivātā (syā.) cūḷani. upasīvamāṇavapucchāniddesa 43, khaggavisāṇasuttaniddesa 138 natthi pāṭhanānattaṃ] supaṇṇavātā tālapaṇṇavātā vidhūpanavātā. Jālaṃ vuccati suttajālaṃ. Yathā vāto jālamhi na sajjati na gaṇhāti na bajjhati na palibajjhati, evameva dve jālā – taṇhājālañca diṭṭhijālañca…pe… idaṃ taṇhājālaṃ…pe… idaṃ diṭṭhijālaṃ. Tassa paccekasambuddhassa taṇhājālaṃ pahīnaṃ diṭṭhijālaṃ paṭinissaṭṭhaṃ, taṇhājālassa pahīnattā diṭṭhijālassa paṭinissaṭṭhattā so paccekasambuddho rūpe na sajjati sadde na sajjati…pe… diṭṭhasutamutaviññātabbesu dhammesu na sajjati na gaṇhāti na bajjhati na palibajjhati nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – vātova jālamhi asajjamāno. Padumaṃva toyena alimpamānoti padumaṃ vuccati padumapupphaṃ. Toyaṃ vuccati udakaṃ. Yathā padumapupphaṃ toyena na limpati na palimpati na upalimpati, alittaṃ apalittaṃ anupalittaṃ, evameva dve lepā – taṇhālepo ca diṭṭhilepo ca…pe… ayaṃ taṇhālepo…pe… ayaṃ diṭṭhilepo. Tassa paccekasambuddhassa taṇhālepo pahīno, diṭṭhilepo paṭinissaṭṭho. Taṇhālepassa pahīnattā diṭṭhilepassa paṭinisaṭṭhattā so paccekasambuddho rūpe na limpati sadde na limpati…pe… diṭṭhasutamutaviññātabbesu dhammesu na limpati na palimpati na upalimpati, alitto apalitto anupalitto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – padumaṃva toyena alimpamāno, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Sīhova saddesu asantasanto, vātova jālamhi asajjamāno; Padumaṃva toyena alimpamāno, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 158,
      "pali": "Sīho yathā dāṭhabalī pasayha, rājā migānaṃ abhibhuyya cārī; Sevetha pantāni senāsanāni, eko care khaggavisāṇakappo. Sīho yathā dāṭhabalī pasayha, rājā migānaṃ abhibhuyya cārīti yathā sīho migarājā dāṭhabalī dāṭhāvudho sabbe tiracchānagate pāṇe abhibhuyya abhibhavitvā ajjhottharitvā pariyādiyitvā madditvā carati viharati iriyati vatteti pāleti yapeti yāpeti, paccekasambuddhopi paññābalī paññāvudho sabbapāṇabhūte puggale paññāya abhibhuyya abhibhavitvā ajjhottharitvā pariyādiyitvā madditvā carati viharati iriyati vatteti pāleti yapeti yāpetīti – sīho yathā dāṭhabalī pasayha, rājā migānaṃ abhibhuyya cārī. Sevetha pantāni senāsanānīti yathā sīho migarājā araññavanamajjhogāhetvā carati viharati iriyati vatteti pāleti yapeti yāpeti, paccekasambuddhopi araññavanapatthāni pantāni senāsanāni paṭisevati appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppāni. So eko gacchati eko tiṭṭhati eko nisīdati eko seyyaṃ kappeti eko gāmaṃ piṇḍāya pavisati eko paṭikkamati eko raho nisīdati eko caṅkamaṃ adhiṭṭhāti eko carati viharati iriyati vatteti pāleti yapeti yāpetīti – sevetha pantāni senāsanāni, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Sīho yathā dāṭhabalī pasayha, rājā migānaṃ abhibhuyya cārī; Sevetha pantāni senāsanāni, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 159,
      "pali": "Mettaṃupekkhaṃ karuṇaṃ vimuttiṃ, āsevamāno muditañca kāle; Sabbena lokena avirujjhamāno, eko care khaggavisāṇakappo. Mettaṃ upekkhaṃ karuṇaṃ vimuttiṃ, āsevamāno muditañca kāleti so paccekasambuddho mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati; karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharatīti – mettaṃ upekkhaṃ karuṇaṃ vimuttiṃ, āsevamāno muditañca kāle. Sabbena lokena avirujjhamānoti mettāya bhāvitattā ye puratthimāya disāya sattā te appaṭikūlā honti, ye pacchimāya disāya sattā…pe… ye uttarāya disāya sattā… ye dakkhiṇāya disāya sattā… ye puratthimāya anudisāya sattā… ye pacchimāya anudisāya sattā… ye uttarāya anudisāya sattā… ye dakkhiṇāya anudisāya sattā… ye heṭṭhimāya [adhogamāya (syā.)] disāya sattā… ye uparimāya disāya sattā… ye dasasu disāsu sattā te appaṭikūlā honti. Karuṇāya bhāvitattā… muditāya bhāvitattā… upekkhāya bhāvitattā ye puratthimāya disāya sattā…pe… ye dasasu disāsu sattā te appaṭikūlā honti. Sabbena lokena avirujjhamānoti sabbena lokena avirujjhamāno, appaṭivirujjhamāno anāghātiyamāno [aghaṭṭiyamāno (syā.)] appaṭihaññamānoti – sabbena lokena avirujjhamāno, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Mettaṃ upekkhaṃ karuṇaṃ vimuttiṃ, āsevamāno muditañca kāle; Sabbena lokena avirujjhamāno, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 160,
      "pali": "Rāgañca dosañca pahāya mohaṃ, sandālayitvāna saṃyojanāni [saṃyojanāni (ka.)] ; Asantasaṃ jīvitasaṅkhayamhi, eko care khaggavisāṇakappo. Rāgañca dosañca pahāya mohanti. Rāgoti yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Dosoti yo cittassa āghāto…pe… caṇḍikkaṃ asuropo anattamanatā cittassa. Mohoti dukkhe aññāṇaṃ… pe… avijjālaṅgī moho akusalamūlaṃ. Rāgañca dosañca pahāya mohanti so paccekasambuddho rāgañca dosañca mohañca pahāya pajahitvā vinodetvā byantīkaritvā anabhāvaṃ gametvāti – rāgañca dosañca pahāya mohaṃ. Sandālayitvāna saṃyojanānīti. Dasa saṃyojanāni – kāmarāgasaṃyojanaṃ paṭighasaṃyojanaṃ… pe… avijjāsaṃyojanaṃ. Sandālayitvāna saṃyojanānīti dasa saṃyojanāni sandālayitvā padālayitvā sampadālayitvā pajahitvā vinodetvā byantīkaritvā anabhāvaṃ gametvāti – sandālayitvāna saṃyojanāni. Asantasaṃjīvitasaṅkhayamhīti so paccekasambuddho jīvitapariyosāne asantāsī anutrāsī anubbiggo anussaṅkī anutrāso abhīrū acchambhī anutrāsī apalāyī pahīnabhayabheravo vigatalomahaṃso viharatīti – asantasaṃ jīvitasaṅkhayamhi, eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Rāgañca dosañca pahāya mohaṃ, sandālayitvāna saṃyojanāni; Asantasaṃ jīvitasaṅkhayamhi, eko care khaggavisāṇakappo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 161,
      "pali": "Bhajanti sevanti ca kāraṇatthā, nikkāraṇā dullabhā ajja mittā; Attatthapaññā [attaṭṭhapaññā (ka.)] asucī manussā, eko care khaggavisāṇakappo. Bhajanti sevanti ca kāraṇatthāti attatthakāraṇā paratthakāraṇā ubhayatthakāraṇā diṭṭhadhammikatthakāraṇā samparāyikatthakāraṇā paramatthakāraṇā bhajanti sambhajanti sevanti nisevanti saṃsevanti paṭisevantīti – bhajanti sevanti ca kāraṇatthā. Nikkāraṇā dullabhā ajja mittāti dve mittā – agārikamitto ca anāgārikamitto ca…pe… ayaṃ agārikamitto…pe… ayaṃ anāgārikamitto. Nikkāraṇā dullabhā ajja mittāti ime dve mittā akāraṇā nikkāraṇā ahetū appaccayā dullabhā (dulladdhā sudulladdhā) [( ) natthi syā. potthake] ti – nikkāraṇā dullabhā ajja mittā. Attatthapaññā asucī manussāti. Attatthapaññāti attano atthāya attano hetu attano paccayā attano kāraṇā bhajanti sambhajanti sevanti nisevanti saṃsevanti paṭisevanti ācaranti samācaranti payirupāsanti paripucchanti paripañhantīti – attatthapaññā. Asucī manussāti asucinā kāyakammena samannāgatāti asucī manussā, asucinā vacīkammena samannāgatāti asucī manussā, asucinā manokammena samannāgatāti asucī manussā, asucinā pāṇātipātena…pe… asucinā adinnādānena… asucinā kāmesumicchācārena… asucinā musāvādena… asuciyā pisuṇāya vācāya samannāgatā… asuciyā pharusāya vācāya samannāgatā… asucinā samphappalāpena samannāgatā… asuciyā abhijjhāya samannāgatā… asucinā byāpādena samannāgatāti asucī manussā, asuciyā micchādiṭṭhiyā samannāgatāti asucī manussā, asuciyā cetanāya samannāgatāti asucī manussā, asuciyā patthanāya samannāgatāti asucī manussā, asucinā paṇidhinā samannāgatāti asucī manussā, asucī hīnā nihīnā omakā lāmakā chatukkā parittāti – attatthapaññā asucī manussā. Eko care khaggavisāṇakappoti. Ekoti so paccekasambuddho pabbajjāsaṅkhātena eko…pe… careti aṭṭha cariyāyo…pe… khaggavisāṇakappoti yathā khaggassa nāma visāṇaṃ ekaṃ hoti adutiyaṃ…pe… eko care khaggavisāṇakappo. Tenāha so paccekasambuddho – ‘‘Bhajanti sevanti ca kāraṇatthā, nikkāraṇā dullabhā ajja mittā; Attatthapaññā asucī manussā, eko care khaggavisāṇakappo’’ti. ",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Catuttho vaggo. Khaggavisāṇasuttaniddeso niṭṭhito. Ajito tissametteyyo, puṇṇako atha mettagū; Dhotako upasīvo ca, nando ca atha hemako. Todeyya-kappā dubhayo, jatukaṇṇī ca paṇḍito; Bhadrāvudho udayo ca, posālo cāpi brāhmaṇo; Mogharājā ca medhāvī, piṅgiyo ca mahāisi. Soḷasānaṃ [soḷasannaṃ (syā. ka.)] panetesaṃ, brāhmaṇānaṃva sāsanaṃ; Pārāyanānaṃ niddesā, tattakā ca bhavanti hi [vā (ka.)]. Khaggavisāṇasuttānaṃ, niddesāpi tatheva ca; Niddesā duvidhā ñeyyā, paripuṇṇā sulakkhitāti.",
    "english": "",
    "sinhala": ""
  }
}