{
  "id": "an1.8",
  "title": {
    "pali": "Kalyāṇamittādivaggo",
    "english": "The Chapter on Spiritual Friends, etc.",
    "sinhala": "කල්‍යාණමිත්‍රාදි වර්ගය"
  },
  "sections": [
    {
      "number": 71,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā kusalā dhammā uppajjanti uppannā vā akusalā dhammā parihāyanti yathayidaṃ, bhikkhave, kalyāṇamittatā. Kalyāṇamittassa, bhikkhave, anuppannā ceva kusalā dhammā uppajjanti uppannā ca akusalā dhammā parihāyantī’’ti. Paṭhamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon by which unarisen wholesome states might arise, or by which arisen unwholesome states might decline, as I do with spiritual friendship. Monks, because of spiritual friendship, unarisen wholesome states indeed arise, and arisen unwholesome states decline.",
      "sinhala": "භික්ෂූනි, නූපන් කුසල ධර‍්ම හටගන්නා, උපන් අකුසල ධර‍්ම පිරිහී යන, මේ කල්‍යාණමිත්‍රභාවය මෙන්ම වෙනත් එකදු ධර‍්මයක්වත් මම නොදකිමි. භික්ෂූනි, කල්‍යාණමිත්‍රත්වය ඇත්තාහට නූපන් කුසල ධර‍්ම හටගනිත්; උපන් අකුසල ධර‍්ම පිරිහී යත්.",
      "paliTitle": ""
    },
    {
      "number": 72,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā akusalā dhammā uppajjanti uppannā vā kusalā dhammā parihāyanti yathayidaṃ, bhikkhave, anuyogo akusalānaṃ dhammānaṃ, ananuyogo kusalānaṃ dhammānaṃ. Anuyogā, bhikkhave, akusalānaṃ dhammānaṃ, ananuyogā kusalānaṃ dhammānaṃ anuppannā ceva akusalā dhammā uppajjanti uppannā ca kusalā dhammā parihāyantī’’ti. Dutiyaṃ.",
      "english": "Monks, I do not discern any other single quality by which unarisen unwholesome qualities arise or arisen wholesome qualities decline, as I discern engagement in unwholesome qualities and non-engagement in wholesome qualities. Monks, it is through engagement in unwholesome qualities and non-engagement in wholesome qualities that unarisen unwholesome qualities arise, and arisen wholesome qualities decline.",
      "sinhala": "මහණෙනි, නූපන් අකුසල ධර්‍මයන් උපදින, උපන් කුසල ධර්‍මයන් පිරිහෙන, අකුසල ධර්‍මයන්හි නිරත වීම සහ කුසල ධර්‍මයන්හි නිරත නොවීම හැර, වෙනත් එකදු ධර්‍මයක්වත් මම නොදකිමි.\n\nමහණෙනි, අකුසල ධර්‍මයන්හි නිරත වීමෙන් ද, කුසල ධර්‍මයන්හි නිරත නොවීමෙන් ද නූපන් අකුසල ධර්‍මයන් උපදිත්. උපන් කුසල ධර්‍මයන් පිරිහෙත්.",
      "paliTitle": ""
    },
    {
      "number": 73,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā kusalā dhammā uppajjanti uppannā vā akusalā dhammā parihāyanti yathayidaṃ, bhikkhave, anuyogo kusalānaṃ dhammānaṃ, ananuyogo akusalānaṃ dhammānaṃ. Anuyogā, bhikkhave, kusalānaṃ dhammānaṃ, ananuyogā akusalānaṃ dhammānaṃ anuppannā ceva kusalā dhammā uppajjanti uppannā ca akusalā dhammā parihāyantī’’ti. Tatiyaṃ.",
      "english": "Monks, I do not discern any other single quality by which unarisen skillful qualities might arise, or by which arisen unskillful qualities might decline and fall away, just as I discern this, monks: the persistent application to skillful qualities and the non-application to unskillful qualities. Monks, it is through the persistent application to skillful qualities and the non-application to unskillful qualities that unarisen skillful qualities indeed arise, and arisen unskillful qualities decline and fall away.",
      "sinhala": "භික්‍ෂූණි, යම් ධර්‍මයක් හේතුවෙන් නූපන් කුසල ධර්‍මයන් ඇතිවන්නේ ද, උපන් අකුසල ධර්‍මයන් පිරිහෙන්නේ ද, එබඳු අන් එකදු ධර්‍මයක්වත් මම නොදකිමි; භික්‍ෂූණි, ඒ නම් කුසල ධර්‍මයන්හි නිරතවීමත්, අකුසල ධර්‍මයන්හි නිරත නොවීමත් ය.\n\nභික්‍ෂූණි, කුසල ධර්‍මයන්හි නිරතවීමත්, අකුසල ධර්‍මයන්හි නිරත නොවීමත් හේතුවෙන් නූපන් කුසල ධර්‍මයන් සැබවින්ම ඇතිවෙති; උපන් අකුසල ධර්‍මයන් ද සැබවින්ම පිරිහෙති.",
      "paliTitle": ""
    },
    {
      "number": 74,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā bojjhaṅgā nuppajjanti uppannā vā bojjhaṅgā na bhāvanāpāripūriṃ gacchanti yathayidaṃ, bhikkhave, ayonisomanasikāro. Ayoniso, bhikkhave, manasi karoto anuppannā ceva bojjhaṅgā nuppajjanti uppannā ca bojjhaṅgā na bhāvanāpāripūriṃ gacchantī’’ti. Catutthaṃ.",
      "english": "Monks, I do not discern any other single phenomenon that prevents the unarisen factors of awakening from arising, or the arisen factors of awakening from reaching full development, in the same way as unwise attention. Monks, when one attends unwisely, the unarisen factors of awakening do not arise, and the arisen factors of awakening do not reach full development.",
      "sinhala": "මහණෙනි, යම් ධර්මයක් හේතු කොටගෙන නූපන් බෝධ්‍ය‍ාංග නූපදිනවා ද, උපන් බෝධ්‍ය‍ාංග භාවනා සම්පූර්ණත්‍වයට නොපැමිණෙනවා ද, මේ අයෝනිසෝ මනසිකාරය තරම් වෙනත් එවැනි එකම ධර්මයක් හෝ මම නොදකිමි. මහණෙනි, අයෝනිසෝ මනසිකාර කරන පුද්ගලයාට නූපන් බෝධ්‍ය‍ාංග නූපදිනවා ම ය; උපන් බෝධ්‍ය‍ාංග භාවනා සම්පූර්ණත්‍වයට නොපැමිණෙනවා ම ය.",
      "paliTitle": ""
    },
    {
      "number": 75,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā bojjhaṅgā uppajjanti uppannā vā bojjhaṅgā bhāvanāpāripūriṃ gacchanti yathayidaṃ, bhikkhave, yonisomanasikāro. Yoniso, bhikkhave, manasi karoto anuppannā ceva bojjhaṅgā uppajjanti uppannā ca bojjhaṅgā bhāvanāpāripūriṃ gacchantī’’ti. Pañcamaṃ.",
      "english": "Monks, I do not discern any other single quality by which unarisen factors of awakening arise, or arisen factors of awakening reach the culmination of development, as is the case with this, monks: wise attention. Monks, when one attends wisely, unarisen factors of awakening arise, and arisen factors of awakening reach the culmination of development.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් හෙයකින් නූපන් බෝධ්‍යංග උපදින්නාවූද, උපන් බෝධ්‍යංග භාවනාමය වශයෙන් පාරිපූරණයට පත්වන්නාවූද, මේ යෝනිසෝමනසිකාරය හැර වෙනත් එකදු ධර්‍මයක්වත් මා නොදකිමි. භික්ෂූන් වහන්ස, යෝනිසෝමනසිකාරයෙන් මෙනෙහි කරන්නහුට නූපන් බෝධ්‍යංග උපදින්නාහුමය, උපන් බෝධ්‍යංග භාවනාමය වශයෙන් පාරිපූරණයට පත්වන්නාහුමය.",
      "paliTitle": ""
    },
    {
      "number": 76,
      "pali": "‘‘Appamattikā esā, bhikkhave, parihāni yadidaṃ ñātiparihāni. Etaṃ patikiṭṭhaṃ, bhikkhave, parihānīnaṃ yadidaṃ paññāparihānī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, this loss of relatives is a minor decline. This, Monks, among all declines, is the most reprehensible: the loss of wisdom.",
      "sinhala": "භික්ෂූනි, මේ යම් ඥාතිපිරිහීමක් වේද, එය සුළු පිරිහීමකි. භික්ෂූනි, මේ යම් ප්‍රඥාපිරිහීමක් වේද, එය පිරිහීම් අතුරින් අතිශයින්ම අයහපත් වූවකි.",
      "paliTitle": ""
    },
    {
      "number": 77,
      "pali": "‘‘Appamattikā esā, bhikkhave, vuddhi yadidaṃ ñātivuddhi. Etadaggaṃ, bhikkhave, vuddhīnaṃ yadidaṃ paññāvuddhi. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘paññāvuddhiyā vaddhissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ.",
      "english": "This growth in relatives, monks, is insignificant. Among all growths, monks, the foremost is the growth in wisdom. Therefore, monks, you should train yourselves thus: ‘We will grow in wisdom.’ Indeed, monks, you should train yourselves in this way.",
      "sinhala": "මහණෙනි, ඤාති වර්ධනය නම් වූ මේ වර්ධනය අල්ප වූවකි. මහණෙනි, වර්ධනයන් අතුරින් ප්‍රඥා වර්ධනය නම් වූ මේ වර්ධනය අග්‍ර වේ. එබැවින්, මහණෙනි, ‘අපි ප්‍රඥා වර්ධනයෙන් වර්ධනය වන්නෙමු’ යි මෙසේ හික්මිය යුතු ය. මහණෙනි, මෙසේ ම හික්මිය යුතු ය.",
      "paliTitle": ""
    },
    {
      "number": 78,
      "pali": "‘‘Appamattikā esā, bhikkhave, parihāni yadidaṃ bhogaparihāni. Etaṃ patikiṭṭhaṃ, bhikkhave, parihānīnaṃ yadidaṃ paññāparihānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, this decline, the decline of material possessions, is minor. This, Monks, the decline of wisdom, is the worst of all declines.",
      "sinhala": "මහණෙනි, යම් මේ භෝග සම්පත් පරිහානියක් ඇත්ද, ඒ පරිහානිය ඉතා සුළු දෙයකි. මහණෙනි, යම් මේ ප්‍ර‌ඥා පරිහානියක් ඇත්ද, ඒ පරිහානිය සියලු පරිහානි අතරින් ඉතාමත් පහත් වූ දෙයකි.",
      "paliTitle": ""
    },
    {
      "number": 79,
      "pali": "‘‘Appamattikā esā, bhikkhave, vuddhi yadidaṃ bhogavuddhi. Etadaggaṃ, bhikkhave, vuddhīnaṃ yadidaṃ paññāvuddhi. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘paññāvuddhiyā vaddhissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ.",
      "english": "Monks, this growth in material possessions is of little account. Monks, among all growths, the foremost is growth in wisdom. Therefore, monks, you should train yourselves in this way: 'We shall grow in wisdom.' Indeed, monks, this is how you should train yourselves.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් මේ භෝග වෘද්ධියක් ඇද්ද, මේ දියුණුව අල්පයකි. භික්ෂූන් වහන්ස, සියලු දියුණුවලින් අග්‍ර වූයේ ප\\u200d්‍රඥා වෘද්ධියයි. එබැවින්, භික්ෂූන් වහන්ස, ‘අපි ප\\u200d්‍රඥා වෘද්ධියෙන් වර්ධනය වන්නෙමු’ යැයි මෙසේ පුහුණු විය යුතුයි. භික්ෂූන් වහන්ස, ඔබලා විසින් මෙසේම පුහුණු විය යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 80,
      "pali": "‘‘Appamattikā esā, bhikkhave, parihāni yadidaṃ yasoparihāni. Etaṃ patikiṭṭhaṃ, bhikkhave, parihānīnaṃ yadidaṃ paññāparihānī’’ti. Dasamaṃ. ",
      "english": "Monastics, this loss of fame is an insignificant decline. This, monastics, is the most reprehensible among declines: the loss of wisdom.",
      "sinhala": "මහණෙනි, යසස් පිරිහීම යනු සුළු පිරිහීමකි. මහණෙනි, පිරිහීම් අතරින් ප\\u200d්‍රඥාපිරිහීම යනු අන්තම පිරිහීමයි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Kalyāṇamittādivaggo aṭṭhamo.",
    "english": "",
    "sinhala": ""
  }
}