{
  "id": "an1.16",
  "title": {
    "pali": "Paṭhamavaggo",
    "english": "Chapter One",
    "sinhala": "පළමු වර්ගය"
  },
  "sections": [
    {
      "number": 296,
      "pali": "‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Katamo ekadhammo? Buddhānussati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattatī’’ti.",
      "english": "Monks, there is one quality which, when developed and repeatedly practiced, conduces to complete disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna. Which one quality? It is the Recollection of the Buddha. Indeed, monks, this one quality, when developed and repeatedly practiced, conduces to complete disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna.",
      "sinhala": "මහණෙනි, එක් ධර්මයක් වඩන ලද්දේ, බහුලීකරණය කරන ලද්දේ ඒකාන්ත නිර්වේදය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, උපශාන්තිය පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිවන පිණිස පවතින්නේය.\n\nඒ එක් ධර්මය කුමක්ද? බුද්ධානුස්සතියයි.\n\nමහණෙනි, සැබැවින්ම, මේ එක් ධර්මයක් වඩන ලද්දේ, බහුලීකරණය කරන ලද්දේ ඒකාන්ත නිර්වේදය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, උපශාන්තිය පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිවන පිණිස පවතින්නේය.",
      "paliTitle": ""
    },
    {
      "number": 297,
      "pali": "‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Katamo ekadhammo? Dhammānussati…pe… saṅghānussati… sīlānussati… cāgānussati… devatānussati… ānāpānassati… maraṇassati… kāyagatāsati… upasamānussati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattatī’’ti. Vaggo paṭhamo.",
      "english": "Monks, there is one quality which, when developed and repeatedly cultivated, leads to complete disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to perfect enlightenment, and to Nibbāna. Which one quality? It is the recollection of the Dhamma, the recollection of the Saṅgha, the recollection of virtue, the recollection of generosity, the recollection of the devas, mindfulness of breathing, mindfulness of death, mindfulness of the body, and the recollection of peace. This one quality, monks, when developed and repeatedly cultivated, leads to complete disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to perfect enlightenment, and to Nibbāna.",
      "sinhala": "මහණෙනි, එක් ධර්මයක් වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි, ඒකාන්ත කලකිරීම පිණිස ද, විරාගය පිණිස ද, නිරෝධය පිණිස ද, උපශමය පිණිස ද, අභිඥාව පිණිස ද, සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද පවතී. කවරේද ඒ එක් ධර්මය? ධර්මානුස්සතිය, සංඝානුස්සතිය, ශීලානුස්සතිය, ත්‍‍යාගානුස්සතිය, දේවතානුස්සතිය, ආනාපානස්සතිය, මරණස්සතිය, කායගතාසතිය, උපශමානුස්සතිය යනු යි. මහණෙනි, මේ එක් ධර්මය වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි, ඒකාන්ත කලකිරීම පිණිස ද, විරාගය පිණිස ද, නිරෝධය පිණිස ද, උපශමය පිණිස ද, අභිඥාව පිණිස ද, සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද පවතී.",
      "paliTitle": ""
    },
    {
      "number": 298,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā akusalā dhammā uppajjanti uppannā vā akusalā dhammā bhiyyobhāvāya vepullāya saṃvattanti yathayidaṃ, bhikkhave, micchādiṭṭhi. Micchādiṭṭhikassa, bhikkhave, anuppannā ceva akusalā dhammā uppajjanti uppannā ca akusalā dhammā bhiyyobhāvāya vepullāya saṃvattantī’’ti.",
      "english": "Monks, I do not discern any other single quality by which unarisen unwholesome states might arise, or by which arisen unwholesome states might grow and multiply, as is this, monks, wrong view. For one possessing wrong view, monks, unarisen unwholesome states indeed arise, and arisen unwholesome states grow and multiply.",
      "sinhala": "භික්ෂූනි, නූපන් අකුසල ධර්මයන් හටගැනීමට හෝ උපන් අකුසල ධර්මයන් වැඩි දියුණු වී පුළුල් වීමට හෝ හේතු වන, මිත්‍​යාදෘෂ්ටිය තරම් වූ වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි.\n\nභික්ෂූනි, මිත්‍​යාදෘෂ්ටිය ඇත්තාහට නූපන් අකුසල ධර්මයන් උපදී. උපන් අකුසල ධර්මයන්ද වඩාත් වර්ධනය වීමටත්, විශාල බවට පත්වීමටත් හේතු වේ.",
      "paliTitle": "Dutiyavaggo",
      "englishTitle": "Second Section",
      "sinhalaTitle": "දෙවන වග්ගය"
    },
    {
      "number": 299,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā kusalā dhammā uppajjanti uppannā vā kusalā dhammā bhiyyobhāvāya vepullāya saṃvattanti yathayidaṃ, bhikkhave, sammādiṭṭhi. Sammādiṭṭhikassa, bhikkhave, anuppannā ceva kusalā dhammā uppajjanti uppannā ca kusalā dhammā bhiyyobhāvāya vepullāya saṃvattantī’’ti.",
      "english": "Monks, I do not discern any other single quality by which unarisen wholesome qualities arise, or by which arisen wholesome qualities come to further growth and development, just as it is with right view, monks. For one possessing right view, monks, unarisen wholesome qualities arise, and arisen wholesome qualities come to further growth and development.",
      "sinhala": "මහණෙනි, යමකින් නූපන් කුසල් ධර්‍මයන් උපදී ද, උපන් කුසල් ධර්‍මයන් වඩා වැඩිවීම පිණිසත්, පුළුල් බවට පත්වීම පිණිසත් හේතු වේ ද, මේ සම්මා දිට්ඨිය හැර එවැනි වෙනත් එකදු ධර්‍මයක්වත් මා විසින් දකිනු නොලැබේ. මහණෙනි, සම්මා දිට්ඨිය ඇති පුද්ගලයාට නූපන් කුසල් ධර්‍මයන් උපදී. උපන් කුසල් ධර්‍මයන් වඩා වැඩිවීම පිණිසත්, පුළුල් බවට පත්වීම පිණිසත් පවතී.",
      "paliTitle": ""
    },
    {
      "number": 300,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā kusalā dhammā nuppajjanti uppannā vā kusalā dhammā parihāyanti yathayidaṃ, bhikkhave, micchādiṭṭhi. Micchādiṭṭhikassa, bhikkhave, anuppannā ceva kusalā dhammā nuppajjanti uppannā ca kusalā dhammā parihāyantī’’ti.",
      "english": "Monks, I do not discern any other single factor by which unarisen wholesome states fail to arise, or arisen wholesome states deteriorate, as does this, monks, wrong view. Monks, for one who possesses wrong view, unarisen wholesome states indeed do not arise, and arisen wholesome states deteriorate.",
      "sinhala": "මහණෙනි, යම් ධර්‍මයක් හේතුවෙන් නූපන් කුසල ධර්‍ම නූපදී ද, උපන් කුසල ධර්‍ම පිරිහී යේ ද, මේ මිථ්‍යාදෘෂ්ටිය වැනි අන් එකදු ධර්‍මයක්වත් මම නොදකිමි. මහණෙනි, මිථ්‍යාදෘෂ්ටිය ඇත්තාට නූපන් කුසල ධර්‍ම නූපදීමත්, උපන් කුසල ධර්‍ම පිරිහීමත් සිදු වේ.",
      "paliTitle": ""
    },
    {
      "number": 301,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā akusalā dhammā nuppajjanti uppannā vā akusalā dhammā parihāyanti yathayidaṃ, bhikkhave, sammādiṭṭhi. Sammādiṭṭhikassa, bhikkhave, anuppannā ceva akusalā dhammā nuppajjanti uppannā ca akusalā dhammā parihāyantī’’ti.",
      "english": "Monks, I do not discern even a single other phenomenon by which unarisen unwholesome states do not arise or arisen unwholesome states decline, as is this, monks, Right View. For one who possesses Right View, monks, unarisen unwholesome states certainly do not arise, and arisen unwholesome states decline.",
      "sinhala": "මහණෙනි, යම් ධර්මයක් හේතු කොටගෙන නූපන් අකුසල ධර්මයන් නූපදිත්ද, උපන් අකුසල ධර්මයන් පිරිහී යත්ද, මහණෙනි, මේ සම්මා දිට්ඨිය හැර අන් කිසිදු එකම ධර්මයක් හෝ මම නොදකිමි.\n\nමහණෙනි, සම්මා දිට්ඨිය ඇති පුද්ගලයාහට නූපන් අකුසල ධර්ම නූපදිති, උපන් අකුසල ධර්ම පිරිහී යති.",
      "paliTitle": ""
    },
    {
      "number": 302,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā micchādiṭṭhi uppajjati uppannā vā micchādiṭṭhi pavaḍḍhati yathayidaṃ, bhikkhave, ayonisomanasikāro. Ayoniso, bhikkhave, manasi karoto anuppannā ceva micchādiṭṭhi uppajjati uppannā ca micchādiṭṭhi pavaḍḍhatī’’ti.",
      "english": "Monks, I do not perceive any other single phenomenon by which unarisen wrong view comes to arise, or by which arisen wrong view comes to grow and develop, as much as by this, monks, unwise attention. Monks, when one attends unwisely, unarisen wrong view indeed arises, and arisen wrong view grows and develops.",
      "sinhala": "මහණෙනි, නූපන් මිථ්‍යාදෘෂ්ටියක් උපදීමට හෝ උපන් මිථ්‍යාදෘෂ්ටියක් ප‍්‍රවර්ධනය වීමට හේතුවන, මේ අයෝනිසෝ මනසිකාරය හැර අන් කිසිදු ධර්මයක් මම නොදකිමි. මහණෙනි, අයෝනිසෝ මනසිකාරය කරන්නාට නූපන් මිථ්‍යාදෘෂ්ටිය උපදී, උපන් මිථ්‍යාදෘෂ්ටිය ප‍්‍රවර්ධනය වේ.",
      "paliTitle": ""
    },
    {
      "number": 303,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā sammādiṭṭhi uppajjati uppannā vā sammādiṭṭhi pavaḍḍhati yathayidaṃ, bhikkhave, yonisomanasikāro. Yoniso, bhikkhave, manasi karoto anuppannā ceva sammādiṭṭhi uppajjati uppannā ca sammādiṭṭhi pavaḍḍhatī’’ti.",
      "english": "Monks, I do not discern any other single quality by which unarisen right view arises or arisen right view develops, as does wise attention. Monks, when one attends wisely, unarisen right view arises and arisen right view develops.",
      "sinhala": "භික්‍ෂූනි, නොහටගත් සම්මාදිට්ඨිය හටගැනීමටත්, හටගත් සම්මාදිට්ඨිය වැඩීමටත් හේතුවන, යොනිසෝමනසිකාරය හා සමාන වෙනත් එකම ධර්මයක් හෝ මම නොදකිමි.\n\nභික්‍ෂූනි, නුවණින් මෙනෙහි කරන කල්හි, නොහටගත් සම්මාදිට්ඨිය හටගනී; හටගත් සම්මාදිට්ඨියද වැඩේ.",
      "paliTitle": ""
    },
    {
      "number": 304,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena [yenevaṃ (sī. syā. kaṃ. pī.)] sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti yathayidaṃ, bhikkhave, micchādiṭṭhi. Micchādiṭṭhiyā, bhikkhave, samannāgatā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti.",
      "english": "Bhikkhus, I do not perceive any other single phenomenon by which beings, with the breakup of the body, after death, are reborn into a state of deprivation, a miserable destination, a lower realm, hell, as much as this, bhikkhus, is wrong view. Bhikkhus, beings endowed with wrong view, with the breakup of the body, after death, are reborn into a state of deprivation, a miserable destination, a lower realm, hell.",
      "sinhala": "භික්ෂූනි, යම් ධර්‍මයක් හේතුවෙන් සත්වයෝ ශරීරය බිඳී, මරණින් පසුව අපාය දුගති විනිපාත නිරයෙහි උපදිත්ද, භික්ෂූනි, මේ මිථ්‍ය‌ාදෘෂ්ටිය මෙන් වෙනත් එකදු ධර්‍මයක්වත් මම නොදකිමි. භික්ෂූනි, මිථ්‍ය‌ාදෘෂ්ටියෙන් යුක්ත වූ සත්වයෝ ශරීරය බිඳී, මරණින් පසුව අපාය දුගති විනිපාත නිරයෙහි උපදිති.",
      "paliTitle": ""
    },
    {
      "number": 305,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti yathayidaṃ, bhikkhave, sammādiṭṭhi. Sammādiṭṭhiyā, bhikkhave, samannāgatā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti.",
      "english": "Monks, I do not discern any other single factor by which beings, with the breaking up of the body, after death, are reborn in a fortunate realm, a heavenly world, than this, monks, Right View. Monks, beings endowed with Right View, with the breaking up of the body, after death, are reborn in a fortunate realm, a heavenly world.",
      "sinhala": "භික්‍ෂූනි, යම් ධර්මයක් හේතු කොට ගෙන සත්ත්වයෝ කය බිඳීමෙන්, මරණින් පසුව සුගතියට, ස්වර්ග ලෝකයට උපදිත් ද, භික්‍ෂූනි, එබඳු වූ සම්මා දිට්ඨිය හැර වෙනත් කිසිම එකම ධර්මයක් හෝ මම නොදකිමි. භික්‍ෂූනි, සම්මා දිට්ඨියෙන් යුක්ත වූ සත්ත්වයෝ කය බිඳීමෙන්, මරණින් පසුව සුගතියට, ස්වර්ග ලෝකයට උපදිත්.",
      "paliTitle": ""
    },
    {
      "number": 306,
      "pali": "‘‘Micchādiṭṭhikassa, bhikkhave, purisapuggalassa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ…pe… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa [diṭṭhi hi (sī. syā. kaṃ. pī.)], bhikkhave, pāpikā. Seyyathāpi, bhikkhave, nimbabījaṃ vā kosātakibījaṃ vā tittakalābubījaṃ vā allāya pathaviyā [paṭhaviyā (sī. syā. kaṃ. pī.)] nikkhittaṃ yañceva pathavirasaṃ upādiyati yañca āporasaṃ upādiyati sabbaṃ taṃ tittakattāya kaṭukattāya asātattāya saṃvattati. Taṃ kissa hetu? Bījaṃ hissa [vījaṃ (sī. syā. kaṃ. pī.)], bhikkhave, pāpakaṃ. Evamevaṃ kho, bhikkhave, micchādiṭṭhikassa purisapuggalassa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ…pe… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, pāpikā’’ti.",
      "english": "Bhikkhus, for a person who holds wrong view, whatever bodily action is completed and undertaken according to that view, whatever verbal action is completed and undertaken according to that view, whatever mental action is completed and undertaken according to that view, whatever volition, whatever aspiration, whatever resolve, and whatever formations – all these phenomena conduce to what is undesirable, unappealing, displeasing, harmful, and suffering. For what reason? Because, bhikkhus, his view is evil. Just as, bhikkhus, a neem seed, or a bitter gourd seed, or a bitter calabash seed, when placed in moist earth, whatever essence of earth it absorbs, and whatever essence of water it absorbs – all that conduces to bitterness, acridity, and unpleasantness. For what reason? Because, bhikkhus, its seed is evil.\n\nIn the same way, bhikkhus, for a person who holds wrong view, whatever bodily action is completed and undertaken according to that view, whatever verbal action is completed and undertaken according to that view, whatever mental action is completed and undertaken according to that view, whatever volition, whatever aspiration, whatever resolve, and whatever formations – all these phenomena conduce to what is undesirable, unappealing, displeasing, harmful, and suffering. For what reason? Because, bhikkhus, his view is evil.",
      "sinhala": "භික්ෂූනි, මිත්‍යාදෘෂ්ටික පුද්ගලයාගේ යම්තාක් කය්කර්මයක් තම දෘෂ්ටියට අනුකූලව සම්පූර්ණයෙන් සමාදන්ව කරනවාද, යම්තාක් වචීකර්මයක්... යම්තාක් මනෝකර්මයක් තම දෘෂ්ටියට අනුකූලව සම්පූර්ණයෙන් සමාදන්ව කරනවාද, යම් චේතනාවක්, යම් ප්‍රාර්ථනාවක්, යම් අධිෂ්ඨානයක්, යම් සංස්කාරයන් වේද, ඒ සියලු ධර්මයන් අනිෂ්ටයට, අකැමැති දේට, අප්‍රසන්න දේට, අහිතට, දුකට හේතු වේ.\n\nඑයට හේතුව කුමක්ද? භික්ෂූනි, ඔහුගේ දෘෂ්ටිය පාපී වීමයි.\n\nභික්ෂූනි, යම්සේ වේද, කොහොඹ ඇටයක් වේවා, වැටකොළු ඇටයක් වේවා, තිත්ත ලබු ඇටයක් වේවා, තෙත් බිමක සිටවූ විට, යම්තාක් පඨවි රසය උපාදානය කරනවාද, යම්තාක් ආපෝ රසය උපාදානය කරනවාද, ඒ සියල්ල තිත්ත බව පිණිසත්, කටුක බව පිණිසත්, අසාත බව පිණිසත් හේතු වේ.\n\nඑයට හේතුව කුමක්ද? භික්ෂූනි, ඔහුගේ බීජය පාපී වීමයි.\n\nභික්ෂූනි, එලෙසින්ම මිත්‍යාදෘෂ්ටික පුද්ගලයාගේ යම්තාක් කය්කර්මයක් තම දෘෂ්ටියට අනුකූලව සම්පූර්ණයෙන් සමාදන්ව කරනවාද, යම්තාක් වචීකර්මයක්... යම්තාක් මනෝකර්මයක් තම දෘෂ්ටියට අනුකූලව සම්පූර්ණයෙන් සමාදන්ව කරනවාද, යම් චේතනාවක්, යම් ප්‍රාර්ථනාවක්, යම් අධිෂ්ඨානයක්, යම් සංස්කාරයන් වේද, ඒ සියලු ධර්මයන් අනිෂ්ටයට, අකැමැති දේට, අප්‍රසන්න දේට, අහිතට, දුකට හේතු වේ.\n\nඑයට හේතුව කුමක්ද? භික්ෂූනි, ඔහුගේ දෘෂ්ටිය පාපී වීමයි.",
      "paliTitle": ""
    },
    {
      "number": 307,
      "pali": "‘‘Sammādiṭṭhikassa, bhikkhave, purisapuggalassa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ…pe… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā sabbe te dhammā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, bhaddikā. Seyyathāpi, bhikkhave, ucchubījaṃ vā sālibījaṃ vā muddikābījaṃ vā allāya pathaviyā nikkhittaṃ yañceva pathavirasaṃ upādiyati yañca āporasaṃ upādiyati sabbaṃ taṃ madhurattāya sātattāya asecanakattāya saṃvattati. Taṃ kissa hetu? Bījaṃ hissa, bhikkhave, bhaddakaṃ. Evamevaṃ kho, bhikkhave, sammādiṭṭhikassa purisapuggalassa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ…pe… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā sabbe te dhammā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, bhaddikā’’ti. Vaggo dutiyo.",
      "english": "For a person, monks, who possesses right view, whatever bodily action is fully undertaken in accordance with that view, whatever verbal action is fully undertaken in accordance with that view, whatever mental action is fully undertaken in accordance with that view, and whatever volition, whatever aspiration, whatever resolution, and whatever fabrications – all these phenomena lead to what is desirable, agreeable, pleasing, beneficial, and conducive to happiness.\n\nWhat is the reason for that? Because, monks, their view is wholesome.\n\nJust as, monks, a sugar cane seed, or a rice seed, or a grape seed, when placed in moist earth, whatever essence of the earth it absorbs and whatever essence of water it absorbs – all of it leads to sweetness, to deliciousness, to being unadulterated.\n\nWhat is the reason for that? Because, monks, its seed is wholesome.\n\nIn the same way, monks, for a person who possesses right view, whatever bodily action is fully undertaken in accordance with that view, whatever verbal action is fully undertaken in accordance with that view, whatever mental action is fully undertaken in accordance with that view, and whatever volition, whatever aspiration, whatever resolution, and whatever fabrications – all these phenomena lead to what is desirable, agreeable, pleasing, beneficial, and conducive to happiness.\n\nWhat is the reason for that? Because, monks, their view is wholesome.",
      "sinhala": "භික්ෂූණි, සම්මා දිට්ඨියෙන් යුක්ත වූ පුද්ගලයාගේ යම් කාය කර්මයක් ඔහුගේ ඒ දැක්මට අනුකූලව පරිපූර්ණව සමාදන් වී ඇත්නම්, යම් වාක් කර්මයක්, යම් මනෝ කර්මයක් ඔහුගේ ඒ දැක්මට අනුකූලව පරිපූර්ණව සමාදන් වී ඇත්නම්, යම් චේතනාවක් ඇත්නම්, යම් ප්‍රාර්ථනාවක් ඇත්නම්, යම් ප්‍රණිධියක් ඇත්නම්, යම් සංස්කාරයන් ඇත්නම්, ඒ සියලුම ධර්මයන් ඉෂ්ට වූ, ප්‍රිය වූ, මනස්කාන්ත වූ, හිතකර වූ, සුවදායක වූ දේ සඳහාම හේතු වේ. එයට හේතුව කුමක්ද? භික්ෂූණි, ඔහුගේ දැක්ම (දිට්ඨිය) ශ්‍රේෂ්ඨ වූ බැවිනි. භික්ෂූණි, යම් සේ වේ නම්, උක් බීජයක් හෝ, වී බීජයක් හෝ, මිදි බීජයක් හෝ තෙත් පසක සිටුවා ඇති විට, එය යම් පෘථිවි රසයක් උපාදානය කර ගනීද, යම් ආපෝ රසයක් උපාදානය කර ගනීද, ඒ සියල්ල මිහිරි බවට, රසවත් බවට, කිසිවක් මුසු නොකළ, ස්වාභාවික ප්‍රණීත බවටම හේතු වේ. එයට හේතුව කුමක්ද? භික්ෂූණි, එහි බීජය ශ්‍රේෂ්ඨ වූ බැවිනි. භික්ෂූණි, එපරිද්දෙන්ම, සම්මා දිට්ඨියෙන් යුක්ත වූ පුද්ගලයාගේ යම් කාය කර්මයක් ඔහුගේ ඒ දැක්මට අනුකූලව පරිපූර්ණව සමාදන් වී ඇත්නම්, යම් වාක් කර්මයක්, යම් මනෝ කර්මයක් ඔහුගේ ඒ දැක්මට අනුකූලව පරිපූර්ණව සමාදන් වී ඇත්නම්, යම් චේතනාවක් ඇත්නම්, යම් ප්‍රාර්ථනාවක් ඇත්නම්, යම් ප්‍රණිධියක් ඇත්නම්, යම් සංස්කාරයන් ඇත්නම්, ඒ සියලුම ධර්මයන් ඉෂ්ට වූ, ප්‍රිය වූ, මනස්කාන්ත වූ, හිතකර වූ, සුවදායක වූ දේ සඳහාම හේතු වේ. එයට හේතුව කුමක්ද? භික්ෂූණි, ඔහුගේ දැක්ම (දිට්ඨිය) ශ්‍රේෂ්ඨ වූ බැවිනි.",
      "paliTitle": ""
    },
    {
      "number": 308,
      "pali": "‘‘Ekapuggalo, bhikkhave, loke uppajjamāno uppajjati bahujanaahitāya bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Katamo ekapuggalo? Micchādiṭṭhiko hoti viparītadassano. So bahujanaṃ saddhammā vuṭṭhāpetvā asaddhamme patiṭṭhāpeti. Ayaṃ kho, bhikkhave, ekapuggalo loke uppajjamāno uppajjati bahujanaahitāya bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussāna’’nti.",
      "english": "Monks, a single individual, when arising in the world, arises for the harm of many people, for the unhappiness of many people, for the detriment, harm, and suffering of many people, both gods and humans. Who is this single individual? He is one who holds wrong view, one whose vision is perverted. Having dislodged many people from the True Dhamma, he establishes them in what is not the True Dhamma. This, monks, is that single individual who, when arising in the world, arises for the harm of many people, for the unhappiness of many people, for the detriment, harm, and suffering of many people, both gods and humans.",
      "sinhala": "භික්ෂූණි, එක් පුද්‍ගලයෙක් ලොවෙහි පහළවන්නේ බොහෝ ජනයාට අහිත පිණිසත්, බොහෝ ජනයාට දුක පිණිසත්, බොහෝ ජනයාටත්, දෙවිමිනිසුන්ටත් අනර්‍ථය පිණිස, අහිත පිණිස, දුක පිණිසමය.\n\nඒ එක් පුද්‍ගලයා කවරෙක්ද?\n\nඔහු මිත්‍යා‍දෘෂ්ටිකයෙකි; විපරීත දර්ශනයක් ඇත්තෙකි. ඔහු බොහෝ ජනයා සද්ධර්‍මයෙන් අපගමනය කරවා, අසද්ධර්‍මයෙහි පිහිටුවයි.\n\nභික්ෂූණි, මේ එක් පුද්‍ගලයා ලොවෙහි පහළවන්නේ බොහෝ ජනයාට අහිත පිණිසත්, බොහෝ ජනයාට දුක පිණිසත්, බොහෝ ජනයාටත්, දෙවිමිනිසුන්ටත් අනර්‍ථය පිණිස, අහිත පිණිස, දුක පිණිසමය.",
      "paliTitle": "Tatiyavaggo",
      "englishTitle": "The Third Section",
      "sinhalaTitle": "තෙවන වග්‍ගය"
    },
    {
      "number": 309,
      "pali": "‘‘Ekapuggalo, bhikkhave, loke uppajjamāno uppajjati bahujanahitāya bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Katamo ekapuggalo? Sammādiṭṭhiko hoti aviparītadassano. So bahujanaṃ asaddhammā vuṭṭhāpetvā saddhamme patiṭṭhāpeti. Ayaṃ kho, bhikkhave, ekapuggalo loke upapajjamāno uppajjati bahujanahitāya bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussāna’’nti.",
      "english": "Monks, when one individual appears in the world, that appearance is for the welfare of many, for the happiness of many, for the benefit, welfare, and happiness of many people, both devas and humans. Who is that one individual? He possesses Right View, having an undistorted vision. He lifts many people out of the untrue Dhamma and establishes them firmly in the true Dhamma. Indeed, monks, this is that one individual who, when appearing in the world, appears for the welfare of many, for the happiness of many, for the benefit, welfare, and happiness of many people, both devas and humans.",
      "sinhala": "මහණෙනි, එක් පුද්ගලයෙක් ලෝකයේ පහළ වන්නේ බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැපය පිණිස, දෙවි මිනිසුන්ගේ මහත් වූ අර්ථය, හිත සහ සැපය පිණිසය. ඒ එක් පුද්ගලයා කවරෙක්ද? ඔහු සම්මාදිට්ඨියෙන් යුක්තය; විපරීත දර්ශනයක් නැත්තෙකි. ඔහු බොහෝ ජනයා අසද්ධර්මයෙන් මුදවා සද්ධර්මයෙහි පිහිටුවයි. මහණෙනි, මෙසේම වූ එක් පුද්ගලයා ලෝකයේ පහළ වන්නේ බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැපය පිණිස, දෙවි මිනිසුන්ගේ මහත් වූ අර්ථය, හිත සහ සැපය පිණිසමය.",
      "paliTitle": ""
    },
    {
      "number": 310,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ mahāsāvajjaṃ yathayidaṃ, bhikkhave, micchādiṭṭhi. Micchādiṭṭhiparamāni, bhikkhave, mahāsāvajjānī’’ti [vajjānīti (sī. syā. kaṃ.)].",
      "english": "Monks, I do not discern any other single phenomenon that is as greatly reprehensible as this, monks, wrong view. Monks, greatly reprehensible things ultimately culminate in wrong view.",
      "sinhala": "භික්ෂූන් වහන්ස, මිථ්‍යාදෘෂ්ටිය තරම් මෙසේ මහත් සාවද්‍ය වූ වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. භික්ෂූන් වහන්ස, මහත් සාවද්‍ය දේ අතරින් මිථ්‍යාදෘෂ්ටියම ප්‍රමුඛ වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 311,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekapuggalampi samanupassāmi yo evaṃ bahujanaahitāya paṭipanno bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ yathayidaṃ, bhikkhave, makkhali moghapuriso. Seyyathāpi, bhikkhave, nadīmukhe khippaṃ [khipaṃ (sī. syā. kaṃ. pī.)] uḍḍeyya [oḍḍeyya (sī.), ujjheyya (ka.)] bahūnaṃ macchānaṃ ahitāya dukkhāya anayāya byasanāya; evamevaṃ kho, bhikkhave, makkhali moghapuriso manussakhippaṃ maññe loke uppanno bahūnaṃ sattānaṃ ahitāya dukkhāya anayāya byasanāyā’’ti.",
      "english": "Monks, I do not perceive any other single person who is thus engaged in causing harm to many people, in bringing unhappiness to many people, for the disadvantage, detriment, and suffering of many people, both human and divine, as is this Makkhali, the deluded man, monks.\n\nJust as, monks, at the mouth of a river, one might spread out a net for the harm, suffering, ruin, and calamity of many fish; even so, monks, Makkhali, the deluded man, is, I believe, born into the world as a snare for humanity, for the harm, suffering, ruin, and calamity of many beings.",
      "sinhala": "මහණෙනි, මේ මුළා වූ පුරුෂයා වන මක්ඛලී මෙන් බොහෝ දෙනාගේ අහිත පිණිස, බොහෝ දෙනාගේ අසතුට පිණිස, බොහෝ දෙවි මිනිසුන්ගේ අනර්ථය පිණිස, අහිත පිණිස, දුක පිණිස හැසිරෙන්නා වූ වෙනත් එක පුද්ගලයෙකුවත් මම නොදකිමි.\n\nමහණෙනි, යම් සේ ගංගා මෝයෙහි දැලක් අටවනවා ද, එය බොහෝ මසුන්ගේ අහිත පිණිස, දුක පිණිස, විනාශය පිණිස, විපත් පිණිස ම වේ. එපරිද්දෙන්ම මහණෙනි, මේ මුළා වූ පුරුෂයා වන මක්ඛලී ද බොහෝ සත්වයන්ගේ අහිත පිණිස, දුක පිණිස, විනාශය පිණිස, විපත් පිණිස ම මේ ලෝකයෙහි මනුෂ්‍ය දැලක් ලෙස පහළ වී ඇතැයි මම සිතමි.",
      "paliTitle": ""
    },
    {
      "number": 312,
      "pali": "‘‘Durakkhāte, bhikkhave, dhammavinaye yo ca samādapeti [samādāpeti (?)] yañca samādapeti yo ca samādapito tathattāya paṭipajjati sabbe te bahuṃ apuññaṃ pasavanti. Taṃ kissa hetu? Durakkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "Monks, when the Dhamma and Vinaya are poorly expounded, whoever encourages others to undertake it, and whomever he encourages, and whoever, having been encouraged, practices accordingly—all of them generate much demerit. What is the reason for this? Because, monks, the Dhamma has been poorly expounded.",
      "sinhala": "මහණෙනි, නොමනාකොට ප්‍ර‍කාශ කරන ලද ධර්මවිනයකදී, යමෙක් (අනුන්) එය සමාදන් කරවයිද, යමෙකු (අනුන් විසින්) එය සමාදන් කරවනු ලබයිද, හා යමෙක් එය සමාදන් වී ඒ ආකාරයෙන්ම පිළිපදින්නේද, ඔවුහු සියලු දෙනාම බොහෝ අකුසල් රැස් කර ගනිති. එයට හේතුව කුමක්ද? මහණෙනි, ධර්මය නොමනාකොට ප්‍ර‍කාශ කර ඇති හෙයිනි.",
      "paliTitle": ""
    },
    {
      "number": 313,
      "pali": "‘‘Svākkhāte, bhikkhave, dhammavinaye yo ca samādapeti yañca samādapeti yo ca samādapito tathattāya paṭipajjati sabbe te bahuṃ puññaṃ pasavanti. Taṃ kissa hetu? Svākkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "Monks, in this well-expounded Dhamma and Vinaya, whoever encourages others to undertake the practice, and whoever is so encouraged, and whoever, having been thus encouraged, applies themselves to the realization of the ultimate truth—all of them generate abundant merit. What is the reason for this? Because, monks, the Dhamma is well-expounded.",
      "sinhala": "භික්ෂූනි, මනාව ප්‍ර‍‌කාශ කරන ලද මේ ධර්ම විනයෙහි, යමෙක් අන් අය (නිර්වාණාවබෝධය පිණිස) ධර්ම මාර්ගය සමාදන් කරවයි ද, යමෙකු (අන්‍යයන් විසින්) ධර්ම මාර්ගය සමාදන් කරවනු ලබයි ද, යමෙක් එලෙස සමාදන් කරවන ලද්දේ (නිර්වාණාවබෝධය සඳහා) ඒ තත්ත්වයටම (නොවෙනස්ව) පිළිපදියි ද, ඒ සියලු දෙනාම බොහෝ පින් රැස් කර ගනිති.\n\nඊට හේතුව කුමක් ද? භික්ෂූනි, ඒ ධර්මය මනාව ප්‍ර‍‌කාශ කරන ලද්දක් වන හෙයිනි.",
      "paliTitle": ""
    },
    {
      "number": 314,
      "pali": "‘‘Durakkhāte, bhikkhave, dhammavinaye dāyakena mattā jānitabbā, no paṭiggāhakena. Taṃ kissa hetu? Durakkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "Monks, in a teaching and discipline that has been poorly proclaimed, the measure of what is appropriate must be understood by the giver, not by the recipient. What is the reason for this? It is, monks, because the Dhamma has been poorly proclaimed.",
      "sinhala": "භික්ෂූනි, දුරඛ්‍යාත වූ ධර්මවිනයෙහි දායකයා විසින් ප්‍රමාණය දැනගත යුත්තේය, ප්‍රතිග්‍රාහකයා විසින් නොවේ. ඒ කුමක් හෙයින්ද? භික්ෂූනි, ධර්මය දුරඛ්‍යාත වී ඇති හෙයින්ය.",
      "paliTitle": ""
    },
    {
      "number": 315,
      "pali": "‘‘Svākkhāte, bhikkhave, dhammavinaye paṭiggāhakena mattā jānitabbā, no dāyakena. Taṃ kissa hetu? Svākkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "In the well-proclaimed Teaching and Discipline, monks, the proper measure should be known by the receiver, not by the giver. What is the reason for that? Because, monks, the Dhamma is well-proclaimed.",
      "sinhala": "මහණෙනි, මනා කොට දේශනා කරන ලද ධර්ම විනයෙහි, එහි ප්‍රමාණය, එය පිළිගන්නා තැනැත්තා විසින් දත යුත්තේය; දෙන්නා විසින් නොවේ. ඒ කුමන හෙයින්ද? මහණෙනි, ධර්මය මනා කොට දේශනා කර ඇති හෙයිනි.",
      "paliTitle": ""
    },
    {
      "number": 316,
      "pali": "‘‘Durakkhāte, bhikkhave, dhammavinaye yo āraddhavīriyo so dukkhaṃ viharati. Taṃ kissa hetu? Durakkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "Monks, whoever strives diligently in a poorly expounded teaching and discipline lives in suffering. Why is that? Because, monks, the teaching is poorly expounded.",
      "sinhala": "මහණෙනි, මනාව නොදෙසූ ධර\\u200D්ම\\u200Dවිනයක යම්කිසි කෙනෙක් වී\\u200Dර්\\u200Dයය අරඹන්නේද, ඔහු දුකින් වාසය කරයි. එයට හේතුව කුමක්ද? මහණෙනි, ධර\\u200D්මය මනාව නොදෙසූ නිසාය.",
      "paliTitle": ""
    },
    {
      "number": 317,
      "pali": "‘‘Svākkhāte, bhikkhave, dhammavinaye yo kusīto so dukkhaṃ viharati. Taṃ kissa hetu? Svākkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "Monks, in this well-proclaimed Dhamma and Discipline, whoever is spiritually indolent lives in suffering. And why is that so? Because, monks, the Dhamma is well-proclaimed.",
      "sinhala": "මහණෙනි, මනාව ප්‍ර​කාශිත වූ මේ ධර්ම විනයෙහි යම් කෙනෙක් කුසීත නම්, ඔහු දුක සේ වාසය කරයි. එයට හේතුව කුමක්ද? මහණෙනි, ධර්ම​ය මනාව ප්‍ර​කාශිත බැවිනි.",
      "paliTitle": ""
    },
    {
      "number": 318,
      "pali": "‘‘Durakkhāte, bhikkhave, dhammavinaye yo kusīto so sukhaṃ viharati. Taṃ kissa hetu? Durakkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "Monks, in a Dhamma and Vinaya that is poorly expounded, the one who is indolent lives at ease. For what reason is that? Because, monks, the Teaching is poorly expounded.",
      "sinhala": "භික්ෂූන් වහන්ස, දුර්ආඛ්‍යාත වූ ධ`්`ර`ZWJ`මවිනයෙහි යම් කුසීත පුද්ගලයෙක් වේද, ඔහු සැප සේ වාසය කරයි. ඊට හේතුව කුමක්ද? භික්ෂූන් වහන්ස, ධ`්`ර`ZWJ`මය දුර්ආඛ්‍යාත බැවිනි.",
      "paliTitle": ""
    },
    {
      "number": 319,
      "pali": "‘‘Svākkhāte, bhikkhave, dhammavinaye yo āraddhavīriyo so sukhaṃ viharati. Taṃ kissa hetu? Svākkhātattā, bhikkhave, dhammassā’’ti.",
      "english": "“Monks, in this well-expounded Teaching and Discipline, whoever has aroused energy dwells in ease. For what reason is that? Because, monks, the Dhamma is well-expounded.”",
      "sinhala": "භික්ෂූනි, මැනවින් ප්‍රකාශ කරන ලද මේ ධර්‍මවිනයෙහි යම් කෙනෙක් අධිෂ්ඨාන සහගතව වීර්‍යය වඩන්නේද, හෙතෙම සුවසේ වාසය කරයි. ඊට හේතුව කුමක්ද? භික්ෂූනි, ධර්‍මය මැනවින් ප්‍රකාශ කර ඇති බැවිනි.",
      "paliTitle": ""
    },
    {
      "number": 320,
      "pali": "‘‘Seyyathāpi, bhikkhave, appamattakopi gūtho duggandho hoti; evamevaṃ kho ahaṃ, bhikkhave, appamattakampi bhavaṃ na vaṇṇemi, antamaso accharāsaṅghātamattampi’’.",
      "english": "Just as, monks, even a tiny bit of excrement is foul-smelling; even so, monks, I do not praise even a tiny bit of becoming, not even for a snap of the fingers.",
      "sinhala": "භික්ෂූනි, යම් සේ ස්වල්ප වූ ගූථයක් පවා දුර්ගන්ධයෙන් යුක්ත වේ ද, එලෙසින්ම, භික්ෂූනි, අච්චරාසංඝාත මාත්‍රයක් තරම් වූ ඉතා ස්වල්ප වූ භවයක් පවා මම ප්‍රශංසා නොකරමි.",
      "paliTitle": ""
    },
    {
      "number": 321,
      "pali": "‘‘Seyyathāpi, bhikkhave, appamattakampi muttaṃ duggandhaṃ hoti… appamattakopi kheḷo duggandho hoti… appamattakopi pubbo duggandho hoti… appamattakampi lohitaṃ duggandhaṃ hoti; evamevaṃ kho ahaṃ, bhikkhave, appamattakampi bhavaṃ na vaṇṇemi, antamaso accharāsaṅghātamattampi’’. Vaggo tatiyo.",
      "english": "Just as, monks, even a little urine is foul-smelling, even a little phlegm is foul-smelling, even a little pus is foul-smelling, and even a little blood is foul-smelling; in the same way, monks, I do not praise even a little existence, not even for the duration of a finger snap.",
      "sinhala": "භික්ෂූනි, යම් සේ ස්වල්ප වූ මුත්‍රා ප්‍රමාණයක් වුව ද දුගඳින් යුක්ත වේද… ස්වල්ප වූ කෙළ ප්‍රමාණයක් වුව ද දුගඳින් යුක්ත වේද… ස්වල්ප වූ සැරව ප්‍රමාණයක් වුව ද දුගඳින් යුක්ත වේද… ස්වල්ප වූ ලේ ප්‍රමාණයක් වුව ද දුගඳින් යුක්ත වේද; භික්ෂූනි, එලෙසින්ම මම අත පොළොස්සක් ගැසීමට තරම් වූ සුළු කාලයක් සඳහා වුව ද, කිසිදු භවයක් ස්වල්ප හෝ වර්ණනා නොකරමි.",
      "paliTitle": ""
    },
    {
      "number": 322,
      "pali": "‘‘Seyyathāpi, bhikkhave, appamattakaṃ imasmiṃ jambudīpe ārāmarāmaṇeyyakaṃ vanarāmaṇeyyakaṃ bhūmirāmaṇeyyakaṃ pokkharaṇirāmaṇeyyakaṃ; atha kho etadeva bahutaraṃ yadidaṃ ukkūlavikūlaṃ nadīviduggaṃ khāṇukaṇṭakaṭṭhānaṃ [khāṇukaṇḍakadhānaṃ (sī. pī.)] pabbatavisamaṃ; evamevaṃ kho, bhikkhave, appakā te sattā ye thalajā, atha kho eteva sattā bahutarā ye odakā’’.",
      "english": "Just as, monks, in this Rose-apple Continent, there is but a small amount that consists of pleasant parks, pleasant forests, pleasant lands, and pleasant ponds; rather, much more is that which is uneven ground, impassable rivers, places of stumps and thorns, and rough mountains. Even so, monks, few are those beings who are land-born, but indeed, much more numerous are those beings who are water-born.",
      "sinhala": "යම් සේ මහණෙනි, මේ ජම්බුද්වීපයෙහි සිත්කලු උයන්, සිත්කලු වනාන්තර, සිත්කලු භූමි, සිත්කලු පොකුණු ඇත්තේ අල්පය. එහෙත් උස් පහත් තැන්, ගං දියෙන් දුෂ්කර වූ ප්‍රදේශ, කටු හා දඬු කැබලි පිරුණු ස්ථාන, කඳුකර විෂම භූමි නම් බොහෝය. එසෙයින්ම මහණෙනි, ගොඩබිම උපන් සත්ත්‍වයෝ අල්පයහ. එහෙත් ජලයේ උපන් සත්ත්‍වයෝ බොහෝය.",
      "paliTitle": "Catutthavaggo",
      "englishTitle": "The Fourth Chapter",
      "sinhalaTitle": "සිවුවන වග්‍ගය"
    },
    {
      "number": 323,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye manussesu paccājāyanti; atha kho eteva sattā bahutarā ye aññatra manussehi paccājāyanti. … Evamevaṃ kho, bhikkhave, appakā te sattā ye majjhimesu janapadesu paccājāyanti; atha kho eteva sattā bahutarā ye paccantimesu janapadesu paccājāyanti aviññātāresu milakkhesu [milakkhūsu (ka.)].",
      "english": "Even so, monks, few are those beings who are reborn among humans; but indeed, those beings are more numerous who are reborn other than among humans.\n\nEven so, monks, few are those beings who are reborn in the central lands; but indeed, those beings are more numerous who are reborn in the outlying lands, among barbarians who are ignorant of the Dhamma.",
      "sinhala": "එසෙයින්ම, මහණෙනි, මිනිසුන් අතර නැවත උපදින සත්ත්වයෝ අල්ප වෙති; එහෙත් මිනිසුන් හැර වෙනත් තැනක නැවත උපදින සත්ත්වයෝ ම බොහෝ වෙති.\n\nඑසෙයින්ම, මහණෙනි, ධර්මය අවබෝධයට පහසු මධ්‍යම ජනපදයන්හි නැවත උපදින සත්ත්වයෝ අල්ප වෙති; එහෙත් ධර්මය අවබෝධ කරගත නොහැකි, ම්ලේච්ඡයන් වැනි සීමාන්තික ජනපදයන්හි නැවත උපදින සත්ත්වයෝ ම බොහෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 324,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye paññavanto ajaḷā aneḷamūgā paṭibalā subhāsitadubbhāsitassa atthamaññātuṃ; atha kho eteva sattā bahutarā ye duppaññā jaḷā eḷamūgā na paṭibalā subhāsitadubbhāsitassa atthamaññātuṃ.",
      "english": "Just so, monks, few are those beings who are wise, mentally agile, not dull-witted or inarticulate, and capable of understanding the meaning of what is well-spoken and what is ill-spoken. However, those beings are far more numerous who are unwise, mentally dull, dull-witted and inarticulate, and not capable of understanding the meaning of what is well-spoken and what is ill-spoken.",
      "sinhala": "එලෙසින්ම මහණෙනි, යම් සත්වයෝ ප්‍රඥා‍වන්ත වූවාහුද, මනසින් නො-ජඩ වූවාහුද, අවබෝධයට සමත් වූවාහුද, සුභාෂිතයේද, දුර්භාෂිතයේද අර්ථය අවබෝධ කරගැනීමට සමත් වන්නාහුද, ඔවුහු ස්වල්පයකි. එහෙත් යම් සත්වයෝ දුෂ්ප්‍රඥා ඇත්තාහුද, ජඩ වූවාහුද, ඒළමූග වූවාහුද, සුභාෂිතයේද, දුර්භාෂිතයේද අර්ථය අවබෝධ කරගැනීමට නො-සමත් වන්නාහුද, ඔවුහු බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 325,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye ariyena paññācakkhunā samannāgatā; atha kho eteva sattā bahutarā ye avijjāgatā sammūḷhā.",
      "english": "Indeed, monks, few are those beings who are endowed with the noble eye of wisdom; but rather, many more are those beings who are caught in ignorance and utterly deluded.",
      "sinhala": "... ඒ අයුරින්ම, මහණෙනි, යම් සත්ත්වයෝ ආර්ය ප්‍රඥාචක්‍ෂුසින් යුක්තව සිටිත්ද, ඒ සත්ත්වයෝ ස්වල්පයකි. එහෙත් යම් සත්ත්වයෝ අවිද්‍යාවට පැමිණ, මුළා වී සිටිත්ද, ඒ සත්ත්වයෝ බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 326,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye labhanti tathāgataṃ dassanāya; atha kho eteva sattā bahutarā ye na labhanti tathāgataṃ dassanāya.",
      "english": "Just so, monks, few are those beings who get to see the Tathāgata; rather, more numerous are those beings who do not get to see the Tathāgata.",
      "sinhala": "... ඒ ආකාරයෙන්ම, මහණෙනි, තථාගතයන් වහන්සේව දැකීමට ලැබෙන සත්ත්වයෝ ස්වල්ප දෙනෙකි; නමුත්, තථාගතයන් වහන්සේව දැකීමට නොලැබෙන සත්ත්වයෝ බොහෝ දෙනෙකි.",
      "paliTitle": ""
    },
    {
      "number": 327,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye labhanti tathāgatappaveditaṃ dhammavinayaṃ savanāya; atha kho eteva sattā bahutarā ye na labhanti tathāgatappaveditaṃ dhammavinayaṃ savanāya.",
      "english": "In the same way, monks, few are those beings who obtain the opportunity to listen to the Dhamma and Vinaya proclaimed by the Tathāgata; but rather, more numerous are those beings who do not obtain the opportunity to listen to the Dhamma and Vinaya proclaimed by the Tathāgata.",
      "sinhala": "මහණෙනි, එපරිද්දෙන්ම, තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්මවිනය ශ්‍රවණය කිරීමට අවස්ථාව ලබන සත්වයෝ ස්වල්ප දෙනෙක් වෙති. එහෙත්, තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්මවිනය ශ්‍රවණය කිරීමට අවස්ථාව නොලබන සත්වයෝම බහුතරයකි.",
      "paliTitle": ""
    },
    {
      "number": 328,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye sutvā dhammaṃ dhārenti; atha kho eteva sattā bahutarā ye sutvā dhammaṃ na dhārenti.",
      "english": "…In the same way, monks, few are those beings who, having heard the Dhamma, uphold it; but rather, those beings are more numerous who, having heard the Dhamma, do not uphold it.",
      "sinhala": "එලෙසම, භික්ෂූනි, ධර්මය අසා එය ධාරණය කර ගන්නා ඒ සත්ත්වයෝ ස්වල්ප දෙනෙකි. එහෙත්, ධර්මය අසා එය ධාරණය කර නොගන්නා ඒ සත්ත්වයෝ ම බොහෝ වෙත්.",
      "paliTitle": ""
    },
    {
      "number": 329,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye dhātānaṃ [dhatānaṃ (sī. syā. kaṃ. pī.)] dhammānaṃ atthaṃ upaparikkhanti; atha kho eteva sattā bahutarā ye dhātānaṃ dhammānaṃ atthaṃ na upaparikkhanti.",
      "english": "Indeed, monks, few are those beings who thoroughly investigate the true nature and purpose of conditioned phenomena; whereas, those beings are far more numerous who do not thoroughly investigate the true nature and purpose of conditioned phenomena.",
      "sinhala": "භික්‍ෂූණි, එලෙසින්ම, යම් සත්ත්වයෝ ස්ථාපිත ධර්මයන්ගේ අර්ථය මැනවින් විමසා බලත්ද, ඔවුහු අල්පයෝ වෙති; එහෙත් යම් සත්ත්වයෝ ස්ථාපිත ධර්මයන්ගේ අර්ථය මැනවින් විමසා බලන්නේ නැත්ද, ඔවුහු බොහෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 330,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye atthamaññāya dhammamaññāya dhammānudhammaṃ paṭipajjanti; atha kho eteva sattā bahutarā ye atthamaññāya dhammamaññāya dhammānudhammaṃ na paṭipajjanti.",
      "english": "In the same way, O bhikkhus, few are those beings who, having understood the true aim and having understood the Dhamma, practice in accordance with the Dhamma and its ancillary teachings; rather, those beings are more numerous who, having understood the true aim and having understood the Dhamma, do not practice in accordance with the Dhamma and its ancillary teachings.",
      "sinhala": "මහණෙනි, එපරිද්දෙන්ම යම් සත්ත්වයෝ අර්ථය ද, ධර්මය ද අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා පිළිපදින්නෝ වෙත්ද, ඒ සත්ත්වයෝ අල්ප වූවෝ වෙති. එහෙත් යම් සත්ත්වයෝ අර්ථය ද, ධර්මය ද අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටා නොපිළිපදින්නෝ වෙත්ද, ඒ සත්ත්වයෝම බොහෝ වූවෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 331,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye saṃvejaniyesu ṭhānesu saṃvijjanti; atha kho eteva sattā bahutarā ye saṃvejaniyesu ṭhānesu na saṃvijjanti.",
      "english": "Even so, monks, few are those beings who feel a sense of spiritual urgency concerning matters that should awaken it; but indeed, more numerous are those beings who do not feel a sense of spiritual urgency concerning matters that should awaken it.",
      "sinhala": "මෙසේම, භික්ෂූනි, යම් සත්ත්වයෝ සංවේග උපදවන ස්ථානවලදී සංවේගයට පත් වෙද්ද, ඒ සත්ත්වයෝ අල්පය. එහෙත් යම් සත්ත්වයෝ සංවේග උපදවන ස්ථානවලදී සංවේගයට පත් නොවෙද්ද, ඒ සත්ත්වයෝ බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 332,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye saṃviggā yoniso padahanti; atha kho eteva sattā bahutarā ye saṃviggā yoniso na padahanti.",
      "english": "In the same way, monks, few are those beings who, having been deeply stirred, strive with discernment; but rather, more numerous are those beings who, though deeply stirred, do not strive with discernment.",
      "sinhala": "… එසෙව්ම, මහණෙනි, ස්වල්පයෝම වන්නාහ යම් සත්වයෝ සංවේගයට පත්ව නිසි පරිදි වීර්යය කරත්ද. එහෙත් යම් සත්වයෝ සංවේගයට පත්ව නිසි පරිදි වීර්යය නොකරත්ද, ඔවුහු බොහෝ වන්නාහ.",
      "paliTitle": ""
    },
    {
      "number": 333,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye vavassaggārammaṇaṃ karitvā labhanti samādhiṃ [cittassa samādhiṃ (sī.)] labhanti cittassekaggataṃ [cittassekaggaṃ (sī.)]; atha kho eteva sattā bahutarā ye vavassaggārammaṇaṃ karitvā na labhanti samādhiṃ na labhanti cittassekaggataṃ.",
      "english": "Indeed, monks, few are those beings who, by taking relinquishment as their meditation object, attain concentration and attain one-pointedness of mind. However, more numerous are those very beings who, by taking relinquishment as their meditation object, do not attain concentration and do not attain one-pointedness of mind.",
      "sinhala": "එලෙසින්ම, මහණෙනි, යම් සත්ත්වයෝ මුදාහැරීම අරමුණු කොට සමාධිය ලබත්ද, සිතේ එකඟතාව ලබත්ද, ඒ සත්ත්වයෝ අල්ප වෙති. එතකුදු වුවත්, යම් සත්ත්වයෝ මුදාහැරීම අරමුණු කොට සමාධිය නොලබත්ද, සිතේ එකඟතාව නොලබත්ද, ඒ සත්ත්වයෝ බොහෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 334,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye annaggarasaggānaṃ lābhino; atha kho eteva sattā bahutarā ye annaggarasaggānaṃ na lābhino, uñchena kapālābhatena yāpenti.",
      "english": "In the same way, monks, few are those beings who receive the finest food and the choicest tastes; yet, those beings are far more numerous who do not receive the finest food and choicest tastes, but sustain themselves with gleanings and food brought in bowls.",
      "sinhala": "මහණෙනි, මේ අයුරින්ම, යම් සත්ත්ව කෙනෙක් උතුම් වූ අග්‍ර රසවත් ආහාර ලබත්ද, ඒ සත්ත්ව​යෝ ස්වල්ප දෙනෙකි. එහෙත්, යම් සත්ත්ව කෙනෙක් උතුම් වූ අග්‍ර රසවත් ආහාර නොලබත්ද, මේ සත්ත්ව​යෝම බහුතරය. ඔවුහු උච්ඡාවෘත්තියෙන්ද, පිඬුසිඟා ලැබෙන දෙයින්ද යැපෙත්.",
      "paliTitle": ""
    },
    {
      "number": 335,
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye attharasassa dhammarasassa vimuttirasassa lābhino; atha kho eteva sattā bahutarā ye attharasassa dhammarasassa vimuttirasassa na lābhino. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – attharasassa dhammarasassa vimuttirasassa lābhino bhavissāmāti. Evañhi vo, bhikkhave, sikkhitabbanti.",
      "english": "Just in the same way, monks, few are those beings who are recipients of the flavor of benefit, the flavor of the Dhamma, the flavor of liberation; but indeed, those very beings are more numerous who are not recipients of the flavor of benefit, the flavor of the Dhamma, the flavor of liberation. Therefore, monks, you should train in this way: 'We will be recipients of the flavor of benefit, the flavor of the Dhamma, the flavor of liberation.' Indeed, monks, in this way you should train.",
      "sinhala": "භික්‍ෂූනි, මේ ආකාරයෙන්ම, යම් සත්ත්වයෝ අර‍්ථ රසය, ධර‍්ම රසය සහ විමුක්ති රසය ලබන්නෝ වෙත්ද, ඔවුහු ස්වල්පයෝය. එහෙත්, යම් සත්ත්වයෝ අර‍්ථ රසය, ධර‍්ම රසය සහ විමුක්ති රසය නොලබන්නෝ වෙත්ද, ඔවුහු බොහෝය. එහෙයින්, භික්‍ෂූනි, 'අර‍්ථ රසය, ධර‍්ම රසය සහ විමුක්ති රසය ලබන්නෝ වන්නෙමු' යනුවෙන් මෙසේ පුහුණු විය යුතුයි. භික්‍ෂූනි, ඔබ විසින් මෙසේම පුහුණු විය යුතු වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 336,
      "numberRange": "336-3389",
      "pali": "‘‘Seyyathāpi, bhikkhave, appamattakaṃ imasmiṃ jambudīpe ārāmarāmaṇeyyakaṃ vanarāmaṇeyyakaṃ bhūmirāmaṇeyyakaṃ pokkharaṇirāmaṇeyyakaṃ; atha kho etadeva bahutaraṃ yadidaṃ ukkūlavikūlaṃ nadīviduggaṃ khāṇukaṇṭakaṭṭhānaṃ pabbatavisamaṃ. Evamevaṃ kho, bhikkhave, appakā te sattā ye manussā cutā manussesu paccājāyanti, atha kho eteva sattā bahutarā ye manussā cutā niraye paccājāyanti…pe… tiracchānayoniyā paccājāyanti…pe… pettivisaye paccājāyanti’’.",
      "english": "Just as, monks, in this human world, the pleasant parks, pleasant forests, pleasant lands, and pleasant ponds are but a small amount; but indeed, much more than that consists of steep ascents and descents, impassable rivers, places with stumps and thorns, and rugged mountains. In the very same way, monks, few are those beings who, having passed away from the human state, are reborn among humans; but indeed, much more are those beings who, having passed away from the human state, are reborn in hell, are reborn in the animal realm, or are reborn in the realm of hungry ghosts.",
      "sinhala": "භික්‍ෂූනි, යම් සේ ද මේ ජම්බුද්වීපයෙහි ආරාම රමණීය තැන් ද, වන රමණීය තැන් ද, භූමි රමණීය තැන් ද, පොකුණු රමණීය තැන් ද ඉතා ස්වල්පයක් වෙයි; එහෙත්, බොහෝ කොට ඇත්තේ උස්-මිටි තැන් ද, ගංගා ආදී දුර්ග තැන් ද, කටු ගස්වලින් යුත් ස්ථාන ද, කඳුකර ප්‍රදේශ ද වෙයි. එලෙසින් ම, භික්‍ෂූනි, මිනිස් ලොවින් චුත වූවාහු මිනිසුන් අතර නැවත උපදින සත්වයන් ස්වල්පයකි. එහෙත්, බොහෝ කොට ඇත්තේ මිනිස් ලොවින් චුත වූවාහු නිරයෙහි උපදින සත්වයන් ය; තිරශ්චීන යෝනියෙහි උපදින සත්වයන් ය; ප්‍රේත විෂයෙහි උපදින සත්වයන් ය.",
      "paliTitle": ""
    },
    {
      "number": 339,
      "numberRange": "339-341",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye manussā cutā devesu paccājāyanti; atha kho eteva sattā bahutarā ye manussā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "… In the same way, monks, few are those beings who, having passed away from the human state, are reborn among the devas; but these beings are more numerous who, having passed away from the human state, are reborn in hell… are reborn in the animal realm… are reborn in the realm of hungry ghosts.",
      "sinhala": "භික්ෂූනි, එමෙන්ම, යම් මනුෂ්‍යයෝ මරණයට පත්ව දෙව්ලොව නැවත උපදිත්ද, එවැනි සත්වයෝ ස්වල්පයකි. එහෙත්, යම් මනුෂ්‍යයෝ මරණයට පත්ව නිරයේ නැවත උපදිත්ද, යම් මනුෂ්‍යයෝ මරණයට පත්ව තිරිසන් යෝනියේ නැවත උපදිත්ද, යම් මනුෂ්‍යයෝ මරණයට පත්ව ප්‍රේත විෂයෙහි නැවත උපදිත්ද, එවැනි සත්වයෝ බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 342,
      "numberRange": "342-344",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye devā cutā devesu paccājāyanti; atha kho eteva sattā bahutarā ye devā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "Just so, monastics, few are those beings who, having passed away from the heavenly realms, are reborn among the devas; rather, these very beings are more numerous who, having passed away from the heavenly realms, are reborn in hell… are reborn in the animal realm… are reborn in the realm of hungry ghosts.",
      "sinhala": "භික්ෂූන් වහන්ස, එසේම, දෙව්ලොවෙන් චුත වී නැවත දෙව්ලොවම උපදින සත‍්වයෝ අල්පය. නමුත් දෙව්ලොවෙන් චුත වී නිරයේ උපදින සත‍්වයෝම බොහෝය... තිරශ‍්චීන යෝනියේ උපදින සත‍්වයෝම බොහෝය... පේත විෂයෙහි උපදින සත‍්වයෝම බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 345,
      "numberRange": "345-347",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye devā cutā manussesu paccājāyanti; atha kho eteva sattā bahutarā ye devā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "Just so, monks, few are those beings who, having passed away from the deva realm, are reborn among humans. But rather, these very beings are far more numerous who, having passed away from the deva realm, are reborn in hell, are reborn in the animal realm, or are reborn in the realm of hungry ghosts.",
      "sinhala": "… භික්ෂූණි, එලෙසින්ම යම් දෙවියෝ දෙව්ලොවින් චුතව මිනිස් ලොව නැවත උපදින්නාහුද, ඒ සත්ත්වයෝ ස්වල්පයකි. නමුත් යම් දෙවියෝ දෙව්ලොවින් චුතව නිරයෙහි නැවත උපදින්නාහුද, තිරශ්චීන යෝනියෙහි නැවත උපදින්නාහුද, ප්‍රේත විෂයෙහි නැවත උපදින්නාහුද, ඒ සත්ත්වයෝ බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 348,
      "numberRange": "348-350",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye nirayā cutā manussesu paccājāyanti; atha kho eteva sattā bahutarā ye nirayā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "Just so, mendicants, few are those beings who, having fallen from hell, are reborn among humans. But rather, far more numerous are those beings who, having fallen from hell, are reborn in hell… are reborn in the animal realm… are reborn in the realm of hungry ghosts.",
      "sinhala": "එලෙසම, මහණෙනි, යම් සත්ත්වයෝ නිරයෙන් චුත වී මිනිසුන් අතර නැවත උපදිත් ද, ඔවුහු ස්වල්පයෝ වෙති. එහෙත්, මහණෙනි, යම් සත්ත්වයෝ නිරයෙන් චුත වී නිරයේම නැවත උපදිත් ද, හෝ තිරශ්චීන යෝනියෙහි නැවත උපදිත් ද, හෝ ප්‍රේත විෂයෙහි නැවත උපදිත් ද, ඔවුහු බොහෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 351,
      "numberRange": "351-353",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye nirayā cutā devesu paccājāyanti; atha kho eteva sattā bahutarā ye nirayā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "Just so, O bhikkhus, few are those beings who, having passed away from the hells, are reborn among the devas; rather, those beings are far more numerous who, having passed away from the hells, are reborn in the hells, or are reborn in the animal realm, or are reborn in the realm of hungry ghosts.",
      "sinhala": "භික්ෂූණි, එලෙසම ය, නිරයෙන් චුත (නැසී) දෙවියන් අතර උපදින සත්ත්වයෝ ස්වල්පයකි. එහෙත්, නිරයෙන් චුත (නැසී) නැවත නිරයෙහිම උපදින සත්ත්වයෝ බොහෝ ය; තිරශ්චීන යෝනියෙහි උපදින සත්ත්වයෝ ද බොහෝ ය; ප්‍රේත විෂයෙහි උපදින සත්ත්වයෝ ද බොහෝ ය.",
      "paliTitle": ""
    },
    {
      "number": 354,
      "numberRange": "354-356",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye tiracchānayoniyā cutā manussesu paccājāyanti; atha kho eteva sattā bahutarā ye tiracchānayoniyā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "… Just so, monks, few are those beings who, having passed away from the animal realm, are reborn among humans; but rather, more numerous are those very beings who, having passed away from the animal realm, are reborn in hell, or are reborn in the animal realm, or are reborn in the realm of hungry ghosts.",
      "sinhala": "ඒ ආකාරයෙන්ම, මහණෙනි, තිරිසන් යෝනියෙන් චුතව මනුෂ්‍යයන් අතර උපදින සත්ත්වයෝ ස්වල්පයකි. එහෙත්, තිරිසන් යෝනියෙන් චුතව නිරයේ හෝ, තිරිසන් යෝනියෙහිම හෝ, ප්‍U+0DB4U+200DU+0DCAU+0DBBේත විෂයෙහි හෝ උපදින සත්ත්වයෝ බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 357,
      "numberRange": "357-359",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye tiracchānayoniyā cutā devesu paccājāyanti; atha kho eteva sattā bahutarā ye tiracchānayoniyā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "Just so, monks, few are those beings who, having passed away from the animal realm, are reborn among the devas; but far more numerous are those very beings who, having passed away from the animal realm, are reborn in hell, are reborn in the animal realm, or are reborn in the realm of hungry ghosts.",
      "sinhala": "මහණෙනි, මෙලෙසින්ම, යම් සත්ව‍යෝ තිරශ්චීන යෝනියෙන් චුතව දෙවියන් අතර උපදිත්ද, ඒ සත්ව‍යෝ ස්වල්ප දෙනෙකි. එහෙත් යම් සත්ව‍යෝ තිරශ්චීන යෝනියෙන් චුතව නිරයේ උපදිත්ද, ඒ සත්ව‍යෝ බොහෝය. එසේම තිරශ්චීන යෝනියෙන් චුතව තිරශ්චීන යෝනියේම උපදිත්ද, ඒ සත්ව‍යෝද බොහෝය. එසේම තිරශ්චීන යෝනියෙන් චුතව ප්‌රේත විෂයෙහි උපදිත්ද, ඒ සත්ව‍යෝද බොහෝය.",
      "paliTitle": ""
    },
    {
      "number": 360,
      "numberRange": "360-362",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye pettivisayā cutā manussesu paccājāyanti; atha kho eteva sattā bahutarā ye pettivisayā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti.",
      "english": "Just so, bhikkhus, few are those beings who, having passed away from the realm of hungry ghosts, are reborn among humans. Rather, those very beings are far more numerous who, having passed away from the realm of hungry ghosts, are reborn in hell, are reborn in the animal realm, or are reborn again in the realm of hungry ghosts itself.",
      "sinhala": "මහණෙනි, එපරිද්දෙන්ම, ප්‍රේත විෂයයෙන් චුත වී මනුෂ්‍යයන් අතර නැවත උපදින්නා වූ සත්ත්වයෝ ස්වල්ප දෙනෙක් වෙති. එහෙත්, ප්‍රේත විෂයයෙන් චුත වී නිරයේ නැවත උපදින සත්ත්වයෝ ද, තිරශ්චීන යෝනියේ නැවත උපදින සත්ත්වයෝ ද, ප්‍රේත විෂයෙහි නැවත උපදින සත්ත්වයෝ ද බොහෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 363,
      "numberRange": "363-365",
      "pali": "… Evamevaṃ kho, bhikkhave, appakā te sattā ye pettivisayā cutā devesu paccājāyanti; atha kho eteva sattā bahutarā ye pettivisayā cutā niraye paccājāyanti… tiracchānayoniyā paccājāyanti… pettivisaye paccājāyanti. ",
      "english": "Indeed, monks, few are those beings who, having passed away from the realm of hungry ghosts, are reborn among the devas; rather, these beings are more numerous who, having passed away from the realm of hungry ghosts, are reborn in hell, are reborn in the animal realm, or are reborn again in the realm of hungry ghosts.",
      "sinhala": "මහණෙනි, එපරිද්දෙන්ම, ප්‍රේතලෝකයෙන් චුතව දෙවියන් අතර නැවත උපදින සත්ත්වයෝ ස්වල්ප දෙනෙක් වෙති. එහෙත්, ප්‍රේතලෝකයෙන් චුතව නිරයේ, තිරශ්චීන යෝනියේ හෝ ප්‍රේතලෝකයේම නැවත උපදින සත්ත්වයෝම බහුල වෙති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Vaggo catuttho. Jambudīpapeyyālo niṭṭhito. Ekadhammapāḷi soḷasamo.",
    "english": "Fourth Chapter. Jambudipa Recital Concluded. Sixteenth Ekadhamma Text.",
    "sinhala": "සිව්වැනි වග්ගය. ජම්බුද්‍වීප පෙය්‍යාලය නිමි. දහසයවැනි එකධම්මපාළිය."
  }
}