{
  "id": "an1.17",
  "title": {
    "pali": "Pasādakaradhammavaggo",
    "english": "The Chapter on Teachings that Inspire Serene Confidence",
    "sinhala": "ප්‍රසාදජනක ධර්‍ම වග්ගය"
  },
  "sections": [
    {
      "number": 366,
      "numberRange": "366-381",
      "pali": "‘‘Addhamidaṃ, bhikkhave, lābhānaṃ yadidaṃ āraññikattaṃ [araññakattaṃ (sabbattha)] …pe… piṇḍapātikattaṃ… paṃsukūlikattaṃ… tecīvarikattaṃ… dhammakathikattaṃ… vinayadharattaṃ [vinayadharakattaṃ (syā. kaṃ. pī. ka.)] … bāhusaccaṃ… thāvareyyaṃ… ākappasampadā… parivārasampadā… mahāparivāratā… kolaputti… vaṇṇapokkharatā… kalyāṇavākkaraṇatā… appicchatā… appābādhatā’’ti. Soḷasa pasādakaradhammā niṭṭhitā. ",
      "english": "Indeed, monks, these are truly valuable acquisitions: the quality of dwelling in the wilderness, and so on; the practice of subsisting on alms food; the practice of wearing robes made from discarded rags; the practice of using only the three robes; the quality of being a Dhamma speaker; the quality of being an upholder of the Vinaya; great erudition; steadfastness; perfection of deportment; accomplishment in one's retinue; having a large following; being of noble lineage; having a fair and clear complexion; having wholesome and agreeable speech; having few desires; and being free from illness.\n\nSixteen qualities that inspire confidence are concluded.",
      "sinhala": "මහණෙනි, මෙය සැබවින්ම ලාභයන්ගෙන් ලැබූ ලාභයකි, යනු නම්: වනසෙනසුන් සේවනය කිරීම, පිණ්ඩපාතයෙන් යැපීම, පන්සූකූල සිවුරු දැරීම, තෙචීවරික අංගය දැරීම (තුන් සිවුර පමණක් දැරීම), ධර්ම කථික වීම, විනයධර වීම, බහුශ‍්‍රැත භාවය, ස්ථාවරභාවය (ධර්මයෙහි නොසෙල්වෙන ස්ථිර බව), ආකල්ප සම්පදා (ශෝභන චරණ ධර්මය), පරිවාර සම්පදා (පිරිවරින් යුක්ත වීම), මහා පිරිවර ඇති බව, කුලපුත්‍ර භාවය, වර්ණ පොක්ඛරතා (පහන් වූ ප්‍රසන්න ශරීර වර්ණයක් ඇති බව), කල්‍යාණ වාග් කාරණ භාවය (මනහර, යහපත් වචන කතා කිරීම), අල්පේච්ඡතාවය (අඩු ආශාවන් ඇති බව), අප්පාබාධතාවය (අඩු ආබාධ ඇති බව, නිරෝගී බව) යනුයි.\n\nශ‍්‍රද්ධාව ඇති කරවන මේ දහසය ආකාර ධර්ම මෙයින් නිම විය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Pasādakaradhammavaggo sattarasamo.",
    "english": "The Seventeenth Section on Faith-Inspiring Teachings",
    "sinhala": "ප්‍රසාදකර ධර්ම දහහත්වන"
  }
}