{
  "id": "an1.6",
  "title": {
    "pali": "Accharāsaṅghātavaggo",
    "english": "The Section on the Snap of a Finger",
    "sinhala": "ඇඟිලි ගැටගැසීමේ වග්ගය"
  },
  "sections": [
    {
      "number": 51,
      "pali": "‘‘Pabhassaramidaṃ, bhikkhave, cittaṃ. Tañca kho āgantukehi upakkilesehi upakkiliṭṭhaṃ. Taṃ assutavā puthujjano yathābhūtaṃ nappajānāti. Tasmā ‘assutavato puthujjanassa cittabhāvanā natthī’ti vadāmī’’ti. Paṭhamaṃ.",
      "english": "Monks, this mind is inherently luminous. It is, however, defiled by adventitious defilements. The uninstructed ordinary person does not understand this as it actually is. Therefore, I declare that there is no mental development for the uninstructed ordinary person.",
      "sinhala": "භික්ෂූණි, මේ සිත ප්‍රභාස්වර ය. එහෙත් එය ආගන්තුක උපක්ලේශයන් විසින් කිලිටි කරනු ලැබ ඇත. එම කරුණ අසත්පුරුෂ පෘථග්ජනයා යථාභූත ලෙස නොදනී. එබැවින්, ‘අසත්පුරුෂ පෘථග්ජනයාට සිත දියුණු කිරීමක් නැතැයි’ මම කියමි.",
      "paliTitle": ""
    },
    {
      "number": 52,
      "pali": "‘‘Pabhassaramidaṃ, bhikkhave, cittaṃ. Tañca kho āgantukehi upakkilesehi vippamuttaṃ. Taṃ sutavā ariyasāvako yathābhūtaṃ pajānāti. Tasmā ‘sutavato ariyasāvakassa cittabhāvanā atthī’ti vadāmī’’ti. Dutiyaṃ.",
      "english": "Monks, this mind is luminous. Yet, it is freed from adventitious defilements. A well-instructed noble disciple understands this as it truly is. Therefore, I declare that for the well-instructed noble disciple, there is the cultivation of the mind.",
      "sinhala": "මහණෙනි, මේ සිත ප්‍රභාස්වරය. එහෙත් ඒ සිත ආගන්තුක උපක්ලේශයන්ගෙන් මුක්තය. ඒ ශ්‍රැතවත් ආර්ය ශ්‍රාවක තෙමේ එය යථාභූතව අවබෝධ කරගනී. එහෙයින් ‘ශ්‍රැතවත් ආර්ය ශ්‍රාවකයාට චිත්ත භාවනාවක් ඇතැ’යි මම කියමි.",
      "paliTitle": ""
    },
    {
      "number": 53,
      "pali": "‘‘Accharāsaṅghātamattampi ce, bhikkhave, bhikkhu mettācittaṃ [mettaṃ cittaṃ (sī.), mettacittaṃ (syā. kaṃ. pī. ka.)] āsevati; ayaṃ vuccati, bhikkhave – ‘bhikkhu arittajjhāno viharati satthusāsanakaro ovādapatikaro, amoghaṃ raṭṭhapiṇḍaṃ bhuñjati’. Ko pana vādo ye naṃ bahulīkarontī’’ti! Tatiyaṃ.",
      "english": "Monks, if a monk cultivates a mind of loving-kindness even for the mere duration of a finger-snap, he is said, monks, to be a monk who dwells with fruitful meditation, who is responsive to the Teacher's teaching, compliant with exhortation, and who consumes the alms-food from the country not in vain. How much more so for those who cultivate it extensively!",
      "sinhala": "භික්ෂූණි, යම් භික්ෂුවක් ඇඟිලි සනහන තරම් මොහොතක් හෝ මෛත‍්‍රී චිත්තය ආසේවනය කරන්නේ නම්; භික්ෂූණි, ඔහු මෙසේ කියනු ලැබේ: ‘මේ භික්ෂුවගේ ධ්‍යාන නිෂ්ඵල නොවේ, ශාස්තෘන් වහන්සේගේ ශාසනයට අනුකූලව ක‍්‍රියා කරන්නෙකි, අවවාද අනුගමනය කරන්නෙකි, ජනපදයේ පිණ්ඩපාතය නිෂ්ඵල නොකොට වළඳන්නේය’ කියාය. ඉතින් යම් අයෙක් එය බහුල වශයෙන් වඩන්නේ නම්, කුමක් කියන්නද!",
      "paliTitle": ""
    },
    {
      "number": 54,
      "pali": "‘‘Accharāsaṅghātamattampi ce, bhikkhave, bhikkhu mettācittaṃ bhāveti; ayaṃ vuccati, bhikkhave – ‘bhikkhu arittajjhāno viharati satthusāsanakaro ovādapatikaro, amoghaṃ raṭṭhapiṇḍaṃ bhuñjati’. Ko pana vādo ye naṃ bahulīkarontī’’ti! Catutthaṃ.",
      "english": "Monks, if a monk cultivates a mind of loving-kindness even for the briefest moment, such a monk, O monks, is called one who dwells with unblemished meditative absorption, who acts in accordance with the Teacher's instructions, who responds to exhortation, and who consumes the country's alms-food fruitfully. How much more so for those who cultivate it extensively!",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් ඇසිපිය හෙළන පමණ වේලාවක් හෝ මෙත් සිත වඩන්නේ නම්; මහණෙනි, මේ භික්ෂුව ‘නිරවද්‍ය ධ්‍යානයෙන් වාසය කරන, ශාස්තෲන්වහන්සේගේ ශාසනයට අනුව ක්‍රියා කරන, උන්වහන්සේගේ ඕවාද පිළිපදින, රටවැසියාගේ පිණ්ඩපාතය සඵල කරමින් වළඳන භික්ෂුවක්’ යැයි කියනු ලැබේ. එසේ නම්, යම් කිසිවෙක් එය බහුල වශයෙන් වඩන්නේ නම් ඒ ගැන කියනුම කවරේද?",
      "paliTitle": ""
    },
    {
      "number": 55,
      "pali": "‘‘Accharāsaṅghātamattampi ce, bhikkhave, bhikkhu mettācittaṃ manasi karoti; ayaṃ vuccati, bhikkhave – ‘bhikkhu arittajjhāno viharati satthusāsanakaro ovādapatikaro amoghaṃ raṭṭhapiṇḍaṃ bhuñjati’. Ko pana vādo ye naṃ bahulīkarontī’’ti! Pañcamaṃ.",
      "english": "Monks, if a monk cultivates a mind of loving-kindness even for the duration of a finger snap, of him it is said, Monks: ‘This monk dwells with faultless meditation, acts in accordance with the Teacher’s instruction, heeds advice, and consumes the country’s alms-food without it being in vain.’ How much more so for those who cultivate it abundantly!",
      "sinhala": "භික්‍ෂූණි, යම් මහණෙක් ඇඟිලි ගැසීමක් තරම් වූ කාලයක් වුවද මෙත් සිත මනසින් දියුණු කරයි නම්, භික්‍ෂූණි, ඔහු මෙසේ කියනු ලැබේ: ‘මහණ තෙමේ අර්ථවත් ධ්‍යාන වැඩීමෙන් යුක්තව වෙසෙයි. ශාස්තෘන් වහන්සේගේ ශාසනයට අනුව කටයුතු කරන්නෙකි. උපදෙස් පිළිගන්නෙකි. රටවැසියාගේ පිණ්ඩපාතය නිෂ්ඵල නොකොට වළඳන්නෙකි.’ යම් කෙනෙක් මෙත් සිත බහුල වශයෙන් පුරුදු කරත් නම්, අන් කවර කතා ද?",
      "paliTitle": ""
    },
    {
      "number": 56,
      "pali": "‘‘Ye keci, bhikkhave, dhammā akusalā akusalabhāgiyā akusalapakkhikā, sabbe te manopubbaṅgamā. Mano tesaṃ dhammānaṃ paṭhamaṃ uppajjati, anvadeva akusalā dhammā’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, whatever states are unwholesome, leading to unwholesomeness, and aligned with unwholesomeness—all of them are mind-preceded. The mind arises first for those states, and then the unwholesome states follow closely.",
      "sinhala": "මහණෙනි, යම්කිසි අකුසල ධර්ම කෙනෙක්, අකුසල කොටසට අයත් වූ, අකුසල පක්ෂයට අයත් වූ වේද, ඒ සියල්ල මනස පෙරටු කොට ඇත්තාහ. ඒ ධර්මයන් අතුරෙන් මනස පළමුව උපදී, අනතුරුව අකුසල ධර්ම උපදී.",
      "paliTitle": ""
    },
    {
      "number": 57,
      "pali": "‘‘Ye keci, bhikkhave, dhammā kusalā kusalabhāgiyā kusalapakkhikā, sabbe te manopubbaṅgamā. Mano tesaṃ dhammānaṃ paṭhamaṃ uppajjati, anvadeva kusalā dhammā’’ti. Sattamaṃ.",
      "english": "Monks, whatever phenomena are wholesome, conducive to wholesomeness, and allied with wholesomeness—all of them are preceded by the mind. The mind arises first for these phenomena; immediately following are the wholesome phenomena.",
      "sinhala": "භික්‍ෂූන් වහන්ස, යම්කිසි කුසල වූ, කුසලයට අයත් වූ, කුසල පක්‍ෂයට අයත් වූ ධර්ම කවර හෝ වේ නම්, ඒ සියල‍්ල මනස පෙරටු කොට ඇත්තාහ. ඒ ධර්මයන්ට මනස පළමුවෙන් උපදියි. ඒ අනුවම කුසල ධර්ම ඇතිවෙයි.",
      "paliTitle": ""
    },
    {
      "number": 58,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā akusalā dhammā uppajjanti uppannā vā kusalā dhammā parihāyanti yathayidaṃ, bhikkhave, pamādo. Pamattassa, bhikkhave, anuppannā ceva akusalā dhammā uppajjanti uppannā ca kusalā dhammā parihāyantī’’ti. Aṭṭhamaṃ.",
      "english": "Bhikkhus, I do not perceive any other single quality whereby unarisen unwholesome states arise, or arisen wholesome states decline, as is the case, bhikkhus, with heedlessness. For one who is heedless, bhikkhus, unarisen unwholesome states indeed arise, and arisen wholesome states decline.",
      "sinhala": "මහණෙනි, නූපන් අකුසල ධර්මයන් උපදින, උපන් කුසල ධර්මයන් පිරිහෙන, මේ ප්‍රමාදය වැනි වෙනත් එකම ධර්මයක්වත් මම නොදකිමි. මහණෙනි, ප්‍රමාද වූ තැනැත්තාට නූපන් අකුසල ධර්මයන්ම උපදිත්; උපන් කුසල ධර්මයන්ද පිරිහෙත්.",
      "paliTitle": ""
    },
    {
      "number": 59,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā kusalā dhammā uppajjanti uppannā vā akusalā dhammā parihāyanti yathayidaṃ, bhikkhave, appamādo. Appamattassa, bhikkhave, anuppannā ceva kusalā dhammā uppajjanti uppannā ca akusalā dhammā parihāyantī’’ti. Navamaṃ.",
      "english": "Monks, I do not discern any other single quality by which unarisen wholesome states arise, or by which arisen unwholesome states decline, as by this, monks, heedfulness. For the heedful one, monks, unarisen wholesome states arise, and arisen unwholesome states decline.",
      "sinhala": "මහණෙනි, නූපන් කුසල ධර්මයන් උපදින, උපන් අකුසල ධර්මයන් පිරිහී යන, අප්‍රමාදය තරම් වෙන එකම ධර්මයක් හෝ මම නොදකිමි.\n\nමහණෙනි, අප්‍රමාදීව කටයුතු කරන තැනැත්තා හට නූපන් කුසල ධර්මයන් උපදී; උපන් අකුසල ධර්මයන් පිරිහී යයි.",
      "paliTitle": ""
    },
    {
      "number": 60,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā akusalā dhammā uppajjanti uppannā vā kusalā dhammā parihāyanti yathayidaṃ, bhikkhave, kosajjaṃ. Kusītassa, bhikkhave, anuppannā ceva akusalā dhammā uppajjanti uppannā ca kusalā dhammā parihāyantī’’ti. Dasamaṃ. ",
      "english": "“Monks, I do not perceive any other single phenomenon by which unarisen unwholesome states arise and arisen wholesome states decline, as much as this, monks, does indolence. For the indolent person, monks, unarisen unwholesome states indeed arise, and arisen wholesome states decline.”",
      "sinhala": "භික්ෂූණි, යම් ධර්මයක් හේතුකොටගෙන නූපන් අකුසල ධර්මයන් උපදිනවාද, හෝ උපන් කුසල ධර්මයන් පිරිහෙනවාද, භික්ෂූණි, මේ කුසීතභාවය මෙන් වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. භික්ෂූණි, කුසීත පුද්ගලයාට නූපන් අකුසල ධර්මයන් උපදින්නේදමයි, උපන් කුසල ධර්මයන් පිරිහෙන්නේදමයි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Accharāsaṅghātavaggo chaṭṭho.",
    "english": "Sixth Chapter: Snap of a Finger",
    "sinhala": "අච්ඡරාසංඝාත හයවැනි වග්ගය"
  }
}