{
  "id": "an1.18",
  "title": {
    "pali": "Aparaaccharāsaṅghātavaggo",
    "english": "The Subsequent Section on a Snap of the Fingers",
    "sinhala": "අනෙකුත් අච්ඡරාසංඝාත වග්ගය"
  },
  "sections": [
    {
      "number": 382,
      "pali": "‘‘Accharāsaṅghātamattampi ce, bhikkhave, bhikkhu paṭhamaṃ jhānaṃ bhāveti, ayaṃ vuccati, bhikkhave – ‘bhikkhu arittajjhāno viharati, satthusāsanakaro ovādapatikaro, amoghaṃ raṭṭhapiṇḍaṃ bhuñjati’. Ko pana vādo ye naṃ bahulīkarontī’’ti!",
      "english": "O monks, if a monk cultivates the first meditative absorption even for a moment as brief as a finger snap, he is called, O monks, ‘a monk who dwells with a fruitful meditative absorption, one who carries out the Teacher’s instruction, one who attends to admonition, and one who does not eat the country’s alms-food in vain.’ How much more so for those who cultivate it assiduously!",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් ඇඟිලි ගැසීමක් තරම් වූ කෙටි කාලයක් පමණක් පළමු ධ්\\u200dයානය වඩන්නේ නම්, මහණෙනි, ඒ භික්ෂුව, අඵල නොවන ධ්\\u200dයානයෙන් යුතුව වාසය කරන, ශාස්තෘන් වහන්සේගේ අනුශාසනා ප්\\u200dරතිපදින්නෙක් වන, අවවාදයට අනුව ක්\\u200dරියා කරන්නෙක් වන, රටවැසියන්ගේ පිණ්ඩපාතය අඵල නොකොට වළඳන භික්ෂුවක් ලෙස හඳුන්වනු ලැබේ. එසේ නම්, එම ධ්\\u200dයානය බොහෝ සෙයින් වඩන භික්ෂූන් ගැන කුමන කතාද?",
      "paliTitle": ""
    },
    {
      "number": 383,
      "numberRange": "383-389",
      "pali": "‘‘Accharāsaṅghātamattampi ce, bhikkhave, bhikkhu dutiyaṃ jhānaṃ bhāveti…pe… tatiyaṃ jhānaṃ bhāveti…pe… catutthaṃ jhānaṃ bhāveti…pe… mettaṃ cetovimuttiṃ bhāveti…pe… karuṇaṃ cetovimuttiṃ bhāveti…pe… muditaṃ cetovimuttiṃ bhāveti…pe… upekkhaṃ cetovimuttiṃ bhāveti…pe….",
      "english": "Monks, if a bhikkhu, even for the duration of a finger-snap, develops the second meditative absorption, the third meditative absorption, or the fourth meditative absorption; or develops the liberation of mind through loving-kindness, compassion, sympathetic joy, or equanimity,…",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් ඇඟිලි පුපුරුවන තරම් සුළු මොහොතක් හෝ දෙවෙනි ධ්‍යානය වඩන්නේ නම්, තෙවෙනි ධ්‍යානය වඩන්නේ නම්, සතරවෙනි ධ්‍යානය වඩන්නේ නම්, මෙත්තා චේතෝවිමුක්තිය වඩන්නේ නම්, කරුණා චේතෝවිමුක්තිය වඩන්නේ නම්, මුදිතා චේතෝවිමුක්තිය වඩන්නේ නම්, උපේක්ඛා චේතෝවිමුක්තිය වඩන්නේ නම්.",
      "paliTitle": ""
    },
    {
      "number": 390,
      "numberRange": "390-393",
      "pali": "Kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu vedanānupassī viharati…pe… citte cittānupassī viharati…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ.",
      "english": "He abides contemplating the body as body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world; he abides contemplating feelings as feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world; he abides contemplating mind as mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world; he abides contemplating mental phenomena as mental phenomena, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world.",
      "sinhala": "කයෙහි කය මෙනෙහි කරමින්, ලෝකය කෙරෙහි ඇති අභිජ්ඣාව සහ දෝමනස්සය දුරු කොට, තියුණු වීර්‍යයෙන් යුක්තව, මනා අවබෝධයෙන් යුක්තව, සිහියෙන් යුක්තව වාසය කරයි. වේදනා‌වන්හි වේදනා මෙනෙහි කරමින්, ලෝකය කෙරෙහි ඇති අභිජ්ඣාව සහ දෝමනස්සය දුරු කොට, තියුණු වීර්‍යයෙන් යුක්තව, මනා අවබෝධයෙන් යුක්තව, සිහියෙන් යුක්තව වාසය කරයි. සිතෙහි සිත මෙනෙහි කරමින්, ලෝකය කෙරෙහි ඇති අභිජ්ඣාව සහ දෝමනස්සය දුරු කොට, තියුණු වීර්‍යයෙන් යුක්තව, මනා අවබෝධයෙන් යුක්තව, සිහියෙන් යුක්තව වාසය කරයි. ධර්මයන්හි ධර්මයන් මෙනෙහි කරමින්, ලෝකය කෙරෙහි ඇති අභිජ්ඣාව සහ දෝමනස්සය දුරු කොට, තියුණු වීර්‍යයෙන් යුක්තව, මනා අවබෝධයෙන් යුක්තව, සිහියෙන් යුක්තව වාසය කරයි.",
      "paliTitle": ""
    },
    {
      "number": 394,
      "numberRange": "394-397",
      "pali": "Anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ [viriyaṃ (sī. syā. kaṃ. pī.)] ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati.",
      "english": "One generates aspiration, makes effort, arouses energy, grasps the mind firmly, and strives with determination for the non-arising of unarisen unwholesome and unskillful states. One generates aspiration, makes effort, arouses energy, grasps the mind firmly, and strives with determination for the abandonment of arisen unwholesome and unskillful states. One generates aspiration, makes effort, arouses energy, grasps the mind firmly, and strives with determination for the arising of unarisen wholesome states. One generates aspiration, makes effort, arouses energy, grasps the mind firmly, and strives with determination for the maintenance, non-disappearance, increase, expansion, development, and fulfillment of arisen wholesome states.",
      "sinhala": "නූපන් පව් අකුසල ධර්‍ම‍යන් නූපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්‍ය‍ය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි. උපන් පව් අකුසල ධර්‍ම‍යන් ප්‍ර‍හාණය කිරීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්‍ය‍ය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි.\n\nනූපන් කුසල ධර්‍ම‍යන් උපදවා ගැනීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්‍ය‍ය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි. උපන් කුසල ධර්‍ම‍යන්ගේ ස්ථිතිය පිණිස ද, මුළා නොවී පැවතීම පිණිස ද, වැඩි දියුණු වීම පිණිස ද, වර්ධනය වීම පිණිස ද, වැඩීම පිණිස ද, පිරිපුන් වීම පිණිස ද ඡන්දය උපදවයි, වෑයම් කරයි, වීර්‍ය‍ය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි.",
      "paliTitle": ""
    },
    {
      "number": 398,
      "numberRange": "398-401",
      "pali": "Chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti… vīriyasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti… cittasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti….",
      "english": "He develops the base of spiritual power, endowed with concentration born of zeal and the volitional formations of exertion; he develops the base of spiritual power, endowed with concentration born of energy and the volitional formations of exertion; he develops the base of spiritual power, endowed with concentration born of mind and the volitional formations of exertion; he develops the base of spiritual power, endowed with concentration born of investigation and the volitional formations of exertion.",
      "sinhala": "ඡන්දය සහිත වූ, සමාධිය හා ප්‍ර‍ධානය යන සංස්කාරයන්ගෙන් සමන්විත වූ ඉර්ධිපාදය වඩයි. වීර්‍යය සහිත වූ, සමාධිය හා ප්‍ර‍ධානය යන සංස්කාරයන්ගෙන් සමන්විත වූ ඉර්ධිපාදය වඩයි. සිත සහිත වූ, සමාධිය හා ප්‍ර‍ධානය යන සංස්කාරයන්ගෙන් සමන්විත වූ ඉර්ධිපාදය වඩයි. විමංසාව සහිත වූ, සමාධිය හා ප්‍ර‍ධානය යන සංස්කාරයන්ගෙන් සමන්විත වූ ඉර්ධිපාදය වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 402,
      "numberRange": "403-406",
      "pali": "Saddhindriyaṃ bhāveti… vīriyindriyaṃ bhāveti… satindriyaṃ bhāveti… samādhindriyaṃ bhāveti… paññindriyaṃ bhāveti….",
      "english": "He develops the faculty of faith. He develops the faculty of energy. He develops the faculty of mindfulness. He develops the faculty of concentration. He develops the faculty of wisdom.",
      "sinhala": "ශ්‍රද්ධා ඉන්ද්‍රියය වඩයි.\nවීරිය ඉන්ද්‍රියය වඩයි.\nසති ඉන්ද්‍රියය වඩයි.\nසමාධි ඉන්ද්‍රියය වඩයි.\nප්‍රඥා ඉන්ද්‍රියය වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 407,
      "numberRange": "407-411",
      "pali": "Saddhābalaṃ bhāveti… vīriyabalaṃ bhāveti… satibalaṃ bhāveti… samādhibalaṃ bhāveti… paññābalaṃ bhāveti….",
      "english": "One develops the power of confidence, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom.",
      "sinhala": "ශ්‍රද්ධා බලය වඩයි... වීර්ය බලය වඩයි... සති බලය වඩයි... සමාධි බලය වඩයි... ප්‍රඥා බලය වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 412,
      "numberRange": "412-418",
      "pali": "Satisambojjhaṅgaṃ bhāveti… dhammavicayasambojjhaṅgaṃ bhāveti… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti….",
      "english": "One develops mindfulness as a factor of awakening; one develops investigation of phenomena as a factor of awakening; one develops energy as a factor of awakening; one develops rapture as a factor of awakening; one develops tranquility as a factor of awakening; one develops concentration as a factor of awakening; one develops equanimity as a factor of awakening.",
      "sinhala": "සති සම්බොජ්ඣංගය වඩයි... ධර්\\u200Dමවිචය සම්බොජ්ඣංගය වඩයි... වීර්\\u200Dය සම්බොජ්ඣංගය වඩයි... ප්‍ර\\u200Dීති සම්බොජ්ඣංගය වඩයි... පස්සද්ධි සම්බොජ්ඣංගය වඩයි... සමාධි සම්බොජ්ඣංගය වඩයි... උපේක්ඛා සම්බොජ්ඣංගය වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 419,
      "numberRange": "419-426",
      "pali": "Sammādiṭṭhiṃ bhāveti… sammāsaṅkappaṃ bhāveti… sammāvācaṃ bhāveti… sammākammantaṃ bhāveti… sammāājīvaṃ bhāveti… sammāvāyāmaṃ bhāveti… sammāsatiṃ bhāveti… sammāsamādhiṃ bhāveti….",
      "english": "One develops Right View; one develops Right Intention; one develops Right Speech; one develops Right Action; one develops Right Livelihood; one develops Right Effort; one develops Right Mindfulness; one develops Right Concentration.",
      "sinhala": "සම්මාදිට්ඨිය වඩයි. සම්මාසංකප්පය වඩයි. සම්මාවාචාව වඩයි. සම්මාකම්මන්තය වඩයි. සම්මාආජීවය වඩයි. සම්මාවායාමය වඩයි. සම්මාසතිය වඩයි. සම්මාසමාධිය වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 427,
      "numberRange": "427-434",
      "pali": "[dī. ni. 2.173; ma. ni. 2.249; a. ni. 8.65] Ajjhattaṃ rūpasaññī bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti… ajjhattaṃ rūpasaññī bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti… ajjhattaṃ arūpasaññī bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti… ajjhattaṃ arūpasaññī bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti… ajjhattaṃ arūpasaññī bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti… ajjhattaṃ arūpasaññī bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti… ajjhattaṃ arūpasaññī bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti… ajjhattaṃ arūpasaññī bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti….",
      "english": "Internally perceiving form, one sees external forms, limited, both beautiful and ugly. One perceives, 'Having overcome these, I know and see.' Internally perceiving form, one sees external forms, immeasurable, both beautiful and ugly. One perceives, 'Having overcome these, I know and see.' Internally perceiving formlessness, one sees external forms, limited, both beautiful and ugly. One perceives, 'Having overcome these, I know and see.' Internally perceiving formlessness, one sees external forms, immeasurable, both beautiful and ugly. One perceives, 'Having overcome these, I know and see.' Internally perceiving formlessness, one sees external forms that are blue, blue in color, blue in appearance, and blue in radiance. One perceives, 'Having overcome these, I know and see.' Internally perceiving formlessness, one sees external forms that are yellow, yellow in color, yellow in appearance, and yellow in radiance. One perceives, 'Having overcome these, I know and see.' Internally perceiving formlessness, one sees external forms that are red, red in color, red in appearance, and red in radiance. One perceives, 'Having overcome these, I know and see.' Internally perceiving formlessness, one sees external forms that are white, white in color, white in appearance, and white in radiance. One perceives, 'Having overcome these, I know and see.'",
      "sinhala": "තමාගේ අභ්‍යන්තරයේ රූප සංඥාව ඇතිව, බාහිර කුඩා වූ ලස්සන වූද, අවලස්සන වූද රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි. තමාගේ අභ්‍යන්තරයේ රූප සංඥාව ඇතිව, බාහිර අප්‍රමාණය වූ ලස්සන වූද, අවලස්සන වූද රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි. තමාගේ අභ්‍යන්තරයේ අරූප සංඥාව ඇතිව, බාහිර කුඩා වූ ලස්සන වූද, අවලස්සන වූද රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි. තමාගේ අභ්‍යන්තරයේ අරූප සංඥාව ඇතිව, බාහිර අප්‍රමාණය වූ ලස්සන වූද, අවලස්සන වූද රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි. තමාගේ අභ්‍යන්තරයේ අරූප සංඥාව ඇතිව, බාහිර නිල් පැහැති වූ, නිල් වර්ණ වූ, නිල් දර්ශනීය වූ, නිල් පැහැයෙන් බැබලෙන්නා වූ රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි. තමාගේ අභ්‍යන්තරයේ අරූප සංඥාව ඇතිව, බාහිර කහ පැහැති වූ, කහ වර්ණ වූ, කහ දර්ශනීය වූ, කහ පැහැයෙන් බැබලෙන්නා වූ රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි. තමාගේ අභ්‍යන්තරයේ අරූප සංඥාව ඇතිව, බාහිර රතු පැහැති වූ, රතු වර්ණ වූ, රතු දර්ශනීය වූ, රතු පැහැයෙන් බැබලෙන්නා වූ රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි. තමාගේ අභ්‍යන්තරයේ අරූප සංඥාව ඇතිව, බාහිර සුදු පැහැති වූ, සුදු වර්ණ වූ, සුදු දර්ශනීය වූ, සුදු පැහැයෙන් බැබලෙන්නා වූ රූප දකිනවා. “ඒවා අභිභවනය කර, මම දනිමි, මම දකිමි” යනුවෙන් මෙලෙස සංඥා කරයි.",
      "paliTitle": ""
    },
    {
      "number": 435,
      "numberRange": "435-442",
      "pali": "Rūpī rūpāni passati… ajjhattaṃ arūpasaññī bahiddhā rūpāni passati subhanteva adhimutto hoti… sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharati… sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati… sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharati… sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati… sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati….",
      "english": "A material being sees material forms. Inwardly perceiving formlessness, one sees external forms, being intent on them as beautiful. By completely transcending perceptions of form, by the disappearance of perceptions of resistance, and by not attending to perceptions of diversity, thinking, 'Space is infinite,' one enters and abides in the sphere of infinite space. By completely transcending the sphere of infinite space, thinking, 'Consciousness is infinite,' one enters and abides in the sphere of infinite consciousness. By completely transcending the sphere of infinite consciousness, thinking, 'There is nothing at all,' one enters and abides in the sphere of nothingness. By completely transcending the sphere of nothingness, one enters and abides in the sphere of neither perception nor non-perception. By completely transcending the sphere of neither perception nor non-perception, one enters and abides in the cessation of perception and feeling.",
      "sinhala": "රූපී වූ තැනැත්තා රූප දකියි... තමා තුළ අරූප සංඥාවක් ඇතිව, පිටත රූප දකියි. (එවිට) සුභ යැයිම අධිමුක්ත වෙයි... සම්පූර්ණයෙන්ම රූප සංඥාවන් ඉක්මවා යාමෙන්ද, ගැටීම් සංඥාවන් නැති කිරීමෙන්ද, නානත්ව සංඥාවන් නොසලකා හැරීමෙන්ද, 'අනන්ත වූ ආකාශය' යනුවෙන් ආකාශානන්ත්‍‌යායතනය උපදවාගෙන වාසය කරයි... සම්පූර්ණයෙන්ම ආකාශානන්ත්‍‌යායතනය ඉක්මවා, 'අනන්ත වූ විඤ්ඤාණය' යනුවෙන් විඤ්ඤාණානන්ත්‍‌යායතනය උපදවාගෙන වාසය කරයි... සම්පූර්ණයෙන්ම විඤ්ඤාණානන්ත්‍‌යායතනය ඉක්මවා, 'කිසිවක් නැත' යනුවෙන් ආකිංචඤ්ඤායතනය උපදවාගෙන වාසය කරයි... සම්පූර්ණයෙන්ම ආකිංචඤ්ඤායතනය ඉක්මවා, නේවසංඥානාසංඥායතනය උපදවාගෙන වාසය කරයි... සම්පූර්ණයෙන්ම නේවසංඥානාසංඥායතනය ඉක්මවා, සංඥා වේදයිත නිරෝධය උපදවාගෙන වාසය කරයි.",
      "paliTitle": ""
    },
    {
      "number": 443,
      "numberRange": "443-452",
      "pali": "Pathavīkasiṇaṃ bhāveti… āpokasiṇaṃ bhāveti… tejokasiṇaṃ bhāveti… vāyokasiṇaṃ bhāveti… nīlakasiṇaṃ bhāveti… pītakasiṇaṃ bhāveti… lohitakasiṇaṃ bhāveti… odātakasiṇaṃ bhāveti… ākāsakasiṇaṃ bhāveti… viññāṇakasiṇaṃ bhāveti….",
      "english": "He develops the earth kasiṇa, the water kasiṇa, the fire kasiṇa, the wind kasiṇa, the blue kasiṇa, the yellow kasiṇa, the red kasiṇa, the white kasiṇa, the space kasiṇa, and the consciousness kasiṇa.",
      "sinhala": "පඨවී කසිණය වඩයි, ආපෝ කසිණය වඩයි, තේජෝ කසිණය වඩයි, වායෝ කසිණය වඩයි, නීල කසිණය වඩයි, පීත කසිණය වඩයි, ලෝහිත කසිණය වඩයි, ඕදාත කසිණය වඩයි, ආකාශ කසිණය වඩයි, විඤ්ඤාණ කසිණය වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 453,
      "numberRange": "453-462",
      "pali": "Asubhasaññaṃ bhāveti… maraṇasaññaṃ bhāveti… āhāre paṭikūlasaññaṃ bhāveti… sabbaloke anabhiratisaññaṃ [anabhiratasaññaṃ (sī. syā. kaṃ. pī.)] bhāveti… aniccasaññaṃ bhāveti… anicce dukkhasaññaṃ bhāveti… dukkhe anattasaññaṃ bhāveti… pahānasaññaṃ bhāveti… virāgasaññaṃ bhāveti… nirodhasaññaṃ bhāveti….",
      "english": "One develops the perception of unattractiveness; one develops the perception of death; one develops the perception of repulsiveness in nutriment; one develops the perception of disenchantment with the entire world; one develops the perception of impermanence; one develops the perception of suffering in the impermanent; one develops the perception of non-self in suffering; one develops the perception of abandoning; one develops the perception of dispassion; one develops the perception of cessation.",
      "sinhala": "අසුභ සංඥාව වඩයි. මරණ සංඥාව වඩයි. ආහාරයෙහි පිළිකුල් සංඥාව වඩයි. සියලු ලෝකයෙහි නොඇලීමේ සංඥාව වඩයි. අනිත්‍ය සංඥාව වඩයි. අනිත්‍ය වූ දෙයෙහි දුක් සංඥාව වඩයි. දුක් වූ දෙයෙහි අනාත්ම සංඥාව වඩයි. ප්‍රහාණ සංඥාව වඩයි. විරාග සංඥාව වඩයි. නිරෝධ සංඥාව වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 463,
      "numberRange": "463-472",
      "pali": "Aniccasaññaṃ bhāveti… anattasaññaṃ bhāveti… maraṇasaññaṃ bhāveti… āhāre paṭikūlasaññaṃ bhāveti… sabbaloke anabhiratisaññaṃ bhāveti… aṭṭhikasaññaṃ bhāveti… puḷavakasaññaṃ [puḷuvakasaññaṃ (ka.)] bhāveti… vinīlakasaññaṃ bhāveti… vicchiddakasaññaṃ bhāveti… uddhumātakasaññaṃ bhāveti….",
      "english": "One develops the perception of impermanence. One develops the perception of non-self. One develops the perception of death. One develops the perception of the loathsomeness of food. One develops the perception of non-delight in the entire world. One develops the perception of a skeleton. One develops the perception of being full of worms. One develops the perception of a discoloured corpse. One develops the perception of a fissured corpse. One develops the perception of a bloated corpse.",
      "sinhala": "අනිත්‍ය සංඥාව වඩයි. අනාත්ම සංඥාව වඩයි. මරණ සංඥාව වඩයි. ආහාරයෙහි පිළිකුල් සංඥාව වඩයි. සියලු ලෝකයෙහි අභිරති විරහිත බව පිළිබඳ සංඥාව වඩයි. ඇටසැකිලි සංඥාව වඩයි. පණුවන්ගෙන් ගැවසීගත් ශරීරය පිළිබඳ සංඥාව වඩයි. නිල් පැහැ ගැන්වූ ශරීරය පිළිබඳ සංඥාව වඩයි. ඉරී ගිය හෝ සිඳී ගිය ශරීරය පිළිබඳ සංඥාව වඩයි. ඉදිමුණු ශරීරය පිළිබඳ සංඥාව වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 473,
      "numberRange": "473-482",
      "pali": "Buddhānussatiṃ bhāveti… dhammānussatiṃ bhāveti… saṅghānussatiṃ bhāveti… sīlānussatiṃ bhāveti… cāgānussatiṃ bhāveti… devatānussatiṃ bhāveti… ānāpānassatiṃ bhāveti… maraṇassatiṃ bhāveti… kāyagatāsatiṃ bhāveti… upasamānussatiṃ bhāveti….",
      "english": "Develops recollection of the Buddha; develops recollection of the Dhamma; develops recollection of the Saṅgha; develops recollection of virtue; develops recollection of generosity; develops recollection of the devas; develops mindfulness of breathing; develops mindfulness of death; develops mindfulness immersed in the body; develops recollection of peace.",
      "sinhala": "බුද්ධානුස්සතිය වඩයි… ධම්මානුස්සතිය වඩයි… සංඝානුස්සතිය වඩයි… සීලානුස්සතිය වඩයි… ත්‍යාගානුස්සතිය වඩයි… දේවතානුස්සතිය වඩයි… ආනාපානසතිය වඩයි… මරණසතිය වඩයි… කායගතසතිය වඩයි… උපසමානුස්සතිය වඩයි….",
      "paliTitle": ""
    },
    {
      "number": 483,
      "numberRange": "483-492",
      "pali": "Paṭhamajjhānasahagataṃ saddhindriyaṃ bhāveti… vīriyindriyaṃ bhāveti… satindriyaṃ bhāveti… samādhindriyaṃ bhāveti… paññindriyaṃ bhāveti… saddhābalaṃ bhāveti… vīriyabalaṃ bhāveti… satibalaṃ bhāveti… samādhibalaṃ bhāveti… paññābalaṃ bhāveti….",
      "english": "One develops the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom, each accompanied by the first jhāna. One develops the power of faith, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom, each accompanied by the first jhāna.",
      "sinhala": "ප‍්‍රථමඣානය හා සමඟ පවත්නා වූ ශ‍්‍රද්ධා ඉන්ද්‍රිය වඩයි. වීර්ය ඉන්ද්‍රිය වඩයි. සති ඉන්ද්‍රිය වඩයි. සමාධි ඉන්ද්‍රිය වඩයි. ප‍්‍රඥා ඉන්ද්‍රිය වඩයි. ශ‍්‍රද්ධා බලය වඩයි. වීර්ය බලය වඩයි. සති බලය වඩයි. සමාධි බලය වඩයි. ප‍්‍රඥා බලය වඩයි.",
      "paliTitle": ""
    },
    {
      "number": 493,
      "numberRange": "493-562",
      "pali": "‘‘Dutiyajjhānasahagataṃ…pe… tatiyajjhānasahagataṃ…pe… catutthajjhānasahagataṃ… pe… mettāsahagataṃ…pe… karuṇāsahagataṃ…pe… muditāsahagataṃ…pe… upekkhāsahagataṃ saddhindriyaṃ bhāveti… vīriyindriyaṃ bhāveti… satindriyaṃ bhāveti… samādhindriyaṃ bhāveti… paññindriyaṃ bhāveti… saddhābalaṃ bhāveti… vīriyabalaṃ bhāveti… satibalaṃ bhāveti… samādhibalaṃ bhāveti… paññābalaṃ bhāveti. Ayaṃ vuccati, bhikkhave – ‘bhikkhu arittajjhāno viharati satthusāsanakaro ovādapatikaro, amoghaṃ raṭṭhapiṇḍaṃ bhuñjati’. Ko pana vādo ye naṃ bahulīkarontī’’ti! ",
      "english": "One develops the faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, the faculty of wisdom; and the power of faith, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom—all of these accompanied by the second absorption, by the third absorption, by the fourth absorption, by loving-kindness, by compassion, by appreciative joy, and by equanimity.\n\nThis, bhikkhus, is how it is said: ‘A monk dwells with unabandoned absorption, one who carries out the Teacher’s instruction, one who acts according to admonishment, one who consumes the country’s alms food not in vain.’ How much more so for those who cultivate these extensively!",
      "sinhala": "දෙවන ධ්‍යානයට සමගාමීව, තෙවන ධ්‍යානයට සමගාමීව, සතරවන ධ්‍යානයට සමගාමීව, මෛත්‍රියට සමගාමීව, කරුණාවට සමගාමීව, මුදිතාවට සමගාමීව, උපේක්ෂාවට සමගාමීව ශ්‍ර‎ද්ධා ඉන්ද්‍රියය වඩයි, වීර්යය ඉන්ද්‍රියය වඩයි, සති ඉන්ද්‍රියය වඩයි, සමාධි ඉන්ද්‍රියය වඩයි, ප්‍ර‎ඥා ඉන්ද්‍රියය වඩයි, ශ්‍ර‎ද්ධා බලය වඩයි, වීර්යය බලය වඩයි, සති බලය වඩයි, සමාධි බලය වඩයි, ප්‍ර‎ඥා බලය වඩයි. මහණෙනි, මේ භික්ෂුව ‘නොපිරිහුණු ධ්‍යානයෙන් යුතුව වාසය කරයි, ශාස්තෘන් වහන්සේගේ ශාසනයට අනුව කටයුතු කරයි, අවවාද පිළිපදියි, රටවැසියාගේ දන් පිඬ නිෂ්ඵල නොකර වළඳයි’ යැයි කියනු ලැබේ. යම් අයෙක් මේවා බහුල වශයෙන් වඩත් ද, ඒ අය ගැන කියනුම කවරේද?",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Aparaaccharāsaṅghātavaggo aṭṭhārasamo.",
    "english": "The Eighteenth Chapter on the Subsequent Moment",
    "sinhala": "අටළොස්වන අපර අච්ඡරාසංඝාත වග්ගය"
  }
}