{
  "id": "an1.5",
  "title": {
    "pali": "Paṇihitaacchavaggo",
    "english": "The Chapter on the Well-Directed and Clear",
    "sinhala": "මනාව පිහිටුවන ලද නිර්මල වග්ගය"
  },
  "sections": [
    {
      "number": 41,
      "pali": "‘‘Seyyathāpi, bhikkhave, sālisūkaṃ vā yavasūkaṃ vā micchāpaṇihitaṃ hatthena vā pādena vā akkantaṃ hatthaṃ vā pādaṃ vā bhecchati [bhijjissati (syā. kaṃ. ka.), bhejjati (sī.) moggallānabyākaraṇaṃ passitabbaṃ] lohitaṃ vā uppādessatīti netaṃ ṭhānaṃ vijjati. Taṃ kissa hetu? Micchāpaṇihitattā, bhikkhave, sūkassa. Evamevaṃ kho, bhikkhave, so vata bhikkhu micchāpaṇihitena cittena avijjaṃ bhecchati, vijjaṃ uppādessati, nibbānaṃ sacchikarissatīti netaṃ ṭhānaṃ vijjati. Taṃ kissa hetu? Micchāpaṇihitattā, bhikkhave, cittassā’’ti. Paṭhamaṃ.",
      "english": "Just as, monks, if a rice awn or a barley awn is improperly handled and then pressed down by hand or foot, it is impossible for it to pierce the hand or foot or to draw blood. What is the reason for that? Because, monks, the awn was improperly handled. In the same way, monks, it is indeed impossible that such a monk, with a wrongly directed mind, would break through ignorance, give rise to true knowledge, and realize Nibbana. What is the reason for that? Because, monks, the mind was improperly directed.",
      "sinhala": "මහණෙනි, යම් සේ සාලි කරලක හෝ යව කරලක හෝ වැරදි අයුරින් පිහිටා ඇති කටුවක් අතින් හෝ පයින් පෑගීමෙන් අත හෝ පාදය විදිනු ඇත, නැතහොත් ලේ පිටකරවනු ඇතැයි යන මේ කරුණ සිදු විය නොහැක්කකි. ඒ කුමන හේතුවක් නිසාද? මහණෙනි, ඒ කටුව වැරදි අයුරින් පිහිටා තිබීම නිසා ය.\n\nමහණෙනි, එපරිද්දෙන්ම, නොමඟට යොමු කළ සිතක් ඇති භික්ෂුවක් අවිද්‍යාව බිඳ දමනු ඇත, විද්‍යාව උපදවනු ඇත, නිවන සාක්ෂාත් කරගනු ඇතැයි යන මේ කරුණද සිදු විය නොහැක්කකි. ඒ කුමන හේතුවක් නිසාද? මහණෙනි, සිත නොමඟට යොමු කර තිබීම නිසා ය.",
      "paliTitle": ""
    },
    {
      "number": 42,
      "pali": "‘‘Seyyathāpi, bhikkhave, sālisūkaṃ vā yavasūkaṃ vā sammāpaṇihitaṃ hatthena vā pādena vā akkantaṃ hatthaṃ vā pādaṃ vā bhecchati lohitaṃ vā uppādessatīti ṭhānametaṃ vijjati. Taṃ kissa hetu? Sammāpaṇihitattā, bhikkhave, sūkassa. Evamevaṃ kho, bhikkhave, so vata bhikkhu sammāpaṇihitena cittena avijjaṃ bhecchati, vijjaṃ uppādessati, nibbānaṃ sacchikarissatīti ṭhānametaṃ vijjati. Taṃ kissa hetu? Sammāpaṇihitattā, bhikkhave, cittassā’’ti. Dutiyaṃ.",
      "english": "Just as, bhikkhus, if a rice awn or a barley awn is properly positioned and then stepped on by a hand or a foot, it is to be expected that it will pierce the hand or the foot and cause blood to flow. Why is this so? Because, bhikkhus, the awn was properly positioned.\n\nIn the same way, bhikkhus, it is to be expected that a bhikkhu who has properly directed his mind will cleave ignorance, generate true knowledge, and realize Nibbana. Why is this so? Because, bhikkhus, the mind was properly directed.",
      "sinhala": "මහණෙනි, යම් සේ වී ගසක කටුවක් හෝ යව ගසක කටුවක් හෝ මැනවින් පිහිටුවා ගෙන අතින් හෝ පයින් පාගන ලද්දේ නම්, එය අත හෝ පාදය විදිනු ඇත, නැතහොත් ලේ නිකුත් කරවනු ඇත යන්න විය හැකි කරුණකි. ඊට හේතුව කුමක්ද? මහණෙනි, කටුව මැනවින් පිහිටා තිබීමයි.\n\nඑසෙව ම, මහණෙනි, ඒ භික්ෂුව මැනවින් පිහිටුවා ගත් සිතින් අවිද්‍යාව බිඳ දමනු ඇත, විද්‍යාව උපදවනු ඇත, නිවන අවබෝධ කරගනු ඇත යන්න විය හැකි කරුණකි. ඊට හේතුව කුමක්ද? මහණෙනි, සිත මැනවින් පිහිටා තිබීමයි.",
      "paliTitle": ""
    },
    {
      "number": 43,
      "pali": "‘‘Idhāhaṃ [idāhaṃ (sī.)], bhikkhave, ekaccaṃ puggalaṃ paduṭṭhacittaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imamhi ce ayaṃ samaye puggalo kālaṃ kareyya, yathābhataṃ nikkhitto evaṃ niraye’. Taṃ kissa hetu? Cittaṃ hissa, bhikkhave, paduṭṭhaṃ. ‘‘Cetopadosahetu pana, bhikkhave, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti. Tatiyaṃ.",
      "english": "Here, monks, I discern with my mind the mind of a certain individual whose mind is corrupted, thus: 'If this individual were to die at this moment, he would be deposited in hell just as he was brought there.' For what reason is that? Because, monks, his mind is corrupted.\n\nIndeed, monks, because of mental defilement, some beings here, upon the breaking up of the body, after death, are reborn in a state of deprivation, in a woeful destination, in a state of ruin, in hell.",
      "sinhala": "මහණෙනි, මෙලොව මම දූෂිත සිත් ඇති එක්තරා පුද්ගලයකුගේ සිත මගේ සිතින් පිරිසිඳ දැනගනිමි: 'මේ පුද්ගලයා මේ මොහොතෙහි මියගියහොත්, ගෙන ගොස් දැමුවාක් මෙන් නිරයෙහි උපදියි'.\n\nඑයට හේතුව කුමක්ද? මහණෙනි, ඔහුගේ සිත දූෂිත හෙයිනි.\n\nමහණෙනි, සිතේ දූෂණය හේතුවෙන් ඇතැම් සත්ත්වයෝ කය බිඳී යාමෙන්, මරණින් පසු අපාය, දුර්ගති, විනිපාත, නිරය යන තැන්වල උපදිත්.",
      "paliTitle": ""
    },
    {
      "number": 44,
      "pali": "‘‘Idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ pasannacittaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imamhi ce ayaṃ samaye puggalo kālaṃ kareyya, yathābhataṃ nikkhitto evaṃ sagge’. Taṃ kissa hetu? Cittaṃ hissa, bhikkhave, pasannaṃ. ‘‘Cetopasādahetu pana, bhikkhave, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti. Catutthaṃ.",
      "english": "Here, monks, I discern the mind of a certain individual with a serene mind, understanding it thoroughly with my own mind, thinking: ‘If this person were to die at this very moment, he would be placed in heaven as if he were brought there directly.’ Why is that? Because his mind, monks, is serene. Indeed, monks, it is because of such serenity of mind that some beings, upon the breaking up of the body, after death, are reborn into a good destination, a heavenly world.",
      "sinhala": "මහණෙනි, මෙහිලා මම යම් එක්තරා ප්‍රසන්න සිත් ඇති පුද්ගලයෙකුගේ සිත, (මගේ) සිතින් අවබෝධ කරගෙන මෙසේ දනිමි: ‘යම් හෙයකින් මේ පුද්ගලයා මේ මොහොතෙහි මරණයට පත් වන්නේ නම්, ඔහු හරියට (කෙනෙකු විසින්) ගෙනැවිත් තැබුවාක් මෙන් ස්වර්ගයෙහි උපදින්නේය.’ ඒ කුමන කරුණක් නිසාද? මහණෙනි, මක්නිසාද යත් ඔහුගේ සිත ප්‍රසන්න වූ බැවිනි. එහෙත් මහණෙනි, චිත්තප්‍රසාදය (සිතේ පැහැදීම) හේතු කොටගෙන මෙහිලා ඇතැම් සත්ත්වයෝ කය බිඳී, මරණයෙන් පසුව සුගතියක් වූ ස්වර්ග ලෝකයෙහි උපදිති.",
      "paliTitle": ""
    },
    {
      "number": 45,
      "pali": "‘‘Seyyathāpi, bhikkhave, udakarahado āvilo luḷito kalalībhūto tattha cakkhumā puriso tīre ṭhito na passeyya sippisambukampi [sippikasambukampi (ka.)] sakkharakaṭhalampi macchagumbampi carantampi tiṭṭhantampi. Taṃ kissa hetu? Āvilattā, bhikkhave, udakassa. Evamevaṃ kho, bhikkhave, so vata bhikkhu āvilena cittena attatthaṃ vā ñassati paratthaṃ vā ñassati ubhayatthaṃ vā ñassati uttariṃ vā manussadhammā alamariyañāṇadassanavisesaṃ sacchikarissatīti netaṃ ṭhānaṃ vijjati. Taṃ kissa hetu? Āvilattā, bhikkhave, cittassā’’ti. Pañcamaṃ.",
      "english": "Just as, monks, if a body of water is turbid, stirred up, and muddied, a person with good sight standing on the bank would not see a mussel or a conch, or gravel and pebbles, or even a school of fish, whether moving or staying still. What is the reason for that? Due to the turbid nature of the water, monks. In the same way, monks, it is not possible that a monk with a turbid mind will understand his own welfare, or the welfare of others, or the welfare of both, or realize a superior human state, a distinction of noble knowledge and vision. What is the reason for that? Due to the turbid nature of the mind, monks.",
      "sinhala": "මහණෙනි, යම් සේ කැලඹුණු, ඝෝෂා වූ, මඩ සහිත වූ ජල තටාකයක් වේද, එහි ඉවුරේ සිටිනා ඇස් ඇති පුරුෂයෙක් ගමන් කරන හෝ නැවතී සිටිනා සිප්පිකටු, ගල් කැට හෝ මසුන් සමූහයක් නොදකියි.\nඑයට හේතුව කුමක්ද? මහණෙනි, ජලය කැලඹී ඇති නිසාය.\n\nමහණෙනි, එපරිද්දෙන්ම, කැලඹුණු සිතකින් යුක්ත වූ ඒ භික්‍ෂුව, තමන්ගේ අර්ථය හෝ අනුන්ගේ අර්ථය හෝ උභය අර්ථය හෝ දැනගන්නේයයිද, මනුෂ්‍ය ධර්මයන්ට වඩා උසස් වූ, ආර්ය ඥාන දර්ශනයේ විශිෂ්ටත්වය ප්‍ර​ත්‍ය​ක්‍ෂ කරන්නේයයිද, එය විය හැකි දෙයක් නොවේ.\nඑයට හේතුව කුමක්ද? මහණෙනි, සිත කැලඹී ඇති නිසාය.",
      "paliTitle": ""
    },
    {
      "number": 46,
      "pali": "‘‘Seyyathāpi, bhikkhave, udakarahado accho vippasanno anāvilo tattha cakkhumā puriso tīre ṭhito passeyya sippisambukampi sakkharakaṭhalampi macchagumbampi carantampi tiṭṭhantampi. Taṃ kissa hetu? Anāvilattā, bhikkhave, udakassa. Evamevaṃ kho, bhikkhave, so vata bhikkhu anāvilena cittena attatthaṃ vā ñassati paratthaṃ vā ñassati ubhayatthaṃ vā ñassati uttariṃ vā manussadhammā alamariyañāṇadassanavisesaṃ sacchikarissatīti ṭhānametaṃ vijjati. Taṃ kissa hetu? Anāvilattā, bhikkhave, cittassā’’ti. Chaṭṭhaṃ.",
      "english": "Just as, monks, in a clear, serene, and undisturbed pool of water, a keen-sighted man standing on the bank would see even shellfish and snails, gravel and pebbles, and shoals of fish, whether moving about or staying still. For what reason? Because, monks, the water is undisturbed. In the same way, monks, it is indeed possible that a monk with an undisturbed mind will understand his own welfare, or the welfare of others, or the welfare of both; or that he will realize a superior noble distinction of knowledge and vision that transcends ordinary human states. For what reason? Because, monks, the mind is undisturbed.",
      "sinhala": "මහණෙනි, යම් සේ පිරිසිදු වූ, ඉතා ප්‍​රසන්න වූ, කිසිදු කැළඹීමක් නැති දිය දහරක් වේ ද, එහි ඉවුරේ සිටිනා ඇස් ඇති පුරුෂයෙක් දිය බසින සිප්පි සක් ආදියත්, වැලි කැට බොරළු ආදියත්, දියෙහි යන, සිටිනා මසුන් රංචුත් පැහැදිලිව දකිනු ඇත. ඒ කුමක් නිසා ද? මහණෙනි, ජලය කැළඹීමකින් තොර වූ බැවිනි. එසෙයින් ම මහණෙනි, යම් භික්ෂුවක් කිසිදු කැළඹීමකින් තොර වූ සිතකින් යුක්ත වේ ද, ඔහු තමාගේ අර්ථය ද (ලොව්තුරා සම්පත්තිය) අවබෝධ කර ගන්නේ ය, අනුන්ගේ අර්ථය ද අවබෝධ කර ගන්නේ ය, උභය අර්ථය ද අවබෝධ කර ගන්නේ ය, එසේත් නැතිනම් මනුෂ්‍ය ධර්මයන් ඉක්මවූ, උතුම් ආර්ය ඥාන දර්ශනයක් වන විශේෂ ධර්‍මයක් ද සාක්ෂාත් කරන්නේ ය. මෙවන් අවස්ථාවක් ඇත. ඒ කුමක් නිසා ද? මහණෙනි, සිත කැළඹීමකින් තොර වූ බැවිනි.",
      "paliTitle": ""
    },
    {
      "number": 47,
      "pali": "‘‘Seyyathāpi, bhikkhave, yāni kānici rukkhajātānaṃ phandano tesaṃ aggamakkhāyati yadidaṃ mudutāya ceva kammaññatāya ca. Evamevaṃ kho ahaṃ, bhikkhave, nāññaṃ ekadhammampi samanupassāmi yaṃ evaṃ bhāvitaṃ bahulīkataṃ mudu ca hoti kammaññañca yathayidaṃ cittaṃ. Cittaṃ, bhikkhave, bhāvitaṃ bahulīkataṃ mudu ca hoti kammaññañca hotī’’ti. Sattamaṃ.",
      "english": "Just as, monks, among all types of trees, the young shoot is declared to be the foremost among them, owing to its pliability and workability. Even so, monks, I do not discern any other single phenomenon which, when thus developed and repeatedly practiced, becomes as pliable and workable as this mind. The mind, monks, when developed and repeatedly practiced, becomes pliable and workable.",
      "sinhala": "භික්ෂූණි, යම්සේ යම් කිසි රුක් වර්ගයක් වේ ද, ඒවා අතුරින් පැළය මෘදු බවෙන්ද, කාර්යයට සුදුසු හෙවත් නම්‍යශීලී බවෙන්ද උතුම් යැයි කියනු ලැබේ.\n\nභික්ෂූණි, එලෙසින්ම, මේ සිත මෙන්, මෙසේ වඩා ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ මෘදු ද, කාර්යයට සුදුසු හෙවත් නම්‍යශීලී ද වන අන් එකදු ධර්මයක්වත් මම නොදකිමි.\n\nභික්ෂූණි, සිත වඩා ලද්දේ, බහුල වශයෙන් පුරුදු කරන ලද්දේ මෘදු ද වෙයි, කාර්යයට සුදුසු හෙවත් නම්‍යශීලී ද වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 48,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ lahuparivattaṃ yathayidaṃ cittaṃ. Yāvañcidaṃ, bhikkhave, upamāpi na sukarā yāva lahuparivattaṃ citta’’nti. Aṭṭhamaṃ.",
      "english": "Monks, I do not discern even one other phenomenon that changes as swiftly as this mind. Indeed, Monks, it is not easy to find an analogy to describe how swiftly this mind changes.",
      "sinhala": "මහණෙනි, මෙම සිත මෙන් මෙතරම් සීඝ්‍රයෙන් වෙනස් වන අන් කිසිදු එකම ධර්මයක් හෝ මම නොදකිමි. මහණෙනි, මෙම සිත කෙතරම් සීඝ්‍රයෙන් වෙනස් වේදැයි කීමට උපමාවක් දීම පවා පහසු නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 49,
      "pali": "‘‘Pabhassaramidaṃ, bhikkhave, cittaṃ. Tañca kho āgantukehi upakkilesehi upakkiliṭṭha’’nti. Navamaṃ.",
      "english": "Monks, this mind is inherently radiant. Yet, it is corrupted by adventitious defilements.",
      "sinhala": "මහණෙනි, මේ සිත ස්වභාවයෙන්ම ප්‍රභාස්වර ය. එහෙත් එය ආගන්තුක කෙලෙස්වලින් කිලිටු වී ඇත.",
      "paliTitle": ""
    },
    {
      "number": 50,
      "pali": "‘‘Pabhassaramidaṃ, bhikkhave, cittaṃ. Tañca kho āgantukehi upakkilesehi vippamutta’’nti. Dasamaṃ. ",
      "english": "Monks, this mind is luminous. And it is freed from adventitious defilements.",
      "sinhala": "මහණෙනි, මේ සිත ප්‍රභාස්වරයි. තවද, ඒ සිත ආගන්තුක උපක්ලේශයන්ගෙන් සම්පූර්ණයෙන්ම මිදුනකි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Paṇihitaacchavaggo pañcamo.",
    "english": "Fifth Chapter: Well-Directed and Pure",
    "sinhala": "පස්වන පිරිසිදු යහපත් චිත්ත වර්ගය"
  }
}