{
  "id": "an1.2",
  "title": {
    "pali": "Nīvaraṇappahānavaggo",
    "english": "The Chapter on the Abandoning of the Hindrances",
    "sinhala": "නීවරණප්‍රහාණ වර්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppanno vā kāmacchando uppajjati uppanno vā kāmacchando bhiyyobhāvāya vepullāya saṃvattati yathayidaṃ, bhikkhave, subhanimittaṃ. Subhanimittaṃ, bhikkhave, ayoniso manasi karoto anuppanno ceva kāmacchando uppajjati uppanno ca kāmacchando bhiyyobhāvāya vepullāya saṃvattatī’’ti. Paṭhamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon by which unarisen sensual desire arises, or by which arisen sensual desire increases and proliferates, as does this sign of attractiveness. Monks, when one attends unwisely to the sign of attractiveness, unarisen sensual desire arises, and arisen sensual desire increases and proliferates.",
      "sinhala": "මහණෙනි, නොහටගත් කාමච්ඡන්දය හටගැනීමටත්, හටගත් කාමච්ඡන්දය තව තවත් වර්ධනය වීමටත්, ප්‍රසාරණය වීමටත් හේතුවන, මේ සුභ නිමිත්ත හැර වෙනත් එකදු ධර්මයක් හෝ මම නොදකිමි.\n\nමහණෙනි, යමෙක් සුභ නිමිත්තට අයෝනිසෝ මනසිකාරය කරන කල්හි, නොහටගත් කාමච්ඡන්දය හටගන්නේය. හටගත් කාමච්ඡන්දය තව තවත් වර්ධනයටත්, ප්‍රසාරණයටත් හේතුවන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppanno vā byāpādo uppajjati uppanno vā byāpādo bhiyyobhāvāya vepullāya saṃvattati yathayidaṃ, bhikkhave, paṭighanimittaṃ. Paṭighanimittaṃ, bhikkhave, ayoniso manasi karoto anuppanno ceva byāpādo uppajjati uppanno ca byāpādo bhiyyobhāvāya vepullāya saṃvattatī’’ti. Dutiyaṃ.",
      "english": "Monks, I do not see any other single phenomenon by which unarisen ill-will arises, or by which arisen ill-will increases and proliferates, as much as by this, monks, the sign of aversion. Monks, when one attends unwisely to the sign of aversion, unarisen ill-will arises, and arisen ill-will increases and proliferates.",
      "sinhala": "මහණෙනි, නූපන් ව්‍යාපාදය හටගන්නා වූද, උපන් ව්‍යාපාදය තවදුරටත් වැඩී, විපුලත්වයට පත්වන වූද, මේ ප්‍ර‍[ZWJ]තිඝ නිමිත්ත හැර, වෙනත් එකම ධර්මයක්වත් මම නොදක්මි.\n\nමහණෙනි, ප්‍ර‍[ZWJ]තිඝ නිමිත්ත අයෝනිසෝ මනසිකාරයෙන් මෙනෙහි කරන කල්හි නූපන් ව්‍යාපාදය හටගනියි. උපන් ව්‍යාපාදය ද වැඩි වීම පිණිසත්, ව්‍යාප්ත වීම පිණිසත් පවතී.",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannaṃ vā thinamiddhaṃ [thīnamiddhaṃ (sī. syā. kaṃ. pī.)] uppajjati uppannaṃ vā thinamiddhaṃ bhiyyobhāvāya vepullāya saṃvattati yathayidaṃ, bhikkhave, arati tandī [tandi (ka.)] vijambhitā [vijambhikā (sī. syā. kaṃ. pī.)] bhattasammado cetaso ca līnattaṃ. Līnacittassa, bhikkhave, anuppannañceva thinamiddhaṃ uppajjati uppannañca thinamiddhaṃ bhiyyobhāvāya vepullāya saṃvattatī’’ti. Tatiyaṃ.",
      "english": "Monks, I do not discern any other single phenomenon by which either unarisen sloth and torpor arises, or arisen sloth and torpor further increases and develops, as is the case, monks, with discontent, lassitude, stretching and yawning, post-prandial sluggishness, and mental laxity. For one with a lax mind, monks, unarisen sloth and torpor indeed arises, and arisen sloth and torpor further increases and develops.",
      "sinhala": "මහණෙනි, නූපන් ථීනමිද්ධය උපදවීමටත්, උපන් ථීනමිද්ධය වඩාත් වර්ධනය වීමටත්, පෘථුලත්වයට පත්වීමටත් හේතුවන වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. මහණෙනි, ඒ අරතිය, තන්දිය, අලසකම, භෝජනයෙන් ඇතිවන මද ගතිය සහ සිතේ පසුබෑමම ය.\n\nමහණෙනි, සිතේ පසුබෑමෙන් යුත් තැනැත්තාට නූපන් ථීනමිද්ධය උපදී, උපන් ථීනමිද්ධය වඩාත් වර්ධනයටත්, පෘථුලත්වයටත් පත්වේ.",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannaṃ vā uddhaccakukkuccaṃ uppajjati uppannaṃ vā uddhaccakukkuccaṃ bhiyyobhāvāya vepullāya saṃvattati yathayidaṃ, bhikkhave, cetaso avūpasamo. Avūpasantacittassa, bhikkhave, anuppannañceva uddhaccakukkuccaṃ uppajjati uppannañca uddhaccakukkuccaṃ bhiyyobhāvāya vepullāya saṃvattatī’’ti. Catutthaṃ.",
      "english": "Monks, I do not discern even one other phenomenon by which unarisen agitation and remorse arise, or arisen agitation and remorse lead to growth and full development, as does, monks, the lack of mental tranquility. For one whose mind is untranquil, monks, unarisen agitation and remorse arise, and arisen agitation and remorse lead to growth and full development.",
      "sinhala": "භික්ෂූනි, යම් ආකාරයකින් සිතේ නොසන්සුන් බව නිසා නූපන් උද්‌ධච්‌චකුක්‌කුච්‌චය උපදී ද, උපන් උද්‌ධච්‌චකුක්‌කුච්‌චය වැඩි දියුණුවටත්, විශාල බවටත් පත් වේ ද, එබඳු වෙනත් එක්‌ දහමකුත් මම නොදකිමි. භික්ෂූනි, නොසන්සුන් සිතක්‌ ඇති අයට නූපන් උද්‌ධච්‌චකුක්‌කුච්‌චයම උපදී, උපන් උද්‌ධච්‌චකුක්‌කුච්‌චයත් වැඩි දියුණුවටත්, විශාල බවටත් පත් වේ.",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā vicikicchā uppajjati uppannā vā vicikicchā bhiyyobhāvāya vepullāya saṃvattati yathayidaṃ, bhikkhave, ayonisomanasikāro. Ayoniso, bhikkhave, manasi karoto anuppannā ceva vicikicchā uppajjati uppannā ca vicikicchā bhiyyobhāvāya vepullāya saṃvattatī’’ti. Pañcamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon by which unarisen doubt arises, or arisen doubt grows in quantity and expands, as much as this, monks, unwise attention. Monks, for one attending unwisely, unarisen doubt certainly arises, and arisen doubt grows in quantity and expands.",
      "sinhala": "මහණෙනි, නූපන් විචිකිච්ඡාවක් උපදින්නාවූද, උපන් විචිකිච්ඡාවක් වඩාත් වැඩි වීමටත්, විශාල වීමටත් හේතුවන්නාවූද, මේ අයෝනිසෝමනසිකාරය මෙන් වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි.\n\nමහණෙනි, අයෝනිසෝමනසිකාර කරන තැනැත්තාට නූපන් විචිකිච්ඡාවම උපදී, උපන් විචිකිච්ඡාවද වඩාත් වැඩි වීමටත්, විශාල වීමටත් හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppanno vā kāmacchando nuppajjati uppanno vā kāmacchando pahīyati yathayidaṃ, bhikkhave, asubhanimittaṃ. Asubhanimittaṃ, bhikkhave, yoniso manasi karoto anuppanno ceva kāmacchando nuppajjati uppanno ca kāmacchando pahīyatī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, I do not discern even a single other phenomenon by which unarisen sensual desire does not arise, or arisen sensual desire is abandoned, in the way that the sign of foulness does.\n\nMonks, when one attends systematically to the sign of foulness, unarisen sensual desire does not arise, and arisen sensual desire is abandoned.",
      "sinhala": "භික්ෂූනි, නූපන් කාමච්ඡන්දය නූපදින්නටත්, උපන් කාමච්ඡන්දය පහව යන්නටත් හේතු වන, මේ අසුභ නිමිත්ත හැර වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. භික්ෂූනි, අසුභ නිමිත්ත යෝනිසෝ මනසිකාරයෙන් මෙනෙහි කරන කල්හි, නූපන් කාමච්ඡන්දය නූපදී. උපන් කාමච්ඡන්දය ද පහව යයි.",
      "paliTitle": ""
    },
    {
      "number": 17,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppanno vā byāpādo nuppajjati uppanno vā byāpādo pahīyati yathayidaṃ, bhikkhave, mettā cetovimutti. Mettaṃ, bhikkhave, cetovimuttiṃ yoniso manasi karoto anuppanno ceva byāpādo nuppajjati uppanno ca byāpādo pahīyatī’’ti. Sattamaṃ.",
      "english": "Monks, I do not discern any other single quality by which unarisen ill will does not arise, or arisen ill will is abandoned, just as this, Monks, is the liberation of mind through loving-kindness.\n\nMonks, when one attends wisely to the liberation of mind through loving-kindness, unarisen ill will indeed does not arise, and arisen ill will is abandoned.",
      "sinhala": "මහණෙනි, නූපන් ව්‍යාපාදය නූපදින, උපන් ව්‍යාපාදය ප්‍ර‌හීණ වන, මෙත්තා චේතෝවිමුක්තිය හැර වෙනත් එකදු හෝ ධර්මයක් මම නොදකිමි.\n\nමහණෙනි, මෙත්තා චේතෝවිමුක්තිය නුවණින් මෙනෙහි කරන තැනැත්තාට නූපන් ව්‍යාපාදය නූපදින අතර, උපන් ව්‍යාපාදය ප්‍ර‌හීණ වේ.",
      "paliTitle": ""
    },
    {
      "number": 18,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannaṃ vā thinamiddhaṃ nuppajjati uppannaṃ vā thinamiddhaṃ pahīyati yathayidaṃ, bhikkhave, ārambhadhātu nikkamadhātu parakkamadhātu. Āraddhavīriyassa, bhikkhave, anuppannañceva thinamiddhaṃ nuppajjati uppannañca thinamiddhaṃ pahīyatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I do not perceive any other single quality by which unarisen sloth and torpor does not arise, or by which arisen sloth and torpor is abandoned, as these are, monks, the element of initiation, the element of exertion, and the element of persistent effort. For one who has aroused energy, monks, unarisen sloth and torpor does not arise, and arisen sloth and torpor is abandoned.",
      "sinhala": "මහණෙනි, නූපන් තීනමිද්ධය නූපදින, උපන් තීනමිද්ධය ප්‍රහීණ වන, වෙනත් එකම ධර්මයක්වත් මම නොදකිමි. මහණෙනි, යම්සේ නම් මේ ආරම්භධාතුව, නික්කමධාතුව, පරාක්‍රමධාතුව වේද එවැන්නකි. මහණෙනි, ආරම්භ කරන ලද වීර්යය ඇති අයට නූපන් තීනමිද්ධය නූපදී, උපන් තීනමිද්ධය ප්‍රහීණ වේ.",
      "paliTitle": ""
    },
    {
      "number": 19,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannaṃ vā uddhaccakukkuccaṃ nuppajjati uppannaṃ vā uddhaccakukkuccaṃ pahīyati yathayidaṃ, bhikkhave, cetaso vūpasamo. Vūpasantacittassa, bhikkhave, anuppannañceva uddhaccakukkuccaṃ nuppajjati uppannañca uddhaccakukkuccaṃ pahīyatī’’ti. Navamaṃ.",
      "english": "Bhikkhus, I do not perceive any other single quality by which unarisen restlessness and remorse does not arise, or by which arisen restlessness and remorse is abandoned, just as this, bhikkhus, is the calming of the mind. For one whose mind is calmed, bhikkhus, unarisen restlessness and remorse does not arise, and arisen restlessness and remorse is abandoned.",
      "sinhala": "භික්ෂූනි, නොහටගත් උද්ධච්ච-කුක්කුච්චය නූපදින, හටගත් උද්ධච්ච-කුක්කුච්චය පහව යන අන් කිසිම එක ධර්මයක්, භික්ෂූනි, මේ සිතේ සංසිඳීම මෙන් මම නොදකිමි. භික්ෂූනි, සිත සංසිඳුණු පුද්ගලයාට නොහටගත් උද්ධච්ච-කුක්කුච්චය නූපදින්නේමය, හටගත් උද්ධච්ච-කුක්කුච්චයද පහව යන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 20,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yena anuppannā vā vicikicchā nuppajjati uppannā vā vicikicchā pahīyati yathayidaṃ, bhikkhave, yonisomanasikāro. Yoniso, bhikkhave, manasi karoto anuppannā ceva vicikicchā nuppajjati uppannā ca vicikicchā pahīyatī’’ti. Dasamaṃ. ",
      "english": "Monks, I do not discern any other single quality by which unarisen doubt does not arise or arisen doubt is abandoned, as is this, Monks, wise attention. Monks, when one attends mentally with wise attention, unarisen doubt certainly does not arise, and arisen doubt is abandoned.",
      "sinhala": "මහණෙනි, නූපන් විචිකිච්ඡාව නූපදින, උපන් විචිකිච්ඡාව ප‌්‍රහීණ වන, මේ යොනිසෝමනසිකාරය තරම් වෙනත් එකම ධර්මයක්වත් මම නොදකිමි. මහණෙනි, යොනිසෝමනසිකාර කරන කල්හි නූපන් විචිකිච්ඡාව නූපදින අතර, උපන් විචිකිච්ඡාව ප‌්‍රහීණ වෙයි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Nīvaraṇappahānavaggo dutiyo.",
    "english": "",
    "sinhala": ""
  }
}