{
  "id": "an1.3",
  "title": {
    "pali": "Akammaniyavaggo",
    "english": "The Chapter on Unsuitability for Action",
    "sinhala": "අකර්මණ්‍ය වර්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ abhāvitaṃ akammaniyaṃ hoti yathayidaṃ, bhikkhave, cittaṃ [yathayidaṃ cittaṃ (sī. pī.) evamuparipi]. Cittaṃ, bhikkhave, abhāvitaṃ akammaniyaṃ hotī’’ti. Paṭhamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon which, being undeveloped, is so unmanageable as is this mind, O monks. The mind, O monks, being undeveloped, is unmanageable.",
      "sinhala": "මහණෙනි, මේ සිත මෙන් මෙසේ නොවැඩූ, කිසිදු යහපත් කාර්යයකට නුසුදුසු වන අන් එකද ධර්මයක් මම නොදකිමි. මහණෙනි, නොවැඩූ සිත කිසිදු යහපත් කාර්යයකට නුසුදුසු වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 22,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ bhāvitaṃ kammaniyaṃ hoti yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, bhāvitaṃ kammaniyaṃ hotī’’ti. Dutiyaṃ.",
      "english": "Monastics, I do not perceive even one other quality which, when thus cultivated, becomes as workable as this mind, O monastics. The mind, O monastics, when cultivated, becomes workable.",
      "sinhala": "මහණෙනි, මෙසේ වඩන ලද්දේ මේ සිත මෙන් (ආධ්‍යාත්මික) කටයුතු සඳහා සුදුසු වන, හසුරුවා ගැනීමට පහසු වන වෙනත් කිසිදු ධර්මයක් මම නොදකිමි. මහණෙනි, සිත වඩන ලද කල්හි (ආධ්‍යාත්මික) කටයුතු සඳහා සුදුසු වේ, හසුරුවා ගැනීමට පහසු වේ.",
      "paliTitle": ""
    },
    {
      "number": 23,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ abhāvitaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, abhāvitaṃ mahato anatthāya saṃvattatī’’ti. Tatiyaṃ.",
      "english": "Monks, I do not perceive any other single quality which, when undeveloped, leads to such great harm as this mind, monks. The mind, monks, when undeveloped, leads to great harm.",
      "sinhala": "මහණෙනි, මේ සිත මෙන්, මෙසේ නොවැඩූ කල්හි මහත් අන්තරායක් පිණිස පවතින වෙනත් එකදු ධර්‍මයක්වත් මම නොදකිමි. මහණෙනි, සිත නොවැඩූ කල්හි මහත් අන්තරායක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 24,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ bhāvitaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, bhāvitaṃ mahato atthāya saṃvattatī’’ti. Catutthaṃ.",
      "english": "Monastics, I do not perceive any other single quality which, when developed in this manner, conduces to such great benefit as does the mind. Monastics, the mind, when developed, conduces to great benefit.",
      "sinhala": "භික්ෂූණි, මෙසේ වඩන ලද කල්හි මහත් වූ අර්ථයක් පිණිස හේතු වන්නා වූ, භික්ෂූණි, මේ සිත මෙන් අන් කිසිදු එක් ධර්මයක්වත් මම නොදකිමි. භික්ෂූණි, සිත වඩන ලද කල්හි මහත් වූ අර්ථයක් පිණිස හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 25,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ abhāvitaṃ apātubhūtaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, abhāvitaṃ apātubhūtaṃ mahato anatthāya saṃvattatī’’ti. Pañcamaṃ.",
      "english": "Monks, I do not perceive even a single other phenomenon which, being thus undeveloped and uncultivated, leads to such great detriment as does this mind, monks. The mind, monks, being undeveloped and uncultivated, leads to great detriment.",
      "sinhala": "මහණෙනි, මෙසේ නොවැඩූ කල්හි, ප‍්‍රකට නොකළ කල්හි මහත් අනර්ථයක් සඳහා පවතින්නා වූ, මේ සිත තරම් අන් කිසිදු එකම ධර්මයක් හෝ මම නොදකිමි. මහණෙනි, සිත නොවැඩූ කල්හි, ප‍්‍රකට නොකළ කල්හි මහත් අනර්ථයක් සඳහා පවතී.",
      "paliTitle": ""
    },
    {
      "number": 26,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ bhāvitaṃ pātubhūtaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, bhāvitaṃ pātubhūtaṃ mahato atthāya saṃvattatī’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, I do not perceive any other single phenomenon that, being thus cultivated and brought to full manifestation, conduces to such great benefit as does this mind, monks. The mind, monks, being cultivated and brought to full manifestation, conduces to great benefit.”",
      "sinhala": "භික්ෂූන් වහන්සේලා, මෙලෙස භාවනා කරන ලදුව, ප්‍රකට කරන ලද යම් ධර්මයක් මහත් අර්ථයක් සඳහා පවතීද, භික්ෂූන් වහන්සේලා, මේ සිත මෙන් එබඳු වෙනත් කිසිදු එකම ධර්මයක් හෝ මම නොදක්මි.\n\nභික්ෂූන් වහන්සේලා, සිත භාවනා කරන ලදුව ප්‍රකට වූ කල්හි මහත් අර්ථයක් සඳහා පවතී.",
      "paliTitle": ""
    },
    {
      "number": 27,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ abhāvitaṃ abahulīkataṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, abhāvitaṃ abahulīkataṃ mahato anatthāya saṃvattatī’’ti. Sattamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon which, being thus undeveloped and uncultivated, conduces to such great detriment as does this mind. The mind, monks, being undeveloped and uncultivated, conduces to great detriment.",
      "sinhala": "භික්ෂූනි, නොවැඩූ, බහුල වශයෙන් පුරුදු නොකළ කල්හි මහත් වූ අහිත පිණිස පවත්නා මේ සිත වැනි අන්‍ය වූ එකදු ධර්‍මයක් හෝ මම නොදකිමි. භික්ෂූනි, සිත නොවැඩූ, බහුල වශයෙන් පුරුදු නොකළ කල්හි මහත් වූ අහිත පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 28,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ bhāvitaṃ bahulīkataṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, bhāvitaṃ bahulīkataṃ mahato atthāya saṃvattatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon which, when developed and frequently practiced in this way, conduces to such great benefit, as does this mind, monks. The mind, monks, when developed and frequently practiced, conduces to great benefit.",
      "sinhala": "මහණෙනි, මේ සිත මෙන්, මෙලෙස වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක්, මහත් අර්ථයක් පිණිස පවතින වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. මහණෙනි, සිත වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක් මහත් අර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 29,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ abhāvitaṃ abahulīkataṃ dukkhādhivahaṃ hoti yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, abhāvitaṃ abahulīkataṃ dukkhādhivahaṃ hotī’’ti. Navamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon which, when undeveloped and uncultivated, leads to suffering in the same way that this mind does, monks. Monks, the mind, when undeveloped and uncultivated, leads to suffering.",
      "sinhala": "මහණෙනි, යම්සේ මේ සිත නොදියුණු කළ කල්හිද, බහුල වශයෙන් පුරුදු නොකළ කල්හිද දුක් ගෙන දෙන්නේද, ඒ හා සමානව නොදියුණු කළ, බහුල වශයෙන් පුරුදු නොකළ කල්හි දුක් ගෙන දෙන වෙනත් කිසිම ධර්මයක් මා විසින් අනුදක්නා නොලැබේ. මහණෙනි, සිත නොදියුණු කළ කල්හිද, බහුල වශයෙන් පුරුදු නොකළ කල්හිද දුක් ගෙන දෙයි.",
      "paliTitle": ""
    },
    {
      "number": 30,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ bhāvitaṃ bahulīkataṃ sukhādhivahaṃ hoti yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, bhāvitaṃ bahulīkataṃ sukhādhivahaṃ hotī’’ti. Dasamaṃ. ",
      "english": "“Monks, I do not discern even a single other phenomenon which, when thus developed and frequently cultivated, brings about happiness, as does, Monks, the mind. Monks, the mind, when developed and frequently cultivated, brings about happiness.”",
      "sinhala": "භික්ෂූනි, මේ සිත මෙන් මෙසේ වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව සැප පිණිස පවතින වෙනත් කිසිදු එකම ධර්මයක් මම නොදකිමි. භික්ෂූනි, සිත වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව සැප පිණිස පවතී.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Akammaniyavaggo tatiyo.",
    "english": "",
    "sinhala": ""
  }
}