{
  "id": "an1.4",
  "title": {
    "pali": "Adantavaggo",
    "english": "The Untamed",
    "sinhala": "දමනය නොකළවුන්ගේ වග්ගය"
  },
  "sections": [
    {
      "number": 31,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ adantaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, adantaṃ mahato anatthāya saṃvattatī’’ti. Paṭhamaṃ.",
      "english": "Monks, I do not discern any other single phenomenon which, being thus untamed, leads to such great harm as does this mind. Monks, an untamed mind leads to great harm.",
      "sinhala": "භික්ෂූනි, මේ සිත මෙන් මෙසේ නොදැමුණේ මහත් අනර්ථයක් පිණිස පවතින වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. භික්ෂූනි, නොදැමුණු සිත මහත් අනර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 32,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ dantaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, dantaṃ mahato atthāya saṃvattatī’’ti. Dutiyaṃ.",
      "english": "Monks, I do not discern any other single factor which, when thus disciplined, conduces to such immense welfare as does this mind, monks.\n\nThe mind, monks, when disciplined, conduces to immense welfare.",
      "sinhala": "මහණෙනි, මා විසින් වෙනත් කිසිම ධර්මයක් දකිනු නොලැබේ, යම් ධර්මයක් මෙසේ දමනය කරන ලද කල්හි මහත් වූ අර්ථය පිණිස පවතින්නේද, මහණෙනි, මේ සිතද එසේමය.\n\nමහණෙනි, දමනය කරන ලද සිත මහත් වූ අර්ථය පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 33,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ aguttaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, aguttaṃ mahato anatthāya saṃvattatī’’ti. Tatiyaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon that, when unguarded in this way, brings about such great harm, as does this mind, monks. The mind, monks, when unguarded, brings about great harm.",
      "sinhala": "මහණෙනි, ආරක්‍ෂා නොකරන ලදුව, මේ සිත මෙන් මහත් අනර්ථයක් පිණිස පවතින වෙනත් කිසිදු ධර්මයක් මම නොදකිමි. මහණෙනි, ආරක්‍ෂා නොකරන ලද සිත මහත් අනර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 34,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ guttaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, guttaṃ mahato atthāya saṃvattatī’’ti. Catutthaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon that, when thus guarded, conduces to such great benefit as does this mind, monks. Monks, the mind, when guarded, conduces to great benefit.",
      "sinhala": "මහණෙනි, යම් ධර්මයක් මෙසේ ආරක්‍ෂා කරන ලද්දේ මහත් අර්ථයක් පිණිස පවතින්නේද, මේ සිත මෙන් වෙනත් එබඳු එකදු ධර්මයක්වත් මම නොදකිමි. මහණෙනි, සිත ආරක්‍ෂා කරන ලද්දේ මහත් අර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 35,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ arakkhitaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, arakkhitaṃ mahato anatthāya saṃvattatī’’ti. Pañcamaṃ.",
      "english": "Monks, I do not perceive any other single quality that, when left unguarded in this way, leads to such great harm as does this mind. The mind, monks, when unguarded, leads to great harm.",
      "sinhala": "භික්ෂූනි, මේ සිත මෙන් මෙලෙසින් අරක්ෂිත වූ කල්හි මහත් අහිත පිණිස පවතින වෙනත් එකදු ධර්මයක් හෝ මම නොදකිමි. භික්ෂූනි, අරක්ෂිත වූ සිත මහත් අහිත පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 36,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ rakkhitaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, rakkhitaṃ mahato atthāya saṃvattatī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, I do not discern any other single quality that, when guarded in this way, conduces to such great benefit as does this mind. Monks, the mind, when guarded, conduces to great benefit.",
      "sinhala": "මහණෙනි, යම් සේ මේ සිත රැකගැනීම මහත් වූ වැඩ පිණිස පවතින්නේද, මහණෙනි, මෙලෙසින් රැකගත් වෙනත් එකදු ධර්‍මයක්වත් මහත් වූ වැඩ පිණිස පවතින බව මම නොදකිමි. මහණෙනි, සිත රැකගත් කල්හි මහත් වූ වැඩ පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 37,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ asaṃvutaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, asaṃvutaṃ mahato anatthāya saṃvattatī’’ti. Sattamaṃ.",
      "english": "Monks, I do not find any other single phenomenon which, when so unguarded, leads to such great detriment as does this mind, monks. The mind, monks, when unguarded, leads to great detriment.",
      "sinhala": "මහණෙනි, මේ සිත මෙන් මෙසේ අසංවර වූ කල්හි මහත් අනර්‍ථයක් පිණිස පවතින වෙනත් එකම ධර්‍මයක්වත් මම නොදකිමි. මහණෙනි, සිත අසංවර වූ කල්හි මහත් අනර්‍ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 38,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ saṃvutaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, saṃvutaṃ mahato atthāya saṃvattatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I do not perceive any other single factor that, when thus restrained, conduces to such great benefit as does this mind, monks. The mind, monks, when restrained, conduces to great benefit.",
      "sinhala": "මහණෙනි, යම් ධර්මයක් මෙසේ සංවර වූ කල්හි මහත් අර්ථයක් පිණිස පවතීද, ඒ ධර්මය මේ සිත හැර වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. මහණෙනි, සිත සංවර වූ කල්හි මහත් අර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 39,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ adantaṃ aguttaṃ arakkhitaṃ asaṃvutaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, adantaṃ aguttaṃ arakkhitaṃ asaṃvutaṃ mahato anatthāya saṃvattatī’’ti. Navamaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon that, being thus untamed, unguarded, unprotected, and unrestrained, leads to great harm, as does this mind. The mind, O monks, being untamed, unguarded, unprotected, and unrestrained, leads to great harm.",
      "sinhala": "භික්‍ෂූණි, මේ සිත මෙන් මෙසේ නොදැමුණු, නොරැකුණු, ආරක්‍ෂා නොකළ, අසංවර වූ කල්හි මහත් වූ අනර්ථයට පවතින වෙනත් එක ධර්‍මයක්වත් මම නොදක්මි. භික්‍ෂූණි, නොදැමුණු, නොරැකුණු, ආරක්‍ෂා නොකළ, අසංවර වූ සිත මහත් වූ අනර්ථයට පවතී.",
      "paliTitle": ""
    },
    {
      "number": 40,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yaṃ evaṃ dantaṃ guttaṃ rakkhitaṃ saṃvutaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, cittaṃ. Cittaṃ, bhikkhave, dantaṃ guttaṃ rakkhitaṃ saṃvutaṃ mahato atthāya saṃvattatī’’ti. Dasamaṃ. ",
      "english": "Monks, I do not perceive even one other single phenomenon which, being thus tamed, guarded, protected, and restrained, conduces to great benefit, as does this mind, Monks. The mind, Monks, being tamed, guarded, protected, and restrained, conduces to great benefit.",
      "sinhala": "මහණෙනි, මෙලෙස දමනය කරන ලද, ආරක්‍ෂා කරන ලද, රැකවරණය කරන ලද, සංවර කරන ලද, මහත් වූ අර්ථය පිණිස පවතින්නාවූ මේ සිත තරම් අන් එකදු ධර්මයක්වත් මම නොදකිමි. සිත, මහණෙනි, දමනය කරන ලද, ආරක්‍ෂා කරන ලද, රැකවරණය කරන ලද, සංවර කරන ලද කල්හි මහත් වූ අර්ථය පිණිස පවතින්නේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Adantavaggo catuttho.",
    "english": "",
    "sinhala": ""
  }
}