{
  "id": "an1.1",
  "title": {
    "pali": "Rūpādivaggo",
    "english": "The Chapter on Form and so forth",
    "sinhala": "රූපාදි වග්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Nāhaṃ, bhikkhave, aññaṃ ekarūpampi samanupassāmi yaṃ evaṃ purisassa cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, itthirūpaṃ. Itthirūpaṃ, bhikkhave, purisassa cittaṃ pariyādāya tiṭṭhatī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion, the Blessed One was staying in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's park.\n\nThere, the Blessed One addressed the monks, saying, \"Monks!\"\n\"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One spoke this:\n\n\"Monks, I do not perceive any other single form that so thoroughly captivates and takes possession of a man’s mind as this, monks, the form of a woman. The form of a woman, monks, so thoroughly captivates and takes possession of a man's mind.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර, අනාථපිණ්ඩික සිටුතුමාගේ ජේතවනාරාමයේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" කියා වදාළ සේක. \"පින්වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක –\n\n\"මහණෙනි, පුරුෂයාගේ සිත මේ අයුරින් සම්පූර්ණයෙන් වසඟයට ගෙන සිටින්නා වූ මේ ස්ත්‍රී රූපය හැර වෙනත් එක රූපයක්වත් මම නොදකිමි. මහණෙනි, ස්ත්‍රී රූපය පුරුෂයාගේ සිත සම්පූර්ණයෙන් වසඟයට ගෙන සිටී.\"",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekasaddampi samanupassāmi yaṃ evaṃ purisassa cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, itthisaddo. Itthisaddo, bhikkhave, purisassa cittaṃ pariyādāya tiṭṭhatī’’ti. Dutiyaṃ.",
      "english": "Monks, I do not perceive any other single sound that so overpowers and takes possession of a man’s mind as does the sound of a woman, Monks. The sound of a woman, Monks, overpowers and takes possession of a man’s mind.",
      "sinhala": "මහණෙනි, පුරුෂයෙකුගේ සිත මෙලෙස මුළුමනින්ම ග්‍රහණය කරගෙන පවතින වෙනත් කිසිදු ශබ්දයක් මේ ස්ත්‍රී ශබ්දය මෙන් මා නොදකිමි. මහණෙනි, ස්ත්‍රී ශබ්දය පුරුෂයෙකුගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතී.",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekagandhampi samanupassāmi yaṃ evaṃ purisassa cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, itthigandho. Itthigandho, bhikkhave, purisassa cittaṃ pariyādāya tiṭṭhatī’’ti. Tatiyaṃ.",
      "english": "Monks, I do not find any other single fragrance that so completely takes possession of a man’s mind and heart as does, monks, the fragrance of a woman. The fragrance of a woman, monks, truly takes complete possession of a man’s mind and heart.",
      "sinhala": "භික්ෂූණි, ස්ත්‍රී ආකර්ෂණය මෙන් මෙලෙස පුරුෂයාගේ සිත මුළුමනින්ම වසඟයට ගෙන එහි රඳා පවතින වෙනත් කිසිදු ආකර්ෂණයක් මම නොදකිමි. භික්ෂූණි, ස්ත්‍රී ආකර්ෂණය පුරුෂයාගේ සිත මුළුමනින්ම වසඟයට ගෙන රඳා පවතී.",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekarasampi samanupassāmi yaṃ evaṃ purisassa cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, itthiraso. Itthiraso, bhikkhave, purisassa cittaṃ pariyādāya tiṭṭhatī’’ti. Catutthaṃ.",
      "english": "Monks, I do not perceive any other single allure that so completely takes possession of a man's mind as does the allure of women. Monks, the allure of women completely takes possession of a man's mind.",
      "sinhala": "භික්ෂූනි, යම් රසයක් මෙසේ පුරුෂයාගේ සිත මුළුමනින්ම වසඟයට ගන්නේ ද, මේ ස්‍ත‍්‍රී රසය හැර, මම එවැනි වෙනත් එක රසයක්වත් නොදකිමි. භික්ෂූනි, ස්‍ත‍්‍රී රසය පුරුෂයාගේ සිත මුළුමනින්ම වසඟයට ගනී.",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekaphoṭṭhabbampi samanupassāmi yaṃ evaṃ purisassa cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, itthiphoṭṭhabbo. Itthiphoṭṭhabbo, bhikkhave, purisassa cittaṃ pariyādāya tiṭṭhatī’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, I do not discern any other single tactile sensation which thus so completely overwhelms a man’s mind as does the tactile sensation of a woman. The tactile sensation of a woman, Bhikkhus, completely overwhelms a man’s mind.",
      "sinhala": "භික්ෂූනි, ස්ත්‍රී ස්පර්ශය මෙන් මෙසේ පුරුෂයාගේ සිත මුළුමනින්ම අල්වාගෙන සිටින වෙනත් කිසිම ස්පර්ශයක් මම නොදකිමි. භික්ෂූනි, ස්ත්‍රී ස්පර්ශය පුරුෂයාගේ සිත සම්පූර්ණයෙන් යටපත් කරගෙන සිටී.",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekarūpampi samanupassāmi yaṃ evaṃ itthiyā cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, purisarūpaṃ. Purisarūpaṃ, bhikkhave, itthiyā cittaṃ pariyādāya tiṭṭhatī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, I do not perceive any other single form that so completely takes possession of a woman’s mind as does this form of a man. The form of a man, Monks, indeed takes complete possession of a woman’s mind.",
      "sinhala": "මහණෙනි, පුරුෂ රූපය මෙන් ස්ත්‍රියකගේ සිත මෙසේ මුළුමනින්ම වසඟයට ගන්නා වෙනත් කිසිදු රූපයක් මම නොදකිමි. මහණෙනි, පුරුෂ රූපය ස්ත්‍රියකගේ සිත මුළුමනින්ම වසඟයට ගනී.",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekasaddampi samanupassāmi yaṃ evaṃ itthiyā cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, purisasaddo. Purisasaddo, bhikkhave, itthiyā cittaṃ pariyādāya tiṭṭhatī’’ti. Sattamaṃ.",
      "english": "Monks, I do not discern any other single sound that so completely engrosses a woman's mind as this, monks, the sound of a man. The sound of a man, monks, completely engrosses a woman's mind.",
      "sinhala": "භික්ෂූනි, යම්සේ මේ පුරුෂ ශබ්දය ස්ත්‍රියකගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතින්නේද, එසේ ස්ත්‍රියකගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතින අන් කිසිදු හඬක්වත් මම නොදකින්නෙමි. භික්ෂූනි, පුරුෂ ශබ්දය ස්ත්‍රියකගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතී.",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekagandhampi samanupassāmi yaṃ evaṃ itthiyā cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, purisagandho. Purisagandho, bhikkhave, itthiyā cittaṃ pariyādāya tiṭṭhatī’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, I do not perceive any other single scent that so completely takes possession of a woman’s mind as does this, monks, the scent of a man. The scent of a man, monks, completely takes possession of a woman’s mind.”",
      "sinhala": "මහණෙනි, යම්සේ මේ පුරුෂගන්ධය ස්ත්‍රියකගේ සිත මුළුමනින්ම වසඟයට ගෙන පවතීද, එලෙස ස්ත්‍රියකගේ සිත මුළුමනින්ම වසඟයට ගෙන පවතින වෙනත් එකම ගන්ධයක් වත් මම නොදකිමි. මහණෙනි, පුරුෂගන්ධය ස්ත්‍රියකගේ සිත මුළුමනින්ම වසඟයට ගෙන පවතී.",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekarasampi samanupassāmi yaṃ evaṃ itthiyā cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, purisaraso. Purisaraso, bhikkhave, itthiyā cittaṃ pariyādāya tiṭṭhatī’’ti. Navamaṃ.",
      "english": "Monks, I do not perceive any other single allure that so completely dominates a woman’s mind as this, monks, the allure of a man. The allure of a man, monks, completely dominates a woman’s mind.",
      "sinhala": "භික්ෂූනි, පුරුෂ රසය මෙන්, ස්ත්‍රි‍යකගේ සිත මෙසේ මුළුමනින්ම වසඟ කරගෙන පවතින අන් කිසිඳු එක රසයක් මම නොදකිමි. භික්ෂූනි, පුරුෂ රසය ස්ත්‍රි‍යකගේ සිත මුළුමනින්ම වසඟ කරගෙන පවතී.",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekaphoṭṭhabbampi samanupassāmi yaṃ evaṃ itthiyā cittaṃ pariyādāya tiṭṭhati yathayidaṃ, bhikkhave, purisaphoṭṭhabbo. Purisaphoṭṭhabbo, bhikkhave, itthiyā cittaṃ pariyādāya tiṭṭhatī’’ti. Dasamaṃ. ",
      "english": "Monks, I do not perceive any other tactile sensation that so utterly takes possession of a woman’s mind as does the tactile sensation of a man. The tactile sensation of a man, monks, utterly takes possession of a woman’s mind.",
      "sinhala": "මහණෙනි, පුරුෂයාගේ ස්පර්ශය මෙන්, ස්ත්‍රියකගේ සිත සම්පූර්ණයෙන් අත්පත් කරගෙන සිටින, වෙනත් එකදු ස්පර්ශයක්වත් මම නොදකිමි. මහණෙනි, පුරුෂයාගේ ස්පර්ශය ස්ත්‍රියකගේ සිත සම්පූර්ණයෙන් අත්පත් කරගෙන සිටී.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rūpādivaggo paṭhamo.",
    "english": "",
    "sinhala": ""
  }
}