{
  "id": "an1.10",
  "title": {
    "pali": "Dutiyapamādādivaggo",
    "english": "The Second Chapter on Heedlessness, and So Forth",
    "sinhala": "දෙවැනි ප්‍රමාදාදි වග්ගය"
  },
  "sections": [
    {
      "number": 98,
      "pali": "‘‘Ajjhattikaṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, pamādo. Pamādo, bhikkhave, mahato anatthāya saṃvattatī’’ti. Paṭhamaṃ.",
      "english": "Monks, having considered an internal condition, I do not discern any other single condition that leads to such great detriment as does this, monks, heedlessness. Monks, heedlessness leads to great detriment.",
      "sinhala": "මහණෙනි, අභ්‍යන්තර අංගයක් සලකා බැලූ කල, යම් සේ මේ ප්‍ර්‍රමාදය මහා අනර්ථය පිණිස පවතීද, එබඳු අන් කිසිදු අංගයක් මම නොදකිමි. මහණෙනි, ප්‍ර්‍රමාදය මහා අනර්ථය පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 99,
      "pali": "‘‘Ajjhattikaṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, appamādo. Appamādo, bhikkhave, mahato atthāya saṃvattatī’’ti. Dutiyaṃ.",
      "english": "Monks, having considered an internal factor, I do not perceive any other single factor that leads to such great benefit as this heedfulness. Monks, heedfulness leads to great benefit.",
      "sinhala": "මහණෙනි, අභ\\u200D්‍යන්තර අංගයක් ලෙස සලකා බැලූ විට, මහණෙනි, මේ අප\\u200D්‍රමාදය මෙන් මෙබඳු මහත් අර්ථයක් සඳහා පවතින අන් කිසිදු අංගයක් මම නොදකිමි. මහණෙනි, අප\\u200D්‍රමාදය මහත් අර්ථයක් සඳහා පවතී.",
      "paliTitle": ""
    },
    {
      "number": 100,
      "pali": "‘‘Ajjhattikaṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, kosajjaṃ. Kosajjaṃ, bhikkhave, mahato anatthāya saṃvattatī’’ti. Tatiyaṃ.",
      "english": "Monks, when I consider an internal factor, I do not discern any other single factor that leads to such great harm as does this: sloth, monks. Sloth, monks, leads to great harm.",
      "sinhala": "භික්ෂූනි, අභ්‍යන්තර අංගයක් ලෙස සැලකූ විට, මේ කුසීතභාවය මෙන් මෙසේ මහත් අනර්ථයක් පිණිස පවතින්නාවූ වෙනත් එකදු අංගයක්වත් මම නොදකිමි. භික්ෂූනි, කුසීතභාවය මහත් අනර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 101,
      "pali": "‘‘Ajjhattikaṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, vīriyārambho. Vīriyārambho, bhikkhave, mahato atthāya saṃvattatī’’ti. Catutthaṃ.",
      "english": "Monks, having considered an internal factor, I do not perceive any other single factor that leads to such great benefit as this, monks: energetic endeavor. Energetic endeavor, monks, leads to great benefit.",
      "sinhala": "භික්ෂූනි, අභ්‍යන්තර අංගයක් වශයෙන් සැලකුවහොත්, මේ වීර්‍යාරම්භය මෙන් මෙපමණ මහත් වූ අර්ථයක් පිණිස පවතින වෙනත් කිසිම අංගයක් මා දකින්නේ නැහැ.\n\nභික්ෂූනි, වීර්‍යාරම්භය මහත් වූ අර්ථයක් පිණිස පවතිනවා.",
      "paliTitle": ""
    },
    {
      "number": 102,
      "numberRange": "102-109",
      "pali": "‘‘Ajjhattikaṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, mahicchatā…pe… appicchatā… asantuṭṭhitā… santuṭṭhitā… ayonisomanasikāro… yonisomanasikāro… asampajaññaṃ… sampajaññaṃ… dvādasamaṃ.",
      "english": "Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great harm as this, monks, namely: great desire. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great benefit as this, monks, namely: little desire. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great harm as this, monks, namely: discontentment. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great benefit as this, monks, namely: contentment. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great harm as this, monks, namely: unwise attention. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great benefit as this, monks, namely: wise attention. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great harm as this, monks, namely: lack of clear comprehension. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great benefit as this, monks, namely: clear comprehension. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great harm as this, monks, namely: faithlessness. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great benefit as this, monks, namely: faith. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great harm as this, monks, namely: laziness. Among internal factors, monks, having considered any such factor, I do not perceive any other single factor that leads to such great benefit as this, monks, namely: energy.",
      "sinhala": "මහණෙනි, අභ්‍යන්තරික අංගයක් සලකා බැලූවිට, යම් මේ මහිච්ඡතාවය මෙන් මෙසේ මහත් අර්ථහානියක් පිණිස පවතින්නාවූ වෙනත් එකදු අංගයක්වත් මම නොදකිමි; මේ අංගයන් නම්, අල්පේච්ඡතාවය, අසන්තුෂ්ටිය, සන්තුෂ්ටිය, අයෝනිසෝමනසිකාරය, යෝනිසෝමනසිකාරය, අසම්පජඤ්ඤය, සම්පජඤ්ඤය ආදී වූ දොළොස්වැනි අංගය දක්වා වූ කරුණු ය.",
      "paliTitle": ""
    },
    {
      "number": 110,
      "pali": "‘‘Bāhiraṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, pāpamittatā. Pāpamittatā, bhikkhave, mahato anatthāya saṃvattatī’’ti. Terasamaṃ.",
      "english": "Monks, considering an external factor, I do not find any other single factor that leads to such great harm as does bad companionship. Bad companionship, monks, leads to great harm.",
      "sinhala": "මහණෙනි, බාහිර වූ යම් අංගයක් සලකා බැලූ කල, මේ පාපමිත්‍රභාවය තරම් මහත් වූ අන්‍රථය පිණිස පවතින වෙනත් කිසිදු අංගයක් මම නොදකිමි. මහණෙනි, පාපමිත්‍රභාවය මහත් වූ අන්‍රථය පිණිසම පවතී.",
      "paliTitle": ""
    },
    {
      "number": 111,
      "pali": "‘‘Bāhiraṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, kalyāṇamittatā. Kalyāṇamittatā, bhikkhave, mahato atthāya saṃvattatī’’ti. Cuddasamaṃ.",
      "english": "Monks, taking into account external factors, I do not discern any other single factor that conduces to such great benefit as this, monks, namely noble friendship. Noble friendship, monks, conduces to great benefit.",
      "sinhala": "භික්ෂූණි, බාහිර අංගයක් වශයෙන් සැලකූ විට, මේ කල්‍යාණමිත්‍රතාව මෙන් මෙතරම් මහත් අර්ථයක් පිණිස පවතින්නා වූ වෙනත් කිසිදු අංගයක් මා නොදකිමි.\n\nභික්ෂූණි, කල්‍යාණමිත්‍රතාව මහත් අර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 112,
      "pali": "‘‘Ajjhattikaṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, anuyogo akusalānaṃ dhammānaṃ, ananuyogo kusalānaṃ dhammānaṃ. Anuyogo, bhikkhave, akusalānaṃ dhammānaṃ, ananuyogo kusalānaṃ dhammānaṃ mahato anatthāya saṃvattatī’’ti. Pannarasamaṃ.",
      "english": "Monks, having considered an internal factor, I do not discern any other single factor that leads to such great detriment as this, Monks: the pursuit of unwholesome states and the neglect of wholesome states. Monks, the pursuit of unwholesome states and the neglect of wholesome states lead to great detriment.",
      "sinhala": "භික්ෂූණි, අභ‍්‍යන්තර අංගයක් සලකන විට, අකුසල් දහම්හි නිරන්තරයෙන් යෙදීමත්, කුසල් දහම්හි නොයෙදීමත් යම්සේ මහත් අනර්ථයක් පිණිස පවතින්නේද, එබඳු මහත් අනර්ථයක් පිණිස පවතින වෙනත් එකදු අංගයක්වත් මම නොදකිමි. භික්ෂූණි, අකුසල් දහම්හි නිරන්තරයෙන් යෙදීමත්, කුසල් දහම්හි නොයෙදීමත් මහත් අනර්ථයක් පිණිස පවතින්නේය.",
      "paliTitle": ""
    },
    {
      "number": 113,
      "pali": "‘‘Ajjhattikaṃ, bhikkhave, aṅganti karitvā nāññaṃ ekaṅgampi samanupassāmi yaṃ evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, anuyogo kusalānaṃ dhammānaṃ, ananuyogo akusalānaṃ dhammānaṃ. Anuyogo, bhikkhave, kusalānaṃ dhammānaṃ, ananuyogo akusalānaṃ dhammānaṃ mahato atthāya saṃvattatī’’ti. Soḷasamaṃ.",
      "english": "Mendicants, when considering an internal factor, I do not perceive any other single factor that conduces to such great benefit as this: the diligent cultivation of wholesome qualities and the diligent abandonment of unwholesome qualities. Indeed, mendicants, the diligent cultivation of wholesome qualities and the diligent abandonment of unwholesome qualities truly conduces to great benefit.",
      "sinhala": "මහණෙනි, අභ්‍යන්තර අංගයක් ලෙස සලකා, කුසල ධර්මයන් කෙරෙහි නොපිරිහෙළා යෙදීමත්, අකුසල ධර්මයන්ගෙන් වැළකීමත් යම්සේ මහත් අනුසස් පිණිස හේතු වේද, එසේ මහත් අනුසස් පිණිස හේතු වන අන් කිසිම තනි අංගයක් මා නොදකිමි.\n\nමහණෙනි, කුසල ධර්මයන් කෙරෙහි නොපිරිහෙළා යෙදීමත්, අකුසල ධර්මයන්ගෙන් වැළකීමත් මහත් අනුසස් පිණිස හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 114,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ saddhammassa sammosāya antaradhānāya saṃvattati yathayidaṃ, bhikkhave, pamādo. Pamādo, bhikkhave, saddhammassa sammosāya antaradhānāya saṃvattatī’’ti. Sattarasamaṃ.",
      "english": "Monks, I do not discern even one other quality that so conduces to the obscuration and disappearance of the True Dhamma as does this, monks, heedlessness. Heedlessness, monks, conduces to the obscuration and disappearance of the True Dhamma.",
      "sinhala": "මහණෙනි, මේ ප්‍රමාදය මෙන් සද්ධර්මයේ අභාවයටත්, අතුරුදහන්වීමටත් හේතු වන්නා වූ වෙනත් කිසිදු එකම ධර්මයක් හෝ මම නොදකිමි. මහණෙනි, ප්‍රමාදය සද්ධර්මයේ අභාවයටත්, අතුරුදහන්වීමටත් හේතු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 115,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati yathayidaṃ, bhikkhave, appamādo. Appamādo, bhikkhave, saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattatī’’ti. Aṭṭhārasamaṃ.",
      "english": "Monks, I do not discern any other single quality that thus conduces to the persistence, the non-perversion, and the non-disappearance of the True Dhamma, as does this, Monks, heedfulness. Heedfulness, Monks, conduces to the persistence, the non-perversion, and the non-disappearance of the True Dhamma.",
      "sinhala": "මහණෙනි, සද්ධර්මයේ පැවැත්මට, නොමුළාවීමට සහ අතුරුදහන් නොවීම පිණිස මෙලෙසින් උපකාර වන, මේ අප්‍ර‍මාදය හැර වෙනත් එකදු ධර්මයක් හෝ මම නොදකිමි. මහණෙනි, අප්‍ර‍මාදය සද්ධර්මයේ පැවැත්මට, නොමුළාවීමට සහ අතුරුදහන් නොවීම පිණිස හේතු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 116,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ saddhammassa sammosāya antaradhānāya saṃvattati yathayidaṃ, bhikkhave, kosajjaṃ. Kosajjaṃ, bhikkhave, saddhammassa sammosāya antaradhānāya saṃvattatī’’ti. Ekūnavīsatimaṃ.",
      "english": "Monks, I do not discern any other single quality that so conduces to the confusion and disappearance of the true Dhamma as does this, monks: laziness. Laziness, monks, conduces to the confusion and disappearance of the true Dhamma.",
      "sinhala": "මහණෙනි, සද්ධර්මය නොපැහැදිලි වීමටත්, අතුරුදහන් වීමටත් මෙසේ හේතු වන, මේ අලසකම මෙන් වන වෙනත් කිසිදු ධර්මයක් මම නොදකිමි. මහණෙනි, අලසකම සද්ධර්මය නොපැහැදිලි වීමටත්, අතුරුදහන් වීමටත් හේතු වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 117,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati yathayidaṃ, bhikkhave, vīriyārambho. Vīriyārambho, bhikkhave, saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattatī’’ti. Vīsatimaṃ.",
      "english": "Monks, I do not perceive any other single factor that thus conduces to the endurance of the True Dhamma, to its non-obscuration, and to its non-disappearance, just as this energetic endeavor does. Energetic endeavor, monks, conduces to the endurance of the True Dhamma, to its non-obscuration, and to its non-disappearance.",
      "sinhala": "භික්ෂූණි, සද්ධර්මයේ ස්ථිර පැවැත්මට, නොනැසී පැවතීමට, අතුරුදහන් නොවීම පිණිස යම් සේ මේ වීර්යය ආරම්භ කිරීම හේතු වේද, එසේ හේතු වන අන් එකදු ධර්මයක්වත් මා විසින් නොදකිමි. භික්ෂූණි, වීර්යය ආරම්භ කිරීම සද්ධර්මයේ ස්ථිර පැවැත්මට, නොනැසී පැවතීමට, අතුරුදහන් නොවීම පිණිස හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 118,
      "numberRange": "118-128",
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ saddhammassa sammosāya antaradhānāya saṃvattati yathayidaṃ, bhikkhave, mahicchatā…pe… appicchatā… asantuṭṭhitā… santuṭṭhitā… ayonisomanasikāro… yonisomanasikāro… asampajaññaṃ… sampajaññaṃ … pāpamittatā… kalyāṇamittatā… anuyogo akusalānaṃ dhammānaṃ, ananuyogo kusalānaṃ dhammānaṃ. Anuyogo, bhikkhave, akusalānaṃ dhammānaṃ, ananuyogo kusalānaṃ dhammānaṃ saddhammassa sammosāya antaradhānāya saṃvattatī’’ti. Ekattiṃsatimaṃ.",
      "english": "Monks, I do not perceive any other single quality that thus leads to the confusion and disappearance of the true Dhamma as do these, monks: great desire, little desire, discontentment, contentment, unwise attention, wise attention, lack of clear comprehension, clear comprehension, bad companionship, good companionship, the pursuit of unwholesome qualities, and the non-pursuit of wholesome qualities. Monks, the pursuit of unwholesome qualities and the non-pursuit of wholesome qualities lead to the confusion and disappearance of the true Dhamma.",
      "sinhala": "භික්‍ෂූනි, මේ සද්ධර්මය මුළා වීම පිණිසත්, අතුරුදහන් වීම පිණිසත් හේතු වන අන් කිසිදු එකම ධර්මයක්, මේ මහේච්ඡතාව මෙන් මම නොදකිමි. භික්‍ෂූනි, අල්පේච්ඡතාව, අසන්තුෂ්ටිය, සන්තුෂ්ටිය, අයෝනිසෝමනසිකාරය, යෝනිසෝමනසිකාරය, අසම්පජඤ්ඤය, සම්පජඤ්ඤය, පාපමිත්‍රතාව, කල්‍යාණමිත්‍රතාව, අකුසල ධර්මයන්හි යෙදීම, කුසල ධර්මයන්හි නොයෙදීම යනාදී ධර්මයෝද වෙති. භික්‍ෂූනි, අකුසල ධර්මයන්හි යෙදීම සහ කුසල ධර්මයන්හි නොයෙදීම සද්ධර්මය මුළා වීම පිණිසත්, අතුරුදහන් වීම පිණිසත් හේතු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 129,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati yathayidaṃ, bhikkhave, anuyogo kusalānaṃ dhammānaṃ, ananuyogo akusalānaṃ dhammānaṃ. Anuyogo, bhikkhave, kusalānaṃ dhammānaṃ, ananuyogo akusalānaṃ dhammānaṃ saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattatī’’ti. Catukkoṭikaṃ niṭṭhitaṃ. Bāttiṃsatimaṃ.",
      "english": "Monks, I do not perceive even a single other quality that conduces in such a way to the stability, non-corruption, and non-disappearance of the True Dhamma, as does, Monks, the diligent cultivation of wholesome qualities and the non-cultivation of unwholesome qualities. Monks, the diligent cultivation of wholesome qualities and the non-cultivation of unwholesome qualities conduces to the stability, non-corruption, and non-disappearance of the True Dhamma.",
      "sinhala": "මහණෙනි, සද්ධ‍ර්මයේ ස්‍ථිතිභාවයට, නොමුලාවීමට, අතුරුදන් නොවීම පිණිස මෙලෙස හේතු වන, කුසල ධර්‍මයන්හි නිරන්තරයෙන් යෙදීමත්, අකුසල ධර්‍මයන්ගෙන් දුරස්වීමත් හැර, වෙනත් කිසිදු ධර්‍මයක් මම නොදකිමි.\n\nමහණෙනි, කුසල ධර්‍මයන්හි නිරන්තරයෙන් යෙදීමත්, අකුසල ධර්‍මයන්ගෙන් දුරස්වීමත් සද්ධ‍ර්මයේ ස්‍ථිතිභාවයට, නොමුලාවීමට, අතුරුදන් නොවීම පිණිස හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 130,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū adhammaṃ dhammoti dīpenti te, bhikkhave, bhikkhū bahujanaahitāya paṭipannā bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū apuññaṃ pasavanti, te cimaṃ [tepimaṃ (sī.)] saddhammaṃ antaradhāpentī’’ti. Tettiṃsatimaṃ.",
      "english": "Monks, those bhikkhus who declare what is not Dhamma to be Dhamma are practicing for the harm of many people, for the unhappiness of many people, for the detriment, harm, and suffering of many people, devas, and humans. Furthermore, those bhikkhus generate much demerit, and they cause this true Dhamma to disappear.",
      "sinhala": "මහණෙනි, යම් ඒ භික්ෂූහු අධර්මය ධර්මය යැයි පෙන්වා දෙත්ද, මහණෙනි, ඒ භික්ෂූහු බොහෝ දෙනාගේ අහිත පිණිස, බොහෝ දෙනාගේ අසතුට පිණිස, බොහෝ සත්‍වයන්ගේ, දෙවිවරුන්ගේ හා මනුෂ්‍යයන්ගේ අනර්ථය පිණිස, අහිත පිණිස, දුක පිණිස පිළිපදින්නාහ.\n\nමහණෙනි, ඒ භික්ෂූහු බොහෝ අකුසල් රැස් කරගනිති. ඔවුහු මේ සද්ධර්මය අතුරුදහන් කරවන්නාහ.",
      "paliTitle": ""
    },
    {
      "number": 131,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū dhammaṃ adhammoti dīpenti te, bhikkhave, bhikkhū bahujanaahitāya paṭipannā bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū apuññaṃ pasavanti, te cimaṃ saddhammaṃ antaradhāpentī’’ti. Catuttiṃsatimaṃ.",
      "english": "Monks, those bhikkhus who declare the Dhamma to be non-Dhamma—those bhikkhus are practicing for the harm of many people, for the misery of many people, for the loss, for the harm, for the suffering of many people, of gods and humans. And those bhikkhus, monks, generate much demerit, and they cause this true Dhamma to disappear.",
      "sinhala": "‘‘භික්ෂූණි, යම් ඒ භික්ෂූන් වහන්සේලා ධර්මය අධර්මය යැයි පෙන්වා දෙද්ද, භික්ෂූණි, ඒ භික්ෂූන් වහන්සේලා බොහෝ දෙනාට අහිත පිණිස, බොහෝ දෙනාට අසැප පිණිස, බොහෝ දෙවිමිනිසුන්ගේ අනර්ථය පිණිස, අහිත පිණිස, දුක පිණිස පිළිපදින්නාහ. භික්ෂූණි, ඒ භික්ෂූන් වහන්සේලා බොහෝ අකුසල් රැස් කරගනිති. ඔවුහු මේ සද්ධර්මය අතුරුදහන් කරවන්නාහ.’’",
      "paliTitle": ""
    },
    {
      "number": 132,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū avinayaṃ vinayoti dīpenti…pe… vinayaṃ avinayoti dīpenti…pe… abhāsitaṃ alapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti…pe… bhāsitaṃ lapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti…pe… anāciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti…pe… āciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti…pe… apaññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti…pe… paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti te, bhikkhave, bhikkhū bahujanaahitāya paṭipannā bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū apuññaṃ pasavanti, te cimaṃ saddhammaṃ antaradhāpentī’’ti. Dvācattālīsatimaṃ. ",
      "english": "Bhikkhus, those monks who declare non-discipline to be discipline; who declare discipline to be non-discipline; who declare what was not spoken or uttered by the Tathāgata to be spoken and uttered by the Tathāgata; who declare what was spoken and uttered by the Tathāgata to be not spoken or uttered by the Tathāgata; who declare what was not practiced by the Tathāgata to be practiced by the Tathāgata; who declare what was practiced by the Tathāgata to be not practiced by the Tathāgata; who declare what was not laid down by the Tathāgata to be laid down by the Tathāgata; who declare what was laid down by the Tathāgata to be not laid down by the Tathāgata — these monks, bhikkhus, are practicing for the harm of many people, for the unhappiness of many people, for the detriment, harm, and suffering of many people, gods, and humans. Furthermore, bhikkhus, those monks generate much demerit, and they cause this true Dhamma to disappear.",
      "sinhala": "මහණෙනි, යම් ඒ භික්‍ෂූහු අවිනය, විනය යැයි දේශනා කරත්ද, විනය, අවිනය යැයි දේශනා කරත්ද, තථාගතයන් වහන්සේ විසින් නොකියන ලද, නොවදාරණ ලද දෙයක්, තථාගතයන් වහන්සේ විසින් කියන ලද, වදාරණ ලද දෙයක් ලෙස දේශනා කරත්ද, තථාගතයන් වහන්සේ විසින් කියන ලද, වදාරණ ලද දෙයක්, තථාගතයන් වහන්සේ විසින් නොකියන ලද, නොවදාරණ ලද දෙයක් ලෙස දේශනා කරත්ද, තථාගතයන් වහන්සේ විසින් පුරුදු නොකරන ලද දෙයක්, තථාගතයන් වහන්සේ විසින් පුරුදු කරන ලද දෙයක් ලෙස දේශනා කරත්ද, තථාගතයන් වහන්සේ විසින් පුරුදු කරන ලද දෙයක්, තථාගතයන් වහන්සේ විසින් පුරුදු නොකරන ලද දෙයක් ලෙස දේශනා කරත්ද, තථාගතයන් වහන්සේ විසින් පනවන නොලද දෙයක්, තථාගතයන් වහන්සේ විසින් පනවන ලද දෙයක් ලෙස දේශනා කරත්ද, තථාගතයන් වහන්සේ විසින් පනවන ලද දෙයක්, තථාගතයන් වහන්සේ විසින් පනවන නොලද දෙයක් ලෙස දේශනා කරත්ද, මහණෙනි, ඒ භික්‍ෂූහු බොහෝ දෙනාගේ අහිත පිණිස, බොහෝ දෙනාගේ අසුඛය පිණිස, බොහෝ දෙවිමිනිසුන්ගේ අනර්ථය පිණිස, අහිත පිණිස, දුක පිණිස පිළිපන්නාහු වෙති. මහණෙනි, ඒ භික්‍ෂූහු බොහෝ අකුසල් රැස් කරති. තවද, ඒ භික්‍ෂූහු මේ සද්​ධ​ර්ම​ය අන්තර්ධාන කරවති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Dutiyapamādādivaggo dasamo.",
    "english": "",
    "sinhala": ""
  }
}