{
  "id": "an1.20",
  "title": {
    "pali": "Amatavaggo",
    "english": "The Chapter on the Deathless",
    "sinhala": "අමෘත වග්ගය"
  },
  "sections": [
    {
      "number": 20,
      "pali": "Amatavaggo",
      "english": "The Chapter on Nibbāna",
      "sinhala": "අමෘත වග්ගය",
      "paliTitle": ""
    },
    {
      "number": 600,
      "pali": "‘‘Amataṃ te, bhikkhave, na paribhuñjanti ye kāyagatāsatiṃ na paribhuñjanti. Amataṃ te, bhikkhave, paribhuñjanti ye kāyagatāsatiṃ paribhuñjantī’’ti.",
      "english": "Monks, those who do not cultivate mindfulness of the body do not partake of the Deathless. Monks, those who cultivate mindfulness of the body do partake of the Deathless.",
      "sinhala": "මහණෙනි, යම් අය කායගතාසතිය වඩන්නේ නැද්ද, ඔවුහු අමෘතය අත්විඳින්නේ නැත. මහණෙනි, යම් අය කායගතාසතිය වඩද්ද, ඔවුහු අමෘතය අත්විඳිති.",
      "paliTitle": ""
    },
    {
      "number": 601,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, aparibhuttaṃ yesaṃ kāyagatāsati aparibhuttā. Amataṃ tesaṃ, bhikkhave, paribhuttaṃ yesaṃ kāyagatāsati paribhuttā’’ti.",
      "english": "Monks, the Deathless remains unrealized by those for whom mindfulness immersed in the body remains unpracticed. Monks, the Deathless is realized by those for whom mindfulness immersed in the body is practiced.",
      "sinhala": "මහණෙනි, යම් භික්ෂූන්ගේ කායගතසතිය ප්‍ර\\u200dගුණ කර නැත්තේ ද, ඔවුන් විසින් අමා මහ නිවන අත්දකිනු නොලැබුනේය.\nමහණෙනි, යම් භික්ෂූන්ගේ කායගතසතිය ප්‍ර\\u200dගුණ කරන ලද්දේ ද, ඔවුන් විසින් අමා මහ නිවන අත්දකිනු ලැබුනේය.",
      "paliTitle": ""
    },
    {
      "number": 602,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, parihīnaṃ yesaṃ kāyagatāsati parihīnā. Amataṃ tesaṃ, bhikkhave, aparihīnaṃ yesaṃ kāyagatāsati aparihīnā’’ti.",
      "english": "Monks, the Deathless is lost to those for whom mindfulness of the body is lost. Monks, the Deathless is not lost to those for whom mindfulness of the body is not lost.",
      "sinhala": "භික්ෂූනි, යම් අයට කායගතාසතිය පිරිහී ඇත්ද, ඔවුන්ට අමා පිරිහී ඇත. භික්ෂූනි, යම් අයට කායගතාසතිය නොපිරිහී ඇත්ද, ඔවුන්ට අමා නොපිරිහී ඇත.",
      "paliTitle": ""
    },
    {
      "number": 603,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, viraddhaṃ yesaṃ kāyagatāsati viraddhā. Amataṃ tesaṃ, bhikkhave, āraddhaṃ [aviraddhaṃ (ka.)] yesaṃ kāyagatāsati āraddhā’’ti.",
      "english": "Monks, the Deathless is missed by those who neglect mindfulness of the body. Monks, the Deathless is attained by those who develop mindfulness of the body.",
      "sinhala": "මහණෙනි, යම් අයට කායගතාසතිය මගහැරී ඇත්නම්, ඔවුන්ට අමාතය අහිමි වන්නේය. මහණෙනි, යම් අයට කායගතාසතිය වඩා ඇත්නම්, ඔවුන්ට අමාතය හිමිවන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 604,
      "pali": "‘‘Amataṃ te, bhikkhave, pamādiṃsu ye kāyagatāsatiṃ pamādiṃsu. Amataṃ te, bhikkhave, na pamādiṃsu ye kāyagatāsatiṃ na pamādiṃsu’’.",
      "english": "Monks, those who neglected mindfulness of the body, neglected the Deathless. Monks, those who were not negligent of mindfulness of the body, were not negligent of the Deathless.",
      "sinhala": "මහණෙනි, යම් කෙනෙක් කායගතාසතියෙහි ප්‍ර‌මාද වූවාහුද, ඔවුහු අමා මහා නිවනෙහි ප්‍ර‌මාද වූහ. මහණෙනි, යම් කෙනෙක් කායගතාසතියෙහි ප්‍ර‌මාද නොවූවාහුද, ඔවුහු අමා මහා නිවනෙහි ප්‍ර‌මාද නොවූහ.",
      "paliTitle": ""
    },
    {
      "number": 605,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, pamuṭṭhaṃ yesaṃ kāyagatāsati pamuṭṭhā. Amataṃ tesaṃ, bhikkhave, appamuṭṭhaṃ yesaṃ kāyagatāsati appamuṭṭhā’’ti.",
      "english": "Monks, the Deathless is lost to those for whom mindfulness of the body is lost. The Deathless is not lost to those for whom mindfulness of the body is not lost.",
      "sinhala": "මහණෙනි, යම් භික්ෂූන්ගේ කය පිළිබඳ සිහිය අමතක වී ඇත්නම්, ඔවුන්ට අමෘතය අමතක වී ඇත. මහණෙනි, යම් භික්ෂූන්ගේ කය පිළිබඳ සිහිය අමතක වී නැත්නම්, ඔවුන්ට අමෘතය අමතක වී නැත.",
      "paliTitle": ""
    },
    {
      "number": 606,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, anāsevitaṃ yesaṃ kāyagatāsati anāsevitā. Amataṃ tesaṃ, bhikkhave, āsevitaṃ yesaṃ kāyagatāsati āsevitā’’ti.",
      "english": "Monks, for those for whom mindfulness of the body is uncultivated, the Deathless is uncultivated. Monks, for those for whom mindfulness of the body is cultivated, the Deathless is cultivated.",
      "sinhala": "මහණෙනි, යම් අයට කායගතාසතිය (කය පිළිබඳ සිහිය) වඩන ලද්දක් නොවේද, ඒ අයට අමා නිවන වඩන ලද්දක් නොවේ. මහණෙනි, යම් අයට කායගතාසතිය (කය පිළිබඳ සිහිය) වඩන ලද්දක් වේද, ඒ අයට අමා නිවන වඩන ලද්දක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 607,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, abhāvitaṃ yesaṃ kāyagatāsati abhāvitā. Amataṃ tesaṃ, bhikkhave, bhāvitaṃ yesaṃ kāyagatāsati bhāvitā’’ti.",
      "english": "Monks, for those who have not cultivated mindfulness of the body, the Deathless remains uncultivated. Monks, for those who have cultivated mindfulness of the body, the Deathless has been cultivated.",
      "sinhala": "මහණෙනි, යම් අයට කායගතාසතිය වැඩී නොමැතිද, ඔවුන්ට අමතය වැඩී නොමැත. මහණෙනි, යම් අයට කායගතාසතිය වැඩී ඇත්ද, ඔවුන්ට අමතය වැඩී ඇත.",
      "paliTitle": ""
    },
    {
      "number": 608,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, abahulīkataṃ yesaṃ kāyagatāsati abahulīkatā. Amataṃ tesaṃ, bhikkhave, bahulīkataṃ yesaṃ kāyagatāsati bahulīkatā’’ti.",
      "english": "Monks, for those who have not cultivated mindfulness immersed in the body, the Deathless remains uncultivated. Monks, for those who have cultivated mindfulness immersed in the body, the Deathless is cultivated.",
      "sinhala": "මහණෙනි, යම් අයට කායගතාසතිය බහුල වශයෙන් නොවැඩූවක් වීද, ඔවුනට අමා මහා නිවනද බහුල වශයෙන් නොවැඩූවක් වන්නේය. මහණෙනි, යම් අයට කායගතාසතිය බහුල වශයෙන් වැඩූවක් වීද, ඔවුනට අමා මහා නිවනද බහුල වශයෙන් වැඩූවක් වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 609,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, anabhiññātaṃ yesaṃ kāyagatāsati anabhiññātā. Amataṃ tesaṃ, bhikkhave, abhiññātaṃ yesaṃ kāyagatāsati abhiññātā’’ti.",
      "english": "Monks, the Deathless remains unrealized for those by whom mindfulness of the body has not been realized. The Deathless is realized for those by whom mindfulness of the body has been realized.",
      "sinhala": "භික්‍ෂූණි, යම් අයට කායගතාසතිය අවබෝධ වී නොමැතිද, ඔවුන්ට අමෘතය ද අවබෝධ වී නොමැත. භික්‍ෂූණි, යම් අයට කායගතාසතිය අවබෝධ වී ඇත්ද, ඔවුන්ට අමෘතය ද අවබෝධ වී ඇත.",
      "paliTitle": ""
    },
    {
      "number": 610,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, apariññātaṃ yesaṃ kāyagatāsati apariññātā. Amataṃ tesaṃ, bhikkhave, pariññātaṃ yesaṃ kāyagatāsati pariññātā’’ti.",
      "english": "For those, monks, for whom mindfulness of the body is not comprehended, the Deathless is not comprehended. For those, monks, for whom mindfulness of the body is comprehended, the Deathless is comprehended.",
      "sinhala": "මහණෙනි, යම් අයට කායගතාසති‍ය පිරිසිඳ නොදන්නා ලද්දක්ද, ඔවුන්ට අමෘතයද ප්‍රත්‍යක්ෂ නොකළ එකක් වේ. මහණෙනි, යම් අයට කායගතාසති‍ය පිරිසිඳ දන්නා ලද්දක්ද, ඔවුන්ට අමෘතයද ප්‍රත්‍යක්ෂ කළ එකක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 611,
      "pali": "‘‘Amataṃ tesaṃ, bhikkhave, asacchikataṃ yesaṃ kāyagatāsati asacchikatā. Amataṃ tesaṃ, bhikkhave, sacchikataṃ yesaṃ kāyagatāsati sacchikatā’’ti. (….) [(ekakanipātassa suttasahassaṃ samattaṃ.) (sī. syā. kaṃ. pī.)] (Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti.) [( ) etthantare pāṭho sī. syā. kaṃ. pī. potthakesu natthi] ",
      "english": "For those, monks, for whom mindfulness of the body has not been actualized, for them the Deathless has not been actualized. For those, monks, for whom mindfulness of the body has been actualized, for them the Deathless has been actualized.",
      "sinhala": "මහණෙනි, යම් අයට කායගතාසතිය සාක්ෂාත් කරනු නොලැබුවේද, ඒ අයට අමා නිවන සාක්ෂාත් කරනු නොලැබුවේය. මහණෙනි, යම් අයට කායගතාසතිය සාක්ෂාත් කරනු ලැබුවේද, ඒ අයට අමා නිවන සාක්ෂාත් කරනු ලැබුවේය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ඒ භික්ෂූහු සතුටු සිත් ඇත්තෝව භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කළහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Amatavaggo vīsatimo. ",
    "english": "The Twentieth Chapter on the Deathless",
    "sinhala": "විසිවැනි අමතවග්‍ගය"
  }
}