{
  "id": "an1.9",
  "title": {
    "pali": "Pamādādivaggo",
    "english": "The Chapter on Heedlessness",
    "sinhala": "ප්‍රමාදාදී වග්ගය"
  },
  "sections": [
    {
      "number": 81,
      "pali": "‘‘Appamattikā esā, bhikkhave, vuddhi yadidaṃ yasovuddhi. Etadaggaṃ, bhikkhave, vuddhīnaṃ yadidaṃ paññāvuddhi. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘paññāvuddhiyā vaddhissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "Monks, this growth in fame is of little significance. Among all forms of growth, Monks, growth in wisdom is supreme. Therefore, Monks, you should train yourselves in this way: 'We will grow in wisdom.' Indeed, Monks, this is how you should train yourselves.",
      "sinhala": "මහණෙනි, යශෝවෘද්ධිය නම් වූ මේ වෘද්ධිය අල්ප වූවකි. මහණෙනි, ප්‍රඥාවෘද්ධිය නම් වූ මෙය වෘද්ධීන් අතරින් අග්‍ර වූවකි. එබැවින් මහණෙනි, 'අපි ප්‍රඥාවෘද්ධියෙන් වර්ධනය වන්නෙමු' යනුවෙන් මෙසේ පුහුණු විය යුතුයි. මහණෙනි, ඔබ විසින් මෙසේම පුහුණු විය යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 82,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, pamādo. Pamādo, bhikkhave, mahato anatthāya saṃvattatī’’ti. Dutiyaṃ.",
      "english": "Monks, I do not discern any other single quality that leads to such great detriment as does this heedlessness, Monks. Heedlessness, Monks, leads to great detriment.",
      "sinhala": "භික්‍ෂූනි, මේ ප‍්‍ර​මාදය මෙන් මෙතරම් මහත් වූ අන‍ර‍්‍ථ​යක් පිණිස හේතු වන අන්‍ය​ වූ එකදු ධ‍ර‍්‍ම​යක්වත් මම නොදකිමි. ප‍්‍ර​මාදය, භික්‍ෂූනි, මහත් වූ අන‍ර‍්‍ථ​යක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 83,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, appamādo. Appamādo, bhikkhave, mahato atthāya saṃvattatī’’ti. Tatiyaṃ.",
      "english": "Monks, I do not perceive even one other quality that conduces to such great benefit as does heedfulness. Heedfulness, monks, conduces to great benefit.",
      "sinhala": "මහණෙනි, මේ අප්‍රමාදය මෙන් මෙබඳු මහත් වූ වැඩ පිණිස පවතින අන් එකම ධර්මයක්වත් මම නොදකිමි. මහණෙනි, අප්‍රමාදය මහත් වූ වැඩ පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 84,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, kosajjaṃ. Kosajjaṃ, bhikkhave, mahato anatthāya saṃvattatī’’ti. Catutthaṃ.",
      "english": "Monks, I do not perceive any other single quality that leads to such great detriment as does this, monks, idleness. Idleness, monks, leads to great detriment.",
      "sinhala": "මහණෙනි, මේ අලසකම මෙන් මෙසේ මහත් වූ අර්ථ විනාශයක් පිණිස පවතින වෙනත් එක ධර්මයක්වත් මම නොදකිමි. මහණෙනි, අලසකම මහත් වූ අර්ථ විනාශයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 85,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, vīriyārambho. Vīriyārambho, bhikkhave, mahato atthāya saṃvattatī’’ti. Pañcamaṃ.",
      "english": "Monks, I do not perceive any other single quality that conduces to such great benefit as does the undertaking of effort. The undertaking of effort, Monks, conduces to great benefit.",
      "sinhala": "මහණෙනි, මේ වීර්‍යාරම්භය මෙන් මෙසේ මහත් අර්ථයක් පිණිස පවතින වෙනත් එකම ධර්මයක්වත් මම නොදක්මි. මහණෙනි, වීර්‍යාරම්භය මහත් අර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 86,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, mahicchatā. Mahicchatā, bhikkhave, mahato anatthāya saṃvattatī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, I do not perceive any other single phenomenon that conduces to such great harm as does this, monks, excessive wanting. Excessive wanting, monks, conduces to great harm.",
      "sinhala": "භික්ෂූණි, මේ මහතීච්ඡතාව යම්සේද, එසේ මහත් අහිත පිණිස පවතින වෙනත් එකද ධ\\u0dbb\\u0dca\\u200dම\\u0dba\\u0d9a\\u0dca මම නොදක්මි. භික්ෂූණි, මහතීච්ඡතාව මහත් අහිත පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 87,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, appicchatā. Appicchatā, bhikkhave, mahato atthāya saṃvattatī’’ti. Sattamaṃ.",
      "english": "Monks, I do not discern even one other quality that leads to such great benefit as does this, monks, the state of having few desires. Having few desires, monks, leads to great benefit.",
      "sinhala": "භික්ෂූනි, යම් සේ මේ අල්පේච්ඡතාවය මහත් අර්ථය පිණිස හේතු වෙයි ද, එසේ මහත් අර්ථය පිණිස හේතු වන අන් එකම ධර්‍මයක් හෝ මම නොදකිමි. භික්ෂූනි, අල්පේච්ඡතාවය මහත් අර්ථය පිණිස හේතු වෙයි. සත්වන සූත්‍රයයි.",
      "paliTitle": ""
    },
    {
      "number": 88,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, asantuṭṭhitā. Asantuṭṭhitā, bhikkhave, mahato anatthāya saṃvattatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I do not perceive any other single quality that thus leads to such great harm as does this, monks, discontent. Discontent, monks, leads to great harm.",
      "sinhala": "මහණෙනි, මේ අසන්තෝෂය මෙන් එබඳු මහත් අනර්ථයකට හේතු වන වෙනත් එකදු ධර්මයක්වත් මම නොදකිමි. මහණෙනි, අසන්තෝෂය මහත් අනර්ථයකට හේතු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 89,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, santuṭṭhitā. Santuṭṭhitā, bhikkhave, mahato atthāya saṃvattatī’’ti. Navamaṃ.",
      "english": "Monks, I do not discern any other single quality that conduces to such great welfare as does this, monks: contentment. Contentment, monks, conduces to great welfare.",
      "sinhala": "මහණෙනි, මේ සන්තුට්ඨිතාව මෙන්, මේ ආකාරයෙන් මහත් අර්ථයක් පිණිස පවතින වෙනත් එකදු ධර්මයක්වත් මම දකින්නේ නැත. මහණෙනි, සන්තුට්ඨිතාව මහත් අර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 90,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, ayoniso manasikāro. Ayonisomanasikāro, bhikkhave, mahato anatthāya saṃvattatī’’ti. Dasamaṃ.",
      "english": "Monks, I do not perceive any other single quality that leads to such great harm as this, monks, unwise attention. Unwise attention, monks, leads to great harm.",
      "sinhala": "මහණෙනි, යම් සේ මේ නුවණින් තොරව මෙනෙහි කිරීම, මෙලෙස මහත් අනර්ථයක් පිණිස පවතීද, එබඳු වූ වෙනත් එකම ධර්‍මයක් හෝ මම නොදකිමි. මහණෙනි, නුවණින් තොරව මෙනෙහි කිරීම මහත් අනර්ථයක් පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 91,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, yoniso manasikāro. Yonisomanasikāro, bhikkhave, mahato atthāya saṃvattatī’’ti. Ekādasamaṃ.",
      "english": "Monks, I do not perceive even a single other quality that conduces to such great benefit as does wise and appropriate attention. Monks, wise and appropriate attention conduces to great benefit.",
      "sinhala": "‘‘මහණෙනි, නුවණින් යුතුව සකස් ලෙස මෙනෙහි කිරීම වැනි, මෙතරම් උතුම් විමුක්තියක් පිණිස හේතු වන අන් එකදු ධර්‍මයක් හෝ මම නොදකිමි. මහණෙනි, නුවණින් යුතුව සකස් ලෙස මෙනෙහි කිරීම, උතුම් විමුක්තිය පිණිස හේතු වේ.’’",
      "paliTitle": ""
    },
    {
      "number": 92,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, asampajaññaṃ. Asampajaññaṃ, bhikkhave, mahato anatthāya saṃvattatī’’ti. Dvādasamaṃ.",
      "english": "Monks, I do not discern any other single factor that conduces to such great detriment as does this, monks, lack of clear comprehension. Lack of clear comprehension, monks, conduces to great detriment.",
      "sinhala": "මහණෙනි, මේ අසම්පජඤ්ඤය මෙන් මෙතරම් මහත් අර්ථහානියක් පිණිස පවතින්නාවූ වෙනත් එක් ධර්‍මයක්වත් මම නොදකිමි. මහණෙනි, අසම්පජඤ්ඤය මහත් අර්ථහානියක් පිණිස පවතින්නේය.",
      "paliTitle": ""
    },
    {
      "number": 93,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, sampajaññaṃ. Sampajaññaṃ, bhikkhave, mahato atthāya saṃvattatī’’ti. Terasamaṃ.",
      "english": "Monks, I do not discern any single other quality that conduces to such great benefit as this clear comprehension. Clear comprehension, monks, conduces to great benefit.",
      "sinhala": "මහණෙනි, මේ සම්පජඤ්ඤය මෙන් මෙසේ මහත් වූ අර්ථය පිණිස පවතින වෙනත් එකදු ධර්‍මයක්වත් මම නොදකිමි. මහණෙනි, සම්පජඤ්ඤය මහත් වූ අර්ථය පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 94,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, pāpamittatā. Pāpamittatā, bhikkhave, mahato anatthāya saṃvattatī’’ti. Cuddasamaṃ.",
      "english": "Monks, I do not perceive any other single quality that conduces to such great harm as this, monks, bad companionship. Bad companionship, monks, conduces to great harm.",
      "sinhala": "භික්ෂූණි, මේ පාපමිත්‍රත්වය මෙන් මෙතරම් මහත් වූ අනර්‍ථයකට හේතුවන වෙනත් එකම ධර්‍මයක්වත් මම නොදකිමි. භික්ෂූණි, පාපමිත්‍රත්වය මහත් වූ අනර්‍ථයකට හේතු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 95,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, kalyāṇamittatā. Kalyāṇamittatā, bhikkhave, mahato atthāya saṃvattatī’’ti. Pannarasamaṃ.",
      "english": "Monks, I do not perceive even a single other quality that conduces to such great benefit as does noble friendship. Monks, noble friendship conduces to great benefit.",
      "sinhala": "භික්ෂූනි, මේ කල්‍යාණමිත්‍ර‌ත්වය මෙන් මෙතරම් මහත් අර්ථයක් පිණිස හේතු වන අන් එකදු ධර්‌මයක් හෝ මම නොදකිමි. කල්‍යාණමිත්‍ර‌ත්වය, භික්ෂූනි, මහත් අර්ථයක් පිණිස හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 96,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato anatthāya saṃvattati yathayidaṃ, bhikkhave, anuyogo akusalānaṃ dhammānaṃ, ananuyogo kusalānaṃ dhammānaṃ. Anuyogo, bhikkhave, akusalānaṃ dhammānaṃ, ananuyogo kusalānaṃ dhammānaṃ mahato anatthāya saṃvattatī’’ti. Soḷasamaṃ.",
      "english": "Monks, I do not discern even a single other thing that leads to such great detriment as this: the application to unwholesome states and the non-application to wholesome states. Monks, the application to unwholesome states and the non-application to wholesome states truly lead to great detriment.",
      "sinhala": "මහණෙනි, අකුසල ධර‍්මයන්හි නිරතවීමත්, කුසල ධර‍්මයන්හි නිරත නොවීමත් යම් සේ මහත් අහිත පිණිස පවතීද, එසේ (මහත් අහිත පිණිස පවතින) වෙනත් එකදු ධර‍්මයක්වත් මම නොදකිමි. මහණෙනි, අකුසල ධර‍්මයන්හි නිරතවීමත්, කුසල ධර‍්මයන්හි නිරත නොවීමත් මහත් අහිත පිණිසම පවතී.",
      "paliTitle": ""
    },
    {
      "number": 97,
      "pali": "‘‘Nāhaṃ, bhikkhave, aññaṃ ekadhammampi samanupassāmi yo evaṃ mahato atthāya saṃvattati yathayidaṃ, bhikkhave, anuyogo kusalānaṃ dhammānaṃ, ananuyogo akusalānaṃ dhammānaṃ. Anuyogo, bhikkhave, kusalānaṃ dhammānaṃ, ananuyogo akusalānaṃ dhammānaṃ mahato atthāya saṃvattatī’’ti. Sattarasamaṃ. ",
      "english": "Monks, I do not perceive even a single other principle that conduces to such great benefit as this: engagement in wholesome states and non-engagement in unwholesome states. Monks, engagement in wholesome states and non-engagement in unwholesome states conduces to great benefit.",
      "sinhala": "භික්ෂූනි, කුසල ධර්මයන්හි නිරත වීම හා අකුසල ධර්මයන්හි නිරත නොවීම තරම් මෙලෙස මහත් අර්ථයක් පිණිස පවතින වෙනත් එක ධර්මයක්වත් මම නොදක්නෙමි. භික්ෂූනි, කුසල ධර්මයන්හි නිරත වීමත්, අකුසල ධර්මයන්හි නිරත නොවීමත් මහත් අර්ථයක් පිණිස පවතින්නේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Pamādādivaggo navamo.",
    "english": "The Ninth Section Beginning with Heedlessness",
    "sinhala": "නවම පමාදාදි වග්ගය"
  }
}