{
  "id": "an1.13",
  "title": {
    "pali": "Ekapuggalavaggo",
    "english": "The Chapter of the One Person",
    "sinhala": "ඒක පුද්ගල වග්ගය"
  },
  "sections": [
    {
      "number": 170,
      "pali": "‘‘Ekapuggalo, bhikkhave, loke uppajjamāno uppajjati bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Katamo ekapuggalo? Tathāgato arahaṃ sammāsambuddho. Ayaṃ kho, bhikkhave, ekapuggalo loke uppajjamāno uppajjati bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti.",
      "english": "Monks, when a single individual arises in the world, that individual arises for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of devas and humans. Who is that single individual? The Tathāgata, the Arahant, the Perfectly Self-Awakened One. Indeed, monks, this single individual, arising in the world, arises for the welfare of the many, for the happiness of the many, out of compassion for the world, for the benefit, welfare, and happiness of devas and humans.",
      "sinhala": "මහණෙනි, එක් පුද්ගලයෙක් ලෝකයෙහි පහළ වන්නේ බොහෝ දෙනාගේ හිත පිණිසත්, බොහෝ දෙනාගේ සුව පිණිසත්, ලෝකයා කෙරෙහි අනුකම්පාවෙන් යුතුවත්, දෙවි මිනිසුන්ගේ අර්ථය පිණිසත්, හිත පිණිසත්, සුව පිණිසත් ය. ඒ එක් පුද්ගලයා කවරෙක්ද? තථාගතයන් වහන්සේ ය, අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ ය. මහණෙනි, මේ එක් පුද්ගලයා ලෝකයෙහි පහළ වන්නේ බොහෝ දෙනාගේ හිත පිණිසත්, බොහෝ දෙනාගේ සුව පිණිසත්, ලෝකයා කෙරෙහි අනුකම්පාවෙන් යුතුවත්, දෙවි මිනිසුන්ගේ අර්ථය පිණිසත්, හිත පිණිසත්, සුව පිණිසත් ය.",
      "paliTitle": ""
    },
    {
      "number": 171,
      "pali": "‘‘Ekapuggalassa, bhikkhave, pātubhāvo dullabho lokasmiṃ. Katamassa ekapuggalassa? Tathāgatassa arahato sammāsambuddhassa. Imassa kho, bhikkhave, ekapuggalassa pātubhāvo dullabho lokasmi’’nti.",
      "english": "Monks, the manifestation of a single individual is rare in the world. Which single individual? The Tathāgata, the Arahant, the Perfectly Self-Awakened One. Indeed, monks, the manifestation of this single individual is rare in the world.",
      "sinhala": "මහණෙනි, එක් ඒකපුද්ගලයාගේ පහළ වීම ලෝකයෙහි දුර්‍ලභය. කවර ඒකපුද්ගලයාගේ ද? තථාගතයන්‍වහන්සේගේ අරහත් සම්‍මාසම්බුදුරජාණන්‍වහන්සේගේ ය. මහණෙනි, මේ ඒකපුද්ගලයාගේ පහළ වීම ලෝකයෙහි දුර්‍ලභය.",
      "paliTitle": ""
    },
    {
      "number": 172,
      "pali": "‘‘Ekapuggalo, bhikkhave, loke uppajjamāno uppajjati acchariyamanusso. Katamo ekapuggalo? Tathāgato arahaṃ sammāsambuddho. Ayaṃ kho, bhikkhave, ekapuggalo loke uppajjamāno uppajjati acchariyamanusso’’ti.",
      "english": "Monks, when one person arises in the world, a wondrous human being arises. Who is that one person? The Tathāgata, the Arahant, the Perfectly Self-Enlightened One. Indeed, monks, this one person, when arising in the world, arises as a wondrous human being.",
      "sinhala": "මහණෙනි, එකම පුද්ගලයෙක් ලෝකයෙහි පහළ වන කල්හි ආශ්ච​ර්‍ය​වත් මනුෂ්‍යයෙක් ලෙස පහළ වෙයි.\nඒ එකම පුද්ගලයා කවරෙක්ද?\nඅරහත් වූ, සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේය.\nමහණෙනි, මේ සැබැවින්ම එකම පුද්ගලයා ලෝකයෙහි පහළ වන කල්හි ආශ්ච​ර්‍ය​වත් මනුෂ්‍යයෙක් ලෙස පහළ වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 173,
      "pali": "‘‘Ekapuggalassa, bhikkhave, kālakiriyā bahuno janassa anutappā [ānutappā (sī.)] hoti. Katamassa ekapuggalassa? Tathāgatassa arahato sammāsambuddhassa. Imassa kho, bhikkhave, ekapuggalassa kālakiriyā bahuno janassa anutappā hotī’’ti.",
      "english": "Monks, the passing away of one person causes great sorrow to many people. Which one person? The Tathāgata, the Arahant, the Perfectly Self-Enlightened One. Indeed, Monks, the passing away of this one person causes great sorrow to many people.",
      "sinhala": "භික්ෂූණි, එක් පුද්ගලයෙකුගේ මරණය බොහෝ ජනයාට ශෝකය ගෙන දෙයි. ඒ කවර එක් පුද්ගලයෙක්ද? අරහත් වූ, සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ ය. භික්ෂූණි, සැබවින්ම, මේ එක් පුද්ගලයාගේ මරණය බොහෝ ජනයාට ශෝකය ගෙන දෙයි.",
      "paliTitle": ""
    },
    {
      "number": 174,
      "pali": "‘‘Ekapuggalo, bhikkhave, loke uppajjamāno uppajjati adutiyo asahāyo appaṭimo appaṭisamo appaṭibhāgo appaṭipuggalo asamo asamasamo dvipadānaṃ aggo. Katamo ekapuggalo? Tathāgato arahaṃ sammāsambuddho. Ayaṃ kho, bhikkhave, ekapuggalo loke uppajjamāno uppajjati adutiyo asahāyo appaṭimo appaṭisamo appaṭibhāgo appaṭipuggalo asamo asamasamo dvipadānaṃ aggo’’ti.",
      "english": "Monks, when one person arises in the world, he arises without a second, without a companion, unmatched, unequalled, without a counterpart, without a peer, without equal, supremely without equal, foremost among two-footed beings. Who is this one person? The Tathāgata, the Arahant, the Perfectly Self-Awakened One. This, indeed, Monks, is that one person who, when he arises in the world, arises without a second, without a companion, unmatched, unequalled, without a counterpart, without a peer, without equal, supremely without equal, foremost among two-footed beings.",
      "sinhala": "මහණෙනි, එකම එක් පුද්ගලයෙක් ලෝකයේ පහළ වන්නේ අද්විතීයව, අසහායව, අ ප්‍ රතිමව, අ ප්‍ රතිසමව, අ ප්‍ රතිභාගව, අ ප්‍ රතිපුද්ගලව, අසමව, අසමසමව, ද්විපාදයන් අතර අ ග්‍ රව යි. කවරෙක් ද මේ එකම පුද්ගලයා? ඒ තථාගත වූ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ යි. මහණෙනි, මේ එකම එක් පුද්ගලයා ලෝකයේ පහළ වන්නේ අද්විතීයව, අසහායව, අ ප්‍ රතිමව, අ ප්‍ රතිසමව, අ ප්‍ රතිභාගව, අ ප්‍ රතිපුද්ගලව, අසමව, අසමසමව, ද්විපාදයන් අතර අ ග්‍ රව යි.",
      "paliTitle": ""
    },
    {
      "number": 175,
      "numberRange": "175-186",
      "pali": "‘‘Ekapuggalassa, bhikkhave, pātubhāvā mahato cakkhussa pātubhāvo hoti, mahato ālokassa pātubhāvo hoti, mahato obhāsassa pātubhāvo hoti, channaṃ anuttariyānaṃ pātubhāvo hoti, catunnaṃ paṭisambhidānaṃ sacchikiriyā hoti, anekadhātupaṭivedho hoti, nānādhātupaṭivedho hoti, vijjāvimuttiphalasacchikiriyā hoti, sotāpattiphalasacchikiriyā hoti, sakadāgāmiphalasacchikiriyā hoti, anāgāmiphalasacchikiriyā hoti, arahattaphalasacchikiriyā hoti. Katamassa ekapuggalassa? Tathāgatassa arahato sammāsambuddhassa. Imassa kho, bhikkhave, ekapuggalassa pātubhāvā mahato cakkhussa pātubhāvo hoti, mahato ālokassa pātubhāvo hoti, mahato obhāsassa pātubhāvo hoti, channaṃ anuttariyānaṃ pātubhāvo hoti, catunnaṃ paṭisambhidānaṃ sacchikiriyā hoti, anekadhātupaṭivedho hoti, nānādhātupaṭivedho hoti, vijjāvimuttiphalasacchikiriyā hoti, sotāpattiphalasacchikiriyā hoti, sakadāgāmiphalasacchikiriyā hoti, anāgāmiphalasacchikiriyā hoti, arahattaphalasacchikiriyā hotī’’ti.",
      "english": "Monks, with the appearance of one individual, there is the appearance of great vision, there is the appearance of great illumination, there is the appearance of great radiance, there is the appearance of the six supreme states, there is the realization of the four analytical knowledges, there is the penetration of manifold elements, there is the penetration of diverse elements, there is the realization of the fruit of true knowledge and liberation, there is the realization of the fruit of stream-entry, there is the realization of the fruit of once-returning, there is the realization of the fruit of non-returning, there is the realization of the fruit of arahantship. Which one individual? The Thus-Gone One, the Worthy One, the Perfectly Self-Awakened One. Monks, with the appearance of this one individual, there is the appearance of great vision, there is the appearance of great illumination, there is the appearance of great radiance, there is the appearance of the six supreme states, there is the realization of the four analytical knowledges, there is the penetration of manifold elements, there is the penetration of diverse elements, there is the realization of the fruit of true knowledge and liberation, there is the realization of the fruit of stream-entry, there is the realization of the fruit of once-returning, there is the realization of the fruit of non-returning, there is the realization of the fruit of arahantship.",
      "sinhala": "මහණෙනි, එක් පුද්ගලයෙකුගේ පහළ වීමෙන් මහා චක්‍ෂුසක පහළවීමක්, මහා ආලෝකයක පහළවීමක්, මහා ඕභාසයක පහළවීමක් සිදුවේ. සය වැදෑරුම් අනුත්තර ධර්මයන්ගේ පහළවීමක් සිදුවේ. සිව් වැදෑරුම් ප්‍රතිසම්භිදා ඥානයන් සාක්ෂාත් කිරීමක් සිදුවේ. අනේක ධාතු ප්‍රතිවේධයක්, නානා ධාතු ප්‍රතිවේධයක් සිදුවේ. විද්‍යා විමුක්ති ඵලය සාක්ෂාත් කිරීමක්, සෝවාන් ඵලය සාක්ෂාත් කිරීමක්, සකදාගාමී ඵලය සාක්ෂාත් කිරීමක්, අනාගාමී ඵලය සාක්ෂාත් කිරීමක්, අරහත්ත ඵලය සාක්ෂාත් කිරීමක් සිදුවේ.\n\nඒ කවර පුද්ගලයාගේද? ඒ අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ වන තථාගතයන් වහන්සේගේය.\n\nමහණෙනි, මේ පුද්ගලයාගේ පහළ වීමෙන් මහා චක්‍ෂුසක පහළවීමක්, මහා ආලෝකයක පහළවීමක්, මහා ඕභාසයක පහළවීමක් සිදුවේ. සය වැදෑරුම් අනුත්තර ධර්මයන්ගේ පහළවීමක් සිදුවේ. සිව් වැදෑරුම් ප්‍රතිසම්භිදා ඥානයන් සාක්ෂාත් කිරීමක් සිදුවේ. අනේක ධාතු ප්‍රතිවේධයක්, නානා ධාතු ප්‍රතිවේධයක් සිදුවේ. විද්‍යා විමුක්ති ඵලය සාක්ෂාත් කිරීමක්, සෝවාන් ඵලය සාක්ෂාත් කිරීමක්, සකදාගාමී ඵලය සාක්ෂාත් කිරීමක්, අනාගාමී ඵලය සාක්ෂාත් කිරීමක්, අරහත්ත ඵලය සාක්ෂාත් කිරීමක් සිදුවේ.",
      "paliTitle": ""
    },
    {
      "number": 187,
      "pali": "‘‘Nāhaṃ bhikkhave, aññaṃ ekapuggalampi samanupassāmi yo evaṃ tathāgatena anuttaraṃ dhammacakkaṃ pavattitaṃ sammadeva anuppavatteti yathayidaṃ, bhikkhave, sāriputto. Sāriputto, bhikkhave, tathāgatena anuttaraṃ dhammacakkaṃ pavattitaṃ sammadeva anuppavattetī’’ti. ",
      "english": "Bhikkhus, I do not perceive any other single individual who, in this manner, perfectly continues to turn the unsurpassed Wheel of Dhamma set in motion by the Tathāgata, as does Sāriputta, bhikkhus. Sāriputta, bhikkhus, perfectly continues to turn the unsurpassed Wheel of Dhamma set in motion by the Tathāgata.",
      "sinhala": "භික්ෂූණි, තථාගතයන් වහන්සේ විසින් ප්‍රවර්තනය කරන ලද අනුත්තර ධර්මචක්‍රය, මේ සාරිපුත්ත හාමුදුරුවෝ මෙන් මනාකොට අනුප්‍රවර්තනය කරන වෙනත් කිසිදු පුද්ගලයකු මම නොදකිමි.\n\nභික්ෂූණි, සාරිපුත්ත හාමුදුරුවෝ තථාගතයන් වහන්සේ විසින් ප්‍රවර්තනය කරන ලද අනුත්තර ධර්මචක්‍රය මනා කොට අනුප්‍රවර්තනය කරති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Ekapuggalavaggo terasamo.",
    "english": "",
    "sinhala": ""
  }
}