{
  "id": "an1.12",
  "title": {
    "pali": "Anāpattivaggo",
    "english": "The Chapter on Non-Offenses",
    "sinhala": "අනාපත්ති වග්ගය"
  },
  "sections": [
    {
      "number": 150,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū anāpattiṃ āpattīti dīpenti te, bhikkhave, bhikkhū bahujanaahitāya paṭipannā bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū apuññaṃ pasavanti, te cimaṃ saddhammaṃ antaradhāpentī’’ti. Paṭhamaṃ.",
      "english": "Monks, those bhikkhus who declare a non-offense to be an offense – those bhikkhus are acting for the harm of many people, for the discomfort of many people, for the disadvantage, detriment, and suffering of many people, both devas and humans. And, monks, those bhikkhus generate much demerit, and they cause this true Dhamma to disappear.",
      "sinhala": "මහණෙනි, යම් භික්ෂූහු ආපත්ති නොවන දෙයක් ආපත්තියක් යැයි ප්‍රකාශ කරත්ද, මහණෙනි, ඒ භික්ෂූහු බොහෝ දෙනාට අහිත පිණිස, බොහෝ දෙනාට අසුඛය පිණිස, බොහෝ ජනයාට අනර්ථය පිණිස, අහිත පිණිස, දෙවිමිනිසුන්ට දුක පිණිස පිළිපදින්නාහ. මහණෙනි, ඒ භික්ෂූහු බොහෝ අකුසල් රැස් කරගනිති; ඔවුහු මේ සද්ධර්මය අතුරුදහන් කරවන්නාහ.",
      "paliTitle": ""
    },
    {
      "number": 151,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū āpattiṃ anāpattīti dīpenti te, bhikkhave, bhikkhū bahujanaahitāya paṭipannā bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū apuññaṃ pasavanti, te cimaṃ saddhammaṃ antaradhāpentī’’ti. Dutiyaṃ.",
      "english": "Those monks, O bhikkhus, who declare an offense to be a non-offense – those monks, O bhikkhus, are practicing for the harm of many people, for their discomfort, for the disadvantage, the detriment, and the suffering of many people, both devas and humans. Furthermore, O bhikkhus, those monks generate much demerit, and they cause this True Dhamma to vanish.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් භික්ෂූන් වහන්සේලා ආපත්තියක් අනාවැකි ලෙස දක්වත්ද, භික්ෂූන් වහන්ස, ඒ භික්ෂූන් වහන්සේලා බොහෝ දෙනාගේ අහිත පිණිස, බොහෝ දෙනාගේ අසැප පිණිස, බොහෝ ජනයාටත් දෙවිමිනිසුන්ටත් අනර්ථය පිණිස, අහිත පිණිස, දුක පිණිස පිළිපදින්නාහ. තවද, භික්ෂූන් වහන්ස, ඒ භික්ෂූන් වහන්සේලා බොහෝ අකුසල කර්ම රැස් කරත්. ඔවුහු මේ සද්ධ​ර්මය අතුරුදහන් කරත්.",
      "paliTitle": ""
    },
    {
      "number": 152,
      "numberRange": "152-159",
      "pali": "‘‘Ye te, bhikkhave, bhikkhū lahukaṃ āpattiṃ garukā āpattīti dīpenti…pe… garukaṃ āpattiṃ lahukā āpattīti dīpenti…pe… duṭṭhullaṃ āpattiṃ aduṭṭhullā āpattīti dīpenti…pe… aduṭṭhullaṃ āpattiṃ duṭṭhullā āpattīti dīpenti…pe… sāvasesaṃ āpattiṃ anavasesā āpattīti dīpenti…pe… anavasesaṃ āpattiṃ sāvasesā āpattīti dīpenti…pe… sappaṭikammaṃ āpattiṃ appaṭikammā āpattīti dīpenti…pe… appaṭikammaṃ āpattiṃ sappaṭikammā āpattīti dīpenti te, bhikkhave, bhikkhū bahujanaahitāya paṭipannā bahujanaasukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū apuññaṃ pasavanti, te cimaṃ saddhammaṃ antaradhāpentī’’ti. Dasamaṃ.",
      "english": "Monks, those bhikkhus who declare a minor offense to be a grave offense, who declare a grave offense to be a minor offense, who declare a serious offense to be a not-serious offense, who declare a not-serious offense to be a serious offense, who declare an offense with remainder to be an offense without remainder, who declare an offense without remainder to be an offense with remainder, who declare an offense requiring rectification to be an offense not requiring rectification, who declare an offense not requiring rectification to be an offense requiring rectification—\n\n—those bhikkhus, monks, are practicing for the harm of many people, for the unhappiness of many people, for the disadvantage, detriment, and suffering of many people, both gods and humans. And those bhikkhus, monks, generate much demerit, and they cause this true Dhamma to disappear.",
      "sinhala": "මහණෙනි, යම් භික්‍ෂූහු ලඝුක ආපත්තියක් ගරුක ආපත්තියක් ලෙස පෙන්වා දෙත්ද, ගරුක ආපත්තියක් ලඝුක ආපත්තියක් ලෙස පෙන්වා දෙත්ද, දුටුල්ල ආපත්තියක් අදුටුල්ල ආපත්තියක් ලෙස පෙන්වා දෙත්ද, අදුටුල්ල ආපත්තියක් දුටුල්ල ආපත්තියක් ලෙස පෙන්වා දෙත්ද, සාවශේෂ ආපත්තියක් අනවශේෂ ආපත්තියක් ලෙස පෙන්වා දෙත්ද, අනවශේෂ ආපත්තියක් සාවශේෂ ආපත්තියක් ලෙස පෙන්වා දෙත්ද, සප්‍රතිකර්ම ආපත්තියක් අප‍්‍රතිකර්ම ආපත්තියක් ලෙස පෙන්වා දෙත්ද, අප‍්‍රතිකර්ම ආපත්තියක් සප්‍රතිකර්ම ආපත්තියක් ලෙස පෙන්වා දෙත්ද, මහණෙනි, ඒ භික්‍ෂූහු බොහෝ දෙනාට අහිත පිණිස, බොහෝ දෙනාට අසුභ පිණිස, බොහෝ දෙවිමිනිසුන්ගේ අනර්ථය පිණිස, අහිත පිණිස, දුක පිණිස කටයුතු කරන්නෝ වෙති. මහණෙනි, ඒ භික්‍ෂූහු බොහෝ අකුසල් රැස්කර ගනිති. තවද, ඔවුහු මේ සද්‍ධර්මය අතුරුදහන් කරවන්නෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 160,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū anāpattiṃ anāpattīti dīpenti te, bhikkhave, bhikkhū bahujanahitāya paṭipannā bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū puññaṃ pasavanti, te cimaṃ saddhammaṃ ṭhapentī’’ti. Ekādasamaṃ.",
      "english": "Bhikkhus, those monks who declare what is not an offense to be not an offense, those monks, bhikkhus, practice for the welfare of the many, for the happiness of the many, for the benefit, welfare, and happiness of a great many people, including devas and humans. And those monks, bhikkhus, generate much merit; they establish this True Dhamma.",
      "sinhala": "භික්ෂූණි, යම් ඒ භික්ෂූහු ආපත්තියක් නොවන දෙයක් ආපත්තියක් නොවේ යැයි පෙන්වා දෙත්ද, භික්ෂූණි, ඒ භික්ෂූහු බොහෝ දෙනාගේ හිත පිණිස පිළිපදින්නාහ, බොහෝ දෙනාගේ සැපය පිණිස පිළිපදින්නාහ, බොහෝ දෙව්මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැපය පිණිස පිළිපදින්නාහ.\n\nතවද, භික්ෂූණි, ඒ භික්ෂූහු බොහෝ පිනක් උපදවා ගනිත්. ඔවුහු මේ සද්ධ‍ර්මය පිහිටුවත්.",
      "paliTitle": ""
    },
    {
      "number": 161,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū āpattiṃ āpattīti dīpenti te, bhikkhave, bhikkhū bahujanahitāya paṭipannā bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū puññaṃ pasavanti, te cimaṃ saddhammaṃ ṭhapentī’’ti. Dvādasamaṃ.",
      "english": "Monks, those bhikkhus who reveal an offense as an offense are practicing for the welfare of the many, for the happiness of the many, for the good, welfare, and happiness of many people, both gods and humans. And those bhikkhus, monks, generate much merit; they establish this True Dhamma.",
      "sinhala": "‘‘මහණෙනි, යම් භික්ෂූහු ආපත්තියක් ආපත්තියක් ලෙසම හෙළි කරත්ද, මහණෙනි, ඒ භික්ෂූහු බොහෝ දෙනාගේ හිත පිණිස ද, බොහෝ දෙනාගේ සුව පිණිස ද, දෙවි මිනිසුන් සහිත බොහෝ ජනයාගේ අර්ථය පිණිස ද, හිත පිණිස ද, සුව පිණිස ද පිළිපදින්නාහ. මහණෙනි, ඒ භික්ෂූහු බොහෝ පින ද උපදවති. ඔවුහු මේ සද්ධර්‍මය පිහිටුවත්ති.’’",
      "paliTitle": ""
    },
    {
      "number": 162,
      "numberRange": "162-169",
      "pali": "‘‘Ye te, bhikkhave, bhikkhū lahukaṃ āpattiṃ lahukā āpattīti dīpenti… garukaṃ āpattiṃ garukā āpattīti dīpenti… duṭṭhullaṃ āpattiṃ duṭṭhullā āpattīti dīpenti… aduṭṭhullaṃ āpattiṃ aduṭṭhullā āpattīti dīpenti… sāvasesaṃ āpattiṃ sāvasesā āpattīti dīpenti… anavasesaṃ āpattiṃ anavasesā āpattīti dīpenti… sappaṭikammaṃ āpattiṃ sappaṭikammā āpattīti dīpenti… appaṭikammaṃ āpattiṃ appaṭikammā āpattīti dīpenti te, bhikkhave, bhikkhū bahujanahitāya paṭipannā bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū puññaṃ pasavanti, te cimaṃ saddhammaṃ ṭhapentī’’ti. Vīsatimaṃ. ",
      "english": "Those monks, bhikkhus, who declare a light offense as a light offense, who declare a grave offense as a grave offense, who declare a gross offense as a gross offense, who declare a minor offense as a minor offense, who declare an offense with a remainder as an offense with a remainder, who declare an offense without a remainder as an offense without a remainder, who declare an offense that can be remedied as an offense that can be remedied, and who declare an offense that cannot be remedied as an offense that cannot be remedied — those monks, bhikkhus, are committed to the welfare of many people, to the happiness of many people, for the good, for the welfare, for the happiness of many, both devas and humans. And those monks, bhikkhus, generate much merit, and they establish this True Dhamma.",
      "sinhala": "මහණෙනි, යම් ඒ භික්ෂූහු කුඩා ඇවතක් කුඩා ඇවතක් ලෙස දක්වද්ද, බරපතළ ඇවතක් බරපතළ ඇවතක් ලෙස දක්වද්ද, දැඩි ඇවතක් දැඩි ඇවතක් ලෙස දක්වද්ද, දැඩි නොවන ඇවතක් දැඩි නොවන ඇවතක් ලෙස දක්වද්ද, ඉතිරි සහිත ඇවතක් ඉතිරි සහිත ඇවතක් ලෙස දක්වද්ද, ඉතිරි රහිත ඇවතක් ඉතිරි රහිත ඇවතක් ලෙස දක්වද්ද, ප‍්‍රතික‍ර්‍ම සහිත ඇවතක් ප‍්‍රතික‍ර්‍ම සහිත ඇවතක් ලෙස දක්වද්ද, ප‍්‍රතික‍ර්‍ම රහිත ඇවතක් ප‍්‍රතික‍ර්‍ම රහිත ඇවතක් ලෙස දක්වද්ද; ඒ භික්ෂූහු බොහෝ දෙනාගේ හිත පිණිසත්, බොහෝ දෙනාගේ සුවය පිණිසත් පිළිපදින්නාහ. ඔවුහු බොහෝ දෙවිමිනිසුන්ගේ වැඩ පිණිසත්, හිත පිණිසත්, සුවය පිණිසත් (පිළිපදින්නාහ).\n\nතවද, මහණෙනි, ඒ භික්ෂූහු බොහෝ පිනක් උපදවන්නාහ. ඔවුහු මේ සද්‍ධ‍ර්‍මය පිහිටුවන්නාහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Anāpattivaggo dvādasamo.",
    "english": "",
    "sinhala": ""
  }
}