{
  "id": "an1.19",
  "title": {
    "pali": "Kāyagatāsativaggo",
    "english": "Chapter on Mindfulness of the Body",
    "sinhala": "කායගතාසති වග්ගය"
  },
  "sections": [
    {
      "number": 563,
      "pali": "‘‘Yassa kassaci, bhikkhave, mahāsamuddo cetasā phuṭo antogadhā tassa kunnadiyo yā kāci samuddaṅgamā; evamevaṃ, bhikkhave, yassa kassaci kāyagatā sati bhāvitā bahulīkatā antogadhā tassa kusalā dhammā ye keci vijjābhāgiyā’’ti.",
      "english": "Monks, whoever comprehends the great ocean mentally, within that comprehension are included all those small rivers that flow to the ocean.\n\nIn the same way, Monks, whoever has cultivated and frequently practiced mindfulness of the body, within that practice are included all those wholesome states that pertain to true knowledge.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් කිසි කෙනෙකුගේ සිතින් මහ සයුර විහිදී පැතිරී පවතී නම්, මුහුදට ගලායන යම් කුඩා ගංගා ඇත්ද, ඒ සියල්ල ඔහු තුළ අන්තර්ගත වේ.\n\nඑලෙසින්ම, භික්ෂූන් වහන්ස, යම් කිසි කෙනෙකු විසින් කායගතා සතිය වඩන ලද්දේ නම්, බහුල වශයෙන් පුරුදු කරන ලද්දේ නම්, විජ්ජාභාගී වන යම් කුසල ධර්‍මයන් ඇත්ද, ඒ සියල්ල ඔහු තුළ අන්තර්ගත වේ.",
      "paliTitle": ""
    },
    {
      "number": 564,
      "numberRange": "564-570",
      "pali": "‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato mahato saṃvegāya saṃvattati… mahato atthāya saṃvattati… mahato yogakkhemāya saṃvattati… satisampajaññāya saṃvattati… ñāṇadassanappaṭilābhāya saṃvattati… diṭṭhadhammasukhavihārāya saṃvattati… vijjāvimuttiphalasacchikiriyāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato mahato saṃvegāya saṃvattati… mahato atthāya saṃvattati… mahato yogakkhemāya saṃvattati… satisampajaññāya saṃvattati… ñāṇadassanappaṭilābhāya saṃvattati… diṭṭhadhammasukhavihārāya saṃvattati… vijjāvimuttiphalasacchikiriyāya saṃvattatī’’ti.",
      "english": "“Monks, one quality, when cultivated and frequently practiced, leads to a great sense of spiritual urgency, leads to great benefit, leads to great deliverance from bondage, leads to mindfulness and clear comprehension, leads to the acquisition of wisdom and insight, leads to a pleasant abiding in this very life, and leads to the direct realization of the fruit of true knowledge and liberation. Which one quality is this? Mindfulness of the body.\n\nThis one quality, monks, when cultivated and frequently practiced, leads to a great sense of spiritual urgency, leads to great benefit, leads to great deliverance from bondage, leads to mindfulness and clear comprehension, leads to the acquisition of wisdom and insight, leads to a pleasant abiding in this very life, and leads to the direct realization of the fruit of true knowledge and liberation.”",
      "sinhala": "මහණෙනි, එකම ධර්‍මයක් ඇත. එය භාවනා කිරීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන්, මහත් සංවේගයක් පිණිස පවතී... මහත් අර්‍ථයක් පිණිස පවතී... මහත් යෝගක‍්ෂේමයක් පිණිස පවතී... සති-සම්පජඤ්ඤය පිණිස පවතී... ඤාණ දර්‍ශනය ලැබීම පිණිස පවතී... මේ ආත්මභාවයේම සැප විහරණය පිණිස පවතී... විද්‍යා විමුක්ති ඵලය සාක‍්ෂාත් කිරීම පිණිස පවතී.\n\nඒ එකම ධර්‍මය කවරේද? කයෙහි පිහිටි සිහියයි.\n\nමහණෙනි, මේ එකම ධර්‍මය භාවනා කිරීමෙන්, බහුල වශයෙන් පුරුදු කිරීමෙන්, මහත් සංවේගයක් පිණිස පවතී... මහත් අර්‍ථයක් පිණිස පවතී... මහත් යෝගක‍්ෂේමයක් පිණිස පවතී... සති-සම්පජඤ්ඤය පිණිස පවතී... ඤාණ දර්‍ශනය ලැබීම පිණිස පවතී... මේ ආත්මභාවයේම සැප විහරණය පිණිස පවතී... විද්‍යා විමුක්ති ඵලය සාක‍්ෂාත් කිරීම පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 571,
      "pali": "‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate kāyopi passambhati, cittampi passambhati, vitakkavicārāpi vūpasammanti, kevalāpi vijjābhāgiyā dhammā bhāvanāpāripūriṃ gacchanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate kāyopi passambhati, cittampi passambhati, vitakkavicārāpi vūpasammanti, kevalāpi vijjābhāgiyā dhammā bhāvanāpāripūriṃ gacchantī’’ti.",
      "english": "Monks, when one quality is developed and frequently practiced, the body becomes tranquil, the mind becomes tranquil, thinking and pondering subside, and all qualities conducive to true knowledge reach the perfection of their development. Which one quality? Mindfulness immersed in the body. Indeed, monks, when this one quality is developed and frequently practiced, the body becomes tranquil, the mind becomes tranquil, thinking and pondering subside, and all qualities conducive to true knowledge reach the perfection of their development.",
      "sinhala": "භික්ෂූනි, එක් ධර්මයක් වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි, කය ද සංසිඳෙයි, සිත ද සංසිඳෙයි, විතර්ක විචාර ද සංසිඳෙයි, විද්‍යාවට උපකාරී වන සියලු ධර්මයන් භාවනාවේ පරම පූර්ණත්වය කරා එළඹෙයි.\n\nකවර එක් ධර්මයක් ද?\n\nකයෙහි පිහිටි සිහියයි. භික්ෂූනි, මේ එක් ධර්මයක් වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි, කය ද සංසිඳෙයි, සිත ද සංසිඳෙයි, විතර්ක විචාර ද සංසිඳෙයි, විද්‍යාවට උපකාරී වන සියලු ධර්මයන් භාවනාවේ පරම පූර්ණත්වය කරා එළඹෙයි.",
      "paliTitle": ""
    },
    {
      "number": 572,
      "pali": "‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate anuppannā ceva akusalā dhammā nuppajjanti, uppannā ca akusalā dhammā pahīyanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anuppannā ceva akusalā dhammā nuppajjanti, uppannā ca akusalā dhammā pahīyantī’’ti.",
      "english": "Bhikkhus, when one quality is developed and cultivated repeatedly, unarisen unwholesome qualities do not arise, and arisen unwholesome qualities are abandoned. Which one quality is that? Mindfulness of the body. Indeed, bhikkhus, when this one quality is developed and cultivated repeatedly, unarisen unwholesome qualities do not arise, and arisen unwholesome qualities are abandoned.",
      "sinhala": "භික්‍ෂූන් වහන්ස, එක් ධර්මයක් වැඩීමෙන් හා බහුලීකරණය කිරීමෙන්, නූපන් අකුසල ධර්මයන් නූපදී; හටගත් අකුසල ධර්මයන් පහව යයි. කවර එකම ධර්මයෙහි ද? කායගතා සතියෙහි ය. භික්‍ෂූන් වහන්ස, මේ එකම ධර්මය වැඩීමෙන් හා බහුලීකරණය කිරීමෙන් නූපන් අකුසල ධර්මයන් නූපදී; හටගත් අකුසල ධර්මයන් පහව යයි.",
      "paliTitle": ""
    },
    {
      "number": 573,
      "pali": "‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate anuppannā ceva kusalā dhammā uppajjanti, uppannā ca kusalā dhammā bhiyyobhāvāya vepullāya saṃvattanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anuppannā ceva kusalā dhammā uppajjanti, uppannā ca kusalā dhammā bhiyyobhāvāya vepullāya saṃvattantī’’ti.",
      "english": "“Monks, when a single quality is developed and repeatedly cultivated, unarisen wholesome qualities arise, and arisen wholesome qualities lead to their further development and abundance. Which single quality? Mindfulness of the body. Indeed, monks, when this single quality is developed and repeatedly cultivated, unarisen wholesome qualities arise, and arisen wholesome qualities lead to their further development and abundance.”",
      "sinhala": "මහණෙනි, එක් ධර‍්මයක් වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, නූපන් කුසල ධර‍්ම උපදිත්; උපන් කුසල ධර‍්ම වැඩි දියුණු වීම පිණිසත්, මහත් බව පිණිසත් පවතී. කවර එක් ධර‍්මයක්ද? කයෙහි පිහිටි සිහියයි. මහණෙනි, මේ එක් ධර‍්මයම වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, නූපන් කුසල ධර‍්ම උපදිත්; උපන් කුසල ධර‍්ම වැඩි දියුණු වීම පිණිසත්, මහත් බව පිණිසත් පවතී.",
      "paliTitle": ""
    },
    {
      "number": 574,
      "pali": "‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate avijjā pahīyati, vijjā uppajjati, asmimāno pahīyati, anusayā samugghātaṃ gacchanti, saṃyojanā pahīyanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate avijjā pahīyati, vijjā uppajjati, asmimāno pahīyati, anusayā samugghātaṃ gacchanti, saṃyojanā pahīyantī’’ti.",
      "english": "“Monks, by cultivating and repeatedly practicing one quality, ignorance is abandoned, true knowledge arises, the conceit 'I am' is abandoned, latent defilements are eradicated, and fetters are abandoned.”\n\n“Which one quality?”\n\n“Mindfulness of the body.”\n\n“Indeed, monks, by cultivating and repeatedly practicing this one quality, ignorance is abandoned, true knowledge arises, the conceit 'I am' is abandoned, latent defilements are eradicated, and fetters are abandoned.”",
      "sinhala": "මහණෙනි, එකම ධර්මයක් වඩා වර්ධනය කර, බහුල වශයෙන් පුරුදු කරන ලද කල්හි අවිද්‍යාව ප‍්‍ර‍්‍රහීණ වේ, විද්‍යාව උපදී, අස්මිමානය ප‍්‍ර‍්‍රහීණ වේ, අනුශයෝ සමුච්ඡේදයට පැමිණෙත්, සංයෝජනයෝ ප‍්‍ර‍්‍රහීණ වෙත්.\n\nකිනම් එකම ධර්මයෙහි ද?\n\nකයෙහි පිහිට වූ සිහියෙනි.\n\nමහණෙනි, මේ එකම ධර්මය වඩා වර්ධනය කර, බහුල වශයෙන් පුරුදු කරන ලද කල්හි අවිද්‍යාව ප‍්‍ර‍්‍රහීණ වේ, විද්‍යාව උපදී, අස්මිමානය ප‍්‍ර‍්‍රහීණ වේ, අනුශයෝ සමුච්ඡේදයට පැමිණෙත්, සංයෝජනයෝ ප‍්‍ර‍්‍රහීණ වෙත්.",
      "paliTitle": ""
    },
    {
      "number": 575,
      "numberRange": "575-576",
      "pali": "‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato paññāpabhedāya saṃvattati… anupādāparinibbānāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato paññāpabhedāya saṃvattati… anupādāparinibbānāya saṃvattatī’’ti.",
      "english": "Monks, there is one quality which, when developed and repeatedly practiced, conduces to the full differentiation of wisdom and conduces to ultimate liberation without any clinging. Which one quality? Mindfulness immersed in the body. Indeed, monks, this one quality, when developed and repeatedly practiced, conduces to the full differentiation of wisdom and conduces to ultimate liberation without any clinging.",
      "sinhala": "භික්‍ෂූනි, එක් ධර්‍මයක් වඩන ලදුව, බහුල වශයෙන් කරන ලදුව, ප්‍රඥාව ප්‍රභේද වීම පිණිස පවතී... අනුපාදා පරිනිර්‍වාණය පිණිස පවතී. ඒ කවර එක් ධර්‍මයක්ද? කායගතාසතියයි. භික්‍ෂූනි, මේ එක් ධර්‍මය වඩන ලදුව, බහුල වශයෙන් කරන ලදුව, ප්‍රඥාව ප්‍රභේද වීම පිණිස පවතී... අනුපාදා පරිනිර්‍වාණය පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 577,
      "numberRange": "577-579",
      "pali": "‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate anekadhātupaṭivedho hoti… nānādhātupaṭivedho hoti… anekadhātupaṭisambhidā hoti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anekadhātupaṭivedho hoti… nānādhātupaṭivedho hoti… anekadhātupaṭisambhidā hotī’’ti.",
      "english": "Monks, when one quality is cultivated and extensively practiced, there occurs the penetration of various dimensions of reality, the penetration of diverse dimensions of reality, and analytical understanding concerning various dimensions of reality. In which one quality? In mindfulness directed to the body. Indeed, monks, when this one quality is cultivated and extensively practiced, there occurs the penetration of various dimensions of reality, the penetration of diverse dimensions of reality, and analytical understanding concerning various dimensions of reality.",
      "sinhala": "මහණෙනි, යම් එක් ධ​ර්මයක් වඩන ලද කල්හි, බහුල වශයෙන් පුරුදු කරන ලද කල්හි නොයෙක් ධාතූන් පිළිබඳ ගැඹුරු අවබෝධය ඇතිවේ... නා නා ධාතූන් පිළිබඳ ගැඹුරු අවබෝධය ඇතිවේ... නොයෙක් ධාතූන් පිළිබඳ පටිසම්භිදා ඥානය ඇතිවේ. කවර එක් ධ​ර්මයෙහි ද? කායගතා සතියෙහි ය. මහණෙනි, මේ එක් ධ​ර්මය වඩන ලද කල්හි, බහුල වශයෙන් පුරුදු කරන ලද කල්හි නොයෙක් ධාතූන් පිළිබඳ ගැඹුරු අවබෝධය ඇතිවේ... නා නා ධාතූන් පිළිබඳ ගැඹුරු අවබෝධය ඇතිවේ... නොයෙක් ධාතූන් පිළිබඳ පටිසම්භිදා ඥානය ඇතිවේ.",
      "paliTitle": ""
    },
    {
      "number": 580,
      "numberRange": "580-583",
      "pali": "‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato sotāpattiphalasacchikiriyāya saṃvattati… sakadāgāmiphalasacchikiriyāya saṃvattati… anāgāmiphalasacchikiriyāya saṃvattati… arahattaphalasacchikiriyāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato sotāpattiphalasacchikiriyāya saṃvattati… sakadāgāmiphalasacchikiriyāya saṃvattati… anāgāmiphalasacchikiriyāya saṃvattati… arahattaphalasacchikiriyāya saṃvattatī’’ti.",
      "english": "Monks, when one quality is developed and extensively practiced, it leads to the realization of the fruit of stream-entry, it leads to the realization of the fruit of once-returning, it leads to the realization of the fruit of non-returning, and it leads to the realization of the fruit of arahantship. What is that one quality? It is mindfulness of the body. Indeed, monks, when this one quality is developed and extensively practiced, it leads to the realization of the fruit of stream-entry, it leads to the realization of the fruit of once-returning, it leads to the realization of the fruit of non-returning, and it leads to the realization of the fruit of arahantship.",
      "sinhala": "මහණෙනි, යම් එකම ධර්මයක් වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, එය සෝවාන් ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී; සකදාගාමී ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී; අනාගාමී ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී; අරහත් ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී. ඒ එකම ධර්මය කවරේද? කායගතා සතියයි. මහණෙනි, මේ කායගතා සතිය නම් වූ එකම ධර්මය වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, සෝවාන් ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී; සකදාගාමී ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී; අනාගාමී ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී; අරහත් ඵලය සාක්ෂාත් කරගැනීම පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 584,
      "numberRange": "584-599",
      "pali": "‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato paññāpaṭilābhāya saṃvattati… paññāvuddhiyā saṃvattati… paññāvepullāya saṃvattati… mahāpaññatāya saṃvattati… puthupaññatāya saṃvattati… vipulapaññatāya saṃvattati… gambhīrapaññatāya saṃvattati… asāmantapaññatāya [asamatthapaññatāya (syā. kaṃ.), asamattapaññatāya (ka.), asamantapaññatāya (ṭīkā) paṭi. ma. aṭṭha. 2.3.1 passitabbaṃ] saṃvattati… bhūripaññatāya saṃvattati… paññābāhullāya saṃvattati… sīghapaññatāya saṃvattati… lahupaññatāya saṃvattati… hāsapaññatāya [hāsupaññatāya (sī. pī.)] saṃvattati… javanapaññatāya saṃvattati… tikkhapaññatāya saṃvattati… nibbedhikapaññatāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato paññāpaṭilābhāya saṃvattati… paññāvuddhiyā saṃvattati… paññāvepullāya saṃvattati… mahāpaññatāya saṃvattati… puthupaññatāya saṃvattati… vipulapaññatāya saṃvattati… gambhīrapaññatāya saṃvattati… asāmantapaññatāya saṃvattati… bhūripaññatāya saṃvattati… paññābāhullāya saṃvattati… sīghapaññatāya saṃvattati… lahupaññatāya saṃvattati… hāsapaññatāya saṃvattati… javanapaññatāya saṃvattati… tikkhapaññatāya saṃvattati… nibbedhikapaññatāya saṃvattatī’’ti. ",
      "english": "Monks, there is one quality which, when developed and frequently cultivated, conduces to the acquisition of wisdom, to the growth of wisdom, to the expansion of wisdom, to great wisdom, to extensive wisdom, to vast wisdom, to profound wisdom, to boundless wisdom, to ample wisdom, to abundant wisdom, to swift wisdom, to quick wisdom, to nimble wisdom, to rapid wisdom, to keen wisdom, and to penetrative wisdom. What is that one quality? It is mindfulness of the body. Monks, this one quality, when developed and frequently cultivated, conduces to the acquisition of wisdom, to the growth of wisdom, to the expansion of wisdom, to great wisdom, to extensive wisdom, to vast wisdom, to profound wisdom, to boundless wisdom, to ample wisdom, to abundant wisdom, to swift wisdom, to quick wisdom, to nimble wisdom, to rapid wisdom, to keen wisdom, and to penetrative wisdom.",
      "sinhala": "මහණෙනි, එක් ධර්මයක් භාවනා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද කල්හි ප්‍රඥා ප්‍රතිලාභය පිණිස පවතී... ප්‍රඥාවේ දියුණුව පිණිස පවතී... ප්‍රඥාවේ විපුලත්වය පිණිස පවතී... මහා ප්‍රඥාව පිණිස පවතී... පුළුල් ප්‍රඥාව පිණිස පවතී... විපුල ප්‍රඥාව පිණිස පවතී... ගම්භීර ප්‍රඥාව පිණිස පවතී... අසීමාන්ත ප්‍රඥාව පිණිස පවතී... භූරි ප්‍රඥාව පිණිස පවතී... ප්‍රඥාවේ බහුලත්වය පිණිස පවතී... ශීඝ්‍ර ප්‍රඥාව පිණිස පවතී... ලහු ප්‍රඥාව පිණිස පවතී... හාස ප්‍රඥාව පිණිස පවතී... ජව ප්‍රඥාව පිණිස පවතී... තීක්ෂ්ණ ප්‍රඥාව පිණිස පවතී... නිබ්බේධික ප්‍රඥාව පිණිස පවතී. ඒ එක් ධර්මය කුමක්ද? කයෙහි පිහිටුවාගත් සිහියයි. මහණෙනි, මේ එක් ධර්මය භාවනා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද කල්හි ප්‍රඥා ප්‍රතිලාභය පිණිස පවතී... ප්‍රඥාවේ දියුණුව පිණිස පවතී... ප්‍රඥාවේ විපුලත්වය පිණිස පවතී... මහා ප්‍රඥාව පිණිස පවතී... පුළුල් ප්‍රඥාව පිණිස පවතී... විපුල ප්‍රඥාව පිණිස පවතී... ගම්භීර ප්‍රඥාව පිණිස පවතී... අසීමාන්ත ප්‍රඥාව පිණිස පවතී... භූරි ප්‍රඥාව පිණිස පවතී... ප්‍රඥාවේ බහුලත්වය පිණිස පවතී... ශීඝ්‍ර ප්‍රඥාව පිණිස පවතී... ලහු ප්‍රඥාව පිණිස පවතී... හාස ප්‍රඥාව පිණිස පවතී... ජව ප්‍රඥාව පිණිස පවතී... තීක්ෂ්ණ ප්‍රඥාව පිණිස පවතී... නිබ්බේධික ප්‍රඥාව පිණිස පවතී.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Kāyagatāsativaggo ekūnavīsatimo.",
    "english": "The Nineteenth Chapter on Mindfulness of the Body",
    "sinhala": "කායගතසති වග්‍ගය දහනවවැනි"
  }
}