{
  "id": "an5.13",
  "title": {
    "pali": "Gilānavaggo",
    "english": "The Chapter on the Sick",
    "sinhala": "ගිලන් වග්ගය"
  },
  "sections": [
    {
      "number": 121,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena gilānasālā tenupasaṅkami. Addasā kho bhagavā aññataraṃ bhikkhuṃ dubbalaṃ gilānakaṃ; disvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘Yaṃ kiñci [yaṃ kiñci (syā. kaṃ.)], bhikkhave, bhikkhuṃ dubbalaṃ [bhikkhave dubbalaṃ (sī. syā. kaṃ. pī.)] gilānakaṃ pañca dhammā na vijahanti, tassetaṃ pāṭikaṅkhaṃ – ‘nacirasseva āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatī’’’ti. ‘‘Katame pañca? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratasaññī [sabbatthapi evameva dissati], sabbasaṅkhāresu aniccānupassī, maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. Yaṃ kiñci, bhikkhave, bhikkhuṃ dubbalaṃ gilānakaṃ ime pañca dhammā na vijahanti, tassetaṃ pāṭikaṅkhaṃ – ‘nacirasseva āsavānaṃ khayā…pe… sacchikatvā upasampajja viharissatī’’’ti. Paṭhamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Vesālī, in the Great Wood, in the Gabled Hall. Then, in the evening, the Blessed One, having emerged from his seclusion, approached the sick-ward. The Blessed One saw a certain monk who was weak and ill; having seen him, he sat down on the appointed seat.\n\nHaving sat down, the Blessed One addressed the monks: \"Monks, if five qualities do not abandon any monk who is weak and ill, this is to be expected of him: 'Not long from now, through the destruction of the taints, having realized for himself through direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, he will abide therein.'\"\n\n\"Which five are these? Here, monks, a monk dwells contemplating foulness in the body; he is percipient of repulsiveness in food; he is percipient of non-delight in the whole world; he dwells contemplating impermanence in all fabrications; and mindfulness of death is well-established within him.\"\n\n\"Monks, if these five qualities do not abandon any monk who is weak and ill, this is to be expected of him: 'Not long from now, through the destruction of the taints, having realized for himself through direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, he will abide therein.'\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෛශාලියෙහි, මහා වනයෙහි, කූටාගාර ශාලාවෙහි වැඩ වාසය කළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි නිශ්ශබ්ද භාවනා ස්ථානයෙන් නැගිට, යම් තැනක ගිලන් හල තිබුණේද, එතැනට වැඩම කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ එක්තරා දුර්වල වූ ගිලන් භික්ෂුවක් දැක, උන්වහන්සේ දැක, පනවන ලද අසුනෙහි වැඩ සිටියේය. වැඩ සිට භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කළ සේක: “මහණෙනි, යම් කිසි දුර්වල වූ ගිලන් භික්ෂුවක් අත් නොහරින පස් ධර්මයක් ඇත්තේ නම්, ඔහුගෙන් මෙය බලාපොරොත්තු විය යුතුය: ‘වැඩි කලක් නොගොස්ම කෙලෙස් ක්ෂය වීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට වාසය කරනු ඇත.’ ” “ඒ පස් ධර්මය කුමක්ද?” “මහණෙනි, මෙහිලා භික්ෂුව කය අසුභ වශයෙන් මෙනෙහි කරමින් වාසය කරයි. ආහාරයෙහි පිළිකුල් සංඥාව ඇතිව වාසය කරයි. සියලු ලෝකයෙහි ඇල්මක් නැති සංඥාව ඇතිව වාසය කරයි. සියලු සංස්කාරයන් අනිත්‍ය වශයෙන් මෙනෙහි කරමින් වාසය කරයි. මරණ සංඥාවද ඔහුට අභ්‍යන්තරයෙන් මැනවින් පිහිටා තිබේ.” “මහණෙනි, යම් කිසි දුර්වල වූ ගිලන් භික්ෂුවක් මේ පස් ධර්මය අත් නොහරින්නේ නම්, ඔහුගෙන් මෙය බලාපොරොත්තු විය යුතුය: ‘වැඩි කලක් නොගොස්ම කෙලෙස් ක්ෂය වීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට වාසය කරනු ඇත’ යනුවෙනි.” පළමුවන සූත්‍රයයි.",
      "paliTitle": "Gilānasuttaṃ"
    },
    {
      "number": 122,
      "pali": "‘‘Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā pañca dhamme bhāveti pañca dhamme bahulīkaroti, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā. ‘‘Katame pañca? Idha, bhikkhave, bhikkhuno ajjhattaññeva sati sūpaṭṭhitā hoti dhammānaṃ udayatthagāminiyā paññāya, asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratasaññī, sabbasaṅkhāresu aniccānupassī. Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā ime pañca dhamme bhāveti ime pañca dhamme bahulīkaroti, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Dutiyaṃ.",
      "english": "Indeed, monks, any monk or nun who cultivates and repeatedly practices these five qualities, for them one of two fruits may be expected: either final knowledge in this very life, or non-returning with a remainder of clinging.\n\nWhich five? Here, monks, a monk's mindfulness is well-established internally, accompanied by wisdom discerning the origination and dissolution of phenomena; he abides contemplating the unattractiveness of the body; he has the perception of repulsiveness in food; he has the perception of disenchantment with the entire world; he contemplates impermanence in all conditioned phenomena. Indeed, monks, any monk or nun who cultivates and repeatedly practices these five qualities, for them one of two fruits may be expected: either final knowledge in this very life, or non-returning with a remainder of clinging.",
      "sinhala": "භික්ෂූණි, යම්කිසි භික්ෂුවක් හෝ භික්ෂුණියක් මේ ධර්ම පස දියුණු කරයිද, මේ ධර්ම පස බහුල වශයෙන් පුරුදු කරයිද, ඔහුට හෝ ඇයට ඵල දෙකෙන් එකක් අපේක්ෂා කළ හැකියි. එනම්, මේ දැක්වෙන ධර්මය තුළදීම අරහත්වය අවබෝධ කර ගැනීම හෝ, යම්කිසි උපධි ශේෂයක් ඉතිරිව ඇත්නම්, අනාගාමී ඵලයයි.\n\nඒ ධර්ම පස කවරේද? මහණෙනි, මෙහිලා භික්ෂුවකට තමා තුළම, ධර්මයන්ගේ ඇතිවීම හා නැතිවීම දකින ප්‍රඥාව සහිතව සිහිය මනාව පිහිටුවාගෙන සිටී. හෙතෙම කයෙහි අශුභානුපස්සීව වාසය කරයි. ආහාරයෙහි පිළිකුල් සංඥාවෙන් යුක්ත වෙයි. සියලු ලෝකයෙහි නොඇලීම පිළිබඳ සංඥාවෙන් යුක්ත වෙයි. සියලු සංස්කාරයන් අනිත්‍ය වශයෙන් දකිමින් වාසය කරයි.\n\nමහණෙනි, යම්කිසි භික්ෂුවක් හෝ භික්ෂුණියක් මේ ධර්ම පස දියුණු කරයිද, මේ ධර්ම පස බහුල වශයෙන් පුරුදු කරයිද, ඔහුට හෝ ඇයට ඵල දෙකෙන් එකක් අපේක්ෂා කළ හැකියි. එනම්, මේ දැක්වෙන ධර්මය තුළදීම අරහත්වය අවබෝධ කර ගැනීම හෝ, යම්කිසි උපධි ශේෂයක් ඉතිරිව ඇත්නම්, අනාගාමී ඵලයයි.",
      "paliTitle": "Satisūpaṭṭhitasuttaṃ"
    },
    {
      "number": 123,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato gilāno dūpaṭṭhāko [dupaṭṭhāko (syā. kaṃ. pī. ka.) mahāva. 366] hoti. Katamehi pañcahi? Asappāyakārī hoti, sappāye mattaṃ na jānāti, bhesajjaṃ nappaṭisevitā hoti, atthakāmassa gilānupaṭṭhākassa na yathābhūtaṃ ābādhaṃ āvikattā hoti abhikkamantaṃ vā abhikkamatīti paṭikkamantaṃ vā paṭikkamatīti ṭhitaṃ vā ṭhitoti, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ [tippānaṃ (sī.) mahāva. 366] kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ anadhivāsakajātiko hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato gilāno dūpaṭṭhāko hoti. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato gilāno sūpaṭṭhāko hoti. Katamehi pañcahi? Sappāyakārī hoti, sappāye mattaṃ jānāti, bhesajjaṃ paṭisevitā hoti, atthakāmassa gilānupaṭṭhākassa yathābhūtaṃ ābādhaṃ āvikattā hoti abhikkamantaṃ vā abhikkamatīti paṭikkamantaṃ vā paṭikkamatīti ṭhitaṃ vā ṭhitoti, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato gilāno sūpaṭṭhāko hotī’’ti. Tatiyaṃ.",
      "english": "Monks, a sick person endowed with five qualities is difficult to nurse. Which five?\n\nHe does what is unsuitable for his condition; he does not know the proper measure of suitable things; he does not take his medicine; he does not reveal his ailment as it truly is to the nurse who desires his welfare, whether it is progressing, receding, or stable; and he is not of the kind who can endure the bodily feelings that have arisen—painful, severe, sharp, bitter, disagreeable, unpleasant, and life-threatening. Monks, a sick person endowed with these five qualities is difficult to nurse.\n\nMonks, a sick person endowed with five qualities is easy to nurse. Which five?\n\nHe does what is suitable for his condition; he knows the proper measure of suitable things; he takes his medicine; he reveals his ailment as it truly is to the nurse who desires his welfare, stating whether it is progressing, receding, or stable; and he is of the kind who can endure the bodily feelings that have arisen—painful, severe, sharp, bitter, disagreeable, unpleasant, and life-threatening. Monks, a sick person endowed with these five qualities is easy to nurse.",
      "sinhala": "භික්‍ෂූණි, කරුණු පහකින් යුක්ත වූ රෝගියාට උපස්\\u200Dථාන කිරීම අපහසු වේ. කවර කරුණු පහකින්ද? ඔහු නුසුදුසු දේ කරන්නෙක් වෙයි. සුදුසු දේ ප්‍රමාණයට (ප්\\u200Dරමාණයට) නොදන්නේය. බෙහෙත් නොගන්නෙක් වෙයි. තමන්ට යහපත කැමති උපස්\\u200Dථායකයාට, රෝගය වැඩිවන විට එය වැඩිවන බවද, අඩුවන විට එය අඩුවන බවද, එලෙසම පවතින විට එලෙසම පවතින බවද සත්\\u200Dය (සත්\\u200Dය) ලෙස නොපෙන්වයි. තවද, ඇතිවන ශාරීරික වේදනා, දුක්, තීව්‍ර (තීව්\\u200Dර), රළු, තද, අප්‍රිය (අප්\\u200Dරිය), අමනාප, ජීවිතයට හානිකර ස්\\u200Dවභාවයෙන් (ස්\\u200Dවභාවයෙන්) යුක්ත වුවද, ඒවා ඉවසිය නොහැකි ස්\\u200Dවභාවයෙන් (ස්\\u200Dවභාවයෙන්) යුක්\\u200Dත වූවෙක් වෙයි. භික්‍ෂූණි, මේ කරුණු පහෙන් යුක්\\u200Dත වූ රෝගියාට උපස්\\u200Dථාන කිරීම අපහසු වේ.\n\nභික්‍ෂූණි, කරුණු පහකින් යුක්\\u200Dත වූ රෝගියාට උපස්\\u200Dථාන කිරීම පහසු වේ. කවර කරුණු පහකින්ද? ඔහු සුදුසු දේ කරන්නෙක් වෙයි. සුදුසු දේ ප්‍රමාණය (ප්\\u200Dරමාණය) දන්නේය. බෙහෙත් ගන්නෙක් වෙයි. තමන්ට යහපත කැමති උපස්\\u200Dථායකයාට, රෝගය වැඩිවන විට එය වැඩිවන බවද, අඩුවන විට එය අඩුවන බවද, එලෙසම පවතින විට එලෙසම පවතින බවද සත්\\u200Dය (සත්\\u200Dය) ලෙස පෙන්වයි. තවද, ඇතිවන ශාරීරික වේදනා, දුක්, තීව්‍ර (තීව්\\u200Dර), රළු, තද, අප්‍රිය (අප්\\u200Dරිය), අමනාප, ජීවිතයට හානිකර ස්\\u200Dවභාවයෙන් (ස්\\u200Dවභාවයෙන්) යුක්ත වුවද, ඒවා ඉවසිය හැකි ස්\\u200Dවභාවයෙන් (ස්\\u200Dවභාවයෙන්) යුක්\\u200Dත වූවෙක් වෙයි. භික්‍ෂූණි, මේ කරුණු පහෙන් යුක්\\u200Dත වූ රෝගියාට උපස්\\u200Dථාන කිරීම පහසු වේ.",
      "paliTitle": "Paṭhamaupaṭṭhākasuttaṃ"
    },
    {
      "number": 124,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato gilānupaṭṭhāko nālaṃ gilānaṃ upaṭṭhātuṃ. Katamehi pañcahi? Nappaṭibalo hoti bhesajjaṃ saṃvidhātuṃ; sappāyāsappāyaṃ na jānāti, asappāyaṃ upanāmeti, sappāyaṃ apanāmeti; āmisantaro gilānaṃ upaṭṭhāti, no mettacitto; jegucchī hoti uccāraṃ vā passāvaṃ vā vantaṃ vā kheḷaṃ vā nīharituṃ; nappaṭibalo hoti gilānaṃ kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ [samādāpetuṃ (?) mahāva. 366] samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato gilānupaṭṭhāko nālaṃ gilānaṃ upaṭṭhātuṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato gilānupaṭṭhāko alaṃ gilānaṃ upaṭṭhātuṃ. Katamehi pañcahi? Paṭibalo hoti bhesajjaṃ saṃvidhātuṃ; sappāyāsappāyaṃ jānāti, asappāyaṃ apanāmeti, sappāyaṃ upanāmeti; mettacitto gilānaṃ upaṭṭhāti, no āmisantaro; ajegucchī hoti uccāraṃ vā passāvaṃ vā vantaṃ vā kheḷaṃ vā nīharituṃ; paṭibalo hoti gilānaṃ kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato gilānupaṭṭhāko alaṃ gilānaṃ upaṭṭhātu’’nti. Catutthaṃ.",
      "english": "Monks, an attendant for the sick endowed with five qualities is not fit to look after the sick. Which five? He is not capable of preparing medicine; he does not know what is suitable and what is unsuitable, so he provides what is unsuitable and withholds what is suitable; he attends to the sick person with a mind focused on material gain, not with a mind of loving-kindness; he is squeamish about removing excrement, urine, vomit, or spittle; he is not capable of instructing, encouraging, inspiring, and gladdening the sick person with Dhamma talk from time to time. Monks, an attendant for the sick endowed with these five qualities is not fit to look after the sick.\n\nMonks, an attendant for the sick endowed with five qualities is fit to look after the sick. Which five? He is capable of preparing medicine; he knows what is suitable and what is unsuitable, so he withholds what is unsuitable and provides what is suitable; he attends to the sick person with a mind of loving-kindness, not with a mind focused on material gain; he is not squeamish about removing excrement, urine, vomit, or spittle; he is capable of instructing, encouraging, inspiring, and gladdening the sick person with Dhamma talk from time to time. Monks, an attendant for the sick endowed with these five qualities is fit to look after the sick.",
      "sinhala": "භික්ෂූණි, මේ ධර්‍ම කරුණු පහකින් යුක්ත වූ ගිලන් උපස්ථායකයා ගිලනාට උපස්ථාන කිරීමට සුදුසු නොවේ. ඒ කවර පහකින් ද? බෙහෙත් පිළියෙළ කිරීමට සමත් නොවේ; සුදුසු දේ හා අසුදුසු දේ නොදන්නේය, අසුදුසු දේ ගෙන එන්නේය, සුදුසු දේ ඉවත් කරන්නේය; ආමිස ලාභ බලාපොරොත්තුවෙන් ගිලනාට උපස්ථාන කරන්නේය, මෙත් සිතිනොව; මළ හෝ මුත්‍රා හෝ වමනය හෝ කෙළ හෝ ඉවත් කිරීමට පිළිකුල් කරන්නේය; කලින් කලට ගිලනාට ධර්‍ම කථාවෙන් පෙන්වා දීමට, සමාදන් කරවීමට, උනන්දු කරවීමට, සතුටු කරවීමට සමත් නොවේ. භික්ෂූණි, මේ ධර්‍ම කරුණු පහකින් යුක්ත වූ ගිලන් උපස්ථායකයා ගිලනාට උපස්ථාන කිරීමට සුදුසු නොවේ.\n\nභික්ෂූණි, මේ ධර්‍ම කරුණු පහකින් යුක්ත වූ ගිලන් උපස්ථායකයා ගිලනාට උපස්ථාන කිරීමට සුදුසු වේ. ඒ කවර පහකින් ද? බෙහෙත් පිළියෙළ කිරීමට සමත් වේ; සුදුසු දේ හා අසුදුසු දේ දන්නේය, අසුදුසු දේ ඉවත් කරන්නේය, සුදුසු දේ ගෙන එන්නේය; මෙත් සිතින ගිලනාට උපස්ථාන කරන්නේය, ආමිස ලාභ බලාපොරොත්තුවෙන් නොව; මළ හෝ මුත්‍රා හෝ වමනය හෝ කෙළ හෝ ඉවත් කිරීමට පිළිකුල් නොකරන්නේය; කලින් කලට ගිලනාට ධර්‍ම කථාවෙන් පෙන්වා දීමට, සමාදන් කරවීමට, උනන්දු කරවීමට, සතුටු කරවීමට සමත් වේ. භික්ෂූණි, මේ ධර්‍ම කරුණු පහකින් යුක්ත වූ ගිලන් උපස්ථායකයා ගිලනාට උපස්ථාන කිරීමට සුදුසු වේ.",
      "paliTitle": "Dutiyaupaṭṭhākasuttaṃ"
    },
    {
      "number": 125,
      "pali": "‘‘Pañcime, bhikkhave, dhammā anāyussā. Katame pañca? Asappāyakārī hoti, sappāye mattaṃ na jānāti, apariṇatabhojī ca hoti, akālacārī ca hoti, abrahmacārī ca. Ime kho, bhikkhave, pañca dhammā anāyussā. ‘‘Pañcime, bhikkhave, dhammā āyussā. Katame pañca? Sappāyakārī hoti, sappāye mattaṃ jānāti, pariṇatabhojī ca hoti, kālacārī ca hoti, brahmacārī ca. Ime kho, bhikkhave, pañca dhammā āyussā’’ti. Pañcamaṃ.",
      "english": "Monastics, these five things are not conducive to longevity. Which five? One acts in ways that are unsuitable for one's well-being, does not know moderation in what is suitable, consumes food improperly, acts at inappropriate times, and does not observe chaste conduct. Indeed, monastics, these five things are not conducive to longevity.\n\nMonastics, these five things are conducive to longevity. Which five? One acts in ways that are suitable for one's well-being, knows moderation in what is suitable, consumes food properly, acts at appropriate times, and observes chaste conduct. Indeed, monastics, these five things are conducive to longevity.",
      "sinhala": "මහණෙනි, ආයුෂ කෙටි කරන කරුණු පසක් වෙති. කවරේද ඒ පස? අහිතකර දේ කරනසුලු වෙයි, හිතකර දේවල පමණ නොදනී, නොපැසුණු ආහාර වළඳන්නෙක් ද වෙයි, අකල්හි හැසිරෙන්නෙක් ද වෙයි, අබ්‍රහ්මචාරී ද වෙයි. මහණෙනි, සැබවින්ම මේ කරුණු පස ආයුෂ කෙටි කරන කරුණු වෙති.\n\nමහණෙනි, ආයුෂ වර්ධනය කරන කරුණු පසක් වෙති. කවරේද ඒ පස? හිතකර දේ කරනසුලු වෙයි, හිතකර දේවල පමණ දනී, පැසුණු ආහාර වළඳන්නෙක් ද වෙයි, කල්හි හැසිරෙන්නෙක් ද වෙයි, බ්‍රහ්මචාරී ද වෙයි. මහණෙනි, සැබවින්ම මේ කරුණු පස ආයුෂ වර්ධනය කරන කරුණු වෙති.",
      "paliTitle": "Paṭhamaanāyussāsuttaṃ"
    },
    {
      "number": 126,
      "pali": "‘‘Pañcime, bhikkhave, dhammā anāyussā. Katame pañca? Asappāyakārī hoti, sappāye mattaṃ na jānāti, apariṇatabhojī ca hoti, dussīlo ca, pāpamitto ca. Ime kho, bhikkhave, pañca dhammā anāyussā. ‘‘Pañcime, bhikkhave, dhammā āyussā. Katame pañca? Sappāyakārī hoti, sappāye mattaṃ jānāti, pariṇatabhojī ca hoti, sīlavā ca, kalyāṇamitto ca. Ime kho, bhikkhave, pañca dhammā āyussā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these five factors shorten life. Which five? One acts in unsuitable ways, one does not know moderation concerning what is suitable, one consumes without proper reflection, one is unvirtuous, and one has bad companions. Indeed, monks, these five factors shorten life.\n\nMonks, these five factors extend life. Which five? One acts in suitable ways, one knows moderation concerning what is suitable, one consumes with proper reflection, one is virtuous, and one has admirable companions. Indeed, monks, these five factors extend life.",
      "sinhala": "මහණෙනි, මේ ධ[ZWJ]ර්මතා පහක් ආයුෂ කෙටි වීමට හේතු වෙති. ඒ පහ කවරේද? අසප්පාය දේ ක[ZWJ]රන්නෙක් වෙයි, සප්පාය දේවල ප[ZWJ]රමාණය නොදනී, අජීර්ණ වන සේ වළඳන්නෙක් වෙයි, දුස්සීල කෙනෙක් වෙයි, පව් මිතුරන් ඇත්තෙක් වෙයි. මහණෙනි, සැබවින්ම මේ ධ[ZWJ]ර්මතා පහ ආයුෂ කෙටි වීමට හේතු වෙති.\n\nමහණෙනි, මේ ධ[ZWJ]ර්මතා පහක් ආයුෂ වැඩි වීමට හේතු වෙති. ඒ පහ කවරේද? සප්පාය දේ ක[ZWJ]රන්නෙක් වෙයි, සප්පාය දේවල ප[ZWJ]රමාණය දනී, හොඳින් දිරවන සේ වළඳන්නෙක් වෙයි, සීලවන්ත කෙනෙක් වෙයි, කල්‍යාණ මිතුරන් ඇත්තෙක් වෙයි. මහණෙනි, සැබවින්ම මේ ධ[ZWJ]ර්මතා පහ ආයුෂ වැඩි වීමට හේතු වෙති.",
      "paliTitle": "Dutiyaanāyussāsuttaṃ"
    },
    {
      "number": 127,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu nālaṃ saṅghamhā vapakāsituṃ [vi + apa + kāsituṃ = vapakāsituṃ]. Katamehi pañcahi? Idha, bhikkhave, bhikkhu asantuṭṭho hoti itarītarena cīvarena, asantuṭṭho hoti itarītarena piṇḍapātena, asantuṭṭho hoti itarītarena senāsanena, asantuṭṭho hoti itarītarena gilānappaccayabhesajjaparikkhārena, kāmasaṅkappabahulo ca viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu nālaṃ saṅghamhā vapakāsituṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ saṅghamhā vapakāsituṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu santuṭṭho hoti itarītarena cīvarena, santuṭṭho hoti itarītarena piṇḍapātena, santuṭṭho hoti itarītarena senāsanena, santuṭṭho hoti itarītarena gilānappaccayabhesajjaparikkhārena, nekkhammasaṅkappabahulo [na kāmasaṅkappabahulo (ka.)] ca viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu alaṃ saṅghamhā vapakāsitu’’nti. Sattamaṃ.",
      "english": "O monks, a monk endowed with five qualities is not fit to live apart from the Sangha. Which five? Here, O monks, a monk is discontent with whatever robes he gets, discontent with whatever almsfood he gets, discontent with whatever lodging he gets, discontent with whatever requisites of medicine and support for the sick he gets, and he dwells predominantly with thoughts of sensual desire. Truly, O monks, a monk endowed with these five qualities is not fit to live apart from the Sangha.\n\nO monks, a monk endowed with five qualities is fit to live apart from the Sangha. Which five? Here, O monks, a monk is content with whatever robes he gets, content with whatever almsfood he gets, content with whatever lodging he gets, content with whatever requisites of medicine and support for the sick he gets, and he dwells predominantly with thoughts of renunciation. Truly, O monks, a monk endowed with these five qualities is fit to live apart from the Sangha.",
      "sinhala": "භික්‍ෂූණි, කරුණු පහකින් යුක්ත භික්‍ෂුවක් සංඝයෙන් වෙන්වීමට සමත් නොවන්නේය. ඒ කරුණු පහ කවරේද? භික්‍ෂූණි, මෙහිලා, භික්‍ෂුවක් ලැබෙන ලැබෙන සිවුරෙන් සතුටු නොවන්නේය. ලැබෙන ලැබෙන පිණ්ඩපාතයෙන් සතුටු නොවන්නේය. ලැබෙන ලැබෙන සේනාසනයෙන් සතුටු නොවන්නේය. ලැබෙන ලැබෙන ගිලන්පස බෙහෙත් පිරිකරෙන් සතුටු නොවන්නේය. තවද, කාමසංකල්පනා බහුලව වාසය කරන්නේය. භික්‍ෂූණි, මේ පස් කරුණෙන් යුක්ත භික්‍ෂුව සංඝයෙන් වෙන්වීමට සමත් නොවන්නේය.\n\nභික්‍ෂූණි, කරුණු පහකින් යුක්ත භික්‍ෂුවක් සංඝයෙන් වෙන්වීමට සමත් වන්නේය. ඒ කරුණු පහ කවරේද? භික්‍ෂූණි, මෙහිලා, භික්‍ෂුවක් ලැබෙන ලැබෙන සිවුරෙන් සතුටු වන්නේය. ලැබෙන ලැබෙන පිණ්ඩපාතයෙන් සතුටු වන්නේය. ලැබෙන ලැබෙන සේනාසනයෙන් සතුටු වන්නේය. ලැබෙන ලැබෙන ගිලන්පස බෙහෙත් පිරිකරෙන් සතුටු වන්නේය. තවද, නෙක්ඛම්ම සංකල්පනා බහුලව වාසය කරන්නේය. භික්‍ෂූණි, මේ පස් කරුණෙන් යුක්ත භික්‍ෂුව සංඝයෙන් වෙන්වීමට සමත් වන්නේය.",
      "paliTitle": "Vapakāsasuttaṃ"
    },
    {
      "number": 128,
      "pali": "‘‘Pañcimāni, bhikkhave, samaṇadukkhāni. Katamāni pañca? Idha, bhikkhave, bhikkhu asantuṭṭho hoti itarītarena cīvarena, asantuṭṭho hoti itarītarena piṇḍapātena, asantuṭṭho hoti itarītarena senāsanena, asantuṭṭho hoti itarītarena gilānappaccayabhesajjaparikkhārena, anabhirato ca brahmacariyaṃ carati. Imāni kho, bhikkhave, pañca samaṇadukkhāni. ‘‘Pañcimāni, bhikkhave, samaṇasukhāni. Katamāni pañca? Idha, bhikkhave, bhikkhu santuṭṭho hoti itarītarena cīvarena, santuṭṭho hoti itarītarena piṇḍapātena, santuṭṭho hoti itarītarena senāsanena, santuṭṭho hoti itarītarena gilānappaccayabhesajjaparikkhārena, abhirato ca brahmacariyaṃ carati. Imāni kho, bhikkhave, pañca samaṇasukhānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five sufferings of a recluse. Which five? Here, monks, a bhikkhu is discontent with whatever robes he receives, discontent with whatever alms-food he receives, discontent with whatever lodging he receives, discontent with whatever medicinal requisites for the sick he receives, and leads the spiritual life joylessly. These, monks, are the five sufferings of a recluse.\n\nMonks, there are these five happinesses of a recluse. Which five? Here, monks, a bhikkhu is content with whatever robes he receives, content with whatever alms-food he receives, content with whatever lodging he receives, content with whatever medicinal requisites for the sick he receives, and leads the spiritual life with joy. These, monks, are the five happinesses of a recluse.",
      "sinhala": "මහණෙනි, මේ ශ්‍රමණයකුගේ දුක් පහකි. කවරේද ඒ පහ?\nමහණෙනි, මෙහිලා භික්ෂුවක් කිසිදු සිවුරකින් සතුටු නොවේ. කිසිදු පිණ්ඩපාතයකින් සතුටු නොවේ. කිසිදු සේනාසනයකින් සතුටු නොවේ. කිසිදු ගිලන්පස බේත්හේත් පිරිකරකින් සතුටු නොවේ. තවද, බ්‍රහ්මචාරී ජීවිතයෙහි සතුටක් නොලබමින් හැසිරේ.\nමහණෙනි, මේවා ශ්‍රමණයකුගේ දුක් පහයි.\n\nමහණෙනි, මේ ශ්‍රමණයකුගේ සැප පහකි. කවරේද ඒ පහ?\nමහණෙනි, මෙහිලා භික්ෂුවක් කිසිදු සිවුරකින් සතුටු වේ. කිසිදු පිණ්ඩපාතයකින් සතුටු වේ. කිසිදු සේනාසනයකින් සතුටු වේ. කිසිදු ගිලන්පස බේත්හේත් පිරිකරකින් සතුටු වේ. තවද, බ්‍රහ්මචාරී ජීවිතයෙහි සතුටු වෙමින් හැසිරේ.\nමහණෙනි, මේවා ශ්‍රමණයකුගේ සැප පහයි.",
      "paliTitle": "Samaṇasukhasuttaṃ"
    },
    {
      "number": 129,
      "pali": "‘‘Pañcime, bhikkhave, āpāyikā nerayikā parikuppā atekicchā. Katame pañca? Mātā [mātaraṃ (ka.)] jīvitā voropitā hoti, pitā [pitaraṃ (ka.)] jīvitā voropito [voropitā (ka.)] hoti, arahaṃ [arahantaṃ (ka.), arahā (syā.)] jīvitā voropito hoti, tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ hoti, saṅgho bhinno hoti. Ime kho, bhikkhave, pañca āpāyikā nerayikā parikuppā atekicchā’’ti. Navamaṃ.",
      "english": "Monks, these five individuals are destined for states of woe, destined for hell, irrevocably defiled, and beyond remedy. Which five? One who has deprived a mother of life, one who has deprived a father of life, one who has deprived an Arahant of life, one who has caused the blood of a Tathāgata to flow with malicious intent, and one who has created a schism in the Saṅgha. These five individuals, monks, are indeed destined for states of woe, destined for hell, irrevocably defiled, and beyond remedy.",
      "sinhala": "භික්ෂූනි, මේ පස්දෙනා අපායට වැටෙන්නෝය, නිරයට වැටෙන්නෝය, පිරිහීමට ලක්වූවෝය, ප්‍‌රතිකාර කළ නොහැකි වූවෝය. කවරහුද ඒ පස්දෙනා?\n\nමව ජීවිතක්ෂයට පත් කළ තැනැත්තා, පියා ජීවිතක්ෂයට පත් කළ තැනැත්තා, රහතන් වහන්සේ නමක් ජීවිතක්ෂයට පත් කළ තැනැත්තා, තථාගතයන් වහන්සේගේ ශරීරයෙන් ද්වේෂ සහගත සිතින් ලේ හෙළූ තැනැත්තා, සංඝ භේදය ඇති කළ තැනැත්තා යන මේ පස්දෙනාය. භික්ෂූනි, මේ පස්දෙනා අපායට වැටෙන්නෝය, නිරයට වැටෙන්නෝය, පිරිහීමට ලක්වූවෝය, ප්‍‌රතිකාර කළ නොහැකි වූවෝය.",
      "paliTitle": "Parikuppasuttaṃ"
    },
    {
      "number": 130,
      "pali": "‘‘Pañcimāni, bhikkhave, byasanāni. Katamāni pañca? Ñātibyasanaṃ, bhogabyasanaṃ, rogabyasanaṃ, sīlabyasanaṃ, diṭṭhibyasanaṃ. Na, bhikkhave, sattā ñātibyasanahetu vā bhogabyasanahetu vā rogabyasanahetu vā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Sīlabyasanahetu vā, bhikkhave, sattā diṭṭhibyasanahetu vā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Imāni kho, bhikkhave, pañca byasanāni. ‘‘Pañcimā, bhikkhave, sampadā. Katamā pañca? Ñātisampadā, bhogasampadā, ārogyasampadā, sīlasampadā, diṭṭhisampadā. Na, bhikkhave, sattā ñātisampadāhetu vā bhogasampadāhetu vā ārogyasampadāhetu vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sīlasampadāhetu vā, bhikkhave, sattā diṭṭhisampadāhetu vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Imā kho, bhikkhave, pañca sampadā’’ti. Dasamaṃ. ",
      "english": "Monks, there are these five misfortunes. Which five? Misfortune concerning relatives, misfortune concerning wealth, misfortune concerning health, misfortune concerning morality, and misfortune concerning view. Monks, beings do not, because of misfortune concerning relatives, or because of misfortune concerning wealth, or because of misfortune concerning health, reappear in the lower realms, a bad destination, a state of woe, or hell at the breaking up of the body, after death. But, monks, it is because of misfortune concerning morality or misfortune concerning view that beings, at the breaking up of the body, after death, reappear in the lower realms, a bad destination, a state of woe, or hell. Indeed, monks, these are the five misfortunes.\n\nMonks, there are these five accomplishments. Which five? Accomplishment concerning relatives, accomplishment concerning wealth, accomplishment concerning health, accomplishment concerning morality, and accomplishment concerning view. Monks, beings do not, because of accomplishment concerning relatives, or because of accomplishment concerning wealth, or because of accomplishment concerning health, reappear in a good destination or a heavenly world at the breaking up of the body, after death. But, monks, it is because of accomplishment concerning morality or accomplishment concerning view that beings, at the breaking up of the body, after death, reappear in a good destination or a heavenly world. Indeed, monks, these are the five accomplishments.",
      "sinhala": "‘‘මහණෙනි, මේ විපත්ති පසකි. කවරේද ඒ පස? ඥාති විපත්තිය, භෝග විපත්තිය, රෝග විපත්තිය, සීල විපත්තිය, දෘෂ්ටි විපත්තිය. මහණෙනි, සත්ත්වයෝ ඥාති විපත්තිය හේතු කොටගෙන හෝ භෝග විපත්තිය හේතු කොටගෙන හෝ රෝග විපත්තිය හේතු කොටගෙන හෝ කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්හි උපත නොලබති. මහණෙනි, සත්ත්වයෝ සීල විපත්තිය හේතු කොටගෙන හෝ දෘෂ්ටි විපත්තිය හේතු කොටගෙන හෝ කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්හි උපත ලබති. මහණෙනි, මේ විපත්ති පස නම් මේවාය.\nමහණෙනි, මේ සම්පත් පසකි. කවරේද ඒ පස? ඥාති සම්පත්තිය, භෝග සම්පත්තිය, ආරෝ ග්‍ ය සම්පත්තිය, සීල සම්පත්තිය, දෘෂ්ටි සම්පත්තිය. මහණෙනි, සත්ත්වයෝ ඥාති සම්පත්තිය හේතු කොටගෙන හෝ භෝග සම්පත්තිය හේතු කොටගෙන හෝ ආරෝ ග්‍ ය සම්පත්තිය හේතු කොටගෙන හෝ කය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයන්හි උපත නොලබති. මහණෙනි, සත්ත්වයෝ සීල සම්පත්තිය හේතු කොටගෙන හෝ දෘෂ්ටි සම්පත්තිය හේතු කොටගෙන හෝ කය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයන්හි උපත ලබති. මහණෙනි, මේ සම්පත් පස නම් මේවාය.",
      "paliTitle": "Byasanasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Gilānavaggo tatiyo. Tassuddānaṃ – Gilāno satisūpaṭṭhi, dve upaṭṭhākā duvāyusā; Vapakāsasamaṇasukhā, parikuppaṃ byasanena cāti.",
    "english": "",
    "sinhala": ""
  }
}