{
  "id": "an5.17",
  "title": {
    "pali": "Āghātavaggo",
    "english": "The Chapter on Ill-will",
    "sinhala": "ආඝාත වග්ගය"
  },
  "sections": [
    {
      "number": 161,
      "pali": "‘‘Pañcime, bhikkhave, āghātapaṭivinayā yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo. Katame pañca? Yasmiṃ, bhikkhave, puggale āghāto jāyetha, mettā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, karuṇā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, upekkhā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, asatiamanasikāro tasmiṃ puggale āpajjitabbo; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, kammassakatā tasmiṃ puggale adhiṭṭhātabbā – ‘kammassako ayamāyasmā kammadāyādo kammayoni kammabandhu kammappaṭisaraṇo, yaṃ kammaṃ karissati kalyāṇaṃ vā pāpakaṃ vā tassa dāyādo bhavissatī’ti; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Ime kho, bhikkhave, pañca āghātapaṭivinayā, yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five ways to sublimate resentment, by which a monk should completely dispel any resentment that has arisen. What are these five?\n\nMonks, regarding any person in whom resentment arises, loving-kindness should be developed towards that person; in this way, resentment towards that person should be dispelled. Monks, regarding any person in whom resentment arises, compassion should be developed towards that person; in this way, resentment towards that person should be dispelled. Monks, regarding any person in whom resentment arises, equanimity should be developed towards that person; in this way, resentment towards that person should be dispelled. Monks, regarding any person in whom resentment arises, non-attention to the fault should be applied towards that person; in this way, resentment towards that person should be dispelled. Monks, regarding any person in whom resentment arises, reflection on the ownership of kamma should be established towards that person: ‘This venerable one is the owner of his kamma, the heir to his kamma, born of his kamma, related by his kamma, and supported by his kamma. Whatever kamma he performs, whether good or bad, he will be the heir to that.’ In this way, resentment towards that person should be dispelled.\n\nIndeed, Monks, these are the five ways to sublimate resentment, by which a monk should completely dispel any resentment that has arisen.",
      "sinhala": "භික්ෂූණි, භික්ෂුවකට ඇතිවන තරහව සම්පූර්ණයෙන්ම දුරු කළ යුතු, තරහව සංසිඳුවන ක‍්‍රම පහක් මේවාය. ඒ පහ කවරේද?\n\nභික්ෂූණි, යම් පුද්ගලයකු කෙරෙහි තරහව හටගනීද, එම පුද්ගලයා කෙරෙහි මෛත‍්‍රිය වඩන්නට ඕනෑය. මෙලෙස එම පුද්ගලයා කෙරෙහි ඇති තරහව සංසිඳුවිය යුතුය.\n\nභික්ෂූණි, යම් පුද්ගලයකු කෙරෙහි තරහව හටගනීද, එම පුද්ගලයා කෙරෙහි කරුණාව වඩන්නට ඕනෑය. මෙලෙස එම පුද්ගලයා කෙරෙහි ඇති තරහව සංසිඳුවිය යුතුය.\n\nභික්ෂූණි, යම් පුද්ගලයකු කෙරෙහි තරහව හටගනීද, එම පුද්ගලයා කෙරෙහි උපේක්ෂාව වඩන්නට ඕනෑය. මෙලෙස එම පුද්ගලයා කෙරෙහි ඇති තරහව සංසිඳුවිය යුතුය.\n\nභික්ෂූණි, යම් පුද්ගලයකු කෙරෙහි තරහව හටගනීද, එම පුද්ගලයා සිහියට නොගෙන සිටිය යුතුය. මෙලෙස එම පුද්ගලයා කෙරෙහි ඇති තරහව සංසිඳුවිය යුතුය.\n\nභික්ෂූණි, යම් පුද්ගලයකු කෙරෙහි තරහව හටගනීද, එම පුද්ගලයා කෙරෙහි කර්මයකත්වය අරමුණු කළ යුතුය – ‘මේ ආයුෂ්මත් කර්මයට හිමිය, කර්මයම දායාද කොට ඇත්තෙකි, කර්මයෙන්ම උපන්නෙකි, කර්මයම නෑයකු කොට ඇත්තෙකි, කර්මයම පිහිට කොට ඇත්තෙකි. යම් කුසල හෝ අකුසල කර්මයක් කරන්නේද, ඔහු එහි දායාදකයා වන්නේය’ කියාය. මෙලෙස එම පුද්ගලයා කෙරෙහි ඇති තරහව සංසිඳුවිය යුතුය.\n\nභික්ෂූණි, භික්ෂුවකට ඇතිවන තරහව සම්පූර්ණයෙන්ම දුරු කළ යුතු, තරහව සංසිඳුවන ක‍්‍රම පහක් මේවාමය.",
      "paliTitle": "Paṭhamaāghātapaṭivinayasuttaṃ",
      "englishTitle": "The First Discourse on Removing Resentment",
      "sinhalaTitle": "පළමු ආඝාතපටිවිනය සූත්‍රය"
    },
    {
      "number": 162,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Pañcime, āvuso, āghātapaṭivinayā yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo. Katame pañca? Idhāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti parisuddhavacīsamācāro; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhavacīsamācāro hoti parisuddhakāyasamācāro; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti aparisuddhavacīsamācāro, labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti aparisuddhavacīsamācāro, na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro, labhati ca kālena vā kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. ‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro parisuddhavacīsamācāro, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, bhikkhu paṃsukūliko rathiyāya nantakaṃ disvā vāmena pādena niggaṇhitvā dakkhiṇena pādena pattharitvā [vitthāretvā (sī. pī.)], yo tattha sāro taṃ paripātetvā ādāya pakkameyya; evamevaṃ khvāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro parisuddhavacīsamācāro, yāssa aparisuddhakāyasamācāratā na sāssa tasmiṃ samaye manasi kātabbā, yā ca khvāssa parisuddhavacīsamācāratā sāssa tasmiṃ samaye manasi kātabbā. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo. ‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhavacīsamācāro parisuddhakāyasamācāro, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, pokkharaṇī sevālapaṇakapariyonaddhā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. So taṃ pokkharaṇiṃ ogāhetvā ubhohi hatthehi iticiti ca sevālapaṇakaṃ apaviyūhitvā añjalinā pivitvā pakkameyya. Evamevaṃ kho, āvuso, yvāyaṃ puggalo aparisuddhavacīsamācāro parisuddhakāyasamācāro, yāssa aparisuddhavacīsamācāratā na sāssa tasmiṃ samaye manasi kātabbā, yā ca khvāssa parisuddhakāyasamācāratā sāssa tasmiṃ samaye manasi kātabbā. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo. ‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, parittaṃ gopade [gopadake (sī. syā.)] udakaṃ. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. Tassa evamassa – ‘idaṃ kho parittaṃ gopade udakaṃ. Sacāhaṃ añjalinā vā pivissāmi bhājanena vā khobhessāmipi taṃ loḷessāmipi taṃ apeyyampi taṃ karissāmi. Yaṃnūnāhaṃ catukkuṇḍiko [catuguṇḍiko (sī.), catukuṇḍiko (syā. kaṃ. pī.), catukoṇḍiko (dī. ni. 3.7)] nipatitvā gopītakaṃ pivitvā pakkameyya’nti. So catukkuṇḍiko nipatitvā gopītakaṃ pivitvā pakkameyya. Evamevaṃ kho, āvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, yāssa aparisuddhakāyasamācāratā na sāssa tasmiṃ samaye manasi kātabbā; yāpissa aparisuddhavacīsamācāratā na sāpissa tasmiṃ samaye manasi kātabbā. Yañca kho so labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, tamevassa [tadevassa (sī. syā.)] tasmiṃ samaye manasi kātabbaṃ. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo. ‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, puriso ābādhiko dukkhito bāḷhagilāno addhānamaggappaṭipanno. Tassa puratopissa dūre gāmo pacchatopissa dūre gāmo. So na labheyya sappāyāni bhojanāni, na labheyya sappāyāni bhesajjāni, na labheyya patirūpaṃ upaṭṭhākaṃ, na labheyya gāmantanāyakaṃ. Tamenaṃ aññataro puriso passeyya addhānamaggappaṭipanno. So tasmiṃ purise kāruññaṃyeva upaṭṭhāpeyya, anuddayaṃyeva upaṭṭhāpeyya, anukampaṃyeva upaṭṭhāpeyya – ‘aho vatāyaṃ puriso labheyya sappāyāni bhojanāni, labheyya sappāyāni bhesajjāni, labheyya patirūpaṃ upaṭṭhākaṃ, labheyya gāmantanāyakaṃ! Taṃ kissa hetu? Māyaṃ [ayaṃ (ka.)] puriso idheva anayabyasanaṃ āpajjī’ti [āpajjeyya (ka.)]! Evamevaṃ kho, āvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, evarūpepi [evarūpe (pī.)], āvuso, puggale kāruññaṃyeva upaṭṭhāpetabbaṃ anuddayāyeva upaṭṭhāpetabbā anukampāyeva upaṭṭhāpetabbā – ‘aho vata ayamāyasmā kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveyya, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveyya, manoduccaritaṃ pahāya manosucaritaṃ bhāveyya! Taṃ kissa hetu? Māyaṃ āyasmā [ayamāyasmā (ka.)] kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjī’ti [upapajjatīti (ka.)]! Evaṃ tasmiṃ puggale āghāto paṭivinetabbo. ‘‘Tatrāvuso, yvāyaṃ puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, pokkharaṇī acchodakā sātodakā sītodakā [acchodikā sātodikā sītodikā (sī.)] setakā [setodakā (ka.)] supatitthā ramaṇīyā nānārukkhehi sañchannā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. So taṃ pokkharaṇiṃ ogāhetvā nhātvā ca pivitvā ca paccuttaritvā tattheva rukkhacchāyāya nisīdeyya vā nipajjeyya vā. Evamevaṃ kho, āvuso, yvāyaṃ puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, yāpissa parisuddhakāyasamācāratā sāpissa tasmiṃ samaye manasi kātabbā; yāpissa parisuddhavacīsamācāratā sāpissa tasmiṃ samaye manasi kātabbā; yampi labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, tampissa tasmiṃ samaye manasi kātabbaṃ. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Samantapāsādikaṃ, āvuso, puggalaṃ āgamma cittaṃ pasīdati. ‘‘Ime kho, āvuso, pañca āghātapaṭivinayā, yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo’’ti. Dutiyaṃ.",
      "english": "Then, indeed, Ven. Sāriputta addressed the monastics: \"Friends, monastics!\" \"Friend,\" those monastics replied to Ven. Sāriputta. Ven. Sāriputta then said this: \"Friends, there are these five ways of eliminating resentment, whereby a monastic's arisen resentment should be completely removed. Which five?\n\nHere, friends, some individual has impure bodily conduct but pure verbal conduct; even regarding such an individual, friends, resentment should be eliminated. But here, friends, some individual has impure verbal conduct but pure bodily conduct; even regarding such an individual, friends, resentment should be eliminated. But here, friends, some individual has impure bodily conduct and impure verbal conduct, yet from time to time attains an opening of mind, a clarity of mind; even regarding such an individual, friends, resentment should be eliminated. But here, friends, some individual has impure bodily conduct and impure verbal conduct, and does not from time to time attain an opening of mind, a clarity of mind; even regarding such an individual, friends, resentment should be eliminated. But here, friends, some individual has pure bodily conduct and pure verbal conduct, and from time to time attains an opening of mind, a clarity of mind; even regarding such an individual, friends, resentment should be eliminated.\n\n\"Now, friends, regarding that individual who has impure bodily conduct but pure verbal conduct, how should resentment be eliminated towards him? Just as, friends, a monastic who wears refuse-rag robes, seeing a piece of cloth on the road, would press it down with his left foot, spread it out with his right foot, and having removed what is rotten from it, would take what is sound and depart. In the same way, friends, regarding that individual who has impure bodily conduct but pure verbal conduct, his impure bodily conduct should not be taken into account at that time, but his pure verbal conduct should be taken into account at that time. Thus, resentment should be eliminated towards that individual.\n\n\"Now, friends, regarding that individual who has impure verbal conduct but pure bodily conduct, how should resentment be eliminated towards him? Just as, friends, there is a pond covered with moss and water plants. Then a man would come, afflicted by the heat, overcome by heat, weary, thirsty, parched. He would descend into that pond, and with both hands, he would push aside the moss and water plants here and there, drink with cupped hands, and then depart. In the same way, friends, regarding that individual who has impure verbal conduct but pure bodily conduct, his impure verbal conduct should not be taken into account at that time, but his pure bodily conduct should be taken into account at that time. Thus, resentment should be eliminated towards that individual.\n\n\"Now, friends, regarding that individual who has impure bodily conduct and impure verbal conduct, yet from time to time attains an opening of mind, a clarity of mind, how should resentment be eliminated towards him? Just as, friends, there is a small amount of water in a cow's footprint. Then a man would come, afflicted by the heat, overcome by heat, weary, thirsty, parched. He would think thus: ‘This is only a small amount of water in a cow's footprint. If I drink it with cupped hands or with a vessel, I might disturb it, stir it up, and make it undrinkable. What if I were to lie down on all fours and drink the water directly from the cow's footprint and then depart?’ So he would lie down on all fours, drink the water directly from the cow's footprint, and then depart. In the same way, friends, regarding that individual who has impure bodily conduct and impure verbal conduct, yet from time to time attains an opening of mind, a clarity of mind—his impure bodily conduct should not be taken into account at that time; nor should his impure verbal conduct be taken into account at that time. Rather, that opening of mind, that clarity of mind which he attains from time to time, that alone should be taken into account at that time. Thus, resentment should be eliminated towards that individual.\n\n\"Now, friends, regarding that individual who has impure bodily conduct and impure verbal conduct, and does not from time to time attain an opening of mind, a clarity of mind, how should resentment be eliminated towards him? Just as, friends, a man is sick, suffering, gravely ill, and has set out on a journey. Far ahead of him is a village, and far behind him is a village. He might not obtain suitable food, he might not obtain suitable medicine, he might not obtain a suitable attendant, he might not obtain one who guides him to the village. Another man travelling on the road would see him.\n\nTowards such a person, one should establish compassion, establish sympathetic concern, and establish empathy, thinking: ‘Oh, if only this person would obtain suitable food, obtain suitable medicine, obtain a suitable attendant, obtain a local helper! For what reason? So that this person may not come to ruin and misfortune right here!’ In the same way, friends, as for the person who is of impure bodily conduct and impure verbal conduct, and does not obtain from time to time mental clarity and tranquility, even towards such a person, friends, compassion should be established, sympathetic concern should be established, and empathy should be established, thinking: ‘Oh, if only this venerable one would abandon bodily misconduct and develop good bodily conduct, abandon verbal misconduct and develop good verbal conduct, abandon mental misconduct and develop good mental conduct! For what reason? So that this venerable one, with the breaking up of the body, after death, may not be reborn in a state of woe, a bad destination, a downfall, in hell!’ Thus, concerning that person, resentment should be overcome.\n\nBut friends, as for the person who is of pure bodily conduct and pure verbal conduct, and obtains from time to time mental clarity and tranquility, how should resentment towards that person be overcome? Just as, friends, there is a pond with clear, pleasant, cool, bright water, with well-made banks, delightful, and shaded by various trees. Then a man might come, oppressed by the heat, overcome by the heat, weary, thirsty, parched. He would descend into that pond, bathe and drink, then come out and sit or lie down right there in the shade of the trees. In the same way, friends, as for the person who is of pure bodily conduct and pure verbal conduct, and obtains from time to time mental clarity and tranquility—his pure bodily conduct should be kept in mind at that time; his pure verbal conduct should be kept in mind at that time; and also the fact that he obtains from time to time mental clarity and tranquility should be kept in mind at that time. Thus, concerning that person, resentment should be overcome. Friends, on account of a person who is entirely pleasing, the mind becomes clear and tranquil. These, friends, are the five ways to overcome resentment, by which a monk's arisen resentment should be completely overcome.",
      "sinhala": "එහිලා ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළහ: \"ඇවැත්නි, භික්ෂූනි!\" \"ඇවැත්නි!\"යි ඒ භික්ෂූහු ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මේ කාරණය වදාළහ: \"ඇවැත්නි, මෙහි වෛරය දුරු කිරීමේ ක්‍රම පසක් ඇත. යම් තැනක භික්ෂුවකට වෛරයක් උපදී ද, එය මුළුමනින්ම දුරු කළ යුතු ය. ඒ පස කවරේද? ඇවැත්නි, මෙහි ඇතැම් පුද්ගලයෙක් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ ය; වචනයෙන් කරන ක්‍රියා ශුද්ධ ය. ඇවැත්නි, මෙබඳු පුද්ගලයෙකු කෙරෙහි ද වෛරය දුරු කළ යුතු ය. ඇවැත්නි, තවත් ඇතැම් පුද්ගලයෙක් වචනයෙන් කරන ක්‍රියා අශුද්ධ ය; ශරීරයෙන් කරන ක්‍රියා ශුද්ධ ය. ඇවැත්නි, මෙබඳු පුද්ගලයෙකු කෙරෙහි ද වෛරය දුරු කළ යුතු ය. ඇවැත්නි, තවත් ඇතැම් පුද්ගලයෙක් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ ය; වචනයෙන් කරන ක්‍රියා අශුද්ධ ය. එහෙත් ඔහු විටින් විට සිතේ විවරවීමක් (පිරිසිදු බවක්), සිතේ පැහැදීමක් ලබයි. ඇවැත්නි, මෙබඳු පුද්ගලයෙකු කෙරෙහි ද වෛරය දුරු කළ යුතු ය. ඇවැත්නි, තවත් ඇතැම් පුද්ගලයෙක් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ ය; වචනයෙන් කරන ක්‍රියා අශුද්ධ ය. ඔහු විටින් විට සිතේ විවරවීමක්, සිතේ පැහැදීමක් නොලබයි. ඇවැත්නි, මෙබඳු පුද්ගලයෙකු කෙරෙහි ද වෛරය දුරු කළ යුතු ය. ඇවැත්නි, තවත් ඇතැම් පුද්ගලයෙක් ශරීරයෙන් කරන ක්‍රියා ශුද්ධ ය; වචනයෙන් කරන ක්‍රියා ශුද්ධ ය. ඔහු විටින් විට සිතේ විවරවීමක්, සිතේ පැහැදීමක් ලබයි. ඇවැත්නි, මෙබඳු පුද්ගලයෙකු කෙරෙහි ද වෛරය දුරු කළ යුතු ය.\n\n\"ඇවැත්නි, එසේ නම් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ වූත්, වචනයෙන් කරන ක්‍රියා ශුද්ධ වූත් යම් පුද්ගලයෙක් ඇත්ද, ඔහු කෙරෙහි වෛරය කෙසේ දුරු කළ යුතු ද? ඇවැත්නි, යම් සේ, පන්සූකූල සිවුරු අඳින භික්ෂුවක් පාරේ වැටී ඇති රෙදි කඩක් දැක, වම් පාදයෙන් එය පාගා, දකුණු පාදයෙන් එය විහිදා, එහි ඇති සාරය ඉවත් කරගෙන පිටත්ව යන්නේ ද, ඇවැත්නි, එපරිද්දෙන්ම, යම් පුද්ගලයෙක් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ වූත්, වචනයෙන් කරන ක්‍රියා ශුද්ධ වූත් ඇත්ද, ඔහුගේ අශුද්ධ ශරීර කර්මයන් ඒ අවස්ථාවේ දී මනසට නොගත යුතු ය. ඔහුගේ ශුද්ධ වූ වචී කර්මයන් ඒ අවස්ථාවේ දී මනසට ගත යුතු ය. මෙලෙසින් ඒ පුද්ගලයා කෙරෙහි වෛරය දුරු කළ යුතු ය.\n\n\"ඇවැත්නි, එසේ නම් වචනයෙන් කරන ක්‍රියා අශුද්ධ වූත්, ශරීරයෙන් කරන ක්‍රියා ශුද්ධ වූත් යම් පුද්ගලයෙක් ඇත්ද, ඔහු කෙරෙහි වෛරය කෙසේ දුරු කළ යුතු ද? ඇවැත්නි, යම් සේ, ජලජ පැළෑටි හා දියසෙවෙල් වලින් වැසී ගිය පොකුණක් ඇත්ද, එවිට අධික හිරු රශ්මියෙන් පීඩිත වූ, ග්‍රීෂ්මයෙන් වෙහෙසට පත් වූ, ක්ලාන්ත වූ, පිපාසිත වූ පුරුෂයෙක් පැමිණෙන්නේ ය. ඔහු ඒ පොකුණට බැස, දෙඅත්වලින් දියසෙවෙල් හා ජලජ පැළෑටි දෙපසට ඉවත් කර, අත්පොලෝවකින් ජලය පානය කොට පිටත්ව යන්නේ ය. ඇවැත්නි, එපරිද්දෙන්ම, යම් පුද්ගලයෙක් වචනයෙන් කරන ක්‍රියා අශුද්ධ වූත්, ශරීරයෙන් කරන ක්‍රියා ශුද්ධ වූත් ඇත්ද, ඔහුගේ අශුද්ධ වචී කර්මයන් ඒ අවස්ථාවේ දී මනසට නොගත යුතු ය. ඔහුගේ ශුද්ධ වූ කාය කර්මයන් ඒ අවස්ථාවේ දී මනසට ගත යුතු ය. මෙලෙසින් ඒ පුද්ගලයා කෙරෙහි වෛරය දුරු කළ යුතු ය.\n\n\"ඇවැත්නි, එසේ නම් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ වූත්, වචනයෙන් කරන ක්‍රියා අශුද්ධ වූත්, එහෙත් විටින් විට සිතේ විවරවීමක්, සිතේ පැහැදීමක් ලබන යම් පුද්ගලයෙක් ඇත්ද, ඔහු කෙරෙහි වෛරය කෙසේ දුරු කළ යුතු ද? ඇවැත්නි, යම් සේ, ගොනුන්ගේ කුර සටහනක ඉතා සුළු ජල ප්‍රමාණයක් ඇත්ද, එවිට අධික හිරු රශ්මියෙන් පීඩිත වූ, ග්‍රීෂ්මයෙන් වෙහෙසට පත් වූ, ක්ලාන්ත වූ, පිපාසිත වූ පුරුෂයෙක් පැමිණෙන්නේ ය. ඔහුට මෙසේ සිතෙන්නේ ය – 'මෙය ගොනුන්ගේ කුර සටහනක ඇති ඉතා සුළු ජල ප්‍රමාණයකි. මම අත්පොලෝවකින් හෝ පානය කරන්නෙම් නම්, බඳුනකින් හෝ එය කැලඹෙන්නේය, එය කැළඹෙන්නේය, පානය කළ නොහැකි තත්ත්වයට පත් කරන්නේය. ඒ නිසා මම සිව්පාවෙකු මෙන් වැතිරී, කුර සටහනේ ඇති ජලය පානය කොට යන්නෙමි' කියා. ඔහු සිව්පාවෙකු මෙන් වැතිරී, කුර සටහනේ ඇති ජලය පානය කොට පිටත්ව යන්නේ ය. ඇවැත්නි, එපරිද්දෙන්ම, යම් පුද්ගලයෙක් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ වූත්, වචනයෙන් කරන ක්‍රියා අශුද්ධ වූත්, එහෙත් විටින් විට සිතේ විවරවීමක්, සිතේ පැහැදීමක් ලබන ඇත්ද, ඔහුගේ අශුද්ධ ශරීර කර්මයන් ඒ අවස්ථාවේ දී මනසට නොගත යුතු ය; ඔහුගේ අශුද්ධ වචී කර්මයන් ද ඒ අවස්ථාවේ දී මනසට නොගත යුතු ය. යම් සිතේ විවරවීමක්, සිතේ පැහැදීමක් ඔහු විටින් විට ලබයි ද, ඒ කාරණයම ඒ අවස්ථාවේ දී මනසට ගත යුතු ය. මෙලෙසින් ඒ පුද්ගලයා කෙරෙහි වෛරය දුරු කළ යුතු ය.\n\n\"ඇවැත්නි, එසේ නම් ශරීරයෙන් කරන ක්‍රියා අශුද්ධ වූත්, වචනයෙන් කරන ක්‍රියා අශුද්ධ වූත්, විටින් විට සිතේ විවරවීමක්, සිතේ පැහැදීමක් නොලබන යම් පුද්ගලයෙක් ඇත්ද, ඔහු කෙරෙහි වෛරය කෙසේ දුරු කළ යුතු ද? ඇවැත්නි, යම් සේ, ආබාධිත වූ, දුකට පත් වූ, දැඩි ලෙස ගිලන් වූ පුරුෂයෙක් දුර ගමනක යෙදෙන්නේ ද. ඔහුට ඉදිරියෙන් ද ගමක් දුරින් ඇත, පසුපසින් ද ගමක් දුරින් ඇත. ඔහුට සුදුසු භෝජන නොලැබෙන්නේ ය, සුදුසු බෙහෙත් නොලැබෙන්නේ ය, සුදුසු උපස්ථායකයෙක් නොලැබෙන්නේ ය, ගමට යන මඟ පෙන්වන්නෙක් නොලැබෙන්නේ ය. එසේ මඟ ගමන් කරන ඔහු අන්‍ය පුරුෂයෙක් දකී.\n\nඔහු ඒ පුද්ගලයා කෙරෙහි කරුණාවම උපදවා ගන්නේය, අනුකම්පාවම උපදවා ගන්නේය, දයාවම උපදවා ගන්නේය – ‘අහෝ! මේ පුද්ගලයා සුදුසු භෝජන ලබන්නේ නම්, සුදුසු බෙහෙත් ලබන්නේ නම්, සුදුසු උපස්ථායකයෙක් ලබන්නේ නම්, ගම්‍යක්‍රමණයේදී මඟ පෙන්වන අයෙක් ලබන්නේ නම්! ඒ කුමන හේතුවක් නිසාද? මේ පුද්ගලයා මෙලොවදීම අනර්ථයට, විපතට පත් නොවේවා!’ යනුවෙනි. ආයුෂ්මත්නි, එලෙසම යම් පුද්ගලයෙක් අපිරිසිදු කාය සමාචාරයෙන් යුක්තව, අපිරිසිදු වචී සමාචාරයෙන් යුක්තව සිටින්නේද, කලින් කලට සිතේ විවරයක්, සිතේ පැහැදීමක් නොලබන්නේද, ආයුෂ්මත්නි, එබඳු පුද්ගලයෙකු කෙරෙහිද කරුණාවම උපදවාගත යුතුය, අනුකම්පාවම උපදවාගත යුතුය, දයාවම උපදවාගත යුතුය – ‘අහෝ! මේ ආයුෂ්මත් තෙමේ කාය දුශ්චරිතය අත්හැර කාය සුචරිතය වඩන්නේ නම්, වචී දුශ්චරිතය අත්හැර වචී සුචරිතය වඩන්නේ නම්, මනෝ දුශ්චරිතය අත්හැර මනෝ සුචරිතය වඩන්නේ නම්! ඒ කුමන හේතුවක් නිසාද? මේ ආයුෂ්මත් තෙමේ කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුක්ඛිත තැන්වල නොඋපදීවා!’ යනුවෙනි. මෙලෙස ඒ පුද්ගලයා කෙරෙහි ඇති ආඝාතය දුරු කළ යුතුය.\n\n‘එහිදී ආයුෂ්මත්නි, යම් පුද්ගලයෙක් පිරිසිදු කාය සමාචාරයෙන් යුක්තව, පිරිසිදු වචී සමාචාරයෙන් යුක්තව සිටින්නේද, කලින් කලට සිතේ විවරයක්, සිතේ පැහැදීමක් ලබන්නේද, ඒ පුද්ගලයා කෙරෙහි ආඝාතය කෙසේ දුරු කළ යුතුද? ආයුෂ්මත්නි, යම්සේ පිරිසිදු ජලයෙන්ද, රසවත් ජලයෙන්ද, සිසිල් ජලයෙන්ද, සුදු පැහැති ජලයෙන්ද යුක්ත වූ, හොඳ තොටුපොළක් ඇති, රමණීය වූ, නොයෙක් ගස්වලින් වටවූ පොකුණක් ඇත්තේය. එවිට ග්‍රීෂ්මයෙන් පීඩිතව, දැඩි ග්‍රීෂ්මයෙන් වෙහෙසට පත්ව, ක්ලාන්තව, පිපාසයෙන්, දැඩි පිපාසයෙන් යුක්තව පුරුෂයෙක් එන්නේය. හෙතෙම ඒ පොකුණට බැස, නාද, බීද, ගොඩට නැගී, එතැනම ගස් සෙවණේ වාඩිවන්නේ හෝ හාන්සිවන්නේ හෝ වෙයි. ආයුෂ්මත්නි, එලෙසම යම් පුද්ගලයෙක් පිරිසිදු කාය සමාචාරයෙන් යුක්තව, පිරිසිදු වචී සමාචාරයෙන් යුක්තව සිටින්නේද, කලින් කලට සිතේ විවරයක්, සිතේ පැහැදීමක් ලබන්නේද, ඔහුගේ යම් පිරිසිදු කාය සමාචාරයක් ඇත්ද, එය ඒ වේලාවේදී මෙනෙහි කළ යුතුය; ඔහුගේ යම් පිරිසිදු වචී සමාචාරයක් ඇත්ද, එය ඒ වේලාවේදී මෙනෙහි කළ යුතුය; යම් කලින් කලට සිතේ විවරයක්, සිතේ පැහැදීමක් ලබන්නේද, එයද ඒ වේලාවේදී මෙනෙහි කළ යුතුය. මෙලෙස ඒ පුද්ගලයා කෙරෙහි ඇති ආඝාතය දුරු කළ යුතුය. ආයුෂ්මත්නි, සර්වප්‍රකාරයෙන් ප්‍රසන්න වූ පුද්ගලයෙකු අරභයා සිත පහදියි.\n\n‘ආයුෂ්මත්නි, මේවා ආඝාත දුරු කිරීමේ ක්‍රම පහයි. යම් ක්‍රමයකින් භික්ෂුවකගේ උපන් ආඝාතය සියල්ලෙන්ම දුරු කළ යුතු වේ’ යනුවෙනි. දෙවැන්න අවසන් විය.",
      "paliTitle": "Dutiyaāghātapaṭivinayasuttaṃ",
      "englishTitle": "Second Sutta on the Removal of Resentment",
      "sinhalaTitle": "දුතිය ආඝාතපටිවිනය සූත්‍රය"
    },
    {
      "number": 163,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – [a. ni. 5.65-66] ‘‘Pañcahāvuso, dhammehi samannāgato bhikkhu alaṃ sākaccho sabrahmacārīnaṃ. Katamehi pañcahi? Idhāvuso, bhikkhu attanā ca sīlasampanno hoti, sīlasampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadākathāya ca āgataṃ pañhaṃ byākattā hoti. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṃ sākaccho sabrahmacārīna’’nti. Tatiyaṃ.",
      "english": "Then, indeed, the Venerable Sāriputta addressed the bhikkhus, saying, \"Friends, bhikkhus!\" Those bhikkhus replied to the Venerable Sāriputta, \"Friend!\" The Venerable Sāriputta said this:\n\n\"Friends, a bhikkhu endowed with five qualities is fit to engage in conversation with his fellow practitioners of the Holy Life. With which five? Here, friends, a bhikkhu himself is accomplished in virtue, and he is capable of explaining any question that arises concerning the accomplishment of virtue. He himself is accomplished in concentration, and he is capable of explaining any question that arises concerning the accomplishment of concentration. He himself is accomplished in wisdom, and he is capable of explaining any question that arises concerning the accomplishment of wisdom. He himself is accomplished in liberation, and he is capable of explaining any question that arises concerning the accomplishment of liberation. He himself is accomplished in the knowledge and vision of liberation, and he is capable of explaining any question that arises concerning the accomplishment of the knowledge and vision of liberation. Indeed, friends, a bhikkhu endowed with these five qualities is fit to engage in conversation with his fellow practitioners of the Holy Life.\"",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන්ට ''ඇවැත්නි භික්ෂූන් වහන්ස'' කියා ආමන්ත්‍රණය කළ සේක. ඒ භික්ෂූහු ''ඇවැත්නි'' කියා ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: ''ඇවැත්නි, පස් ආකාර ධර්‍මයන්ගෙන් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන් සමඟ සාකච්ඡා කිරීමට සමර්ථයෙකු වන්නේය. ඒ කවර පස් ආකාර ධර්‍මයන්ගෙන්ද? ඇවැත්නි, මෙහිලා භික්ෂුවක් තමා විසින්ම ශීලයෙන් යුක්ත වන්නේය. තවද ශීල සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණෙන ප්‍රශ්නයක් විසඳන්නට සමර්ථයෙක් වන්නේය. තමා විසින්ම සමාධියෙන් යුක්ත වන්නේය. තවද සමාධි සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණෙන ප්‍රශ්නයක් විසඳන්නට සමර්ථයෙක් වන්නේය. තමා විසින්ම ප්‍රඥාවෙන් යුක්ත වන්නේය. තවද ප්‍රඥා සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණෙන ප්‍රශ්නයක් විසඳන්නට සමර්ථයෙක් වන්නේය. තමා විසින්ම විමුක්තියෙන් යුක්ත වන්නේය. තවද විමුක්ති සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණෙන ප්‍රශ්නයක් විසඳන්නට සමර්ථයෙක් වන්නේය. තමා විසින්ම විමුක්ති ඥාන දර්ශනයෙන් යුක්ත වන්නේය. තවද විමුක්ති ඥාන දර්ශන සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණෙන ප්‍රශ්නයක් විසඳන්නට සමර්ථයෙක් වන්නේය. ඇවැත්නි, මේ පස් ආකාර ධර්‍මයන්ගෙන් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන් සමඟ සාකච්ඡා කිරීමට සමර්ථයෙකු වන්නේය.''",
      "paliTitle": "Sākacchasuttaṃ",
      "englishTitle": "The Discourse on Discussion",
      "sinhalaTitle": "සාකච්ඡ සූත්‍රය"
    },
    {
      "number": 164,
      "pali": "[a. ni. 5.65] Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘pañcahi, āvuso, dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīnaṃ. Katamehi pañcahi? Idhāvuso, bhikkhu attanā ca sīlasampanno hoti, sīlasampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadākathāya ca āgataṃ pañhaṃ byākattā hoti. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīna’’nti. Catutthaṃ.",
      "english": "Then Venerable Sāriputta addressed the monks, saying: \"Monks, a bhikkhu endowed with five qualities is fit to live in fellowship with his fellow monastics. Which five?\n\nHere, monks, a bhikkhu is himself endowed with virtue, and he is capable of explaining a problem that has arisen concerning the perfection of virtue. He is himself endowed with concentration, and he is capable of explaining a problem that has arisen concerning the perfection of concentration. He is himself endowed with wisdom, and he is capable of explaining a problem that has arisen concerning the perfection of wisdom. He is himself endowed with liberation, and he is capable of explaining a problem that has arisen concerning the perfection of liberation. He is himself endowed with the knowledge and vision of liberation, and he is capable of explaining a problem that has arisen concerning the perfection of the knowledge and vision of liberation. Monks, a bhikkhu endowed with these five qualities is fit to live in fellowship with his fellow monastics.\"",
      "sinhala": "එහිදී ආයුෂ්මත් ශ්‍රී​ සාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන්ට ආමන්ත්‍රණය කර මෙසේ වදාළ සේක: “ආයුෂ්මතුනි, කරුණු පහකින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට සුදුසු පරිදි, යහපත් ජීවිතයක් ගෙන යෑමට සමත් වේ. ඒ කවර කරුණු පහකින් ද?\n\nආයුෂ්මතුනි, මෙහිලා භික්ෂුව තමන් විසින් ද සීල සම්පන්න වේ. සීල සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණි ප්‍රශ්නයකට පිළිතුරු දීමට ද සමත් වේ. තමන් විසින් ද සමාධි සම්පන්න වේ. සමාධි සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණි ප්‍රශ්නයකට පිළිතුරු දීමට ද සමත් වේ. තමන් විසින් ද ප්‍රඥා සම්පන්න වේ. ප්‍රඥා සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණි ප්‍රශ්නයකට පිළිතුරු දීමට ද සමත් වේ. තමන් විසින් ද විමුක්ති සම්පන්න වේ. විමුක්ති සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණි ප්‍රශ්නයකට පිළිතුරු දීමට ද සමත් වේ. තමන් විසින් ද විමුක්ති ඥාන දර්ශන සම්පන්න වේ. විමුක්ති ඥාන දර්ශන සම්පත්තිය පිළිබඳ කතාවෙන් පැමිණි ප්‍රශ්නයකට පිළිතුරු දීමට ද සමත් වේ. ආයුෂ්මතුනි, මෙන්න මේ කරුණු පහෙන් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට සුදුසු පරිදි, යහපත් ජීවිතයක් ගෙන යෑමට සමත් වේ.”",
      "paliTitle": "Sājīvasuttaṃ",
      "englishTitle": "The Discourse on Way of Life",
      "sinhalaTitle": "සාජීව සූත්‍රය"
    },
    {
      "number": 165,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘yo hi koci, āvuso, paraṃ pañhaṃ pucchati, sabbo so pañcahi ṭhānehi, etesaṃ vā aññatarena. Katamehi pañcahi? Mandattā momūhattā [momuhattā (sī.)] paraṃ pañhaṃ pucchati, pāpiccho icchāpakato paraṃ pañhaṃ pucchati, paribhavaṃ paraṃ pañhaṃ pucchati, aññātukāmo paraṃ pañhaṃ pucchati, atha vā panevaṃcitto [atha vā pakuppanto (sī. pī.)] paraṃ pañhaṃ pucchati – ‘sace me pañhaṃ puṭṭho sammadeva byākarissati iccetaṃ kusalaṃ, no ce [no ca (syā.)] me pañhaṃ puṭṭho sammadeva byākarissati ahamassa sammadeva byākarissāmī’ti. Yo hi koci, āvuso, paraṃ pañhaṃ pucchati, sabbo so imehi pañcahi ṭhānehi, etesaṃ vā aññatarena. Ahaṃ kho panāvuso, evaṃcitto paraṃ pañhaṃ pucchāmi – ‘sace me pañhaṃ puṭṭho sammadeva byākarissati iccetaṃ kusalaṃ, no ce me pañhaṃ puṭṭho sammadeva byākarissati, ahamassa sammadeva byākarissāmī’’ti. Pañcamaṃ.",
      "english": "There, Venerable Sāriputta addressed the monks, saying:\n\n\"Friends, whoever asks another a question, does so for five reasons, or for one of these. Which five? They do so due to dullness and profound confusion, or with evil desires and overcome by craving, or to disparage, or desiring to understand, or else with the thought: 'If, when questioned by me, he answers correctly, that is good; but if, when questioned by me, he does not answer correctly, then I will answer it correctly for him.' Friends, whoever asks another a question, does so for these five reasons, or for one of these.\n\n\"But friends, I, with this thought, ask another a question: 'If, when questioned by me, he answers correctly, that is good; but if, when questioned by me, he does not answer correctly, then I will answer it correctly for him.'\"",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරිපුත්‍‌ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: “ආයුෂ්මතුනි, යම් කිසිවෙක් අනුන්ගෙන් ප්‍රශ‍්නයක් විචාරන්නේ නම්, ඒ සියල්ලෝම කරුණු පහකින් හෝ ඒ අතරින් එක් කරුණකින් විචාරති. ඒ කරුණු පහ කවරේද යත්: මන්දබුද්ධි භාවය නිසාත්, මුළාවීම නිසාත් අනුන්ගෙන් ප්‍රශ‍්න අසයි. පාපී සිතිවිලි ඇතිව, ආශාවෙන් පෙළී අනුන්ගෙන් ප්‍රශ‍්න අසයි. අනුන්ව අවමානයට ලක් කිරීමේ අදහසින් අනුන්ගෙන් ප්‍රශ‍්න අසයි. යමක් දැනගැනීමේ කැමැත්තෙන් අනුන්ගෙන් ප්‍රශ‍්න අසයි. නැතහොත් ‘මා විසින් ප්‍රශ‍්න කරන ලද ඔහු මැනවින් පිළිතුරු දෙන්නේ නම් එය මැනවි. මා විසින් ප්‍රශ‍්න කරන ලද ඔහු මැනවින් පිළිතුරු නොදෙන්නේ නම්, මම ඔහුට මැනවින් පිළිතුරු දෙන්නෙමි’ යන මේ සිතුවිල්ලෙන් අනුන්ගෙන් ප්‍රශ‍්න අසයි. ආයුෂ්මතුනි, යම් කිසිවෙක් අනුන්ගෙන් ප්‍රශ‍්නයක් විචාරන්නේ නම්, ඒ සියල්ලෝම මේ කරුණු පහකින් හෝ ඒ අතරින් එක් කරුණකින් විචාරති.\n\nඑහෙත් ආයුෂ්මතුනි, මම නම් ‘මා විසින් ප්‍රශ‍්න කරන ලද ඔහු මැනවින් පිළිතුරු දෙන්නේ නම් එය මැනවි. මා විසින් ප්‍රශ‍්න කරන ලද ඔහු මැනවින් පිළිතුරු නොදෙන්නේ නම්, මම ඔහුට මැනවින් පිළිතුරු දෙන්නෙමි’ යන මේ සිතුවිල්ලෙන් අනුන්ගෙන් ප්‍රශ‍්න අසමි.”\n\nපස්වැන්නයි.",
      "paliTitle": "Pañhapucchāsuttaṃ",
      "englishTitle": "The Discourse on Asking Questions",
      "sinhalaTitle": "පඤ්හපුච්ඡා සූත්‍රය"
    },
    {
      "number": 166,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi [samāpajjeyyapi vuṭṭhaheyyapi (sī. syā. kaṃ. pī.)] – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ [kabaḷiṃkārāhārabhakkhānaṃ (sī. syā. kaṃ. pī.)] devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti. Evaṃ vutte āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti. Dutiyampi kho…pe… tatiyampi kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti. Tatiyampi kho āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti. Atha kho āyasmato sāriputtassa etadahosi – ‘‘yāvatatiyakampi [yāvatatiyampi (sī. syā. pī.)] kho me āyasmā udāyī paṭikkosati, na ca me koci bhikkhu anumodati. Yaṃnūnāhaṃ yena bhagavā tenupasaṅkameyya’’nti. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti. Evaṃ vutte āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti. Dutiyampi kho…pe… tatiyampi kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti. Tatiyampi kho āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti. Atha kho āyasmato sāriputtassa etadahosi – ‘‘bhagavatopi kho me sammukhā āyasmā udāyī yāvatatiyakaṃ paṭikkosati, na ca me koci bhikkhu anumodati. Yaṃnūnāhaṃ tuṇhī assa’’nti. Atha kho āyasmā sāriputto tuṇhī ahosi. Atha kho bhagavā āyasmantaṃ udāyiṃ āmantesi – ‘‘kaṃ pana tvaṃ, udāyi, manomayaṃ kāyaṃ paccesī’’ti? ‘‘Ye te, bhante, devā arūpino saññāmayā’’ti. ‘‘Kiṃ nu kho tuyhaṃ, udāyi, bālassa abyattassa bhaṇitena! Tvampi nāma bhaṇitabbaṃ maññasī’’ti! Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘atthi nāma, ānanda, theraṃ bhikkhuṃ vihesiyamānaṃ ajjhupekkhissatha. Na hi nāma, ānanda, kāruññampi bhavissati theramhi [byattamhi (syā. kaṃ. ka.)] bhikkhumhi vihesiyamānamhī’’ti. Atha kho bhagavā bhikkhū āmantesi – ‘‘idha, bhikkhave, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi. Atha kho āyasmā ānando acirapakkantassa bhagavato yenāyasmā upavāṇo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ upavāṇaṃ etadavoca – ‘‘idhāvuso upavāṇa, aññe there bhikkhū vihesenti. Mayaṃ tena na muccāma. Anacchariyaṃ kho, panetaṃ āvuso upavāṇa, yaṃ bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito etadeva ārabbha udāhareyya yathā āyasmantaṃyevettha upavāṇaṃ paṭibhāseyya. Idāneva amhākaṃ sārajjaṃ okkanta’’nti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ upavāṇaṃ etadavoca – ‘‘Katīhi nu kho, upavāṇa, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti? ‘‘Pañcahi, bhante, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Idha, bhante, thero bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya [anelagaḷāya (syā. kaṃ.)] atthassa viññāpaniyā; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhante, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. ‘‘Sādhu sādhu, upavāṇa! Imehi kho, upavāṇa, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Ime ce, upavāṇa, pañca dhammā therassa bhikkhuno na saṃvijjeyyuṃ, taṃ sabrahmacārī na sakkareyyuṃ na garuṃ kareyyuṃ na māneyyuṃ na pūjeyyuṃ khaṇḍiccena pāliccena valittacatāya. Yasmā ca kho, upavāṇa, ime pañca dhammā therassa bhikkhuno saṃvijjanti, tasmā taṃ sabrahmacārī sakkaronti garuṃ karonti mānenti pūjentī’’ti. Chaṭṭhaṃ.",
      "english": "There, indeed, the venerable Sāriputta addressed the monastics: “Here, friends, a monastic endowed with virtue, concentration, and wisdom might enter into and emerge from the cessation of perception and feeling—such a possibility exists. If he does not realize anything further in this very life, then having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, he might enter into and emerge from the cessation of perception and feeling—such a possibility exists.”\n\nWhen this was said, the venerable Udāyī said this to the venerable Sāriputta: “This is impossible, friend Sāriputta, there is no such opportunity for that monastic who, having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, might enter into and emerge from the cessation of perception and feeling—there is no such possibility.” A second time, indeed, and a third time, the venerable Sāriputta addressed the monastics: “Here, friends, a monastic endowed with virtue, concentration, and wisdom might enter into and emerge from the cessation of perception and feeling—such a possibility exists. If he does not realize anything further in this very life, then having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, he might enter into and emerge from the cessation of perception and feeling—such a possibility exists.” A third time, indeed, the venerable Udāyī said this to the venerable Sāriputta: “This is impossible, friend Sāriputta, there is no such opportunity for that monastic who, having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, might enter into and emerge from the cessation of perception and feeling—there is no such possibility.”\n\nThen it occurred to the venerable Sāriputta: “The venerable Udāyī has contradicted me three times, and not a single monastic has assented to me. What if I were to approach the Blessed One?”\n\nThen the venerable Sāriputta approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the venerable Sāriputta addressed the monastics: “Here, friends, a monastic endowed with virtue, concentration, and wisdom might enter into and emerge from the cessation of perception and feeling—such a possibility exists. If he does not realize anything further in this very life, then having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, he might enter into and emerge from the cessation of perception and feeling—such a possibility exists.”\n\nWhen this was said, the venerable Udāyī said this to the venerable Sāriputta: “This is impossible, friend Sāriputta, there is no such opportunity for that monastic who, having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, might enter into and emerge from the cessation of perception and feeling—there is no such possibility.” A second time, indeed, and a third time, the venerable Sāriputta addressed the monastics: “Here, friends, a monastic endowed with virtue, concentration, and wisdom might enter into and emerge from the cessation of perception and feeling—such a possibility exists. If he does not realize anything further in this very life, then having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, he might enter into and emerge from the cessation of perception and feeling—such a possibility exists.” A third time, indeed, the venerable Udāyī said this to the venerable Sāriputta: “This is impossible, friend Sāriputta, there is no such opportunity for that monastic who, having arisen in some mind-made body, even transcending the companionship of the deities who subsist on physical food, might enter into and emerge from the cessation of perception and feeling—there is no such possibility.”\n\nThen it occurred to the venerable Sāriputta: “Even in the presence of the Blessed One, the venerable Udāyī has contradicted me three times, and not a single monastic has assented to me. What if I were to remain silent?”\n\nThen the venerable Sāriputta remained silent.\n\nThen the Blessed One addressed the venerable Udāyī: “Which mind-made body, Udāyī, do you understand?”\n\n“Bhante, those deities who are formless, whose nature is perception.”\n\n“What is this talk of yours, Udāyī, foolish and unskillful one! Do you really think you have anything to say?!”\n\nThen the Blessed One addressed the venerable Ānanda: “Is it possible, Ānanda, that you would merely look on while an elder monastic is being tormented? Indeed, Ānanda, is there no compassion for an elder monastic who is being tormented?”\n\nThen the Blessed One addressed the bhikkhus: “Here, bhikkhus, a bhikkhu endowed with virtue, endowed with concentration, and endowed with wisdom, might enter and emerge from the cessation of perception and feeling – such a possibility exists. If, in this very life, he does not realize anything further, then having transcended the companionship of the gods who consume solid food, and reborn in some mind-made body, he might enter and emerge from the cessation of perception and feeling – such a possibility exists.” The Blessed One said this. Having said this, the Sugata rose from his seat and entered the monastery.\n\nThen, not long after the Blessed One had departed, Venerable Ānanda approached Venerable Upavāṇa. Having approached, he said to Venerable Upavāṇa: “Here, friend Upavāṇa, other elder bhikkhus cause trouble. We are not exempt from that. It is not surprising, friend Upavāṇa, that the Blessed One, having emerged from seclusion in the evening, should make a statement concerning this very matter, as if Venerable Upavāṇa himself had prompted it. Our agitation has just now subsided.”\n\nThen the Blessed One, having emerged from seclusion in the evening, approached the service hall. Having approached, he sat down on the seat prepared for him. Having sat down, the Blessed One said to Venerable Upavāṇa: “Upavāṇa, how many qualities must an elder bhikkhu be endowed with to be dear, pleasing, respected, and worthy of cultivation by his fellow practitioners?”\n\n“Five, Venerable Sir, are the qualities an elder bhikkhu must be endowed with to be dear, pleasing, respected, and worthy of cultivation by his fellow practitioners. Which five? Here, Venerable Sir, an elder bhikkhu is virtuous, living restrained by the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, and undertaking the training rules, he trains himself. He is learned, having heard much, remembering what he has heard, accumulating what he has heard; those teachings that are good in the beginning, good in the middle, good in the end, with the spirit and the letter, proclaiming the perfectly complete and pure holy life—such teachings are well-mastered by him, well-retained, well-observed, and well-penetrated by his view. He has excellent speech and excellent articulation, endowed with a cultured, clear, distinct voice, capable of conveying meaning. He is an obtainer at will, without difficulty or trouble, of the four jhānas – the higher mental states that are pleasant abidings in this very life. Through the destruction of the taints, having realized for himself with direct knowledge and entered the taintless liberation of mind and liberation by wisdom, he abides therein. Venerable Sir, it is with these five qualities that an elder bhikkhu is endowed to be dear, pleasing, respected, and worthy of cultivation by his fellow practitioners.”\n\n“Excellent, excellent, Upavāṇa! Indeed, Upavāṇa, it is with these five qualities that an elder bhikkhu is endowed to be dear, pleasing, respected, and worthy of cultivation by his fellow practitioners. If, Upavāṇa, these five qualities were not present in an elder bhikkhu, his fellow practitioners would not respect him, would not revere him, would not honor him, would not worship him, simply because of his decrepitude, gray hair, and wrinkled skin. But because, Upavāṇa, these five qualities are present in an elder bhikkhu, his fellow practitioners respect him, revere him, honor him, and worship him.”",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කර මෙසේ වදාළ සේක: ‘‘ඇවැත්නි, මෙහිලා භික්ෂුවක් ශීල සම්පන්නව, සමාධි සම්පන්නව, ප්‍රඥා සම්පන්නව සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙය සිදුවිය හැකි කරුණකි. නොඑසේ නම්, යම් හෙයකින් මේ ආත්ම භාවයේදීම අරහත් ඵලය අවබෝධ කරගැනීමට නොහැකි වුවහොත්, කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ (කාමාවචර දෙවියන්ගේ) සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව (රූපාවචර බ්‍රහ්මයෙකු ලෙස) උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙයද සිදුවිය හැකි කරුණකි.”\n\nමෙසේ පැවසූ කල්හි, ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙය පැවසූ සේක: ‘‘ඇවැත් ශාරිපුත්ත, ඒ භික්ෂුව කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවදී ද, එයින් නැගිටියි ද, එය සිදුවිය නොහැකි කරුණකි, අවස්ථාවක් නොමැත. මෙය සිදුවිය නොහැක්කකි.” දෙවෙනි වරද, ...තුන්වෙනි වරද ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කර මෙසේ වදාළ සේක: ‘‘ඇවැත්නි, මෙහිලා භික්ෂුවක් ශීල සම්පන්නව, සමාධි සම්පන්නව, ප්‍රඥා සම්පන්නව සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙය සිදුවිය හැකි කරුණකි. නොඑසේ නම්, යම් හෙයකින් මේ ආත්ම භාවයේදීම අරහත් ඵලය අවබෝධ කරගැනීමට නොහැකි වුවහොත්, කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙයද සිදුවිය හැකි කරුණකි.” තුන්වෙනි වරද ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙය පැවසූ සේක: ‘‘ඇවැත් ශාරිපුත්ත, ඒ භික්ෂුව කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවදී ද, එයින් නැගිටියි ද, එය සිදුවිය නොහැකි කරුණකි, අවස්ථාවක් නොමැත. මෙය සිදුවිය නොහැක්කකි.”\n\nඉක්බිති ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: ‘‘තුන්වෙනි වරටත් ආයුෂ්මත් උදායි මාගේ ප්‍රකාශය ප්‍රතික්ෂේප කරයි. කිසිම භික්ෂුවක් මා සමග එකඟ නොවෙති. එසේනම් මම භාග්‍ය​වතුන් වහන්සේ වෙත යන්නෙම් නම් යෙහෙකි.” ඉක්බිති ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේ වැඩසිටින තැනට වැඩියේය. වැඩමකර, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩිවිය.\n\nඑකත්පසෙකින් වැඩහුන් ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කර මෙසේ වදාළ සේක: ‘‘ඇවැත්නි, මෙහිලා භික්ෂුවක් ශීල සම්පන්නව, සමාධි සම්පන්නව, ප්‍රඥා සම්පන්නව සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙය සිදුවිය හැකි කරුණකි. නොඑසේ නම්, යම් හෙයකින් මේ ආත්ම භාවයේදීම අරහත් ඵලය අවබෝධ කරගැනීමට නොහැකි වුවහොත්, කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙයද සිදුවිය හැකි කරුණකි.” මෙසේ පැවසූ කල්හි, ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙය පැවසූ සේක: ‘‘ඇවැත් ශාරිපුත්ත, ඒ භික්ෂුව කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවදී ද, එයින් නැගිටියි ද, එය සිදුවිය නොහැකි කරුණකි, අවස්ථාවක් නොමැත. මෙය සිදුවිය නොහැක්කකි.” දෙවෙනි වරද, ...තුන්වෙනි වරද ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කර මෙසේ වදාළ සේක: ‘‘ඇවැත්නි, මෙහිලා භික්ෂුවක් ශීල සම්පන්නව, සමාධි සම්පන්නව, ප්‍රඥා සම්පන්නව සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙය සිදුවිය හැකි කරුණකි. නොඑසේ නම්, යම් හෙයකින් මේ ආත්ම භාවයේදීම අරහත් ඵලය අවබෝධ කරගැනීමට නොහැකි වුවහොත්, කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවැදිය හැකි වන අතර, එයින් නැගිටියද හැක. මෙයද සිදුවිය හැකි කරුණකි.” තුන්වෙනි වරද ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙය පැවසූ සේක: ‘‘ඇවැත් ශාරිපුත්ත, ඒ භික්ෂුව කබලිංකාර ආහාර අනුභව කරන්නා වූ දෙවියන්ගේ සහාය භාවය ඉක්මවා, යම් මනෝමය කායකින් යුක්තව උපන් පසු සංඥා​වේදයිත​නිරෝධ සමාපත්තියට සමවදී ද, එයින් නැගිටියි ද, එය සිදුවිය නොහැකි කරුණකි, අවස්ථාවක් නොමැත. මෙය සිදුවිය නොහැක්කකි.”\n\nඉක්බිති ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: ‘‘භාග්‍ය​වතුන් වහන්සේ ඉදිරියේ පවා ආයුෂ්මත් උදායි තුන්වෙනි වරටත් මාගේ ප්‍රකාශය ප්‍රතික්ෂේප කරයි. කිසිම භික්ෂුවක් මා සමග එකඟ නොවෙති. එසේනම් මම නිහඬව සිටින්නේ නම් යෙහෙකි.” ඉක්බිති ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ නිහඬ විය.\n\nඉක්බිති භාග්‍ය​වතුන් වහන්සේ ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේට ආමන්ත්‍රණය කර මෙසේ වදාළ සේක: ‘‘උදායි, ඔබ අදහස් කරන්නේ කිනම් මනෝමය කායයක් ගැනද?” ‘‘ස්වාමීනි, අරූපී වූ, සංඥා​මය වූ දෙවියන් ගැනයි.” ‘‘උදායි, ඔබ වැනි බාල, අව්‍යක්ත පුද්ගලයකුගේ කථාව කුමක්ද? ඔබත් කතා කළ යුතු යැයි සිතනවාද!” ඉක්බිති භාග්‍ය​වතුන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට ආමන්ත්‍රණය කර මෙසේ වදාළ සේක: ‘‘ආනන්ද, ථේර භික්ෂුවක් පීඩාවට පත්වන විට ඔබලා බලා සිටින්නෙහිද? ආනන්ද, ථේර වූ (පණ්ඩිත වූ) භික්ෂුවක් පීඩාවට පත්වන විට කරුණාවක්ද ඇති නොවන්නේද?”\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට ආමන්ත්‍රණය කළ සේක: \"මහණෙනි, මෙහිලා සිල් සම්පූර්ණ වූ, සමාධි සම්පූර්ණ වූ, ප්‍රඥා සම්පූර්ණ වූ භික්ෂුවක් සංඥා-වේදයිත නිරෝධ සමාපත්තියට සමවැදිය හැක, එයින් නැගිටිය හැක. මේ තත්වය ඇති විය හැක්කකි. යම් හෙයකින් මේ දැක්කා වූ ධර්මය තුළ (මේ ආත්මභාවයේදී) අරහත්වය නොලබන්නේ නම්, කබළීකාරාහාරය (ඕජස් සහිත ආහාර) වළඳන දෙවියන්ගේ සහාය අභිබවා, යම් මනෝමය කයක (බඹලොව උපතක් ලබා) සංඥා-වේදයිත නිරෝධයට සමවැදිය හැක, එයින් නැගිටිය හැක. මේ තත්වය ඇති විය හැක්කකි.\" භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගතයන් වහන්සේ අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක.\n\nඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ, භාග්‍යවතුන් වහන්සේ වැඩි කලක් ගත නොවනවා ම ආයුෂ්මත් උපවාන ස්ථවිරයන් වහන්සේ වෙත එළඹුණු සේක; එළඹ, ආයුෂ්මත් උපවාන ස්ථවිරයන් වහන්සේට මෙසේ පැවසූ සේක: \"ඇවැත් උපවාන, මෙහි අන්‍ය ථෙර භික්ෂූන් වහන්සේලා විහිළු කරති. අපි එයින් මිදෙන්නේ නැත. ඇවැත් උපවාන, භාග්‍යවතුන් වහන්සේ සවස් කාලයේ පටිසල්ලානයෙන් නැගිට මේ පිළිබඳව ම උදාන වාක්‍යයක් ප්‍රකාශ කළ සේක් නම්, එය ආශ්චර්යයක් නොවනු ඇත. ඒ කෙසේද යත්, මේ සම්බන්ධයෙන් ඔබට ම සිහිපත් වන්නට ඉඩ ඇත. දැනටමත් අපට ලැජ්ජාව ඇති වී ඇත.\"\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ සවස් කාලයේ පටිසල්ලානයෙන් නැගිට, උපස්ථාන ශාලාව වෙත වැඩි සේක; එළඹ, පනවන ලද ආසනයෙහි වැඩහුන් සේක. වැඩහිඳ, භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් උපවාන ස්ථවිරයන් වහන්සේට මෙසේ වදාළ සේක: \"උපවාන, කවර ධර්ම කීයකින් සමන්විත ථෙර භික්ෂුවක් සම-බඹසරෙහි හැසිරෙන්නන් හට ප්‍රිය ද වන්නේ ද, මනාප ද වන්නේ ද, ගරු කටයුතු ද වන්නේ ද, භාවනීය (පිළිපැදිය යුතු) ද වන්නේ ද?\"\n\n\"ස්වාමීනී, ධර්ම පසකින් සමන්විත ථෙර භික්ෂුවක් සම-බඹසරෙහි හැසිරෙන්නන් හට ප්‍රිය ද වන්නේ ද, මනාප ද වන්නේ ද, ගරු කටයුතු ද වන්නේ ද, භාවනීය ද වන්නේ ද. ඒ කවර පසකින් ද? ස්වාමීනී, මෙහිලා ථෙර භික්ෂුව සීලවන්ත වේ. ඔහු ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. ඔහු බහුශ්‍රැත වේ. ඔහු දෘෂ්ටියෙන් මනාකොට විනිවිද යි. ඔහු කල්‍යාණ වූ වචන ඇත්තේ වෙයි, කල්‍යාණ වූ වාග්කරණ ඇත්තේ වෙයි, පැහැදිලි, නොතැතිලෙන, අර්ථය විදහා පෑමට සමත් වූ ප්‍රෞඪ වචන ඇත්තේ වෙයි. ඔහු අභිචෛතසික වූ, දැකගත හැකි ධර්මයෙහි ම සැප විහරණයන් වූ සිව් ධ්‍යානයන් කැමැති පරිදි, අපහසුවක් රහිතව, වෙහෙසක් රහිතව ලබන්නා වෙයි. ඔහු ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චිත්ත විමුක්තිය හා ප්‍රඥා විමුක්තිය තමා විසින් ම මේ ආත්මභාවයේදී ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරයි. ස්වාමීනී, මේ ධර්ම පසින් සමන්විත ථෙර භික්ෂුවක් සම-බඹසරෙහි හැසිරෙන්නන් හට ප්‍රිය ද වන්නේ ද, මනාප ද වන්නේ ද, ගරු කටයුතු ද වන්නේ ද, භාවනීය ද වන්නේ ද.\"\n\n\"සාදු සාදු, උපවාන! උපවාන, ධර්ම පසින් සමන්විත ථෙර භික්ෂුවක් සම-බඹසරෙහි හැසිරෙන්නන් හට ප්‍රිය ද වන්නේ ද, මනාප ද වන්නේ ද, ගරු කටයුතු ද වන්නේ ද, භාවනීය ද වන්නේ ද. උපවාන, යම් හෙයකින් මේ ධර්ම පස ථෙර භික්ෂුවට නොපවතින්නේ නම්, සම-බඹසරෙහි හැසිරෙන්නන් දන්තභංගය (දත් කැඩී යාම), හිසකෙස් පැසීම, සම රැලි ගැසීම (වැහැරී යාම) නිසා ඔහුට සත්කාර නොකරති, ගරු නොකරති, මානයෙන් සලකන්නේ නැත, පුද සත්කාර නොකරති. උපවාන, යම් හෙයකින් මේ ධර්ම පස ථෙර භික්ෂුවට පවතින්නේ නම්, එහෙයින් සම-බඹසරෙහි හැසිරෙන්නන් ඔහුට සත්කාර කරති, ගරු කරති, මානයෙන් සලකති, පුද සත්කාර කරති.\"",
      "paliTitle": "Nirodhasuttaṃ",
      "englishTitle": "The Discourse on Cessation",
      "sinhalaTitle": "නිරෝධ සූත්‍රය"
    },
    {
      "number": 167,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘codakena, āvuso, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’. ‘‘Katame pañca? Kālena vakkhāmi, no akālena; bhūtena vakkhāmi, no abhūtena; saṇhena vakkhāmi, no pharusena; atthasaṃhitena vakkhāmi, no anatthasaṃhitena; mettacitto [mettacittena (sī. pī. ka.) cūḷava. 400 passitabbaṃ] vakkhāmi, no dosantaro [dosantarena (sī. pī. ka.)]. Codakena, āvuso, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo. ‘‘Idhāhaṃ, āvuso, ekaccaṃ puggalaṃ passāmi akālena codiyamānaṃ no kālena kupitaṃ, abhūtena codiyamānaṃ no bhūtena kupitaṃ, pharusena codiyamānaṃ no saṇhena kupitaṃ, anatthasaṃhitena codiyamānaṃ no atthasaṃhitena kupitaṃ, dosantarena codiyamānaṃ no mettacittena kupitaṃ. ‘‘Adhammacuditassa, āvuso, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo [upadahitabbo (sī. syā. pī.)] – ‘akālenāyasmā cudito no kālena, alaṃ te avippaṭisārāya; abhūtenāyasmā cudito no bhūtena, alaṃ te avippaṭisārāya; pharusenāyasmā cudito no saṇhena, alaṃ te avippaṭisārāya; anatthasaṃhitenāyasmā cudito no atthasaṃhitena, alaṃ te avippaṭisārāya; dosantarenāyasmā cudito no mettacittena, alaṃ te avippaṭisārāyā’ti. Adhammacuditassa, āvuso, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo. ‘‘Adhammacodakassa, āvuso, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – ‘akālena te, āvuso, codito [cudito (sī. syā. pī.)] no kālena, alaṃ te vippaṭisārāya; abhūtena te, āvuso, codito no bhūtena, alaṃ te vippaṭisārāya; pharusena te, āvuso, codito no saṇhena, alaṃ te vippaṭisārāya; anatthasaṃhitena te, āvuso, codito no atthasaṃhitena, alaṃ te vippaṭisārāya; dosantarena te, āvuso, codito no mettacittena, alaṃ te vippaṭisārāyā’ti. Adhammacodakassa, āvuso, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā na aññopi bhikkhu abhūtena codetabbaṃ maññeyyāti. ‘‘Idha panāhaṃ, āvuso, ekaccaṃ puggalaṃ passāmi kālena codiyamānaṃ no akālena kupitaṃ, bhūtena codiyamānaṃ no abhūtena kupitaṃ, saṇhena codiyamānaṃ no pharusena kupitaṃ, atthasaṃhitena codiyamānaṃ no anatthasaṃhitena kupitaṃ, mettacittena codiyamānaṃ no dosantarena kupitaṃ. ‘‘Dhammacuditassa, āvuso, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – ‘kālenāyasmā cudito no akālena, alaṃ te vippaṭisārāya; bhūtenāyasmā cudito no abhūtena, alaṃ te vippaṭisārāya; saṇhenāyasmā cudito no pharusena, alaṃ te vippaṭisārāya; atthasaṃhitenāyasmā cudito no anatthasaṃhitena, alaṃ te vippaṭisārāya; mettacittenāyasmā cudito no dosantarena, alaṃ te vippaṭisārāyā’ti. Dhammacuditassa, āvuso, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo. ‘‘Dhammacodakassa, āvuso, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo – ‘kālena te, āvuso, codito no akālena, alaṃ te avippaṭisārāya; bhūtena te, āvuso, codito no abhūtena, alaṃ te avippaṭisārāya; saṇhena te, āvuso, codito no pharusena, alaṃ te avippaṭisārāya; atthasaṃhitena te, āvuso, codito no anatthasaṃhitena, alaṃ te avippaṭisārāya; mettacittena te, āvuso, codito no dosantarena, alaṃ te avippaṭisārāyā’ti. Dhammacodakassa, āvuso, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā aññopi bhikkhu bhūtena coditabbaṃ maññeyyāti. ‘‘Cuditena, āvuso, puggalena dvīsu dhammesu patiṭṭhātabbaṃ – sacce ca, akuppe ca. Maṃ cepi [pañcahi (syā. ka.)], āvuso, pare codeyyuṃ kālena vā akālena vā bhūtena vā abhūtena vā saṇhena vā pharusena vā atthasaṃhitena vā anatthasaṃhitena vā mettacittā [mettacittena (sī. pī. ka.) ma. ni. 1.227 passitabbaṃ] vā dosantarā [dosantarena (sī. pī. ka.)] vā, ahampi dvīsuyeva dhammesu patiṭṭhaheyyaṃ – sacce ca, akuppe ca. Sace jāneyyaṃ – ‘attheso mayi dhammo’ti, ‘atthī’ti naṃ vadeyyaṃ – ‘saṃvijjateso mayi dhammo’ti. Sace jāneyyaṃ – ‘nattheso mayi dhammo’ti, ‘natthī’ti naṃ vadeyyaṃ – ‘neso dhammo mayi saṃvijjatī’ti. ‘‘Evampi kho te [evampi kho (ka.)], sāriputta, vuccamānā atha ca panidhekacce moghapurisā na padakkhiṇaṃ gaṇhantī’’ti. ‘‘Ye te, bhante, puggalā assaddhā jīvikatthā na saddhā agārasmā anagāriyaṃ pabbajitā saṭhā māyāvino ketabino [keṭubhino (sī. syā. kaṃ. pī.)] uddhatā unnaḷā capalā mukharā vikiṇṇavācā indriyesu aguttadvārā bhojane amattaññuno jāgariyaṃ ananuyuttā sāmaññe anapekkhavanto sikkhāya na tibbagāravā bāhulikā sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā kusītā hīnavīriyā muṭṭhassatino asampajānā asamāhitā vibbhantacittā duppaññā eḷamūgā, te mayā evaṃ vuccamānā na padakkhiṇaṃ gaṇhanti. ‘‘Ye pana te, bhante, kulaputtā saddhā agārasmā anagāriyaṃ pabbajitā asaṭhā amāyāvino aketabino anuddhatā anunnaḷā acapalā amukharā avikiṇṇavācā indriyesu guttadvārā bhojane mattaññuno jāgariyaṃ anuyuttā sāmaññe apekkhavanto sikkhāya tibbagāravā na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā āraddhavīriyā pahitattā upaṭṭhitassatino sampajānā samāhitā ekaggacittā paññavanto aneḷamūgā, te mayā evaṃ vuccamānā padakkhiṇaṃ gaṇhantīti. ‘‘Ye te, sāriputta, puggalā assaddhā jīvikatthā na saddhā agārasmā anagāriyaṃ pabbajitā saṭhā māyāvino ketabino uddhatā unnaḷā capalā mukharā vikiṇṇavācā indriyesu aguttadvārā bhojane amattaññuno jāgariyaṃ ananuyuttā sāmaññe anapekkhavanto sikkhāya na tibbagāravā bāhulikā sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā kusītā hīnavīriyā muṭṭhassatino asampajānā asamāhitā vibbhantacittā duppaññā eḷamūgā, tiṭṭhantu te. ‘‘Ye pana, te sāriputta, kulaputtā saddhā agārasmā anagāriyaṃ pabbajitā asaṭhā amāyāvino aketabino anuddhatā anunnaḷā acapalā amukharā avikiṇṇavācā indriyesu guttadvārā bhojane mattaññuno jāgariyaṃ anuyuttā sāmaññe apekkhavanto sikkhāya tibbagāravā na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā āraddhavīriyā pahitattā upaṭṭhitassatino sampajānā samāhitā ekaggacittā paññavanto aneḷamūgā, te tvaṃ, sāriputta, vadeyyāsi. Ovada, sāriputta, sabrahmacārī; anusāsa, sāriputta, sabrahmacārī – ‘asaddhammā vuṭṭhāpetvā saddhamme patiṭṭhāpessāmi sabrahmacārī’ti. Evañhi te, sāriputta, sikkhitabba’’nti. Sattamaṃ.",
      "english": "There, indeed, the venerable Sāriputta addressed the bhikkhus: \"Friends, a bhikkhu who desires to admonish another should establish five qualities within himself before admonishing that other.\" \"Which five?\" \"I will speak at the right time, not at the wrong time. I will speak what is true, not what is untrue. I will speak gently, not harshly. I will speak what is beneficial, not what is unbeneficial. I will speak with a mind of loving-kindness, not with inner ill-will.\" Friends, a bhikkhu who desires to admonish another should establish these five qualities within himself before admonishing that other.\n\n\"Here, friends, I observe a certain individual being admonished at the wrong time, not at the right time, yet not becoming angry; being admonished with what is untrue, not with what is true, yet not becoming angry; being admonished harshly, not gently, yet not becoming angry; being admonished with what is unbeneficial, not with what is beneficial, yet not becoming angry; being admonished with inner ill-will, not with a mind of loving-kindness, yet not becoming angry.\n\n\"Friends, for a bhikkhu who has been wrongly admonished, remorselessness should be established in five ways: 'Venerable sir, you were admonished at the wrong time, not at the right time. This is sufficient for you to be without remorse.' 'Venerable sir, you were admonished with what is untrue, not with what is true. This is sufficient for you to be without remorse.' 'Venerable sir, you were admonished harshly, not gently. This is sufficient for you to be without remorse.' 'Venerable sir, you were admonished with what is unbeneficial, not with what is beneficial. This is sufficient for you to be without remorse.' 'Venerable sir, you were admonished with inner ill-will, not with a mind of loving-kindness. This is sufficient for you to be without remorse.'\" Friends, for a bhikkhu who has been wrongly admonished, remorselessness should be established in these five ways.\n\n\"Friends, for a bhikkhu who has wrongly admonished, remorse should be established in five ways: 'Friend, you admonished at the wrong time, not at the right time. This is sufficient for you to feel remorse.' 'Friend, you admonished with what is untrue, not with what is true. This is sufficient for you to feel remorse.' 'Friend, you admonished harshly, not gently. This is sufficient for you to feel remorse.' 'Friend, you admonished with what is unbeneficial, not with what is beneficial. This is sufficient for you to feel remorse.' 'Friend, you admonished with inner ill-will, not with a mind of loving-kindness. This is sufficient for you to feel remorse.'\" Friends, for a bhikkhu who has wrongly admonished, remorse should be established in these five ways. For what reason? So that another bhikkhu might not think that one should admonish with what is untrue.\n\n\"But here, friends, I observe a certain individual being admonished at the right time, not at the wrong time, and yet not becoming angry; being admonished with what is true, not with what is untrue, and yet not becoming angry; being admonished gently, not harshly, and yet not becoming angry; being admonished with what is beneficial, not with what is unbeneficial, and yet not becoming angry; being admonished with a mind of loving-kindness, not with inner ill-will, and yet not becoming angry.\n\n\"Friends, for a bhikkhu who has been rightly admonished, remorse should be established in five ways: 'Venerable sir, you were admonished at the right time, not at the wrong time. This is sufficient for you to feel remorse.' 'Venerable sir, you were admonished with what is true, not with what is untrue. This is sufficient for you to feel remorse.' 'Venerable sir, you were admonished gently, not harshly. This is sufficient for you to feel remorse.' 'Venerable sir, you were admonished with what is beneficial, not with what is unbeneficial. This is sufficient for you to feel remorse.' 'Venerable sir, you were admonished with a mind of loving-kindness, not with inner ill-will. This is sufficient for you to feel remorse.'\" Friends, for a bhikkhu who has been rightly admonished, remorse should be established in these five ways.\n\n\"Friends, for a bhikkhu who has rightly admonished, remorselessness should be established in five ways: 'Friend, you admonished at the right time, not at the wrong time. This is sufficient for you to be without remorse.' 'Friend, you admonished with what is true, not with what is untrue. This is sufficient for you to be without remorse.' 'Friend, you admonished gently, not harshly. This is sufficient for you to be without remorse.' 'Friend, you admonished with what is beneficial, not with what is unbeneficial. This is sufficient for you to be without remorse.' 'Friend, you admonished with a mind of loving-kindness, not with inner ill-will. This is sufficient for you to be without remorse.'\" Friends, for a bhikkhu who has rightly admonished, remorselessness should be established in these five ways. For what reason? So that another bhikkhu might think that one should admonish with what is true.\n\n\"Friends, the person who has been admonished should establish themselves in two qualities: truthfulness and unshakeability. Even if, friends, others were to admonish me — whether at the right time or the wrong time, with what is true or with what is untrue, gently or harshly, with what is beneficial or with what is unbeneficial, with a mind of loving-kindness or with inner ill-will — I too would establish myself in these very two qualities: truthfulness and unshakeability. If I were to know, 'This quality is present in me,' I would say to them, 'It is present. This quality exists in me.' If I were to know, 'This quality is not present in me,' I would say to them, 'It is not present. This quality does not exist in me.' Even when instructed in this way, Sāriputta, some foolish individuals here do not accept it correctly.\"\n\n“Venerable Sir, there are individuals who are without faith, who have gone forth from the home life into homelessness for the sake of livelihood and not out of faith. They are deceitful, crafty, fraudulent, arrogant, haughty, fickle, garrulous, of scattered speech, with unguarded sense doors, immoderate in food, not devoted to wakefulness, having no regard for the recluse’s practice, having no strong respect for the training, fond of company, slack, foremost in backsliding, having cast off the burden of seclusion, lazy, of weak energy, of forgotten mindfulness, without clear comprehension, unconcentrated, with wandering minds, of poor wisdom, dumb and foolish. Such individuals, when thus spoken to by me, do not take it to heart.\n\n“But Venerable Sir, there are noble sons who are endowed with faith, who have gone forth from the home life into homelessness. They are not deceitful, not crafty, not fraudulent, not arrogant, not haughty, not fickle, not garrulous, of unscattered speech, with guarded sense doors, moderate in food, devoted to wakefulness, having regard for the recluse’s practice, having strong respect for the training, not fond of company, not slack, having put aside the burden of backsliding, foremost in seclusion, resolute in effort, dedicated in mind, of established mindfulness, with clear comprehension, concentrated, with one-pointed minds, wise, not dumb and foolish. Such individuals, when thus spoken to by me, do take it to heart.”\n\n“Sāriputta, as for those individuals who are without faith, who have gone forth from the home life into homelessness for the sake of livelihood and not out of faith—they are deceitful, crafty, fraudulent, arrogant, haughty, fickle, garrulous, of scattered speech, with unguarded sense doors, immoderate in food, not devoted to wakefulness, having no regard for the recluse’s practice, having no strong respect for the training, fond of company, slack, foremost in backsliding, having cast off the burden of seclusion, lazy, of weak energy, of forgotten mindfulness, without clear comprehension, unconcentrated, with wandering minds, of poor wisdom, dumb and foolish—let them be.\n\n“But Sāriputta, as for those noble sons who are endowed with faith, who have gone forth from the home life into homelessness—they are not deceitful, not crafty, not fraudulent, not arrogant, not haughty, not fickle, not garrulous, of unscattered speech, with guarded sense doors, moderate in food, devoted to wakefulness, having regard for the recluse’s practice, having strong respect for the training, not fond of company, not slack, having put aside the burden of backsliding, foremost in seclusion, resolute in effort, dedicated in mind, of established mindfulness, with clear comprehension, concentrated, with one-pointed minds, wise, not dumb and foolish—you, Sāriputta, should speak to them. Advise your fellow practitioners, Sāriputta; instruct your fellow practitioners, Sāriputta, saying: ‘I shall raise my fellow practitioners up from unwholesome states and establish them in the Dhamma.’ Thus, Sāriputta, should you train.”",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලා ඇමතූහ: \"ඇවැත්නි, අනුන්ට අවවාද කිරීමට කැමති අවවාද කරන භික්ෂුවක් විසින් තමන් තුළ ධර්ම පහක් පිහිටුවාගෙන අනුන්ට අවවාද කළ යුතුයි. ඒ ධර්ම පහ කවරේද? කාලයෙහිදී කතා කරන්නෙමි, අකාලයෙහිදී නොවේ; ඇත්ත ඇති සැටියෙන් කතා කරන්නෙමි, නැති දේ නොවේ; මෘදුව කතා කරන්නෙමි, රළු ලෙස නොවේ; අර්ථයට සම්බන්ධ දේ කතා කරන්නෙමි, අනර්ථයට සම්බන්ධ දේ නොවේ; මෛත්‍රී සිතින් කතා කරන්නෙමි, ද්වේෂ සහගත සිතින් නොවේ. ඇවැත්නි, අනුන්ට අවවාද කිරීමට කැමති භික්ෂුවක් විසින් තමන් තුළ මේ ධර්ම පහ පිහිටුවාගෙන අනුන්ට අවවාද කළ යුතුයි.\"\n\n\"ඇවැත්නි, මෙහිදී මම ඇතැම් පුද්ගලයෙකු දකිමි. ඔහුට අකාලයෙහි අවවාද කරනු ලැබුවද, (ඒ අවවාදය) කාලයෙහිදී වූවා සේ කිපෙන්නේ නැත; අසත්‍යයෙන් අවවාද කරනු ලැබුවද, සත්‍යයෙන් වූවා සේ කිපෙන්නේ නැත; රළු ලෙස අවවාද කරනු ලැබුවද, මෘදුව වූවා සේ කිපෙන්නේ නැත; අනර්ථයට සම්බන්ධ දේ කියා අවවාද කරනු ලැබුවද, අර්ථයට සම්බන්ධ දේ කියා වූවා සේ කිපෙන්නේ නැත; ද්වේෂ සහගත සිතින් අවවාද කරනු ලැබුවද, මෛත්‍රී සිතින් වූවා සේ කිපෙන්නේ නැත.\"\n\n\"ඇවැත්නි, අධර්මයෙන් අවවාද කරනු ලබන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් නොපසුතැවීම ඇති කරගත යුතුය: 'ඇවැත්නි, ඔබට අකාලයෙහි අවවාද කරනු ලැබුවේ, කාලයෙහිදී නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට අසත්‍යයෙන් අවවාද කරනු ලැබුවේ, සත්‍යයෙන් නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට රළු ලෙස අවවාද කරනු ලැබුවේ, මෘදුව නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට අනර්ථයට සම්බන්ධ දේ කියා අවවාද කරනු ලැබුවේ, අර්ථයට සම්බන්ධ දේ කියා නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට ද්වේෂ සහගත සිතින් අවවාද කරනු ලැබුවේ, මෛත්‍රී සිතින් නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ.' ඇවැත්නි, අධර්මයෙන් අවවාද කරනු ලබන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් නොපසුතැවීම ඇති කරගත යුතුය.\"\n\n\"ඇවැත්නි, අධර්මයෙන් අවවාද කරන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් පසුතැවීම ඇති කරගත යුතුය: 'ඇවැත්නි, ඔබ අකාලයෙහිදී අවවාද කළේ, කාලයෙහිදී නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ අසත්‍යයෙන් අවවාද කළේ, සත්‍යයෙන් නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ රළු ලෙස අවවාද කළේ, මෘදුව නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ අනර්ථයට සම්බන්ධ දේ කියා අවවාද කළේ, අර්ථයට සම්බන්ධ දේ කියා නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ ද්වේෂ සහගත සිතින් අවවාද කළේ, මෛත්‍රී සිතින් නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ.' ඇවැත්නි, අධර්මයෙන් අවවාද කරන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් පසුතැවීම ඇති කරගත යුතුය. එසේ කිරීමට හේතුව කුමක්ද? අනෙක් භික්ෂූන් ද අසත්‍යයෙන් අවවාද කළ යුතු යැයි නොසිතන පිණිසයි.\"\n\n\"ඇවැත්නි, මෙහිදී මම ඇතැම් පුද්ගලයෙකු දකිමි. ඔහුට කාලයෙහිදී අවවාද කරනු ලැබුවද, (ඒ අවවාදය) අකාලයෙහිදී වූවා සේ කිපෙන්නේ නැත; සත්‍යයෙන් අවවාද කරනු ලැබුවද, අසත්‍යයෙන් වූවා සේ කිපෙන්නේ නැත; මෘදුව අවවාද කරනු ලැබුවද, රළු ලෙස වූවා සේ කිපෙන්නේ නැත; අර්ථයට සම්බන්ධ දේ කියා අවවාද කරනු ලැබුවද, අනර්ථයට සම්බන්ධ දේ කියා වූවා සේ කිපෙන්නේ නැත; මෛත්‍රී සිතින් අවවාද කරනු ලැබුවද, ද්වේෂ සහගත සිතින් වූවා සේ කිපෙන්නේ නැත.\"\n\n\"ඇවැත්නි, ධර්මයෙන් අවවාද කරනු ලබන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් පසුතැවීම ඇති කරගත යුතුය: 'ඇවැත්නි, ඔබට කාලයෙහිදී අවවාද කරනු ලැබුවේ, අකාලයෙහිදී නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට සත්‍යයෙන් අවවාද කරනු ලැබුවේ, අසත්‍යයෙන් නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට මෘදුව අවවාද කරනු ලැබුවේ, රළු ලෙස නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට අර්ථයට සම්බන්ධ දේ කියා අවවාද කරනු ලැබුවේ, අනර්ථයට සම්බන්ධ දේ කියා නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබට මෛත්‍රී සිතින් අවවාද කරනු ලැබුවේ, ද්වේෂ සහගත සිතින් නොවේ. එබැවින් ඔබට පසුතැවීම ඇතිකරගැනීම සෑහේ.' ඇවැත්නි, ධර්මයෙන් අවවාද කරනු ලබන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් පසුතැවීම ඇති කරගත යුතුය.\"\n\n\"ඇවැත්නි, ධර්මයෙන් අවවාද කරන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් නොපසුතැවීම ඇති කරගත යුතුය: 'ඇවැත්නි, ඔබ කාලයෙහිදී අවවාද කළේ, අකාලයෙහිදී නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ සත්‍යයෙන් අවවාද කළේ, අසත්‍යයෙන් නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ මෘදුව අවවාද කළේ, රළු ලෙස නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ අර්ථයට සම්බන්ධ දේ කියා අවවාද කළේ, අනර්ථයට සම්බන්ධ දේ කියා නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ; ඇවැත්නි, ඔබ මෛත්‍රී සිතින් අවවාද කළේ, ද්වේෂ සහගත සිතින් නොවේ. එබැවින් ඔබට නොපසුතැවීම ඇතිකරගැනීම සෑහේ.' ඇවැත්නි, ධර්මයෙන් අවවාද කරන භික්ෂුවක් විසින් මේ පස් ආකාරයකින් නොපසුතැවීම ඇති කරගත යුතුය. එසේ කිරීමට හේතුව කුමක්ද? අනෙක් භික්ෂූන් ද සත්‍යයෙන් අවවාද කළ යුතු යැයි සිතන පිණිසයි.\"\n\n\"ඇවැත්නි, අවවාද කරනු ලබන පුද්ගලයෙකු විසින් ධර්ම දෙකක පිහිටා සිටිය යුතුය – එනම් සත්‍යයෙහිද, කෝප නොවීමෙහිද. ඇවැත්නි, අන්‍යයෝ මට කාලයෙහිදී හෝ අකාලයෙහිදී හෝ, සත්‍යයෙන් හෝ අසත්‍යයෙන් හෝ, මෘදුව හෝ රළු ලෙසින් හෝ, අර්ථයට සම්බන්ධ දේ කියා හෝ අනර්ථයට සම්බන්ධ දේ කියා හෝ, මෛත්‍රී සිතින් හෝ ද්වේෂ සහගත සිතින් හෝ අවවාද කළත්, මම ද මේ ධර්ම දෙකෙහිම පිහිටා සිටින්නෙමි – සත්‍යයෙහිද, කෝප නොවීමෙහිද. යම් හෙයකින් මා දැනගතහොත්, 'මේ ධර්මය මා තුළ ඇත' කියා, එවිට 'එය ඇත' කියා ඔහුට කියන්නෙමි – 'මේ ධර්මය මා තුළ පවතී' කියා. යම් හෙයකින් මා දැනගතහොත්, 'මේ ධර්මය මා තුළ නැත' කියා, එවිට 'එය නැත' කියා ඔහුට කියන්නෙමි – 'මේ ධර්මය මා තුළ නොපවතී' කියා. 'ශාරීපුත්‍රය, මෙසේ කියනු ලබන විට පවා, මෙහි ඇතැම් මෝඝ පුරුෂයෝ එය නිවැරදි ලෙස නොපිළිගනිති.'\"\n\nභාග්‍යවතුන් වහන්ස, යම් ඒ පුද්ගලයෝ ශ්‍රද්ධාවෙන් තොර වූ, දිවි ගෙවීමේ අරමුණින් යුක්ත වූ, සැබෑ ශ්‍රද්ධාවෙන් තොර ව ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වූ, කෛරාටික වූ, මයාකාරී වූ, වංචනික වූ, උද්ධත වූ, මානයෙන් උඩඟු වූ, චපල වූ, වාචාල වූ, විසුරුණු වචන ඇති, ඉන්ද්‍රියයන්ට දොරටු වසාලා නැති, භෝජනයෙහි පමණ නොදන්නා වූ, වීර්යයෙන් යුක්තව රාත්‍රියෙහි නොනැගී සිටින, ශ්‍රමණභාවය ගැන අපේක්‍ෂා රහිත වූ, සිකපදයන් කෙරෙහි දැඩි ගෞරවයක් නැති, බොහෝ දෑ ඇසුරු කරන, තමන්ගේ අභිප්‍රායන් ගැන උදාසීන වූ, සමාජයට (ආශ්‍රයට) පෙරටුව යන්නා වූ, විවේකයෙන් බර පහකරන්නා වූ, කුසීත වූ, හීන වීර්යය ඇති, මුළා වූ සිහි ඇති, නොදැනුවත් වූ, සමාධියෙන් තොර වූ, විභ්‍රාන්ත සිත් ඇති, දුෂ්ප්‍රාඥ වූ, ගොළු වූ, මුග්ධ වූවෝ වෙත්ද, මා විසින් මෙසේ කියනු ලබන විට ඒ අය නොපිළිගනිති.\n\nභාග්‍යවතුන් වහන්ස, යම් ඒ කුලපුත්‍රයෝ ශ්‍රද්ධාවෙන් යුක්ත වූ, ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වූ, කෛරාටික නොවන, මයාකාරී නොවන, වංචනික නොවන, උද්ධත නොවන, මානයෙන් උඩඟු නොවන, චපල නොවන, වාචාල නොවන, විසුරුණු වචන නැති, ඉන්ද්‍රියයන්ට දොරටු වසාගත්, භෝජනයෙහි පමණ දන්නා වූ, වීර්යයෙන් යුක්තව රාත්‍රියෙහි නැගී සිටින, ශ්‍රමණභාවය ගැන අපේක්‍ෂා සහිත වූ, සිකපදයන් කෙරෙහි දැඩි ගෞරවයක් ඇති, බොහෝ දෑ ඇසුරු නොකරන, තමන්ගේ අභිප්‍රායන් ගැන උදාසීන නොවන, සමාජයට (ආශ්‍රයට) බර පහකරන්නා වූ, විවේකයට පෙරටුව යන්නා වූ, ආරම්භ කළ වීර්යය ඇති, යොමු කළ සිතක් ඇති, ව්‍යක්ත සිහි ඇති, දැනුවත් වූ, සමාධියෙන් යුක්ත වූ, එකඟ සිත් ඇති, ප්‍රඥාවන්ත වූ, ගොළු නොවන, මුග්ධ නොවන වූවෝ වෙත්ද, මා විසින් මෙසේ කියනු ලබන විට ඒ අය පිළිගනිති.\n\nශාරිපුත්‍රය, යම් ඒ පුද්ගලයෝ ශ්‍රද්ධාවෙන් තොර වූ, දිවි ගෙවීමේ අරමුණින් යුක්ත වූ, සැබෑ ශ්‍රද්ධාවෙන් තොර ව ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වූ, කෛරාටික වූ, මයාකාරී වූ, වංචනික වූ, උද්ධත වූ, මානයෙන් උඩඟු වූ, චපල වූ, වාචාල වූ, විසුරුණු වචන ඇති, ඉන්ද්‍රියයන්ට දොරටු වසාලා නැති, භෝජනයෙහි පමණ නොදන්නා වූ, වීර්යයෙන් යුක්තව රාත්‍රියෙහි නොනැගී සිටින, ශ්‍රමණභාවය ගැන අපේක්‍ෂා රහිත වූ, සිකපදයන් කෙරෙහි දැඩි ගෞරවයක් නැති, බොහෝ දෑ ඇසුරු කරන, තමන්ගේ අභිප්‍රායන් ගැන උදාසීන වූ, සමාජයට (ආශ්‍රයට) පෙරටුව යන්නා වූ, විවේකයෙන් බර පහකරන්නා වූ, කුසීත වූ, හීන වීර්යය ඇති, මුළා වූ සිහි ඇති, නොදැනුවත් වූ, සමාධියෙන් තොර වූ, විභ්‍රාන්ත සිත් ඇති, දුෂ්ප්‍රාඥ වූ, ගොළු වූ, මුග්ධ වූවෝ වෙත්ද, ඔවුන් එසේම සිටිත්වා!\n\nශාරිපුත්‍රය, යම් ඒ කුලපුත්‍රයෝ ශ්‍රද්ධාවෙන් යුක්ත වූ, ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වූ, කෛරාටික නොවන, මයාකාරී නොවන, වංචනික නොවන, උද්ධත නොවන, මානයෙන් උඩඟු නොවන, චපල නොවන, වාචාල නොවන, විසුරුණු වචන නැති, ඉන්ද්‍රියයන්ට දොරටු වසාගත්, භෝජනයෙහි පමණ දන්නා වූ, වීර්යයෙන් යුක්තව රාත්‍රියෙහි නැගී සිටින, ශ්‍රමණභාවය ගැන අපේක්‍ෂා සහිත වූ, සිකපදයන් කෙරෙහි දැඩි ගෞරවයක් ඇති, බොහෝ දෑ ඇසුරු නොකරන, තමන්ගේ අභිප්‍රායන් ගැන උදාසීන නොවන, සමාජයට (ආශ්‍රයට) බර පහකරන්නා වූ, විවේකයට පෙරටුව යන්නා වූ, ආරම්භ කළ වීර්යය ඇති, යොමු කළ සිතක් ඇති, ව්‍යක්ත සිහි ඇති, දැනුවත් වූ, සමාධියෙන් යුක්ත වූ, එකඟ සිත් ඇති, ප්‍රඥාවන්ත වූ, ගොළු නොවන, මුග්ධ නොවන වූවෝ වෙත්ද, ශාරිපුත්‍රය, ඔබ ඔවුන්ට අවවාද කළ යුතුයි. ශාරිපුත්‍රය, ඔබ බ්‍රහ්මචාරීන් හට අවවාද කරන්න; ශාරිපුත්‍රය, ඔබ බ්‍රහ්මචාරීන් හට අනුශාසනා කරන්න – ‘අසද්ධර්මයෙන් මුදවා, සද්ධර්මයෙහි පිහිටුවන්නෙමි මගේ සබ්‍රහ්මචාරීන්’ යනුවෙන් (අනුශාසනා කරන්න). ශාරිපුත්‍රය, ඔබ මෙසේ හික්මිය යුතුයි.",
      "paliTitle": "Codanāsuttaṃ",
      "englishTitle": "The Accusation Sutta",
      "sinhalaTitle": "චෝදනා සූත්‍රය"
    },
    {
      "number": 168,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘dussīlassa, āvuso, sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi …pe… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, āvuso, dussīlassa sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Sīlavato, āvuso, sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho, sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi…pe… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, āvuso, sīlavato sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassana’’nti [a. ni. 5.168; 6.50; 7.65]. Aṭṭhamaṃ.",
      "english": "There on that occasion, the Venerable Sāriputta addressed the monks, saying: “Friends, for one who is immoral, who has failed in morality, Right Concentration loses its necessary foundation. When Right Concentration is absent, for one who has failed in Right Concentration, the Knowledge and Vision of Things as They Really Are loses its necessary foundation. When the Knowledge and Vision of Things as They Really Are is absent, for one who has failed in the Knowledge and Vision of Things as They Really Are, Disenchantment and Dispassion lose their necessary foundation. When Disenchantment and Dispassion are absent, for one who has failed in Disenchantment and Dispassion, the Knowledge and Vision of Deliverance loses its necessary foundation. Just as, friends, a tree that is deprived of its branches and leaves—its outer bark does not reach completion, nor does its inner bark, nor its sapwood, nor its heartwood. Even so, friends, for one who is immoral, who has failed in morality, Right Concentration loses its necessary foundation. When Right Concentration is absent, for one who has failed in Right Concentration, the Knowledge and Vision of Things as They Really Are loses its necessary foundation. When the Knowledge and Vision of Things as They Really Are is absent, for one who has failed in the Knowledge and Vision of Things as They Really Are, Disenchantment and Dispassion lose their necessary foundation. When Disenchantment and Dispassion are absent, for one who has failed in Disenchantment and Dispassion, the Knowledge and Vision of Deliverance loses its necessary foundation.”\n\n“Friends, for one who is moral, who is perfected in morality, Right Concentration has a complete foundation. When Right Concentration is present, for one who is perfected in Right Concentration, the Knowledge and Vision of Things as They Really Are has a complete foundation. When the Knowledge and Vision of Things as They Really Are is present, for one who is perfected in the Knowledge and Vision of Things as They Really Are, Disenchantment and Dispassion have a complete foundation. When Disenchantment and Dispassion are present, for one who is perfected in Disenchantment and Dispassion, the Knowledge and Vision of Deliverance has a complete foundation. Just as, friends, a tree that is endowed with its branches and leaves—its outer bark reaches completion, its inner bark does, its sapwood does, and its heartwood does. Even so, friends, for one who is moral, who is perfected in morality, Right Concentration has a complete foundation. When Right Concentration is present, for one who is perfected in Right Concentration, the Knowledge and Vision of Things as They Really Are has a complete foundation. When the Knowledge and Vision of Things as They Really Are is present, for one who is perfected in the Knowledge and Vision of Things as They Really Are, Disenchantment and Dispassion have a complete foundation. When Disenchantment and Dispassion are present, for one who is perfected in Disenchantment and Dispassion, the Knowledge and Vision of Deliverance has a complete foundation.”",
      "sinhala": "එහිදී ආයුෂ්මත් ශා​රිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක:\n\n\"ඇවැත්නි, දුශ්ශීල වූ, ශීලයෙන් පිරිහුණා වූ තැනැත්තාට සම්මා සමාධිය සඳහා වූ උපනිශ්‍රය (ප්‍රත්‍යය) නැති වී යයි; සම්මා සමාධිය නොමැති කල්හි, සම්මා සමාධියෙන් පිරිහුණා වූ තැනැත්තාට යථාභූත ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි; යථාභූත ඥාන​ දර්ශනය නොමැති කල්හි, යථාභූත ඥාන​ දර්ශනයෙන් පිරිහුණා වූ තැනැත්තාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය නැති වී යයි; නිබ්බිදා විරාගය නොමැති කල්හි, නිබ්බිදා විරාගයෙන් පිරිහුණා වූ තැනැත්තාට විමුක්ති ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ඇවැත්නි, යම්සේ අතුපතර හා කොළ රහිත වූ ගසක් වේ ද, එහි පොත්ත ද, සිවිය ද, එළවළු පොතු ද, හරය ද සම්පූර්ණත්වයට පත් නොවේ. ඇවැත්නි, එසෙයින්ම දුශ්ශීල වූ, ශීලයෙන් පිරිහුණා වූ තැනැත්තාට සම්මා සමාධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි; සම්මා සමාධිය නොමැති කල්හි, සම්මා සමාධියෙන් පිරිහුණා වූ තැනැත්තාට යථාභූත ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි; යථාභූත ඥාන​ දර්ශනය නොමැති කල්හි, යථාභූත ඥාන​ දර්ශනයෙන් පිරිහුණා වූ තැනැත්තාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය නැති වී යයි; නිබ්බිදා විරාගය නොමැති කල්හි, නිබ්බිදා විරාගයෙන් පිරිහුණා වූ තැනැත්තාට විමුක්ති ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි.\n\nඇවැත්නි, ශීලවන්ත වූ, ශීලයෙන් සම්පූර්ණ වූ තැනැත්තාට සම්මා සමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ; සම්මා සමාධිය ඇති කල්හි, සම්මා සමාධියෙන් සම්පූර්ණ වූ තැනැත්තාට යථාභූත ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ; යථාභූත ඥාන​ දර්ශනය ඇති කල්හි, යථාභූත ඥාන​ දර්ශනයෙන් සම්පූර්ණ වූ තැනැත්තාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ; නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගයෙන් සම්පූර්ණ වූ තැනැත්තාට විමුක්ති ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. ඇවැත්නි, යම්සේ අතුපතර හා කොළවලින් යුක්ත වූ ගසක් වේ ද, එහි පොත්ත ද, සිවිය ද, එළවළු පොතු ද, හරය ද සම්පූර්ණත්වයට පත් වේ. ඇවැත්නි, එසෙයින්ම ශීලවන්ත වූ, ශීලයෙන් සම්පූර්ණ වූ තැනැත්තාට සම්මා සමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ; සම්මා සමාධිය ඇති කල්හි, සම්මා සමාධියෙන් සම්පූර්ණ වූ තැනැත්තාට යථාභූත ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ; යථාභූත ඥාන​ දර්ශනය ඇති කල්හි, යථාභූත ඥාන​ දර්ශනයෙන් සම්පූර්ණ වූ තැනැත්තාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ; නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගයෙන් සම්පූර්ණ වූ තැනැත්තාට විමුක්ති ඥාන​ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ.\"",
      "paliTitle": "Sīlasuttaṃ",
      "englishTitle": "The Discourse on Virtue",
      "sinhalaTitle": "සීල සූත්‍රය"
    },
    {
      "number": 169,
      "pali": "Atha kho āyasmā ānando yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ [sārāṇīyaṃ (sī. syā. kaṃ. pī.)] vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Kittāvatā nu kho, āvuso sāriputta, bhikkhu khippanisanti ca hoti, kusalesu dhammesu suggahitaggāhī ca, bahuñca gaṇhāti, gahitañcassa nappamussatī’’ti? ‘‘Āyasmā kho ānando bahussuto. Paṭibhātu āyasmantaṃyeva ānanda’’nti. ‘‘Tenahāvuso sāriputta, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho āyasmā sāriputto āyasmato ānandassa paccassosi. Āyasmā ānando etadavoca – ‘‘Idhāvuso sāriputta, bhikkhu atthakusalo ca hoti, dhammakusalo ca, byañjanakusalo ca, niruttikusalo ca, pubbāparakusalo ca. Ettāvatā kho, āvuso sāriputta, bhikkhu khippanisanti ca hoti kusalesu dhammesu, suggahitaggāhī ca, bahuñca gaṇhāti, gahitañcassa nappamussatī’’ti. ‘‘Acchariyaṃ, āvuso! Abbhutaṃ, āvuso!! Yāva subhāsitaṃ cidaṃ āyasmatā ānandena. Imehi ca mayaṃ pañcahi dhammehi samannāgataṃ āyasmantaṃ ānandaṃ dhārema – ‘āyasmā ānando atthakusalo dhammakusalo byañjanakusalo niruttikusalo pubbāparakusalo’’’ti. Navamaṃ.",
      "english": "Then, the Venerable Ānanda approached the Venerable Sāriputta. Having approached, he exchanged friendly greetings with the Venerable Sāriputta. After exchanging polite and memorable conversation, he sat down to one side.\n\nAs he sat to one side, the Venerable Ānanda said to the Venerable Sāriputta, \"By what measure, friend Sāriputta, does a monk become quick in understanding, firm in grasping wholesome teachings, able to comprehend much, and not forget what he has comprehended?\"\n\n\"Indeed, the Venerable Ānanda is very learned. May it occur to the Venerable Ānanda himself to explain.\"\n\n\"Then, friend Sāriputta, listen and attend carefully; I will speak.\"\n\n\"Yes, friend,\" the Venerable Sāriputta replied to the Venerable Ānanda.\n\nThe Venerable Ānanda then said, \"Here, friend Sāriputta, a monk is skilled in meaning, skilled in the Dhamma, skilled in expression, skilled in language, and skilled in sequence and connection. It is by this measure, friend Sāriputta, that a monk becomes quick in understanding wholesome teachings, firm in grasping them, able to comprehend much, and not forget what he has comprehended.\"\n\n\"Wonderful, friend! Amazing, friend! How well spoken this has been by the Venerable Ānanda. Indeed, we regard the Venerable Ānanda as endowed with these five qualities: 'The Venerable Ānanda is skilled in meaning, skilled in the Dhamma, skilled in expression, skilled in language, and skilled in sequence and connection.'\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද තෙරණුවෝ ආයුෂ්මත් ශ්‍රී සාරිපුත්ත තෙරණුවන් වැඩසිටි තැනට පැමිණියහ. පැමිණ, ආයුෂ්මත් ශ්‍රී සාරිපුත්ත තෙරණුවන් සමඟ සතුටු වූහ. ප්‍රිය මනාප, සිහි කටයුතු කතා බහ නිමවා එක් පසෙකින් වාඩි වූහ.\n\nඑක් පසෙකින් වාඩි වී සිටි ආයුෂ්මත් ආනන්ද තෙරණුවෝ ආයුෂ්මත් ශ්‍රී සාරිපුත්ත තෙරණුවන්ට මෙය පැවසූහ: “ඇවැත් සාරිපුත්තය, කවර කරුණකින් නම් භික්ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධයට පත් වෙයි ද, මැනවින් ග්‍රහණය කරගනියි ද, බොහෝ දේ උගනියි ද, උගත් දෑ අමතක නොකරයි ද?” “ආයුෂ්මත් ආනන්ද තෙරණුවෝ ඉතා බහුශ්‍රැතයහ. ආයුෂ්මත් ආනන්ද තෙරණුවෝම එය විස්තර කළ මැනව.” “එසේ නම් ඇවැත් සාරිපුත්තය, අසන්න, මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.” “එසේය ඇවැත්නි” යි ආයුෂ්මත් ශ්‍රී සාරිපුත්ත තෙරණුවෝ ආයුෂ්මත් ආනන්ද තෙරණුවන්ට පිළිතුරු දුන්හ.\n\nආයුෂ්මත් ආනන්ද තෙරණුවෝ මෙය පැවසූහ: “ඇවැත් සාරිපුත්තය, මෙහිලා භික්ෂුව අර්ථයෙහි දක්ෂ වෙයි, ධර්මයෙහි දක්ෂ වෙයි, ව්‍යංජනයෙහි දක්ෂ වෙයි, නිරුක්තියෙහි දක්ෂ වෙයි, පූර්වාපර සම්බන්ධයෙහි දක්ෂ වෙයි. ඇවැත් සාරිපුත්තය, මේ කරුණු පහෙන් යුක්ත වීම නිසාම භික්ෂුව කුසල ධර්මයන් ඉක්මනින් අවබෝධ කරගනියි, මැනවින් ග්‍රහණය කරගනියි, බොහෝ දේ උගනියි, උගත් දෑ අමතක නොකරයි.” “ඇවැත්නි, ආශ්චර්යයකි! ඇවැත්නි, අද්භූතයකි!! ආයුෂ්මත් ආනන්ද තෙරණුවන් විසින් කෙතරම් මැනවින් දේශනා කරන ලද්දක් ද මෙය. අපි ද ආයුෂ්මත් ආනන්ද තෙරණුවන් මේ ධර්ම පහෙන් යුක්ත බව දනිමු – ‘ආයුෂ්මත් ආනන්ද තෙරණුවෝ අර්ථයෙහි දක්ෂයහ, ධර්මයෙහි දක්ෂයහ, ව්‍යංජනයෙහි දක්ෂයහ, නිරුක්තියෙහි දක්ෂයහ, පූර්වාපර සම්බන්ධයෙහි දක්ෂයහ’ යනුවෙනි.”",
      "paliTitle": "Khippanisantisuttaṃ",
      "englishTitle": "Quick Insight Sutta",
      "sinhalaTitle": "ඛිප්පනිසන්ති සූත්‍රය"
    },
    {
      "number": 170,
      "pali": "Ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho āyasmā bhaddaji yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ bhaddajiṃ āyasmā ānando etadavoca – ‘‘kiṃ nu kho, āvuso bhaddaji, dassanānaṃ aggaṃ, kiṃ savanānaṃ aggaṃ, kiṃ sukhānaṃ aggaṃ, kiṃ saññānaṃ aggaṃ, kiṃ bhavānaṃ agga’’nti? ‘‘Atthāvuso, brahmā abhibhū anabhibhūto aññadatthudaso vasavattī, yo taṃ brahmānaṃ passati, idaṃ dassanānaṃ aggaṃ. Atthāvuso, ābhassarā nāma devā sukhena abhisannā parisannā. Te kadāci karahaci udānaṃ udānenti – ‘aho sukhaṃ, aho sukha’nti! Yo taṃ saddaṃ suṇāti, idaṃ savanānaṃ aggaṃ. Atthāvuso, subhakiṇhā nāma devā. Te santaṃyeva tusitā sukhaṃ paṭivedenti, idaṃ sukhānaṃ aggaṃ. Atthāvuso, ākiñcaññāyatanūpagā devā, idaṃ saññānaṃ aggaṃ. Atthāvuso, nevasaññānāsaññāyatanūpagā devā, idaṃ bhavānaṃ agga’’nti. ‘‘Sameti kho idaṃ āyasmato bhaddajissa, yadidaṃ bahunā janenā’’ti? ‘‘Āyasmā kho, ānando, bahussuto. Paṭibhātu āyasmantaṃyeva ānanda’’nti. ‘‘Tenahāvuso bhaddaji, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho āyasmā bhaddaji āyasmato ānandassa paccassosi. Āyasmā ānando etadavoca – ‘‘Yathā passato kho, āvuso, anantarā āsavānaṃ khayo hoti, idaṃ dassanānaṃ aggaṃ. Yathā suṇato anantarā āsavānaṃ khayo hoti, idaṃ savanānaṃ aggaṃ. Yathā sukhitassa anantarā āsavānaṃ khayo hoti, idaṃ sukhānaṃ aggaṃ. Yathā saññissa anantarā āsavānaṃ khayo hoti, idaṃ saññānaṃ aggaṃ. Yathā bhūtassa anantarā āsavānaṃ khayo hoti, idaṃ bhavānaṃ agga’’nti. Dasamaṃ. ",
      "english": "At one time, the Venerable Ananda was staying in Kosambi, at Ghosita’s Park. Then the Venerable Bhaddaji approached the Venerable Ananda. Having approached, he exchanged courteous greetings with the Venerable Ananda. After exchanging pleasantries and amiable conversation, he sat down to one side.\n\nAs the Venerable Bhaddaji sat to one side, the Venerable Ananda said this to him: \"Now then, friend Bhaddaji, what is the best of sights, what is the best of hearings, what is the best of pleasures, what is the best of perceptions, what is the best of existences?\"\n\n\"There is, friend, Brahma, the Overlord, the Unovercome, the All-seeing, the Wielder of Power. He who sees that Brahma, this is the best of sights. There are, friend, the Radiant Devas, entirely immersed and pervaded by pleasure. They sometimes on occasion utter an exclamation: 'Oh, what pleasure! Oh, what pleasure!' He who hears that sound, this is the best of hearings. There are, friend, the Devas of Auspicious Radiance. They experience a serene and tranquil pleasure entirely by themselves. This is the best of pleasures. There are, friend, the devas who have attained the base of no-thingness. This is the best of perceptions. There are, friend, the devas who have attained the base of neither-perception-nor-non-perception. This is the best of existences.\"\n\n\"Does this accord, Venerable Bhaddaji, with what many people say?\"\n\n\"Indeed, Venerable Ananda is learned. May Venerable Ananda himself see fit to expound.\"\n\n\"Then, friend Bhaddaji, listen, attend carefully; I shall speak.\" \"Yes, friend,\" replied the Venerable Bhaddaji to the Venerable Ananda.\n\nThe Venerable Ananda said this: \"When one sees in such a way, friend, that immediately the taints are destroyed, this is the best of sights. When one hears in such a way that immediately the taints are destroyed, this is the best of hearings. When one experiences pleasure in such a way that immediately the taints are destroyed, this is the best of pleasures. When one perceives in such a way that immediately the taints are destroyed, this is the best of perceptions. When one exists in such a way that immediately the taints are destroyed, this is the best of existences.\"",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කොසඹෑ නුවර ඝෝෂිතාරාමයේ වැඩසිටියාහ. ඉක්බිති ආයුෂ්මත් භද්දජී ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියාහ; පැමිණ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු සිහි කටයුතු කථා බස් හුවමාරු කරගෙන, එක් පසෙකින් වැඩහුන්හ. එක් පසෙකින් වැඩහුන් ආයුෂ්මත් භද්දජී ස්ථවිරයන් වහන්සේට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙය වදාළහ: \"ඇවැත් භද්දජී, දැකීමෙන් අග්‍ර​ වන්නේ කුමක්ද? ශ්‍ර​වණයෙන් අග්‍ර​ වන්නේ කුමක්ද? සැපයෙන් අග්‍ර​ වන්නේ කුමක්ද? සංඥාවන්ගෙන් අග්‍ර​ වන්නේ කුමක්ද? භවයන්ගෙන් අග්‍ර​ වන්නේ කුමක්ද?\"\n\n\"ඇවැත්නි, අභිබවන සුළු වූ, අභිබවා නොලැබූ, අන් අරමුණු දකින, වසඟයෙහි පවත්වන බ්‍රහ්මයෙක් ඇත. යමෙක් ඒ බ්‍රහ්මයා දකින්නේ නම්, මෙය දැකීමෙන් අග්‍ර​ වේ. ඇවැත්නි, ආභස්සර නම් දෙවිවරු සැපයෙන් පිරී, මොනවට පිරී පවතින්නාහු වෙති. ඔවුහු ඇතැම් විටකදී, 'අහෝ සැපය, අහෝ සැපය' යනුවෙන් උදාන වදන් පවසති. යමෙක් ඒ ශබ්දය අසන්නේ නම්, මෙය ශ්‍ර​වණයෙන් අග්‍ර​ වේ. ඇවැත්නි, සුභකිණ්හ නම් දෙවිවරු වෙති. ඔවුහු සන්සුන් වූවාහු, සතුටු වූවාහු, සැපය අත්විඳිති. මෙය සැපයෙන් අග්‍ර​ වේ. ඇවැත්නි, ආකිංචඤ්ඤායතන භූමියට පැමිණි දෙවිවරු වෙති. මෙය සංඥාවන්ගෙන් අග්‍ර​ වේ. ඇවැත්නි, නේවසඤ්ඤානාසඤ්ඤායතන භූමියට පැමිණි දෙවිවරු වෙති. මෙය භවයන්ගෙන් අග්‍ර​ වේ.\"\n\n\"ඇවැත් භද්දජීගේ මේ පිළිතුර, බොහෝ දෙනා විසින් පිළිගන්නා මතය හා සමාන වේද?\" \"ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ නම් බොහෝ ඇසූ පිරූ තැන් ඇත්තෙකි. ඒ නිසා, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේටම පිළිතුරු දීමට සුදුසුය.\" \"එසේ නම් ඇවැත් භද්දජී, අසන්න, මනාකොට මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\" \"එසේය ඇවැත්නි\"යි ආයුෂ්මත් භද්දජී ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ.\n\nආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙසේ වදාළහ: \"ඇවැත්නි, යමෙකුට යම් ලෙසින් දකිද්දී ඍජුවම කෙලෙස් ක්ෂය වන්නේද, මෙය දැකීමෙන් අග්‍ර​ වේ. යමෙකුට යම් ලෙසින් අසද්දී ඍජුවම කෙලෙස් ක්ෂය වන්නේද, මෙය ශ්‍ර​වණයෙන් අග්‍ර​ වේ. යමෙකුට යම් ලෙසින් සුවයෙන් සිටිද්දී ඍජුවම කෙලෙස් ක්ෂය වන්නේද, මෙය සැපයෙන් අග්‍ර​ වේ. යමෙකුට යම් ලෙසින් සංඥා ඇති විට ඍජුවම කෙලෙස් ක්ෂය වන්නේද, මෙය සංඥාවන්ගෙන් අග්‍ර​ වේ. යමෙකුට යම් ලෙසින් පවතින්නා වූ කල්හි ඍජුවම කෙලෙස් ක්ෂය වන්නේද, මෙය භවයන්ගෙන් අග්‍ර​ වේ.\"",
      "paliTitle": "Bhaddajisuttaṃ",
      "englishTitle": "Bhaddaji Sutta",
      "sinhalaTitle": "භද්දජි සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Āghātavaggo dutiyo. Tassuddānaṃ – Dve āghātavinayā, sākacchā sājīvato pañhaṃ; Pucchā nirodho codanā, sīlaṃ nisanti bhaddajīti.",
    "english": "The Chapter on Resentment is the second. The summary of it: Two on Removing Resentment, Discussion, Living with, Question; Inquiry, Cessation, Accusation, Virtue, and Bhaddaji.",
    "sinhala": "දෙවන ආඝාත වර්ගයයි. එහි උද්දානය නම්: ආඝාතවිනය දෙකක්, සාකච්ඡා, සාජීව, පඤ්හ, පුච්ඡා, නිරෝධ, චෝදනා, සීල සහ භද්දජි යන සූත්‍රයි."
  }
}