{
  "id": "an5.8",
  "title": {
    "pali": "Yodhājīvavaggo",
    "english": "The Chapter on the Warrior",
    "sinhala": "යෝධාජීව වර්ගය"
  },
  "sections": [
    {
      "number": 71,
      "pali": "‘‘Pañcime, bhikkhave, dhammā bhāvitā bahulīkatā cetovimuttiphalā ca honti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca honti paññāvimuttiphalānisaṃsā ca. ‘‘Katame pañca? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī [paṭikkūlasaññī (sī. syā. kaṃ. pī.)], sabbaloke anabhiratasaññī, sabbasaṅkhāresu aniccānupassī, maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. Ime kho, bhikkhave, pañca dhammā bhāvitā bahulīkatā cetovimuttiphalā ca honti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca honti paññāvimuttiphalānisaṃsā ca. Yato kho, bhikkhave, bhikkhu cetovimutto ca hoti paññāvimutto ca hoti – ayaṃ vuccati, bhikkhave, ‘bhikkhu ukkhittapaligho itipi, saṃkiṇṇaparikho [saṃkiṇṇaparikkho (syā. kaṃ.)] itipi, abbūḷhesiko itipi, niraggaḷo itipi, ariyo pannaddhajo pannabhāro visaṃyutto itipi’’’. ‘‘Kathañca, bhikkhave, bhikkhu ukkhittapaligho hoti? Idha, bhikkhave, bhikkhuno avijjā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Evaṃ kho, bhikkhave, bhikkhu ukkhittapaligho hoti. ‘‘Kathañca, bhikkhave, bhikkhu saṃkiṇṇaparikho hoti? Idha, bhikkhave, bhikkhuno ponobhaviko [ponobbhaviko (syā. ka.)] jātisaṃsāro pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu saṃkiṇṇaparikho hoti. ‘‘Kathañca, bhikkhave, bhikkhu abbūḷhesiko hoti? Idha, bhikkhave, bhikkhuno taṇhā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Evaṃ kho, bhikkhave, bhikkhu abbūḷhesiko hoti. ‘‘Kathañca, bhikkhave, bhikkhu niraggaḷo hoti? Idha, bhikkhave, bhikkhuno pañcorambhāgiyāni saṃyojanāni pahīnāni honti ucchinnamūlāni tālāvatthukatāni anabhāvaṃkatāni āyatiṃ anuppādadhammāni. Evaṃ kho, bhikkhave, bhikkhu niraggaḷo hoti. ‘‘Kathañca, bhikkhave, bhikkhu ariyo pannaddhajo pannabhāro visaṃyutto hoti? Idha, bhikkhave, bhikkhuno asmimāno pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu ariyo pannaddhajo pannabhāro visaṃyutto hotī’’ti. Paṭhamaṃ.",
      "english": "Monastics, these five things, when developed and repeatedly cultivated, are fruitful in mental liberation and have the benefit of mental liberation, and are fruitful in liberation through wisdom and have the benefit of liberation through wisdom. Which five? Here, monastics, a monk dwells contemplating the unattractiveness of the body, perceives the repulsiveness in food, perceives disenchantment with the entire world, contemplates impermanence in all conditioned phenomena, and the perception of death is well established within him. Monastics, these five things, when developed and repeatedly cultivated, are fruitful in mental liberation and have the benefit of mental liberation, and are fruitful in liberation through wisdom and have the benefit of liberation through wisdom. When, monastics, a monk is liberated in mind and liberated through wisdom—that monk, monastics, is called 'one who has lifted the bar,' 'one whose moat has been filled in,' 'one who has pulled out the pillar,' 'one who has removed the bolt,' and 'a noble one who has dropped the banner, dropped the burden, and is disjoined.'\n\nAnd how, monastics, is a monk 'one who has lifted the bar'? Here, monastics, a monk's ignorance is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, no longer liable to arise in the future. This is how, monastics, a monk is 'one who has lifted the bar.'\n\nAnd how, monastics, is a monk 'one whose moat has been filled in'? Here, monastics, a monk's cycle of rebirth leading to renewed existence is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, no longer liable to arise in the future. This is how, monastics, a monk is 'one whose moat has been filled in.'\n\nAnd how, monastics, is a monk 'one who has pulled out the pillar'? Here, monastics, a monk's craving is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, no longer liable to arise in the future. This is how, monastics, a monk is 'one who has pulled out the pillar.'\n\nAnd how, monastics, is a monk 'one who has removed the bolt'? Here, monastics, a monk's five lower fetters are abandoned, cut off at the root, made like a palm-stump, brought to non-existence, no longer liable to arise in the future. This is how, monastics, a monk is 'one who has removed the bolt.'\n\nAnd how, monastics, is a monk 'a noble one who has dropped the banner, dropped the burden, and is disjoined'? Here, monastics, a monk's conceit 'I am' is abandoned, cut off at the root, made like a palm-stump, brought to non-existence, no longer liable to arise in the future. This is how, monastics, a monk is 'a noble one who has dropped the banner, dropped the burden, and is disjoined.'",
      "sinhala": "මහණෙනි, භාවනා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ ධර්මයන් පහක් ඇත. ඒවා චේතෝවිමුක්ති ඵලය ද, චේතෝවිමුක්තියෙහි ආනිසංසය ද වෙයි; ප්‍රඥා විමුක්ති ඵලය ද, ප්‍රඥා විමුක්තියෙහි ආනිසංසය ද වෙයි.\n\nඒ පහ කුමක්ද? මහණෙනි, මෙහි භික්ෂුව කයෙහි අසුභ වශයෙන් බලමින් වාසය කරයි; ආහාරයෙහි ප්‍රතිපකුල සංඥාවෙන් යුක්ත වෙයි; සියලු ලෝකයෙහි අභිරතියක් නොමැති බව පිළිබඳ සංඥාවෙන් යුක්ත වෙයි; සියලු සංස්කාරයන්හි අනිත්‍ය වශයෙන් බලමින් වාසය කරයි; මරණ සංඥාව ද ඔහුට ඇතුළතින් හොඳින් පිහිටා තිබේ. මහණෙනි, භාවනා කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ ධර්මයන් පහ චේතෝවිමුක්ති ඵලය ද, චේතෝවිමුක්තියෙහි ආනිසංසය ද වෙයි; ප්‍රඥා විමුක්ති ඵලය ද, ප්‍රඥා විමුක්තියෙහි ආනිසංසය ද වෙයි.\n\nමහණෙනි, යම් කලෙක භික්ෂුව චේතෝවිමුක්ත ද, ප්‍රඥා විමුක්ත ද වෙයි ද, මහණෙනි, ඒ භික්ෂුව ‘අගුල පහ කළ භික්ෂුව’ යැයි ද, ‘ගැඹුරු දිය අගල වැසූ භික්ෂුව’ යැයි ද, ‘කුළුගෙඩිය උදුරා දැමූ භික්ෂුව’ යැයි ද, ‘කෙලෙස් අගුල් නැති භික්ෂුව’ යැයි ද, ‘ධජය පහ කළ, බර පහ කළ, කෙලෙස් බැඳුම් වලින් මුළුමනින්ම මිදුණු ආර්ය භික්ෂුව’ යැයි ද කියනු ලැබේ.\n\nමහණෙනි, භික්ෂුව ‘අගුල පහ කළ’ කෙනෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවට අවිද්‍යාව පහ වී, මුලිනුපුටා දමා, තල් ගසක මුලක් මෙන් කොට, නැති කර දමා, නැවත නූපදින ස්වභාවයෙන් යුක්ත වෙයි. මහණෙනි, මෙසේ භික්ෂුව ‘අගුල පහ කළ’ කෙනෙක් වෙයි.\n\nමහණෙනි, භික්ෂුව ‘ගැඹුරු දිය අගල වැසූ’ කෙනෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවට ප්‍රතිසන්ධියට හේතු වන ජාති සංසාරය පහ වී, මුලිනුපුටා දමා, තල් ගසක මුලක් මෙන් කොට, නැති කර දමා, නැවත නූපදින ස්වභාවයෙන් යුක්ත වෙයි. මහණෙනි, මෙසේ භික්ෂුව ‘ගැඹුරු දිය අගල වැසූ’ කෙනෙක් වෙයි.\n\nමහණෙනි, භික්ෂුව ‘කුළුගෙඩිය උදුරා දැමූ’ කෙනෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවට තණ්හාව පහ වී, මුලිනුපුටා දමා, තල් ගසක මුලක් මෙන් කොට, නැති කර දමා, නැවත නූපදින ස්වභාවයෙන් යුක්ත වෙයි. මහණෙනි, මෙසේ භික්ෂුව ‘කුළුගෙඩිය උදුරා දැමූ’ කෙනෙක් වෙයි.\n\nමහණෙනි, භික්ෂුව ‘කෙලෙස් අගුල් නැති’ කෙනෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවට ඕරම්භාගීය සංයෝජන පහ පහ වී, මුලිනුපුටා දමා, තල් ගසක මුලක් මෙන් කොට, නැති කර දමා, නැවත නූපදින ස්වභාවයෙන් යුක්ත වෙයි. මහණෙනි, මෙසේ භික්ෂුව ‘කෙලෙස් අගුල් නැති’ කෙනෙක් වෙයි.\n\nමහණෙනි, භික්ෂුව ‘ධජය පහ කළ, බර පහ කළ, කෙලෙස් බැඳුම් වලින් මුළුමනින්ම මිදුණු ආර්ය කෙනෙක්’ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවට අස්මිමානය පහ වී, මුලිනුපුටා දමා, තල් ගසක මුලක් මෙන් කොට, නැති කර දමා, නැවත නූපදින ස්වභාවයෙන් යුක්ත වෙයි. මහණෙනි, මෙසේ භික්ෂුව ‘ධජය පහ කළ, බර පහ කළ, කෙලෙස් බැඳුම් වලින් මුළුමනින්ම මිදුණු ආර්ය කෙනෙක්’ වෙයි.",
      "paliTitle": "Paṭhamacetovimuttiphalasuttaṃ",
      "englishTitle": "The First Discourse on the Fruit of Release of Mind",
      "sinhalaTitle": "පළමු චේතෝවිමුත්තිඵල සූත්‍රය"
    },
    {
      "number": 72,
      "pali": "‘‘Pañcime, bhikkhave, dhammā bhāvitā bahulīkatā cetovimuttiphalā ca honti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca honti paññāvimuttiphalānisaṃsā ca. Katame pañca? Aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā – ime kho, bhikkhave, pañca dhammā bhāvitā bahulīkatā cetovimuttiphalā ca honti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca honti paññāvimuttiphalānisaṃsā ca. Yato kho, bhikkhave, bhikkhu cetovimutto ca hoti paññāvimutto ca – ayaṃ vuccati, bhikkhave, ‘bhikkhu ukkhittapaligho itipi, saṃkiṇṇaparikho itipi, abbūḷhesiko itipi, niraggaḷo itipi, ariyo pannaddhajo pannabhāro visaṃyutto itipi’’’. ‘‘Kathañca, bhikkhave, bhikkhu ukkhittapaligho hoti? Idha, bhikkhave, bhikkhuno avijjā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Evaṃ kho, bhikkhave, bhikkhu ukkhittapaligho hoti. ‘‘Kathañca, bhikkhave, bhikkhu saṃkiṇṇaparikho hoti? Idha, bhikkhave, bhikkhuno ponobhaviko jātisaṃsāro pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu saṃkiṇṇaparikho hoti. ‘‘Kathañca, bhikkhave, bhikkhu abbūḷhesiko hoti? Idha, bhikkhave, bhikkhuno taṇhā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Evaṃ kho, bhikkhave, bhikkhu abbūḷhesiko hoti. ‘‘Kathañca, bhikkhave, bhikkhu niraggaḷo hoti? Idha, bhikkhave, bhikkhuno pañcorambhāgiyāni saṃyojanāni pahīnāni honti ucchinnamūlāni tālāvatthukatāni anabhāvaṃkatāni āyatiṃ anuppādadhammāni. Evaṃ kho, bhikkhave, bhikkhu niraggaḷo hoti. ‘‘Kathañca, bhikkhave, bhikkhu ariyo pannaddhajo pannabhāro visaṃyutto hoti? Idha, bhikkhave, bhikkhuno asmimāno pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu ariyo pannaddhajo pannabhāro visaṃyutto hotī’’ti. Dutiyaṃ.",
      "english": "These five qualities, monks, when developed and often practiced, lead to the fruit of liberation of mind and have the advantages of the liberation of mind, and lead to the fruit of liberation by wisdom and have the advantages of the liberation by wisdom. Which five? The perception of impermanence, the perception of suffering in what is impermanent, the perception of non-self in what is suffering, the perception of abandoning, the perception of dispassion – these five qualities, monks, when developed and often practiced, lead to the fruit of liberation of mind and have the advantages of the liberation of mind, and lead to the fruit of liberation by wisdom and have the advantages of the liberation by wisdom. When, monks, a monk is liberated in mind and liberated by wisdom, he is called, monks, 'a monk whose cross-bar has been lifted', 'whose moat has been filled in', 'whose pillar has been pulled up', 'who is without a bolt', 'a noble one who has laid down his banner, laid down his burden, and is unyoked'.\n\nAnd how, monks, is a monk 'one whose cross-bar has been lifted'? Here, monks, a monk’s ignorance is abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising. In this way, monks, a monk is 'one whose cross-bar has been lifted'.\n\nAnd how, monks, is a monk 'one whose moat has been filled in'? Here, monks, a monk’s cycle of rebirth leading to future existence is abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising. In this way, monks, a monk is 'one whose moat has been filled in'.\n\nAnd how, monks, is a monk 'one whose pillar has been pulled up'? Here, monks, a monk’s craving is abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising. In this way, monks, a monk is 'one whose pillar has been pulled up'.\n\nAnd how, monks, is a monk 'one who is without a bolt'? Here, monks, a monk’s five lower fetters are abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising. In this way, monks, a monk is 'one who is without a bolt'.\n\nAnd how, monks, is a monk 'a noble one who has laid down his banner, laid down his burden, and is unyoked'? Here, monks, a monk’s 'I am' conceit is abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising. In this way, monks, a monk is 'a noble one who has laid down his banner, laid down his burden, and is unyoked'.",
      "sinhala": "මහණෙනි, මේ ධර්මයන් පහක් වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව චේතෝවිමුක්තියේ ඵල ඇත්තාහ, චේතෝවිමුක්තියේ අනුසස් ඇත්තාහ. ප්‍රඥා විමුක්තියේ ඵල ඇත්තාහ, ප්‍රඥා විමුක්තියේ අනුසස් ඇත්තාහ. කවරේද ඒ පහ? අනිච්ච සංඥාව, අනිත්‍ය දේ දුක්ය යන සංඥාව, දුකෙහි අනාත්ම සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව – මහණෙනි, මේ ධර්මයන් පහ වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව චේතෝවිමුක්තියේ ඵල ඇත්තාහ, චේතෝවිමුක්තියේ අනුසස් ඇත්තාහ. ප්‍රඥා විමුක්තියේ ඵල ඇත්තාහ, ප්‍රඥා විමුක්තියේ අනුසස් ඇත්තාහ.\n\nමහණෙනි, යම් කලෙක භික්ෂුවක් චේතෝවිමුක්තියෙන් යුක්ත වෙයිද, ප්‍රඥා විමුක්තියෙන් යුක්ත වෙයිද, මහණෙනි, මේ භික්ෂුව 'උක්ඛිත්තපලිඝ නම් වේ, සංකිණ්ණපරිඝ නම් වේ, අබ්බූළ්හෙසික නම් වේ, නිරග්ගළ නම් වේ, ආරිය පන්නද්ධජ, පන්නභාර, විසංයුත්ත නම් වේ' යැයි කියනු ලැබේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් උක්ඛිත්තපලිඝ වේද? මහණෙනි, මෙහිලා භික්ෂුවගේ අවිද්‍යාව ප්‍රහීණ වී ඇත, මුලින් උදුරා දමා ඇත, තල් රුකක් මෙන් මුලසුන් කර ඇත, නැතිකර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. මහණෙනි, භික්ෂුවක් මෙසේ උක්ඛිත්තපලිඝ වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් සංකිණ්ණපරිඝ වේද? මහණෙනි, මෙහිලා භික්ෂුවගේ නැවත භවයට හේතුවන ජාති සංසාරය ප්‍රහීණ වී ඇත, මුලින් උදුරා දමා ඇත, තල් රුකක් මෙන් මුලසුන් කර ඇත, නැතිකර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. මහණෙනි, භික්ෂුවක් මෙසේ සංකිණ්ණපරිඝ වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් අබ්බූළ්හෙසික වේද? මහණෙනි, මෙහිලා භික්ෂුවගේ තණ්හාව ප්‍රහීණ වී ඇත, මුලින් උදුරා දමා ඇත, තල් රුකක් මෙන් මුලසුන් කර ඇත, නැතිකර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. මහණෙනි, භික්ෂුවක් මෙසේ අබ්බූළ්හෙසික වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් නිරග්ගළ වේද? මහණෙනි, මෙහිලා භික්ෂුවගේ ඕරම්භාගීය සංයෝජන පහ ප්‍රහීණ වී ඇත, මුලින් උදුරා දමා ඇත, තල් රුකක් මෙන් මුලසුන් කර ඇත, නැතිකර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. මහණෙනි, භික්ෂුවක් මෙසේ නිරග්ගළ වේ.\n\nමහණෙනි, භික්ෂුවක් කෙසේ නම් ආරිය පන්නද්ධජ, පන්නභාර, විසංයුත්ත වේද? මහණෙනි, මෙහිලා භික්ෂුවගේ අස්මිමානය (මම වෙමි යන මානය) ප්‍රහීණ වී ඇත, මුලින් උදුරා දමා ඇත, තල් රුකක් මෙන් මුලසුන් කර ඇත, නැතිකර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයට පත් කර ඇත. මහණෙනි, භික්ෂුවක් මෙසේ ආරිය පන්නද්ධජ, පන්නභාර, විසංයුත්ත වේ.",
      "paliTitle": "Dutiyacetovimuttiphalasuttaṃ",
      "englishTitle": "Second Sutta on the Fruit of Release of Mind",
      "sinhalaTitle": "දුතිය චේතෝවිමුත්තිඵල සූත්‍රය"
    },
    {
      "number": 73,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘‘dhammavihārī, dhammavihārī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, bhikkhu dhammavihārī hotī’’ti? ‘‘Idha, bhikkhu, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. So tāya dhammapariyattiyā divasaṃ atināmeti, riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ vuccati, bhikkhu – ‘bhikkhu pariyattibahulo, no dhammavihārī’’’. ‘‘Puna caparaṃ, bhikkhu, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti. So tāya dhammapaññattiyā divasaṃ atināmeti, riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ vuccati, bhikkhu – ‘bhikkhu paññattibahulo, no dhammavihārī’’’. ‘‘Puna caparaṃ, bhikkhu, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti. So tena sajjhāyena divasaṃ atināmeti, riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ vuccati, bhikkhu – ‘bhikkhu sajjhāyabahulo, no dhammavihārī’’’. ‘‘Puna caparaṃ, bhikkhu, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati. So tehi dhammavitakkehi divasaṃ atināmeti, riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ vuccati, bhikkhu – ‘bhikkhu vitakkabahulo, no dhammavihārī’’’. ‘‘Idha, bhikkhu, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. So tāya dhammapariyattiyā na divasaṃ atināmeti, nāpi riñcati paṭisallānaṃ, anuyuñjati ajjhattaṃ cetosamathaṃ. Evaṃ kho, bhikkhu, bhikkhu dhammavihārī hoti. ‘‘Iti kho, bhikkhu, desito mayā pariyattibahulo, desito paññattibahulo, desito sajjhāyabahulo, desito vitakkabahulo, desito dhammavihārī. Yaṃ kho, bhikkhu [yaṃ bhikkhu (syā. kaṃ. pī.)], satthārā karaṇīyaṃ sāvakānaṃ hitesinā anukampakena anukampaṃ upādāya, kataṃ vo taṃ mayā. Etāni, bhikkhu, rukkhamūlāni, etāni suññāgārāni. Jhāyatha, bhikkhu, mā pamādattha, mā pacchā vippaṭisārino ahuvattha. Ayaṃ vo amhākaṃ anusāsanī’’ti. Tatiyaṃ.",
      "english": "Then a certain bhikkhu approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, that bhikkhu said to the Blessed One, \"Bhante, it is said, 'One who dwells in the Dhamma, one who dwells in the Dhamma.' To what extent, Bhante, is a bhikkhu said to dwell in the Dhamma?\"\n\n\"Here, bhikkhu, a bhikkhu learns the Dhamma — discourses, mixed prose and verse, expositions, verses, inspired utterances, 'as it was said' narratives, birth stories, wonderful phenomena, and question-and-answer texts. But through that learning of the Dhamma, he spends the day, he neglects seclusion, and he does not engage in internal mental tranquility. This, bhikkhu, is called 'a bhikkhu abundant in study, not one who dwells in the Dhamma.'\"\n\n\"Furthermore, bhikkhu, a bhikkhu teaches the Dhamma to others extensively, just as he has heard and learned it. But through that teaching of the Dhamma, he spends the day, he neglects seclusion, and he does not engage in internal mental tranquility. This, bhikkhu, is called 'a bhikkhu abundant in exposition, not one who dwells in the Dhamma.'\"\n\n\"Furthermore, bhikkhu, a bhikkhu extensively recites the Dhamma, just as he has heard and learned it. But through that recitation, he spends the day, he neglects seclusion, and he does not engage in internal mental tranquility. This, bhikkhu, is called 'a bhikkhu abundant in recitation, not one who dwells in the Dhamma.'\"\n\n\"Furthermore, bhikkhu, a bhikkhu mentally contemplates, examines, and repeatedly reflects on the Dhamma, just as he has heard and learned it. But through those contemplations of the Dhamma, he spends the day, he neglects seclusion, and he does not engage in internal mental tranquility. This, bhikkhu, is called 'a bhikkhu abundant in contemplation, not one who dwells in the Dhamma.'\"\n\n\"Here, bhikkhu, a bhikkhu learns the Dhamma — discourses, mixed prose and verse, expositions, verses, inspired utterances, 'as it was said' narratives, birth stories, wonderful phenomena, and question-and-answer texts. But he does not spend the day merely with that learning of the Dhamma, nor does he neglect seclusion; he engages in internal mental tranquility. Thus, bhikkhu, is a bhikkhu one who dwells in the Dhamma.\"\n\n\"So, bhikkhu, I have expounded on one abundant in study, expounded on one abundant in exposition, expounded on one abundant in recitation, expounded on one abundant in contemplation, and expounded on one who dwells in the Dhamma. That which a Teacher should do for his disciples, out of concern for their welfare and compassion, that has been done by me for you. These, bhikkhu, are tree roots; these are empty dwellings. Meditate, bhikkhu, do not be heedless, do not be regretful later. This is our instruction to you.\"",
      "sinhala": "එවිට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය – ‘‘ස්වාමීනි, ‘ධර්ම විහාරී, ධර්ම විහාරී’ යැයි කියනු ලැබේ. ස්වාමීනි, භික්ෂුවක් කවර ප්‍රමාණයකින් ධර්ම විහාරී වේද?’’\n\n‘‘මෙහිලා භික්ෂුව, භික්ෂුවක් ධර්මය පරියත්ති කරයි – සූත්‍රය, ගෙය්‍යය, වෙය්‍යාකරණය, ගාථාව, උදානය, ඉතිවුත්තකය, ජාතකය, අබ්භූතධර්මය, වේදල්ලය යන නව අංගයෙන් යුත් ධර්මය ඉගෙන ගනියි. හෙතෙම ඒ ධර්ම පරියත්තියෙන් දවස ගෙවයි, ප්‍රතිසල්ලීන භාවය අත්හරියි, අධ්‍යාත්මික චේතෝසමථයට යොමු නොවෙයි. භික්ෂුව, මේ භික්ෂුව ‘පරියත්ති බහුල භික්ෂුවක් මිස ධර්ම විහාරී භික්ෂුවක් නොවේ’ යැයි කියනු ලැබේ.’’\n\n‘‘නැවතද, භික්ෂුව, භික්ෂුවක් තමා විසින් අසා ඉගෙනගත් ධර්මය විස්තර වශයෙන් අනුන්ට දේශනා කරයි. හෙතෙම ඒ ධර්ම ප්‍රඥප්තියෙන් දවස ගෙවයි, ප්‍රතිසල්ලීන භාවය අත්හරියි, අධ්‍යාත්මික චේතෝසමථයට යොමු නොවෙයි. භික්ෂුව, මේ භික්ෂුව ‘ප්‍රඥප්ති බහුල භික්ෂුවක් මිස ධර්ම විහාරී භික්ෂුවක් නොවේ’ යැයි කියනු ලැබේ.’’\n\n‘‘නැවතද, භික්ෂුව, භික්ෂුවක් තමා විසින් අසා ඉගෙනගත් ධර්මය විස්තර වශයෙන් සජ්බායනා කරයි. හෙතෙම ඒ සජ්බායනාවෙන් දවස ගෙවයි, ප්‍රතිසල්ලීන භාවය අත්හරියි, අධ්‍යාත්මික චේතෝසමථයට යොමු නොවෙයි. භික්ෂුව, මේ භික්ෂුව ‘සජ්බායනා බහුල භික්ෂුවක් මිස ධර්ම විහාරී භික්ෂුවක් නොවේ’ යැයි කියනු ලැබේ.’’\n\n‘‘නැවතද, භික්ෂුව, භික්ෂුවක් තමා විසින් අසා ඉගෙනගත් ධර්මය සිතින් නැවත නැවතත් විතර්ක කරයි, විචාරය කරයි, මනසින් මෙනෙහි කරයි. හෙතෙම ඒ ධර්ම විතර්කයන්ගෙන් දවස ගෙවයි, ප්‍රතිසල්ලීන භාවය අත්හරියි, අධ්‍යාත්මික චේතෝසමථයට යොමු නොවෙයි. භික්ෂුව, මේ භික්ෂුව ‘විතර්ක බහුල භික්ෂුවක් මිස ධර්ම විහාරී භික්ෂුවක් නොවේ’ යැයි කියනු ලැබේ.’’\n\n‘‘මෙහිලා භික්ෂුව, භික්ෂුවක් ධර්මය පරියත්ති කරයි – සූත්‍රය, ගෙය්‍යය, වෙය්‍යාකරණය, ගාථාව, උදානය, ඉතිවුත්තකය, ජාතකය, අබ්භූතධර්මය, වේදල්ලය යන නව අංගයෙන් යුත් ධර්මය ඉගෙන ගනියි. හෙතෙම ඒ ධර්ම පරියත්තියෙන් දවස නොගෙවයි, ප්‍රතිසල්ලීන භාවයද අත් නොහරියි, අධ්‍යාත්මික චේතෝසමථයට යොමු වෙයි. භික්ෂුව, මෙලෙස භික්ෂුවක් ධර්ම විහාරී වේ.\n\n‘‘භික්ෂුව, මෙලෙස ම විසින් පරියත්ති බහුල පුද්ගලයාද, ප්‍රඥප්ති බහුල පුද්ගලයාද, සජ්බායනා බහුල පුද්ගලයාද, විතර්ක බහුල පුද්ගලයාද, ධර්ම විහාරී පුද්ගලයාද දේශනා කරන ලදී. භික්ෂුව, ශ්‍රාවකයන්ගේ හිත සුව කැමති, අනුකම්පා ඇති ශාස්තෘවරයෙකු විසින් අනුකම්පාව පෙරදැරිව යමක් කළ යුතු වේද, ඒ සියල්ල ම විසින් නුඹලාට කරන ලදී. භික්ෂුව, මේවා රුක්මුල්ය, මේවා හිස් ගෙවල්ය. භික්ෂුව, ධ්‍යාන වඩන්න, ප්‍රමාද නොවන්න, පසුව පසුතැවිලි නොවන්න. මෙය නුඹලාට අපගේ අනුශාසනාවයි.’’",
      "paliTitle": "Paṭhamadhammavihārīsuttaṃ",
      "englishTitle": "The First Discourse on One Who Dwells in the Dhamma",
      "sinhalaTitle": "පළමු ධම්මවිහාරී සූත්‍රය"
    },
    {
      "number": 74,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘‘dhammavihārī dhammavihārī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, bhikkhu dhammavihārī hotī’’ti? ‘‘Idha, bhikkhu, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ; uttari [uttariṃ (sī. syā. kaṃ. pī.)] cassa paññāya atthaṃ nappajānāti. Ayaṃ vuccati, bhikkhu – ‘bhikkhu pariyattibahulo, no dhammavihārī’’’. ‘‘Puna caparaṃ, bhikkhu, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti, uttari cassa paññāya atthaṃ nappajānāti. Ayaṃ vuccati, bhikkhu – ‘bhikkhu paññattibahulo, no dhammavihārī’’’. ‘‘Puna caparaṃ, bhikkhu, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti, uttari cassa paññāya atthaṃ nappajānāti. Ayaṃ vuccati, bhikkhu – ‘bhikkhu sajjhāyabahulo, no dhammavihārī’’’. ‘‘Puna caparaṃ, bhikkhu, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati, uttari cassa paññāya atthaṃ nappajānāti. Ayaṃ vuccati, bhikkhu – ‘bhikkhu vitakkabahulo, no dhammavihārī’’’. ‘‘Idha, bhikkhu, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ; uttari cassa paññāya atthaṃ pajānāti. Evaṃ kho, bhikkhu, bhikkhu dhammavihārī hoti. ‘‘Iti kho, bhikkhu, desito mayā pariyattibahulo, desito paññattibahulo, desito sajjhāyabahulo, desito vitakkabahulo, desito dhammavihārī. Yaṃ kho, bhikkhu, satthārā karaṇīyaṃ sāvakānaṃ hitesinā anukampakena anukampaṃ upādāya, kataṃ vo taṃ mayā. Etāni, bhikkhu, rukkhamūlāni, etāni suññāgārāni. Jhāyatha bhikkhu, mā pamādattha, mā pacchā vippaṭisārino ahuvattha. Ayaṃ vo amhākaṃ anusāsanī’’ti. Catutthaṃ.",
      "english": "Then a certain monk approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, that monk said to the Blessed One, “‘One who dwells in the Dhamma, one who dwells in the Dhamma’ – thus it is said, Venerable sir. To what extent, Venerable sir, is a monk one who dwells in the Dhamma?”\n\n“Here, monk, a monk learns the Dhamma – discourse, mixed prose and verse, exposition, verse, inspired utterance, as it was said, birth story, wondrous event, and question and answer; yet he does not understand its meaning with wisdom beyond that. This, monk, is called ‘a monk absorbed in mere learning, not one who dwells in the Dhamma’.”\n\n“Furthermore, monk, a monk teaches the Dhamma to others extensively as he has heard and learned it, yet he does not understand its meaning with wisdom beyond that. This, monk, is called ‘a monk absorbed in mere teaching, not one who dwells in the Dhamma’.”\n\n“Furthermore, monk, a monk extensively recites the Dhamma as he has heard and learned it, yet he does not understand its meaning with wisdom beyond that. This, monk, is called ‘a monk absorbed in mere recitation, not one who dwells in the Dhamma’.”\n\n“Furthermore, monk, a monk extensively contemplates, examines, and repeatedly reflects on the Dhamma in his mind as he has heard and learned it, yet he does not understand its meaning with wisdom beyond that. This, monk, is called ‘a monk absorbed in mere conceptual thought, not one who dwells in the Dhamma’.”\n\n“Here, monk, a monk learns the Dhamma – discourse, mixed prose and verse, exposition, verse, inspired utterance, as it was said, birth story, wondrous event, and question and answer; and he understands its meaning with wisdom beyond that. Thus, monk, a monk is one who dwells in the Dhamma.”\n\n“Thus, monk, I have taught about one absorbed in mere learning, about one absorbed in mere teaching, about one absorbed in mere recitation, about one absorbed in mere conceptual thought, and about one who dwells in the Dhamma. That which a Teacher, out of compassion and wishing for the welfare of his disciples, ought to do – that has been done by me for you. These, monks, are tree roots; these are empty dwellings. Meditate, monks! Do not be heedless! Do not later regret! This is our instruction to you.”",
      "sinhala": "එකල්හි එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩිවිය. එක් පසෙකින් වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – \"ස්වාමීනි, 'ධර්මවිහාරී, ධර්මවිහාරී' යැයි කියනු ලැබේ. ස්වාමීනි, කවර අයුරකින් භික්ෂුවක් ධර්මවිහාරී වේද?\"\n\n\"මහණ, මෙහිලා භික්ෂුවක් ධර්මය ඉගෙන ගනී – සූත්‍රය, ගෙය්‍යය, වෙය්‍යාකරණය, ගාථාව, උදානය, ඉතිවුත්තකය, ජාතකය, අබ්භූතධර්මය, වේදල්ලය යන නව අංගයන්ගෙන් යුත් ශාසනය ඉගෙන ගනී. එහෙත් ප්‍රඥාවෙන් එහි ගැඹුරු අර්ථය තවදුරටත් අවබෝධ කර නොගනී. මහණ, මෙවැනි භික්ෂුවක් 'පර්යාප්ති බහුල භික්ෂුවක් මිස ධර්මවිහාරී භික්ෂුවක් නොවේ' යැයි කියනු ලැබේ.\"\n\n\"නැවතත්, මහණ, භික්ෂුවක් තමන් ඇසූ පරිදි, ඉගෙනගත් පරිදි ධර්මය අන් අයට විස්තර වශයෙන් දේශනා කරයි, එහෙත් ප්‍රඥාවෙන් එහි ගැඹුරු අර්ථය තවදුරටත් අවබෝධ කර නොගනී. මහණ, මෙවැනි භික්ෂුවක් 'ප්‍රඥප්ති බහුල භික්ෂුවක් මිස ධර්මවිහාරී භික්ෂුවක් නොවේ' යැයි කියනු ලැබේ.\"\n\n\"නැවතත්, මහණ, භික්ෂුවක් තමන් ඇසූ පරිදි, ඉගෙනගත් පරිදි ධර්මය විස්තර වශයෙන් සාජ්ඣායනා කරයි, එහෙත් ප්‍රඥාවෙන් එහි ගැඹුරු අර්ථය තවදුරටත් අවබෝධ කර නොගනී. මහණ, මෙවැනි භික්ෂුවක් 'සාජ්ඣාය බහුල භික්ෂුවක් මිස ධර්මවිහාරී භික්ෂුවක් නොවේ' යැයි කියනු ලැබේ.\"\n\n\"නැවතත්, මහණ, භික්ෂුවක් තමන් ඇසූ පරිදි, ඉගෙනගත් පරිදි ධර්මය සිතින් අනුවිතර්ක කරයි, අනුවිචාර කරයි, මනසින් මෙනෙහි කරයි, එහෙත් ප්‍රඥාවෙන් එහි ගැඹුරු අර්ථය තවදුරටත් අවබෝධ කර නොගනී. මහණ, මෙවැනි භික්ෂුවක් 'විතක්ක බහුල භික්ෂුවක් මිස ධර්මවිහාරී භික්ෂුවක් නොවේ' යැයි කියනු ලැබේ.\"\n\n\"මහණ, මෙහිලා භික්ෂුවක් ධර්මය ඉගෙන ගනී – සූත්‍රය, ගෙය්‍යය, වෙය්‍යාකරණය, ගාථාව, උදානය, ඉතිවුත්තකය, ජාතකය, අබ්භූතධර්මය, වේදල්ලය යන නව අංගයන්ගෙන් යුත් ශාසනය ඉගෙන ගනී. තවද ප්‍රඥාවෙන් එහි ගැඹුරු අර්ථය අවබෝධ කරගනී. මහණ, මෙලෙසින් භික්ෂුව ධර්මවිහාරී වේ.\"\n\n\"මහණ, මේ අයුරින් මම පර්යාප්ති බහුල භික්ෂුවද, ප්‍රඥප්ති බහුල භික්ෂුවද, සාජ්ඣාය බහුල භික්ෂුවද, විතක්ක බහුල භික්ෂුවද, ධර්මවිහාරී භික්ෂුවද දේශනා කළෙමි. මහණ, යම් කරුණක් ශ්‍රාවකයන්ගේ හිත සුව කැමති, අනුකම්පාවෙන් යුත් ශාස්තෘවරයෙකු විසින් කළ යුතු නම්, ඒ සියල්ල මා විසින් නුඹලාට කර ඇත. මහණ, මේවා රුක්මුල් ය, මේවා ශුන්‍යාගාර ය. මහණ, භාවනා කරන්න, ප්‍රමාද නොවන්න, පසුතැවිලි වන්නන් නොමවන්න. මෙයයි අපගේ අනුශාසනාව.\"",
      "paliTitle": "Dutiyadhammavihārīsuttaṃ",
      "englishTitle": "Second Sutta on One Who Dwells in the Dhamma",
      "sinhalaTitle": "දුතිය ධම්මවිහාරී සූත්‍රය"
    },
    {
      "number": 75,
      "pali": "‘‘Pañcime, bhikkhave, yodhājīvā santo saṃvijjamānā lokasmiṃ. Katame pañca? Idha, bhikkhave, ekacco yodhājīvo rajaggaññeva disvā saṃsīdati visīdati na santhambhati na sakkoti saṅgāmaṃ otarituṃ. Evarūpopi [evarūpo (sī.) pu. pa. 193], bhikkhave, idhekacco [ekacco (sī.)] yodhājīvo hoti. Ayaṃ, bhikkhave, paṭhamo yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo sahati rajaggaṃ; api ca kho dhajaggaññeva disvā saṃsīdati visīdati, na santhambhati, na sakkoti saṅgāmaṃ otarituṃ. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, dutiyo yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo sahati rajaggaṃ sahati dhajaggaṃ; api ca kho ussāraṇaññeva [ussādanaṃyeva (sī. pī.)] sutvā saṃsīdati visīdati, na santhambhati, na sakkoti saṅgāmaṃ otarituṃ. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, tatiyo yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo sahati rajaggaṃ, sahati dhajaggaṃ, sahati ussāraṇaṃ; api ca kho sampahāre haññati [āhaññati (sī.)] byāpajjati. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, catuttho yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo sahati rajaggaṃ, sahati dhajaggaṃ, sahati ussāraṇaṃ, sahati sampahāraṃ. So taṃ saṅgāmaṃ abhivijinitvā vijitasaṅgāmo tameva saṅgāmasīsaṃ ajjhāvasati. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, pañcamo yodhājīvo santo saṃvijjamāno lokasmiṃ. Ime kho, bhikkhave, pañca yodhājīvā santo saṃvijjamānā lokasmiṃ. ‘‘Evamevaṃ kho, bhikkhave, pañcime yodhājīvūpamā puggalā santo saṃvijjamānā bhikkhūsu. Katame pañca? Idha, bhikkhave, bhikkhu rajaggaññeva disvā saṃsīdati visīdati, na santhambhati, na sakkoti brahmacariyaṃ sandhāretuṃ [santānetuṃ (sī. syā. kaṃ. pī.)]. Sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. Kimassa rajaggasmiṃ? Idha, bhikkhave, bhikkhu suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā kumārī vā abhirūpā dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā’ti. So taṃ sutvā saṃsīdati visīdati, na santhambhati, na sakkoti brahmacariyaṃ sandhāretuṃ. Sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. Idamassa rajaggasmiṃ. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo rajaggaññeva disvā saṃsīdati visīdati, na santhambhati, na sakkoti saṅgāmaṃ otarituṃ; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, paṭhamo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sahati rajaggaṃ; api ca kho dhajaggaññeva disvā saṃsīdati visīdati, na santhambhati, na sakkoti brahmacariyaṃ sandhāretuṃ. Sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. Kimassa dhajaggasmiṃ? Idha, bhikkhave, bhikkhu na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā kumārī vā abhirūpā dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā’ti; api ca kho sāmaṃ passati itthiṃ vā kumāriṃ vā abhirūpaṃ dassanīyaṃ pāsādikaṃ paramāya vaṇṇapokkharatāya samannāgataṃ. So taṃ disvā saṃsīdati visīdati, na santhambhati, na sakkoti brahmacariyaṃ sandhāretuṃ. Sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. Idamassa dhajaggasmiṃ. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo sahati rajaggaṃ; api ca kho dhajaggaññeva disvā saṃsīdati visīdati, na santhambhati, na sakkoti saṅgāmaṃ otarituṃ; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, dutiyo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sahati rajaggaṃ, sahati dhajaggaṃ; api ca kho ussāraṇaññeva sutvā saṃsīdati visīdati, na santhambhati, na sakkoti brahmacariyaṃ sandhāretuṃ. Sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. Kimassa ussāraṇāya? Idha, bhikkhave, bhikkhuṃ araññagataṃ vā rukkhamūlagataṃ vā suññāgāragataṃ vā mātugāmo upasaṅkamitvā ūhasati [uhasati (ka.), ohasati (syā. kaṃ.) pu. pa. 196] ullapati ujjagghati uppaṇḍeti. So mātugāmena ūhasiyamāno ullapiyamāno ujjagghiyamāno uppaṇḍiyamāno saṃsīdati visīdati, na santhambhati, na sakkoti brahmacariyaṃ sandhāretuṃ. Sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. Idamassa ussāraṇāya. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo sahati rajaggaṃ, sahati dhajaggaṃ; api ca kho ussāraṇaññeva sutvā saṃsīdati visīdati, na santhambhati, na sakkoti saṅgāmaṃ otarituṃ; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, tatiyo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sahati rajaggaṃ, sahati dhajaggaṃ, sahati ussāraṇaṃ; api ca kho sampahāre haññati byāpajjati. Kimassa sampahārasmiṃ? Idha, bhikkhave, bhikkhuṃ araññagataṃ vā rukkhamūlagataṃ vā suññāgāragataṃ vā mātugāmo upasaṅkamitvā abhinisīdati abhinipajjati ajjhottharati. So mātugāmena abhinisīdiyamāno abhinipajjiyamāno ajjhotthariyamāno sikkhaṃ apaccakkhāya dubbalyaṃ anāvikatvā methunaṃ dhammaṃ paṭisevati. Idamassa sampahārasmiṃ. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo sahati rajaggaṃ, sahati dhajaggaṃ, sahati ussāraṇaṃ, api ca kho sampahāre haññati byāpajjati; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, catuttho yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sahati rajaggaṃ, sahati dhajaggaṃ, sahati ussāraṇaṃ, sahati sampahāraṃ, so taṃ saṅgāmaṃ abhivijinitvā vijitasaṅgāmo tameva saṅgāmasīsaṃ ajjhāvasati. Kimassa saṅgāmavijayasmiṃ? Idha, bhikkhave, bhikkhu araññagataṃ vā rukkhamūlagataṃ vā suññāgāragataṃ vā mātugāmo upasaṅkamitvā abhinisīdati abhinipajjati ajjhottharati. So mātugāmena abhinisīdiyamāno abhinipajjiyamāno ajjhotthariyamāno viniveṭhetvā vinimocetvā yena kāmaṃ pakkamati. So vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. ‘‘So araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti; byāpādapadosaṃ pahāya abyāpannacitto viharati, sabbapāṇabhūtahitānukampī byāpādapadosā cittaṃ parisodheti; thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti; uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti; vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti. So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi…pe… pītiyā ca virāgā upekkhako ca viharati sato sampajāno, sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti, ‘ime āsavā’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati, vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Idamassa saṅgāmavijayasmiṃ. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo sahati rajaggaṃ, sahati dhajaggaṃ, sahati ussāraṇaṃ, sahati sampahāraṃ, so taṃ saṅgāmaṃ abhivijinitvā vijitasaṅgāmo tameva saṅgāmasīsaṃ ajjhāvasati; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, pañcamo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. Ime kho, bhikkhave, pañca yodhājīvūpamā puggalā santo saṃvijjamānā bhikkhūsū’’ti. Pañcamaṃ.",
      "english": "Mendicants, there are these five types of warriors existing, found in the world. Which five? Here, mendicants, a certain warrior, upon merely seeing the dust stirred up, becomes disheartened, overwhelmed, cannot steady himself, and is unable to enter the battle. Such a warrior, mendicants, is found here. This, mendicants, is the first type of warrior existing, found in the world.\n\nFurthermore, mendicants, a certain warrior endures the dust stirred up; but upon merely seeing the battle standards, becomes disheartened, overwhelmed, cannot steady himself, and is unable to enter the battle. Such a warrior, mendicants, is found here. This, mendicants, is the second type of warrior existing, found in the world.\n\nFurthermore, mendicants, a certain warrior endures the dust stirred up and endures the battle standards; but upon merely hearing the roar of battle, becomes disheartened, overwhelmed, cannot steady himself, and is unable to enter the battle. Such a warrior, mendicants, is found here. This, mendicants, is the third type of warrior existing, found in the world.\n\nFurthermore, mendicants, a certain warrior endures the dust stirred up, endures the battle standards, and endures the roar of battle; but is struck down and perishes in the clash of weapons. Such a warrior, mendicants, is found here. This, mendicants, is the fourth type of warrior existing, found in the world.\n\nFurthermore, mendicants, a certain warrior endures the dust stirred up, endures the battle standards, endures the roar of battle, and endures the clash of weapons. Having utterly conquered that battle, having been victorious in battle, he settles down in that very place of battle. Such a warrior, mendicants, is found here. This, mendicants, is the fifth type of warrior existing, found in the world. These, mendicants, are the five types of warriors existing, found in the world.\n\nIn the same way, mendicants, there are these five types of individuals, comparable to warriors, existing, found among the bhikkhus. Which five? Here, mendicants, a bhikkhu, upon merely seeing the 'dust stirred up,' becomes disheartened, overwhelmed, cannot steady himself, and is unable to sustain the holy life. Having revealed his weakness in training, he renounces the training and returns to a lower state. What is the 'dust stirred up' for him? Here, mendicants, a bhikkhu hears, 'In such-and-such a village or town, there is a woman or a girl who is beautiful, charming, delightful, endowed with supreme complexion and form.' Hearing that, he becomes disheartened, overwhelmed, cannot steady himself, and is unable to sustain the holy life. Having revealed his weakness in training, he renounces the training and returns to a lower state. This is his 'dust stirred up.'\n\nJust as that warrior, mendicants, upon merely seeing the dust stirred up, became disheartened, overwhelmed, could not steady himself, and was unable to enter the battle; in the same way, mendicants, I declare this individual to be comparable. Such an individual, mendicants, is found here. This, mendicants, is the first type of individual comparable to a warrior, existing, found among the bhikkhus.\n\nFurthermore, mendicants, a bhikkhu endures the 'dust stirred up'; but upon merely seeing the 'battle standards,' becomes disheartened, overwhelmed, cannot steady himself, and is unable to sustain the holy life. Having revealed his weakness in training, he renounces the training and returns to a lower state. What are the 'battle standards' for him? Here, mendicants, a bhikkhu does not merely hear, 'In such-and-such a village or town, there is a woman or a girl who is beautiful, charming, delightful, endowed with supreme complexion and form'; but he himself sees a woman or a girl who is beautiful, charming, delightful, endowed with supreme complexion and form. Seeing that, he becomes disheartened, overwhelmed, cannot steady himself, and is unable to sustain the holy life. Having revealed his weakness in training, he renounces the training and returns to a lower state. This is his 'battle standards.'\n\nJust as that warrior, mendicants, endured the dust stirred up, but upon merely seeing the battle standards, became disheartened, overwhelmed, could not steady himself, and was unable to enter the battle; in the same way, mendicants, I declare this individual to be comparable. Such an individual, mendicants, is found here. This, mendicants, is the second type of individual comparable to a warrior, existing, found among the bhikkhus.\n\nFurthermore, mendicants, a bhikkhu endures the 'dust stirred up' and endures the 'battle standards'; but upon merely hearing the 'roar of battle,' becomes disheartened, overwhelmed, cannot steady himself, and is unable to sustain the holy life. Having revealed his weakness in training, he renounces the training and returns to a lower state. What is the 'roar of battle' for him? Here, mendicants, when a bhikkhu has gone to a wilderness, or to the root of a tree, or to an empty dwelling, a woman approaches him and entices with words. Hearing that, he becomes disheartened, overwhelmed, cannot steady himself, and is unable to sustain the holy life. Having revealed his weakness in training, he renounces the training and returns to a lower state. This is his 'roar of battle.'\n\nHe speaks provocatively, laughs scornfully, and mocks. Being enticed, provoked, laughed at, and mocked by the woman, he becomes demoralized and disheartened; he does not steady himself, he is unable to sustain the holy life. Having revealed his weakness in the training, he abandons the training and returns to a lower state. This is what happens to him with respect to provocation. Just as, monks, a warrior endures the dust of the battlefield, endures the standard of battle; yet, merely hearing the battle cry, he becomes demoralized and disheartened, he does not steady himself, he is unable to enter the battle; I say that this person is comparable to him, monks. Such a person, monks, is found here. This, monks, is the third soldier-like person existing and found among the monastics.\n\nFurthermore, monks, a monastic endures the dust of the battlefield, endures the standard of battle, endures the provocation; yet, in the clash, he is struck down and perishes. What is his clash? Here, monks, a woman approaches a monastic who has gone to the forest, or to the root of a tree, or to an empty dwelling, and sits down close to him, lies down close to him, and overwhelms him. Being sat down close to, lain down close to, and overwhelmed by the woman, he, without abandoning the training and without revealing his weakness, engages in sexual intercourse. This is his clash. Just as, monks, a warrior endures the dust of the battlefield, endures the standard of battle, endures the provocation; yet, in the clash, he is struck down and perishes; I say that this person is comparable to him, monks. Such a person, monks, is found here. This, monks, is the fourth soldier-like person existing and found among the monastics.\n\nFurthermore, monks, a monastic endures the dust of the battlefield, endures the standard of battle, endures the provocation, endures the clash; and having completely conquered that battle, having been victorious in battle, he settles down at that very battlefield. What is his victory in battle? Here, monks, a woman approaches a monastic who has gone to the forest, or to the root of a tree, or to an empty dwelling, and sits down close to him, lies down close to him, and overwhelms him. Being sat down close to, lain down close to, and overwhelmed by the woman, he, having disengaged and disentangled himself, departs wherever he wishes. He then resorts to a secluded dwelling: a forest, the root of a tree, a mountain, a mountain grotto, a cave, a charnel ground, a jungle thicket, an open field, a heap of straw.\n\nHaving gone to the forest, or to the root of a tree, or to an empty dwelling, he sits down, having folded his legs crosswise, having set his body upright, and having established mindfulness to the fore. Having abandoned covetousness for the world, he dwells with a mind free from covetousness; he purifies his mind from covetousness. Having abandoned ill-will and malice, he dwells with a mind free from ill-will, compassionate towards all living beings; he purifies his mind from ill-will and malice. Having abandoned sloth and torpor, he dwells free from sloth and torpor, perceiving light, mindful and clearly comprehending; he purifies his mind from sloth and torpor. Having abandoned restlessness and remorse, he dwells unagitated, with his mind inwardly tranquilized; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having overcome doubt, without uncertainty concerning wholesome states; he purifies his mind from doubt. Having abandoned these five hindrances, which are corruptions of the mind and weaken wisdom, quite secluded from sensual pleasures and unwholesome states, he enters and dwells in the first jhāna, accompanied by initial and sustained application, born of seclusion, filled with rapture and happiness. With the stilling of initial and sustained application, with internal assurance and unification of mind, he enters and dwells in the second jhāna, free of initial and sustained application, born of concentration, filled with rapture and happiness. Then, with the fading away of rapture, he dwells equanimous, mindful, and clearly comprehending, and experiences happiness with the body, of which the Noble Ones declare, 'He dwells in happiness, equanimous and mindful' – he enters and dwells in the third jhāna. With the abandoning of pleasure and the abandoning of pain, and with the previous disappearance of joy and sorrow, he enters and dwells in the fourth jhāna, which is neither pain nor pleasure, and is purification of mindfulness by equanimity.\n\nWith his mind thus concentrated, purified, cleansed, unblemished, rid of defilements, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines his mind to the knowledge of the destruction of the taints. He understands, as it actually is, 'This is suffering', 'This is the origin of suffering', 'This is the cessation of suffering', 'This is the path leading to the cessation of suffering'. He understands, as it actually is, 'These are the taints', 'This is the origin of the taints', 'This is the cessation of the taints', 'This is the path leading to the cessation of the taints'. For him, knowing thus and seeing thus, his mind is liberated from the taint of sensual desire, his mind is liberated from the taint of becoming, and his mind is liberated from the taint of ignorance. With liberation comes the knowledge, 'It is liberated.' He understands: 'Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.' This is his victory in battle.\n\nJust as, bhikkhus, a warrior endures the vanguard of the dust, endures the vanguard of the banners, endures the loud shouts, and endures the impact of combat; and having completely conquered that battle, having emerged victorious from the conflict, he then settles down at the head of that very battleground. So too, bhikkhus, I declare this individual to be. Such a person, bhikkhus, is indeed found here among the bhikkhus. This, bhikkhus, is the fifth individual likened to a warrior, existing and present among the bhikkhus. These, bhikkhus, are the five individuals likened to a warrior, existing and present among the bhikkhus.",
      "sinhala": "මහණෙනි, මෙලොවෙහි වර්තමානව, සිටින සොල්දාදුවන් පස් දෙනෙක් වෙති. ඒ කවර පස් දෙනෙක් ද? මහණෙනි, මෙහි ඇතැම් සොල්දාදුවෙක් හුදු දූලි සමූහයක් දැක කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, සටනට පිවිසීමට නොහැකි වේ. මහණෙනි, මේ ආකාරයේ සොල්දාදුවෙක් ද මෙහි ඇත. මහණෙනි, මෙලොවෙහි වර්තමානව, සිටින පළමුවන සොල්දාදුවා මොහු ය.\n\nතවද, මහණෙනි, මෙහි ඇතැම් සොල්දාදුවෙක් දූලි සමූහය දරා ගනී; එහෙත් හුදු ධජ සමූහයක් දැක කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, සටනට පිවිසීමට නොහැකි වේ. මහණෙනි, මේ ආකාරයේ සොල්දාදුවෙක් ද මෙහි ඇත. මහණෙනි, මෙලොවෙහි වර්තමානව, සිටින දෙවන සොල්දාදුවා මොහු ය.\n\nතවද, මහණෙනි, මෙහි ඇතැම් සොල්දාදුවෙක් දූලි සමූහය දරා ගනී, ධජ සමූහය ද දරා ගනී; එහෙත් හුදු සටන් පෙරනිමිති හඬක් අසා කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, සටනට පිවිසීමට නොහැකි වේ. මහණෙනි, මේ ආකාරයේ සොල්දාදුවෙක් ද මෙහි ඇත. මහණෙනි, මෙලොවෙහි වර්තමානව, සිටින තෙවන සොල්දාදුවා මොහු ය.\n\nතවද, මහණෙනි, මෙහි ඇතැම් සොල්දාදුවෙක් දූලි සමූහය දරා ගනී, ධජ සමූහය දරා ගනී, සටන් පෙරනිමිති හඬ ද දරා ගනී; එහෙත් සටනට පිවිස ගටන මොහොතේදී පහර කයි, විනාශ වේ. මහණෙනි, මේ ආකාරයේ සොල්දාදුවෙක් ද මෙහි ඇත. මහණෙනි, මෙලොවෙහි වර්තමානව, සිටින සිව්වන සොල්දාදුවා මොහු ය.\n\nතවද, මහණෙනි, මෙහි ඇතැම් සොල්දාදුවෙක් දූලි සමූහය දරා ගනී, ධජ සමූහය දරා ගනී, සටන් පෙරනිමිති හඬ දරා ගනී, සටනට පිවිස ගටන මොහොත ද දරා ගනී. හෙතෙම ඒ සටන හොඳින් ජයගෙන, සටන ජයගත්තෙක් වී, ඒ සටන් බිමේ ප්‍රධාන ස්ථානයෙහි වාසය කරයි. මහණෙනි, මේ ආකාරයේ සොල්දාදුවෙක් ද මෙහි ඇත. මහණෙනි, මෙලොවෙහි වර්තමානව, සිටින පස්වන සොල්දාදුවා මොහු ය. මහණෙනි, මෙලොවෙහි වර්තමානව, සිටින සොල්දාදුවන් පස් දෙනා මොවුන් වෙති.\n\nමහණෙනි, එපරිද්දෙන්ම, භික්ෂූන් අතර සොල්දාදුවන් හා සමාන පුද්ගලයන් පස් දෙනෙක් වර්තමානව, සිටිති. ඒ කවර පස් දෙනෙක් ද? මහණෙනි, මෙහි ඇතැම් භික්ෂුවක් (පළමු සතුරු පෙරනිමිත්ත වන) දූලි සමූහය හා සමාන වූ අරමුණක් දැක කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, ශ්‍රේෂ්ඨ බඹසර රුක ගැනීමට නොහැකි වේ. ශික්ෂාවේ දුර්වලකම ප්‍රකට කර, ශික්ෂාව අත්හැර, හීන තත්වයට පත් වේ. ඔහුට දූලි සමූහය යනු කුමක් ද? මහණෙනි, මෙහි ඇතැම් භික්ෂුවක් අසයි – 'අසවල් ගමෙහි හෝ නියම්ගමෙහි හෝ රූපශ්‍රීයෙන් යුත්, දර්ශනීය වූ, ප්‍රිය මනාප වූ, අතිශයින්ම කාන්තිමත් වූ ස්ත්‍රියක් හෝ කුමරියක් ඇත' කියා. හෙතෙම එය අසා කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, ශ්‍රේෂ්ඨ බඹසර රුක ගැනීමට නොහැකි වේ. ශික්ෂාවේ දුර්වලකම ප්‍රකට කර, ශික්ෂාව අත්හැර, හීන තත්වයට පත් වේ. මෙය ඔහුට දූලි සමූහය යි.\n\nමහණෙනි, යම් සේ ඒ සොල්දාදුවා හුදු දූලි සමූහයක් දැක කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, සටනට පිවිසීමට නොහැකි වේ ද; මහණෙනි, මම මේ පුද්ගලයා ඒ හා සමාන යැයි කියමි. මහණෙනි, මේ ආකාරයේ පුද්ගලයෙක් ද මෙහි ඇත. මහණෙනි, භික්ෂූන් අතර වර්තමානව, සිටින සොල්දාදුවා හා සමාන පළමුවන පුද්ගලයා මොහු ය.\n\nතවද, මහණෙනි, ඇතැම් භික්ෂුවක් (පළමු සතුරු පෙරනිමිත්ත වන) දූලි සමූහය හා සමාන වූ අරමුණ දරා ගනී; එහෙත් (දෙවන සතුරු පෙරනිමිත්ත වන) ධජ සමූහය හා සමාන වූ අරමුණක් දැක කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, ශ්‍රේෂ්ඨ බඹසර රුක ගැනීමට නොහැකි වේ. ශික්ෂාවේ දුර්වලකම ප්‍රකට කර, ශික්ෂාව අත්හැර, හීන තත්වයට පත් වේ. ඔහුට ධජ සමූහය යනු කුමක් ද? මහණෙනි, මෙහි ඇතැම් භික්ෂුවක් 'අසවල් ගමෙහි හෝ නියම්ගමෙහි හෝ රූපශ්‍රීයෙන් යුත්, දර්ශනීය වූ, ප්‍රිය මනාප වූ, අතිශයින්ම කාන්තිමත් වූ ස්ත්‍රියක් හෝ කුමරියක් ඇත' කියා නොඅසයි; එහෙත් රූපශ්‍රීයෙන් යුත්, දර්ශනීය වූ, ප්‍රිය මනාප වූ, අතිශයින්ම කාන්තිමත් වූ ස්ත්‍රියක් හෝ කුමරියක් තමා විසින්ම දකියි. හෙතෙම එය දැක කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, ශ්‍රේෂ්ඨ බඹසර රුක ගැනීමට නොහැකි වේ. ශික්ෂාවේ දුර්වලකම ප්‍රකට කර, ශික්ෂාව අත්හැර, හීන තත්වයට පත් වේ. මෙය ඔහුට ධජ සමූහය යි.\n\nමහණෙනි, යම් සේ ඒ සොල්දාදුවා දූලි සමූහය දරා ගනී; එහෙත් හුදු ධජ සමූහයක් දැක කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, සටනට පිවිසීමට නොහැකි වේ ද; මහණෙනි, මම මේ පුද්ගලයා ඒ හා සමාන යැයි කියමි. මහණෙනි, මේ ආකාරයේ පුද්ගලයෙක් ද මෙහි ඇත. මහණෙනි, භික්ෂූන් අතර වර්තමානව, සිටින සොල්දාදුවා හා සමාන දෙවන පුද්ගලයා මොහු ය.\n\nතවද, මහණෙනි, ඇතැම් භික්ෂුවක් (පළමු සතුරු පෙරනිමිත්ත වන) දූලි සමූහය හා සමාන වූ අරමුණ දරා ගනී, (දෙවන සතුරු පෙරනිමිත්ත වන) ධජ සමූහය හා සමාන වූ අරමුණ ද දරා ගනී; එහෙත් (තෙවන සතුරු පෙරනිමිත්ත වන) සටන් පෙරනිමිති හඬ හා සමාන වූ අරමුණක් අසා කලබලයට පත් වේ, අධෛර්යයට පත් වේ, සන්සුන් නොවේ, ශ්‍රේෂ්ඨ බඹසර රුක ගැනීමට නොහැකි වේ. ශික්ෂාවේ දුර්වලකම ප්‍රකට කර, ශික්ෂාව අත්හැර, හීන තත්වයට පත් වේ. ඔහුට සටන් පෙරනිමිති හඬ යනු කුමක් ද? මහණෙනි, මෙහි ඇතැම් භික්ෂුවක් අරණ්‍යයකට හෝ වෘක්ෂ මූලයකට හෝ ශුන්‍යාගාරයකට ගිය විට, ස්ත්‍රියක් ඔහු වෙත පැමිණ, සිනහවෙන් හෝ වචනවලින් ඔහුව කුපිත කරයි.\n\nකාන්තාවක් ඔහුට උසුළු විසුළු කරයි, සිනාසෙයි, කතාබහ කරයි. මෙසේ ඒ කාන්තාව විසින් උසුළු විසුළු කරනු ලබන විට, කතාබහ කරනු ලබන විට, සිනාසෙනු ලබන විට, උපහාස කරනු ලබන විට, ඔහු පසුබැස යයි, අධෛර්යයට පත් වෙයි, ස්ථාවරව සිටිය නොහැක, බ්‍රහ්මචාරී ජීවිතය පවත්වාගෙන යාමට නොහැක. තමාගේ ශික්‌ෂාවෙහි දුර්වලකම ප්‍රකට කොට, ශික්‌ෂාව අත්හැර, පහත් තත්ත්වයකට (ගිහි ජීවිතයට) පත් වෙයි. මෙය ඔහුගේ ‘උස්සාරණය’ නම් වූ පරාජයයි. මහණෙනි, යම් සේ රජස් කන්දට ද, ධජ කන්දට ද ඔරොත්තු දෙන රණශූරයෙක්, ‘උස්සාරණය’ (වාචික ප්‍රකෝපය) අසා, පසුබැස, අධෛර්යයට පත්ව, ස්ථාවරව සිටිය නොහැකිව, සටනට පිවිසීමට නොහැකි වේද, මහණෙනි, මම මේ පුද්ගලයා ඒ රණශූරයාට උපමා කරමි. මහණෙනි, මෙබඳු පුද්ගලයෙක් ද මෙහි (මේ ශාසනයෙහි) සිටී. මහණෙනි, භික්ෂූන් අතර සිටින මේ තෙවැනි රණශූරයාට උපමා කළ හැකි පුද්ගලයා යි.\n\nමහණෙනි, නැවතත් යම් භික්ෂුවක් රජස් කන්දට ද, ධජ කන්දට ද, ‘උස්සාරණයට’ ද ඔරොත්තු දෙයි. එහෙත්, ඔහු ‘සම්පහාරය’ (සෘජු ප්‍රහාරය) හමුවේ පරාජය වී විනාශයට පත්වෙයි. ඔහුගේ ‘සම්පහාරය’ නම් කුමක්ද? මහණෙනි, මෙහිදී යම් භික්ෂුවක් අරණ්‍යයකට හෝ රුක් මුලකට හෝ හිස් ගෙයකට හෝ ගොස් සිටින විට කාන්තාවක් ඔහු වෙත එළඹෙයි, ඉතා සමීපව හිඳගනියි, ඉතා සමීපව හාන්සි වෙයි, ඔහුව මුළුමනින්ම යටපත් කරයි. එසේ ඒ කාන්තාව විසින් ඉතා සමීපව හිඳගනු ලබන විට, ඉතා සමීපව හාන්සි කරනු ලබන විට, මුළුමනින්ම යටපත් කරනු ලබන විට, ඔහු ශික්‌ෂාව අත්නොහැර, දුර්වලතාවය ප්‍රකට නොකොට, මෛථුන ධර්මයෙහි හැසිරෙයි. මෙය ඔහුගේ ‘සම්පහාරය’ නම් වූ පරාජයයි. මහණෙනි, යම් සේ රජස් කන්දට ද, ධජ කන්දට ද, ‘උස්සාරණයට’ ද ඔරොත්තු දෙන රණශූරයෙක්, එහෙත් ‘සම්පහාරය’ (සෘජු ප්‍රහාරය) හමුවේ පරාජය වී විනාශයට පත්වේ ද, මහණෙනි, මම මේ පුද්ගලයා ඒ රණශූරයාට උපමා කරමි. මහණෙනි, මෙබඳු පුද්ගලයෙක් ද මෙහි සිටී. මහණෙනි, භික්ෂූන් අතර සිටින මේ සිව්වැනි රණශූරයාට උපමා කළ හැකි පුද්ගලයා යි.\n\nමහණෙනි, නැවතත් යම් භික්ෂුවක් රජස් කන්දට ද, ධජ කන්දට ද, ‘උස්සාරණයට’ ද, ‘සම්පහාරයට’ ද ඔරොත්තු දෙයි. ඔහු ඒ සටන මුළුමනින්ම ජයගෙන, සටනින් ජයගත් රණශූරයෙකු ලෙස, ඒ සටන් බිමෙහිම වාසය කරයි. ඔහුගේ ‘සංග්‍රාම විජය’ නම් කුමක්ද? මහණෙනි, මෙහිදී යම් භික්ෂුවක් අරණ්‍යයකට හෝ රුක් මුලකට හෝ හිස් ගෙයකට හෝ ගොස් සිටින විට කාන්තාවක් ඔහු වෙත එළඹෙයි, ඉතා සමීපව හිඳගනියි, ඉතා සමීපව හාන්සි වෙයි, ඔහුව මුළුමනින්ම යටපත් කරයි. එසේ ඒ කාන්තාව විසින් ඉතා සමීපව හිඳගනු ලබන විට, ඉතා සමීපව හාන්සි කරනු ලබන විට, මුළුමනින්ම යටපත් කරනු ලබන විට, ඔහු (ඇගේ බලපෑමෙන්) මිදී, (බන්දනයෙන්) නිදහස් වී, තමා කැමති තැනකට පිටත්ව යයි. ඔහු හුදෙකලා වූ සේනාසනයක් – අරණ්‍යයක්, රුක් මුලක්, පර්වතයක්, කන්දරාවක්, ගිරි ගුහාවක්, සුසාන භූමියක්, වනපෙතක්, එළිමහනක්, පිදුරු ගොඩක් – සෙවීමට යයි.\n\nඔහු අරණ්‍යයකට හෝ රුක් මුලකට හෝ හිස් ගෙයකට හෝ ගොස් පලක් බැඳ, සෘජුව ශරීරය තබාගෙන, සිහිය ඉදිරියට ගෙන (කමටහනට යොමු කොට) හිඳගනියි. ඔහු ලෝකය පිළිබඳ ලෝභය අත්හැර, ලෝභයෙන් තොර වූ සිතකින් වාසය කරයි, ලෝභයෙන් සිත පිරිසිදු කරයි. ව්‍යාපාදය සහ ද්වේෂය අත්හැර, ව්‍යාපාදයෙන් තොර වූ සිතකින්, සියලු සත්ත්වයන් කෙරෙහි හිතානුකම්පාවෙන් යුතුව වාසය කරයි, ව්‍යාපාදයෙන් සහ ද්වේෂයෙන් සිත පිරිසිදු කරයි. ථීනමිද්ධය අත්හැර, ථීනමිද්ධයෙන් තොරව, ආලෝක සංඥාවෙන් යුක්තව, සිහි නුවණින් යුතුව වාසය කරයි, ථීනමිද්ධයෙන් සිත පිරිසිදු කරයි. උද්ධච්ච-කුක්කුච්චය අත්හැර, නොකැළඹී, ඇතුළතින් සංසිඳුණු සිතකින් වාසය කරයි, උද්ධච්ච-කුක්කුච්චයෙන් සිත පිරිසිදු කරයි. විචිකිච්ඡාව අත්හැර, විචිකිච්ඡාවෙන් එතෙර වී, කුසල ධර්මයන් පිළිබඳව සැක රහිතව වාසය කරයි, විචිකිච්ඡාවෙන් සිත පිරිසිදු කරයි.\n\nඔහු ඥානය දුර්වල කරන, සිතේ කෙලෙස් වූ මේ පංච නීවරණ අත්හැර, කාමයන්ගෙන් වෙන්ව... (ඉන්පසු පළමු සහ දෙවැනි ධ්‍යාන විස්තරය ගම්‍ය වේ)... ප්‍රීතිය ද පහව යෑමෙන් උපේක්‌ෂාවෙන් යුතුව, සිහි නුවණින් වාසය කරමින්, ශරීරයෙන් සුඛය විඳියි. ‘උපේක්‌ෂාවෙන් යුක්ත වූ, සිහි නුවණින් යුතු වූ, සැප විහරණයෙන් යුක්ත වූ පුද්ගලයා’ යැයි ආර්යයන් වහන්සේලා යමක් කියත් ද, ඒ තෙවැනි ධ්‍යානයට එළඹ වාසය කරයි. සුඛය ද පහවීමෙන්, දුක ද පහවීමෙන්, පළමුව ම සොම්නස්-දොම්නස් නැතිවීමෙන්, දුක් නොවන, සැප නොවන උපේක්‌ෂා-ස්මෘති පාරිශුද්ධිය ඇති සිවුවැනි ධ්‍යානයට එළඹ වාසය කරයි.\n\nමෙසේ එකඟ වූ, පිරිසිදු වූ, මලින් තොර වූ, උපක්ලේශයන් පහව ගිය, මෘදු වූ, ක්‍රියාශීලී වූ, ස්ථාවර වූ, කම්පනයකින් තොර වූ සිතින් යුතුව ඔහු ආශ්‍රවයන් ක්‌ෂය කිරීමේ ඥාණයට සිත යොමු කරයි. ඔහු ‘මෙය දුක යි’ කියාත්, ‘මෙය දුක ඇතිවීමට හේතුව යි’ කියාත්, ‘මෙය දුක නැති කිරීම යි’ කියාත්, ‘මෙය දුක නැති කිරීමට යන මාර්ගය යි’ කියාත්, යථාභූත ලෙස දනී. ‘මේවා ආශ්‍රව යි’ කියාත්, ‘මෙය ආශ්‍රවයන් ඇතිවීමට හේතුව යි’ කියාත්, ‘මෙය ආශ්‍රවයන් නැති කිරීම යි’ කියාත්, ‘මෙය ආශ්‍රවයන් නැති කිරීමට යන මාර්ගය යි’ කියාත්, යථාභූත ලෙස දනී. එසේ දන්නා, එසේ දකින ඔහුගේ සිත කාමාශ්‍රවයෙන් ද නිදහස් වෙයි, භවාශ්‍රවයෙන් ද නිදහස් වෙයි, අවිද්‍යාශ්‍රවයෙන් ද නිදහස් වෙයි. නිදහස් වීමෙන් ‘නිදහස් විය’ යන ඥාණය ඔහුට ඇති වෙයි. ‘ජාතිය ක්‌ෂය විය, බ්‍රහ්මචාරී ජීවිතය විසූවා, කළ යුතු දේ කෙළේ ය, නැවත මේ තත්ත්වයට (භවයට) නොපැමිණේ’ යැයි ඔහු අවබෝධ කරයි. මෙය ඔහුගේ ‘සංග්‍රාම විජය’ යි.\n\nමහණෙනි, යම් සේ එක් සටන්කාමී යෝධයෙක් සටනේ පෙරමුණේ ඇති දූවිලි දුහුවිලි විඳ දරා ගනී ද, සටනේ පෙරමුණේ ඇති ධජ පතාක විඳ දරා ගනී ද, ඝෝෂාව විඳ දරා ගනී ද, සම්ප්‍රහාරය විඳ දරා ගනී ද, හෙතෙම ඒ සටන සම්පූර්ණයෙන්ම ජයගෙන, යුද්ධය ජයගත් තැනැත්තෙක් වී, ඒ යුදබිමේම පෙරමුණේ වාසය කරයි ද; එසේම මහණෙනි, මම මේ පුද්ගලයා ද එබඳු යයි කියමි. මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් ද එබඳු ස්වභාවයෙන් යුක්ත වේ. මහණෙනි, භික්ෂූන් වහන්සේලා අතර සිටිනා, විද්‍යමාන වන පස්වැනි යෝධෝපම පුද්ගලයා මොහු ය. මහණෙනි, භික්ෂූන් වහන්සේලා අතර සිටිනා, විද්‍යමාන වන යෝධෝපම පුද්ගලයෝ පස්දෙනා මොවුහු ය.",
      "paliTitle": "Paṭhamayodhājīvasuttaṃ",
      "englishTitle": "The First Discourse on the Warrior",
      "sinhalaTitle": "පළමු යෝධාජීව සූත්‍රය"
    },
    {
      "number": 76,
      "pali": "‘‘Pañcime, bhikkhave, yodhājīvā santo saṃvijjamānā lokasmiṃ. Katame pañca? Idha, bhikkhave, ekacco yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati. So tasmiṃ saṅgāme ussahati vāyamati. Tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, paṭhamo yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati. So tasmiṃ saṅgāme ussahati vāyamati. Tamenaṃ ussahantaṃ vāyamantaṃ pare upalikkhanti [upalikhanti (ka.)], tamenaṃ apanenti; apanetvā ñātakānaṃ nenti. So ñātakehi nīyamāno appatvāva ñātake antarāmagge kālaṃ karoti. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, dutiyo yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati. So tasmiṃ saṅgāme ussahati vāyamati. Tamenaṃ ussahantaṃ vāyamantaṃ pare upalikkhanti, tamenaṃ apanenti; apanetvā ñātakānaṃ nenti. Tamenaṃ ñātakā upaṭṭhahanti paricaranti. So ñātakehi upaṭṭhahiyamāno paricariyamāno teneva ābādhena kālaṃ karoti. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, tatiyo yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati. So tasmiṃ saṅgāme ussahati vāyamati. Tamenaṃ ussahantaṃ vāyamantaṃ pare upalikkhanti, tamenaṃ apanenti; apanetvā ñātakānaṃ nenti. Tamenaṃ ñātakā upaṭṭhahanti paricaranti. So ñātakehi upaṭṭhahiyamāno paricariyamāno vuṭṭhāti tamhā ābādhā. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, catuttho yodhājīvo santo saṃvijjamāno lokasmiṃ. ‘‘Puna caparaṃ, bhikkhave, idhekacco yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati. So taṃ saṅgāmaṃ abhivijinitvā vijitasaṅgāmo tameva saṅgāmasīsaṃ ajjhāvasati. Evarūpopi, bhikkhave, idhekacco yodhājīvo hoti. Ayaṃ, bhikkhave, pañcamo yodhājīvo santo saṃvijjamāno lokasmiṃ. Ime kho, bhikkhave, pañca yodhājīvā santo saṃvijjamānā lokasmiṃ. ‘‘Evamevaṃ kho, bhikkhave, pañcime yodhājīvūpamā puggalā santo saṃvijjamānā bhikkhūsu. Katame pañca? Idha, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. So pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya satiyā asaṃvutehi indriyehi. So tattha passati mātugāmaṃ dunnivatthaṃ vā duppārutaṃ vā. Tassa taṃ mātugāmaṃ disvā dunnivatthaṃ vā duppārutaṃ vā rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena sikkhaṃ apaccakkhāya dubbalyaṃ anāvikatvā methunaṃ dhammaṃ paṭisevati. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati, so tasmiṃ saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare hananti pariyāpādenti; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, paṭhamo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. So pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya satiyā asaṃvutehi indriyehi. So tattha passati mātugāmaṃ dunnivatthaṃ vā duppārutaṃ vā. Tassa taṃ mātugāmaṃ disvā dunnivatthaṃ vā duppārutaṃ vā rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena pariḍayhateva kāyena pariḍayhati cetasā. Tassa evaṃ hoti – ‘yaṃnūnāhaṃ ārāmaṃ gantvā bhikkhūnaṃ āroceyyaṃ – rāgapariyuṭṭhitomhi [rāgāyitomhi (sī. syā. kaṃ)], āvuso, rāgapareto, na sakkomi brahmacariyaṃ sandhāretuṃ; sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattissāmī’ti. So ārāmaṃ gacchanto appatvāva ārāmaṃ antarāmagge sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati, so tasmiṃ saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare upalikkhanti, tamenaṃ apanenti; apanetvā ñātakānaṃ nenti. So ñātakehi nīyamāno appatvāva ñātake antarāmagge kālaṃ karoti; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, dutiyo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. So pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya satiyā asaṃvutehi indriyehi. So tattha passati mātugāmaṃ dunnivatthaṃ vā duppārutaṃ vā. Tassa taṃ mātugāmaṃ disvā dunnivatthaṃ vā duppārutaṃ vā rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena pariḍayhateva kāyena pariḍayhati cetasā. Tassa evaṃ hoti – ‘yaṃnūnāhaṃ ārāmaṃ gantvā bhikkhūnaṃ āroceyyaṃ – rāgapariyuṭṭhitomhi, āvuso, rāgapareto, na sakkomi brahmacariyaṃ sandhāretuṃ; sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattissāmī’ti. So ārāmaṃ gantvā bhikkhūnaṃ āroceti – ‘rāgapariyuṭṭhitomhi, āvuso, rāgapareto, na sakkomi brahmacariyaṃ sandhāretuṃ; sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattissāmī’’’ti. ‘‘Tamenaṃ sabrahmacārī ovadanti anusāsanti – ‘appassādā, āvuso, kāmā vuttā bhagavatā bahudukkhā bahupāyāsā [bahūpāyāsā (sī. syā. kaṃ. pī.) pāci. 417; cūḷava. 65; ma. ni. 1.234], ādīnavo ettha bhiyyo. Aṭṭhikaṅkalūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Maṃsapesūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Tiṇukkūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Aṅgārakāsūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Supinakūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Yācitakūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Rukkhaphalūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Asisūnūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Sattisūlūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Sappasirūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Abhiramatāyasmā brahmacariye; māyasmā sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattī’’’ti. ‘‘So sabrahmacārīhi evaṃ ovadiyamāno evaṃ anusāsiyamāno evamāha – ‘kiñcāpi, āvuso, appassādā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo; atha kho nevāhaṃ sakkomi brahmacariyaṃ sandhāretuṃ, sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattissāmī’’’ti. So sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati, so tasmiṃ saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare upalikkhanti, tamenaṃ apanenti; apanetvā ñātakānaṃ nenti, tamenaṃ ñātakā upaṭṭhahanti paricaranti. So ñātakehi upaṭṭhahiyamāno paricariyamāno teneva ābādhena kālaṃ karoti; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, tatiyo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. So pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya satiyā asaṃvutehi indriyehi. So tattha passati mātugāmaṃ dunnivatthaṃ vā duppārutaṃ vā. Tassa taṃ mātugāmaṃ disvā dunnivatthaṃ vā duppārutaṃ vā rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena pariḍayhateva kāyena pariḍayhati cetasā. Tassa evaṃ hoti – ‘yaṃnūnāhaṃ ārāmaṃ gantvā bhikkhūnaṃ āroceyyaṃ – rāgapariyuṭṭhitomhi, āvuso, rāgapareto, na sakkomi brahmacariyaṃ sandhāretuṃ; sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattissāmī’ti. So ārāmaṃ gantvā bhikkhūnaṃ āroceti – ‘rāgapariyuṭṭhitomhi, āvuso, rāgapareto, na sakkomi brahmacariyaṃ sandhāretuṃ; sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattissāmī’’’ti. ‘‘Tamenaṃ sabrahmacārī ovadanti anusāsanti – ‘appassādā, āvuso, kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Aṭṭhikaṅkalūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Maṃsapesūpamā kāmā vuttā bhagavatā…pe… tiṇukkūpamā kāmā vuttā bhagavatā… aṅgārakāsūpamā kāmā vuttā bhagavatā… supinakūpamā kāmā vuttā bhagavatā… yācitakūpamā kāmā vuttā bhagavatā… rukkhaphalūpamā kāmā vuttā bhagavatā… asisūnūpamā kāmā vuttā bhagavatā… sattisūlūpamā kāmā vuttā bhagavatā… sappasirūpamā kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Abhiramatāyasmā brahmacariye; māyasmā sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattī’’’ti. ‘‘So sabrahmacārīhi evaṃ ovadiyamāno evaṃ anusāsiyamāno evamāha – ‘ussahissāmi, āvuso, vāyamissāmi, āvuso, abhiramissāmi, āvuso! Na dānāhaṃ, āvuso, sikkhādubbalyaṃ āvikatvā sikkhaṃ paccakkhāya hīnāyāvattissāmī’’’ti. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati, so tasmiṃ saṅgāme ussahati vāyamati, tamenaṃ ussahantaṃ vāyamantaṃ pare upalikkhanti, tamenaṃ apanenti; apanetvā ñātakānaṃ nenti, tamenaṃ ñātakā upaṭṭhahanti paricaranti. So ñātakehi upaṭṭhahiyamāno paricariyamāno vuṭṭhāti tamhā ābādhā; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, catuttho yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. ‘‘Puna caparaṃ, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. So pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya tameva gāmaṃ vā nigamaṃ vā piṇḍāya pavisati rakkhiteneva kāyena rakkhitāya vācāya rakkhitena cittena upaṭṭhitāya satiyā saṃvutehi indriyehi. So cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā … jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. So pacchābhattaṃ piṇḍapātapaṭikkanto vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. So araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So abhijjhaṃ loke pahāya…pe… so ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhininnāmeti. So ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… nāparaṃ itthattāyāti pajānāti’’. ‘‘Seyyathāpi so, bhikkhave, yodhājīvo asicammaṃ gahetvā dhanukalāpaṃ sannayhitvā viyūḷhaṃ saṅgāmaṃ otarati, so taṃ saṅgāmaṃ abhivijinitvā vijitasaṅgāmo tameva saṅgāmasīsaṃ ajjhāvasati; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco puggalo hoti. Ayaṃ, bhikkhave, pañcamo yodhājīvūpamo puggalo santo saṃvijjamāno bhikkhūsu. Ime kho, bhikkhave, pañca yodhājīvūpamā puggalā santo saṃvijjamānā bhikkhūsū’’ti. Chaṭṭhaṃ.",
      "english": "Mendicants, there are these five types of warriors present and existing in the world. Which five? Here, mendicants, a certain warrior takes up sword and shield, straps on a quiver of arrows, and enters a well-arrayed battle. He strives and exerts himself in that battle. While he is striving and exerting himself, the opponents strike him down and slay him. Such a warrior, mendicants, is found here. This, mendicants, is the first type of warrior present and existing in the world.\n\nAgain, mendicants, a certain warrior takes up sword and shield, straps on a quiver of arrows, and enters a well-arrayed battle. He strives and exerts himself in that battle. While he is striving and exerting himself, the opponents wound him, and they remove him; having removed him, they take him to his relatives. Being taken by his relatives, he passes away on the way, before reaching his relatives. Such a warrior, mendicants, is found here. This, mendicants, is the second type of warrior present and existing in the world.\n\nAgain, mendicants, a certain warrior takes up sword and shield, straps on a quiver of arrows, and enters a well-arrayed battle. He strives and exerts himself in that battle. While he is striving and exerting himself, the opponents wound him, and they remove him; having removed him, they take him to his relatives. His relatives nurse and attend to him. While being nursed and attended to by his relatives, he passes away from that very injury. Such a warrior, mendicants, is found here. This, mendicants, is the third type of warrior present and existing in the world.\n\nAgain, mendicants, a certain warrior takes up sword and shield, straps on a quiver of arrows, and enters a well-arrayed battle. He strives and exerts himself in that battle. While he is striving and exerting himself, the opponents wound him, and they remove him; having removed him, they take him to his relatives. His relatives nurse and attend to him. While being nursed and attended to by his relatives, he recovers from that injury. Such a warrior, mendicants, is found here. This, mendicants, is the fourth type of warrior present and existing in the world.\n\nAgain, mendicants, a certain warrior takes up sword and shield, straps on a quiver of arrows, and enters a well-arrayed battle. He completely overcomes that battle, and having won the battle, he dwells in that very battleground. Such a warrior, mendicants, is found here. This, mendicants, is the fifth type of warrior present and existing in the world. These, mendicants, are the five types of warriors present and existing in the world.\n\nIn the same way, mendicants, there are these five types of individuals, comparable to warriors, present and existing among the monastics. Which five?\n\nHere, mendicants, a monastic dwells dependent on a certain village or town. In the morning, having dressed, he takes his bowl and robe and enters that very village or town for alms, with an unguarded body, unguarded speech, unguarded mind, unestablished mindfulness, and uncontrolled faculties. There, he sees a woman who is poorly dressed or poorly covered. Having seen that woman poorly dressed or poorly covered, lust invades his mind. With his mind invaded by lust, without having disavowed the training, without having declared his weakness, he engages in sexual intercourse. Just as, mendicants, that warrior takes up sword and shield, straps on a quiver of arrows, and enters a well-arrayed battle, and he strives and exerts himself in that battle, and while he is striving and exerting himself, the opponents strike him down and slay him; I declare this individual to be comparable to that. Such an individual, mendicants, is found here. This, mendicants, is the first type of individual, comparable to a warrior, present and existing among the monastics.\n\nAgain, mendicants, a monastic dwells dependent on a certain village or town. In the morning, having dressed, he takes his bowl and robe and enters that very village or town for alms, with an unguarded body, unguarded speech, unguarded mind, unestablished mindfulness, and uncontrolled faculties. There, he sees a woman who is poorly dressed or poorly covered. Having seen that woman poorly dressed or poorly covered, lust invades his mind. With his mind invaded by lust, he burns with fever in body and mind. He thinks: ‘What if I were to go to the monastery and inform the monastics: 'Friends, I am overcome by lust, overwhelmed by lust, I am unable to maintain the celibate life; I shall declare my weakness in the training, disavow the training, and revert to a lower state.’ While going to the monastery, before reaching the monastery, on the way, he declares his weakness in the training, disavows the training, and reverts to a lower state.\n\nJust as, monks, a warrior takes up sword and shield, straps on a quiver of arrows, and enters a battlefield arrayed for war, he exerts himself, strives in that battle, but while he is exerting himself and striving, his enemies attack him and carry him off; having carried him off, they take him to his relatives. While being carried by his relatives, he dies on the way before reaching them; I declare this person to be like that, monks. Such a type of individual, monks, is found here. This, monks, is the second type of person comparable to a warrior, existing and found among the bhikkhus.\n\nAgain, further, monks, a bhikkhu lives dependent on a certain village or town. In the morning, having dressed, taking his bowl and robes, he enters that very village or town for alms, with his body unguarded, his speech unguarded, his mind unguarded, with mindfulness not established, and with his sense faculties unrestrained. There he sees a woman who is poorly dressed or poorly covered. Having seen that woman who is poorly dressed or poorly covered, lust invades his mind. With his mind thus invaded by lust, he burns with fever in body and burns with fever in mind. Then he thinks: ‘Why don’t I go to the monastery and inform the bhikkhus: “Friends, I am assailed by lust, overwhelmed by lust, I am unable to maintain the celibate life; I shall reveal my weakness in training, renounce the training, and return to a lower state.”’ So he goes to the monastery and informs the bhikkhus: ‘Friends, I am assailed by lust, overwhelmed by lust, I am unable to maintain the celibate life; I shall reveal my weakness in training, renounce the training, and return to a lower state.’\n\nThen his fellow practitioners advise and instruct him: ‘Friends, sensual pleasures have been declared by the Blessed One to have little satisfaction, much suffering, and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like a skeleton, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like a piece of meat, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like a torch of dry grass, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like a pit of burning coals, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like a dream, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like borrowed goods, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like the fruits on a tree, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like a slaughterhouse, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like a stake and spear, with much suffering and much despair; their danger is greater. Sensual pleasures have been declared by the Blessed One to be like the head of a serpent, with much suffering and much despair; their danger is greater. May you, Venerable One, delight in the celibate life; may you not reveal your weakness in training, renounce the training, and return to a lower state.’\n\nEven though thus advised and instructed by his fellow practitioners, he says this: ‘Friends, even though sensual pleasures have been declared by the Blessed One to have little satisfaction, much suffering, and much despair, and their danger is greater; yet I am unable to maintain the celibate life, and I shall reveal my weakness in training, renounce the training, and return to a lower state.’ So he reveals his weakness in training, renounces the training, and returns to a lower state.\n\nJust as, monks, a warrior takes up sword and shield, straps on a quiver of arrows, and enters a battlefield arrayed for war, he exerts himself, strives in that battle, but while he is exerting himself and striving, his enemies attack him and carry him off; having carried him off, they take him to his relatives, and his relatives attend to him and nurse him. While being attended to and nursed by his relatives, he dies from that very affliction; I declare this person to be like that, monks. Such a type of individual, monks, is found here. This, monks, is the third type of person comparable to a warrior, existing and found among the bhikkhus.\n\nAgain, further, monks, a bhikkhu lives dependent on a certain village or town. In the morning, having dressed, taking his bowl and robes, he enters that very village or town for alms, with his body unguarded, his speech unguarded, his mind unguarded, with mindfulness not established, and with his sense faculties unrestrained. There he sees a woman who is poorly dressed or poorly covered. Having seen that woman who is poorly dressed or poorly covered, lust invades his mind. With his mind thus invaded by lust, he burns with fever in body and burns with fever in mind.\n\nHe thinks thus: 'What if I were to go to the monastery and declare to the bhikkhus: \"Friends, I am overcome by passion, overwhelmed by passion, and I cannot sustain the holy life; having revealed my weakness in training, having renounced the training, I will return to a lower state.\"'\n\nSo he goes to the monastery and declares to the bhikkhus: 'Friends, I am overcome by passion, overwhelmed by passion, and I cannot sustain the holy life; having revealed my weakness in training, having renounced the training, I will return to a lower state.'\n\nHis fellow practitioners admonish and instruct him: 'Friends, sense pleasures have been declared by the Blessed One to be of little satisfaction, fraught with much suffering and much despair, with even greater danger therein. Sense pleasures have been declared by the Blessed One to be like a skeleton, fraught with much suffering and much despair, with even greater danger therein. Sense pleasures have been declared by the Blessed One to be like a piece of flesh. Sense pleasures have been declared by the Blessed One to be like a grass-torch. Sense pleasures have been declared by the Blessed One to be like a pit of glowing coals. Sense pleasures have been declared by the Blessed One to be like a dream. Sense pleasures have been declared by the Blessed One to be like borrowed goods. Sense pleasures have been declared by the Blessed One to be like fruit on a tree. Sense pleasures have been declared by the Blessed One to be like a sword's edge. Sense pleasures have been declared by the Blessed One to be like a stake and spear. Sense pleasures have been declared by the Blessed One to be like the head of a snake, fraught with much suffering and much despair, with even greater danger therein. May Venerable Sir delight in the holy life; may Venerable Sir not reveal weakness in training, renounce the training, and return to a lower state.'\n\nThus admonished and instructed by his fellow practitioners, he says: 'Friends, I will exert myself, friends, I will strive, friends, I will delight! Friends, I will no longer reveal weakness in training, renounce the training, and return to a lower state.'\n\nJust as, bhikkhus, a warrior taking up his sword and shield, having armed himself with bow and quiver, enters a battle arrayed for combat; he strives and exerts himself in that battle, but the enemy assail him as he strives and exerts himself, and they take him away; having taken him away, they bring him to his relatives, and his relatives attend to him and care for him. He, being attended to and cared for by his relatives, recovers from that illness. I declare this person to be like that, bhikkhus. Such a type of person is found here among the bhikkhus. This, bhikkhus, is the fourth person among the bhikkhus who is like a warrior, existing and to be found.\n\nFurthermore, bhikkhus, a bhikkhu dwells having recourse to a certain village or town. In the morning, having dressed, taking his bowl and robe, he enters that same village or town for alms, with guarded body, guarded speech, guarded mind, with mindfulness established, and with senses restrained. Seeing a form with the eye, he is not one who grasps at the overall appearance or the details. For that reason, if the eye-faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might assail him; for its restraint, he practices; he guards the eye-faculty; he undertakes the restraint of the eye-faculty. Hearing a sound with the ear, he is not one who grasps at the overall appearance or the details. For that reason, if the ear-faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might assail him; for its restraint, he practices; he guards the ear-faculty; he undertakes the restraint of the ear-faculty. Smelling an odor with the nose, he is not one who grasps at the overall appearance or the details. For that reason, if the nose-faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might assail him; for its restraint, he practices; he guards the nose-faculty; he undertakes the restraint of the nose-faculty. Tasting a flavor with the tongue, he is not one who grasps at the overall appearance or the details. For that reason, if the tongue-faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might assail him; for its restraint, he practices; he guards the tongue-faculty; he undertakes the restraint of the tongue-faculty. Touching a tangible object with the body, he is not one who grasps at the overall appearance or the details. For that reason, if the body-faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might assail him; for its restraint, he practices; he guards the body-faculty; he undertakes the restraint of the body-faculty.\n\nCognizing a mental phenomenon with the mind, he is not one who grasps at the overall appearance or the details. For that reason, if the mind-faculty were to remain unrestrained, evil unwholesome states of covetousness and distress might assail him; for its restraint, he practices; he guards the mind-faculty; he undertakes the restraint of the mind-faculty.\n\nAfter his meal, having returned from his alms round, he resorts to a secluded lodging: a wilderness, the root of a tree, a mountain, a ravine, a mountain cave, a charnel ground, a forest grove, the open air, a heap of straw. Having gone to the wilderness, or to the root of a tree, or to an empty dwelling, he sits down, folding his legs crosswise, setting his body erect, and establishing mindfulness in front of him.\n\nHe, having abandoned covetousness for the world, having abandoned ill-will, having abandoned sloth and torpor, having abandoned restlessness and remorse, having abandoned doubt — thus having abandoned these five hindrances, these defilements of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters and abides in the first jhana, which is accompanied by applied thought and sustained thought, born of seclusion and rapture and happiness; with the fading away of applied thought and sustained thought, he enters and abides in the second jhana, which has internal confidence and unification of mind, is without applied thought and sustained thought, born of concentration and rapture and happiness; with the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body, he enters and abides in the third jhana, which the noble ones declare as 'dwelling in equanimity, mindfulness, and happiness'; with the abandoning of pleasure and pain, and with the prior disappearance of joy and sorrow, he enters and abides in the fourth jhana, which is neither painful nor pleasant, and is purified by equanimity and mindfulness.\n\nWith his mind thus concentrated, purified, cleansed, unblemished, rid of defilements, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines his mind to the knowledge of the destruction of the taints. He understands 'this is suffering' as it actually is; he understands 'this is the origin of suffering' as it actually is; he understands 'this is the cessation of suffering' as it actually is; he understands 'this is the path to the cessation of suffering' as it actually is. He understands 'these are the taints' as it actually is; he understands 'this is the origin of the taints' as it actually is; he understands 'this is the cessation of the taints' as it actually is; he understands 'this is the path to the cessation of the taints' as it actually is. He understands: 'There is no further state of being for me.'\n\nJust as, bhikkhus, a warrior taking up his sword and shield, having armed himself with bow and quiver, enters a battle arrayed for combat; he conquers that battle, and having won the battle, he dwells in that very chief place of battle. I declare this person to be like that, bhikkhus. Such a type of person is found here among the bhikkhus. This, bhikkhus, is the fifth person among the bhikkhus who is like a warrior, existing and to be found. These, bhikkhus, are the five persons like warriors, existing and to be found among the bhikkhus.",
      "sinhala": "මහණෙනි, මේ ලෝකයෙහි සටන් වදින සෙබළු පස්දෙනෙක් සිටිති. ඒ පස්දෙනා කවරහුද? මහණෙනි, මෙහි ඇතැම් සටන් වදින සෙබළෙක් අසිපතක්ද පලිහක්ද ගෙන, දුනු ඊතල සූදානම් කරගෙන සටනට පිවිසෙයි. හෙතෙම ඒ සටනේදී උත්සාහ කරයි, වීර්යය කරයි. උත්සාහ කරන, වීර්යය කරන ඔහුට සතුරෝ පහර දී මරා දමති. මහණෙනි, මෙබඳු සටන් වදින සෙබළෙක් මෙහි සිටියි. මහණෙනි, මේ ලෝකයෙහි සිටින පළමු සටන් වදින සෙබළාය.\n\nමහණෙනි, තවද, මෙහි ඇතැම් සටන් වදින සෙබළෙක් අසිපතක්ද පලිහක්ද ගෙන, දුනු ඊතල සූදානම් කරගෙන සටනට පිවිසෙයි. හෙතෙම ඒ සටනේදී උත්සාහ කරයි, වීර්යය කරයි. උත්සාහ කරන, වීර්යය කරන ඔහුට සතුරෝ පහර දී, ඔහුව ඉවත් කර, ඥාතීන් වෙත ගෙන යති. ඥාතීන් විසින් ගෙන යනු ලබන හෙතෙම ඥාතීන් වෙත නොපැමිණම අතරමගදී මරණයට පත්වෙයි. මහණෙනි, මෙබඳු සටන් වදින සෙබළෙක් මෙහි සිටියි. මහණෙනි, මේ ලෝකයෙහි සිටින දෙවන සටන් වදින සෙබළාය.\n\nමහණෙනි, තවද, මෙහි ඇතැම් සටන් වදින සෙබළෙක් අසිපතක්ද පලිහක්ද ගෙන, දුනු ඊතල සූදානම් කරගෙන සටනට පිවිසෙයි. හෙතෙම ඒ සටනේදී උත්සාහ කරයි, වීර්යය කරයි. උත්සාහ කරන, වීර්යය කරන ඔහුට සතුරෝ පහර දී, ඔහුව ඉවත් කර, ඥාතීන් වෙත ගෙන යති. ඥාතීහු ඔහුට උපස්ථාන කරති, සාත්තු කරති. ඥාතීන් විසින් උපස්ථාන කරනු ලබන, සාත්තු කරනු ලබන හෙතෙම ඒ ආබාධයෙන්ම මරණයට පත්වෙයි. මහණෙනි, මෙබඳු සටන් වදින සෙබළෙක් මෙහි සිටියි. මහණෙනි, මේ ලෝකයෙහි සිටින තෙවන සටන් වදින සෙබළාය.\n\nමහණෙනි, තවද, මෙහි ඇතැම් සටන් වදින සෙබළෙක් අසිපතක්ද පලිහක්ද ගෙන, දුනු ඊතල සූදානම් කරගෙන සටනට පිවිසෙයි. හෙතෙම ඒ සටනේදී උත්සාහ කරයි, වීර්යය කරයි. උත්සාහ කරන, වීර්යය කරන ඔහුට සතුරෝ පහර දී, ඔහුව ඉවත් කර, ඥාතීන් වෙත ගෙන යති. ඥාතීහු ඔහුට උපස්ථාන කරති, සාත්තු කරති. ඥාතීන් විසින් උපස්ථාන කරනු ලබන, සාත්තු කරනු ලබන හෙතෙම ඒ ආබාධයෙන් සුවපත් වෙයි. මහණෙනි, මෙබඳු සටන් වදින සෙබළෙක් මෙහි සිටියි. මහණෙනි, මේ ලෝකයෙහි සිටින සතරවන සටන් වදින සෙබළාය.\n\nමහණෙනි, තවද, මෙහි ඇතැම් සටන් වදින සෙබළෙක් අසිපතක්ද පලිහක්ද ගෙන, දුනු ඊතල සූදානම් කරගෙන සටනට පිවිසෙයි. හෙතෙම ඒ සටන හොඳින් ජයගෙන, සටන ජයගත් තැනැත්තෙක් වී, ඒ සටන් බිමේ ප්‍රධානියා බවට පත්වෙයි. මහණෙනි, මෙබඳු සටන් වදින සෙබළෙක් මෙහි සිටියි. මහණෙනි, මේ ලෝකයෙහි සිටින පස්වන සටන් වදින සෙබළාය. මහණෙනි, මේ පස්දෙනා ලෝකයෙහි සිටින සටන් වදින සෙබළු වෙති.\n\nමහණෙනි, එසේම, භික්ෂූන් අතර සටන් වදින සෙබළුන්ට උපමා කළ හැකි පුද්ගලයන් පස්දෙනෙක් සිටිති. ඒ පස්දෙනා කවරහුද? මහණෙනි, මෙහි ඇතැම් භික්ෂුවක් කිසියම් ගමක් හෝ නියම්ගමක් ඇසුරු කරගෙන වාසය කරයි. හෙතෙම පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු ගෙන, ඒ ගමට හෝ නියම්ගමට පිඬු සිඟා වඩියි. එසේ වඩින්නේ ආරක්‍ෂා නොකරන ලද කයින්, ආරක්‍ෂා නොකරන ලද වචනයෙන්, ආරක්‍ෂා නොකරන ලද සිතින්, නොපිහිටි සිහියෙන්, සංවර නොකරන ලද ඉන්ද්‍රියයන්ගෙනි. හෙතෙම එහිදී නුසුදුසු ලෙස හැඳ පැළඳගත්, හෝ නුසුදුසු ලෙස වැසූ ස්ත්‍රියක් දකියි. නුසුදුසු ලෙස හැඳ පැළඳගත්, හෝ නුසුදුසු ලෙස වැසූ ඒ ස්ත්‍රිය දැකීමෙන් ඔහුගේ සිතෙහි රාගය හටගනියි. රාගයෙන් විනාශ වූ සිතින්, ශික්ෂාව අත්නොහැර, දුබල බව නොදක්වා, මෛථුන ධර්මයෙහි හැසිරෙයි.\n\nමහණෙනි, යම්සේ ඒ සටන් වදින සෙබළා අසිපතක්ද පලිහක්ද ගෙන, දුනු ඊතල සූදානම් කරගෙන සටනට පිවිසෙයිද, හෙතෙම ඒ සටනේදී උත්සාහ කරයි, වීර්යය කරයිද, උත්සාහ කරන, වීර්යය කරන ඔහුට සතුරෝ පහර දී මරා දමතිද; මහණෙනි, මම මේ පුද්ගලයා ඒ උපමාවට කියමි. මහණෙනි, මෙබඳු පුද්ගලයෙක් මෙහි සිටියි. මහණෙනි, මේ භික්ෂූන් අතර සිටින සටන් වදින සෙබළාට උපමා කළ හැකි පළමු පුද්ගලයාය.\n\nමහණෙනි, තවද, ඇතැම් භික්ෂුවක් කිසියම් ගමක් හෝ නියම්ගමක් ඇසුරු කරගෙන වාසය කරයි. හෙතෙම පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු ගෙන, ඒ ගමට හෝ නියම්ගමට පිඬු සිඟා වඩියි. එසේ වඩින්නේ ආරක්‍ෂා නොකරන ලද කයින්, ආරක්‍ෂා නොකරන ලද වචනයෙන්, ආරක්‍ෂා නොකරන ලද සිතින්, නොපිහිටි සිහියෙන්, සංවර නොකරන ලද ඉන්ද්‍රියයන්ගෙනි. හෙතෙම එහිදී නුසුදුසු ලෙස හැඳ පැළඳගත්, හෝ නුසුදුසු ලෙස වැසූ ස්ත්‍රියක් දකියි. නුසුදුසු ලෙස හැඳ පැළඳගත්, හෝ නුසුදුසු ලෙස වැසූ ඒ ස්ත්‍රිය දැකීමෙන් ඔහුගේ සිතෙහි රාගය හටගනියි. රාගයෙන් විනාශ වූ සිතින්, හෙතෙම කයින් ද, සිතින් ද දැඩි ලෙස දැවෙයි. ඔහුට මෙසේ සිතෙයි – ‘කෙසේ හෝ මම ආරාමයට ගොස් භික්ෂූන්ට දන්වන්නෙම් නම් යහපති. ආයුෂ්මතුනි, මම රාගයෙන් අල්ලාගෙන සිටින ලද්දෙක්මි, රාගයෙන් පෙළෙන්නෙක්මි, බ්‍රහ්මචාරී ජීවිතය පවත්වාගෙන යාමට මට නොහැකිය. ශික්ෂාවේ දුබල බව ප්‍රකාශ කර, ශික්ෂාව අත්හැර හීන තත්වයට (ගිහි ජීවිතයට) හැරෙන්නෙමි’ කියා. ආරාමයට යමින් සිටින හෙතෙම ආරාමයට නොපැමිණම අතරමගදී ශික්ෂාවේ දුබල බව ප්‍රකාශ කර, ශික්ෂාව අත්හැර හීන තත්වයට හැරෙයි.\n\nමහණෙනි, යම්සේ යෝධයෙක් කඩු හා පලිහ ගෙන, ඊතල සහිත දුන්න සකසාගෙන, යුද පෙරමුණට බසී ද, හෙතෙම ඒ සංග්‍රාමයේදී උත්සාහ කරයි, වෑයම් කරයි. එසේ උත්සාහ කරන්නා වූ, වෑයම් කරන්නා වූ ඔහුට සතුරෝ පහර දෙති. ඔහුව ඉවත් කරති. ඉවත් කොට ඥාතීන් වෙත ගෙන යති. හෙතෙම ඥාතීන් විසින් ගෙන යනු ලබද්දී ඥාතීන් වෙත නොපැමිණම අතරමඟදී මරණයට පත්වේ. මහණෙනි, මේ පුද්ගලයා ඒ උපමාවට සමාන යැයි මම කියමි. මහණෙනි, මෙබඳු පුද්ගලයෙක් ද මෙහි ඇත. මහණෙනි, භික්ෂූන් අතර සිටින, පවතින මේ දෙවෙනි යෝධයා වැනි පුද්ගලයා යි.\n\nමහණෙනි, තවද යම් භික්ෂුවක් කිසියම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කොට වාසය කරයි. හෙතෙම පෙරවරුවේ හැඳ පොරවා පාත්‍ර සිවුරු ගෙන, අරක්ෂිත වූ කයින්, අරක්ෂිත වූ වචනයෙන්, අරක්ෂිත වූ සිතින්, උපස්ථාන නොකළ සිහියෙන්, සංවර නොවූ ඉන්ද්‍රියයන්ගෙන් යුක්තව, ඒ ගම හෝ නියම්ගම හෝ පිණ්ඩපාතය පිණිස පිවිසේ. හෙතෙම එහිදී මනාව නොහැඳි හෝ මනාව නොපැළඳි හෝ ස්ත්‍රියක් දකී. මනාව නොහැඳි හෝ මනාව නොපැළඳි හෝ ඒ ස්ත්‍රිය දැකීමෙන් රාගය සිත පෙළයි. හෙතෙම රාගයෙන් පෙළුණු සිතින් කයින් ද දැවේ, සිතින් ද දැවේ. ඔහුට මෙසේ සිතේ: ‘කෙසේ හෝ මම ආරාමයට ගොස් භික්ෂූන්ට දැන්විය යුතු ය: ආයුෂ්මතුනි, මම රාගයෙන් වෙළී සිටිමි, රාගයට යටවී සිටිමි. මට බ්‍රහ්මචාරී ජීවිතය පවත්වාගෙන යාමට නොහැකි ය. සිල් දුබල බව ප්‍රකාශ කොට, ශික්ෂාව අත්හැර, හීන වූ ගිහි බවට හැරෙන්නෙමි.’ හෙතෙම ආරාමයට ගොස් භික්ෂූන්ට දන්වයි: ‘ආයුෂ්මතුනි, මම රාගයෙන් වෙළී සිටිමි, රාගයට යටවී සිටිමි. මට බ්‍රහ්මචාරී ජීවිතය පවත්වාගෙන යාමට නොහැකි ය. සිල් දුබල බව ප්‍රකාශ කොට, ශික්ෂාව අත්හැර, හීන වූ ගිහි බවට හැරෙන්නෙමි.’\n\nඔහුගේ සබ්‍රහ්මචාරීහු ඔහුට අවවාද කරති, අනුශාසනා කරති: ‘ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ විසින් කාමයන් ස්වල්ප රස ඇති, බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් ඇටසැකිල්ලකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් මස් කැබැල්ලකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් තණ පහනකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් අඟුරු ගොඩකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් සිහිනයකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් ඉල්ලීමකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් ගස් ඵලයකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් මස් කපන තලයකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් හෙල්ලයකට හෝ උලකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. කාමයන් සර්ප හිසකට උපමා කොට වදාළ සේක. බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති ඒවා යැයි ද, එහි ආදීනවය වැඩි යැයි ද වදාළ සේක. ආයුෂ්මත් ඔබ බ්‍රහ්මචාරී ජීවිතයෙහි ඇලී සිටින්න; සිල් දුබල බව ප්‍රකාශ කොට, ශික්ෂාව අත්හැර, හීන වූ ගිහි බවට නොහැරෙන්න.’\n\nහෙතෙම සබ්‍රහ්මචාරීන් විසින් මෙසේ අවවාද කරනු ලබද්දී, මෙසේ අනුශාසනා කරනු ලබද්දී මෙසේ කීය: ‘ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ විසින් කාමයන් ස්වල්ප රස ඇති, බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති, එහි ආදීනවය වැඩි ඒවා යැයි වදාළේ වුවද, එසේ වුවත් මට බ්‍රහ්මචාරී ජීවිතය පවත්වාගෙන යාමට නොහැකි ය. සිල් දුබල බව ප්‍රකාශ කොට, ශික්ෂාව අත්හැර, හීන වූ ගිහි බවට හැරෙන්නෙමි.’ හෙතෙම සිල් දුබල බව ප්‍රකාශ කොට, ශික්ෂාව අත්හැර, හීන වූ ගිහි බවට හැරේ.\n\nමහණෙනි, යම්සේ යෝධයෙක් කඩු හා පලිහ ගෙන, ඊතල සහිත දුන්න සකසාගෙන, යුද පෙරමුණට බසී ද, හෙතෙම ඒ සංග්‍රාමයේදී උත්සාහ කරයි, වෑයම් කරයි. එසේ උත්සාහ කරන්නා වූ, වෑයම් කරන්නා වූ ඔහුට සතුරෝ පහර දෙති. ඔහුව ඉවත් කරති. ඉවත් කොට ඥාතීන් වෙත ගෙන යති. ඔහුගේ ඥාතීහු ඔහුට උපස්ථාන කරති, සත්කාර කරති. හෙතෙම ඥාතීන් විසින් උපස්ථාන කරනු ලබද්දී, සත්කාර කරනු ලබද්දී ඒ ආබාධයෙන්ම මරණයට පත්වේ. මහණෙනි, මේ පුද්ගලයා ඒ උපමාවට සමාන යැයි මම කියමි. මහණෙනි, මෙබඳු පුද්ගලයෙක් ද මෙහි ඇත. මහණෙනි, භික්ෂූන් අතර සිටින, පවතින මේ තුන්වෙනි යෝධයා වැනි පුද්ගලයා යි.\n\nමහණෙනි, තවද යම් භික්ෂුවක් කිසියම් ගමක් හෝ නියම්ගමක් හෝ ඇසුරු කොට වාසය කරයි. හෙතෙම පෙරවරුවේ හැඳ පොරවා පාත්‍ර සිවුරු ගෙන, අරක්ෂිත වූ කයින්, අරක්ෂිත වූ වචනයෙන්, අරක්ෂිත වූ සිතින්, උපස්ථාන නොකළ සිහියෙන්, සංවර නොවූ ඉන්ද්‍රියයන්ගෙන් යුක්තව, ඒ ගම හෝ නියම්ගම හෝ පිණ්ඩපාතය පිණිස පිවිසේ. හෙතෙම එහිදී මනාව නොහැඳි හෝ මනාව නොපැළඳි හෝ ස්ත්‍රියක් දකී. මනාව නොහැඳි හෝ මනාව නොපැළඳි හෝ ඒ ස්ත්‍රිය දැකීමෙන් රාගය සිත පෙළයි. හෙතෙම රාගයෙන් පෙළුණු සිතින් කයින් ද දැවේ, සිතින් ද දැවේ.\n\nඔහුට මෙසේ සිතේ: ‘කෙසේ හෝ මම ආරාමයට ගොස් භික්ෂූන්ට මෙසේ කියන්නෙමි – ඇවැත්නි, මම රාගයෙන් පෙලී සිටිමි. රාගයෙන් යටපත් වී සිටිමි. මට බ්‍රහ්මචර්යාව පවත්වාගෙන යාමට නොහැක. මම මාගේ ශික්ෂාවෙහි දුර්වලකම ප්‍රකාශ කොට ශික්ෂාව ප්‍රතික්ෂේප කර හීන තත්ත්වයකට හැරී යන්නෙමි’ කියා. ඔහු ආරාමයට ගොස් භික්ෂූන්ට මෙසේ කියයි: ‘ඇවැත්නි, මම රාගයෙන් පෙලී සිටිමි. රාගයෙන් යටපත් වී සිටිමි. මට බ්‍රහ්මචර්යාව පවත්වාගෙන යාමට නොහැක. මම මාගේ ශික්ෂාවෙහි දුර්වලකම ප්‍රකාශ කොට ශික්ෂාව ප්‍රතික්ෂේප කර හීන තත්ත්වයකට හැරී යන්නෙමි’ කියා.\n\nඑවිට ඔහුගේ සබ්‍රහ්මචාරීහු ඔහුට අවවාද කරති, අනුශාසනා කරති: ‘ඇවැත්නි, කාමයන් ඇල්මෙන් ස්වල්ප රසයක් ඇති, බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. ඇටසැකිල්ලක් බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. මස්‌පිඬක්‌ බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. තණගිනිසිළක්‌ බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. අඟුරු වළක් බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. සිහිනයක් බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. ණයට ගත් දෙයක් බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. ගසක ඵලයක් බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. මස් මරන්නෙකුගේ කඩුවක් බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. හෙල්ලයක්‌ බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. සර්ප හිසක් බඳු කාමයන් බොහෝ දුක් ගෙන දෙන, බොහෝ වෙහෙස ඇති බව භාග්‍යවතුන් වහන්සේ දේශනා කර ඇත. එහි ආදීනවය ඉතා වැඩිය. ආයුෂ්මත් ඔබ බ්‍රහ්මචර්යාවෙහි ඇලී සිටින්න. ආයුෂ්මත් ඔබ ශික්ෂාවෙහි දුර්වලකම ප්‍රකාශ කොට ශික්ෂාව ප්‍රතික්ෂේප කර හීන තත්ත්වයකට හැරී නොයන්නැයි’ කියාය.\n\n‘ඇවැත්නි, මම වීර්ය කරන්නෙමි. ඇවැත්නි, මම උත්සාහ කරන්නෙමි. ඇවැත්නි, මම ඇලී සිටින්නෙමි! ඇවැත්නි, මම දැන් ශික්ෂාවෙහි දුර්වලකම ප්‍රකාශ කොට ශික්ෂාව ප්‍රතික්ෂේප කර හීන තත්ත්වයකට හැරී නොයන්නෙමි’ කියාය.\n\nමහණෙනි, යම් සේ එක් රණශූරයෙක් අසිපතක්ද පලිහක්ද ගෙන, දුන්නක්ද ඊතල කට්ටක්ද සූදානම් කර, සංවිධානය කරන ලද යුද්ධයට පිවිසෙයිද, හෙතෙම ඒ යුද්ධයෙහි උත්සාහ කරයි, වීර්ය කරයි. එසේ උත්සාහ කරමින්, වීර්ය කරමින් සිටින ඔහුට සතුරෝ පහර දෙති. ඔහුව පලවා හරිති. පලවා හැර ඥාතීන් වෙත ගෙන යති. ඥාතීහු ඔහුට උපස්ථාන කරති, සත්කාර කරති. හෙතෙම ඥාතීන් විසින් උපස්ථාන කරනු ලබමින්, සත්කාර කරනු ලබමින්, ඒ ආබාධයෙන් සුවපත් වෙයි. මහණෙනි, මම මේ පුද්ගලයා ඒ උපමාවෙන් කියමි. මහණෙනි, මෙබඳු එක්තරා පුද්ගලයෙක් මෙහි සිටී. මහණෙනි, භික්ෂූන් අතර සිටින, දක්නට ලැබෙන සතරවැනි රණශූරයාට උපමා කළ පුද්ගලයා මේ වේ.\n\nමහණෙනි, නැවතත් එක් භික්ෂුවක් කිසියම් ගමක් හෝ නියම්ගමක් හෝ අරභයා වැඩසිටියි. හෙතෙම පෙරවරුවේ හැඳ සිවුරු පොරවා පාත්‍රයද සිවුරද ගෙන, ඒ ගමට හෝ නියම්ගමට හෝ පිඬුසිඟා වඩියි. ආරක්ෂා කරන ලද කයින් යුක්තව, ආරක්ෂා කරන ලද වචනයෙන් යුක්තව, ආරක්ෂා කරන ලද සිතින් යුක්තව, පිහිටුවාගත් සිහියෙන් යුක්තව, සංවර කරන ලද ඉන්ද්‍රියයන්ගෙන් යුක්තව යි. හෙතෙම ඇසින් රූපයක් දැක, නිමිති ග්‍රහණය නොකරයි, අනුබ්‍යංජන ග්‍රහණය නොකරයි. යම් හෙයකින් ඔහුගේ චක්ෂුරින්ද්‍රිය අසංවරව වාසය කිරීමෙන්, අභිධ්‍යා සහ දෝමනස්සය වැනි පාපී අකුසල ධර්මයන් ඔහු තුළට කා වැදෙයිද, ඔහු ඒවා සංවර කිරීම සඳහා පිළිපදියි. චක්ෂුරින්ද්‍රිය ආරක්ෂා කරයි. චක්ෂුරින්ද්‍රියෙහි සංවරය ඇති කරගනියි. කනින් ශබ්දයක් අසා... නාසයෙන් ගඳක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් ස්පර්ශයක් දැන... මනසින් ධර්මයක් දැන, නිමිති ග්‍රහණය නොකරයි, අනුබ්‍යංජන ග්‍රහණය නොකරයි. යම් හෙයකින් ඔහුගේ මනින්ද්‍රිය අසංවරව වාසය කිරීමෙන්, අභිධ්‍යා සහ දෝමනස්සය වැනි පාපී අකුසල ධර්මයන් ඔහු තුළට කා වැදෙයිද, ඔහු ඒවා සංවර කිරීම සඳහා පිළිපදියි. මනින්ද්‍රිය ආරක්ෂා කරයි. මනින්ද්‍රියෙහි සංවරය ඇති කරගනියි. හෙතෙම දහවල් ආහාරයෙන් පසු පිණ්ඩපාතයෙන් ආපසු පැමිණ, හුදෙකලා සේනාසනයක් වන අරණ්‍යයක් හෝ වෘක්ෂ මූලයක් හෝ පර්වතයක් හෝ කඳුකරයක් හෝ ගිරිගුහාවක් හෝ සුසානයක් හෝ වනප්‍රස්ථයක් හෝ එළිමහනක් හෝ පිදුරු ගොඩක් හෝ සෙවණ කොට වාසය කරයි. හෙතෙම අරණ්‍යයකට ගොස් හෝ වෘක්ෂ මූලයකට ගොස් හෝ ශුන්‍යාගාරයකට ගොස් හෝ පලක් බැඳ, කය ඍජුව තබා, සිහිය ඉදිරියෙහි පිහිටුවාගෙන හිඳගනියි. හෙතෙම ලෝකය කෙරෙහි ඇති අභිධ්‍යාව දුරු කර... මෙසේ මේ පංච නීවරණයන් ප්‍රහීණ කර, ප්‍රඥාව දුර්වල කරන සිතේ උපක්ලේශයන් දුරු කොට, කාමයන්ගෙන් වෙන්ව... සිව්වන ධ්‍යානයට එළඹ වාසය කරයි.\n\nඔහුගේ සිත මෙසේ සමාධිගත වූ විට, පිරිසිදු වූ විට, පැහැදිලි වූ විට, කෙලෙස් රහිත වූ විට, උපක්ලේශයන්ගෙන් වෙන් වූ විට, මෘදු වූ විට, කර්මණ්‍ය වූ විට, ස්ථිර වූ විට, කම්පා නොවන බවට පත් වූ විට, ආශ්‍රවයන් ක්ෂය කිරීමේ ඥානය සඳහා සිත යොමු කරයි. හෙතෙම ‘මේ දුක යැ’යි යථාභූතව ප්‍රඥාවෙන් දනියි... නැවත මෙබඳු භවයක් නොමැති බවද ප්‍රඥාවෙන් දනියි.\n\nමහණෙනි, යම් සේ එක් රණශූරයෙක් අසිපතක්ද පලිහක්ද ගෙන, දුන්නක්ද ඊතල කට්ටක්ද සූදානම් කර, සංවිධානය කරන ලද යුද්ධයට පිවිසෙයිද, හෙතෙම ඒ යුද්ධය සම්පූර්ණයෙන් ජයගෙන, ජයගත් යුද්ධයෙන් යුක්තව, ඒ යුද්ධ භූමියෙහිම වාසය කරයිද; මහණෙනි, මම මේ පුද්ගලයා ඒ උපමාවෙන් කියමි. මහණෙනි, මෙබඳු එක්තරා පුද්ගලයෙක් මෙහි සිටී. මහණෙනි, භික්ෂූන් අතර සිටින, දක්නට ලැබෙන පස්වන රණශූරයාට උපමා කළ පුද්ගලයා මේ වේ. මහණෙනි, භික්ෂූන් අතර සිටින, දක්නට ලැබෙන, මේ පස් දෙනා රණශූරයාට උපමා කළ පුද්ගලයෝ වෙති’යි.",
      "paliTitle": "Dutiyayodhājīvasuttaṃ",
      "englishTitle": "Second Sutta on the Warrior",
      "sinhalaTitle": "දුතිය යෝධාජීව සූත්‍රය"
    },
    {
      "number": 77,
      "pali": "‘‘Pañcimāni, bhikkhave, anāgatabhayāni sampassamānena alameva āraññikena [āraññakena (sabbattha a. ni. 5.181; pari. 443)] bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Katamāni pañca? Idha, bhikkhave, āraññiko bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho etarahi ekako araññe viharāmi. Ekakaṃ kho pana maṃ [ekakaṃ kho pana (syā. kaṃ.)] araññe viharantaṃ ahi vā maṃ ḍaṃseyya, vicchiko [vicchikā (syā.)] vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya, tena me assa kālaṅkiriyā, so mamassa antarāyo; handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. Idaṃ, bhikkhave, paṭhamaṃ anāgatabhayaṃ sampassamānena alameva āraññikena bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, āraññiko bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho etarahi ekako araññe viharāmi. Ekako kho panāhaṃ araññe viharanto upakkhalitvā vā papateyyaṃ, bhattaṃ vā bhuttaṃ me byāpajjeyya, pittaṃ vā me kuppeyya, semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ, tena me assa kālaṅkiriyā, so mamassa antarāyo; handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. Idaṃ, bhikkhave, dutiyaṃ anāgatabhayaṃ sampassamānena alameva āraññikena bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, āraññiko bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho etarahi ekako araññe viharāmi. Ekako kho panāhaṃ araññe viharanto vāḷehi samāgaccheyyaṃ, sīhena vā byagghena vā dīpinā vā acchena vā taracchena vā, te maṃ jīvitā voropeyyuṃ, tena me assa kālaṅkiriyā, so mamassa antarāyo; handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. Idaṃ, bhikkhave, tatiyaṃ anāgatabhayaṃ sampassamānena alameva āraññikena bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, āraññiko bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho etarahi ekako araññe viharāmi. Ekako kho panāhaṃ araññe viharanto māṇavehi samāgaccheyyaṃ katakammehi vā akatakammehi vā, te maṃ jīvitā voropeyyuṃ, tena me assa kālaṅkiriyā, so mamassa antarāyo; handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. Idaṃ, bhikkhave, catutthaṃ anāgatabhayaṃ sampassamānena alameva āraññikena bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, āraññiko bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho etarahi ekako araññe viharāmi. Santi kho panāraññe vāḷā amanussā, te maṃ jīvitā voropeyyuṃ, tena me assa kālaṅkiriyā, so mamassa antarāyo; handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’ti. Idaṃ, bhikkhave, pañcamaṃ anāgatabhayaṃ sampassamānena alameva āraññikena bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Imāni kho, bhikkhave, pañca anāgatabhayāni sampassamānena alameva āraññikena bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’’ti. Sattamaṃ.",
      "english": "Bhikkhus, it is fitting for a forest-dwelling monk, reflecting upon these five future dangers, to dwell diligently, ardently, and with resolute mind for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.\n\nWhich five? Here, bhikkhus, a forest-dwelling monk reflects thus: ‘Indeed, I am presently dwelling alone in the wilderness. While I am dwelling alone in the wilderness, a snake might bite me, or a scorpion might sting me, or a centipede might bite me. Due to that, there might be my death, and that would be an obstacle for me. Therefore, I shall arouse energy for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.’ This, bhikkhus, is the first future danger, reflecting upon which it is fitting for a forest-dwelling monk to dwell diligently, ardently, and with resolute mind for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.\n\nFurthermore, bhikkhus, a forest-dwelling monk reflects thus: ‘Indeed, I am presently dwelling alone in the wilderness. While I am dwelling alone in the wilderness, I might stumble and fall, or the food I have eaten might disagree with me, or my bile might become agitated, or my phlegm might become agitated, or my internal humors might become agitated. Due to that, there might be my death, and that would be an obstacle for me. Therefore, I shall arouse energy for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.’ This, bhikkhus, is the second future danger, reflecting upon which it is fitting for a forest-dwelling monk to dwell diligently, ardently, and with resolute mind for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.\n\nFurthermore, bhikkhus, a forest-dwelling monk reflects thus: ‘Indeed, I am presently dwelling alone in the wilderness. While I am dwelling alone in the wilderness, I might encounter wild animals—a lion, or a tiger, or a leopard, or a bear, or a hyena. They might take my life. Due to that, there might be my death, and that would be an obstacle for me. Therefore, I shall arouse energy for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.’ This, bhikkhus, is the third future danger, reflecting upon which it is fitting for a forest-dwelling monk to dwell diligently, ardently, and with resolute mind for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.\n\nFurthermore, bhikkhus, a forest-dwelling monk reflects thus: ‘Indeed, I am presently dwelling alone in the wilderness. While I am dwelling alone in the wilderness, I might encounter young men, whether they be criminals or not. They might take my life. Due to that, there might be my death, and that would be an obstacle for me. Therefore, I shall arouse energy for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.’ This, bhikkhus, is the fourth future danger, reflecting upon which it is fitting for a forest-dwelling monk to dwell diligently, ardently, and with resolute mind for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.\n\nFurthermore, bhikkhus, a forest-dwelling monk reflects thus: ‘Indeed, I am presently dwelling alone in the wilderness. And indeed, in the wilderness there are wild non-human beings. They might take my life. Due to that, there might be my death, and that would be an obstacle for me. Therefore, I shall arouse energy for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.’ This, bhikkhus, is the fifth future danger, reflecting upon which it is fitting for a forest-dwelling monk to dwell diligently, ardently, and with resolute mind for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.\n\nThese, bhikkhus, are the five future dangers, reflecting upon which it is fitting for a forest-dwelling monk to dwell diligently, ardently, and with resolute mind for the attainment of the as-yet-unattained, for the realization of the as-yet-unrealized, and for the direct experience of the as-yet-unexperienced.",
      "sinhala": "මහණෙනි, මේ අනාගත භයවල් පහක් මෙනෙහි කරන්නාවූ ආරණ්‍යක භික්ෂුව විසින් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, සිත (නිවන් මගට) යොමුකොට වාසය කිරීම මැනවි, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත්. ඒ පස කුමන ඒවාද?\n\nමහණෙනි, මෙහිලා ආරණ්‍යක භික්ෂුව මෙසේ සිත් කරයි: ‘මම දැන් තනිව වනගතව වාසය කරමි. වනගතව තනිව වසන මා සර්පයෙක් හෝ දෂ්ට කරනු ඇත, ගෝනුස්සෙක් හෝ දෂ්ට කරනු ඇත, පත්තෑයෙක් හෝ දෂ්ට කරනු ඇත. එවිට මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායකි. එබැවින්, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත් මම වීර්යය අරඹමි.’ මහණෙනි, මේ පළමුවන අනාගත භය මෙනෙහි කරන්නාවූ ආරණ්‍යක භික්ෂුව විසින් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, සිත (නිවන් මගට) යොමුකොට වාසය කිරීම මැනවි, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත්.\n\nමහණෙනි, තවද ආරණ්‍යක භික්ෂුව මෙසේ සිත් කරයි: ‘මම දැන් තනිව වනගතව වාසය කරමි. වනගතව තනිව වසන මා ලිස්සා වැටෙන්නට හෝ පුළුවන, අනුභව කළ භෝජනය නරක් වන්නට හෝ පුළුවන, පිත් සෙම් වාත දෝෂ කුපිත වන්නට හෝ පුළුවන. එවිට මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායකි. එබැවින්, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත් මම වීර්යය අරඹමි.’ මහණෙනි, මේ දෙවන අනාගත භය මෙනෙහි කරන්නාවූ ආරණ්‍යක භික්ෂුව විසින් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, සිත (නිවන් මගට) යොමුකොට වාසය කිරීම මැනවි, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත්.\n\nමහණෙනි, තවද ආරණ්‍යක භික්ෂුව මෙසේ සිත් කරයි: ‘මම දැන් තනිව වනගතව වාසය කරමි. වනගතව තනිව වසන මා දරුණු සතුන් සමඟ හමු වන්නට පුළුවන, සිංහයෙකු හෝ ව්‍යාඝ්‍රයෙකු හෝ දිවියෙකු හෝ වලසෙකු හෝ හිවලෙකු හෝ. ඔවුහු මාගේ ජීවිතය නැති කරන්නට පුළුවන. එවිට මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායකි. එබැවින්, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත් මම වීර්යය අරඹමි.’ මහණෙනි, මේ තුන්වන අනාගත භය මෙනෙහි කරන්නාවූ ආරණ්‍යක භික්ෂුව විසින් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, සිත (නිවන් මගට) යොමුකොට වාසය කිරීම මැනවි, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත්.\n\nමහණෙනි, තවද ආරණ්‍යක භික්ෂුව මෙසේ සිත් කරයි: ‘මම දැන් තනිව වනගතව වාසය කරමි. වනගතව තනිව වසන මා අපරාධ කළ හෝ නොකළ හෝ මිනිසුන් සමඟ හමු වන්නට පුළුවන. ඔවුහු මාගේ ජීවිතය නැති කරන්නට පුළුවන. එවිට මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායකි. එබැවින්, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත් මම වීර්යය අරඹමි.’ මහණෙනි, මේ සිව්වන අනාගත භය මෙනෙහි කරන්නාවූ ආරණ්‍යක භික්ෂුව විසින් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, සිත (නිවන් මගට) යොමුකොට වාසය කිරීම මැනවි, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත්.\n\nමහණෙනි, තවද ආරණ්‍යක භික්ෂුව මෙසේ සිත් කරයි: ‘මම දැන් තනිව වනගතව වාසය කරමි. වනගතව දරුණු අමනුෂ්‍යයෝ ද සිටිති. ඔවුහු මාගේ ජීවිතය නැති කරන්නට පුළුවන. එවිට මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායකි. එබැවින්, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත් මම වීර්යය අරඹමි.’ මහණෙනි, මේ පස්වන අනාගත භය මෙනෙහි කරන්නාවූ ආරණ්‍යක භික්ෂුව විසින් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, සිත (නිවන් මගට) යොමුකොට වාසය කිරීම මැනවි, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත්.\n\nමහණෙනි, මේ පස් ආකාර අනාගත භයයන් මෙනෙහි කරන්නාවූ ආරණ්‍යක භික්ෂුව විසින් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, සිත (නිවන් මගට) යොමුකොට වාසය කිරීම මැනවි, නොලැබූ අර්හත්වය ලැබීම පිණිසත්, අවබෝධ නොකළ මාර්ගඵල අවබෝධ කරගැනීම පිණිසත්, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කරගැනීම පිණිසත්.",
      "paliTitle": "Paṭhamaanāgatabhayasuttaṃ",
      "englishTitle": "The First Discourse on Future Perils",
      "sinhalaTitle": "පළමු අනාගතභය සූත්‍රය"
    },
    {
      "number": 78,
      "pali": "‘‘Pañcimāni, bhikkhave, anāgatabhayāni sampassamānena alameva bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Katamāni pañca? Idha, bhikkhave, bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho etarahi daharo yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā. Hoti kho pana so samayo yaṃ imaṃ kāyaṃ jarā phusati. Jiṇṇena kho pana jarāya abhibhūtena na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ, na sukarāni araññavanapatthāni pantāni senāsanāni paṭisevituṃ. Purā maṃ so dhammo āgacchati aniṭṭho akanto amanāpo; handāhaṃ paṭikacceva [paṭigacceva (sī.)] vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, yenāhaṃ dhammena samannāgato jiṇṇakopi phāsuṃ [phāsu (pī. ka.)] viharissāmī’ti. Idaṃ, bhikkhave, paṭhamaṃ anāgatabhayaṃ sampassamānena alameva bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho etarahi appābādho appātaṅko samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya. Hoti kho pana so samayo yaṃ imaṃ kāyaṃ byādhi phusati. Byādhitena kho pana byādhinā abhibhūtena [byādhābhibhūtena (sī. pī. ka.)] na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ, na sukarāni araññavanapatthāni pantāni senāsanāni paṭisevituṃ. Purā maṃ so dhammo āgacchati aniṭṭho akanto amanāpo; handāhaṃ paṭikacceva vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, yenāhaṃ dhammena samannāgato byādhitopi phāsuṃ viharissāmī’ti. Idaṃ, bhikkhave, dutiyaṃ anāgatabhayaṃ sampassamānena alameva bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, bhikkhu iti paṭisañcikkhati – ‘etarahi kho subhikkhaṃ susassaṃ sulabhapiṇḍaṃ, sukaraṃ uñchena paggahena yāpetuṃ. Hoti kho pana so samayo yaṃ dubbhikkhaṃ hoti dussassaṃ dullabhapiṇḍaṃ, na sukaraṃ uñchena paggahena yāpetuṃ. Dubbhikkhe kho pana manussā yena subhikkhaṃ tena saṅkamanti [tenupasaṅkamanti (ka.)]. Tattha saṅgaṇikavihāro hoti ākiṇṇavihāro. Saṅgaṇikavihāre kho pana sati ākiṇṇavihāre na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ, na sukarāni araññavanapatthāni pantāni senāsanāni paṭisevituṃ. Purā maṃ so dhammo āgacchati aniṭṭho akanto amanāpo; handāhaṃ paṭikacceva vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, yenāhaṃ dhammena samannāgato dubbhikkhepi phāsu viharissāmī’ti. Idaṃ, bhikkhave, tatiyaṃ anāgatabhayaṃ sampassamānena alameva bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, bhikkhu iti paṭisañcikkhati – ‘etarahi kho manussā samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti. Hoti kho pana so samayo yaṃ bhayaṃ hoti aṭavisaṅkopo, cakkasamārūḷhā jānapadā pariyāyanti. Bhaye kho pana sati manussā yena khemaṃ tena saṅkamanti. Tattha saṅgaṇikavihāro hoti ākiṇṇavihāro. Saṅgaṇikavihāre kho pana sati ākiṇṇavihāre na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ, na sukarāni araññavanapatthāni pantāni senāsanāni paṭisevituṃ. Purā maṃ so dhammo āgacchati aniṭṭho akanto amanāpo; handāhaṃ paṭikacceva vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, yenāhaṃ dhammena samannāgato bhayepi phāsuṃ viharissāmī’ti. Idaṃ, bhikkhave, catutthaṃ anāgatabhayaṃ sampassamānena alameva bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Puna caparaṃ, bhikkhave, bhikkhu iti paṭisañcikkhati – ‘etarahi kho saṅgho samaggo sammodamāno avivadamāno ekuddeso phāsu viharati. Hoti kho pana so samayo yaṃ saṅgho bhijjati. Saṅghe kho pana bhinne na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ, na sukarāni araññavanapatthāni pantāni senāsanāni paṭisevituṃ. Purā maṃ so dhammo āgacchati aniṭṭho akanto amanāpo; handāhaṃ paṭikacceva vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, yenāhaṃ dhammena samannāgato bhinnepi saṅghe phāsuṃ viharissāmī’ti. Idaṃ, bhikkhave, pañcamaṃ anāgatabhayaṃ sampassamānena alameva bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. ‘‘Imāni kho, bhikkhave, pañca anāgatabhayāni sampassamānena alameva bhikkhunā appamattena ātāpinā pahitattena viharituṃ appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, seeing these five future dangers, it is enough for a monk to dwell diligently, ardently, and with resolute effort, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced. Which five?\n\nHere, monks, a monk reflects thus: ‘Indeed, I am presently young, in the prime of youth, with glossy black hair, endowed with the fortune of youth, in the first stage of life. But there comes a time when old age touches this body. Indeed, when old and overcome by old age, it is not easy to keep the Buddhas’ teaching in mind; it is not easy to resort to remote forest and wilderness dwellings. Before that unwelcome, disagreeable, and unpleasant state comes upon me, let me therefore apply myself to exertion right now, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced, so that, endowed with the Dhamma, I may dwell at ease even when old.’ This, monks, is the first future danger which, seeing clearly, it is enough for a monk to dwell diligently, ardently, and with resolute effort, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced.\n\nFurthermore, monks, a monk reflects thus: ‘Indeed, I am presently free from illness and affliction, endowed with a balanced digestion—not too cold, not too hot, but moderate, conducive to exertion. But there comes a time when illness touches this body. Indeed, when ill and overcome by sickness, it is not easy to keep the Buddhas’ teaching in mind; it is not easy to resort to remote forest and wilderness dwellings. Before that unwelcome, disagreeable, and unpleasant state comes upon me, let me therefore apply myself to exertion right now, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced, so that, endowed with the Dhamma, I may dwell at ease even when ill.’ This, monks, is the second future danger which, seeing clearly, it is enough for a monk to dwell diligently, ardently, and with resolute effort, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced.\n\nFurthermore, monks, a monk reflects thus: ‘Indeed, at present, food is abundant, the harvest is good, alms are easily obtained; it is easy to sustain oneself by gleaning and gathering. But there comes a time when there is a famine, the harvest is poor, alms are difficult to obtain, and it is not easy to sustain oneself by gleaning and gathering. Indeed, during a famine, people migrate to places where food is abundant. There, dwellings become crowded, places become congested. When dwellings are crowded and places are congested, it is not easy to keep the Buddhas’ teaching in mind; it is not easy to resort to remote forest and wilderness dwellings. Before that unwelcome, disagreeable, and unpleasant state comes upon me, let me therefore apply myself to exertion right now, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced, so that, endowed with the Dhamma, I may dwell at ease even during a famine.’ This, monks, is the third future danger which, seeing clearly, it is enough for a monk to dwell diligently, ardently, and with resolute effort, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced.\n\nFurthermore, monks, a monk reflects thus: ‘Indeed, at present, people live in harmony, in concord, without dispute, mingled like milk and water, regarding one another with kindly eyes. But there comes a time when there is danger, a disturbance in the wilderness, when people from the countryside travel around mounted on conveyances. Indeed, when there is danger, people migrate to places of safety. There, dwellings become crowded, places become congested. When dwellings are crowded and places are congested, it is not easy to keep the Buddhas’ teaching in mind; it is not easy to resort to remote forest and wilderness dwellings. Before that unwelcome, disagreeable, and unpleasant state comes upon me, let me therefore apply myself to exertion right now, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced, so that, endowed with the Dhamma, I may dwell at ease even during a time of danger.’ This, monks, is the fourth future danger which, seeing clearly, it is enough for a monk to dwell diligently, ardently, and with resolute effort, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced.\n\nFurthermore, monks, a monk reflects thus: ‘Indeed, at present, the Sangha is united, in concord, without dispute, having a common recitation, and dwells at ease. But there comes a time when the Sangha becomes divided.’\n\nWhen the Sangha is divided, it is not easy to internalize the teaching of the Buddhas, nor is it easy to resort to remote forest and wilderness dwellings. Before that undesirable, displeasing, and disagreeable state comes upon me, let me now exert effort, right from the outset, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced, so that by being endowed with that Dhamma, I will dwell at ease even when the Sangha is divided.\n\nSeeing this, O monastics, as the fifth future danger, it is sufficient for a monastic to dwell diligently, ardently, and resolutely, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced. \"Seeing these five future dangers, O monastics, it is sufficient for a monastic to dwell diligently, ardently, and resolutely, for the attainment of what has not yet been attained, for the realization of what has not yet been realized, and for the direct experience of what has not yet been directly experienced.\"",
      "sinhala": "භික්ෂූනි, මේ අනාගත භයයන් පහ මැනවින් විමසා බලමින්, භික්ෂුවක් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, ධර්ම මාර්ගයෙහි යොමු කළ සිත් ඇතිව, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස වාසය කිරීමට ප්‍රමාණවත් වේ. ඒ පහ කුමක්ද?\n\nභික්ෂූනි, මෙහිලා භික්ෂුවක් මෙසේ මෙනෙහි කරයි: ‘මම මේ වන විට තරුණ යෙමි, සුසිනිඳු කළු කෙස් ඇති, උතුම් යොවුන් වියෙන් යුක්ත, ජීවිතයේ පළමු අවධියේ සිටින්නෙමි. එහෙත්, මේ ශරීරයට දිරාපත් වීම ස්පර්ශ කරන කාලයක් ද පැමිණෙන්නේය. එසේ ජරාවෙන් මුසපත් වී, ජරාවෙන් අභිබවා ගිය විට, බුදුවරුන්ගේ ශාසනය සිතට ගැනීම පහසු නොවන්නේය. එසේම, දුරස්ථ වූ, වනගත වූ, පර්වතගත වූ සේනාසන සේවනය කිරීමද පහසු නොවන්නේය. එම අනිෂ්ට, අකමැති, අප්‍රසන්න ස්වභාවය මා වෙත පැමිණීමට පෙර, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස, මම දැන්ම වීර්යය අරඹන්නෙමි. යම් ධර්මයකින් යුක්තව, දිරාපත් වුවත් මට පහසුවෙන් වාසය කළ හැකි වේවා!’ භික්ෂූනි, මේ පළමු අනාගත භයයි. මෙය මැනවින් විමසා බලමින්, භික්ෂුවක් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, ධර්ම මාර්ගයෙහි යොමු කළ සිත් ඇතිව, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස වාසය කිරීමට ප්‍රමාණවත් වේ.\n\nතවද, භික්ෂූනි, භික්ෂුවක් මෙසේ මෙනෙහි කරයි: ‘මම මේ වන විට රෝගාබාධ රහිත යෙමි, ලෙඩ දුක් නැත්තෙමි, සමව දිරවන ආහාර ජීර්ණ පද්ධතියක් ඇති, අධික ශීතල හෝ අධික උණුසුම් නැති, මධ්‍යස්ථ වූ, වීර්යය කිරීමට සුදුසු ශරීරයකින් යුක්ත වෙමි. එහෙත්, මේ ශරීරයට රෝග ස්පර්ශ කරන කාලයක් ද පැමිණෙන්නේය. එසේ රෝගී වී, රෝගවලින් අභිබවා ගිය විට, බුදුවරුන්ගේ ශාසනය සිතට ගැනීම පහසු නොවන්නේය. එසේම, දුරස්ථ වූ, වනගත වූ, පර්වතගත වූ සේනාසන සේවනය කිරීමද පහසු නොවන්නේය. එම අනිෂ්ට, අකමැති, අප්‍රසන්න ස්වභාවය මා වෙත පැමිණීමට පෙර, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස, මම දැන්ම වීර්යය අරඹන්නෙමි. යම් ධර්මයකින් යුක්තව, රෝගී වුවත් මට පහසුවෙන් වාසය කළ හැකි වේවා!’ භික්ෂූනි, මේ දෙවැනි අනාගත භයයි. මෙය මැනවින් විමසා බලමින්, භික්ෂුවක් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, ධර්ම මාර්ගයෙහි යොමු කළ සිත් ඇතිව, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස වාසය කිරීමට ප්‍රමාණවත් වේ.\n\nතවද, භික්ෂූනි, භික්ෂුවක් මෙසේ මෙනෙහි කරයි: ‘මේ වන විට සශ්‍රීක කාලයකි, හොඳින් සරු වූ අස්වනු ඇත, පිණ්ඩපාතය පහසුවෙන් ලැබෙන කාලයකි, උන්ඡා වෘත්තියෙන් සහ පග්‍රහ වෘත්තියෙන් ජීවත් වීම පහසුය. එහෙත්, දුර්භික්ෂ කාලයක්, නරක අස්වැන්නක් ඇති, පිණ්ඩපාතය දුර්ලභ වන, උන්ඡා වෘත්තියෙන් සහ පග්‍රහ වෘත්තියෙන් ජීවත් වීම පහසු නොවන කාලයක් ද පැමිණෙන්නේය. දුර්භික්ෂ කාලයකදී මිනිසුන් සශ්‍රීක ප්‍රදේශ කරා සංක්‍රමණය වෙති. එහිදී සමූහ වශයෙන් වාසය කිරීමක්, කලබලකාරී පරිසරයක් ඇති වේ. සමූහ වශයෙන් වාසය කරන විට, කලබලකාරී පරිසරයක් ඇති විට, බුදුවරුන්ගේ ශාසනය සිතට ගැනීම පහසු නොවන්නේය. එසේම, දුරස්ථ වූ, වනගත වූ, පර්වතගත වූ සේනාසන සේවනය කිරීමද පහසු නොවන්නේය. එම අනිෂ්ට, අකමැති, අප්‍රසන්න ස්වභාවය මා වෙත පැමිණීමට පෙර, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස, මම දැන්ම වීර්යය අරඹන්නෙමි. යම් ධර්මයකින් යුක්තව, දුර්භික්ෂ කාලයකදී වුවත් මට පහසුවෙන් වාසය කළ හැකි වේවා!’ භික්ෂූනි, මේ තෙවැනි අනාගත භයයි. මෙය මැනවින් විමසා බලමින්, භික්ෂුවක් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, ධර්ම මාර්ගයෙහි යොමු කළ සිත් ඇතිව, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස වාසය කිරීමට ප්‍රමාණවත් වේ.\n\nතවද, භික්ෂූනි, භික්ෂුවක් මෙසේ මෙනෙහි කරයි: ‘මේ වන විට මිනිසුන් සමගිව, සතුටින්, විවාද නොකරමින්, කිරිය සහ දිය එකතු වූවාක් මෙන්, එකිනෙකාට ප්‍රිය ඇසින් බලමින් වාසය කරති. එහෙත්, භය ඇති වන, වනගත ප්‍රදේශ කැලඹෙන, රථවලින් ගමන් කරන ජනපදවාසීන් හැසිරෙන කාලයක් ද පැමිණෙන්නේය. භය ඇති වූ විට මිනිසුන් ආරක්ෂිත තැන් කරා සංක්‍රමණය වෙති. එහිදී සමූහ වශයෙන් වාසය කිරීමක්, කලබලකාරී පරිසරයක් ඇති වේ. සමූහ වශයෙන් වාසය කරන විට, කලබලකාරී පරිසරයක් ඇති විට, බුදුවරුන්ගේ ශාසනය සිතට ගැනීම පහසු නොවන්නේය. එසේම, දුරස්ථ වූ, වනගත වූ, පර්වතගත වූ සේනාසන සේවනය කිරීමද පහසු නොවන්නේය. එම අනිෂ්ට, අකමැති, අප්‍රසන්න ස්වභාවය මා වෙත පැමිණීමට පෙර, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස, මම දැන්ම වීර්යය අරඹන්නෙමි. යම් ධර්මයකින් යුක්තව, භය ඇති වූ විට වුවත් මට පහසුවෙන් වාසය කළ හැකි වේවා!’ භික්ෂූනි, මේ සතරවැනි අනාගත භයයි. මෙය මැනවින් විමසා බලමින්, භික්ෂුවක් අප්‍රමාදීව, දැඩි උත්සාහයෙන්, ධර්ම මාර්ගයෙහි යොමු කළ සිත් ඇතිව, නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ නොකළ සත්‍ය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ නිර්වාණය සාක්ෂාත් කිරීම පිණිස වාසය කිරීමට ප්‍රමාණවත් වේ.\n\nතවද, භික්ෂූනි, භික්ෂුවක් මෙසේ මෙනෙහි කරයි: ‘මේ වන විට සංඝයා වහන්සේ සමගිව, සතුටින්, විවාද නොකරමින්, එක් අරමුණකින් යුතුව පහසුවෙන් වාසය කරති. එහෙත්, සංඝයා වහන්සේ භේද වන කාලයක් ද පැමිණෙන්නේය.\n\nභින්න වූ සංඝයා සිටින කල්හි බුදුවරුන්ගේ ශාසනය සිතට ගැනීම පහසු නැත. නිස්කලංක වූ අරණ්‍ය, වනාන්තර, පන්ති සේනාසන සේවනය කිරීමද පහසු නැත. මට අනිෂ්ට වූ, අකැමැති වූ, අමනාප වූ එම තත්ත්වය පැමිණීමට පෙර, එබැවින් මම නොලැබූ දේ ලැබීම සඳහා, අවබෝධ නොකළ දේ අවබෝධ කිරීම සඳහා, ප්‍[ZWJ]රත්‍[ZWJ]යක්ෂ නොකළ දේ ප්‍[ZWJ]රත්‍[ZWJ]යක්ෂ කිරීම සඳහා කලින්ම වීර්යය අරඹමි. යම් ධර්මයකින් මම යුක්ත වුවහොත්, භින්න වූ සංඝයා සිටියත් සැපසේ වාසය කරන්නෙමි’යි (සිතා). මහණෙනි, මේ පස්වන අනාගත භය මනාව දකිමින්, නොලැබූ දේ ලැබීම සඳහා, අවබෝධ නොකළ දේ අවබෝධ කිරීම සඳහා, ප්‍[ZWJ]රත්‍[ZWJ]යක්ෂ නොකළ දේ ප්‍[ZWJ]රත්‍[ZWJ]යක්ෂ කිරීම සඳහා අප්‍රමාදීව, වීර්යවත්ව, යොමු කරන ලද සිත් ඇතිව වාසය කිරීමට භික්ෂුව විසින් ප්‍රමාණවත්ය.\n\n‘‘මහණෙනි, මේ පස් අනාගත භය මනාව දකිමින්, නොලැබූ දේ ලැබීම සඳහා, අවබෝධ නොකළ දේ අවබෝධ කිරීම සඳහා, ප්‍[ZWJ]රත්‍[ZWJ]යක්ෂ නොකළ දේ ප්‍[ZWJ]රත්‍[ZWJ]යක්ෂ කිරීම සඳහා අප්‍රමාදීව, වීර්යවත්ව, යොමු කරන ලද සිත් ඇතිව වාසය කිරීමට භික්ෂුව විසින් ප්‍රමාණවත්ය.’’",
      "paliTitle": "Dutiyaanāgatabhayasuttaṃ",
      "englishTitle": "Second Sutta on Future Dangers",
      "sinhalaTitle": "දුතිය අනාගතභය සූත්‍රය"
    },
    {
      "number": 79,
      "pali": "‘‘Pañcimāni, bhikkhave, anāgatabhayāni etarahi asamuppannāni āyatiṃ samuppajjissanti. Tāni vo [kho (katthaci)] paṭibujjhitabbāni; paṭibujjhitvā ca tesaṃ pahānāya vāyamitabbaṃ. ‘‘Katamāni pañca? Bhavissanti, bhikkhave, bhikkhū anāgatamaddhānaṃ abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Te abhāvitakāyā samānā abhāvitasīlā abhāvitacittā abhāvitapaññā aññe upasampādessanti. Tepi [te (sī.)] na sakkhissanti vinetuṃ adhisīle adhicitte adhipaññāya. Tepi bhavissanti abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Te abhāvitakāyā samānā abhāvitasīlā abhāvitacittā abhāvitapaññā aññe upasampādessanti. Tepi [te (?)] na sakkhissanti vinetuṃ adhisīle adhicitte adhipaññāya. Tepi bhavissanti abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Iti kho, bhikkhave, dhammasandosā vinayasandoso; vinayasandosā dhammasandoso. Idaṃ, bhikkhave, paṭhamaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Te abhāvitakāyā samānā abhāvitasīlā abhāvitacittā abhāvitapaññā aññesaṃ nissayaṃ dassanti. Tepi na sakkhissanti vinetuṃ adhisīle adhicitte adhipaññāya. Tepi bhavissanti abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Te abhāvitakāyā samānā abhāvitasīlā abhāvitacittā abhāvitapaññā aññesaṃ nissayaṃ dassanti. Tepi na sakkhissanti vinetuṃ adhisīle adhicitte adhipaññāya. Tepi bhavissanti abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Iti kho, bhikkhave, dhammasandosā vinayasandoso; vinayasandosā dhammasandoso. Idaṃ, bhikkhave, dutiyaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Te abhāvitakāyā samānā abhāvitasīlā abhāvitacittā abhāvitapaññā abhidhammakathaṃ vedallakathaṃ kathentā kaṇhadhammaṃ okkamamānā na bujjhissanti. Iti kho, bhikkhave, dhammasandosā vinayasandoso; vinayasandosā dhammasandoso. Idaṃ, bhikkhave, tatiyaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Te abhāvitakāyā samānā abhāvitasīlā abhāvitacittā abhāvitapaññā ye te suttantā tathāgatabhāsitā gambhīrā gambhīratthā lokuttarā suññatāppaṭisaṃyuttā, tesu bhaññamānesu na sussūsissanti, na sotaṃ odahissanti, na aññā cittaṃ upaṭṭhapessanti, na ca te dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññissanti. Ye pana te suttantā kavitā [kavikatā (sī. syā. kaṃ. pī., saṃ. ni. 2.229) ṭīkā oloketabbā] kāveyyā cittakkharā cittabyañjanā bāhirakā sāvakabhāsitā, tesu bhaññamānesu sussūsissanti, sotaṃ odahissanti, aññā cittaṃ upaṭṭhapessanti, te ca dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññissanti. Iti kho, bhikkhave, dhammasandosā vinayasandoso; vinayasandosā dhammasandoso. Idaṃ, bhikkhave, catutthaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā. Te abhāvitakāyā samānā abhāvitasīlā abhāvitacittā abhāvitapaññā therā bhikkhū bāhulikā [bāhullikā (syā. kaṃ.) a. ni. 2.49; 3.96] bhavissanti sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā, na vīriyaṃ ārabhissanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjissati. Sāpi bhavissati bāhulikā sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā, na vīriyaṃ ārabhissati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Iti kho, bhikkhave, dhammasandosā vinayasandoso; vinayasandosā dhammasandoso. Idaṃ, bhikkhave, pañcamaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Imāni kho, bhikkhave, pañca anāgatabhayāni etarahi asamuppannāni āyatiṃ samuppajjissanti. Tāni vo paṭibujjhitabbāni; paṭibujjhitvā ca tesaṃ pahānāya vāyamitabba’’nti. Navamaṃ.",
      "english": "Monks, there are these five future dangers, which are not present now, but will arise in the future. You should become aware of them; and having become aware, you should strive for their abandonment. What five? Monks, in the future, there will be monks who are undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Being undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom, they will confer higher ordination upon others. And these others, in turn, will be unable to train in higher virtue, higher mind, and higher wisdom. These others, too, will be undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Being undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom, they will confer higher ordination upon still others. And these still others, in turn, will be unable to train in higher virtue, higher mind, and higher wisdom. These still others, too, will be undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Thus, monks, from the corruption of the Dhamma comes the corruption of the Vinaya; and from the corruption of the Vinaya comes the corruption of the Dhamma. This, monks, is the first future danger, which is not present now, but will arise in the future. You should become aware of it; and having become aware, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who are undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Being undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom, they will give patronage to others. And these others, in turn, will be unable to train in higher virtue, higher mind, and higher wisdom. These others, too, will be undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Being undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom, they will give patronage to still others. And these still others, in turn, will be unable to train in higher virtue, higher mind, and higher wisdom. These still others, too, will be undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Thus, monks, from the corruption of the Dhamma comes the corruption of the Vinaya; and from the corruption of the Vinaya comes the corruption of the Dhamma. This, monks, is the second future danger, which is not present now, but will arise in the future. You should become aware of it; and having become aware, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who are undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Being undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom, they will teach discourses on Abhidhamma or discourses of analysis, yet they will not comprehend that they are descending into dark practices. Thus, monks, from the corruption of the Dhamma comes the corruption of the Vinaya; and from the corruption of the Vinaya comes the corruption of the Dhamma. This, monks, is the third future danger, which is not present now, but will arise in the future. You should become aware of it; and having become aware, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who are undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Being undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom, regarding those discourses spoken by the Tathāgata — which are profound, profound in meaning, transcendent, and connected with emptiness — when these are being recited, they will not listen attentively, they will not lend an ear, they will not apply their minds to understanding, nor will they consider these teachings worthy of learning or mastering. But regarding those discourses that are composed by poets, poetic, with charming words and charming phrases, external, spoken by disciples — when these are being recited, they will listen attentively, they will lend an ear, they will apply their minds to understanding, and they will consider these teachings worthy of learning and mastering. Thus, monks, from the corruption of the Dhamma comes the corruption of the Vinaya; and from the corruption of the Vinaya comes the corruption of the Dhamma. This, monks, is the fourth future danger, which is not present now, but will arise in the future. You should become aware of it; and having become aware, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who are undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom. Being undeveloped in body, undeveloped in virtue, undeveloped in mind, and undeveloped in wisdom, these elder monks will be indulgent, lax, taking the lead in regression, abandoning the duty of solitude, and will not arouse effort for the attainment of the unattained, for the realization of the unrealized, for the direct experience of the unexperienced. Later generations will follow their example. They too will be indulgent, lax, taking the lead in regression, abandoning the duty of solitude, and will not arouse effort for the attainment of the unattained, for the realization of the unrealized, for the direct experience of the unexperienced. Thus, monks, from the corruption of the Dhamma comes the corruption of the Vinaya; and from the corruption of the Vinaya comes the corruption of the Dhamma.\n\nThis, monks, is the fifth future danger that has not yet arisen now, but will arise in the future. That you should realize; and having realized it, you should endeavor for its abandonment.\n\nIndeed, monks, these five future dangers have not yet arisen now, but will arise in the future. These you should realize; and having realized them, you should endeavor for their abandonment.",
      "sinhala": "මහණෙනි, අනාගතයේ ඇති වන මේ භයවල් පහක් ඇත. ඒවා දැනට හටගෙන නැත. ඒවා අනාගතයේදී ඇති වනු ඇත. ඒවා ඔබ විසින් අවබෝධ කරගත යුතු ය; අවබෝධ කරගෙන ඒවා දුරු කිරීම සඳහා වීර්ය කළ යුතු ය.\n\nකවරේ නම් ඒ පහද? මහණෙනි, අනාගත කාලයෙහි කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු ඇති වන්නාහ. කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ ඒ භික්ෂූහු අන්‍යයන්ට උපසම්පදාව ලබා දෙන්නාහ. උසස් සීලයෙහි, උසස් සිතෙහි, උසස් ප්‍ර​ඥාවෙහි ඔවුන්ට විනය පුහුණු කිරීමට නොහැකි වනු ඇත. ඔවුහු ද කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු වන්නාහ. කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ ඒ භික්ෂූහු අන්‍යයන්ට උපසම්පදාව ලබා දෙන්නාහ. උසස් සීලයෙහි, උසස් සිතෙහි, උසස් ප්‍ර​ඥාවෙහි ඔවුන්ට විනය පුහුණු කිරීමට නොහැකි වනු ඇත. ඔවුහු ද කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු වන්නාහ. මහණෙනි, මේ අයුරින් ධර්මය දූෂණය වීමෙන් විනය දූෂණය වේ; විනය දූෂණය වීමෙන් ධර්මය දූෂණය වේ. මහණෙනි, දැනට හටගෙන නැති, අනාගතයේ ඇති වන පළමු වන අනාගත භය මෙය යි. එය ඔබ විසින් අවබෝධ කරගත යුතු ය; අවබෝධ කරගෙන එය දුරු කිරීම සඳහා වීර්ය කළ යුතු ය.\n\nතවද, මහණෙනි, අනාගත කාලයෙහි කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු ඇති වන්නාහ. කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ ඒ භික්ෂූහු අන්‍යයන්ට නිස්සය දෙන්නාහ. උසස් සීලයෙහි, උසස් සිතෙහි, උසස් ප්‍ර​ඥාවෙහි ඔවුන්ට විනය පුහුණු කිරීමට නොහැකි වනු ඇත. ඔවුහු ද කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු වන්නාහ. කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ ඒ භික්ෂූහු අන්‍යයන්ට නිස්සය දෙන්නාහ. උසස් සීලයෙහි, උසස් සිතෙහි, උසස් ප්‍ර​ඥාවෙහි ඔවුන්ට විනය පුහුණු කිරීමට නොහැකි වනු ඇත. ඔවුහු ද කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු වන්නාහ. මහණෙනි, මේ අයුරින් ධර්මය දූෂණය වීමෙන් විනය දූෂණය වේ; විනය දූෂණය වීමෙන් ධර්මය දූෂණය වේ. මහණෙනි, දැනට හටගෙන නැති, අනාගතයේ ඇති වන දෙවැනි අනාගත භය මෙය යි. එය ඔබ විසින් අවබෝධ කරගත යුතු ය; අවබෝධ කරගෙන එය දුරු කිරීම සඳහා වීර්ය කළ යුතු ය.\n\nතවද, මහණෙනි, අනාගත කාලයෙහි කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු ඇති වන්නාහ. කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ ඒ භික්ෂූහු අභිධර්ම කතා, වේදල්ල කතා (ප්‍ර​ශ්නෝත්තර කතා) කියමින්, අකුසල ධර්මයන්ට පිවිසෙමින් සිටින බව නොදනිති. මහණෙනි, මේ අයුරින් ධර්මය දූෂණය වීමෙන් විනය දූෂණය වේ; විනය දූෂණය වීමෙන් ධර්මය දූෂණය වේ. මහණෙනි, දැනට හටගෙන නැති, අනාගතයේ ඇති වන තෙවැනි අනාගත භය මෙය යි. එය ඔබ විසින් අවබෝධ කරගත යුතු ය; අවබෝධ කරගෙන එය දුරු කිරීම සඳහා වීර්ය කළ යුතු ය.\n\nතවද, මහණෙනි, අනාගත කාලයෙහි කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු ඇති වන්නාහ. කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ ඒ භික්ෂූහු තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද, ගැඹුරු වූ, ගැඹුරු අර්ථ ඇති, ලෝකෝත්තර වූ, ශූන්‍යතාව හා සම්බන්ධ වූ යම් සූත්‍ර දේශනා ඇත්ද, ඒවා දේශනා කරන විට හොඳින් නොඅසන්නාහ, කන් නොදෙන්නාහ, අවබෝධය පිණිස සිත යොමු නොකරන්නාහ, එම ධර්මයන් ඉගෙන ගත යුතු යැයි හෝ පාඩම් කළ යුතු යැයි නොසිතන්නාහ. යම් සූත්‍ර කවි බවට පත් කළ, කාව්‍යමය වූ, සිත් ඇදගන්නා අකුරු සහිත, සිත් ඇදගන්නා ව්‍යංජන සහිත වූ, බාහිර වූ, ශ්‍ර​ාවකයන් විසින් දේශනා කරන ලද දේවල් ඇත්ද, ඒවා දේශනා කරන විට හොඳින් අසන්නාහ, කන් දෙන්නාහ, අවබෝධය පිණිස සිත යොමු කරන්නාහ, එම ධර්මයන් ඉගෙන ගත යුතු යැයි හෝ පාඩම් කළ යුතු යැයි සිතන්නාහ. මහණෙනි, මේ අයුරින් ධර්මය දූෂණය වීමෙන් විනය දූෂණය වේ; විනය දූෂණය වීමෙන් ධර්මය දූෂණය වේ. මහණෙනි, දැනට හටගෙන නැති, අනාගතයේ ඇති වන සිවුවැනි අනාගත භය මෙය යි. එය ඔබ විසින් අවබෝධ කරගත යුතු ය; අවබෝධ කරගෙන එය දුරු කිරීම සඳහා වීර්ය කළ යුතු ය.\n\nතවද, මහණෙනි, අනාගත කාලයෙහි කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ භික්ෂූහු ඇති වන්නාහ. කය නොවැඩූ, සිල් නොවැඩූ, සිත නොවැඩූ, ප්‍ර​ඥාව නොවැඩූ ඒ ස්ථවිර භික්ෂූහු සමූහයන්ට ඇලුණු, අලස වූ, වැරදි මාර්ගයට පිවිසීමට පෙරමුණ ගන්නා වූ, හුදෙකලාව අත්හළ වූ පිරිසක් වන්නාහ. නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ කර නොගත් දහම අවබෝධ කරගැනීම පිණිස, ප්‍ර​ත්‍යක්ෂ කර නොගත් නිර්වාණය ප්‍ර​ත්‍යක්ෂ කිරීම පිණිස වීර්ය නොකරන්නාහ. ඔවුන්ගේ පසු පරම්පරාව ද ඔවුන් දුටු අයුරින් අනුගමනය කරන්නාහ. ඔවුහු ද සමූහයන්ට ඇලුණු, අලස වූ, වැරදි මාර්ගයට පිවිසීමට පෙරමුණ ගන්නා වූ, හුදෙකලාව අත්හළ වූ පිරිසක් වන්නාහ. නොලැබූ අරහත් ඵලය ලැබීම පිණිස, අවබෝධ කර නොගත් දහම අවබෝධ කරගැනීම පිණිස, ප්‍ර​ත්‍යක්ෂ කර නොගත් නිර්වාණය ප්‍ර​ත්‍යක්ෂ කිරීම පිණිස වීර්ය නොකරන්නාහ. මහණෙනි, මේ අයුරින් ධර්මය දූෂණය වීමෙන් විනය දූෂණය වේ; විනය දූෂණය වීමෙන් ධර්මය දූෂණය වේ.\n\nමහණෙනි, දැනට නූපන් පස්වන අනාගත භය මෙයයි, එය අනාගතයේදී ඇතිවනු ඇත. එය ඔබ විසින් ප්‍ර‍තිබෝධ කරගත යුතුයි; ප්‍ර‍තිබෝධ කරගෙන එය ප්‍ර‍හාණය කිරීම පිණිස වීර්‍ය කළ යුතුයි. ‘‘මහණෙනි, දැනට නූපන් මේ පස් අනාගත භයෝ අනාගතයේදී ඇතිවනු ඇත. ඒවා ඔබ විසින් ප්‍ර‍තිබෝධ කරගත යුතුයි; ප්‍ර‍තිබෝධ කරගෙන ඒවා ප්‍ර‍හාණය කිරීම පිණිස වීර්‍ය කළ යුතුයි’’යි. නවවනයි.",
      "paliTitle": "Tatiyaanāgatabhayasuttaṃ",
      "englishTitle": "Third Discourse on Future Dangers",
      "sinhalaTitle": "තතිය අනාගතභය සූත්‍රය"
    },
    {
      "number": 80,
      "pali": "‘‘Pañcimāni, bhikkhave, anāgatabhayāni etarahi asamuppannāni āyatiṃ samuppajjissanti. Tāni vo paṭibujjhitabbāni; paṭibujjhitvā ca tesaṃ pahānāya vāyamitabbaṃ. ‘‘Katamāni pañca? Bhavissanti, bhikkhave, bhikkhū anāgatamaddhānaṃ cīvare kalyāṇakāmā. Te cīvare kalyāṇakāmā samānā riñcissanti paṃsukūlikattaṃ, riñcissanti araññavanapatthāni pantāni senāsanāni; gāmanigamarājadhānīsu osaritvā vāsaṃ kappessanti, cīvarahetu ca anekavihitaṃ anesanaṃ appatirūpaṃ āpajjissanti. Idaṃ, bhikkhave, paṭhamaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ piṇḍapāte kalyāṇakāmā. Te piṇḍapāte kalyāṇakāmā samānā riñcissanti piṇḍapātikattaṃ, riñcissanti araññavanapatthāni pantāni senāsanāni; gāmanigamarājadhānīsu osaritvā vāsaṃ kappessanti jivhaggena rasaggāni pariyesamānā, piṇḍapātahetu ca anekavihitaṃ anesanaṃ appatirūpaṃ āpajjissanti. Idaṃ, bhikkhave, dutiyaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ senāsane kalyāṇakāmā. Te senāsane kalyāṇakāmā samānā riñcissanti rukkhamūlikattaṃ [āraññakattaṃ (syā. kaṃ.)], riñcissanti araññavanapatthāni pantāni senāsanāni; gāmanigamarājadhānīsu osaritvā vāsaṃ kappessanti, senāsanahetu ca anekavihitaṃ anesanaṃ appatirūpaṃ āpajjissanti. Idaṃ, bhikkhave, tatiyaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ bhikkhunīsikkhamānāsamaṇuddesehi saṃsaṭṭhā viharissanti. Bhikkhunīsikkhamānāsamaṇuddesehi saṃsagge kho pana, bhikkhave, sati etaṃ pāṭikaṅkhaṃ – ‘anabhiratā vā brahmacariyaṃ carissanti, aññataraṃ vā saṃkiliṭṭhaṃ āpattiṃ āpajjissanti, sikkhaṃ vā paccakkhāya hīnāyāvattissanti’. Idaṃ, bhikkhave, catutthaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Puna caparaṃ, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ ārāmikasamaṇuddesehi saṃsaṭṭhā viharissanti. Ārāmikasamaṇuddesehi saṃsagge kho pana, bhikkhave, sati etaṃ pāṭikaṅkhaṃ – ‘anekavihitaṃ sannidhikāraparibhogaṃ anuyuttā viharissanti, oḷārikampi nimittaṃ karissanti, pathaviyāpi haritaggepi’. Idaṃ, bhikkhave, pañcamaṃ anāgatabhayaṃ etarahi asamuppannaṃ āyatiṃ samuppajjissati. Taṃ vo paṭibujjhitabbaṃ; paṭibujjhitvā ca tassa pahānāya vāyamitabbaṃ. ‘‘Imāni kho, bhikkhave, pañca anāgatabhayāni etarahi asamuppannāni āyatiṃ samuppajjissanti. Tāni vo paṭibujjhitabbāni; paṭibujjhitvā ca tesaṃ pahānāya vāyamitabba’’nti. Dasamaṃ. ",
      "english": "Monks, there are these five future dangers which have not yet arisen now, but will arise in the future. You should understand them; and having understood them, you should strive for their abandonment. Which five?\n\nMonks, in the future, there will be monks who desire fine robes. Desiring fine robes, they will abandon the practice of wearing cast-off rags, and they will abandon remote dwellings in forests, wildernesses, and thickets. They will move into villages, towns, and royal capitals and settle there. And for the sake of robes, they will engage in various unseemly and inappropriate modes of livelihood. Monks, this is the first future danger that has not yet arisen now, but will arise in the future. You should understand it; and having understood it, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who desire fine alms-food. Desiring fine alms-food, they will abandon the practice of going for alms, and they will abandon remote dwellings in forests, wildernesses, and thickets. They will move into villages, towns, and royal capitals and settle there, seeking out the finest flavors with their tongues. And for the sake of alms-food, they will engage in various unseemly and inappropriate modes of livelihood. Monks, this is the second future danger that has not yet arisen now, but will arise in the future. You should understand it; and having understood it, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who desire fine dwellings. Desiring fine dwellings, they will abandon the practice of dwelling at the foot of a tree, and they will abandon remote dwellings in forests, wildernesses, and thickets. They will move into villages, towns, and royal capitals and settle there. And for the sake of dwellings, they will engage in various unseemly and inappropriate modes of livelihood. Monks, this is the third future danger that has not yet arisen now, but will arise in the future. You should understand it; and having understood it, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who will live in close association with bhikkhunīs (nuns), sīkkhamānās (female probationers), and samaṇuddesas (novice monks). When there is such close association with bhikkhunīs, sīkkhamānās, and samaṇuddesas, monks, this much can be expected: either they will live the holy life without enjoyment, or they will fall into some defiling offence, or they will renounce the training and revert to a lower state (lay life). Monks, this is the fourth future danger that has not yet arisen now, but will arise in the future. You should understand it; and having understood it, you should strive for its abandonment.\n\nFurthermore, monks, in the future, there will be monks who will live in close association with park-keepers and novice monks. When there is such close association with park-keepers and novice monks, monks, this much can be expected: either they will engage in various forms of storing up and consuming provisions, or they will make gross indications (for what they need or want), even on the ground or on the tips of blades of grass. Monks, this is the fifth future danger that has not yet arisen now, but will arise in the future. You should understand it; and having understood it, you should strive for its abandonment.\n\nMonks, these are the five future dangers that have not yet arisen now, but will arise in the future. You should understand them; and having understood them, you should strive for their abandonment.",
      "sinhala": "භික්ෂූනි, දැනට ඇති නොවූ, අනාගතයේදී ඇතිවන මේ අනාගත භයාවහ කරුණු පහක් ඇත. ඒවා ඔබ විසින් අවබෝධ කළ යුතුයි; අවබෝධ කරගෙන, ඒවා දුරු කිරීම පිණිස වෑයම් කළ යුතුයි.\n\nකවරේ ද ඒ පහ? භික්ෂූනි, අනාගතයේදී භික්ෂූහු සිවුරු සම්බන්ධයෙන් හොඳ දේ (කල්‍යාණ) කැමති වන්නෝ වන්නාහ. සිවුරු සම්බන්ධයෙන් එසේ කල්‍යාණකාමී වූ ඒ භික්ෂූහු පංසූකූලික භාවය අත්හරින්නාහ. ආරණ්‍යයෙහි වූ, වනප්‍රස්ථ වූ, දුරස්ථ සේනාසන අත්හරින්නාහ. ගම්, නියම්ගම්, රාජධානිවලට බැස වාසය කරන්නාහ. සිවුරු හේතුවෙන් නොයෙක් ආකාරයේ අනුචිත වූ, නොපහන් වූ අනිසි දේ සෙවීම්හි යෙදෙන්නාහ. භික්ෂූනි, දැනට ඇති නොවූ, අනාගතයේදී ඇතිවන මේ පළමුවන අනාගත භය මෙයයි. එය ඔබ විසින් අවබෝධ කළ යුතුයි; අවබෝධ කරගෙන, එය දුරු කිරීම පිණිස වෑයම් කළ යුතුයි.\n\nතවද, භික්ෂූනි, අනාගතයේදී භික්ෂූහු පිණ්ඩපාතය සම්බන්ධයෙන් හොඳ දේ (කල්‍යාණ) කැමති වන්නෝ වන්නාහ. පිණ්ඩපාතය සම්බන්ධයෙන් එසේ කල්‍යාණකාමී වූ ඒ භික්ෂූහු පිණ්ඩපාතික භාවය අත්හරින්නාහ. ආරණ්‍යයෙහි වූ, වනප්‍රස්ථ වූ, දුරස්ථ සේනාසන අත්හරින්නාහ. ගම්, නියම්ගම්, රාජධානිවලට බැස වාසය කරන්නාහ, දිව අගින් උසස් රස සොයමින්. පිණ්ඩපාතය හේතුවෙන් නොයෙක් ආකාරයේ අනුචිත වූ, නොපහන් වූ අනිසි දේ සෙවීම්හි යෙදෙන්නාහ. භික්ෂූනි, දැනට ඇති නොවූ, අනාගතයේදී ඇතිවන මේ දෙවන අනාගත භය මෙයයි. එය ඔබ විසින් අවබෝධ කළ යුතුයි; අවබෝධ කරගෙන, එය දුරු කිරීම පිණිස වෑයම් කළ යුතුයි.\n\nතවද, භික්ෂූනි, අනාගතයේදී භික්ෂූහු සේනාසන සම්බන්ධයෙන් හොඳ දේ (කල්‍යාණ) කැමති වන්නෝ වන්නාහ. සේනාසන සම්බන්ධයෙන් එසේ කල්‍යාණකාමී වූ ඒ භික්ෂූහු රුක්ඛමූලික භාවය අත්හරින්නාහ. ආරණ්‍යයෙහි වූ, වනප්‍රස්ථ වූ, දුරස්ථ සේනාසන අත්හරින්නාහ. ගම්, නියම්ගම්, රාජධානිවලට බැස වාසය කරන්නාහ. සේනාසන හේතුවෙන් නොයෙක් ආකාරයේ අනුචිත වූ, නොපහන් වූ අනිසි දේ සෙවීම්හි යෙදෙන්නාහ. භික්ෂූනි, දැනට ඇති නොවූ, අනාගතයේදී ඇතිවන මේ තුන්වන අනාගත භය මෙයයි. එය ඔබ විසින් අවබෝධ කළ යුතුයි; අවබෝධ කරගෙන, එය දුරු කිරීම පිණිස වෑයම් කළ යුතුයි.\n\nතවද, භික්ෂූනි, අනාගතයේදී භික්ෂූහු භික්ෂුණීන්, සික්ෂමානාවන්, සාමණේරයන් සමඟ අනුචිත ලෙස මිශ්‍රව වාසය කරන්නාහ. භික්ෂූනි, භික්ෂුණීන්, සික්ෂමානාවන්, සාමණේරයන් සමඟ එසේ අනුචිත ලෙස මිශ්‍රව වසන්නට වූ විට, ‘ඔවුහු බ්‍රහ්මචාරී ජීවිතයෙහි නොඇලී වාසය කරන්නාහ, නැතහොත් කිසියම් කෙලෙසෙන ආපත්තියකට පත්වන්නාහ, නැතහොත් ශික්ෂාව අත්හැර හීනාවර්තනයට (ගිහි ජීවිතයට) හැරෙන්නාහ’ යන මෙය බලාපොරොත්තු විය හැක. භික්ෂූනි, දැනට ඇති නොවූ, අනාගතයේදී ඇතිවන මේ සිව්වන අනාගත භය මෙයයි. එය ඔබ විසින් අවබෝධ කළ යුතුයි; අවබෝධ කරගෙන, එය දුරු කිරීම පිණිස වෑයම් කළ යුතුයි.\n\nතවද, භික්ෂූනි, අනාගතයේදී භික්ෂූහු ආරාමිකයන් හා සාමණේරයන් සමඟ අනුචිත ලෙස මිශ්‍රව වාසය කරන්නාහ. භික්ෂූනි, ආරාමිකයන් හා සාමණේරයන් සමඟ එසේ අනුචිත ලෙස මිශ්‍රව වසන්නට වූ විට, ‘ඔවුහු නොයෙක් ආකාරයේ සන්නිධිකාර පරිභෝගයෙහි (එකතු කර තබාගෙන පරිභෝග කිරීම) යෙදී වාසය කරන්නාහ, මහත් වූ ලෞකික ක්‍රියාවන්හි යෙදෙන්නාහ, පොළොවෙහි හා තණ අගෙහි ඇති වස්තු පවා (තමන්ගේ යැයි සලකා හෝ උපයනු පිණිස) ලකුණු කරන්නාහ’ යන මෙය බලාපොරොත්තු විය හැක. භික්ෂූනි, දැනට ඇති නොවූ, අනාගතයේදී ඇතිවන මේ පස්වන අනාගත භය මෙයයි. එය ඔබ විසින් අවබෝධ කළ යුතුයි; අවබෝධ කරගෙන, එය දුරු කිරීම පිණිස වෑයම් කළ යුතුයි.\n\nභික්ෂූනි, දැනට ඇති නොවූ, අනාගතයේදී ඇතිවන මේ අනාගත භයාවහ කරුණු පහ මේවායි. ඒවා ඔබ විසින් අවබෝධ කළ යුතුයි; අවබෝධ කරගෙන, ඒවා දුරු කිරීම පිණිස වෑයම් කළ යුතුයි.",
      "paliTitle": "Catutthaanāgatabhayasuttaṃ",
      "englishTitle": "Fourth Sutta on Future Dangers",
      "sinhalaTitle": "චතුත්ථ අනාගතභය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Yodhājīvavaggo tatiyo. Tassuddānaṃ – Dve cetovimuttiphalā, dve ca dhammavihārino; Yodhājīvā ca dve vuttā, cattāro ca anāgatāti.",
    "english": "The third chapter on the Warrior. The summary of it: Two on the Fruit of Heart's Liberation, two on those Dwelling in Dhamma; two on Warriors are mentioned, and four on the Future.",
    "sinhala": "තෙවන යෝධාජීව වර්ගයයි. එහි උද්දානය නම්: චේතෝවිමුත්තිඵල සූත්‍ර දෙකක්, ධම්මවිහාරී සූත්‍ර දෙකක්, යෝධාජීව සූත්‍ර දෙකක් සහ අනාගත සූත්‍ර හතරකි."
  }
}