{
  "id": "an5.24",
  "title": {
    "pali": "Āvāsikavaggo",
    "english": "The Chapter on Residents",
    "sinhala": "ආවාසික වග්ගය"
  },
  "sections": [
    {
      "number": 231,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu abhāvanīyo hoti. Katamehi pañcahi? Na ākappasampanno hoti na vattasampanno; na bahussuto hoti na sutadharo; na paṭisallekhitā [sallekhitā (ka. sī.)] hoti na paṭisallānārāmo; na kalyāṇavāco hoti na kalyāṇavākkaraṇo; duppañño hoti jaḷo eḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu abhāvanīyo hoti. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu bhāvanīyo hoti. Katamehi pañcahi? Ākappasampanno hoti vattasampanno; bahussuto hoti sutadharo; paṭisallekhitā hoti paṭisallānārāmo; kalyāṇavāco hoti kalyāṇavākkaraṇo; paññavā hoti ajaḷo aneḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu bhāvanīyo hotī’’ti. Paṭhamaṃ.",
      "english": "“Monks, a resident monk endowed with five qualities is not to be developed. Which five? He is not accomplished in demeanor and not accomplished in observances; he is not learned in the teachings and not a retainer of what he has heard; he is not one who is given to effacement and not one who delights in secluded meditation; he is not one of wholesome speech and not one of wholesome discourse; he is dull-witted, stupid, and like a deaf-mute. Monks, a resident monk endowed with these five qualities is not to be developed.\n\n“Monks, a resident monk endowed with five qualities is to be developed. Which five? He is accomplished in demeanor and accomplished in observances; he is learned in the teachings and a retainer of what he has heard; he is one who is given to effacement and one who delights in secluded meditation; he is one of wholesome speech and one of wholesome discourse; he is wise, not stupid, and not like a deaf-mute. Monks, a resident monk endowed with these five qualities is to be developed.”",
      "sinhala": "භික්ෂූණි, කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් වඩවා ගත නොහැක්කෙක් වෙයි. ඒ කවර කරුණු පහකින්ද? ඔහු ආචාර සම්පන්න නොවෙයි, වත් පිළිවෙත් සම්පන්න නොවෙයි; බහුශ්‍රැ​ත නොවෙයි, ඇසූ දේ සිහියේ රඳවාගන්නා සුළු නොවෙයි; ප්‍ර​තිසංලීන නොවෙයි, ප්‍ර​තිසංලීන භාවයට ඇළුම් කරන්නෙක් නොවෙයි; මනරම් වචන ඇත්තෙක් නොවෙයි, මනරම් ලෙස කතා කරන්නෙක් නොවෙයි; දුෂ්ප්‍ර​ඥයෙක් වෙයි, අඳබාලයෙක් වෙයි, ධර්ම​ය පහදා දීමට අසමත් තැනැත්තෙක් වෙයි. භික්ෂූණි, මේ කරුණු පසින් යුක්ත වූ ආවාසික භික්ෂුවක් වඩවා ගත නොහැක්කෙක් වෙයි.\n\nභික්ෂූණි, කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් වඩවා ගත යුත්තෙක් වෙයි. ඒ කවර කරුණු පහකින්ද? ඔහු ආචාර සම්පන්න වෙයි, වත් පිළිවෙත් සම්පන්න වෙයි; බහුශ්‍රැ​ත වෙයි, ඇසූ දේ සිහියේ රඳවාගන්නා සුළු වෙයි; ප්‍ර​තිසංලීන වෙයි, ප්‍ර​තිසංලීන භාවයට ඇළුම් කරන්නෙක් වෙයි; මනරම් වචන ඇත්තෙක් වෙයි, මනරම් ලෙස කතා කරන්නෙක් වෙයි; ප්‍ර​ඥාවන්තයෙක් වෙයි, අඳබාල නොවෙයි, ධර්ම​ය පහදා දීමට සමත් තැනැත්තෙක් වෙයි. භික්ෂූණි, මේ කරුණු පසින් යුක්ත වූ ආවාසික භික්ෂුවක් වඩවා ගත යුත්තෙක් වෙයි.",
      "paliTitle": "Āvāsikasuttaṃ",
      "englishTitle": "The Discourse on Resident (Monks)",
      "sinhalaTitle": "ආවාසික සූත්‍රය"
    },
    {
      "number": 232,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. ‘‘Katamehi pañcahi? Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Dutiyaṃ.",
      "english": "Monks, a resident monk endowed with five qualities becomes dear, agreeable, respected, and worthy of inspiration for his fellow practitioners.\n\nWith which five? He is virtuous; he dwells restrained by the Pātimokkha restraint, accomplished in conduct and domain, seeing danger even in the slightest faults, and trains himself by undertaking the training rules. He is learned, retaining what he has heard and accumulating what he has heard; those teachings that are beautiful in the beginning, beautiful in the middle, beautiful in the end, proclaiming the spiritual life in its entirety, perfectly complete and pure, both in meaning and phrasing—such teachings are extensively heard by him, retained, recited orally, contemplated mentally, and well penetrated by understanding. He has a pleasant voice and pleasant speech; he is endowed with cultured speech, clear, articulate, and capable of conveying the meaning. He obtains at will, without difficulty or trouble, the four jhānas—the mind's higher dwellings, which are a pleasant abiding in this very life. Through the destruction of the taints, he dwells having directly realized for himself in this very life, and attained, the taintless liberation of mind and liberation by wisdom.\n\nMonks, a resident monk endowed with these five qualities becomes dear, agreeable, respected, and worthy of inspiration for his fellow practitioners.",
      "sinhala": "මහණෙනි, ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්ෂුව සමබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු ද වෙයි, භාවනීය ද වෙයි.\n\nඒ කවර පහකින් ද යත්: හෙතෙම සිල්වත් වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ වාසය කරයි. ආචාර ගෝචර සම්පන්න වෙයි. අනුමාත්‍ර වූ වරදෙහි ද භය දකින්නේ, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. හෙතෙම බහුශ්‍රැත වෙයි. ඇසූ දේ දරන්නෙක් වෙයි, ඇසූ දේ රැස්කරන්නෙක් වෙයි. මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන යම් ධර්මයෝ ඇද්ද, ඔහුට එවැනි ධර්මයෝ බහුශ්‍රැත වෙත්. ඒවා ධාරණය කරනු ලැබූ, වචනයෙන් හුරු පුරුදු කරනු ලැබූ, මනසින් මෙනෙහි කරනු ලැබූ, දෘෂ්ටියෙන් (නුවණින්) මැනවින් විනිවිදින ලද වෙත්. හෙතෙම කල්‍යාණ වාග් ඇත්තෙක් වෙයි, කල්‍යාණ වචන කියන්නෙක් වෙයි. මනා ලෙස වෙන් කරන ලද, නොතැතිලෙනසුලු වූ, අර්ථය දැනවිය හැකි වූ, ග්‍රාම්‍ය නොවන කථාවෙන් යුක්ත වෙයි. හෙතෙම අධිචෛතසික වූ, දැහැමි සැප විහරණ වූ සතර ධ්‍යානයන් කැමති පරිදි ලබන්නේ වෙයි, දුක් නොවී ලබන්නේ වෙයි, වෙහෙස නොවී ලබන්නේ වෙයි. හෙතෙම ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය ද, ප්‍රඥා විමුක්තිය ද මේ ආත්මභාවයෙහි ම තමා විසින් අභිඥාවෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරයි.\n\nමහණෙනි, මේ ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්ෂුව සමබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු ද වෙයි, භාවනීය ද වෙයි.",
      "paliTitle": "Piyasuttaṃ",
      "englishTitle": "The Discourse on the Dear",
      "sinhalaTitle": "පිය සූත්‍රය"
    },
    {
      "number": 233,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu āvāsaṃ sobheti. Katamehi pañcahi? Sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā; paṭibalo hoti upasaṅkamante dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu āvāsaṃ sobhetī’’ti. Tatiyaṃ.",
      "english": "Monks, a resident monk endowed with five qualities adorns the dwelling. With which five?\n\nHe is virtuous; he dwells restrained by the Pātimokkha, perfect in conduct and resort, seeing danger in the slightest faults, and trains himself by undertaking the training rules. He is learned, remembering and retaining what he has heard; those teachings that are beautiful in the beginning, beautiful in the middle, and beautiful in the end, with their right meaning and phrasing, proclaiming the perfectly complete and pure holy life; such teachings he has heard much of, retained, recited, pondered over, and penetrated well with right view. He is of good speech and good utterance, endowed with refined speech that is clear, unhesitating, and conveys the meaning. He is capable of explaining, encouraging, inspiring, and delighting those who approach him with a Dhamma talk. He obtains at will, without difficulty or trouble, the four jhānas — states of higher consciousness that are pleasant abidings in this very life.\n\nIndeed, Monks, a resident monk endowed with these five qualities adorns the dwelling.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් ධර්මයන්ගෙන් සමන්වාගත වූ ආවාසික භික්ෂුවක් ආවාසය ශෝභමාන කරයි. ඒ කවර පසකින්ද?\n\nසිල්වත් වේ; ශික්ෂාපදයන් සමාදන්ව හික්මෙයි. බහුශ්‍රැත වේ; දෘෂ්ටියෙන් මනාව විනිවිදින ලද්දෙක් වේ. කල්‍යාණ වූ වචන ඇත්තේ වෙයි; කල්‍යාණ වූ වචන කාරණා ඇත්තේ වෙයි; පැහැදිලි වූ, නොපැකිලෙන, අර්ථය විදහා පෙන්වන, පෝරී නම් වූ (නාගරිකයන්ට ගැළපෙන) බසකින් යුක්ත වෙයි. ළඟා වන්නවුන්ට ධර්ම කථාවකින් ධර්මය ප්‍රකාශ කිරීමට, සමාදන් කරවීමට, උනන්දු කරවීමට, සතුටු කරවීමට සමර්ථ වේ. සිව් වැදෑරුම් වූ, උසස් චෛතසිකයන්ට අයත් වූ, මේ ආත්මභාවයේදීම සුඛ විහරණ වශයෙන් පවතින ධ්‍යාන කැමති සේ ලබන්නේ වෙයි; කිසිදු වෙහෙසකින් තොරව ලබන්නේ වෙයි; කිසිදු අපහසුවකින් තොරව ලබන්නේ වෙයි.\n\nමහණෙනි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් සමන්වාගත වූ ආවාසික භික්ෂුවක් ආවාසය ශෝභමාන කරන්නේය.",
      "paliTitle": "Sobhanasuttaṃ",
      "englishTitle": "The Discourse on What Beautifies",
      "sinhalaTitle": "සෝභන සූත්‍රය"
    },
    {
      "number": 234,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu āvāsassa bahūpakāro hoti. Katamehi pañcahi? Sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; khaṇḍaphullaṃ paṭisaṅkharoti; mahā kho pana bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū gihīnaṃ upasaṅkamitvā āroceti – ‘mahā kho, āvuso, bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū, karotha puññāni, samayo puññāni kātu’nti; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu āvāsassa bahūpakāro hotī’’ti. Catutthaṃ.",
      "english": "Monks, a resident monk endowed with five qualities is very helpful to the residence. Which five?\n\nHe is virtuous, he dwells restrained by the Pāṭimokkha, perfect in conduct and resort, seeing danger in the slightest faults, and trains himself by undertaking the training rules. He is learned, retains what he has heard, has accumulated what he has heard, and is conversant with the teachings; he has examined their meaning with wisdom and has penetrated them well by right view. He repairs broken or dilapidated parts of the residence. When a large community of monks from various regions has arrived, he approaches laypeople and announces, saying, \"Friends, a large community of monks from various regions has arrived! Make merit, for this is the opportune time to make merit!\" He is a recipient at will, without difficulty, without trouble, of the four jhānas — the higher mental states that are pleasant abidings in this very life.\n\nMonks, a resident monk endowed with these five qualities is very helpful to the residence.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ආවාසයට මහත් උපකාරී වේ. ඒ කවර කරුණු පහකින්ද? සීලවන්ත වේ; ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර ගෝචර සම්පන්න වූයේ, අල්පමාත්‍ර වූ ද වරදෙහි භය දක්නේ, ශික්ෂාපදයන් සමාදන් වී හික්මෙයි; බහුශ්‍රැත වේ; ඇසූ දෙය දරාගත්, සිතෙහි පිහිටුවාගත්, වචනයෙන් හුරුපුරුදු කළ, මනසින් විමර්ශනය කළ, දෘෂ්ටියෙන් (නුවණින්) මැනවින් විනිවිද දකියි; කඩතොලු වූ දෑ පිළිසකර කරයි; එසේම, නානා ප්‍රදේශවලින් පැමිණි මහත් භික්ෂුසංඝයක් ආවාසයට පැමිණි විට, ඔහු ගිහියන් වෙත ගොස් මෙසේ දැනුම් දෙයි: ‘ඇවැත්නි, නානා ප්‍රදේශවලින් පැමිණි මහත් භික්ෂුසංඝයක් පැමිණ ඇත, පින් කරව්, පින් කිරීමට මේ සුදුසු කාලයයි’ කියා; අභිචෛතසික වූ, මේ ආත්මභාවයේදීම සුඛ විහරණය පිණිස පවතින, සිව් ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නේ වේ. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ආවාසයට මහත් උපකාරී වේ.",
      "paliTitle": "Bahūpakārasuttaṃ",
      "englishTitle": "Very Helpful Sutta",
      "sinhalaTitle": "බහූපකාර සූත්‍රය"
    },
    {
      "number": 235,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu gihīnaṃ [gihiṃ (syā.), gihī (katthaci)] anukampati. Katamehi pañcahi? Adhisīle [adhisīlesu (syā.)] samādapeti; dhammadassane niveseti; gilānake upasaṅkamitvā satiṃ uppādeti – ‘arahaggataṃ āyasmanto satiṃ upaṭṭhāpethā’ti; mahā kho pana bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū gihīnaṃ upasaṅkamitvā āroceti – ‘mahā kho, āvuso, bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū, karotha puññāni, samayo puññāni kātu’nti; yaṃ kho panassa bhojanaṃ denti lūkhaṃ vā paṇītaṃ vā taṃ attanā paribhuñjati, saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu gihīnaṃ anukampatī’’ti. Pañcamaṃ.",
      "english": "Monks, a resident monk endowed with five qualities shows compassion for householders. Which five? He encourages them to undertake higher morality; he establishes them in the vision of the Dhamma; he approaches those who are sick and arouses mindfulness in them, saying, 'Venerables, establish mindfulness directed towards the Arahant.' Furthermore, when a large community of monks has arrived, monks from various regions, he approaches the householders and informs them, saying, 'Friends, a large community of monks has arrived, monks from various regions. Perform meritorious deeds; it is the proper time to perform meritorious deeds.' Whatever food they offer him, whether coarse or refined, he consumes it himself and does not waste the offering given in faith. Monks, it is with these five qualities that a resident monk shows compassion for householders.",
      "sinhala": "භික්‍ෂූනි, ධර්මයන් පසකින් යුක්ත වූ ආවාසික භික්‍ෂුව ගිහියන්ට අනුකම්පා කරයි. කවර ධර්මයන් පසකින්ද? අධිශීලයෙහි පිහිටුවයි; ධර්‍මය අවබෝධ කිරීමෙහි යොමු කරයි; ගිලනුන් වෙත එළඹ ‘ආයුෂ්මතුනි, අරහත්භාවය කරා පමුණුවන සිහිය පිහිටුවා ගන්නැ’යි සිහිය උපදවයි; නොයෙක් දේශයන්ගෙන් පැමිණි මහත් භික්‍ෂු සංඝයක් වඩින බව ගිහියන් වෙත ගොස් දන්වා, ‘ඇවැත්නි, නොයෙක් දේශයන්ගෙන් පැමිණි මහත් භික්‍ෂු සංඝයක් වඩිනවා, පිං කරව්, පිං දහම් කිරීමට සුදුසුම කාලය මෙයයි’ යි පවසයි; යම් ආහාරයක් ගිහියන් ඔහුට දෙද්ද, එය රළු වුවත්, ප්‍රණීත වුවත් තමා විසින්ම පරිභෝජනය කරයි, ශ්‍රද්ධාවෙන් පූජා කළ දානය විනාශ නොකරයි. භික්‍ෂූනි, මේ ධර්මයන් පසකින් යුක්ත වූ ආවාසික භික්‍ෂුව ගිහියන්ට අනුකම්පා කරයි.",
      "paliTitle": "Anukampasuttaṃ",
      "englishTitle": "Compassion Sutta",
      "sinhalaTitle": "අනුකම්පා සූත්‍රය"
    },
    {
      "number": 236,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā appasādanīye ṭhāne pasādaṃ upadaṃseti; ananuvicca apariyogāhetvā pasādanīye ṭhāne appasādaṃ upadaṃseti; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati; anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati; anuvicca pariyogāhetvā appasādanīye ṭhāne appasādaṃ upadaṃseti; anuvicca pariyogāhetvā pasādanīye ṭhāne pasādaṃ upadaṃseti; saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Chaṭṭhaṃ.",
      "english": "Monks, a resident monk endowed with five qualities is deposited in hell just as if brought there. Which five? Without investigating or thoroughly examining, he speaks praise of one deserving dispraise; without investigating or thoroughly examining, he speaks dispraise of one deserving praise; without investigating or thoroughly examining, he engenders confidence in a situation not conducive to confidence; without investigating or thoroughly examining, he engenders lack of confidence in a situation conducive to confidence; and he wastes offerings given in faith. Indeed, monks, a resident monk endowed with these five qualities is deposited in hell just as if brought there.\n\nMonks, a resident monk endowed with five qualities is deposited in heaven just as if brought there. Which five? Having investigated and thoroughly examined, he speaks dispraise of one deserving dispraise; having investigated and thoroughly examined, he speaks praise of one deserving praise; having investigated and thoroughly examined, he engenders lack of confidence in a situation not conducive to confidence; having investigated and thoroughly examined, he engenders confidence in a situation conducive to confidence; and he does not waste offerings given in faith. Indeed, monks, a resident monk endowed with these five qualities is deposited in heaven just as if brought there.",
      "sinhala": "භික්ෂූණි, කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙන ගොස් දැමුවාක් මෙන් නිරයේ වැටෙයි. ඒ කරුණු පහ කවරේද? නොවිමසා, නොපිරික්සා, අවගුණ කීමට සුදුසු අයගේ ගුණ කියයි. නොවිමසා, නොපිරික්සා, ගුණ කීමට සුදුසු අයගේ අවගුණ කියයි. නොවිමසා, නොපිරික්සා, ප්‍රසාදයක් ඇති නොකළ යුතු තැනක ප්‍රසාදය ඇති කරයි. නොවිමසා, නොපිරික්සා, ප්‍රසාදයක් ඇති කළ යුතු තැනක අප්‍රසාදය ඇති කරයි. ශ්‍රද්ධාවෙන් දෙන ලද දෙය විනාශ කරයි. භික්ෂූණි, මේ කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙන ගොස් දැමුවාක් මෙන් නිරයේ වැටෙයි.\n\nභික්ෂූණි, කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයේ වැටෙයි. ඒ කරුණු පහ කවරේද? විමසා, පිරික්සා, අවගුණ කීමට සුදුසු අයගේ අවගුණ කියයි. විමසා, පිරික්සා, ගුණ කීමට සුදුසු අයගේ ගුණ කියයි. විමසා, පිරික්සා, ප්‍රසාදයක් ඇති නොකළ යුතු තැනක අප්‍රසාදය ඇති කරයි. විමසා, පිරික්සා, ප්‍රසාදයක් ඇති කළ යුතු තැනක ප්‍රසාදය ඇති කරයි. ශ්‍රද්ධාවෙන් දෙන ලද දෙය විනාශ නොකරයි. භික්ෂූණි, මේ කරුණු පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයේ වැටෙයි.",
      "paliTitle": "Paṭhamaavaṇṇārahasuttaṃ",
      "englishTitle": "The First Discourse on What Deserves Dispraise",
      "sinhalaTitle": "පළමු අවණ්ණාරහ සූත්‍රය"
    },
    {
      "number": 237,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; āvāsamaccharī hoti āvāsapaligedhī; kulamaccharī hoti kulapaligedhī; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati; anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati; na āvāsamaccharī hoti na āvāsapaligedhī; na kulamaccharī hoti na kulapaligedhī; saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Sattamaṃ.",
      "english": "Monks, a resident bhikkhu endowed with five qualities is consigned to hell as if carried there. Which five? Without having investigated or thoroughly examined, he speaks praise of one who is deserving of dispraise; without having investigated or thoroughly examined, he speaks dispraise of one who is deserving of praise; he is possessive regarding his dwelling and strongly attached to his dwelling; he is possessive regarding supporter families and strongly attached to supporter families; he squanders the offerings of faith. Monks, a resident bhikkhu endowed with these five qualities is consigned to hell as if carried there.\n\nMonks, a resident bhikkhu endowed with five qualities is consigned to heaven as if carried there. Which five? Having investigated and thoroughly examined, he speaks dispraise of one who is deserving of dispraise; having investigated and thoroughly examined, he speaks praise of one who is deserving of praise; he is not possessive regarding his dwelling and not strongly attached to his dwelling; he is not possessive regarding supporter families and not strongly attached to supporter families; he does not squander the offerings of faith. Monks, a resident bhikkhu endowed with these five qualities is consigned to heaven as if carried there.",
      "sinhala": "මහණෙනි, පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ ආවාසික භික්ෂුව, (අන් අයකු විසින්) රැගෙන ගොස් දැමුවාක් මෙන් නිරයෙහිම පිහිටයි. ඒ පස්දොහො මොනවාද? හොඳින් නොවිමසා, මැනවින් සලකා බලා නොගෙන, නින්දා ලැබිය යුත්තාට ප්‍ර‌ශංසා කරයි; හොඳින් නොවිමසා, මැනවින් සලකා බලා නොගෙන, ප්‍ර‌ශංසා ලැබිය යුත්තාට නින්දා කරයි; ආවාසය ගැන මසුරු වෙයි, ආවාසය කෙරෙහි දැඩි ලෙස ඇලී ගැලී සිටියි; දායක පවුල් ගැන මසුරු වෙයි, දායක පවුල් කෙරෙහි දැඩි ලෙස ඇලී ගැලී සිටියි; ශ්‍ර‌ද්ධා බුද්ධියෙන් පිදූ දේ විනාශයට පත් කරයි. මහණෙනි, ඉතින් මේ පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ ආවාසික භික්ෂුව, (අන් අයකු විසින්) රැගෙන ගොස් දැමුවාක් මෙන් නිරයෙහිම පිහිටයි.\n\nමහණෙනි, පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ ආවාසික භික්ෂුව, (අන් අයකු විසින්) රැගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයෙහිම පිහිටයි. ඒ පස්දොහො මොනවාද? හොඳින් විමසා, මැනවින් සලකා බලා, නින්දා ලැබිය යුත්තාට නින්දා කරයි; හොඳින් විමසා, මැනවින් සලකා බලා, ප්‍ර‌ශංසා ලැබිය යුත්තාට ප්‍ර‌ශංසා කරයි; ආවාසය ගැන මසුරු නොවෙයි, ආවාසය කෙරෙහි දැඩි ලෙස ඇලී ගැලී නොසිටියි; දායක පවුල් ගැන මසුරු නොවෙයි, දායක පවුල් කෙරෙහි දැඩි ලෙස ඇලී ගැලී නොසිටියි; ශ්‍ර‌ද්ධා බුද්ධියෙන් පිදූ දේ විනාශයට පත් නොකරයි. මහණෙනි, ඉතින් මේ පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ ආවාසික භික්ෂුව, (අන් අයකු විසින්) රැගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයෙහිම පිහිටයි.",
      "paliTitle": "Dutiyaavaṇṇārahasuttaṃ",
      "englishTitle": "Second Sutta on Disrespecting the Worthy",
      "sinhalaTitle": "දුතිය අවණ්ණාරහ සූත්‍රය"
    },
    {
      "number": 238,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati; anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati; na āvāsamaccharī hoti; na kulamaccharī hoti; na lābhamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a resident monk endowed with five qualities is cast into hell as if brought there directly. With which five? Without investigating or comprehending, he speaks praise of one who deserves dispraise; without investigating or comprehending, he speaks dispraise of one who deserves praise; he is stingy regarding the monastery; he is stingy regarding supporting families; he is stingy regarding gains. Monks, a resident monk endowed with these five qualities is cast into hell as if brought there directly.\n\nMonks, a resident monk endowed with five qualities is cast into heaven as if brought there directly. With which five? Having investigated and comprehended, he speaks dispraise of one who deserves dispraise; having investigated and comprehended, he speaks praise of one who deserves praise; he is not stingy regarding the monastery; he is not stingy regarding supporting families; he is not stingy regarding gains. Monks, a resident monk endowed with these five qualities is cast into heaven as if brought there directly.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙනැවිත් දමන ලද්දාක් මෙන් නිරයට යයි. කවර ධර්මයන් පහකින්ද? (1) විමසා නොබලා, හොඳින් පරීක්ෂා කර නොබලා අවවාදයට සුදුසු පුද්ගලයෙකුට ප්‍ර‌ශංසා කරයි; (2) විමසා නොබලා, හොඳින් පරීක්ෂා කර නොබලා ප්‍ර‌ශංසාවට සුදුසු පුද්ගලයෙකුට අවවාද කරයි/නින්දා කරයි; (3) ආවාසය පිළිබඳව මසුරු වෙයි; (4) කුලයන් පිළිබඳව මසුරු වෙයි; (5) ලාභයන් පිළිබඳව මසුරු වෙයි. භික්ෂූන් වහන්ස, මේ ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙනැවිත් දමන ලද්දාක් මෙන් නිරයට යයි.\n\nභික්ෂූන් වහන්ස, ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙනැවිත් දමන ලද්දාක් මෙන් ස්වර්ගයට යයි. කවර ධර්මයන් පහකින්ද? (1) විමසා බලා, හොඳින් පරීක්ෂා කර බලා අවවාදයට සුදුසු පුද්ගලයෙකුට අවවාද කරයි/නින්දා කරයි; (2) විමසා බලා, හොඳින් පරීක්ෂා කර බලා ප්‍ර‌ශංසාවට සුදුසු පුද්ගලයෙකුට ප්‍ර‌ශංසා කරයි; (3) ආවාසය පිළිබඳව මසුරු නොවෙයි; (4) කුලයන් පිළිබඳව මසුරු නොවෙයි; (5) ලාභයන් පිළිබඳව මසුරු නොවෙයි. භික්ෂූන් වහන්ස, මේ ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්ෂුවක් ගෙනැවිත් දමන ලද්දාක් මෙන් ස්වර්ගයට යයි.",
      "paliTitle": "Tatiyaavaṇṇārahasuttaṃ",
      "englishTitle": "Third Discourse on Those Deserving Dispraise",
      "sinhalaTitle": "තතිය අවණ්ණාරහ සූත්‍රය"
    },
    {
      "number": 239,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti; vaṇṇamaccharī [dhammamaccharī (ka.)] hoti; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na āvāsamaccharī hoti; na kulamaccharī hoti; na lābhamaccharī hoti; na vaṇṇamaccharī hoti; saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Navamaṃ.",
      "english": "Monks, a resident monk endowed with five qualities is destined for hell, as if already carried and placed there. Which five? He is avaricious with regard to his dwelling place; he is avaricious with regard to his supporting families; he is avaricious with regard to gains; he is jealous of the good standing or renown of others; he squanders offerings made with faith. Indeed, monks, a resident monk endowed with these five qualities is destined for hell, as if already carried and placed there.\n\nMonks, a resident monk endowed with five qualities is destined for heaven, as if already carried and placed there. Which five? He is not avaricious with regard to his dwelling place; he is not avaricious with regard to his supporting families; he is not avaricious with regard to gains; he is not jealous of the good standing or renown of others; he does not squander offerings made with faith. Indeed, monks, a resident monk endowed with these five qualities is destined for heaven, as if already carried and placed there.",
      "sinhala": "භික්ෂූනි, පඤ්ච ධර්මයන්ගෙන් සමන්වාගත වූ ආවාසික භික්ෂුව, හරියට ගෙනැවිත් දැමූවෙක් මෙන් නිරයට පැමිණේ. කවර කරුණු පහකින් ද? ආවාසය පිළිබඳ මසුරු වෙයි; කුලයන් පිළිබඳ මසුරු වෙයි; ලාභයන් පිළිබඳ මසුරු වෙයි; වර්ණය පිළිබඳ මසුරු වෙයි; ශ්‍ර‌ද්ධාවෙන් දුන් දානය විනාශ කරයි. භික්ෂූනි, මේ පඤ්ච ධර්මයන්ගෙන් සමන්වාගත වූ ආවාසික භික්ෂුව, හරියට ගෙනැවිත් දැමූවෙක් මෙන් නිරයට පැමිණේ.\n\nභික්ෂූනි, පඤ්ච ධර්මයන්ගෙන් සමන්වාගත වූ ආවාසික භික්ෂුව, හරියට ගෙනැවිත් දැමූවෙක් මෙන් ස්වර්ගයට පැමිණේ. කවර කරුණු පහකින් ද? ආවාසය පිළිබඳ මසුරු නොවේ; කුලයන් පිළිබඳ මසුරු නොවේ; ලාභයන් පිළිබඳ මසුරු නොවේ; වර්ණය පිළිබඳ මසුරු නොවේ; ශ්‍ර‌ද්ධාවෙන් දුන් දානය විනාශ නොකරයි. භික්ෂූනි, මේ පඤ්ච ධර්මයන්ගෙන් සමන්වාගත වූ ආවාසික භික්ෂුව, හරියට ගෙනැවිත් දැමූවෙක් මෙන් ස්වර්ගයට පැමිණේ.",
      "paliTitle": "Paṭhamamacchariyasuttaṃ",
      "englishTitle": "The First Discourse on Stinginess",
      "sinhalaTitle": "පළමු මච්ඡරිය සූත්‍රය"
    },
    {
      "number": 240,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti; vaṇṇamaccharī hoti; dhammamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na āvāsamaccharī hoti; na kulamaccharī hoti; na lābhamaccharī hoti; na vaṇṇamaccharī hoti; na dhammamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Dasamaṃ. ",
      "english": "Monks, a resident monk endowed with five qualities is placed in hell, just as if carried and directly deposited there. Which five? He is possessive regarding his dwelling; he is possessive regarding families; he is possessive regarding gains; he is possessive regarding his reputation; he is possessive regarding the Dhamma. Monks, a resident monk endowed with these five qualities is placed in hell, just as if carried and directly deposited there.\n\nMonks, a resident monk endowed with five qualities is placed in heaven, just as if carried and directly deposited there. Which five? He is not possessive regarding his dwelling; he is not possessive regarding families; he is not possessive regarding gains; he is not possessive regarding his reputation; he is not possessive regarding the Dhamma. Monks, a resident monk endowed with these five qualities is placed in heaven, just as if carried and directly deposited there.",
      "sinhala": "භික්‍ෂූණි, ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්‍ෂුවක් හරියට ගෙනැවිත් දැමුවාක් මෙන් නිරයට පත්වෙයි. ඒ ධර්මයන් පහ කවරේද? ආවාසය පිළිබඳව මසුරු වෙයි; කුලයන් පිළිබඳව මසුරු වෙයි; ලාභය පිළිබඳව මසුරු වෙයි; වර්ණය (ගුණකීර්තිය) පිළිබඳව මසුරු වෙයි; ධර්මය පිළිබඳව මසුරු වෙයි. භික්‍ෂූණි, මේ ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්‍ෂුවක් හරියට ගෙනැවිත් දැමුවාක් මෙන් නිරයට පත්වෙයි.\n\nභික්‍ෂූණි, ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්‍ෂුවක් හරියට ගෙනැවිත් දැමුවාක් මෙන් ස්වර්ගයට පත්වෙයි. ඒ ධර්මයන් පහ කවරේද? ආවාසය පිළිබඳව මසුරු නොවෙයි; කුලයන් පිළිබඳව මසුරු නොවෙයි; ලාභය පිළිබඳව මසුරු නොවෙයි; වර්ණය (ගුණකීර්තිය) පිළිබඳව මසුරු නොවෙයි; ධර්මය පිළිබඳව මසුරු නොවෙයි. භික්‍ෂූණි, මේ ධර්මයන් පහකින් යුක්ත වූ ආවාසික භික්‍ෂුවක් හරියට ගෙනැවිත් දැමුවාක් මෙන් ස්වර්ගයට පත්වෙයි.",
      "paliTitle": "Dutiyamacchariyasuttaṃ",
      "englishTitle": "Second Sutta on Stinginess",
      "sinhalaTitle": "දුතිය මච්ඡරිය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Āvāsikavaggo catuttho. Tassuddānaṃ – Āvāsiko piyo ca sobhano, Bahūpakāro anukampako ca; Tayo avaṇṇārahā ceva, Macchariyā duvepi cāti [yathābhataṃ cāpi avaṇṇagedhā, catukkamacchera pañcamena cāti (sī. syā.) yathābhataṃ avaṇṇañca, catuko macchariyena cāti (ka.)].",
    "english": "The fourth chapter on Resident Monks. The summary of it: A Resident Monk, Loveable, and Beautiful, Very Helpful and Compassionate; three on those Deserving Dispraise, and two on Stinginess. [Also: Carried Away, Dispraise and Greed, four on Stinginess with a fifth.]",
    "sinhala": "සිව්වන ආවාසික වර්ගයයි. එහි උද්දානය නම්: ආවාසික, පිය, සෝභන, බහූපකාර, අනුකම්පක, අවණ්ණාරහ සූත්‍ර තුනක් සහ මච්ඡරිය සූත්‍ර දෙකකි."
  }
}