{
  "id": "an5.12",
  "title": {
    "pali": "Andhakavindavaggo",
    "english": "The Andhakavinda Chapter",
    "sinhala": "අන්ධකවින්ද වර්ගය"
  },
  "sections": [
    {
      "number": 111,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato kulūpako bhikkhu kulesu appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi pañcahi? Asanthavavissāsī [asanthutavissāsī (sī.), asandhavavissāsī (ka.)] ca hoti, anissaravikappī ca, vissaṭṭhupasevī [viyatthupasevī (sī.), byatthupasevī (syā. kaṃ.), vyattūpasevī (pī.)] ca, upakaṇṇakajappī ca, atiyācanako ca. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato kulūpako bhikkhu kulesu appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato kulūpako bhikkhu kulesu piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Na asanthavavissāsī ca hoti, na anissaravikappī ca, na vissaṭṭhupasevī ca, na upakaṇṇakajappī ca, na atiyācanako ca. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato kulūpako bhikkhu kulesu piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Paṭhamaṃ.",
      "english": "Monks, a monk who frequents households, endowed with five qualities, becomes unloved, disagreeable, unrespected, and unesteemed by families. Which five? He becomes overly familiar and presumptuous, makes arbitrary and inconsiderate choices, behaves without proper restraint, is a whisperer or gossiper, and is excessively importunate in his requests. Indeed, Monks, a monk who frequents households, endowed with these five qualities, becomes unloved, disagreeable, unrespected, and unesteemed by families.\n\nMonks, a monk who frequents households, endowed with five qualities, becomes loved, agreeable, respected, and esteemed by families. Which five? He is not overly familiar and presumptuous, does not make arbitrary and inconsiderate choices, does not behave without proper restraint, is not a whisperer or gossiper, and is not excessively importunate in his requests. Indeed, Monks, a monk who frequents households, endowed with these five qualities, becomes loved, agreeable, respected, and esteemed by families.",
      "sinhala": "භික්ෂූනි, කරුණු පහකින් යුක්තවූ ගිහි ගෙවල්වලට නිතර යන භික්ෂුවක් ගිහි ගෙවල්වලට අප්‍රි‍යද වේ, අමනාපද වේ, ගරු නොකරන ලද්දේද වේ, බුහුමන් නොකටයුත්තේද වේ. කවර කරුණු පහකින්ද? අධික ලෙස හිතවත් වී නොසැලකිලිමත් වනසුලුද වේ, අයිතියක් නොමැතිව තීරණ ගන්නා හෝ යමක් අපේක්ෂා කරන සුලුද වේ, අශික්ෂිත ලෙස හැසිරෙන සුලුද වේ, කනට කර රහස් කතා කියන සුලුද වේ, අධික ලෙස යමක් අයදින සුලුද වේ. භික්ෂූනි, මේ කරුණු පහෙන් යුක්තවූ ගිහි ගෙවල්වලට නිතර යන භික්ෂුවක් ගිහි ගෙවල්වලට අප්‍රි‍යද වේ, අමනාපද වේ, ගරු නොකරන ලද්දේද වේ, බුහුමන් නොකටයුත්තේද වේ.\n\nභික්ෂූනි, කරුණු පහකින් යුක්තවූ ගිහි ගෙවල්වලට නිතර යන භික්ෂුවක් ගිහි ගෙවල්වලට ප්‍රි‍යද වේ, මනාපද වේ, ගරු කරන ලද්දේද වේ, බුහුමන් කටයුත්තේද වේ. කවර කරුණු පහකින්ද? අධික ලෙස හිතවත් වී නොසැලකිලිමත් නොවන සුලුද වේ, අයිතියක් නොමැතිව තීරණ නොගන්නා හෝ යමක් අපේක්ෂා නොකරන සුලුද වේ, අශික්ෂිත ලෙස නොහැසිරෙන සුලුද වේ, කනට කර රහස් කතා නොකියන සුලුද වේ, අධික ලෙස යමක් නොඅයදින සුලුද වේ. භික්ෂූනි, මේ කරුණු පහෙන් යුක්තවූ ගිහි ගෙවල්වලට නිතර යන භික්ෂුවක් ගිහි ගෙවල්වලට ප්‍රි‍යද වේ, මනාපද වේ, ගරු කරන ලද්දේද වේ, බුහුමන් කටයුත්තේද වේ.",
      "paliTitle": "Kulūpakasuttaṃ",
      "englishTitle": "Discourse on the Frequenter of Families",
      "sinhalaTitle": "කුලූපක සූත්‍රය"
    },
    {
      "number": 112,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato pacchāsamaṇo na ādātabbo. Katamehi pañcahi? Atidūre vā gacchati accāsanne vā, na pattapariyāpannaṃ gaṇhati, āpattisāmantā bhaṇamānaṃ na nivāreti, bhaṇamānassa antarantarā kathaṃ opāteti, duppañño hoti jaḷo eḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato pacchāsamaṇo na ādātabbo. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato pacchāsamaṇo ādātabbo. Katamehi pañcahi? Nātidūre gacchati na accāsanne, pattapariyāpannaṃ gaṇhati, āpattisāmantā bhaṇamānaṃ nivāreti, bhaṇamānassa na antarantarā kathaṃ opāteti, paññavā hoti ajaḷo aneḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato pacchāsamaṇo ādātabbo’’ti. Dutiyaṃ.",
      "english": "Monks, an attendant monk endowed with five qualities should not be accepted. Which five? He goes either too far or too near; he does not properly manage the alms received in the bowl; he does not prevent someone from speaking about an offense nearby; he interrupts one who is speaking; and he is foolish, dull, and inarticulate. Monks, an attendant monk endowed with these five qualities should not be accepted.\n\nMonks, an attendant monk endowed with five qualities should be accepted. Which five? He goes neither too far nor too near; he properly manages the alms received in the bowl; he prevents someone from speaking about an offense nearby; he does not interrupt one who is speaking; and he is wise, not dull, and not inarticulate. Monks, an attendant monk endowed with these five qualities should be accepted.",
      "sinhala": "මහණෙනි, කරුණු පසකින් යුක්ත වූ පසුපස යන භික්ෂුව පිළිගත යුතු නොවේ. ඒ පස කුමක්ද?\n\nඔහු අධික දුරින් හෝ යයි, අධික ළඟින් හෝ යයි; පාත්‍රයට සුදුසු දේ නොගනී; යමෙක් ආපත්තියකට සමීප වන අයුරින් කතා කරන්නේ නම්, ඔහුව එයින් වළක්වන්නේ නැත; කතා කරන කෙනාගේ කතාවට අතරින් පතර බාධා කරයි; දුෂ්ප්‍රඥයෙක් වේ, ජඩයෙක් වේ, ගොළුවෙක් වේ. මහණෙනි, මේ පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ පසුපස යන භික්ෂුව පිළිගත යුතු නොවේ.\n\nමහණෙනි, කරුණු පසකින් යුක්ත වූ පසුපස යන භික්ෂුව පිළිගත යුතු වේ. ඒ පස කුමක්ද?\n\nඔහු අධික දුරින් හෝ නොයයි, අධික ළඟින් හෝ නොයයි; පාත්‍රයට සුදුසු දේ ගනී; යමෙක් ආපත්තියකට සමීප වන අයුරින් කතා කරන්නේ නම්, ඔහුව එයින් වළක්වයි; කතා කරන කෙනාගේ කතාවට අතරින් පතර බාධා නොකරයි; ප්‍රඥාවන්තයෙක් වේ, අජඩයෙක් වේ, අගොළුවෙක් වේ. මහණෙනි, මේ පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ පසුපස යන භික්ෂුව පිළිගත යුතු වේ.",
      "paliTitle": "Pacchāsamaṇasuttaṃ",
      "englishTitle": "The Discourse on the Attendant Monk",
      "sinhalaTitle": "පච්ඡාසමණ සූත්‍රය"
    },
    {
      "number": 113,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu abhabbo sammāsamādhiṃ upasampajja viharituṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu akkhamo hoti rūpānaṃ, akkhamo saddānaṃ, akkhamo gandhānaṃ, akkhamo rasānaṃ, akkhamo phoṭṭhabbānaṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu abhabbo sammāsamādhiṃ upasampajja viharituṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo sammāsamādhiṃ upasampajja viharituṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu khamo hoti rūpānaṃ, khamo saddānaṃ, khamo gandhānaṃ, khamo rasānaṃ, khamo phoṭṭhabbānaṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu bhabbo sammāsamādhiṃ upasampajja viharitu’’nti. Tatiyaṃ.",
      "english": "Monks, a monk endowed with five qualities is incapable of entering upon and abiding in right concentration. Which five? Here, monks, a monk is impatient with forms, impatient with sounds, impatient with odors, impatient with tastes, impatient with tactile sensations. Monks, a monk endowed with these five qualities is indeed incapable of entering upon and abiding in right concentration.\n\nMonks, a monk endowed with five qualities is capable of entering upon and abiding in right concentration. Which five? Here, monks, a monk is patient with forms, patient with sounds, patient with odors, patient with tastes, patient with tactile sensations. Monks, a monk endowed with these five qualities is indeed capable of entering upon and abiding in right concentration.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්ම පහකින් යුත් භික්ෂුවක් සම්මා සමාධියට එළඹ වාසය කිරීමට නොහැකි වෙයි. ඒ කවර ධර්ම පහකින්ද? මෙහිදී භික්ෂූන් වහන්ස, භික්ෂුව රූපයන්ට නොඉවසන සුළු වෙයි, ශබ්දයන්ට නොඉවසන සුළු වෙයි, ගන්ධයන්ට නොඉවසන සුළු වෙයි, රසයන්ට නොඉවසන සුළු වෙයි, ස්පර්ශයන්ට නොඉවසන සුළු වෙයි. භික්ෂූන් වහන්ස, මේ ධර්ම පහකින් යුත් භික්ෂුවක් සම්මා සමාධියට එළඹ වාසය කිරීමට නොහැකි වෙයි.\n\nභික්ෂූන් වහන්ස, ධර්ම පහකින් යුත් භික්ෂුවක් සම්මා සමාධියට එළඹ වාසය කිරීමට සමත් වෙයි. ඒ කවර ධර්ම පහකින්ද? මෙහිදී භික්ෂූන් වහන්ස, භික්ෂුව රූපයන්ට ඉවසන සුළු වෙයි, ශබ්දයන්ට ඉවසන සුළු වෙයි, ගන්ධයන්ට ඉවසන සුළු වෙයි, රසයන්ට ඉවසන සුළු වෙයි, ස්පර්ශයන්ට ඉවසන සුළු වෙයි. භික්ෂූන් වහන්ස, මේ ධර්ම පහකින් යුත් භික්ෂුවක් සම්මා සමාධියට එළඹ වාසය කිරීමට සමත් වෙයි.",
      "paliTitle": "Sammāsamādhisuttaṃ",
      "englishTitle": "Right Concentration Sutta",
      "sinhalaTitle": "සම‍්මා සමාධි සූත‍්‍රය"
    },
    {
      "number": 114,
      "pali": "Ekaṃ samayaṃ bhagavā magadhesu viharati andhakavinde. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘Ye te, ānanda, bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ, te vo, ānanda, bhikkhū pañcasu dhammesu samādapetabbā [samādāpetabbā (?)] nivesetabbā patiṭṭhāpetabbā. Katamesu pañcasu? ‘Etha tumhe, āvuso, sīlavā hotha, pātimokkhasaṃvarasaṃvutā viharatha ācāragocarasampannā aṇumattesu vajjesu bhayadassāvino, samādāya sikkhatha sikkhāpadesū’ti – iti pātimokkhasaṃvare samādapetabbā nivesetabbā patiṭṭhāpetabbā. ‘‘‘Etha tumhe, āvuso, indriyesu guttadvārā viharatha ārakkhasatino nipakkasatino [nipakasatino (sī. syā.), nepakkasatino (?)], sārakkhitamānasā satārakkhena cetasā samannāgatā’ti – iti indriyasaṃvare samādapetabbā nivesetabbā patiṭṭhāpetabbā. ‘‘‘Etha tumhe, āvuso, appabhassā hotha, bhasse pariyantakārino’ti – iti bhassapariyante samādapetabbā nivesetabbā patiṭṭhāpetabbā. ‘‘‘Etha tumhe, āvuso, āraññikā hotha, araññavanapatthāni pantāni senāsanāni paṭisevathā’ti – iti kāyavūpakāse samādapetabbā nivesetabbā patiṭṭhāpetabbā. ‘‘‘Etha tumhe, āvuso, sammādiṭṭhikā hotha sammādassanena samannāgatā’ti – iti sammādassane samādapetabbā nivesetabbā patiṭṭhāpetabbā. Ye te, ānanda, bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ, te vo, ānanda, bhikkhū imesu pañcasu dhammesu samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Catutthaṃ.",
      "english": "At one time, the Blessed One was dwelling among the Magadhans in Andhakavinda. Then, the Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. As the Venerable Ānanda sat to one side, the Blessed One said this to him:\n\n“Ānanda, those monks who are new, recently gone forth, just come to this Teaching and Discipline – those monks, Ānanda, should be exhorted, established, and settled in these five principles. In which five?\n\n“‘Come, friends, be virtuous; dwell restrained by the Pātimokkha's discipline, perfected in conduct and resort, seeing danger even in the slightest faults, undertaking and training in the training rules’ – in this way, they should be exhorted, established, and settled in the Pātimokkha's discipline.\n\n“‘Come, friends, dwell with the doors of your senses guarded, possessing mindfulness that protects and mature discernment, with a mind well-guarded, endowed with a mind protected by mindfulness’ – in this way, they should be exhorted, established, and settled in the discipline of the senses.\n\n“‘Come, friends, be of few words, setting a limit to your talk’ – in this way, they should be exhorted, established, and settled in limiting talk.\n\n“‘Come, friends, be forest dwellers, resort to remote forest and wilderness abodes’ – in this way, they should be exhorted, established, and settled in physical seclusion.\n\n“‘Come, friends, be possessed of right view, endowed with right understanding’ – in this way, they should be exhorted, established, and settled in right understanding. Ānanda, those monks who are new, recently gone forth, just come to this Teaching and Discipline – those monks, Ānanda, should be exhorted, established, and settled in these five principles.”",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මගධයෙහි අන්ධකවින්ද නම් ගමෙහි වැඩසිටින සේක.\n\nඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹුණේය; එළඹ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙක වැඩසිටියේය.\n\nඑකත්පසෙක වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"ආනන්දය, මේ ධර්මවිනයට අලුතින් පැමිණ, නොබෝ කලකට පෙර පැවිදි වූ යම් භික්ෂූහු වෙත්ද, ආනන්දය, ඒ භික්ෂූන් වහන්සේලා පස් දහම්හි සමාදන් කරවිය යුතුය, පිහිටුවිය යුතුය, තහවුරු කළ යුතුය.\n\nකවර පස් දහම්හිද?\n\n‘ඇවැත්නි, තෙපි සිල්වත් වව්, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූවෝ වව්, ආචාර ගෝචර සම්පන්න වව්, අල්ප මාත්‍ර වූ වරදෙහිද භය දක්නෝ වව්, ශික්ෂා පදයන් සමාදන්ව හික්මෙව්’යි මෙසේ ප්‍රාතිමෝක්ෂ සංවරයෙහි සමාදන් කරවිය යුතුය, පිහිටුවිය යුතුය, තහවුරු කළ යුතුය.\n\n‘ඇවැත්නි, තෙපි ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර ඇත්තෝව වාසය කරව්, ආරක්‍ෂා කරන සිහියෙන් යුක්ත වව්, ප්‍රඥාවෙන් යුක්ත වව්, ආරක්ෂා කරන ලද සිත් ඇත්තෝව, සිහි ආරක්‍ෂා කරන ලද සිත් ඇත්තෝව වාසය කරව්’යි මෙසේ ඉන්ද්‍රිය සංවරයෙහි සමාදන් කරවිය යුතුය, පිහිටුවිය යුතුය, තහවුරු කළ යුතුය.\n\n‘ඇවැත්නි, තෙපි ස්වල්ප කතා ඇත්තෝ වව්, කතාවෙහි සීමා කරන ලදුවෝ වව්’යි මෙසේ කතාවෙහි සීමා කිරීමෙහි සමාදන් කරවිය යුතුය, පිහිටුවිය යුතුය, තහවුරු කළ යුතුය.\n\n‘ඇවැත්නි, තෙපි ආරණ්‍යවාසී වව්, ආරණ්‍යවනයන්හිත් ප්‍රාන්ත සේනාසනත් සේවනය කරව්’යි මෙසේ කාය වූපකාසයෙහි (කාය විවේකයෙහි) සමාදන් කරවිය යුතුය, පිහිටුවිය යුතුය, තහවුරු කළ යුතුය.\n\n‘ඇවැත්නි, තෙපි සම්මා දිට්ඨික වව්, සම්මා දර්ශනයෙන් යුක්ත වව්’යි මෙසේ සම්මා දර්ශනයෙහි සමාදන් කරවිය යුතුය, පිහිටුවිය යුතුය, තහවුරු කළ යුතුය.\n\nආනන්දය, මේ ධර්මවිනයට අලුතින් පැමිණ, නොබෝ කලකට පෙර පැවිදි වූ යම් භික්ෂූහු වෙත්ද, ආනන්දය, ඒ භික්ෂූන් වහන්සේලා මේ පස් දහම්හි සමාදන් කරවිය යුතුය, පිහිටුවිය යුතුය, තහවුරු කළ යුතුය.\"",
      "paliTitle": "Andhakavindasuttaṃ",
      "englishTitle": "The Andhakavinda Sutta",
      "sinhalaTitle": "අන්‍ධකවින්ද සූත්‍‍රය"
    },
    {
      "number": 115,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. Katamehi pañcahi? Āvāsamaccharinī hoti, kulamaccharinī hoti, lābhamaccharinī hoti, vaṇṇamaccharinī hoti, dhammamaccharinī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge. Katamehi pañcahi? Na āvāsamaccharinī hoti, na kulamaccharinī hoti, na lābhamaccharinī hoti, na vaṇṇamaccharinī hoti, na dhammamaccharinī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge’’ti. Pañcamaṃ.",
      "english": "Monks, a bhikkhunī endowed with five qualities is cast into hell just as if picked up and laid down there. Which five? She is stingy regarding her dwelling, stingy regarding her supporting families, stingy regarding her gains, stingy regarding her reputation, and stingy regarding the Dhamma. Indeed, monks, a bhikkhunī endowed with these five qualities is cast into hell just as if picked up and laid down there.\n\nMonks, a bhikkhunī endowed with five qualities is cast into heaven just as if picked up and laid down there. Which five? She is not stingy regarding her dwelling, not stingy regarding her supporting families, not stingy regarding her gains, not stingy regarding her reputation, and not stingy regarding the Dhamma. Indeed, monks, a bhikkhunī endowed with these five qualities is cast into heaven just as if picked up and laid down there.",
      "sinhala": "භික්ෂූනි, ධර්මයන් පහකින් යුත් භික්ෂුණියක් නිරයටම ඇද දමනු ලබන්නීය. ඒ කවර පහකින්ද යත්: ඇය ආවාස මසුරුකම් ඇත්තී වේ. කුල මසුරුකම් ඇත්තී වේ. ලාභ මසුරුකම් ඇත්තී වේ. වර්ණ මසුරුකම් ඇත්තී වේ. ධර්ම මසුරුකම් ඇත්තී වේ. භික්ෂූනි, මේ ධර්මයන් පසින් යුත් භික්ෂුණියක් නිරයටම ඇද දමනු ලබන්නීය.\n\nභික්ෂූනි, ධර්මයන් පහකින් යුත් භික්ෂුණියක් ස්වර්ගයටම ඇද දමනු ලබන්නීය. ඒ කවර පහකින්ද යත්: ඇය ආවාස මසුරුකම් නැත්තී වේ. කුල මසුරුකම් නැත්තී වේ. ලාභ මසුරුකම් නැත්තී වේ. වර්ණ මසුරුකම් නැත්තී වේ. ධර්ම මසුරුකම් නැත්තී වේ. භික්ෂූනි, මේ ධර්මයන් පසින් යුත් භික්ෂුණියක් ස්වර්ගයටම ඇද දමනු ලබන්නීය.",
      "paliTitle": "Maccharinīsuttaṃ",
      "englishTitle": "Discourse on the Miserly Woman",
      "sinhalaTitle": "මසුරු ස්ත්‍රී සූත්‍රය"
    },
    {
      "number": 116,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā appasādanīye ṭhāne pasādaṃ upadaṃseti, ananuvicca apariyogāhetvā pasādanīye ṭhāne appasādaṃ upadaṃseti, saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati, anuvicca pariyogāhetvā appasādanīye ṭhāne appasādaṃ upadaṃseti, anuvicca pariyogāhetvā pasādanīye ṭhāne pasādaṃ upadaṃseti, saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, a nun endowed with five qualities is, as if she were picked up and placed, indeed in hell. Which five? Without investigating and without thoroughly analyzing, she speaks praise of one who deserves dispraise; without investigating and without thoroughly analyzing, she speaks dispraise of one who deserves praise; without investigating and without thoroughly analyzing, she displays confidence in a situation that is not inspiring of confidence; without investigating and without thoroughly analyzing, she displays lack of confidence in a situation that is inspiring of confidence; and she squanders donations made with faith. Indeed, bhikkhus, a nun endowed with these five qualities is, as if she were picked up and placed, indeed in hell.\n\nBhikkhus, a nun endowed with five qualities is, as if she were picked up and placed, indeed in heaven. Which five? Having investigated and having thoroughly analyzed, she speaks dispraise of one who deserves dispraise; having investigated and having thoroughly analyzed, she speaks praise of one who deserves praise; having investigated and having thoroughly analyzed, she displays lack of confidence in a situation that is not inspiring of confidence; having investigated and having thoroughly analyzed, she displays confidence in a situation that is inspiring of confidence; and she does not squander donations made with faith. Indeed, bhikkhus, a nun endowed with these five qualities is, as if she were picked up and placed, indeed in heaven.",
      "sinhala": "භික්ෂූනි, කරුණු පහකින් යුක්ත වූ භික්ෂුණියක් හරියට ගෙන ගොස් දැමුවාක් මෙන් නිරයට පත් වේ. ඒ කරුණු පහ කවරේද? හොඳින් විමසා නොබලා, අවබෝධ කර නොගෙන නින්දාවට සුදුසු අයකුට ප්‍රශංසා කරයි. හොඳින් විමසා නොබලා, අවබෝධ කර නොගෙන ප්‍රශංසාවට සුදුසු අයකුට නින්දා කරයි. හොඳින් විමසා නොබලා, අවබෝධ කර නොගෙන පැහැදීමට නුසුදුසු තැනක පැහැදීම උපදවයි. හොඳින් විමසා නොබලා, අවබෝධ කර නොගෙන පැහැදීමට සුදුසු තැනක අපැහැදීම උපදවයි. ශ්‍රද්ධාවෙන් දුන් දානය අපතේ හරියි. භික්ෂූනි, මේ කරුණු පහකින් යුක්ත වූ භික්ෂුණිය හරියට ගෙන ගොස් දැමුවාක් මෙන් නිරයට පත් වේ.\n\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භික්ෂුණියක් හරියට ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයට පත් වේ. ඒ කරුණු පහ කවරේද? හොඳින් විමසා බලා, අවබෝධ කරගෙන නින්දාවට සුදුසු අයකුට නින්දා කරයි. හොඳින් විමසා බලා, අවබෝධ කරගෙන ප්‍රශංසාවට සුදුසු අයකුට ප්‍රශංසා කරයි. හොඳින් විමසා බලා, අවබෝධ කරගෙන පැහැදීමට නුසුදුසු තැනක අපැහැදීම උපදවයි. හොඳින් විමසා බලා, අවබෝධ කරගෙන පැහැදීමට සුදුසු තැනක පැහැදීම උපදවයි. ශ්‍රද්ධාවෙන් දුන් දානය අපතේ නොහරියි. භික්ෂූනි, මේ කරුණු පහකින් යුක්ත වූ භික්ෂුණිය හරියට ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයට පත් වේ.",
      "paliTitle": "Vaṇṇanāsuttaṃ",
      "englishTitle": "Discourse on Description",
      "sinhalaTitle": "වණ්ණනා සූත්‍රය"
    },
    {
      "number": 117,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati, issukinī ca hoti, maccharinī ca, saddhādeyyaṃ [saddhādeyyañca (syā.)] vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati, anissukinī ca hoti, amaccharinī ca, saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge’’ti. Sattamaṃ.",
      "english": "Monks, a nun endowed with five qualities is irrevocably destined for hell, as if already deposited there. Which five? Without proper investigation and thorough scrutiny, she speaks praise of one who is not worthy of praise; without proper investigation and thorough scrutiny, she speaks dispraise of one who is worthy of praise; she is also envious; she is also stingy; and she squanders offerings given in faith. Indeed, monks, a nun endowed with these five qualities is irrevocably destined for hell, as if already deposited there.\n\nMonks, a nun endowed with five qualities is irrevocably destined for heaven, as if already deposited there. Which five? Having properly investigated and thoroughly scrutinized, she speaks dispraise of one who is not worthy of praise; having properly investigated and thoroughly scrutinized, she speaks praise of one who is worthy of praise; she is also not envious; she is also not stingy; and she does not squander offerings given in faith. Indeed, monks, a nun endowed with these five qualities is irrevocably destined for heaven, as if already deposited there.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් දහමින් සමන්වාගත වූ භික්ෂුණියක්, යම්සේ ගෙනවිත් බහා තබන ලද්දී මෙන් නිරයට පැමිණේ. කවර පස් වැදෑරුම් දහමකින් ද? හොඳින් විමසා නොබලා, හොඳින් විමර්ශනය නොකර, නින්දාවට සුදුසු තැනැත්තෙකු වර්ණනා කරයි. හොඳින් විමසා නොබලා, හොඳින් විමර්ශනය නොකර, ප්‍රශංසාවට සුදුසු තැනැත්තෙකුට නින්දා කරයි. ඊර්ෂ්‍යා සහගත වන්නී ය. මසුරු වන්නී ය. සැදැහැවතුන්ගේ ශ්‍රද්ධාවෙන් දුන් දානය නිෂ්ඵල කරයි. මහණෙනි, මේ පස් වැදෑරුම් දහමින් සමන්වාගත වූ භික්ෂුණියක් යම්සේ ගෙනවිත් බහා තබන ලද්දී මෙන් නිරයට පැමිණේ.\n\nමහණෙනි, පස් වැදෑරුම් දහමින් සමන්වාගත වූ භික්ෂුණියක්, යම්සේ ගෙනවිත් බහා තබන ලද්දී මෙන් ස්වර්ගයට පැමිණේ. කවර පස් වැදෑරුම් දහමකින් ද? හොඳින් විමසා බලා, හොඳින් විමර්ශනය කර, නින්දාවට සුදුසු තැනැත්තෙකුට නින්දා කරයි. හොඳින් විමසා බලා, හොඳින් විමර්ශනය කර, ප්‍රශංසාවට සුදුසු තැනැත්තෙකු වර්ණනා කරයි. ඊර්ෂ්‍යා රහිත වන්නී ය. අමසුරු වන්නී ය. සැදැහැවතුන්ගේ ශ්‍රද්ධාවෙන් දුන් දානය නිෂ්ඵල නොකරයි. මහණෙනි, මේ පස් වැදෑරුම් දහමින් සමන්වාගත වූ භික්ෂුණියක් යම්සේ ගෙනවිත් බහා තබන ලද්දී මෙන් ස්වර්ගයට පැමිණේ.",
      "paliTitle": "Issukinīsuttaṃ",
      "englishTitle": "Discourse on the Envious Woman",
      "sinhalaTitle": "ඉස්සූකිනී සූත්‍ර‍ය"
    },
    {
      "number": 118,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati, micchādiṭṭhikā ca hoti, micchāsaṅkappā ca, saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati, sammādiṭṭhikā ca, hoti, sammāsaṅkappā ca, saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a nun endowed with five qualities is deposited into hell, just as if she were carried there. What five? Without investigating or examining, she speaks praise of one who deserves blame; without investigating or examining, she speaks blame of one who deserves praise; she has wrong view; she has wrong intention; and she squanders faith-offerings. Monks, a nun endowed with these five qualities is deposited into hell, just as if she were carried there.\n\nMonks, a nun endowed with five qualities is deposited into heaven, just as if she were carried there. What five? Having investigated and examined, she speaks blame of one who deserves blame; having investigated and examined, she speaks praise of one who deserves praise; she has right view; she has right intention; and she does not squander faith-offerings. Monks, a nun endowed with these five qualities is deposited into heaven, just as if she were carried there.",
      "sinhala": "භික්ෂූන් වහන්ස, කරුණු පසකින් යුක්ත භික්ෂුණියක්, යම්සේ ගෙනගොස් නිරයේ හෙළා තිබෙන්නීද, එසේම නිරයට පත්වන්නීය. ඒ කවර පසකින් ද? නොවිමසා, නොසොයා බලා, නින්දාවට සුදුසු කෙනෙකුට ප්‍රශංසා කරයි. නොවිමසා, නොසොයා බලා, ප්‍රශංසාවට සුදුසු කෙනෙකුට නින්දා කරයි. වැරදි දැක්මක් (මිථ්‍යාදෘෂ්ටියක්) ඇත්තී ද වෙයි. වැරදි සිතුවිලි (මිථ්‍යාසංකල්ප) ඇත්තී ද වෙයි. ශ්‍රද්ධාවෙන් දෙන ලද දෙය විනාශ කරයි. භික්ෂූන් වහන්ස, මේ පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුණිය, යම්සේ ගෙනගොස් නිරයේ හෙළා තිබෙන්නීද, එසේම නිරයට පත්වන්නීය.\n\nභික්ෂූන් වහන්ස, කරුණු පසකින් යුක්ත භික්ෂුණියක්, යම්සේ ගෙනගොස් ස්වර්ගයේ හෙළා තිබෙන්නීද, එසේම ස්වර්ගයට පත්වන්නීය. ඒ කවර පසකින් ද? විමසා, සොයා බලා, නින්දාවට සුදුසු කෙනෙකුට නින්දා කරයි. විමසා, සොයා බලා, ප්‍රශංසාවට සුදුසු කෙනෙකුට ප්‍රශංසා කරයි. නිවැරදි දැක්මක් (සම්මාදිට්ඨියක්) ඇත්තී ද වෙයි. නිවැරදි සිතුවිලි (සම්මාසංකල්ප) ඇත්තී ද වෙයි. ශ්‍රද්ධාවෙන් දෙන ලද දෙය විනාශ නොකරයි. භික්ෂූන් වහන්ස, මේ පස් ආකාර ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුණිය, යම්සේ ගෙනගොස් ස්වර්ගයේ හෙළා තිබෙන්නීද, එසේම ස්වර්ගයට පත්වන්නීය.",
      "paliTitle": "Micchādiṭṭhikasuttaṃ",
      "englishTitle": "Discourse on Wrong-View Holders",
      "sinhalaTitle": "මිථ්‍යාදෘෂ්ටික සූත්‍රය"
    },
    {
      "number": 119,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati, micchāvācā ca hoti, micchākammantā ca, saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati, sammāvācā ca hoti, sammākammantā ca, saddhādeyyaṃ na vinipāteti. Imehi kho bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge’’ti. Navamaṃ.",
      "english": "Monks, a bhikkhunī endowed with five qualities is directly consigned to hell, as if carried there. Which five? Without proper investigation or thorough examination, she speaks praise of one who is unworthy of praise; without proper investigation or thorough examination, she speaks dispraise of one who is worthy of praise; her speech is wrong; her actions are wrong; and she squanders offerings made with faith. Indeed, monks, a bhikkhunī endowed with these five qualities is directly consigned to hell, as if carried there.\n\nMonks, a bhikkhunī endowed with five qualities is directly consigned to heaven, as if carried there. Which five? With proper investigation and thorough examination, she speaks dispraise of one who is unworthy of praise; with proper investigation and thorough examination, she speaks praise of one who is worthy of praise; her speech is right; her actions are right; and she does not squander offerings made with faith. Indeed, monks, a bhikkhunī endowed with these five qualities is directly consigned to heaven, as if carried there.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත භික්ෂුණියක් යම් සේ ගෙන ගොස් දැමුවාක් මෙන් නිරයට පත් වෙයි. ඒ කවර කරුණු පහකින්ද යත්? නොසොයා, නොපිරික්සා, ගරහන ලද්දෙකුට ප්‍රශංසා කරයි; නොසොයා, නොපිරික්සා, ප්‍රශංසා ලද්දෙකුට ගරහයි; මිථ්‍යා වාචා ඇත්තී ද වෙයි; මිථ්‍යා කර්මාන්ත ඇත්තී ද වෙයි; ශ්‍රද්ධා දානය විනාශ කරයි. මහණෙනි, මේ කරුණු පහෙන් යුක්ත භික්ෂුණිය යම් සේ ගෙන ගොස් දැමුවාක් මෙන් නිරයට පත් වෙයි.\n\nමහණෙනි, කරුණු පහකින් යුක්ත භික්ෂුණියක් යම් සේ ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයට පත් වෙයි. ඒ කවර කරුණු පහකින්ද යත්? සොයා, පිරික්සා, ගරහන ලද්දෙකුට ගරහයි; සොයා, පිරික්සා, ප්‍රශංසා ලද්දෙකුට ප්‍රශංසා කරයි; සම්මා වාචා ඇත්තී ද වෙයි; සම්මා කර්මාන්ත ඇත්තී ද වෙයි; ශ්‍රද්ධා දානය විනාශ නොකරයි. මහණෙනි, මේ කරුණු පහෙන් යුක්ත භික්ෂුණිය යම් සේ ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයට පත් වෙයි.",
      "paliTitle": "Micchāvācāsuttaṃ",
      "englishTitle": "Discourse on Wrong Speech",
      "sinhalaTitle": "මිත්‍යා වාචා සූත්‍රය"
    },
    {
      "number": 120,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati, micchāvāyāmā ca hoti, micchāsatinī ca [micchāsati ca (syā.)], saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati, sammāvāyāmā ca hoti, sammāsatinī ca, saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā bhikkhunī yathābhataṃ nikkhittā evaṃ sagge’’ti. Dasamaṃ. ",
      "english": "Monks, a nun endowed with these five qualities is cast into hell as if carried there and laid down. What are these five? Without having investigated and thoroughly examined, she praises that which deserves dispraise; without having investigated and thoroughly examined, she dispraises that which deserves praise; she has wrong effort; she has wrong mindfulness; and she squanders faith-offerings. Indeed, monks, a nun endowed with these five qualities is cast into hell as if carried there and laid down.\n\nMonks, a nun endowed with these five qualities is cast into heaven as if carried there and laid down. What are these five? Having investigated and thoroughly examined, she dispraises that which deserves dispraise; having investigated and thoroughly examined, she praises that which deserves praise; she has right effort; she has right mindfulness; and she does not squander faith-offerings. Indeed, monks, a nun endowed with these five qualities is cast into heaven as if carried there and laid down.",
      "sinhala": "මහණෙනි, පංච ධර්‍මයන්ගෙන් සමන්වාගත වූ භික්ෂුණියක් කෙලින්ම නිරයටම පත්කරනු ලබයි. කවර පසකින් ද? නොවිමසා, නොපරීක්ෂා කොට, නින්දා ලැබිය යුතු අයෙකුට ප්‍ර‌ශංසා කරයි. නොවිමසා, නොපරීක්ෂා කොට, ප්‍ර‌ශංසා ලැබිය යුතු අයෙකුට නින්දා කරයි. මිථ්‍යා ව්‍යායාම ඇත්තියක් ද වෙයි. මිථ්‍යා සතිය ඇත්තියක් ද වෙයි. ශ්‍ර‌ද්ධා දායාදයන් අපතේ යවයි. මහණෙනි, මේ පංච ධර්‍මයන්ගෙන් සමන්වාගත වූ භික්ෂුණියක් කෙලින්ම නිරයටම පත්කරනු ලබයි.\n\nමහණෙනි, පංච ධර්‍මයන්ගෙන් සමන්වාගත වූ භික්ෂුණියක් කෙලින්ම ස්වර්ගයටම පත්කරනු ලබයි. කවර පසකින් ද? විමසා, පරීක්ෂා කොට, නින්දා ලැබිය යුතු අයෙකුට නින්දා කරයි. විමසා, පරීක්ෂා කොට, ප්‍ර‌ශංසා ලැබිය යුතු අයෙකුට ප්‍ර‌ශංසා කරයි. සම්මා ව්‍යායාම ඇත්තියක් ද වෙයි. සම්මා සතිය ඇත්තියක් ද වෙයි. ශ්‍ර‌ද්ධා දායාදයන් අපතේ නොයවයි. මහණෙනි, මේ පංච ධර්‍මයන්ගෙන් සමන්වාගත වූ භික්ෂුණියක් කෙලින්ම ස්වර්ගයටම පත්කරනු ලබයි.",
      "paliTitle": "Micchāvāyāmasuttaṃ",
      "englishTitle": "Discourse on Wrong Effort",
      "sinhalaTitle": "මිච්ඡාව්‍යායාම සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Andhakavindavaggo dutiyo. Tassuddānaṃ – Kulūpako pacchāsamaṇo, samādhiandhakavindaṃ; Maccharī vaṇṇanā issā, diṭṭhivācāya vāyamāti.",
    "english": "The Second Andhakavinda Chapter",
    "sinhala": "අන‍්‌ධකවින‍්‌ද වර‍්‌ගය දෙවන"
  }
}