{
  "id": "an5.10",
  "title": {
    "pali": "Kakudhavaggo",
    "english": "The Chapter on Kakudha",
    "sinhala": "කකුධ වග්ගය"
  },
  "sections": [
    {
      "number": 91,
      "pali": "‘‘Pañcimā, bhikkhave, sampadā. Katamā pañca? Saddhāsampadā, sīlasampadā, sutasampadā, cāgasampadā, paññāsampadā – imā kho, bhikkhave, pañca sampadā’’ti. Paṭhamaṃ.",
      "english": "Monks, these are the five accomplishments. Which five? The accomplishment of faith, the accomplishment of virtue, the accomplishment of learning, the accomplishment of generosity, and the accomplishment of wisdom – indeed, monks, these are the five accomplishments.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ සම්පදා පසකි. කවර පසක්ද යත්: ශ්‍රද්ධාසම්පදාව, ශීලසම්පදාව, සුතසම්පදාව, ත්‍යාගසම්පදාව, ප්‍රඥාසම්පදාවයි. භික්ෂූන් වහන්ස, මේවාමයි ඒ සම්පදා පස.",
      "paliTitle": "Paṭhamasampadāsuttaṃ",
      "englishTitle": "The First Achievement Discourse",
      "sinhalaTitle": "ප්‍රථම සම්පදා සූත්‍රය"
    },
    {
      "number": 92,
      "pali": "‘‘Pañcimā, bhikkhave, sampadā. Katamā pañca? Sīlasampadā, samādhisampadā, paññāsampadā, vimuttisampadā, vimuttiñāṇadassanasampadā – imā kho, bhikkhave, pañca sampadā’’ti. Dutiyaṃ.",
      "english": "Monks, there are these five accomplishments. Which five? The accomplishment of virtue, the accomplishment of concentration, the accomplishment of wisdom, the accomplishment of liberation, and the accomplishment of the knowledge and vision of liberation. These, monks, are the five accomplishments.",
      "sinhala": "මහණෙනි, මේ සම්පදා පසකි. කවරවාද මේ පස? සීල සම්පදාව, සමාධි සම්පදාව, ප‍්‍රඥා සම්පදාව, විමුක්ති සම්පදාව, විමුක්ති ඥාණදර්ශන සම්පදාවයි. මහණෙනි, මේ සම්පදා පසයි.",
      "paliTitle": "Dutiyasampadāsuttaṃ",
      "englishTitle": "The Second Accomplishment Sutta",
      "sinhalaTitle": "දෙවන සම්පදා සූත්‍රය"
    },
    {
      "number": 93,
      "pali": "‘‘Pañcimāni, bhikkhave, aññābyākaraṇāni. Katamāni pañca? Mandattā momūhattā aññaṃ byākaroti; pāpiccho icchāpakato aññaṃ byākaroti; ummādā cittakkhepā aññaṃ byākaroti; adhimānena aññaṃ byākaroti; sammadeva aññaṃ byākaroti. Imāni kho, bhikkhave, pañca aññābyākaraṇānī’’ti. Tatiyaṃ.",
      "english": "Monks, there are these five declarations of final knowledge. Which five? One makes a declaration of final knowledge due to dullness and delusion; one makes a declaration of final knowledge out of evil desires, overwhelmed by craving; one makes a declaration of final knowledge due to madness and mental derangement; one makes a declaration of final knowledge due to conceit; and one makes a declaration of final knowledge truly and rightly. Indeed, monks, these are the five declarations of final knowledge.",
      "sinhala": "මහණෙනි, අඤ්ඤාව ප්‍රකාශ කිරීම් මේ පසෙකි. කවරේද ඒ පස? මන්දබුද්ධිභාවය නිසාත්, මෝමූහබව නිසාත් අඤ්ඤාව ප්‍රකාශ කරයි. පාපී කැමැත්තක් ඇති නිසාත්, දැඩි ආශාවන්ගෙන් පෙලී සිටින නිසාත් අඤ්ඤාව ප්‍රකාශ කරයි. උමතු බව නිසාත්, චිත්තක්ෂේපය නිසාත් අඤ්ඤාව ප්‍රකාශ කරයි. අධිමානය නිසා අඤ්ඤාව ප්‍රකාශ කරයි. යථාර්ථ වශයෙන්ම අඤ්ඤාව ප්‍රකාශ කරයි. මහණෙනි, අඤ්ඤාව ප්‍රකාශ කිරීම් මේ පස මේවාම ය.",
      "paliTitle": "Byākaraṇasuttaṃ",
      "englishTitle": "The Exposition Discourse",
      "sinhalaTitle": "ව්‍යාකරණ සූත්‍රය"
    },
    {
      "number": 94,
      "pali": "‘‘Pañcime, bhikkhave, phāsuvihārā. Katame pañca? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ime kho, bhikkhave, pañca phāsuvihārā’’ti. Catutthaṃ.",
      "english": "There are, monks, these five comfortable abidings. Which five? Here, monks, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and abides in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and happiness. With the fading away of initial application and sustained application, he enters and abides in the second jhāna; then, with the complete fading away of rapture, he enters and abides in the third jhāna; then, with the abandoning of pleasure and pain and with the prior disappearance of joy and sorrow, he enters and abides in the fourth jhāna. With the destruction of the taints, having realized for themselves with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, they enter and abide in it. These, monks, are the five comfortable abidings.",
      "sinhala": "මහණෙනි, මේ සැප විහරණ පසකි. කවරේද ඒ පස?\n\nමහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්ව ද, අකුසල ධර්මයන්ගෙන් වෙන්ව ද, විතර්ක සහිත වූ ද විචාර සහිත වූ ද, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති, ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි.\n\nවිතර්ක හා විචාරයන්ගේ සංසිඳීමෙන්, අධ්‍යාත්මිකව පහන් වූ, සිතේ එකඟතාව ඇති, විතර්ක-විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති, ද්විතීය ධ්‍යානයට පැමිණ වාසය කරයි.\n\nප්‍රීතියෙහිද නොඇල්මෙන්, උපේක්ෂාවෙන් යුක්තව, සිහි නුවණින් යුක්තව, කායිකව සැපය විඳිමින්, තෘතීය ධ්‍යානයට පැමිණ වාසය කරයි.\n\nසැපය ද දුක ද අත්හැරීමෙන්, පූර්වයෙන් ම සොම්නස් දොම්නස් නැති වීමෙන්, දුක්ඛ-සැප රහිත වූ, උපේක්ෂා-ස්මෘති පාරිශුද්ධි චතුර්ථ ධ්‍යානයට පැමිණ වාසය කරයි.\n\nආශ්‍රවයන් ක්ෂය කිරීමෙන්, අනාශ්‍රව වූ චේතෝවිමුක්තිය ද, ප්‍රඥා විමුක්තිය ද, මේ ආත්මභාවයේදීම, තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරයි.\n\nමහණෙනි, මේ සැප විහරණ පස වෙත්.",
      "paliTitle": "Phāsuvihārasuttaṃ",
      "englishTitle": "The Sutta on Comfortable Abiding",
      "sinhalaTitle": "සුව විහරණ සූත්‍රය"
    },
    {
      "number": 95,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu atthapaṭisambhidāpatto hoti, dhammapaṭisambhidāpatto hoti, niruttipaṭisambhidāpatto hoti, paṭibhānapaṭisambhidāpatto hoti, yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu nacirasseva akuppaṃ paṭivijjhatī’’ti. Pañcamaṃ.",
      "english": "Monastics, a monastic endowed with five qualities soon penetrates the unshakable state. What are these five? Here, monastics, a monastic is accomplished in analytical knowledge of meaning, accomplished in analytical knowledge of the Dhamma, accomplished in analytical knowledge of language, accomplished in analytical knowledge of spontaneous exposition, and reflects upon the mind as it is liberated. Indeed, monastics, a monastic endowed with these five qualities soon penetrates the unshakable state.",
      "sinhala": "මහණෙනි, ධර්මයන් පහකින් යුක්ත වූ භික්ෂුව නොබෝ කලකින්ම අකුප්ප වූ විමුක්තිය අවබෝධ කරගනියි. ඒ පහ කුමක්ද? මහණෙනි, මෙහිලා භික්ෂුව අර්ථ ප්‍රතිසම්භිදාය අත්පත් කරගත් කෙනෙක් වෙයි, ධ​ර්ම ප්‍රතිසම්භිදාය අත්පත් කරගත් කෙනෙක් වෙයි, නිරුක්ති ප්‍රතිසම්භිදාය අත්පත් කරගත් කෙනෙක් වෙයි, ප්‍රතිභාන ප්‍රතිසම්භිදාය අත්පත් කරගත් කෙනෙක් වෙයි, යම්සේ විමුක්තියට පත් වූ සිත නැවත විමසා බලයි. මහණෙනි, සැබවින්ම මේ ධ​ර්මයන් පහකින් යුක්ත වූ භික්ෂුව නොබෝ කලකින්ම අකුප්ප වූ විමුක්තිය අවබෝධ කරගනියි.",
      "paliTitle": "Akuppasuttaṃ",
      "englishTitle": "The Unshakeable Discourse",
      "sinhalaTitle": "අකුප්ප සූත්‍රය"
    },
    {
      "number": 96,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ āsevanto nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ āsevanto nacirasseva akuppaṃ paṭivijjhatī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities, by cultivating mindfulness of breathing, very soon penetrates the unshakable. Which five?\n\nHere, monks, a bhikkhu is one who has few troubles, few duties, is easy to support, and is easily contented with the requisites of life; one who takes little food, devoted to moderation in eating; one who has little sloth and torpor, devoted to wakefulness; one who is learned, holding what he has heard, accumulating what he has heard—those teachings that are good in the beginning, good in the middle, good in the end, with meaning and with expression, entirely complete and perfectly pure in the holy life; such teachings are extensively heard by him, retained, familiarized verbally, examined mentally, and well penetrated by understanding; and one who reviews his mind as it has been liberated.\n\nIndeed, monks, a bhikkhu endowed with these five qualities, by cultivating mindfulness of breathing, very soon penetrates the unshakable.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ පස්වැදෑරුම් ධර්මයන්ගෙන් සමන්වාගත වූ භික්ෂුවක් ආනාපානසතිය වඩන්නේ නොබෝ කලකින් නොසෙල්වෙන විමුක්තිය ප්‍රත්‍යක්ෂ කරයි. කවර පස්වැදෑරුම් ධර්මයන්ගෙන්ද?\n\nභික්ෂූන් වහන්ස, මෙහිලා භික්ෂුව අල්ප අභිලාෂයන් ඇතිව, ලෞකික කටයුතු අඩුකොට, පහසුවෙන් ජීවත් කරවිය හැකිව, ජීවිත පැවැත්මට අවශ්‍ය දේ පිළිබඳ මැනවින් සන්තෝෂ වන සුළු වේ. ඔහු අල්පාහාරීව, අධික භෝජනයෙන් වැළකී සිටීමට යොමු වූවෙක් වේ. ඔහු අඩු මුළාවකින් යුක්ත වන අතර, නිරතුරුවම සෝදිසියෙන් සිටීමට යොමු වූවෙක් වේ. ඔහු බහුශ්‍රැතයෙකි, ඇසූ දේ සිහියේ දරා ගන්නෙකි, ඇසූ දේ එක්රැස් කරගත් තැනැත්තෙකි. මුල, මැද, අග යන තුන් තැනම කල්‍යාණ වූ, අර්ථ සහිතව, ව්‍යංජන සහිතව, මුළුමනින්ම පිරිපුන්, අතිශුද්ධ වූ බ්‍රහ්මචරියාව දේශනා කරන යම් ධර්මයන් ඇත්ද, එබඳු ධර්මයන් ඔහුට බහුශ්‍රැත වෙති. ඒවා සිහියේ දරාගත්, වචනයෙන් පුරුදු පුහුණු කළ, සිතින් මැනවින් විමර්ශනය කළ, දර්ශනයෙන් (ප්‍රඥාවෙන්) මැනවින් ප්‍රත්‍යක්ෂ කරන ලද ධර්මයන් වෙති. ඔහු තමාගේ විමුක්තිය ලද සිත නැවත විමර්ශනය කරයි.\n\nභික්ෂූන් වහන්ස, මේ පස්වැදෑරුම් ධර්මයන්ගෙන් සමන්වාගත වූ භික්ෂුවක් ආනාපානසතිය වඩන්නේ නොබෝ කලකින් නොසෙල්වෙන විමුක්තිය ප්‍රත්‍යක්ෂ කරයි.",
      "paliTitle": "Sutadharasuttaṃ",
      "englishTitle": "Discourse on the Retainer of Teachings",
      "sinhalaTitle": "සුතධාර සූත්‍රය"
    },
    {
      "number": 97,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ bhāvento nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; yāyaṃ kathā ābhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā…pe… vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī hoti akicchalābhī akasiralābhī; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ bhāvento nacirasseva akuppaṃ paṭivijjhatī’’ti. Sattamaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities, developing mindfulness of breathing, before long penetrates the unshakable deliverance. What are these five? Here, monks, a bhikkhu has few engagements and few duties, is easy to support, and is very contented with the requisites for life; he eats little and is devoted to moderation in eating; he has little sloth and torpor and is devoted to wakefulness; he obtains at will, without trouble, without difficulty, whatever talk is conducive to spiritual refinement and suitable for the clarification of the mind—that is, talk about having few wishes, about contentment, about seclusion, about exerting energy, about virtue, about concentration, about wisdom, about liberation, and about the knowledge and vision of liberation; and he reviews his mind as it has been liberated.\n\nMonks, a bhikkhu endowed with these five qualities, developing mindfulness of breathing, before long penetrates the unshakable deliverance.",
      "sinhala": "මහණෙනි, ධර්මයන් පහකින් සමන්වාගත වූ භික්ෂුව ආනාපානසතිය වඩන්නේ නොබෝ කලකින් අකම්ප්‍ය වූ (තත්ත්වය) අවබෝධ කරගනියි. කවර නම් පහකින්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව අල්ප කරදර ඇති, සුළු ක්‍රියාවන් ඇති, පහසුවෙන් පෝෂණය කළ හැකි, ජීවිත පරිෂ්කාරයන් කෙරෙහි මහත් සේ සතුටු වූ කෙනෙක් වෙයි; අල්පාහාරී වෙයි, අනුදරික බවට යොමු වූවෙක් වෙයි; අල්ප නිද්‍රා ඇති වෙයි, ජාගරියාවට යොමු වූවෙක් වෙයි; යම් මේ කථාවක් ක්ලේශයන් සංසිඳුවන, සිත විවෘත කිරීමට සුදුසු වූයේද, එනම් – අල්පේච්ඡතා කථාව…පෙ…විමුක්ති ඤාණ දර්ශන කථාව යන මේ එබඳු වූ කථාවන් කැමති සේ ලබන, අපහසුවකින් තොරව ලබන, දුකකින් තොරව ලබන කෙනෙක් වෙයි; විමුක්ත වූ සිත නැවත සලකා බලයි. මහණෙනි, ධර්මයන් පහකින් සමන්වාගත වූ භික්ෂුව ආනාපානසතිය වඩන්නේ නොබෝ කලකින් අකම්ප්‍ය වූ (තත්ත්වය) අවබෝධ කරගනියි.",
      "paliTitle": "Kathāsuttaṃ",
      "englishTitle": "Discourse on Talk",
      "sinhalaTitle": "කථා සූත්‍රය"
    },
    {
      "number": 98,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ bahulīkaronto nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; āraññako hoti pantasenāsano; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ bahulīkaronto nacirasseva akuppaṃ paṭivijjhatī’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, a monk endowed with five qualities, when cultivating mindfulness of breathing, will soon penetrate the unshakeable. Which five? Here, monks, a monk has few belongings and few duties, is easy to support, and is easily contented with the requisites of life; he eats little and is devoted to not overeating; he has little sloth and torpor and is devoted to wakefulness; he is a forest dweller and resorts to secluded abodes; and he reviews his mind as it is freed. Monks, a monk endowed with these five qualities, when cultivating mindfulness of breathing, will soon penetrate the unshakeable.”",
      "sinhala": "මහණෙනි, මේ ධර්මයන් පසකින් යුත් භික්ෂුවක් ආනාපානසතිය බහුල වශයෙන් වඩන්නේ නොබෝ කලකින්ම අකෝප්‍ය වූ විමුක්තිය අවබෝධ කරයි.\n\nඒ ධර්මයන් පස කුමක්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව අඩු අවශ්‍යතා ඇත්තෙක් වේ. අඩු කාර්යභාරයන් ඇත්තෙක් වේ. පහසුවෙන් පෝෂණය කළ හැකි ඇත්තෙක් වේ. ජීවිතාධාර ප‍්‍රත්‍යයන් කෙරෙහි ඉතා සතුටු ඇත්තෙක් වේ. අල්ප ආහාර ඇත්තෙක් වේ. තණ්හාවෙන් අධිකව අනුභව නොකිරීමෙහි යෙදුණෙක් වේ. අඩු තීනමිද්ධ ඇත්තෙක් වේ. නිදි නොවැරීමෙහි යෙදුණෙක් වේ. ආරණ්‍යක වූවෙක් වේ; හුදෙකලා ප‍්‍රාන්ත සේනාසන ඇත්තෙක් වේ. තමන්ගේ විමුක්ත වූ සිත පසුවිමසා බලයි.\n\nනියත වශයෙන්ම, මහණෙනි, මේ ධර්මයන් පසින් යුත් භික්ෂුවක් ආනාපානසතිය බහුල වශයෙන් වඩන්නේ නොබෝ කලකින්ම අකෝප්‍ය වූ විමුක්තිය අවබෝධ කරයි.",
      "paliTitle": "Āraññakasuttaṃ",
      "englishTitle": "The Forest Sutta",
      "sinhalaTitle": "ආරණ්‍ය‍ක සූත‍රය"
    },
    {
      "number": 99,
      "pali": "‘‘Sīho, bhikkhave, migarājā sāyanhasamayaṃ āsayā nikkhamati; āsayā nikkhamitvā vijambhati; vijambhitvā samantā catuddisaṃ [catuddisā (syā. kaṃ. pī. ka.) a. ni. 4.33; saṃ. ni. 3.78 passitabbaṃ] anuviloketi; samantā catuddisaṃ [catuddisā (syā. kaṃ. pī. ka.) a. ni. 4.33; saṃ. ni. 3.78 passitabbaṃ] anuviloketvā tikkhattuṃ sīhanādaṃ nadati; tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamati. So hatthissa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; mahiṃsassa [mahisassa (sī. syā. kaṃ. pī.)] cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; gavassa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; dīpissa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; khuddakānañcepi pāṇānaṃ pahāraṃ deti antamaso sasabiḷārānampi [sasabiḷārānaṃ (ka.)], sakkaccaññeva pahāraṃ deti, no asakkaccaṃ. Taṃ kissa hetu? ‘Mā me yoggapatho nassā’ti. ‘‘Sīhoti kho, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. Yaṃ kho, bhikkhave, tathāgato parisāya dhammaṃ deseti, idamassa hoti sīhanādasmiṃ. Bhikkhūnañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; bhikkhunīnañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; upāsakānañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; upāsikānañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; puthujjanānañcepi, bhikkhave, tathāgato dhammaṃ deseti antamaso annabhāranesādānampi [annabhāranesādānaṃ (ka.)], sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ. Taṃ kissa hetu? Dhammagaru, bhikkhave, tathāgato dhammagāravo’’ti. Navamaṃ.",
      "english": "Monks, the lion, king of beasts, emerges from its lair in the evening. Having emerged from its lair, it stretches. Having stretched, it surveys all four directions. Having surveyed all four directions, it roars its lion’s roar three times. Having roared its lion’s roar three times, it sets out for its hunting ground. Even if it strikes an elephant, it strikes diligently, not carelessly. Even if it strikes a buffalo, it strikes diligently, not carelessly. Even if it strikes an ox, it strikes diligently, not carelessly. Even if it strikes a leopard, it strikes diligently, not carelessly. And even if it strikes small creatures, right down to hares and cats, it strikes diligently, not carelessly. Why is that? So that its prowess does not diminish.\n\nMonks, ‘the lion’ is a designation for the Tathāgata, the Arahant, the Perfectly Awakened One. Monks, when the Tathāgata teaches the Dhamma to an assembly, this is his lion’s roar. Even if, monks, the Tathāgata teaches the Dhamma to monks, the Tathāgata teaches diligently, not carelessly. Even if to nuns, he teaches diligently, not carelessly. Even if to male lay followers, he teaches diligently, not carelessly. Even if to female lay followers, he teaches diligently, not carelessly. And even if to ordinary people, right down to food-porters and hunters, the Tathāgata teaches diligently, not carelessly. Why is that? Monks, the Tathāgata reveres the Dhamma, holds the Dhamma in high esteem.",
      "sinhala": "භික්ෂූණි, මෘගරාජ වූ සිංහයා සවස් කාලයෙහි තම ලෙනෙන් නික්මෙයි. ලෙනෙන් නික්ම පසුව අලස බව හැර පිම්බේ. පිම්බී පසුව සතර දිශාවම විමසා බලයි. සතර දිශාවම විමසා බලා තෙවරක් සිංහනාද කරයි. තෙවරක් සිංහනාද කොට ආහාර සෙවීම පිණිස යයි.\n\nඒ සිංහයා ඇතෙකුට පහර දෙන්නේ නම්, ගෞරවයෙන් යුතුවම පහර දෙයි, නොසැලකිල්ලෙන් නොවේ. මීහරකෙකුට පහර දෙන්නේ නම්, ගෞරවයෙන් යුතුවම පහර දෙයි, නොසැලකිල්ලෙන් නොවේ. ගවයෙකුට පහර දෙන්නේ නම්, ගෞරවයෙන් යුතුවම පහර දෙයි, නොසැලකිල්ලෙන් නොවේ. දිවියෙකුට පහර දෙන්නේ නම්, ගෞරවයෙන් යුතුවම පහර දෙයි, නොසැලකිල්ලෙන් නොවේ. කුඩා සතුන්ට, එනම් හාවුන්ට හෝ බළලුන්ට පවා පහර දෙන්නේ නම්, ගෞරවයෙන් යුතුවම පහර දෙයි, නොසැලකිල්ලෙන් නොවේ.\n\nඑයට හේතුව කුමක්ද? ‘මාගේ ක‍්‍රියාශීලී බව හීන නොවන්නට’ යන අදහසිනි.\n\nභික්ෂූණි, ‘සිංහයා’ යනු අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට ව්‍යවහාර වන නාමයකි. භික්ෂූණි, තථාගතයන් වහන්සේ පිරිසක් ඉදිරියේ ධර්මය දේශනා කරන විට, එය උන්වහන්සේගේ සිංහනාදය වෙයි.\n\nභික්ෂූණි, තථාගතයන් වහන්සේ භික්ෂූන් වහන්සේලාට ධර්මය දේශනා කරන්නේ නම්, ගෞරවයෙන් යුතුවම ධර්මය දේශනා කරයි, නොසැලකිල්ලෙන් නොවේ. භික්ෂුණීන් වහන්සේලාට ධර්මය දේශනා කරන්නේ නම්, ගෞරවයෙන් යුතුවම ධර්මය දේශනා කරයි, නොසැලකිල්ලෙන් නොවේ. උපාසකවරුන්ට ධර්මය දේශනා කරන්නේ නම්, ගෞරවයෙන් යුතුවම ධර්මය දේශනා කරයි, නොසැලකිල්ලෙන් නොවේ. උපාසිකාවන්ට ධර්මය දේශනා කරන්නේ නම්, ගෞරවයෙන් යුතුවම ධර්මය දේශනා කරයි, නොසැලකිල්ලෙන් නොවේ. පෘථග්ජනයන්ට, අන්තිම වශයෙන් ආහාර රැගෙන යන දඩයම්කරුවන්ට පවා ධර්මය දේශනා කරන්නේ නම්, ගෞරවයෙන් යුතුවම ධර්මය දේශනා කරයි, නොසැලකිල්ලෙන් නොවේ.\n\nඑයට හේතුව කුමක්ද? භික්ෂූණි, තථාගතයන් වහන්සේ ධර්මයට ගරු කරන්නෙකි, ධර්මයට භක්තියෙන් යුක්ත අයෙකි.",
      "paliTitle": "Sīhasuttaṃ",
      "englishTitle": "The Lion Sutta",
      "sinhalaTitle": "සිංහ සූත‍්‍රය"
    },
    {
      "number": 100,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. [cūḷava. 333, 341] Tena kho pana samayena kakudho nāma koliyaputto [koḷīyaputto (sī. syā. ka.)] āyasmato mahāmoggallānassa upaṭṭhāko adhunākālaṅkato aññataraṃ manomayaṃ kāyaṃ upapanno. Tassa evarūpo attabhāvapaṭilābho hoti – seyyathāpi nāma dve vā tīṇi vā māgadhakāni [māgadhikāni (sī. pī. ka.)] gāmakkhettāni. So tena attabhāvapaṭilābhena neva attānaṃ [nevattānaṃ byābādheti (sī.)] no paraṃ byābādheti. Atha kho kakudho devaputto yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho kakudho devaputto āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘devadattassa, bhante, evarūpaṃ icchāgataṃ uppajji – ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti. Sahacittuppādā ca, bhante, devadatto tassā iddhiyā parihīno’’ti. Idamavoca kakudho devaputto. Idaṃ vatvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Atha kho āyasmā mahāmoggallāno yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahāmoggallāno bhagavantaṃ etadavoca – ‘‘Kakudho nāma, bhante, koliyaputto mamaṃ upaṭṭhāko adhunākālaṅkato aññataraṃ manomayaṃ kāyaṃ upapanno hoti. Tassa evarūpo attabhāvapaṭilābho – seyyathāpi nāma dve vā tīṇi vā māgadhakāni gāmakkhettāni. So tena attabhāvapaṭilābhena neva attānaṃ no paraṃ byābādheti. Atha kho, bhante, kakudho devaputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho, bhante, kakudho devaputto maṃ etadavoca – ‘devadattassa, bhante, evarūpaṃ icchāgataṃ uppajji – ahaṃ bhikkhusaṅghaṃ pariharissāmīti. Sahacittuppādā ca, bhante, devadatto tassā iddhiyā parihīno’ti. Idamavoca, bhante, kakudho devaputto. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. ‘‘Kiṃ pana te, moggallāna, kakudho devaputto cetasā ceto paricca vidito – ‘yaṃ kiñci kakudho devaputto bhāsati sabbaṃ taṃ tatheva hoti, no aññathā’’’ti? ‘‘Cetasā ceto paricca vidito me, bhante, kakudho devaputto – ‘yaṃ kiñci kakudho devaputto bhāsati sabbaṃ taṃ tatheva hoti, no aññathā’’’ti. ‘‘Rakkhassetaṃ, moggallāna, vācaṃ! (Rakkhassetaṃ, moggallāna, vācaṃ) [( ) sī. syā. kaṃ. pī. potthakesu natthi cūḷava. 333 pana sabbatthapi dissatiyeva]! Idāni so moghapuriso attanāva attānaṃ pātukarissati. ‘‘Pañcime, moggallāna, satthāro santo saṃvijjamānā lokasmiṃ. Katame pañca? Idha, moggallāna, ekacco satthā aparisuddhasīlo samāno ‘parisuddhasīlomhī’ti paṭijānāti ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhasīlo samāno parisuddhasīlomhī’ti paṭijānāti ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ [kathaṃ nu taṃ (sī.), kathaṃ nu (syā. kaṃ. pī. ka.), kathaṃ taṃ (katthaci)] mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā sīlato rakkhanti; evarūpo ca pana satthā sāvakehi sīlato rakkhaṃ paccāsīsati [paccāsiṃsati (sī. syā. kaṃ. pī.)]. ‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhājīvo samāno ‘parisuddhājīvomhī’ti paṭijānāti ‘parisuddho me ājīvo pariyodāto asaṃkiliṭṭho’ti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhājīvo samāno parisuddhājīvomhī’ti paṭijānāti ‘parisuddho me ājīvo pariyodāto asaṃkiliṭṭho’ti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā ājīvato rakkhanti; evarūpo ca pana satthā sāvakehi ājīvato rakkhaṃ paccāsīsati. ‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhadhammadesano samāno ‘parisuddhadhammadesanomhī’ti paṭijānāti ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhadhammadesano samāno parisuddhadhammadesanomhī’ti paṭijānāti ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā dhammadesanato rakkhanti; evarūpo ca pana satthā sāvakehi dhammadesanato rakkhaṃ paccāsīsati. ‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhaveyyākaraṇo samāno ‘parisuddhaveyyākaraṇomhī’ti paṭijānāti ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhaveyyākaraṇo samāno parisuddhaveyyākaraṇomhī’ti paṭijānāti ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā veyyākaraṇato rakkhanti; evarūpo ca pana satthā sāvakehi veyyākaraṇato rakkhaṃ paccāsīsati. ‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhañāṇadassano samāno ‘parisuddhañāṇadassanomhī’ti paṭijānāti ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhañāṇadassano samāno parisuddhañāṇadassanomhī’ti paṭijānāti ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā ñāṇadassanato rakkhanti; evarūpo ca pana satthā sāvakehi ñāṇadassanato rakkhaṃ paccāsīsati. Ime kho, moggallāna, pañca satthāro santo saṃvijjamānā lokasmiṃ. ‘‘Ahaṃ kho pana, moggallāna, parisuddhasīlo samāno ‘parisuddhasīlomhī’ti paṭijānāmi ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā sīlato rakkhanti, na cāhaṃ sāvakehi sīlato rakkhaṃ paccāsīsāmi. Parisuddhājīvo samāno ‘parisuddhājīvomhī’ti paṭijānāmi ‘parisuddho me ājīvo pariyodāto asaṃkiliṭṭho’ti. Na ca maṃ sāvakā ājīvato rakkhanti, na cāhaṃ sāvakehi ājīvato rakkhaṃ paccāsīsāmi. Parisuddhadhammadesano samāno ‘parisuddhadhammadesanomhī’ti paṭijānāmi ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Na ca maṃ sāvakā dhammadesanato rakkhanti, na cāhaṃ sāvakehi dhammadesanato rakkhaṃ paccāsīsāmi. Parisuddhaveyyākaraṇo samāno ‘parisuddhaveyyākaraṇomhī’ti paṭijānāmi ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā veyyākaraṇato rakkhanti, na cāhaṃ sāvakehi veyyākaraṇato rakkhaṃ paccāsīsāmi. Parisuddhañāṇadassano samāno ‘parisuddhañāṇadassanomhī’ti paṭijānāmi ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā ñāṇadassanato rakkhanti, na cāhaṃ sāvakehi ñāṇadassanato rakkhaṃ paccāsīsāmī’’ti. Dasamaṃ. ",
      "english": "Thus have I heard – on one occasion the Blessed One was dwelling in Kosambi, at Ghosita’s Park. Now at that time, Kakudha, a Koliyan son, an attendant of the Venerable Mahamoggallana, had recently passed away and was reborn into a certain mind-made body. His attainment of existence was such that it was comparable to two or three Magadhan village territories. With that attainment of existence, he neither harmed himself nor others.\n\nThen the divine being Kakudha approached the Venerable Mahamoggallana. Having approached, he paid homage to the Venerable Mahamoggallana and stood to one side. Standing to one side, the divine being Kakudha said this to the Venerable Mahamoggallana: “Venerable sir, such a wish arose in Devadatta: ‘I will govern the community of bhikkhus.’ And Venerable sir, with the arising of that thought, Devadatta was deprived of that psychic power.” The divine being Kakudha said this. Having said this, he paid homage to the Venerable Mahamoggallana, circumambulated him clockwise, and vanished right there.\n\nThen the Venerable Mahamoggallana approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, the Venerable Mahamoggallana said this to the Blessed One: “Venerable sir, Kakudha, a Koliyan son, my attendant, had recently passed away and was reborn into a certain mind-made body. His attainment of existence was such that it was comparable to two or three Magadhan village territories. With that attainment of existence, he neither harmed himself nor others. Then, Venerable sir, the divine being Kakudha approached me. Having approached, he paid homage to me and stood to one side. Standing to one side, Venerable sir, the divine being Kakudha said this to me: ‘Venerable sir, such a wish arose in Devadatta: \"I will govern the community of bhikkhus.\" And Venerable sir, with the arising of that thought, Devadatta was deprived of that psychic power.’ Venerable sir, the divine being Kakudha said this. Having said this, he paid homage to me, circumambulated me clockwise, and vanished right there.”\n\n“But Moggallana, have you encompassed with your mind the mind of the divine being Kakudha, understanding that ‘whatever the divine being Kakudha speaks is exactly so and not otherwise’?”\n\n“Venerable sir, I have encompassed with my mind the mind of the divine being Kakudha, understanding that ‘whatever the divine being Kakudha speaks is exactly so and not otherwise.’”\n\n“Guard this statement, Moggallana! That deluded man will soon expose himself by himself.\n\n“Moggallana, there are these five teachers existing in the world. Which five? Here, Moggallana, a certain teacher, being of impure conduct, proclaims, ‘I am of pure conduct,’ saying, ‘My conduct is pure, cleansed, and unblemished.’ His disciples know this about him: ‘Indeed, this venerable teacher, being of impure conduct, proclaims, \"I am of pure conduct,\" saying, \"My conduct is pure, cleansed, and unblemished.\" If we were to declare this to householders, it would not be pleasing to him. Since it would be displeasing to him, how could we treat him in such a way? \"He is provided with robes, alms food, lodgings, and medicines for the sick, which are the requisites. Whatever he does, he will be known by that himself.\"’ Such a teacher, Moggallana, is protected by his disciples concerning his conduct. And such a teacher expects protection concerning his conduct from his disciples.\n\n“Furthermore, Moggallana, a certain teacher here, being of impure livelihood, proclaims, ‘I am of pure livelihood,’ saying, ‘My livelihood is pure, cleansed, and unblemished.’ His disciples know this about him: ‘Indeed, this venerable teacher, being of impure livelihood, proclaims, \"I am of pure livelihood,\" saying, \"My livelihood is pure, cleansed, and unblemished.\" If we were to declare this to householders, it would not be pleasing to him. Since it would be displeasing to him, how could we treat him in such a way? \"He is provided with robes, alms food, lodgings, and medicines for the sick, which are the requisites. Whatever he does, he will be known by that himself.\"’ Such a teacher, Moggallana, is protected by his disciples concerning his livelihood. And such a teacher expects protection concerning his livelihood from his disciples.\n\nFurthermore, Moggallāna, here, some teacher, whose teaching of the Dhamma is impure, claims, 'My teaching of the Dhamma is pure,' and 'My teaching of the Dhamma is pure, faultless, and undefiled.' His disciples know him thus: 'Indeed, this venerable teacher, while his teaching of the Dhamma is impure, claims, \"My teaching of the Dhamma is pure,\" and \"My teaching of the Dhamma is pure, faultless, and undefiled.\" If we were to inform the laity, it would not be pleasing to him. Since that would be displeasing to him, how should we treat him regarding it? He is, however, sustained by robes, alms-food, lodgings, and medicinal requisites for the sick; whatever he does, he himself will be known by that.' Indeed, Moggallāna, disciples protect such a teacher concerning his teaching of the Dhamma; and such a teacher expects protection from his disciples concerning his teaching of the Dhamma.\n\nFurthermore, Moggallāna, here, some teacher, whose explanations are impure, claims, 'My explanations are pure,' and 'My explanations are pure, faultless, and undefiled.' His disciples know him thus: 'Indeed, this venerable teacher, while his explanations are impure, claims, \"My explanations are pure,\" and \"My explanations are pure, faultless, and undefiled.\" If we were to inform the laity, it would not be pleasing to him. Since that would be displeasing to him, how should we treat him regarding it? He is, however, sustained by robes, alms-food, lodgings, and medicinal requisites for the sick; whatever he does, he himself will be known by that.' Indeed, Moggallāna, disciples protect such a teacher concerning his explanations; and such a teacher expects protection from his disciples concerning his explanations.\n\nFurthermore, Moggallāna, here, some teacher, whose knowledge and vision are impure, claims, 'My knowledge and vision are pure,' and 'My knowledge and vision are pure, faultless, and undefiled.' His disciples know him thus: 'Indeed, this venerable teacher, while his knowledge and vision are impure, claims, \"My knowledge and vision are pure,\" and \"My knowledge and vision are pure, faultless, and undefiled.\" If we were to inform the laity, it would not be pleasing to him. Since that would be displeasing to him, how should we treat him regarding it? He is, however, sustained by robes, alms-food, lodgings, and medicinal requisites for the sick; whatever he does, he himself will be known by that.' Indeed, Moggallāna, disciples protect such a teacher concerning his knowledge and vision; and such a teacher expects protection from his disciples concerning his knowledge and vision.\n\nThese five kinds of teachers, Moggallāna, exist and are found in the world. But I, Moggallāna, being one whose moral conduct is pure, claim, 'My moral conduct is pure,' and 'My moral conduct is pure, faultless, and undefiled.' My disciples do not protect me concerning my moral conduct, nor do I expect protection from my disciples concerning my moral conduct. Being one whose livelihood is pure, I claim, 'My livelihood is pure,' and 'My livelihood is pure, faultless, and undefiled.' My disciples do not protect me concerning my livelihood, nor do I expect protection from my disciples concerning my livelihood.\n\nBeing one whose teaching of the Dhamma is pure, I claim, 'My teaching of the Dhamma is pure,' and 'My teaching of the Dhamma is pure, faultless, and undefiled.' My disciples do not protect me concerning my teaching of the Dhamma, nor do I expect protection from my disciples concerning my teaching of the Dhamma. Being one whose explanations are pure, I claim, 'My explanations are pure,' and 'My explanations are pure, faultless, and undefiled.' My disciples do not protect me concerning my explanations, nor do I expect protection from my disciples concerning my explanations. Being one whose knowledge and vision are pure, I claim, 'My knowledge and vision are pure,' and 'My knowledge and vision are pure, faultless, and undefiled.' My disciples do not protect me concerning my knowledge and vision, nor do I expect protection from my disciples concerning my knowledge and vision.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසම්බියෙහි ඝෝෂිතාරාමයෙහි වැඩවසන සේක.\n\nඒ කල කකුධ නම් කෝලිය පුත්‍රයාණෝ ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේගේ උවටැන්කරුවෙකුව සිටියහ. ඔහු මෑතදී මියගොස්, මනෝමය කායකින් යුක්ත වූ දෙවියකු ලෙස උපන්නාහ. ඔහුගේ එම ආත්මභාවය දෙකක් හෝ තුනක් මාගධ ගම්බිම් හා සමාන විය. ඔහු එම ආත්මභාවය ලැබීමෙන් තමාට හෝ අනුන්ට කිසිදු පීඩාවක් නොකරයි.\n\nඉක්බිති කකුධ දෙව්පුත්‍රයාණෝ ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ වෙත එළඹියහ. එළඹ, ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට වන්දනා කර, එකත්පසෙක සිට ගත්හ. එකත්පසෙක සිටි කකුධ දෙව්පුත්‍රයාණෝ ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට මෙසේ පැවසූහ: ‘වහන්ස, දේවදත්තට මෙබඳු අධිෂ්ඨාන සිතක් පහළ විය – “මම භික්ෂු සංඝයා පාලනය කරන්නෙමි”යි. වහන්ස, ඒ සිත පහළ වීමත් සමගම දේවදත්තට ඒ ඍද්ධිය නැති වී ගියේය.’ කකුධ දෙව්පුත්‍රයාණෝ මෙය පැවසූහ. මෙය පවසා, ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට වන්දනා කර, පැදකුණු කර, එතැනම අතුරුදහන් වූහ.\n\nඉක්බිති ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩසිටි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: ‘වහන්ස, කකුධ නම් කෝලිය පුත්‍රයාණෝ මාගේ උවටැන්කරුවෙකුව සිටියහ. ඔහු මෑතදී මියගොස්, මනෝමය කායකින් යුක්ත වූ දෙවියකු ලෙස උපන්නාහ. ඔහුගේ එම ආත්මභාවය දෙකක් හෝ තුනක් මාගධ ගම්බිම් හා සමාන විය. ඔහු එම ආත්මභාවය ලැබීමෙන් තමාට හෝ අනුන්ට කිසිදු පීඩාවක් නොකරයි. වහන්ස, ඉක්බිති කකුධ දෙව්පුත්‍රයාණෝ මා වෙත එළඹියහ. එළඹ, මට වන්දනා කර, එකත්පසෙක සිට ගත්හ. වහන්ස, එකත්පසෙක සිටි කකුධ දෙව්පුත්‍රයාණෝ මට මෙසේ පැවසූහ: “වහන්ස, දේවදත්තට මෙබඳු අධිෂ්ඨාන සිතක් පහළ විය – ‘මම භික්ෂු සංඝයා පාලනය කරන්නෙමි’යි. වහන්ස, ඒ සිත පහළ වීමත් සමගම දේවදත්තට ඒ ඍද්ධිය නැති වී ගියේය”යි. වහන්ස, කකුධ දෙව්පුත්‍රයාණෝ මෙය පැවසූහ. මෙය පවසා, මට වන්දනා කර, පැදකුණු කර, එතැනම අතුරුදහන් වූහ’යි.\n\n‘මොග්ගල්ලානය, කකුධ දෙව්පුත්‍රයාගේ සිත චේතසිකව (ඔහුගේ සිතින් ඔබගේ සිතට) දැන, ‘කකුධ දෙව්පුත්‍රයා යමක් පවසන්නේද, ඒ සියල්ල එලෙසම සිදුවන බව, වෙනත් ආකාරයකින් නොවන බව’ ඔබට වැටහුණේද?’\n\n‘වහන්ස, කකුධ දෙව්පුත්‍රයාගේ සිත චේතසිකව දැන, ‘කකුධ දෙව්පුත්‍රයා යමක් පවසන්නේද, ඒ සියල්ල එලෙසම සිදුවන බව, වෙනත් ආකාරයකින් නොවන බව’ මට වැටහිණි’යි.\n\n‘මොග්ගල්ලානය, ඒ වචනය (ඔබ සිතෙහි) රඳවා ගන්න! දැන් ඒ මෝඝ පුරුෂයා තමා විසින්ම තමා හෙළි කර ගන්නේය.\n\n‘මොග්ගල්ලානය, මේ ලෝකයෙහි පස්වර්ගයක ශාස්තෘවරු වෙති, සිටිති. කවරහුද ඒ පස් දෙනා? මොග්ගල්ලානය, මෙහිලා ඇතැම් ශාස්තෘවරයෙක් අපිරිසිදු සිල් ඇත්තෙක් වෙමින්, ‘මම පිරිසිදු සිල් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ සීලය පිරිසිදුය, ඉතා දීප්තිමත්ය, කිලිටි නැතැ’යි ප්‍රකාශ කරයි. ඔහුගේ ශ්‍රාවකයෝ ඔහු ගැන මෙසේ දනිති – ‘මේ භවත් ශාස්තෘවරයා අපිරිසිදු සිල් ඇත්තෙක් වෙමින්, ‘මම පිරිසිදු සිල් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ සීලය පිරිසිදුය, ඉතා දීප්තිමත්ය, කිලිටි නැතැ’යි ප්‍රකාශ කරයි. අපි ගිහියන්ට මෙය දැනුම් දුන්නොත්, එය ඔහුට අප්‍රිය වනු ඇත. ඔහුට අප්‍රිය වන දෙයක් නම්, අපි කෙසේනම් ඔහුට එසේ සලකමුද – ‘චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස සහ ඖෂධ පරිෂ්කාරයන්ගෙන් නම් ඔහුට (සත්කාර සම්මාන) ලැබෙයි; යමක් ඔහු කරන්නේද, ඔහු ඒ හේතුවෙන්ම (අප අතර) ප්‍රකට වනු ඇතැ’යි. මොග්ගල්ලානය, මෙබඳු ශාස්තෘවරයකු ශ්‍රාවකයෝ සීලයෙන් ආරක්ෂා කරති; මෙබඳු ශාස්තෘවරයෙක් ශ්‍රාවකයන්ගෙන් සීලයෙන් ආරක්ෂාව අපේක්ෂා කරයි.\n\nතවද, මොග්ගල්ලානය, මෙහිලා ඇතැම් ශාස්තෘවරයෙක් අපිරිසිදු ආජීවයෙන් යුක්ත වෙමින්, ‘මම පිරිසිදු ආජීවයෙන් යුක්ත වෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ආජීවය පිරිසිදුය, ඉතා දීප්තිමත්ය, කිලිටි නැතැ’යි ප්‍රකාශ කරයි. ඔහුගේ ශ්‍රාවකයෝ ඔහු ගැන මෙසේ දනිති – ‘මේ භවත් ශාස්තෘවරයා අපිරිසිදු ආජීවයෙන් යුක්ත වෙමින්, ‘මම පිරිසිදු ආජීවයෙන් යුක්ත වෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ආජීවය පිරිසිදුය, ඉතා දීප්තිමත්ය, කිලිටි නැතැ’යි ප්‍රකාශ කරයි. අපි ගිහියන්ට මෙය දැනුම් දුන්නොත්, එය ඔහුට අප්‍රිය වනු ඇත. ඔහුට අප්‍රිය වන දෙයක් නම්, අපි කෙසේනම් ඔහුට එසේ සලකමුද – ‘චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස සහ ඖෂධ පරිෂ්කාරයන්ගෙන් නම් ඔහුට (සත්කාර සම්මාන) ලැබෙයි; යමක් ඔහු කරන්නේද, ඔහු ඒ හේතුවෙන්ම (අප අතර) ප්‍රකට වනු ඇතැ’යි. මොග්ගල්ලානය, මෙබඳු ශාස්තෘවරයකු ශ්‍රාවකයෝ ආජීවයෙන් ආරක්ෂා කරති; මෙබඳු ශාස්තෘවරයෙක් ශ්‍රාවකයන්ගෙන් ආජීවයෙන් ආරක්ෂාව අපේක්ෂා කරයි.\n\nතවද, මොග්ගල්ලාන, මෙහි සමහර ශාස්තෘවරයෙක් අපිරිසිදු ධර්ම දේශනාවක් ඇතිව, ‘මම පිරිසිදු ධර්ම දේශනාවක් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ධර්ම දේශනාව පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරයි. ඔහුගේ ශ්‍රාවකයෝ මේ ශාස්තෘවරයා ගැන මෙසේ දනිති: ‘මේ ගෞරවනීය ශාස්තෘවරයා අපිරිසිදු ධර්ම දේශනාවක් ඇතිව, ‘මම පිරිසිදු ධර්ම දේශනාවක් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ධර්ම දේශනාව පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරයි.’ එහෙත්, අපි ගිහියන්ට මෙය දැනුම් දුන්නොත්, එය ඔහුට ප්‍රිය නොවන්නේය. යම් දෙයක් ඔහුට අප්‍රියද, කෙසේනම් අපි ඔහුට එයින් සැලකිය යුතුද? – ‘ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර වලින් යැපෙන්නේය. යමක් ඔහු කරන්නේද, ඒ කාරණයෙන් ඔහුම ප්‍රකට වනු ඇතැයි.’ මොග්ගල්ලාන, මෙබඳු ශාස්තෘවරයෙකුව ශ්‍රාවකයෝ ධර්ම දේශනාව සම්බන්ධයෙන් ආරක්ෂා කරති. මෙබඳු ශාස්තෘවරයෙක්ද ශ්‍රාවකයන්ගෙන් ධර්ම දේශනාව සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු වේ.\n\nතවද, මොග්ගල්ලාන, මෙහි සමහර ශාස්තෘවරයෙක් අපිරිසිදු ව්‍යාකරණයක් (විස්තර කිරීමක්) ඇතිව, ‘මම පිරිසිදු ව්‍යාකරණයක් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ව්‍යාකරණය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරයි. ඔහුගේ ශ්‍රාවකයෝ මේ ශාස්තෘවරයා ගැන මෙසේ දනිති: ‘මේ ගෞරවනීය ශාස්තෘවරයා අපිරිසිදු ව්‍යාකරණයක් ඇතිව, ‘මම පිරිසිදු ව්‍යාකරණයක් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ව්‍යාකරණය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරයි.’ එහෙත්, අපි ගිහියන්ට මෙය දැනුම් දුන්නොත්, එය ඔහුට ප්‍රිය නොවන්නේය. යම් දෙයක් ඔහුට අප්‍රියද, කෙසේනම් අපි ඔහුට එයින් සැලකිය යුතුද? – ‘ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර වලින් යැපෙන්නේය. යමක් ඔහු කරන්නේද, ඒ කාරණයෙන් ඔහුම ප්‍රකට වනු ඇතැයි.’ මොග්ගල්ලාන, මෙබඳු ශාස්තෘවරයෙකුව ශ්‍රාවකයෝ ව්‍යාකරණය සම්බන්ධයෙන් ආරක්ෂා කරති. මෙබඳු ශාස්තෘවරයෙක්ද ශ්‍රාවකයන්ගෙන් ව්‍යාකරණය සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු වේ.\n\nතවද, මොග්ගල්ලාන, මෙහි සමහර ශාස්තෘවරයෙක් අපිරිසිදු ඥානදර්ශනයක් (නුවණ සහ දැක්ම) ඇතිව, ‘මම පිරිසිදු ඥානදර්ශනයක් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ඥානදර්ශනය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරයි. ඔහුගේ ශ්‍රාවකයෝ මේ ශාස්තෘවරයා ගැන මෙසේ දනිති: ‘මේ ගෞරවනීය ශාස්තෘවරයා අපිරිසිදු ඥානදර්ශනයක් ඇතිව, ‘මම පිරිසිදු ඥානදර්ශනයක් ඇත්තෙමි’යි ප්‍රකාශ කරයි, ‘මාගේ ඥානදර්ශනය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරයි.’ එහෙත්, අපි ගිහියන්ට මෙය දැනුම් දුන්නොත්, එය ඔහුට ප්‍රිය නොවන්නේය. යම් දෙයක් ඔහුට අප්‍රියද, කෙසේනම් අපි ඔහුට එයින් සැලකිය යුතුද? – ‘ඔහු චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර වලින් යැපෙන්නේය. යමක් ඔහු කරන්නේද, ඒ කාරණයෙන් ඔහුම ප්‍රකට වනු ඇතැයි.’ මොග්ගල්ලාන, මෙබඳු ශාස්තෘවරයෙකුව ශ්‍රාවකයෝ ඥානදර්ශනය සම්බන්ධයෙන් ආරක්ෂා කරති. මෙබඳු ශාස්තෘවරයෙක්ද ශ්‍රාවකයන්ගෙන් ඥානදර්ශනය සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු වේ. මොග්ගල්ලාන, මෙලොව මේ පස් ආකාර ශාස්තෘවරුන් සිටිති, විද්‍යමාන වෙති.\n\nඑහෙත් මොග්ගල්ලාන, මම නම් පිරිසිදු සිල් ඇත්තෙක්ව සිටිමින්, ‘මම පිරිසිදු සිල් ඇත්තෙමි’යි ප්‍රකාශ කරමි, ‘මාගේ සීලය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරමි. මා ශ්‍රාවකයෝ සීලය සම්බන්ධයෙන් ආරක්ෂා නොකරති, මමද ශ්‍රාවකයන්ගෙන් සීලය සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු නොවෙමි. පිරිසිදු ආජීවයක් ඇත්තෙක්ව සිටිමින්, ‘මම පිරිසිදු ආජීවයක් ඇත්තෙමි’යි ප්‍රකාශ කරමි, ‘මාගේ ආජීවය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරමි. මා ශ්‍රාවකයෝ ආජීවය සම්බන්ධයෙන් ආරක්ෂා නොකරති, මමද ශ්‍රාවකයන්ගෙන් ආජීවය සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු නොවෙමි. පිරිසිදු ධර්ම දේශනාවක් ඇත්තෙක්ව සිටිමින්, ‘මම පිරිසිදු ධර්ම දේශනාවක් ඇත්තෙමි’යි ප්‍රකාශ කරමි, ‘මාගේ ධර්ම දේශනාව පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරමි. මා ශ්‍රාවකයෝ ධර්ම දේශනාව සම්බන්ධයෙන් ආරක්ෂා නොකරති, මමද ශ්‍රාවකයන්ගෙන් ධර්ම දේශනාව සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු නොවෙමි. පිරිසිදු ව්‍යාකරණයක් ඇත්තෙක්ව සිටිමින්, ‘මම පිරිසිදු ව්‍යාකරණයක් ඇත්තෙමි’යි ප්‍රකාශ කරමි, ‘මාගේ ව්‍යාකරණය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරමි. මා ශ්‍රාවකයෝ ව්‍යාකරණය සම්බන්ධයෙන් ආරක්ෂා නොකරති, මමද ශ්‍රාවකයන්ගෙන් ව්‍යාකරණය සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු නොවෙමි. පිරිසිදු ඥානදර්ශනයක් ඇත්තෙක්ව සිටිමින්, ‘මම පිරිසිදු ඥානදර්ශනයක් ඇත්තෙමි’යි ප්‍රකාශ කරමි, ‘මාගේ ඥානදර්ශනය පිරිසිදුය, පරම පවිත්‍රය, කිලිටි නැත’යි ප්‍රකාශ කරමි. මා ශ්‍රාවකයෝ ඥානදර්ශනය සම්බන්ධයෙන් ආරක්ෂා නොකරති, මමද ශ්‍රාවකයන්ගෙන් ඥානදර්ශනය සම්බන්ධයෙන් ආරක්ෂාවක් බලාපොරොත්තු නොවෙමි.",
      "paliTitle": "Kakudhatherasuttaṃ",
      "englishTitle": "Discourse of Kakudha the Elder",
      "sinhalaTitle": "කකුධථේරසූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Kakudhavaggo pañcamo. Tassuddānaṃ – Dve sampadā byākaraṇaṃ, phāsu akuppapañcamaṃ; Sutaṃ kathā āraññako, sīho ca kakudho dasāti. Dutiyapaṇṇāsakaṃ samattaṃ.",
    "english": "The Fifth Kakudha Chapter",
    "sinhala": "කකුධ ව‌ර්ගය පස්වැනි"
  }
}