{
  "id": "an5.2",
  "title": {
    "pali": "Balavaggo",
    "english": "The Chapter on Powers",
    "sinhala": "බලවග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "‘‘Pubbāhaṃ, bhikkhave, ananussutesu dhammesu abhiññāvosānapāramippatto paṭijānāmi. Pañcimāni, bhikkhave, tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni pañca? Saddhābalaṃ, hirībalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ – imāni kho, bhikkhave, pañca tathāgatassa tathāgatabalāni yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. Paṭhamaṃ.",
      "english": "Monks, I declare that formerly, concerning teachings unheard before, I attained the ultimate perfection of direct knowledge. Monks, there are these five Tathāgata powers of the Tathāgata, endowed with which the Tathāgata proclaims the foremost position, roars the lion's roar in assemblies, and sets in motion the supreme Wheel of Dhamma. Which five are these? The power of conviction, the power of moral shame, the power of moral dread, the power of energy, and the power of wisdom – these indeed, monks, are the five Tathāgata powers of the Tathāgata, endowed with which the Tathāgata proclaims the foremost position, roars the lion's roar in assemblies, and sets in motion the supreme Wheel of Dhamma.",
      "sinhala": "මහණෙනි, පෙර කිසිවකු විසින් අසනු නොලැබූ ධර්මයන් පිළිබඳව උතුම් වූ අභිඥාවන්ගේ අවසාන පාරමී භාවයට පැමිණි බව මම ප්‍රකාශ කරමි.\n\nමහණෙනි, තථාගතයන් වහන්සේගේ මේ තථාගත බලයන් පහකි. යම් බලයන්ගෙන් සමන්විත වූ තථාගතයන් වහන්සේ උතුම් වූ නිර්භය ස්ථානය ප්‍රකාශ කරයිද, පිරිස් මැද සිංහනාදයක් නගයිද, බ්‍රහ්ම චක්‍රය පවත්වයිද.\n\nඒ පහ කවරහුද?\n\nශ්‍රද්ධා බලය, හිරී බලය, ඔත්තප්ප බලය, වීර්ය බලය, ප්‍රඥා බලය යන මේවාය. මහණෙනි, මේවා නම් තථාගතයන් වහන්සේගේ තථාගත බලයන් පහය. යම් බලයන්ගෙන් සමන්විත වූ තථාගතයන් වහන්සේ උතුම් වූ නිර්භය ස්ථානය ප්‍රකාශ කරයිද, පිරිස් මැද සිංහනාදයක් නගයිද, බ්‍රහ්ම චක්‍රය පවත්වයිද.\n\nපළමුවන සූත්‍රයයි.",
      "paliTitle": "Ananussutasuttaṃ",
      "englishTitle": "The Discourse on Unheard (Teachings)",
      "sinhalaTitle": "අනනුස්සුත සූත්‍රය"
    },
    {
      "number": 12,
      "pali": "‘‘Pañcimāni, bhikkhave, sekhabalāni. Katamāni pañca? Saddhābalaṃ, hirībalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ – imāni kho, bhikkhave, pañca sekhabalāni. Imesaṃ kho, bhikkhave, pañcannaṃ sekhabalānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghātaniyaṃ, yadidaṃ paññābalaṃ. ‘‘Seyyathāpi, bhikkhave, kūṭāgārassa etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghātaniyaṃ, yadidaṃ kūṭaṃ. Evamevaṃ kho, bhikkhave, imesaṃ pañcannaṃ sekhabalānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghātaniyaṃ, yadidaṃ paññābalaṃ. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘saddhābalena samannāgatā bhavissāma sekhabalena, hirībalena… ottappabalena… vīriyabalena… paññābalena samannāgatā bhavissāma sekhabalenā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Monks, there are these five powers of a trainee. Which five? The power of faith, the power of moral shame, the power of moral dread, the power of energy, and the power of wisdom – these, monks, are the five powers of a trainee.\n\nAmong these five powers of a trainee, monks, this is the foremost, this is the unifying factor, this is the consolidating factor, namely, the power of wisdom.\n\nJust as, monks, for a peaked house, this is the foremost, this is the unifying factor, this is the consolidating factor, namely, its peak.\n\nEven so, monks, among these five powers of a trainee, this is the foremost, this is the unifying factor, this is the consolidating factor, namely, the power of wisdom.\n\nTherefore, monks, you should train yourselves in this way: 'We shall be endowed with the power of faith, the power of a trainee; we shall be endowed with the power of moral shame, the power of a trainee; we shall be endowed with the power of moral dread, the power of a trainee; we shall be endowed with the power of energy, the power of a trainee; we shall be endowed with the power of wisdom, the power of a trainee.' Indeed, monks, it is in this way that you should train.",
      "sinhala": "මහණෙනි, මේවා සේඛ බලධර්ම පහකි. කවරේද ඒ පහ? ශ්‍රද්ධා බලය, හිරී බලය, ඔත්තප්ප බලය, වීර්ය බලය, ප්‍රඥා බලය යන මේවාය. මහණෙනි, මේවා සේඛ බලධර්ම පහකි.\n\nමහණෙනි, මේ සේඛ බලධර්ම පහ අතුරින් අග්‍ර වූයේත්, ඒවා එකට එකතු කරන වූයේත්, ඒවා සම්පූර්ණ කරන වූයේත් ප්‍රඥා බලයමය.\n\nමහණෙනි, යම් සේ කූටාගාරයකට අග්‍ර වූයේත්, එහි සියලු අංග එකට එකතු කරන වූයේත්, ඒවා සම්පූර්ණ කරන වූයේත් කූටය ද, එපරිද්දෙන්ම මහණෙනි, මේ සේඛ බලධර්ම පහ අතුරින් අග්‍ර වූයේත්, ඒවා එකට එකතු කරන වූයේත්, ඒවා සම්පූර්ණ කරන වූයේත් ප්‍රඥා බලයමය.\n\nමහණෙනි, එහෙයින් මෙසේ හික්මිය යුතුය: ‘අපි සේඛ බලධර්මයක් වන ශ්‍රද්ධා බලයෙන් යුක්ත වන්නෙමු, සේඛ බලධර්මයක් වන හිරී බලයෙන් යුක්ත වන්නෙමු, සේඛ බලධර්මයක් වන ඔත්තප්ප බලයෙන් යුක්ත වන්නෙමු, සේඛ බලධර්මයක් වන වීර්ය බලයෙන් යුක්ත වන්නෙමු, සේඛ බලධර්මයක් වන ප්‍රඥා බලයෙන් යුක්ත වන්නෙමු’යි. මහණෙනි, ඔබ විසින් මෙසේ හික්මිය යුතුමය.",
      "paliTitle": "Kūṭasuttaṃ",
      "englishTitle": "The Discourse on the Peak",
      "sinhalaTitle": "කූට සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "‘‘Pañcimāni, bhikkhave, balāni. Katamāni pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – imāni kho, bhikkhave, pañca balānī’’ti. Tatiyaṃ.",
      "english": "Monks, there are these five powers. Which five? The power of conviction, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom – monks, these are those five powers.",
      "sinhala": "මහණෙනි, මේ බලධර්ම පහක් ඇත්තාහ. කවරේ නම් ඒ පහද? එනම්, ශ්‍රද්ධා බලය, වීර්යය බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලය යි. මහණෙනි, මේ බලධර්ම පහ මෙලෙසින් ඇත්තාහ.",
      "paliTitle": "Saṃkhittasuttaṃ",
      "englishTitle": "The Brief Discourse",
      "sinhalaTitle": "සංඛිත්ත සූත්‍රය"
    },
    {
      "number": 14,
      "pali": "‘‘Pañcimāni, bhikkhave, balāni. Katamāni pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ. ‘‘Katamañca, bhikkhave, saddhābalaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Idaṃ vuccati, bhikkhave, saddhābalaṃ. ‘‘Katamañca, bhikkhave, vīriyabalaṃ? Idha, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Idaṃ vuccati, bhikkhave, vīriyabalaṃ. ‘‘Katamañca, bhikkhave, satibalaṃ? Idha, bhikkhave, ariyasāvako satimā hoti paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. Idaṃ vuccati, bhikkhave, satibalaṃ. ‘‘Katamañca, bhikkhave, samādhibalaṃ? Idha, bhikkhave, ariyasāvako vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati; pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati; sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati, bhikkhave, samādhibalaṃ. ‘‘Katamañca, bhikkhave, paññābalaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Idaṃ vuccati, bhikkhave, paññābalaṃ. Imāni kho, bhikkhave, pañca balānī’’ti. Catutthaṃ.",
      "english": "Monks, there are these five powers. Which five? The power of conviction, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom.\n\nAnd what, monks, is the power of conviction? Here, monks, a noble disciple is convinced; he has conviction in the Tathāgata's enlightenment, [realizing] 'Indeed, the Blessed One is an Arahant, perfectly self-awakened, endowed with knowledge and conduct, the Fortunate One, knower of the worlds, unsurpassed charioteer of trainable people, teacher of gods and humans, the Awakened One, the Blessed One.' This, monks, is called the power of conviction.\n\nAnd what, monks, is the power of energy? Here, monks, a noble disciple dwells with aroused energy for the abandoning of unskillful qualities and for the acquiring of skillful qualities; he is resolute, staunch in exertion, not laying down the burden in skillful qualities. This, monks, is called the power of energy.\n\nAnd what, monks, is the power of mindfulness? Here, monks, a noble disciple is mindful, endowed with supreme mindfulness and circumspection; he remembers and recalls what was done and said long ago. This, monks, is called the power of mindfulness.\n\nAnd what, monks, is the power of concentration? Here, monks, a noble disciple, quite secluded from sensual pleasures, secluded from unskillful mental qualities, enters and remains in the first jhāna: rapture and pleasure born of seclusion, accompanied by initial application and sustained application. With the subsiding of initial and sustained application, he enters and remains in the second jhāna: rapture and pleasure born of concentration, with internal assurance and unification of mind, without initial application and sustained application. With the fading of rapture, he remains equanimous, mindful, and clearly comprehending; he experiences pleasure with the body, of which the Noble Ones declare, ‘Equanimous, mindful, one who dwells happily.’ He enters and remains in the third jhāna. With the abandoning of pleasure and pain—as with the earlier disappearance of elation and distress—he enters and remains in the fourth jhāna: purity of mindfulness and equanimity, neither pleasure nor pain. This, monks, is called the power of concentration.\n\nAnd what, monks, is the power of wisdom? Here, monks, a noble disciple is wise, endowed with wisdom that discerns rise and fall, noble and penetrative, leading to the right destruction of suffering. This, monks, is called the power of wisdom. These, monks, are the five powers.",
      "sinhala": "මහණෙනි, මේ බලධර්ම පහකි. ඒ කවරේවාද පහක්ද? ශ්‍රද්ධාබලය, වීර්යයබලය, සතිබලය, සමාධිබලය, ප්‍රඥාබලයයි.\n\nමහණෙනි, ශ්‍රද්ධාබලය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා ශ්‍රද්ධාවන්ත වේ. තථාගතයන් වහන්සේගේ බෝධිය මෙසේ අදහා ගනියි – ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධෝ, භගවා’ යන මේ ගුණවලින් යුක්ත සේක. මහණෙනි, මෙය ශ්‍රද්ධාබලය යැයි කියනු ලැබේ.\n\nමහණෙනි, වීර්යයබලය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් සම්පූර්ණ කරගැනීම පිණිසත්, ආරම්භක වීර්යයෙන් යුක්තව, ශක්තිමත්ව, දැඩි ප්‍රයත්නයෙන් යුක්තව, කුසල ධර්මයන් පිළිබඳ බර නොහළ පුද්ගලයෙක් ලෙස වාසය කරයි. මහණෙනි, මෙය වීර්යයබලය යැයි කියනු ලැබේ.\n\nමහණෙනි, සතිබලය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා උතුම් සිහි කල්පනාවකින් යුක්තව, බොහෝ කලකට පෙර කරන ලද හෝ බොහෝ කලකට පෙර කියන ලද දෑ සිහි කරන්නේ, නැවත නැවත සිහිපත් කරන්නේ සිහියෙන් යුක්තව වාසය කරයි. මහණෙනි, මෙය සතිබලය යැයි කියනු ලැබේ.\n\nමහණෙනි, සමාධිබලය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි; විතර්ක හා විචාරයන්ගේ සංසිඳීමෙන්, අධ්‍යාත්මිකව පහන් වූ සිතිවිල්ලෙන්, සිත එකඟ වීමෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති දෙවන ධ්‍යානයට පැමිණ වාසය කරයි; ප්‍රීතියද නොඇල්මෙන් (දුරු කිරීමෙන්), උපේක්ෂාවෙන් යුක්තව, සිහියෙන් හා මනා දැනීමෙන් යුක්තව වාසය කරයි. කායයෙන්ද සැප විඳියි. යමක් ආර්යයන් වහන්සේලා ‘උපේක්ෂාවෙන් යුක්ත වූ, සිහියෙන් යුක්ත වූ, සැප විහරණයෙන් යුක්ත වූ තැනැත්තා’ යැයි පවසත්ද, එබඳු තෙවන ධ්‍යානයට පැමිණ වාසය කරයි; සැපයද දුරු කිරීමෙන්, දුකද දුරු කිරීමෙන්, කලින්ම සෝමනස්ස දෝමනස්සයන්ගේ අස්තංගමයෙන්, දුක් නොවන සැප නොවන උපේක්ෂා සති පාරිශුද්ධිය ඇති සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. මහණෙනි, මෙය සමාධිබලය යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රඥාබලය කවරේද? මහණෙනි, මෙහිදී ආර්ය ශ්‍රාවකයා උදයාස්තගාමී ප්‍රඥාවෙන්, ආර්ය වූ, කෙලෙස් විදින සුළු වූ, මනාකොට දුක්ඛ ක්ෂයට පමුණුවන ප්‍රඥාවෙන් යුක්තව ප්‍රඥාවන්තයෙක් වේ. මහණෙනි, මෙය ප්‍රඥාබලය යැයි කියනු ලැබේ.\n\nමහණෙනි, මේ බලධර්ම පහ මෙපමණයි.",
      "paliTitle": "Vitthatasuttaṃ",
      "englishTitle": "The Detailed Discourse",
      "sinhalaTitle": "විත්ථත සූත්‍රය"
    },
    {
      "number": 15,
      "pali": "‘‘Pañcimāni, bhikkhave, balāni. Katamāni pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ. Kattha ca, bhikkhave, saddhābalaṃ daṭṭhabbaṃ? Catūsu sotāpattiyaṅgesu. Ettha saddhābalaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, vīriyabalaṃ daṭṭhabbaṃ? Catūsu sammappadhānesu. Ettha vīriyabalaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, satibalaṃ daṭṭhabbaṃ? Catūsu satipaṭṭhānesu. Ettha satibalaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, samādhibalaṃ daṭṭhabbaṃ? Catūsu jhānesu. Ettha samādhibalaṃ daṭṭhabbaṃ. Kattha ca, bhikkhave, paññābalaṃ daṭṭhabbaṃ? Catūsu ariyasaccesu. Ettha paññābalaṃ daṭṭhabbaṃ. Imāni kho, bhikkhave, pañca balānī’’ti. Pañcamaṃ.",
      "english": "“Monks, these are the five powers. Which five? The power of unwavering confidence, the power of persistent effort, the power of mindfulness, the power of concentration, the power of wisdom. And where, monks, is the power of unwavering confidence to be seen? In the four factors of stream-entry. There, the power of unwavering confidence is to be seen. And where, monks, is the power of persistent effort to be seen? In the four right exertions. There, the power of persistent effort is to be seen. And where, monks, is the power of mindfulness to be seen? In the four foundations of mindfulness. There, the power of mindfulness is to be seen. And where, monks, is the power of concentration to be seen? In the four jhānas. There, the power of concentration is to be seen. And where, monks, is the power of wisdom to be seen? In the four noble truths. There, the power of wisdom is to be seen. These, monks, are the five powers.”",
      "sinhala": "භික්ෂූණි, මේ බලධර්ම පහක් ඇත. ඒවා කවරේද යත්, පහකි. ශ්‍රද්ධා බලය, වීර්ය බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලය යනුයි. භික්ෂූණි, ශ්‍රද්ධා බලය කොතැන දැක්ක යුතුද? සෝවාන් අංග සතරෙහි ය. එහි ශ්‍රද්ධා බලය දැක්ක යුතුයි. භික්ෂූණි, වීර්ය බලය කොතැන දැක්ක යුතුද? සම්‍යක් ප්‍රධන් සතරෙහි ය. එහි වීර්ය බලය දැක්ක යුතුයි. භික්ෂූණි, සති බලය කොතැන දැක්ක යුතුද? සතර සතිපට්ඨානයෙහි ය. එහි සති බලය දැක්ක යුතුයි. භික්ෂූණි, සමාධි බලය කොතැන දැක්ක යුතුද? සතර ධ්‍යානයෙහි ය. එහි සමාධි බලය දැක්ක යුතුයි. භික්ෂූණි, ප්‍රඥා බලය කොතැන දැක්ක යුතුද? ආර්ය සත්‍ය සතරෙහි ය. එහි ප්‍රඥා බලය දැක්ක යුතුයි. භික්ෂූණි, මේවා ඒ පස් බලධර්මයි.",
      "paliTitle": "Daṭṭhabbasuttaṃ",
      "englishTitle": "The Discourse on What Should Be Seen",
      "sinhalaTitle": "දට්ඨබ්බ සූත්‍රය"
    },
    {
      "number": 16,
      "pali": "‘‘Pañcimāni, bhikkhave, balāni. Katamāni pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – imāni kho, bhikkhave, pañca balāni. Imesaṃ kho, bhikkhave, pañcannaṃ balānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghātaniyaṃ, yadidaṃ paññābalaṃ. Seyyathāpi, bhikkhave, kūṭāgārassa etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghātaniyaṃ, yadidaṃ kūṭaṃ. Evamevaṃ kho, bhikkhave, imesaṃ pañcannaṃ balānaṃ etaṃ aggaṃ etaṃ saṅgāhikaṃ etaṃ saṅghātaniyaṃ, yadidaṃ paññābala’’nti. Chaṭṭhaṃ.",
      "english": "Monks, there are these five powers. What are these five? The power of faith, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom – these, monks, are the five powers. Among these five powers, monks, the power of wisdom is the foremost; it is that which encompasses them, that which unifies them. Just as, monks, for a peaked house, the peak is the foremost, it is that which encompasses it, that which unifies it; even so, monks, among these five powers, the power of wisdom is the foremost, it is that which encompasses them, that which unifies them.",
      "sinhala": "මහණෙනි, මේ බලධර්ම පසක් ඇත්තේය. ඒ පස කුමක්ද? ශ්‍රද්ධා බලය, වීර්ය බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලය යනුයි. මහණෙනි, මේවා බලධර්ම පසක් වන්නේය. මහණෙනි, මේ බලධර්ම පස අතරින් ප්‍රඥා බලයම අග්‍ර වන්නේය, සියල්ල එකට රැස් කර ගන්නේය, සියල්ල සම්පිණ්ඩනය කරන්නේය. මහණෙනි, යම්සේ මීදුම්ගෙයකට අග්‍ර වන්නේද, සියල්ල එකට රැස් කර ගන්නේද, සියල්ල සම්පිණ්ඩනය කරන්නේද යනු ශිඛරය වේද; එලෙසින්ම මහණෙනි, මේ බලධර්ම පස අතරින් අග්‍ර වන්නේද, සියල්ල එකට රැස් කර ගන්නේද, සියල්ල සම්පිණ්ඩනය කරන්නේද යනු ප්‍රඥා බලයම වන්නේය.",
      "paliTitle": "Punakūṭasuttaṃ",
      "englishTitle": "The Second Discourse on the Peak",
      "sinhalaTitle": "පුන කූට සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu attahitāya paṭipanno hoti, no parahitāya. Katamehi pañcahi? Idha, bhikkhave, bhikkhu attanā sīlasampanno hoti, no paraṃ sīlasampadāya samādapeti; attanā samādhisampanno hoti, no paraṃ samādhisampadāya samādapeti; attanā paññāsampanno hoti, no paraṃ paññāsampadāya samādapeti; attanā vimuttisampanno hoti, no paraṃ vimuttisampadāya samādapeti; attanā vimuttiñāṇadassanasampanno hoti, no paraṃ vimuttiñāṇadassanasampadāya samādapeti. Imehi kho, bhikkhave, pañcahi aṅgehi samannāgato bhikkhu attahitāya paṭipanno hoti, no parahitāyā’’ti. Sattamaṃ.",
      "english": "Monks, a monk endowed with five qualities practices for his own welfare, not for the welfare of others. Which five? Here, monks, a monk is himself endowed with moral conduct, but does not encourage others to be endowed with moral conduct; he is himself endowed with concentration, but does not encourage others to be endowed with concentration; he is himself endowed with wisdom, but does not encourage others to be endowed with wisdom; he is himself endowed with liberation, but does not encourage others to be endowed with liberation; he is himself endowed with the knowledge and vision of liberation, but does not encourage others to be endowed with the knowledge and vision of liberation. Monks, a monk endowed with these five factors practices for his own welfare, not for the welfare of others.",
      "sinhala": "භික්ෂූණි, පස් ධර්මයකින් යුක්ත වූ භික්ෂුවක් තමන්ගේ අර්ථය පිණිස පිළිපදින්නෙක් වේ, අනුන්ගේ අර්ථය පිණිස පිළිපදින්නෙක් නොවේ.\n\nකවර පසකින්ද?\n\nභික්ෂූණි, මෙහිලා භික්ෂුවක් තමන් විසින්ම සීලයෙන් යුක්ත වේ, අනුන් සීල සම්පදාවට සමදවන්නේ නොවේ; තමන් විසින්ම සමාධියෙන් යුක්ත වේ, අනුන් සමාධි සම්පදාවට සමදවන්නේ නොවේ; තමන් විසින්ම ප්‍රඥාවෙන් යුක්ත වේ, අනුන් ප්‍රඥා සම්පදාවට සමදවන්නේ නොවේ; තමන් විසින්ම විමුක්තියෙන් යුක්ත වේ, අනුන් විමුක්ති සම්පදාවට සමදවන්නේ නොවේ; තමන් විසින්ම විමුක්ති ඥාන දර්ශනයෙන් යුක්ත වේ, අනුන් විමුක්ති ඥාන දර්ශන සම්පදාවට සමදවන්නේ නොවේ.\n\nභික්ෂූණි, මේ පස් අංගයකින් යුක්ත වූ භික්ෂුවක් තමන්ගේ අර්ථය පිණිස පිළිපදින්නෙක් වේ, අනුන්ගේ අර්ථය පිණිස පිළිපදින්නෙක් නොවේ.",
      "paliTitle": "Paṭhamahitasuttaṃ",
      "englishTitle": "The First Discourse on Benefit",
      "sinhalaTitle": "පළමු හිත සූත්‍රය"
    },
    {
      "number": 18,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu parahitāya paṭipanno hoti, no attahitāya. Katamehi pañcahi? Idha, bhikkhave, bhikkhu attanā na sīlasampanno hoti, paraṃ sīlasampadāya samādapeti; attanā na samādhisampanno hoti, paraṃ samādhisampadāya samādapeti; attanā na paññāsampanno hoti, paraṃ paññāsampadāya samādapeti; attanā na vimuttisampanno hoti, paraṃ vimuttisampadāya samādapeti; attanā na vimuttiñāṇadassanasampanno hoti, paraṃ vimuttiñāṇadassanasampadāya samādapeti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu parahitāya paṭipanno hoti, no attahitāyā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities engages in practice for the benefit of others, not for his own benefit. Which five? Here, monks, a bhikkhu is not himself endowed with virtue, yet he establishes others in the accomplishment of virtue; he is not himself endowed with concentration, yet he establishes others in the accomplishment of concentration; he is not himself endowed with wisdom, yet he establishes others in the accomplishment of wisdom; he is not himself endowed with liberation, yet he establishes others in the accomplishment of liberation; he is not himself endowed with the knowledge and vision of liberation, yet he establishes others in the accomplishment of the knowledge and vision of liberation. Indeed, monks, a bhikkhu endowed with these five qualities engages in practice for the benefit of others, not for his own benefit.",
      "sinhala": "මහණෙනි, කරුණු පසකින් යුත් භික්ෂුව අනුන්ගේ යහපත පිණිස පිළිපදින්නෙක් වේ මිස, තමන්ගේ යහපත පිණිස පිළිපදින්නෙක් නොවෙයි. ඒ කවර කරුණු පසකින්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව තමන් විසින් සීලසම්ප‍න්න නොවේ. අනුන් සීලසම්පදාවෙහි සමාදන් කරවයි. තමන් විසින් සමාධිසම්ප‍න්න නොවේ. අනුන් සමාධිසම්පදාවෙහි සමාදන් කරවයි. තමන් විසින් ප්‍ර‍ඥා‍සම්ප‍න්න නොවේ. අනුන් ප්‍ර‍ඥා‍සම්පදාවෙහි සමාදන් කරවයි. තමන් විසින් විමුක්තිසම්ප‍න්න නොවේ. අනුන් විමුක්තිසම්පදාවෙහි සමාදන් කරවයි. තමන් විසින් විමුක්තිඥා‍නදර්ශ‍නසම්ප‍න්න නොවේ. අනුන් විමුක්තිඥා‍නදර්ශ‍නසම්පදාවෙහි සමාදන් කරවයි.\n\nමහණෙනි, මේ කරුණු පසින් යුත් භික්ෂුව අනුන්ගේ යහපත පිණිස පිළිපදින්නෙක් වේ මිස, තමන්ගේ යහපත පිණිස පිළිපදින්නෙක් නොවෙයි.",
      "paliTitle": "Dutiyahitasuttaṃ",
      "englishTitle": "Second Sutta on Welfare",
      "sinhalaTitle": "දුතිය හිත සූත්‍රය"
    },
    {
      "number": 19,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu neva attahitāya paṭipanno hoti, no parahitāya. Katamehi pañcahi? Idha, bhikkhave, bhikkhu attanā na sīlasampanno hoti, no paraṃ sīlasampadāya samādapeti; attanā na samādhisampanno hoti, no paraṃ samādhisampadāya samādapeti; attanā na paññāsampanno hoti, no paraṃ paññāsampadāya samādapeti; attanā na vimuttisampanno hoti, no paraṃ vimuttisampadāya samādapeti; attanā na vimuttiñāṇadassanasampanno hoti, no paraṃ vimuttiñāṇadassanasampadāya samādapeti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu neva attahitāya paṭipanno hoti, no parahitāyā’’ti. Navamaṃ.",
      "english": "Bhikkhus, a monk endowed with five qualities practices neither for his own welfare nor for the welfare of others. Which five? Here, bhikkhus, a monk is himself not accomplished in virtue, nor does he encourage others to be accomplished in virtue; he is himself not accomplished in concentration, nor does he encourage others to be accomplished in concentration; he is himself not accomplished in wisdom, nor does he encourage others to be accomplished in wisdom; he is himself not accomplished in liberation, nor does he encourage others to be accomplished in liberation; he is himself not accomplished in the knowledge and vision of liberation, nor does he encourage others to be accomplished in the knowledge and vision of liberation. Indeed, bhikkhus, a monk endowed with these five qualities practices neither for his own welfare nor for the welfare of others.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ භික්ෂුව තමාගේ යහපත පිණිසත් නොපිළිපන්නේ වෙයි, අනුන්ගේ යහපත පිණිසත් නොපිළිපන්නේ වෙයි. කවර කරුණු පහකින්ද? මහණෙනි, මේ ශාසනයෙහිලා භික්ෂුව තමා සීල සම්පන්න නොවේ. අනුන් සීල සම්පන්නභාවයට සමාදන් කරවන්නේද නොවේ. තමා සමාධි සම්පන්න නොවේ. අනුන් සමාධි සම්පන්නභාවයට සමාදන් කරවන්නේද නොවේ. තමා ප්‍රඥාසම්පන්න නොවේ. අනුන් ප්‍රඥාසම්පන්නභාවයට සමාදන් කරවන්නේද නොවේ. තමා විමුක්ති සම්පන්න නොවේ. අනුන් විමුක්ති සම්පන්නභාවයට සමාදන් කරවන්නේද නොවේ. තමා විමුක්තිඥානදර්ශන සම්පන්න නොවේ. අනුන් විමුක්තිඥානදර්ශන සම්පන්නභාවයට සමාදන් කරවන්නේද නොවේ. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ භික්ෂුව තමාගේ යහපත පිණිසත් නොපිළිපන්නේ වෙයි, අනුන්ගේ යහපත පිණිසත් නොපිළිපන්නේ වෙයි.",
      "paliTitle": "Tatiyahitasuttaṃ",
      "englishTitle": "Third Discourse on Welfare",
      "sinhalaTitle": "තතිය හිත සූත්‍රය"
    },
    {
      "number": 20,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu attahitāya ca paṭipanno hoti parahitāya ca. Katamehi pañcahi? Idha, bhikkhave, bhikkhu attanā ca sīlasampanno hoti, parañca sīlasampadāya samādapeti; attanā ca samādhisampanno hoti, parañca samādhisampadāya samādapeti, attanā ca paññāsampanno hoti, parañca paññāsampadāya samādapeti; attanā ca vimuttisampanno hoti, parañca vimuttisampadāya samādapeti; attanā ca vimuttiñāṇadassanasampanno hoti, parañca vimuttiñāṇadassanasampadāya samādapeti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu attahitāya ca paṭipanno hoti parahitāya cā’’ti. Dasamaṃ. ",
      "english": "Monks, a bhikkhu endowed with five qualities practices for his own welfare and for the welfare of others. Which five?\n\nHere, monks, a bhikkhu is himself accomplished in moral virtue and establishes others in the accomplishment of moral virtue. He is himself accomplished in concentration and establishes others in the accomplishment of concentration. He is himself accomplished in wisdom and establishes others in the accomplishment of wisdom. He is himself accomplished in liberation and establishes others in the accomplishment of liberation. He is himself accomplished in the knowledge and vision of liberation and establishes others in the accomplishment of the knowledge and vision of liberation.\n\nMonks, a bhikkhu endowed with these five qualities practices for his own welfare and for the welfare of others.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්‍ෂුව තමන්ගේ යහපත පිණිස ද, අනුන්ගේ යහපත පිණිස ද පිළිපදින්නෙක් වෙයි. කවර පස් වැදෑරුම් ධර්මයන්ගෙන් ද? මහණෙනි, මෙහිලා භික්‍ෂුව තමන් විසින් ම සීලසම්පන්න වෙයි, අනුන් ද සීලසම්පදාවෙහි සමාදන් කරවයි; තමන් විසින් ම සමාධිසම්පන්න වෙයි, අනුන් ද සමාධිසම්පදාවෙහි සමාදන් කරවයි, තමන් විසින් ම ප්‍රඥාසම්පන්න වෙයි, අනුන් ද ප්‍රඥාසම්පදාවෙහි සමාදන් කරවයි; තමන් විසින් ම විමුක්තිසම්පන්න වෙයි, අනුන් ද විමුක්තිසම්පදාවෙහි සමාදන් කරවයි; තමන් විසින් ම විමුක්තිඥානදර්ශනසම්පන්න වෙයි, අනුන් ද විමුක්තිඥානදර්ශනසම්පදාවෙහි සමාදන් කරවයි. මහණෙනි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්‍ෂුව තමන්ගේ යහපත පිණිස ද, අනුන්ගේ යහපත පිණිස ද පිළිපදින්නෙක් වේ.",
      "paliTitle": "Catutthahitasuttaṃ",
      "englishTitle": "Fourth Sutta on Welfare",
      "sinhalaTitle": "චතුත්ථ හිත සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Balavaggo dutiyo. Tassuddānaṃ – Ananussutakūṭañca, saṃkhittaṃ vitthatena ca; Daṭṭhabbañca puna kūṭaṃ, cattāropi hitena cāti.",
    "english": "The Chapter on Powers is the second. The summary of it: Not Heard, The Peak, Brief, and In Detail; To be Seen, again The Peak, and four on Benefit.",
    "sinhala": "දෙවන බල වර්ගයයි. එහි උද්දානය නම්: අනනුස්සුත, කූට, සංඛිත්ත, විත්ථත, දට්ඨබ්බ, නැවත කූට සහ හිත සූත්‍ර හතරකි."
  }
}