{
  "id": "an5.27",
  "title": {
    "pali": "Sammutipeyyālaṃ",
    "english": "The Section on Conventional Designations (and so forth)",
    "sinhala": "සම්මුති පෙය්‍යාළය"
  },
  "sections": [
    {
      "number": 272,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhattuddesako na sammannitabbo [na sammanitabbo (ka.) cūḷava. 326 passitabbaṃ]. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, uddiṭṭhānuddiṭṭhaṃ na jānāti – imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhattuddesako na sammannitabbo. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhattuddesako sammannitabbo. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, uddiṭṭhānuddiṭṭhaṃ jānāti – imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhattuddesako sammannitabboti. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhattuddesako sammato [sammatopi (sī.)] na pesetabbo…pe… sammato pesetabbo… bālo veditabbo… paṇḍito veditabbo… khataṃ upahataṃ attānaṃ pariharati… akkhataṃ anupahataṃ attānaṃ pariharati… yathābhataṃ nikkhitto evaṃ niraye… yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, uddiṭṭhānuddiṭṭhaṃ jānāti – imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ.",
      "english": "Monks, endowed with five qualities, a food-assigner should not be appointed. Which five? He acts out of partiality, he acts out of aversion, he acts out of delusion, he acts out of fear, and he does not know what has been assigned and what has not been assigned. Monks, endowed with these five qualities, a food-assigner should not be appointed.\n\nMonks, endowed with five qualities, a food-assigner should be appointed. Which five? He does not act out of partiality, he does not act out of aversion, he does not act out of delusion, he does not act out of fear, and he knows what has been assigned and what has not been assigned. Monks, endowed with these five qualities, a food-assigner should be appointed.\n\nMonks, an appointed food-assigner, if he acts out of partiality, aversion, delusion, and fear, and does not know what has been assigned and what has not been assigned, should not be sent forth; he is to be known as foolish; he brings harm and injury to himself; and he is, as if carried, deposited in hell. But if he does not act out of partiality, aversion, delusion, or fear, and knows what has been assigned and what has not been assigned, he should be sent forth; he is to be known as wise; he brings no harm and no injury to himself; and he is, as if carried, deposited in heaven. Which five qualities lead to being deposited in heaven? He does not act out of partiality, he does not act out of aversion, he does not act out of delusion, he does not act out of fear, and he knows what has been assigned and what has not been assigned. Monks, endowed with these five qualities, a food-assigner is, as if carried, deposited in heaven.",
      "sinhala": "භික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් (ආහාරාදිය බෙදීමට) පත් නොකළ යුතුය. ඒ කුමන කරුණු පහකින්ද? ඔහු ඡන්දාගතියට යයි, ද්වේෂාගතියට යයි, මෝහාගතියට යයි, භයාගතියට යයි, නියම කළ සහ නියම නොකළ දේ නොදනී. භික්ෂූනි, මේ කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් පත් නොකළ යුතුය.\n\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් (ආහාරාදිය බෙදීමට) පත් කළ යුතුය. ඒ කුමන කරුණු පහකින්ද? ඔහු ඡන්දාගතියට නොයයි, ද්වේෂාගතියට නොයයි, මෝහාගතියට නොයයි, භයාගතියට නොයයි, නියම කළ සහ නියම නොකළ දේ දනී. භික්ෂූනි, මේ කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් පත් කළ යුතුය.\n\nභික්ෂූනි, කරුණු පහකින් (ඡන්දාගතියට යන ආදී අකුසල කරුණු) යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් පත් කරන ලද නමුත්, (කිසිදු කාර්යයක් සඳහා) යැවිය යුතු නැත.\nභික්ෂූනි, කරුණු පහකින් (ඡන්දාගතියට නොයන ආදී කුසල කරුණු) යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් පත් කරන ලද අතර, (කිසිදු කාර්යයක් සඳහා) යැවිය යුතු වේ.\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් බාලයෙකු ලෙස දත යුතු වේ.\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් පණ්ඩිතයෙකු ලෙස දත යුතු වේ.\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් තමාට හානි සිදුකරගනී.\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් තමාට හානි සිදුනොකරගනී.\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් ගෙන ආ අයුරින්ම නිරයට පත්වෙයි.\nභික්ෂූනි, කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුවක් ගෙන ආ අයුරින්ම ස්වර්ගයට පත්වෙයි.\nඒ කුමන කරුණු පහකින්ද? ඔහු ඡන්දාගතියට නොයයි, ද්වේෂාගතියට නොයයි, මෝහාගතියට නොයයි, භයාගතියට නොයයි, නියම කළ සහ නියම නොකළ දේ දනී. භික්ෂූනි, මේ කරුණු පහකින් යුක්ත වූ භත්තූද්දේසක භික්ෂුව, ගෙන ආ අයුරින්ම ස්වර්ගයට පත්වෙයි.",
      "paliTitle": "Bhattuddesakasuttaṃ",
      "englishTitle": "The Appointer of Meals Sutta",
      "sinhalaTitle": "භත්තුද්දේසක සූත්‍රය"
    },
    {
      "number": 273,
      "numberRange": "273-285",
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato senāsanapaññāpako na sammannitabbo… pe… paññattāpaññattaṃ na jānāti…pe… senāsanapaññāpako sammannitabbo…pe… paññattāpaññattaṃ jānāti…pe…. Senāsanagāhāpako na sammannitabbo…pe… gahitāgahitaṃ [paññattāpaññattaṃ (sī. syā. kaṃ.)] na jānāti…pe… senāsanagāhāpako sammannitabbo…pe… gahitāgahitaṃ [paññattāpaññattaṃ (sī. syā. kaṃ.)] jānāti…pe…. Bhaṇḍāgāriko na sammannitabbo…pe… guttāguttaṃ na jānāti… bhaṇḍāgāriko sammannitabbo… pe… guttāguttaṃ jānāti…pe…. Cīvarapaṭiggāhako na sammannitabbo…pe… gahitāgahitaṃ na jānāti… cīvarapaṭiggāhako sammannitabbo …pe… gahitāgahitaṃ jānāti…pe…. Cīvarabhājako na sammannitabbo…pe… bhājitābhājitaṃ na jānāti… cīvarabhājako sammannitabbo…pe… bhājitābhājitaṃ jānāti…pe…. Yāgubhājako na sammannitabbo…pe… yāgubhājako sammannitabbo…pe…. Phalabhājako na sammannitabbo…pe… phalabhājako sammannitabbo…pe…. Khajjakabhājako na sammannitabbo…pe… bhājitābhājitaṃ na jānāti… khajjakabhājako sammannitabbo…pe… bhājitābhājitaṃ jānāti…pe…. Appamattakavissajjako na sammannitabbo…pe… vissajjitāvissajjitaṃ na jānāti… appamattakavissajjako sammannitabbo…pe… vissajjitāvissajjitaṃ jānāti…. Sāṭiyaggāhāpako na sammannitabbo…pe… gahitāgahitaṃ na jānāti … sāṭiyaggāhāpako sammannitabbo…pe… gahitāgahitaṃ jānāti…. Pattaggāhāpako na sammannitabbo…pe… gahitāgahitaṃ na jānāti… pattaggāhāpako sammannitabbo…pe… gahitāgahitaṃ jānāti…. Ārāmikapesako na sammannitabbo…pe… ārāmikapesako sammannitabbo…pe…. Sāmaṇerapesako na sammannitabbo…pe… sāmaṇerapesako sammannitabbo…pe…. Sammato na pesetabbo…pe… sammato pesetabbo…pe…. Sāmaṇerapesako bālo veditabbo…pe… paṇḍito veditabbo… khataṃ upahataṃ attānaṃ pariharati… akkhataṃ anupahataṃ attānaṃ pariharati… yathābhataṃ nikkhitto evaṃ niraye… yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, pesitāpesitaṃ jānāti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ sagge’’ti. Cuddasamaṃ. ",
      "english": "Monks, an arranger of lodgings endowed with five qualities should not be appointed: one who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been assigned and what has not been assigned; an arranger of lodgings, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been assigned and what has not been assigned. A receiver of lodgings should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been received and what has not been received; a receiver of lodgings, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been received and what has not been received. A storekeeper should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been guarded and what has not been guarded; a storekeeper, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been guarded and what has not been guarded. A receiver of robes should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been received and what has not been received; a receiver of robes, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been received and what has not been received. A distributor of robes should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been distributed and what has not been distributed; a distributor of robes, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been distributed and what has not been distributed. A distributor of gruel should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been distributed and what has not been distributed; a distributor of gruel, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been distributed and what has not been distributed. A distributor of fruits should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been distributed and what has not been distributed; a distributor of fruits, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been distributed and what has not been distributed. A distributor of snacks should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been distributed and what has not been distributed; a distributor of snacks, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been distributed and what has not been distributed. A dispenser of small articles should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been dispensed and what has not been dispensed; a dispenser of small articles, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been dispensed and what has not been dispensed. A receiver of inner robes should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been received and what has not been received; a receiver of inner robes, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been received and what has not been received. A receiver of alms bowls should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been received and what has not been received; a receiver of alms bowls, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been received and what has not been received. An assigner of monastery attendants should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been assigned and what has not been assigned; an assigner of monastery attendants, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been assigned and what has not been assigned. An assigner of novice monks should not be appointed who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been assigned and what has not been assigned; an assigner of novice monks, however, should be appointed who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been assigned and what has not been assigned. An appointed person should not be sent on a task who follows the path of desire, follows the path of aversion, follows the path of delusion, follows the path of fear, and does not know what has been assigned and what has not been assigned; an appointed person, however, should be sent on a task who does not follow the path of desire, does not follow the path of aversion, does not follow the path of delusion, does not follow the path of fear, and knows what has been assigned and what has not been assigned. An assigner of novice monks should be recognized as foolish who, following the path of desire, following the path of aversion, following the path of delusion, and following the path of fear, and not knowing what has been assigned and what has not been assigned, brings harm and injury to himself, and like one carried there, is deposited in hell. An assigner of novice monks should be recognized as wise who, not following the path of desire, not following the path of aversion, not following the path of delusion, and not following the path of fear, and knowing what has been assigned and what has not been assigned, guards himself uninjured and unharmed, and like one carried there, is deposited in heaven. Which five are these? They do not follow the path of desire, do not follow the path of aversion, do not follow the path of delusion, do not follow the path of fear, and know what has been assigned and what has not been assigned. Indeed, monks, an assigner of novice monks endowed with these five qualities, like one carried there, is deposited in heaven.",
      "sinhala": "භික්‍ෂූනි, මේ කරුණු පහකින් යුක්ත වූ සේනාසනප්‍රඥාපකයෙක් (සේනාසන පනවන පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට (කැමැත්ත අනුව අගතිගාමී වීම) යන්නේ ය, දෝසාගතියට (ද්වේෂය අනුව අගතිගාමී වීම) යන්නේ ය, මෝහාගතියට (මෝහය අනුව අගතිගාමී වීම) යන්නේ ය, භයාගතියට (භය අනුව අගතිගාමී වීම) යන්නේ ය, පැනවූ දේ හා නොපැනවූ දේ (නිවැරදිව නියම කළ දේ හා එසේ නොකළ දේ) නොදනී.\n\nභික්‍ෂූනි, මේ කරුණු පහකින් යුක්ත වූ සේනාසනප්‍රඥාපකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, පැනවූ දේ හා නොපැනවූ දේ දනී.\n\nසේනාසනග්‍රාහකයෙක් (සේනාසන භාරගන්නා පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ (නිවැරදිව භාරගත් දේ හා එසේ නොගත් දේ) නොදනී.\n\nසේනාසනග්‍රාහකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ දනී.\n\nභාණ්ඩාගාරිකයෙක් (භාණ්ඩාගාරය බාර පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, ආරක්‍ෂා කළ දේ හා නොකළ දේ (නිවැරදිව ආරක්‍ෂා කළ දේ හා එසේ නොකළ දේ) නොදනී.\n\nභාණ්ඩාගාරිකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, ආරක්‍ෂා කළ දේ හා නොකළ දේ දනී.\n\nචීවරප්‍රතිග්‍රාහකයෙක් (සිවුරු භාරගන්නා පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ (නිවැරදිව භාරගත් සිවුරු හා එසේ නොගත් සිවුරු) නොදනී.\n\nචීවරප්‍රතිග්‍රාහකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ දනී.\n\nචීවරභාජකයෙක් (සිවුරු බෙදන පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, බෙදන ලද දේ හා නොබෙදන ලද දේ (නිවැරදිව බෙදූ සිවුරු හා එසේ නොබෙදූ සිවුරු) නොදනී.\n\nචීවරභාජකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, බෙදන ලද දේ හා නොබෙදන ලද දේ දනී.\n\nයාගුභාජකයෙක් (කැඳ බෙදන පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය.\n\nයාගුභාජකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය.\n\nඵලභාජකයෙක් (පළතුරු බෙදන පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය.\n\nඵලභාජකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය.\n\nඛජ්ජකභාජකයෙක් (සැරොත් බෙදන පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, බෙදන ලද දේ හා නොබෙදන ලද දේ (නිවැරදිව බෙදූ දේ හා එසේ නොබෙදූ දේ) නොදනී.\n\nඛජ්ජකභාජකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, බෙදන ලද දේ හා නොබෙදන ලද දේ දනී.\n\nඅල්පමාත්‍රකවිසර්ජකයෙක් (කුඩා ද්‍රව්‍ය බෙදා හරින පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, මුදාහළ දේ හා නොමුදාහළ දේ (නිවැරදිව බෙදා හැරිය දේ හා එසේ නොකළ දේ) නොදනී.\n\nඅල්පමාත්‍රකවිසර්ජකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, මුදාහළ දේ හා නොමුදාහළ දේ දනී.\n\nසාටියග්‍රාහකයෙක් (කඩපිළි භාරගන්නා පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ (නිවැරදිව භාරගත් දේ හා එසේ නොගත් දේ) නොදනී.\n\nසාටියග්‍රාහකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ දනී.\n\nපාත්‍රග්‍රාහකයෙක් (පාත්‍ර භාරගන්නා පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ (නිවැරදිව භාරගත් දේ හා එසේ නොගත් දේ) නොදනී.\n\nපාත්‍රග්‍රාහකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, ගන්නා ලද දේ හා නොගන්නා ලද දේ දනී.\n\nආරාමිකපේෂකයෙක් (ආරාමිකයන් යවන පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය.\n\nආරාමිකපේෂකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය.\n\nසාමණේරපේෂකයෙක් (සාමණේරයන් යවන පුද්ගලයෙක්) සේවය සඳහා පත් නොකළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, යැවිය යුතු දේ හා නොයැවිය යුතු දේ නොදනී.\n\nසාමණේරපේෂකයෙක් සේවය සඳහා පත් කළ යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, යැවිය යුතු දේ හා නොයැවිය යුතු දේ දනී.\n\n(මෙහි සඳහන් කරුණු පහකින් යුක්තව) පත් කරන ලද තැනැත්තා (අගතිගාමී නම්) යැවීම සඳහා සුදුසු නොවේ. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, යැවිය යුතු දේ හා නොයැවිය යුතු දේ නොදනී.\n\nපත් කරන ලද තැනැත්තා (අගතිගාමී නොවේ නම්) යැවීම සඳහා සුදුසු වේ. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, යැවිය යුතු දේ හා නොයැවිය යුතු දේ දනී.\n\nසාමණේරපේෂකයෙක් (සාමණේරයන් යවන පුද්ගලයෙක්) බාලයෙකු ලෙස දත යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට යන්නේ ය, දෝසාගතියට යන්නේ ය, මෝහාගතියට යන්නේ ය, භයාගතියට යන්නේ ය, යැවිය යුතු දේ හා නොයැවිය යුතු දේ නොදනී. ඔහු තමා විනාශයට හා පීඩාවට පමුණුවා ගනී. ඔහු ගෙනා පරිද්දෙන්ම නිරයේ හෙළනු ලැබේ.\n\nසාමණේරපේෂකයෙක් පණ්ඩිතයෙකු ලෙස දත යුතු ය. කවර කරුණු පහකින් ද යත්: ඔහු ඡන්දාගතියට නොයන්නේ ය, දෝසාගතියට නොයන්නේ ය, මෝහාගතියට නොයන්නේ ය, භයාගතියට නොයන්නේ ය, යැවිය යුතු දේ හා නොයැවිය යුතු දේ දනී. ඔහු තමා අවිනාශයට හා අපීඩාවට පමුණුවා ගනී. ඔහු ගෙනා පරිද්දෙන්ම ස්වර්ගයේ හෙළනු ලැබේ.\n\nභික්‍ෂූනි, මේ කරුණු පහකින් යුක්ත වූ සාමණේරපේෂක තැනැත්තා ගෙනා පරිද්දෙන්ම ස්වර්ගයේ හෙළනු ලබන්නේ ය.",
      "paliTitle": "Senāsanapaññāpakasuttāditerasakaṃ",
      "englishTitle": "The Thirteen Discourses on the Appointers of Lodgings",
      "sinhalaTitle": "සේනාසනපඤ්ඤාපකසූත්තාදි තේරසකය"
    }
  ],
  "footer": {
    "pali": "Sammutipeyyālaṃ niṭṭhitaṃ.",
    "english": "The Abbreviated Series on Consents is finished.",
    "sinhala": "සම්මුති පෙය්‍යාලය නිමයි."
  }
}