{
  "id": "an5.11",
  "title": {
    "pali": "Tatiyapaṇṇāsakaṃ - Phāsuvihāravaggo",
    "english": "The Third Fifties Section - The Chapter on Comfortable Living",
    "sinhala": "තතිය පණ්ණාසකය - ඵාසුවිහාර වර්ගය"
  },
  "sections": [
    {
      "number": 101,
      "pali": "‘‘Pañcime, bhikkhave, sekhavesārajjakaraṇā dhammā. Katame pañca? Idha, bhikkhave, bhikkhu saddho hoti, sīlavā hoti, bahussuto hoti, āraddhavīriyo hoti, paññavā hoti. ‘‘Yaṃ, bhikkhave, assaddhassa sārajjaṃ hoti, saddhassa taṃ sārajjaṃ na hoti. Tasmāyaṃ dhammo sekhavesārajjakaraṇo. ‘‘Yaṃ, bhikkhave, dussīlassa sārajjaṃ hoti, sīlavato taṃ sārajjaṃ na hoti. Tasmāyaṃ dhammo sekhavesārajjakaraṇo. ‘‘Yaṃ, bhikkhave, appassutassa sārajjaṃ hoti, bahussutassa taṃ sārajjaṃ na hoti. Tasmāyaṃ dhammo sekhavesārajjakaraṇo. ‘‘Yaṃ, bhikkhave, kusītassa sārajjaṃ hoti, āraddhavīriyassa taṃ sārajjaṃ na hoti. Tasmāyaṃ dhammo sekhavesārajjakaraṇo. ‘‘Yaṃ, bhikkhave, duppaññassa sārajjaṃ hoti, paññavato taṃ sārajjaṃ na hoti. Tasmāyaṃ dhammo sekhavesārajjakaraṇo. Ime kho, bhikkhave, pañca sekhavesārajjakaraṇā dhammā’’ti. Paṭhamaṃ.",
      "english": "Monks, these five qualities bring confidence to a trainee. Which five? Here, monks, a monk is endowed with faith, is endowed with moral conduct, is learned in the Dhamma, has aroused persistent effort, and is endowed with wisdom.\n\nMonks, whatever apprehension arises in one who is faithless, that apprehension does not arise in one who is faithful. Therefore, this quality brings confidence to a trainee.\n\nMonks, whatever apprehension arises in one who is immoral, that apprehension does not arise in one who is moral. Therefore, this quality brings confidence to a trainee.\n\nMonks, whatever apprehension arises in one who is unlearned, that apprehension does not arise in one who is learned. Therefore, this quality brings confidence to a trainee.\n\nMonks, whatever apprehension arises in one who is lazy, that apprehension does not arise in one who has aroused persistent effort. Therefore, this quality brings confidence to a trainee.\n\nMonks, whatever apprehension arises in one who is unwise, that apprehension does not arise in one who is wise. These, monks, are the five qualities that bring confidence to a trainee.",
      "sinhala": "මහණෙනි, සේඛයාගේ නිර්භීතභාවය ඇතික‍රන මේ ධර්ම කරුණු පහක් ඇත. ඒ මොනවාද?\n\nමහණෙනි, මෙහිලා භික්ෂුව ශ්‍ර[ZWJ]ද්ධාවෙන් යුක්ත වෙයි, සිල්වත් වෙයි, බහුශ්‍ර[ZWJ]ත වෙයි, වීර්[ZWJ]යය ආරම්භ කළ කෙනෙක් වෙයි, ප්‍ර[ZWJ]ඥාවෙන් යුක්ත වෙයි.\n\nමහණෙනි, අශ්‍ර[ZWJ]ද්ධාවන්තයාට යම් පසුතැවීමක් හෝ ලැජ්ජාවක් ඇතිවේද, ශ්‍ර[ZWJ]ද්ධාවන්තයාට ඒ පසුතැවීම ඇති නොවේ. එබැවින් මේ ධර්[ZWJ]මය සේඛයාගේ නිර්භීතභාවය ඇතික‍රන ක‍රුණකි.\n\nමහණෙනි, දුස්සීලයාට යම් පසුතැවීමක් හෝ ලැජ්ජාවක් ඇතිවේද, සිල්වතාට ඒ පසුතැවීම ඇති නොවේ. එබැවින් මේ ධර්[ZWJ]මය සේඛයාගේ නිර්භීතභාවය ඇතික‍රන ක‍රුණකි.\n\nමහණෙනි, අල්පශ්‍ර[ZWJ]තයාට යම් පසුතැවීමක් හෝ ලැජ්ජාවක් ඇතිවේද, බහුශ්‍ර[ZWJ]තයාට ඒ පසුතැවීම ඇති නොවේ. එබැවින් මේ ධර්[ZWJ]මය සේඛයාගේ නිර්භීතභාවය ඇතික‍රන ක‍රුණකි.\n\nමහණෙනි, කුසීතයාට යම් පසුතැවීමක් හෝ ලැජ්ජාවක් ඇතිවේද, වීර්[ZWJ]යය ආරම්භ කළ කෙනෙකුට ඒ පසුතැවීම ඇති නොවේ. එබැවින් මේ ධර්[ZWJ]මය සේඛයාගේ නිර්භීතභාවය ඇතික‍රන ක‍රුණකි.\n\nමහණෙනි, දුෂ්ප්‍ර[ZWJ]ඥයාට යම් පසුතැවීමක් හෝ ලැජ්ජාවක් ඇතිවේද, ප්‍ර[ZWJ]ඥාවන්තයාට ඒ පසුතැවීම ඇති නොවේ. එබැවින් මේ ධර්[ZWJ]මය සේඛයාගේ නිර්භීතභාවය ඇතික‍රන ක‍රුණකි.\n\nමහණෙනි, සේඛයාගේ නිර්භීතභාවය ඇතික‍රන මේ ධර්[ZWJ]ම කරුණු පහ මේවාය.",
      "paliTitle": "Sārajjasuttaṃ",
      "englishTitle": "Discourse on Timidity",
      "sinhalaTitle": "සාරජ්‍ජ සූත්‍රය"
    },
    {
      "number": 102,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ussaṅkitaparisaṅkito hoti pāpabhikkhūti api akuppadhammopi [api akuppadhammo (sī. syā. kaṃ.)]. Katamehi pañcahi? Idha, bhikkhave, bhikkhu vesiyāgocaro vā hoti, vidhavāgocaro vā hoti, thullakumārikāgocaro vā hoti, paṇḍakagocaro vā hoti, bhikkhunīgocaro vā hoti. ‘‘Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ussaṅkitaparisaṅkito hoti pāpabhikkhūti api akuppadhammopī’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, a monk endowed with five qualities becomes subject to suspicion and doubt as an evil monk, even if he is one whose liberation is unshakeable. What are these five? Here, bhikkhus, a monk frequents prostitutes, or frequents widows, or frequents grown-up maidens, or frequents eunuchs, or frequents nuns. Indeed, bhikkhus, a monk endowed with these five qualities becomes subject to suspicion and doubt as an evil monk, even if he is one whose liberation is unshakeable.",
      "sinhala": "භික්‍ෂූණි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්‍ෂුවක්, කිසිවකින් කම්පා කළ නොහැකි ධර්ම ස්වභාවයක් ඇති අයෙක් වුව ද, පව්කාර භික්‍ෂුවක් ලෙස සැකයට හා විමතියට පත් වේ.\n\nඒ කවර පස් වැදෑරුම් ධර්මයන්ගෙන් ද? භික්‍ෂූණි, මෙහිලා භික්‍ෂුවක් වේශ්යාවන්ගේ ඇසුරට යන්නෙක් වේ ද, වැන්දඹුවන්ගේ ඇසුරට යන්නෙක් වේ ද, වැඩිවියට පත් කන්‍යාවන්ගේ ඇසුරට යන්නෙක් වේ ද, පණ්ඩකයන්ගේ ඇසුරට යන්නෙක් වේ ද, භික්‍ෂුණීන්ගේ ඇසුරට යන්නෙක් වේ ද,\n\nභික්‍ෂූණි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්‍ෂුවක්, කිසිවකින් කම්පා කළ නොහැකි ධර්ම ස්වභාවයක් ඇති අයෙක් වුව ද, පව්කාර භික්‍ෂුවක් ලෙස සැකයට හා විමතියට පත් වේ.\n\nදෙවැනි සූත්‍රයයි.",
      "paliTitle": "Ussaṅkitasuttaṃ",
      "englishTitle": "The Discourse on Apprehension",
      "sinhalaTitle": "උස්සංකිත සූත‍්‍රය"
    },
    {
      "number": 103,
      "pali": "‘‘Pañcahi, bhikkhave, aṅgehi samannāgato mahācoro sandhimpi chindati, nillopampi harati, ekāgārikampi karoti, paripanthepi tiṭṭhati. Katamehi pañcahi? Idha, bhikkhave, mahācoro visamanissito ca hoti, gahananissito ca, balavanissito ca, bhogacāgī ca, ekacārī ca. ‘‘Kathañca, bhikkhave, mahācoro visamanissito hoti? Idha, bhikkhave, mahācoro nadīviduggaṃ vā nissito hoti pabbatavisamaṃ vā. Evaṃ kho, bhikkhave, mahācoro visamanissito hoti. ‘‘Kathañca, bhikkhave, mahācoro gahananissito hoti? Idha, bhikkhave, mahācoro tiṇagahanaṃ vā nissito hoti rukkhagahanaṃ vā rodhaṃ [gedhaṃ (sī.) a. ni. 3.51] vā mahāvanasaṇḍaṃ vā. Evaṃ kho, bhikkhave, mahācoro gahananissito hoti. ‘‘Kathañca, bhikkhave, mahācoro balavanissito hoti? Idha, bhikkhave, mahācoro rājānaṃ vā rājamahāmattānaṃ vā nissito hoti. Tassa evaṃ hoti – ‘sace maṃ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇissantī’ti. Sace naṃ koci kiñci āha, tyassa rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇanti. Evaṃ kho, bhikkhave, mahācoro balavanissito hoti. ‘‘Kathañca, bhikkhave, mahācoro bhogacāgī hoti? Idha, bhikkhave, mahācoro aḍḍho hoti mahaddhano mahābhogo. Tassa evaṃ hoti – ‘sace maṃ koci kiñci vakkhati, ito bhogena paṭisantharissāmī’ti. Sace naṃ koci kiñci āha, tato bhogena paṭisantharati. Evaṃ kho, bhikkhave, mahācoro bhogacāgī hoti. ‘‘Kathañca, bhikkhave, mahācoro ekacārī hoti? Idha, bhikkhave, mahācoro ekakova gahaṇāni [niggahaṇāni (sī. syā. kaṃ. pī.)] kattā hoti. Taṃ kissa hetu? ‘Mā me guyhamantā bahiddhā sambhedaṃ agamaṃsū’ti. Evaṃ kho, bhikkhave, mahācoro ekacārī hoti. ‘‘Imehi kho, bhikkhave, pañcahaṅgehi samannāgato mahācoro sandhimpi chindati nillopampi harati ekāgārikampi karoti paripanthepi tiṭṭhati. ‘‘Evamevaṃ kho, bhikkhave, pañcahi dhammehi samannāgato pāpabhikkhu khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi pañcahi? Idha, bhikkhave, pāpabhikkhu visamanissito ca hoti, gahananissito ca, balavanissito ca, bhogacāgī ca, ekacārī ca. ‘‘Kathañca, bhikkhave, pāpabhikkhu visamanissito hoti? Idha, bhikkhave, pāpabhikkhu visamena kāyakammena samannāgato hoti, visamena vacīkammena samannāgato hoti, visamena manokammena samannāgato hoti. Evaṃ kho, bhikkhave, pāpabhikkhu visamanissito hoti. ‘‘Kathañca, bhikkhave, pāpabhikkhu gahananissito hoti? Idha, bhikkhave, pāpabhikkhu micchādiṭṭhiko hoti antaggāhikāya diṭṭhiyā samannāgato. Evaṃ kho, bhikkhave, pāpabhikkhu gahananissito hoti. ‘‘Kathañca, bhikkhave, pāpabhikkhu balavanissito hoti? Idha, bhikkhave, pāpabhikkhu rājānaṃ vā rājamahāmattānaṃ vā nissito hoti. Tassa evaṃ hoti – ‘sace maṃ koci kiñci vakkhati, ime me rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇissantī’ti. Sace naṃ koci kiñci āha, tyassa rājāno vā rājamahāmattā vā pariyodhāya atthaṃ bhaṇanti. Evaṃ kho, bhikkhave, pāpabhikkhu balavanissito hoti. ‘‘Kathañca, bhikkhave, pāpabhikkhu bhogacāgī hoti? Idha, bhikkhave, pāpabhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. Tassa evaṃ hoti – ‘sace maṃ koci kiñci vakkhati, ito lābhena paṭisantharissāmī’ti. Sace naṃ koci kiñci āha, tato lābhena paṭisantharati. Evaṃ kho, bhikkhave, pāpabhikkhu bhogacāgī hoti. ‘‘Kathañca, bhikkhave, pāpabhikkhu ekacārī hoti? Idha, bhikkhave, pāpabhikkhu ekakova paccantimesu janapadesu nivāsaṃ kappeti. So tattha kulāni upasaṅkamanto lābhaṃ labhati. Evaṃ kho, bhikkhave, pāpabhikkhu ekacārī hoti. ‘‘Imehi kho, bhikkhave, pañcahi dhammehi samannāgato pāpabhikkhu khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavatī’’ti. Tatiyaṃ.",
      "english": "Monks, a great thief endowed with five qualities breaks into houses, takes loot, commits isolated burglaries, and waylays travelers. Which five? Here, monks, a great thief relies on inaccessible places, relies on dense cover, relies on powerful support, is generous with his wealth, and acts alone.\n\nAnd how, monks, does a great thief rely on inaccessible places? Here, monks, a great thief relies on a difficult river crossing or a rugged mountain. This is how, monks, a great thief relies on inaccessible places.\n\nAnd how, monks, does a great thief rely on dense cover? Here, monks, a great thief relies on a dense thicket of grass, or a dense thicket of trees, or dense undergrowth, or a large forest grove. This is how, monks, a great thief relies on dense cover.\n\nAnd how, monks, does a great thief rely on powerful support? Here, monks, a great thief relies on kings or royal ministers. He thinks: 'If anyone says anything about me, these kings or royal ministers will speak on my behalf, clearing my name.' If anyone does say anything about him, those kings or royal ministers speak on his behalf, clearing his name. This is how, monks, a great thief relies on powerful support.\n\nAnd how, monks, is a great thief generous with his wealth? Here, monks, a great thief is rich, of great wealth, of great possessions. He thinks: 'If anyone says anything about me, I will placate them with this wealth.' If anyone does say anything about him, he then placates them with that wealth. This is how, monks, a great thief is generous with his wealth.\n\nAnd how, monks, does a great thief act alone? Here, monks, a great thief performs his seizures alone. What is the reason for this? 'Lest my secret plans become known outside.' This is how, monks, a great thief acts alone.\n\nMonks, it is by being endowed with these five qualities that a great thief breaks into houses, takes loot, commits isolated burglaries, and waylays travelers.\n\nExactly in the same way, monks, an evil monk endowed with five qualities maintains himself in a damaged, impaired state, is blameworthy and reproachable by the discerning, and produces much demerit. Which five? Here, monks, an evil monk relies on unrighteousness, relies on a dense thicket of wrong view, relies on powerful support, is generous with his gains, and acts alone.\n\nAnd how, monks, does an evil monk rely on unrighteousness? Here, monks, an evil monk is endowed with unrighteous bodily action, endowed with unrighteous verbal action, and endowed with unrighteous mental action. This is how, monks, an evil monk relies on unrighteousness.\n\nAnd how, monks, does an evil monk rely on a dense thicket of wrong view? Here, monks, an evil monk has wrong view, being endowed with a view that grasps at extremes. This is how, monks, an evil monk relies on a dense thicket of wrong view.\n\nAnd how, monks, does an evil monk rely on powerful support? Here, monks, an evil monk relies on kings or royal ministers. He thinks: 'If anyone says anything about me, these kings or royal ministers will speak on my behalf, clearing my name.' If anyone does say anything about him, those kings or royal ministers speak on his behalf, clearing his name. This is how, monks, an evil monk relies on powerful support.\n\nAnd how, monks, is an evil monk generous with his gains? Here, monks, an evil monk is a recipient of robes, alms-food, lodgings, medicines, and other requisites for the sick. He thinks: 'If anyone says anything about me, I will placate them with these gains.' If anyone does say anything about him, he then placates them with those gains. This is how, monks, an evil monk is generous with his gains.\n\nAnd how, monks, does an evil monk act alone? Here, monks, an evil monk lives alone in remote border regions. By approaching families there, he obtains gains. This is how, monks, an evil monk acts alone.\n\nMonks, it is by being endowed with these five qualities that an evil monk maintains himself in a damaged, impaired state, is blameworthy and reproachable by the discerning, and produces much demerit.",
      "sinhala": "භික්ෂූනි, කරුණු පහකින් යුක්ත වූ මහ චෝරයා බිත්ති සිඳියි, අනුන්ගේ දේ පැහැර ගනියි, එක් නිවසක සියල්ල කොල්ල කයි, මඟරැක සිටිමින්ද කොල්ල කයි. කවර කරුණු පහකින්ද? භික්ෂූනි, මේ ලෝකයේ මහ චෝරයා දුෂ්කර ස්ථාන ඇසුරු කරයි, ගණ වන ලැහැබ් ඇසුරු කරයි, බලවතුන් ඇසුරු කරයි, වස්තුවෙන් අනුන් සතුටු කරයි, තනිව හැසිරේ.\n\nභික්ෂූනි, මහ චෝරයා දුෂ්කර ස්ථාන ඇසුරු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ මහ චෝරයා ගංගා දුර්ග හෝ පර්වත දුර්ග වැනි දුෂ්කර ස්ථාන ඇසුරු කරයි. භික්ෂූනි, මහ චෝරයා දුෂ්කර ස්ථාන ඇසුරු කරන්නේ එසේය.\n\nභික්ෂූනි, මහ චෝරයා ගණ වන ලැහැබ් ඇසුරු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ මහ චෝරයා තණ ගොමු හෝ ගස් ගොමු හෝ පඳුරු හෝ මහා වනාන්තර ඇසුරු කරයි. භික්ෂූනි, මහ චෝරයා ගණ වන ලැහැබ් ඇසුරු කරන්නේ එසේය.\n\nභික්ෂූනි, මහ චෝරයා බලවතුන් ඇසුරු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ මහ චෝරයා රජුන් හෝ රජුගේ මහා අමාත්‍යවරුන් හෝ ඇසුරු කරයි. ඔහුට මෙසේ සිතේ: ‘යමෙක් මට යම් යම් දෙයක් කියන්නේ නම්, මේ රජුන් හෝ රජුගේ මහා අමාත්‍යවරුන් හෝ මා වෙනුවෙන් ආරක්ෂා කරමින් කතා කරනු ඇතැ’යි. යමෙක් ඔහුට යම් දෙයක් කියන්නේ නම්, ඒ රජුන් හෝ රජුගේ මහා අමාත්‍යවරුන් හෝ ඔහු වෙනුවෙන් ආරක්ෂා කරමින් කතා කරති. භික්ෂූනි, මහ චෝරයා බලවතුන් ඇසුරු කරන්නේ එසේය.\n\nභික්ෂූනි, මහ චෝරයා වස්තුවෙන් අනුන් සතුටු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ මහ චෝරයා පොහොසත්ය, මහත් ධනයක් හා මහත් භෝග සම්පතක් ඇත්තෙකි. ඔහුට මෙසේ සිතේ: ‘යමෙක් මට යම් යම් දෙයක් කියන්නේ නම්, මේ ධනයෙන් ඔහු සතුටු කරන්නෙමි’යි. යමෙක් ඔහුට යම් දෙයක් කියන්නේ නම්, ඒ ධනයෙන් ඔහු සතුටු කරයි. භික්ෂූනි, මහ චෝරයා වස්තුවෙන් අනුන් සතුටු කරන්නේ එසේය.\n\nභික්ෂූනි, මහ චෝරයා තනිව හැසිරෙන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ මහ චෝරයා තනිවම සියලු කටයුතු කරයි. එයට හේතුව කුමක්ද? ‘මාගේ රහස් උපක්‍රම පිටතට හෙළි නොවේවා’යි. භික්ෂූනි, මහ චෝරයා තනිව හැසිරෙන්නේ එසේය.\n\nභික්ෂූනි, මහ චෝරයා මේ පස් කරුණින් යුක්තව බිත්ති සිඳියි, අනුන්ගේ දේ පැහැර ගනියි, එක් නිවසක සියල්ල කොල්ල කයි, මඟරැක සිටිමින්ද කොල්ල කයි.\n\nභික්ෂූනි, එපරිද්දෙන්ම, කරුණු පහකින් යුක්ත වූ පව්කාර භික්ෂුව තමාම විනාශ කරගත්, තමාටම හානි කරගත් අයුරින් හැසිරෙයි, නුවණැත්තන්ගේ දොසටද, නින්දාවටද ලක්වේ, බොහෝ අකුසල්ද උපදවා ගනී. කවර කරුණු පහකින්ද? භික්ෂූනි, මේ ලෝකයේ පව්කාර භික්ෂුව දුෂ්චරිතය ඇසුරු කරයි, මිත්‍යාදෘෂ්ටිය ඇසුරු කරයි, බලවතුන් ඇසුරු කරයි, ලාභයෙන් අනුන් සතුටු කරයි, තනිව හැසිරේ.\n\nභික්ෂූනි, පව්කාර භික්ෂුව දුෂ්චරිතය ඇසුරු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ පව්කාර භික්ෂුව විෂම වූ කාය කර්මයෙන් යුක්ත වේ, විෂම වූ වචී කර්මයෙන් යුක්ත වේ, විෂම වූ මනෝ කර්මයෙන් යුක්ත වේ. භික්ෂූනි, පව්කාර භික්ෂුව දුෂ්චරිතය ඇසුරු කරන්නේ එසේය.\n\nභික්ෂූනි, පව්කාර භික්ෂුව මිත්‍යාදෘෂ්ටිය ඇසුරු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ පව්කාර භික්ෂුව මිත්‍යාදෘෂ්ටිකයෙකි, අන්තග්‍රාහී දෘෂ්ටියකින් යුක්ත වේ. භික්ෂූනි, පව්කාර භික්ෂුව මිත්‍යාදෘෂ්ටිය ඇසුරු කරන්නේ එසේය.\n\nභික්ෂූනි, පව්කාර භික්ෂුව බලවතුන් ඇසුරු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ පව්කාර භික්ෂුව රජුන් හෝ රජුගේ මහා අමාත්‍යවරුන් හෝ ඇසුරු කරයි. ඔහුට මෙසේ සිතේ: ‘යමෙක් මට යම් යම් දෙයක් කියන්නේ නම්, මේ රජුන් හෝ රජුගේ මහා අමාත්‍යවරුන් හෝ මා වෙනුවෙන් ආරක්ෂා කරමින් කතා කරනු ඇතැ’යි. යමෙක් ඔහුට යම් දෙයක් කියන්නේ නම්, ඒ රජුන් හෝ රජුගේ මහා අමාත්‍යවරුන් හෝ ඔහු වෙනුවෙන් ආරක්ෂා කරමින් කතා කරති. භික්ෂූනි, පව්කාර භික්ෂුව බලවතුන් ඇසුරු කරන්නේ එසේය.\n\nභික්ෂූනි, පව්කාර භික්ෂුව ලාභයෙන් අනුන් සතුටු කරන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ පව්කාර භික්ෂුව සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර යන ලාභ ලැබිය හැකි අයෙකි. ඔහුට මෙසේ සිතේ: ‘යමෙක් මට යම් යම් දෙයක් කියන්නේ නම්, මේ ලාභයෙන් ඔහු සතුටු කරන්නෙමි’යි. යමෙක් ඔහුට යම් දෙයක් කියන්නේ නම්, ඒ ලාභයෙන් ඔහු සතුටු කරයි. භික්ෂූනි, පව්කාර භික්ෂුව ලාභයෙන් අනුන් සතුටු කරන්නේ එසේය.\n\nභික්ෂූනි, පව්කාර භික්ෂුව තනිව හැසිරෙන්නේ කෙසේද? භික්ෂූනි, මේ ලෝකයේ පව්කාර භික්ෂුව තනිවම දේශසීමා ආසන්නයේ ඇති ජනපදවල වාසය කරයි. ඔහු එහිදී කුල ගෙවල්වලට පිවිසෙමින් ලාභ ලබයි. භික්ෂූනි, පව්කාර භික්ෂුව තනිව හැසිරෙන්නේ එසේය.\n\nභික්ෂූනි, මේ පස් කරුණින් යුක්ත වූ පව්කාර භික්ෂුව තමාම විනාශ කරගත්, තමාටම හානි කරගත් අයුරින් හැසිරෙයි, නුවණැත්තන්ගේ දොසටද, නින්දාවටද ලක්වේ, බොහෝ අකුසල්ද උපදවා ගනී.",
      "paliTitle": "Mahācorasuttaṃ",
      "englishTitle": "The Great Thief Discourse",
      "sinhalaTitle": "මහා චෝර සූත්‍\\u200Dරය"
    },
    {
      "number": 104,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu samaṇesu samaṇasukhumālo hoti. ‘‘Katamehi pañcahi? Idha, bhikkhave, bhikkhu yācitova bahulaṃ cīvaraṃ paribhuñjati, appaṃ ayācito; yācitova bahulaṃ piṇḍapātaṃ paribhuñjati, appaṃ ayācito; yācitova bahulaṃ senāsanaṃ paribhuñjati, appaṃ ayācito; yācitova bahulaṃ gilānappaccayabhesajjaparikkhāraṃ paribhuñjati, appaṃ ayācito. Yehi kho pana sabrahmacārīhi saddhiṃ viharati, tyassa [tyāssa (ka.) a. ni. 4.87] manāpeneva bahulaṃ kāyakammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ vacīkammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ manokammena samudācaranti, appaṃ amanāpena; manāpaṃyeva upahāraṃ upaharanti, appaṃ amanāpaṃ. Yāni kho pana tāni vedayitāni pittasamuṭṭhānāni vā semhasamuṭṭhānāni vā vātasamuṭṭhānāni vā sannipātikāni vā utupariṇāmajāni vā visamaparihārajāni vā opakkamikāni vā kammavipākajāni vā, tānissa na bahudeva uppajjanti. Appābādho hoti, catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu samaṇesu samaṇasukhumālo hoti. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya – ‘samaṇesu samaṇasukhumālo’ti, mameva taṃ, bhikkhave, sammā [mameva taṃ sammā (?)] vadamāno vadeyya – ‘samaṇesu samaṇasukhumālo’ti. Ahañhi, bhikkhave, yācitova bahulaṃ cīvaraṃ paribhuñjāmi, appaṃ ayācito; yācitova bahulaṃ piṇḍapātaṃ paribhuñjāmi, appaṃ ayācito; yācitova bahulaṃ senāsanaṃ paribhuñjāmi, appaṃ ayācito; yācitova bahulaṃ gilānappaccayabhesajjaparikkhāraṃ paribhuñjāmi, appaṃ ayācito. Yehi kho pana bhikkhūhi saddhiṃ viharāmi, te maṃ manāpeneva bahulaṃ kāyakammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ vacīkammena samudācaranti, appaṃ amanāpena; manāpeneva bahulaṃ manokammena samudācaranti, appaṃ amanāpena; manāpaṃyeva upahāraṃ upaharanti, appaṃ amanāpaṃ. Yāni kho pana tāni vedayitāni – pittasamuṭṭhānāni vā semhasamuṭṭhānāni vā vātasamuṭṭhānāni vā sannipātikāni vā utupariṇāmajāni vā visamaparihārajāni vā opakkamikāni vā kammavipākajāni vā – tāni me na bahudeva uppajjanti. Appābādhohamasmi, catunnaṃ kho panasmi [catunnaṃ kho pana (sī.), catunnaṃ (syā. pī.)] jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī [nikāmalābhī homi (sī. ka.)] akicchalābhī akasiralābhī, āsavānaṃ khayā…pe… sacchikatvā upasampajja viharāmi. ‘‘Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya – ‘samaṇesu samaṇasukhumālo’ti, mameva taṃ, bhikkhave, sammā vadamāno vadeyya – ‘samaṇesu samaṇasukhumālo’’’ti. Catutthaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities is a refined ascetic among ascetics. Which five? Here, monks, a bhikkhu mostly uses robes when requested, and rarely when unrequested; mostly consumes alms food when requested, and rarely when unrequested; mostly uses lodging when requested, and rarely when unrequested; mostly uses requisites for the sick, medicine, and provisions when requested, and rarely when unrequested. And with whichever fellow spiritual practitioners he dwells, they mostly treat him with pleasant bodily actions, and rarely with unpleasant ones; mostly treat him with pleasant verbal actions, and rarely with unpleasant ones; mostly treat him with pleasant mental actions, and rarely with unpleasant ones; and they offer him only pleasant things, and rarely unpleasant ones. Furthermore, those feelings that arise from bile, or from phlegm, or from wind, or from a combination of these humors, or from changes in season, or from improper care of the body, or from external attacks, or from the results of kamma – these do not arise often for him. He is free from many ailments, and he obtains at will, without difficulty or trouble, the four jhānas – states of higher mind and comfortable dwellings in this very life. Through the destruction of the taints, having realized and experienced for himself by direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, he dwells therein. Monks, a bhikkhu endowed with these five qualities is a refined ascetic among ascetics.\n\nMonks, if one were to speak rightly, saying, ‘He is a refined ascetic among ascetics,’ it is of me, monks, that one would rightly say, ‘He is a refined ascetic among ascetics.’ For I, monks, mostly use robes when requested, and rarely when unrequested; mostly consume alms food when requested, and rarely when unrequested; mostly use lodging when requested, and rarely when unrequested; mostly use requisites for the sick, medicine, and provisions when requested, and rarely when unrequested. And with whichever bhikkhus I dwell, they mostly treat me with pleasant bodily actions, and rarely with unpleasant ones; mostly treat me with pleasant verbal actions, and rarely with unpleasant ones; mostly treat me with pleasant mental actions, and rarely with unpleasant ones; and they offer me only pleasant things, and rarely unpleasant ones. Furthermore, those feelings that arise from bile, or from phlegm, or from wind, or from a combination of these humors, or from changes in season, or from improper care of the body, or from external attacks, or from the results of kamma – these do not arise often for me. I am free from many ailments, and I obtain at will, without difficulty or trouble, the four jhānas – states of higher mind and comfortable dwellings in this very life. Through the destruction of the taints, having realized and experienced for myself by direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, I dwell therein. Monks, if one were to speak rightly, saying, ‘He is a refined ascetic among ascetics,’ it is of me, monks, that one would rightly say, ‘He is a refined ascetic among ascetics.’",
      "sinhala": "භික්ෂූනි, කරුණු පහකින් සමන්විත වූ භික්ෂුවක් ශ්‍රමණයන් අතරින් ශ්‍රමණසූකුමාල (පරම සුවයෙන් යුක්ත) කෙනෙක් වෙයි. ඒ කරුණු පහ කවරේද?\n\nභික්ෂූනි, මෙහිලා භික්ෂුවක් බොහෝ සෙයින් වස්ත්‍ර පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. බොහෝ සෙයින් පිණ්ඩපාතය පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. බොහෝ සෙයින් සේනාසන (වාසස්ථාන) පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. බොහෝ සෙයින් ගිලන්පස (ඖෂධ) පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. තවද, යම් බ්‍රහ්මචාරීන් සමඟ වෙසේද, ඔවුන් ඔහුට බොහෝ සෙයින් මනාප කය කර්මයෙන් (සත්කාරයෙන්) උපස්ථාන කරති, අමනාප කය කර්මයෙන් අල්ප වශයෙනි. බොහෝ සෙයින් මනාප වචී කර්මයෙන් (වචනවලින්) උපස්ථාන කරති, අමනාප වචී කර්මයෙන් අල්ප වශයෙනි. බොහෝ සෙයින් මනාප මනෝ කර්මයෙන් (සිතුවිලිවලින්) උපස්ථාන කරති, අමනාප මනෝ කර්මයෙන් අල්ප වශයෙනි. මනාප උපහාර (ගෞරව) පමණක් ඔහුට පූජා කරති, අමනාප දේ අල්ප වශයෙනි. තවද, යම් වේදනා (දුක්) ඇත්නම්, පිත් සමුට්ඨාන වූවා හෝ, සෙම් සමුට්ඨාන වූවා හෝ, වාත සමුට්ඨාන වූවා හෝ, සන්නිපාතික වූවා හෝ, සෘතු විපර්යාසයෙන් හටගත් වූවා හෝ, විෂම චර්යාවෙන් (අසම ආහාරපාන ආදියෙන්) හටගත් වූවා හෝ, උපක්‍රමයෙන් (අනතුරකින්) හටගත් වූවා හෝ, කර්ම විපාකයෙන් හටගත් වූවා හෝ, ඒවා ඔහුට බොහෝ සෙයින් හටගන්නේ නැත. ඔහු අල්ප ආබාධ ඇත්තෙක් වෙයි. ආභිචෛතසික වූ දිට්ඨධම්මසුඛවිහරණ (මේ ආත්මභාවයේදීම සුවසේ විහරණය වන) වූ ඒ සිව් ධ්‍යාන, ඔහු කිසිදු අපහසුවකින් තොරව කැමැති ලෙස ලබන්නේ වෙයි. ආසවයන්ගේ ක්ෂය වීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරයි. භික්ෂූනි, මේ කරුණු පහෙන් සමන්විත වූ භික්ෂුව ශ්‍රමණයන් අතරින් ශ්‍රමණසූකුමාල කෙනෙක් වෙයි.\n\nභික්ෂූනි, යමෙක් 'ශ්‍රමණයන් අතරින් ශ්‍රමණසූකුමාල (පරම සුවයෙන් යුක්ත) කෙනෙකි' යැයි නිවැරදිව කියන්නේ නම්, ඔහු මා ගැනම නිවැරදිව කියන්නේ 'ශ්‍රමණයන් අතරින් ශ්‍රමණසූකුමාල කෙනෙකි' යන්නයි. මක්නිසාද භික්ෂූනි, මම බොහෝ සෙයින් වස්ත්‍ර පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. බොහෝ සෙයින් පිණ්ඩපාතය පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. බොහෝ සෙයින් සේනාසන පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. බොහෝ සෙයින් ගිලන්පස (ඖෂධ) පරිභෝග කරන්නේ ඉල්ලීමෙන්මය, ඉල්ලීමෙන් තොරව අල්ප වශයෙනි. තවද, යම් භික්ෂූන් සමඟ මම වෙසේද, ඔවුන් බොහෝ සෙයින් මනාප කය කර්මයෙන් (සත්කාරයෙන්) මට උපස්ථාන කරති, අමනාප කය කර්මයෙන් අල්ප වශයෙනි. බොහෝ සෙයින් මනාප වචී කර්මයෙන් මට උපස්ථාන කරති, අමනාප වචී කර්මයෙන් අල්ප වශයෙනි. බොහෝ සෙයින් මනාප මනෝ කර්මයෙන් මට උපස්ථාන කරති, අමනාප මනෝ කර්මයෙන් අල්ප වශයෙනි. මනාප උපහාර පමණක් මට පූජා කරති, අමනාප දේ අල්ප වශයෙනි. තවද, යම් වේදනා (දුක්) ඇත්නම් – පිත් සමුට්ඨාන වූවා හෝ, සෙම් සමුට්ඨාන වූවා හෝ, වාත සමුට්ඨාන වූවා හෝ, සන්නිපාතික වූවා හෝ, සෘතු විපර්යාසයෙන් හටගත් වූවා හෝ, විෂම චර්යාවෙන් හටගත් වූවා හෝ, උපක්‍රමයෙන් හටගත් වූවා හෝ, කර්ම විපාකයෙන් හටගත් වූවා හෝ – ඒවා මට බොහෝ සෙයින් හටගන්නේ නැත. මම අල්ප ආබාධ ඇත්තෙක් වෙමි. ආභිචෛතසික වූ දිට්ඨධම්මසුඛවිහරණ වූ ඒ සිව් ධ්‍යාන මම කිසිදු අපහසුවකින් තොරව කැමැති ලෙස ලබන්නේ වෙමි. ආසවයන්ගේ ක්ෂය වීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරමි. භික්ෂූනි, යමෙක් 'ශ්‍රමණයන් අතරින් ශ්‍රමණසූකුමාල (පරම සුවයෙන් යුක්ත) කෙනෙකි' යැයි නිවැරදිව කියන්නේ නම්, ඔහු මා ගැනම නිවැරදිව කියන්නේ 'ශ්‍රමණයන් අතරින් ශ්‍රමණසූකුමාල කෙනෙකි' යන්නයි.",
      "paliTitle": "Samaṇasukhumālasuttaṃ",
      "englishTitle": "Discourse on the Delicate Ascetic",
      "sinhalaTitle": "ශ්‍ර‌මණ සුකුමාල සූත්‍ර‌ය"
    },
    {
      "number": 105,
      "pali": "‘‘Pañcime, bhikkhave, phāsuvihārā. Katame pañca? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, mettaṃ vacīkammaṃ…pe… mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni, tathārūpehi sīlehi sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya, tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ime kho, bhikkhave, pañca phāsuvihārā’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, there are these five modes of harmonious living. What are these five?\n\nHere, bhikkhus, a monk maintains bodily action imbued with loving-kindness towards fellow practitioners of the holy life, both in public and in private. He maintains verbal action imbued with loving-kindness towards fellow practitioners of the holy life, both in public and in private. He maintains mental action imbued with loving-kindness towards fellow practitioners of the holy life, both in public and in private.\n\nAnd there are those virtues that are unbroken, untorn, unspotted, unblemished, freeing, praised by the wise, ungrasped, and conducive to concentration. He dwells in common with fellow practitioners, sharing such virtuous conduct, both in public and in private.\n\nAnd there is that noble view, leading to liberation, which guides one who practices it to the complete cessation of suffering. He dwells in common with fellow practitioners, sharing such a view, both in public and in private.\n\nThese, bhikkhus, are the five modes of harmonious living.",
      "sinhala": "මහණෙනි, මේ පහසු විහරණ පහකි. කවර නම් පහක්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුවකට සබ්‍රහ්මචාරීන් කෙරෙහි එළිපිටද, රහසින්ද මෛත්‍රී සහගත කය්කර්මයක් ප්‍රකට වී තිබේ. සබ්‍රහ්මචාරීන් කෙරෙහි එළිපිටද, රහසින්ද මෛත්‍රී සහගත වචීකර්මයක් ප්‍රකට වී තිබේ. සබ්‍රහ්මචාරීන් කෙරෙහි එළිපිටද, රහසින්ද මෛත්‍රී සහගත මනෝකර්මයක් ප්‍රකට වී තිබේ.\n\nයම් ඒ සීලයන් අඛණ්ඩ වූ, අච්ඡිද්‍ර වූ, අසබල වූ, අකල්මස වූ, නිදහස් භාවයට පමුණුවන, විඤ්ඤුන් විසින් ප්‍රශංසා කරන ලද, අපරාමෘෂ්ට වූ, සමාධිය පිණිස පවතින්නාවූ ඒවා වෙත්ද, එබඳු සීලයන්ගෙන් යුක්තව, සබ්‍රහ්මචාරීන් සමඟ එළිපිටද, රහසින්ද සීල සාම්‍යයට පැමිණ වාසය කරයි.\n\nයම් ඒ දෘෂ්ටියක් ආර්ය වූ, නිවන් මඟට පමුණුවන, ඒ අනුව කටයුතු කරන්නාට මැනවින් දුක් ක්ෂය කිරීම පිණිස පවතියිද, එබඳු දෘෂ්ටියකින් යුක්තව, සබ්‍රහ්මචාරීන් සමඟ එළිපිටද, රහසින්ද දෘෂ්ටි සාම්‍යයට පැමිණ වාසය කරයි.\n\nමහණෙනි, මේ පහසු විහරණ පහකි.",
      "paliTitle": "Phāsuvihārasuttaṃ",
      "englishTitle": "Discourse on Abiding in Comfort",
      "sinhalaTitle": "සුව පහසු විහරණ සූත්‍රය"
    },
    {
      "number": 106,
      "pali": "Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Kittāvatā nu kho, bhante, bhikkhu saṅghe [bhikkhuṃsaṃgho (syā. pī.)] viharanto phāsuṃ vihareyyā’’ti? ‘‘Yato kho, ānanda, bhikkhu attanā [attanā ca (pī. ka.)] sīlasampanno hoti, no [no ca (ka.)] paraṃ adhisīle sampavattā [sampavattā hoti (ka.)]; ettāvatāpi kho, ānanda, bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti. ‘‘Siyā pana, bhante, aññopi pariyāyo yathā bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti? ‘‘Siyā, ānanda [ānandāti bhagavā āvoca (syā. pī.)]! Yato kho, ānanda, bhikkhu attanā sīlasampanno hoti, no paraṃ adhisīle sampavattā; attānupekkhī ca hoti, no parānupekkhī; ettāvatāpi kho, ānanda, bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti. ‘‘Siyā pana, bhante, aññopi pariyāyo yathā bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti? ‘‘Siyā, ānanda! Yato kho, ānanda, bhikkhu attanā sīlasampanno hoti, no paraṃ adhisīle sampavattā; attānupekkhī ca hoti, no parānupekkhī; apaññāto ca hoti, tena ca apaññātakena no paritassati; ettāvatāpi kho, ānanda, bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti. ‘‘Siyā pana, bhante, aññopi pariyāyo yathā bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti? ‘‘Siyā, ānanda! Yato kho, ānanda, bhikkhu attanā sīlasampanno hoti, no paraṃ adhisīle sampavattā; attānupekkhī ca hoti, no parānupekkhī; apaññāto ca hoti, tena ca apaññātakena no paritassati; catunnañca [catunnaṃ (pī. ka.)] jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; ettāvatāpi kho, ānanda, bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti. ‘‘Siyā pana, bhante, aññopi pariyāyo yathā bhikkhu saṅghe viharanto phāsuṃ vihareyyā’’ti? ‘‘Siyā, ānanda! Yato kho, ānanda, bhikkhu attanā sīlasampanno hoti, no paraṃ adhisīle sampavattā; attānupekkhī ca hoti, no parānupekkhī; apaññāto ca hoti, tena ca apaññātakena no paritassati; catunnañca jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānañca [āsavānaṃ (sī. pī. ka.)] khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; ettāvatāpi kho, ānanda, bhikkhu saṅghe viharanto phāsuṃ vihareyya. ‘‘Imamhā cāhaṃ, ānanda, phāsuvihārā añño phāsuvihāro uttaritaro vā paṇītataro vā natthīti vadāmī’’ti. Chaṭṭhaṃ.",
      "english": "At one time, the Blessed One was dwelling in Kosambī, at Ghositārāma. Then, the Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, the Venerable Ānanda said to the Blessed One: “To what extent, Bhante, does a bhikkhu dwelling in the Saṅgha live at ease?”\n\n“Ānanda, when a bhikkhu is himself endowed with moral discipline, and does not engage in misconduct concerning another’s moral discipline; to that extent, Ānanda, a bhikkhu dwelling in the Saṅgha lives at ease.”\n\n“Is there, Bhante, another way by which a bhikkhu dwelling in the Saṅgha might live at ease?”\n\n“There is, Ānanda! When a bhikkhu is himself endowed with moral discipline, and does not engage in misconduct concerning another’s moral discipline; and is self-observant, not observant of others; to that extent, Ānanda, a bhikkhu dwelling in the Saṅgha lives at ease.”\n\n“Is there, Bhante, yet another way by which a bhikkhu dwelling in the Saṅgha might live at ease?”\n\n“There is, Ānanda! When a bhikkhu is himself endowed with moral discipline, and does not engage in misconduct concerning another’s moral discipline; and is self-observant, not observant of others; and is unknown, and is not distressed by being unknown; to that extent, Ānanda, a bhikkhu dwelling in the Saṅgha lives at ease.”\n\n“Is there, Bhante, still another way by which a bhikkhu dwelling in the Saṅgha might live at ease?”\n\n“There is, Ānanda! When a bhikkhu is himself endowed with moral discipline, and does not engage in misconduct concerning another’s moral discipline; and is self-observant, not observant of others; and is unknown, and is not distressed by being unknown; and gains at will, without difficulty, without trouble, the four jhāna's — the mental attainments bringing a pleasant abiding in this very life; to that extent, Ānanda, a bhikkhu dwelling in the Saṅgha lives at ease.”\n\n“Is there, Bhante, yet another way by which a bhikkhu dwelling in the Saṅgha might live at ease?”\n\n“There is, Ānanda! When a bhikkhu is himself endowed with moral discipline, and does not engage in misconduct concerning another’s moral discipline; and is self-observant, not observant of others; and is unknown, and is not distressed by being unknown; and gains at will, without difficulty, without trouble, the four jhāna's — the mental attainments bringing a pleasant abiding in this very life; and, with the destruction of the effluents, enters and dwells in the Stainless Liberation of Mind and Liberation by Wisdom, having realized it for himself with direct knowledge in this very life; to that extent, Ānanda, a bhikkhu dwelling in the Saṅgha lives at ease. And Ānanda, I declare that there is no other dwelling at ease higher or more excellent than this dwelling at ease.”",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කොසඹෑ නුවර ඝෝසිතාරාමයේ වැඩසිටින සේක. එවිට ආයුෂ්මත් ආනන්ද භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ආනන්ද භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ස්වාමීනි, භික්ෂුවක් සංඝයා සමඟ වාසය කරන්නේ කොතෙක් දුරකට සුවසේ වාසය කරන්නේද?” “ආනන්දයෙනි, යම් කලක භික්ෂුව තමා විසින්ම සීලසම්පන්න වේද, අන්‍යයන්ගේ අධිසීලය පිළිබඳව නොසලකන්නේද, ආනන්දයෙනි, මෙපමණකින් භික්ෂුව සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේය.”\n\n“ස්වාමීනි, භික්ෂුවක් සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේ යම් ආකාරයකින්ද, ඊට අන්‍ය වූ තවත් කරුණක් තිබේද?” “ආනන්දයෙනි, තිබේ! ආනන්දයෙනි, යම් කලක භික්ෂුව තමා විසින්ම සීලසම්පන්න වේද, අන්‍යයන්ගේ අධිසීලය පිළිබඳව නොසලකන්නේද, තමාම විමසන්නේද, අනුන් විමසන්නේ නැද්ද, ආනන්දයෙනි, මෙපමණකින්ද භික්ෂුව සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේය.”\n\n“ස්වාමීනි, භික්ෂුවක් සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේ යම් ආකාරයකින්ද, ඊට අන්‍ය වූ තවත් කරුණක් තිබේද?” “ආනන්දයෙනි, තිබේ! ආනන්දයෙනි, යම් කලක භික්ෂුව තමා විසින්ම සීලසම්පන්න වේද, අන්‍යයන්ගේ අධිසීලය පිළිබඳව නොසලකන්නේද, තමාම විමසන්නේද, අනුන් විමසන්නේ නැද්ද, අප්‍රකට වේද, ඒ අප්‍රකට බව නිසා කරදර නොවන්නේද, ආනන්දයෙනි, මෙපමණකින්ද භික්ෂුව සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේය.”\n\n“ස්වාමීනි, භික්ෂුවක් සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේ යම් ආකාරයකින්ද, ඊට අන්‍ය වූ තවත් කරුණක් තිබේද?” “ආනන්දයෙනි, තිබේ! ආනන්දයෙනි, යම් කලක භික්ෂුව තමා විසින්ම සීලසම්පන්න වේද, අන්‍යයන්ගේ අධිසීලය පිළිබඳව නොසලකන්නේද, තමාම විමසන්නේද, අනුන් විමසන්නේ නැද්ද, අප්‍රකට වේද, ඒ අප්‍රකට බව නිසා කරදර නොවන්නේද, ආභිචෛතසික වූ, දැහැමි සැප විහරණ වූ සතර ධ්‍යාන කැමති සේ, දුකක් නැතිව, අපහසුවක් නැතිව ලබන්නේද, ආනන්දයෙනි, මෙපමණකින්ද භික්ෂුව සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේය.”\n\n“ස්වාමීනි, භික්ෂුවක් සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේ යම් ආකාරයකින්ද, ඊට අන්‍ය වූ තවත් කරුණක් තිබේද?” “ආනන්දයෙනි, තිබේ! ආනන්දයෙනි, යම් කලක භික්ෂුව තමා විසින්ම සීලසම්පන්න වේද, අන්‍යයන්ගේ අධිසීලය පිළිබඳව නොසලකන්නේද, තමාම විමසන්නේද, අනුන් විමසන්නේ නැද්ද, අප්‍රකට වේද, ඒ අප්‍රකට බව නිසා කරදර නොවන්නේද, ආභිචෛතසික වූ, දැහැමි සැප විහරණ වූ සතර ධ්‍යාන කැමති සේ, දුකක් නැතිව, අපහසුවක් නැතිව ලබන්නේද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා‍විමුක්තිය මේ දැහැමි බවෙහිම තමා විසින්ම දැන, ප්‍රත්‍යක්ෂ කරගෙන, සම්පූර්ණ කරගෙන වාසය කරන්නේද, ආනන්දයෙනි, මෙපමණකින් භික්ෂුව සංඝයා සමඟ වාසය කරන්නේ සුවසේ වාසය කරන්නේය. ආනන්දයෙනි, මේ සුවසේ වාසය කිරීමට වඩා උසස් වූ හෝ ප්‍රණීත වූ හෝ වෙනත් සුවසේ වාසයක් නැතැයි මම කියමි.”",
      "paliTitle": "Ānandasuttaṃ",
      "englishTitle": "The Discourse on Ānanda",
      "sinhalaTitle": "ආනන්‍ද සූත්‍රය"
    },
    {
      "number": 107,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. ‘‘Katamehi pañcahi? Idha, bhikkhave, bhikkhu sīlasampanno hoti, samādhisampanno hoti, paññāsampanno hoti, vimuttisampanno hoti, vimuttiñāṇadassanasampanno hoti. ‘‘Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ.",
      "english": "Monks, a monk endowed with five qualities becomes worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is the unsurpassed field of merit for the world.\n\nWhich five? Here, monks, a monk is endowed with virtue, endowed with concentration, endowed with wisdom, endowed with liberation, and endowed with the knowledge and vision of liberation. Monks, a monk endowed with these five qualities becomes worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is the unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, ධර්මයන් පහකින් යුක්ත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, ඇඳිලි පිදීමට සුදුසු වේ, ලෝකයාගේ අනුත්තර වූ පින් කෙතක් වේ.\n\nඒ ධර්ම කරුණු පහ කවරේද යත්? මහණෙනි, මෙහිලා භික්ෂුවක් සීල සම්පූර්ණ වූ කෙනෙක් වේ, සමාධිය සම්පූර්ණ වූ කෙනෙක් වේ, ප්‍ර‍ඥාව සම්පූර්ණ වූ කෙනෙක් වේ, විමුක්තිය සම්පූර්ණ වූ කෙනෙක් වේ, විමුක්ති ඥාන දර්ශනය සම්පූර්ණ වූ කෙනෙක් වේ.\n\nමහණෙනි, මෙන්න මේ ධර්මයන් පහකින් යුක්ත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, ඇඳිලි පිදීමට සුදුසු වේ, ලෝකයාගේ අනුත්තර වූ පින් කෙතක් වේ.",
      "paliTitle": "Sīlasuttaṃ",
      "englishTitle": "The Discourse on Morality",
      "sinhalaTitle": "ශීල සූත්‍රය"
    },
    {
      "number": 108,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. ‘‘Katamehi, pañcahi? Idha, bhikkhave, bhikkhu asekhena sīlakkhandhena samannāgato hoti, asekhena samādhikkhandhena samannāgato hoti, asekhena paññākkhandhena samannāgato hoti, asekhena vimuttikkhandhena samannāgato hoti, asekhena vimuttiñāṇadassanakkhandhena samannāgato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassable field of merit for the world.\n\nWith which five? Here, monks, a bhikkhu is endowed with the unconditioned aggregate of virtue, is endowed with the unconditioned aggregate of concentration, is endowed with the unconditioned aggregate of wisdom, is endowed with the unconditioned aggregate of liberation, and is endowed with the unconditioned aggregate of the knowledge and vision of liberation.\n\nIndeed, monks, a bhikkhu endowed with these five qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassable field of merit for the world.",
      "sinhala": "මහණෙනි, පස් ධර්ම‌යකින් සමන්වාගත වූ භික්ෂුවක් ආහුණෙය්‍ය (අනුන් විසින් ගෙනෙන ලද දන් පිළිගැනීමට සුදුසු), පාහුණෙය්‍ය (ආගන්තුක සත්කාර ලැබීමට සුදුසු), දක්ඛිණෙය්‍ය (ශ්‍රද්ධාවෙන් දෙන දානයන් පිළිගැනීමට සුදුසු), අඤ්ජලිකරණීය (දෝත නගා වැඳීමට සුදුසු), ලෝකයාට අනුත්තර වූ පින් කෙතක් වන්නේය.\n\nකවර පස් ධර්ම‌යකින්ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව අසේඛ සීලස්කන්ධයෙන් සමන්වාගත වේ. අසේඛ සමාධිස්කන්ධයෙන් සමන්වාගත වේ. අසේඛ ප්‍ර‌ඥාස්කන්ධයෙන් සමන්වාගත වේ. අසේඛ විමුක්තිස්කන්ධයෙන් සමන්වාගත වේ. අසේඛ විමුක්ති ඥාණදර්ශනස්කන්ධයෙන් සමන්වාගත වේ.\n\nමහණෙනි, මේ පස් ධර්ම‌යන්ගෙන් සමන්වාගත වූ භික්ෂුව ආහුණෙය්‍ය (අනුන් විසින් ගෙනෙන ලද දන් පිළිගැනීමට සුදුසු), පාහුණෙය්‍ය (ආගන්තුක සත්කාර ලැබීමට සුදුසු), දක්ඛිණෙය්‍ය (ශ්‍රද්ධාවෙන් දෙන දානයන් පිළිගැනීමට සුදුසු), අඤ්ජලිකරණීය (දෝත නගා වැඳීමට සුදුසු), ලෝකයාට අනුත්තර වූ පින් කෙතක් වන්නේය.",
      "paliTitle": "Asekhasuttaṃ",
      "englishTitle": "The Discourse on the Adept",
      "sinhalaTitle": "අශේඛ සූත්‍රය"
    },
    {
      "number": 109,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu cātuddiso hoti. Katamehi pañcahi? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi, kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu cātuddiso hotī’’ti. Navamaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities is honored in all directions. Which five? Here, monks, a bhikkhu is virtuous; he dwells restrained by the Pātimokkha restraint, endowed with good conduct and suitable resort, seeing danger in even the slightest faults, and undertaking and training in the training rules. He is learned, a preserver of what he has heard, an accumulator of what he has heard; those teachings which are beautiful in the beginning, beautiful in the middle, beautiful in the end, which proclaim the entirely complete and perfectly pure holy life with its meaning and expression — such teachings are much heard by him, memorized, familiarized by speech, mentally investigated, and well penetrated by understanding. He is content with whatever robes, almsfood, lodging, and medicinal requisites for the sick. He obtains at will, without difficulty or trouble, the four *jhānas*, which pertain to the higher mind and provide a pleasant dwelling in this very life. By the destruction of the *āsavas*, he abides, having realized for himself with direct knowledge, in this very life, the liberation of mind that is free from *āsavas* and the liberation by wisdom. Monks, a bhikkhu endowed with these five qualities is honored in all directions.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව සිව්දිගටම නිදහස්ව වාසය කරන්නෙක් වේ. කවර පස් වැදෑරුම් ධර්මයන්ගෙන් ද? මහණෙනි, මෙහිලා භික්ෂුව සිල්වත් වේ. ප්‍රාති​මෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාර සම්පන්න ගෝචර සම්පන්න වේ. අණුමාත්‍ර වැරදි වල පවා භය දක්නා සුළු වේ. ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. බහුශ්‍රැත වේ. ඇසූ දේ ධාරණය කර ගත්තෙක් වේ, ඇසූ දේ රැස් කර ගත්තෙක් වේ. යම් ඒ ධර්මයන් මුල ද කල්‍යාණ ද, මැද ද කල්‍යාණ ද, අවසානය ද කල්‍යාණ ද, අර්ථ සහිත ද, ව්‍යංජන සහිත ද, සපිරුණු ද, පිරිසිදු ද, බ්‍රහ්ම​චර්යාව ප්‍රකාශ කරන්නේ ද, එවන් ධර්මයන් ඔහුට බහුශ්‍රැත වේ, වචනයෙන් ධාරණය කරගත්, පුරුදු කළ, මනසින් විමසන ලද, දෘෂ්ටියෙන් (නුවණින්) මැනවින් විනිවිද දකින ලද ඒවා වේ. යම් ලැබෙන සිව්රු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන මේවායින් සතුටු වූවෙක් වේ. අභිචෛතසික වූ, මේ ආත්මභාවයේදීම සැප විහරණය පිණිස වූ සිව් ධ්‍යාන කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලාභියා වේ. ආශ්‍ර​වයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍ර​ඥා විමුක්තිය මේ දෘෂ්ටධර්මයේදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කරගෙන ප්‍රත්‍යක්ෂ කරගෙන වාසය කරයි. මහණෙනි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව සිව්දිගටම නිදහස්ව වාසය කරන්නෙක් වේ යැයි.",
      "paliTitle": "Cātuddisasuttaṃ",
      "englishTitle": "The Four Directions Discourse",
      "sinhalaTitle": "සතර දිශා සූත්‍රය"
    },
    {
      "number": 110,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ araññavanapatthāni pantāni senāsanāni paṭisevituṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; āraddhavīriyo viharati thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu alaṃ araññavanapatthāni pantāni senāsanāni paṭisevitu’’nti. Dasamaṃ. ",
      "english": "Monks, a monk endowed with five qualities is capable of resorting to secluded dwelling places in forests and wildernesses. Which five? Here, monks, a monk is virtuous, he dwells restrained by the rules of the Pāṭimokkha, accomplished in conduct and resort, seeing danger in the slightest fault, and trains himself by undertaking the training precepts. He is learned, remembers what he has heard, accumulates what he has heard. Those teachings that are good in the beginning, good in the middle, good in the end, with their correct meaning and phrasing, that proclaim the perfectly complete and purified holy life — such teachings he has learned much of, retained, recited, pondered, and penetrated well by insight. He dwells with aroused energy, firm and resolute in his effort, not having laid down the burden in wholesome states. He is one who obtains at will, without difficulty or trouble, the four jhānās — the higher mental states that are a pleasant dwelling in this very life. Through the destruction of the taints, having realized for himself with direct knowledge the taintless liberation of mind and liberation by wisdom, he dwells having entered upon it in this very life. Monks, a monk endowed with these five qualities is capable of resorting to secluded dwelling places in forests and wildernesses.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත භික්ෂුවක්, වන පෙදෙස්, වෘක්ෂ වනප්‍රස්ථ හා ජනයාගෙන් ඈත් වූ සේනාසන සේවනය කිරීමට සුදුසු වෙයි.\n\nඒ කරුණු පහ කවරේද?\n\nමහණෙනි, මෙහිලා භික්ෂුවක් සීලවන්ත වෙයි. එනම්, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව, ආචාර ගෝචර සම්පන්නව, අණු මාත්‍ර වරදෙහි ද භය දක්නා සුළු වූයේ, සික්ඛාපද සමාදන්ව හික්මෙයි. ඔහු බහුශ්‍රැත වෙයි. එනම්, යම් ඒ ධර්‍මයක් ආදි බ්‍රහ්මචරියාවට අයත් වූ, කුසල් වූ, ආරම්භයේ ද මධ්‍යයේ ද අවසානයේ ද යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් පිරිපුන් වූ, පාරිශුද්ධ බ්‍රහ්මචරියාව ප්‍රකාශ කරන්නා වූ, ඒ ධර්‍මයෝ ඔහු විසින් අසන ලද්දාහු, ධාරණය කරන ලද්දාහු, වචනයෙන් පුරුදු කරන ලද්දාහු, මනසින් විමසන ලද්දාහු, දෘෂ්ටියෙන් මැනවින් අවබෝධ කරන ලද්දාහු වෙති. ඔහු කුසල ධර්‍මයන්හි ආරම්භ කරන ලද වීර්යය ඇතිව, දැඩි බල සම්පන්නව, නොසැලෙන පරාක්‍රමයෙන් යුතුව, බර නොහළ සිත් ඇතිව වාසය කරයි. ඔහු අධිචෛතසික වූ, මේ ආත්මභාවයේ දී ම සැප විහරණයන් වූ, සිව් ධ්‍යාන සිතූ පරිදි ලබන, අපහසුවකින් තොරව ලබන, වෙහෙසකින් තොරව ලබන භික්ෂුවක් වෙයි. ඔහු ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේ දී ම තමා විසින් ම අභිඥාවෙන් ප්‍රත්‍යක්ෂ කොට, ලබාගෙන වාසය කරයි.\n\nමහණෙනි, මේ කරුණු පහකින් යුක්ත භික්ෂුවක් වන පෙදෙස්, වෘක්ෂ වනප්‍රස්ථ හා ජනයාගෙන් ඈත් වූ සේනාසන සේවනය කිරීමට සුදුසු වෙයි.",
      "paliTitle": "Araññasuttaṃ",
      "englishTitle": "The Forest Sutta",
      "sinhalaTitle": "අරණ්‍ය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Phāsuvihāravaggo paṭhamo. Tassuddānaṃ – Sārajjaṃ saṅkito coro, sukhumālaṃ phāsu pañcamaṃ; Ānanda sīlāsekhā ca, cātuddiso araññena cāti.",
    "english": "The First Chapter: Easy Living",
    "sinhala": "පළමු පහසු විහරණ වග්ගය"
  }
}