{
  "id": "an5.7",
  "title": {
    "pali": "Saññāvaggo",
    "english": "The Chapter on Perception",
    "sinhala": "සඤ්ඤා​ වග්ගය"
  },
  "sections": [
    {
      "number": 61,
      "pali": "‘‘Pañcimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā pañca? Asubhasaññā, maraṇasaññā, ādīnavasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā [anabhiratisaññā (ka.) a. ni. 5.121-122, 303-304 passitabbaṃ] – imā kho, bhikkhave, pañca saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Paṭhamaṃ.",
      "english": "Monks, these five perceptions, when developed and frequently cultivated, are of great fruit, of great benefit, are grounded in the Deathless, and culminate in the Deathless. Which five? The perception of foulness, the perception of death, the perception of danger, the perception of repulsiveness in food, and the perception of non-delight in the entire world. These five perceptions, monks, when developed and frequently cultivated, are of great fruit, of great benefit, are grounded in the Deathless, and culminate in the Deathless.",
      "sinhala": "මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ සංඥා පස මහත් ඵල ද වෙත්, මහත් ආනිශංස ද වෙත්. ඒවා අමා මහ නිවනට පිවිසෙන්නාහු වෙත්, අමා මහ නිවනින් කෙළවර වන්නාහු වෙත්.\n\nකවරේ ද ඒ පස?\n\nඅසුභ සංඥාව, මරණ සංඥාව, ආදීනව සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි ඇලීම් රහිත සංඥාව යි. මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ සංඥා පස මහත් ඵල ද වෙත්, මහත් ආනිශංස ද වෙත්. ඒවා අමා මහ නිවනට පිවිසෙන්නාහු වෙත්, අමා මහ නිවනින් කෙළවර වන්නාහු වෙත්.",
      "paliTitle": "Paṭhamasaññāsuttaṃ"
    },
    {
      "number": 62,
      "pali": "‘‘Pañcimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā pañca? Aniccasaññā, anattasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā – imā kho, bhikkhave, pañca saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Dutiyaṃ.",
      "english": "Monastics, these five perceptions, when developed and cultivated repeatedly, become of great fruit, of great benefit, immersed in the Deathless, and culminating in the Deathless. Which five? The perception of impermanence, the perception of non-self, the perception of death, the perception of repulsiveness in nutriment, and the perception of non-delight in the entire world — these five perceptions, monastics, when developed and cultivated repeatedly, become of great fruit, of great benefit, immersed in the Deathless, and culminating in the Deathless.",
      "sinhala": "මහණෙනි, මේ පස් වැදෑරුම් සංඥාවන් වඩන ලද කල්හි, බහුල වශයෙන් පුරුදු කරන ලද කල්හි, මහත් ඵල ඇති වෙති, මහත් ආනිසංස ඇති වෙති, අමෘතය කරා යොමුවූ ද, අමෘතය අවසානය කොට ඇත්තා වූ ද වෙති.\n\nකවරේද ඒ පස් වැදෑරුම් සංඥාවෝ?\n\nඅනිච්ච සංඥාව, අනාත්ම සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි නොඇලෙන සංඥාව යන මේවාය. මහණෙනි, මේ පස් වැදෑරුම් සංඥාවන් වඩන ලද කල්හි, බහුල වශයෙන් පුරුදු කරන ලද කල්හි, මහත් ඵල ඇති වෙති, මහත් ආනිසංස ඇති වෙති, අමෘතය කරා යොමුවූ ද, අමෘතය අවසානය කොට ඇත්තා වූ ද වෙති.",
      "paliTitle": "Dutiyasaññāsuttaṃ"
    },
    {
      "number": 63,
      "pali": "‘‘Pañcahi, bhikkhave, vaḍḍhīhi vaḍḍhamāno ariyasāvako ariyāya vaḍḍhiyā vaḍḍhati, sārādāyī ca hoti varādāyī ca kāyassa. Katamāhi pañcahi? Saddhāya vaḍḍhati, sīlena vaḍḍhati, sutena vaḍḍhati, cāgena vaḍḍhati, paññāya vaḍḍhati – imāhi kho, bhikkhave, pañcahi vaḍḍhīhi vaḍḍhamāno ariyasāvako ariyāya vaḍḍhiyā vaḍḍhati, sārādāyī ca hoti varādāyī ca kāyassā’’ti. ‘‘Saddhāya sīlena ca yo pavaḍḍhati [yodha vaḍḍhati (sī.)], Paññāya cāgena sutena cūbhayaṃ; So tādiso sappuriso vicakkhaṇo, Ādīyatī sāramidheva attano’’ti. tatiyaṃ;",
      "english": "Bhikkhus, a noble disciple who grows in these five kinds of growth, grows with the noble growth, and becomes one who extracts the essence and the ultimate good from this existence. Which five? He grows in faith, he grows in moral virtue, he grows in extensive learning, he grows in generosity, he grows in wisdom. Indeed, Bhikkhus, a noble disciple who grows in these five kinds of growth, grows with the noble growth, and becomes one who extracts the essence and the ultimate good from this existence.\n\nWhoever grows in faith and in virtue,\nIn wisdom, generosity, and extensive learning too –\nSuch a good and discerning person,\nIndeed extracts the essence for himself.",
      "sinhala": "මහණෙනි, ආර්ය ශ්‍රාවක තෙම, පස් වැදෑරුම් වෘද්ධීන්ගෙන් වර්ධනය වන්නා වූයේ, ආර්ය වෘද්ධියෙන් වර්ධනය වෙයි. ඔහු තමාගේ පැවැත්මේ සාරයද, උතුම්ම දේද ලබාගනී. කවර පස් වැදෑරුම් වෘද්ධීන්ගෙන්ද යත්: ශ්‍ර​ද්ධාවෙන් වර්ධනය වෙයි, සීලයෙන් වර්ධනය වෙයි, ශ්‍ර​ැතයෙන් වර්ධනය වෙයි, ත්‍ය​ාගයෙන් වර්ධනය වෙයි, ප්‍ර​ඥාවෙන් වර්ධනය වෙයි. මහණෙනි, මේ පස් වැදෑරුම් වෘද්ධීන්ගෙන් වර්ධනය වන්නා වූ ආර්ය ශ්‍රාවක තෙම, ආර්ය වෘද්ධියෙන් වර්ධනය වෙයි. ඔහු තමාගේ පැවැත්මේ සාරයද, උතුම්ම දේද ලබාගනී.\n\nයමෙක් ශ්‍ර​ද්ධාවෙන්ද, සීලයෙන්ද, ප්‍ර​ඥාවෙන්ද, ත්‍ය​ාගයෙන්ද, ශ්‍ර​ැතයෙන්ද යන මේ දෙලොව වැඩ සඳහා වර්ධනය වෙයිද,\nඒ බඳු වූ, විචක්‍ෂණ වූ සත්පුරුෂයා තමාගේ සාරයම ලබාගනී.",
      "paliTitle": "Paṭhamavaḍḍhisuttaṃ"
    },
    {
      "number": 64,
      "pali": "‘‘Pañcahi, bhikkhave, vaḍḍhīhi vaḍḍhamānā ariyasāvikā ariyāya vaḍḍhiyā vaḍḍhati, sārādāyinī ca hoti varādāyinī ca kāyassa. Katamāhi pañcahi? Saddhāya vaḍḍhati, sīlena vaḍḍhati, sutena vaḍḍhati, cāgena vaḍḍhati, paññāya vaḍḍhati – imāhi kho, bhikkhave, pañcahi vaḍḍhīhi vaḍḍhamānā ariyasāvikā ariyāya vaḍḍhiyā vaḍḍhati, sārādāyinī ca hoti varādāyinī ca kāyassā’’ti. ‘‘Saddhāya sīlena ca yā pavaḍḍhati [yādha vaḍḍhati (sī.)], Paññāya cāgena sutena cūbhayaṃ; Sā tādisī sīlavatī upāsikā, Ādīyatī sāramidheva attano’’ti. catutthaṃ;",
      "english": "Monks, a noble female disciple who grows in five kinds of growth, grows with the noble growth and becomes one who extracts the essence and the excellent from this very existence. Which five? She grows in faith, she grows in moral virtue, she grows in learning, she grows in generosity, she grows in wisdom. Monks, a noble female disciple who grows in these five kinds of growth, grows with the noble growth and becomes one who extracts the essence and the excellent from this very existence.\n\nShe who grows in faith and moral virtue,\nAnd in wisdom, generosity, and learning,\nSuch a virtuous female lay follower\nExtracts the very essence for herself.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් වර්ධනයන්ගෙන් වර්ධනය වන ආර්ය ශ්‍රාවිකාව ආර්ය වර්ධනයෙන් වැඩෙයි. ඇය මේ කයෙහි සාරයත්, උතුම් දේත් ලබා ගන්නී. කවර පස් වැදෑරුම් වර්ධනයන්ගෙන්ද? ශ්‍රද්ධාවෙන් වැඩෙයි. සීලයෙන් වැඩෙයි. ශ්‍රවණයෙන් වැඩෙයි. ත්‍යාගයෙන් වැඩෙයි. ප්‍රඥාවෙන් වැඩෙයි. මහණෙනි, මෙබඳු පස් වැදෑරුම් වර්ධනයන්ගෙන් වර්ධනය වන ආර්ය ශ්‍රාවිකාව ආර්ය වර්ධනයෙන් වැඩෙයි. ඇය මේ කයෙහි සාරයත්, උතුම් දේත් ලබා ගන්නී.\n\nයම් තැනැත්තියක් ශ්‍රද්ධාවෙන් හා සීලයෙන් ද, ප්‍රඥාවෙන්, ත්‍යාගයෙන් හා ශ්‍රවණයෙන් ද වර්ධනය වේද; එබඳු සිල්වත් උපාසිකාවක් තමන්ට ම සාරය ගනී.",
      "paliTitle": "Dutiyavaḍḍhisuttaṃ"
    },
    {
      "number": 65,
      "pali": "[a. ni. 5.164] ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu alaṃsākaccho sabrahmacārīnaṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu attanā ca sīlasampanno hoti, sīlasampadāya kathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadāya kathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadāya kathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadāya kathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadāya kathāya ca āgataṃ pañhaṃ byākattā hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu alaṃsākaccho sabrahmacārīna’’nti. Pañcamaṃ.",
      "english": "Monks, a monk endowed with five qualities is fit to engage in conversation with his fellow monastics. Which five? Here, monks, a monk himself is endowed with virtue, and is able to answer a question that arises concerning the perfection of virtue; himself is endowed with concentration, and is able to answer a question that arises concerning the perfection of concentration; himself is endowed with wisdom, and is able to answer a question that arises concerning the perfection of wisdom; himself is endowed with liberation, and is able to answer a question that arises concerning the perfection of liberation; and himself is endowed with the knowledge and vision of liberation, and is able to answer a question that arises concerning the perfection of the knowledge and vision of liberation. Monks, a monk endowed with these five qualities is fit to engage in conversation with his fellow monastics.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ භික්ෂුවක් බඹසර හැසිරෙන්නන්ට කතාබහට සුදුසු ය. කවර කරුණු පහකින් ද?\n\nමහණෙනි, මෙහිලා භික්ෂුවක් තමා ද සීලසම්පන්‍න වේ. සීලසම්පදාව පිළිබඳ කථාවට අදාළ ව ආ ප්‍රශ්නයක් විවරණය කිරීමට ද සමත් වේ. තමා ද සමාධිසම්පන්‍න වේ. සමාධිසම්පදාව පිළිබඳ කථාවට අදාළ ව ආ ප්‍රශ්නයක් විවරණය කිරීමට ද සමත් වේ. තමා ද ප්‍රඥාසම්පන්‍න වේ. ප්‍රඥාසම්පදාව පිළිබඳ කථාවට අදාළ ව ආ ප්‍රශ්නයක් විවරණය කිරීමට ද සමත් වේ. තමා ද විමුක්තිසම්පන්‍න වේ. විමුක්තිසම්පදාව පිළිබඳ කථාවට අදාළ ව ආ ප්‍රශ්නයක් විවරණය කිරීමට ද සමත් වේ. තමා ද විමුක්තිඥානදර්ශනසම්පන්‍න වේ. විමුක්තිඥානදර්ශනසම්පදාව පිළිබඳ කථාවට අදාළ ව ආ ප්‍රශ්නයක් විවරණය කිරීමට ද සමත් වේ.\n\nමහණෙනි, සැබවින් ම මේ කරුණු පහකින් යුක්ත වූ භික්ෂුවක් බඹසර හැසිරෙන්නන්ට කතාබහට සුදුසු ය.",
      "paliTitle": "Sākacchasuttaṃ"
    },
    {
      "number": 66,
      "pali": "[a. ni. 5.164] ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīnaṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu attanā ca sīlasampanno hoti, sīlasampadāya kathāya ca kataṃ pañhaṃ byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadāya kathāya ca kataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadāya kathāya ca kataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadāya kathāya ca kataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadāya kathāya ca kataṃ pañhaṃ byākattā hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīna’’nti. Chaṭṭhaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities is fit to live among his fellow practitioners. Which five?\n\nHere, monks, a bhikkhu is himself accomplished in virtue and can explain a problem that has been presented concerning accomplishment in virtue; is himself accomplished in concentration and can explain a problem that has been presented concerning accomplishment in concentration; is himself accomplished in wisdom and can explain a problem that has been presented concerning accomplishment in wisdom; is himself accomplished in liberation and can explain a problem that has been presented concerning accomplishment in liberation; is himself accomplished in the knowledge and vision of liberation and can explain a problem that has been presented concerning accomplishment in the knowledge and vision of liberation. These, monks, are the five qualities with which a bhikkhu is endowed, making him fit to live among his fellow practitioners.",
      "sinhala": "මහණෙනි, කරුණු පසකින් යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට සුදුසු පරිදි ජීවත් වන අයෙක් වෙයි.\nඒ කවර කරුණු පසකින්ද?\nමහණෙනි, මෙහිලා භික්ෂුව තමා විසින්ම සීල සම්පන්න වෙයි. සීල සම්පදාව පිළිබඳ වූ කතාවකින් උපන් ප්‍රශ්නයක් විවරණය කිරීමටද සමත් වෙයි.\nතමා විසින්ම සමාධි සම්පන්න වෙයි. සමාධි සම්පදාව පිළිබඳ වූ කතාවකින් උපන් ප්‍රශ්නයක් විවරණය කිරීමටද සමත් වෙයි.\nතමා විසින්ම ප්‍රඥා සම්පන්න වෙයි. ප්‍රඥා සම්පදාව පිළිබඳ වූ කතාවකින් උපන් ප්‍රශ්නයක් විවරණය කිරීමටද සමත් වෙයි.\nතමා විසින්ම විමුක්ති සම්පන්න වෙයි. විමුක්ති සම්පදාව පිළිබඳ වූ කතාවකින් උපන් ප්‍රශ්නයක් විවරණය කිරීමටද සමත් වෙයි.\nතමා විසින්ම විමුක්ති ඥානදර්ශන සම්පන්න වෙයි. විමුක්ති ඥානදර්ශන සම්පදාව පිළිබඳ වූ කතාවකින් උපන් ප්‍රශ්නයක් විවරණය කිරීමටද සමත් වෙයි.\nමහණෙනි, මේ කරුණු පසින්ම යුක්ත වූ භික්ෂුවක් සබ්‍රහ්මචාරීන්ට සුදුසු පරිදි ජීවත් වන අයෙක් වෙයි.\nසයවෙනි සූත්‍රයයි.",
      "paliTitle": "Sājīvasuttaṃ"
    },
    {
      "number": 67,
      "pali": "‘‘Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā pañca dhamme [ime pañca dhamme (ka.)] bhāveti, pañca dhamme [ime pañca dhamme (ka.)] bahulīkaroti, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā. ‘‘Katame pañca? Idha, bhikkhave, bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi…pe… cittasamādhi… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, ussoḷhiññeva pañcamiṃ [ussoḷhīyeva pañcamī (sī.)]. Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā ime pañca dhamme bhāveti, ime pañca dhamme bahulīkaroti, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Sattamaṃ.",
      "english": "Whosoever, bhikkhus, whether a bhikkhu or a bhikkhunī, develops these five qualities and cultivates them frequently, for them one of two fruits is to be expected: either final liberation in this very life, or non-returning if there remains any residual clinging to existence.\n\nWhich five? Here, bhikkhus, a bhikkhu develops the basis for spiritual power endowed with concentration due to zeal, along with volitional formations of exertion; the basis for spiritual power endowed with concentration due to energy, along with volitional formations of exertion; the basis for spiritual power endowed with concentration due to mind, along with volitional formations of exertion; the basis for spiritual power endowed with concentration due to investigation, along with volitional formations of exertion; and strenuous exertion as the fifth.\n\nWhosoever, bhikkhus, whether a bhikkhu or a bhikkhunī, develops these five qualities and cultivates them frequently, for them one of two fruits is to be expected: either final liberation in this very life, or non-returning if there remains any residual clinging to existence.",
      "sinhala": "මහණෙනි, යම්කිසි භික්‍ෂුවක් හෝ භික්‍ෂුණියක් වේ ද, යම් අයෙක් මේ පංච ධර්මයන් වඩයි ද, මේ පංච ධර්මයන් බහුල කරයි ද, ඔහුට ඵල දෙකින් එකක් අපේක්‍ෂා කළ හැකිය. එනම්: මේ ආත්මභාවයේදීම අර්හත්වය අවබෝධ කිරීම හෝ (මරණයෙන් පසු) උපාදිශේෂ සහිතව අනාගාමීත්වයයි.\n\nඒ පංච ධර්මයෝ කවරහු ද? මහණෙනි, මෙහිලා භික්‍ෂුව ඡන්දසමාධි ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. වීර්යයසමාධි ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. චිත්තසමාධි ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. විමංසාසමාධි ප්‍රධාන සංස්කාරයෙන් සමන්විත ඉර්ධිපාදය වඩයි. පස්වැන්න නම් නොපසුබට උත්සාහයයි. යම්කිසි භික්‍ෂුවක් හෝ භික්‍ෂුණියක් වේ ද, යම් අයෙක් මේ පංච ධර්මයන් වඩයි ද, මේ පංච ධර්මයන් බහුල කරයි ද, ඔහුට ඵල දෙකින් එකක් අපේක්‍ෂා කළ හැකිය. එනම්: මේ ආත්මභාවයේදීම අර්හත්වය අවබෝධ කිරීම හෝ (මරණයෙන් පසු) උපාදිශේෂ සහිතව අනාගාමීත්වයයි.",
      "paliTitle": "Paṭhamaiddhipādasuttaṃ"
    },
    {
      "number": 68,
      "pali": "‘‘Pubbevāhaṃ, bhikkhave, sambodhā anabhisambuddho bodhisattova samāno pañca dhamme bhāvesiṃ, pañca dhamme bahulīkāsiṃ [bahulimakāsiṃ (ka.), bahulamakāsiṃ (ka.)]. Katame pañca? Chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāvesiṃ, vīriyasamādhi… cittasamādhi… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāvesiṃ, ussoḷhiññeva pañcamiṃ. So kho ahaṃ, bhikkhave, imesaṃ ussoḷhipañcamānaṃ dhammānaṃ bhāvitattā bahulīkatattā yassa yassa abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmesiṃ abhiññāsacchikiriyāya, tatra tatreva sakkhibhabbataṃ pāpuṇiṃ sati sati āyatane. ‘‘So sace ākaṅkhiṃ – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ…pe… yāva brahmalokāpi kāyena vasaṃ vatteyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇiṃ sati sati āyatane. ‘‘So sace ākaṅkhiṃ…pe… ‘āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇiṃ sati sati āyatane’’ti. Aṭṭhamaṃ.",
      "english": "Before my full enlightenment, monks, when I was still an unawakened Bodhisatta, I developed five qualities, I cultivated five qualities extensively. Which five? I developed the base for spiritual power endowed with concentration due to aspiration and volitional formations of exertion; I developed the base for spiritual power endowed with concentration due to energy and volitional formations of exertion; I developed the base for spiritual power endowed with concentration due to consciousness and volitional formations of exertion; I developed the base for spiritual power endowed with concentration due to investigation and volitional formations of exertion. And the fifth was simply ardent perseverance.\n\nIndeed, monks, because these qualities, with ardent perseverance as the fifth, were developed and extensively cultivated by me, to whatever state that was to be realized by direct knowledge I directed my mind for its realization by direct knowledge, in each and every sphere I attained the competence to witness it then and there.\n\nIf I wished, \"May I experience various kinds of spiritual power, such as becoming one from many, becoming many from one, appearing and vanishing, passing unhindered through walls, ramparts, and mountains as if through space, diving in and out of the earth as if in water, walking on water without sinking as if on land, traveling through the air cross-legged like a winged bird, touching and stroking the moon and sun, so mighty and powerful, and exercising mastery with my body even up to the Brahma-world,\" – in each and every sphere I attained the competence to witness it then and there.\n\nIf I wished, \"By the destruction of the taints, having realized directly for myself and entered upon the stainless liberation of mind and liberation by wisdom in this very life, may I abide therein,\" – in each and every sphere I attained the competence to witness it then and there.",
      "sinhala": "භික්ෂූනි, මම සම්බෝධියට පත් නොවූ, බෝධිසත්වයෙකු ලෙස සිටියදී, ධර්ම පහක් වඩමින්, ධර්ම පහක් බහුල වශයෙන් පුරුදු කළෙමි.\n\nඒ පස කුමක්ද?\n\nඡන්දය, සමාධිය, ප්‍රධාන සංඛාරය යන මේවායෙන් යුක්ත සෘද්ධිපාදයත්, වීර්යය, සමාධිය, ප්‍රධාන සංඛාරය යන මේවායෙන් යුක්ත සෘද්ධිපාදයත්, චිත්තය, සමාධිය, ප්‍රධාන සංඛාරය යන මේවායෙන් යුක්ත සෘද්ධිපාදයත්, විමංසාව, සමාධිය, ප්‍රධාන සංඛාරය යන මේවායෙන් යුක්ත සෘද්ධිපාදයත්, අධිෂ්ඨාන සහගත උත්සාහයම පස්වැන්න ලෙසත් මම වැඩුවෙමි. භික්ෂූනි, අධිෂ්ඨාන සහගත උත්සාහය පස්වැන්න කොට ඇති මේ ධර්මයන් වැඩීම හේතුවෙන් ද, බහුල වශයෙන් පුරුදු කිරීම හේතුවෙන් ද, යම් යම් අභිඥාවෙන් සාක්ෂාත් කළ යුතු ධර්මයක් අභිඥාවෙන් සාක්ෂාත් කිරීම සඳහා සිත නැඹුරු කළෙම් ද, ඒ ඒ ආයතනවලදී, එවේලේම එය සාක්ෂාත් කිරීමට සමත් වීමි.\n\nයම් හෙයකින් මම 'අනෙකුත් බොහෝ ආකාරයේ සෘද්ධි ප්‍රාතිහාර්යයන් අත්දකින්නෙම් ද: එනම්, එකෙක්ව බොහෝ කොට, බොහෝ දෙනෙක්ව එකෙක් කොට දක්වමින්, ප්‍රකටව සිට නොප්‍රකට වීම, නොප්‍රකටව සිට ප්‍රකට වීම, ගල් පවුරු, තාප්ප, කඳු අතරින් බාධාවකින් තොරව අහසේ මෙන් ගමන් කිරීම, පොළොවේ දියෙහි මෙන් කිමිදීම හා මතු වීම, දිය මත පොළොවේ මෙන් නොබෙදී ගමන් කිරීම, අහසේ පක්ෂියෙකු මෙන් පලක් බැඳ පියාසර කිරීම, මෙවන් මහානුභාව සම්පන්න සූර්යයා සහ චන්ද්‍රයා පවා අතින් ස්පර්ශ කිරීම, බ්‍රහ්ම ලෝකය දක්වාම කයින් වසඟය පැවැත්වීම' යැයි කැමති වුණෙම් ද, ඒ ඒ ආයතනවලදී, එවේලේම එය සාක්ෂාත් කිරීමට සමත් වීමි.\n\nයම් හෙයකින් මම 'ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කරගෙන වාසය කරන්නට' කැමති වුණෙම් ද, ඒ ඒ ආයතනවලදී, එවේලේම එය සාක්ෂාත් කිරීමට සමත් වීමි.",
      "paliTitle": "Dutiyaiddhipādasuttaṃ"
    },
    {
      "number": 69,
      "pali": "‘‘Pañcime, bhikkhave, dhammā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. ‘‘Katame pañca? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratasaññī [anabhiratisaññī (ka.) a. ni. 5.121-122, 303-304 passitabbaṃ], sabbasaṅkhāresu aniccānupassī, maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. Ime kho, bhikkhave, pañca dhammā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattantī’’ti. Navamaṃ.",
      "english": "These five things, mendicants, when developed and extensively practiced, lead exclusively to disillusionment, dispassion, cessation, peace, direct knowledge, full enlightenment, and Nibbāna. Which five? Here, mendicants, a bhikkhu dwells contemplating the foulness of the body, perceives repulsion in food, perceives no delight in the entire world, contemplates impermanence in all fabrications, and the perception of death is well-established within him. These five things, mendicants, when developed and extensively practiced, lead exclusively to disillusionment, dispassion, cessation, peace, direct knowledge, full enlightenment, and Nibbāna.",
      "sinhala": "මහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, එකාන්තයෙන් කලකිරීම පිණිස, නොඇලීම පිණිස, නිරෝධය පිණිස, සංසිඳීම පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිවන පිණිස පවතින ධර්ම​ කරුණු පහක් වෙත්.\n\nකවරේද ඒ කරුණු පහ?\n\nමහණෙනි, මෙහිලා භික්‍ෂුවක් කයෙහි අශුභානුපස්සීව වාසය කරයි. ආහාරයෙහි පිළිකුල් සංඥාව ඇත්තෙක් වෙයි. සියලු ලෝකයෙහි නොඇලුණු සංඥාව ඇත්තෙක් වෙයි. සියලු සංස්කාරයන්හි අනිත්‍ය වශයෙන් බලන්නෙක් වෙයි. මරණ සංඥාවද ඔහුට ඇතුළත මනාව පිහිටා පවතී.\n\nමහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, එකාන්තයෙන් කලකිරීම පිණිස, නොඇලීම පිණිස, නිරෝධය පිණිස, සංසිඳීම පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිවන පිණිස පවතින ධර්ම​ කරුණු මේ පහයි.",
      "paliTitle": "Nibbidāsuttaṃ"
    },
    {
      "number": 70,
      "pali": "‘‘Pañcime, bhikkhave, dhammā bhāvitā bahulīkatā āsavānaṃ khayāya saṃvattanti. Katame pañca? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratasaññī, sabbasaṅkhāresu aniccānupassī, maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. Ime kho, bhikkhave, pañca dhammā bhāvitā bahulīkatā āsavānaṃ khayāya saṃvattantī’’ti. Dasamaṃ. ",
      "english": "Monks, these five qualities, when developed and frequently practiced, lead to the destruction of the taints. Which five? Here, monks, a monk dwells contemplating repulsiveness in the body, perceives loathsomeness in food, perceives non-delight in the entire world, contemplates impermanence in all conditioned phenomena, and the perception of death is well-established internally for him. These five qualities, monks, when developed and frequently practiced, lead to the destruction of the taints.",
      "sinhala": "භික්ෂූණි, මේ ධර්ම පහක් වැඩූ කල්හි, නැවත නැවත පුරුදු කළ කල්හි ආශ්‍රවයන් ක්ෂය කිරීම පිණිස පවතී. ඒවා කවරේද පහක්? භික්ෂූණි, මෙහිලා භික්ෂුවක් කාය අශුභානුපස්සීව වාසය කරයි, ආහාරයෙහි ප්‍ර‍තික්කූල සංඥාව ඇතුව වාසය කරයි, සියලු ලෝකයෙහි ඇලීමක් නැති සංඥාව ඇතුව වාසය කරයි, සියලු සංස්කාරයන් අනිත්‍ය වශයෙන් අනුපස්සීව වාසය කරයි, මරණ සංඥාව ද ඔහුට ඇතුළත මනාව පිහිටා පවතී. භික්ෂූණි, මේ ධර්ම පහ වැඩූ කල්හි, නැවත නැවත පුරුදු කළ කල්හි ආශ්‍රවයන් ක්ෂය කිරීම පිණිස පවතී.",
      "paliTitle": "Āsavakkhayasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Saññāvaggo dutiyo. Tassuddānaṃ – Dve ca saññā dve vaḍḍhī ca, sākacchena ca sājīvaṃ; Iddhipādā ca dve vuttā, nibbidā cāsavakkhayāti.",
    "english": "",
    "sinhala": ""
  }
}