{
  "id": "an5.25",
  "title": {
    "pali": "Duccaritavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 241,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā duccarite. Katame pañca? Attāpi attānaṃ upavadati; anuvicca viññū garahanti; pāpako kittisaddo abbhuggacchati; sammūḷho kālaṃ karoti; kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā duccarite. ‘‘Pañcime, bhikkhave, ānisaṃsā sucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asammūḷho kālaṃ karoti; kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā sucarite’’ti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamaduccaritasuttaṃ"
    },
    {
      "number": 242,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kāyaduccarite…pe… ānisaṃsā kāyasucarite…pe…. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamakāyaduccaritasuttaṃ"
    },
    {
      "number": 243,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā vacīduccarite…pe… ānisaṃsā vacīsucarite…pe…. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamavacīduccaritasuttaṃ"
    },
    {
      "number": 244,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā manoduccarite…pe… ānisaṃsā manosucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asammūḷho kālaṃ karoti; kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā manosucarite’’ti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamamanoduccaritasuttaṃ"
    },
    {
      "number": 245,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā duccarite. Katame pañca? Attāpi attānaṃ upavadati; anuvicca viññū garahanti; pāpako kittisaddo abbhuggacchati; saddhammā vuṭṭhāti; asaddhamme patiṭṭhāti. Ime kho, bhikkhave, pañca ādīnavā duccarite. ‘‘Pañcime, bhikkhave, ānisaṃsā sucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asaddhammā vuṭṭhāti; saddhamme patiṭṭhāti. Ime kho, bhikkhave, pañca ānisaṃsā sucarite’’ti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyaduccaritasuttaṃ"
    },
    {
      "number": 246,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kāyaduccarite…pe… ānisaṃsā kāyasucarite…pe…. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyakāyaduccaritasuttaṃ"
    },
    {
      "number": 247,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā vacīduccarite…pe… ānisaṃsā vacīsucarite…pe…. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyavacīduccaritasuttaṃ"
    },
    {
      "number": 248,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā manoduccarite…pe… ānisaṃsā manosucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asaddhammā vuṭṭhāti; saddhamme patiṭṭhāti. Ime kho, bhikkhave, pañca ānisaṃsā manosucarite’’ti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyamanoduccaritasuttaṃ"
    },
    {
      "number": 249,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā sivathikāya [sīvathikāya (sī. syā. kaṃ. pī.)]. Katame pañca? Asuci, duggandhā, sappaṭibhayā, vāḷānaṃ amanussānaṃ āvāso, bahuno janassa ārodanā – ime kho, bhikkhave, pañca ādīnavā sivathikāya. ‘‘Evamevaṃ kho, bhikkhave, pañcime ādīnavā sivathikūpame puggale. Katame pañca? Idha, bhikkhave, ekacco puggalo asucinā kāyakammena samannāgato hoti; asucinā vacīkammena samannāgato hoti; asucinā manokammena samannāgato hoti. Idamassa asucitāya vadāmi. Seyyathāpi sā, bhikkhave, sivathikā asuci; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘Tassa asucinā kāyakammena samannāgatassa, asucinā vacīkammena samannāgatassa, asucinā manokammena samannāgatassa pāpako kittisaddo abbhuggacchati. Idamassa duggandhatāya vadāmi. Seyyathāpi sā, bhikkhave, sivathikā duggandhā; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘Tamenaṃ asucinā kāyakammena samannāgataṃ, asucinā vacīkammena samannāgataṃ, asucinā manokammena samannāgataṃ pesalā sabrahmacārī ārakā parivajjanti. Idamassa sappaṭibhayasmiṃ vadāmi. Seyyathāpi sā, bhikkhave, sivathikā sappaṭibhayā; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘So asucinā kāyakammena samannāgato, asucinā vacīkammena samannāgato, asucinā manokammena samannāgato sabhāgehi puggalehi saddhiṃ saṃvasati. Idamassa vāḷāvāsasmiṃ vadāmi. Seyyathāpi sā, bhikkhave, sivathikā vāḷānaṃ amanussānaṃ āvāso; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘Tamenaṃ asucinā kāyakammena samannāgataṃ, asucinā vacīkammena samannāgataṃ, asucinā manokammena samannāgataṃ pesalā sabrahmacārī disvā khīyadhammaṃ [khīyanadhammaṃ (sī.)] āpajjanti – ‘aho vata no dukkhaṃ ye mayaṃ evarūpehi puggalehi saddhiṃ saṃvasāmā’ti! Idamassa ārodanāya vadāmi. Seyyathāpi sā, bhikkhave, sivathikā bahuno janassa ārodanā; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ime kho, bhikkhave, pañca ādīnavā sivathikūpame puggale’’ti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sivathikasuttaṃ"
    },
    {
      "number": 250,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā puggalappasāde. Katame pañca? Yasmiṃ, bhikkhave, puggale puggalo abhippasanno hoti, so tathārūpaṃ āpattiṃ āpanno hoti yathārūpāya āpattiyā saṅgho ukkhipati. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo piyo manāpo so saṅghena ukkhitto’ti. Bhikkhūsu appasādabahulo hoti. Bhikkhūsu appasādabahulo samāno aññe bhikkhū na bhajati. Aññe bhikkhū abhajanto saddhammaṃ na suṇāti. Saddhammaṃ asuṇanto saddhammā parihāyati. Ayaṃ, bhikkhave, paṭhamo ādīnavo puggalappasāde. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ puggale puggalo abhippasanno hoti, so tathārūpaṃ āpattiṃ āpanno hoti yathārūpāya āpattiyā saṅgho ante nisīdāpeti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo piyo manāpo so saṅghena ante nisīdāpito’ti. Bhikkhūsu appasādabahulo hoti. Bhikkhūsu appasādabahulo samāno aññe bhikkhū na bhajati. Aññe bhikkhū abhajanto saddhammaṃ na suṇāti. Saddhammaṃ asuṇanto saddhammā parihāyati. Ayaṃ, bhikkhave, dutiyo ādīnavo puggalappasāde. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ puggale puggalo abhippasanno hoti, so disāpakkanto hoti… pe… so vibbhanto hoti…pe… so kālaṅkato hoti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo piyo manāpo so kālaṅkato’ti. Aññe bhikkhū na bhajati. Aññe bhikkhū abhajanto saddhammaṃ na suṇāti. Saddhammaṃ asuṇanto saddhammā parihāyati. Ayaṃ, bhikkhave, pañcamo ādīnavo puggalappasāde. Ime kho, bhikkhave, pañca ādīnavā puggalappasāde’’ti. Dasamaṃ. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Puggalappasādasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Duccaritavaggo pañcamo. Tassuddānaṃ – Duccaritaṃ kāyaduccaritaṃ, vacīduccaritaṃ manoduccaritaṃ; Catūhi pare dve sivathikā, puggalappasādena cāti. Pañcamapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}