{
  "id": "an5.26",
  "title": {
    "pali": "Upasampadāvaggo",
    "english": "The Chapter on Higher Ordination",
    "sinhala": "උපසම්පදා වග්ගය"
  },
  "sections": [
    {
      "number": 251,
      "pali": "[mahāva. 84] ‘‘Pañcahi, bhikkhave, dhammehi samannāgatena bhikkhunā upasampādetabbaṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu asekhena sīlakkhandhena samannāgato hoti; asekhena samādhikkhandhena samannāgato hoti; asekhena paññākkhandhena samannāgato hoti; asekhena vimuttikkhandhena samannāgato hoti; asekhena vimuttiñāṇadassanakkhandhena samannāgato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatena bhikkhunā upasampādetabba’’nti. Paṭhamaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities may give full ordination. Which five? Here, Monks, a bhikkhu is endowed with the perfected aggregate of moral virtue; is endowed with the perfected aggregate of concentration; is endowed with the perfected aggregate of wisdom; is endowed with the perfected aggregate of liberation; and is endowed with the perfected aggregate of the knowledge and vision of liberation. Indeed, Monks, a bhikkhu endowed with these five qualities may give full ordination.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව විසින් උපසම්පදා කටයුතු කළ යුතු ය. කවර පස් වැදෑරුම් ධර්මයන්ගෙන් ද? මහණෙනි, මෙහිලා භික්ෂුව අශෛක්ෂ ශීලස්කන්ධයෙන් යුක්ත වේ; අශෛක්ෂ සමාධිස්කන්ධයෙන් යුක්ත වේ; අශෛක්ෂ ප්‍රඥාස්කන්ධයෙන් යුක්ත වේ; අශෛක්ෂ විමුක්තිස්කන්ධයෙන් යුක්ත වේ; අශෛක්ෂ විමුක්තිඥානදර්ශනස්කන්ධයෙන් යුක්ත වේ. මහණෙනි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව විසින් උපසම්පදා කටයුතු කළ යුතු ය.\n\nපළමු වැන්නයි.",
      "paliTitle": "Upasampādetabbasuttaṃ"
    },
    {
      "number": 252,
      "pali": "[mahāva. 84] ‘‘Pañcahi, bhikkhave, dhammehi samannāgatena bhikkhunā nissayo dātabbo. Katamehi pañcahi? Idha, bhikkhave, bhikkhu asekhena sīlakkhandhena samannāgato hoti…pe… asekhena vimuttiñāṇadassanakkhandhena samannāgato hoti. Imehi…pe… nissayo dātabbo’’ti. Dutiyaṃ.",
      "english": "Monks, a monk endowed with five qualities is fit to be a spiritual guide. Which five? Here, Monks, a monk is endowed with the aggregate of virtue of one beyond training; he is endowed with the aggregate of concentration of one beyond training; he is endowed with the aggregate of wisdom of one beyond training; he is endowed with the aggregate of liberation of one beyond training; and he is endowed with the aggregate of knowledge and vision of liberation of one beyond training. By these five qualities, such a one is fit to be a spiritual guide. This is the second [discourse].",
      "sinhala": "මහණෙනි, ධර්‍ම කරුණු පහකින් සමන්විත වූ භික්ෂුවක් විසින් නයිස්සය ලබා දිය යුතුයි. ඒ කවර කරුණු පහකින් ද?\n\nමහණෙනි, මේ ශාසනයෙහි භික්ෂුවක් අසේඛ ශීලස්කන්ධයෙන් යුක්ත වෙයි, අසේඛ සමාධිස්කන්ධයෙන් යුක්ත වෙයි, අසේඛ ප්‍ර‍්‍රඥාස්කන්ධයෙන් යුක්ත වෙයි, අසේඛ විමුක්තිස්කන්ධයෙන් යුක්ත වෙයි, අසේඛ විමුක්තිඥානදර්ශනස්කන්ධයෙන් යුක්ත වෙයි.\n\nමහණෙනි, මේ කරුණු පහකින් සමන්විත වූ භික්ෂුවක් විසින් නයිස්සය ලබා දිය යුතුයි.",
      "paliTitle": "Nissayasuttaṃ"
    },
    {
      "number": 253,
      "pali": "[mahāva. 84] ‘‘Pañcahi, bhikkhave, dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi? Idha, bhikkhave, bhikkhu asekhena sīlakkhandhena samannāgato hoti; asekhena samādhikkhandhena… asekhena paññākkhandhena… asekhena vimuttikkhandhena… asekhena vimuttiñāṇadassanakkhandhena samannāgato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo’’ti. Tatiyaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities should accept a novice for tutelage. What are these five? Here, monks, a bhikkhu is endowed with the aggregate of virtue beyond training; with the aggregate of concentration beyond training; with the aggregate of wisdom beyond training; with the aggregate of liberation beyond training; and with the aggregate of the knowledge and vision of liberation beyond training. Indeed, monks, a bhikkhu endowed with these five qualities should accept a novice for tutelage.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ භික්ෂුවක් විසින් සාමනේර නමක් භාරගත යුතුයි. ඒ පස් කරුණ කවරේද? මහණෙනි, මෙහිලා භික්ෂුව අශෛක්ෂ සීලස්කන්ධයෙන් සමන්නාගත වෙයි; අශෛක්ෂ සමාධිස්කන්ධයෙන් සමන්නාගත වෙයි; අශෛක්ෂ ප්‍ර‍ඥාස්කන්ධයෙන් සමන්නාගත වෙයි; අශෛක්ෂ විමුක්තිස්කන්ධයෙන් සමන්නාගත වෙයි; අශෛක්ෂ විමුක්ති ඥාන දර්ශන ස්කන්ධයෙන් සමන්නාගත වෙයි. මහණෙනි, මේ පස් කරුණින් සමන්වාගත වූ භික්ෂුවක් විසින් සාමනේර නමක් භාරගත යුතුයි.",
      "paliTitle": "Sāmaṇerasuttaṃ"
    },
    {
      "number": 254,
      "pali": "‘‘Pañcimāni, bhikkhave, macchariyāni. Katamāni pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ – imāni kho, bhikkhave, pañca macchariyāni. Imesaṃ kho, bhikkhave, pañcannaṃ macchariyānaṃ etaṃ paṭikuṭṭhaṃ [patikiṭṭhaṃ (sī. pī.), paṭikkiṭṭhaṃ (syā. kaṃ.), paṭikiṭṭhaṃ (ka.)], yadidaṃ dhammamacchariya’’nti. Catutthaṃ.",
      "english": "Bhikkhus, there are these five kinds of stinginess. Which five? Stinginess regarding dwellings, stinginess regarding families, stinginess regarding gain, stinginess regarding praise or status, and stinginess regarding the Dhamma – these, Bhikkhus, are the five kinds of stinginess. Among these five kinds of stinginess, Bhikkhus, this is the most reprehensible, namely, stinginess regarding the Dhamma.",
      "sinhala": "මහණෙනි, මේ මසුරුකම් පසකි. ඒ පස කවරේද යත්: ආවාසමච්ඡරිය, කුලමච්ඡරිය, ලාභමච්ඡරිය, වර්ණමච්ඡරිය, ධ​ර්‍මමච්ඡරිය යන මේවායි. මහණෙනි, මේවා මසුරුකම් පසකි. මහණෙනි, මේ මසුරුකම් පස අතුරින් යම් මේ ධ​ර්‍මමච්ඡරිය වේද, එය අතිශයින්ම නින්දා කටයුත්තකි.",
      "paliTitle": "Pañcamacchariyasuttaṃ"
    },
    {
      "number": 255,
      "pali": "‘‘Pañcannaṃ, bhikkhave, macchariyānaṃ pahānāya samucchedāya brahmacariyaṃ vussati. Katamesaṃ pañcannaṃ? Āvāsamacchariyassa pahānāya samucchedāya brahmacariyaṃ vussati; kulamacchariyassa…pe… lābhamacchariyassa… vaṇṇamacchariyassa… dhammamacchariyassa pahānāya samucchedāya brahmacariyaṃ vussati. Imesaṃ kho, bhikkhave, pañcannaṃ macchariyānaṃ pahānāya samucchedāya brahmacariyaṃ vussatī’’ti. Pañcamaṃ.",
      "english": "Monks, the holy life is lived for the abandoning and utter eradication of five forms of avarice. Which five? The holy life is lived for the abandoning and utter eradication of avarice concerning dwellings; of avarice concerning families; of avarice concerning gains; of avarice concerning reputation; and of avarice concerning the Dhamma. Indeed, Monks, it is for the abandoning and utter eradication of these five forms of avarice that the holy life is lived.",
      "sinhala": "භික්‍ෂූනි, පස් වැදෑරුම් මසුරුකම් ප්‍රහීණ කිරීම පිණිසද, මුලින් උදුරා දැමීම පිණිසද, බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ.\n\nඒ පස් වැදෑරුම් දේ කවරේද?\n\nආවාස මසුරුකම ප්‍රහීණ කිරීම පිණිසද, මුලින් උදුරා දැමීම පිණිසද, බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. කුල මසුරුකම ප්‍රහීණ කිරීම පිණිසද, මුලින් උදුරා දැමීම පිණිසද, බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. ලාභ මසුරුකම ප්‍රහීණ කිරීම පිණිසද, මුලින් උදුරා දැමීම පිණිසද, බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. වර්ණ මසුරුකම ප්‍රහීණ කිරීම පිණිසද, මුලින් උදුරා දැමීම පිණිසද, බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ. ධම්ම මසුරුකම ප්‍රහීණ කිරීම පිණිසද, මුලින් උදුරා දැමීම පිණිසද, බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ.\n\nභික්‍ෂූනි, සැබවින්ම, මේ පස් වැදෑරුම් මසුරුකම් ප්‍රහීණ කිරීම පිණිසද, මුලින් උදුරා දැමීම පිණිසද, බ්‍රහ්මචර්යාව වාසය කරනු ලැබේ.",
      "paliTitle": "Macchariyappahānasuttaṃ"
    },
    {
      "number": 256,
      "pali": "‘‘Pañcime, bhikkhave, dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ – ime kho, bhikkhave, pañca dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. ‘‘Pañcime, bhikkhave, dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ – ime kho, bhikkhave, pañca dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharitu’’nti. Chaṭṭhaṃ.",
      "english": "Monks, without abandoning these five qualities, one is incapable of entering and dwelling in the first jhāna. Which five? Stinginess regarding one's dwelling, stinginess regarding one's family of supporters, stinginess regarding gains, stinginess regarding one's appearance or reputation, and stinginess regarding the Dhamma – Monks, without abandoning these five qualities, one is incapable of entering and dwelling in the first jhāna.\n\nMonks, having abandoned these five qualities, one is capable of entering and dwelling in the first jhāna. Which five? Stinginess regarding one's dwelling, stinginess regarding one's family of supporters, stinginess regarding gains, stinginess regarding one's appearance or reputation, and stinginess regarding the Dhamma – Monks, having abandoned these five qualities, one is capable of entering and dwelling in the first jhāna.",
      "sinhala": "මහණෙනි, මේ ධර\\u200D්ම පහ අත්නොහැර ප\\u200D්‍රථම ධ්‍යානයට එළඹ වාසය කිරීමට නොහැක්කේය. කවරේද ඒ ධර\\u200D්ම පහ? ආවාස මසුරුකම, කුල මසුරුකම, ලාභ මසුරුකම, වර\\u200D්ණ මසුරුකම, ධර\\u200D්ම මසුරුකම යන මේ ධර\\u200D්ම පහ අත්නොහැර මහණෙනි, ප\\u200D්‍රථම ධ්‍යානයට එළඹ වාසය කිරීමට නොහැක්කේය.\n\nමහණෙනි, මේ ධර\\u200D්ම පහ අත්හැර ප\\u200D්‍රථම ධ්‍යානයට එළඹ වාසය කිරීමට හැක්කේය. කවරේද ඒ ධර\\u200D්ම පහ? ආවාස මසුරුකම, කුල මසුරුකම, ලාභ මසුරුකම, වර\\u200D්ණ මසුරුකම, ධර\\u200D්ම මසුරුකම යන මේ ධර\\u200D්ම පහ අත්හැර මහණෙනි, ප\\u200D්‍රථම ධ්‍යානයට එළඹ වාසය කිරීමට හැක්කේය.",
      "paliTitle": "Paṭhamajhānasuttaṃ"
    },
    {
      "number": 257,
      "numberRange": "257-263",
      "pali": "‘‘Pañcime, bhikkhave, dhamme appahāya abhabbo dutiyaṃ jhānaṃ…pe… abhabbo tatiyaṃ jhānaṃ… abhabbo catutthaṃ jhānaṃ… abhabbo sotāpattiphalaṃ… abhabbo sakadāgāmiphalaṃ… abhabbo anāgāmiphalaṃ… abhabbo arahattaṃ [arahattaphalaṃ (sī.)] sacchikātuṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ – ime kho, bhikkhave, pañca dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. ‘‘Pañcime, bhikkhave, dhamme pahāya bhabbo dutiyaṃ jhānaṃ…pe… bhabbo tatiyaṃ jhānaṃ… bhabbo catutthaṃ jhānaṃ… bhabbo sotāpattiphalaṃ… bhabbo sakadāgāmiphalaṃ… bhabbo anāgāmiphalaṃ… bhabbo arahattaṃ sacchikātuṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ – ime kho, bhikkhave, pañca dhamme pahāya bhabbo arahattaṃ sacchikātu’’nti. Terasamaṃ.",
      "english": "Monks, by not abandoning these five things, one is incapable of realizing the second jhāna, incapable of realizing the third jhāna, incapable of realizing the fourth jhāna, incapable of realizing the fruit of stream-entry, incapable of realizing the fruit of once-returning, incapable of realizing the fruit of non-returning, and incapable of realizing Arahantship. Which five? They are: stinginess regarding dwelling places, stinginess regarding families of supporters, stinginess regarding gains, stinginess regarding praise and reputation, and stinginess regarding the Dhamma. Indeed, monks, having not abandoned these five things, one is incapable of realizing Arahantship.\n\nMonks, by abandoning these five things, one is capable of realizing the second jhāna, capable of realizing the third jhāna, capable of realizing the fourth jhāna, capable of realizing the fruit of stream-entry, capable of realizing the fruit of once-returning, capable of realizing the fruit of non-returning, and capable of realizing Arahantship. Which five? They are: stinginess regarding dwelling places, stinginess regarding families of supporters, stinginess regarding gains, stinginess regarding praise and reputation, and stinginess regarding the Dhamma. Indeed, monks, having abandoned these five things, one is capable of realizing Arahantship.",
      "sinhala": "භික්‍ෂූණි, මේ ධර්ම පහ අත්නොහැර දෙවෙනි ධ්‍යානය සාක්‍ෂාත් කිරීමට නොහැක. තෙවෙනි ධ්‍යානය සාක්‍ෂාත් කිරීමට නොහැක. සතරවෙනි ධ්‍යානය සාක්‍ෂාත් කිරීමට නොහැක. සෝවාන් ඵලය සාක්‍ෂාත් කිරීමට නොහැක. සකදාගාමී ඵලය සාක්‍ෂාත් කිරීමට නොහැක. අනාගාමී ඵලය සාක්‍ෂාත් කිරීමට නොහැක. රහත්ඵලය සාක්‍ෂාත් කිරීමට නොහැක. ඒ පහ කවරහුද? ආවාස මච්ඡරිය, කුල මච්ඡරිය, ලාභ මච්ඡරිය, වර්ණ මච්ඡරිය, ධර්ම මච්ඡරිය යන මේවායි. භික්‍ෂූණි, මේ ධර්ම පහ අත්නොහැර රහත්ඵලය සාක්‍ෂාත් කිරීමට නොහැක.\n\nභික්‍ෂූණි, මේ ධර්ම පහ අත්හැර දෙවෙනි ධ්‍යානය සාක්‍ෂාත් කිරීමට සමත් වේ. තෙවෙනි ධ්‍යානය සාක්‍ෂාත් කිරීමට සමත් වේ. සතරවෙනි ධ්‍යානය සාක්‍ෂාත් කිරීමට සමත් වේ. සෝවාන් ඵලය සාක්‍ෂාත් කිරීමට සමත් වේ. සකදාගාමී ඵලය සාක්‍ෂාත් කිරීමට සමත් වේ. අනාගාමී ඵලය සාක්‍ෂාත් කිරීමට සමත් වේ. රහත්ඵලය සාක්‍ෂාත් කිරීමට සමත් වේ. ඒ පහ කවරහුද? ආවාස මච්ඡරිය, කුල මච්ඡරිය, ලාභ මච්ඡරිය, වර්ණ මච්ඡරිය, ධර්ම මච්ඡරිය යන මේවායි. භික්‍ෂූණි, මේ ධර්ම පහ අත්හැර රහත්ඵලය සාක්‍ෂාත් කිරීමට සමත් වේ.",
      "paliTitle": "Dutiyajhānasuttādisattakaṃ"
    },
    {
      "number": 264,
      "pali": "‘‘Pañcime, bhikkhave, dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, akataññutaṃ akataveditaṃ – ime kho, bhikkhave, pañca dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. ‘‘Pañcime, bhikkhave, dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, akataññutaṃ akataveditaṃ – ime kho, bhikkhave, pañca dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharitu’’nti. Cuddasamaṃ.",
      "english": "Monks, without abandoning these five qualities, one is incapable of attaining and dwelling in the first jhāna. Which five? Jealousy regarding lodging, jealousy regarding families of supporters, jealousy regarding material gains, jealousy regarding reputation, and a lack of gratitude and appreciation for good deeds. Indeed, monks, without abandoning these five qualities, one is incapable of attaining and dwelling in the first jhāna.\n\nMonks, having abandoned these five qualities, one is capable of attaining and dwelling in the first jhāna. Which five? Jealousy regarding lodging, jealousy regarding families of supporters, jealousy regarding material gains, jealousy regarding reputation, and a lack of gratitude and appreciation for good deeds. Indeed, monks, having abandoned these five qualities, one is capable of attaining and dwelling in the first jhāna.",
      "sinhala": "මහණෙනි, මේ ධර්ම පහ ප්‍රහීණ නොකර කෙනෙකුට පළමු ධ්‍යානයට සමවදින්නට හා එහි වාසය කරන්නට නොහැකි වේ. ඒ ධර්ම පහ කවරේද? ආවාස මසුරුකම, කුල මසුරුකම, ලාභ මසුරුකම, වර්ණ මසුරුකම, අකෘතඥතාව සහ අකෘතවේදී බව යන මේවාය. මහණෙනි, සැබවින්ම මේ ධර්ම පහ ප්‍රහීණ නොකර කෙනෙකුට පළමු ධ්‍යානයට සමවදින්නට හා එහි වාසය කරන්නට නොහැකි වේ.\n\nමහණෙනි, මේ ධර්ම පහ ප්‍රහීණ කොට කෙනෙකුට පළමු ධ්‍යානයට සමවදින්නට හා එහි වාසය කරන්නට හැකි වේ. ඒ ධර්ම පහ කවරේද? ආවාස මසුරුකම, කුල මසුරුකම, ලාභ මසුරුකම, වර්ණ මසුරුකම, අකෘතඥතාව සහ අකෘතවේදී බව යන මේවාය. මහණෙනි, සැබවින්ම මේ ධර්ම පහ ප්‍රහීණ කොට කෙනෙකුට පළමු ධ්‍යානයට සමවදින්නට හා එහි වාසය කරන්නට හැකි වේ.",
      "paliTitle": "Aparapaṭhamajhānasuttaṃ"
    },
    {
      "number": 265,
      "numberRange": "265-271",
      "pali": "‘‘Pañcime, bhikkhave, dhamme appahāya abhabbo dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ… sotāpattiphalaṃ… sakadāgāmiphalaṃ… anāgāmiphalaṃ… arahattaṃ sacchikātuṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, akataññutaṃ akataveditaṃ – ime kho, bhikkhave, pañca dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. ‘‘Pañcime, bhikkhave, dhamme pahāya bhabbo dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ… sotāpattiphalaṃ… sakadāgāmiphalaṃ… anāgāmiphalaṃ… arahattaṃ sacchikātuṃ. Katame pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, akataññutaṃ akataveditaṃ – ime kho, bhikkhave, pañca dhamme pahāya bhabbo arahattaṃ sacchikātu’’nti. Ekavīsatimaṃ. ",
      "english": "Monks, by not abandoning these five qualities, one is incapable of actualizing the second meditative absorption, the third meditative absorption, the fourth meditative absorption, the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, and Arahantship. Which five? Stinginess regarding dwellings, stinginess regarding families, stinginess regarding gains, stinginess regarding praise, and ingratitude and unthankfulness. Monks, by not abandoning these five qualities, one is incapable of actualizing Arahantship.\n\nMonks, by abandoning these five qualities, one is capable of actualizing the second meditative absorption, the third meditative absorption, the fourth meditative absorption, the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, and Arahantship. Which five? Stinginess regarding dwellings, stinginess regarding families, stinginess regarding gains, stinginess regarding praise, and ingratitude and unthankfulness. Monks, by abandoning these five qualities, one is capable of actualizing Arahantship.",
      "sinhala": "භික්ෂූනි, මේ ධර්ම පහ අත්නොහැර සිටින තැනැත්තෙකුට දෙවන ධ්‍යානය, තෙවන ධ්‍යානය, සිව්වන ධ්‍යානය, සෝවාන් ඵලය, සකෘදාගාමී ඵලය, අනාගාමී ඵලය සහ අරහත්වය සාක්ෂාත් කරගැනීමට නොහැක්කේය. කවර නම් පහක් ද? ආවාසයන් පිළිබඳ මසුරුකම, කුලයන් පිළිබඳ මසුරුකම, ලාභයන් පිළිබඳ මසුරුකම, කීර්ති වර්ණනා පිළිබඳ මසුරුකම, අකෘතඥතාවය හා කෘතගුණ නොදැක්වීම යන මේවා යි. භික්ෂූනි, මේ ධර්ම පහ අත්නොහැර සිටින තැනැත්තෙකුට අරහත්වය සාක්ෂාත් කරගැනීමට නොහැක්කේය.\n\nභික්ෂූනි, මේ ධර්ම පහ අත්හැර සිටින තැනැත්තෙකුට දෙවන ධ්‍යානය, තෙවන ධ්‍යානය, සිව්වන ධ්‍යානය, සෝවාන් ඵලය, සකෘදාගාමී ඵලය, අනාගාමී ඵලය සහ අරහත්වය සාක්ෂාත් කරගැනීමට හැක්කේය. කවර නම් පහක් ද? ආවාසයන් පිළිබඳ මසුරුකම, කුලයන් පිළිබඳ මසුරුකම, ලාභයන් පිළිබඳ මසුරුකම, කීර්ති වර්ණනා පිළිබඳ මසුරුකම, අකෘතඥතාවය හා කෘතගුණ නොදැක්වීම යන මේවා යි. භික්ෂූනි, මේ ධර්ම පහ අත්හැර සිටින තැනැත්තෙකුට අරහත්වය සාක්ෂාත් කරගැනීමට හැක්කේය.",
      "paliTitle": "Aparadutiyajhānasuttādisattakaṃ"
    }
  ],
  "footer": {
    "pali": "Upasampadāvaggo chaṭṭho.",
    "english": "",
    "sinhala": ""
  }
}