{
  "id": "an5.18",
  "title": {
    "pali": "Upāsakavaggo",
    "english": "The Chapter on Lay Disciples",
    "sinhala": "උපාසක වග්ගය"
  },
  "sections": [
    {
      "number": 171,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako sārajjaṃ okkanto hoti. Katamehi pañcahi? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, surāmerayamajjapamādaṭṭhāyī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako sārajjaṃ okkanto hoti. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako visārado hoti. Katamehi pañcahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako visārado hotī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard – at one time the Blessed One was staying in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. There, indeed, the Blessed One addressed the monks, saying, \"Monks!\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this:\n\n\"Monks, an lay follower endowed with five qualities falls into timidity. What are these five? He is one who takes life, he is one who takes what is not given, he is one who engages in sexual misconduct, he is one who speaks falsely, and he is one who indulges in fermented and distilled intoxicants which are a basis for heedlessness. Indeed, monks, an lay follower endowed with these five qualities falls into timidity.\n\n\"Monks, an lay follower endowed with five qualities is confident. What are these five? He abstains from taking life, he abstains from taking what is not given, he abstains from sexual misconduct, he abstains from false speech, and he abstains from fermented and distilled intoxicants which are a basis for heedlessness. Indeed, monks, an lay follower endowed with these five qualities is confident.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර, අනේපිඬු සිටුතුමා විසින් කරවන ලද ජේතවනාරාමයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, කරුණු පසකින් යුක්ත උපාසකයා පසුතැවීම් සහිත වූ, නොසන්සුන් වූ තත්ත්වයකට පත් වෙයි. කවර පසකින් ද? ප්‍රාණඝාතයෙහි යෙදෙයි, අදත්තාදානයෙහි යෙදෙයි, කාමයන්හි වරදවා හැසිරෙයි, මුසාවාදයේ යෙදෙයි, සුරා-මේරය මත්පැන් පානය කොට ප්‍රමාදයට පත් වෙයි. මහණෙනි, මේ කරුණු පසින් යුක්ත වූ උපාසකයා පසුතැවීම් සහිත වූ, නොසන්සුන් වූ තත්ත්වයකට පත් වෙයි.\"\n\n\"මහණෙනි, කරුණු පසකින් යුක්ත උපාසකයා නිර්භීත (විශ්වාස සහිත) වෙයි. කවර පසකින් ද? ප්‍රාණඝාතයෙන් වැළකී සිටියි, අදත්තාදානයෙන් වැළකී සිටියි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි, මුසාවාදයෙන් වැළකී සිටියි, සුරා-මේරය මත්පැන් පානය කොට ප්‍රමාදයට පත්වීමෙන් වැළකී සිටියි. මහණෙනි, මේ කරුණු පසින් යුක්ත වූ උපාසකයා නිර්භීත (විශ්වාස සහිත) වෙයි\" යනුවෙන් වදාළ සේක.",
      "paliTitle": "Sārajjasuttaṃ"
    },
    {
      "number": 172,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako avisārado agāraṃ ajjhāvasati. Katamehi pañcahi? Pāṇātipātī hoti…pe… surāmerayamajjapamādaṭṭhāyī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako avisārado agāraṃ ajjhāvasati. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako visārado agāraṃ ajjhāvasati. Katamehi pañcahi? Pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako visārado agāraṃ ajjhāvasatī’’ti. Dutiyaṃ.",
      "english": "Monks, a lay follower endowed with five qualities dwells in the household lacking assurance. Which five? He is one who destroys living beings; he is one who takes what is not given; he is one who engages in sexual misconduct; he is one who speaks falsely; he is one who indulges in intoxicating drinks and drugs that lead to heedlessness. Indeed, monks, a lay follower endowed with these five qualities dwells in the household lacking assurance.\n\nMonks, a lay follower endowed with five qualities dwells in the household with assurance. Which five? He abstains from destroying living beings; he abstains from taking what is not given; he abstains from sexual misconduct; he abstains from false speech; he abstains from intoxicating drinks and drugs that lead to heedlessness. Indeed, monks, a lay follower endowed with these five qualities dwells in the household with assurance.",
      "sinhala": "භික්ෂූණි, පස් වැදෑරුම් දහම් වලින් යුක්ත උපාසකයෙක් නිර්භීත නොවී ගිහි ගෙයි වෙසෙයි. කවර පස් වැදෑරුම් දහම් වලින්ද? සතුන් මැරීමෙහි යෙදෙන්නෙක් වෙයි. නොදුන් දේ ගැනීමෙහි යෙදෙන්නෙක් වෙයි. කාමයන්හි වරදවා හැසිරීමෙහි යෙදෙන්නෙක් වෙයි. බොරු කීමෙහි යෙදෙන්නෙක් වෙයි. සුරාමේරය මදයට හා ප්‍රමාදයට හේතුවන කම්හි යෙදෙන්නෙක් වෙයි. භික්ෂූණි, මේ පස් වැදෑරුම් දහම් වලින් යුක්ත උපාසකයෙක් නිර්භීත නොවී ගිහි ගෙයි වෙසෙයි.\n\nභික්ෂූණි, පස් වැදෑරුම් දහම් වලින් යුක්ත උපාසකයෙක් නිර්භීතව ගිහි ගෙයි වෙසෙයි. කවර පස් වැදෑරුම් දහම් වලින්ද? සතුන් මැරීමෙන් වැළකුණේ වෙයි. නොදුන් දේ ගැනීමෙන් වැළකුණේ වෙයි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණේ වෙයි. බොරු කීමෙන් වැළකුණේ වෙයි. සුරාමේරය මදයට හා ප්‍රමාදයට හේතුවන කම්වලින් වැළකුණේ වෙයි. භික්ෂූණි, මේ පස් වැදෑරුම් දහම් වලින් යුක්ත උපාසකයෙක් නිර්භීතව ගිහි ගෙයි වෙසෙයි.",
      "paliTitle": "Visāradasuttaṃ"
    },
    {
      "number": 173,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Pāṇātipātī hoti…pe… surāmerayamajjapamādaṭṭhāyī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako yathābhataṃ nikkhitto evaṃ sagge’’ti. Tatiyaṃ.",
      "english": "Monks, a lay follower endowed with five qualities is deposited directly into hell, just as he is. Which five? He kills living beings, and so on, up to indulging in distilled and fermented intoxicants that are a basis for heedlessness. Indeed, monks, a lay follower endowed with these five qualities is deposited directly into hell, just as he is.\n\nMonks, a lay follower endowed with five qualities is deposited directly into heaven, just as he is. Which five? He abstains from killing living beings, and so on, up to abstaining from distilled and fermented intoxicants that are a basis for heedlessness. Indeed, monks, a lay follower endowed with these five qualities is deposited directly into heaven, just as he is.",
      "sinhala": "මහණෙනි, ධර්මයන් පසකින් යුක්ත වූ උපාසකයා, රැගෙන ගොස් තබන ලද්දාක් මෙන් නිරයෙහි උපදියි. කවර ධර්මයන් පසකින්ද යත්? ප\\u200d්‍රාණඝාතයෙහි යෙදෙයි, අදත්තාදානයෙහි යෙදෙයි, කාමයන්හි වරදවා හැසිරෙයි, මුසාවාදයෙන් යුක්ත වෙයි, සුරාමේරය මත්පැන් පානය කිරීමෙන් ප\\u200d්‍රමාදයට පත්ව සිටියි. මහණෙනි, යම් උපාසකයෙක් මේ ධර්මයන් පසින් යුක්ත වේද, ඔහු රැගෙන ගොස් තබන ලද්දාක් මෙන් නිරයෙහි උපදියි.\n\nමහණෙනි, ධර්මයන් පසකින් යුක්ත වූ උපාසකයා, රැගෙන ගොස් තබන ලද්දාක් මෙන් ස්වර්ගයෙහි උපදියි. කවර ධර්මයන් පසකින්ද යත්? ප\\u200d්‍රාණඝාතයෙන් වෙන්ව සිටියි, අදත්තාදානයෙන් වෙන්ව සිටියි, කාමයන්හි වරදවා හැසිරීමෙන් වෙන්ව සිටියි, මුසාවාදයෙන් වෙන්ව සිටියි, සුරාමේරය මත්පැන් පානය කිරීමෙන් ප\\u200d්‍රමාදයට පත්වීමෙන් වෙන්ව සිටියි. මහණෙනි, යම් උපාසකයෙක් මේ ධර්මයන් පසින් යුක්ත වේද, ඔහු රැගෙන ගොස් තබන ලද්දාක් මෙන් ස්වර්ගයෙහි උපදියි.",
      "paliTitle": "Nirayasuttaṃ"
    },
    {
      "number": 174,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Pañca, gahapati, bhayāni verāni appahāya ‘dussīlo’ iti vuccati, nirayañca upapajjati. Katamāni pañca? Pāṇātipātaṃ, adinnādānaṃ, kāmesumicchācāraṃ, musāvādaṃ, surāmerayamajjapamādaṭṭhānaṃ – imāni kho, gahapati, pañca bhayāni verāni appahāya ‘dussīlo’ iti vuccati, nirayañca upapajjati. ‘‘Pañca, gahapati, bhayāni verāni pahāya ‘sīlavā’ iti vuccati, sugatiñca upapajjati. Katamāni pañca? Pāṇātipātaṃ, adinnādānaṃ, kāmesumicchācāraṃ, musāvādaṃ, surāmerayamajjapamādaṭṭhānaṃ – imāni kho, gahapati, pañca bhayāni verāni pahāya ‘sīlavā’ iti vuccati, sugatiñca upapajjati. ‘‘Yaṃ, gahapati, pāṇātipātī pāṇātipātapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, pāṇātipātā paṭivirato neva diṭṭhadhammikaṃ bhayaṃ veraṃ pasavati, na samparāyikaṃ bhayaṃ veraṃ pasavati, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pāṇātipātā paṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hoti. ‘‘Yaṃ, gahapati, adinnādāyī…pe…. ‘‘Yaṃ, gahapati, kāmesumicchācārī…pe…. ‘‘Yaṃ, gahapati, musāvādī…pe…. ‘‘Yaṃ, gahapati, surāmerayamajjapamādaṭṭhāyī surāmerayamajjapamādaṭṭhānapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, surāmerayamajjapamādaṭṭhānā paṭivirato neva diṭṭhadhammikaṃ bhayaṃ veraṃ pasavati, na samparāyikaṃ bhayaṃ veraṃ pasavati, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Surāmerayamajjapamādaṭṭhānā paṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hotī’’ti. ‘‘Yo pāṇamatipāteti, musāvādañca bhāsati; Loke adinnaṃ ādiyati, paradārañca gacchati; Surāmerayapānañca, yo naro anuyuñjati. ‘‘Appahāya pañca verāni, dussīlo iti vuccati; Kāyassa bhedā duppañño, nirayaṃ sopapajjati. ‘‘Yo pāṇaṃ nātipāteti, musāvādaṃ na bhāsati; Loke adinnaṃ nādiyati, paradāraṃ na gacchati; Surāmerayapānañca, yo naro nānuyuñjati. ‘‘Pahāya pañca verāni, sīlavā iti vuccati; Kāyassa bhedā sappañño, sugatiṃ sopapajjatī’’ti. catutthaṃ;",
      "english": "Then the householder Anāthapiṇḍika approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As the householder Anāthapiṇḍika sat to one side, the Blessed One said this to him:\n\n\"Householder, one who has not abandoned five dangers and enmities is called 'immoral' and is reborn in a state of woe. Which five? The destruction of life, taking what is not given, sexual misconduct, false speech, and intoxicating drinks and drugs that are a basis for heedlessness—these five dangers and enmities, householder, not having been abandoned, cause one to be called 'immoral' and to be reborn in a state of woe.\"\n\n\"Householder, one who has abandoned five dangers and enmities is called 'virtuous' and is reborn in a good destination. Which five? The destruction of life, taking what is not given, sexual misconduct, false speech, and intoxicating drinks and drugs that are a basis for heedlessness—these five dangers and enmities, householder, having been abandoned, cause one to be called 'virtuous' and to be reborn in a good destination.\"\n\n\"Householder, whoever destroys life, due to the destruction of life, generates danger and enmity even in this present life, generates danger and enmity even in future lives, and experiences mental suffering and dejection. One abstaining from the destruction of life generates neither danger nor enmity in this present life, nor danger nor enmity in future lives, nor experiences mental suffering or dejection. For one abstaining from the destruction of life, that danger and enmity are thus quelled.\n\n\"Householder, whoever takes what is not given, due to taking what is not given, generates danger and enmity even in this present life, generates danger and enmity even in future lives, and experiences mental suffering and dejection. One abstaining from taking what is not given generates neither danger nor enmity in this present life, nor danger nor enmity in future lives, nor experiences mental suffering or dejection. For one abstaining from taking what is not given, that danger and enmity are thus quelled.\n\n\"Householder, whoever engages in sexual misconduct, due to sexual misconduct, generates danger and enmity even in this present life, generates danger and enmity even in future lives, and experiences mental suffering and dejection. One abstaining from sexual misconduct generates neither danger nor enmity in this present life, nor danger nor enmity in future lives, nor experiences mental suffering or dejection. For one abstaining from sexual misconduct, that danger and enmity are thus quelled.\n\n\"Householder, whoever engages in false speech, due to false speech, generates danger and enmity even in this present life, generates danger and enmity even in future lives, and experiences mental suffering and dejection. One abstaining from false speech generates neither danger nor enmity in this present life, nor danger nor enmity in future lives, nor experiences mental suffering or dejection. For one abstaining from false speech, that danger and enmity are thus quelled.\n\n\"Householder, whoever partakes of intoxicating drinks and drugs that are a basis for heedlessness, due to partaking of intoxicating drinks and drugs that are a basis for heedlessness, generates danger and enmity even in this present life, generates danger and enmity even in future lives, and experiences mental suffering and dejection. One abstaining from intoxicating drinks and drugs that are a basis for heedlessness generates neither danger nor enmity in this present life, nor danger nor enmity in future lives, nor experiences mental suffering or dejection. For one abstaining from intoxicating drinks and drugs that are a basis for heedlessness, that danger and enmity are thus quelled.\"\n\nWhoever destroys life and speaks false speech,\nTakes what is not given in the world and engages with another's spouse,\nAnd that person who indulges in intoxicating drinks and drugs:\nNot having abandoned these five enmities, is called immoral;\nBeing unwise, upon the breaking up of the body, that one is reborn in a state of woe.\n\nWhoever does not destroy life and does not speak false speech,\nDoes not take what is not given in the world and does not engage with another's spouse,\nAnd that person who does not indulge in intoxicating drinks and drugs:\nHaving abandoned these five enmities, is called virtuous;\nBeing wise, upon the breaking up of the body, that one is reborn in a good destination.",
      "sinhala": "ඉක්බිති අනේපිඬු සිටුතුමා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි අනේපිඬු සිටුතුමාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ගෘහපති, පස් වැදෑරුම් භය සහ වෛරයන් අත් නොහැරීම නිසා ‘දුස්සීල’ යැයි කියනු ලැබේ. තවද, නිරයටද උපදියි. ඒ පස කුමක්ද? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි වරදවා හැසිරීම, මුසාවාදය, මත්පැන් පානය මූලික කොට ඇති ප්‍රමාදයට හේතුවන දෑය. ගෘහපති, මෙන්න මේ පස් වැදෑරුම් භය සහ වෛරයන් අත් නොහැරීම නිසා ‘දුස්සීල’ යැයි කියනු ලැබේ. තවද, නිරයටද උපදියි.”\n\n“ගෘහපති, පස් වැදෑරුම් භය සහ වෛරයන් අත්හැරීම නිසා ‘සීලවන්ත’ යැයි කියනු ලැබේ. තවද, සුගතියකද උපදියි. ඒ පස කුමක්ද? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි වරදවා හැසිරීම, මුසාවාදය, මත්පැන් පානය මූලික කොට ඇති ප්‍රමාදයට හේතුවන දෑය. ගෘහපති, මෙන්න මේ පස් වැදෑරුම් භය සහ වෛරයන් අත්හැරීම නිසා ‘සීලවන්ත’ යැයි කියනු ලැබේ. තවද, සුගතියකද උපදියි.”\n\n“ගෘහපති, යම් පුද්ගලයෙක් ප්‍රාණඝාතය කරන්නේද, ඒ ප්‍රාණඝාතය නිසා මේ ආත්මයෙහිද භය හා වෛරය උපදවා ගනියි, පරලොවදීද භය හා වෛරය උපදවා ගනියි, මානසික දුක් දොම්නස් විඳියි. ප්‍රාණඝාතයෙන් වෙන් වූ තැනැත්තා මේ ආත්මයෙහි භය හෝ වෛරය උපදවා නොගනියි, පරලොවදී භය හෝ වෛරය උපදවා නොගනියි, මානසික දුක් දොම්නස් විඳින්නේද නැත. ප්‍රාණඝාතයෙන් වෙන් වූ තැනැත්තාට ඒ භය හා වෛරය මේ අයුරින් සංසිඳී යයි.”\n\n“ගෘහපති, යම් පුද්ගලයෙක් අදත්තාදානය කරන්නේද, ඒ අදත්තාදානය නිසා මේ ආත්මයෙහිද භය හා වෛරය උපදවා ගනියි, පරලොවදීද භය හා වෛරය උපදවා ගනියි, මානසික දුක් දොම්නස් විඳියි. අදත්තාදානයෙන් වෙන් වූ තැනැත්තා මේ ආත්මයෙහි භය හෝ වෛරය උපදවා නොගනියි, පරලොවදී භය හෝ වෛරය උපදවා නොගනියි, මානසික දුක් දොම්නස් විඳින්නේද නැත. අදත්තාදානයෙන් වෙන් වූ තැනැත්තාට ඒ භය හා වෛරය මේ අයුරින් සංසිඳී යයි.”\n\n“ගෘහපති, යම් පුද්ගලයෙක් කාමයන්හි වරදවා හැසිරෙන්නේද, ඒ කාමයන්හි වරදවා හැසිරීම නිසා මේ ආත්මයෙහිද භය හා වෛරය උපදවා ගනියි, පරලොවදීද භය හා වෛරය උපදවා ගනියි, මානසික දුක් දොම්නස් විඳියි. කාමයන්හි වරදවා හැසිරීමෙන් වෙන් වූ තැනැත්තා මේ ආත්මයෙහි භය හෝ වෛරය උපදවා නොගනියි, පරලොවදී භය හෝ වෛරය උපදවා නොගනියි, මානසික දුක් දොම්නස් විඳින්නේද නැත. කාමයන්හි වරදවා හැසිරීමෙන් වෙන් වූ තැනැත්තාට ඒ භය හා වෛරය මේ අයුරින් සංසිඳී යයි.”\n\n“ගෘහපති, යම් පුද්ගලයෙක් මුසාවාදයේ යෙදෙන්නේද, ඒ මුසාවාදය නිසා මේ ආත්මයෙහිද භය හා වෛරය උපදවා ගනියි, පරලොවදීද භය හා වෛරය උපදවා ගනියි, මානසික දුක් දොම්නස් විඳියි. මුසාවාදයෙන් වෙන් වූ තැනැත්තා මේ ආත්මයෙහි භය හෝ වෛරය උපදවා නොගනියි, පරලොවදී භය හෝ වෛරය උපදවා නොගනියි, මානසික දුක් දොම්නස් විඳින්නේද නැත. මුසාවාදයෙන් වෙන් වූ තැනැත්තාට ඒ භය හා වෛරය මේ අයුරින් සංසිඳී යයි.”\n\n“ගෘහපති, යම් පුද්ගලයෙක් මත්පැන් පානය මූලික කොට ඇති ප්‍රමාදයට හේතුවන දෑෙහි යෙදෙන්නේද, ඒ මත්පැන් පානය මූලික කොට ඇති ප්‍රමාදයට හේතුවන දෑ නිසා මේ ආත්මයෙහිද භය හා වෛරය උපදවා ගනියි, පරලොවදීද භය හා වෛරය උපදවා ගනියි, මානසික දුක් දොම්නස් විඳියි. මත්පැන් පානය මූලික කොට ඇති ප්‍රමාදයට හේතුවන දෑවලින් වෙන් වූ තැනැත්තා මේ ආත්මයෙහි භය හෝ වෛරය උපදවා නොගනියි, පරලොවදී භය හෝ වෛරය උපදවා නොගනියි, මානසික දුක් දොම්නස් විඳින්නේද නැත. මත්පැන් පානය මූලික කොට ඇති ප්‍රමාදයට හේතුවන දෑවලින් වෙන් වූ තැනැත්තාට ඒ භය හා වෛරය මේ අයුරින් සංසිඳී යයි.”\n\n“යම් මිනිසෙක් සතුන් මරන්නේද, මුසාවාදයේ යෙදෙන්නේද, ලෝකයෙහි අනුන් සතු දේ හොරෙන් ගන්නේද, අනුන්ගේ භාර්යාවන් කෙරෙහි වරදවා හැසිරෙන්නේද, මත්පැන් පානයෙහි යෙදෙන්නේද,\n\nමෙසේ පස් වැදෑරුම් වෛරයන් අත් නොහළ හෙයින් ‘දුස්සීල’ යැයි කියනු ලැබේ. ප්‍රඥාවක් නැති ඒ පුද්ගලයා ශරීරය බිඳී මරණින් මතු අපායෙහි උපදියි.”\n\n“යම් මිනිසෙක් සතුන් නොමරන්නේද, මුසාවාදයේ නොයෙදෙන්නේද, ලෝකයෙහි අනුන් සතු දේ හොරෙන් නොගන්නේද, අනුන්ගේ භාර්යාවන් කෙරෙහි වරදවා නොහැසිරෙන්නේද, මත්පැන් පානයෙහි නොයෙදෙන්නේද,\n\nමෙසේ පස් වැදෑරුම් වෛරයන් අත්හළ හෙයින් ‘සීලවන්ත’ යැයි කියනු ලැබේ. ප්‍රඥාවන්ත ඒ පුද්ගලයා ශරීරය බිඳී මරණින් මතු සුගතියක උපදියි.”",
      "paliTitle": "Verasuttaṃ"
    },
    {
      "number": 175,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako upāsakacaṇḍālo ca hoti upāsakamalañca upāsakapatikuṭṭho ca [upāsakapatikiṭṭho ca (sī. syā. kaṃ. pī.)]. Katamehi pañcahi? Assaddho hoti; dussīlo hoti; kotūhalamaṅgaliko hoti, maṅgalaṃ pacceti no kammaṃ; ito ca bahiddhā dakkhiṇeyyaṃ gavesati; tattha ca pubbakāraṃ karoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako upāsakacaṇḍālo ca hoti upāsakamalañca upāsakapatikuṭṭho ca. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato upāsako upāsakaratanañca hoti upāsakapadumañca upāsakapuṇḍarīkañca [upāsakapuṇḍarīko ca (pī. ka.)]. Katamehi pañcahi? Saddho hoti; sīlavā hoti; akotūhalamaṅgaliko hoti, kammaṃ pacceti no maṅgalaṃ; na ito bahiddhā dakkhiṇeyyaṃ gavesati; idha ca pubbakāraṃ karoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato upāsako upāsakaratanañca hoti upāsakapadumañca upāsakapuṇḍarīkañcā’’ti. Pañcamaṃ.",
      "english": "Monks, a lay follower endowed with five qualities is an outcaste lay follower, a stain among lay followers, and a despicable lay follower. What are these five? He is faithless; he is immoral; he is devoted to curious observances of auspicious signs, trusting in auspicious signs rather than in kamma (action); he seeks worthy recipients of offerings outside this teaching; and he makes the first offering to them. Monks, a lay follower endowed with these five qualities is indeed an outcaste lay follower, a stain among lay followers, and a despicable lay follower.\n\nMonks, a lay follower endowed with five qualities is a jewel among lay followers, a lotus among lay followers, and a white lotus among lay followers. What are these five? He is faithful; he is virtuous; he is not devoted to curious observances of auspicious signs, trusting in kamma (action) rather than in auspicious signs; he does not seek worthy recipients of offerings outside this teaching; and he makes the first offering here (within this teaching). Monks, a lay follower endowed with these five qualities is indeed a jewel among lay followers, a lotus among lay followers, and a white lotus among lay followers.",
      "sinhala": "මහණෙනි, ධ​ර්මයන් පසකින් සමන්වාගත වූ උපාසකයා, උපාසක චණ්ඩාලයෙක් ද වේ, උපාසක මලයක් ද වේ, උපාසක ප්‍රතිකුෂ්ටයෙක් ද වේ. කවර පසකින් ද? ඔහු අශ්‍ර​ද්ධාවන්ත වේ; දුශ්ශීල වේ; කුතුහලයෙන් මංගල්‍යයන් සොයන සුලු වේ, මංගල්‍යයන් විශ්වාස කරයි, කර්මය නොවේ; මෙම ශාසනයෙන් බැහැර දක්ෂිණාවට සුදුසු අය සොයයි; එහිදී ප්‍ර​ථමයෙන් පුද පවත්වයි. මහණෙනි, ධ​ර්මයන් මේ පසින් සමන්වාගත වූ උපාසකයා, උපාසක චණ්ඩාලයෙක් ද වේ, උපාසක මලයක් ද වේ, උපාසක ප්‍රතිකුෂ්ටයෙක් ද වේ.\n\nමහණෙනි, ධ​ර්මයන් පසකින් සමන්වාගත වූ උපාසකයා, උපාසක රත්නයක් ද වේ, උපාසක පද්මයක් ද වේ, උපාසක පුණ්ඩරීකයක් ද වේ. කවර පසකින් ද? ඔහු ශ්‍ර​ද්ධාවන්ත වේ; සිල්වත් වේ; කුතුහලයෙන් මංගල්‍යයන් නොසොයන සුලු වේ, කර්මය විශ්වාස කරයි, මංගල්‍යයන් නොවේ; මෙම ශාසනයෙන් බැහැර දක්ෂිණාවට සුදුසු අය නොසොයයි; මෙහිදී ප්‍ර​ථමයෙන් පුද පවත්වයි. මහණෙනි, ධ​ර්මයන් මේ පසින් සමන්වාගත වූ උපාසකයා, උපාසක රත්නයක් ද වේ, උපාසක පද්මයක් ද වේ, උපාසක පුණ්ඩරීකයක් ද වේ.",
      "paliTitle": "Caṇḍālasuttaṃ"
    },
    {
      "number": 176,
      "pali": "Atha kho anāthapiṇḍiko gahapati pañcamattehi upāsakasatehi parivuto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Tumhe kho, gahapati, bhikkhusaṅghaṃ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Na kho, gahapati, tāvatakeneva tuṭṭhi karaṇīyā – ‘mayaṃ bhikkhusaṅghaṃ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārenā’ti. Tasmātiha, gahapati, evaṃ sikkhitabbaṃ – ‘kinti mayaṃ kālena kālaṃ pavivekaṃ pītiṃ upasampajja vihareyyāmā’ti! Evañhi vo, gahapati, sikkhitabba’’nti. Evaṃ vutte āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Yāva subhāsitaṃ cidaṃ, bhante, bhagavatā – ‘tumhe kho, gahapati, bhikkhusaṅghaṃ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Na kho, gahapati, tāvatakeneva tuṭṭhi karaṇīyā – mayaṃ bhikkhusaṅghaṃ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārenāti. Tasmātiha, gahapati, evaṃ sikkhitabbaṃ – kinti mayaṃ kālena kālaṃ pavivekaṃ pītiṃ upasampajja vihareyyāmāti! Evañhi vo, gahapati, sikkhitabba’nti. Yasmiṃ, bhante, samaye ariyasāvako pavivekaṃ pītiṃ upasampajja viharati, pañcassa ṭhānāni tasmiṃ samaye na honti. Yampissa kāmūpasaṃhitaṃ dukkhaṃ domanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa kāmūpasaṃhitaṃ sukhaṃ somanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa akusalūpasaṃhitaṃ dukkhaṃ domanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa akusalūpasaṃhitaṃ sukhaṃ somanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa kusalūpasaṃhitaṃ dukkhaṃ domanassaṃ, tampissa tasmiṃ samaye na hoti. Yasmiṃ, bhante, samaye ariyasāvako pavivekaṃ pītiṃ upasampajja viharati, imānissa pañca [imāni pañcassa (syā. kaṃ.)] ṭhānāni tasmiṃ samaye na hontī’’ti. ‘‘Sādhu sādhu, sāriputta! Yasmiṃ, sāriputta, samaye ariyasāvako pavivekaṃ pītiṃ upasampajja viharati, pañcassa ṭhānāni tasmiṃ samaye na honti. Yampissa kāmūpasaṃhitaṃ dukkhaṃ domanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa kāmūpasaṃhitaṃ sukhaṃ somanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa akusalūpasaṃhitaṃ dukkhaṃ domanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa akusalūpasaṃhitaṃ sukhaṃ somanassaṃ, tampissa tasmiṃ samaye na hoti. Yampissa kusalūpasaṃhitaṃ dukkhaṃ domanassaṃ, tampissa tasmiṃ samaye na hoti. Yasmiṃ, sāriputta, samaye ariyasāvako pavivekaṃ pītiṃ upasampajja viharati, imānissa [imānettha (sī.)] pañca ṭhānāni tasmiṃ samaye na hontī’’ti. Chaṭṭhaṃ.",
      "english": "Then the householder Anathapindika, surrounded by about five hundred lay followers, approached where the Blessed One was. Having approached, he greeted the Blessed One and sat down to one side.\n\nTo the householder Anathapindika, who was sitting to one side, the Blessed One said this: \"Indeed, householder, you provide the monastic community with robes, almsfood, dwellings, and medicines for the sick. However, householder, contentment should not be found in that alone, thinking, 'We provide the monastic community with robes, almsfood, dwellings, and medicines for the sick.' Therefore, householder, you should train yourselves thus: 'How can we, from time to time, enter and dwell in secluded joy?' This is how you should train yourselves, householder.\"\n\nWhen this was said, Venerable Sariputta said to the Blessed One: \"Wonderful, Blessed One! Amazing, Blessed One! How well spoken this is by the Blessed One: 'Indeed, householder, you provide the monastic community with robes, almsfood, dwellings, and medicines for the sick. However, householder, contentment should not be found in that alone, thinking, \"We provide the monastic community with robes, almsfood, dwellings, and medicines for the sick.\" Therefore, householder, you should train yourselves thus: \"How can we, from time to time, enter and dwell in secluded joy?\" This is how you should train yourselves, householder.' Blessed One, at whatever time a noble disciple enters and dwells in secluded joy, five states do not exist for them at that time. Whatever suffering and displeasure is associated with sensuality, that does not exist for them at that time. Whatever happiness and joy is associated with sensuality, that does not exist for them at that time. Whatever suffering and displeasure is associated with unwholesome states, that does not exist for them at that time. Whatever happiness and joy is associated with unwholesome states, that does not exist for them at that time. Whatever suffering and displeasure is associated with wholesome states, that does not exist for them at that time. Blessed One, at whatever time a noble disciple enters and dwells in secluded joy, these five states do not exist for them at that time.\"\n\n\"Excellent, excellent, Sariputta! Sariputta, at whatever time a noble disciple enters and dwells in secluded joy, five states do not exist for them at that time. Whatever suffering and displeasure is associated with sensuality, that does not exist for them at that time. Whatever happiness and joy is associated with sensuality, that does not exist for them at that time. Whatever suffering and displeasure is associated with unwholesome states, that does not exist for them at that time. Whatever happiness and joy is associated with unwholesome states, that does not exist for them at that time. Whatever suffering and displeasure is associated with wholesome states, that does not exist for them at that time. Sariputta, at whatever time a noble disciple enters and dwells in secluded joy, these five states do not exist for them at that time.\"",
      "sinhala": "ඉක්බිති අනේපිඬු සිටුතුමා පන්සියයක් පමණ වූ උපාසකවරුන් පිරිවරාගෙන භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි අනේපිඬු සිටුතුමාට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක – ‘‘සිටුතුමනි, ඔබලා චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර යන මෙයින් භික්ෂුසංඝයාට උපස්ථාන කර සිටින්නෝය. සිටුතුමනි, ‘අපි භික්ෂුසංඝයාට චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර යන මෙයින් උපස්ථාන කරන්නෙමු’ කියා ඒ පමණකින්ම සතුටු නොවිය යුතුය. එහෙයින් සිටුතුමනි, ‘අපි කෙසේ නම් කලින් කලට විවේකයෙන් හටගන්නා ප්‍රීතිය උපදවාගෙන වාසය කරන්නෙමු ද?’ කියා මෙසේ ඔබලා විසින් හික්මිය යුතුය. සිටුතුමනි, ඔබලා විසින් මෙසේ හික්මිය යුතුය.’’\n\nමෙසේ වදාළ කල්හි ආයුෂ්මත් සාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක – ‘‘වහන්ස, ආශ්චර්යයකි, වහන්ස, පුදුමයකි! වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මෙය කොතරම් මැනවින් දේශනා කරන ලද්දක්ද – ‘සිටුතුමනි, ඔබලා චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර යන මෙයින් භික්ෂුසංඝයාට උපස්ථාන කර සිටින්නෝය. සිටුතුමනි, ‘අපි භික්ෂුසංඝයාට චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර යන මෙයින් උපස්ථාන කරන්නෙමු’ කියා ඒ පමණකින්ම සතුටු නොවිය යුතුය. එහෙයින් සිටුතුමනි, ‘අපි කෙසේ නම් කලින් කලට විවේකයෙන් හටගන්නා ප්‍රීතිය උපදවාගෙන වාසය කරන්නෙමු ද?’ කියා මෙසේ ඔබලා විසින් හික්මිය යුතුය. සිටුතුමනි, ඔබලා විසින් මෙසේ හික්මිය යුතුය.’’ වහන්ස, යම් සමයෙක ආර්යශ්‍රාවකයා විවේකයෙන් හටගන්නා ප්‍රීතිය උපදවාගෙන වාසය කරයිද, ඒ සමයෙහි ඔහුගේ කරුණු පහක් පහළ නොවන්නේය. යම් කාමයන් හා බැඳුණු දුකක් හා දොම්නසක් ඔහුට වේද, ඒ දුක හා දොම්නස ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් කාමයන් හා බැඳුණු සැපක් හා සෝමනස්සයක් ඔහුට වේද, ඒ සැප හා සෝමනස්සය ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් අකුසල් හා බැඳුණු දුකක් හා දොම්නසක් ඔහුට වේද, ඒ දුක හා දොම්නස ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් අකුසල් හා බැඳුණු සැපක් හා සෝමනස්සයක් ඔහුට වේද, ඒ සැප හා සෝමනස්සය ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් කුසල් හා බැඳුණු දුකක් හා දොම්නසක් ඔහුට වේද, ඒ දුක හා දොම්නස ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. වහන්ස, යම් සමයෙක ආර්යශ්‍රාවකයා විවේකයෙන් හටගන්නා ප්‍රීතිය උපදවාගෙන වාසය කරයිද, ඒ සමයෙහි ඔහුගේ මේ කරුණු පහ පහළ නොවන්නේය.\n\n‘‘සාදු සාදු, සාරිපුත්ත! සාරිපුත්ත, යම් සමයෙක ආර්යශ්‍රාවකයා විවේකයෙන් හටගන්නා ප්‍රීතිය උපදවාගෙන වාසය කරයිද, ඒ සමයෙහි ඔහුගේ කරුණු පහක් පහළ නොවන්නේය. යම් කාමයන් හා බැඳුණු දුකක් හා දොම්නසක් ඔහුට වේද, ඒ දුක හා දොම්නස ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් කාමයන් හා බැඳුණු සැපක් හා සෝමනස්සයක් ඔහුට වේද, ඒ සැප හා සෝමනස්සය ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් අකුසල් හා බැඳුණු දුකක් හා දොම්නසක් ඔහුට වේද, ඒ දුක හා දොම්නස ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් අකුසල් හා බැඳුණු සැපක් හා සෝමනස්සයක් ඔහුට වේද, ඒ සැප හා සෝමනස්සය ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. යම් කුසල් හා බැඳුණු දුකක් හා දොම්නසක් ඔහුට වේද, ඒ දුක හා දොම්නස ඒ සමයෙහි ඔහුට පහළ නොවන්නේය. සාරිපුත්ත, යම් සමයෙක ආර්යශ්‍රාවකයා විවේකයෙන් හටගන්නා ප්‍රීතිය උපදවාගෙන වාසය කරයිද, ඒ සමයෙහි ඔහුගේ මේ කරුණු පහ පහළ නොවන්නේය.’’",
      "paliTitle": "Pītisuttaṃ"
    },
    {
      "number": 177,
      "pali": "‘‘Pañcimā, bhikkhave, vaṇijjā upāsakena akaraṇīyā. Katamā pañca? Satthavaṇijjā, sattavaṇijjā, maṃsavaṇijjā, majjavaṇijjā, visavaṇijjā – imā kho, bhikkhave, pañca vaṇijjā upāsakena akaraṇīyā’’ti. Sattamaṃ.",
      "english": "Monastics, these five trades ought not to be engaged in by a lay follower. Which five? Trade in weapons, trade in living beings, trade in meat, trade in intoxicants, and trade in poisons – indeed, monastics, these five trades ought not to be engaged in by a lay follower.",
      "sinhala": "මහණෙනි, උපාසකවරයෙකු විසින් නොකළ යුතු වෙළෙඳාම් පහක් ඇත්තේය. ඒ පහ කවරේද? ආයුධ වෙළෙඳාම, සත්ත්ව වෙළෙඳාම, මස් වෙළෙඳාම, මත්ද්‍රව්‍ය වෙළෙඳාම, විෂ වෙළෙඳාම යන මේ වෙළෙඳාම් පහයි. මහණෙනි, සැබවින්ම මේ වෙළෙඳාම් පස උපාසකවරයෙකු විසින් නොකළ යුත්තාහ.",
      "paliTitle": "Vaṇijjāsuttaṃ"
    },
    {
      "number": 178,
      "pali": "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘ayaṃ puriso pāṇātipātaṃ pahāya pāṇātipātā paṭiviratoti [paṭivirato hotīti (sī.), paṭivirato hoti (syā. kaṃ. pī.)]. Tamenaṃ rājāno gahetvā pāṇātipātā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘ayaṃ puriso pāṇātipātaṃ pahāya pāṇātipātā paṭiviratoti. Tamenaṃ rājāno gahetvā pāṇātipātā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’ti. Api ca, khvassa tatheva pāpakammaṃ pavedenti [tatheva pāpakaṃ kammaṃ pavedayanti (sī.), tadeva pāpakammaṃ pavedeti (syā. kaṃ.)] – ‘ayaṃ puriso itthiṃ vā purisaṃ vā jīvitā voropesīti [voropetīti (syā. kaṃ.)]. Tamenaṃ rājāno gahetvā pāṇātipātahetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karonti. Api nu tumhehi evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati [sūyissati (sī. pī.)] cā’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘ayaṃ puriso adinnādānaṃ pahāya adinnādānā paṭiviratoti. Tamenaṃ rājāno gahetvā adinnādānā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’’’ti? ‘‘No hetaṃ bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘ayaṃ puriso adinnādānaṃ pahāya adinnādānā paṭiviratoti. Tamenaṃ rājāno gahetvā adinnādānā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’ti. Api ca khvassa tatheva pāpakammaṃ pavedenti – ‘ayaṃ puriso gāmā vā araññā vā adinnaṃ theyyasaṅkhātaṃ ādiyīti [ādiyati (syā. kaṃ.)]. Tamenaṃ rājāno gahetvā adinnādānahetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karonti. Api nu tumhehi evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘ayaṃ puriso kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭiviratoti. Tamenaṃ rājāno gahetvā kāmesumicchācārā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘ayaṃ puriso kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭiviratoti. Tamenaṃ rājāno gahetvā kāmesumicchācārā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’ti. Api ca khvassa tatheva pāpakammaṃ pavedenti – ‘ayaṃ puriso paritthīsu parakumārīsu cārittaṃ āpajjīti [āpajjati (syā. kaṃ.)]. Tamenaṃ rājāno gahetvā kāmesumicchācārahetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karonti. Api nu tumhehi evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘ayaṃ puriso musāvādaṃ pahāya musāvādā paṭiviratoti. Tamenaṃ rājāno gahetvā musāvādā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘ayaṃ puriso musāvādaṃ pahāya musāvādā paṭiviratoti. Tamenaṃ rājāno gahetvā musāvādā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’ti. Api ca khvassa tatheva pāpakammaṃ pavedenti – ‘ayaṃ puriso gahapatissa vā gahapatiputtassa vā musāvādena atthaṃ pabhañjīti [bhañjatīti (sī.), bhañjati (syā. kaṃ.), bhañjīti (pī.)]. Tamenaṃ rājāno gahetvā musāvādahetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karonti. Api nu tumhehi evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘ayaṃ puriso surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭiviratoti. Tamenaṃ rājāno gahetvā surāmerayamajjapamādaṭṭhānā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘ayaṃ puriso surāmerayamajjapamādaṭṭhānaṃ pahāya surāmerayamajjapamādaṭṭhānā paṭiviratoti. Tamenaṃ rājāno gahetvā surāmerayamajjapamādaṭṭhānā veramaṇihetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karontī’ti. Api ca khvassa tatheva pāpakammaṃ pavedenti – ‘ayaṃ puriso surāmerayamajjapamādaṭṭhānaṃ anuyutto itthiṃ vā purisaṃ vā jīvitā voropesi [voropeti (syā.)]; ayaṃ puriso surāmerayamajjapamādaṭṭhānaṃ anuyutto gāmā vā araññā vā adinnaṃ theyyasaṅkhātaṃ ādiyi [ādiyati (sī. syā.)]; ayaṃ puriso surāmerayamajjapamādaṭṭhānaṃ anuyutto paritthīsu parakumārīsu cārittaṃ āpajji [āpajjati (sī. syā.)]; ayaṃ puriso surāmerayamajjapamādaṭṭhānaṃ anuyutto gahapatissa vā gahapatiputtassa vā musāvādena atthaṃ pabhañjīti. Tamenaṃ rājāno gahetvā surāmerayamajjapamādaṭṭhānahetu hananti vā bandhanti vā pabbājenti vā yathāpaccayaṃ vā karonti. Api nu tumhehi evarūpaṃ diṭṭhaṃ vā sutaṃ vā’’’ti? ‘‘Diṭṭhañca no, bhante, sutañca suyyissati cā’’ti. Aṭṭhamaṃ.",
      "english": "‘‘What do you think, bhikkhus? Have you seen or heard of this: ‘This man, having abandoned the taking of life, abstains from the taking of life. And then kings, because of his abstinence from the taking of life, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit’?” “No, Venerable Sir.” “Good, bhikkhus! I, too, bhikkhus, have neither seen nor heard of this: ‘This man, having abandoned the taking of life, abstains from the taking of life. And then kings, because of his abstinence from the taking of life, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit.’ But rather, they declare his evil deed thus: ‘This man deprived a woman or a man of life.’ Then kings, because of his taking of life, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit. Have you, bhikkhus, seen or heard of such a thing?” “We have seen it, Venerable Sir, and we have heard it, and we shall hear it again.”\n\n‘‘What do you think, bhikkhus? Have you seen or heard of this: ‘This man, having abandoned taking what is not given, abstains from taking what is not given. And then kings, because of his abstinence from taking what is not given, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit’?” “No, Venerable Sir.” “Good, bhikkhus! I, too, bhikkhus, have neither seen nor heard of this: ‘This man, having abandoned taking what is not given, abstains from taking what is not given. And then kings, because of his abstinence from taking what is not given, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit.’ But rather, they declare his evil deed thus: ‘This man, from a village or a forest, took what was not given, amounting to theft.’ Then kings, because of his taking what is not given, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit. Have you, bhikkhus, seen or heard of such a thing?” “We have seen it, Venerable Sir, and we have heard it, and we shall hear it again.”\n\n‘‘What do you think, bhikkhus? Have you seen or heard of this: ‘This man, having abandoned sexual misconduct, abstains from sexual misconduct. And then kings, because of his abstinence from sexual misconduct, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit’?” “No, Venerable Sir.” “Good, bhikkhus! I, too, bhikkhus, have neither seen nor heard of this: ‘This man, having abandoned sexual misconduct, abstains from sexual misconduct. And then kings, because of his abstinence from sexual misconduct, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit.’ But rather, they declare his evil deed thus: ‘This man engaged in misconduct with others’ wives or others’ maidens.’ Then kings, because of his sexual misconduct, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit. Have you, bhikkhus, seen or heard of such a thing?” “We have seen it, Venerable Sir, and we have heard it, and we shall hear it again.”\n\n‘‘What do you think, bhikkhus? Have you seen or heard of this: ‘This man, having abandoned false speech, abstains from false speech. And then kings, because of his abstinence from false speech, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit’?” “No, Venerable Sir.” “Good, bhikkhus! I, too, bhikkhus, have neither seen nor heard of this: ‘This man, having abandoned false speech, abstains from false speech. And then kings, because of his abstinence from false speech, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit.’ But rather, they declare his evil deed thus: ‘This man, by false speech, brought ruin to the affairs of a householder or a householder’s son.’ Then kings, because of his false speech, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit. Have you, bhikkhus, seen or heard of such a thing?” “We have seen it, Venerable Sir, and we have heard it, and we shall hear it again.”\n\n‘‘What do you think, bhikkhus? Have you seen or heard of this: ‘This man, having abandoned alcoholic drinks and intoxicants, which are the basis for heedlessness, abstains from alcoholic drinks and intoxicants, which are the basis for heedlessness. And then kings, because of his abstinence from alcoholic drinks and intoxicants, which are the basis for heedlessness, arrest him and execute him, or imprison him, or banish him, or do with him as they deem fit’?” “No, Venerable Sir.” “Good, bhikkhus!\n\nIndeed, monks, I have neither seen nor heard of such a thing: 'This person, having abandoned the indulgence in intoxicating drinks and drugs that cause heedlessness, abstains from such indulgence.' And then kings, having seized him, on account of his abstaining from the indulgence in intoxicating drinks and drugs that cause heedlessness, either kill him, or imprison him, or banish him, or deal with him according to what is appropriate. Rather, they declare his evil deed thus: 'This person, addicted to the indulgence in intoxicating drinks and drugs that cause heedlessness, has deprived a woman or a man of life; this person, addicted to the indulgence in intoxicating drinks and drugs that cause heedlessness, has taken what was not given, whether from a village or from the forest, which is reckoned as theft; this person, addicted to the indulgence in intoxicating drinks and drugs that cause heedlessness, has engaged in improper conduct with other men's wives or other men's daughters; this person, addicted to the indulgence in intoxicating drinks and drugs that cause heedlessness, has ruined the prosperity of a householder or a householder's son through false speech.' And then kings, having seized him, on account of his indulgence in intoxicating drinks and drugs that cause heedlessness, either kill him, or imprison him, or banish him, or deal with him according to what is appropriate. Have you, then, monks, seen or heard such a thing?\" \"Indeed, venerable sir, we have seen it, we have heard it, and we shall continue to hear it.\"",
      "sinhala": "භික්ෂූනි, මේ පිළිබඳව ඔබලා කුමක් සිතන්නහුද? ‘මෙම පුද්ගලයා ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, ප්‍රාණඝාතයෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා ඔබලා විසින් දැක තිබේද, නැතහොත් අසා තිබේද?\n\nනැත, භාග්‍යවතුන් වහන්ස. භික්ෂූනි, සාධු! භික්ෂූනි, මා විසින්ද මෙය දැක නැත, අසාද නැත – ‘මෙම පුද්ගලයා ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, ප්‍රාණඝාතයෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා. එහෙත් ඔහුව නපුරු ක්‍රියාවටම චෝදනා කරන්නේ මෙසේය – ‘මෙම පුද්ගලයා ස්ත්‍රියක හෝ පුරුෂයකු හෝ ජීවිතයෙන් තොර කළේය’ කියා. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, ප්‍රාණඝාතය හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති. ඔබලා විසින් මෙවැනි දෙයක් දැක තිබේද, නැතහොත් අසා තිබේද? භාග්‍යවතුන් වහන්ස, අප විසින් දැක තිබේ, අසාද තිබේ, අසන්නටද ලැබේ.\n\nභික්ෂූනි, මේ පිළිබඳව ඔබලා කුමක් සිතන්නහුද? ‘මෙම පුද්ගලයා අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, අදත්තාදානයෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා ඔබලා විසින් දැක තිබේද, නැතහොත් අසා තිබේද? නැත, භාග්‍යවතුන් වහන්ස. භික්ෂූනි, සාධු! භික්ෂූනි, මා විසින්ද මෙය දැක නැත, අසාද නැත – ‘මෙම පුද්ගලයා අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, අදත්තාදානයෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා. එහෙත් ඔහුව නපුරු ක්‍රියාවටම චෝදනා කරන්නේ මෙසේය – ‘මෙම පුද්ගලයා ගමකින් හෝ ආරණ්‍යයකින් හෝ නොදෙන ලද දෙයක් සොරකම් ලෙස ගත්තේය’ කියා. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, අදත්තාදානය හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති. ඔබලා විසින් මෙවැනි දෙයක් දැක තිබේද, නැතහොත් අසා තිබේද? භාග්‍යවතුන් වහන්ස, අප විසින් දැක තිබේ, අසාද තිබේ, අසන්නටද ලැබේ.\n\nභික්ෂූනි, මේ පිළිබඳව ඔබලා කුමක් සිතන්නහුද? ‘මෙම පුද්ගලයා කාමයන්හි වරදවා හැසිරීම අත්හැර, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා ඔබලා විසින් දැක තිබේද, නැතහොත් අසා තිබේද? නැත, භාග්‍යවතුන් වහන්ස. භික්ෂූනි, සාධු! භික්ෂූනි, මා විසින්ද මෙය දැක නැත, අසාද නැත – ‘මෙම පුද්ගලයා කාමයන්හි වරදවා හැසිරීම අත්හැර, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා. එහෙත් ඔහුව නපුරු ක්‍රියාවටම චෝදනා කරන්නේ මෙසේය – ‘මෙම පුද්ගලයා අනුන්ගේ භාර්යාවන් හා අනුන්ගේ කන්‍යාවන් සමඟ වරදවා හැසිරුණේය’ කියා. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, කාමයන්හි වරදවා හැසිරීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති. ඔබලා විසින් මෙවැනි දෙයක් දැක තිබේද, නැතහොත් අසා තිබේද? භාග්‍යවතුන් වහන්ස, අප විසින් දැක තිබේ, අසාද තිබේ, අසන්නටද ලැබේ.\n\nභික්ෂූනි, මේ පිළිබඳව ඔබලා කුමක් සිතන්නහුද? ‘මෙම පුද්ගලයා මුසාවාදය අත්හැර, මුසාවාදයෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, මුසාවාදයෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා ඔබලා විසින් දැක තිබේද, නැතහොත් අසා තිබේද? නැත, භාග්‍යවතුන් වහන්ස. භික්ෂූනි, සාධු! භික්ෂූනි, මා විසින්ද මෙය දැක නැත, අසාද නැත – ‘මෙම පුද්ගලයා මුසාවාදය අත්හැර, මුසාවාදයෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, මුසාවාදයෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා. එහෙත් ඔහුව නපුරු ක්‍රියාවටම චෝදනා කරන්නේ මෙසේය – ‘මෙම පුද්ගලයා ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ මුසාවාදයෙන් විනාශයක් සිදුකළේය’ කියා. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, මුසාවාදය හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති. ඔබලා විසින් මෙවැනි දෙයක් දැක තිබේද, නැතහොත් අසා තිබේද? භාග්‍යවතුන් වහන්ස, අප විසින් දැක තිබේ, අසාද තිබේ, අසන්නටද ලැබේ.\n\nභික්ෂූනි, මේ පිළිබඳව ඔබලා කුමක් සිතන්නහුද? ‘මෙම පුද්ගලයා සුරා-මේරය මත්පැන් පානයෙන් සිහි විකල් වන ක්‍රියාව අත්හැර, සුරා-මේරය මත්පැන් පානයෙන් සිහි විකල් වන ක්‍රියාවෙන් වැළකී සිටියේය. රාජ්‍ය පාලකයෝ ඔහුව අල්ලාගෙන, සුරා-මේරය මත්පැන් පානයෙන් සිහි විකල් වන ක්‍රියාවෙන් වැළකී සිටීම හේතුකොටගෙන මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ අන්‍ය අයුරකින් දඬුවම් කරති’ කියා ඔබලා විසින් දැක තිබේද, නැතහොත් අසා තිබේද? නැත, භාග්‍යවතුන් වහන්ස. භික්ෂූනි, සාධු!\n\nභික්‍ෂූනි, මේ කාරණය ම විසින් නම් නොදක්නා ලදී, නොඅසන ලදී: යම්කිසි පුරුෂයෙක් මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදය අත්හැර, මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදයෙන් වැළකී සිටිනු ඇත. එවැනි පුරුෂයා රජවරු අල්ලාගෙන, මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදයෙන් වැළකීමේ හේතුවෙන් ඔහුව මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ ඔවුනට අවශ්‍ය පරිදි කටයුතු කරති යන කාරණයයි. එහෙත්, ඔවුහු ඔහුගේ පවිටු ක්‍රියා මෙසේ ප්‍රකාශ කරති: ‘මේ පුරුෂයා මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදයෙහි ඇලී සිට, ස්ත්‍රියක් හෝ පුරුෂයකු හෝ දිවි තොර කළේය. මේ පුරුෂයා මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදයෙහි ඇලී සිට, ගමකින් හෝ අරණ්‍යයකින් හෝ නොදෙන ලද වස්තුව, සොරකමක් ලෙස සලකා ගත්තේය. මේ පුරුෂයා මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදයෙහි ඇලී සිට, අනුන්ගේ භාර්යාවන් හෝ අනුන්ගේ කන්‍යාවන් සමඟ දුශ්චරිතයට පැමිණියේය. මේ පුරුෂයා මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදයෙහි ඇලී සිට, ගෘහපතියකුට හෝ ගෘහපති පුත්‍රයකුට හෝ බොරු කීමෙන් ඔවුන්ගේ සම්පත් විනාශ කළේය.’ එවැනි පුරුෂයා රජවරු අල්ලාගෙන, මත්පැන් පානය හේතුවෙන් වන ප්‍රමාදය නිසා මරති, හෝ බඳිති, හෝ පිටුවහල් කරති, හෝ ඔවුනට අවශ්‍ය පරිදි කටයුතු කරති. නුඹලා විසින් ද මෙවැනි දෙයක් දැක තිබේද, හෝ අසා තිබේද? “ස්වාමීන් වහන්ස, අප විසින් දැක තිබේ, අසා තිබේ, අසන්නට ද ලැබෙනු ඇත.”",
      "paliTitle": "Rājāsuttaṃ"
    },
    {
      "number": 179,
      "pali": "Atha kho anāthapiṇḍiko gahapati pañcamattehi upāsakasatehi parivuto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Atha kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘yaṃ kañci [yaṃ kiñci (sī. pī.)], sāriputta, jāneyyātha gihiṃ odātavasanaṃ pañcasu sikkhāpadesu saṃvutakammantaṃ catunnaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhiṃ akicchalābhiṃ akasiralābhiṃ, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’’’ti. ‘‘Katamesu pañcasu sikkhāpadesu saṃvutakammanto hoti? Idha, sāriputta, ariyasāvako pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Imesu pañcasu sikkhāpadesu saṃvutakammanto hoti. ‘‘Katamesaṃ catunnaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī? Idha, sāriputta, ariyasāvako buddhe aveccappasādena samannāgato hoti – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi, satthā devamanussānaṃ buddho bhagavā’ti. Ayamassa paṭhamo ābhicetasiko diṭṭhadhammasukhavihāro adhigato hoti avisuddhassa cittassa visuddhiyā apariyodātassa cittassa pariyodapanāya. ‘‘Puna caparaṃ, sāriputta, ariyasāvako dhamme aveccappasādena samannāgato hoti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Ayamassa dutiyo ābhicetasiko diṭṭhadhammasukhavihāro adhigato hoti avisuddhassa cittassa visuddhiyā apariyodātassa cittassa pariyodapanāya. ‘‘Puna caparaṃ, sāriputta, ariyasāvako saṅghe aveccappasādena samannāgato hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Ayamassa tatiyo ābhicetasiko diṭṭhadhammasukhavihāro adhigato hoti avisuddhassa cittassa visuddhiyā apariyodātassa cittassa pariyodapanāya. ‘‘Puna caparaṃ, sāriputta, ariyasāvako ariyakantehi sīlehi samannāgato hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. Ayamassa catuttho ābhicetasiko diṭṭhadhammasukhavihāro adhigato hoti avisuddhassa cittassa visuddhiyā apariyodātassa cittassa pariyodapanāya. Imesaṃ catunnaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. ‘‘Yaṃ kañci, sāriputta, jāneyyātha gihiṃ odātavasanaṃ – imesu pañcasu sikkhāpadesu saṃvutakammantaṃ, imesañca catunnaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhiṃ akicchalābhiṃ akasiralābhiṃ, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’’’ti. ‘‘Nirayesu bhayaṃ disvā, pāpāni parivajjaye; Ariyadhammaṃ samādāya, paṇḍito parivajjaye. ‘‘Na hiṃse pāṇabhūtāni, vijjamāne parakkame; Musā ca na bhaṇe jānaṃ, adinnaṃ na parāmase. ‘‘Sehi dārehi santuṭṭho, paradārañca ārame [nārame (sī. syā.)]; Merayaṃ vāruṇiṃ jantu, na pive cittamohaniṃ. ‘‘Anussareyya sambuddhaṃ, dhammañcānuvitakkaye; Abyāpajjaṃ [abyāpajjhaṃ (?) abyāpajjhaṃ (ka.)] hitaṃ cittaṃ, devalokāya bhāvaye. ‘‘Upaṭṭhite deyyadhamme, puññatthassa jigīsato [jigiṃsato (sī. syā. kaṃ. pī.)]; Santesu paṭhamaṃ dinnā, vipulā hoti dakkhiṇā. ‘‘Santo have pavakkhāmi, sāriputta suṇohi me; Iti kaṇhāsu setāsu, rohiṇīsu harīsu vā. ‘‘Kammāsāsu sarūpāsu, gosu pārevatāsu vā; Yāsu kāsuci etāsu, danto jāyati puṅgavo. ‘‘Dhorayho balasampanno, kalyāṇajavanikkamo; Tameva bhāre yuñjanti, nāssa vaṇṇaṃ parikkhare. ‘‘Evamevaṃ manussesu, yasmiṃ kismiñci jātiye; Khattiye brāhmaṇe vesse, sudde caṇḍālapukkuse. ‘‘Yāsu kāsuci etāsu, danto jāyati subbato; Dhammaṭṭho sīlasampanno, saccavādī hirīmano. ‘‘Pahīnajātimaraṇo, brahmacariyassa kevalī; Pannabhāro visaṃyutto, katakicco anāsavo. ‘‘Pāragū sabbadhammānaṃ, anupādāya nibbuto; Tasmiñca viraje khette, vipulā hoti dakkhiṇā. ‘‘Bālā ca avijānantā, dummedhā assutāvino; Bahiddhā dadanti dānāni, na hi sante upāsare. ‘‘Ye ca sante upāsanti, sappaññe dhīrasammate; Saddhā ca nesaṃ sugate, mūlajātā patiṭṭhitā. ‘‘Devalokañca te yanti, kule vā idha jāyare; Anupubbena nibbānaṃ, adhigacchanti paṇḍitā’’ti. navamaṃ;",
      "english": "Then Householder Anathapindika, surrounded by about five hundred lay followers, approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Then the Blessed One addressed Venerable Sariputta: \"Sariputta, any lay follower, clad in white, whom you might know whose actions are restrained in the five training rules, and who can obtain at will, without difficulty or trouble, the four elevated mental states that are conducive to a pleasant abiding in this very life, he, if he wishes, could declare of himself: 'I am one for whom hell has been destroyed, for whom the animal realm has been destroyed, for whom the realm of the hungry ghosts has been destroyed, for whom all realms of deprivation, unhappy destinations, and nether worlds have been destroyed. I am a stream-entrant, one no longer subject to downfall, certain of liberation, with enlightenment as my destination.'\"\n\n\"In which five training rules are his actions restrained? Here, Sariputta, a noble disciple abstains from the destruction of life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from distilled and fermented intoxicants, which are the basis for heedlessness. It is in these five training rules that his actions are restrained.\"\n\n\"What are the four elevated mental states that are conducive to a pleasant abiding in this very life, which he can obtain at will, without difficulty or trouble? Here, Sariputta, a noble disciple possesses unwavering faith in the Buddha, thinking: 'Indeed, the Blessed One is an Arahant, a Fully Enlightened One, accomplished in knowledge and conduct, a Fortunate One, knower of the world, an unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Enlightened One, the Blessed One.' This is the first elevated mental state, conducive to a pleasant abiding in this very life, that he has attained for the purification of his impure mind and the cleansing of his uncleansed mind.\"\n\n\"Furthermore, Sariputta, a noble disciple possesses unwavering faith in the Dhamma, thinking: 'The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.' This is the second elevated mental state, conducive to a pleasant abiding in this very life, that he has attained for the purification of his impure mind and the cleansing of his uncleansed mind.\"\n\n\"Furthermore, Sariputta, a noble disciple possesses unwavering faith in the Saṅgha, thinking: 'The Saṅgha of the Blessed One's disciples is practicing well, the Saṅgha of the Blessed One's disciples is practicing directly, the Saṅgha of the Blessed One's disciples is practicing insightfully, the Saṅgha of the Blessed One's disciples is practicing respectfully. That is, the four pairs of noble persons, the eight types of individuals – this Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.' This is the third elevated mental state, conducive to a pleasant abiding in this very life, that he has attained for the purification of his impure mind and the cleansing of his uncleansed mind.\"\n\n\"Furthermore, Sariputta, a noble disciple possesses the virtues cherished by the noble ones – unbroken, untorn, unblemished, unspotted, liberating, praised by the wise, untainted by craving for rebirth, conducive to concentration. This is the fourth elevated mental state, conducive to a pleasant abiding in this very life, that he has attained for the purification of his impure mind and the cleansing of his uncleansed mind. He can obtain these four elevated mental states, conducive to a pleasant abiding in this very life, at will, without difficulty or trouble.\"\n\n\"Sariputta, any lay follower, clad in white, whom you might know whose actions are restrained in these five training rules, and who can obtain these four elevated mental states, conducive to a pleasant abiding in this very life, at will, without difficulty or trouble, he, if he wishes, could declare of himself: 'I am one for whom hell has been destroyed, for whom the animal realm has been destroyed, for whom the realm of the hungry ghosts has been destroyed, for whom all realms of deprivation, unhappy destinations, and nether worlds have been destroyed. I am a stream-entrant, one no longer subject to downfall, certain of liberation, with enlightenment as my destination.'\"\n\n\"Seeing the danger in hells, one should avoid evil deeds. Embracing the noble Dhamma, the wise one should avoid them.\n\nOne should not harm any living beings while having the power to refrain; and one should not knowingly speak falsely. One should not take what is not given.\n\nContent with one's own spouse, one should not desire another's spouse. A person should not drink intoxicating liquor, whether fermented or distilled, which deludes the mind.\n\nOne should recollect the Fully Enlightened One and reflect upon the Dhamma. One should cultivate a mind of harmlessness and welfare, for the sake of the divine realms.\n\nWhen gifts are available, for one who desires merit, an offering given first to the virtuous is abundant.\n\nSariputta, I will tell you this for sure; listen to me. Whether among black cows, white, reddish-brown, or green ones,\n\nor spotted, or of beautiful form, or grey like a pigeon – from any of these, a tamed, excellent bull may be born.\n\nOne capable of bearing a burden, endowed with strength, with excellent speed and effort – him alone they yoke to the burden, not examining his color.\n\nJust so among humans, in whatever birth, whether among khattiyas, brahmins, vessas, suddas, caṇḍālas, or pukkusas.\"\n\nAmongst beings, when one who is tamed, well-conducted, established in the Dhamma, endowed with virtue, a speaker of truth, and conscientious arises – one who has abandoned birth and death, who has perfected the holy life, laid down the burden, is unbound, has done what needs to be done, and whose defilements are destroyed; one who has gone to the far shore of all phenomena and is utterly extinguished without clinging – in that stainless field, an offering becomes abundant.\n\nBut the foolish and ignorant, unintelligent and unlearned, give gifts externally, for they do not attend to the worthy ones.\n\nHowever, those who attend to the worthy ones, the wise, the steadfast and respected, have their faith in the Sugata deeply rooted and established. They go to the world of devas, or are reborn in noble families here; and gradually, these wise ones attain Nibbāna.",
      "sinhala": "එවිට අනේපිඬු සිටුතුමා පන්සියයක පමණ උපාසක පිරිසක් පිරිවරා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩිවිය. එකල්හි භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් සැරියුත් තෙරුන් අමතා මෙසේ වදාළ සේක: ‘‘සැරියුත්ත, යම් කිසි ගිහියෙකු සුදු වස්ත්‍ර හැඳගත්, පන්සිල් පදයන්හි සුසංවර වූ ක්‍රියා ඇත්තෙක් ද, සිව් ආකාර වූ ආභිචේතසික, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණයන් කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවකින් තොරව ලබන්නෙක් ද, එබඳු තැනැත්තෙකු ඔබ දන්නේ නම්, හෙතෙම කැමති නම් තමන් විසින්ම තමා මෙසේ ප්‍රකාශ කරන්නේය: ‘මම නිරය විනාශ කළේ වෙමි, තිරිසන් යෝනිය විනාශ කළේ වෙමි, ප්‍රේත විෂය විනාශ කළේ වෙමි, අපාය දුර්ගති විනිපාතය විනාශ කළේ වෙමි. මම සෝවාන් වූවෙක්මි, දුගතියට නොවැටෙන ස්වභාවය ඇත්තෙක්මි, නියත වූ සම්බෝධිය පිණිස පරායණ කොට ඇත්තෙක්මි’ යනුවෙනි.’’\n\n‘‘කවර පන්සිල් පදයන්හි හෙතෙම සුසංවර වූ ක්‍රියා ඇත්තෙක් වන්නේ ද? සැරියුත්ත, මෙහිලා ආර්ය ශ්‍රාවකයා පණිවාතයෙන් වෙන්වූවෙක් වෙයි, අදත්තාදානයෙන් වෙන්වූවෙක් වෙයි, කාමයෙහි වරදවා හැසිරීමෙන් වෙන්වූවෙක් වෙයි, මුසාවාදයෙන් වෙන්වූවෙක් වෙයි, රහමෙර පානයෙන් හෙවත් ප්‍රමාදයට හේතුවන මත්පැන් පානයෙන් වෙන්වූවෙක් වෙයි. මේ පන්සිල් පදයන්හි ඔහුගේ ක්‍රියා සුසංවර වන්නේය.’’\n\n‘‘කවර නම් සිව් ආකාර වූ ආභිචේතසික, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණයන් කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවකින් තොරව ලබන්නේ ද? සැරියුත්ත, මෙහිලා ආර්ය ශ්‍රාවකයා බුදුරදුන් කෙරෙහි නොසෙල්වෙන පැහැදීමෙන් යුක්ත වෙයි – ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං වන සේක, සම්මා සම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තර පුරිසදම්ම සාරථී වන සේක, දෙවි මිනිසුන්ට ශාස්තෘ වන සේක, බුද්ධ වන සේක, භාග්‍යවතුන් වන සේක’ යනුවෙනි. මෙය ඔහුගේ පළමු ආභිචේතසික වූ, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණය වන්නේය. (මෙය) කිලිටි වූ සිත පිරිසිදු කිරීම පිණිසත්, මලින වූ සිත නිර්මල කිරීම පිණිසත් ලැබුණක් වන්නේය.’’\n\n‘‘නැවතත්, සැරියුත්ත, ආර්ය ශ්‍රාවකයා ධර්මය කෙරෙහි නොසෙල්වෙන පැහැදීමෙන් යුක්ත වෙයි – ‘භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ, ස්වයං දෘෂ්ටියට ගෝචර වූ, කාලානුරූප නොවූ, ‘එව, බලව’ යනුවෙන් ආරාධනා කළ හැකි, නිවනට පමුණුවන, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම අත්දැකිය යුතු වූ ධර්මයයි’ යනුවෙනි. මෙය ඔහුගේ දෙවන ආභිචේතසික වූ, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණය වන්නේය. (මෙය) කිලිටි වූ සිත පිරිසිදු කිරීම පිණිසත්, මලින වූ සිත නිර්මල කිරීම පිණිසත් ලැබුණක් වන්නේය.’’\n\n‘‘නැවතත්, සැරියුත්ත, ආර්ය ශ්‍රාවකයා සංඝයා කෙරෙහි නොසෙල්වෙන පැහැදීමෙන් යුක්ත වෙයි – ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා සුප්‍රතිපන්නය (හොඳින් පිළිපන්නේය), භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ඍජුප්‍රතිපන්නය (නොවංකව පිළිපන්නේය), භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ඤායප්‍රතිපන්නය (නිවන් මගට යෝග්‍යව පිළිපන්නේය), භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා සාමීචිප්‍රතිපන්නය (සුදුසු පරිදි පිළිපන්නේය). එනම් ඒ සතර පුරුෂ යුගල ද අට පුරුෂ පුද්ගල ද වූ භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ආහුනෙය්‍යය (දුර සිට ගෙනෙන දානයට සුදුසුය), පාහුනෙය්‍යය (ආගන්තුක සත්කාරයට සුදුසුය), දක්ඛිණෙය්‍යය (පූජාවට සුදුසුය), අඤ්ජලිකරණීයය (දොහොත් මුදුන් තබා වැඳීමට සුදුසුය), ලෝකයාට අනුත්තර වූ පින් කෙත වන්නේය’ යනුවෙනි. මෙය ඔහුගේ තෙවන ආභිචේතසික වූ, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණය වන්නේය. (මෙය) කිලිටි වූ සිත පිරිසිදු කිරීම පිණිසත්, මලින වූ සිත නිර්මල කිරීම පිණිසත් ලැබුණක් වන්නේය.’’\n\n‘‘නැවතත්, සැරියුත්ත, ආර්ය ශ්‍රාවකයා ආර්යයන්ට ප්‍රිය වූ ශීලයකින් යුක්ත වෙයි. (එනම්) නොකැඩුණු, සිදුරු නැති, (ප්‍රත්‍යවේක්ෂණයෙන්) නොකැළැල් වූ, කිලිටි නොවූ, නිදහස් භාවයට පමුණුවන, ප්‍රඥාවන්තයන් විසින් ප්‍රශංසා කරන ලද, (ආත්ම වශයෙන්) නොගන්නා ලද, සමාධිය පිණිස පවත්නා ශීලයයි. මෙය ඔහුගේ සිව්වන ආභිචේතසික වූ, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණය වන්නේය. (මෙය) කිලිටි වූ සිත පිරිසිදු කිරීම පිණිසත්, මලින වූ සිත නිර්මල කිරීම පිණිසත් ලැබුණක් වන්නේය. මේ සිව් ආකාර වූ ආභිචේතසික, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණයන් හෙතෙම කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවකින් තොරව ලබන්නේය.’’\n\n‘‘සැරියුත්ත, යම් කිසි ගිහියෙකු සුදු වස්ත්‍ර හැඳගත්, මේ පන්සිල් පදයන්හි සුසංවර වූ ක්‍රියා ඇත්තෙක් ද, මේ සිව් ආකාර වූ ආභිචේතසික, මේ ආත්මභාවයේදීම ලැබෙන සුව විහරණයන් කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවකින් තොරව ලබන්නෙක් ද, එබඳු තැනැත්තෙකු ඔබ දන්නේ නම්, හෙතෙම කැමති නම් තමන් විසින්ම තමා මෙසේ ප්‍රකාශ කරන්නේය: ‘මම නිරය විනාශ කළේ වෙමි, තිරිසන් යෝනිය විනාශ කළේ වෙමි, ප්‍රේත විෂය විනාශ කළේ වෙමි, අපාය දුර්ගති විනිපාතය විනාශ කළේ වෙමි. මම සෝවාන් වූවෙක්මි, දුගතියට නොවැටෙන ස්වභාවය ඇත්තෙක්මි, නියත වූ සම්බෝධිය පිණිස පරායණ කොට ඇත්තෙක්මි’ යනුවෙනි.’’\n\n‘‘නිරයන්හි ඇති භය දැක පව්කම් දුරු කළ යුතුය. ආර්ය ධර්මය සමාදන් වී පණ්ඩිතයා (නොහොත් ප්‍රඥාවන්තයා) (පව්කම්) දුරු කළ යුතුය.’’\n\n‘‘ශක්තිය පවතී නම් සතුන්ට හිංසා නොකළ යුතුය. දැන දැන මුසාවාද නොකළ යුතුය. නොදුන් දෙයක් නොගැනිය යුතුය.’’\n\n‘‘තම බිරිඳගෙන් සතුටු වූවා, අනුන්ගේ බිරිඳ කෙරෙහි ඇල්මක් ඇති කර නොගත යුතුය. සිත් මෝහනය කරන මත්පැන් පානය නොකළ යුතුය.’’\n\n‘‘සම්බුදුරජාණන් වහන්සේ අනුස්මරණය කළ යුතුය. ධර්මය ගැන නැවත නැවත කල්පනා කළ යුතුය. අව්‍යාපජ්ජ වූ (කාටත් හිංසා නොකරන) හිතවත් සිතක් දෙව්ලොව පිණිස භාවනා කළ යුතුය.’’\n\n‘‘පින් කැමති වූ කෙනෙකුට දිය යුතු වස්තුව සූදානම් වූ කල්හි, සත්පුරුෂයන්ට පළමුව දෙන ලද දානය මහත් ඵල මහා ආනිසංස වන්නේය.’’\n\n‘‘සැරියුත්ත, මා කියන දේ අසන්න. මම සත්පුරුෂයන් ගැනම කියන්නෙමි. එනම්, කලු, සුදු, රතු, හෝ කොළ යන මේ ගවයන් අතර ද වේවා.’’\n\n‘‘කම්මාස, හෝ පරෙවි වර්ණ ඇති ගවයන් අතර ද වේවා. ඒ කවර ගවයෙකු අතර වුව ද දමනය වූ ශක්තිමත් වෘෂභයෙක් උපදී.’’\n\n‘‘බර අදින, ශක්තියෙන් යුත්, යහපත් වේගයෙන් යුත් ගවයාම බර ඇදීමට යොදවති. ඔහුගේ වර්ණය ගැන නොසලකති.’’\n\n‘‘එලෙසින්ම මිනිසුන් අතර ද යම් කිසි ජාතියක වේවා, ක්ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශුද්‍ර, චණ්ඩාල, පුක්කුස යන මේ කුල අතර ද වේවා...’’\n\nයම් කවර හෝ (දානය දීමට සුදුසු) ක්ෂේත්‍රයන්හි දමනය වූ, යහපත් ව්‍රත ඇති, ධර්මයේ පිහිටි, සීල සම්පූර්ණ වූ, සත්‍ය වචනය කථා කරන, හිරි ඔතප් ඇති පුද්ගලයෙක් පහළ වේ ද,\n\nජාති-මරණ දුරලූ, බ්‍රහ්මචර්යාවෙන් අත්‍යන්තයෙන් යුක්ත වූ, (සංසාර) බර පහ කළ, (සියලු) බැඳීම්වලින් මිදුණු, කළ යුතු කටයුතු නිම කළ, ආශ්‍රව රහිත වූ,\n\nසියලු ධර්මයන් පිළිබඳ අවබෝධය ලත්, උපාදාන රහිතව පිරිනිවුණු ඒ නිර්මල ක්ෂේත්‍රයෙහි (දෙන දානය) මහත් ඵල මහානිසංස ඇති දක්ෂිණාවක් වේ.\n\nඅවිද්‍යා අන්ධ වූ බාලයෝ, (සත්‍යය) නොදන්නා වූ, දුර්මති වූ, ධර්මය අසා නැත්තා වූ බැවින්, (අසත්පුරුෂයන් වන) බාහිර අයට දන් දෙති; ඔවුහු සත්පුරුෂයන්ට උපස්ථාන නොකරති.\n\nයම් කෙනෙක් ශාන්ත වූ, ප්‍රඥාවන්ත වූ, ධීරයන් විසින් සම්භාවනීය වූ සත්පුරුෂයන්ට උපස්ථාන කරත් ද, ඔවුන්ගේ සුගතයන් කෙරෙහි වූ ශ්‍රද්ධාව මුල් බැසගෙන ස්ථිරව පිහිටා ඇත.\n\nඔවුහු දෙව්ලොවට යති, නැතහොත් මෙලොව උසස් කුලයක උපදිති; (අවසානයේ) ඒ පණ්ඩිතයෝ අනුක්‍රමයෙන් නිර්වාණය අවබෝධ කරගනිති.",
      "paliTitle": "Gihisuttaṃ"
    },
    {
      "number": 180,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ. Addasā kho bhagavā addhānamaggappaṭipanno aññatarasmiṃ padese mahantaṃ sālavanaṃ; disvāna [disvā (sī. pī.)] maggā okkamma [ukkamma (katthaci)] yena taṃ sālavanaṃ tenupasaṅkami; upasaṅkamitvā taṃ sālavanaṃ ajjhogāhetvā aññatarasmiṃ padese sitaṃ pātvākāsi. Atha kho āyasmato ānandassa etadahosi – ‘‘ko nu kho hetu ko paccayo bhagavato sitassa pātukammāya? Na akāraṇena tathāgatā sitaṃ pātukarontī’’ti. Atha kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo bhagavato sitassa pātukammāya? Na akāraṇena tathāgatā sitaṃ pātukarontī’’ti. ‘‘Bhūtapubbaṃ, ānanda, imasmiṃ padese nagaraṃ ahosi iddhañceva phītañca bahujanaṃ ākiṇṇamanussaṃ. Taṃ kho panānanda, nagaraṃ kassapo bhagavā arahaṃ sammāsambuddho upanissāya vihāsi. Kassapassa kho panānanda, bhagavato arahato sammāsambuddhassa gavesī nāma upāsako ahosi sīlesu aparipūrakārī. Gavesinā kho, ānanda, upāsakena pañcamattāni upāsakasatāni paṭidesitāni samādapitāni [samādāpitāni (?)] ahesuṃ sīlesu aparipūrakārino. Atha kho, ānanda, gavesissa upāsakassa etadahosi – ‘ahaṃ kho imesaṃ pañcannaṃ upāsakasatānaṃ bahūpakāro [bahukāro (katthaci)] pubbaṅgamo samādapetā [samādāpetā (?)], ahañcamhi sīlesu aparipūrakārī, imāni ca pañca upāsakasatāni sīlesu aparipūrakārino. Iccetaṃ samasamaṃ, natthi kiñci atirekaṃ; handāhaṃ atirekāyā’’’ti. ‘‘Atha kho, ānanda, gavesī upāsako yena tāni pañca upāsakasatāni tenupasaṅkami; upasaṅkamitvā tāni pañca upāsakasatāni etadavoca – ‘ajjatagge maṃ āyasmanto sīlesu paripūrakāriṃ dhārethā’ti! Atha kho, ānanda, tesaṃ pañcannaṃ upāsakasatānaṃ etadahosi – ‘ayyo kho gavesī amhākaṃ bahūpakāro pubbaṅgamo samādapetā. Ayyo hi nāma gavesī sīlesu paripūrakārī bhavissati. Kimaṅgaṃ [kimaṅga (sī. pī.)] pana maya’nti [pana na mayanti (sī.) a. ni. 4.159; cūḷava. 330; saṃ. ni. 5.1020 pāḷiyā saṃsandetabbaṃ]! Atha kho, ānanda, tāni pañca upāsakasatāni yena gavesī upāsako tenupasaṅkamiṃsu; upasaṅkamitvā gavesiṃ upāsakaṃ etadavocuṃ – ‘ajjatagge ayyo gavesī imānipi pañca upāsakasatāni sīlesu paripūrakārino dhāretū’ti. Atha kho, ānanda, gavesissa upāsakassa etadahosi – ‘ahaṃ kho imesaṃ pañcannaṃ upāsakasatānaṃ bahūpakāro pubbaṅgamo samādapetā, ahañcamhi sīlesu paripūrakārī, imānipi pañca upāsakasatāni sīlesu paripūrakārino. Iccetaṃ samasamaṃ, natthi kiñci atirekaṃ; handāhaṃ atirekāyā’’’ti! ‘‘Atha kho, ānanda, gavesī upāsako yena tāni pañca upāsakasatāni tenupasaṅkami; upasaṅkamitvā tāni pañca upāsakasatāni etadavoca – ‘ajjatagge maṃ āyasmanto brahmacāriṃ dhāretha ārācāri [anācāriṃ (pī.)] virataṃ methunā gāmadhammā’ti. Atha kho, ānanda, tesaṃ pañcannaṃ upāsakasatānaṃ etadahosi – ‘ayyo kho gavesī amhākaṃ bahūpakāro pubbaṅgamo samādapetā. Ayyo hi nāma gavesī brahmacārī bhavissati ārācārī virato methunā gāmadhammā. Kimaṅgaṃ pana maya’nti! Atha kho, ānanda, tāni pañca upāsakasatāni yena gavesī upāsako tenupasaṅkamiṃsu; upasaṅkamitvā gavesiṃ upāsakaṃ etadavocuṃ – ‘ajjatagge ayyo gavesī imānipi pañca upāsakasatāni brahmacārino dhāretu ārācārino viratā methunā gāmadhammā’ti. Atha kho, ānanda, gavesissa upāsakassa etadahosi – ‘ahaṃ kho imesaṃ pañcannaṃ upāsakasatānaṃ bahūpakāro pubbaṅgamo samādapetā. Ahañcamhi sīlesu paripūrakārī. Imānipi pañca upāsakasatāni sīlesu paripūrakārino. Ahañcamhi brahmacārī ārācārī virato methunā gāmadhammā. Imānipi pañca upāsakasatāni brahmacārino ārācārino viratā methunā gāmadhammā. Iccetaṃ samasamaṃ, natthi kiñci atirekaṃ; handāhaṃ atirekāyā’’’ti. ‘‘Atha kho, ānanda, gavesī upāsako yena tāni pañca upāsakasatāni tenupasaṅkami; upasaṅkamitvā tāni pañca upāsakasatāni etadavoca – ‘ajjatagge maṃ āyasmanto ekabhattikaṃ dhāretha rattūparataṃ virataṃ vikālabhojanā’ti. Atha kho, ānanda, tesaṃ pañcannaṃ upāsakasatānaṃ etadahosi – ‘ayyo kho gavesī bahūpakāro pubbaṅgamo samādapetā. Ayyo hi nāma gavesī ekabhattiko bhavissati rattūparato virato vikālabhojanā. Kimaṅgaṃ pana maya’nti! Atha kho, ānanda, tāni pañca upāsakasatāni yena gavesī upāsako tenupasaṅkamiṃsu; upasaṅkamitvā gavesiṃ upāsakaṃ etadavocuṃ – ‘ajjatagge ayyo gavesī imānipi pañca upāsakasatāni ekabhattike dhāretu rattūparate virate vikālabhojanā’ti. Atha kho, ānanda, gavesissa upāsakassa etadahosi – ‘ahaṃ kho imesaṃ pañcannaṃ upāsakasatānaṃ bahūpakāro pubbaṅgamo samādapetā. Ahañcamhi sīlesu paripūrakārī. Imānipi pañca upāsakasatāni sīlesu paripūrakārino. Ahañcamhi brahmacārī ārācārī virato methunā gāmadhammā. Imānipi pañca upāsakasatāni brahmacārino ārācārino viratā methunā gāmadhammā. Ahañcamhi ekabhattiko rattūparato virato vikālabhojanā. Imānipi pañca upāsakasatāni ekabhattikā rattūparatā viratā vikālabhojanā. Iccetaṃ samasamaṃ, natthi kiñci atirekaṃ; handāhaṃ atirekāyā’’’ti. ‘‘Atha kho, ānanda, gavesī upāsako yena kassapo bhagavā arahaṃ sammāsambuddho tenupasaṅkami; upasaṅkamitvā kassapaṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavoca – ‘labheyyāhaṃ, bhante, bhagavato santike pabbajjaṃ labheyyaṃ upasampada’nti. Alattha kho, ānanda, gavesī upāsako kassapassa bhagavato arahato sammāsambuddhassa santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno kho panānanda, gavesī bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti abbhaññāsi. Aññataro ca panānanda, gavesī bhikkhu arahataṃ ahosi. ‘‘Atha kho, ānanda, tesa pañcannaṃ upāsakasatānaṃ etadahosi – ‘ayyo kho gavesī amhākaṃ bahūpakāro pubbaṅgamo samādapetā. Ayyo hi nāma gavesī kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajissati. Kimaṅgaṃ pana maya’nti! Atha kho, ānanda, tāni pañca upāsakasatāni yena kassapo bhagavā arahaṃ sammāsambuddho tenupasaṅkamiṃsu; upasaṅkamitvā kassapaṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavocuṃ – ‘labheyyāma mayaṃ, bhante, bhagavato santike pabbajjaṃ, labheyyāma upasampada’nti. Alabhiṃsu kho, ānanda, tāni pañca upāsakasatāni kassapassa bhagavato arahato sammāsambuddhassa santike pabbajjaṃ, alabhiṃsu upasampadaṃ. ‘‘Atha kho, ānanda, gavesissa bhikkhuno etadahosi – ‘ahaṃ kho imassa anuttarassa vimuttisukhassa nikāmalābhī homi akicchalābhī akasiralābhī. Aho vatimānipi pañca bhikkhusatāni imassa anuttarassa vimuttisukhassa nikāmalābhino assu akicchalābhino akasiralābhino’ti. Atha kho, ānanda, tāni pañca bhikkhusatāni vūpakaṭṭhā [bhikkhusatāni ekekā vūpakaṭṭhā (syā. kaṃ.)] appamattā ātāpino pahitattā viharantā nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihariṃsu. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti abbhaññiṃsu’’. ‘‘Iti kho, ānanda, tāni pañca bhikkhusatāni gavesīpamukhāni uttaruttari [uttaruttariṃ (sī. syā. kaṃ. pī.)] paṇītapaṇītaṃ vāyamamānā anuttaraṃ vimuttiṃ sacchākaṃsu. Tasmātiha, ānanda, evaṃ sikkhitabbaṃ – ‘uttaruttari paṇītapaṇītaṃ vāyamamānā anuttaraṃ vimuttiṃ sacchikarissāmā’ti. Evañhi vo, ānanda, sikkhitabba’’nti. Dasamaṃ. ",
      "english": "At one time, the Blessed One was wandering in the Kosala country with a large community of monks. Indeed, as the Blessed One was journeying along the road, he saw a great sal-wood forest in a certain region; having seen it, he turned aside from the road and approached that sal-wood forest; having approached it, he entered that sal-wood forest and, in a certain spot, revealed a smile. Then it occurred to Venerable Ānanda, \"What, now, is the reason, what is the cause for the Blessed One's smile to appear? Tathāgatas do not reveal a smile without a reason.\" Then Venerable Ānanda said to the Blessed One, \"What, Bhante, is the reason, what is the cause for the Blessed One's smile to appear? Tathāgatas do not reveal a smile without a reason.\"\n\n\"In the past, Ānanda, a city stood in this region, prosperous and thriving, populous and teeming with people. Indeed, Ānanda, the Blessed One Kassapa, the Arahant, the Perfectly Self-Awakened One, dwelt dependent on that city. Indeed, Ānanda, the Blessed One Kassapa, the Arahant, the Perfectly Self-Awakened One, had a lay follower named Gavesī, who was incomplete in his observance of moral precepts. Indeed, Ānanda, by the lay follower Gavesī, more than five hundred lay followers were instructed and encouraged, who were also incomplete in their observance of moral precepts. Then, Ānanda, it occurred to the lay follower Gavesī, 'Indeed, I am very helpful to these five hundred lay followers, their leader and instigator, and I myself am incomplete in the observance of moral precepts, and these five hundred lay followers are also incomplete in the observance of moral precepts. This is equal, there is nothing superior; come now, let me become superior!'\"\n\n\"Then, Ānanda, the lay follower Gavesī approached those five hundred lay followers; having approached them, he said to those five hundred lay followers, 'From today onwards, Venerables, consider me as one who fully observes moral precepts!' Then, Ānanda, it occurred to those five hundred lay followers, 'Indeed, our respected Gavesī is very helpful to us, our leader and instigator. If respected Gavesī himself is going to fully observe moral precepts, then what of us?' Then, Ānanda, those five hundred lay followers approached the lay follower Gavesī; having approached him, they said to the lay follower Gavesī, 'From today onwards, respected Gavesī, consider these five hundred lay followers also as those who fully observe moral precepts!' Then, Ānanda, it occurred to the lay follower Gavesī, 'Indeed, I am very helpful to these five hundred lay followers, their leader and instigator, and I myself fully observe moral precepts, and these five hundred lay followers also fully observe moral precepts. This is equal, there is nothing superior; come now, let me become superior!'\"\n\n\"Then, Ānanda, the lay follower Gavesī approached those five hundred lay followers; having approached them, he said to those five hundred lay followers, 'From today onwards, Venerables, consider me as one who lives a celibate life, far-removed from sexual misconduct, from the village-bound way of life!' Then, Ānanda, it occurred to those five hundred lay followers, 'Indeed, our respected Gavesī is very helpful to us, our leader and instigator. If respected Gavesī himself is going to live a celibate life, far-removed from sexual misconduct and the village-bound way of life, then what of us?' Then, Ānanda, those five hundred lay followers approached the lay follower Gavesī; having approached him, they said to the lay follower Gavesī, 'From today onwards, respected Gavesī, consider these five hundred lay followers also as those who live a celibate life, far-removed from sexual misconduct and the village-bound way of life!' Then, Ānanda, it occurred to the lay follower Gavesī, 'Indeed, I am very helpful to these five hundred lay followers, their leader and instigator. And I myself fully observe moral precepts. And these five hundred lay followers also fully observe moral precepts. And I myself live a celibate life, far-removed from sexual misconduct and the village-bound way of life. And these five hundred lay followers also live a celibate life, far-removed from sexual misconduct and the village-bound way of life. This is equal, there is nothing superior; come now, let me become superior!'\"\n\n\"Then, Ānanda, the lay follower Gavesī approached those five hundred lay followers; having approached them, he said to those five hundred lay followers, 'From today onwards, Venerables, consider me as one who eats only once a day, refraining from food at night, abstaining from untimely meals!' Then, Ānanda, it occurred to those five hundred lay followers, 'Indeed, our respected Gavesī is very helpful, our leader and instigator. If respected Gavesī himself is going to eat only once a day, refraining from food at night, abstaining from untimely meals, then what of us?'\"\n\nThen, Ananda, those five hundred lay followers approached the lay follower Gavesī. Having approached the lay follower Gavesī, they said this to him: 'From today onwards, venerable Gavesī, please consider these five hundred lay followers as those who eat only one meal a day, abstain from food at night, and refrain from untimely eating.' Then, Ananda, this thought occurred to the lay follower Gavesī: 'Indeed, I am very helpful to these five hundred lay followers, their leader, and their instructor. I am one who perfectly fulfills the precepts. These five hundred lay followers also perfectly fulfill the precepts. I am one who practices celibacy, keeping afar, abstaining from sexual intercourse, from the village-dhamma. These five hundred lay followers also practice celibacy, keeping afar, abstaining from sexual intercourse, from the village-dhamma. I am one who eats only one meal a day, abstaining from food at night, refraining from untimely eating. These five hundred lay followers also eat only one meal a day, abstain from food at night, refrain from untimely eating. This is all equal; there is nothing extra for me. Let me go beyond this!' Then, Ananda, the lay follower Gavesī approached the Blessed One Kassapa, the Arahant, the Fully Awakened Buddha. Having approached the Blessed One Kassapa, the Arahant, the Fully Awakened Buddha, he said this: 'Venerable sir, may I receive the going forth into homelessness in the presence of the Blessed One? May I receive full ordination?' And so, Ananda, the lay follower Gavesī received the going forth into homelessness in the presence of the Blessed One Kassapa, the Arahant, the Fully Awakened Buddha; he received full ordination. Then, Ananda, not long after his full ordination, the monk Gavesī, dwelling alone, secluded, diligent, ardent, and resolute, before long, with his own direct knowledge, in this very life, realized and attained the unsurpassed culmination of the holy life, for the sake of which noble sons rightly go forth from home into homelessness, and dwelled therein. He directly knew: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.' And Ananda, the monk Gavesī became one of the Arahants.\n\nThen, Ananda, this thought occurred to those five hundred lay followers: 'Indeed, venerable Gavesī was very helpful to us, our leader, and our instructor. If venerable Gavesī, having shaved off his hair and beard and donned saffron robes, goes forth from home into homelessness, then what are we to say for ourselves?' Then, Ananda, those five hundred lay followers approached the Blessed One Kassapa, the Arahant, the Fully Awakened Buddha. Having approached the Blessed One Kassapa, the Arahant, the Fully Awakened Buddha, they said this: 'Venerable sir, may we receive the going forth into homelessness in the presence of the Blessed One? May we receive full ordination?' And so, Ananda, those five hundred lay followers received the going forth into homelessness in the presence of the Blessed One Kassapa, the Arahant, the Fully Awakened Buddha; they received full ordination.\n\nThen, Ananda, this thought occurred to the monk Gavesī: 'Indeed, I am one who obtains this unsurpassed happiness of liberation as I wish, without difficulty, without trouble. Oh, if only these five hundred monks would also obtain this unsurpassed happiness of liberation as they wish, without difficulty, without trouble!' Then, Ananda, those five hundred monks, dwelling secluded, diligent, ardent, and resolute, before long, with their own direct knowledge, in this very life, realized and attained the unsurpassed culmination of the holy life, for the sake of which noble sons rightly go forth from home into homelessness, and dwelled therein. They directly knew: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.' Thus, Ananda, those five hundred monks, with Gavesī as their leader, striving for ever higher and more refined states, realized unsurpassed liberation. Therefore, Ananda, you should train yourselves thus: 'Striving for ever higher and more refined states, we shall realize unsurpassed liberation.' This is indeed how you should train yourselves, Ananda.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ මහත් භික්ෂුසඟුන් පිරිසක් සමඟ කෝසල ජනපදයෙහි චාරිකාවේ වැඩසිටි සේක. මඟෙහි ගමන් කරමින් වැඩසිටි භාග්‍යවතුන් වහන්සේ යම්කිසි ප්‍රදේශයක වූ විශාල සල් වනයක් දැක වදාළ සේක; එය දැක මඟින් බැස ඒ සල් වනය තිබූ තැනට වැඩියාහු ය; එහි එළඹ ඒ සල් වනය තුළට පිවිස යම්කිසි තැනක දී මඳහස පහළ කළ සේක. එකල්හි ආයුෂ්මත් ආනන්ද තෙරුන්ට මෙසේ සිතිණි: \"භාග්‍යවතුන් වහන්සේගේ මඳහස පහළ වීමට කුමක් නම් හේතු ද, කුමක් නම් ප්‍රත්‍යය ද? නිරහේතුකව තථාගතයන් වහන්සේලා මඳහස පහළ නොකරති.\" එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ සැල කළහ: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ මඳහස පහළ වීමට කුමක් නම් හේතු ද, කුමක් නම් ප්‍රත්‍යය ද? නිරහේතුකව තථාගතයන් වහන්සේලා මඳහස පහළ නොකරති.\"\n\n\"ආනන්දය, පෙර මේ ප්‍රදේශයෙහි සමෘද්ධිමත් වූ ද, සශ්‍රීක වූ ද, බොහෝ ජනයාගෙන් පිරුණු ද නගරයක් විය. ආනන්දය, ඒ නගරය ආශ්‍රය කරගෙන කස්සප භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ වැඩසිටි සේක. ආනන්දය, කස්සප භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට ගවේසී නම් වූ උපාසකයෙක් විය. ඔහු සීලයන්හි අසම්පූර්ණ ක්‍රියා ඇත්තෙක් විය. ආනන්දය, ගවේසී උපාසකයා විසින් සීලයන්හි අසම්පූර්ණ ක්‍රියා ඇත්තන් වූ පන්සියයකට අධික උපාසකවරු පිරිසක් අසම්පූර්ණ සීලයන්ට පොළඹවා පුරුදු කරවා තිබුණි. එකල්හි, ආනන්දය, ගවේසී උපාසකයාට මෙසේ සිතිණි: 'මම මේ පන්සියයකට අධික උපාසකවරුන්ට බොහෝ උපකාරී වූ, පෙරමුණ ගන්නා වූ, අනුශාසනා කරන්නෙක් වෙමි. මම ද සීලයන්හි අසම්පූර්ණ ක්‍රියා ඇත්තෙක් වෙමි. මේ පන්සියයකට අධික උපාසකවරු ද සීලයන්හි අසම්පූර්ණ ක්‍රියා ඇත්තෝ ය. මෙය සම තත්ත්වයකි, කිසිවක් අතිරේක නොවේ. එබැවින් මම අතිරේකයට පත් වෙමි.'\n\n\"එකල්හි, ආනන්දය, ගවේසී උපාසකයා ඒ පන්සියයකට අධික උපාසකවරු සිටි තැනට එළඹියේ ය; එළඹ ඒ පන්සියයකට අධික උපාසකවරුන්ට මෙසේ කීවේ ය: 'ආයුෂ්මත්වරුනි, අද පටන් මා සීලයන්හි සම්පූර්ණ ක්‍රියා ඇත්තෙකු ලෙස සලකව්!' එකල්හි, ආනන්දය, ඒ පන්සියයකට අධික උපාසකවරුන්ට මෙසේ සිතිණි: 'ගවේසී පණ්ඩිතයන් වහන්සේ නියතයෙන් අපට බොහෝ උපකාරී වූ, පෙරමුණ ගන්නා වූ, අනුශාසනා කරන්නෙක් වන සේක. ගවේසී පණ්ඩිතයන් වහන්සේ නම් සීලයන්හි සම්පූර්ණ ක්‍රියා ඇත්තෙකු වනු ඇත. එසේ නම් අපි කුමකට ද?' එකල්හි, ආනන්දය, ඒ පන්සියයකට අධික උපාසකවරු ගවේසී උපාසකයා සිටි තැනට එළඹියහ; එළඹ ගවේසී උපාසකයාට මෙසේ කීහ: 'ගවේසී පණ්ඩිතයන් වහන්ස, අද පටන් මේ පන්සියයකට අධික උපාසකවරු ද සීලයන්හි සම්පූර්ණ ක්‍රියා ඇත්තන් ලෙස සලකනු මැනව!' එකල්හි, ආනන්දය, ගවේසී උපාසකයාට මෙසේ සිතිණි: 'මම මේ පන්සියයකට අධික උපාසකවරුන්ට බොහෝ උපකාරී වූ, පෙරමුණ ගන්නා වූ, අනුශාසනා කරන්නෙක් වෙමි. මම ද සීලයන්හි සම්පූර්ණ ක්‍රියා ඇත්තෙක් වෙමි. මේ පන්සියයකට අධික උපාසකවරු ද සීලයන්හි සම්පූර්ණ ක්‍රියා ඇත්තෝ ය. මෙය සම තත්ත්වයකි, කිසිවක් අතිරේක නොවේ. එබැවින් මම අතිරේකයට පත් වෙමි!'\n\n\"එකල්හි, ආනන්දය, ගවේසී උපාසකයා ඒ පන්සියයකට අධික උපාසකවරු සිටි තැනට එළඹියේ ය; එළඹ ඒ පන්සියයකට අධික උපාසකවරුන්ට මෙසේ කීවේ ය: 'ආයුෂ්මත්වරුනි, අද පටන් මා බ්‍රහ්මචාරීව, මෙථුන ගාමධර්මයෙන් දුරස් වූවෙකු ලෙස සලකව්!' එකල්හි, ආනන්දය, ඒ පන්සියයකට අධික උපාසකවරුන්ට මෙසේ සිතිණි: 'ගවේසී පණ්ඩිතයන් වහන්සේ නියතයෙන් අපට බොහෝ උපකාරී වූ, පෙරමුණ ගන්නා වූ, අනුශාසනා කරන්නෙක් වන සේක. ගවේසී පණ්ඩිතයන් වහන්සේ නම් බ්‍රහ්මචාරීව, මෙථුන ගාමධර්මයෙන් දුරස්ව වෙසෙන්නේ ය. එසේ නම් අපි කුමකට ද?' එකල්හි, ආනන්දය, ඒ පන්සියයකට අධික උපාසකවරු ගවේසී උපාසකයා සිටි තැනට එළඹියහ; එළඹ ගවේසී උපාසකයාට මෙසේ කීහ: 'ගවේසී පණ්ඩිතයන් වහන්ස, අද පටන් මේ පන්සියයකට අධික උපාසකවරු ද බ්‍රහ්මචාරීව, මෙථුන ගාමධර්මයෙන් දුරස්ව වෙසෙන්නන් ලෙස සලකනු මැනව!' එකල්හි, ආනන්දය, ගවේසී උපාසකයාට මෙසේ සිතිණි: 'මම මේ පන්සියයකට අධික උපාසකවරුන්ට බොහෝ උපකාරී වූ, පෙරමුණ ගන්නා වූ, අනුශාසනා කරන්නෙක් වෙමි. මම ද සීලයන්හි සම්පූර්ණ ක්‍රියා ඇත්තෙක් වෙමි. මේ පන්සියයකට අධික උපාසකවරු ද සීලයන්හි සම්පූර්ණ ක්‍රියා ඇත්තෝ ය. මම ද බ්‍රහ්මචාරීව, මෙථුන ගාමධර්මයෙන් දුරස්ව වෙසෙමි. මේ පන්සියයකට අධික උපාසකවරු ද බ්‍රහ්මචාරීව, මෙථුන ගාමධර්මයෙන් දුරස්ව වෙසෙන්නෝ ය. මෙය සම තත්ත්වයකි, කිසිවක් අතිරේක නොවේ. එබැවින් මම අතිරේකයට පත් වෙමි!'\n\n\"එකල්හි, ආනන්දය, ගවේසී උපාසකයා ඒ පන්සියයකට අධික උපාසකවරු සිටි තැනට එළඹියේ ය; එළඹ ඒ පන්සියයකට අධික උපාසකවරුන්ට මෙසේ කීවේ ය: 'ආයුෂ්මත්වරුනි, අද පටන් මා දවල් ආහාරයෙන් පසුව රාත්‍රියටත්, විකාල භෝජනයෙන් ද වැළකී එක් වේලක් පමණක් අනුභව කරන්නෙකු ලෙස සලකව්!' එකල්හි, ආනන්දය, ඒ පන්සියයකට අධික උපාසකවරුන්ට මෙසේ සිතිණි: 'ගවේසී පණ්ඩිතයන් වහන්සේ නියතයෙන් අපට බොහෝ උපකාරී වූ, පෙරමුණ ගන්නා වූ, අනුශාසනා කරන්නෙක් වන සේක. ගවේසී පණ්ඩිතයන් වහන්සේ නම් දවල් ආහාරයෙන් පසුව රාත්‍රියටත්, විකාල භෝජනයෙන් ද වැළකී එක් වේලක් පමණක් අනුභව කරන්නෙකු වනු ඇත. එසේ නම් අපි කුමකට ද?'\n\nඉක්බිති ආනන්දයෙනි, ඒ උපාසකවරු පන්සියය ගවේසී උපාසකයා යම් තැනක සිටියේද, එතැනට පැමිණියහ. පැමිණ ගවේසී උපාසකයාට මෙය කීහ: ‘පින්වත් ගවේසී, අද පටන් මේ උපාසකවරු පන්සියයද එක් වේලක් පමණක් වළඳන, රාත්‍රී භෝජනයෙන් වැළකී සිටින අය ලෙසින් පිළිගන්නා සේක්වා!’\n\nඑවිට ආනන්දයෙනි, ගවේසී උපාසකයාට මෙසේ සිතුණි: ‘මා මේ උපාසකවරු පන්සියයට මහත් උපකාර කළ, පෙරමුණ ගත්, යහපතෙහි පිහිටුවූ තැනැත්තෙක්මි. මා සිල් පිරීමෙහි පූර්ණත්වයට පැමිණියෙමි. මේ උපාසකවරු පන්සියයද සිල් පිරීමෙහි පූර්ණත්වයට පැමිණ සිටිති. මා ග්‍රාම්‍ය​ ධර්මය වූ මෛථුන සේවනයෙන් වැළකුණු, බ්‍රහ්මචාරීව, දුරුව වාසය කරන්නෙකි. මේ උපාසකවරු පන්සියයද ග්‍රාම්‍ය​ ධර්මය වූ මෛථුන සේවනයෙන් වැළකුණු, බ්‍රහ්මචාරීව, දුරුව වාසය කරන්නෝ වෙති. මා එක් වේලක් පමණක් වළඳන, රාත්‍රී භෝජනයෙන් වැළකුණු, විකාල භෝජනයෙන් වැළකුණු අයෙක්මි. මේ උපාසකවරු පන්සියයද එක් වේලක් පමණක් වළඳන, රාත්‍රී භෝජනයෙන් වැළකුණු, විකාල භෝජනයෙන් වැළකුණු අය වෙති. මේ සියල්ල සම සම ය, අතිරේක කිසිවක් නැත. එබැවින් මම තවදුරටත් උසස් දෙයක් සඳහා උත්සාහ කරමි!’\n\nඉක්බිති ආනන්දයෙනි, ගවේසී උපාසකයා කවර තැනක කස්සප භාග්‍ය​වත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ වැඩසිටියේද, එතැනට පැමිණියේය. පැමිණ, කස්සප භාග්‍ය​වත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට මෙය කීවේය: ‘භාග්‍ය​වතුන් වහන්ස, මට භාග්‍ය​වතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලැබීමටත්, උපසම්පදාව ලැබීමටත් අවසර ලැබේවා!’\n\nආනන්දයෙනි, ගවේසී උපාසකයාට කස්සප භාග්‍ය​වත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලැබුණි, උපසම්පදාවද ලැබුණි. ආනන්දයෙනි, නොබෝ කලකින් උපසම්පදා ලැබූ ගවේසී භික්ෂුව තනිව, කායිකව හා මානසිකව හුදෙකලා වූ, අප්‍රමාදීව, වීර්ය​වත්ව, මනා සේ වීර්ය​ යොදමින් වාසය කරමින් වැඩි කලක් යන්නට මත්තෙන් – යම් අරමුණක් උදෙසා කුලපුත්‍රයෝ මනා සේ ගිහි ගෙයින් නික්ම අනගාරික ජීවිතයට ඇතුළු වෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යාවේ අවසානය වූ අරහත්වය මේ ආත්මභාවයේදීම තමාගේම ප්‍රඥා​වෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, එයට පැමිණ වාසය කළේය. ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යා​ව වැස නිම කරන ලදී, කළ යුත්ත කරන ලදී, මින් මතු වෙනත් කිසිවක් මේ සඳහා (සංසාරය පිණිස) නැත’යි අවබෝධ කළේය. ආනන්දයෙනි, ගවේසී භික්ෂුවද රහතුන් වහන්සේ නමක් බවට පත් විය.\n\nඉක්බිති ආනන්දයෙනි, ඒ උපාසකවරු පන්සියයට මෙසේ සිතුණි: ‘පින්වත් ගවේසී වහන්සේ අපට මහත් උපකාර කළ, පෙරමුණ ගත්, යහපතෙහි පිහිටුවූ තැනැත්තෙක් විය. ඇත්ත වශයෙන්ම, පින්වත් ගවේසී වහන්සේ කෙස් රැවුල් බහා, කහ සිවුරු හැඳ, ගිහි ගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වූ සේක. එසේ නම් අපට කුමක් නොකළ හැකිද!’\n\nඉක්බිති ආනන්දයෙනි, ඒ උපාසකවරු පන්සියය කවර තැනක කස්සප භාග්‍ය​වත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ වැඩසිටියේද, එතැනට පැමිණියහ. පැමිණ, කස්සප භාග්‍ය​වත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට මෙය කීහ: ‘භාග්‍ය​වතුන් වහන්ස, අපට භාග්‍ය​වතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලැබීමටත්, උපසම්පදාව ලැබීමටත් අවසර ලැබේවා!’\n\nආනන්දයෙනි, ඒ උපාසකවරු පන්සියයට කස්සප භාග්‍ය​වත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලැබුණි, උපසම්පදාවද ලැබුණි.\n\nඉක්බිති ආනන්දයෙනි, ගවේසී භික්ෂුවට මෙසේ සිතුණි: ‘මා මේ අනුත්තර විමුක්ති සැපය කැමති පරිදි ලබන්නෙක් වෙමි, අපහසුවකින් තොරව ලබන්නෙක් වෙමි, දුෂ්කරතාවකින් තොරව ලබන්නෙක් වෙමි. අහෝ! මේ භික්ෂූන් වහන්සේලා පන්සියයද මේ අනුත්තර විමුක්ති සැපය කැමති පරිදි ලබන්නෝ, අපහසුවකින් තොරව ලබන්නෝ, දුෂ්කරතාවකින් තොරව ලබන්නෝ වෙත්වා!’\n\nඉක්බිති ආනන්දයෙනි, ඒ භික්ෂූන් වහන්සේලා පන්සියයද හුදෙකලාව, අප්‍රමාදීව, වීර්ය​වත්ව, මනා සේ වීර්ය​ යොදමින් වාසය කරමින් වැඩි කලක් යන්නට මත්තෙන් – යම් අරමුණක් උදෙසා කුලපුත්‍රයෝ මනා සේ ගිහි ගෙයින් නික්ම අනගාරික ජීවිතයට ඇතුළු වෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යා​වේ අවසානය වූ අරහත්වය මේ ආත්මභාවයේදීම තමාගේම ප්‍රඥා​වෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, එයට පැමිණ වාසය කළහ. ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යා​ව වැස නිම කරන ලදී, කළ යුත්ත කරන ලදී, මින් මතු වෙනත් කිසිවක් මේ සඳහා නැත’යි අවබෝධ කළහ.\n\nමේ අයුරින් ආනන්දයෙනි, ගවේසී භික්ෂුව ප්‍රමුඛ​ ඒ භික්ෂූන් වහන්සේලා පන්සියය, උසස් වූත්, ප්‍රණීත වූත් (තත්ත්වයන්) උදෙසා උත්සාහ කරමින්, අනුත්තර විමුක්තිය ප්‍රත්‍යක්ෂ කළහ. එබැවින් ආනන්දයෙනි, මෙසේ හික්මිය යුතුය: ‘උසස් වූත්, ප්‍රණීත වූත් (තත්ත්වයන්) උදෙසා උත්සාහ කරමින්, අනුත්තර විමුක්තිය ප්‍රත්‍යක්ෂ කරන්නෙමු’ කියාය. ආනන්දයෙනි, ඔබට මෙසේම හික්මිය යුතු වන්නේය.",
      "paliTitle": "Gavesīsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Upāsakavaggo tatiyo. Tassuddānaṃ – Sārajjaṃ visārado nirayaṃ, veraṃ caṇḍālapañcamaṃ; Pīti vaṇijjā rājāno, gihī ceva gavesināti.",
    "english": "",
    "sinhala": ""
  }
}