{
  "id": "an5.16",
  "title": {
    "pali": "Catutthapaṇṇāsakaṃ - Saddhammavaggo",
    "english": "The Fourth Fifties — The Chapter on the True Dhamma",
    "sinhala": "සිවුවන පණ්ණාසකය - ශ්‍රී සද්ධර්‍ම වග්ගය"
  },
  "sections": [
    {
      "number": 151,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Kathaṃ paribhoti, kathikaṃ [kathitaṃ (ka.)] paribhoti, attānaṃ paribhoti, vikkhittacitto dhammaṃ suṇāti, anekaggacitto ayoniso ca [ayoniso (syā. kaṃ.)] manasi karoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Na kathaṃ paribhoti, na kathikaṃ paribhoti, na attānaṃ paribhoti, avikkhittacitto dhammaṃ suṇāti, ekaggacitto yoniso ca manasi karoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Paṭhamaṃ.",
      "english": "Monks, one endowed with five qualities, even while listening to the True Dhamma, is incapable of entering the path of certainty to be established in wholesome states. Which five? He disdains the talk, he disdains the speaker, he disdains himself, he listens to the Dhamma with a distracted mind, and with a non-one-pointed mind, he reflects unwisely. Indeed, monks, one endowed with these five qualities, even while listening to the True Dhamma, is incapable of entering the path of certainty to be established in wholesome states.\n\nMonks, one endowed with five qualities, while listening to the True Dhamma, is capable of entering the path of certainty to be established in wholesome states. Which five? He does not disdain the talk, he does not disdain the speaker, he does not disdain himself, he listens to the Dhamma with an undistracted mind, and with a one-pointed mind, he reflects wisely. Indeed, monks, one endowed with these five qualities, while listening to the True Dhamma, is capable of entering the path of certainty to be established in wholesome states.",
      "sinhala": "‘‘භික්ෂූණි, යම් පුද්ගලයෙක් මේ පංච ධ‌ර්මයන්ගෙන් යුක්තව, සද්ධ‌ර්මය ශ්‍ර‌වණය කළත්, කුසල ධ‌ර්මයන්ගේ නිවැරදි භාවයෙහි ස්ථිරව පිහිටා, නියත මාර්ගයට පිවිසීමට අසමර්ථ වේ.\nඒ පංච ධ‌ර්මයෝ කවරහුද යත්? හෙතෙම කතාව පරිභව කරයි, දේශකයා පරිභව කරයි, තමා පරිභව කරයි, විසිරුණු සිතින් ධ‌ර්මය ශ්‍ර‌වණය කරයි, ඒකාග්‍ර‌ නො වූ සිතින් අයෝනිසෝව මෙනෙහි කරයි. භික්ෂූණි, මේ පංච ධ‌ර්මයන්ගෙන් යුක්ත වූ පුද්ගලයා, සද්ධ‌ර්මය ශ්‍ර‌වණය කළත්, කුසල ධ‌ර්මයන්ගේ නිවැරදි භාවයෙහි ස්ථිරව පිහිටා, නියත මාර්ගයට පිවිසීමට අසමර්ථ වන්නේය.\n\n‘‘භික්ෂූණි, යම් පුද්ගලයෙක් මේ පංච ධ‌ර්මයන්ගෙන් යුක්තව, සද්ධ‌ර්මය ශ්‍ර‌වණය කරන්නේ නම්, කුසල ධ‌ර්මයන්ගේ නිවැරදි භාවයෙහි ස්ථිරව පිහිටා, නියත මාර්ගයට පිවිසීමට සමර්ථ වේ.\nඒ පංච ධ‌ර්මයෝ කවරහුද යත්? හෙතෙම කතාව පරිභව නොකරයි, දේශකයා පරිභව නොකරයි, තමා පරිභව නොකරයි, නොවිසිරුණු සිතින් ධ‌ර්මය ශ්‍ර‌වණය කරයි, ඒකාග්‍ර‌ වූ සිතින් යෝනිසෝව මෙනෙහි කරයි. භික්ෂූණි, මේ පංච ධ‌ර්මයන්ගෙන් යුක්ත වූ පුද්ගලයා, සද්ධ‌ර්මය ශ්‍ර‌වණය කරන්නේ නම්, කුසල ධ‌ර්මයන්ගේ නිවැරදි භාවයෙහි ස්ථිරව පිහිටා, නියත මාර්ගයට පිවිසීමට සමර්ථ වන්නේය.",
      "paliTitle": "Paṭhamasammattaniyāmasuttaṃ",
      "englishTitle": "The First Discourse on the Assured Path of Rightness",
      "sinhalaTitle": "පළමු සම්මත්තනියාම සූත්‍රය"
    },
    {
      "number": 152,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Kathaṃ paribhoti, kathikaṃ paribhoti, attānaṃ paribhoti, duppañño hoti jaḷo eḷamūgo, anaññāte aññātamānī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Na kathaṃ paribhoti, na kathikaṃ paribhoti, na attānaṃ paribhoti, paññavā hoti ajaḷo aneḷamūgo, na anaññāte aññātamānī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Dutiyaṃ.",
      "english": "Monks, possessing five qualities, even while listening to the True Dhamma, one is incapable of entering the fixed path, of being established in wholesome states. Which five? One despises the discourse, one despises the speaker, one despises oneself, one is dull-witted, stupid, and utterly foolish, and one considers oneself to have understood what has not been understood. Possessing these five qualities, monks, even while listening to the True Dhamma, one is incapable of entering the fixed path, of being established in wholesome states.\n\nMonks, possessing five qualities, when listening to the True Dhamma, one is capable of entering the fixed path, of being established in wholesome states. Which five? One does not despise the discourse, one does not despise the speaker, one does not despise oneself, one is wise, not dull-witted, not utterly foolish, and one does not consider oneself to have understood what has not been understood. Possessing these five qualities, monks, when listening to the True Dhamma, one is capable of entering the fixed path, of being established in wholesome states.",
      "sinhala": "මහණෙනි, කරුණු පසකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කරතත් කුසල ධර්මයන්හි නියත බවටත්, ස්ථාවර බවටත් පිවිසීමට අපොහොසත් වෙයි. ඒ කවර පසකින්ද? දේශනාවට අපහාස කරයි, දේශකයාට අපහාස කරයි, තමාට අපහාස කරයි, දුෂ්ප්‍රාඥයෙක්, මොඩයෙක්, ගොළුවෙක් වෙයි, නොදන්නා දේ දනිමි යි මානයෙන් යුක්ත වෙයි. මහණෙනි, මේ කරුණු පසකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කරතත් කුසල ධර්මයන්හි නියත බවටත්, ස්ථාවර බවටත් පිවිසීමට අපොහොසත් වෙයි.\n\nමහණෙනි, කරුණු පසකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කරන කල්හි කුසල ධර්මයන්හි නියත බවටත්, ස්ථාවර බවටත් පිවිසීමට සමත් වෙයි. ඒ කවර පසකින්ද? දේශනාවට අපහාස නොකරයි, දේශකයාට අපහාස නොකරයි, තමාට අපහාස නොකරයි, ප්‍රාඥයෙක්, මොඩ නොවන, ගොළු නොවන තැනැත්තෙක් වෙයි, නොදන්නා දේ දනිමි යි මානයෙන් යුක්ත නොවේ. මහණෙනි, මේ කරුණු පසකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කරන කල්හි කුසල ධර්මයන්හි නියත බවටත්, ස්ථාවර බවටත් පිවිසීමට සමත් වෙයි.",
      "paliTitle": "Dutiyasammattaniyāmasuttaṃ",
      "englishTitle": "Second Sutta on the Certainty of Rightness",
      "sinhalaTitle": "දුතිය සම්මත්තනියාම සූත්‍රය"
    },
    {
      "number": 153,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Makkhī dhammaṃ suṇāti makkhapariyuṭṭhito, upārambhacitto [saupārambhacitto (syā. kaṃ.)] dhammaṃ suṇāti randhagavesī, dhammadesake āhatacitto hoti khīlajāto [khilajāto (syā. pī.)], duppañño hoti jaḷo eḷamūgo, anaññāte aññātamānī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi pañcahi? Amakkhī dhammaṃ suṇāti na makkhapariyuṭṭhito, anupārambhacitto dhammaṃ suṇāti na randhagavesī, dhammadesake anāhatacitto hoti akhīlajāto, paññavā hoti ajaḷo aneḷamūgo, na anaññāte aññātamānī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Tatiyaṃ.",
      "english": "Monks, a person endowed with five qualities, even while listening to the true Dhamma, is incapable of entering the fixed course of righteousness, of becoming established in wholesome states. What are these five? They listen to the Dhamma with denigration, overcome by denigration; they listen to the Dhamma with a fault-finding mind, seeking out flaws; their mind is hostile towards the Dhamma teacher, full of obstruction; they are dull-witted, stupid, and like a dumb animal; and they consider themselves to have understood what they have not understood. Monks, a person endowed with these five qualities, even while listening to the true Dhamma, is incapable of entering the fixed course of righteousness, of becoming established in wholesome states.\n\nMonks, a person endowed with five qualities, listening to the true Dhamma, is capable of entering the fixed course of righteousness, of becoming established in wholesome states. What are these five? They listen to the Dhamma without denigration, not overcome by denigration; they listen to the Dhamma with a non-fault-finding mind, not seeking out flaws; their mind is not hostile towards the Dhamma teacher, not full of obstruction; they are wise, not stupid, and not like a dumb animal; and they do not consider themselves to have understood what they have not understood. Monks, a person endowed with these five qualities, listening to the true Dhamma, is capable of entering the fixed course of righteousness, of becoming established in wholesome states.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍ර​වණය කළද කුසල ධර්මයන්හි සම්‍යක්‍​ත්වයට පැමිණීමට අපොහොසත් වෙයි. ඒ කවර කරුණු පහකින්ද? ගුණමකුකමින් පිරුණු සිතින් ධර්මය ශ්‍ර​වණය කරයි, වරදක් සොයමින්, චෝදනා කිරීමේ සිතින් ධර්මය ශ්‍ර​වණය කරයි, ධර්මදේශකයා කෙරෙහි ගැටුණු සිතින්, සිත් මළ බැඳුණු තැනැත්තෙක් වෙයි, ප්‍ර​ඥාවෙන් දුර්වල වූ, මෝඩ, ගොළු තැනැත්තෙක් වෙයි, නොදන්නා දෙයෙහි ‘මම දනිමි’ යන මානයෙන් යුක්ත වෙයි. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍ර​වණය කළද කුසල ධර්මයන්හි සම්‍යක්‍​ත්වයට පැමිණීමට අපොහොසත් වෙයි.\n\nමහණෙනි, කරුණු පහකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍ර​වණය කරන්නේ නම් කුසල ධර්මයන්හි සම්‍යක්‍​ත්වයට පැමිණීමට සමත් වෙයි. ඒ කවර කරුණු පහකින්ද? ගුණමකුකමින් තොරව, මක්ඛයෙන් යටපත් නොවූ සිතින් ධර්මය ශ්‍ර​වණය කරයි, වරදක් නොසොයමින්, චෝදනා කිරීමේ සිතින් තොරව ධර්මය ශ්‍ර​වණය කරයි, ධර්මදේශකයා කෙරෙහි ගැටුණු සිතක් නැති, සිත් මළ නොබැඳුණු තැනැත්තෙක් වෙයි, ප්‍ර​ඥාවෙන් යුක්ත වූ, මොට නොවූ, ගොළු නොවූ තැනැත්තෙක් වෙයි, නොදන්නා දෙයෙහි ‘මම දනිමි’ යන මානයෙන් තොර වෙයි. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍ර​වණය කරන්නේ නම් කුසල ධර්මයන්හි සම්‍යක්‍​ත්වයට පැමිණීමට සමත් වෙයි.",
      "paliTitle": "Tatiyasammattaniyāmasuttaṃ",
      "englishTitle": "Third Discourse on the Certainty of Rightness",
      "sinhalaTitle": "තතිය සම්මත්තනියාම සූත්‍රය"
    },
    {
      "number": 154,
      "pali": "‘‘Pañcime, bhikkhave, dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame pañca? Idha, bhikkhave, bhikkhū na sakkaccaṃ dhammaṃ suṇanti, na sakkaccaṃ dhammaṃ pariyāpuṇanti, na sakkaccaṃ dhammaṃ dhārenti, na sakkaccaṃ dhātānaṃ [dhatānaṃ (sī. syā. kaṃ. pī.)] dhammānaṃ atthaṃ upaparikkhanti, na sakkaccaṃ atthamaññāya dhammamaññāya dhammānudhammaṃ paṭipajjanti. Ime kho, bhikkhave, pañca dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. ‘‘Pañcime, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame pañca? Idha, bhikkhave, bhikkhū sakkaccaṃ dhammaṃ suṇanti, sakkaccaṃ dhammaṃ pariyāpuṇanti, sakkaccaṃ dhammaṃ dhārenti, sakkaccaṃ dhātānaṃ dhammānaṃ atthaṃ upaparikkhanti, sakkaccaṃ atthamaññāya dhammamaññāya dhammānudhammaṃ paṭipajjanti. Ime kho, bhikkhave, pañca dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. Catutthaṃ.",
      "english": "Monks, these five things lead to the confounding and disappearance of the True Dhamma. Which five? Here, monks, monastics do not listen to the Dhamma with earnest intent; they do not master the Dhamma with earnest intent; they do not retain the Dhamma with earnest intent; they do not investigate the meaning of the Dhamma they have retained with earnest intent; and having discerned neither the meaning nor the Dhamma itself, they do not practice in accordance with the Dhamma with earnest intent. Indeed, monks, these five things lead to the confounding and disappearance of the True Dhamma.\n\nMonks, these five things lead to the establishment, non-confounding, and non-disappearance of the True Dhamma. Which five? Here, monks, monastics listen to the Dhamma with earnest intent; they master the Dhamma with earnest intent; they retain the Dhamma with earnest intent; they investigate the meaning of the Dhamma they have retained with earnest intent; and having discerned the meaning and discerned the Dhamma itself, they practice in accordance with the Dhamma with earnest intent. Indeed, monks, these five things lead to the establishment, non-confounding, and non-disappearance of the True Dhamma.",
      "sinhala": "මහණෙනි, මේ ධර්ම කරුණු පහක් සද්ධර්මය අවුල් වී නොපෙනී යාමටත්, අතුරුදහන් වී යාමටත් හේතු වෙති. ඒ පහ කවරේද? මහණෙනි, මෙහිලා භික්ෂූන් වහන්සේලා ගෞරවයෙන් ධර්මය ශ්‍රවණය නොකරති, ගෞරවයෙන් ධර්මය ඉගෙන නොගනිති, ගෞරවයෙන් ධර්මය මතකයේ රඳවා නොගනිති, ගෞරවයෙන් මතකයේ රඳවාගත් ධර්මයන්ගේ අර්ථය විමසා නොබලති, ගෞරවයෙන් අර්ථයත් ධර්මයත් අවබෝධ කරගෙන, ධර්මානුධර්ම වූ ප්‍රතිපදාවේ නොපිහිටති. මහණෙනි, මේ ධර්ම කරුණු පහ සද්ධර්මය අවුල් වී නොපෙනී යාමටත්, අතුරුදහන් වී යාමටත් හේතු වෙති.\n\nමහණෙනි, මේ ධර්ම කරුණු පහක් සද්ධර්මය ස්ථාවරව පැවතීමටත්, අවුල් වී නොපෙනී නොයාමටත්, අතුරුදහන් වී නොයාමටත් හේතු වෙති. ඒ පහ කවරේද? මහණෙනි, මෙහිලා භික්ෂූන් වහන්සේලා ගෞරවයෙන් ධර්මය ශ්‍රවණය කරති, ගෞරවයෙන් ධර්මය ඉගෙන ගනිති, ගෞරවයෙන් ධර්මය මතකයේ රඳවා ගනිති, ගෞරවයෙන් මතකයේ රඳවාගත් ධර්මයන්ගේ අර්ථය විමසා බලති, ගෞරවයෙන් අර්ථයත් ධර්මයත් අවබෝධ කරගෙන, ධර්මානුධර්ම වූ ප්‍රතිපදාවේ පිහිටති. මහණෙනි, මේ ධර්ම කරුණු පහ සද්ධර්මය ස්ථාවරව පැවතීමටත්, අවුල් වී නොපෙනී නොයාමටත්, අතුරුදහන් වී නොයාමටත් හේතු වෙති.",
      "paliTitle": "Paṭhamasaddhammasammosasuttaṃ",
      "englishTitle": "The First Discourse on the Disappearance of the True Dhamma",
      "sinhalaTitle": "පළමු සද්ධම්මසම්මෝස සූත්‍රය"
    },
    {
      "number": 155,
      "pali": "‘‘Pañcime, bhikkhave, dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame pañca? Idha, bhikkhave, bhikkhū dhammaṃ na pariyāpuṇanti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Ayaṃ, bhikkhave, paṭhamo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ na vitthārena paresaṃ desenti. Ayaṃ, bhikkhave, dutiyo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ na vitthārena paraṃ [paresaṃ (sī. syā. kaṃ. pī.), pare (?)] vācenti. Ayaṃ, bhikkhave, tatiyo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ na vitthārena sajjhāyaṃ karonti. Ayaṃ, bhikkhave, catuttho dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ na cetasā anuvitakkenti anuvicārenti manasānupekkhanti. Ayaṃ, bhikkhave, pañcamo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. Ime kho, bhikkhave, pañca dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. ‘‘Pañcime, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame pañca? Idha, bhikkhave, bhikkhū dhammaṃ pariyāpuṇanti – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthaṃ, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Ayaṃ, bhikkhave, paṭhamo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ desenti. Ayaṃ, bhikkhave, dutiyo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paraṃ vācenti. Ayaṃ, bhikkhave, tatiyo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karonti. Ayaṃ, bhikkhave, catuttho dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakkenti anuvicārenti manasānupekkhanti. Ayaṃ, bhikkhave, pañcamo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. Ime kho, bhikkhave, pañca dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. Pañcamaṃ.",
      "english": "Monks, these five things lead to the confusion and disappearance of the True Dhamma. Which five?\n\nHere, monks, monastics do not learn the Dhamma – the discourses in prose, the mixed prose and verse, the expositions, the verses, the inspired utterances, the 'Thus-saids,' the birth stories, the wondrous phenomena, and the question-and-answer discourses. This, monks, is the first thing that leads to the confusion and disappearance of the True Dhamma.\n\nFurthermore, monks, monastics do not teach to others in detail the Dhamma as they have heard and learned it. This, monks, is the second thing that leads to the confusion and disappearance of the True Dhamma.\n\nFurthermore, monks, monastics do not recite or instruct others in detail in the Dhamma as they have heard and learned it. This, monks, is the third thing that leads to the confusion and disappearance of the True Dhamma.\n\nFurthermore, monks, monastics do not recite or chant in detail the Dhamma as they have heard and learned it. This, monks, is the fourth thing that leads to the confusion and disappearance of the True Dhamma.\n\nFurthermore, monks, monastics do not contemplate, examine, and reflect mentally upon the Dhamma as they have heard and learned it. This, monks, is the fifth thing that leads to the confusion and disappearance of the True Dhamma. These five things, monks, lead to the confusion and disappearance of the True Dhamma.\n\nMonks, these five things lead to the endurance, non-confusion, and non-disappearance of the True Dhamma. Which five?\n\nHere, monks, monastics learn the Dhamma – the discourses in prose, the mixed prose and verse, the expositions, the verses, the inspired utterances, the 'Thus-saids,' the birth stories, the wondrous phenomena, and the question-and-answer discourses. This, monks, is the first thing that leads to the endurance, non-confusion, and non-disappearance of the True Dhamma.\n\nFurthermore, monks, monastics teach to others in detail the Dhamma as they have heard and learned it. This, monks, is the second thing that leads to the endurance, non-confusion, and non-disappearance of the True Dhamma.\n\nFurthermore, monks, monastics recite or instruct others in detail in the Dhamma as they have heard and learned it. This, monks, is the third thing that leads to the endurance, non-confusion, and non-disappearance of the True Dhamma.\n\nFurthermore, monks, monastics recite or chant in detail the Dhamma as they have heard and learned it. This, monks, is the fourth thing that leads to the endurance, non-confusion, and non-disappearance of the True Dhamma.\n\nFurthermore, monks, monastics contemplate, examine, and reflect mentally upon the Dhamma as they have heard and learned it. This, monks, is the fifth thing that leads to the endurance, non-confusion, and non-disappearance of the True Dhamma. These five things, monks, lead to the endurance, non-confusion, and non-disappearance of the True Dhamma.",
      "sinhala": "භික්‍ෂූණි, මේ ධර්ම කරුණු පහ සද්ධර්මය මුළාවට පත්වීමටත්, අතුරුදහන්ව යෑමටත් හේතු වෙයි. ඒ පහ කවරේද?\n\nමෙහිදී, භික්‍ෂූණි, භික්‍ෂූන් සූත‍්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම සහ වේදල්ල යන නව අංගයෙන් යුත් ධර්මය හදාරා නොගනිති. භික්‍ෂූණි, මේ පළමු ධර්ම කරුණ සද්ධර්මය මුළාවට පත්වීමටත්, අතුරුදහන්ව යෑමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය අන් අයට විස්තර වශයෙන් දේශනා නොකරති. භික්‍ෂූණි, මේ දෙවෙනි ධර්ම කරුණ සද්ධර්මය මුළාවට පත්වීමටත්, අතුරුදහන්ව යෑමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය අන් අයට විස්තර වශයෙන් කියවා නොදෙති. භික්‍ෂූණි, මේ තුන්වෙනි ධර්ම කරුණ සද්ධර්මය මුළාවට පත්වීමටත්, අතුරුදහන්ව යෑමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය විස්තර වශයෙන් මෙනෙහි කරමින් සාජ්ඣායනා නොකරති. භික්‍ෂූණි, මේ සිව්වෙනි ධර්ම කරුණ සද්ධර්මය මුළාවට පත්වීමටත්, අතුරුදහන්ව යෑමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය සිතින් මෙනෙහි කරමින්, විමර්ශනය කරමින්, නුවණින් විමසා නොබලති. භික්‍ෂූණි, මේ පස්වෙනි ධර්ම කරුණ සද්ධර්මය මුළාවට පත්වීමටත්, අතුරුදහන්ව යෑමටත් හේතු වෙයි. භික්‍ෂූණි, මේ ධර්ම කරුණු පහ සද්ධර්මය මුළාවට පත්වීමටත්, අතුරුදහන්ව යෑමටත් හේතු වෙයි.\n\nභික්‍ෂූණි, මේ ධර්ම කරුණු පහ සද්ධර්මය ස්ථාවරව පැවතීමටත්, මුළා නොවී පවත්නා බවටත්, අතුරුදහන් නොවී පැවතීමටත් හේතු වෙයි. ඒ පහ කවරේද?\n\nමෙහිදී, භික්‍ෂූණි, භික්‍ෂූන් සූත‍්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම සහ වේදල්ල යන නව අංගයෙන් යුත් ධර්මය හදාරා ගනිති. භික්‍ෂූණි, මේ පළමු ධර්ම කරුණ සද්ධර්මය ස්ථාවරව පැවතීමටත්, මුළා නොවී පවත්නා බවටත්, අතුරුදහන් නොවී පැවතීමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය අන් අයට විස්තර වශයෙන් දේශනා කරති. භික්‍ෂූණි, මේ දෙවෙනි ධර්ම කරුණ සද්ධර්මය ස්ථාවරව පැවතීමටත්, මුළා නොවී පවත්නා බවටත්, අතුරුදහන් නොවී පැවතීමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය අන් අයට විස්තර වශයෙන් කියවා දෙති. භික්‍ෂූණි, මේ තුන්වෙනි ධර්ම කරුණ සද්ධර්මය ස්ථාවරව පැවතීමටත්, මුළා නොවී පවත්නා බවටත්, අතුරුදහන් නොවී පැවතීමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය විස්තර වශයෙන් මෙනෙහි කරමින් සාජ්ඣායනා කරති. භික්‍ෂූණි, මේ සිව්වෙනි ධර්ම කරුණ සද්ධර්මය ස්ථාවරව පැවතීමටත්, මුළා නොවී පවත්නා බවටත්, අතුරුදහන් නොවී පැවතීමටත් හේතු වෙයි. තවද, භික්‍ෂූණි, භික්‍ෂූන් අසා දැනගත්, අධ්‍යයනය කළ ධර්මය සිතින් මෙනෙහි කරමින්, විමර්ශනය කරමින්, නුවණින් විමසා බලති. භික්‍ෂූණි, මේ පස්වෙනි ධර්ම කරුණ සද්ධර්මය ස්ථාවරව පැවතීමටත්, මුළා නොවී පවත්නා බවටත්, අතුරුදහන් නොවී පැවතීමටත් හේතු වෙයි. භික්‍ෂූණි, මේ ධර්ම කරුණු පහ සද්ධර්මය ස්ථාවරව පැවතීමටත්, මුළා නොවී පවත්නා බවටත්, අතුරුදහන් නොවී පැවතීමටත් හේතු වෙයි.",
      "paliTitle": "Dutiyasaddhammasammosasuttaṃ",
      "englishTitle": "Second Sutta on the Confusion of the True Dhamma",
      "sinhalaTitle": "දුතිය සද්ධම්මසම්මෝස සූත්‍රය"
    },
    {
      "number": 156,
      "pali": "[a. ni. 4.160] ‘‘Pañcime, bhikkhave, dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame pañca? Idha, bhikkhave, bhikkhū duggahitaṃ suttantaṃ pariyāpuṇanti dunnikkhittehi padabyañjanehi. Dunnikkhittassa, bhikkhave, padabyañjanassa atthopi dunnayo hoti. Ayaṃ, bhikkhave, paṭhamo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū dubbacā honti, dovacassakaraṇehi dhammehi samannāgatā, akkhamā appadakkhiṇaggāhino anusāsaniṃ. Ayaṃ, bhikkhave, dutiyo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te na sakkaccaṃ suttantaṃ paraṃ vācenti; tesaṃ accayena chinnamūlako suttanto hoti appaṭisaraṇo. Ayaṃ, bhikkhave, tatiyo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, therā bhikkhū bāhulikā honti sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā, na vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti bāhulikā sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ, bhikkhave, catuttho dhammo saddhammassa sammosāya antaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, saṅgho bhinno hoti. Saṅghe kho pana, bhikkhave, bhinne aññamaññaṃ akkosā ca honti, aññamaññaṃ paribhāsā ca honti, aññamaññaṃ parikkhepā ca honti, aññamaññaṃ pariccajanā [pariccajā (syā. kaṃ.)] ca honti. Tattha appasannā ceva nappasīdanti, pasannānañca ekaccānaṃ aññathattaṃ hoti. Ayaṃ, bhikkhave, pañcamo dhammo saddhammassa sammosāya antaradhānāya saṃvattati. Ime kho, bhikkhave, pañca dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. ‘‘Pañcime, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame pañca? Idha, bhikkhave, bhikkhū suggahitaṃ suttantaṃ pariyāpuṇanti sunikkhittehi padabyañjanehi. Sunikkhittassa, bhikkhave, padabyañjanassa atthopi sunayo hoti. Ayaṃ, bhikkhave, paṭhamo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhū suvacā honti sovacassakaraṇehi dhammehi samannāgatā, khamā padakkhiṇaggāhino anusāsaniṃ. Ayaṃ, bhikkhave, dutiyo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā, te sakkaccaṃ suttantaṃ paraṃ vācenti; tesaṃ accayena na chinnamūlako [acchinnamūlako (ka.) a. ni. 4.160] suttanto hoti sappaṭisaraṇo. Ayaṃ, bhikkhave, tatiyo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, therā bhikkhū na bāhulikā honti na sāthalikā, okkamane nikkhittadhurā paviveke pubbaṅgamā; vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti na bāhulikā na sāthalikā, okkamane nikkhittadhurā paviveke pubbaṅgamā, vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ, bhikkhave, catuttho dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, saṅgho samaggo sammodamāno avivadamāno ekuddeso phāsuṃ viharati. Saṅghe kho pana, bhikkhave, samagge na ceva aññamaññaṃ akkosā honti, na ca aññamaññaṃ paribhāsā honti, na ca aññamaññaṃ parikkhepā honti, na ca aññamaññaṃ pariccajanā honti. Tattha appasannā ceva pasīdanti, pasannānañca bhiyyobhāvo hoti. Ayaṃ, bhikkhave, pañcamo dhammo saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattati. Ime kho, bhikkhave, pañca dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. Chaṭṭhaṃ.",
      "english": "Monastics, these five things lead to the bewilderment and disappearance of the True Dhamma. Which five?\n\nHere, monastics, monastics learn suttas incorrectly, with poorly arranged words and phrases. Monastics, when words and phrases are poorly arranged, their meaning is difficult to comprehend. This, monastics, is the first factor that leads to the bewilderment and disappearance of the True Dhamma.\n\nFurthermore, monastics, monastics are difficult to admonish, endowed with qualities that make them difficult to admonish, impatient, and ungraciously accepting of instruction. This, monastics, is the second factor that leads to the bewilderment and disappearance of the True Dhamma.\n\nFurthermore, monastics, those monastics who are learned, who have mastered the traditions, who are upholders of the Dhamma, upholders of the Vinaya, upholders of the mātikā, do not seriously teach the suttas to others. After their passing, the suttas become uprooted and without refuge. This, monastics, is the third factor that leads to the bewilderment and disappearance of the True Dhamma.\n\nFurthermore, monastics, elder monastics are given to busyness, are indolent, are foremost in engaging with the world, having cast off the burden of solitude, and they do not arouse energy for the attainment of the unobtained, for the comprehension of the uncomprehended, for the realization of the unrealized. The later generations follow their example. They too become given to busyness, indolent, foremost in engaging with the world, having cast off the burden of solitude, and they do not arouse energy for the attainment of the unobtained, for the comprehension of the uncomprehended, for the realization of the unrealized. This, monastics, is the fourth factor that leads to the bewilderment and disappearance of the True Dhamma.\n\nFurthermore, monastics, the Saṅgha is divided. When the Saṅgha is divided, monastics, there are mutual insults, mutual disparagements, mutual ostracism, and mutual abandonment. In such a situation, those who are not devoted do not become devoted, and some of those who are devoted change their minds. This, monastics, is the fifth factor that leads to the bewilderment and disappearance of the True Dhamma. These, monastics, are the five factors that lead to the bewilderment and disappearance of the True Dhamma.\n\nMonastics, these five things lead to the persistence, non-bewilderment, and non-disappearance of the True Dhamma. Which five?\n\nHere, monastics, monastics learn suttas correctly, with well-arranged words and phrases. Monastics, when words and phrases are well-arranged, their meaning is easy to comprehend. This, monastics, is the first factor that leads to the persistence, non-bewilderment, and non-disappearance of the True Dhamma.\n\nFurthermore, monastics, monastics are easy to admonish, endowed with qualities that make them easy to admonish, patient, and graciously accepting of instruction. This, monastics, is the second factor that leads to the persistence, non-bewilderment, and non-disappearance of the True Dhamma.\n\nFurthermore, monastics, those monastics who are learned, who have mastered the traditions, who are upholders of the Dhamma, upholders of the Vinaya, upholders of the mātikā, diligently teach the suttas to others. After their passing, the suttas are not uprooted and remain with refuge. This, monastics, is the third factor that leads to the persistence, non-bewilderment, and non-disappearance of the True Dhamma.\n\nFurthermore, monastics, elder monastics are not given to busyness, are not indolent, having cast off the burden of engaging with the world, are foremost in solitude, and they arouse energy for the attainment of the unobtained, for the comprehension of the uncomprehended, for the realization of the unrealized. The later generations follow their example. They too become not given to busyness, not indolent, having cast off the burden of engaging with the world, foremost in solitude, and they arouse energy for the attainment of the unobtained, for the comprehension of the uncomprehended, for the realization of the unrealized. This, monastics, is the fourth factor that leads to the persistence, non-bewilderment, and non-disappearance of the True Dhamma.\n\nFurthermore, monastics, the Saṅgha is unified, harmonious, not disputing, with a single aim, dwelling at ease. When the Saṅgha is unified, monastics, there are no mutual insults, no mutual disparagements, no mutual ostracism, and no mutual abandonment. In such a situation, those who are not devoted become devoted, and the devoted become even more numerous. This, monastics, is the fifth factor that leads to the persistence, non-bewilderment, and non-disappearance of the True Dhamma. These, monastics, are the five factors that lead to the persistence, non-bewilderment, and non-disappearance of the True Dhamma.",
      "sinhala": "භික්‍ෂූනි, මේ ධර්ම කරුණු පහක් සද්ධර්මයේ ව්‍යාකූලත්වයටත්, අතුරුදන්වීමටත් හේතු වෙයි. ඒ කරුණු පහ කවරේද? භික්‍ෂූනි, මෙහිලා භික්‍ෂූන් වහන්සේලා වැරදි ලෙස අල්ලාගත්, නොමනා ලෙස පද සහ අක්‍ෂර විග්‍රහ කරන ලද සූත්‍ර දේශනා උගෙන ගනිති. භික්‍ෂූනි, නොමනා ලෙස පද සහ අක්‍ෂර විග්‍රහ කරන ලද දේක අර්ථය ද තේරුම් ගැනීමට අපහසු වෙයි. භික්‍ෂූනි, සද්ධර්මයේ ව්‍යාකූලත්වයටත්, අතුරුදන්වීමටත් හේතු වන පළමු කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, භික්‍ෂූන් වහන්සේලා අවවාද කිරීමට අපහසු අය වෙති. එනම්, ඔවුහු අවවාද කිරීමට අපහසු වන ධර්මයන්ගෙන් යුක්ත වෙති; අනුශාසනා ඉවසා දරා නොගන්නා, නිසි ලෙස පිළිගන්නට අසමත් වූවෝ වෙති. භික්‍ෂූනි, සද්ධර්මයේ ව්‍යාකූලත්වයටත්, අතුරුදන්වීමටත් හේතු වන දෙවන කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, යම් භික්‍ෂූන් වහන්සේලා බොහෝ දේ අසා උගත්, ආගමික ග්‍රන්ථ අවබෝධ කරගත්, ධර්මය දරන, විනය දරන, මූලික ධර්ම මාතෘකා දන්නා අය වෙත්ද, ඔවුහු අන් අයට සූත්‍ර දේශනා නිසි ලෙස උගන්වන්නේ නැත. ඔවුන්ගේ වියෝවෙන් පසු සූත්‍රය මුලින් සිඳී ගිය එකක් බවට පත්වෙයි, පිහිටක් නැති එකක් බවට පත්වෙයි. භික්‍ෂූනි, සද්ධර්මයේ ව්‍යාකූලත්වයටත්, අතුරුදන්වීමටත් හේතු වන තුන්වන කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, ථේර භික්‍ෂූන් වහන්සේලා බොහෝ දේවලට බරවූ, කම්මැළි වූ, ජනයා අතරට යෑමට පෙරමුණ ගන්නා, හුදෙකලාවීමට අකමැති වූ අය වෙති; තවම නොලැබූ අර්හත්වය ලැබීම පිණිස, තවම අවබෝධ නොකළ සත්‍ය අවබෝධ කරගැනීම පිණිස, තවම ප්‍රත්‍යක්‍ෂ නොකළ නිර්වාණය ප්‍රත්‍යක්‍ෂ කරගැනීම පිණිස වීර්යය ආරම්භ නොකරති. ඔවුන්ගේ පසුව එන පිරිස ද ඔවුන්ගේ අදහස් අනුව යති. ඒ පිරිස ද බොහෝ දේවලට බරවූ, කම්මැළි වූ, ජනයා අතරට යෑමට පෙරමුණ ගන්නා, හුදෙකලාවීමට අකමැති වූ පිරිසක් වෙති; තවම නොලැබූ අර්හත්වය ලැබීම පිණිස, තවම අවබෝධ නොකළ සත්‍ය අවබෝධ කරගැනීම පිණිස, තවම ප්‍රත්‍යක්‍ෂ නොකළ නිර්වාණය ප්‍රත්‍යක්‍ෂ කරගැනීම පිණිස වීර්යය ආරම්භ නොකරති. භික්‍ෂූනි, සද්ධර්මයේ ව්‍යාකූලත්වයටත්, අතුරුදන්වීමටත් හේතු වන සිව්වන කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, සංඝයා වහන්සේලා භේද වී සිටිති. භික්‍ෂූනි, සංඝයා වහන්සේලා භේද වී සිටින කල්හි එකිනෙකාට දොස් නැගීම් ද, එකිනෙකාට නින්දා කිරීම් ද, එකිනෙකාට අපහාස කිරීම් ද, එකිනෙකා ප්‍රතික්‍ෂේප කිරීම් ද සිදුවෙයි. එහිදී පැහැදීමක් නැති අය කිසිසේත් නොපැහැදෙති; පැහැදුණු අයගෙන් ඇතැමෙකුගේ සිත වෙනස් වෙයි. භික්‍ෂූනි, සද්ධර්මයේ ව්‍යාකූලත්වයටත්, අතුරුදන්වීමටත් හේතු වන පස්වන කරුණ මෙයයි. භික්‍ෂූනි, සද්ධර්මයේ ව්‍යාකූලත්වයටත්, අතුරුදන්වීමටත් හේතු වන මේ ධර්ම කරුණු පහ මෙයයි.\n\nභික්‍ෂූනි, මේ ධර්ම කරුණු පහක් සද්ධර්මයේ පැවැත්මට, නොපිරිහීමට සහ අතුරුදන් නොවීම පිණිස හේතු වෙයි. ඒ කරුණු පහ කවරේද? භික්‍ෂූනි, මෙහිලා භික්‍ෂූන් වහන්සේලා මනා ලෙස අල්ලාගත්, මනා ලෙස පද සහ අක්‍ෂර විග්‍රහ කරන ලද සූත්‍ර දේශනා උගෙන ගනිති. භික්‍ෂූනි, මනා ලෙස පද සහ අක්‍ෂර විග්‍රහ කරන ලද දේක අර්ථය ද තේරුම් ගැනීමට පහසු වෙයි. භික්‍ෂූනි, සද්ධර්මයේ පැවැත්මට, නොපිරිහීමට සහ අතුරුදන් නොවීම පිණිස හේතු වන පළමු කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, භික්‍ෂූන් වහන්සේලා අවවාද කිරීමට පහසු අය වෙති. එනම්, ඔවුහු අවවාද කිරීමට පහසු වන ධර්මයන්ගෙන් යුක්ත වෙති; අනුශාසනා ඉවසා දරා ගන්නා, නිසි ලෙස පිළිගන්නා අය වෙති. භික්‍ෂූනි, සද්ධර්මයේ පැවැත්මට, නොපිරිහීමට සහ අතුරුදන් නොවීම පිණිස හේතු වන දෙවන කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, යම් භික්‍ෂූන් වහන්සේලා බොහෝ දේ අසා උගත්, ආගමික ග්‍රන්ථ අවබෝධ කරගත්, ධර්මය දරන, විනය දරන, මූලික ධර්ම මාතෘකා දන්නා අය වෙත්ද, ඔවුහු අන් අයට සූත්‍ර දේශනා නිසි ලෙස උගන්වති. ඔවුන්ගේ වියෝවෙන් පසු සූත්‍රය මුලින් සිඳී නොගිය එකක් බවට පත්වෙයි, පිහිටක් ඇති එකක් බවට පත්වෙයි. භික්‍ෂූනි, සද්ධර්මයේ පැවැත්මට, නොපිරිහීමට සහ අතුරුදන් නොවීම පිණිස හේතු වන තුන්වන කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, ථේර භික්‍ෂූන් වහන්සේලා බොහෝ දේවලට බර නොවූ, කම්මැළි නොවන, ජනයා අතරට යෑමට අකමැති වූ, හුදෙකලාවීමට පෙරමුණ ගන්නා අය වෙති; තවම නොලැබූ අර්හත්වය ලැබීම පිණිස, තවම අවබෝධ නොකළ සත්‍ය අවබෝධ කරගැනීම පිණිස, තවම ප්‍රත්‍යක්‍ෂ නොකළ නිර්වාණය ප්‍රත්‍යක්‍ෂ කරගැනීම පිණිස වීර්යය ආරම්භ කරති. ඔවුන්ගේ පසුව එන පිරිස ද ඔවුන්ගේ අදහස් අනුව යති. ඒ පිරිස ද බොහෝ දේවලට බර නොවූ, කම්මැළි නොවන, ජනයා අතරට යෑමට අකමැති වූ, හුදෙකලාවීමට පෙරමුණ ගන්නා පිරිසක් වෙති; තවම නොලැබූ අර්හත්වය ලැබීම පිණිස, තවම අවබෝධ නොකළ සත්‍ය අවබෝධ කරගැනීම පිණිස, තවම ප්‍රත්‍යක්‍ෂ නොකළ නිර්වාණය ප්‍රත්‍යක්‍ෂ කරගැනීම පිණිස වීර්යය ආරම්භ කරති. භික්‍ෂූනි, සද්ධර්මයේ පැවැත්මට, නොපිරිහීමට සහ අතුරුදන් නොවීම පිණිස හේතු වන සිව්වන කරුණ මෙයයි.\n\nභික්‍ෂූනි, තවද, සංඝයා වහන්සේලා සමගි වී, සාමකාමීව, විවාද නොකරමින්, එකම අරමුණකින් යුක්තව සුවසේ වාසය කරති. භික්‍ෂූනි, සංඝයා වහන්සේලා සමගි වී සිටින කල්හි එකිනෙකාට දොස් නැගීම් ද, එකිනෙකාට නින්දා කිරීම් ද, එකිනෙකාට අපහාස කිරීම් ද, එකිනෙකා ප්‍රතික්‍ෂේප කිරීම් ද සිදුවන්නේ නැත. එහිදී පැහැදීමක් නැති අය ද පැහැදෙති; පැහැදුණු අයගේ සිත තවත් වැඩිදියුණු වෙයි. භික්‍ෂූනි, සද්ධර්මයේ පැවැත්මට, නොපිරිහීමට සහ අතුරුදන් නොවීම පිණිස හේතු වන පස්වන කරුණ මෙයයි. භික්‍ෂූනි, සද්ධර්මයේ පැවැත්මට, නොපිරිහීමට සහ අතුරුදන් නොවීම පිණිස හේතු වන මේ ධර්ම කරුණු පහ මෙයයි.",
      "paliTitle": "Tatiyasaddhammasammosasuttaṃ",
      "englishTitle": "Third Discourse on the Disappearance of the True Dhamma",
      "sinhalaTitle": "තතිය සද්ධම්මසම්මෝස සූත්‍රය"
    },
    {
      "number": 157,
      "pali": "‘‘Pañcannaṃ, bhikkhave, puggalānaṃ kathā dukkathā puggale puggalaṃ [puggalaṃ puggalaṃ (sī. pī.)] upanidhāya. Katamesaṃ pañcannaṃ? Assaddhassa, bhikkhave, saddhākathā dukkathā; dussīlassa sīlakathā dukkathā; appassutassa bāhusaccakathā dukkathā; maccharissa [macchariyassa (sī. pī. ka.)] cāgakathā dukkathā; duppaññassa paññākathā dukkathā. ‘‘Kasmā ca, bhikkhave, assaddhassa saddhākathā dukkathā? Assaddho, bhikkhave, saddhākathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, saddhāsampadaṃ attani na samanupassati [na sampassati (sī.)], na ca labhati tatonidānaṃ pītipāmojjaṃ. Tasmā assaddhassa saddhākathā dukkathā. ‘‘Kasmā ca, bhikkhave, dussīlassa sīlakathā dukkathā? Dussīlo, bhikkhave, sīlakathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, sīlasampadaṃ attani na samanupassati na ca labhati tatonidānaṃ pītipāmojjaṃ. Tasmā dussīlassa sīlakathā dukkathā. ‘‘Kasmā ca, bhikkhave, appassutassa bāhusaccakathā dukkathā? Appassuto, bhikkhave, bāhusaccakathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, sutasampadaṃ attani na samanupassati, na ca labhati tatonidānaṃ pītipāmojjaṃ. Tasmā appassutassa bāhusaccakathā dukkathā. ‘‘Kasmā ca, bhikkhave, maccharissa cāgakathā dukkathā? Maccharī, bhikkhave, cāgakathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, cāgasampadaṃ attani na samanupassati na ca labhati tatonidānaṃ pītipāmojjaṃ. Tasmā maccharissa cāgakathā dukkathā. ‘‘Kasmā ca, bhikkhave, duppaññassa paññākathā dukkathā? Duppañño, bhikkhave, paññākathāya kacchamānāya abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, paññāsampadaṃ attani na samanupassati, na ca labhati tatonidānaṃ pītipāmojjaṃ. Tasmā duppaññassa paññākathā dukkathā. Imesaṃ kho, bhikkhave, pañcannaṃ puggalānaṃ kathā dukkathā puggale puggalaṃ upanidhāya. ‘‘Pañcannaṃ, bhikkhave, puggalānaṃ kathā sukathā puggale puggalaṃ upanidhāya. Katamesaṃ pañcannaṃ? Saddhassa, bhikkhave, saddhākathā sukathā; sīlavato sīlakathā sukathā; bahussutassa bāhusaccakathā sukathā; cāgavato cāgakathā sukathā; paññavato paññākathā sukathā. ‘‘Kasmā ca, bhikkhave, saddhassa saddhākathā sukathā? Saddho, bhikkhave, saddhākathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, saddhāsampadaṃ attani samanupassati labhati ca tatonidānaṃ pītipāmojjaṃ. Tasmā saddhassa saddhākathā sukathā. ‘‘Kasmā ca, bhikkhave, sīlavato sīlakathā sukathā? Sīlavā, bhikkhave, sīlakathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, sīlasampadaṃ attani samanupassati, labhati ca tatonidānaṃ pītipāmojjaṃ. Tasmā sīlavato sīlakathā sukathā. ‘‘Kasmā ca, bhikkhave, bahussutassa bāhusaccakathā sukathā? Bahussuto, bhikkhave, bāhusaccakathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, sutasampadaṃ attani samanupassati, labhati ca tatonidānaṃ pītipāmojjaṃ. Tasmā bahussutassa bāhusaccakathā sukathā. ‘‘Kasmā ca, bhikkhave, cāgavato cāgakathā sukathā? Cāgavā, bhikkhave, cāgakathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, cāgasampadaṃ attani samanupassati, labhati ca tatonidānaṃ pītipāmojjaṃ. Tasmā cāgavato cāgakathā sukathā. ‘‘Kasmā ca, bhikkhave, paññavato paññākathā sukathā? Paññavā, bhikkhave, paññākathāya kacchamānāya nābhisajjati na kuppati na byāpajjati na patitthīyati na kopañca dosañca appaccayañca pātukaroti. Taṃ kissa hetu? Tañhi so, bhikkhave, paññāsampadaṃ attani samanupassati labhati ca tatonidānaṃ pītipāmojjaṃ. Tasmā paññavato paññākathā sukathā. Imesaṃ kho, bhikkhave, pañcannaṃ puggalānaṃ kathā sukathā puggale puggalaṃ upanidhāyā’’ti. Sattamaṃ.",
      "english": "Monks, when considering individuals, the discourse concerning five types of individuals is disagreeable. Which five? Monks, for a faithless person, discourse on faith is disagreeable; for an immoral person, discourse on morality is disagreeable; for a person with little learning, discourse on extensive learning is disagreeable; for a stingy person, discourse on generosity is disagreeable; for an unwise person, discourse on wisdom is disagreeable.\n\nAnd why, monks, is discourse on faith disagreeable for a faithless person? Monks, when discourse on faith is being spoken, the faithless person becomes agitated, angered, hostile, and obstinate; they display anger, ill-will, and displeasure. What is the reason for this? For, monks, they do not find the accomplishment of faith within themselves, nor do they obtain joy and gladness based on it. Therefore, for a faithless person, discourse on faith is disagreeable.\n\nAnd why, monks, is discourse on morality disagreeable for an immoral person? Monks, when discourse on morality is being spoken, the immoral person becomes agitated, angered, hostile, and obstinate; they display anger, ill-will, and displeasure. What is the reason for this? For, monks, they do not find the accomplishment of morality within themselves, nor do they obtain joy and gladness based on it. Therefore, for an immoral person, discourse on morality is disagreeable.\n\nAnd why, monks, is discourse on extensive learning disagreeable for a person with little learning? Monks, when discourse on extensive learning is being spoken, the person with little learning becomes agitated, angered, hostile, and obstinate; they display anger, ill-will, and displeasure. What is the reason for this? For, monks, they do not find the accomplishment of learning within themselves, nor do they obtain joy and gladness based on it. Therefore, for a person with little learning, discourse on extensive learning is disagreeable.\n\nAnd why, monks, is discourse on generosity disagreeable for a stingy person? Monks, when discourse on generosity is being spoken, the stingy person becomes agitated, angered, hostile, and obstinate; they display anger, ill-will, and displeasure. What is the reason for this? For, monks, they do not find the accomplishment of generosity within themselves, nor do they obtain joy and gladness based on it. Therefore, for a stingy person, discourse on generosity is disagreeable.\n\nAnd why, monks, is discourse on wisdom disagreeable for an unwise person? Monks, when discourse on wisdom is being spoken, the unwise person becomes agitated, angered, hostile, and obstinate; they display anger, ill-will, and displeasure. What is the reason for this? For, monks, they do not find the accomplishment of wisdom within themselves, nor do they obtain joy and gladness based on it. Therefore, for an unwise person, discourse on wisdom is disagreeable.\n\nMonks, when considering individuals, the discourse concerning these five types of individuals is disagreeable. Monks, when considering individuals, the discourse concerning five types of individuals is agreeable. Which five? Monks, for a person of faith, discourse on faith is agreeable; for a moral person, discourse on morality is agreeable; for an extensively learned person, discourse on extensive learning is agreeable; for a generous person, discourse on generosity is agreeable; for a wise person, discourse on wisdom is agreeable.\n\nAnd why, monks, is discourse on faith agreeable for a person of faith? Monks, when discourse on faith is being spoken, the person of faith does not become agitated, does not get angry, does not become hostile, does not become obstinate, and does not display anger, ill-will, or displeasure. What is the reason for this? For, monks, they find the accomplishment of faith within themselves, and they obtain joy and gladness based on it. Therefore, for a person of faith, discourse on faith is agreeable.\n\nAnd why, monks, is discourse on morality agreeable for a moral person? Monks, when discourse on morality is being spoken, the moral person does not become agitated, does not get angry, does not become hostile, does not become obstinate, and does not display anger, ill-will, or displeasure. What is the reason for this? For, monks, they find the accomplishment of morality within themselves, and they obtain joy and gladness based on it. Therefore, for a moral person, discourse on morality is agreeable.\n\nAnd why, monks, is discourse on extensive learning agreeable for an extensively learned person? Monks, when discourse on extensive learning is being spoken, the extensively learned person does not become agitated, does not get angry, does not become hostile, does not become obstinate, and does not display anger, ill-will, or displeasure. What is the reason for this? For, monks, they find the accomplishment of learning within themselves, and they obtain joy and gladness based on it. Therefore, for an extensively learned person, discourse on extensive learning is agreeable.\n\nAnd why, monks, is discourse on generosity agreeable for a generous person? Monks, when discourse on generosity is being spoken, the generous person does not become agitated, does not get angry, does not become hostile, does not become obstinate, and does not display anger, ill-will, or displeasure. What is the reason for this? For, monks, they find the accomplishment of generosity within themselves, and they obtain joy and gladness based on it. Therefore, for a generous person, discourse on generosity is agreeable.\n\nAnd why, monks, is discourse on wisdom agreeable for a wise person? Monks, when discourse on wisdom is being spoken, the wise person does not become agitated, does not get angry, does not become hostile, does not become obstinate, and does not display anger, ill-will, or displeasure. What is the reason for this? For, monks, they find the accomplishment of wisdom within themselves, and they obtain joy and gladness based on it. Therefore, for a wise person, discourse on wisdom is agreeable.\n\nMonks, the wise one, when a discourse on wisdom is being given, does not become indignant, does not become agitated, does not become hostile, does not become resistant, and does not manifest anger, ill-will, or displeasure. What is the reason for this? For he, monks, discerns the accomplishment of wisdom within himself, and from that cause, he obtains joy and gladness. Therefore, for the wise one, a discourse on wisdom is a well-received discourse. Indeed, monks, a discourse concerning these five types of individuals is well-spoken when comparing one individual with another.",
      "sinhala": "මහණෙනි, පුද්ගලයා අනුව බලන කල, පුද්ගලයන් පස්දෙනෙකුට යම් කථාවක් වේද, එය අමිහිරි කථාවකි. කවර පස්දෙනෙකුටද? මහණෙනි, අශ්‍රද්ධාවන්තයාට ශ්‍රද්ධා කථාව අමිහිරි කථාවකි. දුස්සීලයාට සීල කථාව අමිහිරි කථාවකි. අල්පශ්‍රැතයාට බහුශ්‍රැත කථාව අමිහිරි කථාවකි. මසුරු පුද්ගලයාට ත්‍යාග කථාව අමිහිරි කථාවකි. දුෂ්ප්‍රාඥයාට ප්‍රඥා කථාව අමිහිරි කථාවකි.\n\nමහණෙනි, අශ්‍රද්ධාවන්තයාට ශ්‍රද්ධා කථාව අමිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, අශ්‍රද්ධාවන්ත තැනැත්තා ශ්‍රද්ධා කථාව පවත්වන කල්හි ගැටෙයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, ප්‍රතිවිරුද්ධ වෙයි, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරයි. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ ශ්‍රද්ධා සම්පත්තිය නොදකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද නොලබයි. එහෙයින් අශ්‍රද්ධාවන්තයාට ශ්‍රද්ධා කථාව අමිහිරි කථාවකි.\n\nමහණෙනි, දුස්සීලයාට සීල කථාව අමිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, දුස්සීල තැනැත්තා සීල කථාව පවත්වන කල්හි ගැටෙයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, ප්‍රතිවිරුද්ධ වෙයි, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරයි. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ සීල සම්පත්තිය නොදකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද නොලබයි. එහෙයින් දුස්සීලයාට සීල කථාව අමිහිරි කථාවකි.\n\nමහණෙනි, අල්පශ්‍රැතයාට බහුශ්‍රැත කථාව අමිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, අල්පශ්‍රැත තැනැත්තා බහුශ්‍රැත කථාව පවත්වන කල්හි ගැටෙයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, ප්‍රතිවිරුද්ධ වෙයි, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරයි. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ ශ්‍රැත සම්පත්තිය නොදකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද නොලබයි. එහෙයින් අල්පශ්‍රැතයාට බහුශ්‍රැත කථාව අමිහිරි කථාවකි.\n\nමහණෙනි, මසුරු පුද්ගලයාට ත්‍යාග කථාව අමිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, මසුරු තැනැත්තා ත්‍යාග කථාව පවත්වන කල්හි ගැටෙයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, ප්‍රතිවිරුද්ධ වෙයි, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරයි. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ ත්‍යාග සම්පත්තිය නොදකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද නොලබයි. එහෙයින් මසුරු පුද්ගලයාට ත්‍යාග කථාව අමිහිරි කථාවකි.\n\nමහණෙනි, දුෂ්ප්‍රාඥයාට ප්‍රඥා කථාව අමිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, දුෂ්ප්‍රාඥ තැනැත්තා ප්‍රඥා කථාව පවත්වන කල්හි ගැටෙයි, කිපෙයි, ව්‍යාපාදයට පත් වෙයි, ප්‍රතිවිරුද්ධ වෙයි, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරයි. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ ප්‍රඥා සම්පත්තිය නොදකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද නොලබයි. එහෙයින් දුෂ්ප්‍රාඥයාට ප්‍රඥා කථාව අමිහිරි කථාවකි.\n\nමහණෙනි, පුද්ගලයා අනුව බලන කල, මේ පස්දෙනෙකු වූ පුද්ගලයන්ට කථාව අමිහිරි කථාවකි.\n\nමහණෙනි, පුද්ගලයා අනුව බලන කල, පුද්ගලයන් පස්දෙනෙකුට යම් කථාවක් වේද, එය මිහිරි කථාවකි. කවර පස්දෙනෙකුටද? මහණෙනි, ශ්‍රද්ධාවන්තයාට ශ්‍රද්ධා කථාව මිහිරි කථාවකි. සීලවන්තයාට සීල කථාව මිහිරි කථාවකි. බහුශ්‍රැතයාට බහුශ්‍රැත කථාව මිහිරි කථාවකි. ත්‍යාගවන්තයාට ත්‍යාග කථාව මිහිරි කථාවකි. ප්‍රඥාවන්තයාට ප්‍රඥා කථාව මිහිරි කථාවකි.\n\nමහණෙනි, ශ්‍රද්ධාවන්තයාට ශ්‍රද්ධා කථාව මිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, ශ්‍රද්ධාවන්ත තැනැත්තා ශ්‍රද්ධා කථාව පවත්වන කල්හි ගැටෙන්නේ නැත, කිපෙන්නේ නැත, ව්‍යාපාදයට පත් වන්නේ නැත, ප්‍රතිවිරුද්ධ වන්නේ නැත, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරන්නේද නැත. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ ශ්‍රද්ධා සම්පත්තිය දකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද ලබයි. එහෙයින් ශ්‍රද්ධාවන්තයාට ශ්‍රද්ධා කථාව මිහිරි කථාවකි.\n\nමහණෙනි, සීලවන්තයාට සීල කථාව මිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, සීලවන්ත තැනැත්තා සීල කථාව පවත්වන කල්හි ගැටෙන්නේ නැත, කිපෙන්නේ නැත, ව්‍යාපාදයට පත් වන්නේ නැත, ප්‍රතිවිරුද්ධ වන්නේ නැත, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරන්නේද නැත. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ සීල සම්පත්තිය දකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද ලබයි. එහෙයින් සීලවන්තයාට සීල කථාව මිහිරි කථාවකි.\n\nමහණෙනි, බහුශ්‍රැතයාට බහුශ්‍රැත කථාව මිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, බහුශ්‍රැත තැනැත්තා බහුශ්‍රැත කථාව පවත්වන කල්හි ගැටෙන්නේ නැත, කිපෙන්නේ නැත, ව්‍යාපාදයට පත් වන්නේ නැත, ප්‍රතිවිරුද්ධ වන්නේ නැත, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරන්නේද නැත. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ ශ්‍රැත සම්පත්තිය දකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද ලබයි. එහෙයින් බහුශ්‍රැතයාට බහුශ්‍රැත කථාව මිහිරි කථාවකි.\n\nමහණෙනි, ත්‍යාගවන්තයාට ත්‍යාග කථාව මිහිරි කථාවක් වන්නේ කවර හෙයින්ද? මහණෙනි, ත්‍යාගවන්ත තැනැත්තා ත්‍යාග කථාව පවත්වන කල්හි ගැටෙන්නේ නැත, කිපෙන්නේ නැත, ව්‍යාපාදයට පත් වන්නේ නැත, ප්‍රතිවිරුද්ධ වන්නේ නැත, ක්‍රෝධයත්, ද්වේෂයත්, නොසතුටත් පහළ කරන්නේද නැත. ඒ කවර හෙයින්ද? මහණෙනි, ඒ මක්නිසාද යත්, ඒ තැනැත්තා තමා තුළ ත්‍යාග සම්පත්තිය දකියි. ඒ හේතුවෙන් ප්‍රීති ප්‍රමෝදයද ලබයි. එහෙයින් ත්‍යාගවන්තයාට ත්‍යාග කථාව මිහිරි කථාවකි.\n\nමහණෙනි, ප්‍රඥාවන්තයාට ප්‍රඥා කථාව මිහිරි කථාවක් වන්නේ කවර හෙයින්ද?\n\nමහණෙනි, ප්‍රඥාවන්ත පුද්ගලයා ප්‍රඥාව පිළිබඳ කතාවක් කරන කල්හි කෝපයට පත් නොවෙයි, කිපෙන්නේ නැත, ව්‍යාකූල නොවෙයි, ප්‍රතිඝාත නොවෙයි, කෝපයද, ද්වේෂයද, අප්‍රසාදයද ප්‍රකට නොකරයි.\n\nඑයට හේතුව කුමක්ද? මක්නිසාද යත්, මහණෙනි, හෙතෙම තමා තුළ ප්‍රඥා සම්පත්තිය පවතින බව අවබෝධ කරගනියි; එනිසා ප්‍රීතිය හා ප්‍රමෝදය ලබයි.\n\nඑහෙයින්, ප්‍රඥාවන්තයාට ප්‍රඥාව පිළිබඳ කතාව මනා කතාවකි.\n\nමහණෙනි, සැබවින්ම මේ පුද්ගලයන් පස් දෙනාගේ කතාව පුද්ගලයා පුද්ගලයාට සාපේක්ෂව මනා කතාවකි.",
      "paliTitle": "Dukkathāsuttaṃ",
      "englishTitle": "Bad Talk Sutta",
      "sinhalaTitle": "දුක්කථා සූත්‍රය"
    },
    {
      "number": 158,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu sārajjaṃ okkanto [okkamanto (ka.)] hoti. Katamehi pañcahi? Idha, bhikkhave, bhikkhu assaddho hoti, dussīlo hoti, appassuto hoti, kusīto hoti, dupañño hoti. Imehi kho, bhikkhave, pañcahi, dhammehi samannāgato bhikkhu sārajjaṃ okkanto hoti. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu visārado hoti. Katamehi pañcahi? Idha, bhikkhave, bhikkhu saddho hoti, sīlavā hoti, bahussuto hoti, āraddhavīriyo hoti, paññavā hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu visārado hotī’’ti. Aṭṭhamaṃ.",
      "english": "O bhikkhus, a monk who is endowed with five qualities enters into timidity. What are these five? Here, O bhikkhus, a monk is without faith, is unvirtuous, is unlearned, is indolent, and is unwise. Indeed, O bhikkhus, a monk endowed with these five qualities enters into timidity.\n\nO bhikkhus, a monk who is endowed with five qualities is self-confident. What are these five? Here, O bhikkhus, a monk is full of faith, is virtuous, is widely learned, has aroused energy, and is wise. Indeed, O bhikkhus, a monk endowed with these five qualities is self-confident.",
      "sinhala": "භික්ෂූනි, ධර්මයන් පසකින් සමන්විත වූ භික්ෂුවක් නිර්භීතභාවයෙන් තොර වේ. කවර පසකින් ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් අශ්‍රද්ධාවන්ත වේ, දුශ්ශීල වේ, අල්පශ්‍රැත වේ, කුසීත වේ, දුෂ්ප්‍රාඥ වේ. භික්ෂූනි, මේ ධර්මයන් පසකින් සමන්විත වූ භික්ෂුවක් නිර්භීතභාවයෙන් තොර වේ.\n\nභික්ෂූනි, ධර්මයන් පසකින් සමන්විත වූ භික්ෂුවක් නිර්භීත වේ. කවර පසකින් ද? භික්ෂූනි, මෙහිලා භික්ෂුවක් ශ්‍රද්ධාවන්ත වේ, ශීලවන්ත වේ, බහුශ්‍රැත වේ, ආරම්භක වීර්යයෙන් යුක්ත වේ, ප්‍රඥාවන්ත වේ. භික්ෂූනි, මේ ධර්මයන් පසින් සමන්විත වූ භික්ෂුවක් නිර්භීත වේ.",
      "paliTitle": "Sārajjasuttaṃ",
      "englishTitle": "The Discourse on Diffidence",
      "sinhalaTitle": "සාරජ්ජ සූත්‍රය"
    },
    {
      "number": 159,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena āyasmā udāyī mahatiyā gihiparisāya parivuto dhammaṃ desento nisinno hoti. Addasā kho āyasmā ānando āyasmantaṃ udāyiṃ mahatiyā gihiparisāya parivutaṃ dhammaṃ desentaṃ nisinnaṃ. Disvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘āyasmā, bhante, udāyī mahatiyā gihiparisāya parivuto dhammaṃ desetī’’ti [desento nisinno’’ti (syā.)]. ‘‘Na kho, ānanda, sukaraṃ paresaṃ dhammaṃ desetuṃ. Paresaṃ, ānanda, dhammaṃ desentena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paresaṃ dhammo desetabbo. Katame pañca? ‘Anupubbiṃ kathaṃ [ānupubbikathaṃ (sī.), anupubbikathaṃ (syā. pī. ka.)] kathessāmī’ti paresaṃ dhammo desetabbo; ‘pariyāyadassāvī kathaṃ kathessāmī’ti paresaṃ dhammo desetabbo; ‘anuddayataṃ paṭicca kathaṃ kathessāmī’ti paresaṃ dhammo desetabbo; ‘na āmisantaro kathaṃ kathessāmī’ti paresaṃ dhammo desetabbo; ‘attānañca parañca anupahacca kathaṃ kathessāmī’ti paresaṃ dhammo desetabbo. Na kho, ānanda, sukaraṃ paresaṃ dhammaṃ desetuṃ. Paresaṃ, ānanda, dhammaṃ desentena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paresaṃ dhammo desetabbo’’ti. Navamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Kosambi, at Ghosita's Park.\n\nNow at that time, the Venerable Udāyī was seated, teaching the Dhamma, surrounded by a large assembly of lay followers. The Venerable Ānanda saw the Venerable Udāyī seated, teaching the Dhamma, surrounded by a large assembly of lay followers. Having seen him, he approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the Venerable Ānanda said to the Blessed One: \"Venerable sir, the Venerable Udāyī is teaching the Dhamma, surrounded by a large assembly of lay followers.\"\n\n\"Indeed, Ānanda, it is not easy to teach the Dhamma to others. One who teaches the Dhamma to others, Ānanda, should establish five qualities within themselves before teaching the Dhamma to others. Which five?\n\n\"'I will speak gradually,' one should teach the Dhamma to others with this thought.\n\"'I will speak discerning the implications,' one should teach the Dhamma to others with this thought.\n\"'I will speak out of compassion,' one should teach the Dhamma to others with this thought.\n\"'I will speak without seeking material gain,' one should teach the Dhamma to others with this thought.\n\"'I will speak without harming myself or others,' one should teach the Dhamma to others with this thought.\n\n\"Indeed, Ānanda, it is not easy to teach the Dhamma to others. One who teaches the Dhamma to others, Ānanda, should establish these five qualities within themselves before teaching the Dhamma to others.\"",
      "sinhala": "මා හට මෙසේ අසන ලදී.\n\nඑක් සමයෙක භාග්‍ය​වතුන් වහන්සේ කොසඹෑ නුවර ඝෝෂිතාරාමයෙහි වැඩවසන සේක. එසමයෙහි ආයුෂ්මත් උදායි තෙරුන් වහන්සේ මහත් වූ ගිහි පිරිසක් පිරිවරා ධර්මය දේශනා කරමින් වැඩ සිටි සේක. ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ මහත් වූ ගිහි පිරිසක් පිරිවරා ධර්මය දේශනා කරමින් වැඩසිටින ආයුෂ්මත් උදායි තෙරුන් වහන්සේව දුටු සේක. දැක, භාග්‍ය​වතුන් වහන්සේ වෙත එළඹ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වැඩ සිටි සේක. එකත්පස්ව වැඩ සිටි ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසූ සේක: “ස්වාමීනි, ආයුෂ්මත් උදායි තෙරුන් වහන්සේ මහත් වූ ගිහි පිරිසක් පිරිවරා ධර්මය දේශනා කරති.” “ආනන්දයෙනි, අනුන්ට ධර්මය දේශනා කිරීම පහසු දෙයක් නොවේ. ආනන්දයෙනි, අනුන්ට ධර්මය දේශනා කරන තැනැත්තා තමා තුළ මේ ධර්ම පස පිහිටුවාගෙන අනුන්ට ධර්මය දේශනා කළ යුතු ය. කවර පසක් ද යත්: ‘මම අනුපිළිවෙළින් කථාව (ධර්මය) දේශනා කරන්නෙමි’යි අනුන්ට ධර්මය දේශනා කළ යුතු ය; ‘මම පර්යාය දක්වමින් කථාව දේශනා කරන්නෙමි’යි අනුන්ට ධර්මය දේශනා කළ යුතු ය; ‘මම අනුකම්පාව පෙරටු කොටගෙන කථාව දේශනා කරන්නෙමි’යි අනුන්ට ධර්මය දේශනා කළ යුතු ය; ‘මම ආමිසයක් අපේක්ෂා නොකොට කථාව දේශනා කරන්නෙමි’යි අනුන්ට ධර්මය දේශනා කළ යුතු ය; ‘මම තමාටත්, අනුන්ටත් අපහාස නොවන සේ කථාව දේශනා කරන්නෙමි’යි අනුන්ට ධර්මය දේශනා කළ යුතු ය. ආනන්දයෙනි, අනුන්ට ධර්මය දේශනා කිරීම පහසු දෙයක් නොවේ. ආනන්දයෙනි, අනුන්ට ධර්මය දේශනා කරන තැනැත්තා තමා තුළ මේ ධර්ම පස පිහිටුවාගෙන අනුන්ට ධර්මය දේශනා කළ යුතු ය.”\n\nනවවැනි සූත්‍රයයි.",
      "paliTitle": "Udāyīsuttaṃ",
      "englishTitle": "Udāyī Sutta",
      "sinhalaTitle": "උදායී සූත්‍රය"
    },
    {
      "number": 160,
      "pali": "‘‘Pañcime, bhikkhave, uppannā duppaṭivinodayā. Katame pañca? Uppanno rāgo duppaṭivinodayo, uppanno doso duppaṭivinodayo, uppanno moho duppaṭivinodayo, uppannaṃ paṭibhānaṃ duppaṭivinodayaṃ, uppannaṃ gamikacittaṃ duppaṭivinodayaṃ. Ime kho, bhikkhave, pañca uppannā duppaṭivinodayā’’ti. Dasamaṃ. ",
      "english": "Monks, these five things, once arisen, are difficult to dispel. Which five? Once sensual desire has arisen, it is difficult to dispel. Once aversion has arisen, it is difficult to dispel. Once delusion has arisen, it is difficult to dispel. Once inspired thought has arisen, it is difficult to dispel. Once the impulse to travel has arisen, it is difficult to dispel. Indeed, monks, these five things, once arisen, are difficult to dispel.",
      "sinhala": "භික්ෂූණි, මේ කරුණු පසක් ඇති වූ කල්හි දුරලීම අසීරුය. කවරේද ඒ කරුණු පස? ඇති වූ රාගය දුරලීම අසීරුය, ඇති වූ ද්වේෂය දුරලීම අසීරුය, ඇති වූ මෝහය දුරලීම අසීරුය, ඇති වූ ප්‍රතිභානයක් දුරලීම අසීරුය, ඇති වූ ගමනට නැඟුණු සිතක් දුරලීම අසීරුය. භික්ෂූණි, ඇති වූ මේ කරුණු පස දුරලීම අසීරුය.",
      "paliTitle": "Duppaṭivinodayasuttaṃ",
      "englishTitle": "Hard to Dispel Sutta",
      "sinhalaTitle": "දුප්පටිවිනෝදය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Saddhammavaggo paṭhamo. Tassuddānaṃ – Tayo sammattaniyāmā, tayo saddhammasammosā; Dukkathā ceva sārajjaṃ, udāyidubbinodayāti.",
    "english": "The Chapter on the True Dhamma is the first. The summary of it: Three on the Order of Rightness, three on the Disappearance of the True Dhamma; Difficult to Talk To, Timidity, Udāyī, and Hard to Dispel.",
    "sinhala": "පළමු සද්ධම්ම වර්ගයයි. එහි උද්දානය නම්: සම්මත්තනියාම තුනක්, සද්ධම්මසම්මෝස තුනක්, දුක්කථා, සාරජ්ජ, උදායී සහ දුබ්බිනෝදය යන සූත්‍රයි."
  }
}