{
  "id": "an5.22",
  "title": {
    "pali": "Akkosakavaggo",
    "english": "The Chapter on Reviling",
    "sinhala": "අක‍්කෝසකවග‍්ගය"
  },
  "sections": [
    {
      "number": 211,
      "pali": "‘‘Yo so, bhikkhave, bhikkhu akkosakaparibhāsako ariyūpavādī sabrahmacārīnaṃ, tassa pañca ādīnavā pāṭikaṅkhā. Katame pañca? Pārājiko vā hoti chinnaparipantho [chinnaparibandho (ka.)], aññataraṃ vā saṃkiliṭṭhaṃ āpattiṃ āpajjati, bāḷhaṃ vā rogātaṅkaṃ phusati, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Yo so, bhikkhave, bhikkhu akkosakaparibhāsako ariyūpavādī sabrahmacārīnaṃ, tassa ime pañca ādīnavā pāṭikaṅkhā’’ti. Paṭhamaṃ.",
      "english": "Bhikkhus, whatever monk is abusive and reviling, a slanderer of the Noble Ones among his fellow spiritual practitioners, for him, five dangers are to be expected. What are these five? Either he incurs a monastic defeat (pārājika), becoming one whose spiritual path is cut off; or he incurs some other defiling offense; or he experiences a severe illness; or he dies bewildered; or, with the breaking up of the body, after death, he is reborn in a state of deprivation, a bad destination, a state of woe, in hell. Bhikkhus, whatever monk is abusive and reviling, a slanderer of the Noble Ones among his fellow spiritual practitioners, for him, these five dangers are to be expected.",
      "sinhala": "මහණෙනි, යම් භික්ෂු‍වක් එකට බඹසර හැසිරෙන සබ්‍රහ්මචාරීන්ට බැණ වදින්නෙක්ද, පරිභව කරන්නෙක්ද, ආර්ය‍යන්ට අපහාස කරන්නෙක්ද වේද, ඔහුට ආදීනව පහක් අපේක්ෂා කළ යුතුයි. ඒ පහ කවරේද යත්: ඔහු පාරාජිකාවක් වී ශාසනික මාර්ගය සිඳී ගිය කෙනෙක් වෙයි; හෝ යම්කිසි කිලිටි වූ ආපත්තියකට පත් වෙයි; හෝ දැඩි රෝගාබාධයකට මුහුණ දෙයි; හෝ සිහිමුළා වී කලුරිය කරයි; හෝ කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදී. මහණෙනි, යම් භික්ෂු‍වක් එකට බඹසර හැසිරෙන සබ්‍රහ්මචාරීන්ට බැණ වදින්නෙක්ද, පරිභව කරන්නෙක්ද, ආර්ය‍යන්ට අපහාස කරන්නෙක්ද වේද, ඔහුට මේ ආදීනව පහ අපේක්ෂා කළ යුතුයි.",
      "paliTitle": "Akkosakasuttaṃ",
      "englishTitle": "The Insulter Sutta",
      "sinhalaTitle": "අක්කෝසක සූත්‍රය"
    },
    {
      "number": 212,
      "pali": "‘‘Yo so, bhikkhave, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako, tassa pañca ādīnavā pāṭikaṅkhā. Katame pañca? Anadhigataṃ nādhigacchati, adhigatā [adhigataṃ (sabbattha)] parihāyati, pāpako kittisaddo abbhuggacchati, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Yo so, bhikkhave, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako, tassa ime pañca ādīnavā pāṭikaṅkhā’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, that monk who is a quarrel-maker, a dispute-maker, a controversy-maker, a gossip-monger, one who causes legal cases in the Sangha – for him, five disadvantages are to be expected. Which five? He does not attain what he has not yet attained, and he loses what he has already attained. A bad reputation spreads about him. He dies bewildered, and with the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a downfall, in hell. Bhikkhus, that monk who is a quarrel-maker, a dispute-maker, a controversy-maker, a gossip-monger, one who causes legal cases in the Sangha – for him, these five disadvantages are to be expected.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් කලහ ඇති කරන්නෙක් ද, ආරවුල් ඇති කරන්නෙක් ද, මතභේද ඇති කරන්නෙක් ද, නිෂ්ඵල වාද විවාද ඇති කරන්නෙක් ද, සංඝයා අතර අධිකරණ (විනය කාරණා) ඇති කරන්නෙක් ද වේ ද, ඔහුට පස් වැදෑරුම් ආදීනව අපේක්ෂා කළ හැකිය. ඒ පස් වැදෑරුම් ආදීනව කවරේද? තවමත් ලබා නොගත් මාර්ගඵල (අධිගම) ලබා නොගනී. ලබාගත් මාර්ගඵල (අධිගම) පිරිහී යයි. නරක කීර්ති රාවයක් පැතිරී යයි. මුළා වූ සිතිනි මරණයට පත් වේ. ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුර්ගති භූමිවල උපත ලබයි. මහණෙනි, යම් භික්ෂුවක් කලහ ඇති කරන්නෙක් ද, ආරවුල් ඇති කරන්නෙක් ද, මතභේද ඇති කරන්නෙක් ද, නිෂ්ඵල වාද විවාද ඇති කරන්නෙක් ද, සංඝයා අතර අධිකරණ ඇති කරන්නෙක් ද වේ ද, ඔහුට මේ පස් වැදෑරුම් ආදීනව අපේක්ෂා කළ හැකිය.",
      "paliTitle": "Bhaṇḍanakārakasuttaṃ",
      "englishTitle": "The Maker of Quarrels Sutta",
      "sinhalaTitle": "භණ්ඩනකාරක සූත්‍රය"
    },
    {
      "number": 213,
      "pali": "[mahāva. 209; dī. ni. 3.316] ‘‘Pañcime, bhikkhave, ādīnavā dussīlassa sīlavipattiyā. Katame pañca? Idha, bhikkhave, dussīlo sīlavipanno pamādādhikaraṇaṃ mahatiṃ bhogajāniṃ nigacchati. Ayaṃ, bhikkhave, paṭhamo ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlassa sīlavipannassa pāpako kittisaddo abbhuggacchati. Ayaṃ, bhikkhave, dutiyo ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlo sīlavipanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ, yadi brāhmaṇaparisaṃ, yadi gahapatiparisaṃ, yadi samaṇaparisaṃ – avisārado upasaṅkamati maṅkubhūto. Ayaṃ, bhikkhave, tatiyo ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlo sīlavipanno sammūḷho kālaṃ karoti. Ayaṃ, bhikkhave, catuttho ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlo sīlavipanno kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ayaṃ, bhikkhave, pañcamo ādīnavo dussīlassa sīlavipattiyā. Ime kho, bhikkhave, pañca ādīnavā dussīlassa sīlavipattiyā. ‘‘Pañcime, bhikkhave, ānisaṃsā sīlavato sīlasampadāya. Katame pañca? Idha, bhikkhave, sīlavā sīlasampanno appamādādhikaraṇaṃ mahantaṃ bhogakkhandhaṃ adhigacchati. Ayaṃ, bhikkhave, paṭhamo ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavato sīlasampannassa kalyāṇo kittisaddo abbhuggacchati. Ayaṃ, bhikkhave, dutiyo ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavā sīlasampanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ, yadi brāhmaṇaparisaṃ, yadi gahapatiparisaṃ, yadi samaṇaparisaṃ – visārado upasaṅkamati amaṅkubhūto. Ayaṃ bhikkhave, tatiyo ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavā sīlasampanno asammūḷho kālaṃ karoti. Ayaṃ, bhikkhave, catuttho ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavā sīlasampanno kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ayaṃ, bhikkhave, pañcamo ānisaṃso sīlavato sīlasampadāya. Ime kho, bhikkhave, pañca ānisaṃsā sīlavato sīlasampadāyā’’ti. Tatiyaṃ.",
      "english": "Monks, there are these five disadvantages for an immoral person due to the failure of their morality. Which five? Here, monks, an immoral person, one who has failed in morality, due to heedlessness, incurs a great loss of wealth. This, monks, is the first disadvantage for an immoral person due to the failure of their morality.\n\nFurthermore, monks, a bad reputation spreads for an immoral person, one who has failed in morality. This, monks, is the second disadvantage for an immoral person due to the failure of their morality.\n\nFurthermore, monks, an immoral person, one who has failed in morality, approaches any assembly whatsoever – be it an assembly of nobles, an assembly of brahmins, an assembly of householders, or an assembly of recluses – without self-confidence, feeling abashed and bewildered. This, monks, is the third disadvantage for an immoral person due to the failure of their morality.\n\nFurthermore, monks, an immoral person, one who has failed in morality, dies utterly bewildered and deluded. This, monks, is the fourth disadvantage for an immoral person due to the failure of their morality.\n\nFurthermore, monks, an immoral person, one who has failed in morality, at the breaking up of the body, after death, reappears in a state of deprivation, a bad destination, a downfall, in hell. This, monks, is the fifth disadvantage for an immoral person due to the failure of their morality. These, monks, are the five disadvantages for an immoral person due to the failure of their morality.\n\nMonks, there are these five advantages for a moral person due to the accomplishment of their morality. Which five? Here, monks, a moral person, one who is accomplished in morality, due to heedfulness, gains a great mass of wealth. This, monks, is the first advantage for a moral person due to the accomplishment of their morality.\n\nFurthermore, monks, a good reputation spreads for a moral person, one who is accomplished in morality. This, monks, is the second advantage for a moral person due to the accomplishment of their morality.\n\nFurthermore, monks, a moral person, one who is accomplished in morality, approaches any assembly whatsoever – be it an assembly of nobles, an assembly of brahmins, an assembly of householders, or an assembly of recluses – with self-confidence, feeling unashamed and unbewildered. This, monks, is the third advantage for a moral person due to the accomplishment of their morality.\n\nFurthermore, monks, a moral person, one who is accomplished in morality, dies undeluded and clear-minded. This, monks, is the fourth advantage for a moral person due to the accomplishment of their morality.\n\nFurthermore, monks, a moral person, one who is accomplished in morality, at the breaking up of the body, after death, reappears in a good destination, a heavenly world. This, monks, is the fifth advantage for a moral person due to the accomplishment of their morality. These, monks, are the five advantages for a moral person due to the accomplishment of their morality.",
      "sinhala": "භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාට මේ ආදීනව පහක් ඇත. ඒ පහ කවරේද?\n\nභික්ෂූණි, මෙහිලා දුශ්ශීලවූ, සීලයෙන් පිරිහුණූ පුද්ගලයා ප්‍රමාදය හේතුකොටගෙන මහත් භෝග හානියකට පත්වෙයි. භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාට මේ පළමු ආදීනවයයි.\n\nනැවතත් භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාගේ නරක කීර්ති රාවයක් පැතිර යයි. භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාට මේ දෙවන ආදීනවයයි.\n\nනැවතත් භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයා යම් කිසි පිරිසකට එළඹෙයිද – එනම්, ක්ෂත්‍රිය පිරිසකට හෝ වේවා, බ්‍රාහ්මණ පිරිසකට හෝ වේවා, ගෘහපති පිරිසකට හෝ වේවා, ශ්‍රමණ පිරිසකට හෝ වේවා – ඔහු නිසැකවම නොතැන්පත් සිත් ඇත්තෙක්ව, කලබල වූවෙක්ව එළඹෙයි. භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාට මේ තෙවන ආදීනවයයි.\n\nනැවතත් භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයා මුළාවට පත්ව, සිහිනැතිව මිය යයි. භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාට මේ සිව්වන ආදීනවයයි.\n\nනැවතත් භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයා කය බිඳී මරණයෙන් පසු අපාය, දුර්ගති, විනිපාත නිරයෙහි උපදී. භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාට මේ පස්වන ආදීනවයයි. භික්ෂූණි, සීලයෙහි පිරිහුණු දුශ්ශීල පුද්ගලයාට මේ ආදීනව පහ ඇත්තාහ.\n\nභික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාට මේ ආනිසංස පහක් ඇත. ඒ පහ කවරේද?\n\nභික්ෂූණි, මෙහිලා සීලවත්වූ, සීලයෙන් යුක්ත පුද්ගලයා අප්‍රමාදය හේතුකොටගෙන මහත් භෝග සම්පත් සමූහයක් ලබයි. භික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාට මේ පළමු ආනිසංසයයි.\n\nනැවතත් භික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාගේ යහපත් කීර්ති රාවයක් පැතිර යයි. භික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාට මේ දෙවන ආනිසංසයයි.\n\nනැවතත් භික්ෂූණි, සීලවත්වූ, සීලයෙන් යුක්ත පුද්ගලයා යම් කිසි පිරිසකට එළඹෙයිද – එනම්, ක්ෂත්‍රිය පිරිසකට හෝ වේවා, බ්‍රාහ්මණ පිරිසකට හෝ වේවා, ගෘහපති පිරිසකට හෝ වේවා, ශ්‍රමණ පිරිසකට හෝ වේවා – ඔහු නිසැකවම තැන්පත් සිත් ඇත්තෙක්ව, නොකලබල වූවෙක්ව එළඹෙයි. භික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාට මේ තෙවන ආනිසංසයයි.\n\nනැවතත් භික්ෂූණි, සීලවත්වූ, සීලයෙන් යුක්ත පුද්ගලයා මුළාවට නොපත්ව, සිහියෙන් යුක්තව මිය යයි. භික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාට මේ සිව්වන ආනිසංසයයි.\n\nනැවතත් භික්ෂූණි, සීලවත්වූ, සීලයෙන් යුක්ත පුද්ගලයා කය බිඳී මරණයෙන් පසු සුගති වූ ස්වර්ග ලෝකයට උපදී. භික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාට මේ පස්වන ආනිසංසයයි. භික්ෂූණි, සීල සම්පත්තියෙන් යුක්ත සීලවන්ත පුද්ගලයාට මේ ආනිසංස පහ ඇත්තාහ.",
      "paliTitle": "Sīlasuttaṃ",
      "englishTitle": "The Discourse on Virtue",
      "sinhalaTitle": "සීල සූත්‍රය"
    },
    {
      "number": 214,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā bahubhāṇismiṃ puggale. Katame pañca? Musā bhaṇati, pisuṇaṃ bhaṇati, pharusaṃ bhaṇati, samphappalāpaṃ bhaṇati, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā bahubhāṇismiṃ puggale. ‘‘Pañcime, bhikkhave, ānisaṃsā mantabhāṇismiṃ puggale. Katame pañca? Na musā bhaṇati, na pisuṇaṃ bhaṇati, na pharusaṃ bhaṇati, na samphappalāpaṃ bhaṇati, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā mantabhāṇismiṃ puggale’’ti. Catutthaṃ.",
      "english": "Monks, there are these five disadvantages for a talkative person. Which five? He speaks falsely, he speaks divisively, he speaks harshly, he speaks idly; and with the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a lower realm, in hell. Indeed, Monks, these are the five disadvantages for a talkative person.\n\nMonks, there are these five advantages for a person who is reserved in speech. Which five? He does not speak falsely, he does not speak divisively, he does not speak harshly, he does not speak idly; and with the breaking up of the body, after death, he reappears in a good destination, a heavenly world. Indeed, Monks, these are the five advantages for a person who is reserved in speech.",
      "sinhala": "මහණෙනි, බොහෝ දේ කතා කරන පුද්ගලයාට මේ පස් වැදෑරුම් ආදීනවයෝ වෙති. කවරේ ද ඒ පස?\n\nබොරු කියයි, කේළාම් කියයි, පරුෂ වචන කියයි, නිෂ්ඵල කතා කියයි. කය බිඳී, මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදියි. මහණෙනි, බොහෝ දේ කතා කරන පුද්ගලයාට සැබවින්ම මේ පස් වැදෑරුම් ආදීනවයෝ වෙති.\n\nමහණෙනි, මැනවින් සිතා කතා කරන පුද්ගලයාට මේ පස් වැදෑරුම් ආනිශංසයෝ වෙති. කවරේ ද ඒ පස?\n\nබොරු නොකියයි, කේළාම් නොකියයි, පරුෂ වචන නොකියයි, නිෂ්ඵල කතා නොකියයි. කය බිඳී, මරණින් මතු සුගති, ස්වර්ග ලෝකයෙහි උපදියි. මහණෙනි, මැනවින් සිතා කතා කරන පුද්ගලයාට සැබවින්ම මේ පස් වැදෑරුම් ආනිශංසයෝ වෙති.",
      "paliTitle": "Bahubhāṇisuttaṃ",
      "englishTitle": "The Talkative Person Sutta",
      "sinhalaTitle": "බහුභාණි සූත්‍රය"
    },
    {
      "number": 215,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā akkhantiyā. Katame pañca? Bahuno janassa appiyo hoti amanāpo, verabahulo ca hoti, vajjabahulo ca, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā akkhantiyā. ‘‘Pañcime, bhikkhave, ānisaṃsā khantiyā. Katame pañca? Bahuno janassa piyo hoti manāpo, na verabahulo hoti, na vajjabahulo, asammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā khantiyā’’ti. Pañcamaṃ.",
      "english": "“Monks, there are these five disadvantages of lack of forbearance. Which five? One becomes disliked and displeasing to many people, one becomes prone to animosity, one becomes full of faults, one dies bewildered, and after the break-up of the body, after death, one is reborn in a state of deprivation, a bad destination, a ruinous realm, hell. These, monks, are the five disadvantages of lack of forbearance.”\n\n“Monks, there are these five advantages of forbearance. Which five? One becomes liked and pleasing to many people, one is not prone to animosity, one is not full of faults, one dies unbewildered, and after the break-up of the body, after death, one is reborn in a fortunate destination, a heavenly world. These, monks, are the five advantages of forbearance.”",
      "sinhala": "\"මහණෙනි, නොඉවසීමෙහි මේ පස්වැදෑරුම් ආදීනවයෝ වෙති. කවරේද ඒ පස්දෙනා?\nබොහෝ දෙනාට අප්‍රිය වන්නෙක්, අමනාප වන්නෙක් වෙයි.\nබොහෝ වෛර බැඳීම් ඇත්තෙක් වෙයි.\nබොහෝ වරදට ලක් වන්නෙක් වෙයි.\nමුළා වූ සිහියෙන් මරණයට පත්වෙයි.\nකයේ බිඳී යාමෙන් පසු මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයෙහි උපදී.\nමහණෙනි, නොඉවසීමෙහි මේ පස්වැදෑරුම් ආදීනවයෝ වෙති.\n\nමහණෙනි, ඉවසීමෙහි මේ පස්වැදෑරුම් ආනිසංසයෝ වෙති. කවරේද ඒ පස්දෙනා?\nබොහෝ දෙනාට ප්‍රිය වන්නෙක්, මනාප වන්නෙක් වෙයි.\nබොහෝ වෛර බැඳීම් නැත්තෙක් වෙයි.\nබොහෝ වරදට ලක් නො වන්නෙක් වෙයි.\nමුළා නොවුණු සිහියෙන් මරණයට පත්වෙයි.\nකයේ බිඳී යාමෙන් පසු මරණින් මතු සුගති, ස්වර්ග ලෝකයෙහි උපදී.\nමහණෙනි, ඉවසීමෙහි මේ පස්වැදෑරුම් ආනිසංසයෝ වෙති.\"",
      "paliTitle": "Paṭhamaakkhantisuttaṃ",
      "englishTitle": "The First Discourse on Impatience",
      "sinhalaTitle": "පළමු අක්ඛන්ති සූත්‍රය"
    },
    {
      "number": 216,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā akkhantiyā. Katame pañca? Bahuno janassa appiyo hoti amanāpo, luddo ca hoti, vippaṭisārī ca, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā akkhantiyā. ‘‘Pañcime, bhikkhave, ānisaṃsā khantiyā. Katame pañca? Bahuno janassa piyo hoti manāpo, aluddo ca hoti, avippaṭisārī ca, asammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā khantiyā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these five are the disadvantages of impatience. What are these five? One becomes disliked and disagreeable to many people; one becomes cruel; one becomes regretful; one dies bewildered; and upon the breaking up of the body, after death, one is reborn in a state of deprivation, a bad destination, a state of woe, in hell. These, monks, are the five disadvantages of impatience.\n\nMonks, these five are the advantages of patience. What are these five? One becomes liked and agreeable to many people; one becomes non-violent; one becomes free from regret; one dies unbewildered; and upon the breaking up of the body, after death, one is reborn in a good destination, a heavenly world. These, monks, are the five advantages of patience.",
      "sinhala": "භික්ෂූනි, නොඉවසීමෙහි මේ ආදීනව පසක් ඇත. ඒ පස කවරේද යත්: බොහෝ ජනයාට අප්‍රි‍ය වෙයි, අමනාප වෙයි; දරුණු පුද්ගලයෙක් වෙයි; පසුතැවිලි ඇත්තෙක් වෙයි; මුළාවෙන් කලුරිය කරයි; ශරීරය බිඳීමෙන්, මරණින් පසු අපාය, දුගති, විනිපාත, නිරයට උපදී. භික්ෂූනි, නොඉවසීමෙහි මේ ආදීනව පස නම් මේවාය.\n\nභික්ෂූනි, ඉවසීමෙහි මේ ආනිසංස පසක් ඇත. ඒ පස කවරේද යත්: බොහෝ ජනයාට ප්‍රි‍ය වෙයි, මනාප වෙයි; දරුණු නොවන පුද්ගලයෙක් වෙයි; පසුතැවිලි නැත්තෙක් වෙයි; නොමුළාවෙන් කලුරිය කරයි; ශරීරය බිඳීමෙන්, මරණින් පසු සුගති වූ ස්වර්ග ලෝකයට උපදී. භික්ෂූනි, ඉවසීමෙහි මේ ආනිසංස පස නම් මේවාය.",
      "paliTitle": "Dutiyaakkhantisuttaṃ",
      "englishTitle": "Second Sutta on Impatience",
      "sinhalaTitle": "දුතිය අක්ඛන්ති සූත්‍රය"
    },
    {
      "number": 217,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā apāsādike. Katame pañca? Attāpi attānaṃ upavadati, anuvicca viññū garahanti, pāpako kittisaddo abbhuggacchati, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā apāsādike. ‘‘Pañcime, bhikkhave, ānisaṃsā pāsādike. Katame pañca? Attāpi attānaṃ na upavadati, anuvicca viññū pasaṃsanti, kalyāṇo kittisaddo abbhuggacchati, asammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā pāsādike’’ti. Sattamaṃ.",
      "english": "Bhikkhus, there are these five disadvantages in disagreeable conduct. Which five? One blames oneself; the wise, having investigated, censure one; a bad reputation arises; one dies deluded; and with the breaking up of the body, after death, one reappears in a state of deprivation, an unhappy destination, a state of ruin, in hell. These, bhikkhus, are the five disadvantages in disagreeable conduct.\n\nBhikkhus, there are these five advantages in confidence-inspiring conduct. Which five? One does not blame oneself; the wise, having investigated, praise one; a good reputation arises; one dies undeluded; and with the breaking up of the body, after death, one reappears in a happy destination, in a heavenly world. These, bhikkhus, are the five advantages in confidence-inspiring conduct.",
      "sinhala": "මහණෙනි, අප්‍රසාදජනක වීමේ ආදීනව මෙහිලා පහක් වෙති. ඒ කවරේද? තමාම තමාට නින්දා කරයි. විමසා බලන ප්‍රඥාවන්තයෝ ඔහුට ගරහා කරති. ඔහුගේ නරක කීර්ති රාවයක් පැතිර යයි. මුළා වූ සිත් ඇතිව මරණයට පත් වේ. ශරීරය බිඳී යාමෙන්, මරණින් මතු අපාය නම් වූ දුගතියට, විනාශයට, නිරයට උපදී. මහණෙනි, අප්‍රසාදජනක වීමේ ආදීනව පහක් මෙහිලා මේවාය.\n\nමහණෙනි, ප්‍රසාදජනක වීමේ ආනිශංස මෙහිලා පහක් වෙති. ඒ කවරේද? තමාම තමාට නින්දා නොකරයි. විමසා බලන ප්‍රඥාවන්තයෝ ඔහුට ප්‍රශංසා කරති. ඔහුගේ යහපත් කීර්ති රාවයක් පැතිර යයි. මුළා නොවූ සිත් ඇතිව මරණයට පත් වේ. ශරීරය බිඳී යාමෙන්, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදී. මහණෙනි, ප්‍රසාදජනක වීමේ ආනිශංස පහක් මෙහිලා මේවාය.",
      "paliTitle": "Paṭhamaapāsādikasuttaṃ",
      "englishTitle": "The First Discourse on Unpleasing Conduct",
      "sinhalaTitle": "පළමු අපාසාදික සූත්‍රය"
    },
    {
      "number": 218,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā apāsādike. Katame pañca? Appasannā nappasīdanti, pasannānañca ekaccānaṃ aññathattaṃ hoti, satthusāsanaṃ akataṃ [na kataṃ (syā. kaṃ. ka.)] hoti, pacchimā janatā diṭṭhānugatiṃ āpajjati, cittamassa nappasīdati. Ime kho, bhikkhave, pañca ādīnavā apāsādike. ‘‘Pañcime, bhikkhave, ānisaṃsā pāsādike. Katame pañca? Appasannā pasīdanti, pasannānañca bhiyyobhāvo hoti, satthusāsanaṃ kataṃ hoti, pacchimā janatā diṭṭhānugatiṃ āpajjati, cittamassa pasīdati. Ime kho, bhikkhave, pañca ānisaṃsā pāsādike’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five disadvantages in being unpleasing. Which five? Those who are not yet confident will not gain confidence; and for some of those who are already confident, their confidence will waver; the Teacher's Dispensation remains unfulfilled; later generations will follow such a perceived example; and one's own mind will not become clear. These, monks, are the five disadvantages in being unpleasing.\n\nMonks, there are these five advantages in being pleasing. Which five? Those who are not yet confident will gain confidence; and for those who are already confident, their confidence will grow further; the Teacher's Dispensation is fulfilled; later generations will follow such a perceived example; and one's own mind will become clear. These, monks, are the five advantages in being pleasing.",
      "sinhala": "භික්ෂූණි, අප්‍රසාදජනක වූ (පැහැදීමක් ඇති නොකරන) භික්ෂුවක තුළ මේ ආදීනව පහක් ඇත. ඒ පහ කවරේද යත්:\nපැහැදීමක් නැති අය (ඔහු දැක) පැහැදීමට පත් නොවෙති.\nපැහැදුණු සමහර අයගේ පැහැදීම වෙනස් වෙයි (පිරිහෙයි).\nශාස්තෘන් වහන්සේගේ ශාසනය (උන්වහන්සේගේ අනුශාසනාව) ඉටු නොකරන ලද්දක් වෙයි.\nපසුකාලීන ජනයා (එවැනි) ආදර්ශයන් අනුගමනය කරති.\nඔහුගේ සිත පැහැදෙන්නේ නැත.\nභික්ෂූණි, අප්‍රසාදජනක වූ භික්ෂුවක තුළ මේ ආදීනව පහක් ඇත.\n\nභික්ෂූණි, ප්‍රසාදජනක වූ (පැහැදීමක් ඇතිකරන) භික්ෂුවක තුළ මේ ආනිසංස පහක් ඇත. ඒ පහ කවරේද යත්:\nපැහැදීමක් නැති අය (ඔහු දැක) පැහැදීමට පත් වෙති.\nපැහැදුණු අයගේ පැහැදීම තවදුරටත් වැඩි දියුණු වෙයි.\nශාස්තෘන් වහන්සේගේ ශාසනය (උන්වහන්සේගේ අනුශාසනාව) ඉටු කරන ලද්දක් වෙයි.\nපසුකාලීන ජනයා (එවැනි) ආදර්ශයන් අනුගමනය කරති.\nඔහුගේ සිත පැහැදෙයි.\nභික්ෂූණි, ප්‍රසාදජනක වූ භික්ෂුවක තුළ මේ ආනිසංස පහක් ඇත.",
      "paliTitle": "Dutiyaapāsādikasuttaṃ",
      "englishTitle": "Second Sutta on Uninspiring Behavior",
      "sinhalaTitle": "දුතිය අපාසාදික සූත්‍රය"
    },
    {
      "number": 219,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā aggismiṃ. Katame pañca? Acakkhusso, dubbaṇṇakaraṇo, dubbalakaraṇo, saṅgaṇikāpavaḍḍhano [saṅgaṇikāpavaddhano (sī.), saṅgaṇikārāmabaddhano (ka.)], tiracchānakathāpavattaniko hoti. Ime kho, bhikkhave, pañca ādīnavā aggismi’’nti. Navamaṃ.",
      "english": "Monks, these five disadvantages arise from association. Which five? One becomes without spiritual insight, one becomes ill-favored, one becomes enfeebled, one fosters excessive attachment to company, and one gives rise to unedifying talk. These, monks, are the five disadvantages that arise from association.",
      "sinhala": "මහණෙනි, අග‍්‍ර ස්ථානයේ සිටීමෙහි (ලෞකිකව ප්‍රමුඛව සිටීමෙහි) මේ ආදීනව (දෝෂ) පහක් ඇත. කවරේ ද ඒ පහ? (එනම්) චක්ඛුසුනො නොවීම යි (ප්‍රඥා චක්ඛුස නැති කිරීම යි), දුර්වර්ණ වීම යි (මනසේ දීප්තිය නැති කිරීම යි), දුර්බල වීම යි (ආධ්‍යාත්මික ශක්තිය දුර්වල කිරීම යි), සංගණිකාවට (සමාජ ඇසුරට) බැඳීම වැඩි කිරීම යි, තිරශ්චීන කථා පැවැත්වීමට හේතු වීම යි. මහණෙනි, අග‍්‍ර ස්ථානයේ සිටීමෙහි (ලෞකිකව ප්‍රමුඛව සිටීමෙහි) මේ ආදීනව පහ වේ.",
      "paliTitle": "Aggisuttaṃ",
      "englishTitle": "The Discourse on Fire",
      "sinhalaTitle": "අග්ගි සූත්‍රය"
    },
    {
      "number": 220,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā madhurāyaṃ. Katame pañca? Visamā, bahurajā, caṇḍasunakhā, vāḷayakkhā, dullabhapiṇḍā – ime kho, bhikkhave, pañca ādīnavā madhurāya’’nti. Dasamaṃ. ",
      "english": "Monks, there are these five dangers in Madhurā. Which five? Uneven terrain, much dust, fierce dogs, wild yakshas, and alms-food is difficult to obtain. Indeed, monks, these are the five dangers in Madhurā.",
      "sinhala": "මහණෙනි, වනගත ගමනක ආදීනව පහක් ඇත. ඒ පහ කවරේද? දුෂ්කර වූ මංතීරු, දූවිලි බහුල වීම, දරුණු බල්ලන්, වල් යක්ෂයන්, පිණ්ඩපාතය දුර්ලභ වීම යන මේවා යි. මහණෙනි, මේවා වනගත ගමනක ඇති ආදීනව පහ යි.",
      "paliTitle": "Madhurāsuttaṃ",
      "englishTitle": "At Madhurā Sutta",
      "sinhalaTitle": "මධුරා සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Akkosakavaggo dutiyo. Tassuddānaṃ – Akkosabhaṇḍanasīlaṃ, bahubhāṇī dve akhantiyo; Apāsādikā dve vuttā, aggismiṃ madhurena cāti.",
    "english": "The Chapter on Insults is the second. The summary of it: Insult, Quarrel, Virtue, Talkative, two on Lack of Patience; two on Unpleasantness, Fire, and with Sweetness.",
    "sinhala": "දෙවන අක්කෝසක වර්ගයයි. එහි උද්දානය නම්: අක්කෝස, භණ්ඩන, සීල, බහුභාණී, අඛන්ති දෙකක්, අපාසාදික දෙකක්, අග්ගි සහ මධුර සූත්‍රයි."
  }
}