{
  "id": "an5.6",
  "title": {
    "pali": "Dutiyapaṇṇāsakaṃ - Nīvaraṇavaggo",
    "english": "The Second Fifties - The Chapter on Hindrances",
    "sinhala": "දෙවැනි පඤ්ඤාසකය - නීවරණ වග්ගය"
  },
  "sections": [
    {
      "number": 51,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Pañcime, bhikkhave, āvaraṇā nīvaraṇā cetaso ajjhāruhā paññāya dubbalīkaraṇā. Katame pañca? Kāmacchando, bhikkhave, āvaraṇo nīvaraṇo cetaso ajjhāruho paññāya dubbalīkaraṇo. Byāpādo, bhikkhave, āvaraṇo nīvaraṇo cetaso ajjhāruho paññāya dubbalīkaraṇo. Thinamiddhaṃ, bhikkhave, āvaraṇaṃ nīvaraṇaṃ cetaso ajjhāruhaṃ paññāya dubbalīkaraṇaṃ. Uddhaccakukkuccaṃ, bhikkhave, āvaraṇaṃ nīvaraṇaṃ cetaso ajjhāruhaṃ paññāya dubbalīkaraṇaṃ. Vicikicchā, bhikkhave, āvaraṇā nīvaraṇā cetaso ajjhāruhā paññāya dubbalīkaraṇā. Ime kho, bhikkhave, pañca āvaraṇā nīvaraṇā cetaso ajjhāruhā paññāya dubbalīkaraṇā. ‘‘So vata, bhikkhave, bhikkhu ime pañca āvaraṇe nīvaraṇe cetaso ajjhāruhe paññāya dubbalīkaraṇe appahāya, abalāya paññāya dubbalāya attatthaṃ vā ñassati paratthaṃ vā ñassati ubhayatthaṃ vā ñassati uttari [uttariṃ (sī. syā. kaṃ. pī.)] vā manussadhammā alamariyañāṇadassanavisesaṃ sacchikarissatīti netaṃ ṭhānaṃ vijjati. Seyyathāpi, bhikkhave, nadī pabbateyyā dūraṅgamā [dūragamā (sī.)] sīghasotā hārahārinī. Tassā puriso ubhato naṅgalamukhāni vivareyya. Evañhi so, bhikkhave, majjhe nadiyā soto vikkhitto visaṭo byādiṇṇo neva [na ceva (ka.)] dūraṅgamo assa na [na ca (ka.)] sīghasoto na [na ca (ka.)] hārahārī [hārahāriṇī (sī.)]. Evamevaṃ kho, bhikkhave, so vata bhikkhu ime pañca āvaraṇe nīvaraṇe cetaso ajjhāruhe paññāya dubbalīkaraṇe appahāya, abalāya paññāya dubbalāya attatthaṃ vā ñassati paratthaṃ vā ñassati ubhayatthaṃ vā ñassati uttari vā manussadhammā alamariyañāṇadassanavisesaṃ sacchikarissatīti netaṃ ṭhānaṃ vijjati. ‘‘So vata, bhikkhave, bhikkhu ime pañca āvaraṇe nīvaraṇe cetaso ajjhāruhe paññāya dubbalīkaraṇe pahāya, balavatiyā paññāya attatthaṃ vā ñassati paratthaṃ vā ñassati ubhayatthaṃ vā ñassati uttari vā manussadhammā alamariyañāṇadassanavisesaṃ sacchikarissatīti ṭhānametaṃ vijjati. Seyyathāpi, bhikkhave, nadī pabbateyyā dūraṅgamā sīghasotā hārahārinī. Tassā puriso ubhato naṅgalamukhāni pidaheyya. Evañhi so, bhikkhave, majjhe nadiyā soto avikkhitto avisaṭo abyādiṇṇo dūraṅgamo ceva assa sīghasoto ca hārahārī ca. Evamevaṃ kho, bhikkhave, so vata bhikkhu ime pañca āvaraṇe nīvaraṇe cetaso ajjhāruhe paññāya dubbalīkaraṇe pahāya, balavatiyā paññāya attatthaṃ vā ñassati paratthaṃ vā ñassati ubhayatthaṃ vā ñassati uttari vā manussadhammā alamariyañāṇadassanavisesaṃ sacchikarissatīti ṭhānametaṃ vijjatī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard – on one occasion the Blessed One was dwelling in Sāvatthī, at Jetavana, in Anāthapiṇḍika’s monastery.\n\nThere, the Blessed One addressed the monks, saying, “Monks!” Those monks replied to the Blessed One, “Venerable Sir.” The Blessed One then spoke thus:\n\n“Monks, there are these five hindrances and obstructions that overwhelm the mind and weaken wisdom. Which five? Sensual desire, monks, is a hindrance and obstruction that overwhelms the mind and weakens wisdom. Ill will, monks, is a hindrance and obstruction that overwhelms the mind and weakens wisdom. Sloth and torpor, monks, are a hindrance and obstruction that overwhelm the mind and weaken wisdom. Restlessness and remorse, monks, are a hindrance and obstruction that overwhelm the mind and weaken wisdom. Skeptical doubt, monks, is a hindrance and obstruction that overwhelms the mind and weakens wisdom. These, monks, are the five hindrances and obstructions that overwhelm the mind and weaken wisdom.\n\n“Monks, it is not possible that a monk, without abandoning these five hindrances and obstructions that overwhelm the mind and weaken wisdom, with weak and feeble wisdom, will understand his own welfare, or the welfare of others, or the welfare of both, or will realize a distinction in noble knowledge and vision that transcends human states. That is not possible. Just as, monks, a mountain river, flowing far and swiftly, carrying away everything, if a man were to open up channels on both sides, then, monks, the current in the middle of that river would become scattered, dispersed, and broken up; it would not flow far, nor swiftly, nor carry away anything. In the same way, monks, it is not possible that a monk, without abandoning these five hindrances and obstructions that overwhelm the mind and weaken wisdom, with weak and feeble wisdom, will understand his own welfare, or the welfare of others, or the welfare of both, or will realize a distinction in noble knowledge and vision that transcends human states. That is not possible.\n\n“But, monks, it is possible that a monk, having abandoned these five hindrances and obstructions that overwhelm the mind and weaken wisdom, with strong wisdom, will understand his own welfare, or the welfare of others, or the welfare of both, or will realize a distinction in noble knowledge and vision that transcends human states. That is possible. Just as, monks, a mountain river, flowing far and swiftly, carrying away everything, if a man were to close up channels on both sides, then, monks, the current in the middle of that river would remain unscattered, undispersed, and unbroken; it would flow far, and swiftly, and carry away everything. In the same way, monks, it is possible that a monk, having abandoned these five hindrances and obstructions that overwhelm the mind and weaken wisdom, with strong wisdom, will understand his own welfare, or the welfare of others, or the welfare of both, or will realize a distinction in noble knowledge and vision that transcends human states. That is possible.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍#zwj;යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එහිදී භාග්‍#zwj;යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍#zwj;යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍#zwj;යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, මේ ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයන් පහක් ඇත. කවරේද ඒ පහ? මහණෙනි, කාමච්ඡන්දය ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයකි. මහණෙනි, ව්‍යාපාදය ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයකි. මහණෙනි, ථීනමිද්ධය ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයකි. මහණෙනි, උද්ධච්චකුක්කුච්චය ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයකි. මහණෙනි, විචිකිච්ඡාව ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයකි. මහණෙනි, මේ ධර්‍#zwj;මයන් පහ ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන්නාහුය.\n\nමහණෙනි, යම් භික්ෂුවක් මේ ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයන් පහ ප්‍#zwj;රහීණ නොකොට, දුබල වූ, ශක්ති නැති ප්‍#zwj;රඥාවෙන් තමාගේ අර්ථය හෝ දැනගන්නේය, අනුන්ගේ අර්ථය හෝ දැනගන්නේය, දෙදෙනාගේම අර්ථය හෝ දැනගන්නේය, හෝ මනුෂ්‍ය ධර්‍#zwj;මයන්ට උසස් වූ, ආර්‍#zwj;ය ඥාන දර්ශන විශේෂයක් සාක්ෂාත් කරන්නේය යන කරුණ නොපවතින්නේය. මහණෙනි, යම්සේ පර්වතයෙන් පහළ වූ ගංගාවක් දුර ගමන් කරන්නීද, වේගවත් දියවැල් ඇත්තීද, සියල්ල ගසාගෙන යන්නීද, යම් පුරුෂයෙක් ඒ ගංගාවේ දෙපසින් නඟුල් මුඛයන් විවෘත කරන්නේද, එසේ කරන කල්හි මහණෙනි, ඒ ගංගාවේ මැද දියවැල් වික්ෂිප්ත වී, විසිරී, විනාශයට පත්වී දුර ගමන් කරන්නක්ද නොවන්නේය, වේගවත් දියවැල් ඇත්තක්ද නොවන්නේය, සියල්ල ගසාගෙන යන්නක්ද නොවන්නේය. මහණෙනි, එපරිද්දෙන්ම, යම් භික්ෂුවක් මේ ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයන් පහ ප්‍#zwj;රහීණ නොකොට, දුබල වූ, ශක්ති නැති ප්‍#zwj;රඥාවෙන් තමාගේ අර්ථය හෝ දැනගන්නේය, අනුන්ගේ අර්ථය හෝ දැනගන්නේය, දෙදෙනාගේම අර්ථය හෝ දැනගන්නේය, හෝ මනුෂ්‍ය ධර්‍#zwj;මයන්ට උසස් වූ, ආර්‍#zwj;ය ඥාන දර්ශන විශේෂයක් සාක්ෂාත් කරන්නේය යන කරුණ නොපවතින්නේය.\n\nමහණෙනි, යම් භික්ෂුවක් මේ ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයන් පහ ප්‍#zwj;රහීණ කොට, බලවත් ප්‍#zwj;රඥාවෙන් තමාගේ අර්ථය හෝ දැනගන්නේය, අනුන්ගේ අර්ථය හෝ දැනගන්නේය, දෙදෙනාගේම අර්ථය හෝ දැනගන්නේය, හෝ මනුෂ්‍ය ධර්‍#zwj;මයන්ට උසස් වූ, ආර්‍#zwj;ය ඥාන දර්ශන විශේෂයක් සාක්ෂාත් කරන්නේය යන කරුණ පවතින්නේය. මහණෙනි, යම්සේ පර්වතයෙන් පහළ වූ ගංගාවක් දුර ගමන් කරන්නීද, වේගවත් දියවැල් ඇත්තීද, සියල්ල ගසාගෙන යන්නීද, යම් පුරුෂයෙක් ඒ ගංගාවේ දෙපසින් නඟුල් මුඛයන් වසන්නේද, එසේ කරන කල්හි මහණෙනි, ඒ ගංගාවේ මැද දියවැල් වික්ෂිප්ත නොවී, නොවිසිරී, විනාශයට නොපත්වී දුර ගමන් කරන්නක්ද වන්නේය, වේගවත් දියවැල් ඇත්තක්ද වන්නේය, සියල්ල ගසාගෙන යන්නක්ද වන්නේය. මහණෙනි, එපරිද්දෙන්ම, යම් භික්ෂුවක් මේ ආවරණ වූ, නීවරණ වූ, සිත්හි බැසගත්, ප්‍#zwj;රඥාව දුබල කරවන ධර්‍#zwj;මයන් පහ ප්‍#zwj;රහීණ කොට, බලවත් ප්‍#zwj;රඥාවෙන් තමාගේ අර්ථය හෝ දැනගන්නේය, අනුන්ගේ අර්ථය හෝ දැනගන්නේය, දෙදෙනාගේම අර්ථය හෝ දැනගන්නේය, හෝ මනුෂ්‍ය ධර්‍#zwj;මයන්ට උසස් වූ, ආර්‍#zwj;ය ඥාන දර්ශන විශේෂයක් සාක්ෂාත් කරන්නේය යන කරුණ පවතින්නේය.\"",
      "paliTitle": "Āvaraṇasuttaṃ",
      "englishTitle": "The Discourse on Obstructions",
      "sinhalaTitle": "ආවරණ සූත්‍රය"
    },
    {
      "number": 52,
      "pali": "‘‘Akusalarāsīti, bhikkhave, vadamāno pañca nīvaraṇe [ime pañca nīvaraṇe (sī.)] sammā vadamāno vadeyya. Kevalo hāyaṃ [hayaṃ (sī.), cāyaṃ (syā. kaṃ.), sāyaṃ (ka.)], bhikkhave, akusalarāsi yadidaṃ pañca nīvaraṇā. Katame pañca? Kāmacchandanīvaraṇaṃ, byāpādanīvaraṇaṃ, thinamiddhanīvaraṇaṃ, uddhaccakukkuccanīvaraṇaṃ, vicikicchānīvaraṇaṃ. Akusalarāsīti, bhikkhave, vadamāno ime pañca nīvaraṇe sammā vadamāno vadeyya. Kevalo hāyaṃ, bhikkhave, akusalarāsi yadidaṃ pañca nīvaraṇā’’ti. Dutiyaṃ.",
      "english": "Monks, one who would correctly speak of ‘the aggregate of unwholesome states’ would be referring to these five hindrances. Monks, this aggregate of unwholesome states is simply these five hindrances. Which five? The hindrance of sensual desire, the hindrance of ill-will, the hindrance of sloth and torpor, the hindrance of restlessness and remorse, and the hindrance of skeptical doubt. Monks, one who would correctly speak of ‘the aggregate of unwholesome states’ would be referring to these five hindrances. Monks, this aggregate of unwholesome states is simply these five hindrances.",
      "sinhala": "මහණෙනි, අකුසලරාශිය යැයි යමෙක් කියන්නේ නම්, නිවැරදිව පවසන්නේ මේ පංච නීවරණයන්ය. මහණෙනි, මේ පංච නීවරණයන්ම මුළුමහත් අකුසලරාශිය වන්නේය. ඒ පස කුමක්ද? කාමච්ඡන්ද නීවරණය, ව්‍යාපාද නීවරණය, ථීනමිද්ධ නීවරණය, උද්ධච්චකුක්කුච්ච නීවරණය, විචිකිච්ඡා නීවරණය යන මේවාය. මහණෙනි, අකුසලරාශිය යැයි යමෙක් කියන්නේ නම්, නිවැරදිව පවසන්නේ මේ පංච නීවරණයන්මය. මහණෙනි, මේ පංච නීවරණයන්ම මුළුමහත් අකුසලරාශිය වන්නේය.",
      "paliTitle": "Akusalarāsisuttaṃ",
      "englishTitle": "The Discourse on the Heap of the Unwholesome",
      "sinhalaTitle": "අකුසලරාසි සූත්‍රය"
    },
    {
      "number": 53,
      "pali": "‘‘Pañcimāni, bhikkhave, padhāniyaṅgāni. Katamāni pañca? Idha, bhikkhave, bhikkhu saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Appābādho hoti appātaṅko; samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya; asaṭho hoti amāyāvī; yathābhūtaṃ attānaṃ āvikattā satthari vā viññūsu vā sabrahmacārīsu; āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu; paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Imāni kho, bhikkhave, pañca padhāniyaṅgānī’’ti. Tatiyaṃ.",
      "english": "Monks, there are these five factors conducive to right exertion. Which five?\n\nHere, monks, a monk is endowed with faith; he has faith in the Tathāgata's enlightenment, believing: \"Indeed, the Blessed One is an Arahant, perfectly and fully self-enlightened, accomplished in knowledge and conduct, sublime, a knower of all worlds, an unexcelled trainer of persons to be tamed, a teacher of gods and humans, the Buddha, the Blessed One.\" He is free from illness and affliction; he possesses a digestive system that processes food evenly, being neither too cold nor too hot, but moderate and conducive to exertion. He is not deceitful or fraudulent; he reveals his true self as it is, to the Teacher or to discerning fellow practitioners of the holy life. He dwells with aroused energy for the abandonment of unwholesome states and for the acquisition of wholesome states; he is strong in resolve, of steadfast endeavor, and has not laid down the burden in wholesome states. He is wise, endowed with the wisdom that discerns rise and fall, noble and penetrative, and leads to the complete destruction of suffering.\n\nThese, monks, are the five factors conducive to right exertion.",
      "sinhala": "මහණෙනි, මේ පස් වැදෑරුම් ප්‍රධානයට අංගයෝ වෙත්. කවරේද ඒ පස?\n\nමහණෙනි, මෙහිලා භික්ෂුවක් ශ්‍රද්ධාවන්ත වෙයි. තථාගතයන් වහන්සේගේ බෝධිය විශ්වාස කරයි. එනම්, 'ඒ භාග්‍යවතුන් වහන්සේ කෙලෙස් නසා, රහසින්වත් පව් නොකරන අරහත් වන සේක; සම්‍යක් සම්බුද්ධ වන සේක; විද්‍යාචරණ සම්පන්න වන සේක; යහපත් ගමන් ඇති සුගත වන සේක; ලෝකය දන්නා ලෝකවිදූ වන සේක; දමනය කළ යුතු පුරුෂයන් දමනය කිරීමෙහි අනුත්තර සාරථී වන සේක; දෙවි මිනිසුන්ට ශාස්තෘවරයා වන සේක; සත්‍යාවබෝධ කළ බුද්ධ වන සේක; භාග්‍යවතුන් වහන්සේ වන සේක' යි. ඔහු ආබාධ රහිතව, රෝගාබාධ ස්වල්පයෙන් යුක්තව සිටියි; නොඅධික ශීතල වූ, නොඅධික උෂ්ණ වූ, ප්‍රධානයට (වීර්යයට) සුදුසු මධ්‍යස්ථ ලෙස ආහාර දිරවීමේ ශක්තියකින් යුක්ත වෙයි. ඔහු වංචා රහිත වෙයි, මායාවෙන් තොර වෙයි; ශාස්තෘන් වහන්සේ කෙරෙහි හෝ නුවණැති සහබ්‍රහ්මචාරීන් කෙරෙහි හෝ තමාගේ සැබෑ ස්වභාවය ප්‍රකාශ කරන්නා වෙයි. අකුසල ධර්මයන් ප්‍රහාණය කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, ආරම්භ කළ වීර්යයෙන් යුතුව වාසය කරයි; ස්ථිර අධිෂ්ඨාන ඇතිව, දැඩි පරාක්‍රමයකින් යුක්තව, කුසල ධර්මයන්හි බර අත්නොහළ (නොපසුබට) වෙයි. ප්‍රඥාවන්ත වෙයි; ඇතිවීම හා නැතිවීම (උදය-වය) දකින, ආර්ය වූ, (සත්‍යය) විනිවිද දකින, මැනවින් දුක් ක්ෂය කිරීම කරා පමුණුවන ප්‍රඥාවෙන් යුක්ත වෙයි.\n\nමහණෙනි, මේ පස් වැදෑරුම් ප්‍රධානයට අංගයෝය.",
      "paliTitle": "Padhāniyaṅgasuttaṃ",
      "englishTitle": "Factors for Effort Sutta",
      "sinhalaTitle": "පධානියංග සූත්‍රය"
    },
    {
      "number": 54,
      "pali": "‘‘Pañcime, bhikkhave, asamayā padhānāya. Katame pañca? Idha, bhikkhave, bhikkhu jiṇṇo hoti jarāyābhibhūto. Ayaṃ, bhikkhave, paṭhamo asamayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, bhikkhu byādhito hoti byādhinābhibhūto. Ayaṃ, bhikkhave, dutiyo asamayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, dubbhikkhaṃ hoti dussassaṃ dullabhapiṇḍaṃ, na sukaraṃ uñchena paggahena yāpetuṃ. Ayaṃ, bhikkhave, tatiyo asamayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, bhayaṃ hoti aṭavisaṅkopo, cakkasamārūḷhā jānapadā pariyāyanti. Ayaṃ, bhikkhave, catuttho asamayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, saṅgho bhinno hoti. Saṅghe kho pana, bhikkhave, bhinne aññamaññaṃ akkosā ca honti, aññamaññaṃ paribhāsā ca honti, aññamaññaṃ parikkhepā ca honti, aññamaññaṃ pariccajā ca honti. Tattha appasannā ceva nappasīdanti, pasannānañca ekaccānaṃ aññathattaṃ hoti. Ayaṃ, bhikkhave, pañcamo asamayo padhānāya. Ime kho, bhikkhave, pañca asamayā padhānāyāti. ‘‘Pañcime, bhikkhave, samayā padhānāya. Katame pañca? Idha, bhikkhave, bhikkhu daharo hoti yuvā susu kāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā. Ayaṃ, bhikkhave, paṭhamo samayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, bhikkhu appābādho hoti appātaṅko, samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya. Ayaṃ, bhikkhave, dutiyo samayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, subhikkhaṃ hoti susassaṃ sulabhapiṇḍaṃ, sukaraṃ uñchena paggahena yāpetuṃ. Ayaṃ, bhikkhave, tatiyo samayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, manussā samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti. Ayaṃ, bhikkhave, catuttho samayo padhānāya. ‘‘Puna caparaṃ, bhikkhave, saṅgho samaggo sammodamāno avivadamāno ekuddeso phāsu viharati. Saṅghe kho pana, bhikkhave, samagge na ceva aññamaññaṃ akkosā honti, na ca aññamaññaṃ paribhāsā honti, na ca aññamaññaṃ parikkhepā honti, na ca aññamaññaṃ pariccajā honti. Tattha appasannā ceva pasīdanti, pasannānañca bhiyyobhāvo [bhīyyobhāvāya (ka.)] hoti. Ayaṃ, bhikkhave, pañcamo samayo padhānāya. Ime kho, bhikkhave, pañca samayā padhānāyā’’ti. Catutthaṃ.",
      "english": "Bhikkhus, there are these five inappropriate times for striving. Which five? Here, bhikkhus, a bhikkhu is old, overcome by aging. This, bhikkhus, is the first inappropriate time for striving. Furthermore, bhikkhus, a bhikkhu is sick, overcome by illness. This, bhikkhus, is the second inappropriate time for striving. Furthermore, bhikkhus, there is a famine, the harvest is poor, alms-food is difficult to obtain, and it is not easy to sustain oneself by gleaning or begging. This, bhikkhus, is the third inappropriate time for striving. Furthermore, bhikkhus, there is danger; the wilderness is in turmoil, and people from the countryside flee in wheeled vehicles. This, bhikkhus, is the fourth inappropriate time for striving. Furthermore, bhikkhus, the Sangha is split. When the Sangha is split, bhikkhus, there are mutual insults, mutual slandering, mutual ostracism, and mutual abandonment. Therein, those who are not yet confident do not gain confidence, and some of those who are already confident fall away from conviction. This, bhikkhus, is the fifth inappropriate time for striving. These, bhikkhus, are the five inappropriate times for striving.\n\nBhikkhus, there are these five appropriate times for striving. Which five? Here, bhikkhus, a bhikkhu is young, youthful, with dark hair, endowed with the blessing of youth, in the prime of life. This, bhikkhus, is the first appropriate time for striving. Furthermore, bhikkhus, a bhikkhu is free from illness and affliction, endowed with a balanced digestive system, neither too cold nor too hot, but moderate and fit for striving. This, bhikkhus, is the second appropriate time for striving. Furthermore, bhikkhus, there is an abundance of food, the harvest is good, alms-food is easy to obtain, and it is easy to sustain oneself by gleaning or begging. This, bhikkhus, is the third appropriate time for striving. Furthermore, bhikkhus, people live in harmony, delighting in each other, not disputing, mingled like milk and water, regarding one another with loving eyes. This, bhikkhus, is the fourth appropriate time for striving. Furthermore, bhikkhus, the Sangha is united, delighting in each other, not disputing, with a single recitation, living at ease. When the Sangha is united, bhikkhus, there are no mutual insults, no mutual slandering, no mutual ostracism, and no mutual abandonment. Therein, those who are not yet confident gain confidence, and those who are already confident increase their confidence. This, bhikkhus, is the fifth appropriate time for striving. These, bhikkhus, are the five appropriate times for striving.",
      "sinhala": "මහණෙනි, වීර්යය වැඩීමට නුසුදුසු අවස්ථා පහක් මේවා ය. ඒ කවර පහක් ද? මහණෙනි, මෙහිදී භික්ෂුවක් වයෝවෘද්ධ වී ජරාවෙන් මුළුමනින්ම යටපත් වී සිටී. මහණෙනි, වීර්යය වැඩීමට නුසුදුසු පළමු අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, භික්ෂුවක් රෝගී වී ව්‍යාධියෙන් මුළුමනින්ම යටපත් වී සිටී. මහණෙනි, වීර්යය වැඩීමට නුසුදුසු දෙවැනි අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, දුර්භික්ෂයක් පවතී, අස්වැන්න දුර්වල ය, පිණ්ඩපාතය දුර්ලභ ය, සිඟා කෑමෙන් හෝ අහුලා කෑමෙන් ජීවත්වීම පහසු නොවේ. මහණෙනි, වීර්යය වැඩීමට නුසුදුසු තුන්වැනි අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, භයක් පවතී, අරණ්‍යයේ කලබලකාරී තත්වයක් ඇතිවී තිබේ, ජනපදවාසීන් රථවලින් ගමන් කරමින් (දුව පැන) ඇවිදිති. මහණෙනි, වීර්යය වැඩීමට නුසුදුසු සිව්වැනි අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, සංඝයා භේද වී සිටී. මහණෙනි, සංඝයා භේද වූ කල්හි එකිනෙකාට බැනවැදීම් ද, එකිනෙකාට පරිභව කිරීම් ද, එකිනෙකා බැහැර කිරීම් ද, එකිනෙකා අතහැර දැමීම් ද වෙයි. එහිදී අප්‍රසන්න වූවෝ පැහැදීමක් නොලබති, පැහැදුණු සමහරුන්ගේ සිත වෙනස් වෙයි. මහණෙනි, වීර්යය වැඩීමට නුසුදුසු පස්වැනි අවස්ථාව මෙයයි. මහණෙනි, වීර්යය වැඩීමට නුසුදුසු අවස්ථා පහක් මේවා ය.\n\nමහණෙනි, වීර්යය වැඩීමට සුදුසු අවස්ථා පහක් මේවා ය. ඒ කවර පහක් ද? මහණෙනි, මෙහිදී භික්ෂුවක් තරුණ ය, යෞවනයෙන් යුක්ත ය, කළු කෙස් ඇත, මනා යෞවනයකින් යුක්ත ය, ජීවිතයේ මුල් අවධියේ පසුවෙයි. මහණෙනි, වීර්යය වැඩීමට සුදුසු පළමු අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, භික්ෂුවක් නිරෝගී ය, උපද්‍රව රහිත ය, සීතල වැඩි නැති, උෂ්ණත්වය වැඩි නැති, මධ්‍යස්ථ වූ, වීර්යයට සුදුසු සමබර දිරවීමේ ශක්තියකින් යුක්ත ය. මහණෙනි, වීර්යය වැඩීමට සුදුසු දෙවැනි අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, සුභික්ෂයක් පවතී, අස්වැන්න සරු ය, පිණ්ඩපාතය පහසු ය, සිඟා කෑමෙන් හෝ අහුලා කෑමෙන් ජීවත්වීම පහසු ය. මහණෙනි, වීර්යය වැඩීමට සුදුසු තුන්වැනි අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, මනුෂ්‍යයෝ සමගි ව, සතුටින් යුක්ත ව, විවාද නොකරමින්, කිරි සහ ජලය මෙන් (මිශ්‍ර වී), එකිනෙකා ප්‍රිය ඇසින් බලමින් වාසය කරති. මහණෙනි, වීර්යය වැඩීමට සුදුසු සිව්වැනි අවස්ථාව මෙයයි.\n\nතවද මහණෙනි, සංඝයා සමගි ව, සතුටින් යුක්ත ව, විවාද නොකරමින්, එක් උදෙසීමකින් (පාතිමොක්ඛය කියවීමකින්) යුක්ත ව, සැප සේ වාසය කරති. මහණෙනි, සංඝයා සමගි වූ කල්හි එකිනෙකාට බැනවැදීම් ද, එකිනෙකාට පරිභව කිරීම් ද, එකිනෙකා බැහැර කිරීම් ද, එකිනෙකා අතහැර දැමීම් ද සිදු නොවේ. එහිදී අප්‍රසන්න වූවෝ පැහැදෙති, පැහැදුණු අයගේ ශ්‍රද්ධාව තවදුරටත් වැඩි වෙයි. මහණෙනි, වීර්යය වැඩීමට සුදුසු පස්වැනි අවස්ථාව මෙයයි. මහණෙනි, වීර්යය වැඩීමට සුදුසු අවස්ථා පහක් මේවා ය.",
      "paliTitle": "Samayasuttaṃ",
      "englishTitle": "The Discourse on Time",
      "sinhalaTitle": "සමය සූත්‍රය"
    },
    {
      "number": 55,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena sāvatthiyaṃ ubho mātāputtā vassāvāsaṃ upagamiṃsu [upasaṅkamiṃsu (ka.)] – bhikkhu ca bhikkhunī ca. Te aññamaññassa abhiṇhaṃ dassanakāmā ahesuṃ. Mātāpi puttassa abhiṇhaṃ dassanakāmā ahosi; puttopi mātaraṃ abhiṇhaṃ dassanakāmo ahosi. Tesaṃ abhiṇhaṃ dassanā saṃsaggo ahosi. Saṃsagge sati vissāso ahosi. Vissāse sati otāro ahosi. Te otiṇṇacittā sikkhaṃ apaccakkhāya dubbalyaṃ anāvikatvā methunaṃ dhammaṃ paṭiseviṃsu. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, sāvatthiyaṃ ubho mātāputtā vassāvāsaṃ upagamiṃsu – bhikkhu ca bhikkhunī ca, te aññamaññassa abhiṇhaṃ dassanakāmā ahesuṃ, mātāpi puttassa abhiṇhaṃ dassanakāmā ahosi, puttopi mātaraṃ abhiṇhaṃ dassanakāmo ahosi. Tesaṃ abhiṇhaṃ dassanā saṃsaggo ahosi, saṃsagge sati vissāso ahosi, vissāse sati otāro ahosi, te otiṇṇacittā sikkhaṃ apaccakkhāya dubbalyaṃ anāvikatvā methunaṃ dhammaṃ paṭiseviṃsū’’ti. ‘‘Kiṃ nu so, bhikkhave, moghapuriso maññati – ‘na mātā putte sārajjati, putto vā pana mātarī’ti? Nāhaṃ, bhikkhave, aññaṃ ekarūpampi samanupassāmi evaṃ [yaṃ evaṃ (sī.)] rajanīyaṃ evaṃ kamanīyaṃ evaṃ madanīyaṃ evaṃ bandhanīyaṃ evaṃ mucchanīyaṃ evaṃ antarāyakaraṃ anuttarassa yogakkhemassa adhigamāya yathayidaṃ, bhikkhave, itthirūpaṃ. Itthirūpe, bhikkhave, sattā rattā giddhā gathitā [gadhitā (syā. pī. ka.)] mucchitā ajjhosannā [ajjhopannā (bahūsu)]. Te dīgharattaṃ socanti itthirūpavasānugā. ‘‘Nāhaṃ, bhikkhave, aññaṃ ekasaddampi…pe… ekagandhampi… ekarasampi… ekaphoṭṭhabbampi samanupassāmi evaṃ rajanīyaṃ evaṃ kamanīyaṃ evaṃ madanīyaṃ evaṃ bandhanīyaṃ evaṃ mucchanīyaṃ evaṃ antarāyakaraṃ anuttarassa yogakkhemassa adhigamāya yathayidaṃ, bhikkhave, itthiphoṭṭhabbaṃ. Itthiphoṭṭhabbe, bhikkhave, sattā rattā giddhā gathitā mucchitā ajjhosannā. Te dīgharattaṃ socanti itthiphoṭṭhabbavasānugā. ‘‘Itthī, bhikkhave, gacchantīpi purisassa cittaṃ pariyādāya tiṭṭhati; ṭhitāpi…pe… nisinnāpi… sayānāpi… hasantīpi… bhaṇantīpi… gāyantīpi… rodantīpi… ugghātitāpi [ugghānitāpi (sī.)] … matāpi purisassa cittaṃ pariyādāya tiṭṭhati. Yañhi taṃ, bhikkhave, sammā vadamāno vadeyya – ‘samantapāso mārassā’ti mātugāmaṃyeva sammā vadamāno vadeyya – ‘samantapāso mārassā’’’ti. ‘‘Sallape asihatthena, pisācenāpi sallape; Āsīvisampi āsīde [āsadde (syā. kaṃ.)], yena daṭṭho na jīvati. ‘‘Natveva eko ekāya, mātugāmena sallape; Muṭṭhassatiṃ tā bandhanti, pekkhitena sitena ca [mhitena ca (syā. kaṃ.)]. ‘‘Athopi dunnivatthena, mañjunā bhaṇitena ca; Neso jano svāsīsado, api ugghātito mato. ‘‘Pañca kāmaguṇā ete, itthirūpasmiṃ dissare; Rūpā saddā rasā gandhā, phoṭṭhabbā ca manoramā. ‘‘Tesaṃ kāmoghavūḷhānaṃ, kāme aparijānataṃ; Kālaṃ gati [gatiṃ (sī. syā. kaṃ. pī.)] bhavābhavaṃ, saṃsārasmiṃ purakkhatā. ‘‘Ye ca kāme pariññāya, caranti akutobhayā; Te ve pāraṅgatā loke, ye pattā āsavakkhaya’’nti. pañcamaṃ;",
      "english": "Once the Blessed One was staying at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. Now, at that time, a monk and a nun, who were mother and son, had entered upon the rains retreat in Sāvatthī. They frequently desired to see each other. The mother desired to see her son often, and the son desired to see his mother often. From their frequent seeing, there arose familiarity. With familiarity, there arose intimacy. With intimacy, there arose an opening for misconduct. With their minds overcome, without renouncing the training, and without declaring their weakness, they indulged in sexual intercourse.\n\nThen, many monks approached the Blessed One. Having approached and paid homage to the Blessed One, they sat down to one side. Sitting to one side, those monks said to the Blessed One: \"Here, venerable sir, a monk and a nun, who are mother and son, entered upon the rains retreat in Sāvatthī. They frequently desired to see each other. The mother desired to see her son often, and the son desired to see his mother often. From their frequent seeing, there arose familiarity. With familiarity, there arose intimacy. With intimacy, there arose an opening for misconduct. With their minds overcome, without renouncing the training, and without declaring their weakness, they indulged in sexual intercourse.\"\n\n\"Monks, what does that deluded person imagine? That 'a mother does not become attached to her son, nor a son to his mother'? Monks, I do not see any other single form that is so alluring, so enticing, so intoxicating, so binding, so deluding, and so obstructive to the attainment of the unsurpassed security from bondage, as is the female form. Monks, beings, when attached to the female form, are greedy, bound, infatuated, and utterly immersed. They grieve for a long time, being under the sway of the female form.\"\n\n\"Monks, I do not see any other single sound, any single scent, any single taste, or any single tangible object that is so alluring, so enticing, so intoxicating, so binding, so deluding, and so obstructive to the attainment of the unsurpassed security from bondage, as is female touch. Monks, beings, when attached to female touch, are greedy, bound, infatuated, and utterly immersed. They grieve for a long time, being under the sway of female touch.\"\n\n\"Monks, a woman, whether walking, standing, sitting, lying down, laughing, speaking, singing, weeping, even when adorned, or even when dead, takes hold of a man's mind and remains there. Monks, if one were to rightly say of anything, 'It is Mara's snare all around,' it is of women that one would rightly say, 'It is Mara's snare all around.'\"\n\nOne might converse with a sword in hand,\nOr even with a demon might one speak.\nOne might approach a venomous snake,\nBy which one bitten does not live.\n\nBut one should never converse alone with a woman.\nThey bind the unmindful with their glances and smiles.\n\nFurthermore, even by means of unkempt attire and charming speech,\nSuch a one is not to be approached as if harmless, even if adorned or dead.\n\nThese five strands of sensual pleasure are seen in women:\nPleasing forms, sounds, tastes, scents, and tangible objects.\n\nThose who are swept away by the flood of sensual pleasures,\nNot fully understanding them, are kept to wander\nThrough birth and death in transmigration for a long time.\n\nBut those who, having fully understood sensual pleasures,\nFare on fearless, they indeed have reached the other shore in the world,\nThey have attained the destruction of defilements.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එසමයෙහි සැවැත්නුවර මව සහ පුතු දෙදෙනාම – මහණ කෙනෙක් සහ මෙහෙණියක් – වස්සාවාසය සඳහා වැඩම කළහ. ඔවුහු නිතර එකිනෙකා දැකීමට කැමැත්තෝ වූහ. මවද පුතු නිතර දැකීමට කැමැත්තී වූවාය; පුතුද මව නිතර දැකීමට කැමැත්තෙක් විය. ඔවුන් නිතර දකින නිසා (අන්‍යෝන්‍ය වශයෙන්) ඇසුර ඇති විය. ඇසුර ඇති කල්හි විශ්වාසය ඇති විය. විශ්වාසය ඇති කල්හි (කාමයන්ට) අවකාශය ඇති විය. ඔවුහු තම සිත් (කාමරාගයෙන්) යටපත් වූ කල්හි, ශික්ෂාව අත්නොහැර, දුබලකම ප්‍රකාශ නොකොට මෛථුන ධර්මයෙහි යෙදුණහ. ඉක්බිති බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩසිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, මෙහි සැවැත්නුවර මව සහ පුතු දෙදෙනාම – මහණ කෙනෙක් සහ මෙහෙණියක් – වස්සාවාසය සඳහා වැඩම කළහ. ඔවුහු නිතර එකිනෙකා දැකීමට කැමැත්තෝ වූහ. මවද පුතු නිතර දැකීමට කැමැත්තී වූවාය; පුතුද මව නිතර දැකීමට කැමැත්තෙක් විය. ඔවුන් නිතර දකින නිසා (අන්‍යෝන්‍ය වශයෙන්) ඇසුර ඇති විය. ඇසුර ඇති කල්හි විශ්වාසය ඇති විය. විශ්වාසය ඇති කල්හි (කාමයන්ට) අවකාශය ඇති විය. ඔවුහු තම සිත් (කාමරාගයෙන්) යටපත් වූ කල්හි, ශික්ෂාව අත්නොහැර, දුබලකම ප්‍රකාශ නොකොට මෛථුන ධර්මයෙහි යෙදුණහ.”\n\n“මහණෙනි, ඒ මෝඝ පුරුෂයා ‘මව පුතු කෙරෙහි නොඇලෙයි, එසේත් නැතිනම් පුතු මව කෙරෙහි නොඇලෙයි’ යැයි සිතන්නේද? මහණෙනි, මේ ස්ත්‍රී රූපය මෙන් අනුත්තර වූ යෝගක්‍ෂේමය අවබෝධ කර ගැනීමට මෙසේ රන්වන් වූ, මෙසේ මනරම් වූ, මෙසේ මත් කරවන, මෙසේ බඳවන, මෙසේ මුලා කරවන, මෙසේ අන්තරායකර වූ වෙන එකම රූපයක්වත් මම නොදකිමි. මහණෙනි, සත්ත්වයෝ ස්ත්‍රී රූපයෙහි ඇලී, දැඩි ලෝභයෙන් ග්‍රහණය වී, බැඳී, මුලා වී, ගිලී සිටිති. ඔවුහු ස්ත්‍රී රූපයේ වසඟයට ගොස් දීර්ඝ කාලයක් ශෝක කරති.\n\n“මහණෙනි, මේ ස්ත්‍රී ස්පර්ශය මෙන් අනුත්තර වූ යෝගක්‍ෂේමය අවබෝධ කර ගැනීමට මෙසේ රන්වන් වූ, මෙසේ මනරම් වූ, මෙසේ මත් කරවන, මෙසේ බඳවන, මෙසේ මුලා කරවන, මෙසේ අන්තරායකර වූ වෙන එකම ශබ්දයක්වත්, එකම ගන්ධයක්වත්, එකම රසයක්වත්, වෙන කිසිදු ස්පර්ශයක්වත් මම නොදකිමි. මහණෙනි, සත්ත්වයෝ ස්ත්‍රී ස්පර්ශයෙහි ඇලී, දැඩි ලෝභයෙන් ග්‍රහණය වී, බැඳී, මුලා වී, ගිලී සිටිති. ඔවුහු ස්ත්‍රී ස්පර්ශයේ වසඟයට ගොස් දීර්ඝ කාලයක් ශෝක කරති.\n\n“මහණෙනි, ස්ත්‍රියක් යන්නී ද පුරුෂයාගේ සිත වශී කොට සිටින්නීය; සිටගන්නී ද... හිඳගන්නී ද... නිදාගන්නී ද... සිනාසෙන්නී ද... කතා කරන්නී ද... ගී ගයන්නී ද... හඬන්නී ද... විලාප දෙන්නී ද... මළත් ද පුරුෂයාගේ සිත වශී කොට සිටින්නීය. මහණෙනි, යමෙක් “මාරයාගේ හැම අතින්ම බඳින මලපතයකි” යැයි නිවැරදිව පවසන්නේ නම්, මාරයාගේ හැම අතින්ම බඳින මලපතට සමාන වන්නේ ස්ත්‍රියම යැයි නිවැරදිව පැවසිය යුතුය.”\n\n“කඩු අතින් ගත් අයකු සමග වුවද කතා කරනු; පිශාචයකු සමග වුවද කතා කරනු; දෂ්ට කළ විට නොනැසී නොසිටින ආසීවිෂ නාගයකු වෙත වුවද එළඹෙනු. එහෙත් කිසි විටෙකත් තනිව එක ස්ත්‍රියක් සමග කතා නොකරනු. ඔවුන් (ස්ත්‍රීහු) සිහි කල්පනාව නැති පුරුෂයන් තමන්ගේ බැල්මෙන් සහ සිනහවෙන් බැඳ දමති.\n\n“එසේම විනීත නොවන ඇඳුමෙන් ද, මනරම් කතාවෙන් ද (ඔවුහු පුරුෂයන් බැඳ දමති). මේ ස්ත්‍රී පිරිස ආසීවිෂ නාගයෙකුට වඩා දරුණු ය; මළත්, විලාප දෙමින් සිටියත්, (ඔවුන්ගේ සිත වශී කරති).\n\n“මේ පංච කාම ගුණයෝ ස්ත්‍රී රූපයෙහි දක්නා ලැබෙති. ඒවා නම්: මනරම් වූ රූප, ශබ්ද, රස, ගන්ධ, සහ ස්පර්ශ යි.\n\n“ඒ කාම ගුණයන්ගේ ඕඝයෙන් ගසාගෙන යන, කාමයන් අවබෝධ නොකරන ඒ සත්වයන්ට භවයන්ගෙන් භවයන්ට ගමන් කරමින්, සංසාරයෙහි ඉදිරියට ගෙන යනු ලැබේ.\n\n“යම් කෙනෙක් නම් කාමයන් ප්‍රඥාවෙන් පිරිසිඳ දැන, කිසි බියක් නොමැතිව හැසිරෙත්ද; ඔවුහු නියත වශයෙන්ම ලෝකයෙන් එතෙර වූවෝ ය; ආශ්‍රවයන්ගේ ක්ෂය කිරීම අත්පත් කරගත් අය වෙති.”",
      "paliTitle": "Mātāputtasuttaṃ",
      "englishTitle": "Mother and Son Sutta",
      "sinhalaTitle": "මාතාපුත්ත සූත්‍රය"
    },
    {
      "number": 56,
      "pali": "Atha kho aññataro bhikkhu yena sako upajjhāyo tenupasaṅkami; upasaṅkamitvā sakaṃ upajjhāyaṃ etadavoca – ‘‘etarahi me, bhante, madhurakajāto ceva kāyo, disā ca me na pakkhāyanti, dhammā ca maṃ nappaṭibhanti, thinamiddhañca me cittaṃ pariyādāya tiṭṭhati, anabhirato ca brahmacariyaṃ carāmi, atthi ca me dhammesu vicikicchā’’ti. Atha kho so bhikkhu taṃ saddhivihārikaṃ bhikkhuṃ ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ayaṃ, bhante, bhikkhu evamāha – ‘etarahi me, bhante, madhurakajāto ceva kāyo, disā ca maṃ na pakkhāyanti, dhammā ca me nappaṭibhanti, thinamiddhañca me cittaṃ pariyādāya tiṭṭhati, anabhirato ca brahmacariyaṃ carāmi, atthi ca me dhammesu vicikicchā’’’ti. ‘‘Evañhetaṃ, bhikkhu, hoti indriyesu aguttadvārassa, bhojane amattaññuno, jāgariyaṃ ananuyuttassa, avipassakassa kusalānaṃ dhammānaṃ, pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogaṃ ananuyuttassa viharato, yaṃ madhurakajāto ceva kāyo hoti, disā cassa na pakkhāyanti, dhammā ca taṃ nappaṭibhanti, thinamiddhañcassa cittaṃ pariyādāya tiṭṭhati, anabhirato ca brahmacariyaṃ carati, hoti cassa dhammesu vicikicchā. Tasmātiha te, bhikkhu, evaṃ sikkhitabbaṃ – ‘indriyesu guttadvāro bhavissāmi, bhojane mattaññū, jāgariyaṃ anuyutto, vipassako kusalānaṃ dhammānaṃ, pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogaṃ anuyutto viharissāmī’ti. Evañhi te, bhikkhu, sikkhitabba’’nti. Atha kho so bhikkhu bhagavatā iminā ovādena ovadito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro pana so bhikkhu arahataṃ ahosi. Atha kho so bhikkhu arahattaṃ patto yena sako upajjhāyo tenupasaṅkami; upasaṅkamitvā sakaṃ upajjhāyaṃ etadavoca – ‘‘etarahi me, bhante, na ceva [na tveva (sī.)] madhurakajāto kāyo, disā ca me pakkhāyanti, dhammā ca maṃ paṭibhanti, thinamiddhañca me cittaṃ na pariyādāya tiṭṭhati, abhirato ca brahmacariyaṃ carāmi, natthi ca me dhammesu vicikicchā’’ti. Atha kho so bhikkhu taṃ saddhivihārikaṃ bhikkhuṃ ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ayaṃ, bhante, bhikkhu evamāha – ‘etarahi me, bhante, na ceva madhurakajāto kāyo, disā ca me pakkhāyanti, dhammā ca maṃ paṭibhanti, thinamiddhañca me cittaṃ na pariyādāya tiṭṭhati, abhirato ca brahmacariyaṃ carāmi, natthi ca me dhammesu vicikicchā’’’ti. ‘‘Evañhetaṃ, bhikkhu, hoti indriyesu guttadvārassa, bhojane mattaññuno, jāgariyaṃ anuyuttassa, vipassakassa kusalānaṃ dhammānaṃ, pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogaṃ anuyuttassa viharato, yaṃ na ceva madhurakajāto kāyo hoti, disā cassa pakkhāyanti, dhammā ca taṃ paṭibhanti, thinamiddhañcassa cittaṃ na pariyādāya tiṭṭhati, abhirato ca brahmacariyaṃ carati, na cassa hoti dhammesu vicikicchā. Tasmātiha vo, bhikkhave, evaṃ sikkhitabbaṃ – ‘indriyesu guttadvārā bhavissāma, bhojane mattaññuno, jāgariyaṃ anuyuttā, vipassakā kusalānaṃ dhammānaṃ, pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogaṃ anuyuttā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Chaṭṭhaṃ.",
      "english": "Then a certain bhikkhu approached his own preceptor. Having approached, he said to his preceptor: \"At present, venerable sir, my body feels as if it were drugged, and the directions are unclear to me, and the teachings do not become clear to me, and sloth and torpor completely overcome my mind, and I live the spiritual life without delight, and I have doubt concerning the teachings.\" Then that bhikkhu, taking that co-resident bhikkhu, approached the Blessed One. Having approached, he bowed to the Blessed One and sat down to one side. Seated to one side, that bhikkhu said to the Blessed One: \"Venerable sir, this bhikkhu says thus: ‘At present, venerable sir, my body feels as if it were drugged, and the directions are unclear to me, and the teachings do not become clear to me, and sloth and torpor completely overcome my mind, and I live the spiritual life without delight, and I have doubt concerning the teachings.’\"\n\n\"It is indeed so, bhikkhu, for one who does not guard the sense doors, who is immoderate in eating, who is not devoted to wakefulness, who does not clearly see wholesome states, who does not apply himself to the development of the factors of awakening during the first and last watches of the night while dwelling, that his body feels as if drugged, and the directions are unclear to him, and the teachings do not become clear to him, and sloth and torpor completely overcome his mind, and he lives the spiritual life without delight, and he has doubt concerning the teachings. Therefore, bhikkhu, you should train yourself thus: ‘I will guard the doors of my senses, I will be moderate in eating, I will be devoted to wakefulness, I will clearly see wholesome states, I will apply myself to the development of the factors of awakening during the first and last watches of the night while dwelling.’ Indeed, bhikkhu, you should train yourself in this way.\"\n\nThen that bhikkhu, being exhorted by the Blessed One with this admonition, rose from his seat, bowed to the Blessed One, circumambulated him respectfully, and departed.\n\nThen that bhikkhu, dwelling secluded, diligent, ardent, and resolute, not long thereafter, while dwelling thus, for the sake of which noble sons rightly go forth from home into homelessness, that unsurpassable culmination of the spiritual life, he realized, by his own direct knowledge, in this very life, and attained to and dwelt in. He knew: \"Destroyed is birth, the spiritual life has been lived, what had to be done has been done, there is no more for this state of being.\" Indeed, that bhikkhu became one of the Arahants.\n\nThen that bhikkhu, having attained Arahantship, approached his own preceptor. Having approached, he said to his preceptor: \"At present, venerable sir, my body no longer feels as if drugged, and the directions are clear to me, and the teachings become clear to me, and sloth and torpor do not overcome my mind, and I live the spiritual life with delight, and I have no doubt concerning the teachings.\" Then that bhikkhu, taking that co-resident bhikkhu, approached the Blessed One. Having approached, he bowed to the Blessed One and sat down to one side. Seated to one side, that bhikkhu said to the Blessed One: \"Venerable sir, this bhikkhu says thus: ‘At present, venerable sir, my body no longer feels as if drugged, and the directions are clear to me, and the teachings become clear to me, and sloth and torpor do not overcome my mind, and I live the spiritual life with delight, and I have no doubt concerning the teachings.’\"\n\n\"It is indeed so, bhikkhu, for one who guards the sense doors, who is moderate in eating, who is devoted to wakefulness, who clearly sees wholesome states, who applies himself to the development of the factors of awakening during the first and last watches of the night while dwelling, that his body no longer feels as if drugged, and the directions are clear to him, and the teachings become clear to him, and sloth and torpor do not overcome his mind, and he lives the spiritual life with delight, and he has no doubt concerning the teachings. Therefore, bhikkhus, you should train yourselves thus: ‘We will guard the doors of our senses, we will be moderate in eating, we will be devoted to wakefulness, we will clearly see wholesome states, we will apply ourselves to the development of the factors of awakening during the first and last watches of the night while dwelling.’ Indeed, bhikkhus, you should train yourselves in this way.\"",
      "sinhala": "එක්තරා භික්ෂුවක් තමාගේ උපාධ්‍යායයා වෙත ළඟා විය; ළඟා වී තම උපාධ්‍යායයාට මෙසේ පැවසීය: \"වහන්ස, මේ දිනවල මගේ ශරීරය බර වී, අලස වී ඇත. දිශා පවා මට නොපෙනෙන්නා සේය. ධර්ම‍ය පවා මට වැටහෙන්නේ නැත. තීනමිද්ධය මගේ සිත වෙළාගෙන පවතී. මම බ්‍රහ්මචාරී ජීවිතය අප්‍රසන්නව වාසය කරමි. ධර්ම‍ය සම්බන්ධයෙන් මට සැකයක් ද ඇත.\" එවිට ඒ භික්ෂුව තම ශිෂ්‍ය භික්ෂුව කැටුව භාග්‍ය‍වතුන් වහන්සේ වෙත ළඟා විය; ළඟා වී භාග්‍ය‍වතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩ සිටි ඒ භික්ෂුව භාග්‍ය‍වතුන් වහන්සේට මෙසේ පැවසීය: \"වහන්ස, මේ භික්ෂුව මෙසේ කියයි: 'වහන්ස, මේ දිනවල මගේ ශරීරය බර වී, අලස වී ඇත. දිශා පවා මට නොපෙනෙන්නා සේය. ධර්ම‍ය පවා මට වැටහෙන්නේ නැත. තීනමිද්ධය මගේ සිත වෙළාගෙන පවතී. මම බ්‍රහ්මචාරී ජීවිතය අප්‍රසන්නව වාසය කරමි. ධර්ම‍ය සම්බන්ධයෙන් මට සැකයක් ද ඇත.'\"\n\n\"භික්ෂුව, ඉන්ද්‍රියයන්හි දොරටු නොරැකි, භෝජනයෙහි මාත්‍රා නොදත්, නින්දෙන් තොරව (ප්‍රමාද නොවී) නොවසන, කුසල ධර්මයන් විපස්සනා නොකරන, පෙරයමෙහිත් පසුයමෙහිත් බෝධිපාක්‍ෂික ධර්මයන් භාවනා කිරීමෙහි යෙදී නොවසන පුද්ගලයාට මෙසේ සිදු වේ. එනම්, ඔහුගේ ශරීරය බර වී, අලස වේ; දිශා පවා ඔහුට නොපෙනෙන්නා සේ වේ; ධර්ම‍ය පවා ඔහුට වැටහෙන්නේ නැත; තීනමිද්ධය ඔහුගේ සිත වෙළාගෙන පවතී; ඔහු බ්‍රහ්මචාරී ජීවිතය අප්‍රසන්නව වාසය කරයි; ධර්ම‍ය සම්බන්ධයෙන් ඔහුට සැකයක් ද ඇති වේ. එබැවින්, භික්ෂුව, ඔබ මෙසේ හික්මිය යුතුය: 'මම ඉන්ද්‍රියයන්හි දොරටු රකින්නෙක් වන්නෙමි. භෝජනයෙහි මාත්‍රා දන්නෙක් වන්නෙමි. නින්දෙන් තොරව වාසය කිරීමට යෙදෙන්නෙක් වන්නෙමි. කුසල ධර්මයන් විපස්සනා කරන්නෙක් වන්නෙමි. පෙරයමෙහිත් පසුයමෙහිත් බෝධිපාක්‍ෂික ධර්මයන් භාවනා කිරීමෙහි යෙදී වාසය කරන්නෙක් වන්නෙමි.' භික්ෂුව, ඔබ මෙසේම හික්මිය යුතුය.\"\n\nඑවිට ඒ භික්ෂුව භාග්‍ය‍වතුන් වහන්සේ විසින් මේ අනුශාසනාවෙන් අනුශාසනා ලැබ, අසුනෙන් නැගිට, භාග්‍ය‍වතුන් වහන්සේට වැඳ, පැදකුණු කොට, පිටත්ව ගියේය. එවිට ඒ භික්ෂුව තනිව, විවේක ස්ථානයකට වී, අප්‍රමාදීව, දැඩි වීර්යයෙන්, සිත (නිවන් මඟට) යොමු කොට වාසය කරමින්, වැඩි කලක් නොගොස්ම, යම් අර්ථයක් පිණිස කුල ප්‍රත්‍ය පුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික (පැවිදි) බවට පැමිණෙත් ද, ඒ අනුත්තර වූ බ්‍රහ්මචාරී ජීවිතයේ කෙළවර වූ අරහත් ඵලය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් ප්‍රත්‍යක්‍ෂ කොට, අවබෝධ කොට වාසය කළේය. \"ඉපදීම ක්ෂය විය. බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කරන ලදී. කළ යුතු දේ කරන ලදී. මේ තත්ත්වය පිණිස අන් කිසිවක් නැත\" යැයි ඔහු ප්‍රත්‍යක්‍ෂයෙන්ම අවබෝධ කළේය. ඒ භික්ෂුව රහතන් වහන්සේ නමක් බවට පත් විය.\n\nඑවිට ඒ භික්ෂුව අරහත් ඵලයට පැමිණ තමාගේ උපාධ්‍යායයා වෙත ළඟා විය; ළඟා වී තම උපාධ්‍යායයාට මෙසේ පැවසීය: \"වහන්ස, මේ දිනවල මගේ ශරීරය බර වී, අලස වී නැත. දිශා මට පැහැදිලිව පෙනේ. ධර්ම‍ය මට පැහැදිලිව වැටහේ. තීනමිද්ධය මගේ සිත වෙළාගෙන නොපවතී. මම බ්‍රහ්මචාරී ජීවිතය ප්‍රසන්නව වාසය කරමි. ධර්ම‍ය සම්බන්ධයෙන් මට කිසිදු සැකයක් ද නැත.\" එවිට ඒ භික්ෂුව තම ශිෂ්‍ය භික්ෂුව කැටුව භාග්‍ය‍වතුන් වහන්සේ වෙත ළඟා විය; ළඟා වී භාග්‍ය‍වතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩ සිටි ඒ භික්ෂුව භාග්‍ය‍වතුන් වහන්සේට මෙසේ පැවසීය: \"වහන්ස, මේ භික්ෂුව මෙසේ කියයි: 'වහන්ස, මේ දිනවල මගේ ශරීරය බර වී, අලස වී නැත. දිශා මට පැහැදිලිව පෙනේ. ධර්ම‍ය මට පැහැදිලිව වැටහේ. තීනමිද්ධය මගේ සිත වෙළාගෙන නොපවතී. මම බ්‍රහ්මචාරී ජීවිතය ප්‍රසන්නව වාසය කරමි. ධර්ම‍ය සම්බන්ධයෙන් මට කිසිදු සැකයක් ද නැත.'\"\n\n\"භික්ෂුව, ඉන්ද්‍රියයන්හි දොරටු රැකි, භෝජනයෙහි මාත්‍රා දත්, නින්දෙන් තොරව වාසය කිරීමට යෙදෙන, කුසල ධර්මයන් විපස්සනා කරන, පෙරයමෙහිත් පසුයමෙහිත් බෝධිපාක්‍ෂික ධර්මයන් භාවනා කිරීමෙහි යෙදී වාසය කරන පුද්ගලයාට මෙසේ සිදු වේ. එනම්, ඔහුගේ ශරීරය බර වී, අලස නොවේ; දිශා ඔහුට පැහැදිලිව පෙනේ; ධර්ම‍ය ඔහුට පැහැදිලිව වැටහේ; තීනමිද්ධය ඔහුගේ සිත වෙළාගෙන නොපවතී; ඔහු බ්‍රහ්මචාරී ජීවිතය ප්‍රසන්නව වාසය කරයි; ධර්ම‍ය සම්බන්ධයෙන් ඔහුට කිසිදු සැකයක් ද ඇති නොවේ. එබැවින්, මහණෙනි, ඔබලා මෙසේ හික්මිය යුතුය: 'අපි ඉන්ද්‍රියයන්හි දොරටු රකින්නෝ වන්නෙමු. භෝජනයෙහි මාත්‍රා දන්නෝ වන්නෙමු. නින්දෙන් තොරව වාසය කිරීමට යෙදෙන්නෝ වන්නෙමු. කුසල ධර්මයන් විපස්සනා කරන්නෝ වන්නෙමු. පෙරයමෙහිත් පසුයමෙහිත් බෝධිපාක්‍ෂික ධර්මයන් භාවනා කිරීමෙහි යෙදී වාසය කරන්නෝ වන්නෙමු.' මහණෙනි, ඔබලා මෙසේම හික්මිය යුතුය.\"",
      "paliTitle": "Upajjhāyasuttaṃ",
      "englishTitle": "The Discourse on the Preceptor",
      "sinhalaTitle": "උපජ්ඣාය සූත්‍රය"
    },
    {
      "number": 57,
      "pali": "‘‘Pañcimāni, bhikkhave, ṭhānāni abhiṇhaṃ paccavekkhitabbāni itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. Katamāni pañca? ‘Jarādhammomhi, jaraṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘Byādhidhammomhi, byādhiṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘Maraṇadhammomhi, maraṇaṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘Sabbehi me piyehi manāpehi nānābhāvo vinābhāvo’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘Kammassakomhi, kammadāyādo kammayoni kammabandhu kammapaṭisaraṇo. Yaṃ kammaṃ karissāmi – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādo bhavissāmī’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘‘Kiñca, bhikkhave, atthavasaṃ paṭicca ‘jarādhammomhi, jaraṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā? Atthi, bhikkhave, sattānaṃ yobbane yobbanamado, yena madena mattā kāyena duccaritaṃ caranti, vācāya duccaritaṃ caranti, manasā duccaritaṃ caranti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato yo yobbane yobbanamado so sabbaso vā pahīyati tanu vā pana hoti. Idaṃ kho, bhikkhave, atthavasaṃ paṭicca ‘jarādhammomhi, jaraṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘‘Kiñca, bhikkhave, atthavasaṃ paṭicca ‘byādhidhammomhi, byādhiṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā? Atthi, bhikkhave, sattānaṃ ārogye ārogyamado, yena madena mattā kāyena duccaritaṃ caranti, vācāya duccaritaṃ caranti, manasā duccaritaṃ caranti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato yo ārogye ārogyamado so sabbaso vā pahīyati tanu vā pana hoti. Idaṃ kho, bhikkhave, atthavasaṃ paṭicca ‘byādhidhammomhi, byādhiṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘‘Kiñca, bhikkhave, atthavasaṃ paṭicca ‘maraṇadhammomhi, maraṇaṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā? Atthi, bhikkhave, sattānaṃ jīvite jīvitamado, yena madena mattā kāyena duccaritaṃ caranti, vācāya duccaritaṃ caranti, manasā duccaritaṃ caranti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato yo jīvite jīvitamado so sabbaso vā pahīyati tanu vā pana hoti. Idaṃ kho, bhikkhave, atthavasaṃ paṭicca ‘maraṇadhammomhi, maraṇaṃ anatīto’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘‘Kiñca, bhikkhave, atthavasaṃ paṭicca ‘sabbehi me piyehi manāpehi nānābhāvo vinābhāvo’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā? Atthi, bhikkhave, sattānaṃ piyesu manāpesu yo chandarāgo yena rāgena rattā kāyena duccaritaṃ caranti, vācāya duccaritaṃ caranti, manasā duccaritaṃ caranti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato yo piyesu manāpesu chandarāgo so sabbaso vā pahīyati tanu vā pana hoti. Idaṃ kho, bhikkhave, atthavasaṃ paṭicca ‘sabbehi me piyehi manāpehi nānābhāvo vinābhāvo’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘‘Kiñca, bhikkhave, atthavasaṃ paṭicca ‘kammassakomhi, kammadāyādo kammayoni kammabandhu kammapaṭisaraṇo, yaṃ kammaṃ karissāmi – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādo bhavissāmī’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā? Atthi, bhikkhave, sattānaṃ kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato sabbaso vā duccaritaṃ pahīyati tanu vā pana hoti. Idaṃ kho, bhikkhave, atthavasaṃ paṭicca ‘kammassakomhi, kammadāyādo kammayoni kammabandhu kammapaṭisaraṇo, yaṃ kammaṃ karissāmi – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādo bhavissāmī’ti abhiṇhaṃ paccavekkhitabbaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā. ‘‘Sa kho [sace (pī. ka.)] so, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘na kho ahaññeveko jarādhammo [ahañceveko jarādhammomhi (ka.)] jaraṃ anatīto, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbe sattā jarādhammā jaraṃ anatītā’ti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni sabbaso pahīyanti anusayā byantīhonti. ‘‘Sa kho so, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘na kho ahaññeveko byādhidhammo byādhiṃ anatīto, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbe sattā byādhidhammā byādhiṃ anatītā’ti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni sabbaso pahīyanti, anusayā byantīhonti. ‘‘Sa kho so, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘na kho ahaññeveko maraṇadhammo maraṇaṃ anatīto, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbe sattā maraṇadhammā maraṇaṃ anatītā’ti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni sabbaso pahīyanti, anusayā byantīhonti. ‘‘Sa kho so, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘na kho mayhevekassa sabbehi piyehi manāpehi nānābhāvo vinābhāvo, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ piyehi manāpehi nānābhāvo vinābhāvo’ti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni sabbaso pahīyanti, anusayā byantīhonti. ‘‘Sa kho so, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘na kho ahaññeveko kammassako kammadāyādo kammayoni kammabandhu kammappaṭisaraṇo, yaṃ kammaṃ karissāmi – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādo bhavissāmi; atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbe sattā kammassakā kammadāyādā kammayoni kammabandhu kammappaṭisaraṇā, yaṃ kammaṃ karissanti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavissantī’ti. Tassa taṃ ṭhānaṃ abhiṇhaṃ paccavekkhato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni sabbaso pahīyanti, anusayā byantīhontī’’ti. ‘‘Byādhidhammā jarādhammā, atho maraṇadhammino; Yathā dhammā tathā sattā [santā (syā. kaṃ.)], jigucchanti puthujjanā. ‘‘Ahañce taṃ jiguccheyyaṃ, evaṃ dhammesu pāṇisu; Na metaṃ patirūpassa, mama evaṃ vihārino. ‘‘Sohaṃ evaṃ viharanto, ñatvā dhammaṃ nirūpadhiṃ; Ārogye yobbanasmiñca, jīvitasmiñca ye madā. ‘‘Sabbe made abhibhosmi, nekkhammaṃ daṭṭhu khemato [nekkhamme daṭṭhu khemataṃ (a. ni. 3.39) ubhayatthapi aṭṭhakathāya sameti]; Tassa me ahu ussāho, nibbānaṃ abhipassato. ‘‘Nāhaṃ bhabbo etarahi, kāmāni paṭisevituṃ; Anivatti [anivattī (?)] bhavissāmi, brahmacariyaparāyaṇo’’ti. sattamaṃ;",
      "english": "Monastics, these five subjects are to be constantly reflected upon by a woman or a man, by a householder or one gone forth. What are these five? ‘I am subject to aging; I have not gone beyond aging’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth. ‘I am subject to illness; I have not gone beyond illness’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth. ‘I am subject to death; I have not gone beyond death’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth. ‘From all that is dear and pleasing to me there will be separation and disjunction’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth. ‘I am the owner of my kamma, the heir of my kamma, born of my kamma, related through my kamma, and have my kamma as my refuge. Whatever kamma I shall perform – whether good or bad – I shall be its heir’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth.\n\nAnd for what purpose, monastics, should ‘I am subject to aging; I have not gone beyond aging’ be constantly reflected upon by a woman or a man, by a householder or one gone forth? Monastics, there is for beings the intoxication of youth in youth, by which intoxication they, being infatuated, perform bad conduct by body, perform bad conduct by speech, and perform bad conduct by mind. For one who constantly reflects on that subject, that intoxication of youth is either completely abandoned or it becomes attenuated. This, monastics, is the purpose for which ‘I am subject to aging; I have not gone beyond aging’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth.\n\nAnd for what purpose, monastics, should ‘I am subject to illness; I have not gone beyond illness’ be constantly reflected upon by a woman or a man, by a householder or one gone forth? Monastics, there is for beings the intoxication of health in health, by which intoxication they, being infatuated, perform bad conduct by body, perform bad conduct by speech, and perform bad conduct by mind. For one who constantly reflects on that subject, that intoxication of health is either completely abandoned or it becomes attenuated. This, monastics, is the purpose for which ‘I am subject to illness; I have not gone beyond illness’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth.\n\nAnd for what purpose, monastics, should ‘I am subject to death; I have not gone beyond death’ be constantly reflected upon by a woman or a man, by a householder or one gone forth? Monastics, there is for beings the intoxication of life in life, by which intoxication they, being infatuated, perform bad conduct by body, perform bad conduct by speech, and perform bad conduct by mind. For one who constantly reflects on that subject, that intoxication of life is either completely abandoned or it becomes attenuated. This, monastics, is the purpose for which ‘I am subject to death; I have not gone beyond death’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth.\n\nAnd for what purpose, monastics, should ‘From all that is dear and pleasing to me there will be separation and disjunction’ be constantly reflected upon by a woman or a man, by a householder or one gone forth? Monastics, there is for beings the passionate desire for dear and pleasing things, by which passion they, being inflamed, perform bad conduct by body, perform bad conduct by speech, and perform bad conduct by mind. For one who constantly reflects on that subject, that passionate desire for dear and pleasing things is either completely abandoned or it becomes attenuated. This, monastics, is the purpose for which ‘From all that is dear and pleasing to me there will be separation and disjunction’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth.\n\nAnd for what purpose, monastics, should ‘I am the owner of my kamma, the heir of my kamma, born of my kamma, related through my kamma, and have my kamma as my refuge. Whatever kamma I shall perform – whether good or bad – I shall be its heir’ be constantly reflected upon by a woman or a man, by a householder or one gone forth? Monastics, there is for beings misconduct by body, misconduct by speech, and misconduct by mind. For one who constantly reflects on that subject, all misconduct is either completely abandoned or it becomes attenuated. This, monastics, is the purpose for which ‘I am the owner of my kamma, the heir of my kamma, born of my kamma, related through my kamma, and have my kamma as my refuge. Whatever kamma I shall perform – whether good or bad – I shall be its heir’ is to be constantly reflected upon by a woman or a man, by a householder or one gone forth.\n\nSo, bhikkhus, the noble disciple reflects thus: ‘It is not I alone who am subject to aging, not having transcended aging. Rather, all beings, whatever their coming, going, passing away, and reappearing, are subject to aging, not having transcended aging.’ As he repeatedly contemplates this fact, the path arises in him. He cultivates, develops, and makes much of that path. As he cultivates, develops, and makes much of that path, the fetters are entirely abandoned, and the latent tendencies are eradicated.\n\nAgain, bhikkhus, the noble disciple reflects thus: ‘It is not I alone who am subject to illness, not having transcended illness. Rather, all beings, whatever their coming, going, passing away, and reappearing, are subject to illness, not having transcended illness.’ As he repeatedly contemplates this fact, the path arises in him. He cultivates, develops, and makes much of that path. As he cultivates, develops, and makes much of that path, the fetters are entirely abandoned, and the latent tendencies are eradicated.\n\nAgain, bhikkhus, the noble disciple reflects thus: ‘It is not I alone who am subject to death, not having transcended death. Rather, all beings, whatever their coming, going, passing away, and reappearing, are subject to death, not having transcended death.’ As he repeatedly contemplates this fact, the path arises in him. He cultivates, develops, and makes much of that path. As he cultivates, develops, and makes much of that path, the fetters are entirely abandoned, and the latent tendencies are eradicated.\n\nAgain, bhikkhus, the noble disciple reflects thus: ‘It is not for me alone that there is separation, disunion from all that is dear and agreeable. Rather, for all beings, whatever their coming, going, passing away, and reappearing, there is separation, disunion from all that is dear and agreeable.’ As he repeatedly contemplates this fact, the path arises in him. He cultivates, develops, and makes much of that path. As he cultivates, develops, and makes much of that path, the fetters are entirely abandoned, and the latent tendencies are eradicated.\n\nAgain, bhikkhus, the noble disciple reflects thus: ‘It is not I alone who am the owner of my kamma, the heir to my kamma, born of my kamma, related to my kamma, having kamma as my refuge; whatever kamma I shall do – whether good or bad – of that I shall be the heir. Rather, all beings, whatever their coming, going, passing away, and reappearing, are owners of their kamma, heirs to their kamma, born of their kamma, related to their kamma, having kamma as their refuge; whatever kamma they shall do – whether good or bad – of that they shall be the heirs.’ As he repeatedly contemplates this fact, the path arises in him. He cultivates, develops, and makes much of that path. As he cultivates, develops, and makes much of that path, the fetters are entirely abandoned, and the latent tendencies are eradicated.\n\nSubject to illness, subject to aging, and also subject to death;\nJust as these phenomena are, so are beings, yet ordinary people recoil from them.\nIf I were to recoil from such beings, who are subject to these phenomena,\nThat would not be fitting for me, living in such a way.\nThus living, having known the Dhamma, which is free from defilements,\nAll the intoxications of health, youth, and life,\nAll those intoxications I have overcome, seeing renunciation as secure.\nFor me, zeal arose, as I contemplated Nibbana.\nI am no longer capable of indulging in sensual pleasures;\nI shall be one who does not turn back, devoted to the holy life.",
      "sinhala": "මහණෙනි, ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුතු කරුණු පහක් ඇත. ඒ පහ කුමක්ද?\n\n‘මම ජරාවට භාජන වන ස්වභාව ඇත්තෙක්මි, ජරාව ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුතුය.\n\n‘මම ව්‍යාධියට භාජන වන ස්වභාව ඇත්තෙක්මි, ව්‍යාධිය ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුතුය.\n\n‘මම මරණයට භාජන වන ස්වභාව ඇත්තෙක්මි, මරණය ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුතුය.\n\n‘මාගේ සියලු ප්‍රි​ය මනාප වූ දෙයින් වෙන්වීමත්, දුරුවීමත් ඇතැයි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුතුය.\n\n‘මම කර්ම​යට හිමි වෙමි, කර්ම​ය දායාද කොට ඇත්තෙමි, කර්ම​යෙන් උපන් කෙනෙක් වෙමි, කර්ම​ය නෑදෑ කොට ඇත්තෙමි, කර්ම​ය පිහිට කොට ඇත්තෙමි. යම් කර්ම​යක් කරන්නෙම් ද – හොඳ හෝ නරක හෝ – එහි දායාදකරු වන්නෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුතුය.\n\nමහණෙනි, කවර අර්ථයක් නිසාද, ‘මම ජරාවට භාජන වන ස්වභාව ඇත්තෙක්මි, ජරාව ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ? මහණෙනි, සත්ත්වයන්ට යෞවන වියෙහි යෞවන මදය ඇත. යම් මදයකින් මත් වූවෝ කයින් දුශ්චරිත​ය කරති, වචනයෙන් දුශ්චරිත​ය කරති, මනසින් දුශ්චරිත​ය කරති. ඔහු ඒ කරුණ නිතර සිහි කරන කල්හි, යෞවන වියෙහි ඇති යෞවන මදය මුළුමනින්ම දුරුවෙයි, නැතිනම් තුනී වෙයි. මහණෙනි, මේ අර්ථය නිසාමය, ‘මම ජරාවට භාජන වන ස්වභාව ඇත්තෙක්මි, ජරාව ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ.\n\nමහණෙනි, කවර අර්ථයක් නිසාද, ‘මම ව්‍යාධියට භාජන වන ස්වභාව ඇත්තෙක්මි, ව්‍යාධිය ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ? මහණෙනි, සත්ත්වයන්ට නිරෝගීභාවයෙහි නිරෝගී මදය ඇත. යම් මදයකින් මත් වූවෝ කයින් දුශ්චරිත​ය කරති, වචනයෙන් දුශ්චරිත​ය කරති, මනසින් දුශ්චරිත​ය කරති. ඔහු ඒ කරුණ නිතර සිහි කරන කල්හි, නිරෝගීභාවයෙහි ඇති නිරෝගී මදය මුළුමනින්ම දුරුවෙයි, නැතිනම් තුනී වෙයි. මහණෙනි, මේ අර්ථය නිසාමය, ‘මම ව්‍යාධියට භාජන වන ස්වභාව ඇත්තෙක්මි, ව්‍යාධිය ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ.\n\nමහණෙනි, කවර අර්ථයක් නිසාද, ‘මම මරණයට භාජන වන ස්වභාව ඇත්තෙක්මි, මරණය ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ? මහණෙනි, සත්ත්වයන්ට ජීවිතයෙහි ජීවිත මදය ඇත. යම් මදයකින් මත් වූවෝ කයින් දුශ්චරිත​ය කරති, වචනයෙන් දුශ්චරිත​ය කරති, මනසින් දුශ්චරිත​ය කරති. ඔහු ඒ කරුණ නිතර සිහි කරන කල්හි, ජීවිතයෙහි ඇති ජීවිත මදය මුළුමනින්ම දුරුවෙයි, නැතිනම් තුනී වෙයි. මහණෙනි, මේ අර්ථය නිසාමය, ‘මම මරණයට භාජන වන ස්වභාව ඇත්තෙක්මි, මරණය ඉක්මවා ගියේ නොමැත්තෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ.\n\nමහණෙනි, කවර අර්ථයක් නිසාද, ‘මාගේ සියලු ප්‍රි​ය මනාප වූ දෙයින් වෙන්වීමත්, දුරුවීමත් ඇතැයි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ? මහණෙනි, සත්ත්වයන්ට ප්‍රි​ය මනාප වූ දෙයෙහි යම් ඡන්ද​රාගයක් ඇද්ද, යම් රාගයකින් බැඳුණු, ඇලුණු වූවෝ කයින් දුශ්චරිත​ය කරති, වචනයෙන් දුශ්චරිත​ය කරති, මනසින් දුශ්චරිත​ය කරති. ඔහු ඒ කරුණ නිතර සිහි කරන කල්හි, ප්‍රි​ය මනාප වූ දෙයෙහි ඇති ඡන්ද​රාගය මුළුමනින්ම දුරුවෙයි, නැතිනම් තුනී වෙයි. මහණෙනි, මේ අර්ථය නිසාමය, ‘මාගේ සියලු ප්‍රි​ය මනාප වූ දෙයින් වෙන්වීමත්, දුරුවීමත් ඇතැයි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ.\n\nමහණෙනි, කවර අර්ථයක් නිසාද, ‘මම කර්ම​යට හිමි වෙමි, කර්ම​ය දායාද කොට ඇත්තෙමි, කර්ම​යෙන් උපන් කෙනෙක් වෙමි, කර්ම​ය නෑදෑ කොට ඇත්තෙමි, කර්ම​ය පිහිට කොට ඇත්තෙමි. යම් කර්ම​යක් කරන්නෙම් ද – හොඳ හෝ නරක හෝ – එහි දායාදකරු වන්නෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ? මහණෙනි, සත්ත්වයන්ට කාය දුශ්චරිත​යත්, වාග් දුශ්චරිත​යත්, මනෝ දුශ්චරිත​යත් ඇත. ඔහු ඒ කරුණ නිතර සිහි කරන කල්හි, දුශ්චරිත​ය මුළුමනින්ම දුරුවෙයි, නැතිනම් තුනී වෙයි. මහණෙනි, මේ අර්ථය නිසාමය, ‘මම කර්ම​යට හිමි වෙමි, කර්ම​ය දායාද කොට ඇත්තෙමි, කර්ම​යෙන් උපන් කෙනෙක් වෙමි, කර්ම​ය නෑදෑ කොට ඇත්තෙමි, කර්ම​ය පිහිට කොට ඇත්තෙමි. යම් කර්ම​යක් කරන්නෙම් ද – හොඳ හෝ නරක හෝ – එහි දායාදකරු වන්නෙමි’යි ගැහැණියක් විසින් හෝ, පිරිමියෙක් විසින් හෝ, ගිහියෙක් විසින් හෝ, පැවිද්දෙක් විසින් හෝ නිතර සිහි කළ යුත්තේ.\n\nඑසේය, මහණෙනි, ආර්යශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මම පමණක් දිරායන ස්වභාවයෙන් යුක්ත වූ, දිරීම ඉක්මවා නොගිය කෙනෙක් නොවෙමි. නමුත්, සත්වයන්ගේ උපත, ගමන, චුතිය, නැවත උපත සිදුවන තාක් කල්, සියලු සත්වයෝම දිරායන ස්වභාවයෙන් යුක්ත වූ, දිරීම ඉක්මවා නොගිය අය වෙති.’ ඔහුට ඒ කාරණය නිතර නිතර මෙනෙහි කරන කල්හි (ආර්ය) මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල කරයි. ඔහු ඒ මාර්ගය සේවනය කරද්දී, වඩද්දී, බහුල කරද්දී සියලු සංයෝජන මුළුමනින්ම ප්‍ර‍හීණ වෙයි, අනුශයයන් සමුච්ඡේදනය වෙයි.\n\nඑසේය, මහණෙනි, ආර්යශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මම පමණක් ව්‍යාධි ස්වභාවයෙන් යුක්ත වූ, ව්‍යාධිය ඉක්මවා නොගිය කෙනෙක් නොවෙමි. නමුත්, සත්වයන්ගේ උපත, ගමන, චුතිය, නැවත උපත සිදුවන තාක් කල්, සියලු සත්වයෝම ව්‍යාධි ස්වභාවයෙන් යුක්ත වූ, ව්‍යාධිය ඉක්මවා නොගිය අය වෙති.’ ඔහුට ඒ කාරණය නිතර නිතර මෙනෙහි කරන කල්හි (ආර්ය) මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල කරයි. ඔහු ඒ මාර්ගය සේවනය කරද්දී, වඩද්දී, බහුල කරද්දී සියලු සංයෝජන මුළුමනින්ම ප්‍ර‍හීණ වෙයි, අනුශයයන් සමුච්ඡේදනය වෙයි.\n\nඑසේය, මහණෙනි, ආර්යශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මම පමණක් මරණ ස්වභාවයෙන් යුක්ත වූ, මරණය ඉක්මවා නොගිය කෙනෙක් නොවෙමි. නමුත්, සත්වයන්ගේ උපත, ගමන, චුතිය, නැවත උපත සිදුවන තාක් කල්, සියලු සත්වයෝම මරණ ස්වභාවයෙන් යුක්ත වූ, මරණය ඉක්මවා නොගිය අය වෙති.’ ඔහුට ඒ කාරණය නිතර නිතර මෙනෙහි කරන කල්හි (ආර්ය) මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල කරයි. ඔහු ඒ මාර්ගය සේවනය කරද්දී, වඩද්දී, බහුල කරද්දී සියලු සංයෝජන මුළුමනින්ම ප්‍ර‍හීණ වෙයි, අනුශයයන් සමුච්ඡේදනය වෙයි.\n\nඑසේය, මහණෙනි, ආර්යශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මාගේ පමණක් ප්‍රිය මනාප දේවලින් වෙන්වීම, වෙන්ව යාම සිදුවන්නේ නොවෙයි. නමුත්, සත්වයන්ගේ උපත, ගමන, චුතිය, නැවත උපත සිදුවන තාක් කල්, සියලු සත්වයන්ටම ප්‍රිය මනාප දේවලින් වෙන්වීම, වෙන්ව යාම සිදුවෙයි.’ ඔහුට ඒ කාරණය නිතර නිතර මෙනෙහි කරන කල්හි (ආර්ය) මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල කරයි. ඔහු ඒ මාර්ගය සේවනය කරද්දී, වඩද්දී, බහුල කරද්දී සියලු සංයෝජන මුළුමනින්ම ප්‍ර‍හීණ වෙයි, අනුශයයන් සමුච්ඡේදනය වෙයි.\n\nඑසේය, මහණෙනි, ආර්යශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මම පමණක් තමාගේ කර්මයේ හිමිකරුවා, කර්මයේ දායාදකයා, කර්මය උපත ලැබීමට හේතුව, කර්මය නෑයා, කර්මය සරණ කරගත් තැනැත්තා නොවෙමි. යම් කර්මයක් කරන්නෙම්ද - එය කුසල වුවත්, අකුසල වුවත් - එහි දායාදකයා වන්නෙමි. නමුත්, සත්වයන්ගේ උපත, ගමන, චුතිය, නැවත උපත සිදුවන තාක් කල්, සියලු සත්වයෝම තමාගේ කර්මයේ හිමිකරුවෝ, කර්මයේ දායාදකයෝ, කර්මය උපත ලැබීමට හේතුව, කර්මය නෑයෝ, කර්මය සරණ කරගත් අය වෙති. යම් කර්මයක් කරත්ද - එය කුසල වුවත්, අකුසල වුවත් - එහි දායාදකයෝ වන්නෝය.’ ඔහුට ඒ කාරණය නිතර නිතර මෙනෙහි කරන කල්හි (ආර්ය) මාර්ගය උපදී. ඔහු ඒ මාර්ගය සේවනය කරයි, වඩයි, බහුල කරයි. ඔහු ඒ මාර්ගය සේවනය කරද්දී, වඩද්දී, බහුල කරද්දී සියලු සංයෝජන මුළුමනින්ම ප්‍ර‍හීණ වෙයි, අනුශයයන් සමුච්ඡේදනය වෙයි.\n\nව්‍යාධි ස්වභාවයෙන් යුක්තය, දිරායන ස්වභාවයෙන් යුක්තය, එසේම මරණ ස්වභාවයෙන් යුක්තය. යම් ලෙසකින් මේවා ධර්මයන්ද, ඒ අයුරින්ම සත්වයෝද වෙති. එහෙත් පෘථග්ජනයෝ මේවායින් පිළිකුල් කරති.\n\nමාද එසේ මේ ධර්මයන්ට යටත් වූ සත්වයන් කෙරෙහි පිළිකුල් කරන්නේ නම්, මා මේ අයුරින් වාසය කරන කෙනෙකුට එය සුදුසු නොවෙයි.\n\nඒ මම මෙසේ වාසය කරමින්, උපධි රහිත ධර්මය (නිවන) දැනගෙන, නීරෝගීභාවයෙහිද, යෞවනයෙහිද, ජීවිතයෙහිද යම් මානයන් ඇත්ද,\n\nඒ සියලු මානයන් පරාජය කළෙමි. නෛෂ්ක්‍ර‍ම්‍යය ක්ෂේමයක් ලෙස දැකීමෙන්, නිවන අවබෝධ කරගැනීමට මට උත්සාහයක් ඇති විය.\n\nමේ වන විට මට කාමයන් සේවනය කිරීමට හැකියාවක් නැත. මම (සංසාරයෙන්) පෙරළා නොඑන, බ්‍ර‍හ්මචර්යාවෙහි නිරත වූවෙක් වන්නෙමි.",
      "paliTitle": "Abhiṇhapaccavekkhitabbaṭhānasuttaṃ",
      "englishTitle": "Subjects for Frequent Recollection Sutta",
      "sinhalaTitle": "අභිණ්හ පච්චවෙක්ඛිතබ්බ ඨාන සූත්‍රය"
    },
    {
      "number": 58,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto mahāvanaṃ ajjhogāhetvā aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Tena kho pana samayena sambahulā licchavikumārakā sajjāni dhanūni ādāya kukkurasaṅghaparivutā mahāvane anucaṅkamamānā anuvicaramānā addasu bhagavantaṃ aññatarasmiṃ rukkhamūle nisinnaṃ; disvāna sajjāni dhanūni nikkhipitvā kukkurasaṅghaṃ ekamantaṃ uyyojetvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā tuṇhībhūtā tuṇhībhūtā pañjalikā bhagavantaṃ payirupāsanti. Tena kho pana samayena mahānāmo licchavi mahāvane jaṅghāvihāraṃ anucaṅkamamāno addasa te licchavikumārake tuṇhībhūte tuṇhībhūte pañjalike bhagavantaṃ payirupāsante; disvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo licchavi udānaṃ udānesi – ‘bhavissanti vajjī, bhavissanti vajjī’’’ti! ‘‘Kiṃ pana tvaṃ, mahānāma, evaṃ vadesi – ‘bhavissanti vajjī, bhavissanti vajjī’’’ti? ‘‘Ime, bhante, licchavikumārakā caṇḍā pharusā apānubhā [apajahāti (sī.), apāṭubhā (syā. kaṃ.), apajahā (pī.), apānutā (katthaci)]. Yānipi tāni kulesu paheṇakāni [pahīnakāni (sī.), pahīṇakāni (syā. kaṃ. pī.)] pahīyanti, ucchūti vā badarāti vā pūvāti vā modakāti vā saṃkulikāti vā [sakkhalikāti vā (sī. pī.)], tāni vilumpitvā vilumpitvā khādanti; kulitthīnampi kulakumārīnampi pacchāliyaṃ khipanti. Te dānime tuṇhībhūtā tuṇhībhūtā pañjalikā bhagavantaṃ payirupāsantī’’ti. ‘‘Yassa kassaci, mahānāma, kulaputtassa pañca dhammā saṃvijjanti – yadi vā rañño khattiyassa muddhāvasittassa, yadi vā raṭṭhikassa pettanikassa [muddhābhisittassa (ka.) a. ni. 5.135, 136 passitabbaṃ], yadi vā senāya senāpatikassa, yadi vā gāmagāmaṇikassa, yadi vā pūgagāmaṇikassa, ye vā pana kulesu paccekādhipaccaṃ kārenti, vuddhiyeva pāṭikaṅkhā, no parihāni. ‘‘Katame pañca? Idha, mahānāma, kulaputto uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi mātāpitaro sakkaroti garuṃ karoti māneti pūjeti. Tamenaṃ mātāpitaro sakkatā garukatā mānitā pūjitā kalyāṇena manasā anukampanti – ‘ciraṃ jīva, dīghamāyuṃ pālehī’ti. Mātāpitānukampitassa, mahānāma, kulaputtassa vuddhiyeva pāṭikaṅkhā, no parihāni. ‘‘Puna caparaṃ, mahānāma, kulaputto uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi puttadāradāsakammakaraporise [… sāmantasaṃvohāre (sī. pī.)] sakkaroti garuṃ karoti māneti pūjeti. Tamenaṃ puttadāradāsakammakaraporisā sakkatā garukatā mānitā pūjitā kalyāṇena manasā anukampanti – ‘ciraṃ jīva, dīghamāyuṃ pālehī’ti. Puttadāradāsakammakaraporisānukampitassa, mahānāma, kulaputtassa vuddhiyeva pāṭikaṅkhā, no parihāni. ‘‘Puna caparaṃ, mahānāma, kulaputto uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi khettakammantasāmantasabyohāre sakkaroti garuṃ karoti māneti pūjeti. Tamenaṃ khettakammantasāmantasabyohārā sakkatā garukatā mānitā pūjitā kalyāṇena manasā anukampanti – ‘ciraṃ jīva, dīghamāyuṃ pālehī’ti. Khettakammantasāmantasabyohārānukampitassa, mahānāma, kulaputtassa vuddhiyeva pāṭikaṅkhā, no parihāni. ‘‘Puna caparaṃ, mahānāma, kulaputto uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi yāvatā balipaṭiggāhikā devatā sakkaroti garuṃ karoti māneti pūjeti. Tamenaṃ balipaṭiggāhikā devatā sakkatā garukatā mānitā pūjitā kalyāṇena manasā anukampanti – ‘ciraṃ jīva, dīghamāyuṃ pālehī’ti. Devatānukampitassa, mahānāma, kulaputtassa vuddhiyeva pāṭikaṅkhā, no parihāni. ‘‘Puna caparaṃ, mahānāma, kulaputto uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi samaṇabrāhmaṇe sakkaroti garuṃ karoti māneti pūjeti. Tamenaṃ samaṇabrāhmaṇā sakkatā garukatā mānitā pūjitā kalyāṇena manasā anukampanti – ‘ciraṃ jīva, dīghamāyuṃ pālehī’ti. Samaṇabrāhmaṇānukampitassa, mahānāma, kulaputtassa vuddhiyeva pāṭikaṅkhā, no parihāni. ‘‘Yassa kassaci, mahānāma, kulaputtassa ime pañca dhammā saṃvijjanti – yadi vā rañño khattiyassa muddhāvasittassa, yadi vā raṭṭhikassa pettanikassa, yadi vā senāya senāpatikassa, yadi vā gāmagāmaṇikassa, yadi vā pūgagāmaṇikassa, ye vā pana kulesu paccekādhipaccaṃ kārenti, vuddhiyeva pāṭikaṅkhā, no parihānī’’ti. ‘‘Mātāpitukiccakaro, puttadārahito sadā; Antojanassa atthāya, ye cassa anujīvino. ‘‘Ubhinnañceva atthāya, vadaññū hoti sīlavā; Ñātīnaṃ pubbapetānaṃ, diṭṭhe dhamme ca jīvataṃ [jīvinaṃ (sī.), jīvitaṃ (syā. kaṃ. pī. ka.)]. ‘‘Samaṇānaṃ brāhmaṇānaṃ, devatānañca paṇḍito; Vittisañjanano hoti, dhammena gharamāvasaṃ. ‘‘So karitvāna kalyāṇaṃ, pujjo hoti pasaṃsiyo; Idheva naṃ pasaṃsanti, pecca sagge pamodatī’’ti. aṭṭhamaṃ;",
      "english": "At one time the Blessed One was staying in Vesālī, in the Great Wood, at the Gabled Hall. Then, in the morning, having dressed and taken his bowl and robe, the Blessed One entered Vesālī for alms. Having wandered for alms in Vesālī, and after his meal, on his return from the alms round, he plunged into the Great Wood and sat down for his day's abiding at the root of a certain tree.\n\nNow at that time, many Licchavi princes, armed with bows and accompanied by a pack of dogs, were wandering and roaming in the Great Wood, and they saw the Blessed One seated at the root of a certain tree. Having seen him, they laid aside their bows, sent the pack of dogs to one side, and approached the Blessed One. Having approached, they respectfully saluted the Blessed One and sat down in silence, with joined palms, reverently attending upon him.\n\nNow at that time, the Licchavi Mahānāma was walking for exercise in the Great Wood and saw those Licchavi princes silently attending upon the Blessed One with joined palms. Having seen them, he approached the Blessed One. Having approached, he respectfully saluted the Blessed One and sat down to one side.\n\nSeated to one side, the Licchavi Mahānāma spontaneously uttered this exclamation: \"The Vajjians will prosper! The Vajjians will prosper!\" \"Mahānāma, why do you say, 'The Vajjians will prosper! The Vajjians will prosper!'\"\n\n\"These Licchavi princes, venerable sir, are wild, rough, and unrefined. Whatever gifts or offerings are sent to families, such as sugar cane, jujubes, cakes, sweetmeats, or crisp cakes, they plunder and devour them. They even throw mud at noble women and noble maidens. But now, these very ones are silently attending upon the Blessed One with joined palms.\"\n\n\"Mahānāma, when any young man of good family possesses five qualities—whether he be a consecrated Kshatriya king, or a hereditary district chief, or a commander of an army, or a village headman, or a guild headman, or those who exercise individual authority in their families—growth alone is to be expected for them, not decline.\n\n\"What are these five? Here, Mahānāma, a young man of good family, having acquired wealth through his own energetic striving, amassed by the strength of his arms, earned by the sweat of his brow, justly gained and obtained in a lawful way, honors, respects, esteems, and reveres his parents. His parents, being honored, respected, esteemed, and revered by him, compassionately wish him well with a benevolent mind, saying: 'May you live long, may you sustain a long life.' For a young man of good family who is blessed with the compassion of his parents, growth alone is to be expected, not decline.\n\n\"Furthermore, Mahānāma, a young man of good family, having acquired wealth through his own energetic striving, amassed by the strength of his arms, earned by the sweat of his brow, justly gained and obtained in a lawful way, honors, respects, esteems, and reveres his children, wife, slaves, and workers. His children, wife, slaves, and workers, being honored, respected, esteemed, and revered by him, compassionately wish him well with a benevolent mind, saying: 'May you live long, may you sustain a long life.' For a young man of good family who is blessed with the compassion of his children, wife, slaves, and workers, growth alone is to be expected, not decline.\n\n\"Furthermore, Mahānāma, a young man of good family, having acquired wealth through his own energetic striving, amassed by the strength of his arms, earned by the sweat of his brow, justly gained and obtained in a lawful way, honors, respects, esteems, and reveres those engaged in agriculture, industry, and commerce in his vicinity. Those engaged in agriculture, industry, and commerce in his vicinity, being honored, respected, esteemed, and revered by him, compassionately wish him well with a benevolent mind, saying: 'May you live long, may you sustain a long life.' For a young man of good family who is blessed with the compassion of those engaged in agriculture, industry, and commerce in his vicinity, growth alone is to be expected, not decline.\n\n\"Furthermore, Mahānāma, a young man of good family, having acquired wealth through his own energetic striving, amassed by the strength of his arms, earned by the sweat of his brow, justly gained and obtained in a lawful way, honors, respects, esteems, and reveres the deities who receive offerings. These deities who receive offerings, being honored, respected, esteemed, and revered by him, compassionately wish him well with a benevolent mind, saying: 'May you live long, may you sustain a long life.' For a young man of good family who is blessed with the compassion of these deities, growth alone is to be expected, not decline.\n\n\"Furthermore, Mahānāma, a young man of good family, having acquired wealth through his own energetic striving, amassed by the strength of his arms, earned by the sweat of his brow, justly gained and obtained in a lawful way, honors, respects, esteems, and reveres ascetics and brahmins. These ascetics and brahmins, being honored, respected, esteemed, and revered by him, compassionately wish him well with a benevolent mind, saying: 'May you live long, may you sustain a long life.'\n\nO Mahānāma, for a noble son towards whom ascetics and brahmins feel compassion, growth is indeed to be expected, not decline.\n\n“O Mahānāma, whoever noble son possesses these five qualities – whether a king, an anointed ruler, or a hereditary district leader, or a general of an army, or a village headman, or a guild leader, or indeed those who exercise individual authority within their families – for them, growth is indeed to be expected, not decline.”\n\n“One who performs duties for mother and father, ever devoted to the welfare of children and wife, and for the benefit of his household dependents and those who live relying on him.\n\n“For the benefit of both worlds, one is benevolent and virtuous, benefiting relatives who have passed on and those living in this present existence.\n\n“Wise concerning ascetics, brahmins, and deities, one generates satisfaction while dwelling at home righteously.\n\n“Having performed wholesome deeds, he becomes worthy of honor and praise; here in this world, they praise him, and having departed, he rejoices in heavenly realms.”",
      "sinhala": "එකල භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි මහාවනයෙහි කූටාගාරශාලාවෙහි වැඩසිටියහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ පොරවා පාත්‍රය හා සිවුරු ගෙන වෙසාලියට පිඬුසිඟා වැඩියහ. වෙසාලියෙහි පිඬුසිඟා වළඳා, දහවල් ආහාරයෙන් පසුව, මහාවනයට පිවිස, එක්තරා ගසක් මුල දහවල් විහරණය සඳහා වැඩසිටියහ. එසමයෙහි බොහෝ ලිච්ඡවී කුමාරවරුන් සූදානම් කළ දුනු රැගෙන, බල්ලන් සමූහයකින් පිරිවරාගෙන, මහාවනයෙහි ඇවිදිමින් සිටින විට, එක්තරා ගසක් මුල වැඩසිටින භාග්‍යවතුන් වහන්සේව දුටුවෝය; දැක, සූදානම් කළ දුනු තබා, බල්ලන් සමූහය එක්පසෙකට යවා, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, නිශ්ශබ්දව, දොහොත් මුදුන් තබාගෙන, භාග්‍යවතුන් වහන්සේට සමීපව සිටියහ.\n\nඑසමයෙහි මහානාම ලිච්ඡවියා මහාවනයෙහි පයින් ඇවිදිමින් සිටින විට, නිශ්ශබ්දව, දොහොත් මුදුන් තබාගෙන භාග්‍යවතුන් වහන්සේට සමීපව සිටින එම ලිච්ඡවී කුමාරවරුන්ව දුටුවේය; දැක, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එක්පසෙකින් වාඩිවිය. එක්පසෙකින් වාඩිවී සිටි මහානාම ලිච්ඡවියා මෙවන් උදන් ඇනුවේය – ‘වජ්ජීන් දියුණු වනු ඇත, වජ්ජීන් දියුණු වනු ඇතැයි!’\n\n“මහානාමයෙනි, ඔබ ‘වජ්ජීන් දියුණු වනු ඇත, වජ්ජීන් දියුණු වනු ඇතැයි’ මෙසේ කියන්නේ කුමක් නිසාද?”\n“ස්වාමීනි, මේ ලිච්ඡවී කුමාරවරු දරුණුය, රළුය, අනුභාවයක් නැති අය වෙති. යම් කිසි පවුල්වලින් ලැබෙන උක්, හෝ දිවුල්, හෝ කැවිලි, හෝ මෝදක, හෝ සකුලිකා ආදී වූ තෑගි දෙනු ලබන්නේ නම්, ඒවා මොවුන් උදුරාගෙන උදුරාගෙන කති; කුල ස්ත්‍රීන්ටත් කුල කුමාරිකාවන්ටත් පිටුපසින් ගල් ගසති. එහෙත්, දැන් මොවුන් නිශ්ශබ්දව, නිශ්ශබ්දව, දොහොත් මුදුන් තබාගෙන භාග්‍යවතුන් වහන්සේට සමීපව සිටිති.”\n\n“මහානාමයෙනි, යම්කිසි කුලපුත්‍රයෙකුට මේ ධර්මතා පහක් ඇත්නම් – ඔහු අභිෂේක ලද ක්ෂත්‍රිය රජ කෙනෙකු වුවත්, හෝ පරම්පරාගත රට්ඨික (පාලක) කෙනෙකු වුවත්, හෝ සේනාවක සේනාපති කෙනෙකු වුවත්, හෝ ගම් ප්‍රධානියෙකු වුවත්, හෝ සමූහයක ප්‍රධානියෙකු වුවත්, හෝ පවුල්වල තනි තනිව අධිපතිත්වය දරන කෙනෙකු වුවත්, ඔහුට බලාපොරොත්තු විය හැක්කේ දියුණුවම මිස පිරිහීමක් නොවේ.\n“ඒ පහ කුමක්ද?\n\n“මහානාමයෙනි, මෙහිලා කුලපුත්‍රයා උත්සාහයත් වීර්යයත් උපයෝගී කරගෙන, තමන්ගේම ශක්තියෙන්, දහඩියෙන් උපයාගත්, ධාර්මිකව ලබන ලද භෝග සම්පත් වලින් මවටත් පියාටත් සත්කාර කරයි, ගරු කරයි, මානයෙන් තොරව පුදයි. ඒ මව සහ පියා, ඔහුට සත්කාර කළ, ගරු කළ, මානයෙන් තොරව පුදනු ලැබූ බැවින්, මෛත්‍රී සහගත සිතින් ඔහුට අනුකම්පා කරති – ‘දිගු කල් ජීවත් වෙන්න, දීර්ඝායුෂ ලබන්නැයි.’ මවගේත් පියාගේත් අනුකම්පාව ලබන, මහානාමයෙනි, ඒ කුලපුත්‍රයාට බලාපොරොත්තු විය හැක්කේ දියුණුවම මිස පිරිහීමක් නොවේ.\n\n“තවද, මහානාමයෙනි, කුලපුත්‍රයා උත්සාහයත් වීර්යයත් උපයෝගී කරගෙන, තමන්ගේම ශක්තියෙන්, දහඩියෙන් උපයාගත්, ධාර්මිකව ලබන ලද භෝග සම්පත් වලින් පුත්‍රයන්ට, භාර්යාවට, දාසයන්ට, කම්කරුවන්ට සහ පිරිසට සත්කාර කරයි, ගරු කරයි, මානයෙන් තොරව පුදයි. ඒ පුත්‍රයෝ, භාර්යාව, දාසයෝ, කම්කරුවෝ සහ පිරිස, ඔහුට සත්කාර කළ, ගරු කළ, මානයෙන් තොරව පුදනු ලැබූ බැවින්, මෛත්‍රී සහගත සිතින් ඔහුට අනුකම්පා කරති – ‘දිගු කල් ජීවත් වෙන්න, දීර්ඝායුෂ ලබන්නැයි.’ පුත්‍රයන්ගේ, භාර්යාවගේ, දාසයන්ගේ, කම්කරුවන්ගේ සහ පිරිසේ අනුකම්පාව ලබන, මහානාමයෙනි, ඒ කුලපුත්‍රයාට බලාපොරොත්තු විය හැක්කේ දියුණුවම මිස පිරිහීමක් නොවේ.\n\n“තවද, මහානාමයෙනි, කුලපුත්‍රයා උත්සාහයත් වීර්යයත් උපයෝගී කරගෙන, තමන්ගේම ශක්තියෙන්, දහඩියෙන් උපයාගත්, ධාර්මිකව ලබන ලද භෝග සම්පත් වලින් ගොවිපළ, කර්මාන්ත, අසල්වැසියන් හා ගනුදෙනුකරුවන්ට සත්කාර කරයි, ගරු කරයි, මානයෙන් තොරව පුදයි. ඒ ගොවිපළ, කර්මාන්ත, අසල්වැසියෝ හා ගනුදෙනුකරුවෝ, ඔහුට සත්කාර කළ, ගරු කළ, මානයෙන් තොරව පුදනු ලැබූ බැවින්, මෛත්‍රී සහගත සිතින් ඔහුට අනුකම්පා කරති – ‘දිගු කල් ජීවත් වෙන්න, දීර්ඝායුෂ ලබන්නැයි.’ ගොවිපළ, කර්මාන්ත, අසල්වැසියන් හා ගනුදෙනුකරුවන්ගේ අනුකම්පාව ලබන, මහානාමයෙනි, ඒ කුලපුත්‍රයාට බලාපොරොත්තු විය හැක්කේ දියුණුවම මිස පිරිහීමක් නොවේ.\n\n“තවද, මහානාමයෙනි, කුලපුත්‍රයා උත්සාහයත් වීර්යයත් උපයෝගී කරගෙන, තමන්ගේම ශක්තියෙන්, දහඩියෙන් උපයාගත්, ධාර්මිකව ලබන ලද භෝග සම්පත් වලින් බලි පුද පිළිගන්නා දෙවියන්ට සත්කාර කරයි, ගරු කරයි, මානයෙන් තොරව පුදයි. ඒ බලි පුද පිළිගන්නා දෙවියෝ, ඔහුට සත්කාර කළ, ගරු කළ, මානයෙන් තොරව පුදනු ලැබූ බැවින්, මෛත්‍රී සහගත සිතින් ඔහුට අනුකම්පා කරති – ‘දිගු කල් ජීවත් වෙන්න, දීර්ඝායුෂ ලබන්නැයි.’ දෙවියන්ගේ අනුකම්පාව ලබන, මහානාමයෙනි, ඒ කුලපුත්‍රයාට බලාපොරොත්තු විය හැක්කේ දියුණුවම මිස පිරිහීමක් නොවේ.\n\n“තවද, මහානාමයෙනි, කුලපුත්‍රයා උත්සාහයත් වීර්යයත් උපයෝගී කරගෙන, තමන්ගේම ශක්තියෙන්, දහඩියෙන් උපයාගත්, ධාර්මිකව ලබන ලද භෝග සම්පත් වලින් ශ්‍රමණයන්ට හා බ්‍රාහ්මණයන්ට සත්කාර කරයි, ගරු කරයි, මානයෙන් තොරව පුදයි. ඒ ශ්‍රමණයෝ හා බ්‍රාහ්මණයෝ, ඔහුට සත්කාර කළ, ගරු කළ, මානයෙන් තොරව පුදනු ලැබූ බැවින්, මෛත්‍රී සහගත සිතින් ඔහුට අනුකම්පා කරති – ‘දිගු කල් ජීවත් වෙන්න, දීර්ඝායුෂ ලබන්නැයි.’\n\nමහානාම, ශ්‍රමණයන්ට සහ බ්‍රාහ්මණයන්ට අනුකම්පා කරන කුලපුත්‍රයෙකුට වර්ධනයම අපේක්ෂා කළ යුතුයි, පරිහානියක් නොවේ.\n\n“මහානාම, යම් කිසි කුලපුත්‍රයෙකුට මේ පස් වැදෑරුම් ධර්මයන් තිබේ නම් – අභිෂේක කරන ලද ක්ෂත්‍රීය රජෙකුට වේවා, පරම්පරාගත ප්‍රාදේශීය අධිපතියෙකුට වේවා, සේනාවක සේනාධිපතියෙකුට වේවා, ගම් ප්‍රධානියෙකුට වේවා, පිරිසකගේ (සමූහයකගේ) ප්‍රධානියෙකුට වේවා, යම් අයෙකු තම නිවෙස් වල තනි ආධිපත්‍යයක් දරන්නේ නම්, වර්ධනයම මිස පරිහානියක් නොලැබේ.”\n\n“මවුපියන්ට යුතුකම් ඉටු කරන්නා වූ, නිතර දූ දරුවන්ට හා බිරිඳට හිතවත් වන්නා වූ, ගෘහස්ථ ජනයාටත් තමාට අයත් අයටත් ප්‍රයෝජනවත් වන්නා වූ යම් පුද්ගලයෙක් වෙත් ද,\n\nමිය පරලොව ගිය ඥාතීන්ටත්, මෙලොව ජීවත් වන ඥාතීන්ටත් යන දෙකොටසටම ප්‍රයෝජනවත් වන, මනා වචන ඇති, සිල්වත් වූ යම් පුද්ගලයෙක් වෙත් ද,\n\nශ්‍රමණයන්ටත්, බ්‍රාහ්මණයන්ටත්, දෙවියන්ටත් (කළ යුතු දේ ගැන) පණ්ඩිත වූ, ධර්මයෙන් ගෘහ ජීවිතය ගත කරන්නා වූ, සතුට (තෘප්තිය) උපදවන්නා වූ යම් පුද්ගලයෙක් වෙත් ද,\n\nඑබඳු තැනැත්තා යහපත් ක්‍රියා කොට පූජාවටත් ප්‍රශංසාවටත් සුදුසු අයෙක් වෙයි. මෙලොවදීම ඔහුට ප්‍රශංසා කෙරෙති. මිය පරලොව ගොස් දෙව්ලොව සතුටු වෙයි.”",
      "paliTitle": "Licchavikumārakasuttaṃ",
      "englishTitle": "The Licchavi Youths Sutta",
      "sinhalaTitle": "ලිච්ඡවිකුමාරක සූත්‍රය"
    },
    {
      "number": 59,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato dullabho vuḍḍhapabbajito. Katamehi pañcahi? Dullabho, bhikkhave, vuḍḍhapabbajito nipuṇo, dullabho ākappasampanno, dullabho bahussuto, dullabho dhammakathiko, dullabho vinayadharo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato dullabho vuḍḍhapabbajito’’ti. Navamaṃ.",
      "english": "Monks, an elder monastic endowed with five qualities is hard to find. What are these five? Monks, it is hard to find an elder monastic who is discerning; it is hard to find one who is accomplished in conduct; it is hard to find one who is widely learned; it is hard to find one who is an expounder of the Dhamma; it is hard to find one who is a master of the Vinaya. Monks, an elder monastic endowed with these five qualities is hard to find.",
      "sinhala": "මහණෙනි, මේ පස් ධර්ම​යන්ගෙන් සමන්විත වූ වෘද්ධ ප්‍ර​ව්‍රජිතයා දුලබය. ඒ කවර පස් ධර්ම​යන්ගෙන්ද? මහණෙනි, නිපුණ වූ වෘද්ධ ප්‍ර​ව්‍රජිතයා දුලබය. ආකල්පසම්පන්න වූ වෘද්ධ ප්‍ර​ව්‍රජිතයා දුලබය. බහුශ්‍රැත වූ වෘද්ධ ප්‍ර​ව්‍රජිතයා දුලබය. ධර්ම​කථික වූ වෘද්ධ ප්‍ර​ව්‍රජිතයා දුලබය. විනයධර වූ වෘද්ධ ප්‍ර​ව්‍රජිතයා දුලබය. මහණෙනි, සැබවින්ම, මේ පස් ධර්ම​යන්ගෙන් සමන්විත වූ වෘද්ධ ප්‍ර​ව්‍රජිතයා දුලබය.",
      "paliTitle": "Paṭhamavuḍḍhapabbajitasuttaṃ",
      "englishTitle": "The First Discourse on One Gone Forth in Old Age",
      "sinhalaTitle": "පළමු වුඩ්ඪපබ්බජිත සූත්‍රය"
    },
    {
      "number": 60,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato dullabho vuḍḍhapabbajito. Katamehi pañcahi? Dullabho, bhikkhave, vuḍḍhapabbajito suvaco, dullabho suggahitaggāhī, dullabho padakkhiṇaggāhī, dullabho dhammakathiko, dullabho vinayadharo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato dullabho vuḍḍhapabbajito’’ti. Dasamaṃ. ",
      "english": "Monks, an elder renunciant endowed with five qualities is hard to find. Which five?\n\nMonks, an elder renunciant who is amenable to instruction is hard to find. An elder renunciant who grasps well what is taught is hard to find. An elder renunciant who receives advice respectfully is hard to find. An elder renunciant who is a speaker of the Dhamma is hard to find. An elder renunciant who is a holder of the Vinaya is hard to find.\n\nMonks, indeed, an elder renunciant endowed with these five qualities is hard to find.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්මයන් පහකින් යුක්ත වූ වැඩිහිටි පැවිද්දා දුර්ලභ වෙයි. ඒ පහ මොනවාද?\n\nභික්ෂූන් වහන්ස, කීකරු වූ වැඩිහිටි පැවිද්දා දුර්ලභ වෙයි. යහපත් දේ මනාව ග්‍රහණය කරගන්නා වූ වැඩිහිටි පැවිද්දා දුර්ලභ වෙයි. ගෞරවාන්විතව පිළිගන්නා වූ වැඩිහිටි පැවිද්දා දුර්ලභ වෙයි. ධර්ම‍කථික වූ වැඩිහිටි පැවිද්දා දුර්ලභ වෙයි. විනයධර වූ වැඩිහිටි පැවිද්දා දුර්ලභ වෙයි. භික්ෂූන් වහන්ස, මේ ධර්ම‍යන් පහකින් යුක්ත වූ වැඩිහිටි පැවිද්දා දුර්ලභ වෙයි.",
      "paliTitle": "Dutiyavuḍḍhapabbajitasuttaṃ",
      "englishTitle": "Second Sutta on One Who Went Forth in Old Age",
      "sinhalaTitle": "දුතිය වුද්ධපබ්බජිත සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Nīvaraṇavaggo paṭhamo. Tassuddānaṃ – Āvaraṇaṃ rāsi aṅgāni, samayaṃ mātuputtikā; Upajjhā ṭhānā licchavi, kumārā aparā duveti.",
    "english": "The first chapter on Hindrances. The summary of it: Obstruction, Heap, Factors, Occasion, Mother and Son; Preceptor, Situations, Licchavi, Princes, and two others.",
    "sinhala": "පළමු නීවරණ වර්ගයයි. එහි උද්දානය නම්: ආවරණ, රාසි, අංග, සමය, මාතුපුත්තිකා, උපජ්ඣා, ඨාන, ලිච්ඡවි, කුමාර සහ තවත් සූත්‍ර දෙකකි."
  }
}