{
  "id": "an5.20",
  "title": {
    "pali": "Brāhmaṇavaggo",
    "english": "The Chapter on the Brāhmaṇa",
    "sinhala": "බ්‍රාහ්මණවග්ගෝ"
  },
  "sections": [
    {
      "number": 191,
      "pali": "‘‘Pañcime, bhikkhave, porāṇā brāhmaṇadhammā etarahi sunakhesu sandissanti, no brāhmaṇesu. Katame pañca? Pubbe sudaṃ [pubbassudaṃ (ka.)], bhikkhave, brāhmaṇā brāhmaṇiṃyeva gacchanti, no abrāhmaṇiṃ. Etarahi, bhikkhave, brāhmaṇā brāhmaṇimpi gacchanti, abrāhmaṇimpi gacchanti. Etarahi, bhikkhave, sunakhā sunakhiṃyeva gacchanti, no asunakhiṃ. Ayaṃ, bhikkhave, paṭhamo porāṇo brāhmaṇadhammo etarahi sunakhesu sandissati, no brāhmaṇesu. ‘‘Pubbe sudaṃ, bhikkhave, brāhmaṇā brāhmaṇiṃ utuniṃyeva gacchanti, no anutuniṃ. Etarahi, bhikkhave, brāhmaṇā brāhmaṇiṃ utunimpi gacchanti, anutunimpi gacchanti. Etarahi, bhikkhave, sunakhā sunakhiṃ utuniṃyeva gacchanti, no anutuniṃ. Ayaṃ, bhikkhave, dutiyo porāṇo brāhmaṇadhammo etarahi sunakhesu sandissati, no brāhmaṇesu. ‘‘Pubbe sudaṃ, bhikkhave, brāhmaṇā brāhmaṇiṃ neva kiṇanti no vikkiṇanti, sampiyeneva saṃvāsaṃ saṃbandhāya [saṃsaggatthāya (sī. pī.)] saṃpavattenti. Etarahi, bhikkhave, brāhmaṇā brāhmaṇiṃ kiṇantipi vikkiṇantipi, sampiyenapi saṃvāsaṃ saṃbandhāya saṃpavattenti. Etarahi, bhikkhave, sunakhā sunakhiṃ neva kiṇanti no vikkiṇanti, sampiyeneva saṃvāsaṃ saṃbandhāya saṃpavattenti. Ayaṃ, bhikkhave, tatiyo porāṇo brāhmaṇadhammo etarahi sunakhesu sandissati, no brāhmaṇesu. ‘‘Pubbe sudaṃ, bhikkhave, brāhmaṇā na sannidhiṃ karonti dhanassapi dhaññassapi rajatassapi jātarūpassapi. Etarahi, bhikkhave, brāhmaṇā sannidhiṃ karonti dhanassapi dhaññassapi rajatassapi jātarūpassapi. Etarahi, bhikkhave, sunakhā na sannidhiṃ karonti dhanassapi dhaññassapi rajatassapi jātarūpassapi. Ayaṃ, bhikkhave, catuttho porāṇo brāhmaṇadhammo etarahi sunakhesu sandissati, no brāhmaṇesu. ‘‘Pubbe sudaṃ, bhikkhave, brāhmaṇā sāyaṃ sāyamāsāya pāto pātarāsāya bhikkhaṃ pariyesanti. Etarahi, bhikkhave, brāhmaṇā yāvadatthaṃ udarāvadehakaṃ bhuñjitvā avasesaṃ ādāya pakkamanti. Etarahi, bhikkhave, sunakhā sāyaṃ sāyamāsāya pāto pātarāsāya bhikkhaṃ pariyesanti. Ayaṃ, bhikkhave, pañcamo porāṇo brāhmaṇadhammo etarahi sunakhesu sandissati, no brāhmaṇesu. Ime kho, bhikkhave, pañca porāṇā brāhmaṇadhammā etarahi sunakhesu sandissanti, no brāhmaṇesū’’ti. Paṭhamaṃ.",
      "english": "Monks, these five ancient practices of brahmins are now found in dogs, not in brahmins. Which five? Formerly, monks, brahmins associated only with brahmin women, not with non-brahmin women. Nowadays, monks, brahmins associate with brahmin women and also with non-brahmin women. Nowadays, monks, dogs associate only with female dogs, not with other females. This, monks, is the first ancient practice of brahmins that is now found in dogs, not in brahmins.\n\nFormerly, monks, brahmins associated with a brahmin woman only during her fertile period, not outside her fertile period. Nowadays, monks, brahmins associate with a brahmin woman during her fertile period and also outside her fertile period. Nowadays, monks, dogs associate with a female dog only during her fertile period, not outside her fertile period. This, monks, is the second ancient practice of brahmins that is now found in dogs, not in brahmins.\n\nFormerly, monks, brahmins neither bought nor sold brahmin women, but established companionship for union out of mutual affection alone. Nowadays, monks, brahmins buy and also sell brahmin women, and also establish companionship for union out of mutual affection. Nowadays, monks, dogs neither buy nor sell female dogs, but establish companionship for union out of mutual affection alone. This, monks, is the third ancient practice of brahmins that is now found in dogs, not in brahmins.\n\nFormerly, monks, brahmins did not store up wealth, grain, silver, or gold. Nowadays, monks, brahmins store up wealth, grain, silver, and gold. Nowadays, monks, dogs do not store up wealth, grain, silver, or gold. This, monks, is the fourth ancient practice of brahmins that is now found in dogs, not in brahmins.\n\nFormerly, monks, brahmins searched for alms for their evening meal in the evening and for their morning meal in the morning. Nowadays, monks, brahmins, having eaten their fill until their stomachs are distended, take the remainder and depart. Nowadays, monks, dogs search for food for their evening meal in the evening and for their morning meal in the morning. This, monks, is the fifth ancient practice of brahmins that is now found in dogs, not in brahmins. Indeed, monks, these five ancient practices of brahmins are now found in dogs, not in brahmins.",
      "sinhala": "‘‘භික්ෂූනි, මේ පෞරාණික බ්‍රාහ්මණ ධර්ම පහක් දැන් බ්‍රාහ්මණයන් අතර නොව සුනඛයන් අතර දක්නට ලැබේ. කවර ඒවාද පහ? භික්ෂූනි, පෙර බ්‍රාහ්මණයෝ බ්‍රාහ්මණියක සමඟම පමණක් එක්වූහ, අබ්‍රාහ්මණියක සමඟ නොවුහ. භික්ෂූනි, දැන් බ්‍රාහ්මණයෝ බ්‍රාහ්මණියක සමඟද, අබ්‍රාහ්මණියක සමඟද එක්වෙති. භික්ෂූනි, දැන් සුනඛයෝ සුනඛියක සමඟම පමණක් එක්වෙති, අසුනඛියක සමඟ නොවෙති. භික්ෂූනි, මේ පෞරාණික බ්‍රාහ්මණ ධර්මය දැන් බ්‍රාහ්මණයන් අතර නොව සුනඛයන් අතර දක්නට ලැබේ.\n\n‘‘භික්ෂූනි, පෙර බ්‍රාහ්මණයෝ බ්‍රාහ්මණියකගේ ඍතු කාලයේදී පමණක් එක්වූහ, ඍතු නොවන කාලයේදී නොවුහ. භික්ෂූනි, දැන් බ්‍රාහ්මණයෝ බ්‍රාහ්මණියකගේ ඍතු කාලයේදීද, ඍතු නොවන කාලයේදීද එක්වෙති. භික්ෂූනි, දැන් සුනඛයෝ සුනඛියකගේ ඍතු කාලයේදී පමණක් එක්වෙති, ඍතු නොවන කාලයේදී නොවෙති. භික්ෂූනි, මේ දෙවෙනි පෞරාණික බ්‍රාහ්මණ ධර්මය දැන් බ්‍රාහ්මණයන් අතර නොව සුනඛයන් අතර දක්නට ලැබේ.\n\n‘‘භික්ෂූනි, පෙර බ්‍රාහ්මණයෝ බ්‍රාහ්මණියක් මිල දී ගත්තේවත් විකුණන්නේවත් නැත. ඔවුන් ප්‍රිය සම්බන්ධතාවයකින් පමණක් සංවාසය පවත්වා ගෙන ගියහ. භික්ෂූනි, දැන් බ්‍රාහ්මණයෝ බ්‍රාහ්මණියක් මිල දී ගනිතිද, විකුණතිද, ප්‍රිය සම්බන්ධතාවයකින්ද සංවාසය පවත්වා ගෙන යති. භික්ෂූනි, දැන් සුනඛයෝ සුනඛියක් මිල දී ගන්නේවත් විකුණන්නේවත් නැත. ඔවුන් ප්‍රිය සම්බන්ධතාවයකින් පමණක් සංවාසය පවත්වා ගෙන යති. භික්ෂූනි, මේ තුන්වෙනි පෞරාණික බ්‍රාහ්මණ ධර්මය දැන් බ්‍රාහ්මණයන් අතර නොව සුනඛයන් අතර දක්නට ලැබේ.\n\n‘‘භික්ෂූනි, පෙර බ්‍රාහ්මණයෝ ධනය හෝ ධාන්‍ය හෝ රිදී හෝ රන් හෝ ගබඩා කර නොතැබූහ. භික්ෂූනි, දැන් බ්‍රාහ්මණයෝ ධනයද, ධාන්‍යද, රිදීද, රන්ද ගබඩා කර තබති. භික්ෂූනි, දැන් සුනඛයෝ ධනය හෝ ධාන්‍ය හෝ රිදී හෝ රන් හෝ ගබඩා කර නොතබති. භික්ෂූනි, මේ සිවුවෙනි පෞරාණික බ්‍රාහ්මණ ධර්මය දැන් බ්‍රාහ්මණයන් අතර නොව සුනඛයන් අතර දක්නට ලැබේ.\n\n‘‘භික්ෂූනි, පෙර බ්‍රාහ්මණයෝ සවස සවස ආහාරය සඳහාත්, උදෑසන උදෑසන ආහාරය සඳහාත් පිඬු සිඟා යනු ලැබූහ. භික්ෂූනි, දැන් බ්‍රාහ්මණයෝ ඕනෑ තරම්, බඩ පැලෙන තුරු අනුභව කර, ඉතිරි දේ රැගෙන නික්ම යති. භික්ෂූනි, දැන් සුනඛයෝ සවස සවස ආහාරය සඳහාත්, උදෑසන උදෑසන ආහාරය සඳහාත් පිඬු සිඟා යති. භික්ෂූනි, මේ පස්වෙනි පෞරාණික බ්‍රාහ්මණ ධර්මය දැන් බ්‍රාහ්මණයන් අතර නොව සුනඛයන් අතර දක්නට ලැබේ. භික්ෂූනි, මේ පෞරාණික බ්‍රාහ්මණ ධර්ම පහ දැන් බ්‍රාහ්මණයන් අතර නොව සුනඛයන් අතර දක්නට ලැබේ.",
      "paliTitle": "Soṇasuttaṃ",
      "englishTitle": "The Discourse to Soṇa",
      "sinhalaTitle": "සෝණ සූත්‍රය"
    },
    {
      "number": 192,
      "pali": "Atha kho doṇo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho doṇo brāhmaṇo bhagavantaṃ etadavoca – ‘‘Sutaṃ metaṃ, bho gotama – ‘na samaṇo gotamo brāhmaṇe jiṇṇe vuḍḍhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimantetī’ti. Tayidaṃ, bho gotama, tatheva. Na hi bhavaṃ gotamo brāhmaṇe jiṇṇe vuḍḍhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimanteti. Tayidaṃ, bho gotama, na sampannamevā’’ti. ‘‘Tvampi no, doṇa, brāhmaṇo paṭijānāsī’’ti? ‘‘Yañhi taṃ, bho gotama, sammā vadamāno vadeyya – ‘brāhmaṇo ubhato sujāto – mātito ca pitito ca, saṃsuddhagahaṇiko, yāva sattamā pitāmahayugā akkhito anupakkuṭṭho jātivādena, ajjhāyako mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ, padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo’ti, mameva taṃ, bho gotama, sammā vadamāno vadeyya. Ahañhi, bho gotama, brāhmaṇo ubhato sujāto – mātito ca pitito ca, saṃsuddhagahaṇiko, yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, ajjhāyako mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ, padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo’’ti. ‘‘Ye kho, te doṇa, brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti sajjhāyitamanusajjhāyanti vācitamanuvācenti, seyyathidaṃ – aṭṭhako, vāmako, vāmadevo, vessāmitto, yamadaggi [yamataggi (sī.) dī. ni. 1.284, 526, 536; ma. ni. 2.427; mahāva. 300; a. ni. 5.192 passitabbaṃ], aṅgīraso, bhāradvājo, vāseṭṭho, kassapo, bhagu; tyāssu’me pañca brāhmaṇe paññāpenti – brahmasamaṃ, devasamaṃ, mariyādaṃ, sambhinnamariyādaṃ, brāhmaṇacaṇḍālaṃyeva pañcamaṃ. Tesaṃ tvaṃ doṇa, katamo’’ti? ‘‘Na kho mayaṃ, bho gotama, pañca brāhmaṇe jānāma, atha kho mayaṃ brāhmaṇātveva jānāma. Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ahaṃ ime pañca brāhmaṇe jāneyya’’nti. ‘‘Tena hi, brāhmaṇa, suṇohi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ bho’’ti kho doṇo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Kathañca, doṇa, brāhmaṇo brahmasamo hoti? Idha, doṇa, brāhmaṇo ubhato sujāto hoti – mātito ca pitito ca, saṃsuddhagahaṇiko, yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. So aṭṭhacattālīsavassāni komārabrahmacariyaṃ [kodhāraṃ brahmacariyaṃ (syā. ka.)] carati mante adhīyamāno. Aṭṭhacattālīsavassāni komārabrahmacariyaṃ caritvā mante adhīyitvā ācariyassa ācariyadhanaṃ pariyesati dhammeneva, no adhammena. ‘‘Tattha ca, doṇa, ko dhammo? Neva kasiyā na vaṇijjāya na gorakkhena na issatthena [na issattena (ka.)] na rājaporisena na sippaññatarena, kevalaṃ bhikkhācariyāya kapālaṃ anatimaññamāno. So ācariyassa ācariyadhanaṃ niyyādetvā [nīyyādetvā (sī.), nīyādetvā (pī.), niyyātetvā (katthaci)] kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati. So evaṃ pabbajito samāno mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ [catutthiṃ (sī.)], iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena [abyāpajjhena (ka.) abyābajjhena (?)] pharitvā viharati. Karuṇā…pe… muditā… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ, iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So ime cattāro brahmavihāre bhāvetvā kāyassa bhedā paraṃ maraṇā sugatiṃ brahmalokaṃ upapajjati. Evaṃ kho, doṇa, brāhmaṇo brahmasamo hoti. ‘‘Kathañca, doṇa, brāhmaṇo devasamo hoti? Idha, doṇa, brāhmaṇo ubhato sujāto hoti – mātito ca pitito ca, saṃsuddhagahaṇiko, yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. So aṭṭhacattālīsavassāni komārabrahmacariyaṃ carati mante adhīyamāno. Aṭṭhacattālīsavassāni komārabrahmacariyaṃ caritvā mante adhīyitvā ācariyassa ācariyadhanaṃ pariyesati dhammeneva, no adhammena. Tattha ca, doṇa, ko dhammo? Neva kasiyā na vaṇijjāya na gorakkhena na issatthena na rājaporisena na sippaññatarena, kevalaṃ bhikkhācariyāya kapālaṃ anatimaññamāno. So ācariyassa ācariyadhanaṃ niyyādetvā dāraṃ pariyesati dhammeneva, no adhammena. ‘‘Tattha ca, doṇa, ko dhammo? Neva kayena na vikkayena, brāhmaṇiṃyeva udakūpassaṭṭhaṃ. So brāhmaṇiṃyeva gacchati, na khattiyiṃ na vessiṃ na suddiṃ na caṇḍāliṃ na nesādiṃ na veniṃ [na veṇiṃ (sī. syā. kaṃ. pī.)] na rathakāriṃ na pukkusiṃ gacchati, na gabbhiniṃ gacchati, na pāyamānaṃ gacchati, na anutuniṃ gacchati. Kasmā ca, doṇa, brāhmaṇo na gabbhiniṃ gacchati? Sace, doṇa, brāhmaṇo gabbhiniṃ gacchati, atimīḷhajo nāma so hoti māṇavako vā māṇavikā [māṇavakī (ka.)] vā. Tasmā, doṇa, brāhmaṇo na gabbhiniṃ gacchati. Kasmā ca, doṇa, brāhmaṇo na pāyamānaṃ gacchati? Sace, doṇa, brāhmaṇo pāyamānaṃ gacchati, asucipaṭipīḷito nāma so hoti māṇavako vā māṇavikā vā. Tasmā, doṇa, brāhmaṇo na pāyamānaṃ gacchati. Tassa sā hoti brāhmaṇī neva kāmatthā na davatthā na ratatthā, pajatthāva brāhmaṇassa brāhmaṇī hoti. So methunaṃ uppādetvā kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati. So evaṃ pabbajito samāno vivicceva kāmehi… pe… catutthaṃ jhānaṃ upasampajja viharati. So ime cattāro jhāne bhāvetvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Evaṃ kho, doṇa, brāhmaṇo devasamo hoti. ‘‘Kathañca, doṇa, brāhmaṇo mariyādo hoti? Idha, doṇa, brāhmaṇo ubhato sujāto hoti – mātito ca pitito ca, saṃsuddhagahaṇiko, yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. So aṭṭhacattālīsavassāni komārabrahmacariyaṃ carati mante adhīyamāno. Aṭṭhacattālīsavassāni komārabrahmacariyaṃ caritvā mante adhīyitvā ācariyassa ācariyadhanaṃ pariyesati dhammeneva, no adhammena. Tattha ca, doṇa, ko dhammo? Neva kasiyā na vaṇijjāya na gorakkhena na issatthena na rājaporisena na sippaññatarena, kevalaṃ bhikkhācariyāya kapālaṃ anatimaññamāno. So ācariyassa ācariyadhanaṃ niyyādetvā dāraṃ pariyesati dhammeneva, no adhammena. ‘‘Tattha ca, doṇa, ko dhammo? Neva kayena na vikkayena, brāhmaṇiṃyeva udakūpassaṭṭhaṃ. So brāhmaṇiṃyeva gacchati, na khattiyiṃ na vessiṃ na suddiṃ na caṇḍāliṃ na nesādiṃ na veniṃ na rathakāriṃ na pukkusiṃ gacchati, na gabbhiniṃ gacchati, na pāyamānaṃ gacchati, na anutuniṃ gacchati. Kasmā ca, doṇa, brāhmaṇo na gabbhiniṃ gacchati? Sace, doṇa, brāhmaṇo gabbhiniṃ gacchati, atimīḷhajo nāma so hoti māṇavako vā māṇavikā vā. Tasmā, doṇa, brāhmaṇo na gabbhiniṃ gacchati. Kasmā ca, doṇa, brāhmaṇo na pāyamānaṃ gacchati? Sace, doṇa, brāhmaṇo pāyamānaṃ gacchati, asucipaṭipīḷito nāma so hoti māṇavako vā māṇavikā vā. Tasmā, doṇa, brāhmaṇo na pāyamānaṃ gacchati. Tassa sā hoti brāhmaṇī neva kāmatthā na davatthā na ratatthā, pajatthāva brāhmaṇassa brāhmaṇī hoti. So methunaṃ uppādetvā tameva puttassādaṃ nikāmayamāno kuṭumbaṃ ajjhāvasati, na agārasmā anagāriyaṃ pabbajati. Yāva porāṇānaṃ brāhmaṇānaṃ mariyādo tattha tiṭṭhati, taṃ na vītikkamati. ‘Yāva porāṇānaṃ brāhmaṇānaṃ mariyādo tattha brāhmaṇo ṭhito taṃ na vītikkamatī’ti, kho, doṇa, tasmā brāhmaṇo mariyādoti vuccati. Evaṃ kho, doṇa, brāhmaṇo mariyādo hoti. ‘‘Kathañca, doṇa, brāhmaṇo sambhinnamariyādo hoti? Idha, doṇa, brāhmaṇo ubhato sujāto hoti – mātito ca pitito ca, saṃsuddhagahaṇiko, yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. So aṭṭhacattālīsavassāni komārabrahmacariyaṃ carati mante adhīyamāno. Aṭṭhacattālīsavassāni komārabrahmacariyaṃ caritvā mante adhīyitvā ācariyassa ācariyadhanaṃ pariyesati dhammeneva, no adhammena. ‘‘Tattha ca, doṇa, ko dhammo? Neva kasiyā na vaṇijjāya na gorakkhena na issatthena na rājaporisena na sippaññatarena, kevalaṃ bhikkhācariyāya kapālaṃ anatimaññamāno. So ācariyassa ācariyadhanaṃ niyyādetvā dāraṃ pariyesati dhammenapi adhammenapi kayenapi vikkayenapi brāhmaṇimpi udakūpassaṭṭhaṃ. So brāhmaṇimpi gacchati khattiyimpi gacchati vessimpi gacchati suddimpi gacchati caṇḍālimpi gacchati nesādimpi gacchati venimpi gacchati rathakārimpi gacchati pukkusimpi gacchati gabbhinimpi gacchati pāyamānampi gacchati utunimpi gacchati anutunimpi gacchati. Tassa sā hoti brāhmaṇī kāmatthāpi davatthāpi ratatthāpi pajatthāpi brāhmaṇassa brāhmaṇī hoti. Yāva porāṇānaṃ brāhmaṇānaṃ mariyādo tattha na tiṭṭhati, taṃ vītikkamati. ‘Yāva porāṇānaṃ brāhmaṇānaṃ mariyādo tattha brāhmaṇo na ṭhito taṃ vītikkamatī’ti kho, doṇa, tasmā brāhmaṇo sambhinnamariyādoti vuccati. Evaṃ kho, doṇa, brāhmaṇo sambhinnamariyādo hoti. ‘‘Kathañca, doṇa, brāhmaṇo brāhmaṇacaṇḍālo hoti? Idha, doṇa, brāhmaṇo ubhato sujāto hoti – mātito ca pitito ca, saṃsuddhagahaṇiko, yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. So aṭṭhacattālīsavassāni komārabrahmacariyaṃ carati mante adhīyamāno. Aṭṭhacattālīsavassāni komārabrahmacariyaṃ caritvā mante adhīyitvā ācariyassa ācariyadhanaṃ pariyesati dhammenapi adhammenapi kasiyāpi vaṇijjāyapi gorakkhenapi issatthenapi rājaporisenapi sippaññatarenapi, kevalampi bhikkhācariyāya, kapālaṃ anatimaññamāno. ‘‘So ācariyassa ācariyadhanaṃ niyyādetvā dāraṃ pariyesati dhammenapi adhammenapi kayenapi vikkayenapi brāhmaṇimpi udakūpassaṭṭhaṃ. So brāhmaṇimpi gacchati khattiyimpi gacchati vessimpi gacchati suddimpi gacchati caṇḍālimpi gacchati nesādimpi gacchati venimpi gacchati rathakārimpi gacchati pukkusimpi gacchati gabbhinimpi gacchati pāyamānampi gacchati utunimpi gacchati anutunimpi gacchati. Tassa sā hoti brāhmaṇī kāmatthāpi davatthāpi ratatthāpi pajatthāpi brāhmaṇassa brāhmaṇī hoti. So sabbakammehi jīvikaṃ [jīvitaṃ (ka.)] kappeti. Tamenaṃ brāhmaṇā evamāhaṃsu – ‘kasmā bhavaṃ brāhmaṇo paṭijānamāno sabbakammehi jīvikaṃ kappetī’ti? So evamāha – ‘seyyathāpi, bho, aggi sucimpi ḍahati asucimpi ḍahati, na ca tena aggi upalippati [upalimpati (ka.)]; evamevaṃ kho, bho, sabbakammehi cepi brāhmaṇo jīvikaṃ kappeti, na ca tena brāhmaṇo upalippati’. ‘Sabbakammehi jīvikaṃ kappetī’ti kho, doṇa, tasmā brāhmaṇo brāhmaṇacaṇḍāloti vuccati. Evaṃ kho, doṇa, brāhmaṇo brāhmaṇacaṇḍālo hoti. ‘‘Ye kho te, doṇa, brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro yesamidaṃ etarahi brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samīhitaṃ tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti sajjhāyitamanusajjhāyanti vācimanuvācenti, seyyathidaṃ – aṭṭhako, vāmako, vāmadevo, vessāmitto, yamadaggi, aṅgīraso, bhāradvājo, vāseṭṭho, kassapo, bhagu; tyāssume pañca brāhmaṇe paññāpenti – brahmasamaṃ, devasamaṃ, mariyādaṃ, sambhinnamariyādaṃ, brāhmaṇacaṇḍālaṃyeva pañcamaṃ. Tesaṃ tvaṃ, doṇa, katamo’’ti? ‘‘Evaṃ sante mayaṃ, bho gotama, brāhmaṇacaṇḍālampi na pūrema. Abhikkantaṃ, bho gotama… pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dutiyaṃ.",
      "english": "Then the brahmin Dona approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the customary and courteous talk, he sat down to one side. As he sat to one side, the brahmin Dona said to the Blessed One: \"I have heard this, Master Gotama: 'The ascetic Gotama does not greet, rise for, or offer a seat to brahmins who are old, aged, advanced in years, and come to the last stage of life.' This is indeed true, Master Gotama, for the venerable Gotama does not greet, rise for, or offer a seat to brahmins who are old, aged, advanced in years, and come to the last stage of life. This, Master Gotama, is not proper.\"\n\n\"Do you, Dona, also claim to be a brahmin?\" \"Indeed, Master Gotama, if one were to speak rightly, they would say: 'A brahmin is well-born on both sides, from mother and father, with pure lineage up to the seventh generation of ancestors, unchallenged and without reproach regarding his birth, a reciter and master of the Vedic mantras, accomplished in the three Vedas along with their vocabularies and rituals, phonology and etymology, and as the fifth, the Itihāsas; skilled in grammar and exposition, flawless in Lokāyata and the marks of a Great Man,' then it is I, Master Gotama, of whom one would rightly say this. For I, Master Gotama, am well-born on both sides, from mother and father, with pure lineage up to the seventh generation of ancestors, unchallenged and without reproach regarding my birth, a reciter and master of the Vedic mantras, accomplished in the three Vedas along with their vocabularies and rituals, phonology and etymology, and as the fifth, the Itihāsas; skilled in grammar and exposition, flawless in Lokāyata and the marks of a Great Man.\"\n\n\"Indeed, Dona, those ancient seers of the brahmins, the creators and promulgators of the mantras, whose ancient mantra-path is now sung, spoken, and compiled by brahmins, who chant after them, speak after them, repeat what has been spoken, recite after what has been recited, and transmit what has been transmitted—namely Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamadaggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, Bhagu—they describe five kinds of brahmins: the Brahma-like, the Deva-like, the Restricted, the Fallen-from-Restraint, and the fifth, the Brahmin-Outcaste. Of these, Dona, which one are you?\"\n\n\"Master Gotama, we do not know these five kinds of brahmins; we only know 'brahmin' as a general term. It would be good if the venerable Gotama would teach me the Dhamma so that I may understand these five kinds of brahmins.\" \"Then, brahmin, listen and pay close attention; I shall speak.\" \"Yes, Master,\" replied the brahmin Dona to the Blessed One. The Blessed One then said this:\n\n\"And how, Dona, is a brahmin Brahma-like? Here, Dona, a brahmin is well-born on both sides, from mother and father, with pure lineage up to the seventh generation of ancestors, unchallenged and without reproach regarding his birth. He practices the celibate life of a student for forty-eight years, studying the Vedic mantras. Having practiced the celibate life of a student for forty-eight years and studied the mantras, he seeks the teacher's fee in a righteous manner, not unrighteously.\n\n\"And what, Dona, is that righteous manner? Not by farming, not by trade, not by cattle-rearing, not by archery, not by royal service, nor by any other craft, but solely by begging for alms, never disdaining his alms-bowl. Having given the teacher's fee to his teacher, he shaves off his hair and beard, puts on saffron robes, and goes forth from the home life into homelessness.\n\nHaving thus gone forth, he dwells pervading one direction with a mind imbued with loving-kindness; likewise the second, likewise the third, likewise the fourth. Thus above, below, around, everywhere, and to all as himself, he dwells pervading the entire world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, free from hostility, free from ill will. He dwells pervading one direction with a mind imbued with compassion... with a mind imbued with appreciative joy... with a mind imbued with equanimity; likewise the second, likewise the third, likewise the fourth. Thus above, below, around, everywhere, and to all as himself, he dwells pervading the entire world with a mind imbued with equanimity, abundant, exalted, immeasurable, free from hostility, free from ill will. Having thus developed these four Divine Abodes, at the breaking up of the body, after death, he reappears in a good destination, the Brahma-world. That is how, Dona, a brahmin is Brahma-like.\n\n\"And how, Dona, is a brahmin Deva-like? Here, Dona, a brahmin is well-born on both sides, from mother and father, with pure lineage up to the seventh generation of ancestors, unchallenged and without reproach regarding his birth.\n\nHe observes the chaste life of a student for forty-eight years, studying the sacred texts. Having observed the chaste life of a student for forty-eight years and having studied the sacred texts, he seeks the teacher's fee for his teacher righteously, not unrighteously. And what, Dona, is that righteousness? It is not by agriculture, nor by trade, nor by cattle-herding, nor by archery, nor by royal service, nor by any other craft, but solely by begging for alms, without despising the alms-bowl. Having paid the teacher's fee to his teacher, he seeks a wife righteously, not unrighteously. And what, Dona, is that righteousness? It is not by purchase nor by sale, but only a brahmin woman who is offered with water. He takes only a brahmin woman, and not a khattiya, nor a vessa, nor a sudda, nor a caṇḍāla, nor a nesāda, nor a veṇa, nor a rathakāra, nor a pukkusa woman. He does not take a pregnant woman, nor a breastfeeding woman, nor one who is not in her fertile period. And why, Dona, does a brahmin not take a pregnant woman? If, Dona, a brahmin takes a pregnant woman, then that boy or girl would be called \"born in dung.\" Therefore, Dona, a brahmin does not take a pregnant woman. And why, Dona, does a brahmin not take a breastfeeding woman? If, Dona, a brahmin takes a breastfeeding woman, then that boy or girl would be called \"afflicted by impurity.\" Therefore, Dona, a brahmin does not take a breastfeeding woman. For him, that brahmin woman is not for the sake of sensual pleasure, nor for the sake of wealth, nor for the sake of enjoyment, but solely for the sake of offspring. Having begotten a child, he shaves off his hair and beard, puts on ochre robes, and goes forth from the home life into homelessness. Having thus gone forth, he dwells secluded from sensual pleasures... and attains and abides in the fourth jhana. Having developed these four jhanas, with the breaking up of the body, after death, he reappears in a good destination, a heavenly world. Thus, Dona, a brahmin is like a deity.\n\nAnd how, Dona, is a brahmin \"traditional\"? Here, Dona, a brahmin is well-born on both sides — from the mother and from the father, with a pure lineage, up to the seventh generation of ancestors, without blemish or reproach regarding his birth. He observes the chaste life of a student for forty-eight years, studying the sacred texts. Having observed the chaste life of a student for forty-eight years and having studied the sacred texts, he seeks the teacher's fee for his teacher righteously, not unrighteously. And what, Dona, is that righteousness? It is not by agriculture, nor by trade, nor by cattle-herding, nor by archery, nor by royal service, nor by any other craft, but solely by begging for alms, without despising the alms-bowl. Having paid the teacher's fee to his teacher, he seeks a wife righteously, not unrighteously. And what, Dona, is that righteousness? It is not by purchase nor by sale, but only a brahmin woman who is offered with water. He takes only a brahmin woman, and not a khattiya, nor a vessa, nor a sudda, nor a caṇḍāla, nor a nesāda, nor a veṇa, nor a rathakāra, nor a pukkusa woman. He does not take a pregnant woman, nor a breastfeeding woman, nor one who is not in her fertile period. And why, Dona, does a brahmin not take a pregnant woman? If, Dona, a brahmin takes a pregnant woman, then that boy or girl would be called \"born in dung.\" Therefore, Dona, a brahmin does not take a pregnant woman. And why, Dona, does a brahmin not take a breastfeeding woman? If, Dona, a brahmin takes a breastfeeding woman, then that boy or girl would be called \"afflicted by impurity.\" Therefore, Dona, a brahmin does not take a breastfeeding woman. For him, that brahmin woman is not for the sake of sensual pleasure, nor for the sake of wealth, nor for the sake of enjoyment, but solely for the sake of offspring. Having begotten a child, delighting in that very taste of a son, he remains living in the household and does not go forth from the home life into homelessness. As long as the tradition of the ancient brahmins persists there, he does not transgress it. \"Because a brahmin stands firm in the tradition of the ancient brahmins and does not transgress it,\" therefore, Dona, he is called a \"traditional\" brahmin. Thus, Dona, a brahmin is \"traditional.\"\n\nAnd how, Dona, is a brahmin one who \"transgresses tradition\"? Here, Dona, a brahmin is well-born on both sides — from the mother and from the father, with a pure lineage, up to the seventh generation of ancestors, without blemish or reproach regarding his birth. He observes the chaste life of a student for forty-eight years, studying the sacred texts. Having observed the chaste life of a student for forty-eight years and having studied the sacred texts, he seeks the teacher's fee for his teacher righteously, not unrighteously. And what, Dona, is that righteousness? It is not by agriculture, nor by trade, nor by cattle-herding, nor by archery, nor by royal service, nor by any other craft, but solely by begging for alms, without despising the alms-bowl. Having paid the teacher's fee to his teacher, he seeks a wife both righteously and unrighteously, both by purchase and by sale, even a brahmin woman who is offered with water.\n\nHe goes to a Brahmin woman, he goes to a Khattiya woman, he goes to a Vessa woman, he goes to a Sudda woman, he goes to a Caṇḍāla woman, he goes to a Nesāda woman, he goes to a Veṇa woman, he goes to a Rathakāra woman, he goes to a Pukkusa woman; he goes to a pregnant woman, he goes to a nursing woman, he goes to a woman in her period, he goes to a woman not in her period. His Brahmin wife is for sensual gratification, for acquisition, for enjoyment, and for procreation; she is a Brahmin wife to a Brahmin man. He does not abide by the established boundaries of the ancient Brahmins; he transgresses them. “As far as the established boundaries of the ancient Brahmins, the Brahmin does not stand within them, but transgresses them” – this is why, Dona, he is called a ‘Brahmin with broken boundaries’. Thus, Dona, a Brahmin becomes one with broken boundaries.\n\n“And how, Dona, does a Brahmin become a ‘Brahmin outcaste’? Here, Dona, a Brahmin is well-born on both sides – from his mother’s side and his father’s side, with a pure lineage, up to the seventh generation of ancestors, unimpeachable and without blemish as to his birth. He observes the celibate life of a student for forty-eight years, studying the Vedic hymns. Having observed the celibate life of a student for forty-eight years and having studied the Vedic hymns, he seeks the teacher’s fee for his teacher by righteous means and unrighteous means – by farming, by trade, by cattle-herding, by archery, by royal service, or by any other craft, even by mendicancy, not disdaining the alms-bowl. Having presented the teacher’s fee to his teacher, he seeks a wife by righteous means and unrighteous means, by purchase or by sale, even a Brahmin woman encountered at the water’s edge. He goes to a Brahmin woman, he goes to a Khattiya woman, he goes to a Vessa woman, he goes to a Sudda woman, he goes to a Caṇḍāla woman, he goes to a Nesāda woman, he goes to a Veṇa woman, he goes to a Rathakāra woman, he goes to a Pukkusa woman; he goes to a pregnant woman, he goes to a nursing woman, he goes to a woman in her period, he goes to a woman not in her period. His Brahmin wife is for sensual gratification, for acquisition, for enjoyment, and for procreation; she is a Brahmin wife to a Brahmin man. He earns his living by any and every occupation. Other Brahmins said to him thus: ‘Why does Your Reverence, who professes to be a Brahmin, earn his living by any and every occupation?’ He replied thus: ‘Just as, good sirs, fire burns both clean and unclean things, and yet the fire is not defiled by them; even so, good sirs, even if a Brahmin earns his living by any and every occupation, the Brahmin is not defiled by them.’ ‘He earns his living by any and every occupation’ – this is why, Dona, he is called a ‘Brahmin outcaste’. Thus, Dona, a Brahmin becomes a Brahmin outcaste.\n\n“Those ancient sages of the Brahmins, Dona, the composers of the Vedic hymns, the propounders of the Vedic hymns, whose ancient chanted, spoken, and compiled Vedic lore is now followed in chanting, followed in speaking, followed in repeating what was spoken, followed in reciting what was recited, and followed in uttering what was uttered – namely Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamadaggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, Bhagu – they declared these five types of Brahmins: a Brahma-like Brahmin, a Deva-like Brahmin, a Brahmin of established boundaries, a Brahmin of broken boundaries, and the fifth, a Brahmin outcaste. Among them, Dona, which one are you?”\n\n“Given this, Venerable Gotama, we do not even hold a Brahmin outcaste in esteem.”\n\n“Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes might see forms, even so has the Dhamma been made clear in many ways by the Venerable Gotama. I go for refuge to the Venerable Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May Master Gotama accept me as a lay follower who has taken refuge from this day forth as long as life lasts.”",
      "sinhala": "එවිට දෝණ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සමීප සතුටු සාකච්ඡාවක් කළේය. සතුටු විය හැකි, සිහි කළ හැකි කථාවක් නිමවා එක්පසෙක වාඩි විය. එක්පසෙක වාඩි වූ දෝණ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “භවත් ගෞතමයන් වහන්ස, ‘ශ්‍රමණ ගෞතමයන් වහන්සේ වයෝවෘද්ධ, මහලු, ජීවිතයේ අවසානයට පැමිණ සිටින බ්‍රාහ්මණයන්ට ආචාර නොකරති, නැඟිට ආචාර නොකරති, අසුනකින් ආරාධනා නොකරති’ යැයි මම අසා ඇත්තෙමි. භවත් ගෞතමයන් වහන්ස, මේ කාරණය එසේමය. භවත් ගෞතමයන් වහන්සේ සැබවින්ම වයෝවෘද්ධ, මහලු, ජීවිතයේ අවසානයට පැමිණ සිටින බ්‍රාහ්මණයන්ට ආචාර නොකරති, නැඟිට ආචාර නොකරති, අසුනකින් ආරාධනා නොකරති. භවත් ගෞතමයන් වහන්ස, මේ කාරණය නම් යහපත් දෙයක් නොවේ.” “දෝණයෙනි, ඔබ ද බ්‍රාහ්මණයෙක් යැයි පිළිගන්නේද?” “භවත් ගෞතමයන් වහන්ස, යමෙක් නිවැරදිව කියන්නේ නම්, ‘බ්‍රාහ්මණයා මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම යහපත්ව උපන්, සත්වන පීතෘ පරම්පරාව දක්වාම ජාති වශයෙන් දොස් නොලත්, නින්දා නොලත්, ශුද්ධ වූ කුලය ඇති, මන්ත්‍රධාරී වූ අධ්‍යාපන ලාභී, ශබ්ද කෝෂ, ව්‍යාකරණ, ඡන්දස් ආදී උපවේදයන් සහිතව, අකුරු ශාස්ත්‍රය, ඉතිහාසය යන පස්වන වේදය සහිතව ත්‍රිවේදයට දක්ෂ, පද විශාරද වූ, ව්‍යාකරණ විශාරද වූ, ලෝකායත හා මහා පුරුෂ ලක්ෂණ විද්‍යාවෙහි නිපුණ වූ පුද්ගලයා’ යැයි, ඔහු මා ගැනම නිවැරදිව කියන්නේය. භවත් ගෞතමයන් වහන්ස, මම මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම යහපත්ව උපන්, සත්වන පීතෘ පරම්පරාව දක්වාම ජාති වශයෙන් දොස් නොලත්, නින්දා නොලත්, ශුද්ධ වූ කුලය ඇති, මන්ත්‍රධාරී වූ අධ්‍යාපන ලාභී, ශබ්ද කෝෂ, ව්‍යාකරණ, ඡන්දස් ආදී උපවේදයන් සහිතව, අකුරු ශාස්ත්‍රය, ඉතිහාසය යන පස්වන වේදය සහිතව ත්‍රිවේදයට දක්ෂ, පද විශාරද වූ, ව්‍යාකරණ විශාරද වූ, ලෝකායත හා මහා පුරුෂ ලක්ෂණ විද්‍යාවෙහි නිපුණ වූ බ්‍රාහ්මණයෙක් වෙමි.”\n\n“දෝණයෙනි, බ්‍රාහ්මණයන්ගේ යම් පෙර ඍෂිවරුන් මන්ත්‍රයන් ඇති කළාහුද, මන්ත්‍රයන් දේශනා කළාහුද, ඔවුන්ගේ යම් පුරාණ මන්ත්‍ර පදයක් මේ වන විට බ්‍රාහ්මණයන් විසින් ගායනා කරනු ලබයිද, කියා කියනු ලබයිද, පිළිවෙළින් සකස් කරනු ලබයිද, ඒ අනුව ගායනා කරතිද, ඒ අනුව උච්චාරණය කරතිද, කියන ලද්දක් නැවත කියතිද, අධ්‍යයනය කරනු ලබන ලද්දක් නැවත අධ්‍යයනය කරතිද, වාචනය කරන ලද්දක් නැවත වාචනය කරතිද, එනම්: අට්ඨක, වාමක, වාමදේව, විශ්වාමිත්‍ර, යමදග්නි, අංගීරස, භාරද්වාජ, වාසෙට්ඨ, කාශ්‍යප, භෘගු යන මේ ඍෂිවරුන්, ඔවුහු බ්‍රාහ්මණ වර්ග පහක් ප්‍රඥප්ති කළහ. එනම්: බ්‍රහ්මසම, දේවසම, මරියද, සම්භින්නමරියද, සහ පස්වනුව බ්‍රාහ්මණචණ්ඩාල යන්නයි. දෝණයෙනි, ඔබ ඔවුන්ගෙන් කවරෙක්ද?” “භවත් ගෞතමයන් වහන්ස, අපි ඒ බ්‍රාහ්මණ වර්ග පහ නොදනිමු. නමුත් අපි බ්‍රාහ්මණයන් ලෙස පමණක් දනිමු. භවත් ගෞතමයන් වහන්සේ මේ බ්‍රාහ්මණ වර්ග පහ මා හඳුනාගන්නා අයුරින් මට ධර්මය දේශනා කරන්නේ නම් යහපත්ය.” “එසේ නම් බ්‍රාහ්මණය, අසන්න, මනසිකාරය හොඳින් යොමු කරන්න; මම දේශනා කරන්නෙමි.” “එසේය, භවත් වහන්සැ” යි දෝණ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළසේක:\n\n“දෝණයෙනි, බ්‍රාහ්මණයා බ්‍රහ්මසම වන්නේ කෙසේද? දෝණයෙනි, මෙහිලා බ්‍රාහ්මණයා මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම යහපත්ව උපන්, සත්වන පීතෘ පරම්පරාව දක්වාම ජාති වශයෙන් දොස් නොලත්, නින්දා නොලත්, ශුද්ධ වූ කුලය ඇති අයෙක් වේ. ඔහු අටළිස් වසරක් කෞමාර බ්‍රහ්මචර්යාව රකිමින් මන්ත්‍රයන් අධ්‍යයනය කරයි. අටළිස් වසරක් කෞමාර බ්‍රහ්මචර්යාව රකිනු ලැබ, මන්ත්‍රයන් අධ්‍යයනය කරනු ලැබ, ගුරුවරයාට ගුරු ධනය සොයන්නේ ධර්මානුකූලව මිස, අධර්මානුකූලව නොවේ.\n\nදෝණයෙනි, එහිලා ධර්මය කවරේද? ගොවිතැනින් හෝ වෙළෙඳාමෙන් හෝ ගව පාලනයෙන් හෝ ඊතල විදීමෙන් (යුද්ධයෙන්) හෝ රාජ්‍ය සේවයෙන් හෝ වෙනත් කිසිදු ශිල්පයකින් හෝ නොව, හුදෙක් පිඬුසිඟා යාමෙන්, පාත්‍රය පහත් කොට නොසලකමින්. ඔහු ගුරුවරයාට ගුරු ධනය පිරිනමා, කේශ රෝම කපා දමා, කහ සිවුරු හැඳගෙන ගිහි ගෙයින් නික්ම අනගාරිකත්වයට පැමිණේ (පැවිදි වේ). මෙසේ පැවිදි වූ ඔහු මෛත්‍රිය සහගත සිතින් එක් දිශාවක් පැතිරී වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව, මෙසේ උඩ, යට, හරහට, හැමතැනම, හැම ආකාරයකින්ම, මුළු ලෝකයම මහත් වූ, අතිශයින් උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ද්වේෂයෙන් තොර වූ මෛත්‍රිය සහගත සිතින් පතුරුවා වාසය කරයි. කරුණාව සහගත සිතින් එක් දිශාවක් පැතිරී වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව, මෙසේ උඩ, යට, හරහට, හැමතැනම, හැම ආකාරයකින්ම, මුළු ලෝකයම මහත් වූ, අතිශයින් උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ද්වේෂයෙන් තොර වූ කරුණාව සහගත සිතින් පතුරුවා වාසය කරයි. මුදිතාව සහගත සිතින් එක් දිශාවක් පැතිරී වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව, මෙසේ උඩ, යට, හරහට, හැමතැනම, හැම ආකාරයකින්ම, මුළු ලෝකයම මහත් වූ, අතිශයින් උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ද්වේෂයෙන් තොර වූ මුදිතාව සහගත සිතින් පතුරුවා වාසය කරයි. උපේක්ෂාව සහගත සිතින් එක් දිශාවක් පැතිරී වාසය කරයි, එලෙසම දෙවන දිශාව, එලෙසම තෙවන දිශාව, එලෙසම සතරවන දිශාව, මෙසේ උඩ, යට, හරහට, හැමතැනම, හැම ආකාරයකින්ම, මුළු ලෝකයම මහත් වූ, අතිශයින් උතුම් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, ද්වේෂයෙන් තොර වූ උපේක්ෂාව සහගත සිතින් පතුරුවා වාසය කරයි. ඔහු මේ සතර බ්‍රහ්මවිහාරයන් වඩවා, කය බිඳී මරණින් මතු සුගතියක් වන බ්‍රහ්ම ලෝකයේ උපදී. දෝණයෙනි, මෙසේ බ්‍රාහ්මණයා බ්‍රහ්මසම වේ.\n\n“දෝණයෙනි, බ්‍රාහ්මණයා දේවසම වන්නේ කෙසේද? දෝණයෙනි, මෙහිලා බ්‍රාහ්මණයා මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම යහපත්ව උපන්, සත්වන පීතෘ පරම්පරාව දක්වාම ජාති වශයෙන් දොස් නොලත්, නින්දා නොලත්, ශුද්ධ වූ කුලය ඇති අයෙක් වේ.\n\nඔහු අවුරුදු අටළොසක් කුමාර බ්‍රහ්මචර්යාව පුරයි, මන්ත්‍ර අධ්‍යයනය කරමින්. අවුරුදු අටළොසක් කුමාර බ්‍රහ්මචර්යාව පුරා, මන්ත්‍ර අධ්‍යයනය කර, ධර්මානුකූලවම මිස, අධර්මානුකූලව නොවේ ආචාර්ය ධනය සොයයි. දෝණ, එහි ධර්මය කවරේද? වගා කිරීමෙන් නොවේ, වෙළඳාමෙන් නොවේ, ගව පාලනයෙන් නොවේ, දුනු ශිල්පයෙන් නොවේ, රජයේ සේවයෙන් නොවේ, වෙනත් කිසිදු ශිල්පයකින් නොවේ, පිඟන් කබලට නින්දා නොකරමින්, හුදෙක් පිඬුසිඟා යෑමෙන්. ඔහු ආචාර්ය ධනය ගුරුවරයාට භාර දී ධර්මානුකූලවම මිස, අධර්මානුකූලව නොවේ බිරිඳක් සොයයි. දෝණ, එහි ධර්මය කවරේද? මිලදී ගැනීමෙන් නොවේ, විකිණීමෙන් නොවේ, දිය කඩිත්තකට සමීපව පැමිණි බ්‍රාහ්මණියක්ම යි. ඔහු බ්‍රාහ්මණියක් සමගම එක්වේ, ක්ෂත්‍රිය කාන්තාවක්, වෛශ්‍ය කාන්තාවක්, ශූද්‍ර කාන්තාවක්, චණ්ඩාල කාන්තාවක්, නේසාදි කාන්තාවක්, වේණී කාන්තාවක්, රථකාරී කාන්තාවක්, පුක්කුසී කාන්තාවක් සමග එක් නොවේ. ගැබිනි කාන්තාවක් සමග එක් නොවේ, කිරි දෙන කාන්තාවක් සමග එක් නොවේ, තමන්ගේ සෘතුවෙන් තොර කාන්තාවක් සමග එක් නොවේ. දෝණ, බ්‍රාහ්මණයා ගැබිනි කාන්තාවක් සමග එක් නොවන්නේ මන්ද? දෝණ, බ්‍රාහ්මණයා ගැබිනි කාන්තාවක් සමග එක්වුවහොත්, එම කුමාරයා හෝ කුමාරිය අතිශය මූලයෙන් හටගත්තෙක් නම් වේ. එබැවින් දෝණ, බ්‍රාහ්මණයා ගැබිනි කාන්තාවක් සමග එක් නොවේ. දෝණ, බ්‍රාහ්මණයා කිරි දෙන කාන්තාවක් සමග එක් නොවන්නේ මන්ද? දෝණ, බ්‍රාහ්මණයා කිරි දෙන කාන්තාවක් සමග එක්වුවහොත්, එම කුමාරයා හෝ කුමාරිය අශුචි පීඩාවෙන් යුක්ත අයෙක් නම් වේ. එබැවින් දෝණ, බ්‍රාහ්මණයා කිරි දෙන කාන්තාවක් සමග එක් නොවේ. එම බ්‍රාහ්මණිය ඔහුට කාම සම්පත පිණිසත් නොවේ, ධනය පිණිසත් නොවේ, සතුට පිණිසත් නොවේ, ප්‍රජාව පිණිසම බ්‍රාහ්මණයාට බ්‍රාහ්මණිය වේ. ඔහු දරුවන් ලබා, කේශ ශ්මශ්‍රුව බහා, කසාවත් පෙරවා, ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැමිණේ. මෙසේ පැවිදි වූ ඔහු කාමයන්ගෙන් වෙන්ව... (සහ අකුසල ධර්මයන්ගෙන්ද වෙන්ව) විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සුඛය සහිත වූ පළමු ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක විචාරයන් සංසිඳවීමෙන්, තමා තුළම පිරිසිදු වූ සිතේ පැහැදීම ඇති, විතර්ක විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීති සුඛය සහිත වූ දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියද දුරලීමෙන්, උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව වාසය කරයි, කයින්ද සුවය අත්දකියි, ‘උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව වාසය කරන්නාට සුවය අත්වේ’ යැයි ආර්යයෝ පවසන තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. සුවයද, දුකද දුරලීමෙන්, පෙර සිටි සොම්නස සහ දොම්නසද නැතිවීමෙන්, දුක් සුව දෙකින් තොර වූ, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සතරවන ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ සතර ධ්‍යානයන් වඩවා, කය බිඳීමෙන්, මරණින් මතු, සුගතිය වූ ස්වර්ගලෝකයට පැමිණේ. දෝණ, මෙසේ බ්‍රාහ්මණයා දෙවියෙකු හා සමය.\n\nදෝණ, බ්‍රාහ්මණයා මරියදා (සීමා සහිත) වන්නේ කෙසේද? දෝණ, මෙහි බ්‍රාහ්මණයා මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම මනා කොට උපන්නෙක් වේ, පරම්පරා සතක් යන තුරු, ජාතිවාදයෙන් නින්දා නොලත්, දෝෂාරෝපණයට ලක් නොවුණු, පිරිසිදු ග්‍රහණයක් ඇති අයෙක් වේ. ඔහු අවුරුදු අටළොසක් කුමාර බ්‍රහ්මචර්යාව පුරයි, මන්ත්‍ර අධ්‍යයනය කරමින්. අවුරුදු අටළොසක් කුමාර බ්‍රහ්මචර්යාව පුරා, මන්ත්‍ර අධ්‍යයනය කර, ධර්මානුකූලවම මිස, අධර්මානුකූලව නොවේ ආචාර්ය ධනය සොයයි. දෝණ, එහි ධර්මය කවරේද? වගා කිරීමෙන් නොවේ, වෙළඳාමෙන් නොවේ, ගව පාලනයෙන් නොවේ, දුනු ශිල්පයෙන් නොවේ, රජයේ සේවයෙන් නොවේ, වෙනත් කිසිදු ශිල්පයකින් නොවේ, පිඟන් කබලට නින්දා නොකරමින්, හුදෙක් පිඬුසිඟා යෑමෙන්. ඔහු ආචාර්ය ධනය ගුරුවරයාට භාර දී ධර්මානුකූලවම මිස, අධර්මානුකූලව නොවේ බිරිඳක් සොයයි. දෝණ, එහි ධර්මය කවරේද? මිලදී ගැනීමෙන් නොවේ, විකිණීමෙන් නොවේ, දිය කඩිත්තකට සමීපව පැමිණි බ්‍රාහ්මණියක්ම යි. ඔහු බ්‍රාහ්මණියක් සමගම එක්වේ, ක්ෂත්‍රිය කාන්තාවක්, වෛශ්‍ය කාන්තාවක්, ශූද්‍ර කාන්තාවක්, චණ්ඩාල කාන්තාවක්, නේසාදි කාන්තාවක්, වේණී කාන්තාවක්, රථකාරී කාන්තාවක්, පුක්කුසී කාන්තාවක් සමග එක් නොවේ. ගැබිනි කාන්තාවක් සමග එක් නොවේ, කිරි දෙන කාන්තාවක් සමග එක් නොවේ, තමන්ගේ සෘතුවෙන් තොර කාන්තාවක් සමග එක් නොවේ. දෝණ, බ්‍රාහ්මණයා ගැබිනි කාන්තාවක් සමග එක් නොවන්නේ මන්ද? දෝණ, බ්‍රාහ්මණයා ගැබිනි කාන්තාවක් සමග එක්වුවහොත්, එම කුමාරයා හෝ කුමාරිය අතිශය මූලයෙන් හටගත්තෙක් නම් වේ. එබැවින් දෝණ, බ්‍රාහ්මණයා ගැබිනි කාන්තාවක් සමග එක් නොවේ. දෝණ, බ්‍රාහ්මණයා කිරි දෙන කාන්තාවක් සමග එක් නොවන්නේ මන්ද? දෝණ, බ්‍රාහ්මණයා කිරි දෙන කාන්තාවක් සමග එක්වුවහොත්, එම කුමාරයා හෝ කුමාරිය අශුචි පීඩාවෙන් යුක්ත අයෙක් නම් වේ. එබැවින් දෝණ, බ්‍රාහ්මණයා කිරි දෙන කාන්තාවක් සමග එක් නොවේ. එම බ්‍රාහ්මණිය ඔහුට කාම සම්පත පිණිසත් නොවේ, ධනය පිණිසත් නොවේ, සතුට පිණිසත් නොවේ, ප්‍රජාව පිණිසම බ්‍රාහ්මණයාට බ්‍රාහ්මණිය වේ. ඔහු දරුවන් ලබා, ඒ දරුවන්ගේ ආශ්වාදයම ප්‍රාර්ථනා කරමින් ගෘහස්ථ ජීවිතය ගත කරයි, ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට නොපැමිණේ. පුරාණ බ්‍රාහ්මණයන්ගේ යම් සීමාවක් ඇත්තේද, ඔහු එය නොඉක්මවයි. ‘දෝණ, පුරාණ බ්‍රාහ්මණයන්ගේ යම් සීමාවක් ඇත්තේද, බ්‍රාහ්මණයා එහි පිහිටා එය නොඉක්මවයි’ යන හෙයින් දෝණ, බ්‍රාහ්මණයා මරියදා යැයි කියනු ලැබේ. මෙසේ දෝණ, බ්‍රාහ්මණයා මරියදා වේ.\n\nදෝණ, බ්‍රාහ්මණයා සිඳී බිඳී ගිය සීමා ඇති (මරියදා බිඳගත්) වන්නේ කෙසේද? දෝණ, මෙහි බ්‍රාහ්මණයා මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම මනා කොට උපන්නෙක් වේ, පරම්පරා සතක් යන තුරු, ජාතිවාදයෙන් නින්දා නොලත්, දෝෂාරෝපණයට ලක් නොවුණු, පිරිසිදු ග්‍රහණයක් ඇති අයෙක් වේ. ඔහු අවුරුදු අටළොසක් කුමාර බ්‍රහ්මචර්යාව පුරයි, මන්ත්‍ර අධ්‍යයනය කරමින්. අවුරුදු අටළොසක් කුමාර බ්‍රහ්මචර්යාව පුරා, මන්ත්‍ර අධ්‍යයනය කර, ධර්මානුකූලවම මිස, අධර්මානුකූලව නොවේ ආචාර්ය ධනය සොයයි. දෝණ, එහි ධර්මය කවරේද? වගා කිරීමෙන් නොවේ, වෙළඳාමෙන් නොවේ, ගව පාලනයෙන් නොවේ, දුනු ශිල්පයෙන් නොවේ, රජයේ සේවයෙන් නොවේ, වෙනත් කිසිදු ශිල්පයකින් නොවේ, පිඟන් කබලට නින්දා නොකරමින්, හුදෙක් පිඬුසිඟා යෑමෙන්. ඔහු ආචාර්ය ධනය ගුරුවරයාට භාර දී ධර්මානුකූලවද, අධර්මානුකූලවද, මිලදී ගැනීමෙන්ද, විකිණීමෙන්ද, දිය කඩිත්තකට සමීපව පැමිණි බ්‍රාහ්මණියක් පවා සොයයි.\n\nඔහු බ්‍රාහ්මණියක් හා ද, ක්ෂත්‍රියාවක් හා ද, වෛශ්‍යාවක් හා ද, ශූද්‍රාවක් හා ද, චණ්ඩාලියක් හා ද, දඩයක්කාර ස්ත්‍රියක් හා ද, වේනියක් (ඉඳිකොළ කම්හල්කරුවකුගේ ස්ත්‍රියක්) හා ද, රථකාර ස්ත්‍රියක් (රථ සාදන්නෙකුගේ ස්ත්‍රියක්) හා ද, පුක්කුසි ස්ත්‍රියක් (පිරිසිදු නොකරන කෙනෙකුගේ ස්ත්‍රියක්) හා ද, ගැබිණියක් හා ද, කිරි පොවන ස්ත්‍රියක් හා ද, ඍතු වූ ස්ත්‍රියක් හා ද, ඍතු නොවූ ස්ත්‍රියක් හා ද සංවාසයට පත්වෙයි. ඔහුගේ බ්‍රාහ්මණ ස්ත්‍රිය ඔහුට කාමයෙන් ද, දෑවැද්දෙන් ද, ඇලීමෙන් ද, දරුවන් පිණිස ද බ්‍රාහ්මණයාට බ්‍රාහ්මණිය වෙයි. යම් තාක් ප්‍රාචීන බ්‍රාහ්මණයන්ගේ සීමාවක් ඇද්ද, එහි නොසිටියි, එය ඉක්මවා යයි. ‘යම්තාක් ප්‍රාචීන බ්‍රාහ්මණයන්ගේ සීමාවක් ඇද්ද, බ්‍රාහ්මණයා එහි නොසිටියි, එය ඉක්මවා යයි’ දෝණ, එහෙයින් බ්‍රාහ්මණයා ‘සම්භින්නමරියාද’ (සීමා බිඳ දැමූ) බ්‍රාහ්මණයා යැයි කියනු ලැබේ. මෙසේ ය, දෝණ, බ්‍රාහ්මණයා ‘සම්භින්නමරියාද’ බ්‍රාහ්මණයා වන්නේ.\n\nකෙසේ නම්, දෝණ, බ්‍රාහ්මණයා ‘බ්‍රාහ්මණචණ්ඩාල’ කෙනෙක් වන්නේ ද? මෙහි දෝණ, බ්‍රාහ්මණයා මවගෙන් ද පියාගෙන් ද දෙපාර්ශවයෙන්ම මැනවින් උපන්නේ වෙයි. පිරිසිදු ගැබක් ඇත්තේ වෙයි. සත්වන මුතුපරම්පරාව දක්වා (පියාගේ හා මවගේ පාර්ශවයෙන්) ජාතිවාදයෙන් කිසිදු දෝෂයකට, අපවාදයකට ලක් නොවූවෙක් වෙයි. හෙතෙම අටසාළිස් වර්ෂයක් කෞමාර බ්‍රහ්මචාරීව වාසය කරයි, මන්ත්‍රයන් උගනිමින්. අටසාළිස් වර්ෂයක් කෞමාර බ්‍රහ්මචාරීව වාසය කොට, මන්ත්‍රයන් ඉගෙනගෙන, ආචාර්යවරයාට ආචාර්ය ධනය සොයයි, ධර්මයෙන් ද, අධර්මයෙන් ද, ගොවිතැනින් ද, වෙළඳාමෙන් ද, ගව පාලනයෙන් ද, දුනු ශිල්පයෙන් ද, රාජ්‍ය සේවයෙන් ද, වෙනත් ශිල්පයකින් ද, පූර්ණ වශයෙන් භික්ෂාචරණයෙන් ද, කබල (හිඟන පාත්‍රය) අවමන් නොකොට.\n\nඔහු ආචාර්යවරයාට ආචාර්ය ධනය දී (ගෙවා), බිරිඳක් සොයයි, ධර්මයෙන් ද, අධර්මයෙන් ද, මිලට ගැනීමෙන් ද, විකිණීමෙන් ද, බ්‍රාහ්මණියක් වුවද, ජලය අසල සිටින කෙනෙක් (සම්බන්ධ කරගෙන). ඔහු බ්‍රාහ්මණියක් හා ද, ක්ෂත්‍රියාවක් හා ද, වෛශ්‍යාවක් හා ද, ශූද්‍රාවක් හා ද, චණ්ඩාලියක් හා ද, දඩයක්කාර ස්ත්‍රියක් හා ද, වේනියක් හා ද, රථකාර ස්ත්‍රියක් හා ද, පුක්කුසි ස්ත්‍රියක් හා ද, ගැබිණියක් හා ද, කිරි පොවන ස්ත්‍රියක් හා ද, ඍතු වූ ස්ත්‍රියක් හා ද, ඍතු නොවූ ස්ත්‍රියක් හා ද සංවාසයට පත්වෙයි. ඔහුගේ බ්‍රාහ්මණ ස්ත්‍රිය ඔහුට කාමයෙන් ද, දෑවැද්දෙන් ද, ඇලීමෙන් ද, දරුවන් පිණිස ද බ්‍රාහ්මණයාට බ්‍රාහ්මණිය වෙයි. හෙතෙම සියලු කර්මාන්තයන්ගෙන් ජීවිකාව පවත්වාගෙන යයි. එවිට අනිත් බ්‍රාහ්මණයෝ ඔහුට මෙසේ කීහ: ‘ඒ භවත් බ්‍රාහ්මණයා බ්‍රාහ්මණයෙකු යැයි ප්‍රකාශ කරමින්, සියලු කර්මාන්තයන්ගෙන් ජීවිකාව පවත්වාගෙන යන්නේ මක්නිසාද?’ හෙතෙම මෙසේ කීයේ ය: ‘ඇවැත්නි, යම්සේ ගින්න පිරිසිදු දේ ද දවයි, අපිරිසිදු දේ ද දවයි, එයින් ගින්නට කිසිදු දෝෂයක් නොගෑවෙයි; එලෙසින්ම ඇවැත්නි, බ්‍රාහ්මණයා සියලු කර්මාන්තයන්ගෙන් ජීවිකාව පවත්වාගෙන ගියද, එයින් බ්‍රාහ්මණයාට කිසිදු දෝෂයක් නොගෑවෙයි.’ ‘සියලු කර්මාන්තයන්ගෙන් ජීවිකාව පවත්වාගෙන යයි’ දෝණ, එහෙයින් බ්‍රාහ්මණයා ‘බ්‍රාහ්මණචණ්ඩාල’ යැයි කියනු ලැබේ. මෙසේ ය, දෝණ, බ්‍රාහ්මණයා ‘බ්‍රාහ්මණචණ්ඩාල’ කෙනෙක් වන්නේ.\n\nදෝණ, යම් ඒ බ්‍රාහ්මණයන්ගේ පූර්ව ඉසිවරුන් මන්ත්‍රයන් ඇති කළාහු ද, මන්ත්‍රයන් පැවැත්වූවාහු ද, ඔවුන්ගේ මේ ප්‍රාචීන මන්ත්‍ර පද ගායනා කරන ලද, ප්‍රකාශ කරන ලද, මැනවින් සිතා බලන ලද ඒවා දැන් බ්‍රාහ්මණයෝ අනුව ගායනා කරති, අනුව ප්‍රකාශ කරති, ප්‍රකාශ කළ දේ අනුව ප්‍රකාශ කරති, ස්වාධ්‍යායනය කළ දේ අනුව ස්වාධ්‍යායනය කරති, වචන අනුව වචනයෙන් උච්චාරණය කරති, ඒ නම්: අට්ඨක, වාමක, වාමදේව, වෙසාමිත්ත, යමදග්ගි, අංගීරස, භාරද්වාජ, වාසෙට්ඨ, කස්සප, භගු වෙති. ඔවුහු මේ බ්‍රාහ්මණයන් පස් දෙනෙකු පනවති – බ්‍රහ්මසම, දේවසම, මරියාද, සම්භින්නමරියාද, පස්වැනියා බ්‍රාහ්මණචණ්ඩාලයාම ය. ඒ අතුරින් ඔබ, දෝණ, කවරෙක් ද?\n\nඑසේ නම්, භවත් ගෞතමයන් වහන්ස, අපි බ්‍රාහ්මණචණ්ඩාලයෙකුටවත් ගරු නොකරමු. අභිකාන්තයි, භවත් ගෞතමයන් වහන්ස... (මෙසේම) ...භවත් ගෞතමයන් වහන්ස, මා අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස සලකනු මැනවයි. දෙවැනි කොටස යි.",
      "paliTitle": "Doṇabrāhmaṇasuttaṃ",
      "englishTitle": "Doṇa the Brahmin Sutta",
      "sinhalaTitle": "දෝණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 193,
      "pali": "Atha kho saṅgāravo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho saṅgāravo brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu ko paccayo, yena kadāci dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā? Ko pana, bho gotama, hetu ko paccayo, yena kadāci dīgharattaṃ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā’’ti? ‘‘Yasmiṃ, brāhmaṇa, samaye kāmarāgapariyuṭṭhitena cetasā viharati kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. Seyyathāpi, brāhmaṇa, udapatto saṃsaṭṭho lākhāya vā haliddiyā vā nīliyā vā mañjiṭṭhāya vā. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ nappajāneyya na passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye kāmarāgapariyuṭṭhitena cetasā viharati kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye byāpādapariyuṭṭhitena cetasā viharati byāpādaparetena, uppannassa ca byāpādassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. Seyyathāpi, brāhmaṇa, udapatto agginā santatto ukkudhito [ukkaṭṭhito (sī. pī.), ukkuṭṭhito (syā. kaṃ.)] ussadakajāto [usumakajāto (katthaci), ussurakajāto (ka.), usmudakajāto (ma. ni. 3 majjhimanikāye)]. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ nappajāneyya na passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye byāpādapariyuṭṭhitena cetasā viharati byāpādaparetena, uppannassa ca byāpādassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye thinamiddhapariyuṭṭhitena cetasā viharati thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. Seyyathāpi, brāhmaṇa, udapatto sevālapaṇakapariyonaddho. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ nappajāneyya na passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye thinamiddhapariyuṭṭhitena cetasā viharati thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye uddhaccakukkuccapariyuṭṭhitena cetasā viharati uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. Seyyathāpi, brāhmaṇa, udapatto vāterito calito bhanto ūmijāto [ummijāto (pī.)]. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ nappajāneyya na passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye uddhaccakukkuccapariyuṭṭhitena cetasā viharati uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye vicikicchāpariyuṭṭhitena cetasā viharati vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. Seyyathāpi, brāhmaṇa, udapatto āvilo luḷito kalalībhūto andhakāre nikkhitto. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ nappajāneyya na passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye vicikicchāpariyuṭṭhitena cetasā viharati vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ nappajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ nappajānāti na passati, dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. ‘‘Yasmiñca kho, brāhmaṇa, samaye na kāmarāgapariyuṭṭhitena cetasā viharati na kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ pajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, paratthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, ubhayatthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, dīgharattaṃ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā. Seyyathāpi, brāhmaṇa, udapatto asaṃsaṭṭho lākhāya vā haliddiyā vā nīliyā vā mañjiṭṭhāya vā. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ pajāneyya passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye na kāmarāgapariyuṭṭhitena cetasā viharati…pe…. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye na byāpādapariyuṭṭhitena cetasā viharati…pe… seyyathāpi, brāhmaṇa, udapatto agginā asantatto anukkudhito anussadakajāto. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ pajāneyya passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye na byāpādapariyuṭṭhitena cetasā viharati…pe…. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye na thinamiddhapariyuṭṭhitena cetasā viharati…pe… seyyathāpi, brāhmaṇa, udapatto na sevālapaṇakapariyonaddho. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ pajāneyya passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye na thinamiddhapariyuṭṭhitena cetasā viharati…pe…. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye na uddhaccakukkuccapariyuṭṭhitena cetasā viharati… pe… seyyathāpi, brāhmaṇa, udapatto na vāterito na calito na bhanto na ūmijāto. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ pajāneyya passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye na uddhaccakukkuccapariyuṭṭhitena cetasā viharati …pe…. ‘‘Puna caparaṃ, brāhmaṇa, yasmiṃ samaye na vicikicchāpariyuṭṭhitena cetasā viharati na vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ pajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, paratthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, ubhayatthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, dīgharattaṃ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā. Seyyathāpi, brāhmaṇa, udapatto accho vippasanno anāvilo āloke nikkhitto. Tattha cakkhumā puriso sakaṃ mukhanimittaṃ paccavekkhamāno yathābhūtaṃ pajāneyya passeyya. Evamevaṃ kho, brāhmaṇa, yasmiṃ samaye na vicikicchāpariyuṭṭhitena cetasā viharati na vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ pajānāti, attatthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, paratthampi…pe… ubhayatthampi tasmiṃ samaye yathābhūtaṃ pajānāti passati, dīgharattaṃ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā. ‘‘Ayaṃ kho, brāhmaṇa, hetu ayaṃ paccayo, yena kadāci dīgharattaṃ sajjhāyakatāpi mantā nappaṭibhanti, pageva asajjhāyakatā. Ayaṃ pana, brāhmaṇa, hetu ayaṃ paccayo, yena kadāci dīgharattaṃ asajjhāyakatāpi mantā paṭibhanti, pageva sajjhāyakatā’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Tatiyaṃ.",
      "english": "Then the brahmin Saṅgārava approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable talk, he sat down to one side. As he sat to one side, the brahmin Saṅgārava said to the Blessed One: \"What, Venerable Gotama, is the cause, what is the reason, why sometimes sacred texts, even though recited for a long time, do not become clear, much less those not recited? And what, Venerable Gotama, is the cause, what is the reason, why sometimes sacred texts, even though not recited for a long time, do become clear, much less those recited?\"\n\n\"Brahmin, there is a time when one dwells with a mind overcome by sensual desire, dominated by sensual desire. One does not truly understand the escape from sensual desire that has arisen. At that time, one does not truly understand or see one's own welfare, nor does one truly understand or see the welfare of others, nor does one truly understand or see the welfare of both. At such a time, sacred texts, even though recited for a long time, do not become clear, much less those not recited. Just as, brahmin, a bowl of water mixed with lac, or turmeric, or indigo, or carmine. In that, a person with good eyesight looking at his own reflection would not truly discern or see it. In the same way, brahmin, there is a time when one dwells with a mind overcome by sensual desire, dominated by sensual desire. One does not truly understand the escape from sensual desire that has arisen. At that time, one does not truly understand or see one's own welfare, nor does one truly understand or see the welfare of others, nor does one truly understand or see the welfare of both. At such a time, sacred texts, even though recited for a long time, do not become clear, much less those not recited.\n\n\"Furthermore, brahmin, there is a time when one dwells with a mind overcome by ill-will, dominated by ill-will. One does not truly understand the escape from ill-will that has arisen. At that time, one does not truly understand or see one's own welfare, nor does one truly understand or see the welfare of others, nor does one truly understand or see the welfare of both. At such a time, sacred texts, even though recited for a long time, do not become clear, much less those not recited. Just as, brahmin, a bowl of water heated by fire, boiling, surging, and bubbling. In that, a person with good eyesight looking at his own reflection would not truly discern or see it. In the same way, brahmin, there is a time when one dwells with a mind overcome by ill-will, dominated by ill-will. One does not truly understand the escape from ill-will that has arisen. At that time, one does not truly understand or see one's own welfare, nor does one truly understand or see the welfare of others, nor does one truly understand or see the welfare of both. At such a time, sacred texts, even though recited for a long time, do not become clear, much less those not recited.\n\n\"Furthermore, brahmin, there is a time when one dwells with a mind overcome by sloth and torpor, dominated by sloth and torpor. One does not truly understand the escape from sloth and torpor that has arisen. At that time, one does not truly understand or see one's own welfare, nor does one truly understand or see the welfare of others, nor does one truly understand or see the welfare of both. At such a time, sacred texts, even though recited for a long time, do not become clear, much less those not recited. Just as, brahmin, a bowl of water covered with moss and water plants. In that, a person with good eyesight looking at his own reflection would not truly discern or see it. In the same way, brahmin, there is a time when one dwells with a mind overcome by sloth and torpor, dominated by sloth and torpor. One does not truly understand the escape from sloth and torpor that has arisen. At that time, one does not truly understand or see one's own welfare, nor does one truly understand or see the welfare of others, nor does one truly understand or see the welfare of both. At such a time, sacred texts, even though recited for a long time, do not become clear, much less those not recited.\n\n\"Furthermore, brahmin, there is a time when one dwells with a mind overcome by restlessness and remorse, dominated by restlessness and remorse. One does not truly understand the escape from restlessness and remorse that has arisen. At that time, one does not truly understand or see one's own welfare, nor does one truly understand or see the welfare of others, nor does one truly understand or see the welfare of both. At such a time, sacred texts, even though recited for a long time, do not become clear, much less those not recited. Just as, brahmin, a bowl of water agitated by the wind, disturbed, swirling, and filled with waves. In that, a person with good eyesight looking at his own reflection would not truly discern or see it.\n\nIndeed, O brahmin, when one dwells with a mind beset by restlessness and remorse, overwhelmed by restlessness and remorse, and does not understand as it actually is the escape from the arisen restlessness and remorse, then at that time one does not understand or see one's own welfare as it actually is; nor does one understand or see the welfare of others as it actually is; nor does one understand or see the welfare of both as it actually is. Even teachings that have been recited for a long time do not become clear, much less those that have not been recited.\n\nAgain, O brahmin, when one dwells with a mind beset by skeptical uncertainty, overwhelmed by skeptical uncertainty, and does not understand as it actually is the escape from the arisen skeptical uncertainty, then at that time one does not understand or see one's own welfare as it actually is; nor does one understand or see the welfare of others as it actually is; nor does one understand or see the welfare of both as it actually is. Even teachings that have been recited for a long time do not become clear, much less those that have not been recited. Just as, O brahmin, a pot of water that is turbid, stirred up, and muddy, placed in the dark, where a person with good sight, observing their own face reflected in it, would not understand or see it as it actually is. In the same way, O brahmin, when one dwells with a mind beset by skeptical uncertainty, overwhelmed by skeptical uncertainty, and does not understand as it actually is the escape from the arisen skeptical uncertainty, then at that time one does not understand or see one's own welfare as it actually is; nor does one understand or see the welfare of others as it actually is; nor does one understand or see the welfare of both as it actually is. Even teachings that have been recited for a long time do not become clear, much less those that have not been recited.\n\nBut, O brahmin, when one does not dwell with a mind beset by sensual desire, not overwhelmed by sensual desire, and understands as it actually is the escape from the arisen sensual desire, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited. Just as, O brahmin, a pot of water not mixed with lacquer, turmeric, indigo, or crimson, where a person with good sight, observing their own face reflected in it, would understand and see it as it actually is. In the same way, O brahmin, when one does not dwell with a mind beset by sensual desire, not overwhelmed by sensual desire, and understands as it actually is the escape from the arisen sensual desire, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited.\n\nAgain, O brahmin, when one does not dwell with a mind beset by ill-will, not overwhelmed by ill-will, and understands as it actually is the escape from the arisen ill-will, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited. Just as, O brahmin, a pot of water not heated by fire, not boiling, not bubbling, where a person with good sight, observing their own face reflected in it, would understand and see it as it actually is. In the same way, O brahmin, when one does not dwell with a mind beset by ill-will, not overwhelmed by ill-will, and understands as it actually is the escape from the arisen ill-will, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited.\n\nAgain, O brahmin, when one does not dwell with a mind beset by sloth and torpor, not overwhelmed by sloth and torpor, and understands as it actually is the escape from the arisen sloth and torpor, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited. Just as, O brahmin, a pot of water not covered with moss and water plants, where a person with good sight, observing their own face reflected in it, would understand and see it as it actually is. In the same way, O brahmin, when one does not dwell with a mind beset by sloth and torpor, not overwhelmed by sloth and torpor, and understands as it actually is the escape from the arisen sloth and torpor, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited.\n\nAgain, O brahmin, when one does not dwell with a mind beset by restlessness and remorse, not overwhelmed by restlessness and remorse, and understands as it actually is the escape from the arisen restlessness and remorse, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited. Just as, O brahmin, a pot of water not stirred by wind, not agitated, not swirling, not producing waves, where a person with good sight, observing their own face reflected in it, would understand and see it as it actually is. In the same way, O brahmin, when one does not dwell with a mind beset by restlessness and remorse, not overwhelmed by restlessness and remorse, and understands as it actually is the escape from the arisen restlessness and remorse, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited.\n\nAgain, O brahmin, when one does not dwell with a mind beset by skeptical uncertainty, not overwhelmed by skeptical uncertainty, and understands as it actually is the escape from the arisen skeptical uncertainty, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited. Just as, O brahmin, a pot of water that is clear, serene, and not turbid, placed in the light, where a person with good sight, observing their own face reflected in it, would understand and see it as it actually is. In the same way, O brahmin, when one does not dwell with a mind beset by skeptical uncertainty, not overwhelmed by skeptical uncertainty, and understands as it actually is the escape from the arisen skeptical uncertainty, then at that time one understands and sees one's own welfare as it actually is; one understands and sees the welfare of others as it actually is; one understands and sees the welfare of both as it actually is. Even teachings that have not been recited for a long time become clear, much less those that have been recited.\n\n“This, brahmin, is the cause, this is the condition, by which sometimes even sacred teachings that have been recited for a long time do not come to mind, how much less those that have not been recited. But this, brahmin, is the cause, this is the condition, by which sometimes even sacred teachings that have not been recited for a long time do come to mind, how much less those that have been recited.”\n\n“Excellent, Master Gotama! May Master Gotama accept me as a lay follower who has gone for refuge from this day forth, for as long as life shall last.” This was the third time.",
      "sinhala": "එවිට සංඝාරව බ්‍රාහ්මණ තෙමේ භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍ය​වතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි සංඝාරව බ්‍රාහ්මණ තෙමේ භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘පින්වත් ගෞතමයන් වහන්ස, යම් හේතුවකින්, යම් ප්‍ර​ත්‍යයකින් සමහර අවස්ථාවල බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගෙනවාද, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද? එසේම, පින්වත් ගෞතමයන් වහන්ස, යම් හේතුවකින්, යම් ප්‍ර​ත්‍යයකින් සමහර අවස්ථාවල බොහෝ කලක් පාඩම් නොකළ මන්ත්‍ර පවා මතකයට නැගෙනවාද, පාඩම් කළ ඒවා ගැන කියනුම කවරේද?’’\n\n‘‘බ්‍රාහ්මණය, යම් සමයක කාමරාගයෙන් යටපත් වූ, කාමරාගයෙන් වෙලී ගිය සිතකින් යුතුව වාසය කරන්නේද, හටගත් කාමරාගයෙන් මිදීම යථාභූතව නොදන්නේද, නොදකින්නේ ද, එකල තමාගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, අනුන්ගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, දෙලොව යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, එවිට බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගේ, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද? බ්‍රාහ්මණය, යම් සේ ලාටු හෝ කහ හෝ නිල් හෝ මදටියා සායමෙන් මිශ්‍ර වූ දිය භාජනයක් වේද, එහි ඇස් ඇත්තෙක් තමාගේ මුහුණේ ස්වරූපය පිරිසිඳ බලන විට යථාභූතව නොදන්නේය, නොදක්නේය. එපරිද්දෙන්ම, බ්‍රාහ්මණය, යම් සමයක කාමරාගයෙන් යටපත් වූ, කාමරාගයෙන් වෙලී ගිය සිතකින් යුතුව වාසය කරන්නේද, හටගත් කාමරාගයෙන් මිදීම යථාභූතව නොදන්නේද, නොදකින්නේ ද, එකල තමාගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, අනුන්ගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, දෙලොව යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, එවිට බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගේ, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද?\n\n‘‘නැවතද, බ්‍රාහ්මණය, යම් සමයක ව්‍යාපාදයෙන් යටපත් වූ, ව්‍යාපාදයෙන් වෙලී ගිය සිතකින් යුතුව වාසය කරන්නේද, හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූතව නොදන්නේද, නොදකින්නේ ද, එකල තමාගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, අනුන්ගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, දෙලොව යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, එවිට බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගේ, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද? බ්‍රාහ්මණය, යම් සේ ගින්නෙන් තැවුණු, උණු වී හටගත් උතුරන පෙණ ඇති දිය භාජනයක් වේද, එහි ඇස් ඇත්තෙක් තමාගේ මුහුණේ ස්වරූපය පිරිසිඳ බලන විට යථාභූතව නොදන්නේය, නොදක්නේය. එපරිද්දෙන්ම, බ්‍රාහ්මණය, යම් සමයක ව්‍යාපාදයෙන් යටපත් වූ, ව්‍යාපාදයෙන් වෙලී ගිය සිතකින් යුතුව වාසය කරන්නේද, හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූතව නොදන්නේද, නොදකින්නේ ද, එකල තමාගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, අනුන්ගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, දෙලොව යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, එවිට බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගේ, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද?\n\n‘‘නැවතද, බ්‍රාහ්මණය, යම් සමයක ථීනමිද්ධයෙන් යටපත් වූ, ථීනමිද්ධයෙන් වෙලී ගිය සිතකින් යුතුව වාසය කරන්නේද, හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූතව නොදන්නේද, නොදකින්නේ ද, එකල තමාගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, අනුන්ගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, දෙලොව යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, එවිට බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගේ, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද? බ්‍රාහ්මණය, යම් සේ සෙවෙල් සහ දිය දළු වලින් වැසී ගිය දිය භාජනයක් වේද, එහි ඇස් ඇත්තෙක් තමාගේ මුහුණේ ස්වරූපය පිරිසිඳ බලන විට යථාභූතව නොදන්නේය, නොදක්නේය. එපරිද්දෙන්ම, බ්‍රාහ්මණය, යම් සමයක ථීනමිද්ධයෙන් යටපත් වූ, ථීනමිද්ධයෙන් වෙලී ගිය සිතකින් යුතුව වාසය කරන්නේද, හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූතව නොදන්නේද, නොදකින්නේ ද, එකල තමාගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, අනුන්ගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, දෙලොව යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, එවිට බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගේ, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද?\n\n‘‘නැවතද, බ්‍රාහ්මණය, යම් සමයක උද්ධච්චකුක්කුච්චයෙන් යටපත් වූ, උද්ධච්චකුක්කුච්චයෙන් වෙලී ගිය සිතකින් යුතුව වාසය කරන්නේද, හටගත් උද්ධච්චකුක්කුච්චයෙන් මිදීම යථාභූතව නොදන්නේද, නොදකින්නේ ද, එකල තමාගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, අනුන්ගේ යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, දෙලොව යහපතද යථාභූතව නොදන්නේද, නොදකින්නේ ද, එවිට බොහෝ කලක් පාඩම් කළ මන්ත්‍ර පවා මතකයට නොනැගේ, පාඩම් නොකළ ඒවා ගැන කියනුම කවරේද? බ්‍රාහ්මණය, යම් සේ සුළඟින් පෙළී, කැළඹී, කැරකෙමින් රළ නැගුණු දිය භාජනයක් වේද, එහි ඇස් ඇත්තෙක් තමාගේ මුහුණේ ස්වරූපය පිරිසිඳ බලන විට යථාභූතව නොදන්නේය, නොදක්නේය.\n\nබ්‍රාහ්මණය, එපරිද්දෙන්ම, යම් සමයක උද්ධච්ච-කුක්කුච්චයෙන් (නොසන්සුන්කම හා පසුතැවිල්ලෙන්) සිත වසාගෙන, උද්ධච්ච-කුක්කුච්චයෙන් යුක්තව වාසය කරන්නේද, හටගත් ඒ උද්ධච්ච-කුක්කුච්චයෙන් මිදීම යථාභූත වශයෙන් නොදන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, බොහෝ කලක් පුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නොනැගේ, එසේ නොපුරුදු කරන ලද ධර්ම පාඨ ගැන කවර කතාද?\n\nබ්‍රාහ්මණය, තවද, යම් සමයක විචිකිච්ඡාවෙන් (සැකයෙන්) සිත වසාගෙන, විචිකිච්ඡාවෙන් යුක්තව වාසය කරන්නේද, හටගත් ඒ විචිකිච්ඡාවෙන් මිදීම යථාභූත වශයෙන් නොදන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, බොහෝ කලක් පුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නොනැගේ, එසේ නොපුරුදු කරන ලද ධර්ම පාඨ ගැන කවර කතාද? බ්‍රාහ්මණය, යම්සේ මඩ සහිත, කැළඹුණු, මඩ ගොහොරු වූ ජල භාජනයක් අන්ධකාරයේ තබා ඇත්නම්, එහිදී ඇස් ඇති පුරුෂයෙක් තම මුහුණේ රූපය යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, බ්‍රාහ්මණය, එපරිද්දෙන්ම, යම් සමයක විචිකිච්ඡාවෙන් සිත වසාගෙන, විචිකිච්ඡාවෙන් යුක්තව වාසය කරන්නේද, හටගත් ඒ විචිකිච්ඡාවෙන් මිදීම යථාභූත වශයෙන් නොදන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් නොදන්නේද, නොදකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නොනැගේ, එසේනම් පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද?\n\nබ්‍රාහ්මණය, යම් සමයක කාමරාගයෙන් සිත වසා නොගෙන, කාමරාගයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් කාමරාගයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද? බ්‍රාහ්මණය, යම්සේ ලාකඩයෙන් හෝ කහවලින් හෝ නිල්වලින් හෝ මජ්ජිෂ්ඨකයෙන් (රතු සායමෙන්) හෝ නොකැළඹුණු ජල භාජනයක් ඇත්නම්, එහිදී ඇස් ඇති පුරුෂයෙක් තම මුහුණේ රූපය යථාභූත වශයෙන් දන්නේද, දකින්නේද, බ්‍රාහ්මණය, එපරිද්දෙන්ම, යම් සමයක කාමරාගයෙන් සිත වසා නොගෙන, කාමරාගයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් කාමරාගයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද?\n\nබ්‍රාහ්මණය, තවද, යම් සමයක ව්‍යාපාදයෙන් (ක්‍රෝධයෙන්) සිත වසා නොගෙන, ව්‍යාපාදයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද? බ්‍රාහ්මණය, යම්සේ ගින්නෙන් නොරත් වූ, නොපිළිස්සුණු, උතුරුවා නොගත් ජල භාජනයක් ඇත්නම්, එහිදී ඇස් ඇති පුරුෂයෙක් තම මුහුණේ රූපය යථාභූත වශයෙන් දන්නේද, දකින්නේද, බ්‍රාහ්මණය, එපරිද්දෙන්ම, යම් සමයක ව්‍යාපාදයෙන් සිත වසා නොගෙන, ව්‍යාපාදයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද?\n\nබ්‍රාහ්මණය, තවද, යම් සමයක ථීනමිද්ධයෙන් (අලසකමෙන් හා නිදිමතෙන්) සිත වසා නොගෙන, ථීනමිද්ධයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද? බ්‍රාහ්මණය, යම්සේ පාසිවලින් නොවැසුණු ජල භාජනයක් ඇත්නම්, එහිදී ඇස් ඇති පුරුෂයෙක් තම මුහුණේ රූපය යථාභූත වශයෙන් දන්නේද, දකින්නේද, බ්‍රාහ්මණය, එපරිද්දෙන්ම, යම් සමයක ථීනමිද්ධයෙන් සිත වසා නොගෙන, ථීනමිද්ධයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද?\n\nබ්‍රාහ්මණය, තවද, යම් සමයක උද්ධච්ච-කුක්කුච්චයෙන් (නොසන්සුන්කම හා පසුතැවිල්ලෙන්) සිත වසා නොගෙන, උද්ධච්ච-කුක්කුච්චයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් උද්ධච්ච-කුක්කුච්චයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද? බ්‍රාහ්මණය, යම්සේ සුළඟින් නොසැලුණු, නොසෙලවුණු, නොකැළඹුණු, රළ නොනැඟුණු ජල භාජනයක් ඇත්නම්, එහිදී ඇස් ඇති පුරුෂයෙක් තම මුහුණේ රූපය යථාභූත වශයෙන් දන්නේද, දකින්නේද, බ්‍රාහ්මණය, එපරිද්දෙන්ම, යම් සමයක උද්ධච්ච-කුක්කුච්චයෙන් සිත වසා නොගෙන, උද්ධච්ච-කුක්කුච්චයෙන් යුක්තව වාසය නොකරන්නේද, හටගත් උද්ධච්ච-කුක්කුච්චයෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද?\n\nබ්‍රාහ්මණය, තවද, යම් සමයක විචිකිච්ඡාවෙන් සිත වසා නොගෙන, විචිකිච්ඡාවෙන් යුක්තව වාසය නොකරන්නේද, හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද? බ්‍රාහ්මණය, යම්සේ පිරිසිදු, පැහැදිලි, නොකැළඹුණු ජල භාජනයක් ආලෝකයේ තබා ඇත්නම්, එහිදී ඇස් ඇති පුරුෂයෙක් තම මුහුණේ රූපය යථාභූත වශයෙන් දන්නේද, දකින්නේද, බ්‍රාහ්මණය, එපරිද්දෙන්ම, යම් සමයක විචිකිච්ඡාවෙන් සිත වසා නොගෙන, විචිකිච්ඡාවෙන් යුක්තව වාසය නොකරන්නේද, හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූත වශයෙන් දන්නේද, ඒ සමයෙහි තමාගේ අර්ථයද යථාභූත වශයෙන් දන්නේද, දකින්නේද, අනුන්ගේ අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, තමාගේ හා අනුන්ගේ යන දෙලොව අර්ථයද ඒ සමයෙහි යථාභූත වශයෙන් දන්නේද, දකින්නේද, බොහෝ කලක් නොපුරුදු කරන ලද ධර්ම පාඨ පවා සිහියට නැගේ, එසේ පුරුදු කරන ලද ධර්ම පාඨ ගැන කියනු කවරේද?\n\n\"බ්‍රාහ්මණය, මෙයම හේතුවයි, මෙයම ප්‍රත්‍යයයි, යම් කරුණක් නිසා දීර්ඝ කාලයක් මුළුල්ලේ සජ්ඣායනා කරන ලද මන්ත්‍ර පවා (සමහර විට) මනසට නොපහළ වේ; සජ්ඣායනා නොකරන ලද මන්ත්‍ර ගැන කියනුම කවරේද? එහෙත් බ්‍රාහ්මණය, මෙයම හේතුවයි, මෙයම ප්‍රත්‍යයයි, යම් කරුණක් නිසා දීර්ඝ කාලයක් මුළුල්ලේ සජ්ඣායනා නොකරන ලද මන්ත්‍ර පවා (සමහර විට) මනසට පහළ වේ; සජ්ඣායනා කරන ලද මන්ත්‍ර ගැන නම් කියනුම කවරේද?\"\n\n\"අතිශයින් ශ්‍රේෂ්ඨයි, භවත් ගෞතමයන් වහන්ස!... අද පටන් දිවි හිමියෙන් සරණ ගිය මා උපාසකයකු ලෙස භවත් ගෞතමයන් වහන්ස, පිළිගන්නා සේක්වා.\" තෙවැනි වරට.",
      "paliTitle": "Saṅgāravasuttaṃ",
      "englishTitle": "The Discourse to Saṅgārava",
      "sinhalaTitle": "සංගාරව සූත්‍රය"
    },
    {
      "number": 194,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena kāraṇapālī [karaṇapālī (ka.)] brāhmaṇo licchavīnaṃ kammantaṃ kāreti. Addasā kho kāraṇapālī brāhmaṇo piṅgiyāniṃ brāhmaṇaṃ dūratova āgacchantaṃ; disvā piṅgiyāniṃ brāhmaṇaṃ etadavoca – ‘‘Handa, kuto nu bhavaṃ piṅgiyānī āgacchati divā divassā’’ti? ‘‘Itohaṃ [idhāhaṃ (syā. kaṃ.), ito hi kho ahaṃ (ma. ni. 1.288)], bho, āgacchāmi samaṇassa gotamassa santikā’’ti. ‘‘Taṃ kiṃ maññati bhavaṃ, piṅgiyānī, samaṇassa gotamassa paññāveyyattiyaṃ? Paṇḍito maññe’’ti? ‘‘Ko cāhaṃ, bho, ko ca samaṇassa gotamassa paññāveyyattiyaṃ jānissāmi! Sopi nūnassa tādisova yo samaṇassa gotamassa paññāveyyattiyaṃ jāneyyā’’ti! ‘‘Uḷārāya khalu bhavaṃ, piṅgiyānī, samaṇaṃ gotamaṃ pasaṃsāya pasaṃsatī’’ti. ‘‘Ko cāhaṃ, bho, ko ca samaṇaṃ gotamaṃ pasaṃsissāmi! Pasatthappasatthova [pasaṭṭhapasaṭṭho ca (syā. kaṃ. ka.)] so bhavaṃ gotamo seṭṭho devamanussāna’’nti. ‘‘Kiṃ pana bhavaṃ, piṅgiyānī, atthavasaṃ sampassamāno samaṇe gotame evaṃ abhippasanno’’ti? ‘‘Seyyathāpi, bho, puriso aggarasaparititto na aññesaṃ hīnānaṃ rasānaṃ piheti; evamevaṃ kho, bho, yato yato tassa bhoto gotamassa dhammaṃ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato na aññesaṃ puthusamaṇabrāhmaṇappavādānaṃ piheti. ‘‘Seyyathāpi, bho, puriso jighacchādubbalyapareto madhupiṇḍikaṃ adhigaccheyya. So yato yato sāyetha, labhateva [sāyeyya, labhetheva (ma. ni. 1.205)] sādurasaṃ asecanakaṃ; evamevaṃ kho, bho, yato yato tassa bhoto gotamassa dhammaṃ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato labhateva attamanataṃ, labhati cetaso pasādaṃ. ‘‘Seyyathāpi, bho, puriso candanaghaṭikaṃ adhigaccheyya – haricandanassa vā lohitacandanassa vā. So yato yato ghāyetha – yadi mūlato, yadi majjhato, yadi aggato – adhigacchateva [adhigacchetheva (?)] surabhigandhaṃ asecanakaṃ; evamevaṃ kho, bho, yato yato tassa bhoto gotamassa dhammaṃ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato adhigacchati pāmojjaṃ adhigacchati somanassaṃ. ‘‘Seyyathāpi, bho, puriso ābādhiko dukkhito bāḷhagilāno. Tassa kusalo bhisakko ṭhānaso ābādhaṃ nīhareyya; evamevaṃ kho, bho, yato yato tassa bhoto gotamassa dhammaṃ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato sokaparidevadukkhadomanassupāyāsā abbhatthaṃ gacchanti. ‘‘Seyyathāpi, bho, pokkharaṇī acchodakā sātodakā sītodakā setakā supatitthā ramaṇīyā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. So taṃ pokkharaṇiṃ ogāhetvā nhātvā ca pivitvā ca sabbadarathakilamathapariḷāhaṃ paṭippassambheyya. Evamevaṃ kho, bho, yato yato tassa bhoto gotamassa dhammaṃ suṇāti – yadi suttaso, yadi geyyaso, yadi veyyākaraṇaso, yadi abbhutadhammaso – tato tato sabbadarathakilamathapariḷāhā paṭippassambhantī’’ti. Evaṃ vutte kāraṇapālī brāhmaṇo uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā dakkhiṇaṃ jāṇumaṇḍalaṃ pathaviyaṃ nihantvā yena bhagavā tenañjaliṃ paṇāmetvā tikkhattuṃ udānaṃ udānesi – ‘‘Namo tassa bhagavato arahato sammāsambuddhassa; Namo tassa bhagavato arahato sammāsambuddhassa; Namo tassa bhagavato arahato sammāsambuddhassā’’ti. ‘‘Abhikkantaṃ, bho piṅgiyāni, abhikkantaṃ, bho piṅgiyāni! Seyyathāpi, bho piṅgiyāni, nikkujjitaṃ [nikujjitaṃ (ka.)] vā ukkujjeyya paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā piṅgiyāninā anekapariyāyena dhammo pakāsito. Esāhaṃ, bho piṅgiyāni, taṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ piṅgiyānī dhāretu, ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Catutthaṃ.",
      "english": "At one time the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Now at that time the brahmin Kāraṇapālī was overseeing the affairs of the Licchavis.\n\nThe brahmin Kāraṇapālī saw the brahmin Piṅgiyāni coming from afar. Having seen the brahmin Piṅgiyāni, he said this to him: “Well now, good sir Piṅgiyāni, where are you coming from at this time of day?”\n\n“Good sir, I am coming from the presence of the recluse Gotama.”\n\n“What does your good self, Piṅgiyāni, think of the recluse Gotama’s manifest wisdom? He is wise, I suppose?”\n\n“Who am I, good sir, that I could know the manifest wisdom of the recluse Gotama! One would have to be his equal, surely, to know the manifest wisdom of the recluse Gotama!”\n\n“Indeed, good sir Piṅgiyāni, you praise the recluse Gotama with lofty praise.”\n\n“Who am I, good sir, that I should praise the recluse Gotama! That good sir Gotama is praised by those worthy of praise, indeed he is the foremost among gods and humans.”\n\n“What is the reason, good sir Piṅgiyāni, that, seeing which benefit, you have such profound faith in the recluse Gotama?”\n\n“Just as, good sir, a man who has partaken to his full satisfaction of supreme delicacies does not crave other inferior flavors. Even so, good sir, whenever one hears the Dhamma of that good sir Gotama – whether in discourses, in verses, in explanations, or in miraculous occurrences – one no longer craves the doctrines of other recluses and brahmins of various schools.\n\n“Just as, good sir, a man afflicted by hunger and weakness might come upon a lump of honey. From wherever he might taste it, he would experience a sweet, unadulterated flavor. Even so, good sir, whenever one hears the Dhamma of that good sir Gotama – whether in discourses, in verses, in explanations, or in miraculous occurrences – from that point one experiences delight and gains clarity of mind.\n\n“Just as, good sir, a man might come upon a piece of sandalwood – either green sandalwood or red sandalwood. From wherever he might smell it – whether from the root, from the middle, or from the tip – he would experience a fragrant, unadulterated scent. Even so, good sir, whenever one hears the Dhamma of that good sir Gotama – whether in discourses, in verses, in explanations, or in miraculous occurrences – from that point one experiences joy and experiences happiness.\n\n“Just as, good sir, a man might be sick, suffering, gravely ill. A skilled physician might promptly remove his illness. Even so, good sir, whenever one hears the Dhamma of that good sir Gotama – whether in discourses, in verses, in explanations, or in miraculous occurrences – from that point sorrow, lamentation, pain, distress, and despair vanish.\n\n“Just as, good sir, there might be a pond with clear, pleasant, cool, clean water, with good landing places, delightful. Then a man, overcome by the heat, tormented by the sun, weary, thirsty, parched, might come along. He might enter that pond, and having bathed and drunk, would soothe all his fever, weariness, and burning torment. Even so, good sir, whenever one hears the Dhamma of that good sir Gotama – whether in discourses, in verses, in explanations, or in miraculous occurrences – from that point all fever, weariness, and burning torment are soothed.”\n\nWhen this was said, the brahmin Kāraṇapālī rose from his seat, arranged his upper robe over one shoulder, knelt on his right knee on the ground, extended his clasped hands in salutation towards the Blessed One, and three times uttered this exalted utterance: “Homage to the Blessed One, the Arahant, the Perfectly Self-Awakened One; Homage to the Blessed One, the Arahant, the Perfectly Self-Awakened One; Homage to the Blessed One, the Arahant, the Perfectly Self-Awakened One.”\n\n“Excellent, good sir Piṅgiyāni, excellent, good sir Piṅgiyāni! Just as, good sir Piṅgiyāni, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or hold a lamp in the darkness so that those with eyes might see forms. Even so, the Dhamma has been made clear by your good self, Piṅgiyāni, in various ways. I, good sir Piṅgiyāni, go for refuge to that good sir Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May your good self, Piṅgiyāni, remember me as a lay follower, who has gone for refuge from this day forth as long as life lasts.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි, මහ වනයෙහි, කූටාගාර ශාලාවේ වැඩවසන සේක. එකල්හි කාරණපාලී නම් බ්‍රාහ්මණයා ලිච්ඡවීන්ට අයත් කටයුතු කරවමින් සිටියේය.\n\nකාරණපාලී බ්‍රාහ්මණයා ඈතදීම පිංගියානි බ්‍රාහ්මණයා එනු දුටුවේය; දැක, පිංගියානි බ්‍රාහ්මණයාට මෙසේ කීවේය: \"ඇවැත් පිංගියානි, ඔබ මේ දවල් දවසෙහි කොහේ සිට පැමිණෙන්නේද?\"\n\n\"ඇවැත්නි, මම මේ ශ්‍රමණ ගෞතමයන් වහන්සේගේ සමීපයෙන් පැමිණෙමි.\"\n\n\"ඇවැත් පිංගියානි, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේගේ ප්‍රඥාවේ දක්ෂතාවය ගැන කුමක් සිතන්නේද? උන්වහන්සේ පණ්ඩිතයෙකැයි ඔබ සිතනවාද?\"\n\n\"ඇවැත්නි, මම කවුද, ශ්‍රමණ ගෞතමයන් වහන්සේගේ ප්‍රඥාවේ දක්ෂතාවය දැනගන්නට! ශ්‍රමණ ගෞතමයන් වහන්සේගේ ප්‍රඥාවේ දක්ෂතාවය දන්නේ, ඒ බඳුම කෙනෙක් විය යුතුය!\"\n\n\"ඇවැත් පිංගියානි, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේ උසස් ප්‍රශංසාවකින් වර්ණනා කරන සේක.\"\n\n\"ඇවැත්නි, මම කවුද, ශ්‍රමණ ගෞතමයන් වහන්සේ වර්ණනා කරන්නට! ඒ ගෞතමයන් වහන්සේ වනාහි ප්‍රශංසා ලැබූවන් විසින් පවා ප්‍රශංසාවට ලක් වූ, දෙව් මිනිසුන් අතර උතුම්ම කෙනෙකි.\"\n\n\"ඇවැත් පිංගියානි, කුමන අර්ථයක් (හෝ ප්‍රයෝජනයක්) දැක, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේ කෙරෙහි මෙතරම් පැහැදීමකින් සිටින්නේද?\"\n\n\"ඇවැත්නි, යම් සේ පුරුෂයෙක් උතුම් රසයකින් සෑහීමකට පත් වූ විට, අන් කිසිම හීන රසයකට ආශා නොකරයිද; එලෙසින්ම, ඇවැත්නි, යම් යම් අයුරකින් ඒ ගෞතමයන් වහන්සේගේ ධර්මය අසයිද – සූත්‍ර ලෙසින් හෝ, ගේය ලෙසින් හෝ, ව්‍යාකරණ ලෙසින් හෝ, අද්භූත ධර්ම ලෙසින් හෝ – එම්බා, එම්බා, අන්‍ය විවිධ ශ්‍රමණයන්ගේ හා බ්‍රාහ්මණයන්ගේ වාදයන්ට ආශා නොකරයි.\n\n\"ඇවැත්නි, යම් සේ කුසගින්නෙන් හා දුර්වලතාවයෙන් පෙළුණු පුරුෂයෙක් මී පිඬක් ලබා ගන්නේය. ඔහු යම් යම් තැනකින් එය රස විඳීද, අසම සම මිහිරි රසයක්ම ලබන්නේය; එලෙසින්ම, ඇවැත්නි, යම් යම් අයුරකින් ඒ ගෞතමයන් වහන්සේගේ ධර්මය අසයිද – සූත්‍ර ලෙසින් හෝ, ගේය ලෙසින් හෝ, ව්‍යාකරණ ලෙසින් හෝ, අද්භූත ධර්ම ලෙසින් හෝ – එම්බා, එම්බා, ඔහු සතුටක්ම ලබයි, සිතේ පැහැදීමක් ලබයි.\n\n\"ඇවැත්නි, යම් සේ පුරුෂයෙක් සඳුන් කැබැල්ලක් ලබා ගන්නේය – හරිචන්දන හෝ ලෝහිතචන්දන වේවා. ඔහු යම් යම් තැනකින් එය ආඝ්‍රාණය කරයිද – මුලෙන් හෝ, මැදින් හෝ, අගින් හෝ – අසම සම සුවඳක්ම ලබන්නේය; එලෙසින්ම, ඇවැත්නි, යම් යම් අයුරකින් ඒ ගෞතමයන් වහන්සේගේ ධර්මය අසයිද – සූත්‍ර ලෙසින් හෝ, ගේය ලෙසින් හෝ, ව්‍යාකරණ ලෙසින් හෝ, අද්භූත ධර්ම ලෙසින් හෝ – එම්බා, එම්බා, ඔහු ප්‍රමෝදය ලබයි, සෝමනස්සය ලබයි.\n\n\"ඇවැත්නි, යම් සේ පුරුෂයෙක් ආබාධිතව, දුක් විඳිමින්, දැඩි ලෙස ගිලන්ව සිටින්නේය. දක්ෂ වෛද්‍යවරයෙක් ඔහුගේ රෝගය මූලයෙන්ම ඉවත් කරන්නේය; එලෙසින්ම, ඇවැත්නි, යම් යම් අයුරකින් ඒ ගෞතමයන් වහන්සේගේ ධර්මය අසයිද – සූත්‍ර ලෙසින් හෝ, ගේය ලෙසින් හෝ, ව්‍යාකරණ ලෙසින් හෝ, අද්භූත ධර්ම ලෙසින් හෝ – එම්බා, එම්බා, ශෝක, වැළපීම්, දුක්, දොම්නස්, හා උපායාසයන් සම්පූර්ණයෙන්ම පහව යන්නේය.\n\n\"ඇවැත්නි, යම් සේ පැහැදිලි දිය ඇති, ප්‍රියමනාප දිය ඇති, සිහිල් දිය ඇති, සුදු පැහැති, මනා තොටුපොළවල් සහිත, සිත්කලු පොකුණක් ඇත්තේය. එවිට අව් රශ්මියෙන් පෙලී, අව්වෙන් වෙහෙසට පත් වී, ක්ලාන්තව, පිපාසාවෙන්, දැඩි පිපාසාවෙන් පෙළෙන පුරුෂයෙක් පැමිණෙන්නේය. ඔහු ඒ පොකුණට බැස, නා, බී, සියලු විඩාබර බව, ක්ලාන්තය, හා අධික දැවිල්ල සංසිඳුවා ගන්නේය. එලෙසින්ම, ඇවැත්නි, යම් යම් අයුරකින් ඒ ගෞතමයන් වහන්සේගේ ධර්මය අසයිද – සූත්‍ර ලෙසින් හෝ, ගේය ලෙසින් හෝ, ව්‍යාකරණ ලෙසින් හෝ, අද්භූත ධර්ම ලෙසින් හෝ – එම්බා, එම්බා, සියලු විඩාබර බව, ක්ලාන්තය, හා අධික දැවිල්ල සම්පූර්ණයෙන්ම සංසිඳෙන්නේය.\"\n\nමෙසේ කී කල්හි, කාරණපාලී බ්‍රාහ්මණයා අසුනෙන් නැගිට, උතුරු සළුව එක අතකින් පොරවාගෙන, දකුණු දණ මඬල පොළොවෙහි තබා, භාග්‍යවතුන් වහන්සේ දෙසට ඇඳිලි බැඳ, තුන් වරක් මේ උදාන වාක්‍යය ප්‍රකාශ කළේය: \"ඒ භාග්‍යවතුන් වහන්සේට, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා; ඒ භාග්‍යවතුන් වහන්සේට, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා; ඒ භාග්‍යවතුන් වහන්සේට, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා.\"\n\n\"ඇවැත් පිංගියානි, ඉතා අලංකාරයි, ඇවැත් පිංගියානි, ඉතා අලංකාරයි! ඇවැත් පිංගියානි, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වැසී තිබූ දෙයක් විවෘත කරන්නේද, මග නොදන්නා කෙනෙකුට මග පෙන්වන්නේද, නැතහොත් අඳුරෙහි තෙල් පහනක් දරන්නේද – ඇස් ඇති අය රූප දකින්නට – එලෙසින්ම, ඇවැත් පිංගියානි විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කර ඇත. ඇවැත් පිංගියානි, මම ඒ ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. ඇවැත් පිංගියානි, අද පටන් ජීවිතාන්තය දක්වා සරණ ගිය උපාසකයෙකු ලෙස මා සිහි කරනු මැනව.\"",
      "paliTitle": "Kāraṇapālīsuttaṃ",
      "englishTitle": "To Kāraṇapālī Sutta",
      "sinhalaTitle": "කාරණපාලී සූත්‍රය"
    },
    {
      "number": 195,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena pañcamattāni licchavisatāni bhagavantaṃ payirupāsanti. Appekacce licchavī nīlā honti nīlavaṇṇā nīlavatthā nīlālaṅkārā, appekacce licchavī pītā honti pītavaṇṇā pītavatthā pītālaṅkārā, appekacce licchavī lohitakā honti lohitakavaṇṇā lohitakavatthā lohitakālaṅkārā, appekacce licchavī odātā honti odātavaṇṇā odātavatthā odātālaṅkārā. Tyassudaṃ bhagavā atirocati vaṇṇena ceva yasasā ca. Atha kho piṅgiyānī brāhmaṇo uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ, bhagavā, paṭibhāti maṃ, sugatā’’ti. ‘‘Paṭibhātu taṃ piṅgiyānī’’ti bhagavā avoca. Atha kho piṅgiyānī brāhmaṇo bhagavato sammukhā sāruppāya gāthāya abhitthavi – ‘‘Padmaṃ [padumaṃ (ka.) saṃ. ni. 1.132] yathā kokanadaṃ [kokanudaṃ (syā. kaṃ.)] sugandhaṃ, Pāto siyā phullamavītagandhaṃ; Aṅgīrasaṃ passa virocamānaṃ, Tapantamādiccamivantalikkhe’’ti. Atha kho te licchavī pañcahi uttarāsaṅgasatehi piṅgiyāniṃ brāhmaṇaṃ acchādesuṃ. Atha kho piṅgiyānī brāhmaṇo tehi pañcahi uttarāsaṅgasatehi bhagavantaṃ acchādesi. Atha kho bhagavā te licchavī etadavoca – ‘‘pañcannaṃ, licchavī, ratanānaṃ pātubhāvo dullabho lokasmiṃ. Katamesaṃ pañcannaṃ? Tathāgatassa arahato sammāsambuddhassa pātubhāvo dullabho lokasmiṃ. Tathāgatappaveditassa dhammavinayassa desetā puggalo dullabho lokasmiṃ. Tathāgatappaveditassa dhammavinayassa desitassa viññātā puggalo dullabho lokasmiṃ. Tathāgatappaveditassa dhammavinayassa desitassa viññātā dhammānudhammappaṭipanno puggalo dullabho lokasmiṃ. Kataññū katavedī puggalo dullabho lokasmiṃ. Imesaṃ kho, licchavī, pañcannaṃ ratanānaṃ pātubhāvo dullabho lokasmi’’nti [a. ni. 5.143]. Pañcamaṃ.",
      "english": "At one time, the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Now, at that time, about five hundred Licchavis were attending upon the Blessed One. Some of those Licchavis were blue, of blue complexion, clad in blue, and adorned in blue. Some Licchavis were yellow, of yellow complexion, clad in yellow, and adorned in yellow. Some Licchavis were red, of red complexion, clad in red, and adorned in red. Some Licchavis were white, of white complexion, clad in white, and adorned in white. Yet the Blessed One outshone them in both splendor and glory.\n\nThen, the brahmin Piṅgiyānī rose from his seat, arranged his upper robe over one shoulder, and bowing with clasped hands towards the Blessed One, he said to the Blessed One, \"It occurs to me, Blessed One! It occurs to me, Fortunate One!\"\n\nThe Blessed One said, \"Let it occur to you, Piṅgiyānī.\"\n\nThen the brahmin Piṅgiyānī, in the presence of the Blessed One, praised him with a fitting verse:\n\"Just as a fragrant red lotus,\nBlooms in the morning, its scent unwaning;\nBehold the radiant Angirasa,\nShining like the sun ablaze in the sky.\"\n\nThen those Licchavis presented the brahmin Piṅgiyānī with five hundred upper robes. Then the brahmin Piṅgiyānī presented the Blessed One with those five hundred upper robes.\n\nThen the Blessed One said to those Licchavis, \"Licchavis, the appearance of five gems is rare in the world. Which five?\n\nThe appearance in the world of a Realized One, an Arahant, a Fully Self-Awakened One, is rare.\n\nRare in the world is a person who teaches the Dhamma and Vinaya proclaimed by the Realized One.\n\nRare in the world is a person who understands the Dhamma and Vinaya that has been taught and proclaimed by the Realized One.\n\nRare in the world is a person who understands the Dhamma and Vinaya that has been taught and proclaimed by the Realized One, and who practices in accordance with the Dhamma and its sub-divisions.\n\nRare in the world is a person who is grateful and repays gratitude.\n\nIndeed, Licchavis, the appearance of these five gems is rare in the world.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෛශාලියේ මහ වනයෙහි කූටාගාර ශාලාවේ වැඩවසන සේක. ඒ වේලෙහි පන්සියයක් පමණ ලිච්ඡවීහු භාග්‍යවතුන් වහන්සේ පිරිවරාගෙන වැඩ සිටියහ. සමහර ලිච්ඡවීහු නිල් පැහැයෙන්, නිල් වස්ත්‍රවලින් හා නිල් ආභරණවලින් සැරසී සිටියහ. සමහර ලිච්ඡවීහු කහ පැහැයෙන්, කහ වස්ත්‍රවලින් හා කහ ආභරණවලින් සැරසී සිටියහ. සමහර ලිච්ඡවීහු රතු පැහැයෙන්, රතු වස්ත්‍රවලින් හා රතු ආභරණවලින් සැරසී සිටියහ. සමහර ලිච්ඡවීහු සුදු පැහැයෙන්, සුදු වස්ත්‍රවලින් හා සුදු ආභරණවලින් සැරසී සිටියහ. ඒ සියල්ලටම වඩා භාග්‍යවතුන් වහන්සේ වර්ණයෙන් ද, යසසින් ද බබළන සේක.\n\nඉක්බිති පිංගියානි බමුණා හුනස්නෙන් නැගිට, උතුරු සළුව එක අංසයක් මතට කොට, භාග්‍යවතුන් වහන්සේ දෙසට අංජලි ප්‍රණාමය කොට, භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘භාග්‍යවතුන් වහන්ස, මට වැටහේ. සුගතයන් වහන්ස, මට වැටහේ!’’ ‘‘පිංගියානිය, ඔබට වැටහේවා!’’ යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. ඉක්බිති පිංගියානි බමුණා භාග්‍යවතුන් වහන්සේ ඉදිරියේ සුදුසු ගාථාවකින් මෙසේ ප්‍රශංසා කළේය:\n\n‘‘යම් සේ සුවඳවත් කොකනද පියුමක්,\nඋදය කාලයෙහි නොපරවූ සුවඳින් පිපී ඇද්ද,\nඑසේම අහසෙහි තපිනා හිරු මෙන්,\nබබළන අංගීරසයන් (බුදුරදුන්) වහන්සේ බලන්නැ!’’\n\nඉක්බිති ඒ ලිච්ඡවීහු උතුරු සළු පන්සියයකින් පිංගියානි බමුණාට පූජා කළහ. ඉක්බිති පිංගියානි බමුණා ඒ උතුරු සළු පන්සියයෙන්ම භාග්‍යවතුන් වහන්සේට පූජා කළේය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ ලිච්ඡවීන්ට මෙසේ වදාළ සේක: ‘‘ලිච්ඡවීනි, මේ ලෝකයෙහි පස් ආකාර රත්නයන්ගේ පහළ වීම දුර්ලභය. ඒ පස කුමක් ද? මේ ලෝකයෙහි රහත් වූ සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ නමකගේ පහළ වීම දුර්ලභය. තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරන්නා වූ පුද්ගලයා මේ ලෝකයෙහි දුර්ලභය. තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කළ කල්හි එය අවබෝධ කරගන්නා වූ පුද්ගලයා මේ ලෝකයෙහි දුර්ලභය. තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කළ කල්හි එය අවබෝධ කරගෙන ධර්මානුධර්ම ප්‍රතිපදාවේ හැසිරෙන්නා වූ පුද්ගලයා මේ ලෝකයෙහි දුර්ලභය. කළ ගුණ දන්නා වූ, කළ ගුණ සලකන්නා වූ පුද්ගලයා මේ ලෝකයෙහි දුර්ලභය. ලිච්ඡවීනි, මේ පස් ආකාර රත්නයන්ගේ පහළ වීම මේ ලෝකයෙහි දුර්ලභය’’ යැයි වදාළ සේක.",
      "paliTitle": "Piṅgiyānīsuttaṃ",
      "englishTitle": "The Discourse to Piṅgiyānī",
      "sinhalaTitle": "පිංගියානී සූත්‍රය"
    },
    {
      "number": 196,
      "pali": "‘‘Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato pañca mahāsupinā pāturahesuṃ. Katame pañca? Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ayaṃ mahāpathavī mahāsayanaṃ ahosi, himavā pabbatarājā bibbohanaṃ [bibbohanaṃ (sī. syā. kaṃ. pī.), bimba + ohanaṃ = iti padavibhāgo] ahosi, puratthime samudde vāmo hattho ohito ahosi, pacchime samudde dakkhiṇo hattho ohito ahosi, dakkhiṇe samudde ubho pādā ohitā ahesuṃ. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ayaṃ paṭhamo mahāsupino pāturahosi. ‘‘Puna caparaṃ, bhikkhave, tathāgatassa arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato tiriyā nāma tiṇajāti nābhiyā uggantvā nabhaṃ āhacca ṭhitā ahosi. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ayaṃ dutiyo mahāsupino pāturahosi. ‘‘Puna caparaṃ, bhikkhave, tathāgatassa arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato setā kimī kaṇhasīsā pādehi ussakkitvā ( ) [(agganakhato) katthaci dissati] yāva jāṇumaṇḍalā paṭicchādesuṃ. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ayaṃ tatiyo mahāsupino pāturahosi. ‘‘Puna caparaṃ, bhikkhave, tathāgatassa arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato cattāro sakuṇā nānāvaṇṇā catūhi disāhi āgantvā pādamūle nipatitvā sabbasetā sampajjiṃsu. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ayaṃ catuttho mahāsupino pāturahosi. ‘‘Puna caparaṃ, bhikkhave, tathāgato arahaṃ sammāsambuddho pubbeva sambodhā anabhisambuddho bodhisattova samāno mahato mīḷhapabbatassa uparūpari caṅkamati alippamāno mīḷhena. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ayaṃ pañcamo mahāsupino pāturahosi. ‘‘Yampi, bhikkhave, tathāgatassa arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ayaṃ mahāpathavī mahāsayanaṃ ahosi, himavā pabbatarājā bibbohanaṃ ahosi, puratthime samudde vāmo hattho ohito ahosi, pacchime samudde dakkhiṇo hattho ohito ahosi, dakkhiṇe samudde ubho pādā ohitā ahesuṃ; tathāgatena, bhikkhave, arahatā sammāsambuddhena anuttarā sammāsambodhi abhisambuddhā. Tassā abhisambodhāya ayaṃ paṭhamo mahāsupino pāturahosi. ‘‘Yampi, bhikkhave, tathāgatassa arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato tiriyā nāma tiṇajāti nābhiyā uggantvā nabhaṃ āhacca ṭhitā ahosi; tathāgatena, bhikkhave, arahatā sammāsambuddhena ariyo aṭṭhaṅgiko maggo abhisambujjhitvā yāva devamanussehi suppakāsito. Tassa abhisambodhāya ayaṃ dutiyo mahāsupino pāturahosi. ‘‘Yampi, bhikkhave, tathāgatassa arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato setā kimī kaṇhasīsā pādehi ussakkitvā yāva jāṇumaṇḍalā paṭicchādesuṃ; bahū, bhikkhave, gihī odātavasanā tathāgataṃ pāṇupetā [pāṇupetaṃ (sī. syā. kaṃ. pī.)] saraṇaṃ gatā. Tassa abhisambodhāya ayaṃ tatiyo mahāsupino pāturahosi. ‘‘Yampi, bhikkhave, tathāgatassa arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato cattāro sakuṇā nānāvaṇṇā catūhi disāhi āgantvā pādamūle nipatitvā sabbasetā sampajjiṃsu; cattārome, bhikkhave, vaṇṇā khattiyā brāhmaṇā vessā suddā te tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā anuttaraṃ vimuttiṃ sacchikaronti. Tassa abhisambodhāya ayaṃ catuttho mahāsupino pāturahosi. ‘‘Yampi, bhikkhave, tathāgato arahaṃ sammāsambuddho pubbeva sambodhā anabhisambuddho bodhisattova samāno mahato mīḷhapabbatassa uparūpari caṅkamati alippamāno mīḷhena; lābhī, bhikkhave, tathāgato cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ, taṃ [tattha ca (sī. syā. kaṃ. pī.)] tathāgato agathito [agadhito (syā. pī. ka.)] amucchito anajjhosanno [anajjhāpanno (ka.) anajjhopanno (sī. syā.)] ādīnavadassāvī nissaraṇapañño paribhuñjati. Tassa abhisambodhāya ayaṃ pañcamo mahāsupino pāturahosi. ‘‘Tathāgatassa, bhikkhave, arahato sammāsambuddhassa pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ime pañca mahāsupinā pāturahesu’’nti. Chaṭṭhaṃ.",
      "english": "Monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, five great dreams appeared to him. Which five? Monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, this great earth became his great bed, the Himālaya, the king of mountains, became his pillow, his left hand was extended into the eastern ocean, his right hand was extended into the western ocean, and both his feet were extended into the southern ocean. Monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, this was the first great dream that appeared to him.\n\nFurthermore, monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, a certain type of grass grew from his navel and stood reaching up to the sky. Monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, this was the second great dream that appeared to him.\n\nFurthermore, monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, white worms with black heads crawled up from his feet and covered him up to his knees. Monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, this was the third great dream that appeared to him.\n\nFurthermore, monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, four birds of various colors came from the four directions, fell at his feet, and all became pure white. Monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, this was the fourth great dream that appeared to him.\n\nFurthermore, monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, he walked back and forth over a great mountain of excrement without being stained by the excrement. Monks, before the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened, while he was still a Bodhisatta, this was the fifth great dream that appeared to him.\n\nMonks, that the Tathagata, the Arahant, the Perfectly Self-Awakened One, before his full awakening, while he was still a Bodhisatta, had this great earth as his great bed, the Himālaya, the king of mountains, as his pillow, his left hand extended into the eastern ocean, his right hand into the western ocean, and both his feet into the southern ocean — this signified that the Tathagata, the Arahant, the Perfectly Self-Awakened One, had fully awakened to the unsurpassed perfect enlightenment. For the sake of that awakening, this first great dream appeared to him.\n\nMonks, that the Tathagata, the Arahant, the Perfectly Self-Awakened One, before his full awakening, while he was still a Bodhisatta, had a certain type of grass grow from his navel and stand reaching up to the sky — this signified that the Tathagata, the Arahant, the Perfectly Self-Awakened One, having fully awakened to the Noble Eightfold Path, had proclaimed it well to devas and humans alike. For the sake of that awakening, this second great dream appeared to him.\n\nMonks, that the Tathagata, the Arahant, the Perfectly Self-Awakened One, before his full awakening, while he was still a Bodhisatta, had white worms with black heads crawl up from his feet and cover him up to his knees — this signified that many white-clad householders have gone for refuge to the Tathagata for life. For the sake of that awakening, this third great dream appeared to him.\n\nMonks, that the Tathagata, the Arahant, the Perfectly Self-Awakened One, before his full awakening, while he was still a Bodhisatta, had four birds of various colors come from the four directions, fall at his feet, and all become pure white — this signified that these four castes, khattiyas, brahmins, vessas, and suddas, having gone forth from the household life into homelessness in the Dhamma and Discipline proclaimed by the Tathagata, will realize unsurpassed liberation. For the sake of that awakening, this fourth great dream appeared to him.\n\nMonks, that the Tathagata, the Arahant, the Perfectly Self-Awakened One, before his full awakening, while he was still a Bodhisatta, walked back and forth over a great mountain of excrement without being stained by the excrement — this signified that the Tathagata receives robes, almsfood, lodgings, and medicines for the sick, and in these things, the Tathagata remains unattached and ungreedy.\n\nHe experiences things uninfatuated and unabsorbed, seeing their inherent danger, and possessing the wisdom of liberation. This fifth great dream appeared to him for his perfect awakening. \"Monks, these five great dreams appeared to the Tathāgata, the Arahant, the Fully Self-Enlightened One, when he was still a Bodhisattva and not yet fully enlightened, before his perfect awakening.\" The Sixth.",
      "sinhala": "මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මහා සිහින පහක් පහළ විය. ඒ පහ කවරේද?\n\nමහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මේ මහා පෘථිවිය මහා සැතපෙන යහන විය. හිමාලය පර්වත රාජයා කොට්ටය විය. නැගෙනහිර මහා සාගරයේ වම් අත තබා තිබුණි, බස්නාහිර මහා සාගරයේ දකුණු අත තබා තිබුණි, දකුණු මහා සාගරයේ දෙපා තබා තිබුණි. මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මේ පළමු මහා සිහිනය පහළ විය.\n\nනැවතත් මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, තිරියා නම් තෘණ වර්ගයක් නාභියෙන් ඉහළට නැඟී අහස දක්වා විහිදී තිබුණි. මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මේ දෙවැනි මහා සිහිනය පහළ විය.\n\nනැවතත් මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, කළු හිස් ඇති සුදු පණුවෝ දෙපාවලින් ඉහළට නැඟී දණහිස් දක්වා ශරීරය වසා සිටියහ. මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මේ තෙවැනි මහා සිහිනය පහළ විය.\n\nනැවතත් මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, සිව් දිශාවන්ගෙන් විවිධ වර්ණවල කුරුල්ලෝ සතර දෙනෙක් පැමිණ පාමුල වැටී සියල්ලෝම සුදු පැහැයට හැරුණහ. මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මේ සතරවැනි මහා සිහිනය පහළ විය.\n\nනැවතත් මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, අසූචි කන්දක් මතින් සක්මන් කළේ අසූචියෙන් නොතැවරී ය. මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මේ පස්වැනි මහා සිහිනය පහළ විය.\n\nමහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, මේ මහා පෘථිවිය මහා සැතපෙන යහන වූයේද, හිමාලය පර්වත රාජයා කොට්ටය වූයේද, නැගෙනහිර මහා සාගරයේ වම් අත තබා තිබුණේද, බස්නාහිර මහා සාගරයේ දකුණු අත තබා තිබුණේද, දකුණු මහා සාගරයේ දෙපා තබා තිබුණේද, එසේ වූයේ මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේ අනුත්තර සම්මාසම්බෝධිය අවබෝධ කළ බැවිනි. එම සම්බෝධිය අවබෝධ වීම පිණිස මේ පළමු මහා සිහිනය පහළ විය.\n\nමහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, තිරියා නම් තෘණ වර්ගයක් නාභියෙන් ඉහළට නැඟී අහස දක්වා විහිදී තිබුණේද, එසේ වූයේ මහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේ ආර්ය අෂ්ටාංගික මාර්ගය අවබෝධ කරගෙන, දෙවි මිනිසුන් අතර මැනවින් ප්‍රකාශ කළ බැවිනි. එම අවබෝධය පිණිස මේ දෙවැනි මහා සිහිනය පහළ විය.\n\nමහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, කළු හිස් ඇති සුදු පණුවෝ දෙපාවලින් ඉහළට නැඟී දණහිස් දක්වා ශරීරය වසා සිටියේද, එසේ වූයේ මහණෙනි, බොහෝ සුදු වස්ත්‍රධාරී ගිහි පිරිස් තථාගතයන් වහන්සේ ජීවිතාන්තය දක්වා සරණ ගිය බැවිනි. එම කාර්යය සම්පූර්ණ වීම පිණිස මේ තෙවැනි මහා සිහිනය පහළ විය.\n\nමහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, සිව් දිශාවන්ගෙන් විවිධ වර්ණවල කුරුල්ලෝ සතර දෙනෙක් පැමිණ පාමුල වැටී සියල්ලෝම සුදු පැහැයට හැරුණේද, එසේ වූයේ මහණෙනි, මේ ක්ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශුද්‍ර යන සතර වර්ණවල පුද්ගලයෝ තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනයෙහි ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වී අනුත්තර විමුක්තිය සාක්ෂාත් කරන බැවිනි. එම සාක්ෂාත් කිරීම පිණිස මේ සතරවැනි මහා සිහිනය පහළ විය.\n\nමහණෙනි, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට සම්බෝධියට පෙර, තවමත් සම්බුද්ධත්වය අවබෝධ නොකළ බෝධිසත්වයකු ලෙස සිටියදී, අසූචි කන්දක් මතින් සක්මන් කළේ අසූචියෙන් නොතැවරී යේද, එසේ වූයේ මහණෙනි, තථාගතයන් වහන්සේ සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස, බෙහෙත්, පිරිකරාදී දේ ලබන්නකු වන නමුත්, උන්වහන්සේ ඒවාට නොඇලෙයි.\n\nකිසිදු මෝහයකින් මුසපත් නොවී, කිසිවකට දැඩිව නොඇලී, ආදීනව දකින සුළු වූ, නිස්සරණ ප‍්‍රඥාවෙන් යුක්තව පරිභෝග කරන්නේය. ඔහුගේ අභිසම්බෝධය පිණිස මේ පස්වෙනි මහා සිහිනය පහළ විය. ‘‘මහණෙනි, රහත් වූ සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේට බුද්ධත්වයට පත්වීමට පෙර, තවමත් අභිසම්බෝධය නොලද බෝධිසත්ත්වයන් වහන්සේව සිටියදී, මේ මහා සිහින පහ පහළ විය’’ යනුවෙන්. සයවන කොටස.",
      "paliTitle": "Mahāsupinasuttaṃ",
      "englishTitle": "The Great Dreams Sutta",
      "sinhalaTitle": "මහාසුපින සූත්‍රය"
    },
    {
      "number": 197,
      "pali": "‘‘Pañcime, bhikkhave, vassassa antarāyā, yaṃ nemittā [nemittakā (katthaci)] na jānanti, yattha nemittānaṃ cakkhu na kamati. Katame pañca? Upari, bhikkhave, ākāse tejodhātu pakuppati. Tena uppannā meghā paṭivigacchanti. Ayaṃ, bhikkhave, paṭhamo vassassa antarāyo, yaṃ nemittā na jānanti, yattha nemittānaṃ cakkhu na kamati. ‘‘Puna caparaṃ, bhikkhave, upari ākāse vāyodhātu pakuppati. Tena uppannā meghā paṭivigacchanti. Ayaṃ, bhikkhave, dutiyo vassassa antarāyo, yaṃ nemittā na jānanti, yattha nemittānaṃ cakkhu na kamati. ‘‘Puna caparaṃ, bhikkhave, rāhu asurindo pāṇinā udakaṃ sampaṭicchitvā mahāsamudde chaḍḍeti. Ayaṃ, bhikkhave, tatiyo vassassa antarāyo, yaṃ nemittā na jānanti, yattha nemittānaṃ cakkhu na kamati. ‘‘Puna caparaṃ, bhikkhave, vassavalāhakā devā pamattā honti. Ayaṃ, bhikkhave, catuttho vassassa antarāyo, yaṃ nemittā na jānanti, yattha nemittānaṃ cakkhu na kamati. ‘‘Puna caparaṃ, bhikkhave, manussā adhammikā honti. Ayaṃ, bhikkhave, pañcamo vassassa antarāyo, yaṃ nemittā na jānanti, yattha nemittānaṃ cakkhu na kamati. Ime kho, bhikkhave, pañca vassassa antarāyā, yaṃ nemittā na jānanti, yattha nemittānaṃ cakkhu na kamatī’’ti. Sattamaṃ.",
      "english": "Monks, there are these five obstacles to rain that prognosticators do not know, and where the eye of prognosticators does not reach. Which five?\n\nMonks, up in the sky, the fire element becomes agitated. Because of that, the arisen clouds disperse. This, monks, is the first obstacle to rain that prognosticators do not know, and where the eye of prognosticators does not reach.\n\nFurthermore, monks, up in the sky, the wind element becomes agitated. Because of that, the arisen clouds disperse. This, monks, is the second obstacle to rain that prognosticators do not know, and where the eye of prognosticators does not reach.\n\nFurthermore, monks, Rahu, the king of the asuras, catches the water with his hand and throws it into the great ocean. This, monks, is the third obstacle to rain that prognosticators do not know, and where the eye of prognosticators does not reach.\n\nFurthermore, monks, the devas of the rain clouds become negligent. This, monks, is the fourth obstacle to rain that prognosticators do not know, and where the eye of prognosticators does not reach.\n\nFurthermore, monks, human beings become unrighteous. This, monks, is the fifth obstacle to rain that prognosticators do not know, and where the eye of prognosticators does not reach.\n\nThese, monks, are the five obstacles to rain that prognosticators do not know, and where the eye of prognosticators does not reach.",
      "sinhala": "මහණෙනි, වැස්සට මේ අන්තරායෝ පස්දෙනෙක් වෙති. මේවා නිමිති කියන්නෝ නොදනිති, ඔවුන්ගේ ඇසට මේවා අරමුණු නොවේ. ඒ පස්දෙනා කවරහුද?\n\nමහණෙනි, අහසෙහි උඩ තේජෝධාතුව කුපිත වේ. ඒ නිසා ඇතිවන වලාකුළු විසුරුවා හරිනු ලැබේ. මහණෙනි, මෙය වැස්සට ඇති පළමු වන අන්තරායයි. මෙය නිමිති කියන්නෝ නොදනිති, ඔවුන්ගේ ඇසට මෙය අරමුණු නොවේ.\n\nනැවතත් මහණෙනි, අහසෙහි උඩ වායෝධාතුව කුපිත වේ. ඒ නිසා ඇතිවන වලාකුළු විසුරුවා හරිනු ලැබේ. මහණෙනි, මෙය වැස්සට ඇති දෙවෙනි අන්තරායයි. මෙය නිමිති කියන්නෝ නොදනිති, ඔවුන්ගේ ඇසට මෙය අරමුණු නොවේ.\n\nනැවතත් මහණෙනි, රාහු නම් අසුරේන්ද්‍රයා අතින් වතුර ගෙන මහා සාගරයට දමයි. මහණෙනි, මෙය වැස්සට ඇති තුන්වෙනි අන්තරායයි. මෙය නිමිති කියන්නෝ නොදනිති, ඔවුන්ගේ ඇසට මෙය අරමුණු නොවේ.\n\nනැවතත් මහණෙනි, වැහි වලාකුළු දෙවියෝ ප‍්‍රමාද වෙති. මහණෙනි, මෙය වැස්සට ඇති සිව්වෙනි අන්තරායයි. මෙය නිමිති කියන්නෝ නොදනිති, ඔවුන්ගේ ඇසට මෙය අරමුණු නොවේ.\n\nනැවතත් මහණෙනි, මනුෂ්‍ය‍යෝ අධර්මිෂ්ඨ වෙති. මහණෙනි, මෙය වැස්සට ඇති පස්වෙනි අන්තරායයි. මෙය නිමිති කියන්නෝ නොදනිති, ඔවුන්ගේ ඇසට මෙය අරමුණු නොවේ.\n\nමහණෙනි, මේවා වැස්සට ඇති අන්තරායෝ පස්දෙනෙකි. මේවා නිමිති කියන්නෝ නොදනිති, ඔවුන්ගේ ඇසට මේවා අරමුණු නොවේ.",
      "paliTitle": "Vassasuttaṃ",
      "englishTitle": "The Discourse on Rain",
      "sinhalaTitle": "වස්ස සූත්‍රය"
    },
    {
      "number": 198,
      "pali": "‘‘Pañcahi, bhikkhave, aṅgehi samannāgatā vācā subhāsitā hoti, no dubbhāsitā, anavajjā ca ananuvajjā ca viññūnaṃ [ananuvajjā viññūnaṃ (syā. kaṃ.)]. Katamehi pañcahi? Kālena ca bhāsitā hoti, saccā ca bhāsitā hoti, saṇhā ca bhāsitā hoti, atthasaṃhitā ca bhāsitā hoti, mettacittena ca bhāsitā hoti. Imehi kho, bhikkhave, pañcahi aṅgehi samannāgatā vācā subhāsitā hoti, no dubbhāsitā, anavajjā ca ananuvajjā ca viññūna’’nti. Aṭṭhamaṃ.",
      "english": "Monks, speech that is endowed with five qualities is well-spoken, not ill-spoken, and it is blameless and beyond reproach by the discerning. Which five? It is spoken at the proper time; it is spoken truthfully; it is spoken gently; it is spoken constructively; and it is spoken with a mind of loving-kindness. Monks, speech that is endowed with these five qualities is well-spoken, not ill-spoken, and it is blameless and beyond reproach by the discerning.",
      "sinhala": "මහණෙනි, කරුණු පසකින් සමන්විත වූ වචනය සුභාෂිත වෙයි, දුර්භාෂිත නොවෙයි. (එය) නිර්දෝෂී ද වෙයි, නුවණැත්තන්ට දොස් පැවරිය නොහැකි ද වෙයි. කවර පසකින් ද? නියම වේලාවට කථා කරන ලද්දක් ද වෙයි, සත්‍ය වූ දෙයක් ද කථා කරන ලද්දක් වෙයි, මෘදු වචනයකින් ද කථා කරන ලද්දක් වෙයි, අර්ථයෙන් යුක්ත වූ දෙයක් ද කථා කරන ලද්දක් වෙයි, මෛත‍්‍රී​චිත්තයෙන් ද කථා කරන ලද්දක් වෙයි. මහණෙනි, මේ කරුණු පසින් සමන්විත වූ වචනය සුභාෂිත වෙයි, දුර්භාෂිත නොවෙයි. (එය) නිර්දෝෂී ද වෙයි, නුවණැත්තන්ට දොස් පැවරිය නොහැකි ද වෙයි.",
      "paliTitle": "Vācāsuttaṃ",
      "englishTitle": "The Discourse on Speech",
      "sinhalaTitle": "වාචා සූත්‍රය"
    },
    {
      "number": 199,
      "pali": "‘‘Yaṃ, bhikkhave, sīlavanto pabbajitā kulaṃ upasaṅkamanti, tattha manussā pañcahi ṭhānehi bahuṃ puññaṃ pasavanti. Katamehi pañcahi? Yasmiṃ, bhikkhave, samaye sīlavante pabbajite kulaṃ upasaṅkamante manussā disvā cittāni pasādenti [pasīdanti (syā. kaṃ. ka.)], saggasaṃvattanikaṃ, bhikkhave, taṃ kulaṃ tasmiṃ samaye paṭipadaṃ paṭipannaṃ hoti. ‘‘Yasmiṃ, bhikkhave, samaye sīlavante pabbajite kulaṃ upasaṅkamante manussā paccuṭṭhenti abhivādenti āsanaṃ denti, uccākulīnasaṃvattanikaṃ, bhikkhave, taṃ kulaṃ tasmiṃ samaye paṭipadaṃ paṭipannaṃ hoti. ‘‘Yasmiṃ, bhikkhave, samaye sīlavante pabbajite kulaṃ upasaṅkamante manussā maccheramalaṃ paṭivinenti [paṭivinodenti (sī. pī.)], mahesakkhasaṃvattanikaṃ, bhikkhave, taṃ kulaṃ tasmiṃ samaye paṭipadaṃ paṭipannaṃ hoti. ‘‘Yasmiṃ, bhikkhave, samaye sīlavante pabbajite kulaṃ upasaṅkamante manussā yathāsatti yathābalaṃ saṃvibhajanti, mahābhogasaṃvattanikaṃ, bhikkhave, taṃ kulaṃ tasmiṃ samaye paṭipadaṃ paṭipannaṃ hoti. ‘‘Yasmiṃ, bhikkhave, samaye sīlavante pabbajite kulaṃ upasaṅkamante manussā paripucchanti paripañhanti dhammaṃ suṇanti, mahāpaññāsaṃvattanikaṃ, bhikkhave, taṃ kulaṃ tasmiṃ samaye paṭipadaṃ paṭipannaṃ hoti. Yaṃ, bhikkhave, sīlavanto pabbajitā kulaṃ upasaṅkamanti, tattha manussā imehi pañcahi ṭhānehi bahuṃ puññaṃ pasavantī’’ti. Navamaṃ.",
      "english": "Monastics, when virtuous monastics visit a family, the people there generate much merit in five ways. What are these five?\n\nMonastics, when people see virtuous monastics visiting their family and develop serene confidence in their minds, that family, at that time, has entered upon a practice conducive to rebirth in a heavenly realm.\n\nMonastics, when people rise to greet, pay homage to, and offer a seat to virtuous monastics visiting their family, that family, at that time, has entered upon a practice conducive to rebirth in a high family.\n\nMonastics, when people remove the stain of stinginess when virtuous monastics visit their family, that family, at that time, has entered upon a practice conducive to great influence.\n\nMonastics, when people share according to their ability and strength when virtuous monastics visit their family, that family, at that time, has entered upon a practice conducive to great wealth.\n\nMonastics, when people question, inquire, and listen to the Dhamma when virtuous monastics visit their family, that family, at that time, has entered upon a practice conducive to great wisdom.\n\nMonastics, when virtuous monastics visit a family, the people there generate much merit in these five ways.",
      "sinhala": "මහණෙනි, යම් කුලකට සිල්වත් පැවිද්දෝ සමීප වෙත්ද, එහි මනුෂ්‍යයෝ කරුණු පසකින් බොහෝ පින් රැස් කර ගනිති.\n\nඒ කවර කරුණු පසකින්ද? මහණෙනි, යම් සමයෙක සිල්වත් පැවිද්දන් කුලකට සමීප වන කල්හි මනුෂ්‍යයෝ ඔවුන් දැක සිත පහදවා ගනිත්ද, මහණෙනි, ඒ කුලය ඒ සමයෙහි දෙව්ලොවට පැමිණවීම පිණිස පවතින ප්‍රතිපදාවක් පිළිපදින ලද්දක් වෙයි. මහණෙනි, යම් සමයෙක සිල්වත් පැවිද්දන් කුලකට සමීප වන කල්හි මනුෂ්‍යයෝ නැගිට පිළිගනිත්ද, වන්දනා කරත්ද, අසුන් පනවද්ද, මහණෙනි, ඒ කුලය ඒ සමයෙහි උසස් කුලයක ඉපදීම පිණිස පවතින ප්‍රතිපදාවක් පිළිපදින ලද්දක් වෙයි. මහණෙනි, යම් සමයෙක සිල්වත් පැවිද්දන් කුලකට සමීප වන කල්හි මනුෂ්‍යයෝ මසුරුමලය දුරු කරත්ද, මහණෙනි, ඒ කුලය ඒ සමයෙහි මහානුභාව සම්පන්න බව පිණිස පවතින ප්‍රතිපදාවක් පිළිපදින ලද්දක් වෙයි. මහණෙනි, යම් සමයෙක සිල්වත් පැවිද්දන් කුලකට සමීප වන කල්හි මනුෂ්‍යයෝ තම ශක්ති ප්‍රමාණයට, තම බල ප්‍රමාණයට බෙදා දෙත්ද, මහණෙනි, ඒ කුලය ඒ සමයෙහි මහත් භෝග සම්පත් පිණිස පවතින ප්‍රතිපදාවක් පිළිපදින ලද්දක් වෙයි. මහණෙනි, යම් සමයෙක සිල්වත් පැවිද්දන් කුලකට සමීප වන කල්හි මනුෂ්‍යයෝ කරුණු විචාරත්ද, ගැඹුරින් ප්‍රශ්න කරත්ද, ධර්මය ශ්‍රවණය කරත්ද, මහණෙනි, ඒ කුලය ඒ සමයෙහි මහා ප්‍රඥාව පිණිස පවතින ප්‍රතිපදාවක් පිළිපදින ලද්දක් වෙයි.\n\nමහණෙනි, යම් කුලකට සිල්වත් පැවිද්දෝ සමීප වෙත්ද, එහි මනුෂ්‍යයෝ මේ කරුණු පසින් බොහෝ පින් රැස් කර ගනිති.",
      "paliTitle": "Kulasuttaṃ",
      "englishTitle": "The Discourse on Families",
      "sinhalaTitle": "කුල සූත්‍රය"
    },
    {
      "number": 200,
      "pali": "‘‘Pañcimā, bhikkhave, nissāraṇīyā [nissaraṇīyā (pī.), nissaraṇiyā (dī. ni. 3.321)] dhātuyo. Katamā pañca? Idha, bhikkhave, bhikkhuno kāmaṃ [kāme (syā. kaṃ.) dī. ni. 3.321] manasikaroto kāmesu cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Nekkhammaṃ kho panassa manasikaroto nekkhamme cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ [sukataṃ (pī. ka.)] subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ suvisaṃyuttaṃ [visaṃyuttaṃ (katthaci, dī. ni. 3.321)] kāmehi; ye ca kāmapaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṃ vedanaṃ vediyati. Idamakkhātaṃ kāmānaṃ nissaraṇaṃ. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno byāpādaṃ manasikaroto byāpāde cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Abyāpādaṃ kho panassa manasikaroto abyāpāde cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ suvisaṃyuttaṃ byāpādena; ye ca byāpādapaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṃ vedanaṃ vediyati. Idamakkhātaṃ byāpādassa nissaraṇaṃ. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno vihesaṃ manasikaroto vihesāya cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Avihesaṃ kho panassa manasikaroto avihesāya cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ suvisaṃyuttaṃ vihesāya; ye ca vihesāpaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṃ vedanaṃ vediyati. Idamakkhātaṃ vihesāya nissaraṇaṃ. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno rūpaṃ manasikaroto rūpe cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Arūpaṃ kho panassa manasikaroto arūpe cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ suvisaṃyuttaṃ rūpehi; ye ca rūpapaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṃ vedanaṃ vediyati. Idamakkhātaṃ rūpānaṃ nissaraṇaṃ. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno sakkāyaṃ manasikaroto sakkāye cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati. Sakkāyanirodhaṃ kho panassa manasikaroto sakkāyanirodhe cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ suvisaṃyuttaṃ sakkāyena; ye ca sakkāyapaccayā uppajjanti āsavā vighātapariḷāhā, mutto so tehi, na so taṃ vedanaṃ vediyati. Idamakkhātaṃ sakkāyassa nissaraṇaṃ. ‘‘Tassa kāmanandīpi nānuseti, byāpādanandīpi nānuseti, vihesānandīpi nānuseti, rūpanandīpi nānuseti, sakkāyanandīpi nānuseti (so) [( ) katthaci natthi] kāmanandiyāpi ananusayā, byāpādanandiyāpi ananusayā, vihesānandiyāpi ananusayā, rūpanandiyāpi ananusayā, sakkāyanandiyāpi ananusayā. Ayaṃ vuccati, bhikkhave, bhikkhu niranusayo, acchecchi [acchejji (syā. kaṃ. ka.)] taṇhaṃ, vivattayi [vāvattayi (sī.)] saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassa. Imā kho, bhikkhave, pañca nissāraṇīyā dhātuyo’’ti. Dasamaṃ. ",
      "english": "Monks, these are five elements for release. Which five? Here, Monks, when a bhikkhu attends to sensual desires, his mind does not incline towards sensual desires, does not become confident in them, does not settle in them, and is not liberated by them. But when he attends to renunciation, his mind inclines towards renunciation, becomes confident in it, settles in it, and is liberated by it. That mind of his is well-directed, well-developed, well-established, well-liberated, and well-disjoined from sensual desires; and he is released from the defilements, distress, and feverish anxieties that arise conditioned by sensual desires; he does not experience that feeling. This is declared as the release from sensual desires.\n\nAgain, Monks, when a bhikkhu attends to ill-will, his mind does not incline towards ill-will, does not become confident in it, does not settle in it, and is not liberated by it. But when he attends to non-ill-will, his mind inclines towards non-ill-will, becomes confident in it, settles in it, and is liberated by it. That mind of his is well-directed, well-developed, well-established, well-liberated, and well-disjoined from ill-will; and he is released from the defilements, distress, and feverish anxieties that arise conditioned by ill-will; he does not experience that feeling. This is declared as the release from ill-will.\n\nAgain, Monks, when a bhikkhu attends to harmfulness, his mind does not incline towards harmfulness, does not become confident in it, does not settle in it, and is not liberated by it. But when he attends to non-harmfulness, his mind inclines towards non-harmfulness, becomes confident in it, settles in it, and is liberated by it. That mind of his is well-directed, well-developed, well-established, well-liberated, and well-disjoined from harmfulness; and he is released from the defilements, distress, and feverish anxieties that arise conditioned by harmfulness; he does not experience that feeling. This is declared as the release from harmfulness.\n\nAgain, Monks, when a bhikkhu attends to form, his mind does not incline towards form, does not become confident in it, does not settle in it, and is not liberated by it. But when he attends to the formless, his mind inclines towards the formless, becomes confident in it, settles in it, and is liberated by it. That mind of his is well-directed, well-developed, well-established, well-liberated, and well-disjoined from form; and he is released from the defilements, distress, and feverish anxieties that arise conditioned by form; he does not experience that feeling. This is declared as the release from form.\n\nAgain, Monks, when a bhikkhu attends to identity-view, his mind does not incline towards identity-view, does not become confident in it, does not settle in it, and is not liberated by it. But when he attends to the cessation of identity-view, his mind inclines towards the cessation of identity-view, becomes confident in it, settles in it, and is liberated by it. That mind of his is well-directed, well-developed, well-established, well-liberated, and well-disjoined from identity-view; and he is released from the defilements, distress, and feverish anxieties that arise conditioned by identity-view; he does not experience that feeling. This is declared as the release from identity-view.\n\nFor him, the underlying tendency for delight in sensual pleasures does not lie dormant, the underlying tendency for delight in ill-will does not lie dormant, the underlying tendency for delight in harmfulness does not lie dormant, the underlying tendency for delight in form does not lie dormant, and the underlying tendency for delight in identity-view does not lie dormant. Being free from the underlying tendency for delight in sensual pleasures, free from the underlying tendency for delight in ill-will, free from the underlying tendency for delight in harmfulness, free from the underlying tendency for delight in form, and free from the underlying tendency for delight in identity-view—this bhikkhu, Monks, is called one without underlying tendencies. He has cut off craving, unraveled the fetters, and by rightly comprehending conceit, has made an end of suffering. These, Monks, are the five elements for release.",
      "sinhala": "මහණෙනි, නිස්සරණීය (මිදීමට හේතුවන) ධාතු පහක් ඇත. ඒ කවරේද?\n\nමහණෙනි, යම් භික්ෂුවක් කාමයන් මෙනෙහි කරන විට ඔහුගේ සිත කාමයන්ට නොවැදේ, නොපැහැදේ, නොපිහිටයි, නොමිදේ. නමුත් ඔහු නෙක්ඛම්මය (කම් සැපයෙන් වෙන්වීම) මෙනෙහි කරන විට ඔහුගේ සිත නෙක්ඛම්මයට වැදේ, පැහැදේ, පිහිටයි, මිදේ. ඔහුගේ ඒ සිත කාමයන්ගෙන් යහපත් ගමනකට යොමු වූ, මනාව වර්ධනය කළ, මනාව පුහුණු කළ, මනාව මිදුණු, මනාව වෙන් වූ එකක් වෙයි; කාමයන් හේතුවෙන් උපදින ආසව (කෙලෙස්), විඝාත (පීඩා), පරිළාහ (කෙලෙස් ගිනි) යන මේවායින් ඔහු මිදේ. ඔහු ඒ වේදනාව නොවිඳියි. මෙය කාමයන්ගේ නිස්සරණය ලෙස කියනු ලැබේ.\n\nතවද මහණෙනි, යම් භික්ෂුවක් ව්‍යාපාදය (ද්වේෂය) මෙනෙහි කරන විට ඔහුගේ සිත ව්‍යාපාදයට නොවැදේ, නොපැහැදේ, නොපිහිටයි, නොමිදේ. නමුත් ඔහු අව්‍යාපාදය (ද්වේෂ නොකිරීම) මෙනෙහි කරන විට ඔහුගේ සිත අව්‍යාපාදයට වැදේ, පැහැදේ, පිහිටයි, මිදේ. ඔහුගේ ඒ සිත ව්‍යාපාදයෙන් යහපත් ගමනකට යොමු වූ, මනාව වර්ධනය කළ, මනාව පුහුණු කළ, මනාව මිදුණු, මනාව වෙන් වූ එකක් වෙයි; ව්‍යාපාදය හේතුවෙන් උපදින ආසව, විඝාත, පරිළාහ යන මේවායින් ඔහු මිදේ. ඔහු ඒ වේදනාව නොවිඳියි. මෙය ව්‍යාපාදයේ නිස්සරණය ලෙස කියනු ලැබේ.\n\nතවද මහණෙනි, යම් භික්ෂුවක් විහංසාව (හිංසනය) මෙනෙහි කරන විට ඔහුගේ සිත විහංසාවට නොවැදේ, නොපැහැදේ, නොපිහිටයි, නොමිදේ. නමුත් ඔහු අවිහංසාව (අහිංසාව) මෙනෙහි කරන විට ඔහුගේ සිත අවිහංසාවට වැදේ, පැහැදේ, පිහිටයි, මිදේ. ඔහුගේ ඒ සිත විහංසාවෙන් යහපත් ගමනකට යොමු වූ, මනාව වර්ධනය කළ, මනාව පුහුණු කළ, මනාව මිදුණු, මනාව වෙන් වූ එකක් වෙයි; විහංසාව හේතුවෙන් උපදින ආසව, විඝාත, පරිළාහ යන මේවායින් ඔහු මිදේ. ඔහු ඒ වේදනාව නොවිඳියි. මෙය විහංසාවේ නිස්සරණය ලෙස කියනු ලැබේ.\n\nතවද මහණෙනි, යම් භික්ෂුවක් රූපය (භෞතික රූපය) මෙනෙහි කරන විට ඔහුගේ සිත රූපයට නොවැදේ, නොපැහැදේ, නොපිහිටයි, නොමිදේ. නමුත් ඔහු අරූපය (අරූපාවචර ධ්‍යාන) මෙනෙහි කරන විට ඔහුගේ සිත අරූපයට වැදේ, පැහැදේ, පිහිටයි, මිදේ. ඔහුගේ ඒ සිත රූපයන්ගෙන් යහපත් ගමනකට යොමු වූ, මනාව වර්ධනය කළ, මනාව පුහුණු කළ, මනාව මිදුණු, මනාව වෙන් වූ එකක් වෙයි; රූපයන් හේතුවෙන් උපදින ආසව, විඝාත, පරිළාහ යන මේවායින් ඔහු මිදේ. ඔහු ඒ වේදනාව නොවිඳියි. මෙය රූපයන්ගේ නිස්සරණය ලෙස කියනු ලැබේ.\n\nතවද මහණෙනි, යම් භික්ෂුවක් සක්කාය (සත්කාය දෘෂ්ටිය) මෙනෙහි කරන විට ඔහුගේ සිත සක්කායට නොවැදේ, නොපැහැදේ, නොපිහිටයි, නොමිදේ. නමුත් ඔහු සක්කාය නිරෝධය (සත්කාය දෘෂ්ටියේ නිරෝධය) මෙනෙහි කරන විට ඔහුගේ සිත සක්කාය නිරෝධයට වැදේ, පැහැදේ, පිහිටයි, මිදේ. ඔහුගේ ඒ සිත සක්කායෙන් යහපත් ගමනකට යොමු වූ, මනාව වර්ධනය කළ, මනාව පුහුණු කළ, මනාව මිදුණු, මනාව වෙන් වූ එකක් වෙයි; සක්කාය හේතුවෙන් උපදින ආසව, විඝාත, පරිළාහ යන මේවායින් ඔහු මිදේ. ඔහු ඒ වේදනාව නොවිඳියි. මෙය සක්කායේ නිස්සරණය ලෙස කියනු ලැබේ.\n\nඔහුට කාමයන් කෙරෙහි ඇල්ම අනුශය නොවෙයි. ව්‍යාපාදය කෙරෙහි ඇල්මද අනුශය නොවෙයි. විහංසාව කෙරෙහි ඇල්මද අනුශය නොවෙයි. රූපය කෙරෙහි ඇල්මද අනුශය නොවෙයි. සක්කාය කෙරෙහි ඇල්මද අනුශය නොවෙයි. කාමයන් කෙරෙහි ඇල්ම, ව්‍යාපාදය කෙරෙහි ඇල්ම, විහංසාව කෙරෙහි ඇල්ම, රූපය කෙරෙහි ඇල්ම, සක්කාය කෙරෙහි ඇල්ම යන මේවා අනුශය වශයෙන් ඔහු තුළ නැති වෙයි. මහණෙනි, මෙවැනි භික්ෂුවක් නිරනුශය (අනුශය රහිත) භික්ෂුවක් ලෙස කියනු ලැබේ. ඔහු තෘෂ්ණාව සිඳලීය, සංයෝජන දුරලීය, මානය නිවැරදිව ප්‍රත්‍යක්ෂ කිරීමෙන් දුකට කෙළවරක් කළේය. මහණෙනි, මේවා නිස්සරණීය ධාතු පහයි.",
      "paliTitle": "Nissāraṇīyasuttaṃ",
      "englishTitle": "Leading to Deliverance Sutta",
      "sinhalaTitle": "නිස්සාරණීය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Brāhmaṇavaggo pañcamo. Tassuddānaṃ – Soṇo doṇo saṅgāravo, kāraṇapālī ca piṅgiyānī; Supinā ca vassā vācā, kulaṃ nissāraṇīyena cāti. Catutthaṃpaṇṇāsakaṃ samatto.",
    "english": "The Chapter on Brahmins is the fifth. The summary of it: Soṇa, Doṇa, Saṅgārava, Kāraṇapālī, and Piṅgiyānī; Dreams, Rains, Speech, Family, and with Deliverance. The Fourth Fifty is complete.",
    "sinhala": "පස්වන බ්‍රාහ්මණ වර්ගයයි. එහි උද්දානය නම්: සෝණ, දෝණ, සංගාරව, කාරණපාලී, පිංගියානී, සුපින, වස්ස, වාචා, කුල සහ නිස්සාරණීය සූත්‍රයි. සිව්වන පණ්ණාසකය සමාප්තයි."
  }
}