{
  "id": "an5.3",
  "title": {
    "pali": "Pañcaṅgikavaggo",
    "english": "The Chapter of Five Factors",
    "sinhala": "පඤ්චාංගික වර්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "‘‘So vata, bhikkhave, bhikkhu agāravo appatisso asabhāgavuttiko ‘sabrahmacārīsu ābhisamācārikaṃ dhammaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Ābhisamācārikaṃ dhammaṃ aparipūretvā sekhaṃ [sekkhaṃ (ka.)] dhammaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sekhaṃ dhammaṃ aparipūretvā sīlāni paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sīlāni aparipūretvā sammādiṭṭhiṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sammādiṭṭhiṃ aparipūretvā sammāsamādhiṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vata, bhikkhave, bhikkhu sagāravo sappatisso sabhāgavuttiko ‘sabrahmacārīsu ābhisamācārikaṃ dhammaṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Ābhisamācārikaṃ dhammaṃ paripūretvā sekhaṃ dhammaṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Sekhaṃ dhammaṃ paripūretvā sīlāni paripūressatī’ti ṭhānametaṃ vijjati. ‘Sīlāni paripūretvā sammādiṭṭhiṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Sammādiṭṭhiṃ paripūretvā sammāsamādhiṃ paripūressatī’ti ṭhānametaṃ vijjatī’’ti. Paṭhamaṃ.",
      "english": "Indeed, monks, for a monk who is disrespectful, irreverent, and unharmonious in conduct, it is not possible that he will fulfill the duties of respectful conduct towards his fellow monastics. Without fulfilling the duties of respectful conduct, it is not possible that he will fulfill the training principles. Without fulfilling the training principles, it is not possible that he will fulfill the moral precepts. Without fulfilling the moral precepts, it is not possible that he will fulfill right view. Without fulfilling right view, it is not possible that he will fulfill right concentration.\n\nIndeed, monks, for a monk who is respectful, reverent, and harmonious in conduct, it is possible that he will fulfill the duties of respectful conduct towards his fellow monastics. Having fulfilled the duties of respectful conduct, it is possible that he will fulfill the training principles. Having fulfilled the training principles, it is possible that he will fulfill the moral precepts. Having fulfilled the moral precepts, it is possible that he will fulfill right view. Having fulfilled right view, it is possible that he will fulfill right concentration.",
      "sinhala": "මහණෙනි, ගෞරව නැති, ප්‍රතිපත්තිගරුක නොවන, සබ්‍රහ්මචාරීන් සමඟ සමගිව නොහැසිරෙන භික්‍ෂුවක් සබ්‍රහ්මචාරීන් කෙරෙහි ආභිසමාචාරික ධර්මය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය නොහැකි කරුණකි. ආභිසමාචාරික ධර්මය සම්පූර්ණ නොකර ශෛක්‍ෂ ධර්මය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය නොහැකි කරුණකි. ශෛක්‍ෂ ධර්මය සම්පූර්ණ නොකර සීලයන් සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය නොහැකි කරුණකි. සීලයන් සම්පූර්ණ නොකර සම්මා දිට්ඨිය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය නොහැකි කරුණකි. සම්මා දිට්ඨිය සම්පූර්ණ නොකර සම්මා සමාධිය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය නොහැකි කරුණකි.\n\nමහණෙනි, ගෞරව කරන, ප්‍රතිපත්තිගරුක වන, සබ්‍රහ්මචාරීන් සමඟ සමගිව හැසිරෙන භික්‍ෂුවක් සබ්‍රහ්මචාරීන් කෙරෙහි ආභිසමාචාරික ධර්මය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය හැකි කරුණකි. ආභිසමාචාරික ධර්මය සම්පූර්ණ කර ශෛක්‍ෂ ධර්මය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය හැකි කරුණකි. ශෛක්‍ෂ ධර්මය සම්පූර්ණ කර සීලයන් සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය හැකි කරුණකි. සීලයන් සම්පූර්ණ කර සම්මා දිට්ඨිය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය හැකි කරුණකි. සම්මා දිට්ඨිය සම්පූර්ණ කර සම්මා සමාධිය සම්පූර්ණ කරන්නේ යැයි කියනු සිදු විය හැකි කරුණකි.",
      "paliTitle": "Paṭhamaagāravasuttaṃ"
    },
    {
      "number": 22,
      "pali": "‘‘So vata, bhikkhave, bhikkhu agāravo appatisso asabhāgavuttiko ‘sabrahmacārīsu ābhisamācārikaṃ dhammaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Ābhisamācārikaṃ dhammaṃ aparipūretvā sekhaṃ dhammaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sekhaṃ dhammaṃ aparipūretvā sīlakkhandhaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sīlakkhandhaṃ aparipūretvā samādhikkhandhaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Samādhikkhandhaṃ aparipūretvā paññākkhandhaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vata, bhikkhave, bhikkhu sagāravo sappatisso sabhāgavuttiko ‘sabrahmacārīsu ābhisamācārikaṃ dhammaṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Ābhisamācārikaṃ dhammaṃ paripūretvā sekhaṃ dhammaṃ paripūressatī’ti ṭhānametaṃ vijjati. Sekhaṃ dhammaṃ paripūretvā sīlakkhandhaṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Sīlakkhandhaṃ paripūretvā samādhikkhandhaṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Samādhikkhandhaṃ paripūretvā paññākkhandhaṃ paripūressatī’ti ṭhānametaṃ vijjatī’’ti. Dutiyaṃ.",
      "english": "Indeed, O monks, it is not to be expected that a monk who is disrespectful, irreverent, and unharmonious in his conduct will fulfill the fundamental rules of proper behavior towards his fellow practitioners of the Holy Life. It is not to be expected that, having not fulfilled the fundamental rules of proper behavior, he will fulfill the training rules for a learner. It is not to be expected that, having not fulfilled the training rules for a learner, he will fulfill the aggregate of morality. It is not to be expected that, having not fulfilled the aggregate of morality, he will fulfill the aggregate of concentration. It is not to be expected that, having not fulfilled the aggregate of concentration, he will fulfill the aggregate of wisdom.\n\nIndeed, O monks, it is to be expected that a monk who is respectful, reverent, and harmonious in his conduct will fulfill the fundamental rules of proper behavior towards his fellow practitioners of the Holy Life. It is to be expected that, having fulfilled the fundamental rules of proper behavior, he will fulfill the training rules for a learner. It is to be expected that, having fulfilled the training rules for a learner, he will fulfill the aggregate of morality. It is to be expected that, having fulfilled the aggregate of morality, he will fulfill the aggregate of concentration. It is to be expected that, having fulfilled the aggregate of concentration, he will fulfill the aggregate of wisdom.",
      "sinhala": "භික්‍ෂූණි, යම් භික්‍ෂුවක් අගෞරව සහිත නම්, නොපිළිගන්නා සුළු නම්, අන්‍යයන් සමඟ සමගිව කටයුතු නොකරන්නේ නම්, ඔහු බඹසර පුරන සගයන් අතරෙහි ආභිසමාචාරික ධර්මය සම්පූර්ණ කරන්නේය යනු විය හැකි දෙයක් නොවේ. ආභිසමාචාරික ධර්මය සම්පූර්ණ නොකොට ශෛක්‍ෂ්‍ය ධර්මය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් නොවේ. ශෛක්‍ෂ්‍ය ධර්මය සම්පූර්ණ නොකොට සීලස්කන්ධය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් නොවේ. සීලස්කන්ධය සම්පූර්ණ නොකොට සමාධිස්කන්ධය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් නොවේ. සමාධිස්කන්ධය සම්පූර්ණ නොකොට ප්‍රඥාස්කන්ධය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් නොවේ.\n\nභික්‍ෂූණි, යම් භික්‍ෂුවක් ගෞරව සහිත නම්, පිළිගන්නා සුළු නම්, අන්‍යයන් සමඟ සමගිව කටයුතු කරන්නේ නම්, ඔහු බඹසර පුරන සගයන් අතරෙහි ආභිසමාචාරික ධර්මය සම්පූර්ණ කරන්නේය යනු විය හැකි දෙයක් වේ. ආභිසමාචාරික ධර්මය සම්පූර්ණ කොට ශෛක්‍ෂ්‍ය ධර්මය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් වේ. ශෛක්‍ෂ්‍ය ධර්මය සම්පූර්ණ කොට සීලස්කන්ධය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් වේ. සීලස්කන්ධය සම්පූර්ණ කොට සමාධිස්කන්ධය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් වේ. සමාධිස්කන්ධය සම්පූර්ණ කොට ප්‍රඥාස්කන්ධය සම්පූර්ණ කරන්නේය යනු ද විය හැකි දෙයක් වේ.",
      "paliTitle": "Dutiyaagāravasuttaṃ"
    },
    {
      "number": 23,
      "pali": "‘‘Pañcime, bhikkhave, jātarūpassa upakkilesā, yehi upakkilesehi upakkiliṭṭhaṃ jātarūpaṃ na ceva mudu hoti na ca kammaniyaṃ na ca pabhassaraṃ pabhaṅgu ca na ca sammā upeti kammāya. Katame pañca? Ayo, lohaṃ, tipu, sīsaṃ, sajjhaṃ [sajjhu (sī.)] – ime kho, bhikkhave, pañca jātarūpassa upakkilesā, yehi upakkilesehi upakkiliṭṭhaṃ jātarūpaṃ na ceva mudu hoti na ca kammaniyaṃ na ca pabhassaraṃ pabhaṅgu ca na ca sammā upeti kammāya. Yato ca kho, bhikkhave, jātarūpaṃ imehi pañcahi upakkilesehi vimuttaṃ [vippamuttaṃ (sī.)] hoti, taṃ hoti jātarūpaṃ mudu ca kammaniyañca pabhassarañca na ca pabhaṅgu sammā upeti kammāya. Yassā yassā ca [yassa kassaci (syā. pī.)] piḷandhanavikatiyā ākaṅkhati – yadi muddikāya yadi kuṇḍalāya yadi gīveyyakāya [gīveyyakena (syā. kaṃ. ka., a. ni. 3.102)] yadi suvaṇṇamālāya – tañcassa atthaṃ anubhoti. ‘‘Evamevaṃ kho, bhikkhave, pañcime cittassa upakkilesā, yehi upakkilesehi upakkiliṭṭhaṃ cittaṃ na ceva mudu hoti na ca kammaniyaṃ na ca pabhassaraṃ pabhaṅgu ca na ca sammā samādhiyati āsavānaṃ khayāya. Katame pañca? Kāmacchando, byāpādo, thinamiddhaṃ [thīnamiddhaṃ (sī. syā. kaṃ. pī.)], uddhaccakukkuccaṃ, vicikicchā – ime kho, bhikkhave, pañca cittassa upakkilesā yehi upakkilesehi upakkiliṭṭhaṃ cittaṃ na ceva mudu hoti na ca kammaniyaṃ na ca pabhassaraṃ pabhaṅgu ca na ca sammā samādhiyati āsavānaṃ khayāya. Yato ca kho, bhikkhave, cittaṃ imehi pañcahi upakkilesehi vimuttaṃ hoti, taṃ hoti cittaṃ mudu ca kammaniyañca pabhassarañca na ca pabhaṅgu sammā samādhiyati āsavānaṃ khayāya. Yassa yassa ca abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ – ekopi hutvā bahudhā assaṃ, bahudhāpi hutvā eko assaṃ; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gaccheyyaṃ, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ kareyyaṃ, seyyathāpi udake; udakepi abhijjamāno gaccheyyaṃ, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kameyyaṃ, seyyathāpi pakkhī sakuṇo; imepi candimasūriye [candimasuriye (sī. syā. kaṃ. pī.)] evaṃmahiddhike evaṃmahānubhāve pāṇinā parimaseyyaṃ [parāmaseyyaṃ (ka.)] parimajjeyyaṃ yāva brahmalokāpi kāyena vasaṃ vatteyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇeyyaṃ – dibbe ca mānuse ca ye dūre santike cā’ti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajāneyyaṃ – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajāneyyaṃ, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajāneyyaṃ, sadosaṃ vā cittaṃ sadosaṃ cittanti pajāneyyaṃ, vītadosaṃ vā cittaṃ vītadosaṃ cittanti pajāneyyaṃ, samohaṃ vā cittaṃ samohaṃ cittanti pajāneyyaṃ, vītamohaṃ vā cittaṃ vītamohaṃ cittanti pajāneyyaṃ, saṃkhittaṃ vā cittaṃ saṃkhittaṃ cittanti pajāneyyaṃ, vikkhittaṃ vā cittaṃ vikkhittaṃ cittanti pajāneyyaṃ, mahaggataṃ vā cittaṃ mahaggataṃ cittanti pajāneyyaṃ, amahaggataṃ vā cittaṃ amahaggataṃ cittanti pajāneyyaṃ, sauttaraṃ vā cittaṃ sauttaraṃ cittanti pajāneyyaṃ, anuttaraṃ vā cittaṃ anuttaraṃ cittanti pajāneyyaṃ, samāhitaṃ vā cittaṃ samāhitaṃ cittanti pajāneyyaṃ, asamāhitaṃ vā cittaṃ asamāhitaṃ cittanti pajāneyyaṃ, vimuttaṃ vā cittaṃ vimuttaṃ cittanti pajāneyyaṃ, avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ pubbenivāsaṃ anussareyyaṃ, seyyathidaṃ [seyyathīdaṃ (sī. syā. kaṃ. pī.)] – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattārīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyyaṃ – ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannāti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane’’ti. Tatiyaṃ.",
      "english": "Monks, there are these five impurities of gold. When gold is defiled by these impurities, it is not malleable, not workable, not lustrous, but brittle, and does not serve its proper purpose. What are these five? They are iron, copper, tin, lead, and silver. Monks, these are the five impurities of gold; when gold is defiled by these impurities, it is not malleable, not workable, not lustrous, but brittle, and does not serve its proper purpose.\n\nBut when, monks, gold is freed from these five impurities, then that gold becomes malleable, workable, lustrous, not brittle, and serves its proper purpose. Whatever kind of ornamentation one desires to fashion from it — whether a ring, earrings, a necklace, or a gold chain — it fulfills that purpose.\n\nIn the same way, monks, there are these five defilements of the mind. When the mind is defiled by these defilements, it is not malleable, not workable, not luminous, but brittle, and does not become rightly concentrated for the destruction of the taints. What are these five? They are sensual desire, ill-will, sloth and torpor, restlessness and remorse, and skeptical doubt. Monks, these are the five defilements of the mind; when the mind is defiled by these defilements, it is not malleable, not workable, not luminous, but brittle, and does not become rightly concentrated for the destruction of the taints.\n\nBut when, monks, the mind is freed from these five defilements, then that mind becomes malleable, workable, luminous, not brittle, and becomes rightly concentrated for the destruction of the taints. Whatever state realizable by direct knowledge one inclines the mind towards for its direct realization, one attains the capacity to be a witness to it, in each and every appropriate sphere.\n\nIf he wishes: 'May I experience various kinds of supernormal powers — being one, may I become many; being many, may I become one; appearing and disappearing; going unimpeded through walls, through ramparts, through mountains, as if through space; diving in and out of the earth as if in water; walking on water without sinking as if on land; traveling through the air cross-legged, like a winged bird; touching and stroking with my hand these moon and sun, so mighty, so powerful; and exercising mastery with my body even over the Brahma-world,' he attains the capacity to be a witness to it, in each and every appropriate sphere.\n\nIf he wishes: 'May I hear both kinds of sounds, divine and human, whether far or near, with the divine ear-element, purified and surpassing that of humans,' he attains the capacity to be a witness to it, in each and every appropriate sphere.\n\nIf he wishes: 'May I understand the minds of other beings, other individuals, by comprehending them with my own mind — I discern a mind with lust as 'a mind with lust', a mind without lust as 'a mind without lust', a mind with hatred as 'a mind with hatred', a mind without hatred as 'a mind without hatred', a mind with delusion as 'a mind with delusion', a mind without delusion as 'a mind without delusion', a constricted mind as 'a constricted mind', a distracted mind as 'a distracted mind', a developed mind as 'a developed mind', an undeveloped mind as 'an undeveloped mind', a surpassable mind as 'a surpassable mind', an unsurpassable mind as 'an unsurpassable mind', a concentrated mind as 'a concentrated mind', an unconcentrated mind as 'an unconcentrated mind', a liberated mind as 'a liberated mind', an unliberated mind as 'an unliberated mind',' he attains the capacity to be a witness to it, in each and every appropriate sphere.\n\nIf he wishes: 'May I recollect my manifold past abodes, that is, one birth, two births, three births, up to a hundred thousand births; many aeons of cosmic contraction, many aeons of cosmic expansion, many aeons of cosmic contraction and expansion; 'There I was named thus, of such a clan, of such a complexion, fed on such food, experiencing such pleasant and painful feelings, with such a lifespan. Passing away from there, I arose elsewhere. There too I was named thus, of such a clan, of such a complexion, fed on such food, experiencing such pleasant and painful feelings, with such a lifespan. Passing away from there, I arose here.' Thus he recollects his manifold past abodes in their modes and details.\"\n\nHe recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. He remembers: 'There I was with such a name, of such a clan, of such a color, eating such food, experiencing such pleasure and pain, having such a lifespan. Having passed away from there, I reappeared yonder. There too I was with such a name, of such a clan, of such a color, eating such food, experiencing such pleasure and pain, having such a lifespan. Having passed away from there, I reappeared here.' Thus, he recollects his manifold past lives with their specific characteristics and circumstances. In each and every aspect, he attains the capacity for direct realization.\n\nIf he wishes, 'May I perceive beings passing away and reappearing, inferior and superior, beautiful and ugly, in good destinations and bad destinations, with the divine eye, purified and surpassing that of humans, and may I understand beings as they fare according to their actions: These worthy beings, indeed, were endowed with misconduct of body, speech, and mind, revilers of noble ones, holding wrong views, and undertaking actions based on wrong views. Upon the dissolution of the body, after death, they are reborn in a state of deprivation, a bad destination, a state of woe, hell. But these worthy beings were endowed with good conduct of body, speech, and mind, not revilers of noble ones, holding right views, and undertaking actions based on right views. Upon the dissolution of the body, after death, they are reborn in a good destination, a heavenly world,'—thus, may I perceive beings passing away and reappearing, inferior and superior, beautiful and ugly, in good destinations and bad destinations, with the divine eye, purified and surpassing that of humans, and may I understand beings as they fare according to their actions'—then, in each and every aspect, he attains the capacity for direct realization.\n\nIf he wishes, 'May I, by the destruction of the taints, enter and dwell in the taintless liberation of mind and liberation by wisdom, having realized it for myself with direct knowledge in this very life,' then, in each and every aspect, he attains the capacity for direct realization.",
      "sinhala": "මහණෙනි, රනෙහි උපක්ලේශ (කෙලෙස්) පසක් ඇත්තේය. මේ උපක්ලේශයන්ගෙන් කිලිටි වූ රන් මෘදු ද නොවේ, කර්මාන්තයට සුදුසු ද නොවේ, දීප්තිමත් ද නොවේ, බිඳෙනසුලු ද වේ, කර්මාන්තයට නිසි ලෙස භාවිතයට නොගැනේ. ඒ පස කවරේද? යකඩ, තඹ, ටින්, ඊයම්, රිදී යන මේවා මහණෙනි, රනෙහි උපක්ලේශ පසයි. මේ උපක්ලේශයන්ගෙන් කිලිටි වූ රන් මෘදු ද නොවේ, කර්මාන්තයට සුදුසු ද නොවේ, දීප්තිමත් ද නොවේ, බිඳෙනසුලු ද වේ, කර්මාන්තයට නිසි ලෙස භාවිතයට නොගැනේ. මහණෙනි, යම් කලෙක රන් මේ උපක්ලේශ පසෙන් මිදුණේද, එකල ඒ රන් මෘදු ද වේ, කර්මාන්තයට සුදුසු ද වේ, දීප්තිමත් ද වේ, බිඳෙනසුලු ද නොවේ, කර්මාන්තයට නිසි ලෙස භාවිතයට ගැනේ. ඔහු යම් යම් ආභරණ විශේෂයක් - මුදුවක් හෝ කරාබුවක් හෝ මාලයක් හෝ රන් මාලයක් - කිරීමට කැමැති වන්නේ නම්, ඒ කාරණය ඔහුට සිද්ධවේ.\n\nමහණෙනි, එපරිද්දෙන්ම සිතෙහි උපක්ලේශ (කෙලෙස්) පසක් ඇත්තේය. මේ උපක්ලේශයන්ගෙන් කිලිටි වූ සිත මෘදු ද නොවේ, කර්මාන්තයට සුදුසු ද නොවේ, දීප්තිමත් ද නොවේ, බිඳෙනසුලු ද වේ, ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිසි ලෙස සමාධිගත නොවේ. ඒ පස කවරේද? කාමච්ඡන්දය, ව්‍යාපාදය, ථීනමිද්ධය, උද්ධච්චකුක්කුච්චය, විචිකිච්ඡාව යන මේවා මහණෙනි, සිතෙහි උපක්ලේශ පසයි. මේ උපක්ලේශයන්ගෙන් කිලිටි වූ සිත මෘදු ද නොවේ, කර්මාන්තයට සුදුසු ද නොවේ, දීප්තිමත් ද නොවේ, බිඳෙනසුලු ද වේ, ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිසි ලෙස සමාධිගත නොවේ. මහණෙනි, යම් කලෙක සිත මේ උපක්ලේශ පසෙන් මිදුණේද, එකල ඒ සිත මෘදු ද වේ, කර්මාන්තයට සුදුසු ද වේ, දීප්තිමත් ද වේ, බිඳෙනසුලු ද නොවේ, ආශ්‍රවයන් ක්ෂය කිරීම පිණිස නිසි ලෙස සමාධිගත වේ. යම් යම් අභිඥාවෙන් සාක්ෂාත් කළයුතු ධර්මයක් අභිඥාවෙන් සාක්ෂාත් කිරීම පිණිස ඔහු සිත නැඹුරු කරන්නේද, ඒ ඒ අවස්ථාවෙහි ඒ ඒ ආයතනයට අදාළව සාක්ෂාත් කිරීමේ හැකියාවට ඔහු පැමිණේ.\n\nඔහු යම් හෙයකින්, ‘මම නොයෙක් ආකාර වූ ඍද්ධි ප්‍රභේදයන් අත්දකින්නෙමි. එනම්, එකකු වී බොහෝ වන්නෙමි, බොහෝ වී එකකු වන්නෙමි; ප්‍රකට වන්නෙමි, අතුරුදහන් වන්නෙමි; බිත්ති අතරින්, ප්‍රාකාර අතරින්, පර්වත අතරින් නොඇලී යන්නෙමි, අහසෙහි මෙන්; පොළොවෙහි ද දියෙහි මෙන් කිමිදෙමින් මතු වන්නෙමි; දියෙහි ද පොළොවෙහි මෙන් නොබිඳී යන්නෙමි; අහසෙහි ද පලක් බැඳ පක්ෂි සකුණකු මෙන් ගමන් කරන්නෙමි; මෙබඳු මහත් ඍද්ධි ඇති, මෙබඳු මහත් ආනුභාව ඇති චන්ද්‍රයා සහ සූර්යයා ද අතින් පිරිමදින්නෙමි, අතගාන්නෙමි; බ්‍රහ්ම ලෝකය දක්වා ද කයින් වසඟය පවත්වන්නෙමි’යි කැමැති වන්නේ නම්, ඒ ඒ අවස්ථාවෙහි ඒ ඒ ආයතනයට අදාළව සාක්ෂාත් කිරීමේ හැකියාවට ඔහු පැමිණේ.\n\nඔහු යම් හෙයකින්, ‘පිරිසිදු වූ, මිනිස් කන් ඉක්මවා ගිය දිව්‍යමය ශ්‍රවණ ධාතුවෙන් (කනින්) දුර සිටින ද, ළඟ සිටින ද දිව්‍යමය වූ ද මිනිස් වූ ද යන ශබ්ද දෙකම අසන්නෙමි’යි කැමැති වන්නේ නම්, ඒ ඒ අවස්ථාවෙහි ඒ ඒ ආයතනයට අදාළව සාක්ෂාත් කිරීමේ හැකියාවට ඔහු පැමිණේ.\n\nඔහු යම් හෙයකින්, ‘මම අන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිත් මාගේ සිතින් පිරිසිඳ (විචාරා) දැනගන්නෙමි. එනම්, රාග සහිත සිත ‘රාග සහිත සිතැ’යි දැනගන්නෙමි, රාග රහිත සිත ‘රාග රහිත සිතැ’යි දැනගන්නෙමි; ද්වේෂ සහිත සිත ‘ද්වේෂ සහිත සිතැ’යි දැනගන්නෙමි, ද්වේෂ රහිත සිත ‘ද්වේෂ රහිත සිතැ’යි දැනගන්නෙමි; මෝහ සහිත සිත ‘මෝහ සහිත සිතැ’යි දැනගන්නෙමි, මෝහ රහිත සිත ‘මෝහ රහිත සිතැ’යි දැනගන්නෙමි; සංක්ෂිප්ත වූ (සහමුලින්ම යටපත් වූ නීවරණ ඇති) සිත ‘සංක්ෂිප්ත වූ සිතැ’යි දැනගන්නෙමි, වික්ෂිප්ත වූ (නීවරණ විසින් විසිර වූ) සිත ‘වික්ෂිප්ත වූ සිතැ’යි දැනගන්නෙමි; මහග්ගත (ඣානගත) සිත ‘මහග්ගත සිතැ’යි දැනගන්නෙමි, අමහග්ගත (ඣානගත නොවන) සිත ‘අමහග්ගත සිතැ’යි දැනගන්නෙමි; සඋත්තර (ඊටත් ඉහළ ඣානයක් හෝ විමුක්තියක් ඇති) සිත ‘සඋත්තර සිතැ’යි දැනගන්නෙමි, අනුත්තර (ඣානය ඉක්මවා ගිය හෝ අරහත්) සිත ‘අනුත්තර සිතැ’යි දැනගන්නෙමි; සමාහිත (සමාධිගත) සිත ‘සමාහිත සිතැ’යි දැනගන්නෙමි, අසමාහිත (සමාධිගත නොවන) සිත ‘අසමාහිත සිතැ’යි දැනගන්නෙමි; විමුක්ත (කෙලෙස්වලින් තාවකාලිකව මිදුණු) සිත ‘විමුක්ත සිතැ’යි දැනගන්නෙමි, අවිමුක්ත (කෙලෙස්වලින් මිදී නොමැති) සිත ‘අවිමුක්ත සිතැ’යි දැනගන්නෙමි’යි කැමැති වන්නේ නම්, ඒ ඒ අවස්ථාවෙහි ඒ ඒ ආයතනයට අදාළව සාක්ෂාත් කිරීමේ හැකියාවට ඔහු පැමිණේ.\n\nඔහු යම් හෙයකින්, ‘මම නොයෙක් ආකාර වූ පූර්ව නිවාසයන් සිහි කරන්නෙමි. ඒ මෙසේය’ යනුවෙන් කැමැති වන්නේ නම්, ඒ ඒ අවස්ථාවෙහි ඒ ඒ ආයතනයට අදාළව සාක්ෂාත් කිරීමේ හැකියාවට ඔහු පැමිණේ.\n\nඑක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, අනේක සංවර්ත කල්පයන් ද, අනේක විවර්ත කල්පයන් ද, අනේක සංවර්ත විවර්ත කල්පයන් ද, - එතැන මේ නම් ඇත්තේ ද, මේ ගෝත්‍ර ඇත්තේ ද, මේ වර්ණ ඇත්තේ ද, මේ ආහාර ඇත්තේ ද, මෙවන් සුවදුක් විඳින්නේ ද, මේ ආයුෂ අවසාන කොට ඇත්තේ ද වීමි. මම එතැනින් චුත වී අසුවල් තැන උපන්නෙමි; එහි ද මේ නම් ඇත්තේ ද, මේ ගෝත්‍ර ඇත්තේ ද, මේ වර්ණ ඇත්තේ ද, මේ ආහාර ඇත්තේ ද, මෙවන් සුවදුක් විඳින්නේ ද, මේ ආයුෂ අවසාන කොට ඇත්තේ ද වීමි. මම එතැනින් චුත වී මෙහි උපන්නෙමි යනුවෙන් මෙසේ විවිධ ආකාරයෙන් සවිස්තරව පෙර විසූ කඳ පිළිවෙළ සිහි කරන්නේ ය. එක් එක් ආයතනය පිළිබඳව ම යම් යම් අවස්ථාවල දී තමන් විසින් ම දැකගත යුතු වූ ඥානය ප්‍රත්‍යක්ෂ කිරීමේ හැකියාවට එළඹෙයි.\n\n‘‘යම් හෙයකින් ඔහු, ‘පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන්නා වූ ද, උපදින්නා වූ ද, හීන වූ ද, ප්‍රණීත වූ ද, මනා වර්ණ ඇත්තා වූ ද, දුර්වර්ණ වූ ද, සුගති දුගතිවලට ගියා වූ ද, කර්මානුරූපව ගමන් කරන්නා වූ ද සත්ත්වයන් දක්නෙම්වා, දනිමි’යි පතන්නේ නම්, ‘අහෝ! මේ භවත් සත්ත්වයෝ කායදුශ්චරිතයෙන් යුක්ත ව සිටියහ, වචීදුශ්චරිතයෙන් යුක්ත ව සිටියහ, මනෝදුශ්චරිතයෙන් යුක්ත ව සිටියහ, ආර්යයන්ට අපහාස කළහ, මිථ්‍යාදෘෂ්ටික වූහ, මිථ්‍යාදෘෂ්ටික කර්ම සමාදන් වූහ. ඔවුහු කයින් භේද වී මරණින් මතු අපාය, දුගති, විනිපාත, නිරයෙහි උපන්නාහ. නැතහොත් මේ භවත් සත්ත්වයෝ කායසුචරිතයෙන් යුක්ත ව සිටියහ, වචීසුචරිතයෙන් යුක්ත ව සිටියහ, මනෝසුචරිතයෙන් යුක්ත ව සිටියහ, ආර්යයන්ට අපහාස නොකළහ, සම්මාදිට්ඨික වූහ, සම්මාදිට්ඨික කර්ම සමාදන් වූහ. ඔවුහු කයින් භේද වී මරණින් මතු සුගති ස්වර්ග ලෝකයෙහි උපන්නාහ’ යි මෙසේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන්නා වූ ද, උපදින්නා වූ ද, හීන වූ ද, ප්‍රණීත වූ ද, මනා වර්ණ ඇත්තා වූ ද, දුර්වර්ණ වූ ද, සුගති දුගතිවලට ගියා වූ ද, කර්මානුරූපව ගමන් කරන්නා වූ ද සත්ත්වයන් දක්නෙම්වා, දනිමි’යි පතන්නේ නම්, එක් එක් ආයතනය පිළිබඳව ම යම් යම් අවස්ථාවල දී තමන් විසින් ම දැකගත යුතු වූ ඥානය ප්‍රත්‍යක්ෂ කිරීමේ හැකියාවට එළඹෙයි.\n\n‘‘‘ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයෙහි දී ම තමන් විසින් විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කර අවබෝධ කොට වාසය කරන්නෙම්වා’යි ඔහු පතන්නේ නම්, එක් එක් ආයතනය පිළිබඳව ම යම් යම් අවස්ථාවල දී තමන් විසින් ම දැකගත යුතු වූ ඥානය ප්‍රත්‍යක්ෂ කිරීමේ හැකියාවට එළඹෙයි.",
      "paliTitle": "Upakkilesasuttaṃ"
    },
    {
      "number": 24,
      "pali": "[a. ni. 5.168; 6.50; 7.65] ‘‘Dussīlassa, bhikkhave, sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi na pāripūriṃ gacchati, pheggupi na pāripūriṃ gacchati, sāropi na pāripūriṃ gacchati; evamevaṃ kho, bhikkhave, dussīlassa sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. ‘‘Sīlavato, bhikkhave, sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi pāripūriṃ gacchati, pheggupi pāripūriṃ gacchati, sāropi pāripūriṃ gacchati; evamevaṃ kho, bhikkhave, sīlavato sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassana’’nti. Catutthaṃ.",
      "english": "Bhikkhus, for one who is immoral, who has failed in virtue, right concentration has its foundation destroyed. When right concentration is absent, for one who has failed in right concentration, the knowledge and vision of things as they truly are has its foundation destroyed. When the knowledge and vision of things as they truly are is absent, for one who has failed in the knowledge and vision of things as they truly are, disenchantment and dispassion have their foundation destroyed. When disenchantment and dispassion are absent, for one who has failed in disenchantment and dispassion, the knowledge and vision of liberation has its foundation destroyed. Just as, Bhikkhus, a tree that is devoid of branches and leaves—its outer bark does not reach full development, its inner bark does not reach full development, its sapwood does not reach full development, its heartwood does not reach full development. In the same way, Bhikkhus, for one who is immoral, who has failed in virtue, right concentration has its foundation destroyed; when right concentration is absent, for one who has failed in right concentration, the knowledge and vision of things as they truly are has its foundation destroyed; when the knowledge and vision of things as they truly are is absent, for one who has failed in the knowledge and vision of things as they truly are, disenchantment and dispassion have their foundation destroyed; when disenchantment and dispassion are absent, for one who has failed in disenchantment and dispassion, the knowledge and vision of liberation has its foundation destroyed.\n\nBhikkhus, for one who is virtuous, who is endowed with virtue, right concentration has its foundation complete. When right concentration is present, for one who is endowed with right concentration, the knowledge and vision of things as they truly are has its foundation complete. When the knowledge and vision of things as they truly are is present, for one who is endowed with the knowledge and vision of things as they truly are, disenchantment and dispassion have their foundation complete. When disenchantment and dispassion are present, for one who is endowed with disenchantment and dispassion, the knowledge and vision of liberation has its foundation complete. Just as, Bhikkhus, a tree that is endowed with branches and leaves—its outer bark reaches full development, its inner bark reaches full development, its sapwood reaches full development, its heartwood reaches full development. In the same way, Bhikkhus, for one who is virtuous, who is endowed with virtue, right concentration has its foundation complete; when right concentration is present, for one who is endowed with right concentration, the knowledge and vision of things as they truly are has its foundation complete; when the knowledge and vision of things as they truly are is present, for one who is endowed with the knowledge and vision of things as they truly are, disenchantment and dispassion have their foundation complete; when disenchantment and dispassion are present, for one who is endowed with disenchantment and dispassion, the knowledge and vision of liberation has its foundation complete.",
      "sinhala": "භික්‍ෂූණි, දුශ්ශීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයා හට සම්මාසමාධිය සඳහා වූ උපනිශ්‍රය නැතිවී යයි. සම්මාසමාධිය නොමැති කල්හි, සම්මාසමාධියෙන් පිරිහී ගිය පුද්ගලයා හට යථාභූත ඤාණදර්ශනය සඳහා වූ උපනිශ්‍රය නැතිවී යයි. යථාභූත ඤාණදර්ශනය නොමැති කල්හි, යථාභූත ඤාණදර්ශනයෙන් පිරිහී ගිය පුද්ගලයා හට නිබ්බිදා විරාගය (කලකිරීම හා නොඇලීම) සඳහා වූ උපනිශ්‍රය නැතිවී යයි. නිබ්බිදා විරාගය නොමැති කල්හි, නිබ්බිදා විරාගයෙන් පිරිහී ගිය පුද්ගලයා හට විමුක්ති ඤාණදර්ශනය (විමුක්තිය පිළිබඳ ඤාණය හා දැක්ම) සඳහා වූ උපනිශ්‍රය නැතිවී යයි. භික්‍ෂූණි, යම් සේ අතුපතර හා කොළ රිකිලි නැති ගසක් වේ ද, එහි පොත්ත ද මැනවින් වැඩෙන්නේ නැත, තුලපොත්ත ද මැනවින් වැඩෙන්නේ නැත, මදුළු ද මැනවින් වැඩෙන්නේ නැත, සාරය ද මැනවින් වැඩෙන්නේ නැත. භික්‍ෂූණි, එපරිද්දෙන්ම දුශ්ශීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයා හට සම්මාසමාධිය සඳහා වූ උපනිශ්‍රය නැතිවී යයි. සම්මාසමාධිය නොමැති කල්හි, සම්මාසමාධියෙන් පිරිහී ගිය පුද්ගලයා හට යථාභූත ඤාණදර්ශනය සඳහා වූ උපනිශ්‍රය නැතිවී යයි. යථාභූත ඤාණදර්ශනය නොමැති කල්හි, යථාභූත ඤාණදර්ශනයෙන් පිරිහී ගිය පුද්ගලයා හට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය නැතිවී යයි. නිබ්බිදා විරාගය නොමැති කල්හි, නිබ්බිදා විරාගයෙන් පිරිහී ගිය පුද්ගලයා හට විමුක්ති ඤාණදර්ශනය සඳහා වූ උපනිශ්‍රය නැතිවී යයි.\n\nභික්‍ෂූණි, සීලවන්ත වූ, සීලයෙන් යුක්ත වූ පුද්ගලයා හට සම්මාසමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. සම්මාසමාධිය ඇති කල්හි, සම්මාසමාධියෙන් යුක්ත වූ පුද්ගලයා හට යථාභූත ඤාණදර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. යථාභූත ඤාණදර්ශනය ඇති කල්හි, යථාභූත ඤාණදර්ශනයෙන් යුක්ත වූ පුද්ගලයා හට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගයෙන් යුක්ත වූ පුද්ගලයා හට විමුක්ති ඤාණදර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. භික්‍ෂූණි, යම් සේ අතුපතර හා කොළ රිකිලි සහිත ගසක් වේ ද, එහි පොත්ත ද මැනවින් වැඩෙයි, තුලපොත්ත ද මැනවින් වැඩෙයි, මදුළු ද මැනවින් වැඩෙයි, සාරය ද මැනවින් වැඩෙයි. භික්‍ෂූණි, එපරිද්දෙන්ම සීලවන්ත වූ, සීලයෙන් යුක්ත වූ පුද්ගලයා හට සම්මාසමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. සම්මාසමාධිය ඇති කල්හි, සම්මාසමාධියෙන් යුක්ත වූ පුද්ගලයා හට යථාභූත ඤාණදර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. යථාභූත ඤාණදර්ශනය ඇති කල්හි, යථාභූත ඤාණදර්ශනයෙන් යුක්ත වූ පුද්ගලයා හට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගයෙන් යුක්ත වූ පුද්ගලයා හට විමුක්ති ඤාණදර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ.",
      "paliTitle": "Dussīlasuttaṃ"
    },
    {
      "number": 25,
      "pali": "‘‘Pañcahi, bhikkhave, aṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṃsā ca. ‘‘Katamehi pañcahi? Idha, bhikkhave, sammādiṭṭhi sīlānuggahitā ca hoti, sutānuggahitā ca hoti, sākacchānuggahitā ca hoti, samathānuggahitā ca hoti, vipassanānuggahitā ca hoti. Imehi kho, bhikkhave, pañcahi aṅgehi anuggahitā sammādiṭṭhi cetovimuttiphalā ca hoti cetovimuttiphalānisaṃsā ca, paññāvimuttiphalā ca hoti paññāvimuttiphalānisaṃsā cā’’ti. Pañcamaṃ.",
      "english": "Monks, Right View, when supported by five factors, is fruitful in liberation of mind and has liberation of mind as its benefit; it is fruitful in liberation by wisdom and has liberation by wisdom as its benefit.\n\nWhich five? Here, monks, Right View is supported by moral conduct, supported by learning, supported by reasoned discussion, supported by tranquility, and supported by insight. Indeed, monks, Right View, when supported by these five factors, is fruitful in liberation of mind and has liberation of mind as its benefit; it is fruitful in liberation by wisdom and has liberation by wisdom as its benefit.",
      "sinhala": "භික්ෂූන් වහන්ස, කරුණු පහකින් යුක්ත වූ සම්‍යක්දෘෂ්ටිය චේතෝවිමුක්තියේ ඵලදායක ද වේ, චේතෝවිමුක්ති ඵලවල ආනිසංස ගෙන දෙන්නක් ද වේ. ප්‍රඥා**විමුක්ති**යේ ඵලදායක ද වේ, ප්‍රඥා**විමුක්ති** ඵලවල ආනිසංස ගෙන දෙන්නක් ද වේ.\n\nඒ කරුණු පහ කවරේද?\n\nභික්ෂූන් වහන්ස, මෙහිලා සම්‍යක්දෘෂ්ටිය සිල්වලින් අනුග්‍රහය ලබන්නක් ද වේ, **ශ්‍රවණ**යෙන් අනුග්‍රහය ලබන්නක් ද වේ, සාකච්ඡාවෙන් අනුග්‍රහය ලබන්නක් ද වේ, සමථයෙන් අනුග්‍රහය ලබන්නක් ද වේ, විපස්සනාවෙන් අනුග්‍රහය ලබන්නක් ද වේ.\n\nභික්ෂූන් වහන්ස, සැබවින්ම මේ කරුණු පහකින් යුක්ත වූ සම්‍යක්දෘෂ්ටිය චේතෝවිමුක්තියේ ඵලදායක ද වේ, චේතෝවිමුක්ති ඵලවල ආනිසංස ගෙන දෙන්නක් ද වේ. ප්‍රඥා**විමුක්ති**යේ ඵලදායක ද වේ, ප්‍රඥා**විමුක්ති** ඵලවල ආනිසංස ගෙන දෙන්නක් ද වේ.",
      "paliTitle": "Anuggahitasuttaṃ"
    },
    {
      "number": 26,
      "pali": "‘‘Pañcimāni, bhikkhave, vimuttāyatanāni yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Katamāni pañca? Idha, bhikkhave, bhikkhuno satthā dhammaṃ deseti aññataro vā garuṭṭhāniyo sabrahmacārī. Yathā yathā, bhikkhave, tassa bhikkhuno satthā dhammaṃ deseti, aññataro vā garuṭṭhāniyo sabrahmacārī, tathā tathā so tasmiṃ dhamme atthapaṭisaṃvedī ca hoti dhammapaṭisaṃvedī ca. Tassa atthapaṭisaṃvedino dhammapaṭisaṃvedino pāmojjaṃ [pāmujjaṃ (sī. syā. kaṃ.) dī. ni. 3.322] jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedeti [vediyati (sī.)]. Sukhino cittaṃ samādhiyati. Idaṃ, bhikkhave, paṭhamaṃ vimuttāyatanaṃ yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno na heva kho satthā dhammaṃ deseti, aññataro vā garuṭṭhāniyo sabrahmacārī, api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti. Yathā yathā, bhikkhave, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti tathā tathā so tasmiṃ dhamme atthapaṭisaṃvedī ca hoti dhammapaṭisaṃvedī ca. Tassa atthapaṭisaṃvedino dhammapaṭisaṃvedino pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedeti. Sukhino cittaṃ samādhiyati. Idaṃ, bhikkhave, dutiyaṃ vimuttāyatanaṃ yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno na heva kho satthā dhammaṃ deseti, aññataro vā garuṭṭhāniyo sabrahmacārī, nāpi yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti, api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti. Yathā yathā, bhikkhave, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti tathā tathā so tasmiṃ dhamme atthapaṭisaṃvedī ca hoti dhammapaṭisaṃvedī ca. Tassa atthapaṭisaṃvedino dhammapaṭisaṃvedino pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedeti. Sukhino cittaṃ samādhiyati. Idaṃ, bhikkhave, tatiyaṃ vimuttāyatanaṃ yattha bhikkhuno appamattassa ātāpino…pe… yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno na heva kho satthā dhammaṃ deseti, aññataro vā garuṭṭhāniyo sabrahmacārī, nāpi yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti, nāpi yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti; api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati. Yathā yathā, bhikkhave, bhikkhu yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati tathā tathā so tasmiṃ dhamme atthapaṭisaṃvedī ca hoti dhammapaṭisaṃvedī ca. Tassa atthapaṭisaṃvedino dhammapaṭisaṃvedino pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedeti. Sukhino cittaṃ samādhiyati. Idaṃ, bhikkhave, catutthaṃ vimuttāyatanaṃ yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno na heva kho satthā dhammaṃ deseti aññataro vā garuṭṭhāniyo sabrahmacārī, nāpi yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti, nāpi yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti, nāpi yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati; api ca khvassa aññataraṃ samādhinimittaṃ suggahitaṃ hoti sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya. Yathā yathā, bhikkhave, bhikkhuno aññataraṃ samādhinimittaṃ suggahitaṃ hoti sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya tathā tathā so tasmiṃ dhamme atthapaṭisaṃvedī ca hoti dhammapaṭisaṃvedī ca. Tassa atthapaṭisaṃvedino dhammapaṭisaṃvedino pāmojjaṃ jāyati. Pamuditassa pīti jāyati. Pītimanassa kāyo passambhati. Passaddhakāyo sukhaṃ vedeti. Sukhino cittaṃ samādhiyati. Idaṃ, bhikkhave, pañcamaṃ vimuttāyatanaṃ yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇāti. ‘‘Imāni kho, bhikkhave, pañca vimuttāyatanāni yattha bhikkhuno appamattassa ātāpino pahitattassa viharato avimuttaṃ vā cittaṃ vimuccati, aparikkhīṇā vā āsavā parikkhayaṃ gacchanti, ananuppattaṃ vā anuttaraṃ yogakkhemaṃ anupāpuṇātī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these five foundations for liberation, where, for a monk dwelling diligently, ardently, and resolutely, an undeveloped mind becomes liberated, or the unexhausted defilements come to an end, or the unreached supreme security from bondage is attained. Which five? Here, monks, for a monk, the Teacher teaches the Dhamma, or another respected fellow practitioner. As the Teacher teaches the Dhamma to that monk, or another respected fellow practitioner, so too does he experience a deep understanding of the meaning and a deep understanding of the Dhamma in that Dhamma. For one who experiences a deep understanding of the meaning and the Dhamma, delight arises. For one who is delighted, joy arises. For one who is joyful, the body becomes tranquil. With a tranquil body, one experiences happiness. For one who is happy, the mind becomes concentrated. This, monks, is the first foundation for liberation, where, for a monk dwelling diligently, ardently, and resolutely, an undeveloped mind becomes liberated, or the unexhausted defilements come to an end, or the unreached supreme security from bondage is attained.\n\nFurthermore, monks, a monk does not have the Teacher teaching the Dhamma, nor another respected fellow practitioner, but instead he teaches the Dhamma in detail to others, just as he has heard and learned it. As that monk teaches the Dhamma in detail to others, just as he has heard and learned it, so too does he experience a deep understanding of the meaning and a deep understanding of the Dhamma in that Dhamma. For one who experiences a deep understanding of the meaning and the Dhamma, delight arises. For one who is delighted, joy arises. For one who is joyful, the body becomes tranquil. With a tranquil body, one experiences happiness. For one who is happy, the mind becomes concentrated. This, monks, is the second foundation for liberation, where, for a monk dwelling diligently, ardently, and resolutely, an undeveloped mind becomes liberated, or the unexhausted defilements come to an end, or the unreached supreme security from bondage is attained.\n\nFurthermore, monks, a monk does not have the Teacher teaching the Dhamma, nor another respected fellow practitioner, nor does he teach the Dhamma in detail to others just as he has heard and learned it, but instead he recites the Dhamma in detail, just as he has heard and learned it. As that monk recites the Dhamma in detail, just as he has heard and learned it, so too does he experience a deep understanding of the meaning and a deep understanding of the Dhamma in that Dhamma. For one who experiences a deep understanding of the meaning and the Dhamma, delight arises. For one who is delighted, joy arises. For one who is joyful, the body becomes tranquil. With a tranquil body, one experiences happiness. For one who is happy, the mind becomes concentrated. This, monks, is the third foundation for liberation, where, for a monk dwelling diligently, ardently, and resolutely, an undeveloped mind becomes liberated, or the unexhausted defilements come to an end, or the unreached supreme security from bondage is attained.\n\nFurthermore, monks, a monk does not have the Teacher teaching the Dhamma, nor another respected fellow practitioner, nor does he teach the Dhamma in detail to others just as he has heard and learned it, nor does he recite the Dhamma in detail just as he has heard and learned it; but instead he examines and explores the Dhamma in his mind, just as he has heard and learned it, pondering over it with his thoughts. As that monk examines and explores the Dhamma in his mind, pondering over it with his thoughts, just as he has heard and learned it, so too does he experience a deep understanding of the meaning and a deep understanding of the Dhamma in that Dhamma. For one who experiences a deep understanding of the meaning and the Dhamma, delight arises. For one who is delighted, joy arises. For one who is joyful, the body becomes tranquil. With a tranquil body, one experiences happiness. For one who is happy, the mind becomes concentrated. This, monks, is the fourth foundation for liberation, where, for a monk dwelling diligently, ardently, and resolutely, an undeveloped mind becomes liberated, or the unexhausted defilements come to an end, or the unreached supreme security from bondage is attained.\n\nFurthermore, monks, a monk does not have the Teacher teaching the Dhamma, nor another respected fellow practitioner, nor does he teach the Dhamma in detail to others just as he has heard and learned it, nor does he recite the Dhamma in detail just as he has heard and learned it, nor does he examine and explore the Dhamma in his mind, pondering over it with his thoughts, just as he has heard and learned it; but instead, for him, some meditation object is well-grasped, well-attended to, well-established, and well-penetrated by wisdom.\n\nMonks, to the extent that a monk has well-grasped, well-attended to, well-reflected upon, and well-penetrated by wisdom a certain meditation object, to that same extent he becomes one who experiences the profound meaning and experiences the Dhamma concerning that teaching.\n\nFor him, who thus experiences the profound meaning and experiences the Dhamma, joy arises. For one gladdened, rapture arises. For one whose mind is rapturous, the body becomes tranquil. For one whose body is tranquil, happiness is experienced. For one who is happy, the mind becomes concentrated.\n\nMonks, this is the fifth sphere of liberation, where a monk, dwelling diligent, ardent, and resolute in his endeavors, finds his unliberated mind becoming liberated, or his unexhausted defilements reaching their exhaustion, or attains the unobtained unsurpassed security from bondage. These, monks, are the five spheres of liberation, where a monk, dwelling diligent, ardent, and resolute in his endeavors, finds his unliberated mind becoming liberated, or his unexhausted defilements reaching their exhaustion, or attains the unobtained unsurpassed security from bondage.",
      "sinhala": "භික්ෂූනි, මේ විමුක්තායතන පහක් ඇත. යම් තැනක අප්‍රමාදීව, දැඩි වීර්යයෙන්, ධර්මය සඳහාම කැප වූ සිත් ඇතිව වසන භික්ෂුවකගේ නොමිදුණු සිත මිදෙයි ද, ක්ෂය නොවූ ආසවයෝ ක්ෂය භාවයට පත් වෙති ද, නොලැබූ අනුත්තර යෝගක්ඛේමය ලබයි ද (එවන් විමුක්තායතන වේ). ඒ පහ කවරේද? භික්ෂූනි, මෙහිලා භික්ෂුවකට ශාස්තෲන් වහන්සේ ධර්මය දේශනා කරති, නැතහොත් ගරු කටයුතු යම් බ්‍රහ්මචාරියෙක් (ධර්මය දේශනා කරයි). භික්ෂූනි, යම් ආකාරයකින් ඒ භික්ෂුවට ශාස්තෲන් වහන්සේ ධර්මය දේශනා කරත්ද, නැතහොත් ගරු කටයුතු යම් බ්‍රහ්මචාරියෙක් (ධර්මය දේශනා කරත්ද), ඒ ඒ ආකාරයෙන් ඔහු ඒ ධර්මයෙහි අර්ථය ද, ධර්මය ද අත්දකියි. අර්ථය සහ ධර්මය අත්දකින ඔහුට ප්‍රමෝදය ඇතිවේ. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය ඇතිවේ. ප්‍රීතිමත් සිත් ඇති තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කයක් ඇති තැනැත්තා සැපය විඳියි. සැපයෙන් යුක්ත තැනැත්තාගේ සිත සමාධිමත් වේ. භික්ෂූනි, මෙය පළමුවන විමුක්තායතනයයි. යම් තැනක අප්‍රමාදීව, දැඩි වීර්යයෙන්, ධර්මය සඳහාම කැප වූ සිත් ඇතිව වසන භික්ෂුවකගේ නොමිදුණු සිත මිදෙයි ද, ක්ෂය නොවූ ආසවයෝ ක්ෂය භාවයට පත් වෙති ද, නොලැබූ අනුත්තර යෝගක්ඛේමය ලබයි ද (එවන් විමුක්තායතනයකි).\n\nතවද, භික්ෂූනි, භික්ෂුවට ශාස්තෲන් වහන්සේ ධර්මය දේශනා නොකරති, නැතහොත් ගරු කටයුතු යම් බ්‍රහ්මචාරියෙක් (ධර්මය දේශනා නොකරයි). එහෙත් යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් අන්‍යයන්ට දේශනා කරයි. භික්ෂූනි, යම් ආකාරයකින් භික්ෂුව යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් අන්‍යයන්ට දේශනා කරන්නේද, ඒ ඒ ආකාරයෙන් ඔහු ඒ ධර්මයෙහි අර්ථය ද, ධර්මය ද අත්දකියි. අර්ථය සහ ධර්මය අත්දකින ඔහුට ප්‍රමෝදය ඇතිවේ. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය ඇතිවේ. ප්‍රීතිමත් සිත් ඇති තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කයක් ඇති තැනැත්තා සැපය විඳියි. සැපයෙන් යුක්ත තැනැත්තාගේ සිත සමාධිමත් වේ. භික්ෂූනි, මෙය දෙවන විමුක්තායතනයයි. යම් තැනක අප්‍රමාදීව, දැඩි වීර්යයෙන්, ධර්මය සඳහාම කැප වූ සිත් ඇතිව වසන භික්ෂුවකගේ නොමිදුණු සිත මිදෙයි ද, ක්ෂය නොවූ ආසවයෝ ක්ෂය භාවයට පත් වෙති ද, නොලැබූ අනුත්තර යෝගක්ඛේමය ලබයි ද (එවන් විමුක්තායතනයකි).\n\nතවද, භික්ෂූනි, භික්ෂුවට ශාස්තෲන් වහන්සේ ධර්මය දේශනා නොකරති, නැතහොත් ගරු කටයුතු යම් බ්‍රහ්මචාරියෙක් (ධර්මය දේශනා නොකරයි). යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් අන්‍යයන්ට දේශනා නොකරයි. එහෙත් යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් සජ්ඣායනා කරයි. භික්ෂූනි, යම් ආකාරයකින් භික්ෂුව යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් සජ්ඣායනා කරන්නේද, ඒ ඒ ආකාරයෙන් ඔහු ඒ ධර්මයෙහි අර්ථය ද, ධර්මය ද අත්දකියි. අර්ථය සහ ධර්මය අත්දකින ඔහුට ප්‍රමෝදය ඇතිවේ. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය ඇතිවේ. ප්‍රීතිමත් සිත් ඇති තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කයක් ඇති තැනැත්තා සැපය විඳියි. සැපයෙන් යුක්ත තැනැත්තාගේ සිත සමාධිමත් වේ. භික්ෂූනි, මෙය තෙවන විමුක්තායතනයයි. යම් තැනක අප්‍රමාදීව, දැඩි වීර්යයෙන්, ධර්මය සඳහාම කැප වූ සිත් ඇතිව වසන භික්ෂුවකගේ නොමිදුණු සිත මිදෙයි ද, ක්ෂය නොවූ ආසවයෝ ක්ෂය භාවයට පත් වෙති ද, නොලැබූ අනුත්තර යෝගක්ඛේමය ලබයි ද (එවන් විමුක්තායතනයකි).\n\nතවද, භික්ෂූනි, භික්ෂුවට ශාස්තෲන් වහන්සේ ධර්මය දේශනා නොකරති, නැතහොත් ගරු කටයුතු යම් බ්‍රහ්මචාරියෙක් (ධර්මය දේශනා නොකරයි). යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් අන්‍යයන්ට දේශනා නොකරයි. යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් සජ්ඣායනා නොකරයි; එහෙත් යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය චේතසිකව අනු-විතර්ක කරයි, අනු-විචාරය කරයි, මනසින් අනු-පරීක්ෂා කරයි. භික්ෂූනි, යම් ආකාරයකින් භික්ෂුව යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය චේතසිකව අනු-විතර්ක කරන්නේද, අනු-විචාරය කරන්නේද, මනසින් අනු-පරීක්ෂා කරන්නේද, ඒ ඒ ආකාරයෙන් ඔහු ඒ ධර්මයෙහි අර්ථය ද, ධර්මය ද අත්දකියි. අර්ථය සහ ධර්මය අත්දකින ඔහුට ප්‍රමෝදය ඇතිවේ. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය ඇතිවේ. ප්‍රීතිමත් සිත් ඇති තැනැත්තාගේ කය සංසිඳේ. සංසිඳුණු කයක් ඇති තැනැත්තා සැපය විඳියි. සැපයෙන් යුක්ත තැනැත්තාගේ සිත සමාධිමත් වේ. භික්ෂූනි, මෙය සතරවන විමුක්තායතනයයි. යම් තැනක අප්‍රමාදීව, දැඩි වීර්යයෙන්, ධර්මය සඳහාම කැප වූ සිත් ඇතිව වසන භික්ෂුවකගේ නොමිදුණු සිත මිදෙයි ද, ක්ෂය නොවූ ආසවයෝ ක්ෂය භාවයට පත් වෙති ද, නොලැබූ අනුත්තර යෝගක්ඛේමය ලබයි ද (එවන් විමුක්තායතනයකි).\n\nතවද, භික්ෂූනි, භික්ෂුවට ශාස්තෲන් වහන්සේ ධර්මය දේශනා නොකරති, නැතහොත් ගරු කටයුතු යම් බ්‍රහ්මචාරියෙක් (ධර්මය දේශනා නොකරයි). යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් අන්‍යයන්ට දේශනා නොකරයි. යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය විස්තර වශයෙන් සජ්ඣායනා නොකරයි. යම්සේ අසා, යම්සේ උගත්තා වූ ධර්මය චේතසිකව අනු-විතර්ක නොකරයි, අනු-විචාරය නොකරයි, මනසින් අනු-පරීක්ෂා නොකරයි. එහෙත් ඔහුට යම් සමාධි නිමිත්තක් හොඳින් අල්ලාගෙන ඇත, හොඳින් මෙනෙහි කර ඇත, හොඳින් දරාගෙන ඇත, ප්‍රඥාවෙන් හොඳින් විනිවිද දැක ඇත.\n\nමහණෙනි, යම් යම් අයුරකින් යම් භික්ෂුවකගේ යම් සමාධි නිමිත්තක් මනාකොට ග්‍රහණය කරගෙන, මනාකොට මෙනෙහි කර, මනාකොට ධාරණය කර, ප්‍රඥාවෙන් මනාකොට විනිවිද දකිනු ලබයිද, ඒ ඒ අයුරින් ඔහු ඒ ධර්මයෙහි අර්ථ ප්‍රතිසංවේදී ද, ධර්ම ප්‍රතිසංවේදී ද වන්නේය. අර්ථ ප්‍රතිසංවේදී වූ ද, ධර්ම ප්‍රතිසංවේදී වූ ද ඔහුට ප්‍රමෝදය උපදී. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය උපදී. ප්‍රීතිමත් සිත් ඇත්තාගේ කයේ සංසිඳීම සිදු වේ. සංසිඳුනු කයක් ඇත්තා සැපය විඳියි. සැපයෙන් යුක්ත වූ තැනැත්තාගේ සිත සමාධිමත් වේ. මහණෙනි, අප්‍රමාදී වූ, වීර්යවන්ත වූ, දැඩි අධිෂ්ඨානයෙන් යුක්ත වූ භික්ෂුවක් වෙසෙද්දී, නොමිදුණු සිතක් වේ නම් එය මිදේ, නොක්ෂය වූ ආශ්‍රවයෝ වේ නම් ඔව්හු ක්ෂය වෙති, නොලැබූ අනුත්තර යෝගක්ඛේමය වේ නම් එය ලබයි යන මේ පස්වැනි විමුක්තායතනයයි.\n\n‘මහණෙනි, අප්‍රමාදී වූ, වීර්යවන්ත වූ, දැඩි අධිෂ්ඨානයෙන් යුක්ත වූ භික්ෂුවක් වෙසෙද්දී, නොමිදුණු සිතක් වේ නම් එය මිදේ, නොක්ෂය වූ ආශ්‍රවයෝ වේ නම් ඔව්හු ක්ෂය වෙති, නොලැබූ අනුත්තර යෝගක්ඛේමය වේ නම් එය ලබයි යන මේ පස් වැදෑරුම් විමුක්තායතනයෝය.’ සයවන සූත්‍රයයි.",
      "paliTitle": "Vimuttāyatanasuttaṃ"
    },
    {
      "number": 27,
      "pali": "‘‘Samādhiṃ, bhikkhave, bhāvetha appamāṇaṃ nipakā patissatā. Samādhiṃ, bhikkhave, bhāvayataṃ appamāṇaṃ nipakānaṃ patissatānaṃ pañca ñāṇāni paccattaññeva uppajjanti. Katamāni pañca? ‘Ayaṃ samādhi paccuppannasukho ceva āyatiñca sukhavipāko’ti paccattaññeva ñāṇaṃ uppajjati, ‘ayaṃ samādhi ariyo nirāmiso’ti paccattaññeva ñāṇaṃ uppajjati, ‘ayaṃ samādhi akāpurisasevito’ti [mahāpurisasevitoti (ka.)] paccattaññeva ñāṇaṃ uppajjati, ‘ayaṃ samādhi santo paṇīto paṭippassaddhaladdho ekodibhāvādhigato, na saṅkhāraniggayhavāritagato’ti [na ca sasaṅkhāraniggayhavāritappatitoti (sī.), na ca sasaṅkhāraniggayhavāritapattoti (syā.), na ca sasaṅkhāraniggayhavārivāvaṭoti (ka.), na sasaṅkhāraniggayhavāriyādhigatoti (?) dī. ni. 3.355; a. ni. 3.102; 9.27] paccattaññeva ñāṇaṃ uppajjati, ‘sato kho panāhaṃ imaṃ samāpajjāmi sato vuṭṭhahāmī’ti [so kho panāhaṃ imaṃ samādhiṃ satova samāpajjāmi, sato uṭṭhahāmīti (sī. syā. kaṃ.)] paccattaññeva ñāṇaṃ uppajjati. ‘‘Samādhiṃ, bhikkhave, bhāvetha appamāṇaṃ nipakā patissatā. Samādhiṃ, bhikkhave, bhāvayataṃ appamāṇaṃ nipakānaṃ patissatānaṃ imāni pañca ñāṇāni paccattaññeva uppajjantī’’ti. Sattamaṃ.",
      "english": "Monks, develop boundless concentration, being discerning and mindful. For those monks who develop boundless concentration, being discerning and mindful, five knowledges arise within themselves. Which five?\n\n‘This concentration is pleasant in the present and has a pleasant result in the future’ – this knowledge arises within oneself. ‘This concentration is noble and unworldly’ – this knowledge arises within oneself. ‘This concentration is practiced by great individuals’ – this knowledge arises within oneself. ‘This concentration is peaceful, sublime, attained through the tranquilization of defilements, achieved through unification of mind, and not brought about by the strenuous suppression or checking of mental formations’ – this knowledge arises within oneself. ‘Being mindful, I enter into this concentration, and being mindful, I emerge from it’ – this knowledge arises within oneself.\n\nMonks, develop boundless concentration, being discerning and mindful. For those monks who develop boundless concentration, being discerning and mindful, these five knowledges arise within themselves.",
      "sinhala": "මහණෙනි, නුවණැතිව, සිහි ඇතිව, අප්‍රමාණ වූ සමාධිය වඩන්න. මහණෙනි, අප්‍රමාණ වූ සමාධිය වඩන, නුවණැති, සිහි ඇති අයට මේ ඥාන පහ තමන් තුළින්ම උපදී. ඒ කවර පහක්ද?\n\n'මේ සමාධිය වර්තමානයේදීද සැප සහිතයි, අනාගතයේදීද සැප විපාක දෙන සුළුයි' යන ඥානය තමන් තුළින්ම උපදී. 'මේ සමාධිය ආර්ය වූ, නිරාමිස වූවකි' යන ඥානය තමන් තුළින්ම උපදී. 'මේ සමාධිය මහා පුරුෂයන් විසින් සේවනය කරනු ලබන්නකි' යන ඥානය තමන් තුළින්ම උපදී. 'මේ සමාධිය ශාන්ත වූවකි, ප්‍රණීත වූවකි, (ක්ලේශ) සංසිඳීමෙන් ලැබූවකි, ඒකාග්‍රභාවයට පැමිණීමෙන් ලැබූවකි, (සංස්කාරයන්) බලහත්කාරයෙන් යටපත් කිරීමෙන් හෝ වළක්වාලීමෙන් ඇතිකරගත් දෙයක් නොවේ' යන ඥානය තමන් තුළින්ම උපදී. 'මම මේ සමාධියට සිහි ඇතිවම සමවදිමි, සිහි ඇතිවම එයින් නැගිටිමි' යන ඥානය තමන් තුළින්ම උපදී.\n\nමහණෙනි, නුවණැතිව, සිහි ඇතිව, අප්‍රමාණ වූ සමාධිය වඩන්න. මහණෙනි, අප්‍රමාණ වූ සමාධිය වඩන, නුවණැති, සිහි ඇති අයට මේ ඥාන පහ තමන් තුළින්ම උපදී.",
      "paliTitle": "Samādhisuttaṃ"
    },
    {
      "number": 28,
      "pali": "‘‘Ariyassa, bhikkhave, pañcaṅgikassa sammāsamādhissa bhāvanaṃ desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamā ca, bhikkhave, ariyassa pañcaṅgikassa sammāsamādhissa bhāvanā? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati; nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hoti. Seyyathāpi, bhikkhave, dakkho nhāpako [nahāpako (sī. pī.)] vā nhāpakantevāsī vā kaṃsathāle nhānīyacuṇṇāni [nahānīyacuṇṇāni (sī. pī.)] ākiritvā udakena paripphosakaṃ paripphosakaṃ sanneyya. Sāyaṃ nhānīyapiṇḍi [sāssa nahānīyapiṇḍī (sī. syā. kaṃ.)] snehānugatā snehaparetā santarabāhirā phuṭā snehena, na ca paggharinī. Evamevaṃ kho, bhikkhave, bhikkhu imameva kāyaṃ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati; nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hoti. Ariyassa, bhikkhave, pañcaṅgikassa sammāsamādhissa ayaṃ paṭhamā bhāvanā. ‘‘Puna caparaṃ, bhikkhave, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati; nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṃ hoti. Seyyathāpi, bhikkhave, udakarahado gambhīro ubbhidodako [ubbhitodako (syā. kaṃ. ka.)]. Tassa nevassa puratthimāya disāya udakassa āyamukhaṃ, na pacchimāya disāya udakassa āyamukhaṃ, na uttarāya disāya udakassa āyamukhaṃ, na dakkhiṇāya disāya udakassa āyamukhaṃ, devo ca kālena kālaṃ sammā dhāraṃ nānuppaveccheyya [devo ca na kālena… anupaveccheyya (dī. ni. 1.227 ādayo; ma. ni. 2.251 ādayo]. Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṃ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya; nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṃ assa. Evamevaṃ kho, bhikkhave, bhikkhu imameva kāyaṃ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati; nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṃ hoti. Ariyassa, bhikkhave, pañcaṅgikassa sammāsamādhissa ayaṃ dutiyā bhāvanā. ‘‘Puna caparaṃ, bhikkhave, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati; nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṃ hoti. Seyyathāpi, bhikkhave, uppaliniyaṃ vā paduminiyaṃ vā puṇḍarīkiniyaṃ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakānuggatāni anto nimuggaposīni. Tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni paripūrāni paripphuṭāni; nāssa kiñci sabbāvataṃ uppalānaṃ vā padumānaṃ vā puṇḍarīkānaṃ vā sītena vārinā apphuṭaṃ assa. Evamevaṃ kho, bhikkhave, bhikkhu imameva kāyaṃ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati; nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṃ hoti. Ariyassa, bhikkhave, pañcaṅgikassa sammāsamādhissa ayaṃ tatiyā bhāvanā. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sukhassa ca pahānā …pe… catutthaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ parisuddhena cetasā pariyodātena pharitvā nisinno hoti; nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṃ hoti. Seyyathāpi, bhikkhave, puriso odātena vatthena sasīsaṃ pārupitvā nisinno assa; nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṃ assa. Evamevaṃ kho, bhikkhave, bhikkhu imameva kāyaṃ parisuddhena cetasā pariyodātena pharitvā nisinno hoti; nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṃ hoti. Ariyassa, bhikkhave, pañcaṅgikassa sammāsamādhissa ayaṃ catutthā bhāvanā. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno paccavekkhaṇānimittaṃ suggahitaṃ hoti sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya. Seyyathāpi, bhikkhave, aññova aññaṃ [añño vā aññaṃ vā (sī.), añño vā aññaṃ (syā. kaṃ.), añño aññaṃ (?)] paccavekkheyya, ṭhito vā nisinnaṃ paccavekkheyya, nisinno vā nipannaṃ paccavekkheyya. Evamevaṃ kho, bhikkhave, bhikkhuno paccavekkhaṇānimittaṃ suggahitaṃ hoti sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya. Ariyassa, bhikkhave, pañcaṅgikassa sammāsamādhissa ayaṃ pañcamā [pañcamī (sī.)] bhāvanā. Evaṃ bhāvite kho, bhikkhave, bhikkhu [evaṃ bhāvite kho bhikkhave (sī.)] ariye pañcaṅgike sammāsamādhimhi evaṃ bahulīkate yassa yassa abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘Seyyathāpi, bhikkhave, udakamaṇiko ādhāre ṭhapito pūro udakassa samatittiko kākapeyyo. Tamenaṃ balavā puriso yato yato āvajjeyya [āvaṭṭeyya (syā. kaṃ.)], āgaccheyya udaka’’nti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho, bhikkhave, bhikkhu evaṃ bhāvite ariye pañcaṅgike sammāsamādhimhi evaṃ bahulīkate yassa yassa abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘Seyyathāpi, bhikkhave, same bhūmibhāge pokkharaṇī caturaṃsā ālibaddhā pūrā udakassa samatittikā kākapeyyā. Tamenaṃ balavā puriso yato yato āliṃ muñceyya, āgaccheyya udaka’’nti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho, bhikkhave, bhikkhu evaṃ bhāvite ariye pañcaṅgike sammāsamādhimhi evaṃ bahulīkate yassa yassa abhiññāsacchikaraṇīyassa dhammassa…pe… sati sati āyatane. ‘‘Seyyathāpi, bhikkhave, subhūmiyaṃ catumahāpathe [cātummahāpathe (sī. pī.), catummahāpathe (syā. kaṃ.)] ājaññaratho yutto assa ṭhito odhastapatodo. Tamenaṃ dakkho yoggācariyo assadammasārathi abhiruhitvā vāmena hatthena rasmiyo gahetvā dakkhiṇena hatthena patodaṃ gahetvā yenicchakaṃ yadicchakaṃ sāreyyapi paccāsāreyyapi. Evamevaṃ kho, bhikkhave, bhikkhu evaṃ bhāvite ariye pañcaṅgike sammāsamādhimhi evaṃ bahulīkate yassa yassa abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ – ekopi hutvā bahudhā assaṃ…pe… yāva brahmalokāpi kāyena vasaṃ vatteyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇeyyaṃ – dibbe ca mānuse ca ye dūre santike cā’ti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace akaṅkhati – ‘parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajāneyyaṃ – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajāneyyaṃ, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajāneyyaṃ, sadosaṃ vā cittaṃ… vītadosaṃ vā cittaṃ… samohaṃ vā cittaṃ… vītamohaṃ vā cittaṃ… saṃkhittaṃ vā cittaṃ… vikkhittaṃ vā cittaṃ… mahaggataṃ vā cittaṃ… amahaggataṃ vā cittaṃ… sauttaraṃ vā cittaṃ… anuttaraṃ vā cittaṃ… samāhitaṃ vā cittaṃ… asamāhitaṃ vā cittaṃ… vimuttaṃ vā cittaṃ… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ pubbenivāsaṃ anussareyyaṃ, seyyathidaṃ – ekampi jātiṃ, dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, I will teach you the development of the Noble One's five-factored right concentration. Listen to it, attend carefully, I shall speak.” “Yes, venerable sir,” those monks replied to the Bhagavā. The Bhagavā said this: “And what, monks, is the development of the Noble One's five-factored right concentration? Here, monks, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and abides in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, filled with joy and happiness. He saturates, steeps, fills, and pervades this very body with the joy and happiness born of seclusion; there is no part of his entire body not pervaded by the joy and happiness born of seclusion. Just as, monks, a skilled bath attendant or their apprentice, having sprinkled bath powder into a bronze basin, would moisten it thoroughly with water. That ball of bath powder, thoroughly permeated and saturated with moisture, is moist throughout, both inside and out, yet it does not ooze. In the same way, monks, a monk saturates, steeps, fills, and pervades this very body with the joy and happiness born of seclusion; there is no part of his entire body not pervaded by the joy and happiness born of seclusion. This, monks, is the first development of the Noble One's five-factored right concentration.\n\n“Furthermore, monks, with the fading away of applied thought and sustained thought, from the internal tranquility and unification of mind, he enters and abides in the second jhāna, which is free from applied thought and sustained thought, born of concentration, filled with joy and happiness. He saturates, steeps, fills, and pervades this very body with the joy and happiness born of concentration; there is no part of his entire body not pervaded by the joy and happiness born of concentration. Just as, monks, there might be a deep lake with an underground spring. It would have no inlet for water from the east, west, north, or south, and the sky would not provide a proper downpour from time to time. Yet, cool streams of water would surge up from within that very lake and saturate, steep, fill, and pervade the lake with cool water; there would be no part of the entire lake not pervaded by cool water. In the same way, monks, a monk saturates, steeps, fills, and pervades this very body with the joy and happiness born of concentration; there is no part of his entire body not pervaded by the joy and happiness born of concentration. This, monks, is the second development of the Noble One's five-factored right concentration.\n\n“Furthermore, monks, with the fading of joy as well, he abides in equanimity, mindful and clearly comprehending, and experiences happiness with the body; he enters and abides in the third jhāna, of which the Noble Ones declare, ‘He has a pleasant abiding who is equanimous and mindful.’ He saturates, steeps, fills, and pervades this very body with happiness free from joy; there is no part of his entire body not pervaded by happiness free from joy. Just as, monks, in a pond of blue lotuses, or red lotuses, or white lotuses, some blue lotuses, or red lotuses, or white lotuses, born in the water, grown in the water, and remaining immersed in the water, nourished from within the water. These, from tip to root, would be saturated, steeped, filled, and pervaded with cool water; there would be no part of the entire blue lotuses, or red lotuses, or white lotuses not pervaded by cool water. In the same way, monks, a monk saturates, steeps, fills, and pervades this very body with happiness free from joy; there is no part of his entire body not pervaded by happiness free from joy. This, monks, is the third development of the Noble One's five-factored right concentration.\n\n“Furthermore, monks, with the abandonment of pleasure and pain, and with the prior disappearance of joy and grief, he enters and abides in the fourth jhāna, which is neither painful nor pleasant, and purified by equanimity and mindfulness. He sits pervading this very body with a pure, bright mind; there is no part of his entire body not pervaded by a pure, bright mind. Just as, monks, a man might sit wrapped from head to foot in a white cloth; there would be no part of his entire body not pervaded by the white cloth. In the same way, monks, a monk sits pervading this very body with a pure, bright mind; there is no part of his entire body not pervaded by a pure, bright mind. This, monks, is the fourth development of the Noble One's five-factored right concentration.\n\n“Furthermore, monks, for a monk, the sign for reviewing is well-grasped, well-attended to, well-established, and well-penetrated by wisdom. Just as, monks, one would clearly perceive another.”\n\nOne should reflect on another; one standing should reflect on one who is sitting; one sitting should reflect on one who is lying down. In the same way, monks, for a bhikkhu, the sign for reflection is well-grasped, well-attended to, well-sustained, and well-penetrated by wisdom. Monks, this is the fifth development of the Noble Five-factored Right Concentration. When, monks, a bhikkhu has thus developed and made abundant the Noble Five-factored Right Concentration, he inclines his mind towards whatever phenomenon is to be realized by direct knowledge for its direct realization, and he attains the capacity to be a witness to it, whenever the occasion arises.\n\nJust as, monks, a water pot placed on a stand, full to the brim with water, such that a crow could drink from it. If a strong man were to tip it in any direction, water would flow out. \"Yes, venerable sir.\" Even so, monks, when a bhikkhu has thus developed and made abundant the Noble Five-factored Right Concentration, he inclines his mind towards whatever phenomenon is to be realized by direct knowledge for its direct realization, and he attains the capacity to be a witness to it, whenever the occasion arises.\n\nJust as, monks, a four-sided pond with embankments on a level piece of ground, full to the brim with water, such that a crow could drink from it. If a strong man were to open an outlet in any embankment, water would flow out. \"Yes, venerable sir.\" Even so, monks, when a bhikkhu has thus developed and made abundant the Noble Five-factored Right Concentration, he inclines his mind towards whatever phenomenon is to be realized by direct knowledge for its direct realization, and he attains the capacity to be a witness to it, whenever the occasion arises.\n\nJust as, monks, on level ground at a crossroads, a thoroughbred chariot might be yoked and standing, with its goad laid aside. A skilled trainer, a master horse-tamer, mounting it, holding the reins with his left hand and the goad with his right hand, could drive it wherever he wished, make it go forwards or backwards as he pleased. Even so, monks, when a bhikkhu has thus developed and made abundant the Noble Five-factored Right Concentration, he inclines his mind towards whatever phenomenon is to be realized by direct knowledge for its direct realization, and he attains the capacity to be a witness to it, whenever the occasion arises.\n\nIf he wishes, \"May I experience various kinds of psychic powers: being one, may I become many; being many, may I become one. May I appear and vanish. May I go unhindered through walls, ramparts, and mountains as if through space. May I dive in and out of the earth as if in water. May I walk on water without sinking as if on land. May I travel through the sky cross-legged like a winged bird. May I touch and stroke with my hand the moon and sun, so mighty and powerful. May I exercise mastery with my body even to the Brahma world\" – he attains the capacity to be a witness to it, whenever the occasion arises.\n\nIf he wishes, \"May I hear with the divine ear-element, purified and surpassing that of humans, both kinds of sounds, divine and human, those far and those near\" – he attains the capacity to be a witness to it, whenever the occasion arises.\n\nIf he wishes, \"May I understand the minds of other beings, other individuals, having encompassed them with my own mind: may I discern a mind with lust as 'a mind with lust'; a mind without lust as 'a mind without lust'; a mind with hatred as 'a mind with hatred'; a mind without hatred as 'a mind without hatred'; a mind with delusion as 'a mind with delusion'; a mind without delusion as 'a mind without delusion'; a contracted mind as 'a contracted mind'; a scattered mind as 'a scattered mind'; a developed mind as 'a developed mind'; an undeveloped mind as 'an undeveloped mind'; a mind with a higher state as 'a mind with a higher state'; a mind without a higher state as 'a mind without a higher state'; a concentrated mind as 'a concentrated mind'; an unconcentrated mind as 'an unconcentrated mind'; a freed mind as 'a freed mind'; an unfreed mind as 'an unfreed mind'\" – he attains the capacity to be a witness to it, whenever the occasion arises.\n\nIf he wishes, \"May I recollect my manifold past existences, that is: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births; many aeons of cosmic expansion, many aeons of cosmic contraction, many aeons of cosmic expansion and contraction. 'There I was named thus, of such a clan, of such a complexion, of such food, experiencing such pleasure and pain, having such a lifespan; passing away from there, I reappeared elsewhere; there too I was named thus, of such a clan, of such a complexion, of such food, experiencing such pleasure and pain, having such a lifespan; passing away from there, I reappeared here.' Thus may I recollect my manifold past existences, with their mode and their detail\" – he attains the capacity to be a witness to it, whenever the occasion arises.\n\nIf he wishes, \"May I see with the divine eye, purified and surpassing that of humans, beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and discern how beings fare according to their karma\" – he attains the capacity to be a witness to it, whenever the occasion arises.\n\nIf he wishes, \"May I, by the destruction of the taints, myself realize with direct knowledge, here and now, the taintless liberation of mind and liberation by wisdom, and having entered upon it, dwell therein\" – he attains the capacity to be a witness to it, whenever the occasion arises.",
      "sinhala": "මහණෙනි, ආර්ය වූ පස්අඟින් යුත් සම්මා සමාධියේ භාවනාව මම දේශනා කරන්නෙමි. එය අසන්න, මනා කොට මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\" \"එසේය, ස්වාමීනි\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක: \"මහණෙනි, ආර්ය වූ පස්අඟින් යුත් සම්මා සමාධියේ භාවනාව කුමක්ද? මහණෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය සහිත වූ පළමුවන ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ කයම විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් තෙත් කරයි, පුරවයි, වසා පතුරුවයි; ඔහුගේ මුළු කයෙහිම විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, යම්සේ දක්ෂ නානකරුවෙක් හෝ නානකරු අතවැසියෙක් ලෝකඩ තැටියක නාන කුඩු දමා, ටිකෙන් ටික ජලය ඉස ඉස මනා කොට අනා ගන්නේය. ඒ නාන පිඬ තෙලෙන් යුක්තව, තෙල් වැළඳගෙන, ඇතුළතින්ද පිටතින්ද තෙලෙන් ස්පර්ශ වී පවතී, එහෙත් එයින් තෙල් ගලා නොයයි. එලෙසින්ම මහණෙනි, භික්ෂුව මේ කයම විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් තෙත් කරයි, පුරවයි, වසා පතුරුවයි; ඔහුගේ මුළු කයෙහිම විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, ආර්ය වූ පස්අඟින් යුත් සම්මා සමාධියේ මෙය පළමුවන භාවනාවයි.\n\nනැවතත් තවද මහණෙනි, භික්ෂුව විතර්ක විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මයෙහි පැහැදීමෙන්, සිතේ එකඟතාවයෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය සහිත වූ දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ කයම සමාධියෙන් හටගත් ප්‍රීතිය හා සැපයෙන් තෙත් කරයි, පුරවයි, වසා පතුරුවයි; ඔහුගේ මුළු කයෙහිම සමාධියෙන් හටගත් ප්‍රීතිය හා සැපයෙන් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, යම්සේ ගැඹුරු වූ, උල්පත් ජලය සහිත වූ ජල පොකුණක් වේද, එහි නැගෙනහිර දිශාවෙන් ජලය පැමිණෙන මුවදොරක් නැත්තේය, බටහිර දිශාවෙන් ජලය පැමිණෙන මුවදොරක් නැත්තේය, උතුරු දිශාවෙන් ජලය පැමිණෙන මුවදොරක් නැත්තේය, දකුණු දිශාවෙන් ජලය පැමිණෙන මුවදොරක් නැත්තේය, වැස්සද කලින් කලට මනා වර්ෂාවක් නොදෙන්නේය. එහෙත් ඒ ජල පොකුණෙන්ම සිසිල් දිය දහරා ඉහළට විහිදී ඒ ජල පොකුණම සිසිල් ජලයෙන් තෙත් කරන්නේය, පුරවන්නේය, වසා පතුරුවන්නේය; ඒ මුළු ජල පොකුණෙහිම සිසිල් ජලයෙන් ස්පර්ශ නොවූ කිසිවක් නොවන්නේය. එලෙසින්ම මහණෙනි, භික්ෂුව මේ කයම සමාධියෙන් හටගත් ප්‍රීතිය හා සැපයෙන් තෙත් කරයි, පුරවයි, වසා පතුරුවයි; ඔහුගේ මුළු කයෙහිම සමාධියෙන් හටගත් ප්‍රීතිය හා සැපයෙන් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, ආර්ය වූ පස්අඟින් යුත් සම්මා සමාධියේ මෙය දෙවන භාවනාවයි.\n\nනැවතත් තවද මහණෙනි, භික්ෂුව ප්‍රීතිය කෙරෙහිද විරාගය හෙවත් නොඇලීම හේතුවෙන්, උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව වාසය කරයි, සුවය ශරීරයෙන් අත්දකියි; යමක් ආර්යයෝ 'උපේක්ෂා සහගතය, සිහි නුවණින් යුක්තය, සුවයෙන් වාසය කරයි' යැයි ප්‍රකාශ කරත්ද, ඒ තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ කයම ප්‍රීති රහිත සැපයෙන් තෙත් කරයි, පුරවයි, වසා පතුරුවයි; ඔහුගේ මුළු කයෙහිම ප්‍රීති රහිත සැපයෙන් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, යම්සේ නිල් උපුල් පොකුණක හෝ පියුම් පොකුණක හෝ ඕලු පොකුණක ජලයෙහි හටගත්, ජලයෙහි වැඩුනු, ජලයෙන් යටවී ඇතුළතින්ම පෝෂණය වන ඇතැම් නිල් උපුල් හෝ පියුම් හෝ ඕලු මල් වේද, ඒවා අග සිට මුල දක්වාම සිසිල් ජලයෙන් තෙත්වී, පිරී, වසාගෙන, පැතිරී පවතී; ඒ මුළු නිල් උපුල් හෝ පියුම් හෝ ඕලු මල් සමූහයෙහිම සිසිල් ජලයෙන් ස්පර්ශ නොවූ කිසිවක් නොවන්නේය. එලෙසින්ම මහණෙනි, භික්ෂුව මේ කයම ප්‍රීති රහිත සැපයෙන් තෙත් කරයි, පුරවයි, වසා පතුරුවයි; ඔහුගේ මුළු කයෙහිම ප්‍රීති රහිත සැපයෙන් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, ආර්ය වූ පස්අඟින් යුත් සම්මා සමාධියේ මෙය තෙවන භාවනාවයි.\n\nනැවතත් තවද මහණෙනි, භික්ෂුව සැපයද දුරු කිරීමෙන්, දුකද දුරු කිරීමෙන්, පෙර තිබූ සොම්නස් දොම්නස් අතුරුදහන් වීමෙන්, දුක් රහිත වූද, සුව රහිත වූද, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සතරවන ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ කයම පිරිසිදු වූ, ප්‍රභාවත් වූ සිතින් වසාගෙන වාසය කරයි; ඔහුගේ මුළු කයෙහිම පිරිසිදු වූ, ප්‍රභාවත් වූ සිතින් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, යම්සේ පුරුෂයෙක් පිරිසිදු සුදු වස්ත්‍රයකින් හිසද සමඟ පෙරවාගෙන වාඩි වී සිටින්නේය; ඔහුගේ මුළු කයෙහිම පිරිසිදු සුදු වස්ත්‍රයෙන් ස්පර්ශ නොවූ කිසිවක් නොවන්නේය. එලෙසින්ම මහණෙනි, භික්ෂුව මේ කයම පිරිසිදු වූ, ප්‍රභාවත් වූ සිතින් වසාගෙන වාසය කරයි; ඔහුගේ මුළු කයෙහිම පිරිසිදු වූ, ප්‍රභාවත් වූ සිතින් ස්පර්ශ නොවූ කිසිවක් නොපවතී. මහණෙනි, ආර්ය වූ පස්අඟින් යුත් සම්මා සමාධියේ මෙය සතරවන භාවනාවයි.\n\nනැවතත් තවද මහණෙනි, භික්ෂුවට (ධ්‍යානයෙන් නැගී සිටි පසු) නැවත විමසා බැලීමේ නිමිත්ත (එනම් ධ්‍යාන අංග) මනා කොට ග්‍රහණය කරගෙන ඇත්තේය, මනා කොට මෙනෙහි කර ඇත්තේය, මනා කොට තහවුරු කරගෙන ඇත්තේය, ප්‍රඥාවෙන් මනා කොට විනිවිද දැක ඇත්තේය. මහණෙනි, යම්සේ යමෙක් එක් දෙයක් අනෙක් දෙයකින් මනා කොට වෙන්කොට හඳුනාගන්නේය.\n\nමහණෙනි, එක් භික්ෂුවක් තවත් භික්ෂුවක් සලකා බලන්නා සේ, සිටගෙන සිටින තැනැත්තා වාඩි වී සිටින තැනැත්තා සලකා බලයි, වාඩි වී සිටින තැනැත්තා නිදාගෙන සිටින තැනැත්තා සලකා බලයි. මහණෙනි, එපරිද්දෙන්ම, භික්ෂුවට (තමන්ගේම) ප්‍රත්‍යවේක්ෂා කරන නිමිත්ත මනාකොට ගත් එකක් වේ, මනාකොට මෙනෙහි කරන ලද්දක් වේ, මනාකොට දරාගන්නා ලද්දක් වේ, ප්‍රඥාවෙන් මනාකොට අවබෝධ කරන ලද්දක් වේ. මහණෙනි, මේ ආර්ය අංග පහකින් යුත් සම්මාසමාධියේ මේ පස්වන භාවනාවයි.\n\nමහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද, ආර්ය අංග පහකින් යුත් සම්මාසමාධිය ඇති භික්ෂුව යම් යම් අභිඥාවන්ගෙන් සාක්ෂාත් කළ යුතු ධර්මයක් වෙත සිත නැඹුරු කරන්නේ නම්, අභිඥාවෙන් ප්‍රත්‍යක්ෂ කිරීම පිණිස සිත යොමු කරන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\n\"මහණෙනි, යම් සේ දිය බඳුනක් ආධාරකයක් මත තබා තිබේ නම්, එය ජලයෙන් පිරී ඉතිරී ගොස්, කපුටෙකුට වුවද පහසුවෙන් පානය කළ හැකි තරම් වේ නම්, ඒ දිය බඳුන යම් බලවත් පුරුෂයෙක් යම් යම් තැනකින් ඇල කරන්නේ නම්, ජලය ගලා එන්නේ නේද?\" \"එසේය, ස්වාමීනී.\" \"මහණෙනි, එපරිද්දෙන්ම, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද, ආර්ය අංග පහකින් යුත් සම්මාසමාධිය ඇති භික්ෂුව යම් යම් අභිඥාවන්ගෙන් සාක්ෂාත් කළ යුතු ධර්මයක් වෙත සිත නැඹුරු කරන්නේ නම්, අභිඥාවෙන් ප්‍රත්‍යක්ෂ කිරීම පිණිස සිත යොමු කරන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\"\n\n\"මහණෙනි, යම් සේ සමතලා භූමි භාගයක සතරැස් පොකුණක් බැම්මෙන් වටකරන ලද්දක් වේ නම්, එය ජලයෙන් පිරී ඉතිරී ගොස්, කපුටෙකුට වුවද පහසුවෙන් පානය කළ හැකි තරම් වේ නම්, ඒ පොකුණ යම් බලවත් පුරුෂයෙක් යම් යම් තැනකින් බැම්ම මුදා හරින්නේ නම්, ජලය ගලා එන්නේ නේද?\" \"එසේය, ස්වාමීනී.\" \"මහණෙනි, එපරිද්දෙන්ම, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද, ආර්ය අංග පහකින් යුත් සම්මාසමාධිය ඇති භික්ෂුව යම් යම් අභිඥාවන්ගෙන් සාක්ෂාත් කළ යුතු ධර්මයක් වෙත සිත නැඹුරු කරන්නේ නම්, අභිඥාවෙන් ප්‍රත්‍යක්ෂ කිරීම පිණිස සිත යොමු කරන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\"\n\n\"මහණෙනි, යම් සේ හොඳ භූමියක, සතර මහා මාර්ග හමුවන තැනක, ආජානීය අශ්වයන් යෙදූ රථයක් කසය අතහැර දමා තිබෙන තත්ත්වයෙන් නවතා තිබේ නම්, ඒ රථයට දක්ෂ, පුහුණු වූ, අශ්වයන් දමනය කිරීමේ දක්ෂ සාරථියෙක් නැඟී සිට, වම් අතින් රැහැන් ගෙන, දකුණු අතින් කසය ගෙන, කැමති කැමති තැනට ඉදිරියටත්, පසුපසටත් ගෙන යන්නේ නම්, මහණෙනි, එපරිද්දෙන්ම, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද, ආර්ය අංග පහකින් යුත් සම්මාසමාධිය ඇති භික්ෂුව යම් යම් අභිඥාවන්ගෙන් සාක්ෂාත් කළ යුතු ධර්මයක් වෙත සිත නැඹුරු කරන්නේ නම්, අභිඥාවෙන් ප්‍රත්‍යක්ෂ කිරීම පිණිස සිත යොමු කරන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\"\n\nඔහු යම් හෙයකින් ‘අනෙක විධ වූ ඍද්ධි විධයන් ප්‍රත්‍යක්ෂ කරන්නෙමි – එකෙකු වී බහු ආකාර වන්නෙමි, බොහෝ වී එකෙකු වන්නෙමි, නොදැකීමෙහි සිටීමෙහි ශක්තිය, බිත්තියෙන්, ප්‍රාකාරයෙන්, පර්වතයෙන් කිසිදු අවහිරයකින් තොරව යන්නෙමි, පොළොවේ කිමිදී පීනන්නාක් මෙන් යන්නෙමි, ජලය මත නොබෙදෙමින් යන්නෙමි, අහසින් පියාසර කරන්නාක් මෙන් පලක් බැඳගෙන යන්නෙමි, සඳ හා හිරු දෙඅතින් අල්ලා පිරිමදින්නෙමි, බ්‍රහ්ම ලෝකය දක්වාද කයින් වසඟය පවත්වන්නෙමි’ යි කැමති වන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් ‘විශුද්ධ වූ, මනුෂ්‍යයන් ඉක්මවා ගිය දිව්‍ය ශ්‍රවණ ධාතුවෙන් දෙයාකාර ශබ්ද අසන්නෙමි – දිව්‍ය ශබ්දද, මනුෂ්‍ය ශබ්දද, දුරින් ඇති ද, ළඟින් ඇති ද යන මේ සියල්ල’ යි කැමති වන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් ‘අන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිතින් (තම) සිත වටකරගෙන දැනගන්නෙමි – රාගය සහිත සිතක් නම්, රාගය සහිත සිතක්යැයි දැනගන්නෙමි, රාගය රහිත සිතක් නම්, රාගය රහිත සිතක්යැයි දැනගන්නෙමි, ද්වේෂය සහිත සිතක් නම්, ද්වේෂය සහිත සිතක්යැයි දැනගන්නෙමි, ද්වේෂය රහිත සිතක් නම්, ද්වේෂය රහිත සිතක්යැයි දැනගන්නෙමි, මෝහය සහිත සිතක් නම්, මෝහය සහිත සිතක්යැයි දැනගන්නෙමි, මෝහය රහිත සිතක් නම්, මෝහය රහිත සිතක්යැයි දැනගන්නෙමි, හකුලුවන ලද සිතක් නම්, හකුලුවන ලද සිතක්යැයි දැනගන්නෙමි, විසිරුණු සිතක් නම්, විසිරුණු සිතක්යැයි දැනගන්නෙමි, මහාග්‍රත සිතක් නම්, මහාග්‍රත සිතක්යැයි දැනගන්නෙමි, අමහාග්‍රත සිතක් නම්, අමහාග්‍රත සිතක්යැයි දැනගන්නෙමි, තවදුරටත් දියුණු කළ යුතු සිතක් නම්, තවදුරටත් දියුණු කළ යුතු සිතක්යැයි දැනගන්නෙමි, තවදුරටත් දියුණු කිරීමට නැති සිතක් නම්, තවදුරටත් දියුණු කිරීමට නැති සිතක්යැයි දැනගන්නෙමි, සමාධියට පත් වූ සිතක් නම්, සමාධියට පත් වූ සිතක්යැයි දැනගන්නෙමි, සමාධියට පත් නොවූ සිතක් නම්, සමාධියට පත් නොවූ සිතක්යැයි දැනගන්නෙමි, විමුක්ත සිතක් නම්, විමුක්ත සිතක්යැයි දැනගන්නෙමි, අවිමුක්ත සිතක් නම්, අවිමුක්ත සිතක්යැයි දැනගන්නෙමි’ යි කැමති වන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් ‘අනෙක විධ වූ පූර්ව නිවාසයන් සිහි කරන්නෙමි, එනම් – එක ජාතියක් ද, දෙක ජාති ද, තුන ජාති ද, සතර ජාති ද, පහ ජාති ද, දස ජාති ද, විසි ජාති ද, තිස් ජාති ද, සතළිස් ජාති ද, පනස් ජාති ද, සිය ජාති ද, දහස් ජාති ද, ලක්ෂයක් ජාති ද, අනේක සංවට්ට කල්පයන් ද, අනේක විවට්ට කල්පයන් ද, අනේක සංවට්ට-විවට්ට කල්පයන් ද, ‘අසවල් තැන මම මෙවන් නමකින්, මෙවන් ගෝත්‍රයකින්, මෙවන් වර්ණයකින්, මෙවන් ආහාරයකින්, මෙවන් සැප-දුක් විඳීමකින්, මෙවන් ආයුෂයකින් යුතුව විසූයෙමි. එතැනින් චුතව අසවල් තැන ඉපදුණෙමි. එහිද මෙවන් නමකින්, මෙවන් ගෝත්‍රයකින්, මෙවන් වර්ණයකින්, මෙවන් ආහාරයකින්, මෙවන් සැප-දුක් විඳීමකින්, මෙවන් ආයුෂයකින් යුතුව විසූයෙමි. එතැනින් චුතව මෙතැන උපන්නෙමි’ යි මෙසේ ආකාර සහිතව, අරමුණු සහිතව, අනෙක විධ වූ පූර්ව නිවාසයන් සිහි කරන්නෙමි’ යි කැමති වන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් ‘විශුද්ධ වූ, මනුෂ්‍යයන් ඉක්මවා ගිය දිව්‍ය චක්ෂුසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගතියෙහි උපදින, දුර්ගතියෙහි උපදින සත්වයන් දක්නෙමි. කර්මානුකූලව උපදින සත්වයන් දැනගන්නෙමි’ යි කැමති වන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් ‘ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, (එය) සාක්ෂාත් කරගෙන වාසය කරන්නෙමි’ යි කැමති වන්නේ නම්, ඒ ඒ ආයතනයන්හි සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.",
      "paliTitle": "Pañcaṅgikasuttaṃ"
    },
    {
      "number": 29,
      "pali": "‘‘Pañcime, bhikkhave, caṅkame ānisaṃsā. Katame pañca? Addhānakkhamo hoti, padhānakkhamo hoti, appābādho hoti, asitaṃ pītaṃ khāyitaṃ sāyitaṃ sammā pariṇāmaṃ gacchati, caṅkamādhigato samādhi ciraṭṭhitiko hoti. Ime kho, bhikkhave, pañca caṅkame ānisaṃsā’’ti. Navamaṃ.",
      "english": "Monastics, there are these five advantages in walking meditation. Which five? One becomes capable of enduring long journeys; one becomes capable of sustained exertion in practice; one becomes free from illness; what has been eaten, drunk, chewed, and tasted is properly digested; and the concentration attained through walking meditation endures for a long time. These, monastics, are the five advantages in walking meditation.",
      "sinhala": "මහණෙනි, චංක්‍රමණයෙහි ආනිසංස පහක් ඇත. ඒ පහ කවරේද? දිගු ගමනට ඔරොත්තු දීමේ හැකියාව ඇතිවේ, වීර්යයෙන් යුතුව ක්‍රියා කිරීමට සමත් වේ, ආබාධ රහිත වේ, කන ලද, පානය කරන ලද, සපා කන ලද, රස විඳින ලද ආහාර පාන මනා කොට දිරවයි, චංක්‍රමණයෙන් ලැබූ සමාධිය බොහෝ කල් පවතී. මහණෙනි, චංක්‍රමණයෙහි ආනිසංස මේ පහය.",
      "paliTitle": "Caṅkamasuttaṃ"
    },
    {
      "number": 30,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena icchānaṅgalaṃ nāma kosalānaṃ brāhmaṇagāmo tadavasari. Tatra sudaṃ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Assosuṃ kho icchānaṅgalakā [icchānaṅgalikā (sī.) a. ni. 6.42; a. ni. 8.86] brāhmaṇagahapatikā – ‘‘samaṇo khalu bho gotamo sakyaputto sakyakulā pabbajito icchānaṅgalaṃ anuppatto; icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi, satthā devamanussānaṃ buddho bhagavāti. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti. Atha kho icchānaṅgalakā brāhmaṇagahapatikā tassā rattiyā accayena pahūtaṃ khādanīyaṃ bhojanīyaṃ ādāya yena icchānaṅgalavanasaṇḍo tenupasaṅkamiṃsu; upasaṅkamitvā bahidvārakoṭṭhake aṭṭhaṃsu uccāsaddamahāsaddā. Tena kho pana samayena āyasmā nāgito bhagavato upaṭṭhāko hoti. Atha kho bhagavā āyasmantaṃ nāgitaṃ āmantesi – ‘‘ke pana kho, nāgita, uccāsaddamahāsaddā, kevaṭṭā maññe macchavilope’’ti? ‘‘Ete, bhante, icchānaṅgalakā brāhmaṇagahapatikā pahūtaṃ khādanīyaṃ bhojanīyaṃ ādāya bahidvārakoṭṭhake ṭhitā bhagavantaññeva uddissa bhikkhusaṅghañcā’’ti. ‘‘Māhaṃ, nāgita, yasena samāgamaṃ, mā ca mayā yaso. Yo kho, nāgita, nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī assa akicchalābhī akasiralābhī, yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. So taṃ [sohaṃ (ka.), so (syā. kaṃ.)] mīḷhasukhaṃ middhasukhaṃ lābhasakkārasilokasukhaṃ sādiyeyyā’’ti. ‘‘Adhivāsetu dāni, bhante, bhagavā, adhivāsetu sugato; adhivāsanakālo dāni, bhante, bhagavato. Yena yeneva dāni bhagavā gamissati taṃninnāva gamissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Seyyathāpi, bhante, thullaphusitake deve vassante yathāninnaṃ udakāni pavattanti; evamevaṃ kho, bhante, yena yeneva dāni bhagavā gamissati, taṃninnāva gamissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Taṃ kissa hetu? Tathā hi, bhante, bhagavato sīlapaññāṇa’’nti. ‘‘Māhaṃ, nāgita, yasena samāgamaṃ, mā ca mayā yaso. Yo kho, nāgita, nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī assa akicchalābhī akasiralābhī, yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī. So taṃ mīḷhasukhaṃ middhasukhaṃ lābhasakkārasilokasukhaṃ sādiyeyya. Asitapītakhāyitasāyitassa kho, nāgita, uccārapassāvo – eso tassa nissando. Piyānaṃ kho, nāgita, vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā – eso tassa nissando. Asubhanimittānuyogaṃ anuyuttassa kho, nāgita, subhanimitte pāṭikulyatā [paṭikkūlatā (sī.), paṭikkūlyatā (syā. kaṃ.)] saṇṭhāti – eso tassa nissando. Chasu kho, nāgita, phassāyatanesu aniccānupassino viharato phasse pāṭikulyatā saṇṭhāti – eso tassa nissando. Pañcasu kho, nāgita, upādānakkhandhesu udayabbayānupassino viharato upādāne pāṭikulyatā saṇṭhāti – eso tassa nissando’’ti. Dasamaṃ. ",
      "english": "Thus have I heard. On one occasion the Blessed One was touring through the Kosalan country with a large community of monastics, and eventually arrived at a brahmin village of the Kosalans named Icchānaṅgala. There, the Blessed One stayed in Icchānaṅgala, in the Icchānaṅgala forest grove. The brahmin householders of Icchānaṅgala heard, \"The recluse Gotama, a Sakyan son who has gone forth from the Sakyan clan, has arrived at Icchānaṅgala and is staying in the Icchānaṅgala forest grove.\" This good renown has spread concerning that Master Gotama: \"Indeed, the Blessed One is an Arahant, a Perfectly Self-Awakened One, accomplished in true knowledge and conduct, a Fortunate One, knower of the world, an unsurpassed guide for those who wish to be trained, a teacher of gods and humans, the Awakened One, the Blessed One.\" He, having directly known and realized this world with its gods, Māras, and Brahmās, its population of recluses and brahmins, its gods and humans, proclaims it. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, with both meaning and expression; he reveals the entirely complete and perfectly pure holy life. \"It is indeed good to see such Arahants.\"\n\nThen, when that night had passed, the brahmin householders of Icchānaṅgala, taking an abundance of hard and soft food, approached the Icchānaṅgala forest grove. Having approached, they stood outside the entrance gate, making a loud and great noise. Now at that time, Venerable Nāgita was the Blessed One's attendant. Then the Blessed One addressed Venerable Nāgita: \"Who, Nāgita, are these making a loud and great noise? It seems as if fishermen are disturbing the fish.\" \"These, Venerable Sir, are the brahmin householders of Icchānaṅgala, who have brought an abundance of hard and soft food and are standing outside the entrance gate, intending it for the Blessed One and the community of monastics.\" \"May I have no association with fame, Nāgita, nor fame with me. Indeed, Nāgita, whoever would not be a frequent, effortless, and easy recipient of this happiness of renunciation, happiness of seclusion, happiness of tranquillity, and happiness of full awakening – of which I am a frequent, effortless, and easy recipient – such a one might delight in that happiness of excrement, happiness of drowsiness, happiness of gains, honor, and praise.\"\n\n\"May the Blessed One assent now, Venerable Sir, may the Fortunate One assent. It is now the time for the Blessed One to assent, Venerable Sir. Wherever the Blessed One now goes, the brahmin householders, townsfolk, and countryfolk will incline in that direction. Just as, Venerable Sir, when heavy rain falls, the waters flow according to the slope, even so, Venerable Sir, wherever the Blessed One now goes, the brahmin householders, townsfolk, and countryfolk will incline in that direction. What is the reason for this? Because, Venerable Sir, the Blessed One has such virtue and wisdom.\"\n\n\"May I have no association with fame, Nāgita, nor fame with me. Indeed, Nāgita, whoever would not be a frequent, effortless, and easy recipient of this happiness of renunciation, happiness of seclusion, happiness of tranquillity, and happiness of full awakening – of which I am a frequent, effortless, and easy recipient – such a one might delight in that happiness of excrement, happiness of drowsiness, happiness of gains, honor, and praise. Nāgita, excrement and urine are the outcome of what is eaten, drunk, chewed, and tasted – that is its outflow. Nāgita, sorrow, lamentation, pain, distress, and despair arise from the alteration and change of what is dear – that is its outflow. Nāgita, for one who is engaged in applying the sign of foulness, revulsion towards the sign of beauty is established – that is its outflow. Nāgita, for one who dwells contemplating impermanence in the six sense bases for contact, revulsion towards contact is established – that is its outflow. Nāgita, for one who dwells contemplating the arising and passing away in the five clinging-aggregates, revulsion towards clinging is established – that is its outflow.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයෙහි චාරිකාවේ වඩින සේක්, මහත් වූ භික්ෂුසඞ්ඝයා සමඟ කෝසල ජනපදයට අයත් ඉච්ඡානංගල නම් බමුණු ගම වෙත වැඩම කළ සේක. එහි දී භාග්‍යවතුන් වහන්සේ ඉච්ඡානංගල ගමෙහි ඉච්ඡානංගල වනසණ්ඩයෙහි වැඩසිටි සේක.\n\nඉච්ඡානංගල බ්‍රාහ්මණ ගෘහපතීන් ඇසූහ: \"භවත් ගෞතම ශ්‍රමණයෝ, ශාක්‍ය පුත්‍රයෝ, ශාක්‍ය කුලයෙන් පැවිදි වූවෝ ඉච්ඡානංගලයට වැඩම කොට, ඉච්ඡානංගල වනයෙහි වැඩසිටින සේක. ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳව මෙබඳු මඞ්ගල කීර්ති ඝෝෂාවක් පැතිර ගොස් ඇත: 'ඒ භාග්‍යවතුන් වහන්සේ කෙලෙසුන් කෙරෙන් අර්හත් වූ සේක, සම්මා සම්බුද්ධ වූ සේක, විද්‍යාචරණ සම්පන්න වූ සේක, සුගත වූ සේක, ලෝක විදූ වූ සේක, නිරුත්තර වූ පුරිස දම්ම සාරථී වූ සේක, දෙවි මිනිසුන්ගේ ශාස්තෘ වූ සේක, බුද්ධ වූ සේක, භාග්‍යවත් වූ සේක.' උන්වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත මේ ලෝකය ද, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූ, දෙව් මිනිසුන් සහිත වූ මේ ප්‍රජාව ද තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍රකාශ කරන සේක. උන්වහන්සේ මුල යහපත් වූ, මැද යහපත් වූ, අග යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන (වචන) සහිත වූ ධර්මය දේශනා කරන සේක. පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන සේක. මේ වැනි අර්හත් උත්තමයන් වහන්සේලා දැකීම පින්කමකි.\"\n\nඑසැණින් ඉච්ඡානංගල බ්‍රාහ්මණ ගෘහපතීහු ඒ රාත්‍රිය ඉක්ම ගිය පසු, බොහෝ වූ ඛාදනීය (සපා කෑමට සුදුසු) සහ භෝජනීය (ගිලීමට සුදුසු) ආහාරපාන රැගෙන ඉච්ඡානංගල වනසණ්ඩය වෙත එළඹුණාහුය. එළඹ බොහෝ සේ මහත් ශබ්ද නඟමින් දොරටුවේ පිටත සිටියහ. ඒ සමයෙහි ආයුෂ්මත් නාගිත හිමියෝ භාග්‍යවතුන් වහන්සේගේ උපස්ථායකව සිටි සේක. එසැණින් භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් නාගිත හිමියන් අමතා වදාළ සේක: \"නාගිත, මේ කවුරුන්ද මෙතරම් මහත් ශබ්ද නඟන්නේ? මට සිතෙන්නේ ධීවරයෝ මසුන් දඟලවන්නාක් මෙන් (ශබ්ද නඟති).\"\n\n\"ස්වාමීනි, මේ ඉච්ඡානංගල බ්‍රාහ්මණ ගෘහපතීහු බොහෝ වූ ඛාදනීය හා භෝජනීය ආහාරපාන රැගෙන දොරටුවේ පිටත සිටිති. ඒ භාග්‍යවතුන් වහන්සේත් භික්ෂුසඞ්ඝයාත් අරමුණු කරගෙනය.\"\n\n\"නාගිත, මට යසස සමඟ එක්වීමක් නොවේවා, යසස මා සමඟ නොවේවා! නාගිත, යමෙක් මේ නෛෂ්ක්‍රම්‍ය සුඛය (ගිහිගෙයින් නික්මීමේ සුවය), ප්‍රවිවේක සුඛය (තනිකමේ සුවය), උපශම සුඛය (සන්සිඳවීමේ සුවය), සම්බෝධි සුඛය (නොවෙනස් වීමේ සුවය) කැමැති සේ නොලබන්නේ ද, දුකින් තොරව නොලබන්නේ ද, වෙහෙසින් තොරව නොලබන්නේ ද, නමුත් මා මේ නෛෂ්ක්‍රම්‍ය සුඛය, ප්‍රවිවේක සුඛය, උපශම සුඛය, සම්බෝධි සුඛය කැමැති සේ, දුකින් තොරව, වෙහෙසින් තොරව ලබන්නෙක් වෙමි. (එවැනි මා වැනි අයෙකුට) ඒ අශුචි වැනි සුවය, නිද්‍රාමය සුවය, ලාභ සත්කාර ප්‍රශංසා වැනි සුවය ප්‍රිය විය හැකිද?\"\n\n\"ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ අධිවාසනා කළ මැනව, සුගතයන් වහන්සේ අධිවාසනා කළ මැනව. දැන් භාග්‍යවතුන් වහන්සේට අධිවාසනා කිරීමට (පිළිගැනීමට) සුදුසු කාලයයි. දැන් භාග්‍යවතුන් වහන්සේ යම් යම් දෙසට වඩින සේක් ද, නගරවාසී සහ ජනපදවාසී බ්‍රාහ්මණ ගෘහපතීහු ඒ දෙසටම නැඹුරු වී යනු ඇත. ස්වාමීනි, යම් සේ මහ වැසි වසින විට ජලය පහත් බිම් කරා ගලා යයි ද, එසේම ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ යම් යම් දෙසට වඩින සේක් ද, නගරවාසී සහ ජනපදවාසී බ්‍රාහ්මණ ගෘහපතීහු ඒ දෙසටම නැඹුරු වී යනු ඇත. ඒ කුමක් හෙයින් ද? ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ ශීලයත් ප්‍රඥාවත් එබඳු වන බැවිනි.\"\n\n\"නාගිත, මට යසස සමඟ එක්වීමක් නොවේවා, යසස මා සමඟ නොවේවා! නාගිත, යමෙක් මේ නෛෂ්ක්‍රම්‍ය සුඛය, ප්‍රවිවේක සුඛය, උපශම සුඛය, සම්බෝධි සුඛය කැමැති සේ නොලබන්නේ ද, දුකින් තොරව නොලබන්නේ ද, වෙහෙසින් තොරව නොලබන්නේ ද, නමුත් මා මේ නෛෂ්ක්‍රම්‍ය සුඛය, ප්‍රවිවේක සුඛය, උපශම සුඛය, සම්බෝධි සුඛය කැමැති සේ, දුකින් තොරව, වෙහෙසින් තොරව ලබන්නෙක් වෙමි. (එවැනි මා වැනි අයෙකුට) ඒ අශුචි වැනි සුවය, නිද්‍රාමය සුවය, ලාභ සත්කාර ප්‍රශංසා වැනි සුවය ප්‍රිය විය හැකිද?\"\n\n\"නාගිත, කනලද, බොනලද, සපා කනලද, රස විඳිනලද දේහි ප්‍රතිඵලය නම් මලමුත්‍රයි. එය එහි නිස්සන්දය (අනිවාර්ය ප්‍රතිඵලය) වේ. නාගිත, ප්‍රිය දේ වෙනස්වීමෙන් හෝ වෙනත් ස්වභාවයකට පත්වීමෙන් ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස (දොම්නසින් පෙළීම්) හටගනී. එය එහි නිස්සන්දය වේ. නාගිත, අසුභ නිමිති භාවනාවේ යෙදෙන්නෙකුට ශුභ නිමිති කෙරෙහි පිළිකුලක් ඇතිවේ. එය එහි නිස්සන්දය වේ. නාගිත, ෂඩ් ස්පර්ශායතනයන්හි අනිත්‍ය දකිමින් වසන්නෙකුට ස්පර්ශය කෙරෙහි පිළිකුලක් ඇතිවේ. එය එහි නිස්සන්දය වේ. නාගිත, පංච උපාදානස්කන්ධයන්හි ඇතිවීම හා නැතිවීම (උදයව්‍යය) දකිමින් වසන්නෙකුට උපාදානයන් කෙරෙහි පිළිකුලක් ඇතිවේ. එය එහි නිස්සන්දය වේ.\"",
      "paliTitle": "Nāgitasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Pañcaṅgikavaggo tatiyo. Tassuddānaṃ – Dve agāravupakkilesā, dussīlānuggahitena ca; Vimuttisamādhipañcaṅgikā, caṅkamaṃ nāgitena cāti.",
    "english": "",
    "sinhala": ""
  }
}