{
  "id": "an5.5",
  "title": {
    "pali": "Muṇḍarājavaggo",
    "english": "The Chapter of King Muṇḍa",
    "sinhala": "මුණ්ඩරාජවග්ගය"
  },
  "sections": [
    {
      "number": 41,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘pañcime, gahapati, bhogānaṃ ādiyā. Katame pañca? Idha, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi attānaṃ sukheti pīṇeti sammā sukhaṃ pariharati; mātāpitaro sukheti pīṇeti sammā sukhaṃ pariharati; puttadāradāsakammakaraporise sukheti pīṇeti sammā sukhaṃ pariharati. Ayaṃ paṭhamo bhogānaṃ ādiyo. ‘‘Puna caparaṃ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi mittāmacce sukheti pīṇeti sammā sukhaṃ pariharati. Ayaṃ dutiyo bhogānaṃ ādiyo. ‘‘Puna caparaṃ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi yā tā honti āpadā – aggito vā udakato vā rājato vā corato vā appiyato vā dāyādato [appiyato vā dāyādato vā (bahūsu) a. ni. 4.61; 5.148] – tathārūpāsu āpadāsu bhogehi pariyodhāya vattati, sotthiṃ attānaṃ karoti. Ayaṃ tatiyo bhogānaṃ ādiyo. ‘‘Puna caparaṃ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi pañcabaliṃ kattā hoti. Ñātibaliṃ, atithibaliṃ, pubbapetabaliṃ, rājabaliṃ, devatābaliṃ – ayaṃ catuttho bhogānaṃ ādiyo. ‘‘Puna caparaṃ, gahapati, ariyasāvako uṭṭhānavīriyādhigatehi bhogehi bāhābalaparicitehi sedāvakkhittehi dhammikehi dhammaladdhehi ye te samaṇabrāhmaṇā madappamādā paṭiviratā khantisoracce niviṭṭhā ekamattānaṃ damenti ekamattānaṃ samenti ekamattānaṃ parinibbāpenti, tathārūpesu samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpeti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Ayaṃ pañcamo bhogānaṃ ādiyo. Ime kho, gahapati, pañca bhogānaṃ ādiyā. ‘‘Tassa ce, gahapati, ariyasāvakassa ime pañca bhogānaṃ ādiye ādiyato bhogā parikkhayaṃ gacchanti, tassa evaṃ hoti – ‘ye vata bhogānaṃ ādiyā te cāhaṃ ādiyāmi bhogā ca me parikkhayaṃ gacchantī’ti. Itissa hoti avippaṭisāro. Tassa ce, gahapati, ariyasāvakassa ime pañca bhogānaṃ ādiye ādiyato bhogā abhivaḍḍhanti, tassa evaṃ hoti – ‘ye vata bhogānaṃ ādiyā te cāhaṃ ādiyāmi bhogā ca me abhivaḍḍhantī’ti. Itissa hoti [itissa hoti avippaṭisāro, (sī. syā.)] ubhayeneva avippaṭisāro’’ti. ‘‘Bhuttā bhogā bhatā bhaccā [gatā tacchā (ka.)], vitiṇṇā āpadāsu me; Uddhaggā dakkhiṇā dinnā, atho pañcabalīkatā; Upaṭṭhitā sīlavanto, saññatā brahmacārayo. ‘‘Yadatthaṃ bhogaṃ iccheyya, paṇḍito gharamāvasaṃ; So me attho anuppatto, kataṃ ananutāpiyaṃ. ‘‘Etaṃ [evaṃ (ka.)] anussaraṃ macco, ariyadhamme ṭhito naro; Idheva naṃ pasaṃsanti, pecca sagge pamodatī’’ti [pecca sagge ca modatīti (sī. syā.)]. paṭhamaṃ;",
      "english": "One time, the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's park. Then, Anāthapiṇḍika the householder approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As Anāthapiṇḍika the householder sat to one side, the Blessed One said to him: “Householder, there are these five ways of rightly using wealth. What are these five?\n\n“Here, householder, a noble disciple, with wealth obtained through diligent effort, acquired by the strength of their arms, earned by the sweat of their brow, righteous and lawfully gained, makes themselves happy and contented, sustaining themselves properly with ease; they make their parents happy and contented, sustaining them properly with ease; they make their children, spouse, servants, and employees happy and contented, sustaining them properly with ease. This is the first way of rightly using wealth.\n\n“Furthermore, householder, a noble disciple, with wealth obtained through diligent effort, acquired by the strength of their arms, earned by the sweat of their brow, righteous and lawfully gained, makes their friends and associates happy and contented, sustaining them properly with ease. This is the second way of rightly using wealth.\n\n“Furthermore, householder, a noble disciple, with wealth obtained through diligent effort, acquired by the strength of their arms, earned by the sweat of their brow, righteous and lawfully gained, guards against such misfortunes as may arise—from fire, flood, rulers, thieves, or from hateful heirs—and in such misfortunes, they provide for their safety with that wealth. This is the third way of rightly using wealth.\n\n“Furthermore, householder, a noble disciple, with wealth obtained through diligent effort, acquired by the strength of their arms, earned by the sweat of their brow, righteous and lawfully gained, performs the five oblations. These are: oblations to relatives, oblations to guests, oblations to departed ancestors, oblations to the king, and oblations to deities. This is the fourth way of rightly using wealth.\n\n“Furthermore, householder, a noble disciple, with wealth obtained through diligent effort, acquired by the strength of their arms, earned by the sweat of their brow, righteous and lawfully gained, establishes a lofty offering for those ascetics and brahmins who refrain from intoxication and heedlessness, who are devoted to patience and gentleness, who subdue themselves, calm themselves, and attain ultimate freedom. This offering leads to a higher rebirth, a pleasant result, and a heavenly destination. This is the fifth way of rightly using wealth.\n\n“These, householder, are the five ways of rightly using wealth.\n\n“If, householder, while a noble disciple uses wealth in these five ways, their wealth diminishes, they think: ‘I have indeed used my wealth in the ways it should be used, even if it has diminished.’ They feel no regret. If, householder, while a noble disciple uses wealth in these five ways, their wealth increases, they think: ‘I have indeed used my wealth in the ways it should be used, and it has also increased.’ In both cases, they feel no regret.”\n\n“My wealth has been consumed, my dependants sustained, I have guarded against misfortunes; lofty offerings have been given, and the five oblations performed; virtuous, self-restrained, and chaste practitioners have been served.\n\n“The purpose for which a wise householder desires wealth, that purpose has been achieved by me, and I have done what brings no regret.\n\n“Recalling this, a person established in the noble Dhamma is praised right here in this world, and after death, they rejoice in heaven.”",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයෙහි වැඩවසන සේක. අනතුරුව අනේපිඬු ගෘහපති තෙමේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අනේපිඬු ගෘහපතිට භාග්‍යවතුන් වහන්සේ මේ අයුරින් වදාළ සේක: “ගෘහපතිය, මේ ධනයෙහි ආශ්වාදයන් පහක් වෙති. ඒ පහ කවරේද?\n\nගෘහපතිය, මෙහිලා ආර්ය ශ්‍රාවකයා උත්සාහයත් වීර්යයත් විසින් අත්පත් කරගත්, තමාගේ බාහු බලයෙන් උපයාගත්, දහදිය වගුරුවා උපන්, ධාර්මික වූ, ධර්මය අනුව ලැබූ භෝග සම්පත් වලින් තමා සුවපත් කරන්නේය, පෝෂණය කරන්නේය, මනා සුවයෙන් පරිහරණය කරන්නේය; මවපියන් සුවපත් කරන්නේය, පෝෂණය කරන්නේය, මනා සුවයෙන් පරිහරණය කරන්නේය; දූ දරුවන්, භාර්යාවන්, දාසයන්, කම්කරුවන්, පෝරුවනුවන් සුවපත් කරන්නේය, පෝෂණය කරන්නේය, මනා සුවයෙන් පරිහරණය කරන්නේය. ධනයෙහි මේ පළමු ආශ්වාදයයි.\n\nතවද, ගෘහපතිය, ආර්ය ශ්‍රාවකයා උත්සාහයත් වීර්යයත් විසින් අත්පත් කරගත්, තමාගේ බාහු බලයෙන් උපයාගත්, දහදිය වගුරුවා උපන්, ධාර්මික වූ, ධර්මය අනුව ලැබූ භෝග සම්පත් වලින් මිත්‍ර අමාත්‍යවරුන් සුවපත් කරන්නේය, පෝෂණය කරන්නේය, මනා සුවයෙන් පරිහරණය කරන්නේය. ධනයෙහි මේ දෙවන ආශ්වාදයයි.\n\nතවද, ගෘහපතිය, ආර්ය ශ්‍රාවකයා උත්සාහයත් වීර්යයත් විසින් අත්පත් කරගත්, තමාගේ බාහු බලයෙන් උපයාගත්, දහදිය වගුරුවා උපන්, ධාර්මික වූ, ධර්මය අනුව ලැබූ භෝග සම්පත් වලින් යම් ආපදා ඇතිවේද – එනම් ගින්නෙන් හෝ, ජලයෙන් හෝ, රජුගෙන් හෝ, සොරෙකුගෙන් හෝ, අමිහිරි වූ දායාදකරුවන්ගෙන් හෝ – එවැනි ආපදාවලදී භෝග සම්පත් වලින් තමා රැක ගන්නේය, තමාට ආරක්ෂාව සලසා ගන්නේය. ධනයෙහි මේ තුන්වන ආශ්වාදයයි.\n\nතවද, ගෘහපතිය, ආර්ය ශ්‍රාවකයා උත්සාහයත් වීර්යයත් විසින් අත්පත් කරගත්, තමාගේ බාහු බලයෙන් උපයාගත්, දහදිය වගුරුවා උපන්, ධාර්මික වූ, ධර්මය අනුව ලැබූ භෝග සම්පත් වලින් පස් වැදෑරුම් බලි කර්ම කරන්නෙක් වේ. එනම්: ඥාතීන්ට දීම (ඥාතිබලිය), අමුත්තන්ට දීම (අතිථිබලිය), පෙර පරලොව ගිය අයට පිං දීම (පූර්වප්‍රේතබලිය), රජුට බදු ගෙවීම (රාජබලිය), දෙවියන්ට පිදීම (දේවතාබලිය) – ධනයෙහි මේ සිව්වන ආශ්වාදයයි.\n\nතවද, ගෘහපතිය, ආර්ය ශ්‍රාවකයා උත්සාහයත් වීර්යයත් විසින් අත්පත් කරගත්, තමාගේ බාහු බලයෙන් උපයාගත්, දහදිය වගුරුවා උපන්, ධාර්මික වූ, ධර්මය අනුව ලැබූ භෝග සම්පත් වලින් යම් ශ්‍රමණ බ්‍රාහ්මණයෝ මදයෙන් හා ප්‍රමාදයෙන් වෙන් වූවෝද, ඉවසීමෙන් හා කීකරුකමෙන් යුක්ත වූවෝද, තමන්වම හික්මවන්නෝද, තමන්වම සන්සුන් කරන්නෝද, තමන්වම පිරිනිවන් පමුණුවන්නෝද, එවැනි ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි උසස් අග්‍ර වූ, ස්වර්ගයට පමුණුවන, සැප විපාක දෙන, ස්වර්ග සම්පත් ඇති කරන දක්ෂිණාවක් පිහිටුවන්නේය (පූජා කරන්නේය). ධනයෙහි මේ පස්වන ආශ්වාදයයි. ගෘහපතිය, ධනයෙහි මේ ආශ්වාදයන් පහ වෙති.\n\nගෘහපතිය, යම් හෙයකින් ඒ ආර්ය ශ්‍රාවකයා මේ ධනයෙහි පස් ආශ්වාදයන් පරිහරණය කරන කල්හි භෝග සම්පත් පිරිහී යන්නේ නම්, ඔහුට මෙසේ සිතේ: ‘යම් ධනයෙහි ආශ්වාදයන් ඇත්ද, මම ඒවා පරිහරණය කළෙමි, එසේ වුවද මාගේ භෝග සම්පත් පිරිහී යන්නේය’ කියාය. ඔහුට පසුතැවිල්ලක් ඇති නොවේ. ගෘහපතිය, යම් හෙයකින් ඒ ආර්ය ශ්‍රාවකයා මේ ධනයෙහි පස් ආශ්වාදයන් පරිහරණය කරන කල්හි භෝග සම්පත් වර්ධනය වන්නේ නම්, ඔහුට මෙසේ සිතේ: ‘යම් ධනයෙහි ආශ්වාදයන් ඇත්ද, මම ඒවා පරිහරණය කළෙමි, මාගේ භෝග සම්පත්ද වර්ධනය වන්නේය’ කියාය. ඔහුට දෙයාකාරයෙන්ම පසුතැවිල්ලක් ඇති නොවේ.”\n\nභෝග සම්පත් පරිභෝග කර ඇත, පෝෂණය කළ යුතු අය පෝෂණය කර ඇත, ආපදාවලදී ඒවා වියදම් කර ඇත.\nඋසස් අග්‍ර දක්ෂිණා පූජා කර ඇත, එසේම පස් බලි කර්මද කර ඇත.\nසිල්වත් වූ, සංවර වූ, බ්‍රහ්මචාරී වූ අය උපස්ථාන කර ඇත.\n\nගෘහවාසී පණ්ඩිතයෙක් යම් අරමුණක් සඳහා ධනය කැමති වේද, ඒ අරමුණ මට අත්පත් වී ඇත, පසුතැවිල්ලක් ඇති නොවන ලෙස කටයුතු කර ඇත.\n\nආර්ය ධර්මයෙහි පිහිටි ඒ මනුෂ්‍යයා මේ අයුරින් සිහිපත් කරමින්, මෙලොවදීම ඔහුට ප්‍රශංසා කරති, පරලොවදීද දෙව්ලොවදී සතුටු වෙයි.",
      "paliTitle": "Ādiyasuttaṃ"
    },
    {
      "number": 42,
      "pali": "‘‘Sappuriso, bhikkhave, kule jāyamāno bahuno janassa atthāya hitāya sukhāya hoti; mātāpitūnaṃ [mātāpitunnaṃ (sī. pī.)] atthāya hitāya sukhāya hoti; puttadārassa atthāya hitāya sukhāya hoti; dāsakammakaraporisassa atthāya hitāya sukhāya hoti; mittāmaccānaṃ atthāya hitāya sukhāya hoti; samaṇabrāhmaṇānaṃ atthāya hitāya sukhāya hoti. ‘‘Seyyathāpi, bhikkhave, mahāmegho sabbasassāni sampādento bahuno janassa atthāya hitāya sukhāya hoti; evamevaṃ kho, bhikkhave, sappuriso kule jāyamāno bahuno janassa atthāya hitāya sukhāya hoti; mātāpitūnaṃ atthāya hitāya sukhāya hoti; puttadārassa atthāya hitāya sukhāya hoti; dāsakammakaraporisassa atthāya hitāya sukhāya hoti; mittāmaccānaṃ atthāya hitāya sukhāya hoti; samaṇabrāhmaṇānaṃ atthāya hitāya sukhāya hotī’’ti. ‘‘Hito bahunnaṃ paṭipajja bhoge, taṃ devatā rakkhati dhammaguttaṃ; Bahussutaṃ sīlavatūpapannaṃ, dhamme ṭhitaṃ na vijahati [vijahāti (sī. syā. kaṃ. pī.)] kitti. ‘‘Dhammaṭṭhaṃ sīlasampannaṃ, saccavādiṃ hirīmanaṃ; Nekkhaṃ jambonadasseva, ko taṃ ninditumarahati; Devāpi naṃ pasaṃsanti, brahmunāpi pasaṃsito’’ti. dutiyaṃ;",
      "english": "Monks, a virtuous person, when born into a family, is for the welfare, benefit, and happiness of many people. He is for the welfare, benefit, and happiness of his parents; for the welfare, benefit, and happiness of his children and spouse; for the welfare, benefit, and happiness of his servants, workers, and employees; for the welfare, benefit, and happiness of his friends and associates; for the welfare, benefit, and happiness of ascetics and brahmins.\n\nJust as, monks, a great cloud, bringing forth all crops, is for the welfare, benefit, and happiness of many people; even so, monks, a virtuous person, when born into a family, is for the welfare, benefit, and happiness of many people; for the welfare, benefit, and happiness of his parents; for the welfare, benefit, and happiness of his children and spouse; for the welfare, benefit, and happiness of his servants, workers, and employees; for the welfare, benefit, and happiness of his friends and associates; for the welfare, benefit, and happiness of ascetics and brahmins.\n\nOne who is beneficial to many, engaging with resources for their well-being, is protected by devas, being guarded by the Dhamma. Glory does not abandon one who is well-learned, endowed with virtue, and steadfast in the Dhamma.\n\nWho can possibly find fault with one who stands firm in the Dhamma, is perfectly virtuous, speaks the truth, and possesses a sense of moral shame, a person like a pure nugget of Jambu-river gold? Even devas praise him; he is praised even by Brahmā.",
      "sinhala": "මහණෙනි, සත්පුරුෂයෙක් කුලයක උපදින්නේ බොහෝ දෙනාට අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; මව්රන්ටත්, පියව්රන්ටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; පුත්‍ර​යන්ටත්, භාර්යාවටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; දාසයන්ටත්, කම්කරුවන්ටත්, පිරිසටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; මිත්‍ර​යන්ටත්, අමාත්‍යවරුන්ටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; ශ්‍ර​මණබ්‍රාහ්මණයන්ටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි.\n\nමහණෙනි, යම් සේ මහා වලාකුළක් සියලු සශ්‍රීක භෝගයන් සම්පාදනය කරමින් බොහෝ දෙනාට අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි ද; එසේම මහණෙනි, සත්පුරුෂයෙක් කුලයක උපදින්නේ බොහෝ දෙනාට අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; මව්රන්ටත්, පියව්රන්ටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; පුත්‍ර​යන්ටත්, භාර්යාවටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; දාසයන්ටත්, කම්කරුවන්ටත්, පිරිසටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; මිත්‍ර​යන්ටත්, අමාත්‍යවරුන්ටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි; ශ්‍ර​මණබ්‍රාහ්මණයන්ටත් අර්ථය පිණිස, හිතය පිණිස, සැපය පිණිස වෙයි.\n\nබොහෝ දෙනාගේ හිත පිණිස භෝගයන් උපදවාගෙන වාසය කරන්නා වූ, ධර්මයෙන් ආරක්ෂා වූ ඒ තැනැත්තා දෙවියෝ රකිත්. බහුශ්‍රැත වූ, සීලයෙන් යුක්ත වූ, ධර්මයෙහි පිහිටි තැනැත්තාගේ කීර්තිය කිසි විටෙකත් පහව නොයයි.\n\nධර්මයෙහි පිහිටි, සීලයෙන් සම්පූර්ණ වූ, සත්‍ය​වාදී වූ, හිරි ඇති (ලැජ්ජාශීලී) තැනැත්තා ජම්බු ගඟේ රත්‍රන් කැබැල්ලක් මෙන් (පිරිසිදුය). කවරෙක් ඔහුට නින්දා කිරීමට සුදුසු ද? දෙවියෝ පවා ඔහු ප්‍රශංසා කරත්, බ්‍රහ්මයා විසින්ද ප්‍රශංසා කරන ලද්දේය.",
      "paliTitle": "Sappurisasuttaṃ"
    },
    {
      "number": 43,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Pañcime, gahapati, dhammā iṭṭhā kantā manāpā dullabhā lokasmiṃ. Katame pañca? Āyu, gahapati, iṭṭho kanto manāpo dullabho lokasmiṃ; vaṇṇo iṭṭho kanto manāpo dullabho lokasmiṃ; sukhaṃ iṭṭhaṃ kantaṃ manāpaṃ dullabhaṃ lokasmiṃ; yaso iṭṭho kanto manāpo dullabho lokasmiṃ; saggā iṭṭhā kantā manāpā dullabhā lokasmiṃ. Ime kho, gahapati, pañca dhammā iṭṭhā kantā manāpā dullabhā lokasmiṃ. ‘‘Imesaṃ kho, gahapati, pañcannaṃ dhammānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ na āyācanahetu vā patthanāhetu vā [na patthanāhetu vā (syā. kaṃ. pī.)] paṭilābhaṃ vadāmi. Imesaṃ kho, gahapati, pañcannaṃ dhammānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ āyācanahetu vā patthanāhetu vā paṭilābho abhavissa, ko idha kena hāyetha? ‘‘Na kho, gahapati, arahati ariyasāvako āyukāmo āyuṃ āyācituṃ vā abhinandituṃ vā āyussa vāpi hetu. Āyukāmena, gahapati, ariyasāvakena āyusaṃvattanikā paṭipadā paṭipajjitabbā. Āyusaṃvattanikā hissa paṭipadā paṭipannā āyupaṭilābhāya saṃvattati. So lābhī hoti āyussa dibbassa vā mānusassa vā. ‘‘Na kho, gahapati, arahati ariyasāvako vaṇṇakāmo vaṇṇaṃ āyācituṃ vā abhinandituṃ vā vaṇṇassa vāpi hetu. Vaṇṇakāmena, gahapati, ariyasāvakena vaṇṇasaṃvattanikā paṭipadā paṭipajjitabbā. Vaṇṇasaṃvattanikā hissa paṭipadā paṭipannā vaṇṇapaṭilābhāya saṃvattati. So lābhī hoti vaṇṇassa dibbassa vā mānusassa vā. ‘‘Na kho, gahapati, arahati ariyasāvako sukhakāmo sukhaṃ āyācituṃ vā abhinandituṃ vā sukhassa vāpi hetu. Sukhakāmena, gahapati, ariyasāvakena sukhasaṃvattanikā paṭipadā paṭipajjitabbā. Sukhasaṃvattanikā hissa paṭipadā paṭipannā sukhapaṭilābhāya saṃvattati. So lābhī hoti sukhassa dibbassa vā mānusassa vā. ‘‘Na kho, gahapati, arahati ariyasāvako yasakāmo yasaṃ āyācituṃ vā abhinandituṃ vā yasassa vāpi hetu. Yasakāmena, gahapati, ariyasāvakena yasasaṃvattanikā paṭipadā paṭipajjitabbā. Yasasaṃvattanikā hissa paṭipadā paṭipannā yasapaṭilābhāya saṃvattati. So lābhī hoti yasassa dibbassa vā mānusassa vā. ‘‘Na kho, gahapati, arahati ariyasāvako saggakāmo saggaṃ āyācituṃ vā abhinandituṃ vā saggānaṃ vāpi hetu. Saggakāmena, gahapati, ariyasāvakena saggasaṃvattanikā paṭipadā paṭipajjitabbā. Saggasaṃvattanikā hissa paṭipadā paṭipannā saggapaṭilābhāya saṃvattati. So lābhī hoti saggāna’’nti. ‘‘Āyuṃ vaṇṇaṃ yasaṃ kittiṃ, saggaṃ uccākulīnataṃ; Ratiyo patthayānena [patthayamānena (ka.)], uḷārā aparāparā. ‘‘Appamādaṃ pasaṃsanti, puññakiriyāsu paṇḍitā; ‘‘Appamatto ubho atthe, adhigaṇhāti paṇḍito. ‘‘Diṭṭhe dhamme ca [diṭṭheva dhamme (sī.)] yo attho, yo cattho samparāyiko; Atthābhisamayā dhīro, paṇḍitoti pavuccatī’’ti. tatiyaṃ;",
      "english": "Then, the householder Anāthapiṇḍika approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As the householder Anāthapiṇḍika sat to one side, the Blessed One said this to him: ‘Householder, these five things are desirable, agreeable, pleasing, and difficult to obtain in the world. Which five? Householder, long life is desirable, agreeable, pleasing, and difficult to obtain in the world; beauty is desirable, agreeable, pleasing, and difficult to obtain in the world; happiness is desirable, agreeable, pleasing, and difficult to obtain in the world; renown is desirable, agreeable, pleasing, and difficult to obtain in the world; and heavenly states are desirable, agreeable, pleasing, and difficult to obtain in the world. Householder, these are the five things that are desirable, agreeable, pleasing, and difficult to obtain in the world.’\n\n‘Householder, I do not declare that the acquisition of these five desirable, agreeable, pleasing, and difficult-to-obtain things in the world is by reason of entreaty or aspiration. Householder, if the acquisition of these five desirable, agreeable, pleasing, and difficult-to-obtain things in the world were by reason of entreaty or aspiration, then who here would lack what?’\n\n‘Householder, an noble disciple who desires long life should not entreat for long life, nor delight in it, nor on account of long life. Householder, an noble disciple desiring long life should practice the path that leads to long life. For practicing the path that leads to long life leads to the acquisition of long life for him. He becomes an acquirer of long life, whether divine or human.’\n\n‘Householder, an noble disciple who desires beauty should not entreat for beauty, nor delight in it, nor on account of beauty. Householder, an noble disciple desiring beauty should practice the path that leads to beauty. For practicing the path that leads to beauty leads to the acquisition of beauty for him. He becomes an acquirer of beauty, whether divine or human.’\n\n‘Householder, an noble disciple who desires happiness should not entreat for happiness, nor delight in it, nor on account of happiness. Householder, an noble disciple desiring happiness should practice the path that leads to happiness. For practicing the path that leads to happiness leads to the acquisition of happiness for him. He becomes an acquirer of happiness, whether divine or human.’\n\n‘Householder, an noble disciple who desires renown should not entreat for renown, nor delight in it, nor on account of renown. Householder, an noble disciple desiring renown should practice the path that leads to renown. For practicing the path that leads to renown leads to the acquisition of renown for him. He becomes an acquirer of renown, whether divine or human.’\n\n‘Householder, an noble disciple who desires heavenly states should not entreat for heavenly states, nor delight in them, nor on account of heavenly states. Householder, an noble disciple desiring heavenly states should practice the path that leads to heavenly states. For practicing the path that leads to heavenly states leads to the acquisition of heavenly states for him. He becomes an acquirer of heavenly states.’\n\nLong life, beauty, renown, fame, heavenly states, high birth, and pleasures, excellent and various – for one who desires them, the wise praise heedfulness in meritorious deeds. Heedful, the wise person attains both kinds of welfare: that which pertains to this present life, and that which pertains to future lives. Having comprehended these two kinds of welfare, the discerning one is called wise.",
      "sinhala": "එවිට අනේපිඬු සිටුතුමා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අනේපිඬු සිටුතුමාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ගෘහපතිය, ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූ මේ ධර්මතා පහක් ඇත. ඒ කවර පහක් ද? ගෘහපතිය, ආයුෂය ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූවකි. වර්ණය ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූවකි. සුවය ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූවකි. යසස ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූවකි. සැප ඇති දිව්‍ය ලෝක ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූවකි. ගෘහපතිය, ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූ මේ ධර්මතා පහ මේවාය.\n\nගෘහපතිය, ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූ මේ ධර්මතා පහ ලැබීම යාච්ඤා කිරීමෙන් හෝ ප්‍රාර්ථනා කිරීමෙන් සිදු වන බව මම නොකියමි. ගෘහපතිය, ලෝකයෙහි කැමති, ප්‍රිය, මනාප වූ, දුර්ලභ වූ මේ ධර්මතා පහ ලැබීම යාච්ඤා කිරීමෙන් හෝ ප්‍රාර්ථනා කිරීමෙන් සිදු වන්නට තිබුණා නම්, මෙලොව කිසිවෙකුට කුමක් අඩුවන්නට තිබුණා ද?\n\nගෘහපතිය, ආයුෂ කැමති ආර්ය ශ්‍රාවකයෙක් ආයුෂ ඉල්ලා සිටීමට හෝ එයින් සතුටු වීමට හෝ ආයුෂය සඳහා කටයුතු කිරීමට හෝ සුදුසු නැත. ගෘහපතිය, ආයුෂ කැමති ආර්ය ශ්‍රාවකයෙක් ආයුෂ වැඩි කරන ප්‍රතිපදාව අනුගමනය කළ යුතුය. ඇත්ත වශයෙන්ම, ඔහු විසින් අනුගමනය කරන ලද ආයුෂ වැඩි කරන ප්‍රතිපදාව ආයුෂ ලැබීමට හේතු වේ. ඔහු දිව්‍යමය හෝ මනුෂ්‍යමය වූ ආයුෂ ලබන්නෙක් වේ.\n\nගෘහපතිය, වර්ණය කැමති ආර්ය ශ්‍රාවකයෙක් වර්ණය ඉල්ලා සිටීමට හෝ එයින් සතුටු වීමට හෝ වර්ණය සඳහා කටයුතු කිරීමට හෝ සුදුසු නැත. ගෘහපතිය, වර්ණය කැමති ආර්ය ශ්‍රාවකයෙක් වර්ණය වැඩි කරන ප්‍රතිපදාව අනුගමනය කළ යුතුය. ඇත්ත වශයෙන්ම, ඔහු විසින් අනුගමනය කරන ලද වර්ණය වැඩි කරන ප්‍රතිපදාව වර්ණය ලැබීමට හේතු වේ. ඔහු දිව්‍යමය හෝ මනුෂ්‍යමය වූ වර්ණය ලබන්නෙක් වේ.\n\nගෘහපතිය, සුවය කැමති ආර්ය ශ්‍රාවකයෙක් සුවය ඉල්ලා සිටීමට හෝ එයින් සතුටු වීමට හෝ සුවය සඳහා කටයුතු කිරීමට හෝ සුදුසු නැත. ගෘහපතිය, සුවය කැමති ආර්ය ශ්‍රාවකයෙක් සුවය වැඩි කරන ප්‍රතිපදාව අනුගමනය කළ යුතුය. ඇත්ත වශයෙන්ම, ඔහු විසින් අනුගමනය කරන ලද සුවය වැඩි කරන ප්‍රතිපදාව සුවය ලැබීමට හේතු වේ. ඔහු දිව්‍යමය හෝ මනුෂ්‍යමය වූ සුවය ලබන්නෙක් වේ.\n\nගෘහපතිය, යසස කැමති ආර්ය ශ්‍රාවකයෙක් යසස ඉල්ලා සිටීමට හෝ එයින් සතුටු වීමට හෝ යසස සඳහා කටයුතු කිරීමට හෝ සුදුසු නැත. ගෘහපතිය, යසස කැමති ආර්ය ශ්‍රාවකයෙක් යසස වැඩි කරන ප්‍රතිපදාව අනුගමනය කළ යුතුය. ඇත්ත වශයෙන්ම, ඔහු විසින් අනුගමනය කරන ලද යසස වැඩි කරන ප්‍රතිපදාව යසස ලැබීමට හේතු වේ. ඔහු දිව්‍යමය හෝ මනුෂ්‍යමය වූ යසස ලබන්නෙක් වේ.\n\nගෘහපතිය, දිව්‍ය ලෝක කැමති ආර්ය ශ්‍රාවකයෙක් දිව්‍ය ලෝක ඉල්ලා සිටීමට හෝ එයින් සතුටු වීමට හෝ දිව්‍ය ලෝක සඳහා කටයුතු කිරීමට හෝ සුදුසු නැත. ගෘහපතිය, දිව්‍ය ලෝක කැමති ආර්ය ශ්‍රාවකයෙක් දිව්‍ය ලෝක ලැබීම වැඩි කරන ප්‍රතිපදාව අනුගමනය කළ යුතුය. ඇත්ත වශයෙන්ම, ඔහු විසින් අනුගමනය කරන ලද දිව්‍ය ලෝක ලැබීම වැඩි කරන ප්‍රතිපදාව දිව්‍ය ලෝක ලැබීමට හේතු වේ. ඔහු දිව්‍ය ලෝක ලබන්නෙක් වේ.”\n\nඋසස් වූ නොයෙක් සැප සම්පත්, ආයුෂ, වර්ණය, යසස, කීර්තිය, දිව්‍ය ලෝක, උසස් කුලවල ඉපදීම ප්‍රාර්ථනා කරන තැනැත්තා පින්කම් කිරීමෙහිදී අප්‍රමාදීව කටයුතු කිරීම ප්‍රඥාවන්තයෝ ප්‍රශංසා කරති.\n\nනොපමා වූ ප්‍රඥාවන්තයා ලෝක දෙකෙහිම අර්ථයන් ලබා ගනී.\n\nමේ ජීවිතයේ ලැබිය යුතු අර්ථයත්, පරලොවට අයත් අර්ථයත් යම් පුද්ගලයෙක් හොඳින් අවබෝධ කරගන්නේද, ඒ ධීර පුද්ගලයා ප්‍රඥාවන්තයෙක් යැයි කියනු ලැබේ.",
      "paliTitle": "Iṭṭhasuttaṃ"
    },
    {
      "number": 44,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena uggassa gahapatino vesālikassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho uggo gahapati vesāliko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uggo gahapati vesāliko bhagavantaṃ etadavoca – ‘‘Sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘manāpadāyī labhate manāpa’nti. Manāpaṃ me, bhante, sālapupphakaṃ [sālipupphakaṃ (ka.)] khādanīyaṃ; taṃ me bhagavā paṭiggaṇhātu anukampaṃ upādāyā’’ti. Paṭiggahesi bhagavā anukampaṃ upādāya. ‘‘Sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘manāpadāyī labhate manāpa’nti. Manāpaṃ me, bhante, sampannakolakaṃ sūkaramaṃsaṃ [sampannasūkaramaṃsaṃ (sī.), sampannavarasūkaramaṃsaṃ (syā.)]; taṃ me bhagavā paṭiggaṇhātu anukampaṃ upādāyā’’ti. Paṭiggahesi bhagavā anukampaṃ upādāya. ‘‘Sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘manāpadāyī labhate manāpa’nti. Manāpaṃ me, bhante, nibbattatelakaṃ [nibaddhatelakaṃ (pī. sī. aṭṭha.), nibbaṭṭatelakaṃ (syā. aṭṭha.)] nāliyasākaṃ; taṃ me bhagavā paṭiggaṇhātu anukampaṃ upādāyā’’ti. Paṭiggahesi bhagavā anukampaṃ upādāya. ‘‘Sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘manāpadāyī labhate manāpa’nti. Manāpo me, bhante, sālīnaṃ odano vicitakāḷako [vigatakālako (syā. kaṃ. pī. ka.)] anekasūpo anekabyañjano; taṃ me bhagavā paṭiggaṇhātu anukampaṃ upādāyā’’ti. Paṭiggahesi bhagavā anukampaṃ upādāya. ‘‘Sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘manāpadāyī labhate manāpa’nti. Manāpāni me, bhante, kāsikāni vatthāni; tāni me bhagavā paṭiggaṇhātu anukampaṃ upādāyā’’ti. Paṭiggahesi bhagavā anukampaṃ upādāya. ‘‘Sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘manāpadāyī labhate manāpa’nti. Manāpo me, bhante, pallaṅko gonakatthato paṭalikatthato kadalimigapavarapaccattharaṇo [kādalimigapavarapaccattharaṇo (sī.)] sauttaracchado ubhatolohitakūpadhāno. Api ca, bhante, mayampetaṃ jānāma – ‘netaṃ bhagavato kappatī’ti. Idaṃ me, bhante, candanaphalakaṃ agghati adhikasatasahassaṃ; taṃ me bhagavā paṭiggaṇhātu anukampaṃ upādāyā’’ti. Paṭiggahesi bhagavā anukampaṃ upādāya. Atha kho bhagavā uggaṃ gahapatiṃ vesālikaṃ iminā anumodanīyena anumodi – ‘‘Manāpadāyī labhate manāpaṃ, Yo ujjubhūtesu [ujubhūtesu (syā. kaṃ. pī.)] dadāti chandasā; Acchādanaṃ sayanamannapānaṃ [sayanamathannapānaṃ (sī. syā. kaṃ. pī.)], Nānāppakārāni ca paccayāni. ‘‘Cattañca muttañca anuggahītaṃ [anaggahītaṃ (sī. syā. kaṃ. pī.)], Khettūpame arahante viditvā; So duccajaṃ sappuriso cajitvā, Manāpadāyī labhate manāpa’’nti. Atha kho bhagavā uggaṃ gahapatiṃ vesālikaṃ iminā anumodanīyena anumoditvā uṭṭhāyāsanā pakkāmi. Atha kho uggo gahapati vesāliko aparena samayena kālamakāsi. Kālaṅkato [kālakato (sī. syā. kaṃ. pī.)] ca uggo gahapati vesāliko aññataraṃ manomayaṃ kāyaṃ upapajji. Tena kho pana samayena bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho uggo devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho uggaṃ devaputtaṃ bhagavā etadavoca – ‘‘kacci te, ugga, yathādhippāyo’’ti? ‘‘Taggha me, bhagavā, yathādhippāyo’’ti. Atha kho bhagavā uggaṃ devaputtaṃ gāthāhi ajjhabhāsi – ‘‘Manāpadāyī labhate manāpaṃ, Aggassa dātā labhate punaggaṃ; Varassa dātā varalābhi hoti, Seṭṭhaṃ dado seṭṭhamupeti ṭhānaṃ. ‘‘Yo aggadāyī varadāyī, seṭṭhadāyī ca yo naro; Dīghāyu yasavā hoti, yattha yatthūpapajjatī’’ti. catutthaṃ;",
      "english": "On one occasion the Blessed One was dwelling in Vesālī, in the Great Wood, in the Gabled Hall.\n\nThen, in the forenoon, having dressed and taking his bowl and robe, the Blessed One went to the dwelling of Ugga, the householder of Vesālī. Having approached, he sat down on the seat prepared for him. Then Ugga, the householder of Vesālī, went to where the Blessed One was. Having approached and respectfully saluted the Blessed One, he sat down to one side. Seated to one side, Ugga, the householder of Vesālī, said to the Blessed One: \"From the presence of the Blessed One, Venerable Sir, I have heard and directly received this teaching: 'One who gives what is agreeable receives what is agreeable.' Venerable Sir, this edible *sāla*-flower confection is agreeable to me. May the Blessed One accept it out of compassion for me.\" The Blessed One accepted it out of compassion. \"From the presence of the Blessed One, Venerable Sir, I have heard and directly received this teaching: 'One who gives what is agreeable receives what is agreeable.' Venerable Sir, this pork prepared with jujube fruit is agreeable to me. May the Blessed One accept it out of compassion for me.\" The Blessed One accepted it out of compassion. \"From the presence of the Blessed One, Venerable Sir, I have heard and directly received this teaching: 'One who gives what is agreeable receives what is agreeable.' Venerable Sir, these *nāḷi* greens freshly prepared with oil are agreeable to me. May the Blessed One accept them out of compassion for me.\" The Blessed One accepted them out of compassion. \"From the presence of the Blessed One, Venerable Sir, I have heard and directly received this teaching: 'One who gives what is agreeable receives what is agreeable.' Venerable Sir, this fine-grain rice, well-sorted and free from black grains, with many curries and many sauces, is agreeable to me. May the Blessed One accept it out of compassion for me.\" The Blessed One accepted it out of compassion. \"From the presence of the Blessed One, Venerable Sir, I have heard and directly received this teaching: 'One who gives what is agreeable receives what is agreeable.' Venerable Sir, these fine Benares cloths are agreeable to me. May the Blessed One accept them out of compassion for me.\" The Blessed One accepted them out of compassion. \"From the presence of the Blessed One, Venerable Sir, I have heard and directly received this teaching: 'One who gives what is agreeable receives what is agreeable.' Venerable Sir, this couch is agreeable to me: spread with a long-haired wool rug, spread with a patchwork rug of variegated hues, covered with an excellent antelope hide, with a canopy, and with red cushions at both ends. However, Venerable Sir, we know that this is not fitting for the Blessed One. But this sandalwood plank, Venerable Sir, is worth more than a hundred thousand. May the Blessed One accept it out of compassion for me.\" The Blessed One accepted it out of compassion.\n\nThen the Blessed One expressed his appreciation to Ugga, the householder of Vesālī, with this verse of thanks:\n\"One who gives what is agreeable receives what is agreeable.\nWhoever gives with devotion to those who are upright,\nGives clothing, bedding, food, drink, and various other requisites.\nKnowing the Arahants, who are like a field (for merit),\nThose who have relinquished and are liberated, unhindered,\nThat good person, having given up what is hard to abandon,\nReceives what is agreeable, for one who gives what is agreeable receives what is agreeable.\"\n\nThen the Blessed One, having expressed his appreciation to Ugga, the householder of Vesālī, with that verse of thanks, rose from his seat and departed.\n\nThen Ugga, the householder of Vesālī, passed away at a later time. And having passed away, Ugga, the householder of Vesālī, reappeared in a certain mind-made body (as a deva).\n\nNow at that time the Blessed One was dwelling in Sāvatthī, in Jeta Grove, Anāthapiṇḍika's Park. Then the deva Ugga, when the night was far advanced, with resplendent beauty, illuminating the entire Jeta Grove, approached where the Blessed One was. Having approached and respectfully saluted the Blessed One, he stood to one side. The Blessed One said to the deva Ugga, standing to one side: \"Ugga, has it been as you wished?\" \"Indeed, Blessed One, it has been as I wished.\"\n\nThen the Blessed One addressed the deva Ugga with these verses:\n\"One who gives what is agreeable receives what is agreeable.\nOne who gives what is excellent receives excellence in return.\nOne who gives what is supreme obtains what is supreme.\nOne who gives what is foremost attains a foremost position.\nThat person who gives what is excellent, what is supreme, what is foremost,\nBecomes long-lived and renowned wherever they may be reborn.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ වෙසාලි නුවර, මහාවනයෙහි, කූටාගාර ශාලාවෙහි වැඩසිටින සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන, වෙසාලි නුවර උග්ග ගෘහපතියාගේ නිවස වෙත වැඩිය සේක; වැඩම කොට පනවන ලද අසුනෙහි වැඩසිටි සේක. ඉක්බිති වෙසාලි නුවර උග්ග ගෘහපතියා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි වෙසාලි නුවර උග්ග ගෘහපතියා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “වහන්ස, ‘ප්‍රිය දෙය දෙන තැනැත්තාට ප්‍රිය දේ ලැබෙයි’ යනු මා විසින් භාග්‍යවතුන් වහන්සේගෙන් මුහුණට මුහුණ අසා, මුහුණට මුහුණ පිළිගන්නා ලද්දකි. වහන්ස, මේ සල්මල් කැවිල්ල මට ප්‍රියය; එය මා කෙරෙහි අනුකම්පාවෙන් භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!” භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් එය පිළිගත් සේක.\n\n“වහන්ස, ‘ප්‍රිය දෙය දෙන තැනැත්තාට ප්‍රිය දේ ලැබෙයි’ යනු මා විසින් භාග්‍යවතුන් වහන්සේගෙන් මුහුණට මුහුණ අසා, මුහුණට මුහුණ පිළිගන්නා ලද්දකි. වහන්ස, මේ රසවත් වූ කොළ සහිත ඌරුමස් මට ප්‍රියය; එය මා කෙරෙහි අනුකම්පාවෙන් භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!” භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් එය පිළිගත් සේක.\n\n“වහන්ස, ‘ප්‍රිය දෙය දෙන තැනැත්තාට ප්‍රිය දේ ලැබෙයි’ යනු මා විසින් භාග්‍යවතුන් වහන්සේගෙන් මුහුණට මුහුණ අසා, මුහුණට මුහුණ පිළිගන්නා ලද්දකි. වහන්ස, මේ හොඳින් තෙලින් පිසින ලද නාලියසාකය මට ප්‍රියය; එය මා කෙරෙහි අනුකම්පාවෙන් භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!” භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් එය පිළිගත් සේක.\n\n“වහන්ස, ‘ප්‍රිය දෙය දෙන තැනැත්තාට ප්‍රිය දේ ලැබෙයි’ යනු මා විසින් භාග්‍යවතුන් වහන්සේගෙන් මුහුණට මුහුණ අසා, මුහුණට මුහුණ පිළිගන්නා ලද්දකි. වහන්ස, මේ නොයෙක් සූප වර්ග සහිත, නොයෙක් ව්‍යංජන සහිත, විචිත්‍ර, කළු නොවන (පිරිසිදු) හාලේ බත් මට ප්‍රියය; එය මා කෙරෙහි අනුකම්පාවෙන් භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!” භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් එය පිළිගත් සේක.\n\n“වහන්ස, ‘ප්‍රිය දෙය දෙන තැනැත්තාට ප්‍රිය දේ ලැබෙයි’ යනු මා විසින් භාග්‍යවතුන් වහන්සේගෙන් මුහුණට මුහුණ අසා, මුහුණට මුහුණ පිළිගන්නා ලද්දකි. වහන්ස, මේ කාසි රටේ වස්ත්‍ර මට ප්‍රියය; ඒවා මා කෙරෙහි අනුකම්පාවෙන් භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!” භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් ඒවා පිළිගත් සේක.\n\n“වහන්ස, ‘ප්‍රිය දෙය දෙන තැනැත්තාට ප්‍රිය දේ ලැබෙයි’ යනු මා විසින් භාග්‍යවතුන් වහන්සේගෙන් මුහුණට මුහුණ අසා, මුහුණට මුහුණ පිළිගන්නා ලද්දකි. වහන්ස, මේ ගොනක පලසින් එලන ලද, පටලික පලසින් එලන ලද, කදලි මෘගයාගේ උසස් ලොම් ඇති එලන ලද අසුනක්, උඩුවියන සහිත වූ, දෙපස රතු කොට්ට සහිත වූ යහන මට ප්‍රියය. එහෙත්, වහන්ස, ‘මේ භාග්‍යවතුන් වහන්සේට සුදුසු නැත’ යනු අපි දනිමු. වහන්ස, මේ චන්දන ලෑල්ල ලක්ෂයකට අධික වටිනාකමක් ඇත; එය මා කෙරෙහි අනුකම්පාවෙන් භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!” භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් එය පිළිගත් සේක.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ වෙසාලි නුවර උග්ග ගෘහපතියාට මේ අනුමෝදනාවෙන් අනුමෝදන් වූ සේක:\n“ප්‍රිය දේ දෙන තැනැත්තාට ප්‍රිය දේම ලැබෙයි, යමෙක් කෙලින් වූ සිත් ඇති අයට කැමැත්තෙන් දන් දෙන්නේද; වස්ත්‍ර, සයන, ආහාරපාන, නොයෙක් ප්‍රත්‍ය වර්ග (දන් දෙන්නේද). අත්හැර දමා, මුදා හැර, අනුග්‍රහයෙන් යුතුව, පුණ්‍ය ක්ෂේත්‍රයක් බඳු වූ අරහත් උතුමන් දැන, ඒ සත්පුරුෂයා අත්හැරීමට දුෂ්කර වූ දේ අත්හැර, ප්‍රිය දේ දෙන තැනැත්තාට ප්‍රිය දේම ලැබෙයි.”\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ වෙසාලි නුවර උග්ග ගෘහපතියාට මේ අනුමෝදනාවෙන් අනුමෝදන් වී, අසුනෙන් නැඟිට වැඩම කළ සේක. ඉක්බිති වෙසාලි නුවර උග්ග ගෘහපතියා පසු කලෙක මිය ගියේය. මිය පරලොව ගිය වෙසාලි නුවර උග්ග ගෘහපතියා යම්කිසි මනෝමය කයක උපත ලැබීය.\n\nඒ සමයෙහි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර, ජේතවනයෙහි, අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක. ඉක්බිති උග්ග නම් දෙවියෝ, රාත්‍රියේ අතිශයින් දීප්තිමත් වර්ණ ඇතිව, මුළු ජේතවනයම ආලෝකමත් කොට, භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක සිටියේය. එකත්පසෙක සිටි උග්ග නම් දෙවියාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “උග්ග, ඔබට ඔබේ අභිප්‍රාය පරිදි සිදු වීද?” “භාග්‍යවතුන් වහන්ස, ඇත්තෙන්ම මගේ අභිප්‍රාය පරිදි සිදු වී ඇත.” ඉක්බිති භාග්‍යවතුන් වහන්සේ උග්ග නම් දෙවියාට ගාථාවලින් මෙය වදාළ සේක:\n\n“ප්‍රිය දේ දෙන තැනැත්තාට ප්‍රිය දේම ලැබෙයි, අග්‍ර වූ දේ දෙන තැනැත්තාට නැවතත් අග්‍ර වූ දේම ලැබෙයි; උතුම් දේ දෙන තැනැත්තාට උතුම් ලාභ ලැබේ, ශ්‍රේෂ්ඨ දේ දෙන තැනැත්තා ශ්‍රේෂ්ඨ ස්ථානයකට පැමිණෙයි.\n\nයම් පුද්ගලයෙක් අග්‍ර දායකයෙක්ද, උතුම් දේ දෙන දායකයෙක්ද, ශ්‍රේෂ්ඨ දේ දෙන දායකයෙක්ද වේද; ඔහු උපදින උපදින සෑම තැනකම දීර්ඝායුෂ්ක වේ, යසස් ඇතියෙක් වේ.”",
      "paliTitle": "Manāpadāyīsuttaṃ"
    },
    {
      "number": 45,
      "pali": "‘‘Pañcime, bhikkhave, puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. ‘‘Katame pañca? Yassa, bhikkhave, bhikkhu cīvaraṃ paribhuñjamāno appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. ‘‘Yassa, bhikkhave, bhikkhu piṇḍapātaṃ paribhuñjamāno…pe… yassa, bhikkhave, bhikkhu vihāraṃ paribhuñjamāno…pe… yassa, bhikkhave, bhikkhu mañcapīṭhaṃ paribhuñjamāno…pe…. ‘‘Yassa, bhikkhave, bhikkhu gilānapaccayabhesajjaparikkhāraṃ paribhuñjamāno appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattati. Ime kho, bhikkhave, pañca puññābhisandā kusalābhisandā sukhassāhārā sovaggikā sukhavipākā saggasaṃvattanikā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. ‘‘Imehi ca pana, bhikkhave, pañcahi puññābhisandehi kusalābhisandehi samannāgatassa ariyasāvakassa na sukaraṃ puññassa pamāṇaṃ gahetuṃ – ‘ettako puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattatī’ti. Atha kho asaṅkheyyo appameyyo mahāpuññakkhandhotveva saṅkhaṃ gacchati. ‘‘Seyyathāpi, bhikkhave, mahāsamudde na sukaraṃ udakassa pamāṇaṃ gahetuṃ – ‘ettakāni udakāḷhakānīti vā ettakāni udakāḷhakasatānīti vā ettakāni udakāḷhakasahassānīti vā ettakāni udakāḷhakasatasahassānīti vā; atha kho asaṅkheyyo appameyyo mahāudakakkhandhotveva saṅkhaṃ gacchati’. Evamevaṃ kho, bhikkhave, imehi pañcahi puññābhisandehi kusalābhisandehi samannāgatassa ariyasāvakassa na sukaraṃ puññassa pamāṇaṃ gahetuṃ – ‘ettako puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattatī’ti. Atha kho asaṅkheyyo appameyyo mahāpuññakkhandhotveva saṅkhaṃ gacchatī’’ti. ‘‘Mahodadhiṃ aparimitaṃ mahāsaraṃ, Bahubheravaṃ ratnagaṇānamālayaṃ; Najjo yathā naragaṇasaṅghasevitā [maccha gaṇasaṃghasevitā (syā. kaṃ. ka.) saṃ. ni. 5.1037 passitabbaṃ], Puthū savantī upayanti sāgaraṃ. ‘‘Evaṃ naraṃ annadapānavatthadaṃ, Seyyānisajjattharaṇassa dāyakaṃ; Puññassa dhārā upayanti paṇḍitaṃ, Najjo yathā vārivahāva sāgara’’nti. pañcamaṃ;",
      "english": "Bhikkhus, these five streams of merit, streams of wholesome action, are sustenance for happiness, conducive to heavenly rebirth, resulting in happiness, conducive to celestial realms, and lead to what is desirable, agreeable, pleasing, beneficial, and happiness. Which five?\n\nBhikkhus, when a monk, while using robes, dwells having attained immeasurable concentration of mind, for him there is an immeasurable stream of merit, a stream of wholesome action, sustenance for happiness, conducive to heavenly rebirth, resulting in happiness, conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.\n\nBhikkhus, when a monk, while using alms food, dwells having attained immeasurable concentration of mind, for him there is an immeasurable stream of merit, a stream of wholesome action, sustenance for happiness, conducive to heavenly rebirth, resulting in happiness, conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.\n\nBhikkhus, when a monk, while using a dwelling, dwells having attained immeasurable concentration of mind, for him there is an immeasurable stream of merit, a stream of wholesome action, sustenance for happiness, conducive to heavenly rebirth, resulting in happiness, conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.\n\nBhikkhus, when a monk, while using a bed or a chair, dwells having attained immeasurable concentration of mind, for him there is an immeasurable stream of merit, a stream of wholesome action, sustenance for happiness, conducive to heavenly rebirth, resulting in happiness, conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.\n\nBhikkhus, when a monk, while using requisites for the sick and medicine, dwells having attained immeasurable concentration of mind, for him there is an immeasurable stream of merit, a stream of wholesome action, sustenance for happiness, conducive to heavenly rebirth, resulting in happiness, conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.\n\nThese, Bhikkhus, are the five streams of merit, streams of wholesome action, sustenance for happiness, conducive to heavenly rebirth, resulting in happiness, conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.\n\nFurthermore, Bhikkhus, for a noble disciple endowed with these five streams of merit and streams of wholesome action, it is not easy to measure the amount of merit, saying: ‘So much is the stream of merit, the stream of wholesome action, the sustenance for happiness, the leading to heavenly rebirth, the resulting in happiness, the conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.’ Rather, it is reckoned as an immeasurable, incalculable, great mass of merit.\n\nJust as, Bhikkhus, in the great ocean, it is not easy to measure the amount of water, saying: ‘So many measures of water,’ or ‘So many hundreds of measures of water,’ or ‘So many thousands of measures of water,’ or ‘So many hundreds of thousands of measures of water’; rather, it is reckoned as an immeasurable, incalculable, great mass of water. In the same way, Bhikkhus, for a noble disciple endowed with these five streams of merit and streams of wholesome action, it is not easy to measure the amount of merit, saying: ‘So much is the stream of merit, the stream of wholesome action, the sustenance for happiness, the leading to heavenly rebirth, the resulting in happiness, the conducive to celestial realms, and leading to what is desirable, agreeable, pleasing, beneficial, and happiness.’ Rather, it is reckoned as an immeasurable, incalculable, great mass of merit.\n\nJust as many rivers, frequented by crowds of people, flow into the great ocean, measureless, with its vast expanse, teeming with many fearsome creatures, and an abode of various gems;\nSo too do streams of merit flow into a wise person who gives food, drink, and clothing, and who provides beds, seats, and coverings, just as water-bearing rivers flow into the ocean.",
      "sinhala": "භික්ෂූණි, මේ පස් ආකාරයක පුණ්‍ය​ප්‍රවාහයෝ ද, කුශල​ප්‍රවාහයෝ ද, සැපයට හේතුවන්නාහු ද, ස්වර්ගයට අයත් වන්නාහු ද, සුඛ විපාක ඇත්තාහු ද, ස්වර්ගයට පමුණුවන්නාහු ද, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී. ඒ පස්දෙනා කවරහු ද?\n\nභික්ෂූණි, යම් භික්ෂුවක් සිවුරු පරිභෝජනය කරමින් අප්‍රමාණ චේතෝසමාධියට පැමිණ වාසය කරන්නේ ද, ඔහුට ඒ අප්‍රමාණ පුණ්‍ය​ප්‍රවාහය, කුශල​ප්‍රවාහය, සැපයට හේතුව, ස්වර්ගයට අයත් වූවක්, සුඛ විපාක ඇත්තක්, ස්වර්ගයට පමුණුවන්නක්, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී.\n\nභික්ෂූණි, යම් භික්ෂුවක් පිණ්ඩපාතය පරිභෝජනය කරමින් අප්‍රමාණ චේතෝසමාධියට පැමිණ වාසය කරන්නේ ද, ඔහුට ඒ අප්‍රමාණ පුණ්‍ය​ප්‍රවාහය, කුශල​ප්‍රවාහය, සැපයට හේතුව, ස්වර්ගයට අයත් වූවක්, සුඛ විපාක ඇත්තක්, ස්වර්ගයට පමුණුවන්නක්, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී.\n\nභික්ෂූණි, යම් භික්ෂුවක් විහාරය පරිභෝජනය කරමින් අප්‍රමාණ චේතෝසමාධියට පැමිණ වාසය කරන්නේ ද, ඔහුට ඒ අප්‍රමාණ පුණ්‍ය​ප්‍රවාහය, කුශල​ප්‍රවාහය, සැපයට හේතුව, ස්වර්ගයට අයත් වූවක්, සුඛ විපාක ඇත්තක්, ස්වර්ගයට පමුණුවන්නක්, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී.\n\nභික්ෂූණි, යම් භික්ෂුවක් යහන් හා අසුන් (ශයනාසන) පරිභෝජනය කරමින් අප්‍රමාණ චේතෝසමාධියට පැමිණ වාසය කරන්නේ ද, ඔහුට ඒ අප්‍රමාණ පුණ්‍ය​ප්‍රවාහය, කුශල​ප්‍රවාහය, සැපයට හේතුව, ස්වර්ගයට අයත් වූවක්, සුඛ විපාක ඇත්තක්, ස්වර්ගයට පමුණුවන්නක්, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී.\n\nභික්ෂූණි, යම් භික්ෂුවක් ගිලන්පස බේත්හේත් පිරිත්කර පරිභෝජනය කරමින් අප්‍රමාණ චේතෝසමාධියට පැමිණ වාසය කරන්නේ ද, ඔහුට ඒ අප්‍රමාණ පුණ්‍ය​ප්‍රවාහය, කුශල​ප්‍රවාහය, සැපයට හේතුව, ස්වර්ගයට අයත් වූවක්, සුඛ විපාක ඇත්තක්, ස්වර්ගයට පමුණුවන්නක්, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී.\n\nභික්ෂූණි, මේ පස් ආකාරයක පුණ්‍ය​ප්‍රවාහයෝ ද, කුශල​ප්‍රවාහයෝ ද, සැපයට හේතුවන්නාහු ද, ස්වර්ගයට අයත් වන්නාහු ද, සුඛ විපාක ඇත්තාහු ද, ස්වර්ගයට පමුණුවන්නාහු ද, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී.\n\nභික්ෂූණි, මේ පස් ආකාරයක පුණ්‍ය​ප්‍රවාහයන්ගෙන් ද, කුශල​ප්‍රවාහයන්ගෙන් ද යුක්ත වූ ආර්ය ශ්‍රාවකයාට, 'මෙපමණ පුණ්‍ය​ප්‍රවාහයකුත්, කුශල​ප්‍රවාහයකුත්, සැපයට හේතුවකුත්, ස්වර්ගයට අයත් වූවකුත්, සුඛ විපාක ඇත්තකුත්, ස්වර්ගයට පමුණුවන්නකුත්, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී' යැයි පුණ්‍ය ප්‍රමාණය මැනීමට පහසු නැත. එහෙත් එය අසංඛෙය්‍ය වූ, අප්‍රමේය වූ මහත් පුණ්‍ය​ස්කන්ධයක් වශයෙන් ම ගණනට යන්නේ ය.\n\nභික්ෂූණි, යම් සේ මහා සාගරයේ ජල ප්‍රමාණය 'මෙපමණ ආළක ප්‍රමාණ ජලය යැයි හෝ, මෙපමණ ආළක සිය ගණන් ජලය යැයි හෝ, මෙපමණ ආළක දහස් ගණන් ජලය යැයි හෝ, මෙපමණ ආළක ලක්ෂ ගණන් ජලය යැයි හෝ' මැනීමට පහසු නො වේ ද, එහෙත් එය අසංඛෙය්‍ය වූ, අප්‍රමේය වූ මහත් ජලස්කන්ධයක් වශයෙන් ම ගණනට යන්නේ ද, භික්ෂූණි, එසේම මේ පස් ආකාරයක පුණ්‍ය​ප්‍රවාහයන්ගෙන් ද, කුශල​ප්‍රවාහයන්ගෙන් ද යුක්ත වූ ආර්ය ශ්‍රාවකයාට, 'මෙපමණ පුණ්‍ය​ප්‍රවාහයකුත්, කුශල​ප්‍රවාහයකුත්, සැපයට හේතුවකුත්, ස්වර්ගයට අයත් වූවකුත්, සුඛ විපාක ඇත්තකුත්, ස්වර්ගයට පමුණුවන්නකුත්, කැමති ද, මනාප ද, හිතකර ද, සැප ද පිණිස පවතී' යැයි පුණ්‍ය ප්‍රමාණය මැනීමට පහසු නො වේ. එහෙත් එය අසංඛෙය්‍ය වූ, අප්‍රමේය වූ මහත් පුණ්‍ය​ස්කන්ධයක් වශයෙන් ම ගණනට යන්නේ ය.\n\nඅප්‍රමාණ ජලස්කන්ධයකින් යුක්ත වූ, ගැඹුරු වූ, මහත් භයානක වූ, රත්න සමූහයන්ට වාසස්ථාන වූ මහා සාගරයට, මිනිස් සමූහයන් විසින් සේවනය කරනු ලබන ගංගා රාශියක් ගලා බසිමින් පැමිණෙන්නේ යම් සේ ද,\n\nඒ අයුරින් ම ආහාර ද, පාන ද, වස්ත්‍ර ද දෙන්නා වූ, ශයනාසන (යහන් හා අසුන්) දෙන්නා වූ ඒ පණ්ඩිත පුරුෂයා වෙත, ජලය ගෙන යන ගංගා සාගරයට පැමිණෙන්නා සේ, පුණ්‍යධාරාවෝ පැමිණෙති.",
      "paliTitle": "Puññābhisandasuttaṃ"
    },
    {
      "number": 46,
      "pali": "‘‘Pañcimā, bhikkhave, sampadā. Katamā pañca? Saddhāsampadā, sīlasampadā, sutasampadā, cāgasampadā, paññāsampadā – imā kho, bhikkhave, pañca sampadā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these five accomplishments. Which five? The accomplishment of faith, the accomplishment of moral virtue, the accomplishment of extensive learning, the accomplishment of generosity, and the accomplishment of wisdom. These, Monks, are the five accomplishments.",
      "sinhala": "මහණෙනි, මේ සම්පත් පසෙකි. ඒ පස කවරේද? ශ්‍රද්ධා සම්පත්තිය, ශීල සම්පත්තිය, සුත සම්පත්තිය, ත්‍යාග සම්පත්තිය, ප්‍ර‍‌ඥා සම්පත්තිය යනුයි. මහණෙනි, මේ සම්පත් පස නම් මේවාම ය. සයවැන්නයි.",
      "paliTitle": "Sampadāsuttaṃ"
    },
    {
      "number": 47,
      "pali": "‘‘Pañcimāni, bhikkhave, dhanāni. Katamāni pañca? Saddhādhanaṃ, sīladhanaṃ, sutadhanaṃ, cāgadhanaṃ, paññādhanaṃ. ‘‘Katamañca, bhikkhave, saddhādhanaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Idaṃ vuccati, bhikkhave, saddhādhanaṃ. ‘‘Katamañca, bhikkhave, sīladhanaṃ? Idha, bhikkhave, ariyasāvako pāṇātipātā paṭivirato hoti… pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Idaṃ vuccati, bhikkhave, sīladhanaṃ. ‘‘Katamañca, bhikkhave, sutadhanaṃ? Idha, bhikkhave, ariyasāvako bahussuto hoti…pe… diṭṭhiyā suppaṭividdho. Idaṃ vuccati, bhikkhave, sutadhanaṃ. ‘‘Katamañca, bhikkhave, cāgadhanaṃ? Idha, bhikkhave, ariyasāvako vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato. Idaṃ vuccati, bhikkhave, cāgadhanaṃ. ‘‘Katamañca, bhikkhave, paññādhanaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Idaṃ vuccati, bhikkhave, paññādhanaṃ. Imāni kho, bhikkhave, pañca dhanānī’’ti. [a. ni. 4.52] ‘‘Yassa saddhā tathāgate, acalā suppatiṭṭhitā; Sīlañca yassa kalyāṇaṃ, ariyakantaṃ pasaṃsitaṃ. ‘‘Saṅghe pasādo yassatthi, ujubhūtañca dassanaṃ; Adaliddoti taṃ āhu, amoghaṃ tassa jīvitaṃ. ‘‘Tasmā saddhañca sīlañca, pasādaṃ dhammadassanaṃ; Anuyuñjetha medhāvī, saraṃ buddhāna sāsana’’nti. sattamaṃ;",
      "english": "Bhikkhus, there are these five treasures. Which five? The treasure of conviction, the treasure of moral virtue, the treasure of learning, the treasure of generosity, and the treasure of wisdom.\n\nAnd what, bhikkhus, is the treasure of conviction? Here, bhikkhus, a noble disciple is convinced; they place their conviction in the Tathāgata’s enlightenment, thinking: ‘Indeed, the Blessed One is an Arahant, perfectly enlightened, endowed with knowledge and conduct, sublime, the knower of worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.’ This, bhikkhus, is called the treasure of conviction.\n\nAnd what, bhikkhus, is the treasure of moral virtue? Here, bhikkhus, a noble disciple abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, and abstains from fermented and distilled liquors which are the basis for heedlessness. This, bhikkhus, is called the treasure of moral virtue.\n\nAnd what, bhikkhus, is the treasure of learning? Here, bhikkhus, a noble disciple is learned, remembering and retaining what they have heard. They are learned in the teachings that are good in the beginning, good in the middle, and good in the end, with their meaning and phrasing, proclaiming the entirely perfect and pure spiritual life. Such teachings are extensively heard by them, retained, recited often, pondered mentally, and thoroughly penetrated with understanding. This, bhikkhus, is called the treasure of learning.\n\nAnd what, bhikkhus, is the treasure of generosity? Here, bhikkhus, a noble disciple lives in a home with a mind free from the stain of stinginess, open-handed, pure of hand, delighting in relinquishment, amenable to requests, and delighting in sharing gifts. This, bhikkhus, is called the treasure of generosity.\n\nAnd what, bhikkhus, is the treasure of wisdom? Here, bhikkhus, a noble disciple is wise, endowed with wisdom that discerns rise and fall, noble, penetrating, leading to the complete destruction of suffering. This, bhikkhus, is called the treasure of wisdom. These, bhikkhus, are the five treasures.\n\nFor one whose conviction in the Tathāgata is unwavering and well-established,\nAnd whose moral virtue is excellent, dear to the noble ones, and praised;\n\nOne who has serene confidence in the Saṅgha, and whose vision is straight,\nThey are called ‘not poor’; their life is not in vain.\n\nTherefore, a wise person, remembering the Buddha’s teaching,\nShould continually apply themselves to conviction, moral virtue, serene confidence, and the vision of the Dhamma.",
      "sinhala": "මහණෙනි, මේ ධනයෝ පසකි. කවරේද ඒ පස? ශ්‍රද්ධා ධනය, සීල ධනය, ශ්‍රැත ධනය, ත්‍යාග ධනය, ප්‍රඥා ධනය යන මේවාය.\n\nමහණෙනි, ශ්‍රද්ධා ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යය ශ්‍රාවක තෙම ශ්‍රද්ධා ඇත්තෙක් වේ. ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධෝ, භගවා යන ගුණාංගවලින් යුක්ත යැයි තථාගතයන් වහන්සේගේ සම්බුද්ධත්වයට විශ්වාසය තබයි. මහණෙනි, මේ ශ්‍රද්ධා ධනය යයි කියනු ලැබේ.\n\nමහණෙනි, සීල ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යය ශ්‍රාවක තෙම පණිවාතයෙන් වැළකුණේ වේ, අදත්තාදානයෙන් වැළකුණේ වේ, කාමමිථ්‍යාචාරයෙන් වැළකුණේ වේ, මුසාවාදයෙන් වැළකුණේ වේ, සුරාමේරය මද්‍යප්‍රමාදස්ථානයෙන් වැළකුණේ වේ. මහණෙනි, මේ සීල ධනය යයි කියනු ලැබේ.\n\nමහණෙනි, ශ්‍රැත ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යය ශ්‍රාවක තෙම බොහෝ ඇසූකන් ඇත්තෙක් වේ; ඇසූ දෑ ධාරණය කර ගත්තෙක් වේ, වචනයෙන් මනාව පුරුදු කළේ වේ, මනසින් විමසුවේ වේ, (සත්‍ය) දැක්මෙන් මනාව විනිවිද දන්නේ වේ. මහණෙනි, මේ ශ්‍රැත ධනය යයි කියනු ලැබේ.\n\nමහණෙනි, ත්‍යාග ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යය ශ්‍රාවක තෙම පහ වූ මසුරුමල කෙලෙස් ඇති සිතින් යුක්තව ගිහි ගෙදර වාසය කරයි. ඔහු මුදා හරින ලද දානයෙන් යුක්ත වූ, පිරිසිදු අත් ඇති, අත් හැරීමෙහි ඇලුණු, යාචකයනට සමීප වූ, දන් බෙදා දීමෙහි ඇලුණු (පුද්ගලයෙකි). මහණෙනි, මේ ත්‍යාග ධනය යයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රඥා ධනය කවරේද? මහණෙනි, මෙහිලා ආර්යය ශ්‍රාවක තෙම ප්‍රඥාවන්තයෙක් වේ. හට ගැනීම හා විනාශය දැකීමේ ප්‍රඥාවෙන් යුක්ත වූ, (කෙලෙස්) සිඳ බිඳ දමන ආර්ය ප්‍රඥාවෙන් යුක්ත වූ, නිවැරදිව දුක් ක්ෂය කිරීම කරා පමුණුවන ප්‍රඥාවෙන් යුක්ත වූ (පුද්ගලයෙකි). මහණෙනි, මේ ප්‍රඥා ධනය යයි කියනු ලැබේ. මහණෙනි, මේ ධනයෝ පස වෙති.\n\nතථාගතයන් වහන්සේ කෙරෙහි යමෙකුගේ ශ්‍රද්ධාව නොසැලී මනාව පිහිටා ඇත්ද; යමෙකුගේ සීලය ද යහපත් වූ, ආර්යයන් විසින් කැමති වූ, ප්‍රශංසනීය වූවක් වේද; සංඝයා කෙරෙහි යමෙකුට ප්‍රසාදය ඇත්ද, (සත්‍යය කෙරෙහි) අවංක වූ දැක්මක් ඇත්ද; ඔවුහු ඔහු දරිද්‍රයෙක් නොවේ යයි කියති; ඔහුගේ ජීවිතය ද නිරර්ථක නොවන්නේය.\n\nඑහෙයින්, ප්‍රඥාවන්තයා බුදුවරුන්ගේ ශාසනය සිහි කරමින් ශ්‍රද්ධාව ද, සීලය ද, (සංඝයා කෙරෙහි) ප්‍රසාදය ද, ධර්ම දැක්ම ද (මනාව) පුරුදු කළ යුතුය.",
      "paliTitle": "Dhanasuttaṃ"
    },
    {
      "number": 48,
      "pali": "‘‘Pañcimāni, bhikkhave, alabbhanīyāni ṭhānāni samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Katamāni pañca? ‘Jarādhammaṃ mā jīrī’ti alabbhanīyaṃ ṭhānaṃ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. ‘Byādhidhammaṃ mā byādhīyī’ti [vyādhidhammaṃ ‘‘mā vyādhīyī’’ti (sī. pī.)] …pe… ‘maraṇadhammaṃ mā mīyī’ti… ‘khayadhammaṃ mā khīyī’ti… ‘nassanadhammaṃ mā nassī’ti alabbhanīyaṃ ṭhānaṃ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. ‘‘Assutavato, bhikkhave, puthujjanassa jarādhammaṃ jīrati. So jarādhamme jiṇṇe na iti paṭisañcikkhati – ‘na kho mayhevekassa [mayhamevekassa (sī.)] jarādhammaṃ jīrati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ jarādhammaṃ jīrati. Ahañceva [ahañce (?)] kho pana jarādhamme jiṇṇe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ [kammantopi nappavatteyya (ka.)], amittāpi attamanā assu, mittāpi dummanā assū’ti. So jarādhamme jiṇṇe socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘assutavā puthujjano viddho savisena sokasallena attānaṃyeva paritāpeti’’’. ‘‘Puna caparaṃ, bhikkhave, assutavato puthujjanassa byādhidhammaṃ byādhīyati…pe… maraṇadhammaṃ mīyati… khayadhammaṃ khīyati… nassanadhammaṃ nassati. So nassanadhamme naṭṭhe na iti paṭisañcikkhati – ‘na kho mayhevekassa nassanadhammaṃ nassati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ nassanadhammaṃ nassati. Ahañceva kho pana nassanadhamme naṭṭhe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ, amittāpi attamanā assu, mittāpi dummanā assū’ti. So nassanadhamme naṭṭhe socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘assutavā puthujjano viddho savisena sokasallena attānaṃyeva paritāpeti’’’. ‘‘Sutavato ca kho, bhikkhave, ariyasāvakassa jarādhammaṃ jīrati. So jarādhamme jiṇṇe iti paṭisañcikkhati – ‘na kho mayhevekassa jarādhammaṃ jīrati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ jarādhammaṃ jīrati. Ahañceva kho pana jarādhamme jiṇṇe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ, amittāpi attamanā assu, mittāpi dummanā assū’ti. So jarādhamme jiṇṇe na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘sutavā ariyasāvako abbuhi [abbahi (sī.)] savisaṃ sokasallaṃ, yena viddho assutavā puthujjano attānaṃyeva paritāpeti. Asoko visallo ariyasāvako attānaṃyeva parinibbāpeti’’’. ‘‘Puna caparaṃ, bhikkhave, sutavato ariyasāvakassa byādhidhammaṃ byādhīyati…pe… maraṇadhammaṃ mīyati… khayadhammaṃ khīyati… nassanadhammaṃ nassati. So nassanadhamme naṭṭhe iti paṭisañcikkhati – ‘na kho mayhevekassa nassanadhammaṃ nassati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ nassanadhammaṃ nassati. Ahañceva kho pana nassanadhamme naṭṭhe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ, amittāpi attamanā assu, mittāpi dummanā assū’ti. So nassanadhamme naṭṭhe na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘sutavā ariyasāvako abbuhi savisaṃ sokasallaṃ, yena viddho assutavā puthujjano attānaṃyeva paritāpeti. Asoko visallo ariyasāvako attānaṃyeva parinibbāpetī’’’ti. ‘‘Imāni kho, bhikkhave, pañca alabbhanīyāni ṭhānāni samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmi’’nti. [jā. 1.5.96 jātakepi] ‘‘Na socanāya paridevanāya, Atthodha labbhā [attho idha labbhati (syā.), attho idha labbhā (pī.)] api appakopi; Socantamenaṃ dukhitaṃ viditvā, Paccatthikā attamanā bhavanti. ‘‘Yato ca kho paṇḍito āpadāsu, Na vedhatī atthavinicchayaññū; Paccatthikāssa dukhitā bhavanti, Disvā mukhaṃ avikāraṃ purāṇaṃ. ‘‘Jappena mantena subhāsitena, Anuppadānena paveṇiyā vā; Yathā yathā yattha [yathā yathā yattha yattha (ka.)] labhetha atthaṃ, Tathā tathā tattha parakkameyya. ‘‘Sace pajāneyya alabbhaneyyo, Mayāva [mayā vā (syā. kaṃ. pī.)] aññena vā esa attho; Asocamāno adhivāsayeyya, Kammaṃ daḷhaṃ kinti karomi dānī’’ti. aṭṭhamaṃ;",
      "english": "Monks, there are these five unachievable conditions in the world by ascetics, brahmins, deities, Māra, Brahmā, or anyone else. Which five? That what is subject to aging may not age – this is an unachievable condition in the world by ascetics, brahmins, deities, Māra, Brahmā, or anyone else. That what is subject to sickness may not sicken. That what is subject to death may not die. That what is subject to decay may not decay. That what is subject to destruction may not be destroyed – this is an unachievable condition in the world by ascetics, brahmins, deities, Māra, Brahmā, or anyone else.\n\nMonks, for the uninstructed ordinary person, what is subject to aging ages. When what is subject to aging has aged, he does not reflect thus: ‘It is not for me alone that what is subject to aging ages, but for all beings—all who come, go, pass away, and reappear—for all beings, what is subject to aging ages. If I, when what is subject to aging has aged, were to sorrow, lament, weep, beat my breast, fall into confusion, my food would not digest, my body would lose its luster, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ When what is subject to aging has aged, he sorrows, laments, weeps, beats his breast, and falls into confusion. This, monks, is called the uninstructed ordinary person, struck by the poisoned arrow of sorrow, tormenting himself.\n\nFurthermore, monks, for the uninstructed ordinary person, what is subject to sickness sickens; what is subject to death dies; what is subject to decay decays; what is subject to destruction is destroyed. When what is subject to destruction has been destroyed, he does not reflect thus: ‘It is not for me alone that what is subject to destruction is destroyed, but for all beings—all who come, go, pass away, and reappear—for all beings, what is subject to destruction is destroyed. If I, when what is subject to destruction has been destroyed, were to sorrow, lament, weep, beat my breast, fall into confusion, my food would not digest, my body would lose its luster, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ When what is subject to destruction has been destroyed, he sorrows, laments, weeps, beats his breast, and falls into confusion. This, monks, is called the uninstructed ordinary person, struck by the poisoned arrow of sorrow, tormenting himself.\n\nBut, monks, for the instructed noble disciple, what is subject to aging ages. When what is subject to aging has aged, he reflects thus: ‘It is not for me alone that what is subject to aging ages, but for all beings—all who come, go, pass away, and reappear—for all beings, what is subject to aging ages. If I, when what is subject to aging has aged, were to sorrow, lament, weep, beat my breast, fall into confusion, my food would not digest, my body would lose its luster, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ When what is subject to aging has aged, he does not sorrow, does not lament, does not weep, does not beat his breast, and does not fall into confusion. This, monks, is called the instructed noble disciple, who has drawn out the poisoned arrow of sorrow, by which the uninstructed ordinary person, struck, torments himself. Sorrowless and without the arrow, the noble disciple extinguishes himself.\n\nFurthermore, monks, for the instructed noble disciple, what is subject to sickness sickens; what is subject to death dies; what is subject to decay decays; what is subject to destruction is destroyed. When what is subject to destruction has been destroyed, he reflects thus: ‘It is not for me alone that what is subject to destruction is destroyed, but for all beings—all who come, go, pass away, and reappear—for all beings, what is subject to destruction is destroyed. If I, when what is subject to destruction has been destroyed, were to sorrow, lament, weep, beat my breast, fall into confusion, my food would not digest, my body would lose its luster, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ When what is subject to destruction has been destroyed, he does not sorrow, does not lament, does not weep, does not beat his breast, and does not fall into confusion. This, monks, is called the instructed noble disciple, who has drawn out the poisoned arrow of sorrow, by which the uninstructed ordinary person, struck, torments himself. Sorrowless and without the arrow, the noble disciple extinguishes himself.\n\nThese, monks, are the five unachievable conditions in the world by ascetics, brahmins, deities, Māra, Brahmā, or anyone else.\n\nNot by sorrowing and lamenting is even a small advantage gained here. Seeing such a person distressed and sorrowing, enemies become delighted.\n\nBut when indeed a wise person, skilled in discerning what is beneficial, does not waver in times of adversity, their enemies become distressed, seeing their countenance unchanged and serene as before.\n\nThrough silent contemplation, through wise counsel, through well-spoken words, through generous giving, or through established custom, in whatever way or wherever one might gain advantage, in that same way, there one should exert oneself diligently.\n\nIf one should come to know that this advantage cannot be gained by oneself or by another, one should endure without sorrowing, contemplating, 'What indeed can I do now concerning this unalterable outcome?'",
      "sinhala": "භික්ෂූණි, මේ පස්වැදෑරුම් දේ ශ්‍රමණ, බ්‍රාහ්මණ, දෙවි, මරු, බඹුන් හෝ ලෝකයේ කිසිවකු විසින් ලබාගත නොහැකි තත්ත්වයන් ය. ඒ පස කුමක් ද? 'දිරායන ස්වභාවයක් ඇති මම නොදිරා යෙම්වා!' යනු ශ්‍රමණ, බ්‍රාහ්මණ, දෙවි, මරු, බඹුන් හෝ ලෝකයේ කිසිවකු විසින් ලබාගත නොහැකි තත්ත්වයකි. 'රෝගී වන ස්වභාවයක් ඇති මම රෝගී නොයෙම්වා!' යනු ශ්‍රමණ, බ්‍රාහ්මණ, දෙවි, මරු, බඹුන් හෝ ලෝකයේ කිසිවකු විසින් ලබාගත නොහැකි තත්ත්වයකි. 'මරණයට පත්වන ස්වභාවයක් ඇති මම නොමැරෙම්වා!' යනු ශ්‍රමණ, බ්‍රාහ්මණ, දෙවි, මරු, බඹුන් හෝ ලෝකයේ කිසිවකු විසින් ලබාගත නොහැකි තත්ත්වයකි. 'ක්ෂය වන ස්වභාවයක් ඇති මම ක්ෂය නොයෙම්වා!' යනු ශ්‍රමණ, බ්‍රාහ්මණ, දෙවි, මරු, බඹුන් හෝ ලෝකයේ කිසිවකු විසින් ලබාගත නොහැකි තත්ත්වයකි. 'විනාශ වන ස්වභාවයක් ඇති මම විනාශ නොයෙම්වා!' යනු ද ශ්‍රමණ, බ්‍රාහ්මණ, දෙවි, මරු, බඹුන් හෝ ලෝකයේ කිසිවකු විසින් ලබාගත නොහැකි තත්ත්වයකි.\n\nභික්ෂූණි, අශ්‍රැතවත් පෘථග්ජනයාට දිරායන ස්වභාවය දිරා යයි. ඔහු දිරායන ස්වභාවය දිරා ගිය විට මෙසේ සිතා නොබලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම දිරායන ස්වභාවය දිරා යයි. එසේ වී නමුත්, මා දිරායන ස්වභාවය දිරා ගිය විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු දිරායන ස්වභාවය දිරා ගිය විට ශෝක කරයි, වෙහෙසට පත් වේ, වැළපෙයි, පපුවට ගසාගෙන හඬයි, මුළාවට පත් වේ. භික්ෂූණි, මේ පුද්ගලයා 'අශ්‍රැතවත් පෘථග්ජනයා විෂ සහිත ශෝක හීයෙන් විදින ලදුව තමාම තවා ගනියි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද අශ්‍රැතවත් පෘථග්ජනයාට රෝගී වන ස්වභාවය රෝගී වෙයි. ඔහු රෝගී වන ස්වභාවය රෝගී වූ විට මෙසේ සිතා නොබලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම රෝගී වන ස්වභාවය රෝගී වෙයි. එසේ වී නමුත්, මා රෝගී වන ස්වභාවය රෝගී වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු රෝගී වන ස්වභාවය රෝගී වූ විට ශෝක කරයි, වෙහෙසට පත් වේ, වැළපෙයි, පපුවට ගසාගෙන හඬයි, මුළාවට පත් වේ. භික්ෂූණි, මේ පුද්ගලයා 'අශ්‍රැතවත් පෘථග්ජනයා විෂ සහිත ශෝක හීයෙන් විදින ලදුව තමාම තවා ගනියි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද අශ්‍රැතවත් පෘථග්ජනයාට මරණයට පත්වන ස්වභාවය මරණයට පත් වෙයි. ඔහු මරණයට පත්වන ස්වභාවය මරණයට පත් වූ විට මෙසේ සිතා නොබලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම මරණයට පත්වන ස්වභාවය මරණයට පත් වෙයි. එසේ වී නමුත්, මා මරණයට පත්වන ස්වභාවය මරණයට පත් වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු මරණයට පත්වන ස්වභාවය මරණයට පත් වූ විට ශෝක කරයි, වෙහෙසට පත් වේ, වැළපෙයි, පපුවට ගසාගෙන හඬයි, මුළාවට පත් වේ. භික්ෂූණි, මේ පුද්ගලයා 'අශ්‍රැතවත් පෘථග්ජනයා විෂ සහිත ශෝක හීයෙන් විදින ලදුව තමාම තවා ගනියි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද අශ්‍රැතවත් පෘථග්ජනයාට ක්ෂය වන ස්වභාවය ක්ෂය වෙයි. ඔහු ක්ෂය වන ස්වභාවය ක්ෂය වූ විට මෙසේ සිතා නොබලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම ක්ෂය වන ස්වභාවය ක්ෂය වෙයි. එසේ වී නමුත්, මා ක්ෂය වන ස්වභාවය ක්ෂය වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු ක්ෂය වන ස්වභාවය ක්ෂය වූ විට ශෝක කරයි, වෙහෙසට පත් වේ, වැළපෙයි, පපුවට ගසාගෙන හඬයි, මුළාවට පත් වේ. භික්ෂූණි, මේ පුද්ගලයා 'අශ්‍රැතවත් පෘථග්ජනයා විෂ සහිත ශෝක හීයෙන් විදින ලදුව තමාම තවා ගනියි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද අශ්‍රැතවත් පෘථග්ජනයාට විනාශ වන ස්වභාවය විනාශ වෙයි. ඔහු විනාශ වන ස්වභාවය විනාශ වූ විට මෙසේ සිතා නොබලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම විනාශ වන ස්වභාවය විනාශ වෙයි. එසේ වී නමුත්, මා විනාශ වන ස්වභාවය විනාශ වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු විනාශ වන ස්වභාවය විනාශ වූ විට ශෝක කරයි, වෙහෙසට පත් වේ, වැළපෙයි, පපුවට ගසාගෙන හඬයි, මුළාවට පත් වේ. භික්ෂූණි, මේ පුද්ගලයා 'අශ්‍රැතවත් පෘථග්ජනයා විෂ සහිත ශෝක හීයෙන් විදින ලදුව තමාම තවා ගනියි' යි කියනු ලැබේ.\n\nභික්ෂූණි, ශ්‍රැතවත් ආර්යශ්‍රාවකයාට දිරායන ස්වභාවය දිරා යයි. ඔහු දිරායන ස්වභාවය දිරා ගිය විට මෙසේ සිතා බලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම දිරායන ස්වභාවය දිරා යයි. එසේ වී නමුත්, මා දිරායන ස්වභාවය දිරා ගිය විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු දිරායන ස්වභාවය දිරා ගිය විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට ගසාගෙන නොහඬයි, මුළාවට පත් නොවේ. භික්ෂූණි, මේ පුද්ගලයා 'ශ්‍රැතවත් ආර්යශ්‍රාවකයා විෂ සහිත ශෝක හීය උදුරා දැමීය, යමකින් විදින ලද අශ්‍රැතවත් පෘථග්ජනයා තමාම තවා ගනියි. ශෝක රහිත වූ, හී නැති ආර්යශ්‍රාවකයා තමාම පිරිනිවන් පායි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද ශ්‍රැතවත් ආර්යශ්‍රාවකයාට රෝගී වන ස්වභාවය රෝගී වෙයි. ඔහු රෝගී වන ස්වභාවය රෝගී වූ විට මෙසේ සිතා බලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම රෝගී වන ස්වභාවය රෝගී වෙයි. එසේ වී නමුත්, මා රෝගී වන ස්වභාවය රෝගී වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු රෝගී වන ස්වභාවය රෝගී වූ විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට ගසාගෙන නොහඬයි, මුළාවට පත් නොවේ. භික්ෂූණි, මේ පුද්ගලයා 'ශ්‍රැතවත් ආර්යශ්‍රාවකයා විෂ සහිත ශෝක හීය උදුරා දැමීය, යමකින් විදින ලද අශ්‍රැතවත් පෘථග්ජනයා තමාම තවා ගනියි. ශෝක රහිත වූ, හී නැති ආර්යශ්‍රාවකයා තමාම පිරිනිවන් පායි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද ශ්‍රැතවත් ආර්යශ්‍රාවකයාට මරණයට පත්වන ස්වභාවය මරණයට පත් වෙයි. ඔහු මරණයට පත්වන ස්වභාවය මරණයට පත් වූ විට මෙසේ සිතා බලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම මරණයට පත්වන ස්වභාවය මරණයට පත් වෙයි. එසේ වී නමුත්, මා මරණයට පත්වන ස්වභාවය මරණයට පත් වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු මරණයට පත්වන ස්වභාවය මරණයට පත් වූ විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට ගසාගෙන නොහඬයි, මුළාවට පත් නොවේ. භික්ෂූණි, මේ පුද්ගලයා 'ශ්‍රැතවත් ආර්යශ්‍රාවකයා විෂ සහිත ශෝක හීය උදුරා දැමීය, යමකින් විදින ලද අශ්‍රැතවත් පෘථග්ජනයා තමාම තවා ගනියි. ශෝක රහිත වූ, හී නැති ආර්යශ්‍රාවකයා තමාම පිරිනිවන් පායි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද ශ්‍රැතවත් ආර්යශ්‍රාවකයාට ක්ෂය වන ස්වභාවය ක්ෂය වෙයි. ඔහු ක්ෂය වන ස්වභාවය ක්ෂය වූ විට මෙසේ සිතා බලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම ක්ෂය වන ස්වභාවය ක්ෂය වෙයි. එසේ වී නමුත්, මා ක්ෂය වන ස්වභාවය ක්ෂය වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු ක්ෂය වන ස්වභාවය ක්ෂය වූ විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට ගසාගෙන නොහඬයි, මුළාවට පත් නොවේ. භික්ෂූණි, මේ පුද්ගලයා 'ශ්‍රැතවත් ආර්යශ්‍රාවකයා විෂ සහිත ශෝක හීය උදුරා දැමීය, යමකින් විදින ලද අශ්‍රැතවත් පෘථග්ජනයා තමාම තවා ගනියි. ශෝක රහිත වූ, හී නැති ආර්යශ්‍රාවකයා තමාම පිරිනිවන් පායි' යි කියනු ලැබේ.\n\nභික්ෂූණි, තවද ශ්‍රැතවත් ආර්යශ්‍රාවකයාට විනාශ වන ස්වභාවය විනාශ වෙයි. ඔහු විනාශ වන ස්වභාවය විනාශ වූ විට මෙසේ සිතා බලයි: 'මා හට පමණක් නොව, පැමිණීම, යාම, චුතිය, උප්පත්තිය ඇති සියලු සත්ත්වයන්ටම විනාශ වන ස්වභාවය විනාශ වෙයි. එසේ වී නමුත්, මා විනාශ වන ස්වභාවය විනාශ වූ විට ශෝක කරන්නේ නම්, වෙහෙසට පත්වන්නේ නම්, වැළපෙන්නේ නම්, හඬා පපුවට ගසා ගන්නේ නම්, මුළාවට පත්වන්නේ නම්, මට ආහාරය ද නොරුචි වනු ඇත, ශරීරය ද දුර්වර්ණ වනු ඇත, මගේ කටයුතු ද නිසි ලෙස සිදු නොවනු ඇත, සතුරෝ ද සතුටු වනු ඇත, මිතුරෝ ද දුකට පත් වනු ඇත' යි. ඔහු විනාශ වන ස්වභාවය විනාශ වූ විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, නොවැළපෙයි, පපුවට ගසාගෙන නොහඬයි, මුළාවට පත් නොවේ. භික්ෂූණි, මේ පුද්ගලයා 'ශ්‍රැතවත් ආර්යශ්‍රාවකයා විෂ සහිත ශෝක හීය උදුරා දැමීය, යමකින් විදින ලද අශ්‍රැතවත් පෘථග්ජනයා තමාම තවා ගනියි. ශෝක රහිත වූ, හී නැති ආර්යශ්‍රාවකයා තමාම පිරිනිවන් පායි' යි කියනු ලැබේ.\n\nභික්ෂූණි, මේ පස්වැදෑරුම් දේ ශ්‍රමණ, බ්‍රාහ්මණ, දෙවි, මරු, බඹුන් හෝ ලෝකයේ කිසිවකු විසින් ලබාගත නොහැකි තත්ත්වයන් ය.\n\nශෝක කිරීමෙන් හෝ වැලපීමෙන් මෙහිදී සුළු හෝ ප්‍රයෝජනයක් ලබාගත නොහැක. මොහු ශෝක කරමින් දුකට පත්ව සිටිනු දැක සතුරෝ සතුටු වෙති.\n\nයම් හෙයකින් නුවණැති පුද්ගලයා ආපදාවලදී අර්ථ විනිශ්චය දන්නා බැවින් කම්පා නොවන්නේද, එසේ කම්පා නොවී පෙර පරිදිම නොවිසිරුණු මුහුණ දැක ඔහුගේ සතුරෝ දුකට පත්වෙති.\n\nරහස් මන්ත්‍රණයෙන්, අනුශාසනාවෙන්, මනා වචනයෙන් හෝ දීමෙන් හෝ වංශගත සම්බන්ධතාවලින් හෝ යම් යම් අයුරින් යම් තැනකදී තමන්ට ප්‍රයෝජනයක් ලැබේ නම්, ඒ ඒ අයුරින් ඒ තැනදී උත්සාහ කළ යුතුයි.\n\nයම් හෙයකින් මේ ප්‍රයෝජනය මා විසින් හෝ අන් අය විසින් හෝ ලබාගත නොහැක්කක් බව දතහොත්, ශෝක නොකර ඉවසා සිටිය යුතුයි. “දැන් මා කුමන ස්ථිර කර්තව්‍යයක් කළ යුතුදැයි” සිතිය යුතුයි.",
      "paliTitle": "Alabbhanīyaṭhānasuttaṃ"
    },
    {
      "number": 49,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho rājā pasenadi kosalo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. (Tena kho pana samayena mallikā devī kālaṅkatā hoti.) [( ) natthi (sī.)] Atha kho aññataro puriso yena rājā pasenadi kosalo tenupasaṅkami; upasaṅkamitvā rañño pasenadissa kosalassa upakaṇṇake āroceti – ‘‘mallikā devī, deva [deva devī (syā. kaṃ. pī.)], kālaṅkatā’’ti. Evaṃ vutte rājā pasenadi kosalo dukkhī dummano pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdi. Atha kho bhagavā rājānaṃ pasenadiṃ kosalaṃ dukkhiṃ dummanaṃ pattakkhandhaṃ adhomukhaṃ pajjhāyantaṃ appaṭibhānaṃ viditvā rājānaṃ pasenadiṃ kosalaṃ etadavoca – ‘‘pañcimāni, mahārāja, alabbhanīyāni ṭhānāni samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Katamāni pañca? ‘Jarādhammaṃ mā jīrī’ti alabbhanīyaṃ ṭhānaṃ…pe… na socanāya paridevanāya…pe… kammaṃ daḷhaṃ kinti karomi dānī’’ti. Navamaṃ.",
      "english": "At one time, the Blessed One was dwelling in Sāvatthī, at Jetavana, Anāthapiṇḍika's monastery. Then King Pasenadi of Kosala approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Then a certain man approached King Pasenadi of Kosala; having approached, he informed King Pasenadi of Kosala in his ear, saying, \"Queen Mallikā, O King, has passed away.\" When this was said, King Pasenadi of Kosala sat down, sorrowful, dejected, with slumped shoulders, downcast, brooding, and speechless. Then the Blessed One, knowing King Pasenadi of Kosala to be sorrowful, dejected, with slumped shoulders, downcast, brooding, and speechless, addressed King Pasenadi of Kosala thus: \"Great King, there are these five things that cannot be obtained by an ascetic, a brahmin, a deity, Māra, Brahmā, or anyone at all in the world. Which five? 'May I who am subject to aging not age' is a thing that cannot be obtained. 'May I who am subject to sickness not fall ill' is a thing that cannot be obtained. 'May I who are subject to death not die' is a thing that cannot be obtained. 'May what is subject to perishing not perish' is a thing that cannot be obtained. 'May what is subject to vanishing not vanish' is a thing that cannot be obtained. These are not for sorrowing, lamenting, pain, dejection, or despair, for karma is firm; what, then, can be done now?\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනාථපිණ්ඩික සිටුහුගේ ජේතවනාරාමයෙහි වැඩ වාසය කළ සේක. ඉන්පසු කෝසල රජු වූ පසේනදි රජු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙක වාඩි විය. ඒ අවස්ථාවේදී මල්ලිකා දේවිය කලුරිය කර තිබුණි. ඉන්පසු එක්තරා පුරුෂයෙක් කෝසල රජු වූ පසේනදි රජු වෙත පැමිණියේය; පැමිණ කෝසල රජු වූ පසේනදි රජුගේ කනට කර, \"දේවයන් වහන්ස, මල්ලිකා දේවිය කලුරිය කළාය\" යනුවෙන් දැන්වීය. මෙසේ පැවසූ කල්හි කෝසල රජු වූ පසේනදි රජු දුකට පත් වී, සිත් තැවුලෙන්, උරස් හැළී, යටිකුරු මුහුණින්, කල්පනාවෙන් ගිලී, ප්‍රකෘති සිහියෙන් තොරව වාඩි විය.\n\n    ඉන්පසු භාග්‍යවතුන් වහන්සේ, කෝසල රජු වූ පසේනදි රජු දුකට පත් වී, සිත් තැවුලෙන්, උරස් හැළී, යටිකුරු මුහුණින්, කල්පනාවෙන් ගිලී, ප්‍රකෘති සිහියෙන් තොරව සිටින බව දැන, කෝසල රජු වූ පසේනදි රජුට මෙසේ වදාළ සේක: \"මහරජ, මේ ලෝකයේ ශ්‍රමණයකු විසින් හෝ බ්‍රාහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ කිසිවකු විසින් හෝ ලබාගත නොහැකි වූ ධර්මතා පහක් වෙති. ඒ පහ කුමක්ද? 'දිරීම ස්වභාව කොට ඇත්තා වූ මම නොදිරම්වා!' යනු ශ්‍රමණයකු විසින් හෝ බ්‍රාහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ මේ ලෝකයේ කිසිවකු විසින් හෝ ලබාගත නොහැකි ධර්මතාවකි. 'ලෙඩවීම ස්වභාව කොට ඇත්තා වූ මම නොලෙඩ වම්වා!' යනු ශ්‍රමණයකු විසින් හෝ බ්‍රාහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ මේ ලෝකයේ කිසිවකු විසින් හෝ ලබාගත නොහැකි ධර්මතාවකි. 'මියයෑම ස්වභාව කොට ඇත්තා වූ මම නොමියම්වා!' යනු ශ්‍රමණයකු විසින් හෝ බ්‍රාහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ මේ ලෝකයේ කිසිවකු විසින් හෝ ලබාගත නොහැකි ධර්මතාවකි. 'ක්ෂයවීම ස්වභාව කොට ඇත්තා වූ මම ක්ෂය නොවේවා!' යනු ශ්‍රමණයකු විසින් හෝ බ්‍රාහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ මේ ලෝකයේ කිසිවකු විසින් හෝ ලබාගත නොහැකි ධර්මතාවකි. 'විනාශවීම ස්වභාව කොට ඇත්තා වූ මම විනාශ නොවේවා!' යනු ශ්‍රමණයකු විසින් හෝ බ්‍රාහ්මණයකු විසින් හෝ දෙවියකු විසින් හෝ මාරයකු විසින් හෝ බ්‍රහ්මයකු විසින් හෝ මේ ලෝකයේ කිසිවකු විසින් හෝ ලබාගත නොහැකි ධර්මතාවකි. ශෝක කිරීමෙන් හෝ වැලපීමෙන් හෝ කිසිවක් කළ නොහැක. කර්මය දෘඪය, දැන් කුමක් කරම්ද?\"",
      "paliTitle": "Kosalasuttaṃ"
    },
    {
      "number": 50,
      "pali": "Ekaṃ samayaṃ āyasmā nārado pāṭaliputte viharati kukkuṭārāme. Tena kho pana samayena muṇḍassa rañño bhaddā devī kālaṅkatā hoti piyā manāpā. So bhaddāya deviyā kālaṅkatāya piyāya manāpāya neva nhāyati [nahāyati (sī. syā. kaṃ. pī.)] na vilimpati na bhattaṃ bhuñjati na kammantaṃ payojeti – rattindivaṃ [rattidivaṃ (ka.)] bhaddāya deviyā sarīre ajjhomucchito. Atha kho muṇḍo rājā piyakaṃ kosārakkhaṃ [sokārakkhaṃ (syā.)] āmantesi – ‘‘tena hi, samma piyaka, bhaddāya deviyā sarīraṃ āyasāya teladoṇiyā pakkhipitvā aññissā āyasāya doṇiyā paṭikujjatha, yathā mayaṃ bhaddāya deviyā sarīraṃ cirataraṃ passeyyāmā’’ti. ‘‘Evaṃ, devā’’ti kho piyako kosārakkho muṇḍassa rañño paṭissutvā bhaddāya deviyā sarīraṃ āyasāya teladoṇiyā pakkhipitvā aññissā āyasāya doṇiyā paṭikujji. Atha kho piyakassa kosārakkhassa etadahosi – ‘‘imassa kho muṇḍassa rañño bhaddā devī kālaṅkatā piyā manāpā. So bhaddāya deviyā kālaṅkatāya piyāya manāpāya neva nhāyati na vilimpati na bhattaṃ bhuñjati na kammantaṃ payojeti – rattindivaṃ bhaddāya deviyā sarīre ajjhomucchito. Kaṃ [kiṃ (ka.)] nu kho muṇḍo rājā samaṇaṃ vā brāhmaṇaṃ vā payirupāseyya, yassa dhammaṃ sutvā sokasallaṃ pajaheyyā’’ti! Atha kho piyakassa kosārakkhassa etadahosi – ‘‘ayaṃ kho āyasmā nārado pāṭaliputte viharati kukkuṭārāme. Taṃ kho panāyasmantaṃ nāradaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘paṇḍito viyatto [vyatto (sī. pī.), byatto (syā. kaṃ., dī. ni. 2.407)] medhāvī bahussuto cittakathī kalyāṇapaṭibhāno vuddho ceva [buddho ceva (ka.)] arahā ca’ [arahā cā’ti (?)]. Yaṃnūna muṇḍo rājā āyasmantaṃ nāradaṃ payirupāseyya, appeva nāma muṇḍo rājā āyasmato nāradassa dhammaṃ sutvā sokasallaṃ pajaheyyā’’ti. Atha kho piyako kosārakkho yena muṇḍo rājā tenupasaṅkami; upasaṅkamitvā muṇḍaṃ rājānaṃ etadavoca – ‘‘ayaṃ kho, deva, āyasmā nārado pāṭaliputte viharati kukkuṭārāme. Taṃ kho panāyasmantaṃ nāradaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘paṇḍito viyatto medhāvī bahussuto cittakathī kalyāṇapaṭibhāno vuddho ceva arahā ca’ [arahā cā’ti (?)]. Yadi pana devo āyasmantaṃ nāradaṃ payirupāseyya, appeva nāma devo āyasmato nāradassa dhammaṃ sutvā sokasallaṃ pajaheyyā’’ti. ‘‘Tena hi, samma piyaka, āyasmantaṃ nāradaṃ paṭivedehi. Kathañhi nāma mādiso samaṇaṃ vā brāhmaṇaṃ vā vijite vasantaṃ pubbe appaṭisaṃvidito upasaṅkamitabbaṃ maññeyyā’’ti! ‘‘Evaṃ, devā’’ti kho piyako kosārakkho muṇḍassa rañño paṭissutvā yenāyasmā nārado tenupasaṅkami; upasaṅkamitvā āyasmantaṃ nāradaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho piyako kosārakkho āyasmantaṃ nāradaṃ etadavoca – ‘‘Imassa, bhante, muṇḍassa rañño bhaddā devī kālaṅkatā piyā manāpā. So bhaddāya deviyā kālaṅkatāya piyāya manāpāya neva nhāyati na vilimpati na bhattaṃ bhuñjati na kammantaṃ payojeti – rattindivaṃ bhaddāya deviyā sarīre ajjhomucchito. Sādhu, bhante, āyasmā nārado muṇḍassa rañño tathā dhammaṃ desetu yathā muṇḍo rājā āyasmato nāradassa dhammaṃ sutvā sokasallaṃ pajaheyyā’’ti. ‘‘Yassadāni, piyaka, muṇḍo rājā kālaṃ maññatī’’ti. Atha kho piyako kosārakkho uṭṭhāyāsanā āyasmantaṃ nāradaṃ abhivādetvā padakkhiṇaṃ katvā yena muṇḍo rājā tenupasaṅkami; upasaṅkamitvā muṇḍaṃ rājānaṃ etadavoca – ‘‘katāvakāso kho, deva, āyasmatā nāradena. Yassadāni devo kālaṃ maññatī’’ti. ‘‘Tena hi, samma piyaka, bhadrāni bhadrāni yānāni yojāpehī’’ti. ‘‘Evaṃ, devā’’ti kho piyako kosārakkho muṇḍassa rañño paṭissutvā bhadrāni bhadrāni yānāni yojāpetvā muṇḍaṃ rājānaṃ etadavoca – ‘‘yuttāni kho te, deva, bhadrāni bhadrāni yānāni. Yassadāni devo kālaṃ maññatī’’ti. Atha kho muṇḍo rājā bhadraṃ yānaṃ [bhadraṃ bhadraṃ yānaṃ (syā. kaṃ. ka.), bhaddaṃ yānaṃ (pī.)] abhiruhitvā bhadrehi bhadrehi yānehi yena kukkuṭārāmo tena pāyāsi mahaccā [mahacca (bahūsu)] rājānubhāvena āyasmantaṃ nāradaṃ dassanāya. Yāvatikā yānassa bhūmi yānena gantvā, yānā paccorohitvā pattikova ārāmaṃ pāvisi. Atha kho muṇḍo rājā yena āyasmā nārado tenupasaṅkami; upasaṅkamitvā āyasmantaṃ nāradaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho muṇḍaṃ rājānaṃ āyasmā nārado etadavoca – ‘‘Pañcimāni, mahārāja, alabbhanīyāni ṭhānāni samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Katamāni pañca? ‘Jarādhammaṃ mā jīrī’ti alabbhanīyaṃ ṭhānaṃ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. ‘Byādhidhammaṃ mā byādhīyī’ti…pe… ‘maraṇadhammaṃ mā mīyī’ti… ‘khayadhammaṃ mā khīyī’ti… ‘nassanadhammaṃ mā nassī’ti alabbhanīyaṃ ṭhānaṃ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. ‘‘Assutavato, mahārāja, puthujjanassa jarādhammaṃ jīrati. So jarādhamme jiṇṇe na iti paṭisañcikkhati – ‘na kho mayhevekassa jarādhammaṃ jīrati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ jarādhammaṃ jīrati. Ahañceva kho pana jarādhamme jiṇṇe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ, amittāpi attamanā assu, mittāpi dummanā assū’ti. So jarādhamme jiṇṇe socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, mahārāja – ‘assutavā puthujjano viddho savisena sokasallena attānaṃyeva paritāpeti’’’. ‘‘Puna caparaṃ, mahārāja, assutavato puthujjanassa byādhidhammaṃ byādhīyati…pe… maraṇadhammaṃ mīyati… khayadhammaṃ khīyati… nassanadhammaṃ nassati. So nassanadhamme naṭṭhe na iti paṭisañcikkhati – ‘na kho mayhevekassa nassanadhammaṃ nassati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ nassanadhammaṃ nassati. Ahañceva kho pana nassanadhamme naṭṭhe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ, amittāpi attamanā assu, mittāpi dummanā assū’ti. So nassanadhamme naṭṭhe socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, mahārāja – ‘assutavā puthujjano viddho savisena sokasallena attānaṃyeva paritāpeti’’’. ‘‘Sutavato ca kho, mahārāja, ariyasāvakassa jarādhammaṃ jīrati. So jarādhamme jiṇṇe iti paṭisañcikkhati – ‘na kho mayhevekassa jarādhammaṃ jīrati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ jarādhammaṃ jīrati. Ahañceva kho pana jarādhamme jiṇṇe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ, amittāpi attamanā assu, mittāpi dummanā assū’ti. So jarādhamme jiṇṇe na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, mahārāja – ‘sutavā ariyasāvako abbuhi savisaṃ sokasallaṃ, yena viddho assutavā puthujjano attānaṃyeva paritāpeti. Asoko visallo ariyasāvako attānaṃyeva parinibbāpeti’’’. ‘‘Puna caparaṃ, mahārāja, sutavato ariyasāvakassa byādhidhammaṃ byādhīyati…pe… maraṇadhammaṃ mīyati… khayadhammaṃ khīyati… nassanadhammaṃ nassati. So nassanadhamme naṭṭhe iti paṭisañcikkhati – ‘na kho mayhevekassa nassanadhammaṃ nassati, atha kho yāvatā sattānaṃ āgati gati cuti upapatti sabbesaṃ sattānaṃ nassanadhammaṃ nassati. Ahañceva kho pana nassanadhamme naṭṭhe soceyyaṃ kilameyyaṃ parideveyyaṃ, urattāḷiṃ kandeyyaṃ, sammohaṃ āpajjeyyaṃ, bhattampi me nacchādeyya, kāyepi dubbaṇṇiyaṃ okkameyya, kammantāpi nappavatteyyuṃ, amittāpi attamanā assu, mittāpi dummanā assū’ti. So nassanadhamme naṭṭhe na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, mahārāja – ‘sutavā ariyasāvako abbuhi savisaṃ sokasallaṃ, yena viddho assutavā puthujjano attānaṃyeva paritāpeti. Asoko visallo ariyasāvako attānaṃyeva parinibbāpeti ’’’. ‘‘Imāni kho, mahārāja, pañca alabbhanīyāni ṭhānāni samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmi’’nti. ‘‘Na socanāya paridevanāya, Atthodha labbhā api appakopi; Socantamenaṃ dukhitaṃ viditvā, Paccatthikā attamanā bhavanti. ‘‘Yato ca kho paṇḍito āpadāsu, Na vedhatī atthavinicchayaññū; Paccatthikāssa dukhitā bhavanti, Disvā mukhaṃ avikāraṃ purāṇaṃ. ‘‘Jappena mantena subhāsitena, Anuppadānena paveṇiyā vā; Yathā yathā yattha labhetha atthaṃ, Tathā tathā tattha parakkameyya. ‘‘Sace pajāneyya alabbhaneyyo, Mayāva aññena vā esa attho; Asocamāno adhivāsayeyya, Kammaṃ daḷhaṃ kinti karomi dānī’’ti [jā. 1 jātakepi]. Evaṃ vutte muṇḍo rājā āyasmantaṃ nāradaṃ etadavoca – ‘‘ko nāmo [ko nu kho (sī. pī.)] ayaṃ, bhante, dhammapariyāyo’’ti? ‘‘Sokasallaharaṇo nāma ayaṃ, mahārāja, dhammapariyāyo’’ti. ‘‘Taggha, bhante, sokasallaharaṇo [taggha bhante sokasallaharaṇo, taggha bhante sokasallaharaṇo (sī. syā. kaṃ. pī.)]! Imañhi me, bhante, dhammapariyāyaṃ sutvā sokasallaṃ pahīna’’nti. Atha kho muṇḍo rājā piyakaṃ kosārakkhaṃ āmantesi – ‘‘tena hi, samma piyaka, bhaddāya deviyā sarīraṃ jhāpetha; thūpañcassā karotha. Ajjatagge dāni mayaṃ nhāyissāma ceva vilimpissāma bhattañca bhuñjissāma kammante ca payojessāmā’’ti. Dasamaṃ. ",
      "english": "Once, the Venerable Narada was residing at the Kukkuṭārāma in Pāṭaliputta. Now at that time, King Muṇḍa's beloved and pleasing Queen Bhaddā had passed away. With his beloved and pleasing Queen Bhaddā having passed away, he neither bathed nor anointed himself, nor did he eat food, nor did he attend to his duties – day and night he remained utterly absorbed in Queen Bhaddā's body. Then King Muṇḍa addressed Piyaka, his treasurer: \"Well then, friend Piyaka, place Queen Bhaddā's body in an iron oil-trough and cover it with another iron trough, so that we may see Queen Bhaddā's body for a longer time.\" \"Yes, Your Majesty,\" replied Piyaka, the treasurer, to King Muṇḍa, and having done so, he placed Queen Bhaddā's body in an iron oil-trough and covered it with another iron trough.\n\nThen the thought occurred to Piyaka, the treasurer: \"King Muṇḍa's beloved and pleasing Queen Bhaddā has passed away. With his beloved and pleasing Queen Bhaddā having passed away, he neither bathes nor anoints himself, nor does he eat food, nor does he attend to his duties – day and night he remains utterly absorbed in Queen Bhaddā's body. Who, I wonder, is the ascetic or brahmin whom King Muṇḍa could attend upon, and having heard whose teaching, he might abandon the dart of sorrow?\"\n\nThen the thought occurred to Piyaka, the treasurer: \"Indeed, the Venerable Narada is residing at the Kukkuṭārāma in Pāṭaliputta. This good report about the Venerable Narada has spread: 'He is wise, accomplished, intelligent, learned, a skilled speaker, with excellent ready wit, venerable, and an arahant.' Perhaps King Muṇḍa might attend upon the Venerable Narada, and it may be that King Muṇḍa, having heard the teaching of the Venerable Narada, might abandon the dart of sorrow.\"\n\nThen Piyaka, the treasurer, approached King Muṇḍa; having approached, he said to King Muṇḍa: \"Your Majesty, the Venerable Narada is residing at the Kukkuṭārāma in Pāṭaliputta. This good report about the Venerable Narada has spread: 'He is wise, accomplished, intelligent, learned, a skilled speaker, with excellent ready wit, venerable, and an arahant.' If Your Majesty were to attend upon the Venerable Narada, it may be that Your Majesty, having heard the teaching of the Venerable Narada, might abandon the dart of sorrow.\"\n\n\"Well then, friend Piyaka, inform the Venerable Narada. How could one like me presume to approach an ascetic or brahmin residing in my realm without prior announcement?\" \"Yes, Your Majesty,\" replied Piyaka, the treasurer, to King Muṇḍa, and having done so, he approached the Venerable Narada; having approached and greeted the Venerable Narada, he sat down to one side. Seated to one side, Piyaka, the treasurer, said to the Venerable Narada: \"Venerable sir, King Muṇḍa's beloved and pleasing Queen Bhaddā has passed away. With his beloved and pleasing Queen Bhaddā having passed away, he neither bathes nor anoints himself, nor does he eat food, nor does he attend to his duties – day and night he remains utterly absorbed in Queen Bhaddā's body. It would be good, Venerable sir, if the Venerable Narada would teach the Dhamma to King Muṇḍa in such a way that King Muṇḍa, having heard the teaching of the Venerable Narada, might abandon the dart of sorrow.\" \"Whenever King Muṇḍa considers it the right time, Piyaka.\"\n\nThen Piyaka, the treasurer, rose from his seat, greeted the Venerable Narada, circumambulated him respectfully, and approached King Muṇḍa; having approached, he said to King Muṇḍa: \"Your Majesty, the Venerable Narada has granted an audience. Now, Your Majesty may consider it the right time.\" \"Well then, friend Piyaka, have the finest carriages harnessed.\" \"Yes, Your Majesty,\" replied Piyaka, the treasurer, to King Muṇḍa, and having had the finest carriages harnessed, he said to King Muṇḍa: \"Your Majesty, your finest carriages are harnessed. Now, Your Majesty may consider it the right time.\" Then King Muṇḍa, having mounted a fine carriage, set off with a magnificent royal retinue in his finest carriages towards the Kukkuṭārāma to see the Venerable Narada. Having gone as far as the carriage could go, he dismounted from the carriage and entered the park on foot. Then King Muṇḍa approached the Venerable Narada; having approached and greeted the Venerable Narada, he sat down to one side.\n\nVenerable Narada said to King Muṇḍa, who was sitting to one side: “Great king, there are these five things in the world that are unobtainable for an ascetic, a brahmin, a god, Māra, Brahmā, or anyone else. What are these five? ‘May that which is subject to aging not age’—this is an unobtainable state for an ascetic, a brahmin, a god, Māra, Brahmā, or anyone else in the world. ‘May that which is subject to illness not fall ill’—this is an unobtainable state for an ascetic, a brahmin, a god, Māra, Brahmā, or anyone else in the world. ‘May that which is subject to death not die’—this is an unobtainable state for an ascetic, a brahmin, a god, Māra, Brahmā, or anyone else in the world. ‘May that which is subject to decay not decay’—this is an unobtainable state for an ascetic, a brahmin, a god, Māra, Brahmā, or anyone else in the world. ‘May that which is subject to destruction not be destroyed’—this is an unobtainable state for an ascetic, a brahmin, a god, Māra, Brahmā, or anyone else in the world.”\n\n“Great king, for the unenlightened ordinary person, that which is subject to aging ages. When that which is subject to aging has aged, he does not reflect thus: ‘It is not for me alone that that which is subject to aging ages; rather, for all beings who come, go, pass away, and reappear, that which is subject to aging ages. If, when that which is subject to aging has aged, I were to grieve, weary myself, lament, beat my breast, become distraught, my food would not appeal to me, my body would become discolored, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ So, when that which is subject to aging has aged, he grieves, wearies himself, laments, beats his breast, and becomes distraught. This, great king, is called ‘the unenlightened ordinary person, pierced by the poisonous arrow of sorrow, torturing himself.’”\n\n“Furthermore, great king, for the unenlightened ordinary person, that which is subject to illness falls ill, that which is subject to death dies, that which is subject to decay decays, that which is subject to destruction is destroyed. When that which is subject to destruction has been destroyed, he does not reflect thus: ‘It is not for me alone that that which is subject to destruction is destroyed; rather, for all beings who come, go, pass away, and reappear, that which is subject to destruction is destroyed. If, when that which is subject to destruction has been destroyed, I were to grieve, weary myself, lament, beat my breast, become distraught, my food would not appeal to me, my body would become discolored, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ So, when that which is subject to destruction has been destroyed, he grieves, wearies himself, laments, beats his breast, and becomes distraught. This, great king, is called ‘the unenlightened ordinary person, pierced by the poisonous arrow of sorrow, torturing himself.’”\n\n“However, great king, for the instructed noble disciple, that which is subject to aging ages. When that which is subject to aging has aged, he reflects thus: ‘It is not for me alone that that which is subject to aging ages; rather, for all beings who come, go, pass away, and reappear, that which is subject to aging ages. If, when that which is subject to aging has aged, I were to grieve, weary myself, lament, beat my breast, become distraught, my food would not appeal to me, my body would become discolored, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ Yet, when that which is subject to aging has aged, he does not grieve, does not weary himself, does not lament, does not beat his breast, and does not become distraught. This, great king, is called ‘the instructed noble disciple who has drawn out the poisonous arrow of sorrow, with which the unenlightened ordinary person, being pierced, tortures himself. Free from sorrow, free from the arrow, the noble disciple calms himself completely.’”\n\n“Furthermore, great king, for the instructed noble disciple, that which is subject to illness falls ill, that which is subject to death dies, that which is subject to decay decays, that which is subject to destruction is destroyed. When that which is subject to destruction has been destroyed, he reflects thus: ‘It is not for me alone that that which is subject to destruction is destroyed; rather, for all beings who come, go, pass away, and reappear, that which is subject to destruction is destroyed. If, when that which is subject to destruction has been destroyed, I were to grieve, weary myself, lament, beat my breast, become distraught, my food would not appeal to me, my body would become discolored, my work would not proceed, my enemies would be pleased, and my friends would be displeased.’ Yet, when that which is subject to destruction has been destroyed, he does not grieve, does not weary himself, does not lament, does not beat his breast, and does not become distraught. This, great king, is called ‘the instructed noble disciple who has drawn out the poisonous arrow of sorrow, with which the unenlightened ordinary person, being pierced, tortures himself. Free from sorrow, free from the arrow, the noble disciple calms himself completely.’”\n\n“These, great king, are the five things in the world that are unobtainable for an ascetic, a brahmin, a god, Māra, Brahmā, or anyone else.”\n\nFrom grieving and lamenting, not even a little benefit is obtained;\nUpon seeing him sorrowful and afflicted, enemies become delighted.\nBut when a wise person, discerning what is beneficial, does not tremble in calamities,\nHis enemies become afflicted, seeing his unchanging, calm countenance.\n\nBy earnest appeal, by counsel, by well-spoken words, or by traditional provision; in whatever way, wherever one might achieve one’s purpose, in that very way, there one should exert oneself. If one should realize that this purpose is unobtainable by oneself or by another, then, without grieving, one should endure it and consider, \"What firm action should I now undertake?\"\n\nWhen this was said, King Muṇḍa asked the Venerable Nārada, \"Venerable sir, what is the name of this discourse on the Dhamma?\" \"Great King, this discourse on the Dhamma is called 'The Remover of the Dart of Sorrow',\" replied Nārada. King Muṇḍa exclaimed, \"Indeed, Venerable sir, it truly is the Remover of the Dart of Sorrow! For having heard this discourse on the Dhamma from you, Venerable sir, the dart of sorrow has been removed from me.\" Then King Muṇḍa summoned Piyaka, the treasurer, and said, \"Well then, friend Piyaka, let Queen Bhaddā's body be cremated, and make a stupa for her. From today onwards, we shall bathe, anoint ourselves, eat our meals, and attend to our affairs.\"",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ පාටලීපුත්‍ර නුවර කුක්කුටාරාමයේ වැඩසිටියහ. ඒ සමයෙහි මුණ්ඩ රජුගේ ප්‍රි​ය මනාප භද්‍රා දේවිය අභාවප්‍රාප්ත වී සිටියාය. ප්‍රි​ය මනාප භද්‍රා දේවිය අභාවප්‍රාප්ත වීම නිසා හෙතෙම ස්නානය නොකෙළේය, සුවඳ විලවුන් ආලේප නොකෙළේය, ආහාර අනුභව නොකෙළේය, රාජකාරි කටයුතු නොකෙළේය. හෙතෙම රැය ද දවාල ද භද්‍රා දේවියගේ සිරුරෙහි දැඩිව බැඳී (මෝහයෙන් වෙළී) සිටියේය. ඉක්බිති මුණ්ඩ රජ තෙම පියක නම් භාණ්ඩාගාරිකයා අමතා මෙසේ කීවේය: ‘‘ඒ නිසා, ඇවැත් පියක, භද්‍රා දේවියගේ සිරුර යකඩ තෙල්දෝණියකට දමා, වෙනත් යකඩ දෝණියකින් වසා තබන්න. එවිට අපට භද්‍රා දේවියගේ සිරුර බොහෝ කලක් දැකිය හැක.’’ ‘‘එසේය, දෙවිඳුනි’’යි පියක භාණ්ඩාගාරික තෙම මුණ්ඩ රජුට පිළිතුරු දී, භද්‍රා දේවියගේ සිරුර යකඩ තෙල්දෝණියකට දමා, වෙනත් යකඩ දෝණියකින් වසා තැබුවේය.\n\nඉක්බිති පියක භාණ්ඩාගාරිකයාට මෙවන් සිතුවිල්ලක් ඇති විය: ‘‘මේ මුණ්ඩ රජුගේ ප්‍රි​ය මනාප භද්‍රා දේවිය අභාවප්‍රාප්ත වී ඇත. ප්‍රි​ය මනාප භද්‍රා දේවිය අභාවප්‍රාප්ත වීම නිසා හෙතෙම ස්නානය නොකෙළේය, සුවඳ විලවුන් ආලේප නොකෙළේය, ආහාර අනුභව නොකෙළේය, රාජකාරි කටයුතු නොකෙළේය. හෙතෙම රැය ද දවාල ද භද්‍රා දේවියගේ සිරුරෙහි දැඩිව බැඳී (මෝහයෙන් වෙළී) සිටියේය. මුණ්ඩ රජ තෙම කිනම් ශ්‍ර​මණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ ඇසුරු කළහොත් (උපස්ථාන කළහොත්) ඔහුගේ ධර්ම​ය අසා ශෝකයේ විෂලය අත්හරින්නේදැයි!’’ ඉක්බිති පියක භාණ්ඩාගාරිකයාට මෙවන් සිතුවිල්ලක් ඇති විය: ‘‘මේ ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ පාටලීපුත්‍ර නුවර කුක්කුටාරාමයේ වැඩසිටිති. ඒ ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ පිළිබඳව මෙබඳු කීර්ති ඝෝෂාවක් පැතිර ගොස් ඇත – ‘පණ්ඩිතය, ප්‍රා​ඥය, මහා නුවණැත්තෙක, බහුශ්‍රැතය, විචිත්‍ර දේශනා ඇති, කල්‍යාණ​ ප්‍ර​තිභාන ඇති, වෘද්ධ වූද, අරහත් වූද’ යනුවෙනි. යටත් පිරිසෙයින් මුණ්ඩ රජ තෙම ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේට උපස්ථාන කළහොත්, (එහි ප්‍රතිඵලයක් ලෙස) මුණ්ඩ රජ තෙම ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේගේ ධර්ම​ය අසා ශෝකයේ විෂලය අත්හරිනු ඇතැයි!’’\n\nඉක්බිති පියක භාණ්ඩාගාරික තෙම මුණ්ඩ රජු සිටි තැනට පැමිණියේය. පැමිණ මුණ්ඩ රජුට මෙසේ කීවේය: ‘‘දෙවිඳුනි, මේ ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ පාටලීපුත්‍ර නුවර කුක්කුටාරාමයේ වැඩසිටිති. ඒ ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ පිළිබඳව මෙබඳු කීර්ති ඝෝෂාවක් පැතිර ගොස් ඇත – ‘පණ්ඩිතය, ප්‍රා​ඥය, මහා නුවණැත්තෙක, බහුශ්‍රැතය, විචිත්‍ර දේශනා ඇති, කල්‍යාණ​ ප්‍ර​තිභාන ඇති, වෘද්ධ වූද, අරහත් වූද’ යනුවෙනි. දෙවිඳුන් විසින් ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේට උපස්ථාන කරනු ලබන්නේ නම්, එහි ප්‍රතිඵලයක් ලෙස දෙවිඳුන් විසින් ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේගේ ධර්ම​ය අසා ශෝකයේ විෂලය අත්හරිනු ඇතැයි!’’ ‘‘එසේ නම්, ඇවැත් පියක, ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේට මගේ පැමිණීම දැනුම් දෙන්න. මක්නිසාද, මා වැනි කෙනෙකුට, තමන්ගේ රාජ්‍යයෙහි වසන ශ්‍ර​මණයෙකු හෝ බ්‍රාහ්මණයෙකු, පෙර කිසිදු දැනුම් දීමකින් තොරව හමු විය යුතු යැයි සිතිය හැක්කේ කෙසේදැයි!’’ ‘‘එසේය, දෙවිඳුනි’’යි පියක භාණ්ඩාගාරික තෙම මුණ්ඩ රජුට පිළිතුරු දී, ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ සිටි තැනට පැමිණියේය. පැමිණ ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේට වැඳ එකත්පසක වාඩි විය. එකත්පසක වාඩි වී සිටි පියක භාණ්ඩාගාරික තෙම ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: ‘‘වහන්ස, මේ මුණ්ඩ රජුගේ ප්‍රි​ය මනාප භද්‍රා දේවිය අභාවප්‍රාප්ත වී ඇත. ප්‍රි​ය මනාප භද්‍රා දේවිය අභාවප්‍රාප්ත වීම නිසා හෙතෙම ස්නානය නොකෙළේය, සුවඳ විලවුන් ආලේප නොකෙළේය, ආහාර අනුභව නොකෙළේය, රාජකාරි කටයුතු නොකෙළේය. හෙතෙම රැය ද දවාල ද භද්‍රා දේවියගේ සිරුරෙහි දැඩිව බැඳී (මෝහයෙන් වෙළී) සිටියේය. වහන්ස, ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ මුණ්ඩ රජුට ධර්ම​ය දේශනා කරනු මැනව. එවිට මුණ්ඩ රජ තෙම ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේගේ ධර්ම​ය අසා ශෝකයේ විෂලය අත්හරිනු ඇත.’’ ‘‘දැන් නම්, පියක, මුණ්ඩ රජු සුදුසු අවස්ථාව යැයි සලකයි.’’\n\nඉක්බිති පියක භාණ්ඩාගාරික තෙම අසුනෙන් නැගිට ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේට වැඳ පැදකුණු කොට, මුණ්ඩ රජු සිටි තැනට පැමිණියේය. පැමිණ මුණ්ඩ රජුට මෙසේ කීවේය: ‘‘දෙවිඳුනි, ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ විසින් අවසර දෙන ලදී. දැන් නම් දෙවිඳුන් සුදුසු අවස්ථාව යැයි සලකයි.’’ ‘‘එසේ නම්, ඇවැත් පියක, සුන්දර සුන්දර යානාවන් සූදානම් කරන්න.’’ ‘‘එසේය, දෙවිඳුනි’’යි පියක භාණ්ඩාගාරික තෙම මුණ්ඩ රජුට පිළිතුරු දී, සුන්දර සුන්දර යානාවන් සූදානම් කරවා මුණ්ඩ රජුට මෙසේ කීවේය: ‘‘දෙවිඳුනි, සුන්දර සුන්දර යානාවන් සූදානම් කර ඇත. දැන් නම් දෙවිඳුන් සුදුසු අවස්ථාව යැයි සලකයි.’’ ඉක්බිති මුණ්ඩ රජ තෙම සුන්දර යානයකට නැගී, සුන්දර සුන්දර යානාවන් සමඟින්, මහත් වූ රාජකීය ආනුභාවයෙන් යුක්තව, ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ බැහැදැකීම සඳහා කුක්කුටාරාමය දෙසට ගමන් කෙළේය. යානාවෙන් යා හැකි තාක් දුරක් යානාවෙන් ගොස්, යානාවලින් බැස, පා ගමනින්ම ආරාමයට ඇතුළු විය. ඉක්බිති මුණ්ඩ රජ තෙම ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේ සිටි තැනට පැමිණියේය. පැමිණ ආයුෂ්මත් නාරද ස්ථවිරයන් වහන්සේට වැඳ එකත්පසක වාඩි විය.\n\nඑකත්පසෙක වැඩහිඳ සිටි මුණ්ඩ රජුට ආයෂ්මත් නාරද තෙරණුවෝ මෙය වදාළහ: “මහරජ, මේ ලෝකයෙහි ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ දෙවියෙකුට හෝ මාරයෙකුට හෝ බ්‍රහ්මයෙකුට හෝ කිසිවෙකුට හෝ ලබාගත නොහැකි කරුණු පහක් ඇත. ඒ කවර කරුණු පහක්ද? ‘ජරාවට පත්වන ස්වභාවය ජරාවට පත් නොවේවා’ යැයි (කිරීම), මේ ලෝකයෙහි ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ දෙවියෙකුට හෝ මාරයෙකුට හෝ බ්‍රහ්මයෙකුට හෝ කිසිවෙකුට හෝ ලබාගත නොහැකි කරුණකි. ‘ව්‍යාධියට පත්වන ස්වභාවය ව්‍යාධියට පත් නොවේවා’ යැයි (කිරීම)... ‘මරණයට පත්වන ස්වභාවය මරණයට පත් නොවේවා’ යැයි (කිරීම)... ‘ක්ෂය වීමේ ස්වභාවය ක්ෂය නොවේවා’ යැයි (කිරීම)... ‘විනාශ වීමේ ස්වභාවය විනාශ නොවේවා’ යැයි (කිරීම), මේ ලෝකයෙහි ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ දෙවියෙකුට හෝ මාරයෙකුට හෝ බ්‍රහ්මයෙකුට හෝ කිසිවෙකුට හෝ ලබාගත නොහැකි කරුණකි.\n\nමහරජ, අශ්‍රැතවත් පෘථග්ජනයාට ජරාවට පත්වන ස්වභාවය ජරාවට පත්වේ. ඔහු ජරාවට පත්වන ස්වභාවය ජරාවට පත්වූ විට මෙසේ විමසා නොබලයි: ‘ජරාවට පත්වන ස්වභාවය ජරාවට පත්වන්නේ මට පමණක් නොවේ. යම් පමණකට සත්වයන්ගේ පැමිණීම, ගමන, චුතිය, නැවත ඉපදීම, ඒ සියලු සත්වයන්ට ජරාවට පත්වන ස්වභාවය ජරාවට පත්වේ. ජරාවට පත්වන ස්වභාවය ජරාවට පත්වූ විට මම ශෝක කරන්නෙම් නම්, වෙහෙසට පත්වන්නෙම් නම්, වැළපෙන්නෙම් නම්, පපුවට තලා හඬන්නෙම් නම්, මුළා බවට පත්වන්නෙම් නම්, මට ආහාර පවා නොරස වේ. ශරීරයද අවලස්සන වේ. කටයුතුද ඉදිරියට නොයයි. සතුරෝද සතුටු වෙති. මිත්‍රයෝද සිත් තැවුලට පත්වෙති’යි. ඔහු ජරාවට පත්වන ස්වභාවය ජරාවට පත්වූ විට ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, පපුවට තලා හඬයි, මුළා බවට පත්වෙයි. මහරජ, ‘මේ අශ්‍රැතවත් පෘථග්ජනයා විෂ සහිත ශෝක හී සල්‍යයෙන් විදින ලදුව තමාම තවයි’ යැයි කියනු ලැබේ.\n\nමහරජ, නැවතත් අශ්‍රැතවත් පෘථග්ජනයාට ව්‍යාධියට පත්වන ස්වභාවය ව්‍යාධියට පත්වෙයි. මරණයට පත්වන ස්වභාවය මරණයට පත්වෙයි. ක්ෂය වීමේ ස්වභාවය ක්ෂය වෙයි. විනාශ වීමේ ස්වභාවය විනාශ වෙයි. ඔහු විනාශ වීමේ ස්වභාවය විනාශ වූ විට මෙසේ විමසා නොබලයි: ‘විනාශ වීමේ ස්වභාවය විනාශ වන්නේ මට පමණක් නොවේ. යම් පමණකට සත්වයන්ගේ පැමිණීම, ගමන, චුතිය, නැවත ඉපදීම, ඒ සියලු සත්වයන්ට විනාශ වීමේ ස්වභාවය විනාශ වේ. විනාශ වීමේ ස්වභාවය විනාශ වූ විට මම ශෝක කරන්නෙම් නම්, වෙහෙසට පත්වන්නෙම් නම්, වැළපෙන්නෙම් නම්, පපුවට තලා හඬන්නෙම් නම්, මුළා බවට පත්වන්නෙම් නම්, මට ආහාර පවා නොරස වේ. ශරීරයද අවලස්සන වේ. කටයුතුද ඉදිරියට නොයයි. සතුරෝද සතුටු වෙති. මිත්‍රයෝද සිත් තැවුලට පත්වෙති’යි. ඔහු විනාශ වීමේ ස්වභාවය විනාශ වූ විට ශෝක කරයි, වෙහෙසට පත්වෙයි, වැළපෙයි, පපුවට තලා හඬයි, මුළා බවට පත්වෙයි. මහරජ, ‘මේ අශ්‍රැතවත් පෘථග්ජනයා විෂ සහිත ශෝක හී සල්‍යයෙන් විදින ලදුව තමාම තවයි’ යැයි කියනු ලැබේ.\n\nමහරජ, ශ්‍රැතවත් ආර්ය ශ්‍රාවකයාට ජරාවට පත්වන ස්වභාවය ජරාවට පත්වේ. ඔහු ජරාවට පත්වන ස්වභාවය ජරාවට පත්වූ විට මෙසේ විමසා බලයි: ‘ජරාවට පත්වන ස්වභාවය ජරාවට පත්වන්නේ මට පමණක් නොවේ. යම් පමණකට සත්වයන්ගේ පැමිණීම, ගමන, චුතිය, නැවත ඉපදීම, ඒ සියලු සත්වයන්ට ජරාවට පත්වන ස්වභාවය ජරාවට පත්වේ. ජරාවට පත්වන ස්වභාවය ජරාවට පත්වූ විට මම ශෝක කරන්නෙම් නම්, වෙහෙසට පත්වන්නෙම් නම්, වැළපෙන්නෙම් නම්, පපුවට තලා හඬන්නෙම් නම්, මුළා බවට පත්වන්නෙම් නම්, මට ආහාර පවා නොරස වේ. ශරීරයද අවලස්සන වේ. කටයුතුද ඉදිරියට නොයයි. සතුරෝද සතුටු වෙති. මිත්‍රයෝද සිත් තැවුලට පත්වෙති’යි. ඔහු ජරාවට පත්වන ස්වභාවය ජරාවට පත්වූ විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, වැළපෙන්නේ නැත, පපුවට තලා නොහඬයි, මුළා බවට පත් නොවේ. මහරජ, ‘මේ ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා විෂ සහිත ශෝක හී සල්‍යය උදුරා දැමුවේය. යම් හී සල්‍යයකින් අශ්‍රැතවත් පෘථග්ජනයා විදින ලදුව තමාම තවන්නේද, ඒ ශෝක හී සල්‍යය උදුරා දැමූ, ශෝක රහිත, හී සල්‍ය රහිත ආර්ය ශ්‍රාවකයා තමාම පිරිනිවන් පායි’ යැයි කියනු ලැබේ.\n\nමහරජ, නැවතත් ශ්‍රැතවත් ආර්ය ශ්‍රාවකයාට ව්‍යාධියට පත්වන ස්වභාවය ව්‍යාධියට පත්වෙයි. මරණයට පත්වන ස්වභාවය මරණයට පත්වෙයි. ක්ෂය වීමේ ස්වභාවය ක්ෂය වෙයි. විනාශ වීමේ ස්වභාවය විනාශ වෙයි. ඔහු විනාශ වීමේ ස්වභාවය විනාශ වූ විට මෙසේ විමසා බලයි: ‘විනාශ වීමේ ස්වභාවය විනාශ වන්නේ මට පමණක් නොවේ. යම් පමණකට සත්වයන්ගේ පැමිණීම, ගමන, චුතිය, නැවත ඉපදීම, ඒ සියලු සත්වයන්ට විනාශ වීමේ ස්වභාවය විනාශ වේ. විනාශ වීමේ ස්වභාවය විනාශ වූ විට මම ශෝක කරන්නෙම් නම්, වෙහෙසට පත්වන්නෙම් නම්, වැළපෙන්නෙම් නම්, පපුවට තලා හඬන්නෙම් නම්, මුළා බවට පත්වන්නෙම් නම්, මට ආහාර පවා නොරස වේ. ශරීරයද අවලස්සන වේ. කටයුතුද ඉදිරියට නොයයි. සතුරෝද සතුටු වෙති. මිත්‍රයෝද සිත් තැවුලට පත්වෙති’යි. ඔහු විනාශ වීමේ ස්වභාවය විනාශ වූ විට ශෝක නොකරයි, වෙහෙසට පත් නොවේ, වැළපෙන්නේ නැත, පපුවට තලා නොහඬයි, මුළා බවට පත් නොවේ. මහරජ, ‘මේ ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා විෂ සහිත ශෝක හී සල්‍යය උදුරා දැමුවේය. යම් හී සල්‍යයකින් අශ්‍රැතවත් පෘථග්ජනයා විදින ලදුව තමාම තවන්නේද, ඒ ශෝක හී සල්‍යය උදුරා දැමූ, ශෝක රහිත, හී සල්‍ය රහිත ආර්ය ශ්‍රාවකයා තමාම පිරිනිවන් පායි’ යැයි කියනු ලැබේ.\n\nමහරජ, මේ ලෝකයෙහි ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ දෙවියෙකුට හෝ මාරයෙකුට හෝ බ්‍රහ්මයෙකුට හෝ කිසිවෙකුට හෝ ලබාගත නොහැකි කරුණු පහ නම් මේවාය.\n\nශෝක කිරීමෙන් හෝ වැළපීමෙන් හෝ කිසිදු ප්‍රයෝජනයක් නොලැබේ.\nශෝක කරමින් දුකට පත් වූ ඔහු දැන, සතුරෝ සතුටු වෙති.\nයම් හෙයකින් නුවණැත්තා ආපදාවලදී නොසැලෙන්නේද, අර්ථ විනිශ්චය දන්නේද;\nඑවිට පැරණි, වෙනස් නොවුණු මුහුණ දැක, ඔහුගේ සතුරෝ දුකට පත්වෙති.\n\nජපයෙන්, මන්ත්‍රයෙන්, සුභාෂිතයෙන්, දිගින් දිගට දීමෙන් හෝ සම්ප්‍රදායෙන් හෝ යම් යම් අයුරින් යම් තැනක යම් අර්ථයක් (ප්‍රයෝජනයක්) ලබන්නේ නම්, ඒ ඒ අයුරින් එහි උත්සාහ කළ යුතු ය. මේ අර්ථය තමා විසින් හෝ අන් අය විසින් හෝ ලබාගත නොහැකි බව යම් කෙනෙකු දැනගන්නේ නම්, ශෝක නොකර ඉවසීමෙන් යුක්තව \"දැන් මා කුමන ස්ථිර කර්මයක් (ක්‍රියාවක්) කළ යුතු දැ\"යි සිතිය යුතු ය.\n\nමෙසේ පැවසූ විට, මුණ්ඩ රජු ආයුෂ්මත් නාරද තෙරුන්ට මෙසේ කී ය: \"පින්වත් ස්වාමීනි, මේ ධර්‍ම පරියායයේ (ධර්‍ම දේශනාවේ) නම කුමක්දැ\"යි? (නාරද තෙරුන් පිළිතුරු දුන්හ:) \"මහරජ, මේ ධර්‍ම පරියායයේ නම 'ශෝක ශල්‍ය හරණය' (ශෝක නමැති හී ශලය දුරු කිරීම) යි.\"\n\n\"ඇත්තෙන්මයි, පින්වත් ස්වාමීනි, එය ශෝක ශල්‍ය හරණයක් ම ය! පින්වත් ස්වාමීනි, මේ ධර්‍ම පරියායය අසා මගේ ශෝක නමැති ශල්‍යය දුරු වී ගියේ ය.\"\n\nඉක්බිති මුණ්ඩ රජු පියක නම් භාණ්ඩාගාරිකයා අමතා මෙසේ කී ය: \"එසේ නම්, පියක යහළුව, භද්දා දේවියගේ ශරීරය ආදාහනය කරවන්න; ඇය වෙනුවෙන් ස්තූපයක් ද ගොඩනංවන්න. අද පටන් අපි ස්නානය කරන්නෙමු, සුවඳ විලවුන් ආලේප කරන්නෙමු, ආහාර අනුභව කරන්නෙමු, තවද රාජකාරි ද කරන්නෙමු.\"",
      "paliTitle": "Nāradasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Muṇḍarājavaggo pañcamo. Tassuddānaṃ – Ādiyo sappuriso iṭṭhā, manāpadāyībhisandaṃ; Sampadā ca dhanaṃ ṭhānaṃ, kosalo nāradena cāti. Paṭhamapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}