{
  "id": "an5.25",
  "title": {
    "pali": "Duccaritavaggo",
    "english": "The Chapter on Misconduct",
    "sinhala": "දුෂ්චරිත වර්ගය"
  },
  "sections": [
    {
      "number": 241,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā duccarite. Katame pañca? Attāpi attānaṃ upavadati; anuvicca viññū garahanti; pāpako kittisaddo abbhuggacchati; sammūḷho kālaṃ karoti; kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā duccarite. ‘‘Pañcime, bhikkhave, ānisaṃsā sucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asammūḷho kālaṃ karoti; kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā sucarite’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five disadvantages in misconduct. Which five? One blames oneself; the discerning, having examined, censure one; an evil reputation spreads; one dies bewildered; and upon the dissolution of the body, after death, one reappears in a state of deprivation, a miserable bourn, a state of ruin, in hell. These, monks, are the five disadvantages in misconduct.\n\nMonks, there are these five advantages in good conduct. Which five? One does not blame oneself; the discerning, having examined, praise one; a good reputation spreads; one dies unbewildered; and upon the dissolution of the body, after death, one reappears in a happy bourn, a heavenly world. These, monks, are the five advantages in good conduct.",
      "sinhala": "භික්ෂූන් වහන්ස, දුශ්චරිතයෙහි මේ ආදීනව පසකි. කවරේද ඒ පස? තමාම තමාට නින්දා කරයි. විමසා බලා නුවණැති විද්වතුන් නින්දා කරති. නරක කීර්ති රාවයක් පැතිරෙයි. මුළා වූ සිහියෙන් මරණයට පත් වෙයි. කය බිඳී යාමෙන්, මරණින් පසු, අපාය නම් වූ දුගතියට, විනිපාතයට, නිරයට උපදී. භික්ෂූන් වහන්ස, දුශ්චරිතයෙහි මේ ආදීනව පස වන්නේය.\n\nභික්ෂූන් වහන්ස, සුචරිතයෙහි මේ ආනිසංස පසකි. කවරේද ඒ පස? තමාම තමාට නින්දා නොකරයි. විමසා බලා නුවණැති විද්වතුන් ප්‍රශංසා කරති. යහපත් කීර්ති රාවයක් පැතිරෙයි. මුළා නොවූ සිහියෙන් මරණයට පත් වෙයි. කය බිඳී යාමෙන්, මරණින් පසු, සුගතියට, ස්වර්ග ලෝකයට උපදී. භික්ෂූන් වහන්ස, සුචරිතයෙහි මේ ආනිසංස පස වන්නේය.",
      "paliTitle": "Paṭhamaduccaritasuttaṃ"
    },
    {
      "number": 242,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kāyaduccarite…pe… ānisaṃsā kāyasucarite…pe…. Dutiyaṃ.",
      "english": "Monks, there are these five dangers concerning bodily misconduct, and so on; and these five advantages concerning bodily good conduct, and so on. This is the second discourse.",
      "sinhala": "මහණෙනි, කය දුසිරිතෙහි මේ ආදීනවයෝ පස්දෙනෙක් වෙති. එමෙන්ම, කය සුසිරිතෙහි ද එම ආනිසංසයෝ පස්දෙනෙක් වෙති. මෙය දෙවැන්නයි.",
      "paliTitle": "Paṭhamakāyaduccaritasuttaṃ"
    },
    {
      "number": 243,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā vacīduccarite…pe… ānisaṃsā vacīsucarite…pe…. Tatiyaṃ.",
      "english": "Monks, there are these five disadvantages in misconduct of speech, [...], and advantages in wholesome speech, [...]. This is the third.",
      "sinhala": "භික්ෂූනි, වචී දුශ්චරිතයෙහි මේ ආදීනව පසක් ඇත... වචී සුචරිතයෙහි ආනිසංස පසක් ඇත.... තෙවැනි සූත්‍​රයයි.",
      "paliTitle": "Paṭhamavacīduccaritasuttaṃ"
    },
    {
      "number": 244,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā manoduccarite…pe… ānisaṃsā manosucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asammūḷho kālaṃ karoti; kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā manosucarite’’ti. Catutthaṃ.",
      "english": "Monastics, just as there are these five disadvantages in mental misconduct, so too are there these five advantages in good mental conduct. Which five? One does not reproach oneself; the discerning, having investigated, praise one; a good reputation spreads widely; one dies unbewildered; and with the breaking up of the body, after death, one reappears in a good destination, in a heavenly world. These, Monastics, are the five advantages in good mental conduct.",
      "sinhala": "භික්ෂූනි, මනෝදුශ්චරිතයෙහි (මනසින් කරන අයහපත් ක‍්‍රියාවන්හි) මේ ආදීනව (දෝෂ) පහක් ඇත. භික්ෂූනි, මනෝසුචරිතයෙහි (මනසින් කරන යහපත් ක‍්‍රියාවන්හි) මේ ආනිසංස (ප‍්‍රයෝජන) පහක් ඇත. ඒ පහ කවරේද? තමා විසින් තමාටම දොස් නොනගයි; විචක්‍ෂණ ඥානවන්තයෝ (කරුණු හොඳින්) විමසා (ඔහුට) ප‍්‍රශංසා කරති; කල්‍යාණ වූ කීර්ති ඝෝෂාවක් පැතිර යයි; මුළා නොවී මරණයට පත්වේ; ශරීරය බිඳී මරණයෙන් පසු සුගතියක් වූ ස්වර්ග ලෝකයක උපදී. භික්ෂූනි, මනෝසුචරිතයෙහි (මනසින් කරන යහපත් ක‍්‍රියාවන්හි) ඇති මේ ආනිසංස පහ මේවායි.",
      "paliTitle": "Paṭhamamanoduccaritasuttaṃ"
    },
    {
      "number": 245,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā duccarite. Katame pañca? Attāpi attānaṃ upavadati; anuvicca viññū garahanti; pāpako kittisaddo abbhuggacchati; saddhammā vuṭṭhāti; asaddhamme patiṭṭhāti. Ime kho, bhikkhave, pañca ādīnavā duccarite. ‘‘Pañcime, bhikkhave, ānisaṃsā sucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asaddhammā vuṭṭhāti; saddhamme patiṭṭhāti. Ime kho, bhikkhave, pañca ānisaṃsā sucarite’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, there are these five disadvantages in misconduct. Which five? One blames oneself; the discerning, having investigated, criticize; a bad reputation spreads abroad; one falls away from the True Dhamma; one becomes established in the false Dhamma. These, bhikkhus, are the five disadvantages in misconduct.\n\nBhikkhus, there are these five advantages in good conduct. Which five? One does not blame oneself; the discerning, having investigated, praise; a good reputation spreads abroad; one falls away from the false Dhamma; one becomes established in the True Dhamma. These, bhikkhus, are the five advantages in good conduct.",
      "sinhala": "‘‘මහණෙනි, දුශ්චරිතයෙහි ආදීනව පසක් ඇත. කවර පහක්ද? තමාම තමාට දොස් පවරයි; විමසා බලන ප්‍රඥාවන්තයෝ නින්දා කරති; පව් කීර්ති ඝෝෂාවක් පැතිර යයි; සද්ධර්මයෙන් බැහැර වෙයි; අසද්ධර්මයෙහි පිහිටයි. මහණෙනි, දුශ්චරිතයෙහි ඇති ආදීනව මෙතෙක් මේ පසය.\n\n‘‘මහණෙනි, සුචරිතයෙහි ආනිශංස පසක් ඇත. කවර පහක්ද? තමාම තමාට දොස් නොපවරයි; විමසා බලන ප්‍රඥාවන්තයෝ ප්‍රශංසා කරති; යහපත් කීර්ති ඝෝෂාවක් පැතිර යයි; අසද්ධර්මයෙන් බැහැර වෙයි; සද්ධර්මයෙහි පිහිටයි. මහණෙනි, සුචරිතයෙහි ඇති ආනිශංස මෙතෙක් මේ පසය.’’",
      "paliTitle": "Dutiyaduccaritasuttaṃ"
    },
    {
      "number": 246,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kāyaduccarite…pe… ānisaṃsā kāyasucarite…pe…. Chaṭṭhaṃ.",
      "english": "Monks, there are these five disadvantages arising from bodily misconduct; and likewise, advantages arising from bodily good conduct. This is the sixth.",
      "sinhala": "මහණෙනි, කායදුශ්චරිතයෙහි මේ පස්වැදෑරුම් ආදීනවයෝ වෙති. එසේම, කායසුචරිතයෙහි ද ඒ ආකාරයටම පස්වැදෑරුම් ආනිසංසයෝ වෙති. සයවැන්නයි.",
      "paliTitle": "Dutiyakāyaduccaritasuttaṃ"
    },
    {
      "number": 247,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā vacīduccarite…pe… ānisaṃsā vacīsucarite…pe…. Sattamaṃ.",
      "english": "Monastics, there are these five dangers associated with misconduct of speech, and similarly, there are these benefits associated with wholesome conduct of speech. This is the seventh discourse.",
      "sinhala": "මහණෙනි, වචී දුශ්චරිතයෙහි මේ ආදීනවයෝ පස්දෙනෙක් වෙත්. වචී සුචරිතයෙහි ද ආනිසංසයෝ වෙත්. සත්වනයි.",
      "paliTitle": "Dutiyavacīduccaritasuttaṃ"
    },
    {
      "number": 248,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā manoduccarite…pe… ānisaṃsā manosucarite. Katame pañca? Attāpi attānaṃ na upavadati; anuvicca viññū pasaṃsanti; kalyāṇo kittisaddo abbhuggacchati; asaddhammā vuṭṭhāti; saddhamme patiṭṭhāti. Ime kho, bhikkhave, pañca ānisaṃsā manosucarite’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five disadvantages in mental misconduct, and there are these five advantages in mental good conduct. Which five are they?\nOne experiences no self-reproach. Discerning individuals, upon careful examination, commend one. A good reputation spreads widely. One transcends unwholesome ways. One is firmly established in wholesome ways.\nThese, monks, are the five advantages in mental good conduct.",
      "sinhala": "භික්ෂූනි, මනෝදුශ්චරිතයෙහි ආදීනව පහක් ඇතිවාක් මෙන්ම, මනෝසුචරිතයෙහි ද ආනිසංස පහක් ඇත.\n\nඒ පහ කවරේද? තමා විසින් ද තමාට දොස් නොකියයි; විමසා බලා නුවණැත්තෝ (එවැන්නාට) ප්‍රශංසා කරති; යහපත් කීර්ති ඝෝෂාවක් පැතිර යයි; අසද්ධර්මයෙන් වෙන් වෙයි; සද්ධර්මයෙහි පිහිටයි. භික්ෂූනි, මනෝසුචරිතයෙහි වූ ආනිසංස මේ පස යි.",
      "paliTitle": "Dutiyamanoduccaritasuttaṃ"
    },
    {
      "number": 249,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā sivathikāya [sīvathikāya (sī. syā. kaṃ. pī.)]. Katame pañca? Asuci, duggandhā, sappaṭibhayā, vāḷānaṃ amanussānaṃ āvāso, bahuno janassa ārodanā – ime kho, bhikkhave, pañca ādīnavā sivathikāya. ‘‘Evamevaṃ kho, bhikkhave, pañcime ādīnavā sivathikūpame puggale. Katame pañca? Idha, bhikkhave, ekacco puggalo asucinā kāyakammena samannāgato hoti; asucinā vacīkammena samannāgato hoti; asucinā manokammena samannāgato hoti. Idamassa asucitāya vadāmi. Seyyathāpi sā, bhikkhave, sivathikā asuci; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘Tassa asucinā kāyakammena samannāgatassa, asucinā vacīkammena samannāgatassa, asucinā manokammena samannāgatassa pāpako kittisaddo abbhuggacchati. Idamassa duggandhatāya vadāmi. Seyyathāpi sā, bhikkhave, sivathikā duggandhā; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘Tamenaṃ asucinā kāyakammena samannāgataṃ, asucinā vacīkammena samannāgataṃ, asucinā manokammena samannāgataṃ pesalā sabrahmacārī ārakā parivajjanti. Idamassa sappaṭibhayasmiṃ vadāmi. Seyyathāpi sā, bhikkhave, sivathikā sappaṭibhayā; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘So asucinā kāyakammena samannāgato, asucinā vacīkammena samannāgato, asucinā manokammena samannāgato sabhāgehi puggalehi saddhiṃ saṃvasati. Idamassa vāḷāvāsasmiṃ vadāmi. Seyyathāpi sā, bhikkhave, sivathikā vāḷānaṃ amanussānaṃ āvāso; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. ‘‘Tamenaṃ asucinā kāyakammena samannāgataṃ, asucinā vacīkammena samannāgataṃ, asucinā manokammena samannāgataṃ pesalā sabrahmacārī disvā khīyadhammaṃ [khīyanadhammaṃ (sī.)] āpajjanti – ‘aho vata no dukkhaṃ ye mayaṃ evarūpehi puggalehi saddhiṃ saṃvasāmā’ti! Idamassa ārodanāya vadāmi. Seyyathāpi sā, bhikkhave, sivathikā bahuno janassa ārodanā; tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ime kho, bhikkhave, pañca ādīnavā sivathikūpame puggale’’ti. Navamaṃ.",
      "english": "“Bhikkhus, there are these five dangers in a charnel ground. Which five? It is impure, foul-smelling, fearful, an abode for wild animals and non-human beings, and a cause for many people’s lamentation. These, bhikkhus, are the five dangers in a charnel ground.\n\n“Similarly, bhikkhus, there are these five dangers in a person comparable to a charnel ground. Which five? Here, bhikkhus, some individual is endowed with impure bodily action; is endowed with impure verbal action; is endowed with impure mental action. I say this is his impurity. Just as that charnel ground, bhikkhus, is impure, so do I declare this person to be comparable.\n\n“For him, who is endowed with impure bodily action, endowed with impure verbal action, and endowed with impure mental action, an evil reputation arises. I say this is his foul smell. Just as that charnel ground, bhikkhus, is foul-smelling, so do I declare this person to be comparable.\n\n“Such a person, endowed with impure bodily action, impure verbal action, and impure mental action, is avoided from afar by virtuous fellow practitioners. I say this is his fearfulness. Just as that charnel ground, bhikkhus, is fearful, so do I declare this person to be comparable.\n\n“That person, endowed with impure bodily action, impure verbal action, and impure mental action, dwells with individuals of a similar kind. I say this is his abode for wild animals and non-human beings. Just as that charnel ground, bhikkhus, is an abode for wild animals and non-human beings, so do I declare this person to be comparable.\n\n“Seeing that person, endowed with impure bodily action, impure verbal action, and impure mental action, virtuous fellow practitioners grow disgusted, thinking: ‘Alas, what suffering it is for us that we dwell with such individuals!’ I say this is his cause for lamentation. Just as that charnel ground, bhikkhus, is a cause for many people’s lamentation, so do I declare this person to be comparable. These, bhikkhus, are the five dangers in a person comparable to a charnel ground.”",
      "sinhala": "භික්ෂූනි, සොහොනෙහි මේ ආදීනව පහක් වෙයි. ඒ පහ කවරේද? අපිරිසිදු බව, දුර්ගන්ධ බව, භයානක බව, වන සතුන්ගේ හා අමනුෂ්‍යයන්ගේ වාසස්ථානයක් වීම, සහ බොහෝ දෙනෙකුගේ ශෝකයට හේතුවීමයි. භික්ෂූනි, සොහොනෙහි ඇති ආදීනව පහ මේවායි.\n\nභික්ෂූනි, එලෙසින්ම සොහොනට උපමා කළ හැකි පුද්ගලයා තුළ ද මේ ආදීනව පහක් වෙයි. ඒ පහ කවරේද? භික්ෂූනි, මෙහි සමහර පුද්ගලයෙක් අපිරිසිදු කායික කර්මයන්ගෙන් යුක්ත වෙයි; අපිරිසිදු වාචසික කර්මයන්ගෙන් යුක්ත වෙයි; අපිරිසිදු මානසික කර්මයන්ගෙන් යුක්ත වෙයි. මේ අයුරින් ඔහුගේ අපිරිසිදු බව මම පවසමි. භික්ෂූනි, යම්සේ ඒ සොහොන අපිරිසිදු ද, එසේම මම මේ පුද්ගලයා උපමා කර පවසමි.\n\nඅපිරිසිදු කායික කර්මයන්ගෙන්, අපිරිසිදු වාචසික කර්මයන්ගෙන්, අපිරිසිදු මානසික කර්මයන්ගෙන් යුක්ත වූ ඒ පුද්ගලයාගේ පාපී කීර්ති රාවයක් පැතිර යයි. මේ අයුරින් ඔහුගේ දුර්ගන්ධ බව මම පවසමි. භික්ෂූනි, යම්සේ ඒ සොහොන දුර්ගන්ධ ද, එසේම මම මේ පුද්ගලයා උපමා කර පවසමි.\n\nඅපිරිසිදු කායික කර්මයන්ගෙන්, අපිරිසිදු වාචසික කර්මයන්ගෙන්, අපිරිසිදු මානසික කර්මයන්ගෙන් යුක්ත වූ ඒ පුද්ගලයා ප්‍රසන්න බ්‍රහ්මචාරීන් විසින් දුරින්ම අත්හරිනු ලැබේ. මේ අයුරින් ඔහුගේ භයානක බව මම පවසමි. භික්ෂූනි, යම්සේ ඒ සොහොන භයානක ද, එසේම මම මේ පුද්ගලයා උපමා කර පවසමි.\n\nඅපිරිසිදු කායික කර්මයන්ගෙන්, අපිරිසිදු වාචසික කර්මයන්ගෙන්, අපිරිසිදු මානසික කර්මයන්ගෙන් යුක්ත වූ හෙතෙම තමන් හා සමාන පුද්ගලයන් සමඟ වාසය කරයි. මේ අයුරින් ඔහුගේ වන සතුන් හා අමනුෂ්‍ය වාසය මම පවසමි. භික්ෂූනි, යම්සේ ඒ සොහොන වන සතුන්ගේ හා අමනුෂ්‍යයන්ගේ වාසස්ථානයක් ද, එසේම මම මේ පුද්ගලයා උපමා කර පවසමි.\n\nඅපිරිසිදු කායික කර්මයන්ගෙන්, අපිරිසිදු වාචසික කර්මයන්ගෙන්, අපිරිසිදු මානසික කර්මයන්ගෙන් යුක්ත වූ ඒ පුද්ගලයා දැක ප්‍රසන්න බ්‍රහ්මචාරීන් ශෝකයට පත් වෙති – ‘අහෝ, අපි මෙබඳු පුද්ගලයන් සමඟ වාසය කරන්නට වීමෙන් කෙතරම් දුක් විඳින්නෝද!’ යි. මේ අයුරින් ඔහුගේ ශෝකයට හේතුවීම මම පවසමි. භික්ෂූනි, යම්සේ ඒ සොහොන බොහෝ දෙනෙකුගේ ශෝකයට හේතුවක් ද, එසේම මම මේ පුද්ගලයා උපමා කර පවසමි. භික්ෂූනි, සොහොනට උපමා කළ හැකි පුද්ගලයා තුළ ඇති ආදීනව පහ මේවායි.",
      "paliTitle": "Sivathikasuttaṃ"
    },
    {
      "number": 250,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā puggalappasāde. Katame pañca? Yasmiṃ, bhikkhave, puggale puggalo abhippasanno hoti, so tathārūpaṃ āpattiṃ āpanno hoti yathārūpāya āpattiyā saṅgho ukkhipati. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo piyo manāpo so saṅghena ukkhitto’ti. Bhikkhūsu appasādabahulo hoti. Bhikkhūsu appasādabahulo samāno aññe bhikkhū na bhajati. Aññe bhikkhū abhajanto saddhammaṃ na suṇāti. Saddhammaṃ asuṇanto saddhammā parihāyati. Ayaṃ, bhikkhave, paṭhamo ādīnavo puggalappasāde. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ puggale puggalo abhippasanno hoti, so tathārūpaṃ āpattiṃ āpanno hoti yathārūpāya āpattiyā saṅgho ante nisīdāpeti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo piyo manāpo so saṅghena ante nisīdāpito’ti. Bhikkhūsu appasādabahulo hoti. Bhikkhūsu appasādabahulo samāno aññe bhikkhū na bhajati. Aññe bhikkhū abhajanto saddhammaṃ na suṇāti. Saddhammaṃ asuṇanto saddhammā parihāyati. Ayaṃ, bhikkhave, dutiyo ādīnavo puggalappasāde. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ puggale puggalo abhippasanno hoti, so disāpakkanto hoti… pe… so vibbhanto hoti…pe… so kālaṅkato hoti. Tassa evaṃ hoti – ‘yo kho myāyaṃ puggalo piyo manāpo so kālaṅkato’ti. Aññe bhikkhū na bhajati. Aññe bhikkhū abhajanto saddhammaṃ na suṇāti. Saddhammaṃ asuṇanto saddhammā parihāyati. Ayaṃ, bhikkhave, pañcamo ādīnavo puggalappasāde. Ime kho, bhikkhave, pañca ādīnavā puggalappasāde’’ti. Dasamaṃ. ",
      "english": "Bhikkhus, there are these five dangers in having devotion to individuals. Which five?\nWhen, bhikkhus, a person has strong devotion to a certain individual, and that individual commits such an offense for which the Saṅgha suspends them, then it occurs to that person: ‘Indeed, that individual, who was dear and pleasing to me, has been suspended by the Saṅgha.’ They become greatly disheartened towards the bhikkhus. Being greatly disheartened towards the bhikkhus, they do not associate with other bhikkhus. Not associating with other bhikkhus, they do not hear the True Dhamma. Not hearing the True Dhamma, they fall away from the True Dhamma. This, bhikkhus, is the first danger in having devotion to individuals.\n\nAgain, bhikkhus, when a person has strong devotion to a certain individual, and that individual commits such an offense for which the Saṅgha makes them sit on the edge of the assembly, then it occurs to that person: ‘Indeed, that individual, who was dear and pleasing to me, has been made to sit on the edge by the Saṅgha.’ They become greatly disheartened towards the bhikkhus. Being greatly disheartened towards the bhikkhus, they do not associate with other bhikkhus. Not associating with other bhikkhus, they do not hear the True Dhamma. Not hearing the True Dhamma, they fall away from the True Dhamma. This, bhikkhus, is the second danger in having devotion to individuals.\n\nAgain, bhikkhus, when a person has strong devotion to a certain individual, and that individual departs... or falls away from the training... or dies. Then it occurs to that person: ‘Indeed, that individual, who was dear and pleasing to me, has died.’ They do not associate with other bhikkhus. Not associating with other bhikkhus, they do not hear the True Dhamma. Not hearing the True Dhamma, they fall away from the True Dhamma. This, bhikkhus, is the fifth danger in having devotion to individuals. These, bhikkhus, are the five dangers in having devotion to individuals.",
      "sinhala": "මහණෙනි, පුද්ගලයන් කෙරෙහි ප්‍රසාදයෙහි මේ ආදීනවෝ පස්දෙනා වෙති. ඒ කවර පස්දෙනෙක්ද?\n\nමහණෙනි, යම් පුද්ගලයෙක් කෙරෙහි යම් පුද්ගලයෙක් අතිශයින්ම ප්‍රසන්නව සිටීද, ඔහු සංඝයා විසින් උක්ඛේපනීය කර්මයට (සංඝයෙන් නෙරපීමට) ලක් කරන ලද ආපත්තියකට පත්වෙයි. එවිට ඔහුට මෙසේ සිතේ: ‘මාගේ මේ ප්‍රිය මනාප පුද්ගලයා සංඝයා විසින් උක්ඛේපනීය කර්මයට ලක්කරන ලද්දේයැ’යි. ඔහු භික්ෂූන් කෙරෙහි බොහෝ අප්‍රසාදයට පත්වෙයි. භික්ෂූන් කෙරෙහි අප්‍රසාදයට පත්ව සිටින ඔහු අන්‍ය භික්ෂූන් ඇසුරු නොකරයි. අන්‍ය භික්ෂූන් ඇසුරු නොකරන ඔහු සද්ධර්මය ශ්‍රවණය නොකරයි. සද්ධර්මය ශ්‍රවණය නොකරන ඔහු සද්ධර්මයෙන් පිරිහෙයි. මහණෙනි, පුද්ගල ප්‍රසාදයෙහි වූ පළමු ආදීනවය මෙයයි.\n\nමහණෙනි, තවද යම් පුද්ගලයෙක් කෙරෙහි යම් පුද්ගලයෙක් අතිශයින්ම ප්‍රසන්නව සිටීද, ඔහු සංඝයා විසින් අන්තේවාසික කර්මයට (පසුපෙළ අසුන්ගැන්වීමට) ලක් කරන ලද ආපත්තියකට පත්වෙයි. එවිට ඔහුට මෙසේ සිතේ: ‘මාගේ මේ ප්‍රිය මනාප පුද්ගලයා සංඝයා විසින් අන්තේවාසික කර්මයට ලක්කරන ලද්දේයැ’යි. ඔහු භික්ෂූන් කෙරෙහි බොහෝ අප්‍රසාදයට පත්වෙයි. භික්ෂූන් කෙරෙහි අප්‍රසාදයට පත්ව සිටින ඔහු අන්‍ය භික්ෂූන් ඇසුරු නොකරයි. අන්‍ය භික්ෂූන් ඇසුරු නොකරන ඔහු සද්ධර්මය ශ්‍රවණය නොකරයි. සද්ධර්මය ශ්‍රවණය නොකරන ඔහු සද්ධර්මයෙන් පිරිහෙයි. මහණෙනි, පුද්ගල ප්‍රසාදයෙහි වූ දෙවන ආදීනවය මෙයයි.\n\nමහණෙනි, තවද යම් පුද්ගලයෙක් කෙරෙහි යම් පුද්ගලයෙක් අතිශයින්ම ප්‍රසන්නව සිටීද, ඒ පුද්ගලයා (තෙවනුව) වෙනත් දිශාවකට පිටත්ව යයි, (සිව්වෙනුව) ව්‍යාකූලත්වයට පත්වෙයි, (පස්වෙනුව) මිය යයි. එවිට ඔහුට මෙසේ සිතේ: ‘මාගේ මේ ප්‍රිය මනාප පුද්ගලයා මියගියේයැ’යි. ඔහු අන්‍ය භික්ෂූන් ඇසුරු නොකරයි. අන්‍ය භික්ෂූන් ඇසුරු නොකරන ඔහු සද්ධර්මය ශ්‍රවණය නොකරයි. සද්ධර්මය ශ්‍රවණය නොකරන ඔහු සද්ධර්මයෙන් පිරිහෙයි. මහණෙනි, පුද්ගල ප්‍රසාදයෙහි වූ පස්වන ආදීනවය මෙයයි. මහණෙනි, පුද්ගල ප්‍රසාදයෙහි වූ මේ ආදීනවෝ පස්දෙනා මොවුහු වෙති.",
      "paliTitle": "Puggalappasādasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Duccaritavaggo pañcamo. Tassuddānaṃ – Duccaritaṃ kāyaduccaritaṃ, vacīduccaritaṃ manoduccaritaṃ; Catūhi pare dve sivathikā, puggalappasādena cāti. Pañcamapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}