{
  "id": "an5.21",
  "title": {
    "pali": "Pañcamapaṇṇāsakaṃ -Kimilavaggo",
    "english": "The Fifth Fifty – The Kimila Chapter",
    "sinhala": "පඤ්චමපණ්ණාසකය - කිමිලවග්ගය"
  },
  "sections": [
    {
      "number": 201,
      "pali": "Ekaṃ samayaṃ bhagavā kimilāyaṃ [kimbilāyaṃ (sī. pī.) a. ni. 6.40; 7.59] viharati veḷuvane. Atha kho āyasmā kimilo [kimbilo (sī. syā. kaṃ. pī.)] yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā kimilo bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hotī’’ti? ‘‘Idha, kimila, tathāgate parinibbute bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari agāravā viharanti appatissā, dhamme agāravā viharanti appatissā, saṅghe agāravā viharanti appatissā, sikkhāya agāravā viharanti appatissā, aññamaññaṃ agāravā viharanti appatissā. Ayaṃ kho, kimila, hetu ayaṃ paccayo, yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hotī’’ti. ‘‘Ko pana, bhante, hetu ko paccayo, yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti? ‘‘Idha, kimila, tathāgate parinibbute bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari sagāravā viharanti sappatissā, dhamme sagāravā viharanti sappatissā, saṅghe sagāravā viharanti sappatissā, sikkhāya sagāravā viharanti sappatissā, aññamaññaṃ sagāravā viharanti sappatissā. Ayaṃ kho, kimila, hetu ayaṃ paccayo, yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti. Paṭhamaṃ.",
      "english": "At one time the Blessed One was dwelling in the Bamboo Grove in Kimila. Then indeed, the venerable Kimila approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side.\n\nSeated to one side, the venerable Kimila said this to the Blessed One: \"Venerable Sir, what is the cause, what is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma does not endure for a long time?\"\n\n\"Here, Kimila, when the Tathāgata has attained final Nibbāna, monks, nuns, male lay followers, and female lay followers dwell without respect for the Teacher, without deference; they dwell without respect for the Dhamma, without deference; they dwell without respect for the Saṅgha, without deference; they dwell without respect for the training, without deference; they dwell without respect for one another, without deference. This, Kimila, is the cause, this is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma does not endure for a long time.\"\n\n\"But Venerable Sir, what is the cause, what is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma endures for a long time?\"\n\n\"Here, Kimila, when the Tathāgata has attained final Nibbāna, monks, nuns, male lay followers, and female lay followers dwell with respect for the Teacher, with deference; they dwell with respect for the Dhamma, with deference; they dwell with respect for the Saṅgha, with deference; they dwell with respect for the training, with deference; they dwell with respect for one another, with deference. This, Kimila, is the cause, this is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma endures for a long time.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කිමිලාවේ වේළුවන නම් ස්ථානයෙහි වාසය කරන සේක.\n\nඉන්පසු ආයුෂ්මත් කිමිලෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය; එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි ආයුෂ්මත් කිමිලෝ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"භාග්‍යවතුන් වහන්ස, තථාගතයන් වහන්සේ පිරිනිවන් පෑ පසු සද්ධර්මය බොහෝ කලක් නොපවතිනුයේ කවර හේතුවක් නිසාද, කවර ප්‍රත්‍යයක් නිසාද?\"\n\n\"කිමිල, මෙහිලා තථාගතයන් වහන්සේ පිරිනිවන් පෑ පසු භික්ෂූන්, භික්ෂුණීන්, උපාසකවරුන් සහ උපාසිකාවන් ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයකින් තොරව, බියක් නොමැතිව වාසය කරති. ධර්මය කෙරෙහි ගෞරවයකින් තොරව, බියක් නොමැතිව වාසය කරති. සංඝයා කෙරෙහි ගෞරවයකින් තොරව, බියක් නොමැතිව වාසය කරති. ශික්ෂාව කෙරෙහි ගෞරවයකින් තොරව, බියක් නොමැතිව වාසය කරති. එකිනෙකා කෙරෙහි ගෞරවයකින් තොරව, බියක් නොමැතිව වාසය කරති. කිමිල, තථාගතයන් වහන්සේ පිරිනිවන් පෑ පසු සද්ධර්මය බොහෝ කලක් නොපවතිනුයේ මේ හේතුවය, මේ ප්‍රත්‍යයයයි.\"\n\n\"එසේ නම්, භාග්‍යවතුන් වහන්ස, තථාගතයන් වහන්සේ පිරිනිවන් පෑ පසු සද්ධර්මය බොහෝ කලක් පවතිනුයේ කවර හේතුවක් නිසාද, කවර ප්‍රත්‍යයක් නිසාද?\"\n\n\"කිමිල, මෙහිලා තථාගතයන් වහන්සේ පිරිනිවන් පෑ පසු භික්ෂූන්, භික්ෂුණීන්, උපාසකවරුන් සහ උපාසිකාවන් ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් යුතුව, බියක් සහිතව වාසය කරති. ධර්මය කෙරෙහි ගෞරවයෙන් යුතුව, බියක් සහිතව වාසය කරති. සංඝයා කෙරෙහි ගෞරවයෙන් යුතුව, බියක් සහිතව වාසය කරති. ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුතුව, බියක් සහිතව වාසය කරති. එකිනෙකා කෙරෙහි ගෞරවයෙන් යුතුව, බියක් සහිතව වාසය කරති. කිමිල, තථාගතයන් වහන්සේ පිරිනිවන් පෑ පසු සද්ධර්මය බොහෝ කලක් පවතිනුයේ මේ හේතුවය, මේ ප්‍රත්‍යයයයි.\"\n\nපළමුවන කොටස.",
      "paliTitle": "Kimilasuttaṃ",
      "englishTitle": "The Discourse to Kimila",
      "sinhalaTitle": "කිමිල සූත්‍රය"
    },
    {
      "number": 202,
      "pali": "‘‘Pañcime, bhikkhave, ānisaṃsā dhammassavane. Katame pañca? Assutaṃ suṇāti, sutaṃ pariyodāpeti, kaṅkhaṃ vitarati [vihanati (syā. kaṃ. pī. ka.)], diṭṭhiṃ ujuṃ karoti, cittamassa pasīdati. Ime kho, bhikkhave, pañca ānisaṃsā dhammassavane’’ti. Dutiyaṃ.",
      "english": "Monastics, there are these five benefits in listening to the Dhamma. What are these five? One hears what has not been heard; one clarifies what has been heard; one overcomes doubt; one straightens one's views; and one's mind becomes clear. These, monastics, are the five benefits in listening to the Dhamma.",
      "sinhala": "භික්ෂූණි, ධර්ම ශ්‍රවණයෙහි මේ ආනිසංස පසක් ඇත. ඒ පස කුමක්ද? නොඇසූ දෙයක් අසයි, ඇසූ දේ මනාව අවබෝධ කරගනියි, සැකය දුරු කරයි, දෘෂ්ටිය ඍජු කරයි, ඔහුගේ සිත පහදියි. භික්ෂූණි, ධර්ම ශ්‍රවණයෙහි මේ ආනිසංස පස වෙති.",
      "paliTitle": "Dhammassavanasuttaṃ",
      "englishTitle": "Hearing the Dhamma Sutta",
      "sinhalaTitle": "ධම්මස්සවන සූත්‍රය"
    },
    {
      "number": 203,
      "pali": "‘‘Pañcahi, bhikkhave, aṅgehi samannāgato rañño bhadro [bhaddo (pī.)] assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. ‘‘Katamehi pañcahi? Ajjavena, javena, maddavena, khantiyā, soraccena – imehi kho, bhikkhave, pañcahi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. ‘‘Katamehi pañcahi? Ajjavena, javena, maddavena, khantiyā, soraccena – imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Tatiyaṃ.",
      "english": "Monks, an excellent thoroughbred horse, endowed with five qualities, is worthy of a king, fit for a king's use, and is reckoned as a king's possession. What five? Integrity, swiftness, gentleness, patience, and graciousness. Indeed, monks, an excellent thoroughbred horse, endowed with these five qualities, is worthy of a king, fit for a king's use, and is reckoned as a king's possession.\n\nIn the same way, monks, a monk endowed with five qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, and is an unsurpassed field of merit for the world. What five? Integrity, swiftness, gentleness, patience, and graciousness. Indeed, monks, a monk endowed with these five qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, and is an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ රජුගේ උතුම් අශ්වයා රාජකීය වශයෙන් සුදුසු වේ, රජුට භෝග්‍ය වේ, රජුගේම අංගයක් ලෙස සැලකේ.\n\nඒ කවර පසකින්ද? අවංක බවෙන්, වේගවත් බවෙන්, මෘදු බවෙන්, ඉවසීමෙන්, සෞරත්‍යයෙන් යුක්ත වීමෙනි. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ රජුගේ උතුම් අශ්වයා රාජකීය වශයෙන් සුදුසු වේ, රජුට භෝග්‍ය වේ, රජුගේම අංගයක් ලෙස සැලකේ.\n\nඑලෙසින්ම, මහණෙනි, කරුණු පහකින් යුක්ත වූ භික්‍ෂුව ආහුණෙය වේ, පාහුණෙය වේ, දක්‍ෂිණෙය වේ, ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ.\n\nඒ කවර පසකින්ද? සෘජු බවෙන්, ඥාන වේගයෙන්, මෘදු බවෙන්, ඉවසීමෙන්, සෞරත්‍යයෙන් යුක්ත වීමෙනි. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ භික්‍ෂුව ආහුණෙය වේ, පාහුණෙය වේ, දක්‍ෂිණෙය වේ, ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ.",
      "paliTitle": "Assājānīyasuttaṃ",
      "englishTitle": "The Discourse on the Thoroughbred Horse",
      "sinhalaTitle": "අස්සාජානීය සූත්‍රය"
    },
    {
      "number": 204,
      "pali": "‘‘Pañcimāni, bhikkhave, balāni. Katamāni pañca? Saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ – imāni kho, bhikkhave, pañca balānī’’ti. Catutthaṃ.",
      "english": "Monks, these are five powers. Which five? The power of conviction, the power of moral shame, the power of moral dread, the power of energy, and the power of wisdom – these, monks, are indeed the five powers.",
      "sinhala": "මහණෙනි, මේ බලධර්ම පසකි. ඒ කවරේද? ශ්‍රද්ධා බලය, හිරි බලය, ඔත්තප්ප බලය, වීර්‍යය බලය, ප්‍රඥා බලය යන මේවාය. මහණෙනි, මේ බලධර්ම පස නම් මේවාමයි.",
      "paliTitle": "Balasuttaṃ",
      "englishTitle": "The Discourse on Power",
      "sinhalaTitle": "බල සූත්‍රය"
    },
    {
      "number": 205,
      "pali": "[a. ni. 9.71; ma. ni. 1.185; dī. ni. 3.319] ‘‘Pañcime, bhikkhave, cetokhilā. Katame pañca? Idha, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati. Yo so, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ paṭhamo cetokhilo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme kaṅkhati…pe… saṅghe kaṅkhati…pe… sikkhāya kaṅkhati…pe… sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ pañcamo cetokhilo. Ime kho, bhikkhave, pañca cetokhilā’’ti. Pañcamaṃ.",
      "english": "Monks, there are these five mental barrennesses. What are these five? Here, monks, a bhikkhu harbors doubt, perplexity, does not resolve, and is not confident regarding the Teacher. That bhikkhu, monks, who harbors doubt, perplexity, does not resolve, and is not confident regarding the Teacher—his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion. When his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion, this is the first mental barrenness.\n\nFurthermore, monks, a bhikkhu harbors doubt, perplexity, does not resolve, and is not confident regarding the Dhamma. That bhikkhu, monks, who harbors doubt, perplexity, does not resolve, and is not confident regarding the Dhamma—his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion. When his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion, this is the second mental barrenness. Again, monks, a bhikkhu harbors doubt, perplexity, does not resolve, and is not confident regarding the Saṅgha. That bhikkhu, monks, who harbors doubt, perplexity, does not resolve, and is not confident regarding the Saṅgha—his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion. When his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion, this is the third mental barrenness. Again, monks, a bhikkhu harbors doubt, perplexity, does not resolve, and is not confident regarding the training. That bhikkhu, monks, who harbors doubt, perplexity, does not resolve, and is not confident regarding the training—his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion. When his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion, this is the fourth mental barrenness. Again, monks, regarding his fellow practitioners, he is angry, discontented, with an afflicted mind, and mentally barren. That bhikkhu, monks, who is angry, discontented, with an afflicted mind, and mentally barren regarding his fellow practitioners—his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion. When his mind does not incline towards ardent effort, sustained application, continuous practice, and strenuous exertion, this is the fifth mental barrenness. These, monks, are the five mental barrennesses.",
      "sinhala": "මහණෙනි, මේ චේතෝඛිල පහකි. ඒ කවරහු ද? මහණෙනි, මෙහිලා භික්ෂුවක් ශාස්තෲන් වහන්සේ කෙරෙහි සැක කරයි, විමතියට පත්වේ, අදිටන් නොකරයි, පහදින්නේ ද නැත. මහණෙනි, යම් භික්ෂුවක් ශාස්තෲන් වහන්සේ කෙරෙහි සැක කරයි ද, විමතියට පත්වේ ද, අදිටන් නොකරයි ද, පහදින්නේ ද නැද්ද, ඔහුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි. යමෙකුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි ද, මේ පළමු වන චේතෝඛිලයයි.\n\nමහණෙනි, නැවතත් තවත් කාරණයක් නම්, භික්ෂුවක් ධර්මය කෙරෙහි සැක කරයි, විමතියට පත්වේ, අදිටන් නොකරයි, පහදින්නේ ද නැත. මහණෙනි, යම් භික්ෂුවක් ධර්මය කෙරෙහි සැක කරයි ද, විමතියට පත්වේ ද, අදිටන් නොකරයි ද, පහදින්නේ ද නැද්ද, ඔහුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි. යමෙකුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි ද, මේ දෙවන චේතෝඛිලයයි. මහණෙනි, නැවතත් තවත් කාරණයක් නම්, භික්ෂුවක් සංඝයා කෙරෙහි සැක කරයි, විමතියට පත්වේ, අදිටන් නොකරයි, පහදින්නේ ද නැත. මහණෙනි, යම් භික්ෂුවක් සංඝයා කෙරෙහි සැක කරයි ද, විමතියට පත්වේ ද, අදිටන් නොකරයි ද, පහදින්නේ ද නැද්ද, ඔහුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි. යමෙකුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි ද, මේ තුන්වන චේතෝඛිලයයි. මහණෙනි, නැවතත් තවත් කාරණයක් නම්, භික්ෂුවක් ශික්ෂාව කෙරෙහි සැක කරයි, විමතියට පත්වේ, අදිටන් නොකරයි, පහදින්නේ ද නැත. මහණෙනි, යම් භික්ෂුවක් ශික්ෂාව කෙරෙහි සැක කරයි ද, විමතියට පත්වේ ද, අදිටන් නොකරයි ද, පහදින්නේ ද නැද්ද, ඔහුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි. යමෙකුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි ද, මේ සිව්වන චේතෝඛිලයයි. මහණෙනි, නැවතත් තවත් කාරණයක් නම්, භික්ෂුවක් සම්‍යක් බ්‍රහ්මචාරීව කටයුතු කරන සගයන් කෙරෙහි කෝප වූයේ, නොසතුටු සිත් ඇත්තේ, සිත් තැවුලට පත් වූයේ, කටු සිතින් යුක්ත වූයේ වේ. මහණෙනි, යම් භික්ෂුවක් සම්‍යක් බ්‍රහ්මචාරීව කටයුතු කරන සගයන් කෙරෙහි කෝප වූයේ, නොසතුටු සිත් ඇත්තේ, සිත් තැවුලට පත් වූයේ, කටු සිතින් යුක්ත වූයේ වේ ද, ඔහුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි. යමෙකුගේ සිත වීර්යය පිණිස ද, නොයෙක් වර යෙදීම පිණිස ද, නොකඩවා පැවැත්ම පිණිස ද, දැඩි උත්සාහය පිණිස ද නොනැමෙයි ද, මේ පස්වන චේතෝඛිලයයි. මහණෙනි, මේ චේතෝඛිල පහ මෙලෙසින් වේ.",
      "paliTitle": "Cetokhilasuttaṃ",
      "englishTitle": "The Barrenness of Mind Sutta",
      "sinhalaTitle": "චේතෝඛිල සූත්‍රය"
    },
    {
      "number": 206,
      "pali": "[a. ni. 9.72; dī. ni. 3.320] ‘‘Pañcime, bhikkhave, cetasovinibandhā [cetovinibaddhā (sāratthadīpanīṭīkāyaṃ)]. Katame pañca? Idha, bhikkhave, bhikkhu kāmesu avītarāgo [avigatarāgo (ka.)] hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Yo so, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ paṭhamo cetasovinibandho. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye avītarāgo hoti…pe… rūpe avītarāgo hoti…pe… yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati… pe… aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ pañcamo cetasovinibandho. Ime kho, bhikkhave, pañca cetasovinibandhā’’ti. Chaṭṭhaṃ.",
      "english": "There are these five fetters of the mind, monks. Which five? Here, monks, a monk has not eradicated passion for sensual pleasures, has not rid himself of desire, has not rid himself of affection, has not rid himself of thirst, has not rid himself of feverish distress, has not rid himself of craving. The mind of that monk, monks, who has not eradicated passion for sensual pleasures, has not rid himself of desire, has not rid himself of affection, has not rid himself of thirst, has not rid himself of feverish distress, has not rid himself of craving, does not incline towards ardent exertion, persistent application, continuous effort, or striving. For whom the mind does not incline towards ardent exertion, persistent application, continuous effort, or striving, this is the first fetter of the mind.\n\nFurthermore, monks, a monk has not eradicated passion for the body, has not rid himself of desire, has not rid himself of affection, has not rid himself of thirst, has not rid himself of feverish distress, has not rid himself of craving. The mind of that monk, monks, who has not eradicated passion for the body, has not rid himself of desire, has not rid himself of affection, has not rid himself of thirst, has not rid himself of feverish distress, has not rid himself of craving, does not incline towards ardent exertion, persistent application, continuous effort, or striving. For whom the mind does not incline towards ardent exertion, persistent application, continuous effort, or striving, this is the second fetter of the mind. Furthermore, monks, a monk has not eradicated passion for forms, has not rid himself of desire, has not rid himself of affection, has not rid himself of thirst, has not rid himself of feverish distress, has not rid himself of craving. The mind of that monk, monks, who has not eradicated passion for forms, has not rid himself of desire, has not rid himself of affection, has not rid himself of thirst, has not rid himself of feverish distress, has not rid himself of craving, does not incline towards ardent exertion, persistent application, continuous effort, or striving. For whom the mind does not incline towards ardent exertion, persistent application, continuous effort, or striving, this is the third fetter of the mind. Furthermore, monks, having eaten his fill, stuffing himself, he devotes himself to the pleasure of lying down, the pleasure of slumber, the pleasure of sleep. The mind of that monk, monks, who, having eaten his fill, stuffing himself, devotes himself to the pleasure of lying down, the pleasure of slumber, the pleasure of sleep, does not incline towards ardent exertion, persistent application, continuous effort, or striving. For whom the mind does not incline towards ardent exertion, persistent application, continuous effort, or striving, this is the fourth fetter of the mind. Furthermore, monks, he practices the holy life with the aspiration towards rebirth in a certain class of devas – ‘By this morality, or by this vow, or by this austerity, or by this holy life, may I become a deva or a certain kind of deva’. The mind of that monk, monks, who practices the holy life with the aspiration towards rebirth in a certain class of devas – ‘By this morality, or by this vow, or by this austerity, or by this holy life, may I become a deva or a certain kind of deva’ – does not incline towards ardent exertion, persistent application, continuous effort, or striving. For whom the mind does not incline towards ardent exertion, persistent application, continuous effort, or striving, this is the fifth fetter of the mind. These, monks, are the five fetters of the mind.",
      "sinhala": "භික්ෂූනි, මේ චිත්තය බඳින බන්ධන පහකි. ඒ කවරවාද?\n\nභික්ෂූනි, මෙහිලා භික්ෂුවක් කාමයන් කෙරෙහි පහව නොගිය රාගයෙන්, පහව නොගිය ඡන්දයෙන්, පහව නොගිය ප්‍රේමයෙන්, පහව නොගිය පිපාසයෙන්, පහව නොගිය දැවිල්ලෙන්, පහව නොගිය තෘෂ්ණාවෙන් යුක්ත වේ. භික්ෂූනි, යම් ඒ භික්ෂුවක් කාමයන් කෙරෙහි පහව නොගිය රාගයෙන්, පහව නොගිය ඡන්දයෙන්, පහව නොගිය ප්‍රේමයෙන්, පහව නොගිය පිපාසයෙන්, පහව නොගිය දැවිල්ලෙන්, පහව නොගිය තෘෂ්ණාවෙන් යුක්ත වේද, ඔහුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේ. යම් කෙනෙකුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේද, මේ පළමු චිත්තය බඳින බන්ධනයයි.\n\nනැවතත්, භික්ෂූනි, භික්ෂුවක් ශරීරය කෙරෙහි පහව නොගිය රාගයෙන්, පහව නොගිය ඡන්දයෙන්, පහව නොගිය ප්‍රේමයෙන්, පහව නොගිය පිපාසයෙන්, පහව නොගිය දැවිල්ලෙන්, පහව නොගිය තෘෂ්ණාවෙන් යුක්ත වේ. භික්ෂූනි, යම් ඒ භික්ෂුවක් ශරීරය කෙරෙහි පහව නොගිය රාගයෙන්, පහව නොගිය ඡන්දයෙන්, පහව නොගිය ප්‍රේමයෙන්, පහව නොගිය පිපාසයෙන්, පහව නොගිය දැවිල්ලෙන්, පහව නොගිය තෘෂ්ණාවෙන් යුක්ත වේද, ඔහුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේ. යම් කෙනෙකුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේද, මේ දෙවන චිත්තය බඳින බන්ධනයයි.\n\nනැවතත්, භික්ෂූනි, භික්ෂුවක් රූප කෙරෙහි පහව නොගිය රාගයෙන්, පහව නොගිය ඡන්දයෙන්, පහව නොගිය ප්‍රේමයෙන්, පහව නොගිය පිපාසයෙන්, පහව නොගිය දැවිල්ලෙන්, පහව නොගිය තෘෂ්ණාවෙන් යුක්ත වේ. භික්ෂූනි, යම් ඒ භික්ෂුවක් රූප කෙරෙහි පහව නොගිය රාගයෙන්, පහව නොගිය ඡන්දයෙන්, පහව නොගිය ප්‍රේමයෙන්, පහව නොගිය පිපාසයෙන්, පහව නොගිය දැවිල්ලෙන්, පහව නොගිය තෘෂ්ණාවෙන් යුක්ත වේද, ඔහුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේ. යම් කෙනෙකුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේද, මේ තුන්වන චිත්තය බඳින බන්ධනයයි.\n\nනැවතත්, භික්ෂූනි, භික්ෂුවක් බඩ පුරා සෑහෙන සේ අනුභව කොට ශයනයෙහි සුවය, ඇලවෙහි සුවය, මුළා කරන නින්දේ සුවය (යන මේවාට) යෙදී වාසය කරයි. භික්ෂූනි, යම් ඒ භික්ෂුවක් බඩ පුරා සෑහෙන සේ අනුභව කොට ශයනයෙහි සුවය, ඇලවෙහි සුවය, මුළා කරන නින්දේ සුවය (යන මේවාට) යෙදී වාසය කරයිද, ඔහුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේ. යම් කෙනෙකුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේද, මේ සිව්වන චිත්තය බඳින බන්ධනයයි.\n\nනැවතත්, භික්ෂූනි, භික්ෂුවක් යම්කිසි දෙව්ලොවක ඉපදීම ප්‍රාර්ථනා කොට 'මේ ශීලයෙන් හෝ වතෙන් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ මම දෙවියෙක් වන්නෙමි, නැතහොත් දෙවියන් අතරින් කෙනෙක් වන්නෙමි'යි බ්‍රහ්මචර්යාව පුරයි. භික්ෂූනි, යම් ඒ භික්ෂුවක් යම්කිසි දෙව්ලොවක ඉපදීම ප්‍රාර්ථනා කොට 'මේ ශීලයෙන් හෝ වතෙන් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ මම දෙවියෙක් වන්නෙමි, නැතහොත් දෙවියන් අතරින් කෙනෙක් වන්නෙමි'යි බ්‍රහ්මචර්යාව පුරයිද, ඔහුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේ. යම් කෙනෙකුගේ සිත (සසර දුක් තවන) තීව්‍ර උත්සාහයට, (ධර්මයේ) නිරන්තරව යෙදීමට, නිරන්තර පැවැත්මට, (සම්‍යක්) වීර්යයට නැඹුරු නොවේද, මේ පස්වන චිත්තය බඳින බන්ධනයයි.\n\nභික්ෂූනි, මේවාමයි චිත්තය බඳින ඒ බන්ධන පහ.",
      "paliTitle": "Vinibandhasuttaṃ",
      "englishTitle": "The Discourse on Mental Shackles",
      "sinhalaTitle": "විනිබන්ධ සූත්‍රය"
    },
    {
      "number": 207,
      "pali": "‘‘Pañcime, bhikkhave, ānisaṃsā yāguyā. Katame pañca? Khuddaṃ [khudaṃ (sī. pī.) khudhāti sakkatānulomaṃ. mahāva. 282] paṭihanati, pipāsaṃ paṭivineti, vātaṃ anulometi, vatthiṃ sodheti, āmāvasesaṃ pāceti. Ime kho, bhikkhave, pañca ānisaṃsā yāguyā’’ti. Sattamaṃ.",
      "english": "Monks, there are these five advantages of rice gruel. Which five? It allays hunger, it quenches thirst, it regulates bodily winds, it cleanses the bladder, and it digests undigested food. These, monks, are the five advantages of rice gruel.",
      "sinhala": "මහණෙනි, කැඳෙහි මේ ආනිසංස පසක් ඇත. ඒ පස කුමක්ද?\n\nක්ෂුධාව සංසිඳුවයි, පිපාසය දුරුකරයි, වාතය සමනය කරයි, වස්තිය ශෝධනය කරයි, ආමාවශේෂ පරිපාකයට පත්කරයි. මහණෙනි, කැඳෙහි ඇති ආනිසංස මේ පසයි.",
      "paliTitle": "Yāgusuttaṃ",
      "englishTitle": "The Discourse on Rice Gruel",
      "sinhalaTitle": "යාගු සූත්‍රය"
    },
    {
      "number": 208,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā dantakaṭṭhassa akhādane. Katame pañca? Acakkhussaṃ, mukhaṃ duggandhaṃ hoti, rasaharaṇiyo na visujjhanti, pittaṃ semhaṃ bhattaṃ pariyonandhati [pariyonaddhanti (sī. pī.), pariyonaddhati (syā. kaṃ. ka.) cūḷava. 282 passitabbaṃ], bhattamassa nacchādeti. Ime kho, bhikkhave, pañca ādīnavā dantakaṭṭhassa akhādane. ‘‘Pañcime, bhikkhave, ānisaṃsā dantakaṭṭhassa khādane. Katame pañca? Cakkhussaṃ, mukhaṃ na duggandhaṃ hoti, rasaharaṇiyo visujjhanti, pittaṃ semhaṃ bhattaṃ na pariyonandhati, bhattamassa chādeti. Ime kho, bhikkhave, pañca ānisaṃsā dantakaṭṭhassa khādane’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five disadvantages in not using a tooth-stick. What are these five? It is detrimental to the eyes, the mouth becomes foul-smelling, the taste-carrying channels do not become clear, bile and phlegm obstruct the food, and one does not relish one's food. These, monks, are the five disadvantages in not using a tooth-stick.\n\nMonks, there are these five advantages in using a tooth-stick. What are these five? It is conducive to good eyesight, the mouth does not become foul-smelling, the taste-carrying channels become clear, bile and phlegm do not obstruct the food, and one relishes one's food. These, monks, are the five advantages in using a tooth-stick.",
      "sinhala": "භික්ෂූනි, දන්තකාෂ්ඨ නොකෑමෙහි මේ ආදීනව පහක් ඇත. ඒ කවර පහක් ද යත්: ඇසට අහිතකර වෙයි, මුඛය දුර්ගන්ධයෙන් යුක්ත වෙයි, රසනාඩියෝ පිරිසිදු නොවෙති, පිත් සෙම් ආහාරය වැසී පවතී, ආහාරය හොඳින් නොපැහැදෙයි. භික්ෂූනි, දන්තකාෂ්ඨ නොකෑමෙහි මේ ආදීනව පහක් ඇත.\n\nභික්ෂූනි, දන්තකාෂ්ඨ කෑමෙහි මේ ආනිසංස පහක් ඇත. ඒ කවර පහක් ද යත්: ඇසට හිතකර වෙයි, මුඛය දුර්ගන්ධයෙන් යුක්ත නොවෙයි, රසනාඩියෝ පිරිසිදු වෙති, පිත් සෙම් ආහාරය නොවැසී පවතී, ආහාරය හොඳින් පැහැදෙයි. භික්ෂූනි, දන්තකාෂ්ඨ කෑමෙහි මේ ආනිසංස පහක් ඇත.",
      "paliTitle": "Dantakaṭṭhasuttaṃ",
      "englishTitle": "The Tooth-stick Sutta",
      "sinhalaTitle": "දන්තකට්ඨ සූත්‍රය"
    },
    {
      "number": 209,
      "pali": "[cūḷava. 249] ‘‘Pañcime, bhikkhave, ādīnavā āyatakena gītassarena dhammaṃ bhaṇantassa. Katame pañca? Attanāpi tasmiṃ sare sārajjati, parepi tasmiṃ sare sārajjanti, gahapatikāpi ujjhāyanti – ‘yatheva mayaṃ gāyāma, evamevaṃ kho samaṇā sakyaputtiyā gāyantī’ti, sarakuttimpi nikāmayamānassa samādhissa bhaṅgo hoti, pacchimā janatā diṭṭhānugatiṃ āpajjati. Ime kho, bhikkhave, pañca ādīnavā āyatakena gītassarena dhammaṃ bhaṇantassā’’ti. Navamaṃ.",
      "english": "Monks, there are these five drawbacks for one who recites the Dhamma with a long, drawn-out, melodious voice. Which five? One oneself becomes attached to that voice; others also become attached to that voice; householders also complain, saying, 'Just as we sing, so too do these Sakyan ascetics sing!'; for one who desires vocal excellence, there is a disruption of concentration; and later generations will follow this example. These, monks, are the five drawbacks for one who recites the Dhamma with a long, drawn-out, melodious voice.",
      "sinhala": "භික්ෂූනි, දීර්ඝ වූ ගීත ස්වරයකින් ධර්මය දේශනා කරන්නාට මේ ආදීනවයෝ පස්දෙනෙක් වෙති. ඒ කවර පස්දෙනෙක් ද යත්:\n\nතමා ද ඒ ස්වරයට ඇලෙයි, අනුන් ද ඒ ස්වරයට ඇලෙත්, ගෘහපතියෝ ද ‘යම් සේ අපි ගයමු ද, එලෙසින්ම මේ ශාක්‍යපුත්‍ර ශ්‍රමණයෝ ද ගයති’ යි දොස් පවරති, ස්වර කුශලතාවය ප්‍රාර්ථනා කරන්නාට සමාධිය බිඳී යයි, පශ්චිම ජනතාව ද ඒ දෘෂ්ටිය අනුගමනය කරන්නට පෙළඹෙත්.\n\nභික්ෂූනි, දීර්ඝ වූ ගීත ස්වරයකින් ධර්මය දේශනා කරන්නාට මේ ආදීනවයෝ පස්දෙනා වෙති.",
      "paliTitle": "Gītassarasuttaṃ",
      "englishTitle": "The Sound of Singing Sutta",
      "sinhalaTitle": "ගීතස්සර සූත්‍රය"
    },
    {
      "number": 210,
      "pali": "[mahāva. 353] ‘‘Pañcime, bhikkhave, ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamayato. Katame pañca? Dukkhaṃ supati, dukkhaṃ paṭibujjhati, pāpakaṃ supinaṃ passati, devatā na rakkhanti, asuci muccati. Ime kho, bhikkhave, pañca ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamayato. ‘‘Pañcime, bhikkhave, ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamayato. Katame pañca? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, devatā rakkhanti, asuci na muccati. Ime kho, bhikkhave, pañca ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamayato’’ti. Dasamaṃ. ",
      "english": "Monks, there are these five disadvantages for one who is unmindful and lacks clear comprehension when going to sleep. Which five? One sleeps uneasily, one wakes up uneasily, one sees bad dreams, deities do not protect one, and one discharges impurities. These, Monks, are the five disadvantages for one who is unmindful and lacks clear comprehension when going to sleep.\n\nMonks, there are these five advantages for one whose mindfulness is established and who has clear comprehension when going to sleep. Which five? One sleeps peacefully, one wakes up peacefully, one does not see bad dreams, deities protect one, and one does not discharge impurities. These, Monks, are the five advantages for one whose mindfulness is established and who has clear comprehension when going to sleep.",
      "sinhala": "භික්‍ෂූනි, සිහිය නැති, සම්පජඤ්ඤයෙන් තොර වූ පුද්ගලයා නින්දට පැමිණෙන කල්හි මේ පස්වැදෑරුම් ආදීනවයෝ වෙති. කවරේ ද ඒ පස? දුකින් නිදියයි, දුකින් පිබිදෙයි, නපුරු සිහිනයක් දකී, දෙවියෝ ආරක්‍ෂා නොකරති, අසූචි පිටවේ. භික්‍ෂූනි, සිහිය නැති, සම්පජඤ්ඤයෙන් තොර වූ පුද්ගලයා නින්දට පැමිණෙන කල්හි මේ පස්වැදෑරුම් ආදීනවයෝ වෙති.\n\nභික්‍ෂූනි, සිහිය පිහිටුවාගත්, සම්පජඤ්ඤයෙන් යුක්ත වූ පුද්ගලයා නින්දට පැමිණෙන කල්හි මේ පස්වැදෑරුම් ආනිසංසයෝ වෙති. කවරේ ද ඒ පස? සැපසේ නිදියයි, සැපසේ පිබිදෙයි, නපුරු සිහිනයක් නොදකී, දෙවියෝ ආරක්‍ෂා කරති, අසූචි පිට නොවේ. භික්‍ෂූනි, සිහිය පිහිටුවාගත්, සම්පජඤ්ඤයෙන් යුක්ත වූ පුද්ගලයා නින්දට පැමිණෙන කල්හි මේ පස්වැදෑරුම් ආනිසංසයෝ වෙති.",
      "paliTitle": "Muṭṭhassatisuttaṃ",
      "englishTitle": "The Discourse on Muddled Mindfulness",
      "sinhalaTitle": "මුට්ඨස්සති සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Kimilavaggo paṭhamo. Tassuddānaṃ – Kimilo dhammassavanaṃ, ājānīyo balaṃ khilaṃ; Vinibandhaṃ yāgu kaṭṭhaṃ, gītaṃ muṭṭhassatinā cāti.",
    "english": "The Chapter at Kimilā is the first. The summary of it: Kimila, Hearing the Dhamma, The Thoroughbred, Power, Barrenness; Bondage, Congee, Firewood, Song, and with Unmindfulness.",
    "sinhala": "පළමු කිමිල වර්ගයයි. එහි උද්දානය නම්: කිමිල, ධම්මස්සවන, ආජානීය, බල, ඛිල, විනිබන්ධ, යාගු, කට්ඨ, ගීත සහ මුට්ඨස්සති සූත්‍රයි."
  }
}