{
  "id": "an5.9",
  "title": {
    "pali": "Theravaggo",
    "english": "The Chapter of the Elders",
    "sinhala": "තෙර වග්ගය"
  },
  "sections": [
    {
      "number": 81,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi pañcahi? Rajanīye rajjati, dussanīye [dusanīye (sī. syā. kaṃ. pī.)] dussati, mohanīye muyhati, kuppanīye [kupanīye (sī. syā. kaṃ.), kopanīye (pī.)] kuppati, madanīye majjati – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Rajanīye na rajjati, dussanīye na dussati, mohanīye na muyhati, kuppanīye na kuppati, madanīye na majjati – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Paṭhamaṃ.",
      "english": "Bhikkhus, an elder monk endowed with five qualities becomes disliked, disagreeable, unrespected, and unesteemed by his fellow practitioners. With which five? He is captivated by that which is captivating, he is averse to that which is arousing aversion, he is deluded by that which is deluding, he is agitated by that which is agitating, he is intoxicated by that which is intoxicating. Bhikkhus, it is with these five qualities that an elder monk becomes disliked, disagreeable, unrespected, and unesteemed by his fellow practitioners.\n\nBhikkhus, an elder monk endowed with five qualities becomes liked, agreeable, respected, and esteemed by his fellow practitioners. With which five? He is not captivated by that which is captivating, he is not averse to that which is arousing aversion, he is not deluded by that which is deluding, he is not agitated by that which is agitating, he is not intoxicated by that which is intoxicating. Bhikkhus, it is with these five qualities that an elder monk becomes liked, agreeable, respected, and esteemed by his fellow practitioners.",
      "sinhala": "භික්‍ෂූණි, යම් ථේර භික්‍ෂුවක් කරුණු පසකින් යුක්ත වේ නම්, ඔහු සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වේ, අමනාප ද වේ, අගරු ද වේ, ආදර්ශයට ගැනීමට හෝ ගෞරවයෙන් සැලකීමට නුසුදුසු ද වේ. ඒ කරුණු පස කවරේද? රාගය උපදවන දෑ කෙරෙහි ලොල් වෙයි, ද්වේශය උපදවන දෑ කෙරෙහි ද්වේශ කරයි, මෝහය උපදවන දෑ කෙරෙහි මුළා වෙයි, කිපවීමට හේතු වන දෑ කෙරෙහි කිපෙයි, මදය/මානය උපදවන දෑ කෙරෙහි මත්වෙයි. භික්‍ෂූණි, යම් ථේර භික්‍ෂුවක් මේ කරුණු පසින් යුක්ත වේ නම්, ඔහු සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වේ, අමනාප ද වේ, අගරු ද වේ, ආදර්ශයට ගැනීමට හෝ ගෞරවයෙන් සැලකීමට නුසුදුසු ද වේ.\n\nභික්‍ෂූණි, යම් ථේර භික්‍ෂුවක් කරුණු පසකින් යුක්ත වේ නම්, ඔහු සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, මනාප ද වේ, ගරු ද වේ, ආදර්ශයට ගැනීමට හෝ ගෞරවයෙන් සැලකීමට සුදුසු ද වේ. ඒ කරුණු පස කවරේද? රාගය උපදවන දෑ කෙරෙහි ලොල් නොවෙයි, ද්වේශය උපදවන දෑ කෙරෙහි ද්වේශ නොකරයි, මෝහය උපදවන දෑ කෙරෙහි මුළා නොවෙයි, කිපවීමට හේතු වන දෑ කෙරෙහි නොකිපෙයි, මදය/මානය උපදවන දෑ කෙරෙහි මත් නොවෙයි. භික්‍ෂූණි, යම් ථේර භික්‍ෂුවක් මේ කරුණු පසින් යුක්ත වේ නම්, ඔහු සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, මනාප ද වේ, ගරු ද වේ, ආදර්ශයට ගැනීමට හෝ ගෞරවයෙන් සැලකීමට සුදුසු ද වේ.",
      "paliTitle": "Rajanīyasuttaṃ",
      "englishTitle": "The Discourse on Things That Incite Lust",
      "sinhalaTitle": "රජනීය සූත්‍රය"
    },
    {
      "number": 82,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi pañcahi? Avītarāgo hoti, avītadoso hoti, avītamoho hoti, makkhī ca, paḷāsī ca – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Vītarāgo hoti, vītadoso hoti, vītamoho hoti, amakkhī ca, apaḷāsī ca – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Dutiyaṃ.",
      "english": "Monks, endowed with five qualities, an elder monk becomes disliked, disagreeable, unrespected, and unesteemed by his fellow practitioners. Which five? He is not free from lust, he is not free from hatred, he is not free from delusion, he is malicious, and he is envious. Indeed, monks, endowed with these five qualities, an elder monk becomes disliked, disagreeable, unrespected, and unesteemed by his fellow practitioners.\n\nMonks, endowed with five qualities, an elder monk becomes beloved, agreeable, respected, and esteemed by his fellow practitioners. Which five? He is free from lust, he is free from hatred, he is free from delusion, he is not malicious, and he is not envious. Indeed, monks, endowed with these five qualities, an elder monk becomes beloved, agreeable, respected, and esteemed by his fellow practitioners.",
      "sinhala": "මහණෙනි, පස් ධර්‍මයකින් සමන්විත වූ තෙරණුවෝ සමවැසි බඹසර දරන්නන්ට අප්‍රිය වෙති, අමනාප වෙති, ගරු නොකළ යුත්තා වෙති, අනුගමනයට නුසුදුස්සා වෙති. ඒ කවර පස් ධර්‍මයකින්ද යත්? රාගය පහ නොකළ කෙනෙක් වීම, ද්වේෂය පහ නොකළ කෙනෙක් වීම, මෝහය පහ නොකළ කෙනෙක් වීම, ගුණමකු බවින් යුක්ත වීම, ඊර්ෂ්‍යාවෙන් යුක්ත වීම ය. මහණෙනි, මේ පස් ධර්‍මයෙන් සමන්විත වූ තෙරණුවෝ සමවැසි බඹසර දරන්නන්ට අප්‍රිය වෙති, අමනාප වෙති, ගරු නොකළ යුත්තා වෙති, අනුගමනයට නුසුදුස්සා වෙති.\n\nමහණෙනි, පස් ධර්‍මයකින් සමන්විත වූ තෙරණුවෝ සමවැසි බඹසර දරන්නන්ට ප්‍රිය වෙති, මනාප වෙති, ගරු කළ යුත්තා වෙති, අනුගමනයට සුදුස්සා වෙති. ඒ කවර පස් ධර්‍මයකින්ද යත්? රාගය පහ කළ කෙනෙක් වීම, ද්වේෂය පහ කළ කෙනෙක් වීම, මෝහය පහ කළ කෙනෙක් වීම, ගුණමකු බවින් තොර වීම, ඊර්ෂ්‍යාවෙන් තොර වීම ය. මහණෙනි, මේ පස් ධර්‍මයෙන් සමන්විත වූ තෙරණුවෝ සමවැසි බඹසර දරන්නන්ට ප්‍රිය වෙති, මනාප වෙති, ගරු කළ යුත්තා වෙති, අනුගමනයට සුදුස්සා වෙති.\n\nදෙවෙනි සූත්‍රයයි.",
      "paliTitle": "Vītarāgasuttaṃ",
      "englishTitle": "The Discourse on Those Free from Lust",
      "sinhalaTitle": "වීතරාග සූත්‍රය"
    },
    {
      "number": 83,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi pañcahi? Kuhako ca hoti, lapako ca, nemittiko [nimittiko (syā. kaṃ.), nimittako (ka.)] ca, nippesiko ca, lābhena ca lābhaṃ nijigīsitā [nijigiṃsitā (sī. syā. kaṃ. pī.)] – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Na ca kuhako hoti, na ca lapako, na ca nemittiko, na ca nippesiko, na ca lābhena lābhaṃ nijigīsitā – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, an elder bhikkhu endowed with five qualities becomes disagreeable, unpleasant, not revered, and unworthy of esteem to his fellow practitioners. Which five? He is hypocritical, garrulous, practices divination for gain, is a flatterer, and seeks further gain by means of gain. Indeed, bhikkhus, an elder bhikkhu endowed with these five qualities becomes disagreeable, unpleasant, not revered, and unworthy of esteem to his fellow practitioners.\n\nBhikkhus, an elder bhikkhu endowed with five qualities becomes agreeable, pleasant, revered, and worthy of esteem to his fellow practitioners. Which five? He is not hypocritical, not garrulous, does not practice divination for gain, is not a flatterer, and does not seek further gain by means of gain. Indeed, bhikkhus, an elder bhikkhu endowed with these five qualities becomes agreeable, pleasant, revered, and worthy of esteem to his fellow practitioners.",
      "sinhala": "මහණෙනි, ධර්ම කරුණු පහකින් යුක්ත වූ ස්ථවිර භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වේ, අමනාප ද වේ, අගෞරව ද වේ, ගෞරව කළ යුතු නොවනසුලු ද වේ. කවර පහකින් ද? හෙතෙම කූහක ද වේ, ලාභ සඳහා නිෂ්ඵල කතා කරනසුලු ද වේ, නිමිති දක්වා ලාභ සොයනසුලු ද වේ, අනුන්ගෙන් ලාභ ලබාගැනීම පිණිස පොලඹවනසුලු ද වේ, ලැබූ ලාභයෙන් තව ලාභ සොයනසුලු ද වේ. මහණෙනි, මේ ධර්ම කරුණු පහකින් යුක්ත වූ ස්ථවිර භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වේ, අමනාප ද වේ, අගෞරව ද වේ, ගෞරව කළ යුතු නොවනසුලු ද වේ.\n\nමහණෙනි, ධර්ම කරුණු පහකින් යුක්ත වූ ස්ථවිර භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, මනාප ද වේ, ගෞරව ද වේ, ගෞරව කළ යුතු සුලු ද වේ. කවර පහකින් ද? හෙතෙම කූහක නො වේ, ලාභ සඳහා නිෂ්ඵල කතා නො කරනසුලු ද වේ, නිමිති දක්වා ලාභ නො සොයනසුලු ද වේ, අනුන්ගෙන් ලාභ ලබාගැනීම පිණිස නො පොලඹවනසුලු ද වේ, ලැබූ ලාභයෙන් තව ලාභ නො සොයනසුලු ද වේ. මහණෙනි, මේ ධර්ම කරුණු පහකින් යුක්ත වූ ස්ථවිර භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වේ, මනාප ද වේ, ගෞරව ද වේ, ගෞරව කළ යුතු සුලු ද වේ.",
      "paliTitle": "Kuhakasuttaṃ",
      "englishTitle": "The Deceiver Sutta",
      "sinhalaTitle": "කුහක සූත්‍රය"
    },
    {
      "number": 84,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti, amanāpo ca agaru ca abhāvanīyo ca. Katamehi pañcahi? Assaddho hoti, ahiriko hoti, anottappī hoti, kusīto hoti, duppañño hoti – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Saddho hoti, hirīmā hoti, ottappī hoti, āraddhavīriyo hoti, paññavā hoti – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Catutthaṃ.",
      "english": "Monks, a senior bhikkhu endowed with five qualities becomes disliked by his fellow monastics, displeasing, unrespected, and unworthy of being cultivated. Which five? He is faithless, shameless, unconscientious, lazy, and foolish – indeed, monks, a senior bhikkhu endowed with these five qualities becomes disliked by his fellow monastics, displeasing, unrespected, and unworthy of being cultivated.\n\nMonks, a senior bhikkhu endowed with five qualities becomes dear to his fellow monastics, pleasing, respected, and worthy of being cultivated. Which five? He is endowed with faith, has a sense of moral shame, has a sense of moral dread, is energetic, and is wise – indeed, monks, a senior bhikkhu endowed with these five qualities becomes dear to his fellow monastics, pleasing, respected, and worthy of being cultivated.",
      "sinhala": "මහණෙනි, කරුණු පසකින් යුක්ත වූ ථේර භික්ෂුවක් සබ්ZWJරහ්මචාරීන්ට අප්ZWJරිය ද වේ, අමනාප ද වේ, අගරු ද වේ, අගය කළ නොහැකි ද වේ. කවර කරුණු පසකින් ද? ඔහු අශ්‍රද්ධාවන්ත වේ, අහිරික වේ, අනොත්තප්පී වේ, කුසීත වේ, දුෂ්ප්ZWJරඥා ඇත්තෙක් වේ. මහණෙනි, සැබවින් ම මේ කරුණු පසින් යුක්ත වූ ථේර භික්ෂුව සබ්ZWJරහ්මචාරීන්ට අප්ZWJරිය ද වේ, අමනාප ද වේ, අගරු ද වේ, අගය කළ නොහැකි ද වේ.\n\nමහණෙනි, කරුණු පසකින් යුක්ත වූ ථේර භික්ෂුවක් සබ්ZWJරහ්මචාරීන්ට ප්ZWJරිය ද වේ, මනාප ද වේ, ගරු ද වේ, අගය කළ හැකි ද වේ. කවර කරුණු පසකින් ද? ඔහු ශ්ZWJරද්ධාවන්ත වේ, හිරිමත් වේ, ඔතප්පත් වේ, ආරම්භක වීර්යය ඇත්තෙක් වේ, ප්ZWJරඥාවන්ත වේ. මහණෙනි, සැබවින් ම මේ කරුණු පසින් යුක්ත වූ ථේර භික්ෂුව සබ්ZWJරහ්මචාරීන්ට ප්ZWJරිය ද වේ, මනාප ද වේ, ගරු ද වේ, අගය කළ හැකි ද වේ.",
      "paliTitle": "Assaddhasuttaṃ",
      "englishTitle": "The Faithless Sutta",
      "sinhalaTitle": "අස්සද්ධ සූත්‍රය"
    },
    {
      "number": 85,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi pañcahi? Akkhamo hoti rūpānaṃ, akkhamo saddānaṃ, akkhamo gandhānaṃ, akkhamo rasānaṃ, akkhamo phoṭṭhabbānaṃ – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Khamo hoti rūpānaṃ, khamo saddānaṃ, khamo gandhānaṃ, khamo rasānaṃ, khamo phoṭṭhabbānaṃ – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Pañcamaṃ.",
      "english": "Monks, endowed with five qualities, an elder monk is disagreeable, unwelcome, unrespected, and not worthy of reverence to his fellow monastics. Which five? He is intolerant of forms, intolerant of sounds, intolerant of odors, intolerant of tastes, intolerant of tactile sensations. Indeed, monks, endowed with these five qualities, an elder monk is disagreeable, unwelcome, unrespected, and not worthy of reverence to his fellow monastics.\n\nMonks, endowed with five qualities, an elder monk is agreeable, welcome, respected, and worthy of reverence to his fellow monastics. Which five? He is tolerant of forms, tolerant of sounds, tolerant of odors, tolerant of tastes, tolerant of tactile sensations. Indeed, monks, endowed with these five qualities, an elder monk is agreeable, welcome, respected, and worthy of reverence to his fellow monastics.",
      "sinhala": "භික්ෂූනි, පංච ධ​ර්ම​යන්ගෙන් යුක්ත වූ ථේර භික්ෂුවක් සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වෙයි, අමනාප ද වෙයි, ගරු කටයුතු නොවේ ද, අනුගමනය කිරීමට නුසුදුසු ද වෙයි. ඒ කවර පංච ධ​ර්ම​යන්ගෙන්ද? රූපයන්ට නොඉවසන සුළු වෙයි, ශබ්දයන්ට නොඉවසන සුළු වෙයි, ගන්ධයන්ට නොඉවසන සුළු වෙයි, රසයන්ට නොඉවසන සුළු වෙයි, ස්පර්ශයන්ට නොඉවසන සුළු වෙයි – භික්ෂූනි, මේ පංච ධ​ර්ම​යන්ගෙන් යුක්ත වූ ථේර භික්ෂුව සබ්‍රහ්මචාරීන්ට අප්‍රිය ද වෙයි, අමනාප ද වෙයි, ගරු කටයුතු නොවේ ද, අනුගමනය කිරීමට නුසුදුසු ද වෙයි.\n\nභික්ෂූනි, පංච ධ​ර්ම​යන්ගෙන් යුක්ත වූ ථේර භික්ෂුවක් සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, අනුගමනය කිරීමට සුදුසු ද වෙයි. ඒ කවර පංච ධ​ර්ම​යන්ගෙන්ද? රූපයන්ට ඉවසන සුළු වෙයි, ශබ්දයන්ට ඉවසන සුළු වෙයි, ගන්ධයන්ට ඉවසන සුළු වෙයි, රසයන්ට ඉවසන සුළු වෙයි, ස්පර්ශයන්ට ඉවසන සුළු වෙයි – භික්ෂූනි, මේ පංච ධ​ර්ම​යන්ගෙන් යුක්ත වූ ථේර භික්ෂුව සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, අනුගමනය කිරීමට සුදුසු ද වෙයි.",
      "paliTitle": "Akkhamasuttaṃ",
      "englishTitle": "Lack of Endurance Sutta",
      "sinhalaTitle": "අක්ඛම සූත්‍රය"
    },
    {
      "number": 86,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Atthapaṭisambhidāpatto hoti, dhammapaṭisambhidāpatto hoti, niruttipaṭisambhidāpatto hoti, paṭibhānapaṭisambhidāpatto hoti, yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni tattha dakkho hoti analaso tatrupāyāya vīmaṃsāya samannāgato alaṃ kātuṃ alaṃ saṃvidhātuṃ – imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, an elder monk endowed with five qualities is dear to his fellow practitioners, pleasing, respected, and worthy of emulation. Which five? He has attained analytical knowledge of the meaning, analytical knowledge of the Dhamma, analytical knowledge of linguistic expression, and analytical knowledge of spontaneous elucidation. Furthermore, regarding the various tasks and duties of his fellow practitioners, he is skilled and diligent, endowed with the appropriate discerning wisdom, capable of performing and organizing them. Indeed, monks, an elder monk endowed with these five qualities is dear to his fellow practitioners, pleasing, respected, and worthy of emulation.",
      "sinhala": "මහණෙනි, ධර්මයන් පහකින් යුක්ත වූ ථේර භික්ෂුව සබ්‍රහ්මචාරීන් හට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, භාවනා කටයුතු ද වෙයි.\n\nකවර නම් පහකින් ද?\n\nඅර්ථ ප්‍රතිසම්භිදාවට පැමිණියේ වෙයි, ධර්ම ප්‍රතිසම්භිදාවට පැමිණියේ වෙයි, නිරුක්ති ප්‍රතිසම්භිදාවට පැමිණියේ වෙයි, ප්‍රතිභාන ප්‍රතිසම්භිදාවට පැමිණියේ වෙයි, යම් ඒ සබ්‍රහ්මචාරීන්ගේ ඉහළ පහළ කටයුතු ඇත්තාහු ද, එහි දක්ෂ වෙයි, අලස නොවූවෙක් වෙයි, ඒ සඳහා උපාය මාර්ග විමසීමෙන් යුක්ත වෙයි, ඒවා කිරීමට සමත් වෙයි, ඒවා සංවිධානය කිරීමට ද සමත් වෙයි.\n\nමහණෙනි, මෙවන් ධර්මයන් පහකින් යුක්ත වූ ථේර භික්ෂුව සබ්‍රහ්මචාරීන් හට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, භාවනා කටයුතු ද වෙයි.",
      "paliTitle": "Paṭisambhidāpattasuttaṃ",
      "englishTitle": "The Discourse on Reaching Discrimination",
      "sinhalaTitle": "පටිසම්භිදාපත්ත සූත්‍රය"
    },
    {
      "number": 87,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati. Ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [sātthā sabyañjanā (sī.)] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā [dhatā (sī. syā. kaṃ. pī.)] vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Sattamaṃ.",
      "english": "Monks, an elder monk endowed with five qualities is dear to his fellow practitioners of the holy life, pleasing to them, respected by them, and worthy of veneration. Which five? Herein, he is virtuous; he dwells restrained by the restraint of the Pātimokkha, complete in conduct and resort, seeing danger even in the slightest faults, and undertaking the training rules, he trains in them. He is learned, a retainer of what he has heard, an accumulator of what he has heard; those teachings that are beautiful in the beginning, beautiful in the middle, beautiful in the end, that proclaim the holy life complete and pure in its meaning and its letter – such teachings he has heard extensively, retained, recited verbally, contemplated mentally, and well penetrated by understanding. He is of good speech and good elocution, endowed with refined speech that is clear, free from stammering, and capable of conveying the meaning. He is a readily obtainer, without difficulty or trouble, of the four jhāna concentrations, which pertain to the higher mind and are a pleasant dwelling in this very life. Through the destruction of the taints, he dwells having realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom. Monks, an elder monk endowed with these five qualities is indeed dear to his fellow practitioners of the holy life, pleasing to them, respected by them, and worthy of veneration.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ ස්ථවිර භික්ෂුව සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, භාවනීය ද වෙයි. කවර කරුණු පහකින් ද?\n\nසීලවන්ත වෙයි, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාර ගෝචර සම්පන්න වෙයි, අල්පමාත්‍ර වරදෙහි ද භය දකින සුලු වෙයි, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. බහුශ්‍රැත වෙයි, ඇසූ දේ ධාරණය කරගත්තෙක් ද, ඇසූ දේ ගබඩා කරගත්තෙක් ද වෙයි. යම් ඒ ධර්මයන් මුල ද කල්‍යාණ ද, මැද ද කල්‍යාණ ද, අවසානය ද කල්‍යාණ ද, අර්ථ සහිත ද, ව්‍යඤ්ජන සහිත ද, ඒකාන්තයෙන් පරිපූර්ණ ද, පිරිසිදු ද වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරත් ද, එබඳු ධර්මයන් ඔහුට බහුශ්‍රැත වෙයි, මනා ලෙස ධාරණය කරගත්, වචනයෙන් මනා ලෙස පුහුණු කළ, සිතින් මනා ලෙස මෙනෙහි කළ, දෘෂ්ටියෙන් (නුවණින්) මනා ලෙස අවබෝධ කළ ඒවා වෙයි. කල්‍යාණ වූ වචන ඇත්තෙක් ද, කල්‍යාණ වූ කතාවක් ඇත්තෙක් ද වෙයි. පැහැදිලි වූ, නොගැටුණු, අර්ථය පහදා දීමට සමත් වූ ප්‍රෞඪ වචනයෙන් යුක්ත වෙයි. අධිචෛතසික වූ, මේ භවයේ දීම සැප විහරණය පිණිස වූ සිව් ධ්‍යානයන්ට කැමති පරිදි ලැබීමට සමත් වෙයි, අපහසුවකින් තොරව ලැබීමට සමත් වෙයි, වෙහෙසකින් තොරව ලැබීමට සමත් වෙයි. ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දිට්ඨධර්මයෙහිම තමා විසින්ම අභිඥා ලැබ, සාක්ෂාත් කොට, උපසම්පදා වී වාසය කරයි.\n\nමහණෙනි, මේ කරුණු පහකින් යුක්ත වූ ස්ථවිර භික්ෂුව සබ්‍රහ්මචාරීන්ට ප්‍රිය ද වෙයි, මනාප ද වෙයි, ගරු කටයුතු ද වෙයි, භාවනීය ද වෙයි.",
      "paliTitle": "Sīlavantasuttaṃ",
      "englishTitle": "Virtuous Sutta",
      "sinhalaTitle": "සීලවන්ත සූත්‍රය"
    },
    {
      "number": 88,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu bahujanaahitāya paṭipanno hoti bahujanaasukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. ‘‘Katamehi pañcahi? Thero hoti rattaññū cirapabbajito; ñāto hoti yasassī sagahaṭṭhapabbajitānaṃ [gahaṭṭhapabbajitānaṃ (sī.)] bahujanaparivāro; lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā appaṭividdhā; micchādiṭṭhiko hoti viparītadassano, so bahujanaṃ saddhammā vuṭṭhāpetvā asaddhamme patiṭṭhāpeti. Thero bhikkhu rattaññū cirapabbajito itipissa diṭṭhānugatiṃ āpajjanti, ñāto thero bhikkhu yasassī sagahaṭṭhapabbajitānaṃ bahujanaparivāro itipissa diṭṭhānugatiṃ āpajjanti, lābhī thero bhikkhu cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ itipissa diṭṭhānugatiṃ āpajjanti, bahussuto thero bhikkhu sutadharo sutasannicayo itipissa diṭṭhānugatiṃ āpajjanti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu bahujanaahitāya paṭipanno hoti bahujanaasukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato thero bhikkhu bahujanahitāya paṭipanno hoti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. ‘‘Katamehi pañcahi? Thero hoti rattaññū cirapabbajito; ñāto hoti yasassī sagahaṭṭhapabbajitānaṃ bahujanaparivāro; lābhī hoti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; sammādiṭṭhiko hoti aviparītadassano, so bahujanaṃ asaddhammā vuṭṭhāpetvā saddhamme patiṭṭhāpeti. Thero bhikkhu rattaññū cirapabbajito itipissa diṭṭhānugatiṃ āpajjanti, ñāto thero bhikkhu yasassī sagahaṭṭhapabbajitānaṃ bahujanaparivāro itipissa diṭṭhānugatiṃ āpajjanti, lābhī thero bhikkhu cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ itipissa diṭṭhānugatiṃ āpajjanti, bahussuto thero bhikkhu sutadharo sutasannicayo itipissa diṭṭhānugatiṃ āpajjanti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato thero bhikkhu bahujanahitāya paṭipanno hoti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussāna’’nti. Aṭṭhamaṃ.",
      "english": "Monks, an elder monk endowed with five qualities practices for the harm of many people, for the unhappiness of many people, for the misfortune, harm, and suffering of many people, both devas and humans. What are these five? He is an elder, experienced and long ordained. He is well-known, reputable among householders and monastics, and surrounded by many people. He is a recipient of robes, alms-food, lodgings, and medicinal requisites for the sick. He is learned, a preserver and accumulator of what he has heard—those teachings that are beautiful in the beginning, beautiful in the middle, and beautiful in the end, proclaiming the spiritual life in its entirety, perfectly complete and pure, both in meaning and in letter. Such teachings are extensively heard by him, held, familiarized by speech, contemplated by mind, but not thoroughly penetrated by right understanding. He has wrong view, with distorted vision. He, having dislodged many people from the True Dhamma, establishes them in the false Dhamma. Because that elder monk is experienced and long ordained, people follow his example. Because that elder monk is well-known, reputable among householders and monastics, and surrounded by many people, people follow his example. Because that elder monk is a recipient of robes, alms-food, lodgings, and medicinal requisites for the sick, people follow his example. Because that elder monk is learned, a preserver and accumulator of what he has heard, people follow his example. Indeed, monks, an elder monk endowed with these five qualities practices for the harm of many people, for the unhappiness of many people, for the misfortune, harm, and suffering of many people, both devas and humans.\n\nMonks, an elder monk endowed with five qualities practices for the welfare of many people, for the happiness of many people, for the benefit, welfare, and happiness of many people, both devas and humans. What are these five? He is an elder, experienced and long ordained. He is well-known, reputable among householders and monastics, and surrounded by many people. He is a recipient of robes, alms-food, lodgings, and medicinal requisites for the sick. He is learned, a preserver and accumulator of what he has heard—those teachings that are beautiful in the beginning, beautiful in the middle, and beautiful in the end, proclaiming the spiritual life in its entirety, perfectly complete and pure, both in meaning and in letter. Such teachings are extensively heard by him, held, familiarized by speech, contemplated by mind, and thoroughly penetrated by right understanding. He has right view, with undistorted vision. He, having dislodged many people from the false Dhamma, establishes them in the True Dhamma. Because that elder monk is experienced and long ordained, people follow his example. Because that elder monk is well-known, reputable among householders and monastics, and surrounded by many people, people follow his example. Because that elder monk is a recipient of robes, alms-food, lodgings, and medicinal requisites for the sick, people follow his example. Because that elder monk is learned, a preserver and accumulator of what he has heard, people follow his example. Indeed, monks, an elder monk endowed with these five qualities practices for the welfare of many people, for the happiness of many people, for the benefit, welfare, and happiness of many people, both devas and humans.",
      "sinhala": "භික්‍ෂූණි, පස් ධර්මයකින් සමන්විත වූ ස්ථවිර භික්‍ෂුවක් බොහෝ දෙනාගේ අහිත පිණිස, බොහෝ දෙනාගේ අසැප පිණිස, බොහෝ ජනයාගේ අනර්ථය පිණිස, අහිත පිණිස, දෙවිමිනිසුන්ගේ දුක පිණිස ප්‍රතිපන්න වෙයි. කවර පස් ධර්මයකින්ද? හේ කාලය දත්, දීර්ඝකාලීන පැවිද්දක් ඇති ස්ථවිර භික්‍ෂුවක් වෙයි. හේ ගිහි පැවිදි දෙපක්‍ෂය අතර ප්‍රසිද්ධ වූ, යසස් ඇති, බොහෝ දෙනා පිරිවරාගෙන වසන භික්‍ෂුවක් වෙයි. හේ සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී භික්‍ෂුවක් වෙයි. හේ බහුශ්‍රැත වෙයි, ඇසූ දේ දරා සිටින්නෙක් වෙයි, ඇසූ දේ රැස් කර තබාගත්තෙක් වෙයි. යම් ධර්මයක් මුල යහපත්ද, මැද යහපත්ද, කෙළවර යහපත්ද, අර්ථ සහිතව, ව්‍යංජන සහිතව, මුළුමනින්ම සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේද, එබඳු ධර්ම ඔහුට බොහෝ සෙයින් අසන ලද්දාහු වෙති, දරා සිටින ලද්දාහු වෙති, වචනයෙන් පුරුදු කරන ලද්දාහු වෙති, සිතින් විමසන ලද්දාහු වෙති, (එහෙත්) දැක්මෙන් (ප්‍රඥාවෙන්) විනිවිද නොදකින ලද්දාහු වෙති. හේ මිථ්‍යාදෘෂ්ටික වෙයි, විපරීත දර්ශනයෙන් යුක්ත වෙයි. හේ බොහෝ දෙනා සද්ධර්මයෙන් මුදවා, අසද්ධර්මයෙහි පිහිටුවයි. හේ දීර්ඝකාලීන පැවිද්දක් ඇති, කාලය දත් ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. හේ ගිහි පැවිදි දෙපක්‍ෂය අතර ප්‍රසිද්ධ වූ, යසස් ඇති, බොහෝ දෙනා පිරිවරාගෙන වසන ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. හේ සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. හේ බහුශ්‍රැත වූ, ඇසූ දේ දරා සිටින්නෙක් වූ, ඇසූ දේ රැස් කර තබාගත්තෙක් වූ ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. භික්‍ෂූණි, මේ පස් ධර්මයකින් සමන්විත වූ ස්ථවිර භික්‍ෂුවක් බොහෝ දෙනාගේ අහිත පිණිස, බොහෝ දෙනාගේ අසැප පිණිස, බොහෝ ජනයාගේ අනර්ථය පිණිස, අහිත පිණිස, දෙවිමිනිසුන්ගේ දුක පිණිස ප්‍රතිපන්න වෙයි.\n\nභික්‍ෂූණි, පස් ධර්මයකින් සමන්විත වූ ස්ථවිර භික්‍ෂුවක් බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, බොහෝ ජනයාගේ අර්ථය පිණිස, හිත පිණිස, දෙවිමිනිසුන්ගේ සැපය පිණිස ප්‍රතිපන්න වෙයි. කවර පස් ධර්මයකින්ද? හේ කාලය දත්, දීර්ඝකාලීන පැවිද්දක් ඇති ස්ථවිර භික්‍ෂුවක් වෙයි. හේ ගිහි පැවිදි දෙපක්‍ෂය අතර ප්‍රසිද්ධ වූ, යසස් ඇති, බොහෝ දෙනා පිරිවරාගෙන වසන භික්‍ෂුවක් වෙයි. හේ සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී භික්‍ෂුවක් වෙයි. හේ බහුශ්‍රැත වෙයි, ඇසූ දේ දරා සිටින්නෙක් වෙයි, ඇසූ දේ රැස් කර තබාගත්තෙක් වෙයි. යම් ධර්මයක් මුල යහපත්ද, මැද යහපත්ද, කෙළවර යහපත්ද, අර්ථ සහිතව, ව්‍යංජන සහිතව, මුළුමනින්ම සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේද, එබඳු ධර්ම ඔහුට බොහෝ සෙයින් අසන ලද්දාහු වෙති, දරා සිටින ලද්දාහු වෙති, වචනයෙන් පුරුදු කරන ලද්දාහු වෙති, සිතින් විමසන ලද්දාහු වෙති, (තවද) දැක්මෙන් (ප්‍රඥාවෙන්) මනාව විනිවිද දකින ලද්දාහු වෙති. හේ සම්මාදිට්ඨික වෙයි, විපරීත නොවන දර්ශනයෙන් යුක්ත වෙයි. හේ බොහෝ දෙනා අසද්ධර්මයෙන් මුදවා, සද්ධර්මයෙහි පිහිටුවයි. හේ දීර්ඝකාලීන පැවිද්දක් ඇති, කාලය දත් ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. හේ ගිහි පැවිදි දෙපක්‍ෂය අතර ප්‍රසිද්ධ වූ, යසස් ඇති, බොහෝ දෙනා පිරිවරාගෙන වසන ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. හේ සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. හේ බහුශ්‍රැත වූ, ඇසූ දේ දරා සිටින්නෙක් වූ, ඇසූ දේ රැස් කර තබාගත්තෙක් වූ ස්ථවිර භික්‍ෂුවක් බැවින්, අන්‍යයෝද ඔහුගේ දෘෂ්ටිය අනුගමනය කරති. භික්‍ෂූණි, මේ පස් ධර්මයකින් සමන්විත වූ ස්ථවිර භික්‍ෂුවක් බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැප පිණිස, බොහෝ ජනයාගේ අර්ථය පිණිස, හිත පිණිස, දෙවිමිනිසුන්ගේ සැපය පිණිස ප්‍රතිපන්න වෙයි.",
      "paliTitle": "Therasuttaṃ",
      "englishTitle": "Discourse on the Elder",
      "sinhalaTitle": "ථේර සූත්‍රය"
    },
    {
      "number": 89,
      "pali": "‘‘Pañcime, bhikkhave, dhammā sekhassa bhikkhuno parihānāya saṃvattanti. Katame pañca? Kammārāmatā, bhassārāmatā, niddārāmatā, saṅgaṇikārāmatā, yathāvimuttaṃ cittaṃ na paccavekkhati – ime kho, bhikkhave, pañca dhammā sekhassa bhikkhuno parihānāya saṃvattanti. ‘‘Pañcime, bhikkhave, dhammā sekhassa bhikkhuno aparihānāya saṃvattanti. Katame pañca? Na kammārāmatā, na bhassārāmatā, na niddārāmatā, na saṅgaṇikārāmatā, yathāvimuttaṃ cittaṃ paccavekkhati – ime kho, bhikkhave, pañca dhammā sekhassa bhikkhuno aparihānāya saṃvattantī’’ti. Navamaṃ.",
      "english": "Bhikkhus, these five qualities lead to the decline of a trainee monk. Which five? Attachment to activities, attachment to idle talk, attachment to sleep, attachment to companionship, and failing to reflect on the mind as it has been liberated. These five qualities, Bhikkhus, lead to the decline of a trainee monk.\n\nBhikkhus, these five qualities lead to the non-decline of a trainee monk. Which five? No attachment to activities, no attachment to idle talk, no attachment to sleep, no attachment to companionship, and reflecting on the mind as it has been liberated. These five qualities, Bhikkhus, lead to the non-decline of a trainee monk.",
      "sinhala": "\"භික්ෂූනි, මේ ධර‍්ම පහක් සෙඛ භික්ෂුවක් පිරිහීම පිණිස පවතී. කවර පසක්ද? කර‍්මාන්තයන්හි ඇල්ම, කථා බහෙහි ඇල්ම, නින්දෙහි ඇල්ම, සමූහයන් හා ඇසුරෙහි ඇල්ම, යථාවිමුක්ත වූ සිත නොවිමසීම යන මේ ධර‍්ම පස භික්ෂූනි, සෙඛ භික්ෂුවක් පිරිහීම පිණිස පවතී.\n\nභික්ෂූනි, මේ ධර‍්ම පහක් සෙඛ භික්ෂුවක් නොපිරිහීම (දියුණුව) පිණිස පවතී. කවර පසක්ද? කර‍්මාන්තයන්හි නොඇල්ම, කථා බහෙහි නොඇල්ම, නින්දෙහි නොඇල්ම, සමූහයන් හා ඇසුරෙහි නොඇල්ම, යථාවිමුක්ත වූ සිත විමසීම යන මේ ධර‍්ම පස භික්ෂූනි, සෙඛ භික්ෂුවක් නොපිරිහීම (දියුණුව) පිණිස පවතී.\"",
      "paliTitle": "Paṭhamasekhasuttaṃ",
      "englishTitle": "The First Discourse on the Trainee",
      "sinhalaTitle": "පළමු සේඛ සූත්‍රය"
    },
    {
      "number": 90,
      "pali": "‘‘Pañcime, bhikkhave, dhammā sekhassa bhikkhuno parihānāya saṃvattanti. Katame pañca? Idha, bhikkhave, sekho bhikkhu bahukicco hoti bahukaraṇīyo viyatto kiṃkaraṇīyesu; riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, paṭhamo dhammo sekhassa bhikkhuno parihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu appamattakena kammena divasaṃ atināmeti; riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, dutiyo dhammo sekhassa bhikkhuno parihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu saṃsaṭṭho viharati gahaṭṭhapabbajitehi ananulomikena gihisaṃsaggena; riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, tatiyo dhammo sekhassa bhikkhuno parihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu akālena gāmaṃ pavisati, atidivā paṭikkamati; riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, catuttho dhammo sekhassa bhikkhuno parihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu yāyaṃ kathā ābhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpiyā kathāya na nikāmalābhī hoti na akicchalābhī na akasiralābhī [kicchalābhī kasiralābhī (sī. syā. kaṃ. pī)]; riñcati paṭisallānaṃ, nānuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, pañcamo dhammo sekhassa bhikkhuno parihānāya saṃvattati. Ime kho, bhikkhave, pañca dhammā sekhassa bhikkhuno parihānāya saṃvattanti. ‘‘Pañcime, bhikkhave, dhammā sekhassa bhikkhuno aparihānāya saṃvattanti. Katame pañca? Idha, bhikkhave, sekho bhikkhu na bahukicco hoti na bahukaraṇīyo viyatto kiṃkaraṇīyesu; na riñcati paṭisallānaṃ, anuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, paṭhamo dhammo sekhassa bhikkhuno aparihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu na appamattakena kammena divasaṃ atināmeti; na riñcati paṭisallānaṃ, anuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, dutiyo dhammo sekhassa bhikkhuno aparihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu asaṃsaṭṭho viharati gahaṭṭhapabbajitehi ananulomikena gihisaṃsaggena; na riñcati paṭisallānaṃ, anuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, tatiyo dhammo sekhassa bhikkhuno aparihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu na atikālena gāmaṃ pavisati, nātidivā paṭikkamati; na riñcati paṭisallānaṃ, anuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, catuttho dhammo sekhassa bhikkhuno aparihānāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, sekho bhikkhu yāyaṃ kathā ābhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī hoti akicchalābhī akasiralābhī; na riñcati paṭisallānaṃ, anuyuñjati ajjhattaṃ cetosamathaṃ. Ayaṃ, bhikkhave, pañcamo dhammo sekhassa bhikkhuno aparihānāya saṃvattati. Ime kho, bhikkhave, pañca dhammā sekhassa bhikkhuno aparihānāya saṃvattantī’’ti. Dasamaṃ. ",
      "english": "Bhikkhus, these five qualities lead to a bhikkhu in training's decline. Which five?\n\nHere, bhikkhus, a bhikkhu in training is very busy, has many duties, and is skilled in what needs to be done; he neglects seclusion and does not apply himself to inner mental tranquility. This, bhikkhus, is the first quality that leads to a bhikkhu in training's decline.\n\nAgain, bhikkhus, a bhikkhu in training passes his day with trifling tasks; he neglects seclusion and does not apply himself to inner mental tranquility. This, bhikkhus, is the second quality that leads to a bhikkhu in training's decline.\n\nAgain, bhikkhus, a bhikkhu in training lives in close association with householders and other renunciants, having inappropriate association with householders; he neglects seclusion and does not apply himself to inner mental tranquility. This, bhikkhus, is the third quality that leads to a bhikkhu in training's decline.\n\nAgain, bhikkhus, a bhikkhu in training enters a village at an inappropriate time, and returns too late in the day; he neglects seclusion and does not apply himself to inner mental tranquility. This, bhikkhus, is the fourth quality that leads to a bhikkhu in training's decline.\n\nAgain, bhikkhus, concerning that discourse which promotes the effacement of defilements and is conducive to the opening of the mind—namely, discourse on wanting little, discourse on contentment, discourse on seclusion, discourse on non-entanglement, discourse on aroused energy, discourse on virtue, discourse on concentration, discourse on wisdom, discourse on liberation, discourse on the knowledge and vision of liberation—concerning such discourse, he does not obtain it at will, nor without difficulty, nor without trouble; he neglects seclusion and does not apply himself to inner mental tranquility. This, bhikkhus, is the fifth quality that leads to a bhikkhu in training's decline.\n\nThese, bhikkhus, are the five qualities that lead to a bhikkhu in training's decline.\n\nBhikkhus, these five qualities lead to a bhikkhu in training's non-decline. Which five?\n\nHere, bhikkhus, a bhikkhu in training is not very busy, has not many duties, and is skillful in what needs to be done; he does not neglect seclusion and applies himself to inner mental tranquility. This, bhikkhus, is the first quality that leads to a bhikkhu in training's non-decline.\n\nAgain, bhikkhus, a bhikkhu in training does not pass his day with trifling tasks; he does not neglect seclusion and applies himself to inner mental tranquility. This, bhikkhus, is the second quality that leads to a bhikkhu in training's non-decline.\n\nAgain, bhikkhus, a bhikkhu in training lives without close association with householders and other renunciants, avoiding inappropriate association with householders; he does not neglect seclusion and applies himself to inner mental tranquility. This, bhikkhus, is the third quality that leads to a bhikkhu in training's non-decline.\n\nAgain, bhikkhus, a bhikkhu in training does not enter a village at an inappropriate time, nor does he return too late in the day; he does not neglect seclusion and applies himself to inner mental tranquility. This, bhikkhus, is the fourth quality that leads to a bhikkhu in training's non-decline.\n\nAgain, bhikkhus, concerning that discourse which promotes the effacement of defilements and is conducive to the opening of the mind—namely, discourse on wanting little, discourse on contentment, discourse on seclusion, discourse on non-entanglement, discourse on aroused energy, discourse on virtue, discourse on concentration, discourse on wisdom, discourse on liberation, discourse on the knowledge and vision of liberation—concerning such discourse, he obtains it at will, without difficulty, and without trouble; he does not neglect seclusion and applies himself to inner mental tranquility. This, bhikkhus, is the fifth quality that leads to a bhikkhu in training's non-decline.\n\nThese, bhikkhus, are the five qualities that lead to a bhikkhu in training's non-decline.",
      "sinhala": "භික්ෂූණි, මේ ධර්ම කරුණු පහක් ශෛක්ෂ භික්ෂුවකගේ පිරිහීම පිණිස පවතී. ඒ කරුණු පහ කවරේද?\n\nමෙහිලා භික්ෂූණි, ශෛක්ෂ භික්ෂුව බොහෝ කටයුතු ඇත්තෙක්, බොහෝ කළ යුතු දේ ඇත්තෙක්, කුමක් කළ යුතුදැයි නොදන්නා පුද්ගලයෙක් වේ. ඔහු පිළිසලනින් තොරව වාසය කරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු නොවෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ පිරිහීම පිණිස පවතින පළමු ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව සුළු දෙයකින් වුවද දවස ගෙවා දමයි. ඔහු පිළිසලනින් තොරව වාසය කරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු නොවෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ පිරිහීම පිණිස පවතින දෙවන ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව ගිහියන් සහ ප්‍රව්‍රජිතයන් සමඟ අනුකූල නොවන ගිහි ඇසුරකින් මිශ්‍රව වාසය කරයි. ඔහු පිළිසලනින් තොරව වාසය කරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු නොවෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ පිරිහීම පිණිස පවතින තෙවන ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව අකාලයේ ගමට පිවිසෙයි, ඉතා ප්‍රමාද වී ආරාමයට පැමිණෙයි. ඔහු පිළිසලනින් තොරව වාසය කරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු නොවෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ පිරිහීම පිණිස පවතින සිව්වන ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව සිත් කෙලෙසින් මුදවාලීමට උපකාරී වන, සිත විවෘත කිරීමට සුදුසු යම් කතාවක් වේද, එනම් – අල්පේච්ඡතා කථාව, සන්තුෂ්ටතා කථාව, ප්‍රවිවේක කථාව, අසංසර්ග කථාව, වීර්යාරම්භ කථාව, සීල කථාව, සමාධි කථාව, ප්‍රඥා කථාව, විමුක්ති කථාව, විමුක්ති ඥාන දර්ශන කථාව යන මේ ආකාර කථාවලට කැමැත්තෙන් ලාභියෙක් නොවෙයි, පහසුවෙන් ලාභය ලබන්නෙක් නොවෙයි, දුෂ්කරතාවයකින් තොරව ලාභය ලබන්නෙක් නොවෙයි. ඔහු පිළිසලනින් තොරව වාසය කරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු නොවෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ පිරිහීම පිණිස පවතින පස්වන ධර්මයයි. භික්ෂූණි, මේ ධර්ම කරුණු පහ ශෛක්ෂ භික්ෂුවකගේ පිරිහීම පිණිස පවතී.\n\nභික්ෂූණි, මේ ධර්ම කරුණු පහක් ශෛක්ෂ භික්ෂුවකගේ නොපිරිහීම පිණිස පවතී. ඒ කරුණු පහ කවරේද?\n\nමෙහිලා භික්ෂූණි, ශෛක්ෂ භික්ෂුව බොහෝ කටයුතු ඇත්තෙක් නොවෙයි, බොහෝ කළ යුතු දේ ඇත්තෙක් නොවෙයි, කුමක් කළ යුතුදැයි දන්නා පුද්ගලයෙක් වේ. ඔහු පිළිසලනින් තොරව වාසය නොකරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු වෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ නොපිරිහීම පිණිස පවතින පළමු ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව සුළු දෙයකින් දවස ගෙවා නොදමයි. ඔහු පිළිසලනින් තොරව වාසය නොකරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු වෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ නොපිරිහීම පිණිස පවතින දෙවන ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව ගිහියන් සහ ප්‍රව්‍රජිතයන් සමඟ අනුකූල නොවන ගිහි ඇසුරකින් මිශ්‍රව වාසය නොකරයි. ඔහු පිළිසලනින් තොරව වාසය නොකරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු වෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ නොපිරිහීම පිණිස පවතින තෙවන ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව අකාලයේ ගමට නොපිවිසෙයි, ඉතා ප්‍රමාද වී ආරාමයට නොපැමිණෙයි. ඔහු පිළිසලනින් තොරව වාසය නොකරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු වෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ නොපිරිහීම පිණිස පවතින සිව්වන ධර්මයයි.\n\nතවද භික්ෂූණි, ශෛක්ෂ භික්ෂුව සිත් කෙලෙසින් මුදවාලීමට උපකාරී වන, සිත විවෘත කිරීමට සුදුසු යම් කතාවක් වේද, එනම් – අල්පේච්ඡතා කථාව, සන්තුෂ්ටතා කථාව, ප්‍රවිවේක කථාව, අසංසර්ග කථාව, වීර්යාරම්භ කථාව, සීල කථාව, සමාධි කථාව, ප්‍රඥා කථාව, විමුක්ති කථාව, විමුක්ති ඥාන දර්ශන කථාව යන මේ ආකාර කථාවලට කැමැත්තෙන් ලාභියෙක් වෙයි, පහසුවෙන් ලාභය ලබන්නෙක් වෙයි, දුෂ්කරතාවයකින් තොරව ලාභය ලබන්නෙක් වෙයි. ඔහු පිළිසලනින් තොරව වාසය නොකරයි, අභ්‍යන්තර චිත්ත සමාධියට නැවත නැවත යොමු වෙයි. භික්ෂූණි, මේ ශෛක්ෂ භික්ෂුවකගේ නොපිරිහීම පිණිස පවතින පස්වන ධර්මයයි. භික්ෂූණි, මේ ධර්ම කරුණු පහ ශෛක්ෂ භික්ෂුවකගේ නොපිරිහීම පිණිස පවතී.",
      "paliTitle": "Dutiyasekhasuttaṃ",
      "englishTitle": "Second Sutta on the Trainee",
      "sinhalaTitle": "දුතිය සේඛ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Theravaggo catuttho. Tassuddānaṃ – Rajanīyo vītarāgo, kuhakāssaddhaakkhamā; Paṭisambhidā ca sīlena, thero sekhā pare duveti.",
    "english": "The fourth chapter on Elders. The summary of it: Lustful, One Free from Lust, Fraudulent, Faithless, Impatient; Analytical Knowledge, Virtue, the Elder, and two other Trainees.",
    "sinhala": "සිව්වන ථේර වර්ගයයි. එහි උද්දානය නම්: රජනීය, වීතරාග, කුහක, අස්සද්ධ, අක්ඛම, පටිසම්භිදා, සීල, ථේර සහ සේඛ සූත්‍ර දෙකකි."
  }
}