{
  "id": "an5.29",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Passage on Lust",
    "sinhala": "රාග පේයාලය."
  },
  "sections": [
    {
      "number": 303,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya pañca dhammā bhāvetabbā. Katame pañca? Asubhasaññā, maraṇasaññā, ādīnavasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā [sabbatthapi evameva dissati] – rāgassa, bhikkhave, abhiññāya ime pañca dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct comprehension of lust, five qualities should be developed. Which five? The perception of foulness, the perception of death, the perception of danger, the perception of repulsiveness in food, and the perception of non-delight in the entire world. Monks, for the direct comprehension of lust, these five qualities should be developed.",
      "sinhala": "මහණෙනි, රාගය ප්‍රත්‍යක්ෂ වශයෙන් අවබෝධ කරගැනීම පිණිස ධර්ම පසක් වැඩිය යුතුය. කවරේද ඒ ධර්ම පස? එනම්: අසුභ සංඥාව, මරණ සංඥාව, ආදීනව සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සහ සියලු ලෝකයෙහි අනාභිරති සංඥාවයි. මහණෙනි, රාගය ප්‍රත්‍යක්ෂ වශයෙන් අවබෝධ කරගැනීම පිණිස මේ ධර්ම පස වැඩිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 304,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya pañca dhammā bhāvetabbā. Katame pañca? Aniccasaññā, anattasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā – rāgassa, bhikkhave, abhiññāya ime pañca dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the full comprehension of lust, five qualities should be developed. Which five? The perception of impermanence, the perception of non-self, the perception of death, the perception of the loathsomeness of food, and the perception of non-delight in the entire world — Monks, for the full comprehension of lust, these five qualities should be developed.",
      "sinhala": "මහණෙනි, රාගය මුළුමනින්ම අවබෝධ කර ගැනීම පිණිස ධර්‍ම කරුණු පහක් වැඩිය යුතු ය. ඒ පහ කුමක්ද? අනිත්‍ය සංඥාව, අනාත්ම සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි අනාභිරත සංඥාව යි. මහණෙනි, රාගය මුළුමනින්ම අවබෝධ කර ගැනීම පිණිස මේ ධර්‍ම කරුණු පහ වැඩිය යුතු ය.",
      "paliTitle": ""
    },
    {
      "number": 305,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya pañca dhammā bhāvetabbā. Katame pañca? Aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā – rāgassa, bhikkhave, abhiññāya ime pañca dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the full comprehension of passion, five qualities should be developed. What are these five? The perception of impermanence; the perception of suffering in impermanence; the perception of non-self in suffering; the perception of abandoning; and the perception of dispassion. Monks, for the full comprehension of passion, these five qualities should be developed.",
      "sinhala": "භික්ෂූන් වහන්ස, රාගය පිරිසිඳ දන්නා පිණිස ධර්‍ම පහක් වැඩිය යුත්තේය. ඒ කවර පසක්ද? අනිච්ච සංඥාව, අනිත්‍ය වූ දේ තුළ දුක් සංඥාව, දුක් වූ දේ තුළ අනාත්ම සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව – භික්ෂූන් වහන්ස, රාගය පිරිසිඳ දන්නා පිණිස මේ ධර්‍ම පහ වැඩිය යුත්තේය.",
      "paliTitle": ""
    },
    {
      "number": 306,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya pañca dhammā bhāvetabbā. Katame pañca? Saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ – rāgassa, bhikkhave, abhiññāya ime pañca dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the full understanding of craving, five qualities should be developed. Which five? The faculty of faith, the faculty of energy, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom—monks, for the full understanding of craving, these five qualities should be developed.",
      "sinhala": "රාගය පූර්ණ වශයෙන් ප්‍රත්‍යක්ෂයෙන් අවබෝධ කර ගැනීම පිණිස, මහණෙනි, ධර්ම කරුණු පහක් වැඩිය යුතුය.\n\nඒ කවර පහක්ද?\n\nශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන මේ ධර්ම කරුණු පහ, මහණෙනි, රාගය පූර්ණ වශයෙන් ප්‍රත්‍යක්ෂයෙන් අවබෝධ කර ගැනීම පිණිස වැඩිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 307,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya pañca dhammā bhāvetabbā. Katame pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – rāgassa, bhikkhave, abhiññāya ime pañca dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct knowledge of lust, five qualities are to be developed. Which five? The power of conviction, the power of energy, the power of mindfulness, the power of concentration, and the power of wisdom. Monks, for the direct knowledge of lust, these five qualities are to be developed.",
      "sinhala": "මහණෙනි, රාගය පිරිසිඳ අවබෝධ කරගැනීම පිණිස ධර්ම කරුණු පහක් වැඩිය යුත්තාහ. ඒ පහ කවරේද? ශ්‍රද්ධා බලය, වීර්ය බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලය යි – මහණෙනි, රාගය පිරිසිඳ අවබෝධ කරගැනීම පිණිස මේ ධර්ම කරුණු පහ වැඩිය යුත්තාහ.",
      "paliTitle": ""
    },
    {
      "number": 308,
      "numberRange": "308-1151",
      "pali": "‘‘Rāgassa, bhikkhave, pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya pañca dhammā bhāvetabbā. Dosassa… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa … madassa… pamādassa abhiññāya… pariññāya… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya pañca dhammā bhāvetabbā. ‘‘Katame pañca? Saddhābalaṃ, vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – pamādassa, bhikkhave, paṭinissaggāya ime pañca dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the full understanding, for the utter eradication, for the abandoning, for the cessation, for the fading away, for dispassion, for the ending, for the relinquishment, and for the letting go of passion, five qualities are to be developed. For the direct knowledge, for the full understanding, for the utter eradication, for the abandoning, for the cessation, for the fading away, for dispassion, for the ending, for the relinquishment, and for the letting go of aversion, delusion, anger, resentment, denigration, malicious envy, jealousy, avarice, deceit, craftiness, obstinacy, presumption, conceit, excessive pride, intoxication, and heedlessness, five qualities are to be developed.\n\nWhich five? They are the power of conviction, the power of persistent effort, the power of mindfulness, the power of concentration, and the power of wisdom. Monks, for the letting go of heedlessness, these five qualities are to be developed.",
      "sinhala": "මහණෙනි, රාගය පිරිසිඳ දැන ගැනීම, එහි මුළුමනින්ම ක්ෂය කිරීම, ප්‍රහීණ කිරීම, නැති කිරීම, වැනසීම, ඒ කෙරෙහි විරාගී වීම, නිරුද්ධ කිරීම, අත්හැරීම සහ සම්පූර්ණයෙන් පරිත්‍යාග කිරීම පිණිස පඤ්ච ධර්‍මයන් වැඩිය යුතුය. ද්වේෂය, මෝහය, ක්‍රෝධය, උපනාහය, මක්ඛය, පලාසය, ඊර්‍ෂ්‍යාව, මච්ඡරිය, මායාව, සාඨෙය්‍යය, ථම්භය, සාරම්භය, මානය, අතිමානය, මදය සහ ප්‍රමාදය අභිඥාපූර්‍වකව දැන ගැනීම, පිරිසිඳ දැන ගැනීම, මුළුමනින්ම ක්ෂය කිරීම, ප්‍රහීණ කිරීම, නැති කිරීම, වැනසීම, විරාගී වීම, නිරුද්ධ කිරීම, අත්හැරීම සහ සම්පූර්ණයෙන් පරිත්‍යාග කිරීම පිණිස ද පඤ්ච ධර්‍මයන් වැඩිය යුතුය.\n\nඒ පස කවරේද? ශ්‍රද්ධා බලය, වීර්‍ය්‍ය බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලයයි. මහණෙනි, ප්‍රමාදය සම්පූර්ණයෙන් පරිත්‍යාග කිරීම පිණිස මේ පඤ්ච ධර්‍මයන් වැඩිය යුතුය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ. Tassuddānaṃ – Abhiññāya pariññāya parikkhayāya, Pahānāya khayāya vayena ca; Virāganirodhā cāgañca, Paṭinissaggo ime dasāti. Pañcakanipāto niṭṭhito. Tatridaṃ vagguddānaṃ – Sekhabalaṃ balañceva, pañcaṅgikañca sumanaṃ; Muṇḍanīvaraṇañca saññañca, yodhājīvañca aṭṭhamaṃ; Theraṃ kakudhaphāsuñca, andhakavindadvādasaṃ; Gilānarājatikaṇḍaṃ, saddhammāghātupāsakaṃ; Araññabrāhmaṇañceva, kimilakkosakaṃ tathā; Dīghācārāvāsikañca, duccaritūpasampadanti.",
    "english": "",
    "sinhala": ""
  }
}