{
  "id": "an5.19",
  "title": {
    "pali": "Araññavaggo",
    "english": "The Chapter on the Forest",
    "sinhala": "ආරණ්‍ය වර්ගය"
  },
  "sections": [
    {
      "number": 181,
      "pali": "‘‘Pañcime, bhikkhave, āraññikā [āraññatā (sabbattha) pari. 443 passitabbaṃ]. Katame pañca? Mandattā momūhattā āraññiko hoti, pāpiccho icchāpakato āraññiko hoti, ummādā cittakkhepā āraññiko hoti, vaṇṇitaṃ buddhehi buddhasāvakehīti āraññiko hoti, appicchataṃyeva nissāya santuṭṭhiṃyeva nissāya sallekhaṃyeva nissāya pavivekaṃyeva nissāya idamatthitaṃyeva [idamaṭṭhitaṃyeva (sī. pī.)] nissāya āraññiko hoti. Ime kho, bhikkhave, pañca āraññikā. Imesaṃ kho, bhikkhave, pañcannaṃ āraññikānaṃ yvāyaṃ āraññiko appicchataṃyeva nissāya santuṭṭhiṃyeva nissāya sallekhaṃyeva nissāya pavivekaṃyeva nissāya idamatthitaṃyeva nissāya āraññiko hoti, ayaṃ imesaṃ pañcannaṃ āraññikānaṃ aggo ca seṭṭho ca mokkho [pāmokkho (a. ni. 4.95; 10.91)] ca uttamo ca pavaro ca. ‘‘Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo, sappimaṇḍo [sappimhā sappimaṇḍo (ka.) saṃ. ni. 3.662] tattha aggamakkhāyati; evamevaṃ kho, bhikkhave, imesaṃ pañcannaṃ āraññikānaṃ yvāyaṃ āraññiko appicchataṃyeva nissāya santuṭṭhiṃyeva nissāya sallekhaṃyeva nissāya pavivekaṃyeva nissāya idamatthitaṃyeva nissāya āraññiko hoti, ayaṃ imesaṃ pañcannaṃ āraññikānaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Paṭhamaṃ.",
      "english": "“Monks, there are these five types of forest dwellers. Which five?\n\nOne becomes a forest dweller out of dullness and delusion. One becomes a forest dweller due to evil wishes, overpowered by craving. One becomes a forest dweller due to madness and mental instability. One becomes a forest dweller thinking, ‘It has been praised by the Buddhas and their disciples.’ One becomes a forest dweller relying solely on fewness of wishes, relying solely on contentment, relying solely on the effacement of defilements, relying solely on seclusion, and relying solely on the understanding of the true purpose. These, monks, are the five types of forest dwellers. Among these five types of forest dwellers, monks, the one who becomes a forest dweller relying solely on fewness of wishes, relying solely on contentment, relying solely on the effacement of defilements, relying solely on seclusion, and relying solely on the understanding of the true purpose—this one among these five types of forest dwellers is the foremost, the best, the excellent, the supreme, and the most distinguished.\n\nJust as, monks, from a cow comes milk; from milk, curds; from curds, fresh butter; from fresh butter, clarified butter (ghee); and from clarified butter, the very cream of clarified butter, which is declared to be the finest among them; even so, monks, among these five types of forest dwellers, the one who becomes a forest dweller relying solely on fewness of wishes, relying solely on contentment, relying solely on the effacement of defilements, relying solely on seclusion, and relying solely on the understanding of the true purpose—this one among these five types of forest dwellers is the foremost, the best, the excellent, the supreme, and the most distinguished.”",
      "sinhala": "මහණෙනි, මේ වනවාසී භික්ෂූන් පස් දෙනෙකි. කවරහුද ඒ පස් දෙනා?\n\nමඳ නුවණින් යුක්ත වූ, මෝඩකමින් මුළා වූ තැනැත්තා වනවාසී වේ.\nපවිටු කැමැත්තෙන් යුක්ත වූ, තෘෂ්ණාවෙන් යටපත් වූ තැනැත්තා වනවාසී වේ.\nඋමතුවෙන් හා සිහි විකල් වීමෙන් යුක්ත වූ තැනැත්තා වනවාසී වේ.\nබුදුවරුන් හා බුදු සව්වන් විසින් මෙය වර්ණනා කරන ලද්දේයැයි සිතා තැනැත්තා වනවාසී වේ.\nඅල්පේච්ඡ බවම අරමුණු කොට, සන්තුෂ්ටියම අරමුණු කොට, ක්ලේශයන් කෙට්ටු කිරීමම අරමුණු කොට, විවේකයම අරමුණු කොට, මේ උතුම් අරමුණම අරමුණු කොට තැනැත්තා වනවාසී වේ.\n\nමහණෙනි, මේ වනවාසී භික්ෂූන් පස් දෙනාය. මහණෙනි, මේ පස් දෙනා අතරින් යම් වනවාසී භික්ෂුවක් අල්පේච්ඡ බවම අරමුණු කොට, සන්තුෂ්ටියම අරමුණු කොට, ක්ලේශයන් කෙට්ටු කිරීමම අරමුණු කොට, විවේකයම අරමුණු කොට, මේ උතුම් අරමුණම අරමුණු කොට වනවාසී වේද, ඒ තැනැත්තා මේ වනවාසී භික්ෂූන් පස් දෙනා අතුරින් අග්‍ර‍ වූයේද, ශ්‍රේෂ්ඨ වූයේද, ප්‍ර‍මුඛ වූයේද, උත්තම වූයේද, ප්‍ර‍වර වූයේද වේ.\n\nමහණෙනි, යම් සේ ගවයාගෙන් කිරිද, කිරෙන් දධිද, දධියෙන් නව නීතයද, නව නීතයෙන් ඝෘතයද, ඝෘතයෙන් ඝෘත මණ්ඩයද වේද, එහි ඝෘත මණ්ඩය අග්‍ර‍ යැයි කියනු ලැබේ.\n\nමහණෙනි, එපරිද්දෙන්ම, මේ වනවාසී භික්ෂූන් පස් දෙනා අතරින් යම් වනවාසී භික්ෂුවක් අල්පේච්ඡ බවම අරමුණු කොට, සන්තුෂ්ටියම අරමුණු කොට, ක්ලේශයන් කෙට්ටු කිරීමම අරමුණු කොට, විවේකයම අරමුණු කොට, මේ උතුම් අරමුණම අරමුණු කොට වනවාසී වේද, ඒ තැනැත්තා මේ වනවාසී භික්ෂූන් පස් දෙනා අතුරින් අග්‍ර‍ වූයේද, ශ්‍රේෂ්ඨ වූයේද, ප්‍ර‍මුඛ වූයේද, උත්තම වූයේද, ප්‍ර‍වර වූයේද වේ.",
      "paliTitle": "Āraññikasuttaṃ",
      "englishTitle": "The Discourse on Forest Dwellers",
      "sinhalaTitle": "ආරඤ්ඤික සූත්‍රය"
    },
    {
      "number": 182,
      "pali": "‘‘Pañcime, bhikkhave, paṃsukūlikā. Katame pañca? Mandattā momūhattā paṃsukūliko hoti…pe… idamatthitaṃyeva nissāya paṃsukūliko hoti. Ime kho, bhikkhave, pañca paṃsukūlikā’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, there are these five kinds of refuse-rag wearers. Which five?\nOne is a refuse-rag wearer due to foolishness and delusion. One is a refuse-rag wearer due to evil wishes and stinginess. One is a refuse-rag wearer for the sake of reputation, gain, and honor. One is a refuse-rag wearer, thinking, \"This is an excellent practice,\" and does so out of conviction. One is a refuse-rag wearer based solely on the understanding that this is for a specific purpose.\nBhikkhus, these are the five kinds of refuse-rag wearers.",
      "sinhala": "මහණෙනි, මේ පංසකූලික භික්‍ෂූන් වහන්සේලා පස් දෙනෙකි. ඒ කවර පස් දෙනෙක්ද?\n\nමන්දත්වයෙන්ද, මෝමූහත්‍වයෙන්ද පංසකූලික භික්‍ෂුවක් වෙයි; ... මේ උතුම් අරමුණම පදනම් කරගෙන පංසකූලික භික්‍ෂුවක් වෙයි.\n\nමහණෙනි, මේ පංසකූලික භික්‍ෂූන් වහන්සේලා පස් දෙනා මේ අයයි.\n\nදෙවෙනි සූත්‍රයයි.",
      "paliTitle": "Cīvarasuttaṃ",
      "englishTitle": "The Discourse on Robes",
      "sinhalaTitle": "චීවර සූත්‍රය"
    },
    {
      "number": 183,
      "pali": "‘‘Pañcime, bhikkhave, rukkhamūlikā. Katame pañca? Mandattā momūhattā rukkhamūliko hoti…pe… idamatthitaṃyeva nissāya rukkhamūliko hoti. Ime kho, bhikkhave, pañca rukkhamūlikā’’ti. Tatiyaṃ.",
      "english": "Monks, these five kinds of tree-root dwellers exist. Which five?\n\nOne is a tree-root dweller out of foolishness and delusion; one is a tree-root dweller out of a desire for recognition and status; one is a tree-root dweller relying on fewness of wishes; one is a tree-root dweller relying on contentment; one is a tree-root dweller relying on the true purpose of this practice. Indeed, Monks, these are the five kinds of tree-root dwellers.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ රුක්මුල් සේනාසනගතව වාසය කරන්නෝ පස් දෙනෙකි. ඒ පස් දෙනා කවරහුද?\n\nසමහර භික්ෂූහු මන්දබුද්ධික බව හා මුළාව නිසා රුක්මුල් සේනාසනගතව වාසය කරන්නෝ වෙති. තවත් සමහර භික්ෂූහු මෙම අර්ථයම අරමුණු කරගෙන රුක්මුල් සේනාසනගතව වාසය කරන්නෝ වෙති.\n\nභික්ෂූන් වහන්ස, මේ රුක්මුල් සේනාසනගතව වාසය කරන්නෝ පස් දෙනා වෙති.",
      "paliTitle": "Rukkhamūlikasuttaṃ",
      "englishTitle": "The Discourse on One Who Lives at the Foot of a Tree",
      "sinhalaTitle": "රුක්ඛමූලික සූත්‍රය"
    },
    {
      "number": 184,
      "pali": "‘‘Pañcime, bhikkhave, sosānikā. Katame pañca? Mandattā momūhattā sosāniko hoti…pe… idamatthitaṃyeva nissāya sosāniko hoti. Ime kho, bhikkhave, pañca sosānikā’’ti. Catutthaṃ.",
      "english": "Monks, there are these five charnel-ground dwellers. Which five? One is a charnel-ground dweller due to dullness and delusion; ... and one is a charnel-ground dweller solely relying on the inherent spiritual purpose of this practice. These, monks, are the five charnel-ground dwellers.",
      "sinhala": "මහණෙනි, මේ සුසාන භූමියෙහි වෙසෙන යෝගීහු පස් දෙනෙකි. කවරහුද ඒ පස් දෙනා? නුවණ මඳකම හා දැඩි මුළා බව නිසා සුසාන භූමියෙහි වෙසෙන යෝගියෙක් වෙයි. පවිටු කැමැත්ත හා මසුරුකම නිසා සුසාන භූමියෙහි වෙසෙන යෝගියෙක් වෙයි. උඩඟුකම හා මානය නිසා සුසාන භූමියෙහි වෙසෙන යෝගියෙක් වෙයි. ලාභ, සත්කාර, කීර්ති ප්‍රශංසා කෙරෙහි ඇති ආශාව නිසා සුසාන භූමියෙහි වෙසෙන යෝගියෙක් වෙයි. මේ ධර්ම මාර්ගයේ පරමාර්\\u200dථයම මුල් කරගෙන සුසාන භූමියෙහි වෙසෙන යෝගියෙක් වෙයි. මහණෙනි, මේ සුසාන භූමියෙහි වෙසෙන යෝගීහු පස් දෙනා වෙති.",
      "paliTitle": "Sosānikasuttaṃ",
      "englishTitle": "The Discourse on a Charnel-ground Dweller",
      "sinhalaTitle": "සෝසානික සූත්‍රය"
    },
    {
      "number": 185,
      "pali": "‘‘Pañcime, bhikkhave, abbhokāsikā…pe…. Pañcamaṃ.",
      "english": "Monks, these five are practitioners who dwell in the open air, and so forth, culminating in the fifth.",
      "sinhala": "මහණෙනි, මේ අභ්‍යවකාශික පුද්ගලයෝ පස් දෙනෙක් වෙති. පස්වැන්න වේ.",
      "paliTitle": "Abbhokāsikasuttaṃ",
      "englishTitle": "The Open Air Dweller Sutta",
      "sinhalaTitle": "අබ්භෝකාසික සූත්‍රය"
    },
    {
      "number": 186,
      "pali": "‘‘Pañcime, bhikkhave, nesajjikā…pe…. Chaṭṭhaṃ.",
      "english": "Monks, there are these five practitioners of the austerity of not lying down, and so on. This is the sixth.",
      "sinhala": "භික්ෂූන් වහන්ස, නොනිදා හිඳින ව්‍රතය රකින්නෝ මේ පස් දෙන වෙති. මෙය සවෙනි සූත්‍රයයි.",
      "paliTitle": "Nesajjikasuttaṃ",
      "englishTitle": "The Sitter Sutta",
      "sinhalaTitle": "නේසජ්ජික සූත්‍රය"
    },
    {
      "number": 187,
      "pali": "‘‘Pañcime, bhikkhave, yathāsanthatikā…pe…. Sattamaṃ.",
      "english": "Monks, there are these five who are content with whatever lodging is provided. ... The Seventh.",
      "sinhala": "මහණෙනි, මේ යථාසන්ථතික භික්ෂූහු පස් දෙනෙක් වෙති. පෙර පරිදිම අනෙකුත් විස්තර දත යුතුයි. මෙය සත්වන සූත්‍රයයි.",
      "paliTitle": "Yathāsanthatikasuttaṃ",
      "englishTitle": "The Discourse on One Who Uses Whatever Seat is Offered",
      "sinhalaTitle": "යථාසන්ථතික සූත්‍රය"
    },
    {
      "number": 188,
      "pali": "‘‘Pañcime, bhikkhave, ekāsanikā…pe…. Aṭṭhamaṃ.",
      "english": "Monks, these five are those who eat in one sitting, and so on. This is the eighth.",
      "sinhala": "මහණෙනි, එක ආසනයක වසන මේ පස් දෙනෙක් වෙති.\n\nමෙය අටවැනි සූත්‍රයයි.",
      "paliTitle": "Ekāsanikasuttaṃ",
      "englishTitle": "The One-Session Eater Sutta",
      "sinhalaTitle": "ඒකාසනික සූත්‍රය"
    },
    {
      "number": 189,
      "pali": "‘‘Pañcime, bhikkhave, khalupacchābhattikā…pe…. Navamaṃ.",
      "english": "Monks, these five are individuals prone to post-meal slackness, and so forth. This is the ninth.",
      "sinhala": "භික්ෂූණි, කලට කළ යුතු කටයුතු ප‍්‍රමාද කරනසුලු පුද්ගලයෝ පස් දෙනෙක් වෙති... මෙය නවවැනි සූත‍්‍රයයි.",
      "paliTitle": "Khalupacchābhattikasuttaṃ",
      "englishTitle": "One Who Refuses More Food Sutta",
      "sinhalaTitle": "ඛලුපච්ඡාභත්තික සූත්‍රය"
    },
    {
      "number": 190,
      "pali": "‘‘Pañcime, bhikkhave, pattapiṇḍikā. Katame pañca? Mandattā momūhattā pattapiṇḍiko hoti, pāpiccho icchāpakato pattapiṇḍiko hoti, ummādā cittakkhepā pattapiṇḍiko hoti, ‘vaṇṇitaṃ buddhehi buddhasāvakehī’ti pattapiṇḍiko hoti, appicchataṃyeva nissāya santuṭṭhiṃyeva nissāya sallekhaṃyeva nissāya pavivekaṃyeva nissāya idamatthitaṃyeva nissāya pattapiṇḍiko hoti. Ime kho, bhikkhave, pañca pattapiṇḍikā. Imesaṃ kho, bhikkhave, pañcannaṃ pattapiṇḍikānaṃ yvāyaṃ pattapiṇḍiko appicchataṃyeva nissāya santuṭṭhiṃyeva nissāya sallekhaṃyeva nissāya pavivekaṃyeva nissāya idamatthitaṃyeva nissāya pattapiṇḍiko hoti, ayaṃ imesaṃ pañcannaṃ pattapiṇḍikānaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. ‘‘Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo, sappimaṇḍo tattha aggamakkhāyati; evamevaṃ kho, bhikkhave, imesaṃ pañcannaṃ pattapiṇḍikānaṃ yvāyaṃ pattapiṇḍiko appicchataṃyeva nissāya santuṭṭhiṃyeva nissāya sallekhaṃyeva nissāya pavivekaṃyeva nissāya idamatthitaṃyeva nissāya pattapiṇḍiko hoti, ayaṃ imesaṃ pañcannaṃ pattapiṇḍikānaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Dasamaṃ. ",
      "english": "Bhikkhus, there are these five types of monastics who partake of alms-food from the bowl. What are these five?\n\nOne partakes of alms-food from the bowl out of dullness and utter confusion. One partakes of alms-food from the bowl due to evil wishes, overcome by craving. One partakes of alms-food from the bowl due to madness and mental distraction. One partakes of alms-food from the bowl thinking, 'This practice has been praised by the Buddhas and their disciples.' One partakes of alms-food from the bowl relying solely on fewness of desires, relying solely on contentment, relying solely on the effacement of defilements, relying solely on seclusion, and relying solely on the attainment of this very aim. These, bhikkhus, are the five types of monastics who partake of alms-food from the bowl. Among these five types of monastics who partake of alms-food from the bowl, bhikkhus, the one who partakes of alms-food from the bowl relying solely on fewness of desires, relying solely on contentment, relying solely on the effacement of defilements, relying solely on seclusion, and relying solely on the attainment of this very aim — that one is the foremost, the best, the most excellent, the supreme, and the most noble among these five types of monastics who partake of alms-food from the bowl.\n\nJust as, bhikkhus, from a cow comes milk, from milk comes curds, from curds comes fresh butter, from fresh butter comes ghee, and from ghee comes the essence of ghee, and that essence of ghee is declared the foremost; in the same way, bhikkhus, among these five types of monastics who partake of alms-food from the bowl, the one who partakes of alms-food from the bowl relying solely on fewness of desires, relying solely on contentment, relying solely on the effacement of defilements, relying solely on seclusion, and relying solely on the attainment of this very aim — that one is the foremost, the best, the most excellent, the supreme, and the most noble among these five types of monastics who partake of alms-food from the bowl.",
      "sinhala": "භික්ෂූණි, මේ පස් දෙනෙකු පත්පිඬු සෙවීමෙහි යෙදෙති. ඒ පස් දෙනා කවරහුද? නුවණ මඳකමින්, මුළා වූ බවින් (දැඩි අවිද්‍යාවෙන්) පත්පිඬු සොයන්නෙක් වෙයි. දුරාශා ඇතිව, තණ්හාවට යට වී පත්පිඬු සොයන්නෙක් වෙයි. උමතු ස්වභාවය නිසා, සිත් විසුරුණු බව නිසා පත්පිඬු සොයන්නෙක් වෙයි. ‘බුදුරජාණන් වහන්සේලා විසින් ද, බුදුරජාණන් වහන්සේලාගේ ශ්‍රා‌වකයන් විසින් ද මෙය වර්ණනා කර ඇතැ’යි සලකා පත්පිඬු සොයන්නෙක් වෙයි. අල්පේච්ඡතාවයම නිශ්‍රය කරගෙන, සන්තුෂ්ටියම නිශ්‍රය කරගෙන, කෙලෙස් දුරුකිරීමම (සල්ලේඛය) නිශ්‍රය කරගෙන, විවේකයම නිශ්‍රය කරගෙන, අරමුණ වූ නිවනෙහි සත්‍ය‌තාවයම නිශ්‍රය කරගෙන පත්පිඬු සොයන්නෙක් වෙයි. භික්ෂූණි, මේ පස් දෙනා පත්පිඬු සොයන්නෝ වෙති. භික්ෂූණි, මේ පත්පිඬු සොයන පස් දෙනා අතරින් යම් පත්පිඬු සොයන්නෙක් අල්පේච්ඡතාවයම නිශ්‍රය කරගෙන, සන්තුෂ්ටියම නිශ්‍රය කරගෙන, කෙලෙස් දුරුකිරීමම (සල්ලේඛය) නිශ්‍රය කරගෙන, විවේකයම නිශ්‍රය කරගෙන, අරමුණ වූ නිවනෙහි සත්‍ය‌තාවයම නිශ්‍රය කරගෙන පත්පිඬු සොයයි ද, මොහු මේ පත්පිඬු සොයන පස් දෙනාගෙන් අග්‍ර ද, ශ්‍රේ‌ෂ්ඨ ද, කෙලෙස්වලින් මිදුණු ද, උත්තම ද, ප්‍ර‌වර ද වන්නේ ය.\n\nභික්ෂූණි, යම් සේ ගවයාගෙන් කිරි ද, කිරෙන් දී කිරි ද, දී කිරෙන් වෙඬරු ද, වෙඬරුවෙන් ගිතෙල් ද, ගිතෙලෙන් ගිතෙල් සාරය ද වෙයි ද, ගිතෙල් සාරය එහි අග්‍ර යැයි කියනු ලැබේ ද; එසෙවම භික්ෂූණි, මේ පත්පිඬු සොයන පස් දෙනාගෙන් යම් පත්පිඬු සොයන්නෙක් අල්පේච්ඡතාවයම නිශ්‍රය කරගෙන, සන්තුෂ්ටියම නිශ්‍රය කරගෙන, කෙලෙස් දුරුකිරීමම (සල්ලේඛය) නිශ්‍රය කරගෙන, විවේකයම නිශ්‍රය කරගෙන, අරමුණ වූ නිවනෙහි සත්‍ය‌තාවයම නිශ්‍රය කරගෙන පත්පිඬු සොයයි ද, මොහු මේ පත්පිඬු සොයන පස් දෙනාගෙන් අග්‍ර ද, ශ්‍රේ‌ෂ්ඨ ද, කෙලෙස්වලින් මිදුණු ද, උත්තම ද, ප්‍ර‌වර ද වන්නේ යැ'යි භාග්‍ය‌වතුන් වහන්සේ දේශනා කළ සේක.",
      "paliTitle": "Pattapiṇḍikasuttaṃ",
      "englishTitle": "The Discourse on Eating from the Bowl",
      "sinhalaTitle": "පත්තපිණ්ඩික සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Araññavaggo catuttho. Tassuddānaṃ – Araññaṃ cīvaraṃ rukkha, susānaṃ abbhokāsikaṃ; Nesajjaṃ santhataṃ ekāsanikaṃ, khalupacchāpiṇḍikena cāti.",
    "english": "The Chapter on Forests is the fourth. The summary of it: Forest, Robe, Tree, Cemetery, Open Air; Sitting, Mat, Eating at one sitting, and refusing later food.",
    "sinhala": "සිව්වන අරඤ්ඤ වර්ගයයි. එහි උද්දානය නම්: අරඤ්ඤ, චීවර, රුක්ඛමූල, සුසාන, අබ්භෝකාසික, නේසජ්ජික, සන්ථත, ඒකාසනික සහ ඛලුපච්ඡාභත්තිකාදී සූත්‍රයි."
  }
}