{
  "id": "an5.4",
  "title": {
    "pali": "Sumanavaggo",
    "english": "The Chapter of Sumana.",
    "sinhala": "සුමන වර්ගය"
  },
  "sections": [
    {
      "number": 31,
      "pali": "Ekaṃ samayaṃ…pe… anāthapiṇḍikassa ārāme. Atha kho sumanā rājakumārī pañcahi rathasatehi pañcahi rājakumārisatehi parivutā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho sumanā rājakumārī bhagavantaṃ etadavoca – ‘‘Idhassu, bhante, bhagavato dve sāvakā samasaddhā samasīlā samapaññā – eko dāyako, eko adāyako. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyuṃ. Devabhūtānaṃ pana nesaṃ [tesaṃ (sī.)], bhante, siyā viseso, siyā nānākaraṇa’’nti? ‘‘Siyā, sumane’’ti bhagavā avoca – ‘‘yo so, sumane, dāyako so amuṃ adāyakaṃ devabhūto samāno pañcahi ṭhānehi adhigaṇhāti – dibbena āyunā, dibbena vaṇṇena, dibbena sukhena, dibbena yasena, dibbena ādhipateyyena. Yo so, sumane, dāyako so amuṃ adāyakaṃ devabhūto samāno imehi pañcahi ṭhānehi adhigaṇhāti’’. ‘‘Sace pana te, bhante, tato cutā itthattaṃ āgacchanti, manussabhūtānaṃ pana nesaṃ, bhante, siyā viseso, siyā nānākaraṇa’’nti? ‘‘Siyā, sumane’’ti bhagavā avoca – ‘‘yo so, sumane, dāyako so amuṃ adāyakaṃ manussabhūto samāno pañcahi ṭhānehi adhigaṇhāti – mānusakena āyunā, mānusakena vaṇṇena, mānusakena sukhena, mānusakena yasena, mānusakena ādhipateyyena. Yo so, sumane, dāyako so amuṃ adāyakaṃ manussabhūto samāno imehi pañcahi ṭhānehi adhigaṇhāti’’. ‘‘Sace pana te, bhante, ubho agārasmā anagāriyaṃ pabbajanti, pabbajitānaṃ pana nesaṃ, bhante, siyā viseso, siyā nānākaraṇa’’nti? ‘‘Siyā, sumane’’ti bhagavā avoca – ‘‘yo so, sumane, dāyako so amuṃ adāyakaṃ pabbajito samāno pañcahi ṭhānehi adhigaṇhāti – yācitova bahulaṃ cīvaraṃ paribhuñjati appaṃ ayācito, yācitova bahulaṃ piṇḍapātaṃ paribhuñjati appaṃ ayācito, yācitova bahulaṃ senāsanaṃ paribhuñjati appaṃ ayācito, yācitova bahulaṃ gilānappaccayabhesajjaparikkhāraṃ paribhuñjati appaṃ ayācito. Yehi kho pana sabrahmacārīhi saddhiṃ viharati tyassa manāpeneva bahulaṃ kāyakammena samudācaranti appaṃ amanāpena, manāpeneva bahulaṃ vacīkammena samudācaranti appaṃ amanāpena, manāpeneva bahulaṃ manokammena samudācaranti appaṃ amanāpena, manāpaṃyeva bahulaṃ upahāraṃ upaharanti appaṃ amanāpaṃ. Yo so, sumane, dāyako so amuṃ adāyakaṃ pabbajito samāno imehi pañcahi ṭhānehi adhigaṇhātī’’ti. ‘‘Sace pana te, bhante, ubho arahattaṃ pāpuṇanti, arahattappattānaṃ pana nesaṃ, bhante, siyā viseso, siyā nānākaraṇa’’nti? ‘‘Ettha kho panesāhaṃ, sumane, na kiñci nānākaraṇaṃ vadāmi, yadidaṃ vimuttiyā vimutti’’nti [vimuttanti (syā. kaṃ.)]. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāvañcidaṃ, bhante, alameva dānāni dātuṃ alaṃ puññāni kātuṃ; yatra hi nāma devabhūtassāpi upakārāni puññāni, manussabhūtassāpi upakārāni puññāni, pabbajitassāpi upakārāni puññānī’’ti. ‘‘Evametaṃ, sumane! Alañhi, sumane, dānāni dātuṃ alaṃ puññāni kātuṃ! Devabhūtassāpi upakārāni puññāni, manussabhūtassāpi upakārāni puññāni, pabbajitassāpi upakārāni puññānī’’ti. Idamavoca bhagavā. Idaṃ vatvāna [idaṃ vatvā (sī. pī.) evamuparipi] sugato athāparaṃ etadavoca satthā – ‘‘Yathāpi cando vimalo, gacchaṃ ākāsadhātuyā; Sabbe tārāgaṇe loke, ābhāya atirocati. ‘‘Tatheva sīlasampanno, saddho purisapuggalo; Sabbe maccharino loke, cāgena atirocati. ‘‘Yathāpi megho thanayaṃ, vijjumālī satakkaku; Thalaṃ ninnañca pūreti, abhivassaṃ vasundharaṃ. ‘‘Evaṃ dassanasampanno, sammāsambuddhasāvako; Macchariṃ adhigaṇhāti, pañcaṭhānehi paṇḍito. ‘‘Āyunā yasasā ceva [āyunā ca yasena ca (ka.)], vaṇṇena ca sukhena ca; Sa ve bhogaparibyūḷho [bhogaparibbūḷho (sī.)], pecca sagge pamodatī’’ti. paṭhamaṃ;",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park.\n\nThen Princess Sumanā, surrounded by five hundred chariots and five hundred princesses, approached the Blessed One. Having approached and paid homage to the Blessed One, she sat down to one side. As she sat to one side, Princess Sumanā said to the Blessed One: \"Venerable Sir, suppose there are two disciples of the Blessed One who are equal in faith, equal in moral conduct, and equal in wisdom – one is a donor, and the other is not a donor. After the breaking up of the body, after death, they might both be reborn in a good destination, in a heavenly world. Would there, Venerable Sir, be any distinction or difference between them when they have become divine beings?\"\n\n\"There would be, Sumanā,\" the Blessed One said. \"Sumanā, the donor, having become a divine being, surpasses the non-donor in five respects: in divine life-span, in divine beauty, in divine happiness, in divine fame, and in divine sovereignty. Sumanā, the donor, having become a divine being, surpasses the non-donor in these five respects.\"\n\n\"But Venerable Sir, if they pass away from that realm and come to this state of humanity, would there be any distinction or difference between them when they have become human beings?\"\n\n\"There would be, Sumanā,\" the Blessed One said. \"Sumanā, the donor, having become a human being, surpasses the non-donor in five respects: in human life-span, in human beauty, in human happiness, in human fame, and in human sovereignty. Sumanā, the donor, having become a human being, surpasses the non-donor in these five respects.\"\n\n\"But Venerable Sir, if both of them go forth from the household life into homelessness, would there be any distinction or difference between them when they have become monastics?\"\n\n\"There would be, Sumanā,\" the Blessed One said. \"Sumanā, the donor, having become a monastic, surpasses the non-donor in five respects: predominantly, he partakes of robes when requested, rarely without being requested; predominantly, he partakes of almsfood when requested, rarely without being requested; predominantly, he partakes of lodging when requested, rarely without being requested; predominantly, he partakes of medicines for the sick when requested, rarely without being requested. Moreover, with the fellow monastics among whom he dwells, they mostly approach him with agreeable bodily actions, rarely with disagreeable ones; mostly with agreeable verbal actions, rarely with disagreeable ones; mostly with agreeable mental actions, rarely with disagreeable ones; and they mostly present him with agreeable gifts, rarely with disagreeable ones. Sumanā, the donor, having become a monastic, surpasses the non-donor in these five respects.\"\n\n\"But Venerable Sir, if both of them attain arahantship, would there be any distinction or difference between them when they have attained arahantship?\"\n\n\"In this regard, Sumanā, I declare no distinction or difference, that is to say, in their liberation from liberation.\"\n\n\"It is wonderful, Venerable Sir! It is astounding, Venerable Sir! To this extent, Venerable Sir, it is indeed fitting to give gifts, it is indeed fitting to perform meritorious deeds; for indeed, meritorious deeds are beneficial even for divine beings, beneficial even for human beings, and beneficial even for monastics!\"\n\n\"So it is, Sumanā! It is indeed fitting, Sumanā, to give gifts, it is indeed fitting to perform meritorious deeds! Meritorious deeds are beneficial even for divine beings, beneficial even for human beings, and beneficial even for monastics!\"\n\nThe Blessed One spoke this. Having said this, the Fortunate One, the Teacher, then spoke further:\n\nJust as the moon, pure and unsullied,\nAs it moves through the celestial sphere,\nOutshines all constellations in the world with its radiance;\n\nSo too, a faithful person, endowed with moral conduct,\nOutshines all stingy people in the world through their generosity.\n\nJust as a thunder cloud, with a garland of lightning,\nFilled with a hundred peaks of rain,\nFills both high ground and low ground, drenching the earth;\n\nEven so, a wise disciple of the Perfectly Self-Awakened One,\nEndowed with right view, surpasses the stingy person in five respects:\n\nIn life-span, and in fame, and in beauty, and in happiness;\nIndeed, he is well-endowed with abundant possessions,\nAnd delights in heaven after passing away.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක. එකල්හි සුමනා රාජකුමාරිය රථ පන්සියයකින්ද, රාජකුමාරිකාවන් පන්සියයකින්ද පිරිවරාගෙන, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියාය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූවාය. එකත්පස්ව වාඩි වී සිටි සුමනා රාජකුමාරිය භාග්‍යවතුන් වහන්සේට මෙය පැවසුවාය: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයෝ දෙදෙනෙක් සිටිති. ඔවුහු සමාන ශ්‍රද්ධාවෙන් යුක්තය, සමාන සීලයෙන් යුක්තය, සමාන ප්‍රඥාවෙන් යුක්තය. එක් අයෙක් දානය දෙන්නෙකි, අනිත් අයෙක් දානය නොදෙන්නෙකි. ඔවුහු කය බිඳීමෙන්, මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයෙහි උපදිත්. ස්වාමීනි, දෙවියන් ලෙස උපන් ඔවුන් අතර යම් වෙනසක්, යම් විෂමතාවක් තිබේද?\"\n\n\"සුමනා, වෙනසක් තිබේ\" යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. \"සුමනා, යම් ඒ දානය දෙන්නා නම්, ඔහු දෙවියෙක්ව සිටින කල්හි දානය නොදෙන්නාට වඩා කරුණු පහකින් අධික වේ: දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, දිව්‍යමය සැපයෙන්, දිව්‍යමය යසසින්, දිව්‍යමය ආධිපත්‍යයෙන්. සුමනා, යම් ඒ දානය දෙන්නා නම්, ඔහු දෙවියෙක්ව සිටින කල්හි දානය නොදෙන්නාට වඩා මේ කරුණු පහකින් අධික වේ.\"\n\n\"ස්වාමීනි, යම් හෙයකින් ඔවුහු ඒ දිව්‍ය ලෝකයෙන් චුත වී මිනිස් ලොවට පැමිණෙත් නම්, ස්වාමීනි, මිනිසුන් ලෙස උපන් ඔවුන් අතර යම් වෙනසක්, යම් විෂමතාවක් තිබේද?\"\n\n\"සුමනා, වෙනසක් තිබේ\" යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. \"සුමනා, යම් ඒ දානය දෙන්නා නම්, ඔහු මිනිසෙක්ව සිටින කල්හි දානය නොදෙන්නාට වඩා කරුණු පහකින් අධික වේ: මනුෂ්‍ය ආයුෂයෙන්, මනුෂ්‍ය වර්ණයෙන්, මනුෂ්‍ය සැපයෙන්, මනුෂ්‍ය යසසින්, මනුෂ්‍ය ආධිපත්‍යයෙන්. සුමනා, යම් ඒ දානය දෙන්නා නම්, ඔහු මිනිසෙක්ව සිටින කල්හි දානය නොදෙන්නාට වඩා මේ කරුණු පහකින් අධික වේ.\"\n\n\"ස්වාමීනි, යම් හෙයකින් ඔවුහු දෙදෙනාම ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වෙත් නම්, ස්වාමීනි, පැවිදි වූ ඔවුන් අතර යම් වෙනසක්, යම් විෂමතාවක් තිබේද?\"\n\n\"සුමනා, වෙනසක් තිබේ\" යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. \"සුමනා, යම් ඒ දානය දෙන්නා නම්, ඔහු පැවිදි වූ කල්හි දානය නොදෙන්නාට වඩා කරුණු පහකින් අධික වේ: ඔහු බොහෝ විට ඉල්වූ විටම සිවුරු පරිභෝජනය කරයි, නොඉල්වා පරිභෝජනය කරන්නේ අඩුවෙනි; බොහෝ විට ඉල්වූ විටම පිණ්ඩපාතය පරිභෝජනය කරයි, නොඉල්වා පරිභෝජනය කරන්නේ අඩුවෙනි; බොහෝ විට ඉල්වූ විටම සේනාසන (වාසස්ථාන) පරිභෝජනය කරයි, නොඉල්වා පරිභෝජනය කරන්නේ අඩුවෙනි; බොහෝ විට ඉල්වූ විටම ගිලන්පස සහ ඖෂධ පරිභෝජනය කරයි, නොඉල්වා පරිභෝජනය කරන්නේ අඩුවෙනි. තවද, ඔහු යම් සබ්‍රහ්මචාරීන් සමග වාසය කරයිද, ඔවුහු ඔහුට බොහෝ විට ප්‍රිය මනාප කය කර්මයෙන් උපස්ථාන කරති, අප්‍රිය වූ කය කර්මයෙන් උපස්ථාන කරන්නේ අඩුවෙනි; බොහෝ විට ප්‍රිය මනාප වචී කර්මයෙන් උපස්ථාන කරති, අප්‍රිය වූ වචී කර්මයෙන් උපස්ථාන කරන්නේ අඩුවෙනි; බොහෝ විට ප්‍රිය මනාප මනෝ කර්මයෙන් උපස්ථාන කරති, අප්‍රිය වූ මනෝ කර්මයෙන් උපස්ථාන කරන්නේ අඩුවෙනි; බොහෝ විට ප්‍රිය මනාප වූ උපහාර (ගෞරව) පුදති, අප්‍රිය වූ උපහාර පුදන්නේ අඩුවෙනි. සුමනා, යම් ඒ දානය දෙන්නා නම්, ඔහු පැවිදි වූ කල්හි දානය නොදෙන්නාට වඩා මේ කරුණු පහකින් අධික වේ.\"\n\n\"ස්වාමීනි, යම් හෙයකින් ඔවුහු දෙදෙනාම රහත්භාවයට පත්වෙත් නම්, ස්වාමීනි, රහත්භාවයට පත් වූ ඔවුන් අතර යම් වෙනසක්, යම් විෂමතාවක් තිබේද?\"\n\n\"සුමනා, මෙහිදී නම් මම කිසිදු වෙනසක් හෝ විෂමතාවක් නොකියමි. එනම් විමුක්තියෙන් විමුක්තිය යි.\"\n\n\"ආශ්චර්යයකි ස්වාමීනි, අද්භූතයකි ස්වාමීනි! ස්වාමීනි, දන් දීමටත්, පින්කම් කිරීමටත් මෙය ප්‍රමාණවත් ය. එනම් දෙවියෙක්ව සිටින කල්හිද පින්කම් උපකාර වන හෙයිනි, මිනිසෙක්ව සිටින කල්හිද පින්කම් උපකාර වන හෙයිනි, පැවිද්දෙකුටද පින්කම් උපකාර වන හෙයිනි.\"\n\n\"සුමනා, එය එසේමයි! සුමනා, දන් දීමටත්, පින්කම් කිරීමටත් මෙය ප්‍රමාණවත් ය! දෙවියෙක්ව සිටින කල්හිද පින්කම් උපකාර වේ, මිනිසෙක්ව සිටින කල්හිද පින්කම් උපකාර වේ, පැවිද්දෙකුටද පින්කම් උපකාර වේ.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගත වූ ශාස්තෘන් වහන්සේ නැවත මෙසේ වදාළ සේක:\n\n\"කිලිටි නැති සඳ, ආකාශ ධාතුවෙහි ගමන් කරන්නේ,\nලෝකයේ සියලු තරුරැස තම ආලෝකයෙන් ඉක්මවා බබළයි ද,\n\nඑලෙසින්ම සීලයෙන් යුක්ත වූ, ශ්‍රද්ධාවන්ත පුරුෂ පුද්ගලයා,\nලෝකයේ සියලු මසුරු පුද්ගලයන් තම ත්‍යාගශීලී බවින් ඉක්මවා සිටියි.\n\nයම්සේ ගොරවමින්, විදුලි වැල් සහිත, සියක් කඳු මුදුන් වැනි මේඝයා,\nඋස් බිම්ද, පහත් බිම්ද පුරවමින්, පොළොවට වර්ෂා ජලය වස්සවයි ද,\n\nඑලෙසින්ම සම්‍යක්දෘෂ්ටියෙන් යුක්ත වූ, සම්මා සම්බුදු ශ්‍රාවකයා,\nප්‍රඥාවන්ත පුද්ගලයා කරුණු පහකින් මසුරු පුද්ගලයාට වඩා අධික වේ.\n\nආයුෂයෙන්ද, යසසින්ද, වර්ණයෙන්ද, සැපයෙන්ද (අධික වූ),\nභෝග සම්පත්වලින් පිරිපුන් වූ ඔහු, මරණින් මතු ස්වර්ගයෙහි සතුටු වෙයි.\"",
      "paliTitle": "Sumanasuttaṃ",
      "englishTitle": "The Discourse to Sumana",
      "sinhalaTitle": "සුමනා සූත්‍රය"
    },
    {
      "number": 32,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho cundī rājakumārī pañcahi rathasatehi pañcahi ca kumārisatehi parivutā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho cundī rājakumārī bhagavantaṃ etadavoca – ‘‘Amhākaṃ, bhante, bhātā cundo nāma rājakumāro, so evamāha – ‘yadeva so hoti itthī vā puriso vā buddhaṃ saraṇaṃ gato, dhammaṃ saraṇaṃ gato, saṅghaṃ saraṇaṃ gato, pāṇātipātā paṭivirato, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, surāmerayamajjapamādaṭṭhānā paṭivirato, so kāyassa bhedā paraṃ maraṇā sugatiṃyeva upapajjati, no duggati’nti. Sāhaṃ, bhante, bhagavantaṃ pucchāmi – ‘kathaṃrūpe kho, bhante, satthari pasanno kāyassa bhedā paraṃ maraṇā sugatiṃyeva upapajjati, no duggatiṃ? Kathaṃrūpe dhamme pasanno kāyassa bhedā paraṃ maraṇā sugatiṃyeva upapajjati, no duggatiṃ? Kathaṃrūpe saṅghe pasanno kāyassa bhedā paraṃ maraṇā sugatiṃyeva upapajjati, no duggatiṃ? Kathaṃrūpesu sīlesu paripūrakārī kāyassa bhedā paraṃ maraṇā sugatiṃyeva upapajjati, no duggati’’’nti? ‘‘Yāvatā, cundi, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā [apādā vā dvīpādā vācatuppādā vā bahuppādā vā (sī.) a. ni. 4.34; itivu. 90] rūpino vā arūpino vā saññino vā asaññino vā nevasaññināsaññino vā, tathāgato tesaṃ aggamakkhāyati arahaṃ sammāsambuddho. Ye kho, cundi, buddhe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, cundi, dhammā saṅkhatā, ariyo aṭṭhaṅgiko maggo tesaṃ aggamakkhāyati. Ye, cundi, ariye aṭṭhaṅgike magge pasannā, agge te pasannā, agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, cundi, dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ [tesaṃ dhammānaṃ (sī. pī. ka.)] aggamakkhāyati, yadidaṃ – madanimmadano pipāsavinayo ālayasamugghāto vaṭṭupacchedo taṇhākkhayo virāgo nirodho nibbānaṃ. Ye kho, cundi, virāge dhamme pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, cundi, saṅghā vā gaṇā vā, tathāgatasāvakasaṅgho tesaṃ aggamakkhāyati, yadidaṃ – cattāri purisayugāni aṭṭha purisapuggalā, esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Ye kho, cundi, saṅghe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, cundi, sīlāni, ariyakantāni sīlāni tesaṃ [ariyakantānitesaṃ (sī. syā. kaṃ.)] aggamakkhāyati, yadidaṃ – akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni. Ye kho, cundi, ariyakantesu sīlesu paripūrakārino, agge te paripūrakārino. Agge kho pana paripūrakārīnaṃ aggo vipāko hotī’’ti. ‘‘Aggato ve pasannānaṃ, aggaṃ dhammaṃ vijānataṃ; Agge buddhe pasannānaṃ, dakkhiṇeyye anuttare. ‘‘Agge dhamme pasannānaṃ, virāgūpasame sukhe; Agge saṅghe pasannānaṃ, puññakkhette anuttare. ‘‘Aggasmiṃ dānaṃ dadataṃ, aggaṃ puññaṃ pavaḍḍhati; Aggaṃ āyu ca vaṇṇo ca, yaso kitti sukhaṃ balaṃ. ‘‘Aggassa dātā medhāvī, aggadhammasamāhito; Devabhūto manusso vā, aggappatto pamodatī’’ti. dutiyaṃ;",
      "english": "Once the Blessed One was staying in Rājagaha, in the Bamboo Grove, the Squirrels' Feeding Ground. Then Princess Cundī, surrounded by five hundred chariots and five hundred maidens, approached the Blessed One. Having approached, she paid homage to the Blessed One and sat down to one side. Seated to one side, Princess Cundī said to the Blessed One: \"Venerable sir, our brother, Prince Cunda, says this: 'Whoever, be it a woman or a man, has gone for refuge to the Buddha, to the Dhamma, and to the Saṅgha; who abstains from the destruction of life, from taking what is not given, from misconduct in sensual pleasures, from false speech, and from consuming intoxicants that lead to heedlessness – such a one, upon the breakup of the body, after death, reappears in a good destination, never in a bad destination.'\" \"Venerable sir, I ask the Blessed One: 'Having confidence in what kind of teacher, venerable sir, does one, upon the breakup of the body, after death, reappear in a good destination, never in a bad destination? Having confidence in what kind of Dhamma does one, upon the breakup of the body, after death, reappear in a good destination, never in a bad destination? Having confidence in what kind of Saṅgha does one, upon the breakup of the body, after death, reappear in a good destination, never in a bad destination? Having fully completed what kind of virtues does one, upon the breakup of the body, after death, reappear in a good destination, never in a bad destination?'\"\n\n\"Cundī, among all beings – whether footless, two-footed, four-footed, or many-footed; with form or formless; percipient, non-percipient, or neither percipient nor non-percipient – the Tathāgata, the Arahant, the Perfectly Self-Awakened One, is declared to be the foremost. Those, Cundī, who have confidence in the Buddha, they have confidence in the foremost. For those who have confidence in the foremost, the foremost result ensues.\n\n\"Cundī, among all conditioned phenomena, the Noble Eightfold Path is declared to be the foremost. Those, Cundī, who have confidence in the Noble Eightfold Path, they have confidence in the foremost. For those who have confidence in the foremost, the foremost result ensues.\n\n\"Cundī, among all phenomena, whether conditioned or unconditioned, dispassion is declared to be the foremost. That is to say, the subduing of intoxication, the removal of thirst, the uprooting of attachment, the cutting off of the cycle of existence, the destruction of craving, dispassion, cessation, Nibbāna. Those, Cundī, who have confidence in this foremost phenomenon of dispassion, they have confidence in the foremost. For those who have confidence in the foremost, the foremost result ensues.\n\n\"Cundī, among all assemblies or groups, the Saṅgha of the Tathāgata's disciples is declared to be the foremost. That is to say, the four pairs of noble persons, the eight individual noble persons – this Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and is the unsurpassable field of merit for the world. Those, Cundī, who have confidence in the Saṅgha, they have confidence in the foremost. For those who have confidence in the foremost, the foremost result ensues.\n\n\"Cundī, among all virtues, the virtues dear to the noble ones are declared to be the foremost. That is to say, they are unbroken, unblemished, unspotted, untarnished, freeing, praised by the wise, untainted by craving, and conducive to concentration. Those, Cundī, who fully complete these virtues dear to the noble ones, they are the foremost in their completion. For those who are foremost in their completion, the foremost result ensues.\"\n\nFor those with confidence in the foremost, who know the foremost Dhamma;\nFor those with confidence in the foremost Buddha, the unsurpassed worthy of offerings;\nFor those with confidence in the foremost Dhamma, which is dispassion, peace, and happiness;\nFor those with confidence in the foremost Saṅgha, the unsurpassable field of merit;\nBy giving gifts in the foremost, foremost merit proliferates;\nForemost life, beauty, fame, renown, happiness, and strength.\nThe wise giver of the foremost, established in the foremost Dhamma,\nWhether born as a deity or a human, rejoices, having attained the foremost.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දකනිවාප නම් ස්ථානයේ වාසය කළ සේක. ඉක්බිති චුන්දි නම් රාජකුමාරිකාව රථ පන්සියයකින්ද, කුමාරිකාවන් පන්සියයකින්ද පිරිවරා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියාය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූවාය. එක් පසෙකින් වාඩි වී සිටි චුන්දි රාජකුමාරිකාව භාග්‍යවතුන් වහන්සේට මෙය පැවසුවාය: \"ස්වාමීනි, අපගේ චුන්ද නම් රාජකුමාරයා මෙසේ කියයි: ‘යම් ස්ත්‍රියක් හෝ පුරුෂයෙක් බුදුන් සරණ ගියේ නම්, ධර්මය සරණ ගියේ නම්, සංඝයා සරණ ගියේ නම්, ප්‍රාණඝාතයෙන් වැළකුණේ නම්, අදත්තාදානයෙන් වැළකුණේ නම්, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණේ නම්, මුසාවාදයෙන් වැළකුණේ නම්, සුරා මේරය මද ප්‍රමාදයට හේතුවන දේවලින් වැළකුණේ නම්, හෙතෙම කය බිඳීමෙන් මරණින් මතු සුගතියෙහිම උපදී, දුගතියෙහි නොවේය’යි. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේගෙන් මෙසේ අසමි: ‘ස්වාමීනි, කවර ගුණ ඇති ශාස්තෘවරයෙකු කෙරෙහි ප්‍රසන්න වූවෙක් කය බිඳීමෙන් මරණින් මතු සුගතියෙහිම උපදීද, දුගතියෙහි නොවේද? කවර ගුණ ඇති ධර්මයක් කෙරෙහි ප්‍රසන්න වූවෙක් කය බිඳීමෙන් මරණින් මතු සුගතියෙහිම උපදීද, දුගතියෙහි නොවේද? කවර ගුණ ඇති සංඝයා කෙරෙහි ප්‍රසන්න වූවෙක් කය බිඳීමෙන් මරණින් මතු සුගතියෙහිම උපදීද, දුගතියෙහි නොවේද? කවර ගුණ ඇති ශීලයන්හි සම්පූර්ණව හැසිරෙන්නෙක් කය බිඳීමෙන් මරණින් මතු සුගතියෙහිම උපදීද, දුගතියෙහි නොවේද?’\"\n\n\"චුන්දි, පාද රහිත වූ හෝ, දෙපා ඇති හෝ, සිව්පා ඇති හෝ, බොහෝ පා ඇති හෝ, රූපී වූ හෝ, අරූපී වූ හෝ, සඥ්ඥා ඇති හෝ, අඥ්ඥා ඇති හෝ, නේවසඥ්ඥානාසඥ්ඥා ඇති හෝ යම්තාක් සත්වයෝ ඇත්ද, ඔවුන් අතුරින් අරහත් සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේ අග්‍රතම යයි කියනු ලැබේ. චුන්දි, යම් කෙනෙක් බුදුරදුන් කෙරෙහි ප්‍රසන්න වෙත්ද, ඔවුහු අග්‍රතම තැනක ප්‍රසන්න වෙති. අග්‍රතම තැනක ප්‍රසන්න වූවන්ට අග්‍රතම විපාකයක්ම වේ.\n\nචුන්දි, යම්තාක් සංඛත ධර්මයෝ ඇත්ද, ඒ සියල්ල අතුරින් ආර්ය අෂ්ටාංගික මාර්ගය අග්‍රතම යයි කියනු ලැබේ. චුන්දි, යම් කෙනෙක් ආර්ය අෂ්ටාංගික මාර්ගය කෙරෙහි ප්‍රසන්න වෙත්ද, ඔවුහු අග්‍රතම තැනක ප්‍රසන්න වෙති. අග්‍රතම තැනක ප්‍රසන්න වූවන්ට අග්‍රතම විපාකයක්ම වේ.\n\nචුන්දි, යම්තාක් සංඛත හෝ අසංඛත ධර්මයෝ ඇත්ද, ඒ සියල්ල අතුරින් විරාගය අග්‍රතම යයි කියනු ලැබේ. එනම්: මදමර්දනය, තෘෂ්ණා සංසිඳවීම, ආලය සමුච්ඡේදනය, වට්ටය නැතිකිරීම, තණ්හාව ක්ෂය කිරීම, රාගයෙන් වෙන්වීම, නිරෝධය, නිවනයි. චුන්දි, යම් කෙනෙක් විරාග ධර්මය කෙරෙහි ප්‍රසන්න වෙත්ද, ඔවුහු අග්‍රතම තැනක ප්‍රසන්න වෙති. අග්‍රතම තැනක ප්‍රසන්න වූවන්ට අග්‍රතම විපාකයක්ම වේ.\n\nචුන්දි, යම්තාක් සංඝයෝ හෝ සමූහයෝ ඇත්ද, ඒ සියල්ල අතුරින් තථාගත ශ්‍රාවක සංඝයා අග්‍රතම යයි කියනු ලැබේ. එනම්: සතර පුරිස යුගල වශයෙන්, අට මහා පුරිස පුද්ගල වශයෙන් වූ, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ආහුණෙය්‍ය (දුර සිට ගෙනෙන දීමනා පිළිගැනීමට සුදුසු), පාහුණෙය්‍ය (සංඝයා වෙත එන අමුත්තන් පිළිගැනීමට සුදුසු), දක්ඛිණෙය්‍ය (දක්ෂිණා දීමට සුදුසු), අඤ්ජලිකරණීය (දෑත් එකතු කර වන්දනා කිරීමට සුදුසු), ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයයි. චුන්දි, යම් කෙනෙක් සංඝයා කෙරෙහි ප්‍රසන්න වෙත්ද, ඔවුහු අග්‍රතම තැනක ප්‍රසන්න වෙති. අග්‍රතම තැනක ප්‍රසන්න වූවන්ට අග්‍රතම විපාකයක්ම වේ.\n\nචුන්දි, යම්තාක් ශීලයන් ඇත්ද, ඒ සියල්ල අතුරින් ආර්යකාන්ත ශීලයන් අග්‍රතම යයි කියනු ලැබේ. එනම්: අඛණ්ඩ වූ, ඡිද්‍ර රහිත වූ, ශබල රහිත වූ, කල්මෂ රහිත වූ, නිදහස් වූ, විඥ්ඥයන් විසින් ප්‍රශංසා කරන ලද, තණ්හා-දිට්ඨි පරාමර්ශයෙන් තොර වූ, සමාධිය පිණිස පවත්නා වූ ශීලයන්ය. චුන්දි, යම් කෙනෙක් ආර්යකාන්ත ශීලයන්හි සම්පූර්ණව හැසිරෙත්ද, ඔවුහු අග්‍රතම තැනක සම්පූර්ණව හැසිරෙන්නෝ වෙති. අග්‍රතම තැනක සම්පූර්ණව හැසිරෙන්නන්ට අග්‍රතම විපාකයක්ම වේ.\"\n\nඅග්‍රතම වූ බුදුන් කෙරෙහි, අනුත්තර වූ දක්ෂිණාර්හයන් කෙරෙහි,\nඅග්‍රතම ධර්මය දන්නා වූ, අග්‍රතමයන් කෙරෙහි ප්‍රසන්න වූවන්ට,\nවිරාගයෙන් උපශමය වන සුඛය ඇති අග්‍රතම ධර්මය කෙරෙහි ප්‍රසන්න වූවන්ට,\nලෝකයේ අනුත්තර පුණ්‍යක්ෂේත්‍රය වූ අග්‍රතම සංඝයා කෙරෙහි ප්‍රසන්න වූවන්ට,\nඅග්‍රතම වස්තුවන් දන් දෙන්නන්ට, අග්‍රතම පින් වැඩේ.\nඅග්‍රතම වූ ආයුෂද, වර්ණයද, යසසද, කීර්තියද, සැපයද, බලයද ලැබේ.\nප්‍රඥාවන්ත වූ, අග්‍රතම ධර්මයෙන් යුක්ත වූ, අග්‍රතම දානය දෙන්නා,\nදෙවියකු වී හෝ මිනිසකු වී හෝ, අග්‍රතම තත්ත්වයට පත්ව, සතුටු වෙයි.",
      "paliTitle": "Cundīsuttaṃ",
      "englishTitle": "Princess Cundī Sutta",
      "sinhalaTitle": "චුන්දී සූත්‍රය"
    },
    {
      "number": 33,
      "pali": "Ekaṃ samayaṃ bhagavā bhaddiye viharati jātiyā vane. Atha kho uggaho meṇḍakanattā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uggaho meṇḍakanattā bhagavantaṃ etadavoca – ‘‘Adhivāsetu me, bhante, bhagavā svātanāya attacatuttho bhatta’’nti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho uggaho meṇḍakanattā bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena uggahassa meṇḍakanattuno nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho uggaho meṇḍakanattā bhagavantaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho uggaho meṇḍakanattā bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uggaho meṇḍakanattā bhagavantaṃ etadavoca – ‘‘imā me, bhante, kumāriyo patikulāni gamissanti. Ovadatu tāsaṃ, bhante, bhagavā; anusāsatu tāsaṃ, bhante, bhagavā, yaṃ tāsaṃ assa dīgharattaṃ hitāya sukhāyā’’ti. Atha kho bhagavā tā kumāriyo etadavoca – ‘‘tasmātiha, kumāriyo, evaṃ sikkhitabbaṃ – ‘yassa vo [yassa kho (sī. syā. kaṃ.)] mātāpitaro bhattuno dassanti atthakāmā hitesino anukampakā anukampaṃ upādāya, tassa bhavissāma pubbuṭṭhāyiniyo pacchānipātiniyo kiṃkārapaṭissāviniyo manāpacāriniyo piyavādiniyo’ti. Evañhi vo, kumāriyo, sikkhitabbaṃ. ‘‘Tasmātiha, kumāriyo, evaṃ sikkhitabbaṃ – ‘ye te bhattu garuno [guruno (ka.)] bhavissanti mātāti vā pitāti vā samaṇabrāhmaṇāti vā, te sakkarissāma garuṃ karissāma [garukarissāma (sī. syā. kaṃ. pī.)] mānessāma pūjessāma abbhāgate ca āsanodakena paṭipūjessāmā’ti [pūjessāmāti (sī.)]. Evañhi vo, kumāriyo, sikkhitabbaṃ. ‘‘Tasmātiha, kumāriyo, evaṃ sikkhitabbaṃ – ‘ye te bhattu abbhantarā kammantā uṇṇāti vā kappāsāti vā, tattha dakkhā bhavissāma analasā, tatrupāyāya vīmaṃsāya samannāgatā, alaṃ kātuṃ alaṃ saṃvidhātu’nti. Evañhi vo, kumāriyo, sikkhitabbaṃ. ‘‘Tasmātiha, kumāriyo, evaṃ sikkhitabbaṃ – ‘yo so bhattu abbhantaro [abbhantare (ka.)] antojano dāsāti vā pessāti vā kammakarāti vā, tesaṃ katañca katato jānissāma akatañca akatato jānissāma, gilānakānañca balābalaṃ jānissāma, khādanīyaṃ bhojanīyañcassa paccaṃsena [paccayaṃ tena (ka. sī.), paccayaṃsena (syā. kaṃ.), paccayaṃ senāsanaṃ paccattaṃsena (ka.) a. ni. 8.46] saṃvibhajissāmā’ti [vibhajissāmāti (sī. syā. kaṃ.)]. Evañhi vo, kumāriyo, sikkhitabbaṃ. ‘‘Tasmātiha, kumāriyo, evaṃ sikkhitabbaṃ – ‘yaṃ bhattā āharissati dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā, taṃ ārakkhena [taṃ ārakkhāya (sī.)] guttiyā sampādessāma, tattha ca bhavissāma adhuttī athenī asoṇḍī avināsikāyo’ti. Evañhi vo, kumāriyo, sikkhitabbaṃ. Imehi kho, kumāriyo, pañcahi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā manāpakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. ‘‘Yo naṃ bharati sabbadā, niccaṃ ātāpi ussuko; Sabbakāmaharaṃ posaṃ, bhattāraṃ nātimaññati. ‘‘Na cāpi sotthi bhattāraṃ, issācārena [icchācārena (sī.), issāvādena (pī.)] rosaye; Bhattu ca garuno sabbe, paṭipūjeti paṇḍitā. ‘‘Uṭṭhāhikā [uṭṭhāyikā (syā. kaṃ. ka.)] analasā, saṅgahitaparijjanā; Bhattu manāpaṃ [manāpā (sī.)] carati, sambhataṃ anurakkhati. ‘‘Yā evaṃ vattatī nārī, bhattuchandavasānugā; Manāpā nāma te devā, yattha sā upapajjatī’’ti. tatiyaṃ;",
      "english": "At one time, the Blessed One was staying in the Jātiya Grove near Bhaddiya. Then Uggaha, the grandson of Mendaka, went to the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, Uggaha, the grandson of Mendaka, said to the Blessed One: “Venerable sir, may the Blessed One accept tomorrow’s meal from me, with four in total.” The Blessed One accepted by remaining silent. Then Uggaha, the grandson of Mendaka, understanding that the Blessed One had accepted, rose from his seat, paid homage to the Blessed One, circumambulated him respectfully, and departed.\n\nThen, when that night had passed, in the morning, the Blessed One dressed, took his bowl and robes, and went to the residence of Uggaha, the grandson of Mendaka; having arrived, he sat down on the seat prepared for him. Then Uggaha, the grandson of Mendaka, personally satisfied and delighted the Blessed One with exquisite hard and soft food. Then, when the Blessed One had finished eating and had removed his hand from the bowl, Uggaha, the grandson of Mendaka, sat down to one side. Seated to one side, Uggaha, the grandson of Mendaka, said to the Blessed One: “Venerable sir, these daughters of mine will be going to their husbands’ families. Venerable sir, may the Blessed One advise them; may the Blessed One instruct them, for their long-term welfare and happiness.”\n\nThen the Blessed One said to those daughters: “Therefore, daughters, you should train yourselves in this way: ‘Whomever your parents, desiring your welfare, seeking your benefit, out of compassion, give to you as a husband, for him we will be early risers, late to retire, eager to please, acting pleasantly, and speaking kindly.’ Indeed, daughters, you should train yourselves in this way.\n\n“Therefore, daughters, you should train yourselves in this way: ‘Whomever among your husband’s respected ones there may be—whether his mother or father, or monastics or Brahmins—we will honor, respect, revere, and venerate them, and we will honor guests with seats and water.’ Indeed, daughters, you should train yourselves in this way.\n\n“Therefore, daughters, you should train yourselves in this way: ‘Whatever domestic tasks of the husband there may be—whether involving wool or cotton—therein we will be diligent and not lazy, endowed with skill and discretion regarding them, capable of doing and organizing.’ Indeed, daughters, you should train yourselves in this way.\n\n“Therefore, daughters, you should train yourselves in this way: ‘Regarding the husband’s domestic staff, whether they are servants, employees, or workers, we will know what is done as done and what is not done as not done; we will know the strength and weakness of the sick; and we will distribute food and drink to them proportionally.’ Indeed, daughters, you should train yourselves in this way.\n\n“Therefore, daughters, you should train yourselves in this way: ‘Whatever wealth the husband brings home—whether money, grain, silver, or gold—we will preserve it with care and protection, and concerning it we will be not wasteful, not a thief, not a drunkard, and not a squanderer.’ Indeed, daughters, you should train yourselves in this way.\n\n“Indeed, daughters, a woman endowed with these five qualities, upon the breaking up of the body, after death, reappears in the company of the devas of the Mind-Delightful Realm.”\n\nWhoever always supports her, ever ardent and diligent;\nDoes not disrespect her husband, the man who provides all her needs.\nNor does she angrily vex her husband with jealous behavior;\nAnd the wise woman venerates all of her husband’s respected ones.\nDiligent and not lazy, she looks after the household staff;\nShe acts in a way pleasing to her husband, and she protects what has been gathered.\nThe woman who conducts herself in this way, conforming to her husband’s wishes;\nReappears among those devas known as the Mind-Delightful.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ භද්දිය නම් ජාතියාවනයෙහි වැඩවසන සේක. එවිට මැඬකපුත්‍ර උග්ගහ ගෘහපති භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙක හිඳගත්තේය. එකත්පසෙක හිඳගත් මැඬකපුත්‍ර උග්ගහ ගෘහපති භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීන් වහන්ස, භාග්‍යවතුන් වහන්සේ හෙට දවස සඳහා සතරවෙනියා ලෙස මා සමඟ දානය පිළිගැනීමට අධිවාසනා කළ මැනව.” භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දවම අධිවාසනා කළ සේක. ඉක්බිති මැඬකපුත්‍ර උග්ගහ ගෘහපති භාග්‍යවතුන් වහන්සේගේ අධිවාසනාව දැන, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කර, පැදකුණු කොට නික්ම ගියේය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ එම රාත්‍රිය ගෙවී පහන් වූ පසු පෙරවරුවෙහි සිවුරු පොරවා පාත්‍ර සිවුරු රැගෙන මැඬකපුත්‍ර උග්ගහ ගෘහපතිගේ නිවස වෙත වැඩිය සේක. එහි වැඩමවා පනවන ලද අසුනෙහි වැඩසිටි සේක. එවිට මැඬකපුත්‍ර උග්ගහ ගෘහපති භාග්‍යවතුන් වහන්සේට ප්‍රණීත වූ කැවිලි පෙවිලි සහ භෝජන වර්ග තමාම අතින් පිළිගන්වා සන්තර්පණය කළේය, පිරිපුන් කළේය. ඉක්බිති මැඬකපුත්‍ර උග්ගහ ගෘහපති භාග්‍යවතුන් වහන්සේ දන් වළඳා, පාත්‍රය පහත තැබූ කල්හි, එකත්පසෙක හිඳගත්තේය. එකත්පසෙක හිඳගත් මැඬකපුත්‍ර උග්ගහ ගෘහපති භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීන් වහන්ස, මාගේ මේ කුමාරිකාවෝ ස්වාමි ගෙවල්වලට යන්නට සිටිති. ස්වාමීන් වහන්ස, භාග්‍යවතුන් වහන්සේ ඔවුන්ට අවවාද කළ මැනව; ස්වාමීන් වහන්ස, භාග්‍යවතුන් වහන්සේ ඔවුන්ට අනුශාසනා කළ මැනව, එය ඔවුන්ට බොහෝ කලක් හිතසුව පිණිස වන්නේය.”\n\nඑවිට භාග්‍යවතුන් වහන්සේ එම කුමාරිකාවන්ට මෙසේ වදාළ සේක: “එබැවින් කුමාරිකාවනි, මෙසේ හික්මිය යුතුය: ‘කවර ස්වාමිපුරුෂයකුට හෝ අපගේ මව්පියන් අර්ථකාමීව, හිතෛෂීව, අනුකම්පාවෙන් යුතුව අනුකම්පාව උපදවා දෙන්නේද, අපි ඔහුට පෙර අවදිවන්නෝද, පසුව නින්දට යන්නෝද, කුමක්ද කළ යුත්තේ යැයි විමසන විට පිළිවදන් දෙන්නෝද, මනාපයෙන් හැසිරෙන්නෝද, ප්‍රිය වචන කථා කරන්නෝද වන්නෙමු’ කියාය. කුමාරිකාවනි, මෙසේ නුඹලා හික්මිය යුතුය.\n\n“එබැවින් කුමාරිකාවනි, මෙසේ හික්මිය යුතුය: ‘ස්වාමිපුරුෂයාට ගුරුතැන්හි සිටින මව්පියන් හෝ ශ්‍රමණ බ්‍රාහ්මණයන් හෝ කවරහු වෙත්ද, ඔවුන්ට අපි සත්කාර කරන්නෙමු, ගෞරව කරන්නෙමු, අගය කරන්නෙමු, පුද පූජා කරන්නෙමු, පැමිණෙන අමුත්තන්ට අසුන් හා ජලයෙන් උපචාර කරන්නෙමු’ කියාය. කුමාරිකාවනි, මෙසේ නුඹලා හික්මිය යුතුය.\n\n“එබැවින් කුමාරිකාවනි, මෙසේ හික්මිය යුතුය: ‘ස්වාමිපුරුෂයාගේ යම් ඇතුළාන්ත කර්මාන්ත ඇද්ද, එනම් ලොම් වැඩ හෝ පුළුන් වැඩ හෝ වේවා, ඒ කර්මාන්තයන්හි අපි දක්ෂ වන්නෙමු, කම්මැලි නොවන්නෙමු, ඒ සඳහා උපායශීලී වී විමසීම් සහිත වන්නෙමු, සියල්ල මනාව කිරීමටත්, මනාව සංවිධානය කිරීමටත් සමත් වන්නෙමු’ කියාය. කුමාරිකාවනි, මෙසේ නුඹලා හික්මිය යුතුය.\n\n“එබැවින් කුමාරිකාවනි, මෙසේ හික්මිය යුතුය: ‘ස්වාමිපුරුෂයාගේ යම් ගෘහය තුළ සිටින දාසයන් හෝ සේවකයන් හෝ කම්කරුවන් ඇත්නම්, ඔවුන් විසින් කරන ලද්දද, කරන ලද්දක් ලෙස අපි දන්නෙමු; නොකරන ලද්දද, නොකරන ලද්දක් ලෙස අපි දන්නෙමු; ගිලනුන්ගේ ශක්තිමත් බව හා දුර්වල බවද අපි දන්නෙමු; ඔවුන්ට ආහාරපාන නිසි කොටස් වශයෙන් බෙදා දෙන්නෙමු’ කියාය. කුමාරිකාවනි, මෙසේ නුඹලා හික්මිය යුතුය.\n\n“එබැවින් කුමාරිකාවනි, මෙසේ හික්මිය යුතුය: ‘ස්වාමිපුරුෂයා විසින් ගෙනෙන යම් ධනයක් හෝ ධාන්‍යයක් හෝ රිදී හෝ රන් හෝ ඇද්ද, එය ආරක්ෂාවෙන් යුතුව, ආරක්‍ෂා කරමින් පවත්වාගෙන යන්නෙමු; එහිදී අපි සූදු කෙළින්නියන් නොවන්නෙමු, සොරකම් කරන්නියන් නොවන්නෙමු, සුරාපානය කරන්නියන් නොවන්නෙමු, විනාශ කරන්නියන් නොවන්නෙමු’ කියාය. කුමාරිකාවනි, මෙසේ නුඹලා හික්මිය යුතුය.\n\n“කුමාරිකාවනි, මේ පස්වැදෑරුම් ධර්මයන්ගෙන් සමන්විත ස්ත්‍රියක්, ශරීරය බිඳී මරණයෙන් පසු මනාපකායික නම් දෙවියන්ගේ සහභාගිත්වයට උපදී.”\n\n“යම් ස්ත්‍රියක් තමා නිරන්තරයෙන් පෝෂණය කරන, සැමවිටම වීර්යවන්ත වූ, උත්සාහවත් වූ, සියලු යහපත් දේ සලසා දෙන ස්වාමිපුරුෂයාට අවමන් නොකරයිද,\n\nතවද යම් පණ්ඩිත ස්ත්‍රියක් ඊර්ෂ්‍යා සහගත ක්‍රියාවලින් හෝ වචනවලින් ස්වාමිපුරුෂයා කිපවන්නේ නැත්ද, ස්වාමිපුරුෂයාගේ සියලු ගුරුතැන්හි සිටින වැඩිහිටියන්ට පුද සත්කාර කරන්නේද,\n\nඇය උත්සාහවත්ය, අලස නැත, පිරිස එක්රැස් කරගත් තැනැත්තියකි, ස්වාමිපුරුෂයාට ප්‍රිය උපදවන අයුරින් හැසිරෙයි, උපයාගත් දේ ආරක්ෂා කරයි.\n\nයම් ස්ත්‍රියක් මෙසේ ස්වාමිපුරුෂයාගේ කැමැත්තට අනුව හැසිරෙන්නේද, ඇය උපදින්නේ මනාප නම් දෙවියන් අතරය.”",
      "paliTitle": "Uggahasuttaṃ",
      "englishTitle": "The Discourse to Uggaha",
      "sinhalaTitle": "උග්ගහ සූත්‍රය"
    },
    {
      "number": 34,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho sīho senāpati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sīho senāpati bhagavantaṃ etadavoca – ‘‘sakkā nu kho, bhante, bhagavā sandiṭṭhikaṃ dānaphalaṃ paññāpetu’’nti? ‘‘Sakkā, sīhā’’ti bhagavā avoca – ‘‘dāyako, sīha, dānapati bahuno janassa piyo hoti manāpo. Yampi, sīha, dāyako dānapati bahuno janassa piyo hoti manāpo, idampi sandiṭṭhikaṃ dānaphalaṃ. ‘‘Puna caparaṃ, sīha, dāyakaṃ dānapatiṃ santo sappurisā bhajanti. Yampi, sīha, dāyakaṃ dānapatiṃ santo sappurisā bhajanti, idampi sandiṭṭhikaṃ dānaphalaṃ. ‘‘Puna caparaṃ, sīha, dāyakassa dānapatino kalyāṇo kittisaddo abbhuggacchati. Yampi, sīha, dāyakassa dānapatino kalyāṇo kittisaddo abbhuggacchati, idampi sandiṭṭhikaṃ dānaphalaṃ. ‘‘Puna caparaṃ, sīha, dāyako dānapati yaṃ yadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ – visārado [visāradova (sī.) a. ni. 7.57 passitabbaṃ] upasaṅkamati amaṅkubhūto. Yampi, sīha, dāyako dānapati yaṃ yadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ – visārado upasaṅkamati amaṅkubhūto, idampi sandiṭṭhikaṃ dānaphalaṃ. ‘‘Puna caparaṃ, sīha, dāyako dānapati kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Yampi, sīha, dāyako dānapati kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati, idaṃ [idampi sīha (ka.)] samparāyikaṃ dānaphala’’nti. Evaṃ vutte sīho senāpati bhagavantaṃ etadavoca – ‘‘yānimāni, bhante, bhagavatā cattāri sandiṭṭhikāni dānaphalāni akkhātāni, nāhaṃ ettha bhagavato saddhāya gacchāmi; ahaṃ petāni jānāmi. Ahaṃ, bhante, dāyako dānapati bahuno janassa piyo manāpo. Ahaṃ, bhante, dāyako dānapati; maṃ santo sappurisā bhajanti. Ahaṃ, bhante, dāyako dānapati; mayhaṃ kalyāṇo kittisaddo abbhuggato – ‘sīho senāpati dāyako kārako saṅghupaṭṭhāko’ti. Ahaṃ, bhante, dāyako dānapati yaṃ yadeva parisaṃ upasaṅkamāmi – yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ – visārado upasaṅkamāmi amaṅkubhūto. Yānimāni, bhante, bhagavatā cattāri sandiṭṭhikāni dānaphalāni akkhātāni, nāhaṃ ettha bhagavato saddhāya gacchāmi; ahaṃ petāni jānāmi. Yañca kho maṃ, bhante, bhagavā evamāha – ‘dāyako, sīha, dānapati kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’ti, etāhaṃ na jānāmi; ettha ca panāhaṃ bhagavato saddhāya gacchāmī’’ti. ‘‘Evametaṃ, sīha, evametaṃ, sīha! Dāyako dānapati kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjatī’’ti. ‘‘Dadaṃ piyo hoti bhajanti naṃ bahū, Kittiñca pappoti yaso ca vaḍḍhati [yasassa vaḍḍhati (syā. kaṃ.), yasaṃ pavaḍḍhati (ka.)]; Amaṅkubhūto parisaṃ vigāhati, Visārado hoti naro amaccharī. ‘‘Tasmā hi dānāni dadanti paṇḍitā, Vineyya maccheramalaṃ sukhesino; Te dīgharattaṃ tidive patiṭṭhitā, Devānaṃ sahabyagatā ramanti te [sahabyataṃ gatā ramanti (sī.), sahabyatā ramanti te (ka.)]. ‘‘Katāvakāsā katakusalā ito cutā [tato cutā (sī.)], Sayaṃpabhā anuvicaranti nandanaṃ [nandane (syā. kaṃ.)]; Te tattha nandanti ramanti modare, Samappitā kāmaguṇehi pañcahi; ‘‘Katvāna vākyaṃ asitassa tādino, Ramanti sagge [ramanti sumanā (ka.), kamanti sabbe (syā. kaṃ.)] sugatassa sāvakā’’ti. catutthaṃ;",
      "english": "On one occasion, the Blessed One was dwelling in Vesālī, in the Great Wood, in the Gabled Hall. Thereupon, Sīha the general approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. While seated to one side, Sīha the general said to the Blessed One: “Is it possible, venerable sir, for the Blessed One to declare a visible result of giving?”\n\n\"It is possible, Sīha,\" the Blessed One said. \"A giver, Sīha, a master of giving, is dear and pleasing to many people. That, Sīha, a giver, a master of giving, is dear and pleasing to many people—this too is a visible result of giving.\n\n\"Furthermore, Sīha, a giver, a master of giving, is associated with by good and virtuous people. That, Sīha, a giver, a master of giving, is associated with by good and virtuous people—this too is a visible result of giving.\n\n\"Furthermore, Sīha, a good reputation spreads abroad for a giver, a master of giving. That, Sīha, a good reputation spreads abroad for a giver, a master of giving—this too is a visible result of giving.\n\n\"Furthermore, Sīha, a giver, a master of giving, whatever assembly he approaches—whether an assembly of nobles, an assembly of brahmins, an assembly of householders, or an assembly of ascetics—he approaches confidently and unperplexed. That, Sīha, a giver, a master of giving, whatever assembly he approaches—whether an assembly of nobles, an assembly of brahmins, an assembly of householders, or an assembly of ascetics—he approaches confidently and unperplexed—this too is a visible result of giving.\n\n\"Furthermore, Sīha, a giver, a master of giving, with the breaking up of the body, after death, reappears in a good destination, a heavenly world. That, Sīha, a giver, a master of giving, with the breaking up of the body, after death, reappears in a good destination, a heavenly world—this is a post-mortem result of giving.\"\n\nWhen this was said, Sīha the general said to the Blessed One: \"Venerable sir, regarding these four visible results of giving declared by the Blessed One, I do not go by the Blessed One's faith; I myself know them. I, venerable sir, am a giver, a master of giving, dear and pleasing to many people. I, venerable sir, am a giver, a master of giving; good and virtuous people associate with me. I, venerable sir, am a giver, a master of giving; a good reputation has spread abroad for me—'Sīha the general is a giver, a doer of good, a supporter of the Sangha.' I, venerable sir, am a giver, a master of giving; whatever assembly I approach—whether an assembly of nobles, an assembly of brahmins, an assembly of householders, or an assembly of ascetics—I approach confidently and unperplexed. Regarding these four visible results of giving declared by the Blessed One, I do not go by the Blessed One's faith; I myself know them. But what the Blessed One said to me, venerable sir: 'A giver, Sīha, a master of giving, with the breaking up of the body, after death, reappears in a good destination, a heavenly world'—that I do not know, and concerning this, I go by the Blessed One's faith.\"\n\n\"It is so, Sīha, it is so, Sīha! A giver, a master of giving, with the breaking up of the body, after death, reappears in a good destination, a heavenly world.\"\n\n\"One who gives becomes dear, many associate with them.\nThey gain fame and glory increases.\nUnperplexed, one enters an assembly;\nA person free from stinginess is confident.\n\nTherefore, the wise indeed give donations,\nHaving overcome the stain of stinginess, seeking happiness.\nFor a long time, established in the heavens,\nHaving gone to the companionship of devas, they rejoice.\n\nHaving made their opportunity, having done good deeds, departed from here,\nSelf-luminous they wander about in Nandana.\nThey delight there, they rejoice, they are gladdened,\nEndowed with the five strands of sensual pleasure.\n\nHaving done the word of the unshakeable, the Such One,\nThe disciples of the Fortunate One rejoice in heaven.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෛශාලියෙහි මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩවසන සේක. ඉන්පසු සේනාපති සිංහ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක හුන්නේය. එකත්පසෙක හුන් සේනාපති සිංහ භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භාග්‍යවතුන් වහන්ස, මේ භවයෙහිදීම දැකිය හැකි දාන ඵලයක් ප්‍රකාශ කරන්නට හැකිද?\" \"සිංහය, පුළුවනැ\"යි භාග්‍යවතුන් වහන්සේ පැවසූ සේක. \"සිංහය, දායක දානපතියා බොහෝ දෙනාට ප්‍රිය වෙයි, මනාප වෙයි. සිංහය, දායක දානපතියා බොහෝ දෙනාට ප්‍රියව මනාප වීමද, මෙය මේ භවයේදීම දැකිය හැකි දාන ඵලයකි.\n\n\"තවද සිංහය, සත්පුරුෂයෝ දායක දානපතියා ඇසුරු කරති. සිංහය, සත්පුරුෂයෝ දායක දානපතියා ඇසුරු කිරීමද, මෙය මේ භවයේදීම දැකිය හැකි දාන ඵලයකි.\n\n\"තවද සිංහය, දායක දානපතියාගේ යහපත් කීර්ති රාවය පැතිරෙයි. සිංහය, දායක දානපතියාගේ යහපත් කීර්ති රාවය පැතිරීමද, මෙය මේ භවයේදීම දැකිය හැකි දාන ඵලයකි.\n\n\"තවද සිංහය, දායක දානපතියා ක්ෂත්‍රිය පිරිසක් වෙත වේවා, බ්‍රාහ්මණ පිරිසක් වෙත වේවා, ගෘහපති පිරිසක් වෙත වේවා, ශ්‍රමණ පිරිසක් වෙත වේවා, යම් යම් පිරිසක් වෙත එළඹෙන්නේ නිර්භීතව, නොකිපුණු සිත් ඇතිවය. සිංහය, දායක දානපතියා ක්ෂත්‍රිය පිරිසක් වෙත වේවා, බ්‍රාහ්මණ පිරිසක් වෙත වේවා, ගෘහපති පිරිසක් වෙත වේවා, ශ්‍රමණ පිරිසක් වෙත වේවා, යම් යම් පිරිසක් වෙත නිර්භීතව, නොකිපුණු සිත් ඇතිව එළඹීමද, මෙය මේ භවයේදීම දැකිය හැකි දාන ඵලයකි.\n\n\"තවද සිංහය, දායක දානපතියා කය බිඳී මරණින් මතු සුගතිගාමී වෙයි, ස්වර්ග ලෝකයට උපදී. සිංහය, දායක දානපතියා කය බිඳී මරණින් මතු සුගතිගාමී වී ස්වර්ග ලෝකයට උපදින්නේද, මෙය පරලොවදී ලැබෙන දාන ඵලයකි.\"\n\nමෙසේ පැවසූ කල්හි සේනාපති සිංහ භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද මේ දැකිය හැකි දාන ඵල සතර පිළිබඳව මම භාග්‍යවතුන් වහන්සේගේ වචනය මත පමණක් විශ්වාස නොකරමි; මම මේවා පෞද්ගලිකවම දනිමි. භාග්‍යවතුන් වහන්ස, මම දායක දානපතියෙක් වෙමි, බොහෝ දෙනාට ප්‍රිය වෙමි, මනාප වෙමි. භාග්‍යවතුන් වහන්ස, මම දායක දානපතියෙක් වෙමි; මා සත්පුරුෂයෝ ඇසුරු කරති. භාග්‍යවතුන් වහන්ස, මම දායක දානපතියෙක් වෙමි; 'සේනාපති සිංහ දායකයෙකි, උපකාර කරන්නෙකි, සංඝයා වහන්සේලාට උපස්ථාන කරන්නෙකි' යනුවෙන් මාගේ යහපත් කීර්ති රාවය පැතිරී ඇත. භාග්‍යවතුන් වහන්ස, මම දායක දානපතියෙක් වෙමි; ක්ෂත්‍රිය පිරිසක් වෙත වේවා, බ්‍රාහ්මණ පිරිසක් වෙත වේවා, ගෘහපති පිරිසක් වෙත වේවා, ශ්‍රමණ පිරිසක් වෙත වේවා, යම් යම් පිරිසක් වෙත එළඹෙන්නේ නිර්භීතව, නොකිපුණු සිත් ඇතිවය. භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද මේ දැකිය හැකි දාන ඵල සතර පිළිබඳව මම භාග්‍යවතුන් වහන්සේගේ වචනය මත පමණක් විශ්වාස නොකරමි; මම මේවා පෞද්ගලිකවම දනිමි. නමුත් භාග්‍යවතුන් වහන්ස, 'සිංහය, දායක දානපතියා කය බිඳී මරණින් මතු සුගතිගාමී වී ස්වර්ග ලෝකයට උපදී' යනුවෙන් භාග්‍යවතුන් වහන්සේ මා හට පැවසූ මේ කරුණ මම නොදනිමි; මේ පිළිබඳව නම් මම භාග්‍යවතුන් වහන්සේගේ වචනය විශ්වාස කරමි.\"\n\n\"එසේමය සිංහය, එසේමය සිංහය! දායක දානපතියා කය බිඳී මරණින් මතු සුගතිගාමී වී ස්වර්ග ලෝකයට උපදී\" යි.\n\n\"දන් දෙන්නා ප්‍රිය වෙයි, බොහෝ දෙනා ඔහු ඇසුරු කරති. කීර්තියද ලබයි, යසසද වර්ධනය වෙයි. මසුරු නොවූ පුරුෂයා නොකිපුණු සිත් ඇතිව, නිර්භීතව පිරිසට පිවිසෙයි.\n\nඑහෙයින් පණ්ඩිතයෝ මසුරු මලය දුරු කොට, සුව සොයන්නාහු දන් දෙති. ඔවුහු බොහෝ කල් තිස්සේ දෙව්ලොව පිහිටා සිටිති. දෙවියන්ගේ සේවනයට පැමිණ ඔවුහු එහිදී සතුටු වෙති.\n\n(දුක්වලින්) නිදහස් වූ, කුසල් කළ, මේ ලොවින් චුත වූ ඔවුහු ස්වයංප්‍රභා ඇතිව නන්දන වනෝද්‍යානයේ හැසිරෙති. පංච කාම සම්පත්වලින් යුක්තව ඔවුහු එහිදී සතුටු වෙති, ප්‍රීති වෙති, සතුටින් වෙසෙති.\n\nකෙලෙස් ඇලීම් නැති, නොසැලෙන ස්වභාව ඇති තථාගතයන් වහන්සේගේ අවවාදය පිළිගෙන, සුගතයන් වහන්සේගේ ශ්‍රාවකයෝ ස්වර්ගයෙහි සතුටු වෙති.\"",
      "paliTitle": "Sīhasenāpatisuttaṃ",
      "englishTitle": "Sīha the General Sutta",
      "sinhalaTitle": "සීහසේනාපති සූත්‍රය"
    },
    {
      "number": 35,
      "pali": "‘‘Pañcime, bhikkhave, dāne ānisaṃsā. Katame pañca? Bahuno janassa piyo hoti manāpo; santo sappurisā bhajanti; kalyāṇo kittisaddo abbhuggacchati; gihidhammā anapagato [gihidhammā anapeto (sī. pī.), gihidhammamanupagato (ka.)] hoti; kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca dāne ānisaṃsā’’ti. ‘‘Dadamāno piyo hoti, sataṃ dhammaṃ anukkamaṃ; Santo naṃ sadā bhajanti [santo bhajanti sappurisā (sī.)], saññatā brahmacārayo. ‘‘Te tassa dhammaṃ desenti, sabbadukkhāpanūdanaṃ; Yaṃ so dhammaṃ idhaññāya, parinibbāti anāsavo’’ti. pañcamaṃ;",
      "english": "Monks, there are these five benefits in giving. Which five? One becomes dear and pleasing to many people; virtuous and noble individuals associate with one; a good reputation concerning one spreads far and wide; one does not fall away from the duties proper to a householder; and upon the dissolution of the body, after death, one reappears in a good destination, in a heavenly world. Indeed, monks, these are the five benefits in giving.\n\nOne who gives becomes dear, following the Dhamma of the virtuous;\nThe virtuous always associate with them, as do the self-restrained practitioners of the holy life.\nThey teach them the Dhamma, which removes all suffering;\nHaving understood that Dhamma here, they attain final Nibbāna, taintless.",
      "sinhala": "මහණෙනි, දීමෙහි ආනිසංස මේ පහකි. කවරේද ඒ පහ? බොහෝ දෙනාට ප්‍රිය මනාප වේ; ශාන්ත වූ සත්පුරුෂයෝ ඔහු ඇසුරු කරති; කල්‍යාණ වූ කීර්ති ඝෝෂාවක් පැතිර යයි; ගිහි දම්වලින් (ගිහි ජීවිතයට අදාළ යුතුකම්වලින්) ඈත් නොවූවෙක් වේ; ශරීරය බිඳී මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයක උපදී. මහණෙනි, දීමෙහි ආනිසංස මේ පහයයි.\n\nයමෙක් දන් දෙන්නේද, සත්පුරුෂ ධර්‍මය අනුගමනය කරන්නේද, හේ ප්‍රිය වේ. සංවර වූ බ්‍ර​හ්මචාරී වූ ශාන්ත සත්පුරුෂයෝ නිරන්තරයෙන් ඔහු ඇසුරු කරති. ඔවුහු ඔහුට සියලු දුක් දුරලන ධර්‍මය දේශනා කරති. ඒ ධර්‍මය මෙලොවදීම අවබෝධ කරගෙන, කෙලෙස් රහිතව පිරිනිවන් පායි.",
      "paliTitle": "Dānānisaṃsasuttaṃ",
      "englishTitle": "The Benefits of Giving Sutta",
      "sinhalaTitle": "දානානිසංස සූත්‍රය"
    },
    {
      "number": 36,
      "pali": "‘‘Pañcimāni, bhikkhave, kāladānāni. Katamāni pañca? Āgantukassa dānaṃ deti; gamikassa dānaṃ deti; gilānassa dānaṃ deti; dubbhikkhe dānaṃ deti; yāni tāni navasassāni navaphalāni tāni paṭhamaṃ sīlavantesu patiṭṭhāpeti. Imāni kho, bhikkhave, pañca kāladānānī’’ti. ‘‘Kāle dadanti sappaññā, vadaññū vītamaccharā; Kālena dinnaṃ ariyesu, ujubhūtesu tādisu. ‘‘Vippasannamanā tassa, vipulā hoti dakkhiṇā; Ye tattha anumodanti, veyyāvaccaṃ karonti vā; Na tena [na tesaṃ (pī. ka.)] dakkhiṇā ūnā, tepi puññassa bhāgino. ‘‘Tasmā dade appaṭivānacitto, yattha dinnaṃ mahapphalaṃ; Puññāni paralokasmiṃ, patiṭṭhā honti pāṇina’’nti. chaṭṭhaṃ;",
      "english": "Monks, there are these five timely gifts. What are the five? One gives a gift to a visitor; one gives a gift to one who is departing; one gives a gift to the sick; one gives a gift during a famine; and whatever new harvests and new fruits there are, one first establishes them with the virtuous ones. Indeed, monks, these are the five timely gifts.\n\nThe wise, the generous, free from stinginess, give at the proper time; a gift given at the proper time to the Noble Ones, to those who are upright and unwavering.\n\nWith a mind serene and deeply confident, that offering brings abundant fruit. Those who rejoice in it, or who perform service related to it, do not diminish the offering, for they too are sharers in the merit.\n\nTherefore, with an unhesitating mind, one should give where a gift yields great fruit; for merits are a foundation for beings in the other world.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ කාලයට සුදුසු දාන පසකි. ඒ පස කවරේද? ආගන්තුකයෙකුට දන් දෙයි; ගමනක් යන අයෙකුට දන් දෙයි; ගිලනෙකුට දන් දෙයි; දුර්භික්ෂ කාලයකදී දන් දෙයි; අලුත් ධාන්‍ය හා අලුත් පලතුරු ලැබුණු විට, ඒවා මුලින්ම ශීලවන්තයන්ට පූජා කරයි. භික්ෂූන් වහන්ස, මේවා කාලයට සුදුසු දාන පස වන්නේය.\n\nනුවණැත්තෝ, වදාඥයෝ, මසුරුකම දුරු කළෝ, සුදුසු කලෙහි දන් දෙති. ආ​ර්‍ය​ වූ, සෘජු වූ, තථාගත ගුණ ඇති උතුමන්ට කලට වේලාවට දෙනු ලබන දානය මහත් ඵල දරයි. පැහැදුණු සිත් ඇතිව දෙන ඔහුගේ දක්ෂිණාව මහත් ඵලදායක වේ. එහිදී අනුමෝදන් වන, එසේත් නැතිනම් උපස්ථාන කටයුතු කරන යම් අයෙක් වෙත්ද, ඔවුන් නිසා දක්ෂිණාව අඩු වන්නේ නැත, ඔවුහු ද පිනට භාගී වන්නෝය. එබැවින්, පසුතැවිලි නොවන සිතින් දන් දෙන්න. යම් තැනක දෙන ලද දානය මහත් ඵල දරයිද, ඒ දානය මෙලොවින් පරලොව යන සත්වයන්ට පිහිට වන්නේය.",
      "paliTitle": "Kāladānasuttaṃ",
      "englishTitle": "Timely Giving Sutta",
      "sinhalaTitle": "කාලදාන සූත්‍රය"
    },
    {
      "number": 37,
      "pali": "‘‘Bhojanaṃ, bhikkhave, dadamāno dāyako paṭiggāhakānaṃ pañca ṭhānāni deti. Katamāni pañca? Āyuṃ deti, vaṇṇaṃ deti, sukhaṃ deti, balaṃ deti, paṭibhānaṃ [paṭibhāṇaṃ (sī.)] deti. Āyuṃ kho pana datvā āyussa bhāgī hoti dibbassa vā mānusassa vā; vaṇṇaṃ datvā vaṇṇassa bhāgī hoti dibbassa vā mānusassa vā; sukhaṃ datvā sukhassa bhāgī hoti dibbassa vā mānusassa vā; balaṃ datvā balassa bhāgī hoti dibbassa vā mānusassa vā; paṭibhānaṃ datvā paṭibhānassa bhāgī hoti dibbassa vā mānusassa vā. Bhojanaṃ, bhikkhave, dadamāno dāyako paṭiggāhakānaṃ imāni pañca ṭhānāni detī’’ti. ‘‘Āyudo balado dhīro, vaṇṇado paṭibhānado; Sukhassa dātā medhāvī, sukhaṃ so adhigacchati. ‘‘Āyuṃ datvā balaṃ vaṇṇaṃ, sukhañca paṭibhānakaṃ [paṭibhāṇakaṃ (sī.), paṭibhānado (syā. kaṃ. pī. ka.)]; Dīghāyu yasavā hoti, yattha yatthūpapajjatī’’ti. sattamaṃ;",
      "english": "Monks, a donor who gives food gives five things to the recipients. Which five? They give life, they give beauty, they give happiness, they give strength, they give ready wit.\n\nHaving given life, one partakes in life, whether divine or human. Having given beauty, one partakes in beauty, whether divine or human. Having given happiness, one partakes in happiness, whether divine or human. Having given strength, one partakes in strength, whether divine or human. Having given ready wit, one partakes in ready wit, whether divine or human. Monks, a donor who gives food gives these five things to the recipients.\n\nThe wise one, giver of life and strength, giver of beauty and ready wit, the sagacious giver of happiness, he attains happiness.\n\nHaving given life, strength, beauty, happiness, and ready wit, wherever one is reborn, one becomes long-lived and renowned.",
      "sinhala": "භික්ෂූනි, භෝජනය පූජා කරන දායකයා ප්‍රතිග්‍රාහකයන්ට කරුණු පහක් දෙයි. කවර කරුණු පහක්ද? ආයුෂ දෙයි, වර්ණය දෙයි, සැපය දෙයි, බලය දෙයි, ප්‍රතිභානය දෙයි. යම් හෙයකින් ආයුෂ දුන් පසු, දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ ආයුෂයට ඔහු භාග්‍යවන්තයෙක් වෙයි; වර්ණය දුන් පසු, දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ වර්ණයට ඔහු භාග්‍යවන්තයෙක් වෙයි; සැපය දුන් පසු, දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ සැපයට ඔහු භාග්‍යවන්තයෙක් වෙයි; බලය දුන් පසු, දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ බලයට ඔහු භාග්‍යවන්තයෙක් වෙයි; ප්‍රතිභානය දුන් පසු, දිව්‍යමය වූ හෝ මනුෂ්‍යමය වූ හෝ ප්‍රතිභානයට ඔහු භාග්‍යවන්තයෙක් වෙයි. භික්ෂූනි, භෝජනය පූජා කරන දායකයා ප්‍රතිග්‍රාහකයන්ට මේ කරුණු පහ දෙයි.\n\nආයුෂ දෙන්නා, බලය දෙන්නා, ධෛර්ය සම්පන්න තැනැත්තා, වර්ණය දෙන්නා, ප්‍රතිභානය දෙන්නා, සැපය දෙන්නා වූ, ප‍්‍රඥාවන්තයා, ඔහු සුවය ලබයි.\n\nආයුෂ, බලය, වර්ණය, සැපය, සහ ප‍්‍රතිභානය දී, ඔහු උපදින උපදින සෑම තැනකම දීර්ඝායුෂ ලබන, යසස් ඇති කෙනෙක් වෙයි.",
      "paliTitle": "Bhojanasuttaṃ",
      "englishTitle": "The Meal Sutta",
      "sinhalaTitle": "භෝජන සූත්‍රය"
    },
    {
      "number": 38,
      "pali": "‘‘Pañcime, bhikkhave, saddhe kulaputte ānisaṃsā. Katame pañca? Ye te, bhikkhave, loke santo sappurisā te saddhaññeva paṭhamaṃ anukampantā anukampanti, no tathā assaddhaṃ; saddhaññeva paṭhamaṃ upasaṅkamantā upasaṅkamanti, no tathā assaddhaṃ; saddhaññeva paṭhamaṃ paṭiggaṇhantā paṭiggaṇhanti, no tathā assaddhaṃ; saddhaññeva paṭhamaṃ dhammaṃ desentā desenti, no tathā assaddhaṃ; saddho kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca saddhe kulaputte ānisaṃsā. ‘‘Seyyathāpi, bhikkhave, subhūmiyaṃ catumahāpathe mahānigrodho samantā pakkhīnaṃ paṭisaraṇaṃ hoti; evamevaṃ kho, bhikkhave, saddho kulaputto bahuno janassa paṭisaraṇaṃ hoti bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikāna’’nti. ‘‘Sākhāpattaphalūpeto [sākhāpattabahupeto (katthaci), sākhāpattapalāsūpeto (?)], khandhimāva [khandhimā ca (sī.)] mahādumo; Mūlavā phalasampanno, patiṭṭhā hoti pakkhinaṃ. ‘‘Manorame āyatane, sevanti naṃ vihaṅgamā; Chāyaṃ chāyatthikā [chāyatthino (sī.)] yanti, phalatthā phalabhojino. ‘‘Tatheva sīlasampannaṃ, saddhaṃ purisapuggalaṃ; Nivātavuttiṃ atthaddhaṃ, sorataṃ sakhilaṃ muduṃ. ‘‘Vītarāgā vītadosā, vītamohā anāsavā; Puññakkhettāni lokasmiṃ, sevanti tādisaṃ naraṃ. ‘‘Te tassa dhammaṃ desenti, sabbadukkhāpanūdanaṃ; Yaṃ so dhammaṃ idhaññāya, parinibbāti anāsavo’’ti. aṭṭhamaṃ;",
      "english": "Monks, there are these five advantages for a faithful householder's son. What are these five? Those good people who exist in the world, monks, show compassion primarily for the faithful, not so much for the faithless. They primarily approach the faithful, not so much the faithless. They primarily accept offerings from the faithful, not so much from the faithless. They primarily teach the Dhamma to the faithful, not so much to the faithless. The faithful, with the breaking up of the body, after death, are reborn in a good destination, a heavenly world. These, monks, are the five advantages for a faithful householder's son.\n\nJust as, monks, a great banyan tree at a crossroads in fertile ground is a refuge for birds from all directions, even so, monks, a faithful householder's son becomes a refuge for many people: for monks, nuns, male lay followers, and female lay followers.\n\nA great tree, adorned with branches, leaves, and fruits, with a thick trunk;\nRooted and abundant with fruit, it is a dwelling place for birds.\n\nIn that delightful abode, birds seek refuge in it;\nThose seeking shade go for its shade, and those seeking fruit eat its fruit.\n\nEven so, a person endowed with virtue, a faithful individual,\nLiving humbly, without arrogance, gentle, amiable, and soft-spoken.\n\nThose who are rid of passion, rid of hatred, rid of delusion, taint-free;\nThe fields of merit in the world, they frequent such a person.\n\nThey teach him the Dhamma, which dispels all suffering;\nHaving understood that Dhamma here, he attains final Nibbāna, taint-free.",
      "sinhala": "භික්ෂූනි, ශ්‍රද්ධා ඇති කුලපුත්‍රයාට මේ පස්වැදෑරුම් ආනිශංස ඇත. ඒ කවර පස්ද යත්:\n\nභික්ෂූනි, ලෝකයේ සිටින සත්පුරුෂයෝ ශ්‍රද්ධා ඇති අයටමයි මුලින් අනුකම්පා කරන්නේ, ශ්‍රද්ධා නැති අයට එසේ නොවේ. ශ්‍රද්ධා ඇති අයටමයි මුලින් ළංවන්නේ, ශ්‍රද්ධා නැති අයට එසේ නොවේ. ශ්‍රද්ධා ඇති අයටමයි මුලින් පිළිගන්නේ, ශ්‍රද්ධා නැති අයට එසේ නොවේ. ශ්‍රද්ධා ඇති අයටමයි මුලින් ධර්ම‍ය දේශනා කරන්නේ, ශ්‍රද්ධා නැති අයට එසේ නොවේ. ශ්‍රද්‍ධා ඇති තැනැත්තා කය බිඳී මරණින් මතු සුගති නම් වූ ස්වර්ග ලෝකයක උපදී. භික්ෂූනි, ශ්‍රද්‍ධා ඇති කුලපුත්‍රයාට ඇති මේ පස්වැදෑරුම් ආනිශංස නම් මේවාය.\n\nභික්ෂූනි, යම්සේ සාරවත් භූමියක සිව්මංසලක පිහිටි මහා නුග ගසක් සිව් දිශාවෙන් එන පක්‍ෂීන්ට පිහිටක් වේද, එපරිද්දෙන්ම භික්ෂූනි, ශ්‍රද්‍ධා ඇති කුලපුත්‍රයා භික්‍ෂූන් වහන්සේලාට, භික්‍ෂුණීන් වහන්සේලාට, උපාසකවරුන්ට, උපාසිකාවන්ට යන බොහෝ ජනයාට පිහිටක් වේ.\n\nශාඛා පත්‍ර ඵලයන්ගෙන් යුක්ත වූ, මහ කඳක් ඇති, මහා වෘක්‍ෂය, මූලයන් සහිත වූ, ඵල සම්පත්තියෙන් යුක්ත වූවක් මෙන් පක්‍ෂීන්ට පිහිටක් වේ.\n\nමනහර ඒ ස්ථානයේ පක්‍ෂීහු එයට ළං වෙති. සෙවණ සොයන්නෝ සෙවණට යති. ඵල සොයන්නෝ ඵල භුක්ති විඳිති.\n\nඑපරිද්දෙන්ම ශීල සම්පන්න වූ, ශ්‍රද්‍ධා ඇති පුරිසපුද්‍ගලයා, නිහතමානී වූ, උද්‍ධච්ච නැති, ශාන්ත වූ, ප්‍රිය වචන ඇති, මෘදු වූ අයෙකි.\n\nවීතරාගී වූ, වීතදෝෂී වූ, වීතමෝහී වූ, ආශ්‍රව රහිත වූ, ලෝකයේ පින්කෙත් වූ අරහතුන් වහන්සේලා එබඳු පුද්ගලයාට ළං වෙති.\n\nඒ උතුමන් ඔහුට සියලු දුක් දුරු කරන ධර්ම‍ය දේශනා කරති. ඔහු මෙලොවදීම ඒ ධර්ම‍ය අවබෝධ කරගෙන, ආශ්‍රව රහිතව පිරිනිවන් පායි.",
      "paliTitle": "Saddhasuttaṃ",
      "englishTitle": "The Discourse on Faith",
      "sinhalaTitle": "සද්ධ සූත්‍රය"
    },
    {
      "number": 39,
      "pali": "‘‘Pañcimāni, bhikkhave, ṭhānāni sampassantā mātāpitaro puttaṃ icchanti kule jāyamānaṃ. Katamāni pañca? Bhato vā no bharissati; kiccaṃ vā no karissati; kulavaṃso ciraṃ ṭhassati; dāyajjaṃ paṭipajjissati; atha vā pana petānaṃ kālaṅkatānaṃ dakkhiṇaṃ anuppadassatīti. Imāni kho, bhikkhave, pañca ṭhānāni sampassantā mātāpitaro puttaṃ icchanti kule jāyamāna’’nti. [kathā. 491] ‘‘Pañca ṭhānāni sampassaṃ, puttaṃ icchanti paṇḍitā; Bhato vā no bharissati, kiccaṃ vā no karissati. ‘‘Kulavaṃso ciraṃ tiṭṭhe, dāyajjaṃ paṭipajjati; Atha vā pana petānaṃ, dakkhiṇaṃ anuppadassati. ‘‘Ṭhānānetāni sampassaṃ, puttaṃ icchanti paṇḍitā; Tasmā santo sappurisā, kataññū katavedino. ‘‘Bharanti mātāpitaro, pubbe katamanussaraṃ; Karonti nesaṃ kiccāni, yathā taṃ pubbakārinaṃ. ‘‘Ovādakārī bhataposī, kulavaṃsaṃ ahāpayaṃ; Saddho sīlena sampanno, putto hoti pasaṃsiyo’’ti. navamaṃ;",
      "english": "Bhikkhus, there are these five reasons, seeing which, parents desire a son to be born into their family. Which five? Either, having been supported by us, he will support us; or he will carry out our duties; the family lineage will long endure; he will inherit the legacy; and also, he will give offerings for the departed who have passed away. These, bhikkhus, are the five reasons, seeing which, parents desire a son to be born into their family.\n\nSeeing these five reasons, the wise desire a son: either, having been supported by us, he will support us; or he will carry out our duties.\n\nMay the family lineage long endure; may he inherit the legacy; and also, he will give offerings for the departed.\n\nSeeing these reasons, the wise desire a son. Therefore, good and righteous people, grateful and responsive to kindness, support their parents, remembering what they have done in the past. They perform their duties, just as is fitting for those who previously did for them.\n\nObedient to counsel, supporting those who supported him, not letting the family lineage decline, faithful, and endowed with virtue – such a son is truly praiseworthy.",
      "sinhala": "භික්ෂූණි, මව්පියෝ කරුණු පහක් දකිමින් කුලයක පුතෙක් උපදිනවාට කැමති වෙති. ඒ කවර කරුණු පහක්ද? අප විසින් පෝෂණය කරන ලද ඔහු (පසු කලෙක) අපව පෝෂණය කරනු ඇත; අපගේ කටයුතු ඔහු විසින් කරනු ඇත; කුල පරම්පරාව දිගු කලක් පවතිනු ඇත; උරුමය භාරගනු ඇත; එසේ නැතිනම් මිය පරලොව ගිය ඥාතීන් වෙනුවෙන් පින් අනුමෝදන් කරනු ඇත යනුවෙනි. භික්ෂූණි, මව්පියෝ මේ කරුණු පහ දකිමින්ම කුලයක පුතෙක් උපදිනවාට කැමති වෙති.\n\nපණ්ඩිතයෝ කරුණු පහක් දකිමින්, පුතෙක් ලැබීමට කැමැත්තෙන් සිටිති. අප විසින් පෝෂණය කරන ලද ඔහු (පසු කලෙක) අපව පෝෂණය කරනු ඇත; අපගේ කටයුතු ඔහු විසින් කරනු ඇත.\n\nකුල පරම්පරාව දිගු කලක් පවතිනු ඇත; උරුමය භාරගනු ඇත. එසේ නැතිනම් මිය පරලොව ගිය ඥාතීන් වෙනුවෙන් පින් අනුමෝදන් කරනු ඇත.\n\nමේ කරුණු දකිමින්, පණ්ඩිතයෝ පුතෙක් ලැබීමට කැමැති වෙති. එබැවින් සත්පුරුෂයෝ, කෘතඥ වූ, කෘතවේදී වූ අය වෙති.\n\nපෙර කරන ලද උපකාර සිහි කරමින්, මව්පියන් පෝෂණය කරති. පෙර උපකාර කළ ඒ මව්පියන් හට යුතුකම් කරති.\n\nඅවවාදයට කීකරු වන, මව්පියන් පෝෂණය කරන, කුල පරම්පරාව පිරිහීමට නොසලස්වන, ශ්‍රද්ධාවෙන් හා සීලයෙන් යුතු පුත්‍රයා ප්‍රශංසාවට ලක්වන්නේය.",
      "paliTitle": "Puttasuttaṃ",
      "englishTitle": "The Discourse on Sons",
      "sinhalaTitle": "පුත්ත සූත්‍රය"
    },
    {
      "number": 40,
      "pali": "‘‘Himavantaṃ, bhikkhave, pabbatarājaṃ nissāya mahāsālā pañcahi vaḍḍhīhi vaḍḍhanti. Katamāhi pañcahi? Sākhāpattapalāsena vaḍḍhanti; tacena vaḍḍhanti; papaṭikāya vaḍḍhanti; pheggunā vaḍḍhanti; sārena vaḍḍhanti. Himavantaṃ, bhikkhave, pabbatarājaṃ nissāya mahāsālā imāhi pañcahi vaḍḍhīhi vaḍḍhanti. Evamevaṃ kho, bhikkhave, saddhaṃ kulaputtaṃ nissāya antojano pañcahi vaḍḍhīhi vaḍḍhati. Katamāhi pañcahi? Saddhāya vaḍḍhati; sīlena vaḍḍhati; sutena vaḍḍhati; cāgena vaḍḍhati; paññāya vaḍḍhati. Saddhaṃ, bhikkhave, kulaputtaṃ nissāya antojano imāhi pañcahi vaḍḍhīhi vaḍḍhatī’’ti. ‘‘Yathā hi pabbato selo, araññasmiṃ brahāvane; Taṃ rukkhā upanissāya, vaḍḍhante te vanappatī. ‘‘Tatheva sīlasampannaṃ, saddhaṃ kulaputtaṃ imaṃ [kulapatiṃ idha (sī.), kulaputtaṃ idha (syā.)]; Upanissāya vaḍḍhanti, puttadārā ca bandhavā; Amaccā ñātisaṅghā ca, ye cassa anujīvino. ‘‘Tyassa sīlavato sīlaṃ, cāgaṃ sucaritāni ca; Passamānānukubbanti, ye bhavanti vicakkhaṇā. ‘‘Imaṃ dhammaṃ caritvāna, maggaṃ [saggaṃ (syā. ka.)] sugatigāminaṃ; Nandino devalokasmiṃ, modanti kāmakāmino’’ti. dasamaṃ; ",
      "english": "Bhikkhus, relying on Himavanta, the king of mountains, great sal trees grow in five ways. Which five? They grow in branches, leaves, and foliage; they grow in bark; they grow in outer bark; they grow in sapwood; they grow in heartwood. Bhikkhus, relying on Himavanta, the king of mountains, great sal trees grow in these five ways. In the same way, Bhikkhus, relying on a faithful householder's son, his inner circle grows in five ways. Which five? They grow in faith; they grow in moral virtue; they grow in learning; they grow in generosity; they grow in wisdom. Bhikkhus, relying on a faithful householder's son, his inner circle grows in these five ways.\n\nJust as in a vast wilderness forest, trees and plants grow relying on a rocky mountain,\n\nSo too, relying on this householder's son, who is endowed with virtue and faith, his children, spouses, and relatives grow; his ministers, the assemblies of his kinsmen, and all who depend on him grow.\n\nSeeing the virtue, generosity, and good conduct of this virtuous one, those who are discerning emulate him.\n\nHaving practiced this Dhamma, the path leading to a good destination, those who desire sense pleasures rejoice and delight in the divine world.",
      "sinhala": "භික්ෂූන් වහන්ස, හිමාල නම් පර්වත රාජයා ඇසුරු කරගෙන මහා සල් වෘක්ෂයෝ වර්ධනයන් පසකින් වර්ධනය වෙති. ඒ කවර පසකින්ද? අතු, පත්‍ර, පළාපත් වලින් වර්ධනය වෙති; පොත්තෙන් වර්ධනය වෙති; පොතුපොපොතු වලින් වර්ධනය වෙති; අතුරු දැවයෙන් වර්ධනය වෙති; සාර දැවයෙන් වර්ධනය වෙති. භික්ෂූන් වහන්ස, හිමාල පර්වත රාජයා ඇසුරු කරගෙන මහා සල් වෘක්ෂයෝ මේ පස් ආකාරයකින් වර්ධනය වෙති. එපරිද්දෙන්ම භික්ෂූන් වහන්ස, ශ්‍රද්ධාවන්ත කුලපුත්‍රයෙකු ඇසුරු කරගෙන, ඔහුගේ ගෘහස්ථ ජනයා පස් ආකාරයකින් වර්ධනය වෙති. ඒ කවර පසකින්ද? ශ්‍රද්ධාවෙන් වර්ධනය වෙති; සීලයෙන් වර්ධනය වෙති; ශ්‍රැතයෙන් වර්ධනය වෙති; ත්‍යාගයෙන් වර්ධනය වෙති; ප්‍රඥාවෙන් වර්ධනය වෙති. භික්ෂූන් වහන්ස, ශ්‍රද්ධාවන්ත කුලපුත්‍රයෙකු ඇසුරු කරගෙන, ඔහුගේ ගෘහස්ථ ජනයා මේ පස් ආකාරයකින් වර්ධනය වෙති.\n\nයම්සේ වනාන්තරයක, මහා වනයක ගල් පර්වතයක් ඇද්ද, එම පර්වතය ඇසුරු කරගෙන වෘක්ෂයෝ ද, අන්‍ය වනස්පතීහු ද වර්ධනය වෙති.\n\nඑලෙසින්ම සිල්වත් වූ, ශ්‍රද්ධාවන්ත වූ මේ කුලපුත්‍රයා ඇසුරු කරගෙන, පුත්‍රයෝ, භාර්යාවෝ ද, නෑදෑයෝ ද වර්ධනය වෙති; අමාත්‍යයෝ ද, ඥාති සමූහයෝ ද, යම් ඔහුට අනුජීවනය කරන්නෝ වෙත් ද, ඔවුහු ද වර්ධනය වෙති.\n\nඔහුගේ සිල්වත්භාවය වූ සීලයත්, ත්‍යාගයත්, යහපත් චරියාවනුත් දකිනා වූ, යම් ප්‍රඥාවන්තයෝ වෙත් ද, ඔවුහු ඒ ගුණ අනුකරණය කරති.\n\nසුගතිගාමී වූ මාර්ගය වන මේ ධර්මයෙහි හැසිර, කම් සැප කැමැත්තෝ දෙව්ලොවෙහි සතුටු වෙමින්, ප්‍රමුදිත වෙති.",
      "paliTitle": "Mahāsālaputtasuttaṃ",
      "englishTitle": "The Children of Great Sal Trees Sutta",
      "sinhalaTitle": "මහාසාලපුත්ත සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sumanavaggo catuttho. Tassuddānaṃ – Sumanā cundī uggaho, sīho dānānisaṃsako; Kālabhojanasaddhā ca, puttasālehi te dasāti.",
    "english": "",
    "sinhala": ""
  }
}