{
  "id": "an5.22",
  "title": {
    "pali": "Akkosakavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 211,
      "pali": "‘‘Yo so, bhikkhave, bhikkhu akkosakaparibhāsako ariyūpavādī sabrahmacārīnaṃ, tassa pañca ādīnavā pāṭikaṅkhā. Katame pañca? Pārājiko vā hoti chinnaparipantho [chinnaparibandho (ka.)], aññataraṃ vā saṃkiliṭṭhaṃ āpattiṃ āpajjati, bāḷhaṃ vā rogātaṅkaṃ phusati, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Yo so, bhikkhave, bhikkhu akkosakaparibhāsako ariyūpavādī sabrahmacārīnaṃ, tassa ime pañca ādīnavā pāṭikaṅkhā’’ti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Akkosakasuttaṃ"
    },
    {
      "number": 212,
      "pali": "‘‘Yo so, bhikkhave, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako, tassa pañca ādīnavā pāṭikaṅkhā. Katame pañca? Anadhigataṃ nādhigacchati, adhigatā [adhigataṃ (sabbattha)] parihāyati, pāpako kittisaddo abbhuggacchati, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Yo so, bhikkhave, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako, tassa ime pañca ādīnavā pāṭikaṅkhā’’ti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Bhaṇḍanakārakasuttaṃ"
    },
    {
      "number": 213,
      "pali": "[mahāva. 209; dī. ni. 3.316] ‘‘Pañcime, bhikkhave, ādīnavā dussīlassa sīlavipattiyā. Katame pañca? Idha, bhikkhave, dussīlo sīlavipanno pamādādhikaraṇaṃ mahatiṃ bhogajāniṃ nigacchati. Ayaṃ, bhikkhave, paṭhamo ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlassa sīlavipannassa pāpako kittisaddo abbhuggacchati. Ayaṃ, bhikkhave, dutiyo ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlo sīlavipanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ, yadi brāhmaṇaparisaṃ, yadi gahapatiparisaṃ, yadi samaṇaparisaṃ – avisārado upasaṅkamati maṅkubhūto. Ayaṃ, bhikkhave, tatiyo ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlo sīlavipanno sammūḷho kālaṃ karoti. Ayaṃ, bhikkhave, catuttho ādīnavo dussīlassa sīlavipattiyā. ‘‘Puna caparaṃ, bhikkhave, dussīlo sīlavipanno kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ayaṃ, bhikkhave, pañcamo ādīnavo dussīlassa sīlavipattiyā. Ime kho, bhikkhave, pañca ādīnavā dussīlassa sīlavipattiyā. ‘‘Pañcime, bhikkhave, ānisaṃsā sīlavato sīlasampadāya. Katame pañca? Idha, bhikkhave, sīlavā sīlasampanno appamādādhikaraṇaṃ mahantaṃ bhogakkhandhaṃ adhigacchati. Ayaṃ, bhikkhave, paṭhamo ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavato sīlasampannassa kalyāṇo kittisaddo abbhuggacchati. Ayaṃ, bhikkhave, dutiyo ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavā sīlasampanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ, yadi brāhmaṇaparisaṃ, yadi gahapatiparisaṃ, yadi samaṇaparisaṃ – visārado upasaṅkamati amaṅkubhūto. Ayaṃ bhikkhave, tatiyo ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavā sīlasampanno asammūḷho kālaṃ karoti. Ayaṃ, bhikkhave, catuttho ānisaṃso sīlavato sīlasampadāya. ‘‘Puna caparaṃ, bhikkhave, sīlavā sīlasampanno kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ayaṃ, bhikkhave, pañcamo ānisaṃso sīlavato sīlasampadāya. Ime kho, bhikkhave, pañca ānisaṃsā sīlavato sīlasampadāyā’’ti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sīlasuttaṃ"
    },
    {
      "number": 214,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā bahubhāṇismiṃ puggale. Katame pañca? Musā bhaṇati, pisuṇaṃ bhaṇati, pharusaṃ bhaṇati, samphappalāpaṃ bhaṇati, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā bahubhāṇismiṃ puggale. ‘‘Pañcime, bhikkhave, ānisaṃsā mantabhāṇismiṃ puggale. Katame pañca? Na musā bhaṇati, na pisuṇaṃ bhaṇati, na pharusaṃ bhaṇati, na samphappalāpaṃ bhaṇati, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā mantabhāṇismiṃ puggale’’ti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Bahubhāṇisuttaṃ"
    },
    {
      "number": 215,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā akkhantiyā. Katame pañca? Bahuno janassa appiyo hoti amanāpo, verabahulo ca hoti, vajjabahulo ca, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā akkhantiyā. ‘‘Pañcime, bhikkhave, ānisaṃsā khantiyā. Katame pañca? Bahuno janassa piyo hoti manāpo, na verabahulo hoti, na vajjabahulo, asammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā khantiyā’’ti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamaakkhantisuttaṃ"
    },
    {
      "number": 216,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā akkhantiyā. Katame pañca? Bahuno janassa appiyo hoti amanāpo, luddo ca hoti, vippaṭisārī ca, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā akkhantiyā. ‘‘Pañcime, bhikkhave, ānisaṃsā khantiyā. Katame pañca? Bahuno janassa piyo hoti manāpo, aluddo ca hoti, avippaṭisārī ca, asammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā khantiyā’’ti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyaakkhantisuttaṃ"
    },
    {
      "number": 217,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā apāsādike. Katame pañca? Attāpi attānaṃ upavadati, anuvicca viññū garahanti, pāpako kittisaddo abbhuggacchati, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Ime kho, bhikkhave, pañca ādīnavā apāsādike. ‘‘Pañcime, bhikkhave, ānisaṃsā pāsādike. Katame pañca? Attāpi attānaṃ na upavadati, anuvicca viññū pasaṃsanti, kalyāṇo kittisaddo abbhuggacchati, asammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Ime kho, bhikkhave, pañca ānisaṃsā pāsādike’’ti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamaapāsādikasuttaṃ"
    },
    {
      "number": 218,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā apāsādike. Katame pañca? Appasannā nappasīdanti, pasannānañca ekaccānaṃ aññathattaṃ hoti, satthusāsanaṃ akataṃ [na kataṃ (syā. kaṃ. ka.)] hoti, pacchimā janatā diṭṭhānugatiṃ āpajjati, cittamassa nappasīdati. Ime kho, bhikkhave, pañca ādīnavā apāsādike. ‘‘Pañcime, bhikkhave, ānisaṃsā pāsādike. Katame pañca? Appasannā pasīdanti, pasannānañca bhiyyobhāvo hoti, satthusāsanaṃ kataṃ hoti, pacchimā janatā diṭṭhānugatiṃ āpajjati, cittamassa pasīdati. Ime kho, bhikkhave, pañca ānisaṃsā pāsādike’’ti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyaapāsādikasuttaṃ"
    },
    {
      "number": 219,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā aggismiṃ. Katame pañca? Acakkhusso, dubbaṇṇakaraṇo, dubbalakaraṇo, saṅgaṇikāpavaḍḍhano [saṅgaṇikāpavaddhano (sī.), saṅgaṇikārāmabaddhano (ka.)], tiracchānakathāpavattaniko hoti. Ime kho, bhikkhave, pañca ādīnavā aggismi’’nti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aggisuttaṃ"
    },
    {
      "number": 220,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā madhurāyaṃ. Katame pañca? Visamā, bahurajā, caṇḍasunakhā, vāḷayakkhā, dullabhapiṇḍā – ime kho, bhikkhave, pañca ādīnavā madhurāya’’nti. Dasamaṃ. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Madhurāsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Akkosakavaggo dutiyo. Tassuddānaṃ – Akkosabhaṇḍanasīlaṃ, bahubhāṇī dve akhantiyo; Apāsādikā dve vuttā, aggismiṃ madhurena cāti.",
    "english": "",
    "sinhala": ""
  }
}