{
  "id": "an5.15",
  "title": {
    "pali": "Tikaṇḍakīvaggo",
    "english": "The Chapter of Three Thorns",
    "sinhala": "තිඛණ්ඩකී වග්ගය"
  },
  "sections": [
    {
      "number": 141,
      "pali": "‘‘Pañcime, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame pañca? Datvā avajānāti, saṃvāsena avajānāti, ādheyyamukho [ādiyyamukho (sī.), ādeyyamukho (syā. kaṃ.), ādiyamukho (pī.) aṭṭhakathāya paṭhamasaṃvaṇṇanānurūpaṃ. pu. pa. 193 passitabbaṃ] hoti, lolo hoti, mando momūho hoti [mando hoti momūho (sī.)]. ‘‘Kathañca, bhikkhave, puggalo datvā avajānāti? Idha, bhikkhave, puggalo puggalassa deti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ. Tassa evaṃ hoti – ‘ahaṃ demi; ayaṃ paṭiggaṇhātī’ti. Tamenaṃ datvā avajānāti. Evaṃ kho, bhikkhave, puggalo datvā avajānāti. ‘‘Kathañca, bhikkhave, puggalo saṃvāsena avajānāti? Idha, bhikkhave, puggalo puggalena saddhiṃ saṃvasati dve vā tīṇi vā vassāni. Tamenaṃ saṃvāsena avajānāti. Evaṃ kho, bhikkhave, puggalo saṃvāsena avajānāti. ‘‘Kathañca, bhikkhave, puggalo ādheyyamukho hoti? Idha, bhikkhave, ekacco puggalo parassa vaṇṇe vā avaṇṇe vā bhāsiyamāne taṃ khippaññeva adhimuccitā [adhimuccito (syā.)] hoti. Evaṃ kho, bhikkhave, puggalo ādheyyamukho hoti. ‘‘Kathañca, bhikkhave, puggalo lolo hoti? Idha, bhikkhave, ekacco puggalo ittarasaddho hoti ittarabhattī ittarapemo ittarappasādo. Evaṃ kho, bhikkhave, puggalo lolo hoti. ‘‘Kathañca, bhikkhave, puggalo mando momūho hoti? Idha, bhikkhave, ekacco puggalo kusalākusale dhamme na jānāti, sāvajjānavajje dhamme na jānāti, hīnappaṇīte dhamme na jānāti, kaṇhasukkasappaṭibhāge dhamme na jānāti. Evaṃ kho, bhikkhave, puggalo mando momūho hoti. Ime kho, bhikkhave, pañca puggalā santo saṃvijjamānā lokasmi’’nti. Paṭhamaṃ.",
      "english": "Monks, these five types of individuals are present and to be found in the world. Which five? One who gives and then disparages, one who associates and then disparages, one who is prone to quick belief, one who is superficial, and one who is dull and utterly deluded.\n\nAnd how, Monks, does an individual give and then disparage? Here, Monks, an individual gives another individual robes, almsfood, lodgings, requisites for the sick, and medicine. He thinks: ‘I am the giver; this one is the recipient.’ Having given, he then disparages that person. This is how, Monks, an individual gives and then disparages.\n\nAnd how, Monks, does an individual associate and then disparage? Here, Monks, an individual dwells together with another individual for two or three years. Having associated, he then disparages that person. This is how, Monks, an individual associates and then disparages.\n\nAnd how, Monks, is an individual prone to quick belief? Here, Monks, a certain individual, when another's praise or dispraise is spoken, quickly assents to it. This is how, Monks, an individual is prone to quick belief.\n\nAnd how, Monks, is an individual superficial? Here, Monks, a certain individual has fleeting faith, fleeting devotion, fleeting affection, and fleeting confidence. This is how, Monks, an individual is superficial.\n\nAnd how, Monks, is an individual dull and utterly deluded? Here, Monks, a certain individual does not understand wholesome and unwholesome states, does not understand blameworthy and blameless states, does not understand inferior and superior states, and does not understand states that are dark and bright, with their counterparts. This is how, Monks, an individual is dull and utterly deluded.\n\nThese, Monks, are the five types of individuals present and to be found in the world.",
      "sinhala": "මහණෙනි, මේ ලෝකයෙහි පුද්ගලයෝ පස් දෙනෙක් සිටිත්, විද්‍යමාන වෙති. ඒ කවර පස් දෙනෙක් ද? දී අවමන් කරන්නෙක්, ඇසුරු කිරීමෙන් අවමන් කරන්නෙක්, අන්‍යයන්ගේ වචන පහසුවෙන් පිළිගන්නෙක්, ලොල් වූවෙක්, මන්දබුද්ධික වූ ද මුළා වූ ද තැනැත්තෙක් යනුයි.\n\nමහණෙනි, පුද්ගලයෙක් කෙසේ දී අවමන් කරන්නේ ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අන්‍ය පුද්ගලයෙකුට සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස හා බෙහෙත් පිරිකර දෙයි. ඔහුට මෙසේ සිතක් ඇති වේ: ‘මම දෙමි; මේ තැනැත්තා පිළිගනී’ යැයි. ඔහු එසේ දී අවමන් කරයි. මහණෙනි, පුද්ගලයෙක් දී අවමන් කරන්නේ මෙලෙස යි.\n\nමහණෙනි, පුද්ගලයෙක් කෙසේ ඇසුරු කිරීමෙන් අවමන් කරන්නේ ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අන්‍ය පුද්ගලයෙකු සමඟ දෙවසරක් හෝ තෙවසරක් හෝ එකට වාසය කරයි. ඔහු එසේ ඇසුරු කිරීමෙන් ඔහුට අවමන් කරයි. මහණෙනි, පුද්ගලයෙක් ඇසුරු කිරීමෙන් අවමන් කරන්නේ මෙලෙස යි.\n\nමහණෙනි, පුද්ගලයෙක් කෙසේ අන්‍යයන්ගේ වචන පහසුවෙන් පිළිගන්නා සුළු වන්නේ ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් අනුන්ගේ ගුණ කීමෙහි හෝ දොස් කීමෙහි දී ඉක්මනින්ම එය සත්‍යය ලෙස පිළිගනී. මහණෙනි, පුද්ගලයෙක් අන්‍යයන්ගේ වචන පහසුවෙන් පිළිගන්නා සුළු වන්නේ මෙලෙස යි.\n\nමහණෙනි, පුද්ගලයෙක් කෙසේ ලොල් වන්නේ ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් චපල ශ්‍ර‌ද්ධාවෙන් යුක්ත වේ; චපල භක්තියෙන් යුක්ත වේ; චපල ප්‍ර‌ේමයෙන් යුක්ත වේ; චපල ප්‍ර‌සාදයෙන් යුක්ත වේ. මහණෙනි, පුද්ගලයෙක් ලොල් වන්නේ මෙලෙස යි.\n\nමහණෙනි, පුද්ගලයෙක් කෙසේ මන්දබුද්ධික වූ ද මුළා වූ ද තැනැත්තෙක් වන්නේ ද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් කුසල් අකුසල් දහම් නො දනී; සාවද්‍ය වූ ද අනවද්‍ය වූ ද දහම් නො දනී; හීන වූ ද ප්‍ර‌ණීත වූ ද දහම් නො දනී; කළු හා සුදු වශයෙන් ප්‍රතිභාග වූ දහම් නො දනී. මහණෙනි, පුද්ගලයෙක් මන්දබුද්ධික වූ ද මුළා වූ ද තැනැත්තෙක් වන්නේ මෙලෙස යි. මහණෙනි, මේ පස් දෙනා ලෝකයෙහි සිටින, විද්‍යමාන වන පුද්ගලයෝ වෙති.",
      "paliTitle": "Avajānātisuttaṃ",
      "englishTitle": "The Sutta on Despising",
      "sinhalaTitle": "අවමන් සූත‍්‍රය"
    },
    {
      "number": 142,
      "pali": "‘‘Pañcime, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame pañca? Idha, bhikkhave, ekacco puggalo ārabhati ca vippaṭisārī ca hoti; tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. [pu. pa. 191] ‘‘Idha pana, bhikkhave, ekacco puggalo ārabhati, na vippaṭisārī hoti; tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. ‘‘Idha pana, bhikkhave, ekacco puggalo na ārabhati, vippaṭisārī hoti; tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. ‘‘Idha pana, bhikkhave, ekacco puggalo na ārabhati na vippaṭisārī hoti; tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. ‘‘Idha pana, bhikkhave, ekacco puggalo na ārabhati na vippaṭisārī hoti; tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo ārabhati ca vippaṭisārī ca hoti, tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti, so evamassa vacanīyo – ‘āyasmato kho ārambhajā [ārabbhajā (pī. ka.), ārabhajā (syā. kaṃ.)] āsavā saṃvijjanti, vippaṭisārajā āsavā pavaḍḍhanti [saṃvaḍḍhanti (ka.)], sādhu vatāyasmā ārambhaje āsave pahāya vippaṭisāraje āsave paṭivinodetvā cittaṃ paññañca bhāvetu [bhāvetuṃ (sī. pī.)]; evamāyasmā amunā pañcamena puggalena samasamo bhavissatī’’’ti. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo ārabhati na vippaṭisārī hoti, tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti, so evamassa vacanīyo – ‘āyasmato kho ārambhajā āsavā saṃvijjanti, vippaṭisārajā āsavā na pavaḍḍhanti, sādhu vatāyasmā ārambhaje āsave pahāya cittaṃ paññañca bhāvetu; evamāyasmā amunā pañcamena puggalena samasamo bhavissatī’’’ti. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ārabhati vippaṭisārī hoti, tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti, so evamassa vacanīyo – ‘āyasmato kho ārambhajā āsavā na saṃvijjanti, vippaṭisārajā āsavā pavaḍḍhanti, sādhu vatāyasmā vippaṭisāraje āsave paṭivinodetvā cittaṃ paññañca bhāvetu; evamāyasmā amunā pañcamena puggalena samasamo bhavissatī’’’ ti. ‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ārabhati na vippaṭisārī hoti, tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa te uppannā pāpakā akusalā dhammā aparisesā nirujjhanti, so evamassa vacanīyo – ‘āyasmato kho ārambhajā āsavā na saṃvijjanti, vippaṭisārajā āsavā na pavaḍḍhanti, sādhu vatāyasmā cittaṃ paññañca bhāvetu; evamāyasmā amunā pañcamena puggalena samasamo bhavissatī’’’ti. ‘‘Iti kho, bhikkhave, ime cattāro puggalā amunā pañcamena puggalena evaṃ ovadiyamānā evaṃ anusāsiyamānā anupubbena āsavānaṃ khayaṃ pāpuṇantī’’ti [pu. pa. 191]. Dutiyaṃ.",
      "english": "“Monks, these five types of individuals exist, are found in the world. Which five?\n\nHere, monks, a certain individual engages in action and is regretful; yet he does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder.\n\nHowever, monks, here a certain individual engages in action, but is not regretful; yet he does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder.\n\nHowever, monks, here a certain individual does not engage in action, but is regretful; yet he does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder.\n\nHowever, monks, here a certain individual neither engages in action nor is regretful; yet he does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder.\n\nHowever, monks, here a certain individual neither engages in action nor is regretful; and he does understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder.\n\nAmong these, monks, the individual who engages in action and is regretful, and does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder, should be told this: ‘Venerable sir, defilements born of engaging in action exist in you, and defilements born of regret increase. It would be good, venerable sir, if you abandon the defilements born of engaging in action and remove the defilements born of regret, and develop your mind and wisdom. In this way, venerable sir, you will become equal to that fifth individual.’\n\nAmong these, monks, the individual who engages in action but is not regretful, and does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder, should be told this: ‘Venerable sir, defilements born of engaging in action exist in you, but defilements born of regret do not increase. It would be good, venerable sir, if you abandon the defilements born of engaging in action and develop your mind and wisdom. In this way, venerable sir, you will become equal to that fifth individual.’\n\nAmong these, monks, the individual who does not engage in action but is regretful, and does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder, should be told this: ‘Venerable sir, defilements born of engaging in action do not exist in you, but defilements born of regret increase. It would be good, venerable sir, if you remove the defilements born of regret and develop your mind and wisdom. In this way, venerable sir, you will become equal to that fifth individual.’\n\nAmong these, monks, the individual who neither engages in action nor is regretful, and does not understand, as it actually is, that liberation of mind and liberation through wisdom whereby those unwholesome, evil states that have arisen in him cease without remainder, should be told this: ‘Venerable sir, defilements born of engaging in action do not exist in you, and defilements born of regret do not increase. It would be good, venerable sir, if you develop your mind and wisdom. In this way, venerable sir, you will become equal to that fifth individual.’\n\nThus, monks, these four types of individuals, being exhorted and instructed in this way by that fifth individual, gradually attain the destruction of the defilements.",
      "sinhala": "මහණෙනි, ලෝකයෙහි පස් ආකාර වූ පුද්ගලයෝ සිටිති, විද්‍යමාන වෙති. කවරහුද ඒ පස්දෙනා?\n\nමහණෙනි, මෙහිලා එක්තරා පුද්ගලයෙක් යම් කිසිවක් ආරම්භ කරයිද, (ඒ ගැන) පසුතැවිලි වේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයි.\n\nමහණෙනි, මෙහිලා තවත් එක්තරා පුද්ගලයෙක් යම් කිසිවක් ආරම්භ කරයිද, (ඒ ගැන) පසුතැවිලි නොවේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයි.\n\nමහණෙනි, මෙහිලා තවත් එක්තරා පුද්ගලයෙක් යම් කිසිවක් ආරම්භ නොකරයිද, (ඒ ගැන) පසුතැවිලි වේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයි.\n\nමහණෙනි, මෙහිලා තවත් එක්තරා පුද්ගලයෙක් යම් කිසිවක් ආරම්භ නොකරයිද, (ඒ ගැන) පසුතැවිලි නොවේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයි.\n\nමහණෙනි, මෙහිලා තවත් එක්තරා පුද්ගලයෙක් යම් කිසිවක් ආරම්භ නොකරයිද, (ඒ ගැන) පසුතැවිලි නොවේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ කරයි.\n\nමහණෙනි, ඒ අතුරින් යම් පුද්ගලයෙක් යම් කිසිවක් ආරම්භ කරයිද, පසුතැවිලි වේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයිද, ඔහුට මෙසේ කිව යුත්තේය: ‘ආයුෂ්මතුන්හට ආරම්භය නිසා හටගත් ආශ්‍රවයෝ ඇත්තාහ, පසුතැවීම නිසා හටගත් ආශ්‍රවයෝ වර්ධනය වෙති. එසේ වී නම් ආයුෂ්මත්නි, ඔබ ආරම්භය නිසා හටගත් ආශ්‍රවයන් ප්‍රහීණ කොට, පසුතැවීම නිසා හටගත් ආශ්‍රවයන් දුරු කොට, සිතත් ප්‍රඥාවත් දියුණු කරනු මැනව. මෙසේ ආයුෂ්මත් අර පස්වැනි පුද්ගලයා හා සමාන වන්නේය.’\n\nමහණෙනි, ඒ අතුරින් යම් පුද්ගලයෙක් යම් කිසිවක් ආරම්භ කරයිද, පසුතැවිලි නොවේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයිද, ඔහුට මෙසේ කිව යුත්තේය: ‘ආයුෂ්මතුන්හට ආරම්භය නිසා හටගත් ආශ්‍රවයෝ ඇත්තාහ, පසුතැවීම නිසා හටගත් ආශ්‍රවයෝ වර්ධනය නොවෙති. එසේ වී නම් ආයුෂ්මත්නි, ඔබ ආරම්භය නිසා හටගත් ආශ්‍රවයන් ප්‍රහීණ කොට සිතත් ප්‍රඥාවත් දියුණු කරනු මැනව. මෙසේ ආයුෂ්මත් අර පස්වැනි පුද්ගලයා හා සමාන වන්නේය.’\n\nමහණෙනි, ඒ අතුරින් යම් පුද්ගලයෙක් යම් කිසිවක් ආරම්භ නොකරයිද, පසුතැවිලි වේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයිද, ඔහුට මෙසේ කිව යුත්තේය: ‘ආයුෂ්මතුන්හට ආරම්භය නිසා හටගත් ආශ්‍රවයෝ නැත්තාහ, පසුතැවීම නිසා හටගන්නා ආශ්‍රවයෝ වර්ධනය වෙති. එසේ වී නම් ආයුෂ්මත්නි, ඔබ පසුතැවීම නිසා හටගත් ආශ්‍රවයන් දුරු කොට සිතත් ප්‍රඥාවත් දියුණු කරනු මැනව. මෙසේ ආයුෂ්මත් අර පස්වැනි පුද්ගලයා හා සමාන වන්නේය.’\n\nමහණෙනි, ඒ අතුරින් යම් පුද්ගලයෙක් යම් කිසිවක් ආරම්භ නොකරයිද, පසුතැවිලි නොවේද, ඔහුට හටගත් ඒ පාපී අකුසල ධර්මයන් කිසිදු අවශේෂයක් නොමැතිව නිරුද්ධ වන ඒ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය යථාභූතව අවබෝධ නොකරයිද, ඔහුට මෙසේ කිව යුත්තේය: ‘ආයුෂ්මතුන්හට ආරම්භය නිසා හටගත් ආශ්‍රවයෝ නැත්තාහ, පසුතැවීම නිසා හටගන්නා ආශ්‍රවයෝ වර්ධනය නොවෙති. එසේ වී නම් ආයුෂ්මත්නි, ඔබ සිතත් ප්‍රඥාවත් දියුණු කරනු මැනව. මෙසේ ආයුෂ්මත් අර පස්වැනි පුද්ගලයා හා සමාන වන්නේය.’\n\nමහණෙනි, මෙසේ මේ සතර පුද්ගලයෝ අර පස්වැනි පුද්ගලයා විසින් මෙසේ අවවාද කරනු ලබමින්, මෙසේ අනුශාසනා කරනු ලබමින් ක්‍රමානුකූලව ආශ්‍රවයන්ගේ ක්ෂයභාවයට පත්වෙති.",
      "paliTitle": "Ārabhatisuttaṃ",
      "englishTitle": "The Discourse on One Who Begins",
      "sinhalaTitle": "ආරභති සූත්‍රය"
    },
    {
      "number": 143,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Tena kho pana samayena pañcamattānaṃ licchavisatānaṃ sārandade cetiye sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘pañcannaṃ ratanānaṃ pātubhāvo dullabho lokasmiṃ. Katamesaṃ pañcannaṃ? Hatthiratanassa pātubhāvo dullabho lokasmiṃ, assaratanassa pātubhāvo dullabho lokasmiṃ, maṇiratanassa pātubhāvo dullabho lokasmiṃ, itthiratanassa pātubhāvo dullabho lokasmiṃ, gahapatiratanassa pātubhāvo dullabho lokasmiṃ. Imesaṃ pañcannaṃ ratanānaṃ pātubhāvo dullabho lokasmi’’nti. Atha kho te licchavī magge purisaṃ ṭhapesuṃ [pesesuṃ (syā. ka.)] – ‘‘yadā tvaṃ [yathā tvaṃ (sī. pī.)], ambho purisa, passeyyāsi bhagavantaṃ, atha amhākaṃ āroceyyāsī’’ti. Addasā kho so puriso bhagavantaṃ dūratova āgacchantaṃ; disvāna yena te licchavī tenupasaṅkami; upasaṅkamitvā te licchavī etadavoca – ‘‘ayaṃ so, bhante, bhagavā gacchati arahaṃ sammāsambuddho; yassadāni kālaṃ maññathā’’ti. Atha kho te licchavī yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho te licchavī bhagavantaṃ etadavocuṃ – ‘‘Sādhu, bhante, yena sārandadaṃ cetiyaṃ tenupasaṅkamatu anukampaṃ upādāyā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho bhagavā yena sārandadaṃ cetiyaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā te licchavī etadavoca – ‘‘kāya nuttha, licchavī, etarahi kathāya sannisinnā, kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idha, bhante, amhākaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘pañcannaṃ ratanānaṃ pātubhāvo dullabho lokasmiṃ. Katamesaṃ pañcannaṃ? Hatthiratanassa pātubhāvo dullabho lokasmiṃ, assaratanassa pātubhāvo dullabho lokasmiṃ, maṇiratanassa pātubhāvo dullabho lokasmiṃ, itthiratanassa pātubhāvo dullabho lokasmiṃ, gahapatiratanassa pātubhāvo dullabho lokasmiṃ. Imesaṃ pañcannaṃ ratanānaṃ pātubhāvo dullabho lokasmi’’’nti. ‘‘Kāmādhimuttānaṃ vata, bho, licchavīnaṃ [kāmādhimuttānaṃ vata vo licchavīnaṃ (sī.), kāmādhimuttānaṃ vata vo licchavī (syā.), kāmādhimuttānaṃva vo licchavī (?)] kāmaṃyeva ārabbha antarākathā udapādi. Pañcannaṃ, licchavī, ratanānaṃ pātubhāvo dullabho lokasmiṃ. Katamesaṃ pañcannaṃ? Tathāgatassa arahato sammāsambuddhassa pātubhāvo dullabho lokasmiṃ, tathāgatappaveditassa dhammavinayassa desetā puggalo dullabho lokasmiṃ, tathāgatappaveditassa dhammavinayassa desitassa viññātā puggalo dullabho lokasmiṃ, tathāgatappaveditassa dhammavinayassa desitassa viññātā [viññātassa (sī. pī.) a. ni. 5.195] dhammānudhammappaṭipanno puggalo dullabho lokasmiṃ, kataññū katavedī puggalo dullabho lokasmiṃ. Imesaṃ kho, licchavī, pañcannaṃ ratanānaṃ pātubhāvo dullabho lokasmi’’nti. Tatiyaṃ.",
      "english": "At one time, the Blessed One was dwelling in Vesālī, in the Great Wood, in the Gabled Hall.\n\nThen, in the forenoon, the Blessed One dressed, and taking his bowl and robe, entered Vesālī for alms. Now at that time, some five hundred Licchavis were assembled in the Sārandada Shrine, seated together. This discussion arose among them: \"The appearance of five jewels is rare in the world. Which five? The appearance of a jewel of an elephant is rare in the world, the appearance of a jewel of a horse is rare in the world, the appearance of a jewel of a gem is rare in the world, the appearance of a jewel of a woman is rare in the world, the appearance of a jewel of a householder is rare in the world. The appearance of these five jewels is rare in the world.\"\n\nThen those Licchavis stationed a man on the road, saying, \"Friend, when you see the Blessed One, then inform us.\"\n\nThat man indeed saw the Blessed One coming from afar. Having seen him, he approached those Licchavis. Having approached, he said to those Licchavis, \"Sirs, here comes the Blessed One, the Arahant, the Perfectly Self-Enlightened One. Do now what you deem fitting.\"\n\nThen those Licchavis approached the Blessed One. Having approached and paid homage to the Blessed One, they stood to one side. Standing to one side, those Licchavis said to the Blessed One, \"It would be good, Venerable Sir, if the Blessed One would approach the Sārandada Shrine, out of compassion.\" The Blessed One assented by his silence.\n\nThen the Blessed One approached the Sārandada Shrine. Having approached, he sat down on the appointed seat.\n\nHaving sat down, the Blessed One said to those Licchavis, \"Licchavis, with what talk are you now seated here? And what was the discussion that was left unfinished among you?\"\n\n\"Here, Venerable Sir, while we were assembled and seated together, this discussion arose among us: 'The appearance of five jewels is rare in the world. Which five? The appearance of a jewel of an elephant is rare in the world, the appearance of a jewel of a horse is rare in the world, the appearance of a jewel of a gem is rare in the world, the appearance of a jewel of a woman is rare in the world, the appearance of a jewel of a householder is rare in the world. The appearance of these five jewels is rare in the world.'\"\n\n\"Indeed, Licchavis, your discussion, focused on sensual pleasures as you are, arose concerning sensual pleasures. Licchavis, the appearance of five other jewels is rare in the world. Which five? The appearance of a Tathāgata, an Arahant, a Perfectly Self-Enlightened One, is rare in the world. Rare in the world is a person who proclaims the Dhamma-Vinaya taught by the Tathāgata. Rare in the world is a person who understands the Dhamma-Vinaya that has been proclaimed by the Tathāgata. Rare in the world is a person who, having understood the Dhamma-Vinaya proclaimed by the Tathāgata, practices in conformity with the Dhamma. Rare in the world is a person who is grateful and acknowledges gratitude. Indeed, Licchavis, the appearance of these five jewels is rare in the world.\"",
      "sinhala": "එකල්හි භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි මහා වනයෙහි කූටාගාර ශාලාවේ වැඩසිටියහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන වෙසාලියට පිඬු පිණිස වැඩිය සේක. ඒ සමයෙහි පන්සියයක පමණ ලිච්ඡවීන් පිරිසක් සාරන්දද චෛත්‍යයෙහි රැස්ව සිටියදී, ඔවුන් අතර මේ කතාව ඇතිවිය – ‘‘ලෝකයෙහි රත්න පහක පහළවීම දුර්ලභ ය. ඒ කවර රත්න පහක ද? ලෝකයෙහි හස්ති රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි අශ්ව රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි මාණික්‍ය රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි ස්ත්‍රී රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි ගෘහපති රත්නයක පහළවීම දුර්ලභ ය. මේ රත්න පහක පහළවීම ලෝකයෙහි දුර්ලභ ය’’ යනුවෙනි.\n\nඉක්බිති ඒ ලිච්ඡවීහු මගෙහි පුරුෂයෙකු පිහිටුවා – ‘‘භවත් පුරුෂය, ඔබ භාග්‍යවතුන් වහන්සේ දුටු විට අපට දන්වන්න’’ යැයි කීහ. ඒ පුරුෂයා භාග්‍යවතුන් වහන්සේ දුරින් වඩිනු දුටුවේ ය; දැක, ඒ ලිච්ඡවීන් සිටි තැනට පැමිණියේ ය; පැමිණ, ඒ ලිච්ඡවීන්ට මෙසේ කීවේ ය – ‘‘ස්වාමීනි, අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වන භාග්‍යවතුන් වහන්සේ වඩින සේක; දැන් ඔබ යමක් සුදුසු යැයි සිතන්නහු ද එය කරන්න’’ යනුවෙනි. ඉක්බිති ඒ ලිච්ඡවීහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව සිටියහ. එකත්පස්ව සිටි ඒ ලිච්ඡවීහු භාග්‍යවතුන් වහන්සේට මෙසේ කීහ – ‘‘ස්වාමීනි, යහපති, අනුකම්පාවෙන් සාරන්දද චෛත්‍යය වෙත වැඩම කරන්නැයි’’ කීහ. භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දතාවයෙන් එය ඉවසූ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ සාරන්දද චෛත්‍යය වෙත වැඩම කළ සේක; වැඩම කොට පනවන ලද ආසනයෙහි වැඩහුන් සේක. වැඩහිඳි භාග්‍යවතුන් වහන්සේ ඒ ලිච්ඡවීන්ට මෙසේ වදාළ සේක – ‘‘ලිච්ඡවීනි, ඔබ දැන් කවර කතාවකින් රැස්ව සිටින්නහු ද? ඔබට අතරමගදී අත්හැර දැමූ කතාව කුමක් ද?’’ යනුවෙනි. ‘‘ස්වාමීනි, මෙහි අප රැස්ව සිටියදී, අතරමගදී මේ කතාව ඇතිවිය – ‘ලෝකයෙහි රත්න පහක පහළවීම දුර්ලභ ය. ඒ කවර රත්න පහක ද? ලෝකයෙහි හස්ති රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි අශ්ව රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි මාණික්‍ය රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි ස්ත්‍රී රත්නයක පහළවීම දුර්ලභ ය, ලෝකයෙහි ගෘහපති රත්නයක පහළවීම දුර්ලභ ය. මේ රත්න පහක පහළවීම ලෝකයෙහි දුර්ලභ ය’ යනුවෙනි.’’ ‘‘ලිච්ඡවීනි, කාමයන් කෙරෙහි ඇලුණු ඔබගේ අතරමගදී කාමයන්ම අරමුණු කොට කතාවක් ඇතිවිය. ලිච්ඡවීනි, ලෝකයෙහි රත්න පහක පහළවීම දුර්ලභ ය. ඒ කවර රත්න පහක ද? ලෝකයෙහි අරහත් සම්මා සම්බුදු තථාගතයන් වහන්සේ නමකගේ පහළවීම දුර්ලභ ය, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරන පුද්ගලයා දුර්ලභ ය, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරන ලද විට එය අවබෝධ කරගන්නා පුද්ගලයා දුර්ලභ ය, තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරන ලද විට, එය අවබෝධ කරගෙන ධර්මානුධර්ම ප්‍රතිපදාවේ හැසිරෙන පුද්ගලයා දුර්ලභ ය, කළගුණ දන්නා, කළගුණ සලකන පුද්ගලයා දුර්ලභ ය. ලිච්ඡවීනි, මේ රත්න පහක පහළවීම ලෝකයෙහි දුර්ලභ ය.’’ තෙවන වරට යි.",
      "paliTitle": "Sārandadasuttaṃ",
      "englishTitle": "Sārandada Sutta",
      "sinhalaTitle": "සාරන්දද සූත්‍රය"
    },
    {
      "number": 144,
      "pali": "Ekaṃ samayaṃ bhagavā sākete viharati tikaṇḍakīvane [kaṇḍakīvane (saṃ. ni. 5.902)]. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Sādhu, bhikkhave, bhikkhu kālena kālaṃ appaṭikūle paṭikūlasaññī [appaṭikkūle paṭikkūlasaññī (sī. syā. kaṃ. pī.)] vihareyya. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paṭikūle appaṭikūlasaññī vihareyya. Sādhu, bhikkhave, bhikkhu kālena kālaṃ appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyya sato sampajāno. ‘‘Kiñca [kathañca (sī. pī. ka.)], bhikkhave, bhikkhu atthavasaṃ paṭicca appaṭikūle paṭikūlasaññī vihareyya? ‘Mā me rajanīyesu dhammesu rāgo udapādī’ti – idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca appaṭikūle paṭikūlasaññī vihareyya. ‘‘Kiñca, bhikkhave, bhikkhu atthavasaṃ paṭicca paṭikūle appaṭikūlasaññī vihareyya? ‘Mā me dosanīyesu dhammesu doso udapādī’ti – idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca paṭikūle appaṭikūlasaññī vihareyya. ‘‘Kiñca, bhikkhave, bhikkhu atthavasaṃ paṭicca appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya? ‘Mā me rajanīyesu dhammesu rāgo udapādi, mā me dosanīyesu dhammesu doso udapādī’ti – idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya. ‘‘Kiñca, bhikkhave, bhikkhu atthavasaṃ paṭicca paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya? ‘Mā me dosanīyesu dhammesu doso udapādi, mā me rajanīyesu dhammesu rāgo udapādī’ti – idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya. ‘‘Kiñca, bhikkhave, bhikkhu atthavasaṃ paṭicca paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyya? ‘Sato sampajāno mā me kvacani [kvacini (sī. syā. pī.)] katthaci kiñcanaṃ [kiñcana (sī. pī.)] rajanīyesu dhammesu rāgo udapādi, mā me kvacani katthaci kiñcanaṃ dosanīyesu dhammesu doso udapādi, mā me kvacani katthaci kiñcanaṃ mohanīyesu dhammesu moho udapādī’ti – idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyya sato sampajāno’’ti. Catutthaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Sāketa, in the Tikaṇḍakī forest. There, the Blessed One addressed the monks, \"Monks!\"\n\n\"Venerable Sir,\" those monks replied to the Blessed One.\n\nThe Blessed One spoke this: \"It is good, monks, for a monk at times to dwell perceiving repulsion in what is not repulsive. It is good, monks, for a monk at times to dwell perceiving non-repulsion in what is repulsive. It is good, monks, for a monk at times to dwell perceiving repulsion in both what is not repulsive and what is repulsive. It is good, monks, for a monk at times to dwell perceiving non-repulsion in both what is repulsive and what is not repulsive. It is good, monks, for a monk at times to dwell with equanimity, mindful and clearly comprehending, having abandoned both repulsion and non-repulsion.\n\n\"And for what purpose, monks, should a monk dwell perceiving repulsion in what is not repulsive? 'May lust not arise in me towards things that excite lust' – for this purpose, monks, a monk should dwell perceiving repulsion in what is not repulsive.\n\n\"And for what purpose, monks, should a monk dwell perceiving non-repulsion in what is repulsive? 'May hatred not arise in me towards things that excite hatred' – for this purpose, monks, a monk should dwell perceiving non-repulsion in what is repulsive.\n\n\"And for what purpose, monks, should a monk dwell perceiving repulsion in both what is not repulsive and what is repulsive? 'May lust not arise in me towards things that excite lust, and may hatred not arise in me towards things that excite hatred' – for this purpose, monks, a monk should dwell perceiving repulsion in both what is not repulsive and what is repulsive.\n\n\"And for what purpose, monks, should a monk dwell perceiving non-repulsion in both what is repulsive and what is not repulsive? 'May hatred not arise in me towards things that excite hatred, and may lust not arise in me towards things that excite lust' – for this purpose, monks, a monk should dwell perceiving non-repulsion in both what is repulsive and what is not repulsive.\n\n\"And for what purpose, monks, should a monk dwell with equanimity, having abandoned both repulsion and non-repulsion? 'Mindful and clearly comprehending, may lust not arise in me anywhere, in any way, regarding anything, towards things that excite lust; may hatred not arise in me anywhere, in any way, regarding anything, towards things that excite hatred; and may delusion not arise in me anywhere, in any way, regarding anything, towards things that excite delusion' – for this purpose, monks, a monk should dwell with equanimity, mindful and clearly comprehending, having abandoned both repulsion and non-repulsion.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍ය‍වතුන් වහන්සේ සාකේත නුවර තිකණ්ඩකී වනයෙහි වැඩසිටින සේක. එහිදී භාග්‍ය‍වතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" කියා වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍ය‍වතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍ය‍වතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, භික්ෂුව කලින් කලට නොපිළිකුල් වූ දෙයෙහි පිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ නම් එය යහපත් ය. මහණෙනි, භික්ෂුව කලින් කලට පිළිකුල් වූ දෙයෙහි නොපිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ නම් එය යහපත් ය. මහණෙනි, භික්ෂුව කලින් කලට නොපිළිකුල් වූ දෙයෙහි ද, පිළිකුල් වූ දෙයෙහි ද පිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ නම් එය යහපත් ය. මහණෙනි, භික්ෂුව කලින් කලට පිළිකුල් වූ දෙයෙහි ද, නොපිළිකුල් වූ දෙයෙහි ද නොපිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ නම් එය යහපත් ය. මහණෙනි, භික්ෂුව කලින් කලට පිළිකුල් වූ දෙය සහ නොපිළිකුල් වූ දෙය යන දෙකම මුළුමනින්ම දුරලමින්, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් යුක්තව වාසය කරන්නේ නම් එය යහපත් ය.\n\nමහණෙනි, භික්ෂුව කුමක් අරමුණු කරගෙන ද නොපිළිකුල් වූ දෙයෙහි පිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ? 'මට රාගයට හේතු වන ධර්‍මයන් කෙරෙහි රාගය නූපදේවා'යි. මහණෙනි, භික්ෂුව මෙය අරමුණු කරගෙනයි නොපිළිකුල් වූ දෙයෙහි පිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ.\n\nමහණෙනි, භික්ෂුව කුමක් අරමුණු කරගෙන ද පිළිකුල් වූ දෙයෙහි නොපිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ? 'මට ද්වේෂයට හේතු වන ධර්‍මයන් කෙරෙහි ද්වේෂය නූපදේවා'යි. මහණෙනි, භික්ෂුව මෙය අරමුණු කරගෙනයි පිළිකුල් වූ දෙයෙහි නොපිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ.\n\nමහණෙනි, භික්ෂුව කුමක් අරමුණු කරගෙන ද නොපිළිකුල් වූ දෙයෙහි ද, පිළිකුල් වූ දෙයෙහි ද පිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ? 'මට රාගයට හේතු වන ධර්‍මයන් කෙරෙහි රාගය නූපදේවා, ද්වේෂයට හේතු වන ධර්‍මයන් කෙරෙහි ද්වේෂය නූපදේවා'යි. මහණෙනි, භික්ෂුව මෙය අරමුණු කරගෙනයි නොපිළිකුල් වූ දෙයෙහි ද, පිළිකුල් වූ දෙයෙහි ද පිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ.\n\nමහණෙනි, භික්ෂුව කුමක් අරමුණු කරගෙන ද පිළිකුල් වූ දෙයෙහි ද, නොපිළිකුල් වූ දෙයෙහි ද නොපිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ? 'මට ද්වේෂයට හේතු වන ධර්‍මයන් කෙරෙහි ද්වේෂය නූපදේවා, රාගයට හේතු වන ධර්‍මයන් කෙරෙහි රාගය නූපදේවා'යි. මහණෙනි, භික්ෂුව මෙය අරමුණු කරගෙනයි පිළිකුල් වූ දෙයෙහි ද, නොපිළිකුල් වූ දෙයෙහි ද නොපිළිකුල් සංඥා ඇති කරගෙන වාසය කරන්නේ.\n\nමහණෙනි, භික්ෂුව කුමක් අරමුණු කරගෙන ද පිළිකුල් වූ දෙය සහ නොපිළිකුල් වූ දෙය යන දෙකම මුළුමනින්ම දුරලමින්, උපේක්ෂාවෙන් යුක්තව වාසය කරන්නේ? 'සිහි නුවණින් යුතුව, කිසි තැනක, කිසි කලක, කිසිවක් කෙරෙහි රාගයට හේතු වන ධර්‍මයන් කෙරෙහි රාගය නූපදේවා, ද්වේෂයට හේතු වන ධර්‍මයන් කෙරෙහි ද්වේෂය නූපදේවා, මෝහයට හේතු වන ධර්‍මයන් කෙරෙහි මෝහය නූපදේවා'යි. මහණෙනි, භික්ෂුව මෙය අරමුණු කරගෙනයි පිළිකුල් වූ දෙය සහ නොපිළිකුල් වූ දෙය යන දෙකම මුළුමනින්ම දුරලමින්, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් යුක්තව වාසය කරන්නේ.\"",
      "paliTitle": "Tikaṇḍakīsuttaṃ",
      "englishTitle": "Discourse at Tikandaki",
      "sinhalaTitle": "තිකණ්ඩකී සූත්‍රය"
    },
    {
      "number": 145,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, surāmerayamajjapamādaṭṭhāyī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Pañcamaṃ.",
      "english": "Monks, one endowed with five qualities is consigned directly to hell, just as if picked up and placed there. What are these five? One takes life, one takes what is not given, one engages in sexual misconduct, one speaks falsely, one consumes intoxicants that cause heedlessness. Indeed, monks, one endowed with these five qualities is consigned directly to hell, just as if picked up and placed there.\n\nMonks, one endowed with five qualities is consigned directly to heaven, just as if picked up and placed there. What are these five? One abstains from taking life, one abstains from taking what is not given, one abstains from sexual misconduct, one abstains from false speech, one abstains from intoxicants that cause heedlessness. Indeed, monks, one endowed with these five qualities is consigned directly to heaven, just as if picked up and placed there.",
      "sinhala": "භික්ෂූණි, ධර්මයන් පසකින් සමන්වාගත වූ තැනැත්තා, යම් සේ (කිසිදු බාධාවකින් තොරව) ගෙනැවිත් තබන ලද්දේද, එසේම නිරයට පැමිණේ. කවර පසකින්ද යත්: ප‍්‍රාණඝාතයෙහි යෙදෙන්නේය, අදත්තාදානයෙහි යෙදෙන්නේය, කාමයන්හි මිසදිටු පැවැත්මෙහි යෙදෙන්නේය, මුසාවාදයෙහි යෙදෙන්නේය, සුරාමේරය මත්පැන් පානය කිරීමෙන් සිදුවන ප‍්‍රමාදයෙහි පිහිටා සිටින්නේය. භික්ෂූණි, මේ ධර්මයන් පසින් සමන්වාගත වූ තැනැත්තා, යම් සේ (කිසිදු බාධාවකින් තොරව) ගෙනැවිත් තබන ලද්දේද, එසේම නිරයට පැමිණේ.\n\nභික්ෂූණි, ධර්මයන් පසකින් සමන්වාගත වූ තැනැත්තා, යම් සේ (කිසිදු බාධාවකින් තොරව) ගෙනැවිත් තබන ලද්දේද, එසේම ස්වර්ගයට පැමිණේ. කවර පසකින්ද යත්: ප‍්‍රාණඝාතයෙන් වැළකී සිටින්නේය, අදත්තාදානයෙන් වැළකී සිටින්නේය, කාමයන්හි මිසදිටු පැවැත්මෙන් වැළකී සිටින්නේය, මුසාවාදයෙන් වැළකී සිටින්නේය, සුරාමේරය මත්පැන් පානය කිරීමෙන් සිදුවන ප‍්‍රමාදයෙන් වැළකී සිටින්නේය. භික්ෂූණි, මේ ධර්මයන් පසින් සමන්වාගත වූ තැනැත්තා, යම් සේ (කිසිදු බාධාවකින් තොරව) ගෙනැවිත් තබන ලද්දේද, එසේම ස්වර්ගයට පැමිණේ.",
      "paliTitle": "Nirayasuttaṃ",
      "englishTitle": "The Discourse on Hell",
      "sinhalaTitle": "නිරය සූත්‍රය"
    },
    {
      "number": 146,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu mitto na sevitabbo. Katamehi pañcahi? Kammantaṃ kāreti, adhikaraṇaṃ ādiyati, pāmokkhesu bhikkhūsu paṭiviruddho hoti, dīghacārikaṃ anavatthacārikaṃ [avatthānacārikaṃ (syā.)] anuyutto viharati, nappaṭibalo hoti kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu mitto na sevitabbo. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu mitto sevitabbo. Katamehi pañcahi? Na kammantaṃ kāreti, na adhikaraṇaṃ ādiyati, na pāmokkhesu bhikkhūsu paṭiviruddho hoti, na dīghacārikaṃ anavatthacārikaṃ anuyutto viharati, paṭibalo hoti kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu mitto sevitabbo’’ti. Chaṭṭhaṃ.",
      "english": "Monks, a monk-friend endowed with five qualities should not be associated with. Which five? He is preoccupied with worldly affairs, he gets involved in disputes, he is antagonistic towards leading monks, he indulges in long and aimless wandering, and he is not capable, from time to time, of explaining, encouraging, inspiring, and gladdening through Dhamma talk. Monks, a monk-friend endowed with these five qualities should not be associated with.\n\nMonks, a monk-friend endowed with five qualities should be associated with. Which five? He is not preoccupied with worldly affairs, he does not get involved in disputes, he is not antagonistic towards leading monks, he does not indulge in long and aimless wandering, and he is capable, from time to time, of explaining, encouraging, inspiring, and gladdening through Dhamma talk. Monks, a monk-friend endowed with these five qualities should be associated with.",
      "sinhala": "භික්ෂූනි, කරුණු පහකින් සමන්විත වූ භික්ෂුවක් මිතුරා ලෙස ඇසුරු නොකළ යුතුයි. ඒ කරුණු පහ කවරේද?\n\nඔහු කර්මාන්ත කරවයි. අධිකරණ ඇතිකර ගනියි. ප්‍රමුඛ භික්ෂූන් සමඟ විරුද්ධව සිටියි. දිගු සංචාරයන්හි, අරමුණක් රහිතව නොනැවතී හැසිරීමෙහි යෙදී වාසය කරයි. කලින් කලට ධ‍ර්ම කථාවකින් අන්‍යයන්ට ධ‍ර්මය පැහැදිලි කිරීමටත්, සදාචාර සම්පන්න ජීවිතයකට යොමු කිරීමටත්, උනන්දු කරවීමටත්, සතුටු කරවීමටත් සමත් නොවේ. භික්ෂූනි, මේ කරුණු පහකින් සමන්විත වූ භික්ෂුවක් මිතුරා ලෙස ඇසුරු නොකළ යුතුයි.\n\nභික්ෂූනි, කරුණු පහකින් සමන්විත වූ භික්ෂුවක් මිතුරා ලෙස ඇසුරු කළ යුතුයි. ඒ කරුණු පහ කවරේද?\n\nඔහු කර්මාන්ත නොකරවයි. අධිකරණ ඇතිකර නොගනියි. ප්‍රමුඛ භික්ෂූන් සමඟ විරුද්ධව නොසිටියි. දිගු සංචාරයන්හි, අරමුණක් රහිතව නොනැවතී හැසිරීමෙහි යෙදී වාසය නොකරයි. කලින් කලට ධ‍ර්ම කථාවකින් අන්‍යයන්ට ධ‍ර්මය පැහැදිලි කිරීමටත්, සදාචාර සම්පන්න ජීවිතයකට යොමු කිරීමටත්, උනන්දු කරවීමටත්, සතුටු කරවීමටත් සමත් වේ. භික්ෂූනි, මේ කරුණු පහකින් සමන්විත වූ භික්ෂුවක් මිතුරා ලෙස ඇසුරු කළ යුතුයි.",
      "paliTitle": "Mittasuttaṃ",
      "englishTitle": "The Discourse on Friends",
      "sinhalaTitle": "මිත්ත සූත්‍රය"
    },
    {
      "number": 147,
      "pali": "‘‘Pañcimāni, bhikkhave, asappurisadānāni. Katamāni pañca? Asakkaccaṃ deti, acittīkatvā [acittikatvā (pī.), acitiṃ katvā (syā.), acittiṃ katvā (ka.)] deti, asahatthā deti, apaviddhaṃ [apaviṭṭaṃ (syā. kaṃ.)] deti, anāgamanadiṭṭhiko deti. Imāni kho, bhikkhave, pañca asappurisadānāni. ‘‘Pañcimāni, bhikkhave, sappurisadānāni. Katamāni pañca? Sakkaccaṃ deti, cittīkatvā deti, sahatthā deti, anapaviddhaṃ deti, āgamanadiṭṭhiko deti. Imāni kho, bhikkhave, pañca sappurisadānānī’’ti. Sattamaṃ.",
      "english": "There are these five kinds of giving by ignoble persons, monks. Which five? One gives disrespectfully, one gives without appreciation, one gives not with one’s own hand, one gives discarded things, and one gives without believing in future results. These, monks, are the five kinds of giving by ignoble persons.\n\nThere are these five kinds of giving by noble persons, monks. Which five? One gives respectfully, one gives with appreciation, one gives with one’s own hand, one gives non-discarded things, and one gives believing in future results. These, monks, are the five kinds of giving by noble persons.",
      "sinhala": "භික්ෂූනි, මේවා අසත්පුරුෂ දාන පහකි. කවරවාද ඒ පහ? නොසැලකිලිමත්ව දෙයි, සිතෙහි ගෞරවයකින් තොරව දෙයි, තමාගේ අතින් නොදෙයි, ඉවත ලූ දෙයක් මෙන් නොසලකා දෙයි, (දීමෙන්) විපාකයක් නොලැබේය යන දෘෂ්ටියෙන් යුතුව දෙයි. භික්ෂූනි, මේවා අසත්පුරුෂ දාන පහයි.\n\nභික්ෂූනි, මේවා සත්පුරුෂ දාන පහකි. කවරවාද ඒ පහ? සැලකිලිමත්ව දෙයි, සිතෙහි ගෞරවයකින් යුතුව දෙයි, තමාගේ අතින් දෙයි, ඉවත නොලූ නොහොත් වටිනා දෙයක් දෙයි, (දීමෙන්) විපාකයක් ලැබේය යන දෘෂ්ටියෙන් යුතුව දෙයි. භික්ෂූනි, මේවා සත්පුරුෂ දාන පහයි.",
      "paliTitle": "Asappurisadānasuttaṃ",
      "englishTitle": "Giving of a Person of No Integrity Sutta",
      "sinhalaTitle": "අසප්පුරිස දාන සූත්‍රය"
    },
    {
      "number": 148,
      "pali": "‘‘Pañcimāni, bhikkhave, sappurisadānāni. Katamāni pañca? Saddhāya dānaṃ deti, sakkaccaṃ dānaṃ deti, kālena dānaṃ deti, anuggahitacitto [anaggahitacitto (sī.)] dānaṃ deti, attānañca parañca anupahacca dānaṃ deti. ‘‘Saddhāya kho pana, bhikkhave, dānaṃ datvā yattha yattha tassa dānassa vipāko nibbattati, aḍḍho ca hoti mahaddhano mahābhogo, abhirūpo ca hoti dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato. ‘‘Sakkaccaṃ kho pana, bhikkhave, dānaṃ datvā yattha yattha tassa dānassa vipāko nibbattati, aḍḍho ca hoti mahaddhano mahābhogo. Yepissa te honti puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti [kammakārāti (ka.)] vā, tepi sussūsanti sotaṃ odahanti aññā cittaṃ upaṭṭhapenti. ‘‘Kālena kho pana, bhikkhave, dānaṃ datvā yattha yattha tassa dānassa vipāko nibbattati, aḍḍho ca hoti mahaddhano mahābhogo; kālāgatā cassa atthā pacurā honti. ‘‘Anuggahitacitto kho pana, bhikkhave, dānaṃ datvā yattha yattha tassa dānassa vipāko nibbattati, aḍḍho ca hoti mahaddhano mahābhogo; uḷāresu ca pañcasu kāmaguṇesu bhogāya cittaṃ namati. ‘‘Attānañca parañca anupahacca kho pana, bhikkhave, dānaṃ datvā yattha yattha tassa dānassa vipāko nibbattati, aḍḍho ca hoti mahaddhano mahābhogo; na cassa kutoci bhogānaṃ upaghāto āgacchati aggito vā udakato vā rājato vā corato vā appiyato vā dāyādato vā [appiyato vā dāyādato vā (sī. syā. kaṃ. pī.), appiyadāyādato vā (ka.)]. Imāni kho, bhikkhave, pañca sappurisadānānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these are five donations of a virtuous person. Which five? One gives with faith, one gives respectfully, one gives at the proper time, one gives with a mind that seeks to benefit, and one gives without harming oneself or others.\n\nMonks, having given with faith, wherever the result of that donation ripens, one becomes wealthy, possessing great riches and great enjoyments, and one becomes beautiful, pleasant to see, charming, endowed with supreme complexion and clarity of skin.\n\nMonks, having given respectfully, wherever the result of that donation ripens, one becomes wealthy, possessing great riches and great enjoyments. And those who are one's children, spouses, slaves, servants, or workers—they too are obedient, attentive, and apply their minds to understanding.\n\nMonks, having given at the proper time, wherever the result of that donation ripens, one becomes wealthy, possessing great riches and great enjoyments; and timely advantages become abundant for one.\n\nMonks, having given with a mind that seeks to benefit, wherever the result of that donation ripens, one becomes wealthy, possessing great riches and great enjoyments; and one's mind inclines towards the enjoyment of the excellent five strands of sense pleasures.\n\nMonks, having given without harming oneself or others, wherever the result of that donation ripens, one becomes wealthy, possessing great riches and great enjoyments; and one's possessions do not suffer destruction from any quarter, be it from fire, water, rulers, thieves, or unpleasant heirs. These, monks, are the five donations of a virtuous person.",
      "sinhala": "මහණෙනි, මේ සත්පුරුෂ දාන පහකි. කවරේද ඒ පහ? ශ්‍රද්ධාවෙන් යුතුව දන් දෙයි, ගෞරවයෙන් යුතුව දන් දෙයි, සුදුසු කල්හි දන් දෙයි, උපකාර සිතිවිල්ලෙන් යුතුව දන් දෙයි, තමාට හෝ අනුන්ට හානියක් නොවන සේ දන් දෙයි.\n\nමහණෙනි, යම් තැනක ශ්‍රද්ධාවෙන් යුතුව දන් දීමේ විපාකය හට ගන්නේද, ඒ තැන ඔහු ධනවත් වන්නේය, මහත් ධනයෙන් හා මහත් සම්පත්වලින් යුක්ත වන්නේය, අතිශය රූමත්, දැකුම්කලු, ප්‍රියංකර වූ උතුම් වර්ණ සමූහයකින් යුක්ත වන්නේය.\n\nමහණෙනි, යම් තැනක ගෞරවයෙන් යුතුව දන් දීමේ විපාකය හට ගන්නේද, ඒ තැන ඔහු ධනවත් වන්නේය, මහත් ධනයෙන් හා මහත් සම්පත්වලින් යුක්ත වන්නේය. යම් ඔහුගේ පුත්‍රයෝ හෝ භාර්යාවෝ හෝ දාසයෝ හෝ පණිවිඩකරුවෝ හෝ කම්කරුවෝ වේද, ඔවුහු ද මොහුට ඇහුම්කන් දෙති, සවන් යොදති, ඔහුට සිත යොමා කටයුතු කරති.\n\nමහණෙනි, යම් තැනක සුදුසු කල්හි දන් දීමේ විපාකය හට ගන්නේද, ඒ තැන ඔහු ධනවත් වන්නේය, මහත් ධනයෙන් හා මහත් සම්පත්වලින් යුක්ත වන්නේය; ඔහුගේ කලට පැමිණි අවශ්‍යතා බහුල වන්නේය.\n\nමහණෙනි, යම් තැනක උපකාර සිතිවිල්ලෙන් යුතුව දන් දීමේ විපාකය හට ගන්නේද, ඒ තැන ඔහු ධනවත් වන්නේය, මහත් ධනයෙන් හා මහත් සම්පත්වලින් යුක්ත වන්නේය; උතුම් වූ පස්කම් ගුණ භුක්ති විඳීම සඳහා ඔහුගේ සිත නැඹුරු වන්නේය.\n\nමහණෙනි, යම් තැනක තමාට හෝ අනුන්ට හානියක් නොවන සේ දන් දීමේ විපාකය හට ගන්නේද, ඒ තැන ඔහු ධනවත් වන්නේය, මහත් ධනයෙන් හා මහත් සම්පත්වලින් යුක්ත වන්නේය; ඔහුගේ සම්පත්වලට ගින්නෙන් හෝ ජලයෙන් හෝ රජුන්ගෙන් හෝ සොර සතුරන්ගෙන් හෝ අප්‍රිය දායාදයන්ගෙන් හෝ වෙනත් කිසිවකින් හෝ හානියක් පැමිණෙන්නේ නැත. මහණෙනි, මේ සත්පුරුෂ දාන පහයි.",
      "paliTitle": "Sappurisadānasuttaṃ",
      "englishTitle": "The Discourse on the Giving of a Good Person",
      "sinhalaTitle": "සප්පුරිසදාන සූත්‍රය"
    },
    {
      "number": 149,
      "pali": "‘‘Pañcime, bhikkhave, dhammā samayavimuttassa bhikkhuno parihānāya saṃvattanti. Katame pañca? Kammārāmatā, bhassārāmatā, niddārāmatā, saṅgaṇikārāmatā, yathāvimuttaṃ cittaṃ na paccavekkhati. Ime kho, bhikkhave, pañca dhammā samayavimuttassa bhikkhuno parihānāya saṃvattanti. ‘‘Pañcime, bhikkhave, dhammā samayavimuttassa bhikkhuno aparihānāya saṃvattanti. Katame pañca? Na kammārāmatā, na bhassārāmatā, na niddārāmatā, na saṅgaṇikārāmatā, yathāvimuttaṃ cittaṃ paccavekkhati. Ime kho, bhikkhave, pañca dhammā samayavimuttassa bhikkhuno aparihānāya saṃvattantī’’ti. Navamaṃ.",
      "english": "Monks, these five things lead to the decline of a monk who is liberated periodically. Which five? Delight in activity, delight in idle talk, delight in sleep, delight in company, and not reviewing the mind as it has been liberated. Indeed, monks, these five things lead to the decline of a monk who is liberated periodically.\n\nMonks, these five things lead to the non-decline of a monk who is liberated periodically. Which five? No delight in activity, no delight in idle talk, no delight in sleep, no delight in company, and reviewing the mind as it has been liberated. Indeed, monks, these five things lead to the non-decline of a monk who is liberated periodically.",
      "sinhala": "මහණෙනි, සමයවිමුක්ත භික්ෂුවකට පිරිහීම පිණිස පවතින මේ ධර්ම කරුණු පහක් ඇත. ඒ පහ කවරේද? කර්මයන්හි ඇලීම, කථාවෙහි ඇලීම, නිද්‍රාවෙහි ඇලීම, ගණයා හා මිශ්‍ර වීමට ඇලීම, සහ යම් සේ සිත විමුක්ත වීද, එය නැවත විමර්ශනය නොකිරීම යන මේවාය. මහණෙනි, සමයවිමුක්ත භික්ෂුවකට පිරිහීම පිණිස පවතින මේ ධර්ම කරුණු පහ මේවාමයි.\n\nමහණෙනි, සමයවිමුක්ත භික්ෂුවකට නොපිරිහීම පිණිස පවතින මේ ධර්ම කරුණු පහක් ඇත. ඒ පහ කවරේද? කර්මයන්හි නොඇලීම, කථාවෙහි නොඇලීම, නිද්‍රාවෙහි නොඇලීම, ගණයා හා මිශ්‍ර වීමට නොඇලීම, සහ යම් සේ සිත විමුක්ත වීද, එය නැවත විමර්ශනය කිරීම යන මේවාය. මහණෙනි, සමයවිමුක්ත භික්ෂුවකට නොපිරිහීම පිණිස පවතින මේ ධර්ම කරුණු පහ මේවාමයි.",
      "paliTitle": "Paṭhamasamayavimuttasuttaṃ",
      "englishTitle": "The First Discourse on Temporary Release",
      "sinhalaTitle": "පළමු සමයවිමුත්ත සූත්‍රය"
    },
    {
      "number": 150,
      "pali": "[kathā. 267] ‘‘Pañcime, bhikkhave, dhammā samayavimuttassa bhikkhuno parihānāya saṃvattanti. Katame pañca? Kammārāmatā, bhassārāmatā, niddārāmatā, indriyesu aguttadvāratā, bhojane amattaññutā. Ime kho, bhikkhave, pañca dhammā samayavimuttassa bhikkhuno parihānāya saṃvattanti. ‘‘Pañcime, bhikkhave, dhammā samayavimuttassa bhikkhuno aparihānāya saṃvattanti. Katame pañca? Na kammārāmatā, na bhassārāmatā, na niddārāmatā, indriyesu guttadvāratā, bhojane mattaññutā. Ime kho, bhikkhave, pañca dhammā samayavimuttassa bhikkhuno aparihānāya saṃvattantī’’ti. Dasamaṃ. ",
      "english": "Monks, these five qualities lead to the decline of a monk who has attained temporary liberation. Which five? Delight in activity, delight in idle talk, delight in sleep, unguardedness of the sense doors, and immoderation in food. Indeed, monks, these five qualities lead to the decline of a monk who has attained temporary liberation.\n\nMonks, these five qualities lead to the non-decline of a monk who has attained temporary liberation. Which five? No delight in activity, no delight in idle talk, no delight in sleep, guardedness of the sense doors, and moderation in food. Indeed, monks, these five qualities lead to the non-decline of a monk who has attained temporary liberation.",
      "sinhala": "මහණෙනි, සමයවිමුක්ත භික්‍ෂුවකගේ පිරිහීම පිණිස පවතින ධර්ම කාරණා මේවා පසකි. කවරේද ඒ පස? ක්‍රියාශීලී කර්මයන්ට ඇල්ම, කතාබහට ඇල්ම, නිද්‍රාවට ඇල්ම, ඉන්ද්‍රියයන්හි ද්වාරයන් ආරක්ෂා නොකිරීම, භෝජනයෙහි පමණ නොදැනීම යන මේවාය. මහණෙනි, සමයවිමුක්ත භික්‍ෂුවකගේ පිරිහීම පිණිස පවතින ධර්ම කාරණා මේවා පස වන්නේය.\n\nමහණෙනි, සමයවිමුක්ත භික්‍ෂුවකගේ නොපිරිහීම පිණිස පවතින ධර්ම කාරණා මේවා පසකි. කවරේද ඒ පස? ක්‍රියාශීලී කර්මයන්ට ඇල්මක් නැතිකම, කතාබහට ඇල්මක් නැතිකම, නිද්‍රාවට ඇල්මක් නැතිකම, ඉන්ද්‍රියයන්හි ද්වාරයන් ආරක්ෂා කිරීම, භෝජනයෙහි පමණ දැනීම යන මේවාය. මහණෙනි, සමයවිමුක්ත භික්‍ෂුවකගේ නොපිරිහීම පිණිස පවතින ධර්ම කාරණා මේවා පස වන්නේය.",
      "paliTitle": "Dutiyasamayavimuttasuttaṃ",
      "englishTitle": "Second Sutta on Temporary Liberation",
      "sinhalaTitle": "දුතිය සමයවිමුත්ත සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Tikaṇḍakīvaggo pañcamo. Tassuddānaṃ – Datvā avajānāti ārabhati ca, sārandada tikaṇḍa nirayena ca; Mitto asappurisasappurisena, samayavimuttaṃ apare dveti. Tatiyapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}