{
  "id": "an5.1",
  "title": {
    "pali": "Sekhabalavaggo",
    "english": "The Chapter on the Powers of a Trainee",
    "sinhala": "ශෛක්‍ෂ බල වර්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Pañcimāni, bhikkhave, sekhabalāni [sekkhabalāni (ka.)]. Katamāni pañca? Saddhābalaṃ, hirībalaṃ [hiribalaṃ (sī. pī.)], ottappabalaṃ, vīriyabalaṃ [viriyabalaṃ (sī. syā. kaṃ. pī.)], paññābalaṃ – imāni kho, bhikkhave, pañca sekhabalāni. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘saddhābalena samannāgatā bhavissāma sekhabalena, hirībalena samannāgatā bhavissāma sekhabalena, ottappabalena samannāgatā bhavissāma sekhabalena, vīriyabalena samannāgatā bhavissāma sekhabalena, paññābalena samannāgatā bhavissāma sekhabalenā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Paṭhamaṃ.",
      "english": "Thus have I heard: At one time the Blessed One was staying in Savatthi, in Jeta's Grove, Anathapindika's monastery.\n\nThere, the Blessed One addressed the bhikkhus, saying, \"Bhikkhus.\" \"Venerable Sir,\" those bhikkhus responded to the Blessed One. The Blessed One said this: \"Bhikkhus, there are these five powers of one in training. Which five? The power of faith, the power of moral shame, the power of moral dread, the power of energy, and the power of wisdom. These, bhikkhus, are the five powers of one in training.\"\n\n\"Therefore, bhikkhus, you should train yourselves in this way: 'We will be endowed with the power of faith, the power of one in training; we will be endowed with the power of moral shame, the power of one in training; we will be endowed with the power of moral dread, the power of one in training; we will be endowed with the power of energy, the power of one in training; we will be endowed with the power of wisdom, the power of one in training.' This is how you should train yourselves, bhikkhus.\"\n\nThat is what the Blessed One said. Delighted, those bhikkhus rejoiced in the Blessed One's words.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයෙක්හි භාග‍්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඑහිදී භාග‍්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" කියා වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග‍්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග‍්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, මේ ශෛක්ෂ්‍ය බලධර්ම පහක් ඇත. ඒ පහ කුමනවාද? ශ‍්‍රද්ධා බලය, හිරි බලය, ඔතප් බලය, වීර්යය බලය, ප‍්‍රඥා බලය යි. මහණෙනි, මේ ශෛක්ෂ්‍ය බලධර්ම පහයි.\"\n\n\"එහෙයින් මහණෙනි, මෙසේ හික්මිය යුතු යි: 'අපි ශෛක්ෂ්‍ය බලයකට සුදුසු ශ‍්‍රද්ධා බලයෙන් සමන්විත වන්නෙමු. ශෛක්ෂ්‍ය බලයකට සුදුසු හිරි බලයෙන් සමන්විත වන්නෙමු. ශෛක්ෂ්‍ය බලයකට සුදුසු ඔතප් බලයෙන් සමන්විත වන්නෙමු. ශෛක්ෂ්‍ය බලයකට සුදුසු වීර්යය බලයෙන් සමන්විත වන්නෙමු. ශෛක්ෂ්‍ය බලයකට සුදුසු ප‍්‍රඥා බලයෙන් සමන්විත වන්නෙමු' කියා. මහණෙනි, නුඹලා මෙසේ හික්මිය යුතු ම යි.\"\n\nභාග‍්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග‍්‍යවතුන් වහන්සේගේ දෙසුම සතුටින් පිළිගත්හ. පළමුවැන්නයි.",
      "paliTitle": "Saṃkhittasuttaṃ"
    },
    {
      "number": 2,
      "pali": "‘‘Pañcimāni, bhikkhave, sekhabalāni. Katamāni pañca? Saddhābalaṃ, hirībalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Katamañca, bhikkhave, saddhābalaṃ? Idha, bhikkhave, ariyasāvako saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Idaṃ vuccati, bhikkhave, saddhābalaṃ. ‘‘Katamañca, bhikkhave, hirībalaṃ? Idha, bhikkhave, ariyasāvako hirimā hoti, hirīyati kāyaduccaritena vacīduccaritena manoduccaritena, hirīyati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Idaṃ vuccati, bhikkhave, hirībalaṃ. ‘‘Katamañca, bhikkhave, ottappabalaṃ? Idha, bhikkhave, ariyasāvako ottappī hoti, ottappati kāyaduccaritena vacīduccaritena manoduccaritena, ottappati pāpakānaṃ akusalānaṃ dhammānaṃ samāpattiyā. Idaṃ vuccati, bhikkhave, ottappabalaṃ. ‘‘Katamañca, bhikkhave, vīriyabalaṃ? Idha, bhikkhave, ariyasāvako āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Idaṃ vuccati, bhikkhave, vīriyabalaṃ. ‘‘Katamañca, bhikkhave, paññābalaṃ? Idha, bhikkhave, ariyasāvako paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Idaṃ vuccati, bhikkhave, paññābalaṃ. Imāni kho, bhikkhave, pañca sekhabalāni. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘saddhābalena samannāgatā bhavissāma sekhabalena, hirībalena… ottappabalena … vīriyabalena… paññābalena samannāgatā bhavissāma sekhabalenā’ti. Evañhi kho, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Monks, there are these five strengths of a learner. What are these five? The strength of faith, the strength of moral shame, the strength of moral dread, the strength of persistence, and the strength of wisdom.\n\nAnd what, monks, is the strength of faith? Here, monks, a noble disciple is endowed with faith; he places his faith in the Tathāgata's awakening, believing: 'Indeed, the Blessed One is an Arahant, a Perfectly Self-Awakened One, accomplished in knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.' This, monks, is called the strength of faith.\n\nAnd what, monks, is the strength of moral shame? Here, monks, a noble disciple is ashamed; he feels moral shame regarding misconduct by body, misconduct by speech, and misconduct by mind. He feels moral shame regarding the committing of evil, unwholesome states. This, monks, is called the strength of moral shame.\n\nAnd what, monks, is the strength of moral dread? Here, monks, a noble disciple is dread-filled; he feels moral dread regarding misconduct by body, misconduct by speech, and misconduct by mind. He feels moral dread regarding the committing of evil, unwholesome states. This, monks, is called the strength of moral dread.\n\nAnd what, monks, is the strength of persistence? Here, monks, a noble disciple dwells with aroused persistence for the abandoning of unwholesome states and for the acquisition of wholesome states. He is steadfast, firm in his exertion, not casting off the burden in wholesome states. This, monks, is called the strength of persistence.\n\nAnd what, monks, is the strength of wisdom? Here, monks, a noble disciple is wise, endowed with the wisdom that discerns rise and fall, noble, penetrative, leading to the complete destruction of suffering. This, monks, is called the strength of wisdom.\n\nThese, monks, are the five strengths of a learner. Therefore, monks, you should train yourselves thus: 'We shall be endowed with the strength of faith, which is a learner's strength; with the strength of moral shame, which is a learner's strength; with the strength of moral dread, which is a learner's strength; with the strength of persistence, which is a learner's strength; with the strength of wisdom, which is a learner's strength.' That is how you should train yourselves, monks.",
      "sinhala": "භික්ෂූනි, මේවා සේඛ බල පහකි. කවරේද ඒ පහ? ශ්‍රද්ධා බලය, හිරි බලය, ඔතප් බලය, වීර්ය බලය, ප්‍රඥා බලය යි.\n\nභික්ෂූනි, ශ්‍රද්ධා බලය කවරේද? භික්ෂූනි, මෙහි අරිය ශ්‍රාවක තෙම ශ්‍රද්ධාවෙන් යුක්ත වේ. ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මා සම්බුද්ධ, විජ්ජාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ, පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධෝ, භගවා යන ගුණාංගවලින් යුක්ත බව විශ්වාස කරයි. භික්ෂූනි, මෙය ශ්‍රද්ධා බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, හිරි බලය කවරේද? භික්ෂූනි, මෙහි අරිය ශ්‍රාවක තෙම හිරි (තමා විසින්ම ලජ්ජා වීම) ඇත්තෙක් වේ. ඔහු කයින් කරන දුසිරිත්වලින්, වචනයෙන් කරන දුසිරිත්වලින්, සිතින් කරන දුසිරිත්වලින් ලජ්ජා වේ. පව්කාර අකුසල ධර්මයන්ට සමවැදීමෙන් ලජ්ජා වේ. භික්ෂූනි, මෙය හිරි බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, ඔතප් බලය කවරේද? භික්ෂූනි, මෙහි අරිය ශ්‍රාවක තෙම ඔතප් (අනුන්ගෙන් ලජ්ජා වීම/පව්කිරීමට බිය වීම) ඇත්තෙක් වේ. ඔහු කයින් කරන දුසිරිත්වලින්, වචනයෙන් කරන දුසිරිත්වලින්, සිතින් කරන දුසිරිත්වලින් බිය වේ. පව්කාර අකුසල ධර්මයන්ට සමවැදීමෙන් බිය වේ. භික්ෂූනි, මෙය ඔතප් බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, වීර්ය බලය කවරේද? භික්ෂූනි, මෙහි අරිය ශ්‍රාවක තෙම අකුසල ධර්මයන් ප්‍රහීණ කිරීම සඳහා, කුසල ධර්මයන් උපදවා ගැනීම සඳහා වීර්යය පටන් ගත්තෙක්ව වාසය කරයි. ස්ථිර අධිෂ්ඨාන ඇත්තෙක්ව, දැඩි ප්‍රයත්නයෙන් යුක්තව, කුසල ධර්මයන්හි සිය කාර්යභාරය අත නොහරිමින් වාසය කරයි. භික්ෂූනි, මෙය වීර්ය බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, ප්‍රඥා බලය කවරේද? භික්ෂූනි, මෙහි අරිය ශ්‍රාවක තෙම ප්‍රඥාවන්තයෙක් වේ. හටගැනීම හා නැතිවීම දැකීමෙන් යුක්ත වූ ප්‍රඥාවෙන් සමන්විත වේ. ආර්ය වූ, විනිවිද දකින, මනාකොට දුක් ක්ෂය කිරීමට උපකාරී වන ප්‍රඥාවෙන් යුක්ත වේ. භික්ෂූනි, මෙය ප්‍රඥා බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, මේවා සේඛ බල පහයි.\n\nඑබැවින්, භික්ෂූනි, මෙසේ හික්මිය යුතු ය: 'අපි සේඛ බලයන් වන ශ්‍රද්ධා බලයෙන් යුක්ත වන්නෙමු. සේඛ බලයන් වන හිරි බලයෙන් යුක්ත වන්නෙමු. සේඛ බලයන් වන ඔතප් බලයෙන් යුක්ත වන්නෙමු. සේඛ බලයන් වන වීර්ය බලයෙන් යුක්ත වන්නෙමු. සේඛ බලයන් වන ප්‍රඥා බලයෙන් යුක්ත වන්නෙමු' යනුවෙනි. භික්ෂූනි, මෙසේම හික්මිය යුතු ය.",
      "paliTitle": "Vitthatasuttaṃ"
    },
    {
      "number": 3,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme dukkhaṃ viharati savighātaṃ saupāyāsaṃ sapariḷāhaṃ, kāyassa ca bhedā paraṃ maraṇā duggati pāṭikaṅkhā. Katamehi pañcahi? Idha, bhikkhave, bhikkhu assaddho hoti, ahiriko hoti, anottappī hoti, kusīto hoti, duppañño hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu diṭṭheva dhamme dukkhaṃ viharati savighātaṃ saupāyāsaṃ sapariḷāhaṃ, kāyassa ca bhedā paraṃ maraṇā duggati pāṭikaṅkhā. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ, kāyassa ca bhedā paraṃ maraṇā sugati pāṭikaṅkhā. Katamehi pañcahi? Idha, bhikkhave, bhikkhu saddho hoti, hirīmā hoti, ottappī hoti, āraddhavīriyo hoti, paññavā hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ, kāyassa ca bhedā paraṃ maraṇā sugati pāṭikaṅkhā’’ti. Tatiyaṃ.",
      "english": "Monks, a monastic endowed with five qualities dwells in suffering in this very life, with affliction, with distress, with feverish torment, and at the breaking up of the body, after death, a woeful destination is to be expected. Which five? Here, monks, a monastic is without faith, without moral shame, without moral dread, lazy, and unwise. Indeed, monks, a monastic endowed with these five qualities dwells in suffering in this very life, with affliction, with distress, with feverish torment, and at the breaking up of the body, after death, a woeful destination is to be expected.\n\nMonks, a monastic endowed with five qualities dwells in happiness in this very life, without affliction, without distress, without feverish torment, and at the breaking up of the body, after death, a fortunate destination is to be expected. Which five? Here, monks, a monastic is with faith, with moral shame, with moral dread, has aroused energy, and is wise. Indeed, monks, a monastic endowed with these five qualities dwells in happiness in this very life, without affliction, without distress, without feverish torment, and at the breaking up of the body, after death, a fortunate destination is to be expected.",
      "sinhala": "භික්ෂූණි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම බාධා සහිතව, මහත් වෙහෙසින්, තැවීම් සහිතව දුකින් වාසය කරයි. ශරීරය බිඳී මරණින් මතු දුගතියක් අපේක්ෂා කළ හැකිය. ඒ පස් වැදෑරුම් ධර්ම මොනවාද? භික්ෂූණි, මෙහිලා භික්ෂුවක් ශ්‍රද්ධාවෙන් තොර වෙයි, හිරි නැත්තෙක් වෙයි, ඔත්තප්ප නැත්තෙක් වෙයි, අලස වෙයි, දුෂ්ප්‍රාඥ වෙයි. භික්ෂූණි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම බාධා සහිතව, මහත් වෙහෙසින්, තැවීම් සහිතව දුකින් වාසය කරයි. ශරීරය බිඳී මරණින් මතු දුගතියක් අපේක්ෂා කළ හැකිය.\n\nභික්ෂූණි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම බාධා රහිතව, වෙහෙස රහිතව, තැවීම් රහිතව සැපයෙන් වාසය කරයි. ශරීරය බිඳී මරණින් මතු සුගතියක් අපේක්ෂා කළ හැකිය. ඒ පස් වැදෑරුම් ධර්ම මොනවාද? භික්ෂූණි, මෙහිලා භික්ෂුවක් ශ්‍රද්ධාවන්ත වෙයි, ලජ්ජා ඇත්තෙක් වෙයි, ඔත්තප්ප ඇත්තෙක් වෙයි, ප්‍රාරබ්ධ වීර්ය ඇති වෙයි, ප්‍රඥාවන්ත වෙයි. භික්ෂූණි, මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම බාධා රහිතව, වෙහෙස රහිතව, තැවීම් රහිතව සැපයෙන් වාසය කරයි. ශරීරය බිඳී මරණින් මතු සුගතියක් අපේක්ෂා කළ හැකිය.",
      "paliTitle": "Dukkhasuttaṃ"
    },
    {
      "number": 4,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Idha, bhikkhave, bhikkhu assaddho hoti, ahiriko hoti, anottappī hoti, kusīto hoti, duppañño hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Idha, bhikkhave, bhikkhu saddho hoti, hirīmā hoti, ottappī hoti, āraddhavīriyo hoti, paññavā hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Catutthaṃ.",
      "english": "Bhikkhus, a monk endowed with five qualities is as if carried and deposited directly into hell. Which five? Here, bhikkhus, a monk is without faith, without moral shame, without moral dread of wrongdoing, lazy, and without wisdom. Bhikkhus, a monk endowed with these five qualities is indeed as if carried and deposited directly into hell.\n\nBhikkhus, a monk endowed with five qualities is as if carried and deposited directly into heaven. Which five? Here, bhikkhus, a monk is endowed with faith, endowed with moral shame, endowed with moral dread of wrongdoing, energetic, and endowed with wisdom. Bhikkhus, a monk endowed with these five qualities is indeed as if carried and deposited directly into heaven.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ භික්ෂුව යම් සේ ගෙනැවිත් තැබූවෙක් සේ ඒකාන්තයෙන් නිරයේ උපදී. ඒ කරුණු පහ කවරේද? මහණෙනි, මෙහිලා භික්ෂුව අශ්‍රද්ධාවන්ත වේ, අහිරික වේ, අනොතප්පි වේ, කුසීත වේ, දුෂ්ප්‍රාඥ වේ. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ භික්ෂුව යම් සේ ගෙනැවිත් තැබූවෙක් සේ ඒකාන්තයෙන් නිරයේ උපදී.\n\nමහණෙනි, කරුණු පහකින් යුක්ත වූ භික්ෂුව යම් සේ ගෙනැවිත් තැබූවෙක් සේ ඒකාන්තයෙන් ස්වර්ගයේ උපදී. ඒ කරුණු පහ කවරේද? මහණෙනි, මෙහිලා භික්ෂුව ශ්‍රද්ධාවන්ත වේ, හිරීමා වේ, ඔතප්පි වේ, ආරද්ධවීර්‍ය්‍ය වේ, ප්‍රඥාවන්ත වේ. මහණෙනි, මේ කරුණු පහකින් යුක්ත වූ භික්ෂුව යම් සේ ගෙනැවිත් තැබූවෙක් සේ ඒකාන්තයෙන් ස්වර්ගයේ උපදී.",
      "paliTitle": "Yathābhatasuttaṃ"
    },
    {
      "number": 5,
      "pali": "‘‘Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā sikkhaṃ paccakkhāya hīnāyāvattati, tassa diṭṭheva [diṭṭhe ceva (sī.)] dhamme pañca sahadhammikā vādānupātā [vādānuvādā (a. ni. 8.12; a. ni. 3.58)] gārayhā ṭhānā āgacchanti. Katame pañca? Saddhāpi nāma te nāhosi kusalesu dhammesu, hirīpi nāma te nāhosi kusalesu dhammesu, ottappampi nāma te nāhosi kusalesu dhammesu, vīriyampi nāma te nāhosi kusalesu dhammesu, paññāpi nāma te nāhosi kusalesu dhammesu. Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā sikkhaṃ paccakkhāya hīnāyāvattati, tassa diṭṭheva dhamme ime pañca sahadhammikā vādānupātā gārayhā ṭhānā āgacchanti. ‘‘Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā sahāpi dukkhena sahāpi domanassena assumukho [assumukhopi (syā.)] rudamāno paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, tassa diṭṭheva dhamme pañca sahadhammikā pāsaṃsā ṭhānā [pāsaṃsaṃ ṭhānaṃ (syā.)] āgacchanti. Katame pañca? Saddhāpi nāma te ahosi kusalesu dhammesu, hirīpi nāma te ahosi kusalesu dhammesu, ottappampi nāma te ahosi kusalesu dhammesu, vīriyampi nāma te ahosi kusalesu dhammesu, paññāpi nāma te ahosi kusalesu dhammesu. Yo hi koci, bhikkhave, bhikkhu vā bhikkhunī vā sahāpi dukkhena sahāpi domanassena assumukho rudamāno paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carati, tassa diṭṭheva dhamme ime pañca sahadhammikā pāsaṃsā ṭhānā āgacchantī’’ti. Pañcamaṃ.",
      "english": "Monks, whatever monk or nun, having renounced the training, reverts to a lower life, for them, right in this present life, five reproaches consistent with the Dhamma, grounds for blame, come upon them. Which five? Indeed, you had no faith in wholesome states, no moral shame in wholesome states, no moral dread in wholesome states, no energy in wholesome states, and no wisdom in wholesome states. Monks, whatever monk or nun, having renounced the training, reverts to a lower life, for them, right in this present life, these five reproaches consistent with the Dhamma, grounds for blame, come upon them.\n\nMonks, whatever monk or nun, even with suffering, even with sorrow, with tearful face, weeping, practices the complete and utterly pure holy life, for them, right in this present life, five praises consistent with the Dhamma, grounds for commendation, come upon them. Which five? Indeed, you had faith in wholesome states, moral shame in wholesome states, moral dread in wholesome states, energy in wholesome states, and wisdom in wholesome states. Monks, whatever monk or nun, even with suffering, even with sorrow, with tearful face, weeping, practices the complete and utterly pure holy life, for them, right in this present life, these five praises consistent with the Dhamma, grounds for commendation, come upon them.",
      "sinhala": "මහණෙනි, යම්කිසි මහණෙක් හෝ මහණියක් හෝ ශික්ෂාව ප්‍රතික්ෂේප කර පිරිහීම පිණිස හැරී යයි නම්, මේ ආත්මභාවයේදීම ඔහුට හෝ ඇයට සදහම් කරුණු පහක් නින්දා කටයුතු තැන්වලට පැමිණේ. ඒ පහ කවරේද? කුසල ධර්මයන් කෙරෙහි ඔබට ශ්‍රද්ධාවක් නොතිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට හිරියක් නොතිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට ඔතප්පයක් නොතිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට වීර්යයක් නොතිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට ප්‍රඥාවක් නොතිබුණා නොවේද? මහණෙනි, යම්කිසි මහණෙක් හෝ මහණියක් හෝ ශික්ෂාව ප්‍රතික්ෂේප කර පිරිහීම පිණිස හැරී යයි නම්, මේ ආත්මභාවයේදීම ඔහුට හෝ ඇයට මේ සදහම් කරුණු පහ නින්දා කටයුතු තැන්වලට පැමිණේ.\n\nමහණෙනි, යම්කිසි මහණෙක් හෝ මහණියක් හෝ දුක සමඟ වුවත්, දොම්නස සමඟ වුවත්, කඳුළු සලමින්, හඬමින් සිටියත්, පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව පුරයි නම්, මේ ආත්මභාවයේදීම ඔහුට හෝ ඇයට සදහම් කරුණු පහක් ප්‍රශංසා කටයුතු තැන්වලට පැමිණේ. ඒ පහ කවරේද? කුසල ධර්මයන් කෙරෙහි ඔබට ශ්‍රද්ධාවක් තිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට හිරියක් තිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට ඔතප්පයක් තිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට වීර්යයක් තිබුණා නොවේද? කුසල ධර්මයන් කෙරෙහි ඔබට ප්‍රඥාවක් තිබුණා නොවේද? මහණෙනි, යම්කිසි මහණෙක් හෝ මහණියක් හෝ දුක සමඟ වුවත්, දොම්නස සමඟ වුවත්, කඳුළු සලමින්, හඬමින් සිටියත්, පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව පුරයි නම්, මේ ආත්මභාවයේදීම ඔහුට හෝ ඇයට මේ සදහම් කරුණු පහ ප්‍රශංසා කටයුතු තැන්වලට පැමිණේ.",
      "paliTitle": "Sikkhāsuttaṃ"
    },
    {
      "number": 6,
      "pali": "‘‘Na tāva, bhikkhave, akusalassa samāpatti hoti yāva saddhā paccupaṭṭhitā hoti kusalesu dhammesu. Yato ca kho, bhikkhave, saddhā antarahitā hoti, asaddhiyaṃ pariyuṭṭhāya tiṭṭhati; atha akusalassa samāpatti hoti. ‘‘Na tāva, bhikkhave, akusalassa samāpatti hoti yāva hirī paccupaṭṭhitā hoti kusalesu dhammesu. Yato ca kho, bhikkhave, hirī antarahitā hoti, ahirikaṃ pariyuṭṭhāya tiṭṭhati; atha akusalassa samāpatti hoti. ‘‘Na tāva, bhikkhave, akusalassa samāpatti hoti yāva ottappaṃ paccupaṭṭhitaṃ hoti kusalesu dhammesu. Yato ca kho, bhikkhave, ottappaṃ antarahitaṃ hoti, anottappaṃ pariyuṭṭhāya tiṭṭhati; atha akusalassa samāpatti hoti. ‘‘Na tāva, bhikkhave, akusalassa samāpatti hoti yāva vīriyaṃ paccupaṭṭhitaṃ hoti kusalesu dhammesu. Yato ca kho, bhikkhave, vīriyaṃ antarahitaṃ hoti, kosajjaṃ pariyuṭṭhāya tiṭṭhati; atha akusalassa samāpatti hoti. ‘‘Na tāva, bhikkhave, akusalassa samāpatti hoti yāva paññā paccupaṭṭhitā hoti kusalesu dhammesu. Yato ca kho, bhikkhave, paññā antarahitā hoti, duppaññā [duppaññaṃ (ka.)] pariyuṭṭhāya tiṭṭhati; atha akusalassa samāpatti hotī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, the onset of unwholesome states does not occur so long as faith is present in wholesome qualities. But when, monks, faith has vanished, and faithlessness becomes entrenched, then the onset of unwholesome states occurs.\n\nMonks, the onset of unwholesome states does not occur so long as moral shame is present in wholesome qualities. But when, monks, moral shame has vanished, and shamelessness becomes entrenched, then the onset of unwholesome states occurs.\n\nMonks, the onset of unwholesome states does not occur so long as moral dread is present in wholesome qualities. But when, monks, moral dread has vanished, and fearlessness of wrongdoing becomes entrenched, then the onset of unwholesome states occurs.\n\nMonks, the onset of unwholesome states does not occur so long as energy is present in wholesome qualities. But when, monks, energy has vanished, and idleness becomes entrenched, then the onset of unwholesome states occurs.\n\nMonks, the onset of unwholesome states does not occur so long as wisdom is present in wholesome qualities. But when, monks, wisdom has vanished, and foolishness becomes entrenched, then the onset of unwholesome states occurs.",
      "sinhala": "මහණෙනි, කුසල් දහම්හි ශ්‍රද්ධා̈ව පැවතෙන තාක් අකුසලය ඇති නොවේ. මහණෙනි, යම් කලෙක ශ්‍රද්ධා̈ව අතුරුදන් වේද, අශ්‍රද්ධා̈ව වට කොට සිට ගනීද, එවිට අකුසලය ඇති වේ.\n\nමහණෙනි, කුසල් දහම්හි හිරිය පැවතෙන තාක් අකුසලය ඇති නොවේ. මහණෙනි, යම් කලෙක හිරිය අතුරුදන් වේද, අහිරිකය වට කොට සිට ගනීද, එවිට අකුසලය ඇති වේ.\n\nමහණෙනි, කුසල් දහම්හි ඔතප් පැවතෙන තාක් අකුසලය ඇති නොවේ. මහණෙනි, යම් කලෙක ඔතප් අතුරුදන් වේද, අනොතප්පය වට කොට සිට ගනීද, එවිට අකුසලය ඇති වේ.\n\nමහණෙනි, කුසල් දහම්හි වීර්යය පැවතෙන තාක් අකුසලය ඇති නොවේ. මහණෙනි, යම් කලෙක වීර්යය අතුරුදන් වේද, කෝසජ්ජය වට කොට සිට ගනීද, එවිට අකුසලය ඇති වේ.\n\nමහණෙනි, කුසල් දහම්හි ප්‍රඥා̈ව පැවතෙන තාක් අකුසලය ඇති නොවේ. මහණෙනි, යම් කලෙක ප්‍රඥා̈ව අතුරුදන් වේද, දුෂ්ප්‍රඥා̈ව වට කොට සිට ගනීද, එවිට අකුසලය ඇති වේ.",
      "paliTitle": "Samāpattisuttaṃ"
    },
    {
      "number": 7,
      "pali": "‘‘Yebhuyyena, bhikkhave, sattā kāmesu laḷitā [palāḷitā (sī.)]. Asitabyābhaṅgiṃ [asitabyābhaṅgi cepi (?)], bhikkhave, kulaputto ohāya agārasmā anagāriyaṃ pabbajito hoti, ‘saddhāpabbajito kulaputto’ti alaṃ vacanāya. Taṃ kissa hetu? Labbhā [labbhā hi (syā.)], bhikkhave, yobbanena kāmā te ca kho yādisā vā tādisā vā. Ye ca, bhikkhave, hīnā kāmā ye ca majjhimā kāmā ye ca paṇītā kāmā, sabbe kāmā ‘kāmā’tveva saṅkhaṃ gacchanti. Seyyathāpi, bhikkhave, daharo kumāro mando uttānaseyyako dhātiyā pamādamanvāya kaṭṭhaṃ vā kaṭhalaṃ [kathalaṃ (ka.)] vā mukhe āhareyya. Tamenaṃ dhāti sīghaṃ sīghaṃ [sīghasīghaṃ (sī.)] manasi kareyya; sīghaṃ sīghaṃ manasi karitvā sīghaṃ sīghaṃ āhareyya. No ce sakkuṇeyya sīghaṃ sīghaṃ āharituṃ, vāmena hatthena sīsaṃ pariggahetvā dakkhiṇena hatthena vaṅkaṅguliṃ karitvā salohitampi āhareyya. Taṃ kissa hetu? ‘Atthesā, bhikkhave, kumārassa vihesā; nesā natthī’ti vadāmi. Karaṇīyañca kho etaṃ [evaṃ (ka.)], bhikkhave, dhātiyā atthakāmāya hitesiniyā anukampikāya, anukampaṃ upādāya. Yato ca kho, bhikkhave, so kumāro vuddho hoti alaṃpañño, anapekkhā dāni [anapekkhā pana (sī. syā. kaṃ.)], bhikkhave, dhāti tasmiṃ kumāre hoti – ‘attagutto dāni kumāro nālaṃ pamādāyā’ti. ‘‘Evamevaṃ kho, bhikkhave, yāvakīvañca bhikkhuno saddhāya akataṃ hoti kusalesu dhammesu, hiriyā akataṃ hoti kusalesu dhammesu, ottappena akataṃ hoti kusalesu dhammesu, vīriyena akataṃ hoti kusalesu dhammesu, paññāya akataṃ hoti kusalesu dhammesu, anurakkhitabbo tāva me so, bhikkhave, bhikkhu hoti. Yato ca kho, bhikkhave, bhikkhuno saddhāya kataṃ hoti kusalesu dhammesu, hiriyā kataṃ hoti kusalesu dhammesu, ottappena kataṃ hoti kusalesu dhammesu, vīriyena kataṃ hoti kusalesu dhammesu, paññāya kataṃ hoti kusalesu dhammesu, anapekkho dānāhaṃ, bhikkhave [panāhaṃ (sī. syā. kaṃ.)], tasmiṃ bhikkhusmiṃ homi – ‘attagutto dāni bhikkhu nālaṃ pamādāyā’’’ti. Sattamaṃ.",
      "english": "Monks, for the most part, beings are infatuated with sensual pleasures. Monks, if a son of good family has gone forth from the home to the homeless life, not yet having fully severed his ties to the household life, it is enough to say that this son of good family has gone forth through faith. Why is that? Monks, it is possible for one in youth to obtain sensual pleasures, and those may be of various kinds. Monks, whether they are inferior sensual pleasures, or middling sensual pleasures, or sublime sensual pleasures, all sensual pleasures are reckoned simply as 'sensual pleasures'. Just as, monks, a young, foolish, helpless infant, through the negligence of a wet-nurse, might put a stick or a piece of gravel into its mouth. The wet-nurse would quickly pay attention to it; having quickly paid attention, she would quickly remove it. If she could not remove it quickly, she would grasp the infant's head with her left hand, and, making a crooked finger with her right hand, she would extract it even if it drew blood. Why is that? 'Monks, there is indeed danger for that infant; I declare that it is not absent.' And this is indeed what must be done, monks, by a wet-nurse who desires its welfare, who is solicitous of its good, and who is compassionate, acting out of compassion. But when, monks, that infant has grown up and is of sufficient understanding, then the wet-nurse is no longer anxious about that infant, thinking: 'The infant is now self-protected and not prone to carelessness.'\n\nEven so, monks, as long as a bhikkhu has not yet brought faith to completion in wholesome qualities, not yet brought moral shame to completion in wholesome qualities, not yet brought moral dread to completion in wholesome qualities, not yet brought energy to completion in wholesome qualities, and not yet brought wisdom to completion in wholesome qualities, for that long, that bhikkhu is to be watched over by me. But when, monks, a bhikkhu has brought faith to completion in wholesome qualities, has brought moral shame to completion in wholesome qualities, has brought moral dread to completion in wholesome qualities, has brought energy to completion in wholesome qualities, and has brought wisdom to completion in wholesome qualities, then I am no longer anxious about that bhikkhu, thinking: 'The bhikkhu is now self-protected and not prone to carelessness.'",
      "sinhala": "මහණෙනි, බොහෝ විට සත්ත්වයෝ කාමයන්හි ඇලී ගැලී සිටිති. මහණෙනි, යම් කුලපුත්‍රයෙක් කෙලෙස් බැඳුම් සිඳ බිඳ දමා ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වී ඇත්නම්, 'සද්ධාවෙන් පැවිදි වූ කුලපුත්‍රයෙක්' යැයි පැවසීමට සුදුසු වන්නේය. එයට හේතුව කුමක්ද? මහණෙනි, තරුණ වියේදී කාමයන් ලැබිය හැකි වන අතර, ඒවා යම් ආකාරයක හෝ විය හැක. මහණෙනි, හීන කාමයන් හෝ වේවා, මධ්‍යම කාමයන් හෝ වේවා, ප්‍රණීත කාමයන් හෝ වේවා, සියලු කාමයන් 'කාමයන්' යනුවෙන්ම ගණන් ගනු ලබයි.\n\nමහණෙනි, යම් සේ කුඩා, අඥාන, උඩුබැලිව සයනය කරන දරුවෙක්, කිරි මවගේ නොසැලකිල්ල නිසා ලී කැබැල්ලක් හෝ කැට කැබැල්ලක් හෝ කටට දමා ගන්නේද, එවිට එම කිරි මව ඉක්මනින් එය සිතට ගන්නේය; ඉක්මනින් සිතට ගෙන ඉක්මනින් එය ඉවතට ගන්නේය. ඉක්මනින් ඉවතට ගැනීමට නොහැකි නම්, වම් අතින් දරුවාගේ හිස අල්ලාගෙන, දකුණු අතින් ඇඟිල්ලක් නවා, ලේ සහිතව හෝ එය ඉවතට ගන්නේය. එයට හේතුව කුමක්ද? 'මහණෙනි, මේ දරුවාට දුක් කම්කටොලු ඇත; නැතැයි මම නොකියමි' යනුවෙන් (ඇය සිතන බැවිනි). මහණෙනි, යහපත කැමති, හිත කැමති, අනුකම්පා ඇති, අනුකම්පාව මුල්කරගත් කිරි මවකට මෙය කළ යුතුම දෙයකි.\n\nනමුත් මහණෙනි, යම් කලක එම දරුවා වැඩී, ප්‍රමාණවත් නුවණින් යුක්ත වේද, එවිට එම කිරි මව ඒ දරුවා ගැන නොතකයි – 'දැන් දරුවා තමාම ආරක්ෂා කරගනී, නොසැලකිලිමත් වීමට සුදුසු නැතැයි' සිතයි.\n\nමහණෙනි, ඒ අයුරින්ම, භික්ෂුවක් විසින් සද්ධාවෙන් කුසල් ධර්මයන්හි ක්‍රියාකර නැත්ද, හිරියෙන් කුසල් ධර්මයන්හි ක්‍රියාකර නැත්ද, ඔත්තප්පයෙන් කුසල් ධර්මයන්හි ක්‍රියාකර නැත්ද, වීර්යයෙන් කුසල් ධර්මයන්හි ක්‍රියාකර නැත්ද, ප්‍රඥාවෙන් කුසල් ධර්මයන්හි ක්‍රියාකර නැත්ද, ඒ තාක් කල් මහණෙනි, මම ඒ භික්ෂුව ආරක්ෂා කළ යුත්තෙක් වෙමි.\n\nනමුත් මහණෙනි, යම් කලක භික්ෂුවක් විසින් සද්ධාවෙන් කුසල් ධර්මයන්හි ක්‍රියාකර ඇත්ද, හිරියෙන් කුසල් ධර්මයන්හි ක්‍රියාකර ඇත්ද, ඔත්තප්පයෙන් කුසල් ධර්මයන්හි ක්‍රියාකර ඇත්ද, වීර්යයෙන් කුසල් ධර්මයන්හි ක්‍රියාකර ඇත්ද, ප්‍රඥාවෙන් කුසල් ධර්මයන්හි ක්‍රියාකර ඇත්ද, එවිට මහණෙනි, මම ඒ භික්ෂුව කෙරෙහි නොතකමි – 'දැන් භික්ෂුව තමාම ආරක්ෂා කරගනී, නොසැලකිලිමත් වීමට සුදුසු නැතැයි' සිතමි.",
      "paliTitle": "Kāmasuttaṃ"
    },
    {
      "number": 8,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu cavati, nappatiṭṭhāti saddhamme. Katamehi pañcahi? Asaddho, bhikkhave, bhikkhu cavati, nappatiṭṭhāti saddhamme. Ahiriko, bhikkhave, bhikkhu cavati, nappatiṭṭhāti saddhamme. Anottappī, bhikkhave, bhikkhu cavati, nappatiṭṭhāti saddhamme. Kusīto, bhikkhave, bhikkhu cavati, nappatiṭṭhāti saddhamme. Duppañño, bhikkhave, bhikkhu cavati, nappatiṭṭhāti saddhamme. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu cavati, nappatiṭṭhāti saddhamme. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu na cavati, patiṭṭhāti saddhamme. Katamehi pañcahi? Saddho, bhikkhave, bhikkhu na cavati, patiṭṭhāti saddhamme. Hirīmā, bhikkhave, bhikkhu na cavati, patiṭṭhāti saddhamme. Ottappī, bhikkhave, bhikkhu na cavati, patiṭṭhāti saddhamme. Āraddhavīriyo, bhikkhave, bhikkhu na cavati, patiṭṭhāti saddhamme. Paññavā, bhikkhave, bhikkhu na cavati, patiṭṭhāti saddhamme. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu na cavati, patiṭṭhāti saddhamme’’ti. Aṭṭhamaṃ.",
      "english": "Bhikkhus, a bhikkhu endowed with five qualities declines and does not become established in the True Dhamma. Which five? Bhikkhus, a bhikkhu who is faithless declines and does not become established in the True Dhamma. Bhikkhus, a bhikkhu who is shameless declines and does not become established in the True Dhamma. Bhikkhus, a bhikkhu who is without moral dread declines and does not become established in the True Dhamma. Bhikkhus, a bhikkhu who is lazy declines and does not become established in the True Dhamma. Bhikkhus, a bhikkhu who is unwise declines and does not become established in the True Dhamma. Bhikkhus, it is with these five qualities that a bhikkhu declines and does not become established in the True Dhamma.\n\nBhikkhus, a bhikkhu endowed with five qualities does not decline and becomes established in the True Dhamma. Which five? Bhikkhus, a bhikkhu who is faithful does not decline and becomes established in the True Dhamma. Bhikkhus, a bhikkhu who is morally ashamed does not decline and becomes established in the True Dhamma. Bhikkhus, a bhikkhu who possesses moral dread does not decline and becomes established in the True Dhamma. Bhikkhus, a bhikkhu who is energetic does not decline and becomes established in the True Dhamma. Bhikkhus, a bhikkhu who is wise does not decline and becomes established in the True Dhamma. Bhikkhus, it is with these five qualities that a bhikkhu does not decline and becomes established in the True Dhamma.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ මහණ තෙම සද්ධර්මයෙන් පිරිහී යයි, සද්ධර්මයෙහි පිහිටන්නේ නැත. ඒ පස් වැදෑරුම් ධර්මයෝ කවරහු ද? මහණෙනි, අශ්‍රද්ධාවන්ත මහණ තෙම සද්ධර්මයෙන් පිරිහී යයි, සද්ධර්මයෙහි පිහිටන්නේ නැත. මහණෙනි, අහිරික මහණ තෙම සද්ධර්මයෙන් පිරිහී යයි, සද්ධර්මයෙහි පිහිටන්නේ නැත. මහණෙනි, අනෝතප්පී මහණ තෙම සද්ධර්මයෙන් පිරිහී යයි, සද්ධර්මයෙහි පිහිටන්නේ නැත. මහණෙනි, කුසීත මහණ තෙම සද්ධර්මයෙන් පිරිහී යයි, සද්ධර්මයෙහි පිහිටන්නේ නැත. මහණෙනි, දුෂ්ප්‍රාඥ මහණ තෙම සද්ධර්මයෙන් පිරිහී යයි, සද්ධර්මයෙහි පිහිටන්නේ නැත. මහණෙනි, සැබවින්ම මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ මහණ තෙම සද්ධර්මයෙන් පිරිහී යයි, සද්ධර්මයෙහි පිහිටන්නේ නැත.\n\nමහණෙනි, පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ මහණ තෙම සද්ධර්මයෙන් පිරිහී නොයයි, සද්ධර්මයෙහි පිහිටයි. ඒ පස් වැදෑරුම් ධර්මයෝ කවරහු ද? මහණෙනි, ශ්‍රද්ධාවන්ත මහණ තෙම සද්ධර්මයෙන් පිරිහී නොයයි, සද්ධර්මයෙහි පිහිටයි. මහණෙනි, හිරීමා මහණ තෙම සද්ධර්මයෙන් පිරිහී නොයයි, සද්ධර්මයෙහි පිහිටයි. මහණෙනි, ඕතප්පී මහණ තෙම සද්ධර්මයෙන් පිරිහී නොයයි, සද්ධර්මයෙහි පිහිටයි. මහණෙනි, ආරද්ධවීර්‍ය ඇති මහණ තෙම සද්ධර්මයෙන් පිරිහී නොයයි, සද්ධර්මයෙහි පිහිටයි. මහණෙනි, ප්‍රඥාවන්ත මහණ තෙම සද්ධර්මයෙන් පිරිහී නොයයි, සද්ධර්මයෙහි පිහිටයි. මහණෙනි, සැබවින්ම මේ පස් වැදෑරුම් ධර්මයන්ගෙන් යුක්ත වූ මහණ තෙම සද්ධර්මයෙන් පිරිහී නොයයි, සද්ධර්මයෙහි පිහිටයි.",
      "paliTitle": "Cavanasuttaṃ"
    },
    {
      "number": 9,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu agāravo appatisso cavati, nappatiṭṭhāti saddhamme. Katamehi pañcahi? Assaddho, bhikkhave, bhikkhu agāravo appatisso cavati, nappatiṭṭhāti saddhamme. Ahiriko, bhikkhave, bhikkhu agāravo appatisso cavati, nappatiṭṭhāti saddhamme. Anottappī, bhikkhave, bhikkhu agāravo appatisso cavati, nappatiṭṭhāti saddhamme. Kusīto, bhikkhave, bhikkhu agāravo appatisso cavati, nappatiṭṭhāti saddhamme. Duppañño, bhikkhave, bhikkhu agāravo appatisso cavati, nappatiṭṭhāti saddhamme. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu agāravo appatisso cavati, nappatiṭṭhāti saddhamme. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu sagāravo sappatisso na cavati, patiṭṭhāti saddhamme. Katamehi pañcahi? Saddho, bhikkhave, bhikkhu sagāravo sappatisso na cavati, patiṭṭhāti saddhamme. Hirimā, bhikkhave, bhikkhu sagāravo sappatisso na cavati, patiṭṭhāti saddhamme. Ottappī, bhikkhave, bhikkhu sagāravo sappatisso na cavati, patiṭṭhāti saddhamme. Āraddhavīriyo, bhikkhave, bhikkhu sagāravo sappatisso na cavati, patiṭṭhāti saddhamme. Paññavā, bhikkhave, bhikkhu sagāravo sappatisso na cavati, patiṭṭhāti saddhamme. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu sagāravo sappatisso na cavati, patiṭṭhāti saddhamme’’ti. Navamaṃ.",
      "english": "Monks, a bhikkhu endowed with five qualities is disrespectful and without deference; he declines and does not become established in the True Dhamma. Which five? Monks, a bhikkhu who is without conviction is disrespectful and without deference; he declines and does not become established in the True Dhamma. Monks, a bhikkhu who is shameless is disrespectful and without deference; he declines and does not become established in the True Dhamma. Monks, a bhikkhu who is reckless, without moral dread, is disrespectful and without deference; he declines and does not become established in the True Dhamma. Monks, a bhikkhu who is lazy is disrespectful and without deference; he declines and does not become established in the True Dhamma. Monks, a bhikkhu who is foolish is disrespectful and without deference; he declines and does not become established in the True Dhamma. Monks, it is with these five qualities that a bhikkhu is disrespectful and without deference; he declines and does not become established in the True Dhamma.\n\nMonks, a bhikkhu endowed with five qualities is respectful and deferential; he does not decline, and becomes established in the True Dhamma. Which five? Monks, a bhikkhu who is endowed with conviction is respectful and deferential; he does not decline, and becomes established in the True Dhamma. Monks, a bhikkhu who is modest, endowed with moral shame, is respectful and deferential; he does not decline, and becomes established in the True Dhamma. Monks, a bhikkhu who is conscientious, endowed with moral dread, is respectful and deferential; he does not decline, and becomes established in the True Dhamma. Monks, a bhikkhu who is energetic, resolute in effort, is respectful and deferential; he does not decline, and becomes established in the True Dhamma. Monks, a bhikkhu who is wise is respectful and deferential; he does not decline, and becomes established in the True Dhamma. Monks, it is with these five qualities that a bhikkhu is respectful and deferential; he does not decline, and becomes established in the True Dhamma.",
      "sinhala": "මහණෙනි, පස් ධර්මයකින් යුක්ත වූ භික්ෂුව ගෞරවයක් නැතිව, අනුන්ට සැලකීමක් නැතිව පිරිහී යන්නේ ය; සද්ධර්මයෙහි නොපිහිටන්නේ ය. කවර පස් ධර්මයකින් ද? මහණෙනි, ශ්‍රද්ධාවක් නැති භික්ෂුව ගෞරවයක් නැතිව, අනුන්ට සැලකීමක් නැතිව පිරිහී යන්නේ ය; සද්ධර්මයෙහි නොපිහිටන්නේ ය. මහණෙනි, හිරි නැති භික්ෂුව ගෞරවයක් නැතිව, අනුන්ට සැලකීමක් නැතිව පිරිහී යන්නේ ය; සද්ධර්මයෙහි නොපිහිටන්නේ ය. මහණෙනි, ඔතප් නැති භික්ෂුව ගෞරවයක් නැතිව, අනුන්ට සැලකීමක් නැතිව පිරිහී යන්නේ ය; සද්ධර්මයෙහි නොපිහිටන්නේ ය. මහණෙනි, අලස භික්ෂුව ගෞරවයක් නැතිව, අනුන්ට සැලකීමක් නැතිව පිරිහී යන්නේ ය; සද්ධර්මයෙහි නොපිහිටන්නේ ය. මහණෙනි, දුෂ්ප්‍රඥා භික්ෂුව ගෞරවයක් නැතිව, අනුන්ට සැලකීමක් නැතිව පිරිහී යන්නේ ය; සද්ධර්මයෙහි නොපිහිටන්නේ ය. මහණෙනි, මේ පස් ධර්මයකින් යුක්ත වූ භික්ෂුව ගෞරවයක් නැතිව, අනුන්ට සැලකීමක් නැතිව පිරිහී යන්නේ ය; සද්ධර්මයෙහි නොපිහිටන්නේ ය.\n\nමහණෙනි, පස් ධර්මයකින් යුක්ත වූ භික්ෂුව ගෞරව සහිතව, අනුන්ට සැලකීමෙන් යුක්තව නොපිරිහී යන්නේ ය; සද්ධර්මයෙහි පිහිටන්නේ ය. කවර පස් ධර්මයකින් ද? මහණෙනි, ශ්‍රද්ධාව ඇති භික්ෂුව ගෞරව සහිතව, අනුන්ට සැලකීමෙන් යුක්තව නොපිරිහී යන්නේ ය; සද්ධර්මයෙහි පිහිටන්නේ ය. මහණෙනි, හිරි ඇති භික්ෂුව ගෞරව සහිතව, අනුන්ට සැලකීමෙන් යුක්තව නොපිරිහී යන්නේ ය; සද්ධර්මයෙහි පිහිටන්නේ ය. මහණෙනි, ඔතප් ඇති භික්ෂුව ගෞරව සහිතව, අනුන්ට සැලකීමෙන් යුක්තව නොපිරිහී යන්නේ ය; සද්ධර්මයෙහි පිහිටන්නේ ය. මහණෙනි, ආරද්ධවීර්ය ඇති භික්ෂුව ගෞරව සහිතව, අනුන්ට සැලකීමෙන් යුක්තව නොපිරිහී යන්නේ ය; සද්ධර්මයෙහි පිහිටන්නේ ය. මහණෙනි, ප්‍රඥාවන්ත භික්ෂුව ගෞරව සහිතව, අනුන්ට සැලකීමෙන් යුක්තව නොපිරිහී යන්නේ ය; සද්ධර්මයෙහි පිහිටන්නේ ය. මහණෙනි, මේ පස් ධර්මයකින් යුක්ත වූ භික්ෂුව ගෞරව සහිතව, අනුන්ට සැලකීමෙන් යුක්තව නොපිරිහී යන්නේ ය; සද්ධර්මයෙහි පිහිටන්නේ ය.",
      "paliTitle": "Paṭhamaagāravasuttaṃ"
    },
    {
      "number": 10,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu agāravo appatisso abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Katamehi pañcahi? Assaddho, bhikkhave, bhikkhu agāravo appatisso abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Ahiriko, bhikkhave, bhikkhu agāravo appatisso abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Anottappī, bhikkhave, bhikkhu agāravo appatisso abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Kusīto, bhikkhave, bhikkhu agāravo appatisso abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Duppañño, bhikkhave, bhikkhu agāravo appatisso abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu agāravo appatisso abhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu sagāravo sappatisso bhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Katamehi pañcahi? Saddho, bhikkhave, bhikkhu sagāravo sappatisso bhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Hirīmā, bhikkhave, bhikkhu…pe… ottappī, bhikkhave, bhikkhu…pe… āraddhavīriyo, bhikkhave, bhikkhu… pe… paññavā, bhikkhave, bhikkhu sagāravo sappatisso bhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjituṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu sagāravo sappatisso bhabbo imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjitu’’nti. Dasamaṃ. ",
      "english": "Monks, a bhikkhu endowed with five qualities is disrespectful, without deference, and is incapable of growing, developing, and reaching fullness in this Dhamma and Discipline. Which five?\n\nMonks, a bhikkhu who is faithless is disrespectful, without deference, and is incapable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who is shameless is disrespectful, without deference, and is incapable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who is fearless of wrongdoing is disrespectful, without deference, and is incapable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who is lazy is disrespectful, without deference, and is incapable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who is unwise is disrespectful, without deference, and is incapable of growing, developing, and reaching fullness in this Dhamma and Discipline. Indeed, monks, a bhikkhu endowed with these five qualities is disrespectful, without deference, and is incapable of growing, developing, and reaching fullness in this Dhamma and Discipline.\n\nMonks, a bhikkhu endowed with five qualities is respectful, with deference, and is capable of growing, developing, and reaching fullness in this Dhamma and Discipline. Which five?\n\nMonks, a bhikkhu who is faithful is respectful, with deference, and is capable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who has a sense of shame is respectful, with deference, and is capable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who dreads wrongdoing is respectful, with deference, and is capable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who has aroused energy is respectful, with deference, and is capable of growing, developing, and reaching fullness in this Dhamma and Discipline. Monks, a bhikkhu who is wise is respectful, with deference, and is capable of growing, developing, and reaching fullness in this Dhamma and Discipline. Indeed, monks, a bhikkhu endowed with these five qualities is respectful, with deference, and is capable of growing, developing, and reaching fullness in this Dhamma and Discipline.",
      "sinhala": "භික්ෂූනි, ධර්මයන් පහකින් යුක්ත වූ භික්ෂුවක් ගෞරව රහිත වූත්, ආදර රහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට නොහැක්කේය. ඒ කවර ධර්මයන් පහකින්ද? භික්ෂූනි, අශ්‍රද්ධාවූ භික්ෂුව ගෞරව රහිත වූත්, ආදර රහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට නොහැක්කේය. භික්ෂූනි, අහිරික වූ (ලැජ්ජා රහිත) භික්ෂුව ගෞරව රහිත වූත්, ආදර රහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට නොහැක්කේය. භික්ෂූනි, අනොත්තප්පී වූ (පව් කිරීමට බිය නැති) භික්ෂුව ගෞරව රහිත වූත්, ආදර රහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට නොහැක්කේය. භික්ෂූනි, කුසීත වූ භික්ෂුව ගෞරව රහිත වූත්, ආදර රහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට නොහැක්කේය. භික්ෂූනි, දුෂ්ප්‍රඥා වූ භික්ෂුව ගෞරව රහිත වූත්, ආදර රහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට නොහැක්කේය. භික්ෂූනි, මේ ධර්මයන් පහකින් යුක්ත වූ භික්ෂුව ගෞරව රහිත වූත්, ආදර රහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට නොහැක්කේය.\n\nභික්ෂූනි, ධර්මයන් පහකින් යුක්ත වූ භික්ෂුවක් ගෞරව සහිත වූත්, ආදර සහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට සමර්ථ වන්නේය. ඒ කවර ධර්මයන් පහකින්ද? භික්ෂූනි, ශ්‍රද්ධාවූ භික්ෂුව ගෞරව සහිත වූත්, ආදර සහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට සමර්ථ වන්නේය. භික්ෂූනි, හිරීමා වූ (ලැජ්ජා සහිත) භික්ෂුව ගෞරව සහිත වූත්, ආදර සහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට සමර්ථ වන්නේය. භික්ෂූනි, ඔත්තප්පී වූ (පව් කිරීමට බිය සහිත) භික්ෂුව ගෞරව සහිත වූත්, ආදර සහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට සමර්ථ වන්නේය. භික්ෂූනි, ආරද්ධවීර්‍ය්‍ය වූ (වීර්‍ය්‍යාරම්භ කරන ලද) භික්ෂුව ගෞරව සහිත වූත්, ආදර සහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට සමර්ථ වන්නේය. භික්ෂූනි, ප්‍රඥාවන්ත වූ භික්ෂුව ගෞරව සහිත වූත්, ආදර සහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට සමර්ථ වන්නේය. භික්ෂූනි, මේ ධර්මයන් පහකින් යුක්ත වූ භික්ෂුව ගෞරව සහිත වූත්, ආදර සහිත වූත්, මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පැමිණීමට සමර්ථ වන්නේය.",
      "paliTitle": "Dutiyaagāravasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Sekhabalavaggo paṭhamo. Tassuddānaṃ – Saṃkhittaṃ vitthataṃ dukkhā, bhataṃ sikkhāya pañcamaṃ; Samāpatti ca kāmesu, cavanā dve agāravāti.",
    "english": "",
    "sinhala": ""
  }
}