{
  "id": "an5.23",
  "title": {
    "pali": "Dīghacārikavaggo",
    "english": "The Chapter of the Far Wanderer",
    "sinhala": "දීඝචාරිකවග්ගය"
  },
  "sections": [
    {
      "number": 221,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā dīghacārikaṃ anavatthacārikaṃ anuyuttassa viharato. Katame pañca? Assutaṃ na suṇāti, sutaṃ na pariyodāpeti, sutenekaccena avisārado hoti, gāḷhaṃ [bāḷhaṃ (syā.)] rogātaṅkaṃ phusati, na ca mittavā hoti. Ime kho, bhikkhave, pañca ādīnavā dīghacārikaṃ anavatthacārikaṃ anuyuttassa viharato. ‘‘Pañcime, bhikkhave, ānisaṃsā samavatthacāre. Katame pañca? Assutaṃ suṇāti, sutaṃ pariyodāpeti, sutenekaccena visārado hoti, na gāḷhaṃ rogātaṅkaṃ phusati, mittavā ca hoti. Ime kho, bhikkhave, pañca ānisaṃsā samavatthacāre’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five disadvantages for one who dwells engaged in long, unsettled wandering. What are these five? They do not hear what has not been heard; they do not thoroughly master what has been heard; they are not confident regarding some of what they have heard; they contract severe disease and affliction; and they have no friends. Indeed, monks, these are the five disadvantages for one who dwells engaged in long, unsettled wandering.\n\nMonks, there are these five advantages in dwelling stably. What are these five? They hear what has not been heard; they thoroughly master what has been heard; they are confident regarding some of what they have heard; they do not contract severe disease and affliction; and they have friends. Indeed, monks, these are the five advantages in dwelling stably.",
      "sinhala": "භික්ෂූනි, දීර්ඝකාලීන, නොසන්සුන් චරියාවෙහි යෙදෙමින් වාසය කරන අයට මේ පස් ආකාර ආදීනවයෝ වෙති. කවරහුද ඒ පස්දෙනා? අසන ලද නැති දේ අසන්නට නොලැබේ. අසන ලද දේ මනා කොට තේරුම් නොගනී. අසන ලද සමහර දේවලින් ඔහුට පැහැදිලිකමක් හෝ විශ්වාසයක් ඇති නොවේ. දරුණු රෝගාබාධයකට මුහුණ පායි. මිත්‍රයන් නැති අයෙක් ද වේ. භික්ෂූනි, දීර්ඝකාලීන, නොසන්සුන් චරියාවෙහි යෙදෙමින් වාසය කරන අයට මේ පස් ආකාර ආදීනවයෝ වෙති.\n\nභික්ෂූනි, සන්සුන්, ස්ථාවර චරියාවකින් යුක්තව වාසය කරන අයට මේ පස් ආකාර ආනිසංසයෝ වෙති. කවරහුද ඒ පස්දෙනා? අසන ලද නැති දේ අසන්නට ලැබේ. අසන ලද දේ මනා කොට තේරුම් ගනී. අසන ලද සමහර දේවලින් ඔහුට පැහැදිලිකමක් හා විශ්වාසයක් ඇති වේ. දරුණු රෝගාබාධයකට මුහුණ නොපායි. මිත්‍රයන් ඇති අයෙක් ද වේ. භික්ෂූනි, සන්සුන්, ස්ථාවර චරියාවකින් යුක්තව වාසය කරන අයට මේ පස් ආකාර ආනිසංසයෝ වෙති.",
      "paliTitle": "Paṭhamadīghacārikasuttaṃ"
    },
    {
      "number": 222,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā dīghacārikaṃ anavatthacārikaṃ anuyuttassa viharato. Katame pañca? Anadhigataṃ nādhigacchati, adhigatā parihāyati, adhigatenekaccena avisārado hoti, gāḷhaṃ rogātaṅkaṃ phusati, na ca mittavā hoti. Ime kho, bhikkhave, pañca ādīnavā dīghacārikaṃ anavatthacārikaṃ anuyuttassa viharato. ‘‘Pañcime, bhikkhave, ānisaṃsā samavatthacāre. Katame pañca? Anadhigataṃ adhigacchati, adhigatā na parihāyati, adhigatenekaccena visārado hoti, na gāḷhaṃ rogātaṅkaṃ phusati, mittavā ca hoti. Ime kho, bhikkhave, pañca ānisaṃsā samavatthacāre’’ti. Dutiyaṃ.",
      "english": "Monks, there are these five disadvantages for one who lives persistently committed to long wandering without establishing a stable practice. Which five? What is not yet attained, he does not attain; what has been attained, he loses; he lacks confidence regarding some of his attainments; he encounters severe illness and affliction; and he is without companions. These, monks, are the five disadvantages for one who lives persistently committed to long wandering without establishing a stable practice.\n\nMonks, there are these five advantages in maintaining a stable practice. Which five? What is not yet attained, he attains; what has been attained, he does not lose; he gains confidence regarding some of his attainments; he does not encounter severe illness and affliction; and he has companions. These, monks, are the five advantages in maintaining a stable practice.",
      "sinhala": "මහණෙනි, නිරන්තරයෙන් නොපිහිටා, අස්ථායීව බොහෝ කලක් සැරිසරමින් වසන භික්ෂුවට ආදීනව පසක් ඇත. කවරේද ඒ පස? නොලද්දක් නොලබයි; ලද්දක් පිරිහේ; ඇතැම් ලද්දක් පිළිබඳව විශ්වාසයක් නැති භාවයට පත් වෙයි; දරුණු රෝගාබාධවලට හසු වෙයි; මිත්‍‌රශීලී නොවේ. මහණෙනි, නිරන්තරයෙන් නොපිහිටා, අස්ථායීව බොහෝ කලක් සැරිසරමින් වසන භික්ෂුවට මේ ආදීනව පස ඇත.\n\nමහණෙනි, ස්ථාවරව, පිහිටා වැඩවසන භික්ෂුවට ආනිසංස පසක් ඇත. කවරේද ඒ පස? නොලද්දක් ලබයි; ලද්දක් නොපිරිහේ; ඇතැම් ලද්දක් පිළිබඳව විශ්වාසයෙන් යුක්ත වෙයි; දරුණු රෝගාබාධවලට හසු නොවේ; මිත්‍‌රශීලී වෙයි. මහණෙනි, ස්ථාවරව, පිහිටා වැඩවසන භික්ෂුවට මේ ආනිසංස පස ඇත.",
      "paliTitle": "Dutiyadīghacārikasuttaṃ"
    },
    {
      "number": 223,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā atinivāse. Katame pañca? Bahubhaṇḍo hoti bahubhaṇḍasannicayo, bahubhesajjo hoti bahubhesajjasannicayo, bahukicco hoti bahukaraṇīyo byatto kiṃkaraṇīyesu, saṃsaṭṭho viharati gahaṭṭhapabbajitehi ananulomikena gihisaṃsaggena, tamhā ca āvāsā pakkamanto sāpekkho pakkamati. Ime kho, bhikkhave, pañca ādīnavā atinivāse. ‘‘Pañcime, bhikkhave, ānisaṃsā samavatthavāse. Katame pañca? Na bahubhaṇḍo hoti na bahubhaṇḍasannicayo, na bahubhesajjo hoti na bahubhesajjasannicayo, na bahukicco hoti na bahukaraṇīyo na byatto kiṃkaraṇīyesu, asaṃsaṭṭho viharati gahaṭṭhapabbajitehi ananulomikena gihisaṃsaggena, tamhā ca āvāsā pakkamanto anapekkho pakkamati. Ime kho, bhikkhave, pañca ānisaṃsā samavatthavāse’’ti. Tatiyaṃ.",
      "english": "Monks, these five are the disadvantages of staying too long in one place. Which five? One becomes someone with many possessions, accumulating many possessions; one becomes someone with much medicine, accumulating much medicine; one becomes someone with many duties, many tasks to be done, adept at what needs to be done; one dwells mingled with householders and other monastics, in unsuitable association with householders; and departing from that dwelling, one departs with longing. These, monks, are the five disadvantages of staying too long in one place.\n\nMonks, these five are the advantages of dwelling appropriately in one place. Which five? One does not become someone with many possessions, not accumulating many possessions; one does not become someone with much medicine, not accumulating much medicine; one does not become someone with many duties, many tasks to be done, not adept at what needs to be done; one dwells unmingled with householders and other monastics, not in unsuitable association with householders; and departing from that dwelling, one departs without longing. These, monks, are the five advantages of dwelling appropriately in one place.",
      "sinhala": "භික්‍ෂූණි, එක් තැනක වැඩි කලක් වාසය කිරීමෙහි මේ පස්වැදෑරුම් අවාසි ඇත්තේය. කවරේ ද ඒ පස?\nසිවුරු, පාත්‍ර ආදී බොහෝ පිරිකර ඇත්තෙක් වෙයි; බොහෝ පිරිකර රැස් කරන්නෙක් වෙයි. බොහෝ බෙහෙත් ඇත්තෙක් වෙයි; බොහෝ බෙහෙත් රැස් කරන්නෙක් වෙයි. සිල්වතුන්ගේ සාරධර්මයන්ට පටහැනි බොහෝ කටයුතු ඇත්තෙක් වෙයි; කළයුතු බොහෝ දේ ඇත්තෙක් වෙයි; කුමන කටයුතු කළ යුතු දැයි දක්‍ෂයෙක් වෙයි. ගිහියන් හා වෙනත් පැවිද්දන් හා සමඟ, භික්‍ෂු ජීවිතයට අනුලෝම නොවන ගිහි ඇසුරෙන් ගැවසීගෙන වාසය කරයි. ඒ ආවාසයෙන් පිටත්ව යන විට ඇල්මෙන් පිටත්ව යයි. භික්‍ෂූණි, එක් තැනක වැඩි කලක් වාසය කිරීමෙහි මේ පස්වැදෑරුම් අවාසි ඇත්තේය.\n\nභික්‍ෂූණි, සුදුසු ලෙස වාසය කිරීමෙහි මේ පස්වැදෑරුම් වාසි ඇත්තේය. කවරේ ද ඒ පස?\nසිවුරු, පාත්‍ර ආදී බොහෝ පිරිකර ඇත්තෙක් නොවෙයි; බොහෝ පිරිකර රැස් කරන්නෙක් නොවෙයි. බොහෝ බෙහෙත් ඇත්තෙක් නොවෙයි; බොහෝ බෙහෙත් රැස් කරන්නෙක් නොවෙයි. සිල්වතුන්ගේ සාරධර්මයන්ට පටහැනි බොහෝ කටයුතු ඇත්තෙක් නොවෙයි; කළයුතු බොහෝ දේ ඇත්තෙක් නොවෙයි; කුමන කටයුතු කළ යුතු දැයි දක්‍ෂයෙක් නොවෙයි. භික්‍ෂු ජීවිතයට අනුලෝම නොවන ගිහි ඇසුරෙන් ගිහියන් හා වෙනත් පැවිද්දන් හා සමඟ ගැවසීගෙන වාසය නොකරයි. ඒ ආවාසයෙන් පිටත්ව යන විට ඇල්මෙන් තොරව පිටත්ව යයි. භික්‍ෂූණි, සුදුසු ලෙස වාසය කිරීමෙහි මේ පස්වැදෑරුම් වාසි ඇත්තේය.",
      "paliTitle": "Atinivāsasuttaṃ"
    },
    {
      "number": 224,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā atinivāse. Katame pañca? Āvāsamaccharī hoti, kulamaccharī hoti, lābhamaccharī hoti, vaṇṇamaccharī hoti, dhammamaccharī hoti. Ime kho, bhikkhave, pañca ādīnavā atinivāse. ‘‘Pañcime, bhikkhave, ānisaṃsā samavatthavāse. Katame pañca? Na āvāsamaccharī hoti, na kulamaccharī hoti, na lābhamaccharī hoti, na vaṇṇamaccharī hoti, na dhammamaccharī hoti. Ime kho, bhikkhave, pañca ānisaṃsā samavatthavāse’’ti. Catutthaṃ.",
      "english": "Monastics, there are these five disadvantages in over-settling. Which five? One becomes possessive about their dwelling, one becomes possessive about lay families, one becomes possessive about gains, one becomes possessive about their reputation, and one becomes possessive about the Dhamma. Monastics, these are the five disadvantages in over-settling.\n\nMonastics, there are these five advantages in impartial dwelling. Which five? One is not possessive about their dwelling, one is not possessive about lay families, one is not possessive about gains, one is not possessive about their reputation, and one is not possessive about the Dhamma. Monastics, these are the five advantages in impartial dwelling.",
      "sinhala": "භික්ෂූනි, යම් ස්ථානයක අධික ඇලීමෙන් යුතුව වාසය කිරීමෙහි මේ ආදීනව පහක් ඇත. ඒ පහ කවරේද යත්? ආවාසය පිළිබඳ මසුරුකම් ඇතිකර ගනී, උපකාර කරන කුලයන් පිළිබඳ මසුරුකම් ඇතිකර ගනී, ලැබෙන ලාභයන් පිළිබඳ මසුරුකම් ඇතිකර ගනී, තමාගේ කීර්ති වර්ණය පිළිබඳ මසුරුකම් ඇතිකර ගනී, ධ‌ර්මය පිළිබඳ මසුරුකම් ඇතිකර ගනී. භික්ෂූනි, අධික ඇලීමෙන් යුතුව වාසය කිරීමෙහි මේ ආදීනව පහ ඇත්තේය.\n\nභික්ෂූනි, නොඇලී වාසය කිරීමෙහි මේ ආනිසංස පහක් ඇත. ඒ පහ කවරේද යත්? ආවාසය පිළිබඳ මසුරුකම් ඇතිකර නොගනී, උපකාර කරන කුලයන් පිළිබඳ මසුරුකම් ඇතිකර නොගනී, ලැබෙන ලාභයන් පිළිබඳ මසුරුකම් ඇතිකර නොගනී, තමාගේ කීර්ති වර්ණය පිළිබඳ මසුරුකම් ඇතිකර නොගනී, ධ‌ර්මය පිළිබඳ මසුරුකම් ඇතිකර නොගනී. භික්ෂූනි, නොඇලී වාසය කිරීමෙහි මේ ආනිසංස පහ ඇත්තේය.",
      "paliTitle": "Maccharīsuttaṃ"
    },
    {
      "number": 225,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kulūpake [kulupake (syā. pī.), kulūpage (sī.)]. Katame pañca? Anāmantacāre āpajjati, raho nisajjāya āpajjati, paṭicchanne āsane āpajjati, mātugāmassa uttari chappañcavācāhi dhammaṃ desento āpajjati, kāmasaṅkappabahulo viharati. Ime kho, bhikkhave, pañca ādīnavā kulūpake’’ti. Pañcamaṃ.",
      "english": "Monks, there are these five disadvantages for a monk who habitually associates with lay families. Which five? He incurs an offense by going unannounced; he incurs an offense by sitting in private (with a woman); he incurs an offense by sitting on a secluded seat (with a woman); he incurs an offense by teaching the Dhamma to a woman for more than five or six phrases when alone; and he dwells abounding in thoughts of sensual desire. Monks, these are the five disadvantages for a monk who habitually associates with lay families.",
      "sinhala": "භික්ෂූණි, ගිහි පවුල් සමඟ අධික ලෙස ඇලී ගැලී කටයුතු කරන භික්ෂුවකට මේ ආදීනව පසක් ඇත. ඒ කවර පසක්ද?\n\nආරාධනාවකින් තොරව ගිහි ගෙවල්වලට ඇතුළු වීමෙන් වරදකට පත්වේ. කාන්තාවක් සමඟ රහසිගත ස්ථානවල හිඳීමෙන් වරදකට පත්වේ. කාන්තාවක් සමඟ අන් අයට නොපෙනෙන ආසනවල හිඳීමෙන් වරදකට පත්වේ. කාන්තාවකට පස්‌-හය වචන සීමාව ඉක්මවා ධර්මය දේශනා කිරීමෙන් වරදකට පත්වේ. කාමසංකල්ප බහුලව ඇතිව වාසය කරයි.\n\nභික්ෂූණි, ගිහි පවුල් සමඟ අධික ලෙස ඇලී ගැලී කටයුතු කරන භික්ෂුවකට ඇති ආදීනව පස නම් මේවා යි.",
      "paliTitle": "Paṭhamakulūpakasuttaṃ"
    },
    {
      "number": 226,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kulūpakassa bhikkhuno ativelaṃ kulesu saṃsaṭṭhassa viharato. Katame pañca? Mātugāmassa abhiṇhadassanaṃ, dassane sati saṃsaggo, saṃsagge sati vissāso, vissāse sati otāro, otiṇṇacittassetaṃ pāṭikaṅkhaṃ – ‘anabhirato vā brahmacariyaṃ carissati aññataraṃ vā saṃkiliṭṭhaṃ āpattiṃ āpajjissati sikkhaṃ vā paccakkhāya hīnāyāvattissati’. Ime kho, bhikkhave, pañca ādīnavā kulūpakassa bhikkhuno ativelaṃ kulesu saṃsaṭṭhassa viharato’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these five are the dangers for a monk who habitually visits families and dwells excessively entangled with them. What are these five? Frequent seeing of women; with seeing, there is intimate association; with intimate association, there is familiarity; with familiarity, there is an opening [for defilements] in the mind; for one whose mind has found such an opening, this can be expected: ‘either he will lead the holy life discontentedly, or he will incur some defiling offense, or, having renounced the training, he will revert to a lower state of life.’ These, monks, are the five dangers for a monk who habitually visits families and dwells excessively entangled with them.",
      "sinhala": "භික්ෂූන් වහන්ස, කුලවලට සමීපව ඇසුරු කරන, කුල සමඟ අධික ලෙස මිශ්‍රව වාසය කරන භික්ෂුවකට මේ අන්තරායන් පස් දෙනා වෙති. ඒ කවරේද? කාන්තාවන් නිතර නිතර දැකීම; දැකීම ඇති කල්හි ඇසුර ඇතිවේ; ඇසුර ඇති කල්හි විශ්වාසය ඇතිවේ; විශ්වාසය ඇති කල්හි (ක්ලේශයන්ට සිතට) ඇතුළු වීමට අවස්ථාව ඇතිවේ. එසේ (ක්ලේශයන්ට) ඇතුළු වූ සිතක් ඇති කල්හි, ඔහු අසතුටින් බඹසර හැසිරෙන්නේය; නැතහොත් කිසියම් කෙලෙසන ආපත්තියකට පැටලෙන්නේය; නැතහොත් සික්ෂාව අත්හැර පහත් තත්ත්වයකට පත්වන්නේය. භික්ෂූන් වහන්ස, කුලවලට සමීපව ඇසුරු කරන, කුල සමඟ අධික ලෙස මිශ්‍රව වාසය කරන භික්ෂුවකට මේ අන්තරායන් පස් දෙනා වෙති.",
      "paliTitle": "Dutiyakulūpakasuttaṃ"
    },
    {
      "number": 227,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā bhogesu. Katame pañca? Aggisādhāraṇā bhogā, udakasādhāraṇā bhogā, rājasādhāraṇā bhogā, corasādhāraṇā bhogā, appiyehi dāyādehi sādhāraṇā bhogā. Ime kho, bhikkhave, pañca ādīnavā bhogesu. ‘‘Pañcime, bhikkhave, ānisaṃsā bhogesu. Katame pañca? Bhoge nissāya attānaṃ sukheti pīṇeti sammā sukhaṃ pariharati, mātāpitaro sukheti pīṇeti sammā sukhaṃ pariharati, puttadāradāsakammakaraporise sukheti pīṇeti sammā sukhaṃ pariharati, mittāmacce sukheti pīṇeti sammā sukhaṃ pariharati, samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpeti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Ime kho, bhikkhave, pañca ānisaṃsā bhogesū’’ti. Sattamaṃ.",
      "english": "Monks, these are the five disadvantages in possessions. Which five? Possessions shared with fire, possessions shared with water, possessions shared with kings, possessions shared with thieves, and possessions shared with undesirable heirs. Indeed, monks, these are the five disadvantages in possessions.\n\nMonks, these are the five advantages in possessions. Which five? Relying on possessions, one makes oneself happy and satisfied, properly maintaining one's well-being; one makes mother and father happy and satisfied, properly maintaining their well-being; one makes children, wife, servants, workers, and attendants happy and satisfied, properly maintaining their well-being; one makes friends and associates happy and satisfied, properly maintaining their well-being; and one establishes an offering among ascetics and brahmins that is lofty, conducive to heaven, resulting in happiness, and leading to rebirth in heaven. Indeed, monks, these are the five advantages in possessions.",
      "sinhala": "මහණෙනි, භෝගයන්හි මේ ආදීනව පසකි. ඒ පස කුමක්ද? ගින්නට පොදු වූ භෝග, ජලයට පොදු වූ භෝග, රජුන්ට පොදු වූ භෝග, සොර සතුරන්ට පොදු වූ භෝග, අප්‍රිය දායාදයන්ට පොදු වූ භෝගයෝය. මහණෙනි, භෝගයන්හි මේ ආදීනව පස නම් මේවාය.\n\nමහණෙනි, භෝගයන්හි මේ ආනිසංස පසකි. ඒ පස කුමක්ද? භෝග නිසාවෙන් තමන්ව සතුටු කරයි, පෝෂණය කරයි, මනාකොට සුවසේ පවත්වයි. මව්පියන්ව සතුටු කරයි, පෝෂණය කරයි, මනාකොට සුවසේ පවත්වයි. දරුවන්, බිරින්දෑවරුන්, දාසයන්, කම්කරුවන්, පිරිස සතුටු කරයි, පෝෂණය කරයි, මනාකොට සුවසේ පවත්වයි. මිත්‍ර අමාත්‍යවරුන් සතුටු කරයි, පෝෂණය කරයි, මනාකොට සුවසේ පවත්වයි. ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි උසස් ඵල පිණිස වන, සුවදායක විපාක ඇති, ස්වර්ගය පිණිස පවතින දක්ෂිණාවක් පිහිටුවයි. මහණෙනි, භෝගයන්හි මේ ආනිසංස පස නම් මේවාය.",
      "paliTitle": "Bhogasuttaṃ"
    },
    {
      "number": 228,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā ussūrabhatte kule. Katame pañca? Ye te atithī pāhunā, te na kālena paṭipūjenti; yā tā balipaṭiggāhikā devatā, tā na kālena paṭipūjenti; ye te samaṇabrāhmaṇā ekabhattikā rattūparatā viratā vikālabhojanā, te na kālena paṭipūjenti; dāsakammakaraporisā vimukhā kammaṃ karonti; tāvatakaṃyeva asamayena bhuttaṃ anojavantaṃ hoti. Ime kho, bhikkhave, pañca ādīnavā ussūrabhatte kule. ‘‘Pañcime, bhikkhave, ānisaṃsā samayabhatte kule. Katame pañca? Ye te atithī pāhunā, te kālena paṭipūjenti; yā tā balipaṭiggāhikā devatā, tā kālena paṭipūjenti; ye te samaṇabrāhmaṇā ekabhattikā rattūparatā viratā vikālabhojanā, te kālena paṭipūjenti; dāsakammakaraporisā avimukhā kammaṃ karonti; tāvatakaṃyeva samayena bhuttaṃ ojavantaṃ hoti. Ime kho, bhikkhave, pañca ānisaṃsā samayabhatte kule’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five disadvantages in a family that eats late. Which five? Guests and visitors are not properly honored at the appropriate time; deities who accept offerings are not honored at the appropriate time; ascetics and brahmins who eat only once a day, who have ceased from eating at night, who abstain from untimely food, are not honored at the appropriate time; servants, workers, and laborers perform their tasks unwillingly; and the food eaten at an untimely hour, even if it is that much, is not invigorating. These, monks, are the five disadvantages in a family that eats late.\n\nMonks, there are these five advantages in a family that eats at the appropriate time. Which five? Guests and visitors are properly honored at the appropriate time; deities who accept offerings are honored at the appropriate time; ascetics and brahmins who eat only once a day, who have ceased from eating at night, who abstain from untimely food, are honored at the appropriate time; servants, workers, and laborers perform their tasks willingly; and the food eaten at the appropriate hour, even if it is that much, is invigorating. These, monks, are the five advantages in a family that eats at the appropriate time.",
      "sinhala": "භික්ෂූණි, යම් ගෘහයක කලට වේලාවට නොබෝවන කෑම තිබේ නම්, එහි මේ ආදීනව පහක් ඇත. ඒ පහ කවරේද? යම් ආගන්තුක අමුත්තෝ වෙත්ද, ඔවුන්ට නියමිත වේලාවට සංග්‍රහ නොකරති; යම් බිලි පිලිගන්නා දෙවියෝ වෙත්ද, ඔවුන්ට නියමිත වේලාවට පූජා නොකරති; යම් ශ‍්‍රමණබ‍්‍රාහ්මණයෝ එක් වේලක් පමණක් වළඳන්නාහු, රාත්‍රියෙහි භෝජනයෙන් වැළකී, විකාල භෝජනයෙන් වෙන්වූවෝ වෙත්ද, ඔවුන්ට නියමිත වේලාවට (පූජා) නොකරති; ගෘහදාසයෝද, කම්කරුවෝද අකමැත්තෙන් වැඩ කරති; එමෙන්ම, නියමිත වේලාවට නොගත් ආහාරවල සාරය අඩු වේ. භික්ෂූණි, යම් ගෘහයක කලට වේලාවට නොබෝවන කෑම තිබේ නම්, එහි මේ ආදීනව පහ ඇත්තේය.\n\nභික්ෂූණි, යම් ගෘහයක කලට වේලාවට බෝවන කෑම තිබේ නම්, එහි මේ ආනිසංස පහක් ඇත. ඒ පහ කවරේද? යම් ආගන්තුක අමුත්තෝ වෙත්ද, ඔවුන්ට නියමිත වේලාවට සංග්‍රහ කරති; යම් බිලි පිලිගන්නා දෙවියෝ වෙත්ද, ඔවුන්ට නියමිත වේලාවට පූජා කරති; යම් ශ‍්‍රමණබ‍්‍රාහ්මණයෝ එක් වේලක් පමණක් වළඳන්නාහු, රාත්‍රියෙහි භෝජනයෙන් වැළකී, විකාල භෝජනයෙන් වෙන්වූවෝ වෙත්ද, ඔවුන්ට නියමිත වේලාවට (පූජා) කරති; ගෘහදාසයෝද, කම්කරුවෝද කැමැත්තෙන් වැඩ කරති; එමෙන්ම, නියමිත වේලාවට ගත් ආහාරවල සාරය වැඩේ. භික්ෂූණි, යම් ගෘහයක කලට වේලාවට බෝවන කෑම තිබේ නම්, එහි මේ ආනිසංස පහ ඇත්තේය. අටවැනි සූත්‍රයයි.",
      "paliTitle": "Ussūrabhattasuttaṃ"
    },
    {
      "number": 229,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kaṇhasappe. Katame pañca? Asuci, duggandho, sabhīru, sappaṭibhayo, mittadubbhī – ime kho, bhikkhave, pañca ādīnavā kaṇhasappe. Evamevaṃ kho, bhikkhave, pañcime ādīnavā mātugāme. Katame pañca? Asuci, duggandho, sabhīru, sappaṭibhayo, mittadubbhī – ime kho, bhikkhave, pañca ādīnavā mātugāme’’ti. Navamaṃ.",
      "english": "Monks, there are these five drawbacks in a black snake. Which five? They are impure, foul-smelling, timid, frightening, and treacherous to friends. Indeed, monks, these are the five drawbacks in a black snake. In the same way, monks, there are these five drawbacks in women. Which five? They are impure, foul-smelling, timid, frightening, and treacherous to friends. Indeed, monks, these are the five drawbacks in women.",
      "sinhala": "පින්වත් මහණෙනි, කළු නාගයා තුළ ආදීනව පහක් ඇත. ඒ පහ මොනවාද යත්: අපිරිසිදු වීම, දුර්ගන්ධය, බියගුලු බව, භය උපදවන සුළු බව, මිත්‍ර‌ද්‍රෝහී බව යන මේවායි. පින්වත් මහණෙනි, කළු නාගයා තුළ ඇති ආදීනව පහ මේවාය.\n\nපින්වත් මහණෙනි, එසේම මනුෂ්‍ය ස්ත්‍රීන් තුළද ආදීනව පහක් ඇත. ඒ පහ මොනවාද යත්: අපිරිසිදු වීම, දුර්ගන්ධය, බියගුලු බව, භය උපදවන සුළු බව, මිත්‍ර‌ද්‍රෝහී බව යන මේවායි. පින්වත් මහණෙනි, මනුෂ්‍ය ස්ත්‍රීන් තුළ ඇති ආදීනව පහ මේවාය.",
      "paliTitle": "Paṭhamakaṇhasappasuttaṃ"
    },
    {
      "number": 230,
      "pali": "‘‘Pañcime, bhikkhave, ādīnavā kaṇhasappe. Katame pañca? Kodhano, upanāhī, ghoraviso, dujjivho, mittadubbhī – ime kho, bhikkhave, pañca ādīnavā kaṇhasappe. ‘‘Evamevaṃ kho, bhikkhave, pañcime ādīnavā mātugāme. Katame pañca? Kodhano, upanāhī, ghoraviso, dujjivho, mittadubbhī. Tatridaṃ, bhikkhave, mātugāmassa ghoravisatā – yebhuyyena, bhikkhave, mātugāmo tibbarāgo. Tatridaṃ, bhikkhave, mātugāmassa dujjivhatā – yebhuyyena, bhikkhave, mātugāmo pisuṇavāco. Tatridaṃ, bhikkhave, mātugāmassa mittadubbhitā – yebhuyyena, bhikkhave, mātugāmo aticārinī. Ime kho, bhikkhave, pañca ādīnavā mātugāme’’ti. Dasamaṃ. ",
      "english": "Monks, there are these five dangers in a black snake. Which five? They are: being wrathful, being resentful, being terribly venomous, having a wicked tongue, and being treacherous towards friends. Indeed, monks, these are the five dangers in a black snake.\n\nSimilarly, monks, there are these five dangers in a woman. Which five? They are: being wrathful, being resentful, being terribly venomous, having a wicked tongue, and being treacherous towards friends. Herein, monks, a woman's terribleness of venom means that for the most part, monks, a woman is intensely passionate. Herein, monks, a woman's wicked tongue means that for the most part, monks, a woman engages in divisive speech. Herein, monks, a woman's treachery towards friends means that for the most part, monks, a woman is unfaithful. Indeed, monks, these are the five dangers in a woman.",
      "sinhala": "භික්ෂූනි, කළු නාගයා තුළ මේ ආදීනව පහක් ඇත. ඒ පහ කවරේද? ක‍්‍රෝධ ස්වභාවයෙන් යුක්ත වීම, වෛර බඳින සුළු වීම, දරුණු විෂ සහිත වීම, නපුරු දිවක් ඇති වීම, මිතුරන්ට ද‍්‍රෝහී වීම – භික්ෂූනි, කළු නාගයා තුළ ඇති ආදීනව පහ මේවායි.\n\nභික්ෂූනි, එලෙසම ස්ත්‍රීන් තුළද මේ ආදීනව පහක් ඇත. ඒ පහ කවරේද? ක‍්‍රෝධ ස්වභාවයෙන් යුක්ත වීම, වෛර බඳින සුළු වීම, දරුණු විෂ සහිත වීම, නපුරු දිවක් ඇති වීම, මිතුරන්ට ද‍්‍රෝහී වීම. භික්ෂූනි, ස්ත්‍රීන්ගේ දරුණු විෂ සහිත බව නම්, බොහෝවිට ස්ත්‍රීන් අධික රාගය ඇත්තෝ වීමයි. භික්ෂූනි, ස්ත්‍රීන්ගේ නපුරු දිවක් ඇති බව නම්, බොහෝවිට ස්ත්‍රීන් කේලාම් කියන සුළු වීමයි. භික්ෂූනි, ස්ත්‍රීන්ගේ මිතුරන්ට ද‍්‍රෝහී වන බව නම්, බොහෝවිට ස්ත්‍රීන් අතිචාරයේ යෙදෙන සුළු වීමයි. භික්ෂූනි, ස්ත්‍රීන් තුළ මේ ආදීනව පහ මේවායි.",
      "paliTitle": "Dutiyakaṇhasappasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Dīghacārikavaggo tatiyo. Tassuddānaṃ – Dve dīghacārikā vuttā, atinivāsamaccharī; Dve ca kulūpakā bhogā, bhattaṃ sappāpare duveti.",
    "english": "",
    "sinhala": ""
  }
}