{
  "id": "an5.28",
  "title": {
    "pali": "Sikkhāpadapeyyālaṃ",
    "english": "The Standard Passage on Training Rules",
    "sinhala": "සික්ඛාපද පෙයියාලය."
  },
  "sections": [
    {
      "number": 286,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Pāṇātipātī hoti, adinnādāyī hoti, abrahmacārī hoti, musāvādī hoti, surāmerayamajjapamādaṭṭhāyī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, abrahmacariyā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ.",
      "english": "“Monks, a bhikkhu endowed with five qualities is consigned to hell, just as if he had been brought and laid there. With which five? He is one who takes life; he is one who takes what is not given; he is one who engages in unchaste conduct; he is one who speaks falsely; he is one who indulges in intoxicants that cause heedlessness. Monks, a bhikkhu endowed with these five qualities is consigned to hell, just as if he had been brought and laid there.”\n\n“Monks, a bhikkhu endowed with five qualities is consigned to heaven, just as if he had been brought and laid there. With which five? He abstains from taking life; he abstains from taking what is not given; he abstains from unchaste conduct; he abstains from false speech; he abstains from intoxicants that cause heedlessness. Monks, a bhikkhu endowed with these five qualities is consigned to heaven, just as if he had been brought and laid there.”",
      "sinhala": "මහණෙනි, පඤ්ච ධර්‍මයන්ගෙන් සමන්වාගත භික්ෂුවක් ගෙනවිත් දැමුවාක් මෙන් නිරයට වැටෙයි. ඒ කවර පසකින්ද? ප්‍රාණඝාතයෙහි යෙදෙන්නෙක් වෙයි, අදත්තාදානයෙහි යෙදෙන්නෙක් වෙයි, අබ්‍රහ්මචාරී වෙයි, මුසාවාදී වෙයි, මත්පැන් පානය කිරීම හා මත්ද්‍රව්‍ය භාවිතය නිසා ප්‍රමාදයට පැමිණෙන්නෙක් වෙයි. මහණෙනි, මේ පඤ්ච ධර්‍මයන්ගෙන් සමන්වාගත භික්ෂුවක් ගෙනවිත් දැමුවාක් මෙන් නිරයට වැටෙයි.\n\nමහණෙනි, පඤ්ච ධර්‍මයන්ගෙන් සමන්වාගත භික්ෂුවක් ගෙනවිත් දැමුවාක් මෙන් ස්වර්ගයට වැටෙයි. ඒ කවර පසකින්ද? ප්‍රාණඝාතයෙන් වැළකුණෙක් වෙයි, අදත්තාදානයෙන් වැළකුණෙක් වෙයි, අබ්‍රහ්මචරියාවෙන් වැළකුණෙක් වෙයි, මුසාවාදයෙන් වැළකුණෙක් වෙයි, මත්පැන් පානය හා මත්ද්‍රව්‍ය භාවිතය නිසා ඇතිවන ප්‍රමාදයෙන් වැළකුණෙක් වෙයි. මහණෙනි, මේ පඤ්ච ධර්‍මයන්ගෙන් සමන්වාගත භික්ෂුවක් ගෙනවිත් දැමුවාක් මෙන් ස්වර්ගයට වැටෙයි.",
      "paliTitle": "Bhikkhusuttaṃ"
    },
    {
      "number": 287,
      "numberRange": "287-292",
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgatā bhikkhunī…pe… sikkhamānā… sāmaṇero… sāmaṇerī… upāsako… upāsikā yathābhataṃ nikkhittā evaṃ niraye. Katamehi pañcahi? Pāṇātipātinī hoti, adinnādāyinī hoti, kāmesumicchācārinī hoti, musāvādinī hoti, surāmerayamajjapamādaṭṭhāyinī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ niraye. ‘‘Pañcahi, bhikkhave, dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ sagge. Katamehi pañcahi? Pāṇātipātā paṭiviratā hoti, adinnādānā paṭiviratā hoti, kāmesumicchācārā paṭiviratā hoti, musāvādā paṭiviratā hoti, surāmerayamajjapamādaṭṭhānā paṭiviratā hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ sagge’’ti. Sattamaṃ.",
      "english": "Monks, a bhikkhunī, a female trainee, a male novice, a female novice, a male lay follower, or a female lay follower endowed with five qualities is consigned to hell, just as if carried and laid down. Which five? She is one who destroys living beings, she is one who takes what is not given, she is one who engages in sexual misconduct, she is one who speaks falsely, and she is one who indulges in fermented and distilled intoxicants, which are the basis for heedlessness. Monks, a female lay follower endowed with these five qualities is consigned to hell, just as if carried and laid down.\n\nMonks, a female lay follower endowed with five qualities is consigned to heaven, just as if carried and laid down. Which five? She abstains from destroying living beings, she abstains from taking what is not given, she abstains from sexual misconduct, she abstains from false speech, and she abstains from fermented and distilled intoxicants, which are the basis for heedlessness. Monks, a female lay follower endowed with these five qualities is consigned to heaven, just as if carried and laid down.",
      "sinhala": "මහණෙනි, ධර්ම ක්‍රියා පහකින් යුක්ත වූ භික්ෂුණියක්, ශික්ෂමානාවක්, සාමණේරයෙක්, සාමණේරියක්, උපාසකයෙක්, උපාසිකාවක් දැඩිව අල්ලාගෙන නිරයට ඇද දමනු ලැබූවක් මෙන් නිරයටම පත්වෙයි. ඒ කවර ධර්ම ක්‍රියා පහකින්ද? ප්‍රාණඝාත කරන්නියක් වීම, අදත්තාදානය කරන්නියක් වීම, කාමයන්හි වරදවා හැසිරෙන්නියක් වීම, මුසාවාද කියන්නියක් වීම, සුරාමේරය මත්පැන් පානය කිරීමෙන් ප්‍රමාදයට පත්වන්නියක් වීම යන මේවා යි. මහණෙනි, මේ ධර්ම ක්‍රියා පහකින් යුක්ත වූ උපාසිකාවක් දැඩිව අල්ලාගෙන නිරයට ඇද දමනු ලැබූවක් මෙන් නිරයටම පත්වෙයි.\n\nමහණෙනි, ධර්ම ක්‍රියා පහකින් යුක්ත වූ උපාසිකාවක් දැඩිව අල්ලාගෙන ස්වර්ගයට ඇද දමනු ලැබූවක් මෙන් ස්වර්ගයටම පත්වෙයි. ඒ කවර ධර්ම ක්‍රියා පහකින්ද? ප්‍රාණඝාතයෙන් වෙන් වූවක් වීම, අදත්තාදානයෙන් වෙන් වූවක් වීම, කාමයන්හි වරදවා හැසිරීමෙන් වෙන් වූවක් වීම, මුසාවාදයෙන් වෙන් වූවක් වීම, සුරාමේරය මත්පැන් පානය කිරීමෙන් ප්‍රමාදයට පත්වීමෙන් වෙන් වූවක් වීම යන මේවා යි. මහණෙනි, මේ ධර්ම ක්‍රියා පහකින් යුක්ත වූ උපාසිකාවක් දැඩිව අල්ලාගෙන ස්වර්ගයට ඇද දමනු ලැබූවක් මෙන් ස්වර්ගයටම පත්වෙයි.",
      "paliTitle": "Bhikkhunīsuttādichakkaṃ"
    },
    {
      "number": 293,
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato ājīvako yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Pāṇātipātī hoti, adinnādāyī hoti, abrahmacārī hoti, musāvādī hoti, surāmerayamajjapamādaṭṭhāyī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato ājīvako yathābhataṃ nikkhitto evaṃ niraye’’ti. Aṭṭhamaṃ.",
      "english": "Monks, an Ajivaka endowed with five qualities is cast into hell, just as he was brought there. Which five? He is one who takes life, one who takes what is not given, one who engages in sexual misconduct, one who speaks falsely, and one who indulges in fermented and distilled liquors that lead to heedlessness. Monks, an Ajivaka endowed with these five qualities is cast into hell, just as he was brought there.",
      "sinhala": "මහණෙනි, පස් වැදෑරුම් දහමින් සමන්විත වූ යම්කිසි ආජීවකයෙක් (භාරයක්) බහා තැබූවක් මෙන් නිරයටම පත් වේ.\n\nකවර නම් පස් වැදෑරුම් දහමින්ද යත්; ප්‍රාණඝාතයෙහි යෙදෙන්නෙක් වේ, අදත්තාදානයෙහි යෙදෙන්නෙක් වේ, අබ්‍රහ්මචාරී වේ, මුසාවාදෙහි යෙදෙන්නෙක් වේ, සුරාමේරය පානය කිරීමෙන් ප්‍රමාදයට පැමිණෙන්නෙක් වේ.\n\nමහණෙනි, නියත වශයෙන්ම මේ පස් වැදෑරුම් දහමින් සමන්විත වූ ආජීවකයෙක් බහා තබන ලද දෙයක් මෙන් නිරයටම පත් වේ.",
      "paliTitle": "Ājīvakasuttaṃ"
    },
    {
      "number": 294,
      "numberRange": "294-302",
      "pali": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato nigaṇṭho…pe… muṇḍasāvako… jaṭilako… paribbājako… māgaṇḍiko… tedaṇḍiko… āruddhako… gotamako… devadhammiko yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Pāṇātipātī hoti, adinnādāyī hoti…pe… surāmerayamajjapamādaṭṭhāyī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato devadhammiko yathābhataṃ nikkhitto evaṃ niraye’’ti. Sattarasamaṃ. ",
      "english": "Monks, a Nigaṇṭha ascetic, a shaven-headed disciple, a matted-haired ascetic, a wandering ascetic, a follower of Māgaṇḍiya, a three-staff ascetic, an ascetic of severe practices, a nominal follower of Gotama, or a practitioner of the 'divine dharma' who is endowed with five qualities, is cast into hell just as they are brought there. Which five? He takes the lives of living beings, he takes what is not given, he engages in sexual misconduct, he speaks falsely, and he indulges in intoxicants that lead to heedlessness. Indeed, monks, a practitioner of the 'divine dharma' endowed with these five qualities is cast into hell just as they are brought there.",
      "sinhala": "මහණෙනි, කරුණු පහකින් යුක්ත වූ නිගණ්ඨ, මුඬ ශ්‍රාවක, ජටිල, පරිබ්‍රාජක, මාගණ්ඩික, ත්‍රෛදණ්ඩික, ආරුද්ධක, ගෝතමක, දේවධර්මික යන මෙවැනි පුද්ගලයෝ, (තමන්ගේ ක්‍රියාවන් විසින්) රැගෙනවිත් දැමූ සේම නිරයට පත්වෙති.\n\nඒ කරුණු පහ කවරේද?\n\nඔහු ප්‍රාණඝාතී වේ. අදින්නාදායී වේ. කාමයන්හි වරදවා හැසිරෙයි. මුසාවාදී වේ. සුරාමේරය මද්‍යපානයෙන් ප්‍රමාදයට පැමිණෙයි.\n\nමහණෙනි, මේ කරුණු පහෙන් යුක්ත වූ දේවධර්මික පුද්ගලයාද, (තමන්ගේ ක්‍රියාවන් විසින්) රැගෙනවිත් දැමූ සේම නිරයට පත්වෙයි.",
      "paliTitle": "Nigaṇṭhasuttādinavakaṃ"
    }
  ],
  "footer": {
    "pali": "Sikkhāpadapeyyālaṃ niṭṭhitaṃ.",
    "english": "",
    "sinhala": ""
  }
}