{
  "id": "sn.2.9",
  "title": {
    "pali": "Opammasaṃyuttaṃ",
    "english": "The Connected Discourses on Similes",
    "sinhala": "උපමා සංයුත්තය"
  },
  "sections": [
    {
      "number": 223,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘seyyathāpi, bhikkhave, kūṭāgārassa yā kāci gopānasiyo sabbā tā kūṭaṅgamā kūṭasamosaraṇā kūṭasamugghātā sabbā tā samugghātaṃ gacchanti; evameva kho, bhikkhave, ye keci akusalā dhammā sabbe te avijjāmūlakā avijjāsamosaraṇā avijjāsamugghātā, sabbe te samugghātaṃ gacchanti. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s Park.\n\nThere the Blessed One addressed the monks, saying, “Monks!”\n\n“Venerable Sir,” those monks replied to the Blessed One.\n\nThe Blessed One spoke this: “Just as, monks, in a house with a peaked roof, whatever rafters there are, all go toward the peak, converge at the peak, meet termination at the peak, and all reach their full termination; even so, monks, whatever unwholesome states there are, all of them have ignorance as their root, converge in ignorance, are terminated by ignorance, and all reach their termination. Therefore, monks, this is how you must train: ‘We shall dwell heedfully.’ For thus, monks, should you train.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමය​ක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයෙහි වැඩ වාසය කළ සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලා අමතා, \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි එම භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, යම් සේ කූටාගාරයක (මුදුන් ලීය සහිත ගෙයක) යම් කිසි පරාල දඬු ඇත්ද, ඒ සියල්ල මුදුන කරා යන්නාහු, මුදුනෙහිම එක්රැස් වන්නාහු, මුදුනෙහිම අවසන් වන්නාහු, ඒ සියල්ල මුදුනෙහිම විනාශයට/අවසනට පත්වෙත්ද;\n\nඑපරිද්දෙන්ම, මහණෙනි, යම් කිසි අකුශල ධර්ම කෙනෙක් ඇත්ද, ඒ සියල්ලෝම අවිද්‍යාව මුල් කරගත් ඒවා වෙත්. අවිද්‍යාවෙහිම එක්රැස් වන්නාහු, අවිද්‍යාවෙහිම අවසන් වන්නාහු, ඒ සියල්ලෝම අවිද්‍යාවෙහිම අවසන් වෙත්.\n\nඑබැවින් මහණෙනි, 'අපි අප්‍රමාදීව වාසය කරන්නෙමු' යි මෙසේ පුහුණු විය යුතුය. මහණෙනි, ඇත්ත වශයෙන්ම ඔබ විසින් මෙසේ පුහුණු විය යුතු වන්නේය.\"",
      "paliTitle": "Kūṭasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Peak",
      "sinhalaTitle": "කූට සූත්‍රය"
    },
    {
      "number": 224,
      "pali": "Sāvatthiyaṃ viharati. Atha kho bhagavā parittaṃ nakhasikhāyaṃ paṃsuṃ āropetvā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha bhikkhave, katamaṃ nu kho bahutaraṃ, yo vāyaṃ [yo cāyaṃ (bahūsu)] mayā paritto nakhasikhāyaṃ paṃsu āropito ayaṃ vā [yā cāyaṃ (syā. ka.)] mahāpathavī’’ti? ‘‘Etadeva, bhante, bahutaraṃ yadidaṃ mahāpathavī. Appamattakoyaṃ bhagavatā paritto nakhasikhāyaṃ paṃsu āropito. Saṅkhampi na upeti upanidhimpi na upeti kalabhāgampi na upeti mahāpathaviṃ upanidhāya bhagavatā paritto nakhasikhāyaṃ paṃsu āropito’’ti. ‘‘Evameva kho, bhikkhave, appakā te sattā ye manussesu paccājāyanti; atha kho eteyeva bahutarā sattā ye aññatra manussehi paccājāyanti. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "He dwells at Sāvatthī. Then, indeed, the Fortunate One, having placed a small amount of dust upon his fingertip, addressed the bhikkhus: “What do you think, Monks? Which, now, is greater: this small amount of dust placed by me upon my fingertip, or this great earth?”\n\n“Venerable Sir, this great earth is much greater. The small amount of dust placed on the fingertip by the Fortunate One is trifling. When compared to the great earth, the small amount of dust placed on the fingertip by the Fortunate One does not count as a reckoning, does not count as a comparison, does not amount even to a fractional part.”\n\n“Just so, Monks, few are those beings who are reborn among humans. But much more numerous are those beings who are reborn elsewhere than among humans. Therefore, Monks, you must train yourselves thus: ‘We will dwell heedfully and diligently.’ Thus, indeed, Monks, should you train yourselves.”",
      "sinhala": "ශ්‍රා​වස්තියේ වාසය කරයි. ඉන්පසු භාග්‍යවතුන්​වහන්සේ ස්වල්ප වූ පස් ප්‍රමාණයක් නිය අග තබා භික්ෂූන් අමතා වදාළේය—‘‘මහණෙනි, මේ පිළිබඳව ඔබලා කුමක් සිතන්නේද? මා විසින් නිය අග තබන ලද මේ ස්වල්ප වූ පස් ප්‍රමාණයද, එසේ නැතහොත් මේ මහා පොළොවද, මේ දෙකින් බොහෝ වන්නේ කවරේද?’’ යනුවෙනි.\n\n‘‘ස්වාමීනි, ඒකාන්තයෙන්ම මේ මහා පොළොව බොහෝ වන්නේය. භාග්‍යවතුන්​වහන්සේ විසින් නිය අග තබන ලද මේ ස්වල්ප වූ පස් ප්‍රමාණය ඉතා සුළුය. මහා පොළොවට සාපේක්ෂව ගත් කළ, භාග්‍යවතුන්​වහන්සේ විසින් නිය අග තබන ලද මේ ස්වල්ප වූ පස් ප්‍රමාණය ගණනට හෝ, උපමාවට හෝ, කලාභාගයකට හෝ නොපැමිණේ.’’\n\n‘‘මහණෙනි, එපරිද්දෙන්ම යම් සත්වයෝ මනුෂ්‍යයන් අතර නැවත උපදිත්ද, ඔවුහු ස්වල්ප දෙනෙකි; යම් සත්වයෝ මනුෂ්‍යයන්ගෙන් බැහැරව නැවත උපදිත්ද, ඔවුහුම බොහෝ වෙති. එහෙයින් මහණෙනි, ‘අප්‍රමාදීව වාසය කරන්නෙමු’ යි මෙසේ පුහුණු විය යුතුයි. මහණෙනි, ඔබලා විසින් මෙසේ පුහුණු විය යුතුමය.’’",
      "paliTitle": "Nakhasikhasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Tip of the Fingernail",
      "sinhalaTitle": "නඛසිඛ සූත්‍රය"
    },
    {
      "number": 225,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, yāni kānici kulāni bahutthikāni appapurisāni tāni suppadhaṃsiyāni honti corehi kumbhatthenakehi; evameva kho, bhikkhave, yassa kassaci bhikkhuno mettācetovimutti abhāvitā abahulīkatā so suppadhaṃsiyo hoti amanussehi. Seyyathāpi, bhikkhave, yāni kānici kulāni appitthikāni bahupurisāni tāni duppadhaṃsiyāni honti corehi kumbhatthenakehi, evameva kho, bhikkhave, yassa kassaci bhikkhuno mettācetovimutti bhāvitā bahulīkatā so duppadhaṃsiyo hoti amanussehi. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘mettā no cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Tatiyaṃ.",
      "english": "Just as, monastics, those families which have many possessions but few defenders are easily overpowered by thieves and brigands; even so, monastics, whatever monastic has not developed and not frequently practiced the liberation of mind through loving-kindness, that one is easily overpowered by non-human beings.\n\nJust as, monastics, those families which have few possessions but many defenders are difficult to overpower by thieves and brigands; even so, monastics, whatever monastic has developed and frequently practiced the liberation of mind through loving-kindness, that one is difficult to overpower by non-human beings.\n\nTherefore, monastics, you should train yourselves in this way: 'Our liberation of mind through loving-kindness shall be developed, frequently practiced, made our vehicle, made our foundation, established, sustained, and thoroughly undertaken.' Thus indeed, monastics, should you train.",
      "sinhala": "මහණෙනි, යම්කිසි කුලයක් වුව ද බහුල වස්තුවෙන් යුක්ත නම්, ස්වල්ප පුරුෂයන්ගෙන් යුක්ත නම්, සොරුන් හා ගෙබිඳින්නන් විසින් ඒවා පහසුවෙන් මැඩපැවැත්විය හැකි වෙයි.\n\nඑපරිද්දෙන්ම මහණෙනි, යම්කිසි භික්ෂුවකගේ මෛත්‍රී චේතෝවිමුක්තිය වඩන ලද්දක් නොවන්නේද, බහුල වශයෙන් පුරුදු කරන ලද්දක් නොවන්නේද, ඔහු අමනුෂ්‍යයන් විසින් පහසුවෙන් මැඩපැවැත්විය හැකි වන්නේ ය.\n\nමහණෙනි, යම්කිසි කුලයක් වුව ද ස්වල්ප වස්තුවෙන් යුක්ත නම්, බහුල පුරුෂයන්ගෙන් යුක්ත නම්, සොරුන් හා ගෙබිඳින්නන් විසින් ඒවා මැඩපැවැත්වීමට දුෂ්කර වෙයි.\n\nඑපරිද්දෙන්ම මහණෙනි, යම්කිසි භික්ෂුවකගේ මෛත්‍රී චේතෝවිමුක්තිය වඩන ලද්දක්ද, බහුල වශයෙන් පුරුදු කරන ලද්දක්ද, ඔහු අමනුෂ්‍යයන් විසින් මැඩපැවැත්වීමට දුෂ්කර වන්නේ ය.\n\nඑහෙයින් මහණෙනි, මෙසේ හික්මිය යුතු වන්නේ ය: ‘අපගේ මෛත්‍රී චේතෝවිමුක්තිය වඩන ලද්දක් වන්නේය, බහුල වශයෙන් පුරුදු කරන ලද්දක් වන්නේය, යානයක් බවට පත් කරන ලද්දක් වන්නේය, වස්තුවක් බවට පත් කරන ලද්දක් වන්නේය, පිහිටුවන ලද්දක් වන්නේය, තහවුරු කරන ලද්දක් වන්නේය, මනාව ආරම්භ කරන ලද්දක් වන්නේය’යි. මහණෙනි, නුඹලා විසින් මෙසේම හික්මිය යුතු වන්නේ ය.",
      "paliTitle": "Kulasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Families",
      "sinhalaTitle": "කුල සූත්‍රය"
    },
    {
      "number": 226,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘yo, bhikkhave, pubbaṇhasamayaṃ okkhāsataṃ dānaṃ dadeyya, yo majjhanhikasamayaṃ okkhāsataṃ dānaṃ dadeyya, yo sāyanhasamayaṃ okkhāsataṃ dānaṃ dadeyya, yo vā pubbaṇhasamayaṃ antamaso gadduhanamattampi mettacittaṃ bhāveyya, yo vā majjhanhikasamayaṃ antamaso gadduhanamattampi mettacittaṃ bhāveyya, yo vā sāyanhasamayaṃ antamaso gadduhanamattampi mettacittaṃ bhāveyya, idaṃ tato mahapphalataraṃ. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘mettā no cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Catutthaṃ.",
      "english": "Monks, if someone were to give a hundred measures of gifts in the morning, and someone were to give a hundred measures of gifts at midday, and someone were to give a hundred measures of gifts in the evening, or if someone were to develop a mind of loving-kindness in the morning, even for the time it takes to milk a cow once, or if someone were to develop a mind of loving-kindness at midday, even for the time it takes to milk a cow once, or if someone were to develop a mind of loving-kindness in the evening, even for the time it takes to milk a cow once, this is far more fruitful than that. Therefore, monks, you should train yourselves in this way: ‘Our liberation of mind through loving-kindness will be developed, made much of, made a vehicle, made a foundation, firmly established, familiarized, and well applied.’ That is how you must train yourselves, monks.",
      "sinhala": "ශ්‍රාවස්තියෙහි වැඩ වාසය කරන සේක… (පෙ)…\n\nමහණෙනි, යමෙක් පෙරවරුවේදී සියක් කොටස් දන් දෙන්නේ නම්, යමෙක් දහවල් කාලයේදී සියක් කොටස් දන් දෙන්නේ නම්, යමෙක් සවස් කාලයේදී සියක් කොටස් දන් දෙන්නේ නම්; නැතහොත්, යමෙක් පෙරවරුවේදී ගවදෙනක දොවනය පිණිස තරම් වූ කෙටි මොහොතක් හෝ මෛත්‍රී චිත්තය වඩන්නේ නම්, නැතහොත් යමෙක් දහවල් කාලයේදී ගවදෙනක දොවනය පිණිස තරම් වූ කෙටි මොහොතක් හෝ මෛත්‍රී චිත්තය වඩන්නේ නම්, නැතහොත් යමෙක් සවස් කාලයේදී ගවදෙනක දොවනය පිණිස තරම් වූ කෙටි මොහොතක් හෝ මෛත්‍රී චිත්තය වඩන්නේ නම්, මෙය (දන් දීමට) වඩා අතිශයින්ම මහත් ඵලදායක වෙයි.\n\nඑබැවින්, මහණෙනි, මෙසේ හික්මිය යුතු ය: ‘අපගේ මෛත්‍රී චේතෝවිමුක්තිය වැඩුනක්, බහුල වශයෙන් කරන ලද්දක්, යානයක් කොට කරන ලද්දක්, වස්තුවක් කොට කරන ලද්දක්, ස්ථිරව පිහිටුවන ලද්දක්, පුරුදු කරන ලද්දක්, මැනවින් ආරම්භ කරන ලද්දක් වන්නේවා’යි. මහණෙනි, නුඹලා විසින් මෙසේම හික්මිය යුතු ය.\n\nසතරවැනි සූත්‍රය යි.",
      "paliTitle": "Okkhāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Serving Dish Sutta",
      "sinhalaTitle": "ඔක්ඛා සූත්‍රය"
    },
    {
      "number": 227,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, satti tiṇhaphalā. Atha puriso āgaccheyya – ‘ahaṃ imaṃ sattiṃ tiṇhaphalaṃ pāṇinā vā muṭṭhinā vā paṭileṇissāmi paṭikoṭṭissāmi paṭivaṭṭessāmī’ti. Taṃ kiṃ maññatha, bhikkhave, bhabbo nu kho so puriso amuṃ sattiṃ tiṇhaphalaṃ pāṇinā vā muṭṭhinā vā paṭileṇetuṃ paṭikoṭṭetuṃ paṭivaṭṭetu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, satti tiṇhaphalā na sukarā pāṇinā vā muṭṭhinā vā paṭileṇetuṃ paṭikoṭṭetuṃ paṭivaṭṭetuṃ. Yāvadeva ca pana so puriso kilamathassa vighātassa bhāgī assā’’ti. ‘‘Evameva kho, bhikkhave, yassa kassaci bhikkhuno mettācetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, tassa ce amanusso cittaṃ khipitabbaṃ maññeyya; atha kho sveva amanusso kilamathassa vighātassa bhāgī assa. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘mettā no cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Pañcamaṃ.",
      "english": "Monks, suppose there were a spear with a sharp point. Then a man might come, thinking: \"I shall blunt, or strike down, or turn back this sharp-pointed spear with my hand or with my fist.\" What do you think, monks? Is that man capable of blunting, or striking down, or turning back that sharp-pointed spear with his hand or with his fist?\n\n\"No, Venerable Sir.\"\n\n\"For what reason?\"\n\n\"Because, Venerable Sir, that sharp-pointed spear is not easy to blunt, strike down, or turn back with the hand or with the fist. Instead, that man would only become subject to weariness and injury.\"\n\nJust so, monks, if any monk has cultivated the liberation of mind through loving-kindness, practiced it frequently, made it his vehicle, made it his foundation, stabilized it, familiarized himself with it, and brought it to a proper peak of perfection; and if a non-human being should imagine that he could disturb that monk’s mind, then that non-human being would only become subject to weariness and injury. Therefore, monks, this is how you must train yourselves: ‘Our liberation of mind through loving-kindness will be cultivated, practiced frequently, made our vehicle, made our foundation, stabilized, familiarized, and brought to a proper peak of perfection.’ In this way, monks, you must train yourselves.",
      "sinhala": "මහණෙනි, යම්සේ තියුණු තුඩක් ඇති හීයක් වේද. එකල්හි යම් පුරුෂයෙක් පැමිණ, ‘මම මේ තියුණු තුඩ ඇති හීය අතින් හෝ මුෂ්ටියෙන් හෝ මොට්ට කරන්නෙමි, බිඳින්නෙමි, හෝ නැවත හරවන්නෙමි’ යි සිතන්නේය. මහණෙනි, ඔබලා මේ ගැන කුමක් සිතන්නේද? ඒ පුරුෂයාට ඒ තියුණු තුඩ ඇති හීය අතින් හෝ මුෂ්ටියෙන් හෝ මොට්ට කිරීමට, බිඳීමට හෝ නැවත හැරවීමට හැකි වේද?\n\nවහන්ස, එය එසේ කළ නොහැක.\n\nඒ කවර හෙයින්ද?\n\nවහන්ස, යම් හෙයකින් ඒ තියුණු තුඩ ඇති හීය අතින් හෝ මුෂ්ටියෙන් හෝ මොට්ට කිරීමට, බිඳීමට හෝ නැවත හැරවීමට පහසු නැත. එම පුරුෂයා වෙහෙසටත්, පීඩාවටත් පමණක් භාජනය වන්නේය.\n\nමහණෙනි, එපරිද්දෙන්ම, යම් භික්ෂුවක් විසින් මෛත්‍රී චේතෝවිමුක්තිය (සිතේ විමුක්තිය) වඩන ලද්දේද, බහුල වශයෙන් පුරුදු කරන ලද්දේද, වාහනයක් සේ කරන ලද්දේද, පදනමක් සේ කරන ලද්දේද, නිරතුරුවම අනුගමනය කරන ලද්දේද, හොඳින් රැස් කරන ලද්දේද, මැනවින් පටන් ගන්නා ලද්දේද, එම භික්ෂුවගේ සිත වික්ෂිප්ත කළ යුතු යැයි අමනුෂ්‍යයෙක් සිතන්නේ නම්, ඒ අමනුෂ්‍යයාටම වෙහෙසටත්, පීඩාවටත් භාජනය වීමට සිදුවේ. එබැවින්, මහණෙනි, ඔබලා මෙසේ හික්මිය යුතුය: ‘අප විසින් මෛත්‍රී චේතෝවිමුක්තිය වඩන ලද්දක්, බහුල වශයෙන් පුරුදු කරන ලද්දක්, වාහනයක් සේ කරන ලද්දක්, පදනමක් සේ කරන ලද්දක්, නිරතුරුවම අනුගමනය කරන ලද්දක්, හොඳින් රැස් කරන ලද්දක්, මැනවින් පටන් ගන්නා ලද්දක් බවට පත් කර ගනිමු.’ මහණෙනි, ඔබලා විසින් මෙසේ හික්මිය යුතුය.",
      "paliTitle": "Sattisuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Spear",
      "sinhalaTitle": "සත්ති සූත්‍රය"
    },
    {
      "number": 228,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, cattāro daḷhadhammā dhanuggahā susikkhitā katahatthā katūpāsanā catuddisā ṭhitā assu. Atha puriso āgaccheyya – ‘ahaṃ imesaṃ catunnaṃ daḷhadhammānaṃ dhanuggahānaṃ susikkhitānaṃ katahatthānaṃ katūpāsanānaṃ catuddisā kaṇḍe khitte appatiṭṭhite pathaviyaṃ gahetvā āharissāmī’ti. Taṃ kiṃ maññatha, bhikkhave, ‘javano puriso paramena javena samannāgato’ti alaṃ vacanāyā’’ti? ‘‘Ekassa cepi, bhante, daḷhadhammassa dhanuggahassa susikkhitassa katahatthassa katūpāsanassa kaṇḍaṃ khittaṃ appatiṭṭhitaṃ pathaviyaṃ gahetvā āhareyya – ‘javano puriso paramena javena samannāgato’ti alaṃ vacanāya, ko pana vādo catunnaṃ daḷhadhammānaṃ dhanuggahānaṃ susikkhitānaṃ katahatthānaṃ katūpāsanāna’’nti? ‘‘Yathā ca, bhikkhave, tassa purisassa javo, yathā ca candimasūriyānaṃ javo, tato sīghataro. Yathā ca, bhikkhave, tassa purisassa javo yathā ca candimasūriyānaṃ javo yathā ca yā devatā candimasūriyānaṃ purato dhāvanti tāsaṃ devatānaṃ javo, ( ) [(tato sīghataro. yathā ca bhikkhave tassa purisassa javo, yathā ca candimasuriyānaṃ javo, yathā ca yā devatā candimasuriyānaṃ purato dhāvanti, tāsaṃ devatānaṃ javo,) (sī. syā. kaṃ.)] tato sīghataraṃ āyusaṅkhārā khiyanti. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Chaṭṭhaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī.\n\nMonks, suppose there were four strong, expert archers, highly skilled, accomplished in practice, trained in the craft of archery, standing in the four directions. Then a man might come and say, ‘I will catch and bring back the arrows shot by these four strong, expert archers, highly skilled, accomplished in practice, trained in the craft of archery, shot in the four directions, before they settle on the ground.’ What do you think, monks? Could it rightly be said of that man that he is ‘a person endowed with supreme speed’? “Even if, venerable sir, he could catch and bring back the arrow shot by just one strong, expert archer, highly skilled, accomplished in practice, trained in the craft of archery, before it settled on the ground, it could rightly be said of him that he is ‘a person endowed with supreme speed.’ How much more so concerning four strong, expert archers, highly skilled, accomplished in practice, trained in the craft of archery?” Monks, the speed of that man, the speed of the moon and the sun, and the speed of the deities who run before the moon and the sun—even faster than all of that do the life-formations wear away. Therefore, monks, this is how you must train yourselves: ‘We will dwell diligently.’ Indeed, monks, this is how you must train yourselves.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ ශ්‍රාවස්තියෙහි වැඩසිටින සේක.\n\nමහණෙනි, යම්සේ ශක්තිමත් වූ, හොඳින් පුහුණු වූ, හී විදීමේ හුරුපුරුදු ඇති, දුනුකලාවෙහි දක්ෂ වූ දුනුවායෝ සතර දෙනෙක් සතර දිශාවෙහි සිටියා යැයි සිතමු. එවිට එක්තරා පුරුෂයෙක් පැමිණ, ‘මම මේ සතර දිශාවට හී විදිනා, ශක්තිමත් වූ, හොඳින් පුහුණු වූ, හී විදීමේ හුරුපුරුදු ඇති, දුනුකලාවෙහි දක්ෂ වූ ඒ දුනුවායන් සතර දෙනා විසින් විදින ලද, පොළොවේ නොපිහිටි හී ගෙනැවිත් දෙන්නෙමි’ යි කියන්නේ නම්, මහණෙනි, ඒ ගැන ඔබලාට කුමක් සිතේ ද? ‘ඒ පුරුෂයා අතිශයින් වේගයෙන් යුක්ත ය’ යි කීමට හැකි නොවේ ද? වහන්ස, එක් ශක්තිමත්, හොඳින් පුහුණු වූ, හී විදීමේ හුරුපුරුදු ඇති, දුනුකලාවෙහි දක්ෂ වූ දුනුවායෙකුගේ විදින ලද හීය ද පොළොවේ නොපිහිටි තැනදී අල්ලා ගෙනැවිත් දෙන්නේ නම්, ‘ඒ පුරුෂයා අතිශයින් වේගයෙන් යුක්ත ය’ යි කීමට සුදුසු ය. සතර දෙනෙකු ගැන කුමන කථා ද?\n\nමහණෙනි, ඒ පුරුෂයාගේ වේගයත්, සඳ හිරු දෙදෙනාගේ වේගයත් යම්සේ ද, ඊටත් වඩා වේගවත් ය. මහණෙනි, ඒ පුරුෂයාගේ වේගයත්, සඳ හිරු දෙදෙනාගේ වේගයත්, සඳ හිරු දෙදෙනාට පෙරටුව දුවන දෙවිවරුන්ගේ වේගයත් යම්සේ ද, ඒ සියල්ලටත් වඩා ඉක්මනින් ආයුෂ සංස්කාරයන්ගේ ක්ෂය වීම සිදු වේ. එහෙයින් මහණෙනි, ‘අප්‍රමාදී ව වාසය කරන්නෙමු’ යි මෙසේ ඔබලා විසින් ශික්‍ෂා කළ යුතු ය. මහණෙනි, ඔබ විසින් මෙසේම ශික්‍ෂා කළ යුතු ය.",
      "paliTitle": "Dhanuggahasuttaṃ",
      "vagga": "",
      "englishTitle": "The Archer Sutta",
      "sinhalaTitle": "ධනුග්ගහ සූත්‍රය"
    },
    {
      "number": 229,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘bhūtapubbaṃ, bhikkhave, dasārahānaṃ ānako [āṇako (sī.)] nāma mudiṅgo ahosi. Tassa dasārahā ānake ghaṭite aññaṃ āṇiṃ odahiṃsu. Ahu kho so, bhikkhave, samayo yaṃ ānakassa mudiṅgassa porāṇaṃ pokkharaphalakaṃ antaradhāyi. Āṇisaṅghāṭova avasissi. Evameva kho, bhikkhave, bhavissanti bhikkhū anāgatamaddhānaṃ, ye te suttantā tathāgatabhāsitā gambhīrā gambhīratthā lokuttarā suññatappaṭisaṃyuttā, tesu bhaññamānesu na sussūsissanti na sotaṃ odahissanti na aññā cittaṃ upaṭṭhāpessanti na ca te dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññissanti’’. ‘‘Ye pana te suttantā kavikatā kāveyyā cittakkharā cittabyañjanā bāhirakā sāvakabhāsitā, tesu bhaññamānesu sussūsissanti, sotaṃ odahissanti, aññā cittaṃ upaṭṭhāpessanti, te ca dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññissanti. Evametesaṃ, bhikkhave, suttantānaṃ tathāgatabhāsitānaṃ gambhīrānaṃ gambhīratthānaṃ lokuttarānaṃ suññatappaṭisaṃyuttānaṃ antaradhānaṃ bhavissati. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘ye te suttantā tathāgatabhāsitā gambhīrā gambhīratthā lokuttarā suññatappaṭisaṃyuttā, tesu bhaññamānesu sussūsissāma, sotaṃ odahissāma, aññā cittaṃ upaṭṭhāpessāma, te ca dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī. Monks, once upon a time, there was a drum belonging to the Dasārahas named Ānaka. When that drum Ānaka became worn out, the Dasārahas drove another peg into it. Indeed, Monks, there came a time when the old covering of the drum Ānaka disappeared entirely. Only the accumulation of pegs remained.\n\nJust so, Monks, in the future, there will be monks who, when those discourses spoken by the Tathāgata—which are deep, have profound meaning, are transcendent, and are connected with emptiness—are being recited, will neither listen attentively, nor lend an ear, nor apply their minds to realization, nor consider those teachings worth learning and mastering.\n\nBut as for those discourses which are created by poets, poetic compositions, having ornamental phrases and elaborate expressions, external teachings, and spoken by disciples—when those are being recited, they will listen attentively, lend an ear, and apply their minds to comprehension, and they will consider those teachings worth learning and mastering. Thus, Monks, there will be a disappearance of these discourses spoken by the Tathāgata—which are deep, have profound meaning, are transcendent, and are connected with emptiness.\n\nTherefore, Monks, you must train yourselves thus: ‘As for those discourses spoken by the Tathāgata—which are deep, have profound meaning, are transcendent, and are connected with emptiness—when they are being recited, we shall listen attentively, we shall lend an ear, we shall apply our minds to realization, and we shall consider those teachings worth learning and mastering.’ Indeed, Monks, this is how you must train yourselves.",
      "sinhala": "සැවැත්නුවර වාසය කරන සේක...\n\nමහණෙනි, පෙර දවස දසාරහ නම් රජවරුන්ට ආණක නම් බෙරයක් විය. දසාරහ රජවරු ඒ ආණක බෙරය අබලන් වූ විට තවත් ඇණයක් ඒ තුළට ගැසූහ. මහණෙනි, එකල ඒ ආණක බෙරයේ පැරණි බෙර පොත්ත අතුරුදන් වූ කාලයෙක්ද විය. ඇණ සමූහය පමණක් ඉතිරි විය.\n\nමහණෙනි, එසේම අනාගත කාලයෙහි භික්ෂූන් වහන්සේලා ඇතිවන්නාහ. යම් ඒ සූත්‍රයන් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද්දේ ගැඹුරු ද, ගැඹුරු අර්ථ ඇති ද, ලෝකෝත්තර ද, ශූන්‍යතාවයට සම්බන්ධ වූ ද වෙත් ද, ඒ සූත්‍රයන් දේශනා කරන කල්හි ඔවුහු සවන් නොදෙන්නාහ, කන නොදෙන්නාහ, අවබෝධය පිණිස සිත නොතබන්නාහ, ඒ ධර්මයන් උගත යුත්තක් හෝ පුරුදු කළ යුත්තක් ලෙස නොසිතන්නාහ. එහෙත් යම් ඒ සූත්‍රයන් කවීන් විසින් කරන ලද ද, කාව්‍යමය ද, විචිත්‍ර අකුරු ඇති ද, විචිත්‍ර ව්‍යංජන ඇති ද, බාහිර ද, ශ්‍රාවකයන් විසින් දේශනා කරන ලද ද වෙත් ද, ඒ සූත්‍රයන් දේශනා කරන කල්හි ඔවුහු සවන් දෙන්නාහ, කන දෙන්නාහ, අවබෝධය පිණිස සිත තබන්නාහ, ඒ ධර්මයන් උගත යුත්තක් හෝ පුරුදු කළ යුත්තක් ලෙස සලකන්නාහ. මහණෙනි, මේ අයුරින් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ගැඹුරු වූ, ගැඹුරු අර්ථ ඇති, ලෝකෝත්තර වූ, ශූන්‍යතාවයට සම්බන්ධ වූ ඒ සූත්‍රයන් අතුරුදන් වීම සිදුවන්නේය.\n\nඑහෙයින්, මහණෙනි, තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද යම් ඒ ගැඹුරු වූ, ගැඹුරු අර්ථ ඇති, ලෝකෝත්තර වූ, ශූන්‍යතාවයට සම්බන්ධ වූ සූත්‍රයන් වෙත් ද, ඒ සූත්‍රයන් දේශනා කරන කල්හි අපි සවන් දෙන්නෙමු, කන යොමු කරන්නෙමු, අවබෝධය පිණිස සිත තබන්නෙමු, ඒ ධර්මයන් උගත යුත්තක් හෝ පුරුදු කළ යුත්තක් ලෙස සලකන්නෙමු'යි මෙසේ හික්මිය යුත්තේය. මහණෙනි, ඇත්ත වශයෙන්ම ඔබ විසින් මෙසේ හික්මිය යුත්තේය.",
      "paliTitle": "Āṇisuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Drum-peg",
      "sinhalaTitle": "ආණි සූත්‍රය"
    },
    {
      "number": 230,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tatra kho bhagavā bhikkhū āmantesi ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Kaliṅgarūpadhānā, bhikkhave, etarahi licchavī viharanti appamattā ātāpino upāsanasmiṃ. Tesaṃ rājā māgadho ajātasattu vedehiputto na labhati otāraṃ na labhati ārammaṇaṃ. Bhavissanti, bhikkhave, anāgatamaddhānaṃ licchavī sukhumālā [sukumālā (sī.), sukhumā (ka.)] mudutalunahatthapādā [mudutalāhatthapādā (syā. kaṃ.)] te mudukāsu seyyāsu tūlabimbohanāsu [tūlabimbohanāsu (syā. kaṃ. pī.), tūlabimbohanādīsu (sī.), tūlabibbohanādīsu (ka.)] yāvasūriyuggamanā seyyaṃ kappissanti. Tesaṃ rājā māgadho ajātasattu vedehiputto lacchati otāraṃ lacchati ārammaṇaṃ. ‘‘Kaliṅgarūpadhānā, bhikkhave, etarahi bhikkhū viharanti appamattā ātāpino padhānasmiṃ. Tesaṃ māro pāpimā na labhati otāraṃ na labhati ārammaṇaṃ. Bhavissanti, bhikkhave, anāgatamaddhānaṃ bhikkhū sukhumā mudutalunahatthapādā. Te mudukāsu seyyāsu tūlabimbohanāsu yāvasūriyuggamanā seyyaṃ kappissanti. Tesaṃ māro pāpimā lacchati otāraṃ lacchati ārammaṇaṃ. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kaliṅgarūpadhānā viharissāma appamattā ātāpino padhānasmi’nti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Aṭṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall.\n\nThere the Blessed One addressed the monks, saying, \"Monks!\" \"Venerable sir,\" those monks replied to the Blessed One. The Blessed One spoke this:\n\n\"The Licchavis, monks, are presently dwelling with logs as bolsters, heedful, ardent, in their discipline. King Ajātasattu, the son of the Videhan lady, the ruler of Magadha, does not gain a foothold; he does not gain an opportunity against them.\n\nIn the future, monks, there will be Licchavis who are pampered, with soft, tender hands and feet. They will keep to their beds on soft couches with cotton-stuffed bolsters until sunrise. King Ajātasattu, the son of the Videhan lady, the ruler of Magadha, will gain a foothold; he will gain an opportunity against them.\n\n\"The monks, monks, are presently dwelling with logs as bolsters, heedful, ardent, in their spiritual exertion. Māra the Evil One does not gain a foothold; he does not gain an opportunity against them.\n\nIn the future, monks, there will be monks who are pampered, with soft, tender hands and feet. They will keep to their beds on soft couches with cotton-stuffed bolsters until sunrise. Māra the Evil One will gain a foothold; he will gain an opportunity against them.\n\nTherefore, monks, this is how you must train yourselves: ‘We will dwell with logs as bolsters, heedful, ardent, in spiritual exertion.’ This is indeed how you must train yourselves, monks.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ විශාලා මහනුවර මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩවාසය කරති. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළහ. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළහ:\n\n\"මහණෙනි, මේ දැන් ලිච්ඡවීහු දඬු කොට්ට කොටගනිමින් (දඬු ආදිය තබාගෙන නිදමින්) අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, තම කටයුතුවල නිරතව වාසය කරති. ඒ නිසා වේදේහි පුත්‍ර වූ මගධ රජ අජාතසත්තු රජුට ඔවුන්ට ඇතුළුවීමට (දොස් ඇසීමට) අවස්ථාවක් නොලැබේ, දුර්වලකමක් නොලැබේ. මහණෙනි, අනාගත කාලයෙහි ලිච්ඡවීහු සිහින් (සියුම්) ශරීර ඇත්තාහු, මෘදු තලූ සහිත අත් පා ඇත්තාහු වන්නාහ. ඔවුහු මෘදු සයනයන්හි, පුළුන් කොට්ට යොදාගෙන, හිරු උදාවන තුරු සයනය කරන්නාහ. ඔවුන්ට වේදේහි පුත්‍ර වූ මගධ රජ අජාතසත්තු රජුට අවස්ථාවක් ලැබෙන්නේ ය, දුර්වලකමක් ලැබෙන්නේ ය.\n\nමහණෙනි, මේ දැන් භික්ෂූහු දඬු කොට්ට කොටගනිමින් (දඬු ආදිය තබාගෙන නිදමින්) අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, ප්‍රධාන වීර්යයෙහි යෙදී වාසය කරති. ඒ නිසා පවිටු මාරයාට ඔවුන්ට ඇතුළුවීමට අවස්ථාවක් නොලැබේ, දුර්වලකමක් නොලැබේ. මහණෙනි, අනාගත කාලයෙහි භික්ෂූහු සිහින් (සියුම්) ශරීර ඇත්තාහු, මෘදු තලූ සහිත අත් පා ඇත්තාහු වන්නාහ. ඔවුහු මෘදු සයනයන්හි, පුළුන් කොට්ට යොදාගෙන, හිරු උදාවන තුරු සයනය කරන්නාහ. ඔවුන්ට පවිටු මාරයාට අවස්ථාවක් ලැබෙන්නේ ය, දුර්වලකමක් ලැබෙන්නේ ය. එහෙයින් මහණෙනි, නුඹලා මෙසේ හික්මිය යුතු ය: 'අපි දඬු කොට්ට කොටගෙන, අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, ප්‍රධාන වීර්යයෙහි යෙදී වාසය කරන්නෙමු' යනුවෙනි. මහණෙනි, නුඹලා විසින් මෙසේ ම හික්මිය යුතු ය.\"",
      "paliTitle": "Kaliṅgarasuttaṃ",
      "vagga": "",
      "englishTitle": "The Log Sutta",
      "sinhalaTitle": "කලිංගර සූත්‍රය"
    },
    {
      "number": 231,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena aññataro navo bhikkhu ativelaṃ kulāni upasaṅkamati. Tamenaṃ bhikkhū evamāhaṃsu – ‘‘māyasmā ativelaṃ kulāni upasaṅkamī’’ti. So bhikkhu bhikkhūhi vuccamāno evamāha – ‘‘ime hi nāma therā bhikkhū kulāni upasaṅkamitabbaṃ maññissanti, kimaṅgaṃ [kimaṅga (sī.)] panāha’’nti? Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, aññataro navo bhikkhu ativelaṃ kulāni upasaṅkamati. Tamenaṃ bhikkhū evamāhaṃsu – ‘māyasmā ativelaṃ kulāni upasaṅkamī’ti. So bhikkhu bhikkhūhi vuccamāno evamāha – ‘ime hi nāma therā bhikkhū kulāni upasaṅkamitabbaṃ maññissanti, kimaṅgaṃ panāha’’’nti. ‘‘Bhūtapubbaṃ, bhikkhave, araññāyatane mahāsarasī. Taṃ nāgā upanissāya viharanti. Te taṃ sarasiṃ ogāhetvā soṇḍāya bhisamuḷālaṃ abbuhetvā [abbhūhetvā (ka.), abbāhitvā (mahāva. 278)] suvikkhālitaṃ vikkhāletvā akaddamaṃ saṅkhāditvā [saṅkharitvā (pī. ka.)] ajjhoharanti. Tesaṃ taṃ vaṇṇāya ceva hoti balāya ca, na ca tatonidānaṃ maraṇaṃ vā nigacchanti maraṇamattaṃ vā dukkhaṃ. Tesaṃyeva kho pana, bhikkhave, mahānāgānaṃ anusikkhamānā taruṇā bhiṅkacchāpā taṃ sarasiṃ ogāhetvā soṇḍāya bhisamuḷālaṃ abbuhetvā na suvikkhālitaṃ vikkhāletvā sakaddamaṃ asaṅkhāditvā ajjhoharanti. Tesaṃ taṃ neva vaṇṇāya hoti na balāya. Tatonidānaṃ maraṇaṃ vā nigacchanti maraṇamattaṃ vā dukkhaṃ. ‘‘Evameva kho, bhikkhave, idha therā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisanti. Te tattha dhammaṃ bhāsanti. Tesaṃ gihī pasannākāraṃ karonti. Te taṃ lābhaṃ agadhitā amucchitā anajjhopannā [anajjhāpannā (sabbattha) ma. ni. 1 pāsarāsisuttavaṇṇanā oloketabbā] ādīnavadassāvino nissaraṇapaññā paribhuñjanti. Tesaṃ taṃ vaṇṇāya ceva hoti balāya ca, na ca tatonidānaṃ maraṇaṃ vā nigacchanti maraṇamattaṃ vā dukkhaṃ. Tesaṃyeva kho pana, bhikkhave, therānaṃ bhikkhūnaṃ anusikkhamānā navā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisanti. Te tattha dhammaṃ bhāsanti. Tesaṃ gihī pasannākāraṃ karonti. Te taṃ lābhaṃ gadhitā mucchitā ajjhopannā anādīnavadassāvino anissaraṇapaññā paribhuñjanti. Tesaṃ taṃ neva vaṇṇāya hoti na balāya, te tatonidānaṃ maraṇaṃ vā nigacchanti maraṇamattaṃ vā dukkhaṃ. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘agadhitā amucchitā anajjhopannā ādīnavadassāvino nissaraṇapaññā taṃ lābhaṃ paribhuñjissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ.",
      "english": "Thus have I heard. On one occasion, the Bhagavā was dwelling at Sāvatthī, in Jeta’s Grove, the monastery of Anāthapiṇḍika. Now, at that time, a certain new bhikkhu was visiting families too frequently. The bhikkhus told him this: \"Venerable sir, do not visit families so frequently.\" When he was addressed by the bhikkhus, that bhikkhu said: \"If these elder bhikkhus consider it permissible to visit families, why should I not?\"\n\nThen, a large number of bhikkhus approached the Bhagavā, paid homage to him, and sat down to one side. As they sat to one side, those bhikkhus said this to the Bhagavā: \"Here, Venerable sir, a certain new bhikkhu is visiting families too frequently. The bhikkhus told him this: 'Venerable sir, do not visit families so frequently.' When he was addressed by the bhikkhus, that bhikkhu said: 'If these elder bhikkhus consider it permissible to visit families, why should I not?'\"\n\n\"Bhikkhus, in the past, there was a great lake in a wilderness region. Elephants relied upon that lake and dwelt there. They would enter that lake, pull up lotus roots with their trunks, wash them thoroughly, and consume them, free from mud. This contributed to their luster and strength, and they did not thereby incur death or suffering comparable to death.\"\n\n\"But, bhikkhus, the young elephant calves who imitate those great elephants enter that lake, pull up the lotus roots with their trunks, do not wash them thoroughly, and consume them with the mud. This contributes neither to their luster nor to their strength. Due to this, they incur death or suffering comparable to death.\"\n\n\"In the same way, bhikkhus, here the elder bhikkhus, having dressed in the morning, taking their bowls and robes, enter a village or town for alms. There they teach the Dhamma. The lay people show them signs of devotion. They consume those gains without craving, without attachment, without being entangled, seeing the danger, and possessing the wisdom of escape. This contributes to their luster and strength, and they do not thereby incur death or suffering comparable to death.\"\n\n\"But, bhikkhus, the new bhikkhus who imitate those elder bhikkhus, having dressed in the morning, taking their bowls and robes, enter a village or town for alms. There they teach the Dhamma. The lay people show them signs of devotion. They consume those gains with craving, with attachment, being entangled, not seeing the danger, and lacking the wisdom of escape. This contributes neither to their luster nor to their strength. Due to this, they incur death or suffering comparable to death.\"\n\n\"Therefore, bhikkhus, you should train yourselves thus: 'We shall consume those gains without craving, without attachment, without being entangled, seeing the danger, and possessing the wisdom of escape.' In this way, bhikkhus, you must train yourselves.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනය නම් ආරාමයෙහි වැඩ වාසය කරති.\n\nඑකල්හි එක්තරා අලුත් භික්‍ෂුවක් නුසුදුසු වේලාවලදී කුලයන් කරා නිතරම පැමිණියේය. අන්‍ය භික්‍ෂූහු ඔහුට මෙසේ කීහ: “ආයුෂ්මත්වරයාණෙනි, නුසුදුසු වේලාවලදී කුලයන් කරා නොපැමිණෙන්න.” භික්‍ෂූන් විසින් මෙසේ කියනු ලැබූ ඒ භික්‍ෂුව මෙසේ කීයේය: “මෙම ස්ථවිර (වැඩිහිටි) භික්‍ෂූහු නම් කුලයන් කරා යා යුතු යැයි සිතති; එසේනම් මා ගැන කිව යුතු දේ කුමක්ද?”\n\nඉක්බිති බොහෝ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙක වාඩිවූහ. එකත්පසෙක වාඩිවූ ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ සැලකළහ: “ස්වාමීනි, මෙහි එක්තරා අලුත් භික්‍ෂුවක් නුසුදුසු වේලාවලදී කුලයන් කරා නිතරම පැමිණෙන්නේය. අන්‍ය භික්‍ෂූහු ඔහුට ‘ආයුෂ්මත්වරයාණෙනි, නුසුදුසු වේලාවලදී කුලයන් කරා නොපැමිණෙන්න’ යි කීහ. භික්‍ෂූන් විසින් මෙසේ කියනු ලැබූ ඒ භික්‍ෂුව ‘මෙම ස්ථවිර භික්‍ෂූහු නම් කුලයන් කරා යා යුතු යැයි සිතති; එසේනම් මා ගැන කිව යුතු දේ කුමක්දැ’ යි කීයේය.”\n\n“මහණෙනි, පෙර කාලයෙහි වනගත ප්‍රදේශයෙක මහා පොකුණක් තිබුණි. ඒ ආශ්‍රය කොට මහා නාගයෝ (මහ ඇතැන්) වාසය කළහ. ඔවුහු ඒ පොකුණට බැස, හොඬවැලෙන් ඕලු මුල් උදුරා, මැනවින් සෝදා, මඩ නැතිව පිරිසිදු කර අනුභව කළහ. එය ඔවුන්ගේ ශරීර ශෝභනවත්භාවයට ද, ශක්තියට ද හේතු විය. ඒ නිසා ඔවුහු මරණයට හෝ මරණය තරම් වූ දුකකට හෝ පත්වූයේ නැත.\n\n“මහණෙනි, ඒ මහා නාගයන් අනුකරණය කරන තරුණ ඇතැම් ඇතාගේ පැටව් ඒ පොකුණට බැස, හොඬවැලෙන් ඕලු මුල් උදුරා, මැනවින් නොසෝදා, මඩ සහිතව අනුභව කළහ. එය ඔවුන්ගේ පැහැපත් භාවයට ද නොවීය, ශක්තියට ද නොවීය. ඒ නිසා ඔවුහු මරණයට හෝ මරණය තරම් වූ දුකකට හෝ පත්වූහ.\n\n“මහණෙනි, එපරිද්දෙන්ම මෙහි ස්ථවිර භික්‍ෂූහු පෙරවරුයෙහි හැඳ, පාත්‍ර සිවුරු ගෙන ගමකට හෝ නියම්ගමකට හෝ පිඬුසිඟා වඩින්නාහ. ඔවුහු එහිදී ධර්මය භාෂණය කරති. ගිහියෝ ඔවුන්ට ප්‍රසන්න වූ ආකාරයෙන් (පූජා) කරති. ඔවුහු ඒ ලාභය තෘෂ්ණාවෙන් ඇලුම් නොවී, දැඩි ලෝලත්වයක් නැතිව, එයට දැඩි සේ බැස නොගෙන, එහි ආදීනව දකිමින්, නිස්සරණ (මිදීමේ) ප්‍රඥාවෙන් යුක්තව පරිභෝග කරති. එය ඔවුන්ගේ (ආධ්‍යාත්මික) පැහැයට ද, ශක්තියට ද හේතු වෙයි. ඒ නිසා ඔවුහු මරණයට හෝ මරණය තරම් වූ දුකකට හෝ පත්වූයේ නැත.\n\n“මහණෙනි, ඒ ස්ථවිර භික්‍ෂූන් අනුකරණය කරන නවක භික්‍ෂූහු පෙරවරුයෙහි හැඳ, පාත්‍ර සිවුරු ගෙන ගමකට හෝ නියම්ගමකට හෝ පිඬුසිඟා වඩින්නාහ. ඔවුහු එහිදී ධර්මය භාෂණය කරති. ගිහියෝ ඔවුන්ට ප්‍රසන්න වූ ආකාරයෙන් (පූජා) කරති. ඔවුහු ඒ ලාභය තෘෂ්ණාවෙන් ඇලුම් වී, දැඩි ලෝලත්වයෙන් යුක්තව, එයට දැඩි සේ බැසගෙන, එහි ආදීනව නොදකිමින්, නිස්සරණ ප්‍රඥාවෙන් තොරව පරිභෝග කරති. එය ඔවුන්ගේ පැහැයට ද නොවෙයි, ශක්තියට ද නොවෙයි. ඔවුහු ඒ නිසා මරණයට හෝ මරණය තරම් වූ දුකකට හෝ පත්වෙති.\n\n“එබැවින් මහණෙනි, මෙසේ හික්මිය යුතුය: ‘අපි තෘෂ්ණාවෙන් ඇලුම් නොවී, දැඩි ලෝලත්වයක් නැතිව, දැඩි සේ බැස නොගෙන, එහි ආදීනව දකිමින්, නිස්සරණ ප්‍රඥාවෙන් යුක්තව ඒ ලාභය පරිභෝග කරන්නෙමු’ යි. මහණෙනි, නුඹලා මෙසේ හික්මිය යුතුමය.”",
      "paliTitle": "Nāgasuttaṃ",
      "vagga": "",
      "englishTitle": "The Elephant Sutta",
      "sinhalaTitle": "නාග සූත්‍රය"
    },
    {
      "number": 232,
      "pali": "Sāvatthiyaṃ viharati. Tena kho pana samayena aññataro bhikkhu ativelaṃ kulesu cārittaṃ āpajjati. Tamenaṃ bhikkhū evamāhaṃsu – ‘‘māyasmā ativelaṃ kulesu cārittaṃ āpajjī’’ti. So bhikkhu bhikkhūhi vuccamāno na viramati. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, aññataro bhikkhu ativelaṃ kulesu cārittaṃ āpajjati. Tamenaṃ bhikkhū evamāhaṃsu – ‘māyasmā ativelaṃ kulesu cārittaṃ āpajjī’ti. So bhikkhu bhikkhūhi vuccamāno na viramatī’’ti. ‘‘Bhūtapubbaṃ, bhikkhave, biḷāro sandhisamalasaṅkaṭīre ṭhito ahosi mudumūsiṃ maggayamāno – ‘yadāyaṃ mudumūsi gocarāya pakkamissati, tattheva naṃ gahetvā khādissāmī’ti. Atha kho so, bhikkhave, mudumūsi gocarāya pakkāmi. Tamenaṃ biḷāro gahetvā sahasā saṅkhāditvā [saṅkharitvā (pī. ka.), maṃsaṃ khāditvā (syā. kaṃ.), asaṃkhāditvā (katthaci)] ajjhohari. Tassa so mudumūsi antampi khādi, antaguṇampi khādi. So tatonidānaṃ maraṇampi nigacchi maraṇamattampi dukkhaṃ. ‘‘Evameva kho, bhikkhave, idhekacco bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena, anupaṭṭhitāya satiyā, asaṃvutehi indriyehi. So tattha passati mātugāmaṃ dunnivatthaṃ vā duppārutaṃ vā. Tassa mātugāmaṃ disvā dunnivatthaṃ vā duppārutaṃ vā rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsena cittena maraṇaṃ vā nigacchati maraṇamattaṃ vā dukkhaṃ. Maraṇañhetaṃ, bhikkhave, ariyassa vinaye yo sikkhaṃ paccakkhāya hīnāyāvattati. Maraṇamattañhetaṃ, bhikkhave, dukkhaṃ yadidaṃ aññataraṃ saṃkiliṭṭhaṃ āpattiṃ āpajjati. Yathārūpāya āpattiyā vuṭṭhānaṃ paññāyati. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘rakkhiteneva kāyena rakkhitāya vācāya rakkhitena cittena, upaṭṭhitāya satiyā, saṃvutehi indriyehi gāmaṃ vā nigamaṃ vā piṇḍāya pavisissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dasamaṃ.",
      "english": "The Blessed One was staying at Sāvatthī. Now, at that time, a certain monastic was engaging in excessive socializing among lay families. The monastics told him, \"Venerable sir, do not engage in excessive socializing among lay families.\" Though told by the monastics, that monastic did not desist. Then, a great number of monastics approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side. Sitting to one side, those monastics addressed the Blessed One, \"Here, venerable sir, a certain monastic is engaging in excessive socializing among lay families. The monastics told him, 'Venerable sir, do not engage in excessive socializing among lay families.' Though told by the monastics, that monastic does not desist.\"\n\n\"Monastics, formerly, a cat stood near a heap of filth by a wall, waiting for a tender mouse, thinking: 'When this tender mouse goes out to forage, I will seize it right there and devour it.' Then, monastics, that tender mouse went out to forage. The cat immediately seized it, quickly devoured it, and swallowed it. That tender mouse ate the cat's intestines and also ate the membranes surrounding the intestines. Due to that cause, the cat met either death or suffering akin to death. Just so, monastics, some monastic here, having dressed himself in the upper and lower robe in the forenoon, and taking his bowl and outer robe, enters a village or town for alms, having an unguarded body, unguarded speech, unguarded mind, unestablished mindfulness, and unrestrained faculties. There, he sees a woman who is badly covered or badly clad. Seeing that woman who is badly covered or badly clad, lust corrupts his mind. With a mind corrupted by lust, he meets either death or suffering akin to death. For, monastics, death in the Discipline of the Noble Ones is defined as one who, having renounced the training, turns back to the lower life. And suffering akin to death, monastics, is defined as one who commits a certain defiling offense, from which offense rehabilitation is known. Therefore, monastics, you must train yourselves thus: 'We shall enter the village or town for alms having a guarded body, guarded speech, guarded mind, established mindfulness, and restrained faculties.' In this way, monastics, must you train yourselves.\"",
      "sinhala": "සැවැත්නුවර වැඩසිටින සේක. එසමයෙහි එක්තරා භික්ෂුවක් අකල් වේලාවෙහි කුල ගෙවල්වල හැසිරීමට ගියේ ය. ඒ භික්ෂුවට අන්‍ය භික්ෂූහු මෙසේ කීහ: \"ආයුෂ්මත්වරයාණෙනි, අකල් වේලාවෙහි කුල ගෙවල්වල හැසිරීමට නොයන්නැ\"යි. භික්ෂූන් විසින් මෙසේ කියනු ලැබූ ඒ භික්ෂුව එයින් නොනවතියි.\nඉක්බිති බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළැඹියහ. එළැඹ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි වූහ. එකත්පස්ව හුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: \"වහන්ස, මෙහි එක්තරා භික්ෂුවක් අකල් වේලාවෙහි කුල ගෙවල්වල හැසිරීමට යයි. ඒ භික්ෂුවට අන්‍ය භික්ෂූහු 'ආයුෂ්මත්වරයාණෙනි, අකල් වේලාවෙහි කුල ගෙවල්වල හැසිරීමට නොයන්නැ'යි කීහ. භික්ෂූන් විසින් මෙසේ කියනු ලැබූ ඒ භික්ෂුව එයින් නොනවතියි.\"\n\n\"මහණෙනි, පෙර වූ දෙයකි. බළලෙක් කුණු කසළ ගොඩක් අසල සිටියේ, මෘදු මූසිකයකු සොයමිනි. 'මේ මෘදු මූසිකයා යම් කලෙක ආහාර සොයා පිටත් වන්නේ ද, එවිට ම ඌ අල්ලාගෙන කන්නෙමි' යි සිතී ය. ඉක්බිති මහණෙනි, ඒ මෘදු මූසිකයා ආහාර සොයා පිටත් විය. ඒ මූසිකයා බළලා විසින් අල්ලාගෙන, ක්ෂණිකව ම හපකර ගිල දැමුවේ ය. ඒ මූසිකයා (බළලාගේ) අන්ත්‍රයන් ද, අන්ත්‍රවල ගැට ද කෑවේ ය. ඌ ඒ හේතුවෙන් මරණයට ද පත් විය, නැතහොත් මරණය තරම් වූ දුකකට ද පත් විය. මහණෙනි, එපරිද්දෙන් ම ය. මෙහි ඇතැම් භික්ෂුවක් පෙරවරු සමයෙහි සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන, ආරක්ෂා නොකළ කයින් ද, ආරක්ෂා නොකළ වචනයෙන් ද, ආරක්ෂා නොකළ සිතින් ද, සිහිය පිහිටුවා නොගෙන ද, සංවර නොකළ ඉන්ද්‍රියයන්ගෙන් ද යුක්ත ව ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතය පිණිස පිවිසෙයි. ඌ එහිදී අශෝභන ලෙස ඇඳ පැළඳ සිටින හෝ, අශෝභන ලෙස පෙරවා සිටින ස්ත්‍රියක් දකියි. ඒ ස්ත්‍රිය අශෝභන ලෙස ඇඳ පැළඳ සිටිනු හෝ, අශෝභන ලෙස පෙරවා සිටිනු දැකීමෙන් රාගය විසින් සිත පීඩාවට පත් කරනු ලබයි. ඌ රාගය විසින් පීඩාවට පත් කරන ලද සිතින් යුක්ත ව මරණයට හෝ පත් වේ, නැතහොත් මරණය තරම් වූ දුකකට හෝ පත් වේ. මහණෙනි, ආර්ය විනයෙහි යමෙක් ශික්ෂාව ප්‍රතික්ෂේප කොට හීන තත්ත්වයට හැරී යන්නේ ද, එය මරණය වේ. මහණෙනි, යම්කිසි කෙලෙස් සහිත ආපත්තියකට පත් වීමක් තිබේ ද, යම් ආකාරයක ආපත්තියකින් නැවත නැඟී සිටීම (මිදීම) ප්‍රඥප්ත වී ඇත්තේ ද, එබඳු ආපත්තියකට පත්වීම මරණය තරම් වූ දුක වේ. එහෙයින් මහණෙනි, 'අපි ආරක්ෂා කරන ලද කයින් ද, ආරක්ෂා කරන ලද වචනයෙන් ද, ආරක්ෂා කරන ලද සිතින් ද, පිහිටුවන ලද සිහියෙන් ද, සංවර කරන ලද ඉන්ද්‍රියයන්ගෙන් ද යුක්ත ව ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතය පිණිස පිවිසෙමු' යි මෙසේ හික්මිය යුතු ය. මහණෙනි, නුඹලා විසින් මෙසේ ම හික්මිය යුතු ය.\"",
      "paliTitle": "Biḷārasuttaṃ",
      "vagga": "",
      "englishTitle": "The Cat Sutta",
      "sinhalaTitle": "බිළාර සූත්‍රය"
    },
    {
      "number": 233,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘assuttha no tumhe, bhikkhave, rattiyā paccūsasamayaṃ jarasiṅgālassa vassamānassā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, jarasiṅgālo ukkaṇḍakena nāma rogajātena phuṭṭho. So yena yena icchati tena tena gacchati; yattha yattha icchati tattha tattha tiṭṭhati; yattha yattha icchati tattha tattha nisīdati; yattha yattha icchati tattha tattha nipajjati; sītakopi naṃ vāto upavāyati. Sādhu khvassa, bhikkhave, yaṃ idhekacco sakyaputtiyapaṭiñño evarūpampi attabhāvapaṭilābhaṃ paṭisaṃvediyetha. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Ekādasamaṃ.",
      "english": "[He] was residing in Sāvatthī... “Did you, monks, hear the old jackal howling in the deep dark before dawn?”\n\n“Yes, Venerable Sir,” they replied.\n\n“That old jackal, monks, is afflicted by a type of skin disease called *ukkaṇḍaka*. He goes wherever he wishes; he stands wherever he wishes; he sits wherever he wishes; he lies down wherever he wishes. A cold wind blows upon him. It would indeed be well, monks, if a certain individual here who professes to be a son of the Sakyan were to experience the acquisition of even such a form of existence (with its freedom of movement). Therefore, monks, you must train yourselves thus: ‘We will dwell heedfully.’ This is indeed how, monks, you must train yourselves.”",
      "sinhala": "ශ්‍රා‍වස්තියෙහි වැඩ‍සිටින සේක. \"මහණෙනි, අද රාත්‍රියෙහි අලුයම් කාලයෙහි මහලු සිව‍ලකුගේ හඬ‍නු ඔබ අසා සිටියාද?\"\n\n\"එසේය, භාග්‍යවතුන් වහන්ස.\"\n\n\"මහණෙනි, මේ මහලු සිවලා නම් වූ සත්ත්වයා ‘උක්කණ්ඩක’ නම් වූ රෝග‍ විශේෂයකින් පෙළෙයි. ඔහු යම් යම් අතකට කැමති ද, ඒ ඒ අතට යයි; යම් යම් තැනක කැමති ද, ඒ ඒ තැන සිටී; යම් යම් තැනක කැමති ද, ඒ ඒ තැන හිඳී; යම් යම් තැනක කැමති ද, ඒ ඒ තැන සැතපෙයි; සිහිල් වූ වාතය පවා ඔහුට හමයි. මහණෙනි, යමෙක් මෙහි ශාක්‍යපුත්‍ර ශ්‍රවණ භාවය පිළිගත් කෙනෙක් වන්නේ ද, ඔහු මෙබඳු වූ ආත්මභාව ලැබීමක් (මනුෂ්‍ය ජීවිතය) අත්දකින්නේ නම්, එය ඉතා යහපත්‍ ක්‍රියාවකි. එම නිසා මහණෙනි, ‘අපි අප්‍රමාදීව වාසය කරන්නෙමු’ යි මෙසේ පුහුණු විය යුතු‍ වේ. මහණෙනි, නුඹලා මෙසේ ම පුහුණු විය යුතු‍ වේ.\"",
      "paliTitle": "Siṅgālasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Jackal",
      "sinhalaTitle": "සිඟාල සූත්‍රය"
    },
    {
      "number": 234,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘assuttha no tumhe, bhikkhave, rattiyā paccūsasamayaṃ jarasiṅgālassa vassamānassā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Siyā kho, bhikkhave, tasmiṃ jarasiṅgāle yā kāci kataññutā kataveditā, na tveva idhekacce sakyaputtiyapaṭiññe siyā yā kāci kataññutā kataveditā. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kataññuno bhavissāma katavedino; na ca no [na ca noti idaṃ sī. pī. potthakesu natthi] amhesu appakampi kataṃ nassissatī’ti [mā nassissatīti (sī. pī.), vinassissatīti (syā. kaṃ.)]. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dvādasamaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī...\n\n“Monks, did you hear that aged jackal howling near dawn, at the close of the night?”\n\n“Yes, Venerable Sir.”\n\n“Monks, in that aged jackal there might be some degree of gratitude and acknowledgment of favors done, but in some individuals here who profess to be followers of the Sakyan, there is certainly no degree of gratitude or acknowledgment of favors done. Therefore, monks, this is how you must train yourselves: ‘We shall be grateful and mindful of favors done; and no deed, however small, done for us shall be forgotten.’ This is indeed how you must train yourselves, monks.”",
      "sinhala": "ශ්‍රාවස්තියෙහි වැඩවෙසෙන භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: “මහණෙනි, රාත්‍රියේ අලුයම් කාලයෙහි මහලු නරියෙකු හඬ නඟන ශබ්දය ඔබ ඇසුවේ නැද්ද?” “එසේය, ස්වාමීනී,” භික්ෂූහු පිළිතුරු දුන්හ. “මහණෙනි, යම්කිසි කෘතඥතා_ක්‍රියා_ශීලීත්වයක් හා කළ_උපකාර_දැනගැනීමක් (කටඤ්ඤුතා කතවේදිතා) එම මහලු නරියා තුළ ඇතිවිය හැකියි; එහෙත් ශාක්‍ය_පුත්‍රයන් යැයි ප්‍රතිඥා කරන ඇතැම් අය තුළ නම් යම්කිසි කෘතඥතා_ක්‍රියා_ශීලීත්වයක් හෝ කළ_උපකාර_දැනගැනීමක් නොමැති විය හැකියි. එහෙයින් මහණෙනි, ඔබ මෙසේ හික්මිය යුතුය— ‘අපි උපකාරය දැන ගන්නෝ ද උපකාරය ක්‍රියාවට නඟන්නෝ ද වන්නෙමු; අපට කරන ලද ස්වල්ප වූ හෝ උපකාරයක් අප කෙරෙන් කිසිසේත්ම විනාශ නොවන්නේය’ යනුවෙනි. මහණෙනි, ඔබ මෙසේම හික්මිය යුතුය.",
      "paliTitle": "Dutiyasiṅgālasuttaṃ",
      "vagga": "",
      "englishTitle": "Second Sutta on the Jackal",
      "sinhalaTitle": "දුතිය සිංගාල සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Opammasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Kūṭaṃ nakhasikhaṃ kulaṃ, okkhā satti dhanuggaho; Āṇi kaliṅgaro nāgo, biḷāro dve siṅgālakāti.",
    "english": "The Linked Discourses on Similes is complete. The summary of it: The Peak, Fingernail, Family, Serving Dish, Spear, Archer; Peg, Log, Elephant, Cat, and two on the Jackal.",
    "sinhala": "ඕපම්ම සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: කූට, නඛසිඛ, කුල, ඔක්ඛා, සත්ති, ධනුග්ගහ, ආණි, කලිංගර, නාග, බිළාර සහ සිංගාලක සූත්‍ර දෙකකි."
  }
}