{
  "id": "sn.2.4",
  "title": {
    "pali": "Anamataggasaṃyuttaṃ",
    "english": "The Connected Discourses on the Inconceivable Beginning",
    "sinhala": "අනමතග්ග සංයුත්තය"
  },
  "sections": [
    {
      "number": 124,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Anamataggoyaṃ [anamataggāyaṃ (pī. ka.)] bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Seyyathāpi, bhikkhave, puriso yaṃ imasmiṃ jambudīpe tiṇakaṭṭhasākhāpalāsaṃ taṃ chetvā [tacchetvā (bahūsu)] ekajjhaṃ saṃharitvā caturaṅgulaṃ caturaṅgulaṃ ghaṭikaṃ katvā nikkhipeyya – ‘ayaṃ me mātā, tassā me mātu ayaṃ mātā’ti, apariyādinnāva [apariyādiṇṇāva (sī.)] bhikkhave, tassa purisassa mātumātaro assu, atha imasmiṃ jambudīpe tiṇakaṭṭhasākhāpalāsaṃ parikkhayaṃ pariyādānaṃ gaccheyya. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Evaṃ dīgharattaṃ vo, bhikkhave, dukkhaṃ paccanubhūtaṃ tibbaṃ paccanubhūtaṃ byasanaṃ paccanubhūtaṃ, kaṭasī [kaṭasi (sī. pī. ka.) kaṭā chavā sayanti etthāti kaṭasī] vaḍḍhitā. Yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ alaṃ virajjituṃ alaṃ vimuccitu’’nti. Paṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. There, the Blessed One addressed the monks, saying: \"Monks!\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One spoke thus: \"Monks, this Saṃsāra is without conceivable beginning or end. A prior end is not discerned for beings hindered by ignorance, bound by craving, who are running on and revolving in the cycle of existence. Just as, monks, if a person were to cut down whatever grass, wood, branches, and foliage there is in this Rose-apple Continent, gather it into one pile, make it into pieces four finger-breadths long, and lay them aside, saying, ‘This is my mother, and this is the mother of that mother of mine’ – monks, the mothers and grandmothers of that person would still not be exhausted, even though the grass, wood, branches, and foliage in this Rose-apple Continent would come to an end, would be exhausted. And for what reason? Monks, this Saṃsāra is without conceivable beginning or end. A prior end is not discerned for beings hindered by ignorance, bound by craving, who are running on and revolving in the cycle of existence. For such a long time, monks, you have experienced suffering, you have experienced intense suffering, you have experienced misfortune, and a charnel ground has accumulated. For so long a time, monks, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\" The First.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයේ වැඩවසන සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ \"මහණෙනි\" කියා භික්ෂූන් වහන්සේලා ඇමතූ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, මේ සංසාරය මුලක් අගක් නොදතහැක්කකි. අවිද්‍යාව නීවරණ කොට ඇති, තණ්හාව සංයෝජන කොට ඇති, (සංසාරයෙහි) දිව යන්නා වූ, සැරිසරන්නා වූ සත්ත්වයන්ට පෙර කෙළවරක් නොපෙනේ.\n\nමහණෙනි, යම් සේ නම්, පුරුෂයෙක් මේ ජම්බුද්වීපයෙහි ඇති යම් තණ, දඬු, අතු, කොළ වේ ද, ඒවා සිඳ, එක් තැනකට එකතු කොට, සතර අඟල් සතර අඟල් කොටු කැබලි කොට ‘මේ මගේ මව, මේ මවගේ මව’ යි කියමින් තබන්නේ ය. මහණෙනි, ඒ පුරුෂයාගේ මව්වරුන්ගේ මව්වරු නොඉවර වනු ඇත, එහෙත් මේ ජම්බුද්වීපයෙහි ඇති තණ, දඬු, අතු, කොළ ගෙවී, අවසන් ව යනු ඇත.\n\nඑයට හේතුව කුමක් ද? මහණෙනි, මේ සංසාරය මුලක් අගක් නොදතහැක්කකි. අවිද්‍යාව නීවරණ කොට ඇති, තණ්හාව සංයෝජන කොට ඇති, (සංසාරයෙහි) දිව යන්නා වූ, සැරිසරන්නා වූ සත්ත්වයන්ට පෙර කෙළවරක් නොපෙනේ.\n\nමහණෙනි, මෙසේ දීර්ඝ කාලයක් මුළුල්ලේ ඔබට දුක අත්විඳින ලදී; දරුණු දුක අත්විඳින ලදී; විපත අත්විඳින ලදී. (ඔබේ) මල සිරුරු කඳු සේ වැඩි විය. මහණෙනි, මේ හේතු කොටගෙන, සියලු සංස්කාරයන් කෙරෙහි කලකිරීමට ද, නොඇලීමට ද, (සංසාර දුකින්) මිදීමට ද ප්‍රමාණවත් ය.\"",
      "paliTitle": "Tiṇakaṭṭhasuttaṃ",
      "vagga": "Paṭhamavaggo",
      "englishTitle": "Discourse on Grass and Wood",
      "sinhalaTitle": "තිණකට්ඨ සූත්‍රය",
      "vaggaEnglish": "First Chapter",
      "vaggaSinhala": "පළමු වර්ගය"
    },
    {
      "number": 125,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Seyyathāpi, bhikkhave, puriso imaṃ mahāpathaviṃ kolaṭṭhimattaṃ kolaṭṭhimattaṃ mattikāguḷikaṃ karitvā nikkhipeyya – ‘ayaṃ me pitā, tassa me pitu ayaṃ pitā’ti, apariyādinnāva bhikkhave, tassa purisassa pitupitaro assu, athāyaṃ mahāpathavī parikkhayaṃ pariyādānaṃ gaccheyya. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Evaṃ dīgharattaṃ vo, bhikkhave, dukkhaṃ paccanubhūtaṃ tibbaṃ paccanubhūtaṃ byasanaṃ paccanubhūtaṃ, kaṭasī vaḍḍhitā. Yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccitu’’nti. Dutiyaṃ.",
      "english": "Monks, this cycle of existence is without a discernible beginning. A prior end is not discernible for beings hindered by ignorance and bound by craving, who are wandering on and continuing in the cycle of existence. Just as, monks, if a man were to make clay pellets, each the size of a jujube seed, from this great earth and lay them aside, saying, ‘This is my father, and this is the father of my father’ – Monks, that man’s fathers and grandfathers would still not be exhausted, yet this great earth would come to an end, would be completely consumed. For what reason? Monks, this cycle of existence is without a discernible beginning. A prior end is not discernible for beings hindered by ignorance and bound by craving, who are wandering on and continuing in the cycle of existence. For such a long time, monks, you have experienced suffering, experienced intense pain, experienced misfortune, and charnel grounds have been piled high. To such an extent, monks, it is enough to become utterly disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.",
      "sinhala": "මහණෙනි, මේ සංසාරය අගක් මුලක් නොපෙනෙන්නකි. අවිද්‍යා නීවරණයෙන් වැසීගත්තාවූ, තෘෂ්ණා සංයෝජනයන්ගෙන් බැඳීගත්තාවූ සත්වයන්ගේ සැරිසැරීමේ පෙර කෙළවර නොපෙනේ. මහණෙනි, යම් සේ පුරුෂයෙක් මේ මහපොළොව කොළැටියක් පමණ, කොළැටියක් පමණ මැටිකැට සෑදීමෙන් අවසන් කර දමා, ‘මේ මාගේ පියාය, මේ මාගේ පියාගේ පියාය’ යි ඒ මැටිකැට එකින් එක තබන්නේ නම්, මහණෙනි, ඒ පුරුෂයාගේ පියාගේ පියවරු අවසන් නොවන්නේය. එහෙත් මේ මහපොළොව අවසන් වී යන්නේය. ඒ කුමන හේතුවක් නිසාද? මහණෙනි, මේ සංසාරය අගක් මුලක් නොපෙනෙන්නකි. අවිද්‍යා නීවරණයෙන් වැසීගත්තාවූ, තෘෂ්ණා සංයෝජනයන්ගෙන් බැඳීගත්තාවූ සත්වයන්ගේ සැරිසැරීමේ පෙර කෙළවර නොපෙනේ. මහණෙනි, මෙසේ බොහෝ කල් තිස්සේ ඔබට දුක් විඳින්නට ලැබුණි, තදබල දුක් විඳින්නට ලැබුණි, විපත්ති විඳින්නට ලැබුණි, සොහොන් බිම් ඉහළ ගියේය. මහණෙනි, එහෙයින් මේ සියලු සංස්කාරයන් කෙරෙහි කලකිරීමටත්, නොඇලීමටත්, (ඉන්) මිදීමටත් මෙය ප්‍රමාණවත් වේ.",
      "paliTitle": "Pathavīsuttaṃ",
      "englishTitle": "The Discourse on the Earth",
      "sinhalaTitle": "පඨවී සූත්‍රය"
    },
    {
      "number": 126,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ amanāpasampayogā manāpavippayogā kandantānaṃ rodantānaṃ [rudantānaṃ (sī.)] assu passannaṃ [passandaṃ (ka. sī.), pasandaṃ (syā. kaṃ.), pasannaṃ (pī. ka.)] paggharitaṃ, yaṃ vā catūsu mahāsamuddesu udaka’’nti? ‘‘Yathā kho mayaṃ, bhante, bhagavatā dhammaṃ desitaṃ ājānāma, etadeva, bhante, bahutaraṃ yaṃ no iminā dīghena addhunā sandhāvataṃ saṃsarataṃ amanāpasampayogā manāpavippayogā kandantānaṃ rodantānaṃ assu passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udaka’’nti. ‘‘Sādhu sādhu, bhikkhave, sādhu kho me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha. Etadeva, bhikkhave, bahutaraṃ yaṃ vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ amanāpasampayogā manāpavippayogā kandantānaṃ rodantānaṃ assu passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udakaṃ. Dīgharattaṃ vo, bhikkhave, mātumaraṇaṃ paccanubhūtaṃ; tesaṃ vā mātumaraṇaṃ paccanubhontānaṃ amanāpasampayogā manāpavippayogā kandantānaṃ rodantānaṃ assu passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udakaṃ. Dīgharattaṃ vo, bhikkhave, pitumaraṇaṃ paccanubhūtaṃ …pe… bhātumaraṇaṃ paccanubhūtaṃ… bhaginimaraṇaṃ paccanubhūtaṃ… puttamaraṇaṃ paccanubhūtaṃ… dhītumaraṇaṃ paccanubhūtaṃ… ñātibyasanaṃ paccanubhūtaṃ… bhogabyasanaṃ paccanubhūtaṃ. Dīgharattaṃ vo, bhikkhave, rogabyasanaṃ paccanubhūtaṃ, tesaṃ vo rogabyasanaṃ paccanubhontānaṃ amanāpasampayogā manāpavippayogā kandantānaṃ rodantānaṃ assu passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udakaṃ. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro …pe… yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccitu’’nti. Tatiyaṃ.",
      "english": "The Blessed One was dwelling in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika’s monastery.\n\n\"Monks, this cycle of existence is without a discoverable beginning. An earlier end is not discernible for beings hindered by ignorance and bound by craving, who are wandering and transmigrating. What do you think, monks? Which is more: the tears you have shed, flowing forth as you have wandered and transmigrated through this long journey, weeping and crying due to association with what is displeasing and separation from what is pleasing; or the water in the four great oceans?\"\n\n\"As we understand the Dhamma taught by the Blessed One, Venerable Sir, it is indeed the former that is more: the tears we have shed, flowing forth as we have wandered and transmigrated through this long journey, weeping and crying due to association with what is displeasing and separation from what is pleasing; not the water in the four great oceans.\"\n\n\"Good, good, monks! It is good that you understand the Dhamma taught by me in this way. Indeed, monks, it is the former that is more: the tears you have shed, flowing forth as you have wandered and transmigrated through this long journey, weeping and crying due to association with what is displeasing and separation from what is pleasing; not the water in the four great oceans. For a long time, monks, you have experienced the death of a mother; and as you experienced the death of a mother, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the death of a father; and as you experienced the death of a father, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the death of a brother; and as you experienced the death of a brother, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the death of a sister; and as you experienced the death of a sister, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the death of a son; and as you experienced the death of a son, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the death of a daughter; and as you experienced the death of a daughter, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the loss of relatives; and as you experienced the loss of relatives, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the loss of wealth; and as you experienced the loss of wealth, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. For a long time, monks, you have experienced the misfortune of illness; and as you experienced the misfortune of illness, the tears you shed, flowing forth as you wept and cried due to association with what is displeasing and separation from what is pleasing, are more than the water in the four great oceans. What is the reason for this? Monks, this cycle of existence is without a discoverable beginning. An earlier end is not discernible for beings hindered by ignorance and bound by craving, who are wandering and transmigrating. Therefore, monks, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate towards them, enough to be liberated from them.\"",
      "sinhala": "මහණෙනි, මේ සංසාරය මුලක් අගක් නොපෙනෙන එකකි. අවිද්‍යාවෙන් වැසී, තණ්හා සංයෝජනයෙන් බැඳී, සැරිසරන්නා වූ, සංසාරයේ ගමන් කරන්නා වූ සත්වයන්ට පෙර කෙළවරක් නොපෙනේ. මහණෙනි, මේ ගැන කුමක් සිතන්නෙහිද? මේ දිගු කලක් තිස්සේ සංසාරයේ සැරිසරමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබලා විසින් වැගිරවූ කඳුළු ප්‍රමාණය වැඩිද, එසේ නැතහොත් මහා සාගර සතරෙහි ඇති ජලය වැඩිද?\n\n\"භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය අප විසින් අවබෝධ කරගත් පරිදි, ස්වාමීනි, මේ දිගු කලක් තිස්සේ සංසාරයේ සැරිසරමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් අප විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත.\"\n\n\"සාදු සාදු මහණෙනි. මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය ඔබලා මෙසේ අවබෝධ කර ගැනීම ඉතා හොඳයි.\" මහණෙනි, මේ දිගු කලක් තිස්සේ සංසාරයේ සැරිසරමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබලා විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට මව්වරුන්ගේ මරණය අත්විඳින්නට සිදුවී ඇත. එම මව්වරුන්ගේ මරණය අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට පියවරුන්ගේ මරණය අත්විඳින්නට සිදුවී ඇත. එම පියවරුන්ගේ මරණය අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට සහෝදරයන්ගේ මරණය අත්විඳින්නට සිදුවී ඇත. එම සහෝදරයන්ගේ මරණය අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට සහෝදරියන්ගේ මරණය අත්විඳින්නට සිදුවී ඇත. එම සහෝදරියන්ගේ මරණය අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට පුත්‍රයන්ගේ මරණය අත්විඳින්නට සිදුවී ඇත. එම පුත්‍රයන්ගේ මරණය අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට දූවරුන්ගේ මරණය අත්විඳින්නට සිදුවී ඇත. එම දූවරුන්ගේ මරණය අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට ඥාති විපත්ති අත්විඳින්නට සිදුවී ඇත. එම ඥාති විපත්ති අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට භෝග විපත්ති අත්විඳින්නට සිදුවී ඇත. එම භෝග විපත්ති අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. මහණෙනි, දීර්ඝ කාලයක් මුළුල්ලේ ඔබට රෝග විපත්ති අත්විඳින්නට සිදුවී ඇත. එම රෝග විපත්ති අත්විඳිමින්, අකමැති දේ හා එක්වීමෙන්ද, කැමති දේ වෙන්වීමෙන්ද, හඬා වැලපෙමින් ඔබ විසින් වැගිරවූ කඳුළු ප්‍රමාණයම වැඩිය. මහා සාගර සතරෙහි ඇති ජලය ඊට වඩා වැඩි නැත. එයට හේතුව කුමක්ද? මහණෙනි, මේ සංසාරය මුලක් අගක් නොපෙනෙන බැවිනි. අවිද්‍යාවෙන් වැසී, තණ්හා සංයෝජනයෙන් බැඳී, සැරිසරන්නා වූ, සංසාරයේ ගමන් කරන්නා වූ සත්වයන්ට පෙර කෙළවරක් නොපෙනේ. මහණෙනි, මේ සියලු සංස්කාර ධර්මයන් කෙරෙහි කලකිරීමටත්, නොඇලීමටත්, සිත නිදහස් කර ගැනීමටත් මෙයම ප්‍රමාණවත්ය.",
      "paliTitle": "Assusuttaṃ",
      "englishTitle": "The Tears Sutta",
      "sinhalaTitle": "අස්සු සූත්‍රය"
    },
    {
      "number": 127,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ mātuthaññaṃ pītaṃ, yaṃ vā catūsu mahāsamuddesu udaka’’nti? ‘‘Yathā kho mayaṃ, bhante, bhagavatā dhammaṃ desitaṃ ājānāma, etadeva, bhante, bahutaraṃ yaṃ no iminā dīghena addhunā sandhāvataṃ saṃsarataṃ mātuthaññaṃ pītaṃ, na tveva catūsu mahāsamuddesu udaka’’nti. ‘‘Sādhu sādhu, bhikkhave, sādhu kho me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha. Etadeva, bhikkhave, bahutaraṃ yaṃ vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ mātuthaññaṃ pītaṃ, na tveva catūsu mahāsamuddesu udakaṃ. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro…pe… alaṃ vimuccitu’’nti. Catutthaṃ.",
      "english": "The Blessed One was staying at Sāvatthī. Monks, this cycle of rebirth is without a conceivable beginning or end. Its prior end is not discernible for beings hindered by ignorance and fettered by craving, who are transmigrating and wandering on. What do you think, monks? Which is greater: the mother’s milk you have drunk while transmigrating and wandering on throughout this long journey, or the water in the four great oceans?\n\n“As we understand the Dhamma taught by the Blessed One, venerable sir, this is indeed greater: the mother’s milk we have drunk while transmigrating and wandering on throughout this long journey, not the water in the four great oceans.”\n\n“Good, good, monks! It is good, monks, that you understand the Dhamma taught by me in this way. This, monks, is indeed greater: the mother’s milk you have drunk while transmigrating and wandering on throughout this long journey, not the water in the four great oceans. For what reason? This cycle of rebirth, monks, is without a conceivable beginning or end… it is enough to be liberated.”",
      "sinhala": "මහණෙනි, මේ සංසාරයට ආරම්භයක් නොපෙනේ. අවිද්‍යා නීවරණයන්ගෙන් වැසී, තණ්හා සංයෝජනයන්ගෙන් බැඳී, සැරිසරන්නා වූ සංසාරගත සත්ත්වයන්ට පූර්ව කොටසක් (ආරම්භයක්) නොපෙනේ. මහණෙනි, මේ පිළිබඳව ඔබලා කුමක් සිතන්නෙහිද? මේ දීර්ඝ සංසාර ගමනේදී සැරිසරන්නා වූ ඔබට පානය කරන ලද මවගේ කිරි ප්‍රමාණයද, එසේත් නැතිනම් සතර මහා සාගරයේ ඇති ජලයද, මේ දෙකින් වඩා බොහෝ දේ කුමක්ද?\n\nවහන්ස, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය අප තේරුම් ගන්නා අයුරින් නම්, වහන්ස, මේ දීර්ඝ සංසාර ගමනේදී සැරිසරන්නා වූ අප විසින් පානය කරන ලද මවගේ කිරි ප්‍රමාණයමයි බොහෝ වන්නේ; සතර මහා සාගරයේ ඇති ජලය නම් නොවෙයි.\n\nසාධු, සාධු, මහණෙනි! මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය මෙසේ තේරුම් ගන්නා ඔබට සාධු! මහණෙනි, මේ දීර්ඝ සංසාර ගමනේදී සැරිසරන්නා වූ ඔබ විසින් පානය කරන ලද මවගේ කිරි ප්‍රමාණයමයි බොහෝ වන්නේ; සතර මහා සාගරයේ ඇති ජලය නම් නොවෙයි. ඒ මක්නිසාද? මහණෙනි, මේ සංසාරය ආරම්භයක් නොපෙනෙන එකකි. නිදහස් වීමට මෙය සෑහේ.",
      "paliTitle": "Khīrasuttaṃ",
      "englishTitle": "Milk Sutta",
      "sinhalaTitle": "ඛීර සූත්‍රය"
    },
    {
      "number": 128,
      "pali": "Sāvatthiyaṃ viharati…pe… ārāme. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘kīvadīgho nu kho, bhante, kappo’’ti? ‘‘Dīgho kho, bhikkhu, kappo. So na sukaro saṅkhātuṃ ettakāni vassāni iti vā, ettakāni vassasatāni iti vā, ettakāni vassasahassāni iti vā, ettakāni vassasatasahassāni iti vā’’ti. ‘‘Sakkā pana, bhante, upamaṃ kātu’’nti? ‘‘Sakkā, bhikkhū’’ti bhagavā avoca. ‘‘Seyyathāpi, bhikkhu, mahāselo pabbato yojanaṃ āyāmena yojanaṃ vitthārena yojanaṃ ubbedhena acchinno asusiro ekagghano. Tamenaṃ puriso vassasatassa vassasatassa accayena kāsikena vatthena sakiṃ sakiṃ parimajjeyya. Khippataraṃ kho so, bhikkhu, mahāselo pabbato iminā upakkamena parikkhayaṃ pariyādānaṃ gaccheyya, na tveva kappo. Evaṃ dīgho, bhikkhu, kappo. Evaṃ dīghānaṃ kho, bhikkhu, kappānaṃ neko kappo saṃsito, nekaṃ kappasataṃ saṃsitaṃ, nekaṃ kappasahassaṃ saṃsitaṃ, nekaṃ kappasatasahassaṃ saṃsitaṃ. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhu, saṃsāro. Pubbā koṭi…pe… yāvañcidaṃ, bhikkhu, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccitu’’nti. Pañcamaṃ.",
      "english": "The Blessed One was residing at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s monastery.\n\nThen a certain monk approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, that monk said to the Blessed One: \"Venerable sir, how long indeed is an eon?\"\n\n\"Long, monk, is an eon. It is not easy to count it as so many years, or so many hundreds of years, or so many thousands of years, or so many hundreds of thousands of years.\" \"But venerable sir, is it possible to give an analogy?\" \"It is possible, monk,\" the Blessed One said.\n\n\"Suppose, monk, there was a great rock mountain, a yojana in length, a yojana in width, and a yojana in height, without fissures, without holes, a single solid mass. And a man, at the end of every hundred years, would wipe it once with a Kāsi cloth. Sooner indeed, monk, would that great rock mountain come to an end, to utter destruction, by this endeavor, but not the eon.\"\n\n\"So long, monk, is an eon. Of such long eons, monk, not just one eon has been traversed, not just a hundred eons, not just a thousand eons, not just a hundred thousand eons have been traversed.\"\n\n\"And why is that? This saṃsāra, monk, has no discernible beginning. Its origin is not to be discerned. There is no first point of beings roaming and transmigrating, cloaked in ignorance, fettered by craving. For so long a time, monk, it is indeed enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\"",
      "sinhala": "සැවැත් නුවර වැඩවසන සමයෙහි... එවිට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: ‘‘ස්වාමීනි, කල්පය කොපමණ දීර්ඝද?’’ ‘‘මහණ, කල්පය ඉතා දීර්ඝය. ඒ කල්පය මෙපමණ වර්ෂ යයි කියා හෝ, මෙපමණ වර්ෂ සියයක් යයි කියා හෝ, මෙපමණ වර්ෂ දහසක් යයි කියා හෝ, මෙපමණ වර්ෂ ලක්ෂයක් යයි කියා හෝ ගණන් කිරීමට පහසු නැත.’’ ‘‘නමුත් ස්වාමීනි, එයට උපමාවක් දිය හැකිද?’’ ‘‘මහණ, දිය හැකියි’’යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. ‘‘මහණ, යම් සේ නම් යොදුනක් දිගින්ද, යොදුනක් පළලින්ද, යොදුනක් උසින්ද, නොබිඳුණු, සිදුරු නැති, එකම ඝන වූ විශාල ගල් පර්වතයක් වේද, එය යම්කිසි පුරුෂයෙක් සෑම වර්ෂ සියයක් පාසා කාසි වස්ත්‍රයකින් එක් වරක් බැගින් පිරිමදින්නේ නම්, මහණ, ඒ විශාල ගල් පර්වතය මේ ක්‍රමයෙන් ඉතා ඉක්මනින් විනාශයටත් ක්ෂය වීමටත් පැමිණෙන්නේය. එහෙත් කල්පය එසේ ක්ෂය නොවන්නේය. මහණ, කල්පය එතරම් දීර්ඝය. මහණ, මෙතරම් දීර්ඝ වූ කල්පයන්ගේ එක කල්පයක් නොව බොහෝ කල්ප සංසාරගත වී ඇත. බොහෝ කල්ප සියයක් සංසාරගත වී ඇත. බොහෝ කල්ප දහසක් සංසාරගත වී ඇත. බොහෝ කල්ප ලක්ෂයක් සංසාරගත වී ඇත. ඒ කුමන කරුණක් නිසාද? මහණ, මේ සංසාරය කෙළවරක් නොපෙනෙන්නේය. පෙර කෙළවරක් නොපෙනේ... ඒ නිසා මහණ, මේ සියලු සංස්කාරයන් කෙරෙහි කලකිරීමටත්, නොඇලීමටත්, මිදීමටත් සැබවින්ම සුදුසුය.’’",
      "paliTitle": "Pabbatasuttaṃ",
      "englishTitle": "The Discourse on the Mountain",
      "sinhalaTitle": "පබ්බත සූත්‍රය"
    },
    {
      "number": 129,
      "pali": "Sāvatthiyaṃ viharati. Atha kho aññataro bhikkhu yena bhagavā…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘kīvadīgho, nu kho, bhante, kappo’’ti? ‘‘Dīgho kho, bhikkhu, kappo. So na sukaro saṅkhātuṃ ettakāni vassāni iti vā…pe… ettakāni vassasatasahassāni iti vā’’ti. ‘‘Sakkā pana, bhante, upamaṃ kātu’’nti? ‘‘Sakkā, bhikkhū’’ti bhagavā avoca. ‘‘Seyyathāpi, bhikkhu, āyasaṃ nagaraṃ yojanaṃ āyāmena yojanaṃ vitthārena yojanaṃ ubbedhena, puṇṇaṃ sāsapānaṃ guḷikābaddhaṃ [cūḷikābaddhaṃ (sī. pī.)]. Tato puriso vassasatassa vassasatassa accayena ekamekaṃ sāsapaṃ uddhareyya. Khippataraṃ kho so, bhikkhu mahāsāsaparāsi iminā upakkamena parikkhayaṃ pariyādānaṃ gaccheyya, na tveva kappo. Evaṃ dīgho kho, bhikkhu, kappo. Evaṃ dīghānaṃ kho, bhikkhu, kappānaṃ neko kappo saṃsito, nekaṃ kappasataṃ saṃsitaṃ, nekaṃ kappasahassaṃ saṃsitaṃ, nekaṃ kappasatasahassaṃ saṃsitaṃ. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhu, saṃsāro …pe… alaṃ vimuccitu’’nti. Chaṭṭhaṃ.",
      "english": "The Blessed One was staying in Sāvatthī. Then, a certain monk approached the Blessed One, paid homage, and sat down to one side. Having sat down, that monk said to the Blessed One, \"Venerable sir, how long indeed is an aeon?\"\n\n\"Long indeed, monk, is an aeon. It is not easy to count it as so many years, or as so many hundreds of thousands of years.\"\n\n\"But is it possible, venerable sir, to give a comparison?\"\n\n\"It is possible, monk,\" the Blessed One said. \"Just as, monk, there might be an iron city, a *yojana* in length, a *yojana* in width, and a *yojana* in height, completely filled with mustard seeds packed tightly together. Then, a man would take out one single mustard seed after every hundred years. More quickly indeed, monk, that great heap of mustard seeds would come to an end, would be exhausted by this method, but not the aeon. Such indeed, monk, is the length of an aeon.\n\nOf such long aeons, monk, not just one aeon has been traversed, not just a hundred aeons have been traversed, not just a thousand aeons have been traversed, not just a hundred thousand aeons have been traversed. For what reason? This cycle of existence, monk, is without a discoverable beginning. A fore-end is not known of beings hindered by ignorance and fettered by craving, who wander and transmigrate through this long course. So long have you experienced suffering, anguish, misfortune, and have swelled the cemeteries. This is enough to become dispassionate, enough to become unentangled, enough to be liberated.\"",
      "sinhala": "සැවැත්නුවර වැඩසිටින සේක. එසමයෙහි එක්තරා භික්‍ෂුවක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව වාඩි වී, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, කල්පයක් කොපමණ දීර්ඝද?\" \"භික්‍ෂුව, කල්පය දීර්ඝය. එය මෙපමණ වසර යයි හෝ, මෙපමණ වසර සිය ගණන යයි හෝ, මෙපමණ වසර දහස් ගණන යයි හෝ, මෙපමණ වසර ලක්‍ෂ ගණන යයි හෝ ගණන් කිරීම පහසු නොවේ.\" \"නමුත් ස්වාමීනි, උපමාවක් දැක්විය හැකිද?\" \"භික්‍ෂුව, හැකි යයි\" භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n\"භික්‍ෂුව, යම්සේ යොදුනක් දිග, යොදුනක් පළල, යොදුනක් උස යකඩින් තැනූ නගරයක් වේ නම්, එය අබ ඇටවලින් කන්දක් සේ ගොඩගැසී පිරී තිබේ නම්. ඒ නගරයෙන් යම් පුරුෂයෙක් සිය වසින් සිය වසකට වරක් එක එක අබ ඇටයක් ඉවත් කරන්නේ නම්. භික්‍ෂුව, ඒ මහත් අබ කන්ද මේ ක්‍රමයෙන් ඉක්මනින්ම ක්ෂය වී, අවසන් වී යන්නේය. එහෙත් කල්පය අවසන් වන්නේ නම් නොවේ. භික්‍ෂුව, කල්පය එසේ දීර්ඝය.\"\n\n\"භික්‍ෂුව, මෙසේ දීර්ඝ වූ කල්පයන්ගෙන් නොයෙක් කල්පයක් සංසාරයේ ගමන් කර ඇත. නොයෙක් කල්ප සිය ගණනක් සංසාරයේ ගමන් කර ඇත. නොයෙක් කල්ප දහස් ගණනක් සංසාරයේ ගමන් කර ඇත. නොයෙක් කල්ප ලක්‍ෂ ගණනක් සංසාරයේ ගමන් කර ඇත. ඒ කිමෙක්ද? භික්‍ෂුව, මේ සංසාරය අතීත කෙළවරක් නොදැක්කේය... නිදහස් වීම සඳහා මේ කරුණ ප්‍රමාණවත්ය.\"",
      "paliTitle": "Sāsapasuttaṃ",
      "englishTitle": "The Discourse on the Mustard Seed",
      "sinhalaTitle": "සාසප සූත්‍රය"
    },
    {
      "number": 130,
      "pali": "Sāvatthiyaṃ viharati. Atha kho sambahulā bhikkhū yena bhagavā…pe… ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘kīvabahukā nu kho, bhante, kappā abbhatītā atikkantā’’ti? ‘‘Bahukā kho, bhikkhave, kappā abbhatītā atikkantā. Te na sukarā saṅkhātuṃ – ‘ettakā kappā iti vā, ettakāni kappasatāni iti vā, ettakāni kappasahassāni iti vā, ettakāni kappasatasahassāni iti vā’’’ti. ‘‘Sakkā pana, bhante, upamaṃ kātu’’nti? ‘‘Sakkā, bhikkhave’’ti bhagavā avoca. ‘‘Idhassu, bhikkhave, cattāro sāvakā vassasatāyukā vassasatajīvino. Te divase divase kappasatasahassaṃ kappasatasahassaṃ anussareyyuṃ. Ananussaritāva bhikkhave, tehi kappā assu, atha kho te cattāro sāvakā vassasatāyukā vassasatajīvino vassasatassa accayena kālaṃ kareyyuṃ. Evaṃ bahukā kho, bhikkhave, kappā abbhatītā atikkantā. Te na sukarā saṅkhātuṃ – ‘ettakā kappā iti vā, ettakāni kappasatāni iti vā, ettakāni kappasahassāni iti vā, ettakāni kappasatasahassāni iti vā’ti. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro…pe… alaṃ vimuccitu’’nti. Sattamaṃ.",
      "english": "He was dwelling in Savatthi. Then indeed, many bhikkhus approached the Blessed One, paid homage, exchanged greetings, and sat down to one side. Having sat down, those bhikkhus said this to the Blessed One: \"Venerable sir, how many eons indeed have passed, have elapsed?\"\n\n\"Monastics, many eons indeed have passed, have elapsed. They are not easy to count, saying, 'these many eons,' or 'these many hundreds of eons,' or 'these many thousands of eons,' or 'these many hundreds of thousands of eons.'\"\n\n\"But venerable sir, is it possible to give a comparison?\"\n\n\"It is possible, monastics,\" the Blessed One said. \"Herein, monastics, suppose there are four disciples, with a lifespan of a hundred years, living for a hundred years. They would recollect a hundred thousand eons each and every day. Monastics, even then, the eons would remain unrecollected by them, and those four disciples, with a lifespan of a hundred years, living for a hundred years, would pass away after a hundred years. Such indeed is the multitude of eons, monastics, that have passed, have elapsed. They are not easy to count, saying, 'these many eons,' or 'these many hundreds of eons,' or 'these many thousands of eons,' or 'these many hundreds of thousands of eons.' For what reason is that? Monastics, this wandering-on (saṃsāra) has no conceivable beginning. A first point is not discerned for beings hindered by ignorance and fettered by craving, who are wandering and transmigrating. Thus, for a long time, monastics, you have experienced this suffering, intense, harsh, bitter, a calamity. Therefore, it is enough to become dispassionate, enough to be unburdened, enough to be liberated.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක. එකල බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව වාඩි වී මෙසේ පැවසූහ: \"භාග්‍යවතුන් වහන්ස, ගෙවී ගිය, අවසන් වූ කල්ප කීයක්‌ නම් ඇද්ද?\"\n\n\"මහණෙනි, ගෙවී ගිය, අවසන් වූ කල්ප බොහෝය. ‘මෙපමණ කල්පය’ කියා හෝ, ‘මෙපමණ කල්ප සියයක්ය’ කියා හෝ, ‘මෙපමණ කල්ප දහසක්ය’ කියා හෝ, ‘මෙපමණ කල්ප ලක්ෂයක්ය’ කියා හෝ ඒවා ගණන් කිරීම පහසු නැත.\"\n\n\"භාග්‍යවතුන් වහන්ස, උපමාවක්‌ දැක්විය හැකිද?\"\n\nභාග්‍යවතුන් වහන්සේ වදාළ සේක: \"මහණෙනි, දැක්විය හැක.\"\n\n\"මහණෙනි, මෙහි අවුරුදු සියයක් ආයුෂ ඇති, අවුරුදු සියයක් ජීවත්වන ශ්‍රාවකයින් සිව් දෙනෙක් ඇතැයි සිතමු. ඔවුහු දිනෙන් දින කල්ප ලක්ෂයක් බැගින් සිහි කරත්වා. මහණෙනි, ඔවුන් විසින් එම කල්ප සිහි කර අවසන් නොකරන ලද්දේදීම, අවුරුදු සියයක් ආයුෂ ඇති, අවුරුදු සියයක් ජීවත්වන එම ශ්‍රාවකයින් සිව් දෙනා අවුරුදු සියයකින් පසු මිය යන්නාහ. මහණෙනි, මෙසේ ගෙවී ගිය, අවසන් වූ කල්ප බොහෝය. ‘මෙපමණ කල්පය’ කියා හෝ, ‘මෙපමණ කල්ප සියයක්ය’ කියා හෝ, ‘මෙපමණ කල්ප දහසක්ය’ කියා හෝ, ‘මෙපමණ කල්ප ලක්ෂයක්ය’ කියා හෝ ඒවා ගණන් කිරීම පහසු නැත.\"\n\n\"ඊට හේතුව කුමක්ද? මහණෙනි, මේ සංසාරය මුලක් අගක් නොපෙනෙන එකකි. එයින් මිදීමට මෙය ප්‍රමාණවත්ය.\"",
      "paliTitle": "Sāvakasuttaṃ",
      "englishTitle": "The Discourse on Disciples",
      "sinhalaTitle": "සාවක සූත්‍රය"
    },
    {
      "number": 131,
      "pali": "Rājagahe viharati veḷuvane. Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘kīvabahukā nu kho, bho gotama, kappā abbhatītā atikkantā’’ti? ‘‘Bahukā kho, brāhmaṇa, kappā abbhatītā atikkantā. Te na sukarā saṅkhātuṃ – ‘ettakā kappā iti vā, ettakāni kappasatāni iti vā, ettakāni kappasahassāni iti vā, ettakāni kappasatasahassāni iti vā’’’ti. ‘‘Sakkā pana, bho gotama, upamaṃ kātu’’nti? ‘‘Sakkā, brāhmaṇā’’ti bhagavā avoca. ‘‘Seyyathāpi, brāhmaṇa, yato cāyaṃ gaṅgā nadī pabhavati yattha ca mahāsamuddaṃ appeti, yā etasmiṃ antare vālikā sā na sukarā saṅkhātuṃ – ‘ettakā vālikā iti vā, ettakāni vālikasatāni iti vā, ettakāni vālikasahassāni iti vā, ettakāni vālikasatasahassāni iti vā’ti. Tato bahutarā kho, brāhmaṇa, kappā abbhatītā atikkantā. Te na sukarā saṅkhātuṃ – ‘ettakā kappā iti vā, ettakāni kappasatāni iti vā, ettakāni kappasahassāni iti vā, ettakāni kappasatasahassāni iti vā’ti. Taṃ kissa hetu? Anamataggoyaṃ, brāhmaṇa, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Evaṃ dīgharattaṃ kho, brāhmaṇa, dukkhaṃ paccanubhūtaṃ tibbaṃ paccanubhūtaṃ byasanaṃ paccanubhūtaṃ, kaṭasī vaḍḍhitā. Yāvañcidaṃ, brāhmaṇa, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccitu’’nti. Evaṃ vutte, so brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Aṭṭhamaṃ.",
      "english": "The Blessed One was dwelling at Rājagaha, in the Bamboo Grove. Then, a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. When this amiable and cordial talk was concluded, he sat down to one side. Seated to one side, that brahmin said to the Blessed One, \"Good sir Gotama, how many eons, indeed, have passed and elapsed?\" \"Many, brahmin, are the eons that have passed and elapsed. They are not easy to count as 'so many eons,' or 'so many hundreds of eons,' or 'so many thousands of eons,' or 'so many hundreds of thousands of eons.'\" \"Is it possible, good sir Gotama, to give a simile?\" \"It is possible, brahmin,\" the Blessed One said. \"Just as, brahmin, the sand in the space between where this river Ganges originates and where it flows into the great ocean is not easy to count as 'so many grains of sand,' or 'so many hundreds of grains of sand,' or 'so many thousands of sand grains,' or 'so many hundreds of thousands of sand grains'—even more numerous than that, brahmin, are the eons that have passed and elapsed. They are not easy to count as 'so many eons,' or 'so many hundreds of eons,' or 'so many thousands of eons,' or 'so many hundreds of thousands of eons.' Why is that? This cycle of existence, brahmin, has no discernible beginning. A prior end is not to be found for beings hindered by ignorance and bound by craving, who are running on and transmigrating. For such a long time, brahmin, suffering has been experienced, acute pain has been experienced, misfortune has been experienced, and burial grounds have grown. Enough indeed, brahmin, for one to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\"\n\nWhen this was said, that brahmin said to the Blessed One, \"Excellent, good sir Gotama! Excellent, good sir Gotama! May Master Gotama accept me as a lay follower, having gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "රාජගහ නුවර වේළුවනාරාමයේ භාග්‍යවතුන් වහන්සේ වැඩසිටින සේක. එවිට එක්තරා බ‍්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. ආගන්තුක සත්කාරය සඳහා වටිනා කතාබහ නිමා කොට, ඔහු එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි ඒ බ‍්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: “භවත් ගෞතමයන් වහන්ස, කොපමණ කල්ප ප‍්‍රමාණයක් ඉක්ම ගොස් පහව ගොස් ඇත්ද?”\n\n“බ‍්‍රාහ්මණය, බොහෝ කල්ප ඉක්ම ගොස් පහව ගොස් ඇත්තේය. ඒ කල්ප ‘මෙපමණ කල්පයෝ ය’ කියා හෝ ‘මෙපමණ කල්ප සිය ගණනක් ය’ කියා හෝ ‘මෙපමණ කල්ප දහස් ගණනක් ය’ කියා හෝ ‘මෙපමණ කල්ප ලක්ෂ ගණනක් ය’ කියා හෝ ගණන් කිරීම පහසු නැත.”\n\n“එහෙත් භවත් ගෞතමයන් වහන්ස, උපමාවක් දැක්විය හැකිද?”\n\n“දැක්විය හැකියි, බ‍්‍රාහ්මණයැ”යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n“බ‍්‍රාහ්මණය, ගංගා නදිය ආරම්භ වන තැන සිට මහා සාගරයට වැටෙන තැන දක්වා ඇති වැලි කැට ‘මෙපමණ වැලි කැට ය’ කියා හෝ ‘මෙපමණ වැලි කැට සිය ගණනක් ය’ කියා හෝ ‘මෙපමණ වැලි කැට දහස් ගණනක් ය’ කියා හෝ ‘මෙපමණ වැලි කැට ලක්ෂ ගණනක් ය’ කියා හෝ ගණන් කිරීම පහසු නැත. ඊටත් වඩා කල්ප ප‍්‍රමාණයක්, බ‍්‍රාහ්මණය, ඉක්ම ගොස් පහව ගොස් ඇත්තේය. ඒ කල්ප ‘මෙපමණ කල්පයෝ ය’ කියා හෝ ‘මෙපමණ කල්ප සිය ගණනක් ය’ කියා හෝ ‘මෙපමණ කල්ප දහස් ගණනක් ය’ කියා හෝ ‘මෙපමණ කල්ප ලක්ෂ ගණනක් ය’ කියා හෝ ගණන් කිරීම පහසු නැත. එයට හේතුව කුමක්ද? බ‍්‍රාහ්මණය, මේ සංසාරය අතීතයෙහි ආරම්භයක් නොපෙනෙන, කෙළවරක් නොපෙනෙන ස්වභාවයෙන් යුක්තය. අවිද්‍යාව නමැති නීවරණයෙන් වැසුණු, තණ්හාව නමැති සංයෝජනයෙන් බැඳුනු සත්වයන්ට මෙසේ සැරිසරන විට, මේ සංසාරයේ පෙර කොටසක්, ආදියක් නොපෙනේ. බ‍්‍රාහ්මණය, මෙසේ ඉතා දීර්ඝ කාලයක් දුක් අත්විඳින ලදී, තියුණු දුක් අත්විඳින ලදී, විපත් අත්විඳින ලදී. සුසාන භූමි වැලි කැට මෙන් වැඩි විය. බ‍්‍රාහ්මණය, මේ කරුණ සියලු සංස්කාර ධර්මයන් කෙරෙහි කලකිරීමටත්, විරාගී වීමටත්, මිදීමටත් ප‍්‍රමාණවත් වන්නේය.”\n\nමෙසේ වදාළ විට, ඒ බ‍්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: “භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! ... අද පටන් දිවි තිබෙන තුරා සරණ ගිය උපාසකයෙකු ලෙස භවත් ගෞතමයන් වහන්සේ මා පිළිගන්නා සේක්වා!”\n\nඅටවැනියා යි.",
      "paliTitle": "Gaṅgāsuttaṃ",
      "englishTitle": "The Ganges Sutta",
      "sinhalaTitle": "ගංගා සූත්‍රය"
    },
    {
      "number": 132,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Seyyathāpi, bhikkhave, daṇḍo uparivehāsaṃ khitto sakimpi mūlena nipatati, sakimpi majjhena nipatati, sakimpi antena nipatati; evameva kho, bhikkhave, avijjānīvaraṇā sattā taṇhāsaṃyojanā sandhāvantā saṃsarantā sakimpi asmā lokā paraṃ lokaṃ gacchanti, sakimpi parasmā lokā imaṃ lokaṃ āgacchanti. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro…pe… alaṃ vimuccitu’’nti. Navamaṃ.",
      "english": "Monks, this cyclic existence is without a discernible beginning. A first point is not known for beings hindered by ignorance and bound by craving, who wander on and transmigrate. Just as, monks, a stick thrown up into the air sometimes falls with its base, sometimes with its middle, and sometimes with its tip; even so, monks, beings hindered by ignorance and fettered by craving, who wander on and transmigrate, sometimes go from this world to another world, and sometimes come from another world to this world. Why is that so? Monks, this cyclic existence is without a discernible beginning. For a long time, you have experienced suffering, intense, harsh, bitter, and unwelcome. This is enough to become disenchanted, enough to become dispassionate, enough to be liberated.",
      "sinhala": "මහණෙනි, මේ සංසාරය අනමතග්ග වූවකි. අවිද්‍යාවෙන් වැසීගත්, තණ්හා සංයෝජනයන්ගෙන් බැඳුණු, සසර සැරිසරමින් දුවන්නා වූ සත්‍වයන්ට මුල් කෙළවරක් නොපැනේ.\n\nමහණෙනි, යම් සේ වේවා, අහසට දමන ලද දණ්ඩක් සමහර විට මුලින් වැටේ, සමහර විට මැදින් වැටේ, සමහර විට අගින් වැටේ; එපරිද්දෙන්ම, මහණෙනි, අවිද්‍යාවෙන් වැසීගත්, තණ්හා සංයෝජනයන්ගෙන් බැඳුණු, සසර සැරිසරමින් දුවන්නා වූ සත්‍වයෝ සමහර විට මේ ලෝකයෙන් පරලෝකයට යති, සමහර විට පරලෝකයෙන් මේ ලෝකයට එති.\n\nඑයට හේතුව කිමෙක්ද? මහණෙනි, මේ සංසාරය අනමතග්ග වූවකි. එබැවින් මෙයින් නිදහස් වීමට ප‍්‍රමාණවත්ය.",
      "paliTitle": "Daṇḍasuttaṃ",
      "englishTitle": "The Discourse on the Stick",
      "sinhalaTitle": "දණ්ඩ සූත්‍රය"
    },
    {
      "number": 133,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Anamataggoyaṃ, bhikkhave, saṃsāro…pe… ekapuggalassa, bhikkhave, kappaṃ sandhāvato saṃsarato siyā evaṃ mahā aṭṭhikaṅkalo aṭṭhipuñjo aṭṭhirāsi yathāyaṃ vepullo pabbato, sace saṃhārako assa, sambhatañca na vinasseyya. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro…pe… alaṃ vimuccitu’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Ekassekena kappena, puggalassaṭṭhisañcayo; Siyā pabbatasamo rāsi, iti vuttaṃ mahesinā. ‘‘So kho panāyaṃ akkhāto, vepullo pabbato mahā; Uttaro gijjhakūṭassa, magadhānaṃ giribbaje. ‘‘Yato ca ariyasaccāni, sammappaññāya passati; Dukkhaṃ dukkhasamuppādaṃ, dukkhassa ca atikkamaṃ; Ariyaṃ caṭṭhaṅgikaṃ maggaṃ, dukkhūpasamagāminaṃ. ‘‘Sa sattakkhattuṃparamaṃ, sandhāvitvāna puggalo; Dukkhassantakaro hoti, sabbasaṃyojanakkhayā’’ti. dasamaṃ; Paṭhamo vaggo. Tassuddānaṃ – Tiṇakaṭṭhañca pathavī, assu khīrañca pabbataṃ; Sāsapā sāvakā gaṅgā, daṇḍo ca puggalena cāti.",
      "english": "At one time the Blessed One was dwelling at Rājagaha, on Gijjhakūṭa mountain. There, the Blessed One addressed the bhikkhus, saying, \"Bhikkhus.\" \"Venerable Sir,\" those bhikkhus replied to the Blessed One. The Blessed One spoke thus: \"This saṃsāra, bhikkhus, is without discoverable beginning. For one person, bhikkhus, wandering and transmigrating for an eon, there would be such a great heap of bones, a pile of bones, a mountain of bones, as large as this Vepulla mountain, if it were collected and the collected remains did not perish. And why is that? This saṃsāra, bhikkhus, is without discoverable beginning. It is enough to be disenchanted, enough to be dispassionate, enough to be liberated from it.\" The Blessed One spoke this. Having spoken this, the Fortunate One, the Teacher, further said:\n\n\"For one individual in a single eon, the accumulation of bones\nWould be a heap like a mountain; thus it was said by the Great Seer.\n\n\"And that great Vepulla mountain has been declared\nTo be north of Gijjhakūṭa, in the mountains of the Magadhans.\nBut when one truly sees, with perfect wisdom, the Noble Truths:\nSuffering, the origin of suffering, the cessation of suffering,\nAnd the Noble Eightfold Path leading to the cessation of suffering;\nThat individual, having run on at most seven times more,\nBecomes one who makes an end to suffering, through the destruction of all fetters.\"\n\nThis is the tenth discourse. The first chapter. Its summary: Grass and wood, and earth; tears and milk, and mountain; mustard seeds, disciples, and the Ganges; a staff, and an individual.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ඣකූට පර්වතයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"ස්වාමීනි\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, මේ සංසාරය අසංඛෙය්‍යයි, මුලක් නොපෙනෙයි... මහණෙනි, එක් පුද්ගලයෙක් කප්ප කාලයක් මුළුල්ලේ සසර සැරිසරන විට, යම් හෙයකින් ඒ ඇට එක්රැස් කළ හැකි නම්, රැස් කළ ද නොනැසී පවතී නම්, යම්සේ මේ වේපුල්ල පර්වතය ද, මෙවැනි මහත් ඇටසැකිල්ලක්, ඇටගොඩක්, ඇටරාශියක් ඇති විය හැකියි. ඊට හේතු කවරේද? මහණෙනි, මේ සංසාරය අසංඛෙය්‍යයි, මුලක් නොපෙනෙයි... මේ (සංසාරයෙන්) මිදීමට සුදුසුයි.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා, සුගත වූ, ශාස්තෘන් වහන්සේ තවදුරටත් මෙය වදාළ සේක:\n\n\"එක පුද්ගලයෙකුගේ එක කල්පයක ඇටසැකිලි එකතුව, පර්වතයක් හා සමාන රාශියක් විය හැකැයි මහා ඍෂිවරයා විසින් වදාරන ලදී.\n\nමහා වේපුල්ල පර්වතය නම්, එය ගිජ්ඣකූට පර්වතයට උතුරින් මගධ වැසියන්ගේ පර්වත ප්‍රදේශයෙහි පිහිටා ඇති බව ප්‍රකාශ කරනු ලැබේ.\n\nයම් කලෙක දුක ද, දුක ඇතිවීම ද, දුක නැති කිරීම ද, දුක නිවාරණයට යන ආර්ය අෂ්ටාංගික මාර්ගය ද යන ආර්ය සත්‍යයන් සම්මා ප්‍රඥාවෙන් දකී ද, ඒ පුද්ගලයා සියලු සංයෝජන ක්ෂය කිරීමෙන්, සත් වරකට වඩා (සසර) නොදුවා දුක කෙළවර කරන්නෙක් වෙයි.\"",
      "paliTitle": "Puggalasuttaṃ",
      "englishTitle": "The Discourse on Persons",
      "sinhalaTitle": "පුග්ගල සූත්‍රය"
    },
    {
      "number": 134,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati. Tatra kho bhagavā bhikkhu āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Yaṃ, bhikkhave, passeyyātha duggataṃ durūpetaṃ niṭṭhamettha gantabbaṃ – ‘amhehipi evarūpaṃ paccanubhūtaṃ iminā dīghena addhunā’ti. Taṃ kissa hetu…pe… yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ alaṃ virajjituṃ alaṃ vimuccitu’’nti. Paṭhamaṃ.",
      "english": "At one time the Blessed One was dwelling at Savatthi. There, indeed, the Blessed One addressed the monks, saying, \"Monks.\" \"Venerable sir,\" those monks replied to the Blessed One. The Blessed One spoke thus: \"This wandering-on, monks, is without a conceivable beginning. A former beginning is not discernible for beings hindered by ignorance and bound by craving, who are running on and wandering through cyclic existence. Whatever you might see, monks, that is ill-fated and wretched, you should come to this conclusion: 'This kind of suffering has been experienced by us too throughout this long journey.' For what reason is that? Because of this, monks, it is indeed enough to be disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක. එහිලා භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි,\" \"වහන්ස,\" යැයි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, මේ සංසාරය අතීත කෙළවරක් නොපෙනෙන, ඥානයෙන් මැන අවසන් කළ නොහැක්කකි. අවිද්‍යාව නමැති නීවරණයෙන් වසන ලද, තණ්හාව නමැති සංයෝජනයෙන් බැඳුණු සත්ත්වයින්ට, නිරන්තරයෙන් සැරිසරන, නැවත නැවත ඉපදෙන අයට පූර්ව කෙළවරක් නොපෙනේ. මහණෙනි, යම් දුගතියට පත්වූ, දුකට හුරු වූ සත්ත්වයෙක්ව ඔබලා දකින්නෙහිද, 'අප විසින්ද මේ දිගු කලක් තුළ එවැනි දුක් විඳිනු ලැබූ' යැයි මේ පිළිබඳව ඔබලා නිගමනයකට පැමිණිය යුතු වන්නේය. ඒ කුමක් හෙයින්ද? (මේ තරම් දීර්ඝ කාලයක් දුක් විඳීම නිසාම) මහණෙනි, මේ සියලු සංස්කාරයන් කෙරෙහි කලකිරීමට, නොඇලීමට, සහ සම්පූර්ණයෙන්ම නිදහස් වීමට ප්‍රමාණවත්ය.\"",
      "paliTitle": "Duggatasuttaṃ",
      "vagga": "Dutiyavaggo",
      "englishTitle": "The Poverty-stricken Sutta",
      "sinhalaTitle": "දුග්ගත සූත්‍රය",
      "vaggaEnglish": "Second Chapter",
      "vaggaSinhala": "දෙවන වර්ගය"
    },
    {
      "number": 135,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro…pe… yaṃ, bhikkhave, passeyyātha sukhitaṃ susajjitaṃ, niṭṭhamettha gantabbaṃ – ‘amhehipi evarūpaṃ paccanubhūtaṃ iminā dīghena addhunā’ti. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati… pe… alaṃ vimuccitu’’nti. Dutiyaṃ.",
      "english": "The Blessed One was residing in Sāvatthī.\n\n“Monks, this saṃsāra is without a discernible beginning. A first point is not perceived for beings hindered by ignorance and fettered by craving, who are transmigrating and wandering on. Whatever you may see, monks, that is happy and well-adorned, this conclusion should be reached regarding it: ‘Such things have also been experienced by us throughout this long journey.’ What is the reason for that? This saṃsāra, monks, is without a discernible beginning. Its prior end is not perceived. Thus, monks, for a long, long time you have experienced suffering, experienced pain, experienced loss, and filled the charnel grounds. For this reason, monks, it is enough to become disenchanted with all formations, enough to become dispassionate, enough to be liberated.”",
      "sinhala": "සැවැත්නුවර වැඩසිටියහ...පෙ... \"මහණෙනි, මේ සංසාරය අනාමතග්ගය...පෙ... මහණෙනි, යමක් ඔබලා සැපයෙන් යුක්තව, මැනවින් සරසා සිටිනු දකින්නෙහි නම්, එහිදී මේ නිගමනයට එළඹිය යුතු වන්නේ ය: ‘මේ දීර්ඝ කාලය පුරාවට මෙවැනි දෑ අප විසින් ද අත්විඳ ඇතැ’යි. එයට හේතුව කුමක්ද? මහණෙනි, මේ සංසාරය අනාමතග්ගය. පූර්ව කෝටියක් නොපැනෙයි...පෙ... මේ සියල්ලෙන් නිදහස් වීම සඳහා මේ (තත්ත්වය) ප්‍ර​මාණවත් ය.\"",
      "paliTitle": "Sukhitasuttaṃ",
      "englishTitle": "The Discourse on the Happy",
      "sinhalaTitle": "සුඛිත සූත්‍රය"
    },
    {
      "number": 136,
      "pali": "Rājagahe viharati veḷuvane. Atha kho tiṃsamattā pāveyyakā [pāṭheyyakā (katthaci) vinayapiṭake mahāvagge kathinakkhandhakepi] bhikkhū sabbe āraññikā sabbe piṇḍapātikā sabbe paṃsukūlikā sabbe tecīvarikā sabbe sasaṃyojanā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Atha kho bhagavato etadahosi – ‘‘ime kho tiṃsamattā pāveyyakā bhikkhū sabbe āraññikā sabbe piṇḍapātikā sabbe paṃsukūlikā sabbe tecīvarikā sabbe sasaṃyojanā. Yaṃnūnāhaṃ imesaṃ tathā dhammaṃ deseyyaṃ yathā nesaṃ imasmiṃyeva āsane anupādāya āsavehi cittāni vimucceyyu’’nti. Atha kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ, yaṃ vā catūsu mahāsamuddesu udaka’’nti? ‘‘Yathā kho mayaṃ, bhante, bhagavatā dhammaṃ desitaṃ ājānāma, etadeva, bhante, bahutaraṃ, yaṃ no iminā dīghena addhunā sandhāvataṃ saṃsarataṃ sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udaka’’nti. ‘‘Sādhu sādhu, bhikkhave, sādhu kho me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha. Etadeva, bhikkhave, bahutaraṃ, yaṃ vo iminā dīghena addhunā sandhāvataṃ saṃsarataṃ sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udakaṃ. Dīgharattaṃ vo, bhikkhave, gunnaṃ sataṃ gobhūtānaṃ sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udakaṃ. Dīgharattaṃ vo, bhikkhave, mahiṃsānaṃ [mahisānaṃ (sī. pī.)] sataṃ mahiṃsabhūtānaṃ sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ …pe… dīgharattaṃ vo, bhikkhave, urabbhānaṃ sataṃ urabbhabhūtānaṃ…pe… ajānaṃ sataṃ ajabhūtānaṃ… migānaṃ sataṃ migabhūtānaṃ… kukkuṭānaṃ sataṃ kukkuṭabhūtānaṃ… sūkarānaṃ sataṃ sūkarabhūtānaṃ… dīgharattaṃ vo, bhikkhave, corā gāmaghātāti gahetvā sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ. Dīgharattaṃ vo, bhikkhave, corā pāripanthikāti gahetvā sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ. Dīgharattaṃ vo, bhikkhave, corā pāradārikāti gahetvā sīsacchinnānaṃ lohitaṃ passannaṃ paggharitaṃ, na tveva catūsu mahāsamuddesu udakaṃ. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro…pe… alaṃ vimuccitu’’nti. ‘‘Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne tiṃsamattānaṃ pāveyyakānaṃ bhikkhūnaṃ anupādāya āsavehi cittāni vimucciṃsū’’ti. Tatiyaṃ.",
      "english": "The Blessed One was dwelling at Rājagaha, in the Bamboo Grove. Then thirty monks from Pāveyyaka, all forest dwellers, all alms-food eaters, all rag-robe wearers, all three-robed ones, and all still bound by fetters, approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side.\n\nThen this thought occurred to the Blessed One: \"These thirty monks from Pāveyyaka are all forest dwellers, all alms-food eaters, all rag-robe wearers, all three-robed ones, and all still bound by fetters. What if I were to teach them the Dhamma in such a way that their minds might be liberated from the taints, without clinging, right in this very seat?\" Then the Blessed One addressed the monks, saying, \"Monks!\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One spoke this:\n\n\"Monks, this saṃsāra is without a discernible beginning. A first point is not discernible for beings hindered by ignorance and bound by craving, as they run on and wander through this cycle of existence. What do you think, monks? Which is greater: the blood that has flowed and gushed from your heads when they were severed as you ran on and wandered through this long, long course of existence, or the water in the four great oceans?\"\n\n\"As we understand the Dhamma taught by the Blessed One, Venerable Sir,\" they replied, \"that is indeed greater, Venerable Sir: the blood that has flowed and gushed from our heads when they were severed as we ran on and wandered through this long, long course of existence, and not the water in the four great oceans.\"\n\n\"Good, good, monks! It is good, monks, that you thus understand the Dhamma taught by me. Indeed, monks, that is greater: the blood that has flowed and gushed from your heads when they were severed as you ran on and wandered through this long, long course of existence, and not the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you have been cows a hundred times and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you have been buffaloes a hundred times and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you have been sheep a hundred times and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you have been goats a hundred times and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you have been deer a hundred times and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you have been chickens a hundred times and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you have been pigs a hundred times and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you were seized as village-raiding robbers and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you were seized as highway robbers and your heads were severed, is greater than the water in the four great oceans. For a long time, monks, the blood that has flowed and gushed from you, when you were seized as adulterers and your heads were severed, is greater than the water in the four great oceans.\"\n\n\"For what reason? Monks, this saṃsāra is without a discernible beginning. Thus, it is enough to be disenchanted with it, enough to be dispassionate about it, and enough to be liberated from it.\"\n\nThe Blessed One said this. Delighted, those monks rejoiced in the Blessed One's words. And while this exposition was being spoken, the minds of those thirty monks from Pāveyyaka were liberated from the taints, without clinging.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ රාජගහ නුවර වේළුවනාරාමයෙහි වැඩවසන සේක. ඉක්බිති පාවෙය්‍යක දේශයෙන් පැමිණි භික්ෂූන් වහන්සේලා තිස් නමක් පමණ වූහ. ඒ සියලු භික්ෂූහු ආරණ්‍යක වූහ (වනයෙහි වාසය කළහ), සියලු දෙනාම පිණ්ඩපාතික වූහ (පිඬුසිඟා වදාළහ), සියලු දෙනාම පාංශුකූලික වූහ (රෙදි කැබලි එකතුකර සිවුරු කරගත්හ), සියලු දෙනාම තෙචීවරික වූහ (තෙචීවර ධුතංගය රක්ෂා කළහ), සියලු දෙනාම සංයෝජන සහිත වූහ (සංයෝජන කෙලෙසුන්ගෙන් මිදී නොසිටියහ). ඔවුහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූහ. ඉක්බිති භාග්‍යවතුන් වහන්සේට මෙබඳු අදහසක් පහළ විය: \"මෙම තිස් නමක් පමණ වූ පාවෙය්‍යක භික්ෂූහු සියලු දෙනාම ආරණ්‍යක වෙති, සියලු දෙනාම පිණ්ඩපාතික වෙති, සියලු දෙනාම පාංශුකූලික වෙති, සියලු දෙනාම තෙචීවරික වෙති, සියලු දෙනාම සංයෝජන සහිත වෙති. යම් හෙයකින් මම මොවුන්ට ධර්මය දේශනා කළොත්, ඒ අයුරින් මේ ආසනයේදී ම ඔවුන්ගේ සිත උපාදානයෙන් තොරව, ආශ්‍රවයන්ගෙන් මිදේවා!\" ඉක්බිති භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලා ඇමතූ සේක: \"මහණෙනි!\" \"ස්වාමීනී,\" ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මේ වදාළ සේක:\n\n\"මහණෙනි, මේ සංසාරය අතීත කෙළවරක් නොදක්නා ලද්දකි. අවිද්‍යාවෙන් වැසී, තණ්හා සංයෝජනයන්ගෙන් බැඳී, සැරිසරන, සංසාරයෙහි ගමන් කරන සත්වයන්ගේ මුල් කෙළවරක් නොපෙනේ. මහණෙනි, ඒ කුමක් සිතන්නාහුද? මේ දීර්ඝ කාලයක් මුළුල්ලේ සංසාරයෙහි සැරිසරන, හිස සිඳ දමනු ලැබූ නුඹලාගේ ශරීරයෙන් ගලා ගිය ලේ ප්‍රමාණයද, එසේ නැතිනම් මහා සාගර හතරේ ජලයද, මේ දෙකින් කුමක්ද වැඩි යැයි සිතන්නාහු?\" \"භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය අප තේරුම් ගන්නා අයුරින්, ස්වාමීනී, මේ දීර්ඝ කාලයක් මුළුල්ලේ සංසාරයෙහි සැරිසරන, හිස සිඳ දමනු ලැබූ අපගේ ශරීරයෙන් ගලා ගිය ලේ ප්‍රමාණයම වැඩි ය. මහා සාගර හතරේ ජලය එතරම් නැත.\" \"සාධු! සාධු! මහණෙනි! මහණෙනි, මා විසින් දේශනා කරන ලද ධර්මය නුඹලා මෙසේ අවබෝධ කරගන්නා බව ඉතා යහපත්ය. මහණෙනි, මේ දීර්ඝ කාලයක් මුළුල්ලේ සංසාරයෙහි සැරිසරන, හිස සිඳ දමනු ලැබූ නුඹලාගේ ශරීරයෙන් ගලා ගිය ලේ ප්‍රමාණයම වැඩි ය. මහා සාගර හතරේ ජලය එතරම් නැත. මහණෙනි, නුඹලා දිගු කලක් ගවයන් වශයෙන් ඉපිද, ගවයන් වශයෙන් සිටියදී, හිස සිඳ දමනු ලැබීමෙන් ගලා ගිය ලේ ප්‍රමාණය වැඩි ය; මහා සාගර හතරේ ජලය එතරම් නැත. මහණෙනි, නුඹලා දිගු කලක් මී ගවයන් වශයෙන් ඉපිද, මී ගවයන් වශයෙන් සිටියදී, හිස සිඳ දමනු ලැබීමෙන් ගලා ගිය ලේ ප්‍රමාණයද වැඩි ය... (ආදී වශයෙන් විවිධ සත්ව හා මිනිස් භවයන් දක්වා දිවෙයි) ...බැටළුවන් වශයෙන් ඉපිද, බැටළුවන් වශයෙන් සිටියදී... ...එළුවන් වශයෙන් ඉපිද, එළුවන් වශයෙන් සිටියදී... ...මුවන් වශයෙන් ඉපිද, මුවන් වශයෙන් සිටියදී... ...කුකුළන් වශයෙන් ඉපිද, කුකුළන් වශයෙන් සිටියදී... ...ඌරන් වශයෙන් ඉපිද, ඌරන් වශයෙන් සිටියදී... මහණෙනි, නුඹලා දිගු කලක් ගම් වැරැදි කරුවන් ලෙසින් සොරුන් විසින් අල්ලාගෙන හිස සිඳ දමනු ලැබීමෙන් ගලා ගිය ලේ ප්‍රමාණයද වැඩි ය. මහණෙනි, නුඹලා දිගු කලක් මංකොල්ලකරුවන් ලෙසින් සොරුන් විසින් අල්ලාගෙන හිස සිඳ දමනු ලැබීමෙන් ගලා ගිය ලේ ප්‍රමාණයද වැඩි ය. මහණෙනි, නුඹලා දිගු කලක් පරදාර සේවකයන් ලෙසින් සොරුන් විසින් අල්ලාගෙන හිස සිඳ දමනු ලැබීමෙන් ගලා ගිය ලේ ප්‍රමාණයද වැඩි ය; මහා සාගර හතරේ ජලය එතරම් නැත. එයට හේතුව කුමක්ද? මහණෙනි, මේ සංසාරය අතීත කෙළවරක් නොදක්නා ලද්දකි... (සංසාරයේ අවසානයක් නොපෙනෙන බව නැවත සඳහන් වේ)... මේ කෙලෙසුන්ගෙන් මිදීමට ප්‍රමාණවත් වේ.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ඒ භික්ෂූහු සතුටු සිත් ඇතිව භාග්‍යවතුන් වහන්සේගේ වචන අගය කළහ. මෙම දේශනාව පවත්වන කල්හි, පාවෙය්‍යක දේශයෙන් පැමිණි තිස් නමක් වූ භික්ෂූන් වහන්සේලාගේ සිත් උපාදානයෙන් තොරව ආශ්‍රවයන්ගෙන් මිදුණාහුය. (මෙය) තෙවන (සූත්‍රයයි).",
      "paliTitle": "Tiṃsamattasuttaṃ",
      "englishTitle": "Discourse on the Thirty Monks",
      "sinhalaTitle": "තිංසමත්ත සූත්‍රය"
    },
    {
      "number": 137,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro…pe… na so, bhikkhave, satto sulabharūpo yo namātābhūtapubbo iminā dīghena addhunā. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro…pe… alaṃ vimuccitu’’nti. Catutthaṃ.",
      "english": "He was staying at Sāvatthī. “Mendicants, this cyclic existence is without a discoverable beginning. A prior end is not known for beings hindered by ignorance and fettered by craving, who transmigrate and wander on. Mendicants, it is not easy to find a being who has not been one’s mother before during this long course of transmigration. Why is that? Mendicants, this cyclic existence is without a discoverable beginning. A prior end is not known for beings hindered by ignorance and fettered by craving, who transmigrate and wander on. It is enough to be liberated.”",
      "sinhala": "මහණෙනි, මේ සංසාරය අගක් මුලක් නොපෙනෙන එකකි. මහණෙනි, මේ දීර්ඝ සංසාර ගමන තුළ මවක් නොවූ සත්වයකු සොයාගැනීම දුෂ්කරය. එයට හේතුව කුමක්ද? මහණෙනි, මේ සංසාරය අගක් මුලක් නොපෙනෙන එකකි. එය විමුක්තිය සඳහා ප්‍රමාණවත්ය.",
      "paliTitle": "Mātusuttaṃ",
      "englishTitle": "The Discourse on Mother",
      "sinhalaTitle": "මාතු සූත්‍රය"
    },
    {
      "number": 138,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro…pe… na so, bhikkhave, satto sulabharūpo yo napitābhūtapubbo …pe… alaṃ vimuccitu’’nti. Pañcamaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī. There he addressed the bhikkhus: 'Monks, this wandering-on is without a discernible beginning... There is no being, monks, who is readily found who has not been a father before... It is enough to be liberated.'",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක.\n\n“මහණෙනි, මේ සංසාරය අතීතයෙහි කෙළවරක් නොපෙනෙන දිගු ගමනකි. මහණෙනි, යම් සත්වයෙක් අතීතයේ කවරදාකවත් පියෙකු නොවී සිටියේ නම්, එවැනි සත්වයෙක් සොයාගැනීම පහසු දෙයක් නොවේ. මෙය කලකිරීමටත්, විමුක්තියටත් ප්‍රමාණවත්ය.”",
      "paliTitle": "Pitusuttaṃ",
      "englishTitle": "The Discourse on the Father",
      "sinhalaTitle": "පිතූ සූත්‍රය"
    },
    {
      "number": 139,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘na so, bhikkhave, satto sulabharūpo yo nabhātābhūtapubbo… pe… alaṃ vimuccitu’’nti. Chaṭṭhaṃ.",
      "english": "Thus have I heard. At one time the Blessed One was staying near Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park.\n\n\"Monks, that being is not easy to find who has not previously been a brother… …it is sufficient for liberation.\"",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක. මහණෙනි, පෙර කිසිදු ආත්ම භාවයකදී නුඹලාගේ සහෝදරයෙකු, මවක, පියෙකු, දියණියක, පුතෙකු හෝ වෙනත් ඥාති සම්බන්ධයකින් නෑකම් නොකළ සත්වයෙක් සොයාගැනීම දුෂ්කරය. එහෙයින් විමුක්තිය සඳහා මෙය ප්‍ර‌මාණවත් වන්නේය.",
      "paliTitle": "Bhātusuttaṃ",
      "englishTitle": "The Brother Sutta",
      "sinhalaTitle": "භාතු සූත්‍රය"
    },
    {
      "number": 140,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘na so, bhikkhave, satto sulabharūpo yo nabhaginibhūtapubbo… pe… alaṃ vimuccitu’’nti. Sattamaṃ.",
      "english": "At Sāvatthī, the Blessed One addressed the bhikkhus, saying: Monks, it is not easy to find a being who has not previously been your sister in this long course of wandering. This, monks, is enough for disenchantment, enough for dispassion, enough for liberation.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් සත්වයෙක් පෙර කිසිදාක සහෝදරයකු හෝ සහෝදරියක වී නොතිබුණේද, එවැනි සත්වයකු පහසුවෙන් සොයාගත නොහැක. මෙය විමුක්තිය පිණිස ප්‍ර​මාණවත්ය.",
      "paliTitle": "Bhaginisuttaṃ",
      "englishTitle": "The Sister Sutta",
      "sinhalaTitle": "භගිනි සූත්‍රය"
    },
    {
      "number": 141,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘na so, bhikkhave, satto sulabharūpo yo naputtabhūtapubbo… pe… alaṃ vimuccitu’’nti. Aṭṭhamaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī. He addressed the bhikkhus: “That being, O bhikkhus, is not easily found who has not been a son before. What is the reason for this? This transmigration, O bhikkhus, is without a discernible beginning. A prior limit is not discerned for beings hindered by ignorance and fettered by craving, who are transmigrating and wandering on. Thus, for a very long time, O bhikkhus, you have experienced suffering, pain, anguish, and displeasure. This is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.”",
      "sinhala": "සැවැත් නුවර වැඩසිටින සේක. මහණෙනි, යම් සත්වයෙක් පෙර කිසි කලෙකත් පුත‍්‍ර භාවයට පත් නොවූයේද, එබඳු සත්වයෙක් සොයාගැනීම දුර්ලභය. විමුක්තිය සඳහා එය සෑහේ.",
      "paliTitle": "Puttasuttaṃ",
      "englishTitle": "The Discourse on Sons",
      "sinhalaTitle": "පුත්ත සූත්‍රය"
    },
    {
      "number": 142,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Na so, bhikkhave, satto sulabharūpo yo na dhītābhūtapubbo iminā dīghena addhunā. Taṃ kissa hetu? Anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Evaṃ dīgharattaṃ vo, bhikkhave, dukkhaṃ paccanubhūtaṃ tibbaṃ paccanubhūtaṃ byasanaṃ paccanubhūtaṃ, kaṭasī vaḍḍhitā. Yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccitu’’nti. Navamaṃ.",
      "english": "Monks, this cycle of existence is without a discoverable beginning. A prior end is not discerned for beings hindered by ignorance and bound by the fetter of craving, who wander and transmigrate. It is not easy, monks, to find a being who, throughout this long journey, has not previously been your daughter. Why is that? This cycle of existence, monks, is without a discoverable beginning. A prior end is not discerned for beings hindered by ignorance and bound by the fetter of craving, who wander and transmigrate. For such a long time, monks, you have experienced suffering, experienced severe pain, experienced misfortune, and the charnel grounds have piled high. Such being the case, monks, it is enough to become disenchanted with all conditioned phenomena, enough to become dispassionate, enough to be liberated.",
      "sinhala": "ඒ භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක. මහණෙනි, මේ සංසාරය අසංඛ්‍යයි. අවිද්‍යාව නමැති නීවරණයෙන් වැසුණු, තණ්හාව නමැති සංයෝජනයෙන් බැඳුණු සත්වයන්ගේ සැරිසැරීමේ, භවයෙන් භවයට ගමන් කිරීමේ පෙර අන්තයක් නොපෙනේ. මහණෙනි, මේ දීර්ඝ සංසාරය තුළ මීට පෙර දියණියක් නොවූ, එබඳු සත්වයෙක් සොයාගැනීම පහසු දෙයක් නොවේ. එයට හේතුව කුමක්ද? මහණෙනි, මේ සංසාරය අසංඛ්‍යයි. අවිද්‍යාව නමැති නීවරණයෙන් වැසුණු, තණ්හාව නමැති සංයෝජනයෙන් බැඳුණු සත්වයන්ගේ සැරිසැරීමේ, භවයෙන් භවයට ගමන් කිරීමේ පෙර අන්තයක් නොපෙනේ. මහණෙනි, මෙසේ දීර්ඝ කාලයක් තිස්සේ ඔබට දුක් අත්දකින්නට සිදුව ඇත, දැඩි වේදනා අත්දකින්නට සිදුව ඇත, විපත් අත්දකින්නට සිදුව ඇත, (පෙර භවයන්හි මළ සිරුරු තැන්පත් කිරීමෙන්) සුසාන භූමි පිරී ඉතිරී ගොස් ඇත. මහණෙනි, සියලු සංස්‍කාරයන් කෙරෙහි කලකිරීමටත්, නොඇලීමටත්, (එයින්) මිදීමටත් මේ ප්‍රමාණවත්ය.",
      "paliTitle": "Dhītusuttaṃ",
      "englishTitle": "The Daughter",
      "sinhalaTitle": "ධීතු සූත්‍රය"
    },
    {
      "number": 143,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Anamataggoyaṃ, bhikkhave, saṃsāro. Pubbā koṭi na paññāyati avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ sandhāvataṃ saṃsarataṃ. Bhūtapubbaṃ, bhikkhave, imassa vepullassa pabbatassa ‘pācīnavaṃso’tveva samaññā udapādi. Tena kho pana, bhikkhave, samayena manussānaṃ ‘tivarā’tveva samaññā udapādi. Tivarānaṃ, bhikkhave, manussānaṃ cattārīsa vassasahassāni āyuppamāṇaṃ ahosi. Tivarā, bhikkhave, manussā pācīnavaṃsaṃ pabbataṃ catūhena ārohanti, catūhena orohanti. Tena kho pana, bhikkhave, samayena kakusandho bhagavā arahaṃ sammāsambuddho loke uppanno hoti. Kakusandhassa, bhikkhave, bhagavato arahato sammāsambuddhassa vidhurasañjīvaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Passatha, bhikkhave, sā cevimassa pabbatassa samaññā antarahitā, te ca manussā kālaṅkatā, so ca bhagavā parinibbuto. Evaṃ aniccā, bhikkhave, saṅkhārā; evaṃ addhuvā, bhikkhave, saṅkhārā; evaṃ anassāsikā, bhikkhave, saṅkhārā. Yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccituṃ. ‘‘Bhūtapubbaṃ, bhikkhave, imassa vepullassa pabbatassa ‘vaṅkako’tveva samaññā udapādi. Tena kho pana, bhikkhave, samayena manussānaṃ ‘rohitassā’tveva samaññā udapādi. Rohitassānaṃ, bhikkhave, manussānaṃ tiṃsavassasahassāni āyuppamāṇaṃ ahosi. Rohitassā, bhikkhave, manussā vaṅkakaṃ pabbataṃ tīhena ārohanti, tīhena orohanti. Tena kho pana, bhikkhave, samayena koṇāgamano bhagavā arahaṃ sammāsambuddho loke uppanno hoti. Koṇāgamanassa, bhikkhave, bhagavato arahato sammāsambuddhassa bhiyyosuttaraṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Passatha, bhikkhave, sā cevimassa pabbatassa samaññā antarahitā, te ca manussā kālaṅkatā, so ca bhagavā parinibbuto. Evaṃ aniccā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Bhūtapubbaṃ, bhikkhave, imassa vepullassa pabbatassa ‘supasso’tveva [suphassotveva (sī.)] samaññā udapādi. Tena kho pana, bhikkhave, samayena manussānaṃ ‘suppiyā’tveva [appiyātveva (sī.)] samaññā udapādi. Suppiyānaṃ, bhikkhave, manussānaṃ vīsativassasahassāni āyuppamāṇaṃ ahosi. Suppiyā, bhikkhave, manussā supassaṃ pabbataṃ dvīhena ārohanti, dvīhena orohanti. Tena kho pana, bhikkhave, samayena kassapo bhagavā arahaṃ sammāsambuddho loke uppanno hoti. Kassapassa, bhikkhave, bhagavato arahato sammāsambuddhassa tissabhāradvājaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Passatha, bhikkhave, sā cevimassa pabbatassa samaññā antarahitā, te ca manussā kālaṅkatā, so ca bhagavā parinibbuto. Evaṃ aniccā, bhikkhave, saṅkhārā; evaṃ addhuvā, bhikkhave, saṅkhārā…pe… alaṃ vimuccituṃ. ‘‘Etarahi kho pana, bhikkhave, imassa vepullassa pabbatassa ‘vepullo’tveva samaññā udapādi. Etarahi kho pana, bhikkhave, imesaṃ manussānaṃ ‘māgadhakā’tveva samaññā udapādi. Māgadhakānaṃ, bhikkhave, manussānaṃ appakaṃ āyuppamāṇaṃ parittaṃ lahukaṃ [lahusaṃ (sī.)]; yo ciraṃ jīvati so vassasataṃ appaṃ vā bhiyyo. Māgadhakā, bhikkhave, manussā vepullaṃ pabbataṃ muhuttena ārohanti muhuttena orohanti. Etarahi kho panāhaṃ, bhikkhave, arahaṃ sammāsambuddho loke uppanno. Mayhaṃ kho pana, bhikkhave, sāriputtamoggallānaṃ nāma sāvakayugaṃ aggaṃ bhaddayugaṃ. Bhavissati, bhikkhave, so samayo yā ayañcevimassa pabbatassa samaññā antaradhāyissati, ime ca manussā kālaṃ karissanti, ahañca parinibbāyissāmi. Evaṃ aniccā, bhikkhave, saṅkhārā; evaṃ addhuvā, bhikkhave, saṅkhārā; evaṃ anassāsikā, bhikkhave, saṅkhārā. Yāvañcidaṃ, bhikkhave, alameva sabbasaṅkhāresu nibbindituṃ, alaṃ virajjituṃ, alaṃ vimuccitu’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Pācīnavaṃso tivarānaṃ, rohitassāna vaṅkako; Suppiyānaṃ supassoti, māgadhānañca vepullo. ‘‘Aniccā vata saṅkhārā, uppādavayadhammino; Uppajjitvā nirujjhanti, tesaṃ vūpasamo sukho’’ti. dasamaṃ; Dutiyo vaggo. Tassuddānaṃ – Duggataṃ sukhitañceva, tiṃsa mātāpitena ca; Bhātā bhaginī putto ca, dhītā vepullapabbataṃ. ",
      "english": "On one occasion, the Blessed One was dwelling in Rājagaha, on Vulture Peak Mountain.\n\nThere, indeed, the Blessed One addressed the bhikkhus, \"Bhikkhus.\" \"Venerable Sir,\" those bhikkhus replied to the Blessed One. The Blessed One spoke thus:\n\n\"This Samsara, bhikkhus, is without discernible beginning. A first point is not known for beings hindered by ignorance and fettered by craving, who are transmigrating and wandering on.\n\nIn the past, bhikkhus, this Vepulla Mountain bore the name 'Pācīnavaṃsa'. And at that time, bhikkhus, humans bore the name 'Tivarā'. For those Tivarā humans, bhikkhus, the lifespan was forty thousand years. Those Tivarā humans, bhikkhus, ascended Pācīnavaṃsa Mountain in four days and descended in four days. And at that time, bhikkhus, the Blessed One Kakusandha, the Arahant, the Fully Awakened One, had appeared in the world. For the Blessed One Kakusandha, the Arahant, the Fully Awakened One, bhikkhus, there was a foremost and excellent pair of disciples named Vidhura and Sañjīva. See, bhikkhus, that name of this mountain has vanished, and those humans have passed away, and that Blessed One has attained final Nibbāna. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace, bhikkhus, are conditioned phenomena. This is enough, bhikkhus, for becoming disenchanted with all conditioned phenomena, for becoming dispassionate, for being liberated.\n\nIn the past, bhikkhus, this Vepulla Mountain bore the name 'Vaṅkaka'. And at that time, bhikkhus, humans bore the name 'Rohitassā'. For those Rohitassā humans, bhikkhus, the lifespan was thirty thousand years. Those Rohitassā humans, bhikkhus, ascended Vaṅkaka Mountain in three days and descended in three days. And at that time, bhikkhus, the Blessed One Koṇāgamana, the Arahant, the Fully Awakened One, had appeared in the world. For the Blessed One Koṇāgamana, the Arahant, the Fully Awakened One, bhikkhus, there was a foremost and excellent pair of disciples named Bhiyyosuttara. See, bhikkhus, that name of this mountain has vanished, and those humans have passed away, and that Blessed One has attained final Nibbāna. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace, bhikkhus, are conditioned phenomena. This is enough, bhikkhus, for becoming disenchanted with all conditioned phenomena, for becoming dispassionate, for being liberated.\n\nIn the past, bhikkhus, this Vepulla Mountain bore the name 'Supassa'. And at that time, bhikkhus, humans bore the name 'Suppiyā'. For those Suppiyā humans, bhikkhus, the lifespan was twenty thousand years. Those Suppiyā humans, bhikkhus, ascended Supassa Mountain in two days and descended in two days. And at that time, bhikkhus, the Blessed One Kassapa, the Arahant, the Fully Awakened One, had appeared in the world. For the Blessed One Kassapa, the Arahant, the Fully Awakened One, bhikkhus, there was a foremost and excellent pair of disciples named Tissa and Bhāradvāja. See, bhikkhus, that name of this mountain has vanished, and those humans have passed away, and that Blessed One has attained final Nibbāna. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace, bhikkhus, are conditioned phenomena. This is enough, bhikkhus, for becoming disenchanted with all conditioned phenomena, for becoming dispassionate, for being liberated.\n\nBut now, bhikkhus, this Vepulla Mountain bears the name 'Vepulla'. But now, bhikkhus, these humans bear the name 'Māgadhakā'. For these Māgadhakā humans, bhikkhus, the lifespan is short, meagre, and brief; one who lives long lives for a hundred years, or a little more. These Māgadhakā humans, bhikkhus, ascend Vepulla Mountain in a moment and descend in a moment. But now, bhikkhus, I, the Arahant, the Fully Awakened One, have appeared in the world. For me, bhikkhus, there is a foremost and excellent pair of disciples named Sāriputta and Moggallāna. There will come a time, bhikkhus, when the name of this mountain will disappear, and these humans will pass away, and I too will attain final Nibbāna. Thus impermanent, bhikkhus, are conditioned phenomena; thus unreliable, bhikkhus, are conditioned phenomena; thus without solace, bhikkhus, are conditioned phenomena. This is enough, bhikkhus, for becoming disenchanted with all conditioned phenomena, for becoming dispassionate, for being liberated.\"\n\nThis is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further spoke this:\n\nPācīnavaṃsa for the Tivarā, Vaṅkaka for the Rohitassā;\nSupassa for the Suppiyā, and Vepulla for the Māgadhakā.\nImpermanent, indeed, are conditioned phenomena,\nSubject to arising and vanishing.\nHaving arisen, they cease.\nTheir cessation is bliss.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජුකුළු පව්වෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා, “මහණෙනි”යි වදාළ සේක. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, මේ සංසාරය අතීත කෙළවරක් නොපෙනෙන්නා වූවකි. අවිද්‍යා නීවරණයෙන් වැසුණු, තණ්හා සංයෝජනයෙන් බැඳුණු සත්ත්වයන්ට (මේ සංසාරයේ) සැරිසරන විට පෙර කෙළවරක් නොපෙනේ. මහණෙනි, අතීතයේදී මේ වේපුල්ල පර්වතයට ‘ප්‍රාචීනවංශය’ යැයි නමක් පහළ විය. මහණෙනි, ඒ කාලයේදී මිනිසුන්ට ‘තිවර’ යැයි නමක් පහළ විය. මහණෙනි, තිවර නම් වූ ඒ මිනිසුන්ගේ ආයුෂ ප්‍රමාණය වර්ෂ හතළිස් දහසක් විය. මහණෙනි, තිවර නම් වූ ඒ මිනිස්සු ප්‍රාචීනවංශ පර්වතයට දින සතරකින් නඟිති, දින සතරකින් බසිති. මහණෙනි, ඒ කාලයේදී කකුසන්ධ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ ලෝකයේ පහළ වූ සේක. මහණෙනි, කකුසන්ධ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට විධුරසංජීව නම් අග්‍ර වූ ශ්‍රාවක යුවළක් සිටියහ. මහණෙනි, බලව, ඒ මේ පර්වතයේ නාමය අතුරුදහන් වී ඇත. ඒ මිනිස්සුද මිය පරලොව ගොස් ඇත. ඒ භාග්‍යවතුන් වහන්සේද පිරිනිවන් පා ඇත. මහණෙනි, සංස්කාරයෝ මෙසේ අනිත්‍යයහ; මහණෙනි, සංස්කාරයෝ මෙසේ අස්ථිරයහ; මහණෙනි, සංස්කාරයෝ මෙසේ පිහිටක් නැත්තාහ. මහණෙනි, සියලු සංස්කාරයන් කෙරෙහි කලකිරීමට, නොඇලීමට, (ඒවායින්) මිදීමට මෙය ප්‍රමාණවත් වන්නේය.\n\nමහණෙනි, අතීතයේදී මේ වේපුල්ල පර්වතයට ‘වංකක’ යැයි නමක් පහළ විය. මහණෙනි, ඒ කාලයේදී මිනිසුන්ට ‘රෝහිතස්ස’ යැයි නමක් පහළ විය. මහණෙනි, රෝහිතස්ස නම් වූ ඒ මිනිසුන්ගේ ආයුෂ ප්‍රමාණය වර්ෂ තිස් දහසක් විය. මහණෙනි, රෝහිතස්ස නම් වූ ඒ මිනිස්සු වංකක පර්වතයට දින තුනකින් නඟිති, දින තුනකින් බසිති. මහණෙනි, ඒ කාලයේදී කෝණාගමන භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ ලෝකයේ පහළ වූ සේක. මහණෙනි, කෝණාගමන භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට භිය්‍යෝසුත්තර නම් අග්‍ර වූ ශ්‍රාවක යුවළක් සිටියහ. මහණෙනි, බලව, ඒ මේ පර්වතයේ නාමය අතුරුදහන් වී ඇත. ඒ මිනිස්සුද මිය පරලොව ගොස් ඇත. ඒ භාග්‍යවතුන් වහන්සේද පිරිනිවන් පා ඇත. මහණෙනි, සංස්කාරයෝ මෙසේ අනිත්‍යයහ; මහණෙනි, සංස්කාරයෝ මෙසේ අස්ථිරයහ; මහණෙනි, සංස්කාරයෝ මෙසේ පිහිටක් නැත්තාහ. මහණෙනි, සියලු සංස්කාරයන් කෙරෙහි කලකිරීමට, නොඇලීමට, (ඒවායින්) මිදීමට මෙය ප්‍රමාණවත් වන්නේය.\n\nමහණෙනි, අතීතයේදී මේ වේපුල්ල පර්වතයට ‘සුපස්ස’ යැයි නමක් පහළ විය. මහණෙනි, ඒ කාලයේදී මිනිසුන්ට ‘සුප්පිය’ යැයි නමක් පහළ විය. මහණෙනි, සුප්පිය නම් වූ ඒ මිනිසුන්ගේ ආයුෂ ප්‍රමාණය වර්ෂ විසි දහසක් විය. මහණෙනි, සුප්පිය නම් වූ ඒ මිනිස්සු සුපස්ස පර්වතයට දින දෙකකින් නඟිති, දින දෙකකින් බසිති. මහණෙනි, ඒ කාලයේදී කස්සප භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ ලෝකයේ පහළ වූ සේක. මහණෙනි, කස්සප භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට තිස්සභාරද්වාජ නම් අග්‍ර වූ ශ්‍රාවක යුවළක් සිටියහ. මහණෙනි, බලව, ඒ මේ පර්වතයේ නාමය අතුරුදහන් වී ඇත. ඒ මිනිස්සුද මිය පරලොව ගොස් ඇත. ඒ භාග්‍යවතුන් වහන්සේද පිරිනිවන් පා ඇත. මහණෙනි, සංස්කාරයෝ මෙසේ අනිත්‍යයහ; මහණෙනි, සංස්කාරයෝ මෙසේ අස්ථිරයහ; මහණෙනි, සංස්කාරයෝ මෙසේ පිහිටක් නැත්තාහ. මහණෙනි, සියලු සංස්කාරයන් කෙරෙහි කලකිරීමට, නොඇලීමට, (ඒවායින්) මිදීමට මෙය ප්‍රමාණවත් වන්නේය.\n\nමහණෙනි, දැන් මේ වේපුල්ල පර්වතයට ‘වේපුල්ල’ යැයි නමක් පහළ විය. මහණෙනි, දැන් මේ මිනිසුන්ට ‘මාගධක’ යැයි නමක් පහළ විය. මහණෙනි, මාගධක නම් වූ මේ මිනිසුන්ගේ ආයුෂ ප්‍රමාණය ස්වල්පය, සුළුය, ලඝුය. යමෙක් දීර්ඝායුෂ වළඳයිද, හෙතෙම වර්ෂ සියයක් හෝ මීට මඳක් වැඩියෙන් ජීවත් වේ. මහණෙනි, මාගධක නම් වූ මේ මිනිස්සු වේපුල්ල පර්වතයට මොහොතකින් නඟිති, මොහොතකින් බසිති. මහණෙනි, දැන් මම අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ ලෙස ලෝකයේ පහළ වී සිටිමි. මහණෙනි, මටද සාරිපුත්ත මොග්ගල්ලාන නම් අග්‍ර වූ ශ්‍රාවක යුවළක් සිටිති. මහණෙනි, ඒ කාලය පැමිණෙන්නේය, යම් කලෙක මේ පර්වතයේ නාමය අතුරුදහන් වන්නේද, මේ මිනිස්සුද මිය පරලොව යන්නාහුද, මමද පිරිනිවන් පාන්නාහුද යනුවෙනි. මහණෙනි, සංස්කාරයෝ මෙසේ අනිත්‍යයහ; මහණෙනි, සංස්කාරයෝ මෙසේ අස්ථිරයහ; මහණෙනි, සංස්කාරයෝ මෙසේ පිහිටක් නැත්තාහ. මහණෙනි, සියලු සංස්කාරයන් කෙරෙහි කලකිරීමට, නොඇලීමට, (ඒවායින්) මිදීමට මෙය ප්‍රමාණවත් වන්නේය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාළ සුගතවූ ශාස්තෘන් වහන්සේ තවදුරටත් මෙය වදාළ සේක:\n\nතිවර නම් මිනිසුන්ට ප්‍රාචීනවංශ පර්වතය විය, රෝහිතස්ස නම් මිනිසුන්ට වංකක පර්වතය විය;\nසුප්පිය නම් මිනිසුන්ට සුපස්ස පර්වතය විය, මාගධක නම් මිනිසුන්ට වේපුල්ල පර්වතය විය.\nඅහෝ, සංස්කාරයෝ අනිත්‍යයහ, හටගැනීමේ හා නැසී යාමේ ස්වභාව ඇත්තාහ;\nහටගෙන නැතිවී යන්නාහ. ඔවුන්ගේ සන්සිඳීම සුවයකි.",
      "paliTitle": "Vepullapabbatasuttaṃ",
      "englishTitle": "The Discourse on Mount Vepulla",
      "sinhalaTitle": "වේපුල්ලපබ්බත සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Anamataggasaṃyuttaṃ samattaṃ.",
    "english": "The Linked Discourses on the Unthinkable Beginning is complete.",
    "sinhala": "අනමතග්ග සංයුක්තය සමාප්තයි."
  }
}