{
  "id": "sn.2.8",
  "title": {
    "pali": "Lakkhaṇasaṃyuttaṃ",
    "english": "The Connected Discourses on Characteristics",
    "sinhala": "ලක්ඛණ සංයුත්තය."
  },
  "sections": [
    {
      "number": 202,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ca lakkhaṇo āyasmā ca mahāmoggallāno [mahāmoggalāno (ka.)] gijjhakūṭe pabbate viharanti. Atha kho āyasmā mahāmoggallāno pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yenāyasmā lakkhaṇo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ lakkhaṇaṃ etadavoca – ‘‘āyāmāvuso [ehi āvuso (syā. kaṃ. ka.)] lakkhaṇa, rājagahaṃ piṇḍāya pavisissāmā’’ti. ‘‘Evamāvuso’’ti kho āyasmā lakkhaṇo āyasmato mahāmoggallānassa paccassosi. Atha kho āyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi. Atha kho āyasmā lakkhaṇo āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘ko nu kho, āvuso moggallāna, hetu ko paccayo sitassa pātukammāyā’’ti? ‘‘Akālo kho, āvuso lakkhaṇa, etassa pañhassa. Bhagavato maṃ santike etaṃ pañhaṃ pucchā’’ti. Atha kho āyasmā ca lakkhaṇo āyasmā ca mahāmoggallāno rājagahe piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā lakkhaṇo āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘idhāyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi. Ko nu kho, āvuso moggallāna, hetu ko paccayo sitassa pātukammāyā’’ti? ‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ aṭṭhikasaṅkhalikaṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā phāsuḷantarikāhi vitudenti vitacchenti virājenti [vitudenti (sī.), vitacchenti vibhajenti (pī. ka.)]. Sā sudaṃ aṭṭassaraṃ karoti. Tassa mayhaṃ, āvuso, etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Evarūpopi nāma satto bhavissati! Evarūpopi nāma yakkho bhavissati! Evarūpopi nāma attabhāvapaṭilābho bhavissatī’’’ti!! Atha kho bhagavā bhikkhū āmantesi – ‘‘cakkhubhūtā vata, bhikkhave, sāvakā viharanti; ñāṇabhūtā vata, bhikkhave, sāvakā viharanti, yatra hi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissati. Pubbeva me so, bhikkhave, satto diṭṭho ahosi, api cāhaṃ na byākāsiṃ. Ahañcetaṃ [ahamevetaṃ (sī.)] byākareyyaṃ, pare ca me [pare me (sī.)] na saddaheyyuṃ. Ye me na saddaheyyuṃ, tesaṃ taṃ assa dīgharattaṃ ahitāya dukkhāya. Eso, bhikkhave, satto imasmiṃyeva rājagahe goghātako ahosi. So tassa kammassa vipākena bahūni vassāni bahūni vassasatāni bahūni vassasahassāni bahūni vassasatasahassāni niraye paccitvā tasseva kammassa vipākāvasesena evarūpaṃ attabhāvapaṭilābhaṃ paṭisaṃvedayatī’’ti. (Sabbesaṃ suttantānaṃ eseva peyyālo). Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion, the Blessed One was staying near Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. Now, at that time, the Venerable Lakkhaṇa and the Venerable Mahāmoggallāna were staying on Vulture Peak Mountain.\n\nThen, the Venerable Mahāmoggallāna, having dressed in the forenoon, and taking his bowl and robes, approached the Venerable Lakkhaṇa. Having approached, he said to the Venerable Lakkhaṇa: \"Come, friend Lakkhaṇa, let us enter Rājagaha for alms.\"\n\n\"Yes, friend,\" replied the Venerable Lakkhaṇa to the Venerable Mahāmoggallāna.\n\nThen, as the Venerable Mahāmoggallāna was descending from Vulture Peak Mountain, he produced a smile at a certain spot.\n\nThen the Venerable Lakkhaṇa said to the Venerable Mahāmoggallāna: \"What, friend Moggallāna, is the reason, what is the cause for the appearance of that smile?\"\n\n\"This is not the time for this question, friend Lakkhaṇa. Ask me this question in the presence of the Blessed One.\"\n\nThen, the Venerable Lakkhaṇa and the Venerable Mahāmoggallāna, having walked for alms in Rājagaha and returned from their alms round after their meal, approached the Blessed One. Having approached, they respectfully bowed to the Blessed One and sat down to one side. Seated to one side, the Venerable Lakkhaṇa then said to the Venerable Mahāmoggallāna: \"Just now, friend Mahāmoggallāna, as you were descending from Vulture Peak Mountain, you produced a smile at a certain spot. What, friend Moggallāna, is the reason, what is the cause for the appearance of that smile?\"\n\n\"Here, friend, as I was descending from Vulture Peak Mountain, I saw a skeletal chain moving through the air. Vultures, crows, and hawks pursued it again and again, tearing at it, stripping it, and rending it through the spaces between its ribs. And that being uttered a painful sound. Then, friend, this thought occurred to me: ‘Wonderful indeed, sirs! Amazing indeed, sirs! Such a being exists! Such a demonic being exists! Such an acquisition of an individual existence exists!'\"\n\nThen the Blessed One addressed the monastics: \"Truly, monastics, these disciples dwell endowed with the Eye of Knowledge; truly, monastics, these disciples dwell endowed with wisdom, in that a disciple can know, see, or directly witness such a thing. That being, monastics, was seen by me earlier, but I did not speak of it. If I were to speak of it, others would not believe me. For those who would not believe me, it would be for their prolonged harm and suffering. That being, monastics, was a cow slaughterer right here in Rājagaha. As a result of that action, having been tormented in hell for many years, many hundreds of years, many thousands of years, many hundreds of thousands of years, he now experiences the acquisition of such a form of existence as the residual result of that same action.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදි—එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් කළඳක නිවසේ වැඩවසන සේක.\n\nඒ.‍කාළයේදී ආයුෂ්මත් ලක්ෂණ තෙරුන් වහන්සේත්, ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේත් ගිජ්ඣකූට පර්වතයේ වැඩවසති. ඉක්බිති ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන, යම් තැනක ආයුෂ්මත් ලක්ෂණ තෙරුන් වහන්සේ වැඩසිටිත්ද, එතැනට වැඩිසේක; පැමිණ, ආයුෂ්මත් ලක්ෂණ තෙරුන් වහන්සේට මෙය වදාළ සේක: “ආයුෂ්මත් ලක්ෂණයනි, අපි යමු, රජගහ නුවරට පිඬු සිඟා වඩිමු.” “එසේය, ආයුෂ්මත්” යි ආයුෂ්මත් ලක්ෂණ තෙරුන් වහන්සේ ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේට පිළිතුරු දුන් සේක. ඉක්බිති ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේ ගිජ්ඣකූට පර්වතයෙන් බසින අතර, එක්තරා ස්ථානයකදී මඳ සිනාවක් පහළ කළ සේක. ඉක්බිති ආයුෂ්මත් ලක්ෂණ තෙරුන් වහන්සේ ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේට මෙය වදාළ සේක: “ආයුෂ්මත් මොග්ගල්ලානයනි, මඳ සිනාව පහළ කිරීමට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?” “ආයුෂ්මත් ලක්ෂණයනි, මේ ප්‍රශ්නය ඇසීමට මේ වේලාව සුදුසු නොවේ. භාග්‍යවතුන් වහන්සේ සමීපයේදී මාගෙන් මේ ප්‍රශ්නය අසන්න”යි වදාළ සේක.\n\nඉක්බිති ආයුෂ්මත් ලක්ෂණ තෙරුන් වහන්සේත් ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේත් රජගහ නුවර පිඬු සිඟා වඩාරා, දන් වළඳා අවසන් වූ පසු, යම් තැනක භාග්‍යවතුන් වහන්සේ වැඩසිටිත්ද, එතැනට පැමිණි සේක; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ එකත්පස්ව වාඩි වූ සේක. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් ලක්ෂණ තෙරුන් වහන්සේ ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේට මෙසේ වදාළ සේක: “ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරුන් වහන්සේ ගිජ්ඣකූට පර්වතයෙන් බසින අතර, එක්තරා ස්ථානයකදී මඳ සිනාවක් පහළ කළ සේක. ආයුෂ්මත් මොග්ගල්ලානයනි, මඳ සිනාව පහළ කිරීමට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?”\n\n“ආයුෂ්මත්, මෙහිදී මම ගිජ්ඣකූට පර්වතයෙන් බසින අතර, අහසේ ගමන් කරන ඇටසැකිල්ලක් දුටුවෙමි. ඒ ඇටසැකිල්ල පසුපස ගිජුලිහිණියෝද, කපුටෝද, උකුස්සෝද හඹා ගොස්, හඹා ගොස්, ඉළ ඇට අතරින් විද විද, කඩාගෙන, විසුරුවා හරිනු ලබති. එම ප්‍රේතයා (ඇටසැකිල්ල) දුක්බර හඬක් නගයි. ආයුෂ්මත්, එවිට මට මෙසේ සිතුණි: ‘අහෝ ආශ්චර්යයකි! අහෝ පුදුමයකි! මෙබඳු සත්වයෙක් ද වන්නේය! මෙබඳු යක්ෂයෙක් ද වන්නේය! මෙබඳු ආත්මභාවයක් ලැබීමක් ද වන්නේය!’”\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, ශ්‍රාවකයෝ සැබවින්ම චක්ෂුස් බවට පත්ව සිටිති; මහණෙනි, ශ්‍රාවකයෝ සැබවින්ම ඥානය බවට පත්ව සිටිති. යම් හෙයකින් ශ්‍රාවකයෙක් මෙබඳු දෙයක් දැන ගනීද, දකීද, නැතහොත් එයට සාක්ෂි දෙයිද. මහණෙනි, ඒ සත්වයා කලින්ම මා විසින් දකින ලදී. එසේ වුවත් මම එය ප්‍රකාශ නොකළෙමි. මම එය ප්‍රකාශ කළා නම්, අන්‍යයෝ මාගේ වචනය විශ්වාස නොකරන්නට ඉඩ තිබුණි. යම් අයෙක් මාගේ වචනය විශ්වාස නොකරත්ද, එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක පිණිසත් වන්නේය. මහණෙනි, මේ සත්වයා මේ රජගහ නුවරදීම ගව ඝාතකයෙක්ව සිටියේය. හෙතෙම ඒ කර්ම විපාකයෙන් බොහෝ වසර, බොහෝ සිය ගණන් වසර, බොහෝ දහස් ගණන් වසර, බොහෝ ලක්ෂ ගණන් වසර නිරයේ පැසී, ඒ කර්මයේම විපාකාවශේෂය නිසා මෙබඳු ආත්මභාවයක් ලැබීම අත්විඳියි.”",
      "paliTitle": "Aṭṭhisuttaṃ",
      "vagga": "Paṭhamavaggo",
      "englishTitle": "The Skeleton Sutta",
      "sinhalaTitle": "අට්ඨි සූත්‍රය",
      "vaggaEnglish": "First Chapter",
      "vaggaSinhala": "පළමු වර්ගය"
    },
    {
      "number": 203,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ maṃsapesiṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti [virājenti (sī. syā. kaṃ.), vibhajenti (pī. ka.)]. Sā sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe goghātako ahosi…pe…. Dutiyaṃ.",
      "english": "“Here, friends, as I was descending from Vulture Peak Mountain, I saw a mass of flesh moving through the air. Vultures, crows, and hawks were repeatedly flying after it, chasing it and tearing it apart and scattering it. That being was indeed making a dreadful sound... That being, O monks, was a cattle slaughterer right here in Rājagaha, [and is now experiencing the karmic result of that action]. This is the second account.",
      "sinhala": "ආයුෂ්මතුනි, මම මෙහි ගිජ්ඣකූට පර්වතයෙන් බැස යමින් සිටියදී, අහසින් ගමන් කරමින් තිබූ මස් පිඬක් දුටුවෙමි. ගිජුලිහිණියෝද, කපුටෝද, උකුස්සෝද එය ලුහුබැඳ ගොස් නැවත නැවත ඉරා දමමින්, විසුරුවා දමමින් සිටියහ. ඒ (සත්ත්වයා) මහත් ශෝකී ස්වරයෙන් හඬ නඟයි... (පෙය්‍යාලය)... මහණෙනි, ඒ සත්ත්වයා මේ රාජග්‍රිහයෙහිම ගව ඝාතකයෙක්ව සිටියේය... (පෙය්‍යාලය)... දෙවැන්නයි.",
      "paliTitle": "Pesisuttaṃ",
      "englishTitle": "The Discourse on the Piece of Meat",
      "sinhalaTitle": "පේසි සූත්‍රය"
    },
    {
      "number": 204,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ maṃsapiṇḍaṃ vehāsaṃ gacchantaṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sākuṇiko ahosi…pe…. Tatiyaṃ.",
      "english": "“Here, companions, as I was descending from Vulture’s Peak mountain, I saw a lump of flesh moving through the air. Vultures, crows, and hawks repeatedly chased after it, tearing it apart and scattering it. That being cried out in a loud, painful voice... This being, O monks, was a fowler right here in Rājagaha... The third.",
      "sinhala": "ඇවැත්නි, මම මෙහි ගිජ්ඣකූට පර්වතයෙන් බසින අතරේ, අහසින් යන මාංශ පිඬක් දුටුවෙමි. උන් එය පසුපස හඹා යමින්, උකුස්සෝද, කපුටෝද, ගිජුලිහිණියෝද නැවත නැවතත් එලවමින් එය ඉරා දමා විසුරුවා හරියෝය. එය දුක්මුසු හඬින් කෑ ගැසීය... පින්වත් මහණෙනි, ඒ සත්වයා මේ රාජග්‍රහ නුවරම කුරුළු දඩයම්කරුවෙක්ව සිටියේය... මේ තෙවැනි කතාවයි.",
      "paliTitle": "Piṇḍasuttaṃ",
      "englishTitle": "The Discourse on Almsfood",
      "sinhalaTitle": "පිණ්ඩ සූත්‍රය"
    },
    {
      "number": 205,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ nicchaviṃ purisaṃ vehāsaṃ gacchantaṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe orabbhiko ahosi…pe…. Catutthaṃ.",
      "english": "“Just now, friend, as I was descending from Vulture Peak Mountain, I saw a man without skin moving through the air. Vultures, crows, and kites repeatedly pursued him, tearing him apart and shredding him. And he was making a terrible, agonizing sound…\n\nThat being, monks, was, right here in Rājagaha, formerly a sheep butcher… This is the fourth instance.”",
      "sinhala": "ආයුෂ්මතුනි, මම මෙහි ගිජුකුළු පර්වතයෙන් බැස එන අතරතුර සමක් නැති මිනිසෙක් අහසින් ගමන් කරනු දුටුවෙමි. ගිජුලිහිණියෝද, කපුටෝද, උකුස්සෝද ඔහු පසුපස ලුහුබැඳ ගොස් ලුහුබැඳ ගොස් ඔහුගේ මාංශ ඉරා දමමින්, උදුරා දමමින් සිටියහ. හෙතෙම මහත් වූ දුක්ඛිත හඬක් නගමින් සිටියේය. මහණෙනි, මේ සත්ත්වයා මේ රාජග්‍රහයෙහිම බැටළු ඝාතකයෙක්ව සිටියේය. මෙය සතරවෙනි කථාවයි.",
      "paliTitle": "Nicchavisuttaṃ",
      "englishTitle": "The Skinless Sutta",
      "sinhalaTitle": "නිච්ඡවි සූත්‍රය"
    },
    {
      "number": 206,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ asilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa te asī uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sūkariko ahosi…pe…. Pañcamaṃ.",
      "english": "“Here, venerable sirs, as I was descending from Vulture Peak Mountain, I saw a man with razor-blades for hairs flying through the air. Those swords flew up repeatedly and struck down upon his very body. Indeed, that man uttered a cry of acute distress… This being, O monks, was a pig butcher right here in Rājagaha…”",
      "sinhala": "ආයුෂ්මත්නි, මම ගිජ්ඣකූට පර්වතයෙන් බැස යමින් සිටියදී, අහසෙහි ගමන් කරන කඩුමය කෙස් ඇති පුරුෂයෙකු දුටුවෙමි. ඔහුගේ ඒ කඩු, නැවත නැවත ඉහළට පැන නැගී ඔහුගේම ශරීරය මත පතිත වේ. හෙතෙම මහත් ආර්තව හඬක් නිකුත් කරයි... (ඉතිරි කොටස)... මහණෙනි, මේ සත්ත්වයා මේ රාජග්‍රහ නගරයේම ඌරන් මරන්නෙක් විය... (ඉතිරි කොටස)... පස්වැනි (කතාව) යි.",
      "paliTitle": "Asilomasuttaṃ",
      "englishTitle": "The Sword-Haired Sutta",
      "sinhalaTitle": "අසිලෝම සූත්‍රය"
    },
    {
      "number": 207,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sattilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa tā sattiyo uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti… pe… eso, bhikkhave, satto imasmiṃyeva rājagahe māgaviko ahosi…pe…. Chaṭṭhaṃ.",
      "english": "“Friends, as I was descending from Vulture Peak Mountain here, I saw a man whose body was composed of darts moving through the air. Those very darts would rise up repeatedly and then fall down upon his own body. And he was crying out in terrible distress... This being, O monks, was a gamekeeper right here in Rājagaha... The Sixth.”",
      "sinhala": "ආයුෂ්මතුනි, මම මෙහි ගිජ්බකූට පර්වතයෙන් බසින අතර, අහසේ ගමන් කරන, හෙල්ල ලෝම ඇති පුරුෂයෙක් දුටුවෙමි. ඔහුගේ ඒ හෙල්ල ලෝම නැවත නැවත ඉහළ නැගී ගොස් ඔහුගේම කය මත වැටෙයි. හෙතෙම මහත් විලාප හඬක් නඟයි... (විස්තරය මඟහැරේ)... මහණෙනි, මේ සත්ත්වයා මේ රාජග්‍රහ නුවරම මුව දඩයම්කරුවෙක්ව සිටියේය... (විස්තරය මඟහැරේ).... මෙය සයවැනියයි.",
      "paliTitle": "Sattisuttaṃ",
      "englishTitle": "The Discourse on the Spear",
      "sinhalaTitle": "සත්ති සූත්‍රය"
    },
    {
      "number": 208,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ usulomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa te usū uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe kāraṇiko ahosi…pe…. Sattamaṃ.",
      "english": "“Here, friends, as I was descending from Vulture Peak mountain, I saw a man whose body was like arrows, traveling through the air. Those arrows repeatedly flew up and then fell back down upon his very body. He was making a cry of anguish... This being, O monks, was formerly an executioner right here in Rājagaha... The seventh [account] is complete.”",
      "sinhala": "ආයුෂ්මතුනි, මම මෙහි ගිජ්ඣකූට පර්වතයෙන් බසිමින් සිටියදී අහසේ ගමන් කරන, ඊතල රෝම ඇති පුරුෂයෙක් දුටුවෙමි. ඔහුගේ ඒ ඊතල නැවත නැවත ඉහළට පැන නැඟී ඔහුගේම ශරීරය මතට පතිත විය. ඔහු දැඩි විලාප හඬක් නැඟුවේය. මහණෙනි, මේ සත්ත්වයා මේ රාජග්‍රහ නුවරම කාරණිකයෙක්ව සිටියේය. (සත්වන කොටසයි.)",
      "paliTitle": "Usulomasuttaṃ",
      "englishTitle": "The Discourse on Needle-Haired Beings",
      "sinhalaTitle": "උසුලෝම සූත්‍රය"
    },
    {
      "number": 209,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sūcilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa tā sūciyo uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti… pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sūto [sārathiko (ka. vinayepi)] ahosi…pe…. Aṭṭhamaṃ.",
      "english": "Here, friends, as I was descending from Gijjhakūṭa Mountain, I saw a man whose hair was like needles, moving through the air. Those needles would fly up repeatedly and then fall down upon that very body of his. He let out a painful cry. This being, O monks, was formerly a charioteer right here in Rājagaha. This is the eighth account.",
      "sinhala": "ඇවැත්නි, මා මෙහි ගිජුකුළු පර්වතයෙන් බසිමින් සිටියදී අහසේ යමින් සිටිනා සූචිලෝම නම් පුරුෂයෙක් දුටුවෙමි. ඔහුගේ ඒ ඉඳිකටු (සමාන ලොම්) නැගී නැගී ඔහුගේම ශරීරය මත පතිත වේ. හෙතෙම මහත් වේදනාත්මක වූ කෑගැසීමක් කරයි... (පෙය්‍යාළය)... මහණෙනි, ඒ සත්වයා මේ රාජග්‍රහ නුවරම සාරථිකයෙක් (රියදුරෙක්) වී සිටියේය... (පෙය්‍යාළය).... මෙය අටවැන්නයි.",
      "paliTitle": "Sūcilomasuttaṃ",
      "englishTitle": "Sūciloma Sutta",
      "sinhalaTitle": "සූචිලෝම සූත්‍රය"
    },
    {
      "number": 210,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sūcilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa tā sūciyo sīse pavisitvā mukhato nikkhamanti; mukhe pavisitvā urato nikkhamanti; ure pavisitvā udarato nikkhamanti; udare pavisitvā ūrūhi nikkhamanti; ūrūsu pavisitvā jaṅghāhi nikkhamanti; jaṅghāsu pavisitvā pādehi nikkhamanti; so sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sūcako ahosi…pe…. Navamaṃ.",
      "english": "Here, friends, as I was descending from Vulture Peak Mountain, I saw a needle-haired being traveling through the air. Those needles, having entered his head, came out through his mouth; having entered the mouth, came out through the chest; having entered the chest, came out through the abdomen; having entered the abdomen, came out through the thighs; having entered the thighs, came out through the shins; and having entered the shins, came out through the feet. Moreover, he was making a grievous sound. Monks, that being was a malicious informer right here in Rājagaha.",
      "sinhala": "ඇවැත්නි, මෙහි දී මම ගිජ්ඣකූට පර්වතයෙන් බසිමින් සිටින විට, අහසින් යන කටු-ලෝම ඇති පුරුෂයෙකුව දුටුවෙමි.\n\nඔහුගේ ඒ ඉඳිකටු හිසට ඇතුළු වී මුඛයෙන් පිටව යයි; මුඛයට ඇතුළු වී උරස් තලයෙන් පිටව යයි; උරස් තලයට ඇතුළු වී උදරයෙන් පිටව යයි; උදරයට ඇතුළු වී කලවා වලින් පිටව යයි; කලවා වලට ඇතුළු වී කෙණ්ඩිවලින් පිටව යයි; කෙණ්ඩිවලට ඇතුළු වී පාදවලින් පිටව යයි. හෙතෙම මහත් වූ දුක් සහිත ශබ්දයක් නගයි...\n\n...භික්ෂූන් වහන්ස, මේ සත්වයා රාජග්‍රහ නුවරම කේලාම් කීමේ (සූචක) කර්ම කළ පුද්ගලයෙකි... නවවෙනි කතාව නිමි.",
      "paliTitle": "Dutiyasūcilomasuttaṃ",
      "englishTitle": "Second Sutta with Sūciloma",
      "sinhalaTitle": "දුතිය සූචිලෝම සූත්‍රය"
    },
    {
      "number": 211,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ kumbhaṇḍaṃ purisaṃ vehāsaṃ gacchantaṃ. So gacchantopi teva aṇḍe khandhe āropetvā gacchati. Nisīdantopi tesveva aṇḍesu nisīdati. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe gāmakūṭako ahosi…pe…. Dasamaṃ. Paṭhamo vaggo. Tassuddānaṃ – Aṭṭhi pesi ubho gāvaghātakā, Piṇḍo sākuṇiyo nicchavorabbhi; Asi sūkariko sattimāgavi, Usu kāraṇiko sūci sārathi; Yo ca sibbiyati sūcako hi so, Aṇḍabhāri ahu gāmakūṭakoti.",
      "english": "“Friends, as I was descending from Vulture Peak Mountain here, I saw a man bearing heavy burdens moving through the air. Even when walking, he walked carrying those masses placed upon his shoulders. Even when sitting, he sat upon those very masses. Vultures, crows, and kites repeatedly followed him, tearing at him and utterly devouring him. He was making a grievous sound…\n\nThat being, O monks, was a village corruptor right here in Rājagaha…\n\nThis is the Tenth story. This completes the First Section. Its summary is: Bone, flesh, and both cattle-slayers; Piṇḍa, the bird-catcher, Nicchavī, the sheep-slayer; Sword, the pig-butcher, Satti, the buffalo-slayer; Arrow, the executioner, the needle, the charioteer; He who sews is the sewer; the one carrying the burdens was the village corruptor.",
      "sinhala": "ආයුෂ්මතුන් වහන්ස, මම මෙහි ගිජුකුළ්‍පව්වෙන් බසින විට අහසින් යන කුම්භාණ්ඩ පුරුෂයෙකු දුටුවෙමි. යන විටත් ඔහු ඒම අණ්ඩ (වෘෂණ) ඔහුගේ කර මත තබාගෙන යයි. වාඩිවන විටත් ඒම අණ්ඩ මතම වාඩිවේ. ඔහුව උකුස්සන්, කපුටන් සහ සැහැල්ලූ පක්‍ෂීන් නැවත නැවතත් ලුහුබැඳ ගොස් විදාරණය කරමින් විසුරුවා හරී. ඔහු දුක්ඛිත හඬක් නැඟුවේය... භික්ෂූනි, මේ සත්ත්වයා මේ රාජග්‍රහ නුවරම ගාමකූටක නම් ගම්ද්‍රෝහියෙකු විය... මේ අනුව.\n\nදසවැනිය. පළමු වන වර්ගයයි.\nඑහි උද්දානය (සංග්‍රහය) මෙසේය –\nඇටය, මස් පිඩ, ගව ඝාතකයන් දෙදෙනා, පිඩ (මස් පිඩ), කුරුළු දඩයක්කාරයා, අතහැර දැමූ බැටළු පැටවා; අසිපත, ඌරු මස් වෙළෙන්දා, සත්තියෙන් (හිරිකඩ/හෙල්ලෙන්) ගව ඝාතකයා, ඊතලය, කරණිකා (වධකයෙක්/දඬුවම් දෙන්නා), ඉඳිකටු රියදුරු; යමෙක් මහන ලද්දේද ඔහු සූචකයෙක්ම (මැහුම්කරුවෙක්) විය, අණ්ඩ භාරය දැරූ තැනැත්තා ගාමකූටක නම් ගම්ද්‍රෝහියා විය.",
      "paliTitle": "Kumbhaṇḍasuttaṃ",
      "englishTitle": "The Kumbhaṇḍa Spirit Sutta",
      "sinhalaTitle": "කුම්භණ්ඩ සූත්‍රය"
    },
    {
      "number": 212,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ rājagahe veḷuvane. ‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ purisaṃ gūthakūpe sasīsakaṃ nimuggaṃ…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe pāradāriko ahosi…pe…. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion, at Rājagaha, in the Bamboo Grove.\n\n\"Friends, as I was descending from Vultures' Peak Mountain here, I saw a man plunged head-first into a mound of filth... Monks, that being was an adulterer right here in Rājagaha...\" This is the first discourse.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි රජගහ නුවර වේළුවනාරාමයෙහි වැඩසිටි සේක.\n\n‘‘ආයුෂ්මතුනි, මම මෙහි ගිජ්ඣකූට පර්වතයෙන් බසින අතර, හිසද සහිතව අසූචි වළක ගිලී සිටින පුරුෂයෙකු දුටුවෙමි...පෙ.... මහණෙනි, ඒ සත්ත්වයා මේ රජගහ නුවරම අනුන්ගේ භාර්යාවන් හා සම්බන්ධ වූ (පරදාර සේවනයේ යෙදුණු) අයෙක් විය...පෙ.... මෙය පළමුවැන්නයි.",
      "paliTitle": "Sasīsakasuttaṃ",
      "vagga": "Dutiyavaggo",
      "englishTitle": "The Discourse on the One with a Wound on the Head",
      "sinhalaTitle": "සසීසක සූත්‍රය",
      "vaggaEnglish": "Second Chapter",
      "vaggaSinhala": "දෙවන වර්ගය"
    },
    {
      "number": 213,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ purisaṃ gūthakūpe nimuggaṃ ubhohi hatthehi gūthaṃ khādantaṃ…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe duṭṭhabrāhmaṇo ahosi. So kassapassa sammāsambuddhassa pāvacane bhikkhusaṅghaṃ bhattena nimantetvā doṇiyo [doṇiyā (syā. kaṃ. pī. ka.)] gūthassa pūrāpetvā etadavoca – aho bhonto, yāvadatthaṃ bhuñjantu ceva harantu cāti…pe…. Dutiyaṃ.",
      "english": "Here, friends, as I was descending Vulture Peak Mountain, I saw a man sunk in a pit of excrement, eating the excrement with both hands, and so forth. Monks, that being was a wicked brahmin right here in Rājagaha. He, in the dispensation of Kassapa, the Fully Enlightened Buddha, having invited the community of monks for a meal, had vessels filled with excrement and addressed them, saying: \"Sirs, eat and take away as much as you desire.\"\n\nThe second instance.",
      "sinhala": "ආයුෂ්මතුන් වහන්ස, මා ගිජුකුළුවත කන්දෙන් බසින විට, මෙහිදී මම පුරුෂයෙකු දුටුවෙමි, ඔහු අත් දෙකෙන්ම අසූචි අනුභව කරමින් අසූචි වළක ගිලී සිටියේය. මහණෙනි, මේ සත්ත්වයා මේ රාජග්‍රිහයෙහිම සිටි දුෂ්ට බ්‍රාහ්මණයෙක් විය. ඒ බ්‍රාහ්මණයා කස්සප සම්මාසම්බුදුරජාණන් වහන්සේගේ ශාසනයෙහි භික්ෂුසංඝයා වහන්සේට දානයක් සඳහා ආරාධනා කොට, අසූචිවලින් දෝණි පුරවා මෙසේ කීවේය: 'අහෝ භවත්නි, ඔබලා කැමති තරම් අනුභව කරව්, රැගෙන යවව්' යි කීවේය. මෙය දෙවැනි විස්තරයයි.",
      "paliTitle": "Gūthakhādasuttaṃ",
      "englishTitle": "The Dung-Eater Sutta",
      "sinhalaTitle": "ගූථඛාද සූත්‍රය"
    },
    {
      "number": 214,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ nicchaviṃ itthiṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karoti…pe… esā, bhikkhave, itthī imasmiṃyeva rājagahe aticārinī ahosi…pe…. Tatiyaṃ.",
      "english": "“Friends, as I was descending from Vulture Peak Mountain here, I saw a woman stripped of her skin moving through the air. Vultures, crows, and hawks repeatedly followed after her, tearing her apart and mutilating her. She indeed made a painful cry... This woman, O monks, was an adulteress right here in Rājagaha.... This is the third account.",
      "sinhala": "ආයුෂ්මතුන් වහන්ස, මම මෙහිදී ගිජ්ඣකූට පර්වතයෙන් බසින විට, අහසින් ගමන් කරන, සම නැති ස්ත්‍රියක් දුටුවෙමි. ගිජුලිහිණියෝ ද, කපුටෝ ද, උකුස්සෝ ද ඈ පසුපසින් එළවා එළවා, ඈව ඉරා දමමින් විනාශ කරමින් සිටියහ. ඈ මහත් ශෝකජනක හඬින් විලාප තලමින් සිටියාය. මහණෙනි, මේ ස්ත්‍රිය මේ රජගහ නුවරම කාමයේ වරදවා හැසිරුණ තැනැත්තියක් වූවාය.",
      "paliTitle": "Nicchavitthisuttaṃ",
      "englishTitle": "The Skinless Woman Sutta",
      "sinhalaTitle": "නිච්ඡවිත්ථි සූත්‍රය"
    },
    {
      "number": 215,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ itthiṃ duggandhaṃ maṅguliṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karoti…pe… esā, bhikkhave, itthī imasmiṃyeva rājagahe ikkhaṇikā ahosi…pe…. Catutthaṃ.",
      "english": "Just now, friend, descending from Vulture Peak Mountain, I saw a foul-smelling, repulsive woman traveling through the air. Vultures, crows, and falcons followed after her repeatedly, tearing her apart and scattering her remains. She was indeed making a piteous cry...\n\n    ...This woman, O monks, was a fortune-teller right here in Rājagaha...\n\n    The Fourth.",
      "sinhala": "ආයුෂ්මතුනි, මෙහිදී මම ගිජුකුළු පර්වතයෙන් බැස යද්දී, දුර්ගන්ධයෙන් යුක්තව, පිළිකුල් සහිතව අහසින් ගමන් කරන්නාවූ ස්ත්‍රියක් දුටුවෙමි. ඇය පසුපස ගිජුලිහිණියෝද, කපුටෝද, උකුස්සෝද නැවත නැවතත් ලුහුබැඳ යමින්, ඇය ඉරා දමමින්, විසුරුවා හරින ලදි. ඇය ඉතාමත් දුක්ඛිත හඬක් නගන්නීය...පෙ.... මහණෙනි, මේ ස්ත්‍රිය මේ රාජග්‍රහ නුවරම වාසය කළ පේන කියන්නියක් වූවාය....පෙ.... (මෙය) සතරවැනියාය.",
      "paliTitle": "Maṅgulitthisuttaṃ",
      "englishTitle": "The Deformed Woman Sutta",
      "sinhalaTitle": "මංගුලිත්ථි සූත්‍රය"
    },
    {
      "number": 216,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ itthiṃ uppakkaṃ okiliniṃ okiriniṃ vehāsaṃ gacchantiṃ. Sā sudaṃ aṭṭassaraṃ karoti…pe… esā, bhikkhave, itthī kaliṅgassa rañño aggamahesī ahosi. Sā issāpakatā sapattiṃ aṅgārakaṭāhena okiri…pe…. Pañcamaṃ.",
      "english": "Here, friends, while I was descending from Vulture Peak Mountain, I saw a woman who was inflamed, covered in filth and debris, and moving through the air. She was constantly uttering a distressed cry. This woman, O monastics, was the chief queen of the King of Kaliṅga. She, overcome by jealousy, threw a pot of hot embers over her co-wife.",
      "sinhala": "ආයුෂ්මතුනි, මෙහිදී මම ගිජ්ඣකූට පර්වතයෙන් බසිද්දී, පිපුනු, අපිරිසිදුකම්වලින් වැසුණු, විසුරුවා හරින ලද, අහසින් යන්නාවූ ස්ත්‍රියක් දුටුවෙමි. ඇය ඒකාන්තයෙන්ම දුක්මුසු හඬක් කළාය. මහණෙනි, මේ ස්ත්‍රිය කාලිංග රජුගේ අග්‍රමහේෂිකාව වූවාය. ඇය ඊර්ෂ්‍යාවෙන් පීඩිතව සිය කුලී භාර්යාවට ගිනි අඟුරු කබලකින් ඉසින ලදි. පස්වෙනි කතාවයි.",
      "paliTitle": "Okilinīsuttaṃ",
      "englishTitle": "The Dripping Woman Sutta",
      "sinhalaTitle": "ඕකිලිනී සූත්‍රය"
    },
    {
      "number": 217,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ asīsakaṃ kabandhaṃ [kavandhaṃ (sī. pī.)] vehāsaṃ gacchantaṃ. Tassa ure akkhīni ceva honti mukhañca. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe hāriko nāma coraghātako ahosi…pe…. Chaṭṭhaṃ.",
      "english": "Here, friends, descending from Vulture Peak Mountain, I saw a headless torso moving through the air. On its chest there were eyes and a mouth. Vultures, crows, and hawks followed it, pursuing it repeatedly, tearing it to shreds and lacerating it. And that being uttered a distressed cry... That being, monks, was a man named Hārika, who was a robber-murderer right here in Rājagaha... The Sixth.",
      "sinhala": "ආයුෂ්මතුනි, මම මෙහි ගිජුකුළ්‍ලූ පර්වතයෙන් බසිමින් සිටිය දී හිසක් නැති කබඳක් (කය) අහසේ ගමන් කරනු දුටුවෙමි. එහි පපුව මත ඇස් ද මුවක් ද විය. ගිජුලිහිණියෝ ද, කපුටෝ ද, උකුස්සෝ ද එය නොකඩවා ලූහුබැඳ, ඉරා දමා, විසිරුවා හරින්නෝ ය. ඒ සත්ත්වයා දුක්මුසු හඬින් කෑ ගැසී ය... මහණෙනි, මේ සත්ත්ව තෙම මේ රාජග්‍රිහයෙහි ම හාරික නම් වූ සොර මැරුවෙක් විය... මෙය සවෙනි දසුන ය.",
      "paliTitle": "Asīsakasuttaṃ",
      "englishTitle": "The Headless Sutta",
      "sinhalaTitle": "අසීසක සූත්‍රය"
    },
    {
      "number": 218,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ bhikkhuṃ vehāsaṃ gacchantaṃ. Tassa saṅghāṭipi ādittā sampajjalitā sajotibhūtā [sañjotibhūtā (syā. kaṃ.)], pattopi āditto sampajjalito sajotibhūto, kāyabandhanampi ādittaṃ sampajjalitaṃ sajotibhūtaṃ, kāyopi āditto sampajjalito sajotibhūto. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, bhikkhu kassapassa sammāsambuddhassa pāvacane pāpabhikkhu ahosi…pe…. Sattamaṃ.",
      "english": "Here, friends, descending from Vulture Peak Mountain, I saw a monk traveling through the air. His outer robe was ablaze, intensely burning, manifesting as a mass of light. His alms bowl was also ablaze, intensely burning, manifesting as a mass of light. His girdle was also ablaze, intensely burning, manifesting as a mass of light. His body was also ablaze, intensely burning, manifesting as a mass of light. He was indeed emitting a grievous cry of distress... This monk, monks, was an evil monk in the dispensation of Kassapa, the Fully Awakened Buddha... Seventh.",
      "sinhala": "ආයුෂ්මත්වරුනි, මෙහි දී මම ගිජුකුළුවෙන් බැස යන අතර අහසින් යන භික්ෂුවක් දුටුවෙමි. එහි ඔහුගේ සඞ්ඝාටියද ඇවිලී, හොඳින් දැල්වී, දීප්තිමත් බවට පත්ව තිබුණේය. පාත්‍රයද ඇවිලී, හොඳින් දැල්වී, දීප්තිමත් බවට පත්ව තිබුණේය. කැටිකායබන්දනයද ඇවිලී, හොඳින් දැල්වී, දීප්තිමත් බවට පත්ව තිබුණේය. ශරීරයද ඇවිලී, හොඳින් දැල්වී, දීප්තිමත් බවට පත්ව තිබුණේය. හේ මහත් වූ වේදනා හඬක් නගන්නේය... (පෙ....) මහණෙනි, මේ භික්ෂුව කාශ්‍යප සම්මාසම්බුද්ධයන් වහන්සේගේ ශාසනයෙහි පාපී භික්ෂුවක් වී සිටියේය... (පෙ....) මේ සත්වැන්නයි.",
      "paliTitle": "Pāpabhikkhusuttaṃ",
      "englishTitle": "The Discourse on the Evil Monk",
      "sinhalaTitle": "පාපභික්ඛු සූත්‍රය"
    },
    {
      "number": 219,
      "pali": "‘‘Addasaṃ bhikkhuniṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā…pe… pāpabhikkhunī ahosi…pe…. Aṭṭhamaṃ.",
      "english": "I saw a nun traveling through the air. Even her outer robe was ablaze, and so forth. She was a wicked nun, and so forth. The eighth passage.",
      "sinhala": "මම අහසින් ගමන් කරන භික්ෂුණියක් දුටුවෙමි. ඇයගේ සංඝාටිය පවා ගිනිගෙන දැවෙමින් තිබිණි... ඇය පව්කම් කළ භික්ෂුණියක් වූවාය... මෙය අටවැනි දර්ශනයයි.",
      "paliTitle": "Pāpabhikkhunīsuttaṃ",
      "englishTitle": "The Discourse on the Evil Nun",
      "sinhalaTitle": "පාපභික්ඛුනී සූත්‍රය"
    },
    {
      "number": 220,
      "pali": "‘‘Addasaṃ sikkhamānaṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā…pe… pāpasikkhamānā ahosi…pe…. Navamaṃ.",
      "english": "I saw a trainee nun traveling through the air. Even her outer robe was ablaze [and she was entirely consumed by the flame]. She was a wicked trainee nun [who had committed grave offenses]. This is the ninth account.",
      "sinhala": "මම අහසින් ගමන් කරන සික්ඛමානාවක් දුටුවෙමි. ඇගේ සංඝාටියද දැල්වී තිබුණි. ඇය පවිටු සික්ඛමානාවක් වූවාය. නවවැන්න මෙයයි.",
      "paliTitle": "Pāpasikkhamānasuttaṃ",
      "englishTitle": "The Discourse on the Evil Probationer",
      "sinhalaTitle": "පාපසික්ඛමානා සූත්‍රය"
    },
    {
      "number": 221,
      "pali": "‘‘Addasaṃ sāmaṇeraṃ vehāsaṃ gacchantaṃ. Tassa saṅghāṭipi ādittā…pe… pāpasāmaṇero ahosi…pe…. Dasamaṃ.",
      "english": "I saw a novice monk journeying through the sky. Even his outer robe was blazing... He was an evil novice monk... This is the tenth.",
      "sinhala": "මම අහසින් යන සාමණේර නමක් දුටුවෙමි. ඔහුගේ සංඝාටිය පවා ඇවිළෙමින් තිබුණි... ඔහු පව්කම් කළ සාමණේර නමක් විය... මෙය දසවැනි සූත්‍රයයි.",
      "paliTitle": "Pāpasāmaṇerasuttaṃ",
      "englishTitle": "The Discourse on the Evil Novice Monk",
      "sinhalaTitle": "පාපසාමණේර සූත්‍රය"
    },
    {
      "number": 222,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sāmaṇeriṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā sampajjalitā sajotibhūtā, pattopi āditto sampajjalito sajotibhūto, kāyabandhanampi ādittaṃ sampajjalitaṃ sajotibhūtaṃ, kāyopi āditto sampajjalito sajotibhūto. Sā sudaṃ aṭṭassaraṃ karoti. Tassa mayhaṃ, āvuso, etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Evarūpopi nāma satto bhavissati! Evarūpopi nāma yakkho bhavissati! Evarūpopi nāma attabhāvapaṭilābho bhavissatī’’’ti!! Atha kho bhagavā bhikkhū āmantesi – ‘‘cakkhubhūtā vata, bhikkhave, sāvakā viharanti; ñāṇabhūtā vata, bhikkhave, sāvakā viharanti, yatra hi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissati. Pubbeva me sā, bhikkhave, sāmaṇerī diṭṭhā ahosi. Api cāhaṃ na byākāsiṃ. Ahañcetaṃ byākareyyaṃ, pare ca me na saddaheyyuṃ. Ye me na saddaheyyuṃ, tesaṃ taṃ assa dīgharattaṃ ahitāya dukkhāya. Esā, bhikkhave, sāmaṇerī kassapassa sammāsambuddhassa pāvacane pāpasāmaṇerī ahosi. Sā tassa kammassa vipākena bahūni vassāni bahūni vassasatāni bahūni vassasahassāni bahūni vassasatasahassāni niraye paccitvā tasseva kammassa vipākāvasesena evarūpaṃ attabhāvapaṭilābhaṃ paṭisaṃvedayatī’’ti. Ekādasamaṃ. Dutiyo vaggo. Tassuddānaṃ – Kūpe nimuggo hi so pāradāriko; Gūthakhādi ahu duṭṭhabrāhmaṇo. Nicchavitthi aticārinī ahu; Maṅgulitthi ahu ikkhaṇitthikā. Okilini sapattaṅgārokiri; Sīsacchinno ahu coraghātako. Bhikkhu bhikkhunī sikkhamānā; Sāmaṇero atha sāmaṇerikā. Kassapassa vinayasmiṃ pabbajjaṃ; Pāpakammaṃ kariṃsu tāvadeti. ",
      "english": "“Friends, here, descending from Vulture Peak mountain, I saw a novice nun walking through the air. Her outer robe was blazing, burning brightly, alight with flame; her bowl was blazing, burning brightly, alight with flame; her belt was blazing, burning brightly, alight with flame; and her body was blazing, burning brightly, alight with flame. She was wailing loudly. Regarding this, friends, the thought occurred to me: ‘Oh, how wondrous, sirs! Oh, how astonishing, sirs! Is it possible for there to be a being of such a kind! Is it possible for there to be a spirit of such a kind! Is it possible for there to be the acquisition of an existence of such a kind!’”\n\nThen the Bhagavā addressed the monks, saying: “The disciples truly dwell with the eye (of wisdom), monks! The disciples truly dwell with knowledge, monks! For a disciple to know, or see, or bear witness to a sight of such a kind! Monks, that novice nun was seen by me previously. But I did not declare it. If I were to declare it, others would not believe me. For those who would not believe me, that would lead to their harm and suffering for a long time. Monks, this novice nun was an evil novice nun in the dispensation of Kassapa the Perfectly Self-Enlightened One. As a result of that action, she suffered in hell for many years, many hundreds of years, many thousands of years, many hundreds of thousands of years. Now, due to the residual result of that very action, she experiences the acquisition of an existence of such a kind.” This is the eleventh story. The second chapter.\n\nIts summary verse:\nThat adulterer sank into the pit. The wicked Brahmin was a dung-eater. The skinless woman was an adulteress. The maimed woman was a fortune-teller. The woman covered in filth threw embers at her co-wife. The man with the severed head was a murderer. The monk, the nun, the trainee nun, the novice monk, and the novice nun—all these committed evil deeds while having gone forth in the discipline of Kassapa.",
      "sinhala": "මම මෙහි ගිජ්ජකූට පර්වතයෙන් බසින අතර, අහසින් යන සාමණේරියක් දුටුවෙමි. ඇගේ සංඝාටියද දැල්වී, ඇවිලී, තේජෝමත්ව තිබුණේය, පාත්‍රයද දැල්වී, ඇවිලී, තේජෝමත්ව තිබුණේය, කයබන්ධනයද දැල්වී, ඇවිලී, තේජෝමත්ව තිබුණේය, ශරීරයද දැල්වී, ඇවිලී, තේජෝමත්ව තිබුණේය. ඇය මහත් වූ දුක්ඛිත හඬක් නගන්නට වූවාය. ආවුසෝ, එවිට මට මෙසේ සිතුණේය: ‘අහෝ! මෙය පුදුම සහගතය, අහෝ! මෙය අද්භූත සහගතය! මෙබඳු සත්ත්වයෙක්ද සිටින්නට පුළුවන! මෙබඳු යක්ෂයෙක්ද සිටින්නට පුළුවන! මෙබඳු ආත්මභාව ප්‍රතිලාභයක්ද (උපතක්ද) ලැබෙන්නට පුළුවන!’\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: “මහණෙනි, ඇත්තෙන්ම ශ්‍රාවකයෝ චක්ඛුභූතව (දැකීමේ ඇස ඇතිව), ඥාණභූතව (ප්‍රඥාව ඇතිව) වාසය කරති; යම් හෙයකින් ශ්‍රාවකයෙකු මෙබඳු දෙයක් දැන ගන්නේ හෝ දකින්නේ හෝ සාක්ෂි සහිත කර ගන්නේ වේද. මහණෙනි, මා විසින්ද ඒ සාමණේරිය පෙර දැක තිබුණාය. එහෙත් මම ඒ බව ප්‍රකාශ නොකළෙමි. යම් හෙයකින් මම ඒ බව ප්‍රකාශ කළේ නම්, අන්‍යයෝ මා විශ්වාස නොකරන්නට ඉඩ තිබුණි. යම් අය මා විශ්වාස නොකරන්නේද, එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත්, දුක් පිණිසත් වන්නේය. මහණෙනි, මේ සාමණේරිය නම් කස්සප සම්මාසම්බුද්ධයන් වහන්සේගේ ශාසනයෙහි පාපතර සාමණේරියක්ව සිටියාය. ඇය ඒ කර්මයේ විපාක වශයෙන් බොහෝ අවුරුදු, බොහෝ සිය ගණන් අවුරුදු, බොහෝ දහස් ගණන් අවුරුදු, බොහෝ ලක්ෂ ගණන් අවුරුදු නිරයෙහි පැසී, ඒ කර්මයේම ඉතිරි වූ විපාක හේතුවෙන් මෙබඳු ආත්මභාව ප්‍රතිලාභයක් (මෙබඳු උපතක්) අත්විඳින්නීය.”\n\nඑකොළොස්වැනිය. දෙවෙනි වර්ගය නිමවිය. එහි උද්දානය (සංග්‍රහය) මෙසේය: කාමමිථ්‍යාචාරයෙහි හැසිරුණු තැනැත්තා ළිඳක ගිලුණේය. දූෂිත බ්‍රාහ්මණයා අසූචි කන්නෙක් විය. වරදවා හැසිරුණු ස්ත්‍රිය නිරුවත් ස්ත්‍රියක් වූවාය. කේලාම් කියන ස්ත්‍රිය මංගුලි ස්ත්‍රියක් වූවාය. සපත්තියගේ ශරීරය ගිනි අඟුරුවලින් දැවූ ස්ත්‍රිය කලුරිය වූවාය. හිස සිඳ දමන ලද්දේ සොරුන් මරන්නා විය. භික්ෂුව, භික්ෂුණිය, සික්ෂ්මානාව; සාමණේරයා සහ සාමණේරියද වෙති. කස්සපයන් වහන්සේගේ විනයෙහි පැවිදි වී; ඔවුහු මෙබඳු පාපකර්ම කළෝය.",
      "paliTitle": "Pāpasāmaṇerīsuttaṃ",
      "englishTitle": "The Discourse on the Evil Novice Nun",
      "sinhalaTitle": "පාපසාමණේරී සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Lakkhaṇasaṃyuttaṃ samattaṃ.",
    "english": "The Linked Discourses with Lakkhaṇa is complete.",
    "sinhala": "ලක්ඛණ සංයුක්තය සමාප්තයි."
  }
}