{
  "id": "sn.2.5",
  "title": {
    "pali": "Kassapasaṃyuttaṃ",
    "english": "The Connected Discourses with Kassapa",
    "sinhala": "කස්සප සංයුත්තය"
  },
  "sections": [
    {
      "number": 144,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘santuṭṭhāyaṃ [santuṭṭhoyaṃ (sī.)], bhikkhave, kassapo itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca vaṇṇavādī; na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca cīvaraṃ na paritassati; laddhā ca cīvaraṃ agadhito [agathito (sī.)] amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati’’. ‘‘Santuṭṭhāyaṃ, bhikkhave, kassapo itarītarena piṇḍapātena, itarītarapiṇḍapātasantuṭṭhiyā ca vaṇṇavādī; na ca piṇḍapātahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca piṇḍapātaṃ na paritassati; laddhā ca piṇḍapātaṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati. ‘‘Santuṭṭhāyaṃ, bhikkhave, kassapo itarītarena senāsanena, itarītarasenāsanasantuṭṭhiyā ca vaṇṇavādī; na ca senāsanahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca senāsanaṃ na paritassati; laddhā ca senāsanaṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati. ‘‘Santuṭṭhāyaṃ, bhikkhave, kassapo itarītarena gilānappaccayabhesajjaparikkhārena, itarītaragilānappaccayabhesajjaparikkhārasantuṭṭhiyā ca vaṇṇavādī; na ca gilānappaccayabhesajjaparikkhārahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca gilānappaccayabhesajjaparikkhāraṃ na paritassati; laddhā ca gilānappaccayabhesajjaparikkhāraṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘santuṭṭhā bhavissāma itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca vaṇṇavādino; na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjissāma; aladdhā ca cīvaraṃ na ca paritassissāma; laddhā ca cīvaraṃ agadhitā amucchitā anajjhāpannā ādīnavadassāvino nissaraṇapaññā paribhuñjissāma’’’. (Evaṃ sabbaṃ kātabbaṃ). ‘‘‘Santuṭṭhā bhavissāma itarītarena piṇḍapātena…pe… santuṭṭhā bhavissāma itarītarena senāsanena…pe… santuṭṭhā bhavissāma itarītarena gilānappaccayabhesajjaparikkhārena, itarītaragilānappaccayabhesajjaparikkhārasantuṭṭhiyā ca vaṇṇavādino; na ca gilānappaccayabhesajjaparikkhārahetu anesanaṃ appatirūpaṃ āpajjissāma aladdhā ca gilānappaccayabhesajjaparikkhāraṃ na paritassissāma; laddhā ca gilānappaccayabhesajjaparikkhāraṃ agadhitā amucchitā anajjhāpannā ādīnavadassāvino nissaraṇapaññā paribhuñjissāmā’ti. Evañhi vo, bhikkhave, sikkhitabbaṃ. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa [yo vā pana (sī.), yo vā (pī.)] kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Paṭhamaṃ.",
      "english": "Monks, Kassapa is content with any robe whatsoever, and he speaks in praise of contentment with any robe whatsoever. He does not engage in improper seeking because of robes. And not having obtained a robe, he does not fret. And having obtained a robe, he uses it without grasping, without infatuation, without being enslaved, seeing the danger in it, and possessing the wisdom for liberation.\n\nMonks, Kassapa is content with any almsfood whatsoever, and he speaks in praise of contentment with any almsfood whatsoever. He does not engage in improper seeking because of almsfood. And not having obtained almsfood, he does not fret. And having obtained almsfood, he uses it without grasping, without infatuation, without being enslaved, seeing the danger in it, and possessing the wisdom for liberation.\n\nMonks, Kassapa is content with any lodging whatsoever, and he speaks in praise of contentment with any lodging whatsoever. He does not engage in improper seeking because of lodgings. And not having obtained a lodging, he does not fret. And having obtained a lodging, he uses it without grasping, without infatuation, without being enslaved, seeing the danger in it, and possessing the wisdom for liberation.\n\nMonks, Kassapa is content with any requisites for the sick, medicines whatsoever, and he speaks in praise of contentment with any requisites for the sick, medicines whatsoever. He does not engage in improper seeking because of requisites for the sick, medicines. And not having obtained requisites for the sick, medicines, he does not fret. And having obtained requisites for the sick, medicines, he uses them without grasping, without infatuation, without being enslaved, seeing the danger in them, and possessing the wisdom for liberation.\n\nTherefore, monks, this is how you should train yourselves: ‘We will be content with any robe whatsoever, and we will speak in praise of contentment with any robe whatsoever. We will not engage in improper seeking because of robes. And not having obtained a robe, we will not fret. And having obtained a robe, we will use it without grasping, without infatuation, without being enslaved, seeing the danger in it, and possessing the wisdom for liberation.’\n\n‘We will be content with any almsfood whatsoever... We will be content with any lodging whatsoever... We will be content with any requisites for the sick, medicines whatsoever, and we will speak in praise of contentment with any requisites for the sick, medicines whatsoever. We will not engage in improper seeking because of requisites for the sick, medicines. And not having obtained requisites for the sick, medicines, we will not fret. And having obtained requisites for the sick, medicines, we will use them without grasping, without infatuation, without being enslaved, seeing the danger in them, and possessing the wisdom for liberation.’ This is indeed how you should train yourselves, monks. For I will advise you, monks, by Kassapa's example, or by the example of one who is like Kassapa. And having been advised, you should practice in such a way.",
      "sinhala": "භික්‍ෂූණි, කස්සප යම් කිසි සිවුරකින් සන්තුෂ්ට වෙයි. යම් කිසි සිවුරකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරයි. සිවුරු නිසා නුසුදුසු ඇසීමක නොයෙදෙයි. සිවුරු නොලැබූ කල්හි නො තැවෙයි. සිවුරු ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරයි.\n\nභික්‍ෂූණි, කස්සප යම් කිසි පිණ්ඩපාතයකින් සන්තුෂ්ට වෙයි. යම් කිසි පිණ්ඩපාතයකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරයි. පිණ්ඩපාතය නිසා නුසුදුසු ඇසීමක නොයෙදෙයි. පිණ්ඩපාතය නොලැබූ කල්හි නො තැවෙයි. පිණ්ඩපාතය ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරයි.\n\nභික්‍ෂූණි, කස්සප යම් කිසි සේනාසනයකින් සන්තුෂ්ට වෙයි. යම් කිසි සේනාසනයකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරයි. සේනාසනය නිසා නුසුදුසු ඇසීමක නොයෙදෙයි. සේනාසනය නොලැබූ කල්හි නො තැවෙයි. සේනාසනය ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරයි.\n\nභික්‍ෂූණි, කස්සප යම් කිසි ගිලන්පස බෙහෙත් පිරිකරකින් සන්තුෂ්ට වෙයි. යම් කිසි ගිලන්පස බෙහෙත් පිරිකරකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරයි. ගිලන්පස බෙහෙත් පිරිකර නිසා නුසුදුසු ඇසීමක නොයෙදෙයි. ගිලන්පස බෙහෙත් පිරිකර නොලැබූ කල්හි නො තැවෙයි. ගිලන්පස බෙහෙත් පිරිකර ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරයි.\n\nඑබැවින් භික්‍ෂූණි, මෙසේ පුරුදු විය යුතුයි: ‘අපි යම් කිසි සිවුරකින් සන්තුෂ්ට වන්නෙමු. යම් කිසි සිවුරකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරන්නෙමු. සිවුරු නිසා නුසුදුසු ඇසීමක නොයෙදෙන්නෙමු. සිවුරු නොලැබූ කල්හි නො තැවෙන්නෙමු. සිවුරු ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරන්නෙමු’යි.\n\n‘අපි යම් කිසි පිණ්ඩපාතයකින් සන්තුෂ්ට වන්නෙමු. යම් කිසි පිණ්ඩපාතයකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරන්නෙමු. පිණ්ඩපාතය නිසා නුසුදුසු ඇසීමක නොයෙදෙන්නෙමු. පිණ්ඩපාතය නොලැබූ කල්හි නො තැවෙන්නෙමු. පිණ්ඩපාතය ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරන්නෙමු.’\n\n‘අපි යම් කිසි සේනාසනයකින් සන්තුෂ්ට වන්නෙමු. යම් කිසි සේනාසනයකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරන්නෙමු. සේනාසනය නිසා නුසුදුසු ඇසීමක නොයෙදෙන්නෙමු. සේනාසනය නොලැබූ කල්හි නො තැවෙන්නෙමු. සේනාසනය ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරන්නෙමු.’\n\n‘අපි යම් කිසි ගිලන්පස බෙහෙත් පිරිකරකින් සන්තුෂ්ට වන්නෙමු. යම් කිසි ගිලන්පස බෙහෙත් පිරිකරකින් සන්තුෂ්ට වීම ද ගුණ වර්ණනා කරන්නෙමු. ගිලන්පස බෙහෙත් පිරිකර නිසා නුසුදුසු ඇසීමක නොයෙදෙන්නෙමු. ගිලන්පස බෙහෙත් පිරිකර නොලැබූ කල්හි නො තැවෙන්නෙමු. ගිලන්පස බෙහෙත් පිරිකර ලැබූ කල්හි නොඇලී, නොමුසපත් වී, වහල් නොවී, ආදීනව දකිනසුලු ව, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරන්නෙමු’යි.\n\nභික්‍ෂූණි, මෙසේ ම යි ඔබ විසින් පුරුදු විය යුත්තේ. භික්‍ෂූණි, මම ඔබට කස්සපගෙන් හෝ කස්සප හා සමාන වූ කෙනෙකුගෙන් අවවාද කරන්නෙමි. මෙසේ අවවාද ලැබූ ඔබ ඒ අයුරින් ම පිළිපැදිය යුතුයි.",
      "paliTitle": "Santuṭṭhasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Contentment",
      "sinhalaTitle": "සන්තුට්ඨ සූත්‍රය"
    },
    {
      "number": 145,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ca mahākassapo āyasmā ca sāriputto bārāṇasiyaṃ viharanti isipatane migadāye. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmatā mahākassapena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahākassapaṃ etadavoca – ‘‘vuccati hidaṃ, āvuso kassapa, anātāpī anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya; ātāpī ca kho ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti. ‘‘Kittāvatā nu kho, āvuso, anātāpī hoti anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya; kittāvatā ca panāvuso, ātāpī hoti ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti? ‘‘Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘anuppannā me kusalā dhammānuppajjamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti na ātappaṃ karoti. Evaṃ kho, āvuso, anātāpī hoti’’. ‘‘Kathañcāvuso, anottappī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti na ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti na ottappati, ‘anuppannā me kusalā dhammānuppajjamānā anatthāya saṃvatteyyu’nti na ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti na ottappati. Evaṃ kho, āvuso, anottappī hoti. Evaṃ kho, āvuso, anātāpī anottappī abhabbo sambodhāya abhabbo nibbānāya abhabbo anuttarassa yogakkhemassa adhigamāya. ‘‘Kathañcāvuso, ātāpī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti ātappaṃ karoti, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti ātappaṃ karoti, anuppannā me kusalā dhammā…pe… ātappaṃ karoti. Evaṃ kho, āvuso, ātāpī hoti. ‘‘Kathañcāvuso, ottappī hoti? Idhāvuso, bhikkhu ‘anuppannā me pāpakā akusalā dhammā uppajjamānā anatthāya saṃvatteyyu’nti ottappati, ‘uppannā me pāpakā akusalā dhammā appahīyamānā anatthāya saṃvatteyyu’nti ottappati, ‘anuppannā me kusalā dhammā anuppajjamānā anatthāya saṃvatteyyu’ntntti ottappati, ‘uppannā me kusalā dhammā nirujjhamānā anatthāya saṃvatteyyu’nti ottappati. Evaṃ kho, āvuso, ottappī hoti. Evaṃ kho, āvuso, ātāpī ottappī bhabbo sambodhāya bhabbo nibbānāya bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti. Dutiyaṃ.",
      "english": "Thus have I heard – on one occasion the Venerable Mahākassapa and the Venerable Sāriputta were dwelling in Bārāṇasī, at Isipatana, in the Deer Park.\n\nThen, in the evening, the Venerable Sāriputta, having emerged from his solitary retreat, approached the Venerable Mahākassapa. Having approached, he exchanged greetings with the Venerable Mahākassapa. After exchanging courteous and memorable remarks, he sat down to one side.\n\nSitting to one side, the Venerable Sāriputta said to the Venerable Mahākassapa: “It is said, friend Kassapa, that one who is not ardent and not conscientious is incapable of awakening, incapable of Nibbāna, incapable of attaining the unsurpassed security from bondage. But one who is ardent and conscientious is capable of awakening, capable of Nibbāna, capable of attaining the unsurpassed security from bondage.”\n\n“To what extent, friend, is one not ardent and not conscientious, incapable of awakening, incapable of Nibbāna, incapable of attaining the unsurpassed security from bondage? And to what extent, friend, is one ardent and conscientious, capable of awakening, capable of Nibbāna, capable of attaining the unsurpassed security from bondage?”\n\n“Here, friend, a monk does not make an effort, thinking: ‘May unarisen evil unwholesome states not arise to my detriment.’ He does not make an effort, thinking: ‘May arisen evil unwholesome states, not being abandoned, not lead to my detriment.’ He does not make an effort, thinking: ‘May unarisen wholesome states not fail to arise to my detriment.’ He does not make an effort, thinking: ‘May arisen wholesome states, if they cease, not lead to my detriment.’ It is in this way, friend, that one is not ardent.”\n\n“And how, friend, is one not conscientious? Here, friend, a monk has no moral dread, thinking: ‘May unarisen evil unwholesome states not arise to my detriment.’ He has no moral dread, thinking: ‘May arisen evil unwholesome states, not being abandoned, not lead to my detriment.’ He has no moral dread, thinking: ‘May unarisen wholesome states not fail to arise to my detriment.’ He has no moral dread, thinking: ‘May arisen wholesome states, if they cease, not lead to my detriment.’ It is in this way, friend, that one is not conscientious. It is in this way, friend, that one who is not ardent and not conscientious is incapable of awakening, incapable of Nibbāna, incapable of attaining the unsurpassed security from bondage.”\n\n“And how, friend, is one ardent? Here, friend, a monk makes an effort, thinking: ‘May unarisen evil unwholesome states not arise to my detriment.’ He makes an effort, thinking: ‘May arisen evil unwholesome states, not being abandoned, not lead to my detriment.’ He makes an effort, thinking: ‘May unarisen wholesome states not fail to arise to my detriment.’ He makes an effort, thinking: ‘May arisen wholesome states, if they cease, not lead to my detriment.’ It is in this way, friend, that one is ardent.”\n\n“And how, friend, is one conscientious? Here, friend, a monk has moral dread, thinking: ‘May unarisen evil unwholesome states not arise to my detriment.’ He has moral dread, thinking: ‘May arisen evil unwholesome states, not being abandoned, not lead to my detriment.’ He has moral dread, thinking: ‘May unarisen wholesome states not fail to arise to my detriment.’ He has moral dread, thinking: ‘May arisen wholesome states, if they cease, not lead to my detriment.’ It is in this way, friend, that one is conscientious. It is in this way, friend, that one who is ardent and conscientious is capable of awakening, capable of Nibbāna, capable of attaining the unsurpassed security from bondage.”",
      "sinhala": "මා විසින් මෙසේ ශ්‍රවණය කරන ලදි. එක් සමයෙක්හි ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ ද බරණැස ඉසිපතන මිගදායෙහි වැඩවසන සේක.\n\nඑවිට ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ සවස් කාලයෙහි තැන්පත් භාවනාවෙන් නැගිට, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ වෙත එළඹියහ. එළඹ, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ සමඟ සම්‍මෝදනය වූහ. සම්‍මෝදනීය වූ ද, සිහි කටයුතු වූ ද කථාබහක් පවත්වා එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: ‘‘ඇවැත් කාශ්‍යපයෙනි, මේ කියනු ලැබේ: වීර්‍ය්‍යයෙන් තොර වූ ද, පාපයට නොබිය වන ද පුද්ගලයා සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද, අතිශ්‍රේෂ්ඨ වූ යෝගක්ෂේමය අවබෝධ කර ගැනීම පිණිස ද සමත් නොවේ. වීර්‍ය්‍යවන්ත වූ ද, පාපයට බිය වන ද පුද්ගලයා සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද, අතිශ්‍රේෂ්ඨ වූ යෝගක්ෂේමය අවබෝධ කර ගැනීම පිණිස ද සමත් වේ යනුයි.’’\n\n‘‘ඇවැත්නි, කෙතෙක් අයුරකින් වීර්‍ය්‍යයෙන් තොර වූ ද, පාපයට නොබිය වන ද පුද්ගලයා සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද, අතිශ්‍රේෂ්ඨ වූ යෝගක්ෂේමය අවබෝධ කර ගැනීම පිණිස ද සමත් නොවේ ද? ඇවැත්නි, කෙතෙක් අයුරකින් වීර්‍ය්‍යවන්ත වූ ද, පාපයට බිය වන ද පුද්ගලයා සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද, අතිශ්‍රේෂ්ඨ වූ යෝගක්ෂේමය අවබෝධ කර ගැනීම පිණිස ද සමත් වේ ද?’’\n\n‘‘ඇවැත්නි, මෙහිලා භික්ෂුව ‘මා තුළ නූපන් පව්කම්, අකුසල් ධර්මයන් හටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා වළක්වා ගැනීමට) වීර්‍ය්‍ය නොකරයි. ‘මා තුළ උපන් පව්කම්, අකුසල් ධර්මයන් පහ නොවී පැවතුණොත් අහිත පිණිස පවතී’ යයි (ඒවා දුරු කිරීමට) වීර්‍ය්‍ය නොකරයි. ‘මා තුළ නූපන් කුසල් ධර්මයන් නොහටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා උපදවා ගැනීමට) වීර්‍ය්‍ය නොකරයි. ‘මා තුළ උපන් කුසල් ධර්මයන් නිරුද්ධ වුවහොත් අහිත පිණිස පවතී’ යයි (ඒවා රැක ගැනීමට) වීර්‍ය්‍ය නොකරයි. ඇවැත්නි, මෙසේ වීර්‍ය්‍යයෙන් තොර පුද්ගලයා වේ.\n\n‘‘ඇවැත්නි, කෙලෙසක නම් පාපයට නොබිය වන පුද්ගලයා වේ ද? ඇවැත්නි, මෙහිලා භික්ෂුව ‘මා තුළ නූපන් පව්කම්, අකුසල් ධර්මයන් හටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) නොබිය වේ. ‘මා තුළ උපන් පව්කම්, අකුසල් ධර්මයන් පහ නොවී පැවතුණොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) නොබිය වේ. ‘මා තුළ නූපන් කුසල් ධර්මයන් නොහටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) නොබිය වේ. ‘මා තුළ උපන් කුසල් ධර්මයන් නිරුද්ධ වුවහොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) නොබිය වේ. ඇවැත්නි, මෙසේ පාපයට නොබිය වන පුද්ගලයා වේ. ඇවැත්නි, මෙසේ වීර්‍ය්‍යයෙන් තොර වූ ද, පාපයට නොබිය වන ද පුද්ගලයා සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද, අතිශ්‍රේෂ්ඨ වූ යෝගක්ෂේමය අවබෝධ කර ගැනීම පිණිස ද සමත් නොවේ.\n\n‘‘ඇවැත්නි, කෙලෙසක නම් වීර්‍ය්‍යවන්ත පුද්ගලයා වේ ද? ඇවැත්නි, මෙහිලා භික්ෂුව ‘මා තුළ නූපන් පව්කම්, අකුසල් ධර්මයන් හටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා වළක්වා ගැනීමට) වීර්‍ය්‍ය කරයි. ‘මා තුළ උපන් පව්කම්, අකුසල් ධර්මයන් පහ නොවී පැවතුණොත් අහිත පිණිස පවතී’ යයි (ඒවා දුරු කිරීමට) වීර්‍ය්‍ය කරයි. ‘මා තුළ නූපන් කුසල් ධර්මයන් නොහටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා උපදවා ගැනීමට) වීර්‍ය්‍ය කරයි. ‘මා තුළ උපන් කුසල් ධර්මයන් නිරුද්ධ වුවහොත් අහිත පිණිස පවතී’ යයි (ඒවා රැක ගැනීමට) වීර්‍ය්‍ය කරයි. ඇවැත්නි, මෙසේ වීර්‍ය්‍යවන්ත පුද්ගලයා වේ.\n\n‘‘ඇවැත්නි, කෙලෙසක නම් පාපයට බිය වන පුද්ගලයා වේ ද? ඇවැත්නි, මෙහිලා භික්ෂුව ‘මා තුළ නූපන් පව්කම්, අකුසල් ධර්මයන් හටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) බිය වේ. ‘මා තුළ උපන් පව්කම්, අකුසල් ධර්මයන් පහ නොවී පැවතුණොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) බිය වේ. ‘මා තුළ නූපන් කුසල් ධර්මයන් නොහටගත්තොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) බිය වේ. ‘මා තුළ උපන් කුසල් ධර්මයන් නිරුද්ධ වුවහොත් අහිත පිණිස පවතී’ යයි (ඒවා ගැන) බිය වේ. ඇවැත්නි, මෙසේ පාපයට බිය වන පුද්ගලයා වේ. ඇවැත්නි, මෙසේ වීර්‍ය්‍යවන්ත වූ ද, පාපයට බිය වන ද පුද්ගලයා සම්බෝධිය පිණිස ද, නිර්වාණය පිණිස ද, අතිශ්‍රේෂ්ඨ වූ යෝගක්ෂේමය අවබෝධ කර ගැනීම පිණිස ද සමත් වේ යනුයි.’’",
      "paliTitle": "Anottappīsuttaṃ",
      "vagga": "",
      "englishTitle": "Reckless Sutta",
      "sinhalaTitle": "අනොත්තප්පී සූත්‍රය"
    },
    {
      "number": 146,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘candūpamā, bhikkhave, kulāni upasaṅkamatha – apakasseva kāyaṃ, apakassa cittaṃ, niccanavakā kulesu appagabbhā [appagabbā (ka.)]. Seyyathāpi, bhikkhave, puriso jarudapānaṃ vā olokeyya pabbatavisamaṃ vā nadīviduggaṃ vā – apakasseva kāyaṃ, apakassa cittaṃ; evameva kho, bhikkhave, candūpamā kulāni upasaṅkamatha – apakasseva kāyaṃ, apakassa cittaṃ, niccanavakā kulesu appagabbhā’’. ‘‘Kassapo, bhikkhave, candūpamo kulāni upasaṅkamati – apakasseva kāyaṃ, apakassa cittaṃ, niccanavako kulesu appagabbho. Taṃ kiṃ maññatha, bhikkhave, kathaṃrūpo bhikkhu arahati kulāni upasaṅkamitu’’nti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. Atha kho bhagavā ākāse pāṇiṃ cālesi. ‘‘Seyyathāpi, bhikkhave, ayaṃ ākāse pāṇi na sajjati na gayhati na bajjhati; evameva kho, bhikkhave, yassa kassaci bhikkhuno kulāni upasaṅkamato kulesu cittaṃ na sajjati na gayhati na bajjhati – ‘labhantu lābhakāmā, puññakāmā karontu puññānī’ti; yathāsakena lābhena attamano hoti sumano, evaṃ paresaṃ lābhena attamano hoti sumano; evarūpo kho, bhikkhave, bhikkhu arahati kulāni upasaṅkamituṃ. ‘‘Kassapassa, bhikkhave, kulāni upasaṅkamato kulesu cittaṃ na sajjati na gayhati na bajjhati – ‘labhantu lābhakāmā, puññakāmā karontu puññānī’ti; yathāsakena lābhena attamano hoti sumano; evaṃ paresaṃ lābhena attamano hoti sumano. ‘‘Taṃ kiṃ maññatha, bhikkhave, kathaṃrūpassa bhikkhuno aparisuddhā dhammadesanā hoti, kathaṃrūpassa bhikkhuno parisuddhā dhammadesanā hotī’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Yo hi koci, bhikkhave, bhikkhu evaṃcitto paresaṃ dhammaṃ deseti – ‘aho vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ pasīdeyyuṃ, pasannā ca me pasannākāraṃ kareyyu’nti; evarūpassa kho, bhikkhave, bhikkhuno aparisuddhā dhammadesanā hoti. ‘‘Yo ca kho, bhikkhave, bhikkhu evaṃcitto paresaṃ dhammaṃ deseti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti [viññūhi (?)]. Aho, vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ ājāneyyuṃ, ājānitvā ca pana tathattāya paṭipajjeyyu’nti. Iti dhammasudhammataṃ paṭicca paresaṃ dhammaṃ deseti, kāruññaṃ paṭicca anuddayaṃ [anudayaṃ (bahūsu) dvittakāraṇaṃ pana gavesitabbaṃ] paṭicca anukampaṃ upādāya paresaṃ dhammaṃ deseti. Evarūpassa kho, bhikkhave, bhikkhuno parisuddhā dhammadesanā hoti. ‘‘Kassapo, bhikkhave, evaṃcitto paresaṃ dhammaṃ deseti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti. Aho, vata me dhammaṃ suṇeyyuṃ, sutvā ca pana dhammaṃ ājāneyyuṃ, ājānitvā ca pana tathattāya paṭipajjeyyu’nti. Iti dhammasudhammataṃ paṭicca paresaṃ dhammaṃ deseti, kāruññaṃ paṭicca anuddayaṃ paṭicca anukampaṃ upādāya paresaṃ dhammaṃ deseti. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa kassapasadiso, ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Tatiyaṃ.",
      "english": "O bhikkhus, approach families like the moon, keeping the body withdrawn, keeping the mind withdrawn, ever new, unpresumptuous towards families. Just as, O bhikkhus, a man might observe an old well, or a perilous mountain, or an unfordable river – keeping his body withdrawn, keeping his mind withdrawn; even so, O bhikkhus, approach families like the moon, keeping the body withdrawn, keeping the mind withdrawn, ever new, unpresumptuous towards families. Kassapa, O bhikkhus, approaches families like the moon, keeping his body withdrawn, keeping his mind withdrawn, ever new, unpresumptuous towards families. What do you think, O bhikkhus, what kind of bhikkhu is fit to approach families?\n\n“For us, Venerable Sir, the teachings have the Blessed One as their root, have the Blessed One as their guide, have the Blessed One as their refuge. It would be good, Venerable Sir, if the meaning of this statement would occur to the Blessed One himself. Having heard from the Blessed One, the bhikkhus will remember it.” Then the Blessed One waved his hand in the air.\n\n“Just as, O bhikkhus, this hand in the air does not cling, is not grasped, is not bound; even so, O bhikkhus, for any bhikkhu approaching families, whose mind does not cling, is not grasped, is not bound in regard to families – thinking, ‘May those desirous of gain obtain gain; may those desirous of merit do meritorious deeds.’ Just as he is pleased and glad with his own gains, so too is he pleased and glad with the gains of others. Such a bhikkhu, O bhikkhus, is fit to approach families.\n\n“For Kassapa, O bhikkhus, when approaching families, his mind does not cling, is not grasped, is not bound in regard to families – thinking, ‘May those desirous of gain obtain gain; may those desirous of merit do meritorious deeds.’ Just as he is pleased and glad with his own gains, so too is he pleased and glad with the gains of others.\n\n“What do you think, O bhikkhus, what kind of bhikkhu's teaching of the Dhamma is impure, and what kind of bhikkhu's teaching of the Dhamma is pure?”\n\n“For us, Venerable Sir, the teachings have the Blessed One as their root, have the Blessed One as their guide, have the Blessed One as their refuge. It would be good, Venerable Sir, if the meaning of this statement would occur to the Blessed One himself. Having heard from the Blessed One, the bhikkhus will remember it.” “In that case, O bhikkhus, listen and attend carefully; I shall speak.” “Yes, Venerable Sir,” those bhikkhus replied to the Blessed One. The Blessed One spoke thus:\n\n“Whosoever, O bhikkhus, teaches the Dhamma to others with such a mind – thinking, ‘Oh, if only they would listen to my Dhamma! Having listened, if only they would become confident in the Dhamma! And having become confident, if only they would show signs of confidence towards me!’ Such a bhikkhu, O bhikkhus, has an impure teaching of the Dhamma.\n\n“But whosoever, O bhikkhus, teaches the Dhamma to others with such a mind – thinking, ‘Well-proclaimed is the Dhamma by the Blessed One, visible here and now, immediate, inviting inspection, onward-leading, to be personally experienced by the wise. Oh, if only they would listen to the Dhamma! Having listened, if only they would understand the Dhamma! And having understood, if only they would practice accordingly for its realization!’ Thus, he teaches the Dhamma to others out of regard for the excellence of the Dhamma itself, based on compassion, based on sympathy, taking pity. Such a bhikkhu, O bhikkhus, has a pure teaching of the Dhamma.\n\n“Kassapa, O bhikkhus, teaches the Dhamma to others with such a mind – thinking, ‘Well-proclaimed is the Dhamma by the Blessed One, visible here and now, immediate, inviting inspection, onward-leading, to be personally experienced by the wise. Oh, if only they would listen to the Dhamma! Having listened, if only they would understand the Dhamma! And having understood, if only they would practice accordingly for its realization!’ Thus, he teaches the Dhamma to others out of regard for the excellence of the Dhamma itself, based on compassion, based on sympathy, taking pity. I shall instruct you, O bhikkhus, with Kassapa as an example, or with one who is like Kassapa; and having been instructed, you must practice accordingly for its realization.”",
      "sinhala": "සැවැත් නුවර වැඩසිටින සේක...\n\n‘මහණෙනි, සඳ වැනි ගෙවල්වලට පිවිසෙන්න – කයත් අහක් කරගෙන, සිතත් අහක් කරගෙන, ගෙවල්වල අලුත් කෙනෙකු මෙන් නිහතමානීව සිටින්න. මහණෙනි, යම් සේ පුරුෂයෙක් පරණ ළිඳක් හෝ කඳුකර මාර්ගයක් හෝ ගංගාවක් තරණය කිරීමට අපහසු ස්ථානයක් හෝ බලන්නේ කයත් අහක් කරගෙන, සිතත් අහක් කරගෙන යම් සේ ද; එසෙයින්ම මහණෙනි, සඳ වැනි ගෙවල්වලට පිවිසෙන්න – කයත් අහක් කරගෙන, සිතත් අහක් කරගෙන, ගෙවල්වල අලුත් කෙනෙකු මෙන් නිහතමානීව සිටින්න.’\n\n‘මහණෙනි, කස්සප තෙරුන් වහන්සේ සඳ මෙන් ගෙවල්වලට පිවිසෙන්නේ කයත් අහක් කරගෙන, සිතත් අහක් කරගෙන, ගෙවල්වල අලුත් කෙනෙකු මෙන් නිහතමානීවය. මහණෙනි, මේ ගැන කුමක් සිතන්නෙහිද? කවර ආකාරයේ භික්ෂුවක් ගෙවල්වලට පිවිසීමට සුදුසු ද?’ ‘වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. වහන්ස, ඒ භාග්‍යවතුන් වහන්සේටම මේ වචනයේ අර්ථය පැහැදිලි කිරීමට සුදුසුය. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහුය’යි.\n\nඑවිට භාග්‍යවතුන් වහන්සේ අහසේ අත සැලූ සේක. ‘මහණෙනි, යම් සේ මේ අත අහසේ නොඇලේද, නොගනේද, නොබැඳේද; එසෙයින්ම මහණෙනි, යම් කිසි භික්ෂුවකට ගෙවල්වලට පිවිසෙන විට ගෙවල්වල සිත නොඇලේද, නොගනේද, නොබැඳේද – ‘ලාභ අපේක්ෂා කරන අය ලාභ ලබත්වා, පින් කැමති අය පින් කරත්වා’ යනුවෙන්; තමන්ගේ ලාභයෙන් සතුටු සිතින් සිටින්නාක් මෙන්, අනුන්ගේ ලාභයෙන්ද සතුටු සිතින් සිටීද; මහණෙනි, මෙබඳු භික්ෂුවක් ගෙවල්වලට පිවිසීමට සුදුසුය.’\n\n‘මහණෙනි, කස්සප තෙරුන් වහන්සේ ගෙවල්වලට පිවිසෙන විට උන්වහන්සේගේ සිත ගෙවල්වල නොඇලෙයි, නොගනෙයි, නොබැඳෙයි – ‘ලාභ අපේක්ෂා කරන අය ලාභ ලබත්වා, පින් කැමති අය පින් කරත්වා’ යනුවෙන්; තමන්ගේ ලාභයෙන් සතුටු සිතින් සිටින්නාක් මෙන්, අනුන්ගේ ලාභයෙන්ද සතුටු සිතින් සිටින සේක.’\n\n‘මහණෙනි, මේ ගැන කුමක් සිතන්නෙහිද? කවර ආකාරයේ භික්ෂුවකගේ ධර්ම දේශනාව අපිරිසුදුද, කවර ආකාරයේ භික්ෂුවකගේ ධර්ම දේශනාව පිරිසුදුද?’ ‘වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. වහන්ස, ඒ භාග්‍යවතුන් වහන්සේටම මේ වචනයේ අර්ථය පැහැදිලි කිරීමට සුදුසුය. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහුය’යි.\n\n‘එසේ නම් මහණෙනි, අසන්න, මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි’යි. ‘එසේය, වහන්ස’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක – ‘මහණෙනි, යම් කිසි භික්ෂුවක් මෙවන් සිතකින් අනුන්ට ධර්මය දේශනා කරන්නේ නම් – ‘අහෝ! ඔවුහු මාගේ ධර්මය අසත්වා, අසා ධර්මය කෙරෙහි ප්‍රසන්න වෙත්වා, ප්‍රසන්න වී මට ප්‍රසන්න ආකාරයෙන් උපස්ථාන කරත්වා’ යනුවෙන්; මහණෙනි, මෙබඳු භික්ෂුවකගේ ධර්ම දේශනාව අපිරිසුදු වේ.’\n\n‘මහණෙනි, යම් භික්ෂුවක් මෙවන් සිතකින් අනුන්ට ධර්මය දේශනා කරන්නේ නම් – ‘භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මැනවින් දේශනා කොට ඇත, ඒ ධර්මය ස්වයංව දැකිය හැක (මෙලොවදීම ඵල දේ), කාලය ඉක්මවා පවතියි (කාල භේදයකින් තොරව), පැමිණ බලන්නට සුදුසුය, නිවන් මගට යොමු කරයි, ප්‍රඥාවන්තයින් විසින් තම තමන් තුළින් අත්දැකිය යුතු වේ’ යනුවෙන්; ‘අහෝ! ඔවුහු මාගේ ධර්මය අසත්වා, අසා ධර්මය අවබෝධ කරගනිත්වා, අවබෝධ කරගෙන ඒ අයුරින්ම පිළිපදිත්වා’ යනුවෙන්. මෙසේ ධර්මයේ උතුම් බව නිසා, කරුණාව නිසා, අනුකම්පාව නිසා, දයාව නිසා අනුන්ට ධර්මය දේශනා කරයි. මහණෙනි, මෙබඳු භික්ෂුවකගේ ධර්ම දේශනාව පිරිසුදු වේ.’\n\n‘මහණෙනි, කස්සප තෙරුන් වහන්සේ මෙවන් සිතකින් අනුන්ට ධර්මය දේශනා කරන සේක – ‘භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මැනවින් දේශනා කොට ඇත, ඒ ධර්මය ස්වයංව දැකිය හැක, කාලය ඉක්මවා පවතියි, පැමිණ බලන්නට සුදුසුය, නිවන් මගට යොමු කරයි, ප්‍රඥාවන්තයින් විසින් තම තමන් තුළින් අත්දැකිය යුතු වේ’ යනුවෙන්; ‘අහෝ! ඔවුහු මාගේ ධර්මය අසත්වා, අසා ධර්මය අවබෝධ කරගනිත්වා, අවබෝධ කරගෙන ඒ අයුරින්ම පිළිපදිත්වා’ යනුවෙන්. මෙසේ ධර්මයේ උතුම් බව නිසා, කරුණාව නිසා, අනුකම්පාව නිසා, දයාව නිසා අනුන්ට ධර්මය දේශනා කරන සේක. මහණෙනි, කස්සප තෙරුන් වහන්සේගෙන් හෝ එතුමන් හා සමාන කෙනෙකුගෙන් හෝ මම ඔබට අවවාද කරන්නෙමි. අවවාද ලද්දන් විසින් ඒ අයුරින්ම පිළිපැදිය යුතුය.’",
      "paliTitle": "Candūpamasuttaṃ",
      "vagga": "",
      "englishTitle": "Simile of the Moon Sutta",
      "sinhalaTitle": "චන්දූපම සූත්‍රය"
    },
    {
      "number": 147,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññatha, bhikkhave, kathaṃrūpo bhikkhu arahati kulūpako hotuṃ, kathaṃrūpo bhikkhu na arahati kulūpako hotu’’nti? Bhagavaṃmūlakā no, bhante, dhammā…pe… bhagavā etadavoca – ‘‘Yo hi koci, bhikkhave, bhikkhu evaṃcitto kulāni upasaṅkamati – ‘dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; sīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, bhikkhuno evaṃcittassa kulāni upasaṅkamato na denti, tena bhikkhu sandīyati; so tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ…pe… lūkhaṃ denti, no paṇītaṃ… dandhaṃ denti, no sīghaṃ, tena bhikkhu sandīyati; so tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena bhikkhu sandīyati; so tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Evarūpo kho, bhikkhave, bhikkhu na arahati kūlūpako hotuṃ. ‘‘Yo ca kho, bhikkhave, bhikkhu evaṃcitto kulāni upasaṅkamati – ‘taṃ kutettha labbhā parakulesu – dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; dīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, bhikkhuno evaṃcittassa kulāni upasaṅkamato na denti; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Lūkhaṃ denti, no paṇītaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Dandhaṃ denti, no sīghaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena bhikkhu na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Evarūpo kho, bhikkhave, bhikkhu arahati kulūpako hotuṃ. ‘‘Kassapo, bhikkhave, evaṃcitto kulāni upasaṅkamati – ‘taṃ kutettha labbhā parakulesu – dentuyeva me, mā nādaṃsu; bahukaññeva me dentu, mā thokaṃ; paṇītaññeva me dentu, mā lūkhaṃ; sīghaññeva me dentu, mā dandhaṃ; sakkaccaññeva me dentu, mā asakkacca’nti. Tassa ce, bhikkhave, kassapassa evaṃcittassa kulāni upasaṅkamato na denti; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Thokaṃ denti, no bahukaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Lūkhaṃ denti, no paṇītaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Dandhaṃ denti, no sīghaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Asakkaccaṃ denti, no sakkaccaṃ; tena kassapo na sandīyati; so na tatonidānaṃ dukkhaṃ domanassaṃ paṭisaṃvedayati. Kassapena vā hi vo, bhikkhave, ovadissāmi yo vā panassa kassapasadiso. Ovaditehi ca pana vo tathattāya paṭipajjitabba’’nti. Catutthaṃ.",
      "english": "While dwelling at Sāvatthī, the Blessed One said, “What do you think, monks, what kind of monk is fit to associate with families, and what kind of monk is not fit to associate with families?”\n\n“Our teachings, venerable sir, have the Blessed One as their root, their guide, their refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the monks will bear it in mind.”\n\n“Monks, if any monk approaches families with such a mindset: ‘May they give to me, may they not fail to give; may they give much to me, not little; may they give choice food to me, not coarse; may they give quickly to me, not slowly; may they give respectfully to me, not disrespectfully.’ If, monks, when such a monk approaches families, they do not give, that monk becomes vexed; he experiences suffering and dejection on that account. If they give little, not much, that monk becomes vexed; he experiences suffering and dejection on that account. If they give coarse food, not choice, that monk becomes vexed; he experiences suffering and dejection on that account. If they give slowly, not quickly, that monk becomes vexed; he experiences suffering and dejection on that account. If they give disrespectfully, not respectfully, that monk becomes vexed; he experiences suffering and dejection on that account. Monks, such a monk is not fit to associate with families.\n\n“But, monks, if a monk approaches families with such a mindset: ‘How indeed can one expect this from other families—that they should give to me, not fail to give; that they should give much to me, not little; that they should give choice food to me, not coarse; that they should give quickly to me, not slowly; that they should give respectfully to me, not disrespectfully?’ If, monks, when such a monk approaches families, they do not give, that monk does not become vexed; he does not experience suffering and dejection on that account. If they give little, not much, that monk does not become vexed; he does not experience suffering and dejection on that account. If they give coarse food, not choice, that monk does not become vexed; he does not experience suffering and dejection on that account. If they give slowly, not quickly, that monk does not become vexed; he does not experience suffering and dejection on that account. If they give disrespectfully, not respectfully, that monk does not become vexed; he does not experience suffering and dejection on that account. Monks, such a monk is fit to associate with families.\n\n“Monks, Kassapa approaches families with such a mindset: ‘How indeed can one expect this from other families—that they should give to me, not fail to give; that they should give much to me, not little; that they should give choice food to me, not coarse; that they should give quickly to me, not slowly; that they should give respectfully to me, not disrespectfully?’ If, monks, when Kassapa approaches families, they do not give, Kassapa does not become vexed; he does not experience suffering and dejection on that account. If they give little, not much, Kassapa does not become vexed; he does not experience suffering and dejection on that account. If they give coarse food, not choice, Kassapa does not become vexed; he does not experience suffering and dejection on that account. If they give slowly, not quickly, Kassapa does not become vexed; he does not experience suffering and dejection on that account. If they give disrespectfully, not respectfully, Kassapa does not become vexed; he does not experience suffering and dejection on that account.\n\n“Monks, I shall instruct you by Kassapa, or by one who is like Kassapa. And having been instructed, you should practice in such a way.”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි!\" කියා. \"වහන්සැ!\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: \"මහණෙනි, මේ ගැන කුමක් සිතන්නහුද? කවර ආකාරයේ භික්ෂුවක්ද ගෘහස්ථ කුලයන්ට සමීපව ඇසුරු කිරීමට සුදුසු වන්නේ? කවර ආකාරයේ භික්ෂුවක්ද ගෘහස්ථ කුලයන්ට සමීපව ඇසුරු කිරීමට නුසුදුසු වන්නේ?\"\n\"වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ ප්‍රධාන කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ. වහන්ස, භාග්‍යවතුන් වහන්සේටම මේ වචනයේ අර්ථය පැහැදිලි කිරීමට භාර වේවා. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරන්නාහ\"යි. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: \"මහණෙනි, යම්කිසි භික්ෂුවක්, 'මට දෙත්වාම, නොදෙන්වා නොවේවා; මට බොහෝ දේ දෙත්වාම, ස්වල්පයක් නොවේවා; මට ප්‍රණීත දේ දෙත්වාම, රළු දේ නොවේවා; මට ඉක්මනින්ම දෙත්වා, ප්‍රමාදව නොවේවා; මට ගෞරවයෙන් දෙත්වාම, අගෞරවයෙන් නොවේවා' යන මෙබඳු සිතකින් යුතුව ගෘහයන්ට පිවිසෙන්නේ නම්. මහණෙනි, මෙබඳු සිතකින් ගෘහයන්ට පිවිසෙන ඒ භික්ෂුවට යමක් නොදෙන්නාහු නම්, ඒ භික්ෂුව කුපිත වේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද විඳියි. ස්වල්පයක් දෙති, බොහෝ නොවේ නම්; ඒ භික්ෂුව කුපිත වේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද විඳියි. රළු දේ දෙති, ප්‍රණීත නොවේ නම්; ඒ භික්ෂුව කුපිත වේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද විඳියි. ප්‍රමාදව දෙති, ඉක්මනින් නොවේ නම්, ඒ භික්ෂුව කුපිත වේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද විඳියි. අගෞරවයෙන් දෙති, ගෞරවයෙන් නොවේ නම්; ඒ භික්ෂුව කුපිත වේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද විඳියි. මහණෙනි, මෙබඳු භික්ෂුවක් ගෘහස්ථ කුලයන්ට සමීපව ඇසුරු කිරීමට නුසුදුසුය.\"\n\n\"මහණෙනි, යම් භික්ෂුවක් නම්, 'අනුන්ගේ ගෘහයන්හි එය කෙසේ ලැබෙන්නද – මට දෙත්වාම, නොදෙන්වා නොවේවා; මට බොහෝ දේ දෙත්වාම, ස්වල්පයක් නොවේවා; මට ප්‍රණීත දේ දෙත්වාම, රළු දේ නොවේවා; මට ඉක්මනින්ම දෙත්වා, ප්‍රමාදව නොවේවා; මට ගෞරවයෙන් දෙත්වාම, අගෞරවයෙන් නොවේවා' යන මෙබඳු සිතකින් යුතුව ගෘහයන්ට පිවිසෙන්නේ නම්. මහණෙනි, මෙබඳු සිතකින් ගෘහයන්ට පිවිසෙන ඒ භික්ෂුවට යමක් නොදෙන්නාහු නම්; ඒ භික්ෂුව කුපිත නොවේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. ස්වල්පයක් දෙති, බොහෝ නොවේ නම්; ඒ භික්ෂුව කුපිත නොවේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. රළු දේ දෙති, ප්‍රණීත නොවේ නම්; ඒ භික්ෂුව කුපිත නොවේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. ප්‍රමාදව දෙති, ඉක්මනින් නොවේ නම්; ඒ භික්ෂුව කුපිත නොවේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. අගෞරවයෙන් දෙති, ගෞරවයෙන් නොවේ නම්; ඒ භික්ෂුව කුපිත නොවේ. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. මහණෙනි, මෙබඳු භික්ෂුවක් ගෘහස්ථ කුලයන්ට සමීපව ඇසුරු කිරීමට සුදුසුය.\"\n\n\"මහණෙනි, කස්සප තෙරණුවෝ, 'අනුන්ගේ ගෘහයන්හි එය කෙසේ ලැබෙන්නද – මට දෙත්වාම, නොදෙන්වා නොවේවා; මට බොහෝ දේ දෙත්වාම, ස්වල්පයක් නොවේවා; මට ප්‍රණීත දේ දෙත්වාම, රළු දේ නොවේවා; මට ඉක්මනින්ම දෙත්වා, ප්‍රමාදව නොවේවා; මට ගෞරවයෙන් දෙත්වාම, අගෞරවයෙන් නොවේවා' යන මෙබඳු සිතකින් යුතුව ගෘහයන්ට පිවිසෙති. මහණෙනි, මෙබඳු සිතකින් ගෘහයන්ට පිවිසෙන ඒ කස්සප තෙරණුවන්ට යමක් නොදෙන්නාහු නම්; ඒ කස්සප තෙරණුවෝ කුපිත නොවෙති. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. ස්වල්පයක් දෙති, බොහෝ නොවේ නම්; ඒ කස්සප තෙරණුවෝ කුපිත නොවෙති. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. රළු දේ දෙති, ප්‍රණීත නොවේ නම්; ඒ කස්සප තෙරණුවෝ කුපිත නොවෙති. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. ප්‍රමාදව දෙති, ඉක්මනින් නොවේ නම්; ඒ කස්සප තෙරණුවෝ කුපිත නොවෙති. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. අගෞරවයෙන් දෙති, ගෞරවයෙන් නොවේ නම්; ඒ කස්සප තෙරණුවෝ කුපිත නොවෙති. හේ ඒ හේතුවෙන් දුක් ද දොම්නස් ද නොවිඳියි. මහණෙනි, මම ඔබට කස්සප තෙරණුවන් හෝ කස්සප තෙරණුවන්ට සමාන යමෙකු හෝ උපමාවට ගෙන අවවාද කරන්නෙමි. අවවාද කරනු ලැබූ ඔබ විසින් නම් ඒ ආකාරයෙන්ම පිළිපැදිය යුතුය.\"",
      "paliTitle": "Kulūpakasuttaṃ",
      "vagga": "",
      "englishTitle": "One Who Frequents Families Sutta",
      "sinhalaTitle": "කුලූපක සූත්‍රය"
    },
    {
      "number": 148,
      "pali": "Evaṃ me sutaṃ…pe… rājagahe veḷuvane. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘jiṇṇosi dāni tvaṃ, kassapa, garukāni ca te imāni sāṇāni paṃsukūlāni nibbasanāni. Tasmātiha tvaṃ, kassapa, gahapatāni [gahapatikāni (sī.)] ceva cīvarāni dhārehi, nimantanāni ca bhuñjāhi, mama ca santike viharāhī’’ti. ‘‘Ahaṃ kho, bhante, dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva piṇḍapātikattassa ca vaṇṇavādī, paṃsukūliko ceva paṃsukūlikattassa ca vaṇṇavādī, tecīvariko ceva tecīvarikattassa ca vaṇṇavādī, appiccho ceva appicchatāya ca vaṇṇavādī, santuṭṭho ceva santuṭṭhiyā ca vaṇṇavādī, pavivitto ceva pavivekassa ca vaṇṇavādī, asaṃsaṭṭho ceva asaṃsaggassa ca vaṇṇavādī, āraddhavīriyo ceva vīriyārambhassa [vīriyārabbhassa (ka.)] ca vaṇṇavādī’’ti. ‘‘Kiṃ [kaṃ (ka.)] pana tvaṃ, kassapa, atthavasaṃ sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī’’ti? ‘‘Dve khvāhaṃ, bhante, atthavase sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī. Attano ca diṭṭhadhammasukhavihāraṃ sampassamāno, pacchimañca janataṃ anukampamāno – ‘appeva nāma pacchimā janatā diṭṭhānugatiṃ āpajjeyyuṃ’ [āpajjeyya (sī. syā. kaṃ.)]. ‘Ye kira te ahesuṃ buddhānubuddhasāvakā te dīgharattaṃ āraññikā ceva ahesuṃ āraññikattassa ca vaṇṇavādino…pe… piṇḍapātikā ceva ahesuṃ …pe… paṃsukūlikā ceva ahesuṃ… tecīvarikā ceva ahesuṃ… appicchā ceva ahesuṃ… santuṭṭhā ceva ahesuṃ… pavivittā ceva ahesuṃ… asaṃsaṭṭhā ceva ahesuṃ… āraddhavīriyā ceva ahesuṃ vīriyārambhassa ca vaṇṇavādino’ti. Te tathattāya paṭipajjissanti, tesaṃ taṃ bhavissati dīgharattaṃ hitāya sukhāya. ‘‘Ime khvāhaṃ, bhante, dve atthavase sampassamāno dīgharattaṃ āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī’’ti. ‘‘Sādhu sādhu, kassapa. Bahujanahitāya kira tvaṃ, kassapa, paṭipanno bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Tasmātiha tvaṃ, kassapa, sāṇāni ceva paṃsukūlāni dhārehi nibbasanāni, piṇḍāya ca carāhi, araññe ca viharāhī’’ti. Pañcamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. Then Venerable Mahākassapa approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. To Venerable Mahākassapa, who was seated to one side, the Blessed One said this:\n\n“You are now old, Kassapa, and these coarse rag-robes are burdensome for you. Therefore, Kassapa, wear robes donated by householders, eat invited meals, and live near me.”\n\n“Indeed, venerable sir, for a long time I have been a forest dweller and one who praises forest dwelling; an alms-round eater and one who praises eating alms food; a rag-robe wearer and one who praises wearing rag-robes; a three-robe wearer and one who praises wearing three robes; one with few wishes and one who praises having few wishes; content and one who praises contentment; secluded and one who praises seclusion; unentangled and one who praises non-entanglement; one who has aroused energy and one who praises the arousal of energy.”\n\n“But Kassapa, foreseeing what benefit have you for a long time been a forest dweller and one who praises forest dwelling; an alms-round eater and one who praises eating alms food; a rag-robe wearer and one who praises wearing rag-robes; a three-robe wearer and one who praises wearing three robes; one with few wishes and one who praises having few wishes; content and one who praises contentment; secluded and one who praises seclusion; unentangled and one who praises non-entanglement; one who has aroused energy and one who praises the arousal of energy?”\n\n“Venerable sir, it is foreseeing two benefits that I have for a long time been a forest dweller and one who praises forest dwelling; an alms-round eater and one who praises eating alms food; a rag-robe wearer and one who praises wearing rag-robes; a three-robe wearer and one who praises wearing three robes; one with few wishes and one who praises having few wishes; content and one who praises contentment; secluded and one who praises seclusion; unentangled and one who praises non-entanglement; one who has aroused energy and one who praises the arousal of energy. These two benefits are: foreseeing my own comfortable dwelling in this very life, and out of compassion for future generations, thinking, ‘May it be that future generations will follow this example: Indeed, those who were disciples enlightened after the Buddha were forest dwellers for a long time and praised forest dwelling; alms-round eaters and praised eating alms food; rag-robe wearers and praised wearing rag-robes; three-robe wearers and praised wearing three robes; those with few wishes and praised having few wishes; content and praised contentment; secluded and praised seclusion; unentangled and praised non-entanglement; those who had aroused energy and praised the arousal of energy.’ They will practice accordingly, and that will be for their long-term welfare and happiness.”\n\n“Excellent, excellent, Kassapa. Indeed, Kassapa, you are practicing for the welfare of many people, for the happiness of many people, out of compassion for the world, for the good, benefit, and happiness of gods and humans. Therefore, Kassapa, wear coarse rag-robes, go for alms, and dwell in the forest.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයෙහි වැඩසිටින සමයෙක.\n\nඑක් කලෙක ආයෂ්මත්වත් මහා කශ්‍යප ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹුණු සේක. එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වැඩහුන් සේක. එකත්පසෙක වැඩහුන් ආයෂ්මත්වත් මහා කශ්‍යප ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “කශ්‍යපය, දැන් ඔබ වයෝවෘද්ධය. තවද, ඔබට මේ කසළ ගොඩින් සොයාගත් රළු සිවුරු දැරීම දුෂ්කර ය. එබැවින් කශ්‍යපය, ඔබ ගෘහපතියන් විසින් දෙන ලද සිවුරු දරන්න. ආරාධනා කරන ලද දාන භුක්ති විඳින්න. මගේ සමීපයෙහි වැඩ වසන්න.”\n\n“භාග්‍යවතුන් වහන්ස, මම දීර්ඝ කාලයක් මුළුල්ලෙහි ආරණ්‍යක ජීවිතය රකින්නෙක් ද, ආරණ්‍යක ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. පිණ්ඩපාතික ජීවිතය රකින්නෙක් ද, පිණ්ඩපාතික ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. පන්සකුලික ජීවිතය රකින්නෙක් ද, පන්සකුලික ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. තේචීවරික ජීවිතය රකින්නෙක් ද, තේචීවරික ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. අල්පේච්ඡ ජීවිතය රකින්නෙක් ද, අල්පේච්ඡ ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. සන්තුෂ්ට ජීවිතය රකින්නෙක් ද, සන්තුෂ්ට ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. ප්‍රවිවෘත ජීවිතය රකින්නෙක් ද, ප්‍රවිවෘත ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. අසංසර්ගී ජීවිතය රකින්නෙක් ද, අසංසර්ගී ජීවිතය වර්ණනා කරන්නෙක් ද වෙමි. ආරද්ධ වීර්යය ඇතිව වාසය කරන්නෙක් ද, වීර්යය ආරම්භ කිරීම වර්ණනා කරන්නෙක් ද වෙමි.”\n\n“කශ්‍යපය, එසේ නම් ඔබ කුමන අර්ථයක් දැකීමෙන් ද දීර්ඝ කාලයක් මුළුල්ලෙහි ආරණ්‍යක ජීවිතය රකින්නෙක් ද, ආරණ්‍යක ජීවිතය වර්ණනා කරන්නෙක් ද, පිණ්ඩපාතික ජීවිතය රකින්නෙක් ද, පිණ්ඩපාතික ජීවිතය වර්ණනා කරන්නෙක් ද, පන්සකුලික ජීවිතය රකින්නෙක් ද, පන්සකුලික ජීවිතය වර්ණනා කරන්නෙක් ද, තේචීවරික ජීවිතය රකින්නෙක් ද, තේචීවරික ජීවිතය වර්ණනා කරන්නෙක් ද, අල්පේච්ඡ ජීවිතය රකින්නෙක් ද, අල්පේච්ඡ ජීවිතය වර්ණනා කරන්නෙක් ද, සන්තුෂ්ට ජීවිතය රකින්නෙක් ද, සන්තුෂ්ට ජීවිතය වර්ණනා කරන්නෙක් ද, ප්‍රවිවෘත ජීවිතය රකින්නෙක් ද, ප්‍රවිවෘත ජීවිතය වර්ණනා කරන්නෙක් ද, අසංසර්ගී ජීවිතය රකින්නෙක් ද, අසංසර්ගී ජීවිතය වර්ණනා කරන්නෙක් ද, ආරද්ධ වීර්යය ඇතිව වාසය කරන්නෙක් ද, වීර්යය ආරම්භ කිරීම වර්ණනා කරන්නෙක් ද වන්නේ?”\n\n“භාග්‍යවතුන් වහන්ස, මම අර්ථයන් දෙකක් දැකීමෙන් දීර්ඝ කාලයක් මුළුල්ලෙහි ආරණ්‍යක ජීවිතය රකින්නෙක් ද, ආරණ්‍යක ජීවිතය වර්ණනා කරන්නෙක් ද, පිණ්ඩපාතික ජීවිතය රකින්නෙක් ද, පිණ්ඩපාතික ජීවිතය වර්ණනා කරන්නෙක් ද, පන්සකුලික ජීවිතය රකින්නෙක් ද, පන්සකුලික ජීවිතය වර්ණනා කරන්නෙක් ද, තේචීවරික ජීවිතය රකින්නෙක් ද, තේචීවරික ජීවිතය වර්ණනා කරන්නෙක් ද, අල්පේච්ඡ ජීවිතය රකින්නෙක් ද, අල්පේච්ඡ ජීවිතය වර්ණනා කරන්නෙක් ද, සන්තුෂ්ට ජීවිතය රකින්නෙක් ද, සන්තුෂ්ට ජීවිතය වර්ණනා කරන්නෙක් ද, ප්‍රවිවෘත ජීවිතය රකින්නෙක් ද, ප්‍රවිවෘත ජීවිතය වර්ණනා කරන්නෙක් ද, අසංසර්ගී ජීවිතය රකින්නෙක් ද, අසංසර්ගී ජීවිතය වර්ණනා කරන්නෙක් ද, ආරද්ධ වීර්යය ඇතිව වාසය කරන්නෙක් ද, වීර්යය ආරම්භ කිරීම වර්ණනා කරන්නෙක් ද වෙමි. එනම්, තමන්ගේ වර්තමාන ජීවිතය තුළ සැප විහරණය දැකීමෙන් ද, අපර කාලීන ජනතාවට අනුකම්පා කිරීමෙන් ද (මම එසේ කරමි). 'සමහර විට අපර කාලීන ජනතාව මාගේ මේ ආදර්ශය අනුගමනය කරත්වා! සැබවින්ම, බුදුන් වහන්සේ අනුගමනය කළ ඒ ශ්‍රාවකයෝ දීර්ඝ කාලයක් මුළුල්ලෙහි ආරණ්‍යක ජීවිතය රකින්නෝ ද, ආරණ්‍යක ජීවිතය වර්ණනා කරන්නෝ ද වූහ. පිණ්ඩපාතික ජීවිතය රකින්නෝ ද, පිණ්ඩපාතික ජීවිතය වර්ණනා කරන්නෝ ද වූහ. පන්සකුලික ජීවිතය රකින්නෝ ද, පන්සකුලික ජීවිතය වර්ණනා කරන්නෝ ද වූහ. තේචීවරික ජීවිතය රකින්නෝ ද, තේචීවරික ජීවිතය වර්ණනා කරන්නෝ ද වූහ. අල්පේච්ඡ ජීවිතය රකින්නෝ ද, අල්පේච්ඡ ජීවිතය වර්ණනා කරන්නෝ ද වූහ. සන්තුෂ්ට ජීවිතය රකින්නෝ ද, සන්තුෂ්ට ජීවිතය වර්ණනා කරන්නෝ ද වූහ. ප්‍රවිවෘත ජීවිතය රකින්නෝ ද, ප්‍රවිවෘත ජීවිතය වර්ණනා කරන්නෝ ද වූහ. අසංසර්ගී ජීවිතය රකින්නෝ ද, අසංසර්ගී ජීවිතය වර්ණනා කරන්නෝ ද වූහ. ආරද්ධ වීර්යය ඇතිව වාසය කරන්නෝ ද, වීර්යය ආරම්භ කිරීම වර්ණනා කරන්නෝ ද වූහ.' ඔවුහු ද ඒ ආකාරයටම පිළිපදින්නට යෙදෙත්වා. එය ඔවුන්ට දීර්ඝ කාලයක් මුළුල්ලෙහි හිතසුව පිණිස පවතීවා. භාග්‍යවතුන් වහන්ස, මම මේ අර්ථයන් දෙක දැකීමෙන් ද දීර්ඝ කාලයක් මුළුල්ලෙහි ආරණ්‍යක ජීවිතය රකින්නෙක් ද, ආරණ්‍යක ජීවිතය වර්ණනා කරන්නෙක් ද, පිණ්ඩපාතික ජීවිතය රකින්නෙක් ද, පිණ්ඩපාතික ජීවිතය වර්ණනා කරන්නෙක් ද, පන්සකුලික ජීවිතය රකින්නෙක් ද, පන්සකුලික ජීවිතය වර්ණනා කරන්නෙක් ද, තේචීවරික ජීවිතය රකින්නෙක් ද, තේචීවරික ජීවිතය වර්ණනා කරන්නෙක් ද, අල්පේච්ඡ ජීවිතය රකින්නෙක් ද, අල්පේච්ඡ ජීවිතය වර්ණනා කරන්නෙක් ද, සන්තුෂ්ට ජීවිතය රකින්නෙක් ද, සන්තුෂ්ට ජීවිතය වර්ණනා කරන්නෙක් ද, ප්‍රවිවෘත ජීවිතය රකින්නෙක් ද, ප්‍රවිවෘත ජීවිතය වර්ණනා කරන්නෙක් ද, අසංසර්ගී ජීවිතය රකින්නෙක් ද, අසංසර්ගී ජීවිතය වර්ණනා කරන්නෙක් ද, ආරද්ධ වීර්යය ඇතිව වාසය කරන්නෙක් ද, වීර්යය ආරම්භ කිරීම වර්ණනා කරන්නෙක් ද වෙමි.”\n\n“සාදු සාදු කශ්‍යපය. කශ්‍යපය, සැබවින්ම ඔබ බොහෝ දෙනාගේ හිත පිණිස ද, බොහෝ දෙනාගේ සැපය පිණිස ද, ලෝකයා කෙරෙහි අනුකම්පාවෙන් ද, දෙවිමිනිසුන්ගේ අර්ථය පිණිස ද, හිත පිණිස ද, සැපය පිණිස ද පිළිපදින්නෙකි. එබැවින් කශ්‍යපය, ඔබ පෙර පරිදිම රළු කසළ සිවුරුම දරන්න. පිණ්ඩපාතයේම හැසිරෙන්න. ආරණ්‍යයෙහිම වාසය කරන්න.”\n\nපස්වැනි සූත්‍රයයි.",
      "paliTitle": "Jiṇṇasuttaṃ",
      "vagga": "",
      "englishTitle": "The Aged Sutta",
      "sinhalaTitle": "ජිණ්ණ සූත්‍රය"
    },
    {
      "number": 149,
      "pali": "Rājagahe veḷuvane. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa, bhikkhū ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti. ‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā, akkhamā, appadakkhiṇaggāhino anusāsaniṃ. Idhāhaṃ, bhante, addasaṃ bhaṇḍañca [bhaṇḍuñca (sī.)] nāma bhikkhuṃ ānandassa saddhivihāriṃ abhijikañca [ābhiñjikañca (sī. ka.), ābhijjikañca (syā. kaṃ.)] nāma bhikkhuṃ anuruddhassa saddhivihāriṃ aññamaññaṃ sutena accāvadante – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti. Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena bhaṇḍañca bhikkhuṃ ānandassa saddhivihāriṃ abhijikañca bhikkhuṃ anuruddhassa saddhivihāriṃ āmantehi – ‘satthā āyasmante āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘satthā āyasmante āmantetī’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te bhikkhū bhagavā etadavoca – ‘‘saccaṃ kira tumhe, bhikkhave, aññamaññaṃ sutena accāvadatha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Kiṃ nu kho me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha – ‘etha tumhe, bhikkhave, aññamaññaṃ sutena accāvadatha – ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘No ce kira me tumhe, bhikkhave, evaṃ dhammaṃ desitaṃ ājānātha, atha kiṃ carahi tumhe, moghapurisā, kiṃ jānantā kiṃ passantā evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadatha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’’’ti. Atha kho te bhikkhū bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocuṃ – ‘‘accayo no, bhante, accagamā, yathābāle yathāmūḷhe yathāakusale [yathā bāle yathā mūḷhe yathā akusale (pī.), yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ (?)], ye mayaṃ evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadimha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’ti. Tesaṃ no, bhante, bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃ saṃvarāyā’’ti. ‘‘Taggha tumhe, bhikkhave, accayo accagamā yathābāle yathāmūḷhe yathāakusale, ye tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā aññamaññaṃ sutena accāvadittha – ‘ehi, bhikkhu, ko bahutaraṃ bhāsissati, ko sundarataraṃ bhāsissati, ko cirataraṃ bhāsissatī’ti. Yato ca kho tumhe, bhikkhave, accayaṃ accayato disvā yathādhammaṃ paṭikarotha, taṃ vo mayaṃ [mayaṃ accayaṃ (sī.)] paṭiggaṇhāma. Vuddhi hesā, bhikkhave, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiñca saṃvaraṃ āpajjatī’’ti. Chaṭṭhaṃ.",
      "english": "In Rājagaha, at the Veluvana. Then the Venerable Mahākassapa approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. As the Venerable Mahākassapa was sitting to one side, the Blessed One said to him: \"Kassapa, instruct the bhikkhus; Kassapa, deliver a discourse on the Dhamma to the bhikkhus. Either I, Kassapa, could instruct the bhikkhus, or you could; either I could deliver a discourse on the Dhamma to the bhikkhus, or you could.\" \"Indeed, venerable sir, nowadays the bhikkhus are difficult to admonish, endowed with qualities that make them difficult to admonish, impatient, and unskillful in receiving instruction. Here, venerable sir, I saw a bhikkhu named Bhaṇḍa, a co-resident of Venerable Ānanda, and a bhikkhu named Abhijika, a co-resident of Venerable Anuruddha, challenging each other regarding their knowledge of the teachings, saying: 'Come, bhikkhu, who will speak more, who will speak more beautifully, who will speak for a longer time?'\"\n\nThen the Blessed One addressed a certain bhikkhu: \"Come, bhikkhu, in my name, summon the bhikkhu Bhaṇḍa, a co-resident of Venerable Ānanda, and the bhikkhu Abhijika, a co-resident of Venerable Anuruddha, saying: 'The Teacher summons the venerable ones.'\" \"Yes, venerable sir,\" that bhikkhu replied to the Blessed One and approached those bhikkhus; having approached, he said to those bhikkhus: \"The Teacher summons the venerable ones.\" \"Yes, friend,\" those bhikkhus replied to that bhikkhu and approached the Blessed One; having approached and paid homage to the Blessed One, they sat down to one side.\n\nAs those bhikkhus were sitting to one side, the Blessed One said to them: \"Is it true, bhikkhus, that you challenged each other regarding your knowledge of the teachings, saying: 'Come, bhikkhu, who will speak more, who will speak more beautifully, who will speak for a longer time?'\" \"Yes, venerable sir.\" \"Bhikkhus, do you understand that this Dhamma was taught by me in this way: 'Come, bhikkhus, challenge each other regarding your knowledge of the teachings, saying: Come, bhikkhu, who will speak more, who will speak more beautifully, who will speak for a longer time?'\" \"No, venerable sir.\" \"If, then, bhikkhus, you do not understand that this Dhamma was taught by me in this way, then why, you foolish men, knowing what, seeing what, having gone forth into this well-proclaimed Dhamma-Vinaya, do you challenge each other regarding your knowledge of the teachings, saying: 'Come, bhikkhu, who will speak more, who will speak more beautifully, who will speak for a longer time?'\"\n\nThen those bhikkhus prostrated themselves at the feet of the Blessed One and said to him: \"An offense has indeed come upon us, venerable sir, just as foolish, deluded, and unskillful ones, in that we, having gone forth into this well-proclaimed Dhamma-Vinaya, challenged each other regarding our knowledge of the teachings, saying: 'Come, bhikkhu, who will speak more, who will speak more beautifully, who will speak for a longer time?' May the Blessed One, venerable sir, accept our offense as an offense, for future restraint.\" \"Indeed, bhikkhus, an offense has come upon you, just as foolish, deluded, and unskillful ones, in that you, having gone forth into this well-proclaimed Dhamma-Vinaya, challenged each other regarding your knowledge of the teachings, saying: 'Come, bhikkhu, who will speak more, who will speak more beautifully, who will speak for a longer time?' But since, bhikkhus, you see the offense as an offense and make amends according to the Dhamma, we accept that from you. This, bhikkhus, is growth in the Noble Discipline: to see an offense as an offense, to make amends according to the Dhamma, and to undertake future restraint.\"",
      "sinhala": "රාජගහ නුවර වේළුවනාරාමයේදී. ඉන්පසු ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක්පසෙක වැඩහුන්හ. එක්පසෙක වැඩහුන් ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “කාශ්‍යපයෙනි, භික්ෂූන්ට අවවාද කරන්න. කාශ්‍යපයෙනි, භික්ෂූන්ට ධර්ම කථාවක් කරන්න. කාශ්‍යපයෙනි, මම හෝ ඔබ හෝ භික්ෂූන්ට අවවාද කරනු ඇත. මම හෝ ඔබ හෝ භික්ෂූන්ට ධර්ම කථාවක් කරනු ඇත.”\n\n“ස්වාමීනි, දැනට භික්ෂූහු අවවාද කිරීමට අපහසු වෙති; දුර්වච භාවයට හේතුවන ධර්මයන්ගෙන් යුක්ත වූ, අනුශාසනා නොඉවසන, අවවාද ගෞරවයෙන් නොපිළිගන්නා සුළු වෙති. ස්වාමීනි, මෙහිදී මම ආනන්ද තෙරුන්ගේ සද්ධිවිහාරික භාණ්ඩ නම් භික්ෂුවද, අනුරුද්ධ තෙරුන්ගේ සද්ධිවිහාරික අභිජික නම් භික්ෂුවද, එකිනෙකාට තම ශ්‍රැතිය මුල්කරගෙන, ‘එන්න, භික්ෂුව, කවුද වැඩිපුර කතා කරන්නේ, කවුද වඩා ලස්සනට කතා කරන්නේ, කවුද වැඩි වේලාවක් කතා කරන්නේ’ යැයි තරඟ කරනවා දුටුවෙමි.”\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ එක්තරා භික්ෂුවක් අමතා, “එන්න, භික්ෂුව, ඔබ මාගේ වචනයෙන් ආනන්ද තෙරුන්ගේ සද්ධිවිහාරික භාණ්ඩ නම් භික්ෂුවද, අනුරුද්ධ තෙරුන්ගේ සද්ධිවිහාරික අභිජික නම් භික්ෂුවද අමතා, ‘ශාස්තෘන් වහන්සේ ආයුෂ්මතුන් වහන්සේලා අමතන සේකැ’යි කියන්නැ”යි වදාළ සේක. “එසේය, ස්වාමීනි” යැයි එම භික්ෂුව භාග්‍යවතුන් වහන්සේට ප්‍රතිඥා දී, එම භික්ෂූන් වහන්සේලා වැඩසිටි තැනට පැමිණ, එම භික්ෂූන් වහන්සේලාට, “ශාස්තෘන් වහන්සේ ආයුෂ්මතුන් වහන්සේලා අමතන සේකැ”යි කීය. “එසේය, ආයුෂ්මත්නි” යැයි එම භික්ෂූන් වහන්සේලා එම භික්ෂුවට ප්‍රතිඥා දී, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක්පසෙක වැඩහුන්හ. එක්පසෙක වැඩහුන් එම භික්ෂූන් වහන්සේලාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, නුඹලා සැබවින්ම එකිනෙකාට තම ශ්‍රැතිය මුල්කරගෙන, ‘එන්න, භික්ෂුව, කවුද වැඩිපුර කතා කරන්නේ, කවුද වඩා ලස්සනට කතා කරන්නේ, කවුද වැඩි වේලාවක් කතා කරන්නේ’ යැයි තරඟ කරනවාද?”\n\n“එසේය, ස්වාමීනි.”\n\n“මහණෙනි, මා විසින් මේ ධර්මය දේශනා කරනු ලැබූයේ, ‘මහණෙනි, නුඹලා එකිනෙකාට තම ශ්‍රැතිය මුල්කරගෙන, ‘එන්න, භික්ෂුව, කවුද වැඩිපුර කතා කරන්නේ, කවුද වඩා ලස්සනට කතා කරන්නේ, කවුද වැඩි වේලාවක් කතා කරන්නේ’ යැයි තරඟ කරනු පිණිස’ යැයි නුඹලා දන්නවාද?”\n\n“එසේ නොවේ, ස්වාමීනි.”\n\n“මහණෙනි, මා විසින් මේ ධර්මය දේශනා කරනු ලැබූයේ එසේ නොවන බව නුඹලා දන්නවා නම්, එසේනම්, මෝඝ පුරුෂයෙනි, කුමක් දැනගෙන, කුමක් දැකගෙනද, මෙසේ මනාකොට දේශනා කරන ලද ධර්ම විනයෙහි පැවිදි වූ නුඹලා එකිනෙකාට තම ශ්‍රැතිය මුල්කරගෙන, ‘එන්න, භික්ෂුව, කවුද වැඩිපුර කතා කරන්නේ, කවුද වඩා ලස්සනට කතා කරන්නේ, කවුද වැඩි වේලාවක් කතා කරන්නේ’ යැයි තරඟ කරන්නේ?”\n\nඉන්පසු එම භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේගේ පාදයන්හි හිසින් වැටී භාග්‍යවතුන් වහන්සේට මෙය කීහ: “ස්වාමීනි, අපට වැරදීමක් සිදු විය, අපි මෝඩයන් ලෙස, මුළාවූවන් ලෙස, අදක්ෂයන් ලෙස, මෙසේ මනාකොට දේශනා කරන ලද ධර්ම විනයෙහි පැවිදිව සිටිමින් එකිනෙකාට තම ශ්‍රැතිය මුල්කරගෙන, ‘එන්න, භික්ෂුව, කවුද වැඩිපුර කතා කරන්නේ, කවුද වඩා ලස්සනට කතා කරන්නේ, කවුද වැඩි වේලාවක් කතා කරන්නේ’ යැයි තරඟ කළෙමු. ස්වාමීනි, අපට වූ එම වරද, එය වරදක් ලෙස සලකා, භාග්‍යවතුන් වහන්සේ එය පිළිගන්නා සේක්වා, අනාගතයේදී සංවරය පිණිස.”\n\n“නියත වශයෙන්ම මහණෙනි, නුඹලාට වරදක් සිදු විය, නුඹලා මෝඩයන් ලෙස, මුළාවූවන් ලෙස, අදක්ෂයන් ලෙස, මෙසේ මනාකොට දේශනා කරන ලද ධර්ම විනයෙහි පැවිදිව සිටිමින් එකිනෙකාට තම ශ්‍රැතිය මුල්කරගෙන, ‘එන්න, භික්ෂුව, කවුද වැඩිපුර කතා කරන්නේ, කවුද වඩා ලස්සනට කතා කරන්නේ, කවුද වැඩි වේලාවක් කතා කරන්නේ’ යැයි තරඟ කළ බැවින්. මහණෙනි, යම් හෙයකින් නුඹලා තම වරද, වරදක් ලෙස දැක, ධර්මානුකූලව පිළිසකර කරන්නේද, ඒ වරද අපි පිළිගනිමු. මහණෙනි, යමෙක් වරදක් වරදක් ලෙස දැක, ධර්මානුකූලව එය පිළිසකර කරන්නේද, අනාගතයේදී සංවරය ඇති කරගන්නේද, ආර්ය විනයෙහි එය වර්ධනයකි.”\n\nහයවැනි සූත්‍රයයි.",
      "paliTitle": "Ovādasuttaṃ",
      "vagga": "",
      "englishTitle": "Admonition Sutta",
      "sinhalaTitle": "ඕවාද සූත්‍රය"
    },
    {
      "number": 150,
      "pali": "Rājagahe viharati veḷuvane [sāvatthi, tatra-etadavoca (sī.)]. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa, bhikkhū ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti. ‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā akkhamā appadakkhiṇaggāhino anusāsaniṃ. Yassa kassaci, bhante, saddhā natthi kusalesu dhammesu, hirī [hiri (sabbattha)] natthi kusalesu dhammesu, ottappaṃ natthi kusalesu dhammesu, vīriyaṃ natthi kusalesu dhammesu, paññā natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati [āgacchanti (sī.)], hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. ‘‘Seyyathāpi, bhante, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena, hāyati maṇḍalena, hāyati ābhāya, hāyati ārohapariṇāhena. Evameva kho, bhante, yassa kassaci saddhā natthi kusalesu dhammesu…pe… hirī natthi… ottappaṃ natthi … vīriyaṃ natthi… paññā natthi… kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. ‘‘‘Assaddho purisapuggalo’ti, bhante, parihānametaṃ; ‘ahiriko purisapuggalo’ti, bhante, parihānametaṃ; ‘anottappī purisapuggalo’ti, bhante, parihānametaṃ; ‘kusīto purisapuggalo’ti, bhante, parihānametaṃ; ‘duppañño purisapuggalo’ti, bhante, parihānametaṃ; ‘kodhano purisapuggalo’ti, bhante, parihānametaṃ; ‘upanāhī purisapuggalo’ti, bhante, parihānametaṃ; ‘na santi bhikkhū ovādakā’ti, bhante, parihānametaṃ. ‘‘Yassa kassaci, bhante, saddhā atthi kusalesu dhammesu, hirī atthi kusalesu dhammesu, ottappaṃ atthi kusalesu dhammesu, vīriyaṃ atthi kusalesu dhammesu, paññā atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. ‘‘Seyyathāpi, bhante, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena, vaḍḍhati maṇḍalena, vaḍḍhati ābhāya, vaḍḍhati ārohapariṇāhena. Evameva kho, bhante, yassa kassaci saddhā atthi kusalesu dhammesu… hirī atthi…pe… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. ‘‘‘Saddho purisapuggalo’ti, bhante, aparihānametaṃ; ‘hirimā purisapuggalo’ti, bhante, aparihānametaṃ; ‘ottappī purisapuggalo’ti, bhante, aparihānametaṃ; ‘āraddhavīriyo purisapuggalo’ti, bhante, aparihānametaṃ; ‘paññavā purisapuggalo’ti, bhante, aparihānametaṃ; ‘akkodhano purisapuggalo’ti, bhante, aparihānametaṃ; ‘anupanāhī purisapuggalo’ti, bhante, aparihānametaṃ; ‘santi bhikkhū ovādakā’ti, bhante, aparihānameta’’nti. ‘‘Sādhu sādhu, kassapa. Yassa kassaci, kassapa, saddhā natthi kusalesu dhammesu…pe… hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. ‘‘Seyyathāpi, kassapa, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena… pe… hāyati ārohapariṇāhena. Evameva kho, kassapa, yassa kassaci saddhā natthi kusalesu dhammesu… pe… hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. ‘Assaddho purisapuggalo’ti, kassapa, parihānametaṃ; ahiriko…pe… anottappī… kusīto… duppañño… kodhano… ‘upanāhī purisapuggalo’ti, kassapa, parihānametaṃ; ‘na santi bhikkhū ovādakā’ti, kassapa, parihānametaṃ. ‘‘Yassa kassaci, kassapa, saddhā atthi kusalesu dhammesu…pe… hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. ‘‘Seyyathāpi, kassapa, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena, vaḍḍhati maṇḍalena, vaḍḍhati ābhāya, vaḍḍhati ārohapariṇāhena. Evameva kho, kassapa, yassa kassaci saddhā atthi kusalesu dhammesu hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. ‘‘‘Saddho purisapuggalo’ti, kassapa, aparihānametaṃ; hirimā…pe… ottappī… āraddhavīriyo… paññavā… akkodhano… ‘anupanāhī purisapuggalo’ti, kassapa, aparihānametaṃ; ‘santi bhikkhū ovādakā’ti, kassapa, aparihānameta’’nti. Sattamaṃ.",
      "english": "At Rājagaha, in the Bamboo Grove. Then the Venerable Mahākassapa approached the Blessed One, paid homage, and sat down to one side. When the Venerable Mahākassapa was seated to one side, the Blessed One said to him: “Kassapa, admonish the monastics; Kassapa, deliver a discourse on the Dhamma to the monastics. Either I, Kassapa, would admonish the monastics, or you would; either I would deliver a discourse on the Dhamma to the monastics, or you would.”\n\n“Indeed, venerable sir, nowadays monastics are difficult to instruct, endowed with qualities that make them intractable, impatient, and unreceptive to guidance. Venerable sir, for anyone who does not have faith in wholesome qualities, who does not have moral shame in wholesome qualities, who does not have moral dread in wholesome qualities, who does not have persistence in wholesome qualities, who does not have wisdom in wholesome qualities—for such a person, whatever night or day comes, only decline in wholesome qualities can be expected, not growth.”\n\n“Just as, venerable sir, during the dark half of the month, for the moon, whatever night or day comes, it declines in luster, declines in its disc, declines in radiance, declines in its size and fullness. Even so, venerable sir, for anyone who does not have faith in wholesome qualities, who does not have moral shame in wholesome qualities, who does not have moral dread in wholesome qualities, who does not have persistence in wholesome qualities, who does not have wisdom in wholesome qualities—for such a person, whatever night or day comes, only decline in wholesome qualities can be expected, not growth.”\n\n“‘An unfaithful person’—this, venerable sir, is a decline; ‘a shameless person’—this, venerable sir, is a decline; ‘a person fearless of wrong-doing’—this, venerable sir, is a decline; ‘an indolent person’—this, venerable sir, is a decline; ‘a witless person’—this, venerable sir, is a decline; ‘an angry person’—this, venerable sir, is a decline; ‘a resentful person’—this, venerable sir, is a decline; ‘there are no monastics who give admonition’—this, venerable sir, is a decline.”\n\n“Venerable sir, for anyone who has faith in wholesome qualities, who has moral shame in wholesome qualities, who has moral dread in wholesome qualities, who has persistence in wholesome qualities, who has wisdom in wholesome qualities—for such a person, whatever night or day comes, only growth in wholesome qualities can be expected, not decline.”\n\n“Just as, venerable sir, during the bright half of the month, for the moon, whatever night or day comes, it grows in luster, grows in its disc, grows in radiance, grows in its size and fullness. Even so, venerable sir, for anyone who has faith in wholesome qualities, who has moral shame in wholesome qualities, who has moral dread in wholesome qualities, who has persistence in wholesome qualities, who has wisdom in wholesome qualities—for such a person, whatever night or day comes, only growth in wholesome qualities can be expected, not decline.”\n\n“‘A faithful person’—this, venerable sir, is not a decline; ‘a morally ashamed person’—this, venerable sir, is not a decline; ‘a morally dreaded person’—this, venerable sir, is not a decline; ‘a person of aroused persistence’—this, venerable sir, is not a decline; ‘a wise person’—this, venerable sir, is not a decline; ‘a non-angry person’—this, venerable sir, is not a decline; ‘a non-resentful person’—this, venerable sir, is not a decline; ‘there are monastics who give admonition’—this, venerable sir, is not a decline.”\n\n“Excellent, excellent, Kassapa. For anyone, Kassapa, who does not have faith in wholesome qualities, who does not have moral shame in wholesome qualities, who does not have moral dread in wholesome qualities, who does not have persistence in wholesome qualities, who does not have wisdom in wholesome qualities—for such a person, whatever night or day comes, only decline in wholesome qualities can be expected, not growth.”\n\n“Just as, Kassapa, during the dark half of the month, for the moon, whatever night or day comes, it declines in luster, declines in its disc, declines in radiance, declines in its size and fullness. Even so, Kassapa, for anyone who does not have faith in wholesome qualities, who does not have moral shame in wholesome qualities, who does not have moral dread in wholesome qualities, who does not have persistence in wholesome qualities, who does not have wisdom in wholesome qualities—for such a person, whatever night or day comes, only decline in wholesome qualities can be expected, not growth. ‘An unfaithful person’—this, Kassapa, is a decline; ‘a shameless person’—this, Kassapa, is a decline; ‘a person fearless of wrong-doing’—this, Kassapa, is a decline; ‘an indolent person’—this, Kassapa, is a decline; ‘a witless person’—this, Kassapa, is a decline; ‘an angry person’—this, Kassapa, is a decline; ‘a resentful person’—this, Kassapa, is a decline; ‘there are no monastics who give admonition’—this, Kassapa, is a decline.”\n\n“For anyone, Kassapa, who has faith in wholesome qualities, who has moral shame in wholesome qualities, who has moral dread in wholesome qualities, who has persistence in wholesome qualities, who has wisdom in wholesome qualities—for such a person, whatever night or day comes, only growth in wholesome qualities can be expected, not decline.”\n\n“Just as, Kassapa, during the bright half of the month, for the moon, whatever night or day comes, it grows in luster, grows in its disc, grows in radiance, grows in its size and fullness.”\n\nJust so, Kassapa, whoever has faith in wholesome states, has moral shame, has moral dread, has energy, has wisdom in wholesome states—for them, whatever night or day comes, only growth in wholesome states is to be expected, not decline. ‘That person is endowed with faith,’ Kassapa, is a condition for non-decline. ‘That person is morally ashamed,’ Kassapa, is a condition for non-decline. ‘That person is morally dreading,’ Kassapa, is a condition for non-decline. ‘That person has aroused energy,’ Kassapa, is a condition for non-decline. ‘That person is endowed with wisdom,’ Kassapa, is a condition for non-decline. ‘That person is not angry,’ Kassapa, is a condition for non-decline. ‘That person is not resentful,’ Kassapa, is a condition for non-decline. ‘There are monastics who give advice,’ Kassapa, is a condition for non-decline.",
      "sinhala": "රජගහ නුවර වේළුවනාරාමයේ භාග්‍යවතුන් වහන්සේ වැඩසිටින සේක. ඉන්පසු ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹ, වැඳ, එකත්පසෙක වැඩසිටි සේක. එකත්පසෙක වැඩසිටි ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"කාශ්‍යපය, භික්ෂූන්ට අවවාද කරන්න; කාශ්‍යපය, භික්ෂූන්ට ධර්ම කථාවක් කරන්න. කාශ්‍යපය, මම හෝ භික්ෂූන්ට අවවාද කරන්නෙමි, ඔබ හෝ අවවාද කරන්න. මම හෝ භික්ෂූන්ට ධර්ම කථාවක් කරන්නෙමි, ඔබ හෝ ධර්ම කථාවක් කරන්න.\"\n\n\"වහන්ස, මේ දිනවල භික්ෂූහු දොම්නස් කරවන ධර්මයන්ගෙන් යුක්තව, අවවාද නොඉවසන, නිසි පරිදි පිළිනොගන්නා, අවවාදවලට දුෂ්කර වූ අය වෙති. වහන්ස, යම් කිසිවෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් නැද්ද, කුසල ධර්මයන් කෙරෙහි හිරියක් නැද්ද, කුසල ධර්මයන් කෙරෙහි ඔත්තප්පයක් නැද්ද, කුසල ධර්මයන් කෙරෙහි වීර්යයක් නැද්ද, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාවක් නැද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගෙන් පිරිහීමම අපේක්ෂා කළ යුතුය, දියුණුවක් නොවේ.\"\n\n\"වහන්ස, යම් සේ කළු පැත්තෙහි (අවපක්ෂයෙහි) සඳුට දිනෙන් දින, රැය හෝ දවස ගෙවී යන විට, වර්ණයෙන් පිරිහෙන්නේද, මණ්ඩලයෙන් (ප්‍රමාණයෙන්) පිරිහෙන්නේද, ආලෝකයෙන් පිරිහෙන්නේද, පූර්ණත්වයෙන් පිරිහෙන්නේද, එලෙසින්ම වහන්ස, යම් කිසිවෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් නැද්ද, හිරියක් නැද්ද, ඔත්තප්පයක් නැද්ද, වීර්යයක් නැද්ද, ප්‍රඥාවක් නැද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගෙන් පිරිහීමම අපේක්ෂා කළ යුතුය, දියුණුවක් නොවේ.\"\n\n\"'අශ්‍රද්ධාවන්ත පුද්ගලයා' යනු, වහන්ස, පිරිහීමකි. 'හිරි නැති පුද්ගලයා' යනු, වහන්ස, පිරිහීමකි. 'ඔත්තප්ප නැති පුද්ගලයා' යනු, වහන්ස, පිරිහීමකි. 'කම්මැලි පුද්ගලයා' යනු, වහන්ස, පිරිහීමකි. 'දුෂ්ප්‍රඥා පුද්ගලයා' යනු, වහන්ස, පිරිහීමකි. 'ක්‍රෝධ සහිත පුද්ගලයා' යනු, වහන්ස, පිරිහීමකි. 'වෛර බඳින පුද්ගලයා' යනු, වහන්ස, පිරිහීමකි. 'අවවාද කරන භික්ෂූන් නොමැති බව' යනු, වහන්ස, පිරිහීමකි.\"\n\n\"වහන්ස, යමෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් ඇද්ද, කුසල ධර්මයන් කෙරෙහි හිරියක් ඇද්ද, කුසල ධර්මයන් කෙරෙහි ඔත්තප්පයක් ඇද්ද, කුසල ධර්මයන් කෙරෙහි වීර්යයක් ඇද්ද, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාවක් ඇද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගේ දියුණුවම අපේක්ෂා කළ යුතුය, පිරිහීමක් නොවේ.\"\n\n\"වහන්ස, යම් සේ පුර පක්ෂයෙහි සඳුට දිනෙන් දින, රැය හෝ දවස ගෙවී යන විට, වර්ණයෙන් වැඩෙන්නේද, මණ්ඩලයෙන් (ප්‍රමාණයෙන්) වැඩෙන්නේද, ආලෝකයෙන් වැඩෙන්නේද, පූර්ණත්වයෙන් වැඩෙන්නේද, එලෙසින්ම වහන්ස, යම් කිසිවෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් ඇද්ද, හිරියක් ඇද්ද, ඔත්තප්පයක් ඇද්ද, වීර්යයක් ඇද්ද, ප්‍රඥාවක් ඇද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගේ දියුණුවම අපේක්ෂා කළ යුතුය, පිරිහීමක් නොවේ.\"\n\n\"'ශ්‍රද්ධාවන්ත පුද්ගලයා' යනු, වහන්ස, නොපිරිහීමකි (දියුණුවකි). 'හිරි ඇති පුද්ගලයා' යනු, වහන්ස, නොපිරිහීමකි. 'ඔත්තප්ප ඇති පුද්ගලයා' යනු, වහන්ස, නොපිරිහීමකි. 'වීර්යවන්ත පුද්ගලයා' යනු, වහන්ස, නොපිරිහීමකි. 'ප්‍රඥාවන්ත පුද්ගලයා' යනු, වහන්ස, නොපිරිහීමකි. 'ක්‍රෝධ රහිත පුද්ගලයා' යනු, වහන්ස, නොපිරිහීමකි. 'වෛර නොබඳින පුද්ගලයා' යනු, වහන්ස, නොපිරිහීමකි. 'අවවාද කරන භික්ෂූන් සිටීම' යනු, වහන්ස, නොපිරිහීමකි.\"\n\n\"සාදු සාදු, කාශ්‍යපය. කාශ්‍යපය, යමෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් නැද්ද, හිරියක් නැද්ද, ඔත්තප්පයක් නැද්ද, වීර්යයක් නැද්ද, ප්‍රඥාවක් නැද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගෙන් පිරිහීමම අපේක්ෂා කළ යුතුය, දියුණුවක් නොවේ.\"\n\n\"කාශ්‍යපය, යම් සේ කළු පැත්තෙහි (අවපක්ෂයෙහි) සඳුට දිනෙන් දින, රැය හෝ දවස ගෙවී යන විට, වර්ණයෙන් පිරිහෙන්නේද, මණ්ඩලයෙන් (ප්‍රමාණයෙන්) පිරිහෙන්නේද, ආලෝකයෙන් පිරිහෙන්නේද, පූර්ණත්වයෙන් පිරිහෙන්නේද, එලෙසින්ම කාශ්‍යපය, යම් කිසිවෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් නැද්ද, හිරියක් නැද්ද, ඔත්තප්පයක් නැද්ද, වීර්යයක් නැද්ද, ප්‍රඥාවක් නැද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගෙන් පිරිහීමම අපේක්ෂා කළ යුතුය, දියුණුවක් නොවේ.\"\n\n\"'අශ්‍රද්ධාවන්ත පුද්ගලයා' යනු, කාශ්‍යපය, පිරිහීමකි. 'හිරි නැති පුද්ගලයා' යනු, පිරිහීමකි. 'ඔත්තප්ප නැති පුද්ගලයා' යනු, පිරිහීමකි. 'කම්මැලි පුද්ගලයා' යනු, පිරිහීමකි. 'දුෂ්ප්‍රඥා පුද්ගලයා' යනු, පිරිහීමකි. 'ක්‍රෝධ සහිත පුද්ගලයා' යනු, පිරිහීමකි. 'වෛර බඳින පුද්ගලයා' යනු, කාශ්‍යපය, පිරිහීමකි. 'අවවාද කරන භික්ෂූන් නොමැති බව' යනු, කාශ්‍යපය, පිරිහීමකි.\"\n\n\"කාශ්‍යපය, යමෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් ඇද්ද, හිරියක් ඇද්ද, ඔත්තප්පයක් ඇද්ද, වීර්යයක් ඇද්ද, ප්‍රඥාවක් ඇද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගේ දියුණුවම අපේක්ෂා කළ යුතුය, පිරිහීමක් නොවේ.\"\n\n\"කාශ්‍යපය, යම් සේ පුර පක්ෂයෙහි සඳුට දිනෙන් දින, රැය හෝ දවස ගෙවී යන විට, වර්ණයෙන් වැඩෙන්නේද, මණ්ඩලයෙන් (ප්‍රමාණයෙන්) වැඩෙන්නේද, ආලෝකයෙන් වැඩෙන්නේද, පූර්ණත්වයෙන් වැඩෙන්නේද, එලෙසින්ම කාශ්‍යපය, යම් කිසිවෙකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාවක් ඇද්ද, හිරියක් ඇද්ද, ඔත්තප්පයක් ඇද්ද, වීර්යයක් ඇද්ද, ප්‍රඥාවක් ඇද්ද, ඔහුට දිනෙන් දින (රැය හෝ දවස ගෙවී යන විට) කුසල ධර්මයන්ගේ දියුණුවම අපේක්ෂා කළ යුතුය, පිරිහීමක් නොවේ.\"\n\nඒ අයුරින්ම, කාශ්‍යපයෙනි, යම්කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධා භාවය ඇත්නම්, හිරි භාවය ඇත්නම්, ඔත්තප්ප භාවය ඇත්නම්, වීර්යය ඇත්නම්, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව ඇත්නම්, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණේද, කුසල ධර්මයන් කෙරෙහි වර්ධනයක්ම මිස පිරිහීමක් අපේක්ෂා කළ යුත්තකි.\n\nකාශ්‍යපයෙනි, ‘ශ්‍රද්ධා සම්පන්න පුරිස පුද්ගලයා’ යනු පිරිහීමක් නොවේ. කාශ්‍යපයෙනි, ‘හිරි සම්පන්න පුරිස පුද්ගලයා’ යනු පිරිහීමක් නොවේ. කාශ්‍යපයෙනි, ‘ඔත්තප්ප සම්පන්න පුරිස පුද්ගලයා’ යනු පිරිහීමක් නොවේ. කාශ්‍යපයෙනි, ‘වීර්යය ආරම්භ කළ පුරිස පුද්ගලයා’ යනු පිරිහීමක් නොවේ. කාශ්‍යපයෙනි, ‘ප්‍රඥාවන්ත පුරිස පුද්ගලයා’ යනු පිරිහීමක් නොවේ. කාශ්‍යපයෙනි, ‘ක්‍රෝධ රහිත පුරිස පුද්ගලයා’ යනු පිරිහීමක් නොවේ. කාශ්‍යපයෙනි, ‘වෛර නොබැඳ සිටින පුරිස පුද්ගලයා’ යනු පිරිහීමක් නොවේ. කාශ්‍යපයෙනි, ‘අනුශාසනා කරන භික්ෂූන් වහන්සේලා සිටිති’ යනු පිරිහීමක් නොවේ.",
      "paliTitle": "Dutiyaovādasuttaṃ",
      "vagga": "",
      "englishTitle": "Second Sutta on Advice",
      "sinhalaTitle": "දුතිය ඕවාද සූත්‍රය"
    },
    {
      "number": 151,
      "pali": "Rājagahe kalandakanivāpe [sāvatthi, ārāme (sī.)]. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākassapaṃ bhagavā etadavoca – ‘‘ovada, kassapa, bhikkhū; karohi, kassapa, bhikkhūnaṃ dhammiṃ kathaṃ. Ahaṃ vā, kassapa, bhikkhūnaṃ ovadeyyaṃ tvaṃ vā; ahaṃ vā bhikkhūnaṃ dhammiṃ kathaṃ kareyyaṃ tvaṃ vā’’ti. ‘‘Dubbacā kho, bhante, etarahi bhikkhū, dovacassakaraṇehi dhammehi samannāgatā, akkhamā, appadakkhiṇaggāhino anusāsanī’’nti. ‘‘Tathā hi pana, kassapa, pubbe therā bhikkhū āraññikā ceva ahesuṃ āraññikattassa ca vaṇṇavādino, piṇḍapātikā ceva ahesuṃ piṇḍapātikattassa ca vaṇṇavādino, paṃsukūlikā ceva ahesuṃ paṃsukūlikattassa ca vaṇṇavādino, tecīvarikā ceva ahesuṃ tecīvarikattassa ca vaṇṇavādino, appicchā ceva ahesuṃ appicchatāya ca vaṇṇavādino, santuṭṭhā ceva ahesuṃ santuṭṭhiyā ca vaṇṇavādino, pavivittā ceva ahesuṃ pavivekassa ca vaṇṇavādino, asaṃsaṭṭhā ceva ahesuṃ asaṃsaggassa ca vaṇṇavādino, āraddhavīriyā ceva ahesuṃ vīriyārambhassa ca vaṇṇavādino. ‘‘Tatra yo hoti bhikkhu āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva piṇḍapātikattassa ca vaṇṇavādī, paṃsukūliko ceva paṃsukūlikattassa ca vaṇṇavādī, tecīvariko ceva tecīvarikattassa ca vaṇṇavādī, appiccho ceva appicchatāya ca vaṇṇavādī, santuṭṭho ceva santuṭṭhiyā ca vaṇṇavādī, pavivitto ceva pavivekassa ca vaṇṇavādī, asaṃsaṭṭho ceva asaṃsaggassa ca vaṇṇavādī, āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī, taṃ therā bhikkhū āsanena nimantenti – ‘ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sikkhākāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’’’ti. ‘‘Tatra, kassapa, navānaṃ bhikkhūnaṃ evaṃ hoti – ‘yo kira so hoti bhikkhu āraññiko ceva āraññikattassa ca vaṇṇavādī, piṇḍapātiko ceva…pe… paṃsukūliko ceva… tecīvariko ceva… appiccho ceva… santuṭṭho ceva… pavivitto ceva… asaṃsaṭṭho ceva… āraddhavīriyo ceva vīriyārambhassa ca vaṇṇavādī, taṃ therā bhikkhū āsanena nimantenti – ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sikkhākāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’ti. Te tathattāya paṭipajjanti; tesaṃ taṃ hoti dīgharattaṃ hitāya sukhāya. ‘‘Etarahi pana, kassapa, therā bhikkhū na ceva āraññikā na ca āraññikattassa vaṇṇavādino, na ceva piṇḍapātikā na ca piṇḍapātikattassa vaṇṇavādino, na ceva paṃsukūlikā na ca paṃsukūlikattassa vaṇṇavādino, na ceva tecīvarikā na ca tecīvarikattassa vaṇṇavādino, na ceva appicchā na ca appicchatāya vaṇṇavādino, na ceva santuṭṭhā na ca santuṭṭhiyā vaṇṇavādino, na ceva pavivittā na ca pavivekassa vaṇṇavādino, na ceva asaṃsaṭṭhā na ca asaṃsaggassa vaṇṇavādino, na ceva āraddhavīriyā na ca vīriyārambhassa vaṇṇavādino. ‘‘Tatra yo hoti bhikkhu ñāto yasassī lābhī cīvara-piṇḍapāta- senāsanagilānappaccayabhesajjaparikkhārānaṃ taṃ therā bhikkhū āsanena nimantenti – ‘ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sabrahmacārikāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’’’ti. ‘‘Tatra, kassapa, navānaṃ bhikkhūnaṃ evaṃ hoti – ‘yo kira so hoti bhikkhu ñāto yasassī lābhī cīvara-piṇḍapāta-senāsana-gilānappaccayabhesajjaparikkhārānaṃ taṃ therā bhikkhū āsanena nimantenti – ehi, bhikkhu, ko nāmāyaṃ bhikkhu, bhaddako vatāyaṃ bhikkhu, sabrahmacārikāmo vatāyaṃ bhikkhu; ehi, bhikkhu, idaṃ āsanaṃ nisīdāhī’ti. Te tathattāya paṭipajjanti. Tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Yañhi taṃ, kassapa, sammā vadamāno vadeyya – ‘upaddutā brahmacārī brahmacārūpaddavena abhipatthanā [abhibhavanā (sī.)] brahmacārī brahmacāriabhipatthanenā’ti [brahmacāriabhibhavanenāti (sī.)], etarahi taṃ, kassapa, sammā vadamāno vadeyya – ‘upaddutā brahmacārī brahmacārūpaddavena abhipatthanā brahmacārī brahmacāriabhipatthanenā’’’ti. Aṭṭhamaṃ.",
      "english": "In Rājagaha, at the Kalandaka feeding ground, Venerable Mahakassapa approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. To Venerable Mahakassapa, as he sat to one side, the Blessed One spoke thus: “Kassapa, admonish the monastics; Kassapa, give them a discourse on the Dhamma. Either I, Kassapa, could admonish the monastics, or you; either I could give the monastics a discourse on the Dhamma, or you.” “Indeed, venerable sir, nowadays the monastics are difficult to admonish, endowed with qualities that make them difficult to speak to, impatient, and they do not properly accept instruction.” “That is indeed how it is, Kassapa. In the past, the elder monastics were forest-dwellers and praised forest-dwelling; they were alms-gatherers and praised alms-gathering; they wore rag-robes and praised wearing rag-robes; they wore three robes and praised wearing three robes; they were content with little and praised contentment with little; they were content and praised contentment; they were secluded and praised seclusion; they were unentangled and praised non-entanglement; they were energetic and praised the undertaking of energy.\n\nAmong those, if there was a monastic who was a forest-dweller and praised forest-dwelling, an alms-gatherer and praised alms-gathering, a wearer of rag-robes and praised wearing rag-robes, a wearer of three robes and praised wearing three robes, content with little and praised contentment with little, content and praised contentment, secluded and praised seclusion, unentangled and praised non-entanglement, energetic and praised the undertaking of energy—such a monastic would be invited by the elder monastics with a seat, saying: ‘Come, monastic! What a monastic this is! This monastic is truly desirous of training! Come, monastic, sit on this seat!’\n\nThere, Kassapa, the new monastics would think thus: ‘Indeed, if there is a monastic who is a forest-dweller and praises forest-dwelling, an alms-gatherer and praises alms-gathering, a wearer of rag-robes and praises wearing rag-robes, a wearer of three robes and praises wearing three robes, content with little and praises contentment with little, content and praises contentment, secluded and praises seclusion, unentangled and praises non-entanglement, energetic and praises the undertaking of energy—such a monastic is invited by the elder monastics with a seat, saying: \"Come, monastic! What a monastic this is! This monastic is truly desirous of training! Come, monastic, sit on this seat!\"’ They would practice accordingly, and that would be for their welfare and happiness for a long time.\n\nBut nowadays, Kassapa, the elder monastics are neither forest-dwellers nor do they praise forest-dwelling; they are neither alms-gatherers nor do they praise alms-gathering; they are neither wearers of rag-robes nor do they praise wearing rag-robes; they are neither wearers of three robes nor do they praise wearing three robes; they are neither content with little nor do they praise contentment with little; they are neither content nor do they praise contentment; they are neither secluded nor do they praise seclusion; they are neither unentangled nor do they praise non-entanglement; they are neither energetic nor do they praise the undertaking of energy.\n\nAmong those, if there is a monastic who is well-known, famous, and a recipient of robes, almsfood, lodgings, and medicinal requisites for the sick—such a monastic is invited by the elder monastics with a seat, saying: ‘Come, monastic! What a monastic this is! This monastic is truly desirous of companion practitioners! Come, monastic, sit on this seat!’\n\nThere, Kassapa, the new monastics would think thus: ‘Indeed, if there is a monastic who is well-known, famous, and a recipient of robes, almsfood, lodgings, and medicinal requisites for the sick—such a monastic is invited by the elder monastics with a seat, saying: \"Come, monastic! What a monastic this is! This monastic is truly desirous of companion practitioners! Come, monastic, sit on this seat!\"’ They would practice accordingly. That would be for their harm and suffering for a long time. If, Kassapa, one were to speak rightly, one would say: ‘The holy life is afflicted by the affliction of the holy life, the holy life is overwhelmed by the overwhelming of the holy life.’ Nowadays, Kassapa, if one were to speak rightly, one would say exactly that: ‘The holy life is afflicted by the affliction of the holy life, the holy life is overwhelmed by the overwhelming of the holy life.’",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර කලන්දක නිවාප නම් ස්ථානයේ වැඩ වාසය කළ සේක. එකල්හි ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක වාඩිවූ සේක. මෙසේ එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"කාශ්‍යපය, භික්ෂූන්ට අවවාද කරන්න. කාශ්‍යපය, භික්ෂූන්ට ධර්ම කථාවක් කරන්න. කාශ්‍යපය, භික්ෂූන්ට මා විසින් හෝ ඔබ විසින් හෝ අවවාද කළ යුතු යි; භික්ෂූන්ට මා විසින් හෝ ඔබ විසින් හෝ ධර්ම කථාවක් කළ යුතු යි.\"\n\n\"වහන්ස, මේ වන විට භික්ෂූන් වහන්සේලා අවවාද කිරීමට දුෂ්කර ය. ඔවුහු දුරුබව ඇති කරන ධර්මයන්ගෙන් යුක්ත වෙති. ඉවසීමෙන් තොර ය. අනුශාසනාව ගෞරවයෙන් පිළිනොගන්නෝ ය.\"\n\n\"කාශ්‍යපය, එසේ ම පෙර තෙර භික්ෂූන් වහන්සේලා ආරණ්‍යක ජීවිතය ගත කළෝ ද, ආරණ්‍යක බව ප්‍රශංසා කළෝ ද වූහ. පිණ්ඩපාතික ජීවිතය ගත කළෝ ද, පිණ්ඩපාතික බව ප්‍රශංසා කළෝ ද වූහ. පාංසුකූලික ජීවිතය ගත කළෝ ද, පාංසුකූලික බව ප්‍රශංසා කළෝ ද වූහ. තෙචීවරික ජීවිතය ගත කළෝ ද, තෙචීවරික බව ප්‍රශංසා කළෝ ද වූහ. අල්පේච්ඡ වූහ ද, අල්පේච්ඡ බව ප්‍රශංසා කළෝ ද වූහ. සන්තුෂ්ට වූහ ද, සන්තුෂ්ටිය ප්‍රශංසා කළෝ ද වූහ. ප්‍රවිවික්ත වූහ ද, ප්‍රවිවේකය ප්‍රශංසා කළෝ ද වූහ. අසංසර්ගී වූහ ද, අසංසර්ගය ප්‍රශංසා කළෝ ද වූහ. ආරම්භක වීර්යය ඇත්තෝ ද, වීර්යාරම්භය ප්‍රශංසා කළෝ ද වූහ.\"\n\nඑවිට යම් භික්ෂුවක් ආරණ්‍යක ජීවිතය ගත කරන්නෙක් ද, ආරණ්‍යක බව ප්‍රශංසා කරන්නෙක් ද, පිණ්ඩපාතික ජීවිතය ගත කරන්නෙක් ද, පිණ්ඩපාතික බව ප්‍රශංසා කරන්නෙක් ද, පාංසුකූලික ජීවිතය ගත කරන්නෙක් ද, පාංසුකූලික බව ප්‍රශංසා කරන්නෙක් ද, තෙචීවරික ජීවිතය ගත කරන්නෙක් ද, තෙචීවරික බව ප්‍රශංසා කරන්නෙක් ද, අල්පේච්ඡ වූවෙක් ද, අල්පේච්ඡ බව ප්‍රශංසා කරන්නෙක් ද, සන්තුෂ්ට වූවෙක් ද, සන්තුෂ්ටිය ප්‍රශංසා කරන්නෙක් ද, ප්‍රවිවික්ත වූවෙක් ද, ප්‍රවිවේකය ප්‍රශංසා කරන්නෙක් ද, අසංසර්ගී වූවෙක් ද, අසංසර්ගය ප්‍රශංසා කරන්නෙක් ද, ආරම්භක වීර්යය ඇත්තෙක් ද, වීර්යාරම්භය ප්‍රශංසා කරන්නෙක් ද වෙයි ද, එවැනි භික්ෂුවට තෙර භික්ෂූන් වහන්සේලා ආසනයකින් ආරාධනා කළහ – 'එන්න, මහණ, මේ කවර නම් මහණෙක් ද? මේ මහණ යහපත් ම ය. මේ මහණ ශික්ෂාවට කැමති ම ය. එන්න, මහණ, මේ ආසනයෙහි හිඳගන්න' යි.\n\nඑවිට කාශ්‍යපය, නවක භික්ෂූන්ට මෙසේ සිතක් ඇති වෙයි – 'යම් භික්ෂුවක් ආරණ්‍යක ජීවිතය ගත කරන්නෙක් ද, ආරණ්‍යක බව ප්‍රශංසා කරන්නෙක් ද, පිණ්ඩපාතික ජීවිතය ගත කරන්නෙක් ද, පිණ්ඩපාතික බව ප්‍රශංසා කරන්නෙක් ද, පාංසුකූලික ජීවිතය ගත කරන්නෙක් ද, පාංසුකූලික බව ප්‍රශංසා කරන්නෙක් ද, තෙචීවරික ජීවිතය ගත කරන්නෙක් ද, තෙචීවරික බව ප්‍රශංසා කරන්නෙක් ද, අල්පේච්ඡ වූවෙක් ද, අල්පේච්ඡ බව ප්‍රශංසා කරන්නෙක් ද, සන්තුෂ්ට වූවෙක් ද, සන්තුෂ්ටිය ප්‍රශංසා කරන්නෙක් ද, ප්‍රවිවික්ත වූවෙක් ද, ප්‍රවිවේකය ප්‍රශංසා කරන්නෙක් ද, අසංසර්ගී වූවෙක් ද, අසංසර්ගය ප්‍රශංසා කරන්නෙක් ද, ආරම්භක වීර්යය ඇත්තෙක් ද, වීර්යාරම්භය ප්‍රශංසා කරන්නෙක් ද වෙයි ද, එවැනි භික්ෂුවට තෙර භික්ෂූන් වහන්සේලා ආසනයකින් ආරාධනා කරති – \"එන්න, මහණ, මේ කවර නම් මහණෙක් ද? මේ මහණ යහපත් ම ය. මේ මහණ ශික්ෂාවට කැමති ම ය. එන්න, මහණ, මේ ආසනයෙහි හිඳගන්න\" යි'. ඔවුහු ද ඒ තත්ත්වයට පත්වීම සඳහා පිළිපදිති. එය ඔවුන්ට බොහෝ කලක් හිතසුව පිණිස වෙයි.\n\nඑහෙත් කාශ්‍යපය, මේ වන විට තෙර භික්ෂූන් වහන්සේලා ආරණ්‍යක ජීවිතය ගත කරන්නෝ ද නොවෙති, ආරණ්‍යක බව ප්‍රශංසා කරන්නෝ ද නොවෙති. පිණ්ඩපාතික ජීවිතය ගත කරන්නෝ ද නොවෙති, පිණ්ඩපාතික බව ප්‍රශංසා කරන්නෝ ද නොවෙති. පාංසුකූලික ජීවිතය ගත කරන්නෝ ද නොවෙති, පාංසුකූලික බව ප්‍රශංසා කරන්නෝ ද නොවෙති. තෙචීවරික ජීවිතය ගත කරන්නෝ ද නොවෙති, තෙචීවරික බව ප්‍රශංසා කරන්නෝ ද නොවෙති. අල්පේච්ඡ වූවෝ ද නොවෙති, අල්පේච්ඡ බව ප්‍රශංසා කරන්නෝ ද නොවෙති. සන්තුෂ්ට වූවෝ ද නොවෙති, සන්තුෂ්ටිය ප්‍රශංසා කරන්නෝ ද නොවෙති. ප්‍රවිවික්ත වූවෝ ද නොවෙති, ප්‍රවිවේකය ප්‍රශංසා කරන්නෝ ද නොවෙති. අසංසර්ගී වූවෝ ද නොවෙති, අසංසර්ගය ප්‍රශංසා කරන්නෝ ද නොවෙති. ආරම්භක වීර්යය ඇත්තෝ ද නොවෙති, වීර්යාරම්භය ප්‍රශංසා කරන්නෝ ද නොවෙති.\n\nඑවිට යම් භික්ෂුවක් සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර ලබන ප්‍රසිද්ධ, කීර්තිමත් භික්ෂුවක් වෙයි ද, එවැනි භික්ෂුවට තෙර භික්ෂූන් වහන්සේලා ආසනයකින් ආරාධනා කරති – 'එන්න, මහණ, මේ කවර නම් මහණෙක් ද? මේ මහණ යහපත් ම ය. මේ මහණ සබ්‍රහ්මචාරීන්ට කැමති ම ය. එන්න, මහණ, මේ ආසනයෙහි හිඳගන්න' යි.\n\nඑවිට කාශ්‍යපය, නවක භික්ෂූන්ට මෙසේ සිතක් ඇති වෙයි – 'යම් භික්ෂුවක් සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර ලබන ප්‍රසිද්ධ, කීර්තිමත් භික්ෂුවක් වෙයි ද, එවැනි භික්ෂුවට තෙර භික්ෂූන් වහන්සේලා ආසනයකින් ආරාධනා කරති – \"එන්න, මහණ, මේ කවර නම් මහණෙක් ද? මේ මහණ යහපත් ම ය. මේ මහණ සබ්‍රහ්මචාරීන්ට කැමති ම ය. එන්න, මහණ, මේ ආසනයෙහි හිඳගන්න\" යි'. ඔවුහු ද ඒ තත්ත්වයට පත්වීම සඳහා පිළිපදිති. එය ඔවුන්ට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් වෙයි. කාශ්‍යපය, 'බඹසර රකින ජීවිතය, බඹසර රකින ජීවිතයට අයත් උපද්‍රවයකින් විපතට පත්වූයේ ය; බඹසර රකින ජීවිතය, බඹසර රකින ජීවිතයට අයත් අභිභවනයකින් අභිභවනය කරනු ලැබුවේ ය' යනුවෙන් යමෙක් නිවැරැදිව පවසන්නේ නම්, කාශ්‍යපය, මේ වන විට එය නිවැරැදිව පවසන්නෙක් වෙයි.",
      "paliTitle": "Tatiyaovādasuttaṃ",
      "vagga": "",
      "englishTitle": "Third Discourse on Exhortation",
      "sinhalaTitle": "තතිය ඕවාද සූත්‍රය"
    },
    {
      "number": 152,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati’’. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi pītiyā ca virāgā upekkhako ca viharāmi sato ca sampajāno sukhañca kāyena paṭisaṃvedemi, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati sukhassa ca pahānā …pe… catutthaṃ jhānaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati sabbaso rūpasaññānaṃ samatikkamā…pe… ākāsānañcāyatanaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati…pe… ākiñcaññāyatanaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati…pe… nevasaññānāsaññāyatanaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharāmi. Kassapopi, bhikkhave…pe… saññāvedayitanirodhaṃ upasampajja viharati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi anekavihitaṃ iddhividhaṃ paccanubhomi – ekopi hutvā bahudhā homi, bahudhāpi hutvā eko homi; āvibhāvaṃ, tirobhāvaṃ, tirokuṭṭaṃ, tiropākāraṃ, tiropabbataṃ, asajjamāno gacchāmi, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karomi, seyyathāpi udake; udakepi abhijjamāne gacchāmi, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamāmi, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasāmi parimajjāmi; yāva brahmalokāpi kāyena vasaṃ vattemi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati anekavihitaṃ iddhividhaṃ paccanubhoti…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāmi, dibbe ca mānuse ca, ye dūre santike ca. Kassapopi, bhikkhave, yāvadeva ākaṅkhati dibbāya sotadhātuyā…pe… dūre santike ca. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāmi – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāmi, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajānāmi, sadosaṃ vā cittaṃ…pe… vītadosaṃ vā cittaṃ… samohaṃ vā cittaṃ… vītamohaṃ vā cittaṃ… saṃkhittaṃ vā cittaṃ… vikkhittaṃ vā cittaṃ… mahaggataṃ vā cittaṃ… amahaggataṃ vā cittaṃ… sauttaraṃ vā cittaṃ… anuttaraṃ vā cittaṃ… samāhitaṃ vā cittaṃ… asamāhitaṃ vā cittaṃ… vimuttaṃ vā cittaṃ… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāti…pe… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāti. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi anekavihitaṃ pubbenivāsaṃ anussarāmi, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi, anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘Ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāmi – ‘ime vata, bhonto, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā, ime vā pana, bhonto, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā; te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passāmi cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne…pe… yathākammūpage satte pajānāti. ‘‘Ahaṃ, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. Kassapopi, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Navamaṃ.",
      "english": "“I, monks, whenever I wish, having secluded myself from sensual pleasures, having secluded myself from unwholesome states, enter and remain in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and happiness. And Kassapa, monks, whenever he wishes, having secluded himself from sensual pleasures, having secluded himself from unwholesome states, enters and remains in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and happiness.\n\n“I, monks, whenever I wish, with the calming of initial application and sustained application, with the internal assurance and unification of mind, enter and remain in the second jhāna, which is without initial application and sustained application, born of concentration, and filled with rapture and happiness. And Kassapa, monks, whenever he wishes, with the calming of initial application and sustained application, with the internal assurance and unification of mind, enters and remains in the second jhāna, which is without initial application and sustained application, born of concentration, and filled with rapture and happiness.\n\n“I, monks, whenever I wish, with the fading away of rapture, I remain equanimous, mindful, and clearly comprehending, and I experience happiness with the body, concerning which the noble ones declare: ‘He is equanimous, mindful, and dwells happily’—I enter and remain in the third jhāna. And Kassapa, monks, whenever he wishes, with the fading away of rapture, he remains equanimous, mindful, and clearly comprehending, and he experiences happiness with the body, concerning which the noble ones declare: ‘He is equanimous, mindful, and dwells happily’—he enters and remains in the third jhāna.\n\n“I, monks, whenever I wish, with the abandonment of pleasure and pain, and with the disappearance of former joy and sorrow, I enter and remain in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. And Kassapa, monks, whenever he wishes, with the abandonment of pleasure and pain, and with the disappearance of former joy and sorrow, he enters and remains in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness.\n\n“I, monks, whenever I wish, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of diversity, perceiving ‘space is infinite’, I enter and remain in the sphere of infinite space. And Kassapa, monks, whenever he wishes, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of diversity, perceiving ‘space is infinite’, he enters and remains in the sphere of infinite space.\n\n“I, monks, whenever I wish, by completely transcending the sphere of infinite space, perceiving ‘consciousness is infinite’, I enter and remain in the sphere of infinite consciousness. And Kassapa, monks, whenever he wishes, by completely transcending the sphere of infinite space, perceiving ‘consciousness is infinite’, he enters and remains in the sphere of infinite consciousness.\n\n“I, monks, whenever I wish, by completely transcending the sphere of infinite consciousness, perceiving ‘there is nothing’, I enter and remain in the sphere of nothingness. And Kassapa, monks, whenever he wishes, by completely transcending the sphere of infinite consciousness, perceiving ‘there is nothing’, he enters and remains in the sphere of nothingness.\n\n“I, monks, whenever I wish, by completely transcending the sphere of nothingness, I enter and remain in the sphere of neither perception nor non-perception. And Kassapa, monks, whenever he wishes, by completely transcending the sphere of nothingness, he enters and remains in the sphere of neither perception nor non-perception.\n\n“I, monks, whenever I wish, by completely transcending the sphere of neither perception nor non-perception, I enter and remain in the cessation of perception and feeling. And Kassapa, monks, whenever he wishes, by completely transcending the sphere of neither perception nor non-perception, he enters and remains in the cessation of perception and feeling.\n\n“I, monks, whenever I wish, experience various kinds of supernormal power: having been one, I become many; having been many, I become one; I appear and vanish; I go unimpeded through walls, through ramparts, through mountains, as if through space; I dive in and out of the earth as if in water; I walk on water without sinking as if on land; I travel through the air sitting cross-legged like a winged bird; I touch and stroke with my hand these moon and sun, so mighty, so powerful; I exercise bodily mastery even as far as the Brahmā world. And Kassapa, monks, whenever he wishes, experiences various kinds of supernormal power: having been one, he becomes many; having been many, he becomes one; he appears and vanishes; he goes unimpeded through walls, through ramparts, through mountains, as if through space; he dives in and out of the earth as if in water; he walks on water without sinking as if on land; he travels through the air sitting cross-legged like a winged bird; he touches and strokes with his hand these moon and sun, so mighty, so powerful; he exercises bodily mastery even as far as the Brahmā world.\n\n“I, monks, whenever I wish, with the divine ear element, purified and surpassing that of humans, hear both kinds of sounds, divine and human, those that are far as well as near. And Kassapa, monks, whenever he wishes, with the divine ear element, purified and surpassing that of humans, hears both kinds of sounds, divine and human, those that are far as well as near.\n\n“I, monks, whenever I wish, discern with my mind the minds of other beings, other persons, comprehending: a mind with lust as ‘a mind with lust’; a mind without lust as ‘a mind without lust’; a mind with hatred as ‘a mind with hatred’; a mind without hatred as ‘a mind without hatred’; a mind with delusion as ‘a mind with delusion’; a mind without delusion as ‘a mind without delusion’; a constricted mind as ‘a constricted mind’; a distracted mind as ‘a distracted mind’; an exalted mind as ‘an exalted mind’; an unexalted mind as ‘an unexalted mind’; a surpassable mind as ‘a surpassable mind’; an unsurpassable mind as ‘an unsurpassable mind’; a concentrated mind as ‘a concentrated mind’; an unconcentrated mind as ‘an unconcentrated mind’; a liberated mind as ‘a liberated mind’; an unliberated mind as ‘an unliberated mind’. And Kassapa, monks, whenever he wishes, discerns with his mind the minds of other beings, other persons, comprehending: a mind with lust as ‘a mind with lust’; a mind without lust as ‘a mind without lust’; a mind with hatred as ‘a mind with hatred’; a mind without hatred as ‘a mind without hatred’; a mind with delusion as ‘a mind with delusion’; a mind without delusion as ‘a mind without delusion’; a constricted mind as ‘a constricted mind’; a distracted mind as ‘a distracted mind’; an exalted mind as ‘an exalted mind’; an unexalted mind as ‘an unexalted mind’; a surpassable mind as ‘a surpassable mind’; an unsurpassable mind as ‘an unsurpassable mind’; a concentrated mind as ‘a concentrated mind’; an unconcentrated mind as ‘an unconcentrated mind’; a liberated mind as ‘a liberated mind’; an unliberated mind as ‘an unliberated mind’.”\n\nAnd Kassapa, bhikkhus, to whatever extent he wishes, discerns the minds of other beings and other individuals by encompassing their minds with his own mind: he discerns a mind with greed as ‘a mind with greed’, and a mind without greed as ‘a mind without greed’; he discerns a mind with hatred as ‘a mind with hatred’, and a mind without hatred as ‘a mind without hatred’; he discerns a mind with delusion as ‘a mind with delusion’, and a mind without delusion as ‘a mind without delusion’; he discerns a constricted mind as ‘a constricted mind’, and a diffused mind as ‘a diffused mind’; he discerns an elevated mind as ‘an elevated mind’, and an un-elevated mind as ‘an un-elevated mind’; he discerns a surpassable mind as ‘a surpassable mind’, and an unsurpassable mind as ‘an unsurpassable mind’; he discerns a concentrated mind as ‘a concentrated mind’, and an unconcentrated mind as ‘an unconcentrated mind’; he discerns a liberated mind as ‘a liberated mind’, and an unliberated mind as ‘an unliberated mind’.\n\nBhikkhus, to whatever extent I wish, I recollect my manifold past lives, that is to say: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births; many eons of world-contraction, many eons of world-expansion, many eons of world-contraction and expansion. I recollect: ‘There I was such a one by name, of such a clan, of such an appearance, fed on such food, experienced such pleasant and painful feelings, and lived for such a lifespan; having passed away from there, I reappeared yonder. There too I was such a one by name, of such a clan, of such an appearance, fed on such food, experienced such pleasant and painful feelings, and lived for such a lifespan; having passed away from there, I reappeared here.’ Thus I recollect my manifold past lives, together with their distinctive features and details. And Kassapa, bhikkhus, to whatever extent he wishes, recollects his manifold past lives, that is to say: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births; many eons of world-contraction, many eons of world-expansion, many eons of world-contraction and expansion. He recollects: ‘There I was such a one by name, of such a clan, of such an appearance, fed on such food, experienced such pleasant and painful feelings, and lived for such a lifespan; having passed away from there, he reappeared yonder. There too he was such a one by name, of such a clan, of such an appearance, fed on such food, experienced such pleasant and painful feelings, and lived for such a lifespan; having passed away from there, he reappeared here.’ Thus he recollects his manifold past lives, together with their distinctive features and details.\n\nBhikkhus, to whatever extent I wish, with the divine eye, purified and surpassing that of humans, I see beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and I discern them in accordance with their kamma: ‘These beings, venerable sirs, who were endowed with misconduct of body, misconduct of speech, and misconduct of mind, who reviled the noble ones, held wrong views, and undertook actions based on wrong views, with the breakdown of the body, after death, have reappeared in a state of deprivation, a bad destination, the lower realms, hell. But these other beings, venerable sirs, who were endowed with good conduct of body, good conduct of speech, and good conduct of mind, who did not revile the noble ones, held right views, and undertook actions based on right views, with the breakdown of the body, after death, have reappeared in a good destination, a heavenly world.’ Thus, with the divine eye, purified and surpassing that of humans, I see beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and I discern them in accordance with their kamma. And Kassapa, bhikkhus, to whatever extent he wishes, with the divine eye, purified and surpassing that of humans, sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he discerns them in accordance with their kamma: ‘These beings, venerable sirs, who were endowed with misconduct of body, misconduct of speech, and misconduct of mind, who reviled the noble ones, held wrong views, and undertook actions based on wrong views, with the breakdown of the body, after death, have reappeared in a state of deprivation, a bad destination, the lower realms, hell. But these other beings, venerable sirs, who were endowed with good conduct of body, good conduct of speech, and good conduct of mind, who did not revile the noble ones, held right views, and undertook actions based on right views, with the breakdown of the body, after death, have reappeared in a good destination, a heavenly world.’ Thus, with the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he discerns them in accordance with their kamma.\n\nBhikkhus, by the destruction of the taints, I have realized for myself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, and I dwell therein. And Kassapa, bhikkhus, by the destruction of the taints, has realized for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation by wisdom, and he dwells therein.",
      "sinhala": "සැවැත් නුවර වැඩවසන...“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය සහිත වූ ප්‍රථම ධ්‍යානය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය සහිත වූ ප්‍රථම ධ්‍යානය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් විතර්ක හා විචාරයන්ගේ සංසිඳීමෙන්, අධ්‍යාත්මික පැහැදීමෙන් යුතුව, සිතෙහි එකඟතාවයෙන් යුතුව, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය සහිත වූ දෙවෙනි ධ්‍යානය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් විතර්ක හා විචාරයන්ගේ සංසිඳීමෙන්, අධ්‍යාත්මික පැහැදීමෙන් යුතුව, සිතෙහි එකඟතාවයෙන් යුතුව, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය සහිත වූ දෙවෙනි ධ්‍යානය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් ප්‍රීතිය කෙරෙහිද නොඇලීමෙන් (විරාගයෙන්) උපේක්ෂාවෙන් වාසය කරමි, සිහියෙන් හා මනා දැනීමෙන් යුතුව කයින්ද සැපය අත්විඳිමි, යමක් ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්තව, සිහියෙන් යුතුව, සැපසේ වාසය කරන්නා’ යනුවෙන් පවසත්ද, ඒ තෙවෙනි ධ්‍යානය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් ප්‍රීතිය කෙරෙහිද නොඇලීමෙන් (විරාගයෙන්) උපේක්ෂාවෙන් වාසය කරයි, සිහියෙන් හා මනා දැනීමෙන් යුතුව කයින්ද සැපය අත්විඳියි, යමක් ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්තව, සිහියෙන් යුතුව, සැපසේ වාසය කරන්නා’ යනුවෙන් පවසත්ද, ඒ තෙවෙනි ධ්‍යානය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් සැපයද අත්හැරීමෙන්, දුකද අත්හැරීමෙන්, පෙරම සොම්නස් දොම්නස් අතුරුදහන් වීමෙන්, දුක් රහිත, සැප රහිත, උපේක්ෂාව හා සිහිය පිරිසිදු වූ සිව්වෙනි ධ්‍යානය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් සැපයද අත්හැරීමෙන්, දුකද අත්හැරීමෙන්, පෙරම සොම්නස් දොම්නස් අතුරුදහන් වීමෙන්, දුක් රහිත, සැප රහිත, උපේක්ෂාව හා සිහිය පිරිසිදු වූ සිව්වෙනි ධ්‍යානය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් සියලු රූප සංඥාවන් සම්පූර්ණයෙන්ම ඉක්මවා, ගැටීම් සංඥාවන්ගේ අතුරුදහන් වීමෙන්, නානාත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, ‘අනන්ත වූ ආකාශයයි’ යනුවෙන් ආකාශානන්ත්‍ය ආයතනය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් සියලු රූප සංඥාවන් සම්පූර්ණයෙන්ම ඉක්මවා, ගැටීම් සංඥාවන්ගේ අතුරුදහන් වීමෙන්, නානාත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, ‘අනන්ත වූ ආකාශයයි’ යනුවෙන් ආකාශානන්ත්‍ය ආයතනය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් ආකාශානන්ත්‍ය ආයතනය සම්පූර්ණයෙන්ම ඉක්මවා, ‘අනන්ත වූ විඤ්ඤාණයයි’ යනුවෙන් විඤ්ඤාණානන්ත්‍ය ආයතනය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් ආකාශානන්ත්‍ය ආයතනය සම්පූර්ණයෙන්ම ඉක්මවා, ‘අනන්ත වූ විඤ්ඤාණයයි’ යනුවෙන් විඤ්ඤාණානන්ත්‍ය ආයතනය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් විඤ්ඤාණානන්ත්‍ය ආයතනය සම්පූර්ණයෙන්ම ඉක්මවා, ‘කිසිවක් නැත’ යනුවෙන් ආකිංචඤ්ඤායතනය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් විඤ්ඤාණානන්ත්‍ය ආයතනය සම්පූර්ණයෙන්ම ඉක්මවා, ‘කිසිවක් නැත’ යනුවෙන් ආකිංචඤ්ඤායතනය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් ආකිංචඤ්ඤායතනය සම්පූර්ණයෙන්ම ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් ආකිංචඤ්ඤායතනය සම්පූර්ණයෙන්ම ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් නේවසඤ්ඤානාසඤ්ඤායතනය සම්පූර්ණයෙන්ම ඉක්මවා, සංඥා වේදයිත නිරෝධය උපදවා වාසය කරමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් නේවසඤ්ඤානාසඤ්ඤායතනය සම්පූර්ණයෙන්ම ඉක්මවා, සංඥා වේදයිත නිරෝධය උපදවා වාසය කරයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් නොයෙක් ආකාර වූ ඉර්ධි ප්‍රාතිහාර්යයන් අත්දකිමි. එනම්: එක්ව සිට බොහෝ වෙමි, බොහෝ ව සිට එක් වෙමි; ප්‍රකට වෙමි, අතුරුදහන් වෙමි; බිත්ති, පවුරු, කඳු අතරින් ගැටීමකින් තොරව අහසෙහි මෙන් ගමන් කරමි; පොළොවෙහිද දියෙහි මෙන් මතු වීම හා කිඳා බැසීම කරමි; දියෙහිද නොබිඳී පොළොවෙහි මෙන් ගමන් කරමි; අහසෙහිද පක්ෂියෙකු සේ පලක් බැඳ ගමන් කරමි; මෙතරම් මහත් ඉර්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති මේ චන්ද්‍රයා හා සූර්යයාද අතින් අල්ලා පිරිමදිමි; බ්‍රහ්ම ලෝකය දක්වාද කයින් වසඟ කොට පවත්වමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් නොයෙක් ආකාර වූ ඉර්ධි ප්‍රාතිහාර්යයන් අත්දකියි. එනම්: එක්ව සිට බොහෝ වෙයි, බොහෝ ව සිට එක් වෙයි; ප්‍රකට වෙයි, අතුරුදහන් වෙයි; බිත්ති, පවුරු, කඳු අතරින් ගැටීමකින් තොරව අහසෙහි මෙන් ගමන් කරයි; පොළොවෙහිද දියෙහි මෙන් මතු වීම හා කිඳා බැසීම කරයි; දියෙහිද නොබිඳී පොළොවෙහි මෙන් ගමන් කරයි; අහසෙහිද පක්ෂියෙකු සේ පලක් බැඳ ගමන් කරයි; මෙතරම් මහත් ඉර්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති මේ චන්ද්‍රයා හා සූර්යයාද අතින් අල්ලා පිරිමදියි; බ්‍රහ්ම ලෝකය දක්වාද කයින් වසඟ කොට පවත්වයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් පිරිසිදු වූ, මිනිසුන් ඉක්මවූ දිව්‍ය ශ්‍රවණ ධාතුවෙන්, දිව්‍ය වූද, මනුෂ්‍ය වූද, දුර වූද, ළඟ වූද දෙවැදෑරුම් ශබ්දයන් අසමි. මහණෙනි, කස්සපද යම්තාක් කැමති වේද, ඒතාක් පිරිසිදු වූ, මිනිසුන් ඉක්මවූ දිව්‍ය ශ්‍රවණ ධාතුවෙන්, දිව්‍ය වූද, මනුෂ්‍ය වූද, දුර වූද, ළඟ වූද දෙවැදෑරුම් ශබ්දයන් අසයි.”\n\n“මහණෙනි, මම යම්තාක් කැමති වෙම්ද, ඒතාක් අනුන්ගේ සත්වයන්ගේ, අනුන්ගේ පුරුෂ පුද්ගලයන්ගේ සිත් මාගේ සිතින් පිරිසිඳ දනිමි. එනම්: රාග සහිත වූ සිත රාග සහිත සිතක් ලෙස දනිමි, රාග රහිත වූ සිත රාග රහිත සිතක් ලෙස දනිමි; ද්වේෂ සහිත වූ සිත ද්වේෂ සහිත සිතක් ලෙස දනිමි, ද්වේෂ රහිත වූ සිත ද්වේෂ රහිත සිතක් ලෙස දනිමි; මෝහ සහිත වූ සිත මෝහ සහිත සිතක් ලෙස දනිමි, මෝහ රහිත වූ සිත මෝහ රහිත සිතක් ලෙස දනිමි; සංක්ෂිප්ත වූ සිත සංක්ෂිප්ත සිතක් ලෙස දනිමි, වික්ෂිප්ත වූ සිත වික්ෂිප්ත සිතක් ලෙස දනිමි; මහද්ගත වූ සිත මහද්ගත සිතක් ලෙස දනිමි, අමහද්ගත වූ සිත අමහද්ගත සිතක් ලෙස දනිමි; සඋත්තර වූ සිත සඋත්තර සිතක් ලෙස දනිමි, අනුත්තර වූ සිත අනුත්තර සිතක් ලෙස දනිමි; සමාහිත වූ සිත සමාහිත සිතක් ලෙස දනිමි, අසමාහිත වූ සිත අසමාහිත සිතක් ලෙස දනිමි; විමුක්ත වූ සිත විමුක්ත සිතක් ලෙස දනිමි, අවිමුක්ත වූ සිත අවිමුක්ත සිතක් ලෙස දනිමි.”\n\nමහණෙනි, කස්සපද භික්ෂුවද යම්තාක් ප්‍රාර්ථනා කරන්නේද, අන්‍ය සත්වයන්ගේ, අන්‍ය පුද්ගලයන්ගේ සිතින් සිත මනාව දැනගනී. රාග සහිත සිත 'රාග සහිත සිතැයි' දැනගනී, වීතරාගී සිත 'වීතරාගී සිතැයි' දැනගනී, ද්වේෂ සහිත සිත 'ද්වේෂ සහිත සිතැයි' දැනගනී, වීතද්වේෂී සිත 'වීතද්වේෂී සිතැයි' දැනගනී, මෝහ සහිත සිත 'මෝහ සහිත සිතැයි' දැනගනී, වීතමෝහී සිත 'වීතමෝහී සිතැයි' දැනගනී, සංක්ෂිප්ත සිත 'සංක්ෂිප්ත සිතැයි' දැනගනී, වික්ෂිප්ත සිත 'වික්ෂිප්ත සිතැයි' දැනගනී, මහාර්ගත සිත 'මහාර්ගත සිතැයි' දැනගනී, අමහාර්ගත සිත 'අමහාර්ගත සිතැයි' දැනගනී, සඋත්තර සිත 'සඋත්තර සිතැයි' දැනගනී, අනුත්තර සිත 'අනුත්තර සිතැයි' දැනගනී, සමාහිත සිත 'සමාහිත සිතැයි' දැනගනී, අසමාහිත සිත 'අසමාහිත සිතැයි' දැනගනී, විමුක්ත සිත 'විමුක්ත සිතැයි' දැනගනී, නොවිමුක්ත සිත 'නොවිමුක්ත සිතැයි' දැනගනී.\n\nමහණෙනි, මම යම්තාක් ප්‍රාර්ථනා කරන්නේද, නොයෙකුත් ආකාරයේ පෙර විසූ කඳන් පෙළ සිහිකරමි. එනම් – එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙකුත් සංවට්ට කල්පයන් ද, නොයෙකුත් විවට්ට කල්පයන් ද, නොයෙකුත් සංවට්ට-විවට්ට කල්පයන් ද සිහිකරමි. 'එහිදී මම මෙවන් නමකින් ද, මෙවන් ගෝත්‍රයකින් ද, මෙවන් වර්ණයකින් ද, මෙවන් ආහාරයකින් ද, මෙවන් සැපදුක් විඳින්නෙක් ව ද, මෙවන් ආයුෂ කෙළවර කොට ද සිටියෙමි. ඒ මම එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එහිද මෙවන් නමකින් ද, මෙවන් ගෝත්‍රයකින් ද, මෙවන් වර්ණයකින් ද, මෙවන් ආහාරයකින් ද, මෙවන් සැපදුක් විඳින්නෙක් ව ද, මෙවන් ආයුෂ කෙළවර කොට ද සිටියෙමි. ඒ මම එතැනින් චුත වී මෙහි උපන්නෙමි' යි. මෙසේ විස්තර සහිත ව, නිරූපණය සහිත ව නොයෙකුත් ආකාරයේ පෙර විසූ කඳන් පෙළ සිහිකරමි. මහණෙනි, කස්සපද භික්ෂුවද යම්තාක් ප්‍රාර්ථනා කරන්නේද, නොයෙකුත් ආකාරයේ පෙර විසූ කඳන් පෙළ සිහිකරයි. එනම් – එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙකුත් සංවට්ට කල්පයන් ද, නොයෙකුත් විවට්ට කල්පයන් ද, නොයෙකුත් සංවට්ට-විවට්ට කල්පයන් ද සිහිකරයි. 'එහිදී මම මෙවන් නමකින් ද, මෙවන් ගෝත්‍රයකින් ද, මෙවන් වර්ණයකින් ද, මෙවන් ආහාරයකින් ද, මෙවන් සැපදුක් විඳින්නෙක් ව ද, මෙවන් ආයුෂ කෙළවර කොට ද සිටියෙමි. ඒ මම එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එහිද මෙවන් නමකින් ද, මෙවන් ගෝත්‍රයකින් ද, මෙවන් වර්ණයකින් ද, මෙවන් ආහාරයකින් ද, මෙවන් සැපදුක් විඳින්නෙක් ව ද, මෙවන් ආයුෂ කෙළවර කොට ද සිටියෙමි. ඒ මම එතැනින් චුත වී මෙහි උපන්නෙමි' යි. මෙසේ විස්තර සහිත ව, නිරූපණය සහිත ව නොයෙකුත් ආකාරයේ පෙර විසූ කඳන් පෙළ සිහිකරයි.\n\nමහණෙනි, මම යම්තාක් ප්‍රාර්ථනා කරන්නේද, පිරිසිදු වූ, මිනිස් ඇස ඉක්මවූ දිව්‍ය චක්ෂුසින් (දිවැසින්) සත්වයන් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති වූ, දුර්ගති වූ, තමන්ගේ කර්මයන් අනුව (උපදින) සත්වයන් දකිමි, දැනගනිමි – 'අහෝ පින්වතුනි, මේ සත්වයෝ කාය දුශ්චරිතයෙන් යුක්ත වූහ, වචී දුශ්චරිතයෙන් යුක්ත වූහ, මනෝ දුශ්චරිතයෙන් යුක්ත වූහ, ආර්යයන්ට අපහාස කරන්නෝ වූහ, මිත්‍යා දෘෂ්ටික වූහ, මිත්‍යා දෘෂ්ටි කර්ම සමාදන් වූවෝ වූහ. ඔවුහු ශරීරය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරය යන තැන්වල උපන්නාහ. නැතහොත් මේ පින්වත් සත්වයෝ කාය සුචරිතයෙන් යුක්ත වූහ, වචී සුචරිතයෙන් යුක්ත වූහ, මනෝ සුචරිතයෙන් යුක්ත වූහ, ආර්යයන්ට අපහාස නොකරන්නෝ වූහ, සම්මා දෘෂ්ටික වූහ, සම්මා දෘෂ්ටි කර්ම සමාදන් වූවෝ වූහ. ඔවුහු ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකවල උපන්නාහ' යි. මෙසේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවූ දිව්‍ය චක්ෂුසින් (දිවැසින්) සත්වයන් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති වූ, දුර්ගති වූ, තමන්ගේ කර්මයන් අනුව (උපදින) සත්වයන් දකිමි, දැනගනිමි. මහණෙනි, කස්සපද භික්ෂුවද යම්තාක් ප්‍රාර්ථනා කරන්නේද, පිරිසිදු වූ, මිනිස් ඇස ඉක්මවූ දිව්‍ය චක්ෂුසින් (දිවැසින්) සත්වයන් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති වූ, දුර්ගති වූ, තමන්ගේ කර්මයන් අනුව (උපදින) සත්වයන් දකී, දැනගනී.\n\nමහණෙනි, මම ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙහිම, මේ දැහැමි ජීවිතයේම, තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරමි. මහණෙනි, කස්සපද භික්ෂුවද ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙහිම, මේ දැහැමි ජීවිතයේම, තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරයි.",
      "paliTitle": "Jhānābhiññasuttaṃ",
      "vagga": "",
      "englishTitle": "Absorption and Direct Knowledge Sutta",
      "sinhalaTitle": "ජ්ඣානාභිඤ්ඤ සූත්‍රය"
    },
    {
      "number": 153,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā mahākassapo sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti. ‘‘Gaccha tvaṃ, āvuso ānanda, bahukicco tvaṃ bahukaraṇīyo’’ti. Dutiyampi kho āyasmā ānando āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti. ‘‘Gaccha tvaṃ, āvuso ānanda, bahukicco tvaṃ bahukaraṇīyo’’ti. Tatiyampi kho āyasmā ānando āyasmantaṃ mahākassapaṃ etadavoca – ‘‘āyāma, bhante kassapa, yena aññataro bhikkhunupassayo tenupasaṅkamissāmā’’ti. Atha kho āyasmā mahākassapo pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya āyasmatā ānandena pacchāsamaṇena yena aññataro bhikkhunupassayo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho sambahulā bhikkhuniyo yenāyasmā mahākassapo tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ mahākassapaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho tā bhikkhuniyo āyasmā mahākassapo dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho āyasmā mahākassapo tā bhikkhuniyo dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmi. Atha kho thullatissā bhikkhunī anattamanā anattamanavācaṃ nicchāresi – ‘‘kiṃ pana ayyo mahākassapo, ayyassa ānandassa vedehamunino sammukhā dhammaṃ bhāsitabbaṃ maññati? Seyyathāpi nāma sūcivāṇijako sūcikārassa santike sūciṃ vikketabbaṃ maññeyya; evameva ayyo mahākassapo ayyassa ānandassa vedehamunino sammukhā dhammaṃ bhāsitabbaṃ maññatī’’ti. Assosi kho āyasmā mahākassapo thullatissāya bhikkhuniyā imaṃ vācaṃ bhāsamānāya. Atha kho āyasmā mahākassapo āyasmantaṃ ānandaṃ etadavoca – ‘‘kiṃ nu kho, āvuso ānanda, ahaṃ sūcivāṇijako, tvaṃ sūcikāro; udāhu ahaṃ sūcikāro, tvaṃ sūcivāṇijako’’ti? ‘‘Khama, bhante kassapa, bālo mātugāmo’’ti. ‘‘Āgamehi tvaṃ, āvuso ānanda, mā te saṅgho uttari upaparikkhi’’. ‘‘Taṃ kiṃ maññasi, āvuso ānanda, api nu tvaṃ bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Ānandopi, bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharatī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Ahaṃ kho, āvuso, bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Kassapopi, bhikkhave, yāvadeva ākaṅkhati vivicceva kāmehi vivicca akusalehi dhammehi…pe… paṭhamaṃ jhānaṃ upasampajja viharatī’ti…pe…. (Navannaṃ anupubbavihārasamāpattīnaṃ pañcannañca abhiññānaṃ evaṃ vitthāro veditabbo.) ‘‘Taṃ kiṃ maññasi, āvuso ānanda, api nu tvaṃ bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. Ānandopi, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Ahaṃ kho, āvuso, bhagavato sammukhā bhikkhusaṅghe upanīto – ‘ahaṃ, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi. Kassapopi, bhikkhave, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’’ti. ‘‘Sattaratanaṃ vā, āvuso, nāgaṃ aḍḍhaṭṭhamaratanaṃ vā tālapattikāya chādetabbaṃ maññeyya, yo me cha abhiññā chādetabbaṃ maññeyyā’’ti. Cavittha ca pana thullatissā bhikkhunī brahmacariyamhāti. Dasamaṃ.",
      "english": "Thus have I heard: On one occasion the Venerable Mahakassapa was dwelling in Savatthi, at Jeta's Grove, Anathapindika's monastery.\n\nThen indeed, the Venerable Ananda, having dressed in the morning and taken his bowl and outer robe, approached the Venerable Mahakassapa. Having approached, he said to the Venerable Mahakassapa, \"Come, Venerable Kassapa, let us approach a certain nun's residence.\" \"You go, friend Ananda, you have many duties, many tasks to attend to.\" A second time indeed, the Venerable Ananda said to the Venerable Mahakassapa, \"Come, Venerable Kassapa, let us approach a certain nun's residence.\" \"You go, friend Ananda, you have many duties, many tasks to attend to.\" A third time indeed, the Venerable Ananda said to the Venerable Mahakassapa, \"Come, Venerable Kassapa, let us approach a certain nun's residence.\"\n\nThen indeed, the Venerable Mahakassapa, having dressed in the morning and taken his bowl and outer robe, with the Venerable Ananda as his attendant monk, approached a certain nun's residence. Having approached, he sat down on the seat that had been prepared. Then indeed, many bhikkhunis approached the Venerable Mahakassapa. Having approached and paid homage to the Venerable Mahakassapa, they sat down to one side. Indeed, for those bhikkhunis seated to one side, the Venerable Mahakassapa instructed, inspired, encouraged, and gladdened them with a talk on the Dhamma. Then indeed, the Venerable Mahakassapa, having instructed, inspired, encouraged, and gladdened those bhikkhunis with a talk on the Dhamma, rose from his seat and departed.\n\nThen indeed, the bhikkhuni Thullatissa, being displeased, uttered displeased words: \"Does Venerable Mahakassapa really think he should teach the Dhamma in the presence of Venerable Ananda, the sage of Videha? Just as a needle vendor might think of selling needles in the presence of a needle maker, even so does Venerable Mahakassapa think of teaching the Dhamma in the presence of Venerable Ananda, the sage of Videha.\" Indeed, the Venerable Mahakassapa heard the bhikkhuni Thullatissa speaking these words. Then indeed, the Venerable Mahakassapa said to the Venerable Ananda, \"Now, friend Ananda, am I the needle vendor and you the needle maker; or am I the needle maker and you the needle vendor?\" \"Please forgive, Venerable Kassapa, the foolish woman.\" \"Wait, friend Ananda, lest the Sangha examine you further.\"\n\n\"What do you think, friend Ananda, were you introduced by the Blessed One to the assembly of monks with the declaration: ‘Monks, whenever I wish, quite secluded from sensual pleasures, secluded from unwholesome states, I enter and remain in the first jhana, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and happiness. Ananda too, monks, whenever he wishes, quite secluded from sensual pleasures, secluded from unwholesome states, enters and remains in the first jhana, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and happiness’?\" \"No, Venerable sir.\" \"But I, friend, was introduced by the Blessed One to the assembly of monks with the declaration: ‘Monks, whenever I wish, quite secluded from sensual pleasures, secluded from unwholesome states, I enter and remain in the first jhana, which is accompanied by initial application and sustained application, born of seclusion, filled with rapture and happiness. Kassapa too, monks, whenever he wishes, quite secluded from sensual pleasures, secluded from unwholesome states, he enters and remains in the first jhana, and so too in the second, third, and fourth jhanas, and in the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothingness, and the sphere of neither perception nor non-perception.’\"\n\n\"What do you think, friend Ananda, were you introduced by the Blessed One to the assembly of monks with the declaration: ‘Monks, with the destruction of the taints, I enter and remain in the taintless liberation of mind and liberation by wisdom, having realized it for myself with direct knowledge in this very life. Ananda too, monks, with the destruction of the taints, enters and remains in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life’?\" \"No, Venerable sir.\" \"But I, friend, was introduced by the Blessed One to the assembly of monks with the declaration: ‘Monks, with the destruction of the taints, I enter and remain in the taintless liberation of mind and liberation by wisdom, having realized it for myself with direct knowledge in this very life. Kassapa too, monks, with the destruction of the taints, enters and remains in the taintless liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life’.\" \"Friend, one might think of covering an elephant that is seven cubits or seven and a half cubits tall with a palm-leaf, but one would not think of covering my six direct knowledges.\"\n\nAnd the bhikkhuni Thullatissa, indeed, fell away from the holy life.",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයක ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයේ වැඩ වාසය කරන සේක.\n\nඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු රැගෙන, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට එළඹ, එළඹ, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට මෙය කීහ: \"පින්වත් කාශ්‍යපයන් වහන්ස, වඩින්න. යම් භික්ෂුණී ආරාමයක් ඇද්ද, එහි අපි යමු.\"\n\n\"ආනන්දාවුසෝ, ඔබ යන්න. ඔබට බොහෝ කටයුතු ඇත්තේය, කළ යුතු දේ බොහෝය.\"\n\nදෙවෙනි වරටත් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට මෙය කීහ: \"පින්වත් කාශ්‍යපයන් වහන්ස, වඩින්න. යම් භික්ෂුණී ආරාමයක් ඇද්ද, එහි අපි යමු.\" එවිට, \"ආනන්දාවුසෝ, ඔබ යන්න. ඔබට බොහෝ කටයුතු ඇත්තේය, කළ යුතු දේ බොහෝය\" යැයි මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ වදාළහ.\n\nතුන්වෙනි වරටත් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට මෙය කීහ: \"පින්වත් කාශ්‍යපයන් වහන්ස, වඩින්න. යම් භික්ෂුණී ආරාමයක් ඇද්ද, එහි අපි යමු.\"\n\nඉන්පසු ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු රැගෙන, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පසුව ගමන් කරද්දී, යම් භික්ෂුණී ආරාමයක් ඇද්ද, එහි එළඹියහ. එළඹ, පනවන ලද අසුනක වැඩහුන්හ.\n\nඉන්පසු බොහෝ භික්ෂුණීන් වහන්සේලා ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට එළඹ, එළඹ, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට වැඳ නමස්කාර කොට, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වැඩසිටි ඒ භික්ෂුණීන් වහන්සේලාට ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ධර්ම කථාවකින් ධර්මාවබෝධය ඇති කළහ, සමාදන් කරවූහ, උනන්දු කරවූහ, සතුටු කරවූහ.\n\nඉන්පසු ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ඒ භික්ෂුණීන් වහන්සේලාට ධර්ම කථාවකින් ධර්මාවබෝධය ඇති කර, සමාදන් කරවා, උනන්දු කරවා, සතුටු කරවා, අසුනෙන් නැගිට පිටත්ව ගියහ.\n\nඉන්පසු ථුල්ලතිස්සා නම් භික්ෂුණිය සතුටු නොවුණු සිතින්, නොසතුටු වචනයක් පිට කළාය: \"කුමක්ද, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ, ධර්ම විශාරද වූ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ඉදිරියේ ධර්මය දේශනා කළ යුතු යැයි සිතනවාද? යම්සේ ඉඳිකටු වෙළෙන්දෙක් ඉඳිකටු සාදන්නා ළඟ ඉඳිකටු විකිණිය යුතු යැයි සිතන්නේද, එලෙසින්ම ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ, ධර්ම විශාරද වූ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ඉදිරියේ ධර්මය දේශනා කළ යුතු යැයි සිතනවා.\"\n\nථුල්ලතිස්සා භික්ෂුණිය මේ වචනය කියද්දී, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ එය ඇසූහ.\n\nඉන්පසු ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය කීහ: \"ආනන්දාවුසෝ, මා ඉඳිකටු වෙළෙන්දෙක්ද, ඔබ ඉඳිකටු සාදන්නෙක්ද? නැතහොත් මා ඉඳිකටු සාදන්නෙක්ද, ඔබ ඉඳිකටු වෙළෙන්දෙක්ද?\"\n\n\"පින්වත, මේ ස්ත්‍රිය මෝඩය. සමාව දෙන සේක්වා.\"\n\n\"ආනන්දාවුසෝ, ඔබ සිටින්න. සංඝයා ඔබට තවදුරටත් විමර්ශනය නොකරනු ඇත.\"\n\n\"ආනන්දාවුසෝ, ඔබ කුමක් සිතන්නෙහිද? භාග්‍යවතුන් වහන්සේ ඉදිරියේ භික්ෂු සංඝයා අතර ඔබ මෙසේ ඉදිරිපත් කරනු ලැබුවේද - 'මහණෙනි, මම කැමති වන තාක් දුරට කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සහ සුඛයෙන් යුතු වූ පළමු ධ්‍යානයට එළඹ වාසය කරමි. ආනන්ද ද මහණෙනි, කැමති වන තාක් දුරට කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සහ සුඛයෙන් යුතු වූ පළමු ධ්‍යානයට එළඹ වාසය කරයි' කියා?\"\n\n\"පින්වත, එසේ නොවේ.\"\n\n\"ආවුසෝ, භාග්‍යවතුන් වහන්සේ ඉදිරියේ භික්ෂු සංඝයා අතර මා මෙසේ ඉදිරිපත් කරනු ලැබුවේය - 'මහණෙනි, මම කැමති වන තාක් දුරට කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සහ සුඛයෙන් යුතු වූ පළමු ධ්‍යානයට එළඹ වාසය කරමි. විතර්ක විචාරයන් සංසිඳුවීමෙන්, අභ්‍යන්තර සංගතියෙන්, සිතේ එකඟතාවයෙන්, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීති සහ සුඛයෙන් යුතු වූ දෙවෙනි ධ්‍යානයට එළඹ වාසය කරමි. ප්‍රීතියෙහිද නොඇල්මෙන් උපේක්ෂා සහිතව වාසය කරමි. සිහියෙන් යුතුව, මනා නුවණින් යුතුව, ශරීරයෙන් සැප විඳිමි. ආර්යයන් වහන්සේලා 'උපේක්ෂා සහිත, සිහි නුවණින් යුතුව සැප විහරණය කරයි' යැයි කියන යම් ඒ තුන්වෙනි ධ්‍යානයක් වේද, එයට එළඹ වාසය කරමි. සුඛය පහකිරීමෙන්ද, දුක පහකිරීමෙන්ද, පෙරදී සෝමනස්ස දෝමනස්සයන් අතුරුදහන් වීමෙන්ද, දුක් රහිත, සැප රහිත, උපේක්ෂා සිහියෙන් පිරිසිදු වූ සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරමි. කාශ්‍යප ද මහණෙනි, කැමති වන තාක් දුරට කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව... පළමු ධ්‍යානයට, දෙවෙනි ධ්‍යානයට, තුන්වෙනි ධ්‍යානයට, සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරයි' කියා.\"\n\n\"ආනන්දාවුසෝ, ඔබ කුමක් සිතන්නෙහිද? භාග්‍යවතුන් වහන්සේ ඉදිරියේ භික්ෂු සංඝයා අතර ඔබ මෙසේ ඉදිරිපත් කරනු ලැබුවේද - 'මහණෙනි, මම ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්ම භාවයේදීම ස්වයංව අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට වාසය කරමි. ආනන්ද ද මහණෙනි, ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්ම භාවයේදීම ස්වයංව අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට වාසය කරයි' කියා?\"\n\n\"පින්වත, එසේ නොවේ.\"\n\n\"ආවුසෝ, භාග්‍යවතුන් වහන්සේ ඉදිරියේ භික්ෂු සංඝයා අතර මා මෙසේ ඉදිරිපත් කරනු ලැබුවේය - 'මහණෙනි, මම ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්ම භාවයේදීම ස්වයංව අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට වාසය කරමි. කාශ්‍යප ද මහණෙනි, ආශ්‍රවයන් ක්ෂය කිරීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්ම භාවයේදීම ස්වයංව අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට වාසය කරයි' කියා.\"\n\n\"ආවුසෝ, සප්ත රත්නයක් හෝ මහානාගයෙක් තල් කොළයකින් වසා තැබිය යුතු යැයි යමෙක් සිතන්නේද, එලෙසින්ම යමෙක් මාගේ ෂඩ් අභිඥාවන් වසා තැබිය යුතු යැයි සිතන්නේද, (එයද එබඳු මෝඩ ක්‍රියාවකි).\"\n\nථුල්ලතිස්සා භික්ෂුණිය ඒ බඹසරින් පිරිහී ගියාය.",
      "paliTitle": "Upassayasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Residence",
      "sinhalaTitle": "උපස්සය සූත්‍රය"
    },
    {
      "number": 154,
      "pali": "Ekaṃ samayaṃ āyasmā mahākassapo rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ānando dakkhiṇagirismiṃ cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ. Tena kho pana samayena āyasmato ānandassa tiṃsamattā saddhivihārino bhikkhū sikkhaṃ paccakkhāya hīnāyāvattā bhavanti yebhuyyena kumārabhūtā. Atha kho āyasmā ānando dakkhiṇagirismiṃ yathābhirantaṃ cārikaṃ caritvā yena rājagahaṃ veḷuvanaṃ kalandakanivāpo yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākassapaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ āyasmā mahākassapo etadavoca – ‘‘kati nu kho, āvuso ānanda, atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññatta’’nti? ‘‘Tayo kho, bhante kassapa, atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññattaṃ – dummaṅkūnaṃ puggalānaṃ niggahāya pesalānaṃ bhikkhūnaṃ phāsuvihārāya, mā pāpicchā pakkhaṃ nissāya saṅghaṃ bhindeyyuṃ [vinayapiṭake cūḷavagge saṃghabhedakakkhandhake vajirabuddhiyaṃ aññathā sambandho dassito], kulānuddayatāya ca. Ime kho, bhante kassapa, tayo atthavase paṭicca bhagavatā kulesu tikabhojanaṃ paññatta’’nti. ‘‘Atha kiñcarahi tvaṃ, āvuso ānanda, imehi navehi bhikkhūhi indriyesu aguttadvārehi bhojane amattaññūhi jāgariyaṃ ananuyuttehi saddhiṃ cārikaṃ carasi? Sassaghātaṃ maññe carasi, kulūpaghātaṃ maññe carasi. Olujjati [ullujjati (sī. aṭṭhakathāsu ca)] kho te, āvuso ānanda, parisā; palujjanti kho te, āvuso, navappāyā. Na vāyaṃ kumārako mattamaññāsī’’ti. ‘‘Api me, bhante kassapa, sirasmiṃ palitāni jātāni. Atha ca pana mayaṃ ajjāpi āyasmato mahākassapassa kumārakavādā na muccāmā’’ti. ‘‘Tathā hi pana tvaṃ, āvuso ānanda, imehi navehi bhikkhūhi indriyesu aguttadvārehi bhojane amattaññūhi jāgariyaṃ ananuyuttehi saddhiṃ cārikaṃ carasi, sassaghātaṃ maññe carasi, kulūpaghātaṃ maññe carasi. Olujjati kho te, āvuso ānanda, parisā; palujjanti kho te, āvuso, navappāyā. [palujjati kho te āvuso ānanda parisā (ka. sī.)] Na vāyaṃ kumārako mattamaññāsī’’ti. Assosi kho thullanandā bhikkhunī – ‘‘ayyena kira mahākassapena ayyo ānando vedehamuni kumārakavādena apasādito’’ti. Atha kho thullanandā bhikkhunī anattamanā anattamanavācaṃ nicchāresi – ‘‘kiṃ pana ayyo mahākassapo aññatitthiyapubbo samāno ayyaṃ ānandaṃ vedehamuniṃ kumārakavādena apasādetabbaṃ maññatī’’ti! Assosi kho āyasmā mahākassapo thullanandāya bhikkhuniyā imaṃ vācaṃ bhāsamānāya. Atha kho āyasmā mahākassapo āyasmantaṃ ānandaṃ etadavoca – ‘‘tagghāvuso ānanda, thullanandāya bhikkhuniyā sahasā appaṭisaṅkhā vācā bhāsitā. Yatvāhaṃ, āvuso, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito, nābhijānāmi aññaṃ satthāraṃ uddisitā [uddisituṃ (sī. pī. ka.)], aññatra tena bhagavatā arahatā sammāsambuddhena. Pubbe me, āvuso, agārikabhūtassa sato etadahosi – ‘sambādho gharāvāso rajāpatho [rajopatho (sī.)], abbhokāso pabbajjā. Nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So khvāhaṃ, āvuso, aparena samayena paṭapilotikānaṃ saṅghāṭiṃ kāretvā [karitvā (sī. syā. kaṃ. pī.)] ye loke arahanto te uddissa kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajiṃ. So evaṃ pabbajito samāno addhānamaggappaṭipanno addasaṃ bhagavantaṃ antarā ca rājagahaṃ antarā ca nāḷandaṃ bahuputte cetiye nisinnaṃ. Disvāna me etadahosi – ‘satthārañca vatāhaṃ passeyyaṃ, bhagavantameva passeyyaṃ; sugatañca vatāhaṃ passeyyaṃ, bhagavantameva passeyyaṃ; sammāsambuddhañca vatāhaṃ passeyyaṃ; bhagavantameva passeyya’nti. So khvāhaṃ, āvuso, tattheva bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocaṃ – ‘satthā me, bhante, bhagavā, sāvakohamasmi; satthā me, bhante, bhagavā, sāvakohamasmī’ti. Evaṃ vutte maṃ, āvuso, bhagavā etadavoca – ‘yo kho, kassapa, evaṃ sabbacetasā samannāgataṃ sāvakaṃ ajānaññeva vadeyya jānāmīti, apassaññeva vadeyya passāmīti, muddhāpi tassa vipateyya. Ahaṃ kho pana, kassapa, jānaññeva vadāmi jānāmīti, passaññeva vadāmi passāmī’ti. Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ – ‘tibbaṃ me hirottappaṃ paccupaṭṭhitaṃ bhavissati theresu navesu majjhimesū’ti. Evañhi te, kassapa, sikkhitabbaṃ. Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ – ‘yaṃ kiñci dhammaṃ suṇissāmi kusalūpasaṃhitaṃ sabbaṃ taṃ aṭṭhiṃ katvā manasi karitvā sabbacetasā samannāharitvā ohitasoto dhammaṃ suṇissāmī’ti. Evañhi te, kassapa, sikkhitabbaṃ. Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ – ‘sātasahagatā ca me kāyagatāsati na vijahissatī’ti. Evañhi te, kassapa, sikkhitabbanti. ‘‘Atha kho maṃ, āvuso, bhagavā iminā ovādena ovaditvā uṭṭhāyāsanā pakkāmi. Sattāhameva khvāhaṃ, āvuso, saraṇo [sāṇo (sī.)] raṭṭhapiṇḍaṃ bhuñjiṃ’’. Aṭṭhamiyā aññā udapādi. ‘‘Atha kho, āvuso, bhagavā maggā okkamma yena aññataraṃ rukkhamūlaṃ tenupasaṅkami. Atha khvāhaṃ, āvuso, paṭapilotikānaṃ saṅghāṭiṃ catugguṇaṃ paññapetvā bhagavantaṃ etadavocaṃ – ‘idha, bhante, bhagavā nisīdatu, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’ti. Nisīdi kho, āvuso, bhagavā paññatte āsane. Nisajja kho maṃ, āvuso, bhagavā etadavoca – ‘mudukā kho tyāyaṃ, kassapa, paṭapilotikānaṃ saṅghāṭī’ti. ‘Paṭiggaṇhātu me, bhante, bhagavā paṭapilotikānaṃ saṅghāṭiṃ anukampaṃ upādāyā’ti. ‘Dhāressasi pana me tvaṃ, kassapa, sāṇāni paṃsukūlāni nibbasanānī’ti. ‘Dhāressāmahaṃ, bhante, bhagavato sāṇāni paṃsukūlāni nibbasanānī’ti. ‘‘So khvāhaṃ, āvuso, paṭapilotikānaṃ saṅghāṭiṃ bhagavato pādāsiṃ. Ahaṃ pana bhagavato sāṇāni paṃsukūlāni nibbasanāni paṭipajjiṃ’’. ‘‘Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni [paṭiggahetā (sī.)] sāṇāni paṃsukūlāni nibbasanānī’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘bhagavato putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo, paṭiggahitāni sāṇāni paṃsukūlāni nibbasanānī’’’ti. ‘‘Ahaṃ kho, āvuso, yāvadeva ākaṅkhāmi vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Ahaṃ kho, āvuso, yāvade ākaṅkhāmi…pe… (navannaṃ anupubbavihārasamāpattinaṃ pañcannañca abhiññānaṃ evaṃ vitthāro veditabbo). ‘‘Ahaṃ kho, āvuso, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharāmi; sattaratanaṃ vā, āvuso, nāgaṃ aḍḍhaṭṭhamaratanaṃ vā tālapattikāya chādetabbaṃ maññeyya, yo me cha abhiññā chādetabbaṃ maññeyyā’’ti. Cavittha ca pana thullanandā bhikkhunī brahmacariyamhāti. Ekādasamaṃ.",
      "english": "On one occasion, the Venerable Mahākassapa was dwelling at Rājagaha in the Bamboo Grove, the Squirrels’ Feeding Ground. Now at that time, the Venerable Ānanda was on a wandering tour in Dakkhiṇagiri with a large community of monastics. At that time, some thirty of the Venerable Ānanda's resident monastics, who were for the most part young and inexperienced, had renounced the training and returned to a lower state. Then the Venerable Ānanda, after wandering in Dakkhiṇagiri for as long as he wished, approached Rājagaha, the Bamboo Grove, the Squirrels' Feeding Ground, where the Venerable Mahākassapa was dwelling; having approached, he paid homage to the Venerable Mahākassapa and sat down to one side. To the Venerable Ānanda, who was sitting to one side, the Venerable Mahākassapa said this: \"Friend Ānanda, for how many reasons did the Blessed One lay down the rule of the 'three meals' for householders?\"\n\n\"Indeed, Venerable Kassapa, the Blessed One laid down the rule of the 'three meals' for householders for three reasons: for the discipline of ill-mannered individuals, for the comfortable dwelling of scrupulous monastics, so that those with evil wishes may not, relying on a faction, cause schism in the Saṅgha, and out of compassion for householders. Venerable Kassapa, these are the three reasons for which the Blessed One laid down the rule of the 'three meals' for householders.\"\n\n\"Then why, friend Ānanda, do you go on wandering tour with these new monastics whose sense-doors are unguarded, who are immoderate in eating, and who are not devoted to wakefulness? I think you are causing ruin to the harvest of good qualities. I think you are causing ruin to families of supporters. Your retinue, friend Ānanda, is dissolving; friend, those who are new are falling away. This young fellow still doesn't know his measure.\"\n\n\"Venerable Kassapa, even though grey hairs have appeared on my head, we still cannot escape being addressed as a 'young fellow' by the Venerable Mahākassapa.\"\n\n\"That is precisely because, friend Ānanda, you go on wandering tour with these new monastics whose sense-doors are unguarded, who are immoderate in eating, and who are not devoted to wakefulness. I think you are causing ruin to the harvest of good qualities. I think you are causing ruin to families of supporters. Your retinue, friend Ānanda, is dissolving; friend, those who are new are falling away. This young fellow still doesn't know his measure.\"\n\nNow the nun Thullanandā heard that the Venerable Mahākassapa had supposedly disparaged the Venerable Ānanda, the sage from Videha, calling him a \"young fellow.\" Then the nun Thullanandā, displeased, gave vent to displeased words: \"Does the Venerable Mahākassapa, who was formerly a follower of another sect, think it appropriate to disparage the Venerable Ānanda, the sage from Videha, by calling him a 'young fellow'?\"\n\nThe Venerable Mahākassapa heard the nun Thullanandā speaking these words. Then the Venerable Mahākassapa said to the Venerable Ānanda: \"Indeed, friend Ānanda, the nun Thullanandā has spoken rash and ill-considered words. From the time, friend, that I shaved off my hair and beard, put on saffron robes, and went forth from the household life into homelessness, I do not recognize any other teacher, apart from the Blessed One, the Arahant, the Perfectly Self-Awakened One.\"\n\n\"Formerly, friend, while I was still a householder, it occurred to me: 'Household life is confining, a path of dust (defilements), while going forth (into homelessness) is open space. It is not easy for one dwelling in a house to lead the holy life utterly complete, utterly purified, polished like a conch-shell. How would it be if I were to shave off my hair and beard, put on saffron robes, and go forth from the household life into homelessness?'\"\n\n\"So then, friend, at a later time, I had a robe made from rag-fragments, intending it for those who are Arahants in the world, and having shaved off my hair and beard, put on saffron robes, I went forth from the household life into homelessness.\"\n\n\"Having thus gone forth, as I was traveling along the road, I saw the Blessed One sitting at the Bahuputta shrine, between Rājagaha and Nāḷandā. When I saw him, it occurred to me: 'Indeed, I must see the Teacher, I must see the Blessed One! I must see the Fortunate One, I must see the Blessed One! I must see the Perfectly Self-Awakened One, I must see the Blessed One!'\"\n\n\"So then, friend, right there I prostrated myself with my head at the Blessed One's feet and said to the Blessed One: 'My Teacher, Venerable Sir, is the Blessed One; I am a disciple. My Teacher, Venerable Sir, is the Blessed One; I am a disciple.' When I had said this, friend, the Blessed One said to me: 'Kassapa, if anyone were to say 'I know' without knowing, or 'I see' without seeing, with reference to a disciple who is thus endowed with complete mental devotion, his head would surely split apart.'\"\n\nI, Kassapa, when I know, I say 'I know'; when I see, I say 'I see'. Therefore, Kassapa, you should train yourself thus: 'I shall establish intense shame and dread of wrongdoing among the elders, the newly ordained, and those in between.' Thus, Kassapa, should you train. Therefore, Kassapa, you should train yourself thus: 'Whatever teaching I shall hear that is conducive to wholesome states, I shall listen to it with an attentive ear, treating it as vital, bearing it in mind, and applying my whole mental faculty to it.' Thus, Kassapa, should you train. Therefore, Kassapa, you should train yourself thus: 'Mindfulness of the body, accompanied by ease, will not abandon me.' Thus, Kassapa, should you train.\n\nThen, friends, the Fortunate One, having exhorted me with this instruction, rose from his seat and departed. For seven days, friends, I ate the alms food of the country without having attained final knowledge. On the eighth day, final knowledge arose in me.\n\nThen, friends, the Fortunate One turned off the road and approached a certain tree root. Then, friends, I folded my rag-robe fourfold and, having spread it out, said to the Fortunate One, 'Venerable Sir, may the Fortunate One sit here; this will be for my long-term welfare and happiness.' And, friends, the Fortunate One sat down on the seat I had prepared. Having sat down, friends, the Fortunate One said to me, 'This rag-robe of yours, Kassapa, is soft.' 'Venerable Sir, may the Fortunate One accept this rag-robe of mine out of compassion.' 'But, Kassapa, will you wear for me coarse hempen rag-robes?' 'Venerable Sir, I will wear for the Fortunate One coarse hempen rag-robes.'\n\nSo, friends, I gave the Fortunate One my rag-robe. And I, in turn, began to wear the Fortunate One's coarse hempen rag-robes.\n\nIf, friends, one were to rightly say of someone, 'He is a true son of the Fortunate One, born of his mouth, born of the Dhamma, created by the Dhamma, an heir to the Dhamma, having accepted coarse hempen rag-robes,' then, rightly speaking, one would say that of me: 'He is a true son of the Fortunate One, born of his mouth, born of the Dhamma, created by the Dhamma, an heir to the Dhamma, having accepted coarse hempen rag-robes.'\n\nFriends, as I wish, quite secluded from sensual pleasures, secluded from unwholesome states, I enter and remain in the first jhāna, which is accompanied by initial and sustained application, born of seclusion, filled with rapture and happiness. Friends, as I wish, I also enter and remain in all the successive meditative attainments and realize the various higher knowledges. Friends, with the destruction of the taints, I enter and remain in the taintless liberation of mind and liberation by wisdom, having realized it for myself with direct knowledge in this very life. Friends, one might think to conceal a magnificent elephant, seven or seven and a half cubits tall, with a palm leaf; similarly, one might think to conceal my six higher knowledges.\n\nAnd indeed, the bhikkhuni Thullanandā fell away from the spiritual life.",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ රාජගෘහයෙහි වේළුවන නම් කළඳකනිවාප නම් ස්ථානයෙහි වැඩසිටියහ. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මහත් භික්ෂු සංඝයා පිරිවරාගෙන දක්ඛිණගිරියෙහි චාරිකාවේ හැසිරෙමින් සිටියහ. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේගේ තිස් නමක් පමණ සද්ධිවිහාරික භික්ෂූහු ශික්ෂාව අත්හැර හීන තත්ත්වයට පත් වූහ; බොහෝ දුරට ඔවුහු ළාබාල වූහ. ඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ දක්ඛිණගිරියෙහි කැමති පමණ චාරිකාවේ හැසිර, රාජගෘහයෙහි වේළුවන කළඳකනිවාපය වෙත, යම් තැනක ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ වැඩසිටින්නාහු ද, ඒ තැනට වැඩම කළහ; එසේ වැඩම කොට ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට වන්දනා කොට එකත්පසෙක වැඩසිටියහ. එකත්පසෙක වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ මෙය පැවසූහ: \"ඇවැත් ආනන්ද, කුමන කරුණු නිසා භාග්‍යවතුන් වහන්සේ විසින් කුලයන්හි තිල භෝජනය (තුන් කුලකින් පමණක් දානය පිළිගැනීමේ නියමය) පනවන ලද්දේ ද?\" \"පින්වත් කාශ්‍යපයන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් කුලයන්හි තිල භෝජනය පනවනු ලැබුවේ කරුණු තුනක් නිසා ය. එනම්, දුෂ්ශීල පුද්ගලයන් දමනය කිරීම පිණිස, ගුණවත් භික්ෂූන් වහන්සේලාගේ සැප විහරණය පිණිස, දුරාශාවන් ඇති අය පිරිසක් අල්ලාගෙන සංඝභේදයක් ඇති නොකරන පිණිස, සහ කුලයන් කෙරෙහි අනුකම්පාවෙන් යන මේ කරුණු තුන නිසා ය. පින්වත් කාශ්‍යපයන් වහන්ස, මේ කරුණු තුන නිසා භාග්‍යවතුන් වහන්සේ විසින් කුලයන්හි තිල භෝජනය පනවන ලද්දේ ය.\"\n\n\"එසේ නම් ඇවැත් ආනන්ද, ඔබ මේ නවක භික්ෂූන් සමඟ, ඉන්ද්‍රියයන්හි නොරක්නා ලද දොරටු ඇත්තා වූ, භෝජනයෙහි පමණ නොදන්නා වූ, ජාගරියාවට (වීර්යයෙන් යුතුව විසීමට) නොපැමිණි වූ, පිරිස සමඟ චාරිකාවේ හැසිරෙන්නේ කුමක් නිසා ද? ඔබ ගොවිතැන් විනාශ කරමින් හැසිරෙන්නාක් මෙනි, කුලයන්ට විනාශය ගෙන දෙන්නාක් මෙනි. ඇවැත් ආනන්ද, ඔබගේ පිරිස අවුල් වෙයි; ඇවැත්නි, ඔබගේ නවක පිරිස බිඳී යයි. මේ ළදරුවා පමණ නොදනී\" යැයි පැවසූහ. \"පින්වත් කාශ්‍යපයන් වහන්ස, මාගේ හිසෙහි කෙස් පැසී ඇත. එසේ වුවද අපි තවමත් ආයුෂ්මත් මහාකාශ්‍යපයන් වහන්සේගේ ‘ළදරුවා’ යැයි හඳුන්වන වාදයෙන් නිදහස් නොවෙමු\" යැයි ආනන්ද ස්ථවිරයන් වහන්සේ පිළිතුරු දුන්හ. \"ඇවැත් ආනන්ද, එසේ නම් ඔබ මේ නවක භික්ෂූන් සමඟ, ඉන්ද්‍රියයන්හි නොරක්නා ලද දොරටු ඇත්තා වූ, භෝජනයෙහි පමණ නොදන්නා වූ, ජාගරියාවට (වීර්යයෙන් යුතුව විසීමට) නොපැමිණි වූ, පිරිස සමඟ චාරිකාවේ හැසිරෙන්නේ ය. ඔබ ගොවිතැන් විනාශ කරමින් හැසිරෙන්නාක් මෙනි, කුලයන්ට විනාශය ගෙන දෙන්නාක් මෙනි. ඇවැත් ආනන්ද, ඔබගේ පිරිස අවුල් වෙයි; ඇවැත්නි, ඔබගේ නවක පිරිස බිඳී යයි. මේ ළදරුවා පමණ නොදනී\" යැයි මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ නැවත පැවසූහ.\n\nථුල්ලනන්දා නම් භික්ෂුණිය මෙසේ අසා සිටියා ය – \"පින්වත් මහාකාශ්‍යපයන් වහන්සේ විසින් පින්වත් ආනන්ද වේදේහමුනින් වහන්සේට ‘ළදරුවා’ යැයි පවසා නින්දා කරන ලද්දේලු.\" ඉන්පසු ථුල්ලනන්දා භික්ෂුණිය නොසතුටු වී නොසතුටු වචනයක් පිට කළා ය – \"පින්වත් මහාකාශ්‍යපයන් වහන්සේ අන්‍ය තීර්ථක ආගමකට අයත්ව සිටි කෙනෙකු වී, පින්වත් ආනන්ද වේදේහමුනින් වහන්සේට ‘ළදරුවා’ යැයි පවසා නින්දා කළ යුතු යැයි සිතන්නේ කුමක් නිසා ද?\" ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ථුල්ලනන්දා භික්ෂුණිය මේ වචනය පවසනු අසා සිටියහ. ඉන්පසු ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: \"ඇවැත් ආනන්ද, ථුල්ලනන්දා භික්ෂුණිය විසින් කල්පනාවකින් තොරව හදිසියේ කියන ලද වචනයක් (එය) සත්‍යයකි. ඇවැත්නි, යම් දවසක මම කෙස් රැවුල් බා, කහ සිවුරු හැඳ, ගිහිගෙයින් නික්ම අනගාරිකත්වයෙහි පැවිදි වූයෙම් ද, එතැන් පටන් ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ හැර වෙනත් ශාස්තෘවරයෙකු නම් කළ බවක් මම නොදනිමි. ඇවැත්නි, කලින් ගිහිගෙයි වසන විට මට මෙවැනි අදහසක් ඇති විය – ‘ගිහි ජීවිතය බාධා සහිත ය, කෙලෙස් සහිත මාර්ගයකි. පැවිද්ද අහස මෙන් නිදහස් ය. ගිහිගෙයි වසන්නෙකුට එකෙළෙසින්ම පිරිපුන්, එකෙළෙසින්ම පිරිසිදු, සක් හෙවත් හක්ගෙඩියක් මෙන් මලක් නැති බ්‍රහ්මචාරී ජීවිතයක් ගත කිරීම පහසු නොවේ. මම කෙස් රැවුල් බා, කහ සිවුරු හැඳ, ගිහිගෙයින් නික්ම අනගාරිකත්වයෙහි පැවිදි වන්නෙම් නම් හොඳයි’ කියා ය. ඇවැත්නි, පසුව මම කඩමාලු වලින් සඟල සිවුරක් සාදාගෙන, ලෝකයෙහි යම් රහතන් වහන්සේලා ඇද්ද, ඒ රහතන් වහන්සේලා අරමුණු කර (ඔවුන්ගේ මාර්ගයට අනුව), කෙස් රැවුල් බා, කහ සිවුරු හැඳ, ගිහිගෙයින් නික්ම අනගාරිකත්වයෙහි පැවිදි වීමි. එසේ පැවිදි වූ මම මාර්ගයෙහි ගමන් කරමින් සිටියදී, රාජගෘහයත් නාලන්දාවත් අතර බහුපුත්ත චෛත්‍යය අසල වැඩසිටින භාග්‍යවතුන් වහන්සේ දැක්කාමි. දැකීමෙන් මට මෙසේ සිතුණි – ‘අහෝ, මට ශාස්තෘන් වහන්සේ දැකගන්නට ලැබේවා, භාග්‍යවතුන් වහන්සේම දැකගන්නට ලැබේවා; සුගතයන් වහන්සේ දැකගන්නට ලැබේවා, භාග්‍යවතුන් වහන්සේම දැකගන්නට ලැබේවා; සම්මාසම්බුදුරජාණන් වහන්සේ දැකගන්නට ලැබේවා, භාග්‍යවතුන් වහන්සේම දැකගන්නට ලැබේවා!’ කියා ය. ඇවැත්නි, එබැවින් මම එතැනදීම භාග්‍යවතුන් වහන්සේගේ දෙපාමුල හිස තබා වැඳ, භාග්‍යවතුන් වහන්සේට මෙය පැවසුවෙමි – ‘ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මාගේ ශාස්තෘවරයා ය, මම උන්වහන්සේගේ ශ්‍රාවකයා වෙමි; ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මාගේ ශාස්තෘවරයා ය, මම උන්වහන්සේගේ ශ්‍රාවකයා වෙමි’ කියා ය. ඇවැත්නි, මෙසේ පැවසූ විට භාග්‍යවතුන් වහන්සේ මට මෙය පැවසූහ – ‘කාශ්‍යපයෙනි, යමෙක් මෙසේ සර්ව චේතනාවෙන් යුක්ත වූ ශ්‍රාවකයෙකු ගැන නොදැනම දනිමියි කියන්නේ නම්, නොදැකම දකිමියි කියන්නේ නම්, ඔහුගේ හිස පවා පැළී යන්නේ ය.\n\nනමුත් කාශ්‍යපය, මම නම් දැනගෙනමයි දන්නවා යැයි කියන්නේ; දැකගෙනමයි දකිනවා යැයි කියන්නේ. එහෙයින් කාශ්‍යපය, නුඹ මෙසේ හික්මිය යුතුය – ‘මට වැඩිහිටි, අලුත් පැවිදි වූ, සහ මැදිහත් භික්ෂූන් කෙරෙහි තදබල හිරිඔතප් දෙක උපස්ථිත වන්නේය’ යනුවෙන්. කාශ්‍යපය, නුඹ එසේ හික්මිය යුතුය. එහෙයින් කාශ්‍යපය, නුඹ මෙසේ හික්මිය යුතුය – ‘යම් කිසි කුසලයට සම්බන්ධ ධර්මයක් මම ශ්‍රවණය කරන්නෙම් ද, ඒ සියල්ල මගේ ඇටමිදුළු වලට කා වද්දන්නාක් මෙන් මනසින් ග්‍රහණය කරගෙන, මුළු සිතින් යුතුව, එකඟ සිතින්, යොමු කරන ලද සවනින් ධර්මය ශ්‍රවණය කරන්නෙමි’ යනුවෙන්. කාශ්‍යපය, නුඹ එසේ හික්මිය යුතුය. එහෙයින් කාශ්‍යපය, නුඹ මෙසේ හික්මිය යුතුය – ‘මට ප්‍රීතියෙන් යුක්ත වූ කායගතාසතිය අත්නොහරින්නේය’ යනුවෙන්. කාශ්‍යපය, නුඹ එසේ හික්මිය යුතුය.\n\nඉන්පසු ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ මේ අවවාදයෙන් මට අවවාද කොට අසුනෙන් නැගිට වැඩම කළ සේක. ආයුෂ්මතුනි, මම සත් දවසක් පමණක් සාණා චීවරයෙන් (රළු වස්ත්‍රයෙන්) රාෂ්ට්‍රපිණ්ඩය (දන් වළඳා) ජීවත් වූයෙමි. අටවෙනි දින අරහත්වයට පැමිණියෙමි.\n\nඉන්පසු ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ මාර්ගයෙන් බැහැර වී යම් අසවල් රුක්මුලක් තිබුණේ ද, ඒ දෙසට වැඩම කළ සේක. ඉන්පසු ආයුෂ්මතුනි, මම ඉරුණු රෙදි කඩින් කළ සංඝාටිය සතර ගුණයක් කොට එළා, භාග්‍යවතුන් වහන්සේට මෙසේ කීවෙමි – ‘වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වැඩ සිටින සේක්වා, එය මට බොහෝ කලක් හිත පිණිසත් සුව පිණිසත් වන්නේය’ යනුවෙන්. ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ එළන ලද අසුනෙහි වැඩ සිටි සේක. වැඩ සිටි භාග්‍යවතුන් වහන්සේ ආයුෂ්මතුනි, මට මෙසේ වදාළ සේක – ‘කාශ්‍යපය, මේ නුඹගේ ඉරුණු රෙදි කඩින් කළ සංඝාටිය මෘදුයි නේ ද’ යනුවෙන්. ‘වහන්ස, භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් මාගේ ඉරුණු රෙදි කඩින් කළ සංඝාටිය පිළිගන්නා සේක්වා’ යනුවෙන්. ‘එසේ නම් කාශ්‍යපය, නුඹ මාගේ රළු පාංශුකූල වස්ත්‍ර දරන්නෙහි ද?’ යනුවෙන්. ‘වහන්ස, මම භාග්‍යවතුන් වහන්සේගේ රළු පාංශුකූල වස්ත්‍ර දරන්නෙමි’ යනුවෙන්.\n\nආයුෂ්මතුනි, මම භාග්‍යවතුන් වහන්සේට ඉරුණු රෙදි කඩින් කළ සංඝාටිය පූජා කළෙමි. මම නම් භාග්‍යවතුන් වහන්සේගේ රළු පාංශුකූල වස්ත්‍ර ප්‍රතිග්‍රහණය කළෙමි.\n\nආයුෂ්මතුනි, යමෙක් නිවැරදිව කියන්නේ නම් – ‘භාග්‍යවතුන් වහන්සේගේ ඖරස පුත්‍රයා, මුවින් උපන්නා වූ, ධර්මයෙන් උපන්නා වූ, ධර්මයෙන් නිර්මිත වූ, ධර්ම දායාද වූ, රළු පාංශුකූල වස්ත්‍ර ප්‍රතිග්‍රහණය කළා වූ (භික්ෂුවක් වේ)’ කියා, ඒ නිවැරදි ප්‍රකාශය මා ගැනම යෙදෙන්නේය – ‘භාග්‍යවතුන් වහන්සේගේ ඖරස පුත්‍රයා, මුවින් උපන්නා වූ, ධර්මයෙන් උපන්නා වූ, ධර්මයෙන් නිර්මිත වූ, ධර්ම දායාද වූ, රළු පාංශුකූල වස්ත්‍ර ප්‍රතිග්‍රහණය කළා වූ (භික්ෂුවක් වේ)’ යනුවෙන්.\n\nමිත්‍ර‌ය, මා කැමති තාක් කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍ර‌ීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරමි. මිත්‍ර‌ය, මා කැමති තාක් (මේ ආකාරයෙන්ම දෙවෙනි, තෙවෙනි, සිවුවෙනි ධ්‍යාන වලටත්, අරූප සමාපත්ති වලටත්, නව අනුපූර්ව විහරණ සමාපත්ති වලටත්, පංච අභිඥා වලටත්) පැමිණ වාසය කරමි.\n\nමිත්‍ර‌ය, මම නම් ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍ර‌ඥා විමුක්තිය මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂයෙන් අවබෝධ කර ප්‍ර‌ත්‍යක්ෂ කොට පැමිණ වාසය කරමි; මිත්‍ර‌ය, සත් රුවනක් හෝ ඇතකු හෝ අඩ අට රුවනක් හෝ තල්පතකින් වසා තැබිය යුතු යැයි යමෙක් සිතන්නේද, එසේම යමෙක් මාගේ ඡේ අභිඥාවන් වසා තැබිය යුතු යැයි සිතන්නේද (එය එබඳු ක්‍ර‌ියාවකි).\n\nථුල්ලනන්දා භික්ෂුණිය නම් බඹසරින් චුත වූවාය. එකොළොස්වෙනි සූත්‍රයයි.",
      "paliTitle": "Cīvarasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Robes",
      "sinhalaTitle": "චීවර සූත්‍රය"
    },
    {
      "number": 155,
      "pali": "Ekaṃ samayaṃ āyasmā ca mahākassapo āyasmā ca sāriputto bārāṇasiyaṃ viharanti isipatane migadāye. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākassapo tenupasaṅkami; upasaṅkamitvā āyasmatā mahākassapena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahākassapaṃ etadavoca – ‘‘kiṃ nu kho, āvuso kassapa, hoti tathāgato paraṃ maraṇā’’ti? ‘‘Abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ panāvuso, na hoti tathāgato paraṃ maraṇā’’ti? ‘‘Evampi kho, āvuso, abyākataṃ bhagavatā – ‘na hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ nu kho, āvuso, hoti ca na ca hoti tathāgato paraṃ maraṇā’’ti? ‘‘Abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kiṃ panāvuso, neva hoti, na na hoti tathāgato paraṃ maraṇā’’ti? ‘‘Evampi kho, āvuso, abyākataṃ bhagavatā – ‘neva hoti na na hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Kasmā cetaṃ, āvuso, abyākataṃ bhagavatā’’ti? ‘‘Na hetaṃ, āvuso, atthasaṃhitaṃ nādibrahmacariyakaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Tasmā taṃ abyākataṃ bhagavatā’’ti. ‘‘Atha kiñcarahāvuso, byākataṃ bhagavatā’’ti? ‘‘Idaṃ ‘dukkha’nti kho, āvuso, byākataṃ bhagavatā; ayaṃ ‘dukkhasamudayo’ti byākataṃ bhagavatā; ayaṃ ‘dukkhanirodho’ti byākataṃ bhagavatā; ayaṃ ‘dukkhanirodhagāminī paṭipadā’ti byākataṃ bhagavatā’’ti. ‘‘Kasmā cetaṃ, āvuso, byākataṃ bhagavatā’’ti? ‘‘Etañhi, āvuso, atthasaṃhitaṃ etaṃ ādibrahmacariyakaṃ etaṃ nibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Tasmā taṃ byākataṃ bhagavatā’’ti. Dvādasamaṃ.",
      "english": "At one time, the Venerable Mahākassapa and the Venerable Sāriputta were dwelling in Bārāṇasī, at Isipatana in the Deer Park. Then, in the evening, the Venerable Sāriputta arose from his seclusion and approached the Venerable Mahākassapa. Having approached, he exchanged friendly greetings with the Venerable Mahākassapa. After exchanging polite and memorable conversation, he sat down to one side.\n\nAs he sat to one side, the Venerable Sāriputta said to the Venerable Mahākassapa: “Friend Kassapa, does the Tathāgata exist after death?”\n\n“Friend, that has been undeclared by the Blessed One: ‘The Tathāgata exists after death.’”\n\n“Then, friend, does the Tathāgata not exist after death?”\n\n“Friend, that too has been undeclared by the Blessed One: ‘The Tathāgata does not exist after death.’”\n\n“Friend, does the Tathāgata both exist and not exist after death?”\n\n“Friend, that too has been undeclared by the Blessed One: ‘The Tathāgata both exists and not exists after death.’”\n\n“Then, friend, does the Tathāgata neither exist nor not exist after death?”\n\n“Friend, that too has been undeclared by the Blessed One: ‘The Tathāgata neither exists nor not exists after death.’”\n\n“And why, friend, has this been undeclared by the Blessed One?”\n\n“Friend, this is not connected with the goal, nor is it fundamental to the holy life, nor does it lead to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to full awakening, to Nibbāna. That is why it has been undeclared by the Blessed One.”\n\n“Then what, friend, has been declared by the Blessed One?”\n\n“Friend, ‘This is suffering’ has been declared by the Blessed One; ‘This is the origin of suffering’ has been declared by the Blessed One; ‘This is the cessation of suffering’ has been declared by the Blessed One; ‘This is the path leading to the cessation of suffering’ has been declared by the Blessed One.”\n\n“And why, friend, has this been declared by the Blessed One?”\n\n“Because, friend, this is connected with the goal, this is fundamental to the holy life, this leads to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to full awakening, to Nibbāna. That is why it has been declared by the Blessed One.”",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ ද බරණැස ඉසිපතන මිගදායේ වාසය කරති. ඉක්බිති ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ සවස් වේලාවෙහි භාවනාවෙන් නැඟිට, යම් තැනෙක ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ වැඩසිටින්නාහු ද, එතැනට වැඩම කළහ. වැඩම කොට ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ සමඟ පිළිසඳර කතා කළහ. මනාප වූ ද සිහි කටයුතු වූ ද කතා පැවැත්වීමෙන් පසු එකත්පසෙක වාඩි වූහ.\n\nඑකත්පසෙක වාඩි වී සිටි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: \"ඇවැත් කාශ්‍යප, තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටින්නේ ද?\"\n\n\"ඇවැත්නි, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටිත්' යනු භාග්‍යවතුන් වහන්සේ විසින් අව්‍යාකෘත කරුණකි.\"\n\n\"එසේනම් ඇවැත්නි, තථාගතයන් වහන්සේ මරණින් පසු වැඩ නොසිටින්නේ ද?\"\n\n\"ඇවැත්නි, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩ නොසිටිත්' යනු ද භාග්‍යවතුන් වහන්සේ විසින් අව්‍යාකෘත කරුණකි.\"\n\n\"ඇවැත්නි, තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටින්නේ ද, වැඩ නොසිටින්නේ ද?\"\n\n\"ඇවැත්නි, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩසිටින්නේ ද, වැඩ නොසිටින්නේ ද' යනු ද භාග්‍යවතුන් වහන්සේ විසින් අව්‍යාකෘත කරුණකි.\"\n\n\"ඇවැත්නි, තථාගතයන් වහන්සේ මරණින් පසු වැඩ නොසිටින්නේ ද නොවේ, නොනොසිටින්නේ ද නොවේ?\"\n\n\"ඇවැත්නි, 'තථාගතයන් වහන්සේ මරණින් පසු වැඩ නොසිටින්නේ ද නොවේ, නොනොසිටින්නේ ද නොවේ' යනු ද භාග්‍යවතුන් වහන්සේ විසින් අව්‍යාකෘත කරුණකි.\"\n\n\"ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් මේවා අව්‍යාකෘත කරුණු ලෙස දේශනා කරනු ලැබුවේ කුමක් නිසා ද?\"\n\n\"ඇවැත්නි, මේවා අර්ථයෙන් යුක්ත නොවේ. මේවා ආදි බ්‍රහ්මචර්යාවට අයත් නොවේ. මේවා කලකිරීම පිණිස ද, නොඇල්ම පිණිස ද, කෙලෙස් නිරෝධය පිණිස ද, සන්සිඳීම පිණිස ද, විශේෂ ඥානය පිණිස ද, අවබෝධය පිණිස ද, නිවන පිණිස ද හේතු නොවේ. එබැවින් භාග්‍යවතුන් වහන්සේ ඒවා අව්‍යාකෘත කරුණු ලෙස දේශනා කළහ.\"\n\n\"එසේනම් ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දේ කුමක් ද?\"\n\n\"ඇවැත්නි, 'මෙය දුක ය' යනු භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දකි. 'මේ දුකෙහි හටගැනීම ය' යනු භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දකි. 'මේ දුකෙහි නිරෝධය ය' යනු භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දකි. 'මේ දුක නැති කිරීමට පමුණුවන ප්‍රතිපදාව ය' යනු භාග්‍යවතුන් වහන්සේ විසින් ප්‍රකාශ කරන ලද්දකි.\"\n\n\"ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් මේවා ප්‍රකාශ කරන ලද්දේ කුමක් නිසා ද?\"\n\n\"ඇවැත්නි, මේවා අර්ථයෙන් යුක්ත ය. මේවා ආදි බ්‍රහ්මචර්යාවට අයත් ය. මේවා කලකිරීම පිණිස ද, නොඇල්ම පිණිස ද, කෙලෙස් නිරෝධය පිණිස ද, සන්සිඳීම පිණිස ද, විශේෂ ඥානය පිණිස ද, අවබෝධය පිණිස ද, නිවන පිණිස ද හේතු වේ. එබැවින් භාග්‍යවතුන් වහන්සේ ඒවා ප්‍රකාශ කළහ.\"",
      "paliTitle": "Paraṃmaraṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Beyond Death Sutta",
      "sinhalaTitle": "පරම්මරණ සූත්‍රය"
    },
    {
      "number": 156,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā mahākassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākassapo bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena pubbe appatarāni ceva sikkhāpadāni ahesuṃ bahutarā ca bhikkhū aññāya saṇṭhahiṃsu? Ko pana, bhante, hetu ko paccayo, yenetarahi bahutarāni ceva sikkhāpadāni appatarā ca bhikkhū aññāya saṇṭhahantī’’ti? ‘‘Evañcetaṃ, kassapa, hoti sattesu hāyamānesu saddhamme antaradhāyamāne, bahutarāni ceva sikkhāpadāni honti appatarā ca bhikkhū aññāya saṇṭhahanti. Na tāva, kassapa, saddhammassa antaradhānaṃ hoti yāva na saddhammappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, saddhammappatirūpakaṃ loke uppajjati, atha saddhammassa antaradhānaṃ hoti’’. ‘‘Seyyathāpi, kassapa, na tāva jātarūpassa antaradhānaṃ hoti yāva na jātarūpappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, jātarūpappatirūpakaṃ loke uppajjati, atha jātarūpassa antaradhānaṃ hoti. Evameva kho, kassapa, na tāva saddhammassa antaradhānaṃ hoti yāva na saddhammappatirūpakaṃ loke uppajjati. Yato ca kho, kassapa, saddhammappatirūpakaṃ loke uppajjati, atha saddhammassa antaradhānaṃ hoti. ‘‘Na kho, kassapa, pathavīdhātu saddhammaṃ antaradhāpeti, na āpodhātu saddhammaṃ antaradhāpeti, na tejodhātu saddhammaṃ antaradhāpeti, na vāyodhātu saddhammaṃ antaradhāpeti; atha kho idheva te uppajjanti moghapurisā ye imaṃ saddhammaṃ antaradhāpenti. Seyyathāpi, kassapa, nāvā ādikeneva opilavati; na kho, kassapa, evaṃ saddhammassa antaradhānaṃ hoti. ‘‘Pañca khome, kassapa, okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari agāravā viharanti appatissā, dhamme agāravā viharanti appatissā, saṅghe agāravā viharanti appatissā, sikkhāya agāravā viharanti appatissā, samādhismiṃ agāravā viharanti appatissā – ime kho, kassapa, pañca okkamaniyā dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. ‘‘Pañca khome, kassapa, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame pañca? Idha, kassapa, bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari sagāravā viharanti sappatissā, dhamme sagāravā viharanti sappatissā, saṅghe sagāravā viharanti sappatissā, sikkhāya sagāravā viharanti sappatissā, samādhismiṃ sagāravā viharanti sappatissā – ime kho, kassapa, pañca dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. Terasamaṃ. ",
      "english": "Thus have I heard: At one time the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park.\n\nThen, the venerable Mahākassapa approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the venerable Mahākassapa said to the Blessed One: \"Venerable Sir, what is the reason, what is the cause, that in the past there were fewer training rules and more bhikkhus attained profound knowledge and became established? And what, Venerable Sir, is the reason, what is the cause, that now there are more training rules and fewer bhikkhus attain profound knowledge and become established?\"\n\n\"It is indeed so, Kassapa, when beings decline and the Good Dhamma fades away, there are more training rules and fewer bhikkhus attain profound knowledge and become established. Kassapa, the fading away of the Good Dhamma does not occur until a counterfeit of the Good Dhamma arises in the world. But when a counterfeit of the Good Dhamma arises in the world, then the Good Dhamma fades away.\n\n\"Just as, Kassapa, genuine gold does not disappear until a counterfeit of genuine gold arises in the world. But when a counterfeit of genuine gold arises in the world, then genuine gold disappears. In the same way, Kassapa, the Good Dhamma does not fade away until a counterfeit of the Good Dhamma arises in the world. But when a counterfeit of the Good Dhamma arises in the world, then the Good Dhamma fades away.\n\n\"Indeed, Kassapa, it is not the earth element that makes the Good Dhamma fade away, nor the water element that makes the Good Dhamma fade away, nor the fire element that makes the Good Dhamma fade away, nor the air element that makes the Good Dhamma fade away; rather, it is these misguided individuals who arise right here that make this Good Dhamma fade away. Just as, Kassapa, a ship sinks by means of its own inner fault; it is not in this manner, Kassapa, that the Good Dhamma fades away.\n\n\"These five destructive factors, Kassapa, lead to the confusion and disappearance of the Good Dhamma. Which five? Here, Kassapa, bhikkhus, bhikkhunis, male lay followers, and female lay followers dwell without respect and reverence for the Teacher; without respect and reverence for the Dhamma; without respect and reverence for the Saṅgha; without respect and reverence for the training; without respect and reverence for concentration. These five destructive factors, Kassapa, lead to the confusion and disappearance of the Good Dhamma.\n\n\"These five factors, Kassapa, lead to the establishment, non-confusion, and non-disappearance of the Good Dhamma. Which five? Here, Kassapa, bhikkhus, bhikkhunis, male lay followers, and female lay followers dwell with respect and reverence for the Teacher; with respect and reverence for the Dhamma; with respect and reverence for the Saṅgha; with respect and reverence for the training; with respect and reverence for concentration. These five factors, Kassapa, lead to the establishment, non-confusion, and non-disappearance of the Good Dhamma.\"",
      "sinhala": "එසේ මා විසින් අසන ලදී – එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. ඉක්බිති ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, කුමක් හෙයින්, කුමන කරුණක් නිසා පෙර ශික්ෂාපද අඩුවෙන් පැවති කල්හි භික්ෂූහු බොහෝ දෙනා අවබෝධය පිණිස පිහිටියාහුද? ස්වාමීනි, කුමක් හෙයින්, කුමන කරුණක් නිසා දැන් ශික්ෂාපද බොහෝ වී ඇති කල්හි භික්ෂූහු අඩුවෙන් අවබෝධය පිණිස පිහිටත්ද?” “කාශ්‍යපය, සත්ත්වයින් පිරිහෙන කල්හි, සද්ධර්මය අතුරුදන් වන කල්හි මෙසේ සිදුවේ. එවිට ශික්ෂාපද වැඩිවේ, අවබෝධය පිණිස පිහිටන භික්ෂූහුද අඩු වෙති. කාශ්‍යපය, ලොව සද්ධර්ම ප්‍රතිරූපකයක් (සද්ධර්මයට සමාන වූ මිථ්‍යා ධර්මයක්) පහළ වන තෙක් සද්ධර්මය අතුරුදන් නොවේ. කාශ්‍යපය, යම් කලක ලොව සද්ධර්ම ප්‍රතිරූපකයක් පහළ වේද, එවිට සද්ධර්මය අතුරුදන් වීම සිදුවේ.”\n\n“කාශ්‍යපය, යම්සේ ලොව රත්‍රන් ප්‍රතිරූපකයක් (රත්‍රන්ට සමාන වූ ව්‍යාජ රත්‍රන්) පහළ වන තෙක් සත්‍ය රත්‍රන් අතුරුදන් නොවේද, කාශ්‍යපය, යම් කලක ලොව රත්‍රන් ප්‍රතිරූපකයක් පහළ වේද, එවිට සත්‍ය රත්‍රන් අතුරුදන් වීම සිදුවේ. එලෙසින්ම කාශ්‍යපය, ලොව සද්ධර්ම ප්‍රතිරූපකයක් පහළ වන තෙක් සද්ධර්මය අතුරුදන් නොවේ. කාශ්‍යපය, යම් කලක ලොව සද්ධර්ම ප්‍රතිරූපකයක් පහළ වේද, එවිට සද්ධර්මය අතුරුදන් වීම සිදුවේ.\n\n“කාශ්‍යපය, පඨවි ධාතුව සද්ධර්මය අතුරුදන් නොකරයි. ආපෝ ධාතුව සද්ධර්මය අතුරුදන් නොකරයි. තේජෝ ධාතුව සද්ධර්මය අතුරුදන් නොකරයි. වායෝ ධාතුව සද්ධර්මය අතුරුදන් නොකරයි. එහෙත්, මෙලොවම සද්ධර්මය අතුරුදන් කරවන ඒ මොඝ පුරුෂයෝ පහළ වෙති. කාශ්‍යපය, යම්සේ නැවක් තමන්ගේම (අභ්‍යන්තර) ජලයෙන් ගිලී යන්නේද, එලෙසින්ම කාශ්‍යපය, සද්ධර්මයද (මේ මොඝ පුරුෂයන් විසින්) අතුරුදන් කරවයි.\n\n“කාශ්‍යපය, සද්ධර්මය අවුල් වී අතුරුදන් වීම පිණිස පවතින මෙම කරුණු පහක් ඇත. ඒ කවර පසක්ද? කාශ්‍යපය, මෙහිලා භික්ෂූහු, භික්ෂුණීහු, උපාසකවරු, උපාසිකාවෝ ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව රහිතව, අප්‍රතිශ්‍රීකව වාසය කරති; ධර්මය කෙරෙහි ගෞරව රහිතව, අප්‍රතිශ්‍රීකව වාසය කරති; සංඝයා කෙරෙහි ගෞරව රහිතව, අප්‍රතිශ්‍රීකව වාසය කරති; ශික්ෂාව (විනය) කෙරෙහි ගෞරව රහිතව, අප්‍රතිශ්‍රීකව වාසය කරති; සමාධිය කෙරෙහි ගෞරව රහිතව, අප්‍රතිශ්‍රීකව වාසය කරති. කාශ්‍යපය, සද්ධර්මය අවුල් වී අතුරුදන් වීම පිණිස පවතින මේ කරුණු පස වේ.\n\n“කාශ්‍යපය, සද්ධර්මයේ පැවැත්ම, අවුල් නොවීම සහ අතුරුදන් නොවීම පිණිස පවතින මෙම කරුණු පහක් ඇත. ඒ කවර පසක්ද? කාශ්‍යපය, මෙහිලා භික්ෂූහු, භික්ෂුණීහු, උපාසකවරු, උපාසිකාවෝ ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරව සහිතව, ප්‍රතිශ්‍රීකව වාසය කරති; ධර්මය කෙරෙහි ගෞරව සහිතව, ප්‍රතිශ්‍රීකව වාසය කරති; සංඝයා කෙරෙහි ගෞරව සහිතව, ප්‍රතිශ්‍රීකව වාසය කරති; ශික්ෂාව (විනය) කෙරෙහි ගෞරව සහිතව, ප්‍රතිශ්‍රීකව වාසය කරති; සමාධිය කෙරෙහි ගෞරව සහිතව, ප්‍රතිශ්‍රීකව වාසය කරති. කාශ්‍යපය, සද්ධර්මයේ පැවැත්ම, අවුල් නොවීම සහ අතුරුදන් නොවීම පිණිස පවතින මේ කරුණු පස වේ.”",
      "paliTitle": "Saddhammappatirūpakasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Counterfeit True Dhamma",
      "sinhalaTitle": "සද්ධම්මප්පතිරූපක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Kassapasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Santuṭṭhañca anottappī, candūpamaṃ kulūpakaṃ; Jiṇṇaṃ tayo ca ovādā, jhānābhiññā upassayaṃ; Cīvaraṃ paraṃmaraṇaṃ, saddhammappatirūpakanti.",
    "english": "The Linked Discourses with Kassapa is complete. The summary of it: Contentment and Lack of Shame, Simile of the Moon, Visiting Families; The Old Monk, three on Admonition, Absorptions and Higher Knowledge, The Nunnery; Robes, Beyond Death, and the Counterfeit of the True Dhamma.",
    "sinhala": "කස්සප සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: සන්තුට්ඨ, අනොත්තප්පී, චන්දූපම, කුලූපක, ජිණ්ණ, ඕවාද තුනක්, ජ්ඣානාභිඤ්ඤා, උපස්සය, චීවර, පරම්මරණ සහ සද්ධම්මප්පතිරූපක සූත්‍රයි."
  }
}