{
  "id": "sn.2.2",
  "title": {
    "pali": "Abhisamayasaṃyuttaṃ",
    "english": "The Connected Discourses on Direct Realization",
    "sinhala": "අභිසමය සංයුත්තය"
  },
  "sections": [
    {
      "number": 74,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavā parittaṃ nakhasikhāyaṃ paṃsuṃ āropetvā bhikkhū āmantesi – ‘‘taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yo vāyaṃ [yo cāyaṃ (sabbattha) dutiyasuttādīsu pana vāsaddoyeva dissati] mayā paritto nakhasikhāyaṃ paṃsu āropito, ayaṃ vā mahāpathavī’’ti? ‘‘Etadeva, bhante, bahutaraṃ, yadidaṃ mahāpathavī. Appamattako bhagavatā paritto nakhasikhāyaṃ paṃsu āropito. Neva satimaṃ kalaṃ upeti na sahassimaṃ kalaṃ upeti na satasahassimaṃ kalaṃ upeti mahāpathaviṃ upanidhāya bhagavatā paritto nakhasikhāyaṃ paṃsu āropito’’ti. ‘‘Evameva kho, bhikkhave, ariyasāvakassa diṭṭhisampannassa puggalassa abhisametāvino etadeva bahutaraṃ dukkhaṃ yadidaṃ parikkhīṇaṃ pariyādiṇṇaṃ; appamattakaṃ avasiṭṭhaṃ. Neva satimaṃ kalaṃ upeti na sahassimaṃ kalaṃ upeti na satasahassimaṃ kalaṃ upeti purimaṃ dukkhakkhandhaṃ parikkhīṇaṃ pariyādiṇṇaṃ upanidhāya yadidaṃ sattakkhattuṃparamatā. Evaṃ mahatthiyo kho, bhikkhave, dhammābhisamayo; evaṃ mahatthiyo dhammacakkhupaṭilābho’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. Then the Blessed One, having taken a tiny bit of dust on his fingertip, addressed the monks: \"What do you think, monks, which is greater: this tiny bit of dust that I have taken on my fingertip, or this great earth?\"\n\n\"This great earth, Venerable Sir, is indeed greater. The tiny bit of dust taken by the Blessed One on his fingertip is negligible. It does not come to a hundredth part, nor to a thousandth part, nor to a hundred-thousandth part when compared to the great earth.\"\n\n\"Even so, monks, for a noble disciple endowed with right view, who has comprehended the truth, the greater amount of suffering is that which has been exhausted and ended; only a small amount remains. It does not come to a hundredth part, nor to a thousandth part, nor to a hundred-thousandth part when compared to the former mass of suffering that has been exhausted and ended, which is at most seven more existences. Of such great benefit, monks, is the comprehension of the Dhamma; of such great benefit is the acquisition of the Dhamma-eye.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඑවිට භාග්‍යවතුන් වහන්සේ සිය නියපොතු අග ස්වල්ප මාත්‍ර වූ පස් ටිකක් තබාගෙන මහණෙනි, අමතා වදාළ සේක: ‘‘මහණෙනි, තෙපි මේ කුමක් සිතන්නහු ද? මා විසින් නියපොතු අග තබන ලද මේ ස්වල්ප මාත්‍ර වූ පස් ටික ද, නැතහොත් මේ මහපොළොව ද? මේ දෙකින් වඩා වැඩි දෙය කුමක් ද?’’\n\n‘‘වහන්ස, මේ මහපොළොව ම ය වඩාත් වැඩිය. භාග්‍යවතුන් වහන්සේ විසින් නියපොතු අග තබන ලද පස් ටික ඉතා අල්පය. මහපොළොවට සාපේක්ෂව භාග්‍යවතුන් වහන්සේ විසින් නියපොතු අග තබන ලද මේ පස් ටික සියයෙන් පංගුවට ද, දහසෙන් පංගුවට ද, සිය දහසෙන් පංගුවට ද නොපැමිණේ.’’ ‘‘මහණෙනි, එපරිද්දෙන්ම දිට්ඨිසම්පන්න වූ, ධර්මය අවබෝධ කළ ආර්ය ශ්‍රාවක පුද්ගලයා හට අවසන් වූ, නැති වී ගිය, මෙතෙක් කල් විඳි දුක ම ය වඩාත් වැඩිය; ඉතිරිව ඇති දුක ඉතා අල්පය. අවසන් වූ, නැති වී ගිය පෙර දුක් සමූහයට සාපේක්ෂව මේ සත් භවයකට උපරිම වූ ඉතිරිව ඇති දුක සියයෙන් පංගුවට ද, දහසෙන් පංගුවට ද, සිය දහසෙන් පංගුවට ද නොපැමිණේ. මහණෙනි, ධර්මාවබෝධය එතරම් මහානිසංස ඇත්තකි; ධර්ම චක්‍‍ෂුස ලැබීම එතරම් මහානිසංස ඇත්තකි.’’",
      "paliTitle": "Nakhasikhāsuttaṃ",
      "vagga": ""
    },
    {
      "number": 75,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, pokkharaṇī paññāsayojanāni āyāmena paññāsayojanāni vitthārena paññāsayojanāni ubbedhena, puṇṇā udakassa samatittikā kākapeyyā. Tato puriso kusaggena udakaṃ uddhareyya. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā kusaggena udakaṃ ubbhataṃ yaṃ vā pokkharaṇiyā udaka’’nti? ‘‘Etadeva, bhante, bahutaraṃ, yadidaṃ pokkharaṇiyā udakaṃ. Appamattakaṃ kusaggena udakaṃ ubbhataṃ. Neva satimaṃ kalaṃ upeti na sahassimaṃ kalaṃ upeti na satasahassimaṃ kalaṃ upeti pokkharaṇiyā udakaṃ upanidhāya kusaggena udakaṃ ubbhata’’nti. ‘‘Evameva kho, bhikkhave, ariyasāvakassa diṭṭhisampannassa puggalassa abhisametāvino etadeva bahutaraṃ dukkhaṃ yadidaṃ parikkhīṇaṃ pariyādiṇṇaṃ; appamattakaṃ avasiṭṭhaṃ. Neva satimaṃ kalaṃ upeti na sahassimaṃ kalaṃ upeti na satasahassimaṃ kalaṃ upeti purimaṃ dukkhakkhandhaṃ parikkhīṇaṃ pariyādiṇṇaṃ upanidhāya, yadidaṃ sattakkhattuṃparamatā. Evaṃ mahatthiyo kho, bhikkhave, dhammābhisamayo; evaṃ mahatthiyo dhammacakkhupaṭilābho’’ti. Dutiyaṃ.",
      "english": "Monks, just as there might be a pond, fifty leagues long, fifty leagues wide, and fifty leagues deep, full of water up to the brim, enough for a crow to drink from. From that, a man might draw out water with the tip of a blade of kusa grass. What do you think, Monks, which is greater: the water drawn out with the tip of the kusa grass, or the water in the pond?\n\nVenerable Sir, it is the water in the pond that is greater. The water drawn out with the tip of the kusa grass is very little. Compared to the water in the pond, the water drawn out with the tip of the kusa grass does not amount to a hundredth part, nor a thousandth part, nor a hundred thousandth part.\n\nJust so, Monks, for a noble disciple, a person endowed with right view, who has realized the Dhamma, the greater suffering is that which has been extinguished, completely exhausted; what remains is very little. Compared to the former mass of suffering that has been extinguished and completely exhausted, what remains does not amount to a hundredth part, nor a thousandth part, nor a hundred thousandth part, that which is limited to seven more rebirths. Such is the great significance, Monks, of the comprehension of the Dhamma; such is the great significance of the attainment of the Eye of Dhamma.",
      "sinhala": "මහණෙනි, යම් සේ යොදුන් පනසක් දිගින්, යොදුන් පනසක් පළලින්, යොදුන් පනසක් ගැඹුරින් යුක්ත වූ පොකුණක් ජලයෙන් පිරී, ගහන වූ, කපුටන්ට පවා බීමට සුදුසු (ජල මට්ටමක් ඇති) වූයේ ද, එයින් පුරුෂයෙක් කුස තණ අගින් ජලය උදුරා ගන්නේ නම්, මහණෙනි, ඒ කුමක් සිතන්නහු ද? කුස තණ අගින් උදුරාගත් ජලය ද, නැතිනම් පොකුණේ ජලය ද, මේ දෙකෙන් කවරක් ද වැඩි?\n\n\"වහන්ස, පොකුණේ ජලය ම බොහෝ ය. කුස තණ අගින් උදුරාගත් ජලය ඉතා ස්වල්පයකි. පොකුණේ ජලය හා සසඳන කල, කුස තණ අගින් උදුරාගත් ජලය සියයෙන් කොටසකට ද, දහසින් කොටසකට ද, ලක්ෂයෙන් කොටසකට ද නොපැමිණේ.\"\n\n\"මහණෙනි, එපරිද්දෙන් ම, දෘෂ්ටි සම්පන්න වූ, ධර්මය අවබෝධ කළ ආර්ය ශ්‍රාවක පුද්ගලයාට, පරික්ෂය වී අවසන් වූ, ක්ෂය වී ගිය දුක ම බොහෝ ය; ඉතිරිව ඇත්තේ ඉතා ස්වල්පයකි. පරික්ෂය වී අවසන් වූ, ක්ෂය වී ගිය පෙර දුක්ඛස්කන්ධය හා සසඳන කල, උපරිම සත්වතාවක් දක්වා සීමා වන ඉතිරි දුක, සියයෙන් කොටසකට ද, දහසින් කොටසකට ද, ලක්ෂයෙන් කොටසකට ද නොපැමිණේ. මහණෙනි, ධර්මය අවබෝධ කිරීම මෙතරම් මහානුභාව සම්පන්න ය; ධර්ම චක්ෂුස ලැබීම මෙතරම් මහානුභාව සම්පන්න ය.\"",
      "paliTitle": "Pokkharaṇīsuttaṃ",
      "vagga": ""
    },
    {
      "number": 76,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, yatthimā mahānadiyo saṃsandanti samenti, seyyathidaṃ – gaṅgā yamunā aciravatī sarabhū mahī, tato puriso dve vā tīṇi vā udakaphusitāni uddhareyya. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yāni vā dve vā tīṇi vā udakaphusitāni ubbhatāni yaṃ vā sambhejjaudaka’’nti? ‘‘Etadeva, bhante, bahutaraṃ yadidaṃ sambhejjaudakaṃ; appamattakāni dve vā tīṇi vā udakaphusitāni ubbhatāni. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti sambhejjaudakaṃ upanidhāya dve vā tīṇi vā udakaphusitāni ubbhatānī’’ti. ‘‘Evameva kho, bhikkhave…pe… dhammacakkhupaṭilābho’’ti. Tatiyaṃ.",
      "english": "He was dwelling in Sāvatthī. ... Just as, monks, where these great rivers converge and meet—namely, the Gaṅgā, the Yamunā, the Aciravatī, the Sarabhū, and the Mahī—a person might draw out two or three drops of water from there.\n\nWhat do you think, monks, which is greater: those two or three drops of water that have been drawn out, or the water of the confluence?\n\n\"That, Venerable Sir, is much greater: the water of the confluence. The two or three drops of water drawn out are insignificant. They do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part, when compared to the water of the confluence.\"\n\n\"Even so, monks, ... the acquisition of the Dhamma-eye.\" This is the third.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩසිටිනා සේක.\n\nමහණෙනි, යම් තැනක මේ මහා නදීන් වන ගංගා, යමුනා, අචිරවතී, සරභූ, මහී යන ගංගාවෝ එක්වෙත් ද, එතැනින් පුරුෂයෙක් දිය බිඳු දෙකක් හෝ තුනක් ගන්නේ යැයි සිතමු.\n\nමහණෙනි, ඒ කුමක් සිතව් ද? අර ගත් දිය බිඳු දෙක තුන ද, නැතහොත් ඒ එක්තැන් වූ ජලය ද, කවරක් ද බහුතර වන්නේ?\n\nවහන්ස, ඒ එක්තැන් වූ ජලය ම බහුතර ය. අර ගත් දිය බිඳු දෙක තුන ඉතා ස්වල්පය. එක්තැන් වූ ජලය හා සසඳන කල, අර ගත් දිය බිඳු දෙක තුන සියයකට ද, දහසකට ද, සියදහසකට ද කොටසක් නොවේ.\n\nමහණෙනි, එලෙසින් ම යම් පුද්ගලයකුට ධර්මචක්ෂුෂය ලැබුණේ ද, ඔහුට විඳින්නට ඇති දුක් ප්‍රමාණය ඉතා අල්ප ය. ධර්මචක්ෂුෂය නොලැබූ අවස්ථාවේ විඳි දුක් ප්‍රමාණය බොහෝ ය.",
      "paliTitle": "Sambhejjaudakasuttaṃ",
      "vagga": ""
    },
    {
      "number": 77,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, yatthimā mahānadiyo saṃsandanti samenti, seyyathidaṃ – gaṅgā yamunā aciravatī sarabhū mahī, taṃ udakaṃ parikkhayaṃ pariyādānaṃ gaccheyya ṭhapetvā dve vā tīṇi vā udakaphusitāni. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā sambhejjaudakaṃ parikkhīṇaṃ pariyādiṇṇaṃ yāni vā dve vā tīṇi vā udakaphusitāni avasiṭṭhānī’’ti? ‘‘Etadeva, bhante, bahutaraṃ sambhejjaudakaṃ yadidaṃ parikkhīṇaṃ pariyādiṇṇaṃ; appamattakāni dve vā tīṇi vā udakaphusitāni avasiṭṭhāni. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti sambhejjaudakaṃ parikkhīṇaṃ pariyādiṇṇaṃ upanidhāya dve vā tīṇi vā udakaphusitāni avasiṭṭhānī’’ti. ‘‘Evameva kho, bhikkhave…pe… dhammacakkhupaṭilābho’’ti. Catutthaṃ.",
      "english": "At Sāvatthī. The Blessed One said this:\n\n\"Just as, monks, where these great rivers – the Gaṅgā, Yamunā, Aciravatī, Sarabhū, and Mahī – flow together and merge, their combined waters might diminish and be exhausted, leaving aside only two or three drops of water. What do you think, monks, which is more: the diminished and exhausted water of the confluence, or the two or three remaining drops of water?\"\n\n\"Venerable Sir, the diminished and exhausted water of the confluence is indeed much more. The two or three remaining drops of water are insignificant. They do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part when compared to the diminished and exhausted water of the confluence.\"\n\n\"Even so, monks, for a noble disciple who has attained the Dharma-eye—who has seen the Dhamma, realized the Dhamma, understood the Dhamma, penetrated the Dhamma, overcome doubt, dispelled uncertainty, gained perfect confidence, and become independent of others in the Teacher’s Dispensation—the suffering that has been diminished and exhausted is far greater than the suffering that remains. The remaining suffering does not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part when compared to the suffering that has been diminished and exhausted. This is the profound outcome of gaining the Dharma-eye.\"",
      "sinhala": "මහණෙනි, යම්සේ මේ මහා ගංගාවන් එකට ගලයි, එක් රැස් වේද, එනම් – ගංගා, යමුනා, අචිරවතී, සරභූ, මහි යන මේවාය; ඒ ජලය ක්ෂය වී, අවසන් වී යයිද, දෙකක් හෝ තුනක් හෝ දිය බිංදු හැර. මහණෙනි, ඔබලා මේ කුමක් සිතන්නහුද? වඩා බොහෝ වන්නේ කුමක්ද? ඒ ක්ෂය වී, අවසන් වී ගිය එක් වූ ජලයද, නැතහොත් ඉතිරි වී ඇති දෙකක් හෝ තුනක් හෝ දිය බිංදුද?\n\nවහන්ස, ක්ෂය වී, අවසන් වී ගිය ඒ එක් වූ ජලයම බොහෝය; ඉතිරි වී ඇති දෙකක් හෝ තුනක් හෝ දිය බිංදු ස්වල්පයකි. ක්ෂය වී, අවසන් වී ගිය ඒ එක් වූ ජලය හා සසඳන කල ඉතිරි වී ඇති දෙකක් හෝ තුනක් හෝ දිය බිංදු සියයෙන් කොටසකටවත් නොපැමිණේ, දහසෙන් කොටසකටවත් නොපැමිණේ, ලක්ෂයෙන් කොටසකටවත් නොපැමිණේ.\n\nමහණෙනි, එපරිද්දෙන්ම, ආර්ය ශ්‍රාවකයා හට, දැක්මෙන් පරිපූර්ණ වූ, සෝවාන් වූ, නිරයට නොවැටෙන සුළු ස්වභාව ඇති, නියත වූ, සම්බෝධිය පරම කොට ඇති, යම් දුකක් ක්ෂය වී, අවසන් වී ගියේද, ඒ දුක බොහෝය; යම් දුකක් ඉතිරි වී ඇත්ද, ඒ දුක ස්වල්පයකි. පෙරදී අත්විඳින ලද දුක්ඛස්කන්ධය හා සසඳන කල, එය සියයෙන් කොටසකටවත්, දහසෙන් කොටසකටවත්, ලක්ෂයෙන් කොටසකටවත් නොපැමිණේ. මහණෙනි, ධර්ම චක්ෂුස ලැබීමේ ප්‍රයෝජනය මෙයයි.\n\nසතරවෙනි සූත්‍රයයි.",
      "paliTitle": "Dutiyasambhejjaudakasuttaṃ",
      "vagga": ""
    },
    {
      "number": 78,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, puriso mahāpathaviyā satta kolaṭṭhimattiyo guḷikā upanikkhipeyya. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yā vā satta kolaṭṭhimattiyo guḷikā upanikkhittā ayaṃ [yā (syā. ka.)] vā mahāpathavī’’ti? ‘‘Etadeva, bhante, bahutaraṃ, yadidaṃ mahāpathavī; appamattikā satta kolaṭṭhimattiyo guḷikā upanikkhittā. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti mahāpathaviṃ upanidhāya satta kolaṭṭhimattiyo guḷikā upanikkhittā’’ti. ‘‘Evameva kho, bhikkhave… pe… dhammacakkhupaṭilābho’’ti. Pañcamaṃ.",
      "english": "The Blessed One was staying at Sāvatthī. There he addressed the monks:\n\n\"Monks, suppose a man were to place seven jujube-seed-sized pellets on the great earth. What do you think, monks, which is greater: the seven jujube-seed-sized pellets that have been placed, or this great earth?\"\n\n\"Venerable Sir, this great earth is far greater; the seven jujube-seed-sized pellets that have been placed are insignificant. Compared to the great earth, those seven jujube-seed-sized pellets that have been placed do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part.\"\n\n\"Just so, monks, for a noble disciple who has attained the Eye of Dhamma, the suffering that has been entirely eliminated is far greater, while the suffering that remains is insignificant. Compared to the suffering that has been eliminated, the remaining suffering does not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත්නුවර වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක:\n\n\"මහණෙනි, යම් සේ පුරුෂයෙක් මහාපෘථිවියෙහි කොළ ඇට සතක් පමණ කුඩා ගුළි තබන්නේද, මහණෙනි, ඔබලා මේ ගැන කුමක් සිතන්නාහුද? තබන ලද ඒ කොළ ඇට සතක් පමණ කුඩා ගුළි හෝ මේ මහාපෘථිවිය හෝ යන මේ දෙකින් වැඩිය කුමක්ද?\"\n\n\"ස්වාමීනි, මහාපෘථිවියම වැඩිය. තබන ලද කොළ ඇට සතක් පමණ කුඩා ගුළි ඉතා අල්පය. මහාපෘථිවියට සාපේක්ෂව තබන ලද කොළ ඇට සතක් පමණ කුඩා ගුළි සියයෙන් එකකටවත්, දහසෙන් එකකටවත්, ලක්ෂයෙන් එකකටවත් සම නොවේ.\"\n\n\"මහණෙනි, එපරිද්දෙන්ම, (සංසාරයේ මෙතෙක් අත්විඳි අප්‍රමාණ දුකට සාපේක්ෂව) ධර්ම චක්ෂුස (සෝවාන් මාර්ග ඥානය) ලැබීමෙන් සසරේ ඉතිරිව ඇත්තේ ඉතා සුළු දුක් ප්‍රමාණයකි. පෙර අත්විඳි දුකට සාපේක්ෂව, ධර්ම චක්ෂුස ලැබීමෙන්, සසරේ ඉතිරිව ඇත්තේ සියයෙන් එකකටවත්, දහසෙන් එකකටවත්, ලක්ෂයෙන් එකකටවත් සම නොවන (අතිශයින්ම අල්ප) දුක් ප්‍රමාණයකි.\"\n\nපස්වැනි සූත්‍රයයි.",
      "paliTitle": "Pathavīsuttaṃ",
      "vagga": ""
    },
    {
      "number": 79,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, mahāpathavī parikkhayaṃ pariyādānaṃ gaccheyya, ṭhapetvā satta kolaṭṭhimattiyo guḷikā. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā mahāpathaviyā parikkhīṇaṃ pariyādiṇṇaṃ yā vā satta kolaṭṭhimattiyo guḷikā avasiṭṭhā’’ti? ‘‘Etadeva bhante, bahutaraṃ, mahāpathaviyā, yadidaṃ parikkhīṇaṃ pariyādiṇṇaṃ; appamattikā satta kolaṭṭhimattiyo guḷikā avasiṭṭhā. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti mahāpathaviyā parikkhīṇaṃ pariyādiṇṇaṃ upanidhāya satta kolaṭṭhimattiyo guḷikā avasiṭṭhā’’ti. ‘‘Evameva kho, bhikkhave…pe… dhammacakkhupaṭilābho’’ti. Chaṭṭhaṃ.",
      "english": "He was dwelling at Savatthi. Just as, monks, the great earth might be entirely exhausted, completely consumed, except for seven pea-sized pellets. What do you think, monks, which is greater: that which has been exhausted and completely consumed from the great earth, or these seven pea-sized pellets that remain? 'Venerable sir, that which has been exhausted and completely consumed from the great earth is much greater; insignificant are these seven pea-sized pellets that remain. The remaining seven pea-sized pellets do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part, when compared to that which has been exhausted and completely consumed from the great earth.' In the same way, monks, for a noble disciple who has attained the Dhamma-eye, the suffering that has been entirely brought to an end is much more than the suffering that remains. Compared to the suffering that has been brought to an end, the suffering that remains is insignificant, like these seven pea-sized pellets.",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක.\nභික්ෂූණි, යම් සේ මහපොළොව ක්ෂය වී, අවසන් වී යන්නේ නම්, කොළොත් ඇට ප්‍රමාණයේ ගුලිකා හතක් පමණක් ඉතිරි වී. භික්ෂූණි, ඔබ මේ කුමක් සිතන්නෙහි ද? මහපොළොවෙන් ක්ෂය වී, අවසන් වී ගිය දෙය ද, නැතිනම් ඉතිරි වී ඇති කොළොත් ඇට ප්‍රමාණයේ ගුලිකා හත ද, මේ දෙකෙන් වඩා වැඩිය කුමක් ද?\n\nවහන්ස, මහපොළොවෙන් ක්ෂය වී, අවසන් වී ගිය දෙය ම වඩා වැඩිය. ඉතිරි වී ඇති කොළොත් ඇට ප්‍රමාණයේ ගුලිකා හත ඉතා ස්වල්පයකි. මහපොළොවෙන් ක්ෂය වී, අවසන් වී ගිය දෙය හා සැසඳීමේ දී, ඉතිරි වී ඇති කොළොත් ඇට ප්‍රමාණයේ ගුලිකා හත සියයෙන් කොටසකටවත් නොපැමිණේ, දහසෙන් කොටසකටවත් නොපැමිණේ, ලක්ෂයෙන් කොටසකටවත් නොපැමිණේ.\n\nභික්ෂූණි, එලෙසින්ම, ධර්ම​චක්ෂුව (ධර්ම​ය අවබෝධ කරගැනීම) ලැබූ ආර්ය​ශ්‍රාවකයා​ගේ ක්ෂය වී අවසන් වූ දුක බොහෝ ය. ඉතිරි වී ඇති දුක ඉතා ස්වල්පයකි. මහපොළොවෙන් ක්ෂය වී අවසන් වූ දෙය හා සැසඳීමේ දී, ඉතිරි වූ කොළොත් ඇට ප්‍රමාණයේ ගුලිකා හත සියයෙන් කොටසකටවත් නොපැමිණෙන්නා සේම, ධර්ම​චක්ෂුව ලැබීමෙන් පසු ඉතිරි වී ඇති දුක ද (පෙර විඳි දුක හා සැසඳීමේ දී) සියයෙන් කොටසකටවත් නොපැමිණේ, දහසෙන් කොටසකටවත් නොපැමිණේ, ලක්ෂයෙන් කොටසකටවත් නොපැමිණේ.\nහයවෙනි සූත්‍රයයි.",
      "paliTitle": "Dutiyapathavīsuttaṃ",
      "vagga": ""
    },
    {
      "number": 80,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, puriso mahāsamuddato dve vā tīṇi vā udakaphusitāni uddhareyya. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yāni vā dve vā tīṇi vā udakaphusitāni ubbhatāni yaṃ vā mahāsamudde udaka’’nti? ‘‘Etadeva, bhante, bahutaraṃ, yadidaṃ mahāsamudde udakaṃ; appamattakāni dve vā tīṇi vā udakaphusitāni ubbhatāni. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti mahāsamudde udakaṃ upanidhāya dve vā tīṇi vā udakaphusitāni ubbhatānī’’ti. ‘‘Evameva kho, bhikkhave…pe… dhammacakkhupaṭilābho’’ti. Sattamaṃ.",
      "english": "Just as, monks, a man might draw up two or three drops of water from the great ocean. What do you think, monks? Which is greater: the two or three drops of water that have been drawn up, or the water in the great ocean? This, Venerable Sir, is much greater: the water in the great ocean; the two or three drops of water that have been drawn up are very little. Compared to the water in the great ocean, the two or three drops of water that have been drawn up do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part. Even so, monks, for a noble disciple who has attained the Dhamma-eye, the suffering that has been completely abandoned and overcome is much greater; the suffering that remains is very little. Compared to the suffering that has been completely abandoned and overcome, the suffering that remains does not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part.",
      "sinhala": "මහණෙනි, යම්සේ පුරුෂයෙක් මහා සාගරයෙන් ජල බිංදු දෙකක් හෝ තුනක් ගන්නේද, මහණෙනි, ඔබලා කුමක් සිතන්නෙහිද, වැඩි වන්නේ කුමක්ද; ගත් ජල බිංදු දෙක හෝ තුනද, නැතහොත් මහා සාගරයේ ඇති ජලයද?\n\nවහන්ස, වැඩි වන්නේ මහා සාගරයේ ඇති ජලයමය; ගත් ජල බිංදු දෙක හෝ තුන ඉතා ස්වල්පයකි. මහා සාගරයේ ජලයට සාපේක්ෂව ගත් කල, මේ ගත් ජල බිංදු දෙක හෝ තුන සියයෙන් කොටසකටවත්, දහසෙන් කොටසකටවත්, ලක්ෂයෙන් කොටසකටවත් නොපැමිණේ.\n\nඑලෙසින්ම, මහණෙනි, ධර්‍මචක්ෂුප්‍රතිලාභයද එබඳුය.",
      "paliTitle": "Samuddasuttaṃ",
      "vagga": ""
    },
    {
      "number": 81,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, mahāsamuddo parikkhayaṃ pariyādānaṃ gaccheyya, ṭhapetvā dve vā tīṇi vā udakaphusitāni. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā mahāsamudde udakaṃ parikkhīṇaṃ pariyādinnaṃ yāni vā dve vā tīṇi vā udakaphusitāni avasiṭṭhānī’’ti? ‘‘Etadeva, bhante, bahutaraṃ mahāsamudde udakaṃ, yadidaṃ parikkhīṇaṃ pariyādiṇṇaṃ; appamattakāni dve vā tīṇi vā udakaphusitāni avasiṭṭhāni. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti mahāsamudde udakaṃ parikkhīṇaṃ pariyādiṇṇaṃ upanidhāya dve vā tīṇi vā udakaphusitāni avasiṭṭhānī’’ti. ‘‘Evameva kho bhikkhave…pe… dhammacakkhupaṭilābho’’ti. Aṭṭhamaṃ.",
      "english": "He dwells at Savatthi. Then the Blessed One addressed the bhikkhus, saying: “Suppose, monks, that the great ocean were to be depleted and completely exhausted, leaving aside just two or three drops of water. What do you think, monks, which is greater: the water in the great ocean that has been depleted and exhausted, or the two or three drops of water that remain?”\n\n“Venerable sir, the water in the great ocean that has been depleted and exhausted is indeed much greater; the two or three drops of water that remain are insignificant. The two or three drops of water that remain do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part when compared to the water in the great ocean that has been depleted and exhausted.”\n\n“Just so, monks, the suffering that has been fully exhausted and entirely removed for one who has wandered and transmigrated through countless existences is much greater than the suffering that remains upon the attainment of the Dhamma-eye.”",
      "sinhala": "පින්වත් මහණෙනි, යම්සේ මහා සමුද්‍රයෙහි ජලය දෙතුන් දිය බිඳක් හැර ක්ෂය වී, අවසන් වී යයිද. පින්වත් මහණෙනි, ඒ කුමක් සිතන්නාහුද? මහා සමුද්‍රයෙහි ක්ෂය වී, අවසන් වූ ජලයද, නැතහොත් ඉතිරි වූ දෙතුන් දිය බිඳද? මේ දෙකින් කවරක්ද බහුල වන්නේ? වහන්ස, ක්ෂය වී, අවසන් වූ මහා සමුද්‍රයෙහි ජලයම බහුල වෙයි. ඉතිරි වූ දෙතුන් දිය බිඳ ඉතා අල්ප මාත්‍රයකි. ක්ෂය වී, අවසන් වූ මහා සමුද්‍රයෙහි ජලය හා සසඳන කල ඉතිරි වූ දෙතුන් දිය බිඳ සියයෙන් කොටසකටවත්, දහසින් කොටසකටවත්, ලක්ෂයෙන් කොටසකටවත් නොපැමිණෙන්නේය. පින්වත් මහණෙනි, එපරිද්දෙන්ම... (මෙලෙසම යොදාගැනීමෙන්)... ධර්මචක්ෂුෂය ලැබීමය.",
      "paliTitle": "Dutiyasamuddasuttaṃ",
      "vagga": ""
    },
    {
      "number": 82,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, puriso himavato pabbatarājassa satta sāsapamattiyo pāsāṇasakkharā upanikkhipeyya. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yā vā satta sāsapamattiyo pāsāṇasakkharā upanikkhittā yo vā himavā [upanikkhittā, himavā vā (sī.)] pabbatarājā’’ti? ‘‘Etadeva, bhante, bahutaraṃ yadidaṃ himavā pabbatarājā; appamattikā satta sāsapamattiyo pāsāṇasakkharā upanikkhittā. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti himavantaṃ pabbatarājānaṃ upanidhāya satta sāsapamattiyo pāsāṇasakkharā upanikkhittā’’ti. ‘‘Evameva kho…pe… dhammacakkhupaṭilābho’’ti. Navamaṃ.",
      "english": "“Just as, bhikkhus, a man might place seven mustard-seed-sized pebbles on the king of mountains, the Himalayas. What do you think, bhikkhus, which is greater: those seven mustard-seed-sized pebbles that are placed, or the king of mountains, the Himalayas?”\n\n“This indeed, venerable sir, is greater: namely, the king of mountains, the Himalayas. The seven mustard-seed-sized pebbles that are placed are insignificant. They do not count as a hundredth part, nor a thousandth part, nor a hundred-thousandth part when compared to the king of mountains, the Himalayas, those seven mustard-seed-sized pebbles that are placed.”\n\n“Even so, bhikkhus, for a noble disciple who has acquired the Dhamma-eye, the suffering that has been entirely exhausted and annihilated is vast, like the king of mountains, the Himalayas. The suffering that remains for them is insignificant, like those seven mustard-seed-sized pebbles that are placed. This is the acquisition of the Dhamma-eye.”",
      "sinhala": "සැවැත් නුවර වැඩසිටිනා සේක. ...\n\"මහණෙනි, යම් සේ පුරුෂයෙක් හිමාලය පර්වත රාජයා මත සතක් අබ ඇට පමණ ගල් කැට තබන්නේ නම්, මහණෙනි, ඔබලා මේ කුමක් සිතන්නහු ද? තැබූ ඒ සතක් අබ ඇට පමණ ගල් කැට ද, නැතිනම් හිමාලය පර්වත රාජයා ද – මේ දෙකෙන් කුමක් නම් වඩා මහත් ද?\"\n\n\"වහන්ස, හිමාලය පර්වත රාජයා ම ය වඩා මහත් වන්නේ. තැබූ සතක් අබ ඇට පමණ ගල් කැට ඉතා ස්වල්පයකි. හිමාලය පර්වත රාජයා හා සසඳන කල, තැබූ සතක් අබ ඇට පමණ ගල් කැට සියයෙන් කොටසක්වත් නොවේ, දහසෙන් කොටසක්වත් නොවේ, ලක්ෂයෙන් කොටසක්වත් නොවේ.\"\n\n\"මහණෙනි, එසේම ... ධර්‍ම​ චක්ෂුව ලැබීමයි.\"\nනවවැනි සූත්‍රයයි.",
      "paliTitle": "Pabbatasuttaṃ",
      "vagga": ""
    },
    {
      "number": 83,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, himavā pabbatarājā parikkhayaṃ pariyādānaṃ gaccheyya, ṭhapetvā satta sāsapamattiyo pāsāṇasakkharā. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yaṃ vā himavato pabbatarājassa parikkhīṇaṃ pariyādiṇṇaṃ yā vā satta sāsapamattiyo pāsāṇasakkharā avasiṭṭhā’’ti? ‘‘Etadeva, bhante, bahutaraṃ himavato pabbatarājassa yadidaṃ parikkhīṇaṃ pariyādiṇṇaṃ; appamattikā satta sāsapamattiyo pāsāṇasakkharā avasiṭṭhā. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti himavato pabbatarājassa parikkhīṇaṃ pariyādiṇṇaṃ upanidhāya satta sāsapamattiyo pāsāṇasakkharā avasiṭṭhā’’ti. ‘‘Evameva kho, bhikkhave, ariyasāvakassa diṭṭhisampannassa puggalassa abhisametāvino etadeva bahutaraṃ dukkhaṃ yadidaṃ parikkhīṇaṃ pariyādiṇṇaṃ; appamattakaṃ avasiṭṭhaṃ. Neva satimaṃ kalaṃ upeti na sahassimaṃ kalaṃ upeti na satasahassimaṃ kalaṃ upeti purimaṃ dukkhakkhandhaṃ parikkhīṇaṃ pariyādiṇṇaṃ upanidhāya yadidaṃ sattakkhattuṃparamatā. Evaṃ mahatthiyo kho, bhikkhave, dhammābhisamayo, evaṃ mahatthiyo dhammacakkhupaṭilābho’’ti. Dasamaṃ.",
      "english": "Monks, suppose the Himālaya, the king of mountains, were to be utterly consumed and exhausted, with only seven mustard-seed-sized pebbles remaining. What do you think, monks, which is greater: that which of the Himālaya, the king of mountains, has been utterly consumed and exhausted, or those seven mustard-seed-sized pebbles that remain?\n\n\"Venerable sir, it is indeed greater, that which of the Himālaya, the king of mountains, has been utterly consumed and exhausted. The seven mustard-seed-sized pebbles that remain are insignificant. They do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part when compared to that which of the Himālaya, the king of mountains, has been utterly consumed and exhausted.\"\n\nEven so, monks, for a noble disciple, a person endowed with right view, one who has directly comprehended the Dhamma, that which is the greater amount of suffering is what has been utterly consumed and exhausted. What remains is insignificant. It does not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part when compared to the former mass of suffering that has been utterly consumed and exhausted, which is now at most seven more rebirths.\n\nSo greatly beneficial, monks, is the direct penetration of the Dhamma; so greatly beneficial is the acquisition of the Dhamma-eye.",
      "sinhala": "සැවැත්නුවර වැඩවසන සේක…\n\n‘‘මහණෙනි, යම්සේ හිමාලය පර්වත රාජයා සත් සසඳ මාත්‍ර ගල්කැට සතක් ඉතිරි කොට ක්ෂය වී පරිහානියට යන්නේ ද, ඒ කුමක් සිතව් ද මහණෙනි, හිමාලය පර්වත රාජයාගේ ක්ෂය වී පරිහානියට ගිය ප්‍රමාණය ද, ඉතිරි වී ඇති සත් සසඳ මාත්‍ර ගල්කැට සත ද යන දෙකින් කවරක් නම් මහත් ද?’’ ‘‘ස්වාමීනි, හිමාලය පර්වත රාජයාගේ ක්ෂය වී පරිහානියට ගිය ප්‍රමාණය ම මහත් ය; ඉතිරි වී ඇති සත් සසඳ මාත්‍ර ගල්කැට සත ඉතා ස්වල්පයකි. හිමාලය පර්වත රාජයාගේ ක්ෂය වී පරිහානියට ගිය ප්‍රමාණයට සාපේක්ෂව ඉතිරි වී ඇති සත් සසඳ මාත්‍ර ගල්කැට සත සියයෙන් එකකට හෝ, දහසින් එකකට හෝ, ලක්ෂයෙන් එකකට හෝ නොපැමිණේ.’’ ‘‘මහණෙනි, එපරිද්දෙන්ම ආර්යශ්‍රාවකයෙකුට, සම්මා දිට්ඨියෙන් යුක්ත වූ, ධර්‍මය අවබෝධ කළ පුද්ගලයෙකුට, ක්ෂය වී පරිහානියට පත් වූ දුක ම මහත් ය; ඉතා ස්වල්පයක් ඉතිරි ව ඇත. ක්ෂය වී පරිහානියට පත් වූ පෙර දුක්ඛස්කන්ධයට සාපේක්ෂව, උපරිම සත් වරක් භව පැවැත්මක් ලෙස ඉතිරි ව ඇති (දුක) සියයෙන් එකකට හෝ, දහසින් එකකට හෝ, ලක්ෂයෙන් එකකට හෝ නොපැමිණේ. මහණෙනි, මෙසේ ධර්‍මය අවබෝධ කිරීම මහත් අර්ථවත් ය, මෙසේ ධර්‍ම චක්ෂුව ලැබීම මහත් අර්ථවත් ය.’’",
      "paliTitle": "Dutiyapabbatasuttaṃ",
      "vagga": ""
    },
    {
      "number": 84,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘seyyathāpi, bhikkhave, puriso sinerussa pabbatarājassa satta muggamattiyo pāsāṇasakkharā upanikkhipeyya. Taṃ kiṃ maññatha, bhikkhave, katamaṃ nu kho bahutaraṃ, yā vā satta muggamattiyo pāsāṇasakkharā upanikkhittā yo vā sineru [upanikkhittā, sineru vā (sī.)] pabbatarājā’’ti? ‘‘Etadeva, bhante, bahutaraṃ yadidaṃ sineru pabbatarājā; appamattikā satta muggamattiyo pāsāṇasakkharā upanikkhittā. Neva satimaṃ kalaṃ upenti na sahassimaṃ kalaṃ upenti na satasahassimaṃ kalaṃ upenti sineruṃ pabbatarājānaṃ upanidhāya satta muggamattiyo pāsāṇasakkharā upanikkhittā’’ti. ‘‘Evameva kho, bhikkhave, ariyasāvakassa diṭṭhisampannassa puggalassa adhigamaṃ upanidhāya aññatitthiyasamaṇabrāhmaṇaparibbājakānaṃ adhigamo neva satimaṃ kalaṃ upeti na sahassimaṃ kalaṃ upeti na satasahassimaṃ kalaṃ upeti. Evaṃ mahādhigamo, bhikkhave, diṭṭhisampanno puggalo, evaṃ mahābhiñño’’ti. Ekādasamaṃ. ",
      "english": "Just as, bhikkhus, if a person were to place down seven gravel-stones, each the size of a mung bean, from Mount Sineru, the king of mountains. What do you think, bhikkhus, which is greater: those seven gravel-stones that have been placed down, or Mount Sineru, the king of mountains?\n\nVenerable Sir, Mount Sineru, the king of mountains, is indeed greater; the seven gravel-stones placed down are insignificant. The seven gravel-stones placed down do not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part, when compared to Mount Sineru, the king of mountains.\n\nIn the same way, bhikkhus, compared to the attainment of a noble disciple, a person perfected in right view, the attainment of ascetics, brahmins, and wanderers of other sects does not amount to a hundredth part, nor a thousandth part, nor a hundred-thousandth part.\n\nSo great, bhikkhus, is the attainment of a person perfected in right view; so great is their higher knowledge.",
      "sinhala": "සා​ව​ත්​ථි​යෙ​හි වා​ස​ය ක​ර​න සේ​ක. භික්ෂූනි, යම් සේ පුරුෂයෙක් මේරු පර්ව​ත රාජයා වෙතට මුං ඇට සතක් පමණ වූ පාෂාණ කැබලි තබන්නේද, භික්ෂූනි, ඒ කුමක් සිතව්ද? යම් ඒ මුං ඇට සතක් පමණ වූ පාෂාණ කැබලි තැබුවේද, නැතිනම් මේරු පර්ව​ත රාජයාද? මේ දෙකෙන් කුමක්ද බොහෝ වූයේ? ‘‘ස්වාමීනි, මේ මේරු පර්ව​ත රාජයාමයි බොහෝ වූයේ. මුං ඇට සතක් පමණ වූ පාෂාණ කැබලි තැබූයේ අල්පයකි. තැබූ මුං ඇට සතක් පමණ වූ පාෂාණ කැබලි මේරු පර්ව​ත රාජයා හා සසඳා බැලීමේදී සියයෙන් කොටසකටවත් සම නොවේ, දහසෙන් කොටසකටවත් සම නොවේ, ලක්ෂයෙන් කොටසකටවත් සම නොවේ යැයි කීහ.\n\nභික්ෂූනි, එලෙසින්ම ආර්ය​ ශ්‍රා​ව​ක​යා​ට, සම්‍යක් දෘෂ්ටියෙන් යුක්ත වූ පුද්ගලයාට, ලැබී ඇති අධිගමයට සාපේක්ෂව අන්‍ය තීර්ථක ශ්‍රමණ බ්‍රාහ්මණ පරි​ව්‍රාජකයන්ගේ අධිගමය සියයෙන් කොටසකටවත් සම නොවේ, දහසෙන් කොටසකටවත් සම නොවේ, ලක්ෂයෙන් කොටසකටවත් සම නොවේ. භික්ෂූනි, සම්‍යක් දෘෂ්ටියෙන් යුක්ත වූ පුද්ගලයාගේ අධිගමය මෙසේ මහත්ය, එසේම ඔහුගේ මහාභිඥාව ද මෙසේ මහත්ය.",
      "paliTitle": "Tatiyapabbatasuttaṃ",
      "vagga": ""
    }
  ],
  "footer": {
    "pali": "Abhisamayasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Nakhasikhā pokkharaṇī, sambhejjaudake ca dve; Dve pathavī dve samuddā, tayo ca pabbatūpamāti.",
    "english": "",
    "sinhala": ""
  }
}