{
  "id": "sn.2.6",
  "title": {
    "pali": "Lābhasakkārasaṃyuttaṃ",
    "english": "Connected with Gains and Honors",
    "sinhala": "මෙය ලාභ සත්කාර සංයුත්තයයි."
  },
  "sections": [
    {
      "number": 157,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Dāruṇo, bhikkhave, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhasakkārasilokaṃ pajahissāma, na ca no uppanno lābhasakkārasiloko cittaṃ pariyādāya ṭhassatī’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. There, the Blessed One addressed the bhikkhus, saying, \"Bhikkhus.\" \"Venerable Sir,\" those bhikkhus replied to the Blessed One. The Blessed One spoke thus: \"Bhikkhus, gain, honor, and fame are terrible, bitter, harsh, and an impediment to the attainment of the unsurpassed security from bondage. Therefore, bhikkhus, you should train yourselves thus: 'We will abandon any gain, honor, and fame that has arisen, and we will not allow any arisen gain, honor, and fame to overpower our minds.' Indeed, bhikkhus, you should train yourselves thus.\"",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනයේ අනේපිඬු සිටුතුමාගේ ආරාමයේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක: \"මහණෙනි, ලාභ සත්කාර කීර්ති ප්‍රශංසා දරුණු ය, තිත්ත ය, රළු ය, අනුත්තර වූ යෝගක්ෂේමයට (නිවන් සුවයට) පැමිණීම සඳහා බාධා පමුණුවන සුලු ය. එබැවින් මහණෙනි, මෙසේ හික්මිය යුතු ය: 'උපන් ලාභ සත්කාර කීර්ති ප්‍රශංසා අපි දුරු කරන්නෙමු. උපන් ලාභ සත්කාර කීර්ති ප්‍රශංසා අපගේ සිත මුළා කොට නොපවතිනු ඇත.' මහණෙනි, නුඹලා මෙසේ ම හික්මිය යුතු ය.\"\n\nපළමුවැන්න යි.",
      "paliTitle": "Dāruṇasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 158,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Seyyathāpi, bhikkhave, bāḷisiko āmisagataṃ baḷisaṃ gambhīre udakarahade pakkhipeyya. Tamenaṃ aññataro āmisacakkhu maccho gileyya. Evañhi so, bhikkhave, maccho gilabaḷiso bāḷisikassa anayaṃ āpanno byasanaṃ āpanno yathākāmakaraṇīyo bāḷisikassa’’. ‘‘Bāḷisikoti kho, bhikkhave, mārassetaṃ pāpimato adhivacanaṃ. Baḷisanti kho, bhikkhave, lābhasakkārasilokassetaṃ adhivacanaṃ. Yo hi koci, bhikkhave, bhikkhu uppannaṃ lābhasakkārasilokaṃ assādeti nikāmeti, ayaṃ vuccati, bhikkhave, bhikkhu gilabaḷiso mārassa anayaṃ āpanno byasanaṃ āpanno yathākāmakaraṇīyo pāpimato. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhasakkārasilokaṃ pajahissāma, na ca no uppanno lābhasakkārasiloko cittaṃ pariyādāya ṭhassatī’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Dreadful, monks, are gain, honor, and renown; they are bitter, harsh, and an impediment to the attainment of the unsurpassed security from bondage. Just as, monks, a fisherman might cast a baited hook into a deep pool of water, and then a certain fish, with an eye for the bait, would swallow it. Thus, monks, that fish, having swallowed the hook, has fallen into the fisherman's ruin, fallen into disaster, and is subject to the fisherman's will. The term 'fisherman,' monks, is a designation for Māra, the Evil One. The term 'hook,' monks, is a designation for gain, honor, and renown. Whosoever, monks, is a monk who enjoys and delights in the gain, honor, and renown that have arisen, that monk is called one who has swallowed the hook, fallen into Māra's ruin, fallen into disaster, and is subject to the Evil One's will. So dreadful, monks, are gain, honor, and renown – bitter, harsh, and an impediment to the attainment of the unsurpassed security from bondage. Therefore, monks, you should train yourselves thus: 'We will abandon arisen gain, honor, and renown, and arisen gain, honor, and renown will not overpower our minds.' Thus indeed, monks, should you train.",
      "sinhala": "මහණෙනි, ලාභ, සත්කාර, කීර්ති ප්‍රශංසා දරුණු ය, කටුක ය, රළු ය, අනුත්තර වූ යෝගක්ෂේමය අධිගමනය කිරීම පිණිස අන්තරායකර ය. මහණෙනි, යම් සේ ධීවරයෙක් ඇමක් ගැසූ බිලී කොක්කක් ගැඹුරු ජලාශයකට දමයි. ඒ කොක්ක යම්කිසි ඇමට ලොල් වූ මාළුවෙක් ගිල දමයි. මහණෙනි, මෙසේ ඒ මාළුවා බිලී කොක්ක ගිලගත් බැවින් ධීවරයාට අනර්ථයට පත් වූවෙක් ය, විපතට පත් වූවෙක් ය, ධීවරයාට කැමති දෙයක් කළ හැකි තත්ත්වයට පත් වූවෙක් ය.\n\nමහණෙනි, ධීවරයා යනු, පව්කාර මාරයාට නමකි. මහණෙනි, බිලී කොක්ක යනු, ලාභ, සත්කාර, කීර්ති ප්‍රශංසා වලට නමකි. මහණෙනි, යම්කිසි මහණෙක් උපන් ලාභ, සත්කාර, කීර්ති ප්‍රශංසා ආස්වාදනය කරයි ද, ප්‍රිය කරයි ද, මහණෙනි, මේ මහණ බිලී කොක්ක ගිලගත් තැනැත්තා යැයි කියනු ලැබේ. ඔහු පව්කාර මාරයාට අනර්ථයට පත් වූවෙක් ය, විපතට පත් වූවෙක් ය, ඔහුගේ කැමැත්තට යටත් වූවෙක් ය.\n\nමහණෙනි, මෙසේ ලාභ, සත්කාර, කීර්ති ප්‍රශංසා දරුණු ය, කටුක ය, රළු ය, අනුත්තර වූ යෝගක්ෂේමය අධිගමනය කිරීම පිණිස අන්තරායකර ය. එහෙයින් මහණෙනි, මෙසේ හික්මිය යුතු ය: ‘උපන් ලාභ, සත්කාර, කීර්ති ප්‍රශංසා අත්හරින්නෙමු. උපන් ලාභ, සත්කාර, කීර්ති ප්‍රශංසා අපගේ සිත යටපත් කර නොගනීවා.’ මහණෙනි, මෙසේ ම ඔබ විසින් හික්මිය යුතු ය.",
      "paliTitle": "Baḷisasuttaṃ"
    },
    {
      "number": 159,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Bhūtapubbaṃ, bhikkhave, aññatarasmiṃ udakarahade mahākummakulaṃ ciranivāsi ahosi. Atha kho, bhikkhave, aññataro kummo aññataraṃ kummaṃ etadavoca – ‘mā kho tvaṃ, tāta kumma, etaṃ padesaṃ agamāsī’ti. Agamāsi kho, bhikkhave, so kummo taṃ padesaṃ. Tamenaṃ luddo papatāya vijjhi. Atha kho, bhikkhave, so kummo yena so kummo tenupasaṅkami. Addasā kho, bhikkhave, so kummo taṃ kummaṃ dūratova āgacchantaṃ. Disvāna taṃ kummaṃ etadavoca – ‘kacci tvaṃ, tāta kumma, na taṃ padesaṃ agamāsī’ti? ‘Agamāsiṃ khvāhaṃ, tāta kumma, taṃ padesa’nti. ‘Kacci panāsi, tāta kumma, akkhato anupahato’ti? ‘Akkhato khomhi, tāta kumma, anupahato, atthi ca me idaṃ suttakaṃ piṭṭhito piṭṭhito anubandha’nti. ‘Tagghasi, tāta kumma, khato, taggha upahato. Etena hi te, tāta kumma, suttakena pitaro ca pitāmahā ca anayaṃ āpannā byasanaṃ āpannā. Gaccha dāni tvaṃ, tāta kumma, na dāni tvaṃ amhāka’’’nti. ‘‘Luddoti kho, bhikkhave, mārassetaṃ pāpimato adhivacanaṃ. Papatāti kho, bhikkhave, lābhasakkārasilokassetaṃ adhivacanaṃ. Suttakanti kho, bhikkhave, nandirāgassetaṃ adhivacanaṃ. Yo hi koci, bhikkhave, bhikkhu uppannaṃ lābhasakkārasilokaṃ assādeti nikāmeti – ayaṃ vuccati, bhikkhave, bhikkhu giddho papatāya [bhikkhu papatāya (syā. kaṃ.), bhikkhu viddho papatāya (?)] anayaṃ āpanno byasanaṃ āpanno yathākāmakaraṇīyo pāpimato. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Tatiyaṃ.",
      "english": "The Blessed One was residing at Sāvatthī. Bhikkhus, gain, honor, and fame are terrible, and they are an obstacle to the attainment of wholesome states. In the past, Bhikkhus, in a certain water pool, there lived a large family of turtles for a long time. Then, Bhikkhus, a certain turtle said to another turtle, 'My dear turtle, do not go to that area.' However, Bhikkhus, that turtle did indeed go to that area. A hunter struck him with a snare. Then, Bhikkhus, that turtle approached the other turtle. Bhikkhus, that turtle saw the other turtle coming from afar. Having seen that turtle, he said, 'My dear turtle, surely you did not go to that area, did you?' 'Indeed, my dear turtle, I did go to that area.' 'But surely, my dear turtle, you are unharmed and uninjured, aren't you?' 'Indeed, my dear turtle, I am unharmed and uninjured, but there is this string attached to my back.' 'My dear turtle, you are indeed injured; you are indeed harmed. For by this very string, my dear turtle, your fathers and grandfathers met with ruin and misfortune. Go now, my dear turtle, you are no longer one of us.' Bhikkhus, 'hunter' is a designation for Māra, the Evil One. Bhikkhus, 'snare' is a designation for gain, honor, and fame. Bhikkhus, 'string' is a designation for delight and lust. Whatever bhikkhu, Bhikkhus, relishes and cherishes arisen gain, honor, and fame – this bhikkhu, Bhikkhus, is called one greedy for the snare, fallen into ruin and misfortune, and become subject to the will of the Evil One. Thus terrible, Bhikkhus, is gain, honor, and fame. Therefore, Bhikkhus, you should train yourselves in this way.",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක. \"මහණෙනි, ලාභ සත්කාර කීර්ති ප්‍රශංසා දරුණු ය. (ඒවා නිර්වාණ) අවබෝධය පිණිස අතිශයින් බාධාකාරී ය.\"\n\nමහණෙනි, පෙර එක් සමයෙක්හි එක්තරා ජලාශයක මහා කැසුබු පවුලක් බොහෝ කලක් වාසය කළහ. මහණෙනි, එකල්හි එක් කැසුබුවෙක් තවත් කැසුබුවෙකුට මෙසේ කීවේ ය: \"දරුව කැසුබුව, නුඹ අර ප්‍රදේශයට නොයව.\" මහණෙනි, ඒ කැසුබුවා අර ප්‍රදේශයට ගියේ ය. දඩයක්කරුවෙක් ඔහුට මලපතකින් විද්දේ ය. මහණෙනි, ඉක්බිති ඒ කැසුබුවා අර කැසුබුවා සිටි තැනට පැමිණියේ ය. මහණෙනි, ඒ කැසුබුවා අර කැසුබුවා දුරදීම එනවා දුටුවේ ය. දැක ඔහුට මෙසේ කීවේ ය: \"දරුව කැසුබුව, නුඹ අර ප්‍රදේශයට නොගියෙහි ද?\" \"දරුව කැසුබුව, මම අර ප්‍රදේශයට ගියෙමි.\" \"දරුව කැසුබුව, නුඹ තුවාල නොලද්දෙහි ද, හානි නොලද්දෙහි ද?\" \"දරුව කැසුබුව, මම තුවාල නොලද්දෙමි, හානි නොලද්දෙමි. නමුත් මාගේ පිටුපසින් නූලක් බැඳී ඇත.\" \"දරුව කැසුබුව, නුඹ නිසැකවම තුවාල ලබා ඇත, නිසැකවම හානි වී ඇත. දරුව කැසුබුව, මේ නූල නිසාම නුඹේ පියවරු ද මුතුන් මිත්තෝ ද විනාශයට ද පීඩාවට ද පත් වූහ. දරුව කැසුබුව, දැන් නුඹ යව. දැන් නුඹ අපේ කෙනෙකු නොවේ.\"\n\nමහණෙනි, 'දඩයක්කරුවා' යනු පව්කරු මාරයාට නමෙකි. මහණෙනි, 'මලපත' යනු ලාභ සත්කාර කීර්ති ප්‍රශංසා වලට නමෙකි. මහණෙනි, 'නූල' යනු ඇලුම් කරන ආශාවට නමෙකි. මහණෙනි, යම්කිසි භික්ෂුවක් පහළ වන ලාභ සත්කාර කීර්ති ප්‍රශංසා රස විඳින්නේ ද, ප්‍රිය කරන්නේ ද – මහණෙනි, මේ භික්ෂුව 'මලපතට ගිජු වූ' භික්ෂුවක් යැයි කියනු ලැබේ. ඔහු විනාශයට පත් වී, පීඩාවට පත් වී, පව්කරු මාරයාට කැමති ලෙස කිරීමට යටත් වූවෙක් වේ. මෙසේ මහණෙනි, ලාභ සත්කාර කීර්ති ප්‍රශංසා (නිර්වාණ) අවබෝධය පිණිස දරුණු ය. මෙසේ ම මහණෙනි, නුඹලා පුහුණු විය යුතු ය.",
      "paliTitle": "Kummasuttaṃ"
    },
    {
      "number": 160,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Seyyathāpi, bhikkhave, dīghalomikā eḷakā kaṇṭakagahanaṃ paviseyya. Sā tatra tatra sajjeyya, tatra tatra gayheyya [gaccheyya (sī.), gaṇheyya (syā. kaṃ. pī. ka.)], tatra tatra bajjheyya, tatra tatra anayabyasanaṃ āpajjeyya. ‘Evameva kho, bhikkhave, idhekacco bhikkhu lābhasakkārasilokena abhibhūto pariyādiṇṇacitto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati. So tatra tatra sajjati, tatra tatra gayhati, tatra tatra bajjhati, tatra tatra anayabyasanaṃ āpajjati. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’’nti. Catutthaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī.\n\n“Monks, gain, honor, and fame are dreadful, an impediment to spiritual attainment. Just as, monks, a long-haired sheep might enter a thicket of thorns: it would get stuck here and there, get caught here and there, get bound here and there, and meet with ruin and misfortune here and there.\n\n“In the same way, monks, some bhikkhu here, overwhelmed by gain, honor, and fame, with his mind completely seized, having donned his lower robe in the morning and taken his bowl and outer robe, enters a village or a town for alms. He gets stuck here and there, gets caught here and there, gets bound here and there, and meets with ruin and misfortune here and there.\n\n“So dreadful indeed, monks, is gain, honor, and fame, an impediment to spiritual attainment. Therefore, monks, you should train yourselves in this way.”",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක… භික්ෂූනි, ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසා ඉතා දරුණු ය… (මාර්ග ඵල) අවබෝධය පිණිස (බාධාවකි).\n\nභික්ෂූනි, යම් සේ දිගු ලෝම ඇති බැටළුවෙක් කටු පඳුරකට ඇතුළු වේ නම්, ඌ එතැන එතැන පැටලෙන්නේ ය, එතැන එතැන සිරවෙන්නේ ය, එතැන එතැන බැඳෙන්නේ ය, එතැන එතැන විපතටත් විනාශයටත් පත් වන්නේ ය.\n\nභික්ෂූනි, එලෙසින්ම මෙහිලා ඇතැම් භික්ෂුවක් ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසාවලින් යටපත් වූ සිත් ඇත්තෙක් වී, සිත මුළුමනින්ම වෙළාගත්, පෙරවරුවේ සිවුරු හැඳ පොරවා, පාත්‍රය හා සිවුරු ගෙන ගමකට හෝ නියම්ගමකට හෝ පිඬු සිඟා වඩියි. හෙතෙම එතැන එතැන පැටලෙයි, එතැන එතැන සිරවෙයි, එතැන එතැන බැඳෙයි, එතැන එතැන විපතටත් විනාශයටත් පත් වෙයි.\n\nභික්ෂූනි, ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසා මෙසේ දරුණු ය… එබැවින් භික්ෂූනි, ඔබ විසින් මෙලෙසින්ම හික්මිය යුතු ය.\nසිව්වන (දේශනාව)යි.",
      "paliTitle": "Dīghalomikasuttaṃ"
    },
    {
      "number": 161,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Seyyathāpi, bhikkhave, mīḷhakā gūthādī gūthapūrā puṇṇā gūthassa. Purato cassa mahāgūthapuñjo. Sā tena aññā mīḷhakā atimaññeyya – ‘ahamhi gūthādī gūthapūrā puṇṇā gūthassa, purato ca myāyaṃ mahāgūthapuñjo’ti. Evameva kho, bhikkhave, idhekacco bhikkhu lābhasakkārasilokena abhibhūto pariyādiṇṇacitto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati. So tattha bhuttāvī ca hoti yāvadattho, nimantito ca svātanāya, piṇḍapāto cassa pūro. So ārāmaṃ gantvā bhikkhugaṇassa majjhe vikatthati – ‘bhuttāvī camhi yāvadattho, nimantito camhi svātanāya, piṇḍapāto ca myāyaṃ pūro, lābhī camhi cīvara-piṇḍapāta-senāsana-gilānappaccaya- bhesajjaparikkhārānaṃ, ime panaññe bhikkhū appapuññā appesakkhā na lābhino cīvara- piṇḍapātasenāsana-gilānappaccaya-bhesajja-parikkhārāna’nti. So tena lābhasakkārasilokena abhibhūto pariyādiṇṇacitto aññe pesale bhikkhū atimaññati. Tañhi tassa, bhikkhave, moghapurisassa hoti dīgharattaṃ ahitāya dukkhāya. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo bhikkhave, sikkhitabba’’nti. Pañcamaṃ.",
      "english": "“Terrible, O monastics, is gain, honor, and renown. It is an obstruction to the realization of the goal.\n\nJust as, O monastics, a creature dwelling in the filth, feeding on the filth, filled with the filth, completely full of excrement, might have a great heap of excrement before it. Because of that, that creature of the filth might look down upon other creatures of the filth, thinking: ‘I subsist on excrement, I am full of excrement, completely replete with excrement, and here is this great heap of excrement before me.’\n\nIn the same way, O monastics, a certain monk here, overcome by gain, honor, and renown, with his mind completely seized, dresses himself in the morning, takes his bowl and robe, and enters a village or town for alms. Having eaten there until fully satisfied, and having been invited for the following day, and having a full alms-bowl, he goes to the monastery and boasts among the community of monastics, saying: ‘I have eaten until fully satisfied, I have been invited for tomorrow, and my alms-bowl is full. I am one who receives robes, alms-food, lodgings, and necessary medicinal provisions for the sick. But these other monastics are of little merit and little influence, and they do not receive robes, alms-food, lodgings, and necessary medicinal provisions for the sick.’\n\nHe, overcome by that gain, honor, and renown, with his mind completely seized, looks down upon other conscientious monastics. That, O monastics, becomes for that deluded person a cause of harm and suffering for a long, long time. So terrible, O monastics, is gain, honor, and renown; it is an obstruction to the realization of the goal. Thus, O monastics, should you train yourselves.”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩසිටින සේක. (පෙ)\n\n“මහණෙනි, ලාභ, සත්කාර හා ප්‍රශංසා යනු දරුණු (බිහිසුණු) දෙයකි. (පෙ) ... (එය) උතුම් ධර්මය අවබෝධය පිණිස ය.\n\nමහණෙනි, යම් සේ කිලිටි කන, කිලිටියෙන් පිරී ඇති, කිලිටි සම්පූර්ණ කළ ඌරියක් (මීළකාවක්) ඇද්ද; ඇයට ඉදිරියෙන් ද මහා කිලිටි ගොඩක් ඇද්ද.\n\nඇය ඒ (තමාගේ තත්ත්වය) නිසා අන් කිලිටි කන ඌරියක් අවමන් කරන්නේ ය: 'මම කිලිටි කන්නී වෙමි, කිලිටියෙන් පිරුණිමි, කිලිටි සම්පූර්ණ කළෙමි, මට ඉදිරියෙහි ද මේ මහා කිලිටි ගොඩක් ඇතැ'යි කියා.\n\nමහණෙනි, එපරිද්දෙන් ම මේ ශාසනයෙහි ඇතැම් භික්ෂුවක් ලාභ, සත්කාර, ප්‍රශංසා (ලොක සිල්කය) විසින් යටපත් කරන ලදුව, ඔහුගේ සිත සම්පූර්ණයෙන් ග්‍රහණය කර ගන්නා ලදුව, පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතය පිණිස වඩියි.\n\nඔහු එහි දී අවශ්‍ය ප්‍රමාණයට භුක්ති විඳින්නෙක් ද වෙයි, හෙට දවස පිණිස ඇරයුම් ලද්දෙක් ද වෙයි, ඔහුගේ පිණ්ඩපාත්‍රය ද පිරී ඇත.\n\nඔහු ආරාමයට ගොස් භික්ෂු සංඝයා මැද මහා ආඩම්බරයෙන් කථා කරයි: 'මම අවශ්‍ය ප්‍රමාණයට භුක්ති විඳියෙමි, මම හෙට දවස පිණිස ඇරයුම් ලද්දෙමි, මාගේ මේ පිණ්ඩපාත්‍රය ද පිරී ඇත. මම සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පරිෂ්කාර යන සියල්ල ලබන්නෙක් වෙමි. නමුත් මේ අනෙක් භික්ෂූහු අඩු පින් ඇත්තෝ ය, අඩු බලයක් ඇත්තෝ ය, සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස බෙහෙත් පරිෂ්කාර නො ලබන්නෝ ය' යි කියා.\n\nඔහු ඒ ලාභ, සත්කාර, ප්‍රශංසා (ලොක සිල්කය) විසින් යටපත් කරන ලදුව, ඔහුගේ සිත සම්පූර්ණයෙන් ග්‍රහණය කර ගන්නා ලදුව, අන්‍ය උතුම් සිල්වත් භික්ෂූන්ට අවමන් කරයි.\n\nමහණෙනි, ඒ අඥාන (මෝඝ) පුරුෂයාට එය දීර්ඝ කාලයක් අහිත පිණිස, දුක පිණිස ම වන්නේ ය. මහණෙනි, ලාභ, සත්කාර, ප්‍රශංසා (ලොක සිල්කය) එපරිද්දෙන් ම දරුණු ය. (පෙ) එහෙයින් මහණෙනි, නුඹලා මෙසේ හික්මිය යුතු ය.",
      "paliTitle": "Mīḷhakasuttaṃ"
    },
    {
      "number": 162,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. [upari tatiyavagge tatiyacatutthasuttesu ‘‘mā ca kho tvaṃ tāta sekhaṃ… anupāpuṇātū’’ti āgataṃ. tena nayena idhāpi attho gahetabbo. ettha hi kiṃ saddena paṭikkhepatthopi sakkā ñātuṃ, yathā ‘‘sayaṃ abhiññāya kamuddiseyya’’nti. tasmā kaṃ… āgacchatūti ettha kamapi… mā āgacchatūti ca, kaṃ sekhaṃ… anupāpuṇātūti ettha kamapi sekhaṃ… mā pāpuṇātūti ca attho veditabbo. aṭṭhakathāṭīkāsu ca ayamevattho ñāpito] Kaṃ, bhikkhave, asanivicakkaṃ āgacchatu [upari tatiyavagge tariyacatutthasuttesu ‘‘mā ca kho tvaṃ tāta sekhaṃ… anupāpuṇātū’’ti āgataṃ. tena nayena idhāpi attho gahetabbo. ettha hi kiṃ saddena paṭikkhepatthopi sakkā ñātuṃ, yathā ‘‘sayaṃ abhiññāya kamuddiseyya’’nti. tasmā kaṃ… āgacchatūti ettha kamapi… mā āgacchatūtica, taṃ sekhaṃ… anupāpuṇātūti ettha kamapi sekhaṃ… mā pāpuṇātūti ca attho veditabbo. aṭṭhakathāṭīkāsu ca ayamevattho ñāpito], sekhaṃ [asanivicakkaṃ, taṃ sekhaṃ (pī. ka.), asanivicakkaṃ, sekhaṃ (syā. kaṃ.), asanivicakkaṃ āgacchatu, kaṃ sekhaṃ (?)] appattamānasaṃ lābhasakkārasiloko anupāpuṇātu’’ [anupāpuṇāti (pī. ka.)]. ‘‘Asanivicakkanti kho, bhikkhave, lābhasakkārasilokassetaṃ adhivacanaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Chaṭṭhaṃ.",
      "english": "The Blessed One was dwelling in Sāvatthī... Fierce, O monks, is gain, homage, and fame, and it is a grave impediment to the attainment of the path.\n\nO monks, may the whirling thunderbolt not strike anyone! May gain, homage, and fame not reach the trainee whose mind has not yet attained the goal!\n\nO monks, the whirling thunderbolt is indeed a designation for gain, homage, and fame. So fierce, O monks, is gain, homage, and fame... Thus, O monks, must you train.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක.\n\nමහණෙනි, ලාභ, සත්කාර හා කීර්තිය භයානක ය. (එය) (උතුම් ඵලයන්) අවබෝධ කරගැනීමට (බාධා කරයි). මහණෙනි, අකුණු සැර සහිත රෝදයක් (වැනි විපතක්) කා හට පැමිණිය යුතු ද? තවමත් (අරහත්) ඵලය අවබෝධ කර නොගත් සේඛයා හට ලාභ, සත්කාර හා කීර්තිය පැමිණේවා! මහණෙනි, ‘අකුණු සැර සහිත රෝදය’ යනු මේ ලාභ, සත්කාර හා කීර්තියටම නමකි. මහණෙනි, ලාභ, සත්කාර හා කීර්තිය මෙසේ භයානක ය. එබැවින් මහණෙනි, ඔබ විසින් මෙලෙස හික්මිය යුතු ය.",
      "paliTitle": "Asanisuttaṃ"
    },
    {
      "number": 163,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Kaṃ, bhikkhave, diddhagatena visallena sallena [diṭṭhigatena visallena (ka. sī.), diṭṭhigatena sallena (syā. kaṃ.), diṭṭhigatena visallena sallena (ka.), diṭṭhagatena visallena sallena (pī.)] vijjhatu, sekhaṃ [vijjhatu, taṃ sekhaṃ (sī.), vijjhati, taṃ sekhaṃ (pī. ka.)] appattamānasaṃ lābhasakkārasiloko anupāpuṇātu’’ [anupāpuṇāti (pī. ka.)]. ‘‘Sallanti kho, bhikkhave, lābhasakkārasilokassetaṃ adhivacanaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ.",
      "english": "He was dwelling at Sāvatthī… Monks, gain, honor, and fame are harsh and dangerous… they obstruct attainment. Monks, let gain, honor, and fame strike and pierce that trainee whose mind has not yet reached the goal, hitting him with a poisoned arrow, an arrow of distorted view. Indeed, monks, the term ‘arrow’ is a designation for gain, honor, and fame. Thus, monks, gain, honor, and fame are extremely harsh and dangerous… This is how you must train yourselves, monks.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක... මහණෙනි, ලාභ, සත්කාර, කීර්තිය යනු දරුණු දෙයකි... (අරහත් මාර්ගයේ) අවබෝධය පිණිස (එය බාධාවකි).\n\nමහණෙනි, තවමත් ඵලයට නොපැමිණි සිත් ඇති ඒ ශ්‍රේක්‍ෂයාට, විෂ ගල්වන ලද සළ්ලයකින් (දෘෂ්ටිගත සළ්ලයකින්) විදිනු ලබන ලාභ, සත්කාර, කීර්තිය නොපැමිණෙන්නට වග බලා ගත යුතුයි.\n\nමහණෙනි, ලාභ, සත්කාර, කීර්තිය යන්නට ඇති නාමයක් නම් සළ්ලයක් (හීයක්) යනුයි. මහණෙනි, ඒ අයුරින් ලාභ, සත්කාර, කීර්තිය ඉතා දරුණුය... එහෙයින් මහණෙනි, තොප මේ ආකාරයෙන් ම පුහුණු විය යුතුයි.",
      "paliTitle": "Diddhasuttaṃ"
    },
    {
      "number": 164,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Assuttha no tumhe, bhikkhave, rattiyā paccūsasamayaṃ jarasiṅgālassa [siṅgālassa (ka.), jarasigālassa (sī. syā. kaṃ.)] vassamānassā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, jarasiṅgālo ukkaṇḍakena [ukkaṇḍakena (sī.), ukkaṇṇakena (syā. kaṃ. pī.)] nāma rogajātena phuṭṭho neva bilagato ramati, na rukkhamūlagato ramati, na ajjhokāsagato ramati; yena yena gacchati, yattha yattha tiṭṭhati, yattha yattha nisīdati, yattha yattha nipajjati; tattha tattha anayabyasanaṃ āpajjati. Evameva kho, bhikkhave, idhekacco bhikkhu lābhasakkārasilokena abhibhūto pariyādiṇṇacitto neva suññāgāragato ramati, na rukkhamūlagato ramati, na ajjhokāsagato ramati; yena yena gacchati, yattha yattha tiṭṭhati, yattha yattha nisīdati, yattha yattha nipajjati; tattha tattha anayabyasanaṃ āpajjati. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Aṭṭhamaṃ.",
      "english": "The Blessed One was residing in Sāvatthī... Gain, honor, and fame, monks, are cruel and terrible... [They inhibit] the attainment of the ultimate goal. Monks, did you hear that old jackal wailing during the last watch of the night, near dawn?\"\n\"Yes, Venerable Sir.\"\n\n\"Monks, that old jackal is afflicted by a type of disease called *ukkaṇḍaka*. He finds no peace when he is inside his burrow, he finds no peace at the foot of a tree, and he finds no peace in the open air. Wherever he goes, wherever he stands, wherever he sits, wherever he lies down; there he meets misfortune and calamity.\"\n\n\"Just so, monks, a certain monk here, overcome by gain, honor, and fame, and with his mind utterly consumed, finds no peace when he is inside a solitary dwelling, he finds no peace at the foot of a tree, and he finds no peace in the open air. Wherever he goes, wherever he stands, wherever he sits, wherever he lies down; there he meets misfortune and calamity. So cruel and terrible, monks, is gain, honor, and fame... Thus, monks, you must train yourselves.\"",
      "sinhala": "සැවැත්නුවර වැඩවෙසෙති...\n\n\"මහණෙනි, ලාභ සත්කාර කීර්තිය ඉතා දරුණු ය... (එය) අධිගමයක් ලබා ගැනීමට බාධා කරයි. මහණෙනි, රාත්‍රියේ අලුයම් වේලාවේදී ජරාවට පත් සිඟාලයෙකු කෑගසනවා ඔබට ඇසුණේ නැද්ද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, ඒ ජරාවට පත් සිඟාල තෙමේ උක්කණ්ඪක නම් වූ රෝග වර්ගයකින් පෙළී සිටී. ඌ ගුලට ගොස් සතුටු නොවෙයි, ගස් මුලට ගොස් සතුටු නොවෙයි, එළිමහනට ගොස් සතුටු නොවෙයි. ඌ යම් යම් තැනකට යන්නේ ද, යම් යම් තැනක සිටින්නේ ද, යම් යම් තැනක හිඳින්නේ ද, යම් යම් තැනක හො වන්නේ ද; ඒ ඒ තන්හිදී විනාශයට හා විපතට පත්වේ. මහණෙනි, එපරිද්දෙන්ම මෙහි ඇතැම් භික්ෂුවක් ලාභ සත්කාර කීර්තිය නිසා යටපත් කරනු ලැබූ සිත් ඇත්තේ, සම්පූර්ණයෙන්ම වටලාගත් සිතක් ඇත්තේ, ශූන්‍යාගාරයකට ගොස් සතුටු නොවෙයි, ගස් මුලකට ගොස් සතුටු නොවෙයි, එළිමහනකට ගොස් සතුටු නොවෙයි. ඒ භික්ෂුව යම් යම් තැනකට යන්නේ ද, යම් යම් තැනක සිටින්නේ ද, යම් යම් තැනක හිඳින්නේ ද, යම් යම් තැනක හො වන්නේ ද; ඒ ඒ තන්හිදී විනාශයට හා විපතට පත්වේ. මහණෙනි, ලාභ සත්කාර කීර්තිය ඉතාමත් දරුණු වන්නේ එසේය... මහණෙනි, ඔබ විසින් මෙසේ හික්මිය යුතු වන්නේය.\" අටවැනි සූත්‍රයයි.",
      "paliTitle": "Siṅgālasuttaṃ"
    },
    {
      "number": 165,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Upari, bhikkhave, ākāse verambhā [verambā (sī. pī.)] nāma vātā vāyanti. Tattha yo pakkhī gacchati tamenaṃ verambhā vātā khipanti. Tassa verambhavātakkhittassa aññeneva pādā gacchanti, aññena pakkhā gacchanti, aññena sīsaṃ gacchati, aññena kāyo gacchati. Evameva kho, bhikkhave, idhekacco bhikkhu lābhasakkārasilokena abhibhūto pariyādiṇṇacitto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena, anupaṭṭhitāya satiyā, asaṃvutehi indriyehi. So tattha passati mātugāmaṃ dunnivatthaṃ vā duppārutaṃ vā. Tassa mātugāmaṃ disvā dunnivatthaṃ vā duppārutaṃ vā rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena sikkhaṃ paccakkhāya hīnāyāvattati. Tassa aññe cīvaraṃ haranti, aññe pattaṃ haranti, aññe nisīdanaṃ haranti, aññe sūcigharaṃ haranti, verambhavātakkhittasseva sakuṇassa. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ.",
      "english": "Monks, harsh is gain, honor, and fame; they are detrimental to the attainment of the goal. Monks, high up in the sky, winds called storm winds blow. A bird flying there—these storm winds fling it about. When that bird is flung about by the storm winds, its legs go in one direction, its wings go in another, its head goes in another, and its body goes in yet another.\n\nJust so, Monks, in this teaching, some monk is overwhelmed by gain, honor, and fame, with his mind completely seized. In the morning, having dressed, taking his bowl and robe, he enters a village or town for alms, with unguarded body, unguarded speech, and unguarded mind, with mindfulness unestablished, and with unrestrained senses. There he sees a woman who is poorly clothed or poorly covered. Seeing that woman who is poorly clothed or poorly covered, lust contaminates his mind. With his mind contaminated by lust, he renounces the training and turns back to the lower state. Some carry off his robe, others carry off his bowl, others carry off his sitting cloth, others carry off his needle case, just like the bird flung about by the storm winds. So harsh indeed, Monks, is gain, honor, and fame. Thus indeed, Monks, you should train yourselves.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක... [පෙ]... \"මහණෙනි, ලාභ, සත්කාර, කීර්තිය යනු දරුණු දෙයකි... [පෙ]... (උසස් ධර්ම) අවබෝධය පිණිස (බාධාවකි). මහණෙනි, ඉහළ අහසේ වේරම්භ නම් වූ කුණාටු සුළං හමා යයි. එහි යන කුරුල්ලෙකු වේරම්භ සුළං විසින් විසි කරනු ලැබේ. එම වේරම්භ සුළඟින් විසි කරන ලද කුරුල්ලාගේ පාද එක් දිශාවකට යයි, පියාපත් තවත් දිශාවකට යයි, හිස තවත් දිශාවකට යයි, ශරීරය තවත් දිශාවකට යයි.\n\nමහණෙනි, එපරිද්දෙන්ම මෙහි ඇතැම් භික්ෂුවක් ලාභ, සත්කාර, කීර්තිය විසින් යටපත් කරනු ලැබ, සිත පරියදීර්ණ වී, පෙරවරු කාලයේ සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන, නොරැක්කා වූ කයින්, නොරැක්කා වූ වචනයෙන්, නොරැක්කා වූ සිතින්, නොපිහිටුවන ලද සිහියෙන්, නොසංවර කළ ඉන්ද්‍රියයන්ගෙන් යුතුව ගමකට හෝ නියම්ගමකට හෝ පිණ්ඩපාතය පිණිස පිවිසේ. ඔහු එහිදී යටත් සේ හැඳ හෝ යටත් සේ පොරවා සිටින ස්ත්‍රියක් දකී. යටත් සේ හැඳ හෝ පොරවා සිටින එම ස්ත්‍රිය දැකීමෙන් රාගය විසින් ඔහුගේ සිත කිලිටි කරනු ලැබේ. ඔහු රාගයෙන් දූෂණය කරන ලද සිතින් ශික්ෂාව (පැවිදි බව) ප්‍රතික්ෂේප කර, පිරිහීමට (හීනාවර්තයට) පැමිණේ. වේරම්භ සුළඟින් විසි කරන ලද කුරුල්ලාගේ මෙන්, සමහරු ඔහුගේ සිවුර ගෙන යති, සමහරු පාත්‍රය ගෙන යති, සමහරු නිසීදනය (හිඳින ඇතිරිල්ල) ගෙන යති, සමහරු ඉඳිකටු ගෙය ගෙන යති. මහණෙනි, ලාභ, සත්කාර, කීර්තිය යනු මෙසේ දරුණු දෙයකි... [පෙ]... මහණෙනි, ඔබ විසින් මෙසේම පුහුණු විය යුතුයි.",
      "paliTitle": "Verambhasuttaṃ"
    },
    {
      "number": 166,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ passāmi sakkārena abhibhūtaṃ pariyādiṇṇacittaṃ, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannaṃ. Idha panāhaṃ, bhikkhave, ekaccaṃ puggalaṃ passāmi asakkārena abhibhūtaṃ pariyādiṇṇacittaṃ, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannaṃ. Idha panāhaṃ, bhikkhave, ekaccaṃ puggalaṃ passāmi sakkārena ca asakkārena ca tadubhayena abhibhūtaṃ pariyādiṇṇacittaṃ, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Yassa sakkariyamānassa, asakkārena cūbhayaṃ; Samādhi na vikampati, appamāṇavihārino [appamādavihārino (pī. ka.) appamāṇoti hettha phalasamādhi, na sati]. ‘‘Taṃ jhāyinaṃ sātatikaṃ, sukhumaṃ diṭṭhivipassakaṃ; Upādānakkhayārāmaṃ, āhu sappuriso itī’’ti. dasamaṃ; Paṭhamo vaggo. Tassuddānaṃ – Dāruṇo baḷisaṃ kummaṃ, dīghalomi ca mīḷhakaṃ; Asani diddhaṃ siṅgālaṃ, verambhena sagāthakanti.",
      "english": "Harsh is this gain, honor, and fame, Monks; it obstructs the attainment (of the goal). Here, Monks, I see a certain individual whose mind is utterly consumed, overcome by honor, who, upon the breakup of the body, after death, reappears in the plane of misery, the unfortunate destination, in ruin, in hell.\n\nBut here, Monks, I also see a certain individual whose mind is utterly consumed, overcome by dishonor, who, upon the breakup of the body, after death, reappears in the plane of misery, the unfortunate destination, in ruin, in hell.\n\nFurthermore, here, Monks, I see a certain individual whose mind is utterly consumed, overcome by both honor and dishonor, who, upon the breakup of the body, after death, reappears in the plane of misery, the unfortunate destination, in ruin, in hell.\n\nThus, Monks, so harsh is this gain, honor, and fame… this is how you must train yourselves, Monks.\n\nThe Blessed One spoke this. Having said this, the Fortunate One, the Teacher, further spoke the following:\n\nHe whose concentration does not waver, even when being honored or dishonored—by either of the two—because he dwells in immeasurable steadiness;\n\nThat meditator, constantly diligent, who sees subtlely through insight, and whose delight is in the destruction of clinging—they call him a true noble person.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ ශ්‍රාවස්තියෙහි වැඩවසන සේක.\n\nමහණෙනි, ලාභ, සත්කාර, කීර්ති ප්‍රශංසා යනු ඉතා දරුණු (භයානක) වෙයි. එය යහපත් ධර්මයන් අවබෝධ කර ගැනීම පිණිස බාධාවකි. මහණෙනි, මෙහිදී මම එක්තරා පුද්ගලයකු දකිමි. හෙතෙම සත්කාරයන් විසින් යටපත් කරනු ලැබූ, සිත් මුළුමනින්ම ග්‍රහණය කරගත් අයෙකි. හෙතෙම කය බිඳී යාමෙන්, මරණින් මතු අපාය, දුර්ගති, විනිපාත නම් වූ නිරයෙහි උපදී.\n\nමහණෙනි, එහෙත් මම මෙහිදී තවත් එක්තරා පුද්ගලයකු දකිමි. හෙතෙම අසත්කාරයන් විසින් යටපත් කරනු ලැබූ, සිත් මුළුමනින්ම ග්‍රහණය කරගත් අයෙකි. හෙතෙම කය බිඳී යාමෙන්, මරණින් මතු අපාය, දුර්ගති, විනිපාත නම් වූ නිරයෙහි උපදී.\n\nමහණෙනි, එහෙත් මම මෙහිදී තවත් එක්තරා පුද්ගලයකු දකිමි. හෙතෙම සත්කාරයෙන් ද, අසත්කාරයෙන් ද යන උභය කරුණෙන්ම යටපත් කරනු ලැබූ, සිත් මුළුමනින්ම ග්‍රහණය කරගත් අයෙකි. හෙතෙම කය බිඳී යාමෙන්, මරණින් මතු අපාය, දුර්ගති, විනිපාත නම් වූ නිරයෙහි උපදී.\n\nමහණෙනි, ලාභ, සත්කාර, කීර්ති ප්‍රශංසා යනු මෙපමණට දරුණු වෙයි. එබැවින් මහණෙනි, තොප විසින් මෙසේ හික්මිය යුත්තේය.\n\nභාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක. මේ කාරණය වදාරා සුගත වූ ශාස්තෘවරයාණෝ තවදුරටත් මෙය දේශනා කළ සේක:\n\nයමෙකුට සත්කාර කරනු ලබන විට ද, අසත්කාර කරනු ලබන විට ද යන දෙකෙහිම දී සිතේ සමාධිය සැලෙන්නේ නැද්ද, හෙතෙම අප්‍රමාණ ධර්මයක (සමාධියක) වාසය කරන්නෙකි.\n\nඒ භාවනාවේ නිරත වූ, නිරතුරුව වඩන, සියුම් වූ, ප්‍රඥාවෙන් දකින, උපාදානයන්ගේ ක්ෂය වීමෙහි ඇලී සිටින පුද්ගලයා යහපත් සත්පුරුෂයෙකැයි කියනු ලැබේ.\n\n(මෙය දස වන සූත්‍රයයි. පළමුවන වග්ගයයි.)",
      "paliTitle": "Sagāthakasuttaṃ"
    },
    {
      "number": 167,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… adhigamāya. Idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘na cāyamāyasmā suvaṇṇapātiyāpi rūpiyacuṇṇaparipūrāya hetu sampajānamusā bhāseyyā’ti. Tamenaṃ passāmi aparena samayena lābhasakkārasilokena abhibhūtaṃ pariyādiṇṇacittaṃ sampajānamusā bhāsantaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "(The Bhagavā) resides at Sāvatthī… Harmful, O monks, is gain, homage, and fame, even leading to [the failure of] attainment. Herein, O monks, I know and comprehend the mind of a certain individual with my own mind, thinking: ‘This venerable one would not speak a deliberate falsehood even for the sake of a bowl filled entirely with gold powder and silver powder.’\n\nBut then, after some time, I see that very person overpowered by gain, homage, and fame, with his mind utterly consumed, speaking a deliberate falsehood. So harmful indeed, O monks, is gain, homage, and fame… Thus, O monks, you must train yourselves.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ (ZWJ) සා​ව​ත්ථි​යෙ​හි වා​ස​ය ක​ර​න සේ​ක.\n\nමහ​ණෙ​නි, ලා​භ​ය, ස​ත්කා​ර​ය සහ කීර්ති​ය අ​ති​ශ​ය දා​රු​ණ ස්ව​භා​ව​ය​කි; එය උ​තුම් ධර්ම​යන්ගේ අධි​ග​ම​ය පි​ණි​ස බා​ධ​ක​යකි. මහ​ණෙ​නි, මේ ශා​ස​න​ය​යෙහි මම ඇතැම් පු​ද්ග​ල​යෙ​කු​ගේ සි​ත, මගේ චේ​ත​සින් ප​රි​ක්​ෂා ක​ර, මෙ​සේ ද​නි​මි: ‘මේ ආ​යු​ෂ්ම​ත්​ව​ර​යා රන් පා​ත්‍ර​ය​ක් රි​දී කු​ඩු​ව​ලින් පු​ර​වා ලැ​බී​ම පි​ණි​ස වත්, සිතා​ම​තා බො​රු නො​කි​ය​නු ඇ​ත.’\n\nඑ​හෙ​ත්, ප​සු​කා​ල​යෙ​ක, ලා​භ​ය, ස​ත්කා​ර​ය සහ කීර්ති​ය හමුවේ අ​භි​භ​ව​නය වී, සි​ත දූ​ෂ්‍ය වී ගො​ස්, ඔහු සි​තා​ම​තා බො​රු කියන අ​යු​රු මම ද​කි​මි. මහ​ණෙ​නි, ලා​භ​ය, ස​ත්කා​ර​ය සහ කීර්ති​ය එ​ප​ම​ණ දා​රු​ණ ය; එය උ​තුම් ධර්ම​යන්ගේ අධි​ග​ම​ය පි​ණි​ස බා​ධ​ක​යකි. එ​බැ​වි​න්, මහ​ණෙ​නි, ඔබ​ලා සි​ක්​ෂා​ව ලැ​පි​ය යු​ත්තේ මේ අ​යු​රි​න්​ය.\n\nපළ​මු​වෙ​නි.",
      "paliTitle": "Suvaṇṇapātisuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 168,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘na cāyamāyasmā rūpiyapātiyāpi suvaṇṇacuṇṇaparipūrāya hetu sampajānamusā bhāseyyā’ti. Tamenaṃ passāmi aparena samayena lābhasakkārasilokena abhibhūtaṃ pariyādiṇṇacittaṃ sampajānamusā bhāsantaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Monastics, hard is gain, honor, and renown. Here, monastics, I penetrate the mind of a certain individual with my own mind and understand: ‘This venerable one would not intentionally speak falsehood even for the sake of a bowl full of silver coins, or a bowl filled completely with gold dust.’ Yet, subsequently, I observe that very person, overwhelmed by gain, honor, and renown, his mind utterly captured, speaking intentional falsehood. Thus hard, indeed, monastics, is gain, honor, and renown. In this way, monastics, must you train yourselves.",
      "sinhala": "ශ්‍රා​වස්ති නුවර වැඩසිටින සේක.\n\nමහණෙනි, ලාභ සත්කාර කීර්ති ප්‍රශංසා යනු දරුණු දෙයකි. මහණෙනි, මෙහිලා මම ඇතැම් පුද්ගලයෙකුගේ සිත මෙසේ මාගේ සිතින් පිරිසිඳ දැනගනිමි – ‘මේ ආයුෂ්මත් රිදී භාජනයක් හෝ රන් කුඩු වලින් පිරුණු භාජනයක් හේතුකොටගෙන හෝ දැන දැන මුසාවාද නොකරනු ඇත.’\n\nපසුව මම ඔහු, ලාභ සත්කාර කීර්ති ප්‍රශංසා විසින් යටපත් කරනු ලැබූ, සිත මුළුමනින්ම ග්‍රහණයට ගනු ලැබූ පුද්ගලයෙකු වශයෙන්, දැන දැන මුසාවාද කරනු ලබනවා දකිමි. මහණෙනි, ලාභ සත්කාර කීර්ති ප්‍රශංසා යනු මෙතරම්ම දරුණු දෙයකි.\n\nමහණෙනි, ඒ නිසා ඔබලා විසින් මෙසේ හික්මිය යුතු වන්නේ ය.\nදෙවෙනි සූත්‍රය අවසන් විය.",
      "paliTitle": "Rūpiyapātisuttaṃ"
    },
    {
      "number": 169,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘na cāyamāyasmā suvaṇṇanikkhassāpi hetu…pe… suvaṇṇanikkhasatassāpi hetu… siṅgīnikkhassāpi hetu… siṅgīnikkhasatassāpi hetu… pathaviyāpi jātarūpaparipūrāya hetu… āmisakiñcikkhahetupi… jīvitahetupi… janapadakalyāṇiyāpi hetu sampajānamusā bhāseyyā’ti. Tamenaṃ passāmi aparena samayena lābhasakkārasilokena abhibhūtaṃ pariyādiṇṇacittaṃ sampajānamusā bhāsantaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Dasamaṃ. Dutiyo vaggo. Tassuddānaṃ – Dve pāti dve suvaṇṇā ca, siṅgīhi apare duve; Pathavī kiñcikkhajīvitaṃ, janapadakalyāṇiyā dasāti.",
      "english": "The Blessed One was residing at Sāvatthī.\n\n“Here, Monks, having encompassed the mind of a certain individual with my own mind, I understand thus: ‘This venerable one would not knowingly speak a falsehood, even for the sake of a single gold coin, nor for the sake of a hundred gold coins, nor for the sake of a coin of finest gold, nor for the sake of a hundred coins of finest gold, nor for the sake of the entire earth filled with gold, nor for the sake of any trivial material gain, nor for the sake of life itself, nor even for the sake of the most beautiful woman in the land.’\n\n“Nevertheless, Monks, later I see that person, overcome by gain, honor, and fame, with his mind entirely consumed, knowingly speaking a falsehood. Thus severe, Monks, is gain, honor, and fame. Therefore, Monks, you should train yourselves in this way.”",
      "sinhala": "සැවැත්නුවර වැඩවාසය කරන සේක.\n\nමහණෙනි, මෙහිලා මම ඇතැම් පුද්ගලයෙකුගේ සිත මෙසේ මාගේ සිතින් පිරිසිඳ දැනගනිමි: ‘මේ ආයුෂ්මත් තෙම රන් නිස්කයක් නිසා වත්... රන් නිස්ක සියයක් නිසා වත්... සිංගී රන් නිස්කයක් නිසා වත්... සිංගී රන් නිස්ක සියයක් නිසා වත්... රත්‍රන් වලින් පිරුණු මුළු මහ පොළොව නිසා වත්... යම්කිසි සුළු ආමිසයක් නිසා වත්... ජීවිතය නිසා වත්... ජනපදයක සුන්දර ස්ත්‍රියක් නිසා වත්... දැන දැන මුසා බස් නොදෙඩන්නේ ය’ යනුයි. මම ඒ පුද්ගලයා වෙනත් කලෙක ලාභ සත්කාර කීර්තියෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍රහණය කරගත්, දැන දැන මුසා බස් දොඩනු දකිමි. මහණෙනි, ලාභ සත්කාර කීර්තිය මෙසේ දරුණු ය... එහෙයින් මහණෙනි, ඔබ විසින් මෙසේ හික්මිය යුතු වන්නේ ය.\n\nදස වන සූත්‍රයයි. දෙ වන වර්ගයයි. එහි උද්දානය (සූත්‍ර නාම සාරාංශය): පාත්‍ර දෙකක් ද, රන් දෙකක් ද, සිංගී රන් ගැන අනෙක් දෙකක් ද; පෘථිවිය, සුළු ආමිසය, ජීවිතය, සහ ජනපද කල්‍යාණිය යි දසයකි.",
      "paliTitle": "Suvaṇṇanikkhasuttādiaṭṭhakaṃ"
    },
    {
      "number": 170,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… na tassa, bhikkhave, mātugāmo eko ekassa cittaṃ pariyādāya tiṭṭhati yassa lābhasakkārasiloko cittaṃ pariyādāya tiṭṭhati. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko …pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "The Blessed One was residing at Sāvatthī.\n\n“Monastics, gain, honor, and renown are perilous. The mind of that person, monastics, which has been seized and overwhelmed by gain, honor, and renown, is not seized and overwhelmed by a single woman. Indeed, monastics, gain, honor, and renown are thus perilous. Therefore, monastics, you should train yourselves in this way.”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක... (පෙ)... \"මහණෙනි, ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසා ඉතා දරුණු ය... (පෙ)... මහණෙනි, යමෙකුගේ සිත ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසාවන් විසින් මුළුමණින්ම වසඟ කරගෙන සිටින්නේද, එවැන්නෙකුගේ සිත එක් ස්ත්‍රියකට තනිව මුළුමණින්ම අල්වාගෙන සිටිය නොහැක. මහණෙනි, ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසාවෝ මෙසේ දරුණු වන්නාහ... (පෙ)... මහණෙනි, ඔබ විසින් මෙසේම හික්මිය යුතු වන්නේය.\" පළමුවැන්නයි.",
      "paliTitle": "Mātugāmasuttaṃ",
      "vagga": "Tatiyavaggo"
    },
    {
      "number": 171,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… na tassa, bhikkhave, janapadakalyāṇī ekā ekassa cittaṃ pariyādāya tiṭṭhati yassa lābhasakkārasiloko cittaṃ pariyādāya tiṭṭhati. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "[He was] dwelling near Sāvatthī… “Gain, honor, and fame, monks, are ruthless… Monks, a single regional beauty standing alone does not consume the mind of a person, as gain, honor, and fame consume the mind of one who is attached to them. So ruthless, indeed, monks, is gain, honor, and fame… Therefore, monks, you must train yourselves in this way.”",
      "sinhala": "සැවැත් නුවර වැඩසිටින සේක. \"මහණෙනි, ලාභ-සත්කාර-කීර්තිය ඉතා දරුණු ය. මහණෙනි, යම් පුද්ගලයකුගේ සිත ලාභ-සත්කාර-කීර්තිය විසින් මුළුමනින්ම යටපත් කරගෙන සිටින්නේද, එක් ජනපද කල්යාණියක් (රටේ සුරූපීම ස්ත්‍රියක්) විසින් වුවද එක් පුරුෂයකුගේ සිත එසේ මුළුමනින්ම යටපත් කරගෙන සිටින්නට සමත් නොවෙයි.\n\nමහණෙනි, ලාභ-සත්කාර-කීර්තිය මෙසේ ඉතාම දරුණු ය. එබැවින් මහණෙනි, නුඹලා විසින් මෙසේම ශික්ෂණය පුහුණු කළ යුතු ය.\"",
      "paliTitle": "Kalyāṇīsuttaṃ"
    },
    {
      "number": 172,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… saddhā, bhikkhave, upāsikā ekaputtakaṃ piyaṃ manāpaṃ evaṃ sammā āyācamānā āyāceyya – ‘tādiso, tāta, bhavāhi yādiso citto ca gahapati hatthako ca āḷavako’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvakānaṃ upāsakānaṃ, yadidaṃ citto ca gahapati hatthako ca āḷavako. Sace kho tvaṃ, tāta, agārasmā anagāriyaṃ pabbajasi; tādiso, tāta, bhavāhi yādisā sāriputtamoggallānāti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvakānaṃ bhikkhūnaṃ, yadidaṃ sāriputtamoggalānā. Mā ca kho tvaṃ, tāta, sekhaṃ appattamānasaṃ lābhasakkārasiloko anupāpuṇātūti. Tañce, bhikkhave, bhikkhuṃ sekhaṃ appattamānasaṃ lābhasakkārasiloko anupāpuṇāti, so tassa hoti antarāyāya. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Tatiyaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthi... Monks, the acquisition of gain, honor, and fame is dreadful... Monks, a faithful female lay follower, wishing truly and rightly for her only beloved and pleasing son, would make this wish: ‘My dear son, may you be like Citta the householder and Hatthaka of Āḷavī.’ This, monks, is the balance, this is the measure, for my lay disciples, namely, Citta the householder and Hatthaka of Āḷavī.\n\nBut if you, my dear son, go forth from the household life into the homeless life, may you be like Sāriputta and Moggallāna. This, monks, is the balance, this is the measure, for my bhikkhu disciples, namely, Sāriputta and Moggallāna. And may gain, honor, and fame not overtake you, my dear son, while you are a trainee whose mind has not yet reached the goal.\n\nIf, monks, gain, honor, and fame overtake such a bhikkhu, who is a trainee whose mind has not yet reached the goal, that becomes an obstacle for him. Thus dreadful indeed, monks, is gain, honor, and fame... Thus, monks, should you train.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ ශ්‍රාවස්තියෙහි වැඩ වෙසෙන සේක. භික්ෂූනි, ලාභ සත්කාර හා කීර්ති ප්‍රශංසා දරුණු ය...\n\nභික්ෂූනි, යම් ශ්‍රද්ධාවන්ත උපාසිකාවක් තමාගේ එකම පුත්‍රයාට, ප්‍රිය මනාප පුත්‍රයාට නිවැරදි ලෙසින් මෙසේ ආයාචනා කළ හැකි ය— \"දරුව, ඔබ චිත්ත ගෘහපති සහ ආළවක හත්ථක යන දෙදෙනා වැනි කෙනෙකු වන්න.\"\n\nභික්ෂූනි, මේය මාගේ උපාසක ශ්‍රාවකයන්ගේ තරාදිය වන්නේ, මේය ඔවුන්ගේ ප්‍රමාණය වන්නේ. එනම් චිත්ත ගෘහපති සහ ආළවක හත්ථක යි.\n\n\"දරුව, ඔබ ගිහි ගෙයින් නික්ම අනගාරිකත්වයට පැවිදි වන්නේ නම්, දරුව, ඔබ ශාරිපුත්‍ර හා මහාමුද්ගල්‍යාන යන තෙරුන් වහන්සේලා වැනි කෙනෙකු වන්න.\"\n\nභික්ෂූනි, මේය මාගේ භික්ෂු ශ්‍රාවකයන්ගේ තරාදිය වන්නේ, මේය ඔවුන්ගේ ප්‍රමාණය වන්නේ. එනම් ශාරිපුත්‍ර හා මහාමුද්ගල්‍යාන තෙරුන් වහන්සේලා යි.\n\n\"දරුව, සිත තවම අර්හත්වය නොලැබූ ශික්ෂා කරන (සෙඛ) පුද්ගලයා ලාභ සත්කාර හා කීර්ති ප්‍රශංසා විසින් යටපත් නොකරත්වා!\"\n\nභික්ෂූනි, යම් හෙයකින් සිත තවම අර්හත්වය නොලැබූ ශික්ෂා කරන භික්ෂුව ලාභ සත්කාර හා කීර්ති ප්‍රශංසා විසින් යටපත් කරන්නේ නම්, එය ඔහුට බාධාවක් වන්නේ ය.\n\nභික්ෂූනි, ලාභ සත්කාර හා කීර්ති ප්‍රශංසා මෙසේ දරුණු ය... එහෙයින්, භික්ෂූනි, ඔබ මෙසේ හික්මිය යුතු වන්නේ ය.",
      "paliTitle": "Ekaputtakasuttaṃ"
    },
    {
      "number": 173,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko…pe… saddhā bhikkhave upāsikā ekaṃ dhītaraṃ piyaṃ manāpaṃ evaṃ sammā āyācamānā āyāceyya – ‘tādisā, ayye, bhavāhi yādisā khujjuttarā ca upāsikā veḷukaṇḍakiyā [veḷukaṇḍakī (sī. chakkaṅguttarepi)] ca nandamātā’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvikānaṃ upāsikānaṃ, yadidaṃ khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā. Sace kho tvaṃ, ayye, agārasmā anagāriyaṃ pabbajasi; tādisā, ayye, bhavāhi yādisā khemā ca bhikkhunī uppalavaṇṇā cāti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvikānaṃ bhikkhunīnaṃ, yadidaṃ khemā ca bhikkhunī uppalavaṇṇā ca. Mā ca kho tvaṃ, ayye, sekhaṃ appattamānasaṃ lābhasakkārasiloko anupāpuṇātūti. Taṃ ce, bhikkhave, bhikkhuniṃ sekhaṃ appattamānasaṃ lābhasakkārasiloko anupāpuṇāti, so tassā hoti antarāyāya. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Catutthaṃ.",
      "english": "[The Bhagavā] was dwelling at Sāvatthī... Gain, honor, and fame are terrible, Monks... A faithful laywoman, Monks, if she were rightly requesting something of a dear and pleasing daughter, should make this request: ‘Dear one, be such a person as the lay followers Khujjuttarā and Nandamātā of Veḷukaṇḍaka are.’\n\nThis, Monks, is the scale, this is the measure for my female lay disciples: namely, the lay followers Khujjuttarā and Nandamātā of Veḷukaṇḍaka. ‘If, dear one, you go forth from the household life into homelessness, be such a person as the nuns Khemā and Uppalavaṇṇā are.’ This, Monks, is the scale, this is the measure for my female monastic disciples: namely, the nuns Khemā and Uppalavaṇṇā. ‘And, dear one, may gain, honor, and fame not overwhelm you while you are still a learner whose heart has not yet attained the goal.’\n\nFor, Monks, if gain, honor, and fame overwhelm that nun who is a learner, whose heart has not attained the goal, it becomes an obstacle for her. Thus terrible, indeed, Monks, are gain, honor, and fame... This is how you should train yourselves, Monks.",
      "sinhala": "සැවැත්නුවර වාසය කරන සේක... (පෙ)... \"මහණෙනි, ලාභ සත්කාර කීර්තිය ඉතා දරුණු ය... (පෙ)...\"\n\nමහණෙනි, ශ්‍රද්ධාවන්ත උපාසිකාවක් තමාගේ එක් ප‍්‍රිය මනාප දියණියකගෙන් මෙසේ නිවැරදිව ඉල්ලා සිටින්නට පුළුවන – ‘දුවේ, ඔබ කුජ්ජුත්තරා උපාසිකාව හා වේළුකණ්ඩකී නන්දමාතාව වැනි කෙනෙක් වන්න’ කියා. මහණෙනි, කුජ්ජුත්තරා උපාසිකාවද, වේළුකණ්ඩකී නන්දමාතාවද යන මේ දෙදෙනා මාගේ ශ්‍රාවක උපාසිකාවන් සඳහා ඇති තුලාවද, ප්‍රමාණයද වෙති.\n\nදුවේ, ඔබ ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වන්නී නම්, ඔබ ඛේමා භික්ෂුණිය සහ උප‍්පලවණ්ණා භික්ෂුණිය වැනි කෙනෙක් වන්න. මහණෙනි, ඛේමා භික්ෂුණිය සහ උප‍්පලවණ්ණා භික්ෂුණිය යන මේ දෙදෙනා මාගේ ශ්‍රාවක භික්ෂුණීන් සඳහා ඇති තුලාවද, ප්‍රමාණයද වෙති. දුවේ, සේඛ භූමියේ සිටින, අධිගමයට නොපැමිණි සිත් ඇති ඔබට ලාභ සත්කාර කීර්තිය පැමිණ නොගන්නට වගබලා ගන්න.\n\nමහණෙනි, යම් හෙයකින් සේඛ භූමියේ සිටින, අධිගමයට නොපැමිණි සිත් ඇති ඒ භික්ෂුණියට ලාභ සත්කාර කීර්තිය පැමිණ ගන්නේ නම්, එය ඇයට බාධාවක් වන්නේ ය. මහණෙනි, ලාභ සත්කාර කීර්තිය මෙසේ ඉතා දරුණු ය... (පෙ)... මහණෙනි, ඔබලා විසින් මෙසේ හික්මිය යුත්තේ ය.",
      "paliTitle": "Ekadhītusuttaṃ"
    },
    {
      "number": 174,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā lābhasakkārasilokassa assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti, na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca pana te āyasmantā sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā lābhasakkārasilokassa assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānanti, te ca kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Pañcamaṃ.",
      "english": "Monks, whatever recluses or Brahmins there may be who do not truly understand—as they actually are—the gratification, the danger, and the escape regarding gain, honor, and fame:\n\nFor me, monks, these are neither true recluses nor true Brahmins; nor are they considered true recluses among recluses, or true Brahmins among Brahmins. Moreover, those venerable ones do not dwell having personally realized and attained—through direct knowledge in this very life—the goal of recluseship or the goal of Brahmaship.\n\nBut monks, whatever recluses or Brahmins there may be who truly understand—as they actually are—the gratification, the danger, and the escape regarding gain, honor, and fame:\n\nFor me, monks, these are indeed true recluses and true Brahmins; and they are considered true recluses among recluses, and true Brahmins among Brahmins. Moreover, those venerable ones dwell having personally realized and attained—through direct knowledge in this very life—both the goal of recluseship and the goal of Brahmaship.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත්නුවර වැඩවසන සේක.\n\n“මහණෙනි, යම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසාවෙහි ආශ්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් (යථාභූතව) නොදනිත්ද, මහණෙනි, ඔවුන් මා විසින් ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙසද නොසලකනු ලැබේ. තවද, ඒ ආයුෂ්මතුන් වහන්සේලා ශ්‍රමණත්වයේ අර්ථය හෝ බ්‍රාහ්මණත්වයේ අර්ථය හෝ මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් (අභිඥාවෙන්) සාක්‍ෂාත්කොට, එයට පැමිණ වාසය නොකරති.\n\nයම්කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසාවෙහි ආශ්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් (යථාභූතව) දනිත්ද, මහණෙනි, ඔවුහු මා විසින් ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙසද සලකනු ලබති. තවද, ඒ ආයුෂ්මතුන් වහන්සේලා ශ්‍රමණත්වයේ අර්ථයද බ්‍රාහ්මණත්වයේ අර්ථයද මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් (අභිඥාවෙන්) සාක්‍ෂාත්කොට, එයට පැමිණ වාසය කරති.”",
      "paliTitle": "Samaṇabrāhmaṇasuttaṃ"
    },
    {
      "number": 175,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā lābhasakkārasilokassa samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti…pe… pajānanti…pe… sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Chaṭṭhaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthi...\n\n\"Monks, whatsoever ascetics or brahmins do not rightly understand, as it truly is, the origin, the passing away, the gratification, the danger, and the escape concerning gain, honor, and renown... they do not rightly understand...\n\n...but whosoever do understand, having realized and verified it themselves through direct higher knowledge, they abide having attained it.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත්නුවර වැඩවසන සේක.\n\n    “මහණෙනි, යම්කිසි ශ්‍රමණ (ZWJ: ශ්‍රමණ) හෝ බ්‍රාහ්මණ (ZWJ: බ්‍රාහ්මණ) කෙනෙක් ලාභ, සත්කාර හා කීර්ති ප්‍රශංසාවෙහි සමුදය (හේතු), අත්ථඞ්ගම (නැතිවීම), ආස්වාද (තෘප්තිය), ආදීනව (අන්තරාය) සහ නිස්සරණය (මුදවා ගැනීම) යථාභූතව නොදනිත් ද, ඔවුහු (බුදුසසුනෙන් බැහැර වූ) ශ්‍රමණ (ZWJ: ශ්‍රමණ) හෝ බ්‍රාහ්මණ (ZWJ: බ්‍රාහ්මණ) භාවයෙහි පල නොලබති.\n\n    යම්කිසි ශ්‍රමණ (ZWJ: ශ්‍රමණ) හෝ බ්‍රාහ්මණ (ZWJ: බ්‍රාහ්මණ) කෙනෙක් ලාභ, සත්කාර හා කීර්ති ප්‍රශංසාවෙහි සමුදය, අත්ථඞ්ගම, ආස්වාද, ආදීනව සහ නිස්සරණය යථාභූතව දනිත් ද; ඔවුහු ශ්‍රමණ (ZWJ: ශ්‍රමණ) හෝ බ්‍රාහ්මණ (ZWJ: බ්‍රාහ්මණ) භාවයෙහි පල ලබා, තමන් විසින්ම විශේෂ ඥානයෙන් (අභිඥාවෙන්) සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරති.”",
      "paliTitle": "Dutiyasamaṇabrāhmaṇasuttaṃ"
    },
    {
      "number": 176,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā lābhasakkārasilokaṃ yathābhūtaṃ nappajānanti, lābhasakkārasilokasamudayaṃ nappajānanti, lābhasakkārasilokanirodhaṃ nappajānanti, lābhasakkārasilokanirodhagāminiṃ paṭipadaṃ nappajānanti …pe… pajānanti…pe… sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Sattamaṃ.",
      "english": "[He was] residing at Sāvatthī… “Bhikkhus, whatever recluses or brahmins do not truly understand gain, honor, and fame, do not understand the origin of gain, honor, and fame, do not understand the cessation of gain, honor, and fame, and do not understand the practice leading to the cessation of gain, honor, and fame… [whereas those who] do understand… they abide, having realized it themselves through direct knowledge.”",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක.\n\n\"මහණෙනි, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ වෙත් නම්, ඔවුහු ලාභ, සත්කාර සහ කීර්තිය යථාභූත ලෙස නොදනිත් නම්, ලාභ, සත්කාර සහ කීර්තියේ හටගැනීම නොදනිත් නම්, ලාභ, සත්කාර සහ කීර්තියේ නිරෝධය නොදනිත් නම්, ලාභ, සත්කාර සහ කීර්තියේ නිරෝධය පිණිස පවත්නා ප්‍රතිපදාව නොදනිත් නම්... යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ වෙත් නම්, ඔවුහු ලාභ, සත්කාර සහ කීර්තිය යථාභූත ලෙස දනිත් නම්, ලාභ, සත්කාර සහ කීර්තියේ හටගැනීම දනිත් නම්, ලාභ, සත්කාර සහ කීර්තියේ නිරෝධය දනිත් නම්, ලාභ, සත්කාර සහ කීර්තියේ නිරෝධය පිණිස පවත්නා ප්‍රතිපදාව දනිත් නම්, ඔවුහු තමන් විසින්ම විශේෂ ඥානයෙන් (අභිඥාවෙන්) අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරති.\"",
      "paliTitle": "Tatiyasamaṇabrāhmaṇasuttaṃ"
    },
    {
      "number": 177,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko. Lābhasakkārasiloko, bhikkhave, chaviṃ chindati, chaviṃ chetvā cammaṃ chindati, cammaṃ chetvā maṃsaṃ chindati, maṃsaṃ chetvā nhāruṃ chindati, nhāruṃ chetvā aṭṭhiṃ chindati, aṭṭhiṃ chetvā aṭṭhimiñjaṃ āhacca tiṭṭhati. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo bhikkhave, sikkhitabba’’nti. Aṭṭhamaṃ.",
      "english": "Gain, honor, and renown, O monks, are harsh.\n\nGain, honor, and renown, O monks, cut the outer skin. Having cut the outer skin, they cut the inner hide. Having cut the inner hide, they cut the flesh. Having cut the flesh, they cut the sinews. Having cut the sinews, they cut the bone. Having cut the bone, they stand striking the very bone marrow.\n\nTruly, O monks, gain, honor, and renown are thus harsh. Therefore, O monks, this is how you must train yourselves.",
      "sinhala": "මහණෙනි, ලාභ, සත්කාර සහ කීර්තිය දරුණු ය. මහණෙනි, ලාභ, සත්කාර සහ කීර්තිය බාහිර සම සිඳින්නේ ය, බාහිර සම සිඳ, අභ්‍යන්තර සම සිඳින්නේ ය, අභ්‍යන්තර සම සිඳ, මාංශය සිඳින්නේ ය, මාංශය සිඳ, ස්නායු සිඳින්නේ ය, ස්නායු සිඳ, ඇටය සිඳින්නේ ය, ඇටය සිඳ, ඇටමිදුළු ද ආක්‍රමණය කරමින් පවතින්නේ ය. මහණෙනි, ලාභ, සත්කාර සහ කීර්තිය එපරිද්දෙන්ම දරුණු ය. එහෙයින් මහණෙනි, ඔබ විසින් මෙසේ පුහුණු විය යුතු ය.",
      "paliTitle": "Chavisuttaṃ"
    },
    {
      "number": 178,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko. Lābhasakkārasiloko, bhikkhave, chaviṃ chindati, chaviṃ chetvā cammaṃ chindati, cammaṃ chetvā maṃsaṃ chindati, maṃsaṃ chetvā nhāruṃ chindati, nhāruṃ chetvā aṭṭhiṃ chindati, aṭṭhiṃ chetvā aṭṭhimiñjaṃ āhacca tiṭṭhati’’. ‘‘Seyyathāpi, bhikkhave, balavā puriso daḷhāya vāḷarajjuyā jaṅghaṃ veṭhetvā ghaṃseyya. Sā chaviṃ chindeyya, chaviṃ chetvā cammaṃ chindeyya, cammaṃ chetvā maṃsaṃ chindeyya, maṃsaṃ chetvā nhāruṃ chindeyya, nhāruṃ chetvā aṭṭhiṃ chindeyya, aṭṭhiṃ chetvā aṭṭhimiñjaṃ āhacca tiṭṭheyya. Evameva kho, bhikkhave, lābhasakkārasiloko chaviṃ chindati, chaviṃ chetvā cammaṃ chindati, cammaṃ chetvā maṃsaṃ chindati, maṃsaṃ chetvā nhāruṃ chindati, nhāruṃ chetvā aṭṭhiṃ chindati, aṭṭhiṃ chetvā aṭṭhiṃmiñjaṃ āhacca tiṭṭhati. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ.",
      "english": "Gain, honor, and fame, O Monks, are fierce. Gain, honor, and fame, O Monks, pierce the outer skin; having pierced the outer skin, they sever the inner skin; having severed the inner skin, they cut the flesh; having cut the flesh, they cut the sinews; having cut the sinews, they cut the bone; having cut the bone, they strike upon and settle in the bone marrow.\n\nJust as, O Monks, a strong man might wrap a strong rope made of leather around the thigh and rub it. That rope would pierce the outer skin; having pierced the outer skin, it would sever the inner skin; having severed the inner skin, it would cut the flesh; having cut the flesh, it would cut the sinews; having cut the sinews, it would cut the bone; having cut the bone, it would strike upon and settle in the bone marrow.\n\nIn the same way, O Monks, gain, honor, and fame pierce the outer skin; having pierced the outer skin, they sever the inner skin; having severed the inner skin, they cut the flesh; having cut the flesh, they cut the sinews; having cut the sinews, they cut the bone; having cut the bone, they strike upon and settle in the bone marrow. So fierce indeed, O Monks, is gain, honor, and fame. Therefore, O Monks, this is how you must train yourselves.",
      "sinhala": "සැවැත්නුවර වැඩවාසය කරණ සේක. මහණෙනි, ලාභ, සත්කාර හා කීර්තිය දරුණු ය. මහණෙනි, ලාභ, සත්කාර හා කීර්තිය සම සිදුරු කරයි. සම සිදුරු කොට සම් පටලය සිදුරු කරයි. සම් පටලය සිදුරු කොට මස් සිදුරු කරයි. මස් සිදුරු කොට නහර සිදුරු කරයි. නහර සිදුරු කොට ඇට සිදුරු කරයි. ඇට සිදුරු කොට ඇට මිදුළු හා ගැටී එහි පිහිටයි.\n\nමහණෙනි, යම් සේ ද, බලවත් පුරුෂයෙක් ශක්තිමත් හම් පටකින් කලවා වෙළා දරුණුව අතුල්ලන්නේ ය. ඒ හම් පටය සම සිදුරු කරයි. සම සිදුරු කොට සම් පටලය සිදුරු කරයි. සම් පටලය සිදුරු කොට මස් සිදුරු කරයි. මස් සිදුරු කොට නහර සිදුරු කරයි. නහර සිදුරු කොට ඇට සිදුරු කරයි. ඇට සිදුරු කොට ඇට මිදුළු හා ගැටී එහි පිහිටන්නේ ය.\n\nමහණෙනි, ඒ අයුරින්ම ය, ලාභ, සත්කාර හා කීර්තිය සම සිදුරු කරයි. සම සිදුරු කොට සම් පටලය සිදුරු කරයි. සම් පටලය සිදුරු කොට මස් සිදුරු කරයි. මස් සිදුරු කොට නහර සිදුරු කරයි. නහර සිදුරු කොට ඇට සිදුරු කරයි. ඇට සිදුරු කොට ඇට මිදුළු හා ගැටී එහි පිහිටයි. මහණෙනි, ලාභ, සත්කාර හා කීර්තිය මෙසේ දරුණු ය. එබැවින් මහණෙනි, නුඹලා මෙසේ හික්මිය යුතු ය.",
      "paliTitle": "Rajjusuttaṃ"
    },
    {
      "number": 179,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘yopi so, bhikkhave, bhikkhu arahaṃ khīṇāsavo tassapāhaṃ lābhasakkārasiloko antarāyāya vadāmī’’ti. Evaṃ vutte, āyasmā ānando bhagavantaṃ etadavoca – ‘‘kissa pana, bhante, khīṇāsavassa bhikkhuno lābhasakkārasiloko antarāyāyā’’ti? ‘‘Yā hissa sā, ānanda, akuppā cetovimutti nāhaṃ tassā lābhasakkārasilokaṃ antarāyāya vadāmi. Ye ca khvassa, ānanda, appamattassa ātāpino pahitattassa viharato diṭṭhadhammasukhavihārā adhigatā tesāhamassa lābhasakkārasilokaṃ antarāyāya vadāmi. Evaṃ dāruṇo kho, ānanda, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Tasmātihānanda, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhasakkārasilokaṃ pajahissāma, na ca no uppanno lābhasakkārasiloko cittaṃ pariyādāya ṭhassatī’ti. Evañhi vo, ānanda, sikkhitabba’’nti. Dasamaṃ. Tatiyo vaggo. Tassuddānaṃ – Mātugāmo ca kalyāṇī, putto ca ekadhītu ca; Samaṇabrāhmaṇā tīṇi, chavi rajju ca bhikkhunāti.",
      "english": "The Blessed One was dwelling in Sāvatthī. He addressed the monks, saying, \"Monks, even concerning that monk who is an Arahant, whose defilements are destroyed, I declare that gain, honor, and fame are an obstruction.\"\n\nWhen this was said, the venerable Ānanda asked the Blessed One, \"But why, Lord, is gain, honor, and fame an obstruction even to a monk whose defilements are destroyed?\"\n\n\"Ānanda, that unshakeable deliverance of mind which is his—I do not declare that gain, honor, and fame are an obstruction to that. But, Ānanda, concerning those pleasant abidings in this very life that he has achieved while dwelling diligent, ardent, and resolute—I declare that gain, honor, and fame are an obstruction to these. So dreadful, Ānanda, is gain, honor, and fame; it is bitter, harsh, and obstructive to the attainment of the unsurpassed security from bondage. Therefore, Ānanda, you should train yourselves thus: 'We shall abandon gain, honor, and fame when they arise, and when gain, honor, and fame arise, they shall not take possession of our minds.' That is how you must train yourselves, Ānanda.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත්නුවර වැඩ වාසය කරන සේක... (ඉතිරි කොටස පෙර සේ ම ය.)\n\nමහණෙනි, යම් ඒ භික්‍ෂුවක් අර්හත් වූ ක්‍ෂීණාශ්‍රව භික්‍ෂුවක් වේද, මම ඔහුට ද ලාභ සත්කාර කීර්ති ප්‍රශංසා බාධකයක් ලෙස කියමි.\n\nමෙසේ පැවසූ කල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ සැළ කළහ: \"ස්වාමීනි, ක්‍ෂීණාශ්‍රව භික්‍ෂුවකට නම් කුමකටද ලාභ සත්කාර කීර්ති ප්‍රශංසා බාධාවක් වන්නේ?\"\n\n\"ආනන්දය, යම් ඒ අචල වූ චේතෝවිමුක්තියක් ඔහුට ඇත්තේ ද, මම එයට නම් ලාභ සත්කාර කීර්ති ප්‍රශංසා බාධාවක් යැයි නොකියමි. ආනන්දය, නමුත් යම් ඒ අප්‍රමාදීව, වීර්යවත්ව, උත්සාහයෙන් වාසය කරන ඔහු විසින් මේ දැක්කා වූ ධර්මයෙහි ම සුව විහරණ අත්පත් කරගනු ලැබ ඇත්තේ ද, මම ඒ සුව විහරණවලට නම් ලාභ සත්කාර කීර්ති ප්‍රශංසා බාධාවක් යැයි කියමි. ආනන්දය, ලාභ සත්කාර කීර්ති ප්‍රශංසා මෙසේ දරුණු ය. එය කඨෝර ය, රළු ය, නිරුත්තර වූ යෝගක්‍ෂේමයට (නිවනට) පැමිණීමට බාධාවක් වන්නේ ය. එහෙයින් ආනන්දය, මෙසේ හික්මිය යුතු ය: 'ඇති වූ ලාභ සත්කාර කීර්ති ප්‍රශංසා දුරු කරන්නෙමු. ඇති වූ ලාභ සත්කාර කීර්ති ප්‍රශංසා අපගේ සිත මුළා කරගෙන නොසිටින්නේ ය' යනුවෙනි. ආනන්දය, නුඹලා විසින් මෙසේ හික්මිය යුතු ය.\"\n\nදසවෙනි සූත්‍රය යි. තෙවන වර්ගය යි. එහි උද්දානය මෙසේ ය: මාතෘගාම, කළ්‍යාණී, පුත්‍ර, එක දියණිය, සමණබ්‍රාහ්මණ සූත්‍ර තුනක්, ඡවි, රජ්ජු, භික්ඛුනී යනුවෙනි.",
      "paliTitle": "Bhikkhusuttaṃ"
    },
    {
      "number": 180,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko. Lābhasakkārasilokena abhibhūto pariyādiṇṇacitto, bhikkhave, devadatto saṅghaṃ bhindi. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… sikkhitabba’’nti. Paṭhamaṃ.",
      "english": "He was residing in Sāvatthī… Monks, gain, honor, and renown are dreadful. Monks, Devadatta, overcome by gain, honor, and renown, and with his mind completely seized, split the Community of Monks. Indeed, Monks, gain, honor, and renown are thus dreadful, and accordingly, training should be undertaken.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩසිටින සේක. පින්වත් මහණෙනි, ලාභ, සත්කාර හා කීර්තිය දරුණු ස්වභාවයෙන් යුක්ත ය. පින්වත් මහණෙනි, ලාභසත්කාර කීර්තියෙන් යටපත් කරන ලදුව, සිත මුළුමනින්ම ග්‍රහණයට ගත් දෙවදත්ත තෙමේ සංඝයා භේද කළේ ය. පින්වත් මහණෙනි, ලාභසත්කාර කීර්තිය මේ ආකාරයෙන් දරුණු ස්වභාවයෙන් යුක්ත ය. එබැවින් ඔබ විසින් මෙසේ හික්මිය යුතු ය.",
      "paliTitle": "Bhindisuttaṃ",
      "vagga": "Catutthavaggo"
    },
    {
      "number": 181,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko. Lābhasakkārasilokena abhibhūtassa pariyādiṇṇacittassa, bhikkhave, devadattassa kusalamūlaṃ samucchedamagamā. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Monks, gain, honor, and renown are devastating. Monks, because Devadatta was overwhelmed by gain, honor, and renown, and his mind was utterly consumed by them, his roots of wholesome action were entirely severed. So devastating, monks, is gain, honor, and renown, that... therefore, you must train yourselves accordingly.",
      "sinhala": "භික්‍ෂූන් වහන්ස, ලාභ, සත්කාර හා කීර්තිය දරුණු ය. භික්‍ෂූන් වහන්ස, ලාභ, සත්කාර හා කීර්තියෙන් යටපත් කරනු ලැබූ, සිත මුළුමනින්ම ග්‍රහණයට ගත් දේවදත්තගේ කුශලමූලයන් සම්පූර්ණයෙන්ම සිඳී ගියේ ය. භික්‍ෂූන් වහන්ස, සැබවින්ම ලාභ, සත්කාර හා කීර්තිය මේ ආකාරයෙන්ම දරුණු ය... (පෙ)... එබැවින් මේ ධර්මයන් පිළිබඳව ශික්‍ෂණය ලැබිය යුතු ය.",
      "paliTitle": "Kusalamūlasuttaṃ"
    },
    {
      "number": 182,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko. Lābhasakkārasilokena abhibhūtassa pariyādiṇṇacittassa, bhikkhave, devadattassa kusalo dhammo samucchedamagamā. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… sikkhitabba’’nti. Tatiyaṃ.",
      "english": "[The Blessed One was dwelling at Sāvatthī…]\n\nMonks, harsh is gain, honor, and renown. Monks, for Devadatta, whose mind was overcome and utterly consumed by gain, honor, and renown, the wholesome state of the Dhamma came to complete destruction.\n\nThus, monks, truly harsh is gain, honor, and renown… This is how one should train.",
      "sinhala": "මහණෙනි, ලාභ, සත්කාර සහ කීර්තිය දරුණු යි.\n\nමහණෙනි, ලාභ, සත්කාර සහ කීර්තිය විසින් යටපත් කරන ලද්දා වූ, (එයින්) සිත් මුළුමණින්ම ග්‍රහණය කරන ලද්දා වූ දේවදත්ත තෙරණුවන්ගේ කුසල ධර්මයෝ සම්පූර්ණයෙන්ම සිඳී ගියහ.\n\nමහණෙනි, ලාභ, සත්කාර සහ කීර්තිය මෙසේ දරුණු යි. (එබැවින්) මෙලෙසින් ම හික්මිය යුතු යි.",
      "paliTitle": "Kusaladhammasuttaṃ"
    },
    {
      "number": 183,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko. Lābhasakkārasilokena abhibhūtassa pariyādiṇṇacittassa, bhikkhave, devadattassa sukko dhammo samucchedamagamā. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… sikkhitabba’’nti. Catutthaṃ.",
      "english": "He dwells at Sāvatthī… Grievous, O bhikkhus, is gain, honor, and fame. Bhikkhus, for Devadatta, who was overcome by gain, honor, and fame, whose mind was utterly consumed, the pure wholesome qualities were entirely cut off and destroyed. So grievous indeed, O bhikkhus, is gain, honor, and fame; therefore, this teaching should be diligently practiced.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ ශ්‍රාවස්තියෙහි වැඩවසන සේක... (ආදි වශයෙන් වදාළහ)... භික්ෂූනි, ලාභ, සත්කාර, සහ කීර්තිය දරුණු ය.\n\nලාභ, සත්කාර, සහ කීර්තිය විසින් යටපත් කරනු ලැබූ, සිත් සතන් පිරිහෙළාගත් දේවදත්ත තෙමේගේ ශුක්ල ධර්මය මුළුමනින්ම සිඳී ගියේය.\n\nභික්ෂූනි, ලාභ, සත්කාර, සහ කීර්තිය මෙසේම දරුණු ය... එබැවින් මේ අන්තරාය ශික්ෂා කළ යුතු යි.",
      "paliTitle": "Sukkadhammasuttaṃ"
    },
    {
      "number": 184,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra kho bhagavā devadattaṃ ārabbha bhikkhū āmantesi – ‘‘attavadhāya, bhikkhave, devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi’’. ‘‘Seyyathāpi, bhikkhave, kadalī attavadhāya phalaṃ deti, parābhavāya phalaṃ deti; evameva kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi. ‘‘Seyyathāpi, bhikkhave, veḷu attavadhāya phalaṃ deti, parābhavāya phalaṃ deti; evameva kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi. ‘‘Seyyathāpi, bhikkhave, naḷo attavadhāya phalaṃ deti, parābhavāya phalaṃ deti; evameva kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi. ‘‘Seyyathāpi, bhikkhave, assatarī attavadhāya gabbhaṃ gaṇhāti, parābhavāya gabbhaṃ gaṇhāti; evameva kho, bhikkhave, attavadhāya devadattassa lābhasakkārasiloko udapādi, parābhavāya devadattassa lābhasakkārasiloko udapādi. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko. Evañhi vo, bhikkhave, sikkhitabba’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Phalaṃ ve kadaliṃ hanti, phalaṃ veḷuṃ phalaṃ naḷaṃ; Sakkāro kāpurisaṃ hanti, gabbho assatariṃ yathāti’’. pañcamaṃ;",
      "english": "On one occasion, the Blessed One was staying near Rājagaha, on Gijjhakūṭa Mountain, shortly after Devadatta had departed. There, the Blessed One addressed the bhikkhus concerning Devadatta, saying: \"Bhikkhus, the acquisition of gain, honor, and fame arose for Devadatta for his own ruin, for his own destruction and downfall.\"\n\n\"Just as, bhikkhus, the plantain tree produces fruit for its own ruin, produces fruit for its own downfall; even so, bhikkhus, the acquisition of gain, honor, and fame arose for Devadatta for his own ruin, and for his own destruction and downfall.\"\n\n\"Just as, bhikkhus, the bamboo produces fruit for its own ruin, produces fruit for its own downfall; even so, bhikkhus, the acquisition of gain, honor, and fame arose for Devadatta for his own ruin, and for his own destruction and downfall.\"\n\n\"Just as, bhikkhus, the reed produces fruit for its own ruin, produces fruit for its own downfall; even so, bhikkhus, the acquisition of gain, honor, and fame arose for Devadatta for his own ruin, and for his own destruction and downfall.\"\n\n\"Just as, bhikkhus, the female mule conceives a fetus for its own ruin, conceives a fetus for its own downfall; even so, bhikkhus, the acquisition of gain, honor, and fame arose for Devadatta for his own ruin, and for his own destruction and downfall.\"\n\n\"So destructive, bhikkhus, is the acquisition of gain, honor, and fame. Thus, bhikkhus, you should train yourselves.\" The Blessed One said this. Having said this, the Well-Gone One, the Teacher, spoke further: \"The fruit surely destroys the plantain, the fruit destroys the bamboo, the fruit destroys the reed; honor destroys the worthless person, just as the fetus destroys the mule.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ දේවදත්ත තෙමේ නොබෝ කලකට පෙර නික්ම ගිය පසු රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වාසය කරති.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ දේවදත්තයා අරභයා භික්ෂූන් ඇමතූ සේක: “මහණෙනි, දේවදත්තයාට ලාභ, සත්කාර, ප්‍රශංසා ඇතිවීම තමාගේ විනාශය පිණිස ම විය. දේවදත්තයාගේ පිරිහීම පිණිස ම විය.”\n\n“මහණෙනි, යම් සේ කෙසෙල් ගස තමාගේ විනාශය පිණිස ඵල දරන්නේ ද, පිරිහීම පිණිස ඵල දරන්නේ ද; එපරිද්දෙන් ම මහණෙනි, දේවදත්තයාට ලාභ, සත්කාර, ප්‍රශංසා ඇතිවීම තමාගේ විනාශය පිණිස ම විය, පිරිහීම පිණිස ම විය. “මහණෙනි, යම් සේ උණ ගස තමාගේ විනාශය පිණිස ඵල දරන්නේ ද, පිරිහීම පිණිස ඵල දරන්නේ ද; එපරිද්දෙන් ම මහණෙනි, දේවදත්තයාට ලාභ, සත්කාර, ප්‍රශංසා ඇතිවීම තමාගේ විනාශය පිණිස ම විය, පිරිහීම පිණිස ම විය. “මහණෙනි, යම් සේ නළ උණ ගස තමාගේ විනාශය පිණිස ඵල දරන්නේ ද, පිරිහීම පිණිස ඵල දරන්නේ ද; එපරිද්දෙන් ම මහණෙනි, දේවදත්තයාට ලාභ, සත්කාර, ප්‍රශංසා ඇතිවීම තමාගේ විනාශය පිණිස ම විය, පිරිහීම පිණිස ම විය. “මහණෙනි, යම් සේ කුරංගදෙන තමාගේ විනාශය පිණිස ගැබ් ගන්නේ ද, පිරිහීම පිණිස ගැබ් ගන්නේ ද; එපරිද්දෙන් ම මහණෙනි, දේවදත්තයාට ලාභ, සත්කාර, ප්‍රශංසා ඇතිවීම තමාගේ විනාශය පිණිස ම විය, පිරිහීම පිණිස ම විය. මහණෙනි, ලාභ, සත්කාර, ප්‍රශංසා මෙසේ දරුණු ය. මහණෙනි, එහෙයින් මේ කරුණ අනුව තොප විසින් හික්මිය යුතු යි.”\n\nභාග්‍යවතුන් වහන්සේ මේ වදාළ සේක. සුගතයන් වහන්සේ මෙය වදාරා තවදුරටත් ශාස්තෲන් වහන්සේ මෙසේ වදාළ සේක: “සැබැවින් ම ඵලය කෙසෙල් ගස නසන්නේ ය, ඵලය උණ ගස ද, ඵලය නළ උණ ද නසන්නේ ය. ගැබ කුරංගදෙන නසන පරිද්දෙන්, සත්කාරය දුෂ්පුද්ගලයා නසන්නේ ය.”",
      "paliTitle": "Acirapakkantasuttaṃ"
    },
    {
      "number": 185,
      "pali": "Rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena devadattassa ajātasattukumāro pañcahi rathasatehi sāyaṃ pātaṃ upaṭṭhānaṃ gacchati, pañca ca thālipākasatāni bhattābhihāro abhiharīyati. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘devadattassa, bhante, ajātasattukumāro pañcahi rathasatehi sāyaṃ pātaṃ upaṭṭhānaṃ gacchati, pañca ca thālipākasatāni bhattābhihāro abhiharīyatī’’ti. ‘‘Mā, bhikkhave, devadattassa lābhasakkārasilokaṃ pihayittha. Yāvakīvañca, bhikkhave, devadattassa ajātasattukumāro pañcahi rathasatehi sāyaṃ pātaṃ upaṭṭhānaṃ gamissati, pañca ca thālipākasatāni bhattābhihāro āharīyissati, hāniyeva, bhikkhave, devadattassa pāṭikaṅkhā kusalesu dhammesu, no vuddhi’’. ‘‘Seyyathāpi, bhikkhave, caṇḍassa kukkurassa nāsāya pittaṃ bhindeyyuṃ, evañhi so, bhikkhave, kukkuro bhiyyosomattāya caṇḍataro assa; evameva, bhikkhave, yāvakīvañca devadattassa ajātasattukumāro pañcahi rathasatehi sāyaṃ pātaṃ upaṭṭhānaṃ gamissati, pañca ca thālipākasatāni bhattābhihāro āharīyissati, hāniyeva, bhikkhave, devadattassa pāṭikaṅkhā kusalesu dhammesu, no vuddhi. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko…pe… evañhi vo, bhikkhave, sikkhitabba’’nti. Chaṭṭhaṃ.",
      "english": "The Bhagavā was dwelling at Rājagaha, in the Bamboo Grove, in the Squirrels’ Sanctuary. Now at that time, Prince Ajātasattu would go to attend upon Devadatta morning and evening with five hundred chariots, and five hundred meals cooked in pots were regularly brought as food offerings. Then, a number of monks approached the Bhagavā. Having approached and paid homage to the Bhagavā, they sat down to one side. As they were seated to one side, those monks said this to the Bhagavā: “Venerable Sir, Prince Ajātasattu goes to attend upon Devadatta morning and evening with five hundred chariots, and five hundred meals cooked in pots are regularly brought as food offerings.”\n\n“Monks, do not envy the gain, honor, and fame of Devadatta. For as long as Prince Ajātasattu continues to go to attend upon Devadatta morning and evening with five hundred chariots, and five hundred meals cooked in pots continue to be brought as offerings, monks, only decline is to be expected for Devadatta in wholesome mental qualities, not growth.”\n\n“Just as, monks, if one were to burst a gall-bladder into the nostrils of a fierce dog, that dog would thereby become even more fierce; in the same way, monks, for as long as Prince Ajātasattu continues to go to attend upon Devadatta morning and evening with five hundred chariots, and five hundred meals cooked in pots continue to be brought as offerings, only decline is to be expected for Devadatta in wholesome mental qualities, not growth. So terrible, monks, is gain, honor, and fame. . . Thus, monks, you should train yourselves.”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ (ZWJ: භාග්‍යවතුන්) රජගහ නුවර, වේළුවනාරාමය නම් වූ කලන්දක නිවාප නම් ස්ථානයේ වැඩ වාසය කළ සේක.\n\nඉතා සත්‍ය වශයෙන්ම, එසමයෙහි අජාතශත්‍රැ කුමාරයා විසින් දේවදත්ත තෙරුන්ට පන්සීයක් රථ සමගින් සැන්දෑවේත්, උදෑසනේත් උපස්ථාන පිණිස යන්නේය. තවද, පන්සීයක් බත් ආහාර පූජාවන් ද (දිනපතා) ගෙනෙන ලද්දේය. ඉන්පසු, බොහෝ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට ගෞරව කොට වැඳ, එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩ සිටි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට මෙය සැළ කළහ: “ස්වාමීනි, අජාතශත්‍රැ කුමාරයා විසින් දේවදත්ත තෙරුන්ට පන්සීයක් රථ සමගින් සැන්දෑවේත්, උදෑසනේත් උපස්ථාන පිණිස යන්නේය. තවද, පන්සීයක් බත් ආහාර පූජාවන් ද ගෙනෙන ලද්දේය.”\n\n(භාග්‍යවතුන් වහන්සේ වදාළ සේක:) “මහණෙනි, දේවදත්ත තෙරුන් ලැබූ ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසා කෙරෙහි ඊර්ෂ්‍යා නොකරන්න. මහණෙනි, යම්තාක් කල් අජාතශත්‍රැ කුමාරයා විසින් දේවදත්ත තෙරුන්ට පන්සීයක් රථ සමගින් සැන්දෑවේත්, උදෑසනේත් උපස්ථාන පිණිස යන්නේද, පන්සීයක් බත් ආහාර පූජාවන් ද ගෙනෙන ලද්දේද, (ඒ හේතුවෙන්) දේවදත්ත තෙරුන්ට කුශල ධර්මයන්හි (ZWJ: ධර්මය) දියුණුවක් නොව, පිරිහීමක්ම අපේක්‍ෂා (ZWJ: අපේක්‍ෂා) කළ යුතුය.”\n\n“මහණෙනි, යම් සේ දරුණු බල්ලෙකුගේ නාසය තුළට පිත්තාශය බිඳ දැමුවහොත්, ඒ බල්ලා ඉන් වැඩි වශයෙන්ම දරුණු වන්නේද; එලෙසින්ම, මහණෙනි, යම්තාක් කල් අජාතශත්‍රැ කුමාරයා විසින් දේවදත්ත තෙරුන්ට පන්සීයක් රථ සමගින් සැන්දෑවේත්, උදෑසනේත් උපස්ථාන පිණිස යන්නේද, පන්සීයක් බත් ආහාර පූජාවන් ද ගෙනෙන ලද්දේද, (ඒ හේතුවෙන්) දේවදත්ත තෙරුන්ට කුශල ධර්මයන්හි දියුණුවක් නොව, පිරිහීමක්ම අපේක්‍ෂා කළ යුතුය. මහණෙනි, ලාභ සත්කාර කීර්ති ප්‍රශංසා යනු මෙසේ ඉතා දරුණු වන්නේය. ... (ඒ නිසා) මහණෙනි, ඔබ විසින් මෙසේම හික්මිය යුතුය.”",
      "paliTitle": "Pañcarathasatasuttaṃ"
    },
    {
      "number": 186,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘na cāyamāyasmā mātupi hetu sampajānamusā bhāseyyā’ti. Tamenaṃ passāmi aparena samayena lābhasakkārasilokena abhibhūtaṃ pariyādiṇṇacittaṃ sampajānamusā bhāsantaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhasakkārasilokaṃ pajahissāma. Na ca no uppanno lābhasakkārasiloko cittaṃ pariyādāya ṭhassatī’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ.",
      "english": "Fierce, O monks, are gain, homage, and fame; they are bitter, rough, and an obstruction to the attainment of the unsurpassed security from bondage.\n\nHere, O monks, I observe the mind of a certain individual, encompassing it with my own mind, and I understand: ‘This venerable one would not speak a known, deliberate falsehood, even for the sake of his mother.’ Yet, later, I see that very person—overcome by gain, homage, and fame, his mind completely seized—speaking a deliberate falsehood. So fierce, indeed, O monks, are gain, homage, and fame; they are bitter, rough, and an obstruction to the attainment of the unsurpassed security from bondage.\n\nTherefore, O monks, this is how you must train: ‘We shall abandon the gain, homage, and fame that has arisen. And gain, homage, and fame that has arisen shall not remain, having completely seized our minds.’ Thus, O monks, you must train.",
      "sinhala": "මහණෙනි, ලාභ, සත්කාර හා කීර්තිය දරුණු ය, කටුක ය, රළු ය, අනුත්තර වූ යෝගක්‍ෂේමයට පැමිණීම සඳහා අන්තරායකර ය.\n\nමහණෙනි, මෙහිලා මම ඇතැම් පුද්ගලයෙකුගේ සිත, මගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ ආයුෂ්මත් තෙම මවගේ කරුණාව නිසා වුව ද දැන දැන මුසාවක් නොකියන්නේ ය’ යනුවෙනි.\n\nඑහෙත්, පසුව ඇතැම් අවස්ථාවක දී ලාභ, සත්කාර හා කීර්තියෙන් යටපත් වූ, සිත මුළුමනින්ම ග්‍රහණය කරගත් ඔහු, දැන දැන මුසා බස් කියනු මම දකිමි.\n\nමහණෙනි, ලාභ, සත්කාර හා කීර්තිය එතරම් දරුණු ය, කටුක ය, රළු ය, අනුත්තර වූ යෝගක්‍ෂේමයට පැමිණීම සඳහා අන්තරායකර ය.\n\nඑබැවින්, මහණෙනි, මෙසේ හික්මිය යුතු ය: ‘උපන් ලාභ, සත්කාර හා කීර්තිය අපි ප්‍රහාණය කරන්නෙමු. උපන් ලාභ, සත්කාර හා කීර්තිය අපගේ සිත නතු කරගෙන නොසිටින්නේ ය’ යනුවෙනි.\n\nමහණෙනි, ඔබ විසින් මෙසේ හික්මිය යුතු ම ය.",
      "paliTitle": "Mātusuttaṃ"
    },
    {
      "number": 187,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dāruṇo, bhikkhave, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Idhāhaṃ, bhikkhave, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘na cāyamāyasmā pitupi hetu…pe… bhātupi hetu… bhaginiyāpi hetu… puttassapi hetu… dhītuyāpi hetu… pajāpatiyāpi hetu sampajānamusā bhāseyyā’ti. Tamenaṃ passāmi aparena samayena lābhasakkārasilokena abhibhūtaṃ pariyādiṇṇacittaṃ sampajānamusā bhāsantaṃ. Evaṃ dāruṇo kho, bhikkhave, lābhasakkārasiloko kaṭuko pharuso antarāyiko anuttarassa yogakkhemassa adhigamāya. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhasakkārasilokaṃ pajahissāma, na ca no uppanno lābhasakkārasiloko cittaṃ pariyādāya ṭhassatī’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Terasamaṃ. Catuttho vaggo. Tassuddānaṃ – Bhindi mūlaṃ duve dhammā, pakkantaṃ ratha mātari; Pitā bhātā ca bhaginī, putto dhītā pajāpatīti. ",
      "english": "“Dreadful, monks, are gains, honor, and fame—bitter, harsh, and obstructive to the attainment of the unsurpassed security from bondage.\n\nHere, monks, I comprehend the mind of a certain person with my own mind, thinking: ‘This venerable one would not intentionally speak falsehood even for the sake of his father, brother, sister, son, daughter, or wife.’ But then I see that person later, overcome by gains, honor, and fame, their mind completely seized, intentionally speaking falsehood.\n\nThus dreadful indeed, monks, are gains, honor, and fame—bitter, harsh, and obstructive to the attainment of the unsurpassed security from bondage. Therefore, monks, this is how you must train yourselves: ‘We shall abandon the gains, honor, and fame that have arisen, and the arisen gains, honor, and fame shall not seize hold of our minds.’ Indeed, this is how you must train yourselves, monks.”",
      "sinhala": "සැවැත්නුවර වැඩවසන සේක...පෙ...\n\n“මහණෙනි, ලාභ, සත්කාර සහ කීර්ති ප්‍රශංසාව (සිලෝකය) දරුණු ය, කටුක ය, රළු ය. නිරුත්තර වූ යෝගක්‍ෂෙම ධර්මය (භව බන්ධනයෙන් මිදීම) අවබෝධ කර ගැනීම පිණිස එය අන්තරායකර යි. මහණෙනි, මෙහිලා මම එක්තරා පුද්ගලයෙකුගේ සිත චෛතසික ඥානයෙන් විමසා මෙසේ දනිමි: ‘මේ ආයුෂ්මත් පියාගේ හේතුවෙන් හෝ...පෙ... සහෝදරයාගේ හේතුවෙන් හෝ, සහෝදරියගේ හේතුවෙන් හෝ, පුතාගේ හේතුවෙන් හෝ, දුවගේ හේතුවෙන් හෝ, භාර්යාවගේ හේතුවෙන් හෝ දැන දැන මුසාවාද නොකියන්නේ ය’ යි. පසුව මම ඒ පුද්ගලයා දකිමි—ඔහු ලාභ, සත්කාර, කීර්ති ප්‍රශංසාවන් විසින් යටපත් කරනු ලැබ, ඔහුගේ සිත (ඒවායින්) ඇදගෙන, දැන දැන මුසාවාද කියමින් සිටින්නේ ය. මහණෙනි, ලාභ, සත්කාර, කීර්ති ප්‍රශංසාව එසේ දරුණු ය, කටුක ය, රළු ය. නිරුත්තර වූ යෝගක්‍ෂෙම ධර්මය අවබෝධ කර ගැනීම පිණිස එය අන්තරායකර යි.\n\nඑබැවින් මහණෙනි, මෙසේ හික්මිය යුතු ය: ‘හටගත් ලාභ, සත්කාර, කීර්ති ප්‍රශංසාවන් අපි අත්හරින්නෙමු. එසේම හටගත් ලාභ, සත්කාර, කීර්ති ප්‍රශංසාව අපගේ සිත ඇදගෙන නොපවතින්නේ ය’ යි. මහණෙනි, තොප විසින් මෙසේ හික්මිය යුතු ය.”\n\nදහතුන් වන සූත්‍රය යි. සිව්වන වර්ගය යි. එහි උද්දානය මෙසේ යි: භින්දි මූලං, දුවේ ධම්මා, පක්කන්තං, රථ, මාතරි, පිතා, භාතා, භගිනී, පුත්ත, ධීතා, පජාපතී යනු යි.",
      "paliTitle": "Pitusuttādichakkaṃ"
    }
  ],
  "footer": {
    "pali": "Lābhasakkārasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}