{
  "id": "sn.2.3",
  "title": {
    "pali": "Dhātusaṃyuttaṃ",
    "english": "The Connected Discourses on Elements",
    "sinhala": "ධාතු සංයුත්තං"
  },
  "sections": [
    {
      "number": 85,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ vo, bhikkhave, desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamañca, bhikkhave, dhātunānattaṃ? Cakkhudhātu rūpadhātu cakkhuviññāṇadhātu, sotadhātu saddadhātu sotaviññāṇadhātu, ghānadhātu gandhadhātu ghānaviññāṇadhātu, jivhādhātu rasadhātu jivhāviññāṇadhātu, kāyadhātu phoṭṭhabbadhātu kāyaviññāṇadhātu, manodhātu dhammadhātu manoviññāṇadhātu – idaṃ vuccati, bhikkhave, dhātunānatta’’nti. Paṭhamaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī.\n\"Bhikkhus, I shall teach you the diversity of elements. Listen to it, attend carefully; I shall speak.\"\n\"Yes, venerable sir,\" those bhikkhus replied to the Blessed One.\nThe Blessed One then said this: \"And what, bhikkhus, is the diversity of elements? The eye element, the visible form element, the eye-consciousness element; the ear element, the sound element, the ear-consciousness element; the nose element, the odor element, the nose-consciousness element; the tongue element, the taste element, the tongue-consciousness element; the body element, the tactile sensation element, the body-consciousness element; the mind element, the mind-object element, the mind-consciousness element – this, bhikkhus, is called the diversity of elements.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක.\n‘‘මහණෙනි, මම ඔබට ධාතු නානත්වය දේශනා කරන්නෙමි. ඒ අසා, මැනවින් මෙනෙහි කරව්. මම දේශනා කරන්නෙමි’’යි.\n‘‘වහන්ස, එසේයැයි’’ ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය.\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n‘‘මහණෙනි, ධාතු නානත්වය යනු කවරේද? චක්ඛුධාතු, රූපධාතු, චක්ඛු-විඤ්ඤාණධාතු; සෝතධාතු, සද්දධාතු, සෝත-විඤ්ඤාණධාතු; ඝානධාතු, ගන්ධධාතු, ඝාන-විඤ්ඤාණධාතු; ජිව්හාධාතු, රසධාතු, ජිව්හා-විඤ්ඤාණධාතු; කායධාතු, ඵොට්ඨබ්බධාතු, කාය-විඤ්ඤාණධාතු; මනෝධාතු, ධම්මධාතු, මනෝ-විඤ්ඤාණධාතු යනුයි. මහණෙනි, මේ ධාතු නානත්වය යැයි කියනු ලැබේ.’’",
      "paliTitle": "Dhātunānattasuttaṃ",
      "vagga": "Nānattavaggo",
      "englishTitle": "Diversity of Elements Sutta",
      "sinhalaTitle": "ධාතුනානත්ත සූත්‍රය",
      "vaggaEnglish": "Chapter on Diversity",
      "vaggaSinhala": "නානත්ත වර්ගය"
    },
    {
      "number": 86,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati phassanānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Cakkhudhātu sotadhātu ghānadhātu jivhādhātu kāyadhātu manodhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānattaṃ? Cakkhudhātuṃ, bhikkhave, paṭicca uppajjati cakkhusamphasso. Sotadhātuṃ paṭicca… ghānadhātuṃ paṭicca … jivhādhātuṃ paṭicca… kāyadhātuṃ paṭicca… manodhātuṃ paṭicca uppajjati manosamphasso. Evaṃ kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānatta’’nti. Dutiyaṃ.",
      "english": "The Blessed One was residing at Sāvatthī.\n\n\"Monks, dependent on the diversity of elements, the diversity of contact arises. And what, monks, is this diversity of elements? The eye-element, the ear-element, the nose-element, the tongue-element, the body-element, the mind-element – this, monks, is called the diversity of elements.\n\nAnd how, monks, does the diversity of contact arise dependent on the diversity of elements? Monks, dependent on the eye-element, eye-contact arises. Dependent on the ear-element, ear-contact arises. Dependent on the nose-element, nose-contact arises. Dependent on the tongue-element, tongue-contact arises. Dependent on the body-element, body-contact arises. Dependent on the mind-element, mind-contact arises. Thus, monks, dependent on the diversity of elements, the diversity of contact arises.\"",
      "sinhala": "සැවැත්නුවර වැඩවසන කල්හි...\n\nමහණෙනි, ධාතු නානාත්‍වය හේතු කොට ගෙන ඵස්ස නානාත්‍වය උපදී. මහණෙනි, කවර ධාතු නානාත්‍වයක්ද? චක්ඛු ධාතුව, සෝත ධාතුව, ඝාන ධාතුව, ජිව්හා ධාතුව, කාය ධාතුව, මනෝ ධාතුව – මහණෙනි, මෙය ධාතු නානාත්‍වය යැයි කියනු ලැබේ.\n\nමහණෙනි, කෙසේ නම් ධාතු නානාත්‍වය හේතු කොට ගෙන ඵස්ස නානාත්‍වය උපදීද? මහණෙනි, චක්ඛු ධාතුව හේතු කොට ගෙන චක්ඛු සම්ඵස්සය උපදී. සෝත ධාතුව හේතු කොට ගෙන සෝත සම්ඵස්සය උපදී. ඝාන ධාතුව හේතු කොට ගෙන ඝාන සම්ඵස්සය උපදී. ජිව්හා ධාතුව හේතු කොට ගෙන ජිව්හා සම්ඵස්සය උපදී. කාය ධාතුව හේතු කොට ගෙන කාය සම්ඵස්සය උපදී. මනෝ ධාතුව හේතු කොට ගෙන මනෝ සම්ඵස්සය උපදී. මහණෙනි, මෙසේ ධාතු නානාත්‍වය හේතු කොට ගෙන ඵස්ස නානාත්‍වය උපදී.\n\nදෙවෙනිය.",
      "paliTitle": "Phassanānattasuttaṃ",
      "englishTitle": "The Discourse on the Diversity of Contact",
      "sinhalaTitle": "ඵස්සනානත්ත සූත්‍රය"
    },
    {
      "number": 87,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati phassanānattaṃ, no phassanānattaṃ paṭicca uppajjati dhātunānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Cakkhudhātu…pe… manodhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānattaṃ, no phassanānattaṃ paṭicca uppajjati dhātunānattaṃ? Cakkhudhātuṃ, bhikkhave, paṭicca uppajjati cakkhusamphasso, no cakkhusamphassaṃ paṭicca uppajjati cakkhudhātu…pe… manodhātuṃ paṭicca uppajjati manosamphasso, no manosamphassaṃ paṭicca uppajjati manodhātu. Evaṃ kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānattaṃ, no phassanānattaṃ paṭicca uppajjati dhātunānatta’’nti. Tatiyaṃ.",
      "english": "Monks, dependent on the diversity of elements, there arises a diversity of contact, and not dependent on a diversity of contact does a diversity of elements arise. And what, monks, is the diversity of elements? The eye element, ear element, nose element, tongue element, body element, and mind element – this, monks, is called the diversity of elements. And how, monks, dependent on the diversity of elements does a diversity of contact arise, and not dependent on a diversity of contact does a diversity of elements arise? Monks, dependent on the eye element, eye-contact arises; not dependent on eye-contact does the eye element arise. Dependent on the ear element, ear-contact arises; not dependent on ear-contact does the ear element arise. Dependent on the nose element, nose-contact arises; not dependent on nose-contact does the nose element arise. Dependent on the tongue element, tongue-contact arises; not dependent on tongue-contact does the tongue element arise. Dependent on the body element, body-contact arises; not dependent on body-contact does the body element arise. Dependent on the mind element, mind-contact arises; not dependent on mind-contact does the mind element arise. It is in this way, monks, that dependent on the diversity of elements, a diversity of contact arises, and not dependent on a diversity of contact does a diversity of elements arise.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩසිටින සේක.\n\nමහණෙනි, ධාතු නානත්වය හේතු කොටගෙන ඵස්ස නානත්වය ඇතිවේ. ඵස්ස නානත්වය හේතු කොටගෙන ධාතු නානත්වය ඇතිනොවේ. මහණෙනි, ධාතු නානත්වය යනු කවරේද? චක්ඛු ධාතුව, සෝත ධාතුව, ඝාණ ධාතුව, ජිව්හා ධාතුව, කාය ධාතුව, මනෝ ධාතුව – මහණෙනි, මෙය ධාතු නානත්වය යැයි කියනු ලැබේ.\n\nමහණෙනි, කෙසේ නම් ධාතු නානත්වය හේතු කොටගෙන ඵස්ස නානත්වය ඇතිවේ ද? ඵස්ස නානත්වය හේතු කොටගෙන ධාතු නානත්වය ඇතිනොවේ ද? මහණෙනි, චක්ඛු ධාතුව හේතු කොටගෙන චක්ඛු සම්ඵස්සය ඇතිවේ, චක්ඛු සම්ඵස්සය හේතු කොටගෙන චක්ඛු ධාතුව ඇතිනොවේ. සෝත ධාතුව හේතු කොටගෙන සෝත සම්ඵස්සය ඇතිවේ, සෝත සම්ඵස්සය හේතු කොටගෙන සෝත ධාතුව ඇතිනොවේ. ඝාණ ධාතුව හේතු කොටගෙන ඝාණ සම්ඵස්සය ඇතිවේ, ඝාණ සම්ඵස්සය හේතු කොටගෙන ඝාණ ධාතුව ඇතිනොවේ. ජිව්හා ධාතුව හේතු කොටගෙන ජිව්හා සම්ඵස්සය ඇතිවේ, ජිව්හා සම්ඵස්සය හේතු කොටගෙන ජිව්හා ධාතුව ඇතිනොවේ. කාය ධාතුව හේතු කොටගෙන කාය සම්ඵස්සය ඇතිවේ, කාය සම්ඵස්සය හේතු කොටගෙන කාය ධාතුව ඇතිනොවේ. මනෝ ධාතුව හේතු කොටගෙන මනෝ සම්ඵස්සය ඇතිවේ, මනෝ සම්ඵස්සය හේතු කොටගෙන මනෝ ධාතුව ඇතිනොවේ. මහණෙනි, මෙසේ ධාතු නානත්වය හේතු කොටගෙන ඵස්ස නානත්වය ඇතිවේ. ඵස්ස නානත්වය හේතු කොටගෙන ධාතු නානත්වය ඇතිනොවේ.",
      "paliTitle": "Nophassanānattasuttaṃ",
      "englishTitle": "Non-Diversity of Contact Sutta",
      "sinhalaTitle": "නොඵස්සනානානත්ත සූත්‍රය"
    },
    {
      "number": 88,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati phassanānattaṃ, phassanānattaṃ paṭicca uppajjati vedanānānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Cakkhudhātu …pe… manodhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānattaṃ, phassanānattaṃ paṭicca uppajjati vedanānānattaṃ? Cakkhudhātuṃ, bhikkhave, paṭicca uppajjati cakkhusamphasso, cakkhusamphassaṃ paṭicca uppajjati cakkhusamphassajā vedanā…pe… manodhātuṃ paṭicca uppajjati manosamphasso, manosamphassaṃ paṭicca uppajjati manosamphassajā vedanā. Evaṃ kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānattaṃ, phassanānattaṃ paṭicca uppajjati vedanānānatta’’nti. Catutthaṃ.",
      "english": "Monastics, dependent on the diversity of elements, the diversity of contact arises; dependent on the diversity of contact, the diversity of feeling arises.\n\nAnd what, monastics, is the diversity of elements? The eye element, the ear element, the nose element, the tongue element, the body element, the mind element. This, monastics, is called the diversity of elements.\n\nAnd how, monastics, dependent on the diversity of elements, does the diversity of contact arise; and dependent on the diversity of contact, does the diversity of feeling arise? Dependent on the eye element, monastics, eye-contact arises; dependent on eye-contact, feeling born of eye-contact arises. Dependent on the ear element, ear-contact arises; dependent on ear-contact, feeling born of ear-contact arises. Dependent on the nose element, nose-contact arises; dependent on nose-contact, feeling born of nose-contact arises. Dependent on the tongue element, tongue-contact arises; dependent on tongue-contact, feeling born of tongue-contact arises. Dependent on the body element, body-contact arises; dependent on body-contact, feeling born of body-contact arises. Dependent on the mind element, mind-contact arises; dependent on mind-contact, feeling born of mind-contact arises.\n\nIn this way, monastics, dependent on the diversity of elements, the diversity of contact arises; and dependent on the diversity of contact, the diversity of feeling arises.",
      "sinhala": "සැවැත්නුවර වැඩ වාසය කරන භාග්‍‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළහ: \"මහණෙනි, ධාතු නානත්වය හේතු කොට ගෙන ඵස්ස නානත්වය හට ගනී. ඵස්ස නානත්වය හේතු කොට ගෙන වේදනා නානත්වය හට ගනී. මහණෙනි, කවර ධාතු නානත්වයක්ද? චක්ඛු ධාතුව, සෝත ධාතුව, ඝාණ ධාතුව, ජිව්හා ධාතුව, කාය ධාතුව, මනෝ ධාතුව – මහණෙනි, මෙය ධාතු නානත්වය යැයි කියනු ලැබේ.\"\n\n\"මහණෙනි, ධාතු නානත්වය හේතු කොට ගෙන ඵස්ස නානත්වයත්, ඵස්ස නානත්වය හේතු කොට ගෙන වේදනා නානත්වයත් කෙසේ හට ගනීද? මහණෙනි, චක්ඛු ධාතුව හේතු කොට ගෙන චක්ඛුසම්ඵස්සය හට ගනී. චක්ඛුසම්ඵස්සය හේතු කොට ගෙන චක්ඛුසම්ඵස්සය නිසා හටගන්නා වේදනාව හට ගනී. සෝත ධාතුව හේතු කොට ගෙන සෝතසම්ඵස්සය හට ගනී. සෝතසම්ඵස්සය හේතු කොට ගෙන සෝතසම්ඵස්සය නිසා හටගන්නා වේදනාව හට ගනී. ඝාණ ධාතුව හේතු කොට ගෙන ඝාණසම්ඵස්සය හට ගනී. ඝාණසම්ඵස්සය හේතු කොට ගෙන ඝාණසම්ඵස්සය නිසා හටගන්නා වේදනාව හට ගනී. ජිව්හා ධාතුව හේතු කොට ගෙන ජිව්හාසම්ඵස්සය හට ගනී. ජිව්හාසම්ඵස්සය හේතු කොට ගෙන ජිව්හාසම්ඵස්සය නිසා හටගන්නා වේදනාව හට ගනී. කාය ධාතුව හේතු කොට ගෙන කායසම්ඵස්සය හට ගනී. කායසම්ඵස්සය හේතු කොට ගෙන කායසම්ඵස්සය නිසා හටගන්නා වේදනාව හට ගනී. මනෝ ධාතුව හේතු කොට ගෙන මනෝසම්ඵස්සය හට ගනී. මනෝසම්ඵස්සය හේතු කොට ගෙන මනෝසම්ඵස්සය නිසා හටගන්නා වේදනාව හට ගනී. මහණෙනි, මෙලෙස ධාතු නානත්වය හේතු කොට ගෙන ඵස්ස නානත්වයත්, ඵස්ස නානත්වය හේතු කොට ගෙන වේදනා නානත්වයත් හට ගනී.\"",
      "paliTitle": "Vedanānānattasuttaṃ",
      "englishTitle": "The Discourse on the Diversity of Feelings",
      "sinhalaTitle": "වේදනානානත්ත සූත්‍රය"
    },
    {
      "number": 89,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati phassanānattaṃ, phassanānattaṃ paṭicca uppajjati vedanānānattaṃ, no vedanānānattaṃ paṭicca uppajjati phassanānattaṃ, no phassanānattaṃ paṭicca uppajjati dhātunānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Cakkhudhātu…pe… manodhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānattaṃ, phassanānattaṃ paṭicca uppajjati vedanānānattaṃ, no vedanānānattaṃ paṭicca uppajjati phassanānattaṃ, no phassanānattaṃ paṭicca uppajjati dhātunānattaṃ? Cakkhudhātuṃ, bhikkhave, paṭicca uppajjati cakkhusamphasso, cakkhusamphassaṃ paṭicca uppajjati cakkhusamphassajā vedanā, no cakkhusamphassajaṃ vedanaṃ paṭicca uppajjati cakkhusamphasso, no cakkhusamphassaṃ paṭicca uppajjati cakkhudhātu…pe… manodhātuṃ paṭicca uppajjati manosamphasso, manosamphassaṃ paṭicca uppajjati manosamphassajā vedanā, no manosamphassajaṃ vedanaṃ paṭicca uppajjati manosamphasso, no manosamphassaṃ paṭicca uppajjati manodhātu. Evaṃ kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati phassanānattaṃ, phassanānattaṃ paṭicca uppajjati vedanānānattaṃ, no vedanānānattaṃ paṭicca uppajjati phassanānattaṃ, no phassanānattaṃ paṭicca uppajjati dhātunānatta’’nti. Pañcamaṃ.",
      "english": "Monks, dependent on the diversity of elements, diversity of contact arises. Dependent on the diversity of contact, diversity of feeling arises. Diversity of contact does not arise dependent on the diversity of feeling. Diversity of elements does not arise dependent on the diversity of contact.\n\nAnd what, monks, is this diversity of elements? The eye-element, the ear-element, the nose-element, the tongue-element, the body-element, the mind-element – this, monks, is called the diversity of elements.\n\nAnd how, monks, does diversity of elements give rise to diversity of contact, and diversity of contact to diversity of feeling, while diversity of feeling does not give rise to diversity of contact, and diversity of contact does not give rise to diversity of elements?\n\nMonks, dependent on the eye-element, eye-contact arises. Dependent on eye-contact, feeling born of eye-contact arises. Eye-contact does not arise dependent on feeling born of eye-contact. The eye-element does not arise dependent on eye-contact. Dependent on the ear-element, ear-contact arises. Dependent on ear-contact, feeling born of ear-contact arises. Ear-contact does not arise dependent on feeling born of ear-contact. The ear-element does not arise dependent on ear-contact. Dependent on the nose-element, nose-contact arises. Dependent on nose-contact, feeling born of nose-contact arises. Nose-contact does not arise dependent on feeling born of nose-contact. The nose-element does not arise dependent on nose-contact. Dependent on the tongue-element, tongue-contact arises. Dependent on tongue-contact, feeling born of tongue-contact arises. Tongue-contact does not arise dependent on feeling born of tongue-contact. The tongue-element does not arise dependent on tongue-contact. Dependent on the body-element, body-contact arises. Dependent on body-contact, feeling born of body-contact arises. Body-contact does not arise dependent on feeling born of body-contact. The body-element does not arise dependent on body-contact. Dependent on the mind-element, mind-contact arises. Dependent on mind-contact, feeling born of mind-contact arises. Mind-contact does not arise dependent on feeling born of mind-contact. The mind-element does not arise dependent on mind-contact.\n\nThus, monks, dependent on the diversity of elements, diversity of contact arises. Dependent on the diversity of contact, diversity of feeling arises. Diversity of contact does not arise dependent on the diversity of feeling. Diversity of elements does not arise dependent on the diversity of contact.",
      "sinhala": "මහණෙනි, ධාතු නානාත්වය නිසා ස්පර්ශ නානාත්වය හටගනී. ස්පර්ශ නානාත්වය නිසා වේදනා නානාත්වය හටගනී. වේදනා නානාත්වය නිසා ස්පර්ශ නානාත්වය හට නොගනී. ස්පර්ශ නානාත්වය නිසා ධාතු නානාත්වය හට නොගනී.\n\nමහණෙනි, ධාතු නානාත්වය යනු කවරේද? ඇස් ධාතුව...පෙ... මනෝ ධාතුවයි. මහණෙනි, මෙය ධාතු නානාත්වයයි කියනු ලැබේ.\n\nමහණෙනි, ධාතු නානාත්වය නිසා ස්පර්ශ නානාත්වය හටගන්නේත්, ස්පර්ශ නානාත්වය නිසා වේදනා නානාත්වය හටගන්නේත්, වේදනා නානාත්වය නිසා ස්පර්ශ නානාත්වය හට නොගන්නේත්, ස්පර්ශ නානාත්වය නිසා ධාතු නානාත්වය හට නොගන්නේත් කෙසේද?\n\nමහණෙනි, ඇස් ධාතුව නිසා ඇස් ස්පර්ශය හටගනී. ඇස් ස්පර්ශය නිසා ඇස් ස්පර්ශයෙන් හටගන්නා වේදනාව හටගනී. ඇස් ස්පර්ශයෙන් හටගන්නා වේදනාව නිසා ඇස් ස්පර්ශය හට නොගනී. ඇස් ස්පර්ශය නිසා ඇස් ධාතුව හට නොගනී...පෙ... මනෝ ධාතුව නිසා මනෝ ස්පර්ශය හටගනී. මනෝ ස්පර්ශය නිසා මනෝ ස්පර්ශයෙන් හටගන්නා වේදනාව හටගනී. මනෝ ස්පර්ශයෙන් හටගන්නා වේදනාව නිසා මනෝ ස්පර්ශය හට නොගනී. මනෝ ස්පර්ශය නිසා මනෝ ධාතුව හට නොගනී.\n\nමහණෙනි, මෙසේ ධාතු නානාත්වය නිසා ස්පර්ශ නානාත්වය හටගනී. ස්පර්ශ නානාත්වය නිසා වේදනා නානාත්වය හටගනී. වේදනා නානාත්වය නිසා ස්පර්ශ නානාත්වය හට නොගනී. ස්පර්ශ නානාත්වය නිසා ධාතු නානාත්වය හට නොගනී.",
      "paliTitle": "Dutiyavedanānānattasuttaṃ",
      "englishTitle": "Second Sutta on the Diversity of Feelings",
      "sinhalaTitle": "දුතිය වේදනානානත්ත සූත්‍රය"
    },
    {
      "number": 90,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ vo, bhikkhave, desessāmi. Taṃ suṇātha…pe… katamañca, bhikkhave, dhātunānattaṃ? Rūpadhātu saddadhātu gandhadhātu rasadhātu phoṭṭhabbadhātu dhammadhātu – idaṃ vuccati, bhikkhave, dhātunānatta’’nti. Chaṭṭhaṃ.",
      "english": "Monks, I shall expound to you the diversity of elements. Listen to that. And what, monks, is the diversity of elements? The element of visible form, the element of sound, the element of smell, the element of taste, the element of tactile sensation, and the element of mental phenomena – this, monks, is called the diversity of elements.",
      "sinhala": "මහණෙනි, මම ඔබට ධාතු නානත්වය දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, ධාතු නානත්වය කවරේද? රූප ධාතුව, ශබ්ද ධාතුව, ගන්ධ ධාතුව, රස ධාතුව, ස්පර්ශ ධාතුව, ධර්‍ම ධාතුව – මහණෙනි, මෙය ධාතු නානත්වය යැයි කියනු ලැබේ.\n\nහයවැන්නයි.",
      "paliTitle": "Bāhiradhātunānattasuttaṃ",
      "englishTitle": "Diversity of External Elements Sutta",
      "sinhalaTitle": "බාහිර ධාතු නානත්ත සූත්‍රය"
    },
    {
      "number": 91,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati saṅkappanānattaṃ, saṅkappanānattaṃ paṭicca uppajjati chandanānattaṃ, chandanānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, pariḷāhanānattaṃ paṭicca uppajjati pariyesanānānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Rūpadhātu…pe… dhammadhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati saṅkappanānattaṃ, saṅkappanānattaṃ paṭicca uppajjati chandanānattaṃ, chandanānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, pariḷāhanānattaṃ paṭicca uppajjati pariyesanānānattaṃ? ‘‘Rūpadhātuṃ, bhikkhave, paṭicca uppajjati rūpasaññā, rūpasaññaṃ paṭicca uppajjati rūpasaṅkappo, rūpasaṅkappaṃ paṭicca uppajjati rūpacchando, rūpacchandaṃ paṭicca uppajjati rūpapariḷāho, rūpapariḷāhaṃ paṭicca uppajjati rūpapariyesanā…pe… dhammadhātuṃ paṭicca uppajjati dhammasaññā, dhammasaññaṃ paṭicca uppajjati dhammasaṅkappo, dhammasaṅkappaṃ paṭicca uppajjati dhammacchando, dhammacchandaṃ paṭicca uppajjati dhammapariḷāho, dhammapariḷāhaṃ paṭicca uppajjati dhammapariyesanā. ‘‘Evaṃ, kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati saṅkappanānattaṃ, saṅkappanānattaṃ paṭicca uppajjati chandanānattaṃ, chandanānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, pariḷāhanānattaṃ paṭicca uppajjati pariyesanānānatta’’nti. Sattamaṃ.",
      "english": "The Blessed One was staying at Sāvatthī… The bhikkhus replied to the Blessed One, \"Yes, Venerable Sir.\" The Blessed One said this: \"Dependent on the diversity of elements, monks, arises the diversity of perceptions; dependent on the diversity of perceptions arises the diversity of intentions; dependent on the diversity of intentions arises the diversity of desires; dependent on the diversity of desires arises the diversity of burning anguish; dependent on the diversity of burning anguish arises the diversity of seeking.\n\n\"And what, monks, is the diversity of elements? The element of form, and so forth, up to the element of mental phenomena—this, monks, is called the diversity of elements.\"\n\n\"And how, monks, dependent on the diversity of elements does the diversity of perceptions arise; dependent on the diversity of perceptions does the diversity of intentions arise; dependent on the diversity of intentions does the diversity of desires arise; dependent on the diversity of desires does the diversity of burning anguish arise; dependent on the diversity of burning anguish does the diversity of seeking?\n\n\"Dependent on the element of form, monks, arises perception of form; dependent on perception of form arises intention regarding form; dependent on intention regarding form arises desire for form; dependent on desire for form arises burning anguish regarding form; dependent on burning anguish regarding form arises seeking for form. Similarly, for other elements, dependent on the element of mental phenomena arises perception of mental phenomena; dependent on perception of mental phenomena arises intention regarding mental phenomena; dependent on intention regarding mental phenomena arises desire for mental phenomena; dependent on desire for mental phenomena arises burning anguish regarding mental phenomena; dependent on burning anguish regarding mental phenomena arises seeking for mental phenomena.\n\n\"It is in this way, monks, that dependent on the diversity of elements arises the diversity of perceptions; dependent on the diversity of perceptions arises the diversity of intentions; dependent on the diversity of intentions arises the diversity of desires; dependent on the diversity of desires arises the diversity of burning anguish; dependent on the diversity of burning anguish arises the diversity of seeking.\"",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩසිටි සේක. එහිදී භික්ෂූහු භාග්‍යවතුන් වහන්සේට 'ස්වාමීනී' යැයි පිළිවදන් දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, ධාතූන්ගේ විවිධත්වය නිසා සංඥාවන්ගේ විවිධත්වයක් හටගනී. සංඥාවන්ගේ විවිධත්වය නිසා සංකල්පනාවන්ගේ විවිධත්වයක් හටගනී. සංකල්පනාවන්ගේ විවිධත්වය නිසා ඡන්දයන්ගේ විවිධත්වයක් හටගනී. ඡන්දයන්ගේ විවිධත්වය නිසා සන්තාපයන්ගේ විවිධත්වයක් හටගනී. සන්තාපයන්ගේ විවිධත්වය නිසා ගවේෂණයන්ගේ විවිධත්වයක් හටගනී.\"\n\n\"මහණෙනි, ධාතූන්ගේ විවිධත්වය නම් කුමක්ද? රූප ධාතුව, ... ආදී වශයෙන් ධම්ම ධාතුවයි. මහණෙනි, මේ ධාතූන්ගේ විවිධත්වය යැයි කියනු ලැබේ.\"\n\n\"මහණෙනි, ධාතූන්ගේ විවිධත්වය නිසා සංඥාවන්ගේ විවිධත්වය හටගන්නේ කෙසේද? සංඥාවන්ගේ විවිධත්වය නිසා සංකල්පනාවන්ගේ විවිධත්වය හටගන්නේ කෙසේද? සංකල්පනාවන්ගේ විවිධත්වය නිසා ඡන්දයන්ගේ විවිධත්වය හටගන්නේ කෙසේද? ඡන්දයන්ගේ විවිධත්වය නිසා සන්තාපයන්ගේ විවිධත්වය හටගන්නේ කෙසේද? සන්තාපයන්ගේ විවිධත්වය නිසා ගවේෂණයන්ගේ විවිධත්වය හටගන්නේ කෙසේද?\"\n\n\"මහණෙනි, රූප ධාතුව නිසා රූප සංඥාව හටගනී. රූප සංඥාව නිසා රූප සංකල්පනාව හටගනී. රූප සංකල්පනාව නිසා රූප ඡන්දය හටගනී. රූප ඡන්දය නිසා රූප සන්තාපය හටගනී. රූප සන්තාපය නිසා රූප ගවේෂණාව හටගනී. ... ආදී වශයෙන්, ධම්ම ධාතුව නිසා ධම්ම සංඥාව හටගනී. ධම්ම සංඥාව නිසා ධම්ම සංකල්පනාව හටගනී. ධම්ම සංකල්පනාව නිසා ධම්ම ඡන්දය හටගනී. ධම්ම ඡන්දය නිසා ධම්ම සන්තාපය හටගනී. ධම්ම සන්තාපය නිසා ධම්ම ගවේෂණාව හටගනී.\"\n\n\"මහණෙනි, මෙසේ ධාතූන්ගේ විවිධත්වය නිසා සංඥාවන්ගේ විවිධත්වයක් හටගනී. සංඥාවන්ගේ විවිධත්වය නිසා සංකල්පනාවන්ගේ විවිධත්වයක් හටගනී. සංකල්පනාවන්ගේ විවිධත්වය නිසා ඡන්දයන්ගේ විවිධත්වයක් හටගනී. ඡන්දයන්ගේ විවිධත්වය නිසා සන්තාපයන්ගේ විවිධත්වයක් හටගනී. සන්තාපයන්ගේ විවිධත්වය නිසා ගවේෂණයන්ගේ විවිධත්වයක් හටගනී.\"",
      "paliTitle": "Saññānānattasuttaṃ",
      "englishTitle": "The Discourse on the Diversity of Perception",
      "sinhalaTitle": "සඤ්ඤානානත්ත සූත්‍රය"
    },
    {
      "number": 92,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati saṅkappanānattaṃ, saṅkappanānattaṃ paṭicca uppajjati chandanānattaṃ, chandanānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, pariḷāhanānattaṃ paṭicca uppajjati pariyesanānānattaṃ; no pariyesanānānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, no pariḷāhanānattaṃ paṭicca uppajjati chandanānattaṃ, no chandanānattaṃ paṭicca uppajjati saṅkappanānattaṃ, no saṅkappanānattaṃ paṭicca uppajjati saññānānattaṃ, no saññānānattaṃ paṭicca uppajjati dhātunānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Rūpadhātu…pe… dhammadhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati…pe… pariyesanānānattaṃ; no pariyesanānānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, no pariḷāhanānattaṃ paṭicca uppajjati chandanānattaṃ, no chandanānattaṃ paṭicca uppajjati saṅkappanānattaṃ, no saṅkappanānattaṃ paṭicca uppajjati saññānānattaṃ, no saññānānattaṃ paṭicca uppajjati dhātunānattaṃ? ‘‘Rūpadhātuṃ, bhikkhave, paṭicca uppajjati rūpasaññā…pe… dhammadhātuṃ paṭicca uppajjati dhammasaññā, dhammasaññaṃ paṭicca uppajjati…pe… dhammapariyesanā; no dhammapariyesanaṃ paṭicca uppajjati dhammapariḷāho, no dhammapariḷāhaṃ paṭicca uppajjati dhammacchando, no dhammacchandaṃ paṭicca uppajjati dhammasaṅkappo, no dhammasaṅkappaṃ paṭicca uppajjati dhammasaññā, no dhammasaññaṃ paṭicca uppajjati dhammadhātu. ‘‘Evaṃ kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati…pe… pariyesanānānattaṃ; no pariyesanānānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, no pariḷāhanānattaṃ paṭicca uppajjati chandanānattaṃ, no chandanānattaṃ paṭicca uppajjati saṅkappanānattaṃ, no saṅkappanānattaṃ paṭicca uppajjati saññānānattaṃ, no saññānānattaṃ paṭicca uppajjati dhātunānatta’’nti. Aṭṭhamaṃ.",
      "english": "Monks, in dependence on the diversity of elements arises the diversity of perceptions; in dependence on the diversity of perceptions arises the diversity of intentions; in dependence on the diversity of intentions arises the diversity of desires; in dependence on the diversity of desires arises the diversity of distress; in dependence on the diversity of distress arises the diversity of seeking. However, in dependence on the diversity of seeking does not arise the diversity of distress; in dependence on the diversity of distress does not arise the diversity of desires; in dependence on the diversity of desires does not arise the diversity of intentions; in dependence on the diversity of intentions does not arise the diversity of perceptions; in dependence on the diversity of perceptions does not arise the diversity of elements.\n\nAnd what, Monks, is the diversity of elements? The element of form, the element of sound, the element of smell, the element of taste, the element of touch, and the element of mental phenomena – this, Monks, is called the diversity of elements.\n\nAnd how, Monks, in dependence on the diversity of elements arises the diversity of perceptions; in dependence on the diversity of perceptions arises the diversity of intentions; in dependence on the diversity of intentions arises the diversity of desires; in dependence on the diversity of desires arises the diversity of distress; in dependence on the diversity of distress arises the diversity of seeking? And how is it that in dependence on the diversity of seeking does not arise the diversity of distress; in dependence on the diversity of distress does not arise the diversity of desires; in dependence on the diversity of desires does not arise the diversity of intentions; in dependence on the diversity of intentions does not arise the diversity of perceptions; in dependence on the diversity of perceptions does not arise the diversity of elements?\n\nMonks, in dependence on the element of form arises the perception of form; in dependence on the element of sound arises the perception of sound; in dependence on the element of smell arises the perception of smell; in dependence on the element of taste arises the perception of taste; in dependence on the element of touch arises the perception of touch; in dependence on the element of mental phenomena arises the perception of mental phenomena. In dependence on the perception of mental phenomena arises the intention concerning mental phenomena; in dependence on the intention concerning mental phenomena arises the desire concerning mental phenomena; in dependence on the desire concerning mental phenomena arises the distress concerning mental phenomena; in dependence on the distress concerning mental phenomena arises the seeking concerning mental phenomena. However, in dependence on the seeking concerning mental phenomena does not arise the distress concerning mental phenomena; in dependence on the distress concerning mental phenomena does not arise the desire concerning mental phenomena; in dependence on the desire concerning mental phenomena does not arise the intention concerning mental phenomena; in dependence on the intention concerning mental phenomena does not arise the perception of mental phenomena; in dependence on the perception of mental phenomena does not arise the element of mental phenomena.\n\nThus, Monks, in dependence on the diversity of elements arises the diversity of perceptions; in dependence on the diversity of perceptions arises the diversity of intentions; in dependence on the diversity of intentions arises the diversity of desires; in dependence on the diversity of desires arises the diversity of distress; in dependence on the diversity of distress arises the diversity of seeking. However, in dependence on the diversity of seeking does not arise the diversity of distress; in dependence on the diversity of distress does not arise the diversity of desires; in dependence on the diversity of desires does not arise the diversity of intentions; in dependence on the diversity of intentions does not arise the diversity of perceptions; in dependence on the diversity of perceptions does not arise the diversity of elements.",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක.\n\nමහණෙනි, ධාතු නානාත්වය හේතු කොට ගෙන සංඥා නානාත්වය හටගනී. සංඥා නානාත්වය හේතු කොට ගෙන සංකප්ප නානාත්වය හටගනී. සංකප්ප නානාත්වය හේතු කොට ගෙන ඡන්ද නානාත්වය හටගනී. ඡන්ද නානාත්වය හේතු කොට ගෙන පරිළාහ නානාත්වය හටගනී. පරිළාහ නානාත්වය හේතු කොට ගෙන පරියේසනා නානාත්වය හටගනී. එහෙත්, පරියේසනා නානාත්වය හේතු කොට ගෙන පරිළාහ නානාත්වය හට නොගනී. පරිළාහ නානාත්වය හේතු කොට ගෙන ඡන්ද නානාත්වය හට නොගනී. ඡන්ද නානාත්වය හේතු කොට ගෙන සංකප්ප නානාත්වය හට නොගනී. සංකප්ප නානාත්වය හේතු කොට ගෙන සංඥා නානාත්වය හට නොගනී. සංඥා නානාත්වය හේතු කොට ගෙන ධාතු නානාත්වය හට නොගනී. මහණෙනි, ධාතු නානාත්වය යනු කවරේද? රූප ධාතුවෙහි සිට ධර්‍ම ධාතුව දක්වා ඇති දේ යි. මහණෙනි, මේ ධාතු නානාත්වය යැයි කියනු ලැබේ.\n\nමහණෙනි, ධාතු නානාත්වය හේතු කොට ගෙන සංඥා නානාත්වය හටගන්නේ කෙසේද? සංඥා නානාත්වය හේතු කොට ගෙන සංකප්ප නානාත්වය හටගනී. සංකප්ප නානාත්වය හේතු කොට ගෙන ඡන්ද නානාත්වය හටගනී. ඡන්ද නානාත්වය හේතු කොට ගෙන පරිළාහ නානාත්වය හටගනී. පරිළාහ නානාත්වය හේතු කොට ගෙන පරියේසනා නානාත්වය හටගනී. එහෙත්, පරියේසනා නානාත්වය හේතු කොට ගෙන පරිළාහ නානාත්වය හට නොගනී. පරිළාහ නානාත්වය හේතු කොට ගෙන ඡන්ද නානාත්වය හට නොගනී. ඡන්ද නානාත්වය හේතු කොට ගෙන සංකප්ප නානාත්වය හට නොගනී. සංකප්ප නානාත්වය හේතු කොට ගෙන සංඥා නානාත්වය හට නොගනී. සංඥා නානාත්වය හේතු කොට ගෙන ධාතු නානාත්වය හට නොගනී. මහණෙනි, රූප ධාතුව හේතු කොට ගෙන රූප සංඥාව හටගනී. ශබ්ද ධාතුව හේතු කොට ගෙන ශබ්ද සංඥාව හටගනී. ගන්ධ ධාතුව හේතු කොට ගෙන ගන්ධ සංඥාව හටගනී. රස ධාතුව හේතු කොට ගෙන රස සංඥාව හටගනී. ස්පර්ශ ධාතුව හේතු කොට ගෙන ස්පර්ශ සංඥාව හටගනී. ධර්‍ම ධාතුව හේතු කොට ගෙන ධර්‍ම සංඥාව හටගනී. ධර්‍ම සංඥාව හේතු කොට ගෙන ධර්‍ම සංකල්පය හටගනී. ධර්‍ම සංකල්පය හේතු කොට ගෙන ධර්‍ම ඡන්දය හටගනී. ධර්‍ම ඡන්දය හේතු කොට ගෙන ධර්‍ම පරිළාහය හටගනී. ධර්‍ම පරිළාහය හේතු කොට ගෙන ධර්‍ම පරියේසනාව හටගනී. එහෙත්, ධර්‍ම පරියේසනාව හේතු කොට ගෙන ධර්‍ම පරිළාහය හට නොගනී. ධර්‍ම පරිළාහය හේතු කොට ගෙන ධර්‍ම ඡන්දය හට නොගනී. ධර්‍ම ඡන්දය හේතු කොට ගෙන ධර්‍ම සංකල්පය හට නොගනී. ධර්‍ම සංකල්පය හේතු කොට ගෙන ධර්‍ම සංඥාව හට නොගනී. ධර්‍ම සංඥාව හේතු කොට ගෙන ධර්‍ම ධාතුව හට නොගනී.\n\nමහණෙනි, මෙසේ ධාතු නානාත්වය හේතු කොට ගෙන සංඥා නානාත්වය හටගනී. සංඥා නානාත්වය හේතු කොට ගෙන සංකප්ප නානාත්වය හටගනී. සංකප්ප නානාත්වය හේතු කොට ගෙන ඡන්ද නානාත්වය හටගනී. ඡන්ද නානාත්වය හේතු කොට ගෙන පරිළාහ නානාත්වය හටගනී. පරිළාහ නානාත්වය හේතු කොට ගෙන පරියේසනා නානාත්වය හටගනී. එහෙත්, පරියේසනා නානාත්වය හේතු කොට ගෙන පරිළාහ නානාත්වය හට නොගනී. පරිළාහ නානාත්වය හේතු කොට ගෙන ඡන්ද නානාත්වය හට නොගනී. ඡන්ද නානාත්වය හේතු කොට ගෙන සංකප්ප නානාත්වය හට නොගනී. සංකප්ප නානාත්වය හේතු කොට ගෙන සංඥා නානාත්වය හට නොගනී. සංඥා නානාත්වය හේතු කොට ගෙන ධාතු නානාත්වය හට නොගනී.\n\nඅටවෙනි සූත්‍රයයි.",
      "paliTitle": "Nopariyesanānānattasuttaṃ",
      "englishTitle": "Non-Diversity of Search Sutta",
      "sinhalaTitle": "නොපරියේසනානානත්ත සූත්‍රය"
    },
    {
      "number": 93,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati saṅkappanānattaṃ, saṅkappanānattaṃ paṭicca uppajjati phassanānattaṃ, phassanānattaṃ paṭicca uppajjati vedanānānattaṃ, vedanānānattaṃ paṭicca uppajjati chandanānattaṃ, chandanānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, pariḷāhanānattaṃ paṭicca uppajjati pariyesanānānattaṃ, pariyesanānānattaṃ paṭicca uppajjati lābhanānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Rūpadhātu…pe… dhammadhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati…pe… lābhanānattaṃ? ‘‘Rūpadhātuṃ, bhikkhave, paṭicca uppajjati rūpasaññā, rūpasaññaṃ paṭicca uppajjati rūpasaṅkappo, rūpasaṅkappaṃ paṭicca uppajjati rūpasamphasso, rūpasamphassaṃ paṭicca uppajjati rūpasamphassajā vedanā, rūpasamphassajaṃ vedanaṃ paṭicca uppajjati rūpacchando, rūpacchandaṃ paṭicca uppajjati rūpapariḷāho, rūpapariḷāhaṃ paṭicca uppajjati rūpapariyesanā, rūpapariyesanaṃ paṭicca uppajjati rūpalābho…pe… dhammadhātuṃ paṭicca uppajjati dhammasaññā, dhammasaññaṃ paṭicca uppajjati dhammasaṅkappo, dhammasaṅkappaṃ paṭicca uppajjati dhammasamphasso, dhammasamphassaṃ paṭicca uppajjati dhammasamphassajā vedanā, dhammasamphassajaṃ vedanaṃ paṭicca uppajjati dhammacchando, dhammacchandaṃ paṭicca uppajjati dhammapariḷāho, dhammapariḷāhaṃ paṭicca uppajjati dhammapariyesanā, dhammapariyesanaṃ paṭicca uppajjati dhammalābho. ‘‘Evaṃ kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati…pe… pariyesanānānattaṃ, pariyesanānānattaṃ paṭicca uppajjati lābhanānatta’’nti. Navamaṃ.",
      "english": "The Blessed One was staying at Sāvatthī.\n\n“Monks, depending on the diversity of elements arises the diversity of perceptions; depending on the diversity of perceptions arises the diversity of intentions; depending on the diversity of intentions arises the diversity of contacts; depending on the diversity of contacts arises the diversity of feelings; depending on the diversity of feelings arises the diversity of desires; depending on the diversity of desires arises the diversity of feverish distress; depending on the diversity of feverish distress arises the diversity of seeking; depending on the diversity of seeking arises the diversity of acquisition.\n\n“And what, monks, is the diversity of elements? The element of form, and so on, up to the element of mental phenomena – this, monks, is called the diversity of elements.”\n\n“And how, monks, depending on the diversity of elements arises the diversity of perceptions, and depending on the diversity of perceptions arises the diversity of intentions, diversity of intentions depending on that arises diversity of contacts, diversity of contacts depending on that arises diversity of feelings, diversity of feelings depending on that arises diversity of desires, diversity of desires depending on that arises diversity of feverish distress, diversity of feverish distress depending on that arises diversity of seeking, and diversity of seeking depending on that arises diversity of gain?”\n\n“Depending on the element of form, monks, arises perception of form; depending on perception of form, arises intention regarding form; depending on intention regarding form, arises contact with form; depending on contact with form, arises feeling born of contact with form; depending on feeling born of contact with form, arises desire for form; depending on desire for form, arises feverish distress regarding form; depending on feverish distress regarding form, arises seeking for form; depending on seeking for form, arises gain of form. And so on, up to: depending on the element of mental phenomena, arises perception of mental phenomena; depending on perception of mental phenomena, arises intention regarding mental phenomena; depending on intention regarding mental phenomena, arises contact with mental phenomena; depending on contact with mental phenomena, arises feeling born of contact with mental phenomena; depending on feeling born of contact with mental phenomena, arises desire for mental phenomena; depending on desire for mental phenomena, arises feverish distress regarding mental phenomena; depending on feverish distress regarding mental phenomena, arises seeking for mental phenomena; depending on seeking for mental phenomena, arises gain of mental phenomena.\n\n“It is in this way, monks, that depending on the diversity of elements arises the diversity of perceptions; depending on the diversity of perceptions arises the diversity of intentions, and so on, up to diversity of seeking; and depending on the diversity of seeking arises the diversity of gain.”",
      "sinhala": "මහණෙනි, ධාතූන්ගේ නානාත්වය නිසා සංඥාවල නානාත්වය හටගනී. සංඥාවල නානාත්වය නිසා සංකල්පනාවල නානාත්වය හටගනී. සංකල්පනාවල නානාත්වය නිසා ස්පර්ශයේ නානාත්වය හටගනී. ස්පර්ශයේ නානාත්වය නිසා වේදනාවල නානාත්වය හටගනී. වේදනාවල නානාත්වය නිසා ඡන්දයේ නානාත්වය හටගනී. ඡන්දයේ නානාත්වය නිසා දැවිල්ලේ නානාත්වය හටගනී. දැවිල්ලේ නානාත්වය නිසා පරියේෂණයේ නානාත්වය හටගනී. පරියේෂණයේ නානාත්වය නිසා ලැබීමේ නානාත්වය හටගනී.\n\nමහණෙනි, ධාතූන්ගේ නානාත්වය නම් කුමක්ද? රූප ධාතුව... (පෙ)... ධර්ම ධාතුව. මහණෙනි, මේ ධාතූන්ගේ නානාත්වයයි.\n\nමහණෙනි, ධාතූන්ගේ නානාත්වය නිසා සංඥාවල නානාත්වය හටගන්නේ කෙසේද? සංඥාවල නානාත්වය නිසා (පෙ)... ලැබීමේ නානාත්වය හටගන්නේ කෙසේද?\n\nමහණෙනි, රූප ධාතුව නිසා රූප සංඥාව හටගනී. රූප සංඥාව නිසා රූප සංකල්පනාව හටගනී. රූප සංකල්පනාව නිසා රූප ස්පර්ශය හටගනී. රූප ස්පර්ශය නිසා රූප ස්පර්ශයෙන් හටගත් වේදනාව හටගනී. රූප ස්පර්ශයෙන් හටගත් වේදනාව නිසා රූප කෙරෙහි ඡන්දය හටගනී. රූප කෙරෙහි ඡන්දය නිසා රූප කෙරෙහි දැවිල්ල හටගනී. රූප කෙරෙහි දැවිල්ල නිසා රූප සෙවීම හටගනී. රූප සෙවීම නිසා රූප ලැබීම හටගනී. (පෙ)... ධර්ම ධාතුව නිසා ධර්ම සංඥාව හටගනී. ධර්ම සංඥාව නිසා ධර්ම සංකල්පනාව හටගනී. ධර්ම සංකල්පනාව නිසා ධර්ම ස්පර්ශය හටගනී. ධර්ම ස්පර්ශය නිසා ධර්ම ස්පර්ශයෙන් හටගත් වේදනාව හටගනී. ධර්ම ස්පර්ශයෙන් හටගත් වේදනාව නිසා ධර්ම කෙරෙහි ඡන්දය හටගනී. ධර්ම කෙරෙහි ඡන්දය නිසා ධර්ම කෙරෙහි දැවිල්ල හටගනී. ධර්ම කෙරෙහි දැවිල්ල නිසා ධර්ම සෙවීම හටගනී. ධර්ම සෙවීම නිසා ධර්ම ලැබීම හටගනී.\n\nමහණෙනි, ධාතූන්ගේ නානාත්වය නිසා සංඥාවල නානාත්වය හටගන්නේ මෙලෙසිනි. සංඥාවල නානාත්වය නිසා (පෙ)... පරියේෂණයේ නානාත්වය හටගනී. පරියේෂණයේ නානාත්වය නිසා ලැබීමේ නානාත්වය හටගනී.",
      "paliTitle": "Bāhiraphassanānattasuttaṃ",
      "englishTitle": "Diversity of External Contact Sutta",
      "sinhalaTitle": "බාහිර ඵස්ස නානත්ත සූත්‍රය"
    },
    {
      "number": 94,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātunānattaṃ, bhikkhave, paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati saṅkappanānattaṃ, phassa… vedanā… chanda… pariḷāha… pariyesanānānattaṃ paṭicca uppajjati lābhanānattaṃ; no lābhanānattaṃ paṭicca uppajjati pariyesanānānattaṃ, no pariyesanānānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, no pariḷāhanānattaṃ paṭicca uppajjati…pe… chanda… vedanā… phassa… saṅkappa… saññānānattaṃ, no saññānānattaṃ paṭicca uppajjati dhātunānattaṃ. Katamañca, bhikkhave, dhātunānattaṃ? Rūpadhātu…pe… dhammadhātu – idaṃ vuccati, bhikkhave, dhātunānattaṃ’’. ‘‘Kathañca, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati saṅkappanānattaṃ? Phassa… vedanā… chanda… pariḷāha… pariyesanā… lābha… no lābhanānattaṃ paṭicca uppajjati pariyesanānānattaṃ, no pariyesanānānattaṃ paṭicca uppajjati pariḷāha… chanda… vedanā… phassa… no saṅkappanānattaṃ paṭicca uppajjati saññānānattaṃ, no saññānānattaṃ paṭicca uppajjati dhātunānattaṃ? ‘‘Rūpadhātuṃ, bhikkhave, paṭicca uppajjati rūpasaññā…pe… dhammadhātuṃ paṭicca uppajjati dhammasaññā, dhammasaññaṃ paṭicca uppajjati…pe… dhammapariyesanā, dhammapariyesanaṃ paṭicca uppajjati dhammalābho; no dhammalābhaṃ paṭicca uppajjati dhammapariyesanā, no dhammapariyesanaṃ paṭicca uppajjati dhammapariḷāho, no dhammapariḷāhaṃ paṭicca uppajjati dhammacchando, no dhammacchandaṃ paṭicca uppajjati dhammasamphassajā vedanā, no dhammasamphassajaṃ vedanaṃ paṭicca uppajjati dhammasamphasso, no dhammasamphassaṃ paṭicca uppajjati dhammasaṅkappo, no dhammasaṅkappaṃ paṭicca uppajjati dhammasaññā, no dhammasaññaṃ paṭicca uppajjati dhammadhātu. ‘‘Evaṃ kho, bhikkhave, dhātunānattaṃ paṭicca uppajjati saññānānattaṃ, saññānānattaṃ paṭicca uppajjati…pe… saṅkappa… phassa… vedanā… chanda… pariḷāha… pariyesanā… lābha… no lābhanānattaṃ paṭicca uppajjati pariyesanānānattaṃ, no pariyesanānānattaṃ paṭicca uppajjati pariḷāhanānattaṃ, no pariḷāhanānattaṃ paṭicca uppajjati chandanānattaṃ, no chandanānattaṃ paṭicca uppajjati vedanānānattaṃ, no vedanānānattaṃ paṭicca uppajjati phassanānattaṃ, no phassanānattaṃ paṭicca uppajjati saṅkappanānattaṃ, no saṅkappanānattaṃ paṭicca uppajjati saññānānattaṃ, no saññānānattaṃ paṭicca uppajjati dhātunānatta’’nti. Dasamaṃ. Nānattavaggo paṭhamo. Tassuddānaṃ – Dhātuphassañca no cetaṃ, vedanā apare duve; Etaṃ ajjhattapañcakaṃ, dhātusaññañca no cetaṃ; Phassassa apare duve, etaṃ bāhirapañcakanti.",
      "english": "Bhikkhus, depending on the diversity of elements, diversity of perceptions arises. Depending on the diversity of perceptions, diversity of intentions arises. Depending on the diversity of intentions, diversity of contact arises. Depending on the diversity of contact, diversity of feelings arises. Depending on the diversity of feelings, diversity of desires arises. Depending on the diversity of desires, diversity of distress arises. Depending on the diversity of distress, diversity of searching arises. Depending on the diversity of searching, diversity of acquisition arises.\nHowever, diversity of searching does not arise depending on the diversity of acquisition. Diversity of distress does not arise depending on the diversity of searching. Diversity of desires does not arise depending on the diversity of distress. Diversity of feelings does not arise depending on the diversity of desires. Diversity of contact does not arise depending on the diversity of feelings. Diversity of intentions does not arise depending on the diversity of contact. Diversity of perceptions does not arise depending on the diversity of intentions. Diversity of elements does not arise depending on the diversity of perceptions.\nAnd what, bhikkhus, is the diversity of elements? The element of form to the element of mental phenomena – this, bhikkhus, is called the diversity of elements.\n\nAnd how, bhikkhus, does diversity of perceptions arise depending on the diversity of elements? How does diversity of intentions arise depending on the diversity of perceptions? How do diversity of contact, diversity of feelings, diversity of desires, diversity of distress, diversity of searching, and diversity of acquisition arise in dependence on their preceding factors? And how does diversity of searching not arise depending on the diversity of acquisition? How does diversity of distress not arise depending on the diversity of searching? How do diversity of desires, diversity of feelings, diversity of contact, diversity of intentions, and diversity of perceptions not arise in this reverse order of dependency? And how does diversity of elements not arise depending on the diversity of perceptions?\n\nBhikkhus, depending on the element of form, perception of form arises. Depending on the element of mental phenomena, perception of mental phenomena arises. Depending on the perception of mental phenomena, intentions regarding mental phenomena arise. Depending on intentions regarding mental phenomena, contact regarding mental phenomena arises. Depending on contact regarding mental phenomena, feeling born of contact regarding mental phenomena arises. Depending on feeling born of contact regarding mental phenomena, desire regarding mental phenomena arises. Depending on desire regarding mental phenomena, distress regarding mental phenomena arises. Depending on distress regarding mental phenomena, searching regarding mental phenomena arises. Depending on searching regarding mental phenomena, acquisition of mental phenomena arises.\nHowever, searching regarding mental phenomena does not arise depending on the acquisition of mental phenomena. Distress regarding mental phenomena does not arise depending on searching regarding mental phenomena. Desire regarding mental phenomena does not arise depending on distress regarding mental phenomena. Feeling born of contact regarding mental phenomena does not arise depending on desire regarding mental phenomena. Contact regarding mental phenomena does not arise depending on feeling born of contact regarding mental phenomena. Intentions regarding mental phenomena do not arise depending on contact regarding mental phenomena. Perception of mental phenomena does not arise depending on intentions regarding mental phenomena. The element of mental phenomena does not arise depending on the perception of mental phenomena.\n\nIt is in this way, bhikkhus, that diversity of perceptions arises depending on the diversity of elements. Diversity of intentions arises depending on the diversity of perceptions. Diversity of contact arises depending on the diversity of intentions. Diversity of feelings arises depending on the diversity of contact. Diversity of desires arises depending on the diversity of feelings. Diversity of distress arises depending on the diversity of desires. Diversity of searching arises depending on the diversity of distress. Diversity of acquisition arises depending on the diversity of searching.\nHowever, diversity of searching does not arise depending on the diversity of acquisition. Diversity of distress does not arise depending on the diversity of searching. Diversity of desires does not arise depending on the diversity of distress. Diversity of feelings does not arise depending on the diversity of desires. Diversity of contact does not arise depending on the diversity of feelings. Diversity of intentions does not arise depending on the diversity of contact. Diversity of perceptions does not arise depending on the diversity of intentions. Diversity of elements does not arise depending on the diversity of perceptions.",
      "sinhala": "භික්‍ෂූනි, ධාතු නානත්වය හේතු කොට ගෙන සංඥා නානත්වය ඇතිවේ. සංඥා නානත්වය හේතු කොට ගෙන සංකල්ප නානත්වය ඇතිවේ. සංකල්ප නානත්වය හේතු කොට ගෙන ස්පර්ශ නානත්වය ඇතිවේ. ස්පර්ශ නානත්වය හේතු කොට ගෙන වේදනා නානත්වය ඇතිවේ. වේදනා නානත්වය හේතු කොට ගෙන ඡන්ද නානත්වය ඇතිවේ. ඡන්ද නානත්වය හේතු කොට ගෙන පරිළාහ නානත්වය ඇතිවේ. පරිළාහ නානත්වය හේතු කොට ගෙන පාරියේෂණා නානත්වය ඇතිවේ. පාරියේෂණා නානත්වය හේතු කොට ගෙන ලාභ නානත්වය ඇතිවේ. එහෙත් ලාභ නානත්වය හේතු කොට ගෙන පාරියේෂණා නානත්වය ඇති නොවේ. පාරියේෂණා නානත්වය හේතු කොට ගෙන පරිළාහ නානත්වය ඇති නොවේ. පරිළාහ නානත්වය හේතු කොට ගෙන ඡන්ද නානත්වය ඇති නොවේ. ඡන්ද නානත්වය හේතු කොට ගෙන වේදනා නානත්වය ඇති නොවේ. වේදනා නානත්වය හේතු කොට ගෙන ස්පර්ශ නානත්වය ඇති නොවේ. ස්පර්ශ නානත්වය හේතු කොට ගෙන සංකල්ප නානත්වය ඇති නොවේ. සංකල්ප නානත්වය හේතු කොට ගෙන සංඥා නානත්වය ඇති නොවේ. සංඥා නානත්වය හේතු කොට ගෙන ධාතු නානත්වය ඇති නොවේ. භික්‍ෂූනි, ධාතු නානත්වය යනු කුමක්ද? රූප ධාතුව, ශබ්ද ධාතුව, ගන්ධ ධාතුව, රස ධාතුව, ස්පර්ශ ධාතුව, ධම්ම ධාතුව – භික්‍ෂූනි, මෙය ධාතු නානත්වය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, කෙසේ නම් ධාතු නානත්වය හේතු කොට ගෙන සංඥා නානත්වය ඇතිවේද? සංඥා නානත්වය හේතු කොට ගෙන සංකල්ප නානත්වය ඇතිවේද? සංකල්ප නානත්වය හේතු කොට ගෙන ස්පර්ශ නානත්වය ඇතිවේද? ස්පර්ශ නානත්වය හේතු කොට ගෙන වේදනා නානත්වය ඇතිවේද? වේදනා නානත්වය හේතු කොට ගෙන ඡන්ද නානත්වය ඇතිවේද? ඡන්ද නානත්වය හේතු කොට ගෙන පරිළාහ නානත්වය ඇතිවේද? පරිළාහ නානත්වය හේතු කොට ගෙන පාරියේෂණා නානත්වය ඇතිවේද? පාරියේෂණා නානත්වය හේතු කොට ගෙන ලාභ නානත්වය ඇතිවේද? එහෙත් ලාභ නානත්වය හේතු කොට ගෙන පාරියේෂණා නානත්වය ඇති නොවේද? පාරියේෂණා නානත්වය හේතු කොට ගෙන පරිළාහ නානත්වය ඇති නොවේද? පරිළාහ නානත්වය හේතු කොට ගෙන ඡන්ද නානත්වය ඇති නොවේද? ඡන්ද නානත්වය හේතු කොට ගෙන වේදනා නානත්වය ඇති නොවේද? වේදනා නානත්වය හේතු කොට ගෙන ස්පර්ශ නානත්වය ඇති නොවේද? ස්පර්ශ නානත්වය හේතු කොට ගෙන සංකල්ප නානත්වය ඇති නොවේද? සංකල්ප නානත්වය හේතු කොට ගෙන සංඥා නානත්වය ඇති නොවේද? සංඥා නානත්වය හේතු කොට ගෙන ධාතු නානත්වය ඇති නොවේද?\n\nභික්‍ෂූනි, රූප ධාතුව හේතු කොට ගෙන රූප සංඥාව ඇතිවේ. ශබ්ද ධාතුව හේතු කොට ගෙන ශබ්ද සංඥාව ඇතිවේ. ගන්ධ ධාතුව හේතු කොට ගෙන ගන්ධ සංඥාව ඇතිවේ. රස ධාතුව හේතු කොට ගෙන රස සංඥාව ඇතිවේ. ස්පර්ශ ධාතුව හේතු කොට ගෙන ස්පර්ශ සංඥාව ඇතිවේ. ධම්ම ධාතුව හේතු කොට ගෙන ධම්ම සංඥාව ඇතිවේ. ධම්ම සංඥාව හේතු කොට ගෙන ධම්ම සංකල්පය ඇතිවේ. ධම්ම සංකල්පය හේතු කොට ගෙන ධම්ම ස්පර්ශය ඇතිවේ. ධම්ම ස්පර්ශය හේතු කොට ගෙන ධම්ම ස්පර්ශයෙන් හටගන්නා වේදනාව ඇතිවේ. ධම්ම ස්පර්ශයෙන් හටගන්නා වේදනාව හේතු කොට ගෙන ධම්ම ඡන්දය ඇතිවේ. ධම්ම ඡන්දය හේතු කොට ගෙන ධම්ම පරිළාහය ඇතිවේ. ධම්ම පරිළාහය හේතු කොට ගෙන ධම්ම පාරියේෂණාව ඇතිවේ. ධම්ම පාරියේෂණාව හේතු කොට ගෙන ධම්ම ලාභය ඇතිවේ. එහෙත් ධම්ම ලාභය හේතු කොට ගෙන ධම්ම පාරියේෂණාව ඇති නොවේ. ධම්ම පාරියේෂණාව හේතු කොට ගෙන ධම්ම පරිළාහය ඇති නොවේ. ධම්ම පරිළාහය හේතු කොට ගෙන ධම්ම ඡන්දය ඇති නොවේ. ධම්ම ඡන්දය හේතු කොට ගෙන ධම්ම ස්පර්ශයෙන් හටගන්නා වේදනාව ඇති නොවේ. ධම්ම ස්පර්ශයෙන් හටගන්නා වේදනාව හේතු කොට ගෙන ධම්ම ස්පර්ශය ඇති නොවේ. ධම්ම ස්පර්ශය හේතු කොට ගෙන ධම්ම සංකල්පය ඇති නොවේ. ධම්ම සංකල්පය හේතු කොට ගෙන ධම්ම සංඥාව ඇති නොවේ. ධම්ම සංඥාව හේතු කොට ගෙන ධම්ම ධාතුව ඇති නොවේ.\n\nභික්‍ෂූනි, මෙසේ ධාතු නානත්වය හේතු කොට ගෙන සංඥා නානත්වය ඇතිවේ. සංඥා නානත්වය හේතු කොට ගෙන සංකල්ප නානත්වය ඇතිවේ. සංකල්ප නානත්වය හේතු කොට ගෙන ස්පර්ශ නානත්වය ඇතිවේ. ස්පර්ශ නානත්වය හේතු කොට ගෙන වේදනා නානත්වය ඇතිවේ. වේදනා නානත්වය හේතු කොට ගෙන ඡන්ද නානත්වය ඇතිවේ. ඡන්ද නානත්වය හේතු කොට ගෙන පරිළාහ නානත්වය ඇතිවේ. පරිළාහ නානත්වය හේතු කොට ගෙන පාරියේෂණා නානත්වය ඇතිවේ. පාරියේෂණා නානත්වය හේතු කොට ගෙන ලාභ නානත්වය ඇතිවේ. එහෙත් ලාභ නානත්වය හේතු කොට ගෙන පාරියේෂණා නානත්වය ඇති නොවේ. පාරියේෂණා නානත්වය හේතු කොට ගෙන පරිළාහ නානත්වය ඇති නොවේ. පරිළාහ නානත්වය හේතු කොට ගෙන ඡන්ද නානත්වය ඇති නොවේ. ඡන්ද නානත්වය හේතු කොට ගෙන වේදනා නානත්වය ඇති නොවේ. වේදනා නානත්වය හේතු කොට ගෙන ස්පර්ශ නානත්වය ඇති නොවේ. ස්පර්ශ නානත්වය හේතු කොට ගෙන සංකල්ප නානත්වය ඇති නොවේ. සංකල්ප නානත්වය හේතු කොට ගෙන සංඥා නානත්වය ඇති නොවේ. සංඥා නානත්වය හේතු කොට ගෙන ධාතු නානත්වය ඇති නොවේ.",
      "paliTitle": "Dutiyabāhiraphassanānattasuttaṃ",
      "englishTitle": "Second Sutta on the Diversity of External Contact",
      "sinhalaTitle": "දුතිය බාහිරඵස්සනානත්ත සූත්‍රය"
    },
    {
      "number": 95,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘sattimā, bhikkhave, dhātuyo. Katamā satta? Ābhādhātu, subhadhātu, ākāsānañcāyatanadhātu, viññāṇañcāyatanadhātu, ākiñcaññāyatanadhātu, nevasaññānāsaññāyatanadhātu, saññāvedayitanirodhadhātu – imā kho, bhikkhave, satta dhātuyo’’ti. Evaṃ vutte, aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘yā cāyaṃ, bhante, ābhādhātu yā ca subhadhātu yā ca ākāsānañcāyatanadhātu yā ca viññāṇañcāyatanadhātu yā ca ākiñcaññāyatanadhātu yā ca nevasaññānāsaññāyatanadhātu yā ca saññāvedayitanirodhadhātu – imā nu kho, bhante, dhātuyo kiṃ paṭicca paññāyantī’’ti? ‘‘Yāyaṃ, bhikkhu, ābhādhātu – ayaṃ dhātu andhakāraṃ paṭicca paññāyati. Yāyaṃ, bhikkhu, subhadhātu – ayaṃ dhātu asubhaṃ paṭicca paññāyati. Yāyaṃ, bhikkhu, ākāsānañcāyatanadhātu – ayaṃ dhātu rūpaṃ paṭicca paññāyati. Yāyaṃ, bhikkhu, viññāṇañcāyatanadhātu – ayaṃ dhātu ākāsānañcāyatanaṃ paṭicca paññāyati. Yāyaṃ, bhikkhu, ākiñcaññāyatanadhātu – ayaṃ dhātu viññāṇañcāyatanaṃ paṭicca paññāyati. Yāyaṃ, bhikkhu, nevasaññānāsaññāyatanadhātu – ayaṃ dhātu ākiñcaññāyatanaṃ paṭicca paññāyati. Yāyaṃ, bhikkhu, saññāvedayitanirodhadhātu – ayaṃ dhātu nirodhaṃ paṭicca paññāyatī’’ti. ‘‘Yā cāyaṃ, bhante, ābhādhātu yā ca subhadhātu yā ca ākāsānañcāyatanadhātu yā ca viññāṇañcāyatanadhātu yā ca ākiñcaññāyatanadhātu yā ca nevasaññānāsaññāyatanadhātu yā ca saññāvedayitanirodhadhātu – imā nu kho, bhante, dhātuyo kathaṃ samāpatti pattabbā’’ti? ‘‘Yā cāyaṃ, bhikkhu, ābhādhātu yā ca subhadhātu yā ca ākāsānañcāyatanadhātu yā ca viññāṇañcāyatanadhātu yā ca ākiñcaññāyatanadhātu – imā dhātuyo saññāsamāpatti pattabbā. Yāyaṃ, bhikkhu, nevasaññānāsaññāyatanadhātu – ayaṃ dhātu saṅkhārāvasesasamāpatti pattabbā. Yāyaṃ, bhikkhu, saññāvedayitanirodhadhātu – ayaṃ dhātu nirodhasamāpatti pattabbā’’ti. Paṭhamaṃ.",
      "english": "Bhikkhus, there are these seven elements. Which seven? The element of light, the element of beauty, the element of the base of infinite space, the element of the base of infinite consciousness, the element of the base of nothingness, the element of the base of neither perception nor non-perception, and the element of the cessation of perception and feeling. These, bhikkhus, are indeed the seven elements.\n\nWhen this was said, a certain bhikkhu asked the Blessed One, \"Venerable Sir, these elements – the element of light, the element of beauty, the element of the base of infinite space, the element of the base of infinite consciousness, the element of the base of nothingness, the element of the base of neither perception nor non-perception, and the element of the cessation of perception and feeling – dependent on what are these elements manifest?\" \"Bhikkhu, the element of light is manifest dependent on darkness. Bhikkhu, the element of beauty is manifest dependent on the unattractive. Bhikkhu, the element of the base of infinite space is manifest dependent on form. Bhikkhu, the element of the base of infinite consciousness is manifest dependent on the base of infinite space. Bhikkhu, the element of the base of nothingness is manifest dependent on the base of infinite consciousness. Bhikkhu, the element of the base of neither perception nor non-perception is manifest dependent on the base of nothingness. Bhikkhu, the element of the cessation of perception and feeling is manifest dependent on cessation.\"\n\n\"Venerable Sir, these elements – the element of light, the element of beauty, the element of the base of infinite space, the element of the base of infinite consciousness, the element of the base of nothingness, the element of the base of neither perception nor non-perception, and the element of the cessation of perception and feeling – how are these elements to be attained as absorptions?\" \"Bhikkhu, these elements – the element of light, the element of beauty, the element of the base of infinite space, the element of the base of infinite consciousness, and the element of the base of nothingness – these elements are to be attained as an absorption of perception. Bhikkhu, the element of the base of neither perception nor non-perception – this element is to be attained as an absorption of residual formations. Bhikkhu, the element of the cessation of perception and feeling – this element is to be attained as an absorption of cessation.\"",
      "sinhala": "\"මහණෙනි, මේ ධාතු සතකි. කවර සතක්ද? ආභාධාතුය, සුභධාතුය, ආකාසානඤ්චායතනධාතුය, විඤ්ඤාණඤ්චායතනධාතුය, ආකිඤ්චඤ්ඤායතනධාතුය, නේවසඤ්ඤානාසඤ්ඤායතනධාතුය, සඤ්ඤාවේදයිතනිරෝධධාතුය – මහණෙනි, මේ ධාතු සතය.\"\n\nමෙසේ වදාළ කල්හි එක්තරා භික්ෂුවක් භාග්‍ය‍වතුන් වහන්සේට මෙය පැවසුවේය: \"වහන්ස, මේ යම් ආභාධාතුවක් වේද, යම් සුභධාතුවක් වේද, යම් ආකාසානඤ්චායතනධාතුවක් වේද, යම් විඤ්ඤාණඤ්චායතනධාතුවක් වේද, යම් ආකිඤ්චඤ්ඤායතනධාතුවක් වේද, යම් නේවසඤ්ඤානාසඤ්ඤායතනධාතුවක් වේද, යම් සඤ්ඤාවේදයිතනිරෝධධාතුවක් වේද – වහන්ස, මේ ධාතූහු කුමක් ඇසුරු කොටගෙන ප්‍ර‍කට වෙත්ද?\"\n\n\"මහණ, යම් මේ ආභාධාතුවක් වේද, මේ ධාතුව අන්ධකාරය ඇසුරු කොටගෙන ප්‍ර‍කට වෙයි. මහණ, යම් මේ සුභධාතුවක් වේද, මේ ධාතුව අසුභය ඇසුරු කොටගෙන ප්‍ර‍කට වෙයි. මහණ, යම් මේ ආකාසානඤ්චායතනධාතුවක් වේද, මේ ධාතුව රූපය ඇසුරු කොටගෙන ප්‍ර‍කට වෙයි. මහණ, යම් මේ විඤ්ඤාණඤ්චායතනධාතුවක් වේද, මේ ධාතුව ආකාසානඤ්චායතනය ඇසුරු කොටගෙන ප්‍ර‍කට වෙයි. මහණ, යම් මේ ආකිඤ්චඤ්ඤායතනධාතුවක් වේද, මේ ධාතුව විඤ්ඤාණඤ්චායතනය ඇසුරු කොටගෙන ප්‍ර‍කට වෙයි. මහණ, යම් මේ නේවසඤ්ඤානාසඤ්ඤායතනධාතුවක් වේද, මේ ධාතුව ආකිඤ්චඤ්ඤායතනය ඇසුරු කොටගෙන ප්‍ර‍කට වෙයි. මහණ, යම් මේ සඤ්ඤාවේදයිතනිරෝධධාතුවක් වේද, මේ ධාතුව නිරෝධය ඇසුරු කොටගෙන ප්‍ර‍කට වෙයි.\"\n\n\"වහන්ස, මේ යම් ආභාධාතුවක් වේද, යම් සුභධාතුවක් වේද, යම් ආකාසානඤ්චායතනධාතුවක් වේද, යම් විඤ්ඤාණඤ්චායතනධාතුවක් වේද, යම් ආකිඤ්චඤ්ඤායතනධාතුවක් වේද, යම් නේවසඤ්ඤානාසඤ්ඤායතනධාතුවක් වේද, යම් සඤ්ඤාවේදයිතනිරෝධධාතුවක් වේද – වහන්ස, මේ ධාතූහු කෙසේ සමාපත්ති වශයෙන් ලබාගත යුත්තාහුද?\"\n\n\"මහණ, යම් මේ ආභාධාතුවක් වේද, යම් සුභධාතුවක් වේද, යම් ආකාසානඤ්චායතනධාතුවක් වේද, යම් විඤ්ඤාණඤ්චායතනධාතුවක් වේද, යම් ආකිඤ්චඤ්ඤායතනධාතුවක් වේද – මේ ධාතූහු සඤ්ඤාසමාපත්ති වශයෙන් ලබාගත යුත්තාහුය. මහණ, යම් මේ නේවසඤ්ඤානාසඤ්ඤායතනධාතුවක් වේද, මේ ධාතුව සංඛාරාවශේෂසමාපත්ති වශයෙන් ලබාගත යුත්තකි. මහණ, යම් මේ සඤ්ඤාවේදයිතනිරෝධධාතුවක් වේද, මේ ධාතුව නිරෝධසමාපත්ති වශයෙන් ලබාගත යුත්තකි.\"",
      "paliTitle": "Sattadhātusuttaṃ",
      "vagga": "Dutiyavaggo",
      "englishTitle": "The Discourse on the Seven Elements",
      "sinhalaTitle": "සත්තධාතු සූත්‍රය",
      "vaggaEnglish": "Second Chapter",
      "vaggaSinhala": "දෙවන වර්ගය"
    },
    {
      "number": 96,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘sanidānaṃ, bhikkhave, uppajjati kāmavitakko, no anidānaṃ; sanidānaṃ uppajjati byāpādavitakko, no anidānaṃ; sanidānaṃ uppajjati vihiṃsāvitakko, no anidānaṃ’’. ‘‘Kathañca, bhikkhave, sanidānaṃ uppajjati kāmavitakko, no anidānaṃ; sanidānaṃ uppajjati byāpādavitakko, no anidānaṃ; sanidānaṃ uppajjati vihiṃsāvitakko, no anidānaṃ? Kāmadhātuṃ, bhikkhave, paṭicca uppajjati kāmasaññā, kāmasaññaṃ paṭicca uppajjati kāmasaṅkappo, kāmasaṅkappaṃ paṭicca uppajjati kāmacchando, kāmacchandaṃ paṭicca uppajjati kāmapariḷāho, kāmapariḷāhaṃ paṭicca uppajjati kāmapariyesanā. Kāmapariyesanaṃ, bhikkhave, pariyesamāno assutavā puthujjano tīhi ṭhānehi micchā paṭipajjati – kāyena, vācāya, manasā. ‘‘Byāpādadhātuṃ, bhikkhave, paṭicca uppajjati byāpādasaññā, byāpādasaññaṃ paṭicca uppajjati byāpādasaṅkappo…pe… byāpādacchando… byāpādapariḷāho… byāpādapariyesanā… byāpādapariyesanaṃ, bhikkhave, pariyesamāno assutavā puthujjano tīhi ṭhānehi micchā paṭipajjati – kāyena, vācāya, manasā. ‘‘Vihiṃsādhātuṃ, bhikkhave, paṭicca uppajjati vihiṃsāsaññā; vihiṃsāsaññaṃ paṭicca uppajjati vihiṃsāsaṅkappo…pe… vihiṃsāchando… vihiṃsāpariḷāho… vihiṃsāpariyesanā… vihiṃsāpariyesanaṃ, bhikkhave, pariyesamāno assutavā puthujjano tīhi ṭhānehi micchā paṭipajjati – kāyena, vācāya, manasā. ‘‘Seyyathāpi, bhikkhave, puriso ādittaṃ tiṇukkaṃ sukkhe tiṇadāye nikkhipeyya; no ce hatthehi ca pādehi ca khippameva nibbāpeyya. Evañhi, bhikkhave, ye tiṇakaṭṭhanissitā pāṇā te anayabyasanaṃ āpajjeyyuṃ. Evameva kho, bhikkhave, yo hi koci samaṇo vā brāhmaṇo vā uppannaṃ visamagataṃ saññaṃ na khippameva pajahati vinodeti byantīkaroti anabhāvaṃ gameti, so diṭṭhe ceva dhamme dukkhaṃ viharati savighātaṃ saupāyāsaṃ sapariḷāhaṃ; kāyassa ca bhedā paraṃ maraṇā duggati pāṭikaṅkhā. ‘‘Sanidānaṃ, bhikkhave, uppajjati nekkhammavitakko, no anidānaṃ; sanidānaṃ uppajjati abyāpādavitakko, no anidānaṃ; sanidānaṃ uppajjati avihiṃsāvitakko, no anidānaṃ. ‘‘Kathañca, bhikkhave, sanidānaṃ uppajjati nekkhammavitakko, no anidānaṃ; sanidānaṃ uppajjati abyāpādavitakko, no anidānaṃ; sanidānaṃ uppajjati avihiṃsāvitakko, no anidānaṃ? Nekkhammadhātuṃ, bhikkhave, paṭicca uppajjati nekkhammasaññā, nekkhammasaññaṃ paṭicca uppajjati nekkhammasaṅkappo, nekkhammasaṅkappaṃ paṭicca uppajjati nekkhammacchando, nekkhammacchandaṃ paṭicca uppajjati nekkhammapariḷāho, nekkhammapariḷāhaṃ paṭicca uppajjati nekkhammapariyesanā; nekkhammapariyesanaṃ, bhikkhave, pariyesamāno sutavā ariyasāvako tīhi ṭhānehi sammā paṭipajjati – kāyena, vācāya, manasā. ‘‘Abyāpādadhātuṃ, bhikkhave, paṭicca uppajjati abyāpādasaññā, abyāpādasaññaṃ paṭicca uppajjati abyāpādasaṅkappo…pe… abyāpādacchando… abyāpādapariḷāho… abyāpādapariyesanā, abyāpādapariyesanaṃ, bhikkhave, pariyesamāno sutavā ariyasāvako tīhi ṭhānehi sammā paṭipajjati – kāyena, vācāya, manasā. ‘‘Avihiṃsādhātuṃ, bhikkhave, paṭicca uppajjati avihiṃsāsaññā, avihiṃsāsaññaṃ paṭicca uppajjati avihiṃsāsaṅkappo, avihiṃsāsaṅkappaṃ paṭicca uppajjati avihiṃsāchando, avihiṃsāchandaṃ paṭicca uppajjati avihiṃsāpariḷāho, avihiṃsāpariḷāhaṃ paṭicca uppajjati avihiṃsāpariyesanā; avihiṃsāpariyesanaṃ, bhikkhave, pariyesamāno sutavā ariyasāvako tīhi ṭhānehi sammā paṭipajjati – kāyena, vācāya, manasā. ‘‘Seyyathāpi, bhikkhave, puriso ādittaṃ tiṇukkaṃ sukkhe tiṇadāye nikkhipeyya; tamenaṃ hatthehi ca pādehi ca khippameva nibbāpeyya. Evañhi, bhikkhave, ye tiṇakaṭṭhanissitā pāṇā te na anayabyasanaṃ āpajjeyyuṃ. Evameva kho, bhikkhave, yo hi koci samaṇo vā brāhmaṇo vā uppannaṃ visamagataṃ saññaṃ khippameva pajahati vinodeti byantīkaroti anabhāvaṃ gameti, so diṭṭhe ceva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ; kāyassa ca bhedā paraṃ maraṇā sugati pāṭikaṅkhā’’ti. Dutiyaṃ.",
      "english": "Monastics, sensual thoughts arise with a cause, not without a cause; thoughts of ill-will arise with a cause, not without a cause; thoughts of harming arise with a cause, not without a cause.\n\nAnd how, monastics, do sensual thoughts arise with a cause, not without a cause; do thoughts of ill-will arise with a cause, not without a cause; do thoughts of harming arise with a cause, not without a cause? Monastics, dependent on the element of sensual pleasure, the perception of sensuality arises. Dependent on the perception of sensuality, the intention for sensuality arises. Dependent on the intention for sensuality, the passionate desire for sensuality arises. Dependent on the passionate desire for sensuality, the torment of sensuality arises. Dependent on the torment of sensuality, the search for sensuality arises. Monastics, an untaught ordinary person, while searching for sensuality, practices wrongly in three ways: by body, by speech, and by mind.\n\nMonastics, dependent on the element of ill-will, the perception of ill-will arises. Dependent on the perception of ill-will, the intention for ill-will arises. Dependent on the intention for ill-will, the passionate desire for ill-will arises. Dependent on the passionate desire for ill-will, the torment of ill-will arises. Dependent on the torment of ill-will, the search for ill-will arises. Monastics, an untaught ordinary person, while searching for ill-will, practices wrongly in three ways: by body, by speech, and by mind.\n\nMonastics, dependent on the element of harming, the perception of harming arises. Dependent on the perception of harming, the intention for harming arises. Dependent on the intention for harming, the passionate desire for harming arises. Dependent on the passionate desire for harming, the torment of harming arises. Dependent on the torment of harming, the search for harming arises. Monastics, an untaught ordinary person, while searching for harming, practices wrongly in three ways: by body, by speech, and by mind.\n\nMonastics, just as if a man were to throw a burning grass torch onto a pile of dry grass, and if he would not quickly extinguish it with his hands and feet, then indeed, monastics, the creatures dwelling in that grass and wood would meet with ruin and disaster. Similarly, monastics, if any ascetic or brahmin does not quickly abandon, dispel, make an end of, or bring to non-existence an arisen inappropriate perception, he dwells in suffering in this very life, with vexation, with despair, and with torment. And with the breaking up of the body, after death, a woeful destination is to be expected.\n\nMonastics, thoughts of renunciation arise with a cause, not without a cause; thoughts of non-ill-will arise with a cause, not without a cause; thoughts of non-harming arise with a cause, not without a cause.\n\nAnd how, monastics, do thoughts of renunciation arise with a cause, not without a cause; do thoughts of non-ill-will arise with a cause, not without a cause; do thoughts of non-harming arise with a cause, not without a cause? Monastics, dependent on the element of renunciation, the perception of renunciation arises. Dependent on the perception of renunciation, the intention for renunciation arises. Dependent on the intention for renunciation, the aspiration for renunciation arises. Dependent on the aspiration for renunciation, the ardor for renunciation arises. Dependent on the ardor for renunciation, the search for renunciation arises. Monastics, a well-taught noble disciple, while searching for renunciation, practices rightly in three ways: by body, by speech, and by mind.\n\nMonastics, dependent on the element of non-ill-will, the perception of non-ill-will arises. Dependent on the perception of non-ill-will, the intention for non-ill-will arises. Dependent on the intention for non-ill-will, the aspiration for non-ill-will arises. Dependent on the aspiration for non-ill-will, the ardor for non-ill-will arises. Dependent on the ardor for non-ill-will, the search for non-ill-will arises. Monastics, a well-taught noble disciple, while searching for non-ill-will, practices rightly in three ways: by body, by speech, and by mind.\n\nMonastics, dependent on the element of non-harming, the perception of non-harming arises. Dependent on the perception of non-harming, the intention for non-harming arises. Dependent on the intention for non-harming, the aspiration for non-harming arises. Dependent on the aspiration for non-harming, the ardor for non-harming arises. Dependent on the ardor for non-harming, the search for non-harming arises. Monastics, a well-taught noble disciple, while searching for non-harming, practices rightly in three ways: by body, by speech, and by mind.\n\nMonastics, just as if a man were to throw a burning grass torch onto a pile of dry grass, and he would quickly extinguish it with his hands and feet, then indeed, monastics, the creatures dwelling in that grass and wood would not meet with ruin and disaster. Similarly, monastics, if any ascetic or brahmin quickly abandons, dispels, makes an end of, or brings to non-existence an arisen inappropriate perception, he dwells in happiness in this very life, without vexation, without despair, and without torment. And with the breaking up of the body, after death, a happy destination is to be expected.",
      "sinhala": "භික්ෂූනි, කාම විතර්කය හටගන්නේ හේතු ඇතුවයි, හේතු රහිතව නොවේ; ව්‍යාපාද විතර්කය හටගන්නේ හේතු ඇතුවයි, හේතු රහිතව නොවේ; විහිංසා විතර්කය හටගන්නේ හේතු ඇතුවයි, හේතු රහිතව නොවේ.\n\nභික්ෂූනි, කෙසේ නම් කාම විතර්කය හේතු ඇතුව හටගනී ද, හේතු රහිතව නොවේ ද? කෙසේ නම් ව්‍යාපාද විතර්කය හේතු ඇතුව හටගනී ද, හේතු රහිතව නොවේ ද? කෙසේ නම් විහිංසා විතර්කය හේතු ඇතුව හටගනී ද, හේතු රහිතව නොවේ ද? භික්ෂූනි, කාම ධාතුව අරභයා කාම සංඥාව හටගනී. කාම සංඥාව අරභයා කාම සංකල්පය හටගනී. කාම සංකල්පය අරභයා කාම ඡන්දය හටගනී. කාම ඡන්දය අරභයා කාම පරිදාහය හටගනී. කාම පරිදාහය අරභයා කාම පරියේෂණය හටගනී.\n\nභික්ෂූනි, කාම පරියේෂණයෙහි යෙදෙන නොඇසූ පෘථග්ජනයා කයෙන්, වචනයෙන්, මනසින් යන තුන් තැනින් මිථ්‍යා ප්‍ර‍තිපදාවේ හැසිරෙයි.\n\nභික්ෂූනි, ව්‍යාපාද ධාතුව අරභයා ව්‍යාපාද සංඥාව හටගනී. ව්‍යාපාද සංඥාව අරභයා ව්‍යාපාද සංකල්පය හටගනී. ව්‍යාපාද සංකල්පය අරභයා ව්‍යාපාද ඡන්දය හටගනී. ව්‍යාපාද ඡන්දය අරභයා ව්‍යාපාද පරිදාහය හටගනී. ව්‍යාපාද පරිදාහය අරභයා ව්‍යාපාද පරියේෂණය හටගනී. භික්ෂූනි, ව්‍යාපාද පරියේෂණයෙහි යෙදෙන නොඇසූ පෘථග්ජනයා කයෙන්, වචනයෙන්, මනසින් යන තුන් තැනින් මිථ්‍යා ප්‍ර‍තිපදාවේ හැසිරෙයි.\n\nභික්ෂූනි, විහිංසා ධාතුව අරභයා විහිංසා සංඥාව හටගනී. විහිංසා සංඥාව අරභයා විහිංසා සංකල්පය හටගනී. විහිංසා සංකල්පය අරභයා විහිංසා ඡන්දය හටගනී. විහිංසා ඡන්දය අරභයා විහිංසා පරිදාහය හටගනී. විහිංසා පරිදාහය අරභයා විහිංසා පරියේෂණය හටගනී. භික්ෂූනි, විහිංසා පරියේෂණයෙහි යෙදෙන නොඇසූ පෘථග්ජනයා කයෙන්, වචනයෙන්, මනසින් යන තුන් තැනින් මිථ්‍යා ප්‍ර‍තිපදාවේ හැසිරෙයි.\n\nභික්ෂූනි, යම් සේ පුරුෂයෙක් ගිනිගත් තණ පුළුක් පිඬක් වියළි තණ ගොඩකට දැමුවහොත්, ඔහු තමන්ගේ අත් පා වලින් ඉක්මණින්ම එය නිවා නොදැමුවහොත්, ඒ තණ කොටන් ආශ්‍රිතව වසන ප්‍රාණීන් විනාශයට හා විපතට පත්වනු ඇත.\n\nභික්ෂූනි, එපරිද්දෙන්ම යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ හටගත් වැරදි මාර්ගයට ගිය සංඥාවක් ඉක්මණින්ම පහකර නොදමයි ද, දුරුකර නොදමයි ද, නැතිකර දමන්නේ නැත් ද, නැති භාවයට පත් නොකරයි ද, ඔහු මේ ජීවිතයේදී ම විඝාත ඇතිව, උපායාස ඇතිව, පරිදාහ ඇතිව, දුකින් වාසය කරයි. කය බිඳී මරණින් මතු දුගතියක් අපේක්ෂා කළ යුතුය.\n\nභික්ෂූනි, නෛෂ්ක්‍ර‍ම්‍ය විතර්කය හටගන්නේ හේතු ඇතුවයි, හේතු රහිතව නොවේ; අව්‍යාපාද විතර්කය හටගන්නේ හේතු ඇතුවයි, හේතු රහිතව නොවේ; අවිහිංසා විතර්කය හටගන්නේ හේතු ඇතුවයි, හේතු රහිතව නොවේ.\n\nභික්ෂූනි, කෙසේ නම් නෛෂ්ක්‍ර‍ම්‍ය විතර්කය හේතු ඇතුව හටගනී ද, හේතු රහිතව නොවේ ද? කෙසේ නම් අව්‍යාපාද විතර්කය හේතු ඇතුව හටගනී ද, හේතු රහිතව නොවේ ද? කෙසේ නම් අවිහිංසා විතර්කය හේතු ඇතුව හටගනී ද, හේතු රහිතව නොවේ ද? භික්ෂූනි, නෛෂ්ක්‍ර‍ම්‍ය ධාතුව අරභයා නෛෂ්ක්‍ර‍ම්‍ය සංඥාව හටගනී. නෛෂ්ක්‍ර‍ම්‍ය සංඥාව අරභයා නෛෂ්ක්‍ර‍ම්‍ය සංකල්පය හටගනී. නෛෂ්ක්‍ර‍ම්‍ය සංකල්පය අරභයා නෛෂ්ක්‍ර‍ම්‍ය ඡන්දය හටගනී. නෛෂ්ක්‍ර‍ම්‍ය ඡන්දය අරභයා නෛෂ්ක්‍ර‍ම්‍ය පරිදාහය හටගනී. නෛෂ්ක්‍ර‍ම්‍ය පරිදාහය අරභයා නෛෂ්ක්‍ර‍ම්‍ය පරියේෂණය හටගනී.\n\nභික්ෂූනි, නෛෂ්ක්‍ර‍ම්‍ය පරියේෂණයෙහි යෙදෙන ඇසූකන් ඇති ආර්ය ශ්‍රාවකයා කයෙන්, වචනයෙන්, මනසින් යන තුන් තැනින් සම්මා ප්‍ර‍තිපදාවේ හැසිරෙයි.\n\nභික්ෂූනි, අව්‍යාපාද ධාතුව අරභයා අව්‍යාපාද සංඥාව හටගනී. අව්‍යාපාද සංඥාව අරභයා අව්‍යාපාද සංකල්පය හටගනී. අව්‍යාපාද සංකල්පය අරභයා අව්‍යාපාද ඡන්දය හටගනී. අව්‍යාපාද ඡන්දය අරභයා අව්‍යාපාද පරිදාහය හටගනී. අව්‍යාපාද පරිදාහය අරභයා අව්‍යාපාද පරියේෂණය හටගනී. භික්ෂූනි, අව්‍යාපාද පරියේෂණයෙහි යෙදෙන ඇසූකන් ඇති ආර්ය ශ්‍රාවකයා කයෙන්, වචනයෙන්, මනසින් යන තුන් තැනින් සම්මා ප්‍ර‍තිපදාවේ හැසිරෙයි.\n\nභික්ෂූනි, අවිහිංසා ධාතුව අරභයා අවිහිංසා සංඥාව හටගනී. අවිහිංසා සංඥාව අරභයා අවිහිංසා සංකල්පය හටගනී. අවිහිංසා සංකල්පය අරභයා අවිහිංසා ඡන්දය හටගනී. අවිහිංසා ඡන්දය අරභයා අවිහිංසා පරිදාහය හටගනී. අවිහිංසා පරිදාහය අරභයා අවිහිංසා පරියේෂණය හටගනී. භික්ෂූනි, අවිහිංසා පරියේෂණයෙහි යෙදෙන ඇසූකන් ඇති ආර්ය ශ්‍රාවකයා කයෙන්, වචනයෙන්, මනසින් යන තුන් තැනින් සම්මා ප්‍ර‍තිපදාවේ හැසිරෙයි.\n\nභික්ෂූනි, යම් සේ පුරුෂයෙක් ගිනිගත් තණ පුළුක් පිඬක් වියළි තණ ගොඩකට දැමුවහොත්, ඔහු තමන්ගේ අත් පා වලින් ඉක්මණින්ම එය නිවා දැමුවහොත්, ඒ තණ කොටන් ආශ්‍රිතව වසන ප්‍රාණීන් විනාශයට හා විපතට පත් නොවනු ඇත.\n\nභික්ෂූනි, එපරිද්දෙන්ම යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ හටගත් වැරදි මාර්ගයට ගිය සංඥාවක් ඉක්මණින්ම පහකර දමයි ද, දුරුකර දමයි ද, නැතිකර දමයි ද, නැති භාවයට පත් කරයි ද, ඔහු මේ ජීවිතයේදී ම විඝාත රහිතව, උපායාස රහිතව, පරිදාහ රහිතව, සැප සේ වාසය කරයි. කය බිඳී මරණින් මතු සුගතියක් අපේක්ෂා කළ යුතුය.",
      "paliTitle": "Sanidānasuttaṃ",
      "englishTitle": "The Discourse on 'With a Cause'",
      "sinhalaTitle": "සනිදාන සූත්‍රය"
    },
    {
      "number": 97,
      "pali": "Ekaṃ samayaṃ bhagavā ñātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Dhātuṃ, bhikkhave, paṭicca uppajjati saññā, uppajjati diṭṭhi, uppajjati vitakko’’ti. Evaṃ vutte, āyasmā kaccāno [saddho kaccāno (ka.)] bhagavantaṃ etadavoca – ‘‘yāyaṃ, bhante, diṭṭhi – ‘asammāsambuddhesu sammāsambuddhā’ti, ayaṃ nu kho, bhante, diṭṭhi kiṃ paṭicca paññāyatī’’ti? ‘‘Mahati kho esā, kaccāna, dhātu yadidaṃ avijjādhātu. Hīnaṃ, kaccāna, dhātuṃ paṭicca uppajjati hīnā saññā, hīnā diṭṭhi, hīno vitakko, hīnā cetanā, hīnā patthanā, hīno paṇidhi, hīno puggalo, hīnā vācā; hīnaṃ ācikkhati deseti paññapeti paṭṭhapeti vivarati vibhajati uttānīkaroti; hīnā tassa upapattīti vadāmi. ‘‘Majjhimaṃ, kaccāna, dhātuṃ paṭicca uppajjati majjhimā saññā, majjhimā diṭṭhi, majjhimo vitakko, majjhimā cetanā, majjhimā patthanā, majjhimo paṇidhi, majjhimo puggalo, majjhimā vācā; majjhimaṃ ācikkhati deseti paññapeti paṭṭhapeti vivarati vibhajati uttānīkaroti; majjhimā tassa upapattīti vadāmi. ‘‘Paṇītaṃ, kaccāna, dhātuṃ paṭicca uppajjati paṇītā saññā, paṇītā diṭṭhi, paṇīto vitakko, paṇītā cetanā, paṇītā patthanā, paṇīto paṇidhi, paṇīto puggalo, paṇītā vācā; paṇītaṃ ācikkhati deseti paññapeti paṭṭhapeti vivarati vibhajati uttānīkaroti; paṇītā tassa upapattīti vadāmī’’ti. Tatiyaṃ.",
      "english": "On one occasion, the Blessed One was dwelling at Ñātika, in the Brick House. There the Blessed One addressed the monks, saying, \"Monks!\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One spoke thus: \"Monks, dependent on an element, perception arises, views arise, and initial application of thought arises.\" When this was said, the Venerable Kaccāna said to the Blessed One: \"Venerable Sir, concerning this view—that 'those who are not Fully Self-Awakened Ones are Fully Self-Awakened Ones'—Venerable Sir, dependent on what does this view manifest?\"\n\n\"Kaccāna, this is indeed a great element, namely, the element of ignorance. Kaccāna, dependent on a base element, a base perception arises, a base view arises, a base initial application of thought arises, a base volition arises, a base aspiration arises, a base resolve arises, a base individual arises, and base speech arises. He describes what is base, teaches it, designates it, establishes it, explains it, analyzes it, and clarifies it. I declare that his future existence is base.\"\n\n\"Kaccāna, dependent on a middle element, a middle perception arises, a middle view arises, a middle initial application of thought arises, a middle volition arises, a middle aspiration arises, a middle resolve arises, a middle individual arises, and middle speech arises. He describes what is middle, teaches it, designates it, establishes it, explains it, analyzes it, and clarifies it. I declare that his future existence is middle.\"\n\n\"Kaccāna, dependent on a sublime element, a sublime perception arises, a sublime view arises, a sublime initial application of thought arises, a sublime volition arises, a sublime aspiration arises, a sublime resolve arises, a sublime individual arises, and sublime speech arises. He describes what is sublime, teaches it, designates it, establishes it, explains it, analyzes it, and clarifies it. I declare that his future existence is sublime.\"",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ ඤාති නගරයෙහි ගිඤ්ජකාවසථ නම් උයනෙහි වැඩ වාසය කරන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලාට \"මහණෙනි\" කියා ආමන්ත්‍රණය කළ සේක. \"ස්වාමීනී\" යැයි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, ධාතුවක් පදනම් කරගෙන සංඥාව උපදී, දෘෂ්ටිය උපදී, විතර්කය උපදී.\"\n\nමෙසේ වදාළ කල්හි, ආයුෂ්මත් කච්චාන භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය: \"ස්වාමීනී, 'සම්මා සම්බුදුවරු නොවන අය සම්මා සම්බුදුවරුන්ය' යන යම් මේ දෘෂ්ටියක් වේද, ස්වාමීනී, මේ දෘෂ්ටිය කුමක් පදනම් කරගෙන ඇතිවේද?\"\n\n\"කච්චාන, මේ මහා ධාතුවක්ය, ඒ නම් අවිද්‍යා ධාතුවයි.\"\n\n\"කච්චාන, හීන ධාතුවක් පදනම් කරගෙන හීන සංඥාව උපදී, හීන දෘෂ්ටිය උපදී, හීන විතර්කය උපදී, හීන චේතනාව උපදී, හීන ප්‍රාර්ථනාව උපදී, හීන ප්‍රණිධිය උපදී, හීන පුද්ගලයා උපදී, හීන වචනය උපදී; හීන දේ ප්‍රකාශ කරයි, දේශනා කරයි, පනවයි, පිහිටුවයි, විවෘත කරයි, විභාග කරයි, ප්‍රකට කරයි; ඔහුගේ උපපත්තිය හීන වේ යැයි මම වදාරමි.\"\n\n\"කච්චාන, මධ්‍යම ධාතුවක් පදනම් කරගෙන මධ්‍යම සංඥාව උපදී, මධ්‍යම දෘෂ්ටිය උපදී, මධ්‍යම විතර්කය උපදී, මධ්‍යම චේතනාව උපදී, මධ්‍යම ප්‍රාර්ථනාව උපදී, මධ්‍යම ප්‍රණිධිය උපදී, මධ්‍යම පුද්ගලයා උපදී, මධ්‍යම වචනය උපදී; මධ්‍යම දේ ප්‍රකාශ කරයි, දේශනා කරයි, පනවයි, පිහිටුවයි, විවෘත කරයි, විභාග කරයි, ප්‍රකට කරයි; ඔහුගේ උපපත්තිය මධ්‍යම වේ යැයි මම වදාරමි.\"\n\n\"කච්චාන, ප්‍රණීත ධාතුවක් පදනම් කරගෙන ප්‍රණීත සංඥාව උපදී, ප්‍රණීත දෘෂ්ටිය උපදී, ප්‍රණීත විතර්කය උපදී, ප්‍රණීත චේතනාව උපදී, ප්‍රණීත ප්‍රාර්ථනාව උපදී, ප්‍රණීත ප්‍රණිධිය උපදී, ප්‍රණීත පුද්ගලයා උපදී, ප්‍රණීත වචනය උපදී; ප්‍රණීත දේ ප්‍රකාශ කරයි, දේශනා කරයි, පනවයි, පිහිටුවයි, විවෘත කරයි, විභාග කරයි, ප්‍රකට කරයි; ඔහුගේ උපපත්තිය ප්‍රණීත වේ යැයි මම වදාරමි.\"",
      "paliTitle": "Giñjakāvasathasuttaṃ",
      "englishTitle": "At the Brick House Sutta",
      "sinhalaTitle": "ගිඤ්ජකාවසථ සූත්‍රය"
    },
    {
      "number": 98,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova [dhātuso (sī. pī.) ayañca paṭhamārambhavākyeyeva, na sabbattha. tīsu pana addhāsu ca upamāsaṃsandananigamanaṭṭhāne ca idaṃ pāṭhanānattaṃ natthi], bhikkhave, sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samenti’’. ‘‘Atītampi kho [khosaddo sī. syā. kaṃ. pī. potthakesu natthi], bhikkhave, addhānaṃ dhātusova [īdisesu ṭhānesu pāṭhanānattaṃ natthi] sattā saṃsandiṃsu samiṃsu. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandiṃsu samiṃsu; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandiṃsu samiṃsu. ‘‘Anāgatampi kho [khosaddo sī. syā. kaṃ. pī. potthakesu natthi], bhikkhave, addhānaṃ dhātusova [īdisesu ṭhānesu pāṭhanānattaṃ natthi] sattā saṃsandissanti samessanti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandissanti samessanti; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandissanti samessanti. ‘‘Etarahipi kho [khosaddo sī. syā. kaṃ. pī. potthakesu natthi], bhikkhave, paccuppannaṃ addhānaṃ dhātusova [īdisesu ṭhānesu pāṭhanānattaṃ natthi] sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samentī’’ti. Catutthaṃ.",
      "english": "Bhikkhus, beings associate and come together according to their dispositions. Those of inferior disposition associate and come together with those of inferior disposition; those of noble disposition associate and together with those of noble disposition.\n\nIndeed, Bhikkhus, in the past, beings associated and came together according to their dispositions. Those of inferior disposition associated and came together with those of inferior disposition; those of noble disposition associated and came together with those of noble disposition.\n\nIndeed, Bhikkhus, in the future, beings will associate and come together according to their dispositions. Those of inferior disposition will associate and come together with those of inferior disposition; those of noble disposition will associate and come together with those of noble disposition.\n\nAnd indeed, Bhikkhus, in the present, beings associate and come together according to their dispositions. Those of inferior disposition associate and come together with those of inferior disposition; those of noble disposition associate and come together with those of noble disposition.",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක. භික්ෂූනි, ධාතු වශයෙන්ම සත්වයෝ එකතු වෙති, සමග වෙති. හීන අධිමුක්ති ඇති සත්වයෝ හීන අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වෙති, සමග වෙති. කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයෝ කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වෙති, සමග වෙති.\n\nඅතීතයෙහි ද භික්ෂූනි, ධාතු වශයෙන්ම සත්වයෝ එකතු වූහ, සමග වූහ. හීන අධිමුක්ති ඇති සත්වයෝ හීන අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වූහ, සමග වූහ. කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයෝ කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වූහ, සමග වූහ.\n\nඅනාගතයෙහි ද භික්ෂූනි, ධාතු වශයෙන්ම සත්වයෝ එකතු වන්නාහ, සමග වන්නාහ. හීන අධිමුක්ති ඇති සත්වයෝ හීන අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වන්නාහ, සමග වන්නාහ. කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයෝ කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වන්නාහ, සමග වන්නාහ.\n\nවර්තමානයෙහි ද භික්ෂූනි, ධාතු වශයෙන්ම සත්වයෝ එකතු වෙති, සමග වෙති. හීන අධිමුක්ති ඇති සත්වයෝ හීන අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වෙති, සමග වෙති. කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයෝ කල\\u200D්\\u200Dයාණ අධිමුක්ති ඇති සත්වයන් සමඟ එකතු වෙති, සමග වෙති.",
      "paliTitle": "Hīnādhimuttikasuttaṃ",
      "englishTitle": "Those of Low Inclinations Sutta",
      "sinhalaTitle": "හීනාධිමුත්තික සූත්‍රය"
    },
    {
      "number": 99,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena āyasmā sāriputto sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati; āyasmāpi kho mahāmoggallāno sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati; āyasmāpi kho mahākassapo sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati; āyasmāpi kho anuruddho sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati; āyasmāpi kho puṇṇo mantāniputto sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati; āyasmāpi kho upāli sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati; āyasmāpi kho ānando sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati; devadattopi kho sambahulehi bhikkhūhi saddhiṃ bhagavato avidūre caṅkamati. Atha kho bhagavā bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, sāriputtaṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū mahāpaññā. Passatha no tumhe, bhikkhave, moggallānaṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū mahiddhikā. Passatha no tumhe, bhikkhave, kassapaṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū dhutavādā. Passatha no tumhe, bhikkhave, anuruddhaṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū dibbacakkhukā. Passatha no tumhe, bhikkhave, puṇṇaṃ mantāniputtaṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū dhammakathikā. Passatha no tumhe, bhikkhave, upāliṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū vinayadharā. Passatha no tumhe, bhikkhave, ānandaṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū bahussutā. Passatha no tumhe, bhikkhave, devadattaṃ sambahulehi bhikkhūhi saddhiṃ caṅkamanta’’nti? ‘‘Evaṃ, bhante’’. ‘‘Sabbe kho ete, bhikkhave, bhikkhū pāpicchā’’. ‘‘Dhātusova, bhikkhave, sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samenti. Atītampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandiṃsu samiṃsu. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandiṃsu samiṃsu; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandiṃsu samiṃsu. ‘‘Anāgatampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandissanti samessanti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandissanti samessanti; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandissanti samessanti. ‘‘Etarahipi kho, bhikkhave, paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti; kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samentī’’ti. Pañcamaṃ.",
      "english": "At one time the Blessed One was dwelling in Rājagaha, on Gijjhakūṭa Mountain. At that time, the Venerable Sāriputta was walking meditation not far from the Blessed One, together with many bhikkhus. The Venerable Mahāmoggallāna was also walking meditation not far from the Blessed One, together with many bhikkhus. The Venerable Mahākassapa was also walking meditation not far from the Blessed One, together with many bhikkhus. The Venerable Anuruddha was also walking meditation not far from the Blessed One, together with many bhikkhus. The Venerable Puṇṇa Mantāniputta was also walking meditation not far from the Blessed One, together with many bhikkhus. The Venerable Upāli was also walking meditation not far from the Blessed One, together with many bhikkhus. The Venerable Ānanda was also walking meditation not far from the Blessed One, together with many bhikkhus. Devadatta was also walking meditation not far from the Blessed One, together with many bhikkhus. Then the Blessed One addressed the bhikkhus, saying, \"Do you see, bhikkhus, Sāriputta walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, are greatly wise.\" \"Do you see, bhikkhus, Moggallāna walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, are greatly accomplished in psychic power.\" \"Do you see, bhikkhus, Kassapa walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, are expounders of austere practices.\" \"Do you see, bhikkhus, Anuruddha walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, possess the divine eye.\" \"Do you see, bhikkhus, Puṇṇa Mantāniputta walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, are expounders of the Dhamma.\" \"Do you see, bhikkhus, Upāli walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, are holders of the Vinaya.\" \"Do you see, bhikkhus, Ānanda walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, are extensively learned.\" \"Do you see, bhikkhus, Devadatta walking meditation together with many bhikkhus?\" \"Yes, Venerable Sir.\" \"All these bhikkhus, bhikkhus, are of evil wishes.\"\n\n\"Bhikkhus, beings associate and gather together according to their elements and dispositions. Those of inferior inclination associate and gather together with those of inferior inclination; those of noble inclination associate and gather together with those of noble inclination. In the past, too, bhikkhus, beings associated and gathered together according to their elements and dispositions. Those of inferior inclination associated and gathered together with those of inferior inclination; those of noble inclination associated and gathered together with those of noble inclination. In the future, too, bhikkhus, beings will associate and gather together according to their elements and dispositions. Those of inferior inclination will associate and gather together with those of inferior inclination; those of noble inclination will associate and gather together with those of noble inclination. And at present, too, bhikkhus, beings associate and gather together according to their elements and dispositions. Those of inferior inclination associate and gather together with those of inferior inclination; those of noble inclination associate and gather together with those of noble inclination.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජුකුළු පව්වෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියහ; ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේද බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියහ; ආයුෂ්මත් මහා කාශ්‍යප ස්ථවිරයන් වහන්සේද බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියහ; ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේද බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියහ; ආයුෂ්මත් පුණ්ණ මන්තානිපුත්ත ස්ථවිරයන් වහන්සේද බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියහ; ආයුෂ්මත් උපාලි ස්ථවිරයන් වහන්සේද බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියහ; ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේද බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියහ; දේවදත්තද බොහෝ භික්ෂූන් සමඟ භාග්‍යවතුන් වහන්සේට නුදුරින් සක්මන් කරමින් සිටියේය. ඉක්බිති භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන සාරිපුත්ත ස්ථවිරයන් වහන්සේ දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු මහා ප්‍රාඥයෝය. මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු මහත් සෘද්ධි බල ඇත්තෝය. මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන කාශ්‍යප ස්ථවිරයන් වහන්සේ දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු ධුතාංගධාරීහුය. මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන අනුරුද්ධ ස්ථවිරයන් වහන්සේ දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු දිවැස් ඇත්තෝය. මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන පුණ්ණ මන්තානිපුත්ත ස්ථවිරයන් වහන්සේ දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු ධර්ම කථිකයෝය. මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන උපාලි ස්ථවිරයන් වහන්සේ දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු විනයධරයෝය. මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන ආනන්ද ස්ථවිරයන් වහන්සේ දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු බහුශ්‍රැතයෝය. මහණෙනි, බොහෝ භික්ෂූන් සමඟ සක්මන් කරන දේවදත්ත දකින්නහුද?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ සියලු භික්ෂූහු පාපී ආශාවන් ඇත්තෝය.\"\n\nමහණෙනි, සත්වයෝ ධාතු වශයෙන්ම එක්වෙති, හමුවෙති. හීන අධිමුක්තියෙන් යුක්ත වූවෝ හීන අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක්වෙති, හමුවෙති; කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවෝ කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක්වෙති, හමුවෙති.\n\nමහණෙනි, අතීත කාලයෙහිද ධාතු වශයෙන්ම සත්වයෝ එක් වූහ, හමු වූහ. හීන අධිමුක්තියෙන් යුක්ත වූවෝ හීන අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක් වූහ, හමු වූහ; කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවෝ කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක් වූහ, හමු වූහ.\n\nමහණෙනි, අනාගත කාලයෙහිද ධාතු වශයෙන්ම සත්වයෝ එක්වන්නාහුය, හමුවන්නාහුය. හීන අධිමුක්තියෙන් යුක්ත වූවෝ හීන අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක්වන්නාහුය, හමුවන්නාහුය; කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවෝ කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක්වන්නාහුය, හමුවන්නාහුය.\n\nමහණෙනි, වර්තමාන කාලයෙහිද ධාතු වශයෙන්ම සත්වයෝ එක්වෙති, හමුවෙති. හීන අධිමුක්තියෙන් යුක්ත වූවෝ හීන අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක්වෙති, හමුවෙති; කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවෝ කල්‍යාණ අධිමුක්තියෙන් යුක්ත වූවන් සමඟම එක්වෙති, හමුවෙති.",
      "paliTitle": "Caṅkamasuttaṃ",
      "englishTitle": "The Discourse on Walking Meditation",
      "sinhalaTitle": "චංකම සූත්‍රය"
    },
    {
      "number": 100,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti. Atītampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandiṃsu samiṃsu. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandiṃsu samiṃsu’’. ‘‘Anāgatampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandissanti samessanti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandissanti samessanti. ‘‘Etarahipi kho, bhikkhave, paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti. ‘‘Seyyathāpi, bhikkhave, gūtho gūthena saṃsandati sameti; muttaṃ muttena saṃsandati sameti; kheḷo kheḷena saṃsandati sameti; pubbo pubbena saṃsandati sameti; lohitaṃ lohitena saṃsandati sameti; evameva kho, bhikkhave, dhātusova [sabbatthapi evameva dissati] sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti. Atītampi kho addhānaṃ…pe… anāgatampi kho addhānaṃ…pe… etarahipi kho paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Hīnādhimuttikā hīnādhimuttikehi saddhiṃ saṃsandanti samenti. ‘‘Dhātusova bhikkhave, sattā saṃsandanti samenti. Kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samenti. Atītampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandiṃsu samiṃsu. Kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandiṃsu samiṃsu. ‘‘Anāgatampi kho, bhikkhave, addhānaṃ…pe… etarahipi kho, bhikkhave, paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samenti. ‘‘Seyyathāpi, bhikkhave, khīraṃ khīrena saṃsandati sameti; telaṃ telena saṃsandati sameti; sappi sappinā saṃsandati sameti; madhu madhunā saṃsandati sameti; phāṇitaṃ phāṇitena saṃsandati sameti; evameva kho, bhikkhave, dhātusova sattā saṃsandanti samenti. Kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samenti. Atītampi kho addhānaṃ… anāgatampi kho addhānaṃ… etarahipi kho paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Kalyāṇādhimuttikā kalyāṇādhimuttikehi saddhiṃ saṃsandanti samentī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Saṃsaggā vanatho jāto, asaṃsaggena chijjati; Parittaṃ dārumāruyha, yathā sīde mahaṇṇave. ‘‘Evaṃ kusītamāgamma, sādhujīvipi sīdati; Tasmā taṃ parivajjeyya, kusītaṃ hīnavīriyaṃ. ‘‘Pavivittehi ariyehi, pahitattehi jhāyīhi [jhāyihi (sī.), jhāyibhi (syā. kaṃ.)]; Niccaṃ āraddhavīriyehi, paṇḍitehi sahāvase’’ti.",
      "english": "The Blessed One was staying at Sāvatthī. There he addressed the bhikkhus, saying:\n\n“Monks, beings associate and come together by their very dispositions. Those of inferior disposition associate and come together with those of inferior disposition. And indeed, Monks, in the past time, beings associated and came together by their very dispositions. Those of inferior disposition associated and came together with those of inferior disposition. And indeed, Monks, in the future time, beings will associate and come together by their very dispositions. Those of inferior disposition will associate and come together with those of inferior disposition. And indeed, Monks, at present, in the current time, beings associate and come together by their very dispositions. Those of inferior disposition associate and come together with those of inferior disposition.\n\n“Just as, Monks, feces associate and come together with feces, urine with urine, spittle with spittle, pus with pus, blood with blood; just so, Monks, do beings associate and come together by their very dispositions. Those of inferior disposition associate and come together with those of inferior disposition. And indeed, in the past time, beings associated and came together by their very dispositions; those of inferior disposition associated and came together with those of inferior disposition. And indeed, in the future time, beings will associate and come together by their very dispositions; those of inferior disposition will associate and come together with those of inferior disposition. And indeed, at present, in the current time, beings associate and come together by their very dispositions; those of inferior disposition associate and come together with those of inferior disposition.\n\n“Monks, beings associate and come together by their very dispositions. Those of noble disposition associate and come together with those of noble disposition. And indeed, Monks, in the past time, beings associated and came together by their very dispositions. Those of noble disposition associated and came together with those of noble disposition. And indeed, Monks, in the future time, beings will associate and come together by their very dispositions. Those of noble disposition will associate and come together with those of noble disposition. And indeed, Monks, at present, in the current time, beings associate and come together by their very dispositions. Those of noble disposition associate and come together with those of noble disposition.\n\n“Just as, Monks, milk associates and comes together with milk, oil with oil, ghee with ghee, honey with honey, molasses with molasses; just so, Monks, do beings associate and come together by their very dispositions. Those of noble disposition associate and come together with those of noble disposition. And indeed, in the past time, beings associated and came together by their very dispositions; those of noble disposition associated and came together with those of noble disposition. And indeed, in the future time, beings will associate and come together by their very dispositions; those of noble disposition will associate and come together with those of noble disposition. And indeed, at present, in the current time, beings associate and come together by their very dispositions; those of noble disposition associate and come together with those of noble disposition.”\n\nThe Blessed One said this. Having said this, the Fortunate One, the Teacher, further said this:\n\n“From association, the forest of craving arises;\nIt is cut off by non-association.\nJust as one, having boarded a tiny piece of wood,\nWould sink in the great ocean;\n\nSo too, having associated with a lazy person,\nEven one living nobly sinks down.\nTherefore, one should avoid that lazy person,\nLacking in energy.\n\nWith the Noble Ones who are secluded,\nWho have dedicated themselves to spiritual practice, who are meditators,\nWho are constantly energetic, with the wise ones—\nOne should dwell together.”",
      "sinhala": "භික්‍ෂූනි, සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති.\n\nභික්‍ෂූනි, අතීත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වූහ, සමීප වූහ. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වූහ, සමීප වූහ.\n\nභික්‍ෂූනි, අනාගත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වන්නාහ, සමීප වන්නාහ. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වන්නාහ, සමීප වන්නාහ.\n\nභික්‍ෂූනි, වර්තමාන කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති.\n\nභික්‍ෂූනි, යම් සේ ගූථය ගූථය සමඟ එක්රැස් වේද, මුත්‍ර මුත්‍ර සමඟ එක්රැස් වේද, කෙළ කෙළ සමඟ එක්රැස් වේද, සැරව සැරව සමඟ එක්රැස් වේද, ලේ ලේ සමඟ එක්රැස් වේද; එපරිද්දෙන්ම භික්‍ෂූනි, සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති. අතීත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වූහ, සමීප වූහ. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වූහ, සමීප වූහ. අනාගත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වන්නාහ, සමීප වන්නාහ. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වන්නාහ, සමීප වන්නාහ. වර්තමාන කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. හීන අධිමුක්තියක් ඇති අය, හීන අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති.\n\nභික්‍ෂූනි, සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති.\n\nභික්‍ෂූනි, අතීත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වූහ, සමීප වූහ. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වූහ, සමීප වූහ.\n\nභික්‍ෂූනි, අනාගත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වන්නාහ, සමීප වන්නාහ. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වන්නාහ, සමීප වන්නාහ.\n\nභික්‍ෂූනි, වර්තමාන කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති.\n\nභික්‍ෂූනි, යම් සේ කිරි කිරි සමඟ එක්රැස් වේද, තෙල් තෙල් සමඟ එක්රැස් වේද, ගිතෙල් ගිතෙල් සමඟ එක්රැස් වේද, මී පැණි මී පැණි සමඟ එක්රැස් වේද, පැණි පැණි සමඟ එක්රැස් වේද; එපරිද්දෙන්ම භික්‍ෂූනි, සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති. අතීත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වූහ, සමීප වූහ. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වූහ, සමීප වූහ. අනාගත කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වන්නාහ, සමීප වන්නාහ. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වන්නාහ, සමීප වන්නාහ. වර්තමාන කාලයෙහිද සත්ත්වයෝ තමන්ගේ ධාතූන්ටම අනුව එක්රැස් වෙති, සමීප වෙති. කල්‍යාණ අධිමුක්තියක් ඇති අය, කල්‍යාණ අධිමුක්තියක් ඇති අය සමඟම එක්රැස් වෙති, සමීප වෙති.\n\nභාග්‍යවතුන් වහන්සේ මේ දේශනාව වදාළ සේක. මනාකොට වදාළ භාග්‍යවතුන් වහන්සේ, ශාස්තෘන් වහන්සේ මේ කාරණයද වදාළ සේක:\n\nඇසුරු කිරීමෙන් වනය (තණ්හාව) හටගනියි,\nඇසුරු නොකිරීමෙන් එය සිඳී යයි.\nමහ සයුර මැදදී කුඩා දර කැබැල්ලකට නැඟී ගිය තැනැත්තා කිඳා බසින්නාක් මෙන්,\nඑලෙසම කුසීතයෙකු ඇසුරු කිරීමෙන් යහපත් ජීවිතයක් ගත කරන තැනැත්තාද කිඳා බසින්නේය.\nඑබැවින්, කුසීත වූ, හීන වීර්යය ඇති, ඒ තැනැත්තා වළකා හරින්න.\nතපහන ඇති, ධ්‍යායී වූ, නිරතුරුවම වීර්යය වඩන, ප්‍රවිවිත්ත වූ ආර්යයන් සමඟත්, පණ්ඩිතයන් සමඟත් නිරතුරු ඇසුරෙහි යෙදෙන්න.",
      "paliTitle": "Sagāthāsuttaṃ",
      "englishTitle": "The Discourse with Verses",
      "sinhalaTitle": "සගාථා සූත්‍රය"
    },
    {
      "number": 101,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Assaddhā assaddhehi saddhiṃ saṃsandanti samenti; ahirikā ahirikehi saddhiṃ saṃsandanti samenti; anottappino anottappīhi saddhiṃ saṃsandanti samenti; appassutā appassutehi saddhiṃ saṃsandanti samenti; kusītā kusītehi saddhiṃ saṃsandanti samenti; muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti’’. ‘‘Atītampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandiṃsu samiṃsu. Assaddhā assaddhehi saddhiṃ saṃsandiṃsu samiṃsu; ahirikā ahirikehi saddhiṃ saṃsandiṃsu samiṃsu; anottappino anottappīhi saddhiṃ saṃsandiṃsu samiṃsu; appassutā appassutehi saddhiṃ saṃsandiṃsu samiṃsu; kusītā kusītehi saddhiṃ saṃsandiṃsu samiṃsu; muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandiṃsu samiṃsu; duppaññā duppaññehi saddhiṃ saṃsandiṃsu samiṃsu. ‘‘Anāgatampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandissanti samessanti. Assaddhā assaddhehi saddhiṃ saṃsandissanti samessanti; ahirikā ahirikehi saddhiṃ saṃsandissanti samessanti; anottappino anottappīhi saddhiṃ…pe… appassutā appassutehi saddhiṃ…pe… kusītā kusītehi saddhiṃ…pe… muṭṭhassatino muṭṭhassatīhi saddhiṃ…pe… duppaññā duppaññehi saddhiṃ saṃsandissanti samessanti. ‘‘Etarahipi kho, bhikkhave, paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Assaddhā assaddhehi saddhiṃ saṃsandanti samenti; ahirikā ahirikehi saddhiṃ…pe… anottappino anottappīhi saddhiṃ…pe… appassutā appassutehi saddhiṃ…pe… kusītā kusītehi saddhiṃ…pe… muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti. ‘‘Dhātusova, bhikkhave, sattā saṃsandanti samenti. Saddhā saddhehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti; ottappino ottappīhi saddhiṃ saṃsandanti samenti; bahussutā bahussutehi saddhiṃ saṃsandanti samenti; āraddhavīriyā āraddhavīriyehi saddhiṃ saṃsandanti samenti; upaṭṭhitassatino upaṭṭhitassatīhi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samenti. Atītampi kho, bhikkhave, addhānaṃ…pe… anāgatampi kho, bhikkhave…pe… etarahipi kho, bhikkhave, paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Saddhā saddhehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentī’’ti. Sattamaṃ.",
      "english": "Bhikkhus, beings associate and come together according to their nature. Those without faith associate and come together with those without faith; those who are shameless associate and come together with those who are shameless; those without moral dread associate and come together with those without moral dread; those who are unlearned associate and come together with those who are unlearned; those who are indolent associate and come together with those who are indolent; those with lost mindfulness associate and come together with those with lost mindfulness; those who are unwise associate and come together with those who are unwise.\n\nBhikkhus, in the past too, beings associated and came together according to their nature. Those without faith associated and came together with those without faith; those who were shameless associated and came together with those who were shameless; those without moral dread associated and came together with those without moral dread; those who were unlearned associated and came together with those who were unlearned; those who were indolent associated and came together with those who were indolent; those with lost mindfulness associated and came together with those with lost mindfulness; those who were unwise associated and came together with those who were unwise.\n\nBhikkhus, in the future too, beings will associate and come together according to their nature. Those without faith will associate and come together with those without faith; those who are shameless will associate and come together with those who are shameless; those without moral dread will associate and come together with those without moral dread; those who are unlearned will associate and come together with those who are unlearned; those who are indolent will associate and come together with those who are indolent; those with lost mindfulness will associate and come together with those with lost mindfulness; those who are unwise will associate and come together with those who are unwise.\n\nBhikkhus, in the present time too, beings associate and come together according to their nature. Those without faith associate and come together with those without faith; those who are shameless associate and come together with those who are shameless; those without moral dread associate and come together with those without moral dread; those who are unlearned associate and come together with those who are unlearned; those who are indolent associate and come together with those who are indolent; those with lost mindfulness associate and come together with those with lost mindfulness; those who are unwise associate and come together with those who are unwise.\n\nBhikkhus, beings associate and come together according to their nature. Those with faith associate and come together with those with faith; those who are conscientious associate and come together with those who are conscientious; those with moral dread associate and come together with those with moral dread; those who are well-learned associate and come together with those who are well-learned; those with aroused energy associate and come together with those with aroused energy; those with established mindfulness associate and come together with those with established mindfulness; those who are wise associate and come together with those who are wise.\n\nBhikkhus, in the past too, beings associated and came together according to their nature. Those with faith associated and came together with those with faith; those who were conscientious associated and came together with those who were conscientious; those with moral dread associated and came together with those with moral dread; those who were well-learned associated and came together with those who were well-learned; those with aroused energy associated and came together with those who were with aroused energy; those with established mindfulness associated and came together with those with established mindfulness; those who were wise associated and came together with those who were wise.\n\nBhikkhus, in the future too, beings will associate and come together according to their nature. Those with faith will associate and come together with those with faith; those who are conscientious will associate and come together with those who are conscientious; those with moral dread will associate and come together with those with moral dread; those who are well-learned will associate and come together with those who are well-learned; those with aroused energy will associate and come together with those with aroused energy; those with established mindfulness will associate and come together with those with established mindfulness; those who are wise will associate and come together with those who are wise.\n\nBhikkhus, in the present time too, beings associate and come together according to their nature. Those with faith associate and come together with those with faith; those who are conscientious associate and come together with those who are conscientious; those with moral dread associate and come together with those with moral dread; those who are well-learned associate and come together with those who are well-learned; those with aroused energy associate and come together with those with aroused energy; those with established mindfulness associate and come together with those with established mindfulness; those who are wise associate and come together with those who are wise.",
      "sinhala": "මහණෙනි, සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වෙති, සමගිවෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එක්වෙති, සමගිවෙති; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එක්වෙති, සමගිවෙති; අපත්‍රාපීහු අපත්‍රාපීන් සමඟ එක්වෙති, සමගිවෙති; අල්ප ශ්‍රැතයෝ අල්ප ශ්‍රැතයන් සමඟ එක්වෙති, සමගිවෙති; කුසීතයෝ කුසීතයන් සමඟ එක්වෙති, සමගිවෙති; මුළා සිහියෙන් යුක්ත වූවෝ මුළා සිහියෙන් යුක්ත වූවන් සමඟ එක්වෙති, සමගිවෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එක්වෙති, සමගිවෙති.\n\nමහණෙනි, අතීත කාලයේදී ද සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වූහ, සමගිවූහ. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එක්වූහ, සමගිවූහ; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එක්වූහ, සමගිවූහ; අපත්‍රාපීහු අපත්‍රාපීන් සමඟ එක්වූහ, සමගිවූහ; අල්ප ශ්‍රැතයෝ අල්ප ශ්‍රැතයන් සමඟ එක්වූහ, සමගිවූහ; කුසීතයෝ කුසීතයන් සමඟ එක්වූහ, සමගිවූහ; මුළා සිහියෙන් යුක්ත වූවෝ මුළා සිහියෙන් යුක්ත වූවන් සමඟ එක්වූහ, සමගිවූහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එක්වූහ, සමගිවූහ.\n\nමහණෙනි, අනාගත කාලයේදී ද සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වනු ඇත, සමගිවනු ඇත. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; අපත්‍රාපීහු අපත්‍රාපීන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; අල්ප ශ්‍රැතයෝ අල්ප ශ්‍රැතයන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; කුසීතයෝ කුසීතයන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; මුළා සිහියෙන් යුක්ත වූවෝ මුළා සිහියෙන් යුක්ත වූවන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එක්වනු ඇත, සමගිවනු ඇත.\n\nමහණෙනි, වර්තමාන කාලයේදී ද සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වෙති, සමගිවෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එක්වෙති, සමගිවෙති; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එක්වෙති, සමගිවෙති; අපත්‍රාපීහු අපත්‍රාපීන් සමඟ එක්වෙති, සමගිවෙති; අල්ප ශ්‍රැතයෝ අල්ප ශ්‍රැතයන් සමඟ එක්වෙති, සමගිවෙති; කුසීතයෝ කුසීතයන් සමඟ එක්වෙති, සමගිවෙති; මුළා සිහියෙන් යුක්ත වූවෝ මුළා සිහියෙන් යුක්ත වූවන් සමඟ එක්වෙති, සමගිවෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එක්වෙති, සමගිවෙති.\n\nමහණෙනි, සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වෙති, සමගිවෙති. ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එක්වෙති, සමගිවෙති; හිරිමත්වූවෝ හිරිමත්වූවන් සමඟ එක්වෙති, සමගිවෙති; ඕතප්පීහු ඕතප්පීන් සමඟ එක්වෙති, සමගිවෙති; බහුශ්‍රැතයෝ බහුශ්‍රැතයන් සමඟ එක්වෙති, සමගිවෙති; ආරම්භ වීර්යය ඇති අය ආරම්භ වීර්යයය ඇති අය සමඟ එක්වෙති, සමගිවෙති; මනා සිහියෙන් යුක්ත වූවෝ මනා සිහියෙන් යුක්ත වූවන් සමඟ එක්වෙති, සමගිවෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එක්වෙති, සමගිවෙති.\n\nමහණෙනි, අතීත කාලයේදී ද සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වූහ, සමගිවූහ. ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එක්වූහ, සමගිවූහ; හිරිමත්වූවෝ හිරිමත්වූවන් සමඟ එක්වූහ, සමගිවූහ; ඕතප්පීහු ඕතප්පීන් සමඟ එක්වූහ, සමගිවූහ; බහුශ්‍රැතයෝ බහුශ්‍රැතයන් සමඟ එක්වූහ, සමගිවූහ; ආරම්භ වීර්යයය ඇති අය ආරම්භ වීර්යයය ඇති අය සමඟ එක්වූහ, සමගිවූහ; මනා සිහියෙන් යුක්ත වූවෝ මනා සිහියෙන් යුක්ත වූවන් සමඟ එක්වූහ, සමගිවූහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එක්වූහ, සමගිවූහ. මහණෙනි, අනාගත කාලයේදී ද සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වනු ඇත, සමගිවනු ඇත. ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; හිරිමත්වූවෝ හිරිමත්වූවන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; ඕතප්පීහු ඕතප්පීන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; බහුශ්‍රැතයෝ බහුශ්‍රැතයන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; ආරම්භ වීර්යයය ඇති අය ආරම්භ වීර්යයය ඇති අය සමඟ එක්වනු ඇත, සමගිවනු ඇත; මනා සිහියෙන් යුක්ත වූවෝ මනා සිහියෙන් යුක්ත වූවන් සමඟ එක්වනු ඇත, සමගිවනු ඇත; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එක්වනු ඇත, සමගිවනු ඇත. මහණෙනි, වර්තමාන කාලයේදී ද සත්ත්වයෝ තමන්ගේ ධර්ම ස්වභාවයට අනුරූපවම එක්වෙති, සමගිවෙති. ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එක්වෙති, සමගිවෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එක්වෙති, සමගිවෙති.",
      "paliTitle": "Assaddhasaṃsandanasuttaṃ",
      "englishTitle": "The Association of the Faithless Sutta",
      "sinhalaTitle": "අස්සද්ධ සංසන්දන සූත්‍රය"
    },
    {
      "number": 102,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Assaddhā assaddhehi saddhiṃ saṃsandanti samenti; ahirikā ahirikehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; saddhā saddhehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samenti. Atītampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandiṃsu samiṃsu…pe… anāgatampi kho, bhikkhave, addhānaṃ dhātusova sattā saṃsandissanti samessanti…pe…. ‘‘Etarahipi kho, bhikkhave, paccuppannaṃ addhānaṃ dhātusova sattā saṃsandanti samenti. Assaddhā assaddhehi saddhiṃ saṃsandanti samenti; ahirikā ahirikehi saddhiṃ saṃsandanti samenti, duppaññā duppaññehi saddhiṃ saṃsandanti samenti; saddhā saddhehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentīti. (1) ‘‘Dhātusova, bhikkhave, sattā saṃsandanti samenti. Assaddhā assaddhehi saddhiṃ saṃsandanti samenti; anottappino anottappīhi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; saddhā saddhehi saddhiṃ saṃsandanti samenti; ottappino ottappīhi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe… paṭhamavāro viya vitthāretabbo. (2) ‘‘Dhātusova, bhikkhave…pe… assaddhā assaddhehi saddhiṃ saṃsandanti samenti; appassutā appassutehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; saddhā saddhehi saddhiṃ saṃsandanti samenti; bahussutā bahussutehi saddhiṃ saṃsandanti samenti, paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (3) ‘‘Dhātusova, bhikkhave…pe… assaddhā assaddhehi saddhiṃ saṃsandanti samenti; kusītā kusītehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; saddhā saddhehi saddhiṃ saṃsandanti samenti; āraddhavīriyā āraddhavīriyehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (4) ‘‘Dhātusova, bhikkhave…pe… assaddhā assaddhehi saddhiṃ saṃsandanti samenti; muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; saddhā saddhehi saddhiṃ saṃsandanti samenti; upaṭṭhitassatino upaṭṭhitassatīhi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentīti…pe…. Aṭṭhamaṃ. (5)",
      "english": "The Blessed One was staying at Sāvatthī. Monks, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; those lacking moral shame associate and come together with those lacking moral shame; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; those possessing moral shame associate and come together with those possessing moral shame; the wise associate and come together with the wise.\n\nIndeed, Monks, in the past, beings associated and came together according to their inherent qualities. The faithless associated and came together with the faithless; those lacking moral shame associated and came together with those lacking moral shame; the unwise associated and came together with the unwise. The faithful associated and came together with the faithful; those possessing moral shame associated and came together with those possessing moral shame; the wise associated and came together with the wise.\n\nAnd, Monks, in the future, beings will associate and come together according to their inherent qualities. The faithless will associate and come together with the faithless; those lacking moral shame will associate and come together with those lacking moral shame; the unwise will associate and come together with the unwise. The faithful will associate and come together with the faithful; those possessing moral shame will associate and come together with those possessing moral shame; the wise will associate and come together with the wise.\n\nEven now, Monks, in the present, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; those lacking moral shame associate and come together with those lacking moral shame; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; those possessing moral shame associate and come together with those possessing moral shame; the wise associate and come together with the wise.\n\nMonks, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; those lacking moral dread associate and come together with those lacking moral dread; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; those possessing moral dread associate and come together with those possessing moral dread; the wise associate and come together with the wise.\n\nIndeed, Monks, in the past, beings associated and came together according to their inherent qualities. The faithless associated and came together with the faithless; those lacking moral dread associated and came together with those lacking moral dread; the unwise associated and came together with the unwise. The faithful associated and came together with the faithful; those possessing moral dread associated and came together with those possessing moral dread; the wise associated and came together with the wise.\n\nAnd, Monks, in the future, beings will associate and come together according to their inherent qualities. The faithless will associate and come together with the faithless; those lacking moral dread will associate and come together with those lacking moral dread; the unwise will associate and come together with the unwise. The faithful will associate and come together with the faithful; those possessing moral dread will associate and come together with those possessing moral dread; the wise will associate and come together with the wise.\n\nEven now, Monks, in the present, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; those lacking moral dread associate and come together with those lacking moral dread; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; those possessing moral dread associate and come together with those possessing moral dread; the wise associate and come together with the wise.\n\nMonks, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; those with little learning associate and come together with those with little learning; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; those with much learning associate and come together with those with much learning; the wise associate and come together with the wise.\n\nIndeed, Monks, in the past, beings associated and came together according to their inherent qualities. The faithless associated and came together with the faithless; those with little learning associated and came together with those with little learning; the unwise associated and came together with the unwise. The faithful associated and came together with the faithful; those with much learning associated and came together with those with much learning; the wise associated and came together with the wise.\n\nAnd, Monks, in the future, beings will associate and come together according to their inherent qualities. The faithless will associate and come together with the faithless; those with little learning will associate and come together with those with little learning; the unwise will associate and come together with the unwise. The faithful will associate and come together with the faithful; those with much learning will associate and come together with those with much learning; the wise will associate and come together with the wise.\n\nEven now, Monks, in the present, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; those with little learning associate and come together with those with little learning; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; those with much learning associate and come together with those with much learning; the wise associate and come together with the wise.\n\nMonks, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; the lazy associate and come together with the lazy; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; the energetic associate and come together with the energetic; the wise associate and come together with the wise.\n\nIndeed, Monks, in the past, beings associated and came together according to their inherent qualities. The faithless associated and came together with the faithless; the lazy associated and came together with the lazy; the unwise associated and came together with the unwise. The faithful associated and came together with the faithful; the energetic associated and come together with the energetic; the wise associated and come together with the wise.\n\nAnd, Monks, in the future, beings will associate and come together according to their inherent qualities. The faithless will associate and come together with the faithless; the lazy will associate and come together with the lazy; the unwise will associate and come together with the unwise. The faithful will associate and come together with the faithful; the energetic will associate and come together with the energetic; the wise will associate and come together with the wise.\n\nEven now, Monks, in the present, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; the lazy associate and come together with the lazy; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; the energetic associate and come together with the energetic; the wise associate and come together with the wise.\n\nMonks, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; the unmindful associate and come together with the unmindful; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; the mindful associate and come together with the mindful; the wise associate and come together with the wise.\n\nIndeed, Monks, in the past, beings associated and came together according to their inherent qualities. The faithless associated and came together with the faithless; the unmindful associated and came together with the unmindful; the unwise associated and came together with the unwise. The faithful associated and came together with the faithful; the mindful associated and came together with the mindful; the wise associated and come together with the wise.\n\nAnd, Monks, in the future, beings will associate and come together according to their inherent qualities. The faithless will associate and come together with the faithless; the unmindful will associate and come together with the unmindful; the unwise will associate and come together with the unwise. The faithful will associate and come together with the faithful; the mindful will associate and come together with the mindful; the wise will associate and come together with the wise.\n\nEven now, Monks, in the present, beings associate and come together according to their inherent qualities. The faithless associate and come together with the faithless; the unmindful associate and come together with the unmindful; the unwise associate and come together with the unwise. The faithful associate and come together with the faithful; the mindful associate and come together with the mindful; the wise associate and come together with the wise.",
      "sinhala": "සැවැත් නුවර වැඩවසන සමයෙහි භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:\n\nපින්වත් මහණෙනි, සත්ත්වයෝ ධාතූන්ටම අනුව එකතු වෙති, ගැළපෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ලජ්ජාශීලීහු ලජ්ජාශීලීන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති. පින්වත් මහණෙනි, අතීත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වූහ, ගැළපුණාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එකතු වූහ, ගැළපුණාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වූහ, ගැළපුණාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; ලජ්ජාශීලීහු ලජ්ජාශීලීන් සමඟ එකතු වූහ, ගැළපුණාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ. පින්වත් මහණෙනි, අනාගත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වන්නාහ, ගැළපෙන්නාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ලජ්ජාශීලීහු ලජ්ජාශීලීන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ. පින්වත් මහණෙනි, එපමණක් නොව, වර්තමාන කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වෙති, ගැළපෙති. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; නිර්ලජ්ජීහු නිර්ලජ්ජීන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ලජ්ජාශීලීහු ලජ්ජාශීලීන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති.\n\nපින්වත් මහණෙනි, සත්ත්වයෝ ධාතූන්ටම අනුව එකතු වෙති, ගැළපෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ඕතප්ප රහිතයෝ ඕතප්ප රහිතයන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ඕතප්ප සහිතයෝ ඕතප්ප සහිතයන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති. පින්වත් මහණෙනි, අතීත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වූහ, ගැළපුණාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; ඕතප්ප රහිතයෝ ඕතප්ප රහිතයන් සමඟ එකතු වූහ, ගැළපුණාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වූහ, ගැළපුණාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; ඕතප්ප සහිතයෝ ඕතප්ප සහිතයන් සමඟ එකතු වූහ, ගැළපුණාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ. පින්වත් මහණෙනි, අනාගත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වන්නාහ, ගැළපෙන්නාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ඕතප්ප රහිතයෝ ඕතප්ප රහිතයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ඕතප්ප සහිතයෝ ඕතප්ප සහිතයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ. පින්වත් මහණෙනි, වර්තමාන කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වෙති, ගැළපෙති. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ඕතප්ප රහිතයෝ ඕතප්ප රහිතයන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ඕතප්ප සහිතයෝ ඕතප්ප සහිතයන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති.\n\nපින්වත් මහණෙනි, සත්ත්වයෝ ධාතූන්ටම අනුව එකතු වෙති, ගැළපෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; අල්ප ශ්‍රැතවත්හු අල්ප ශ්‍රැතවතුන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; බහුශ්‍රැතවත්හු බහුශ්‍රැතවතුන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති. පින්වත් මහණෙනි, අතීත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වූහ, ගැළපුණාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; අල්ප ශ්‍රැතවත්හු අල්ප ශ්‍රැතවතුන් සමඟ එකතු වූහ, ගැළපුණාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වූහ, ගැළපුණාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; බහුශ්‍රැතවත්හු බහුශ්‍රැතවතුන් සමඟ එකතු වූහ, ගැළපුණාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ. පින්වත් මහණෙනි, අනාගත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වන්නාහ, ගැළපෙන්නාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; අල්ප ශ්‍රැතවත්හු අල්ප ශ්‍රැතවතුන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; බහුශ්‍රැතවත්හු බහුශ්‍රැතවතුන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ. පින්වත් මහණෙනි, වර්තමාන කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වෙති, ගැළපෙති. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; අල්ප ශ්‍රැතවත්හු අල්ප ශ්‍රැතවතුන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; බහුශ්‍රැතවත්හු බහුශ්‍රැතවතුන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති.\n\nපින්වත් මහණෙනි, සත්ත්වයෝ ධාතූන්ටම අනුව එකතු වෙති, ගැළපෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; කුසීතයෝ කුසීතයන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ආරබ්ධවීර්‍යයෝ ආරබ්ධවීර්‍යයන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති. පින්වත් මහණෙනි, අතීත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වූහ, ගැළපුණාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; කුසීතයෝ කුසීතයන් සමඟ එකතු වූහ, ගැළපුණාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වූහ, ගැළපුණාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; ආරබ්ධවීර්‍යයෝ ආරබ්ධවීර්‍යයන් සමඟ එකතු වූහ, ගැළපුණාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ. පින්වත් මහණෙනි, අනාගත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වන්නාහ, ගැළපෙන්නාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; කුසීතයෝ කුසීතයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ආරබ්ධවීර්‍යයෝ ආරබ්ධවීර්‍යයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ. පින්වත් මහණෙනි, වර්තමාන කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වෙති, ගැළපෙති. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; කුසීතයෝ කුසීතයන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; ආරබ්ධවීර්‍යයෝ ආරබ්ධවීර්‍යයන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති.\n\nපින්වත් මහණෙනි, සත්ත්වයෝ ධාතූන්ටම අනුව එකතු වෙති, ගැළපෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; මුළා වූ සිහිය ඇත්තෝ මුළා වූ සිහිය ඇත්තන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; පිහිටුවාගත් සිහිය ඇත්තෝ පිහිටුවාගත් සිහිය ඇත්තන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති. පින්වත් මහණෙනි, අතීත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වූහ, ගැළපුණාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; මුළා වූ සිහිය ඇත්තෝ මුළා වූ සිහිය ඇත්තන් සමඟ එකතු වූහ, ගැළපුණාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වූහ, ගැළපුණාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ; පිහිටුවාගත් සිහිය ඇත්තෝ පිහිටුවාගත් සිහිය ඇත්තන් සමඟ එකතු වූහ, ගැළපුණාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වූහ, ගැළපුණාහ. පින්වත් මහණෙනි, අනාගත කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වන්නාහ, ගැළපෙන්නාහ. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; මුළා වූ සිහිය ඇත්තෝ මුළා වූ සිහිය ඇත්තන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; පිහිටුවාගත් සිහිය ඇත්තෝ පිහිටුවාගත් සිහිය ඇත්තන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වන්නාහ, ගැළපෙන්නාහ. පින්වත් මහණෙනි, වර්තමාන කාලයෙහිද සත්ත්වයෝ ධාතූන්ටම අනුවම එකතු වෙති, ගැළපෙති. එනම්: අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; මුළා වූ සිහිය ඇත්තෝ මුළා වූ සිහිය ඇත්තන් සමඟ එකතු වෙති, ගැළපෙති; දුෂ්ප්‍රඥයෝ දුෂ්ප්‍රඥයන් සමඟ එකතු වෙති, ගැළපෙති; ශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති; පිහිටුවාගත් සිහිය ඇත්තෝ පිහිටුවාගත් සිහිය ඇත්තන් සමඟ එකතු වෙති, ගැළපෙති; ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකතු වෙති, ගැළපෙති.",
      "paliTitle": "Assaddhamūlakasuttaṃ",
      "englishTitle": "Rooted in Faithlessness Sutta",
      "sinhalaTitle": "අස්සද්ධ මූලක සූත්‍රය"
    },
    {
      "number": 103,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova…pe… ahirikā ahirikehi saddhiṃ saṃsandanti samenti, anottappino anottappīhi saddhiṃ saṃsandanti samenti, duppaññā duppaññehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ sasandanti samenti, ottappino ottappīhi saddhiṃ saṃsandanti samenti, paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (1) ‘‘Ahirikā ahirikehi saddhiṃ saṃsandanti samenti, appassutā appassutehi saddhiṃ saṃsandanti samenti, duppaññā duppaññehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti, bahussutā bahussutehi saddhiṃ saṃsandanti samenti, paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (2) ‘‘Ahirikā ahirikehi saddhiṃ saṃsandanti samenti, kusītā kusītehi saddhiṃ saṃsandanti samenti, duppaññā duppaññehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti, āraddhavīriyā āraddhavīriyehi saddhiṃ saṃsandanti samenti, paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (3) ‘‘Ahirikā ahirikehi saddhiṃ saṃsandanti samenti, muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandanti samenti, duppaññā duppaññehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti, upaṭṭhitassatino upaṭṭhitassatīhi saddhiṃ saṃsandanti samenti, paññavanto paññavantehi saddhiṃ saṃsandanti samentīti…pe…. Navamaṃ. (4)",
      "english": "The morally shameless associate and align with the morally shameless; the morally fearless associate and align with the morally fearless; the unwise associate and align with the unwise. The conscientious associate and align with the conscientious; the morally dread-filled associate and align with the morally dread-filled; the wise associate and align with the wise.\n\nThe morally shameless associate and align with the morally shameless; those of little learning associate and align with those of little learning; the unwise associate and align with the unwise. The conscientious associate and align with the conscientious; the well-learned associate and align with the well-learned; the wise associate and align with the wise.\n\nThe morally shameless associate and align with the morally shameless; the indolent associate and align with the indolent; the unwise associate and align with the unwise. The conscientious associate and align with the conscientious; the energetic associate and align with the energetic; the wise associate and align with the wise.\n\nThe morally shameless associate and align with the morally shameless; the unmindful associate and align with the unmindful; the unwise associate and align with the unwise. The conscientious associate and align with the conscientious; the well-established in mindfulness associate and align with the well-established in mindfulness; the wise associate and align with the wise.",
      "sinhala": "ධර්මතා වශයෙන්ම සත්ත්වයෝ එකිනෙකා හා එක්වෙති, සමගි වෙති.\nඅහි‍රික අය අහි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. අනෝතප්පී අය අනෝතප්පී අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. දුෂ්ප්‍රඥා ඇති අය දුෂ්ප්‍රඥා ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. හි‍රික අය හි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. ඕතප්පී අය ඕතප්පී අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. ප්‍රඥාවන්ත අය ප්‍රඥාවන්ත අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති.\n\nඅහි‍රික අය අහි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. අල්ප ශ්‍රැත ඇති අය අල්ප ශ්‍රැත ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. දුෂ්ප්‍රඥා ඇති අය දුෂ්ප්‍රඥා ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. හි‍රික අය හි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. බහු ශ්‍රැත ඇති අය බහු ශ්‍රැත ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. ප්‍රඥාවන්ත අය ප්‍රඥාවන්ත අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති.\n\nඅහි‍රික අය අහි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. කුසීත අය කුසීත අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. දුෂ්ප්‍රඥා ඇති අය දුෂ්ප්‍රඥා ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. හි‍රික අය හි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. ආරම්භ කළ වීර්යය ඇති අය ආරම්භ කළ වීර්යය ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. ප්‍රඥාවන්ත අය ප්‍රඥාවන්ත අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති.\n\nඅහි‍රික අය අහි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. සිහිමුළා වූ අය සිහිමුළා වූ අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. දුෂ්ප්‍රඥා ඇති අය දුෂ්ප්‍රඥා ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. හි‍රික අය හි‍රික අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. උපස්ථිත සිහිය ඇති අය උපස්ථිත සිහිය ඇති අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති. ප්‍රඥාවන්ත අය ප්‍රඥාවන්ත අය සමඟ එකිනෙකා හා එක්වෙති, සමගි වෙති.",
      "paliTitle": "Ahirikamūlakasuttaṃ",
      "englishTitle": "Rooted in Shamelessness Sutta",
      "sinhalaTitle": "අහිරික මූලක සූත්‍රය"
    },
    {
      "number": 104,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Anottappino anottappīhi saddhiṃ saṃsandanti samenti; appassutā appassutehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; ottappino ottappīhi saddhiṃ saṃsandanti samenti; bahussutā bahussutehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (1) ‘‘Anottappino anottappīhi saddhiṃ saṃsandanti samenti; kusītā kusītehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; ottappino ottappīhi saddhiṃ saṃsandanti samenti; āraddhavīriyā āraddhavīriyehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (2) ‘‘Anottappino anottappīhi saddhiṃ saṃsandanti samenti; muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; ottappino ottappīhi saddhiṃ saṃsandanti samenti; upaṭṭhitassatino upaṭṭhitassatīhi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentīti…pe…. Dasamaṃ. (3)",
      "english": "At Sāvatthī the Blessed One was dwelling. There he addressed the monks: “Monks, beings associate and converge according to their own nature. Those without moral dread associate and converge with those without moral dread; those of little learning associate and converge with those of little learning; the unwise associate and converge with the unwise; those with moral dread associate and converge with those with moral dread; the extensively learned associate and converge with the extensively learned; the wise associate and converge with the wise.\n\nThose without moral dread associate and converge with those without moral dread; the lazy associate and converge with the lazy; the unwise associate and converge with the unwise; those with moral dread associate and converge with those with moral dread; the energetic associate and converge with the energetic; the wise associate and converge with the wise.\n\nThose without moral dread associate and converge with those without moral dread; the unmindful associate and converge with the unmindful; the unwise associate and converge with the unwise; those with moral dread associate and converge with those with moral dread; the mindful associate and converge with the mindful; the wise associate and converge with the wise.”",
      "sinhala": "ශ්‍රා‍වස්තියෙහි වැඩසිටිනා සමයෙහි, භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:\n\nමහණෙනි, සත්ත්වයෝ තමන්ගේ ස්වභාවයනට අනුකූලවම එක්රැස් වෙති, සමගි වෙති. පාපයට බිය නැත්තෝ, පාපයට බිය නැත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. අල්පශ්‍රැත අය, අල්පශ්‍රැත අය සමඟම එක්රැස් වෙති, සමගි වෙති. දුෂ්ප්‍රඥාවන්තයෝ, දුෂ්ප්‍රඥාවන්තයන් සමඟම එක්රැස් වෙති, සමගි වෙති. පාපයට බිය ඇත්තෝ, පාපයට බිය ඇත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. බහුශ්‍රැත අය, බහුශ්‍රැත අය සමඟම එක්රැස් වෙති, සමගි වෙති. ප්‍රඥාවන්තයෝ, ප්‍රඥාවන්තයන් සමඟම එක්රැස් වෙති, සමගි වෙති.\n\nපාපයට බිය නැත්තෝ, පාපයට බිය නැත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. අලසයෝ, අලසයන් සමඟම එක්රැස් වෙති, සමගි වෙති. දුෂ්ප්‍රඥාවන්තයෝ, දුෂ්ප්‍රඥාවන්තයන් සමඟම එක්රැස් වෙති, සමගි වෙති. පාපයට බිය ඇත්තෝ, පාපයට බිය ඇත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. පටන්ගත් වීර්යය ඇත්තෝ, පටන්ගත් වීර්යය ඇත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. ප්‍රඥාවන්තයෝ, ප්‍රඥාවන්තයන් සමඟම එක්රැස් වෙති, සමගි වෙති.\n\nපාපයට බිය නැත්තෝ, පාපයට බිය නැත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. මුළා වූ සිහි ඇත්තෝ, මුළා වූ සිහි ඇත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. දුෂ්ප්‍රඥාවන්තයෝ, දුෂ්ප්‍රඥාවන්තයන් සමඟම එක්රැස් වෙති, සමගි වෙති. පාපයට බිය ඇත්තෝ, පාපයට බිය ඇත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. එළඹ සිටි සිහි ඇත්තෝ, එළඹ සිටි සිහි ඇත්තන් සමඟම එක්රැස් වෙති, සමගි වෙති. ප්‍රඥාවන්තයෝ, ප්‍රඥාවන්තයන් සමඟම එක්රැස් වෙති, සමගි වෙතියි.",
      "paliTitle": "Anottappamūlakasuttaṃ",
      "englishTitle": "Rooted in Recklessness Sutta",
      "sinhalaTitle": "අනොත්තප්ප මූලක සූත්‍රය"
    },
    {
      "number": 105,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Appassutā appassutehi saddhiṃ saṃsandanti samenti; kusītā kusītehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; bahussutā bahussutehi saddhiṃ saṃsandanti samenti; āraddhavīriyā āraddhavīriyehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samenti…pe…. (1) ‘‘Appassutā appassutehi saddhiṃ saṃsandanti samenti; muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; bahussutā bahussutehi saddhiṃ saṃsandanti samenti; upaṭṭhitassatino upaṭṭhitassatīhi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentīti…pe…. Ekādasamaṃ. (2)",
      "english": "Monks, beings associate and come together just by their dispositions. The unlearned associate and come together with the unlearned; the indolent associate and come together with the indolent; the foolish associate and come together with the foolish; the much-learned associate and come together with the much-learned; the energetic associate and come together with the energetic; the wise associate and come together with the wise.\n\nThe unlearned associate and come together with the unlearned; the unmindful associate and come together with the unmindful; the foolish associate and come together with the foolish; the much-learned associate and come together with the much-learned; the mindful associate and come together with the mindful; the wise associate and come together with the wise.",
      "sinhala": "එක් සමය​ක භාග්‍ය​වතුන් වහන්සේ සා​වැත් නුවර වැඩ​සිටින සේක. එහිදී භාග්‍ය​වතුන් වහන්සේ භික්ෂූන් වහන්සේලා අමතා මෙසේ වදාළ සේක: “මහ​ණෙනි, සත්ත්ව​යෝ ධාතූන් (ස්ව​භාවයන්) අනුවම එකට බැඳෙති, එක්වෙති. අල්ප​ශ්‍රැත අය අල්ප​ශ්‍රැත අය සමඟ එකට බැඳෙති, එක්වෙති; කු​සීත අය කු​සීත අය සමඟ එකට බැඳෙති, එක්වෙති; දුෂ්ප්‍රාඥ අය දුෂ්ප්‍රාඥ අය සමඟ එකට බැඳෙති, එක්වෙති; බහු​ශ්‍රැත අය බහු​ශ්‍රැත අය සමඟ එකට බැඳෙති, එක්වෙති; ආරම්භ​කොට ඇති වීර්ය​ය ඇති අය ආරම්භ​කොට ඇති වීර්ය​ය ඇති අය සමඟ එකට බැඳෙති, එක්වෙති; ප්‍රාඥ​වන්ත අය ප්‍රාඥ​වන්ත අය සමඟ එකට බැඳෙති, එක්වෙති.”\n\n“අල්ප​ශ්‍රැත අය අල්ප​ශ්‍රැත අය සමඟ එකට බැඳෙති, එක්වෙති; මු​ළා වූ සිහි ඇති අය මු​ළා වූ සිහි ඇති අය සමඟ එකට බැඳෙති, එක්වෙති; දුෂ්ප්‍රාඥ අය දුෂ්ප්‍රාඥ අය සමඟ එකට බැඳෙති, එක්වෙති; බහු​ශ්‍රැත අය බහු​ශ්‍රැත අය සමඟ එකට බැඳෙති, එක්වෙති; මනා​කොට පිහිටුවාගත් සිහි ඇති අය මනා​කොට පිහිටුවාගත් සිහි ඇති අය සමඟ එකට බැඳෙති, එක්වෙති; ප්‍රාඥ​වන්ත අය ප්‍රාඥ​වන්ත අය සමඟ එකට බැඳෙති, එක්වෙති.” මෙය එකාදස​ම සූත්‍රයයි.",
      "paliTitle": "Appassutamūlakasuttaṃ",
      "englishTitle": "Rooted in Little Learning Sutta",
      "sinhalaTitle": "අප්පස්සුත මූලක සූත්‍රය"
    },
    {
      "number": 106,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Kusītā kusītehi saddhiṃ saṃsandanti samenti; muṭṭhassatino muṭṭhassatīhi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti; āraddhavīriyā āraddhavīriyehi saddhiṃ saṃsandanti samenti; upaṭṭhitassatino upaṭṭhitassatīhi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentīti…pe…. Dvādasamaṃ. Dutiyo vaggo. Tassuddānaṃ – Sattimā sanidānañca, giñjakāvasathena ca; Hīnādhimutti caṅkamaṃ, sagāthā assaddhasattamaṃ. Assaddhamūlakā pañca, cattāro ahirikamūlakā; Anottappamūlakā tīṇi, duve appassutena ca. Kusītaṃ ekakaṃ vuttaṃ, suttantā tīṇi pañcakā; Bāvīsati vuttā suttā, dutiyo vaggo pavuccatīti.",
      "english": "The Blessed One was staying at Sāvatthī.\n\n“Monks, beings associate and mingle by their very nature. The lazy associate and mingle with the lazy; the unmindful associate and mingle with the unmindful; the unwise associate and mingle with the unwise; the diligent associate and mingle with the diligent; the mindful associate and mingle with the mindful; and the wise associate and mingle with the wise.”\n\nThe twelfth Sutta.\nThe Second Chapter.\n\nSummary of this chapter:\nSattimā, Sanidāna, and Giñjakāvasatha;\nHīnādhimutti, Caṅkama, Sagāthā, and Assaddha as the seventh.\nFive Suttas rooted in faithlessness, four rooted in shamelessness;\nThree rooted in lack of moral dread, and two on lack of learning.\nOne Sutta on idleness is mentioned, and suttas in three fives.\nTwenty-two Suttas are declared, thus is the second chapter called.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක.\n\n‘‘භික්ෂූණි, සත්ත්වයෝ ධාතූන් අනුවම එකිනෙකා හා ගැළපී එක්වෙති, සමගි වෙති. අලසයෝ අලසයන් හා සමග එකිනෙකා හා ගැළපී එක්වෙති, සමගි වෙති. නැතිවූ සිහිය ඇත්තෝ නැතිවූ සිහිය ඇත්තවුන් හා සමග එකිනෙකා හා ගැළපී එක්වෙති, සමගි වෙති. නුවණ නැත්තෝ නුවණ නැත්තවුන් හා සමග එකිනෙකා හා ගැළපී එක්වෙති, සමගි වෙති. ආරම්භ කරන ලද වීර්යය ඇත්තෝ ආරම්භ කරන ලද වීර්යය ඇත්තවුන් හා සමග එකිනෙකා හා ගැළපී එක්වෙති, සමගි වෙති. පිහිටුවන ලද සිහිය ඇත්තෝ පිහිටුවන ලද සිහිය ඇත්තවුන් හා සමග එකිනෙකා හා ගැළපී එක්වෙති, සමගි වෙති. ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් හා සමග එකිනෙකා හා ගැළපී එක්වෙති, සමගි වෙති.’’\n\nදොළොස්වැන්නයි. දෙවන වග්ගයයි.\nඑහි උද්දානයයි:\nසත්තිමා සූත්‍රයත්, සනිදාන සූත්‍රයත්,\nගිඤ්ජකාවසථ සූත්‍රයත්, හීනාධිමුක්ති සූත්‍රයත්, චංකම සූත්‍රයත්,\nසගාථා සූත්‍රයත්, අසද්ධා සූත්‍රය (හත්වැන්න)ත් යි.\nඅසද්ධා මුල්කොට ඇති සූත්‍ර පහකි, අහිරික මුල්කොට ඇති සූත්‍ර සතරකි.\nඅනොත්තප්ප මුල්කොට ඇති සූත්‍ර තුනකි, අප්පස්සුත සූත්‍රයෙන් දෙකක්ද (ඇත).\nකුසීත සූත්‍රය එකකි, පංචක වර්ගයේ සූත්‍ර තුනකි.\nසූත්‍ර විසිදෙකක් මෙහි (මේ වග්ගයේ) කියන ලදී. මෙය දෙවන වග්ගය යයි කියනු ලැබේ.",
      "paliTitle": "Kusītamūlakasuttaṃ",
      "englishTitle": "The Root of Laziness Sutta",
      "sinhalaTitle": "කුසීතමූලක සූත්‍රය"
    },
    {
      "number": 107,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Assaddhā assaddhehi saddhiṃ saṃsandanti samenti; ahirikā ahirikehi saddhiṃ saṃsandanti samenti; anottappino anottappīhi saddhiṃ saṃsandanti samenti; asamāhitā asamāhitehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti’’. ‘‘Saddhā saddhehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti; ottappino ottappīhi saddhiṃ saṃsandanti samenti; samāhitā samāhitehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentī’’ti. Paṭhamaṃ.",
      "english": "Monks, beings indeed align and associate according to their natural dispositions. Those without faith align and associate with those without faith; those without a sense of moral shame align and associate with those without a sense of moral shame; those without moral dread align and associate with those without moral dread; those who are unconcentrated align and associate with those who are unconcentrated; those lacking wisdom align and associate with those lacking wisdom.\n\nThose with faith align and associate with those with faith; those who are conscientious align and associate with those who are conscientious; those who have moral dread align and associate with those who have moral dread; those who are concentrated align and associate with those who are concentrated; those who are wise align and associate with those who are wise.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත්නුවර වැඩසිටියහ.\n\nභික්‍ෂූනි, සත්වයෝ ස්වභාවයන්ට අනුවම එකට එක්වෙති, සුසංයෝග වෙති. අශ්‍රද්ධාවන්තයෝ අශ්‍රද්ධාවන්තයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. හිරි නැති පුද්ගලයෝ හිරි නැති පුද්ගලයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. ඔතප්පය නැති පුද්ගලයෝ ඔතප්පය නැති පුද්ගලයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. සමාධියෙන් තොර වූ පුද්ගලයෝ සමාධියෙන් තොර වූ පුද්ගලයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. ප්‍රඥාව නැති පුද්ගලයෝ ප්‍රඥාව නැති පුද්ගලයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති.\n\nශ්‍රද්ධාවන්තයෝ ශ්‍රද්ධාවන්තයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. හිරි ඇති පුද්ගලයෝ හිරි ඇති පුද්ගලයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. ඔතප්පය ඇති පුද්ගලයෝ ඔතප්පය ඇති පුද්ගලයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. සමාධියෙන් යුතු පුද්ගලයෝ සමාධියෙන් යුතු පුද්ගලයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති. ප්‍රඥාවන්තයෝ ප්‍රඥාවන්තයන් සමඟ එකට එක්වෙති, සුසංයෝග වෙති.",
      "paliTitle": "Asamāhitasuttaṃ",
      "vagga": "Kammapathavaggo",
      "englishTitle": "The Unconcentrated Sutta",
      "sinhalaTitle": "අසමාහිත සූත්‍රය",
      "vaggaEnglish": "Chapter on Pathways of Kamma",
      "vaggaSinhala": "කම්මපථ වර්ගය"
    },
    {
      "number": 108,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Assaddhā assaddhehi saddhiṃ saṃsandanti samenti; ahirikā ahirikehi saddhiṃ saṃsandanti samenti; anottappino anottappīhi saddhiṃ saṃsandanti samenti; dussīlā dussīlehi saddhiṃ saṃsandanti samenti; duppaññā duppaññehi saddhiṃ saṃsandanti samenti’’. ‘‘Saddhā saddhehi saddhiṃ saṃsandanti samenti; hirimanā hirimanehi saddhiṃ saṃsandanti samenti; ottappino ottappīhi saddhiṃ saṃsandanti samenti; sīlavanto sīlavantehi saddhiṃ saṃsandanti samenti; paññavanto paññavantehi saddhiṃ saṃsandanti samentī’’ti. Dutiyaṃ.",
      "english": "Indeed, monks, beings associate and come together by their very dispositions. The faithless associate and come together with the faithless; the shameless associate and come together with the shameless; those lacking moral dread associate and come together with those lacking moral dread; the immoral associate and come together with the immoral; the unwise associate and come together with the unwise.\n\nThe faithful associate and come together with the faithful; the conscientious associate and come together with the conscientious; those possessing moral dread associate and come together with those possessing moral dread; the virtuous associate and come together with the virtuous; the wise associate and come together with the wise.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක.\n\n“මහණෙනි, සත්වයෝ ධාතු වශයෙන්ම එක්රැස්වෙති, එකට එක්වෙති. ශ්‍ර‍ද්ධාවෙන් තොර අය, ශ්‍ර‍ද්ධාවෙන් තොර අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. හිරි නැති අය, හිරි නැති අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. පවට නොබය අය, පවට නොබය අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. දුස්සීල අය, දුස්සීල අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. දුෂ්ප්‍ර‍ඥාවන්ත අය, දුෂ්ප්‍ර‍ඥාවන්ත අය සමඟම එක්රැස්වෙති, එකට එක්වෙති.”\n\n“ශ්‍ර‍ද්ධාවන්ත අය, ශ්‍ර‍ද්ධාවන්ත අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. හිරි ඇති අය, හිරි ඇති අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. පවට බය අය, පවට බය අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. සිල්වත් අය, සිල්වත් අය සමඟම එක්රැස්වෙති, එකට එක්වෙති. ප්‍ර‍ඥාවන්ත අය, ප්‍ර‍ඥාවන්ත අය සමඟම එක්රැස්වෙති, එකට එක්වෙති.” දෙවෙනි සූත්‍රයයි.",
      "paliTitle": "Dussīlasuttaṃ",
      "englishTitle": "The Discourse on the Immoral/Unvirtuous",
      "sinhalaTitle": "දුස්සීල සූත්‍රය"
    },
    {
      "number": 109,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Pāṇātipātino pāṇātipātīhi saddhiṃ saṃsandanti samenti; adinnādāyino adinnādāyīhi saddhiṃ saṃsandanti samenti; kāmesumicchācārino kāmesumicchācārīhi saddhiṃ saṃsandanti samenti; musāvādino musāvādīhi saddhiṃ saṃsandanti samenti; surāmerayamajjappamādaṭṭhāyino surāmerayamajjappamādaṭṭhāyīhi saddhiṃ saṃsandanti samenti’’. ‘‘Pāṇātipātā paṭiviratā pāṇātipātā paṭiviratehi saddhiṃ saṃsandanti samenti; adinnādānā paṭiviratā adinnādānā paṭiviratehi saddhiṃ saṃsandanti samenti; kāmesumicchācārā paṭiviratā kāmesumicchācārā paṭiviratehi saddhiṃ saṃsandanti samenti; musāvādā paṭiviratā musāvādā paṭiviratehi saddhiṃ saṃsandanti samenti; surāmerayamajjappamādaṭṭhānā paṭiviratā surāmerayamajjappamādaṭṭhānā paṭiviratehi saddhiṃ saṃsandanti samentī’’ti. Tatiyaṃ.",
      "english": "Monks, beings indeed associate and mingle according to their dispositions. Those who take life associate and mingle with those who take life; those who take what is not given associate and mingle with those who take what is not given; those who engage in sexual misconduct associate and mingle with those who engage in sexual misconduct; those who speak falsehoods associate and mingle with those who speak falsehoods; those who indulge in intoxicating drinks and drugs, which are a basis for heedlessness, associate and mingle with those who indulge in intoxicating drinks and drugs, which are a basis for heedlessness. Those abstaining from taking life associate and mingle with those abstaining from taking life; those abstaining from taking what is not given associate and mingle with those abstaining from taking what is not given; those abstaining from sexual misconduct associate and mingle with those abstaining from sexual misconduct; those abstaining from false speech associate and mingle with those abstaining from false speech; those abstaining from intoxicating drinks and drugs, which are a basis for heedlessness, associate and mingle with those abstaining from intoxicating drinks and drugs, which are a basis for heedlessness.\n\nThe third.",
      "sinhala": "භික්ෂූනි, සත්ව​යෝ ස්වකීය ධාතූන් අනුවම එකිනෙකා සමඟ එක්වෙති, මුසුවෙති.\n\nප්‍ර​ාණඝාතකයෝ ප්‍ර​ාණඝාතකයන් සමඟ එක්වෙති, මුසුවෙති.\nඅදත්තාදායීහු අදත්තාදායීන් සමඟ එක්වෙති, මුසුවෙති.\nකාමමිථ්‍යාචාරීහු කාමමිථ්‍යාචාරීන් සමඟ එක්වෙති, මුසුවෙති.\nමුසාවාදීහු මුසාවාදීන් සමඟ එක්වෙති, මුසුවෙති.\nසුරාමේරය මද්‍යපානයෙන් ප්‍ර​මාදයට පත්වන්නෝ, සුරාමේරය මද්‍යපානයෙන් ප්‍ර​මාදයට පත්වන්නන් සමඟ එක්වෙති, මුසුවෙති.\n\nප්‍ර​ාණඝාතයෙන් වැළකුණෝ ප්‍ර​ාණඝාතයෙන් වැළකුණන් සමඟ එක්වෙති, මුසුවෙති.\nඅදත්තාදානයෙන් වැළකුණෝ අදත්තාදානයෙන් වැළකුණන් සමඟ එක්වෙති, මුසුවෙති.\nකාමමිථ්‍යාචාරයෙන් වැළකුණෝ කාමමිථ්‍යාචාරයෙන් වැළකුණන් සමඟ එක්වෙති, මුසුවෙති.\nමුසාවාදයෙන් වැළකුණෝ මුසාවාදයෙන් වැළකුණන් සමඟ එක්වෙති, මුසුවෙති.\nසුරාමේරය මද්‍යපානයෙන් ප්‍ර​මාදයට පත්වීමෙන් වැළකුණෝ, සුරාමේරය මද්‍යපානයෙන් ප්‍ර​මාදයට පත්වීමෙන් වැළකුණන් සමඟ එක්වෙති, මුසුවෙති.",
      "paliTitle": "Pañcasikkhāpadasuttaṃ",
      "englishTitle": "The Discourse on the Five Precepts",
      "sinhalaTitle": "පඤ්චසික්ඛාපද සූත්‍රය"
    },
    {
      "number": 110,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Pāṇātipātino pāṇātipātīhi saddhiṃ saṃsandanti samenti; adinnādāyino adinnādāyīhi saddhiṃ saṃsandanti samenti; kāmesumicchācārino kāmesumicchācārīhi saddhiṃ saṃsandanti samenti; musāvādino musāvādīhi saddhiṃ saṃsandanti samenti; pisuṇavācā pisuṇavācehi saddhiṃ saṃsandanti samenti; pharusavācā pharusavācehi saddhiṃ saṃsandanti samenti; samphappalāpino samphappalāpīhi saddhiṃ saṃsandanti samenti’’. ‘‘Pāṇātipātā paṭiviratā…pe… adinnādānā paṭiviratā… kāmesumicchācārā paṭiviratā… musāvādā paṭiviratā… pisuṇāya vācāya paṭiviratā pisuṇāya vācāya paṭiviratehi saddhiṃ saṃsandanti samenti; pharusāya vācāya paṭiviratā pharusāya vācāya paṭiviratehi saddhiṃ saṃsandanti samenti; samphappalāpā paṭiviratā samphappalāpā paṭiviratehi saddhiṃ saṃsandanti samentī’’ti. Catutthaṃ.",
      "english": "Monks, beings indeed associate and come together according to their fundamental dispositions. Those who take life associate and come together with those who take life. Those who take what is not given associate and come together with those who take what is not given. Those who engage in sexual misconduct associate and come together with those who engage in sexual misconduct. Those who speak falsehoods associate and come together with those who speak falsehoods. Those who speak divisively associate and come together with those who speak divisively. Those who speak harshly associate and come together with those who speak harshly. Those who engage in idle chatter associate and come together with those who engage in idle chatter.\n\nThose who abstain from taking life associate and come together with those who abstain from taking life. Those who abstain from taking what is not given associate and come together with those who abstain from taking what is not given. Those who abstain from sexual misconduct associate and come together with those who abstain from sexual misconduct. Those who abstain from speaking falsehoods associate and come together with those who abstain from speaking falsehoods. Those who abstain from divisive speech associate and come together with those who abstain from divisive speech. Those who abstain from harsh speech associate and come together with those who abstain from harsh speech. Those who abstain from idle chatter associate and come together with those who abstain from idle chatter.",
      "sinhala": "භික්ෂූණි, සත්ත්වයෝ ධර්මතාවය අනුවම එක් වෙති, සමග වෙති. ප්‍රාණඝාතකයෝ ප්‍රාණඝාතකයන් සමග එක් වෙති, සමග වෙති. අදින්නාදායීහු අදින්නාදායීන් සමග එක් වෙති, සමග වෙති. කාමයන්හි වරදවා හැසිරෙන්නෝ කාමයන්හි වරදවා හැසිරෙන්නන් සමග එක් වෙති, සමග වෙති. මුසාවාදීහු මුසාවාදීන් සමග එක් වෙති, සමග වෙති. පිසුණු වචන කියන්නෝ පිසුණු වචන කියන්නන් සමග එක් වෙති, සමග වෙති. පරුෂ වචන කියන්නෝ පරුෂ වචන කියන්නන් සමග එක් වෙති, සමග වෙති. සම්ඵප්පලාප කියන්නෝ සම්ඵප්පලාප කියන්නන් සමග එක් වෙති, සමග වෙති.\n\nප්‍රාණඝාතයෙන් වැළකුණාහු ප්‍රාණඝාතයෙන් වැළකුණවුන් සමග එක් වෙති, සමග වෙති. අදින්නාදානයෙන් වැළකුණාහු අදින්නාදානයෙන් වැළකුණවුන් සමග එක් වෙති, සමග වෙති. කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණාහු කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණවුන් සමග එක් වෙති, සමග වෙති. මුසාවාදයෙන් වැළකුණාහු මුසාවාදයෙන් වැළකුණවුන් සමග එක් වෙති, සමග වෙති. පිසුණු වචනයෙන් වැළකුණාහු පිසුණු වචනයෙන් වැළකුණවුන් සමග එක් වෙති, සමග වෙති. පරුෂ වචනයෙන් වැළකුණාහු පරුෂ වචනයෙන් වැළකුණවුන් සමග එක් වෙති, සමග වෙති. සම්ඵප්පලාපයෙන් වැළකුණාහු සම්ඵප්පලාපයෙන් වැළකුණවුන් සමග එක් වෙති, සමග වෙති.",
      "paliTitle": "Sattakammapathasuttaṃ",
      "englishTitle": "The Discourse on the Seven Courses of Action",
      "sinhalaTitle": "සත්තකම්මපථ සූත්‍රය"
    },
    {
      "number": 111,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Pāṇātipātino pāṇātipātīhi saddhiṃ saṃsandanti samenti; adinnādāyino…pe… kāmesumicchācārino… musāvādino… pisuṇavācā… pharusavācā… samphappalāpino samphappalāpīhi saddhiṃ saṃsandanti samenti; abhijjhāluno abhijjhālūhi saddhiṃ saṃsandanti samenti; byāpannacittā byāpannacittehi saddhiṃ saṃsandanti samenti; micchādiṭṭhikā micchādiṭṭhikehi saddhiṃ saṃsandanti samenti’’. ‘‘Pāṇātipātā paṭiviratā pāṇātipātā paṭiviratehi saddhiṃ saṃsandanti samenti; adinnādānā paṭiviratā…pe… kāmesumicchācārā paṭiviratā… musāvādā paṭiviratā… pisuṇāya vācāya… pharusāya vācāya… samphappalāpā paṭiviratā samphappalāpā paṭiviratehi saddhiṃ saṃsandanti samenti; anabhijjhāluno anabhijjhālūhi saddhiṃ saṃsandanti samenti; abyāpannacittā abyāpannacittehi saddhiṃ saṃsandanti samenti; sammādiṭṭhikā sammādiṭṭhikehi saddhiṃ saṃsandanti samentī’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, by way of their dispositions, beings associate and come together. Killers of living beings associate and come together with killers of living beings; those who take what is not given associate and come together with those who take what is not given; those who engage in sexual misconduct associate and come together with those who engage in sexual misconduct; those who speak falsely associate and come together with those who speak falsely; those who speak divisively associate and come together with those who speak divisively; those who speak harshly associate and come together with those who speak harshly; those who engage in frivolous talk associate and come together with those who engage in frivolous talk; those who are covetous associate and come together with those who are covetous; those with ill-will associate and come together with those with ill-will; those with wrong view associate and come together with those with wrong view.\n\nThose who abstain from killing living beings associate and come together with those who abstain from killing living beings; those who abstain from taking what is not given associate and come together with those who abstain from taking what is not given; those who abstain from sexual misconduct associate and come together with those who abstain from sexual misconduct; those who abstain from false speech associate and come together with those who abstain from false speech; those who abstain from divisive speech associate and come together with those who abstain from divisive speech; those who abstain from harsh speech associate and come together with those who abstain from harsh speech; those who abstain from frivolous talk associate and come together with those who abstain from frivolous talk; those who are not covetous associate and come together with those who are not covetous; those with minds free from ill-will associate and come together with those with minds free from ill-will; those with right view associate and come together with those with right view.",
      "sinhala": "මහණෙනි, සත්ත්වයෝ ධාතු වශයෙන්ම එකිනෙකා හා එක්වෙති, සමීප වෙති. ප්‍රාණඝාතයෙහි යෙදෙන්නෝ ප්‍රාණඝාතයෙහි යෙදෙන්නන් සමඟ එක්වෙති, සමීප වෙති; සොරකමෙහි යෙදෙන්නෝ සොරකමෙහි යෙදෙන්නන් සමඟ එක්වෙති, සමීප වෙති; කාමයන්හි වරදවා හැසිරෙන්නෝ කාමයන්හි වරදවා හැසිරෙන්නන් සමඟ එක්වෙති, සමීප වෙති; බොරු කියන්නෝ බොරු කියන්නන් සමඟ එක්වෙති, සමීප වෙති; පිසුණු වචන කියන්නෝ පිසුණු වචන කියන්නන් සමඟ එක්වෙති, සමීප වෙති; ඵරුෂ වචන කියන්නෝ ඵරුෂ වචන කියන්නන් සමඟ එක්වෙති, සමීප වෙති; සම්ප්‍රප්පලාපයෙහි යෙදෙන්නෝ සම්ප්‍රප්පලාපයෙහි යෙදෙන්නන් සමඟ එක්වෙති, සමීප වෙති; අභිධ්‍යා ඇත්තෝ අභිධ්‍යා ඇත්තන් සමඟ එක්වෙති, සමීප වෙති; ව්‍යාපාද සිත් ඇත්තෝ ව්‍යාපාද සිත් ඇත්තන් සමඟ එක්වෙති, සමීප වෙති; මිථ්‍යාදෘෂ්ටිකයෝ මිථ්‍යාදෘෂ්ටිකයන් සමඟ එක්වෙති, සමීප වෙති.\n\nප්‍රාණඝාතයෙන් වැළකුණෝ ප්‍රාණඝාතයෙන් වැළකුණන් සමඟ එක්වෙති, සමීප වෙති; සොරකමෙන් වැළකුණෝ සොරකමෙන් වැළකුණන් සමඟ එක්වෙති, සමීප වෙති; කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණෝ කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණන් සමඟ එක්වෙති, සමීප වෙති; බොරු කීමෙන් වැළකුණෝ බොරු කීමෙන් වැළකුණන් සමඟ එක්වෙති, සමීප වෙති; පිසුණු වචන කීමෙන් වැළකුණෝ පිසුණු වචන කීමෙන් වැළකුණන් සමඟ එක්වෙති, සමීප වෙති; ඵරුෂ වචන කීමෙන් වැළකුණෝ ඵරුෂ වචන කීමෙන් වැළකුණන් සමඟ එක්වෙති, සමීප වෙති; සම්ප්‍රප්පලාපයෙන් වැළකුණෝ සම්ප්‍රප්පලාපයෙන් වැළකුණන් සමඟ එක්වෙති, සමීප වෙති; අභිධ්‍යා රහිත සිත් ඇත්තෝ අභිධ්‍යා රහිත සිත් ඇත්තන් සමඟ එක්වෙති, සමීප වෙති; ව්‍යාපාද රහිත සිත් ඇත්තෝ ව්‍යාපාද රහිත සිත් ඇත්තන් සමඟ එක්වෙති, සමීප වෙති; සම්මාදිට්ඨිකයෝ සම්මාදිට්ඨිකයන් සමඟ එක්වෙති, සමීප වෙති.",
      "paliTitle": "Dasakammapathasuttaṃ",
      "englishTitle": "The Ten Courses of Action Sutta",
      "sinhalaTitle": "දසකම්මපථ සූත්‍රය"
    },
    {
      "number": 112,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Micchādiṭṭhikā micchādiṭṭhikehi saddhiṃ saṃsandanti samenti; micchāsaṅkappā…pe… micchāvācā… micchākammantā… micchāājīvā… micchāvāyāmā… micchāsatino … micchāsamādhino micchāsamādhīhi saddhiṃ saṃsandanti samenti. Sammādiṭṭhikā sammādiṭṭhikehi saddhiṃ saṃsandanti samenti; sammāsaṅkappā…pe… sammāvācā… sammākammantā… sammāājīvā… sammāvāyāmā… sammāsatino… sammāsamādhino sammāsamādhīhi saddhiṃ saṃsandanti samentī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, beings naturally associate and align with others of their own kind. Those with wrong view associate and align with those who hold wrong view. Those with wrong intention associate and align with those who hold wrong intention. Those with wrong speech associate and align with those who hold wrong speech. Those with wrong action associate and align with those who hold wrong action. Those with wrong livelihood associate and align with those who hold wrong livelihood. Those with wrong effort associate and align with those who hold wrong effort. Those with wrong mindfulness associate and align with those who hold wrong mindfulness. Those with wrong concentration associate and align with those who hold wrong concentration. Similarly, those with right view associate and align with those who hold right view. Those with right intention associate and align with those who hold right intention. Those with right speech associate and align with those who hold right speech. Those with right action associate and align with those who hold right action. Those with right livelihood associate and align with those who hold right livelihood. Those with right effort associate and align with those who hold right effort. Those with right mindfulness associate and align with those who hold right mindfulness. Those with right concentration associate and align with those who hold right concentration.",
      "sinhala": "භාග්‍ය‌වතුන් වහන්සේ සැවැත් නුවර වැඩසිටින සේක.\n\n“මහණෙනි, ස්වභාවික ගති අනුවම සත්ත්වයෝ එකිනෙකා හා එක්වෙති, සමගි වෙති.\n\nමිත්‍යාදෘෂ්ටිකයෝ මිත්‍යාදෘෂ්ටිකයන් සමඟ එක්වෙති, සමගි වෙති. මිත්‍යාසංකල්ප ඇත්තෝ මිත්‍යාසංකල්ප ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. මිථ්‍යා වාචා ඇත්තෝ මිථ්‍යා වාචා ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. මිත්‍යා කර්මාන්ත ඇත්තෝ මිත්‍යා කර්මාන්ත ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. මිත්‍යා ආජීව ඇත්තෝ මිත්‍යා ආජීව ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. මිත්‍යා ව්‍යායාම ඇත්තෝ මිත්‍යා ව්‍යායාම ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. මිත්‍යා සති ඇත්තෝ මිත්‍යා සති ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. මිත්‍යා සමාධි ඇත්තෝ මිත්‍යා සමාධි ඇත්තන් සමඟ එක්වෙති, සමගි වෙති.\n\nසම්මාදෘෂ්ටිකයෝ සම්මාදෘෂ්ටිකයන් සමඟ එක්වෙති, සමගි වෙති. සම්මාසංකල්ප ඇත්තෝ සම්මාසංකල්ප ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. සම්මා වාචා ඇත්තෝ සම්මා වාචා ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. සම්මා කර්මාන්ත ඇත්තෝ සම්මා කර්මාන්ත ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. සම්මා ආජීව ඇත්තෝ සම්මා ආජීව ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. සම්මා ව්‍යායාම ඇත්තෝ සම්මා ව්‍යායාම ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. සම්මා සති ඇත්තෝ සම්මා සති ඇත්තන් සමඟ එක්වෙති, සමගි වෙති. සම්මා සමාධි ඇත්තෝ සම්මා සමාධි ඇත්තන් සමඟ එක්වෙති, සමගි වෙති.",
      "paliTitle": "Aṭṭhaṅgikasuttaṃ",
      "englishTitle": "The Eightfold Sutta",
      "sinhalaTitle": "අට්ඨංගික සූත්‍රය"
    },
    {
      "number": 113,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘dhātusova, bhikkhave, sattā saṃsandanti samenti. Micchādiṭṭhikā micchādiṭṭhikehi saddhiṃ saṃsandanti samenti; micchāsaṅkappā…pe… micchāvācā… micchākammantā… micchāājīvā… micchāvāyāmā… micchāsatino … micchāsamādhino micchāsamādhīhi saddhiṃ saṃsandanti samenti; micchāñāṇino micchāñāṇīhi saddhiṃ saṃsandanti samenti; micchāvimuttino micchāvimuttīhi saddhiṃ saṃsandanti samenti’’. ‘‘Sammādiṭṭhikā sammādiṭṭhikehi saddhiṃ saṃsandanti samenti; sammāsaṅkappā…pe… sammāvācā… sammākammantā… sammāājīvā… sammāvāyāmā… sammāsatino… sammāsamādhino… sammāñāṇino sammāñāṇīhi saddhiṃ saṃsandanti samenti; sammāvimuttino sammāvimuttīhi saddhiṃ saṃsandanti samentī’’ti. Sattamaṃ. Sattannaṃ suttantānaṃ uddānaṃ – Asamāhitaṃ dussīlaṃ, pañca sikkhāpadāni ca; Satta kammapathā vuttā, dasakammapathena ca; Chaṭṭhaṃ aṭṭhaṅgiko vutto, dasaṅgena ca sattamaṃ. Kammapathavaggo tatiyo.",
      "english": "The Blessed One was residing at Sāvatthī. Monks, beings associate and come together according to their disposition. Those with wrong view associate and come together with those with wrong view; those with wrong intention associate and come together with those with wrong intention; those with wrong speech associate and come together with those with wrong speech; those with wrong action associate and come together with those with wrong action; those with wrong livelihood associate and come together with those with wrong livelihood; those with wrong effort associate and come together with those with wrong effort; those with wrong mindfulness associate and come together with those with wrong mindfulness; those with wrong concentration associate and come together with those with wrong concentration; those with wrong knowledge associate and come together with those with wrong knowledge; and those with wrong liberation associate and come together with those with wrong liberation.\n\nSimilarly, those with right view associate and come together with those with right view; those with right intention associate and come together with those with right intention; those with right speech associate and come together with those with right speech; those with right action associate and come together with those with right action; those with right livelihood associate and come together with those with right livelihood; those with right effort associate and come together with those with right effort; those with right mindfulness associate and come together with those with right mindfulness; those with right concentration associate and come together with those with right concentration; those with right knowledge associate and come together with those with right knowledge; and those with right liberation associate and come together with those with right liberation.\n\nThis is the seventh discourse.\nThe summary for the seven discourses:\nUnconcentrated, immoral, and the five training rules; the seven paths of action are stated, and also the ten paths of action; the sixth is spoken of as having eight factors, and the seventh with ten factors. The third chapter is 'Paths of Action'.",
      "sinhala": "මහණෙනි, ධාතූන් අනුවම සත්වයෝ එක්වෙති, සමග වෙති. මිථ්‍යාදෘෂ්ටිකයෝ මිථ්‍යාදෘෂ්ටිකයන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාසංකප්ප ඇත්තෝ මිථ්‍යාසංකප්ප ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාවචී ඇත්තෝ මිථ්‍යාවචී ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාකර්මාන්ත ඇත්තෝ මිථ්‍යාකර්මාන්ත ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාආජීව ඇත්තෝ මිථ්‍යාආජීව ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාවායාම ඇත්තෝ මිථ්‍යාවායාම ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාසති ඇත්තෝ මිථ්‍යාසති ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාසමාධි ඇත්තෝ මිථ්‍යාසමාධි ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාඤාණ ඇත්තෝ මිථ්‍යාඤාණ ඇත්තන් සමග එක්වෙති, සමග වෙති. මිථ්‍යාවිමුක්ති ඇත්තෝ මිථ්‍යාවිමුක්ති ඇත්තන් සමග එක්වෙති, සමග වෙති.\n\nසම්මාදිට්ඨිකයෝ සම්මාදිට්ඨිකයන් සමග එක්වෙති, සමග වෙති. සම්මාසංකප්ප ඇත්තෝ සම්මාසංකප්ප ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාවචී ඇත්තෝ සම්මාවචී ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාකර්මාන්ත ඇත්තෝ සම්මාකර්මාන්ත ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාආජීව ඇත්තෝ සම්මාආජීව ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාවායාම ඇත්තෝ සම්මාවායාම ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාසති ඇත්තෝ සම්මාසති ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාසමාධි ඇත්තෝ සම්මාසමාධි ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාඤාණ ඇත්තෝ සම්මාඤාණ ඇත්තන් සමග එක්වෙති, සමග වෙති. සම්මාවිමුක්ති ඇත්තෝ සම්මාවිමුක්ති ඇත්තන් සමග එක්වෙති, සමග වෙති.\n\nසත්වන සූත්‍රයයි.\nසූත්‍ර හතක උද්දානය:\nඅසමාහිත සූත්‍රය, දුශ්ශීල සූත්‍රය, සහ පස් සික්ඛාපද සූත්‍රයද වදාළේය.\nසත් කර්මපථ සූත්‍රය වදාළේය, සහ දස කර්මපථ සූත්‍රයද වදාළේය.\nසවෙනි සූත්‍රය අටැඟි සූත්‍රය ලෙස වදාළේය, සත්වෙනි සූත්‍රය දසැඟි සූත්‍රය ලෙස වදාළේය.\nකර්මපථ වර්ගය තෙවෙනියයි.",
      "paliTitle": "Dasaṅgasuttaṃ",
      "englishTitle": "The Ten Factors Sutta",
      "sinhalaTitle": "දසංග සූත්‍රය"
    },
    {
      "number": 114,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme…pe… ‘‘catasso imā, bhikkhave, dhātuyo. Katamā catasso? Pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu – imā kho, bhikkhave, catasso dhātuyo’’ti. Paṭhamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. There, the Blessed One addressed the monastics thus: \"Monastics, there are these four elements. Which four? The earth element, the water element, the fire element, and the air element. These, monastics, are the four elements.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩ වාසය කරන සේක. ‘‘මහණෙනි, මේ ධාතු සතරකි. කවරේද ඒ සතර? පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මේවා යි. මහණෙනි, සැබවින්ම මේ ධාතු සතර යි.’’ මෙය පළමු වන සූත්‍රයයි.",
      "paliTitle": "Catudhātusuttaṃ",
      "vagga": "Catutthavaggo",
      "englishTitle": "Four Elements Sutta",
      "sinhalaTitle": "චතුධාතු සූත්‍රය",
      "vaggaEnglish": "Fourth Chapter",
      "vaggaSinhala": "චතුත්ථ වර්ගය"
    },
    {
      "number": 115,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho pathavīdhātuyā assādo, ko ādīnavo, kiṃ nissaraṇaṃ; ko āpodhātuyā assādo, ko ādīnavo, kiṃ nissaraṇaṃ; ko tejodhātuyā assādo, ko ādīnavo, kiṃ nissaraṇaṃ; ko vāyodhātuyā assādo, ko ādīnavo, kiṃ nissaraṇa’’’nti? ‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘yaṃ kho pathavīdhātuṃ paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ pathavīdhātuyā assādo; yaṃ [yā (sī.)] pathavīdhātu aniccā dukkhā vipariṇāmadhammā, ayaṃ pathavīdhātuyā ādīnavo; yo pathavīdhātuyā chandarāgavinayo chandarāgappahānaṃ, idaṃ pathavīdhātuyā nissaraṇaṃ. Yaṃ āpodhātuṃ paṭicca…pe… yaṃ tejodhātuṃ paṭicca…pe… yaṃ vāyodhātuṃ paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ vāyodhātuyā assādo; yaṃ vāyodhātu aniccā dukkhā vipariṇāmadhammā, ayaṃ vāyodhātuyā ādīnavo; yo vāyodhātuyā chandarāgavinayo chandarāgappahānaṃ, idaṃ vāyodhātuyā nissaraṇaṃ’’’. ‘‘Yāvakīvañcāhaṃ, bhikkhave, imāsaṃ catunnaṃ dhātūnaṃ evaṃ assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ na abbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddhoti [abhisambuddho (sī. syā. kaṃ.)] paccaññāsiṃ. ‘‘Yato ca khvāhaṃ, bhikkhave, imāsaṃ catunnaṃ dhātūnaṃ evaṃ assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddhoti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti [cetovimutti (sī. pī. ka.)], ayamantimā jāti, natthi dāni punabbhavo’’’ti. Dutiyaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī. Before my full enlightenment, monks, while I was still an unenlightened Bodhisatta, this thought occurred to me: ‘What is the gratification in the earth element? What is the danger? What is the escape? What is the gratification in the water element? What is the danger? What is the escape? What is the gratification in the fire element? What is the danger? What is the escape? What is the gratification in the wind element? What is the danger? What is the escape?’\n\nThen, monks, this thought occurred to me: ‘The pleasure and joy that arises in dependence on the earth element – this is its gratification. That the earth element is impermanent, unsatisfactory, and subject to change – this is its danger. The removal of desire and passion for the earth element, the abandoning of desire and passion for it – this is its escape. The pleasure and joy that arises in dependence on the water element – this is its gratification. That the water element is impermanent, unsatisfactory, and subject to change – this is its danger. The removal of desire and passion for the water element, the abandoning of desire and passion for it – this is its escape. The pleasure and joy that arises in dependence on the fire element – this is its gratification. That the fire element is impermanent, unsatisfactory, and subject to change – this is its danger. The removal of desire and passion for the fire element, the abandoning of desire and passion for it – this is its escape. The pleasure and joy that arises in dependence on the wind element – this is its gratification. That the wind element is impermanent, unsatisfactory, and subject to change – this is its danger. The removal of desire and passion for the wind element, the abandoning of desire and passion for it – this is its escape.’\n\nAs long, monks, as I did not understand as it actually is the gratification of these four elements as gratification, their danger as danger, and their escape as escape, so long, monks, I did not declare myself to have attained supreme perfect awakening in this world with its deities, Māras, and Brahmās, among the generation of recluses and brahmins, with its gods and humans.\n\nBut when, monks, I did understand as it actually is the gratification of these four elements as gratification, their danger as danger, and their escape as escape, then, monks, I declared myself to have attained supreme perfect awakening in this world with its deities, Māras, and Brahmās, among the generation of recluses and brahmins, with its gods and humans. And knowledge and vision arose in me: ‘My liberation is unshakeable; this is my last birth; there is no further existence.’",
      "sinhala": "සැවැත්නුවර වැඩවසන සේක.\n\nමහණෙනි, මා තවම සම්බෝධියට පත් නොවූ, අවබෝධය නොලද බෝධිසත්වයෙකු ලෙස සිටියදී, මට මෙසේ සිතුණි: ‘පඨවි ධාතුවේ ඇති ආස්වාදය කුමක්ද? එහි ඇති ආදීනවය කුමක්ද? එයින් මිදීම කුමක්ද? ආපෝ ධාතුවේ ඇති ආස්වාදය කුමක්ද? එහි ඇති ආදීනවය කුමක්ද? එයින් මිදීම කුමක්ද? තේජෝ ධාතුවේ ඇති ආස්වාදය කුමක්ද? එහි ඇති ආදීනවය කුමක්ද? එයින් මිදීම කුමක්ද? වායෝ ධාතුවේ ඇති ආස්වාදය කුමක්ද? එහි ඇති ආදීනවය කුමක්ද? එයින් මිදීම කුමක්ද?’\n\nමහණෙනි, මට මෙසේ සිතුණි: ‘යම් කිසි සැපයක් හා සතුටක් පඨවි ධාතුව හේතුකොටගෙන හටගනී ද, එය පඨවි ධාතුවේ ඇති ආස්වාදය යි. යම් හෙයකින් පඨවි ධාතුව අනිත්‍ය ද, දුක් සහිත ද, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ද, එය පඨවි ධාතුවේ ඇති ආදීනවය යි. යම් හෙයකින් පඨවි ධාතුව කෙරෙහි ඇති කැමැත්ත හා රාගය දුරු කිරීමක්, එය ප්‍රහීණ කිරීමක් වේ ද, මෙය පඨවි ධාතුවෙන් මිදීම යි. යම් කිසි සැපයක් හා සතුටක් ආපෝ ධාතුව හේතුකොටගෙන හටගනී ද, එය ආපෝ ධාතුවේ ඇති ආස්වාදය යි. යම් හෙයකින් ආපෝ ධාතුව අනිත්‍ය ද, දුක් සහිත ද, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ද, එය ආපෝ ධාතුවේ ඇති ආදීනවය යි. යම් හෙයකින් ආපෝ ධාතුව කෙරෙහි ඇති කැමැත්ත හා රාගය දුරු කිරීමක්, එය ප්‍රහීණ කිරීමක් වේ ද, මෙය ආපෝ ධාතුවෙන් මිදීම යි. යම් කිසි සැපයක් හා සතුටක් තේජෝ ධාතුව හේතුකොටගෙන හටගනී ද, එය තේජෝ ධාතුවේ ඇති ආස්වාදය යි. යම් හෙයකින් තේජෝ ධාතුව අනිත්‍ය ද, දුක් සහිත ද, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ද, එය තේජෝ ධාතුවේ ඇති ආදීනවය යි. යම් හෙයකින් තේජෝ ධාතුව කෙරෙහි ඇති කැමැත්ත හා රාගය දුරු කිරීමක්, එය ප්‍රහීණ කිරීමක් වේ ද, මෙය තේජෝ ධාතුවෙන් මිදීම යි. යම් කිසි සැපයක් හා සතුටක් වායෝ ධාතුව හේතුකොටගෙන හටගනී ද, එය වායෝ ධාතුවේ ඇති ආස්වාදය යි. යම් හෙයකින් වායෝ ධාතුව අනිත්‍ය ද, දුක් සහිත ද, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ද, එය වායෝ ධාතුවේ ඇති ආදීනවය යි. යම් හෙයකින් වායෝ ධාතුව කෙරෙහි ඇති කැමැත්ත හා රාගය දුරු කිරීමක්, එය ප්‍රහීණ කිරීමක් වේ ද, මෙය වායෝ ධාතුවෙන් මිදීම යි.’\n\nමහණෙනි, යම්තාක් කල් මා මේ සතර මහා ධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙන් ද, ආදීනවය ආදීනව වශයෙන් ද, නිස්සරණය නිස්සරණ වශයෙන් ද, ඒ අයුරින් ම යථාර්ථය ලෙස අවබෝධ නොකළේ ද, මහණෙනි, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූ, දෙව් මිනිසුන් සහිත වූ මේ ලෝකයෙහි අනුත්තර වූ සම්මා සම්බෝධියට පත් වූ බවට මම ප්‍රකාශ නොකළෙමි.\n\nමහණෙනි, යම් හෙයකින් මා මේ සතර මහා ධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙන් ද, ආදීනවය ආදීනව වශයෙන් ද, නිස්සරණය නිස්සරණ වශයෙන් ද, ඒ අයුරින් ම යථාර්ථය ලෙස අවබෝධ කළේ ද, මහණෙනි, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූ, දෙව් මිනිසුන් සහිත වූ මේ ලෝකයෙහි අනුත්තර වූ සම්මා සම්බෝධියට පත් වූ බවට මම ප්‍රකාශ කළෙමි. තවද මට මෙබඳු ඤාණයක් හා දර්ශනයක් පහළ විය: ‘මාගේ විමුක්තිය නොසෙල්වෙන්නකි. මෙය මාගේ අන්තිම උපත යි. දැන් නැවත භවයක් නැත’ කියා.",
      "paliTitle": "Pubbesambodhasuttaṃ",
      "englishTitle": "The Discourse on 'Before my Enlightenment'",
      "sinhalaTitle": "පුබ්බේ සම්බෝධ සූත්‍රය"
    },
    {
      "number": 116,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘pathavīdhātuyāhaṃ, bhikkhave, assādapariyesanaṃ acariṃ, yo pathavīdhātuyā assādo tadajjhagamaṃ, yāvatā pathavīdhātuyā assādo paññāya me so sudiṭṭho. Pathavīdhātuyāhaṃ, bhikkhave, ādīnavapariyesanaṃ acariṃ, yo pathavīdhātuyā ādīnavo tadajjhagamaṃ, yāvatā pathavīdhātuyā ādīnavo paññāya me so sudiṭṭho. Pathavīdhātuyāhaṃ, bhikkhave, nissaraṇapariyesanaṃ acariṃ, yaṃ pathavīdhātuyā nissaraṇaṃ tadajjhagamaṃ, yāvatā pathavīdhātuyā nissaraṇaṃ paññāya me taṃ sudiṭṭhaṃ’’. ‘‘Āpodhātuyāhaṃ, bhikkhave…pe… tejodhātuyāhaṃ, bhikkhave… vāyodhātuyāhaṃ, bhikkhave, assādapariyesanaṃ acariṃ, yo vāyodhātuyā assādo tadajjhagamaṃ, yāvatā vāyodhātuyā assādo paññāya me so sudiṭṭho. Vāyodhātuyāhaṃ, bhikkhave, ādīnavapariyesanaṃ acariṃ, yo vāyodhātuyā ādīnavo tadajjhagamaṃ, yāvatā vāyodhātuyā ādīnavo paññāya me so sudiṭṭho. Vāyodhātuyāhaṃ, bhikkhave, nissaraṇapariyesanaṃ acariṃ, yaṃ vāyodhātuyā nissaraṇaṃ tadajjhagamaṃ, yāvatā vāyodhātuyā nissaraṇaṃ paññāya me taṃ sudiṭṭhaṃ. ‘‘Yāvakīvañcāhaṃ, bhikkhave, imāsaṃ catunnaṃ dhātūnaṃ assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ na abbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddhoti paccaññāsiṃ. ‘‘Yato ca khvāhaṃ, bhikkhave, imāsaṃ catunnaṃ dhātūnaṃ assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddhoti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti, ayamantimā jāti, natthi dāni punabbhavo’’’ti. Tatiyaṃ.",
      "english": "Monks, I undertook the search for the gratification of the earth element. Whatever was the gratification in the earth element, that I directly knew; as far as there is gratification in the earth element, that I saw well with wisdom. Monks, I undertook the search for the danger of the earth element. Whatever was the danger in the earth element, that I directly knew; as far as there is danger in the earth element, that I saw well with wisdom. Monks, I undertook the search for the escape from the earth element. Whatever was the escape from the earth element, that I directly knew; as far as there is escape from the earth element, that I saw well with wisdom. Monks, for the water element... for the fire element... Monks, I undertook the search for the gratification of the wind element. Whatever was the gratification in the wind element, that I directly knew; as far as there is gratification in the wind element, that I saw well with wisdom. Monks, I undertook the search for the danger of the wind element. Whatever was the danger in the wind element, that I directly knew; as far as there is danger in the wind element, that I saw well with wisdom. Monks, I undertook the search for the escape from the wind element. Whatever was the escape from the wind element, that I directly knew; as far as there is escape from the wind element, that I saw well with wisdom.\n\nMonks, as long as I had not directly known the gratification of these four elements as gratification, the danger as danger, and the escape as escape, as it truly is, then I, monks, did not declare myself to have awakened to unsurpassed perfect self-awakening in the world with its devas, Māra, and Brahmā, among the generation of recluses and brahmins, with its devas and humans.\n\nBut when I, monks, had directly known the gratification of these four elements as gratification, the danger as danger, and the escape as escape, as it truly is, then I, monks, declared myself to have awakened to unsurpassed perfect self-awakening in the world with its devas, Māra, and Brahmā, among the generation of recluses and brahmins, with its devas and humans. And knowledge and vision arose in me: ‘My liberation is unshakeable; this is my final birth; there is now no further existence.’",
      "sinhala": "මහණෙනි, මම පඨවි ධාතුවේ ඇති ආස්වාදය විමසා බැලීමි. පඨවි ධාතුවේ ඇති යම් ආස්වාදයක් වේද, එය මම අවබෝධ කළෙමි. පඨවි ධාතුවේ ඇති ආස්වාදය කොපමණක්දැයි, එය මගේ ප්‍රඥාවෙන් මනාව දැක ඇත. මහණෙනි, මම පඨවි ධාතුවේ ඇති ආදීනවය විමසා බැලීමි. පඨවි ධාතුවේ ඇති යම් ආදීනවයක් වේද, එය මම අවබෝධ කළෙමි. පඨවි ධාතුවේ ඇති ආදීනවය කොපමණක්දැයි, එය මගේ ප්‍රඥාවෙන් මනාව දැක ඇත. මහණෙනි, මම පඨවි ධාතුවෙන් ඇති නිස්සරණය විමසා බැලීමි. පඨවි ධාතුවෙන් ඇති යම් නිස්සරණයක් වේද, එය මම අවබෝධ කළෙමි. පඨවි ධාතුවෙන් ඇති නිස්සරණය කොපමණක්දැයි, එය මගේ ප්‍රඥාවෙන් මනාව දැක ඇත.\n\nමහණෙනි, ආපෝ ධාතුවේත්, තේජෝ ධාතුවේත් ආස්වාදය, ආදීනවය හා නිස්සරණය මෙසේම විමසා අවබෝධ කරන ලදි. මහණෙනි, මම වායෝ ධාතුවේ ඇති ආස්වාදය විමසා බැලීමි. වායෝ ධාතුවේ ඇති යම් ආස්වාදයක් වේද, එය මම අවබෝධ කළෙමි. වායෝ ධාතුවේ ඇති ආස්වාදය කොපමණක්දැයි, එය මගේ ප්‍රඥාවෙන් මනාව දැක ඇත. මහණෙනි, මම වායෝ ධාතුවේ ඇති ආදීනවය විමසා බැලීමි. වායෝ ධාතුවේ ඇති යම් ආදීනවයක් වේද, එය මම අවබෝධ කළෙමි. වායෝ ධාතුවේ ඇති ආදීනවය කොපමණක්දැයි, එය මගේ ප්‍රඥාවෙන් මනාව දැක ඇත. මහණෙනි, මම වායෝ ධාතුවෙන් ඇති නිස්සරණය විමසා බැලීමි. වායෝ ධාතුවෙන් ඇති යම් නිස්සරණයක් වේද, එය මම අවබෝධ කළෙමි. වායෝ ධාතුවෙන් ඇති නිස්සරණය කොපමණක්දැයි, එය මගේ ප්‍රඥාවෙන් මනාව දැක ඇත.\n\nමහණෙනි, මා විසින් මේ සතර මහා ධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙන්ද, ආදීනවය ආදීනව වශයෙන්ද, නිස්සරණය නිස්සරණ වශයෙන්ද, යම්තාක් කල් තත්ත්‍වය පරිදි අවබෝධ නොකළේද, මහණෙනි, දෙවියන් සහිත වූද, මරුන් සහිත වූද, බ්‍රහ්මයන් සහිත වූද, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූද, දෙවි මිනිසුන් සහිත වූද මේ ලෝකයෙහි නිරුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ බවට මම ප්‍රකාශ නොකළෙමි.\n\nමහණෙනි, මා විසින් මේ සතර මහා ධාතූන්ගේ ආස්වාදය ආස්වාද වශයෙන්ද, ආදීනවය ආදීනව වශයෙන්ද, නිස්සරණය නිස්සරණ වශයෙන්ද, යම් කල්හි තත්ත්‍වය පරිදි අවබෝධ කළේද, මහණෙනි, එවිට දෙවියන් සහිත වූද, මරුන් සහිත වූද, බ්‍රහ්මයන් සහිත වූද, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූද, දෙවි මිනිසුන් සහිත වූද මේ ලෝකයෙහි නිරුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ බවට මම ප්‍රකාශ කළෙමි. තවද, මට මෙබඳු ඥානයක් හා දර්ශනයක් පහළ විය: ‘මගේ විමුක්තිය අකම්ප්‍යය, මෙය අවසාන ඉපදීමයි, නැවත භවයක් නොමැත.’",
      "paliTitle": "Acariṃsuttaṃ",
      "englishTitle": "Wandering Sutta",
      "sinhalaTitle": "අචරිං සූත්‍රය"
    },
    {
      "number": 117,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘no cedaṃ, bhikkhave, pathavīdhātuyā assādo abhavissa, nayidaṃ sattā pathavīdhātuyā sārajjeyyuṃ. Yasmā ca kho, bhikkhave, atthi pathavīdhātuyā assādo, tasmā sattā pathavīdhātuyā sārajjanti. No cedaṃ, bhikkhave, pathavīdhātuyā ādīnavo abhavissa, nayidaṃ sattā pathavīdhātuyā nibbindeyyuṃ. Yasmā ca kho, bhikkhave, atthi pathavīdhātuyā ādīnavo, tasmā sattā pathavīdhātuyā nibbindanti. No cedaṃ, bhikkhave, pathavīdhātuyā nissaraṇaṃ abhavissa, nayidaṃ sattā pathavīdhātuyā nissareyyuṃ. Yasmā ca kho, bhikkhave, atthi pathavīdhātuyā nissaraṇaṃ, tasmā sattā pathavīdhātuyā nissaranti’’. ‘‘No cedaṃ, bhikkhave, āpodhātuyā assādo abhavissa…pe… no cedaṃ, bhikkhave, tejodhātuyā… pe… no cedaṃ, bhikkhave, vāyodhātuyā assādo abhavissa, nayidaṃ sattā vāyodhātuyā sārajjeyyuṃ. Yasmā ca kho, bhikkhave, atthi vāyodhātuyā assādo, tasmā sattā vāyodhātuyā sārajjanti. No cedaṃ, bhikkhave, vāyodhātuyā ādīnavo abhavissa, nayidaṃ sattā vāyodhātuyā nibbindeyyuṃ. Yasmā ca kho, bhikkhave, atthi vāyodhātuyā ādīnavo, tasmā sattā vāyodhātuyā nibbindanti. No cedaṃ, bhikkhave, vāyodhātuyā nissaraṇaṃ abhavissa, nayidaṃ sattā vāyodhātuyā nissareyyuṃ. Yasmā ca kho, bhikkhave, atthi vāyodhātuyā nissaraṇaṃ, tasmā sattā vāyodhātuyā nissaranti. ‘‘Yāvakīvañcime, bhikkhave, sattā imāsaṃ catunnaṃ dhātūnaṃ assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ na abbhaññaṃsu, neva tāvime bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā vimariyādikatena cetasā vihariṃsu. ‘‘Yato ca kho, bhikkhave, sattā imāsaṃ catunnaṃ dhātūnaṃ assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññaṃsu, atha, bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā vimariyādikatena cetasā viharantī’’ti. Catutthaṃ.",
      "english": "“If, monks, there were no allure in the earth element, then beings would not become enamored of the earth element. But because, monks, there is an allure in the earth element, therefore beings become enamored of the earth element. If, monks, there were no danger in the earth element, then beings would not become disenchanted with the earth element. But because, monks, there is a danger in the earth element, therefore beings become disenchanted with the earth element. If, monks, there were no escape from the earth element, then beings would not escape from the earth element. But because, monks, there is an escape from the earth element, therefore beings escape from the earth element.\n\nIf, monks, there were no allure in the water element, then beings would not become enamored of the water element. But because, monks, there is an allure in the water element, therefore beings become enamored of the water element. If, monks, there were no danger in the water element, then beings would not become disenchanted with the water element. But because, monks, there is a danger in the water element, therefore beings become disenchanted with the water element. If, monks, there were no escape from the water element, then beings would not escape from the water element. But because, monks, there is an escape from the water element, therefore beings escape from the water element. If, monks, there were no allure in the fire element, then beings would not become enamored of the fire element. But because, monks, there is an allure in the fire element, therefore beings become enamored of the fire element. If, monks, there were no danger in the fire element, then beings would not become disenchanted with the fire element. But because, monks, there is a danger in the fire element, therefore beings become disenchanted with the fire element. If, monks, there were no escape from the fire element, then beings would not escape from the fire element. But because, monks, there is an escape from the fire element, therefore beings escape from the fire element. If, monks, there were no allure in the wind element, then beings would not become enamored of the wind element. But because, monks, there is an allure in the wind element, therefore beings become enamored of the wind element. If, monks, there were no danger in the wind element, then beings would not become disenchanted with the wind element. But because, monks, there is a danger in the wind element, therefore beings become disenchanted with the wind element. If, monks, there were no escape from the wind element, then beings would not escape from the wind element. But because, monks, there is an escape from the wind element, therefore beings escape from the wind element.\n\nAs long as, monks, beings did not truly understand the allure of these four elements as allure, their danger as danger, and the escape from them as escape, just so long, monks, these beings — including the world with its deities, Māras, and Brahmās, together with its population of ascetics, brahmins, deities, and humans — did not live unentangled, unyoked, completely liberated, with a mind free from all limitations.\n\nBut when, monks, beings truly understood the allure of these four elements as allure, their danger as danger, and the escape from them as escape, then, monks, these beings — including the world with its deities, Māras, and Brahmās, together with its population of ascetics, brahmins, deities, and humans — lived unentangled, unyoked, completely liberated, with a mind free from all limitations.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක. එහිදී භික්ෂූන් වහන්සේලාට මෙසේ වදාළ සේක:\n\n“මහණෙනි, මේ පඨවි ධාතුවේ ආශ්වාදයක් නොවන්නේ නම්, සත්වයෝ මේ පඨවි ධාතුවේ නොඇලෙන්නාහ. මහණෙනි, යම් හෙයකින් මේ පඨවි ධාතුවේ ආශ්වාදයක් ඇත්තේය, එහෙයින් සත්වයෝ පඨවි ධාතුවේ ඇලෙත්. මහණෙනි, මේ පඨවි ධාතුවේ ආදීනවයක් නොවන්නේ නම්, සත්වයෝ මේ පඨවි ධාතුවේ කලකිරෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ පඨවි ධාතුවේ ආදීනවයක් ඇත්තේය, එහෙයින් සත්වයෝ පඨවි ධාතුවේ කලකිරෙත්. මහණෙනි, මේ පඨවි ධාතුවේ නිස්සරණයක් (මිදීමක්) නොවන්නේ නම්, සත්වයෝ මේ පඨවි ධාතුවෙන් මිදෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ පඨවි ධාතුවේ නිස්සරණයක් ඇත්තේය, එහෙයින් සත්වයෝ පඨවි ධාතුවෙන් මිදෙත්.\n\nමහණෙනි, මේ ආපෝ ධාතුවේ ආශ්වාදයක් නොවන්නේ නම්, සත්වයෝ මේ ආපෝ ධාතුවේ නොඇලෙන්නාහ. මහණෙනි, යම් හෙයකින් මේ ආපෝ ධාතුවේ ආශ්වාදයක් ඇත්තේය, එහෙයින් සත්වයෝ ආපෝ ධාතුවේ ඇලෙත්. මහණෙනි, මේ ආපෝ ධාතුවේ ආදීනවයක් නොවන්නේ නම්, සත්වයෝ මේ ආපෝ ධාතුවේ කලකිරෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ ආපෝ ධාතුවේ ආදීනවයක් ඇත්තේය, එහෙයින් සත්වයෝ ආපෝ ධාතුවේ කලකිරෙත්. මහණෙනි, මේ ආපෝ ධාතුවේ නිස්සරණයක් නොවන්නේ නම්, සත්වයෝ මේ ආපෝ ධාතුවෙන් මිදෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ ආපෝ ධාතුවේ නිස්සරණයක් ඇත්තේය, එහෙයින් සත්වයෝ ආපෝ ධාතුවෙන් මිදෙත්.\n\nමහණෙනි, මේ තේජෝ ධාතුවේ ආශ්වාදයක් නොවන්නේ නම්, සත්වයෝ මේ තේජෝ ධාතුවේ නොඇලෙන්නාහ. මහණෙනි, යම් හෙයකින් මේ තේජෝ ධාතුවේ ආශ්වාදයක් ඇත්තේය, එහෙයින් සත්වයෝ තේජෝ ධාතුවේ ඇලෙත්. මහණෙනි, මේ තේජෝ ධාතුවේ ආදීනවයක් නොවන්නේ නම්, සත්වයෝ මේ තේජෝ ධාතුවේ කලකිරෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ තේජෝ ධාතුවේ ආදීනවයක් ඇත්තේය, එහෙයින් සත්වයෝ තේජෝ ධාතුවේ කලකිරෙත්. මහණෙනි, මේ තේජෝ ධාතුවේ නිස්සරණයක් නොවන්නේ නම්, සත්වයෝ මේ තේජෝ ධාතුවෙන් මිදෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ තේජෝ ධාතුවේ නිස්සරණයක් ඇත්තේය, එහෙයින් සත්වයෝ තේජෝ ධාතුවෙන් මිදෙත්.\n\nමහණෙනි, මේ වායෝ ධාතුවේ ආශ්වාදයක් නොවන්නේ නම්, සත්වයෝ මේ වායෝ ධාතුවේ නොඇලෙන්නාහ. මහණෙනි, යම් හෙයකින් මේ වායෝ ධාතුවේ ආශ්වාදයක් ඇත්තේය, එහෙයින් සත්වයෝ වායෝ ධාතුවේ ඇලෙත්. මහණෙනි, මේ වායෝ ධාතුවේ ආදීනවයක් නොවන්නේ නම්, සත්වයෝ මේ වායෝ ධාතුවේ කලකිරෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ වායෝ ධාතුවේ ආදීනවයක් ඇත්තේය, එහෙයින් සත්වයෝ වායෝ ධාතුවේ කලකිරෙත්. මහණෙනි, මේ වායෝ ධාතුවේ නිස්සරණයක් නොවන්නේ නම්, සත්වයෝ මේ වායෝ ධාතුවෙන් මිදෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ වායෝ ධාතුවේ නිස්සරණයක් ඇත්තේය, එහෙයින් සත්වයෝ වායෝ ධාතුවෙන් මිදෙත්.\n\nමහණෙනි, යම්තාක් කල් මේ සත්වයෝ මේ සතර මහා ධාතූන්ගේ ආශ්වාදය ආශ්වාද වශයෙන්ද, ආදීනවය ආදීනව වශයෙන්ද, නිස්සරණය නිස්සරණ වශයෙන්ද, ඇති සැටියෙන් අවබෝධ නොකළාහුද, මහණෙනි, ඒතාක් කල් මේ සත්වයෝ දෙවියන් සහිත වූ ලෝකයාගෙන්ද, මරුන් සහිත වූ ලෝකයාගෙන්ද, බඹුන් සහිත වූ ලෝකයාගෙන්ද, ශ්‍රමණයින් හා බ්‍රාහ්මණයින් සහිත වූ ප්‍රජාවගෙන්ද, දෙවියන් හා මනුෂ්‍යයන් සහිත වූ ලෝකයාගෙන්ද නොමිදුනාහුද, වෙන් නො වූවාහුද, සම්පූර්ණයෙන් නිදහස් නො වූවාහුද, සීමා රහිත සිතින් වාසය නො කළාහුද වෙත්.\n\nමහණෙනි, යම් කලක මේ සත්වයෝ මේ සතර මහා ධාතූන්ගේ ආශ්වාදය ආශ්වාද වශයෙන්ද, ආදීනවය ආදීනව වශයෙන්ද, නිස්සරණය නිස්සරණ වශයෙන්ද, ඇති සැටියෙන් අවබෝධ කළාහුද, මහණෙනි, එවිට මේ සත්වයෝ දෙවියන් සහිත වූ ලෝකයාගෙන්ද, මරුන් සහිත වූ ලෝකයාගෙන්ද, බඹුන් සහිත වූ ලෝකයාගෙන්ද, ශ්‍රමණයින් හා බ්‍රාහ්මණයින් සහිත වූ ප්‍රජාවගෙන්ද, දෙවියන් හා මනුෂ්‍යයන් සහිත වූ ලෝකයාගෙන්ද මිදුනාහුද, වෙන් වූවාහුද, සම්පූර්ණයෙන් නිදහස් වූවාහුද, සීමා රහිත සිතින් වාසය කරත්.”",
      "paliTitle": "Nocedaṃsuttaṃ",
      "englishTitle": "If This Were Not Sutta",
      "sinhalaTitle": "නොචේදං සූත්‍රය"
    },
    {
      "number": 118,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘pathavīdhātu ce [ca (sī. syā. kaṃ.)] hidaṃ, bhikkhave, ekantadukkhā abhavissa dukkhānupatitā dukkhāvakkantā anavakkantā sukhena, nayidaṃ sattā pathavīdhātuyā sārajjeyyuṃ. Yasmā ca kho, bhikkhave, pathavīdhātu sukhā sukhānupatitā sukhāvakkantā anavakkantā dukkhena, tasmā sattā pathavīdhātuyā sārajjanti’’. ‘‘Āpodhātu ce hidaṃ, bhikkhave…pe… tejodhātu ce hidaṃ, bhikkhave… vāyodhātu ce hidaṃ, bhikkhave, ekantadukkhā abhavissa dukkhānupatitā dukkhāvakkantā anavakkantā sukhena, nayidaṃ sattā vāyodhātuyā sārajjeyyuṃ. Yasmā ca kho, bhikkhave, vāyodhātu sukhā sukhānupatitā sukhāvakkantā anavakkantā dukkhena, tasmā sattā vāyodhātuyā sārajjanti. ‘‘Pathavīdhātu ce hidaṃ, bhikkhave, ekantasukhā abhavissa sukhānupatitā sukhāvakkantā anavakkantā dukkhena, nayidaṃ sattā pathavīdhātuyā nibbindeyyuṃ. Yasmā ca kho, bhikkhave, pathavīdhātu dukkhā dukkhānupatitā dukkhāvakkantā anavakkantā sukhena, tasmā sattā pathavīdhātuyā nibbindanti. ‘‘Āpodhātu ce hidaṃ, bhikkhave…pe… tejodhātu ce hidaṃ, bhikkhave… vāyodhātu ce hidaṃ, bhikkhave, ekantasukhā abhavissa sukhānupatitā sukhāvakkantā anavakkantā dukkhena, nayidaṃ sattā vāyodhātuyā nibbindeyyuṃ. Yasmā ca kho, bhikkhave, vāyodhātu dukkhā dukkhānupatitā dukkhāvakkantā anavakkantā sukhena, tasmā sattā vāyodhātuyā nibbindantī’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, if this earth element were exclusively suffering, pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, then beings would not lust after the earth element. But because, bhikkhus, the earth element has pleasure, is pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, therefore beings lust after the earth element. If this water element were exclusively suffering, pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, then beings would not lust after the water element. But because, bhikkhus, the water element has pleasure, is pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, therefore beings lust after the water element. If this fire element were exclusively suffering, pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, then beings would not lust after the fire element. But because, bhikkhus, the fire element has pleasure, is pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, therefore beings lust after the fire element. If this air element were exclusively suffering, pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, then beings would not lust after the air element. But because, bhikkhus, the air element has pleasure, is pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, therefore beings lust after the air element.\n\nBhikkhus, if this earth element were exclusively pleasurable, pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, then beings would not become dispassionate towards the earth element. But because, bhikkhus, the earth element has suffering, is pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, therefore beings become dispassionate towards the earth element. If this water element were exclusively pleasurable, pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, then beings would not become dispassionate towards the water element. But because, bhikkhus, the water element has suffering, is pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, therefore beings become dispassionate towards the water element. If this fire element were exclusively pleasurable, pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, then beings would not become dispassionate towards the fire element. But because, bhikkhus, the fire element has suffering, is pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, therefore beings become dispassionate towards the fire element. If this air element were exclusively pleasurable, pervaded by pleasure, overwhelmed by pleasure, and not overwhelmed by suffering, then beings would not become dispassionate towards the air element. But because, bhikkhus, the air element has suffering, is pervaded by suffering, overwhelmed by suffering, and not overwhelmed by pleasure, therefore beings become dispassionate towards the air element.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක.\n\nමහණෙනි, මේ පඨවි ධාතුව ඒකාන්තයෙන්ම දුක් සහිත වූයේ නම්, දුකෙන් වෙළී, දුකෙන් පීඩිතව, සුවයෙන් පීඩිත නොවී පැවතියේ නම්, සත්වයෝ පඨවි ධාතුව කෙරෙහි නොඇලෙන්නාහ. මහණෙනි, යම් හෙයකින් මේ පඨවි ධාතුව සැප සහිත වීද, සුවයෙන් වෙළී, සුවයෙන් පීඩිතව, දුකෙන් පීඩිත නොවී පවතීද, එහෙයින් සත්වයෝ පඨවි ධාතුව කෙරෙහි ඇලෙති.\n\nමහණෙනි, මේ ආපෝ ධාතුව ද, තේජෝ ධාතුව ද, වායෝ ධාතුව ද ඒකාන්තයෙන්ම දුක් සහිත වූයේ නම්, දුකෙන් වෙළී, දුකෙන් පීඩිතව, සුවයෙන් පීඩිත නොවී පැවතියේ නම්, සත්වයෝ ආපෝ ධාතුව කෙරෙහි, තේජෝ ධාතුව කෙරෙහි, වායෝ ධාතුව කෙරෙහි නොඇලෙන්නාහ. මහණෙනි, යම් හෙයකින් මේ ආපෝ ධාතුව ද, තේජෝ ධාතුව ද, වායෝ ධාතුව ද සැප සහිත වීද, සුවයෙන් වෙළී, සුවයෙන් පීඩිතව, දුකෙන් පීඩිත නොවී පවතීද, එහෙයින් සත්වයෝ ආපෝ ධාතුව කෙරෙහි ද, තේජෝ ධාතුව කෙරෙහි ද, වායෝ ධාතුව කෙරෙහි ද ඇලෙති.\n\nමහණෙනි, මේ පඨවි ධාතුව ඒකාන්තයෙන්ම සැප සහිත වූයේ නම්, සුවයෙන් වෙළී, සුවයෙන් පීඩිතව, දුකෙන් පීඩිත නොවී පැවතියේ නම්, සත්වයෝ පඨවි ධාතුව කෙරෙහි කලකිරෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ පඨවි ධාතුව දුක් සහිත වීද, දුකෙන් වෙළී, දුකෙන් පීඩිතව, සුවයෙන් පීඩිත නොවී පවතීද, එහෙයින් සත්වයෝ පඨවි ධාතුව කෙරෙහි කලකිරෙති.\n\nමහණෙනි, මේ ආපෝ ධාතුව ද, තේජෝ ධාතුව ද, වායෝ ධාතුව ද ඒකාන්තයෙන්ම සැප සහිත වූයේ නම්, සුවයෙන් වෙළී, සුවයෙන් පීඩිතව, දුකෙන් පීඩිත නොවී පැවතියේ නම්, සත්වයෝ ආපෝ ධාතුව කෙරෙහි, තේජෝ ධාතුව කෙරෙහි, වායෝ ධාතුව කෙරෙහි කලකිරෙන්නේ නැත. මහණෙනි, යම් හෙයකින් මේ ආපෝ ධාතුව ද, තේජෝ ධාතුව ද, වායෝ ධාතුව ද දුක් සහිත වීද, දුකෙන් වෙළී, දුකෙන් පීඩිතව, සුවයෙන් පීඩිත නොවී පවතීද, එහෙයින් සත්වයෝ ආපෝ ධාතුව කෙරෙහි ද, තේජෝ ධාතුව කෙරෙහි ද, වායෝ ධාතුව කෙරෙහි ද කලකිරෙති.",
      "paliTitle": "Ekantadukkhasuttaṃ",
      "englishTitle": "Exclusively Painful Sutta",
      "sinhalaTitle": "ඒකන්තදුක්ඛ සූත්‍රය"
    },
    {
      "number": 119,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘yo, bhikkhave, pathavīdhātuṃ abhinandati, dukkhaṃ so abhinandati. Yo dukkhaṃ abhinandati, aparimutto so dukkhasmāti vadāmi. Yo āpodhātuṃ abhinandati…pe… yo tejodhātuṃ… yo vāyodhātuṃ abhinandati, dukkhaṃ so abhinandati. Yo dukkhaṃ abhinandati, aparimutto so dukkhasmāti vadāmi’’. ‘‘Yo ca kho, bhikkhave, pathavīdhātuṃ nābhinandati, dukkhaṃ so nābhinandati. Yo dukkhaṃ nābhinandati, parimutto so dukkhasmāti vadāmi. Yo āpodhātuṃ…pe… yo tejodhātuṃ… yo vāyodhātuṃ nābhinandati, dukkhaṃ so nābhinandati. Yo dukkhaṃ nābhinandati, parimutto so dukkhasmāti vadāmī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, whoever delights in the earth element, he delights in suffering. Whoever delights in suffering, I declare that he is not liberated from suffering. Whoever delights in the water element, he delights in suffering. Whoever delights in the fire element, he delights in suffering. Whoever delights in the wind element, he delights in suffering. Whoever delights in suffering, I declare that he is not liberated from suffering.\n\nBut, monks, whoever does not delight in the earth element, he does not delight in suffering. Whoever does not delight in suffering, I declare that he is liberated from suffering. Whoever does not delight in the water element, he does not delight in suffering. Whoever does not delight in the fire element, he does not delight in suffering. Whoever does not delight in the wind element, he does not delight in suffering. Whoever does not delight in suffering, I declare that he is liberated from suffering.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් කෙනෙක් පඨවි ධාතුව අභිනන්දනය කරයිද, හෙතෙම දුක අභිනන්දනය කරයි. යම් කෙනෙක් දුක අභිනන්දනය කරයිද, හෙතෙම දුකින් නොමිදුණේ යැයි මම කියමි. යම් කෙනෙක් ආපෝ ධාතුව අභිනන්දනය කරයිද, හෙතෙම දුක අභිනන්දනය කරයි. යම් කෙනෙක් දුක අභිනන්දනය කරයිද, හෙතෙම දුකින් නොමිදුණේ යැයි මම කියමි. යම් කෙනෙක් තේජෝ ධාතුව අභිනන්දනය කරයිද, හෙතෙම දුක අභිනන්දනය කරයි. යම් කෙනෙක් දුක අභිනන්දනය කරයිද, හෙතෙම දුකින් නොමිදුණේ යැයි මම කියමි. යම් කෙනෙක් වායෝ ධාතුව අභිනන්දනය කරයිද, හෙතෙම දුක අභිනන්දනය කරයි. යම් කෙනෙක් දුක අභිනන්දනය කරයිද, හෙතෙම දුකින් නොමිදුණේ යැයි මම කියමි.\n\nභික්ෂූන් වහන්ස, යම් කෙනෙක් පඨවි ධාතුව අභිනන්දනය නොකරයිද, හෙතෙම දුක අභිනන්දනය නොකරයි. යම් කෙනෙක් දුක අභිනන්දනය නොකරයිද, හෙතෙම දුකින් මිදුණේ යැයි මම කියමි. යම් කෙනෙක් ආපෝ ධාතුව අභිනන්දනය නොකරයිද, හෙතෙම දුක අභිනන්දනය නොකරයි. යම් කෙනෙක් දුක අභිනන්දනය නොකරයිද, හෙතෙම දුකින් මිදුණේ යැයි මම කියමි. යම් කෙනෙක් තේජෝ ධාතුව අභිනන්දනය නොකරයිද, හෙතෙම දුක අභිනන්දනය නොකරයි. යම් කෙනෙක් දුක අභිනන්දනය නොකරයිද, හෙතෙම දුකින් මිදුණේ යැයි මම කියමි. යම් කෙනෙක් වායෝ ධාතුව අභිනන්දනය නොකරයිද, හෙතෙම දුක අභිනන්දනය නොකරයි. යම් කෙනෙක් දුක අභිනන්දනය නොකරයිද, හෙතෙම දුකින් මිදුණේ යැයි මම කියමි.",
      "paliTitle": "Abhinandasuttaṃ",
      "englishTitle": "Delighting Sutta",
      "sinhalaTitle": "අභිනන්ද සූත්‍රය"
    },
    {
      "number": 120,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘yo, bhikkhave, pathavīdhātuyā uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo rogānaṃ ṭhiti jarāmaraṇassa pātubhāvo. Yo āpodhātuyā…pe… yo tejodhātuyā… yo vāyodhātuyā uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo rogānaṃ ṭhiti jarāmaraṇassa pātubhāvo’’. ‘‘Yo ca kho, bhikkhave, pathavīdhātuyā nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho rogānaṃ vūpasamo jarāmaraṇassa atthaṅgamo. Yo āpodhātuyā…pe… yo tejodhātuyā… yo vāyodhātuyā nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho rogānaṃ vūpasamo jarāmaraṇassa atthaṅgamo’’ti. Sattamaṃ.",
      "english": "Bhikkhus, whatever is the arising, persistence, full manifestation, and appearance of the earth element—that is the arising of suffering, the persistence of diseases, and the appearance of aging and death. Whatever is the arising, persistence, full manifestation, and appearance of the water element—that is the arising of suffering, the persistence of diseases, and the appearance of aging and death. Whatever is the arising, persistence, full manifestation, and appearance of the fire element—that is the arising of suffering, the persistence of diseases, and the appearance of aging and death. Whatever is the arising, persistence, full manifestation, and appearance of the wind element—that is the arising of suffering, the persistence of diseases, and the appearance of aging and death.\n\nBut bhikkhus, whatever is the cessation, pacification, and disappearance of the earth element—that is the cessation of suffering, the pacification of diseases, and the disappearance of aging and death. Whatever is the cessation, pacification, and disappearance of the water element—that is the cessation of suffering, the pacification of diseases, and the disappearance of aging and death. Whatever is the cessation, pacification, and disappearance of the fire element—that is the cessation of suffering, the pacification of diseases, and the disappearance of aging and death. Whatever is the cessation, pacification, and disappearance of the wind element—that is the cessation of suffering, the pacification of diseases, and the disappearance of aging and death.",
      "sinhala": "මහණෙනි, පඨවි ධාතුවේ යම් උත්පාදයක්, ස‍්ථිතියක්, අභිනිර්‍වෘත්තියක්, ප්‍ර‍ාදුර්‍භාවයක් වේද, එය දුකේ උත්පාදයයි, රෝගයන්ගේ ස‍්ථිතියයි, ජරාවෙහිද මරණයෙහිද ප්‍ර‍ාදුර්‍භාවයයි. මහණෙනි, ආපෝ ධාතුවේ යම් උත්පාදයක්, ස‍්ථිතියක්, අභිනිර්‍වෘත්තියක්, ප්‍ර‍ාදුර්‍භාවයක් වේද, එය දුකේ උත්පාදයයි, රෝගයන්ගේ ස‍්ථිතියයි, ජරාවෙහිද මරණයෙහිද ප්‍ර‍ාදුර්‍භාවයයි. මහණෙනි, තේජෝ ධාතුවේ යම් උත්පාදයක්, ස‍්ථිතියක්, අභිනිර්‍වෘත්තියක්, ප්‍ර‍ාදුර්‍භාවයක් වේද, එය දුකේ උත්පාදයයි, රෝගයන්ගේ ස‍්ථිතියයි, ජරාවෙහිද මරණයෙහිද ප්‍ර‍ාදුර්‍භාවයයි. මහණෙනි, වායෝ ධාතුවේ යම් උත්පාදයක්, ස‍්ථිතියක්, අභිනිර්‍වෘත්තියක්, ප්‍ර‍ාදුර්‍භාවයක් වේද, එය දුකේ උත්පාදයයි, රෝගයන්ගේ ස‍්ථිතියයි, ජරාවෙහිද මරණයෙහිද ප්‍ර‍ාදුර්‍භාවයයි.\n\nමහණෙනි, පඨවි ධාතුවේ යම් නිරෝධයක්, වූපශමයක්, අත්තංගමයක් වේද, එය දුකේ නිරෝධයයි, රෝගයන්ගේ වූපශමයයි, ජරාවෙහිද මරණයෙහිද අත්තංගමයයි. මහණෙනි, ආපෝ ධාතුවේ යම් නිරෝධයක්, වූපශමයක්, අත්තංගමයක් වේද, එය දුකේ නිරෝධයයි, රෝගයන්ගේ වූපශමයයි, ජරාවෙහිද මරණයෙහිද අත්තංගමයයි. මහණෙනි, තේජෝ ධාතුවේ යම් නිරෝධයක්, වූපශමයක්, අත්තංගමයක් වේද, එය දුකේ නිරෝධයයි, රෝගයන්ගේ වූපශමයයි, ජරාවෙහිද මරණයෙහිද අත්තංගමයයි. මහණෙනි, වායෝ ධාතුවේ යම් නිරෝධයක්, වූපශමයක්, අත්තංගමයක් වේද, එය දුකේ නිරෝධයයි, රෝගයන්ගේ වූපශමයයි, ජරාවෙහිද මරණයෙහිද අත්තංගමයයි.",
      "paliTitle": "Uppādasuttaṃ",
      "englishTitle": "The Discourse on Arising",
      "sinhalaTitle": "උප්පාද සූත්‍රය"
    },
    {
      "number": 121,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘catasso imā, bhikkhave, dhātuyo. Katamā catasso? Pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā imāsaṃ catunnaṃ dhātūnaṃ assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti, na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā; na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti’’. ‘‘Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā imāsaṃ catunnaṃ dhātūnaṃ assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānanti, te ca kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā; te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these are the four elements. Which four? The earth element, the water element, the fire element, and the wind element.\n\nIndeed, monks, whatever recluses or brahmins do not truly understand as they are the gratification, the danger, and the escape concerning these four elements, these recluses or brahmins are not regarded by me as true recluses among recluses, nor as true brahmins among brahmins. Nor do those venerable ones, having themselves directly known and realized the goal of recluseship or the goal of brahminhood, dwell having actualized and attained it in this very life.\n\nBut whatever recluses or brahmins, monks, do truly understand as they are the gratification, the danger, and the escape concerning these four elements, these recluses or brahmins are regarded by me as true recluses among recluses, and as true brahmins among brahmins. And those venerable ones, having themselves directly known and realized the goal of recluseship and the goal of brahminhood, dwell having actualized and attained it in this very life.",
      "sinhala": "භික්‍ෂූණි, මේ ධාතු සතරක් ඇත. ඒ සතර කවරේද? පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව. භික්‍ෂූණි, යම් කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් මේ ධාතු සතරෙහි ආශ්වාදයද, ආදීනවයද, නිස්සරණයද යථාභූතව නොදනීද, භික්‍ෂූණි, ඔහු මට ශ්‍රමණයන් අතර ශ්‍රමණයෙකු ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයෙකු ලෙසද සම්මත නොවෙති. තවද ඒ ආයුෂ්මත්හු මේ ආත්මභාවයෙහිම තමන් විසින්ම අභිඥාවෙන් සාක්‍ෂාත් කොට, ශ්‍රමණභාවයේ අර්ථය හෝ බ්‍රාහ්මණභාවයේ අර්ථය හෝ ලබමින් නොවසත්.\n\nභික්‍ෂූණි, යම්කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් මේ ධාතු සතරෙහි ආශ්වාදයද, ආදීනවයද, නිස්සරණයද යථාභූතව දනීද, භික්‍ෂූණි, ඔහු මට ශ්‍රමණයන් අතර ශ්‍රමණයෙකු ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයෙකු ලෙසද සම්මත වෙති. තවද ඒ ආයුෂ්මත්හු මේ ආත්මභාවයෙහිදීම තමන් විසින්ම අභිඥාවෙන් සාක්‍ෂාත් කොට, ශ්‍රමණභාවයේ අර්ථයද බ්‍රාහ්මණභාවයේ අර්ථයද ලබමින් වෙසෙති.",
      "paliTitle": "Samaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 122,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘catasso imā, bhikkhave, dhātuyo. Katamā catasso? Pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā imāsaṃ catunnaṃ dhātūnaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti…pe… pajānanti…pe… sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Navamaṃ.",
      "english": "While dwelling at Sāvatthī, the Blessed One said to the bhikkhus: \"Bhikkhus, there are these four elements. Which four? The earth element, the water element, the fire element, and the air element. Whatever ascetics or brahmins, bhikkhus, do not truly understand, as they actually are, the origin, the cessation, the gratification, the drawbacks, and the liberation from these four elements, they are not considered true ascetics among ascetics or true brahmins among brahmins, nor do they dwell having realized by their own direct knowledge the goal of asceticism or brahminhood. But whatever ascetics or brahmins *do* truly understand, as they actually are, the origin, the cessation, the gratification, the drawbacks, and the liberation from these four elements, they *are* considered true ascetics among ascetics or true brahmins among brahmins, and having directly realized them for themselves by direct knowledge, they dwell having attained them.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනාරාමයෙහි අනාථපිණ්ඩික සිටුහුගේ ආරාමයෙහි වැඩ වාසය කරන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: \"මහණෙනි, මේ ධාතු සතරකි. ඒ කවර සතරක්ද යත්: පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන ධාතු සතරයි. මහණෙනි, යම්කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ ධාතු සතරෙහි හටගැනීම ද, නැතිවීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් නොදනිත් ද, ඔවුන් ශ්‍රමණ ධර්මයෙන් හෝ බ්‍රාහ්මණ ධර්මයෙන් ඈත්වූවෝ වෙති. එහෙත් යම් ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ මේ ධාතු සතරෙහි හටගැනීම ද, නැතිවීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් දනිත් ද, ඔවුහු තමන් විසින් ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධයෙන් යුක්තව වාසය කරති.\"",
      "paliTitle": "Dutiyasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The Second Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "දෙවන සමණබ්‍රාහ්මණ සූත්‍රය"
    },
    {
      "number": 123,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pathavīdhātuṃ nappajānanti, pathavīdhātusamudayaṃ nappajānanti, pathavīdhātunirodhaṃ nappajānanti, pathavīdhātunirodhagāminiṃ paṭipadaṃ nappajānanti…pe… āpodhātuṃ nappajānanti… tejodhātuṃ nappajānanti… vāyodhātuṃ nappajānanti, vāyodhātusamudayaṃ nappajānanti, vāyodhātunirodhaṃ nappajānanti, vāyodhātunirodhagāminiṃ paṭipadaṃ nappajānanti, na me te, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā; na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti’’. ‘‘Ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā pathavīdhātuṃ pajānanti, pathavīdhātusamudayaṃ pajānanti, pathavīdhātunirodhaṃ pajānanti, pathavīdhātunirodhagāminiṃ paṭipadaṃ pajānanti… ye ca kho keci, bhikkhave, samaṇā vā brāhmaṇā vā…pe… āpodhātuṃ pajānanti… tejodhātuṃ pajānanti… vāyodhātuṃ pajānanti, vāyodhātusamudayaṃ pajānanti, vāyodhātunirodhaṃ pajānanti, vāyodhātunirodhagāminiṃ paṭipadaṃ pajānanti, te ca kho me, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā; te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Dasamaṃ. Catuttho vaggo. Tassuddānaṃ – Catasso pubbe acariṃ, nocedañca dukkhena ca; Abhinandañca uppādo, tayo samaṇabrāhmaṇāti. ",
      "english": "Monks, whoever among recluses or brahmins do not understand the earth element, do not understand the origin of the earth element, do not understand the cessation of the earth element, do not understand the path leading to the cessation of the earth element; do not understand the water element, its origin, its cessation, or the path leading to its cessation; do not understand the fire element, its origin, its cessation, or the path leading to its cessation; and do not understand the wind element, do not understand the origin of the wind element, do not understand the cessation of the wind element, or do not understand the path leading to the cessation of the wind element—these, Monks, I do not consider true recluses among recluses nor true brahmins among brahmins. Nor do these venerable ones, having themselves realized through direct knowledge and attained the goal of recluseship or the goal of brahminship in this very life, dwell therein.\n\nBut whoever among recluses or brahmins, Monks, do understand the earth element, do understand the origin of the earth element, do understand the cessation of the earth element, and do understand the path leading to the cessation of the earth element; do understand the water element, its origin, its cessation, and the path leading to its cessation; do understand the fire element, its origin, its cessation, and the path leading to its cessation; and do understand the wind element, its origin, its cessation, and the path leading to its cessation—these, Monks, I do consider true recluses among recluses and true brahmins among brahmins. And these venerable ones, having themselves realized through direct knowledge and attained the goal of recluseship and the goal of brahminship in this very life, do dwell therein.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩවසන සේක.\n\nභික්‍ෂූනි, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ පඨවි ධාතුව නොදනිත් ද, පඨවි ධාතුවේ හටගැන්ම නොදනිත් ද, පඨවි ධාතුවේ නැතිවීම නොදනිත් ද, පඨවි ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; ආපෝ ධාතුව නොදනිත් ද, ආපෝ ධාතුවේ හටගැන්ම නොදනිත් ද, ආපෝ ධාතුවේ නැතිවීම නොදනිත් ද, ආපෝ ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; තේජෝ ධාතුව නොදනිත් ද, තේජෝ ධාතුවේ හටගැන්ම නොදනිත් ද, තේජෝ ධාතුවේ නැතිවීම නොදනිත් ද, තේජෝ ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; වායෝ ධාතුව නොදනිත් ද, වායෝ ධාතුවේ හටගැන්ම නොදනිත් ද, වායෝ ධාතුවේ නැතිවීම නොදනිත් ද, වායෝ ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදනිත් ද; භික්‍ෂූනි, මා විසින් ඒ ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද නොසැලකෙත්. එම ආයුෂ්මත්වරු මේ ආත්මභාවයෙහි ම තමන් විසින් අධිඥානයෙන් ප්‍රත්‍යක්‍ෂ කොට ශ්‍රමණ ඵලය හෝ බ්‍රාහ්මණ ඵලය ලබා වසන්නේ ද නැත.\n\nභික්‍ෂූනි, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ පඨවි ධාතුව දනිත් ද, පඨවි ධාතුවේ හටගැන්ම දනිත් ද, පඨවි ධාතුවේ නැතිවීම දනිත් ද, පඨවි ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව දනිත් ද; ආපෝ ධාතුව දනිත් ද, ආපෝ ධාතුවේ හටගැන්ම දනිත් ද, ආපෝ ධාතුවේ නැතිවීම දනිත් ද, ආපෝ ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව දනිත් ද; තේජෝ ධාතුව දනිත් ද, තේජෝ ධාතුවේ හටගැන්ම දනිත් ද, තේජෝ ධාතුවේ නැතිවීම දනිත් ද, තේජෝ ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව දනිත් ද; වායෝ ධාතුව දනිත් ද, වායෝ ධාතුවේ හටගැන්ම දනිත් ද, වායෝ ධාතුවේ නැතිවීම දනිත් ද, වායෝ ධාතුව නැතිවීමට පමුණුවන ප්‍රතිපදාව දනිත් ද; භික්‍ෂූනි, මා විසින් ඒ ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙස ද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙස ද සැලකෙත්. එම ආයුෂ්මත්වරු මේ ආත්මභාවයෙහි ම තමන් විසින් අධිඥානයෙන් ප්‍රත්‍යක්‍ෂ කොට ශ්‍රමණ ඵලය ද බ්‍රාහ්මණ ඵලය ද ලබා වසන්නේ ය.",
      "paliTitle": "Tatiyasamaṇabrāhmaṇasuttaṃ",
      "englishTitle": "The Third Discourse on Ascetics and Brahmins",
      "sinhalaTitle": "තතිය සමණබ්‍රාහ්මණ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Dhātusaṃyuttaṃ samattaṃ.",
    "english": "The Linked Discourses on Elements is complete.",
    "sinhala": "ධාතු සංයුක්තය සමාප්තයි."
  }
}