{
  "id": "sn.2.8",
  "title": {
    "pali": "Lakkhaṇasaṃyuttaṃ",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 202,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā ca lakkhaṇo āyasmā ca mahāmoggallāno [mahāmoggalāno (ka.)] gijjhakūṭe pabbate viharanti. Atha kho āyasmā mahāmoggallāno pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yenāyasmā lakkhaṇo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ lakkhaṇaṃ etadavoca – ‘‘āyāmāvuso [ehi āvuso (syā. kaṃ. ka.)] lakkhaṇa, rājagahaṃ piṇḍāya pavisissāmā’’ti. ‘‘Evamāvuso’’ti kho āyasmā lakkhaṇo āyasmato mahāmoggallānassa paccassosi. Atha kho āyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi. Atha kho āyasmā lakkhaṇo āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘ko nu kho, āvuso moggallāna, hetu ko paccayo sitassa pātukammāyā’’ti? ‘‘Akālo kho, āvuso lakkhaṇa, etassa pañhassa. Bhagavato maṃ santike etaṃ pañhaṃ pucchā’’ti. Atha kho āyasmā ca lakkhaṇo āyasmā ca mahāmoggallāno rājagahe piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā lakkhaṇo āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘idhāyasmā mahāmoggallāno gijjhakūṭā pabbatā orohanto aññatarasmiṃ padese sitaṃ pātvākāsi. Ko nu kho, āvuso moggallāna, hetu ko paccayo sitassa pātukammāyā’’ti? ‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ aṭṭhikasaṅkhalikaṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā phāsuḷantarikāhi vitudenti vitacchenti virājenti [vitudenti (sī.), vitacchenti vibhajenti (pī. ka.)]. Sā sudaṃ aṭṭassaraṃ karoti. Tassa mayhaṃ, āvuso, etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Evarūpopi nāma satto bhavissati! Evarūpopi nāma yakkho bhavissati! Evarūpopi nāma attabhāvapaṭilābho bhavissatī’’’ti!! Atha kho bhagavā bhikkhū āmantesi – ‘‘cakkhubhūtā vata, bhikkhave, sāvakā viharanti; ñāṇabhūtā vata, bhikkhave, sāvakā viharanti, yatra hi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissati. Pubbeva me so, bhikkhave, satto diṭṭho ahosi, api cāhaṃ na byākāsiṃ. Ahañcetaṃ [ahamevetaṃ (sī.)] byākareyyaṃ, pare ca me [pare me (sī.)] na saddaheyyuṃ. Ye me na saddaheyyuṃ, tesaṃ taṃ assa dīgharattaṃ ahitāya dukkhāya. Eso, bhikkhave, satto imasmiṃyeva rājagahe goghātako ahosi. So tassa kammassa vipākena bahūni vassāni bahūni vassasatāni bahūni vassasahassāni bahūni vassasatasahassāni niraye paccitvā tasseva kammassa vipākāvasesena evarūpaṃ attabhāvapaṭilābhaṃ paṭisaṃvedayatī’’ti. (Sabbesaṃ suttantānaṃ eseva peyyālo). Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aṭṭhisuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 203,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ maṃsapesiṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti [virājenti (sī. syā. kaṃ.), vibhajenti (pī. ka.)]. Sā sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe goghātako ahosi…pe…. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pesisuttaṃ"
    },
    {
      "number": 204,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ maṃsapiṇḍaṃ vehāsaṃ gacchantaṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sākuṇiko ahosi…pe…. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Piṇḍasuttaṃ"
    },
    {
      "number": 205,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ nicchaviṃ purisaṃ vehāsaṃ gacchantaṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe orabbhiko ahosi…pe…. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nicchavisuttaṃ"
    },
    {
      "number": 206,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ asilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa te asī uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sūkariko ahosi…pe…. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Asilomasuttaṃ"
    },
    {
      "number": 207,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sattilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa tā sattiyo uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti… pe… eso, bhikkhave, satto imasmiṃyeva rājagahe māgaviko ahosi…pe…. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sattisuttaṃ"
    },
    {
      "number": 208,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ usulomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa te usū uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe kāraṇiko ahosi…pe…. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Usulomasuttaṃ"
    },
    {
      "number": 209,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sūcilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa tā sūciyo uppatitvā uppatitvā tasseva kāye nipatanti. So sudaṃ aṭṭassaraṃ karoti… pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sūto [sārathiko (ka. vinayepi)] ahosi…pe…. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sūcilomasuttaṃ"
    },
    {
      "number": 210,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sūcilomaṃ purisaṃ vehāsaṃ gacchantaṃ. Tassa tā sūciyo sīse pavisitvā mukhato nikkhamanti; mukhe pavisitvā urato nikkhamanti; ure pavisitvā udarato nikkhamanti; udare pavisitvā ūrūhi nikkhamanti; ūrūsu pavisitvā jaṅghāhi nikkhamanti; jaṅghāsu pavisitvā pādehi nikkhamanti; so sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe sūcako ahosi…pe…. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyasūcilomasuttaṃ"
    },
    {
      "number": 211,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ kumbhaṇḍaṃ purisaṃ vehāsaṃ gacchantaṃ. So gacchantopi teva aṇḍe khandhe āropetvā gacchati. Nisīdantopi tesveva aṇḍesu nisīdati. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe gāmakūṭako ahosi…pe…. Dasamaṃ. Paṭhamo vaggo. Tassuddānaṃ – Aṭṭhi pesi ubho gāvaghātakā, Piṇḍo sākuṇiyo nicchavorabbhi; Asi sūkariko sattimāgavi, Usu kāraṇiko sūci sārathi; Yo ca sibbiyati sūcako hi so, Aṇḍabhāri ahu gāmakūṭakoti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Kumbhaṇḍasuttaṃ"
    },
    {
      "number": 212,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ rājagahe veḷuvane. ‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ purisaṃ gūthakūpe sasīsakaṃ nimuggaṃ…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe pāradāriko ahosi…pe…. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sasīsakasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 213,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ purisaṃ gūthakūpe nimuggaṃ ubhohi hatthehi gūthaṃ khādantaṃ…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe duṭṭhabrāhmaṇo ahosi. So kassapassa sammāsambuddhassa pāvacane bhikkhusaṅghaṃ bhattena nimantetvā doṇiyo [doṇiyā (syā. kaṃ. pī. ka.)] gūthassa pūrāpetvā etadavoca – aho bhonto, yāvadatthaṃ bhuñjantu ceva harantu cāti…pe…. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Gūthakhādasuttaṃ"
    },
    {
      "number": 214,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ nicchaviṃ itthiṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karoti…pe… esā, bhikkhave, itthī imasmiṃyeva rājagahe aticārinī ahosi…pe…. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nicchavitthisuttaṃ"
    },
    {
      "number": 215,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ itthiṃ duggandhaṃ maṅguliṃ vehāsaṃ gacchantiṃ. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. Sā sudaṃ aṭṭassaraṃ karoti…pe… esā, bhikkhave, itthī imasmiṃyeva rājagahe ikkhaṇikā ahosi…pe…. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Maṅgulitthisuttaṃ"
    },
    {
      "number": 216,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ itthiṃ uppakkaṃ okiliniṃ okiriniṃ vehāsaṃ gacchantiṃ. Sā sudaṃ aṭṭassaraṃ karoti…pe… esā, bhikkhave, itthī kaliṅgassa rañño aggamahesī ahosi. Sā issāpakatā sapattiṃ aṅgārakaṭāhena okiri…pe…. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Okilinīsuttaṃ"
    },
    {
      "number": 217,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ asīsakaṃ kabandhaṃ [kavandhaṃ (sī. pī.)] vehāsaṃ gacchantaṃ. Tassa ure akkhīni ceva honti mukhañca. Tamenaṃ gijjhāpi kākāpi kulalāpi anupatitvā anupatitvā vitacchenti virājenti. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, satto imasmiṃyeva rājagahe hāriko nāma coraghātako ahosi…pe…. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Asīsakasuttaṃ"
    },
    {
      "number": 218,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ bhikkhuṃ vehāsaṃ gacchantaṃ. Tassa saṅghāṭipi ādittā sampajjalitā sajotibhūtā [sañjotibhūtā (syā. kaṃ.)], pattopi āditto sampajjalito sajotibhūto, kāyabandhanampi ādittaṃ sampajjalitaṃ sajotibhūtaṃ, kāyopi āditto sampajjalito sajotibhūto. So sudaṃ aṭṭassaraṃ karoti…pe… eso, bhikkhave, bhikkhu kassapassa sammāsambuddhassa pāvacane pāpabhikkhu ahosi…pe…. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pāpabhikkhusuttaṃ"
    },
    {
      "number": 219,
      "pali": "‘‘Addasaṃ bhikkhuniṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā…pe… pāpabhikkhunī ahosi…pe…. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pāpabhikkhunīsuttaṃ"
    },
    {
      "number": 220,
      "pali": "‘‘Addasaṃ sikkhamānaṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā…pe… pāpasikkhamānā ahosi…pe…. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pāpasikkhamānasuttaṃ"
    },
    {
      "number": 221,
      "pali": "‘‘Addasaṃ sāmaṇeraṃ vehāsaṃ gacchantaṃ. Tassa saṅghāṭipi ādittā…pe… pāpasāmaṇero ahosi…pe…. Dasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pāpasāmaṇerasuttaṃ"
    },
    {
      "number": 222,
      "pali": "‘‘Idhāhaṃ, āvuso, gijjhakūṭā pabbatā orohanto addasaṃ sāmaṇeriṃ vehāsaṃ gacchantiṃ. Tassā saṅghāṭipi ādittā sampajjalitā sajotibhūtā, pattopi āditto sampajjalito sajotibhūto, kāyabandhanampi ādittaṃ sampajjalitaṃ sajotibhūtaṃ, kāyopi āditto sampajjalito sajotibhūto. Sā sudaṃ aṭṭassaraṃ karoti. Tassa mayhaṃ, āvuso, etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Evarūpopi nāma satto bhavissati! Evarūpopi nāma yakkho bhavissati! Evarūpopi nāma attabhāvapaṭilābho bhavissatī’’’ti!! Atha kho bhagavā bhikkhū āmantesi – ‘‘cakkhubhūtā vata, bhikkhave, sāvakā viharanti; ñāṇabhūtā vata, bhikkhave, sāvakā viharanti, yatra hi nāma sāvako evarūpaṃ ñassati vā dakkhati vā sakkhiṃ vā karissati. Pubbeva me sā, bhikkhave, sāmaṇerī diṭṭhā ahosi. Api cāhaṃ na byākāsiṃ. Ahañcetaṃ byākareyyaṃ, pare ca me na saddaheyyuṃ. Ye me na saddaheyyuṃ, tesaṃ taṃ assa dīgharattaṃ ahitāya dukkhāya. Esā, bhikkhave, sāmaṇerī kassapassa sammāsambuddhassa pāvacane pāpasāmaṇerī ahosi. Sā tassa kammassa vipākena bahūni vassāni bahūni vassasatāni bahūni vassasahassāni bahūni vassasatasahassāni niraye paccitvā tasseva kammassa vipākāvasesena evarūpaṃ attabhāvapaṭilābhaṃ paṭisaṃvedayatī’’ti. Ekādasamaṃ. Dutiyo vaggo. Tassuddānaṃ – Kūpe nimuggo hi so pāradāriko; Gūthakhādi ahu duṭṭhabrāhmaṇo. Nicchavitthi aticārinī ahu; Maṅgulitthi ahu ikkhaṇitthikā. Okilini sapattaṅgārokiri; Sīsacchinno ahu coraghātako. Bhikkhu bhikkhunī sikkhamānā; Sāmaṇero atha sāmaṇerikā. Kassapassa vinayasmiṃ pabbajjaṃ; Pāpakammaṃ kariṃsu tāvadeti. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pāpasāmaṇerīsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Lakkhaṇasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}